{
  "id": "sn.2.10",
  "title": {
    "pali": "Bhikkhusaṃyuttaṃ",
    "english": "The Connected Discourses on Bhikkhus",
    "sinhala": "භික්ෂු සංයුත්තය"
  },
  "sections": [
    {
      "number": 235,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho āyasmā mahāmoggallāno bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahāmoggallānassa paccassosuṃ. Āyasmā mahāmoggallāno etadavoca – ‘‘idha mayhaṃ, āvuso, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘ariyo tuṇhībhāvo, ariyo tuṇhībhāvoti vuccati. Katamo nu kho ariyo tuṇhībhāvo’ti? Tassa mayhaṃ āvuso, etadahosi – ‘idha bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati ariyo tuṇhībhāvo’ti. So khvāhaṃ, āvuso, vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja vihariṃ. Tassa mayhaṃ, āvuso, iminā vihārena viharato vitakkasahagatā saññā manasikārā samudācaranti’’. ‘‘Atha kho maṃ, āvuso, bhagavā iddhiyā upasaṅkamitvā etadavoca – ‘moggallāna, moggallāna, mā, brāhmaṇa, ariyaṃ tuṇhībhāvaṃ pamādo, ariye tuṇhībhāve cittaṃ saṇṭhapehi, ariye tuṇhībhāve cittaṃ ekodibhāvaṃ karohi, ariye tuṇhībhāve cittaṃ samādahā’ti. So khvāhaṃ, āvuso, aparena samayena vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharāmi. Yañhi taṃ, āvuso, sammā vadamāno vadeyya – ‘satthārā anuggahito sāvako mahābhiññataṃ patto’ti, mamaṃ taṃ sammā vadamāno vadeyya – ‘satthārā anuggahito sāvako mahābhiññataṃ patto’’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Sāvatthī, at Jeta's Grove, in Anāthapiṇḍika's Park. There, the Venerable Mahāmoggallāna addressed the bhikkhus, saying: \"Friends, bhikkhus!\" Those bhikkhus replied to the Venerable Mahāmoggallāna, \"Friend!\" The Venerable Mahāmoggallāna said this: \"Here, friends, as I was secluded and withdrawn, a mental reflection arose in me: 'Noble silence, noble silence is spoken of. But what exactly is noble silence?' Then, friends, it occurred to me: 'Here, a bhikkhu, with the stilling of initial application and sustained application, attains and abides in the second jhāna, which has internal confidence and unification of mind, is free of initial application and sustained application, and is born of concentration, with rapture and pleasure. This is called noble silence.' So, friends, with the stilling of initial application and sustained application, I attained and abided in the second jhāna, which has internal confidence and unification of mind, is free of initial application and sustained application, and is born of concentration, with rapture and pleasure. As I was abiding in that dwelling, friends, perceptions and mental formations accompanied by initial application arose in me.\" \"Then, friends, the Blessed One, having approached me through his psychic power, said this: 'Moggallāna, Moggallāna! Do not be heedless of noble silence, brahmin! Establish your mind in noble silence! Unify your mind in noble silence! Concentrate your mind in noble silence!' So, friends, at a later time, with the stilling of initial application and sustained application, I attained and abided in the second jhāna, which has internal confidence and unification of mind, is free of initial application and sustained application, and is born of concentration, with rapture and pleasure. Indeed, friends, if one were to speak rightly, they would say: 'A disciple, aided by the Teacher, has attained great supernormal knowledge,' it is truly of me that one would be speaking rightly when saying: 'A disciple, aided by the Teacher, has attained great supernormal knowledge.'\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනාථපිණ්ඩික සිටුහුගේ ජේතවනාරාමයෙහි වැඩසිටින සේක. එහිදී ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා \"ඇවැත්නි භික්ෂූනි\" යැයි වදාළ සේක. ඒ භික්ෂූහු \"ඇවැත්නි\" යැයි ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්නාහුය. ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: \"ඇවැත්නි, මෙහිලා මම රහසට ගොස් ප්‍රතිසංලීනව සිටි කල්හි, මගේ සිතෙහි මෙවැනි සිතුවිල්ලක් පහළ විය: 'ආර්ය තූෂ්ණීම්භාවය, ආර්ය තූෂ්ණීම්භාවය යැයි කියනු ලැබේ. මේ ආර්ය තූෂ්ණීම්භාවය නම් කුමක්ද?' කියා. ඇවැත්නි, එවිට මට මෙසේ සිතුණි: 'මෙහිලා භික්ෂුවක් විතර්ක විචාරයන් සංසිඳවීමෙන්, සිතේ අභ්‍යන්තර පැහැදීමක්, සිතේ එකඟබවක් ඇතිකරගෙන, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් උපන් ප්‍රීතිය හා සැපය ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. මෙය ආර්ය තූෂ්ණීම්භාවය යැයි කියනු ලැබේ' කියා. ඇවැත්නි, ඒ මම විතර්ක විචාරයන් සංසිඳවීමෙන්, සිතේ අභ්‍යන්තර පැහැදීමක්, සිතේ එකඟබවක් ඇතිකරගෙන, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් උපන් ප්‍රීතිය හා සැපය ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කළෙමි. ඇවැත්නි, ඒ මම මේ විහරණයෙන් වාසය කරන කල්හි විතර්කයන් හා එක් වූ සංඥාවෝ හා මනසිකාරයෝ නැවත පහළ වූහ.\" \"ඇවැත්නි, එවිට මා වෙත භාග්‍යවතුන් වහන්සේ සෘද්ධියෙන් වැඩමවා මෙය වදාළ සේක: 'මොග්ගල්ලාන, මොග්ගල්ලාන, බ්‍රාහ්මණය, ආර්ය තූෂ්ණීම්භාවයෙහි පමා නොවන්න. ආර්ය තූෂ්ණීම්භාවයෙහි සිත පිහිටුවන්න. ආර්ය තූෂ්ණීම්භාවයෙහි සිත එකඟ කරන්න. ආර්ය තූෂ්ණීම්භාවයෙහි සිත සමාධිමත් කරන්න' කියා.\" \"ඇවැත්නි, ඒ මම පසුව විතර්ක විචාරයන් සංසිඳවීමෙන්, සිතේ අභ්‍යන්තර පැහැදීමක්, සිතේ එකඟබවක් ඇතිකරගෙන, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් උපන් ප්‍රීතිය හා සැපය ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරමි. ඇවැත්නි, යමෙක් නිවැරදිව කියන්නේ නම්: 'ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහත් අභිඥා ලැබීමට සමත් විය' කියාය, ඔහු මා පිළිබඳව නිවැරදිව කියන්නේ: 'ශාස්තෲන් වහන්සේ විසින් අනුග්‍රහ කරන ලද ශ්‍රාවකයෙක් මහත් අභිඥා ලැබීමට සමත් විය' කියාය.\" පළමු වන සූත්‍රයයි.",
      "paliTitle": "Kolitasuttaṃ",
      "vagga": "",
      "englishTitle": "To Kolita Sutta",
      "sinhalaTitle": "කෝලිත සූත්‍රය"
    },
    {
      "number": 236,
      "pali": "Sāvatthiyaṃ viharati. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Idha mayhaṃ, āvuso, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘atthi nu kho taṃ kiñci lokasmiṃ yassa me vipariṇāmaññathābhāvā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’ti? Tassa mayhaṃ, āvuso, etadahosi – ‘natthi kho taṃ kiñci lokasmiṃ yassa me vipariṇāmaññathābhāvā uppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’’ti. Evaṃ vutte, āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca – ‘‘satthupi kho te, āvuso sāriputta, vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti? ‘‘Satthupi kho me, āvuso, vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā, api ca me evamassa – ‘mahesakkho vata, bho, satthā antarahito mahiddhiko mahānubhāvo. Sace hi bhagavā ciraṃ dīghamaddhānaṃ tiṭṭheyya tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’nti. Tathā hi panāyasmato sāriputtassa dīgharattaṃ ahaṅkāramamaṅkāramānānusayā susamūhatā. Tasmā āyasmato sāriputtassa satthupi vipariṇāmaññathābhāvā nuppajjeyyuṃ sokaparidevadukkhadomanassupāyāsā’’ti. Dutiyaṃ.",
      "english": "The Venerable Sariputta was staying at Savatthi. There, indeed, the Venerable Sariputta addressed the monastics, \"Friends, monastics!\" \"Friend!\" those monastics replied to the Venerable Sariputta. The Venerable Sariputta then said this: \"Here, friends, as I was secluded and withdrawn, this thought arose in my mind: 'Is there anything in this world, whose alteration and change would give rise to sorrow, lamentation, physical pain, mental distress, and despair in me?' Then, friends, it occurred to me: 'There is indeed nothing in this world, whose alteration and change would give rise to sorrow, lamentation, physical pain, mental distress, and despair in me.'\"\n\nWhen this was said, the Venerable Ananda said to the Venerable Sariputta, \"Friend Sariputta, would not sorrow, lamentation, physical pain, mental distress, and despair arise in you even from the alteration and change of the Teacher?\"\n\n\"Friend, sorrow, lamentation, physical pain, mental distress, and despair would certainly not arise in me even from the alteration and change of the Teacher. However, I would think thus: 'Indeed, friends, the Teacher, so mighty, has vanished; he was one of great power, great splendor. If the Blessed One were to remain for a long time, for a long duration, that would be for the welfare of many, for the happiness of many, out of compassion for the world, for the benefit, welfare, and happiness of devas and humans.' Indeed, for a long time, the Venerable Sariputta had thoroughly uprooted the latent tendencies of 'I-making,' 'mine-making,' and conceit. Therefore, sorrow, lamentation, physical pain, mental distress, and despair would not arise in the Venerable Sariputta even from the alteration and change of the Teacher.\"",
      "sinhala": "සැවැත්නුවර වැඩවසන සමයෙක. එහිදී ආයුෂ්මත් ශ්‍රී‍්‍රපුත්ත ස්ථවිරයන් වහන්සේ භික්‍ෂූන් අමතා, ‘‘ඇවැත්නි භික්‍ෂූනි’’යි වදාළ සේක. ‘‘ඇවැත්නි’’යි ඒ භික්‍ෂූහු ආයුෂ්මත් ශ්‍රී‍්‍රපුත්ත ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශ්‍රී‍්‍රපුත්ත ස්ථවිරයන් වහන්සේ මෙසේ වදාළ සේක: ‘‘ඇවැත්නි, මෙහි මා හුදෙකලාව, භාවනානුයෝගීව සිටින කල්හි සිතෙහි මෙවන් විතර්කයක් පහළ විය – ‘ලොවෙහි යමක් වෙනස් වීම හෝ අන් ස්වභාවයකට පත්වීම නිසා මට ශෝක, වැළපීම්, දුක්, දොම්නස් හා සුසුම් හෙළීම් ඇති විය හැකි යමක් ඇත්ද?’ කියාය.’’ ‘‘ඇවැත්නි, එවිට මට මෙසේ සිතුණි – ‘ලොවෙහි යමක් වෙනස් වීම හෝ අන් ස්වභාවයකට පත්වීම නිසා මට ශෝක, වැළපීම්, දුක්, දොම්නස් හා සුසුම් හෙළීම් ඇති විය හැකි කිසිවක් ඇත්තටම නැතැයි’ කියාය.’’ මෙසේ කී කල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශ්‍රී‍්‍රපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ වදාළ සේක: ‘‘ඇවැත් ශ්‍රී‍්‍රපුත්ත, ඔබතුමාට ශාස්තෘන් වහන්සේගේ වෙනස් වීම් හෝ අන් ස්වභාවයකට පත්වීම් නිසාද ශෝක, වැළපීම්, දුක්, දොම්නස් හා සුසුම් හෙළීම් ඇති නොවන්නේද?’’ ‘‘ඇවැත්නි, ශාස්තෘන් වහන්සේගේ වෙනස් වීම් හෝ අන් ස්වභාවයකට පත්වීම් නිසාද මට ශෝක, වැළපීම්, දුක්, දොම්නස් හා සුසුම් හෙළීම් ඇති නොවන්නේය. එහෙත් මට මෙසේ සිතුණේය – ‘අහෝ, මහත් ඉසුරුමත්, මහත් සෘද්ධිමත්, මහත් ආනුභාව සම්පන්න වූ ශාස්තෘන් වහන්සේ පිරිනිවන් පා වදාළ සේක. භාග්‍යවතුන් වහන්සේ දීර්ඝ කාලයක්, දිගු කලක් වැඩසිටියේ නම්, එය බොහෝ ජනයාට හිත පිණිස, බොහෝ ජනයාට සුව පිණිස, ලොවට අනුකම්පා පිණිස, දෙවිමිනිසුන්ට වැඩ පිණිස, හිත පිණිස, සුව පිණිස වන්නේය’ කියාය.’’ ‘‘මක්නිසාද යත්, ආයුෂ්මත් ශ්‍රී‍්‍රපුත්ත ස්ථවිරයන් වහන්සේගේ දීර්ඝ කාලයක සිටම අහංකාරය, මමංකාරය සහ මානානුසයයන් මුළුමනින්ම සමූලඝාතනය කර ඇත. එබැවින් ආයුෂ්මත් ශ්‍රී‍්‍රපුත්ත ස්ථවිරයන් වහන්සේට ශාස්තෘන් වහන්සේගේ වෙනස් වීම් හෝ අන් ස්වභාවයකට පත්වීම් නිසාද ශෝක, වැළපීම්, දුක්, දොම්නස් හා සුසුම් හෙළීම් ඇති නොවන්නේය.’’",
      "paliTitle": "Upatissasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Upatissa",
      "sinhalaTitle": "උපතිස්ස සූත්‍රය"
    },
    {
      "number": 237,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā ca sāriputto āyasmā ca mahāmoggallāno rājagahe viharanti veḷuvane kalandakanivāpe ekavihāre. Atha kho āyasmā sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahāmoggallānena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘Vippasannāni kho te, āvuso moggallāna, indriyāni; parisuddho mukhavaṇṇo pariyodāto santena nūnāyasmā mahāmoggallāno ajja vihārena vihāsī’’ti. ‘‘Oḷārikena khvāhaṃ, āvuso, ajja vihārena vihāsiṃ. Api ca, me ahosi dhammī kathā’’ti. ‘‘Kena saddhiṃ panāyasmato mahāmoggallānassa ahosi dhammī kathā’’ti? ‘‘Bhagavatā kho me, āvuso, saddhiṃ ahosi dhammī kathā’’ti. ‘‘Dūre kho, āvuso, bhagavā etarahi sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Kiṃ nu kho, āyasmā, mahāmoggallāno bhagavantaṃ iddhiyā upasaṅkami; udāhu bhagavā āyasmantaṃ mahāmoggallānaṃ iddhiyā upasaṅkamī’’ti? ‘‘Na khvāhaṃ, āvuso, bhagavantaṃ iddhiyā upasaṅkamiṃ; napi maṃ bhagavā iddhiyā upasaṅkami. Api ca, me yāvatā bhagavā ettāvatā dibbacakkhu visujjhi dibbā ca sotadhātu. Bhagavatopi yāvatāhaṃ ettāvatā dibbacakkhu visujjhi dibbā ca sotadhātū’’ti. ‘‘Yathākathaṃ panāyasmato mahāmoggallānassa bhagavatā saddhiṃ ahosi dhammī kathā’’ti? ‘‘Idhāhaṃ, āvuso, bhagavantaṃ etadavocaṃ – ‘āraddhavīriyo āraddhavīriyoti, bhante, vuccati. Kittāvatā nu kho, bhante, āraddhavīriyo hotī’ti? Evaṃ vutte, maṃ, āvuso, bhagavā etadavoca – ‘idha, moggallāna, bhikkhu āraddhavīriyo viharati – kāmaṃ taco ca nhāru ca aṭṭhī ca avasissatu, sarīre upasussatu maṃsalohitaṃ, yaṃ taṃ purisathāmena purisavīriyena purisaparakkamena pattabbaṃ na taṃ apāpuṇitvā vīriyassa saṇṭhānaṃ bhavissatīti. Evaṃ kho, moggallāna, āraddhavīriyo hotī’ti. Evaṃ kho me, āvuso, bhagavatā saddhiṃ ahosi dhammī kathā’’ti. ‘‘Seyyathāpi, āvuso, himavato pabbatarājassa parittā pāsāṇasakkharā yāvadeva upanikkhepanamattāya; evameva kho mayaṃ āyasmato mahāmoggallānassa yāvadeva upanikkhepanamattāya. Āyasmā hi mahāmoggallāno mahiddhiko mahānubhāvo ākaṅkhamāno kappaṃ tiṭṭheyyā’’ti. ‘‘Seyyathāpi, āvuso, mahatiyā loṇaghaṭāya parittā loṇasakkharāya yāvadeva upanikkhepanamattāya; evameva kho mayaṃ āyasmato sāriputtassa yāvadeva upanikkhepanamattāya. Āyasmā hi sāriputto bhagavatā anekapariyāyena thomito vaṇṇito pasattho – ‘‘Sāriputtova paññāya, sīlena upasamena ca; Yopi pāraṅgato bhikkhu, etāvaparamo siyā’’ti. Itiha te ubho mahānāgā aññamaññassa subhāsitaṃ sulapitaṃ samanumodiṃsūti. Tatiyaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's monastery. Now at that time, the Venerable Sāriputta and the Venerable Mahāmoggallāna were staying in Rājagaha, in the Bamboo Grove, the Squirrels' Feeding Ground, in the same dwelling. Then, in the evening, the Venerable Sāriputta, having emerged from seclusion, approached the Venerable Mahāmoggallāna. Having approached, he exchanged friendly greetings with the Venerable Mahāmoggallāna. After exchanging greetings and courteous talk, he sat down to one side. As he sat to one side, the Venerable Sāriputta said to the Venerable Mahāmoggallāna: \"Friend Moggallāna, your faculties are very clear. Your complexion is pure and radiant. Surely the Venerable Mahāmoggallāna has spent the day in a calm state.\" \"Friend, I have spent the day in a physically engaged state. Nevertheless, I had a discussion on the Dhamma.\" \"With whom, then, did the Venerable Mahāmoggallāna have a discussion on the Dhamma?\" \"Friend, I had a discussion on the Dhamma with the Blessed One.\" \"Friend, the Blessed One is presently staying far away in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's monastery. Did the Venerable Mahāmoggallāna approach the Blessed One by means of psychic power, or did the Blessed One approach the Venerable Mahāmoggallāna by means of psychic power?\" \"Friend, I did not approach the Blessed One by means of psychic power, nor did the Blessed One approach me by means of psychic power. Rather, to the extent that the Blessed One was distant from me, to that same extent my divine eye became clear and my divine ear element became clear. And to the extent that I was distant from the Blessed One, to that same extent his divine eye became clear and his divine ear element became clear.\" \"Then how exactly did the Venerable Mahāmoggallāna have a discussion on the Dhamma with the Blessed One?\" \"Here, friend, I said to the Blessed One: ‘“One who has aroused energy, one who has aroused energy,” it is said, venerable sir. To what extent, venerable sir, is one said to have aroused energy?’ When this was said, friend, the Blessed One replied to me: ‘Here, Moggallāna, a bhikkhu dwells with aroused energy, resolving: “Let skin, sinews, and bones remain; let flesh and blood dry up in my body; I will not give up my energy until I have attained what is to be attained by human strength, human energy, human exertion.” It is in this way, Moggallāna, that one has aroused energy.’ It was in this way, friend, that I had a discussion on the Dhamma with the Blessed One.\"\n\n\"Friend, just as a tiny pebble or gravel is merely for placing beside the king of mountains, the Himālaya, even so are we compared to the Venerable Mahāmoggallāna, merely for placing beside him. For the Venerable Mahāmoggallāna is mighty and powerful; if he wished, he could remain for an eon.\"\n\n\"Friend, just as a tiny grain of salt is merely for placing beside a great pot of salt, even so are we compared to the Venerable Sāriputta, merely for placing beside him. For the Venerable Sāriputta has been praised, extolled, and commended by the Blessed One in many ways: 'Sāriputta, in wisdom, virtue, and tranquility, is the very limit, the ultimate standard, even for a bhikkhu who has crossed over to the far shore.' Thus, those two great Nāgas rejoiced in each other's well-spoken and well-uttered words.",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඑකල්හි ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරණුවෝද, ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවෝද, රජගහ නුවර වේළුවනාරාමයෙහි කලන්දක නිවාප නම් ස්ථානයෙහි එකට වාසය කරති. ඉක්බිති ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරණුවෝ සවස් වේලෙහි පටිසල්ලානයෙන් නැගිට ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවන් වැඩසිටි තැනට එළඹියහ; එළඹ, ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවන් සමඟ සතුටු වූහ. සතුටු විය යුතු, සිහි කටයුතු කථා බස් කියා නිමවා එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරණුවෝ ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවන්ට මෙය පැවසූහ: “ඇවැත් මොග්ගල්ලානයනි, ඔබගේ ඉන්ද්‍රියෝ ඉතා ප්‍රසන්නව ඇත; මුහුණෙහි පැහැය පිරිසිදුය, දීප්තිමත්ය. ඇවැත් මහාමොග්ගල්ලාන තෙරණුවෝ අද සන්සුන් විහරණයකින් වාසය කළ බව සැබැව.”\n\n“ඇවැත්නි, මා අද වාසය කළේ ඖදාරික (දළ) විහරණයකින්ය. එහෙත්, මට ධර්ම කථාවක් ඇතිවිය.” “එසේ නම්, ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවන්ට ධර්ම කථාව ඇතිවූයේ කා සමඟද?” “ඇවැත්නි, මට භාග්‍යවතුන් වහන්සේ සමඟ ධර්ම කථාව ඇතිවිය.” “ඇවැත්නි, භාග්‍යවතුන් වහන්සේ දැන් සැවැත් නුවර ජේතවනාරාමයෙහි, අනේපිඬු සිටුහුගේ ආරාමයෙහි දුර වැඩවසන සේක. එසේ නම්, ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වෙතට ඍද්ධියෙන් වැඩි සේක්ද? නැතහොත් භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවන් වෙතට ඍද්ධියෙන් වැඩි සේක්ද?” “ඇවැත්නි, මා භාග්‍යවතුන් වහන්සේ වෙතට ඍද්ධියෙන් ගියේ නැත; භාග්‍යවතුන් වහන්සේද මා වෙතට ඍද්ධියෙන් වැඩියේ නැත. එහෙත්, භාග්‍යවතුන් වහන්සේ සිටින තාක් දුරට මාගේ දිවැස පිරිසිදු විය, දිව්‍ය ශ්‍රවණ ධාතුවද පිරිසිදු විය. මම සිටින තාක් දුරට භාග්‍යවතුන් වහන්සේගේද දිවැස පිරිසිදු විය, දිව්‍ය ශ්‍රවණ ධාතුවද පිරිසිදු විය.” “එසේ නම්, ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ සමඟ ධර්ම කථාව ඇතිවූයේ කෙසේද?” “ඇවැත්නි, මෙහිදී මා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවෙමි: ‘වීරිය අරඹන ලද්දේය, වීරිය අරඹන ලද්දේයැයි, ස්වාමීනි, කියනු ලැබේ. ස්වාමීනි, කොපමණකින් වීරිය අරඹන ලද්දේ වේදැ’යි?” මෙසේ පැවසූ විට, ඇවැත්නි, භාග්‍යවතුන් වහන්සේ මට මෙසේ පැවසූ සේක: ‘මොග්ගල්ලානය, මෙහිලා භික්ෂුව “කැමැත්තක්වා සම, නහර, ඇට ඉතිරි වේවා, ශරීරයෙහි මස් ලේ සිඳී වේවා, පුරුෂ ධෛර්යයෙන්, පුරුෂ වීර්යයෙන්, පුරුෂ පරාක්‍රමයෙන් පැමිණිය යුතු යමක් වේද, එය නොපැමිණ වීර්යයෙහි ස්ථාවරත්වයක් ඇති නොවේවා” යන අධිෂ්ඨානයෙන් යුතුව, ආරම්භ කළ වීර්යයෙන් යුක්තව වාසය කරයි. මොග්ගල්ලානය, මෙසේ වීරිය අරඹන ලද්දේ වේ.’ “ඇවැත්නි, මා හට භාග්‍යවතුන් වහන්සේ සමඟ ධර්ම කථාව ඇතිවූයේ මෙසේය.”\n\n“ඇවැත්නි, යම්සේ හිමාල නම් පර්වත රාජයාට කුඩා ගල් කැබැල්ලක්, යමක් යටින් තැබීමට පමණක් වේද, එපරිද්දෙන්ම අපි ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවන්ට යමක් යටින් තැබීමට පමණක් වන්නෙමු. ආයුෂ්මත් මහාමොග්ගල්ලාන තෙරණුවෝ මහත් ඍද්ධි ඇති, මහානුභාව සම්පන්න වූවෝය. කැමති නම් කල්පයක් පවා සිටිය හැකි සේක.” “ඇවැත්නි, යම්සේ මහත් ලුණු භාජනයකට කුඩා ලුණු කැටයක්, යමක් යටින් තැබීමට පමණක් වේද, එපරිද්දෙන්ම අපි ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරණුවන්ට යමක් යටින් තැබීමට පමණක් වන්නෙමු. ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරණුවෝ භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරින් ප්‍රශංසා කරන ලදහ, වර්ණනා කරන ලදහ, අගය කරන ලදහ – “නුවණින්ද, සිල්වත්කමින්ද, උපශාන්තියෙන්ද ශ්‍රීපුත්‍ර තෙරණුවන් බඳුවූ, පාරට පැමිණි යම් භික්ෂුවක් වේද, ඔහු මේ තරම්ම උසස් කෙනෙක් වේවා!” මෙසේ ඒ මහත් වූ නාගයන් (උතුමන්) දෙදෙනා වහන්සේ එකිනෙකාගේ යහපත් වචන, සුභාෂිත අනුමෝදන් වූ සේක.",
      "paliTitle": "Ghaṭasuttaṃ",
      "vagga": "",
      "englishTitle": "The Pot Sutta",
      "sinhalaTitle": "ඝට සූත්‍රය"
    },
    {
      "number": 238,
      "pali": "Sāvatthiyaṃ viharati. Tena kho pana samayena aññataro navo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyati, na bhikkhūnaṃ veyyāvaccaṃ karoti cīvarakārasamaye. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, aññataro navo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyati, na bhikkhūnaṃ veyyāvaccaṃ karoti cīvarakārasamaye’’ti. Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena taṃ bhikkhuṃ āmantehi ‘satthā taṃ, āvuso, āmantetī’’’ti. ‘‘Evaṃ bhante’’ti kho so bhikkhu bhagavato paṭissutvā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ etadavoca – ‘‘satthā taṃ, āvuso, āmantetī’’ti. ‘‘Evamāvuso’’ti kho so bhikkhu tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho taṃ bhikkhuṃ bhagavā etadavoca – ‘‘saccaṃ kira tvaṃ, bhikkhu, pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisitvā appossukko tuṇhībhūto saṅkasāyasi, na bhikkhūnaṃ veyyāvaccaṃ karosi cīvarakārasamaye’’ti? ‘‘Ahampi kho, bhante, sakaṃ kiccaṃ karomī’’ti. Atha kho bhagavā tassa bhikkhuno cetasā cetoparivitakkamaññāya bhikkhū āmantesi – ‘‘mā kho tumhe, bhikkhave, etassa bhikkhuno ujjhāyittha. Eso kho, bhikkhave, bhikkhu catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī, yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Nayidaṃ sithilamārabbha, nayidaṃ appena thāmasā; Nibbānaṃ adhigantabbaṃ, sabbadukkhappamocanaṃ. ‘‘Ayañca daharo bhikkhu, ayamuttamapuriso; Dhāreti antimaṃ dehaṃ, jetvā māraṃ savāhini’’nti. catutthaṃ;",
      "english": "He was staying in Sāvatthī. Now at that time, a certain new bhikkhu, having returned from his alms round after the meal, entered the monastery and remained secluded, silent, and unconcerned, not performing services for the bhikkhus during the time of making robes. Then indeed, many bhikkhus approached the Blessed One. Having approached and greeted the Blessed One, they sat down to one side. Those bhikkhus, seated to one side, said this to the Blessed One: \"Here, Venerable Sir, a certain new bhikkhu, having returned from his alms round after the meal, entered the monastery and remained secluded, silent, and unconcerned, not performing services for the bhikkhus during the time of making robes.\" Then the Blessed One addressed a certain bhikkhu, saying, \"Come, bhikkhu, on my word, call that bhikkhu and tell him, 'The Teacher, friend, invites you.'\" \"Yes, Venerable Sir,\" that bhikkhu replied to the Blessed One, and approaching that bhikkhu, he said to him, \"The Teacher, friend, invites you.\" \"Yes, friend,\" that bhikkhu replied to that bhikkhu, and approaching the Blessed One, he greeted him and sat down to one side. To that bhikkhu, seated to one side, the Blessed One said, \"Is it true, bhikkhu, that having returned from your alms round after the meal, you entered the monastery and remained secluded, silent, and unconcerned, not performing services for the bhikkhus during the time of making robes?\" \"I too, Venerable Sir, am engaged in my proper spiritual task,\" he replied.\n\nThen the Blessed One, having understood in his mind the mental intention of that bhikkhu, addressed the bhikkhus, saying, \"Bhikkhus, do not grumble about this bhikkhu. This bhikkhu, bhikkhus, is one who gains at will, without difficulty, without trouble, the four jhānas — the higher mental states that provide a pleasant abiding in this very life. He abides having realized by his own direct knowledge, in this very life, that unsurpassed culmination of the spiritual life, for the sake of which noble sons rightly go forth from the household life into homelessness, having made it manifest and attained it.\" The Blessed One said this. Having said this, the Well-gone One, the Teacher, then spoke further:\n\n\"Nibbāna, the liberation from all suffering, is not to be attained by lax effort, nor with little strength.\nAnd this young bhikkhu, this supreme person, bears his final body, having conquered Māra with his army.\"",
      "sinhala": "සැවැත් නුවර වැඩවසයි.\n\nඒ වන විට එක්තරා අලුතෙන් පැවිදි වූ භික්ෂුවක් දානය වැළඳීමෙන් පසුව පිණ්ඩපාතයෙන් ආපසු වැඩමවා විහාරයට පිවිස, උනන්දුවක් නැතිව නිශ්ශබ්දව (තමන්ගේ භාවනා කටයුතුවල) නිරත වෙයි. සිවුරු කප්පවා ගන්නා සමයෙහි භික්ෂූන්ට උපකාරයක් නොකරයි. ඉන්පසු බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹියහ; එළඹ භාග්‍යවතුන් වහන්සේට ආචාර කර එක් පසෙකින් වාඩි වූහ. එක් පසෙකින් වාඩි වී සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ – \"ස්වාමීනි, මෙහි එක්තරා අලුතෙන් පැවිදි වූ භික්ෂුවක් දානය වැළඳීමෙන් පසුව පිණ්ඩපාතයෙන් ආපසු වැඩමවා විහාරයට පිවිස, උනන්දුවක් නැතිව නිශ්ශබ්දව (භාවනා කටයුතුවල) නිරත වෙයි. සිවුරු කප්පවා ගන්නා සමයෙහි භික්ෂූන්ට උපකාරයක් නොකරයි.\"\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ එක්තරා භික්ෂුවක් අමතා වදාළ සේක – \"එම්බා භික්ෂුව, නුඹ ගොස් මගේ වචනයෙන් ඒ භික්ෂුව අමතන්න, ‘ඇවැත්නි, ශාස්තෘන් වහන්සේ ඔබ කැඳවන සේක’ කියා.\" \"එසේය ස්වාමීනි\" යැයි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට පිළිතුරු දී ඒ භික්ෂුව සිටින තැනට එළඹියේය; එළඹ ඒ භික්ෂුවට මෙය පැවසීය – \"ඇවැත්නි, ශාස්තෘන් වහන්සේ ඔබ කැඳවන සේක.\" \"එසේය ඇවැත්නි\" යැයි ඒ භික්ෂුව, ඒ භික්ෂුවට පිළිතුරු දී භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹියේය; එළඹ භාග්‍යවතුන් වහන්සේට ආචාර කර එක් පසෙකින් වාඩි විය.\n\nඑක් පසෙකින් වාඩි වී සිටි ඒ භික්ෂුවට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක – \"ඇත්තෙන්ම භික්ෂුව, නුඹ දානය වැළඳීමෙන් පසුව පිණ්ඩපාතයෙන් ආපසු වැඩමවා විහාරයට පිවිස, උනන්දුවක් නැතිව නිශ්ශබ්දව (භාවනා කටයුතුවල) නිරත වන්නෙහිද? සිවුරු කප්පවා ගන්නා සමයෙහි භික්ෂූන්ට උපකාරයක් නොකරන්නෙහිද?\" \"ස්වාමීනි, මමත් මාගේ (ආධ්‍යාත්මික) කටයුතු කරමි\" යැයි ඒ භික්ෂුව පැවසීය.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ ඒ භික්ෂුවගේ සිත්හි වූ විතර්කයන් (අන්‍ය සිත දැන ගැනීමේ ඤාණයෙන්) දැන භික්ෂූන් අමතා වදාළ සේක – \"මහණෙනි, නුඹලා මේ භික්ෂුවට දොස් නොකියන්න. මහණෙනි, මේ භික්ෂුව උසස් සිතින් යුක්ත වූ, මේ දැහැමි ජීවිතයෙහි සැප විහරණයට හේතුවන සිව් ධ්‍යානයන් කැමැති පරිදි, අපහසුවකින් තොරව, වෙහෙසක් නොමැතිව ලබන්නෙකි. යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැමිණෙත් ද, ඒ අනුත්තර බ්‍රහ්මචර්යාවේ කෙළවර මේ ආත්මභාවය තුළදීම තමන් විසින්ම විශේෂ ඥානයෙන් දැන, ප්‍රත්‍යක්ෂ කර, එළඹ වාසය කරයි.\" භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\nමෙය වදාරා සුගත වූ ශාස්තෘන් වහන්සේ තව දුරටත් මෙය වදාළ සේක –\n\"පහසුවෙන් ඇරඹීමෙන් හෝ ස්වල්ප වීර්යයකින් හෝ සියලු දුකින් මිදීම පිණිස වූ නිවන අවබෝධ කළ නොහැක.\nමේ දහර භික්ෂුව, මේ උතුම් පුරුෂයා මාරයාද, ඔහුගේ සේනාවද පරාජය කර අවසාන ශරීරය දරයි.\"",
      "paliTitle": "Navasuttaṃ",
      "vagga": "",
      "englishTitle": "The Ship Sutta",
      "sinhalaTitle": "නාවා සූත්‍රය"
    },
    {
      "number": 239,
      "pali": "Sāvatthiyaṃ viharati. Atha kho āyasmā sujāto yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ sujātaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘ubhayenevāyaṃ, bhikkhave, kulaputto sobhati – yañca abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajjanti tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Idamavoca bhagavā…pe… satthā – ‘‘Sobhati vatāyaṃ bhikkhu, ujubhūtena cetasā; Vippayutto visaṃyutto, anupādāya nibbuto; Dhāreti antimaṃ dehaṃ, jetvā māraṃ savāhini’’nti. pañcamaṃ;",
      "english": "He was staying in Sāvatthī. Then, indeed, the venerable Sujāta approached the Blessed One. The Blessed One saw the venerable Sujāta approaching from afar. Having seen him, he addressed the monks: “Monks, this young man of good family shines in both ways – both in being handsome, pleasant to behold, inspiring confidence, and endowed with supreme beauty of complexion, and in that, for the sake of which young men of good family rightly go forth from home into homelessness, he lives having personally realized, attained, and dwelt in that unsurpassed culmination of the holy life, here and now in this very life, by his own direct knowledge.”\n\nThe Blessed One said this. The Teacher then spoke:\n“Indeed, this monk shines with a mind made straight;\nDetached and disjoined, unattached and extinguished;\nHe bears his final body, having conquered Māra and his retinue.”",
      "sinhala": "සැවැත් නුවර වැඩසිටින සේක. ඉන්පසු ආයුෂ්මත් සුජාත ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් සුජාත ස්ථවිරයන් වහන්සේ දුරදීම එන අයුරු දැක වදාළ සේක. දැක භික්ෂූන් අමතා වදාළ සේක: ‘‘මහණෙනි, මේ කුලපුත්‍රයා දෙයාකාරයකින්ම ශෝභමාන වෙයි. එනම් යම් හෙයකින් අතිශයින්ම රූප සම්පත්තියෙන්, දැකුම්කළු බවින්, ප්‍රසන්න බවින් හා උසස් වර්ණශෝභාවකින් යුක්ත වන බැවිනි. තවද, යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහිගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට පැමිණෙත් ද, ඒ අනුත්තර බ්‍රහ්මචාරී ජීවිතයේ අවසානය (අරහත් ඵලය) මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් අවබෝධ කොට සාක්ෂාත් කොට එයට පැමිණ වාසය කරන බැවිනි.’’\n\nභාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක. ශාස්තෘන් වහන්සේ මේ අයුරින්ද වදාළ සේක:\n\n‘‘අහෝ, මේ භික්ෂුව ශෝභමාන වෙයි, අවංක වූ සිතකින් යුතුව;\nරාගාදී කෙලෙසුන්ගෙන් වෙන්වූයේ, කාමභවාදී යෝගයන්ගෙන් විසංයෝග වූයේ, උපාදානයන්ගෙන් තොරව නිවී ගියේය;\nසේනාව සමඟ මාරයා පරාජය කොට, මේ අන්තිම ශරීරය දරන්නේය.’’",
      "paliTitle": "Sujātasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Sujāta",
      "sinhalaTitle": "සුජාත සූත්‍රය"
    },
    {
      "number": 240,
      "pali": "Sāvatthiyaṃ viharati. Atha kho āyasmā lakuṇḍakabhaddiyo yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ lakuṇḍakabhaddiyaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, etaṃ bhikkhuṃ āgacchantaṃ dubbaṇṇaṃ duddasikaṃ okoṭimakaṃ bhikkhūnaṃ paribhūtarūpa’’nti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, bhikkhu mahiddhiko mahānubhāvo, na ca sā samāpatti sulabharūpā yā tena bhikkhunā asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Idamavoca bhagavā…pe… satthā – ‘‘Haṃsā koñcā mayūrā ca, hatthayo pasadā migā; Sabbe sīhassa bhāyanti, natthi kāyasmiṃ tulyatā. ‘‘Evameva manussesu, daharo cepi paññavā; So hi tattha mahā hoti, neva bālo sarīravā’’ti. chaṭṭhaṃ;",
      "english": "He was dwelling in Savatthi. Then Venerable Lakundaka Bhaddiya approached the Blessed One. The Blessed One saw Venerable Lakundaka Bhaddiya coming from afar. Having seen him, he addressed the bhikkhus: “Bhikkhus, do you see this bhikkhu coming, ill-favored, unsightly, dwarfish, one who is despised by bhikkhus?”\n\n“Yes, Venerable Sir.”\n\n“Bhikkhus, that bhikkhu is indeed of great psychic power and great majesty. There is no attainment that he has not previously attained, nor is any such attainment difficult for him to achieve. For the sake of which sons of good families rightly go forth from the home life into homelessness—that unsurpassed culmination of the holy life—he dwells having attained it, having directly realized it for himself with direct knowledge in this very life.”\n\nThe Blessed One said this. The Teacher then spoke:\n\n“Swans, cranes, and peacocks,\nElephants, deer, and wild animals—\nAll fear the lion;\nThere is no equality in bodily form with it.\n\nJust so among humans,\nEven if one is young but wise,\nHe is truly great among them,\nNot the foolish one with a large physique.”",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත්නුවර වැඩ වාසය කරන සේක. එවිට ආයුෂ්මත් ලකුණ්ඨකභද්දිය තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. භාග්‍යවතුන් වහන්සේ ඈතින් එන ආයුෂ්මත් ලකුණ්ඨකභද්දිය තෙරණුවන් දුටු සේක. දැක භික්ෂූන් අමතා වදාළ සේක: ‘‘මහණෙනි, එන මේ භික්ෂුව ඔබලා දකින්නේද? ඔහු දුර්වර්ණ ය, දැකීමට අප්‍රිය ය, කොට ය, භික්ෂූන් අතර අවමානයට ලක් වූවෙක් වැන්න.’’ ‘‘එසේ ය, භාග්‍යවතුන් වහන්ස.’’ ‘‘මහණෙනි, මේ භික්ෂුව මහත් ඍද්ධි ඇත, මහත් ආනුභාව ඇත. ඔහු විසින් අත්පත් කර නොගත් කිසිදු සමාපත්තියක් නැත. යම් උතුම් අරමුණක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහිගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට පැමිණෙත් ද, ඒ අනුත්තර බ්‍රහ්මචර්යාවෙහි අවසානය වූ අරහත්වය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරයි.’’ භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ශාස්තෘන් වහන්සේ මෙසේද වදාළ සේක:\n\n‘‘හංසයෝ, කොක්කු, මොණරු ද,\nඇත්තු, පසද මුවෝ ද,\nසියල්ලෝ සිංහයාට බිය වෙති.\nකයින් ඔහුට සමාන කෙනෙක් නැත.\n\nඑපරිද්දෙන්ම මිනිසුන් අතර,\nළාබාල වුවත් යම් කෙනෙක් ප්‍රඥාවන්ත නම්,\nඔහු මහා පුරුෂයෙකි.\nශරීර සම්පත්තිය ඇති නමුත් අඥාන තැනැත්තා\nමහා පුරුෂයෙක් නොවේ.’’",
      "paliTitle": "Lakuṇḍakabhaddiyasuttaṃ",
      "vagga": "",
      "englishTitle": "To Lakuṇḍaka Bhaddiya Sutta",
      "sinhalaTitle": "ලකුණ්ඩකභද්දිය සූත්‍රය"
    },
    {
      "number": 241,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena āyasmā visākho pañcālaputto upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti, poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāya. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘ko nu kho, bhikkhave, upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāyā’’ti? ‘‘Āyasmā, bhante, visākho pañcālaputto upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti, poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā pariyāpannāya anissitāyā’’ti. Atha kho bhagavā āyasmantaṃ visākhaṃ pañcālaputtaṃ āmantesi – ‘‘sādhu sādhu, visākha, sādhu kho tvaṃ, visākha, bhikkhū dhammiyā kathāya sandassesi…pe… atthassa viññāpaniyā pariyāpannāya anissitāyā’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Nābhāsamānaṃ jānanti, missaṃ bālehi paṇḍitaṃ; Bhāsamānañca jānanti, desentaṃ amataṃ padaṃ. ‘‘Bhāsaye jotaye dhammaṃ, paggaṇhe isinaṃ dhajaṃ; Subhāsitadhajā isayo, dhammo hi isinaṃ dhajo’’ti. sattamaṃ;",
      "english": "Thus have I heard. On one occasion, the Blessed One was staying in Vesālī, at the Great Forest, in the Gabled Hall. Now at that time, the venerable Visākha Pañcālaputta was instructing, inspiring, rousing, and gladdening the bhikkhus in the service hall with a discourse on the Dhamma, with articulate, unhesitating speech that was meaningful, penetrative, and unattached.\n\nThen, in the evening, the Blessed One arose from his seclusion and went to the service hall. Having approached, he sat down on the seat prepared for him. Having sat down, the Blessed One addressed the bhikkhus: \"Bhikkhus, who is it in the service hall who is instructing, inspiring, rousing, and gladdening the bhikkhus with a discourse on the Dhamma, with articulate, unhesitating speech that is meaningful, penetrative, and unattached?\" \"Venerable sir, it is the venerable Visākha Pañcālaputta who is instructing, inspiring, rousing, and gladdening the bhikkhus in the service hall with a discourse on the Dhamma, with articulate, unhesitating speech that is meaningful, penetrative, and unattached.\"\n\nThen the Blessed One addressed the venerable Visākha Pañcālaputta: \"Excellent, excellent, Visākha! It is excellent, Visākha, that you are instructing, inspiring, rousing, and gladdening the bhikkhus with a discourse on the Dhamma, with articulate, unhesitating speech that is meaningful, penetrative, and unattached.\" The Blessed One said this. Having said this, the Well-Gone One, the Teacher, further spoke this: \"Not speaking, the wise one mixed with fools is not recognized; but speaking, they recognize him as one who teaches the deathless state. One should speak and illuminate the Dhamma, and uphold the banner of the sages. Sages have well-spoken words as their banner; for indeed, the Dhamma is the banner of the sages.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි මහාවනයෙහි කූටාගාර ශාලාවෙහි වැඩවසන සේක. ඒ වන විට ආයුෂ්මත් පංචාලපුත්‍ර විශාඛ තෙරුන් වහන්සේ උපස්ථාන ශාලාවෙහිදී භික්ෂූන් වහන්සේලාට සාමාන්‍ය ව්‍යවහාර භාෂාවෙන්, පැහැදිලිව, අවහිරයකින් තොරව, අර්ථය පහදා දෙන, ධර්මයට අදාළ වූ, කිසිදු බැඳීමකින් තොර වූ ධර්ම කථාවකින් ධර්මය පෙන්වා දෙමින්, සමාදන් කරවමින්, උද්දීපනය කරවමින්, සතුටු කරවමින් සිටියහ. එවිට භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි භාවනා සමාපත්තියෙන් නැගිට යම් තැනක උපස්ථාන ශාලාව තිබුණේද, ඒ දෙසට වැඩම කළ සේක; වැඩම කර පනවන ලද ආසනයක වැඩහුන් සේක. වැඩහිඳගත් භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කළ සේක: ‘‘මහණෙනි, උපස්ථාන ශාලාවෙහිදී භික්ෂූන් වහන්සේලාට සාමාන්‍ය ව්‍යවහාර භාෂාවෙන්, පැහැදිලිව, අවහිරයකින් තොරව, අර්ථය පහදා දෙන, ධර්මයට අදාළ වූ, කිසිදු බැඳීමකින් තොර වූ ධර්ම කථාවකින් ධර්මය පෙන්වා දෙමින්, සමාදන් කරවමින්, උද්දීපනය කරවමින්, සතුටු කරවමින් සිටින්නේ කවරෙක්දැ?”යි. ‘‘ස්වාමීනි, උපස්ථාන ශාලාවෙහිදී භික්ෂූන් වහන්සේලාට සාමාන්‍ය ව්‍යවහාර භාෂාවෙන්, පැහැදිලිව, අවහිරයකින් තොරව, අර්ථය පහදා දෙන, ධර්මයට අදාළ වූ, කිසිදු බැඳීමකින් තොර වූ ධර්ම කථාවකින් ධර්මය පෙන්වා දෙමින්, සමාදන් කරවමින්, උද්දීපනය කරවමින්, සතුටු කරවමින් සිටින්නේ ආයුෂ්මත් පංචාලපුත්‍ර විශාඛ තෙරුන් වහන්සේයි”යි. එවිට භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් පංචාලපුත්‍ර විශාඛ තෙරුන් වහන්සේට ආමන්ත්‍රණය කළ සේක: ‘‘සාදු සාදු, විශාඛය. විශාඛය, ඔබ භික්ෂූන් වහන්සේලාට සාමාන්‍ය ව්‍යවහාර භාෂාවෙන්, පැහැදිලිව, අවහිරයකින් තොරව, අර්ථය පහදා දෙන, ධර්මයට අදාළ වූ, කිසිදු බැඳීමකින් තොර වූ ධර්ම කථාවකින් ධර්මය පෙන්වා දෙමින්, සමාදන් කරවමින්, උද්දීපනය කරවමින්, සතුටු කරවමින් සිටින්නේ ඉතා යහපත් ක්‍රියාවකි”යි.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාරා අනතුරු ව මෙයද වදාළ සේක:\n\nධර්මය නොදෙසන විට, බාලයන් හා මිශ්‍රව සිටින පණ්ඩිතයා (කවුදැයි) නොදනිති.\nඑහෙත් අමා නිවන් පදය දේශනා කරන විට, ඔහු දනිති.\n\nධර්මය දේශනා කළ යුතුය; ධර්මය ප්‍රකට කළ යුතුය; ඍෂිවරුන්ගේ ධජය ඔසවා තැබිය යුතුය.\nඍෂිවරුන්ට සුභාෂිත ධර්මය ධජය කොට ඇත්තේය. මක්නිසාද යත්, ධර්මයම ඍෂිවරුන්ගේ ධජය වන්නේය.",
      "paliTitle": "Visākhasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Visākha",
      "sinhalaTitle": "විසාඛ සූත්‍රය"
    },
    {
      "number": 242,
      "pali": "Sāvatthiyaṃ viharati. Atha kho āyasmā nando bhagavato mātucchāputto ākoṭitapaccākoṭitāni cīvarāni pārupitvā akkhīni añjetvā acchaṃ pattaṃ gahetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ nandaṃ bhagavā etadavoca – ‘‘na kho te taṃ, nanda, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ ākoṭitapaccākoṭitāni cīvarāni pārupeyyāsi, akkhīni ca añjeyyāsi, acchañca pattaṃ dhāreyyāsi. Etaṃ kho te, nanda, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ āraññiko ca assasi, piṇḍapātiko ca paṃsukuliko ca kāmesu ca anapekkho vihareyyāsī’’ti. Idamavoca bhagavā…pe… satthā – ‘‘Kadāhaṃ nandaṃ passeyyaṃ, āraññaṃ paṃsukūlikaṃ; Aññātuñchena yāpentaṃ, kāmesu anapekkhina’’nti. Atha kho āyasmā nando aparena samayena āraññiko ca piṇḍapātiko ca paṃsukūliko ca kāmesu ca anapekkho vihāsīti. Aṭṭhamaṃ.",
      "english": "The Blessed One was dwelling in Sāvatthī. Then, the Venerable Nanda, the Blessed One's half-brother, having put on well-pressed robes, applied eye-salve to his eyes, and taken a polished bowl, approached where the Blessed One was. Having approached, he bowed to the Blessed One and sat down to one side.\n\nTo the Venerable Nanda, who was sitting to one side, the Blessed One said this: \"Nanda, it is not proper for a noble son who has gone forth from the home life into homelessness out of faith, that you should wear well-pressed robes, apply eye-salve to your eyes, and carry a polished bowl. Instead, Nanda, this is proper for a noble son who has gone forth from home into homelessness out of faith: that you should be a forest dweller, a beggar for alms, a rag-robe wearer, and live without longing for sensual pleasures.\" The Blessed One, the Teacher, spoke this: \"When shall I see Nanda, a forest dweller, a rag-robe wearer, living by gleaning from unknown sources, without longing for sensual pleasures?\"\n\nThen, some time later, the Venerable Nanda dwelt as a forest dweller, a beggar for alms, a rag-robe wearer, and without longing for sensual pleasures.",
      "sinhala": "ශ්‍රාවස්තියෙහි වැඩසිටින සේක.\n\nඑසමයෙහි, භාග්‍යවතුන් වහන්සේගේ මවගේ සහෝදරියගේ පුත්‍ර වූ ආයුෂ්මත් නන්ද ස්ථවිරයන් වහන්සේ, මනාව සකස් කරන ලද සිවුරු පොරවා, ඇස් අඳුන් ගා, පිරිසිදු පාත්‍රයක් ගෙන, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩසිටි ආයුෂ්මත් නන්ද ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “නන්දය, ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වූ කුලපුත්‍රයාට, ඔබ මනාව සකස් කළ සිවුරු පොරවා, ඇස් අඳුන් ගා, පිරිසිදු පාත්‍රයක් දැරීම සුදුසු නොවේ. නන්දය, ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වූ කුලපුත්‍රයාට නම්, ඔබ ආරණ්‍යකව වාසය කිරීමද, පිණ්ඩපාතිකව වාසය කිරීමද, පංසുകൂලිකව වාසය කිරීමද, කාමයන් කෙරෙහි අපේක්ෂා රහිතව වාසය කිරීමද සුදුසුය.”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ශාස්තෘන් වහන්සේ නැවතත් මෙසේ වදාළ සේක:\n“කවර කලකද මම, ආරණ්‍යකව වාසය කරන්නාවූ, පංසുകൂලික වූ,\nනොදන්නා ස්ථානයකින් ලැබෙන දෙයින් යැපෙන්නාවූ, කාමයන් කෙරෙහි අපේක්ෂා රහිත වූ නන්දයන් දකිම්.”\n\nඉක්බිති ආයුෂ්මත් නන්ද ස්ථවිරයන් වහන්සේ වෙනත් කලෙක, ආරණ්‍යකවද, පිණ්ඩපාතිකවද, පංසുകൂලිකවද, කාමයන් කෙරෙහි අපේක්ෂා රහිතවද වාසය කළ සේක.\n\nඅටවැනි සූත්‍රයයි.",
      "paliTitle": "Nandasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Nanda",
      "sinhalaTitle": "නන්ද සූත්‍රය"
    },
    {
      "number": 243,
      "pali": "Sāvatthiyaṃ viharati. Atha kho āyasmā tisso bhagavato pitucchāputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi dukkhī dummano assūni pavattayamāno. Atha kho bhagavā āyasmantaṃ tissaṃ etadavoca – ‘‘kiṃ nu kho tvaṃ, tissa, ekamantaṃ nisinno dukkhī dummano assūni pavattayamāno’’ti? ‘‘Tathā hi pana maṃ, bhante, bhikkhū samantā vācāsannitodakena [vācāya sannitodakena (ka.)] sañjambharimakaṃsū’’ti [sañjabbharimakaṃsūti (?)]. ‘‘Tathāhi pana tvaṃ, tissa, vattā no ca vacanakkhamo; na kho te taṃ, tissa, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa, yaṃ tvaṃ vattā no ca vacanakkhamo. Etaṃ kho te, tissa, patirūpaṃ kulaputtassa saddhā agārasmā anagāriyaṃ pabbajitassa – ‘yaṃ tvaṃ vattā ca assa vacanakkhamo cā’’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Kiṃ nu kujjhasi mā kujjhi, akkodho tissa te varaṃ; Kodhamānamakkhavinayatthañhi, tissa brahmacariyaṃ vussatī’’ti. navamaṃ;",
      "english": "He was dwelling at Sāvatthī.\n\nNow then, Venerable Tissa, the Blessed One's paternal aunt's son, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side, distressed, dejected, and shedding tears.\n\nThen the Blessed One said to Venerable Tissa, \"Why indeed, Tissa, are you sitting to one side, distressed, dejected, and shedding tears?\"\n\n\"It is so, Venerable Sir, because the monks all around have ridiculed me with stinging words.\"\n\n\"Indeed, Tissa, you are one who speaks but is not tolerant of speech. That is not fitting for you, Tissa, for a noble son who has gone forth from home to homelessness out of faith, that you are one who speaks but is not tolerant of speech.\"\n\n\"This indeed, Tissa, is fitting for you, for a noble son who has gone forth from home to homelessness out of faith: that you should be both a speaker and tolerant of speech.\"\n\nThe Blessed One said this. Having said this, the Fortunate One, the Teacher, further said:\n\n\"Why indeed do you get angry? Do not get angry. Non-anger, Tissa, is superior for you. Indeed, Tissa, the holy life is lived for the purpose of subduing anger, conceit, and disparagement.\"",
      "sinhala": "සැවැත්නුවර වැඩසිටින සේක. එසමයෙහි, ආයුෂ්මත් තිස්ස නම් භාග්‍යවතුන් වහන්සේගේ පියාගේ නැගණියගේ පුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව දුකින්, සිත් තැවුලෙන්, කඳුළු වගුරවමින් වාඩි වූහ. එවිට භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් තිස්ස තෙරුන්ට මෙසේ වදාළ සේක – “ඇයි තිස්ස, ඔබ එකත්පස්ව දුකින්, සිත් තැවුලෙන්, කඳුළු වගුරවමින් වාඩි වී සිටින්නේ?” එවිට, “භාග්‍යවතුන් වහන්ස, භික්ෂූන් වහන්සේලා මා වටකරගෙන වචනවලින් ඇනුම් බැනුම් කරමින්, නොයෙක් ආකාරයෙන් පෙළුවා” යැයි ආයුෂ්මත් තිස්ස තෙරණුවෝ පැවසූහ. “ඇත්තෙන්ම තිස්ස, ඔබ කතා කරන්නෙක් වන නමුත්, වචන ඉවසන සුළු කෙනෙක් නොවේ. ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූ කුලපුත්‍රයෙකු වන ඔබට, කතා කරන්නෙක් වීත් වචන ඉවසන සුළු කෙනෙක් නොවීම සුදුසු නොවේ. ඇත්තෙන්ම තිස්ස, ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූ කුලපුත්‍රයෙකු වන ඔබට සුදුසු වන්නේ නම්, කතා කරන්නෙක්ද වෙමින්, වචන ඉවසන සුළු කෙනෙක්ද වීමයි.”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාරා, තවදුරටත් මෙසේ වදාළ සේක –\n\n“කුමක් හෙයින් නුඹ කිපෙන්නෙහිද? නොකිපෙන්න. තිස්ස, ක්‍රෝධ රහිත බව ඔබට උතුම්ය. තිස්ස, ක්‍රෝධය, මානය, සහ ගුණමකු බව දුරු කිරීම පිණිසමයි මේ බ්‍රහ්මචාරී ජීවිතය ගත කරනු ලබන්නේ.”",
      "paliTitle": "Tissasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse to Tissa",
      "sinhalaTitle": "තිස්ස සූත්‍රය"
    },
    {
      "number": 244,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena aññataro bhikkhu theranāmako ekavihārī ceva hoti ekavihārassa ca vaṇṇavādī. So eko gāmaṃ piṇḍāya pavisati eko paṭikkamati eko raho nisīdati eko caṅkamaṃ adhiṭṭhāti. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, aññataro bhikkhu theranāmako ekavihārī ekavihārassa ca vaṇṇavādī’’ti. Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena theraṃ bhikkhuṃ āmantehi – ‘satthā taṃ, āvuso thera, āmantetī’’’ti. ‘‘Evaṃ, bhante’’ti kho so bhikkhu bhagavato paṭissutvā yenāyasmā thero tenupasaṅkami; upasaṅkamitvā āyasmantaṃ theraṃ etadavoca – ‘‘satthā taṃ, āvuso thera, āmantetī’’ti. ‘‘Evamāvuso’’ti kho āyasmā thero tassa bhikkhuno paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ theraṃ bhagavā etadavoca – ‘‘saccaṃ kira tvaṃ, thera, ekavihārī ekavihārassa ca vaṇṇavādī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yathā kathaṃ pana tvaṃ, thera, ekavihārī ekavihārassa ca vaṇṇavādī’’ti? ‘‘Idhāhaṃ, bhante, eko gāmaṃ piṇḍāya pavisāmi eko paṭikkamāmi eko raho nisīdāmi eko caṅkamaṃ adhiṭṭhāmi. Evaṃ khvāhaṃ, bhante, ekavihārī ekavihārassa ca vaṇṇavādī’’ti. ‘‘Attheso, thera, ekavihāro neso natthīti vadāmi. Api ca, thera, yathā ekavihāro vitthārena paripuṇṇo hoti taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho…pe…. ‘‘Kathañca, thera, ekavihāro vitthārena paripuṇṇo hoti. Idha, thera, yaṃ atītaṃ taṃ pahīnaṃ, yaṃ anāgataṃ taṃ paṭinissaṭṭhaṃ, paccuppannesu ca attabhāvapaṭilābhesu chandarāgo suppaṭivinīto. Evaṃ kho, thera, ekavihāro vitthārena paripuṇṇo hotī’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Sabbābhibhuṃ sabbaviduṃ sumedhaṃ, Sabbesu dhammesu anūpalittaṃ; Sabbañjahaṃ taṇhākkhaye vimuttaṃ, Tamahaṃ naraṃ ekavihārīti brūmī’’ti. dasamaṃ;",
      "english": "On one occasion, the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. Now at that time, a certain bhikkhu named Thera was an isolated dweller and a praiser of isolated dwelling. He alone entered the village for alms, alone returned, alone sat in seclusion, and alone engaged in walking meditation. Then a number of bhikkhus approached the Blessed One; having approached and paid homage to the Blessed One, they sat down to one side. Seated to one side, those bhikkhus said to the Blessed One: \"Here, venerable sir, a certain bhikkhu named Thera is an isolated dweller and a praiser of isolated dwelling.\" Then the Blessed One addressed a certain bhikkhu: \"Come, bhikkhu, in my name, address the bhikkhu Thera, saying: 'The Teacher, friend Thera, is calling you.'\" \"Yes, venerable sir,\" that bhikkhu replied to the Blessed One, and then approached the venerable Thera; having approached, he said to the venerable Thera: \"The Teacher, friend Thera, is calling you.\" \"Yes, friend,\" the venerable Thera replied to that bhikkhu, and then approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. To the venerable Thera, seated to one side, the Blessed One said: \"Is it true, Thera, that you are an isolated dweller and a praiser of isolated dwelling?\" \"Yes, venerable sir.\" \"How then, Thera, are you an isolated dweller and a praiser of isolated dwelling?\" \"Here, venerable sir, I alone enter the village for alms, alone return, alone sit in seclusion, and alone engage in walking meditation. It is in this way, venerable sir, that I am an isolated dweller and a praiser of isolated dwelling.\"\n\n\"Thera, this is indeed a form of isolated dwelling; I do not say that it is not. But, Thera, listen to how isolated dwelling becomes complete in its full extent, attend carefully, I shall speak.\" \"Yes, venerable sir,\" he replied. \"And how, Thera, does isolated dwelling become complete in its full extent? Here, Thera, what is past is abandoned, what is not yet come is relinquished, and as to present modes of individual existence, craving and attachment are well subdued. It is in this way, Thera, that isolated dwelling becomes complete in its full extent.\"\n\nThe Blessed One said this. Having said this, the Fortunate One, the Teacher, further spoke this:\n\"One who has overcome all, knows all, one of excellent wisdom,\nUntainted by all phenomena;\nOne who has abandoned all, liberated through the destruction of craving,\nThat person I call an isolated dweller.\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ, කලන්දක නිවාප නම් ස්ථානයේ වැඩ වාසය කළ සේක. ඒ කල්හි එක්තරා ථේර නම් භික්ෂුවක් තනිවම වාසය කරන්නෙක් විය. තවද, හෙතෙම තනිව වාසය කිරීමේ ගුණ වර්ණනා කරන්නෙක්ද විය. හෙතෙම තනිවම ගමට පිණ්ඩපාතය සඳහා වඩියි. තනිවම ආපසු වඩියි. තනිවම රහසිගතව හිඳියි. තනිවම සක්මන් කරයි.\n\nඉක්බිති බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පසෙකින් වාඩි වූහ. එකත්පසෙකින් වාඩි වී සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය කීහ: \"වහන්ස, මෙහි ථේර නම් එක්තරා භික්ෂුවක් තනිවම වාසය කරන්නෙක් වන අතර, තනිව වාසය කිරීමේ ගුණ වර්ණනා කරන්නෙක්ද වෙයි.\"\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ එක්තරා භික්ෂුවක් අමතා වදාළ සේක: \"භික්ෂුව, එන්න, ඔබ මගේ වචනයෙන් ථේර භික්ෂුව අමතන්න – 'ඇවැත් ථේර, ශාස්තෘන් වහන්සේ ඔබ කැඳවන සේක' කියා.\" \"එසේය, වහන්ස\" යැයි කියා ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට පිළිවදන් දී, ආයුෂ්මත් ථේර භික්ෂුව සිටි තැනට එළඹියේය; එළඹ, ආයුෂ්මත් ථේර භික්ෂුවට මෙය කීවේය: \"ඇවැත් ථේර, ශාස්තෘන් වහන්සේ ඔබ කැඳවන සේක\" කියා. \"එසේය, ඇවැත්නි\" යැයි කියා ආයුෂ්මත් ථේර භික්ෂුව ඒ භික්ෂුවට පිළිවදන් දී, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියේය; එළඹ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පසෙකින් වාඩි විය.\n\nඑකත්පසෙකින් වාඩි වී සිටි ආයුෂ්මත් ථේර භික්ෂුවට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"ථේර, ඔබ තනිවම වාසය කරන්නෙක් වන අතර, තනිව වාසය කිරීමේ ගුණ වර්ණනා කරන්නෙක්ද වන්නේ සැබෑවක්ද?\" \"එසේය, වහන්ස.\" \"එසේ නම්, ථේර, ඔබ කෙසේ නම් තනිවම වාසය කරන්නෙක් වන අතර, තනිව වාසය කිරීමේ ගුණ වර්ණනා කරන්නෙක්ද වන්නේද?\" \"වහන්ස, මෙහි මම තනිවම ගමට පිණ්ඩපාතය සඳහා වඩිමි. තනිවම ආපසු වඩිමි. තනිවම රහසිගතව හිඳිමි. තනිවම සක්මන් කරමි. වහන්ස, මෙලෙසින් මම තනිවම වාසය කරන්නෙක් වන අතර, තනිව වාසය කිරීමේ ගුණ වර්ණනා කරන්නෙක්ද වෙමි.\"\n\n\"ථේර, මේ තනිව වාසය කිරීමක් වෙයි, මෙය නැතැයි මම නොකියමි. එහෙත්, ථේර, තනිව වාසය කිරීම විස්තර වශයෙන් පරිපූර්ණ වන්නේ කෙසේදැයි එය අසන්න, මැනවින් සිතට ගන්න; මම දේශනා කරන්නෙමි.\" \"එසේය, වහන්ස\" යැයි කියා ඔහු පිළිතුරු දුන්නේය. \"ථේර, තනිව වාසය කිරීම විස්තර වශයෙන් පරිපූර්ණ වන්නේ කෙසේද? ථේර, මෙහිලා යම් අතීතයක් වේද, එය ප්‍රහීණ කර ඇත. යම් අනාගතයක් වේද, එය ප්‍රතිනිස්සර්ග කර ඇත. වර්තමාන ආත්මභාව ප්‍රතිලාභයන්හි ඡන්දරාගය (ඇල්ම හා දැඩි ආශාව) මැනවින් දුරු කර ඇත. ථේර, මෙලෙසින් තනිව වාසය කිරීම විස්තර වශයෙන් පරිපූර්ණ වන්නේය.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා, සුගතයන් වහන්සේ, ශාස්තෘන් වහන්සේ, තවදුරටත් මෙය වදාළ සේක:\n\n\"සියල්ල අභිභවනය කළ, සියල්ල දැනගත්, මහා ප්‍රඥා ඇති,\nසියලු ධර්මයන්හි නොඇලුණා වූ,\nසියල්ල හැර දැමූ, තණ්හාව ක්ෂය කිරීමෙන් විමුක්ත වූ,\nඒ පුද්ගලයා මම 'තනිව වාසය කරන්නා' යැයි කියමි.\"",
      "paliTitle": "Theranāmakasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on a Elder Named 'Elder'",
      "sinhalaTitle": "ථේරනාමක සූත්‍රය"
    },
    {
      "number": 245,
      "pali": "Sāvatthiyaṃ viharati. Atha kho āyasmā mahākappino yena bhagavā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ mahākappinaṃ dūratova āgacchantaṃ. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe bhikkhave, etaṃ bhikkhuṃ āgacchantaṃ odātakaṃ tanukaṃ tuṅganāsika’’nti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, bhikkhu mahiddhiko mahānubhāvo. Na ca sā samāpatti sulabharūpā yā tena bhikkhunā asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharatī’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Khattiyo seṭṭho janetasmiṃ, ye gottapaṭisārino; Vijjācaraṇasampanno, so seṭṭho devamānuse. ‘‘Divā tapati ādicco, rattimābhāti candimā; Sannaddho khattiyo tapati, jhāyī tapati brāhmaṇo; Atha sabbamahorattiṃ [atha sabbamahorattaṃ (sī. syā. kaṃ.)], buddho tapati tejasā’’ti. ekādasamaṃ;",
      "english": "He was dwelling in Savatthi. Then, indeed, Venerable Mahakappina approached the Blessed One. The Blessed One, indeed, saw Venerable Mahakappina coming from afar. Having seen him, he addressed the monks: \"Do you not see, monks, that monk coming – fair-skinned, slender, with a prominent nose?\" \"Yes, venerable sir.\" \"Indeed, monks, this monk is greatly potent and greatly powerful. And there is no such attainment, easily gained, which that monk has not previously attained. For the sake of which goal sons of noble families rightly go forth from the home life into homelessness – that unsurpassed culmination of the holy life – he dwells having achieved it, having realized it for himself through direct knowledge in this very life.\" This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, then further said this:\n\n\"Among people, the warrior is supreme for those who go by lineage;\nBut he who is endowed with knowledge and conduct is supreme among gods and humans.\nBy day the sun shines; by night the moon shines forth;\nThe warrior shines when armored; the meditator shines as a true brahmin;\nBut all day and all night, the Buddha shines with his splendor.\"",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක. ඉක්බිති ආයුෂ්මත් මහාකප්පින තෙරුන් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් මහාකප්පින තෙරුන් දුරදීම එනු දැක වදාළ සේක. (එසේ) දැක භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, සුදු පැහැති, සිහින් සිරුරක් ඇති, උස් නාසයක් ඇති එන මේ භික්ෂුව නුඹලා දකින්නෙහිද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “මහණෙනි, මේ භික්ෂුව මහත් ඍද්ධි ඇති, මහත් ආනුභාව ඇති කෙනෙකි. පෙර ඔහු විසින් නොලබන ලද කිසිදු සමාපත්තියක් ලෝකයේ පහසුවෙන් ලැබිය හැකි දෙයක් නොවේ. යම් අරමුණක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වෙත්ද, ඒ අනුත්තර වූ උතුම් බ්‍රහ්මචරියාවේ පරමාර්ථය, මේ භවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරයි.”\n\nභාග්‍යවතුන් වහන්සේ මේ වදාළ සේක. මේ වදන් වදාළ සුගත වූ ශාස්තෘන් වහන්සේ තවදුරටත් මෙසේ වදාළ සේක:\n“යම් ජනයෙක් කුලගෝත්‍රය ප්‍රධාන කොට සලකත්ද, ඔවුන් අතර ක්ෂත්‍රියයා උතුම්ය.\nඑහෙත් විද්‍යාචරණ සම්පන්න තැනැත්තා දෙවිමිනිසුන් අතර උතුම්ය.\n\nදවාලෙහි හිරු තපියි, රාත්‍රියෙහි සඳ බබළයි.\nයුධ සන්නද්ධ වූ ක්ෂත්‍රියයා තපියි, ධ්‍යාන වඩන බ්‍රාහ්මණයා තපියි.\nඑහෙත් මුළු දිවා රෑ දෙකෙහිම බුදුරදුන් තේජසින් බබළන සේක.”",
      "paliTitle": "Mahākappinasuttaṃ",
      "vagga": "",
      "englishTitle": "To Mahākappina Sutta",
      "sinhalaTitle": "මහාකප්පින සූත්‍රය"
    },
    {
      "number": 246,
      "pali": "Sāvatthiyaṃ viharati. Atha kho dve bhikkhū sahāyakā āyasmato mahākappinassa saddhivihārino yena bhagavā tenupasaṅkamiṃsu. Addasā kho bhagavā te bhikkhū dūratova āgacchante. Disvāna bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, ete bhikkhū sahāyake āgacchante kappinassa saddhivihārino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Ete kho te bhikkhū mahiddhikā mahānubhāvā. Na ca sā samāpatti sulabharūpā, yā tehi bhikkhūhi asamāpannapubbā. Yassa catthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Sahāyā vatime bhikkhū, cirarattaṃ sametikā; Sameti nesaṃ saddhammo, dhamme buddhappavedite. ‘‘Suvinītā kappinena, dhamme ariyappavedite; Dhārenti antimaṃ dehaṃ, jetvā māraṃ savāhini’’nti. dvādasamaṃ; ",
      "english": "He was dwelling at Savatthi. Then indeed, two monks, companions and fellow monastics of Venerable Mahakappina, approached the Blessed One. The Blessed One indeed saw those monks approaching from afar. Having seen them, he addressed the monks: \"Do you see, monks, those monks approaching, who are companions and fellow monastics of Kappina?\"\n\"Yes, venerable sir.\"\n\"Indeed, those monks possess great psychic power and great might. There is no meditative attainment, however difficult to achieve, that those monks have not already entered upon. And for the sake of which sons of good families rightly go forth from the home life into homelessness—that unsurpassed culmination of the holy life—they dwell, having directly known, realized, and attained it by themselves in this very life.\"\n\nThe Blessed One said this. Having said this, the Fortunate One, the Teacher, then spoke further:\n\"These monks are indeed companions, associated for a long time;\nTheir true Dhamma is in accord with the Teaching proclaimed by the Buddha.\nWell-disciplined by Kappina in the Dhamma proclaimed by the Noble Ones,\nHaving conquered Mara with his retinue, they bear their final body.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩසිටින සේක. එසමයෙහි ආයුෂ්මත් මහාකප්පින තෙරුන්ගේ සද්ධිවිහාරික වූ භික්ෂූන් වහන්සේලා දෙදෙනෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. භාග්‍යවතුන් වහන්සේ එම භික්ෂූන් වහන්සේලා දුර සිටම එනු දුටු සේක. දැක භික්ෂූන් වහන්සේලාට අමතා වදාළ සේක: \"මහණෙනි, මහාකප්පින තෙරුන්ගේ සද්ධිවිහාරික වූ, මිතුරු වූ, පැමිණෙන මේ භික්ෂූන් වහන්සේලා ඔබලා දකින්නහුද?\" \"එසේය, ස්වාමීනි.\" \"මේ භික්ෂූන් වහන්සේලා මහා ඉර්ධිමත්ය, මහා ආනුභාවසම්පන්නයෝය. එම භික්ෂූන් වහන්සේලා විසින් පෙර කිසිදා නොලැබූ, පහසුවෙන් ලැබිය හැකි සමාපත්තියක් නම් නැත. යමක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වෙද්ද, අන්න ඒ අනුත්තර වූ බ්‍රහ්මචාරී ජීවිතයේ අවසානය වූ අරහත්වය මේ ආත්මභාවයේදීම තමන් විසින්ම අභිඥා ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය කරති.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා සුගත වූ ශාස්තෘන් වහන්සේ තවදුරටත් මෙසේ වදාළ සේක:\n\n\"මේ භික්ෂූන් වහන්සේලා සැබවින්ම මිත්‍රයෝය, බොහෝ කලක් මුළුල්ලේ එක්ව සිටියෝය.\nබුදුරදුන් විසින් දේශනා කරන ලද ධර්මයෙහි ඔවුන්ගේ සද්ධර්මය මැනවින් එකඟ වේ.\n\nආර්යයන් වහන්සේලා විසින් දේශනා කරන ලද ධර්මයෙහි, ඔවුහු කප්පින තෙරුන් විසින් මැනවින් හික්මවන ලද්දාහුය.\nමාරයා සේනාව සමඟ පරාජය කොට, ඔවුහු මේ අවසන් ශරීරය දරති.\"",
      "paliTitle": "Sahāyakasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Friends",
      "sinhalaTitle": "සහායක සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Bhikkhusaṃyuttaṃ samattaṃ. Tassuddānaṃ – Kolito upatisso ca, ghaṭo cāpi pavuccati; Navo sujāto bhaddi ca, visākho nando tisso ca; Theranāmo ca kappino, sahāyena ca dvādasāti.",
    "english": "The Linked Discourses on Monks is complete. The summary of it: Kolita and Upatissa, and Ghaṭa; New, Sujāta, Bhaddi, Visākha, Nanda, and Tissa; the one named Thera, and Kappina; with Sahāyaka they are twelve.",
    "sinhala": "භික්ඛු සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: කෝලිත සහ උපතිස්ස, ඝට, නව, සුජාත, භද්දි, විසාඛ, නන්ද, තිස්ස, ථේර, කප්පින සහ සහායක යන සූත්‍ර දොළසයි."
  }
}