{
  "id": "sn.2.7",
  "title": {
    "pali": "Rāhulasaṃyuttaṃ",
    "english": "The Connected Discourses with Rāhula",
    "sinhala": "රාහුල සංයුත්තය."
  },
  "sections": [
    {
      "number": 188,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā rāhulo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā rāhulo bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Taṃ kiṃ maññasi, rāhula, cakkhuṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sotaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe…. ‘‘Ghānaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… ‘‘jivhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘kāyo nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’ …pe… ‘‘mano nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Evaṃ passaṃ, rāhula, sutavā ariyasāvako cakkhusmimpi nibbindati …pe… sotasmimpi nibbindati… ghānasmimpi nibbindati… jivhāyapi nibbindati… kāyasmimpi nibbindati… manasmimpi nibbindati; nibbindaṃ virajjati; virāgā vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling near Sāvatthī, in Jeta's Grove, at Anāthapiṇḍika's park.\n\nThen the venerable Rāhula approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Seated to one side, the venerable Rāhula said this to the Blessed One: “It would be good, venerable sir, if the Blessed One would teach me the Dhamma briefly, so that having heard the Dhamma from the Blessed One, I might dwell solitary, withdrawn, diligent, ardent, and resolute.”\n\n“What do you think, Rāhula, is the eye permanent or impermanent?”\n“Impermanent, venerable sir.”\n“But that which is impermanent, is it suffering or happiness?”\n“Suffering, venerable sir.”\n“But regarding that which is impermanent, suffering, and subject to change, is it suitable to regard it thus: ‘This is mine, this I am, this is my self’?”\n“No indeed, venerable sir.”\n\n“Is the ear permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is the nose permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is the tongue permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is the body permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is the mind permanent or impermanent?”\n“Impermanent, venerable sir.”\n“But that which is impermanent, is it suffering or happiness?”\n“Suffering, venerable sir.”\n“But regarding that which is impermanent, suffering, and subject to change, is it suitable to regard it thus: ‘This is mine, this I am, this is my self’?”\n“No indeed, venerable sir.”\n\n“Seeing thus, Rāhula, the instructed noble disciple grows weary of the eye, he grows weary of the ear, he grows weary of the nose, he grows weary of the tongue, he grows weary of the body, he grows weary of the mind. Being weary, he becomes dispassionate; through dispassion, he is liberated; when liberated, the knowledge arises that he is liberated. He understands: ‘Birth is destroyed, the holy life has been fulfilled, what had to be done has been done, there is no more state of being for this world.’”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයේ වැඩසිටින සේක.\n\nඉන් අනතුරුව ආයුෂ්මත් රාහුල තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙක වාඩිවූහ.\n\nඑකත්පසෙක වැඩ සිටි ආයුෂ්මත් රාහුල තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මට සංක්ෂිප්තයෙන් ධර්මයක් දේශනා කරන්නේ නම් යෙහෙකි; භාග්‍යවතුන් වහන්සේගේ ඒ ධර්මය අසා මම තනිව, කායින් වෙන්ව, අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, වීර්යය මුල්කොට ඇතිව වාසය කරන්නෙමි.”\n\n“[එවිට භාග්‍යවතුන් වහන්සේ මෙසේ ඇසූහ:] රාහුල, ඔබ මේ පිළිබඳව කෙසේ සිතන්නෙහිද? ඇස (චක්ඛු) නිත්‍යද, නැතහොත් අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “යමක් අනිත්‍යද, එය දුක්ද, නැතහොත් සුඛද?” “දුකකි, ස්වාමීනි.” “යමක් අනිත්‍යද, දුක්ද, වෙනස්වීමේ ස්වභාවය ඇත්තේද, එය ‘මෙය මාගේය, මම මෙය වෙමි, මේ මාගේ ආත්මයයි’ යනුවෙන් දැකීම සුදුසුද?” “එසේ නොවේ, ස්වාමීනි.”\n\n“කණ (සෝත) නිත්‍යද, නැතහොත් අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “නාසය (ඝාන) නිත්‍යද, නැතහොත් අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “දිව (ජිව්හා) නිත්‍යද, නැතහොත් අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “කය (කාය) නිත්‍යද, නැතහොත් අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “මනස (මනෝ) නිත්‍යද, නැතහොත් අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.”\n\n“යමක් අනිත්‍යද, එය දුක්ද, නැතහොත් සුඛද?” “දුකකි, ස්වාමීනි.” “යමක් අනිත්‍යද, දුක්ද, වෙනස්වීමේ ස්වභාවය ඇත්තේද, එය ‘මෙය මාගේය, මම මෙය වෙමි, මේ මාගේ ආත්මයයි’ යනුවෙන් දැකීම සුදුසුද?” “එසේ නොවේ, ස්වාමීනි.”\n\n“රාහුල, මෙසේ දකින ලද, ශ්‍රැතවත් ආර්යශ්‍රාවක තෙම ඇස කෙරෙහිද කළකිරෙයි; කන කෙරෙහිද කළකිරෙයි; නාසය කෙරෙහිද කළකිරෙයි; දිව කෙරෙහිද කළකිරෙයි; කය කෙරෙහිද කළකිරෙයි; මනස කෙරෙහිද කළකිරෙයි. කළකිරීමෙන් විරාගයට (තෘෂ්ණාවෙන් මිදීමට) පත්වෙයි. විරාගයෙන් විමුක්තිය (නිදහස) ලබයි. විමුක්තිය ලැබූ විට ‘මම විමුක්ත වූයෙමි’ යන ඥානය පහළ වෙයි. ‘ජාතිය (උපත) ක්ෂය විය, බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කරන ලදී, කළයුතු සියල්ල නිම කරන ලදී, නැවත මේ තත්ත්වය (ලෞකික පැවැත්ම) සඳහා කළ යුත්තක් නැතැයි’ ඔහු අවබෝධ කරගනියි.”\n\nමෙය පළමුවැන්නයි.",
      "paliTitle": "Cakkhusuttaṃ",
      "vagga": "Paṭhamavaggo",
      "englishTitle": "The Discourse on the Eye",
      "sinhalaTitle": "චක්ඛු සූත්‍රය",
      "vaggaEnglish": "First Chapter",
      "vaggaSinhala": "පළමු වර්ගය"
    },
    {
      "number": 189,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, rūpā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… saddā… gandhā… rasā… phoṭṭhabbā… dhammā niccā vā aniccā vāti? ‘‘Aniccā, bhante’’…pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako rūpesupi nibbindati… saddesupi nibbindati… gandhesupi nibbindati… rasesupi nibbindati… phoṭṭhabbesupi nibbindati… dhammesupi nibbindati; nibbindaṃ virajjati…pe… pajānātī’’ti. Dutiyaṃ.",
      "english": "The Blessed One was dwelling in Sāvatthī.\n\n“What do you think, Rāhula, are material forms permanent or impermanent?” “They are impermanent, Venerable Sir.”\n“Are sounds, odors, tastes, tactile objects, or mental phenomena permanent or impermanent?” “They are impermanent, Venerable Sir.”\n\n“Seeing thus, Rāhula, the instructed noble disciple becomes disenchanted with material forms. He becomes disenchanted with sounds. He becomes disenchanted with odors. He becomes disenchanted with tastes. He becomes disenchanted with tactile objects. He becomes disenchanted with mental phenomena. Being disenchanted, he becomes dispassionate... and he knows clearly.”",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක... රාහුල, ඔබ මේ ගැන කුමක් සිතන්නේද? රූපයෝ (වස්තූන්) නිත්‍යද, අනිත්‍යද? \"වහන්ස, අනිත්‍යය.\"... ශබ්ද, ගන්ධ, රස, ස්ප්‍රෂ්ටව්‍ය, ධර්ම යන මේවා නිත්‍යද, අනිත්‍යද? \"වහන්ස, අනිත්‍යය.\"...\n\nරාහුල, මෙසේ දකින ශ්‍රැතවත් ආර්ය ශ්‍රාවකයා රූපයෙහිද කලකිරෙයි... ශබ්දයෙහිද කලකිරෙයි... ගන්ධයෙහිද කලකිරෙයි... රසයෙහිද කලකිරෙයි... ස්ප්‍රෂ්ටව්‍යයෙහිද කලකිරෙයි... ධර්මයෙහිද කලකිරෙයි. කලකිරීමෙන් විරාගී වෙයි... ඔහු නිවැරදිව අවබෝධ කරයි.\n\nදෙවැන්න.",
      "paliTitle": "Rūpasuttaṃ",
      "englishTitle": "The Discourse on Forms",
      "sinhalaTitle": "රූප සූත්‍රය"
    },
    {
      "number": 190,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, cakkhuviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… ‘‘sotaviññāṇaṃ…pe… ghānaviññāṇaṃ… jivhāviññāṇaṃ… kāyaviññāṇaṃ… manoviññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’ …pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako cakkhuviññāṇasmimpi nibbindati…pe… sotaviññāṇasmimpi nibbindati… ghānaviññāṇasmimpi nibbindati… jivhāviññāṇasmimpi nibbindati… kāyaviññāṇasmimpi nibbindati… manoviññāṇasmimpi nibbindati; nibbindaṃ virajjati…pe… pajānātī’’ti. Tatiyaṃ.",
      "english": "The Blessed One was residing in Sāvatthī... \"What do you think, Rahula, is visual consciousness permanent or impermanent?\" \"Impermanent, venerable sir.\" \"Is auditory consciousness, olfactory consciousness, gustatory consciousness, tactile consciousness, or mental consciousness permanent or impermanent?\" \"Impermanent, venerable sir.\"\n\n\"Seeing this thus, Rahula, the instructed noble disciple becomes disenchanted with visual consciousness. He becomes disenchanted with auditory consciousness, disenchanted with olfactory consciousness, disenchanted with gustatory consciousness, disenchanted with tactile consciousness, and disenchanted with mental consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. Being liberated, the knowledge arises that he is liberated. He fully understands: 'Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more state of being for this world.'\"",
      "sinhala": "සැවැත්නුවර වැඩහිඳින සේක.\n    \n\"රාහුල, ඔබ මේ ගැන කුමක් සිතන්නේද? චක්ඛු විඤ්ඤාණය නිත්‍ය ද, නැතහොත් අනිත්‍ය ද?\"\n\"වහන්ස, අනිත්‍ය ය.\"\n\"ශ්‍රවණ විඤ්ඤාණය... ඝ්‍රාණ විඤ්ඤාණය... ජිහ්වා විඤ්ඤාණය... කාය විඤ්ඤාණය... මනෝ විඤ්ඤාණය නිත්‍ය ද, නැතහොත් අනිත්‍ය ද?\"\n\"වහන්ස, අනිත්‍ය ය.\"\n\"රාහුල, මෙසේ දකින, ධර්මය ඇසූ ආර්ය ශ්‍රාවකයා චක්ඛු විඤ්ඤාණය කෙරෙහි ද කලකිරේ. ශ්‍රවණ විඤ්ඤාණය කෙරෙහි ද කලකිරේ. ඝ්‍රාණ විඤ්ඤාණය කෙරෙහි ද කලකිරේ. ජිහ්වා විඤ්ඤාණය කෙරෙහි ද කලකිරේ. කාය විඤ්ඤාණය කෙරෙහි ද කලකිරේ. මනෝ විඤ්ඤාණය කෙරෙහි ද කලකිරේ. කලකිරෙන ඔහු විරාගී වේ; විරාගී වූ ඔහු (රාගයෙන්) මිදේ. මිදුණු බව ප්‍රකට කොට දනියි.\"\n\nතෙවැන්න යි.",
      "paliTitle": "Viññāṇasuttaṃ",
      "englishTitle": "Consciousness Sutta",
      "sinhalaTitle": "විඤ්ඤාණ සූත්‍රය"
    },
    {
      "number": 191,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, cakkhusamphasso nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’…pe… ‘‘sotasamphasso…pe… ghānasamphasso… jivhāsamphasso… kāyasamphasso… manosamphasso nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’…pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako cakkhusamphassasmimpi nibbindati…pe… sotasamphassasmimpi nibbindati… ghānasamphassasmimpi nibbindati… jivhāsamphassasmimpi nibbindati… kāyasamphassasmimpi nibbindati… manosamphassasmimpi nibbindati; nibbindaṃ virajjati…pe… pajānātī’’ti. Catutthaṃ.",
      "english": "What do you think, Rāhula, is contact experienced through the eye permanent or impermanent? Impermanent, venerable sir. Is contact experienced through the ear, contact experienced through the nose, contact experienced through the tongue, contact experienced through the body, or contact experienced through the mind permanent or impermanent? Impermanent, venerable sir. Seeing thus, Rāhula, the instructed noble disciple becomes disenchanted with contact experienced through the eye. He becomes disenchanted with contact experienced through the ear. He becomes disenchanted with contact experienced through the nose. He becomes disenchanted with contact experienced through the tongue. He becomes disenchanted with contact experienced through the body. He becomes disenchanted with contact experienced through the mind. Being disenchanted, he becomes dispassionate, and by becoming dispassionate, he realizes ultimate understanding.",
      "sinhala": "සැවැත්නුවර වැඩහිඳින සේක.\n\n\"රාහුල, ඔබ මේ පිළිබඳව කුමක් සිතන්නේද? ඇසේ ස්පර්ශය (චක්ඛුසම්ඵස්සය) නිත්‍යද, නැතහොත් අනිත්‍යද?\"\n\"භාග්‍යවතුන් වහන්ස, අනිත්‍යයි.\"\n\n\"කණේ ස්පර්ශය (ශ්‍රෝතසම්ඵස්සය)... නාසයේ ස්පර්ශය (ඝාණසම්ඵස්සය)... දිවේ ස්පර්ශය (ජිව්හාසම්ඵස්සය)... ශරීරයේ ස්පර්ශය (කායසම්ඵස්සය)... මනසේ ස්පර්ශය (මනෝසම්ඵස්සය) නිත්‍යද, නැතහොත් අනිත්‍යද?\"\n\"භාග්‍යවතුන් වහන්ස, අනිත්‍යයි.\"\n\n\"රාහුල, මෙසේ දකිමින්, ඇසූ පිරූ තැන් ඇති ආර්ය ශ්‍රාවකයා ඇසේ ස්පර්ශය පිළිබඳව ද කලකිරෙයි... කණේ ස්පර්ශය පිළිබඳව ද කලකිරෙයි... නාසයේ ස්පර්ශය පිළිබඳව ද කලකිරෙයි... දිවේ ස්පර්ශය පිළිබඳව ද කලකිරෙයි... ශරීරයේ ස්පර්ශය පිළිබඳව ද කලකිරෙයි... මනසේ ස්පර්ශය පිළිබඳව ද කලකිරෙයි; කලකිරීමට පත්වන හෙයින් ඔහු නොඇලෙයි (විරාගී වෙයි)... ඔහු මැනවින් අවබෝධ කරයි.\"",
      "paliTitle": "Samphassasuttaṃ",
      "englishTitle": "The Discourse on Contact",
      "sinhalaTitle": "සම්ඵස්ස සූත්‍රය"
    },
    {
      "number": 192,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, cakkhusamphassajā vedanā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘sotasamphassajā vedanā…pe… ghānasamphassajā vedanā… jivhāsamphassajā vedanā… kāyasamphassajā vedanā… manosamphassajā vedanā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako cakkhusamphassajāya vedanāyapi nibbindati…pe… sota… ghāna… jivhā… kāya… manosamphassajāya vedanāyapi nibbindati…pe… pajānātī’’ti. Pañcamaṃ.",
      "english": "He was dwelling at Sāvatthī... “What do you think, Rāhula? Is feeling born of eye-contact permanent or impermanent?” “Impermanent, Venerable Sir.” “Is feeling born of ear-contact, feeling born of nose-contact, feeling born of tongue-contact, feeling born of body-contact, or feeling born of mind-contact permanent or impermanent?” “Impermanent, Venerable Sir.” “Seeing thus, Rāhula, the instructed noble disciple becomes dispassionate toward the feeling born of eye-contact. He also becomes dispassionate toward the feeling born of ear-contact, toward the feeling born of nose-contact, toward the feeling born of tongue-contact, toward the feeling born of body-contact, and toward the feeling born of mind-contact. He fully understands.”",
      "sinhala": "සැවැත්නුවර වැඩවසන සේක.\nරාහුල, ඔබ මේ පිළිබඳව කුමක් සිතන්නේද? චක්ඛුසම්ඵස්සයෙන් හටගන්නා වේදනාව නිත්‍යද, අනිත්‍යද?\nභාග්‍යවතුන්‍ වහන්ස, අනිත්‍යයි.\nශ්‍රෝතසම්ඵස්සයෙන් හටගන්නා වේදනාවද, ඝාණසම්ඵස්සයෙන් හටගන්නා වේදනාවද, ජිව්හාසම්ඵස්සයෙන් හටගන්නා වේදනාවද, කායසම්ඵස්සයෙන් හටගන්නා වේදනාවද, මනෝසම්ඵස්සයෙන් හටගන්නා වේදනාවද - නිත්‍යද, අනිත්‍යද?\nභාග්‍යවතුන්‍ වහන්ස, අනිත්‍යයි.\n\nරාහුල, මෙසේ දකිමින් අසා ඇති ආර්ය ශ්‍රාවක තෙම චක්ඛුසම්ඵස්සයෙන් හටගත් වේදනාව පිළිබඳවද කලකිරෙයි (විරාගී වෙයි). ශ්‍රෝතසම්ඵස්ස, ඝාණසම්ඵස්ස, ජිව්හාසම්ඵස්ස, කායසම්ඵස්ස, මනෝසම්ඵස්ස යන ස්පර්ශයන්ගෙන් හටගත් වේදනාව පිළිබඳවද කලකිරෙයි. ඔහු (ඒ මගින්) සත්‍යය අවබෝධ කරගනී.",
      "paliTitle": "Vedanāsuttaṃ",
      "englishTitle": "Feeling Sutta",
      "sinhalaTitle": "වේදනා සූත්‍රය"
    },
    {
      "number": 193,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, rūpasaññā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘saddasaññā…pe… gandhasaññā… rasasaññā… phoṭṭhabbasaññā… dhammasaññā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako rūpasaññāyapi nibbindati…pe… saddasaññāyapi nibbindati… gandhasaññāyapi nibbindati… rasasaññāyapi nibbindati… phoṭṭhabbasaññāyapi nibbindati… dhammasaññāyapi nibbindati…pe… pajānātī’’ti. Chaṭṭhaṃ.",
      "english": "He was dwelling at Sāvatthī. What do you think, Rāhula, is the perception of form permanent or impermanent? Impermanent, venerable sir. Is the perception of sound permanent or impermanent? Is the perception of smell permanent or impermanent? Is the perception of taste permanent or impermanent? Is the perception of touch permanent or impermanent? Is the perception of mental phenomena permanent or impermanent? Impermanent, venerable sir. Seeing thus, Rāhula, the instructed noble disciple becomes disenchanted with the perception of form. He becomes disenchanted with the perception of sound. He becomes disenchanted with the perception of smell. He becomes disenchanted with the perception of taste. He becomes disenchanted with the perception of touch. He becomes disenchanted with the perception of mental phenomena. Being disenchanted, he truly understands.",
      "sinhala": "සැවැත්නුවර වැඩවසන සේක... \"රාහුල, ඔබ මේ පිළිබඳව කුමක් සිතන්නෙහිද? රූපසංඥාව නිත්‍යද, නැතහොත් අනිත්‍යද?\" \"ස්වාමීනි, අනිත්‍යය.\" ... \"ශබ්දසංඥාව... ගන්ධසංඥාව... රසසංඥාව... ස්පර්ශසංඥාව... ධර්මසංඥාව නිත්‍යද, නැතහොත් අනිත්‍යද?\" \"ස්වාමීනි, අනිත්‍යය.\" ... \"රාහුල, මෙසේ දකින ලද අසන ලද ආර්ය ශ්‍රා‍වකයා රූපසංඥාව පිළිබඳව ද කලකිරෙයි... ශබ්දසංඥාව පිළිබඳව ද කලකිරෙයි; ගන්ධසංඥාව පිළිබඳව ද කලකිරෙයි; රසසංඥාව පිළිබඳව ද කලකිරෙයි; ස්පර්ශසංඥාව පිළිබඳව ද කලකිරෙයි; ධර්මසංඥාව පිළිබඳව ද කලකිරෙයි... ඔහු (යථාර්ථය) ප්‍රඥාවෙන් අවබෝධ කර ගනී.\"",
      "paliTitle": "Saññāsuttaṃ",
      "englishTitle": "The Discourse on Perception",
      "sinhalaTitle": "සඤ්ඤා සූත්‍රය"
    },
    {
      "number": 194,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, rūpasañcetanā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘saddasañcetanā…pe… gandhasañcetanā… rasasañcetanā … phoṭṭhabbasañcetanā… dhammasañcetanā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako rūpasañcetanāyapi nibbindati…pe… saddasañcetanāyapi nibbindati… gandhasañcetanāyapi nibbindati… rasasañcetanāyapi nibbindati… phoṭṭhabbasañcetanāyapi nibbindati… dhammasañcetanāyapi nibbindati…pe… pajānātī’’ti. Sattamaṃ.",
      "english": "The Blessed One was residing at Sāvatthi...\n\n“What do you think, Rāhula, is the volition concerning material form permanent or impermanent?” “It is impermanent, venerable sir.” “...Is the volition concerning sound permanent or impermanent? ...Is the volition concerning odor permanent or impermanent? ...Is the volition concerning flavor permanent or impermanent? ...Is the volition concerning tangible objects permanent or impermanent? ...Is the volition concerning mental objects permanent or impermanent?” “It is impermanent, venerable sir.”\n\n“Seeing thus, Rāhula, the instructed noble disciple becomes disenchanted with the volition concerning material form; he becomes disenchanted with the volition concerning sound; he becomes disenchanted with the volition concerning odor; he becomes disenchanted with the volition concerning flavor; he becomes disenchanted with the volition concerning tangible objects; he becomes disenchanted with the volition concerning mental objects, and fully understands.”\n\nThe Seventh.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ ශ්‍රා‍වස්තියෙහි වැඩ‍හිඳින සේක.\n\nරාහුලය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? රූපය පිළිබඳ වූ චේතනාව නිත්‍ය දැ, නැතිනම් අනිත්‍ය දැ? ස්වාමීනි, අනිත්‍ය යි. එලෙසින්ම, ශබ්දය පිළිබඳ චේතනාව... ගන්ධය පිළිබඳ චේතනාව... රසය පිළිබඳ චේතනාව... ස්පර්ශය පිළිබඳ චේතනාව... ධර්මයන් පිළිබඳ චේතනාව නිත්‍ය දැ, නැතිනම් අනිත්‍ය දැ? ස්වාමීනි, අනිත්‍ය යි.\n\nරාහුලය, මෙසේ බලන ඇසූ පිරූ තැන් ඇති ආර්ය ශ්‍රාවක තෙම රූපය පිළිබඳ චේතනාව ගැනද කලකිරීමට පත්වෙයි. ශබ්දය පිළිබඳ චේතනාව ගැනද කලකිරීමට පත්වෙයි. ගන්ධය පිළිබඳ චේතනාව ගැනද කලකිරීමට පත්වෙයි. රසය පිළිබඳ චේතනාව ගැනද කලකිරීමට පත්වෙයි. ස්පර්ශය පිළිබඳ චේතනාව ගැනද කලකිරීමට පත්වෙයි. ධර්මයන් පිළිබඳ චේතනාව ගැනද කලකිරීමට පත්වෙයි. ඔහු (එම යථා ස්වභාවය) මැනවින් අවබෝධ කරගනී.",
      "paliTitle": "Sañcetanāsuttaṃ",
      "englishTitle": "The Discourse on Volition",
      "sinhalaTitle": "සඤ්චේතනා සූත්‍රය"
    },
    {
      "number": 195,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, rūpataṇhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘saddataṇhā…pe… gandhataṇhā… rasataṇhā… phoṭṭhabbataṇhā… dhammataṇhā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako rūpataṇhāyapi nibbindati…pe… saddataṇhāyapi nibbindati… gandhataṇhāyapi nibbindati… rasataṇhāyapi nibbindati… phoṭṭhabbataṇhāya nibbindati… dhammataṇhāyapi nibbindati …pe… pajānātī’’ti. Aṭṭhamaṃ.",
      "english": "He was dwelling in Sāvatthī... \"What do you think, Rāhula, is the craving for forms permanent or impermanent?\" \"Impermanent, Venerable Sir.\" ... \"Is the craving for sounds... craving for smells... craving for tastes... craving for tangible objects... craving for mind-objects permanent or impermanent?\" \"Impermanent, Venerable Sir.\" ... \"Seeing thus, Rāhula, the instructed noble disciple becomes disenchanted with the craving for forms... he becomes disenchanted with the craving for sounds... he becomes disenchanted with the craving for smells... he becomes disenchanted with the craving for tastes... he becomes disenchanted with the craving for tangible objects... he becomes disenchanted with the craving for mind-objects... and he fully understands.\"\n\nThe Eighth.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ ශ්‍රා‍වස්තියෙහි වැඩවසන සේක. ‘‘රාහුල, ඔබ මේ ගැන කුමක් සිතන්නේද? රූපයන් කෙරෙහි තණ්හාව නිරතුරුව පවතින්නේද, නැතහොත් අනිත්‍ය වේද?’’ ‘‘භාග්‍යවතුන් වහන්ස, අනිත්‍ය වේ.’’ ‘‘ශබ්දයන් කෙරෙහි තණ්හාව... ගන්ධයන් කෙරෙහි තණ්හාව... රසයන් කෙරෙහි තණ්හාව... ස්පර්ශයන් කෙරෙහි තණ්හාව... ධර්මයන් කෙරෙහි තණ්හාව නිරතුරුව පවතින්නේද, නැතහොත් අනිත්‍ය වේද?’’ ‘‘භාග්‍යවතුන් වහන්ස, අනිත්‍ය වේ.’’\n\n‘‘රාහුල, මෙසේ දකින ලද අසා ඇති ආර්ය ශ්‍රා‍වකයා රූපයන් කෙරෙහි තණ්හාවෙන් ද කලකිරෙන්නේය. ශබ්දයන් කෙරෙහි තණ්හාවෙන් ද කලකිරෙන්නේය. ගන්ධයන් කෙරෙහි තණ්හාවෙන් ද කලකිරෙන්නේය. රසයන් කෙරෙහි තණ්හාවෙන් ද කලකිරෙන්නේය. ස්පර්ශයන් කෙරෙහි තණ්හාවෙන් ද කලකිරෙන්නේය. ධර්මයන් කෙරෙහි තණ්හාවෙන් ද කලකිරෙන්නේය. කලකිරෙන බැවින් විරාගී වන්නේය. විරාගී වන බැවින් ඔහු මැනවින් අවබෝධ කරන්නේය.’’",
      "paliTitle": "Taṇhāsuttaṃ",
      "englishTitle": "Craving Sutta",
      "sinhalaTitle": "තණ්හා සූත්‍රය"
    },
    {
      "number": 196,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, pathavīdhātu niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘āpodhātu…pe… tejodhātu… vāyodhātu… ākāsadhātu… viññāṇadhātu niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako pathavīdhātuyāpi nibbindati…pe… āpodhātuyāpi nibbindati… tejodhātuyāpi nibbindati… vāyodhātuyāpi nibbindati… ākāsadhātuyāpi nibbindati… viññāṇadhātuyāpi nibbindati…pe… pajānātī’’ti. Navamaṃ.",
      "english": "“What do you think, Rāhula? Is the element of earth permanent or impermanent?” “Impermanent, venerable sir.”\n\n“...Is the element of water... the element of heat... the element of wind... the element of space... or the element of consciousness permanent or impermanent?” “Impermanent, venerable sir.”\n\n“Seeing thus, Rāhula, the instructed noble disciple becomes disenchanted with the element of earth; he becomes disenchanted with the element of water; he becomes disenchanted with the element of heat; he becomes disenchanted with the element of wind; he becomes disenchanted with the element of space; and he becomes disenchanted with the element of consciousness. Being disenchanted, he becomes dispassionate, is liberated, and thus he fully understands.”",
      "sinhala": "භාග්‍යවතුන් වහන්සේ ශ්‍රාවස්තියෙහි වැඩවසන සේක.\n\n‘‘රාහුල, තෝ මේ පිළිබඳව කෙසේ සිතන්නෙහිද? පඨවි ධාතුව (පොළොව යන ධාතුව) නිත්‍යද, අනිත්‍යදැයි?’’\n\n‘‘ස්වාමීනි, අනිත්‍ය යි.’’\n\n‘‘...ආපෝ ධාතුව ද (ජලය යන ධාතුව ද)... තේජෝ ධාතුව ද (ගින්න යන ධාතුව ද)... වායෝ ධාතුව ද (සුළඟ යන ධාතුව ද)... ආකාශ ධාතුව ද (අවකාශ යන ධාතුව ද)... විඤ්ඤාණ ධාතුව ද (විඥානය යන ධාතුව ද) නිත්‍යද, අනිත්‍යදැයි?’’\n\n‘‘ස්වාමීනි, අනිත්‍ය යි.’’\n\n‘‘රාහුල, මෙසේ දකින ඇසූ පිරූ තැන් ඇති ආර්ය ශ්‍රාවකයාණෝ පඨවි ධාතුව කෙරෙහි ද කලකිරෙති... ආපෝ ධාතුව කෙරෙහි ද කලකිරෙති... තේජෝ ධාතුව කෙරෙහි ද කලකිරෙති... වායෝ ධාතුව කෙරෙහි ද කලකිරෙති... ආකාශ ධාතුව කෙරෙහි ද කලකිරෙති... විඤ්ඤාණ ධාතුව කෙරෙහි ද කලකිරෙති... එසේ කලකිරෙමින් යථාර්ථය අවබෝධ කරගනිති.’’",
      "paliTitle": "Dhātusuttaṃ",
      "englishTitle": "The Elements Sutta",
      "sinhalaTitle": "ධාතු සූත්‍රය"
    },
    {
      "number": 197,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… ‘‘vedanā…pe… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… ‘‘evaṃ passaṃ, rāhula, sutavā ariyasāvako rūpasmimpi nibbindati…pe… vedanāyapi nibbindati… saññāyapi nibbindati… saṅkhāresupi nibbindati… viññāṇasmimpi nibbindati; nibbindaṃ virajjati; virāgā vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti. Dasamaṃ. Paṭhamo vaggo. Tassuddānaṃ – Cakkhu rūpañca viññāṇaṃ, samphasso vedanāya ca; Saññā sañcetanā taṇhā, dhātu khandhena te dasāti.",
      "english": "He dwells at Sāvatthi… “What do you think, Rāhula, is form permanent or impermanent?” “Impermanent, Venerable Sir.” “Feeling… perception… mental formations… consciousness—are they permanent or impermanent?” “Impermanent, Venerable Sir.” “Seeing thus, Rāhula, the instructed noble disciple becomes disenchanted with form… he becomes disenchanted with feeling… he becomes disenchanted with perception… he becomes disenchanted with mental formations… he becomes disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. When liberated, the knowledge arises: ‘I am liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, the task has been accomplished, there is nothing further for this state of being.’”",
      "sinhala": "සැවැත්නුවර වැඩවසයි... “රාහුල, ඔබ මේ ගැන කුමක් සිතන්නේද? රූපය නිත්‍ය දැ, අනිත්‍ය දැ?”\n“ස්වාමීනි, අනිත්‍ය ය.”... “වේදනාව... සංඥාව... සංස්කාර... විඥානය නිත්‍ය දැ, අනිත්‍ය දැ?”\n“ස්වාමීනි, අනිත්‍ය ය.”\n\n“රාහුල, මෙසේ දකින ශ්‍රවණය කළ ආර්ය්‍යශ්‍රාවකයා රූපය කෙරෙහි ද කලකිරීමට පත් වේ... වේදනාව කෙරෙහි ද කලකිරීමට පත් වේ... සංඥාව කෙරෙහි ද කලකිරීමට පත් වේ... සංස්කාර කෙරෙහි ද කලකිරීමට පත් වේ... විඥානය කෙරෙහි ද කලකිරීමට පත් වේ. කලකිරීමට පත් වීමෙන් ඔහු නො ඇල්මට පත් වේ; නො ඇල්ම නිසා (රාගයෙන්) මිදෙයි; මිදුණු කල්හි ‘මම මිදුණෙමි’ යන ඥානය ඇති වේ. ‘ඉපදීම ක්ෂය කරන ලදී, බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මේ ආත්මභාවය පිණිස තවත් කළ යුතු කිසිවක් නැත’ යි ඔහු දැනගනී.”\n\nදසවන සූත්‍රය යි. පළමුවන වර්ගය යි. එහි උද්දානය (සංග්‍රහය) නම්:\nඇස, රූපය සහ විඥානය, ස්පර්ශය සහ වේදනාව; සංඥාව, චේතනාව, තෘෂ්ණාව, ධාතු සහ ඛන්ධය යන දසය යි.",
      "paliTitle": "Khandhasuttaṃ",
      "englishTitle": "The Discourse on the Aggregates",
      "sinhalaTitle": "ඛන්ධ සූත්‍රය"
    },
    {
      "number": 198,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati. Atha kho āyasmā rāhulo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rāhulaṃ bhagavā etadavoca – ‘‘taṃ kiṃ maññasi, rāhula, cakkhuṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sotaṃ…pe… ghānaṃ… jivhā… kāyo… mano nicco vā anicco vā’’ti? ‘‘Anicco, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Evaṃ passaṃ, rāhula, sutavā ariyasāvako cakkhusmimpi nibbindati…pe… sotasmimpi nibbindati… ghānasmimpi nibbindati … jivhāyapi nibbindati… kāyasmimpi nibbindati… manasmimpi nibbindati; nibbindaṃ virajjati; virāgā vimuccati; vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti. Etena peyyālena dasa suttantā kātabbā. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling near Sāvatthī.\n\nThen the Venerable Rāhula approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As the Venerable Rāhula was sitting there, the Blessed One said this to him: “What do you think, Rāhula: Is the eye permanent or impermanent?” “Impermanent, venerable sir.” “But is that which is impermanent suffering or pleasant?” “Suffering, venerable sir.” “But is it fitting to regard that which is impermanent, suffering, and subject to change as: ‘This is mine, this is I, this is my self’?” “No, venerable sir.” “The ear... the nose... the tongue... the body... the mind: Is it permanent or impermanent?” “Impermanent, venerable sir.” “But is that which is impermanent suffering or pleasant?” “Suffering, venerable sir.” “But is it fitting to regard that which is impermanent, suffering, and subject to change as: ‘This is mine, this is I, this is my self’?” “No, venerable sir.”\n\n“Seeing thus, Rāhula, the instructed noble disciple becomes disenchanted with the eye; he becomes disenchanted with the ear; he becomes disenchanted with the nose; he becomes disenchanted with the tongue; he becomes disenchanted with the body; he becomes disenchanted with the mind. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. In the liberated state, the knowledge arises: ‘Liberated is it.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more returning to this state of existence.’” Ten discourses should be completed using this repetition formula. The First.",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර වැඩසිටි සේක.\n\nඉක්බිති ආයුෂ්මත් රාහුල තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පසෙක වැඩ සිටියහ. එකත්පසෙක වැඩසිටි ආයුෂ්මත් රාහුල තෙරුන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “රාහුලය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? ඇස නිත්‍යද, අනිත්‍යද?”\n\n“අනිත්‍යය, භාග්‍යවතුන් වහන්ස.”\n\n“යම් දෙයක් අනිත්‍යද, එය දුක්ඛයක්ද, සුවයක්ද?”\n\n“දුක්ඛය, භාග්‍යවතුන් වහන්ස.”\n\n“යම් දෙයක් අනිත්‍යද, දුක්ඛද, වෙනස්වී යන ස්වභාවය ඇත්තේද, ‘මෙය මගේ ය, මම මේ වෙමි, මෙය මගේ ආත්මය ය’ යි එය දැකීම සුදුසු ද?”\n\n“එසේ නොවේ, භාග්‍යවතුන් වහන්ස.”\n\n“කන ද, නාසය ද, දිව ද, කය ද, මනස ද නිත්‍යද, අනිත්‍යද?”\n\n“අනිත්‍යය, භාග්‍යවතුන් වහන්ස.”\n\n“යම් දෙයක් අනිත්‍යද, එය දුක්ඛයක්ද, සුවයක්ද?”\n\n“දුක්ඛය, භාග්‍යවතුන් වහන්ස.”\n\n“යම් දෙයක් අනිත්‍යද, දුක්ඛද, වෙනස්වී යන ස්වභාවය ඇත්තේද, ‘මෙය මගේ ය, මම මේ වෙමි, මෙය මගේ ආත්මය ය’ යි එය දැකීම සුදුසු ද?”\n\n“එසේ නොවේ, භාග්‍යවතුන් වහන්ස.”\n\n“රාහුලය, මෙසේ දකිමින්, ඇසීමෙන් යුක්ත ආර්ය ශ්‍රාවකයා ඇස ගැනත්, කන ගැනත්, නාසය ගැනත්, දිව ගැනත්, කය ගැනත්, මනස ගැනත් කලකිරෙයි. කලකිරෙන ඔහු නොඇලෙයි; නොඇලීමෙන් (විරාගයෙන්) විමුක්ත වෙයි; විමුක්ත වූ කල්හි, ‘මම විමුක්ත යි’ යන ඥානය ඔහුට ඇති වෙයි. ‘ඉපදීම ක්ෂය විය, බ්‍රහ්මචර්යාව (ශ්‍රේෂ්ඨ ජීවිතය) සම්පූර්ණ කරන ලදි, කළ යුතු දේ (කරණීය) කරන ලදි, නැවත මේ භවයට පැමිණීමක් නැත’ යි ඔහු පැහැදිලිව දනියි.”\n\nමේ පේයාල ක්‍රමය අනුව සූත්‍ර දහයක් සම්පූර්ණ කළ යුත්තේ ය. පළමුවැන්නයි.",
      "paliTitle": "Cakkhusuttaṃ",
      "vagga": "Dutiyavaggo",
      "englishTitle": "The Discourse on the Eye",
      "sinhalaTitle": "චක්ඛු සූත්‍රය",
      "vaggaEnglish": "Second Chapter",
      "vaggaSinhala": "දෙවන වර්ගය"
    },
    {
      "number": 199,
      "pali": "Sāvatthiyaṃ viharati…pe… ‘‘taṃ kiṃ maññasi, rāhula, rūpā niccā vā aniccā vā’’ti? ‘‘Aniccā, bhante’’…pe… saddā… gandhā… rasā… phoṭṭhabbā… dhammā…. ‘‘Cakkhuviññāṇaṃ…pe… sotaviññāṇaṃ… ghānaviññāṇaṃ… jivhāviññāṇaṃ… kāyaviññāṇaṃ… manoviññāṇaṃ…. ‘‘Cakkhusamphasso…pe… sotasamphasso… ghānasamphasso… jivhāsamphasso… kāyasamphasso… manosamphasso…. ‘‘Cakkhusamphassajā vedanā…pe… sotasamphassajā vedanā… ghānasamphassajā vedanā… jivhāsamphassajā vedanā… kāyasamphassajā vedanā… manosamphassajā vedanā…. ‘‘Rūpasaññā…pe… saddasaññā… gandhasaññā… rasasaññā… phoṭṭhabbasaññā… dhammasaññā…. ‘‘Rūpasañcetanā…pe… saddasañcetanā… gandhasañcetanā… rasasañcetanā… phoṭṭhabbasañcetanā… dhammasañcetanā…. ‘‘Rūpataṇhā …pe… saddataṇhā… gandhataṇhā… rasataṇhā… phoṭṭhabbataṇhā… dhammataṇhā…. ‘‘Pathavīdhātu…pe… āpodhātu… tejodhātu… vāyodhātu… ākāsadhātu … viññāṇadhātu…. ‘‘Rūpaṃ …pe… vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? Aniccaṃ, bhante…pe… evaṃ passaṃ rāhula…pe… nāparaṃ itthattāyāti pajānātīti. Dasamaṃ.",
      "english": "The Blessed One was dwelling at Sāvatthī.\n\n“What do you think, Rāhula, are forms permanent or impermanent?”\n“Impermanent, venerable sir.”\nSimilarly, sounds, odors, tastes, tangibles, and mental objects are impermanent.\n\nEye consciousness, ear consciousness, nose consciousness, tongue consciousness, body consciousness, and mind consciousness are impermanent.\n\nEye contact, ear contact, nose contact, tongue contact, body contact, and mind contact are impermanent.\n\nFeeling arisen from eye contact, feeling arisen from ear contact, feeling arisen from nose contact, feeling arisen from tongue contact, feeling arisen from body contact, and feeling arisen from mind contact are impermanent.\n\nPerception of forms, perception of sounds, perception of odors, perception of tastes, perception of tangibles, and perception of mental objects are impermanent.\n\nVolition regarding forms, volition regarding sounds, volition regarding odors, volition regarding tastes, volition regarding tangibles, and volition regarding mental objects are impermanent.\n\nCraving for forms, craving for sounds, craving for odors, craving for tastes, craving for tangibles, and craving for mental objects are impermanent.\n\nThe earth element, the water element, the fire element, the wind element, the space element, and the consciousness element are impermanent.\n\n“Are form, feeling, perception, mental formations, and consciousness permanent or impermanent?”\n“Impermanent, venerable sir.”\n\nSeeing thus, Rāhula, the noble disciple becomes disenchanted. Becoming disenchanted, he is detached; through detachment, he is liberated. Knowing this, he fully understands: there is no return to this state of existence.",
      "sinhala": "සැවැත් නුවර වැඩවසන සේක.\n\nරාහුල, ඒ කුමක් සිතන්නෙහිද, රූපයෝ නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස. එසේම ශබ්ද, ගන්ධ, රස, ස්ප්‍රෂ්ටව්‍ය (ස්පර්ශ කළ යුතු දෑ), ධර්ම (මනෝරූප) යන සියල්ලෝම නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස.\n\nචක්ෂුර්විඤ්ඤාණය, ශ්‍රෝතෘවිඤ්ඤාණය, ඝ්‍රාණවිඤ්ඤාණය, ජිහ්වාවිඤ්ඤාණය, කායවිඤ්ඤාණය, මනෝවිඤ්ඤාණය යන මේ සියල්ලෝම නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස.\n\nචක්ෂුස්පර්ශය, ශ්‍රෝතෘස්පර්ශය, ඝ්‍රාණස්පර්ශය, ජිහ්වාස්පර්ශය, කායස්පර්ශය, මනෝස්පර්ශය යන මේ සියල්ලෝම නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස.\n\nචක්ෂුස්පර්ශයෙන් හටගත් වේදනාව, ශ්‍රෝතෘස්පර්ශයෙන් හටගත් වේදනාව, ඝ්‍රාණස්පර්ශයෙන් හටගත් වේදනාව, ජිහ්වාස්පර්ශයෙන් හටගත් වේදනාව, කායස්පර්ශයෙන් හටගත් වේදනාව, මනෝස්පර්ශයෙන් හටගත් වේදනාව යන මේ සියල්ලෝම නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස.\n\nරූපසංඥාව, ශබ්දසංඥාව, ගන්ධසංඥාව, රසසංඥාව, ස්ප්‍රෂ්ටව්‍යසංඥාව, ධර්මසංඥාව යන මේ සියල්ලෝම නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස.\n\nරූපචේතනාව (සංචේතනාව), ශබ්දචේතනාව, ගන්ධචේතනාව, රසචේතනාව, ස්ප්‍රෂ්ටව්‍යචේතනාව, ධර්මචේතනාව යන මේ සියල්ලෝම නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස.\n\nරූපතණ්හාව, ශබ්දතණ්හාව, ගන්ධතණ්හාව, රසතණ්හාව, ස්ප්‍රෂ්ටව්‍යතණ්හාව, ධර්මතණ්හාව යන මේ සියල්ලෝම නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස.\n\nපඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව, ආකාශ ධාතුව, විඤ්ඤාණ ධාතුව යන මේ සියල්ලෝම නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස.\n\nරූපය, වේදනාව, සංඥාව, සංස්කාර, විඤ්ඤාණය නිත්‍යද අනිත්‍යද? අනිත්‍යයි, වහන්ස. රාහුල, මෙසේ දකිමින්, නැවත භවයකට පැමිණීමක් නැතැයි ප්‍රඥාවෙන් දනියි.\n\nදහවන සූත්‍රයයි.",
      "paliTitle": "Rūpādisuttanavakaṃ",
      "englishTitle": "The Nine Discourses on Forms and so on",
      "sinhalaTitle": "රූපාදිසුත්ත නවකය"
    },
    {
      "number": 200,
      "pali": "Sāvatthiyaṃ viharati. Atha kho āyasmā rāhulo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā rāhulo bhagavantaṃ etadavoca – ‘‘kathaṃ nu kho, bhante, jānato kathaṃ passato imasmiñca saviññāṇake kāye bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā na hontī’’ti? ‘‘Yaṃ kiñci, rāhula, rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ rūpaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Yā kāci vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya passati. Evaṃ kho, rāhula, jānato evaṃ passato imasmiñca saviññāṇake kāye bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānānusayā na hontī’’ti. Ekādasamaṃ.",
      "english": "The Blessed One was staying in Sāvatthī. Then Venerable Rāhula approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, Venerable Rāhula said this to the Blessed One: “How, venerable sir, knowing what and seeing what, do the latent tendencies of ‘I-making,’ ‘mine-making,’ and conceit not arise regarding this consciousness-endowed body and regarding all external signs and objects?”\n\n“Rāhula, whatever form there is—be it past, future, or present; internal or external; coarse or subtle; inferior or excellent; far or near—one sees all that form as it really is, with proper wisdom, thus: ‘This is not mine, I am not this, this is not my self.’ Whatever feeling there is, whatever perception there is, whatever mental formations there are, whatever consciousness there is—be it past, future, or present; internal or external; coarse or subtle; inferior or excellent; far or near—one sees all that consciousness as it really is, with proper wisdom, thus: ‘This is not mine, I am not this, this is not my self.’\n\nIt is in this way, Rāhula, knowing this way and seeing this way, that the latent tendencies of ‘I-making,’ ‘mine-making,’ and conceit do not arise regarding this consciousness-endowed body and regarding all external signs and objects.”",
      "sinhala": "ශ්‍රාවස්තියෙහි වැඩවසන සේක. ඉක්බිති ආයුෂ්මත් රාහුල තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනාමාන කොට එකත්පසෙකින් වාඩි වූහ. එකත්පසෙකින් වැඩ සිටි ආයුෂ්මත් රාහුල තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැළකළහ: ‘‘ස්වාමීනි, කෙසේ දැනීමෙන්ද, කෙසේ දැකීමෙන්ද, මේ සවිඤ්ඤාණක වූ ශරීරයෙහිද, බාහිර සියලු නිමිති අරමුණු වලද ‘මම’ යයි ගැනීම, ‘මගේ’ යයි ගැනීම සහ මාන වශයෙන් වූ අනුශය ධර්මයන් හටනොගන්නේද?’’\n\n‘‘රාහුල, අතීත, අනාගත, වර්තමාන වූද, ඇතුළත වූද, පිටත වූද, ස්ථූල වූද, සියුම් වූද, හීන වූද, ප්‍රණීත වූද, දුරින් හෝ ලඟින් පිහිටි යම් කිසි රූපයක් වේද, ඒ සියලු රූපය ‘මෙය මගේ නොවේ, මම නොවේ, මේ මගේ ආත්මය නොවේ’ යැයි මෙසේ යථාර්ථය ලෙස මනා ප්‍රඥාවෙන් දකී. යම් කිසි වේදනාවක් වේද, යම් කිසි සංඥාවක් වේද, යම් කිසි සංස්කාරයන් වේද, අතීත, අනාගත, වර්තමාන වූද, ඇතුළත වූද, පිටත වූද, ස්ථූල වූද, සියුම් වූද, හීන වූද, ප්‍රණීත වූද, දුරින් හෝ ලඟින් පිහිටි යම් කිසි විඤ්ඤාණයක් වේද, ඒ සියලු විඤ්ඤාණය ‘මෙය මගේ නොවේ, මම නොවේ, මේ මගේ ආත්මය නොවේ’ යැයි මෙසේ යථාර්ථය ලෙස මනා ප්‍රඥාවෙන් දකී.\n\nරාහුල, මෙසේ දැනීමෙන්ද, මෙසේ දැකීමෙන්ද, මේ සවිඤ්ඤාණක වූ ශරීරයෙහිද, බාහිර සියලු නිමිති අරමුණු වලද ‘මම’ යයි ගැනීම, ‘මගේ’ යයි ගැනීම සහ මාන වශයෙන් වූ අනුශය ධර්මයන් හටනොගන්නේය.’’",
      "paliTitle": "Anusayasuttaṃ",
      "englishTitle": "The Discourse on Underlying Tendencies",
      "sinhalaTitle": "අනුසය සූත්‍රය"
    },
    {
      "number": 201,
      "pali": "Sāvatthinidānaṃ. Atha kho āyasmā rāhulo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā rāhulo bhagavantaṃ etadavoca – ‘‘kathaṃ nu kho, bhante, jānato kathaṃ passato imasmiṃ ca saviññāṇake kāye bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānāpagataṃ mānasaṃ hoti vidhā samatikkantaṃ santaṃ suvimutta’’nti? ‘‘Yaṃ kiñci, rāhula, rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā sabbaṃ rūpaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya disvā anupādā vimutto hoti’’. ‘‘Yā kāci vedanā…pe… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya disvā anupādā vimutto hoti. Evaṃ kho, rāhula, jānato evaṃ passato imasmiñca saviññāṇake kāye bahiddhā ca sabbanimittesu ahaṅkāramamaṅkāramānāpagataṃ mānasaṃ hoti vidhā samatikkantaṃ santaṃ suvimutta’’nti. Dvādasamaṃ. Dutiyo vaggo. Tassuddānaṃ – Cakkhu rūpañca viññāṇaṃ, samphasso vedanāya ca; Saññā sañcetanā taṇhā, dhātu khandhena te dasa; Anusayaṃ apagatañceva, vaggo tena pavuccatīti. ",
      "english": "The discourse took place at Sāvatthī.\n\nThen the Venerable Rāhula approached the Blessed One. Having approached and greeted the Blessed One, he sat down to one side. Sitting to one side, Venerable Rāhula asked the Blessed One, “How, good sir, by knowing what and by seeing what, does the mind become thoroughly liberated, peaceful, having fully transcended the differentiations of existence, and free from I-making, my-making, and conceit, regarding this conscious body and all external sign-objects?”\n\n“Rāhula, whatever form there is—past, future, or present; internal or external; coarse or subtle; inferior or excellent; far or near—by seeing all that form as it truly is with correct perfect wisdom, thus: ‘This is not mine, I am not this, this is not my self,’ one becomes liberated through non-clinging.”\n\n“Whatever feeling there is... whatever perception there is... whatever mental formations there are... whatever consciousness there is—past, future, or present; internal or external; coarse or subtle; inferior or excellent; far or near—by seeing all that consciousness as it truly is with correct perfect wisdom, thus: ‘This is not mine, I am not this, this is not my self,’ one becomes liberated through non-clinging. In this way, Rāhula, by knowing thus and seeing thus, the mind becomes thoroughly liberated, peaceful, having fully transcended the differentiations of existence, and free from I-making, my-making, and conceit, regarding this conscious body and all external sign-objects.”\n\nThe Twelfth. The Second Chapter. The summary list for this is: Eye, and form, and consciousness; contact, and feeling; perception, volition, craving; element, and with the aggregates, these ten. And freed from underlying tendencies: thus is the chapter proclaimed.",
      "sinhala": "සැවැත්නුවරදී සිදුවිය. ඉන්පසු ආයුෂ්මත් රාහුල තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වැඩ සිටි ආයුෂ්මත් රාහුල තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය පැවසුවෝය: ‘ස්වාමීනි, කෙසේ දැනීමෙන්ද, කෙසේ දැකීමෙන්ද, මෙම සවිඥාණක ශරීරයෙහිද, බාහිරව ඇති සියලු නිමිති (ලක්ෂණ) කෙරෙහිද, \"මම වෙමි\" යන අහංකාරයත්, \"මාගේය\" යන මමංකාරයත්, මානයත් පහව ගිය සිත් ඇතිවන්නේද, විධාව ඉක්මවා ගිය, ශාන්ත වූ, මැනවින් විමුක්ත වූ සිත් ඇති වන්නේද?’\n\n‘රාහුලය, අතීත, අනාගත, වර්තමාන වූ යම් රූපයක් ඇද්ද, එය ඇතුළත හෝ වේවා, පිටත හෝ වේවා, ගොරෝසු හෝ වේවා, සියුම් හෝ වේවා, හීන වූ හෝ වේවා, ප්‍රණීත වූ හෝ වේවා, දුර ඇති හෝ වේවා, ළඟ ඇති හෝ වේවා, ඒ සියලු රූපය ‘මෙය මාගේ නොවේ, මම එය නොවෙමි, මෙය මාගේ ආත්මය නොවේ’ යැයි, මෙසේ එය ඇති සැටියෙන් මැනවින් ප්‍රඥාවෙන් දැක, උපාදානය නොවී විමුක්ත වන්නේය. යම් වේදනා ඇද්ද... යම් සංඥා ඇද්ද... යම් සංස්කාර ඇද්ද... අතීත, අනාගත, වර්තමාන වූ යම් විඥානයක් ඇද්ද, එය ඇතුළත හෝ වේවා, පිටත හෝ වේවා, ගොරෝසු හෝ වේවා, සියුම් හෝ වේවා, හීන වූ හෝ වේවා, ප්‍රණීත වූ හෝ වේවා, දුර ඇති හෝ වේවා, ළඟ ඇති හෝ වේවා, ඒ සියලු විඥානය ‘මෙය මාගේ නොවේ, මම එය නොවෙමි, මෙය මාගේ ආත්මය නොවේ’ යැයි, මෙසේ එය ඇති සැටියෙන් මැනවින් ප්‍රඥාවෙන් දැක, උපාදානය නොවී විමුක්ත වන්නේය.\n\n‘රාහුලය, මෙසේ දැනීමෙන්, මෙසේ දැකීමෙන්, මෙම සවිඥාණක ශරීරයෙහිද, බාහිරව ඇති සියලු නිමිති කෙරෙහිද, අහංකාරයත්, මමංකාරයත්, මානයත් පහව ගිය, විධාව ඉක්මවා ගිය, ශාන්ත වූ, මැනවින් විමුක්ත වූ සිත් ඇති වන්නේය.’\n\nදොළොස්වන සූත්‍රයයි. දෙවෙනි වර්ගයයි. එහි උද්දානය නම්: ඇස, රූපය, විඥානය, ස්පර්ශය, වේදනාව, සංඥාව, සංචේතනා, තණ්හාව, ධාතු සහ ඛන්ධ යන දසයයි. අනුසය පහවීමද ඇතුළත් වන හෙයින් එම වර්ගය එසේ කියනු ලැබේ.",
      "paliTitle": "Apagatasuttaṃ",
      "englishTitle": "Departed Sutta",
      "sinhalaTitle": "අපගත සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Rāhulasaṃyuttaṃ samattaṃ.",
    "english": "The Linked Discourses with Rāhula is complete.",
    "sinhala": "රාහුල සංයුක්තය සමාප්තයි."
  }
}