{
  "id": "snp.2",
  "title": {
    "pali": "Cūḷavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 224,
      "pali": "Yānīdha bhūtāni samāgatāni, bhummāni [bhūmāni (ka.)] vā yāni va antalikkhe; Sabbeva bhūtā sumanā bhavantu, athopi sakkacca suṇantu bhāsitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Ratanasuttaṃ"
    },
    {
      "number": 225,
      "pali": "Tasmā hi bhūtā nisāmetha sabbe, mettaṃ karotha mānusiyā pajāya; Divā ca ratto ca haranti ye baliṃ, tasmā hi ne rakkhatha appamattā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 226,
      "pali": "Yaṃ kiñci vittaṃ idha vā huraṃ vā, saggesu vā yaṃ ratanaṃ paṇītaṃ; Na no samaṃ atthi tathāgatena, idampi buddhe ratanaṃ paṇītaṃ; Etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 227,
      "pali": "Khayaṃ virāgaṃ amataṃ paṇītaṃ, yadajjhagā sakyamunī samāhito; Na tena dhammena samatthi kiñci, idampi dhamme ratanaṃ paṇītaṃ; Etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 228,
      "pali": "Yaṃ buddhaseṭṭho parivaṇṇayī suciṃ, samādhimānantarikaññamāhu; Samādhinā tena samo na vijjati, idampi dhamme ratanaṃ paṇītaṃ; Etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 229,
      "pali": "Ye puggalā aṭṭha sataṃ pasatthā, cattāri etāni yugāni honti; Te dakkhiṇeyyā sugatassa sāvakā, etesu dinnāni mahapphalāni; Idampi saṅghe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 230,
      "pali": "Ye suppayuttā manasā daḷhena, nikkāmino gotamasāsanamhi; Te pattipattā amataṃ vigayha, laddhā mudhā nibbutiṃ [nibbuti (ka.)] bhuñjamānā; Idampi saṅghe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 231,
      "pali": "Yathindakhīlo pathavissito [padavissito (ka. sī.), paṭhaviṃ sito (ka. sī. syā. kaṃ. pī.)] siyā, catubbhi vātehi asampakampiyo; Tathūpamaṃ sappurisaṃ vadāmi, yo ariyasaccāni avecca passati; Idampi saṅghe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 232,
      "pali": "Ye ariyasaccāni vibhāvayanti, gambhīrapaññena sudesitāni; Kiñcāpi te honti bhusaṃ pamattā, na te bhavaṃ aṭṭhamamādiyanti; Idampi saṅghe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 233,
      "pali": "Sahāvassa dassanasampadāya [sahāvasaddassanasampadāya (ka.)], tayassu dhammā jahitā bhavanti; Sakkāyadiṭṭhi vicikicchitañca, sīlabbataṃ vāpi yadatthi kiñci.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 234,
      "pali": "Catūhapāyehi ca vippamutto, chaccābhiṭhānāni [cha cābhiṭhānāni (sī. syā.)] bhabba kātuṃ [abhabbo kātuṃ (sī.)]; Idampi saṅghe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 235,
      "pali": "Kiñcāpi so kamma [kammaṃ (sī. syā. kaṃ. pī.)] karoti pāpakaṃ, kāyena vācā uda cetasā vā; Abhabba [abhabbo (bahūsu)] so tassa paṭicchadāya [paṭicchādāya (sī.)], abhabbatā diṭṭhapadassa vuttā; Idampi saṅghe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 236,
      "pali": "Vanappagumbe yatha [yathā (sī. syā.)] phussitagge, gimhānamāse paṭhamasmiṃ [paṭhamasmi (?)] gimhe; Tathūpamaṃ dhammavaraṃ adesayi [adesayī (sī.)], nibbānagāmiṃ paramaṃ hitāya; Idampi buddhe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 237,
      "pali": "Varo varaññū varado varāharo, anuttaro dhammavaraṃ adesayi; Idampi buddhe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 238,
      "pali": "Khīṇaṃ purāṇaṃ nava natthi sambhavaṃ, virattacittāyatike bhavasmiṃ; Te khīṇabījā avirūḷhichandā, nibbantntti dhīrā yathāyaṃ [yathayaṃ (ka.)] padīpo; Idampi saṅghe ratanaṃ paṇītaṃ, etena saccena suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 239,
      "pali": "Yānīdha bhūtāni samāgatāni, bhummāni vā yāni va antalikkhe; Tathāgataṃ devamanussapūjitaṃ, buddhaṃ namassāma suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 240,
      "pali": "Yānīdha bhūtāni samāgatāni, bhummāni vā yāni va antalikkhe; Tathāgataṃ devamanussapūjitaṃ, dhammaṃ namassāma suvatthi hotu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 241,
      "pali": "Yānīdha bhūtāni samāgatāni, bhummāni vā yāni va antalikkhe; Tathāgataṃ devamanussapūjitaṃ, saṅghaṃ namassāma suvatthi hotūti. Ratanasuttaṃ paṭhamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 242,
      "pali": "‘‘Sāmākaciṅgūlakacīnakāni ca, pattapphalaṃ mūlaphalaṃ gavipphalaṃ; Dhammena laddhaṃ satamasnamānā [satamasamānā (sī. pī.), satamassamānā (syā. kaṃ.)], na kāmakāmā alikaṃ bhaṇanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Āmagandhasuttaṃ"
    },
    {
      "number": 243,
      "pali": "‘‘Yadasnamāno sukataṃ suniṭṭhitaṃ, parehi dinnaṃ payataṃ paṇītaṃ; Sālīnamannaṃ paribhuñjamāno, so bhuñjasī kassapa āmagandhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 244,
      "pali": "‘‘Na āmagandho mama kappatīti, icceva tvaṃ bhāsasi brahmabandhu; Sālīnamannaṃ paribhuñjamāno, sakuntamaṃsehi susaṅkhatehi; Pucchāmi taṃ kassapa etamatthaṃ, kathaṃ pakāro tava āmagandho’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 245,
      "pali": "‘‘Pāṇātipāto vadhachedabandhanaṃ, theyyaṃ musāvādo nikativañcanāni ca; Ajjhenakuttaṃ [ajjhena kujjaṃ (sī. pī.)] paradārasevanā, esāmagandho na hi maṃsabhojanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 246,
      "pali": "‘‘Ye idha kāmesu asaññatā janā, rasesu giddhā asucibhāvamassitā [asucīkamissitā (sī. syā. kaṃ. pī.)]; Natthikadiṭṭhī visamā durannayā, esāmagandho na hi maṃsabhojanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 247,
      "pali": "‘‘Ye lūkhasā dāruṇā piṭṭhimaṃsikā [ye lūkharasā dāruṇā parapiṭṭhimaṃsikā (ka.)], mittadduno nikkaruṇātimānino; Adānasīlā na ca denti kassaci, esāmagandho na hi maṃsabhojanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 248,
      "pali": "‘‘Kodho mado thambho paccupaṭṭhāpanā [paccuṭṭhāpanā ca (sī. syā.), paccuṭṭhāpanā (pī.)], māyā usūyā bhassasamussayo ca; Mānātimāno ca asabbhi santhavo, esāmagandho na hi maṃsabhojanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 249,
      "pali": "‘‘Ye pāpasīlā iṇaghātasūcakā, vohārakūṭā idha pāṭirūpikā [pātirūpikā (?)]; Narādhamā yedha karonti kibbisaṃ, esāmagandho na hi maṃsabhojanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 250,
      "pali": "‘‘Ye idha pāṇesu asaññatā janā, paresamādāya vihesamuyyutā; Dussīlaluddā pharusā anādarā, esāmagandho na hi maṃsabhojanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 251,
      "pali": "‘‘Etesu giddhā viruddhātipātino, niccuyyutā pecca tamaṃ vajanti ye; Patanti sattā nirayaṃ avaṃsirā, esāmagandho na hi maṃsabhojanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 252,
      "pali": "‘‘Na macchamaṃsānamanāsakattaṃ [na macchamaṃsaṃ na anāsakattaṃ (sī. aṭṭha mūlapāṭho), na maṃcchamaṃsānānāsakattaṃ (syā. ka.)], na naggiyaṃ na muṇḍiyaṃ jaṭājallaṃ; Kharājināni nāggihuttassupasevanā, ye vāpi loke amarā bahū tapā; Mantāhutī yaññamutūpasevanā, sodhenti maccaṃ avitiṇṇakaṅkhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 253,
      "pali": "‘‘Yo tesu [sotesu (sī. pī.)] gutto viditindriyo care, dhamme ṭhito ajjavamaddave rato; Saṅgātigo sabbadukkhappahīno, na lippati [na limpati (syā. kaṃ ka.)] diṭṭhasutesu dhīro’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 254,
      "pali": "Iccetamatthaṃ bhagavā punappunaṃ, akkhāsi naṃ [taṃ (sī. pī.)] vedayi mantapāragū; Citrāhi gāthāhi munī pakāsayi, nirāmagandho asito durannayo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 255,
      "pali": "Sutvāna buddhassa subhāsitaṃ padaṃ, nirāmagandhaṃ sabbadukkhappanūdanaṃ; Nīcamano vandi tathāgatassa, tattheva pabbajjamarocayitthāti. Āmagandhasuttaṃ dutiyaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 256,
      "pali": "Hiriṃ tarantaṃ vijigucchamānaṃ, tavāhamasmi [sakhāhamasmi (sī. syā. kaṃ. pī.)] iti bhāsamānaṃ; Sayhāni kammāni anādiyantaṃ, neso mamanti iti naṃ vijaññā.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Hirisuttaṃ"
    },
    {
      "number": 257,
      "pali": "Ananvayaṃ [atthanvayaṃ (ka.)] piyaṃ vācaṃ, yo mittesu pakubbati; Akarontaṃ bhāsamānaṃ, parijānanti paṇḍitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 258,
      "pali": "Na so mitto yo sadā appamatto, bhedāsaṅkī randhamevānupassī; Yasmiñca seti urasīva putto, sa ve mitto yo parehi abhejjo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 259,
      "pali": "Pāmujjakaraṇaṃ ṭhānaṃ, pasaṃsāvahanaṃ sukhaṃ; Phalānisaṃso bhāveti, vahanto porisaṃ dhuraṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 260,
      "pali": "Pavivekarasaṃ pitvā, rasaṃ upasamassa ca; Niddaro hoti nippāpo, dhammapītirasaṃ pivanti. Hirisuttaṃ tatiyaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho sā devatā bhagavantaṃ gāthāya ajjhabhāsi –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 261,
      "pali": "‘‘Bahū devā manussā ca, maṅgalāni acintayuṃ; Ākaṅkhamānā sotthānaṃ, brūhi maṅgalamuttamaṃ’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Maṅgalasuttaṃ"
    },
    {
      "number": 262,
      "pali": "‘‘Asevanā ca bālānaṃ, paṇḍitānañca sevanā; Pūjā ca pūjaneyyānaṃ [pūjanīyānaṃ (sī. syā. kaṃ. pī.)], etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 263,
      "pali": "‘‘Patirūpadesavāso ca, pubbe ca katapuññatā; Attasammāpaṇidhi [attasammāpaṇīdhī (katthaci)] ca, etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 264,
      "pali": "‘‘Bāhusaccañca sippañca, vinayo ca susikkhito; Subhāsitā ca yā vācā, etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 265,
      "pali": "‘‘Mātāpitu upaṭṭhānaṃ, puttadārassa saṅgaho; Anākulā ca kammantā, etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 266,
      "pali": "‘‘Dānañca dhammacariyā ca, ñātakānañca saṅgaho; Anavajjāni kammāni, etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 267,
      "pali": "‘‘Āratī viratī pāpā, majjapānā ca saṃyamo; Appamādo ca dhammesu, etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 268,
      "pali": "‘‘Gāravo ca nivāto ca, santuṭṭhi ca kataññutā; Kālena dhammassavanaṃ [dhammasavaṇaṃ (katthaci), dhammasavanaṃ (sī. ka.)], etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 269,
      "pali": "‘‘Khantī ca sovacassatā, samaṇānañca dassanaṃ; Kālena dhammasākacchā, etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 270,
      "pali": "‘‘Tapo ca brahmacariyañca, ariyasaccāna dassanaṃ; Nibbānasacchikiriyā ca, etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 271,
      "pali": "‘‘Phuṭṭhassa lokadhammehi, cittaṃ yassa na kampati; Asokaṃ virajaṃ khemaṃ, etaṃ maṅgalamuttamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 272,
      "pali": "‘‘Etādisāni katvāna, sabbatthamaparājitā; Sabbattha sotthiṃ gacchanti, taṃ tesaṃ maṅgalamuttama’’nti. Maṅgalasuttaṃ catutthaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā gayāyaṃ viharati ṭaṅkitamañce sūcilomassa yakkhassa bhavane. Tena kho pana samayena kharo ca yakkho sūcilomo ca yakkho bhagavato avidūre atikkamanti. Atha kho kharo yakkho sūcilomaṃ yakkhaṃ etadavoca – ‘‘eso samaṇo’’ti. ‘‘Neso samaṇo, samaṇako eso. Yāvāhaṃ jānāmi [yāva jānāmi (sī. pī.)] yadi vā so samaṇo [yadi vā samaṇo (syā.)], yadi vā so samaṇako’’ti [yadi vā samaṇakoti (sī. syā. pī.)]. Atha kho sūcilomo yakkho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato kāyaṃ upanāmesi. Atha kho bhagavā kāyaṃ apanāmesi. Atha kho sūcilomo yakkho bhagavantaṃ etadavoca – ‘‘bhāyasi maṃ, samaṇā’’ti? ‘‘Na khvāhaṃ taṃ, āvuso, bhāyāmi; api ca te sapphasso pāpako’’ti. ‘‘Pañhaṃ taṃ, samaṇa, pucchissāmi. Sace me na byākarissasi, cittaṃ vā te khipissāmi, hadayaṃ vā te phālessāmi, pādesu vā gahetvā pāragaṅgāya khipissāmī’’ti. ‘‘Na khvāhaṃ taṃ, āvuso, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yo me cittaṃ vā khipeyya hadayaṃ vā phāleyya pādesu vā gahetvā pāragaṅgāya khipeyya. Api ca tvaṃ, āvuso, puccha yadākaṅkhasī’’ti. Atha kho sūcilomo yakkho bhagavantaṃ gāthāya ajjhabhāsi –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 273,
      "pali": "‘‘Rāgo ca doso ca kutonidānā, aratī ratī lomahaṃso kutojā; Kuto samuṭṭhāya manovitakkā, kumārakā dhaṅkamivossajanti’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sūcilomasuttaṃ"
    },
    {
      "number": 274,
      "pali": "‘‘Rāgo ca doso ca itonidānā, aratī ratī lomahaṃso itojā; Ito samuṭṭhāya manovitakkā, kumārakā dhaṅkamivossajanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 274,
      "pali": "‘‘Snehajā attasambhūtā, nigrodhasseva khandhajā; Puthū visattā kāmesu, māluvāva vitatāvane.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 275,
      "pali": "‘‘Ye naṃ pajānanti yatonidānaṃ, te naṃ vinodenti suṇohi yakkha; Te duttaraṃ oghamimaṃ taranti, atiṇṇapubbaṃ apunabbhavāyā’’ti. Sūcilomasuttaṃ pañcamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 276,
      "pali": "Dhammacariyaṃ brahmacariyaṃ, etadāhu vasuttamaṃ; Pabbajitopi ce hoti, agārā anagāriyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dhammacariyasuttaṃ"
    },
    {
      "number": 277,
      "pali": "So ce mukharajātiko, vihesābhirato mago; Jīvitaṃ tassa pāpiyo, rajaṃ vaḍḍheti attano.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 278,
      "pali": "Kalahābhirato bhikkhu, mohadhammena āvuto; Akkhātampi na jānāti, dhammaṃ buddhena desitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 279,
      "pali": "Vihesaṃ bhāvitattānaṃ, avijjāya purakkhato; Saṃkilesaṃ na jānāti, maggaṃ nirayagāminaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 280,
      "pali": "Vinipātaṃ samāpanno, gabbhā gabbhaṃ tamā tamaṃ; Sa ve tādisako bhikkhu, pecca dukkhaṃ nigacchati.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 281,
      "pali": "Gūthakūpo yathā assa, sampuṇṇo gaṇavassiko; Yo ca evarūpo assa, dubbisodho hi sāṅgaṇo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 282,
      "pali": "Yaṃ evarūpaṃ jānātha, bhikkhavo gehanissitaṃ; Pāpicchaṃ pāpasaṅkappaṃ, pāpaācāragocaraṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 283,
      "pali": "Sabbe samaggā hutvāna, abhinibbajjiyātha [abhinibbajjayātha (sī. pī. a. ni. 8.10)] naṃ; Kāraṇḍavaṃ [kāraṇḍaṃ va (syā. ka.) a. ni. 8.10] niddhamatha, kasambuṃ apakassatha [avakassatha (sī. syā. ka.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 284,
      "pali": "Tato palāpe [palāse (ka.)] vāhetha, assamaṇe samaṇamānine; Niddhamitvāna pāpicche, pāpaācāragocare.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 285,
      "pali": "Suddhā suddhehi saṃvāsaṃ, kappayavho patissatā; Tato samaggā nipakā, dukkhassantaṃ karissathāti. Dhammacariyasuttaṃ [kapilasuttaṃ (aṭṭha.)] chaṭṭhaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho sambahulā kosalakā brāhmaṇamahāsālā jiṇṇā vuḍḍhā mahallakā addhagatā vayoanuppattā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavatā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te brāhmaṇamahāsālā bhagavantaṃ etadavocuṃ – ‘‘sandissanti nu kho, bho gotama, etarahi brāhmaṇā porāṇānaṃ brāhmaṇānaṃ brāhmaṇadhamme’’ti? ‘‘Na kho, brāhmaṇā, sandissanti etarahi brāhmaṇā porāṇānaṃ brāhmaṇānaṃ brāhmaṇadhamme’’ti. ‘‘Sādhu no bhavaṃ gotamo porāṇānaṃ brāhmaṇānaṃ brāhmaṇadhammaṃ bhāsatu, sace bhoto gotamassa agarū’’ti. ‘‘Tena hi, brāhmaṇā, suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho te brāhmaṇamahāsālā bhagavato paccassosuṃ. Bhagavā etadavoca –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 286,
      "pali": "‘‘Isayo pubbakā āsuṃ, saññatattā tapassino; Pañca kāmaguṇe hitvā, attadatthamacārisuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Brāhmaṇadhammikasuttaṃ"
    },
    {
      "number": 287,
      "pali": "‘‘Na pasū brāhmaṇānāsuṃ, na hiraññaṃ na dhāniyaṃ; Sajjhāyadhanadhaññāsuṃ, brahmaṃ nidhimapālayuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 288,
      "pali": "‘‘Yaṃ nesaṃ pakataṃ āsi, dvārabhattaṃ upaṭṭhitaṃ; Saddhāpakatamesānaṃ, dātave tadamaññisuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 289,
      "pali": "‘‘Nānārattehi vatthehi, sayanehāvasathehi ca; Phītā janapadā raṭṭhā, te namassiṃsu brāhmaṇe.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 290,
      "pali": "‘‘Avajjhā brāhmaṇā āsuṃ, ajeyyā dhammarakkhitā; Na ne koci nivāresi, kuladvāresu sabbaso.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 291,
      "pali": "‘‘Aṭṭhacattālīsaṃ vassāni, (komāra) brahmacariyaṃ cariṃsu te; Vijjācaraṇapariyeṭṭhiṃ, acaruṃ brāhmaṇā pure.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 292,
      "pali": "‘‘Na brāhmaṇā aññamagamuṃ, napi bhariyaṃ kiṇiṃsu te; Sampiyeneva saṃvāsaṃ, saṅgantvā samarocayuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 293,
      "pali": "‘‘Aññatra tamhā samayā, utuveramaṇiṃ pati; Antarā methunaṃ dhammaṃ, nāssu gacchanti brāhmaṇā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 294,
      "pali": "‘‘Brahmacariyañca sīlañca, ajjavaṃ maddavaṃ tapaṃ; Soraccaṃ avihiṃsañca, khantiñcāpi avaṇṇayuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 295,
      "pali": "‘‘Yo nesaṃ paramo āsi, brahmā daḷhaparakkamo; Sa vāpi methunaṃ dhammaṃ, supinantepi nāgamā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 296,
      "pali": "‘‘Tassa vattamanusikkhantā, idheke viññujātikā; Brahmacariyañca sīlañca, khantiñcāpi avaṇṇayuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 297,
      "pali": "‘‘Taṇḍulaṃ sayanaṃ vatthaṃ, sappitelañca yāciya; Dhammena samodhānetvā, tato yaññamakappayuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 298,
      "pali": "‘‘Upaṭṭhitasmiṃ yaññasmiṃ, nāssu gāvo haniṃsu te; Yathā mātā pitā bhātā, aññe vāpi ca ñātakā; Gāvo no paramā mittā, yāsu jāyanti osadhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 299,
      "pali": "‘‘Annadā baladā cetā, vaṇṇadā sukhadā tathā [sukhadā ca tā (ka.)]; Etamatthavasaṃ ñatvā, nāssu gāvo haniṃsu te.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 300,
      "pali": "‘‘Sukhumālā mahākāyā, vaṇṇavanto yasassino; Brāhmaṇā sehi dhammehi, kiccākiccesu ussukā; Yāva loke avattiṃsu, sukhamedhitthayaṃ pajā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 301,
      "pali": "‘‘Tesaṃ āsi vipallāso, disvāna aṇuto aṇuṃ; Rājino ca viyākāraṃ, nāriyo samalaṅkatā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 302,
      "pali": "‘‘Rathe cājaññasaṃyutte, sukate cittasibbane; Nivesane nivese ca, vibhatte bhāgaso mite.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 303,
      "pali": "‘‘Gomaṇḍalaparibyūḷhaṃ, nārīvaragaṇāyutaṃ; Uḷāraṃ mānusaṃ bhogaṃ, abhijjhāyiṃsu brāhmaṇā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 304,
      "pali": "‘‘Te tattha mante ganthetvā, okkākaṃ tadupāgamuṃ; Pahūtadhanadhaññosi, yajassu bahu te vittaṃ; Yajassu bahu te dhanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 305,
      "pali": "‘‘Tato ca rājā saññatto, brāhmaṇehi rathesabho; Assamedhaṃ purisamedhaṃ, sammāpāsaṃ vājapeyyaṃ niraggaḷaṃ; Ete yāge yajitvāna, brāhmaṇānamadā dhanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 306,
      "pali": "‘‘Gāvo sayanañca vatthañca, nāriyo samalaṅkatā; Rathe cājaññasaṃyutte, sukate cittasibbane.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 307,
      "pali": "‘‘Nivesanāni rammāni, suvibhattāni bhāgaso; Nānādhaññassa pūretvā, brāhmaṇānamadā dhanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 308,
      "pali": "‘‘Te ca tattha dhanaṃ laddhā, sannidhiṃ samarocayuṃ; Tesaṃ icchāvatiṇṇānaṃ, bhiyyo taṇhā pavaḍḍhatha; Te tattha mante ganthetvā, okkākaṃ punamupāgamuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 309,
      "pali": "‘‘Yathā āpo ca pathavī ca, hiraññaṃ dhanadhāniyaṃ; Evaṃ gāvo manussānaṃ, parikkhāro so hi pāṇinaṃ; Yajassu bahu te vittaṃ, yajassu bahu te dhanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 310,
      "pali": "‘‘Tato ca rājā saññatto, brāhmaṇehi rathesabho; Nekā satasahassiyo, gāvo yaññe aghātayi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 311,
      "pali": "‘‘Na pādā na visāṇena, nāssu hiṃsanti kenaci; Gāvo eḷakasamānā, soratā kumbhadūhanā; Tā visāṇe gahetvāna, rājā satthena ghātayi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 312,
      "pali": "‘‘Tato devā pitaro ca [tato ca devā pitaro (sī. syā.)], indo asurarakkhasā; Adhammo iti pakkanduṃ, yaṃ satthaṃ nipatī gave.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 313,
      "pali": "‘‘Tayo rogā pure āsuṃ, icchā anasanaṃ jarā; Pasūnañca samārambhā, aṭṭhānavutimāgamuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 314,
      "pali": "‘‘Eso adhammo daṇḍānaṃ, okkanto purāṇo ahu; Adūsikāyo haññanti, dhammā dhaṃsanti [dhaṃsenti (sī. pī.)] yājakā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 315,
      "pali": "‘‘Evameso aṇudhammo, porāṇo viññugarahito; Yattha edisakaṃ passati, yājakaṃ garahatī [garahī (ka.)] jano.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 316,
      "pali": "‘‘Evaṃ dhamme viyāpanne, vibhinnā suddavessikā; Puthū vibhinnā khattiyā, patiṃ bhariyāvamaññatha.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 317,
      "pali": "‘‘Khattiyā brahmabandhū ca, ye caññe gottarakkhitā; Jātivādaṃ niraṃkatvā [nirākatvā (?) yathā anirākatajjhānoti], kāmānaṃ vasamanvagu’’nti. Evaṃ vutte, te brāhmaṇamahāsālā bhagavantaṃ etadavocuṃ – ‘‘abhikkantaṃ, bho gotama…pe. … upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete saraṇaṃ gate’’ti. Brāhmaṇadhammikasuttaṃ sattamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 318,
      "pali": "Yasmā hi dhammaṃ puriso vijaññā, indaṃva naṃ devatā pūjayeyya; So pūjito tasmi pasannacitto, bahussuto pātukaroti dhammaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nāvāsuttaṃ"
    },
    {
      "number": 319,
      "pali": "Tadaṭṭhikatvāna nisamma dhīro, dhammānudhammaṃ paṭipajjamāno; Viññū vibhāvī nipuṇo ca hoti, yo tādisaṃ bhajati appamatto.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 320,
      "pali": "Khuddañca bālaṃ upasevamāno, anāgatatthañca usūyakañca; Idheva dhammaṃ avibhāvayitvā, avitiṇṇakaṅkho maraṇaṃ upeti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 321,
      "pali": "Yathā naro āpagamotaritvā, mahodakaṃ salilaṃ sīghasotaṃ; So vuyhamāno anusotagāmī, kiṃ so pare sakkhati tārayetuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 322,
      "pali": "Tatheva dhammaṃ avibhāvayitvā, bahussutānaṃ anisāmayatthaṃ; Sayaṃ ajānaṃ avitiṇṇakaṅkho, kiṃ so pare sakkhati nijjhapetuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 323,
      "pali": "Yathāpi nāvaṃ daḷhamāruhitvā, phiyena [piyena (sī. syā.)] rittena samaṅgibhūto; So tāraye tattha bahūpi aññe, tatrūpayaññū kusalo mutīmā [matīmā (syā. ka.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 324,
      "pali": "Evampi yo vedagu bhāvitatto, bahussuto hoti avedhadhammo; So kho pare nijjhapaye pajānaṃ, sotāvadhānūpanisūpapanne.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 325,
      "pali": "Tasmā have sappurisaṃ bhajetha, medhāvinañceva bahussutañca; Aññāya atthaṃ paṭipajjamāno, viññātadhammo sa sukhaṃ [so sukhaṃ (sī.)] labhethāti. Nāvāsuttaṃ aṭṭhamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 326,
      "pali": "‘‘Kiṃsīlo kiṃsamācāro, kāni kammāni brūhayaṃ; Naro sammā niviṭṭhassa, uttamatthañca pāpuṇe’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Kiṃsīlasuttaṃ"
    },
    {
      "number": 327,
      "pali": "‘‘Vuḍḍhāpacāyī anusūyako siyā, kālaññū [kālaññu (sī. syā.)] cassa garūnaṃ [garūnaṃ (sī.)] dassanāya; Dhammiṃ kathaṃ erayitaṃ khaṇaññū, suṇeyya sakkacca subhāsitāni.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 328,
      "pali": "‘‘Kālena gacche garūnaṃ sakāsaṃ, thambhaṃ niraṃkatvā [nirākatvā (?) ni + ā + kara + tvā] nivātavutti; Atthaṃ dhammaṃ saṃyamaṃ brahmacariyaṃ, anussare ceva samācare ca.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 329,
      "pali": "‘‘Dhammārāmo dhammarato, dhamme ṭhito dhammavinicchayaññū; Nevācare dhammasandosavādaṃ, tacchehi nīyetha subhāsitehi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 330,
      "pali": "‘‘Hassaṃ jappaṃ paridevaṃ padosaṃ, māyākataṃ kuhanaṃ giddhi mānaṃ; Sārambhaṃ kakkasaṃ kasāvañca mucchaṃ [sārambha kakkassa kasāva mucchaṃ (syā. pī.)], hitvā care vītamado ṭhitatto.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 331,
      "pali": "‘‘Viññātasārāni subhāsitāni, sutañca viññātasamādhisāraṃ; Na tassa paññā ca sutañca vaḍḍhati, yo sāhaso hoti naro pamatto.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 332,
      "pali": "‘‘Dhamme ca ye ariyapavedite ratā, Anuttarā te vacasā manasā kammunā ca; Te santisoraccasamādhisaṇṭhitā, Sutassa paññāya ca sāramajjhagū’’ti. Kiṃsīlasuttaṃ navamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 333,
      "pali": "Uṭṭhahatha nisīdatha, ko attho supitena vo; Āturānañhi kā niddā, sallaviddhāna ruppataṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Uṭṭhānasuttaṃ"
    },
    {
      "number": 334,
      "pali": "Uṭṭhahatha nisīdatha, daḷhaṃ sikkhatha santiyā; Mā vo pamatte viññāya, maccurājā amohayittha vasānuge.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 335,
      "pali": "Yāya devā manussā ca, sitā tiṭṭhanti atthikā; Tarathetaṃ visattikaṃ, khaṇo vo [khaṇo ve (pī. ka.)] mā upaccagā; Khaṇātītā hi socanti, nirayamhi samappitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 336,
      "pali": "Pamādo rajo pamādo, pamādānupatito rajo; Appamādena vijjāya, abbahe [abbūḷhe (syā. pī.), abbuhe (ka. aṭṭha.)] sallamattanoti. Uṭṭhānasuttaṃ dasamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 337,
      "pali": "‘‘Kacci abhiṇhasaṃvāsā, nāvajānāsi paṇḍitaṃ; Ukkādhāro [okkādhāro (syā. ka.)] manussānaṃ, kacci apacito tayā’’ [tava (sī. aṭṭha.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": "Rāhulasuttaṃ"
    },
    {
      "number": 338,
      "pali": "‘‘Nāhaṃ abhiṇhasaṃvāsā, avajānāmi paṇḍitaṃ; Ukkādhāro manussānaṃ, niccaṃ apacito mayā’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 339,
      "pali": "‘‘Pañca kāmaguṇe hitvā, piyarūpe manorame; Saddhāya gharā nikkhamma, dukkhassantakaro bhava.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 340,
      "pali": "‘‘Mitte bhajassu kalyāṇe, pantañca sayanāsanaṃ; Vivittaṃ appanigghosaṃ, mattaññū hohi bhojane.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 341,
      "pali": "‘‘Cīvare piṇḍapāte ca, paccaye sayanāsane; Etesu taṇhaṃ mākāsi, mā lokaṃ punarāgami.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 342,
      "pali": "‘‘Saṃvuto pātimokkhasmiṃ, indriyesu ca pañcasu; Sati kāyagatātyatthu, nibbidābahulo bhava.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 343,
      "pali": "‘‘Nimittaṃ parivajjehi, subhaṃ rāgūpasañhitaṃ; Asubhāya cittaṃ bhāvehi, ekaggaṃ susamāhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 344,
      "pali": "‘‘Animittañca bhāvehi, mānānusayamujjaha; Tato mānābhisamayā, upasanto carissatī’’ti. Itthaṃ sudaṃ bhagavā āyasmantaṃ rāhulaṃ imāhi gāthāhi abhiṇhaṃ ovadatīti. Rāhulasuttaṃ ekādasamaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā āḷaviyaṃ viharati aggāḷave cetiye. Tena kho pana samayena āyasmato vaṅgīsassa upajjhāyo nigrodhakappo nāma thero aggāḷave cetiye aciraparinibbuto hoti. Atha kho āyasmato vaṅgīsassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘parinibbuto nu kho me upajjhāyo udāhu no parinibbuto’’ti? Atha kho āyasmā vaṅgīso sāyanhasamayaṃ paṭisallānā vuṭṭhito yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā vaṅgīso bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘parinibbuto nu kho me upajjhāyo, udāhu no parinabbuto’’’ti. Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṃsaṃ cīvaraṃ katvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ gāthāya ajjhabhāsi –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 345,
      "pali": "‘‘Pucchāma [pucchāmi (ka.)] satthāramanomapaññaṃ, diṭṭheva dhamme yo vicikicchānaṃ chettā; Aggāḷave kālamakāsi bhikkhu, ñāto yasassī abhinibbutatto.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nigrodhakappasuttaṃ"
    },
    {
      "number": 346,
      "pali": "‘‘Nigrodhakappo iti tassa nāmaṃ, tayā kataṃ bhagavā brāhmaṇassa; So taṃ namassaṃ acari mutyapekkho, āraddhavīriyo daḷhadhammadassī.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 347,
      "pali": "‘‘Taṃ sāvakaṃ sakya [sakka (sī. syā. pī.)] mayampi sabbe, aññātumicchāma samantacakkhu; Samavaṭṭhitā no savanāya sotā, tuvaṃ no satthā tvamanuttarosi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 348,
      "pali": "‘‘Chindeva no vicikicchaṃ brūhi metaṃ, parinibbutaṃ vedaya bhūripañña; Majjheva [majjhe ca (syā. ka.)] no bhāsa samantacakkhu, sakkova devāna sahassanetto.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 349,
      "pali": "‘‘Ye keci ganthā idha mohamaggā, aññāṇapakkhā vicikicchaṭhānā; Tathāgataṃ patvā na te bhavanti, cakkhuñhi etaṃ paramaṃ narānaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 350,
      "pali": "‘‘No ce hi jātu puriso kilese, vāto yathā abbhadhanaṃ vihāne; Tamovassa nivuto sabbaloko, na jotimantopi narā tapeyyuṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 351,
      "pali": "‘‘Dhīrā ca pajjotakarā bhavanti, taṃ taṃ ahaṃ vīra [dhīra (sī. syā.)] tatheva maññe; Vipassinaṃ jānamupāgamumhā [jānamupagamamhā (sī. syā.)], parisāsu no āvikarohi kappaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 352,
      "pali": "‘‘Khippaṃ giraṃ eraya vaggu vagguṃ, haṃsova paggayha saṇikaṃ [saṇiṃ (syā. pī.)] nikūja; Bindussarena suvikappitena, sabbeva te ujjugatā suṇoma.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 353,
      "pali": "‘‘Pahīnajātimaraṇaṃ asesaṃ, niggayha dhonaṃ [dhotaṃ (sī.)] vadessāmi dhammaṃ; Na kāmakāro hi puthujjanānaṃ, saṅkheyyakāro ca [saṅkhayyakārova (ka.)] tathāgatānaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 354,
      "pali": "‘‘Sampannaveyyākaraṇaṃ tavedaṃ, samujjupaññassa [samujjapaññassa (syā. ka.)] samuggahītaṃ; Ayamañjalī pacchimo suppaṇāmito, mā mohayī jānamanomapañña.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 355,
      "pali": "‘‘Parovaraṃ [varāvaraṃ (katthaci)] ariyadhammaṃ viditvā, mā mohayī jānamanomavīra; Vāriṃ yathā ghammani ghammatatto, vācābhikaṅkhāmi sutaṃ pavassa [sutassa vassa (syā.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 356,
      "pali": "‘‘Yadatthikaṃ [yadatthiyaṃ (pī.), yadatthitaṃ (ka.)] brahmacariyaṃ acarī, kappāyano kaccissa taṃ amoghaṃ; Nibbāyi so ādu saupādiseso, yathā vimutto ahu taṃ suṇoma’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 357,
      "pali": "‘‘Acchecchi [achejji (ka.)] taṇhaṃ idha nāmarūpe, (iti bhagavā) Kaṇhassa [taṇhāya (ka.)] sotaṃ dīgharattānusayitaṃ; Atāri jātiṃ maraṇaṃ asesaṃ,’’ Iccabravī bhagavā pañcaseṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 358,
      "pali": "‘‘Esa sutvā pasīdāmi, vaco te isisattama; Amoghaṃ kira me puṭṭhaṃ, na maṃ vañcesi brāhmaṇo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 359,
      "pali": "‘‘Yathāvādī tathākārī, ahu buddhassa sāvako; Acchidā maccuno jālaṃ, tataṃ māyāvino daḷhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 360,
      "pali": "‘‘Addasā bhagavā ādiṃ, upādānassa kappiyo; Accagā vata kappāyano, maccudheyyaṃ suduttara’’nti. Nigrodhakappasuttaṃ dvādasamaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 361,
      "pali": "‘‘Pucchāmi muniṃ pahūtapaññaṃ, Tiṇṇaṃ pāraṅgataṃ parinibbutaṃ ṭhitattaṃ; Nikkhamma gharā panujja kāme, kathaṃ bhikkhu Sammā so loke paribbajeyya’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sammāparibbājanīyasuttaṃ"
    },
    {
      "number": 362,
      "pali": "‘‘Yassa maṅgalā samūhatā, (iti bhagavā) Uppātā supinā ca lakkhaṇā ca; So maṅgaladosavippahīno, Sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 363,
      "pali": "‘‘Rāgaṃ vinayetha mānusesu, dibbesu kāmesu cāpi bhikkhu; Atikkamma bhavaṃ samecca dhammaṃ, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 364,
      "pali": "‘‘Vipiṭṭhikatvāna pesuṇāni, kodhaṃ kadariyaṃ jaheyya bhikkhu; Anurodhavirodhavippahīno, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 365,
      "pali": "‘‘Hitvāna piyañca appiyañca, anupādāya anissito kuhiñci; Saṃyojaniyehi vippamutto, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 366,
      "pali": "‘‘Na so upadhīsu sārameti, ādānesu vineyya chandarāgaṃ; So anissito anaññaneyyo, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 367,
      "pali": "‘‘Vacasā manasā ca kammunā ca, aviruddho sammā viditvā dhammaṃ; Nibbānapadābhipatthayāno, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 368,
      "pali": "‘‘Yo vandati manti nuṇṇameyya [nunnameyya (?)], akkuṭṭhopi na sandhiyetha bhikkhu; Laddhā parabhojanaṃ na majje, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 369,
      "pali": "‘‘Lobhañca bhavañca vippahāya, virato chedanabandhanā ca [chedanabandhanato (sī. syā.)] bhikkhu; So tiṇṇakathaṃkatho visallo, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 370,
      "pali": "‘‘Sāruppaṃ attano viditvā, no ca bhikkhu hiṃseyya kañci loke; Yathā tathiyaṃ viditvā dhammaṃ, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 371,
      "pali": "‘‘Yassānusayā na santi keci, mūlā ca [mūlā (sī. syā.)] akusalā samūhatāse; So nirāso [nirāsayo (sī.), nirāsaso (syā.)] anāsisāno [anāsayāno (sī. pī.), anāsasāno (syā.)], sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 372,
      "pali": "‘‘Āsavakhīṇo pahīnamāno, sabbaṃ rāgapathaṃ upātivatto; Danto parinibbuto ṭhitatto, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 373,
      "pali": "‘‘Saddho sutavā niyāmadassī, vaggagatesu na vaggasāri dhīro; Lobhaṃ dosaṃ vineyya paṭighaṃ, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 374,
      "pali": "‘‘Saṃsuddhajino vivaṭṭacchado, dhammesu vasī pāragū anejo; Saṅkhāranirodhañāṇakusalo, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 375,
      "pali": "‘‘Atītesu anāgatesu cāpi, kappātīto aticcasuddhipañño; Sabbāyatanehi vippamutto, sammā so loke paribbajeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 376,
      "pali": "‘‘Aññāya padaṃ samecca dhammaṃ, vivaṭaṃ disvāna pahānamāsavānaṃ; Sabbupadhīnaṃ parikkhayāno [parikkhayā (pī.)], sammā so loke paribbajeyya’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 377,
      "pali": "‘‘Addhā hi bhagavā tatheva etaṃ, yo so evaṃvihārī danto bhikkhu; Sabbasaṃyojanayogavītivatto [sabbasaṃyojaniye ca vītivatto (sī. syā. pī.)], sammā so loke paribbajeyyā’’ti. Sammāparibbājanīyasuttaṃ terasamaṃ niṭṭhitaṃ. Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho dhammiko upāsako pañcahi upāsakasatehi saddhiṃ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho dhammiko upāsako bhagavantaṃ gāthāhi ajjhabhāsi –",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 378,
      "pali": "‘‘Pucchāmi taṃ gotama bhūripañña, kathaṃkaro sāvako sādhu hoti; Yo vā agārā anagārameti, agārino vā panupāsakāse.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dhammikasuttaṃ"
    },
    {
      "number": 379,
      "pali": "‘‘Tuvañhi lokassa sadevakassa, gatiṃ pajānāsi parāyaṇañca; Na catthi tulyo nipuṇatthadassī, tuvañhi buddhaṃ pavaraṃ vadanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 380,
      "pali": "‘‘Sabbaṃ tuvaṃ ñāṇamavecca dhammaṃ, pakāsesi satte anukampamāno; Vivaṭṭacchadosi samantacakkhu, virocasi vimalo sabbaloke.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 381,
      "pali": "‘‘Āgañchi te santike nāgarājā, erāvaṇo nāma jinoti sutvā; Sopi tayā mantayitvājjhagamā, sādhūti sutvāna patītarūpo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 382,
      "pali": "‘‘Rājāpi taṃ vessavaṇo kuvero, upeti dhammaṃ paripucchamāno; Tassāpi tvaṃ pucchito brūsi dhīra, so cāpi sutvāna patītarūpo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 383,
      "pali": "‘‘Ye kecime titthiyā vādasīlā, ājīvakā vā yadi vā nigaṇṭhā; Paññāya taṃ nātitaranti sabbe, ṭhito vajantaṃ viya sīghagāmiṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 384,
      "pali": "‘‘Ye kecime brāhmaṇā vādasīlā, vuddhā cāpi brāhmaṇā santi keci; Sabbe tayi atthabaddhā bhavanti, ye cāpi aññe vādino maññamānā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 385,
      "pali": "‘‘Ayañhi dhammo nipuṇo sukho ca, yoyaṃ tayā bhagavā suppavutto; Tameva sabbepi [sabbe mayaṃ (syā.)] sussūsamānā, taṃ no vada pucchito buddhaseṭṭha.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 386,
      "pali": "‘‘Sabbepi me bhikkhavo sannisinnā, upāsakā cāpi tatheva sotuṃ; Suṇantu dhammaṃ vimalenānubuddhaṃ, subhāsitaṃ vāsavasseva devā’’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 387,
      "pali": "‘‘Suṇātha me bhikkhavo sāvayāmi vo, dhammaṃ dhutaṃ tañca carātha sabbe; Iriyāpathaṃ pabbajitānulomikaṃ, sevetha naṃ atthadaso mutīmā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 388,
      "pali": "‘‘No ve vikāle vicareyya bhikkhu, gāme ca piṇḍāya careyya kāle; Akālacāriñhi sajanti saṅgā, tasmā vikāle na caranti buddhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 389,
      "pali": "‘‘Rūpā ca saddā ca rasā ca gandhā, phassā ca ye sammadayanti satte; Etesu dhammesu vineyya chandaṃ, kālena so pavise pātarāsaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 390,
      "pali": "‘‘Piṇḍañca bhikkhu samayena laddhā, eko paṭikkamma raho nisīde; Ajjhattacintī na mano bahiddhā, nicchāraye saṅgahitattabhāvo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 391,
      "pali": "‘‘Sacepi so sallape sāvakena, aññena vā kenaci bhikkhunā vā; Dhammaṃ paṇītaṃ tamudāhareyya, na pesuṇaṃ nopi parūpavādaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 392,
      "pali": "‘‘Vādañhi eke paṭiseniyanti, na te pasaṃsāma parittapaññe; Tato tato ne pasajanti saṅgā, cittañhi te tattha gamenti dūre.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 393,
      "pali": "‘‘Piṇḍaṃ vihāraṃ sayanāsanañca, āpañca saṅghāṭirajūpavāhanaṃ; Sutvāna dhammaṃ sugatena desitaṃ, saṅkhāya seve varapaññasāvako.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 394,
      "pali": "‘‘Tasmā hi piṇḍe sayanāsane ca, āpe ca saṅghāṭirajūpavāhane; Etesu dhammesu anūpalitto, bhikkhu yathā pokkhare vāribindu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 395,
      "pali": "‘‘Gahaṭṭhavattaṃ pana vo vadāmi, yathākaro sāvako sādhu hoti; Na hesa [na heso (sī.)] labbhā sapariggahena, phassetuṃ yo kevalo bhikkhudhammo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 396,
      "pali": "‘‘Pāṇaṃ na hane [na hāne (sī.)] na ca ghātayeyya, na cānujaññā hanataṃ paresaṃ; Sabbesu bhūtesu nidhāya daṇḍaṃ, ye thāvarā ye ca tasā santi [tasanti (sī. pī.)] loke.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 397,
      "pali": "‘‘Tato adinnaṃ parivajjayeyya, kiñci kvaci sāvako bujjhamāno; Na hāraye harataṃ nānujaññā, sabbaṃ adinnaṃ parivajjayeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 398,
      "pali": "‘‘Abrahmacariyaṃ parivajjayeyya, aṅgārakāsuṃ jalitaṃva viññū; Asambhuṇanto pana brahmacariyaṃ, parassa dāraṃ na atikkameyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 399,
      "pali": "‘‘Sabhaggato vā parisaggato vā, ekassa veko [ceto (sī. syā.)] na musā bhaṇeyya; Na bhāṇaye bhaṇataṃ nānujaññā, sabbaṃ abhūtaṃ parivajjayeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 400,
      "pali": "‘‘Majjañca pānaṃ na samācareyya, dhammaṃ imaṃ rocaye yo gahaṭṭho; Na pāyaye pivataṃ nānujaññā, ummādanantaṃ iti naṃ viditvā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 401,
      "pali": "‘‘Madā hi pāpāni karonti bālā, kārenti caññepi jane pamatte; Etaṃ apuññāyatanaṃ vivajjaye, ummādanaṃ mohanaṃ bālakantaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 402,
      "pali": "‘‘Pāṇaṃ na hane na cādinnamādiye, musā na bhāse na ca majjapo siyā; Abrahmacariyā virameyya methunā, rattiṃ na bhuñjeyya vikālabhojanaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 403,
      "pali": "‘‘Mālaṃ na dhāre na ca gandhamācare, mañce chamāyaṃ va sayetha santhate; Etañhi aṭṭhaṅgikamāhuposathaṃ, buddhena dukkhantagunā pakāsitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 404,
      "pali": "‘‘Tato ca pakkhassupavassuposathaṃ, cātuddasiṃ pañcadasiñca aṭṭhamiṃ; Pāṭihāriyapakkhañca pasannamānaso, aṭṭhaṅgupetaṃ susamattarūpaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 405,
      "pali": "‘‘Tato ca pāto upavutthuposatho, annena pānena ca bhikkhusaṅghaṃ; Pasannacitto anumodamāno, yathārahaṃ saṃvibhajetha viññū.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 406,
      "pali": "‘‘Dhammena mātāpitaro bhareyya, payojaye dhammikaṃ so vaṇijjaṃ; Etaṃ gihī vattayamappamatto, sayampabhe nāma upeti deve’’ti. Dhammikasuttaṃ cuddasamaṃ niṭṭhitaṃ. Cūḷavaggo dutiyo niṭṭhito. Tassuddānaṃ – Ratanāmagandho hiri ca, maṅgalaṃ sūcilomena; Dhammacariyañca brāhmaṇo [kapilo brāhmaṇopi ca (syā. ka.)], nāvā kiṃsīlamuṭṭhānaṃ. Rāhulo puna kappo ca, paribbājaniyaṃ tathā; Dhammikañca viduno āhu, cūḷavagganti cuddasāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}