{
  "id": "vv.18",
  "title": {
    "pali": "Kesakārīvimānavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 17,
      "pali": "Kesakārīvimānavatthu",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 150,
      "pali": "‘‘Idaṃ vimānaṃ ruciraṃ pabhassaraṃ, veḷuriyathambhaṃ satataṃ sunimmitaṃ; Suvaṇṇarukkhehi samantamotthataṃ, ṭhānaṃ mamaṃ kammavipākasambhavaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 151,
      "pali": "‘‘Tatrūpapannā purimaccharā imā, sataṃ sahassāni sakena kammunā; Tuvaṃsi ajjhupagatā yasassinī, obhāsayaṃ tiṭṭhasi pubbadevatā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 152,
      "pali": "‘‘Sasī adhiggayha yathā virocati, nakkhattarājāriva tārakāgaṇaṃ; Tatheva tvaṃ accharāsaṅgaṇaṃ [accharāsaṅgamaṃ (sī.)] imaṃ, daddallamānā yasasā virocasi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 153,
      "pali": "‘‘Kuto nu āgamma anomadassane, upapannā tvaṃ bhavanaṃ mamaṃ idaṃ; Brahmaṃva devā tidasā sahindakā, sabbe na tappāmase dassanena ta’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 154,
      "pali": "‘‘Yametaṃ sakka anupucchase mamaṃ, ‘kuto cutā tvaṃ idha āgatā’ti [kuto cutā idha āgatā tuvaṃ (syā.), kuto cutāya āgati tava (pī.)]; Bārāṇasī nāma puratthi kāsinaṃ, tattha ahosiṃ pure kesakārikā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 155,
      "pali": "‘‘Buddhe ca dhamme ca pasannamānasā, saṅghe ca ekantagatā asaṃsayā; Akhaṇḍasikkhāpadā āgatapphalā, sambodhidhamme niyatā anāmayā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 156,
      "pali": "‘‘Tantyābhinandāmase svāgatañca [sāgatañca (sī.)] te, dhammena ca tvaṃ yasasā virocasi; Buddhe ca dhamme ca pasannamānase, saṅghe ca ekantagate asaṃsaye; Akhaṇḍasikkhāpade āgatapphale, sambodhidhamme niyate anāmaye’’ti. Kesakārīvimānaṃ sattarasamaṃ. Pīṭhavaggo paṭhamo niṭṭhito. Tassuddānaṃ – Pañca pīṭhā tayo nāvā, dīpatiladakkhiṇā dve; Pati dve suṇisā uttarā, sirimā kesakārikā; Vaggo tena pavuccatīti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}