{
  "id": "vv.54",
  "title": {
    "pali": "Ucchuvimānavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 10,
      "pali": "Ucchuvimānavatthu",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 808,
      "pali": "‘‘Obhāsayitvā pathaviṃ sadevakaṃ, atirocasi candimasūriyā viya; Siriyā ca vaṇṇena yasena tejasā, brahmāva deve tidase sahindake.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 809,
      "pali": "‘‘Pucchāmi taṃ uppalamāladhārinī, āveḷinī kañcanasannibhattace; Alaṅkate uttamavatthadhārinī, kā tvaṃ subhe devate vandase mamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 810,
      "pali": "‘‘Kiṃ tvaṃ pure kammamakāsi attanā, manussabhūtā purimāya jātiyā; Dānaṃ suciṇṇaṃ atha sīlasaññamaṃ, kenupapannā sugatiṃ yasassinī; Devate pucchitācikkha, kissa kammassidaṃ phala’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 811,
      "pali": "‘‘Idāni bhante imameva gāmaṃ, piṇḍāya amhāka gharaṃ upāgami; Tato te ucchussa adāsi khaṇḍikaṃ, pasannacittā atulāya pītiyā;",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 812,
      "pali": "‘‘Sassu ca pacchā anuyuñjate mamaṃ, kahaṃ nu ucchuṃ vadhuke avākirī; Na chaḍḍitaṃ no pana khāditaṃ mayā, santassa bhikkhussa sayaṃ adāsahaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 813,
      "pali": "‘‘Tuyhaṃnvidaṃ issariyaṃ atho mama, itissā sassu paribhāsate mamaṃ; Leḍḍuṃ gahetvā pahāraṃ adāsi me, tato cutā kālakatāmhi devatā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 814,
      "pali": "‘‘Tadeva kammaṃ kusalaṃ kataṃ mayā, sukhañca kammaṃ anubhomi attanā; Devehi saddhiṃ paricārayāmahaṃ, modāmahaṃ kāmaguṇehi pañcahi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 815,
      "pali": "‘‘Tadeva kammaṃ kusalaṃ kataṃ mayā, sukhañca kammaṃ anubhomi attanā; Devindaguttā tidasehi rakkhitā, samappitā kāmaguṇehi pañcahi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 816,
      "pali": "‘‘Etādisaṃ puññaphalaṃ anappakaṃ, mahāvipākā mama ucchudakkhiṇā; Devehi saddhiṃ paricārayāmahaṃ, modāmahaṃ kāmaguṇehi pañcahi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 817,
      "pali": "‘‘Etādisaṃ puññaphalaṃ anappakaṃ, mahājutikā mama ucchudakkhiṇā; Devindaguttā tidasehi rakkhitā, sahassanettoriva nandane vane.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 818,
      "pali": "‘‘Tuvañca bhante anukampakaṃ viduṃ, upecca vandiṃ kusalañca pucchisaṃ; Tato te ucchussa adāsiṃ khaṇḍikaṃ, pasannacittā atulāya pītiyā’’ti. Ucchuvimānaṃ dasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}