{
  "id": "pv.19",
  "title": {
    "pali": "Maṭṭhakuṇḍalīpetavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 186,
      "pali": "[vi. va. 1207] ‘‘Alaṅkato maṭṭhakuṇḍalī, māladhārī haricandanussado; Bāhā paggayha kandasi, vanamajjhe kiṃ dukkhito tuva’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 187,
      "pali": "‘‘Sovaṇṇamayo pabhassaro, uppanno rathapañjaro mama; Tassa cakkayugaṃ na vindāmi, tena dukkhena jahāmi jīvita’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 188,
      "pali": "‘‘Sovaṇṇamayaṃ maṇimayaṃ, lohitakamayaṃ [lohitaṅgamayaṃ (syā.), lohitaṅkamayaṃ (sī.), lohamayaṃ (katthaci)] atha rūpiyamayaṃ; Ācikkha me bhaddamāṇava, cakkayugaṃ paṭipādayāmi te’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 189,
      "pali": "So māṇavo tassa pāvadi, ‘‘candasūriyā ubhayettha dissare; Sovaṇṇamayo ratho mama, tena cakkayugena sobhatī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 190,
      "pali": "‘‘Bālo kho tvaṃ asi māṇava, yo tvaṃ patthayase apatthiyaṃ; Maññāmi tuvaṃ marissasi, na hi tvaṃ lacchasi candasūriye’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 191,
      "pali": "‘‘Gamanāgamanampi dissati, vaṇṇadhātu ubhayattha vīthiyā; Peto kālakato na dissati, ko nidha kandataṃ bālyataro’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 192,
      "pali": "‘‘Saccaṃ kho vadesi māṇava, ahameva kandataṃ bālyataro; Candaṃ viya dārako rudaṃ, petaṃ kālakatābhipatthayi’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 193,
      "pali": "‘‘Ādittaṃ vata maṃ santaṃ, ghatasittaṃva pāvakaṃ; Vārinā viya osiñcaṃ, sabbaṃ nibbāpaye daraṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 194,
      "pali": "‘‘Abbahī [abbūḷhaṃ (syā. ka.)] vata me sallaṃ, sokaṃ hadayanissitaṃ; Yo me sokaparetassa, puttasokaṃ apānudi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 195,
      "pali": "‘‘Svāhaṃ abbūḷhasallosmi, sītibhūtosmi nibbuto; Na socāmi na rodāmi, tava sutvāna māṇavā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 196,
      "pali": "‘‘Devatā nusi gandhabbo, adu sakko purindado; Ko vā tvaṃ kassa vā putto, kathaṃ jānemu taṃ maya’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 197,
      "pali": "‘‘Yañca kandasi yañca rodasi, puttaṃ āḷāhane sayaṃ dahitvā; Svāhaṃ kusalaṃ karitvā kammaṃ, tidasānaṃ sahabyataṃ gato’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 198,
      "pali": "‘‘Appaṃ vā bahuṃ vā nāddasāma, dānaṃ dadantassa sake agāre; Uposathakammaṃ vā tādisaṃ, kena kammena gatosi devaloka’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 199,
      "pali": "‘‘Ābādhikohaṃ dukkhito gilāno, āturarūpomhi sake nivesane; Buddhaṃ vigatarajaṃ vitiṇṇakaṅkhaṃ, addakkhiṃ sugataṃ anomapaññaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 200,
      "pali": "‘‘Svāhaṃ muditamano pasannacitto, añjaliṃ akariṃ tathāgatassa; Tāhaṃ kusalaṃ karitvāna kammaṃ, tidasānaṃ sahabyataṃ gato’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 201,
      "pali": "‘‘Acchariyaṃ vata abbhutaṃ vata, añjalikammassa ayamīdiso vipāko; Ahampi muditamano pasannacitto, ajjeva buddhaṃ saraṇaṃ vajāmī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 202,
      "pali": "‘‘Ajjeva buddhaṃ saraṇaṃ vajāhi, dhammañca saṅghañca pasannacitto; Tatheva sikkhāya padāni pañca, akhaṇḍaphullāni samādiyassu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 203,
      "pali": "‘‘Pāṇātipātā viramassu khippaṃ, loke adinnaṃ parivajjayassu; Amajjapo mā ca musā bhaṇāhi, sakena dārena ca hohi tuṭṭho’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 204,
      "pali": "‘‘Atthakāmosi me yakkha, hitakāmosi devate; Karomi tuyhaṃ vacanaṃ, tvaṃsi ācariyo mamāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 205,
      "pali": "‘‘Upemi saraṇaṃ buddhaṃ, dhammañcāpi anuttaraṃ; Saṅghañca naradevassa, gacchāmi saraṇaṃ ahaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 206,
      "pali": "‘‘Pāṇātipātā viramāmi khippaṃ, loke adinnaṃ parivajjayāmi; Amajjapo no ca musā bhaṇāmi; Sakena dārena ca homi tuṭṭho’’ti. Maṭṭhakuṇḍalīpetavatthu pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}