{
  "id": "an9.4",
  "title": {
    "pali": "Mahāvaggo",
    "english": "The Great Section",
    "sinhala": "මහාවග්ගය"
  },
  "sections": [
    {
      "number": 32,
      "pali": "[dī. ni. 3.344, 359] ‘‘Navayime, bhikkhave, anupubbavihārā. Katame nava? [ettha sī. pī. potthakesu ‘‘idha bhikkhave bhikkhu vivicceva kāmehī’’ tiādinā vittharena pāṭho dissati] Paṭhamaṃ jhānaṃ, dutiyaṃ jhānaṃ, tatiyaṃ jhānaṃ, catutthaṃ jhānaṃ, ākāsānañcāyatanaṃ, viññāṇañcāyatanaṃ, ākiñcaññāyatanaṃ, nevasaññānāsaññāyatanaṃ, saññāvedayitanirodho – ime kho, bhikkhave, nava anupubbavihārā’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these nine progressive abidings. Which nine? The first jhāna, the second jhāna, the third jhāna, the fourth jhāna, the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothingness, the sphere of neither perception nor non-perception, and the cessation of perception and feeling – these, monks, are the nine progressive abidings.",
      "sinhala": "මහණෙනි, මේ අනුපුබ්බ විහාර නවයකි. කවරවාහුද ඒ නවය?\n\nපළමු ධ්‍ර යානය, දෙවෙනි ධ්‍ර යානය, තෙවෙනි ධ්‍ර යානය, සිවුවෙනි ධ්‍ර යානය, ආකාසානඤ්‍රචායතනය, විඤ්‍රඤ්ඤාණඤ්‍රචායතනය, ආකිඤ්‍රචඤ්‍රඤ්ඤායතනය, නේවසඤ්‍රඤ්ඤානාසඤ්‍රඤ්ඤායතනය, සඤ්‍රඤ්ඤාවේ‍දයිත නිරෝධය – මහණෙනි, මේවා අනුපුබ්බ විහාර නවයයි.\n\nපළමුවන.",
      "paliTitle": "Anupubbavihārasuttaṃ"
    },
    {
      "number": 33,
      "pali": "‘‘Navayimā, bhikkhave [nava bhikkhave (?)], anupubbavihārasamāpattiyo desessāmi, taṃ suṇātha…pe… katamā ca, bhikkhave, nava anupubbavihārasamāpattiyo? Yattha kāmā nirujjhanti, ye ca kāme nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha kāmā nirujjhanti, ke ca kāme nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Ettha kāmā nirujjhanti, te ca kāme nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. ‘‘Yattha vitakkavicārā nirujjhanti, ye ca vitakkavicāre nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha vitakkavicārā nirujjhanti, ke ca vitakkavicāre nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati; ettha vitakkavicārā nirujjhanti, te ca vitakkavicāre nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. ‘‘Yattha pīti nirujjhati, ye ca pītiṃ nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha pīti nirujjhati, ke ca pītiṃ nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati; ettha pīti nirujjhati, te ca pītiṃ nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. ‘‘Yattha upekkhāsukhaṃ nirujjhati, ye ca upekkhāsukhaṃ nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha upekkhāsukhaṃ nirujjhati, ke ca upekkhāsukhaṃ nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati; ettha upekkhāsukhaṃ nirujjhati, te ca upekkhāsukhaṃ nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. ‘‘Yattha rūpasaññā nirujjhati, ye ca rūpasaññaṃ [yattha rūpasaññā nirujjhanti, ye ca rūpasaññā (sī. syā. pī.)] nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha rūpasaññā nirujjhati, ke ca rūpasaññaṃ nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharati. Ettha rūpasaññā nirujjhati, te ca rūpasaññaṃ nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. ‘‘Yattha ākāsānañcāyatanasaññā nirujjhati, ye ca ākāsānañcāyatanasaññaṃ nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha ākāsānañcāyatanasaññā nirujjhati, ke ca ākāsānañcāyatanasaññaṃ nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharati. Ettha ākāsānañcāyatanasaññā nirujjhati, te ca ākāsānañcāyatanasaññaṃ nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. ‘‘Yattha viññāṇañcāyatanasaññā nirujjhati, ye ca viññāṇañcāyatanasaññaṃ nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha viññāṇañcāyatanasaññā nirujjhati, ke ca viññāṇañcāyatanasaññaṃ nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja viharati. Ettha viññāṇañcāyatanasaññā nirujjhati, te ca viññāṇañcāyatanasaññaṃ nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. ‘‘Yattha ākiñcaññāyatanasaññā nirujjhati, ye ca ākiñcaññāyatanasaññaṃ nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha ākiñcaññāyatanasaññā nirujjhati, ke ca ākiñcaññāyatanasaññaṃ nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Ettha ākiñcaññāyatanasaññā nirujjhati, te ca ākiñcaññāyatanasaññaṃ nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. ‘‘Yattha nevasaññānāsaññāyatanasaññā nirujjhati, ye ca nevasaññānāsaññāyatanasaññaṃ nirodhetvā nirodhetvā viharanti, ‘addhā te āyasmanto nicchātā nibbutā tiṇṇā pāraṅgatā tadaṅgenā’ti vadāmi. ‘Kattha nevasaññānāsaññāyatanasaññā nirujjhati, ke ca nevasaññānāsaññāyatanasaññaṃ nirodhetvā nirodhetvā viharanti – ahametaṃ na jānāmi ahametaṃ na passāmī’ti, iti yo evaṃ vadeyya, so evamassa vacanīyo – ‘idhāvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati. Ettha nevasaññānāsaññāyatanasaññā nirujjhati, te ca nevasaññānāsaññāyatanasaññaṃ nirodhetvā nirodhetvā viharantī’ti. Addhā, bhikkhave, asaṭho amāyāvī ‘sādhū’ti bhāsitaṃ abhinandeyya anumodeyya; ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā namassamāno pañjaliko payirupāseyya. Imā kho, bhikkhave, nava anupubbavihārasamāpattiyo’’ti. Dutiyaṃ.",
      "english": "“Bhikkhus, I shall teach you these nine gradual abidings. Listen to them... And what, Bhikkhus, are these nine gradual abidings?\n\n“Where sensual desires cease, and where those who abide, having ceased sensual desires again and again, I declare that those venerable ones are surely craving-free, cooled, crossed over, and have reached the far shore by that very cessation. If anyone were to say, ‘I do not know, I do not see where sensual desires cease, or who abide, having ceased sensual desires again and again,’ such a person should be told: ‘Here, friend, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters upon and abides in the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, filled with rapture and pleasure. Here sensual desires cease, and they abide having ceased sensual desires again and again.’ Surely, Bhikkhus, a sincere and guileless person would welcome and approve of this well-spoken teaching; having welcomed and approved of this well-spoken teaching, they would venerate it, paying homage with joined palms, and attend upon it.\n\n“Where applied thought and sustained thought cease, and where those who abide, having ceased applied thought and sustained thought again and again, I declare that those venerable ones are surely craving-free, cooled, crossed over, and have reached the far shore by that very cessation. If anyone were to say, ‘I do not know, I do not see where applied thought and sustained thought cease, or who abide, having ceased applied thought and sustained thought again and again,’ such a person should be told: ‘Here, friend, a bhikkhu, with the calming of applied thought and sustained thought, attains to an internal purification and unification of mind, and enters upon and abides in the second jhāna, which is without applied thought and sustained thought, born of concentration, filled with rapture and pleasure. Here applied thought and sustained thought cease, and they abide having ceased applied thought and sustained thought again and again.’ Surely, Bhikkhus, a sincere and guileless person would welcome and approve of this well-spoken teaching; having welcomed and approved of this well-spoken teaching, they would venerate it, paying homage with joined palms, and attend upon it.\n\n“Where rapture ceases, and where those who abide, having ceased rapture again and again, I declare that those venerable ones are surely craving-free, cooled, crossed over, and have reached the far shore by that very cessation. If anyone were to say, ‘I do not know, I do not see where rapture ceases, or who abide, having ceased rapture again and again,’ such a person should be told: ‘Here, friend, a bhikkhu, with the fading away of rapture, abides in equanimity, mindful and clearly comprehending, and experiences pleasure with the body, and enters upon and abides in the third jhāna, of which the Noble Ones declare, “He abides in pleasure with equanimity and mindfulness.” Here rapture ceases, and they abide having ceased rapture again and again.’ Surely, Bhikkhus, a sincere and guileless person would welcome and approve of this well-spoken teaching; having welcomed and approved of this well-spoken teaching, they would venerate it, paying homage with joined palms, and attend upon it.\n\n“Where the pleasure associated with equanimity ceases, and where those who abide, having ceased the pleasure associated with equanimity again and again, I declare that those venerable ones are surely craving-free, cooled, crossed over, and have reached the far shore by that very cessation. If anyone were to say, ‘I do not know, I do not see where the pleasure associated with equanimity ceases, or who abide, having ceased the pleasure associated with equanimity again and again,’ such a person should be told: ‘Here, friend, a bhikkhu, by the abandoning of pleasure and the abandoning of pain, and by the prior passing away of joy and sorrow, enters upon and abides in the fourth jhāna, which is neither painful nor pleasant, and is a purification of mindfulness by equanimity. Here the pleasure associated with equanimity ceases, and they abide having ceased the pleasure associated with equanimity again and again.’ Surely, Bhikkhus, a sincere and guileless person would welcome and approve of this well-spoken teaching; having welcomed and approved of this well-spoken teaching, they would venerate it, paying homage with joined palms, and attend upon it.\n\n“Where the perception of form ceases, and where those who abide, having ceased the perception of form again and again, I declare that those venerable ones are surely craving-free, cooled, crossed over, and have reached the far shore by that very cessation. If anyone were to say, ‘I do not know, I do not see where the perception of form ceases, or who abide, having ceased the perception of form again and again,’ such a person should be told: ‘Here, friend, a bhikkhu, by completely transcending perceptions of form, by the fading away of perceptions of sensory impingement, by not attending to perceptions of diversity, thinking, “Space is infinite,” enters upon and abides in the dimension of infinite space. Here the perception of form ceases, and they abide having ceased the perception of form again and again.’ Surely, Bhikkhus, a sincere and guileless person would welcome and approve of this well-spoken teaching; having welcomed and approved of this well-spoken teaching, they would venerate it, paying homage with joined palms, and attend upon it.\n\n“Where the perception of the dimension of infinite space ceases, and where those who abide, having ceased the perception of the dimension of infinite space again and again, I declare that those venerable ones are surely craving-free, cooled, crossed over, and have reached the far shore by that very cessation.\n\n\"Where does the perception of the dimension of infinite space cease? And who are those who dwell having ceased, again and again, the perception of the dimension of infinite space? If someone were to say, 'I do not know this, I do not see this,' then that person should be told: 'Here, friend, a bhikkhu, completely transcending the dimension of infinite space, enters and dwells in the dimension of infinite consciousness, thinking \"consciousness is infinite.\" Here, the perception of the dimension of infinite space ceases, and these are those who dwell having ceased, again and again, the perception of the dimension of infinite space.'\"\n\nIndeed, monks, a person who is not devious or deceitful would approve and delight in what has been well spoken. Having approved and delighted in what has been well spoken, revering with cupped hands, they would attend upon it.\n\n\"Where the perception of the dimension of infinite consciousness ceases, and those who dwell having ceased, again and again, the perception of the dimension of infinite consciousness—these venerable ones, I declare, are truly free from craving, extinguished (of defilements), crossed over, gone to the other shore by means of that very attainment.\"\n\n\"Where does the perception of the dimension of infinite consciousness cease? And who are those who dwell having ceased, again and again, the perception of the dimension of infinite consciousness? If someone were to say, 'I do not know this, I do not see this,' then that person should be told: 'Here, friend, a bhikkhu, completely transcending the dimension of infinite consciousness, enters and dwells in the dimension of nothingness, thinking \"there is nothing at all.\" Here, the perception of the dimension of infinite consciousness ceases, and these are those who dwell having ceased, again and again, the perception of the dimension of infinite consciousness.'\"\n\nIndeed, monks, a person who is not devious or deceitful would approve and delight in what has been well spoken. Having approved and delighted in what has been well spoken, revering with cupped hands, they would attend upon it.\n\n\"Where the perception of the dimension of nothingness ceases, and those who dwell having ceased, again and again, the perception of the dimension of nothingness—these venerable ones, I declare, are truly free from craving, extinguished (of defilements), crossed over, gone to the other shore by means of that very attainment.\"\n\n\"Where does the perception of the dimension of nothingness cease? And who are those who dwell having ceased, again and again, the perception of the dimension of nothingness? If someone were to say, 'I do not know this, I do not see this,' then that person should be told: 'Here, friend, a bhikkhu, completely transcending the dimension of nothingness, enters and dwells in the dimension of neither perception nor non-perception. Here, the perception of the dimension of nothingness ceases, and these are those who dwell having ceased, again and again, the perception of the dimension of nothingness.'\"\n\nIndeed, monks, a person who is not devious or deceitful would approve and delight in what has been well spoken. Having approved and delighted in what has been well spoken, revering with cupped hands, they would attend upon it.\n\n\"Where the perception of the dimension of neither perception nor non-perception ceases, and those who dwell having ceased, again and again, the perception of the dimension of neither perception nor non-perception—these venerable ones, I declare, are truly free from craving, extinguished (of defilements), crossed over, gone to the other shore by means of that very attainment.\"\n\n\"Where does the perception of the dimension of neither perception nor non-perception cease? And who are those who dwell having ceased, again and again, the perception of the dimension of neither perception nor non-perception? If someone were to say, 'I do not know this, I do not see this,' then that person should be told: 'Here, friend, a bhikkhu, completely transcending the dimension of neither perception nor non-perception, enters and dwells in the cessation of perception and feeling. Here, the perception of the dimension of neither perception nor non-perception ceases, and these are those who dwell having ceased, again and again, the perception of the dimension of neither perception nor non-perception.'\"\n\nIndeed, monks, a person who is not devious or deceitful would approve and delight in what has been well spoken. Having approved and delighted in what has been well spoken, revering with cupped hands, they would attend upon it. Indeed, monks, these are the nine successive attainments of dwelling.",
      "sinhala": "මහණෙනි, මම මේ නව අනුපූ‍ර්වවිහාර සමාපත්ති දේශනා කරන්නෙමි. එය අසන්න. ... මහණෙනි, ඒ නව අනුපූ‍ර්වවිහාර සමාපත්තීහු කවරහුද? කොතැන කාමයන් නිරුද්ධ වෙත්ද, යම් අය කාමයන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද, ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු ආශා රහිත වූවෝය, නිවුණෝය, සංසාරය එතෙර වූවෝය, පරතෙරට පත්වූවෝය, ඒ ධර්මාංගයෙන් (තදාංග ප්‍රහාණයෙන්) සංසාරය එතෙර වූවෝය’යි මම කියමි. ‘කොතැන කාමයන් නිරුද්ධ වෙත්ද, කවරහු කාමයන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද – මම මෙය නොදනිමි, මම මෙය නොදකිමි’යි යමෙක් මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිවයුතුය: ‘ඇවැත්නි, මේ ශාසනයෙහි භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. මෙහි කාමයෝ නිරුද්ධ වෙත්. ඒ භික්ෂුහු කාමයන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙති.’ මහණෙනි, නියත වශයෙන්ම කූටකම් නොකරන, මායාව රහිත තැනැත්තා ‘සාධු’යයි කී බසට සතුටු වන්නේය, අනුමෝදන් වන්නේය. ‘සාධු’යයි කී බසට සතුටු වී අනුමෝදන් වී, වැඳ, දොහොත් මුදුන් තබා ගෞරවයෙන් සවන් දෙන්නේය.\n\nකොතැන විතර්ක විචාරයෝ නිරුද්ධ වෙත්ද, යම් අය විතර්ක විචාරයන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද, ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු ආශා රහිත වූවෝය, නිවුණෝය, සංසාරය එතෙර වූවෝය, පරතෙරට පත්වූවෝය, ඒ ධර්මාංගයෙන් (තදාංග ප්‍රහාණයෙන්) සංසාරය එතෙර වූවෝය’යි මම කියමි. ‘කොතැන විතර්ක විචාරයෝ නිරුද්ධ වෙත්ද, කවරහු විතර්ක විචාරයන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද – මම මෙය නොදනිමි, මම මෙය නොදකිමි’යි යමෙක් මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිවයුතුය: ‘ඇවැත්නි, මේ ශාසනයෙහි භික්ෂුව විතර්ක විචාරයන් සංසිඳවීමෙන්, තමා තුළ පැහැදීම ඇතිකරගෙන, සිතේ එකඟ බව ඇතිකරගෙන, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සුඛය ඇති දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. මෙහි විතර්ක විචාරයෝ නිරුද්ධ වෙත්. ඒ භික්ෂුහු විතර්ක විචාරයන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙති.’ මහණෙනි, නියත වශයෙන්ම කූටකම් නොකරන, මායාව රහිත තැනැත්තා ‘සාධු’යයි කී බසට සතුටු වන්නේය, අනුමෝදන් වන්නේය. ‘සාධු’යයි කී බසට සතුටු වී අනුමෝදන් වී, වැඳ, දොහොත් මුදුන් තබා ගෞරවයෙන් සවන් දෙන්නේය.\n\nකොතැන ප්‍රීතිය නිරුද්ධ වෙත්ද, යම් අය ප්‍රීතිය නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද, ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු ආශා රහිත වූවෝය, නිවුණෝය, සංසාරය එතෙර වූවෝය, පරතෙරට පත්වූවෝය, ඒ ධර්මාංගයෙන් (තදාංග ප්‍රහාණයෙන්) සංසාරය එතෙර වූවෝය’යි මම කියමි. ‘කොතැන ප්‍රීතිය නිරුද්ධ වෙත්ද, කවරහු ප්‍රීතිය නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද – මම මෙය නොදනිමි, මම මෙය නොදකිමි’යි යමෙක් මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිවයුතුය: ‘ඇවැත්නි, මේ ශාසනයෙහි භික්ෂුව ප්‍රීතියෙහිද නොඇලීමෙන්, උපේක්ෂාවෙන් යුතුව වාසය කරමින්, සිහි ඇතිව, මනා නුවණින් යුතුව, ශරීරයෙන් සුඛය (ප්‍රීතියෙන් තොර වූ සුවය) අත්විඳිමින්, ආර්යයෝ යමක් ‘උපේක්ෂාවෙන් යුක්ත වූ, සිහි ඇති, සුව විහරණයෙන් යුක්ත වූ’ යයි කියත්ද, ඒ තුන්වන ධ්‍යානයට පැමිණ වාසය කරයි. මෙහි ප්‍රීතිය නිරුද්ධ වෙයි. ඒ භික්ෂුහු ප්‍රීතිය නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙති.’ මහණෙනි, නියත වශයෙන්ම කූටකම් නොකරන, මායාව රහිත තැනැත්තා ‘සාධු’යයි කී බසට සතුටු වන්නේය, අනුමෝදන් වන්නේය. ‘සාධු’යයි කී බසට සතුටු වී අනුමෝදන් වී, වැඳ, දොහොත් මුදුන් තබා ගෞරවයෙන් සවන් දෙන්නේය.\n\nකොතැන උපේක්ෂාව සමඟ පැවති සුවය නිරුද්ධ වෙත්ද, යම් අය උපේක්ෂාව සමඟ පැවති සුවය නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද, ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු ආශා රහිත වූවෝය, නිවුණෝය, සංසාරය එතෙර වූවෝය, පරතෙරට පත්වූවෝය, ඒ ධර්මාංගයෙන් (තදාංග ප්‍රහාණයෙන්) සංසාරය එතෙර වූවෝය’යි මම කියමි. ‘කොතැන උපේක්ෂාව සමඟ පැවති සුවය නිරුද්ධ වෙත්ද, කවරහු උපේක්ෂාව සමඟ පැවති සුවය නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද – මම මෙය නොදනිමි, මම මෙය නොදකිමි’යි යමෙක් මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිවයුතුය: ‘ඇවැත්නි, මේ ශාසනයෙහි භික්ෂුව සැපයද ප්‍රහාණය කිරීමෙන්, දුකද ප්‍රහාණය කිරීමෙන්, පෙර පැවති සෝමනස්ස-දෝමනස්සයන් අතුරුදන් වීමෙන්, දුක් රහිත, සුඛ රහිත වූ, උපේක්ෂාව හේතුවෙන් සිහිය පිරිසිදු වූ සතරවන ධ්‍යානයට පැමිණ වාසය කරයි. මෙහි උපේක්ෂාව සමඟ පැවති සුවය නිරුද්ධ වෙයි. ඒ භික්ෂුහු උපේක්ෂාව සමඟ පැවති සුවය නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙති.’ මහණෙනි, නියත වශයෙන්ම කූටකම් නොකරන, මායාව රහිත තැනැත්තා ‘සාධු’යයි කී බසට සතුටු වන්නේය, අනුමෝදන් වන්නේය. ‘සාධු’යයි කී බසට සතුටු වී අනුමෝදන් වී, වැඳ, දොහොත් මුදුන් තබා ගෞරවයෙන් සවන් දෙන්නේය.\n\nකොතැන රූප සංඥාවෝ නිරුද්ධ වෙත්ද, යම් අය රූප සංඥාවන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද, ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු ආශා රහිත වූවෝය, නිවුණෝය, සංසාරය එතෙර වූවෝය, පරතෙරට පත්වූවෝය, ඒ ධර්මාංගයෙන් (තදාංග ප්‍රහාණයෙන්) සංසාරය එතෙර වූවෝය’යි මම කියමි. ‘කොතැන රූප සංඥාවෝ නිරුද්ධ වෙත්ද, කවරහු රූප සංඥාවන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද – මම මෙය නොදනිමි, මම මෙය නොදකිමි’යි යමෙක් මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිවයුතුය: ‘ඇවැත්නි, මේ ශාසනයෙහි භික්ෂුව සර්වප්‍රකාරයෙන් රූප සංඥාවන් ඉක්මවීමෙන්, ප්‍රතිඝ සංඥාවන් අතුරුදන් වීමෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, ‘අනන්තය ආකාශය’යි (සිතා) ආකාශානන්ත්‍යායතනයට පැමිණ වාසය කරයි. මෙහි රූප සංඥාවෝ නිරුද්ධ වෙත්. ඒ භික්ෂුහු රූප සංඥාවන් නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙති.’ මහණෙනි, නියත වශයෙන්ම කූටකම් නොකරන, මායාව රහිත තැනැත්තා ‘සාධු’යයි කී බසට සතුටු වන්නේය, අනුමෝදන් වන්නේය. ‘සාධු’යයි කී බසට සතුටු වී අනුමෝදන් වී, වැඳ, දොහොත් මුදුන් තබා ගෞරවයෙන් සවන් දෙන්නේය.\n\nකොතැන ආකාශානන්ත්‍යායතන සංඥාව නිරුද්ධ වෙත්ද, යම් අය ආකාශානන්ත්‍යායතන සංඥාව නිරුද්ධ කොට නිරුද්ධ කොට වාසය කෙරෙත්ද, ‘නියත වශයෙන්ම ඒ ආයුෂ්මත්හු ආශා රහිත වූවෝය, නිවුණෝය, සංසාරය එතෙර වූවෝය, පරතෙරට පත්වූවෝය, ඒ ධර්මාංගයෙන් (තදාංග ප්‍රහාණයෙන්) සංසාරය එතෙර වූවෝය’යි මම කියමි.\n\nයම් පුද්ගලයෙක් ‘අනන්ත ආකාශය පිළිබඳ වූ සංඥාව නිරුද්ධ වන්නේ කොතැනද? අනන්ත ආකාශය පිළිබඳ වූ සංඥාව නිරුද්ධ කරමින් වාසය කරන්නේ කවරහුද? මම මෙය නොදනිමි, නොදකිමි’ යැයි මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිව යුතු වන්නේය: ‘ආයුෂ්මත්නි, මෙහිලා භික්ෂුවක් ආකාශානන්ත්‍ය‍ායතනය මුළුමනින්ම ඉක්මවා, ‘විඤ්‍ඤාණය අනන්තය’ යැයි සලකා විඤ්‍ඤාණානන්ත්‍ය‍ායතනයට පැමිණ වාසය කරයි. මෙහිදී ආකාශානන්ත්‍ය‍ායතන සංඥාව නිරුද්ධ වේ. ඔවුහු ආකාශානන්ත්‍ය‍ායතන සංඥාව නිරුද්ධ කරමින් වාසය කරති.’ මහණෙනි, නියත වශයෙන්ම කපටිකමක් නැති, මායාවක් නැති තැනැත්තෙක් ‘සාදු’ යැයි කියූ වචනය අගය කරනු ඇත, අනුමෝදන් වනු ඇත. ‘සාදු’ යැයි කියූ වචනය අගය කොට, අනුමෝදන් වී, නමස්කාර කරමින්, දොහොත් මුදුන් තබාගෙන (එම දේශනාවට) උපස්ථාන කරනු ඇත.\n\n‘විඤ්‍ඤාණානන්ත්‍ය‍ායතන සංඥාව නිරුද්ධ වන්නේ කොතැනද? විඤ්‍ඤාණානන්ත්‍ය‍ායතන සංඥාව නිරුද්ධ කරමින් වාසය කරන්නේ කවරහුද? ඒ ආයුෂ්මත්වරු නියත වශයෙන්ම තණ්හාවෙන් මිදුණාහුය, නිවී ගියාහුය, සංසාර සාගරය තරණය කළාහුය, එම අංගයෙන්ම පරතෙරට පැමිණියාහුය’ යැයි මම කියමි. යම් පුද්ගලයෙක් ‘විඤ්‍ඤාණානන්ත්‍ය‍ායතන සංඥාව නිරුද්ධ වන්නේ කොතැනද? විඤ්‍ඤාණානන්ත්‍ය‍ායතන සංඥාව නිරුද්ධ කරමින් වාසය කරන්නේ කවරහුද? මම මෙය නොදනිමි, නොදකිමි’ යැයි මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිව යුතු වන්නේය: ‘ආයුෂ්මත්නි, මෙහිලා භික්ෂුවක් මුළුමනින්ම විඤ්‍ඤාණානන්ත්‍ය‍ායතනය ඉක්මවා, ‘කිසිවක් නැත’ යැයි සලකා ආකිංචඤ්‍ඤායතනයට පැමිණ වාසය කරයි. මෙහිදී විඤ්‍ඤාණානන්ත්‍ය‍ායතන සංඥාව නිරුද්ධ වේ. ඔවුහු විඤ්‍ඤාණානන්ත්‍ය‍ායතන සංඥාව නිරුද්ධ කරමින් වාසය කරති.’ මහණෙනි, නියත වශයෙන්ම කපටිකමක් නැති, මායාවක් නැති තැනැත්තෙක් ‘සාදු’ යැයි කියූ වචනය අගය කරනු ඇත, අනුමෝදන් වනු ඇත. ‘සාදු’ යැයි කියූ වචනය අගය කොට, අනුමෝදන් වී, නමස්කාර කරමින්, දොහොත් මුදුන් තබාගෙන (එම දේශනාවට) උපස්ථාන කරනු ඇත.\n\n‘ආකිංචඤ්‍ඤායතන සංඥාව නිරුද්ධ වන්නේ කොතැනද? ආකිංචඤ්‍ඤායතන සංඥාව නිරුද්ධ කරමින් වාසය කරන්නේ කවරහුද? ඒ ආයුෂ්මත්වරු නියත වශයෙන්ම තණ්හාවෙන් මිදුණාහුය, නිවී ගියාහුය, සංසාර සාගරය තරණය කළාහුය, එම අංගයෙන්ම පරතෙරට පැමිණියාහුය’ යැයි මම කියමි. යම් පුද්ගලයෙක් ‘ආකිංචඤ්‍ඤායතන සංඥාව නිරුද්ධ වන්නේ කොතැනද? ආකිංචඤ්‍ඤායතන සංඥාව නිරුද්ධ කරමින් වාසය කරන්නේ කවරහුද? මම මෙය නොදනිමි, නොදකිමි’ යැයි මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිව යුතු වන්නේය: ‘ආයුෂ්මත්නි, මෙහිලා භික්ෂුවක් මුළුමනින්ම ආකිංචඤ්‍ඤායතනය ඉක්මවා නේවසංඥානාසංඥායතනයට පැමිණ වාසය කරයි. මෙහිදී ආකිංචඤ්‍ඤායතන සංඥාව නිරුද්ධ වේ. ඔවුහු ආකිංචඤ්‍ඤායතන සංඥාව නිරුද්ධ කරමින් වාසය කරති.’ මහණෙනි, නියත වශයෙන්ම කපටිකමක් නැති, මායාවක් නැති තැනැත්තෙක් ‘සාදු’ යැයි කියූ වචනය අගය කරනු ඇත, අනුමෝදන් වනු ඇත. ‘සාදු’ යැයි කියූ වචනය අගය කොට, අනුමෝදන් වී, නමස්කාර කරමින්, දොහොත් මුදුන් තබාගෙන (එම දේශනාවට) උපස්ථාන කරනු ඇත.\n\n‘නේවසංඥානාසංඥායතන සංඥාව නිරුද්ධ වන්නේ කොතැනද? නේවසංඥානාසංඥායතන සංඥාව නිරුද්ධ කරමින් වාසය කරන්නේ කවරහුද? ඒ ආයුෂ්මත්වරු නියත වශයෙන්ම තණ්හාවෙන් මිදුණාහුය, නිවී ගියාහුය, සංසාර සාගරය තරණය කළාහුය, එම අංගයෙන්ම පරතෙරට පැමිණියාහුය’ යැයි මම කියමි. යම් පුද්ගලයෙක් ‘නේවසංඥානාසංඥායතන සංඥාව නිරුද්ධ වන්නේ කොතැනද? නේවසංඥානාසංඥායතන සංඥාව නිරුද්ධ කරමින් වාසය කරන්නේ කවරහුද? මම මෙය නොදනිමි, නොදකිමි’ යැයි මෙසේ කියන්නේ නම්, ඔහුට මෙසේ කිව යුතු වන්නේය: ‘ආයුෂ්මත්නි, මෙහිලා භික්ෂුවක් මුළුමනින්ම නේවසංඥානාසංඥායතනය ඉක්මවා, සංඥා වේදයිත නිරෝධයට පැමිණ වාසය කරයි. මෙහිදී නේවසංඥානාසංඥායතන සංඥාව නිරුද්ධ වේ. ඔවුහු නේවසංඥානාසංඥායතන සංඥාව නිරුද්ධ කරමින් වාසය කරති.’ මහණෙනි, නියත වශයෙන්ම කපටිකමක් නැති, මායාවක් නැති තැනැත්තෙක් ‘සාදු’ යැයි කියූ වචනය අගය කරනු ඇත, අනුමෝදන් වනු ඇත. ‘සාදු’ යැයි කියූ වචනය අගය කොට, අනුමෝදන් වී, නමස්කාර කරමින්, දොහොත් මුදුන් තබාගෙන (එම දේශනාවට) උපස්ථාන කරනු ඇත. මහණෙනි, මේවා අනුපූර්ව විහාර සමාපත්ති නවයයි.",
      "paliTitle": "Anupubbavihārasamāpattisuttaṃ"
    },
    {
      "number": 34,
      "pali": "Ekaṃ samayaṃ āyasmā sāriputto rājagahe viharati veḷuvane kalandakanivāpe. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘sukhamidaṃ, āvuso, nibbānaṃ. Sukhamidaṃ, āvuso, nibbāna’’nti. Evaṃ vutte āyasmā udāyī āyasmantaṃ sāriputtaṃ etadavoca – ‘‘kiṃ panettha, āvuso sāriputta, sukhaṃ yadettha natthi vedayita’’nti? ‘‘Etadeva khvettha, āvuso, sukhaṃ yadettha natthi vedayitaṃ. Pañcime, āvuso, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā – ime kho, āvuso, pañca kāmaguṇā. Yaṃ kho, āvuso, ime pañca kāmaguṇe paṭicca uppajjati sukhaṃ somanassaṃ, idaṃ vuccatāvuso, kāmasukhaṃ. ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato kāmasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa te kāmasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṃ vuttaṃ bhagavatā. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbānaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato vitakkasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa te vitakkasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṃ vuttaṃ bhagavatā. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbānaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato pītisahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa te pītisahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṃ vuttaṃ bhagavatā. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbānaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato upekkhāsahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa te upekkhāsahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṃ vuttaṃ bhagavatā. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbānaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato rūpasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa te rūpasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṃ vuttaṃ bhagavatā. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbānaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato ākāsānañcāyatanasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa te ākāsānañcāyatanasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṃ vuttaṃ bhagavatā. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbānaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma, natthi kiñcīti ākiñcaññāyatanaṃ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato viññāṇañcāyatanasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa te viññāṇañcāyatanasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṃ vuttaṃ bhagavatā. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbānaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Tassa ce, āvuso, bhikkhuno iminā vihārena viharato ākiñcaññāyatanasahagatā saññāmanasikārā samudācaranti, svassa hoti ābādho. Seyyathāpi, āvuso, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa te ākiñcaññāyatanasahagatā saññāmanasikārā samudācaranti. Svassa hoti ābādho. Yo kho panāvuso, ābādho dukkhametaṃ vuttaṃ bhagavatā. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbānaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Imināpi kho etaṃ, āvuso, pariyāyena veditabbaṃ yathā sukhaṃ nibbāna’’nti. Tatiyaṃ.",
      "english": "At one time, the venerable Sāriputta was staying at Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. There, the venerable Sāriputta addressed the bhikkhus, saying, \"This Nibbāna, friends, is happiness. This Nibbāna, friends, is happiness.\" When this was said, the venerable Udāyī said to the venerable Sāriputta, \"But what, friend Sāriputta, is the happiness here, where there is no feeling?\" \"This indeed, friend, is the happiness here, that there is no feeling. There are these five strands of sensual pleasure, friends. Which five? Forms cognizable by the eye—desirable, agreeable, pleasing, lovely, sensually enticing, and stimulating craving; sounds cognizable by the ear… odours cognizable by the nose… tastes cognizable by the tongue… tactile sensations cognizable by the body—desirable, agreeable, pleasing, lovely, sensually enticing, and stimulating craving. These, friends, are the five strands of sensual pleasure. And whatever happiness and joy arise, friends, conditioned by these five strands of sensual pleasure, that, friends, is called sensual happiness.\"\n\n\"Here, friends, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters and remains in the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, and filled with rapture and happiness. If, while a bhikkhu is dwelling in this dwelling, friends, perceptions and mental formations associated with sensual pleasures arise in him, that is an affliction for him. Just as, friends, pain might arise for one who is happy, merely for affliction; in the same way, those perceptions and mental formations associated with sensual pleasures arise in him. That is an affliction for him. And whatever is an affliction, friends, that has been declared by the Blessed One as suffering. By this method too, friends, it should be understood how Nibbāna is happiness.\"\n\n\"Furthermore, friends, a bhikkhu, with the fading away of applied thought and sustained thought, enters and remains in the second jhāna, which has internal assurance and unification of mind, is free from applied thought and sustained thought, born of concentration, and filled with rapture and happiness. If, while a bhikkhu is dwelling in this dwelling, friends, perceptions and mental formations associated with applied thought arise in him, that is an affliction for him. Just as, friends, pain might arise for one who is happy, merely for affliction; in the same way, those perceptions and mental formations associated with applied thought arise in him. That is an affliction for him. And whatever is an affliction, friends, that has been declared by the Blessed One as suffering. By this method too, friends, it should be understood how Nibbāna is happiness.\"\n\n\"Furthermore, friends, a bhikkhu, with the fading away of rapture, dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body, and enters and remains in the third jhāna, of which the Noble Ones declare: 'He has a pleasant dwelling who dwells in equanimity and mindfulness.' If, while a bhikkhu is dwelling in this dwelling, friends, perceptions and mental formations associated with rapture arise in him, that is an affliction for him. Just as, friends, pain might arise for one who is happy, merely for affliction; in the same way, those perceptions and mental formations associated with rapture arise in him. That is an affliction for him. And whatever is an affliction, friends, that has been declared by the Blessed One as suffering. By this method too, friends, it should be understood how Nibbāna is happiness.\"\n\n\"Furthermore, friends, a bhikkhu, with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, enters and remains in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. If, while a bhikkhu is dwelling in this dwelling, friends, perceptions and mental formations associated with equanimity arise in him, that is an affliction for him. Just as, friends, pain might arise for one who is happy, merely for affliction; in the same way, those perceptions and mental formations associated with equanimity arise in him. That is an affliction for him. And whatever is an affliction, friends, that has been declared by the Blessed One as suffering. By this method too, friends, it should be understood how Nibbāna is happiness.\"\n\n\"Furthermore, friends, a bhikkhu, with the complete transcendence of perceptions of form, with the disappearance of perceptions of sensory impingement, with non-attention to perceptions of diversity, perceiving 'space is infinite,' enters and remains in the sphere of infinite space. If, while a bhikkhu is dwelling in this dwelling, friends, perceptions and mental formations associated with form arise in him, that is an affliction for him. Just as, friends, pain might arise for one who is happy, merely for affliction; in the same way, those perceptions and mental formations associated with form arise in him. That is an affliction for him. And whatever is an affliction, friends, that has been declared by the Blessed One as suffering. By this method too, friends, it should be understood how Nibbāna is happiness.\"\n\n\"Furthermore, friends, a bhikkhu, with the complete transcendence of the sphere of infinite space, perceiving 'consciousness is infinite,' enters and remains in the sphere of infinite consciousness. If, while a bhikkhu is dwelling in this dwelling, friends, perceptions and mental formations associated with the sphere of infinite space arise in him, that is an affliction for him. Just as, friends, pain might arise for one who is happy, merely for affliction; in the same way, those perceptions and mental formations associated with the sphere of infinite space arise in him. That is an affliction for him. And whatever is an affliction, friends, that has been declared by the Blessed One as suffering. By this method too, friends, it should be understood how Nibbāna is happiness.\"\n\n\"Furthermore, friends, a bhikkhu, with the complete transcendence of the sphere of infinite consciousness, perceiving 'there is nothing,' enters and remains in the sphere of nothingness.\"\n\nAnd if, friend, while that monk dwells in this abiding, perceptions and mental formations associated with the sphere of infinite consciousness arise for him, that becomes an affliction for him. Just as, friend, for one who is comfortable, suffering might arise purely as an affliction, even so, these perceptions and mental formations associated with the sphere of infinite consciousness arise for him. That becomes an affliction for him. Indeed, friend, whatever is an affliction has been declared as suffering by the Blessed One. By this way, too, friend, it should be understood that Nibbana is bliss.\n\nFurthermore, friend, a monk, having entirely transcended the sphere of nothingness, enters upon and dwells in the sphere of neither perception nor non-perception. And if, friend, while that monk dwells in this abiding, perceptions and mental formations associated with the sphere of nothingness arise for him, that becomes an affliction for him. Just as, friend, for one who is comfortable, suffering might arise purely as an affliction, even so, these perceptions and mental formations associated with the sphere of nothingness arise for him. That becomes an affliction for him. Indeed, friend, whatever is an affliction has been declared as suffering by the Blessed One. By this way, too, friend, it should be understood that Nibbana is bliss.\n\nFurthermore, friend, a monk, having entirely transcended the sphere of neither perception nor non-perception, enters upon and dwells in the cessation of perception and feeling, and having seen with wisdom, his taints are utterly destroyed. By this way, too, friend, it should be understood that Nibbana is bliss.",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් ශාක්‍රිය​පුත්‍ර (සැරියුත්) ස්ථවිරයන් වහන්සේ රාජග්‍රහ නුවර වේළුවන නම් වූ කලන්දක නිවාපයේ වැඩ වාසය කළ සේක. එසමයෙහි ආයුෂ්මත් ශාක්‍රිය​පුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලා අමතා මෙසේ වදාළ සේක: “ඇවැත්නි, මේ නිවන සැපයකි. ඇවැත්නි, මේ නිවන සැපයකි.” මෙසේ වදාළ විට ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශාක්‍රිය​පුත්‍ර ස්ථවිරයන් වහන්සේට මෙසේ පැවසූ සේක: “ඇවැත් ශාක්‍රිය​පුත්‍ර, මෙහි විඳීමක් (වේදනා) නැති කල්හි කෙසේ සැපයක් වේ ද?” “(ඇවැත්නි,) යම් තැනක වේදනා නොපවතිනවාද, එයම මෙහි සැපයයි.” “ඇවැත්නි, මේ පංච කාම ගුණ වෙති. කවරේද ඒ පස? ඇසට විෂය වන රූප, ඒවා ඉෂ්ටය, කාන්තය, මනාපය, ප්‍රිය ස්වභාවය ඇත්තේය, කාමය හා බැඳී පවතී, ආශාවන් ඇති කරයි; කනට විෂය වන ශබ්ද... (පෙ)... නාසයට විෂය වන ගන්ධ... දිවට විෂය වන රස... කයට විෂය වන ස්පර්ශ, ඒවා ඉෂ්ටය, කාන්තය, මනාපය, ප්‍රිය ස්වභාවය ඇත්තේය, කාමය හා බැඳී පවතී, ආශාවන් ඇති කරයි. ඇවැත්නි, මේවා පංච කාම ගුණ නම් වේ. ඇවැත්නි, මේ පංච කාම ගුණ නිසා යම් සැපයක් හා සොම්නසක් උපදී ද, ඇවැත්නි, මෙය කාමසුඛයයි කියනු ලැබේ.”\n\n“ඇවැත්නි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්ව... පළමු ධ්‍යානයට එළඹ වාසය කරයි. ඇවැත්නි, යම් හෙයකින් ඒ භික්ෂුවට මේ විහරණයෙන් වාසය කරන කල්හි කාමයන් හා බැඳුණු සංඥා හා මනසිකාර නැවත නැවත උපදී ද, එය ඔහුට බාධාවකි. ඇවැත්නි, යම් සේ සැපයෙන් සිටින කෙනෙකුට බාධාවක් පිණිස දුකක් උපදී ද, එසේම ඒ කාමයන් හා බැඳුණු සංඥා හා මනසිකාර ඔහුට නැවත නැවත උපදී. එය ඔහුට බාධාවකි. ඇවැත්නි, යම් බාධාවක් වේ ද, එය දුකක් ලෙස භාග්‍යවතුන් වහන්සේ විසින් දේශනා කර ඇත. ඇවැත්නි, මේ කරුණෙනුත් නිවන සැපයක් බව දැනගත යුත්තේය.”\n\n“තවද, ඇවැත්නි, භික්ෂුව විතර්ක විචාරයන් සංසිඳවීමෙන්... දෙවෙනි ධ්‍යානයට එළඹ වාසය කරයි. ඇවැත්නි, යම් හෙයකින් ඒ භික්ෂුවට මේ විහරණයෙන් වාසය කරන කල්හි විතර්කයන් හා බැඳුණු සංඥා හා මනසිකාර නැවත නැවත උපදී ද, එය ඔහුට බාධාවකි. ඇවැත්නි, යම් සේ සැපයෙන් සිටින කෙනෙකුට බාධාවක් පිණිස දුකක් උපදී ද, එසේම ඒ විතර්කයන් හා බැඳුණු සංඥා හා මනසිකාර ඔහුට නැවත නැවත උපදී. එය ඔහුට බාධාවකි. ඇවැත්නි, යම් බාධාවක් වේ ද, එය දුකක් ලෙස භාග්‍යවතුන් වහන්සේ විසින් දේශනා කර ඇත. ඇවැත්නි, මේ කරුණෙනුත් නිවන සැපයක් බව දැනගත යුත්තේය.”\n\n“තවද, ඇවැත්නි, භික්ෂුව ප්‍රීතියට ද නොඇල්මෙන්... තුන්වෙනි ධ්‍යානයට එළඹ වාසය කරයි. ඇවැත්නි, යම් හෙයකින් ඒ භික්ෂුවට මේ විහරණයෙන් වාසය කරන කල්හි ප්‍රීතිය හා බැඳුණු සංඥා හා මනසිකාර නැවත නැවත උපදී ද, එය ඔහුට බාධාවකි. ඇවැත්නි, යම් සේ සැපයෙන් සිටින කෙනෙකුට බාධාවක් පිණිස දුකක් උපදී ද, එසේම ඒ ප්‍රීතිය හා බැඳුණු සංඥා හා මනසිකාර ඔහුට නැවත නැවත උපදී. එය ඔහුට බාධාවකි. ඇවැත්නි, යම් බාධාවක් වේ ද, එය දුකක් ලෙස භාග්‍යවතුන් වහන්සේ විසින් දේශනා කර ඇත. ඇවැත්නි, මේ කරුණෙනුත් නිවන සැපයක් බව දැනගත යුත්තේය.”\n\n“තවද, ඇවැත්නි, භික්ෂුව සැපය ද අත්හැරීමෙන්... සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරයි. ඇවැත්නි, යම් හෙයකින් ඒ භික්ෂුවට මේ විහරණයෙන් වාසය කරන කල්හි උපේක්ෂාව හා බැඳුණු සංඥා හා මනසිකාර නැවත නැවත උපදී ද, එය ඔහුට බාධාවකි. ඇවැත්නි, යම් සේ සැපයෙන් සිටින කෙනෙකුට බාධාවක් පිණිස දුකක් උපදී ද, එසේම ඒ උපේක්ෂාව හා බැඳුණු සංඥා හා මනසිකාර ඔහුට නැවත නැවත උපදී. එය ඔහුට බාධාවකි. ඇවැත්නි, යම් බාධාවක් වේ ද, එය දුකක් ලෙස භාග්‍යවතුන් වහන්සේ විසින් දේශනා කර ඇත. ඇවැත්නි, මේ කරුණෙනුත් නිවන සැපයක් බව දැනගත යුත්තේය.”\n\n“තවද, ඇවැත්නි, භික්ෂුව සියලු රූප සංඥාවන් ඉක්මවා, ප්‍රතිඝ සංඥාවන් අන්තර්ගත වී, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන් ‘ආකාසය අනන්තය’යි (සලකා) ආකාසානංචායතනයට එළඹ වාසය කරයි. ඇවැත්නි, යම් හෙයකින් ඒ භික්ෂුවට මේ විහරණයෙන් වාසය කරන කල්හි රූපයන් හා බැඳුණු සංඥා හා මනසිකාර නැවත නැවත උපදී ද, එය ඔහුට බාධාවකි. ඇවැත්නි, යම් සේ සැපයෙන් සිටින කෙනෙකුට බාධාවක් පිණිස දුකක් උපදී ද, එසේම ඒ රූපයන් හා බැඳුණු සංඥා හා මනසිකාර ඔහුට නැවත නැවත උපදී. එය ඔහුට බාධාවකි. ඇවැත්නි, යම් බාධාවක් වේ ද, එය දුකක් ලෙස භාග්‍යවතුන් වහන්සේ විසින් දේශනා කර ඇත. ඇවැත්නි, මේ කරුණෙනුත් නිවන සැපයක් බව දැනගත යුත්තේය.”\n\n“තවද, ඇවැත්නි, භික්ෂුව සියලු ආකාසානංචායතනය ඉක්මවා, ‘විඤ්ඤාණය අනන්තය’යි (සලකා) විඤ්ඤාණංචායතනයට එළඹ වාසය කරයි. ඇවැත්නි, යම් හෙයකින් ඒ භික්ෂුවට මේ විහරණයෙන් වාසය කරන කල්හි ආකාසානංචායතනය හා බැඳුණු සංඥා හා මනසිකාර නැවත නැවත උපදී ද, එය ඔහුට බාධාවකි. ඇවැත්නි, යම් සේ සැපයෙන් සිටින කෙනෙකුට බාධාවක් පිණිස දුකක් උපදී ද, එසේම ඒ ආකාසානංචායතනය හා බැඳුණු සංඥා හා මනසිකාර ඔහුට නැවත නැවත උපදී. එය ඔහුට බාධාවකි. ඇවැත්නි, යම් බාධාවක් වේ ද, එය දුකක් ලෙස භාග්‍යවතුන් වහන්සේ විසින් දේශනා කර ඇත. ඇවැත්නි, මේ කරුණෙනුත් නිවන සැපයක් බව දැනගත යුත්තේය.”\n\n“තවද, ඇවැත්නි, භික්ෂුව සියලු විඤ්ඤාණංචායතනය ඉක්මවා, ‘කිසිවක් නැතැයි’ (සලකා) ආකිංචඤ්ඤායතනයට එළඹ වාසය කරයි.\n\nආයුෂ්මත්නි, යම් භික්ෂු‍වක් මේ වි‍හරණයෙන් වාසය කරද්දී, වි‍ඥා‍ණානන්ත ආයතනය හා බැඳුණු සංඥා‍ හා මනසිකාරයන් ඔහුට උපදී නම්, එය ඔහුට බාධා‍වක් වේ. ආයුෂ්මත්නි, යම් සේ සුවසේ වසන කෙනෙකුට බාධා‍වක් පිණිසම දුක උපදී ද, එලෙසම ඔහුට ඒ වි‍ඥා‍ණානන්ත ආයතනය හා බැඳුණු සංඥා‍ හා මනසිකාරයන් උපදී. එය ඔහුට බාධා‍වක් වේ. ආයුෂ්මත්නි, යම් බාධා‍වක් වේ ද, එය දුකක් බව භාග්‍ය‍වතුන් වහන්සේ වදාරා ඇත. ආයුෂ්මත්නි, නිවන සුවයක් බව මේ ආකාරයෙන් ද තේරුම් ගත යුතුයි.\n\nතවද, ආයුෂ්මත්නි, භික්ෂු‍වක් සියලු ආකාරයෙන් අකිඤ්චඤ්ඤා‍යතනය ඉක්මවා, නේවසඤ්ඤා‍නාසඤ්ඤා‍යතනයට පැමිණ වාසය කරයි. ආයුෂ්මත්නි, යම් භික්ෂු‍වක් මේ වි‍හරණයෙන් වාසය කරද්දී, අකිඤ්චඤ්ඤා‍යතනය හා බැඳුණු සංඥා‍ හා මනසිකාරයන් ඔහුට උපදී නම්, එය ඔහුට බාධා‍වක් වේ. ආයුෂ්මත්නි, යම් සේ සුවසේ වසන කෙනෙකුට බාධා‍වක් පිණිසම දුක උපදී ද, එලෙසම ඔහුට ඒ අකිඤ්චඤ්ඤා‍යතනය හා බැඳුණු සංඥා‍ හා මනසිකාරයන් උපදී. එය ඔහුට බාධා‍වක් වේ. ආයුෂ්මත්නි, යම් බාධා‍වක් වේ ද, එය දුකක් බව භාග්‍ය‍වතුන් වහන්සේ වදාරා ඇත. ආයුෂ්මත්නි, නිවන සුවයක් බව මේ ආකාරයෙන් ද තේරුම් ගත යුතුයි.\n\nතවද, ආයුෂ්මත්නි, භික්ෂු‍වක් සියලු ආකාරයෙන් නේවසඤ්ඤා‍නාසඤ්ඤා‍යතනය ඉක්මවා, සංඥා‍වේදයිත නිරෝධයට පැමිණ වාසය කරයි, ප්‍ර‍ඥා‍වෙන් දැකීමෙන් ඔහුගේ ආශ්‍ර‍වයන් ක්ෂය වී ඇත. ආයුෂ්මත්නි, නිවන සුවයක් බව මේ ආකාරයෙන් ද තේරුම් ගත යුතුයි.",
      "paliTitle": "Nibbānasukhasuttaṃ"
    },
    {
      "number": 35,
      "pali": "‘‘Seyyathāpi, bhikkhave, gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate carituṃ. Tassā evamassa – ‘yaṃnūnāhaṃ agatapubbañceva disaṃ gaccheyyaṃ, akhāditapubbāni ca tiṇāni khādeyyaṃ, apītapubbāni ca pānīyāni piveyya’nti. Sā purimaṃ pādaṃ na suppatiṭṭhitaṃ patiṭṭhāpetvā pacchimaṃ pādaṃ uddhareyya. Sā na ceva agatapubbaṃ disaṃ gaccheyya, na ca akhāditapubbāni tiṇāni khādeyya, na ca apītapubbāni pānīyāni piveyya; yasmiṃ cassā padese ṭhitāya evamassa – ‘yaṃnūnāhaṃ agatapubbañceva disaṃ gaccheyyaṃ, akhāditapubbāni ca tiṇāni khādeyyaṃ, apītapubbāni ca pānīyāni piveyya’nti tañca padesaṃ na sotthinā paccāgaccheyya. Taṃ kissa hetu? Tathā hi sā, bhikkhave, gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate carituṃ. Evamevaṃ kho, bhikkhave, idhekacco bhikkhu bālo abyatto akhettaññū akusalo vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati; so taṃ nimittaṃ na āsevati na bhāveti na bahulīkaroti na svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja vihareyya’nti. So na sakkoti vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharituṃ. Tassa evaṃ hoti – ‘yaṃnūnāhaṃ vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja vihareyya’nti. So na sakkoti vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharituṃ. Ayaṃ vuccati, bhikkhave, ‘bhikkhu ubhato bhaṭṭho ubhato parihīno, seyyathāpi sā gāvī pabbateyyā bālā abyattā akhettaññū akusalā visame pabbate carituṃ’’’. ‘‘Seyyathāpi, bhikkhave, gāvī pabbateyyā paṇḍitā byattā khettaññū kusalā visame pabbate carituṃ. Tassā evamassa – ‘yaṃnūnāhaṃ agatapubbañceva disaṃ gaccheyyaṃ, akhāditapubbāni ca tiṇāni khādeyyaṃ, apītapubbāni ca pānīyāni piveyya’nti. Sā purimaṃ pādaṃ suppatiṭṭhitaṃ patiṭṭhāpetvā pacchimaṃ pādaṃ uddhareyya. Sā agatapubbañceva disaṃ gaccheyya, akhāditapubbāni ca tiṇāni khādeyya, apītapubbāni ca pānīyāni piveyya. Yasmiṃ cassā padese ṭhitāya evamassa – ‘yaṃnūnāhaṃ agatapubbañceva disaṃ gaccheyyaṃ, akhāditapubbāni ca tiṇāni khādeyyaṃ, apītapubbāni ca pānīyāni piveyya’nti tañca padesaṃ sotthinā paccāgaccheyya. Taṃ kissa hetu? Tathā hi sā, bhikkhave, gāvī pabbateyyā paṇḍitā byattā khettaññū kusalā visame pabbate carituṃ. Evamevaṃ kho, bhikkhave, idhekacco bhikkhu paṇḍito byatto khettaññū kusalo vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. So taṃ nimittaṃ āsevati bhāveti bahulīkaroti svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja vihareyya’nti. So dutiyaṃ jhānaṃ anabhihiṃsamāno vitakkavicārānaṃ vūpasamā… dutiyaṃ jhānaṃ upasampajja viharati. So taṃ nimittaṃ āsevati bhāveti bahulīkaroti svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ pītiyā ca virāgā upekkhako ca vihareyyaṃ sato ca sampajāno, sukhañca kāyena paṭisaṃvedeyyaṃ yaṃ taṃ ariyā ācikkhanti – upekkhako satimā sukhavihārīti tatiyaṃ jhānaṃ upasampajja vihareyya’nti. So tatiyaṃ jhānaṃ anabhihiṃsamāno pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. So taṃ nimittaṃ āsevati bhāveti bahulīkaroti svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja vihareyya’nti. So catutthaṃ jhānaṃ anabhihiṃsamāno sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. So taṃ nimittaṃ āsevati bhāveti bahulīkaroti svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ananto ākāsoti ākāsānañcāyatanaṃ upasampajja vihareyya’nti. So ākāsānañcāyatanaṃ anabhihiṃsamāno sabbaso rūpasaññānaṃ samatikkamā …pe… ākāsānañcāyatanaṃ upasampajja viharati. So taṃ nimittaṃ āsevati bhāveti bahulīkaroti svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ sabbaso ākāsānañcāyatanaṃ samatikkamma anantaṃ viññāṇanti viññāṇañcāyatanaṃ upasampajja vihareyya’nti. So viññāṇañcāyatanaṃ anabhihiṃsamāno sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. So taṃ nimittaṃ āsevati bhāveti bahulīkaroti svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja vihareyya’nti. So ākiñcaññāyatanaṃ anabhihiṃsamāno sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. So taṃ nimittaṃ āsevati bhāveti bahulīkaroti svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja vihareyya’nti. So nevasaññānāsaññāyatanaṃ anabhihiṃsamāno sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. So taṃ nimittaṃ āsevati bhāveti bahulīkaroti svādhiṭṭhitaṃ adhiṭṭhāti. ‘‘Tassa evaṃ hoti – ‘yaṃnūnāhaṃ sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja vihareyya’nti. So saññāvedayitanirodhaṃ anabhihiṃsamāno sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati. ‘‘Yato kho, bhikkhave, bhikkhu taṃ tadeva samāpattiṃ samāpajjatipi vuṭṭhātipi, tassa mudu cittaṃ hoti kammaññaṃ. Mudunā kammaññena cittena appamāṇo samādhi hoti subhāvito. So appamāṇena samādhinā subhāvitena yassa yassa abhiññāsacchikaraṇīyassa dhammassa cittaṃ abhininnāmeti abhiññāsacchikiriyāya tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ iddhividhaṃ paccanubhaveyyaṃ, ekopi hutvā bahudhā assaṃ, bahudhāpi hutvā eko assaṃ…pe… yāva brahmalokāpi kāyena vasaṃ vatteyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – dibbāya sotadhātuyā…pe… sati sati āyatane. ‘‘So sace ākaṅkhati – ‘parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajāneyyaṃ, sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajāneyyaṃ, vītarāgaṃ vā cittaṃ vītarāgaṃ cittanti pajāneyyaṃ, sadosaṃ vā cittaṃ sadosaṃ cittanti pajāneyyaṃ, vītadosaṃ vā cittaṃ vītadosaṃ cittanti pajāneyyaṃ, samohaṃ vā cittaṃ samohaṃ cittanti pajāneyyaṃ, vītamohaṃ vā cittaṃ… saṃkhittaṃ vā cittaṃ… vikkhittaṃ vā cittaṃ… mahaggataṃ vā cittaṃ… amahaggataṃ vā cittaṃ… sauttaraṃ vā cittaṃ… anuttaraṃ vā cittaṃ… samāhitaṃ vā cittaṃ… asamāhitaṃ vā cittaṃ… vimuttaṃ vā cittaṃ… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘anekavihitaṃ pubbenivāsaṃ anussareyyaṃ, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajāneyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane. ‘‘So sace ākaṅkhati – ‘āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti, tatra tatreva sakkhibhabbataṃ pāpuṇāti sati sati āyatane’’ti. Catutthaṃ.",
      "english": "Monks, just as a foolish, inexperienced, ignorant, and unskilled cow from the mountains, unable to traverse uneven mountain terrain, might think: ‘Oh, if only I could go to a direction I haven't gone before, eat grasses I haven't eaten before, and drink waters I haven't drunk before.’ Without firmly establishing her front foot, she would lift her hind foot. She would not go to a direction she hadn't gone before, nor eat grasses she hadn't eaten before, nor drink waters she hadn't drunk before. And from the very place she stood, thinking, ‘Oh, if only I could go to a direction I haven't gone before, eat grasses I haven't eaten before, and drink waters I haven't drunk before,’ she would not return safely to that place. Why is that? Because, Monks, that mountain cow is foolish, inexperienced, ignorant, and unskilled at traversing uneven mountain terrain. In the same way, Monks, some monk here is foolish, inexperienced, ignorant, and unskilled. He enters and dwells in the first meditative absorption, which is secluded from sensual pleasures and unwholesome states, accompanied by initial application and sustained application, and filled with rapture and happiness born of seclusion. But he does not attend to that sign, nor develop it, nor cultivate it extensively, nor establish it firmly.\n\nHe thinks: ‘Oh, if only I could enter and dwell in the second meditative absorption, which is free from initial and sustained application, with internal assurance and unification of mind, without initial and sustained application, and filled with rapture and happiness born of concentration.’ But he is unable to enter and dwell in the second meditative absorption, which is free from initial and sustained application, with internal assurance and unification of mind, without initial and sustained application, and filled with rapture and happiness born of concentration. Then he thinks: ‘Oh, if only I could enter and dwell in the first meditative absorption, which is secluded from sensual pleasures and unwholesome states, accompanied by initial application and sustained application, and filled with rapture and happiness born of seclusion.’ But he is unable to enter and dwell in the first meditative absorption, which is secluded from sensual pleasures and unwholesome states, accompanied by initial application and sustained application, and filled with rapture and happiness born of seclusion. This, Monks, is called a monk who has fallen away from both, who has lost both, just like that foolish, inexperienced, ignorant, and unskilled mountain cow, unable to traverse uneven mountain terrain.\n\nMonks, just as a wise, experienced, discerning, and skilled cow from the mountains, able to traverse uneven mountain terrain, might think: ‘Oh, if only I could go to a direction I haven't gone before, eat grasses I haven't eaten before, and drink waters I haven't drunk before.’ Firmly establishing her front foot, she would then lift her hind foot. She would go to a direction she hadn't gone before, eat grasses she hadn't eaten before, and drink waters she hadn't drunk before. And from the very place she stood, thinking, ‘Oh, if only I could go to a direction I haven't gone before, eat grasses I haven't eaten before, and drink waters I haven't drunk before,’ she would return safely to that place. Why is that? Because, Monks, that mountain cow is wise, experienced, discerning, and skilled at traversing uneven mountain terrain. In the same way, Monks, some monk here is wise, experienced, discerning, and skilled. He enters and dwells in the first meditative absorption, which is secluded from sensual pleasures and unwholesome states, accompanied by initial application and sustained application, and filled with rapture and happiness born of seclusion. He attends to that sign, develops it, cultivates it extensively, and establishes it firmly.\n\nHe thinks: ‘Oh, if only I could enter and dwell in the second meditative absorption, which is free from initial and sustained application, with internal assurance and unification of mind, without initial and sustained application, and filled with rapture and happiness born of concentration.’ Without allowing the second meditative absorption to waver, by the cessation of initial and sustained application, with internal assurance and unification of mind, without initial and sustained application, and filled with rapture and happiness born of concentration, he enters and dwells in the second meditative absorption. He attends to that sign, develops it, cultivates it extensively, and establishes it firmly.\n\nHe thinks: ‘Oh, if only I could enter and dwell in the third meditative absorption, by the fading away of rapture, remaining equanimous and mindful, with clear comprehension, and experiencing happiness with the body, of which the noble ones declare: \"He dwells happily with equanimity and mindfulness.\"’ Without allowing the third meditative absorption to waver, by the fading away of rapture, remaining equanimous and mindful, with clear comprehension, and experiencing happiness with the body, of which the noble ones declare: \"He dwells happily with equanimity and mindfulness,\" he enters and dwells in the third meditative absorption. He attends to that sign, develops it, cultivates it extensively, and establishes it firmly.\n\nHe thinks: ‘Oh, if only I could enter and dwell in the fourth meditative absorption, by the abandoning of pleasure and the abandoning of pain, and by the prior disappearance of joy and sorrow, a state of neither-pain-nor-pleasure, purified by equanimity and mindfulness.’ Without allowing the fourth meditative absorption to waver, by the abandoning of pleasure and the abandoning of pain, and by the prior disappearance of joy and sorrow, a state of neither-pain-nor-pleasure, purified by equanimity and mindfulness, he enters and dwells in the fourth meditative absorption. He attends to that sign, develops it, cultivates it extensively, and establishes it firmly.\n\nHe thinks: ‘Oh, if only I could enter and dwell in the sphere of infinite space, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, by not attending to perceptions of diversity, perceiving \"space is infinite\".’\n\nWithout undermining the dimension of infinite space, having entirely transcended perceptions of form, with the disappearance of perceptions of sensory impingement, and not attending to perceptions of diversity, perceiving 'space is infinite,' he enters upon and abides in the dimension of infinite space. He repeatedly resorts to, develops, and makes much of that sign, establishing it firmly within himself.\n\nThen it occurs to him: 'What if I were to entirely transcend the dimension of infinite space and, perceiving \"infinite consciousness,\" enter upon and abide in the dimension of infinite consciousness?' Without undermining the dimension of infinite consciousness, having entirely transcended the dimension of infinite space, perceiving 'infinite consciousness,' he enters upon and abides in the dimension of infinite consciousness. He repeatedly resorts to, develops, and makes much of that sign, establishing it firmly within himself.\n\nThen it occurs to him: 'What if I were to entirely transcend the dimension of infinite consciousness and, perceiving \"there is nothing,\" enter upon and abide in the dimension of nothingness?' Without undermining the dimension of nothingness, having entirely transcended the dimension of infinite consciousness, perceiving 'there is nothing,' he enters upon and abides in the dimension of nothingness. He repeatedly resorts to, develops, and makes much of that sign, establishing it firmly within himself.\n\nThen it occurs to him: 'What if I were to entirely transcend the dimension of nothingness and enter upon and abide in the dimension of neither perception nor non-perception?' Without undermining the dimension of neither perception nor non-perception, having entirely transcended the dimension of nothingness, he enters upon and abides in the dimension of neither perception nor non-perception. He repeatedly resorts to, develops, and makes much of that sign, establishing it firmly within himself.\n\nThen it occurs to him: 'What if I were to entirely transcend the dimension of neither perception nor non-perception and enter upon and abide in the cessation of perception and feeling?' Without undermining the cessation of perception and feeling, having entirely transcended the dimension of neither perception nor non-perception, he enters upon and abides in the cessation of perception and feeling.\n\nWhen, bhikkhus, a monk repeatedly enters upon and emerges from these very attainments, his mind becomes pliant and workable. With a pliant and workable mind, limitless concentration becomes well-developed. With such well-developed, limitless concentration, to whatever state realizable by direct knowledge he inclines his mind for the direct realization, in each instance, he becomes capable of personally witnessing it, provided there is a basis.\n\nIf he wishes: 'I might experience various kinds of psychic powers—being one, I might become many; having become many, I might become one; I might appear and vanish; I might pass unhindered through walls, ramparts, and mountains as if through space; I might dive into and emerge from the earth as if it were water; I might walk on water without sinking as if it were dry land; I might travel through the air while sitting cross-legged as if I were a winged bird; I might touch and stroke the moon and sun, so mighty and powerful; I might exercise mastery with my body even as far as the Brahmā world'—in each instance, he becomes capable of personally witnessing it, provided there is a basis.\n\nIf he wishes: 'With the divine ear element, purified and surpassing human understanding, I might hear both kinds of sounds, divine and human, those that are far as well as near'—in each instance, he becomes capable of personally witnessing it, provided there is a basis.\n\nIf he wishes: 'I might comprehend the minds of other beings, other individuals, having encompassed them with my own mind; I might discern a mind with lust as 'a mind with lust,' or a mind without lust as 'a mind without lust'; a mind with hatred as 'a mind with hatred,' or a mind without hatred as 'a mind without hatred'; a mind with delusion as 'a mind with delusion,' or a mind without delusion as 'a mind without delusion'; a contracted mind as 'a contracted mind,' or a scattered mind as 'a scattered mind'; a developed mind as 'a developed mind,' or an undeveloped mind as 'an undeveloped mind'; a mind with something higher as 'a mind with something higher,' or a mind with nothing higher as 'a mind with nothing higher'; a concentrated mind as 'a concentrated mind,' or an unconcentrated mind as 'an unconcentrated mind'; a freed mind as 'a freed mind,' or an unfreed mind as 'an unfreed mind''—in each instance, he becomes capable of personally witnessing it, provided there is a basis.\n\nIf he wishes: 'I might recollect my manifold past lives, that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births; many aeons of cosmic contraction, many aeons of cosmic expansion, many aeons of cosmic contraction and expansion; \"There I was named thus, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my lifespan. Passing away from there, I reappeared elsewhere. There, too, I was named thus, of such a clan, with such an appearance, such was my food, such my experience of pleasure and pain, such my lifespan. Passing away from there, I reappeared here.\" Thus I might recollect my manifold past lives with their aspects and particulars'—in each instance, he becomes capable of personally witnessing it, provided there is a basis.\n\nIf he wishes: 'With the divine eye, purified and surpassing human sight, I might see beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and understand them as they pass away and reappear according to their karma'—in each instance, he becomes capable of personally witnessing it, provided there is a basis.\n\nIf he wishes: 'Through the destruction of the taints, having realized for myself with direct knowledge in this very life the stainless liberation of mind and liberation by wisdom, I might enter upon and abide in it'—in each instance, he becomes capable of personally witnessing it, provided there is a basis.",
      "sinhala": "මහණෙනි, යම් සේ අද්දැකීම් අඩු, නුපුහුණු, ප්‍රදේශය හඳුනන්නේ නැති, කඳුකර ප්‍රදේශවල හැසිරීමට අදක්ෂ එළදෙනක් විෂම වූ කඳුකර ප්‍රදේශයක හැසිරෙයි ද, ඈට මෙසේ සිතක් ඇතිවෙයි: ‘මම මේ වන තෙක් නොගිය දිසාවකට යන්නෙම් නම්, නොකෑ තණකොළ කන්නෙම් නම්, නොබී වතුර බොන්නෙම් නම්’ කියා. ඈ පෙර පාදය ස්ථිරව නොපිහිටුවා පසු පාදය ඔසවයි. ඈ නොගිය දිසාවකට යන්නටත් නොහැකි වෙයි, නොකෑ තණකොළ කන්නටත් නොහැකි වෙයි, නොබී වතුර බොන්නටත් නොහැකි වෙයි; ඈ සිටි ඒ ප්‍රදේශය කරා ‘මම නොගිය දිසාවකට යන්නෙම් නම්, නොකෑ තණකොළ කන්නෙම් නම්, නොබී වතුර බොන්නෙම් නම්’ යි සිතාගත් තැනට සුරක්ෂිතව නැවත පැමිණෙන්නටද නොහැකි වෙයි. එයට හේතුව කුමක්ද? මහණෙනි, ඒ එළදෙන අද්දැකීම් අඩු, නුපුහුණු, ප්‍රදේශය හඳුනන්නේ නැති, විෂම වූ කඳුකර ප්‍රදේශවල හැසිරීමට අදක්ෂ වූ බැවිනි. මහණෙනි, එලෙසින්ම මෙහි ඇතැම් භික්ෂුවක් බාලවූයේ, නුපුහුණු වූයේ, ක්ෂේත්‍රය නොදත් වූයේ, අදක්ෂ වූයේ, කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට එළඹ වාසය කරයි; හෙතෙම ඒ නිමිත්ත සේවනය නොකරයි, වඩන්නේ නැත, බහුල නොකරයි, හොඳින් අධිෂ්ඨාන නොකරයි.\n\nඔහුට මෙසේ සිතක් ඇතිවෙයි: ‘මම විතර්ක විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මික ප්‍රසාදයක් හා චිත්ත ඒකාග්‍රතාවයක් ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරන්නෙම් නම්’ කියා. හෙතෙම විතර්ක විචාරයන් සංසිඳවීමෙන් ඇතිවන අධ්‍යාත්මික ප්‍රසාදයක් හා චිත්ත ඒකාග්‍රතාවයක් ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවන ධ්‍යානයට එළඹ වාසය කිරීමට සමත් නොවේ. ඔහුට මෙසේ සිතක් ඇතිවෙයි: ‘මම කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට එළඹ වාසය කරන්නෙම් නම්’ කියා. හෙතෙම කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට එළඹ වාසය කිරීමටද සමත් නොවේ. මහණෙනි, මේ භික්ෂුව ‘අද්දැකීම් අඩු, නුපුහුණු, ප්‍රදේශය හඳුනන්නේ නැති, විෂම වූ කඳුකර ප්‍රදේශවල හැසිරීමට අදක්ෂ වූ ඒ එළදෙන යම් සේ ද, එසේ දෙපසින්ම බිඳී ගිය, දෙපසින්ම පිරිහී ගිය භික්ෂුවක්’ යැයි කියනු ලැබේ.\n\nමහණෙනි, යම් සේ නුවණැති, පුහුණු, ප්‍රදේශය හඳුනන, කඳුකර ප්‍රදේශවල හැසිරීමට දක්ෂ එළදෙනක් විෂම වූ කඳුකර ප්‍රදේශයක හැසිරෙයි ද, ඈට මෙසේ සිතක් ඇතිවෙයි: ‘මම මේ වන තෙක් නොගිය දිසාවකට යන්නෙම් නම්, නොකෑ තණකොළ කන්නෙම් නම්, නොබී වතුර බොන්නෙම් නම්’ කියා. ඈ පෙර පාදය හොඳින් පිහිටුවා පසු පාදය ඔසවයි. ඈ නොගිය දිසාවකට යන්නටත් සමත් වෙයි, නොකෑ තණකොළ කන්නටත් සමත් වෙයි, නොබී වතුර බොන්නටත් සමත් වෙයි. ඈ සිටි ඒ ප්‍රදේශය කරා ‘මම නොගිය දිසාවකට යන්නෙම් නම්, නොකෑ තණකොළ කන්නෙම් නම්, නොබී වතුර බොන්නෙම් නම්’ යි සිතාගත් තැනට සුරක්ෂිතව නැවත පැමිණෙන්නටද සමත් වෙයි. එයට හේතුව කුමක්ද? මහණෙනි, ඒ එළදෙන නුවණැති, පුහුණු, ප්‍රදේශය හඳුනන, විෂම වූ කඳුකර ප්‍රදේශවල හැසිරීමට දක්ෂ වූ බැවිනි. මහණෙනි, එලෙසින්ම මෙහි ඇතැම් භික්ෂුවක් නුවණැති, පුහුණු, ක්ෂේත්‍රය දත්, දක්ෂ වූයේ, කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට එළඹ වාසය කරයි. හෙතෙම ඒ නිමිත්ත සේවනය කරයි, වඩයි, බහුල කරයි, හොඳින් අධිෂ්ඨාන කරයි.\n\nඔහුට මෙසේ සිතක් ඇතිවෙයි: ‘මම විතර්ක විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මික ප්‍රසාදයක් හා චිත්ත ඒකාග්‍රතාවයක් ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරන්නෙම් නම්’ කියා. හෙතෙම දෙවන ධ්‍යානයට හානියක් නොවන සේ විතර්ක විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මික ප්‍රසාදයක් හා චිත්ත ඒකාග්‍රතාවයක් ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති-සැප ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරයි. හෙතෙම ඒ නිමිත්ත සේවනය කරයි, වඩයි, බහුල කරයි, හොඳින් අධිෂ්ඨාන කරයි.\n\nඔහුට මෙසේ සිතක් ඇතිවෙයි: ‘මම ප්‍රීතියෙන්ද වෙන්වීමෙන්, උපේක්ෂා සහගතව, සිහි නුවණින් යුක්තව වාසය කරමින්, ශරීරයෙන් සැපයක් අත්විඳිමින්, එය ආර්යයෝ ‘උපේක්ෂා සහගතය, සිහි නුවණින් යුක්තය, සැප විහරණයෙන් යුක්තය’ යැයි පවසන තුන්වන ධ්‍යානයට එළඹ වාසය කරන්නෙම් නම්’ කියා. හෙතෙම තුන්වන ධ්‍යානයට හානියක් නොවන සේ ප්‍රීතියෙන්ද වෙන්වීමෙන්, උපේක්ෂා සහගතව, සිහි නුවණින් යුක්තව වාසය කරමින්, ශරීරයෙන් සැපයක් අත්විඳිමින්, ආර්යයෝ ‘උපේක්ෂා සහගතය, සිහි නුවණින් යුක්තය, සැප විහරණයෙන් යුක්තය’ යැයි පවසන තුන්වන ධ්‍යානයට එළඹ වාසය කරයි. හෙතෙම ඒ නිමිත්ත සේවනය කරයි, වඩයි, බහුල කරයි, හොඳින් අධිෂ්ඨාන කරයි.\n\nඔහුට මෙසේ සිතක් ඇතිවෙයි: ‘මම සැපයද අත්හැරීමෙන්, දුකද අත්හැරීමෙන්, පෙර තිබූ සෝමනස්ස-දෝමනස්සයන්ගේ අතුරුදන්වීමෙන්, දුක් නොවන සැප නොවන, උපේක්ෂා-ස්මෘති පාරිශුද්ධිය ඇති සිව්වන ධ්‍යානයට එළඹ වාසය කරන්නෙම් නම්’ කියා. හෙතෙම සිව්වන ධ්‍යානයට හානියක් නොවන සේ සැපයද අත්හැරීමෙන්, දුකද අත්හැරීමෙන්, පෙර තිබූ සෝමනස්ස-දෝමනස්සයන්ගේ අතුරුදන්වීමෙන්, දුක් නොවන සැප නොවන, උපේක්ෂා-ස්මෘති පාරිශුද්ධිය ඇති සිව්වන ධ්‍යානයට එළඹ වාසය කරයි. හෙතෙම ඒ නිමිත්ත සේවනය කරයි, වඩයි, බහුල කරයි, හොඳින් අධිෂ්ඨාන කරයි.\n\nඔහුට මෙසේ සිතක් ඇතිවෙයි: ‘මම සියලු රූප සංඥාවන් සම්පූර්ණයෙන් ඉක්මවා, ප්‍රතිඝ සංඥාවන් අතුරුදන් කිරීමෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන් ‘අනන්ත වූ ආකාශය’ යැයි (සිතා) ආකාසානංචායතනයට එළඹ වාසය කරන්නෙම් නම්’ කියා.\n\nඔහු ආකාසානඤ්චායතනය පිළිබඳ පීඩාවකින් තොරව, මුළුමනින්ම රූප සංඥාවන් අතික්‍රමණය කොට, ගැටීම් සංඥාවන්ගේ අභාවයට පැමිණ, නානත්ව සංඥාවන්ට මනසිකාරය යොමු නොකොට, ‘අනන්ත වූ ආකාශය’ යැයි (මෙනෙහි කරමින්) ආකාසානඤ්චායතනයට උපසම්පදා වී වාසය කරයි. ඔහු ඒ නිමිත්ත සේවනය කරයි, වඩයි, බහුල වශයෙන් පුරුදු කරයි, මනාකොට අධිෂ්ඨාන කරයි. එවිට ඔහුට මෙසේ සිතේ: ‘කෙසේ නම් මම මුළුමනින්ම ආකාසානඤ්චායතනය අතික්‍රමණය කොට, ‘අනන්ත වූ විඤ්ඤාණය’ යැයි (මෙනෙහි කරමින්) විඤ්ඤාණඤ්චායතනයට උපසම්පදා වී වාසය කරන්නෙම්ද?’ ඔහු විඤ්ඤාණඤ්චායතනය පිළිබඳ පීඩාවකින් තොරව, මුළුමනින්ම ආකාසානඤ්චායතනය අතික්‍රමණය කොට, ‘අනන්ත වූ විඤ්ඤාණය’ යැයි (මෙනෙහි කරමින්) විඤ්ඤාණඤ්චායතනයට උපසම්පදා වී වාසය කරයි. ඔහු ඒ නිමිත්ත සේවනය කරයි, වඩයි, බහුල වශයෙන් පුරුදු කරයි, මනාකොට අධිෂ්ඨාන කරයි. එවිට ඔහුට මෙසේ සිතේ: ‘කෙසේ නම් මම මුළුමනින්ම විඤ්ඤාණඤ්චායතනය අතික්‍රමණය කොට, ‘කිසිවක් නැත’ යැයි (මෙනෙහි කරමින්) ආකිංචඤ්ඤායතනයට උපසම්පදා වී වාසය කරන්නෙම්ද?’ ඔහු ආකිංචඤ්ඤායතනය පිළිබඳ පීඩාවකින් තොරව, මුළුමනින්ම විඤ්ඤාණඤ්චායතනය අතික්‍රමණය කොට, ‘කිසිවක් නැත’ යැයි (මෙනෙහි කරමින්) ආකිංචඤ්ඤායතනයට උපසම්පදා වී වාසය කරයි. ඔහු ඒ නිමිත්ත සේවනය කරයි, වඩයි, බහුල වශයෙන් පුරුදු කරයි, මනාකොට අධිෂ්ඨාන කරයි. එවිට ඔහුට මෙසේ සිතේ: ‘කෙසේ නම් මම මුළුමනින්ම ආකිංචඤ්ඤායතනය අතික්‍රමණය කොට, නේවසඤ්ඤානාසඤ්ඤායතනයට උපසම්පදා වී වාසය කරන්නෙම්ද?’ ඔහු නේවසඤ්ඤානාසඤ්ඤායතනය පිළිබඳ පීඩාවකින් තොරව, මුළුමනින්ම ආකිංචඤ්ඤායතනය අතික්‍රමණය කොට, නේවසඤ්ඤානාසඤ්ඤායතනයට උපසම්පදා වී වාසය කරයි. ඔහු ඒ නිමිත්ත සේවනය කරයි, වඩයි, බහුල වශයෙන් පුරුදු කරයි, මනාකොට අධිෂ්ඨාන කරයි. එවිට ඔහුට මෙසේ සිතේ: ‘කෙසේ නම් මම මුළුමනින්ම නේවසඤ්ඤානාසඤ්ඤායතනය අතික්‍රමණය කොට, සඤ්ඤා වේදයිත නිරෝධයට උපසම්පදා වී වාසය කරන්නෙම්ද?’ ඔහු සඤ්ඤා වේදයිත නිරෝධය පිළිබඳ පීඩාවකින් තොරව, මුළුමනින්ම නේවසඤ්ඤානාසඤ්ඤායතනය අතික්‍රමණය කොට, සඤ්ඤා වේදයිත නිරෝධයට උපසම්පදා වී වාසය කරයි.\n\nමහණෙනි, යම් හෙයකින් භික්ෂුව ඒ ඒ සමාපත්තියට සමවැදෙයිද, එයින් නැගී සිටියිද, ඔහුගේ සිත මෘදු වේ, කම්මඤ්ඤ වේ. මෘදු වූ, කම්මඤ්ඤ වූ සිතින් අප්‍රමාණ වූ සමාධිය මැනවින් වඩනු ලැබේ. ඔහු මැනවින් වැඩූ ඒ අප්‍රමාණ සමාධියෙන්, අභිඥාවෙන් සාක්ෂාත් කළ යුතු යම් යම් ධර්මයක් කෙරෙහි අභිඥාවෙන් සාක්ෂාත් කිරීම පිණිස සිත නමන්නේද, ඒ ඒ අවස්ථාවන්හිදී, ඒ ඒ ආයතනයන්හිදී, සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් කැමති වේ නම්, ‘නොයෙක් ආකාර වූ ඍද්ධි ප්‍රාතිහාර්යයන් අනුභව කරන්නෙමි, එකෙකු වී බොහෝ දෙනෙකු වන්නෙමි, බොහෝ දෙනෙකු වී එකෙකු වන්නෙමි, (නොයෙක් ආකාරයෙන්) පහළ වන්නෙමි, අතුරුදහන් වන්නෙමි, තාප්පයක් හෝ ප්‍රාකාරයක් හෝ පර්වතයක් හෝ හරහා බාධාවකින් තොරව අහසේ මෙන් ගමන් කරන්නෙමි, පොළොවෙහිද ජලයේ මෙන් කිමිදී මතුවන්නෙමි, ජලයෙහිද පොළොවෙහි මෙන් නොබිඳී ගමන් කරන්නෙමි, අහසෙහිද කුරුල්ලෙකු මෙන් පළඟ බැඳ ගමන් කරන්නෙමි, මෙබඳු මහත් බල ඇති, මෙබඳු මහත් ආනුභාව ඇති හිරු සඳු පවා අතින් පිරිමදිමි, ස්පර්ශ කරමි, බ්‍රහ්ම ලෝකයන් දක්වාද කයින් වශය පවත්වන්නෙමි’ යැයි, ඒ ඒ අවස්ථාවන්හිදී, ඒ ඒ ආයතනයන්හිදී, සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් කැමති වේ නම්, ‘පිරිසිදු වූ, මිනිස් කන ඉක්මවා ගිය, දිව්‍ය වූ ශ්‍රවණ ධාතුවෙන් දුර හෝ ළඟ ඇති දිව්‍ය වූද මනුෂ්‍ය වූද යන දෙවර්ගයේම ශබ්ද අසන්නෙමි’ යැයි, ඒ ඒ අවස්ථාවන්හිදී, ඒ ඒ ආයතනයන්හිදී, සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් කැමති වේ නම්, ‘අන් සත්වයන්ගේ, අන් පුද්ගලයන්ගේ සිතින් සිත අවබෝධ කරගන්නෙමි: රාග සහිත වූ සිත රාග සහිත සිත යැයි දැනගන්නෙමි, රාග රහිත වූ සිත රාග රහිත සිත යැයි දැනගන්නෙමි, ද්වේෂ සහිත වූ සිත ද්වේෂ සහිත සිත යැයි දැනගන්නෙමි, ද්වේෂ රහිත වූ සිත ද්වේෂ රහිත සිත යැයි දැනගන්නෙමි, මෝහ සහිත වූ සිත මෝහ සහිත සිත යැයි දැනගන්නෙමි, මෝහ රහිත වූ සිත මෝහ රහිත සිත යැයි දැනගන්නෙමි, හකුළුණු සිත හකුළුණු සිත යැයි දැනගන්නෙමි, විසිරුණු සිත විසිරුණු සිත යැයි දැනගන්නෙමි, මහාර්ගත සිත මහාර්ගත සිත යැයි දැනගන්නෙමි, අමහාර්ගත සිත අමහාර්ගත සිත යැයි දැනගන්නෙමි, සඋත්තර සිත සඋත්තර සිත යැයි දැනගන්නෙමි, අනුත්තර සිත අනුත්තර සිත යැයි දැනගන්නෙමි, සමාහිත සිත සමාහිත සිත යැයි දැනගන්නෙමි, අසමාහිත සිත අසමාහිත සිත යැයි දැනගන්නෙමි, විමුක්ත සිත විමුක්ත සිත යැයි දැනගන්නෙමි, අවිමුක්ත සිත අවිමුක්ත සිත යැයි දැනගන්නෙමි’ යැයි, ඒ ඒ අවස්ථාවන්හිදී, ඒ ඒ ආයතනයන්හිදී, සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් කැමති වේ නම්, ‘නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරන්නෙමි; එනම් – එක් ආත්ම භවයක්, දෙආත්ම භවයක්, තුන් ආත්ම භවයක්, සතර ආත්ම භවයක්, පස් ආත්ම භවයක්, දස ආත්ම භවයක්, විසි ආත්ම භවයක්, තිස් ආත්ම භවයක්, සතළිස් ආත්ම භවයක්, පනස් ආත්ම භවයක්, ආත්ම භව සියයක්, ආත්ම භව දහසක්, ආත්ම භව ලක්ෂයක්, නොයෙක් සංවට්ට කල්පයන්ද, නොයෙක් විවට්ට කල්පයන්ද, නොයෙක් සංවට්ට-විවට්ට කල්පයන්ද: ‘එහි මෙවන් නමකින්, මෙවන් ගෝත්‍රයකින්, මෙවන් වර්ණයකින්, මෙවන් ආහාරයකින්, මෙවන් සැප දුක් විඳිමින්, මෙවන් ආයුෂ සීමාවකින් යුතුව සිටියෙමි. එතැනින් චුත වී මෙතැන උපන්නෙමි; එහිද මෙවන් නමකින්, මෙවන් ගෝත්‍රයකින්, මෙවන් වර්ණයකින්, මෙවන් ආහාරයකින්, මෙවන් සැප දුක් විඳිමින්, මෙවන් ආයුෂ සීමාවකින් යුතුව සිටියෙමි. එතැනින් චුත වී මෙතැන උපන්නෙමි’ යැයි, මේ අයුරින් ස්වභාව සහිත වූ, විස්තර සහිත වූ නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරන්නෙමි’ යැයි, ඒ ඒ අවස්ථාවන්හිදී, ඒ ඒ ආයතනයන්හිදී, සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් කැමති වේ නම්, ‘පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය, දිව්‍ය චක්ෂුසින් සත්වයන් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, මනා වර්ණ ඇති, දුර්වර්ණ ඇති, සුගතිගාමී වූ, දුර්ගතිගාමී වූ අයුරු දකින්නෙමි, කර්මානුරූපව ගිය සත්වයන් දැනගන්නෙමි’ යැයි, ඒ ඒ අවස්ථාවන්හිදී, ඒ ඒ ආයතනයන්හිදී, සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.\n\nඔහු යම් හෙයකින් කැමති වේ නම්, ‘ආශ්‍රවයන් ක්ෂය වීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ භවයේදීම ස්වයංව අභිඥාවෙන් සාක්ෂාත් කොට උපසම්පදා වී වාසය කරන්නෙමි’ යැයි, ඒ ඒ අවස්ථාවන්හිදී, ඒ ඒ ආයතනයන්හිදී, සාක්ෂාත් කිරීමට සමත් භාවයට පැමිණෙයි.",
      "paliTitle": "Gāvīupamāsuttaṃ"
    },
    {
      "number": 36,
      "pali": "‘‘Paṭhamampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmi; dutiyampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmi; tatiyampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmi; catutthampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmi; ākāsānañcāyatanampāhaṃ, bhikkhave, nissāya āsavānaṃ khayaṃ vadāmi; viññāṇañcāyatanampāhaṃ, bhikkhave, nissāya āsavānaṃ khayaṃ vadāmi; ākiñcaññāyatanampāhaṃ, bhikkhave, nissāya āsavānaṃ khayaṃ vadāmi; nevasaññānāsaññāyatanampāhaṃ, bhikkhave, nissāya āsavānaṃ khayaṃ vadāmi; saññāvedayitanirodhampāhaṃ, bhikkhave, nissāya āsavānaṃ khayaṃ vadāmi. ‘‘‘Paṭhamampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. So yadeva tattha hoti rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So tehi dhammehi cittaṃ paṭivāpeti [patiṭṭhāpeti (syā.), paṭipādeti (ka.) ma. ni. 2.133 passitabbaṃ]. So tehi dhammehi cittaṃ paṭivāpetvā [patiṭṭhāpetvā (syā.), paṭipādetvā (ka.)] amatāya dhātuyā cittaṃ upasaṃharati – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti. No ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. ‘‘Seyyathāpi, bhikkhave, issāso vā issāsantevāsī vā tiṇapurisarūpake vā mattikāpuñje vā yoggaṃ karitvā, so aparena samayena dūrepātī ca hoti akkhaṇavedhī ca mahato ca kāyassa padāletā [padālitā (ka.) a. ni. 3.134; 4.181]; evamevaṃ kho, bhikkhave, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. So yadeva tattha hoti rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So tehi dhammehi cittaṃ paṭivāpeti. So tehi dhammehi cittaṃ paṭivāpetvā amatāya dhātuyā cittaṃ upasaṃharati – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti. No ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. ‘Paṭhamampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Dutiyampāhaṃ, bhikkhave, jhānaṃ nissāya…pe… tatiyampāhaṃ, bhikkhave, jhānaṃ nissāya… ‘catutthampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So yadeva tattha hoti rūpagataṃ vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So tehi dhammehi cittaṃ paṭivāpeti. So tehi dhammehi cittaṃ paṭivāpetvā amatāya dhātuyā cittaṃ upasaṃharati – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti. No ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. ‘‘Seyyathāpi, bhikkhave, issāso vā issāsantevāsī vā tiṇapurisarūpake vā mattikāpuñje vā yoggaṃ karitvā, so aparena samayena dūrepātī ca hoti akkhaṇavedhī ca mahato ca kāyassa padāletā; evamevaṃ kho, bhikkhave, bhikkhu sukhassa ca pahānā, dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So yadeva tattha hoti rūpagataṃ vedanāgataṃ…pe… anāvattidhammo tasmā lokā. ‘Catutthampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Ākāsānañcāyatanampāhaṃ, bhikkhave, jhānaṃ nissāya āsavānaṃ khayaṃ vadāmī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. So yadeva tattha hoti vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So tehi dhammehi cittaṃ paṭivāpeti. So tehi dhammehi cittaṃ paṭivāpetvā amatāya dhātuyā cittaṃ upasaṃharati – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti. No ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. ‘‘Seyyathāpi, bhikkhave, issāso vā issāsantevāsī vā tiṇapurisarūpake vā mattikāpuñje vā yoggaṃ karitvā, so aparena samayena dūrepātī ca hoti akkhaṇavedhī ca mahato ca kāyassa padāletā; evamevaṃ kho, bhikkhave, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. So yadeva tattha hoti vedanāgataṃ saññāgataṃ…pe… anāvattidhammo tasmā lokā. ‘Ākāsānañcāyatanampāhaṃ, bhikkhave, nissāya āsavānaṃ khayaṃ vadāmī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Viññāṇañcāyatanampāhaṃ, bhikkhave, nissāya…pe… ākiñcaññāyatanampāhaṃ, bhikkhave, nissāya āsavānaṃ khayaṃ vadāmī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Idha, bhikkhave, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. So yadeva tattha hoti vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So tehi dhammehi cittaṃ paṭivāpeti. So tehi dhammehi cittaṃ paṭivāpetvā amatāya dhātuyā cittaṃ upasaṃharati – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti. No ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. ‘‘Seyyathāpi, bhikkhave, issāso vā issāsantevāsī vā tiṇapurisarūpake vā mattikāpuñje vā yoggaṃ karitvā, so aparena samayena dūrepātī ca hoti akkhaṇavedhī ca mahato ca kāyassa padāletā; evamevaṃ kho, bhikkhave, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. So yadeva tattha hoti vedanāgataṃ saññāgataṃ saṅkhāragataṃ viññāṇagataṃ, te dhamme aniccato dukkhato rogato gaṇḍato sallato aghato ābādhato parato palokato suññato anattato samanupassati. So tehi dhammehi cittaṃ paṭivāpeti. So tehi dhammehi cittaṃ paṭivāpetvā amatāya dhātuyā cittaṃ upasaṃharati – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. So tattha ṭhito āsavānaṃ khayaṃ pāpuṇāti. No ce āsavānaṃ khayaṃ pāpuṇāti, teneva dhammarāgena tāya dhammanandiyā pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti tattha parinibbāyī anāvattidhammo tasmā lokā. ‘Ākiñcaññāyatanampāhaṃ, nissāya āsavānaṃ khayaṃ vadāmī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘Iti kho, bhikkhave, yāvatā saññāsamāpatti tāvatā aññāpaṭivedho. Yāni ca kho imāni, bhikkhave, nissāya dve āyatanāni – nevasaññānāsaññāyatanasamāpatti ca saññāvedayitanirodho ca, jhāyīhete, bhikkhave, samāpattikusalehi samāpattivuṭṭhānakusalehi samāpajjitvā vuṭṭhahitvā sammā akkhātabbānīti vadāmī’’ti. Pañcamaṃ.",
      "english": "Bhikkhus, I declare the destruction of the taints by relying on the first jhana; Bhikkhus, I declare the destruction of the taints by relying on the second jhana; Bhikkhus, I declare the destruction of the taints by relying on the third jhana; Bhikkhus, I declare the destruction of the taints by relying on the fourth jhana; Bhikkhus, I declare the destruction of the taints by relying on the sphere of infinite space; Bhikkhus, I declare the destruction of the taints by relying on the sphere of infinite consciousness; Bhikkhus, I declare the destruction of the taints by relying on the sphere of nothingness; Bhikkhus, I declare the destruction of the taints by relying on the sphere of neither perception nor non-perception; Bhikkhus, I declare the destruction of the taints by relying on the cessation of perception and feeling. This is what was stated: \"Bhikkhus, I declare the destruction of the taints by relying on the first jhana.\" With reference to what was this said? Here, bhikkhus, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, with thought and examination, born of seclusion, filled with rapture and happiness, enters and dwells in the first jhana. Whatever exists there pertaining to form, feeling, perception, mental formations, or consciousness, he regards these phenomena as impermanent, as suffering, as a disease, as a boil, as a dart, as misery, as an affliction, as alien, as disintegrating, as empty, as non-self. He turns his mind away from these phenomena. Having turned his mind away from these phenomena, he directs his mind to the Deathless Element, thinking: \"This is peaceful, this is sublime, namely, the stilling of all formations, the relinquishing of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.\" Standing firm in that, he attains the destruction of the taints. If he does not attain the destruction of the taints, then by that very delight in the Dhamma and that joy in the Dhamma, with the utter destruction of the five lower fetters, he becomes an anāgāmī, one who arises spontaneously and attains final Nibbāna there, never to return from that world.\n\nJust as, bhikkhus, an archer or an archer's apprentice, having practiced on a straw figure or a mound of clay, after some time becomes a long-range shooter, a sharp-shooter, and one who can pierce a large target; in the same way, bhikkhus, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, with thought and examination, born of seclusion, filled with rapture and happiness, enters and dwells in the first jhana. Whatever exists there pertaining to form, feeling, perception, mental formations, or consciousness, he regards these phenomena as impermanent, as suffering, as a disease, as a boil, as a dart, as misery, as an affliction, as alien, as disintegrating, as empty, as non-self. He turns his mind away from these phenomena. Having turned his mind away from these phenomena, he directs his mind to the Deathless Element, thinking: \"This is peaceful, this is sublime, namely, the stilling of all formations, the relinquishing of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.\" Standing firm in that, he attains the destruction of the taints. If he does not attain the destruction of the taints, then by that very delight in the Dhamma and that joy in the Dhamma, with the utter destruction of the five lower fetters, he becomes an anāgāmī, one who arises spontaneously and attains final Nibbāna there, never to return from that world. That which was stated: \"Bhikkhus, I declare the destruction of the taints by relying on the first jhana,\" was said with reference to this.\n\nBhikkhus, I declare the destruction of the taints by relying on the second jhana; I declare the destruction of the taints by relying on the third jhana; and this is what was stated: \"Bhikkhus, I declare the destruction of the taints by relying on the fourth jhana.\" With reference to what was this said? Here, bhikkhus, a monk, by the abandonment of pleasure and pain, and by the prior disappearance of joy and sorrow, enters and dwells in the fourth jhana, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. Whatever exists there pertaining to form, feeling, perception, mental formations, or consciousness, he regards these phenomena as impermanent, as suffering, as a disease, as a boil, as a dart, as misery, as an affliction, as alien, as disintegrating, as empty, as non-self. He turns his mind away from these phenomena. Having turned his mind away from these phenomena, he directs his mind to the Deathless Element, thinking: \"This is peaceful, this is sublime, namely, the stilling of all formations, the relinquishing of all attachments, the destruction of craving, dispassion, cessation, Nibbāna.\" Standing firm in that, he attains the destruction of the taints. If he does not attain the destruction of the taints, then by that very delight in the Dhamma and that joy in the Dhamma, with the utter destruction of the five lower fetters, he becomes an anāgāmī, one who arises spontaneously and attains final Nibbāna there, never to return from that world.\n\nJust as, monks, an archer or an archer's apprentice, having practiced on straw-men or piles of clay, after some time becomes a long-distance shooter, a quick-shot, and one who pierces large bodies; in the same way, monks, a bhikkhu, by the abandoning of pleasure and the abandoning of pain, and by the prior passing away of joy and sorrow, enters and dwells in the fourth jhāna, which is neither painful nor pleasant, a state purified by equanimity and mindfulness. Whatever form, feeling, perception, mental formations, or consciousness exists there, he contemplates those phenomena as impermanent, unsatisfactory, a disease, a boil, a barb, an affliction, an illness, alien, disintegrating, empty, and non-self. He turns his mind away from these phenomena. Having turned his mind away from these phenomena, he directs his mind to the Deathless Element, thinking: 'This is peaceful, this is sublime: namely, the calming of all formations, the relinquishing of all clinging, the destruction of craving, dispassion, cessation, Nibbāna.' Standing there, he attains the destruction of the taints. If he does not attain the destruction of the taints, then by that same delight in Dhamma and that joy in Dhamma, through the destruction of the five lower fetters, he becomes one who arises spontaneously, there to attain final Nibbāna, never to return from that world. \"Monks, it is by relying on the fourth jhāna that I declare the destruction of the taints.\" Whatever was said thus, it was said with reference to this.\n\n\"Monks, it is by relying on the sphere of infinite space that I declare the destruction of the taints.\" This, too, was said. With reference to what was this said? Here, monks, a bhikkhu, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of multiplicity, thinking 'Space is infinite,' enters and dwells in the sphere of infinite space. Whatever feeling, perception, mental formations, or consciousness exists there, he contemplates those phenomena as impermanent, unsatisfactory, a disease, a boil, a barb, an affliction, an illness, alien, disintegrating, empty, and non-self. He turns his mind away from these phenomena. Having turned his mind away from these phenomena, he directs his mind to the Deathless Element, thinking: 'This is peaceful, this is sublime: namely, the calming of all formations, the relinquishing of all clinging, the destruction of craving, dispassion, cessation, Nibbāna.' Standing there, he attains the destruction of the taints. If he does not attain the destruction of the taints, then by that same delight in Dhamma and that joy in Dhamma, through the destruction of the five lower fetters, he becomes one who arises spontaneously, there to attain final Nibbāna, never to return from that world.\n\nJust as, monks, an archer or an archer's apprentice, having practiced on straw-men or piles of clay, after some time becomes a long-distance shooter, a quick-shot, and one who pierces large bodies; in the same way, monks, a bhikkhu, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of multiplicity, thinking 'Space is infinite,' enters and dwells in the sphere of infinite space. Whatever feeling, perception, mental formations, or consciousness exists there, he contemplates those phenomena as impermanent, unsatisfactory, a disease, a boil, a barb, an affliction, an illness, alien, disintegrating, empty, and non-self. He turns his mind away from these phenomena. Having turned his mind away from these phenomena, he directs his mind to the Deathless Element, thinking: 'This is peaceful, this is sublime: namely, the calming of all formations, the relinquishing of all clinging, the destruction of craving, dispassion, cessation, Nibbāna.' Standing there, he attains the destruction of the taints. If he does not attain the destruction of the taints, then by that same delight in Dhamma and that joy in Dhamma, through the destruction of the five lower fetters, he becomes one who arises spontaneously, there to attain final Nibbāna, never to return from that world. \"Monks, it is by relying on the sphere of infinite space that I declare the destruction of the taints.\" Whatever was said thus, it was said with reference to this.\n\n\"Monks, it is by relying on the sphere of infinite consciousness that I declare the destruction of the taints; and monks, it is by relying on the sphere of nothingness that I declare the destruction of the taints.\" This, too, was said. With reference to what was this said? Here, monks, a bhikkhu, by completely transcending the sphere of infinite consciousness, thinking 'There is nothing,' enters and dwells in the sphere of nothingness. Whatever feeling, perception, mental formations, or consciousness exists there, he contemplates those phenomena as impermanent, unsatisfactory, a disease, a boil, a barb, an affliction, an illness, alien, disintegrating, empty, and non-self. He turns his mind away from these phenomena. Having turned his mind away from these phenomena, he directs his mind to the Deathless Element, thinking: 'This is peaceful, this is sublime: namely, the calming of all formations, the relinquishing of all clinging, the destruction of craving, dispassion, cessation, Nibbāna.' Standing there, he attains the destruction of the taints. If he does not attain the destruction of the taints, then by that same delight in Dhamma and that joy in Dhamma, through the destruction of the five lower fetters, he becomes one who arises spontaneously, there to attain final Nibbāna, never to return from that world.\n\nJust as, monks, an archer or an archer's apprentice, having practiced on straw-men or piles of clay, after some time becomes a long-distance shooter, a quick-shot, and one who pierces large bodies; in the same way, monks, a bhikkhu, by completely transcending the sphere of infinite consciousness, thinking 'There is nothing,' enters and dwells in the sphere of nothingness. Whatever feeling, perception, mental formations, or consciousness exists there, he contemplates those phenomena as impermanent, unsatisfactory, a disease, a boil, a barb, an affliction, an illness, alien, disintegrating, empty, and non-self. He turns his mind away from these phenomena. Having turned his mind away from these phenomena, he directs his mind to the Deathless Element, thinking: 'This is peaceful, this is sublime: namely, the calming of all formations, the relinquishing of all clinging, the destruction of craving, dispassion, cessation, Nibbāna.' Standing there, he attains the destruction of the taints. If he does not attain the destruction of the taints, then by that same delight in Dhamma and that joy in Dhamma, through the destruction of the five lower fetters, he becomes one who arises spontaneously, there to attain final Nibbāna, never to return from that world.\n\nRegarding what was said, \"I declare the destruction of the taints by relying upon the Sphere of Nothingness\" – this (discourse) was spoken with reference to that. Thus, monks, the extent to which there is attainment of perception, to that extent there is penetration of ultimate knowledge. And these two spheres, monks — the attainment of the Sphere of Neither-Perception-Nor-Non-Perception and the Cessation of Perception and Feeling — I say that these are to be rightly explained by those meditators, monks, who, having entered into these attainments and emerged from them, are skilled in attainments and skilled in emerging from attainments.",
      "sinhala": "මහණෙනි, මම පළමු ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. මහණෙනි, මම දෙවෙනි ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. මහණෙනි, මම තුන්වෙනි ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. මහණෙනි, මම සතරවෙනි ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. මහණෙනි, මම ආකාසානඤ්චායතනය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. මහණෙනි, මම විඤ්ඤාණඤ්චායතනය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. මහණෙනි, මම ආකිංචඤ්ඤායතනය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. මහණෙනි, මම නේවසඤ්ඤානාසඤ්ඤායතනය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. මහණෙනි, මම සඤ්ඤා-වේදයිත නිරෝධය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි.\n\n\"මහණෙනි, මම පළමු ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි\" යැයි යමක් කියන ලද්දේ ද, ඒ මෙය කුමක් අරමුණු කොටගෙන කියන ලද්දේ ද? මහණෙනි, මෙහි භි​*ක්‍ෂූ*න් වහන්සේ කාමයන්ගෙන් සැබවින්ම වෙන්ව, අකුසල ධර්මයන්ගෙන් සැබවින්ම වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට එළඹ වාසය කරයි. එහි යම් රූපයට අයත් දේ, වේදනාවට අයත් දේ, සංඥාවට අයත් දේ, සංස්කාරයන්ට අයත් දේ, විඤ්ඤාණයට අයත් දේ වේ ද, උන්වහන්සේ ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, උපද්‍රවයක් වශයෙන්, ව්‍යාධියක් වශයෙන්, අනුන් සතු දෙයක් වශයෙන්, විනාශවනසුලු දෙයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවා ගනී. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවාගෙන, \"සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු උපධීන් අත්හැරීම, තණ්හා​*ක්‍ෂය*, විරාගය, නිරෝධය, නිබ්බානය\" යනු මෙය ශාන්තයි, මෙය ප්‍රණීතයි යි සිතමින් අමෘත ධාතුව වෙත සිත යොමු කරයි. උන්වහන්සේ එහි පිහිටා ආශ්‍රව​*ක්‍ෂය* වීම ලබයි. යම් හෙයකින් ආශ්‍රව​*ක්‍ෂය* වීම නොලබයි නම්, ධර්මය කෙරෙහි ඇති ඒ රාගය හා ධර්මය කෙරෙහි ඇති ඒ ප්‍රීතිය නිසා, පංච ඕරම්භාගීය සංයෝජන​*ක්‍ෂය* කිරීමෙන් උන්වහන්සේ ඕපපාතිකව උපදී, එතැනම පිරිනිවන් පාන, ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාව ඇත්තෙක් වෙයි.\n\nමහණෙනි, යම් සේ දුනුවායෙක් හෝ දුනුවායකුගේ ශිෂ්‍යයෙක් හෝ තණකොළ මිනිස් රූපයක හෝ මැටි ගොඩක පුහුණුව ලබා, පසුව දුරට විදින්නෙක් ද වෙයි, *ක්‍ෂණ*යක් ඇතුළත ඉලක්කය විදින්නෙක් ද වෙයි, මහත් සිරුරක් විද භින්න කරන්නෙක් ද වෙයි ද; එපරිද්දෙන්ම මහණෙනි, භි​*ක්‍ෂූ*න් වහන්සේ කාමයන්ගෙන් සැබවින්ම වෙන්ව, අකුසල ධර්මයන්ගෙන් සැබවින්ම වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට එළඹ වාසය කරයි. එහි යම් රූපයට අයත් දේ, වේදනාවට අයත් දේ, සංඥාවට අයත් දේ, සංස්කාරයන්ට අයත් දේ, විඤ්ඤාණයට අයත් දේ වේ ද, උන්වහන්සේ ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, උපද්‍රවයක් වශයෙන්, ව්‍යාධියක් වශයෙන්, අනුන් සතු දෙයක් වශයෙන්, විනාශවනසුලු දෙයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවා ගනී. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවාගෙන, \"සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු උපධීන් අත්හැරීම, තණ්හා​*ක්‍ෂය*, විරාගය, නිරෝධය, නිබ්බානය\" යනු මෙය ශාන්තයි, මෙය ප්‍රණීතයි යි සිතමින් අමෘත ධාතුව වෙත සිත යොමු කරයි. උන්වහන්සේ එහි පිහිටා ආශ්‍රව​*ක්‍ෂය* වීම ලබයි. යම් හෙයකින් ආශ්‍රව​*ක්‍ෂය* වීම නොලබයි නම්, ධර්මය කෙරෙහි ඇති ඒ රාගය හා ධර්මය කෙරෙහි ඇති ඒ ප්‍රීතිය නිසා, පංච ඕරම්භාගීය සංයෝජන​*ක්‍ෂය* කිරීමෙන් උන්වහන්සේ ඕපපාතිකව උපදී, එතැනම පිරිනිවන් පාන, ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාව ඇත්තෙක් වෙයි. \"මහණෙනි, මම පළමු ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි\" යැයි යමක් කියන ලද්දේ ද, ඒ මෙය අරමුණු කොටගෙන කියන ලද්දේ ය.\n\nමහණෙනි, මම දෙවෙනි ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. \"මහණෙනි, මම දෙවෙනි ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි\" යැයි යමක් කියන ලද්දේ ද, ඒ මෙය කුමක් අරමුණු කොටගෙන කියන ලද්දේ ද? මහණෙනි, මෙහි භි​*ක්‍ෂූ*න් වහන්සේ විතර්ක විචාරයන් සංසිඳවීමෙන්, අධ්‍යාත්මයෙහි පැහැදීම ඇති, සිතේ ඒකාග්‍රතාවය ඇති, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති දෙවෙනි ධ්‍යානයට එළඹ වාසය කරයි. එහි යම් රූපයට අයත් දේ, වේදනාවට අයත් දේ, සංඥාවට අයත් දේ, සංස්කාරයන්ට අයත් දේ, විඤ්ඤාණයට අයත් දේ වේ ද, උන්වහන්සේ ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, උපද්‍රවයක් වශයෙන්, ව්‍යාධියක් වශයෙන්, අනුන් සතු දෙයක් වශයෙන්, විනාශවනසුලු දෙයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවා ගනී. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවාගෙන, \"සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු උපධීන් අත්හැරීම, තණ්හා​*ක්‍ෂය*, විරාගය, නිරෝධය, නිබ්බානය\" යනු මෙය ශාන්තයි, මෙය ප්‍රණීතයි යි සිතමින් අමෘත ධාතුව වෙත සිත යොමු කරයි. උන්වහන්සේ එහි පිහිටා ආශ්‍රව​*ක්‍ෂය* වීම ලබයි. යම් හෙයකින් ආශ්‍රව​*ක්‍ෂය* වීම නොලබයි නම්, ධර්මය කෙරෙහි ඇති ඒ රාගය හා ධර්මය කෙරෙහි ඇති ඒ ප්‍රීතිය නිසා, පංච ඕරම්භාගීය සංයෝජන​*ක්‍ෂය* කිරීමෙන් උන්වහන්සේ ඕපපාතිකව උපදී, එතැනම පිරිනිවන් පාන, ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාව ඇත්තෙක් වෙයි.\n\nමහණෙනි, මම තුන්වෙනි ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි. \"මහණෙනි, මම තුන්වෙනි ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි\" යැයි යමක් කියන ලද්දේ ද, ඒ මෙය කුමක් අරමුණු කොටගෙන කියන ලද්දේ ද? මහණෙනි, මෙහි භි​*ක්‍ෂූ*න් වහන්සේ ප්‍රීතියද නොපැවතීමෙන්, උපේක්‍ෂාවෙන් වාසය කරමින්, සිහි ඇතිව, මනා නුවණින් යුක්තව, කයින් සැපය අත්විඳිමින්, ආර්යයෝ යම් ධ්‍යානයක් \"උපේක්‍ෂා සහිතයි, සිහි සහිතයි, සැප විහරණයක් ඇති\" යැයි කියත් ද, ඒ තුන්වෙනි ධ්‍යානයට එළඹ වාසය කරයි. එහි යම් රූපයට අයත් දේ, වේදනාවට අයත් දේ, සංඥාවට අයත් දේ, සංස්කාරයන්ට අයත් දේ, විඤ්ඤාණයට අයත් දේ වේ ද, උන්වහන්සේ ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, උපද්‍රවයක් වශයෙන්, ව්‍යාධියක් වශයෙන්, අනුන් සතු දෙයක් වශයෙන්, විනාශවනසුලු දෙයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවා ගනී. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවාගෙන, \"සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු උපධීන් අත්හැරීම, තණ්හා​*ක්‍ෂය*, විරාගය, නිරෝධය, නිබ්බානය\" යනු මෙය ශාන්තයි, මෙය ප්‍රණීතයි යි සිතමින් අමෘත ධාතුව වෙත සිත යොමු කරයි. උන්වහන්සේ එහි පිහිටා ආශ්‍රව​*ක්‍ෂය* වීම ලබයි. යම් හෙයකින් ආශ්‍රව​*ක්‍ෂය* වීම නොලබයි නම්, ධර්මය කෙරෙහි ඇති ඒ රාගය හා ධර්මය කෙරෙහි ඇති ඒ ප්‍රීතිය නිසා, පංච ඕරම්භාගීය සංයෝජන​*ක්‍ෂය* කිරීමෙන් උන්වහන්සේ ඕපපාතිකව උපදී, එතැනම පිරිනිවන් පාන, ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාව ඇත්තෙක් වෙයි.\n\n\"මහණෙනි, මම සතරවෙනි ධ්‍යානය ඇසුරු කොටගෙන ආශ්‍රව​*ක්‍ෂය* වීම කියමි\" යැයි යමක් කියන ලද්දේ ද, ඒ මෙය කුමක් අරමුණු කොටගෙන කියන ලද්දේ ද? මහණෙනි, මෙහි භි​*ක්‍ෂූ*න් වහන්සේ සැපයද දුකයද ප්‍රහාණය කිරීමෙන්, කලින්ම සෝමනස්ස-දෝමනස්සයන්ගේ අස්තංගමනය (නැතිවීම) හේතුවෙන්, දුක් ද නොවූ, සැප ද නොවූ, උපේක්‍ෂා*සතිපාරිශුද්ධිය* ඇති සතරවෙනි ධ්‍යානයට එළඹ වාසය කරයි. එහි යම් රූපයට අයත් දේ, වේදනාවට අයත් දේ, සංඥාවට අයත් දේ, සංස්කාරයන්ට අයත් දේ, විඤ්ඤාණයට අයත් දේ වේ ද, උන්වහන්සේ ඒ ධර්මයන් අනිත්‍ය වශයෙන්, දුක් වශයෙන්, රෝගයක් වශයෙන්, ගෙඩියක් වශයෙන්, හුලක් වශයෙන්, උපද්‍රවයක් වශයෙන්, ව්‍යාධියක් වශයෙන්, අනුන් සතු දෙයක් වශයෙන්, විනාශවනසුලු දෙයක් වශයෙන්, ශූන්‍ය වශයෙන්, අනාත්ම වශයෙන් මෙනෙහි කරයි. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවා ගනී. උන්වහන්සේ ඒ ධර්මයන්ගෙන් සිත මුදවාගෙන, \"සියලු සංස්කාරයන්ගේ සංසිඳීම, සියලු උපධීන් අත්හැරීම, තණ්හා​*ක්‍ෂය*, විරාගය, නිරෝධය, නිබ්බානය\" යනු මෙය ශාන්තයි, මෙය ප්‍රණීතයි යි සිතමින් අමෘත ධාතුව වෙත සිත යොමු කරයි. උන්වහන්සේ එහි පිහිටා ආශ්‍රව​*ක්‍ෂය* වීම ලබයි. යම් හෙයකින් ආශ්‍රව​*ක්‍ෂය* වීම නොලබයි නම්, ධර්මය කෙරෙහි ඇති ඒ රාගය හා ධර්මය කෙරෙහි ඇති ඒ ප්‍රීතිය නිසා, පංච ඕරම්භාගීය සංයෝජන​*ක්‍ෂය* කිරීමෙන් උන්වහන්සේ ඕපපාතිකව උපදී, එතැනම පිරිනිවන් පාන, ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාව ඇත්තෙක් වෙයි.\n\nමහණෙනි, යම් සේ ඊතල විදින්නෙක් හෝ ඊතල විදින්නෙකුගේ ශිෂ්‍යයෙක් හෝ තණකොළ පුරුෂ රූපයක් මත හෝ මැටි ගොඩක් මත පුරුදු පුහුණු වී, පසුව ඈතට විදිනසුලු ද, ක්ෂණයකින් විදිනසුලු ද, මහත් ශරීරයක් බිඳින්නෙකු ද වන්නේ ද, එසෙයින් ම මහණෙනි, භික්ෂුව, සැපය ද අත්හැර, දුක ද අත්හැර, කලින් ම සෝමනස්ස (ප්‍රීතිය) ද දෝමනස්ස (දුක) ද නැති වී යාමෙන් දුක් ද නො වන, සැප ද නො වන, උපේක්ෂාවෙන් යුත් සිහි නුවණින් පිරිසිදු වූ සිව්වැනි ධ්‍යානයට පැමිණ වාසය කරයි. එහි යම් රූපගත වූ, වේදනාගත වූ... (යනාදී) ධර්මයක් වේ ද, ඔහු ඒ ලෝකයෙන් (කිසි විටෙක) නො පෙරළෙන සුලු තත්වයට පත්වේ. \"මහණෙනි, මම සිව්වැනි ධ්‍යානය (නිශ්ශරණ කොට) ආශ්‍ර​වයන්ගේ ක්ෂය වීම කියමි\" යි යමක් කීවේ ද, එය මේ කරුණ අරභයා කී දෙයකි.\n\n\"මහණෙනි, මම අනන්ත ආකාශායතන ධ්‍යානය (නිශ්ශරණ කොට) ආශ්‍ර​වයන්ගේ ක්ෂය වීම කියමි\" යි යමක් කීවේ ද, එය මේ කරුණ අරභයා කී දෙයකි. එය කුමක් අරභයා කී දෙයක් ද? මහණෙනි, මෙහිලා භික්ෂුව, සියලු රූප සංඥාවන් ඉක්මවීමෙන්, ප්‍රතිඝ සංඥාවන් නැති වී යාමෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, \"ආකාශය අනන්තයි\" යි ආකාශානන්ත්‍යායතනයට පැමිණ වාසය කරයි. එහි යම් වේදනාගත වූ, සංඥාගත වූ, සංස්කාරගත වූ, විඤ්ඤාණගත වූ ධර්මයක් වේ ද, ඔහු ඒ ධර්මයන් අනිත්‍ය වශයෙන් ද, දුක් වශයෙන් ද, රෝගයක් වශයෙන් ද, ගෙඩියක් වශයෙන් ද, හුලක් වශයෙන් ද, බාධාවක් වශයෙන් ද, උපද්‍රවයක් වශයෙන් ද, අන්සතු දෙයක් වශයෙන් ද, දිරාපත් වන දෙයක් වශයෙන් ද, ශූන්‍ය වශයෙන් ද, අනාත්ම වශයෙන් ද මැනවින් විදර්ශනා කරයි. ඔහු ඒ ධර්මයන්ගෙන් සිත ඉවතට හරවයි. ඔහු ඒ ධර්මයන්ගෙන් සිත ඉවතට හරවා අමෘත ධාතුව වෙත සිත යොමු කරයි – \"සියලු සංස්කාරයන්ගේ සංසිඳීම යම් මේ ද, සියලු උපාධීන් අත්හැරීම යම් මේ ද, තණ්හාව ක්ෂය කිරීම යම් මේ ද, විරාගය යම් මේ ද, නිරෝධය යම් මේ ද, නිවන යම් මේ ද, මේ ශාන්ත ය, මේ ප්‍ර​ණීත ය\" යි. ඔහු එහි පිහිටා ආශ්‍ර​වයන්ගේ ක්ෂය වීම අත්පත් කරගනී. යම් හෙයකින් ඔහු ආශ්‍ර​වයන්ගේ ක්ෂය වීම අත්පත් කර නොගනී ද, එසේ නම් ඒ ධර්මය කෙරෙහි ඇති ඇල්මෙන් ද, ඒ ධර්මය කෙරෙහි ඇති සතුටින් ද, ඕරම්භාගීය සංයෝජන පහම ක්ෂය වීමෙන්, ඕපපාතිකව උපත ලබා, එහිම පිරිනිවන් පාන, ඒ ලෝකයෙන් කිසි විටෙක නො පෙරළෙන සුලු තත්වයට පත්වේ.\n\nමහණෙනි, යම් සේ ඊතල විදින්නෙක් හෝ ඊතල විදින්නෙකුගේ ශිෂ්‍යයෙක් හෝ තණකොළ පුරුෂ රූපයක් මත හෝ මැටි ගොඩක් මත පුරුදු පුහුණු වී, පසුව ඈතට විදිනසුලු ද, ක්ෂණයකින් විදිනසුලු ද, මහත් ශරීරයක් බිඳින්නෙකු ද වන්නේ ද, එසෙයින් ම මහණෙනි, භික්ෂුව, සියලු රූප සංඥාවන් ඉක්මවීමෙන්, ප්‍රතිඝ සංඥාවන් නැති වී යාමෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, \"ආකාශය අනන්තයි\" යි ආකාශානන්ත්‍යායතනයට පැමිණ වාසය කරයි. එහි යම් වේදනාගත වූ, සංඥාගත වූ... (යනාදී) ධර්මයක් වේ ද, ඔහු ඒ ලෝකයෙන් කිසි විටෙක නො පෙරළෙන සුලු තත්වයට පත්වේ. \"මහණෙනි, මම අනන්ත ආකාශායතනය (නිශ්ශරණ කොට) ආශ්‍ර​වයන්ගේ ක්ෂය වීම කියමි\" යි යමක් කීවේ ද, එය මේ කරුණ අරභයා කී දෙයකි.\n\n\"මහණෙනි, මම විඤ්ඤාණානන්ත්‍යායතනය (නිශ්ශරණ කොට) ආශ්‍ර​වයන්ගේ ක්ෂය වීම කියමි... මහණෙනි, මම ආකිඤ්චඤ්ඤායතනය (නිශ්ශරණ කොට) ආශ්‍ර​වයන්ගේ ක්ෂය වීම කියමි\" යි යමක් කීවේ ද, එය මේ කරුණ අරභයා කී දෙයකි. එය කුමක් අරභයා කී දෙයක් ද? මහණෙනි, මෙහිලා භික්ෂුව, සියලු විඤ්ඤාණානන්ත්‍යායතනයන් ඉක්මවා, \"කිසිවක් නැතැ\" යි ආකිඤ්චඤ්ඤායතනයට පැමිණ වාසය කරයි. එහි යම් වේදනාගත වූ, සංඥාගත වූ, සංස්කාරගත වූ, විඤ්ඤාණගත වූ ධර්මයක් වේ ද, ඔහු ඒ ධර්මයන් අනිත්‍ය වශයෙන් ද, දුක් වශයෙන් ද, රෝගයක් වශයෙන් ද, ගෙඩියක් වශයෙන් ද, හුලක් වශයෙන් ද, බාධාවක් වශයෙන් ද, උපද්‍රවයක් වශයෙන් ද, අන්සතු දෙයක් වශයෙන් ද, දිරාපත් වන දෙයක් වශයෙන් ද, ශූන්‍ය වශයෙන් ද, අනාත්ම වශයෙන් ද මැනවින් විදර්ශනා කරයි. ඔහු ඒ ධර්මයන්ගෙන් සිත ඉවතට හරවයි. ඔහු ඒ ධර්මයන්ගෙන් සිත ඉවතට හරවා අමෘත ධාතුව වෙත සිත යොමු කරයි – \"සියලු සංස්කාරයන්ගේ සංසිඳීම යම් මේ ද, සියලු උපාධීන් අත්හැරීම යම් මේ ද, තණ්හාව ක්ෂය කිරීම යම් මේ ද, විරාගය යම් මේ ද, නිරෝධය යම් මේ ද, නිවන යම් මේ ද, මේ ශාන්ත ය, මේ ප්‍ර​ණීත ය\" යි. ඔහු එහි පිහිටා ආශ්‍ර​වයන්ගේ ක්ෂය වීම අත්පත් කරගනී. යම් හෙයකින් ඔහු ආශ්‍ර​වයන්ගේ ක්ෂය වීම අත්පත් කර නොගනී ද, එසේ නම් ඒ ධර්මය කෙරෙහි ඇති ඇල්මෙන් ද, ඒ ධර්මය කෙරෙහි ඇති සතුටින් ද, ඕරම්භාගීය සංයෝජන පහම ක්ෂය වීමෙන්, ඕපපාතිකව උපත ලබා, එහිම පිරිනිවන් පාන, ඒ ලෝකයෙන් කිසි විටෙක නො පෙරළෙන සුලු තත්වයට පත්වේ.\n\nමහණෙනි, යම් සේ ඊතල විදින්නෙක් හෝ ඊතල විදින්නෙකුගේ ශිෂ්‍යයෙක් හෝ තණකොළ පුරුෂ රූපයක් මත හෝ මැටි ගොඩක් මත පුරුදු පුහුණු වී, පසුව ඈතට විදිනසුලු ද, ක්ෂණයකින් විදිනසුලු ද, මහත් ශරීරයක් බිඳින්නෙකු ද වන්නේ ද, එසෙයින් ම මහණෙනි, භික්ෂුව, සියලු විඤ්ඤාණානන්ත්‍යායතනයන් ඉක්මවා, \"කිසිවක් නැතැ\" යි ආකිඤ්චඤ්ඤායතනයට පැමිණ වාසය කරයි. එහි යම් වේදනාගත වූ, සංඥාගත වූ, සංස්කාරගත වූ, විඤ්ඤාණගත වූ ධර්මයක් වේ ද, ඔහු ඒ ධර්මයන් අනිත්‍ය වශයෙන් ද, දුක් වශයෙන් ද, රෝගයක් වශයෙන් ද, ගෙඩියක් වශයෙන් ද, හුලක් වශයෙන් ද, බාධාවක් වශයෙන් ද, උපද්‍රවයක් වශයෙන් ද, අන්සතු දෙයක් වශයෙන් ද, දිරාපත් වන දෙයක් වශයෙන් ද, ශූන්‍ය වශයෙන් ද, අනාත්ම වශයෙන් ද මැනවින් විදර්ශනා කරයි. ඔහු ඒ ධර්මයන්ගෙන් සිත ඉවතට හරවයි. ඔහු ඒ ධර්මයන්ගෙන් සිත ඉවතට හරවා අමෘත ධාතුව වෙත සිත යොමු කරයි – \"සියලු සංස්කාරයන්ගේ සංසිඳීම යම් මේ ද, සියලු උපාධීන් අත්හැරීම යම් මේ ද, තණ්හාව ක්ෂය කිරීම යම් මේ ද, විරාගය යම් මේ ද, නිරෝධය යම් මේ ද, නිවන යම් මේ ද, මේ ශාන්ත ය, මේ ප්‍ර​ණීත ය\" යි. ඔහු එහි පිහිටා ආශ්‍ර​වයන්ගේ ක්ෂය වීම අත්පත් කරගනී. යම් හෙයකින් ඔහු ආශ්‍ර​වයන්ගේ ක්ෂය වීම අත්පත් කර නොගනී ද, එසේ නම් ඒ ධර්මය කෙරෙහි ඇති ඇල්මෙන් ද, ඒ ධර්මය කෙරෙහි ඇති සතුටින් ද, ඕරම්භාගීය සංයෝජන පහම ක්ෂය වීමෙන්, ඕපපාතිකව උපත ලබා, එහිම පිරිනිවන් පාන, ඒ ලෝකයෙන් කිසි විටෙක නො පෙරළෙන සුලු තත්වයට පත්වේ.\n\n‘මම ආකිංචඤ්ඤායතනය (කිසිවක් නැත යන අරමුණ ඇති භාවය) පදනම් කරගෙන ආශ්‍රවයන්ගේ ක්ෂය වීම ප්‍රකාශ කරමි.’ යනු කුමක්ද, එය මෙය අරමුණු කොටගෙන කියන ලද්දකි. මහණෙනි, යම්තාක් සංඥා සමාපත්තියක් (සංඥා සහිත භාවනාවක්) ඇත්ද, ඒ තාක් කල්ම නුවණින් අවබෝධයද සිදු වේ. මහණෙනි, මෙලොවෙහි යම් මේ ආයතන දෙකක් (අරමුණු දෙකක්) ඇත්ද – එනම් නේවසංඥානාසංඥායතන සමාපත්තිය (සංඥාවක්ද නොවන, සංඥාවක් නැත්තේද නොවන භාවය) සහ සංඥා වේදයිත නිරෝධය (සංඥාව හා වේදනාව නිරුද්ධ කිරීම) – මහණෙනි, සමාපත්තීන්හි දක්ෂ වූ, සමාපත්තීන්ගෙන් නැගිටීමෙහි දක්ෂ වූ යෝගීන් විසින්, එම සමාපත්තිවලට සමවදින්නේ හා ඒවායින් නැගිටින්නේ, මේවා නිවැරදිව ප්‍රකාශ කළ යුතු යැයි මම කියමි.",
      "paliTitle": "Jhānasuttaṃ"
    },
    {
      "number": 37,
      "pali": "Ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Tatra kho āyasmā ānando bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato ānandassa paccassosuṃ. Āyasmā ānando etadavoca – ‘‘Acchariyaṃ, āvuso, abbhutaṃ, āvuso! Yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sambādhe okāsādhigamo anubuddho sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya. Tadeva nāma cakkhuṃ bhavissati te rūpā tañcāyatanaṃ no paṭisaṃvedissati [paṭisaṃvedayati (ka.)]. Tadeva nāma sotaṃ bhavissati te saddā tañcāyatanaṃ no paṭisaṃvedissati. Tadeva nāma ghānaṃ bhavissati te gandhā tañcāyatanaṃ no paṭisaṃvedissati. Sāva nāma jivhā bhavissati te rasā tañcāyatanaṃ no paṭisaṃvedissati. Sova nāma kāyo bhavissati te phoṭṭhabbā tañcāyatanaṃ no paṭisaṃvedissatī’’ti. Evaṃ vutte āyasmā udāyī āyasmantaṃ ānandaṃ etadavoca – ‘‘saññīmeva nu kho, āvuso ānanda, tadāyatanaṃ no paṭisaṃvedeti udāhu asaññī’’ti? ‘‘Saññīmeva kho, āvuso, tadāyatanaṃ no paṭisaṃvedeti, no asaññī’’ti. ‘‘Kiṃsaññī panāvuso, tadāyatanaṃ no paṭisaṃvedetī’’ti? ‘‘Idhāvuso, bhikkhu, sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Evaṃsaññīpi kho, āvuso, tadāyatanaṃ no paṭisaṃvedeti. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Evaṃsaññīpi kho, āvuso, tadāyatanaṃ no paṭisaṃvedeti. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Evaṃsaññīpi kho, āvuso, tadāyatanaṃ no paṭisaṃvedetī’’ti. ‘‘Ekamidāhaṃ, āvuso, samayaṃ sākete viharāmi añjanavane migadāye. Atha kho, āvuso, jaṭilavāsikā [jaṭilagāhiyā (sī. pī.), jaḍilabhāgikā (syā.)] bhikkhunī yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho, āvuso, jaṭilavāsikā bhikkhunī maṃ etadavoca – ‘yāyaṃ, bhante ānanda, samādhi na cābhinato na cāpanato na ca sasaṅkhāraniggayhavāritagato [sasaṅkhāraniggayhavāritavato (sī. syā. kaṃ. pī.), sasaṅkhāraniggayhavārivāvaṭo (ka.) a. ni. 3.102; 5.27; dī. ni. 3.355], vimuttattā ṭhito, ṭhitattā santusito, santusitattā no paritassati. Ayaṃ, bhante ānanda, samādhi kiṃphalo vutto bhagavatā’’’ti? ‘‘Evaṃ vutte, sohaṃ, āvuso, jaṭilavāsikaṃ bhikkhuniṃ etadavocaṃ – ‘yāyaṃ, bhagini, samādhi na cābhinato na cāpanato na ca sasaṅkhāraniggayhavāritagato, vimuttattā ṭhito, ṭhitattā santusito, santusitattā no paritassati. Ayaṃ, bhagini, samādhi aññāphalo vutto bhagavatā’ti. Evaṃsaññīpi kho, āvuso, tadāyatanaṃ no paṭisaṃvedetī’’ti. Chaṭṭhaṃ.",
      "english": "At one time, the Venerable Ānanda was staying at Ghositārāma in Kosambī. There, the Venerable Ānanda addressed the monastics, \"Friends, monastics!\" \"Friend!\" those monastics replied to the Venerable Ānanda. The Venerable Ānanda said this: \"It is wonderful, friends, it is amazing, friends! To what extent has the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, comprehended the attainment of freedom amidst confinement, for the purification of beings, for the overcoming of sorrow and lamentation, for the cessation of pain and despair, for the attainment of the path, for the realization of Nibbāna! Indeed, there will be the eye, but those forms will not be experienced by that sense-sphere. Indeed, there will be the ear, but those sounds will not be experienced by that sense-sphere. Indeed, there will be the nose, but those odors will not be experienced by that sense-sphere. Indeed, there will be the tongue, but those flavors will not be experienced by that sense-sphere. Indeed, there will be the body, but those tactile sensations will not be experienced by that sense-sphere.\"\n\nWhen this was said, the Venerable Udāyī said to the Venerable Ānanda, \"But surely, friend Ānanda, is it one who is percipient that does not experience that sense-sphere, or one who is non-percipient?\" \"Indeed, friend, it is one who is percipient that does not experience that sense-sphere, not one who is non-percipient.\" \"But what kind of percipient one, friend, does not experience that sense-sphere?\"\n\n\"Here, friend, a monastic, by completely transcending perceptions of forms, by the cessation of perceptions of sensory impingement, and by not attending to perceptions of diversity, enters and dwells in the sphere of infinite space, thinking, 'Space is infinite.' Even one percipient in this way, friend, does not experience that sense-sphere. Furthermore, friend, a monastic, by completely transcending the sphere of infinite space, enters and dwells in the sphere of infinite consciousness, thinking, 'Consciousness is infinite.' Even one percipient in this way, friend, does not experience that sense-sphere. Furthermore, friend, a monastic, by completely transcending the sphere of infinite consciousness, enters and dwells in the sphere of nothingness, thinking, 'There is nothing at all.' Even one percipient in this way, friend, does not experience that sense-sphere.\"\n\n\"At one time, friend, I was staying at Añjanavana in the Migadāya (Deer Park) near Sāketa. Then, friend, the bhikkhunī Jaṭilavāsikā approached me; having approached, she paid homage to me and stood to one side. Standing to one side, friend, the bhikkhunī Jaṭilavāsikā said to me, 'Venerable Ānanda, what fruit has the Blessed One declared for this concentration, which is not directed towards (rebirth), not drawn back from (this world), and not maintained by forceful mental suppression; which is established through liberation, content through being established, and untroubled through being content?'\"\n\n\"When this was said, friend, I told the bhikkhunī Jaṭilavāsikā, 'Sister, this concentration, which is not directed towards, not drawn back from, and not maintained by forceful mental suppression; which is established through liberation, content through being established, and untroubled through being content; this concentration, sister, has been declared by the Blessed One to have the fruit of final knowledge (arahatta).' Even one percipient in this way, friend, does not experience that sense-sphere.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කොසඹෑ නුවර ඝෝෂිතාරාමයේ වැඩසිටි සේක. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භි<b>ක්ෂූ</b>න් වහන්සේලා ඇමතූ සේක: \"ඇවැත්නි, භික්ෂූණි.\" එම භික්ෂූන් වහන්සේලා \"ඇවැත්නි\"යි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: \"ඇවැත්නි, ආ<b>ශ්ච</b>ර්යයකි, ඇවැත්නි, අ<b>ද්භූ</b>තයකි! ඒ <b>භාග්‍යවතුන්</b> වහන්සේ, සියල්ල දන්නා, සියල්ල දකින, අරහත් වූ, සම්මා සම්බුද්ධ වූ <b>උන්වහන්සේ</b> විසින්, සත්ත්වයන්ගේ පිරි<b>ශු</b>ද්ධිය පිණිස, ශෝකයෙන් හා වැළපීමෙන් ඉක්මවීම පිණිස, දුක්ඛ දෝමන<b>ස්ස</b>යන්ගේ නැතිවීම පිණිස, ඥානය (නිවන් මග) අ<b>ධිගම</b>නය පිණිස, නිර්වාණය සා<b>ක්ෂා</b>ත් කිරීම පිණිස, දුකෙන් තෙරපී පවතින මේ ලෝකයේදී පවා නිදහස් අවකාශයක් (විමුක්තියක්) අවබෝධ කරන ලදී. ඒ ඇසම පවතිනු ඇත, නමුත් ඒ රූපයන් හා ඒ ආයතනය අරමුණු නොකරනු ඇත. ඒ කනම පවතිනු ඇත, නමුත් ඒ ශබ්දයන් හා ඒ ආයතනය අරමුණු නොකරනු ඇත. ඒ නාසයම පවතිනු ඇත, නමුත් ඒ ගන්ධයන් හා ඒ ආයතනය අරමුණු නොකරනු ඇත. ඒ දිවම පවතිනු ඇත, නමුත් ඒ රසයන් හා ඒ ආයතනය අරමුණු නොකරනු ඇත. ඒ කයම පවතිනු ඇත, නමුත් ඒ ස්ප<b>ර්ශ</b>යන් හා ඒ ආයතනය අරමුණු නොකරනු ඇත.\"\n\nමෙසේ කී කල්හි ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය වදාළ සේක: \"ඇවැත් ආනන්ද, සඤ්<b>ඤී</b> (සංජානනය සහිත) අවස්ථාවේද ඒ ආයතනය අරමුණු නොකරන්නේ ද, එසේ නැතහොත් අසඤ්<b>ඤී</b> (සංජානනය රහිත) අවස්ථාවේද?\" \"ඇවැත්නි, සඤ්<b>ඤී</b> අවස්ථාවේදීම ඒ ආයතනය අරමුණු නොකරයි, අසඤ්<b>ඤී</b> අවස්ථාවක නොවේ.\" \"නමුත් ඇවැත්නි, කුමන සඤ්<b>ඤා</b>වකින් යුක්තව සිටින විටද ඒ ආයතනය අරමුණු නොකරන්නේ?\" \"ඇවැත්නි, මෙහි භි<b>ක්ෂූ</b>වක් සියලු රූප සං<b>ඥා</b>න් සම්පූර්ණයෙන් ඉක්මවා, ප<b>ටිඝ</b> සං<b>ඥා</b>න් නැති කර, නානත්ව සං<b>ඥා</b>න් මෙනෙහි නොකිරීමෙන්, 'ආකාශය අනන්තයි' යනුවෙන් ආකාසානංචායතනයට සමවද අ<b>ධිගම</b>නය කොට වාසය කරයි. මෙසේ වූ සං<b>ඥා</b>වකින් යුක්තව සිටින විටද, ඇවැත්නි, ඒ ආයතනය අරමුණු නොකරයි. තවද, ඇවැත්නි, භි<b>ක්ෂූ</b>වක් සියලු ආකාසානංචායතනය සම්පූර්ණයෙන් ඉක්මවා, 'විඤ්<b>ඤා</b>ණය අනන්තයි' යනුවෙන් විඤ්<b>ඤා</b>ණංචායතනයට සමවද අ<b>ධිගම</b>නය කොට වාසය කරයි. මෙසේ වූ සං<b>ඥා</b>වකින් යුක්තව සිටින විටද, ඇවැත්නි, ඒ ආයතනය අරමුණු නොකරයි. තවද, ඇවැත්නි, භි<b>ක්ෂූ</b>වක් සියලු විඤ්<b>ඤා</b>ණංචායතනය සම්පූර්ණයෙන් ඉක්මවා, 'කිසිවක් නැත' යනුවෙන් ආකිංචඤ්<b>ඤා</b>යතනයට සමවද අ<b>ධිගම</b>නය කොට වාසය කරයි. මෙසේ වූ සං<b>ඥා</b>වකින් යුක්තව සිටින විටද, ඇවැත්නි, ඒ ආයතනය අරමුණු නොකරයි.\"\n\n\"ඇවැත්නි, එක් සමයෙක මම සාකේත නුවර අ<b>ඤ්ජන</b>වන මුව උයනේ වාසය කළෙමි. එකල්හි, ඇවැත්නි, ජටිලවාසිකා නම් භි<b>ක්ෂූ</b>ණියක් මා සිටි තැනට පැමිණියාය; පැමිණ, මට වන්දනා කර, එකත්පසෙක සිටියාය. එකත්පසෙක සිටි ඇවැත්නි, ජටිලවාසිකා භි<b>ක්ෂූ</b>ණිය මට මෙය කීවාය: \"ආනන්ද ස්වාමීනි, යම් සමාධියක් (රාගය දෙසට) නැමුණක් නොව, (ද්වේෂය දෙසට) නොනැමුණක් ද, සසං<b>ඛා</b>රයෙන් (සිතිවිලි හා සංස්කාර මගින්) මෙහෙයවා, වළක්වා ගත්තක් නොවේ ද, විමුක්තියෙන් පිහිටා තිබේ ද, පිහිටා තිබීම නිසා සන්තු<b>ෂ්ට</b> වේ ද, සන්තු<b>ෂ්ට</b> වීම නිසා නොතැවේ ද, ආනන්ද ස්වාමීනි, මේ සමාධිය <b>භාග්‍යවතුන්</b> වහන්සේ විසින් කුමන ඵලයක් ඇතැයි වදාළ සේක් ද?\" \"මෙසේ කී කල්හි, ඇවැත්නි, මම ජටිලවාසිකා භි<b>ක්ෂූ</b>ණියට මෙය කීවෙමි: 'මහණියනි, යම් සමාධියක් (රාගය දෙසට) නැමුණක් නොව, (ද්වේෂය දෙසට) නොනැමුණක් ද, සසං<b>ඛා</b>රයෙන් (සිතිවිලි හා සංස්කාර මගින්) මෙහෙයවා, වළක්වා ගත්තක් නොවේ ද, විමුක්තියෙන් පිහිටා තිබේ ද, පිහිටා තිබීම නිසා සන්තු<b>ෂ්ට</b> වේ ද, සන්තු<b>ෂ්ට</b> වීම නිසා නොතැවේ ද, මහණියනි, මේ සමාධිය <b>භාග්‍යවතුන්</b> වහන්සේ විසින් 'අ<b>ඤ්ඤා</b>ඵල' (අරහත්වයට පත් වීම) ඵලයක් ඇතැයි වදාළ සේක.' මෙසේ වූ සං<b>ඥා</b>වකින් යුක්තව සිටින විටද, ඇවැත්නි, ඒ ආයතනය අරමුණු නොකරයි.\"",
      "paliTitle": "Ānandasuttaṃ"
    },
    {
      "number": 38,
      "pali": "Atha kho dve lokāyatikā brāhmaṇā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavatā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te brāhmaṇā bhagavantaṃ etadavocuṃ – ‘‘Pūraṇo, bho gotama, kassapo sabbaññū sabbadassāvī aparisesaṃ ñāṇadassanaṃ paṭijānāti – ‘carato ca me tiṭṭhato ca suttassa ca jāgarassa ca satataṃ samitaṃ ñāṇadassanaṃ paccupaṭṭhita’nti. So evamāha – ‘ahaṃ anantena ñāṇena anantaṃ lokaṃ jānaṃ passaṃ viharāmī’ti. Ayampi [ayampi hi (syā. ka.)], bho gotama, nigaṇṭho nāṭaputto sabbaññū sabbadassāvī aparisesaṃ ñāṇadassanaṃ paṭijānāti – ‘carato ca me tiṭṭhato ca suttassa ca jāgarassa ca satataṃ samitaṃ ñāṇadassanaṃ paccupaṭṭhita’nti. So [sopi (?)] evamāha – ‘ahaṃ anantena ñāṇena anantaṃ lokaṃ jānaṃ passaṃ viharāmī’ti. Imesaṃ, bho gotama, ubhinnaṃ ñāṇavādānaṃ ubhinnaṃ aññamaññaṃ vipaccanīkavādānaṃ ko saccaṃ āha ko musā’’ti? ‘‘Alaṃ, brāhmaṇā! Tiṭṭhatetaṃ – ‘imesaṃ ubhinnaṃ ñāṇavādānaṃ ubhinnaṃ aññamaññaṃ vipaccanīkavādānaṃ ko saccaṃ āha ko musā’ti. Dhammaṃ vo, brāhmaṇā, desessāmi, taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho te brāhmaṇā bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Seyyathāpi, brāhmaṇā, cattāro purisā catuddisā ṭhitā paramena javena ca samannāgatā paramena ca padavītihārena. Te evarūpena javena samannāgatā assu, seyyathāpi nāma daḷhadhammā [daḷhadhammo (sabbattha) a. ni. 4.45; ma. ni. 1.116 ca, taṃsaṃvaṇṇanāṭīkāyo ca moggallānabyākaraṇañca oloketabbā] dhanuggaho sikkhito katahattho katūpāsano lahukena asanena appakasirena tiriyaṃ tālacchāyaṃ [tālacchātiṃ (sī. syā. pī.), tālacchādiṃ (ka.) a. ni. 4.45; ma. ni. 1.161 passitabbaṃ] atipāteyya; evarūpena ca padavītihārena, seyyathāpi nāma puratthimā samuddā pacchimo samuddo atha puratthimāya disāya ṭhito puriso evaṃ vadeyya – ‘ahaṃ gamanena lokassa antaṃ pāpuṇissāmī’ti. So aññatreva asitapītakhāyitasāyitā aññatra uccārapassāvakammā aññatra niddākilamathapaṭivinodanā vassasatāyuko vassasatajīvī vassasataṃ gantvā appatvāva lokassa antaṃ antarā kālaṃ kareyya. Atha pacchimāya disāya…pe… atha uttarāya disāya… atha dakkhiṇāya disāya ṭhito puriso evaṃ vadeyya – ‘ahaṃ gamanena lokassa antaṃ pāpuṇissāmī’ti. So aññatreva asitapītakhāyitasāyitā aññatra uccārapassāvakammā aññatra niddākilamathapaṭivinodanā vassasatāyuko vassasatajīvī vassasataṃ gantvā appatvāva lokassa antaṃ antarā kālaṃ kareyya. Taṃ kissa hetu? Nāhaṃ, brāhmaṇā, evarūpāya sandhāvanikāya lokassa antaṃ ñāteyyaṃ daṭṭheyyaṃ patteyyanti vadāmi. Na cāhaṃ, brāhmaṇā, appatvāva lokassa antaṃ dukkhassa antakiriyaṃ vadāmi. ‘‘Pañcime, brāhmaṇā, kāmaguṇā ariyassa vinaye lokoti vuccati. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā; sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā; ime kho, brāhmaṇā, pañca kāmaguṇā ariyassa vinaye lokoti vuccati. ‘‘Idha, brāhmaṇā, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, brāhmaṇā, ‘bhikkhu lokassa antamāgamma, lokassa ante viharati’. Tamaññe evamāhaṃsu – ‘ayampi lokapariyāpanno, ayampi anissaṭo lokamhā’ti. Ahampi hi [ahampi (sī. pī.)], brāhmaṇā, evaṃ vadāmi – ‘ayampi lokapariyāpanno, ayampi anissaṭo lokamhā’’’ti. ‘‘Puna caparaṃ, brāhmaṇā, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ vuccati, brāhmaṇā, ‘bhikkhu lokassa antamāgamma lokassa ante viharati’. Tamaññe evamāhaṃsu – ‘ayampi lokapariyāpanno, ayampi anissaṭo lokamhā’ti. Ahampi hi, brāhmaṇā, evaṃ vadāmi – ‘ayampi lokapariyāpanno, ayampi anissaṭo lokamhā’’’ti. ‘‘Puna caparaṃ, brāhmaṇā, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Ayaṃ vuccati, brāhmaṇā, ‘bhikkhu lokassa antamāgamma lokassa ante viharati’. Tamaññe evamāhaṃsu – ‘ayampi lokapariyāpanno, ayampi anissaṭo lokamhā’ti. Ahampi hi, brāhmaṇā, evaṃ vadāmi – ‘ayampi lokapariyāpanno, ayampi anissaṭo lokamhā’’’ti. ‘‘Puna caparaṃ, brāhmaṇā, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati…pe… sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati…pe… sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Ayaṃ vuccati, brāhmaṇā, ‘bhikkhu lokassa antamāgamma lokassa ante viharati’. Tamaññe evamāhaṃsu – ‘ayampi lokapariyāpanno, ayampi anissaṭo lokamhā’ti. Ahampi hi, brāhmaṇā, evaṃ vadāmi – ‘ayampi lokapariyāpanno, ayampi anissaṭo lokamhā’’’ti. ‘‘Puna caparaṃ, brāhmaṇā, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati, brāhmaṇā, ‘bhikkhu lokassa antamāgamma lokassa ante viharati tiṇṇo loke visattika’’’nti. Sattamaṃ.",
      "english": "Then two logician brahmins approached the Blessed One. Having approached, they exchanged friendly greetings with the Blessed One. When this courteous and memorable talk was concluded, they sat down to one side. Seated to one side, those brahmins said to the Blessed One: \"Venerable Gotama, Pūraṇa Kassapa claims to be all-knowing and all-seeing, possessing complete knowledge and vision, [saying]: ‘Whether I am walking, standing, sleeping, or awake, knowledge and vision are constantly and uninterruptedly present to me.’ He thus declares: ‘I dwell knowing and seeing the infinite world with infinite knowledge.’ And Venerable Gotama, Nigaṇṭha Nāṭaputta also claims to be all-knowing and all-seeing, possessing complete knowledge and vision, [saying]: ‘Whether I am walking, standing, sleeping, or awake, knowledge and vision are constantly and uninterruptedly present to me.’ He thus declares: ‘I dwell knowing and seeing the infinite world with infinite knowledge.’ Of these two proponents of knowledge, Venerable Gotama, these two who hold conflicting views against each other, who speaks the truth and who speaks falsehood?\"\n\n\"Enough, brahmins! Let go of this question of ‘Of these two proponents of knowledge, these two who hold conflicting views against each other, who speaks the truth and who speaks falsehood.’ Brahmins, I shall teach you the Dhamma. Listen to it and pay careful attention; I will speak.\" \"Yes, Venerable Sir,\" those brahmins replied to the Blessed One. The Blessed One said this:\n\n\"Brahmins, just as if there were four men standing in the four directions, endowed with supreme speed and supreme stride. They might be endowed with such speed that an expert archer, well-trained, practiced, and experienced, could shoot a light arrow across the shadow of a palm tree with ease. And they might be endowed with such a stride that they could traverse from the eastern ocean to the western ocean. Then a man standing in the eastern direction might say: ‘I will reach the end of the world by walking.’ Without eating, drinking, chewing, or tasting, without defecating or urinating, without sleeping or dispelling fatigue, living for a hundred years, lasting a hundred years, he would travel for a hundred years and would die in the interim without having reached the end of the world. Similarly, a man standing in the western direction... in the northern direction... in the southern direction might say: ‘I will reach the end of the world by walking.’ Without eating, drinking, chewing, or tasting, without defecating or urinating, without sleeping or dispelling fatigue, living for a hundred years, lasting a hundred years, he would travel for a hundred years and would die in the interim without having reached the end of the world. Why is that? I do not say, brahmins, that the end of the world can be known, seen, or reached by such a journeying. Nor do I say, brahmins, that there is an end to suffering without having reached the end of the world.\"\n\n\"Brahmins, these five strands of sensual pleasure are called ‘the world’ in the Noble Discipline. Which five? Forms cognizable by the eye—agreeable, desirable, charming, endearing, associated with sensual desire, and inciting lust. Sounds cognizable by the ear... Odors cognizable by the nose... Flavors cognizable by the tongue... Tactile objects cognizable by the body—agreeable, desirable, charming, endearing, associated with sensual desire, and inciting lust. These five strands of sensual pleasure, brahmins, are called ‘the world’ in the Noble Discipline.\"\n\n\"Here, brahmins, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters upon and abides in the first jhana, which is accompanied by directed thought and evaluation, with rapture and pleasure born of seclusion. This, brahmins, is said of that bhikkhu: ‘He has come to the end of the world; he dwells at the end of the world.’ But others might say of him: ‘This one is still encompassed by the world; this one is not yet freed from the world.’ And I too, brahmins, say this: ‘This one is still encompassed by the world; this one is not yet freed from the world.’\"\n\n\"Furthermore, brahmins, with the subsiding of directed thought and evaluation... a bhikkhu enters upon and abides in the second jhana... the third jhana... the fourth jhana. This, brahmins, is said of that bhikkhu: ‘He has come to the end of the world; he dwells at the end of the world.’ But others might say of him: ‘This one is still encompassed by the world; this one is not yet freed from the world.’ And I too, brahmins, say this: ‘This one is still encompassed by the world; this one is not yet freed from the world.’\"\n\n\"Furthermore, brahmins, with the complete transcendence of perceptions of form, with the disappearance of perceptions of sensory impingement, with non-attention to perceptions of diversity, a bhikkhu enters upon and abides in the dimension of infinite space, perceiving ‘space is infinite.’ This, brahmins, is said of that bhikkhu: ‘He has come to the end of the world; he dwells at the end of the world.’\"\n\nOthers said of him, \"This one too is included in the world; this one too is not detached from the world.\" Indeed, I too, brahmins, say this: \"This one too is included in the world; this one too is not detached from the world.\"\n\nAnd further, brahmins, a monk, having completely transcended the dimension of infinite space, enters upon and dwells in the dimension of infinite consciousness, thinking 'consciousness is infinite'. Having completely transcended the dimension of infinite consciousness, he enters upon and dwells in the dimension of nothingness, thinking 'there is nothing'. Having completely transcended the dimension of nothingness, he enters upon and dwells in the dimension of neither perception nor non-perception. This, brahmins, is called 'a monk who has reached the world's end, dwells at the world's end'. Others said of him, \"This one too is included in the world; this one too is not detached from the world.\" Indeed, I too, brahmins, say this: \"This one too is included in the world; this one too is not detached from the world.\"\n\nAnd further, brahmins, a monk, having completely transcended the dimension of neither perception nor non-perception, enters upon and dwells in the cessation of perception and feeling. And having seen with wisdom, his defilements are utterly destroyed. This, brahmins, is called 'a monk who has reached the world's end, dwells at the world's end, having crossed over the entanglement in the world.'",
      "sinhala": "එවිට ලෝකය ගැන වාද කරන බ්‍රාහ්මණයෝ දෙදෙනෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා බහ නිමවා එකත්පස්ව වාඩි වූහ. එකත්පස්ව සිටි ඒ බ්‍රාහ්මණයෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: \"භවත් ගෞතමයින් වහන්ස, පූරණ කස්සප සියලු දේ දන්නා, සියලු දේ දක්නා බවත්, සර්වාකාරයෙන්ම නිරවශේෂ වූ ඥාන දර්ශනයක් තමන් සතු බවත් ප්‍රතිඥා දෙයි. එනම්: 'මා ඇවිදින විට, සිටගෙන සිටින විට, නිදා සිටින විට, පිබිද සිටින විට නොකඩවා, නිරන්තරයෙන්ම මට ඥාන දර්ශනය පිහිටා තිබේ' යැයි. ඔහු මෙසේද කියයි: 'මා අනන්ත ඥානයෙන් අනන්ත ලෝකය දැන දකිමින් වාසය කරමි' යැයි. භවත් ගෞතමයින් වහන්ස, මේ නිගණ්ඨ නාටපුත්තද සියලු දේ දන්නා, සියලු දේ දක්නා බවත්, සර්වාකාරයෙන්ම නිරවශේෂ වූ ඥාන දර්ශනයක් තමන් සතු බවත් ප්‍රතිඥා දෙයි. එනම්: 'මා ඇවිදින විට, සිටගෙන සිටින විට, නිදා සිටින විට, පිබිද සිටින විට නොකඩවා, නිරන්තරයෙන්ම මට ඥාන දර්ශනය පිහිටා තිබේ' යැයි. ඔහු මෙසේද කියයි: 'මා අනන්ත ඥානයෙන් අනන්ත ලෝකය දැන දකිමින් වාසය කරමි' යැයි. භවත් ගෞතමයින් වහන්ස, මේ ඥානවාදීන් දෙදෙනාගෙන්, එකිනෙකාට විරුද්ධ වාද දරන මේ දෙදෙනාගෙන් කවරෙක් සත්‍ය කීවේද, කවරෙක් බොරු කීවේද?\"\n\n\"බ්‍රාහ්මණයෙනි, මේ ඇති! මේ ගැන කතා කිරීම නවත්වන්න - 'මේ ඥානවාදීන් දෙදෙනාගෙන්, එකිනෙකාට විරුද්ධ වාද දරන මේ දෙදෙනාගෙන් කවරෙක් සත්‍ය කීවේද, කවරෙක් බොරු කීවේද' කියා. බ්‍රාහ්මණයෙනි, මම ඔබට ධර්මය දේශනා කරමි. එය ශ්‍රවණය කරන්න, මනා කොට මෙනෙහි කරන්න; මම දේශනා කරමි.\" \"එසේය, භවත් වහන්ස\" යැයි ඒ බ්‍රාහ්මණයෝ භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:\n\n\"බ්‍රාහ්මණයෙනි, යම් සේ පුරුෂයෝ සතර දෙනෙක් සිව් දිශාවෙහි සිටිමින්, අතිශයින්ම වේග සම්පන්නව හා අතිශයින්ම දිගු පියවරයන්ගෙන් යුක්තව සිටින්නෝ නම්; ඔවුන්ට මෙබඳු වේගයක් ඇත්තේය. එනම්, හොඳින් පුහුණු වූ, හුරු පුරුදු, හරිහැටි හී තැබීමට දක්ෂ දෘඪ ධර්ම දුනුවායෙකු හට පහසු ඊතලයකින් අසීරු බවක් නැතිව තල් රුකක සෙවනැල්ලක් හරහා විදීමට හැකි වන්නා සේය. මෙබඳු වූ දිගු පියවරයන් ඇත්තේය. එනම්, යම් සේ නැගෙනහිර මුහුදේ සිට බටහිර මුහුද දක්වා දුරක් ඇත්තාක් මෙන්. එවිට නැගෙනහිර දිශාවෙහි සිටි පුරුෂයෙක් මෙසේ කියන්නේය: 'මම ගමනින් ලෝකයේ කෙළවරට පැමිණෙමි' යැයි. ඔහු අනුභව කිරීමෙන්, පානය කිරීමෙන්, සපා කෑමෙන්, රස විඳීමෙන් තොරව, මලපහ කිරීමෙන්, මුත්‍රා කිරීමෙන් තොරව, නිදිමත හා වෙහෙස දුරු කිරීමෙන් තොරව, වසර සියයක් ආයුෂ ඇතිව, වසර සියයක් ජීවත් වී, වසර සියයක් ගමන් කර, ලෝකයේ කෙළවරට නොපැමිණම අතරමඟදී මිය යන්නේය. තවද, බටහිර දිශාවෙහි... (පෙ)... තවද, උතුරු දිශාවෙහි... තවද, දකුණු දිශාවෙහි සිටි පුරුෂයෙක් මෙසේ කියන්නේය: 'මම ගමනින් ලෝකයේ කෙළවරට පැමිණෙමි' යැයි. ඔහු අනුභව කිරීමෙන්, පානය කිරීමෙන්, සපා කෑමෙන්, රස විඳීමෙන් තොරව, මලපහ කිරීමෙන්, මුත්‍රා කිරීමෙන් තොරව, නිදිමත හා වෙහෙස දුරු කිරීමෙන් තොරව, වසර සියයක් ආයුෂ ඇතිව, වසර සියයක් ජීවත් වී, වසර සියයක් ගමන් කර, ලෝකයේ කෙළවරට නොපැමිණම අතරමඟදී මිය යන්නේය. ඒ කුමක් හෙයින්ද? බ්‍රාහ්මණයෙනි, මම මෙබඳු දුවන ගමනකින් ලෝකයේ කෙළවර දැනගත හැකි ය, දැකගත හැකි ය, පැමිණිය හැකි යැයි නොකියමි. බ්‍රාහ්මණයෙනි, ලෝකයේ කෙළවරට නොපැමිණම දුක කෙළවර කිරීමක් මම නොකියමි.\n\n\"බ්‍රාහ්මණයෙනි, ආර්ය විනයෙහි මේ පංච කාම ගුණ 'ලෝකය' යැයි කියනු ලැබේ. කවරේද ඒ පස? ඇසින් විඳිය හැකි රූප – ඒවා ඉෂ්ටය, කාන්තය, මනාපය, ප්‍රිය රූපය, කාමය හා බැඳුණේය, ඇලීමට හේතු වන්නාහ. කණින් විඳිය හැකි ශබ්ද... (පෙ)... නාසයෙන් විඳිය හැකි ගන්ධ... දිවෙන් විඳිය හැකි රස... කයින් විඳිය හැකි ස්පර්ශ – ඒවා ඉෂ්ටය, කාන්තය, මනාපය, ප්‍රිය රූපය, කාමය හා බැඳුණේය, ඇලීමට හේතු වන්නාහ. බ්‍රාහ්මණයෙනි, මේ පංච කාම ගුණම ආර්ය විනයෙහි 'ලෝකය' යැයි කියනු ලැබේ.\n\n\"බ්‍රාහ්මණයෙනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. බ්‍රාහ්මණයෙනි, මේ භික්ෂුව 'ලෝකයේ කෙළවරට පැමිණ, ලෝකයේ කෙළවරෙහි වාසය කරයි' යැයි කියනු ලැබේ. අන්‍යයෝ ඔහු ගැන මෙසේ කීහ: 'මේ භික්ෂුවද ලෝකය තුළටම අයත්ය, ලෝකයෙන් නිදහස් වී නැත' යැයි. බ්‍රාහ්මණයෙනි, මමද මෙසේ කියමි: 'මේ භික්ෂුවද ලෝකය තුළටම අයත්ය, ලෝකයෙන් නිදහස් වී නැත' යැයි.\n\n\"නැවතත්, බ්‍රාහ්මණයෙනි, භික්ෂුව විතර්ක-විචාරයන්ගේ සංසිඳීමෙන්... (පෙ)... දෙවන ධ්‍යානයට... තුන්වන ධ්‍යානයට... සතරවන ධ්‍යානයට පැමිණ වාසය කරයි. බ්‍රාහ්මණයෙනි, මේ භික්ෂුව 'ලෝකයේ කෙළවරට පැමිණ, ලෝකයේ කෙළවරෙහි වාසය කරයි' යැයි කියනු ලැබේ. අන්‍යයෝ ඔහු ගැන මෙසේ කීහ: 'මේ භික්ෂුවද ලෝකය තුළටම අයත්ය, ලෝකයෙන් නිදහස් වී නැත' යැයි. බ්‍රාහ්මණයෙනි, මමද මෙසේ කියමි: 'මේ භික්ෂුවද ලෝකය තුළටම අයත්ය, ලෝකයෙන් නිදහස් වී නැත' යැයි. නැවතත්, බ්‍රාහ්මණයෙනි, භික්ෂුව සියලු රූප සංඥාවන් සම්පූර්ණයෙන්ම ඉක්මවා, ප්‍රතිඝ සංඥාවන් නැති වී යාමෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන් 'අනන්ත වූ ආකාශය' යැයි සිතා ආකාශානන්ත්‍යායතනයට පැමිණ වාසය කරයි. බ්‍රාහ්මණයෙනි, මේ භික්ෂුව 'ලෝකයේ කෙළවරට පැමිණ, ලෝකයේ කෙළවරෙහි වාසය කරයි' යැයි කියනු ලැබේ.\n\nඅන්‍යයෝ ඔහුට මෙසේ කීහ: ‘මොහු ද ලෝකයට ඇතුළත් වූවෙකි, මොහු ද ලෝකයෙන් මිදුණේ නැත’ කියා. බ්‍රාහ්මණය, මම ද මෙසේ ම කියමි: ‘මොහු ද ලෝකයට ඇතුළත් වූවෙකි, මොහු ද ලෝකයෙන් මිදුණේ නැත’ කියා.\n\nබ්‍රාහ්මණය, තව ද භික්ෂුව මුළුමනින් ආකාශානන්ත්‍ය ආයතනය ඉක්මවා ‘විඤ්ඤාණය අනන්තයැයි’ යන විඤ්ඤාණානන්ත්‍ය ආයතනයට පැමිණ වාසය කරයි. මුළුමනින් විඤ්ඤාණානන්ත්‍ය ආයතනය ඉක්මවා ‘කිසිවක් නැතැයි’ යන ආකිඤ්චඤ්ඤායතනයට පැමිණ වාසය කරයි. මුළුමනින් ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වාසය කරයි. බ්‍රාහ්මණය, මේ භික්ෂුව ‘ලෝකයේ අන්තයට පැමිණ ලෝකයේ අන්තයේ වාසය කරයි’ යැයි කියනු ලැබේ. අන්‍යයෝ ඔහුට මෙසේ කීහ: ‘මොහු ද ලෝකයට ඇතුළත් වූවෙකි, මොහු ද ලෝකයෙන් මිදුණේ නැත’ කියා. බ්‍රාහ්මණය, මම ද මෙසේ ම කියමි: ‘මොහු ද ලෝකයට ඇතුළත් වූවෙකි, මොහු ද ලෝකයෙන් මිදුණේ නැත’ කියා.\n\nබ්‍රාහ්මණය, තව ද භික්ෂුව මුළුමනින් නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්මවා සඤ්ඤාවේදයිතනිරෝධයට පැමිණ වාසය කරයි. ප්‍රඥාවෙන් දැකීමෙන් ඔහුගේ ආශ්‍රවයන් ක්ෂය වී ඇත. බ්‍රාහ්මණය, මේ භික්ෂුව ‘ලෝකයේ අන්තයට පැමිණ ලෝකයේ අන්තයේ වාසය කරයි, ලෝකයේ තෘෂ්ණාව නම් දැලෙන් එතෙර වී ඇත’ යැයි කියනු ලැබේ.",
      "paliTitle": "Lokāyatikasuttaṃ"
    },
    {
      "number": 39,
      "pali": "‘‘Bhūtapubbaṃ, bhikkhave, devāsurasaṅgāmo samupabyūḷho [samupabbūḷho (sī. pī.)] ahosi. Tasmiṃ kho pana, bhikkhave, saṅgāme asurā jiniṃsu, devā parājayiṃsu [parājiyiṃsu (sī. syā. ka.)]. Parājitā ca, bhikkhave, devā [devā bhītā (pī.)] apayiṃsuyeva [apayaṃsveva (sī.)] uttarenābhimukhā, abhiyiṃsu [abhiyaṃsu (sī.)] asurā. Atha kho, bhikkhave, devānaṃ etadahosi – ‘abhiyanteva kho asurā. Yaṃnūna mayaṃ dutiyampi asurehi saṅgāmeyyāmā’ti. Dutiyampi kho, bhikkhave, devā asurehi saṅgāmesuṃ. Dutiyampi kho, bhikkhave, asurāva jiniṃsu, devā parājayiṃsu. Parājitā ca, bhikkhave, devā apayiṃsuyeva uttarenābhimukhā, abhiyiṃsu asurā’’. Atha kho, bhikkhave, devānaṃ etadahosi – ‘abhiyanteva kho asurā. Yaṃnūna mayaṃ tatiyampi asurehi saṅgāmeyyāmā’ti. Tatiyampi kho, bhikkhave, devā asurehi saṅgāmesuṃ. Tatiyampi kho, bhikkhave, asurāva jiniṃsu, devā parājayiṃsu. Parājitā ca, bhikkhave, devā bhītā devapuraṃyeva pavisiṃsu. Devapuragatānañca pana [puna (ka.)], bhikkhave, devānaṃ etadahosi – ‘bhīruttānagatena kho dāni mayaṃ etarahi attanā viharāma akaraṇīyā asurehī’ti. Asurānampi, bhikkhave, etadahosi – ‘bhīruttānagatena kho dāni devā etarahi attanā viharanti akaraṇīyā amhehī’ti. ‘‘Bhūtapubbaṃ, bhikkhave, devāsurasaṅgāmo samupabyūḷho ahosi. Tasmiṃ kho pana, bhikkhave, saṅgāme devā jiniṃsu, asurā parājayiṃsu. Parājitā ca, bhikkhave, asurā apayiṃsuyeva dakkhiṇenābhimukhā, abhiyiṃsu devā. Atha kho, bhikkhave, asurānaṃ etadahosi – ‘abhiyanteva kho devā. Yaṃnūna mayaṃ dutiyampi devehi saṅgāmeyyāmā’ti. Dutiyampi kho, bhikkhave, asurā devehi saṅgāmesuṃ. Dutiyampi kho, bhikkhave, devā jiniṃsu, asurā parājayiṃsu. Parājitā ca, bhikkhave, asurā apayiṃsuyeva dakkhiṇenābhimukhā, abhiyiṃsu devā’’. Atha kho, bhikkhave, asurānaṃ etadahosi – ‘abhiyanteva kho devā. Yaṃnūna mayaṃ tatiyampi devehi saṅgāmeyyāmā’ti. Tatiyampi kho, bhikkhave, asurā devehi saṅgāmesuṃ. Tatiyampi kho, bhikkhave, devā jiniṃsu, asurā parājayiṃsu. Parājitā ca, bhikkhave, asurā bhītā asurapuraṃyeva pavisiṃsu. Asurapuragatānañca pana, bhikkhave, asurānaṃ etadahosi – ‘bhīruttānagatena kho dāni mayaṃ etarahi attanā viharāma akaraṇīyā devehī’ti. Devānampi, bhikkhave, etadahosi – ‘bhīruttānagatena kho dāni asurā etarahi attanā viharanti akaraṇīyā amhehī’ti. ‘‘Evamevaṃ kho, bhikkhave, yasmiṃ samaye bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati, tasmiṃ, bhikkhave, samaye bhikkhussa evaṃ hoti – ‘bhīruttānagatena kho dānāhaṃ etarahi attanā viharāmi akaraṇīyo mārassā’ti. Mārassāpi, bhikkhave, pāpimato evaṃ hoti – ‘bhīruttānagatena kho dāni bhikkhu etarahi attanā viharati akaraṇīyo mayha’’’nti. ‘‘Yasmiṃ, bhikkhave, samaye bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati, tasmiṃ, bhikkhave, samaye bhikkhussa evaṃ hoti – ‘bhīruttānagatena kho dānāhaṃ etarahi attanā viharāmi akaraṇīyo mārassā’ti. Mārassāpi, bhikkhave, pāpimato evaṃ hoti – ‘bhīruttānagatena kho dāni bhikkhu etarahi attanā viharati, akaraṇīyo mayha’’’nti. ‘‘Yasmiṃ, bhikkhave, samaye bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Ayaṃ vuccati, bhikkhave, ‘bhikkhu antamakāsi māraṃ, apadaṃ vadhitvā māracakkhuṃ adassanaṃ gato pāpimato tiṇṇo loke visattika’’’nti. ‘‘Yasmiṃ, bhikkhave, samaye bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati… sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati… sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati… sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ayaṃ vuccati, bhikkhave, ‘bhikkhu antamakāsi māraṃ, apadaṃ vadhitvā māracakkhuṃ adassanaṃ gato pāpimato tiṇṇo loke visattika’’’nti. Aṭṭhamaṃ.",
      "english": "Formerly, bhikkhus, a battle array was set up between the devas and asuras. In that battle, bhikkhus, the asuras were victorious, and the devas were defeated. And the defeated devas, bhikkhus, fled northwards, while the asuras pursued them. Then, bhikkhus, it occurred to the devas: ‘The asuras are still pursuing us. Let us, by all means, fight the asuras a second time.’ A second time, bhikkhus, the devas fought the asuras. A second time, bhikkhus, the asuras were victorious, and the devas were defeated. And the defeated devas, bhikkhus, fled northwards, while the asuras pursued them. Then, bhikkhus, it occurred to the devas: ‘The asuras are still pursuing us. Let us, by all means, fight the asuras a third time.’ A third time, bhikkhus, the devas fought the asuras. A third time, bhikkhus, the asuras were victorious, and the devas were defeated. And the defeated devas, bhikkhus, frightened, retreated into their divine city. And to the devas who had entered their divine city, bhikkhus, it occurred: ‘Now we dwell, having retreated in fear, unable to be harmed by the asuras.’ And to the asuras, bhikkhus, it occurred: ‘Now the devas dwell, having retreated in fear, unable to be harmed by us.’\n\nFormerly, bhikkhus, a battle array was set up between the devas and asuras. In that battle, bhikkhus, the devas were victorious, and the asuras were defeated. And the defeated asuras, bhikkhus, fled southwards, while the devas pursued them. Then, bhikkhus, it occurred to the asuras: ‘The devas are still pursuing us. Let us, by all means, fight the devas a second time.’ A second time, bhikkhus, the asuras fought the devas. A second time, bhikkhus, the devas were victorious, and the asuras were defeated. And the defeated asuras, bhikkhus, fled southwards, while the devas pursued them. Then, bhikkhus, it occurred to the asuras: ‘The devas are still pursuing us. Let us, by all means, fight the devas a third time.’ A third time, bhikkhus, the asuras fought the devas. A third time, bhikkhus, the devas were victorious, and the asuras were defeated. And the defeated asuras, bhikkhus, frightened, retreated into their asura city. And to the asuras who had entered their asura city, bhikkhus, it occurred: ‘Now we dwell, having retreated in fear, unable to be harmed by the devas.’ And to the devas, bhikkhus, it occurred: ‘Now the asuras dwell, having retreated in fear, unable to be harmed by us.’\n\nIn the same way, bhikkhus, when a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters and remains in the first jhāṇa, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and pleasure, at that time, bhikkhus, it occurs to the bhikkhu: ‘Now I dwell, having retreated in fear, unable to be harmed by Māra.’ And to Māra the Evil One, bhikkhus, it occurs: ‘Now this bhikkhu dwells, having retreated in fear, unable to be harmed by me.’\n\nBhikkhus, when a bhikkhu, with the calming of initial and sustained application, enters and remains in the second jhāṇa; with the fading of rapture, he dwells equanimous, mindful and clearly comprehending, and experiences pleasure with the body, enters and remains in the third jhāṇa of which the noble ones declare: ‘He is equanimous, mindful, one who dwells happily’; with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, he enters and remains in the fourth jhāṇa, which is neither painful nor pleasurable and is purified by equanimity and mindfulness; at that time, bhikkhus, it occurs to the bhikkhu: ‘Now I dwell, having retreated in fear, unable to be harmed by Māra.’ And to Māra the Evil One, bhikkhus, it occurs: ‘Now this bhikkhu dwells, having retreated in fear, unable to be harmed by me.’\n\nBhikkhus, when a bhikkhu, with the complete transcendence of perceptions of form, with the disappearance of perceptions of sensory impingement, and with non-attention to perceptions of diversity, thinking ‘Space is infinite,’ enters and remains in the base of infinite space. This, bhikkhus, is called ‘a bhikkhu who has made an end for Māra, having struck down Māra’s footprint, gone beyond the sight of the Evil One, and crossed over the entanglement in the world.’\n\nBhikkhus, when a bhikkhu, having completely transcended the base of infinite space, thinking ‘Consciousness is infinite,’ enters and remains in the base of infinite consciousness; having completely transcended the base of infinite consciousness, thinking ‘There is nothing,’ enters and remains in the base of nothingness; having completely transcended the base of nothingness, enters and remains in the base of neither perception nor non-perception; and having completely transcended the base of neither perception nor non-perception, enters and remains in the cessation of perception and feeling, and seeing with wisdom, his defilements are utterly destroyed. This, bhikkhus, is called ‘a bhikkhu who has made an end for Māra, having struck down Māra’s footprint, gone beyond the sight of the Evil One, and crossed over the entanglement in the world.’",
      "sinhala": "භික්ෂූණි, පෙර කාලයක දෙව්–අසුර යුද්ධයක් ඇති විය. භික්ෂූණි, ඒ යුද්ධයේදී අසුරයෝ ජය ගත්හ, දෙවියෝ පරාජය වූහ. භික්ෂූණි, පරාජය වූ දෙවියෝ බියට පත්ව උතුරට මුහුණලාම පලා ගියහ. අසුරයෝ ඔවුන් ලුහුබැඳ ගියහ. භික්ෂූණි, එවිට දෙවියන්ට මෙසේ සිතුණි: ‘අසුරයෝ අප ලුහුබඳිති. අපි නැවත වරක් අසුරයන් සමඟ සටන් කරමු.’ භික්ෂූණි, දෙවියෝ දෙවෙනි වරටත් අසුරයන් සමඟ සටන් කළහ. භික්ෂූණි, දෙවෙනි වරටත් අසුරයෝම ජය ගත්හ, දෙවියෝ පරාජය වූහ. භික්ෂූණි, පරාජය වූ දෙවියෝ උතුරට මුහුණලාම පලා ගියහ, අසුරයෝ ඔවුන් ලුහුබැඳ ගියහ. භික්ෂූණි, එවිට දෙවියන්ට මෙසේ සිතුණි: ‘අසුරයෝ අප ලුහුබඳිති. අපි නැවත වරක් අසුරයන් සමඟ සටන් කරමු.’ භික්ෂූණි, දෙවියෝ තුන්වෙනි වරටත් අසුරයන් සමඟ සටන් කළහ. භික්ෂූණි, තුන්වෙනි වරටත් අසුරයෝම ජය ගත්හ, දෙවියෝ පරාජය වූහ. භික්ෂූණි, පරාජය වූ දෙවියෝ බියට පත්ව දෙව්පුරයටම පිවිසියහ. භික්ෂූණි, දෙව්පුරයට ගිය දෙවියන්ට මෙසේ සිතුණි: ‘දැන් අපි බියෙන් තැතිගෙන රැකවරණයට පත්ව සිටින්නෙමු. අසුරයන්ට අපගෙන් කළ හැකි කිසිවක් නැත.’ භික්ෂූණි, අසුරයන්ටත් මෙසේ සිතුණි: ‘දැන් දෙවියෝ බියෙන් තැතිගෙන රැකවරණයට පත්ව සිටිති. අපට ඔවුන්ගෙන් කළ හැකි කිසිවක් නැත.’\n\nභික්ෂූණි, පෙර කාලයක දෙව්–අසුර යුද්ධයක් ඇති විය. භික්ෂූණි, ඒ යුද්ධයේදී දෙවියෝ ජය ගත්හ, අසුරයෝ පරාජය වූහ. භික්ෂූණි, පරාජය වූ අසුරයෝ දකුණට මුහුණලාම පලා ගියහ. දෙවියෝ ඔවුන් ලුහුබැඳ ගියහ. භික්ෂූණි, එවිට අසුරයන්ට මෙසේ සිතුණි: ‘දෙවියෝ අප ලුහුබඳිති. අපි නැවත වරක් දෙවියන් සමඟ සටන් කරමු.’ භික්ෂූණි, අසුරයෝ දෙවෙනි වරටත් දෙවියන් සමඟ සටන් කළහ. භික්ෂූණි, දෙවෙනි වරටත් දෙවියෝම ජය ගත්හ, අසුරයෝ පරාජය වූහ. භික්ෂූණි, පරාජය වූ අසුරයෝ දකුණට මුහුණලාම පලා ගියහ, දෙවියෝ ඔවුන් ලුහුබැඳ ගියහ. භික්ෂූණි, එවිට අසුරයන්ට මෙසේ සිතුණි: ‘දෙවියෝ අප ලුහුබඳිති. අපි නැවත වරක් දෙවියන් සමඟ සටන් කරමු.’ භික්ෂූණි, අසුරයෝ තුන්වෙනි වරටත් දෙවියන් සමඟ සටන් කළහ. භික්ෂූණි, තුන්වෙනි වරටත් දෙවියෝම ජය ගත්හ, අසුරයෝ පරාජය වූහ. භික්ෂූණි, පරාජය වූ අසුරයෝ බියට පත්ව අසුරපුරයටම පිවිසියහ. භික්ෂූණි, අසුරපුරයට ගිය අසුරයන්ට මෙසේ සිතුණි: ‘දැන් අපි බියෙන් තැතිගෙන රැකවරණයට පත්ව සිටින්නෙමු. දෙවියන්ට අපගෙන් කළ හැකි කිසිවක් නැත.’ භික්ෂූණි, දෙවියන්ටත් මෙසේ සිතුණි: ‘දැන් අසුරයෝ බියෙන් තැතිගෙන රැකවරණයට පත්ව සිටිති. අපට ඔවුන්ගෙන් කළ හැකි කිසිවක් නැත.’\n\nභික්ෂූණි, එපරිද්දෙන්ම, යම් කලක භික්ෂුව කාමයන්ගෙන් වෙන්වද, අකුසල ධර්මයන්ගෙන් වෙන්වද, විතර්ක සහිත වූද, විචාර සහිත වූද, විවේකයෙන් හටගත් ප්‍රීති හා සුඛය ඇති ප‍්‍රථම ධ්‍යානයට පැමිණ වාසය කරයිද, භික්ෂූණි, ඒ කල භික්ෂුවට මෙසේ සිතේ: ‘දැන් මම බියෙන් තැතිගෙන රැකවරණයට පත්ව සිටිමි. මාරයාට මාගෙන් කළ හැකි කිසිවක් නැත’ කියා. භික්ෂූණි, පාපී මාරයාටත් මෙසේ සිතේ: ‘දැන් මේ භික්ෂුව බියෙන් තැතිගෙන රැකවරණයට පත්ව සිටියි. මට ඔහුගෙන් කළ හැකි කිසිවක් නැත’ කියා.\n\nභික්ෂූණි, යම් කලක භික්ෂුව විතර්ක විචාරයන්ගේ සංසිඳීමෙන්... දෙවෙනි ධ්‍යානයට... තෙවෙනි ධ්‍යානයට... සිවුවෙනි ධ්‍යානයට පැමිණ වාසය කරයිද, භික්ෂූණි, ඒ කල භික්ෂුවට මෙසේ සිතේ: ‘දැන් මම බියෙන් තැතිගෙන රැකවරණයට පත්ව සිටිමි. මාරයාට මාගෙන් කළ හැකි කිසිවක් නැත’ කියා. භික්ෂූණි, පාපී මාරයාටත් මෙසේ සිතේ: ‘දැන් මේ භික්ෂුව බියෙන් තැතිගෙන රැකවරණයට පත්ව සිටියි. මට ඔහුගෙන් කළ හැකි කිසිවක් නැත’ කියා.\n\nභික්ෂූණි, යම් කලක භික්ෂුව සියලු රූප සංඥාවන් ඉක්මවා, ප්‍රතිඝ සංඥාවන් අස්තයට යවා, නානත්ව සංඥාවන් මෙනෙහි නොකර, ‘ආකාශය අනන්තයි’ යනුවෙන් ආකාශානන්ත්‍යායතනයට පැමිණ වාසය කරයිද, භික්ෂූණි, මේ භික්ෂුව ‘මාරයාට අවසානයක් කළේය, මාරයාගේ පාදයන් කපා දමා, මාරයාගේ ඇසට නොපෙනී ගියේය, ලෝකයේ කෙලෙස් බන්ධනයන්ගෙන් එතෙර විය’ යනුවෙන් කියනු ලැබේ.\n\nභික්ෂූණි, යම් කලක භික්ෂුව සියලු ආකාශානන්ත්‍යායතනයන් ඉක්මවා, ‘විඤ්ඤාණය අනන්තයි’ යනුවෙන් විඤ්ඤාණානන්ත්‍යායතනයට පැමිණ වාසය කරයිද... සියලු විඤ්ඤාණානන්ත්‍යායතනයන් ඉක්මවා, ‘කිසිවක් නැත’ යනුවෙන් ආකිංචඤ්ඤායතනයට පැමිණ වාසය කරයිද... සියලු ආකිංචඤ්ඤායතනයන් ඉක්මවා, නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වාසය කරයිද... සියලු නේවසඤ්ඤානාසඤ්ඤායතනයන් ඉක්මවා, සංඥා වේදයිත නිරෝධයට පැමිණ වාසය කරයිද, ප්‍රඥාවෙන් දැක ඔහුගේ ආශ්‍රවයන් ක්ෂය වී ඇත්නම්, භික්ෂූණි, මේ භික්ෂුව ‘මාරයාට අවසානයක් කළේය, මාරයාගේ පාදයන් කපා දමා, මාරයාගේ ඇසට නොපෙනී ගියේය, ලෝකයේ කෙලෙස් බන්ධනයන්ගෙන් එතෙර විය’ යනුවෙන් කියනු ලැබේ.",
      "paliTitle": "Devāsurasaṅgāmasuttaṃ"
    },
    {
      "number": 40,
      "pali": "‘‘Yasmiṃ, bhikkhave, samaye āraññikassa nāgassa gocarapasutassa hatthīpi hatthiniyopi hatthikalabhāpi hatthicchāpāpi purato purato gantvā tiṇaggāni chindanti, tena, bhikkhave, āraññiko nāgo aṭṭīyati harāyati jigucchati. Yasmiṃ, bhikkhave, samaye āraññikassa nāgassa gocarapasutassa hatthīpi hatthiniyopi hatthikalabhāpi hatthicchāpāpi obhaggobhaggaṃ sākhābhaṅgaṃ khādanti, tena, bhikkhave, āraññiko nāgo aṭṭīyati harāyati jigucchati. Yasmiṃ, bhikkhave, samaye āraññikassa nāgassa ogāhaṃ otiṇṇassa hatthīpi hatthiniyopi hatthikalabhāpi hatthicchāpāpi purato purato gantvā soṇḍāya udakaṃ āloḷenti, tena, bhikkhave, āraññiko nāgo aṭṭīyati harāyati jigucchati. Yasmiṃ, bhikkhave, samaye āraññikassa nāgassa ogāhā uttiṇṇassa hatthiniyo kāyaṃ upanighaṃsantiyo gacchanti, tena, bhikkhave, āraññiko nāgo aṭṭīyati harāyati jigucchati. ‘‘Tasmiṃ, bhikkhave, samaye āraññikassa nāgassa evaṃ hoti – ‘ahaṃ kho etarahi ākiṇṇo viharāmi hatthīhi hatthinīhi hatthikalabhehi hatthicchāpehi. Chinnaggāni ceva tiṇāni khādāmi, obhaggobhaggañca me sākhābhaṅgaṃ khādanti [khāditaṃ (syā. ka.) mahāva. 467 passitabbaṃ], āvilāni ca pānīyāni pivāmi, ogāhā ca [ogāhāpi ca (syā. ka.) mahāva. 467 passitabbaṃ] me uttiṇṇassa hatthiniyo kāyaṃ upanighaṃsantiyo gacchanti. Yaṃnūnāhaṃ eko gaṇasmā vūpakaṭṭho vihareyya’nti. So aparena samayena eko gaṇasmā vūpakaṭṭho viharati, acchinnaggāni ceva tiṇāni khādati, obhaggobhaggañcassa sākhābhaṅgaṃ na khādanti [na obhaggobhaggañca sākhābhaṅga khādati (syā. ka.)], anāvilāni ca pānīyāni pivati, ogāhā cassa uttiṇṇassa na hatthiniyo kāyaṃ upanighaṃsantiyo gacchanti. ‘‘Tasmiṃ, bhikkhave, samaye āraññikassa nāgassa evaṃ hoti – ‘ahaṃ kho pubbe ākiṇṇo vihāsiṃ hatthīhi hatthinīhi hatthikalabhehi hatthicchāpehi, chinnaggāni ceva tiṇāni khādiṃ, obhaggobhaggañca me sākhābhaṅgaṃ khādiṃsu, āvilāni ca pānīyāni apāyiṃ, ogāhā [ettha pisaddo sabbatthapi natthi] ca me uttiṇṇassa hatthiniyo kāyaṃ upanighaṃsantiyo agamaṃsu. Sohaṃ etarahi eko gaṇasmā vūpakaṭṭho viharāmi, acchinnaggāni ceva tiṇāni khādāmi, obhaggobhaggañca me sākhābhaṅgaṃ na khādanti, anāvilāni ca pānīyāni pivāmi, ogāhā ca me uttiṇṇassa na hatthiniyo kāyaṃ upanighaṃsantiyo gacchantī’ti. So soṇḍāya sākhābhaṅgaṃ bhañjitvā sākhābhaṅgena kāyaṃ parimajjitvā attamano soṇḍaṃ saṃharati [kaṇḍuṃ saṃhanti (sī. pī.) kaṇḍuṃ saṃhanati (syā.), ettha kaṇḍuvanadukkhaṃ vinetīti attho],. ‘‘Evamevaṃ kho, bhikkhave, yasmiṃ samaye bhikkhu ākiṇṇo viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi raññā rājamahāmattehi titthiyehi titthiyasāvakehi, tasmiṃ, bhikkhave, samaye bhikkhussa evaṃ hoti – ‘ahaṃ kho etarahi ākiṇṇo viharāmi bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi raññā rājamahāmattehi titthiyehi titthiyasāvakehi. Yaṃnūnāhaṃ eko gaṇasmā vūpakaṭṭho vihareyya’nti. So vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. So araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. ‘‘So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti; byāpādapadosaṃ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṃ parisodheti; thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti; uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ vūpasantacitto, uddhaccakukkuccā cittaṃ parisodheti; vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti. So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. So attamano soṇḍaṃ saṃharati [kaṇḍuṃ saṃhanti (sī. pī.), kaṇḍuṃ saṃhanati (syā.), ettha kaṇḍuvanasadisaṃ jhānapaṭipakkhaṃ kilesadukkhaṃ vinetīti attho]. Vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati. So attamano soṇḍaṃ saṃharati. ‘‘Sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. So attamano soṇḍaṃ saṃharati. Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati… sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati… sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati… sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. So attamano soṇḍaṃ saṃharatī’’ti. Navamaṃ.",
      "english": "Monks, there is a time when a wild elephant, preoccupied with feeding, finds that other male elephants, female elephants, young elephants, and elephant calves go ahead of it and snap off the tips of the grass. Because of this, monks, the wild elephant is annoyed, ashamed, and disgusted. Monks, there is a time when a wild elephant, preoccupied with feeding, finds that other male elephants, female elephants, young elephants, and elephant calves eat the broken branches and twigs. Because of this, monks, the wild elephant is annoyed, ashamed, and disgusted. Monks, there is a time when a wild elephant, having descended into the water, finds that other male elephants, female elephants, young elephants, and elephant calves go ahead of it and stir up the water with their trunks. Because of this, monks, the wild elephant is annoyed, ashamed, and disgusted. Monks, there is a time when a wild elephant, having come out of the water, finds that female elephants rub their bodies against it as they pass. Because of this, monks, the wild elephant is annoyed, ashamed, and disgusted.\n\nAt such a time, monks, it occurs to the wild elephant: ‘Indeed, I am now dwelling crowded with male elephants, female elephants, young elephants, and elephant calves. I eat grass with snapped-off tips, they eat my broken branches, I drink turbid water, and when I come out of the water, female elephants rub their bodies against me as they pass. What if I were to dwell alone, withdrawn from the herd?’ So, at a later time, it dwells alone, withdrawn from the herd. It eats grass with untipped ends, they do not eat its broken branches, it drinks unturbid water, and when it comes out of the water, female elephants do not rub their bodies against it as they pass.\n\nAt that time, monks, it occurs to the wild elephant: ‘Indeed, formerly I dwelt crowded with male elephants, female elephants, young elephants, and elephant calves. I ate grass with snapped-off tips, they ate my broken branches, I drank turbid water, and when I came out of the water, female elephants rubbed their bodies against me as they passed. But now I dwell alone, withdrawn from the herd. I eat grass with untipped ends, they do not eat my broken branches, I drink unturbid water, and when I come out of the water, female elephants do not rub their bodies against me as they pass.’ It then breaks off a branch with its trunk, cleans its body with the broken branch, and, delighted, experiences deep contentment.\n\nJust so, monks, there is a time when a monk dwells crowded with monks, nuns, male lay followers, female lay followers, kings, royal ministers, sectarians, and their disciples. At such a time, monks, it occurs to the monk: ‘Indeed, I am now dwelling crowded with monks, nuns, male lay followers, female lay followers, kings, royal ministers, sectarians, and their disciples. What if I were to dwell alone, withdrawn from the company?’ So he resorts to a secluded dwelling—a forest, the root of a tree, a mountain, a ravine, a mountain cave, a charnel ground, a jungle thicket, the open air, or a pile of straw. Having gone to the forest, or to the root of a tree, or to a solitary dwelling, he sits down, having folded his legs crosswise, having set his body straight, and having established mindfulness in front of him.\n\nHaving abandoned covetousness for the world, he dwells with a mind free from covetousness, purifying his mind from covetousness. Having abandoned ill-will and malice, he dwells with a mind free from ill-will, compassionate for the welfare of all living beings, purifying his mind from ill-will and malice. Having abandoned sloth and torpor, he dwells free from sloth and torpor, perceiving light, mindful, and clearly comprehending, purifying his mind from sloth and torpor. Having abandoned restlessness and remorse, he dwells unagitated, with his mind inwardly peaceful, purifying his mind from restlessness and remorse. Having abandoned doubt, he dwells having overcome doubt, without perplexity regarding wholesome states, purifying his mind from doubt. Having abandoned these five hindrances, which are corruptions of the mind and weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters and dwells in the first jhana, which is accompanied by applied thought and sustained thought, born of seclusion, with rapture and pleasure. He is delighted, and experiences deep contentment. With the calming of applied thought and sustained thought, he enters and dwells in the second jhana, which is born of concentration, with rapture and pleasure, and is free from applied thought and sustained thought, with internal assurance and unification of mind. With the fading of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body, and enters and dwells in the third jhana, of which the noble ones declare: ‘He dwells with equanimity and mindfulness, he has a pleasant abiding.’ With the abandoning of pleasure and pain, and with the prior disappearance of joy and grief, he enters and dwells in the fourth jhana, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. He is delighted, and experiences deep contentment.\n\nHaving completely transcended perceptions of form, with the disappearance of perceptions of sensory impingement, and not attending to perceptions of diversity, he enters and dwells in the sphere of infinite space, thinking, 'Space is infinite'. He is delighted, his mind collected. Having completely transcended the sphere of infinite space, he enters and dwells in the sphere of infinite consciousness, thinking, 'Consciousness is infinite'. Having completely transcended the sphere of infinite consciousness, he enters and dwells in the sphere of nothingness, thinking, 'There is nothing'. Having completely transcended the sphere of nothingness, he enters and dwells in the sphere of neither perception nor non-perception. Having completely transcended the sphere of neither perception nor non-perception, he enters and dwells in the cessation of perception and feeling. And having seen with wisdom, his defilements are utterly destroyed. He is delighted, his mind collected.",
      "sinhala": "මහණෙනි, යම් සමයක කැලෑ ඇත් රජෙකු තෘණ භෝජනයෙහි යෙදී සිටින විට, අන් ඇතෝද, ඇත්නියෝද, ඇත් පැටව්ද, තරුණ ඇත් පැටව්ද ඉදිරියට ඉදිරියට ගොස් තණ අග්‍ර සිඳ හළත්ද, මහණෙනි, එවිට ඒ කැලෑ ඇත් රජ තෙමේ පීඩා විඳියි, වෙහෙසට පත්වෙයි, පිළිකුල් කරයි. මහණෙනි, යම් සමයක කැලෑ ඇත් රජෙකු තෘණ භෝජනයෙහි යෙදී සිටින විට, අන් ඇතෝද, ඇත්නියෝද, ඇත් පැටව්ද, තරුණ ඇත් පැටව්ද කඩා බිඳ දැමූ අතු කැබලි කත්ද, මහණෙනි, එවිට ඒ කැලෑ ඇත් රජ තෙමේ පීඩා විඳියි, වෙහෙසට පත්වෙයි, පිළිකුල් කරයි. මහණෙනි, යම් සමයක කැලෑ ඇත් රජෙකු ජලයට බැස සිටින විට, අන් ඇතෝද, ඇත්නියෝද, ඇත් පැටව්ද, තරුණ ඇත් පැටව්ද ඉදිරියට ඉදිරියට ගොස් හොඬවැලෙන් දිය කලතත්ද, මහණෙනි, එවිට ඒ කැලෑ ඇත් රජ තෙමේ පීඩා විඳියි, වෙහෙසට පත්වෙයි, පිළිකුල් කරයි. මහණෙනි, යම් සමයක කැලෑ ඇත් රජෙකු ජලයෙන් ගොඩට නැඟී සිටින විට, ඇත්නියෝ ශරීරය අතුල්ලමින් යත්ද, මහණෙනි, එවිට ඒ කැලෑ ඇත් රජ තෙමේ පීඩා විඳියි, වෙහෙසට පත්වෙයි, පිළිකුල් කරයි.\n\nමහණෙනි, එවිට ඒ කැලෑ ඇත් රජහට මෙබඳු සිතක් පහළ වෙයි: 'මා දැන් ඇතූන්, ඇත්නියන්, ඇත් පැටවුන්, තරුණ ඇත් පැටවුන් විසින් ගැවසීගෙන වාසය කරමි. මා සිඳ හළ තණ අග්‍රද කමි. මාගේ කඩා බිඳ දැමූ අතු කැබලිද අනුන් කති. කලතා දැමූ දියද බොමි. ජලයෙන් ගොඩට නැඟී සිටින මාගේ ශරීරයද ඇත්නියෝ අතුල්ලමින් යති. කෙසේ නම් මම සමූහයෙන් වෙන්ව තනිව වාසය කරන්නෙම්දැ'යි. ඒ ඇත් රජ පසුව අන්‍ය සමයක සමූහයෙන් වෙන්ව තනිව වාසය කරයි. නුමුහුන් තණ අග්‍රද කයි. ඔහුගේ කඩා බිඳ දැමූ අතු කැබලිද අනුන් නොකති. නොකලතා දැමූ දියද බොයි. ජලයෙන් ගොඩට නැඟී සිටින ඔහුගේ ශරීරයද ඇත්නියෝ අතුල්ලමින් නොයති.\n\nමහණෙනි, එවිට ඒ කැලෑ ඇත් රජහට මෙබඳු සිතක් පහළ වෙයි: 'මා පෙර ඇතූන්, ඇත්නියන්, ඇත් පැටවුන්, තරුණ ඇත් පැටවුන් විසින් ගැවසීගෙන වාසය කෙළෙමි. සිඳ හළ තණ අග්‍රද කෑවෙමි. මාගේ කඩා බිඳ දැමූ අතු කැබලිද අනුන් කෑහ. කලතා දැමූ දියද බිව්වෙමි. ජලයෙන් ගොඩට නැඟී සිටින මාගේ ශරීරයද ඇත්නියෝ අතුල්ලමින් ගියහ. ඒ මම දැන් සමූහයෙන් වෙන්ව තනිව වාසය කරමි. නුමුහුන් තණ අග්‍රද කමි. මාගේ කඩා බිඳ දැමූ අතු කැබලිද අනුන් නොකති. නොකලතා දැමූ දියද බොමි. ජලයෙන් ගොඩට නැඟී සිටින මාගේ ශරීරයද ඇත්නියෝ අතුල්ලමින් නොයති'යි. ඒ ඇත් රජ හොඬවැලෙන් අතු කැබැල්ලක් කඩා, අතු කැබැල්ලෙන් ශරීරය පිරිමැද, සතුටු සිතින් හොඬවැල හැකිළයි.\n\nමහණෙනි, එපරිද්දෙන්ම, යම් සමයක භික්ෂුවක් භික්ෂූන්, භික්ෂුණීන්, උපාසකයන්, උපාසිකාවන්, රජුන්, රාජ මහාමාත්‍යයන්, තීර්ථකයන්, තීර්ථක ශ්‍රාවකයන් විසින් ගැවසීගෙන වාසය කරයිද, මහණෙනි, එවිට ඒ භික්ෂුවට මෙබඳු සිතක් පහළ වෙයි: 'මා දැන් භික්ෂූන්, භික්ෂුණීන්, උපාසකයන්, උපාසිකාවන්, රජුන්, රාජ මහාමාත්‍යයන්, තීර්ථකයන්, තීර්ථක ශ්‍රාවකයන් විසින් ගැවසීගෙන වාසය කරමි. කෙසේ නම් මම සමූහයෙන් වෙන්ව තනිව වාසය කරන්නෙම්දැ'යි.\n\nඒ භික්ෂුව හුදෙකලා සෙනසුන් සෙවනය කරයි; එනම්, වනය, ගස් මුල, පර්වතය, කන්දරාව, ගිරි ගුහාව, සුසාන භූමිය, වන ලැහැබ, එළිමහන, පිදුරු ගොඩ යනාදියයි. ඒ භික්ෂුව වනයට ගියේ හෝ, ගස් මුලට ගියේ හෝ, හිස් ගෙයකට ගියේ හෝ, පලක් බැඳ, ශරීරය ඍජුව තබා, සිහිය ඉදිරියට පිහිටුවා හිඳ ගනී.\n\nඒ භික්ෂුව ලෝකය පිළිබඳ අභිධ්‍යා (=ලෝභය) ප්‍රහාණය කොට, අභිධ්‍යාවෙන් තොර වූ සිතකින් යුක්තව වාසය කරයි; අභිධ්‍යාවෙන් සිත පිරිසිදු කරයි. ව්‍යාපාද ද්වේෂය ප්‍රහාණය කොට, සියලු සත්ත්වයන් කෙරෙහි හිතානුකම්පා ඇති, ව්‍යාපාදයෙන් තොර වූ සිතකින් යුක්තව වාසය කරයි; ව්‍යාපාද ද්වේෂයෙන් සිත පිරිසිදු කරයි. ථීනමිද්ධය (=සිතේ අලස බව හා නිදිමත) ප්‍රහාණය කොට, පහව ගිය ථීනමිද්ධ ඇතිව, ආලෝක සංඥා සහිතව, සිහි නුවණින් යුක්තව වාසය කරයි; ථීනමිද්ධයෙන් සිත පිරිසිදු කරයි. උද්ධච්ච කුක්කුච්චය (=සිතේ විසිර යාම හා පසුතැවීම) ප්‍රහාණය කොට, නොසන්සුන් නොවී, අභ්‍යන්තරයෙන් සංසිඳුණු සිතකින් යුක්තව වාසය කරයි; උද්ධච්ච කුක්කුච්චයෙන් සිත පිරිසිදු කරයි. විචිකිච්ඡාව (=සැකය) ප්‍රහාණය කොට, සැකයෙන් එතෙර වී, කුසල ධර්මයන් පිළිබඳව නොසැක ඇතිව වාසය කරයි; විචිකිච්ඡාවෙන් සිත පිරිසිදු කරයි. ඒ භික්ෂුව සිත කෙලෙසන, ප්‍රඥාව දුර්වල කරන මේ පස් නිවරණ ප්‍රහාණය කොට, කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති පළමු ධ්‍යානය උපදවා වාසය කරයි. ඒ භික්ෂුව සතුටු සිතින් (රාගාදී කෙලෙස් කසළ) හොඬවැල හැකිළා ගනී. විතර්ක හා විචාරයන් සංසිඳවීමෙන්, අභ්‍යන්තර සංසිඳීමෙන් යුක්තව, සිතේ එකඟ බවෙන් හටගත්, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීති සුඛය ඇති දෙවෙනි ධ්‍යානයට එළඹ වාසය කරයි. ඒ භික්ෂුව සතුටු සිතින් (රාගාදී කෙලෙස් කසළ) හොඬවැල හැකිළා ගනී. ප්‍රීතියෙහිද වියැකී යාමෙන් උපේක්ෂා සහිතව වාසය කරයි; සිහි නුවණින් යුක්තව, සැප විඳිමින්, ආර්යයන් වහන්සේලා 'උපේක්ෂා සහගතව, සිහි නුවණින් යුක්තව, සැප විහරණ ඇති බව' ප්‍රකාශ කරන තෙවෙනි ධ්‍යානයට එළඹ වාසය කරයි. ඒ භික්ෂුව සතුටු සිතින් (රාගාදී කෙලෙස් කසළ) හොඬවැල හැකිළා ගනී. සැප දුරු කිරීමෙන්ද, දුක් දුරු කිරීමෙන්ද, පෙරදී සෝමනස්ස දෝමනස්ස අස්තංගත වීමෙන්ද, දුක් රහිත, සැප රහිත, උපේක්ෂා සිහි පාරිශුද්ධිය ඇති සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරයි. ඒ භික්ෂුව සතුටු සිතින් (රාගාදී කෙලෙස් කසළ) හොඬවැල හැකිළා ගනී.\n\nරූප සංඥාවන් සම්පූර්ණයෙන්ම ඉක්මවා, ප්‍රතිඝ සංඥාවන් අභාවයට පත්වීමෙන්, නානත්ත සංඥාවන් කෙරෙහි අමනසිකාර කිරීමෙන්, 'ආකාශය අනන්තයි' යනුවෙන් ආකාසානඤ්චායතනයට පැමිණ වාසය කරයි. ඔහු සතුටට පත්ව, සිත සංසුන් කරගනී. සම්පූර්ණයෙන්ම ආකාසානඤ්චායතනය ඉක්මවා, 'විඤ්ඤාණය අනන්තයි' යනුවෙන් විඤ්ඤාණඤ්චායතනයට පැමිණ වාසය කරයි. සම්පූර්ණයෙන්ම විඤ්ඤාණඤ්චායතනය ඉක්මවා, 'කිසිවක් නැත' යනුවෙන් ආකිඤ්චඤ්ඤායතනයට පැමිණ වාසය කරයි. සම්පූර්ණයෙන්ම ආකිඤ්චඤ්ඤායතනය ඉක්මවා, නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වාසය කරයි. සම්පූර්ණයෙන්ම නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්මවා, සඤ්ඤා‍වේදයිත නිරෝධයට පැමිණ වාසය කරයි, ප්‍රඥාවෙන් දැකීමෙන් ඔහුගේ ආශ්‍රවයන් ක්ෂය වී යයි. ඔහු සතුටට පත්ව, සිත සංසුන් කරගනී.",
      "paliTitle": "Nāgasuttaṃ"
    },
    {
      "number": 41,
      "pali": "Ekaṃ samayaṃ bhagavā mallesu viharati uruvelakappaṃ nāma mallānaṃ nigamo. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya uruvelakappaṃ piṇḍāya pāvisi. Uruvelakappe piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ ānandaṃ āmantesi – ‘‘idheva tāva tvaṃ, ānanda, hohi, yāvāhaṃ mahāvanaṃ ajjhogāhāmi divāvihārāyā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Atha kho bhagavā mahāvanaṃ ajjhogāhetvā aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho tapusso gahapati yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho tapusso gahapati āyasmantaṃ ānandaṃ etadavoca – ‘‘Mayaṃ, bhante ānanda, gihī kāmabhogino kāmārāmā kāmaratā kāmasammuditā. Tesaṃ no, bhante, amhākaṃ gihīnaṃ kāmabhogīnaṃ kāmārāmānaṃ kāmaratānaṃ kāmasammuditānaṃ papāto viya khāyati, yadidaṃ nekkhammaṃ. Sutaṃ metaṃ, bhante, ‘imasmiṃ dhammavinaye daharānaṃ daharānaṃ bhikkhūnaṃ nekkhamme cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato’ [passataṃ (?)]. Tayidaṃ, bhante, imasmiṃ dhammavinaye bhikkhūnaṃ bahunā janena visabhāgo, yadidaṃ nekkhamma’’nti. ‘‘Atthi kho etaṃ, gahapati, kathāpābhataṃ bhagavantaṃ dassanāya. Āyāma, gahapati, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṃ ārocessāma. Yathā no bhagavā byākarissati tathā naṃ dhāressāmā’’ti. ‘‘Evaṃ, bhante’’ti kho tapusso gahapati āyasmato ānandassa paccassosi. Atha kho āyasmā ānando tapussena gahapatinā saddhiṃ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Ayaṃ, bhante, tapusso gahapati evamāha – ‘mayaṃ, bhante ānanda, gihī kāmabhogino kāmārāmā kāmaratā kāmasammuditā, tesaṃ no bhante, amhākaṃ gihīnaṃ kāmabhogīnaṃ kāmārāmānaṃ kāmaratānaṃ kāmasammuditānaṃ papāto viya khāyati, yadidaṃ nekkhammaṃ’. Sutaṃ metaṃ, bhante, ‘imasmiṃ dhammavinaye daharānaṃ daharānaṃ bhikkhūnaṃ nekkhamme cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. Tayidaṃ, bhante, imasmiṃ dhammavinaye bhikkhūnaṃ bahunā janena visabhāgo yadidaṃ nekkhamma’’’nti. ‘‘Evametaṃ, ānanda, evametaṃ, ānanda! Mayhampi kho, ānanda, pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato etadahosi – ‘sādhu nekkhammaṃ, sādhu paviveko’ti. Tassa mayhaṃ, ānanda, nekkhamme cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu ko paccayo, yena me nekkhamme cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘kāmesu kho me ādīnavo adiṭṭho, so ca me abahulīkato, nekkhamme ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me nekkhamme cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ kāmesu ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ [bahulīkareyyaṃ (sī. syā. pī.)], nekkhamme ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me nekkhamme cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena kāmesu ādīnavaṃ disvā taṃ bahulamakāsiṃ, nekkhamme ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, nekkhamme cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, ānanda, iminā vihārena viharato kāmasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. Seyyathāpi, ānanda, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa me kāmasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. ‘‘Tassa mayhaṃ, ānanda, etadahosi – ‘yaṃnūnāhaṃ vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja vihareyya’nti. Tassa mayhaṃ, ānanda, avitakke cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu ko paccayo, yena me avitakke cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘vitakkesu kho me ādīnavo adiṭṭho, so ca me abahulīkato, avitakke ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me avitakke cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ vitakkesu ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ, avitakke ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me avitakke cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena vitakkesu ādīnavaṃ disvā taṃ bahulamakāsiṃ, avitakke ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, avitakke cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, ānanda, iminā vihārena viharato vitakkasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. Seyyathāpi, ānanda, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa me vitakkasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. ‘‘Tassa mayhaṃ, ānanda, etadahosi – ‘yaṃnūnāhaṃ pītiyā ca virāgā upekkhako ca vihareyyaṃ sato ca sampajāno sukhañca kāyena paṭisaṃvedeyyaṃ yaṃ taṃ ariyā ācikkhanti – upekkhako satimā sukhavihārīti tatiyaṃ jhānaṃ upasampajja vihareyya’nti. Tassa mayhaṃ, ānanda, nippītike cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu ko paccayo, yena me nippītike cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘pītiyā kho me ādīnavo adiṭṭho, so ca me abahulīkato, nippītike ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me nippītike cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ pītiyā ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ, nippītike ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me nippītike cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena pītiyā ādīnavaṃ disvā taṃ bahulamakāsiṃ, nippītike ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, nippītike cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, ānanda, iminā vihārena viharato pītisahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. Seyyathāpi, ānanda, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa me pītisahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. ‘‘Tassa mayhaṃ, ānanda, etadahosi – ‘yaṃnūnāhaṃ sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja vihareyya’nti. Tassa mayhaṃ, ānanda, adukkhamasukhe cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu ko paccayo, yena me adukkhamasukhe cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘upekkhāsukhe kho me ādīnavo adiṭṭho, so ca me abahulīkato, adukkhamasukhe ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me adukkhamasukhe cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ upekkhāsukhe ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ, adukkhamasukhe ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me adukkhamasukhe cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena upekkhāsukhe ādīnavaṃ disvā taṃ bahulamakāsiṃ adukkhamasukhe ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, adukkhamasukhe cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharāmi. Tassa mayhaṃ, ānanda, iminā vihārena viharato upekkhāsahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. Seyyathāpi, ānanda, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa me upekkhāsahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. ‘‘Tassa mayhaṃ, ānanda, etadahosi – ‘yaṃnūnāhaṃ sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘‘ananto ākāso’’ti ākāsānañcāyatanaṃ upasampajja vihareyya’nti. Tassa mayhaṃ, ānanda, ākāsānañcāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu ko paccayo, yena me ākāsānañcāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘rūpesu kho me ādīnavo adiṭṭho, so ca abahulīkato, ākāsānañcāyatane ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me ākāsānañcāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ rūpesu ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ, ākāsānañcāyatane ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me ākāsānañcāyatane cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena rūpesu ādīnavaṃ disvā taṃ bahulamakāsiṃ, ākāsānañcāyatane ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, ākāsānañcāyatane cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, ānanda, iminā vihārena viharato rūpasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. Seyyathāpi, ānanda, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa me rūpasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. ‘‘Tassa mayhaṃ, ānanda, etadahosi – ‘yaṃnūnāhaṃ sabbaso ākāsānañcāyatanaṃ samatikkamma ‘‘anantaṃ viññāṇa’’nti viññāṇañcāyatanaṃ upasampajja vihareyya’nti. Tassa mayhaṃ, ānanda, viññāṇañcāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu ko paccayo, yena me viññāṇañcāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘ākāsānañcāyatane kho me ādīnavo adiṭṭho, so ca abahulīkato, viññāṇañcāyatane ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me viññāṇañcāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ ākāsānañcāyatane ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ, viññāṇañcāyatane ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me viññāṇañcāyatane cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena ākāsānañcāyatane ādīnavaṃ disvā taṃ bahulamakāsiṃ, viññāṇañcāyatane ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, viññāṇañcāyatane cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, ānanda, iminā vihārena viharato ākāsānañcāyatanasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. Seyyathāpi, ānanda, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa me ākāsānañcāyatanasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. ‘‘Tassa mayhaṃ, ānanda, etadahosi – ‘yaṃnūnāhaṃ sabbaso viññāṇañcāyatanaṃ samatikkamma natthi kiñcīti ākiñcaññāyatanaṃ upasampajja vihareyya’nti. Tassa mayhaṃ, ānanda, ākiñcaññāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu ko paccayo, yena me ākiñcaññāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘viññāṇañcāyatane kho me ādīnavo adiṭṭho, so ca me abahulīkato, ākiñcaññāyatane ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me ākiñcaññāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ viññāṇañcāyatane ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ, ākiñcaññāyatane ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me ākiñcaññāyatane cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena viññāṇañcāyatane ādīnavaṃ disvā taṃ bahulamakāsiṃ, ākiñcaññāyatane ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, ākiñcaññāyatane cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, ānanda, iminā vihārena viharato viññāṇañcāyatanasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. Seyyathāpi, ānanda, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa me viññāṇañcāyatanasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. ‘‘Tassa mayhaṃ, ānanda, etadahosi – ‘yaṃnūnāhaṃ sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja vihareyya’nti. Tassa mayhaṃ, ānanda, nevasaññānāsaññāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu ko paccayo, yena me nevasaññānāsaññāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘ākiñcaññāyatane kho me ādīnavo adiṭṭho, so ca me abahulīkato, nevasaññānāsaññāyatane ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me nevasaññānāsaññāyatane cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ ākiñcaññāyatane ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ, nevasaññānāsaññāyatane ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me nevasaññānāsaññāyatane cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena ākiñcaññāyatane ādīnavaṃ disvā taṃ bahulamakāsiṃ, nevasaññānāsaññāyatane ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, nevasaññānāsaññāyatane cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharāmi. Tassa mayhaṃ, ānanda, iminā vihārena viharato ākiñcaññāyatanasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. Seyyathāpi, ānanda, sukhino dukkhaṃ uppajjeyya yāvadeva ābādhāya; evamevassa me ākiñcaññāyatanasahagatā saññāmanasikārā samudācaranti. Svassa me hoti ābādho. ‘‘Tassa mayhaṃ, ānanda, etadahosi – ‘yaṃnūnāhaṃ nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja vihareyya’nti. Tassa mayhaṃ, ānanda, saññāvedayitanirodhe cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato. Tassa mayhaṃ, ānanda, etadahosi – ‘ko nu kho hetu, ko paccayo, yena me saññāvedayitanirodhe cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’? Tassa mayhaṃ, ānanda, etadahosi – ‘nevasaññānāsaññāyatane kho me ādīnavo adiṭṭho, so ca me abahulīkato, saññāvedayitanirodhe ca ānisaṃso anadhigato, so ca me anāsevito. Tasmā me saññāvedayitanirodhe cittaṃ na pakkhandati nappasīdati na santiṭṭhati na vimuccati etaṃ santanti passato’. Tassa mayhaṃ, ānanda, etadahosi – ‘sace kho ahaṃ nevasaññānāsaññāyatane ādīnavaṃ disvā taṃ bahulaṃ kareyyaṃ, saññāvedayitanirodhe ānisaṃsaṃ adhigamma tamāseveyyaṃ, ṭhānaṃ kho panetaṃ vijjati yaṃ me saññāvedayitanirodhe cittaṃ pakkhandeyya pasīdeyya santiṭṭheyya vimucceyya etaṃ santanti passato’. So kho ahaṃ, ānanda, aparena samayena nevasaññānāsaññāyatane ādīnavaṃ disvā taṃ bahulamakāsiṃ, saññāvedayitanirodhe ānisaṃsaṃ adhigamma tamāseviṃ. Tassa mayhaṃ, ānanda, saññāvedayitanirodhe cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati etaṃ santanti passato. So kho ahaṃ, ānanda, sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharāmi, paññāya ca me disvā āsavā parikkhayaṃ agamaṃsu. ‘‘Yāvakīvañcāhaṃ, ānanda, imā nava anupubbavihārasamāpattiyo na evaṃ anulomapaṭilomaṃ samāpajjimpi vuṭṭhahimpi, neva tāvāhaṃ, ānanda, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Yato ca kho ahaṃ, ānanda, imā nava anupubbavihārasamāpattiyo evaṃ anulomapaṭilomaṃ samāpajjimpi vuṭṭhahimpi, athāhaṃ, ānanda, sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti paccaññāsiṃ. Ñāṇañca pana me dassanaṃ udapādi – ‘akuppā me cetovimutti [vimutti (ka. sī. ka.)], ayamantimā jāti, natthi dāni punabbhavo’’’ti. Dasamaṃ. ",
      "english": "At one time, the Blessed One was staying among the Mallas, at a town of the Mallas named Uruvelakappa. Then, in the morning, having dressed and taking his bowl and robe, the Blessed One entered Uruvelakappa for alms. After wandering for alms in Uruvelakappa and returning from his alms round after the meal, he addressed Venerable Ānanda: \"You, Ānanda, stay here for now, while I enter the Great Wood for my midday dwelling.\" \"Yes, venerable sir,\" replied Venerable Ānanda to the Blessed One. Then the Blessed One, having entered the Great Wood, sat down at the foot of a certain tree for his midday dwelling. Then Tapussa the householder approached Venerable Ānanda; having approached and paid homage to Venerable Ānanda, he sat down to one side. Seated to one side, Tapussa the householder said to Venerable Ānanda: \"We, venerable Ānanda, are laypeople who enjoy sensual pleasures, delight in sensual pleasures, are fond of sensual pleasures, and rejoice in sensual pleasures. For us, venerable sir, laypeople who enjoy sensual pleasures, delight in sensual pleasures, are fond of sensual pleasures, and rejoice in sensual pleasures, renunciation seems like a precipice, a sheer drop. I have heard this, venerable sir: 'In this Dhamma and Discipline, the minds of young monks, very young monks, leap into renunciation, are calmed by it, become established in it, are freed by it, as they see it as peaceful.' Therefore, venerable sir, in this Dhamma and Discipline, renunciation is uncongenial to many people among the monks.\" \"This, householder, is indeed a suitable topic for discussion to bring to the Blessed One. Come, householder, let us approach the Blessed One; having approached, we shall inform the Blessed One of this matter. As the Blessed One explains it to us, so shall we bear it in mind.\" \"Yes, venerable sir,\" replied Tapussa the householder to Venerable Ānanda. Then Venerable Ānanda, together with Tapussa the householder, approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, Venerable Ānanda said to the Blessed One: \"This householder Tapussa, venerable sir, says: 'We, venerable Ānanda, are laypeople who enjoy sensual pleasures, delight in sensual pleasures, are fond of sensual pleasures, and rejoice in sensual pleasures. For us, venerable sir, laypeople who enjoy sensual pleasures, delight in sensual pleasures, are fond of sensual pleasures, and rejoice in sensual pleasures, renunciation seems like a precipice, a sheer drop.' And I have heard this, venerable sir: 'In this Dhamma and Discipline, the minds of young monks, very young monks, leap into renunciation, are calmed by it, become established in it, are freed by it, as they see it as peaceful.' Therefore, venerable sir, in this Dhamma and Discipline, renunciation is uncongenial to many people among the monks.\"\n\n\"It is so, Ānanda, it is so, Ānanda! Even for me, Ānanda, before my full enlightenment, while I was still a Bodhisatta, not yet fully enlightened, this thought arose: 'Renunciation is good; seclusion is good.' But my mind, Ānanda, did not leap into renunciation, was not calmed by it, did not become established in it, was not freed by it, even though I saw it as peaceful. Then, Ānanda, this thought occurred to me: 'What, then, is the reason, what is the cause, by which my mind does not leap into renunciation, is not calmed by it, does not become established in it, is not freed by it, even though I see it as peaceful?' Then, Ānanda, this thought occurred to me: 'I had not yet seen the drawbacks in sensual pleasures, nor had I paid much attention to them. And I had not yet understood the benefits of renunciation, nor had I cultivated them. That is why my mind did not leap into renunciation, was not calmed by it, did not become established in it, was not freed by it, even though I saw it as peaceful.' Then, Ānanda, this thought occurred to me: 'If I were to see the drawbacks in sensual pleasures and pay much attention to them, and having understood the benefits of renunciation, were to cultivate them, then it is possible that my mind would leap into renunciation, would be calmed by it, would become established in it, and would be freed by it, as I see it as peaceful.' So, Ānanda, at a later time, having seen the drawbacks in sensual pleasures, I paid much attention to them; and having understood the benefits of renunciation, I cultivated them. Then, Ānanda, my mind leaped into renunciation, was calmed by it, became established in it, and was freed by it, as I saw it as peaceful. So, Ānanda, quite secluded from sensual pleasures, secluded from unwholesome states, I entered and remained in the first meditative absorption, which is accompanied by initial and sustained application of thought, and born of seclusion, with rapture and pleasure. While I was dwelling in this dwelling, Ānanda, perceptions and mental engagements associated with sensual pleasures arose in me. That became an affliction for me. Just as, Ānanda, pain might arise for a person who is well, simply to cause him affliction; even so, perceptions and mental engagements associated with sensual pleasures arose in me. That became an affliction for me. Then, Ānanda, this thought occurred to me: 'What if I, with the fading away of initial and sustained application of thought... were to enter and remain in the second meditative absorption?' But my mind, Ānanda, did not leap into the state free from initial and sustained application of thought, was not calmed by it, did not become established in it, was not freed by it, even though I saw it as peaceful.\n\nThen, Ānanda, it occurred to me: ‘What is the reason, what is the cause, that my mind does not enter, does not become clear, does not become established, and is not liberated into the un-directed thought, even while seeing it as peaceful?’ Then, Ānanda, it occurred to me: ‘I have not perceived the drawback in directed thought, and I have not developed it extensively. I have not attained the benefit in un-directed thought, and I have not cultivated it. Therefore, my mind does not enter, does not become clear, does not become established, and is not liberated into the un-directed thought, even while seeing it as peaceful.’ Then, Ānanda, it occurred to me: ‘If I were to perceive the drawback in directed thought and develop it extensively, and having attained the benefit in un-directed thought, were to cultivate it, it would then be possible for my mind to enter, to become clear, to become established, and to be liberated into the un-directed thought, seeing it as peaceful.’ So, Ānanda, at a later time, I perceived the drawback in directed thought and developed it extensively. Having attained the benefit in un-directed thought, I cultivated it. Then, Ānanda, my mind entered, became clear, became established, and was liberated into the un-directed thought, seeing it as peaceful. So, Ānanda, with the complete subsidence of directed thought and sustained thought, with internal serenity and unification of mind, free from directed thought and sustained thought, I entered and remained in the second jhāna, which is born of concentration and filled with rapture and pleasure. As I remained in that abiding, Ānanda, perceptions and mental formations associated with directed thought arose in me. That became a disturbance for me. Just as, Ānanda, pain might arise for a person who is well, solely as a disturbance; in the same way, perceptions and mental formations associated with directed thought arose in me. That became a disturbance for me.\n\nThen, Ānanda, it occurred to me: ‘Suppose I were to abide in equanimity, having detached from rapture, mindful and clearly comprehending, and experience pleasure with the body—that of which the Noble Ones declare: “He abides in equanimity, mindful, and at ease”—and thus enter and remain in the third jhāna.’ However, Ānanda, my mind did not enter, did not become clear, did not become established, and was not liberated into the state without rapture, even while seeing it as peaceful. Then, Ānanda, it occurred to me: ‘What is the reason, what is the cause, that my mind does not enter, does not become clear, does not become established, and is not liberated into the state without rapture, even while seeing it as peaceful?’ Then, Ānanda, it occurred to me: ‘I have not perceived the drawback in rapture, and I have not developed it extensively. I have not attained the benefit in the state without rapture, and I have not cultivated it. Therefore, my mind does not enter, does not become clear, does not become established, and is not liberated into the state without rapture, even while seeing it as peaceful.’ Then, Ānanda, it occurred to me: ‘If I were to perceive the drawback in rapture and develop it extensively, and having attained the benefit in the state without rapture, were to cultivate it, it would then be possible for my mind to enter, to become clear, to become established, and to be liberated into the state without rapture, seeing it as peaceful.’ So, Ānanda, at a later time, I perceived the drawback in rapture and developed it extensively. Having attained the benefit in the state without rapture, I cultivated it. Then, Ānanda, my mind entered, became clear, became established, and was liberated into the state without rapture, seeing it as peaceful. So, Ānanda, with the fading of rapture, I abode in equanimity, mindful and clearly comprehending, and experienced pleasure with the body—that of which the Noble Ones declare: “He abides in equanimity, mindful, and at ease”—and thus entered and remained in the third jhāna. As I remained in that abiding, Ānanda, perceptions and mental formations associated with rapture arose in me. That became a disturbance for me. Just as, Ānanda, pain might arise for a person who is well, solely as a disturbance; in the same way, perceptions and mental formations associated with rapture arose in me. That became a disturbance for me.\n\nThen, Ānanda, it occurred to me: ‘Suppose I were to abandon pleasure and abandon pain, and with the prior fading away of joy and sorrow, enter and remain in the fourth jhāna, which is neither painful nor pleasant, but purified by equanimity and mindfulness.’ However, Ānanda, my mind did not enter, did not become clear, did not become established, and was not liberated into the state of neither pain nor pleasure, even while seeing it as peaceful. Then, Ānanda, it occurred to me: ‘What is the reason, what is the cause, that my mind does not enter, does not become clear, does not become established, and is not liberated into the state of neither pain nor pleasure, even while seeing it as peaceful?’ Then, Ānanda, it occurred to me: ‘I have not perceived the drawback in the pleasure of equanimity, and I have not developed it extensively. I have not attained the benefit in the state of neither pain nor pleasure, and I have not cultivated it. Therefore, my mind does not enter, does not become clear, does not become established, and is not liberated into the state of neither pain nor pleasure, even while seeing it as peaceful.’ Then, Ānanda, it occurred to me: ‘If I were to perceive the drawback in the pleasure of equanimity and develop it extensively, and having attained the benefit in the state of neither pain nor pleasure, were to cultivate it, it would then be possible for my mind to enter, to become clear, to become established, and to be liberated into the state of neither pain nor pleasure, seeing it as peaceful.’\n\nThen, Ananda, at a later time, seeing the drawback in the happiness accompanied by equanimity, I developed that extensively, and having attained the benefit in the neither-painful-nor-pleasurable, I resorted to it. Ananda, my mind in the neither-painful-nor-pleasurable plunges in, becomes confident, stands firm, and is released, seeing this as peaceful. Then, Ananda, with the abandoning of pleasure and of pain, and with the previous disappearance of joy and sorrow, I entered and dwelled in the fourth jhāna, which is neither painful nor pleasurable, but a purification of mindfulness by equanimity. Ananda, while I was dwelling in this dwelling, perceptions and mental applications associated with equanimity arose for me. That became an affliction for me. Just as, Ananda, pain might arise for one who is happy, just to become an affliction; even so, perceptions and mental applications associated with equanimity arose for me. That became an affliction for me.\n\nAnanda, this thought occurred to me: ‘What if I were to, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of diversity, enter and dwell in the dimension of infinite space, perceiving \"space is infinite\"?’ Ananda, my mind regarding the dimension of infinite space did not plunge in, did not become confident, did not stand firm, and was not released, even though I saw this as peaceful. Ananda, this thought occurred to me: ‘What is the reason, what is the cause, that my mind regarding the dimension of infinite space did not plunge in, did not become confident, did not stand firm, and was not released, even though I saw this as peaceful?’ Ananda, this thought occurred to me: ‘Indeed, I had not seen the drawback in forms, nor had I developed it extensively. And I had not attained the benefit in the dimension of infinite space, nor had I practiced it. Therefore, my mind regarding the dimension of infinite space did not plunge in, did not become confident, did not stand firm, and was not released, even though I saw this as peaceful.’ Ananda, this thought occurred to me: ‘If I were to see the drawback in forms and develop it extensively, and attain the benefit in the dimension of infinite space and practice it, then there is the possibility that my mind regarding the dimension of infinite space would plunge in, become confident, stand firm, and be released, seeing this as peaceful.’ Then, Ananda, at a later time, I saw the drawback in forms and developed it extensively, and attained the benefit in the dimension of infinite space and practiced it. Ananda, my mind regarding the dimension of infinite space plunged in, became confident, stood firm, and was released, seeing this as peaceful. Then, Ananda, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of diversity, perceiving \"space is infinite,\" I entered and dwelt in the dimension of infinite space. Ananda, while I was dwelling in this dwelling, perceptions and mental applications associated with form arose for me. That became an affliction for me. Just as, Ananda, pain might arise for one who is happy, just to become an affliction; even so, perceptions and mental applications associated with form arose for me. That became an affliction for me.\n\nAnanda, this thought occurred to me: ‘What if I were to, by completely transcending the dimension of infinite space, enter and dwell in the dimension of infinite consciousness, perceiving \"consciousness is infinite\"?’ Ananda, my mind regarding the dimension of infinite consciousness did not plunge in, did not become confident, did not stand firm, and was not released, even though I saw this as peaceful. Ananda, this thought occurred to me: ‘What is the reason, what is the cause, that my mind regarding the dimension of infinite consciousness did not plunge in, did not become confident, did not stand firm, and was not released, even though I saw this as peaceful?’ Ananda, this thought occurred to me: ‘Indeed, I had not seen the drawback in the dimension of infinite space, nor had I developed it extensively. And I had not attained the benefit in the dimension of infinite consciousness, nor had I practiced it. Therefore, my mind regarding the dimension of infinite consciousness did not plunge in, did not become confident, did not stand firm, and was not released, even though I saw this as peaceful.’ Ananda, this thought occurred to me: ‘If I were to see the drawback in the dimension of infinite space and develop it extensively, and attain the benefit in the dimension of infinite consciousness and practice it, then there is the possibility that my mind regarding the dimension of infinite consciousness would plunge in, become confident, stand firm, and be released, seeing this as peaceful.’ Then, Ananda, at a later time, I saw the drawback in the dimension of infinite space and developed it extensively, and attained the benefit in the dimension of infinite consciousness and practiced it. Ananda, my mind regarding the dimension of infinite consciousness plunged in, became confident, stood firm, and was released, seeing this as peaceful. Then, Ananda, by completely transcending the dimension of infinite space, perceiving \"consciousness is infinite,\" I entered and dwelt in the dimension of infinite consciousness. Ananda, while I was dwelling in this dwelling, perceptions and mental applications associated with the dimension of infinite space arose for me. That became an affliction for me. Just as, Ananda, pain might arise for one who is happy, just to become an affliction; even so, perceptions and mental applications associated with the dimension of infinite space arose for me. That became an affliction for me.\n\n“Then, Ananda, it occurred to me: ‘What if I were to completely transcend the Dimension of Infinitude of Consciousness and, realizing there is nothing, enter and abide in the Dimension of Nothingness?’ But my mind, Ananda, did not incline, find satisfaction, become established, or become liberated in the Dimension of Nothingness, even though I saw it as peaceful. Then, Ananda, it occurred to me: ‘What indeed is the cause, what is the condition, for my mind not to incline, find satisfaction, become established, or become liberated in the Dimension of Nothingness, even though I see it as peaceful?’ Then, Ananda, it occurred to me: ‘The drawback of the Dimension of Infinitude of Consciousness was not yet clearly seen by me, nor was it thoroughly cultivated; and the advantage of the Dimension of Nothingness was not yet fully grasped by me, nor was it diligently practiced. That is why my mind did not incline, find satisfaction, become established, or become liberated in the Dimension of Nothingness, even though I saw it as peaceful.’ Then, Ananda, it occurred to me: ‘If I were to clearly see the drawback of the Dimension of Infinitude of Consciousness and cultivate it thoroughly, and having grasped the advantage of the Dimension of Nothingness, diligently practice it, then it is indeed possible that my mind would incline, find satisfaction, become established, and become liberated in the Dimension of Nothingness, seeing it as peaceful.’ So, Ananda, on a later occasion, having clearly seen the drawback of the Dimension of Infinitude of Consciousness, I thoroughly cultivated it; and having grasped the advantage of the Dimension of Nothingness, I diligently practiced it. Then my mind, Ananda, inclined, found satisfaction, became established, and became liberated in the Dimension of Nothingness, seeing it as peaceful. So, Ananda, having completely transcended the Dimension of Infinitude of Consciousness and, realizing ‘there is nothing,’ I entered and abided in the Dimension of Nothingness. As I was abiding in this dwelling, Ananda, perceptions and mental formations associated with the Dimension of Infinitude of Consciousness would arise within me. This became an affliction for me. Just as, Ananda, for one who is comfortable, a pain might arise purely as an affliction, even so, perceptions and mental formations associated with the Dimension of Infinitude of Consciousness would arise within me. This became an affliction for me.\n\n“Then, Ananda, it occurred to me: ‘What if I were to completely transcend the Dimension of Nothingness and enter and abide in the Dimension of Neither Perception Nor Non-Perception?’ But my mind, Ananda, did not incline, find satisfaction, become established, or become liberated in the Dimension of Neither Perception Nor Non-Perception, even though I saw it as peaceful. Then, Ananda, it occurred to me: ‘What indeed is the cause, what is the condition, for my mind not to incline, find satisfaction, become established, or become liberated in the Dimension of Neither Perception Nor Non-Perception, even though I see it as peaceful?’ Then, Ananda, it occurred to me: ‘The drawback of the Dimension of Nothingness was not yet clearly seen by me, nor was it thoroughly cultivated; and the advantage of the Dimension of Neither Perception Nor Non-Perception was not yet fully grasped by me, nor was it diligently practiced. That is why my mind did not incline, find satisfaction, become established, or become liberated in the Dimension of Neither Perception Nor Non-Perception, even though I saw it as peaceful.’ Then, Ananda, it occurred to me: ‘If I were to clearly see the drawback of the Dimension of Nothingness and cultivate it thoroughly, and having grasped the advantage of the Dimension of Neither Perception Nor Non-Perception, diligently practice it, then it is indeed possible that my mind would incline, find satisfaction, become established, and become liberated in the Dimension of Neither Perception Nor Non-Perception, seeing it as peaceful.’ So, Ananda, on a later occasion, having clearly seen the drawback of the Dimension of Nothingness, I thoroughly cultivated it; and having grasped the advantage of the Dimension of Neither Perception Nor Non-Perception, I diligently practiced it. Then my mind, Ananda, inclined, found satisfaction, became established, and became liberated in the Dimension of Neither Perception Nor Non-Perception, seeing it as peaceful. So, Ananda, having completely transcended the Dimension of Nothingness, I entered and abided in the Dimension of Neither Perception Nor Non-Perception. As I was abiding in this dwelling, Ananda, perceptions and mental formations associated with the Dimension of Nothingness would arise within me. This became an affliction for me. Just as, Ananda, for one who is comfortable, a pain might arise purely as an affliction, even so, perceptions and mental formations associated with the Dimension of Nothingness would arise within me. This became an affliction for me.\n\n“Then, Ananda, it occurred to me: ‘What if I were to completely transcend the Dimension of Neither Perception Nor Non-Perception and enter and abide in the Cessation of Perception and Feeling?’ But my mind, Ananda, did not incline, find satisfaction, become established, or become liberated in the Cessation of Perception and Feeling, even though I saw it as peaceful. Then, Ananda, it occurred to me: ‘What indeed is the cause, what is the condition, for my mind not to incline, find satisfaction, become established, or become liberated in the Cessation of Perception and Feeling, even though I see it as peaceful?’ Then, Ananda, it occurred to me: ‘The drawback of the Dimension of Neither Perception Nor Non-Perception was not yet clearly seen by me, nor was it thoroughly cultivated; and the advantage of the Cessation of Perception and Feeling was not yet fully grasped by me, nor was it diligently practiced.’\n\nTherefore, my mind did not enter, settle, become firm, or become liberated in the cessation of perception and feeling, even when seeing it as peaceful. Then, Ananda, it occurred to me: ‘If I were to see the drawbacks in the sphere of neither-perception-nor-non-perception and cultivate that understanding extensively, and having realized the benefit of the cessation of perception and feeling, were to cultivate that, it would then be possible for my mind to enter, settle, become firm, and be liberated in the cessation of perception and feeling, seeing it as peaceful.’ So, Ananda, at a later time, having seen the drawbacks in the sphere of neither-perception-nor-non-perception, I cultivated that understanding extensively, and having realized the benefit of the cessation of perception and feeling, I cultivated that. Then, Ananda, my mind entered, settled, became firm, and was liberated in the cessation of perception and feeling, seeing it as peaceful. So, Ananda, having completely transcended the sphere of neither-perception-nor-non-perception, I entered and dwelled in the cessation of perception and feeling, and having seen with wisdom, my defilements came to an end.\n\nAs long as I, Ananda, had not entered and emerged from these nine progressive attainments of dwelling in both forward and reverse order, I did not declare in this world with its deities, Māras, and Brahmās, with its ascetics and brahmins, its gods and humans, that I had fully awakened to unsurpassed perfect self-awakening. But when I, Ananda, had entered and emerged from these nine progressive attainments of dwelling in both forward and reverse order, then I, Ananda, declared in this world with its deities, Māras, and Brahmās, with its ascetics and brahmins, its gods and humans, that I had fully awakened to unsurpassed perfect self-awakening. And knowledge and vision arose in me: ‘My liberation of mind is unshakable; this is my last birth; there is now no more renewed existence.’",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ මල්ලවරුන්ගේ ඌරුවෙලකප්ප නම් නියම්ගමෙහි වැඩසිටියහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා චීවරය රැගෙන ඌරුවෙලකප්ප ගමට පිඬු පිණිස වැඩිසේක. ඌරුවෙලකප්ප ගමෙහි පිඬු සිඟා වළඳා, දහවල් ආහාරයෙන් පසුව පිණ්ඩපාතයෙන් නික්ම, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ ඇමතූසේක: \"ආනන්දයෙනි, මා දවල් විවේක ගැනීම සඳහා මහ වනයට පිවිසෙන තුරු ඔබ මෙහිම රැඳී සිටින්න.\" \"එසේය, භාග්‍යවතුන් වහන්සැ\"යි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ මහ වනයට පිවිස කිසියම් ගසක් මුල දවල් විවේක ගැනීම සඳහා වැඩසිටිසේක. ඉක්බිති තපස්සු නම් ගෘහපතියා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වෙත පැමිණියේය; පැමිණ, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට වන්දනා කර එක් පසෙකින් හිඳගත්තේය. එක් පසෙකින් හුන් තපස්සු ගෘහපතියා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: \"ආනන්ද ස්වාමීනි, අපි ගිහියෝ වෙමු, කාමයන් පරිභෝග කරන්නෝ වෙමු, කාමයන්හි ඇලුණෝ වෙමු, කාමයන්හි ප්‍රිය කරන්නෝ වෙමු, කාමයන්ගෙන් සතුටු වන්නෝ වෙමු. එවැනි වූ කාමයන් පරිභෝග කරන, කාමයන්හි ඇලුණු, කාමයන්හි ප්‍රිය කරන, කාමයන්ගෙන් සතුටු වන අප ගිහියන්ට මේ නෙක්ඛම්මය (නික්මීම) අගාධයක් මෙන් පෙනේ. ස්වාමීනි, මා විසින් මෙය අසා ඇත: 'මේ ධර්ම විනයෙහි තරුණ තරුණ භික්ෂූන්ගේ සිත් නෙක්ඛම්මය තුළට පිවිසෙයි, ප්‍රසන්න වෙයි, පිහිටයි, මිදෙයි, ඔවුහු මෙය ශාන්තියක් ලෙස දකිති.' ස්වාමීනි, මේ නෙක්ඛම්මය නම් වූ දෙය මේ ධර්ම විනයෙහි භික්ෂූන් බොහෝ දෙනකුට විරුද්ධ දෙයකි.\" \"ගෘහපතිය, භාග්‍යවතුන් වහන්සේ හමුවීමට යාමට මෙය සුදුසු කාරණාවකි. එනු මැන, ගෘහපතිය, අපි භාග්‍යවතුන් වහන්සේ වෙත යමු; ගොස් භාග්‍යවතුන් වහන්සේට මේ කාරණය දන්වමු. භාග්‍යවතුන් වහන්සේ අපට කෙසේ දේශනා කරනු ඇත්ද, එසේ අපි එය දරාගන්නෙමු.\" \"එසේය, ස්වාමීනි\"යි තපස්සු ගෘහපතියා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්නේය. ඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ තපස්සු ගෘහපතියා සමඟ භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් හිඳගත්තේය. එක් පසෙකින් හුන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ස්වාමීනි, මේ තපස්සු ගෘහපතියා මෙසේ කියයි: 'ආනන්ද ස්වාමීනි, අපි ගිහියෝ වෙමු, කාමයන් පරිභෝග කරන්නෝ වෙමු, කාමයන්හි ඇලුණෝ වෙමු, කාමයන්හි ප්‍රිය කරන්නෝ වෙමු, කාමයන්ගෙන් සතුටු වන්නෝ වෙමු. එවැනි වූ කාමයන් පරිභෝග කරන, කාමයන්හි ඇලුණු, කාමයන්හි ප්‍රිය කරන, කාමයන්ගෙන් සතුටු වන අප ගිහියන්ට මේ නෙක්ඛම්මය අගාධයක් මෙන් පෙනේ. ස්වාමීනි, මා විසින් මෙය අසා ඇත: 'මේ ධර්ම විනයෙහි තරුණ තරුණ භික්ෂූන්ගේ සිත් නෙක්ඛම්මය තුළට පිවිසෙයි, ප්‍රසන්න වෙයි, පිහිටයි, මිදෙයි, ඔවුහු මෙය ශාන්තියක් ලෙස දකිති.' ස්වාමීනි, මේ නෙක්ඛම්මය නම් වූ දෙය මේ ධර්ම විනයෙහි භික්ෂූන් බොහෝ දෙනකුට විරුද්ධ දෙයකි.\"\n\n\"ආනන්දයෙනි, මෙය එසේමය, ආනන්දයෙනි, මෙය එසේමය! ආනන්දයෙනි, මා තථාගත සම්බුද්ධත්වය නොලැබූ, බෝසත්ව සිටි කලෙහි, 'නෙක්ඛම්මය යහපත්ය, විවේකය යහපත්ය' යන මේ සිතුවිල්ල පහළ විය. එහෙත්, ආනන්දයෙනි, එවිට මාගේ සිත නෙක්ඛම්මය තුළට නොපිවිසියේය, ප්‍රසන්න නොවූයේය, නොපිහිටියේය, මිදුණේ නැත, මා මෙය ශාන්තියක් ලෙස නොදුටුවෙමි. ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: 'නෙක්ඛම්මය තුළට මාගේ සිත නොපිවිසීමට, ප්‍රසන්න නොවීමට, නොපිහිටීමට, නොමිදීමට, මා මෙය ශාන්තියක් ලෙස නොදැකීමට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?' ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: 'කාමයන්හි ආදීනවය මා විසින් නොදැක ඇත, එය මා විසින් බහුල වශයෙන් මෙනෙහි නොකරන ලද්දේය; නෙක්ඛම්මයෙහි ආනිසංසය මා විසින් අවබෝධ නොකරන ලද්දේය, එය මා විසින් අනුගමනය නොකරන ලද්දේය. එබැවින් මාගේ සිත නෙක්ඛම්මය තුළට නොපිවිසෙයි, ප්‍රසන්න නොවෙයි, නොපිහිටයි, නොමිදෙයි, මා මෙය ශාන්තියක් ලෙස නොදකිමි.' ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: 'කාමයන්හි ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කරන්නටත්, නෙක්ඛම්මයෙහි ආනිසංසය අවබෝධ කරගෙන එය අනුගමනය කරන්නටත් මා සමත් වූයේ නම්, මාගේ සිත නෙක්ඛම්මය තුළට පිවිසීමත්, ප්‍රසන්න වීමත්, පිහිටීමත්, මිදීමත්, මා මෙය ශාන්තියක් ලෙස දැකීමත් සිදුවිය හැකි කරුණකි.' ආනන්දයෙනි, පසු කලෙක මා කාමයන්හි ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කළෙමි, නෙක්ඛම්මයෙහි ආනිසංසය අවබෝධ කරගෙන එය අනුගමනය කළෙමි. ආනන්දයෙනි, එවිට මාගේ සිත නෙක්ඛම්මය තුළට පිවිසියේය, ප්‍රසන්න වූයේය, පිහිටියේය, මිදුණේය, මා මෙය ශාන්තියක් ලෙස දුටුවෙමි. ආනන්දයෙනි, මා කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කළෙමි. ආනන්දයෙනි, ඒ මා මේ විහරණයෙන් වෙසෙද්දී, කාමය හා බැඳුණු සංඥා හා මනසිකාරයන් උපදියි. එය මට බාධාවකි. ආනන්දයෙනි, යම්සේ සුවෙන් සිටින කෙනකුට බාධාවක් පිණිසම දුකක් උපදියිද, එලෙසින්ම කාමය හා බැඳුණු සංඥා හා මනසිකාරයන් උපදියි. එය මට බාධාවකි. ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: 'විතර්ක විචාරයන් සංසිඳවීමෙන්... (ආදී වශයෙන්)... දෙවන ධ්‍යානයට පැමිණ වාසය කරන්නට සමත් වූයේ නම්.' ආනන්දයෙනි, එවිට අවිතර්ක (දෙවන ධ්‍යාන) තත්ත්වය කෙරෙහි මාගේ සිත නොපිවිසියේය, ප්‍රසන්න නොවූයේය, නොපිහිටියේය, මිදුණේ නැත, මා මෙය ශාන්තියක් ලෙස නොදුටුවෙමි.\n\nආනන්දය, මට මේ අදහස ඇති විය: ‘කුමක් නම් හේතුව ද, කුමක් නම් ප්‍රත්‍යය ද, යමකින් මගේ සිත අවිතර්ක භාවය වෙත නොනැමෙන්නේ, ප්‍රසන්න නොවන්නේ, ස්ථිර නොවන්නේ, (එය සන්සුන් යැයි) දකිමින් එයින් නොමිදෙන්නේ යැයි?’ ආනන්දය, මට මේ අදහස ඇති විය: ‘විතර්කයන්හි ආදීනවය මට නොපෙනුණේය, ඒ ආදීනවය මගින් මා විසින් බහුල වශයෙන් මෙනෙහි නොකරන ලද්දේය. අවිතර්ක භාවයේ ආනිසංසය මට අවබෝධ නොවීය, ඒ ආනිසංසය මගින් මා විසින් සේවනය නොකරන ලද්දේය. එබැවින් මගේ සිත අවිතර්ක භාවය වෙත නොනැමෙයි, ප්‍රසන්න නොවෙයි, ස්ථිර නොවෙයි, (එය සන්සුන් යැයි) දකිමින් එයින් නොමිදෙයි.’ ආනන්දය, මට මේ අදහස ඇති විය: ‘යම් හෙයකින් මා විසින් විතර්කයන්හි ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කරන්නේ නම්, අවිතර්ක භාවයේ ආනිසංසය අවබෝධ කරගෙන එය සේවනය කරන්නේ නම්, එබඳු තත්වයක් පවතී, යමකින් මගේ සිත අවිතර්ක භාවය වෙත නැමෙන්නේ, ප්‍රසන්න වන්නේ, ස්ථිර වන්නේ, (එය සන්සුන් යැයි) දකිමින් එයින් මිදෙන්නේ ය.’ ආනන්දය, පසු කලෙක මම විතර්කයන්හි ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කළෙමි, අවිතර්ක භාවයේ ආනිසංසය අවබෝධ කරගෙන එය සේවනය කළෙමි. ආනන්දය, එවිට මගේ සිත අවිතර්ක භාවය වෙත නැමෙයි, ප්‍රසන්න වෙයි, ස්ථිර වෙයි, (එය සන්සුන් යැයි) දකිමින් එයින් මිදෙයි. ආනන්දය, මෙසේ මම විතර්ක විචාරයන්ගේ සංසිඳීමෙන්...පෙ... දෙවෙනි ධ්‍යානයට සමවදින්නේ වාසය කරමි. ආනන්දය, මෙසේ මා මේ විහරණයෙන් වාසය කරන කල්හි විතර්කයන් හා බැඳුණු සංඥා මනසිකාරයන් හටගනී. එය මට බාධාවක් විය. ආනන්දය, යම් සේ සුවසේ සිටින අයෙකුට බාධාවක් පිණිසම දුකක් උපදී ද, එලෙසම මට විතර්කයන් හා බැඳුණු සංඥා මනසිකාරයන් හටගනී. එය මට බාධාවක් විය.\n\nආනන්දය, මට මේ අදහස ඇති විය: ‘මම දැන් ප්‍රීතිය කෙරෙහි ද නොඇලීමෙන්, උපේක්ෂාවෙන් යුතුව වාසය කරන්නේ නම්, සිහි නුවණින් යුක්තව ද, කයින් සුවය විඳින්නේ නම්, යමක් ආර්යයෝ (උතුමන්) මෙසේ පවසත් ද – උපේක්ෂා සහගතය, සිහි නුවණින් යුක්තය, සුවසේ වසන්නේය යනුවෙන්, ඒ තෙවෙනි ධ්‍යානයට සමවදින්නේ වාසය කරන්නේ නම් හොඳ යැයි.’ ආනන්දය, එවිට මගේ සිත නිර්ප්‍රීතික භාවය වෙත නොනැමෙයි, ප්‍රසන්න නොවෙයි, ස්ථිර නොවෙයි, (එය සන්සුන් යැයි) දකිමින් එයින් නොමිදෙයි. ආනන්දය, මට මේ අදහස ඇති විය: ‘කුමක් නම් හේතුව ද, කුමක් නම් ප්‍රත්‍යය ද, යමකින් මගේ සිත නිර්ප්‍රීතික භාවය වෙත නොනැමෙන්නේ, ප්‍රසන්න නොවන්නේ, ස්ථිර නොවන්නේ, (එය සන්සුන් යැයි) දකිමින් එයින් නොමිදෙන්නේ යැයි?’ ආනන්දය, මට මේ අදහස ඇති විය: ‘ප්‍රීතියේ ආදීනවය මට නොපෙනුණේය, ඒ ආදීනවය මගින් මා විසින් බහුල වශයෙන් මෙනෙහි නොකරන ලද්දේය. නිර්ප්‍රීතික භාවයේ ආනිසංසය මට අවබෝධ නොවීය, ඒ ආනිසංසය මගින් මා විසින් සේවනය නොකරන ලද්දේය. එබැවින් මගේ සිත නිර්ප්‍රීතික භාවය වෙත නොනැමෙයි, ප්‍රසන්න නොවෙයි, ස්ථිර නොවෙයි, (එය සන්සුන් යැයි) දකිමින් එයින් නොමිදෙයි.’ ආනන්දය, මට මේ අදහස ඇති විය: ‘යම් හෙයකින් මා විසින් ප්‍රීතියේ ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කරන්නේ නම්, නිර්ප්‍රීතික භාවයේ ආනිසංසය අවබෝධ කරගෙන එය සේවනය කරන්නේ නම්, එබඳු තත්වයක් පවතී, යමකින් මගේ සිත නිර්ප්‍රීතික භාවය වෙත නැමෙන්නේ, ප්‍රසන්න වන්නේ, ස්ථිර වන්නේ, (එය සන්සුන් යැයි) දකිමින් එයින් මිදෙන්නේ ය.’ ආනන්දය, පසු කලෙක මම ප්‍රීතියේ ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කළෙමි, නිර්ප්‍රීතික භාවයේ ආනිසංසය අවබෝධ කරගෙන එය සේවනය කළෙමි. ආනන්දය, එවිට මගේ සිත නිර්ප්‍රීතික භාවය වෙත නැමෙයි, ප්‍රසන්න වෙයි, ස්ථිර වෙයි, (එය සන්සුන් යැයි) දකිමින් එයින් මිදෙයි. ආනන්දය, මෙසේ මම ප්‍රීතිය කෙරෙහි ද නොඇලීමෙන්...පෙ... තෙවෙනි ධ්‍යානයට සමවදින්නේ වාසය කරමි. ආනන්දය, මෙසේ මා මේ විහරණයෙන් වාසය කරන කල්හි ප්‍රීතිය හා බැඳුණු සංඥා මනසිකාරයන් හටගනී. එය මට බාධාවක් විය. ආනන්දය, යම් සේ සුවසේ සිටින අයෙකුට බාධාවක් පිණිසම දුකක් උපදී ද, එලෙසම මට ප්‍රීතිය හා බැඳුණු සංඥා මනසිකාරයන් හටගනී. එය මට බාධාවක් විය.\n\nආනන්දය, මට මේ අදහස ඇති විය: ‘මම දැන් සුවය ද දුක ද ප්‍රහාණය කිරීමෙන්, පෙර සිටි සෝමනස්ස-දෝමනස්සයන්ගේ අතුරුදන් වීමෙන්, දුක් ද නොවන, සුව ද නොවන, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිවුවෙනි ධ්‍යානයට සමවදින්නේ වාසය කරන්නේ නම් හොඳ යැයි.’ ආනන්දය, එවිට මගේ සිත දුක් ද නොවන සුව ද නොවන භාවය වෙත නොනැමෙයි, ප්‍රසන්න නොවෙයි, ස්ථිර නොවෙයි, (එය සන්සුන් යැයි) දකිමින් එයින් නොමිදෙයි. ආනන්දය, මට මේ අදහස ඇති විය: ‘කුමක් නම් හේතුව ද, කුමක් නම් ප්‍රත්‍යය ද, යමකින් මගේ සිත දුක් ද නොවන සුව ද නොවන භාවය වෙත නොනැමෙන්නේ, ප්‍රසන්න නොවන්නේ, ස්ථිර නොවන්නේ, (එය සන්සුන් යැයි) දකිමින් එයින් නොමිදෙන්නේ යැයි?’ ආනන්දය, මට මේ අදහස ඇති විය: ‘උපේක්ෂා සුවයේ ආදීනවය මට නොපෙනුණේය, ඒ ආදීනවය මගින් මා විසින් බහුල වශයෙන් මෙනෙහි නොකරන ලද්දේය. දුක් ද නොවන සුව ද නොවන භාවයේ ආනිසංසය මට අවබෝධ නොවීය, ඒ ආනිසංසය මගින් මා විසින් සේවනය නොකරන ලද්දේය. එබැවින් මගේ සිත දුක් ද නොවන සුව ද නොවන භාවය වෙත නොනැමෙයි, ප්‍රසන්න නොවෙයි, ස්ථිර නොවෙයි, (එය සන්සුන් යැයි) දකිමින් එයින් නොමිදෙයි.’ ආනන්දය, මට මේ අදහස ඇති විය: ‘යම් හෙයකින් මා විසින් උපේක්ෂා සුවයේ ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කරන්නේ නම්, දුක් ද නොවන සුව ද නොවන භාවයේ ආනිසංසය අවබෝධ කරගෙන එය සේවනය කරන්නේ නම්, එබඳු තත්වයක් පවතී, යමකින් මගේ සිත දුක් ද නොවන සුව ද නොවන භාවය වෙත නැමෙන්නේ, ප්‍රසන්න වන්නේ, ස්ථිර වන්නේ, (එය සන්සුන් යැයි) දකිමින් එයින් මිදෙන්නේ ය.’\n\nආනන්දයෙනි, පසුව එක් සමයක මම උපේක්ෂා සුඛයෙහි ආදීනව දැක, එය බහුල වශයෙන් මෙනෙහි කළෙමි. නොදුක් නොසැප වේදනාවෙහි ආනිශංසයන් අවබෝධ කරගෙන එය භාවනා කළෙමි. ආනන්දයෙනි, මෙය ශාන්ත යැයි දකිද්දී, මගේ සිත නොදුක් නොසැප වේදනාවෙහි නැඹුරු වන්නේය, පැහැදෙන්නේය, පිහිටන්නේය, කෙලෙසුන්ගෙන් මිදෙන්නේය. ආනන්දයෙනි, සුඛය ප්‍රහාණය කිරීමෙන්...පෙ... මම සිව්වන ධ්‍යානයට එළඹ වාසය කළෙමි. ආනන්දයෙනි, මේ විහරණයෙන් වෙසෙද්දී උපේක්ෂාව සමඟ උපන් සංඥා හා මනසිකාරයන් මට පහළ විය. එය මට බාධාවක් විය. ආනන්දයෙනි, යම් සේ සැපයෙන් වෙසෙන කෙනෙකුට දුකක් හටගනී ද, ඒ උපදින්නේ බාධාවක් පිණිසමය; එලෙසින්ම මට උපේක්ෂාව සමඟ උපන් සංඥා හා මනසිකාරයන් පහළ විය. එය මට බාධාවක් විය.\n\nආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: \"කිමෙක්ද, මම සියලු රූප සංඥාවන් සම්පූර්ණයෙන් ඉක්මවා, ඝට්ටන සංඥාවන් අතුරුදහන් කිරීමෙන්, නන්‍දත්‍ව සංඥාවන් මෙනෙහි නොකිරීමෙන් 'අනන්ත ආකාශයයි' යනුවෙන් ආකාසානඤ්චායතනයට එළඹ වාසය කළහොත් හොඳයැයි.\" ආනන්දයෙනි, මෙය ශාන්ත යැයි දකිද්දී වුවද, මගේ සිත ආකාසානඤ්චායතනයෙහි නැඹුරු වූයේ නැත, පැහැදුනේ නැත, පිහිටියේ නැත, කෙලෙසුන්ගෙන් මිදුනේ නැත. ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: \" කුමක් නම් හේතුව ද, කුමක් නම් ප්‍රත්‍යය ද, යම් හෙයකින් මට ආකාසානඤ්චායතනයෙහි සිත නැඹුරු නොවන්නේ ද, නොපැහැදෙන්නේ ද, නොපිහිටන්නේ ද, කෙලෙසුන්ගෙන් නොමිදෙන්නේ ද, මෙය ශාන්ත යැයි දකිද්දීත්?\" ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: \"මා විසින් රූපයන්හි ආදීනව නොදැක ඇත. ඒ ආදීනව බහුල වශයෙන් මෙනෙහි කර නැත. ආකාසානඤ්චායතනයෙහි ආනිශංස අවබෝධ කරගෙන නැත. ඒ ආනිශංසය මා විසින් භාවනා කර නැත. එහෙයින් මට ආකාසානඤ්චායතනයෙහි සිත නැඹුරු නොවන්නේය, නොපැහැදෙන්නේය, නොපිහිටන්නේය, කෙලෙසුන්ගෙන් නොමිදෙන්නේය, මෙය ශාන්ත යැයි දකිද්දීත්.\" ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: \"යම් හෙයකින් මා රූපයන්හි ආදීනව දැක එය බහුල වශයෙන් මෙනෙහි කරන්නට හැකි නම්, ආකාසානඤ්චායතනයෙහි ආනිශංස අවබෝධ කරගෙන එය භාවනා කරන්නට හැකි නම්, එය සිදු විය හැකි කරුණකි, යම් හෙයකින් මට ආකාසානඤ්චායතනයෙහි සිත නැඹුරු වන්නේය, පැහැදෙන්නේය, පිහිටන්නේය, කෙලෙසුන්ගෙන් මිදෙන්නේය, මෙය ශාන්ත යැයි දකිද්දී.\" ආනන්දයෙනි, පසුව එක් සමයක මම රූපයන්හි ආදීනව දැක එය බහුල වශයෙන් මෙනෙහි කළෙමි. ආකාසානඤ්චායතනයෙහි ආනිශංස අවබෝධ කරගෙන එය භාවනා කළෙමි. ආනන්දයෙනි, මෙය ශාන්ත යැයි දකිද්දී, මගේ සිත ආකාසානඤ්චායතනයෙහි නැඹුරු වන්නේය, පැහැදෙන්නේය, පිහිටන්නේය, කෙලෙසුන්ගෙන් මිදෙන්නේය. ආනන්දයෙනි, මම සියලු රූප සංඥාවන් සම්පූර්ණයෙන් ඉක්මවා, ඝට්ටන සංඥාවන් අතුරුදහන් කිරීමෙන්, නන්‍දත්‍ව සංඥාවන් මෙනෙහි නොකිරීමෙන් 'අනන්ත ආකාශයයි' යනුවෙන් ආකාසානඤ්චායතනයට එළඹ වාසය කළෙමි. ආනන්දයෙනි, මේ විහරණයෙන් වෙසෙද්දී රූපය හා සමඟ උපන් සංඥා හා මනසිකාරයන් මට පහළ විය. එය මට බාධාවක් විය. ආනන්දයෙනි, යම් සේ සැපයෙන් වෙසෙන කෙනෙකුට දුකක් හටගනී ද, ඒ උපදින්නේ බාධාවක් පිණිසමය; එලෙසින්ම මට රූපය හා සමඟ උපන් සංඥා හා මනසිකාරයන් පහළ විය. එය මට බාධාවක් විය.\n\nආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: \"කිමෙක්ද, මම සියලු ආකාසානඤ්චායතනය සම්පූර්ණයෙන් ඉක්මවා 'අනන්ත විඤ්ඤාණයයි' යනුවෙන් විඤ්ඤාණඤ්චායතනයට එළඹ වාසය කළහොත් හොඳයැයි.\" ආනන්දයෙනි, මෙය ශාන්ත යැයි දකිද්දී වුවද, මගේ සිත විඤ්ඤාණඤ්චායතනයෙහි නැඹුරු වූයේ නැත, පැහැදුනේ නැත, පිහිටියේ නැත, කෙලෙසුන්ගෙන් මිදුනේ නැත. ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: \" කුමක් නම් හේතුව ද, කුමක් නම් ප්‍රත්‍යය ද, යම් හෙයකින් මට විඤ්ඤාණඤ්චායතනයෙහි සිත නැඹුරු නොවන්නේ ද, නොපැහැදෙන්නේ ද, නොපිහිටන්නේ ද, කෙලෙසුන්ගෙන් නොමිදෙන්නේ ද, මෙය ශාන්ත යැයි දකිද්දීත්?\" ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: \"මා විසින් ආකාසානඤ්චායතනයෙහි ආදීනව නොදැක ඇත. ඒ ආදීනව බහුල වශයෙන් මෙනෙහි කර නැත. විඤ්ඤාණඤ්චායතනයෙහි ආනිශංස අවබෝධ කරගෙන නැත. ඒ ආනිශංසය මා විසින් භාවනා කර නැත. එහෙයින් මට විඤ්ඤාණඤ්චායතනයෙහි සිත නැඹුරු නොවන්නේය, නොපැහැදෙන්නේය, නොපිහිටන්නේය, කෙලෙසුන්ගෙන් නොමිදෙන්නේය, මෙය ශාන්ත යැයි දකිද්දීත්.\" ආනන්දයෙනි, එවිට මට මෙසේ සිතුණි: \"යම් හෙයකින් මා ආකාසානඤ්චායතනයෙහි ආදීනව දැක එය බහුල වශයෙන් මෙනෙහි කරන්නට හැකි නම්, විඤ්ඤාණඤ්චායතනයෙහි ආනිශංස අවබෝධ කරගෙන එය භාවනා කරන්නට හැකි නම්, එය සිදු විය හැකි කරුණකි, යම් හෙයකින් මට විඤ්ඤාණඤ්චායතනයෙහි සිත නැඹුරු වන්නේය, පැහැදෙන්නේය, පිහිටන්නේය, කෙලෙසුන්ගෙන් මිදෙන්නේය, මෙය ශාන්ත යැයි දකිද්දී.\" ආනන්දයෙනි, පසුව එක් සමයක මම ආකාසානඤ්චායතනයෙහි ආදීනව දැක එය බහුල වශයෙන් මෙනෙහි කළෙමි. විඤ්ඤාණඤ්චායතනයෙහි ආනිශංස අවබෝධ කරගෙන එය භාවනා කළෙමි. ආනන්දයෙනි, මෙය ශාන්ත යැයි දකිද්දී, මගේ සිත විඤ්ඤාණඤ්චායතනයෙහි නැඹුරු වන්නේය, පැහැදෙන්නේය, පිහිටන්නේය, කෙලෙසුන්ගෙන් මිදෙන්නේය. ආනන්දයෙනි, මම සියලු ආකාසානඤ්චායතනය සම්පූර්ණයෙන් ඉක්මවා 'අනන්ත විඤ්ඤාණයයි' යනුවෙන් විඤ්ඤාණඤ්චායතනයට එළඹ වාසය කළෙමි. ආනන්දයෙනි, මේ විහරණයෙන් වෙසෙද්දී ආකාසානඤ්චායතනය හා සමඟ උපන් සංඥා හා මනසිකාරයන් මට පහළ විය. එය මට බාධාවක් විය. ආනන්දයෙනි, යම් සේ සැපයෙන් වෙසෙන කෙනෙකුට දුකක් හටගනී ද, ඒ උපදින්නේ බාධාවක් පිණිසමය; එලෙසින්ම මට ආකාසානඤ්චායතනය හා සමඟ උපන් සංඥා හා මනසිකාරයන් පහළ විය. එය මට බාධාවක් විය.\n\nආනන්දය, මට මේ අදහස ඇති විය – ‘මම කෙසේ හෝ විඤ්ඤාණඤ්චායතනය සම්පූර්ණයෙන් ඉක්මවා, ‘කිසිවක් නැතැයි’ යන අකිංචඤ්ඤායතනයට පැමිණ වාසය කරන්නේ නම් ඉතා යෙහෙකි’. ආනන්දය, ‘මේ ශාන්තයි’ කියා දකිද්දී අකිංචඤ්ඤායතනයෙහි මගේ සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, මිදෙන්නට නොපෙළඹෙයි. ආනන්දය, මට මේ අදහස ඇති විය – ‘මගේ සිත අකිංචඤ්ඤායතනයෙහි නොඇලෙන්නේ, නොපැහැදෙන්නේ, නොපිහිටන්නේ, ‘මේ ශාන්තයි’ කියා දකිද්දීත් මිදෙන්නට නොපෙළඹෙන්නේ කුමක් හේතුවෙන්ද, කුමක් ප‍්‍රත්‍යය කරගෙනද?’ ආනන්දය, මට මේ අදහස ඇති විය – ‘මම විඤ්ඤාණඤ්චායතනයේ ආදීනවය නිසි ලෙස දැක නොතිබුණෙමි. එය බහුල වශයෙන් මෙනෙහි නොකළෙමි. අකිංචඤ්ඤායතනයේ ආනිසංසය මට අවබෝධ වී නොතිබුණි. එය මා විසින් ප‍්‍රගුණ කර තිබුණේ නැත. එබැවින් ‘මේ ශාන්තයි’ කියා දකිද්දීත් අකිංචඤ්ඤායතනයෙහි මගේ සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, මිදෙන්නට නොපෙළඹෙයි.’ ආනන්දය, මට මේ අදහස ඇති විය – ‘යම් හෙයකින් මම විඤ්ඤාණඤ්චායතනයේ ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කරන්නටත්, අකිංචඤ්ඤායතනයේ ආනිසංසය අවබෝධ කරගෙන එය ප‍්‍රගුණ කරන්නටත් සමත් වුවහොත්, එවිට ‘මේ ශාන්තයි’ කියා දකිද්දී අකිංචඤ්ඤායතනයෙහි මගේ සිත ඇලෙන්නටත්, පැහැදෙන්නටත්, පිහිටන්නටත්, මිදෙන්නටත් පුළුවනැයි යන කාරණය තිබේ.’ ආනන්දය, ඉන් පසු මම විඤ්ඤාණඤ්චායතනයේ ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කළෙමි. අකිංචඤ්ඤායතනයේ ආනිසංසය අවබෝධ කරගෙන එය ප‍්‍රගුණ කළෙමි. ආනන්දය, ‘මේ ශාන්තයි’ කියා දකිද්දී අකිංචඤ්ඤායතනයෙහි මගේ සිත ඇලෙයි, පැහැදෙයි, පිහිටයි, මිදෙයි. ආනන්දය, මම සම්පූර්ණයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා ‘කිසිවක් නැතැයි’ යන අකිංචඤ්ඤායතනයට පැමිණ වාසය කරමි. ආනන්දය, මේ විහරණයෙන් වෙසෙන මට විඤ්ඤාණඤ්චායතනයට අදාළවූ සංඥා හා මනසිකාරයන් හටගනියි. එය මට බාධාවක් විය. ආනන්දය, යම් සේ සුව සේ සිටින කෙනෙකුට දුකක් ඇතිවී එය බාධාවක් වන්නේද, එපරිද්දෙන්ම මට විඤ්ඤාණඤ්චායතනයට අදාළ සංඥා හා මනසිකාරයන් හටගනියි. එය මට බාධාවක් විය.\n\nආනන්දය, මට මේ අදහස ඇති විය – ‘මම කෙසේ හෝ අකිංචඤ්ඤායතනය සම්පූර්ණයෙන් ඉක්මවා, නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වාසය කරන්නේ නම් ඉතා යෙහෙකි’. ආනන්දය, ‘මේ ශාන්තයි’ කියා දකිද්දී නේවසඤ්ඤානාසඤ්ඤායතනයෙහි මගේ සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, මිදෙන්නට නොපෙළඹෙයි. ආනන්දය, මට මේ අදහස ඇති විය – ‘මගේ සිත නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නොඇලෙන්නේ, නොපැහැදෙන්නේ, නොපිහිටන්නේ, ‘මේ ශාන්තයි’ කියා දකිද්දීත් මිදෙන්නට නොපෙළඹෙන්නේ කුමක් හේතුවෙන්ද, කුමක් ප‍්‍රත්‍යය කරගෙනද?’ ආනන්දය, මට මේ අදහස ඇති විය – ‘මම අකිංචඤ්ඤායතනයේ ආදීනවය නිසි ලෙස දැක නොතිබුණෙමි. එය බහුල වශයෙන් මෙනෙහි නොකළෙමි. නේවසඤ්ඤානාසඤ්ඤායතනයේ ආනිසංසය මට අවබෝධ වී නොතිබුණි. එය මා විසින් ප‍්‍රගුණ කර තිබුණේ නැත. එබැවින් ‘මේ ශාන්තයි’ කියා දකිද්දීත් නේවසඤ්ඤානාසඤ්ඤායතනයෙහි මගේ සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, මිදෙන්නට නොපෙළඹෙයි.’ ආනන්දය, මට මේ අදහස ඇති විය – ‘යම් හෙයකින් මම අකිංචඤ්ඤායතනයේ ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කරන්නටත්, නේවසඤ්ඤානාසඤ්ඤායතනයේ ආනිසංසය අවබෝධ කරගෙන එය ප‍්‍රගුණ කරන්නටත් සමත් වුවහොත්, එවිට ‘මේ ශාන්තයි’ කියා දකිද්දී නේවසඤ්ඤානාසඤ්ඤායතනයෙහි මගේ සිත ඇලෙන්නටත්, පැහැදෙන්නටත්, පිහිටන්නටත්, මිදෙන්නටත් පුළුවනැයි යන කාරණය තිබේ.’ ආනන්දය, ඉන් පසු මම අකිංචඤ්ඤායතනයේ ආදීනවය දැක එය බහුල වශයෙන් මෙනෙහි කළෙමි. නේවසඤ්ඤානාසඤ්ඤායතනයේ ආනිසංසය අවබෝධ කරගෙන එය ප‍්‍රගුණ කළෙමි. ආනන්දය, ‘මේ ශාන්තයි’ කියා දකිද්දී නේවසඤ්ඤානාසඤ්ඤායතනයෙහි මගේ සිත ඇලෙයි, පැහැදෙයි, පිහිටයි, මිදෙයි. ආනන්දය, මම සම්පූර්ණයෙන් අකිංචඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වාසය කරමි. ආනන්දය, මේ විහරණයෙන් වෙසෙන මට අකිංචඤ්ඤායතනයට අදාළවූ සංඥා හා මනසිකාරයන් හටගනියි. එය මට බාධාවක් විය. ආනන්දය, යම් සේ සුව සේ සිටින කෙනෙකුට දුකක් ඇතිවී එය බාධාවක් වන්නේද, එපරිද්දෙන්ම මට අකිංචඤ්ඤායතනයට අදාළ සංඥා හා මනසිකාරයන් හටගනියි. එය මට බාධාවක් විය.\n\nආනන්දය, මට මේ අදහස ඇති විය – ‘මම කෙසේ හෝ නේවසඤ්ඤානාසඤ්ඤායතනය සම්පූර්ණයෙන් ඉක්මවා, සංඥාවේදයිතනිරෝධයට පැමිණ වාසය කරන්නේ නම් ඉතා යෙහෙකි’. ආනන්දය, ‘මේ ශාන්තයි’ කියා දකිද්දී සංඥාවේදයිතනිරෝධයෙහි මගේ සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, මිදෙන්නට නොපෙළඹෙයි. ආනන්දය, මට මේ අදහස ඇති විය – ‘මගේ සිත සංඥාවේදයිතනිරෝධයෙහි නොඇලෙන්නේ, නොපැහැදෙන්නේ, නොපිහිටන්නේ, ‘මේ ශාන්තයි’ කියා දකිද්දීත් මිදෙන්නට නොපෙළඹෙන්නේ කුමක් හේතුවෙන්ද, කුමක් ප‍්‍රත්‍යය කරගෙනද?’ ආනන්දය, මට මේ අදහස ඇති විය – ‘මම නේවසඤ්ඤානාසඤ්ඤායතනයේ ආදීනවය නිසි ලෙස දැක නොතිබුණෙමි. එය බහුල වශයෙන් මෙනෙහි නොකළෙමි. සංඥාවේදයිතනිරෝධයේ ආනිසංසය මට අවබෝධ වී නොතිබුණි. එය මා විසින් ප‍්‍රගුණ කර තිබුණේ නැත.\n\nඑබැවින් සංඥා වේදයිත නිරෝධය ශාන්තයයි දකිමින් ද, මාගේ සිත එයට නොපැන්නේය, නොපැහැදුණේය, නොපිහිටියේය, නොමිදුණේය. ආනන්දය, මට මේ අදහස පහළ විය: 'යම් හෙයකින් මා නේවසංඥානාසංඥායතනයෙහි ආදීනවය දැක, එය බහුල වශයෙන් සලකන්නේ නම්, සංඥා වේදයිත නිරෝධයෙහි ආනිසංසය ලබාගෙන, එය සේවනය කරන්නේ නම්, සංඥා වේදයිත නිරෝධය ශාන්තයයි දකිමින් මාගේ සිත එයට පැන, පැහැදී, පිහිටා, මිදෙනු ඇත යන කරුණ සිදුවිය හැකියි.' ආනන්දය, පසුව මා නේවසංඥානාසංඥායතනයෙහි ආදීනවය දැක, එය බහුල වශයෙන් සිදු කළෙමි. සංඥා වේදයිත නිරෝධයෙහි ආනිසංසය ලබාගෙන එය සේවනය කළෙමි. ආනන්දය, එසේ වූ මාගේ සිත සංඥා වේදයිත නිරෝධය ශාන්තයයි දකිමින් එයට පනියි, පහදියි, පිහිටයි, මිදෙයි. ආනන්දය, එසේ මම සම්පූර්ණයෙන්ම නේවසංඥානාසංඥායතනය ඉක්මවා, සංඥා වේදයිත නිරෝධය උපසම්පදා කොට වාසය කළෙමි. ප්‍රඥාවෙන් දැක මාගේ ආශ්‍රවයෝ ක්ෂය භාවයට පත් වූහ.\n\nආනන්දය, යම්තාක් කල් මා මේ නව අනුපූර්ව විහාර සමාපත්ති මෙසේ අනුලෝම ප්‍රතිලෝම වශයෙන් සමවදින්නටත්, එයින් නැගිටින්නටත් නොහැකි වුණිද, ආනන්දය, එතෙක් කල් මා දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ලෝකයා තුළ 'අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළෙමි'යි ප්‍රතිඥා දුන්නේ නැත. ආනන්දය, යම් කලක පටන් මා මේ නව අනුපූර්ව විහාර සමාපත්ති මෙසේ අනුලෝම ප්‍රතිලෝම වශයෙන් සමවදින්නටත්, එයින් නැගිටින්නටත් හැකි වුණිද, එවිට ආනන්දය, මා දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ලෝකයා තුළ 'අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළෙමි'යි ප්‍රතිඥා දුන්නෙමි. මා හට දැනීමත්, දැකීමත් පහළ විය – 'මාගේ චේතෝවිමුක්තිය නොසෙල්වෙන සුළුය. මෙය අවසාන ඉපදීමයි. දැන් නැවත භවයක් නැත.'",
      "paliTitle": "Tapussasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Mahāvaggo catuttho. Tassuddānaṃ – Dve vihārā ca nibbānaṃ, gāvī jhānena pañcamaṃ; Ānando brāhmaṇā devo, nāgena tapussena cāti.",
    "english": "",
    "sinhala": ""
  }
}