{
  "id": "an9.5",
  "title": {
    "pali": "Sāmaññavaggo",
    "english": "The Chapter on Asceticism",
    "sinhala": "ශ්‍රමණභාව වග්ගය"
  },
  "sections": [
    {
      "number": 42,
      "pali": "Ekaṃ samayaṃ āyasmā ānando kosambiyaṃ viharati ghositārāme. Atha kho āyasmā udāyī yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā udāyī āyasmantaṃ ānandaṃ etadavoca – ‘‘vuttamidaṃ, āvuso, pañcālacaṇḍena devaputtena – ‘‘Sambādhe gataṃ [sambādhe vata (sī.)] okāsaṃ, avidvā bhūrimedhaso; Yo jhānamabujjhi buddho, paṭilīnanisabho munī’’ti. ‘‘Katamo, āvuso, sambādho, katamo sambādhe okāsādhigamo vutto bhagavatā’’ti? ‘‘Pañcime, āvuso, kāmaguṇā sambādho vutto bhagavatā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Ime kho, āvuso, pañca kāmaguṇā sambādho vutto bhagavatā. ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha vitakkavicārā aniruddhā honti, ayamettha sambādho. ‘‘Puna caparaṃ, āvuso, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha pīti aniruddhā hoti, ayamettha sambādho. ‘‘Puna caparaṃ, āvuso, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha upekkhāsukhaṃ aniruddhaṃ hoti, ayamettha sambādho. ‘‘Puna caparaṃ, āvuso, bhikkhu sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha rūpasaññā aniruddhā hoti, ayamettha sambādho. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha ākāsānañcāyatanasaññā aniruddhā hoti, ayamettha sambādho. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha viññāṇañcāyatanasaññā aniruddhā hoti, ayamettha sambādho. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha ākiñcaññāyatanasaññā aniruddhā hoti, ayamettha sambādho. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā pariyāyena. Tatrāpatthi sambādho. Kiñca tattha sambādho? Yadeva tattha nevasaññānāsaññāyatanasaññā aniruddhā hoti, ayamettha sambādho. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ettāvatāpi kho, āvuso, sambādhe okāsādhigamo vutto bhagavatā nippariyāyenā’’ti. Paṭhamaṃ.",
      "english": "At one time, the venerable Ānanda was staying in Kosambi, at Ghosita's Park. Then the venerable Udāyī approached the venerable Ānanda; having approached, he exchanged friendly greetings with the venerable Ānanda. After concluding the courteous and memorable conversation, he sat down to one side. Seated to one side, the venerable Udāyī said to the venerable Ānanda: \"Friend, this was spoken by the devaputta Pañcālacaṇḍa: 'He who has reached a state of liberation within confinement, though he may be considered ignorant by others, possesses vast wisdom; the Buddha who has fully awakened to jhānas, the sage whose senses are withdrawn like a bull at rest.' \" \"Friend, what is this confinement, and what is this attainment of space within confinement, as declared by the Blessed One?\"\n\n\"Friend, these five strands of sensual pleasure are declared by the Blessed One to be confinement. Which five? Forms cognizable by the eye that are desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; sounds cognizable by the ear; scents cognizable by the nose; tastes cognizable by the tongue; tactile objects cognizable by the body that are desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing. These five strands of sensual pleasure, friend, are declared by the Blessed One to be confinement.\"\n\n\"Here, friend, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, with initial application and sustained application, born of seclusion, filled with rapture and pleasure, enters and dwells in the first jhāna. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, by way of a gradual approach. Even there, there is still confinement. And what is that confinement there? It is that the initial application of mind and sustained application of mind are not yet ceased. This is the confinement here.\"\n\n\"Further, friend, with the subsiding of initial application and sustained application, with internal purification and unification of mind, without initial application and sustained application, born of concentration, filled with rapture and pleasure, a bhikkhu enters and dwells in the second jhāna. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, by way of a gradual approach. Even there, there is still confinement. And what is that confinement there? It is that rapture is not yet ceased. This is the confinement here.\"\n\n\"Further, friend, with the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body, of which the Noble Ones declare: 'He dwells in equanimity, mindful, and at ease,' a bhikkhu enters and dwells in the third jhāna. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, by way of a gradual approach. Even there, there is still confinement. And what is that confinement there? It is that equanimous pleasure is not yet ceased. This is the confinement here.\"\n\n\"Further, friend, with the abandoning of pleasure and pain, and with the prior disappearance of joy and sorrow, a bhikkhu enters and dwells in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, by way of a gradual approach. Even there, there is still confinement. And what is that confinement there? It is that the perception of form is not yet ceased. This is the confinement here.\"\n\n\"Further, friend, with the complete transcendence of perceptions of form, with the disappearance of perceptions of sensory impact, with non-attention to perceptions of diversity, perceiving 'space is infinite,' a bhikkhu enters and dwells in the sphere of infinite space. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, by way of a gradual approach. Even there, there is still confinement. And what is that confinement there? It is that the perception of the sphere of infinite space is not yet ceased. This is the confinement here.\"\n\n\"Further, friend, with the complete transcendence of the sphere of infinite space, perceiving 'consciousness is infinite,' a bhikkhu enters and dwells in the sphere of infinite consciousness. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, by way of a gradual approach. Even there, there is still confinement. And what is that confinement there? It is that the perception of the sphere of infinite consciousness is not yet ceased. This is the confinement here.\"\n\n\"Further, friend, with the complete transcendence of the sphere of infinite consciousness, perceiving 'there is nothing,' a bhikkhu enters and dwells in the sphere of nothingness. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, by way of a gradual approach. Even there, there is still confinement. And what is that confinement there? It is that the perception of the sphere of nothingness is not yet ceased. This is the confinement here.\"\n\n\"Further, friend, with the complete transcendence of the sphere of nothingness, a bhikkhu enters and dwells in the sphere of neither-perception-nor-non-perception. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, by way of a gradual approach. Even there, there is still confinement. And what is that confinement there? It is that the perception of the sphere of neither-perception-nor-non-perception is not yet ceased. This is the confinement here.\"\n\n\"Further, friend, with the complete transcendence of the sphere of neither-perception-nor-non-perception, a bhikkhu enters and dwells in the cessation of perception and feeling, and having seen with wisdom, his taints are utterly destroyed. To this extent, friend, the attainment of space within confinement is declared by the Blessed One, without a gradual approach.\"",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කොසඹෑ නුවර ඝෝසිතාරාමයෙහි වැඩවසන සේක. එසමයෙහි ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ සමග සතුටු වූහ. සතුටු විය යුතු සිහි කටයුතු කථා බස් හුවමාරු කරගෙන එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් උදායි ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: ‘‘ඇවැත්නි, පඤ්චාලචණ්ඩ නම් දෙව්පුත් විසින් මෙසේ කියන ලද්දකි: ‘මහත් ප්‍රඥාවක් නැති අවිද්‍යා පුද්ගලයා සම්බාධයකට පැමිණි තැනක නිදහස් අවකාශයක් නොදකියි. යම් බුදු කෙනෙක් ධ්‍යානය අවබෝධ කළාහු ද, උන්වහන්සේ කෙලෙස් වලින් ඉවත්ව, සන්සුන් වූ මුනිවරයෙකි.’’’ ‘‘ඇවැත්නි, සම්බාධය නම් කුමක් ද? භාග්‍යවතුන් වහන්සේ විසින් සම්බාධයෙහිදී අවකාශය ලැබීම කුමක් යැයි දේශනා කරන ලද්දේ ද?’’\n\n‘‘ඇවැත්නි, මේ පස්කම් ගුණ සම්බාධය යැයි භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලදී. ඒ පස කුමක් ද? ඇසින් දැනගත යුතු, ඉෂ්ට වූ, කාන්ත වූ, මන වඩන, ප්‍රිය ස්වරූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන රූප; කනින් දැනගත යුතු ශබ්ද; නාසයෙන් දැනගත යුතු ගන්ධ; දිවෙන් දැනගත යුතු රස; කයින් දැනගත යුතු, ඉෂ්ට වූ, කාන්ත වූ, මන වඩන, ප්‍රිය ස්වරූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන ස්පර්ශයෝ ය. ඇවැත්නි, මේ පස්කම් ගුණ සම්බාධය යැයි භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලදී.\n\n‘‘ඇවැත්නි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුඛය සහිත වූ පළමු ධ්‍යානයට එළඹ වාසය කරයි. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් දේශනා කරන ලදී. එහි ද සම්බාධයක් ඇත. එහි කුමක් ද සම්බාධය? යම් හෙයකින් එහි විතර්ක විචාරයන් නිරුද්ධ වී නොමැත්තේ ද, මෙය එහි සම්බාධය යි.\n\n‘‘ඇවැත්නි, නැවතත්, භික්ෂුව විතර්ක විචාරයන් සන්සිඳවීමෙන්, තමා තුළ පැහැදීම ඇතිවීමෙන්, සිත එකඟවීමෙන්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සුඛය සහිත වූ දෙවන ධ්‍යානයට එළඹ වාසය කරයි. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් දේශනා කරන ලදී. එහි ද සම්බාධයක් ඇත. එහි කුමක් ද සම්බාධය? යම් හෙයකින් එහි ප්‍රීතිය නිරුද්ධ වී නොමැත්තේ ද, මෙය එහි සම්බාධය යි.\n\n‘‘ඇවැත්නි, නැවතත්, භික්ෂුව ප්‍රීතියට ද විරාග කිරීමෙන්, උපේක්ෂාවෙන් යුක්තව වාසය කරයි. සිහි කල්පනාවෙන් හා මනා දැනුමෙන් යුක්තව, කයින් සුවය විඳියි. ආර්යයන් වහන්සේලා ‘උපේක්ෂාවෙන් යුක්ත වූ සිහි නුවණ ඇතිව සුවයෙන් වාසය කරයි’ යැයි යම් ධ්‍යානයක් ගැන කියත් ද, එබඳු තෙවන ධ්‍යානයට එළඹ වාසය කරයි. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් දේශනා කරන ලදී. එහි ද සම්බාධයක් ඇත. එහි කුමක් ද සම්බාධය? යම් හෙයකින් එහි උපේක්ෂා-සහගත සුවය නිරුද්ධ වී නොමැත්තේ ද, මෙය එහි සම්බාධය යි.\n\n‘‘ඇවැත්නි, නැවතත්, භික්ෂුව සුවය ද ප්‍රහාණය කිරීමෙන්, දුක ද ප්‍රහාණය කිරීමෙන්, කලින් ම සොම්නස් දොම්නස් නැති වී යාමෙන්, දුක් රහිත වූ, සුව රහිත වූ, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිවුවන ධ්‍යානයට එළඹ වාසය කරයි. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් දේශනා කරන ලදී. එහි ද සම්බාධයක් ඇත. එහි කුමක් ද සම්බාධය? යම් හෙයකින් එහි රූප සංඥාව නිරුද්ධ වී නොමැත්තේ ද, මෙය එහි සම්බාධය යි.\n\n‘‘ඇවැත්නි, නැවතත්, භික්ෂුව සියලු රූප සංඥාවන් සම්පූර්ණයෙන් ඉක්මවා, ප්‍රතිඝ සංඥාවන් අන්තර්ගත නොකොට, නානත්ව සංඥාවන් මෙනෙහි නොකොට, ‘ආකාශය අනන්ත ය’යි (මෙනෙහි කරමින්) ආකාශානන්ත්‍යායතනයට එළඹ වාසය කරයි. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් දේශනා කරන ලදී. එහි ද සම්බාධයක් ඇත. එහි කුමක් ද සම්බාධය? යම් හෙයකින් එහි ආකාශානන්ත්‍යායතන සංඥාව නිරුද්ධ වී නොමැත්තේ ද, මෙය එහි සම්බාධය යි.\n\n‘‘ඇවැත්නි, නැවතත්, භික්ෂුව සියලු ආකාශානන්ත්‍යායතනය සම්පූර්ණයෙන් ඉක්මවා, ‘විඤ්ඤාණය අනන්ත ය’යි (මෙනෙහි කරමින්) විඤ්ඤාණානන්ත්‍යායතනයට එළඹ වාසය කරයි. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් දේශනා කරන ලදී. එහි ද සම්බාධයක් ඇත. එහි කුමක් ද සම්බාධය? යම් හෙයකින් එහි විඤ්ඤාණානන්ත්‍යායතන සංඥාව නිරුද්ධ වී නොමැත්තේ ද, මෙය එහි සම්බාධය යි.\n\n‘‘ඇවැත්නි, නැවතත්, භික්ෂුව සියලු විඤ්ඤාණානන්ත්‍යායතනය සම්පූර්ණයෙන් ඉක්මවා, ‘කිසිවක් නැතැ’යි (මෙනෙහි කරමින්) ආකිංචඤ්ඤායතනයට එළඹ වාසය කරයි. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් දේශනා කරන ලදී. එහි ද සම්බාධයක් ඇත. එහි කුමක් ද සම්බාධය? යම් හෙයකින් එහි ආකිංචඤ්ඤායතන සංඥාව නිරුද්ධ වී නොමැත්තේ ද, මෙය එහි සම්බාධය යි.\n\n‘‘ඇවැත්නි, නැවතත්, භික්ෂුව සියලු ආකිංචඤ්ඤායතනය සම්පූර්ණයෙන් ඉක්මවා, නේවසංඥානාසංඥායතනයට එළඹ වාසය කරයි. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් දේශනා කරන ලදී. එහි ද සම්බාධයක් ඇත. එහි කුමක් ද සම්බාධය? යම් හෙයකින් එහි නේවසංඥානාසංඥායතන සංඥාව නිරුද්ධ වී නොමැත්තේ ද, මෙය එහි සම්බාධය යි.\n\n‘‘ඇවැත්නි, නැවතත්, භික්ෂුව සියලු නේවසංඥානාසංඥායතනය සම්පූර්ණයෙන් ඉක්මවා, සංඥාවේ-දයිත නිරෝධයට එළඹ වාසය කරයි, ඔහුගේ ආශ්‍රවයෝ ප්‍රඥාවෙන් දැක ක්ෂය වී යෙත්. ඇවැත්නි, මෙපමණකින් ද සම්බාධයෙහිදී අවකාශය ලැබීම භාග්‍යවතුන් වහන්සේ විසින් නිරූපධි වශයෙන් (අන් කිසිවක් ඉතිරි නොවන පරිදි) දේශනා කරන ලදී.’’",
      "paliTitle": "Sambādhasuttaṃ",
      "englishTitle": "The Discourse on Confinement",
      "sinhalaTitle": "සම්\\u200dබාධ සූත්\\u200dරය"
    },
    {
      "number": 43,
      "pali": "‘‘‘Kāyasakkhī kāyasakkhī’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, kāyasakkhī vutto bhagavatā’’ti? ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Yathā yathā ca tadāyatanaṃ tathā tathā naṃ kāyena phusitvā viharati. Ettāvatāpi kho, āvuso, kāyasakkhī vutto bhagavatā pariyāyena. ‘‘Puna caparaṃ, āvuso, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ… tatiyaṃ jhānaṃ… catutthaṃ jhānaṃ upasampajja viharati. Yathā yathā ca tadāyatanaṃ tathā tathā naṃ kāyena phusitvā viharati. Ettāvatāpi kho, āvuso, kāyasakkhī vutto bhagavatā pariyāyena. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Yathā yathā ca tadāyatanaṃ tathā tathā naṃ kāyena phusitvā viharati. Ettāvatāpi kho, āvuso, kāyasakkhī vutto bhagavatā pariyāyena…pe…. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Yathā yathā ca tadāyatanaṃ tathā tathā naṃ kāyena phusitvā viharati. Ettāvatāpi kho, āvuso, kāyasakkhī vutto bhagavatā nippariyāyenā’’ti. Dutiyaṃ.",
      "english": "“A body-witness, a body-witness”—so it is said, friend. In what way, friend, has the Blessed One described one as a body-witness?”\n\n“Here, friend, a monastic, quite secluded from sensual pleasures, secluded from unwholesome states, enters upon and abides in the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, and filled with rapture and happiness. Just as that attainment is, so too does he experience it directly with his mental body and abides. To this extent, friend, the Blessed One has described one as a body-witness in a qualified sense.\n\n“Furthermore, friend, a monastic, with the stilling of applied thought and sustained thought, with internal placidness and unification of mind, enters upon and abides in the second jhāna, which is without applied thought and sustained thought, born of concentration, and filled with rapture and happiness. Furthermore, with the fading of rapture, he abides in equanimity, mindful and clearly comprehending, and experiences happiness with the body; he enters upon and abides in the third jhāna of which the Noble Ones declare: ‘He abides in equanimity, mindful, and happy.’ Furthermore, with the abandoning of pleasure and pain, and with the previous disappearance of joy and sorrow, he enters upon and abides in the fourth jhāna, which is neither painful nor pleasant, and purified by equanimity and mindfulness. Just as that attainment is, so too does he experience it directly with his mental body and abides. To this extent, friend, the Blessed One has described one as a body-witness in a qualified sense.\n\n“Furthermore, friend, a monastic, with the complete transcendence of perceptions of form, with the disappearance of perceptions of sensory impingement, and with non-attention to perceptions of diversity, thinking 'space is infinite,' enters upon and abides in the sphere of infinite space. Just as that attainment is, so too does he experience it directly with his mental body and abides. To this extent, friend, the Blessed One has described one as a body-witness in a qualified sense. Furthermore, friend, a monastic, with the complete transcendence of the sphere of infinite space, thinking 'consciousness is infinite,' enters upon and abides in the sphere of infinite consciousness. Just as that attainment is, so too does he experience it directly with his mental body and abides. To this extent, friend, the Blessed One has described one as a body-witness in a qualified sense. Furthermore, friend, a monastic, with the complete transcendence of the sphere of infinite consciousness, thinking 'there is nothing,' enters upon and abides in the sphere of nothingness. Just as that attainment is, so too does he experience it directly with his mental body and abides. To this extent, friend, the Blessed One has described one as a body-witness in a qualified sense. Furthermore, friend, a monastic, with the complete transcendence of the sphere of nothingness, enters upon and abides in the sphere of neither perception nor non-perception. Just as that attainment is, so too does he experience it directly with his mental body and abides. To this extent, friend, the Blessed One has described one as a body-witness in a qualified sense.\n\n“Furthermore, friend, a monastic, with the complete transcendence of the sphere of neither perception nor non-perception, enters upon and abides in the cessation of perception and feeling, and having seen with wisdom, his defilements are utterly destroyed. Just as that attainment is, so too does he experience it directly with his mental body and abides. To this extent, friend, the Blessed One has described one as a body-witness in the ultimate sense.”",
      "sinhala": "‘ආයුෂ්මත්නි, ‘කායසක්ඛී, කායසක්ඛී’ යැයි කියනු ලැබේ. ආයුෂ්මත්නි, භාග්‍යවතුන් වහන්සේ විසින් කොපමණ ප්‍රමාණයකින් නම් කායසක්ඛී යැයි වදාළ සේක්ද?’\n\nආයුෂ්මත්නි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වී, අකුසල ධර්මයන්ගෙන් වෙන්වී, විතර්ක සහිත වූද, විචාර සහිත වූද, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති, පළමු ධ්‍යානයට එළඹ වාසය කරයි. ඒ ආයතනය කෙසේ නම් වේද, එසේම එය කයින් ස්පර්ශ කරමින් වාසය කරයි. ආයුෂ්මත්නි, මේ ප්‍රමාණයෙන්ද භාග්‍යවතුන් වහන්සේ විසින් පර්‍යාය වශයෙන් කායසක්ඛී යැයි වදාළ සේක.\n\nතවද ආයුෂ්මත්නි, භික්ෂුව විතර්ක විචාරයන් සංසිඳවීමෙන්, තමා තුළම පැහැදීම ඇති, සිතේ එකඟ බව ඇති, විතර්ක රහිත වූද, විචාර රහිත වූද, සමාධියෙන් හටගත් ප්‍රීති සුඛය ඇති, දෙවෙනි ධ්‍යානයටද...පෙ... ප්‍රීතිය දුරුකිරීමෙන් උපේක්ෂා සහිතව වාසය කරන, සිහි නුවණින් යුක්තව, සැප විඳින, ආර්යයන් වහන්සේලා ‘උපේක්ෂා සහිතව සිහි නුවණින් යුක්තව සැප විහරණය කරන්නා’ යැයි කියන, තුන්වෙනි ධ්‍යානයටද...පෙ... සැපය දුරුකිරීමෙන්ද, දුක දුරුකිරීමෙන්ද, පෙර සිටි සොම්නස් දොම්නස් නැති කිරීමෙන්ද, දුක් නැති, සැප නැති, උපේක්ෂා සතියෙන් පිරිසිදු වූ සිව්වෙනි ධ්‍යානයටද එළඹ වාසය කරයි. ඒ ආයතනය කෙසේ නම් වේද, එසේම එය කයින් ස්පර්ශ කරමින් වාසය කරයි. ආයුෂ්මත්නි, මේ ප්‍රමාණයෙන්ද භාග්‍යවතුන් වහන්සේ විසින් පර්‍යාය වශයෙන් කායසක්ඛී යැයි වදාළ සේක.\n\nතවද ආයුෂ්මත්නි, භික්ෂුව සියලු රූප සංඥාවන් ඉක්මවීමෙන්, ප්‍රතිඝ සංඥාවන් අතුරුදහන් කිරීමෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන් ‘අනන්ත වූ ආකාශය’ යැයි මෙනෙහි කරමින්, ආකාශානන්ත්‍යායතනයට එළඹ වාසය කරයි. ඒ ආයතනය කෙසේ නම් වේද, එසේම එය කයින් ස්පර්ශ කරමින් වාසය කරයි. ආයුෂ්මත්නි, මේ ප්‍රමාණයෙන්ද භාග්‍යවතුන් වහන්සේ විසින් පර්‍යාය වශයෙන් කායසක්ඛී යැයි වදාළ සේක. තවද විඥානානන්ත්‍යායතනයටද, ආකිඤ්චන්‍යායතනයටද, නේවසඤ්ඤානාසඤ්ඤායතනයටද එළඹ වාසය කරන විටද පර්‍යාය වශයෙන් කායසක්ඛී යැයි වදාළ සේක...පෙ...\n\nතවද ආයුෂ්මත්නි, භික්ෂුව සියලු නේවසඤ්ඤානාසඤ්ඤායතනයද ඉක්මවා, සඤ්ඤා වේදයිත නිරෝධයට එළඹ වාසය කරයි. ඔහුගේ ආශ්‍රවයෝද ප්‍රඥාවෙන් දැකීමෙන් ක්ෂය වී ගොස් ඇත්තාහ. ඒ ආයතනය කෙසේ නම් වේද, එසේම එය කයින් ස්පර්ශ කරමින් වාසය කරයි. ආයුෂ්මත්නි, මේ ප්‍රමාණයෙන්ද භාග්‍යවතුන් වහන්සේ විසින් අනිපර්‍යාය වශයෙන් කායසක්ඛී යැයි වදාළ සේක.",
      "paliTitle": "Kāyasakkhīsuttaṃ",
      "englishTitle": "The Body-Witness Discourse",
      "sinhalaTitle": "කාය සාක්‍ෂි සූත්‍රය"
    },
    {
      "number": 44,
      "pali": "‘‘‘Paññāvimutto paññāvimutto’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, paññāvimutto vutto bhagavatā’’ti? ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati, paññāya ca naṃ pajānāti. Ettāvatāpi kho, āvuso, paññāvimutto vutto bhagavatā pariyāyena…pe…. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti, paññāya ca naṃ pajānāti. Ettāvatāpi kho, āvuso, paññāvimutto vutto bhagavatā nippariyāyenā’’ti. Tatiyaṃ.",
      "english": "“‘Liberated by wisdom, liberated by wisdom,’ friend, is spoken of. To what extent, friend, has one liberated by wisdom been declared by the Blessed One?”\n\n“Here, friend, a monk, having quite secluded himself from sensual pleasures, secluded himself from unwholesome states, attains and dwells in the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, filled with rapture and happiness. And he understands this with wisdom. He similarly progresses through the successive meditative attainments up to the dimension of neither perception nor non-perception, understanding each with wisdom. To this extent also, friend, one liberated by wisdom has been declared by the Blessed One, by way of a gradual teaching.\n\nFurthermore, friend, a monk, having completely transcended the dimension of neither perception nor non-perception, attains and dwells in the cessation of perception and feeling. And for him, seeing with wisdom, his taints are utterly destroyed. And he understands this with wisdom. To this extent also, friend, one liberated by wisdom has been declared by the Blessed One, unequivocally.”",
      "sinhala": "‘ප්‍රඥාවෙන් මිදුණේය, ප්‍රඥාවෙන් මිදුණේය’ යැයි ආයුෂ්මතුනි, කියනු ලැබේ. ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ විසින් කොපමණ ප්‍රමාණයකින් ප්‍රඥාවෙන් මිදුණේ යැයි දේශනා කොට වදාළ සේක් ද?\n\nආයුෂ්මතුනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති, ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි, ප්‍රඥාවෙන් එය දනී. මෙතෙකින් ද ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ විසින් ප්‍රථම ධ්‍යානය, දෙවෙනි, තෙවෙනි, සිව්වෙනි ධ්‍යාන මෙන්ම ආකාසානඤ්චායතන, විඤ්ඤාණඤ්චායතන, ආකිඤ්චඤ්ඤායතන, නේවසඤ්ඤානාසඤ්ඤායතන යන අරූප සමාපත්ති ප්‍රඥාවෙන් දැනීමෙන් ලැබෙන පර්යාය වශයෙන් වූ ප්‍රඥා විමුක්තිය දේශනා කොට වදාළ සේක.\n\nතවද, ආයුෂ්මතුනි, භික්ෂුව සියලු නේවසඤ්ඤානාසඤ්ඤායතනය සම්පූර්ණයෙන් ඉක්මවා, සංඥා හා වේදනා නිරෝධයට පැමිණ වාසය කරයි. ප්‍රඥාවෙන් එය දැකීමෙන් ඔහුගේ ආශ්‍රවයෝ පිරිහී යති. ප්‍රඥාවෙන් එය දනී. මෙතෙකින් ද ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ විසින් නිපර්යාය වශයෙන් ප්‍රඥාවෙන් මිදුණේ යැයි දේශනා කොට වදාළ සේක.",
      "paliTitle": "Paññāvimuttasuttaṃ",
      "englishTitle": "Discourse on the Wisdom-Liberated",
      "sinhalaTitle": "ප්‍රඥා විමුක්ත සූත්‍රය"
    },
    {
      "number": 45,
      "pali": "‘‘‘Ubhatobhāgavimutto ubhatobhāgavimutto’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, ubhatobhāgavimutto vutto bhagavatā’’ti? ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Yathā yathā ca tadāyatanaṃ tathā tathā naṃ kāyena phusitvā viharati, paññāya ca naṃ pajānāti. Ettāvatāpi kho, āvuso, ubhatobhāgavimutto vutto bhagavatā pariyāyena…pe…. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Yathā yathā ca tadāyatanaṃ tathā tathā naṃ kāyena phusitvā viharati, paññāya ca naṃ pajānāti. Ettāvatāpi kho, āvuso, ubhatobhāgavimutto vutto bhagavatā nippariyāyenā’’ti. Catutthaṃ.",
      "english": "“Friend, it is said, ‘liberated in both ways, liberated in both ways.’ To what extent, friend, has the Blessed One declared one to be liberated in both ways?”\n\n“Here, friend, a monk — quite secluded from sensual pleasures, secluded from unwholesome states, with thought and examination, born of seclusion, full of rapture and pleasure — enters and abides in the first meditative absorption. And in whatever way that sphere is, in that way he experiences it with the body and understands it with wisdom. To this extent, friend, the Blessed One has declared one to be liberated in both ways conditionally, and so on.\n\nFurthermore, friend, a monk, having completely transcended the sphere of neither perception nor non-perception, enters and abides in the cessation of perception and feeling; and having seen with wisdom, his effluents are destroyed. And in whatever way that sphere is, in that way he experiences it with the body and understands it with wisdom. To this extent, friend, the Blessed One has declared one to be liberated in both ways unconditionally.”",
      "sinhala": "‘ඇවැත්නි, ‘උභතෝභාගවිමුක්ත, උභතෝභාගවිමුක්ත’ යැයි කියනු ලැබේ. ඇවැත්නි, භාග‍්‍යවතුන් වහන්සේ විසින් කොපමණකින් නම් උභතෝභාගවිමුක්ත යැයි වදාරණ ලද්දේද?’\n\n‘ඇවැත්නි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප‍්‍රීතිය හා සැපය ඇති ප‍්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු යම් යම් අයුරකින් ඒ ආයතනය (ධ්‍යානය) කයින් ස්පර්ශ කරමින් වාසය කරයිද, එසේම ප‍්‍රඥාවෙන් එය අවබෝධ කරයි. ඇවැත්නි, මෙපමණකින්ද භාග‍්‍යවතුන් වහන්සේ විසින් ක්‍රමයෙන් උභතෝභාගවිමුක්ත යැයි වදාරණ ලදී.\n\n‘ඇවැත්නි, තවද භික්ෂුව නේවසංඥානාසංඥායතනයද මුළුමනින්ම ඉක්මවා, සංඥා වේදයිත නිරෝධයට පැමිණ වාසය කරයි. ප‍්‍රඥාවෙන් දැකීමෙන් ඔහුගේ ආශ්‍රවයෝ ක්ෂය වී යෙත්. ඔහු යම් යම් අයුරකින් ඒ ආයතනය (සංඥා වේදයිත නිරෝධය) කයින් ස්පර්ශ කරමින් වාසය කරයිද, එසේම ප‍්‍රඥාවෙන් එය අවබෝධ කරයි. ඇවැත්නි, මෙපමණකින්ද භාග‍්‍යවතුන් වහන්සේ විසින් නිරපේක්ෂව උභතෝභාගවිමුක්ත යැයි වදාරණ ලදී.’",
      "paliTitle": "Ubhatobhāgavimuttasuttaṃ",
      "englishTitle": "Discourse on Two-Fold Liberation",
      "sinhalaTitle": "දෙයාකාරයෙන් විමුක‌්ත සූත‌් ‍රය"
    },
    {
      "number": 46,
      "pali": "‘‘‘Sandiṭṭhiko dhammo sandiṭṭhiko dhammo’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, sandiṭṭhiko dhammo vutto bhagavatā’’ti? ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sandiṭṭhiko dhammo vutto bhagavatā pariyāyena…pe…. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ettāvatāpi kho, āvuso, sandiṭṭhiko dhammo vutto bhagavatā nippariyāyenā’’ti. Pañcamaṃ.",
      "english": "\"The Dhamma is said to be visible here and now, visible here and now, friend. To what extent, friend, has the Dhamma been declared by the Blessed One to be visible here and now?\"\n\n\"Here, friend, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters upon and dwells in the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, filled with rapture and happiness. Even to this extent, friend, the Dhamma has been declared by the Blessed One to be visible here and now, by way of an explanation. The same applies when he progressively attains and dwells in the second, third, and fourth jhānas, and then the spheres of infinite space, infinite consciousness, nothingness, and neither-perception-nor-non-perception.\"\n\n\"Furthermore, friend, a monk, by completely transcending the sphere of neither-perception-nor-non-perception, enters upon and dwells in the cessation of perception and feeling. And having seen with wisdom, his taints are utterly destroyed. Even to this extent, friend, the Dhamma has been declared by the Blessed One to be visible here and now, directly and unconditionally.\"",
      "sinhala": "\"ආයුෂ්මත්නි, 'මෙලොවදීම ප්‍රත්‍යක්ෂ වන ධර්මය, මෙලොවදීම ප්‍රත්‍යක්ෂ වන ධර්මය' යැයි කියනු ලැබේ. ආයුෂ්මත්නි, භාග්‍යවතුන් වහන්සේ විසින් මෙලොවදීම ප්‍රත්‍යක්ෂ වන ධර්මය විස්තර කරනු ලැබ ඇත්තේ කුමන ප්‍රමාණයකින්ද?\"\n\n\"ආයුෂ්මත්නි, මෙහිලා භික්ෂුවක් කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇතිව පළමු ධ්‍යානය උපසම්පදා කොට වාසය කරයි. ආයුෂ්මත්නි, මෙපමණකින්ද භාග්‍යවතුන් වහන්සේ විසින් මෙලොවදීම ප්‍රත්‍යක්ෂ වන ධර්මය පර්යාය ක්‍රමයෙන් වදාළ සේක.\n\nනැවතද, ආයුෂ්මත්නි, භික්ෂුවක් සියල්ල අතින් නේවසඤ්ඤානාසඤ්ඤායතනය සම්පූර්ණයෙන්ම ඉක්මවා, සංඥා වේදයිත නිරෝධයට සමවැද වාසය කරයි. ඔහුගේ ආශ්‍රවයන් ප්‍රඥාවෙන් දැකීමෙන් ක්ෂය වී ඇත. ආයුෂ්මත්නි, මෙපමණකින්ද භාග්‍යවතුන් වහන්සේ විසින් මෙලොවදීම ප්‍රත්‍යක්ෂ වන ධර්මය නිරවශේෂයෙන් වදාළ සේක.\"",
      "paliTitle": "Sandiṭṭhikadhammasuttaṃ",
      "englishTitle": "Discourse on Immediate Dhamma",
      "sinhalaTitle": "සන්දිට්ඨික ධර්ම සූත්‍රය"
    },
    {
      "number": 47,
      "pali": "‘‘‘Sandiṭṭhikaṃ nibbānaṃ sandiṭṭhikaṃ nibbāna’nti, āvuso, vuccati. Kittāvatā nu kho, āvuso, sandiṭṭhikaṃ nibbānaṃ vuttaṃ bhagavatā’’ti? ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, sandiṭṭhikaṃ nibbānaṃ vuttaṃ bhagavatā pariyāyena…pe…. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ettāvatāpi kho, āvuso, sandiṭṭhikaṃ nibbānaṃ vuttaṃ bhagavatā nippariyāyenā’’ti. Chaṭṭhaṃ.",
      "english": "“‘Nibbāna visible here and now, Nibbāna visible here and now’ it is said, friend. To what extent, friend, has Nibbāna visible here and now been declared by the Blessed One?”\n\n“Here, friend, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and abides in the first jhāna, which is accompanied by initial and sustained application, born of seclusion, filled with rapture and happiness. To this extent too, friend, Nibbāna visible here and now has been declared by the Blessed One in a figurative sense, and so forth through the higher meditative attainments. Furthermore, friend, a monk, having entirely transcended the dimension of neither perception nor non-perception, enters and abides in the cessation of perception and feeling, and having seen with wisdom, their defilements are extinguished. To this extent too, friend, Nibbāna visible here and now has been declared by the Blessed One in the ultimate sense.”",
      "sinhala": "\"ආයුෂ්මත්නි, 'සංදිट्ඨික නිබ්බාන, සංදිट्ඨික නිබ්බාන' යැයි කියනු ලැබේ. ආයුෂ්මත්නි, භාග්‍යවතුන්‌වහන්සේ විසින් කිනම් ප්‍රමාණයකින් නම් සංදිट्ඨික නිබ්බානය වදාළ සේක්ද?\"\n\n\"මෙහිලා ආයුෂ්මත්නි, භික්ෂුව කාමයන්ගෙන් මුළුමනින්ම වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීතිසහිත වූ සහ සුඛසහිත වූ පළමු ධ්‍යානයට පැමිණ වාසය කරයි. ආයුෂ්මත්නි, මෙපමණකින්ද භාග්‍යවතුන්‌වහන්සේ විසින් පර්යායක්‍රමයෙන් සංදිट्ඨික නිබ්බානය වදාළ සේක.\"\n\n\"තවද ආයුෂ්මත්නි, භික්ෂුව නේවසඤ්ඤානාසඤ්ඤායතනය සම්පූර්ණයෙන්ම ඉක්මවා, සංඥාවේ‌දයිත නිරෝධයට පැමිණ වාසය කරයි. ප්‍රඥාවෙන් දැකීමෙන් ඔහුගේ ආශ්‍රවයෝ ක්ෂය වී ඇත්තාහ. ආයුෂ්මත්නි, මෙපමණකින්ද භාග්‍යවතුන්‌වහන්සේ විසින් නිර්පර්යායක්‍රමයෙන් සංදිट्ඨික නිබ්බානය වදාළ සේක.\"",
      "paliTitle": "Sandiṭṭhikanibbānasuttaṃ",
      "englishTitle": "Discourse on Immediate Nirvana",
      "sinhalaTitle": "සන්දිට්ඨික නිර්වාණ සූත‍්‍රය"
    },
    {
      "number": 48,
      "pali": "‘‘‘Nibbānaṃ nibbāna’nti, āvuso, vuccati…pe…. Sattamaṃ.",
      "english": "‘Nibbāna, Nibbāna’ is spoken of, friends, and so on. The seventh.",
      "sinhala": "ඇවැත්නි, ‘නිවන, නිවන’ යැයි කියනු ලැබේ... මෙය සත්වන කරුණයි.",
      "paliTitle": "Nibbānasuttaṃ",
      "englishTitle": "Nibbana Sutta",
      "sinhalaTitle": "නිර්වාණ සූත්‍‍රය"
    },
    {
      "number": 49,
      "pali": "‘‘‘Parinibbānaṃ parinibbāna’nti…pe…. Aṭṭhamaṃ.",
      "english": "The eighth, titled: ‘The ultimate Nibbana, the ultimate Nibbana,’ and so forth.",
      "sinhala": "‘පරිනිර්වාණය, පරිනිර්වාණය’යි. අටවැන්නයි.",
      "paliTitle": "Parinibbānasuttaṃ",
      "englishTitle": "The Parinibbana Discourse",
      "sinhalaTitle": "පිරිනිර්‍වාණ සූත්‍රය"
    },
    {
      "number": 50,
      "pali": "‘‘‘Tadaṅganibbānaṃ tadaṅganibbāna’nti, āvuso, vuccati…pe…. Navamaṃ.",
      "english": "‘Nibbana through provisional cessation, Nibbana through provisional cessation’ – this is what is spoken of, friend.",
      "sinhala": "‘තදංගනිබ්බාණය, තදංගනිබ්බාණය’ යි, ආයුෂ්මත්නි, ආදී වශයෙන් කියනු ලැබේ. මෙය නවවෙනි කරුණයි.",
      "paliTitle": "Tadaṅganibbānasuttaṃ",
      "englishTitle": "Discourse on Temporary Nirvana",
      "sinhalaTitle": "තදංග නිබ්[ZWJ]බාන සූත[ZWJ]්‍රය"
    },
    {
      "number": 51,
      "pali": "‘‘‘Diṭṭhadhammanibbānaṃ diṭṭhadhammanibbāna’nti, āvuso, vuccati. Kittāvatā nu kho, āvuso diṭṭhadhammanibbānaṃ vuttaṃ bhagavatā’’ti? ‘‘Idhāvuso, bhikkhu vivicceva kāmehi …pe… paṭhamaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, diṭṭhadhammanibbānaṃ vuttaṃ bhagavatā pariyāyena …pe…. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ettāvatāpi kho, āvuso, diṭṭhadhammanibbānaṃ vuttaṃ bhagavatā nippariyāyenā’’ti. Dasamaṃ. ",
      "english": "‘Nibbana in this very life, Nibbana in this very life’—thus it is said, friend. To what extent, friend, has Nibbana in this very life been declared by the Blessed One?”\n\n“Here, friend, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhana, which is accompanied by applied thought and sustained thought, born of seclusion, and filled with rapture and pleasure. To this extent too, friend, Nibbana in this very life has been declared by the Blessed One conditionally, and likewise for the subsequent meditative attainments up to the dimension of nothingness.\n\nFurthermore, friend, a monk, by completely transcending the dimension of neither perception nor non-perception, enters and dwells in the cessation of perception and feeling. And having seen with wisdom, his defilements are utterly destroyed. To this extent too, friend, Nibbana in this very life has been declared by the Blessed One unconditionally.”",
      "sinhala": "‘දිට්ඨධම්මනිබ්බානය, දිට්ඨධම්මනිබ්බානය’යි, ආයුෂ්මතුනි, කියනු ලැබේ. ආයුෂ්මතුනි, භාග්‍යවතුන් වහන්සේ විසින් කොපමණ ප්‍රමාණයකින් නම් දිට්ඨධම්මනිබ්බානය දේශනා කර තිබේද?\n\nආයුෂ්මතුනි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම ...පෙ... පළමු ධ්‍යානයට පැමිණ වාසය කරයි. ආයුෂ්මතුනි, මෙපමණකින්ද භාග්‍යවතුන් වහන්සේ විසින් දිට්ඨධම්මනිබ්බානය පර්යාය වශයෙන් දේශනා කර තිබේ ...පෙ.... තවද, ආයුෂ්මතුනි, භික්ෂුව සියලු ආකාරයෙන් නේවසංඥානාසංඥායතනය ඉක්මවා, සංඥාවේ‍දයිතනිරෝධයට පැමිණ වාසය කරයි. ප්‍රඥාවෙන් දැකීමෙන් ඔහුගේ ආශ්‍රවයෝද ක්ෂය වී යත්. ආයුෂ්මතුනි, මෙපමණකින්ද භාග්‍යවතුන් වහන්සේ විසින් දිට්ඨධම්මනිබ්බානය නිප්පර්යාය වශයෙන් දේශනා කර තිබේ.",
      "paliTitle": "Diṭṭhadhammanibbānasuttaṃ",
      "englishTitle": "Discourse on Nirvana in this Very Life",
      "sinhalaTitle": "දිට්ඨධම්මනිබ්බාන සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Sāmaññavaggo pañcamo. Tassuddānaṃ – Sambādho kāyasakkhī paññā, Ubhatobhāgo sandiṭṭhikā dve; Nibbānaṃ parinibbānaṃ, Tadaṅgadiṭṭhadhammikena cāti. Paṭhamapaṇṇāsakaṃ samattaṃ.",
    "english": "The Fifth General Chapter",
    "sinhala": "පස්වැනි සාමඤ්ඤ වග්ගය"
  }
}