{
  "id": "an9.6",
  "title": {
    "pali": "Dutiyapaṇṇāsakaṃ - Khemavaggo",
    "english": "The Second Fifty - The Chapter on Security",
    "sinhala": "දෙවන පඤ්ඤාසකය - ඛේම වර්ගය"
  },
  "sections": [
    {
      "number": 52,
      "pali": "‘‘‘Khemaṃ khema’nti, āvuso, vuccati. Kittāvatā nu kho, āvuso, khemaṃ vuttaṃ bhagavatā’’ti? ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, khemaṃ vuttaṃ bhagavatā pariyāyena…pe…. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ettāvatāpi kho, āvuso, khemaṃ vuttaṃ bhagavatā nippariyāyenā’’ti. Paṭhamaṃ.",
      "english": "‘Safety, friend, is what is spoken of as 'safety.' To what extent, friend, has safety been declared by the Blessed One?’\n\n‘Here, friend, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, enters and abides in the first jhana, which is accompanied by applied thought and sustained thought, born of seclusion, and filled with rapture and happiness. Even to this extent, friend, safety has been declared by the Blessed One, in a provisional sense.’\n\n‘Furthermore, friend, a bhikkhu, by completely transcending the dimension of neither perception nor non-perception, enters and abides in the cessation of perception and feeling, and having seen with wisdom, their influxes are utterly extinguished. Even to this extent, friend, safety has been declared by the Blessed One, in the ultimate sense.’",
      "sinhala": "\"ආයුෂ්මත්නි, 'කේමය, කේමය' (ආරක්‍ෂාව, නිදහස) යනු කියනු ලැබේ. ආයුෂ්මත්නි, භාග්‍ය​වතුන් වහන්සේ විසින් කොපමණ ප්‍රමාණයකින් 'කේමය' (ආරක්‍ෂාව) දේශනා කරන ලද්දේද?\"\n\n\"ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. ආයුෂ්මත්නි, භාග්‍ය​වතුන් වහන්සේ විසින් මෙපමණ ප්‍රමාණයකින් ද පර්යාය වශයෙන් (අදියරෙන් අදියර) 'කේමය' (ආරක්‍ෂාව) දේශනා කරන ලද්දේය.\"\n\n\"නැවතත් ආයුෂ්මත්නි, භික්ෂුව සියලු අයුරින් නේවසඤ්ඤානාසඤ්ඤායතනයද ඉක්මවා, සඤ්ඤා වේදයිත නිරෝධයට (සංඥා සහ වේදනා නැවැත්වීම පිණිස) පැමිණ වාසය කරයි. තවද, ප්‍රඥාවෙන් දැකීමෙන් ඔහුගේ ආශ්‍රවයෝ ක්ෂය වී ඇත්තාහ. ආයුෂ්මත්නි, භාග්‍ය​වතුන් වහන්සේ විසින් මෙපමණ ප්‍රමාණයකින්ද අපර්යාය වශයෙන් (සෘජුවම, අවසාන වශයෙන්) 'කේමය' (ආරක්‍ෂාව) දේශනා කරන ලද්දේය.\"",
      "paliTitle": "Khemasuttaṃ"
    },
    {
      "number": 53,
      "pali": "Khemappatto khemappattoti, āvuso, vuccati…pe…. Dutiyaṃ.",
      "english": "One who has attained security is called one who has attained security, friend, and so forth. The second.",
      "sinhala": "මිත්‍රය, ක‍්ෂේමයට පත් වූ තැනැත්තා, 'ක‍්ෂේමයට පත් වූ තැනැත්තා' යැයි කියනු ලැබේ... දෙවැන්නයි.",
      "paliTitle": "Khemappattasuttaṃ"
    },
    {
      "number": 54,
      "pali": "Amataṃ amatanti, āvuso, vuccati…pe…. Tatiyaṃ.",
      "english": "The Deathless, friend, is called 'the Deathless'. The Third.",
      "sinhala": "ආයුෂ්මතුනි, අමා නිවන යනු අමා නිවන යැයි කියනු ලැබේ. තෙවැන්නයි.",
      "paliTitle": "Amatasuttaṃ"
    },
    {
      "number": 55,
      "pali": "Amatappatto amatappattoti, āvuso, vuccati…pe…. Catutthaṃ.",
      "english": "One who has attained the Deathless, friend, is called 'one who has attained the Deathless,' and so on. This is the fourth.",
      "sinhala": "ආයුෂ්මත්නි, අමා නිවනට පැමිණි තැනැත්තා යැයි, අමා නිවනට පැමිණි තැනැත්තා යැයි කියනු ලැබේ. සතරවෙනියයි.",
      "paliTitle": "Amatappattasuttaṃ"
    },
    {
      "number": 56,
      "pali": "Abhayaṃ abhayanti, āvuso, vuccati…pe…. Pañcamaṃ.",
      "english": "It is called fearlessness, friends, it is called fearlessness... This is the fifth.",
      "sinhala": "ඇවැත්නි, අභය යනු අභයම යැයි කියනු ලැබේ. පස්වැන්නයි.",
      "paliTitle": "Abhayasuttaṃ"
    },
    {
      "number": 57,
      "pali": "Abhayappatto abhayappattoti, āvuso, vuccati…pe…. Chaṭṭhaṃ.",
      "english": "One who has attained fearlessness, friend, is called 'one who has attained fearlessness,' and so the discourse continues on this topic. This is the sixth.",
      "sinhala": "ඇවැත්නි, අභයප්‍රාප්ත වූ තැනැත්තා 'අභයප්‍රාප්තයෙකි' යැයි කියනු ලැබේ. සයවැන්නයි.",
      "paliTitle": "Abhayappattasuttaṃ"
    },
    {
      "number": 58,
      "pali": "Passaddhi passaddhīti, āvuso, vuccati…pe…. Sattamaṃ.",
      "english": "Tranquility, tranquility, friend, is thus spoken of, with its full meaning expounded; this is the seventh.",
      "sinhala": "ප්‍රශාන්තිය, ප්‍රශාන්තිය යනුවෙන්, ආයුෂ්මත්නි, කියනු ලැබේ. අනෙකුත් කරුණු ද එලෙසින්ම විස්තර වෙයි. මෙය සත්වන කරුණයි.",
      "paliTitle": "Passaddhisuttaṃ"
    },
    {
      "number": 59,
      "pali": "Anupubbapassaddhi anupubbapassaddhīti, āvuso, vuccati…pe…. Aṭṭhamaṃ.",
      "english": "Gradual tranquilization, gradual tranquilization, friend, is spoken of, and this is the eighth point.",
      "sinhala": "ආයුෂ්මත්නි, 'ක්‍රමානුකූල සංසිඳීම, ක්‍රමානුකූල සංසිඳීම' යැයි කියනු ලැබේ. මෙය අටවැන්නයි.",
      "paliTitle": "Anupubbapassaddhisuttaṃ"
    },
    {
      "number": 60,
      "pali": "Nirodho nirodhoti, āvuso, vuccati…pe…. Navamaṃ.",
      "english": "Cessation, friend, is called cessation; it is the remainderless fading away and cessation of craving, its relinquishing, giving up, release, and non-attachment. This is the ninth.",
      "sinhala": "ඇවැත්නි, නිරෝධය නිරෝධය යැයි කියනු ලැබේ. මෙලෙසම තවදුරටත් විස්තර කෙරේ. මෙය නවවැන්නයි.",
      "paliTitle": "Nirodhasuttaṃ"
    },
    {
      "number": 61,
      "pali": "‘‘‘Anupubbanirodho anupubbanirodho’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, anupubbanirodho vutto bhagavatā’’ti? ‘‘Idhāvuso, bhikkhu vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Ettāvatāpi kho, āvuso, anupubbanirodho vutto bhagavatā pariyāyena…pe…. ‘‘Puna caparaṃ, āvuso, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati, paññāya cassa disvā āsavā parikkhīṇā honti. Ettāvatāpi kho, āvuso, anupubbanirodho vutto bhagavatā nippariyāyenā’’ti. Dasamaṃ.",
      "english": "“Gradual cessation, gradual cessation” is what is said, friend. To what extent, friend, has gradual cessation been declared by the Blessed One? “Here, friend, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome states, with applied thought and sustained thought, born of seclusion, and filled with rapture and pleasure, enters and dwells in the first meditative absorption. To this extent, friend, gradual cessation has been declared by the Blessed One by a conventional method. Furthermore, friend, a bhikkhu, transcending the dimension of neither perception nor non-perception in its entirety, enters and dwells in the cessation of perception and feeling, and having seen with wisdom, his taints are utterly destroyed. To this extent, friend, gradual cessation has been declared by the Blessed One by an ultimate method.”",
      "sinhala": "\"ආයුෂ්මත්නි, 'අනුපූර්ව නිරෝධය, අනුපූර්ව නිරෝධය' යැයි කියනු ලැබේ. ආයුෂ්මත්නි, භාග්‍යවතුන් වහන්සේ විසින් අනුපූර්ව නිරෝධය කවර පමණකින් දේශනා කර තිබේද?\"\n\n\"ආයුෂ්මත්නි, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් ද වෙන්ව, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති, ප්‍රථම ධ්‍යානයට සමවද සුවසේ වාසය කරයි. ආයුෂ්මත්නි, මෙපමණකින් ද භාග්‍යවතුන් වහන්සේ විසින් පර්යාය වශයෙන් අනුපූර්ව නිරෝධය දේශනා කර තිබේ.\"\n\n\"නැවතත්, ආයුෂ්මත්නි, භික්ෂුව නේවසඤ්ඤානාසඤ්ඤායතනය මුළුමනින්ම ඉක්මවා, සඤ්ඤා වේදයිත නිරෝධයට සමවද සුවසේ වාසය කරයි. ප්‍රඥාවෙන් දැකීමෙන් ඔහුගේ ආශ්‍රවයෝ ක්ෂය වී යති. ආයුෂ්මත්නි, මෙපමණකින් ද භාග්‍යවතුන් වහන්සේ විසින් පරම වශයෙන් අනුපූර්ව නිරෝධය දේශනා කර තිබේ.\"",
      "paliTitle": "Anupubbanirodhasuttaṃ"
    },
    {
      "number": 62,
      "pali": "‘‘Nava, bhikkhave, dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. Katame nava? Rāgaṃ, dosaṃ, mohaṃ, kodhaṃ, upanāhaṃ, makkhaṃ, paḷāsaṃ, issaṃ, macchariyaṃ – ime kho, bhikkhave, nava dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. ‘‘Nava, bhikkhave, dhamme pahāya bhabbo arahattaṃ sacchikātuṃ. Katame nava? Rāgaṃ, dosaṃ, mohaṃ, kodhaṃ, upanāhaṃ, makkhaṃ, paḷāsaṃ, issaṃ, macchariyaṃ – ime kho, bhikkhave, nava dhamme pahāya bhabbo arahattaṃ sacchikātu’’nti. Ekādasamaṃ.",
      "english": "Monks, without abandoning nine mental qualities, one is incapable of realizing Arahantship. Which nine? Sensual passion, aversion, delusion, anger, resentment, denigration, malicious rivalry, envy, and avarice. Monks, without abandoning these nine mental qualities, one is incapable of realizing Arahantship.\n\nMonks, by abandoning nine mental qualities, one is capable of realizing Arahantship. Which nine? Sensual passion, aversion, delusion, anger, resentment, denigration, malicious rivalry, envy, and avarice. Monks, by abandoning these nine mental qualities, one is capable of realizing Arahantship.",
      "sinhala": "‘‘මහණෙනි, ධර්ම නවයක් ප්‍රහාණය නොකර අරහත්වය සාක්ෂාත් කිරීමට නොහැක්කේය. කවර ඒවාද ඒ නවය? රාගය, ද්වේෂය, මෝහය, ක්‍රෝධය, උපනාහය, මක්ඛය, පලාසය, ඉස්සා, මච්ඡරිය යන මේවාය. මහණෙනි, ඇත්ත වශයෙන්ම මේ ධර්ම නවය ප්‍රහාණය නොකර අරහත්වය සාක්ෂාත් කිරීමට නොහැක්කේය.\n\n‘‘මහණෙනි, ධර්ම නවයක් ප්‍රහාණය කිරීමෙන් අරහත්වය සාක්ෂාත් කිරීමට හැකි වේ. කවර ඒවාද ඒ නවය? රාගය, ද්වේෂය, මෝහය, ක්‍රෝධය, උපනාහය, මක්ඛය, පලාසය, ඉස්සා, මච්ඡරිය යන මේවාය. මහණෙනි, ඇත්ත වශයෙන්ම මේ ධර්ම නවය ප්‍රහාණය කිරීමෙන් අරහත්වය සාක්ෂාත් කිරීමට හැකි වේ.",
      "paliTitle": "Abhabbasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Khemavaggo paṭhamo. Tassuddānaṃ – Khemo ca amatañceva, abhayaṃ passaddhiyena ca; Nirodho anupubbo ca, dhammaṃ pahāya bhabbena cāti.",
    "english": "",
    "sinhala": ""
  }
}