{
  "id": "an9.3",
  "title": {
    "pali": "Sattāvāsavaggo",
    "english": "The Chapter on the Abodes of Beings",
    "sinhala": "සත්ත්වාවාස වග්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "‘‘Tīhi, bhikkhave, ṭhānehi uttarakurukā manussā deve ca tāvatiṃse adhiggaṇhanti jambudīpake ca manusse. Katamehi tīhi? Amamā, apariggahā, niyatāyukā, visesaguṇā [visesabhuno (sī. syā. pī.)] – imehi kho, bhikkhave, tīhi ṭhānehi uttarakurukā manussā deve ca tāvatiṃse adhiggaṇhanti jambudīpake ca manusse. ‘‘Tīhi, bhikkhave, ṭhānehi devā tāvatiṃsā uttarakuruke ca manusse adhiggaṇhanti jambudīpake ca manusse. Katamehi tīhi? Dibbena āyunā, dibbena vaṇṇena, dibbena sukhena – imehi kho, bhikkhave, tīhi ṭhānehi devā tāvatiṃsā uttarakuruke ca manusse adhiggaṇhanti jambudīpake ca manusse. [kathā. 271] ‘‘Tīhi, bhikkhave, ṭhānehi jambudīpakā manussā uttarakuruke ca manusse adhiggaṇhanti deve ca tāvatiṃse. Katamehi tīhi? Sūrā, satimanto, idha brahmacariyavāso – imehi kho, bhikkhave, tīhi ṭhānehi jambudīpakā manussā uttarakuruke ca manusse adhiggaṇhanti deve ca tāvatiṃse’’ti. Paṭhamaṃ.",
      "english": "Monks, by three qualities, the humans of Uttarakuru surpass both the Tāvatiṃsa devas and the humans of Jambudīpa. Which three? They are free from possessiveness, ungrasping, have a fixed lifespan, and possess superior qualities. Indeed, monks, by these three qualities, the humans of Uttarakuru surpass both the Tāvatiṃsa devas and the humans of Jambudīpa.\n\nMonks, by three qualities, the Tāvatiṃsa devas surpass both the humans of Uttarakuru and the humans of Jambudīpa. Which three? By their divine lifespan, divine appearance, and divine happiness. Indeed, monks, by these three qualities, the Tāvatiṃsa devas surpass both the humans of Uttarakuru and the humans of Jambudīpa.\n\nMonks, by three qualities, the humans of Jambudīpa surpass both the humans of Uttarakuru and the Tāvatiṃsa devas. Which three? They are brave, mindful, and have the opportunity for the holy life here. Indeed, monks, by these three qualities, the humans of Jambudīpa surpass both the humans of Uttarakuru and the Tāvatiṃsa devas.",
      "sinhala": "භික්ෂූනි, කරුණු තුනකින් උත්තරකුරු මනුෂ්‍යයෝ තාවතිංස දෙවියන්ටත්, ජම්බුද්වීපවාසී මනුෂ්‍යයන්ටත් වඩා උසස් වෙති. කවර කරුණු තුනකින් ද? මමත්වයෙන් තොරවීම, පරිග්ග්‍රහයෙන් තොරවීම, සහ ස්ථිර ආයුෂ ඇත්තන් වීම යන මේ කරුණු තුනෙන් භික්ෂූනි, උත්තරකුරු මනුෂ්‍යයෝ තාවතිංස දෙවියන්ටත්, ජම්බුද්වීපවාසී මනුෂ්‍යයන්ටත් වඩා උසස් වෙති.\n\nභික්ෂූනි, කරුණු තුනකින් තාවතිංස දෙවියෝ උත්තරකුරු මනුෂ්‍යයන්ටත්, ජම්බුද්වීපවාසී මනුෂ්‍යයන්ටත් වඩා උසස් වෙති. කවර කරුණු තුනකින් ද? දිව්‍යමය ආයුෂයෙන්, දිව්‍යමය වර්ණයෙන්, සහ දිව්‍යමය සැපයෙන් යන මේ කරුණු තුනෙන් භික්ෂූනි, තාවතිංස දෙවියෝ උත්තරකුරු මනුෂ්‍යයන්ටත්, ජම්බුද්වීපවාසී මනුෂ්‍යයන්ටත් වඩා උසස් වෙති.\n\nභික්ෂූනි, කරුණු තුනකින් ජම්බුද්වීපවාසී මනුෂ්‍යයෝ උත්තරකුරු මනුෂ්‍යයන්ටත්, තාවතිංස දෙවියන්ටත් වඩා උසස් වෙති. කවර කරුණු තුනකින් ද? ශූර වීර වීම, සතිමත් වීම, සහ මෙහිදී (ජම්බුද්වීපයෙහි) බ්‍රහ්මචාරී ජීවිතයක් ගතකිරීමේ අවස්ථාව තිබීම යන මේ කරුණු තුනෙන් භික්ෂූනි, ජම්බුද්වීපවාසී මනුෂ්‍යයෝ උත්තරකුරු මනුෂ්‍යයන්ටත්, තාවතිංස දෙවියන්ටත් වඩා උසස් වෙති.",
      "paliTitle": "Tiṭhānasuttaṃ"
    },
    {
      "number": 22,
      "pali": "[a. ni. 3.141] ‘‘Tayo ca, bhikkhave, assakhaḷuṅke desessāmi tayo ca purisakhaḷuṅke tayo ca assaparasse [assasadasse (sī. syā. pī.) a. ni. 3.142] tayo ca purisaparasse [purisasadasse (sī. syā. pī.)] tayo ca bhadde assājānīye tayo ca bhadde purisājānīye. Taṃ suṇātha. ‘‘Katame ca, bhikkhave, tayo assakhaḷuṅkā? Idha, bhikkhave, ekacco assakhaḷuṅko javasampanno hoti, na vaṇṇasampanno, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco assakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo assakhaḷuṅkā. ‘‘Katame ca, bhikkhave, tayo purisakhaḷuṅkā? Idha, bhikkhave, ekacco purisakhaḷuṅko javasampanno hoti, na vaṇṇasampanno, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno. Idha pana, bhikkhave, ekacco purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. ‘‘Kathañca, bhikkhave, purisakhaḷuṅko javasampanno hoti, na vaṇṇasampanno na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho saṃsādeti [saṃsāreti (ka.) a. niā. 1.3.141], no vissajjeti. Idamassa na vaṇṇasmiṃ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Idamassa na ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisakhaḷuṅko javasampanno hoti, na vaṇṇasampanno na ārohapariṇāhasampanno. ‘‘Kathañca, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Na kho pana lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Idamassa na ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca, na ārohapariṇāhasampanno. ‘‘Kathañca, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu ‘idaṃ dukkha’nti yathābhūtaṃ pajānāti…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Idamassa ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisakhaḷuṅko javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo purisakhaḷuṅkā. ‘‘Katame ca, bhikkhave, tayo assaparassā? Idha, bhikkhave, ekacco assaparasso…pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo assaparassā. ‘‘Katame ca, bhikkhave, tayo purisaparassā? Idha, bhikkhave, ekacco purisaparasso…pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. ‘‘Kathañca, bhikkhave, purisaparasso…pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti, tattha parinibbāyī anāvattidhammo tasmā lokā. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Idamassa ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, purisaparasso javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo purisaparassā. ‘‘Katame ca, bhikkhave, tayo bhaddā assājānīyā? Idha, bhikkhave, ekacco bhaddo assājānīyo… pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo bhaddā assājānīyā. ‘‘Katame ca, bhikkhave, tayo bhaddā purisājānīyā? Idha, bhikkhave, ekacco bhaddo purisājānīyo… pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. ‘‘Kathañca, bhikkhave, bhaddo purisājānīyo…pe… javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idamassa javasmiṃ vadāmi. Abhidhamme kho pana abhivinaye pañhaṃ puṭṭho vissajjeti, no saṃsādeti. Idamassa vaṇṇasmiṃ vadāmi. Lābhī kho pana hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Idamassa ārohapariṇāhasmiṃ vadāmi. Evaṃ kho, bhikkhave, bhaddo purisājānīyo javasampanno ca hoti vaṇṇasampanno ca ārohapariṇāhasampanno ca. Ime kho, bhikkhave, tayo bhaddā purisājānīyā’’ti. Dutiyaṃ.",
      "english": "And, monks, I will teach you about three types of inferior horses, three types of inferior persons, three types of medium-grade horses, three types of medium-grade persons, three types of noble thoroughbred horses, and three types of noble thoroughbred persons. Listen to that.\n\nAnd what, monks, are the three types of inferior horses? Here, monks, a certain inferior horse is endowed with speed, but not with beauty, nor with good proportions. Here, monks, a certain inferior horse is endowed with speed and also with beauty, but not with good proportions. Here, monks, a certain inferior horse is endowed with speed, and also with beauty, and also with good proportions. These, monks, are the three types of inferior horses.\n\nAnd what, monks, are the three types of inferior persons? Here, monks, a certain inferior person is endowed with speed, but not with beauty, nor with good proportions. Here, monks, a certain inferior person is endowed with speed and also with beauty, but not with good proportions. Here, monks, a certain inferior person is endowed with speed, and also with beauty, and also with good proportions.\n\nAnd how, monks, is an inferior person endowed with speed, but not with beauty, nor with good proportions? Here, monks, a bhikkhu truly understands: 'This is suffering,' 'This is the origin of suffering,' 'This is the cessation of suffering,' 'This is the path leading to the cessation of suffering.' This, I say, is his speed. But when questioned about the Abhidhamma or the higher Vinaya, he flounders; he does not answer properly. This, I say, is his lack of beauty. Furthermore, he is not one who gains robes, alms-food, lodgings, or requisites for the sick. This, I say, is his lack of good proportions. Thus, monks, is an inferior person endowed with speed, but not with beauty, nor with good proportions.\n\nAnd how, monks, is an inferior person endowed with speed and also with beauty, but not with good proportions? Here, monks, a bhikkhu truly understands: 'This is suffering,' 'This is the origin of suffering,' 'This is the cessation of suffering,' 'This is the path leading to the cessation of suffering.' This, I say, is his speed. But when questioned about the Abhidhamma or the higher Vinaya, he answers properly; he does not flounder. This, I say, is his beauty. Furthermore, he is not one who gains robes, alms-food, lodgings, or requisites for the sick. This, I say, is his lack of good proportions. Thus, monks, is an inferior person endowed with speed and also with beauty, but not with good proportions.\n\nAnd how, monks, is an inferior person endowed with speed, and also with beauty, and also with good proportions? Here, monks, a bhikkhu truly understands: 'This is suffering,' 'This is the origin of suffering,' 'This is the cessation of suffering,' 'This is the path leading to the cessation of suffering.' This, I say, is his speed. But when questioned about the Abhidhamma or the higher Vinaya, he answers properly; he does not flounder. This, I say, is his beauty. Furthermore, he is one who gains robes, alms-food, lodgings, and requisites for the sick. This, I say, is his good proportions. Thus, monks, is an inferior person endowed with speed, and also with beauty, and also with good proportions. These, monks, are the three types of inferior persons.\n\nAnd what, monks, are the three types of medium-grade horses? Here, monks, a certain medium-grade horse is endowed with speed, but not with beauty, nor with good proportions. Here, monks, a certain medium-grade horse is endowed with speed and also with beauty, but not with good proportions. Here, monks, a certain medium-grade horse is endowed with speed, and also with beauty, and also with good proportions. These, monks, are the three types of medium-grade horses.\n\nAnd what, monks, are the three types of medium-grade persons? Here, monks, a certain medium-grade person is endowed with speed, but not with beauty, nor with good proportions. Here, monks, a certain medium-grade person is endowed with speed and also with beauty, but not with good proportions. Here, monks, a certain medium-grade person is endowed with speed, and also with beauty, and also with good proportions.\n\nAnd how, monks, is a medium-grade person endowed with speed, and also with beauty, and also with good proportions? Here, monks, a bhikkhu, with the utter destruction of the five lower fetters, arises spontaneously, there to attain final Nibbāna, not liable to return from that world. This, I say, is his speed. But when questioned about the Abhidhamma or the higher Vinaya, he answers properly; he does not flounder. This, I say, is his beauty. Furthermore, he is one who gains robes, alms-food, lodgings, and requisites for the sick. This, I say, is his good proportions. Thus, monks, is a medium-grade person endowed with speed, and also with beauty, and also with good proportions. These, monks, are the three types of medium-grade persons.\n\nAnd what, monks, are the three types of noble thoroughbred horses?\n\nHere, monks, a certain noble thoroughbred horse is endowed with speed, beauty, and robust physique. Indeed, monks, these are three noble thoroughbred horses.\n\nAnd what, monks, are the three noble thoroughbred persons? Here, monks, a certain noble thoroughbred person is endowed with speed, beauty, and robust physique.\n\nAnd how, monks, is a noble thoroughbred person endowed with speed, beauty, and robust physique? Here, monks, a monk, by the destruction of the defilements, having realized for themselves with direct knowledge in this very life the undefiled liberation of mind and liberation through wisdom, abides therein. This I declare to be their speed. Indeed, when questioned on a point concerning the Abhidhamma or the higher discipline, they answer clearly and without faltering. This I declare to be their beauty. Moreover, they are one who gains robes, almsfood, lodgings, and medicinal requisites for the sick. This I declare to be their robust physique. In this way, monks, a noble thoroughbred person is endowed with speed, beauty, and robust physique. Indeed, monks, these are the three noble thoroughbred persons.",
      "sinhala": "භික්‍ෂූණි, මම ඔබට අශ්ව කණ්ඩායම් තුනක් ගැනද, පුරිස කණ්ඩායම් තුනක් ගැනද, අශ්වයන් හා සමාන කණ්ඩායම් තුනක් ගැනද, පුරිසයන් හා සමාන කණ්ඩායම් තුනක් ගැනද, භද්‍ර වූ ආජානීය අශ්වයන් තිදෙනෙකු ගැනද, භද්‍ර වූ ආජානීය පුරිසයන් තිදෙනෙකු ගැනද දේශනා කරන්නෙමි. එය ශ්‍රවණය කරන්න.\n\nභික්‍ෂූණි, අශ්ව කණ්ඩායම් තුන කවරේද? භික්‍ෂූණි, මෙහි ඇතැම් අශ්වයෙක් වේගවත් ස්වභාවයෙන් යුක්ත වෙයි, එහෙත් අලංකාර ස්වභාවයෙන් යුක්ත නොවෙයි, ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයි. භික්‍ෂූණි, තවත් අශ්වයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද යුක්ත වෙයි, එහෙත් ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයි. භික්‍ෂූණි, තවත් අශ්වයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත වෙයි. භික්‍ෂූණි, මේවා අශ්ව කණ්ඩායම් තුනයි.\n\nභික්‍ෂූණි, පුරිස කණ්ඩායම් තුන කවරේද? භික්‍ෂූණි, මෙහි ඇතැම් පුරිසයෙක් වේගවත් ස්වභාවයෙන් යුක්ත වෙයි, එහෙත් අලංකාර ස්වභාවයෙන් යුක්ත නොවෙයි, ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයි. භික්‍ෂූණි, තවත් පුරිසයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද යුක්ත වෙයි, එහෙත් ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයි. භික්‍ෂූණි, තවත් පුරිසයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත වෙයි.\n\nභික්‍ෂූණි, පුරිසයෙක් කෙසේ වේගවත් ස්වභාවයෙන් යුක්ත වෙයිද, අලංකාර ස්වභාවයෙන් යුක්ත නොවෙයිද, ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයිද? භික්‍ෂූණි, මෙහිලා භික්‍ෂුවක් ‘මේ දුකයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කරයි. ‘මේ දුක හටගැනීමයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කරයි. ‘මේ දුක නැතිකිරීමයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කරයි. ‘මේ දුක නැතිකරන ප්‍රතිපදාවයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කරයි. මේක ඔහුගේ වේගවත් ස්වභාවය ලෙස මම පවසමි. එහෙත්, අභිධර්මය හෝ විනය ගැන යම් ප්‍රශ්නයක් විමසූ විට ඔහු අවුල් කරයි (නිසි පරිදි විස්තර නොකරයි). මේක ඔහුගේ අලංකාර ස්වභාවය නොවන බව මම පවසමි. තවද, ඔහු සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලාභී නොවේ. මේක ඔහුගේ ශරීරය වැඩුණු ස්වභාවය නොවන බව මම පවසමි. භික්‍ෂූණි, මේ ආකාරයෙන් පුරිසයෙක් වේගවත් ස්වභාවයෙන් යුක්ත වෙයි, එහෙත් අලංකාර ස්වභාවයෙන් යුක්ත නොවෙයි, ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයි.\n\nභික්‍ෂූණි, පුරිසයෙක් කෙසේ වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද යුක්ත වෙයිද, එහෙත් ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයිද? භික්‍ෂූණි, මෙහිලා භික්‍ෂුවක් ‘මේ දුකයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කරයි... ‘මේ දුක නැතිකරන ප්‍රතිපදාවයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කරයි. මේක ඔහුගේ වේගවත් ස්වභාවය ලෙස මම පවසමි. එහෙත් අභිධර්මය හෝ විනය ගැන ප්‍රශ්නයක් විමසූ විට ඔහු නිසි පරිදි විස්තර කරයි, අවුල් නොකරයි. මේක ඔහුගේ අලංකාර ස්වභාවය ලෙස මම පවසමි. තවද, ඔහු සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලාභී නොවේ. මේක ඔහුගේ ශරීරය වැඩුණු ස්වභාවය නොවන බව මම පවසමි. භික්‍ෂූණි, මේ ආකාරයෙන් පුරිසයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද යුක්ත වෙයි, එහෙත් ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයි.\n\nභික්‍ෂූණි, පුරිසයෙක් කෙසේ වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත වෙයිද? භික්‍ෂූණි, මෙහිලා භික්‍ෂුවක් ‘මේ දුකයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කරයි... ‘මේ දුක නැතිකරන ප්‍රතිපදාවයි’ කියා යථාභූත ඥානයෙන් අවබෝධ කරයි. මේක ඔහුගේ වේගවත් ස්වභාවය ලෙස මම පවසමි. එහෙත් අභිධර්මය හෝ විනය ගැන ප්‍රශ්නයක් විමසූ විට ඔහු නිසි පරිදි විස්තර කරයි, අවුල් නොකරයි. මේක ඔහුගේ අලංකාර ස්වභාවය ලෙස මම පවසමි. තවද, ඔහු සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලාභී වෙයි. මේක ඔහුගේ ශරීරය වැඩුණු ස්වභාවය ලෙස මම පවසමි. භික්‍ෂූණි, මේ ආකාරයෙන් පුරිසයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත වෙයි. භික්‍ෂූණි, මේවා පුරිස කණ්ඩායම් තුනයි.\n\nභික්‍ෂූණි, අශ්වයන් හා සමාන කණ්ඩායම් තුන කවරේද? භික්‍ෂූණි, මෙහි ඇතැම් අශ්වයන් හා සමාන අයෙක් වේගවත් ස්වභාවයෙන් යුක්ත වෙයි, එහෙත් අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත නොවෙයි. තවත් අශ්වයන් හා සමාන අයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද යුක්ත වෙයි, එහෙත් ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයි. තවත් අශ්වයන් හා සමාන අයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත වෙයි. භික්‍ෂූණි, මේවා අශ්වයන් හා සමාන කණ්ඩායම් තුනයි.\n\nභික්‍ෂූණි, පුරිසයන් හා සමාන කණ්ඩායම් තුන කවරේද? භික්‍ෂූණි, මෙහි ඇතැම් පුරිසයන් හා සමාන අයෙක් වේගවත් ස්වභාවයෙන් යුක්ත වෙයි, එහෙත් අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත නොවෙයි. තවත් පුරිසයන් හා සමාන අයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද යුක්ත වෙයි, එහෙත් ශරීරය වැඩුණු ස්වභාවයෙන් යුක්ත නොවෙයි. තවත් පුරිසයන් හා සමාන අයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත වෙයි.\n\nභික්‍ෂූණි, පුරිසයන් හා සමාන අයෙක් කෙසේ වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත වෙයිද? භික්‍ෂූණි, මෙහිලා භික්‍ෂුවක් පඤ්ච ඕරම්භාගීය සංයෝජන ධර්මයන් ප්‍රහීණ කිරීමෙන් ඕපපාතිකව (නැවත උත්පත්තියකින් තොරව) උපදී, එම ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්තව එහිදී පිරිනිවන් පායි. මේක ඔහුගේ වේගවත් ස්වභාවය ලෙස මම පවසමි. එහෙත් අභිධර්මය හෝ විනය ගැන ප්‍රශ්නයක් විමසූ විට ඔහු නිසි පරිදි විස්තර කරයි, අවුල් නොකරයි. මේක ඔහුගේ අලංකාර ස්වභාවය ලෙස මම පවසමි. තවද, ඔහු සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලාභී වෙයි. මේක ඔහුගේ ශරීරය වැඩුණු ස්වභාවය ලෙස මම පවසමි. භික්‍ෂූණි, මේ ආකාරයෙන් පුරිසයන් හා සමාන අයෙක් වේගවත් ස්වභාවයෙන්ද, අලංකාර ස්වභාවයෙන්ද, ශරීරය වැඩුණු ස්වභාවයෙන්ද යුක්ත වෙයි. භික්‍ෂූණි, මේවා පුරිසයන් හා සමාන කණ්ඩායම් තුනයි.\n\nභික්‍ෂූණි, භද්‍ර වූ ආජානීය අශ්වයන් තිදෙනා කවරේද?\n\nමහණෙනි, මෙහිදී ඇතැම් භද්‍ර වූ අශ්වාජානීයෙක් වේගයෙන් යුක්ත වෙයි, වර්ණයෙන් යුක්ත වෙයි, ශරීර වර්ධනයෙන් හා ප‍්‍රමාණයෙන් යුක්ත වෙයි.\n\nමහණෙනි, මේ භද්‍ර වූ අශ්වාජානීයෝ තිදෙනා වෙති.\n\nමහණෙනි, භද්‍ර වූ පුරිසාජානීයෝ කවරහුද?\n\nමහණෙනි, මෙහිදී ඇතැම් භද්‍ර වූ පුරිසාජානීයෙක් වේගයෙන් යුක්ත වෙයි, වර්ණයෙන් යුක්ත වෙයි, ශරීර වර්ධනයෙන් හා ප‍්‍රමාණයෙන් යුක්ත වෙයි.\n\nමහණෙනි, භද්‍ර වූ පුරිසාජානීයෙක් කෙසේ නම් වේගයෙන් යුක්ත වෙයිද, වර්ණයෙන් යුක්ත වෙයිද, ශරීර වර්ධනයෙන් හා ප‍්‍රමාණයෙන් යුක්ත වෙයිද?\n\nමහණෙනි, මෙහිදී භික්ෂුවක් ආසවයන් ක්ෂය කිරීමෙන් කෙලෙස් රහිත වූ චේතෝවිමුක්තිය හා ප‍්‍රඥාවිමුක්තිය මේ ධර්මයෙහිම තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කරගෙන සාක්ෂාත් කොට වාසය කරයි. මම මෙය ඔහුගේ වේගය ලෙස කියමි.\n\nඑහෙත්, අභිධර්මයෙහි හෝ අභිවිනයෙහි ප‍්‍රශ්න අසන ලද කල පිළිතුරු දෙයි, පැකිලෙන්නේ නැත. මම මෙය ඔහුගේ වර්ණය ලෙස කියමි.\n\nඑහෙත්, සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර යන මේවායෙහි ලාභී වෙයි. මම මෙය ඔහුගේ ශරීර වර්ධනය හා ප‍්‍රමාණය ලෙස කියමි.\n\nමහණෙනි, භද්‍ර වූ පුරිසාජානීයෙක් මෙසේ වේගයෙන් යුක්ත වෙයි, වර්ණයෙන් යුක්ත වෙයි, ශරීර වර්ධනයෙන් හා ප‍්‍රමාණයෙන් යුක්ත වෙයි.\n\nමහණෙනි, මේ භද්‍ර වූ පුරිසාජානීයෝ තිදෙනා වෙති. දෙවැන්නයි.",
      "paliTitle": "Assakhaḷuṅkasuttaṃ"
    },
    {
      "number": 23,
      "pali": "[dī. ni. 2.103] ‘‘Nava, bhikkhave, taṇhāmūlake dhamme desessāmi, taṃ suṇātha. Katame ca, bhikkhave, nava taṇhāmūlakā dhammā? Taṇhaṃ paṭicca pariyesanā, pariyesanaṃ paṭicca lābho, lābhaṃ paṭicca vinicchayo, vinicchayaṃ paṭicca chandarāgo, chandarāgaṃ paṭicca ajjhosānaṃ, ajjhosānaṃ paṭicca pariggaho, pariggahaṃ paṭicca macchariyaṃ, macchariyaṃ paṭicca ārakkho, ārakkhādhikaraṇaṃ daṇḍādānaṃ satthādānaṃ kalahaviggahavivādatuvaṃtuvaṃpesuññamusāvādā aneke pāpakā akusalā dhammā sambhavanti. Ime kho, bhikkhave, nava taṇhāmūlakā dhammā’’ti. Tatiyaṃ.",
      "english": "Monks, I will teach you nine phenomena rooted in craving. Listen to them. And what, monks, are these nine phenomena rooted in craving? Conditioned by craving is seeking; conditioned by seeking is acquisition; conditioned by acquisition is assessment; conditioned by assessment is passionate desire; conditioned by passionate desire is clinging; conditioned by clinging is possession; conditioned by possession is stinginess; conditioned by stinginess is guarding. On account of guarding, there arise the taking up of clubs, the taking up of weapons, quarrels, disputes, contention, mutual accusations, divisive speech, false speech, and many other evil, unwholesome phenomena. Indeed, monks, these are the nine phenomena rooted in craving.",
      "sinhala": "මහණෙනි, තණ්හාව මුල් කරගත් ධ‍ර්මයන් නවයක් මම දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, තණ්හාව මුල් කරගත් ධ‍ර්මයන් නවය කවරේද? තණ්හාව නිසා ගවේෂණය, ගවේෂණය නිසා ලාභය, ලාභය නිසා විනිශ්චය, විනිශ්චය නිසා ඡන්දරාගය, ඡන්දරාගය නිසා අධ්‍යවසානය, අධ්‍යවසානය නිසා පරිග්ගහය, පරිග්ගහය නිසා මසුරුකම, මසුරුකම නිසා ආරක්ඛය, ආරක්ඛය හේතුවෙන් දණ්ඩය අතට ගැනීම, ශස‍්ත‍්‍රය අතට ගැනීම, කලහ, විග්ගහ, විවාද, තුවංතුවං, පේසුඤ්ඤ, මුසාවාද යන මේ ආදී බොහෝ පාපී අකුසල ධ‍ර්මයන් හටගනී. මහණෙනි, මේවා තණ්හාව මුල් කරගත් ධ‍ර්මයන් නවයයි.",
      "paliTitle": "Taṇhāmūlakasuttaṃ"
    },
    {
      "number": 24,
      "pali": "[dī. ni. 3.341] ‘‘Navayime, bhikkhave, sattāvāsā. Katame nava? Santi, bhikkhave, sattā nānattakāyā nānattasaññino, seyyathāpi manussā, ekacce ca devā, ekacce ca vinipātikā. Ayaṃ paṭhamo sattāvāso. ‘‘Santi, bhikkhave, sattā nānattakāyā ekattasaññino, seyyathāpi devā brahmakāyikā paṭhamābhinibbattā. Ayaṃ dutiyo sattāvāso. ‘‘Santi, bhikkhave, sattā ekattakāyā nānattasaññino, seyyathāpi devā ābhassarā. Ayaṃ tatiyo sattāvāso. ‘‘Santi, bhikkhave, sattā ekattakāyā ekattasaññino, seyyathāpi devā subhakiṇhā. Ayaṃ catuttho sattāvāso. ‘‘Santi, bhikkhave, sattā asaññino appaṭisaṃvedino, seyyathāpi devā asaññasattā. Ayaṃ pañcamo sattāvāso. ‘‘Santi, bhikkhave, sattā sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanūpagā. Ayaṃ chaṭṭho sattāvāso. ‘‘Santi, bhikkhave, sattā sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanūpagā. Ayaṃ sattamo sattāvāso. ‘‘Santi, bhikkhave, sattā sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanūpagā. Ayaṃ aṭṭhamo sattāvāso. ‘‘Santi, bhikkhave, sattā sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanūpagā. Ayaṃ navamo sattāvāso. Ime kho, bhikkhave, nava sattāvāsā’’ti. Catutthaṃ.",
      "english": "Monks, these are the nine abodes of beings. Which nine?\n\nMonks, there are beings with diverse bodies and diverse perceptions, such as humans, some deities, and some in states of woe. This is the first abode of beings.\n\nMonks, there are beings with diverse bodies but unified perceptions, such as the Brahma-group deities reborn in the first absorption. This is the second abode of beings.\n\nMonks, there are beings with unified bodies but diverse perceptions, such as the Radiant Deities. This is the third abode of beings.\n\nMonks, there are beings with unified bodies and unified perceptions, such as the Glorious Deities. This is the fourth abode of beings.\n\nMonks, there are beings without perception and without feeling, such as the non-percipient deities. This is the fifth abode of beings.\n\nMonks, there are beings who, by completely transcending perceptions of form, by the fading away of perceptions of sensory impingement, and by not attending to perceptions of diversity, attain the sphere of infinite space, thinking ‘Space is infinite’. This is the sixth abode of beings.\n\nMonks, there are beings who, by completely transcending the sphere of infinite space, attain the sphere of infinite consciousness, thinking ‘Consciousness is infinite’. This is the seventh abode of beings.\n\nMonks, there are beings who, by completely transcending the sphere of infinite consciousness, attain the sphere of nothingness, thinking ‘There is nothing’. This is the eighth abode of beings.\n\nMonks, there are beings who, by completely transcending the sphere of nothingness, attain the sphere of neither perception nor non-perception. This is the ninth abode of beings.\n\nMonks, these are the nine abodes of beings.",
      "sinhala": "භික්ෂූනි, මේ සත්ත්ව ආවාස නවයක් ඇත. ඒ නවය කවරේද? භික්ෂූනි, ඇතැම් සත්ත්වයෝ නානාවිධ ශරීර ඇත්තෝ වෙති, නානාවිධ සංඥා ඇත්තෝ වෙති. යම් සේ මිනිස්සු ද, ඇතැම් දෙවියෝ ද, ඇතැම් විනිපාතික සත්ත්වයෝ ද වෙත් ද, එබඳුහු ය. මෙය පළමු වන සත්ත්ව ආවාසය යි.\n\nභික්ෂූනි, ඇතැම් සත්ත්වයෝ නානාවිධ ශරීර ඇත්තෝ වෙති, ඒකත්ව සංඥා ඇත්තෝ වෙති. යම් සේ ප්‍ර‍ථමාභිනිර්වෘත්ත බ්‍ර‍හ්මකායික දෙවියෝ වෙත් ද, එබඳුහු ය. මෙය දෙවෙනි සත්ත්ව ආවාසය යි.\n\nභික්ෂූනි, ඇතැම් සත්ත්වයෝ ඒකත්ව ශරීර ඇත්තෝ වෙති, නානාවිධ සංඥා ඇත්තෝ වෙති. යම් සේ ආභස්සර දෙවියෝ වෙත් ද, එබඳුහු ය. මෙය තෙවෙනි සත්ත්ව ආවාසය යි.\n\nභික්ෂූනි, ඇතැම් සත්ත්වයෝ ඒකත්ව ශරීර ඇත්තෝ වෙති, ඒකත්ව සංඥා ඇත්තෝ වෙති. යම් සේ සුභකිණ්හ දෙවියෝ වෙත් ද, එබඳුහු ය. මෙය සිවුවෙනි සත්ත්ව ආවාසය යි.\n\nභික්ෂූනි, ඇතැම් සත්ත්වයෝ සංඥා රහිත වෙති, ප්‍රතිසංවේදනයෙන් (විඳීමෙන්) තොර වෙති. යම් සේ අසංඥසත්ත්ව දෙවියෝ වෙත් ද, එබඳුහු ය. මෙය පස්වෙනි සත්ත්ව ආවාසය යි.\n\nභික්ෂූනි, ඇතැම් සත්ත්වයෝ සියලු රූප සංඥාවන් ඉක්මවීමෙන්, ප්‍ර‍තිඝ සංඥාවන් පහව යාමෙන්, නානාවිධ සංඥාවන් මෙනෙහි නොකිරීමෙන් ‘ආකාශය අනන්ත ය’ යන (ආරම්මණයට) ආකාශානන්ත්‍යායතනයට පැමිණියෝ වෙති. මෙය සයවෙනි සත්ත්ව ආවාසය යි.\n\nභික්ෂූනි, ඇතැම් සත්ත්වයෝ සියලු ආකාශානන්ත්‍යායතනය ඉක්මවා ‘විඤ්ඤාණය අනන්ත ය’ යන (ආරම්මණයට) විඤ්ඤාණානන්ත්‍යායතනයට පැමිණියෝ වෙති. මෙය සත්වෙනි සත්ත්ව ආවාසය යි.\n\nභික්ෂූනි, ඇතැම් සත්ත්වයෝ සියලු විඤ්ඤාණානන්ත්‍යායතනය ඉක්මවා ‘කිසිවක් නැත’ යන (ආරම්මණයට) ආකිඤ්චඤ්ඤායතනයට පැමිණියෝ වෙති. මෙය අටවෙනි සත්ත්ව ආවාසය යි.\n\nභික්ෂූනි, ඇතැම් සත්ත්වයෝ සියලු ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණියෝ වෙති. මෙය නවවෙනි සත්ත්ව ආවාසය යි. භික්ෂූනි, මේවා ය, ඒ නව සත්ත්ව ආවාසයෝ.",
      "paliTitle": "Sattāvāsasuttaṃ"
    },
    {
      "number": 25,
      "pali": "‘‘Yato kho, bhikkhave, bhikkhuno paññāya cittaṃ suparicitaṃ hoti, tassetaṃ, bhikkhave, bhikkhuno kallaṃ vacanāya – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’’ti. ‘‘Kathañca, bhikkhave, bhikkhuno paññāya cittaṃ suparicitaṃ hoti? ‘Vītarāgaṃ me citta’nti paññāya cittaṃ suparicitaṃ hoti; ‘vītadosaṃ me citta’nti paññāya cittaṃ suparicitaṃ hoti; ‘vītamohaṃ me citta’nti paññāya cittaṃ suparicitaṃ hoti; ‘asarāgadhammaṃ me citta’nti paññāya cittaṃ suparicitaṃ hoti; ‘asadosadhammaṃ me citta’nti paññāya cittaṃ suparicitaṃ hoti; ‘asamohadhammaṃ me citta’nti paññāya cittaṃ suparicitaṃ hoti; ‘anāvattidhammaṃ me cittaṃ kāmabhavāyā’ti paññāya cittaṃ suparicitaṃ hoti; ‘anāvattidhammaṃ me cittaṃ rūpabhavāyā’ti paññāya cittaṃ suparicitaṃ hoti; ‘anāvattidhammaṃ me cittaṃ arūpabhavāyā’ti paññāya cittaṃ suparicitaṃ hoti. Yato kho, bhikkhave, bhikkhuno paññāya cittaṃ suparicitaṃ hoti, tassetaṃ, bhikkhave, bhikkhuno kallaṃ vacanāya – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’’ti. Pañcamaṃ.",
      "english": "Monks, when a monk's mind is thoroughly cultivated by wisdom, then, monks, it is proper for that monk to declare: 'Birth is destroyed, the spiritual life has been lived to its culmination, what had to be done has been done, and I know there is nothing further for this state of being.'\n\nAnd how, monks, is a monk's mind thoroughly cultivated by wisdom? When it is known, 'My mind is freed from passion,' then the mind is thoroughly cultivated by wisdom. When it is known, 'My mind is freed from aversion,' then the mind is thoroughly cultivated by wisdom. When it is known, 'My mind is freed from delusion,' then the mind is thoroughly cultivated by wisdom. When it is known, 'My mind is of a nature without passion,' then the mind is thoroughly cultivated by wisdom. When it is known, 'My mind is of a nature without aversion,' then the mind is thoroughly cultivated by wisdom. When it is known, 'My mind is of a nature without delusion,' then the mind is thoroughly cultivated by wisdom. When it is known, 'My mind is of a nature not to return to the sensual realm of existence,' then the mind is thoroughly cultivated by wisdom. When it is known, 'My mind is of a nature not to return to the form realm of existence,' then the mind is thoroughly cultivated by wisdom. When it is known, 'My mind is of a nature not to return to the formless realm of existence,' then the mind is thoroughly cultivated by wisdom. Monks, when a monk's mind is thoroughly cultivated by wisdom, then, monks, it is proper for that monk to declare: 'Birth is destroyed, the spiritual life has been lived to its culmination, what had to be done has been done, and I know there is nothing further for this state of being.'",
      "sinhala": "මහණෙනි, යම් හෙයකින් භික්ෂුවකගේ සිත ප්‍රඥාවෙන් මනාකොට පරිචිත වී ඇත්ද, මහණෙනි, එවිට ඒ භික්ෂුවට ‘ඉපදීම ක්ෂය විය, ශ්‍රේෂ්ඨ චර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මීට පසුව මෙලෙස තවත් ආත්මභාවයක් නොමැති බව මම දනිමි’ යැයි කියන්නට සුදුසු ය.\n\nමහණෙනි, කෙසේ නම් භික්ෂුවකගේ සිත ප්‍රඥාවෙන් මනාකොට පරිචිත වේද?\n\n‘මාගේ සිත රාගයෙන් මිදුණේය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ. ‘මාගේ සිත ද්වේෂයෙන් මිදුණේය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ. ‘මාගේ සිත මෝහයෙන් මිදුණේය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ. ‘මාගේ සිත රාගයෙන් තොර ස්වභාවයෙන් යුක්තය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ. ‘මාගේ සිත ද්වේෂයෙන් තොර ස්වභාවයෙන් යුක්තය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ. ‘මාගේ සිත මෝහයෙන් තොර ස්වභාවයෙන් යුක්තය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ. ‘මාගේ සිත කාමභවයට නැවත නොඑන ස්වභාවයෙන් යුක්තය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ. ‘මාගේ සිත රූපභවයට නැවත නොඑන ස්වභාවයෙන් යුක්තය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ. ‘මාගේ සිත අරූපභවයට නැවත නොඑන ස්වභාවයෙන් යුක්තය’ යනුවෙන් ප්‍රඥාවෙන් සිත මනාකොට පරිචිත වේ.\n\nමහණෙනි, යම් හෙයකින් භික්ෂුවකගේ සිත ප්‍රඥාවෙන් මනාකොට පරිචිත වී ඇත්ද, මහණෙනි, එවිට ඒ භික්ෂුවට ‘ඉපදීම ක්ෂය විය, ශ්‍රේෂ්ඨ චර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මීට පසුව මෙලෙස තවත් ආත්මභාවයක් නොමැති බව මම දනිමි’ යැයි කියන්නට සුදුසු ය.",
      "paliTitle": "Paññāsuttaṃ"
    },
    {
      "number": 26,
      "pali": "Ekaṃ samayaṃ āyasmā ca sāriputto āyasmā ca candikāputto rājagahe viharanti veḷuvane kalandakanivāpe. Tatra kho āyasmā candikāputto bhikkhū āmantesi ( ) [(āvuso…pe… etadavoca) (sī.)] – ‘‘devadatto, āvuso, bhikkhūnaṃ evaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā citaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’’ti. Evaṃ vutte āyasmā sāriputto āyasmantaṃ candikāputtaṃ etadavoca – ‘‘na kho, āvuso candikāputta, devadatto bhikkhūnaṃ evaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā citaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. Evañca kho, āvuso, candikāputta, devadatto bhikkhūnaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā cittaṃ suparicitaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’’ti. Dutiyampi kho āyasmā candikāputto bhikkhū āmantesi – ‘‘devadatto, āvuso, bhikkhūnaṃ evaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā citaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’’ti. Dutiyampi kho āyasmā sāriputto āyasmantaṃ candikāputtaṃ etadavoca – ‘‘na kho, āvuso candikāputta, devadatto bhikkhūnaṃ evaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā citaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. Evañca kho, āvuso candikāputta, devadatto bhikkhūnaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā cittaṃ suparicitaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’’ti. Tatiyampi kho āyasmā candikāputto bhikkhū āmantesi – ‘‘devadatto, āvuso, bhikkhūnaṃ evaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā citaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’’ti. Tatiyampi kho āyasmā sāriputto āyasmantaṃ candikāputtaṃ etadavoca – ‘‘na kho, āvuso candikāputta, devadatto bhikkhūnaṃ evaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā citaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. Evañca kho, āvuso candikāputta, devadatto bhikkhūnaṃ dhammaṃ deseti – ‘yato kho, āvuso, bhikkhuno cetasā cittaṃ suparicitaṃ hoti, tassetaṃ bhikkhuno kallaṃ veyyākaraṇāya – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’’’ti. ‘‘Kathañca, āvuso, bhikkhuno cetasā cittaṃ suparicitaṃ hoti? ‘Vītarāgaṃ me citta’nti cetasā cittaṃ suparicitaṃ hoti; ‘vītadosaṃ me citta’nti cetasā cittaṃ suparicitaṃ hoti; ‘vītamohaṃ me citta’nti cetasā cittaṃ suparicitaṃ hoti; ‘asarāgadhammaṃ me citta’nti cetasā cittaṃ suparicitaṃ hoti; ‘asadosadhammaṃ me citta’nti cetasā cittaṃ suparicitaṃ hoti; ‘asamohadhammaṃ me citta’nti cetasā cittaṃ suparicitaṃ hoti; ‘anāvattidhammaṃ me cittaṃ kāmabhavāyā’ti cetasā cittaṃ suparicitaṃ hoti; ‘anāvattidhammaṃ me cittaṃ rūpabhavāyā’ti cetasā cittaṃ suparicitaṃ hoti; ‘anāvattidhammaṃ me cittaṃ arūpabhavāyā’ti cetasā cittaṃ suparicitaṃ hoti. Evaṃ sammā vimuttacittassa kho, āvuso, bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti ṭhitaṃ āneñjappattaṃ, vayaṃ cassānupassati. ‘‘Seyyathāpi, āvuso, silāyūpo soḷasakukkuko. Tassassu aṭṭha kukkū heṭṭhā nemaṅgamā, aṭṭha kukkū upari nemassa. Atha puratthimāya cepi disāya āgaccheyya bhusā vātavuṭṭhi, neva naṃ saṅkampeyya na sampavedheyya; atha pacchimāya… atha uttarāya… atha dakkhiṇāya cepi disāya āgaccheyya bhusā vātavuṭṭhi, neva naṃ saṅkampeyya na sampavedheyya. Taṃ kissa hetu? Gambhīrattā, āvuso, nemassa, sunikhātattā silāyūpassa. Evamevaṃ kho, āvuso, sammā vimuttacittassa bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti ṭhitaṃ āneñjappattaṃ, vayaṃ cassānupassati. ‘‘Bhusā cepi sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā manassa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti; amissīkatamevassa cittaṃ hoti ṭhitaṃ āneñjappattaṃ, vayaṃ cassānupassatī’’ti. Chaṭṭhaṃ.",
      "english": "On one occasion, the venerable Sāriputta and the venerable Candikāputta were staying near Rājagaha, in the Bamboo Grove, at the Squirrels’ Feeding Place. There, the venerable Candikāputta addressed the monastics: ‘Friends, Devadatta teaches the Dhamma to the monastics thus: “When, friends, a monastic’s mind is merely collected, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’”’ When this was said, the venerable Sāriputta said to the venerable Candikāputta: ‘No, friend Candikāputta, Devadatta does not teach the Dhamma to the monastics thus: “When, friends, a monastic’s mind is merely collected, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’” Rather, friend Candikāputta, Devadatta teaches the Dhamma to the monastics thus: “When, friends, a monastic’s mind is thoroughly cultivated, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’”’\n\nFor a second time, the venerable Candikāputta addressed the monastics: ‘Friends, Devadatta teaches the Dhamma to the monastics thus: “When, friends, a monastic’s mind is merely collected, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’”’ For a second time, the venerable Sāriputta said to the venerable Candikāputta: ‘No, friend Candikāputta, Devadatta does not teach the Dhamma to the monastics thus: “When, friends, a monastic’s mind is merely collected, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’” Rather, friend Candikāputta, Devadatta teaches the Dhamma to the monastics thus: “When, friends, a monastic’s mind is thoroughly cultivated, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’”’\n\nFor a third time, the venerable Candikāputta addressed the monastics: ‘Friends, Devadatta teaches the Dhamma to the monastics thus: “When, friends, a monastic’s mind is merely collected, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’”’ For a third time, the venerable Sāriputta said to the venerable Candikāputta: ‘No, friend Candikāputta, Devadatta does not teach the Dhamma to the monastics thus: “When, friends, a monastic’s mind is merely collected, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’” Rather, friend Candikāputta, Devadatta teaches the Dhamma to the monastics thus: “When, friends, a monastic’s mind is thoroughly cultivated, it is proper for that monastic to declare – ‘Birth is exhausted, the holy life has been lived, what was to be done has been done, there is no more for this state of being, I know.’”’\n\n‘And how, friend, is a monastic’s mind thoroughly cultivated? ‘My mind is free from lust’ – in this way the mind is thoroughly cultivated. ‘My mind is free from hatred’ – in this way the mind is thoroughly cultivated. ‘My mind is free from delusion’ – in this way the mind is thoroughly cultivated. ‘My mind is of a nature not to be associated with lust’ – in this way the mind is thoroughly cultivated. ‘My mind is of a nature not to be associated with hatred’ – in this way the mind is thoroughly cultivated. ‘My mind is of a nature not to be associated with delusion’ – in this way the mind is thoroughly cultivated. ‘My mind is of a nature not to return to the sensual realm of existence’ – in this way the mind is thoroughly cultivated. ‘My mind is of a nature not to return to the form realm of existence’ – in this way the mind is thoroughly cultivated. ‘My mind is of a nature not to return to the formless realm of existence’ – in this way the mind is thoroughly cultivated. Indeed, friend, when a monastic’s mind is thus rightly liberated, even though powerful visual objects come into the range of his vision, they do not overpower his mind; his mind remains unmixed, steady, having attained imperturbability, and he discerns their passing away.\n\n‘Just as, friend, a rock pillar sixteen cubits high, with eight cubits beneath the ground and eight cubits above the ground. Even if a strong storm wind were to come from the east, it would not make it waver or tremble; even if a strong storm wind were to come from the west, or from the north, or from the south, it would not make it waver or tremble. What is the reason for that? Because, friend, its foundation is deep, and the rock pillar is firmly embedded.’\n\nJust so, venerable sir, even if very strong forms cognizable by the eye come into the range of a bhikkhu whose mind is rightly liberated, they do not overwhelm his mind. His mind remains unentangled, steadfast, having attained imperturbability, and he discerns their passing away.\n\nEven if very strong sounds cognizable by the ear come into the range of the ear, or very strong odours cognizable by the nose come into the range of the nose, or very strong tastes cognizable by the tongue come into the range of the tongue, or very strong tactile sensations cognizable by the body come into the range of the body, or very strong mental phenomena cognizable by the mind come into the range of the mind, they do not overwhelm his mind. His mind remains unentangled, steadfast, having attained imperturbability, and he discerns their passing away.",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ ද ආයුෂ්මත් චන්දිකාපුත්‍ර ස්ථවිරයන් වහන්සේ ද රජගහ නුවර වේළුවන නම් කලන්දක නිවාප නම් ස්ථානයේ වැඩ වාසය කරති. එහිදී ආයුෂ්මත් චන්දිකාපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළහ: “ඇවැත්නි, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා කරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිතින් (මනසින්) යමක් අදහස් කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය.’”\n\nමෙසේ කී කල්හි ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ ආයුෂ්මත් චන්දිකාපුත්‍ර ස්ථවිරයන් වහන්සේට මෙසේ වදාළහ: “ඇවැත් චන්දිකාපුත්‍රය, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා නොකරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිතින් (මනසින්) යමක් අදහස් කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය’ කියා නොවේ. ඇවැත් චන්දිකාපුත්‍රය, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා කරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිත, මනසින් මනා ලෙස ප්‍රගුණ කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය’ කියා ය.”\n\nදෙවන වරටත් ආයුෂ්මත් චන්දිකාපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළහ: “ඇවැත්නි, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා කරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිතින් (මනසින්) යමක් අදහස් කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය.’”\n\nදෙවන වරටත් ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ ආයුෂ්මත් චන්දිකාපුත්‍ර ස්ථවිරයන් වහන්සේට මෙසේ වදාළහ: “ඇවැත් චන්දිකාපුත්‍රය, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා නොකරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිතින් (මනසින්) යමක් අදහස් කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය’ කියා නොවේ. ඇවැත් චන්දිකාපුත්‍රය, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා කරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිත, මනසින් මනා ලෙස ප්‍රගුණ කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය’ කියා ය.”\n\nතුන්වන වරටත් ආයුෂ්මත් චන්දිකාපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළහ: “ඇවැත්නි, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා කරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිතින් (මනසින්) යමක් අදහස් කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය.’”\n\nතුන්වන වරටත් ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ ආයුෂ්මත් චන්දිකාපුත්‍ර ස්ථවිරයන් වහන්සේට මෙසේ වදාළහ: “ඇවැත් චන්දිකාපුත්‍රය, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා නොකරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිතින් (මනසින්) යමක් අදහස් කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය’ කියා නොවේ. ඇවැත් චන්දිකාපුත්‍රය, දෙවදත්ත තෙමේ භික්ෂූන්ට මෙසේ ධර්මය දේශනා කරයි: ‘ඇවැත්නි, යම් හෙයකින් භික්ෂුවගේ සිත, මනසින් මනා ලෙස ප්‍රගුණ කරන ලද්දේ වේ ද, එබඳු භික්ෂුවකට ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කරන ලදී, මින් මතු මෙබඳු භවයක් නැතැයි දනිමි’ යනුවෙන් ප්‍රකාශ කිරීම සුදුසු ය’ කියා ය.”\n\n“ඇවැත්නි, කෙසේ නම් භික්ෂුවගේ සිත, මනසින් මනාව ප්‍රගුණ කරන ලද්දේ වේ ද? ‘මාගේ සිත රාගයෙන් තොර ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ. ‘මාගේ සිත ද්වේෂයෙන් තොර ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ. ‘මාගේ සිත මෝහයෙන් තොර ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ. ‘මාගේ සිත රාගය පහළ නොවන ස්වභාවයෙන් යුක්ත ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ. ‘මාගේ සිත ද්වේෂය පහළ නොවන ස්වභාවයෙන් යුක්ත ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ. ‘මාගේ සිත මෝහය පහළ නොවන ස්වභාවයෙන් යුක්ත ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ. ‘මාගේ සිත කාමභවයට නැවත නොපැමිණෙන ස්වභාවයෙන් යුක්ත ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ. ‘මාගේ සිත රූපභවයට නැවත නොපැමිණෙන ස්වභාවයෙන් යුක්ත ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ. ‘මාගේ සිත අරූපභවයට නැවත නොපැමිණෙන ස්වභාවයෙන් යුක්ත ය’ යනුවෙන් සිත මනසින් මනාව ප්‍රගුණ කරනු ලැබූවක් වේ.\n\n“ඇවැත්නි, මෙසේ මනාව විමුක්ත වූ සිතක් ඇති භික්ෂුවකට, ඉතා බලවත් වූ චක්ෂුර්විඥානයට අයත් රූප (අරමුණු) ඇසට පැමිණිය ද, ඒවා ඔහුගේ සිත පිරිහීමකට පත් නොකරයි. ඔහුගේ සිත මිශ්‍ර නොවී, නොසැලී, නොසැලෙන ස්වභාවයට පැමිණ, (නිශ්චලව) පවතී. ඔහු ඒවායේ (ඒ රූපයන්ගේ) ක්ෂය වී යාම ම දකි යි. ඇවැත්නි, යම් සේ සොළොස් රියනක් උසැති ගල් කණුවක් වේ ද, එහි අට රියනක් පොළොව යට පිහිටා ද, අට රියනක් පොළොවට ඉහළින් පිහිටා ද, ඉතා බලවත් වූ වටපිටා සුළං වැසි නැගෙනහිර දිශාවෙන් පැමිණිය ද, එය සොලවාලීමට හෝ කම්පා කරවීමට හෝ සමත් නොවේ. එසේ ම බටහිර, උතුර, දකුණ යන දිශාවන්ගෙන් ඉතා බලවත් වූ වටපිටා සුළං වැසි පැමිණිය ද, එය සොලවාලීමට හෝ කම්පා කරවීමට හෝ සමත් නොවේ. ඒ කුමක් හෙයින් ද? ඇවැත්නි, අඩිතාලම ගැඹුරු වීමත්, ගල් කණුව මනාව තදින් පිහිටුවා තිබීමත් හෙයිනි.”\n\nඒ ආකාරයෙන්ම, ඇවැත්නි, සම්මා විමුක්ත වූ සිතක් ඇති භික්ෂුවකට, ඉතා බලවත් වූ චක්ෂුර්විඤ්ඤෙය්‍ය රූප ඇසෙහි ගෝචරයට පැමිණියත්, ඒවා ඔහුගේ සිත පිරියදින්නේ නැත; ඔහුගේ සිත මිශ්‍ර නොවී, ස්ථිරව, ආනෙඤ්ජ්‍යභාවයට පත්වූවක් ලෙස පවතී, තවද ඔහු එහි ක්ෂය වීම ද දකියි.\n\nතවද, ඉතා බලවත් වූ ශ්‍රොත‍්‍රවිඤ්ඤෙය්‍ය ශබ්ද කනෙහි ගෝචරයට පැමිණියත්; ඉතා බලවත් වූ ඝාණවිඤ්ඤෙය්‍ය ගන්ධයන් නාසයෙහි ගෝචරයට පැමිණියත්; ඉතා බලවත් වූ ජිහ්වාවිඤ්ඤෙය්‍ය රසයන් දිවෙහි ගෝචරයට පැමිණියත්; ඉතා බලවත් වූ කායවිඤ්ඤෙය්‍ය ස්පර්ශයන් කයෙහි ගෝචරයට පැමිණියත්; ඉතා බලවත් වූ මනෝවිඤ්ඤෙය්‍ය ධර්මයන් මනසෙහි ගෝචරයට පැමිණියත්, ඒවා ඔහුගේ සිත පිරියදින්නේ නැත; ඔහුගේ සිත මිශ්‍ර නොවී, ස්ථිරව, ආනෙඤ්ජ්‍යභාවයට පත්වූවක් ලෙස පවතී, තවද ඔහු එහි ක්ෂය වීම ද දකියි.",
      "paliTitle": "Silāyūpasuttaṃ"
    },
    {
      "number": 27,
      "pali": "[a. ni. 9.92; saṃ. ni. 5.1024] Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Yato kho, gahapati, ariyasāvakassa pañca bhayāni verāni vūpasantāni honti, catūhi ca sotāpattiyaṅgehi samannāgato hoti, so ākaṅkhamāno attanāva attānaṃ byākareyya – ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto, sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’’’ti. ‘‘Katamāni pañca bhayāni verāni vūpasantāni honti? Yaṃ, gahapati, pāṇātipātī pāṇātipātapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati, samparāyikampi bhayaṃ veraṃ pasavati, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti, pāṇātipātā paṭivirato neva diṭṭhadhammikampi bhayaṃ veraṃ pasavati, na samparāyikampi bhayaṃ veraṃ pasavati, na cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Pāṇātipātā paṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hoti. ‘‘Yaṃ, gahapati, adinnādāyī…pe… kāmesumicchācārī… musāvādī… surāmerayamajjapamādaṭṭhāyī surāmerayamajjapamādaṭṭhānapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati, samparāyikampi bhayaṃ veraṃ pasavati, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti, surāmerayamajjapamādaṭṭhānā paṭivirato neva diṭṭhadhammikampi bhayaṃ veraṃ pasavati, na samparāyikampi bhayaṃ veraṃ pasavati, na cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Surāmerayamajjapamādaṭṭhānā paṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hoti. Imāni pañca bhayāni verāni vūpasantāni honti. ‘‘Katamehi catūhi sotāpattiyaṅgehi samannāgato hoti? Idha, gahapati, ariyasāvako buddhe aveccappasādena samannāgato hoti – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’’’ti. Dhamme aveccappasādena samannāgato hoti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Saṅghe aveccappasādena samannāgato hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho ujuppaṭipanno bhagavato sāvakasaṅgho ñāyappaṭipanno bhagavato sāvakasaṅgho sāmīcippaṭipanno bhagavato sāvakasaṅgho; yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Ariyakantehi sīlehi samannāgato hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi. Imehi catūhi sotāpattiyaṅgehi samannāgato hoti. ‘‘Yato kho, gahapati, ariyasāvakassa imāni pañca bhayāni verāni vūpasantāni honti, imehi ca catūhi sotāpattiyaṅgehi samannāgato hoti, so ākaṅkhamāno attanāva attānaṃ byākareyya – ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto; sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’’’ti. Sattamaṃ.",
      "english": "Then Anāthapiṇḍika the householder approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As Anāthapiṇḍika the householder sat to one side, the Blessed One said to him: \"Householder, when a noble disciple has the five fears and enmities subsided, and is endowed with the four factors of stream-entry, then, if he wishes, he may declare concerning himself: 'I am one for whom hell is destroyed, for whom the animal realm is destroyed, for whom the realm of hungry ghosts is destroyed, for whom all lower, woeful states of deprivation are destroyed; I am a stream-enterer, no longer subject to falling into lower realms, firmly established on the path to awakening.'\"\n\n\"Which are the five fears and enmities that are subsided? Householder, whoever takes life generates fears and enmities in this present life due to taking life, generates fears and enmities in future lives, and experiences mental suffering and distress. One who abstains from taking life does not generate fears and enmities in this present life, nor does he generate fears and enmities in future lives, nor does he experience mental suffering and distress. For one who abstains from taking life, that fear and enmity are thus subsided.\"\n\n\"Householder, whoever takes what is not given generates fears and enmities in this present life due to taking what is not given, generates fears and enmities in future lives, and experiences mental suffering and distress. One who abstains from taking what is not given does not generate fears and enmities in this present life, nor does he generate fears and enmities in future lives, nor does he experience mental suffering and distress. For one who abstains from taking what is not given, that fear and enmity are thus subsided.\nHouseholder, whoever engages in sexual misconduct generates fears and enmities in this present life due to sexual misconduct, generates fears and enmities in future lives, and experiences mental suffering and distress. One who abstains from sexual misconduct does not generate fears and enmities in this present life, nor does he generate fears and enmities in future lives, nor does he experience mental suffering and distress. For one who abstains from sexual misconduct, that fear and enmity are thus subsided.\nHouseholder, whoever speaks falsely generates fears and enmities in this present life due to speaking falsely, generates fears and enmities in future lives, and experiences mental suffering and distress. One who abstains from false speech does not generate fears and enmities in this present life, nor does he generate fears and enmities in future lives, nor does he experience mental suffering and distress. For one who abstains from false speech, that fear and enmity are thus subsided.\nHouseholder, whoever consumes intoxicating drinks and drugs that lead to heedlessness generates fears and enmities in this present life due to consuming intoxicating drinks and drugs that lead to heedlessness, generates fears and enmities in future lives, and experiences mental suffering and distress. One who abstains from consuming intoxicating drinks and drugs that lead to heedlessness does not generate fears and enmities in this present life, nor does he generate fears and enmities in future lives, nor does he experience mental suffering and distress. For one who abstains from consuming intoxicating drinks and drugs that lead to heedlessness, that fear and enmity are thus subsided. These are the five fears and enmities that are subsided.\"\n\n\"With which four factors of stream-entry is he endowed? Here, householder, a noble disciple is endowed with unwavering faith in the Buddha: 'Indeed, the Blessed One is an Arahant, a Fully Self-Awakened One, accomplished in knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.' He is endowed with unwavering faith in the Dhamma: 'The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, onward-leading, to be personally experienced by the wise.' He is endowed with unwavering faith in the Saṅgha: 'The Saṅgha of the Blessed One's disciples is practicing well, practicing uprightly, practicing profoundly, practicing properly; that is, the four pairs of persons, the eight types of individuals – this Saṅgha of the Blessed One's disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, an unsurpassed field of merit for the world.' He is endowed with the virtues dear to the noble ones, virtues that are unbroken, unpierced, unblemished, untarnished, liberating, praised by the wise, ungrasped, and conducive to concentration. With these four factors of stream-entry is he endowed.\"\n\n\"Householder, when a noble disciple has these five fears and enmities subsided, and is endowed with these four factors of stream-entry, then, if he wishes, he may declare concerning himself: 'I am one for whom hell is destroyed, for whom the animal realm is destroyed, for whom the realm of hungry ghosts is destroyed, for whom all lower, woeful states of deprivation are destroyed; I am a stream-enterer, no longer subject to falling into lower realms, firmly established on the path to awakening.'\"",
      "sinhala": "එවිට අනාථපිණ්ඩික ගෘහපති භාග්‍ය‍වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍ය‍වතුන් වහන්සේට වන්දනා කර එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි අනාථපිණ්ඩික ගෘහපතිට භාග්‍ය‍වතුන් වහන්සේ මෙය වදාළ සේක: \"ගෘහපතිය, යම් හෙයකින් ආර්ය ශ්‍ර‍ාවකයාට පස් වැදෑරුම් භය සහ වෛරයන් සන්සිඳී ඇත්ද, ඔහු සෝවාන් අංග සතරෙන් යුක්ත වේද, ඔහු කැමති නම් තමන් විසින්ම තමන් ගැන ප්‍ර‍කාශ කරන්නේය – ‘මම නිරයෙන් මුදා හල ලද්දෙක්මි, තිරිසන් යෝනියෙන් මුදා හල ලද්දෙක්මි, ප්‍රේත විෂයයෙන් මුදා හල ලද්දෙක්මි, අපාය දුර්ගති විනිපාතයෙන් මුදා හල ලද්දෙක්මි. මම සෝවාන් වූවෙක්මි, විනාශයට නොපැමිණෙන ස්වභාව ඇත්තෙක්මි, නියත වශයෙන්ම සම්බෝධියට පමුණුවන මග ඇත්තෙක්මි’\" යනුවෙනි.\n\n\"ගෘහපතිය, ඒ පස් වැදෑරුම් භය සහ වෛරයන් කවරේද, යම් භය සහ වෛරයන් සන්සිඳී ඇත්ද? ගෘහපතිය, යමෙක් පණ නසන්නේ නම්, ප්‍රාණඝාතය හේතුකොටගෙන මේ ආත්ම භාවයේදීද භය සහ වෛරය උපදවා ගන්නේය, පරලොවදීද භය සහ වෛරය උපදවා ගන්නේය, සිතෙහි දුක් දොම්නස් විඳින්නේය. ප්‍රාණඝාතයෙන් වැළකුණු තැනැත්තා මේ ආත්ම භාවයේදී භය සහ වෛරය නො උපදවා ගන්නේය, පරලොවදීද භය සහ වෛරය නො උපදවා ගන්නේය, සිතෙහි දුක් දොම්නස් නො විඳින්නේය. ප්‍රාණඝාතයෙන් වැළකුණු තැනැත්තාට ඒ භය සහ වෛරය මෙසේ සන්සිඳී ගොස් ඇත.\n\n\"ගෘහපතිය, යමෙක් අනුන් සතු දේ හොරෙන් ගන්නේ නම්... යමෙක් කාමයන්හි වරදවා හැසිරෙන්නේ නම්... යමෙක් බොරු කියන්නේ නම්... යමෙක් මත්පැන් පානය කොට ප්‍ර‍මාදයට පැමිණෙන්නේ නම්, මත්පැන් පානය හේතුකොටගෙන මේ ආත්ම භාවයේදීද භය සහ වෛරය උපදවා ගන්නේය, පරලොවදීද භය සහ වෛරය උපදවා ගන්නේය, සිතෙහි දුක් දොම්නස් විඳින්නේය. මත්පැන් පානයෙන් වැළකුණු තැනැත්තා මේ ආත්ම භාවයේදී භය සහ වෛරය නො උපදවා ගන්නේය, පරලොවදීද භය සහ වෛරය නො උපදවා ගන්නේය, සිතෙහි දුක් දොම්නස් නො විඳින්නේය. මත්පැන් පානයෙන් වැළකුණු තැනැත්තාට ඒ භය සහ වෛරය මෙසේ සන්සිඳී ගොස් ඇත. මේවා පස් වැදෑරුම් භය සහ වෛරයන්ය, යම් භය සහ වෛරයන් සන්සිඳී ඇත්ද.\"\n\n\"ඔහු කවර සෝවාන් අංග සතරෙන් යුක්ත වේද? ගෘහපතිය, මෙහිලා ආර්ය ශ්‍ර‍ාවකයා බුදුරජාණන් වහන්සේ කෙරෙහි නොසෙල්වෙන ප්‍ර‍සාදයකින් යුක්ත වේ. ‘ඒ භාග්‍ය‍වතුන් වහන්සේ කෙලෙස් දුරුකළ, පූජාවන්ට සුදුසු වූ අරහං, නිරවද්‍යව අවබෝධ කළ සම්මාසම්බුද්ධ, විද්‍යාවෙන් හා චරණයෙන් යුක්ත වූ විජ්ජාචරණසම්පන්න, මනා ගමනින් යුක්ත වූ සුගත, ලෝකය දන්නා ලෝකවිදූ, පුරුෂයන් දමනය කිරීමෙහි අතිශ්‍රේෂ්ඨ සාරථී වූ අනුත්තරෝ පුරිසදම්මසාරථී, දෙවිමිනිසුන්ට ශාස්තෘ වූ සත්ථා දේවමනුස්සානං, අවබෝධ කළ බුද්ධෝ, භාග්‍ය‍වත් වූ භගවා යන ගුණාංගවලින් යුක්ත වන සේක.’ ධර්‍මය කෙරෙහි නොසෙල්වෙන ප්‍ර‍සාදයකින් යුක්ත වේ. ‘භාග්‍ය‍වතුන් වහන්සේ විසින් ධර්‍මය මැනවින් දේශනා කරන ලද්දේය, එය ස්වයංව දැකිය හැක්කේය, කල් නොයවා විපාක දෙන්නේය, 'එනු මැන දැකපල්ලා' යැයි ඇරයුම් කළ හැක්කේය, නිවනට පමුණුවන්නේය, ප්‍ර‍ඥාවන්තයින් විසින් තම තමන් තුළින්ම අවබෝධ කරගත යුත්තේය.’ සංඝයා කෙරෙහි නොසෙල්වෙන ප්‍ර‍සාදයකින් යුක්ත වේ. ‘භාග්‍ය‍වතුන් වහන්සේගේ ශ්‍ර‍ාවක සංඝයා මැනවින් පිළිපන්ය, භාග්‍ය‍වතුන් වහන්සේගේ ශ්‍ර‍ාවක සංඝයා ඍජුව පිළිපන්ය, භාග්‍ය‍වතුන් වහන්සේගේ ශ්‍ර‍ාවක සංඝයා ධර්‍මයට අනුව පිළිපන්ය, භාග්‍ය‍වතුන් වහන්සේගේ ශ්‍ර‍ාවක සංඝයා සුදුසු පරිදි පිළිපන්ය. එනම් පුරුෂ යුගල සතර දෙනෙක්ද, අට දෙනෙක් වූ ආර්ය පුද්ගලයන්ද වන මේ භාග්‍ය‍වතුන් වහන්සේගේ ශ්‍ර‍ාවක සංඝයා ආහුණෙය්‍ය (දුර සිට ගෙනැවිත් දිය යුතු), පාහුණෙය්‍ය (ආගන්තුක සත්කාර කළ යුතු), දක්ඛිණෙය්‍ය (දක්ෂිණාවන් ලැබීමට සුදුසු), අඤ්ජලිකරණීය (දෝත මුදුන් තබා වන්දනා කළ යුතු) වන අතර, ලෝකයාට අනුත්තර වූ පින් කෙතක් වන්නේය.’ කඩ නොවූ, සිදුරු නොවූ, කිළිටි නොවූ, පැල්ලම් නොවූ, නිදහස් වූ, ප්‍ර‍ඥාවන්තයින් විසින් ප්‍ර‍ශංසා කරන ලද, තෘෂ්ණාවෙන් නොඅල්වා ගත්, සමාධියට උපකාර වන ආර්ය‍කාන්ත ශීලයන්ගෙන් යුක්ත වේ. ඔහු මේ සෝවාන් අංග සතරෙන් යුක්ත වන්නේය.\"\n\n\"ගෘහපතිය, යම් හෙයකින් ආර්ය ශ්‍ර‍ාවකයාට මේ පස් වැදෑරුම් භය සහ වෛරයන් සන්සිඳී ඇත්ද, ඔහු මේ සෝවාන් අංග සතරෙන් යුක්ත වේද, ඔහු කැමති නම් තමන් විසින්ම තමන් ගැන ප්‍ර‍කාශ කරන්නේය – ‘මම නිරයෙන් මුදා හල ලද්දෙක්මි, තිරිසන් යෝනියෙන් මුදා හල ලද්දෙක්මි, ප්‍රේත විෂයයෙන් මුදා හල ලද්දෙක්මි, අපාය දුර්ගති විනිපාතයෙන් මුදා හල ලද්දෙක්මි. මම සෝවාන් වූවෙක්මි, විනාශයට නොපැමිණෙන ස්වභාව ඇත්තෙක්මි, නියත වශයෙන්ම සම්බෝධියට පමුණුවන මග ඇත්තෙක්මි’\" යනුවෙනි.\n\nසත්වන සූත්‍රයයි.",
      "paliTitle": "Paṭhamaverasuttaṃ"
    },
    {
      "number": 28,
      "pali": "[saṃ. ni. 5.1025] ‘‘Yato kho, bhikkhave, ariyasāvakassa pañca bhayāni verāni vūpasantāni honti, catūhi ca sotāpattiyaṅgehi samannāgato hoti, so ākaṅkhamāno attanāva attānaṃ byākareyya – ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto; sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’’’ti. ‘‘Katamāni pañca bhayāni verāni vūpasantāni honti? Yaṃ, bhikkhave, pāṇātipātī pāṇātipātapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati, samparāyikampi bhayaṃ veraṃ pasavati, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti, pāṇātipātā paṭivirato…pe… evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hoti. ‘‘Yaṃ, bhikkhave, adinnādāyī…pe… surāmerayamajjapamādaṭṭhāyī surāmerayamajjapamādaṭṭhānapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati, samparāyikampi bhayaṃ veraṃ pasavati, cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti, surāmerayamajjapamādaṭṭhānā paṭivirato neva diṭṭhadhammikampi bhayaṃ veraṃ pasavati, na samparāyikampi bhayaṃ veraṃ pasavati, na cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Surāmerayamajjapamādaṭṭhānā paṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hoti. Imāni pañca bhayāni verāni vūpasantāni honti. ‘‘Katamehi catūhi sotāpattiyaṅgehi samannāgato hoti? Idha, bhikkhave, ariyasāvako buddhe aveccappasādena samannāgato hoti – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Dhamme…pe… saṅghe… ariyakantehi sīlehi samannāgato hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi. Imehi catūhi sotāpattiyaṅgehi samannāgato hoti. ‘‘Yato kho, bhikkhave, ariyasāvakassa imāni pañca bhayāni verāni vūpasantāni honti, imehi ca catūhi sotāpattiyaṅgehi samannāgato hoti, so ākaṅkhamāno attanāva attānaṃ byākareyya – ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto; sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’’’ti. Aṭṭhamaṃ.",
      "english": "Indeed, monks, when for a noble disciple the five dangers and enmities are quelled, and he is endowed with the four factors of stream-entry, then, if he wishes, he may declare about himself: ‘I am one for whom hell has been destroyed, for whom the animal realm has been destroyed, for whom the realm of hungry ghosts has been destroyed, for whom all states of woe, bad destinations, and lower realms have been destroyed; I am a stream-entrant, not subject to falling into states of woe, fixed, and bound for full enlightenment.’\n\nWhich are the five dangers and enmities that are quelled? Monks, whoever takes life, due to taking life, incurs danger and enmity in this present life, and incurs danger and enmity in future lives, and experiences mental suffering and dejection. But one who refrains from taking life does not incur danger and enmity in this present life, nor does he incur danger and enmity in future lives, nor does he experience mental suffering and dejection. For one who refrains from taking life, in this way that danger and enmity is quelled.\n\nMonks, whoever takes what is not given, due to taking what is not given, incurs danger and enmity in this present life, and incurs danger and enmity in future lives, and experiences mental suffering and dejection. But one who refrains from taking what is not given, does not incur danger and enmity in this present life, nor does he incur danger and enmity in future lives, nor does he experience mental suffering and dejection. For one who refrains from taking what is not given, in this way that danger and enmity is quelled. Monks, whoever engages in sexual misconduct, due to sexual misconduct, incurs danger and enmity in this present life, and incurs danger and enmity in future lives, and experiences mental suffering and dejection. But one who refrains from sexual misconduct, does not incur danger and enmity in this present life, nor does he incur danger and enmity in future lives, nor does he experience mental suffering and dejection. For one who refrains from sexual misconduct, in this way that danger and enmity is quelled. Monks, whoever speaks falsely, due to false speech, incurs danger and enmity in this present life, and incurs danger and enmity in future lives, and experiences mental suffering and dejection. But one who refrains from false speech, does not incur danger and enmity in this present life, nor does he incur danger and enmity in future lives, nor does he experience mental suffering and dejection. For one who refrains from false speech, in this way that danger and enmity is quelled. And monks, whoever indulges in distilled and fermented intoxicants, which are the basis for heedlessness, due to indulging in distilled and fermented intoxicants, which are the basis for heedlessness, incurs danger and enmity in this present life, and incurs danger and enmity in future lives, and experiences mental suffering and dejection. But one who refrains from distilled and fermented intoxicants, which are the basis for heedlessness, does not incur danger and enmity in this present life, nor does he incur danger and enmity in future lives, nor does he experience mental suffering and dejection. For one who refrains from distilled and fermented intoxicants, which are the basis for heedlessness, in this way that danger and enmity is quelled. These are the five dangers and enmities that are quelled.\n\nWith which four factors of stream-entry is he endowed? Here, monks, a noble disciple is endowed with unwavering confidence in the Buddha, thinking: ‘The Blessed One is indeed Arahant, Perfectly Self-Awakened, accomplished in true knowledge and conduct, sublime, knower of worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.’ He is endowed with unwavering confidence in the Dhamma, thinking: ‘The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ He is endowed with unwavering confidence in the Saṅgha, thinking: ‘The Saṅgha of the Blessed One’s disciples is practicing the good way, practicing the straight way, practicing the true way, practicing the proper way; that is, the four pairs of noble persons, the eight types of individuals — this Saṅgha of the Blessed One’s disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’ And he is endowed with the virtues cherished by the noble ones: unbroken, untorn, unblemished, unblotched, liberating, praised by the wise, ungrasped by craving, and conducive to concentration. He is endowed with these four factors of stream-entry.\n\nIndeed, monks, when for a noble disciple these five dangers and enmities are quelled, and he is endowed with these four factors of stream-entry, then, if he wishes, he may declare about himself: ‘I am one for whom hell has been destroyed, for whom the animal realm has been destroyed, for whom the realm of hungry ghosts has been destroyed, for whom all states of woe, bad destinations, and lower realms have been destroyed; I am a stream-entrant, not subject to falling into states of woe, fixed, and bound for full enlightenment.’",
      "sinhala": "මහණෙනි, යම් හෙයකින් ආර්යය ශ්‍රාවකයාට පස් වැදෑරුම් භය සහ වෛරයන් සංසිඳී ඇත්තාහ, සිව් වැදෑරුම් සෝතාපත්ති අංගයන්ගෙන් යුක්ත වෙයි නම්, ඔහු කැමති වන්නේ නම් තමා විසින්ම තමා ප්‍රකාශ කරන්නේය – ‘මම නිරයෙන් ක්ෂය වූවෙමි, තිරිසන් යෝනියෙන් ක්ෂය වූවෙමි, ප්‍රේත විෂයයෙන් ක්ෂය වූවෙමි, අපාය දුර්ගති විනිපාතයෙන් ක්ෂය වූවෙමි; මම සෝවාන් වූවෙමි, (අපායට) නොවැටෙන ස්වභාවය ඇත්තෙක්මි, නියත වූ, සම්බෝධිය පරම කොට ඇත්තෙක්මි’ කියාය.\n\nකවර නම් පස් වැදෑරුම් භය සහ වෛරයන් සංසිඳී ඇත්තාහුද? මහණෙනි, යම් ප්‍රාණඝාත කරන්නා ප්‍රාණඝාතය හේතුකොටගෙන මේ ආත්මයේදීද භය සහ වෛරයන් උපදවයි, පරලොවදීද භය සහ වෛරයන් උපදවයි, චෛතසික දුක් දොම්නස් විඳියි. ප්‍රාණඝාතයෙන් වැළකුණු කල්හි ඔහු මේ ආත්මයේදී භය සහ වෛරයන් උපදවන්නේද නැත, පරලොවදීද භය සහ වෛරයන් උපදවන්නේද නැත, චෛතසික දුක් දොම්නස් විඳින්නේද නැත. මෙසේ ඒ භය සහ වෛරය සංසිඳී ඇත්තේ වෙයි.\n\nමහණෙනි, යම් අදින්නාදානයෙහි, කාමේසුමිච්ඡාචාරයෙහි, මුසාවාදයෙහි, මත්පැන් පානය කිරීමෙහි හැසිරෙන්නා එම ක්‍රියා හේතුකොටගෙන මේ ආත්මයේදීද භය සහ වෛරයන් උපදවයි, පරලොවදීද භය සහ වෛරයන් උපදවයි, චෛතසික දුක් දොම්නස් විඳියි. මත්පැන් පානය කිරීමෙන් වැළකුණු කල්හි ඔහු මේ ආත්මයේදී භය සහ වෛරයන් උපදවන්නේද නැත, පරලොවදීද භය සහ වෛරයන් උපදවන්නේද නැත, චෛතසික දුක් දොම්නස් විඳින්නේද නැත. මත්පැන් පානය කිරීමෙන් වැළකුණු කල්හි මෙසේ ඒ භය සහ වෛරය සංසිඳී ඇත්තේ වෙයි. මේවා පස් වැදෑරුම් සංසිඳී ඇති භය සහ වෛරයන් වෙති.\n\nකවර නම් සිව් වැදෑරුම් සෝතාපත්ති අංගයන්ගෙන් යුක්ත වෙයිද? මහණෙනි, මේ ශාසනයෙහි ආර්යය ශ්‍රාවකයා බුදුරජාණන් වහන්සේ කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත වෙයි – ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං වන සේක, සම්මා සම්බුද්ධ වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තර පුරිසදම්ම සාරථී වන සේක, දෙවිමිනිසුනට ශාස්තෘ වන සේක, බුද්ධ වන සේක, භාග්‍යවත් වන සේක’ යනුවෙනි. ධර්මය කෙරෙහිද නොසැලෙන පැහැදීමෙන් යුක්ත වෙයි – ‘භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනා කොට දේශනා කරන ලද්දකි, සන්දිට්ඨිකය (මේ ආත්මයේදී දැකිය හැකි), අකාලිකය (කල් නොගනී), ඒහිපස්සිකය (එව මෙවයි දැක්විය හැකි), ඕපනයිකය (තමා වෙත පමුණුවා ගත හැකි), ප්‍රත්‍යත්මයෙන් වින්දනය කළ හැකි ප්‍රඥාවන්තයින් විසින් දත යුත්තකි’ යනුවෙනි. සංඝයා කෙරෙහිද නොසැලෙන පැහැදීමෙන් යුක්ත වෙයි – ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා මනා ප්‍රතිපදාවෙන් යුක්තය, ඍජු ප්‍රතිපදාවෙන් යුක්තය, ඥාය ප්‍රතිපදාවෙන් යුක්තය, සාමීචී ප්‍රතිපදාවෙන් යුක්තය; එනම්, පුරිස යුගල හතරක් වූ, පුරිස පුද්ගල අට දෙනෙකි; ඒ භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ආහුණෙය්‍යය (දුර සිට ගෙනැවිත් දිය යුතු), පාහුණෙය්‍යය (ආගන්තුක සත්කාර වශයෙන් දිය යුතු), දක්ඛිණෙය්‍යය (දක්ෂිණා දිය යුතු), අඤ්ජලිකරණීයය (අඤ්ජලි කළ යුතු) වන සේක; ලෝකයාට අනුත්තර වූ පින් කෙතක් වන සේක’ යනුවෙනි. තවද, ආර්යය කාන්ත ශීලයන්ගෙන් යුක්ත වෙයි, ඒ ශීලයෝ කඩ නොවූ, සිදුරු නොවූ, කිලිටි නොවූ, අවර්ණ නොවූ, නිදහස් වූ, ප්‍රඥාවන්තයින් විසින් ප්‍රශංසා කරන ලද, තෘෂ්ණා දෘෂ්ටි දෙකින් නොගැටුණු, සමාධියට උපකාරී වන ස්වභාව ඇත්තෝ වෙති. මේ සිව් වැදෑරුම් සෝතාපත්ති අංගයන්ගෙන් යුක්ත වෙයි.\n\nමහණෙනි, යම් හෙයකින් ආර්යය ශ්‍රාවකයාට මේ පස් වැදෑරුම් භය සහ වෛරයන් සංසිඳී ඇත්තාහ, මේ සිව් වැදෑරුම් සෝතාපත්ති අංගයන්ගෙන් යුක්ත වෙයි නම්, ඔහු කැමති වන්නේ නම් තමා විසින්ම තමා ප්‍රකාශ කරන්නේය – ‘මම නිරයෙන් ක්ෂය වූවෙමි, තිරිසන් යෝනියෙන් ක්ෂය වූවෙමි, ප්‍රේත විෂයයෙන් ක්ෂය වූවෙමි, අපාය දුර්ගති විනිපාතයෙන් ක්ෂය වූවෙමි; මම සෝවාන් වූවෙමි, (අපායට) නොවැටෙන ස්වභාවය ඇත්තෙක්මි, නියත වූ, සම්බෝධිය පරම කොට ඇත්තෙක්මි’ කියාය.",
      "paliTitle": "Dutiyaverasuttaṃ"
    },
    {
      "number": 29,
      "pali": "[vibha. 960; dī. ni. 3.340; a. ni. 10.79] ‘‘Navayimāni, bhikkhave, āghātavatthūni. Katamāni nava? ‘Anatthaṃ me acarī’ti āghātaṃ bandhati; ‘anatthaṃ me caratī’ti āghātaṃ bandhati; ‘anatthaṃ me carissatī’ti āghātaṃ bandhati; ‘piyassa me manāpassa anatthaṃ acarī’ti…pe… ‘anatthaṃ caratī’ti…pe… ‘anatthaṃ carissatī’ti āghātaṃ bandhati; ‘appiyassa me amanāpassa atthaṃ acarī’ti …pe… ‘atthaṃ caratī’ti…pe… ‘atthaṃ carissatī’ti āghātaṃ bandhati. Imāni kho, bhikkhave, nava āghātavatthūnī’’ti. Navamaṃ.",
      "english": "Monks, these are the nine grounds for resentment. Which nine? One harbors resentment, thinking: ‘He/she caused me harm.’ One harbors resentment, thinking: ‘He/she is causing me harm.’ One harbors resentment, thinking: ‘He/she will cause me harm.’ One harbors resentment, thinking: ‘He/she caused harm to my dear and agreeable one.’ One harbors resentment, thinking: ‘He/she is causing harm to my dear and agreeable one.’ One harbors resentment, thinking: ‘He/she will cause harm to my dear and agreeable one.’ One harbors resentment, thinking: ‘He/she brought benefit to my disliked and disagreeable one.’ One harbors resentment, thinking: ‘He/she is bringing benefit to my disliked and disagreeable one.’ One harbors resentment, thinking: ‘He/she will bring benefit to my disliked and disagreeable one.’ Monks, these are indeed the nine grounds for resentment.",
      "sinhala": "මහණෙනි, ආඝාත වස්තූන් නවයක් ඇත. ඒ නවය කවරේද?\n‘මොහු මට අහිතක් කළේය’ කියා ආඝාතය බඳියි. ‘මොහු මට අහිතක් කරන්නේය’ කියා ආඝාතය බඳියි. ‘මොහු මට අහිතක් කරනු ඇත’ කියා ආඝාතය බඳියි. ‘මොහු මාගේ ප්‍රිය මනාප පුද්ගලයාට අහිතක් කළේය’ කියා ආඝාතය බඳියි. ‘මොහු මාගේ ප්‍රිය මනාප පුද්ගලයාට අහිතක් කරන්නේය’ කියා ආඝාතය බඳියි. ‘මොහු මාගේ ප්‍රිය මනාප පුද්ගලයාට අහිතක් කරනු ඇත’ කියා ආඝාතය බඳියි. ‘මොහු මාගේ අප්‍රිය අමනාප පුද්ගලයාට හිතක් කළේය’ කියා ආඝාතය බඳියි. ‘මොහු මාගේ අප්‍රිය අමනාප පුද්ගලයාට හිතක් කරන්නේය’ කියා ආඝාතය බඳියි. ‘මොහු මාගේ අප්‍රිය අමනාප පුද්ගලයාට හිතක් කරනු ඇත’ කියා ආඝාතය බඳියි. මහණෙනි, මේවා ආඝාත වස්තූන් නවයයි.",
      "paliTitle": "Āghātavatthusuttaṃ"
    },
    {
      "number": 30,
      "pali": "[dī. ni. 3.340, 359] ‘‘Navayime, bhikkhave, āghātapaṭivinayā. Katame nava? ‘Anatthaṃ me acari [acarīti (syā.), evaṃ ‘‘carati, carissati’’ padesupi], taṃ kutettha labbhā’ti āghātaṃ paṭivineti; ‘anatthaṃ me carati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti; ‘anatthaṃ me carissati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti; piyassa me manāpassa anatthaṃ acari…pe… anatthaṃ carati…pe… ‘anatthaṃ carissati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti; appiyassa me amanāpassa atthaṃ acari… pe… atthaṃ carati…pe… ‘atthaṃ carissati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti. Ime kho, bhikkhave, nava āghātapaṭivinayā’’ti. Dasamaṃ.",
      "english": "Monks, there are these nine ways to remove ill-will. Which nine?\n\n‘He acted harmfully towards me. How could one possibly have prevented that?’—thus one removes ill-will.\n‘He acts harmfully towards me. How could one possibly prevent that?’—thus one removes ill-will.\n‘He will act harmfully towards me. How could one possibly prevent that?’—thus one removes ill-will.\n\n‘He acted harmfully towards someone dear and agreeable to me. How could one possibly have prevented that?’—thus one removes ill-will.\n‘He acts harmfully towards someone dear and agreeable to me. How could one possibly prevent that?’—thus one removes ill-will.\n‘He will act harmfully towards someone dear and agreeable to me. How could one possibly prevent that?’—thus one removes ill-will.\n\n‘He acted beneficially towards someone disliked and disagreeable to me. How could one possibly have prevented that?’—thus one removes ill-will.\n‘He acts beneficially towards someone disliked and disagreeable to me. How could one possibly prevent that?’—thus one removes ill-will.\n‘He will act beneficially towards someone disliked and disagreeable to me. How could one possibly prevent that?’—thus one removes ill-will.\n\nThese, monks, are the nine ways to remove ill-will.",
      "sinhala": "භික්ෂූණි, ආඝාතය දුරු කිරීමේ ක්‍රම නවයකි. ඒ නවය කවරේද? අනුන් මට අහිතක් කළේය. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි; අනුන් මට අහිතක් කරයි. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි; අනුන් මට අහිතක් කරනු ඇත. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි; මට ප්‍රිය මනාප කෙනෙකුට අනුන් අහිතක් කළේය. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි; මට ප්‍රිය මනාප කෙනෙකුට අනුන් අහිතක් කරයි. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි; මට ප්‍රිය මනාප කෙනෙකුට අනුන් අහිතක් කරනු ඇත. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි; මට අප්‍රිය අමනාප කෙනෙකුට අනුන් හිතක් කළේය. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි; මට අප්‍රිය අමනාප කෙනෙකුට අනුන් හිතක් කරයි. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි; මට අප්‍රිය අමනාප කෙනෙකුට අනුන් හිතක් කරනු ඇත. එය කෙසේ නම් වෙනස් කළ හැකිදැයි සිතා ආඝාතය දුරු කරයි. භික්ෂූණි, ආඝාතය දුරු කිරීමේ මේ ක්‍රම නවයයි.",
      "paliTitle": "Āghātapaṭivinayasuttaṃ"
    },
    {
      "number": 31,
      "pali": "‘‘Navayime, bhikkhave, anupubbanirodhā. Katame nava? Paṭhamaṃ jhānaṃ samāpannassa kāmasaññā [āmissasaññā (syā.)] niruddhā hoti; dutiyaṃ jhānaṃ samāpannassa vitakkavicārā niruddhā honti; tatiyaṃ jhānaṃ samāpannassa pīti niruddhā hoti; catutthaṃ jhānaṃ samāpannassa assāsapassāsā niruddhā honti; ākāsānañcāyatanaṃ samāpannassa rūpasaññā niruddhā hoti; viññāṇañcāyatanaṃ samāpannassa ākāsānañcāyatanasaññā niruddhā hoti; ākiñcaññāyatanaṃ samāpannassa viññāṇañcāyatanasaññā niruddhā hoti; nevasaññānāsaññāyatanaṃ samāpannassa ākiñcaññāyatanasaññā niruddhā hoti; saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca niruddhā honti. Ime kho, bhikkhave, nava anupubbanirodhā’’ti [dī. ni. 3.344, 349]. Ekādasamaṃ. Sattāvāsavaggo tatiyo. ",
      "english": "Monks, these are the nine successive cessations. Which nine?\n\nFor one who has attained the first jhana, the perception of sensuality is ceased. For one who has attained the second jhana, initial and sustained application of mind are ceased. For one who has attained the third jhana, rapture is ceased. For one who has attained the fourth jhana, respiration is ceased. For one who has attained the sphere of infinite space, the perception of material form is ceased. For one who has attained the sphere of infinite consciousness, the perception of the sphere of infinite space is ceased. For one who has attained the sphere of nothingness, the perception of the sphere of infinite consciousness is ceased. For one who has attained the sphere of neither perception nor non-perception, the perception of the sphere of nothingness is ceased. For one who has attained the cessation of perception and feeling, perception and feeling are ceased.\n\nThese, monks, are the nine successive cessations.",
      "sinhala": "මහණෙනි, මේ අනුපූර්ව නිරෝධ නවයකි. කවරේද ඒ නවය?\n\nපළමුවැනි ධ්‍යානයට සමවැදුනකුට කාමසඤ්ඤාව (කාමයන් කෙරෙහි හටගන්නා වූ සංඥාව) නිරුද්ධ වේ. දෙවැනි ධ්‍යානයට සමවැදුනකුට විතර්ක විචාරයෝ නිරුද්ධ වෙත්. තුන්වැනි ධ්‍යානයට සමවැදුනකුට ප්‍රීතිය නිරුද්ධ වේ. සතරවැනි ධ්‍යානයට සමවැදුනකුට ආශ්වාස ප්‍රශ්වාසයෝ නිරුද්ධ වෙත්. ආකාස අනන්ත ආයතනයට සමවැදුනකුට රූපසඤ්ඤාව නිරුද්ධ වේ. විඤ්ඤාණ අනන්ත ආයතනයට සමවැදුනකුට ආකාස අනන්ත ආයතන සඤ්ඤාව නිරුද්ධ වේ. ආකිඤ්චඤ්ඤායතනයට සමවැදුනකුට විඤ්ඤාණ අනන්ත ආයතන සඤ්ඤාව නිරුද්ධ වේ. නේවසඤ්ඤා නාසඤ්ඤායතනයට සමවැදුනකුට ආකිඤ්චඤ්ඤායතන සඤ්ඤාව නිරුද්ධ වේ. සඤ්ඤා වේදයිත නිරෝධයට සමවැදුනකුට සඤ්ඤාවත් වේදනාවත් නිරුද්ධ වෙත්.\n\nමහණෙනි, මේවා අනුපූර්ව නිරෝධ නවයයි.",
      "paliTitle": "Anupubbanirodhasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Tassuddānaṃ – Tiṭhānaṃ khaḷuṅko taṇhā, sattapaññā silāyupo; Dve verā dve āghātāni, anupubbanirodhena cāti.",
    "english": "",
    "sinhala": ""
  }
}