{
  "id": "an9.1",
  "title": {
    "pali": "Sambodhivaggo",
    "english": "The Chapter on Complete Enlightenment",
    "sinhala": "සම්බෝධි වග්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘Sace, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘sambodhipakkhikānaṃ [sambodhapakkhikānaṃ (sī. syā. pī.)], āvuso, dhammānaṃ kā upanisā bhāvanāyā’ti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ kinti byākareyyāthā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā…pe… bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Sace, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘sambodhipakkhikānaṃ, āvuso, dhammānaṃ kā upanisā bhāvanāyā’ti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘‘Idhāvuso, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. Sambodhipakkhikānaṃ, āvuso, dhammānaṃ ayaṃ paṭhamā upanisā bhāvanāya. ‘‘Puna caparaṃ, āvuso, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Sambodhipakkhikānaṃ, āvuso, dhammānaṃ ayaṃ dutiyā upanisā bhāvanāya. ‘‘Puna caparaṃ, āvuso, bhikkhu yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā santuṭṭhikathā pavivekakathā asaṃsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī hoti akicchalābhī akasiralābhī. Sambodhipakkhikānaṃ, āvuso, dhammānaṃ ayaṃ tatiyā upanisā bhāvanāya. ‘‘Puna caparaṃ, āvuso, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Sambodhipakkhikānaṃ, āvuso, dhammānaṃ ayaṃ catutthī upanisā bhāvanāya. ‘‘Puna caparaṃ, āvuso, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Sambodhipakkhikānaṃ, āvuso, dhammānaṃ ayaṃ pañcamī upanisā bhāvanāya’’. ‘‘Kalyāṇamittassetaṃ, bhikkhave, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa – sīlavā bhavissati, pātimokkhasaṃvarasaṃvuto viharissati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhissati sikkhāpadesu. ‘‘Kalyāṇamittassetaṃ, bhikkhave, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa – yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā santuṭṭhikathā pavivekakathā asaṃsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī bhavissati akicchalābhī akasiralābhī. ‘‘Kalyāṇamittassetaṃ, bhikkhave, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa – āraddhavīriyo viharissati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. ‘‘Kalyāṇamittassetaṃ, bhikkhave, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa – paññavā bhavissati udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. ‘‘Tena ca pana, bhikkhave, bhikkhunā imesu pañcasu dhammesu patiṭṭhāya cattāro dhammā uttari [uttariṃ (sī. syā. pī.)] bhāvetabbā – asubhā bhāvetabbā rāgassa pahānāya, mettā bhāvetabbā byāpādassa pahānāya, ānāpānassati [ānāpānasati (sī. pī.)] bhāvetabbā vitakkupacchedāya, aniccasaññā bhāvetabbā asmimānasamugghātāya. Aniccasaññino, bhikkhave, anattasaññā saṇṭhāti. Anattasaññī asmimānasamugghātaṃ pāpuṇāti diṭṭheva dhamme nibbāna’’nti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the bhikkhus: \"Bhikkhus, if wanderers of other sects were to ask you, 'Friends, what is the support for the cultivation of the qualities conducive to awakening?', how would you, bhikkhus, being asked thus by those wanderers of other sects, answer?\" \"Venerable sir, our teachings have the Blessed One as their root, the Blessed One is our guide, the Blessed One is our refuge. Having heard from the Blessed One, the bhikkhus will bear it in mind.\" \"In that case, bhikkhus, listen and attend carefully; I shall speak.\" \"Yes, venerable sir,\" those bhikkhus replied to the Blessed One. The Blessed One said this: \"Bhikkhus, if wanderers of other sects were to ask you, 'Friends, what is the support for the cultivation of the qualities conducive to awakening?', being asked thus, bhikkhus, you should answer those wanderers of other sects in this way:\n\n\"'Here, friends, a bhikkhu is a good friend, a good companion, a good associate. This is the first support for the cultivation of the qualities conducive to awakening.\n\n\"Further, friends, a bhikkhu is virtuous, he dwells restrained by the monastic code, accomplished in conduct and resort, seeing danger even in the slightest faults, undertaking and training in the training rules. This is the second support for the cultivation of the qualities conducive to awakening.\n\n\"Further, friends, a bhikkhu obtains at will, without difficulty, without trouble, talk that is conducive to effacement and to the opening up of the mind, that is to say: talk on having few desires, talk on contentment, talk on seclusion, talk on non-entanglement, talk on the arousal of energy, talk on virtue, talk on concentration, talk on wisdom, talk on liberation, and talk on the knowledge and vision of liberation. This is the third support for the cultivation of the qualities conducive to awakening.\n\n\"Further, friends, a bhikkhu lives with aroused energy for the abandonment of unwholesome states and for the acquisition of wholesome states; he is strong, firm in exertion, one who does not cast off the burden in wholesome states. This is the fourth support for the cultivation of the qualities conducive to awakening.\n\n\"Further, friends, a bhikkhu is wise, endowed with the noble, penetrative wisdom that discerns rise and fall and leads to the complete destruction of suffering. This is the fifth support for the cultivation of the qualities conducive to awakening.'\n\n\"Bhikkhus, it is to be expected of a bhikkhu who is a good friend, a good companion, a good associate, that he will be virtuous, that he will dwell restrained by the monastic code, accomplished in conduct and resort, seeing danger even in the slightest faults, undertaking and training in the training rules.\n\n\"It is to be expected of a bhikkhu who is a good friend, a good companion, a good associate, that he will obtain at will, without difficulty, without trouble, talk that is conducive to effacement and to the opening up of the mind, that is to say: talk on having few desires, talk on contentment, talk on seclusion, talk on non-entanglement, talk on the arousal of energy, talk on virtue, talk on concentration, talk on wisdom, talk on liberation, and talk on the knowledge and vision of liberation.\n\n\"It is to be expected of a bhikkhu who is a good friend, a good companion, a good associate, that he will live with aroused energy for the abandonment of unwholesome states and for the acquisition of wholesome states; he will be strong, firm in exertion, one who does not cast off the burden in wholesome states.\n\n\"It is to be expected of a bhikkhu who is a good friend, a good companion, a good associate, that he will be wise, endowed with the noble, penetrative wisdom that discerns rise and fall and leads to the complete destruction of suffering.\n\n\"Then, bhikkhus, established in these five qualities, a bhikkhu should further cultivate four other qualities: the contemplation of foulness should be cultivated for the abandonment of passion; loving-kindness should be cultivated for the abandonment of ill-will; mindfulness of breathing should be cultivated for the cutting off of discursive thoughts; the perception of impermanence should be cultivated for the uprooting of the conceit 'I am'. For one who perceives impermanence, bhikkhus, the perception of non-self is established. One who perceives non-self achieves the uprooting of the conceit 'I am', attaining Nibbāna in this very life.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී.\n\nඑක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: ''මහණෙනි, යම් හෙයකින් අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ අසත් නම්: 'ඇවැත්නි, සම්බෝධි පාක්ෂික ධර්මයන් භාවනාව සඳහා උපනිශ්‍රය වන්නේ කුමක්ද?' මහණෙනි, මෙසේ අසන ලද ඔබ ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට කෙසේ පිළිතුරු දෙන්නෙහිද?'' ''වහන්ස, අපගේ ධර්මයන් භාග්‍යවතුන් වහන්සේ මුල් කරගත්තකි... භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු ඒවා දරන්නාහ.'' ''එසේ නම්, මහණෙනි, අසව්, හොඳින් මෙනෙහි කරව්; මම දේශනා කරන්නෙමි.'' ''වහන්ස, එසේයැයි'' ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ''මහණෙනි, යම් හෙයකින් අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ අසත් නම්: 'ඇවැත්නි, සම්බෝධි පාක්ෂික ධර්මයන් භාවනාව සඳහා උපනිශ්‍රය වන්නේ කුමක්ද?' මහණෙනි, මෙසේ අසන ලද ඔබ ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පිළිතුරු දිය යුතුය – ''ඇවැත්නි, මෙහිලා භික්ෂුව කල්‍යාණ මිත්‍රයෙක් වේ, කල්‍යාණ සහායයෙක් වේ, කල්‍යාණ සම්ප්‍රවංකයෙක් වේ. ඇවැත්නි, සම්බෝධි පාක්ෂික ධර්මයන් භාවනාව සඳහා මෙය පළමු වන උපනිශ්‍රය වේ.\n\n''ඇවැත්නි, නැවතත් භික්ෂුව සිල්වතෙක් වේ. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, ආචාර සම්පන්න වූයේ, ගෝචර සම්පන්න වූයේ, අල්ප මාත්‍ර වරදෙහිද භය දක්නා වූයේ, සික්ෂා පදයන් සමාදන්ව හික්මෙමින් වාසය කරයි. ඇවැත්නි, සම්බෝධි පාක්ෂික ධර්මයන් භාවනාව සඳහා මෙය දෙවෙනි උපනිශ්‍රය වේ.\n\n''ඇවැත්නි, නැවතත් භික්ෂුව යම් කතාවක් කෙලෙස් දුරු කරන සුළුද, සිත විවෘත කිරීමට සුදුසුද – එනම්, අල්පේච්ඡ කතාව, සන්තුෂ්ඨි කතාව, ප්‍රවිවේක කතාව, අසංසර්ග කතාව, වීර්යාරම්භ කතාව, සීල කතාව, සමාධි කතාව, ප්‍රඥා කතාව, විමුක්ති කතාව, විමුක්ති ඥාන දර්ශන කතාව – මෙවැනි කතාවන් කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නෙක් වේ. ඇවැත්නි, සම්බෝධි පාක්ෂික ධර්මයන් භාවනාව සඳහා මෙය තුන්වෙනි උපනිශ්‍රය වේ.\n\n''ඇවැත්නි, නැවතත් භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් සම්පූර්ණ කිරීම පිණිසත් ආරම්භ කළ වීර්යයෙන් යුක්තව වාසය කරයි, ශක්ති සම්පන්නව, ස්ථීර පරාක්‍රමයකින් යුක්තව, කුසල ධර්මයන් කෙරෙහි භාරය අත් නොහැර වාසය කරයි. ඇවැත්නි, සම්බෝධි පාක්ෂික ධර්මයන් භාවනාව සඳහා මෙය සතරවෙනි උපනිශ්‍රය වේ.\n\n''ඇවැත්නි, නැවතත් භික්ෂුව ප්‍රඥාවන්තයෙක් වේ. උදයව්‍යය නුවණින් යුක්තව, ආර්ය වූ, කෙලෙස් විද බිඳින සුළු වූ, මනා කොට දුක් ක්ෂය කිරීමට පාරමිතා වූ ප්‍රඥාවෙන් යුක්තව වාසය කරයි. ඇවැත්නි, සම්බෝධි පාක්ෂික ධර්මයන් භාවනාව සඳහා මෙය පස්වෙනි උපනිශ්‍රය වේ.''\n\n''මහණෙනි, කල්‍යාණ මිත්‍රයෙක් වූ, කල්‍යාණ සහායයෙක් වූ, කල්‍යාණ සම්ප්‍රවංකයෙක් වූ භික්ෂුවට මෙය බලාපොරොත්තු විය යුතුය: ඔහු සිල්වතෙක් වන්නේය, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, ආචාර සම්පන්න වූයේ, ගෝචර සම්පන්න වූයේ, අල්ප මාත්‍ර වරදෙහිද භය දක්නා වූයේ, සික්ෂා පදයන් සමාදන්ව හික්මෙමින් වාසය කරන්නේය.\n\n''මහණෙනි, කල්‍යාණ මිත්‍රයෙක් වූ, කල්‍යාණ සහායයෙක් වූ, කල්‍යාණ සම්ප්‍රවංකයෙක් වූ භික්ෂුවට මෙය බලාපොරොත්තු විය යුතුය: යම් කතාවක් කෙලෙස් දුරු කරන සුළුද, සිත විවෘත කිරීමට සුදුසුද – එනම්, අල්පේච්ඡ කතාව, සන්තුෂ්ඨි කතාව, ප්‍රවිවේක කතාව, අසංසර්ග කතාව, වීර්යාරම්භ කතාව, සීල කතාව, සමාධි කතාව, ප්‍රඥා කතාව, විමුක්ති කතාව, විමුක්ති ඥාන දර්ශන කතාව – මෙවැනි කතාවන් කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නෙක් වන්නේය.\n\n''මහණෙනි, කල්‍යාණ මිත්‍රයෙක් වූ, කල්‍යාණ සහායයෙක් වූ, කල්‍යාණ සම්ප්‍රවංකයෙක් වූ භික්ෂුවට මෙය බලාපොරොත්තු විය යුතුය: අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් සම්පූර්ණ කිරීම පිණිසත් ආරම්භ කළ වීර්යයෙන් යුක්තව වාසය කරන්නේය, ශක්ති සම්පන්නව, ස්ථීර පරාක්‍රමයකින් යුක්තව, කුසල ධර්මයන් කෙරෙහි භාරය අත් නොහැර වාසය කරන්නේය.\n\n''මහණෙනි, කල්‍යාණ මිත්‍රයෙක් වූ, කල්‍යාණ සහායයෙක් වූ, කල්‍යාණ සම්ප්‍රවංකයෙක් වූ භික්ෂුවට මෙය බලාපොරොත්තු විය යුතුය: ප්‍රඥාවන්තයෙක් වන්නේය. උදයව්‍යය නුවණින් යුක්තව, ආර්ය වූ, කෙලෙස් විද බිඳින සුළු වූ, මනා කොට දුක් ක්ෂය කිරීමට පාරමිතා වූ ප්‍රඥාවෙන් යුක්තව වාසය කරන්නේය.\n\n''මහණෙනි, එම භික්ෂුව විසින් මේ ධර්ම පහෙහි පිහිටා තවත් ධර්ම සතරක් වඩන ලද්දක් විය යුතුය – රාගය ප්‍රහාණය කිරීම පිණිස අසුභ භාවනාව වැඩිය යුතුය, ව්‍යාපාදය ප්‍රහාණය කිරීම පිණිස මෛත්‍රිය වැඩිය යුතුය, විතර්කයන් සිඳලීම පිණිස ආනාපානසතිය වැඩිය යුතුය, අස්මිමානය මුලිනුපුටා දැමීම පිණිස අනිච්ච සංඥාව වැඩිය යුතුය. මහණෙනි, අනිච්ච සංඥාව වඩන තැනැත්තාට අනත්ත සංඥාව තහවුරු වේ. අනත්ත සංඥාව වඩන තැනැත්තා මේ දැක්මක් සහිත භවයෙහිම අස්මිමානය මුලිනුපුටා දැමීමෙන් නිර්වාණයට පත්වේ.''\nපළමුවැන්නයි.",
      "paliTitle": "Sambodhisuttaṃ",
      "englishTitle": "Discourse on Perfect Enlightenment",
      "sinhalaTitle": "සම‍්බෝධි සූත‍්‍රය"
    },
    {
      "number": 2,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘‘nissayasampanno nissayasampanno’ti, bhante, vuccati. Kittāvatā nu kho, bhante, bhikkhu nissayasampanno hotī’’ti? ‘‘Saddhaṃ ce, bhikkhu, bhikkhu nissāya akusalaṃ pajahati kusalaṃ bhāveti, pahīnamevassa taṃ akusalaṃ hoti. Hiriṃ ce, bhikkhu, bhikkhu nissāya…pe… ottappaṃ ce, bhikkhu, bhikkhu nissāya…pe… vīriyaṃ ce, bhikkhu, bhikkhu nissāya…pe… paññaṃ ce, bhikkhu, bhikkhu nissāya akusalaṃ pajahati kusalaṃ bhāveti, pahīnamevassa taṃ akusalaṃ hoti. Taṃ hissa bhikkhuno akusalaṃ pahīnaṃ hoti suppahīnaṃ, yaṃsa ariyāya paññāya disvā pahīnaṃ’’. ‘‘Tena ca pana, bhikkhu, bhikkhunā imesu pañcasu dhammesu patiṭṭhāya cattāro upanissāya vihātabbā. Katame cattāro? Idha, bhikkhu, bhikkhu saṅkhāyekaṃ paṭisevati, saṅkhāyekaṃ adhivāseti, saṅkhāyekaṃ parivajjeti, saṅkhāyekaṃ vinodeti. Evaṃ kho, bhikkhu, bhikkhu nissayasampanno hotī’’ti. Dutiyaṃ.",
      "english": "Then a certain monastic approached the Blessed One. Having approached the Blessed One, he paid homage and sat down to one side. Sitting to one side, that monastic said to the Blessed One: \"Venerable sir, it is said, 'endowed with support,' 'endowed with support.' To what extent, venerable sir, is a monastic said to be 'endowed with support'?\"\n\n\"Monastic, if a monastic, relying on faith, abandons unwholesome states and develops wholesome states, then that unwholesome state of his is abandoned. If a monastic, relying on moral shame, abandons unwholesome states and develops wholesome states, then that unwholesome state of his is abandoned. If a monastic, relying on moral dread, abandons unwholesome states and develops wholesome states, then that unwholesome state of his is abandoned. If a monastic, relying on energy, abandons unwholesome states and develops wholesome states, then that unwholesome state of his is abandoned. If a monastic, relying on wisdom, abandons unwholesome states and develops wholesome states, then that unwholesome state of his is abandoned. That unwholesome state of his is truly abandoned, well-abandoned, which is seen and abandoned through noble wisdom.\"\n\n\"And furthermore, monastic, a monastic, having established themselves in these five qualities, should dwell relying on four things. Which four? Here, monastic, a monastic uses something with careful consideration, endures something with careful consideration, avoids something with careful consideration, and dispels something with careful consideration. It is in this way, monastic, that a monastic is 'endowed with support'.\"",
      "sinhala": "ඉන්පසු එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි වී භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවා: \"ස්වාමීනී, 'නිස්සය සම්පන්නයි, නිස්සය සම්පන්නයි' යැයි කියනු ලැබේ. ස්වාමීනී, කවර පමණකින් භික්ෂුවක් නිස්සය සම්පන්න වන්නේද?\" \"මහණ, භික්ෂුවක් ශ්‍රද්ධාව ඇසුරු කොටගෙන අකුසලය දුරු කරන්නේ නම්, කුසලය වඩන්නේ නම්, ඒ අකුසලය ඔහු විසින් ප්‍රහීණ කරනු ලැබූවක්ම වේ. මහණ, භික්ෂුවක් හිරි ඇසුරු කොටගෙන අකුසලය දුරු කරන්නේ නම්, කුසලය වඩන්නේ නම්, ඒ අකුසලය ඔහු විසින් ප්‍රහීණ කරනු ලැබූවක්ම වේ. මහණ, භික්ෂුවක් ඔතප් ඇසුරු කොටගෙන අකුසලය දුරු කරන්නේ නම්, කුසලය වඩන්නේ නම්, ඒ අකුසලය ඔහු විසින් ප්‍රහීණ කරනු ලැබූවක්ම වේ. මහණ, භික්ෂුවක් වීර්යය ඇසුරු කොටගෙන අකුසලය දුරු කරන්නේ නම්, කුසලය වඩන්නේ නම්, ඒ අකුසලය ඔහු විසින් ප්‍රහීණ කරනු ලැබූවක්ම වේ. මහණ, භික්ෂුවක් ප්‍රඥාව ඇසුරු කොටගෙන අකුසලය දුරු කරන්නේ නම්, කුසලය වඩන්නේ නම්, ඒ අකුසලය ඔහු විසින් ප්‍රහීණ කරනු ලැබූවක්ම වේ. යම් අකුසලයක් ආර්ය ප්‍රඥාවෙන් දැක ප්‍රහීණ කරනු ලැබුවේද, ඒ භික්ෂුවගේ අකුසලය ප්‍රහීණ වූවක්, මනාව ප්‍රහීණ වූවක් වේ.\"\n\n\"මහණ, ඒ භික්ෂුව විසින් මේ පස් වැදෑරුම් ධර්මයන්හි පිහිටා සතරක් උපනිස්සය කොට වාසය කළ යුතුය. ඒ සතර කවරේද? මහණ, මෙහිලා භික්ෂුව විමසා බලා යමක් පරිභෝග කරයි, විමසා බලා යමක් ඉවසයි, විමසා බලා යමක් වළක්වයි, විමසා බලා යමක් දුරු කරයි. මහණ, මෙසේ භික්ෂුව නිස්සය සම්පන්න වේ.\"",
      "paliTitle": "Nissayasuttaṃ",
      "englishTitle": "Discourse on Dependence",
      "sinhalaTitle": "නිස්සය සූත‍්‍රය"
    },
    {
      "number": 3,
      "pali": "Ekaṃ samayaṃ bhagavā cālikāyaṃ viharati cālikāpabbate. Tena kho pana samayena āyasmā meghiyo bhagavato upaṭṭhāko hoti. Atha kho āyasmā meghiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho āyasmā meghiyo bhagavantaṃ etadavoca – ‘‘icchāmahaṃ, bhante, jantugāmaṃ [jatugāmaṃ (sī. aṭṭha., syā. aṭṭha.), jattugāmaṃ (ka. aṭṭhakathāyampi pāṭhantaraṃ)] piṇḍāya pavisitu’’nti. ‘‘Yassa dāni tvaṃ, meghiya, kālaṃ maññasī’’ti. Atha kho āyasmā meghiyo pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya jantugāmaṃ piṇḍāya pāvisi. Jantugāme piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena kimikāḷāya nadiyā tīraṃ tenupasaṅkami. Addasā kho āyasmā meghiyo kimikāḷāya nadiyā tīre jaṅghāvihāraṃ [jaṅghavihāraṃ (syā. ka.)] anucaṅkamamāno anuvicaramāno ambavanaṃ pāsādikaṃ ramaṇīyaṃ. Disvānassa etadahosi – ‘‘pāsādikaṃ vatidaṃ ambavanaṃ ramaṇīyaṃ, alaṃ vatidaṃ kulaputtassa padhānatthikassa padhānāya. Sace maṃ bhagavā anujāneyya, āgaccheyyāhaṃ imaṃ ambavanaṃ padhānāyā’’ti. Atha kho āyasmā meghiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā meghiyo bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya jantugāmaṃ piṇḍāya pāvisiṃ. Jantugāme piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena kimikāḷāya nadiyā tīraṃ tenupasaṅkamiṃ. Addasaṃ kho ahaṃ, bhante, kimikāḷāya nadiyā tīre jaṅghāvihāraṃ anucaṅkamamāno anuvicaramāno ambavanaṃ pāsādikaṃ ramaṇīyaṃ. Disvāna me etadahosi – ‘pāsādikaṃ vatidaṃ ambavanaṃ ramaṇīyaṃ. Alaṃ vatidaṃ kulaputtassa padhānatthikassa padhānāya. Sace maṃ bhagavā anujāneyya, āgaccheyyāhaṃ imaṃ ambavanaṃ padhānāyā’ti. Sace maṃ bhagavā anujāneyya, gaccheyyāhaṃ taṃ ambavanaṃ padhānāyā’’ti. ‘‘Āgamehi tāva, meghiya! Ekakamhi [ekakamhā (sī. pī.)] tāva [vata (ka.)] yāva aññopi koci bhikkhu āgacchatī’’ti [dissatūti (sabbattha, ṭīkāyampi pāṭhantaraṃ), āgacchatūti, dissatīti (ṭīkāyaṃ pāṭhantarāni)]. Dutiyampi kho āyasmā meghiyo bhagavantaṃ etadavoca – ‘‘bhagavato, bhante, natthi kiñci uttari karaṇīyaṃ, natthi katassa paṭicayo. Mayhaṃ kho pana, bhante, atthi uttari karaṇīyaṃ, atthi katassa paṭicayo. Sace maṃ bhagavā anujāneyya, gaccheyyāhaṃ taṃ ambavanaṃ padhānāyā’’ti. ‘‘Āgamehi tāva, meghiya, ekakamhi tāva yāva aññopi koci bhikkhu āgacchatī’’ti. Tatiyampi kho āyasmā meghiyo bhagavantaṃ etadavoca – ‘‘bhagavato, bhante, natthi kiñci uttari karaṇīyaṃ, natthi katassa paṭicayo. Mayhaṃ kho pana, bhante, atthi uttari karaṇīyaṃ, atthi katassa paṭicayo. Sace maṃ bhagavā anujāneyya, gaccheyyāhaṃ taṃ ambavanaṃ padhānāyā’’ti. ‘‘Padhānanti kho, meghiya, vadamānaṃ kinti vadeyyāma! Yassa dāni tvaṃ, meghiya, kālaṃ maññasī’’ti. Atha kho āyasmā meghiyo uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā yena taṃ ambavanaṃ tenupasaṅkami; upasaṅkamitvā taṃ ambavanaṃ ajjhogāhetvā aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho āyasmato meghiyassa tasmiṃ ambavane viharantassa yebhuyyena tayo pāpakā akusalā vitakkā samudācaranti, seyyathidaṃ – kāmavitakko, byāpādavitakko, vihiṃsāvitakko. Atha kho āyasmato meghiyassa etadahosi – ‘‘acchariyaṃ vata bho, abbhutaṃ vata bho! Saddhāya ca vatamhā agārasmā anagāriyaṃ pabbajitā; atha ca panimehi tīhi pāpakehi akusalehi vitakkehi anvāsattā – kāmavitakkena, byāpādavitakkena, vihiṃsāvitakkenā’’ti. Atha kho āyasmā meghiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā meghiyo bhagavantaṃ etadavoca – ‘‘Idha mayhaṃ, bhante, tasmiṃ ambavane viharantassa yebhuyyena tayo pāpakā akusalā vitakkā samudācaranti, seyyathidaṃ – kāmavitakko, byāpādavitakko, vihiṃsāvitakko. Tassa mayhaṃ, bhante, etadahosi – ‘acchariyaṃ vata bho, abbhutaṃ vata bho! Saddhāya ca vatamhā agārasmā anagāriyaṃ pabbajitā; atha ca panimehi tīhi pāpakehi akusalehi vitakkehi anvāsattā – kāmavitakkena, byāpādavitakkena, vihiṃsāvitakkenāti’’’. ‘‘Aparipakkāya, meghiya, cetovimuttiyā pañca dhammā paripakkāya saṃvattanti. Katame pañca? Idha, meghiya, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. Aparipakkāya, meghiya, cetovimuttiyā ayaṃ paṭhamo dhammo paripakkāya saṃvattati. ‘‘Puna caparaṃ, meghiya, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Aparipakkāya, meghiya, cetovimuttiyā ayaṃ dutiyo dhammo paripakkāya saṃvattati. ‘‘Puna caparaṃ, meghiya, yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā santuṭṭhikathā pavivekakathā asaṃsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī hoti akicchalābhī akasiralābhī. Aparipakkāya, meghiya, cetovimuttiyā ayaṃ tatiyo dhammo paripakkāya saṃvattati. ‘‘Puna caparaṃ, meghiya, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Aparipakkāya, meghiya, cetovimuttiyā ayaṃ catuttho dhammo paripakkāya saṃvattati. ‘‘Puna caparaṃ, meghiya, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Aparipakkāya, meghiya, cetovimuttiyā ayaṃ pañcamo dhammo paripakkāya saṃvattati. ‘‘Kalyāṇamittassetaṃ, meghiya, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa – ‘sīlavā bhavissati…pe. … samādāya sikkhissati sikkhāpadesu’’’. ‘‘Kalyāṇamittassetaṃ, meghiya, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa – ‘yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā…pe… vimuttiñāṇadassanakathā, evarūpiyā kathāya nikāmalābhī bhavissati akicchalābhī akasiralābhī’’’. ‘‘Kalyāṇamittassetaṃ, meghiya, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa – ‘āraddhavīriyo viharissati…pe… anikkhittadhuro kusalesu dhammesu’’’. ‘‘Kalyāṇamittassetaṃ, meghiya, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa – ‘paññavā bhavissati…pe… sammādukkhakkhayagāminiyā’’’. ‘‘Tena ca pana, meghiya, bhikkhunā imesu pañcasu dhammesu patiṭṭhāya cattāro dhammā uttari bhāvetabbā – asubhā bhāvetabbā rāgassa pahānāya, mettā bhāvetabbā byāpādassa pahānāya, ānāpānassati bhāvetabbā vitakkupacchedāya, aniccasaññā bhāvetabbā asmimānasamugghātāya. Aniccasaññino, meghiya, anattasaññā saṇṭhāti. Anattasaññī asmimānasamugghātaṃ pāpuṇāti diṭṭheva dhamme nibbāna’’nti. Tatiyaṃ.",
      "english": "At one time, the Blessed One was dwelling in Cālikā, on Cālikā Mountain. Now, at that time, Venerable Meghiya was the attendant of the Blessed One.\n\nThen Venerable Meghiya approached the Blessed One, and having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, Venerable Meghiya said to the Blessed One: \"Venerable sir, I wish to enter Jantugāma for alms.\"\n\n\"Meghiya, do as you now deem fit.\"\n\nThen, in the morning, Venerable Meghiya dressed, took his bowl and robe, and entered Jantugāma for alms. After wandering for alms in Jantugāma and returning from his alms-round after his meal, he approached the bank of the Kimikāḷā River. As Venerable Meghiya walked up and down along the bank of the Kimikāḷā River, he saw a charming and delightful mango grove. Seeing it, he thought: \"How charming and delightful this mango grove is! This is indeed suitable for a son of noble family who is striving, for his striving. If the Blessed One were to permit me, I would come to this mango grove for striving.\"\n\nThen Venerable Meghiya approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, Venerable Meghiya said to the Blessed One: \"Venerable sir, here, in the morning, I dressed, took my bowl and robe, and entered Jantugāma for alms. After wandering for alms in Jantugāma and returning from my alms-round after my meal, I approached the bank of the Kimikāḷā River. Venerable sir, as I walked up and down along the bank of the Kimikāḷā River, I saw a charming and delightful mango grove. Seeing it, I thought: 'How charming and delightful this mango grove is! This is indeed suitable for a son of noble family who is striving, for his striving. If the Blessed One were to permit me, I would come to this mango grove for striving.' If the Blessed One were to permit me, I would go to that mango grove for striving.\"\n\n\"Wait for a while, Meghiya. I am alone for now, until some other monk arrives.\"\n\nA second time, Venerable Meghiya said to the Blessed One: \"Venerable sir, the Blessed One has nothing further to do, there is no accumulation of what has been done. But for me, Venerable sir, there is something further to do, there is an accumulation of what has been done. If the Blessed One were to permit me, I would go to that mango grove for striving.\"\n\n\"Wait for a while, Meghiya. I am alone for now, until some other monk arrives.\"\n\nA third time, Venerable Meghiya said to the Blessed One: \"Venerable sir, the Blessed One has nothing further to do, there is no accumulation of what has been done. But for me, Venerable sir, there is something further to do, there is an accumulation of what has been done. If the Blessed One were to permit me, I would go to that mango grove for striving.\"\n\n\"Meghiya, when one speaks of striving, what is there to say against it? Do as you now deem fit.\"\n\nThen Venerable Meghiya, rising from his seat, paid homage to the Blessed One, circumambulated him clockwise, and approached that mango grove. Having entered that mango grove, he sat down at the root of a certain tree for his midday stay. Then, as Venerable Meghiya was dwelling in that mango grove, for the most part, three unwholesome, evil thoughts arose in him, namely: thoughts of sensual desire, thoughts of ill-will, and thoughts of harm. Then Venerable Meghiya thought: \"It is indeed amazing, it is truly wondrous! We have gone forth from the home life into homelessness out of faith, yet these three unwholesome, evil thoughts pursue us: thoughts of sensual desire, thoughts of ill-will, and thoughts of harm.\"\n\nThen Venerable Meghiya approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, Venerable Meghiya said to the Blessed One: \"Venerable sir, here, as I was dwelling in that mango grove, for the most part, three unwholesome, evil thoughts arose in me, namely: thoughts of sensual desire, thoughts of ill-will, and thoughts of harm. Regarding this, Venerable sir, I thought: 'It is indeed amazing, it is truly wondrous! We have gone forth from the home life into homelessness out of faith, yet these three unwholesome, evil thoughts pursue us: thoughts of sensual desire, thoughts of ill-will, and thoughts of harm.'\"\n\n\"Meghiya, for the unripened liberation of mind, five things lead to its ripening. What are these five?\n\nHere, Meghiya, a monk is a good friend, a good companion, and has good associates. This first factor, Meghiya, conduces to the maturation of the mind's liberation when it is not yet fully developed.\n\nFurthermore, Meghiya, a monk is virtuous, dwells restrained by the Pātimokkha, complete in conduct and resort, seeing danger even in the slightest faults, and undertakes the training in the precepts. This second factor, Meghiya, conduces to the maturation of the mind's liberation when it is not yet fully developed.\n\nFurthermore, Meghiya, whatever talk is conducive to the effacement of defilements and to the opening of the mind – namely, talk on wanting little, talk on contentment, talk on seclusion, talk on non-entanglement, talk on the arousal of energy, talk on virtue, talk on concentration, talk on wisdom, talk on liberation, and talk on the knowledge and vision of liberation – such talk he obtains easily, without difficulty, and without trouble. This third factor, Meghiya, conduces to the maturation of the mind's liberation when it is not yet fully developed.\n\nFurthermore, Meghiya, a monk dwells with aroused energy for the abandoning of unwholesome states and for the acquiring of wholesome states; he is steadfast, firm in exertion, and does not lay down the burden of cultivating wholesome states. This fourth factor, Meghiya, conduces to the maturation of the mind's liberation when it is not yet fully developed.\n\nFurthermore, Meghiya, a monk is wise, endowed with the noble, penetrative wisdom that discerns rise and fall and leads to the complete destruction of suffering. This fifth factor, Meghiya, conduces to the maturation of the mind's liberation when it is not yet fully developed.\n\nFor a monk who has good friends, good companions, and good associates, Meghiya, this can be expected: that he will be virtuous, dwell restrained by the Pātimokkha, complete in conduct and resort, seeing danger even in the slightest faults, and undertake the training in the precepts.\n\nFor a monk who has good friends, good companions, and good associates, Meghiya, this can be expected: that whatever talk is conducive to the effacement of defilements and to the opening of the mind – namely, talk on wanting little, talk on contentment, talk on seclusion, talk on non-entanglement, talk on the arousal of energy, talk on virtue, talk on concentration, talk on wisdom, talk on liberation, and talk on the knowledge and vision of liberation – such talk he will obtain easily, without difficulty, and without trouble.\n\nFor a monk who has good friends, good companions, and good associates, Meghiya, this can be expected: that he will dwell with aroused energy for the abandoning of unwholesome states and for the acquiring of wholesome states; he will be steadfast, firm in exertion, and will not lay down the burden of cultivating wholesome states.\n\nFor a monk who has good friends, good companions, and good associates, Meghiya, this can be expected: that he will be wise, endowed with the noble, penetrative wisdom that discerns rise and fall and leads to the complete destruction of suffering.\n\nFurthermore, Meghiya, having established himself in these five factors, that monk should further develop four other factors: the perception of unattractiveness should be developed for the abandoning of lust; loving-kindness should be developed for the abandoning of ill-will; mindfulness of breathing should be developed for the cutting off of discursive thoughts; and the perception of impermanence should be developed for the eradication of the conceit \"I am.\" For one who perceives impermanence, Meghiya, the perception of non-self is established. One who perceives non-self eradicates the conceit \"I am\" and attains Nibbāna in this very life.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ චාලිකා පර්වතයෙහි චාලිකාවෙහි වැඩ වාසය කළ සේක. එකල ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේගේ උපස්ථායකයා විය. ඉක්බිති ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක සිට ගත්හ. එක් පසෙක සිටගත් ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, මම ජන්තුගාමයට පිඬු පිණිස පිවිසීමට කැමැත්තෙමි.” “මේඝිය, දැන් ඔබ සුදුසු යැයි සිතන කාලයයි.” ඉක්බිති ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන ජන්තුගාමයට පිඬු පිණිස පිවිසියේය. ජන්තුගාමයෙහි පිඬු පිණිස හැසිර, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් වැළකී, කිමිකාළා නදියෙහි තීරය තිබූ තැනට එළඹියේය. කිමිකාළා නදියෙහි තීරය අසල සක්මන් කරමින් හැසිරෙන ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේට ප්‍රියමනාප වූ, රමණීය වූ අඹ වනයක් දැකගත හැකි විය. එය දැක උන්වහන්සේට මෙසේ සිතුණි: “ඇත්තෙන්ම මේ අඹ වනය ප්‍රියමනාප ය, රමණීය ය. වීර්යය අපේක්ෂා කරන කුලපුත්‍රයෙකුට වීර්යය කිරීමට මේ ස්ථානය සුදුසු ය. භාග්‍යවතුන් වහන්සේ මට අවසර දෙනවා නම්, මම වීර්යය පිණිස මේ අඹ වනයට යන්නෙමි.”\n\nඉක්බිති ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, මම මෙහි පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන ජන්තුගාමයට පිඬු පිණිස පිවිසියෙමි. ජන්තුගාමයෙහි පිඬු පිණිස හැසිර, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් වැළකී, කිමිකාළා නදියෙහි තීරය තිබූ තැනට එළඹියෙමි. ස්වාමීනි, කිමිකාළා නදියෙහි තීරය අසල සක්මන් කරමින් හැසිරෙන මම ප්‍රියමනාප වූ, රමණීය වූ අඹ වනයක් දැකගත හැකිය. එය දැක මට මෙසේ සිතුණි: ‘ඇත්තෙන්ම මේ අඹ වනය ප්‍රියමනාප ය, රමණීය ය. වීර්යය අපේක්ෂා කරන කුලපුත්‍රයෙකුට වීර්යය කිරීමට මේ ස්ථානය සුදුසු ය. භාග්‍යවතුන් වහන්සේ මට අවසර දෙනවා නම්, මම වීර්යය පිණිස මේ අඹ වනයට යන්නෙමි’ කියා. භාග්‍යවතුන් වහන්සේ මට අවසර දෙනවා නම්, මම ඒ අඹ වනයට වීර්යය පිණිස යන්නෙමි.”\n\n“මේඝිය, අන්‍ය භික්ෂුවක් පැමිණෙන තුරු ඔබ රැඳී සිටින්න.” දෙවැනි වරටත් ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේට වැඩිදුරටත් කළ යුතු කිසිවක් නැත, කළ දෙයක රැස්කිරීමක්ද නැත. එහෙත් ස්වාමීනි, මට නම් වැඩිදුරටත් කළ යුතු දෙයක් ඇත, කළ දෙයක රැස්කිරීමක්ද ඇත. භාග්‍යවතුන් වහන්සේ මට අවසර දෙනවා නම්, මම ඒ අඹ වනයට වීර්යය පිණිස යන්නෙමි.” “මේඝිය, අන්‍ය භික්ෂුවක් පැමිණෙන තුරු ඔබ රැඳී සිටින්න.” තුන්වැනි වරටත් ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේට වැඩිදුරටත් කළ යුතු කිසිවක් නැත, කළ දෙයක රැස්කිරීමක්ද නැත. එහෙත් ස්වාමීනි, මට නම් වැඩිදුරටත් කළ යුතු දෙයක් ඇත, කළ දෙයක රැස්කිරීමක්ද ඇත. භාග්‍යවතුන් වහන්සේ මට අවසර දෙනවා නම්, මම ඒ අඹ වනයට වීර්යය පිණිස යන්නෙමි.”\n\n“මේඝිය, වීර්යය කරන්නේ යැයි පවසන්නෙකුට අපි කුමක් කියමුද! මේඝිය, දැන් ඔබ සුදුසු යැයි සිතන කාලයයි.” ඉක්බිති ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ හුනස්නෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කර, පැදකුණු කොට, ඒ අඹ වනය තිබූ තැනට එළඹියේය; එළඹ, ඒ අඹ වනයට පිවිස, එක්තරා ගසක් මුල දවල් විවේක ගැනීම සඳහා වාඩි වූහ. ඉක්බිති ඒ අඹ වනයෙහි වාසය කරමින් සිටින ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේට බොහෝ දුරට තුන් ආකාරයක පාපී අකුසල විතර්කයන් පහළ විය. එනම්: කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය යනුයි. ඉක්බිති ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: “පින්වත්නි, මෙය පුදුමයකි! පින්වත්නි, මෙය ආශ්චර්යයකි! ඇත්තෙන්ම අපි ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැමිණියෙමු; එහෙත් කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය යන මේ පාපී අකුසල විතර්ක තුනෙන් අපි වෙලී සිටිමු.”\n\nඉක්බිති ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් මේඝිය ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, මට මෙහි ඒ අඹ වනයෙහි වාසය කරමින් සිටින විට බොහෝ දුරට තුන් ආකාරයක පාපී අකුසල විතර්කයන් පහළ විය. එනම්: කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය යනුයි. ස්වාමීනි, මට මෙසේ සිතුණි: ‘පින්වත්නි, මෙය පුදුමයකි! පින්වත්නි, මෙය ආශ්චර්යයකි! ඇත්තෙන්ම අපි ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැමිණියෙමු; එහෙත් කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය යන මේ පාපී අකුසල විතර්ක තුනෙන් අපි වෙලී සිටිමු’ කියා.” “මේඝිය, මනෝවිමුක්තිය නොමේරූ කල්හි එය පරිනත කිරීම පිණිස කරුණු පහක් හේතු වෙයි. ඒ කරුණු පහ කවරේද?\n\nමේඝිය, මෙහිදී භික්ෂුව කල්‍යාණමිත්‍රයෙක්, යහපත් සඟයෙක්, යහපත් ඇසුරු කරන්නෙක් වේ. මේඝිය, නොමේරූ චිත්ත විමුක්තිය පරිපාකයට පත්වීම පිණිස මේ පළමුවන ධර්මය හේතු වේ.\n\nතවද, මේඝිය, භික්ෂුව සිල්වතෙක් වේ. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාර සම්පන්නව, ගෝචර සම්පන්නව (හැසිරීම හා විහරණයෙන් යුක්තව) සිටී. අල්පමාත්‍ර වරදෙහි පවා භයක් දක්නෙක් වේ. ශික්ෂා පද සමාදන්ව හික්මෙයි. මේඝිය, නොමේරූ චිත්ත විමුක්තිය පරිපාකයට පත්වීම පිණිස මේ දෙවෙනි ධර්මය හේතු වේ.\n\nතවද, මේඝිය, යම් කථාවක් කෙලෙස් සංසිඳුවන සුළුද, සිත් විවරණයට හිතකරද – එනම් අල්පේච්ඡ කථාව, සන්තුෂ්ටි කථාව, ප්‍රවිවේක කථාව, අසංසග්ග කථාව, වීර්යාරම්භ කථාව, සීල කථාව, සමාධි කථාව, ප්‍රඥා කථාව, විමුක්ති කථාව, විමුක්ති ඥාන දර්ශන කථාව – එවැනි කථාවකට කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලාභී වේ. මේඝිය, නොමේරූ චිත්ත විමුක්තිය පරිපාකයට පත්වීම පිණිස මේ තුන්වෙනි ධර්මය හේතු වේ.\n\nතවද, මේඝිය, භික්ෂුව අකුසල ධර්මයන් ප්‍රහාණය කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, වීර්යාරම්භ කර වාසය කරයි. ධෛර්ය සම්පන්නව, දැඩි පරාක්‍රමයකින් යුතුව, කුසල ධර්මයන්හි නොපිරිහෙන වීර්යයෙන් යුක්තව සිටී. මේඝිය, නොමේරූ චිත්ත විමුක්තිය පරිපාකයට පත්වීම පිණිස මේ සතරවෙනි ධර්මය හේතු වේ.\n\nතවද, මේඝිය, භික්ෂුව උදයවය (හටගැනීම හා නැතිවීම) දක්නා නුවණින්, ආර්ය වූ, කෙලෙස් බිඳින සුළු වූ, මනා කොට දුක් ක්ෂය කිරීමට පමුණුවන ප්‍රඥාවෙන් යුක්ත වේ. මේඝිය, නොමේරූ චිත්ත විමුක්තිය පරිපාකයට පත්වීම පිණිස මේ පස්වෙනි ධර්මය හේතු වේ.\n\nමේඝිය, කල්‍යාණමිත්‍රයෙකු, යහපත් සඟයෙකු, යහපත් ඇසුරු කරන්නෙකු වන භික්ෂුවගෙන් මෙය අපේක්ෂා කළ හැකිය – ‘ඔහු සිල්වතෙක් වන්නේය, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරන්නේය, ආචාර සම්පන්නව, ගෝචර සම්පන්නව සිටින්නේය, අල්පමාත්‍ර වරදෙහි පවා භයක් දක්නෙක් වන්නේය, ශික්ෂා පද සමාදන්ව හික්මෙන්නේය.’\n\nමේඝිය, කල්‍යාණමිත්‍රයෙකු, යහපත් සඟයෙකු, යහපත් ඇසුරු කරන්නෙකු වන භික්ෂුවගෙන් මෙය අපේක්ෂා කළ හැකිය – ‘යම් කථාවක් කෙලෙස් සංසිඳුවන සුළුද, සිත් විවරණයට හිතකරද – එනම් අල්පේච්ඡ කථාව, සන්තුෂ්ටි කථාව, ප්‍රවිවේක කථාව, අසංසග්ග කථාව, වීර්යාරම්භ කථාව, සීල කථාව, සමාධි කථාව, ප්‍රඥා කථාව, විමුක්ති කථාව, විමුක්ති ඥාන දර්ශන කථාව – එවැනි කථාවකට ඔහු කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලාභී වන්නේය.’\n\nමේඝිය, කල්‍යාණමිත්‍රයෙකු, යහපත් සඟයෙකු, යහපත් ඇසුරු කරන්නෙකු වන භික්ෂුවගෙන් මෙය අපේක්ෂා කළ හැකිය – ‘ඔහු අකුසල ධර්මයන් ප්‍රහාණය කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, වීර්යාරම්භ කර වාසය කරන්නේය, ධෛර්ය සම්පන්නව, දැඩි පරාක්‍රමයකින් යුතුව, කුසල ධර්මයන්හි නොපිරිහෙන වීර්යයෙන් යුක්තව සිටින්නේය.’\n\nමේඝිය, කල්‍යාණමිත්‍රයෙකු, යහපත් සඟයෙකු, යහපත් ඇසුරු කරන්නෙකු වන භික්ෂුවගෙන් මෙය අපේක්ෂා කළ හැකිය – ‘ඔහු උදයවය දක්නා නුවණින්, ආර්ය වූ, කෙලෙස් බිඳින සුළු වූ, මනා කොට දුක් ක්ෂය කිරීමට පමුණුවන ප්‍රඥාවෙන් යුක්ත වන්නේය.’\n\nතවද, මේඝිය, ඒ භික්ෂුව විසින් මේ පස් ධර්මයන්හි පිහිටා තවත් සතර ධර්මයක් දියුණු කළ යුතුය. රාගය ප්‍රහාණය කිරීම පිණිස අසුභ භාවනාව වැඩිය යුතුය. ව්‍යාපාදය ප්‍රහාණය කිරීම පිණිස මෛත්‍රී භාවනාව වැඩිය යුතුය. විතර්කයන් සිඳලීම පිණිස ආනාපානසතිය වැඩිය යුතුය. අස්මිමානය (මම වෙමි යන මානය) මුලිනුපුටා දැමීම පිණිස අනිත්‍ය සංඥාව වැඩිය යුතුය. මේඝිය, අනිත්‍ය සංඥාව වඩන තැනැත්තාට අනාත්ම සංඥාව පිහිටයි. අනාත්ම සංඥාව වඩන තැනැත්තා අස්මිමානය මුලිනුපුටා දමයි, මේ ආත්මභාවයේදීම නිවනට පත්වේ.",
      "paliTitle": "Meghiyasuttaṃ",
      "englishTitle": "The Meghiya Sutta",
      "sinhalaTitle": "මේඝිය සූත්‍රය"
    },
    {
      "number": 4,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā nandako upaṭṭhānasālāyaṃ bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā bahidvārakoṭṭhake aṭṭhāsi kathāpariyosānaṃ āgamayamāno. Atha kho bhagavā kathāpariyosānaṃ viditvā ukkāsetvā aggaḷaṃ ākoṭesi. Vivariṃsu kho te bhikkhū bhagavato dvāraṃ. Atha kho bhagavā upaṭṭhānasālaṃ pavisitvā paññattāsane nisīdi. Nisajja kho bhagavā āyasmantaṃ nandakaṃ etadavoca – ‘‘dīgho kho tyāyaṃ, nandaka, dhammapariyāyo bhikkhūnaṃ paṭibhāsi. Api me piṭṭhi āgilāyati bahidvārakoṭṭhake ṭhitassa kathāpariyosānaṃ āgamayamānassā’’ti. Evaṃ vutte āyasmā nandako sārajjamānarūpo bhagavantaṃ etadavoca – ‘‘na kho pana mayaṃ, bhante, jānāma ‘bhagavā bahidvārakoṭṭhake ṭhito’ti. Sace hi mayaṃ, bhante, jāneyyāma ‘bhagavā bahidvārakoṭṭhake ṭhito’ti, ettakampi ( ) [(dhammaṃ) katthaci] no nappaṭibhāseyyā’’ti. Atha kho bhagavā āyasmantaṃ nandakaṃ sārajjamānarūpaṃ viditvā āyasmantaṃ nandakaṃ etadavoca – ‘‘sādhu, sādhu, nandaka! Etaṃ kho, nandaka, tumhākaṃ patirūpaṃ kulaputtānaṃ saddhāya agārasmā anagāriyaṃ pabbajitānaṃ, yaṃ tumhe dhammiyā kathāya sannisīdeyyātha. Sannipatitānaṃ vo, nandaka, dvayaṃ karaṇīyaṃ – dhammī vā kathā ariyo vā tuṇhībhāvo. [a. ni. 8.71; 9.1] Saddho ca, nandaka, bhikkhu hoti, no ca sīlavā. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ sīlavā cā’ti. Yato ca kho, nandaka, bhikkhu saddho ca hoti sīlavā ca, evaṃ so tenaṅgena paripūro hoti. ‘‘Saddho ca, nandaka, bhikkhu hoti sīlavā ca, no ca lābhī ajjhattaṃ cetosamādhissa. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ sīlavā ca lābhī ca ajjhattaṃ cetosamādhissā’ti. Yato ca kho, nandaka, bhikkhu saddho ca hoti sīlavā ca lābhī ca ajjhattaṃ cetosamādhissa, evaṃ so tenaṅgena paripūro hoti. ‘‘Saddho ca, nandaka, bhikkhu hoti sīlavā ca lābhī ca ajjhattaṃ cetosamādhissa, na lābhī adhipaññādhammavipassanāya. Evaṃ so tenaṅgena aparipūro hoti. Seyyathāpi, nandaka, pāṇako catuppādako assa. Tassa eko pādo omako lāmako. Evaṃ so tenaṅgena aparipūro assa. Evamevaṃ kho, nandaka, bhikkhu saddho ca hoti sīlavā ca lābhī ca ajjhattaṃ cetosamādhissa, na lābhī adhipaññādhammavipassanāya. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ sīlavā ca lābhī ca ajjhattaṃ cetosamādhissa lābhī ca adhipaññādhammavipassanāyā’’’ti. ‘‘Yato ca kho, nandaka, bhikkhu saddho ca hoti sīlavā ca lābhī ca ajjhattaṃ cetosamādhissa lābhī ca adhipaññādhammavipassanāya, evaṃ so tenaṅgena paripūro hotī’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi. Atha kho āyasmā nandako acirapakkantassa bhagavato bhikkhū āmantesi – ‘‘idāni, āvuso, bhagavā catūhi padehi kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsetvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘saddho ca, nandaka, bhikkhu hoti, no ca sīlavā. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – kintāhaṃ saddho ca assaṃ sīlavā cā’ti. Yato ca kho nandaka bhikkhu saddho ca hoti sīlavā ca, evaṃ so tenaṅgena paripūro hoti. Saddho ca nandaka bhikkhu hoti sīlavā ca, no ca lābhī ajjhattaṃ cetosamādhissa…pe… lābhī ca ajjhattaṃ cetosamādhissa, na lābhī adhipaññādhammavipassanāya, evaṃ so tenaṅgena aparipūro hoti. Seyyathāpi nandaka pāṇako catuppādako assa, tassa eko pādo omako lāmako, evaṃ so tenaṅgena aparipūro assa. Evamevaṃ kho, nandaka, bhikkhu saddho ca hoti sīlavā ca, lābhī ca ajjhattaṃ cetosamādhissa, na lābhī adhipaññādhammavipassanāya, evaṃ so tenaṅgena aparipūro hoti, tena taṃ aṅgaṃ paripūretabbaṃ ‘kintāhaṃ saddho ca assaṃ sīlavā ca, lābhī ca ajjhattaṃ cetosamādhissa, lābhī ca adhipaññādhammavipassanāyā’ti. Yato ca kho, nandaka, bhikkhu saddho ca hoti sīlavā ca lābhī ca ajjhattaṃ cetosamādhissa lābhī ca adhipaññādhammavipassanāya, evaṃ so tenaṅgena paripūro hotī’’ti. ‘‘Pañcime, āvuso, ānisaṃsā kālena dhammassavane kālena dhammasākacchāya. Katame pañca? Idhāvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Yathā yathā, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti, tathā tathā so satthu piyo ca hoti manāpo ca garu ca bhāvanīyo ca. Ayaṃ, āvuso, paṭhamo ānisaṃso kālena dhammassavane kālena dhammasākacchāya. ‘‘Puna caparaṃ, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Yathā yathā, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ…pe… brahmacariyaṃ pakāseti, tathā tathā so tasmiṃ dhamme atthappaṭisaṃvedī ca hoti dhammappaṭisaṃvedī ca. Ayaṃ, āvuso, dutiyo ānisaṃso kālena dhammassavane kālena dhammasākacchāya. ‘‘Puna caparaṃ, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Yathā yathā, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ…pe… brahmacariyaṃ pakāseti, tathā tathā so tasmiṃ dhamme gambhīraṃ atthapadaṃ paññāya ativijjha passati. Ayaṃ, āvuso, tatiyo ānisaṃso kālena dhammassavane kālena dhammasākacchāya. ‘‘Puna caparaṃ, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ…pe… brahmacariyaṃ pakāseti. Yathā yathā, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ…pe… brahmacariyaṃ pakāseti, tathā tathā naṃ sabrahmacārī uttari sambhāventi – ‘addhā ayamāyasmā patto vā pajjati vā’. Ayaṃ, āvuso, catuttho ānisaṃso kālena dhammassavane kālena dhammasākacchāya. ‘‘Puna caparaṃ, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Yathā yathā, āvuso, bhikkhu bhikkhūnaṃ dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti, tattha ye kho bhikkhū sekhā appattamānasā anuttaraṃ yogakkhemaṃ patthayamānā viharanti, te taṃ dhammaṃ sutvā vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ye pana tattha bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṃyojanā sammadaññāvimuttā, te taṃ dhammaṃ sutvā diṭṭhadhammasukhavihāraṃyeva anuyuttā viharanti. Ayaṃ, āvuso, pañcamo ānisaṃso kālena dhammassavane kālena dhammasākacchāya. Ime kho, āvuso, pañca ānisaṃsā kālena dhammassavane kālena dhammasākacchāyā’’ti. Catutthaṃ.",
      "english": "At one time, the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's park. Now at that time, the venerable Nandaka was instructing, urging, inspiring, and gladdening the bhikkhus in the service hall with a discourse on the Dhamma. Then, in the late afternoon, the Blessed One, having emerged from seclusion, approached the service hall; having approached, he stood outside the door waiting for the discourse to conclude. Then, knowing that the discourse had concluded, the Blessed One cleared his throat and knocked on the crossbar of the door. Those bhikkhus then opened the door for the Blessed One. Then the Blessed One entered the service hall and sat down on the seat that had been prepared. Having sat down, the Blessed One said to the venerable Nandaka, \"Indeed, Nandaka, this discourse on the Dhamma seems to have been lengthy for the bhikkhus. My back even aches from standing outside the door, waiting for the discourse to conclude.\" When this was said, the venerable Nandaka, looking abashed, said to the Blessed One, \"Venerable sir, we did not know that the Blessed One was standing outside the door. If we had known, venerable sir, that the Blessed One was standing outside the door, we would not have discoursed for such a long time.\" Then the Blessed One, knowing that the venerable Nandaka was looking abashed, said to the venerable Nandaka, \"Good, good, Nandaka! Indeed, Nandaka, it is fitting for you, sons of good families who have gone forth from home into homelessness out of faith, that you should sit together for a discourse on the Dhamma. For you who are assembled, Nandaka, there are two things to be done: either a discourse on the Dhamma or noble silence.\"\n\n\"Nandaka, if a bhikkhu has faith but is not virtuous, then by that aspect, he is incomplete. That aspect should be perfected by him, thinking: 'How can I become both faithful and virtuous?' When, Nandaka, a bhikkhu is both faithful and virtuous, then by that aspect, he is complete.\"\n\n\"Nandaka, if a bhikkhu is faithful and virtuous, but not a recipient of internal serenity of mind, then by that aspect, he is incomplete. That aspect should be perfected by him, thinking: 'How can I become both faithful and virtuous, and also a recipient of internal serenity of mind?' When, Nandaka, a bhikkhu is both faithful and virtuous, and also a recipient of internal serenity of mind, then by that aspect, he is complete.\"\n\n\"Nandaka, if a bhikkhu is faithful, virtuous, and a recipient of internal serenity of mind, but not a recipient of insight into the higher wisdom of the Dhamma, then by that aspect, he is incomplete. Just as, Nandaka, if a four-footed creature had one limb that was weak and defective, then it would be incomplete by that limb. Even so, Nandaka, if a bhikkhu is faithful, virtuous, and a recipient of internal serenity of mind, but not a recipient of insight into the higher wisdom of the Dhamma, then by that aspect, he is incomplete. That aspect should be perfected by him, thinking: 'How can I become both faithful and virtuous, and also a recipient of internal serenity of mind, and also a recipient of insight into the higher wisdom of the Dhamma?' When, Nandaka, a bhikkhu is faithful, virtuous, and a recipient of internal serenity of mind, and also a recipient of insight into the higher wisdom of the Dhamma, then by that aspect, he is complete.\"\n\nThe Blessed One said this. Having said this, the Fortunate One rose from his seat and entered his dwelling. Then, not long after the Blessed One had departed, the venerable Nandaka addressed the bhikkhus, \"Friends, the Blessed One has just now, having expounded the entirely complete and purified holy life by means of these four aspects, risen from his seat and entered his dwelling: 'Nandaka, if a bhikkhu has faith but is not virtuous, then by that aspect, he is incomplete. That aspect should be perfected by him, thinking: \"How can I become both faithful and virtuous?\"' 'When, Nandaka, a bhikkhu is both faithful and virtuous, then by that aspect, he is complete.' 'Nandaka, if a bhikkhu is faithful and virtuous, but not a recipient of internal serenity of mind; and is a recipient of internal serenity of mind, but not a recipient of insight into the higher wisdom of the Dhamma, then by that aspect, he is incomplete. Just as, Nandaka, if a four-footed creature had one limb that was weak and defective, then it would be incomplete by that limb. Even so, Nandaka, if a bhikkhu is faithful, virtuous, and a recipient of internal serenity of mind, but not a recipient of insight into the higher wisdom of the Dhamma, then by that aspect, he is incomplete. That aspect should be perfected by him, thinking: \"How can I become both faithful and virtuous, and also a recipient of internal serenity of mind, and also a recipient of insight into the higher wisdom of the Dhamma?\"' 'When, Nandaka, a bhikkhu is faithful, virtuous, and a recipient of internal serenity of mind, and also a recipient of insight into the higher wisdom of the Dhamma, then by that aspect, he is complete.'\"\n\nFriends, there are five benefits in listening to the Dhamma at the proper time and discussing the Dhamma at the proper time. What are these five?\n\nHere, friends, a monk teaches the Dhamma to monks, lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. In whatever way, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life—in that way he becomes dear to the Teacher, pleasing, revered, and respected. This, friends, is the first benefit in listening to the Dhamma at the proper time and discussing the Dhamma at the proper time.\n\nFurthermore, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. In whatever way, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life—in that way he experiences the meaning of that Dhamma and experiences the Dhamma itself. This, friends, is the second benefit in listening to the Dhamma at the proper time and discussing the Dhamma at the proper time.\n\nFurthermore, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. In whatever way, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life—in that way he penetrates with wisdom and sees the profound meaning of that Dhamma. This, friends, is the third benefit in listening to the Dhamma at the proper time and discussing the Dhamma at the proper time.\n\nFurthermore, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. In whatever way, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life—in that way his fellow practitioners esteem him further, thinking: 'Surely, this venerable one has attained or is practicing towards attainment.' This, friends, is the fourth benefit in listening to the Dhamma at the proper time and discussing the Dhamma at the proper time.\n\nFurthermore, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life. In whatever way, friends, a monk teaches the Dhamma to monks—lovely in the beginning, lovely in the middle, lovely in the end, with meaning and with phrasing, proclaiming the entirely complete and utterly pure holy life—among those monks, the trainees who have not yet reached their goal, aspiring for the unsurpassed security from bondage, hearing that Dhamma, arouse energy for the attainment of what is not yet attained, for the realization of what is not yet realized, for the direct experience of what is not yet directly experienced. But among those monks, the Arahants, whose defilements are destroyed, who have lived the holy life, who have done what had to be done, who have laid down the burden, who have attained their own true goal, whose fetters of existence are utterly destroyed, who are fully liberated through right knowledge, hearing that Dhamma, they continue to dwell committed to a pleasant abiding in this very life. This, friends, is the fifth benefit in listening to the Dhamma at the proper time and discussing the Dhamma at the proper time.\n\nThese, friends, are the five benefits in listening to the Dhamma at the proper time and discussing the Dhamma at the proper time.",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේ උපස්ථාන ශාලාවෙහි භික්ෂූන් වහන්සේලාට ධර්ම කථාවකින් කරුණු දක්වමින්, සමාදන් කරවමින්, උද්‍යෝගිමත් කරවමින්, සතුටු කරවමින් සිටියහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් වේලාවෙහි හුදෙකලා විවේකයෙන් නැගිට, උපස්ථාන ශාලාව තිබූ දෙසට වැඩම කළ සේක; වැඩම කර දොරකඩ එළියේ සිටගෙන ධර්ම කථාව අවසන් වන තෙක් බලා සිටි සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ ධර්ම කථාව අවසන් වූ බව දැන, උගුර පාදා අගුලට තට්ටු කළ සේක. ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට දොර විවෘත කළහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ උපස්ථාන ශාලාවට පිවිස පනවන ලද අසුනක වැඩහුන් සේක. වැඩහිඳි භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේට මෙය වදාළ සේක: “නන්දක, මේ ධර්ම කථාව භික්ෂූන්ට බොහෝ වේලාවක් පැවතුණා. ධර්ම කථාව අවසන් වන තෙක් දොරකඩ එළියේ සිටගෙන සිටි මාගේ පිට පවා රිදෙන්නට විය.” මෙසේ වදාළ විට ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේ ලැජ්ජාවට පත්වූ ස්වභාවයෙන් භාග්‍යවතුන් වහන්සේට මෙය සැළ කළ සේක: “වහන්ස, භාග්‍යවතුන් වහන්සේ දොරකඩ එළියේ සිටගෙන සිටින බව අපි නොදනිමු. වහන්ස, භාග්‍යවතුන් වහන්සේ දොරකඩ එළියේ සිටගෙන සිටින බව අප දැන සිටියේ නම්, මෙතරම් ධර්ම කථාවක් අපට නොපැවැත්වෙනු ඇත.” ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේ ලැජ්ජාවට පත්වූ ස්වභාවයෙන් සිටින බව දැන, ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේට මෙය වදාළ සේක: “හොඳයි, හොඳයි නන්දක! නන්දක, ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වූ කුලපුත්‍රයන් වන ඔබට, මෙසේ ධර්ම කථාවකින් යුක්තව රැස්ව සිටීම සුදුසු දෙයකි. නන්දක, රැස්වූ ඔබට කළ යුත්තේ දෙකෙන් එකකි – එක්කෝ ධර්ම කථාවක්, නැතහොත් ආර්ය නිශ්ශබ්දතාවයයි. නන්දක, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් වේ නම්, සිල්වත් නොවේ නම්, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එහෙයින් ‘කෙසේ නම් මම ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද වන්නෙම්දැයි’ ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුතුය. නන්දක, යම් විටෙක භික්ෂුව ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද වේ ද, එසේ වූ කල ඔහු ඒ අංගයෙන් සම්පූර්ණ වේ.\n\n“නන්දක, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද වේ නම්, එහෙත් අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නේ නොවේ නම්, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එහෙයින් ‘කෙසේ නම් මම ශ්‍රද්ධාවන්තයෙක් ද, සිල්වතෙක් ද, අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද වන්නෙම්දැයි’ ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුතුය. නන්දක, යම් විටෙක භික්ෂුව ශ්‍රද්ධාවන්තයෙක් ද, සිල්වතෙක් ද, අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද වේ ද, එසේ වූ කල ඔහු ඒ අංගයෙන් සම්පූර්ණ වේ.\n\n“නන්දක, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද වේ නම්, එහෙත් අතිප්‍රඥාවෙන් ධර්ම විපස්සනා කිරීම ලබන්නේ නොවේ නම්, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. නන්දක, යම්සේ සිව්පා සතෙක් වේ ද, ඔහුගේ එක් පාදයක් දුර්වල වේ ද, කුඩා වේ ද, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එලෙසින්ම නන්දක, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද වේ නම්, එහෙත් අතිප්‍රඥාවෙන් ධර්ම විපස්සනා කිරීම ලබන්නේ නොවේ නම්, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එහෙයින් ‘කෙසේ නම් මම ශ්‍රද්ධාවන්තයෙක් ද, සිල්වතෙක් ද, අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද, අතිප්‍රඥාවෙන් ධර්ම විපස්සනා කිරීම ලබන්නෙක් ද වන්නෙම්දැයි’ ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුතුය.\n\n“නන්දක, යම් විටෙක භික්ෂුව ශ්‍රද්ධාවන්තයෙක් ද, සිල්වතෙක් ද, අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද, අතිප්‍රඥාවෙන් ධර්ම විපස්සනා කිරීම ලබන්නෙක් ද වේ ද, එසේ වූ කල ඔහු ඒ අංගයෙන් සම්පූර්ණ වේ.”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා සුගතයන් වහන්සේ හුනසුනෙන් නැගිට විහාරයට වැඩම කළ සේක. ඉක්බිති ආයුෂ්මත් නන්දක ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩි වේලාවක් ගතවීමට පෙර වැඩම කළ පසු භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කළ සේක: “ඇවැත්නි, දැන් භාග්‍යවතුන් වහන්සේ මේ පද සතරින් කෙලෙවරක් නැති සම්පූර්ණ වූ පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කොට, හුනසුනෙන් නැගිට විහාරයට වැඩම කළ සේක – ‘නන්දක, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් වේ නම්, සිල්වත් නොවේ නම්, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එහෙයින් ‘කෙසේ නම් මම ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද වන්නෙම්දැයි’ ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුතුය. නන්දක, යම් විටෙක භික්ෂුව ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද වේ ද, එසේ වූ කල ඔහු ඒ අංගයෙන් සම්පූර්ණ වේ. නන්දක, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද වේ නම්, එහෙත් අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නේ නොවේ නම්, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එහෙයින් ‘කෙසේ නම් මම ශ්‍රද්ධාවන්තයෙක් ද, සිල්වතෙක් ද, අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද වන්නෙම්දැයි’ ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුතුය. නන්දක, යම් විටෙක භික්ෂුව ශ්‍රද්ධාවන්තයෙක් ද, සිල්වතෙක් ද, අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද වේ ද, එසේ වූ කල ඔහු ඒ අංගයෙන් සම්පූර්ණ වේ. නන්දක, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද වේ නම්, එහෙත් අතිප්‍රඥාවෙන් ධර්ම විපස්සනා කිරීම ලබන්නේ නොවේ නම්, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. නන්දක, යම්සේ සිව්පා සතෙක් වේ ද, ඔහුගේ එක් පාදයක් දුර්වල වේ ද, කුඩා වේ ද, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එලෙසින්ම නන්දක, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් ද සිල්වතෙක් ද අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද වේ නම්, එහෙත් අතිප්‍රඥාවෙන් ධර්ම විපස්සනා කිරීම ලබන්නේ නොවේ නම්, ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එහෙයින් ‘කෙසේ නම් මම ශ්‍රද්ධාවන්තයෙක් ද, සිල්වතෙක් ද, අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද, අතිප්‍රඥාවෙන් ධර්ම විපස්සනා කිරීම ලබන්නෙක් ද වන්නෙම්දැයි’ ඔහු විසින් ඒ අංගය සම්පූර්ණ කළ යුතුය. නන්දක, යම් විටෙක භික්ෂුව ශ්‍රද්ධාවන්තයෙක් ද, සිල්වතෙක් ද, අධ්‍යාත්මික චිත්ත සමාධිය ලබන්නෙක් ද, අතිප්‍රඥාවෙන් ධර්ම විපස්සනා කිරීම ලබන්නෙක් ද වේ ද, එසේ වූ කල ඔහු ඒ අංගයෙන් සම්පූර්ණ වේ.”\n\nමිත්‍රවරුනි, කාලයෙහි ධර්ම ශ්‍රවණය කිරීමේ ද, කාලයෙහි ධර්ම සාකච්ඡා කිරීමේ ද මේ ආනිසංස පසක් ඇත. ඒ කවර පසක්ද?\n\nමිත්‍රවරුනි, මෙහිලා භික්ෂුවක් භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි. මිත්‍රවරුනි, යම් යම් අයුරකින් භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි ද, එම් එම් අයුරින් ඔහු ශාස්තෘන්ට ප්‍රිය ද වන්නේය, මනාප ද වන්නේය, ගරු ද වන්නේය, ගෞරවයට හා අනුගමනයට සුදුසු ද වන්නේය. මිත්‍රවරුනි, මෙය කාලයෙහි ධර්ම ශ්‍රවණය කිරීමේ ද, කාලයෙහි ධර්ම සාකච්ඡා කිරීමේ ද පළමු වන ආනිසංසයයි.\n\nමිත්‍රවරුනි, තවද භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි. මිත්‍රවරුනි, යම් යම් අයුරකින් භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි ද, එම් එම් අයුරින් ඔහු ඒ ධර්මයෙහි අර්ථය ප්‍රත්‍යක්ෂයෙන් අනුභව කරන සුළු ද, ධර්මය ප්‍රත්‍යක්ෂයෙන් අනුභව කරන සුළු ද වන්නේය. මිත්‍රවරුනි, මෙය කාලයෙහි ධර්ම ශ්‍රවණය කිරීමේ ද, කාලයෙහි ධර්ම සාකච්ඡා කිරීමේ ද දෙවන ආනිසංසයයි.\n\nමිත්‍රවරුනි, තවද භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි. මිත්‍රවරුනි, යම් යම් අයුරකින් භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි ද, එම් එම් අයුරින් ඔහු ඒ ධර්මයෙහි ගැඹුරු අර්ථ පදයක් ප්‍රඥාවෙන් විනිවිද දකී. මිත්‍රවරුනි, මෙය කාලයෙහි ධර්ම ශ්‍රවණය කිරීමේ ද, කාලයෙහි ධර්ම සාකච්ඡා කිරීමේ ද තුන්වන ආනිසංසයයි.\n\nමිත්‍රවරුනි, තවද භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි. මිත්‍රවරුනි, යම් යම් අයුරකින් භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි ද, එම් එම් අයුරින් ඔහුගේ අනෙකුත් බඹසර පුරන මිත්‍රයෝ ඔහුට වඩාත් ගෞරව කරති – ‘නුදුරුව, මේ ආයුෂ්මත් ඵලයකට පත්වී සිටින්නට ඇත, නැතහොත් ඵලයකට පැමිණෙමින් සිටින්නට ඇත’ යනුවෙනි. මිත්‍රවරුනි, මෙය කාලයෙහි ධර්ම ශ්‍රවණය කිරීමේ ද, කාලයෙහි ධර්ම සාකච්ඡා කිරීමේ ද සිව්වන ආනිසංසයයි.\n\nමිත්‍රවරුනි, තවද භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි. මිත්‍රවරුනි, යම් යම් අයුරකින් භික්ෂුව භික්ෂූන්ට මුල, මැද, අග යන තෙකල්හිම මනා වූ, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ, සර්වප්‍රකාරයෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරයි ද, එහිලා සිත් (ඵලයට) නොපැමිණි, අනුත්තර වූ යෝගක්ෂේමය (රහත්භාවය) පතන යම් ශෛක්ෂ භික්ෂූන් වෙසෙති ද, ඔවුහු ඒ ධර්මය අසා නොලද දේ ලැබීම සඳහා ද, අධිගත නොකළ දේ අධිගත කිරීම සඳහා ද, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කිරීම සඳහා ද වීර්යය අරඹති. යම් භික්ෂූන් රහත් වූ, ක්ෂීණාශ්‍රව වූ, බඹසර නිම කළ, කළ යුතු දේ කළ, බර බහා තැබූ, තමන්ගේ අර්ථය (රහත්භාවය) ලබාගත්, භව සංයෝජන ප්‍රහීණ කළ, මනා කොට අවබෝධයෙන් විමුක්ත වූවාහු ද, ඔවුහු ඒ ධර්මය අසා මේ ආත්මභාවයෙහිදීම සැප විහරණයටම යොමු වී වෙසෙති. මිත්‍රවරුනි, මෙය කාලයෙහි ධර්ම ශ්‍රවණය කිරීමේ ද, කාලයෙහි ධර්ම සාකච්ඡා කිරීමේ ද පස්වන ආනිසංසයයි. මිත්‍රවරුනි, කාලයෙහි ධර්ම ශ්‍රවණය කිරීමේ ද, කාලයෙහි ධර්ම සාකච්ඡා කිරීමේ ද මේ පස් ආනිසංසයෝ ය.",
      "paliTitle": "Nandakasuttaṃ",
      "englishTitle": "Nandaka Sutta",
      "sinhalaTitle": "නන්දක සූත්‍රය"
    },
    {
      "number": 5,
      "pali": "‘‘Cattārimāni, bhikkhave, balāni. Katamāni cattāri? Paññābalaṃ, vīriyabalaṃ, anavajjabalaṃ, saṅgāhabalaṃ. Katamañca, bhikkhave, paññābalaṃ? Ye dhammā kusalā kusalasaṅkhātā ye dhammā akusalā akusalasaṅkhātā ye dhammā sāvajjā sāvajjasaṅkhātā ye dhammā anavajjā anavajjasaṅkhātā ye dhammā kaṇhā kaṇhasaṅkhātā ye dhammā sukkā sukkasaṅkhātā ye dhammā sevitabbā sevitabbasaṅkhātā ye dhammā asevitabbā asevitabbasaṅkhātā ye dhammā nālamariyā nālamariyasaṅkhātā ye dhammā alamariyā alamariyasaṅkhātā, tyāssa dhammā paññāya vodiṭṭhā honti vocaritā. Idaṃ vuccati, bhikkhave, paññābalaṃ. ‘‘Katamañca, bhikkhave, vīriyabalaṃ? Ye dhammā akusalā akusalasaṅkhātā ye dhammā sāvajjā sāvajjasaṅkhātā ye dhammā kaṇhā kaṇhasaṅkhātā ye dhammā asevitabbā asevitabbasaṅkhātā ye dhammā nālamariyā nālamariyasaṅkhātā, tesaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Ye dhammā kusalā kusalasaṅkhātā ye dhammā anavajjā anavajjasaṅkhātā ye dhammā sukkā sukkasaṅkhātā ye dhammā sevitabbā sevitabbasaṅkhātā ye dhammā alamariyā alamariyasaṅkhātā, tesaṃ dhammānaṃ paṭilābhāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Idaṃ vuccati, bhikkhave, vīriyabalaṃ. ‘‘Katamañca, bhikkhave, anavajjabalaṃ? Idha, bhikkhave, ariyasāvako anavajjena kāyakammena samannāgato hoti, anavajjena vacīkammena samannāgato hoti, anavajjena manokammena samannāgato hoti. Idaṃ vuccati, bhikkhave, anavajjabalaṃ. ‘‘Katamañca, bhikkhave, saṅgāhabalaṃ? Cattārimāni, bhikkhave, saṅgahavatthūni – dānaṃ, peyyavajjaṃ, atthacariyā, samānattatā. Etadaggaṃ, bhikkhave, dānānaṃ yadidaṃ dhammadānaṃ. Etadaggaṃ, bhikkhave, peyyavajjānaṃ yadidaṃ atthikassa ohitasotassa punappunaṃ dhammaṃ deseti. Etadaggaṃ, bhikkhave, atthacariyānaṃ yadidaṃ assaddhaṃ saddhāsampadāya samādapeti niveseti patiṭṭhāpeti, dussīlaṃ sīlasampadāya… pe… macchariṃ cāgasampadāya…pe… duppaññaṃ paññāsampadāya samādapeti niveseti patiṭṭhāpeti. Etadaggaṃ, bhikkhave, samānattatānaṃ yadidaṃ sotāpanno sotāpannassa samānatto, sakadāgāmī sakadāgāmissa samānatto, anāgāmī anāgāmissa samānatto, arahā arahato samānatto. Idaṃ vuccati, bhikkhave, saṅgāhabalaṃ. Imāni kho, bhikkhave, cattāri balāni. ‘‘Imehi kho, bhikkhave, catūhi balehi samannāgato ariyasāvako pañca bhayāni samatikkanto hoti. Katamāni pañca? Ājīvikabhayaṃ, asilokabhayaṃ, parisasārajjabhayaṃ, maraṇabhayaṃ, duggatibhayaṃ. Sa kho so, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘nāhaṃ ājīvikabhayassa bhāyāmi. Kissāhaṃ ājīvikabhayassa bhāyissāmi? Atthi me cattāri balāni – paññābalaṃ, vīriyabalaṃ, anavajjabalaṃ, saṅgāhabalaṃ. Duppañño kho ājīvikabhayassa bhāyeyya. Kusīto ājīvikabhayassa bhāyeyya. Sāvajjakāyakammantavacīkammantamanokammanto ājīvikabhayassa bhāyeyya. Asaṅgāhako ājīvikabhayassa bhāyeyya. Nāhaṃ asilokabhayassa bhāyāmi…pe… nāhaṃ parisasārajjabhayassa bhāyāmi…pe… nāhaṃ maraṇabhayassa bhāyāmi…pe… nāhaṃ duggatibhayassa bhāyāmi. Kissāhaṃ duggatibhayassa bhāyissāmi? Atthi me cattāri balāni – paññābalaṃ, vīriyabalaṃ, anavajjabalaṃ, saṅgāhabalaṃ. Duppañño kho duggatibhayassa bhāyeyya. Kusīto duggatibhayassa bhāyeyya. Sāvajjakāyakammantavacīkammantamanokammanto duggatibhayassa bhāyeyya. Asaṅgāhako duggatibhayassa bhāyeyya. Imehi kho, bhikkhave, catūhi balehi samannāgato ariyasāvako imāni pañca bhayāni samatikkanto hotī’’ti. Pañcamaṃ.",
      "english": "Monks, there are these four powers. Which four? The power of wisdom, the power of energy, the power of blamelessness, and the power of beneficence. And what, monks, is the power of wisdom? Those qualities that are wholesome and designated as wholesome, those qualities that are unwholesome and designated as unwholesome, those qualities that are blameworthy and designated as blameworthy, those qualities that are blameless and designated as blameless, those qualities that are dark and designated as dark, those qualities that are bright and designated as bright, those qualities that should be cultivated and designated as such, those qualities that should not be cultivated and designated as such, those qualities that are not noble and designated as not noble, those qualities that are noble and designated as noble – these qualities are clearly seen and discerned by one’s wisdom. This, monks, is called the power of wisdom.\n\nAnd what, monks, is the power of energy? Regarding those qualities that are unwholesome and designated as unwholesome, those qualities that are blameworthy and designated as blameworthy, those qualities that are dark and designated as dark, those qualities that should not be cultivated and designated as such, those qualities that are not noble and designated as not noble – for the abandonment of these qualities, one generates desire, makes effort, rouses energy, exerts the mind, and strives. Regarding those qualities that are wholesome and designated as wholesome, those qualities that are blameless and designated as blameless, those qualities that are bright and designated as bright, those qualities that should be cultivated and designated as such, those qualities that are noble and designated as noble – for the acquisition of these qualities, one generates desire, makes effort, rouses energy, exerts the mind, and strives. This, monks, is called the power of energy.\n\nAnd what, monks, is the power of blamelessness? Here, monks, a noble disciple is endowed with blameless bodily action, endowed with blameless verbal action, and endowed with blameless mental action. This, monks, is called the power of blamelessness.\n\nAnd what, monks, is the power of beneficence? Monks, there are these four bases of beneficence: giving, kindly speech, beneficial conduct, and being of the same standing. Among gifts, monks, the gift of Dhamma is supreme. Among kindly speech, monks, repeatedly teaching the Dhamma to one who is keen and has receptive ears is supreme. Among beneficial conduct, monks, leading one who is faithless to be endowed with faith, establishing and settling them in faith; leading one who is immoral to be endowed with moral virtue, establishing and settling them in moral virtue; leading one who is stingy to be endowed with generosity, establishing and settling them in generosity; leading one who is unwise to be endowed with wisdom, establishing and settling them in wisdom – this is supreme. Among being of the same standing, monks, a Stream-enterer being of the same standing as a Stream-enterer, a Once-returner as a Once-returner, a Non-returner as a Non-returner, and an Arahant as an Arahant – this is supreme. This, monks, is called the power of beneficence.\n\nThese, monks, are the four powers. Monks, a noble disciple endowed with these four powers has overcome five fears. Which five? The fear of livelihood, the fear of ill repute, the fear of timidness in assemblies, the fear of death, and the fear of a bad destination.\n\nMonks, that noble disciple reflects thus: ‘I do not fear the fear of livelihood. Why should I fear the fear of livelihood? I have the four powers: the power of wisdom, the power of energy, the power of blamelessness, and the power of beneficence. It is the unwise person who would fear the fear of livelihood. It is the lazy person who would fear the fear of livelihood. It is one whose bodily, verbal, and mental actions are blameworthy who would fear the fear of livelihood. It is one who lacks beneficence who would fear the fear of livelihood. I do not fear the fear of ill repute. I do not fear the fear of timidness in assemblies. I do not fear the fear of death. I do not fear the fear of a bad destination. Why should I fear the fear of a bad destination? I have the four powers: the power of wisdom, the power of energy, the power of blamelessness, and the power of beneficence. It is the unwise person who would fear the fear of a bad destination. It is the lazy person who would fear the fear of a bad destination. It is one whose bodily, verbal, and mental actions are blameworthy who would fear the fear of a bad destination. It is one who lacks beneficence who would fear the fear of a bad destination.’ Monks, a noble disciple endowed with these four powers has thus overcome these five fears.",
      "sinhala": "භික්ෂූනි, මේවා ශක්තීන් හතරකි. ඒ හතර කවරේද? ප්‍රඥාබලය, වීර්යය බලය, අනවද්‍ය බලය, සංග්‍රහ බලය.\n\nභික්ෂූනි, ප්‍රඥාබලය කවරේද? යම් ධර්ම කුසල ලෙස සැලකෙන කුසල ධර්ම වේද, යම් ධර්ම අකුසල ලෙස සැලකෙන අකුසල ධර්ම වේද, යම් ධර්ම වරද සහිත ලෙස සැලකෙන සාවද්‍ය ධර්ම වේද, යම් ධර්ම වරද රහිත ලෙස සැලකෙන අනවද්‍ය ධර්ම වේද, යම් ධර්ම කළු ලෙස සැලකෙන කාළ ධර්ම වේද, යම් ධර්ම සුදු ලෙස සැලකෙන ශුක්ල ධර්ම වේද, යම් ධර්ම සේවනය කළ යුතු යැයි සැලකෙන සේවිතබ්බ ධර්ම වේද, යම් ධර්ම සේවනය නොකළ යුතු යැයි සැලකෙන අසේවිතබ්බ ධර්ම වේද, යම් ධර්ම ආර්යයන්ට නුසුදුසු යැයි සැලකෙන නාලමාරිය ධර්ම වේද, යම් ධර්ම ආර්යයන්ට සුදුසු යැයි සැලකෙන ආලමාරිය ධර්ම වේද – ඒ ධර්ම ඔහු විසින් ප්‍රඥාවෙන් මනාව දකින ලද, විමසා වෙන්කරන ලද ඒවා වෙයි. භික්ෂූනි, මෙය ප්‍රඥාබලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, වීර්යය බලය කවරේද? යම් ධර්ම අකුසල ලෙස සැලකෙන අකුසල ධර්ම වේද, යම් ධර්ම සාවද්‍ය ලෙස සැලකෙන සාවද්‍ය ධර්ම වේද, යම් ධර්ම කළු ලෙස සැලකෙන කාළ ධර්ම වේද, යම් ධර්ම සේවනය නොකළ යුතු ලෙස සැලකෙන අසේවිතබ්බ ධර්ම වේද, යම් ධර්ම ආර්යයන්ට නුසුදුසු ලෙස සැලකෙන නාලමාරිය ධර්ම වේද – ඒ ධර්ම ප්‍රහීණ කිරීම සඳහා ඔහු ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත උත්සාහවත් කරයි, දැඩි ලෙස වෙහෙසෙයි. යම් ධර්ම කුසල ලෙස සැලකෙන කුසල ධර්ම වේද, යම් ධර්ම අනවද්‍ය ලෙස සැලකෙන අනවද්‍ය ධර්ම වේද, යම් ධර්ම සුදු ලෙස සැලකෙන ශුක්ල ධර්ම වේද, යම් ධර්ම සේවනය කළ යුතු ලෙස සැලකෙන සේවිතබ්බ ධර්ම වේද, යම් ධර්ම ආර්යයන්ට සුදුසු ලෙස සැලකෙන ආලමාරිය ධර්ම වේද – ඒ ධර්ම ලබා ගැනීම සඳහා ඔහු ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත උත්සාහවත් කරයි, දැඩි ලෙස වෙහෙසෙයි. භික්ෂූනි, මෙය වීර්යය බලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, අනවද්‍ය බලය කවරේද? භික්ෂූනි, මෙහිලා ආර්ය ශ්‍රාවකයා වරද රහිත කායික කර්මයකින් යුක්ත වෙයි. වරද රහිත වාචසික කර්මයකින් යුක්ත වෙයි. වරද රහිත මානසික කර්මයකින් යුක්ත වෙයි. භික්ෂූනි, මෙය අනවද්‍ය බලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සංග්‍රහ බලය කවරේද? භික්ෂූනි, මේවා සංග්‍රහ වස්තු හතරකි – දානය, ප්‍රිය වචන කීම, අර්ථචර්යාව, සමානාත්මතාවය. භික්ෂූනි, දානයන් අතර අග්‍ර වන්නේ ධර්ම දානයයි. භික්ෂූනි, ප්‍රිය වචනයන් අතර අග්‍ර වන්නේ යම් කෙනෙකුට අවශ්‍යතාවයක් ඇත්නම්, ඔහුට හොඳින් කන් දී සිටිනවා නම්, නැවත නැවත ධර්මය දේශනා කිරීමයි. භික්ෂූනි, අර්ථචර්යාවන් අතර අග්‍ර වන්නේ යම් කෙනෙකුට ශ්‍රද්ධාවක් නැත්නම්, ඔහුව ශ්‍රද්ධා සම්පත්තියෙහි පිහිටුවා, ස්ථාපිත කර, රැකවරණය දීමයි; දුස්සීල පුද්ගලයා ශීල සම්පත්තියෙහි පිහිටුවා, ස්ථාපිත කර, රැකවරණය දීමයි; මසුරු පුද්ගලයා ත්‍යාග සම්පත්තියෙහි පිහිටුවා, ස්ථාපිත කර, රැකවරණය දීමයි; ප්‍රඥාවක් නැති පුද්ගලයා ප්‍රඥා සම්පත්තියෙහි පිහිටුවා, ස්ථාපිත කර, රැකවරණය දීමයි. භික්ෂූනි, සමානාත්මතාවන් අතර අග්‍ර වන්නේ සෝවාන් වූ පුද්ගලයා සෝවාන් වූ පුද්ගලයාට සමාන බව, සකදාගාමී වූ පුද්ගලයා සකදාගාමී වූ පුද්ගලයාට සමාන බව, අනාගාමී වූ පුද්ගලයා අනාගාමී වූ පුද්ගලයාට සමාන බව, අරහත් වූ පුද්ගලයා අරහත් වූ පුද්ගලයාට සමාන බවයි. භික්ෂූනි, මෙය සංග්‍රහ බලය යැයි කියනු ලැබේ. භික්ෂූනි, මේවා එම ශක්තීන් හතරයි.\n\nභික්ෂූනි, මේ ශක්තීන් හතරෙන් යුක්ත ආර්ය ශ්‍රාවකයා බිය පස් දෙනෙකු ඉක්මවා සිටියි. ඒ බිය පස් දෙන කවරේද? ආජීවක භය, අසිලෝක භය, පරිසාසාරජ්ජ භය, මරණ භය, දුගති භය.\n\nභික්ෂූනි, ඒ ආර්ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි – 'මම ආජීවක භයට බිය නොවෙමි. මම කුමට ආජීවක භයට බිය වන්නෙම්ද? මට ශක්තීන් හතරක් ඇත – ප්‍රඥාබලය, වීර්යය බලය, අනවද්‍ය බලය, සංග්‍රහ බලය. ප්‍රඥාවක් නැති තැනැත්තා, කුසීත පුද්ගලයා, සාවද්‍ය වූ කායික කර්මයන්ගෙන්, වාචසික කර්මයන්ගෙන් සහ මානසික කර්මයන්ගෙන් යුක්ත පුද්ගලයා, සංග්‍රහ නොකරන පුද්ගලයා ආජීවක භයට බිය වන්නට පුළුවන.' මම අසිලෝක භයට බිය නොවෙමි. මම පරිසාසාරජ්ජ භයට බිය නොවෙමි. මම මරණ භයට බිය නොවෙමි. මම දුගති භයට බිය නොවෙමි. මම කුමට දුගති භයට බිය වන්නෙම්ද? මට ශක්තීන් හතරක් ඇත – ප්‍රඥාබලය, වීර්යය බලය, අනවද්‍ය බලය, සංග්‍රහ බලය. ප්‍රඥාවක් නැති තැනැත්තා, කුසීත පුද්ගලයා, සාවද්‍ය වූ කායික කර්මයන්ගෙන්, වාචසික කර්මයන්ගෙන් සහ මානසික කර්මයන්ගෙන් යුක්ත පුද්ගලයා, සංග්‍රහ නොකරන පුද්ගලයා දුගති භයට බිය වන්නට පුළුවන. භික්ෂූනි, මේ ශක්තීන් හතරෙන් යුක්ත ආර්ය ශ්‍රාවකයා මේ බිය පස් දෙන ඉක්මවා සිටියි.",
      "paliTitle": "Balasuttaṃ",
      "englishTitle": "Discourse on Powers",
      "sinhalaTitle": "බල සූත්‍‌රය"
    },
    {
      "number": 6,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi…pe… āyasmā sāriputto etadavoca – ‘‘Puggalopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopi. Cīvarampi, āvuso, duvidhena veditabbaṃ – sevitabbampi asevitabbampi. Piṇḍapātopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopi. Senāsanampi, āvuso, duvidhena veditabbaṃ – sevitabbampi asevitabbampi. Gāmanigamopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopi. Janapadapadesopi āvuso, duvidhena veditabbo – sevitabbopi asevitabbopi. ‘‘‘Puggalopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā puggalaṃ – ‘imaṃ kho me puggalaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti; ye ca kho me pabbajitena jīvitaparikkhārā samudānetabbā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā te ca kasirena samudāgacchanti; yassa camhi atthāya agārasmā anagāriyaṃ pabbajito so ca me sāmaññattho na bhāvanāpāripūriṃ gacchatī’ti, tenāvuso, puggalena so puggalo rattibhāgaṃ vā divasabhāgaṃ vā saṅkhāpi anāpucchā pakkamitabbaṃ nānubandhitabbo. ‘‘Tattha yaṃ jaññā puggalaṃ – ‘imaṃ kho me puggalaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti; ye ca kho me pabbajitena jīvitaparikkhārā samudānetabbā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā te ca appakasirena samudāgacchanti; yassa camhi atthāya agārasmā anagāriyaṃ pabbajito so ca me sāmaññattho na bhāvanāpāripūriṃ gacchatī’ti, tenāvuso, puggalena so puggalo saṅkhāpi anāpucchā pakkamitabbaṃ nānubandhitabbo. ‘‘Tattha yaṃ jaññā puggalaṃ – ‘imaṃ kho me puggalaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti; ye ca kho me pabbajitena jīvitaparikkhārā samudānetabbā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā te ca kasirena samudāgacchanti; yassa camhi atthāya agārasmā anagāriyaṃ pabbajito so ca me sāmaññattho bhāvanāpāripūriṃ gacchatī’ti, tenāvuso, puggalena so puggalo saṅkhāpi anubandhitabbo na pakkamitabbaṃ. ‘‘Tattha yaṃ jaññā puggalaṃ – ‘imaṃ kho me puggalaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti; ye ca kho me pabbajitena jīvitaparikkhārā samudānetabbā cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā te ca appakasirena samudāgacchanti; yassa camhi atthāya agārasmā anagāriyaṃ pabbajito so ca me sāmaññattho bhāvanāpāripūriṃ gacchatī’ti, tenāvuso, puggalena so puggalo yāvajīvaṃ anubandhitabbo na pakkamitabbaṃ api panujjamānena [paṇujjamānena (?)]. ‘Puggalopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Cīvarampi, āvuso, duvidhena veditabbaṃ – sevitabbampi asevitabbampī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā cīvaraṃ – ‘idaṃ kho me cīvaraṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpaṃ cīvaraṃ na sevitabbaṃ. Tattha yaṃ jaññā cīvaraṃ – ‘idaṃ kho me cīvaraṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpaṃ cīvaraṃ sevitabbaṃ. ‘Cīvarampi, āvuso, duvidhena veditabbaṃ – sevitabbampi asevitabbampī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Piṇḍapātopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā piṇḍapātaṃ – ‘imaṃ kho me piṇḍapātaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo piṇḍapāto na sevitabbo. Tattha yaṃ jaññā piṇḍapātaṃ – ‘imaṃ kho me piṇḍapātaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo piṇḍapāto sevitabbo. ‘Piṇḍapātopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Senāsanampi, āvuso, duvidhena veditabbaṃ – sevitabbampi asevitabbampī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā senāsanaṃ – ‘‘idaṃ kho me senāsanaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpaṃ senāsanaṃ na sevitabbaṃ. Tattha yaṃ jaññā senāsanaṃ – ‘idaṃ kho me senāsanaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpaṃ senāsanaṃ sevitabbaṃ. ‘Senāsanampi, āvuso, duvidhena veditabbaṃ – sevitabbampi asevitabbampī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Gāmanigamopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā gāmanigamaṃ – ‘imaṃ kho me gāmanigamaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo gāmanigamo na sevitabbo. Tattha yaṃ jaññā gāmanigamaṃ – ‘imaṃ kho, me gāmanigamaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo gāmanigamo sevitabbo. ‘Gāmanigamopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Janapadapadesopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā janapadapadesaṃ – ‘imaṃ kho me janapadapadesaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo janapadapadeso na sevitabbo. Tattha yaṃ jaññā janapadapadesaṃ – ‘imaṃ kho me janapadapadesaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo janapadapadeso sevitabbo. ‘Janapadapadesopi, āvuso, duvidhena veditabbo – sevitabbopi asevitabbopī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Chaṭṭhaṃ.",
      "english": "Then, indeed, the Venerable Sāriputta addressed the bhikkhus, saying:\n\"A person, friends, should be understood in two ways: one to be associated with, and one not to be associated with. A robe, friends, should also be understood in two ways: one to be used, and one not to be used. Alms-food, friends, should also be understood in two ways: one to be taken, and one not to be taken. A dwelling, friends, should also be understood in two ways: one to be resided in, and one not to be resided in. A village or town, friends, should also be understood in two ways: one to be entered, and one not to be entered. A region or district, friends, should also be understood in two ways: one to be frequented, and one not to be frequented.\"\n\n\"When it was said, 'A person, friends, should be understood in two ways: one to be associated with, and one not to be associated with,' what was said in reference to that? Concerning this, if one knows a person: 'While associating with this person, unwholesome qualities increase for me, and wholesome qualities decline; and those requisites for life that must be obtained by one who has gone forth – robes, alms-food, dwellings, medicine for the sick – these are obtained with difficulty; and that purpose of renunciation for which I went forth from home to homelessness, that renunciate's goal does not reach fulfillment through cultivation' — then, friends, that person should be left, without even saying goodbye, whether by night or by day, and should not be followed.\"\n\n\"Concerning this, if one knows a person: 'While associating with this person, unwholesome qualities increase for me, and wholesome qualities decline; and those requisites for life that must be obtained by one who has gone forth – robes, alms-food, dwellings, medicine for the sick – these are obtained without difficulty; and that purpose of renunciation for which I went forth from home to homelessness, that renunciate's goal does not reach fulfillment through cultivation' — then, friends, that person should be left, without even saying goodbye, and should not be followed.\"\n\n\"Concerning this, if one knows a person: 'While associating with this person, unwholesome qualities decline for me, and wholesome qualities increase; and those requisites for life that must be obtained by one who has gone forth – robes, alms-food, dwellings, medicine for the sick – these are obtained with difficulty; and that purpose of renunciation for which I went forth from home to homelessness, that renunciate's goal reaches fulfillment through cultivation' — then, friends, that person should be associated with, without even saying goodbye, and should not be left.\"\n\n\"Concerning this, if one knows a person: 'While associating with this person, unwholesome qualities decline for me, and wholesome qualities increase; and those requisites for life that must be obtained by one who has gone forth – robes, alms-food, dwellings, medicine for the sick – these are obtained without difficulty; and that purpose of renunciation for which I went forth from home to homelessness, that renunciate's goal reaches fulfillment through cultivation' — then, friends, that person should be associated with for life and should not be left, even if one is driven away. Thus, when it was said, 'A person, friends, should be understood in two ways: one to be associated with, and one not to be associated with,' it was said in reference to this.\"\n\n\"When it was said, 'A robe, friends, should also be understood in two ways: one to be used, and one not to be used,' what was said in reference to that? Concerning this, if one knows a robe: 'While using this robe, unwholesome qualities increase for me, and wholesome qualities decline,' such a robe should not be used. Concerning this, if one knows a robe: 'While using this robe, unwholesome qualities decline for me, and wholesome qualities increase,' such a robe should be used. Thus, when it was said, 'A robe, friends, should also be understood in two ways: one to be used, and one not to be used,' it was said in reference to this.\"\n\n\"When it was said, 'Alms-food, friends, should also be understood in two ways: one to be taken, and one not to be taken,' what was said in reference to that? Concerning this, if one knows alms-food: 'While taking this alms-food, unwholesome qualities increase for me, and wholesome qualities decline,' such alms-food should not be taken. Concerning this, if one knows alms-food: 'While taking this alms-food, unwholesome qualities decline for me, and wholesome qualities increase,' such alms-food should be taken. Thus, when it was said, 'Alms-food, friends, should also be understood in two ways: one to be taken, and one not to be taken,' it was said in reference to this.\"\n\n\"When it was said, 'A dwelling, friends, should also be understood in two ways: one to be resided in, and one not to be resided in,' what was said in reference to that? Concerning this, if one knows a dwelling: 'While residing in this dwelling, unwholesome qualities increase for me, and wholesome qualities decline,' such a dwelling should not be resided in.\"\n\nRegarding a dwelling that one knows thus: 'When I resort to this dwelling, unwholesome states decline in me, and wholesome states increase,' such a dwelling should be resorted to. 'A dwelling, friends, is to be understood in two ways – as that which should be resorted to and that which should not be resorted to.' What was said in that manner was said with reference to this principle.\n\n'A village or town, friends, is to be understood in two ways – as that which should be resorted to and that which should not be resorted to.' So indeed was this said. And what was this said with reference to? Regarding a village or town that one knows thus: 'When I resort to this village or town, unwholesome states increase in me, and wholesome states decline,' such a village or town should not be resorted to. Regarding a village or town that one knows thus: 'When I resort to this village or town, unwholesome states decline in me, and wholesome states increase,' such a village or town should be resorted to. 'A village or town, friends, is to be understood in two ways – as that which should be resorted to and that which should not be resorted to.' What was said in that manner was said with reference to this principle.\n\n'A region or locality, friends, is to be understood in two ways – as that which should be resorted to and that which should not be resorted to.' So indeed was this said. And what was this said with reference to? Regarding a region or locality that one knows thus: 'When I resort to this region or locality, unwholesome states increase in me, and wholesome states decline,' such a region or locality should not be resorted to. Regarding a region or locality that one knows thus: 'When I resort to this region or locality, unwholesome states decline in me, and wholesome states increase,' such a region or locality should be resorted to. 'A region or locality, friends, is to be understood in two ways – as that which should be resorted to and that which should not be resorted to.' What was said in that manner was said with reference to this principle.",
      "sinhala": "එහිදී ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: ආයුෂ්මතුනි, පුද්ගලයෝ ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු අය සහ සේවනය නොකළ යුතු අය වශයෙනි. ආයුෂ්මතුනි, සිවුරු ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු සිවුරු සහ සේවනය නොකළ යුතු සිවුරු වශයෙනි. ආයුෂ්මතුනි, පිණ්ඩපාතය ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු පිණ්ඩපාතය සහ සේවනය නොකළ යුතු පිණ්ඩපාතය වශයෙනි. ආයුෂ්මතුනි, සේනාසන ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු සේනාසන සහ සේවනය නොකළ යුතු සේනාසන වශයෙනි. ආයුෂ්මතුනි, ගම් සහ නියම්ගම් ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු ඒවා සහ සේවනය නොකළ යුතු ඒවා වශයෙනි. ආයුෂ්මතුනි, ජනපද හා ප්‍රදේශ ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු ඒවා සහ සේවනය නොකළ යුතු ඒවා වශයෙනි.\n\n‘ආයුෂ්මතුනි, පුද්ගලයෝ ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු අය සහ සේවනය නොකළ යුතු අය’ යැයි මෙසේ යමක් කියනු ලැබී නම්, එය කුමක් අරභයා කියනු ලැබී ද? යම් පුද්ගලයෙකු ගැන දන්නේ නම් – ‘මේ පුද්ගලයා සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් වැඩි දියුණු වේ, කුසල ධර්මයන් පිරිහේ; පැවිද්දෙකු විසින් උපයාගත යුතු වූ සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන ජීවිත පිරිකර ද දුෂ්කරතාවයෙන් ලැබෙයි; යම් අර්ථයක් සඳහා මම ගිහි ජීවිතයෙන් නික්ම පැවිදි වූයෙම් ද, ඒ මාගේ ශ්‍රමණ අර්ථය, භාවනාවේ පූර්ණත්වයට නොපැමිණේ’ යැයි; ආයුෂ්මතුනි, එවිට ඒ පුද්ගලයා දවසෙහි හෝ රාත්‍රියෙහි හෝ කිසිදු විමසීමකින් තොරව පිටව යා යුතු ය. ඔහු පසුපස නොයා යුතු ය.\n\nයම් පුද්ගලයෙකු ගැන දන්නේ නම් – ‘මේ පුද්ගලයා සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් වැඩි දියුණු වේ, කුසල ධර්මයන් පිරිහේ; පැවිද්දෙකු විසින් උපයාගත යුතු වූ සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන ජීවිත පිරිකර ද පහසුවෙන් ලැබෙයි; යම් අර්ථයක් සඳහා මම ගිහි ජීවිතයෙන් නික්ම පැවිදි වූයෙම් ද, ඒ මාගේ ශ්‍රමණ අර්ථය, භාවනාවේ පූර්ණත්වයට නොපැමිණේ’ යැයි; ආයුෂ්මතුනි, එවිට ඒ පුද්ගලයා කිසිදු විමසීමකින් තොරව පිටව යා යුතු ය. ඔහු පසුපස නොයා යුතු ය.\n\nයම් පුද්ගලයෙකු ගැන දන්නේ නම් – ‘මේ පුද්ගලයා සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් පිරිහේ, කුසල ධර්මයන් වැඩි දියුණු වේ; පැවිද්දෙකු විසින් උපයාගත යුතු වූ සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන ජීවිත පිරිකර ද දුෂ්කරතාවයෙන් ලැබෙයි; යම් අර්ථයක් සඳහා මම ගිහි ජීවිතයෙන් නික්ම පැවිදි වූයෙම් ද, ඒ මාගේ ශ්‍රමණ අර්ථය, භාවනාවේ පූර්ණත්වයට පැමිණේ’ යැයි; ආයුෂ්මතුනි, එවිට ඒ පුද්ගලයා අනුගමනය කළ යුතු ය. ඔහු අත්හැර නොයා යුතු ය.\n\nයම් පුද්ගලයෙකු ගැන දන්නේ නම් – ‘මේ පුද්ගලයා සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් පිරිහේ, කුසල ධර්මයන් වැඩි දියුණු වේ; පැවිද්දෙකු විසින් උපයාගත යුතු වූ සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර යන ජීවිත පිරිකර ද පහසුවෙන් ලැබෙයි; යම් අර්ථයක් සඳහා මම ගිහි ජීවිතයෙන් නික්ම පැවිදි වූයෙම් ද, ඒ මාගේ ශ්‍රමණ අර්ථය, භාවනාවේ පූර්ණත්වයට පැමිණේ’ යැයි; ආයුෂ්මතුනි, එවිට ඒ පුද්ගලයා තම ජීවිත කාලය පුරාම අනුගමනය කළ යුතු ය, පිටව නොයා යුතු ය, තල්ලු කරනු ලැබුවත් (ඔහු අත්හැර) නොයා යුතු ය. ‘ආයුෂ්මතුනි, පුද්ගලයෝ ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු අය සහ සේවනය නොකළ යුතු අය’ යැයි යමක් කියනු ලැබී නම්, එය මේ කරුණු අරභයා කියනු ලැබී ය.\n\n‘ආයුෂ්මතුනි, සිවුරු ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු සිවුරු සහ සේවනය නොකළ යුතු සිවුරු’ යැයි මෙසේ යමක් කියනු ලැබී නම්, එය කුමක් අරභයා කියනු ලැබී ද? යම් සිවුරක් ගැන දන්නේ නම් – ‘මේ සිවුර සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් වැඩි දියුණු වේ, කුසල ධර්මයන් පිරිහේ’ යැයි, එවැනි සිවුරක් සේවනය නොකළ යුතු ය. යම් සිවුරක් ගැන දන්නේ නම් – ‘මේ සිවුර සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් පිරිහේ, කුසල ධර්මයන් වැඩි දියුණු වේ’ යැයි, එවැනි සිවුරක් සේවනය කළ යුතු ය. ‘ආයුෂ්මතුනි, සිවුරු ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු සිවුරු සහ සේවනය නොකළ යුතු සිවුරු’ යැයි යමක් කියනු ලැබී නම්, එය මේ කරුණු අරභයා කියනු ලැබී ය.\n\n‘ආයුෂ්මතුනි, පිණ්ඩපාතය ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු පිණ්ඩපාතය සහ සේවනය නොකළ යුතු පිණ්ඩපාතය’ යැයි මෙසේ යමක් කියනු ලැබී නම්, එය කුමක් අරභයා කියනු ලැබී ද? යම් පිණ්ඩපාතයක් ගැන දන්නේ නම් – ‘මේ පිණ්ඩපාතය සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් වැඩි දියුණු වේ, කුසල ධර්මයන් පිරිහේ’ යැයි, එවැනි පිණ්ඩපාතයක් සේවනය නොකළ යුතු ය. යම් පිණ්ඩපාතයක් ගැන දන්නේ නම් – ‘මේ පිණ්ඩපාතය සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් පිරිහේ, කුසල ධර්මයන් වැඩි දියුණු වේ’ යැයි, එවැනි පිණ්ඩපාතයක් සේවනය කළ යුතු ය. ‘ආයුෂ්මතුනි, පිණ්ඩපාතය ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු පිණ්ඩපාතය සහ සේවනය නොකළ යුතු පිණ්ඩපාතය’ යැයි යමක් කියනු ලැබී නම්, එය මේ කරුණු අරභයා කියනු ලැබී ය.\n\n‘ආයුෂ්මතුනි, සේනාසන ද දෙයාකාරයකින් දත යුතු යි – සේවනය කළ යුතු සේනාසන සහ සේවනය නොකළ යුතු සේනාසන’ යැයි මෙසේ යමක් කියනු ලැබී නම්, එය කුමක් අරභයා කියනු ලැබී ද? යම් සේනාසනයක් ගැන දන්නේ නම් – ‘මේ සේනාසනය සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් වැඩි දියුණු වේ, කුසල ධර්මයන් පිරිහේ’ යැයි, එවැනි සේනාසනයක් සේවනය නොකළ යුතු ය.\n\nඑහි යම් සේනාසනයක් ගැන දත යුතු ද – ‘මේ සේනාසනය සේවනය කරන මා හට අකුසල ධර්මයන් පිරිහී යයි, කුසල ධර්මයන් වැඩෙති’ යැයි, එබඳු සේනාසනයක් සේවනය කළ යුතු ය. ‘ආයුෂ්මතුනි, සේනාසනය ද දෙයාකාරයකින් දත යුතු ය – සේවනය කළ යුත්තක් සහ සේවනය නොකළ යුත්තක් වශයෙනි’ යැයි යමක් වදාළේ ද, මෙය ඒ කරුණු නිමිති කොට ගෙන වදාළ දෙයකි.\n\n‘ආයුෂ්මතුනි, ගම් හෝ නියම්ගම් ද දෙයාකාරයකින් දත යුතු ය – සේවනය කළ යුත්තක් සහ සේවනය නොකළ යුත්තක් වශයෙනි’ යැයි ද වදාළේ ය. කුමක් නිමිති කොට ගෙන ද මෙය වදාළේ? එහි යම් ගම් හෝ නියම්ගමක් ගැන දත යුතු ද – ‘මේ ගම් හෝ නියම්ගම සේවනය කරන මා හට අකුසල ධර්මයන් වැඩෙති, කුසල ධර්මයන් පිරිහී යයි’ යැයි, එබඳු ගම් හෝ නියම්ගමක් සේවනය නොකළ යුතු ය. එහි යම් ගම් හෝ නියම්ගමක් ගැන දත යුතු ද – ‘මේ ගම් හෝ නියම්ගම සේවනය කරන මා හට අකුසල ධර්මයන් පිරිහී යයි, කුසල ධර්මයන් වැඩෙති’ යැයි, එබඳු ගම් හෝ නියම්ගමක් සේවනය කළ යුතු ය. ‘ආයුෂ්මතුනි, ගම් හෝ නියම්ගම් ද දෙයාකාරයකින් දත යුතු ය – සේවනය කළ යුත්තක් සහ සේවනය නොකළ යුත්තක් වශයෙනි’ යැයි යමක් වදාළේ ද, මෙය ඒ කරුණු නිමිති කොට ගෙන වදාළ දෙයකි.\n\n‘ආයුෂ්මතුනි, ජනපද ප්‍රදේශ ද දෙයාකාරයකින් දත යුතු ය – සේවනය කළ යුත්තක් සහ සේවනය නොකළ යුත්තක් වශයෙනි’ යැයි ද වදාළේ ය. කුමක් නිමිති කොට ගෙන ද මෙය වදාළේ? එහි යම් ජනපද ප්‍රදේශයක් ගැන දත යුතු ද – ‘මේ ජනපද ප්‍රදේශය සේවනය කරන මා හට අකුසල ධර්මයන් වැඩෙති, කුසල ධර්මයන් පිරිහී යයි’ යැයි, එබඳු ජනපද ප්‍රදේශයක් සේවනය නොකළ යුතු ය. එහි යම් ජනපද ප්‍රදේශයක් ගැන දත යුතු ද – ‘මේ ජනපද ප්‍රදේශය සේවනය කරන මා හට අකුසල ධර්මයන් පිරිහී යයි, කුසල ධර්මයන් වැඩෙති’ යැයි, එබඳු ජනපද ප්‍රදේශයක් සේවනය කළ යුතු ය. ‘ආයුෂ්මතුනි, ජනපද ප්‍රදේශ ද දෙයාකාරයකින් දත යුතු ය – සේවනය කළ යුත්තක් සහ සේවනය නොකළ යුත්තක් වශයෙනි’ යැයි යමක් වදාළේ ද, මෙය ඒ කරුණු නිමිති කොට ගෙන වදාළ දෙයකි.",
      "paliTitle": "Sevanāsuttaṃ",
      "englishTitle": "Discourse on Association",
      "sinhalaTitle": "සේවනා සූත්‍රය"
    },
    {
      "number": 7,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho sutavā paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sutavā paribbājako bhagavantaṃ etadavoca – ‘‘Ekamidāhaṃ, bhante, samayaṃ bhagavā idheva rājagahe viharāmi giribbaje. Tatra me, bhante, bhagavato sammukhā sutaṃ sammukhā paṭiggahitaṃ – ‘yo so, sutavā [sutava (syā.)], bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto, abhabbo so pañca ṭhānāni ajjhācarituṃ – abhabbo khīṇāsavo bhikkhu sañcicca pāṇaṃ jīvitā voropetuṃ, abhabbo khīṇāsavo bhikkhu adinnaṃ theyyasaṅkhātaṃ ādātuṃ, abhabbo khīṇāsavo bhikkhu methunaṃ dhammaṃ paṭisevituṃ, abhabbo khīṇāsavo bhikkhu sampajānamusā [sampajānaṃ musā (ka. sī.)] bhāsituṃ, abhabbo khīṇāsavo bhikkhu sannidhikārakaṃ kāme paribhuñjituṃ seyyathāpi pubbe agāriyabhūto’ti. Kacci metaṃ, bhante, bhagavato sussutaṃ suggahitaṃ sumanasikataṃ sūpadhārita’’nti? ‘‘Taggha te etaṃ, sutavā, sussutaṃ suggahitaṃ sumanasikataṃ sūpadhāritaṃ. Pubbe cāhaṃ, sutavā, etarahi ca evaṃ vadāmi – ‘yo so bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto, abhabbo so nava ṭhānāni ajjhācarituṃ – abhabbo khīṇāsavo bhikkhu sañcicca pāṇaṃ jīvitā voropetuṃ, abhabbo khīṇāsavo bhikkhu adinnaṃ theyyasaṅkhātaṃ ādātuṃ, abhabbo khīṇāsavo bhikkhu methunaṃ dhammaṃ paṭisevituṃ, abhabbo khīṇāsavo bhikkhu sampajānamusā bhāsituṃ, abhabbo khīṇāsavo bhikkhu sannidhikārakaṃ kāme paribhuñjituṃ seyyathāpi pubbe agāriyabhūto, abhabbo khīṇāsavo bhikkhu chandāgatiṃ gantuṃ, abhabbo khīṇāsavo bhikkhu dosāgatiṃ gantuṃ, abhabbo khīṇāsavo bhikkhu mohāgatiṃ gantuṃ, abhabbo khīṇāsavo bhikkhu bhayāgatiṃ gantuṃ’. Pubbe cāhaṃ, sutavā, etarahi ca evaṃ vadāmi – ‘yo so bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto, abhabbo so imāni nava ṭhānāni ajjhācaritu’’’nti. Sattamaṃ.",
      "english": "At one time, the Blessed One was dwelling in Rājagaha, on Gijjhakūṭa mountain. Then the wanderer Sutavā approached the Blessed One; having approached, he exchanged greetings with the Blessed One. Having concluded the courteous and memorable talk, he sat down to one side. Sitting to one side, the wanderer Sutavā said this to the Blessed One: \"Venerable sir, at one time the Blessed One was dwelling right here in Rājagaha, in Giribbaja. There, venerable sir, I heard and received directly from the Blessed One: 'That monk, Sutavā, who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what needed to be done, who has laid down the burden, who has attained his own true goal, whose fetters of existence are completely destroyed, who is rightly liberated through perfect knowledge, is incapable of committing five actions: An Arahant monk is incapable of intentionally depriving a living being of life. An Arahant monk is incapable of taking what is not given, in the manner of a thief. An Arahant monk is incapable of engaging in sexual intercourse. An Arahant monk is incapable of intentionally speaking falsehood. An Arahant monk is incapable of enjoying sensual pleasures by accumulating them, just as one did previously as a householder.' Venerable sir, have I heard this correctly from the Blessed One, grasped it well, attended to it properly, and considered it thoroughly?\"\n\n\"Indeed, Sutavā, you have heard this correctly, grasped it well, attended to it properly, and considered it thoroughly. Previously, Sutavā, and now also, I declare thus: 'That monk who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what needed to be done, who has laid down the burden, who has attained his own true goal, whose fetters of existence are completely destroyed, who is rightly liberated through perfect knowledge, is incapable of committing nine actions: An Arahant monk is incapable of intentionally depriving a living being of life. An Arahant monk is incapable of taking what is not given, in the manner of a thief. An Arahant monk is incapable of engaging in sexual intercourse. An Arahant monk is incapable of intentionally speaking falsehood. An Arahant monk is incapable of enjoying sensual pleasures by accumulating them, just as one did previously as a householder. An Arahant monk is incapable of going on a wrong course due to desire. An Arahant monk is incapable of going on a wrong course due to aversion. An Arahant monk is incapable of going on a wrong course due to delusion. An Arahant monk is incapable of going on a wrong course due to fear.' Previously, Sutavā, and now also, I declare thus: 'That monk who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what needed to be done, who has laid down the burden, who has attained his own true goal, whose fetters of existence are completely destroyed, who is rightly liberated through perfect knowledge, is incapable of committing these nine actions.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජුකුළු පව්වෙහි වැඩවසන සේක. ඉන්පසු සුතවා නම් පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහිකටයුතු කථා බස් හුවමාරු කරගෙන ඔහු එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි සුතවා පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “වහන්ස, එක් කලෙක භාග්‍යවතුන් වහන්සේ මෙහිම රජගහ නුවර ගිරිබ්බජ නම් ස්ථානයේ වැඩසිටින සමයකදී, වහන්ස, මට භාග්‍යවතුන් වහන්සේගෙන් මුහුණට මුහුණ අසන ලද්දක්, මුහුණට මුහුණ පිළිගන්නා ලද්දක් ඇත: ‘සුතවා, යම් භික්ෂුවක් රහත් වූ, ක්ෂීණාශ්‍රව වූ, බඹසර වාසය පූරණය කළ, කළ යුතු දේ කොට නිම කළ, බර පහකළ, තමාගේ උතුම් අරමුණට පැමිණි, භව සංයෝජන ප්‍රහීණ කළ, සම්‍යග් ප්‍රඥාවෙන් විමුක්ත වූ කෙනෙක් නම්, ඔහුට කරුණු පහක් සිදුකිරීමට නොහැක. එනම්, ක්ෂීණාශ්‍රව භික්ෂුවකට සිතාමතා පණ ඇති සතෙකුගේ ජීවිතය නැසීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට සොරකම් කිරීම් වශයෙන් අනුන් නොදුන් දෙයක් ගැනීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට මෛථුන ධර්මය සේවනය කිරීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට දැන දැන බොරු කීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට පෙර ගිහිව සිටියාක් මෙන් තැන්පත් කර තබාගෙන කාමභෝගී දේවල් පරිභෝග කිරීමට නොහැක’යි.”\n\n“වහන්ස, මේ මා විසින් භාග්‍යවතුන් වහන්සේගෙන් හොඳින් අසන ලද්දක්ද, හොඳින් ග්‍රහණය කරගත් දෙයක්ද, හොඳින් මෙනෙහි කරන ලද දෙයක්ද, හොඳින් ධාරණය කරගත් දෙයක්ද?”\n\n“සුතවා, නියත වශයෙන්ම ඔබ විසින් මෙය හොඳින් අසන ලද, හොඳින් ග්‍රහණය කරගත්, හොඳින් මෙනෙහි කරන ලද, හොඳින් ධාරණය කරගත් දෙයකි. සුතවා, පෙරත් මම, දැන් පවා මම මෙසේ කියමි: ‘යම් භික්ෂුවක් රහත් වූ, ක්ෂීණාශ්‍රව වූ, බඹසර වාසය පූරණය කළ, කළ යුතු දේ කොට නිම කළ, බර පහකළ, තමාගේ උතුම් අරමුණට පැමිණි, භව සංයෝජන ප්‍රහීණ කළ, සම්‍යග් ප්‍රඥාවෙන් විමුක්ත වූ කෙනෙක් නම්, ඔහුට කරුණු නවයක් සිදුකිරීමට නොහැක. එනම්, ක්ෂීණාශ්‍රව භික්ෂුවකට සිතාමතා පණ ඇති සතෙකුගේ ජීවිතය නැසීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට සොරකම් කිරීම් වශයෙන් අනුන් නොදුන් දෙයක් ගැනීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට මෛථුන ධර්මය සේවනය කිරීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට දැන දැන බොරු කීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට පෙර ගිහිව සිටියාක් මෙන් තැන්පත් කර තබාගෙන කාමභෝගී දේවල් පරිභෝග කිරීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට ඡන්දයෙන් අගතිගාමී වීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට ද්වේෂයෙන් අගතිගාමී වීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට මෝහයෙන් අගතිගාමී වීමට නොහැක. ක්ෂීණාශ්‍රව භික්ෂුවකට භයෙන් අගතිගාමී වීමට නොහැක.’ සුතවා, පෙරත් මම, දැන් පවා මම මෙසේ කියමි: ‘යම් භික්ෂුවක් රහත් වූ, ක්ෂීණාශ්‍රව වූ, බඹසර වාසය පූරණය කළ, කළ යුතු දේ කොට නිම කළ, බර පහකළ, තමාගේ උතුම් අරමුණට පැමිණි, භව සංයෝජන ප්‍රහීණ කළ, සම්‍යග් ප්‍රඥාවෙන් විමුක්ත වූ කෙනෙක් නම්, ඔහුට මේ කරුණු නවය සිදුකිරීමට නොහැක.”",
      "paliTitle": "Sutavāsuttaṃ",
      "englishTitle": "Sutavā Sutta",
      "sinhalaTitle": "සුතවා සූත්‍රය"
    },
    {
      "number": 8,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho sajjho paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sajjho paribbājako bhagavantaṃ etadavoca – ‘‘Ekamidāhaṃ, bhante, samayaṃ bhagavā idheva rājagahe viharāmi giribbaje. Tatra me, bhante, bhagavato sammukhā sutaṃ sammukhā paṭiggahitaṃ – ‘yo so, sajjha, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto, abhabbo so pañca ṭhānāni ajjhācarituṃ – abhabbo khīṇāsavo bhikkhu sañcicca pāṇaṃ jīvitā voropetuṃ, abhabbo khīṇāsavo bhikkhu adinnaṃ theyyasaṅkhātaṃ ādātuṃ, abhabbo khīṇāsavo bhikkhu methunaṃ dhammaṃ paṭisevituṃ, abhabbo khīṇāsavo bhikkhu sampajānamusā bhāsituṃ, abhabbo khīṇāsavo bhikkhu sannidhikārakaṃ kāme paribhuñjituṃ seyyathāpi pubbe agāriyabhūto’ti. Kacci metaṃ, bhante, bhagavato sussutaṃ suggahitaṃ sumanasikataṃ sūpadhārita’’nti? ‘‘Taggha te etaṃ, sajjha, sussutaṃ suggahitaṃ sumanasikataṃ sūpadhāritaṃ. Pubbe cāhaṃ, sajjha, etarahi ca evaṃ vadāmi – ‘yo so bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto, abhabbo so nava ṭhānāni ajjhācarituṃ – abhabbo khīṇāsavo bhikkhu sañcicca pāṇaṃ jīvitā voropetuṃ…pe… abhabbo khīṇāsavo bhikkhu sannidhikārakaṃ kāme paribhuñjituṃ seyyathāpi pubbe agāriyabhūto, abhabbo khīṇāsavo bhikkhu buddhaṃ paccakkhātuṃ, abhabbo khīṇāsavo bhikkhu dhammaṃ paccakkhātuṃ, abhabbo khīṇāsavo bhikkhu saṅghaṃ paccakkhātuṃ, abhabbo khīṇāsavo bhikkhu sikkhaṃ paccakkhātuṃ’. Pubbe cāhaṃ, sajjha, etarahi ca evaṃ vadāmi – ‘yo so bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto, abhabbo so imāni nava ṭhānāni ajjhācaritu’’’nti. Aṭṭhamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling at Rājagaha, on Vulture Peak Mountain. Then the wanderer Sajjha approached the Blessed One. Having approached, he exchanged courteous greetings with the Blessed One. Having concluded the cordial and memorable talk, he sat down to one side. Sitting to one side, the wanderer Sajjha said to the Blessed One: \"Venerable sir, on one occasion, the Blessed One was dwelling right here in Rājagaha, at Giribbaja. There, venerable sir, I heard and received this directly from the Blessed One: 'Sajjha, that bhikkhu who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who has laid down the burden, who has attained the true goal, whose fetters to existence are utterly destroyed, who is fully liberated through perfect knowledge—such a one is incapable of committing five deeds: an Arahant bhikkhu is incapable of intentionally depriving a living being of life; an Arahant bhikkhu is incapable of taking what is not given, in the manner of a thief; an Arahant bhikkhu is incapable of indulging in sexual intercourse; an Arahant bhikkhu is incapable of speaking a deliberate lie; an Arahant bhikkhu is incapable of indulging in sensual pleasures, storing them up as a householder would have done previously.' Has this, venerable sir, been well heard, well grasped, well attended to, and well comprehended by me from the Blessed One?\"\n\n\"Indeed, Sajjha, this has been well heard, well grasped, well attended to, and well comprehended by you. Formerly, Sajjha, and now too, I say this: 'That bhikkhu who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who has laid down the burden, who has attained the true goal, whose fetters to existence are utterly destroyed, who is fully liberated through perfect knowledge—such a one is incapable of committing nine deeds: an Arahant bhikkhu is incapable of intentionally depriving a living being of life… (and so on, repeating the previous five points up to)… an Arahant bhikkhu is incapable of indulging in sensual pleasures, storing them up as a householder would have done previously. Furthermore, an Arahant bhikkhu is incapable of rejecting the Buddha; an Arahant bhikkhu is incapable of rejecting the Dhamma; an Arahant bhikkhu is incapable of rejecting the Sangha; an Arahant bhikkhu is incapable of rejecting the training.' Formerly, Sajjha, and now too, I say this: 'That bhikkhu who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who has laid down the burden, who has attained the true goal, whose fetters to existence are utterly destroyed, who is fully liberated through perfect knowledge—such a one is incapable of committing these nine deeds.'\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි වැඩසිටින සේක. එකල්හි සජ්ජ පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු කථා බස් හුවමාරු කරගෙන එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි සජ්ජ පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භාග්‍යවතුන් වහන්ස, එක් කලෙක මම මෙහිම රජගහ නුවර ගිරිව්‍රජයෙහි වාසය කරමින් සිටියෙමි. එහිදී, භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේගේ සමීපයෙහිදී මට අසන්නට ලැබුණි, භාග්‍යවතුන් වහන්සේගෙන් සෘජුවම දැනගන්නට ලැබුණි – ‘සජ්ජයෙනි, යම් ඒ භික්ෂුවක් රහත් වූ, ක්ෂීණාශ්‍රව වූ, බ්‍රහ්මචාරී වාසය සම්පූර්ණ කළ, කළ යුතු දේ කොට නිම කළ, බර බහා තැබූ, ස්වකීය අර්ථය වූ අරහත්වය ලබාගත්, භව සංයෝජන ක්‍ෂය වූ, සම්‍යක් ප්‍රඥාවෙන් විමුක්ත වූ, ඔහු පස් කරුණක් කිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් හිතාමතා ප්‍රාණියෙකුගේ ජීවිතය නැති කිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් හොරකමක් ලෙස සැලකෙන දෙයක් ගැනීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් මෙථුන ධර්මයෙහි හැසිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් දැනුවත්ව බොරු කීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් පෙර ගිහිව සිටියාක් මෙන් ආහාර ගබඩා කර තබාගෙන පරිභෝජනය කිරීමට අසමර්ථය’ කියාය. භාග්‍යවතුන් වහන්ස, මා විසින් මෙය භාග්‍යවතුන් වහන්සේගෙන් මනාව අසන ලද්දක්ද, මනාව ග්‍රහණය කරගන්නා ලද්දක්ද, මනාව මෙනෙහි කරන ලද්දක්ද, මනාව ධාරණය කරගන්නා ලද්දක්ද?”\n\n“සජ්ජයෙනි, තොප විසින් මෙය සැබවින්ම මනාව අසන ලද්දක්, මනාව ග්‍රහණය කරගන්නා ලද්දක්, මනාව මෙනෙහි කරන ලද්දක්, මනාව ධාරණය කරගන්නා ලද්දක් වේ. සජ්ජයෙනි, පෙරත් මම මෙසේම කියමි, දැන් ද මම මෙසේම කියමි – ‘යම් ඒ භික්ෂුවක් රහත් වූ, ක්ෂීණාශ්‍රව වූ, බ්‍රහ්මචාරී වාසය සම්පූර්ණ කළ, කළ යුතු දේ කොට නිම කළ, බර බහා තැබූ, ස්වකීය අර්ථය වූ අරහත්වය ලබාගත්, භව සංයෝජන ක්‍ෂය වූ, සම්‍යක් ප්‍රඥාවෙන් විමුක්ත වූ, ඔහු කරුණු නවයක් කිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් හිතාමතා ප්‍රාණියෙකුගේ ජීවිතය නැති කිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් හොරකමක් ලෙස සැලකෙන දෙයක් ගැනීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් මෙථුන ධර්මයෙහි හැසිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් දැනුවත්ව බොරු කීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් පෙර ගිහිව සිටියාක් මෙන් ආහාර ගබඩා කර තබාගෙන පරිභෝජනය කිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් බුදුන් වහන්සේ ප්‍රතික්ෂේප කිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් ධර්මය ප්‍රතික්ෂේප කිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් සංඝයා ප්‍රතික්ෂේප කිරීමට අසමර්ථය. ක්ෂීණාශ්‍රව භික්ෂුවක් ශික්ෂාව ප්‍රතික්ෂේප කිරීමට අසමර්ථය’ කියාය.” සජ්ජයෙනි, පෙරත් මම මෙසේම කියමි, දැන් ද මම මෙසේම කියමි – ‘යම් ඒ භික්ෂුවක් රහත් වූ, ක්ෂීණාශ්‍රව වූ, බ්‍රහ්මචාරී වාසය සම්පූර්ණ කළ, කළ යුතු දේ කොට නිම කළ, බර බහා තැබූ, ස්වකීය අර්ථය වූ අරහත්වය ලබාගත්, භව සංයෝජන ක්‍ෂය වූ, සම්‍යක් ප්‍රඥාවෙන් විමුක්ත වූ, ඔහු මේ කරුණු නවය කිරීමට අසමර්ථය’ කියාය.\n\nඅටවෙනි සූත්‍රයයි.",
      "paliTitle": "Sajjhasuttaṃ",
      "englishTitle": "The Sajjha Discourse",
      "sinhalaTitle": "සජ්ඣ සූත්‍රය"
    },
    {
      "number": 9,
      "pali": "‘‘Navayime, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame nava? Arahā, arahattāya paṭipanno, anāgāmī, anāgāmiphalasacchikiriyāya paṭipanno, sakadāgāmī, sakadāgāmiphalasacchikiriyāya paṭipanno, sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno, puthujjano – ime kho, bhikkhave, nava puggalā santo saṃvijjamānā lokasmi’’nti. Navamaṃ.",
      "english": "Monks, these nine types of individuals exist and are found in the world. Which nine? An Arahant; one practicing for Arahantship; a Non-returner; one practicing for the realization of the fruit of Non-returning; a Once-returner; one practicing for the realization of the fruit of Once-returning; a Stream-enterer; one practicing for the realization of the fruit of Stream-entry; and an ordinary person. These, Monks, are the nine types of individuals that exist and are found in the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයන් නව දෙනෙක් ලෝකයේ සිටිති, විද්‍යමාන වෙති. කවරහුද ඒ නව දෙනා? අරහත්, අරහත්වයට පිළිපන්, අනාගාමී, අනාගාමී ඵලය සාක්ෂාත් කරගැනීම පිණිස පිළිපන්, සකෘදාගාමී, සකෘදාගාමී ඵලය සාක්ෂාත් කරගැනීම පිණිස පිළිපන්, සෝවාන්, සෝවාන් ඵලය සාක්ෂාත් කරගැනීම පිණිස පිළිපන්, සහ පෘථග්ජන – මහණෙනි, මේ පුද්ගලයන් නව දෙනා ලෝකයේ සිටිති, විද්‍යමාන වෙති.",
      "paliTitle": "Puggalasuttaṃ",
      "englishTitle": "Discourse on the Person",
      "sinhalaTitle": "පුද\\u200d්ගල සූත්‍රය"
    },
    {
      "number": 10,
      "pali": "‘‘Navayime, bhikkhave, puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa. Katame nava? Arahā, arahattāya paṭipanno, anāgāmī, anāgāmiphalasacchikiriyāya paṭipanno, sakadāgāmī, sakadāgāmiphalasacchikiriyāya paṭipanno, sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno, gotrabhū – ime kho, bhikkhave, nava puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Dasamaṃ. ",
      "english": "Monks, these nine persons are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and are the unsurpassed field of merit for the world. Which nine? An Arahant; one practicing for the realization of Arahantship; a Non-returner; one practicing for the realization of the fruit of Non-return; a Once-returner; one practicing for the realization of the fruit of Once-return; a Stream-enterer; one practicing for the realization of the fruit of Stream-entry; and a Gotrabhū person—these, monks, are the nine persons who are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, and are the unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, ලෝකයාගේ ආහුණෙය්‍ය වූද, පාහුණෙය්‍ය වූද, දක්ඛිණෙය්‍ය වූද, ඇඳිලි කොට වැඳීමට සුදුසු වූද, අනුත්තර වූ පින්කෙත වන මේ පුද්ගලයන් නව දෙනෙක් වෙති. කවරහුද ඒ නව දෙනා?\n\nඅරහත් වූ පුද්ගලයා, අරහත්වයට පිළිපන් පුද්ගලයා, අනාගාමී වූ පුද්ගලයා, අනාගාමී ඵලය සාක්ෂාත් කර ගැනීමට පිළිපන් පුද්ගලයා, සකදාගාමී වූ පුද්ගලයා, සකදාගාමී ඵලය සාක්ෂාත් කර ගැනීමට පිළිපන් පුද්ගලයා, සෝතාපන්න වූ පුද්ගලයා, සෝතාපත්ති ඵලය සාක්ෂාත් කර ගැනීමට පිළිපන් පුද්ගලයා, සහ ගෝත්‍රභූ වූ පුද්ගලයා යන මේ නව දෙනායි. මහණෙනි, ලෝකයාගේ ආහුණෙය්‍ය වූ...පෙ..., අනුත්තර වූ පින්කෙත වන මේ පුද්ගලයන් නව දෙනා මොවුහු වෙති.",
      "paliTitle": "Āhuneyyasuttaṃ",
      "englishTitle": "The Worthy of Offerings Discourse",
      "sinhalaTitle": "ආහුණෙය්‍ය සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Sambodhivaggo paṭhamo. Tassuddānaṃ – Sambodhi nissayo ceva, meghiya nandakaṃ balaṃ; Sevanā sutavā sajjho, puggalo āhuneyyena cāti.",
    "english": "The First Section on Enlightenment",
    "sinhala": "පළමු සම්බෝධි වග්ගය"
  }
}