{
  "id": "an9.2",
  "title": {
    "pali": "Sīhanādavaggo",
    "english": "The Section of the Lion's Roar",
    "sinhala": "සිංහනාද වග්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘vuttho me, bhante, sāvatthiyaṃ vassāvāso. Icchāmahaṃ, bhante, janapadacārikaṃ pakkamitu’’nti. ‘‘Yassadāni tvaṃ, sāriputta, kālaṃ maññasī’’ti. Atha kho āyasmā sāriputto uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho aññataro bhikkhu acirapakkante āyasmante sāriputte bhagavantaṃ etadavoca – ‘‘āyasmā maṃ, bhante, sāriputto āsajja appaṭinissajja cārikaṃ pakkanto’’ti. Atha kho bhagavā aññataraṃ bhikkhuṃ āmantesi – ‘‘ehi tvaṃ, bhikkhu, mama vacanena sāriputtaṃ āmantehi – ‘satthā taṃ, āvuso sāriputta, āmantetī’’’ti. ‘‘Evaṃ, bhante’’ti kho so bhikkhu bhagavato paṭissutvā yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ sāriputtaṃ etadavoca – ‘‘satthā taṃ, āvuso sāriputta, āmantetī’’ti. ‘‘Evamāvuso’’ti kho āyasmā sāriputto tassa bhikkhuno paccassosi. Tena kho pana samayena āyasmā ca mahāmoggallāno [mahāmoggalāno (ka.)] āyasmā ca ānando avāpuraṇaṃ [apāpuraṇaṃ (syā. ka.)] ādāya vihāre āhiṇḍanti [vihārena vihāraṃ anvāhiṇḍanti (sī. pī.), vihāraṃ āhiṇḍanti (syā.)] – ‘‘abhikkamathāyasmanto, abhikkamathāyasmanto! Idānāyasmā sāriputto bhagavato sammukhā sīhanādaṃ nadissatī’’ti. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca – ‘‘idha te, sāriputta, aññataro sabrahmacārī khīyanadhammaṃ āpanno – ‘āyasmā maṃ, bhante, sāriputto āsajja appaṭinissajjacārikaṃ pakkanto’’’ti. ‘‘Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, pathaviyaṃ sucimpi nikkhipanti asucimpi nikkhipanti gūthagatampi nikkhipanti muttagatampi nikkhipanti kheḷagatampi nikkhipanti pubbagatampi nikkhipanti lohitagatampi nikkhipanti, na ca tena pathavī aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, pathavīsamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, āpasmiṃ sucimpi dhovanti asucimpi dhovanti gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi dhovanti, na ca tena āpo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, āposamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, tejo sucimpi ḍahati asucimpi ḍahati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi ḍahati, na ca tena tejo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, tejosamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, vāyo sucimpi upavāyati asucimpi upavāyati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi upavāyati, na ca tena vāyo aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, vāyosamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, rajoharaṇaṃ sucimpi puñchati asucimpi puñchati gūthagatampi… muttagatampi… kheḷagatampi… pubbagatampi… lohitagatampi puñchati, na ca tena rajoharaṇaṃ aṭṭīyati vā harāyati vā jigucchati vā; evamevaṃ kho ahaṃ, bhante, rajoharaṇasamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, caṇḍālakumārako vā caṇḍālakumārikā vā kaḷopihattho nantakavāsī gāmaṃ vā nigamaṃ vā pavisanto nīcacittaṃyeva upaṭṭhapetvā pavisati; evamevaṃ kho ahaṃ, bhante, caṇḍālakumārakacaṇḍālakumārikāsamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, usabho chinnavisāṇo sūrato sudanto suvinīto rathiyāya rathiyaṃ siṅghāṭakena siṅghāṭakaṃ anvāhiṇḍanto na kiñci hiṃsati pādena vā visāṇena vā; evamevaṃ kho ahaṃ, bhante, usabhachinnavisāṇasamena cetasā viharāmi vipulena mahaggatena appamāṇena averena abyāpajjena. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, itthī vā puriso vā daharo yuvā maṇḍanakajātiko sīsaṃnhāto ahikuṇapena vā kukkurakuṇapena vā manussakuṇapena vā kaṇṭhe āsattena aṭṭīyeyya harāyeyya jiguccheyya; evamevaṃ kho ahaṃ, bhante, iminā pūtikāyena aṭṭīyāmi harāyāmi jigucchāmi. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyya. ‘‘Seyyathāpi, bhante, puriso medakathālikaṃ parihareyya chiddāvachiddaṃ uggharantaṃ paggharantaṃ; evamevaṃ kho ahaṃ, bhante, imaṃ kāyaṃ pariharāmi chiddāvachiddaṃ uggharantaṃ paggharantaṃ. Yassa nūna, bhante, kāye kāyagatāsati anupaṭṭhitā assa, so idha aññataraṃ sabrahmacāriṃ āsajja appaṭinissajja cārikaṃ pakkameyyā’’ti. Atha kho so bhikkhu uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavoca – ‘‘accayo maṃ, bhante, accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yo ahaṃ āyasmantaṃ sāriputtaṃ asatā tucchā musā abhūtena abbhācikkhiṃ. Tassa me, bhante, bhagavā accayaṃ accayato paṭiggaṇhatu āyatiṃ saṃvarāyā’’ti. ‘‘Taggha taṃ [tvaṃ (sī. pī.)], bhikkhu, accayo accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yo tvaṃ sāriputtaṃ asatā tucchā musā abhūtena abbhācikkhi. Yato ca kho tvaṃ, bhikkhu, accayaṃ accayato disvā yathādhammaṃ paṭikarosi, taṃ te mayaṃ paṭiggaṇhāma. Vuḍḍhihesā, bhikkhu, ariyassa vinaye yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti āyatiṃ saṃvaraṃ āpajjatī’’ti. Atha kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘khama, sāriputta, imassa moghapurisassa, purā tassa tattheva sattadhā muddhā phalatī’’ti [phalissatīti (ka. sī. syā. pī. ka.) aṭṭhakathāsu pana ‘‘phalatīti’’ itveva dissati]. ‘‘Khamāmahaṃ, bhante, tassa āyasmato sace maṃ so āyasmā evamāha – ‘khamatu ca me so āyasmā’’’ti. Paṭhamaṃ.",
      "english": "Once the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. Then Ven. Sāriputta approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, Ven. Sāriputta said to the Blessed One, \"Lord, I have completed my rainy season retreat in Sāvatthī. Lord, I wish to set out on a wandering tour.\" \"Sāriputta, now do as you deem fit.\" Then Ven. Sāriputta rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed.\n\nSoon after Ven. Sāriputta had departed, a certain monk said to the Blessed One, \"Lord, Ven. Sāriputta departed on his wandering tour having insulted me without apologizing.\"\n\nThen the Blessed One addressed a certain monk, \"Come, monk, address Sāriputta in my name, saying, 'Friend Sāriputta, the Teacher summons you.'\" \"Yes, Lord,\" the monk replied to the Blessed One, and he approached Ven. Sāriputta. Having approached, he said to Ven. Sāriputta, \"Friend Sāriputta, the Teacher summons you.\" \"Yes, friend,\" Ven. Sāriputta replied to that monk.\n\nNow at that time, Ven. Mahāmoggallāna and Ven. Ānanda were going from monastery to monastery carrying the key, announcing, \"Come forth, venerable sirs! Come forth, venerable sirs! Soon Ven. Sāriputta will roar his lion's roar in the presence of the Blessed One!\"\n\nThen Ven. Sāriputta approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As Ven. Sāriputta sat to one side, the Blessed One said to him, \"Sāriputta, a certain fellow monk here has found fault with you, saying, 'Lord, Ven. Sāriputta departed on his wandering tour having insulted me without apologizing.'\"\n\n\"Indeed, Lord, if bodily mindfulness were not established in a person, such a one might well insult another fellow monk without apologizing and depart on a wandering tour. Just as, Lord, people throw pure things onto the earth, and impure things, and excrement, and urine, and spittle, and pus, and blood, yet the earth is not annoyed by it, nor ashamed, nor disgusted; in the same way, Lord, I dwell with a mind like the earth: expansive, vast, immeasurable, without hostility, without ill will. Indeed, Lord, if bodily mindfulness were not established in a person, such a one might well insult another fellow monk without apologizing and depart on a wandering tour. Just as, Lord, people wash pure things in water, and impure things, and excrement, and urine, and spittle, and pus, and blood, yet the water is not annoyed by it, nor ashamed, nor disgusted; in the same way, Lord, I dwell with a mind like water: expansive, vast, immeasurable, without hostility, without ill will. Indeed, Lord, if bodily mindfulness were not established in a person, such a one might well insult another fellow monk without apologizing and depart on a wandering tour. Just as, Lord, fire burns pure things, and impure things, and excrement, and urine, and spittle, and pus, and blood, yet the fire is not annoyed by it, nor ashamed, nor disgusted; in the same way, Lord, I dwell with a mind like fire: expansive, vast, immeasurable, without hostility, without ill will. Indeed, Lord, if bodily mindfulness were not established in a person, such a one might well insult another fellow monk without apologizing and depart on a wandering tour. Just as, Lord, wind blows on pure things, and impure things, and excrement, and urine, and spittle, and pus, and blood, yet the wind is not annoyed by it, nor ashamed, nor disgusted; in the same way, Lord, I dwell with a mind like wind: expansive, vast, immeasurable, without hostility, without ill will. Indeed, Lord, if bodily mindfulness were not established in a person, such a one might well insult another fellow monk without apologizing and depart on a wandering tour. Just as, Lord, a dust-rag wipes up pure things, and impure things, and excrement, and urine, and spittle, and pus, and blood, yet the dust-rag is not annoyed by it, nor ashamed, nor disgusted; in the same way, Lord, I dwell with a mind like a dust-rag: expansive, vast, immeasurable, without hostility, without ill will.\"\n\nSurely, Venerable Sir, for whom mindfulness of the body is not established in the body, that person might here offend against a certain fellow renunciate, and without having made amends, depart on a journey.\n\n“Just as, Venerable Sir, an untouchable boy or girl, holding a basket and wearing rags, enters a village or town by establishing a humble mind, just so, Venerable Sir, I dwell with a mind like that of an untouchable boy or girl, expansive, elevated, immeasurable, free from enmity, free from ill-will.”\n\nSurely, Venerable Sir, for whom mindfulness of the body is not established in the body, that person might here offend against a certain fellow renunciate, and without having made amends, depart on a journey.\n\n“Just as, Venerable Sir, a bull with broken horns, valiant, well-tamed, well-disciplined, wandering from street to street, from crossroads to crossroads, harms nothing with its foot or its horns; just so, Venerable Sir, I dwell with a mind like that of a bull with broken horns, expansive, elevated, immeasurable, free from enmity, free from ill-will.”\n\nSurely, Venerable Sir, for whom mindfulness of the body is not established in the body, that person might here offend against a certain fellow renunciate, and without having made amends, depart on a journey.\n\n“Just as, Venerable Sir, a young man or woman, adorned, freshly bathed, would be distressed, humiliated, and disgusted by a snake carcass, a dog carcass, or a human carcass tied around the neck; just so, Venerable Sir, I am distressed, humiliated, and disgusted by this putrid body.”\n\nSurely, Venerable Sir, for whom mindfulness of the body is not established in the body, that person might here offend against a certain fellow renunciate, and without having made amends, depart on a journey.\n\n“Just as, Venerable Sir, a man would carry a pot for fat, full of holes and leaking, dripping; just so, Venerable Sir, I carry this body, full of holes and leaking, dripping.”\n\nSurely, Venerable Sir, for whom mindfulness of the body is not established in the body, that person might here offend against a certain fellow renunciate, and without having made amends, depart on a journey.\n\nThen that monk, rising from his seat, arranging his upper robe over one shoulder, prostrated his head at the Fortunate One’s feet, and said to the Fortunate One: “An offense has overcome me, Venerable Sir, as if foolish, as if deluded, as if unskillful, in that I slandered the Venerable Sāriputta with what was untrue, empty, false, and baseless. Venerable Sir, may the Fortunate One accept this offense of mine as an offense, for future restraint.”\n\n“Indeed, monk, an offense has overcome you, as if foolish, as if deluded, as if unskillful, in that you slandered Sāriputta with what was untrue, empty, false, and baseless. But since you, monk, having seen your offense as an offense, make amends according to the Dhamma, we accept it from you. This, monk, is growth in the noble discipline: that one, having seen an offense as an offense, makes amends according to the Dhamma and undertakes future restraint.”\n\nThen the Fortunate One addressed the Venerable Sāriputta: “Pardon, Sāriputta, this foolish man, before his head splits into seven pieces right there.” “I pardon that venerable one, Venerable Sir, if that venerable one says to me, ‘May that venerable one pardon me.’”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එසමයෙහි ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක වාඩිවූහ. එක් පසෙක වැඩහුන් ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, මම සැවැත් නුවර වස්වැස නිම කළෙමි. ස්වාමීනි, මම දැන් ජනපද චාරිකාවෙහි වැඩීමට කැමැත්තෙමි.” “සා‍රිපුත්තය, දැන් ඔබ ඒ සඳහා සුදුසු කාලය යැයි සිතන්නෙහි නම්, එසේ කරනු.” එසමයෙහි ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, ප්‍රදක්ෂිණා කොට පිටත්ව ගියහ.\n\nඑසමයෙහි, ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ පිටත්ව ගොස් වැඩි වේලාවක් ගතවීමට පෙර, එක් භික්ෂුවක් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ස්වාමීනි, ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ මට අපහාස කර, එය සමථයකට පත් නොකරම චාරිකාවෙහි වැඩියහ.” එසමයෙහි භාග්‍යවතුන් වහන්සේ එක් භික්ෂුවක් අමතා වදාළ සේක: “එම්බා භික්ෂුව, ඔබ මාගේ වචනයෙන් ශ්‍රීපුත්‍ර ස්ථවිරයන් අමතා, ‘ආයුෂ්මත් ශ්‍රීපුත්තයෙනි, ශාස්තෘන් වහන්සේ ඔබව කැඳවන සේකැයි’ පවසන්න.” “එසේය, ස්වාමීනි” යැයි කියා, ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේට මෙසේ පැවසුවේය: “ආයුෂ්මත් ශ්‍රීපුත්තයෙනි, ශාස්තෘන් වහන්සේ ඔබව කැඳවන සේක.” “එසේය, ආයුෂ්මත්වරයාණෙනි” යැයි ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ ඒ භික්ෂුවට පිළිතුරු දුන්හ. ඒ සමයෙහි, ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ සහ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ අගුල් රැගෙන විහාරයෙහි ඇවිදිමින් සිටියහ: “ආයුෂ්මත්වරයාණෙනි, ඉදිරියට වඩිනු, ආයුෂ්මත්වරයාණෙනි, ඉදිරියට වඩිනු! දැන් ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි සිංහනාදයක් කරනු ඇත.”\n\nඑසමයෙහි ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක වාඩිවූහ. එක් පසෙක වැඩහුන් ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “සා‍රිපුත්තය, මෙහිදී ඔබට විරුද්ධව එක් සබ්‍රහ්මචාරියෙක් චෝදනාවක් නැගුවේය: ‘ස්වාමීනි, ආයුෂ්මත් ශ්‍රීපුත්‍ර ස්ථවිරයන් වහන්සේ මට අපහාස කර, එය සමථයකට පත් නොකරම චාරිකාවෙහි වැඩියහ.’ ”\n\n“ස්වාමීනි, යමෙකුට සිරුරෙහි කයගතාසතිය (කය පිළිබඳ සිහිය) පිහිටා නොතිබෙන්නේ නම්, හෙතෙම මෙහිදී අන්‍ය සබ්‍රහ්මචාරියකුට අපහාස කර, එය සමථයකට පත් නොකරම චාරිකාවෙහි යනු ඇත.\n\n“ස්වාමීනි, යම්සේ පොළොවෙහි පිරිසිදු දේ ද, අපිරිසිදු දේ ද දමති; අසූචි ද දමති, මුත්‍රා ද දමති, කෙළ ද දමති, සැරව ද දමති, ලේ ද දමති, නමුත් ඒ නිසා පොළොව නොකිපෙයි, ලැජ්ජාවට පත් නොවෙයි, පිළිකුල් නොකරයි; එසෙයින්ම, ස්වාමීනි, මම ද පොළොව හා සමාන වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, හිංසාවෙන් තොර වූ සිතකින් වාසය කරමි. ස්වාමීනි, යමෙකුට සිරුරෙහි කයගතාසතිය පිහිටා නොතිබෙන්නේ නම්, හෙතෙම මෙහිදී අන්‍ය සබ්‍රහ්මචාරියකුට අපහාස කර, එය සමථයකට පත් නොකරම චාරිකාවෙහි යනු ඇත.\n\n“ස්වාමීනි, යම්සේ ජලයෙහි පිරිසිදු දේ ද, අපිරිසිදු දේ ද සෝදති; අසූචි ද සෝදති, මුත්‍රා ද සෝදති, කෙළ ද සෝදති, සැරව ද සෝදති, ලේ ද සෝදති, නමුත් ඒ නිසා ජලය නොකිපෙයි, ලැජ්ජාවට පත් නොවෙයි, පිළිකුල් නොකරයි; එසෙයින්ම, ස්වාමීනි, මම ද ජලය හා සමාන වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, හිංසාවෙන් තොර වූ සිතකින් වාසය කරමි. ස්වාමීනි, යමෙකුට සිරුරෙහි කයගතාසතිය පිහිටා නොතිබෙන්නේ නම්, හෙතෙම මෙහිදී අන්‍ය සබ්‍රහ්මචාරියකුට අපහාස කර, එය සමථයකට පත් නොකරම චාරිකාවෙහි යනු ඇත.\n\n“ස්වාමීනි, යම්සේ ගින්නෙන් පිරිසිදු දේ ද, අපිරිසිදු දේ ද දවයි; අසූචි ද දවයි, මුත්‍රා ද දවයි, කෙළ ද දවයි, සැරව ද දවයි, ලේ ද දවයි, නමුත් ඒ නිසා ගින්න නොකිපෙයි, ලැජ්ජාවට පත් නොවෙයි, පිළිකුල් නොකරයි; එසෙයින්ම, ස්වාමීනි, මම ද ගින්න හා සමාන වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, හිංසාවෙන් තොර වූ සිතකින් වාසය කරමි. ස්වාමීනි, යමෙකුට සිරුරෙහි කයගතාසතිය පිහිටා නොතිබෙන්නේ නම්, හෙතෙම මෙහිදී අන්‍ය සබ්‍රහ්මචාරියකුට අපහාස කර, එය සමථයකට පත් නොකරම චාරිකාවෙහි යනු ඇත.\n\n“ස්වාමීනි, යම්සේ සුළඟ පිරිසිදු දේ ද, අපිරිසිදු දේ ද හමාගෙන යයි; අසූචි ද හමාගෙන යයි, මුත්‍රා ද හමාගෙන යයි, කෙළ ද හමාගෙන යයි, සැරව ද හමාගෙන යයි, ලේ ද හමාගෙන යයි, නමුත් ඒ නිසා සුළඟ නොකිපෙයි, ලැජ්ජාවට පත් නොවෙයි, පිළිකුල් නොකරයි; එසෙයින්ම, ස්වාමීනි, මම ද සුළඟ හා සමාන වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, හිංසාවෙන් තොර වූ සිතකින් වාසය කරමි. ස්වාමීනි, යමෙකුට සිරුරෙහි කයගතාසතිය පිහිටා නොතිබෙන්නේ නම්, හෙතෙම මෙහිදී අන්‍ය සබ්‍රහ්මචාරියකුට අපහාස කර, එය සමථයකට පත් නොකරම චාරිකාවෙහි යනු ඇත.\n\n“ස්වාමීනි, යම්සේ දූවිලි පිසින රෙද්දකින් පිරිසිදු දේ ද, අපිරිසිදු දේ ද පිස දමයි; අසූචි ද පිස දමයි, මුත්‍රා ද පිස දමයි, කෙළ ද පිස දමයි, සැරව ද පිස දමයි, ලේ ද පිස දමයි, නමුත් ඒ නිසා ඒ දූවිලි පිසින රෙද්ද නොකිපෙයි, ලැජ්ජාවට පත් නොවෙයි, පිළිකුල් නොකරයි; එසෙයින්ම, ස්වාමීනි, මම ද දූවිලි පිසින රෙද්ද හා සමාන වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛරයෙන් තොර වූ, හිංසාවෙන් තොර වූ සිතකින් වාසය කරමි.\n\nභාග්‍යවතුන් වහන්ස, යමෙකුගේ කයෙහි කය පිළිබඳ සිහිය පිහිටා නොතිබුණි නම්, ඔහු මෙහිදී කිසියම් සබ්‍රහ්මචාරියෙකුට අපහාස කොට, එයට සමාව නොගෙනම චාරිකාවේ යන්නේය. භාග්‍යවතුන් වහන්ස, යම්සේ චණ්ඩාල කුමාරයෙක් හෝ චණ්ඩාල කුමාරිකාවක් වේවා, බුලත් මල්ලක් අතැතිව, ඉරුණු වස්ත්‍ර හැඳගෙන, ගමකට හෝ නගරයකට ඇතුළු වන්නේ පහත් සිතිවිලිම සිතෙහි පිහිටුවාගෙනද, එසේම මමද, භාග්‍යවතුන් වහන්ස, චණ්ඩාල කුමාරයෙක් හෝ චණ්ඩාල කුමාරිකාවක් හා සමාන වූ සිතකින්, එහෙත් විශාල, උත්තරීතර, අප්‍රමාණ වූ, වෛර රහිත, ද්වේෂ රහිත වූ සිතකින් යුතුව වාසය කරමි. යමෙකුගේ කයෙහි කය පිළිබඳ සිහිය පිහිටා නොතිබුණි නම්, ඔහු මෙහිදී කිසියම් සබ්‍රහ්මචාරියෙකුට අපහාස කොට, එයට සමාව නොගෙනම චාරිකාවේ යන්නේය. භාග්‍යවතුන් වහන්ස, යම්සේ කැඩුණු අං ඇති, ඉතා හොඳින් පුහුණු වූ, ඉතා හොඳින් දමනය කරන ලද, ඉතා හොඳින් හික්මුණු ගවයෙක් වීදියෙන් වීදියට, සතර මං හන්දියෙන් සතර මං හන්දියට ඇවිද යන්නේ පයින් හෝ අං වලින් කිසිවෙකුට හිංසා නොකරයිද, එසේම මමද, භාග්‍යවතුන් වහන්ස, කැඩුණු අං ඇති ගවයෙකු හා සමාන වූ සිතකින්, එහෙත් විශාල, උත්තරීතර, අප්‍රමාණ වූ, වෛර රහිත, ද්වේෂ රහිත වූ සිතකින් යුතුව වාසය කරමි. යමෙකුගේ කයෙහි කය පිළිබඳ සිහිය පිහිටා නොතිබුණි නම්, ඔහු මෙහිදී කිසියම් සබ්‍රහ්මචාරියෙකුට අපහාස කොට, එයට සමාව නොගෙනම චාරිකාවේ යන්නේය. භාග්‍යවතුන් වහන්ස, යම්සේ කිසියම් තරුණ, වයසින් අඩු, අලංකාරයට කැමති ස්ත්‍රියක් හෝ පුරුෂයෙක් හිස නා, සර්ප මලකඳක් හෝ බල්ලෙකුගේ මලකඳක් හෝ මනුෂ්‍ය මලකඳක් බෙල්ලේ එල්ලා තිබුණහොත්, එයට පිළිකුල් කරන්නේද, ලැජ්ජාවට පත්වන්නේද, කළකිරෙන්නේද, එසේම මමද, භාග්‍යවතුන් වහන්ස, මේ කුණු වූ කය පිළිබඳව පිළිකුල් කරමි, ලැජ්ජාවට පත්වෙමි, කළකිරෙමි. යමෙකුගේ කයෙහි කය පිළිබඳ සිහිය පිහිටා නොතිබුණි නම්, ඔහු මෙහිදී කිසියම් සබ්‍රහ්මචාරියෙකුට අපහාස කොට, එයට සමාව නොගෙනම චාරිකාවේ යන්නේය. භාග්‍යවතුන් වහන්ස, යම්සේ සිදුරු සහිත, බේරෙමින්, සොලවමින් යන තෙල් භාජනයක් මිනිසෙක් ගෙනයයිද, එසේම මමද, භාග්‍යවතුන් වහන්ස, සිදුරු සහිතව, බේරෙමින්, සොලවමින් යන මේ කය ගෙනයමි. යමෙකුගේ කයෙහි කය පිළිබඳ සිහිය පිහිටා නොතිබුණි නම්, ඔහු මෙහිදී කිසියම් සබ්‍රහ්මචාරියෙකුට අපහාස කොට, එයට සමාව නොගෙනම චාරිකාවේ යන්නේය.\n\nඉන්පසු ඒ භික්ෂුව අසුනෙන් නැගිට, උතුරුසඟය තනි අංසය මතට පොරවාගෙන, භාග්‍යවතුන් වහන්සේගේ දෙපා මුල හිස තබා වැඳ, භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"භාග්‍යවතුන් වහන්ස, අඥානයෙකු, මුළාවූවෙකු, අකුසල සහගත පුද්ගලයෙකු මෙන් මා විසින් වැරැද්දක් කර ඇත. එනම්, මම ආයුෂ්මත් සාරිපුත්ත ස්වාමීන් වහන්සේට සත්‍ය නොවන, හිස් වූ, බොරු වූ, අසත්‍ය වූ දෙයකින් චෝදනා කළෙමි. භාග්‍යවතුන් වහන්ස, මා කළ මේ වැරැද්ද වරදක් ලෙස සලකා පිළිගන්නේවා, ඉදිරි පැවැත්මේදී සංවරය පිණිස.\"\n\n\"මහණ, ඇත්තෙන්ම ඔබ අඥානයෙකු, මුළාවූවෙකු, අකුසල සහගත පුද්ගලයෙකු මෙන් වැරැද්දක් කර ඇත. එනම්, ඔබ සාරිපුත්තට සත්‍ය නොවන, හිස් වූ, බොරු වූ, අසත්‍ය වූ දෙයකින් චෝදනා කළේය. මහණ, යම් හෙයකින් ඔබ මේ වැරැද්ද වරදක් ලෙස දැක, ධර්මයට අනුව එය නිවැරදි කරන්නේද, එය අපි පිළිගනිමු. මහණ, ආර්ය විනයෙහි මෙය දියුණුවකි, යමෙක් වරදක් වරදක් ලෙස දැක, ධර්මයට අනුව එය නිවැරදි කොට, ඉදිරි පැවැත්මේදී සංවරයට පැමිණේ නම්.\"\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් සාරිපුත්ත ස්වාමීන් වහන්සේ ඇමතූ සේක: \"සාරිපුත්ත, මේ මුළා වූ පුද්ගලයාට කමා වන්න. එසේ නොකළහොත් ඔහුගේ හිස එතැනදීම සත් කඩකට පැළෙන්නේය.\"\n\n\"භාග්‍යවතුන් වහන්ස, මා හට කමා වන ලෙස ඒ ආයුෂ්මත් ස්වාමීන් වහන්සේ මට කියන්නේ නම්, මම ඒ ආයුෂ්මත් ස්වාමීන් වහන්සේට කමා වෙමි.\"",
      "paliTitle": "Sīhanādasuttaṃ",
      "englishTitle": "The Lion's Roar Discourse",
      "sinhalaTitle": "සිංහනාද සූත්‍රය"
    },
    {
      "number": 12,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā sāriputto pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Atha kho āyasmato sāriputtassa etadahosi – ‘‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ, yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’’nti. Atha kho āyasmā sāriputto yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘yo hi koci, āvuso, saupādiseso kālaṃ karoti, sabbo so aparimutto nirayā aparimutto tiracchānayoniyā aparimutto pettivisayā aparimutto apāyaduggativinipātā’’ti. Atha kho āyasmā sāriputto tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandi nappaṭikkosi. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkāmi – ‘‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’’ti. Atha kho āyasmā sāriputto sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisiṃ. Tassa mayhaṃ, bhante, etadahosi – ‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ; yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’nti. Atha kho ahaṃ, bhante, yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkamiṃ; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Tena kho pana samayena tesaṃ aññatitthiyānaṃ paribbājakānaṃ sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘yo hi koci, āvuso, saupādiseso kālaṃ karoti, sabbo so aparimutto nirayā aparimutto tiracchānayoniyā aparimutto pettivisayā aparimutto apāyaduggativinipātā’ti. Atha kho ahaṃ, bhante, tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamiṃ – ‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmī’’’ti. ‘‘Ke ca [keci (syā. pī.), te ca (ka.)], sāriputta, aññatitthiyā paribbājakā bālā abyattā, ke ca [keci (syā. pī. ka.) a. ni. 6.44 pāḷiyā saṃsandetabbaṃ] saupādisesaṃ vā ‘saupādiseso’ti jānissanti, anupādisesaṃ vā ‘anupādiseso’ti jānissanti’’! ‘‘Navayime, sāriputta, puggalā saupādisesā kālaṃ kurumānā parimuttā nirayā parimuttā tiracchānayoniyā parimuttā pettivisayā parimuttā apāyaduggativinipātā. Katame nava? Idha, sāriputta, ekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ paripūrakārī, paññāya mattaso kārī. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā antarāparinibbāyī hoti. Ayaṃ, sāriputta, paṭhamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā. ‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ paripūrakārī, paññāya mattaso kārī. So pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā upahaccaparinibbāyī hoti…pe… asaṅkhāraparinibbāyī hoti…pe… sasaṅkhāraparinibbāyī hoti…pe… uddhaṃsoto hoti akaniṭṭhagāmī. Ayaṃ, sāriputta, pañcamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā. ‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, chaṭṭho puggalo saupādiseso kālaṃ kurumāno parimutto nirayā…pe… parimutto apāyaduggativinipātā. ‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā ekabījī hoti, ekaṃyeva mānusakaṃ bhavaṃ nibbattetvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, sattamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā…pe… parimutto apāyaduggativinipātā. ‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā kolaṃkolo hoti, dve vā tīṇi vā kulāni sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, aṭṭhamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā…pe… parimutto apāyaduggativinipātā. ‘‘Puna caparaṃ, sāriputta, idhekacco puggalo sīlesu paripūrakārī hoti, samādhismiṃ mattaso kārī, paññāya mattaso kārī. So tiṇṇaṃ saṃyojanānaṃ parikkhayā sattakkhattuparamo hoti, sattakkhattuparamaṃ deve ca manusse ca sandhāvitvā saṃsaritvā dukkhassantaṃ karoti. Ayaṃ, sāriputta, navamo puggalo saupādiseso kālaṃ kurumāno parimutto nirayā parimutto tiracchānayoniyā parimutto pettivisayā parimutto apāyaduggativinipātā. ‘‘Ke ca, sāriputta, aññatitthiyā paribbājakā bālā abyattā, ke ca saupādisesaṃ vā ‘saupādiseso’ti jānissanti, anupādisesaṃ vā ‘anupādiseso’ti jānissanti! Ime kho, sāriputta, nava puggalā saupādisesā kālaṃ kurumānā parimuttā nirayā parimuttā tiracchānayoniyā parimuttā pettivisayā parimuttā apāyaduggativinipātā. Na tāvāyaṃ, sāriputta, dhammapariyāyo paṭibhāsi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Taṃ kissa hetu? Māyimaṃ dhammapariyāyaṃ sutvā pamādaṃ āhariṃsūti [āhariṃsu (sī. pī.)]. Api ca mayā [api cāyaṃ (?)], sāriputta, dhammapariyāyo pañhādhippāyena bhāsito’’ti. Dutiyaṃ.",
      "english": "On one occasion, the Blessed One was staying at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. Then, in the forenoon, the venerable Sāriputta, having dressed and taken his bowl and robes, entered Sāvatthī for alms. Then it occurred to the venerable Sāriputta, \"It is still too early to wander for alms in Sāvatthī. Let me go to the park of the wanderers of other sects.\" So the venerable Sāriputta went to the park of the wanderers of other sects. Having gone there, he exchanged greetings with those wanderers of other sects. Having concluded the courteous and memorable talk, he sat down to one side. Now at that time, those wanderers of other sects were seated together, assembled, and this discussion arose among them: \"Friends, whoever dies with residual clinging to existence, all such persons are not freed from hell, not freed from the animal realm, not freed from the realm of hungry ghosts, not freed from states of deprivation, unhappy destinations, and ruin.\" Then the venerable Sāriputta neither delighted in nor rejected the statement of those wanderers of other sects. Without delighting or rejecting it, he rose from his seat and departed, thinking, \"I will learn the meaning of this statement from the Blessed One.\"\n\nThen the venerable Sāriputta, after wandering for alms in Sāvatthī and returning from his alms round after his meal, went to the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As he sat to one side, the venerable Sāriputta said to the Blessed One, \"Venerable sir, in the forenoon I dressed, took my bowl and robes, and entered Sāvatthī for alms. Then it occurred to me, venerable sir, 'It is still too early to wander for alms in Sāvatthī. Let me go to the park of the wanderers of other sects.' So, venerable sir, I went to the park of the wanderers of other sects. Having gone there, I exchanged greetings with those wanderers of other sects. Having concluded the courteous and memorable talk, I sat down to one side. Now at that time, venerable sir, those wanderers of other sects were seated together, assembled, and this discussion arose among them: 'Friends, whoever dies with residual clinging to existence, all such persons are not freed from hell, not freed from the animal realm, not freed from the realm of hungry ghosts, not freed from states of deprivation, unhappy destinations, and ruin.' Then, venerable sir, I neither delighted in nor rejected the statement of those wanderers of other sects. Without delighting or rejecting it, I rose from my seat and departed, thinking, 'I will learn the meaning of this statement from the Blessed One.'\"\n\n\"Sāriputta, those wanderers of other sects are foolish and without understanding. How could they know 'with residual clinging to existence' as 'with residual clinging to existence,' or 'without residual clinging to existence' as 'without residual clinging to existence'? Sāriputta, there are these nine individuals who, though dying with residual clinging to existence, are freed from hell, freed from the animal realm, freed from the realm of hungry ghosts, freed from states of deprivation, unhappy destinations, and ruin. Which nine? Here, Sāriputta, a certain individual is complete in terms of moral conduct, complete in terms of concentration, but performs moderately in terms of wisdom. Having eradicated the five lower fetters, he is an in-between Nibbāna attainee. This, Sāriputta, is the first individual who, though dying with residual clinging to existence, is freed from hell, freed from the animal realm, freed from the realm of hungry ghosts, freed from states of deprivation, unhappy destinations, and ruin.\n\n\"Furthermore, Sāriputta, a certain individual here is complete in terms of moral conduct, complete in terms of concentration, but performs moderately in terms of wisdom. Having eradicated the five lower fetters, he is an Nibbāna attainee by striking at rebirth; he is an Nibbāna attainee without exertion; he is an Nibbāna attainee with exertion; he is one whose stream flows upwards, bound for the Akaniṭṭha realm. This, Sāriputta, is the fifth individual who, though dying with residual clinging to existence, is freed from hell, freed from the animal realm, freed from the realm of hungry ghosts, freed from states of deprivation, unhappy destinations, and ruin.\n\n\"Furthermore, Sāriputta, a certain individual here is complete in terms of moral conduct, but performs moderately in terms of concentration, and moderately in terms of wisdom. Having eradicated the three fetters and having attenuated lust, hatred, and delusion, he is a once-returner. He will return to this world just once more and make an end of suffering. This, Sāriputta, is the sixth individual who, though dying with residual clinging to existence, is freed from hell, freed from the animal realm, freed from the realm of hungry ghosts, freed from states of deprivation, unhappy destinations, and ruin.\n\n\"Furthermore, Sāriputta, a certain individual here is complete in terms of moral conduct, but performs moderately in terms of concentration, and moderately in terms of wisdom.\n\nWith the utter destruction of the three fetters, he becomes a 'one-seeder,' and having produced only one more human existence, he puts an end to suffering. This, Sāriputta, is the seventh person who, with the remainder of clinging, at the time of death, is fully freed from hell, fully freed from the animal realm, fully freed from the ghost realm, and fully freed from the states of woe, bad destinations, and perdition.\n\nFurthermore, Sāriputta, here a certain person is a full practitioner in moral conduct, a moderate practitioner in concentration, and a moderate practitioner in wisdom. With the utter destruction of the three fetters, he becomes a 'family-to-family' traveler, and having transmigrated and wandered through two or three existences, he puts an end to suffering. This, Sāriputta, is the eighth person who, with the remainder of clinging, at the time of death, is fully freed from hell, fully freed from the animal realm, fully freed from the ghost realm, and fully freed from the states of woe, bad destinations, and perdition.\n\nFurthermore, Sāriputta, here a certain person is a full practitioner in moral conduct, a moderate practitioner in concentration, and a moderate practitioner in wisdom. With the utter destruction of the three fetters, he becomes one who returns at most seven times, and having transmigrated and wandered at most seven times among devas and humans, he puts an end to suffering. This, Sāriputta, is the ninth person who, with the remainder of clinging, at the time of death, is fully freed from hell, fully freed from the animal realm, fully freed from the ghost realm, and fully freed from the states of woe, bad destinations, and perdition.\n\nAnd how, Sāriputta, could those foolish and unarticulate wanderers of other sects understand 'with the remainder of clinging' as 'with the remainder of clinging,' or 'without the remainder of clinging' as 'without the remainder of clinging'? These, Sāriputta, are the nine persons who, with the remainder of clinging, at the time of death, are fully freed from hell, fully freed from the animal realm, fully freed from the ghost realm, and fully freed from the states of woe, bad destinations, and perdition.\n\nThis exposition of the Dhamma, Sāriputta, was not revealed to monks, nuns, laymen, and laywomen before now. What was the reason for that? Lest, having heard this exposition of the Dhamma, they might fall into heedlessness. However, Sāriputta, this exposition of the Dhamma has been taught by me with the intention of addressing a question.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවනයේ අනේපිඬු සිටුහුගේ ආරාමයේ වැඩවසන සේක. ඉන්පසු ආයුෂ්මත් ශ්‍රීපුත්‍ර පෙරවරුවෙහි හැඳපෙරවගෙන පාත්‍ර සිවුරු රැගෙන සැවැත්නුවරට පිණ්ඩපාතය පිණිස වැඩිසේක. එවිට ආයුෂ්මත් ශ්‍රීපුත්‍රයන් වහන්සේට මෙසේ සිතුණි: \"සැවැත්නුවර පිණ්ඩපාතයෙහි හැසිරීමට මෙය බොහෝ වේලාසන වැඩිය. මම අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත යන්නෙම් නම් යෙහෙකැයි.\" ඉන්පසු ආයුෂ්මත් ශ්‍රීපුත්‍ර අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත වැඩිසේක. එහි පැමිණ එම අන්‍ය තීර්ථක පරිබ්‍රාජකයන් සමඟ සතුටු විය. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා බහ නිමවා එකත්පසෙක වාඩිවිය. එසමයෙහි රැස්ව සිටි, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන් අතර මේ කතාව ඇතිවිය: \"ඇවැත්නි, යම් කිසිවෙක් උපාදාන ක්ලේශයන් සහිතව කලුරිය කරන්නේ නම්, ඔහු සියල්ලෝම නිරයෙන් මිදුණේ නැත, තිරිසන් යෝනියෙන් මිදුණේ නැත, ප්‍රේත විෂයයෙන් මිදුණේ නැත, අපාය දුර්ගති විනිපාතයෙන් මිදුණේ නැත.\" ඉන්පසු ආයුෂ්මත් ශ්‍රීපුත්‍ර එම අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ කතාව අනුමත නොකළේය, ප්‍රතික්ෂේපද නොකළේය. අනුමත නොකොට, ප්‍රතික්ෂේප නොකොට අසුනෙන් නැගිට පිටත්ව ගියේය. \"භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ කතාවේ අර්ථය තේරුම් ගන්නෙමි\" යි. ඉන්පසු ආයුෂ්මත් ශ්‍රීපුත්‍ර සැවැත්නුවර පිණ්ඩපාතයෙහි හැසිර භෝජනයෙන් පසු පිණ්ඩපාතයෙන් ආපසු පැමිණ භාග්‍යවතුන් වහන්සේ වෙත වැඩිසේක. එහි පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙක වාඩිවිය.\n\nඑකත්පසෙක වැඩහිඳි ආයුෂ්මත් ශ්‍රීපුත්‍ර භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භාග්‍යවතුන් වහන්ස, මම මෙහි පෙරවරුවෙහි හැඳපෙරවගෙන පාත්‍ර සිවුරු රැගෙන සැවැත්නුවරට පිණ්ඩපාතය පිණිස වැඩිමි. භාග්‍යවතුන් වහන්ස, එවිට මට මෙසේ සිතුණි: ‘සැවැත්නුවර පිණ්ඩපාතයෙහි හැසිරීමට මෙය බොහෝ වේලාසන වැඩිය. මම අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත යන්නෙම් නම් යෙහෙකැයි.’ භාග්‍යවතුන් වහන්ස, ඉන්පසු මම අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත ගියෙමි. එහි පැමිණ එම අන්‍ය තීර්ථක පරිබ්‍රාජකයන් සමඟ සතුටු වීමි. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා බහ නිමවා එකත්පසෙක වාඩි වීමි. භාග්‍යවතුන් වහන්ස, එසමයෙහි රැස්ව සිටි, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන් අතර මේ කතාව ඇතිවිය: ‘ඇවැත්නි, යම් කිසිවෙක් උපාදාන ක්ලේශයන් සහිතව කලුරිය කරන්නේ නම්, ඔහු සියල්ලෝම නිරයෙන් මිදුණේ නැත, තිරිසන් යෝනියෙන් මිදුණේ නැත, ප්‍රේත විෂයයෙන් මිදුණේ නැත, අපාය දුර්ගති විනිපාතයෙන් මිදුණේ නැත.’ භාග්‍යවතුන් වහන්ස, ඉන්පසු මම එම අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ගේ කතාව අනුමත නොකළෙමි, ප්‍රතික්ෂේපද නොකළෙමි. අනුමත නොකොට, ප්‍රතික්ෂේප නොකොට අසුනෙන් නැගිට පිටත්ව ආවෙමි. ‘භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ කතාවේ අර්ථය තේරුම් ගන්නෙමි’ යි.\"\n\n\"ශ්‍රීපුත්‍රය, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ බාලයෝය, අව්‍යක්තයෝය. කවරහු නම් උපාදාන ක්ලේශයන් සහිත පුද්ගලයා ‘උපාදාන ක්ලේශයන් සහිත පුද්ගලයෙකැයි’ දැනගන්නට සමත් වෙත්ද? උපාදාන ක්ලේශයන් රහිත පුද්ගලයා ‘උපාදාන ක්ලේශයන් රහිත පුද්ගලයෙකැයි’ දැනගන්නට සමත් වෙත්ද!\" \"ශ්‍රීපුත්‍රය, උපාදාන ක්ලේශයන් සහිතව කලුරිය කරමින් වුවද, නිරයෙන්, තිරිසන් යෝනියෙන්, ප්‍රේත විෂයයෙන්, අපාය දුර්ගති විනිපාතයෙන් මිදුණු මේ පුද්ගලයෝ නව දෙනෙක් වෙති. ඒ නව දෙනා කවරහුද?\n\nශ්‍රීපුත්‍රය, මෙහි ඇතැම් පුද්ගලයෙක් ශීලයන්හි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධියෙහි සම්පූර්ණ කරන්නෙක් වෙයි, ප්‍රඥාවෙහි මඳ වශයෙන් කරන්නෙක් වෙයි. ඔහු පහක් වූ ඕරම්භාගීය සංයෝජන ක්ෂය කිරීමෙන් අන්තරාපරිනිර්වාණගාමී වෙයි. ශ්‍රීපුත්‍රය, උපාදාන ක්ලේශයන් සහිතව කලුරිය කරමින් වුවද, නිරයෙන්, තිරිසන් යෝනියෙන්, ප්‍රේත විෂයයෙන්, අපාය දුර්ගති විනිපාතයෙන් මිදුණු පළමුවන පුද්ගලයා මොහුය.\n\nතවද, ශ්‍රීපුත්‍රය, මෙහි ඇතැම් පුද්ගලයෙක් ශීලයන්හි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධියෙහි සම්පූර්ණ කරන්නෙක් වෙයි, ප්‍රඥාවෙහි මඳ වශයෙන් කරන්නෙක් වෙයි. ඔහු පහක් වූ ඕරම්භාගීය සංයෝජන ක්ෂය කිරීමෙන් උපහච්චපරිනිර්වාණගාමී වෙයි, ආසංඛාරපරිනිර්වාණගාමී වෙයි, සසංඛාරපරිනිර්වාණගාමී වෙයි, ඌර්ධවස්‍රෝතස් ඇතිව අකනිෂ්ඨගාමී වෙයි. ශ්‍රීපුත්‍රය, උපාදාන ක්ලේශයන් සහිතව කලුරිය කරමින් වුවද, නිරයෙන්, තිරිසන් යෝනියෙන්, ප්‍රේත විෂයයෙන්, අපාය දුර්ගති විනිපාතයෙන් මිදුණු පස්වන පුද්ගලයා මොහුය.\n\nතවද, ශ්‍රීපුත්‍රය, මෙහි ඇතැම් පුද්ගලයෙක් ශීලයන්හි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධියෙහි මඳ වශයෙන් කරන්නෙක් වෙයි, ප්‍රඥාවෙහි මඳ වශයෙන් කරන්නෙක් වෙයි. ඔහු සංයෝජන තුනක් ක්ෂය කිරීමෙන්ද, රාග, ද්වේෂ, මෝහ යන අකුසල මූල තුන තුනී වීමෙන්ද සකෘදාගාමී වෙයි. ඔහු එක වරක් පමණක් මේ ලෝකයට පැමිණ දුකෙහි කෙළවර කරන්නේය. ශ්‍රීපුත්‍රය, උපාදාන ක්ලේශයන් සහිතව කලුරිය කරමින් වුවද, නිරයෙන්, තිරිසන් යෝනියෙන්, ප්‍රේත විෂයයෙන්, අපාය දුර්ගති විනිපාතයෙන් මිදුණු සයවන පුද්ගලයා මොහුය.\n\nතවද, ශ්‍රීපුත්‍රය, මෙහි ඇතැම් පුද්ගලයෙක් ශීලයන්හි සම්පූර්ණ කරන්නෙක් වෙයි, සමාධියෙහි මඳ වශයෙන් කරන්නෙක් වෙයි, ප්‍රඥාවෙහි මඳ වශයෙන් කරන්නෙක් වෙයි.\n\nඒ පුද්ගලයා තෙවැදෑරුම් සංයෝජන ක්ෂය කිරීමෙන් ඒකබීජී වේ. ඔහු එක් මනුෂ්‍ය භවයක් පමණක් නැවත ලබාගෙන දුකෙහි කෙළවර කරන්නේය. ශාරිපුත්‍රය, මේ සත්වන පුද්ගලයා ඉතිරි උපධි සහිතව කලුරිය කරන්නේ නිරයෙන් මිදුණේය, තිරිසන් යෝනියෙන් මිදුණේය, ප්‍රේත විෂයයෙන් මිදුණේය, අපාය දුර්ගති විනිපාතයන්ගෙන් මිදුණේය.\n\nශාරිපුත්‍රය, තවද මෙහිලා යම් පුද්ගලයෙක් සිල් පිරීමෙහි පරිපූර්ණව කටයුතු කරන්නෙක් වේ, සමාධිය වඩනුවෙහි මධ්‍යස්ථව කටයුතු කරන්නෙක් වේ, ප්‍රඥාව වැඩීමෙහි මධ්‍යස්ථව කටයුතු කරන්නෙක් වේ. ඒ පුද්ගලයා තෙවැදෑරුම් සංයෝජන ක්ෂය කිරීමෙන් කෝලංකෝල වේ. ඔහු දෙකක් හෝ තුනක් වූ උසස් කුල අතර සැරිසරා, නැවත ඉපිද දුකෙහි කෙළවර කරන්නේය. ශාරිපුත්‍රය, මේ අටවන පුද්ගලයා ඉතිරි උපධි සහිතව කලුරිය කරන්නේ නිරයෙන් මිදුණේය, තිරිසන් යෝනියෙන් මිදුණේය, ප්‍රේත විෂයයෙන් මිදුණේය, අපාය දුර්ගති විනිපාතයන්ගෙන් මිදුණේය.\n\nශාරිපුත්‍රය, තවද මෙහිලා යම් පුද්ගලයෙක් සිල් පිරීමෙහි පරිපූර්ණව කටයුතු කරන්නෙක් වේ, සමාධිය වඩනුවෙහි මධ්‍යස්ථව කටයුතු කරන්නෙක් වේ, ප්‍රඥාව වැඩීමෙහි මධ්‍යස්ථව කටයුතු කරන්නෙක් වේ. ඒ පුද්ගලයා තෙවැදෑරුම් සංයෝජන ක්ෂය කිරීමෙන් සත්සක්ඛත්තූපරම වේ. ඔහු උපරිම හත් වරක් දෙව්ලොව සහ මිනිස්ලොව සැරිසරා, නැවත ඉපිද දුකෙහි කෙළවර කරන්නේය. ශාරිපුත්‍රය, මේ නවවන පුද්ගලයා ඉතිරි උපධි සහිතව කලුරිය කරන්නේ නිරයෙන් මිදුණේය, තිරිසන් යෝනියෙන් මිදුණේය, ප්‍රේත විෂයයෙන් මිදුණේය, අපාය දුර්ගති විනිපාතයන්ගෙන් මිදුණේය. ශාරිපුත්‍රය, බාල වූ, අවිද්‍යාවෙන් අන්ධ වූ අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ කවර නම් පුද්ගලයෝ ඉතිරි උපධි සහිත තැනැත්තකු ‘ඉතිරි උපධි සහිතයි’ කියා ද, ඉතිරි උපධි රහිත තැනැත්තකු ‘ඉතිරි උපධි රහිතයි’ කියා ද දැනගන්නෝ ද? ශාරිපුත්‍රය, මේ නව දෙනා වූ පුද්ගලයෝ ඉතිරි උපධි සහිතව කලුරිය කරන්නේ නිරයෙන් මිදුණෝ ය, තිරිසන් යෝනියෙන් මිදුණෝ ය, ප්‍රේත විෂයයෙන් මිදුණෝ ය, අපාය දුර්ගති විනිපාතයන්ගෙන් මිදුණෝ ය. ශාරිපුත්‍රය, මේ ධර්ම පර්යාය භික්ෂූන්ට, භික්ෂුණීන්ට, උපාසකවරුන්ට, උපාසිකාවන්ට වහාම පැහැදිලි නොවේ. ඊට හේතුව කුමක්ද යත්, මේ ධර්ම පර්යාය අසා ඔවුන් ප්‍රමාදයට නොපැමිණෙනු පිණිස ය. එසේ වුවද, ශාරිපුත්‍රය, මේ ධර්ම පර්යාය මා විසින් ප්‍රශ්න කිරීමේ අභිප්‍රාය ඇතිව දේශනා කරන ලදී.",
      "paliTitle": "Saupādisesasuttaṃ",
      "englishTitle": "Discourse on the Remainder",
      "sinhalaTitle": "සඋපාදිසේස සූත්‍රය"
    },
    {
      "number": 13,
      "pali": "Atha kho āyasmā mahākoṭṭhiko [mahākoṭṭhito (sī. syā. pī.)] yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā mahākoṭṭhiko āyasmantaṃ sāriputtaṃ etadavoca – ‘‘kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ diṭṭhadhammavedanīyaṃ, taṃ me kammaṃ samparāyavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ sukhavedanīyaṃ [sukhavedaniyaṃ (ka.) ma. ni. 3.8 passitabbaṃ], taṃ me kammaṃ dukkhavedanīyaṃ [dukkhavedaniyaṃ (ka.)] hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ sukhavedanīyaṃ [sukhavedaniyaṃ (ka.) ma. ni. 3.8 passitabbaṃ], taṃ me kammaṃ dukkhavedanīyaṃ [dukkhavedaniyaṃ (ka.)] hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ panāvuso, sāriputta, ‘yaṃ kammaṃ dukkhavedanīyaṃ, taṃ me kammaṃ sukhavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ paripakkavedanīyaṃ, taṃ me kammaṃ aparipakkavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ panāvuso sāriputta, ‘yaṃ kammaṃ aparipakkavedanīyaṃ, taṃ me kammaṃ paripakkavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ bahuvedanīyaṃ, taṃ me kammaṃ appavedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ panāvuso sāriputta, ‘yaṃ kammaṃ appavedanīyaṃ, taṃ me kammaṃ bahuvedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ nu kho, āvuso sāriputta, ‘yaṃ kammaṃ vedanīyaṃ, taṃ me kammaṃ avedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Kiṃ panāvuso sāriputta, ‘yaṃ kammaṃ avedanīyaṃ, taṃ me kammaṃ vedanīyaṃ hotū’ti, etassa atthāya bhagavati brahmacariyaṃ vussatī’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ diṭṭhadhammavedanīyaṃ taṃ me kammaṃ samparāyavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ samparāyavedanīyaṃ taṃ me kammaṃ diṭṭhadhammavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ sukhavedanīyaṃ taṃ me kammaṃ dukkhavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ dukkhavedanīyaṃ taṃ me kammaṃ sukhavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ paripakkavedanīyaṃ taṃ me kammaṃ aparipakkavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ aparipakkavedanīyaṃ taṃ me kammaṃ paripakkavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ bahuvedanīyaṃ taṃ me kammaṃ appavedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ appavedanīyaṃ taṃ me kammaṃ bahuvedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ nu kho, āvuso sāriputta, yaṃ kammaṃ vedanīyaṃ taṃ me kammaṃ avedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. ‘‘‘Kiṃ panāvuso sāriputta, yaṃ kammaṃ avedanīyaṃ taṃ me kammaṃ vedanīyaṃ hotūti, etassa atthāya bhagavati brahmacariyaṃ vussatī’ti, iti puṭṭho samāno ‘no hidaṃ, āvuso’ti vadesi. Atha kimatthaṃ carahāvuso, bhagavati brahmacariyaṃ vussatī’’ti? ‘‘Yaṃ khvassa [yaṃ kho (ka.)], āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ, tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussatī’’ti [vussati (syā.)]. (‘‘Kiṃ panassāvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ, yassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussatī’’ti?) [( ) syā. ka. potthakesu natthi] ‘‘‘Idaṃ dukkha’nti khvassa [kho yaṃ (ka.)], āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussati. Ayaṃ ‘dukkhasamudayo’ti khvassa, āvuso…pe… ‘ayaṃ dukkhanirodho’ti khvassa, āvuso…pe… ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti khvassa, āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussati. Idaṃ khvassa [iti kho yaṃ (ka.)], āvuso, aññātaṃ adiṭṭhaṃ appattaṃ asacchikataṃ anabhisametaṃ. Tassa [yassa (?)] ñāṇāya dassanāya pattiyā sacchikiriyāya abhisamayāya bhagavati brahmacariyaṃ vussatī’’ti. Tatiyaṃ.",
      "english": "Then Venerable Mahākoṭṭhika approached Venerable Sāriputta. Having approached, he exchanged courteous greetings with Venerable Sāriputta. When they had concluded their pleasant and memorable conversation, he sat down to one side.\n\nAs he sat to one side, Venerable Mahākoṭṭhika said to Venerable Sāriputta: “Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which is to be experienced in this very life, may become karma that is to be experienced in a future existence?” “No, friend.”\n\n“Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to pleasant experience, may become karma that leads to painful experience?” “No, friend.”\n\n“Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to pleasant experience, may become karma that leads to painful experience?” “No, friend.”\n\n“And is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to painful experience, may become karma that leads to pleasant experience?” “No, friend.”\n\n“Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, whose results are fully ripened, may become karma whose results are not fully ripened?” “No, friend.”\n\n“And is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, whose results are not fully ripened, may become karma whose results are fully ripened?” “No, friend.”\n\n“Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to abundant experience, may become karma that leads to meager experience?” “No, friend.”\n\n“And is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to meager experience, may become karma that leads to abundant experience?” “No, friend.”\n\n“Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which is to be experienced, may become karma that is not to be experienced?” “No, friend.”\n\n“And is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which is not to be experienced, may become karma that is to be experienced?” “No, friend.”\n\nWhen asked, “Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which is to be experienced in this very life, may become karma that is to be experienced in a future existence?” you answered, “No, friend.”\n\nWhen asked, “And is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which is to be experienced in a future existence, may become karma that is to be experienced in this very life?” you answered, “No, friend.”\n\nWhen asked, “Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to pleasant experience, may become karma that leads to painful experience?” you answered, “No, friend.”\n\nWhen asked, “And is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to painful experience, may become karma that leads to pleasant experience?” you answered, “No, friend.”\n\nWhen asked, “Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, whose results are fully ripened, may become karma whose results are not fully ripened?” you answered, “No, friend.”\n\nWhen asked, “And is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, whose results are not fully ripened, may become karma whose results are fully ripened?” you answered, “No, friend.”\n\nWhen asked, “Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to abundant experience, may become karma that leads to meager experience?” you answered, “No, friend.”\n\nWhen asked, “And is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which leads to meager experience, may become karma that leads to abundant experience?” you answered, “No, friend.”\n\nWhen asked, “Is it truly, friend Sāriputta, that the spiritual life is lived under the Blessed One for the purpose that my karma, which is to be experienced, may become karma that is not to be experienced?” you answered, “No, friend.”\n\n\"But friend Sāriputta, is it for this purpose that the holy life is lived under the Blessed One: 'May that karma which is not to be experienced by me become karma that is to be experienced by me'?\" When asked this, you replied, \"No, friend, it is not.\"\n\n\"Then for what purpose, friend, is the holy life lived under the Blessed One?\"\n\n\"That which, friend, is unknown, unseen, unattained, unverified, not fully realized – for its knowing, for its seeing, for its attainment, for its direct experience, for its full comprehension, the holy life is lived under the Blessed One.\"\n\n\"This is suffering, friend – that which is unknown, unseen, unattained, unverified, not fully realized. For its knowing, for its seeing, for its attainment, for its direct experience, for its full comprehension, the holy life is lived under the Blessed One.\n\nThis is the origin of suffering, friend – that which is unknown, unseen, unattained, unverified, not fully realized. This is the cessation of suffering, friend – that which is unknown, unseen, unattained, unverified, not fully realized. This is the path leading to the cessation of suffering, friend – that which is unknown, unseen, unattained, unverified, not fully realized. For its knowing, for its seeing, for its attainment, for its direct experience, for its full comprehension, the holy life is lived under the Blessed One.\n\nIndeed, friend, this entire matter – that which is unknown, unseen, unattained, unverified, not fully realized – for its knowing, for its seeing, for its attainment, for its direct experience, for its full comprehension, the holy life is lived under the Blessed One.\"",
      "sinhala": "එවිට ආයුෂ්මත් මහාකෝට්ඨිත ස්ථවිරයන් වහන්සේ ආයුෂ්මත් සැරියුත් ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණ, ආයුෂ්මත් සැරියුත් ස්ථවිරයන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු, සිහි කටයුතු කථා බස් හුවමාරු කරගෙන එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් මහාකෝට්ඨිත ස්ථවිරයන් වහන්සේ ආයුෂ්මත් සැරියුත් ස්ථවිරයන් වහන්සේට මෙය පැවසූහ:\n\n\"ඇවැත් සැරියුත්, 'මේ ආත්මයෙහි විපාක දෙන කර්මය මට මතු ආත්මයෙහි විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'සුව විපාක දෙන කර්මය මට දුක් විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'සුව විපාක දෙන කර්මය මට දුක් විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'දුක් විපාක දෙන කර්මය මට සුව විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'පරිපක්ව විපාක දෙන කර්මය මට අපරිපක්ව විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'අපරිපක්ව විපාක දෙන කර්මය මට පරිපක්ව විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'බොහෝ විපාක දෙන කර්මය මට අල්ප විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'අල්ප විපාක දෙන කර්මය මට බොහෝ විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'විපාක දෙන කර්මය මට විපාක නොදෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'විපාක නොදෙන කර්මය මට විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේද?\" \"ඇවැත්නි, එසේ නොවේ.\" \"ඇවැත් සැරියුත්, 'මේ ආත්මයෙහි විපාක දෙන කර්මය මට මතු ආත්මයෙහි විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු. \"ඇවැත් සැරියුත්, 'මතු ආත්මයෙහි විපාක දෙන කර්මය මට මේ ආත්මයෙහි විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු. \"ඇවැත් සැරියුත්, 'සුව විපාක දෙන කර්මය මට දුක් විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු. \"ඇවැත් සැරියුත්, 'දුක් විපාක දෙන කර්මය මට සුව විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු. \"ඇවැත් සැරියුත්, 'පරිපක්ව විපාක දෙන කර්මය මට අපරිපක්ව විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු. \"ඇවැත් සැරියුත්, 'අපරිපක්ව විපාක දෙන කර්මය මට පරිපක්ව විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු. \"ඇවැත් සැරියුත්, 'බොහෝ විපාක දෙන කර්මය මට අල්ප විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු. \"ඇවැත් සැරියුත්, 'අල්ප විපාක දෙන කර්මය මට බොහෝ විපාක දෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු. \"ඇවැත් සැරියුත්, 'විපාක දෙන කර්මය මට විපාක නොදෙන කර්මයක් වේවා' යන මේ අදහසින් භාග්‍යවතුන් වහන්සේ වෙත බ්‍රහ්මචර්යාව පුරනු ලැබේදැයි මෙසේ අසන ලද ඔබ, 'ඇවැත්නි, එසේ නොවේ' යැයි පැවසුවහු.\n\nආයුෂ්මත් ශාරිපුත්‍රයෙනි, ‘නොවිඳිය යුතු කර්මයක් වේ නම්, ඒ කර්මය මට විඳිය යුතු වේවා!’ යනු පිණිස භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචරියාව වාසය කරනු ලබන්නේදැයි මෙසේ අසන ලද කල්හි, ‘නැත, ආයුෂ්මත්නි’යි ඔබ වදාළා. එසේ නම් ආයුෂ්මත්නි, කුමක් පිණිසද භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචරියාව වාසය කරනු ලබන්නේ? ආයුෂ්මත්නි, යමක් නොදන්නා ලද්දේද, නොදක්නා ලද්දේද, නොලැබූ ලද්දේද, සාක්ෂාත් නොකරන ලද්දේද, ප්‍රත්‍යවේක්ෂා නොකරන ලද්දේද වේද, එහි ඥානය පිණිස, දර්ශනය පිණිස, ප්‍රාප්තිය පිණිස, සාක්ෂාත් කිරීම පිණිස, ප්‍රත්‍යවේක්ෂාව පිණිස භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචරියාව වාසය කරනු ලබයි.\n\nආයුෂ්මත්නි, ‘මෙය දුකයි’ යනු යමක් නොදන්නා ලද්දේද, නොදක්නා ලද්දේද, නොලැබූ ලද්දේද, සාක්ෂාත් නොකරන ලද්දේද, ප්‍රත්‍යවේක්ෂා නොකරන ලද්දේද වේද, එහි ඥානය පිණිස, දර්ශනය පිණිස, ප්‍රාප්තිය පිණිස, සාක්ෂාත් කිරීම පිණිස, ප්‍රත්‍යවේක්ෂාව පිණිස භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචරියාව වාසය කරනු ලබයි. ආයුෂ්මත්නි, ‘මෙය දුක හටගැනීමයි’ යනු යමක් නොදන්නා ලද්දේද, නොදක්නා ලද්දේද, නොලැබූ ලද්දේද, සාක්ෂාත් නොකරන ලද්දේද, ප්‍රත්‍යවේක්ෂා නොකරන ලද්දේද වේද, එහි ඥානය පිණිස, දර්ශනය පිණිස, ප්‍රාප්තිය පිණිස, සාක්ෂාත් කිරීම පිණිස, ප්‍රත්‍යවේක්ෂාව පිණිස භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචරියාව වාසය කරනු ලබයි. ආයුෂ්මත්නි, ‘මෙය දුක නැතිකිරීමයි’ යනු යමක් නොදන්නා ලද්දේද, නොදක්නා ලද්දේද, නොලැබූ ලද්දේද, සාක්ෂාත් නොකරන ලද්දේද, ප්‍රත්‍යවේක්ෂා නොකරන ලද්දේද වේද, එහි ඥානය පිණිස, දර්ශනය පිණිස, ප්‍රාප්තිය පිණිස, සාක්ෂාත් කිරීම පිණිස, ප්‍රත්‍යවේක්ෂාව පිණිස භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචරියාව වාසය කරනු ලබයි. ආයුෂ්මත්නි, ‘මෙය දුක නැති කිරීමේ මාර්ගයයි’ යනු යමක් නොදන්නා ලද්දේද, නොදක්නා ලද්දේද, නොලැබූ ලද්දේද, සාක්ෂාත් නොකරන ලද්දේද, ප්‍රත්‍යවේක්ෂා නොකරන ලද්දේද වේද, එහි ඥානය පිණිස, දර්ශනය පිණිස, ප්‍රාප්තිය පිණිස, සාක්ෂාත් කිරීම පිණිස, ප්‍රත්‍යවේක්ෂාව පිණිස භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචරියාව වාසය කරනු ලබයි. ආයුෂ්මත්නි, නොදන්නා ලද්දේද, නොදක්නා ලද්දේද, නොලැබූ ලද්දේද, සාක්ෂාත් නොකරන ලද්දේද, ප්‍රත්‍යවේක්ෂා නොකරන ලද්දේද වූ මෙයයි. එහි ඥානය පිණිස, දර්ශනය පිණිස, ප්‍රාප්තිය පිණිස, සාක්ෂාත් කිරීම පිණිස, ප්‍රත්‍යවේක්ෂාව පිණිස භාග්‍යවතුන් වහන්සේ යටතේ බ්‍රහ්මචරියාව වාසය කරනු ලබයි.",
      "paliTitle": "Koṭṭhikasuttaṃ",
      "englishTitle": "Koṭṭhika Sutta",
      "sinhalaTitle": "කෝට්ඨික සූත්‍රය"
    },
    {
      "number": 14,
      "pali": "Atha kho āyasmā samiddhi yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ sāriputtaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ samiddhiṃ āyasmā sāriputto etadavoca – ‘‘kimārammaṇā, samiddhi, purisassa saṅkappavitakkā uppajjantī’’ti? ‘‘Nāmarūpārammaṇā, bhante’’ti. ‘‘Te pana, samiddhi, kva nānattaṃ gacchantī’’ti? ‘‘Dhātūsu, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsamudayā’’ti? ‘‘Phassasamudayā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsamosaraṇā’’ti? ‘‘Vedanāsamosaraṇā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃpamukhā’’ti? ‘‘Samādhippamukhā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃadhipateyyā’’ti? ‘‘Satādhipateyyā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃuttarā’’ti? ‘‘Paññuttarā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃsārā’’ti? ‘‘Vimuttisārā, bhante’’ti. ‘‘Te pana, samiddhi, kiṃogadhā’’ti? ‘‘Amatogadhā, bhante’’ti. ‘‘‘Kimārammaṇā, samiddhi, purisassa saṅkappavitakkā uppajjantī’ti, iti puṭṭho samāno ‘nāmarūpārammaṇā, bhante’ti vadesi. ‘Te pana, samiddhi, kva nānattaṃ gacchantī’ti, iti puṭṭho samāno ‘dhātūsu, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃsamudayā’ti, iti puṭṭho samāno ‘phassasamudayā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃsamosaraṇā’ti, iti puṭṭho samāno ‘vedanāsamosaraṇā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃpamukhā’ti, iti puṭṭho samāno ‘samādhippamukhā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃadhipateyyā’ti, iti puṭṭho samāno ‘satādhipateyyā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃuttarā’ti, iti puṭṭho samāno ‘paññuttarā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃsārā’ti, iti puṭṭho samāno ‘vimuttisārā, bhante’ti vadesi. ‘Te pana, samiddhi, kiṃogadhā’ti, iti puṭṭho samāno ‘amatogadhā, bhante’ti vadesi. Sādhu sādhu, samiddhi! Sādhu kho tvaṃ, samiddhi, puṭṭho [pañhaṃ (sī. syā. pī.)] puṭṭho vissajjesi, tena ca mā maññī’’ti. Catutthaṃ.",
      "english": "Then the Venerable Samiddhi approached the Venerable Sāriputta, and having approached and paid respects to the Venerable Sāriputta, he sat down to one side. To the Venerable Samiddhi, who was seated to one side, the Venerable Sāriputta said this: \"Samiddhi, with what as their object do a person's thoughts and ponderings arise?\" \"Venerable sir, they arise with mind-and-matter as their object.\" \"But Samiddhi, where do they acquire diversity?\" \"Venerable sir, in the elements.\" \"But Samiddhi, what is their origin?\" \"Venerable sir, they originate from contact.\" \"But Samiddhi, where do they converge?\" \"Venerable sir, they converge in feeling.\" \"But Samiddhi, what is their foremost element?\" \"Venerable sir, concentration is their foremost element.\" \"But Samiddhi, what is their governing principle?\" \"Venerable sir, mindfulness is their governing principle.\" \"But Samiddhi, what is their supreme element?\" \"Venerable sir, wisdom is their supreme element.\" \"But Samiddhi, what is their essence?\" \"Venerable sir, liberation is their essence.\" \"But Samiddhi, what do they culminate in?\" \"Venerable sir, they culminate in the Deathless.\"\n\n\"When asked, 'Samiddhi, with what as their object do a person's thoughts and ponderings arise?' you replied, 'Venerable sir, they arise with mind-and-matter as their object.' When asked, 'But Samiddhi, where do they acquire diversity?' you replied, 'Venerable sir, in the elements.' When asked, 'But Samiddhi, what is their origin?' you replied, 'Venerable sir, they originate from contact.' When asked, 'But Samiddhi, where do they converge?' you replied, 'Venerable sir, they converge in feeling.' When asked, 'But Samiddhi, what is their foremost element?' you replied, 'Venerable sir, concentration is their foremost element.' When asked, 'But Samiddhi, what is their governing principle?' you replied, 'Venerable sir, mindfulness is their governing principle.' When asked, 'But Samiddhi, what is their supreme element?' you replied, 'Venerable sir, wisdom is their supreme element.' When asked, 'But Samiddhi, what is their essence?' you replied, 'Venerable sir, liberation is their essence.' When asked, 'But Samiddhi, what do they culminate in?' you replied, 'Venerable sir, they culminate in the Deathless.' Excellent, excellent, Samiddhi! Indeed, Samiddhi, when asked, you have answered well. But do not on account of that become conceited.\"",
      "sinhala": "එසමයෙහි ආයුෂ්මත් සමිද්ධි තෙරණුවෝ ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරණුවන් වෙත එළඹියහ; එළඹ, ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරණුවන්ට වැඳ, එකත්පසෙකින් වැඩහුන්හ. එකත්පසෙකින් වැඩහුන් ආයුෂ්මත් සමිද්ධි තෙරණුවන් හට ආයුෂ්මත් ශ්‍රීපුත්‍ර තෙරණුවෝ මෙසේ වදාළහ: \"සමිද්ධි, පුද්ගලයාගේ සංකල්ප හා විතර්ක (සිතුවිලි) උපදින්නේ කුමන අරමුණක් නිසාද?\"\n\n\"ස්වාමීනි, නාමරූප අරමුණු කොටගෙනය.\" \"සමිද්ධි, එහෙත් ඒ සිතුවිලි වෙනස් වන්නේ (නොයෙක් ආකාර වන්නේ) කොහිදීද?\" \"ස්වාමීනි, ධාතූන් තුළදීය.\" \"සමිද්ධි, එහෙත් ඒ සිතුවිලි කුමක් හේතු කොටගෙන හටගන්නවාද?\" \"ස්වාමීනි, ස්පර්ශය හේතු කොටගෙනය.\" \"සමිද්ධි, එහෙත් ඒ සිතුවිලි කුමක් වෙත එක්රැස් වේද?\" \"ස්වාමීනි, වේදනාව වෙත එක්රැස් වේ.\" \"සමිද්ධි, එහෙත් ඒ සිතුවිලිවල ප්‍රධානත්වය කුමක්ද?\" \"ස්වාමීනි, සමාධිය ප්‍රධාන වේ.\" \"සමිද්ධි, එහෙත් ඒ සිතුවිලිවල අධිපතිත්වය කුමක්ද?\" \"ස්වාමීනි, සතිය අධිපති වේ.\" \"සමිද්ධි, එහෙත් ඒ සිතුවිලිවල උතුම් බව කුමක්ද?\" \"ස්වාමීනි, ප්‍රඥාව උතුම් වේ.\" \"සමිද්ධි, එහෙත් ඒ සිතුවිලිවල සාරය කුමක්ද?\" \"ස්වාමීනි, විමුක්තිය සාරය වේ.\" \"සමිද්ධි, එහෙත් ඒ සිතුවිලි කුමක් තුළ ගිලී පවතීද?\" \"ස්වාමීනි, අමා නිවන තුළ ගිලී පවතී.\"\n\n\"සමිද්ධි, 'පුද්ගලයාගේ සංකල්ප හා විතර්ක උපදින්නේ කුමන අරමුණක් නිසාදැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, නාමරූප අරමුණු කොටගෙනය'යි ඔබ වදාළෙහිය. 'සමිද්ධි, එහෙත් ඒ සිතුවිලි කොහිදී වෙනස් වේදැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, ධාතූන් තුළදීය'යි ඔබ වදාළෙහිය. 'සමිද්ධි, එහෙත් ඒ සිතුවිලි කුමක් හේතු කොටගෙන හටගන්නවාදැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, ස්පර්ශය හේතු කොටගෙනය'යි ඔබ වදාළෙහිය. 'සමිද්ධි, එහෙත් ඒ සිතුවිලි කුමක් වෙත එක්රැස් වේදැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, වේදනාව වෙත එක්රැස් වේ'යි ඔබ වදාළෙහිය. 'සමිද්ධි, එහෙත් ඒ සිතුවිලිවල ප්‍රධානත්වය කුමක්දැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, සමාධිය ප්‍රධාන වේ'යි ඔබ වදාළෙහිය. 'සමිද්ධි, එහෙත් ඒ සිතුවිලිවල අධිපතිත්වය කුමක්දැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, සතිය අධිපති වේ'යි ඔබ වදාළෙහිය. 'සමිද්ධි, එහෙත් ඒ සිතුවිලිවල උතුම් බව කුමක්දැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, ප්‍රඥාව උතුම් වේ'යි ඔබ වදාළෙහිය. 'සමිද්ධි, එහෙත් ඒ සිතුවිලිවල සාරය කුමක්දැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, විමුක්තිය සාරය වේ'යි ඔබ වදාළෙහිය. 'සමිද්ධි, එහෙත් ඒ සිතුවිලි කුමක් තුළ ගිලී පවතීදැ?'යි මෙසේ අසන ලද්දේ, 'ස්වාමීනි, අමා නිවන තුළ ගිලී පවතී'යි ඔබ වදාළෙහිය. සාධු! සාධු! සමිද්ධි! සමිද්ධි, ඔබ ඇසූ පැනයන්ට මැනැවින් පිළිතුරු දුන්නේය; එහෙත් ඒ නිසා මානයට නොපැමිණෙන්න.\"",
      "paliTitle": "Samiddhisuttaṃ",
      "englishTitle": "Samiddhi Sutta",
      "sinhalaTitle": "සමිද්‍ධි සූත්‍රය"
    },
    {
      "number": 15,
      "pali": "‘‘Seyyathāpi, bhikkhave, gaṇḍo anekavassagaṇiko. Tassassu gaṇḍassa nava vaṇamukhāni nava abhedanamukhāni. Tato yaṃ kiñci pagghareyya – asuciyeva pagghareyya, duggandhaṃyeva pagghareyya, jegucchiyaṃyeva [jegucchiyeva (ka.)] pagghareyya; yaṃ kiñci pasaveyya – asuciyeva pasaveyya, duggandhaṃyeva pasaveyya, jegucchiyaṃyeva pasaveyya. ‘‘Gaṇḍoti kho, bhikkhave, imassetaṃ cātumahābhūtikassa [cātummahābhūtikassa (sī. syā. pī.)] kāyassa adhivacanaṃ mātāpettikasambhavassa odanakummāsūpacayassa aniccucchādanaparimaddanabhedanaviddhaṃsanadhammassa. Tassassu gaṇḍassa nava vaṇamukhāni nava abhedanamukhāni. Tato yaṃ kiñci paggharati – asuciyeva paggharati, duggandhaṃyeva paggharati, jegucchiyaṃyeva paggharati; yaṃ kiñci pasavati – asuciyeva pasavati, duggandhaṃyeva pasavati, jegucchiyaṃyeva pasavati. Tasmātiha, bhikkhave, imasmiṃ kāye nibbindathā’’ti. Pañcamaṃ.",
      "english": "Just as, monks, a festering boil that has existed for many years. That boil would have nine openings of sores, nine orifices for exudation. From it, whatever might flow forth would be only impurity, only foul smell, only detestable matter; whatever it might discharge would be only impurity, only foul smell, only detestable matter.\n\nMonks, the term 'boil' is an appellation for this body, composed of the four great elements, born of mother and father, sustained by rice and gruel, whose nature is impermanence, needing constant anointing and massaging, and subject to breaking up and disintegration. This body has nine openings of sores, nine orifices for exudation. From it, whatever flows forth is only impurity, only foul smell, only detestable matter; whatever it discharges is only impurity, only foul smell, only detestable matter. Therefore, monks, become dispassionate towards this body.",
      "sinhala": "මහණෙනි, යම් සේ බොහෝ වසරක් පැරණි සැරව ගෙඩියක් වේ ද, ඒ සැරව ගෙඩියට නව තුවාල කටවල් ද, නිරන්තරයෙන් පැළෙන නව සිදුරු ද ඇත්තේය. එයින් කුමක් හෝ ගලා ආවොත් අපවිත්‍ර දෙයක් ම ගලා එන්නේය, දුර්ගන්ධයක් ම ගලා එන්නේය, පිළිකුල් සහගත දෙයක් ම ගලා එන්නේය; කුමක් හෝ පිටතට පැමිණියහොත් අපවිත්‍ර දෙයක් ම පිටතට පැමිණෙන්නේය, දුර්ගන්ධයක් ම පිටතට පැමිණෙන්නේය, පිළිකුල් සහගත දෙයක් ම පිටතට පැමිණෙන්නේය.\n\nමහණෙනි, ‘සැරව ගෙඩිය’ යනු මේ සිව්මහා භූතයන්ගෙන් හටගත්, මවුපියන්ගෙන් හටගත්, බත් කැඳවලින් වැඩුණු, අනියත වූ ද, ඇල්මෙන් නිතර අභ්‍යංග කරනු ලබන, සම්බාහනය කරනු ලබන, බිඳී යාමේ හා විනාශ වීමේ ස්වභාවය ඇති ශරීරයට නම් වශයෙන් කියනු ලැබේ. ඒ සැරව ගෙඩිය (වැනි වූ ශරීරය) ට නව තුවාල කටවල් ද, නිරන්තරයෙන් පැළෙන නව සිදුරු ද ඇත්තේය. එයින් කුමක් හෝ ගලා ආවොත් අපවිත්‍ර දෙයක් ම ගලා එන්නේය, දුර්ගන්ධයක් ම ගලා එන්නේය, පිළිකුල් සහගත දෙයක් ම ගලා එන්නේය; කුමක් හෝ පිටතට පැමිණියහොත් අපවිත්‍ර දෙයක් ම පිටතට පැමිණෙන්නේය, දුර්ගන්ධයක් ම පිටතට පැමිණෙන්නේය, පිළිකුල් සහගත දෙයක් ම පිටතට පැමිණෙන්නේය. එබැවින්, මහණෙනි, මේ ශරීරය කෙරෙහි කලකිරෙව්වාහු වෙත්වා!",
      "paliTitle": "Gaṇḍasuttaṃ",
      "englishTitle": "The Boil Discourse",
      "sinhalaTitle": "ගෙඩි සූත්‍රය"
    },
    {
      "number": 16,
      "pali": "‘‘Navayimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. Katamā nava? Asubhasaññā, maraṇasaññā, āhāre paṭikūlasaññā [paṭikkūlasaññā (sī. syā. pī.)], sabbaloke anabhiratasaññā [anabhiratisaññā (ka.) a. ni. 5.121-122], aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā – imā kho, bhikkhave, nava saññā, bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these nine perceptions, when developed and repeatedly cultivated, are of great fruit and great benefit, leading to the Deathless, culminating in the Deathless. Which nine? The perception of unattractiveness, the perception of death, the perception of repugnance in food, the perception of disenchantment with all existence, the perception of impermanence, the perception of suffering in impermanence, the perception of non-self in suffering, the perception of relinquishment, and the perception of dispassion. These nine perceptions, monks, when developed and repeatedly cultivated, are of great fruit and great benefit, leading to the Deathless, culminating in the Deathless.",
      "sinhala": "මහණෙනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලද මේ සංඥා නවයක් ඇත. ඒවා මහාඵල ඇත්තාහ, මහානිසංස ඇත්තාහ, අමෘතයට ගමන් කරන්නාහ, අමෘතයෙන් කෙළවර වන්නාහ.\n\nකවර ඒවා නවයද?\n\nඅශුභ සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සියලු ලෝකයෙහි නොඇලීමේ සංඥාව, අනිත්‍‍ය සංඥාව, අනිත්‍‍ය වූ දෙයෙහි දුක්ඛ සංඥාව, දුක්ඛ වූ දෙයෙහි අනාත්ම සංඥාව, ප්‍ර‍හාණ සංඥාව, විරාග සංඥාව යන මේවාය.\n\nමහණෙනි, වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලද මේ නව සංඥාවෝ මහාඵල ඇත්තාහ, මහානිසංස ඇත්තාහ, අමෘතයට ගමන් කරන්නාහ, අමෘතයෙන් කෙළවර වන්නාහ.",
      "paliTitle": "Saññāsuttaṃ",
      "englishTitle": "The Perception Discourse",
      "sinhalaTitle": "සංඥා සූත්‍රය"
    },
    {
      "number": 17,
      "pali": "‘‘Navahi, bhikkhave, aṅgehi samannāgataṃ kulaṃ anupagantvā vā nālaṃ upagantuṃ, upagantvā vā nālaṃ nisīdituṃ. Katamehi navahi? Na manāpena paccuṭṭhenti, na manāpena abhivādenti, na manāpena āsanaṃ denti, santamassa pariguhanti, bahukampi thokaṃ denti, paṇītampi lūkhaṃ denti, asakkaccaṃ denti no sakkaccaṃ, na upanisīdanti dhammassavanāya, bhāsitamassa na sussūsanti. Imehi kho, bhikkhave, navahaṅgehi samannāgataṃ kulaṃ anupagantvā vā nālaṃ upagantuṃ upagantvā vā nālaṃ nisīdituṃ. ‘‘Navahi, bhikkhave, aṅgehi samannāgataṃ kulaṃ anupagantvā vā alaṃ upagantuṃ, upagantvā vā alaṃ nisīdituṃ. Katamehi navahi? Manāpena paccuṭṭhenti, manāpena abhivādenti, manāpena āsanaṃ denti, santamassa na pariguhanti, bahukampi bahukaṃ denti, paṇītampi paṇītaṃ denti, sakkaccaṃ denti no asakkaccaṃ, upanisīdanti dhammassavanāya, bhāsitamassa sussūsanti. Imehi kho, bhikkhave, navahaṅgehi samannāgataṃ kulaṃ anupagantvā vā alaṃ upagantuṃ, upagantvā vā alaṃ nisīditu’’nti. Sattamaṃ.",
      "english": "Bhikkhus, a family endowed with these nine factors is not fit to be approached, nor is it fit to be stayed with once approached. Which nine are these?\nThey do not greet one cordially, they do not salute one cordially, they do not offer a seat cordially, they conceal what they have from one, they give little even when there is much, they give coarse food even when there is fine food, they give disrespectfully and not respectfully, they do not sit near to listen to the Dhamma, and they do not listen attentively to what is spoken. Indeed, bhikkhus, a family endowed with these nine factors is not fit to be approached, nor is it fit to be stayed with once approached.\n\nBhikkhus, a family endowed with these nine factors is fit to be approached, and is fit to be stayed with once approached. Which nine are these?\nThey greet one cordially, they salute one cordially, they offer a seat cordially, they do not conceal what they have from one, they give much even when there is much, they give fine food even when there is fine food, they give respectfully and not disrespectfully, they sit near to listen to the Dhamma, and they listen attentively to what is spoken. Indeed, bhikkhus, a family endowed with these nine factors is fit to be approached, and is fit to be stayed with once approached.",
      "sinhala": "මහණෙනි, අංග නවයකින් සමන්විත වූ කුලයකට නොපැමිණ සිටිද්දීම පැමිණීම සුදුසු නොවේ. පැමිණ සිටි පසු එහි වැඩ සිටීම ද සුදුසු නොවේ. කවර අංග නවයකින් ද? මහණෙනි, (එවැනි කුලයක අය) සිත් සතුටින් පිළි නොගනිති. සිත් සතුටින් ආචාර නොකරති. සිත් සතුටින් ආසනයක් නොදෙති. තමන් සතු දෙයක් (භික්ෂුවගෙන්) වසං කරති. බොහෝ දේ ඇතත් ස්වල්පයක් දෙති. ප්‍රණීත වූ දේ ඇතත් රළු දේ දෙති. ගෞරවයෙන් තොරව දෙති, ගෞරවයෙන් නොවේ. ධර්ම ශ්‍රවණය සඳහා අසල හිඳ නොගනිති. (භික්ෂුව විසින්) දේශනා කරන ලද ධර්මය අවධානයෙන් ශ්‍රවණය නොකරති. මහණෙනි, මේ අංග නවයකින් සමන්විත වූ කුලයකට නොපැමිණ සිටිද්දීම පැමිණීම සුදුසු නොවේ. පැමිණ සිටි පසු එහි වැඩ සිටීම ද සුදුසු නොවේ.\n\nමහණෙනි, අංග නවයකින් සමන්විත වූ කුලයකට නොපැමිණ සිටිද්දීම පැමිණීම සුදුසුය. පැමිණ සිටි පසු එහි වැඩ සිටීම ද සුදුසුය. කවර අංග නවයකින් ද? මහණෙනි, (එවැනි කුලයක අය) සිත් සතුටින් පිළිගනිති. සිත් සතුටින් ආචාර කරති. සිත් සතුටින් ආසනයක් දෙති. තමන් සතු දෙයක් (භික්ෂුවගෙන්) වසං නොකරති. බොහෝ දේ ඇතත් බොහෝ දේ දෙති. ප්‍රණීත වූ දේ ඇතත් ප්‍රණීත වූ දේ දෙති. ගෞරවයෙන් දෙති, ගෞරවයෙන් තොරව නොවේ. ධර්ම ශ්‍රවණය සඳහා අසල හිඳගනිති. (භික්ෂුව විසින්) දේශනා කරන ලද ධර්මය අවධානයෙන් ශ්‍රවණය කරති. මහණෙනි, මේ අංග නවයකින් සමන්විත වූ කුලයකට නොපැමිණ සිටිද්දීම පැමිණීම සුදුසුය. පැමිණ සිටි පසු එහි වැඩ සිටීම ද සුදුසුය.",
      "paliTitle": "Kulasuttaṃ",
      "englishTitle": "Discourse on Family",
      "sinhalaTitle": "කුලසූත‍්‍රය"
    },
    {
      "number": 18,
      "pali": "‘‘Navahi, bhikkhave, aṅgehi samannāgato uposatho upavuttho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro. Kathaṃ upavuttho ca, bhikkhave, navahaṅgehi samannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘yāvajīvaṃ arahanto pāṇātipātaṃ pahāya pāṇātipātā paṭiviratā nihitadaṇḍā nihitasatthā lajjī dayāpannā sabbapāṇabhūtahitānukampino viharanti; ahampajja imañca rattiṃ imañca divasaṃ pāṇātipātaṃ pahāya pāṇātipātā paṭivirato nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharāmi. Imināpaṅgena [imināpi aṅgena (ka. sī.)] arahataṃ anukaromi; uposatho ca me upavuttho bhavissatī’ti. Iminā paṭhamena aṅgena samannāgato hoti…pe. …. ‘‘‘Yāvajīvaṃ arahanto uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭiviratā nīcaseyyaṃ kappenti – mañcake vā tiṇasanthārake vā; ahampajja imañca rattiṃ imañca divasaṃ uccāsayanamahāsayanaṃ pahāya uccāsayanamahāsayanā paṭivirato nīcaseyyaṃ kappemi – mañcake vā tiṇasanthārake vā. Imināpaṅgena arahataṃ anukaromi; uposatho ca me upavuttho bhavissatī’ti. Iminā aṭṭhamena aṅgena samannāgato hoti. ‘‘Mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati, tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena [abyāpajjhena (ka.), abyābajjhena (?)] pharitvā viharati. Iminā navamena aṅgena samannāgato hoti. Evaṃ upavuttho kho, bhikkhave, navahaṅgehi samannāgato uposatho mahapphalo hoti mahānisaṃso mahājutiko mahāvipphāro’’ti. Aṭṭhamaṃ.",
      "english": "Monks, the Uposatha observed, endowed with nine factors, is of great fruit, of great benefit, of great splendor, and of great pervasiveness. And how, monks, is the Uposatha observed, endowed with nine factors, of great fruit, of great benefit, of great splendor, and of great pervasiveness?\n\nHere, monks, a noble disciple reflects thus: ‘Throughout their lives, Arahants, having abandoned the taking of life, abstain from the taking of life, having laid aside rod and weapon, scrupulous, merciful, dwelling with compassion for the welfare of all living beings. Today, for this night and this day, I too, having abandoned the taking of life, abstain from the taking of life, having laid aside rod and weapon, scrupulous, merciful, dwelling with compassion for the welfare of all living beings. By this factor, I emulate the Arahants; and my Uposatha will be observed.’ By this first factor he is endowed.\n\n‘Throughout their lives, Arahants, having abandoned high and luxurious beds and seats, abstain from high and luxurious beds and seats, making their resting place low – on a bed or on a mat of straw. Today, for this night and this day, I too, having abandoned high and luxurious beds and seats, abstain from high and luxurious beds and seats, making my resting place low – on a bed or on a mat of straw. By this factor, I emulate the Arahants; and my Uposatha will be observed.’ By this eighth factor he is endowed.\n\nHe dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in all circumstances, the entire world he dwells pervading with a mind imbued with loving-kindness, vast, exalted, immeasurable, without hostility, without ill-will. By this ninth factor he is endowed.\n\nIndeed, monks, the Uposatha observed in this way, endowed with nine factors, is of great fruit, of great benefit, of great splendor, and of great pervasiveness.",
      "sinhala": "\"මහණෙනි, අංග නවයකින් යුක්ත ව සමාදන් වූ උපෝසථය මහත් ඵල ඇති, මහත් ආනිසංස ඇති, මහත් තේජස් ඇති, මහත් විහිදීමක් ඇති එකක් වෙයි. මහණෙනි, කෙසේ නම් අංග නවයකින් යුක්ත ව සමාදන් වූ උපෝසථය මහත් ඵල ඇති, මහත් ආනිසංස ඇති, මහත් තේජස් ඇති, මහත් විහිදීමක් ඇති එකක් වෙයි ද?\n\nමහණෙනි, මේ ශාසනයෙහි ආර්ය ශ්‍රාවක තෙම මෙසේ මෙනෙහි කරයි: ‘යම්තාක් කල් රහතන් වහන්සේලා ප්‍රාණඝාතය දුරු කර, ප්‍රාණඝාතයෙන් වැළකී, දඬු මුගුරු පහ කර, ආයුධ පහ කර, ලැජ්ජාශීලී ව, දයාන්විත ව, සියලු සත්වයන්ට හිතානුකම්පී ව වාසය කරත් ද; මමත් අද මේ රාත්‍රියේ සහ මේ දවසේ ප්‍රාණඝාතය දුරු කර, ප්‍රාණඝාතයෙන් වැළකී, දඬු මුගුරු පහ කර, ආයුධ පහ කර, ලැජ්ජාශීලී ව, දයාන්විත ව, සියලු සත්වයන්ට හිතානුකම්පී ව වාසය කරමි. මේ අංගයෙන් රහතන් වහන්සේලා අනුකරණය කරමි; මාගේ උපෝසථය ද සමාදන් වූයේ වෙයි.’ මෙසේ ඔහු මේ පළමුවන අංගයෙන් යුක්ත වූයේ වෙයි. (මෙසේ අනෙකුත් සීල පිළිබඳ ව ද කිව යුතුයි.)\n\n‘යම්තාක් කල් රහතන් වහන්සේලා උස් අසුන් මහ අසුන් හැර, උස් අසුන් මහ අසුන් වලින් වැළකී, යහනක් මත හෝ තණ ඇතිරිල්ලක් මත හෝ පහත් සයනයක් කරත් ද; මමත් අද මේ රාත්‍රියේ සහ මේ දවසේ උස් අසුන් මහ අසුන් හැර, උස් අසුන් මහ අසුන් වලින් වැළකී, යහනක් මත හෝ තණ ඇතිරිල්ලක් මත හෝ පහත් සයනයක් කරමි. මේ අංගයෙන් රහතන් වහන්සේලා අනුකරණය කරමි; මාගේ උපෝසථය ද සමාදන් වූයේ වෙයි.’ මෙසේ ඔහු මේ අටවන අංගයෙන් යුක්ත වූයේ වෙයි.\n\nමෛත්‍රියෙන් යුක්ත වූ සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි, එසේ ම දෙවන දිශාව ද, එසේ ම තෙවන දිශාව ද, එසේ ම සිව්වන දිශාව ද පතුරුවයි. මෙසේ උඩ, යට, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ මෛත්‍රියෙන් යුක්ත වූ සිතින් සියලු ලෝකය පතුරුවා වාසය කරයි. මෙසේ ඔහු මේ නවවන අංගයෙන් යුක්ත වූයේ වෙයි.\n\nමහණෙනි, මෙසේ අංග නවයකින් යුක්ත ව සමාදන් වූ උපෝසථය මහත් ඵල ඇති, මහත් ආනිසංස ඇති, මහත් තේජස් ඇති, මහත් විහිදීමක් ඇති එකක් වෙයි.”",
      "paliTitle": "Navaṅguposathasuttaṃ",
      "englishTitle": "The Nine-Factored Uposatha Discourse",
      "sinhalaTitle": "නවංගු පෝසථ සූත්‍\\u200dරය"
    },
    {
      "number": 19,
      "pali": "‘‘Imañca, bhikkhave, rattiṃ sambahulā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, bhikkhave, tā devatā maṃ etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha, no ca kho abhivādimha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti. ‘‘Aparāpi maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha [paccuṭṭhimha ca abhivādimha ca (syā.)], no ca tesaṃ āsanaṃ adamha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti. ‘‘Aparāpi maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha [paccuṭṭhimha ca abhivādimha ca (syā.)] āsanaṃ [āsanañca (sī. syā.)] adamha, no ca kho yathāsatti yathābalaṃ saṃvibhajimha…pe… yathāsatti yathābalaṃ [yathābalaṃ ca (?)] saṃvibhajimha, no ca kho upanisīdimha dhammassavanāya…pe… upanisīdimha [upanisīdimha ca (syā.)] dhammassavanāya, no ca kho ohitasotā dhammaṃ suṇimha…pe… ohitasotā ca dhammaṃ suṇimha, no ca kho sutvā dhammaṃ dhārayimha…pe… sutvā ca dhammaṃ dhārayimha, no ca kho dhātānaṃ dhammānaṃ atthaṃ upaparikkhimha…pe… dhātānañca dhammānaṃ atthaṃ upaparikkhimha, no ca kho atthamaññāya dhammamaññāya dhammānudhammaṃ paṭipajjimha. Tā mayaṃ, bhante, aparipuṇṇakammantā vippaṭisāriniyo paccānutāpiniyo hīnaṃ kāyaṃ upapannā’’’ti. ‘‘Aparāpi maṃ, bhikkhave, sambahulā devatā upasaṅkamitvā etadavocuṃ – ‘upasaṅkamiṃsu no, bhante, pubbe manussabhūtānaṃ pabbajitā agārāni. Te mayaṃ, bhante, paccuṭṭhimha abhivādimha [paccuṭṭhimha ca abhivādimha ca (syā.)], āsanaṃ [āsanañca (sī. syā.)] adamha, yathāsatti yathābalaṃ [yathābalaṃ ca (?)] saṃvibhajimha, upanisīdimha [upanisīdimha ca (syā.)] dhammassavanāya, ohitasotā ca dhammaṃ suṇimha, sutvā ca dhammaṃ dhārayimha, dhātānañca dhammānaṃ atthaṃ upaparikkhimha, atthamaññāya dhammamaññāya dhammānudhammaṃ [dhammānudhammañca (?)] paṭipajjimha. Tā mayaṃ, bhante, paripuṇṇakammantā avippaṭisāriniyo apaccānutāpiniyo paṇītaṃ kāyaṃ upapannā’ti. Etāni, bhikkhave, rukkhamūlāni etāni suññāgārāni. Jhāyatha, bhikkhave, mā pamādattha, mā pacchā vippaṭisārino ahuvattha seyyathāpi tā purimikā devatā’’ti. Navamaṃ.",
      "english": "And on this night, monks, when the night was far advanced, many devas of resplendent beauty illuminated the entire Jeta Grove, approached me, paid homage to me, and stood to one side. Standing to one side, monks, those devas said to me, ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them, but we did not pay homage to them. Venerable Sir, having incomplete actions, we are remorseful and regretful, and we have been reborn into a lowly state of existence.’\n\nAnother group of devas, monks, having approached me, said this to me: ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them and paid homage to them, but we did not offer them a seat. Venerable Sir, having incomplete actions, we are remorseful and regretful, and we have been reborn into a lowly state of existence.’\n\nAnother group of devas, monks, having approached me, said this to me: ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them, paid homage to them, and offered them a seat, but we did not share (our resources) according to our ability and strength. Venerable Sir, having incomplete actions, we are remorseful and regretful, and we have been reborn into a lowly state of existence.’\n\nAnother group of devas, monks, having approached me, said this to me: ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them, paid homage to them, offered them a seat, and shared (our resources) according to our ability and strength, but we did not sit down to listen to the Dhamma. Venerable Sir, having incomplete actions, we are remorseful and regretful, and we have been reborn into a lowly state of existence.’\n\nAnother group of devas, monks, having approached me, said this to me: ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them, paid homage to them, offered them a seat, shared (our resources) according to our ability and strength, and sat down to listen to the Dhamma, but we did not listen to the Dhamma with keen attention. Venerable Sir, having incomplete actions, we are remorseful and regretful, and we have been reborn into a lowly state of existence.’\n\nAnother group of devas, monks, having approached me, said this to me: ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them, paid homage to them, offered them a seat, shared (our resources) according to our ability and strength, sat down to listen to the Dhamma, and listened to the Dhamma with keen attention, but we did not retain the Dhamma after hearing it. Venerable Sir, having incomplete actions, we are remorseful and regretful, and we have been reborn into a lowly state of existence.’\n\nAnother group of devas, monks, having approached me, said this to me: ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them, paid homage to them, offered them a seat, shared (our resources) according to our ability and strength, sat down to listen to the Dhamma, listened to the Dhamma with keen attention, and retained the Dhamma after hearing it, but we did not examine the meaning of the Dhamma that had been retained. Venerable Sir, having incomplete actions, we are remorseful and regretful, and we have been reborn into a lowly state of existence.’\n\nAnother group of devas, monks, having approached me, said this to me: ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them, paid homage to them, offered them a seat, shared (our resources) according to our ability and strength, sat down to listen to the Dhamma, listened to the Dhamma with keen attention, retained the Dhamma after hearing it, and examined the meaning of the Dhamma that had been retained, but we did not practice the Dhamma in accordance with the Dhamma after understanding the meaning and understanding the Dhamma. Venerable Sir, having incomplete actions, we are remorseful and regretful, and we have been reborn into a lowly state of existence.’\n\nAnother group of devas, monks, having approached me, said this to me: ‘Venerable Sir, formerly, when we were human beings, renunciants came to our homes. Venerable Sir, we rose to greet them, paid homage to them, offered them a seat, shared (our resources) according to our ability and strength, sat down to listen to the Dhamma, listened to the Dhamma with keen attention, retained the Dhamma after hearing it, examined the meaning of the Dhamma that had been retained, and practiced the Dhamma in accordance with the Dhamma after understanding the meaning and understanding the Dhamma. Venerable Sir, having complete actions, we are not remorseful and not regretful, and we have been reborn into a sublime state of existence.’\n\n‘These, monks, are tree roots; these are empty dwellings. Meditate, monks! Do not be heedless! Do not become regretful later, as those former devas did.’",
      "sinhala": "මහණෙනි, මේ රාත්‍රියේ බොහෝ දෙවිවරු අභික්‍රාන්ත වූ රාත්‍රියක, අභික්‍රාන්ත වූ වර්ණයෙන් යුක්තව, මුළු ජේතවනාරාමයම බබළවමින් මා වෙත පැමිණියාහුය. මා වෙත එළඹ මා වන්දනා කර එකත්පසෙක සිටියාහුය. මහණෙනි, එකත්පසෙක සිටි ඒ දෙවිවරු මට මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු. එහෙත් වන්දනා නොකළෙමු. ස්වාමීනි, ඒ අපි අපරිපූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි වන්නෝ, දැඩි ලෙස කනගාටු වන්නෝ, හීන වූ ශරීරයක උපන්නෝ වෙමු.’\n\nමහණෙනි, තවත් බොහෝ දෙවිවරු මා වෙත එළඹ මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු, වන්දනා කළෙමු. එහෙත් උන්වහන්සේලාට ආසනයක් නොදුන්නෙමු. ස්වාමීනි, ඒ අපි අපරිපූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි වන්නෝ, දැඩි ලෙස කනගාටු වන්නෝ, හීන වූ ශරීරයක උපන්නෝ වෙමු.’\n\nමහණෙනි, තවත් බොහෝ දෙවිවරු මා වෙත එළඹ මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු, වන්දනා කළෙමු, ආසනයක් දුන්නෙමු, එහෙත් ශක්ති පමණින්, හැකි පමණින් දන් නොදුන්නෙමු. ස්වාමීනි, ඒ අපි අපරිපූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි වන්නෝ, දැඩි ලෙස කනගාටු වන්නෝ, හීන වූ ශරීරයක උපන්නෝ වෙමු.’\n\nමහණෙනි, තවත් බොහෝ දෙවිවරු මා වෙත එළඹ මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු, වන්දනා කළෙමු, ආසනයක් දුන්නෙමු, ශක්ති පමණින්, හැකි පමණින් දන් දුන්නෙමු, එහෙත් ධර්ම ශ්‍රවණය සඳහා අසල වාඩි නොවුණෙමු. ස්වාමීනි, ඒ අපි අපරිපූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි වන්නෝ, දැඩි ලෙස කනගාටු වන්නෝ, හීන වූ ශරීරයක උපන්නෝ වෙමු.’\n\nමහණෙනි, තවත් බොහෝ දෙවිවරු මා වෙත එළඹ මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු, වන්දනා කළෙමු, ආසනයක් දුන්නෙමු, ශක්ති පමණින්, හැකි පමණින් දන් දුන්නෙමු, ධර්ම ශ්‍රවණය සඳහා අසල වාඩි වුණෙමු, එහෙත් අවධානය යොමුකර ධර්මය නොඇසුවෙමු. ස්වාමීනි, ඒ අපි අපරිපූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි වන්නෝ, දැඩි ලෙස කනගාටු වන්නෝ, හීන වූ ශරීරයක උපන්නෝ වෙමු.’\n\nමහණෙනි, තවත් බොහෝ දෙවිවරු මා වෙත එළඹ මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු, වන්දනා කළෙමු, ආසනයක් දුන්නෙමු, ශක්ති පමණින්, හැකි පමණින් දන් දුන්නෙමු, ධර්ම ශ්‍රවණය සඳහා අසල වාඩි වුණෙමු, අවධානය යොමුකර ධර්මය ඇසුවෙමු, එහෙත් ඇසූ ධර්මය සිත්හි දරා නොගත්තෙමු. ස්වාමීනි, ඒ අපි අපරිපූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි වන්නෝ, දැඩි ලෙස කනගාටු වන්නෝ, හීන වූ ශරීරයක උපන්නෝ වෙමු.’\n\nමහණෙනි, තවත් බොහෝ දෙවිවරු මා වෙත එළඹ මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු, වන්දනා කළෙමු, ආසනයක් දුන්නෙමු, ශක්ති පමණින්, හැකි පමණින් දන් දුන්නෙමු, ධර්ම ශ්‍රවණය සඳහා අසල වාඩි වුණෙමු, අවධානය යොමුකර ධර්මය ඇසුවෙමු, ඇසූ ධර්මය සිත්හි දරා ගත්තෙමු, එහෙත් සිත්හි දරාගත් ධර්මයේ අර්ථය විමර්ශනය නොකළෙමු. ස්වාමීනි, ඒ අපි අපරිපූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි වන්නෝ, දැඩි ලෙස කනගාටු වන්නෝ, හීන වූ ශරීරයක උපන්නෝ වෙමු.’\n\nමහණෙනි, තවත් බොහෝ දෙවිවරු මා වෙත එළඹ මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු, වන්දනා කළෙමු, ආසනයක් දුන්නෙමු, ශක්ති පමණින්, හැකි පමණින් දන් දුන්නෙමු, ධර්ම ශ්‍රවණය සඳහා අසල වාඩි වුණෙමු, අවධානය යොමුකර ධර්මය ඇසුවෙමු, ඇසූ ධර්මය සිත්හි දරා ගත්තෙමු, සිත්හි දරාගත් ධර්මයේ අර්ථය විමර්ශනය කළෙමු, එහෙත් අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ නොපිහිටියෙමු. ස්වාමීනි, ඒ අපි අපරිපූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි වන්නෝ, දැඩි ලෙස කනගාටු වන්නෝ, හීන වූ ශරීරයක උපන්නෝ වෙමු.’\n\nමහණෙනි, තවත් බොහෝ දෙවිවරු මා වෙත එළඹ මෙය කීවාහුය: ‘ස්වාමීනි, පෙර මිනිස්වෙස් ගෙන සිටි අපගේ ගෙවල්වලට පැවිද්දන් වැඩියාහුය. ස්වාමීනි, අපි නැගිට සිටියෙමු, වන්දනා කළෙමු, ආසනයක් දුන්නෙමු, ශක්ති පමණින්, හැකි පමණින් දන් දුන්නෙමු, ධර්ම ශ්‍රවණය සඳහා අසල වාඩි වුණෙමු, අවධානය යොමුකර ධර්මය ඇසුවෙමු, ඇසූ ධර්මය සිත්හි දරා ගත්තෙමු, සිත්හි දරාගත් ධර්මයේ අර්ථය විමර්ශනය කළෙමු, අර්ථය අවබෝධ කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මානුධර්ම ප්‍රතිපදාවේ පිහිටියෙමු. ස්වාමීනි, ඒ අපි සම්පූර්ණ ක්‍රියා ඇතිව, පසුතැවිලි නොවනෝ, දැඩි ලෙස කනගාටු නොවනෝ, ප්‍රණීත වූ ශරීරයක උපන්නෝ වෙමු.’ මහණෙනි, මේවා රුක්මුල්ය, මේවා හිස් ගෙවල්ය. මහණෙනි, ධ්‍යාන වඩන්න. ප්‍රමාද නොවන්න. පෙර සිටි ඒ දෙවිවරුන් මෙන් පසුතැවිලි වන්නෝ නොවන්න.",
      "paliTitle": "Devatāsuttaṃ",
      "englishTitle": "The Discourse on Deities",
      "sinhalaTitle": "දේවතා සූත්‍රය"
    },
    {
      "number": 20,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Api nu te, gahapati, kule dānaṃ dīyatī’’ti? ‘‘Dīyati me, bhante, kule dānaṃ; tañca kho lūkhaṃ kaṇājakaṃ biḷaṅgadutiya’’nti. ‘‘Lūkhañcepi [lūkhaṃ vāpi (syā.), lūkhañcāpi (ka.)], gahapati, dānaṃ deti paṇītaṃ vā; tañca asakkaccaṃ deti, acittīkatvā [acittiṃ katvā (ka.), apacittiṃ katvā (syā.), acittikatvā (pī.)] deti, asahatthā deti, apaviddhaṃ [apaviṭṭhaṃ (syā.)] deti, anāgamanadiṭṭhiko deti. Yattha yattha tassa tassa dānassa vipāko nibbattati, na uḷārāya bhattabhogāya cittaṃ namati, na uḷārāya vatthabhogāya cittaṃ namati, na uḷārāya yānabhogāya cittaṃ namati, na uḷāresu pañcasu kāmaguṇesu bhogāya cittaṃ namati. Yepissa te honti puttāti vā dārāti vā dāsāti vā pessāti vā kammakarāti vā, tepi na sussūsanti na sotaṃ odahanti na aññā cittaṃ upaṭṭhapenti. Taṃ kissa hetu? Evañhetaṃ [evañcetaṃ (syā. ka.)], gahapati, hoti asakkaccaṃ katānaṃ kammānaṃ vipāko’’. ‘‘Lūkhañcepi, gahapati, dānaṃ deti paṇītaṃ vā; tañca sakkaccaṃ deti, cittīkatvā deti, sahatthā deti, anapaviddhaṃ deti, āgamanadiṭṭhiko deti. Yattha yattha tassa tassa dānassa vipāko nibbattati, uḷārāya bhattabhogāya cittaṃ namati, uḷārāya vatthabhogāya cittaṃ namati, uḷārāya yānabhogāya cittaṃ namati, uḷāresu pañcasu kāmaguṇesu bhogāya cittaṃ namati. Yepissa te honti puttāti vā dārāti vā dāsāti vā pessāti vā kammakarāti vā, tepi sussūsanti sotaṃ odahanti aññā cittaṃ upaṭṭhapenti. Taṃ kissa hetu? Evañhetaṃ, gahapati, hoti sakkaccaṃ katānaṃ kammānaṃ vipāko. ‘‘Bhūtapubbaṃ, gahapati, velāmo nāma brāhmaṇo ahosi. So evarūpaṃ dānaṃ adāsi mahādānaṃ. Caturāsīti suvaṇṇapātisahassāni adāsi rūpiyapūrāni, caturāsīti rūpiyapātisahassāni adāsi suvaṇṇapūrāni, caturāsīti kaṃsapātisahassāni adāsi hiraññapūrāni, caturāsīti hatthisahassāni adāsi sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālappaṭicchannāni [hemajālasañchannāni (sī. pī.)], caturāsīti rathasahassāni adāsi sīhacammaparivārāni byagghacammaparivārāni dīpicammaparivārāni paṇḍukambalaparivārāni sovaṇṇālaṅkārāni sovaṇṇadhajāni hemajālappaṭicchannāni, caturāsīti dhenusahassāni adāsi dukūlasandhanāni [dukūlasandassanāni (sī.), dukūlasaṇṭhanāni (syā.), dukūlasanthanāni (pī.), duhasandanāni (dī. ni. 2.263), dukūlasandanāni (tattha pāṭhantaraṃ)] kaṃsūpadhāraṇāni, caturāsīti kaññāsahassāni adāsi āmuttamaṇikuṇḍalāyo [āmukkamaṇikuṇḍalāyo (?)], caturāsīti pallaṅkasahassāni adāsi gonakatthatāni paṭikatthatāni paṭalikatthatāni kadalimigapavarapaccattharaṇāni sauttaracchadāni ubhatolohitakūpadhānāni, caturāsīti vatthakoṭisahassāni adāsi khomasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ kappāsikasukhumānaṃ, ko pana vādo annassa pānassa khajjassa bhojjassa leyyassa peyyassa, najjo maññe vissandanti [vissandati (sī. pī.)]. ‘‘Siyā kho pana te, gahapati, evamassa – ‘añño nūna tena samayena velāmo brāhmaṇo ahosi, so [yo (?)] taṃ dānaṃ adāsi mahādāna’nti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Ahaṃ tena samayena velāmo brāhmaṇo ahosiṃ. Ahaṃ taṃ dānaṃ adāsiṃ mahādānaṃ. Tasmiṃ kho pana, gahapati, dāne na koci dakkhiṇeyyo ahosi, na taṃ koci dakkhiṇaṃ visodheti. ‘‘Yaṃ, gahapati, velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ, yo cekaṃ diṭṭhisampannaṃ bhojeyya, idaṃ tato mahapphalataraṃ. ( ) [(yañca gahapati velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ) (sī. pī.)] ‘‘Yo ca sataṃ diṭṭhisampannānaṃ bhojeyya, yo cekaṃ sakadāgāmiṃ bhojeyya, idaṃ tato mahapphalataraṃ. ( ) [(yañca gahapati velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ) (sī. pī.)] ‘‘Yo ca sataṃ sakadāgāmīnaṃ bhojeyya, yo cekaṃ anāgāmiṃ bhojeyya…pe… yo ca sataṃ anāgāmīnaṃ bhojeyya, yo cekaṃ arahantaṃ bhojeyya… yo ca sataṃ arahantānaṃ bhojeyya, yo cekaṃ paccekabuddhaṃ bhojeyya … yo ca sataṃ paccekabuddhānaṃ bhojeyya, yo ca tathāgataṃ arahantaṃ sammāsambuddhaṃ bhojeyya… yo ca buddhappamukhaṃ bhikkhusaṅghaṃ bhojeyya… yo ca cātuddisaṃ saṅghaṃ uddissa vihāraṃ kārāpeyya… yo ca pasannacitto buddhañca dhammañca saṅghañca saraṇaṃ gaccheyya… yo ca pasannacitto sikkhāpadāni samādiyeyya – pāṇātipātā veramaṇiṃ, adinnādānā veramaṇiṃ, kāmesumicchācārā veramaṇiṃ, musāvādā veramaṇiṃ, surāmerayamajjapamādaṭṭhānā veramaṇiṃ, yo ca antamaso gandhohanamattampi [gandhūhanamattampi (sī.), gaddūhanamattampi (syā. pī.) ma. ni. 3.211] mettacittaṃ bhāveyya, ( ) [(yo ca accharāsaṅghātamattampi aniccasaññaṃ bhāveyya) (ka.)] idaṃ tato mahapphalataraṃ. ‘‘Yañca, gahapati, velāmo brāhmaṇo dānaṃ adāsi mahādānaṃ, yo cekaṃ diṭṭhisampannaṃ bhojeyya… yo ca sataṃ diṭṭhisampannānaṃ bhojeyya, yo cekaṃ sakadāgāmiṃ bhojeyya… yo ca sataṃ sakadāgāmīnaṃ bhojeyya, yo cekaṃ anāgāmiṃ bhojeyya… yo ca sataṃ anāgāmīnaṃ bhojeyya, yo cekaṃ arahantaṃ bhojeyya… yo ca sataṃ arahantānaṃ bhojeyya, yo cekaṃ paccekabuddhaṃ bhojeyya… yo ca sataṃ paccekabuddhānaṃ bhojeyya, yo ca tathāgataṃ arahantaṃ sammāsambuddhaṃ bhojeyya… yo ca buddhappamukhaṃ bhikkhusaṅghaṃ bhojeyya, yo ca cātuddisaṃ saṅghaṃ uddissa vihāraṃ kārāpeyya… yo ca pasannacitto buddhañca dhammañca saṅghañca saraṇaṃ gaccheyya, yo ca pasannacitto sikkhāpadāni samādiyeyya – pāṇātipātā veramaṇiṃ… surāmerayamajjapamādaṭṭhānā veramaṇiṃ, yo ca antamaso gandhohanamattampi mettacittaṃ bhāveyya, yo ca accharāsaṅghātamattampi aniccasaññaṃ bhāveyya, idaṃ tato mahapphalatara’’nti. Dasamaṃ. ",
      "english": "Once, the Fortunate One was dwelling at Savatthi, in Jeta’s Grove, Anathapindika’s monastery. Then Anathapindika, the householder, approached the Fortunate One. Having approached and paid homage to the Fortunate One, he sat down to one side. As Anathapindika the householder sat to one side, the Fortunate One said to him: “Householder, is alms-giving practiced in your household?” “Yes, Venerable Sir, alms-giving is practiced in my household, but it is coarse, broken rice with sour gruel as a second dish.”\n\n“Householder, if one gives alms, whether coarse or refined, but gives it disrespectfully, without due consideration, not with one’s own hand, as if throwing it away, and without conviction in the results of action; wherever the result of that gift manifests, one’s mind does not incline to the enjoyment of choice food, nor to the enjoyment of choice clothing, nor to the enjoyment of choice vehicles, nor to the enjoyment of the five choice strands of sensual pleasure. And those who are his children, or his wife, or his slaves, or his servants, or his workers, they do not listen to him, they do not pay attention, they do not set their minds on understanding. Why is that? Because, householder, this is the result of actions performed disrespectfully.”\n\n“But, householder, if one gives alms, whether coarse or refined, and gives it respectfully, with due consideration, with one’s own hand, not as if throwing it away, and with conviction in the results of action; wherever the result of that gift manifests, one’s mind inclines to the enjoyment of choice food, to the enjoyment of choice clothing, to the enjoyment of choice vehicles, and to the enjoyment of the five choice strands of sensual pleasure. And those who are his children, or his wife, or his slaves, or his servants, or his workers, they do listen to him, they do pay attention, they do set their minds on understanding. Why is that? Because, householder, this is the result of actions performed respectfully.”\n\n“Householder, in the past, there was a brahmin named Velama. He gave such a great offering. He gave eighty-four thousand golden bowls filled with silver, eighty-four thousand silver bowls filled with gold, eighty-four thousand bronze bowls filled with gems. He gave eighty-four thousand elephants adorned with gold, with golden banners, covered with golden nets. He gave eighty-four thousand chariots, draped with lion skins, or tiger skins, or leopard skins, or yellow woolen blankets, adorned with gold, with golden banners, covered with golden nets. He gave eighty-four thousand milch cows, with delicate silk coverings, and bronze milking pails. He gave eighty-four thousand maidens adorned with jeweled earrings. He gave eighty-four thousand couches spread with long-haired rugs, or white woolen rugs, or flowered rugs, or covered with choice antelope hides, with canopies, and red pillows at both ends. He gave eighty-four thousand bundles of fine linen cloth, fine silk cloth, fine woolen cloth, and fine cotton cloth. What need is there to speak of food, drink, edibles, savories, lickables, and sipables? Rivers, it seemed, flowed with them.”\n\n“Householder, it might occur to you: ‘Surely, at that time, there was another brahmin named Velama who gave that great offering.’ But, householder, it should not be seen that way. I, myself, was the brahmin Velama at that time. I gave that great offering. However, householder, among those who received that offering, there was no one worthy of offerings, and no one purified that offering.”\n\n“Householder, that great offering which the brahmin Velama gave, it is more fruitful to feed one person accomplished in right view than that. And to feed one Once-Returner, this is more fruitful than to feed a hundred persons accomplished in right view.”\n\nWhoever might offer food to a hundred Once-returners; or whoever might offer food to one Non-returner; or whoever might offer food to a hundred Non-returners; or whoever might offer food to one Arahant; or whoever might offer food to a hundred Arahants; or whoever might offer food to one Solitary Buddha; or whoever might offer food to a hundred Solitary Buddhas; or whoever might offer food to the Tathāgata, the Arahant, the Fully Self-Awakened One; or whoever might offer food to the assembly of monks led by the Buddha; or whoever might have a monastery built dedicated to the Saṅgha of the four directions; or whoever, with a mind full of serene confidence, might go for refuge to the Buddha, the Dhamma, and the Saṅgha; or whoever, with a mind full of serene confidence, might undertake the training rules – abstinence from taking life, abstinence from taking what is not given, abstinence from sexual misconduct, abstinence from false speech, abstinence from fermented and distilled intoxicants which are the basis of heedlessness; or whoever might develop a mind of loving-kindness even for the mere time of a finger-snap; or whoever might develop the perception of impermanence even for the mere time of a finger-snap: this latter action is more greatly fruitful than any of the former.\n\nNow, householder, as for the great offering that Velāma the brahmin gave; or whoever might offer food to one perfected in right view; or whoever might offer food to a hundred perfected in right view; or whoever might offer food to one Once-returner; or whoever might offer food to a hundred Once-returners; or whoever might offer food to one Non-returner; or whoever might offer food to a hundred Non-returners; or whoever might offer food to one Arahant; or whoever might offer food to a hundred Arahants; or whoever might offer food to one Solitary Buddha; or whoever might offer food to a hundred Solitary Buddhas; or whoever might offer food to the Tathāgata, the Arahant, the Fully Self-Awakened One; or whoever might offer food to the assembly of monks led by the Buddha; or whoever might have a monastery built dedicated to the Saṅgha of the four directions; or whoever, with a mind full of serene confidence, might go for refuge to the Buddha, the Dhamma, and the Saṅgha; or whoever, with a mind full of serene confidence, might undertake the training rules – abstinence from taking life, abstinence from taking what is not given, abstinence from sexual misconduct, abstinence from false speech, abstinence from fermented and distilled intoxicants which are the basis of heedlessness; or whoever might develop a mind of loving-kindness even for the mere time of a finger-snap; or whoever might develop the perception of impermanence even for the mere time of a finger-snap: this latter action is more greatly fruitful than any of the former.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් ආරාමයෙහි අනාථපිණ්ඩික සිටුහුගේ උයනෙහි වැඩසිටින සේක. එවිට අනාථපිණ්ඩික ගෘහපති තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩිවිය. එකත්පසෙකින් වාඩිවී සිටි අනාථපිණ්ඩික ගෘහපතිට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “ගෘහපතිය, ඔබේ කුලයේ දානයක් දෙනු ලබන්නේද?”\n\n“වහන්ස, මාගේ කුලයේ දානයක් දෙනු ලබයි; එහෙත් එය රළුය, කැඳ සහ කැඩුණු සහල් මිශ්‍ර වූ ආහාරයකි.”\n\n“ගෘහපතිය, යම් කෙනෙක් රළු වූ හෝ ප්‍රණීත වූ හෝ දානයක් දෙයිද, එය නොසැලකිල්ලෙන්, සිත පහදවා නොගෙන, තම අතින් නොදී, හෙළා දමා, (දීමෙන් යම්) ආගමනයක් (විපාකයක්) නැතැයි යන දෘෂ්ටියෙන් දෙන්නේ නම්, ඒ දානයේ විපාකය කොතැන කොතැන පහළ වුවද, උසස් වූ ආහාර භෝගයන්ට (විඳීමට) සිත නොනැමේ, උසස් වූ වස්ත්‍ර භෝගයන්ට සිත නොනැමේ, උසස් වූ යාන වාහන භෝගයන්ට සිත නොනැමේ, උසස් වූ පස්කම් ගුණ භෝගයන්ට සිත නොනැමේ. යම් පුත්‍රයෝ හෝ දාරිකාවෝ හෝ දාසයෝ හෝ පණිවිඩකරුවෝ හෝ කම්කරුවෝ හෝ ඔහුට වෙත්ද, ඔවුහුද (ඔහුට) කීකරු නොවෙති, කන් නොදෙති, දැනගැනීමට සිත නොපිහිටුවති. එය කුමන හේතුවක් නිසාද? ගෘහපතිය, නොසැලකිල්ලෙන් කරන ලද කර්මයන්ගේ විපාකය එබඳුම වේ.”\n\n“ගෘහපතිය, යම් කෙනෙක් රළු වූ හෝ ප්‍රණීත වූ හෝ දානයක් දෙයිද, එය සැලකිල්ලෙන්, සිත පහදවාගෙන, තම අතින්ම, හෙළා නොදමා, (දීමෙන් යම්) ආගමනයක් (විපාකයක්) ඇතැයි යන දෘෂ්ටියෙන් දෙන්නේ නම්, ඒ දානයේ විපාකය කොතැන කොතැන පහළ වුවද, උසස් වූ ආහාර භෝගයන්ට (විඳීමට) සිත නැමේ, උසස් වූ වස්ත්‍ර භෝගයන්ට සිත නැමේ, උසස් වූ යාන වාහන භෝගයන්ට සිත නැමේ, උසස් වූ පස්කම් ගුණ භෝගයන්ට සිත නැමේ. යම් පුත්‍රයෝ හෝ දාරිකාවෝ හෝ දාසයෝ හෝ පණිවිඩකරුවෝ හෝ කම්කරුවෝ හෝ ඔහුට වෙත්ද, ඔවුහුද (ඔහුට) කීකරු වෙති, කන් දෙති, දැනගැනීමට සිත පිහිටුවති. එය කුමන හේතුවක් නිසාද? ගෘහපතිය, සැලකිල්ලෙන් කරන ලද කර්මයන්ගේ විපාකය එබඳුම වේ.”\n\n“ගෘහපතිය, පෙර එක් කලෙක වේලාම නම් බ්‍රාහ්මණයෙක් සිටියේය. හෙතෙම එබඳු මහත් දානයක් දුන්නේය. රිදී කාසිවලින් පිර වූ රන් භාජන අසූ හතර දහසක්ද, රන් කාසිවලින් පිර වූ රිදී භාජන අසූ හතර දහසක්ද, රන්කාසිවලින් පිරවූ ලෝකඩ භාජන අසූ හතර දහසක්ද, රන් ආභරණවලින් හා රන් ධජවලින් යුක්ත වූ, රන් දැල්වලින් වැසූ ඇතින් අසූ හතර දහසක්ද දුන්නේය. සිංහ සම්වලින් ආවරණය කරන ලද, ව්‍යාඝ්‍ර සම්වලින් ආවරණය කරන ලද, දිවි සම්වලින් ආවරණය කරන ලද, කහපාට වූ කම්බිලිවලින් ආවරණය කරන ලද, රන් ආභරණවලින් හා රන් ධජවලින් යුක්ත වූ, රන් දැල්වලින් වැසූ රථ අසූ හතර දහසක්ද දුන්නේය. සේල වස්ත්‍ර අන්දා, ලෝකඩ දොවාන සහිත වූ දෙනුන් අසූ හතර දහසක්ද දුන්නේය. මැණික් කුණ්ඩලාභරණ පැළඳි කන්‍යාවන් අසූ හතර දහසක්ද, ගෝණක නම් වූ (දිගු ලොම් ඇති) එළුලොම් ඇතිරිලිද, පටි නම් වූ එළුලොම් ඇතිරිලිද, පටලි නම් වූ එළුලොම් ඇතිරිලිද, කදලි නම් වූ මුවන්ගේ සමින් කරන ලද උසස් ඇතිරිලිද, උඩුවියන් සහිත වූ, දෙපස රතු කොට්ට සහිත වූ යහන් අසූ හතර දහසක්ද දුන්නේය. ක්ෂෞම (හණ) වස්ත්‍රවලින්ද, කෝසෙය්‍ය (සිල්ක්) වස්ත්‍රවලින්ද, කම්බල (ලොම්) වස්ත්‍රවලින්ද, කපාසික (පුළුන්) වස්ත්‍රවලින්ද සියුම් වූ වස්ත්‍ර කෝටි අසූ හතර දහසක්ද දුන්නේය. අන්නපාන, ඛාද්‍ය, භෝජ්‍ය, ලෙය්‍ය, පෙය්‍ය ආදිය ගැන කුමන කතාද? ගංගා මෙන් ගලා ගිය බව මම සිතමි.”\n\n“ගෘහපතිය, ඔබට සමහරවිට මෙසේ සිතෙන්නට පුළුවන – ‘ඒ කාලයේ වේලාම බ්‍රාහ්මණයා වූයේ අන් කෙනෙක් වන්නට ඇත, ඔහු ඒ මහත් දානය දුන්නේය’ කියා. ගෘහපතිය, එය එසේ දැක්විය යුතු නොවේ. ඒ කාලයේ වේලාම බ්‍රාහ්මණයා වූයේ මමය. මම ඒ මහත් දානය දුන්නෙමි. එහෙත්, ගෘහපතිය, ඒ දානයේදී කිසිදු දක්ෂිණාර්හ පුද්ගලයෙක් සිටියේ නැත, කිසිවෙක් ඒ දක්ෂිණාව විශුද්ධ කළේ නැත.”\n\n“ගෘහපතිය, වේලාම බ්‍රාහ්මණයා දුන් ඒ මහත් දානයට වඩා, යම් කෙනෙක් එක් දෘෂ්ටි සම්පන්න (සෝවාන් මාර්ගයට පිවිසි) පුද්ගලයකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵල දායකය. යම් කෙනෙක් සියයක් දෘෂ්ටි සම්පන්න පුද්ගලයන්ට දන් දෙන්නේද, ඊට වඩා, යම් කෙනෙක් එක් සකදාගාමී පුද්ගලයකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵල දායකය.”\n\nයමෙක් සකදාගාමී පුද්ගලයන් සිය දෙනෙකුට දන් දෙන්නේද, එසේම යමෙක් එක් අනාගාමී පුද්ගලයෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් අනාගාමී පුද්ගලයන් සිය දෙනෙකුට දන් දෙන්නේද, එසේම යමෙක් එක් අරහත් පුද්ගලයෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් අරහත් පුද්ගලයන් සිය දෙනෙකුට දන් දෙන්නේද, එසේම යමෙක් එක් පසේබුදුරදුන්ට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් පසේබුදුරදුන් සිය දෙනෙකුට දන් දෙන්නේද, එසේම යමෙක් තථාගත අරහත් සම්මා සම්බුදුරදුන්ට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් බුදුරදුන් ප්‍රශ්‍රමුඛ භික්ෂු සංඝයාට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් සිව් දිශාවට වැඩ සිටින සංඝයා උදෙසා විහාරයක් කරවන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් පැහැදුණු සිතිනි බුදුන්, ධර්මය, සඟුන් සරණ යන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් පැහැදුණු සිතිනි ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමයන්හි මිසදැන හැසිරීමෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, සුරා-මේරය මත්පැන් පානයෙන් ඇතිවන ප්‍රශ්‍රමාදයට හේතුවන තැනින් වැළකීම යන ශික්‍ෂා පද සමාදන් වන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් අන්තයටම සුවඳ ගල්වන මාත්‍රයක් හෝ මෙත් සිතක් භාවනා කරන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් ඇසිපිය හෙළන මාත්‍රයක් හෝ අනිත්‍ය සංඥාව වඩන්නේද, මෙය ඒ සියල්ලටම වඩා මහත් ඵලදායී වේ.\n\nගෘහපති, වේලාම නම් බමුණා විසින් දෙන ලද මහත් දානයට වඩා, යමෙක් එක් දිට්ඨි සම්පන්න (සෝවාන්) පුද්ගලයෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් දිට්ඨි සම්පන්න (සෝවාන්) පුද්ගලයන් සිය දෙනෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් එක් සකදාගාමී පුද්ගලයෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් සකදාගාමී පුද්ගලයන් සිය දෙනෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් එක් අනාගාමී පුද්ගලයෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් අනාගාමී පුද්ගලයන් සිය දෙනෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් එක් අරහත් පුද්ගලයෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් අරහත් පුද්ගලයන් සිය දෙනෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් එක් පසේබුදුරදුන්ට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් පසේබුදුරදුන් සිය දෙනෙකුට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් තථාගත අරහත් සම්මා සම්බුදුරදුන්ට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් බුදුරදුන් ප්‍රශ්‍රමුඛ භික්ෂු සංඝයාට දන් දෙන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් සිව් දිශාවට වැඩ සිටින සංඝයා උදෙසා විහාරයක් කරවන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් පැහැදුණු සිතිනි බුදුන්, ධර්මය, සඟුන් සරණ යන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් පැහැදුණු සිතිනි ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමයන්හි මිසදැන හැසිරීමෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, සුරා-මේරය මත්පැන් පානයෙන් ඇතිවන ප්‍රශ්‍රමාදයට හේතුවන තැනින් වැළකීම යන ශික්‍ෂා පද සමාදන් වන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් අන්තයටම සුවඳ ගල්වන මාත්‍රයක් හෝ මෙත් සිතක් භාවනා කරන්නේද, මෙය ඊට වඩා මහත් ඵලදායී වේ. යමෙක් ඇසිපිය හෙළන මාත්‍රයක් හෝ අනිත්‍ය සංඥාව වඩන්නේද, මෙය ඒ සියල්ලටම වඩා මහත් ඵලදායී වේ.",
      "paliTitle": "Velāmasuttaṃ",
      "englishTitle": "Velāma Sutta",
      "sinhalaTitle": "වේලාම සූත්‍‍රය"
    }
  ],
  "footer": {
    "pali": "Sīhanādavaggo dutiyo. Tassuddānaṃ – Nādo saupādiseso ca, koṭṭhikena samiddhinā; Gaṇḍasaññā kulaṃ mettā, devatā velāmena cāti.",
    "english": "The Second Section on the Lion's Roar",
    "sinhala": "දෙවන සීහනාද වර්ගය"
  }
}