{
  "id": "an9.9",
  "title": {
    "pali": "Iddhipādavaggo",
    "english": "The Chapter on the Bases of Power",
    "sinhala": "සෘද්ධිපාද වග්ගය"
  },
  "sections": [
    {
      "number": 83,
      "pali": "‘‘Pañcimāni, bhikkhave, sikkhādubbalyāni. Katamāni pañca? Pāṇātipāto…pe… surāmerayamajjapamādaṭṭhānaṃ – imāni kho, bhikkhave, pañca sikkhādubbalyāni. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ sikkhādubbalyānaṃ pahānāya cattāro iddhipādā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi… cittasamādhi… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Imesaṃ kho, bhikkhave, pañcannaṃ sikkhādubbalyānaṃ pahānāya ime cattāro iddhipādā bhāvetabbā’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five weaknesses in training. Which five? The taking of life... up to... the indulging in fermented and distilled intoxicants which are a basis for heedlessness – these, monks, are the five weaknesses in training.\n\nIndeed, monks, for the abandoning of these five weaknesses in training, the four bases for spiritual power must be developed. Which four? Here, monks, a monk develops the basis for spiritual power, endowed with concentration born of desire and with the volitional formations of exertion; he develops the basis for spiritual power, endowed with concentration born of energy and with the volitional formations of exertion; he develops the basis for spiritual power, endowed with concentration born of mind and with the volitional formations of exertion; he develops the basis for spiritual power, endowed with concentration born of investigation and with the volitional formations of exertion. Indeed, monks, for the abandoning of these five weaknesses in training, these four bases for spiritual power must be developed. First.",
      "sinhala": "මහණෙනි, මේ සික්‍ෂා දුර්වලතා පසකි. කවරේද ඒ පස?\nප්‍රාණඝාතය, අදින්නාදානය, කාමයන්හි වරදවා හැසිරීම, මුසාවාදය, සුරාමේරය මද්‍යපානයෙන් ප්‍රමාදයට පැමිණීම යන මේවාය. මහණෙනි, මේවා පස සික්‍ෂා දුර්වලතා වෙති.\n\nමහණෙනි, මේ සික්‍ෂා දුර්වලතා පස පහකිරීම පිණිස සතර ඍද්ධිපාදයන් වඩනු ලැබිය යුතුයි. කවරේද ඒ සතර? මහණෙනි, මෙහි භික්‍ෂුව ඡන්ද සමාධි ප්‍රධාන සංඛාරයෙන් යුක්ත ඍද්ධිපාදය වඩයි. වීර්ය සමාධි ප්‍රධාන සංඛාරයෙන් යුක්ත ඍද්ධිපාදය වඩයි. චිත්ත සමාධි ප්‍රධාන සංඛාරයෙන් යුක්ත ඍද්ධිපාදය වඩයි. විමංසා සමාධි ප්‍රධාන සංඛාරයෙන් යුක්ත ඍද්ධිපාදය වඩයි. මහණෙනි, මේ සික්‍ෂා දුර්වලතා පස පහකිරීම පිණිස මේ සතර ඍද්ධිපාදයන් වඩනු ලැබිය යුතුයි.",
      "paliTitle": "Sikkhasuttaṃ"
    },
    {
      "number": 84,
      "numberRange": "84-91",
      "pali": "(Yathā satipaṭṭhānavagge tathā iddhipādavasena vitthāretabbā.)",
      "english": "It should be elaborated in detail according to the bases of spiritual power, just as it is in the section on the foundations of mindfulness.",
      "sinhala": "සතිපට්ඨාන වර්ගයෙහි දක්වා ඇති ආකාරයටම, ඉර්ධිපාද ක්‍රමයට අනුව විස්තර කළ යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 92,
      "pali": "‘‘Pañcime, bhikkhave, cetasovinibandhā. Katame pañca? Idha, bhikkhave, bhikkhu kāmesu avītarāgo hoti…pe… ime kho, bhikkhave, pañca cetasovinibandhā. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ cetasovinibandhānaṃ pahānāya ime cattāro iddhipādā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhi… cittasamādhi… vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Imesaṃ kho, bhikkhave, pañcannaṃ cetasovinibandhānaṃ pahānāya ime cattāro iddhipādā bhāvetabbā’’ti. Dasamaṃ. ",
      "english": "Monks, there are these five fetters of the mind. Which five? Here, monks, a monk is not yet free from passion for sensual pleasures... These, monks, are the five fetters of the mind.\n\nMonks, for the abandoning of these five fetters of the mind, these four bases of power are to be cultivated. Which four? Here, monks, a monk cultivates the basis of power endowed with concentration born of aspiration, along with the volitional formations of striving; he cultivates the basis of power endowed with concentration born of energy, along with the volitional formations of striving; the basis of power endowed with concentration born of mind, along with the volitional formations of striving; and the basis of power endowed with concentration born of investigation, along with the volitional formations of striving. Monks, for the abandoning of these five fetters of the mind, these four bases of power are to be cultivated.",
      "sinhala": "භික්ෂූනි, මේ පස් චේතසෝවිනිබන්‍ධයෝ වෙති. කවරහුද ඒ පස්දෙන? භික්ෂූනි, මෙහිලා භික්ෂුව කාමයන් කෙරෙහි වීතරාගී නොවූවෙක් වෙයි... භික්ෂූනි, මේවා පස් චේතසෝවිනිබන්‍ධයෝය. භික්ෂූනි, මේ පස් චේතසෝවිනිබන්‍ධයන් ප්‍රහාණය පිණිස මේ සතර ඍද්ධිපාද වැඩිය යුත්තාහ. කවරහුද ඒ සතරදෙන? භික්ෂූනි, මෙහිලා භික්ෂුව ඡන්දසමාධි ප්‍රධාන සංස්කාර සමන්නාගත ඍද්ධිපාදය වඩයි. වීර්යසමාධි ප්‍රධාන සංස්කාර සමන්නාගත ඍද්ධිපාදය වඩයි. චිත්තසමාධි ප්‍රධාන සංස්කාර සමන්නාගත ඍද්ධිපාදය වඩයි. විමංසාසමාධි ප්‍රධාන සංස්කාර සමන්නාගත ඍද්ධිපාදය වඩයි. භික්ෂූනි, මේ පස් චේතසෝවිනිබන්‍ධයන් ප්‍රහාණය පිණිස මේ සතර ඍද්ධිපාද වැඩිය යුත්තාහ.",
      "paliTitle": "Cetasovinibandhasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Iddhipādavaggo catuttho.",
    "english": "",
    "sinhala": ""
  }
}