{
  "id": "an9.7",
  "title": {
    "pali": "Satipaṭṭhānavaggo",
    "english": "The Chapter on the Foundations of Mindfulness",
    "sinhala": "සතිපට්ඨාන වර්ගය"
  },
  "sections": [
    {
      "number": 63,
      "pali": "‘‘Pañcimāni, bhikkhave, sikkhādubbalyāni. Katamāni pañca? Pāṇātipāto, adinnādānaṃ, kāmesumicchācāro, musāvādo, surāmerayamajjapamādaṭṭhānaṃ – imāni kho, bhikkhave, pañca sikkhādubbalyāni. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ sikkhādubbalyānaṃ pahānāya cattāro satipaṭṭhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, bhikkhave, pañcannaṃ sikkhādubbalyānaṃ pahānāya ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five weaknesses in training. Which five? The taking of life, the taking of what is not given, sexual misconduct, false speech, and the use of intoxicants, fermented and distilled, which are the basis for heedlessness. These, monks, are the five weaknesses in training.\n\nFor the abandoning of these five weaknesses in training, monks, the four establishments of mindfulness are to be developed. Which four? Here, monks, a monk dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, putting away covetousness and distress concerning the world; he dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, putting away covetousness and distress concerning the world; he dwells contemplating mind in mind, ardent, clearly comprehending, and mindful, putting away covetousness and distress concerning the world; he dwells contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, putting away covetousness and distress concerning the world. For the abandoning of these five weaknesses in training, monks, these four establishments of mindfulness are to be developed.",
      "sinhala": "මහණෙනි, මේවා ශික්ෂා දුබලතා පසකි. කවරේද ඒ පස? ප්‍රාණඝාතය, අදත්තාදානය, කාමයන්හි වරදවා හැසිරීම, මුසාවාදය, මත්වන සුළු රහමෙර පානයෙන් ප්‍රමාදයට පැමිණීම - මහණෙනි, මේවාමයි ඒ ශික්ෂා දුබලතා පස.\n\nමහණෙනි, මේ ශික්ෂා දුබලතා පස ප්‍රහාණය කිරීම පිණිස සතර සතිපට්ඨානයන් වඩනු ලැබිය යුතුය. කවරේද ඒ සතර? මහණෙනි, මෙහි භික්ෂුව කායෙහි, කාය අනුපස්සීව වාසය කරයි, දැඩි වීර්යයෙන් යුක්තව, මනා සිහියෙන් යුක්තව, නුවණින් යුක්තව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කරමින් වාසය කරයි; වේදනාවන්හි... සිතෙහි... ධර්මයන්හි, ධර්ම අනුපස්සීව වාසය කරයි, දැඩි වීර්යයෙන් යුක්තව, මනා සිහියෙන් යුක්තව, නුවණින් යුක්තව, ලෝකයෙහි අභිධ්‍යා හා දෝමනස්සයන් දුරු කරමින් වාසය කරයි. මහණෙනි, මේ ශික්ෂා දුබලතා පස ප්‍රහාණය කිරීම පිණිස මේ සතර සතිපට්ඨානයන් වඩනු ලැබිය යුතුය.",
      "paliTitle": "Sikkhādubbalyasuttaṃ",
      "englishTitle": "Discourse on Weakness in Training",
      "sinhalaTitle": "ශි ක‍්ෂා දු ර‍්වලකම සූත‍්‍රය"
    },
    {
      "number": 64,
      "pali": "‘‘Pañcimāni, bhikkhave, nīvaraṇāni. Katamāni pañca? Kāmacchandanīvaraṇaṃ, byāpādanīvaraṇaṃ, thinamiddhanīvaraṇaṃ, uddhaccakukkuccanīvaraṇaṃ, vicikicchānīvaraṇaṃ – imāni kho, bhikkhave, pañca nīvaraṇāni. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ nīvaraṇānaṃ pahānāya cattāro satipaṭṭhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, bhikkhave, pañcannaṃ nīvaraṇānaṃ pahānāya ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Dutiyaṃ.",
      "english": "Monks, these are the five hindrances. Which five? The hindrance of sensual desire, the hindrance of ill-will, the hindrance of sloth and torpor, the hindrance of restlessness and remorse, the hindrance of skeptical doubt – these, monks, are the five hindrances.\n\nFor the abandoning of these five hindrances, monks, the four establishments of mindfulness are to be developed. Which four? Here, monks, a bhikkhu abides contemplating the body in the body, ardent, clearly comprehending, mindful, having removed covetousness and displeasure concerning the world; he abides contemplating feelings in feelings, ardent, clearly comprehending, mindful, having removed covetousness and displeasure concerning the world; he abides contemplating the mind in the mind, ardent, clearly comprehending, mindful, having removed covetousness and displeasure concerning the world; he abides contemplating phenomena in phenomena, ardent, clearly comprehending, mindful, having removed covetousness and displeasure concerning the world. For the abandoning of these five hindrances, monks, these four establishments of mindfulness are to be developed.",
      "sinhala": "මහණෙනි, මේ නීවරණ පසකි. ඒ පස කුමක්ද? කාමච්ඡන්ද නීවරණය, ව්‍යාපාද නීවරණය, ථීනමිද්ධ නීවරණය, උද්ධච්චකුක්කුච්ච නීවරණය, විචිකිච්ඡා නීවරණයයි. මහණෙනි, මේ නීවරණ පසයි.\n\nමහණෙනි, මේ නීවරණ පස ප‍්‍රහීණ කිරීම පිණිස සතර සතිපට්ඨාන භාවනා කළ යුතුයි. ඒ සතර කුමක්ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව කයේ කය අනුපස්සනා කරමින් වාසය කරයි, වීර්යයෙන් යුක්තව, මනා අවබෝධයකින් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි ඇති දැඩි ආශාවන් සහ දොම්නස් දුරු කරමින්. වේදනාවන්හි වේදනා අනුපස්සනා කරමින් වාසය කරයි, වීර්යයෙන් යුක්තව, මනා අවබෝධයකින් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි ඇති දැඩි ආශාවන් සහ දොම්නස් දුරු කරමින්. සිතෙහි සිත අනුපස්සනා කරමින් වාසය කරයි, වීර්යයෙන් යුක්තව, මනා අවබෝධයකින් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි ඇති දැඩි ආශාවන් සහ දොම්නස් දුරු කරමින්. ධර්මයන්හි ධර්ම අනුපස්සනා කරමින් වාසය කරයි, වීර්යයෙන් යුක්තව, මනා අවබෝධයකින් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි ඇති දැඩි ආශාවන් සහ දොම්නස් දුරු කරමින්. මහණෙනි, මේ නීවරණ පස ප‍්‍රහීණ කිරීම පිණිස මේ සතර සතිපට්ඨාන භාවනා කළ යුතුයි.",
      "paliTitle": "Nīvaraṇasuttaṃ",
      "englishTitle": "Discourse on the Hindrances",
      "sinhalaTitle": "නිවරණ සූත්‍රය"
    },
    {
      "number": 65,
      "pali": "‘‘Pañcime, bhikkhave, kāmaguṇā. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Ime kho, bhikkhave, pañca kāmaguṇā. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ kāmaguṇānaṃ pahānāya…pe… ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Tatiyaṃ.",
      "english": "Monks, these five are the strands of sensual pleasure. Which five? Visible forms cognizable by the eye, which are agreeable, pleasing, charming, delightful, connected with sensual desire, and inciting passion; sounds cognizable by the ear, which are agreeable, pleasing, charming, delightful, connected with sensual desire, and inciting passion; odors cognizable by the nose, which are agreeable, pleasing, charming, delightful, connected with sensual desire, and inciting passion; tastes cognizable by the tongue, which are agreeable, pleasing, charming, delightful, connected with sensual desire, and inciting passion; and tactile objects cognizable by the body, which are agreeable, pleasing, charming, delightful, connected with sensual desire, and inciting passion. Monks, these are the five strands of sensual pleasure.\n\nFor the abandoning of these five strands of sensual pleasure, these four foundations of mindfulness are to be developed.",
      "sinhala": "භික්ෂූනි, මේ පස් ආකාර කාමගුණ යි. කවරේද ඒ පස? ඇසින් දත හැකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය ස්වරූප ඇති, කාමය හා බැඳුණු, රාගය උපදවන සුළු රූප යි. කනින් දත හැකි ශබ්ද යි. නාසයෙන් දත හැකි ගන්ධ යි. දිවෙන් දත හැකි රස යි. කයින් දත හැකි, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, ප්‍රිය ස්වරූප ඇති, කාමය හා බැඳුණු, රාගය උපදවන සුළු ස්පර්ශ යි. භික්ෂූනි, මේ පස් ආකාර කාමගුණ යි.\n\nභික්ෂූනි, මේ පස් ආකාර කාමගුණ ප්‍රහාණය කිරීම පිණිස මේ සතර සතිපට්ඨාන වැඩිය යුතු ය. තෙවැන්නයි.",
      "paliTitle": "Kāmaguṇasuttaṃ",
      "englishTitle": "Discourse on Sensual Pleasures",
      "sinhalaTitle": "කාමගුණසූත්‍රය"
    },
    {
      "number": 66,
      "pali": "‘‘Pañcime, bhikkhave, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho – ime kho, bhikkhave, pañcupādānakkhandhā. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ upādānakkhandhānaṃ pahānāya…pe… ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Catutthaṃ.",
      "english": "“Monks, there are these five aggregates of clinging. Which five? The aggregate of clinging to form, the aggregate of clinging to feeling, the aggregate of clinging to perception, the aggregate of clinging to mental formations, and the aggregate of clinging to consciousness. These, monks, are the five aggregates of clinging. For the abandoning of these five aggregates of clinging, these four foundations of mindfulness must be developed.”",
      "sinhala": "මහණෙනි, මේ උපාදානස්කන්ධයෝ පස්දෙනෙක් වෙති. ඒ පස්දෙන කවරහුද? රූප-උපාදානස්කන්ධය, වේදනා-උපාදානස්කන්ධය, සංඥා-උපාදානස්කන්ධය, සංඛාර-උපාදානස්කන්ධය, විඤ්ඤාණ-උපාදානස්කන්ධය යන මොවුන්ය. මහණෙනි, මේවා පංච-උපාදානස්කන්ධයෝ වෙති.\n\nමහණෙනි, මේ පංච-උපාදානස්කන්ධයන් ප\\u200d්‍රහාණය කිරීම පිණිසද, පිරිසිඳ දැනගැනීම පිණිසද, මුළුමනින්ම නැති කිරීම පිණිසද, මේ සතර සතිපට්ඨානයෝ වඩනු ලැබිය යුත්තාහ.",
      "paliTitle": "Upādānakkhandhasuttaṃ",
      "englishTitle": "The Discourse on the Aggregates of Clinging",
      "sinhalaTitle": "උපාදානස්කන්ධ සූත්‍රය"
    },
    {
      "number": 67,
      "pali": "‘‘Pañcimāni, bhikkhave, orambhāgiyāni saṃyojanāni. Katamāni pañca? Sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso, kāmacchando, byāpādo – imāni kho, bhikkhave, pañcorambhāgiyāni saṃyojanāni. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ pahānāya…pe… ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Pañcamaṃ.",
      "english": "Monks, there are these five lower fetters. Which five? Identity view, doubt, adherence to rites and rituals, sensual desire, and ill will. These, Monks, are the five lower fetters.\n\nFor the abandoning of these five lower fetters, Monks, these four establishments of mindfulness are to be developed.",
      "sinhala": "භික්‍ෂූනි, මේවා ඕරම්භාගීය සං‍යෝජන පහකි. ඒ කවර පහක්ද? සක්කායදිට්ඨි, විචිකිච්ඡා, සීලබ්බතපරාමාසය, කාමච්ඡන්දය, ව්‍යාපාදය – භික්‍ෂූනි, මේවා ඕරම්භාගීය සං‍යෝජන පහයි. භික්‍ෂූනි, මෙකී ඕරම්භාගීය සං‍යෝජන පහ ප්‍රහාණය කිරීම පිණිස මෙම සතර සතිපට්ඨාන වැඩිය යුතුයි.",
      "paliTitle": "Orambhāgiyasuttaṃ",
      "englishTitle": "The Discourse on Lower Fetters",
      "sinhalaTitle": "ඕරම්භාගිය සූත්‍රය"
    },
    {
      "number": 68,
      "pali": "‘‘Pañcimā, bhikkhave, gatiyo. Katamā pañca? Nirayo, tiracchānayoni, pettivisayo, manussā, devā – imā kho, bhikkhave, pañca gatiyo. ‘‘Imāsaṃ kho, bhikkhave, pañcannaṃ gatīnaṃ pahānāya…pe… ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these five destinations. Which five? Hell, the animal realm, the realm of hungry ghosts, the human realm, and the divine realms. These, monks, are the five destinations. For the abandoning of these five destinations, monks, for their complete understanding, for their utter destruction, for their relinquishing – these four foundations of mindfulness should be developed.",
      "sinhala": "මහණෙනි, මේ ගති පසකි. ඒ පස කවරේද? නිරය, තිරිසන් යෝනිය, ප්‍රේත විෂය, මනුෂ්‍යයෝ සහ දෙවියෝ යනු මේ පස් ගතියයි. මහණෙනි, මේවාමයි ඒ පස් ගතිය.\n\nමහණෙනි, මේ පස් ගතිය ප්‍රහාණය කිරීම සඳහා, මේ සතර සතිපට්ඨානයන් වඩනු ලැබිය යුතුය. සයවැන්නයි.",
      "paliTitle": "Gatisuttaṃ",
      "englishTitle": "Discourse on Destinies",
      "sinhalaTitle": "ගති සූත්‍රය"
    },
    {
      "number": 69,
      "pali": "‘‘Pañcimāni, bhikkhave, macchariyāni. Katamāni pañca? Āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ – imāni kho, bhikkhave, pañca macchariyāni. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ macchariyānaṃ pahānāya…pe… ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Sattamaṃ.",
      "english": "Monks, there are these five forms of possessiveness. Which five? Possessiveness regarding dwellings, possessiveness regarding supporters, possessiveness regarding gains, possessiveness regarding status, and possessiveness regarding the Dhamma – these, monks, are the five forms of possessiveness. For the abandonment of these five forms of possessiveness, monks, these four establishments of mindfulness should be cultivated.",
      "sinhala": "මහණෙනි, මේ මසුරුකම් පසකි. කවරේද ඒ පස? ආවාසමච්ඡරිය, කුලමච්ඡරිය, ලාභමච්ඡරිය, වර්ණමච්ඡරිය, ධම්මමච්ඡරිය යන මේවායි. මහණෙනි, මේවා මසුරුකම් පසයි.\n\nමහණෙනි, මේ මසුරුකම් පස ප්‍රහීණ කිරීම පිණිස, මේ සතර සතිපට්ඨාන භාවනා කළ යුත්තාහ.",
      "paliTitle": "Macchariyasuttaṃ",
      "englishTitle": "The Discourse on Stinginess",
      "sinhalaTitle": "මසුරුකම සූත්‍රය"
    },
    {
      "number": 70,
      "pali": "‘‘Pañcimāni, bhikkhave, uddhambhāgiyāni saṃyojanāni. Katamāni pañca? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni kho, bhikkhave, pañcuddhambhāgiyāni saṃyojanāni. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ uddhambhāgiyānaṃ saṃyojanānaṃ pahānāya…pe… ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these five higher fetters. Which five? Craving for form, craving for the formless, conceit, restlessness, and ignorance – these, monks, are the five higher fetters. For the abandonment of these five higher fetters, these four establishments of mindfulness are to be developed.",
      "sinhala": "මහණෙනි, මේ ඌර්ධ්වභාගීය සංයෝජන පහකි. ඒ පහ කවරේද? රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිද්‍යාව – මහණෙනි, මේවා නම් ඌර්ධ්වභාගීය සංයෝජන පහ වේ. මහණෙනි, මේ ඌර්ධ්වභාගීය සංයෝජන පහ ප්‍රහාණය කිරීම පිණිස...පෙ... මේ සතර සතිපට්ඨානයන් වඩනු ලැබිය යුතුය.",
      "paliTitle": "Uddhambhāgiyasuttaṃ",
      "englishTitle": "Discourse on Higher Things",
      "sinhalaTitle": "උද්ධම්භාගීය සූත්‍රය"
    },
    {
      "number": 71,
      "pali": "[a. ni. 5.205; dī. ni. 3.319; ma. ni. 1.185] ‘‘Pañcime, bhikkhave, cetokhilā [cetokhīlā (ka.)]. Katame pañca? Idha bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati. Yo so, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ paṭhamo cetokhilo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhamme kaṅkhati…pe… saṅghe kaṅkhati… sikkhāya kaṅkhati… sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto. Yo so, bhikkhave, bhikkhu sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ pañcamo cetokhilo. ‘‘Imesaṃ, kho, bhikkhave, pañcannaṃ cetokhilānaṃ pahānāya…pe… ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Navamaṃ.",
      "english": "Monks, there are these five mental barrennesses. What are these five?\n\nHere, monks, a bhikkhu is doubtful about the Teacher, wavers in perplexity, does not resolve with certainty, and does not gain clear faith. That bhikkhu, monks, who is doubtful about the Teacher, wavers in perplexity, does not resolve with certainty, and does not gain clear faith—his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving. When his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving—this is the first mental barrenness.\n\nFurthermore, monks, a bhikkhu is doubtful about the Dhamma, wavers in perplexity, does not resolve with certainty, and does not gain clear faith. That bhikkhu, monks, who is doubtful about the Dhamma, wavers in perplexity, does not resolve with certainty, and does not gain clear faith—his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving. When his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving—this is the second mental barrenness.\n\nFurthermore, monks, a bhikkhu is doubtful about the Saṅgha, wavers in perplexity, does not resolve with certainty, and does not gain clear faith. That bhikkhu, monks, who is doubtful about the Saṅgha, wavers in perplexity, does not resolve with certainty, and does not gain clear faith—his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving. When his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving—this is the third mental barrenness.\n\nFurthermore, monks, a bhikkhu is doubtful about the training, wavers in perplexity, does not resolve with certainty, and does not gain clear faith. That bhikkhu, monks, who is doubtful about the training, wavers in perplexity, does not resolve with certainty, and does not gain clear faith—his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving. When his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving—this is the fourth mental barrenness.\n\nFurthermore, monks, a bhikkhu is angry with his fellow practitioners, displeased, with a mind struck down, having allowed a mental barrenness to arise. That bhikkhu, monks, who is angry with his fellow practitioners, displeased, with a mind struck down, having allowed a mental barrenness to arise—his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving. When his mind does not incline towards ardent exertion, towards diligent application, towards persistent practice, or towards vigorous striving—this is the fifth mental barrenness.\n\nMonks, for the abandoning of these five mental barrennesses, these four establishments of mindfulness should be developed.",
      "sinhala": "‘‘මහණෙනි, මේ චිත්ත ක්‍ෂීල (සිතෙහි හටගන්නා අන්තර්ග්‍රන්ථි) පසක් ඇත. ඒ කවර පසක් ද? මහණෙනි, මෙහි භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි සැක කරයි, විමතියට පත් වේ, අධිමුක්තියට පත් නොවේ, පැහැදීමට පත් නොවේ. මහණෙනි, යම් භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි සැක කරයි, විමතියට පත් වේ, අධිමුක්තියට පත් නොවේ, පැහැදීමට පත් නොවේ ද, ඔහුගේ සිත තදින් වීර්ය කිරීම පිණිස, භාවනාවට යෙදීම පිණිස, නොකඩවා පැවැත්ම පිණිස, උත්සාහය පිණිස නොනැමේ. යමෙකුගේ සිත තදින් වීර්ය කිරීම පිණිස, භාවනාවට යෙදීම පිණිස, නොකඩවා පැවැත්ම පිණිස, උත්සාහය පිණිස නොනැමේ ද, මෙය පළමු චිත්ත ක්‍ෂීලය යි.\n\n‘‘මහණෙනි, තවද අන් කරුණක් නම්, භික්ෂුව ධර්මය කෙරෙහි සැක කරයි, විමතියට පත් වේ, අධිමුක්තියට පත් නොවේ, පැහැදීමට පත් නොවේ. සංඝයා කෙරෙහි සැක කරයි, විමතියට පත් වේ, අධිමුක්තියට පත් නොවේ, පැහැදීමට පත් නොවේ. ශික්ෂාව කෙරෙහි සැක කරයි, විමතියට පත් වේ, අධිමුක්තියට පත් නොවේ, පැහැදීමට පත් නොවේ. තවද සමබ්‍රහ්මචාරීන් කෙරෙහි කෝපයට පත් වේ, අසතුටු සිත් ඇත්තේ වේ, සිත පීඩාවට පත් වූයේ වේ, සිතෙහි ක්‍ෂීල භාවය ඇති කරගත්තේ වේ. මහණෙනි, යම් භික්ෂුවක් සමබ්‍රහ්මචාරීන් කෙරෙහි කෝපයට පත් වේ, අසතුටු සිත් ඇත්තේ වේ, සිත පීඩාවට පත් වූයේ වේ, සිතෙහි ක්‍ෂීල භාවය ඇති කරගත්තේ වේ ද, ඔහුගේ සිත තදින් වීර්ය කිරීම පිණිස, භාවනාවට යෙදීම පිණිස, නොකඩවා පැවැත්ම පිණිස, උත්සාහය පිණිස නොනැමේ. යමෙකුගේ සිත තදින් වීර්ය කිරීම පිණිස, භාවනාවට යෙදීම පිණිස, නොකඩවා පැවැත්ම පිණිස, උත්සාහය පිණිස නොනැමේ ද, මෙය පස්වන චිත්ත ක්‍ෂීලය යි.\n\n‘‘මහණෙනි, මේ පස්වැදෑරුම් චිත්ත ක්‍ෂීලයන් දුරු කිරීම, ඉක්මවා යෑම, මුලිනුපුටා දැමීම සහ යළි නොඉපදීම පිණිස, මේ සිහිනුවණ පිහිටුවාගැනීම් සතර වැඩිය යුතු ය.",
      "paliTitle": "Cetokhilasuttaṃ",
      "englishTitle": "Discourse on Mental Barrenness",
      "sinhalaTitle": "චේතෝඛිල සූත‍්‍රය"
    },
    {
      "number": 72,
      "pali": "‘‘Pañcime, bhikkhave, cetasovinibandhā [cetovinibaddhā (sāratthadīpanīṭīkā) a. ni. 5.206; dī. ni. 3.320]. Katame pañca? Idha, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Yo so, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ paṭhamo cetasovinibandho. ‘‘Puna caparaṃ, bhikkhave, bhikkhu kāye avītarāgo hoti…pe… rūpe avītarāgo hoti… yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati … aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, bhikkhave, bhikkhu aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ pañcamo cetasovinibandho. Ime kho, bhikkhave, pañca cetasovinibandhā. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ cetasovinibandhānaṃ pahānāya cattāro satipaṭṭhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ; vedanāsu…pe… citte…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Imesaṃ kho, bhikkhave, pañcannaṃ cetasovinibandhānaṃ pahānāya ime cattāro satipaṭṭhānā bhāvetabbā’’ti. Dasamaṃ. ",
      "english": "Monks, these five are bonds of the mind. Which five? Here, monks, a bhikkhu is not dispassionate towards sensual pleasures, not free from desire, not free from affection, not free from thirst, not free from agitation, not free from craving. That bhikkhu, monks, who is not dispassionate towards sensual pleasures, not free from desire, not free from affection, not free from thirst, not free from agitation, not free from craving—his mind does not incline towards ardency, towards sustained application, towards continuous effort, or towards exertion. If his mind does not incline towards ardency, sustained application, continuous effort, or exertion, this is the first bond of the mind.\n\nFurthermore, monks, a bhikkhu is not dispassionate towards the body, not free from desire, not free from affection, not free from thirst, not free from agitation, not free from craving. His mind does not incline towards ardency, towards sustained application, towards continuous effort, or towards exertion.\nSimilarly, monks, a bhikkhu is not dispassionate towards forms, not free from desire, not free from affection, not free from thirst, not free from agitation, not free from craving. His mind does not incline towards ardency, towards sustained application, towards continuous effort, or towards exertion.\nAgain, monks, a bhikkhu dwells indulging in comfortable sleeping, comfortable lying down, and comfortable slumber, having eaten to the full and stuffed himself. His mind does not incline towards ardency, towards sustained application, towards continuous effort, or towards exertion.\nAgain, monks, a bhikkhu practices the holy life with the aspiration towards a certain group of deities, thinking: ‘By this virtue, or vow, or ascetic practice, or holy life, I shall become a deity or one of the deities.’ That bhikkhu, monks, who practices the holy life with the aspiration towards a certain group of deities, thinking: ‘By this virtue, or vow, or ascetic practice, or holy life, I shall become a deity or one of the deities’—his mind does not incline towards ardency, towards sustained application, towards continuous effort, or towards exertion. If his mind does not incline towards ardency, sustained application, continuous effort, or exertion, this is the fifth bond of the mind.\nThese, monks, are the five bonds of the mind.\n\nFor the abandoning of these five bonds of the mind, monks, the four foundations of mindfulness are to be developed. Which four? Here, monks, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world; dwells contemplating feelings in feelings, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world; dwells contemplating the mind in the mind, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world; dwells contemplating phenomena in phenomena, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. For the abandoning of these five bonds of the mind, monks, these four foundations of mindfulness are to be developed.",
      "sinhala": "මහණෙනි, මේ චිත්ත බන්ධන (සිත බැඳ තබන දේවල්) පහකි. ඒ පහ කවරේද? මහණෙනි, මෙහිලා භික්‍ෂුවක් කාම වස්තූන් කෙරෙහි රාගයෙන් තොර නොවූ, කැමැත්ත දුරු නොකළ, ආලය දුරු නොකළ, පිපාසාවෙන් මිදුණේ නැති, දැවිල්ලෙන් මිදුණේ නැති, තෘෂ්ණාවෙන් මිදුණේ නැති කෙනෙක් වේ. මහණෙනි, යම් භික්‍ෂුවක් කාම වස්තූන් කෙරෙහි රාගයෙන් තොර නොවූ, කැමැත්ත දුරු නොකළ, ආලය දුරු නොකළ, පිපාසාවෙන් මිදුණේ නැති, දැවිල්ලෙන් මිදුණේ නැති, තෘෂ්ණාවෙන් මිදුණේ නැති කෙනෙක් වේද, ඔහුගේ සිත (කෙලෙස්) තැවීම පිණිස, නිරන්තරයෙන් යෙදීම පිණිස, නොකඩවා පැවැත්වීම පිණිස, උත්සාහය පිණිස නොනැමේ. යම් කෙනෙකුගේ සිත තැවීම පිණිස, නිරන්තරයෙන් යෙදීම පිණිස, නොකඩවා පැවැත්වීම පිණිස, උත්සාහය පිණිස නොනැමේද, මෙය පළමුවන චිත්ත බන්ධනයයි.\n\nතවද මහණෙනි, භික්‍ෂුවක් ශරීරය කෙරෙහි රාගයෙන් තොර නොවූ, කැමැත්ත දුරු නොකළ, ආලය දුරු නොකළ, පිපාසාවෙන් මිදුණේ නැති, දැවිල්ලෙන් මිදුණේ නැති, තෘෂ්ණාවෙන් මිදුණේ නැති කෙනෙක් වේ. (එමෙන්ම) රූප කෙරෙහි රාගයෙන් තොර නොවූ, කැමැත්ත දුරු නොකළ, ආලය දුරු නොකළ, පිපාසාවෙන් මිදුණේ නැති, දැවිල්ලෙන් මිදුණේ නැති, තෘෂ්ණාවෙන් මිදුණේ නැති කෙනෙක් වේ. තවද භික්‍ෂුවක් බඩ පැලෙන තුරු අනුභව කොට නිදාගැනීමේ සැපය, ඇලපැතිර සිටීමේ සැපය, නිදිමතෙහි සැපයෙහි යෙදී වාසය කරයි. තවද භික්‍ෂුවක් ‘මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ මේ බ්‍රහ්මචාරී ජීවිතයෙන් හෝ මම දෙවියෙක් වන්නෙමි, නැතහොත් දෙවියන් අතරින් එක් කෙනෙක් වන්නෙමි’ යනුවෙන් යම්කිසි දෙව්ලොවක් පතාගෙන බඹසර හැසිරෙයි. මහණෙනි, යම් භික්‍ෂුවක් ‘මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ මේ බ්‍රහ්මචාරී ජීවිතයෙන් හෝ මම දෙවියෙක් වන්නෙමි, නැතහොත් දෙවියන් අතරින් එක් කෙනෙක් වන්නෙමි’ යනුවෙන් යම්කිසි දෙව්ලොවක් පතාගෙන බඹසර හැසිරේද, ඔහුගේ සිත තැවීම පිණිස, නිරන්තරයෙන් යෙදීම පිණිස, නොකඩවා පැවැත්වීම පිණිස, උත්සාහය පිණිස නොනැමේ. යම් කෙනෙකුගේ සිත තැවීම පිණිස, නිරන්තරයෙන් යෙදීම පිණිස, නොකඩවා පැවැත්වීම පිණිස, උත්සාහය පිණිස නොනැමේද, මෙය පස්වන චිත්ත බන්ධනයයි. මහණෙනි, මේවා පස් චිත්ත බන්ධනයෝය.\n\nමහණෙනි, මේ පස් චිත්ත බන්ධන දුරු කිරීම පිණිස සතර සතිපට්ඨානයන් වඩනු ලැබිය යුත්තාහ. ඒ සතර කවරේද? මහණෙනි, මෙහිලා භික්‍ෂුවක් ලෝකයෙහි දැඩි ලෝභය හා දොම්නස දුරු කොට, කයෙහි කය අනුව දකිමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, මනා සිහියෙන්, මනා නුවණින් යුක්තව වාසය කරයි. (එමෙන්ම) වේදනා කෙරෙහි වේදනා අනුව දකිමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයෙහි දැඩි ලෝභය හා දොම්නස දුරු කොට වාසය කරයි. (එමෙන්ම) සිත කෙරෙහි සිත අනුව දකිමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයෙහි දැඩි ලෝභය හා දොම්නස දුරු කොට වාසය කරයි. (එමෙන්ම) ධර්මයන් කෙරෙහි ධර්ම අනුව දකිමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, මනා සිහියෙන්, මනා නුවණින් යුක්තව, ලෝකයෙහි දැඩි ලෝභය හා දොම්නස දුරු කොට වාසය කරයි. මහණෙනි, මේ පස් චිත්ත බන්ධන දුරු කිරීම පිණිස මේ සතර සතිපට්ඨානයන් වඩනු ලැබිය යුත්තාහ.",
      "paliTitle": "Cetasovinibandhasuttaṃ",
      "englishTitle": "Discourse on Mental Fetters",
      "sinhalaTitle": "චේතසෝවිනිබන්‍ධ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Satipaṭṭhānavaggo dutiyo. Tassuddānaṃ – Sikkhā nīvaraṇākāmā, khandhā ca orambhāgiyā gati; Maccheraṃ uddhambhāgiyā aṭṭhamaṃ, cetokhilā vinibandhāti.",
    "english": "The Second Satipaṭṭhāna Section",
    "sinhala": "දෙවෙනි සතිපට‍්ඨාන වග්ගය"
  }
}