{
  "id": "an9.8",
  "title": {
    "pali": "Sammappadhānavaggo",
    "english": "The Chapter on Right Exertions",
    "sinhala": "සම්මාපධාන වග්ගය"
  },
  "sections": [
    {
      "number": 73,
      "pali": "‘‘Pañcimāni, bhikkhave, sikkhādubbalyāni. Katamāni pañca? Pāṇātipāto …pe… surāmerayamajjapamādaṭṭhānaṃ – imāni kho, bhikkhave, pañca sikkhādubbalyāni. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ sikkhādubbalyānaṃ pahānāya cattāro sammappadhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Imesaṃ kho, bhikkhave, pañcannaṃ sikkhādubbalyānaṃ pahānāya ime cattāro sammappadhānā bhāvetabbā’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these five weaknesses in training. Which five? Taking life, taking what is not given, sexual misconduct, false speech, and the consumption of intoxicants which leads to heedlessness – these, monks, are the five weaknesses in training.\n\nFor the abandoning of these five weaknesses in training, monks, the four right exertions should be developed. Which four?\n\nHere, monks, a monk generates the will, endeavors, arouses energy, takes hold of his mind, and exerts himself for the non-arising of unarisen evil, unwholesome states; he generates the will, endeavors, arouses energy, takes hold of his mind, and exerts himself for the abandoning of arisen evil, unwholesome states; he generates the will, endeavors, arouses energy, takes hold of his mind, and exerts himself for the arising of unarisen wholesome states; he generates the will, endeavors, arouses energy, takes hold of his mind, and exerts himself for the maintenance, non-disappearance, increase, abundance, development, and perfection of arisen wholesome states.\n\nFor the abandoning of these five weaknesses in training, monks, these four right exertions should be developed.",
      "sinhala": "භික්ෂූනි, මේවා සිකපද දුර්වලතා පහකි. කවරේද ඒ පහ? ප්‍රාණඝාතය, අදත්තාදානය, කාමමිථ්‍යාචාරය, මුසාවාදය සහ සුරාමේරය මද්‍යප්‍රමාදස්ථානය යි. භික්ෂූනි, මේවා සිකපද දුර්වලතා පහයි.\n\nභික්ෂූනි, මේ සිකපද දුර්වලතා පහ ප්‍රහාණය කිරීම පිණිස සතර සම්‍යක්ප්‍රධානයෝ වැඩිය යුතු ය. කවරේද ඒ සතර?\n\nභික්ෂූනි, මෙහි භික්ෂුව නූපන් අකුසල ධර්මයන් නූපදවීම පිණිස කැමැත්ත උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩිව ගනියි, වෙහෙසෙයි. උපන් අකුසල ධර්මයන් ප්‍රහාණය කිරීම පිණිස කැමැත්ත උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩිව ගනියි, වෙහෙසෙයි. නූපන් කුසල ධර්මයන් උපදවා ගැනීම පිණිස කැමැත්ත උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩිව ගනියි, වෙහෙසෙයි. උපන් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, නොනැසී පැවැත්ම පිණිස, තව තවත් වැඩි දියුණුව පිණිස, විපුල බව පිණිස, වැඩීම පිණිස, පිරිපුන් බව පිණිස කැමැත්ත උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩිව ගනියි, වෙහෙසෙයි.\n\nභික්ෂූනි, මේ සිකපද දුර්වලතා පහ ප්‍රහාණය කිරීම පිණිස මේ සතර සම්‍යක්ප්‍රධානයෝ වැඩිය යුතු ය.",
      "paliTitle": "Sikkhasuttaṃ",
      "englishTitle": "The Training Discourse",
      "sinhalaTitle": "සික්ඛා සූත්‍රය"
    },
    {
      "number": 74,
      "pali": "(Yathā satipaṭṭhānavagge tathā sammappadhānavasena vitthāretabbā.)",
      "english": "It should be elaborated by way of the right strivings, just as it was in the section on the foundations of mindfulness.",
      "sinhala": "සතිපට්ඨාන වර්ගයෙහි මෙන් ම සම්මාප්‍රධාන වශයෙන් ද විස්තර කළ යුත්තේය.",
      "paliTitle": ""
    },
    {
      "number": 82,
      "pali": "‘‘Pañcime, bhikkhave, cetasovinibandhā. Katame pañca? Idha, bhikkhave, bhikkhu kāmesu avītarāgo hoti…pe… ime kho, bhikkhave, pañca cetasovinibandhā. ‘‘Imesaṃ kho, bhikkhave, pañcannaṃ cetasovinibandhānaṃ pahānāya cattāro sammappadhānā bhāvetabbā. Katame cattāro? Idha, bhikkhave, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati; uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya… anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya… uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Imesaṃ kho, bhikkhave, pañcannaṃ cetasovinibandhānaṃ pahānāya ime cattāro sammappadhānā bhāvetabbā’’ti. Dasamaṃ. ",
      "english": "Monks, there are these five fetters of the mind. Which five? Here, monks, a monk is not dispassionate towards sensual pleasures, and so forth; monks, these are the five fetters of the mind.\n\nMonks, for the abandoning of these five fetters of the mind, the four right exertions are to be developed. Which four? Here, monks, a monk generates desire, endeavors, arouses energy, exerts the mind, and strives for the non-arising of unarisen evil unwholesome states; for the abandoning of arisen evil unwholesome states; for the arising of unarisen wholesome states; and for the continuance, non-confusion, increase, abundance, development, and perfection of arisen wholesome states, he generates desire, endeavors, arouses energy, exerts the mind, and strives. Monks, for the abandoning of these five fetters of the mind, these four right exertions are to be developed.",
      "sinhala": "‘‘භික්ෂූනි, මේ සිත වළක්වන බැඳීම් පහකි. කවරේද ඒ පහ? භික්ෂූනි, මෙහිලා භික්ෂුව කාමයන් කෙරෙහි වීතරාගී නොවී සිටියි. භික්ෂූනි, මේවා සිත වළක්වන බැඳීම් පසයි.\n\nභික්ෂූනි, මේ සිත වළක්වන බැඳීම් පස ප්‍රහාණය කිරීම පිණිස සතර සම්‍යක් ප්‍රධන් ව්‍යායාමයන් වඩනු ලැබිය යුතුය. කවරේද ඒ සතර? භික්ෂූනි, මෙහිලා භික්ෂුව නූපන් පව් අකුසල් ධර්මයන් නූපදවීම පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩිව ගනියි, උත්සාහ කරයි; උපන් පව් අකුසල් ධර්මයන් ප්‍රහාණය කිරීම පිණිස; නූපන් කුසල් ධර්මයන් ඉපදවීම පිණිස; උපන් කුසල් ධර්මයන් පවතිනු පිණිස, අභාවයට නොයනු පිණිස, වැඩි දියුණු වීම පිණිස, විපුල බවට පත්වීම පිණිස, භාවනාව පිණිස, පාරිපූර්ණත්වය පිණිස ඡන්දය උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත දැඩිව ගනියි, උත්සාහ කරයි. භික්ෂූනි, මේ සිත වළක්වන බැඳීම් පස ප්‍රහාණය කිරීම පිණිස මේ සතර සම්‍යක් ප්‍රධන් ව්‍යායාමයන් වඩනු ලැබිය යුතුය.’’",
      "paliTitle": "Cetasovinibandhasuttaṃ",
      "englishTitle": "Discourse on Mental Bondage",
      "sinhalaTitle": "චේතෝවිනිබන්ධ සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Sammappadhānavaggo tatiyo.",
    "english": "The Third Chapter on Right Exertions.",
    "sinhala": "තෙවැනි සම්මාපධාන වර්ගය"
  }
}