{
  "id": "an6.13",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The Series Concerning Lust",
    "sinhala": "රාගය පිළිබඳ පුළුල් විස්තරය"
  },
  "sections": [
    {
      "number": 140,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya cha dhammā bhāvetabbā. Katame cha? Dassanānuttariyaṃ, savanānuttariyaṃ, lābhānuttariyaṃ, sikkhānuttariyaṃ, pāricariyānuttariyaṃ, anussatānuttariyaṃ. Rāgassa, bhikkhave, abhiññāya ime cha dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the complete understanding of passion, six qualities should be developed. Which six? Supreme vision, supreme hearing, supreme gain, supreme training, supreme service, and supreme recollection. Monks, for the complete understanding of passion, these six qualities should be developed.",
      "sinhala": "මහණෙනි, රාගය අවබෝධ කිරීම පිණිස ධර්ම සයක් වැඩිය යුතුය. ඒ සය කිමෙක්ද? උතුම් වූ දර්ශනය, උතුම් වූ ශ්‍රවණය, උතුම් වූ ලාභය, උතුම් වූ ශික්ෂාව, උතුම් වූ උපස්ථානය, උතුම් වූ අනුස්සතිය යන මේවාය. මහණෙනි, රාගය අවබෝධ කිරීම පිණිස මේ ධර්ම සය වැඩිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 141,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya cha dhammā bhāvetabbā. Katame cha? Buddhānussati, dhammānussati, saṅghānussati, sīlānussati, cāgānussati, devatānussati. Rāgassa, bhikkhave, abhiññāya ime cha dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct knowledge of passion, six qualities should be cultivated. Which six? The recollection of the Buddha, the recollection of the Dhamma, the recollection of the Saṅgha, the recollection of one's own virtue, the recollection of one's own generosity, and the recollection of the devas. Monks, for the direct knowledge of passion, these six qualities should be cultivated.",
      "sinhala": "භික්ෂූනි, රාගය ප්‍රහාණය කිරීම පිණිස ධර්ම සයක් වැඩිය යුතුය. ඒ ධර්ම සය කවරේද? බුද්ධානුස්සතිය, ධම්මානුස්සතිය, සංඝානුස්සතිය, සීලානුස්සතිය, චාගානුස්සතිය, දේවතානුස්සතියයි. භික්ෂූනි, රාගය ප්‍රහාණය කිරීම පිණිස මේ ධර්ම සය වැඩිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 142,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya cha dhammā bhāvetabbā. Katame cha? Aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā, nirodhasaññā. Rāgassa, bhikkhave, abhiññāya ime cha dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct knowledge of lust, six qualities are to be developed. Which six? The perception of impermanence, the perception of suffering in what is impermanent, the perception of non-self in what is suffering, the perception of abandoning, the perception of dispassion, and the perception of cessation. Monks, for the direct knowledge of lust, these six qualities are to be developed.",
      "sinhala": "මහණෙනි, රාගය මුළුමනින් අවබෝධ කර ගැනීම පිණිස ධර්ම සයක් වඩනු ලැබිය යුතුය. ඒ සය කවරේද? අනිත්‍ය සංඥාව, අනිත්‍යයෙහි දුක්ඛ සංඥාව, දුක්ඛයෙහි අනාත්ම සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව, නිරෝධ සංඥාවයි. මහණෙනි, රාගය මුළුමනින් අවබෝධ කර ගැනීම පිණිස මේ ධර්ම සය වඩනු ලැබිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 143,
      "numberRange": "143-169",
      "pali": "‘‘Rāgassa, bhikkhave, pariññāya…pe… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya cha dhammā bhāvetabbā’’.",
      "english": "Monks, for the full comprehension of attachment, for its utter destruction, for its abandonment, for its attenuation, for its fading away, for its dispassion, for its cessation, for its relinquishment, and for its complete letting go – six qualities are to be developed.",
      "sinhala": "මහණෙනි, රාගයෙහි පිරිඥාව පිණිස ද, පිරික්ෂය පිණිස ද, ප්‍ර‍හාණය පිණිස ද, ක්‍ෂය පිණිස ද, විය වීම පිණිස ද, විරාගය පිණිස ද, නිරෝධය පිණිස ද, චාගය පිණිස ද, ප්‍ර‍තිනිස්සර්ගය පිණිස ද, ධර‍්ම හයක් වැඩිය යුතු යි.",
      "paliTitle": ""
    },
    {
      "number": 170,
      "numberRange": "170-649",
      "pali": "‘‘Dosassa…pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa abhiññāya…pe… pariññāya… parikkhayāya… pahanāya… khayāya… vayāya… virāgāya… nirodhāya… cāgāya… paṭinissaggāya ime cha dhammā bhāvetabbā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. ",
      "english": "For the direct knowledge, complete understanding, utter destruction, abandonment, perishing, fading away, dispassion, cessation, relinquishment, and complete giving up of hatred, delusion, anger, resentment, disparagement, malignity, envy, avarice, hypocrisy, fraud, obstinacy, presumption, conceit, arrogance, intoxication, and heedlessness, these six qualities are to be developed.\n\nThe Blessed One said this. Those monks, delighted, rejoiced in the Blessed One’s words.",
      "sinhala": "ද්වේෂයේ, මෝහයේ, ක්‍රෝධයේ, උපනාහයේ, මක්ඛයේ, පළාසයේ, ඊර්ෂ්‍යාවේ, මාත්සර්යයේ, මායාවේ, සාඨෙය්‍යයේ, ථම්භයේ, සාරම්භයේ, මානයේ, අතිමානයේ, මදයේ, ප්‍රමාදයේ යන මේ ධර්මයන් අභිඥාපනය පිණිස, පරිඥාපනය පිණිස, පරික්ෂය පිණිස, ප්‍රහාණය පිණිස, ක්ෂය පිණිස, ව්‍යය පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, ත්‍යාගය පිණිස, ප්‍රතිනිස්සර්ගය පිණිස මේ ධර්ම හය භාවනා කළ යුත්තේය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ඒ භික්ෂූහු සතුටු සිත් ඇතිව භාග්‍යවතුන් වහන්සේගේ දෙසුම අභිනන්දනය කළහ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ. ",
    "english": "",
    "sinhala": ""
  }
}