{
  "id": "an6.7",
  "title": {
    "pali": "Devatāvaggo",
    "english": "The Chapter on Deities",
    "sinhala": "දේවතා වර්ගය"
  },
  "sections": [
    {
      "number": 65,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo anāgāmiphalaṃ sacchikātuṃ. Katame cha? Assaddhiyaṃ, ahirikaṃ, anottappaṃ, kosajjaṃ, muṭṭhassaccaṃ, duppaññataṃ – ime kho, bhikkhave, cha dhamme appahāya abhabbo anāgāmiphalaṃ sacchikātuṃ. ‘‘Cha, bhikkhave, dhamme pahāya bhabbo anāgāmiphalaṃ sacchikātuṃ. Katame cha? Assaddhiyaṃ, ahirikaṃ, anottappaṃ, kosajjaṃ, muṭṭhassaccaṃ, duppaññataṃ – ime kho, bhikkhave, cha dhamme pahāya bhabbo anāgāmiphalaṃ sacchikātu’’nti. Paṭhamaṃ.",
      "english": "Monks, by not abandoning six qualities, one is incapable of realizing the fruit of non-returning. Which six? Lack of faith, shamelessness, lack of moral dread, idleness, unmindfulness, and foolishness – indeed, monks, by not abandoning these six qualities, one is incapable of realizing the fruit of non-returning.\n\nMonks, by abandoning six qualities, one is capable of realizing the fruit of non-returning. Which six? Lack of faith, shamelessness, lack of moral dread, idleness, unmindfulness, and foolishness – indeed, monks, by abandoning these six qualities, one is capable of realizing the fruit of non-returning.",
      "sinhala": "භික්ෂූණි, ධර්ම සයක් ප්‍රහාණය නොකර අනාගාමී ඵලය සාක්ෂාත් කිරීමට නොහැකි වෙයි. ඒ සය කවරේද? අශ්‍රද්ධාව, අහිරිකය, අනෝතප්පය, කෝසජ්ජය, මුට්ඨස්සත්‍යය, දුෂ්ප්‍රඥතාවයි. භික්ෂූණි, මේ ධර්ම සය ප්‍රහාණය නොකර අනාගාමී ඵලය සාක්ෂාත් කිරීමට නොහැකි වෙයි.\n\nභික්ෂූණි, ධර්ම සයක් ප්‍රහාණය කිරීමෙන් අනාගාමී ඵලය සාක්ෂාත් කිරීමට හැකි වෙයි. ඒ සය කවරේද? අශ්‍රද්ධාව, අහිරිකය, අනෝතප්පය, කෝසජ්ජය, මුට්ඨස්සත්‍යය, දුෂ්ප්‍රඥතාවයි. භික්ෂූණි, මේ ධර්ම සය ප්‍රහාණය කිරීමෙන් අනාගාමී ඵලය සාක්ෂාත් කිරීමට හැකි වෙයි.",
      "paliTitle": "Anāgāmiphalasuttaṃ",
      "englishTitle": "Discourse on the Anāgāmi Attainment",
      "sinhalaTitle": "අනාගාමීඵල සූත්‍රය"
    },
    {
      "number": 66,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. Katame cha? Thinaṃ [thīnaṃ (sī. syā. kaṃ. pī.)], middhaṃ, uddhaccaṃ, kukkuccaṃ, assaddhiyaṃ, pamādaṃ – ime kho, bhikkhave, cha dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. ‘‘Cha, bhikkhave, dhamme pahāya bhabbo arahattaṃ sacchikātuṃ. Katame cha? Thinaṃ, middhaṃ, uddhaccaṃ, kukkuccaṃ, assaddhiyaṃ, pamādaṃ – ime kho, bhikkhave, cha dhamme pahāya bhabbo arahattaṃ sacchikātu’’nti. Dutiyaṃ.",
      "english": "Monks, without abandoning six qualities, one is incapable of realizing Arahantship. Which six? Sloth, torpor, restlessness, remorse, lack of faith, and heedlessness – Monks, without abandoning these six qualities, one is incapable of realizing Arahantship.\n\nMonks, having abandoned six qualities, one is capable of realizing Arahantship. Which six? Sloth, torpor, restlessness, remorse, lack of faith, and heedlessness – Monks, having abandoned these six qualities, one is capable of realizing Arahantship.",
      "sinhala": "මහණෙනි, ධර්ම සයක් ප්‍රහාණය නොකර රහත්භාවය අවබෝධ කිරීමට නොහැක. ඒ කවර සයක්ද? තීණ, මිද්ධ, උද්ධච්ච, කුක්කුච්ච, අස්සද්ධිය, ප්‍රමාද යන මේ සයයි. මහණෙනි, මේ ධර්ම සය ප්‍රහාණය නොකර රහත්භාවය අවබෝධ කිරීමට නොහැක.\n\nමහණෙනි, ධර්ම සයක් ප්‍රහාණය කිරීමෙන් රහත්භාවය අවබෝධ කිරීමට හැකි වෙයි. ඒ කවර සයක්ද? තීණ, මිද්ධ, උද්ධච්ච, කුක්කුච්ච, අස්සද්ධිය, ප්‍රමාද යන මේ සයයි. මහණෙනි, මේ ධර්ම සය ප්‍රහාණය කිරීමෙන් රහත්භාවය අවබෝධ කිරීමට හැකි වෙයි.",
      "paliTitle": "Arahattasuttaṃ",
      "englishTitle": "Discourse on Arahantship",
      "sinhalaTitle": "අරහත් සූත‍්‍රය"
    },
    {
      "number": 67,
      "pali": "‘‘‘So vata, bhikkhave, bhikkhu pāpamitto pāpasahāyo pāpasampavaṅko, pāpamitte [pāpake mitte (ka.)] sevamāno bhajamāno payirupāsamāno, tesañca diṭṭhānugatiṃ āpajjamāno ābhisamācārikaṃ dhammaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Ābhisamācārikaṃ dhammaṃ aparipūretvā sekhaṃ dhammaṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sekhaṃ dhammaṃ aparipūretvā sīlāni paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sīlāni aparipūretvā kāmarāgaṃ vā rūparāgaṃ vā arūparāgaṃ vā pajahissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘‘So vata, bhikkhave, bhikkhu kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko, kalyāṇamitte sevamāno bhajamāno payirupāsamāno, tesañca diṭṭhānugatiṃ āpajjamāno ābhisamācārikaṃ dhammaṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Ābhisamācārikaṃ dhammaṃ paripūretvā sekhaṃ dhammaṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Sekhaṃ dhammaṃ paripūretvā sīlāni paripūressatī’ti ṭhānametaṃ vijjati. ‘Sīlāni paripūretvā kāmarāgaṃ vā rūparāgaṃ vā arūparāgaṃ vā pajahissatī’ti ṭhānametaṃ vijjatī’’ti. Tatiyaṃ.",
      "english": "Indeed, monks, it is not possible that a bhikkhu who has evil friends, evil companions, and evil associations; who associates with, spends time with, and attends upon such evil companions; and who follows their views and conduct, will perfect the fundamental training in proper conduct. It is not possible that without perfecting the fundamental training in proper conduct, one will perfect the training of a trainee. It is not possible that without perfecting the training of a trainee, one will perfect moral precepts. It is not possible that without perfecting moral precepts, one will abandon sensual craving, craving for form existence, or craving for formless existence.\n\nIndeed, monks, it is possible that a bhikkhu who has admirable friends, admirable companions, and admirable associations; who associates with, spends time with, and attends upon such admirable companions; and who follows their views and conduct, will perfect the fundamental training in proper conduct. It is possible that having perfected the fundamental training in proper conduct, one will perfect the training of a trainee. It is possible that having perfected the training of a trainee, one will perfect moral precepts. It is possible that having perfected moral precepts, one will abandon sensual craving, craving for form existence, or craving for formless existence.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් පවිටු මිතුරන් ඇති, පවිටු සගයන් ඇති, පවිටු ඇසුරට බැසගත් අයෙක් නම්, පවිටු මිතුරන් සේවනය කරමින්, භජනය කරමින්, ඇසුරු කරමින්, ඔවුන්ගේ දෘෂ්ටීන් හා හැසිරීම් අනුගමනය කරමින්, ආභිසමාචාරික ධර්‍මය සම්පූර්‍ණ කරනු ඇතැයි කීම, කිසිසේත් විය නොහැක්කකි. ආභිසමාචාරික ධර්‍මය සම්පූර්‍ණ නොකර ශෛක්ෂ ධර්‍මය සම්පූර්‍ණ කරනු ඇතැයි කීම, කිසිසේත් විය නොහැක්කකි. ශෛක්ෂ ධර්‍මය සම්පූර්‍ණ නොකර සීලයන් සම්පූර්‍ණ කරනු ඇතැයි කීම, කිසිසේත් විය නොහැක්කකි. සීලයන් සම්පූර්‍ණ නොකර, කාමරාගය හෝ රූපරාගය හෝ අරූපරාගය පහකරනු ඇතැයි කීම, කිසිසේත් විය නොහැක්කකි.\n\nමහණෙනි, යම් භික්ෂුවක් කල්‍ය‌ාණ මිතුරන් ඇති, කල්‍ය‌ාණ සගයන් ඇති, කල්‍ය‌ාණ ඇසුරට බැසගත් අයෙක් නම්, කල්‍ය‌ාණ මිතුරන් සේවනය කරමින්, භජනය කරමින්, ඇසුරු කරමින්, ඔවුන්ගේ දෘෂ්ටීන් හා හැසිරීම් අනුගමනය කරමින්, ආභිසමාචාරික ධර්‍මය සම්පූර්‍ණ කරනු ඇතැයි කීම, සිදුවිය හැක්කකි. ආභිසමාචාරික ධර්‍මය සම්පූර්‍ණ කර, ශෛක්ෂ ධර්‍මය සම්පූර්‍ණ කරනු ඇතැයි කීම, සිදුවිය හැක්කකි. ශෛක්ෂ ධර්‍මය සම්පූර්‍ණ කර, සීලයන් සම්පූර්‍ණ කරනු ඇතැයි කීම, සිදුවිය හැක්කකි. සීලයන් සම්පූර්‍ණ කර, කාමරාගය හෝ රූපරාගය හෝ අරූපරාගය පහකරනු ඇතැයි කීම, සිදුවිය හැක්කකි.",
      "paliTitle": "Mittasuttaṃ",
      "englishTitle": "Friendship Sutta",
      "sinhalaTitle": "මිත්‍ර සූත්‍රය"
    },
    {
      "number": 68,
      "pali": "‘‘‘So vata, bhikkhave, bhikkhu saṅgaṇikārāmo saṅgaṇikarato saṅgaṇikārāmataṃ anuyutto, gaṇārāmo gaṇarato gaṇārāmataṃ anuyutto, eko paviveke abhiramissatī’ti netaṃ ṭhānaṃ vijjati. ‘Eko paviveke anabhiramanto cittassa nimittaṃ gahessatī’ti netaṃ ṭhānaṃ vijjati. ‘Cittassa nimittaṃ agaṇhanto sammādiṭṭhiṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sammādiṭṭhiṃ aparipūretvā sammāsamādhiṃ paripūressatī’ti netaṃ ṭhānaṃ vijjati. ‘Sammāsamādhiṃ aparipūretvā saṃyojanāni pajahissatī’ti netaṃ ṭhānaṃ vijjati. ‘Saṃyojanāni appahāya nibbānaṃ sacchikarissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘‘So vata, bhikkhave, bhikkhu na saṅgaṇikārāmo na saṅgaṇikarato na saṅgaṇikārāmataṃ anuyutto, na gaṇārāmo na gaṇarato na gaṇārāmataṃ anuyutto, eko paviveke abhiramissatī’ti ṭhānametaṃ vijjati. ‘Eko paviveke abhiramanto cittassa nimittaṃ gahessatī’ti ṭhānametaṃ vijjati. ‘Cittassa nimittaṃ gaṇhanto sammādiṭṭhiṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Sammādiṭṭhiṃ paripūretvā sammāsamādhiṃ paripūressatī’ti ṭhānametaṃ vijjati. ‘Sammāsamādhiṃ paripūretvā saṃyojanāni pajahissatī’ti ṭhānametaṃ vijjati. ‘Saṃyojanāni pahāya nibbānaṃ sacchikarissatī’ti ṭhānametaṃ vijjatī’’ti. Catutthaṃ.",
      "english": "Indeed, monks, for a monk who is fond of company, delights in company, is devoted to delighting in company, and is fond of groups, delights in groups, is devoted to delighting in groups, for him to delight in solitude – this is not possible. For one who does not delight in solitude to grasp the mental sign – this is not possible. For one who does not grasp the mental sign to perfect right view – this is not possible. For one who has not perfected right view to perfect right concentration – this is not possible. For one who has not perfected right concentration to abandon the fetters – this is not possible. For one who has not abandoned the fetters to realize Nibbana – this is not possible.\n\nIndeed, monks, for a monk who is not fond of company, does not delight in company, is not devoted to delighting in company, and is not fond of groups, does not delight in groups, is not devoted to delighting in groups, for him to delight in solitude – this is possible. For one who delights in solitude to grasp the mental sign – this is possible. For one who grasps the mental sign to perfect right view – this is possible. For one who has perfected right view to perfect right concentration – this is possible. For one who has perfected right concentration to abandon the fetters – this is possible. For one who has abandoned the fetters to realize Nibbana – this is possible.",
      "sinhala": "‘‘‘මහණෙනි, යම් භික්ෂූවක් සංගණිකාවට ඇළුනේ, සංගණිකාවට සතුටු වූයේ, සංගණිකාවෙහි ඇලීමට අනුගත වූයේ, ගණයෙහි ඇළුනේ, ගණයෙහි සතුටු වූයේ, ගණයෙහි ඇලීමට අනුගත වූයේ, ඒකාන්තයෙන් හුදකලාවෙහි ඇලෙන්නේය යනු සිදු විය නොහැක්කකි. ඒකාන්තයෙන් හුදකලාවෙහි නොඇලෙන්නේ, සිතේ නිමිත්ත ගන්නේය යනු සිදු විය නොහැක්කකි. සිතේ නිමිත්ත නොගන්නා තැනැත්තා සම්මාදිට්ඨිය පිරිපුරන්නේය යනු සිදු විය නොහැක්කකි. සම්මාදිට්ඨිය නොපිරූයේ, සම්මාසමාධිය පිරිපුරන්නේය යනු සිදු විය නොහැක්කකි. සම්මාසමාධිය නොපිරූයේ, සංයෝජන දුරුකරන්නේය යනු සිදු විය නොහැක්කකි. සංයෝජන දුරු නොකළේ, නිර්වාණය සාක්ෂාත් කරන්නේය යනු සිදු විය නොහැක්කකි.\n\n‘‘‘මහණෙනි, යම් භික්ෂූවක් සංගණිකාවට නොඇළුනේ, සංගණිකාවට නොසතුටු වූයේ, සංගණිකාවෙහි ඇලීමට අනුගත නො වූයේ, ගණයෙහි නොඇළුනේ, ගණයෙහි නොසතුටු වූයේ, ගණයෙහි ඇලීමට අනුගත නො වූයේ, ඒකාන්තයෙන් හුදකලාවෙහි ඇලෙන්නේය යනු සිදු විය හැක්කකි. ඒකාන්තයෙන් හුදකලාවෙහි ඇලෙන්නේ, සිතේ නිමිත්ත ගන්නේය යනු සිදු විය හැක්කකි. සිතේ නිමිත්ත ගන්නා තැනැත්තා සම්මාදිට්ඨිය පිරිපුරන්නේය යනු සිදු විය හැක්කකි. සම්මාදිට්ඨිය පිරූයේ, සම්මාසමාධිය පිරිපුරන්නේය යනු සිදු විය හැක්කකි. සම්මාසමාධිය පිරූයේ, සංයෝජන දුරුකරන්නේය යනු සිදු විය හැක්කකි. සංයෝජන දුරුකළේ, නිර්වාණය සාක්ෂාත් කරන්නේය යනු සිදු විය හැක්කකි.",
      "paliTitle": "Saṅgaṇikārāmasuttaṃ",
      "englishTitle": "The Saṅgaṇikārāma Sutta",
      "sinhalaTitle": "සංගණිකා ආරාම සූත්‍රය"
    },
    {
      "number": 69,
      "pali": "Atha kho aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho sā devatā bhagavantaṃ etadavoca – ‘‘chayime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame cha? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, sovacassatā, kalyāṇamittatā – ime kho, bhante, cha dhammā bhikkhuno aparihānāya saṃvattantī’’ti. Idamavoca sā devatā. Samanuñño satthā ahosi. Atha kho sā devatā ‘‘samanuñño me satthā’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho, bhikkhave, sā devatā maṃ etadavoca – ‘chayime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame cha? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, sovacassatā, kalyāṇamittatā – ime kho, bhante, cha dhammā bhikkhuno aparihānāya saṃvattantī’ti. Idamavoca, bhikkhave, sā devatā. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. Evaṃ vutte āyasmā sāriputto bhagavantaṃ abhivādetvā etadavoca – ‘‘imassa kho ahaṃ, bhante, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmi. Idha, bhante, bhikkhu attanā ca satthugāravo hoti satthugāravatāya ca vaṇṇavādī. Ye caññe bhikkhū na satthugāravā te ca satthugāravatāya samādapeti. Ye caññe bhikkhū satthugāravā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena. Attanā ca dhammagāravo hoti…pe… saṅghagāravo hoti… sikkhāgāravo hoti … suvaco hoti… kalyāṇamitto hoti kalyāṇamittatāya ca vaṇṇavādī. Ye caññe bhikkhū na kalyāṇamittā te ca kalyāṇamittatāya samādapeti. Ye caññe bhikkhū kalyāṇamittā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena. Imassa kho ahaṃ, bhante, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmī’’ti. ‘‘Sādhu sādhu, sāriputta! Sādhu kho tvaṃ, sāriputta, imassa mayā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāsi. Idha, sāriputta, bhikkhu attanā ca satthugāravo hoti satthugāravatāya ca vaṇṇavādī. Ye caññe bhikkhū na satthugāravā te ca satthugāravatāya samādapeti. Ye caññe bhikkhū satthugāravā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena. Attanā ca dhammagāravo hoti…pe… saṅghagāravo hoti… sikkhāgāravo hoti… suvaco hoti… kalyāṇamitto hoti kalyāṇamittatāya ca vaṇṇavādī. Ye caññe bhikkhū na kalyāṇamittā te ca kalyāṇamittatāya samādapeti. Ye caññe bhikkhū kalyāṇamittā tesañca vaṇṇaṃ bhaṇati bhūtaṃ tacchaṃ kālena. Imassa kho, sāriputta, mayā saṃkhittena bhāsitassa evaṃ vitthārena attho daṭṭhabbo’’ti. Pañcamaṃ.",
      "english": "Then, a certain deity, as the night was far advanced, radiant in appearance, illuminating the entire Jeta Grove, approached the Blessed One. Having approached, she paid homage to the Blessed One and stood to one side. Standing to one side, that deity said to the Blessed One, \"Venerable Sir, these six qualities lead to a monk's non-decline. Which six? Reverence for the Teacher, reverence for the Dhamma, reverence for the Sangha, reverence for the training, amenability to instruction, and noble friendship—these six qualities, Venerable Sir, lead to a monk's non-decline.\" That deity said this. The Teacher approved. Then, thinking, \"My Teacher has approved,\" that deity paid homage to the Blessed One, circumambulated him respectfully, and then vanished right there.\n\nThen, when that night had passed, the Blessed One addressed the monks, saying, \"Monks, this past night, a certain deity, as the night was far advanced, radiant in appearance, illuminating the entire Jeta Grove, approached me. Having approached, she paid homage to me and stood to one side. Standing to one side, Monks, that deity said to me, ‘Venerable Sir, these six qualities lead to a monk's non-decline. Which six? Reverence for the Teacher, reverence for the Dhamma, reverence for the Sangha, reverence for the training, amenability to instruction, and noble friendship—these six qualities, Venerable Sir, lead to a monk's non-decline.’ That deity said this, Monks. Having said this, she paid homage to me, circumambulated me respectfully, and then vanished right there.\"\n\nWhen this was said, Venerable Sāriputta paid homage to the Blessed One and said, \"Venerable Sir, I understand the meaning of what the Blessed One has stated concisely, in this elaborated way. Here, Venerable Sir, a monk is personally reverent towards the Teacher and speaks in praise of reverence for the Teacher. He encourages other monks who are not reverent towards the Teacher to cultivate reverence for the Teacher. And he praises, truthfully and at the right time, those other monks who are reverent towards the Teacher. He is personally reverent towards the Dhamma and speaks in praise of reverence for the Dhamma. He encourages other monks who are not reverent towards the Dhamma to cultivate reverence for the Dhamma. And he praises, truthfully and at the right time, those other monks who are reverent towards the Dhamma. He is personally reverent towards the Sangha and speaks in praise of reverence for the Sangha. He encourages other monks who are not reverent towards the Sangha to cultivate reverence for the Sangha. And he praises, truthfully and at the right time, those other monks who are reverent towards the Sangha. He is personally reverent towards the training and speaks in praise of reverence for the training. He encourages other monks who are not reverent towards the training to cultivate reverence for the training. And he praises, truthfully and at the right time, those other monks who are reverent towards the training. He is personally amenable to instruction and speaks in praise of amenability to instruction. He encourages other monks who are not amenable to instruction to cultivate amenability to instruction. And he praises, truthfully and at the right time, those other monks who are amenable to instruction. He is personally a noble friend and speaks in praise of noble friendship. He encourages other monks who are not noble friends to cultivate noble friendship. And he praises, truthfully and at the right time, those other monks who are noble friends. Venerable Sir, I understand the meaning of what the Blessed One has stated concisely, in this elaborated way.\"\n\n\"Excellent, excellent, Sāriputta! You have indeed, Sāriputta, understood the meaning of what I stated concisely, in this elaborated way. Here, Sāriputta, a monk is personally reverent towards the Teacher and speaks in praise of reverence for the Teacher. He encourages other monks who are not reverent towards the Teacher to cultivate reverence for the Teacher. And he praises, truthfully and at the right time, those other monks who are reverent towards the Teacher. He is personally reverent towards the Dhamma and speaks in praise of reverence for the Dhamma. He encourages other monks who are not reverent towards the Dhamma to cultivate reverence for the Dhamma. And he praises, truthfully and at the right time, those other monks who are reverent towards the Dhamma. He is personally reverent towards the Sangha and speaks in praise of reverence for the Sangha. He encourages other monks who are not reverent towards the Sangha to cultivate reverence for the Sangha. And he praises, truthfully and at the right time, those other monks who are reverent towards the Sangha. He is personally reverent towards the training and speaks in praise of reverence for the training. He encourages other monks who are not reverent towards the training to cultivate reverence for the training. And he praises, truthfully and at the right time, those other monks who are reverent towards the training. He is personally amenable to instruction and speaks in praise of amenability to instruction. He encourages other monks who are not amenable to instruction to cultivate amenability to instruction. And he praises, truthfully and at the right time, those other monks who are amenable to instruction. He is personally a noble friend and speaks in praise of noble friendship. He encourages other monks who are not noble friends to cultivate noble friendship. And he praises, truthfully and at the right time, those other monks who are noble friends. This is, Sāriputta, how the meaning of what I stated concisely should be understood in an elaborated way.\"",
      "sinhala": "එවිට, අලංකාර වූ රාත්‍රියෙහි, අතිශයින් දීප්තිමත් වර්ණ ඇත්තා වූ එක්තරා දෙවියෙක් මුළු ජේතවනාරාමය අලෝකමත් කරවා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියාය. පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක සිටියාය. එකත්පසෙක සිටි ඒ දෙවියෝ භාග්‍යවතුන් වහන්සේට මෙය කීවාය: \"ස්වාමීනි, භික්ෂුවකගේ පරිහානියට පත්නොවීමට හේතු වන ධර්ම සයක් ඇත. ඒ සය කුමක්ද? ශාස්තෘවරයා කෙරෙහි ගෞරවය, ධර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, අවවාද පිළිගන්නා සුළු බව සහ කල්‍යාණ මිත්‍ර සේවනය යන මේ ධර්ම සය භික්ෂුවකගේ පරිහානියට පත්නොවීමට හේතු වෙත්.\" ඒ දෙවියෝ මෙය කීවාය. ශාස්තෘවරයා වහන්සේ සතුටු වූ සේක. එවිට ඒ දෙවියෝ \"මාගේ ශාස්තෘවරයා වහන්සේ සතුටු වූ සේකැ\"යි සිතා භාග්‍යවතුන් වහන්සේට වැඳ, පැදකුණු කොට, එතැනම අතුරුදහන් වූවාය.\n\nඑවිට භාග්‍යවතුන් වහන්සේ ඒ රාත්‍රිය ඉක්ම ගිය පසු භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, මේ රාත්‍රියෙහි එක්තරා දෙවියෙක්, අලංකාර වූ රාත්‍රියෙහි, අතිශයින් දීප්තිමත් වර්ණ ඇත්තා වූ, මුළු ජේතවනාරාමය අලෝකමත් කරවා මා වෙත පැමිණියාය. පැමිණ, මට වැඳ එකත්පසෙක සිටියාය. මහණෙනි, එකත්පසෙක සිටි ඒ දෙවියෝ මට මෙය කීවාය: ‘ස්වාමීනි, භික්ෂුවකගේ පරිහානියට පත්නොවීමට හේතු වන ධර්ම සයක් ඇත. ඒ සය කුමක්ද? ශාස්තෘවරයා කෙරෙහි ගෞරවය, ධර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, අවවාද පිළිගන්නා සුළු බව සහ කල්‍යාණ මිත්‍ර සේවනය යන මේ ධර්ම සය භික්ෂුවකගේ පරිහානියට පත්නොවීමට හේතු වෙත්’ කියාය. මහණෙනි, ඒ දෙවියෝ මෙය කීවාය. මෙය කියා, මට වැඳ, පැදකුණු කොට, එතැනම අතුරුදහන් වූවාය.\"\n\nමෙසේ වදාළ විට ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට වැඳ මෙය කී සේක: \"ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් වදාළ මේ දේශනාවේ අර්ථය මම මෙසේ විස්තර වශයෙන් දනිමි. ස්වාමීනි, මෙහිලා භික්ෂුව තමන් විසින්ම ශාස්තෘවරයා කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ශාස්තෘවරයා කෙරෙහි ගෞරවය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් ශාස්තෘවරයා කෙරෙහි ගෞරවයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද ශාස්තෘවරයා කෙරෙහි ගෞරවයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් ශාස්තෘවරයා කෙරෙහි ගෞරවයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ධර්මය කෙරෙහි ගෞරවය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වේ. සංඝයා කෙරෙහි ගෞරවය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ශික්ෂාව කෙරෙහි ගෞරවය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම අවවාද පිළිගන්නා සුළු වේ. අවවාද පිළිගන්නා සුළු බව පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් අවවාද පිළිගන්නා සුළු නොවෙත්ද, ඔවුන්ද අවවාද පිළිගන්නා සුළු වීමට පොළඹවයි. අන් යම් භික්ෂූන් අවවාද පිළිගන්නා සුළු වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම කල්‍යාණ මිත්‍ර සේවනයෙන් යුක්ත වේ. කල්‍යාණ මිත්‍ර සේවනය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් කල්‍යාණ මිත්‍ර සේවනයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද කල්‍යාණ මිත්‍ර සේවනයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් කල්‍යාණ මිත්‍ර සේවනයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් වදාළ මේ දේශනාවේ අර්ථය මම මෙසේ විස්තර වශයෙන් දනිමි.\"\n\n\"සාදු සාදු, ශාරිපුත්ත! ශාරිපුත්ත, මා විසින් සංක්ෂිප්තයෙන් වදාළ මේ දේශනාවේ අර්ථය නුඹ මෙසේ විස්තර වශයෙන් දන්නෙහි. එය ඉතා යහපත්ය. ශාරිපුත්ත, මෙහිලා භික්ෂුව තමන් විසින්ම ශාස්තෘවරයා කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ශාස්තෘවරයා කෙරෙහි ගෞරවය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් ශාස්තෘවරයා කෙරෙහි ගෞරවයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද ශාස්තෘවරයා කෙරෙහි ගෞරවයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් ශාස්තෘවරයා කෙරෙහි ගෞරවයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ධර්මය කෙරෙහි ගෞරවය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් ධර්මය කෙරෙහි ගෞරවයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වේ. සංඝයා කෙරෙහි ගෞරවය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් සංඝයා කෙරෙහි ගෞරවයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වේ. ශික්ෂාව කෙරෙහි ගෞරවය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම අවවාද පිළිගන්නා සුළු වේ. අවවාද පිළිගන්නා සුළු බව පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් අවවාද පිළිගන්නා සුළු නොවෙත්ද, ඔවුන්ද අවවාද පිළිගන්නා සුළු වීමට පොළඹවයි. අන් යම් භික්ෂූන් අවවාද පිළිගන්නා සුළු වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. තමන් විසින්ම කල්‍යාණ මිත්‍ර සේවනයෙන් යුක්ත වේ. කල්‍යාණ මිත්‍ර සේවනය පැසසුමට ලක්කරයි. අන් යම් භික්ෂූන් කල්‍යාණ මිත්‍ර සේවනයෙන් යුක්ත නොවෙත්ද, ඔවුන්ද කල්‍යාණ මිත්‍ර සේවනයෙන් යුක්ත වීමට පොළඹවයි. අන් යම් භික්ෂූන් කල්‍යාණ මිත්‍ර සේවනයෙන් යුක්ත වෙත්ද, ඔවුන්ගේ ගුණ සත්‍ය වශයෙන්, යථාර්ථ වශයෙන්, සුදුසු වේලාවට කියයි. ශාරිපුත්ත, මා විසින් සංක්ෂිප්තයෙන් වදාළ මේ දේශනාවේ අර්ථය මෙසේ විස්තර වශයෙන් දත යුතුය\"යි වදාළ සේක.",
      "paliTitle": "Devatāsuttaṃ",
      "englishTitle": "The Discourse on Deities",
      "sinhalaTitle": "දේවතා සූත‍්‍රය"
    },
    {
      "number": 70,
      "pali": "‘‘‘So vata, bhikkhave, bhikkhu na santena samādhinā na paṇītena na paṭippassaddhiladdhena [na paṭippassaddhaladdhena (sī.)] na ekodibhāvādhigatena anekavihitaṃ iddhividhaṃ paccanubhavissati – ekopi hutvā bahudhā bhavissati, bahudhāpi hutvā eko bhavissati…pe… yāva brahmalokāpi kāyena vasaṃ vattessatī’ti netaṃ ṭhānaṃ vijjati. ‘Dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇissati – dibbe ca mānuse ca ye dūre santike cā’ti netaṃ ṭhānaṃ vijjati. ‘Parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānissati – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānissati …pe… vimuttaṃ vā cittaṃ vimuttaṃ cittanti pajānissatī’ti netaṃ ṭhānaṃ vijjati. ‘Anekavihitaṃ pubbenivāsaṃ anussarissati, seyyathidaṃ – ekampi jātiṃ, dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarissatī’ti netaṃ ṭhānaṃ vijjati. ‘Dibbena cakkhunā visuddhena atikkantamānusakena satte passissati…pe… yathākammūpage satte pajānissatī’ti netaṃ ṭhānaṃ vijjati. ‘Āsavānaṃ khayā…pe… sacchikatvā upasampajja viharissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘‘So vata, bhikkhave, bhikkhu santena samādhinā paṇītena paṭippassaddhiladdhena ekodibhāvādhigatena anekavihitaṃ iddhividhaṃ paccanubhavissati…pe… yāva brahmalokāpi kāyena vasaṃ vattessatī’ti ṭhānametaṃ vijjati. ‘Dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇissati – dibbe ca mānuse ca ye dūre santike cā’ti ṭhānametaṃ vijjati. ‘Parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānissati – sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānissati…pe… vimuttaṃ vā cittaṃ vimuttaṃ cittanti pajānissatī’ti ṭhānametaṃ vijjati. ‘Anekavihitaṃ pubbenivāsaṃ anussarissati, seyyathidaṃ – ekampi jātiṃ, dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarissatī’ti ṭhānametaṃ vijjati. ‘Dibbena cakkhunā visuddhena atikkantamānusakena satte passissati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānissatī’ti ṭhānametaṃ vijjati. ‘Āsavānaṃ khayā anāsavaṃ cetovimuttiṃ… pe… sacchikatvā upasampajja viharissatī’ti ṭhānametaṃ vijjatī’’ti. Chaṭṭhaṃ.",
      "english": "Indeed, O monks, that a bhikkhu, without a tranquil concentration, without a refined concentration, without a concentration attained through appeasement, without a concentration attained through unification, will experience various kinds of supernormal powers – being one, he becomes many; being many, he becomes one... even exercising mastery over the body up to the Brahma-world – such a possibility does not exist. That with the divine ear-element, purified and surpassing that of humans, he will hear both kinds of sounds – divine and human, those that are far and those that are near – such a possibility does not exist. That he will comprehend the minds of other beings, of other persons, by pervading their minds with his own: he will discern a mind with passion as ‘a mind with passion’... and a liberated mind as ‘a liberated mind’ – such a possibility does not exist. That he will recollect various past lives, such as one birth, two births... thus he will recollect in detail and with specific characteristics his various past lives – such a possibility does not exist. That with the divine eye, purified and surpassing that of humans, he will see beings... and will discern beings according to their karma – such a possibility does not exist. That through the destruction of the defilements, he will realize, enter, and dwell in that liberation – such a possibility does not exist.\n\nIndeed, O monks, that a bhikkhu, with a tranquil concentration, with a refined concentration, with a concentration attained through appeasement, with a concentration attained through unification, will experience various kinds of supernormal powers... even exercising mastery over the body up to the Brahma-world – such a possibility exists. That with the divine ear-element, purified and surpassing that of humans, he will hear both kinds of sounds – divine and human, those that are far and those that are near – such a possibility exists. That he will comprehend the minds of other beings, of other persons, by pervading their minds with his own: he will discern a mind with passion as ‘a mind with passion’... and a liberated mind as ‘a liberated mind’ – such a possibility exists. That he will recollect various past lives, such as one birth, two births... thus he will recollect in detail and with specific characteristics his various past lives – such a possibility exists. That with the divine eye, purified and surpassing that of humans, he will see beings passing away and reappearing, inferior and superior, beautiful and ugly, in happy destinations and in miserable destinations, and will discern beings according to their karma – such a possibility exists. That through the destruction of the defilements, he will realize, enter, and dwell in the unblemished liberation of mind – such a possibility exists.",
      "sinhala": "‘‘මහණෙනි, යම් භික්ෂුවක් සන්සුන් වූද, ප්‍රණීත වූද, (ක්ලේශයන්) සංසිඳීමෙන් ලද වූද, එකඟ බවට පත් වූද සමාධියකින් තොරව, එකෙක්ව සිට බොහෝ වීම, බොහෝ දෙනෙක්ව සිට එකෙක් වීම...පෙ... බ්‍රහ්ම ලෝකය දක්වා කයින් වසඟය පැවැත්වීම වැනි නොයෙක් ආකාරයේ ඍද්ධි ප්‍රාතිහාර්යයන් අත්දකිනු ඇතැයි යන මේ කරුණ සිදු විය නොහැක්කකි. පිරිසිදු වූ, මිනිසුන්ගේ නොවන දිව්‍ය ශ්‍රවණ ධාතුවෙන් දිව්‍ය වූද මනුෂ්‍ය වූද, දුර ඇතිද ළඟ ඇතිද යන දෙයාකාර වූ ශබ්ද අසනු ඇතැයි යන මේ කරුණ සිදු විය නොහැක්කකි. අන් සත්ත්වයන්ගේ, අන් පුද්ගලයන්ගේ සිත් තම සිතින් පිරිසිඳ දැනගනු ඇත. එනම්, රාග සහිත සිතක් නම් ‘රාග සහිත සිතකැයි’ දැනගනු ඇත...පෙ... විමුක්ති ලැබූ සිතක් නම් ‘විමුක්ති ලැබූ සිතකැයි’ දැනගනු ඇතැයි යන මේ කරුණ සිදු විය නොහැක්කකි. එනම්, එක් ආත්ම භාවයක්, ආත්ම භාවයන් දෙකක්...පෙ... මෙලෙස ආකාර සහිතව, අරමුණු සහිතව නොයෙක් ආකාරයේ පෙර විසූ කඳ පිළිවෙළ සිහි කරනු ඇතැයි යන මේ කරුණ සිදු විය නොහැක්කකි. පිරිසිදු වූ, මිනිසුන්ගේ නොවන දිව්‍ය චක්ෂුසෙන් සත්ත්වයන් දකිමින්...පෙ... කර්මානුරූපව ගමන් කරන සත්ත්වයන් දැනගනු ඇතැයි යන මේ කරුණ සිදු විය නොහැක්කකි. ආශ්‍රවයන් ක්ෂය කිරීමෙන්...පෙ... තමන් විසින්ම අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරනු ඇතැයි යන මේ කරුණ සිදු විය නොහැක්කකි.\n\nමහණෙනි, යම් භික්ෂුවක් සන්සුන් වූද, ප්‍රණීත වූද, (ක්ලේශයන්) සංසිඳීමෙන් ලද වූද, එකඟ බවට පත් වූද සමාධියකින් යුතුව, එකෙක්ව සිට බොහෝ වීම, බොහෝ දෙනෙක්ව සිට එකෙක් වීම...පෙ... බ්‍රහ්ම ලෝකය දක්වා කයින් වසඟය පැවැත්වීම වැනි නොයෙක් ආකාරයේ ඍද්ධි ප්‍රාතිහාර්යයන් අත්දකිනු ඇතැයි යන මේ කරුණ සිදු විය හැක්කකි. පිරිසිදු වූ, මිනිසුන්ගේ නොවන දිව්‍ය ශ්‍රවණ ධාතුවෙන් දිව්‍ය වූද මනුෂ්‍ය වූද, දුර ඇතිද ළඟ ඇතිද යන දෙයාකාර වූ ශබ්ද අසනු ඇතැයි යන මේ කරුණ සිදු විය හැක්කකි. අන් සත්ත්වයන්ගේ, අන් පුද්ගලයන්ගේ සිත් තම සිතින් පිරිසිඳ දැනගනු ඇත. එනම්, රාග සහිත සිතක් නම් ‘රාග සහිත සිතකැයි’ දැනගනු ඇත...පෙ... විමුක්ති ලැබූ සිතක් නම් ‘විමුක්ති ලැබූ සිතකැයි’ දැනගනු ඇතැයි යන මේ කරුණ සිදු විය හැක්කකි. එනම්, එක් ආත්ම භාවයක්, ආත්ම භාවයන් දෙකක්...පෙ... මෙලෙස ආකාර සහිතව, අරමුණු සහිතව නොයෙක් ආකාරයේ පෙර විසූ කඳ පිළිවෙළ සිහි කරනු ඇතැයි යන මේ කරුණ සිදු විය හැක්කකි. පිරිසිදු වූ, මිනිසුන්ගේ නොවන දිව්‍ය චක්ෂුසෙන් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති දුර්ගතිවල උපදින, කර්මානුරූපව ගමන් කරන සත්ත්වයන් දකිනු ඇතැයි යන මේ කරුණ සිදු විය හැක්කකි. ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය...පෙ... තමන් විසින්ම අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරනු ඇතැයි යන මේ කරුණ සිදු විය හැක්කකි.’’",
      "paliTitle": "Samādhisuttaṃ",
      "englishTitle": "The Concentration Discourse",
      "sinhalaTitle": "සමාධි සූත‍්‍රය"
    },
    {
      "number": 71,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu abhabbo tatra tatreva sakkhibhabbataṃ pāpuṇituṃ sati sati āyatane. Katamehi chahi? Idha, bhikkhave, bhikkhu ‘ime hānabhāgiyā dhammā’ti yathābhūtaṃ nappajānāti, ‘ime ṭhitibhāgiyā dhammā’ti yathābhūtaṃ nappajānāti, ‘ime visesabhāgiyā dhammā’ti yathābhūtaṃ nappajānāti, ‘ime nibbedhabhāgiyā dhammā’ti yathābhūtaṃ nappajānāti, asakkaccakārī ca hoti, asappāyakārī ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu abhabbo tatra tatreva sakkhibhabbataṃ pāpuṇituṃ sati sati āyatane. ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo tatra tatreva sakkhibhabbataṃ pāpuṇituṃ sati sati āyatane. Katamehi chahi? Idha, bhikkhave, bhikkhu ‘ime hānabhāgiyā dhammā’ti yathābhūtaṃ pajānāti, ‘ime ṭhitibhāgiyā dhammā’ti yathābhūtaṃ pajānāti, ‘ime visesabhāgiyā dhammā’ti yathābhūtaṃ pajānāti, ‘ime nibbedhabhāgiyā dhammā’ti yathābhūtaṃ pajānāti, sakkaccakārī ca hoti, sappāyakārī ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu bhabbo tatra tatreva sakkhibhabbataṃ pāpuṇituṃ sati sati āyatane’’ti. Sattamaṃ.",
      "english": "Monks, a monk endowed with six qualities is incapable of attaining the capacity for direct knowledge in regard to each respective sphere of experience. Which six? Here, monks, a monk does not understand as it actually is, \"These are phenomena leading to decline\"; he does not understand as it actually is, \"These are phenomena conducive to stability\"; he does not understand as it actually is, \"These are phenomena conducive to distinction\"; he does not understand as it actually is, \"These are phenomena conducive to penetration.\" Furthermore, he acts without earnestness and he acts without suitability. Indeed, monks, a monk endowed with these six qualities is incapable of attaining the capacity for direct knowledge in regard to each respective sphere of experience.\n\nMonks, a monk endowed with six qualities is capable of attaining the capacity for direct knowledge in regard to each respective sphere of experience. Which six? Here, monks, a monk understands as it actually is, \"These are phenomena leading to decline\"; he understands as it actually is, \"These are phenomena conducive to stability\"; he understands as it actually is, \"These are phenomena conducive to distinction\"; he understands as it actually is, \"These are phenomena conducive to penetration.\" Furthermore, he acts with earnestness and he acts with suitability. Indeed, monks, a monk endowed with these six qualities is capable of attaining the capacity for direct knowledge in regard to each respective sphere of experience.",
      "sinhala": "භික්ෂූණි, ධර්මයන් හයක් සහිත භික්ෂුවක් ඒ ඒ ආයතන වලදී ප‍්‍රතිවේධ ඥානයට පැමිණීමට සමර්ථ වන්නේ නැත. ඒ ධර්මයන් හය කුමක්ද? භික්ෂූණි, මෙහිලා භික්ෂුවක් ‘මේවා පිරිහීමට හෙතු වන ධර්මයන් ය’ යි ඇති සැටියෙන් නොදැන සිටී, ‘මේවා පැවැත්මට (ස්ථාවරත්වයට) හෙතු වන ධර්මයන් ය’ යි ඇති සැටියෙන් නොදැන සිටී, ‘මේවා වර්ධනයට (විශේෂ අවබෝධයට) හෙතු වන ධර්මයන් ය’ යි ඇති සැටියෙන් නොදැන සිටී, ‘මේවා අරමුණ විනිවිද යෑමට (අරිය මාර්ගයට) හෙතු වන ධර්මයන් ය’ යි ඇති සැටියෙන් නොදැන සිටී. තවද, ඔහු අසක්කච්චකාරී ද වේ, අසප්පායකාරී ද වේ. භික්ෂූණි, මේ ධර්මයන් හයෙන් යුක්ත වූ භික්ෂුව ඒ ඒ ආයතන වලදී ප‍්‍රතිවේධ ඥානයට පැමිණීමට සමර්ථ වන්නේ නැත.\n\nභික්ෂූණි, ධර්මයන් හයක් සහිත භික්ෂුවක් ඒ ඒ ආයතන වලදී ප‍්‍රතිවේධ ඥානයට පැමිණීමට සමර්ථ වන්නේය. ඒ ධර්මයන් හය කුමක්ද? භික්ෂූණි, මෙහිලා භික්ෂුවක් ‘මේවා පිරිහීමට හෙතු වන ධර්මයන් ය’ යි ඇති සැටියෙන් දනී, ‘මේවා පැවැත්මට (ස්ථාවරත්වයට) හෙතු වන ධර්මයන් ය’ යි ඇති සැටියෙන් දනී, ‘මේවා වර්ධනයට (විශේෂ අවබෝධයට) හෙතු වන ධර්මයන් ය’ යි ඇති සැටියෙන් දනී, ‘මේවා අරමුණ විනිවිද යෑමට (අරිය මාර්ගයට) හෙතු වන ධර්මයන් ය’ යි ඇති සැටියෙන් දනී. තවද, ඔහු සක්කච්චකාරී ද වේ, සප්පායකාරී ද වේ. භික්ෂූණි, මේ ධර්මයන් හයෙන් යුක්ත වූ භික්ෂුව ඒ ඒ ආයතන වලදී ප‍්‍රතිවේධ ඥානයට පැමිණීමට සමර්ථ වන්නේය.",
      "paliTitle": "Sakkhibhabbasuttaṃ",
      "englishTitle": "Discourse on Realization",
      "sinhalaTitle": "සාක‍්ෂාත් ක‍ළ හැක‍ි සූත‍්‍රය"
    },
    {
      "number": 72,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu abhabbo samādhismiṃ [samādhimhi (ka.)] balataṃ pāpuṇituṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu na samādhissa samāpattikusalo hoti, na samādhissa ṭhitikusalo hoti, na samādhissa [na samādhimhā (ka.) uparisattakanipāte devatāvagge pana sabbatthapi ‘‘samādhissa’’itveva dissati] vuṭṭhānakusalo hoti, asakkaccakārī ca hoti, asātaccakārī ca, asappāyakārī ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu abhabbo samādhismiṃ balataṃ pāpuṇituṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo samādhismiṃ balataṃ pāpuṇituṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu samādhissa samāpattikusalo hoti, samādhissa ṭhitikusalo hoti, samādhissa vuṭṭhānakusalo hoti, sakkaccakārī ca hoti, sātaccakārī ca, sappāyakārī ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu bhabbo samādhismiṃ balataṃ pāpuṇitu’’nti. Aṭṭhamaṃ.",
      "english": "Monks, a bhikkhu endowed with six qualities is incapable of achieving mastery in concentration. Which six? Here, monks, a bhikkhu is not skilled in entering concentration, not skilled in maintaining concentration, not skilled in emerging from concentration; he acts without earnestness, without persistence, and without suitability. Monks, a bhikkhu endowed with these six qualities is incapable of achieving mastery in concentration.\n\nMonks, a bhikkhu endowed with six qualities is capable of achieving mastery in concentration. Which six? Here, monks, a bhikkhu is skilled in entering concentration, skilled in maintaining concentration, skilled in emerging from concentration; he acts with earnestness, with persistence, and with suitability. Monks, a bhikkhu endowed with these six qualities is capable of achieving mastery in concentration.",
      "sinhala": "මහණෙනි, ධර්ම කරුණු හයකින් යුක්ත වූ භික්ෂුවක් සමාධියෙහි බලවත්භාවයට පත්වීමට නොහැකියි. ඒ ධර්ම කරුණු හය කවරේද? මහණෙනි, මෙහිලා භික්ෂුව සමාධියට සමවදින ක්‍රමයෙහි දක්ෂ නොවේ. සමාධිය පවත්වාගෙන යෑමෙහි ද දක්ෂ නොවේ. සමාධියෙන් නැගිටින ක්‍රමයෙහි ද දක්ෂ නොවේ. ඔහු අවධානයෙන් හා ගෞරවයෙන් ක්‍රියා නොකරයි. නොකඩවා ක්‍රියා නොකරයි. සුදුසු පරිදි ද ක්‍රියා නොකරයි. මහණෙනි, මේ ධර්ම කරුණු හයකින් යුක්ත වූ භික්ෂුවක් සමාධියෙහි බලවත්භාවයට පත්වීමට නොහැකියි.\n\nමහණෙනි, ධර්ම කරුණු හයකින් යුක්ත වූ භික්ෂුවක් සමාධියෙහි බලවත්භාවයට පත්වීමට හැකියි. ඒ ධර්ම කරුණු හය කවරේද? මහණෙනි, මෙහිලා භික්ෂුව සමාධියට සමවදින ක්‍රමයෙහි දක්ෂ වේ. සමාධිය පවත්වාගෙන යෑමෙහි ද දක්ෂ වේ. සමාධියෙන් නැගිටින ක්‍රමයෙහි ද දක්ෂ වේ. ඔහු අවධානයෙන් හා ගෞරවයෙන් ක්‍රියා කරයි. නොකඩවා ක්‍රියා කරයි. සුදුසු පරිදි ද ක්‍රියා කරයි. මහණෙනි, මේ ධර්ම කරුණු හයකින් යුක්ත වූ භික්ෂුවක් සමාධියෙහි බලවත්භාවයට පත්වීමට හැකියි.",
      "paliTitle": "Balasuttaṃ",
      "englishTitle": "Discourse on Powers",
      "sinhalaTitle": "බල සූත‍්‍රය"
    },
    {
      "number": 73,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. Katame cha? Kāmacchandaṃ, byāpādaṃ, thinamiddhaṃ, uddhaccakukkuccaṃ, vicikicchaṃ. Kāmesu kho panassa ādīnavo na yathābhūtaṃ sammappaññāya sudiṭṭho hoti. Ime kho, bhikkhave, cha dhamme appahāya abhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. ‘‘Cha, bhikkhave, dhamme pahāya bhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. Katame cha? Kāmacchandaṃ, byāpādaṃ, thinamiddhaṃ, uddhaccakukkuccaṃ, vicikicchaṃ, kāmesu kho panassa ādīnavo na yathābhūtaṃ sammappaññāya sudiṭṭho hoti. Ime kho, bhikkhave, cha dhamme pahāya bhabbo paṭhamaṃ jhānaṃ upasampajja viharitu’’nti. Navamaṃ.",
      "english": "Monks, without abandoning six qualities, one is unable to enter and dwell in the first jhāna. Which six? Sensual desire, ill-will, sloth and torpor, restlessness and remorse, doubt, and the condition where the danger in sensual pleasures is not well seen by him as it really is, through right understanding. Indeed, monks, without abandoning these six qualities, one is unable to enter and dwell in the first jhāna.\n\nMonks, having abandoned six qualities, one is able to enter and dwell in the first jhāna. Which six? Sensual desire, ill-will, sloth and torpor, restlessness and remorse, doubt, and the condition where the danger in sensual pleasures is not well seen by him as it really is, through right understanding. Indeed, monks, having abandoned these six qualities, one is able to enter and dwell in the first jhāna.",
      "sinhala": "භික්‍ෂූණි, ධර්ම සයක් ප්‍රහාණය නොකොට පළමු ධ්‍යානයට පැමිණ වාසය කිරීමට නොහැක. ඒ සය කවරේද? කාමච්ඡන්දය, ව්‍යාපාදය, ථීනමිද්ධය, උද්ධච්චකුක්කුච්චය, විචිකිච්ඡාව, තවද කම් සැපයන්හි ආදීනවය යථාභූත ලෙස සම්‍යක් ප්‍රඥාවෙන් මනාව නොදැක සිටීමයි. භික්‍ෂූණි, මේ ධර්ම සය ප්‍රහාණය නොකොට පළමු ධ්‍යානයට පැමිණ වාසය කිරීමට නොහැක.\n\nභික්‍ෂූණි, ධර්ම සයක් ප්‍රහාණය කොට පළමු ධ්‍යානයට පැමිණ වාසය කිරීමට හැකි වේ. ඒ සය කවරේද? කාමච්ඡන්දය, ව්‍යාපාදය, ථීනමිද්ධය, උද්ධච්චකුක්කුච්චය, විචිකිච්ඡාව, තවද කම් සැපයන්හි ආදීනවය යථාභූත ලෙස සම්‍යක් ප්‍රඥාවෙන් මනාව නොදැක සිටීමයි. භික්‍ෂූණි, මේ ධර්ම සය ප්‍රහාණය කොට පළමු ධ්‍යානයට පැමිණ වාසය කිරීමට හැකි වේ.",
      "paliTitle": "Paṭhamatajjhānasuttaṃ",
      "englishTitle": "Discourse on the First Jhāna",
      "sinhalaTitle": "පළමු ඣාන සූත්‍රය"
    },
    {
      "number": 74,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. Katame cha? Kāmavitakkaṃ, byāpādavitakkaṃ, vihiṃsāvitakkaṃ, kāmasaññaṃ, byāpādasaññaṃ, vihiṃsāsaññaṃ – ime kho, bhikkhave, cha dhamme appahāya abhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. ‘‘Cha, bhikkhave, dhamme pahāya bhabbo paṭhamaṃ jhānaṃ upasampajja viharituṃ. Katame cha? Kāmavitakkaṃ, byāpādavitakkaṃ, vihiṃsāvitakkaṃ, kāmasaññaṃ, byāpādasaññaṃ, vihiṃsāsaññaṃ – ime kho, bhikkhave, cha dhamme pahāya bhabbo paṭhamaṃ jhānaṃ upasampajja viharitu’’nti. Dasamaṃ. ",
      "english": "Monks, without abandoning six qualities, one is incapable of entering and dwelling in the first meditative absorption. Which six? Sensual thought, thought of ill-will, thought of harm; sensual perception, perception of ill-will, and perception of harm. Indeed, monks, without abandoning these six qualities, one is incapable of entering and dwelling in the first meditative absorption.\n\nMonks, having abandoned six qualities, one is capable of entering and dwelling in the first meditative absorption. Which six? Sensual thought, thought of ill-will, thought of harm; sensual perception, perception of ill-will, and perception of harm. Indeed, monks, having abandoned these six qualities, one is capable of entering and dwelling in the first meditative absorption.",
      "sinhala": "මහණෙනි, සය දහමක් අත් නොහැර ප‍්‍රථම ධ්‍යානය උපදවාගෙන වාසය කිරීමට නොහැක්කේය. ඒ කවර සය දහමක්ද? කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය, කාම සංඥාව, ව්‍යාපාද සංඥාව, විහිංසා සංඥාව යන මේ සය දහම් අත් නොහැර ප‍්‍රථම ධ්‍යානය උපදවාගෙන වාසය කිරීමට නොහැක්කේය.\n\nමහණෙනි, සය දහමක් අත්හැර ප‍්‍රථම ධ්‍යානය උපදවාගෙන වාසය කිරීමට හැක්කේය. ඒ කවර සය දහමක්ද? කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය, කාම සංඥාව, ව්‍යාපාද සංඥාව, විහිංසා සංඥාව යන මේ සය දහම් අත්හැර ප‍්‍රථම ධ්‍යානය උපදවාගෙන වාසය කිරීමට හැක්කේය.",
      "paliTitle": "Dutiyatajjhānasuttaṃ",
      "englishTitle": "The Second Jhāna Discourse",
      "sinhalaTitle": "දෙවන ඣාන සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Devatāvaggo sattamo. [dutiyo (syā. ka.)] Tassuddānaṃ – Anāgāmi arahaṃ mittā, saṅgaṇikārāmadevatā; Samādhi sakkhibhabbaṃ balaṃ, tajjhānā apare duveti.",
    "english": "The Seventh Chapter on Deities",
    "sinhala": "සත්වන දේවතා වග#zwj#්ගය"
  }
}