{
  "id": "an6.1",
  "title": {
    "pali": "Āhuneyyavaggo",
    "english": "The Section on Those Worthy of Offerings",
    "sinhala": "ආහුණෙය්‍ය වග්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi chahi [dī. ni. 3.328; paṭi. ma. 3.17]? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Ghānena gandhaṃ ghāyitvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Jivhāya raṃ sāyitvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Kāyena phoṭṭhabbaṃ phusitvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Manasā dhammaṃ viññā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Paṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling at Savatthi, in Jeta's Grove, Anathapindika's monastery. There, indeed, the Blessed One addressed the monks, saying, \"Monks.\" \"Venerable Sir,\" those monks replied to the Blessed One.\n\nThe Blessed One spoke this: \"Monks, a monk endowed with six qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world. With which six? Here, monks, having seen a form with the eye, a monk is neither pleased nor displeased; he dwells in equanimity, mindful and clearly comprehending. Having heard a sound with the ear, he is neither pleased nor displeased; he dwells in equanimity, mindful and clearly comprehending. Having smelled an odor with the nose, he is neither pleased nor displeased; he dwells in equanimity, mindful and clearly comprehending. Having tasted a flavor with the tongue, he is neither pleased nor displeased; he dwells in equanimity, mindful and clearly comprehending. Having felt a tactile sensation with the body, he is neither pleased nor displeased; he dwells in equanimity, mindful and clearly comprehending. Having cognized a mental phenomenon with the mind, he is neither pleased nor displeased; he dwells in equanimity, mindful and clearly comprehending. Indeed, monks, a monk endowed with these six qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.\"\n\nThe Blessed One said this. Delighted, those monks rejoiced in the Blessed One's words.",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩසිටින සේක.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" කියා වදාළ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, ධර්ම සයක් සම්පූර්ණ කළ භික්ෂුවක් ආහුණෙය්‍ය (දුර සිට ගෙනැවිත් දෙන දන් පිදීමට සුදුසු), පාහුණෙය්‍ය (තමන් වෙත පැමිණි අමුත්තන්ට දෙන දන් පිදීමට සුදුසු), දක්ඛිණෙය්‍ය (දක්ෂිණාවන්ට සුදුසු), ඇඳිලි පිදීමට සුදුසු, ලෝකයාට අනුත්තර වූ පින්කෙතක් වෙයි. කවර ධර්ම සයකින්ද යත්:\n\nමහණෙනි, මෙහිලා භික්ෂුව ඇසින් රූපයක් දැක සතුටු නොවේ, දුක් දොම්නස් ද ඇතිකර නොගනී, සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි.\n\nකනින් ශ්‍රබ්දයක් අසා සතුටු නොවේ, දුක් දොම්නස් ද ඇතිකර නොගනී, සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි.\n\nනාසයෙන් ගන්ධයක් ආඝ්‍රාණය කොට සතුටු නොවේ, දුක් දොම්නස් ද ඇතිකර නොගනී, සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි.\n\nදිවෙන් රසයක් විඳ සතුටු නොවේ, දුක් දොම්නස් ද ඇතිකර නොගනී, සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි.\n\nකයින් ස්පර්ශයක් ස්පර්ශ කොට සතුටු නොවේ, දුක් දොම්නස් ද ඇතිකර නොගනී, සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි.\n\nමනසින් ධර්මයක් දැන සතුටු නොවේ, දුක් දොම්නස් ද ඇතිකර නොගනී, සිහි නුවණින් යුතුව උපේක්ෂාවෙන් වාසය කරයි.\n\nමහණෙනි, මේ ධර්ම සය සම්පූර්ණ කළ භික්ෂුව ආහුණෙය්‍ය, පාහුණෙය්‍ය, දක්ඛිණෙය්‍ය, ඇඳිලි පිදීමට සුදුසු, ලෝකයාට අනුත්තර වූ පින්කෙතක් වෙයි\" යනුවෙනි.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ දෙසුම සතුටින් පිළිගත්හ.\n\nපළමුවෙනි සූත්‍රයයි.",
      "paliTitle": "Paṭhamaāhuneyyasuttaṃ",
      "englishTitle": "The First Discourse on Those Worthy of Gifts",
      "sinhalaTitle": "පඨමාහුණෙය්‍ය සූත්‍රය"
    },
    {
      "number": 2,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi chahi [dī. ni. 3.356]? Idha, bhikkhave, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake; udakepi abhijjamāne gacchati, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parimasati [parāmasati (ka.)] parimajjati; yāva brahmalokāpi kāyena vasaṃ vatteti. ‘‘Dibbāya, sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti – dibbe ca mānuse ca, ye dūre santike ca. ‘‘Parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti. Sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānāti, vītarāgaṃ vā cittaṃ…pe… sadosaṃ vā cittaṃ… vītadosaṃ vā cittaṃ… samohaṃ vā cittaṃ… vītamohaṃ vā cittaṃ… saṃkhittaṃ vā cittaṃ… vikkhittaṃ vā cittaṃ… mahaggataṃ vā cittaṃ… amahaggataṃ vā cittaṃ… sauttaraṃ vā cittaṃ… anuttaraṃ vā cittaṃ… samāhitaṃ vā cittaṃ… asamāhitaṃ vā cittaṃ… vimuttaṃ vā cittaṃ… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajānāti. ‘‘Anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe…. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘Dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. ‘‘Āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. ‘‘Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, a monk endowed with six qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of veneration, an unsurpassed field of merit for the world. Which six?\n\nHere, bhikkhus, a monk experiences various kinds of supernormal power: having been one, he becomes many; having been many, he becomes one. He appears and vanishes. He passes unhindered through walls, ramparts, and mountains, as if through space. He dives in and out of the earth as if in water. He walks on water without sinking as if on land. He travels through the air cross-legged, like a winged bird. He touches and strokes the moon and sun, so mighty and powerful, with his hand. He exercises bodily mastery even up to the Brahma world.\n\nWith the divine ear element, purified and surpassing that of humans, he hears both kinds of sounds, divine and human, those far and those near.\n\nHe comprehends the minds of other beings, other individuals, with his own mind. He discerns a mind with lust as having lust, and a mind without lust as having no lust; a mind with hatred as having hatred, and a mind without hatred as having no hatred; a mind with delusion as having delusion, and a mind without delusion as having no delusion; a constricted mind as constricted, and a scattered mind as scattered; an exalted mind as exalted, and an unexalted mind as unexalted; a surpassable mind as surpassable, and an unsurpassed mind as unsurpassed; a concentrated mind as concentrated, and an unconcentrated mind as unconcentrated; a liberated mind as liberated, and an unliberated mind as unliberated.\n\nHe recollects his manifold past lives, that is, one birth, two births, three, four, five, ten, twenty, thirty, forty, fifty, a hundred births, many eons of contraction, many eons of expansion, many eons of both contraction and expansion. Thus, he recollects his manifold past lives with their distinct modes and features.\n\nWith the divine eye, purified and surpassing that of humans, he sees beings passing away and re-arising, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their actions. He discerns: ‘Indeed, these venerable beings, endowed with misconduct of body, misconduct of speech, misconduct of mind, denouncers of the noble ones, holding wrong view, and undertaking actions based on wrong view—upon the breaking up of the body, after death, they have reappeared in a state of deprivation, a bad destination, a downfall, in hell. Or again, these venerable beings, endowed with good conduct of body, good conduct of speech, good conduct of mind, not denouncers of the noble ones, holding right view, and undertaking actions based on right view—upon the breaking up of the body, after death, they have reappeared in a good destination, in the heavenly world.’ Thus, with the divine eye, purified and surpassing that of humans, he sees beings passing away and re-arising, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their actions.\n\nThrough the destruction of the taints, having realized for himself with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, he enters and dwells therein.\n\nBhikkhus, a monk endowed with these six qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of veneration, an unsurpassed field of merit for the world.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්ම හයකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය (පූජාවන්ට සුදුසු) වේ, පාහුණෙය්‍ය (අමුත්තන්ට දීමට සුදුසු) වේ, දක්ඛිණෙය්‍ය (දකුණත් පූජාවට සුදුසු) වේ, අඤ්ජලිකරණීය (ඇඳිලි කොට වැඳීමට සුදුසු) වේ, ලෝකයාට අනුත්​තර වූ පින්කෙතක් වේ. ඒ කවර ධර්ම හයකින් ද?\n\nභික්ෂූන් වහන්ස, මෙහිලා භික්ෂුව නොයෙක් අයුරින් ඍද්ධි ප්‍රාතිහාර්යයන් අත්දක්නා සේක: එකෙක් ව සිට බොහෝ දෙනෙක් බවට ද, බොහෝ දෙනෙක් ව සිට එකෙක් බවට ද පත් වේ; ප්‍රකට වීම ද, අතුරුදහන් වීම ද කරයි; බිත්තියක්, ප්‍රාකාරයක්, කන්දක් අසංගව, අහසෙහි මෙන්, ගමන් කරයි; පොළොවෙහි ද ජලයෙහි මෙන් මතුවීම් සහ කිමිදීම් කරයි; ජලයෙහි ද පොළොවෙහි මෙන් නොබිඳී ගමන් කරයි; අහසෙහි ද පක්ෂියෙකු සේ පලක් බැඳ හිඳ ගමන් කරයි; මෙබඳු මහත් ඍද්ධි ඇති, මහත් ආනුභාව ඇති චන්ද්‍රයා සහ සූර්යයා ද අතින් ස්පර්ශ කරයි, පිරිමදී; බ්‍රහ්ම ලෝකය දක්වා ද කයින් වසඟයට පත්කරගෙන සිටී.\n\nපිරිසිදු වූ, මිනිස් කන ඉක්මවා ගිය දිව්‍යමය ශ්‍රවණ ධාතුවෙන් (දිව්‍ය කණින්), දුරෙහි ද ළඟෙහි ද ඇති දිව්‍ය ශබ්ද සහ මනුෂ්‍ය ශබ්ද යන දෙවර්ගය ම අසයි.\n\nඅනුන්ගේ සිතින් අනුන්ගේ සිත වටහාගෙන දැන ගනී. සරාගී සිතක් නම්, සරාගී සිතක් යැයි දැන ගනී; වීතරාගී සිතක් නම්, වීතරාගී සිතක් යැයි දැන ගනී; ද්වේෂ සහිත සිතක් නම්, ද්වේෂ සහිත සිතක් යැයි දැන ගනී; ද්වේෂ රහිත සිතක් නම්, ද්වේෂ රහිත සිතක් යැයි දැන ගනී; මෝහ සහිත සිතක් නම්, මෝහ සහිත සිතක් යැයි දැන ගනී; මෝහ රහිත සිතක් නම්, මෝහ රහිත සිතක් යැයි දැන ගනී; හකුළුවන ලද සිතක් නම්, හකුළුවන ලද සිතක් යැයි දැන ගනී; විසිරුණු සිතක් නම්, විසිරුණු සිතක් යැයි දැන ගනී; මහද්ගත සිතක් නම්, මහද්ගත සිතක් යැයි දැන ගනී; අමහද්ගත සිතක් නම්, අමහද්ගත සිතක් යැයි දැන ගනී; උත්තර සහිත සිතක් නම්, උත්තර සහිත සිතක් යැයි දැන ගනී; අනුත්​තර සිතක් නම්, අනුත්​තර සිතක් යැයි දැන ගනී; සමාහිත සිතක් නම්, සමාහිත සිතක් යැයි දැන ගනී; අසමාහිත සිතක් නම්, අසමාහිත සිතක් යැයි දැන ගනී; විමුක්ත සිතක් නම්, විමුක්ත සිතක් යැයි දැන ගනී; අවිමුක්ත සිතක් නම්, අවිමුක්ත සිතක් යැයි දැන ගනී.\n\nනොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරයි. එනම්: එක් ජාතියක්, දෙජාතියක්, තුන් ජාතියක්, සතර ජාතියක්, පස් ජාතියක්, දස ජාතියක්, විසි ජාතියක්, තිස් ජාතියක්, සතළිස් ජාතියක්, පණස් ජාතියක්, සියයක් ජාතීන්, දහසක් ජාතීන්, සිය දහසක් ජාතීන් සිහි කරයි. නොයෙක් සංවර්ත කල්ප ද සිහි කරයි, නොයෙක් විවර්ත කල්ප ද සිහි කරයි, නොයෙක් සංවර්ත විවර්ත කල්ප ද සිහි කරයි. 'අසවල් තැන මම මේ නමින්, මෙබඳු ගොත්‍රයකින්, මෙබඳු වර්ණයකින්, මෙබඳු ආහාරයකින්, මෙබඳු සැප දුක් අත්විඳිමින්, මෙබඳු ආයුෂයක් ඇතිව වාසය කළෙමි. ඒ මම එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එතැන ද මේ නමින්, මෙබඳු ගොත්‍රයකින්, මෙබඳු වර්ණයකින්, මෙබඳු ආහාරයකින්, මෙබඳු සැප දුක් අත්විඳිමින්, මෙබඳු ආයුෂයක් ඇතිව වාසය කළෙමි. ඒ මම එතැනින් චුත වී දැන් මෙහි උපන්නෙමි'යි මෙසේ ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරයි.\n\nපිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින් (දිවැසින්) සත්වයන් දකියි. චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගතිගාමී වූ, දුර්ගතිගාමී වූ, කර්මානුරූපී වූ සත්වයන් දැන ගනී: 'ඇත්තෙන් ම මේ භවත් සත්වයෝ කාය දුශ්චරිතයෙන් යුක්ත වූවෝ ය, වචී දුශ්චරිතයෙන් යුක්ත වූවෝ ය, මනෝ දුශ්චරිතයෙන් යුක්ත වූවෝ ය, ආර්යයන්ට අපහාස කරන්නෝ ය, මිත්‍යා දෘෂ්ටිකයෝ ය, මිත්‍යා දෘෂ්ටික කර්ම සමාදානයෙන් යුක්ත වූවෝ ය. ඔවුහු කය බිඳීමෙන් මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරයෙහි උපදින්නාහ. නැතහොත් මේ භවත් සත්වයෝ කාය සුචරිතයෙන් යුක්ත වූවෝ ය, වචී සුචරිතයෙන් යුක්ත වූවෝ ය, මනෝ සුචරිතයෙන් යුක්ත වූවෝ ය, ආර්යයන්ට අපහාස නොකරන්නෝ ය, සම්මා දෘෂ්ටිකයෝ ය, සම්මා දෘෂ්ටික කර්ම සමාදානයෙන් යුක්ත වූවෝ ය. ඔවුහු කය බිඳීමෙන් මරණින් මතු සුගති, ස්වර්ග ලෝකයෙහි උපදින්නාහ'යි. මෙසේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින් (දිවැසින්) චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගතිගාමී වූ, දුර්ගතිගාමී වූ, කර්මානුරූපී වූ සත්වයන් දැන ගනී.\n\nආශ්‍රවයන් ක්ෂය කිරීම නිසා, කෙලෙස් රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මයෙහිදීම තමා විසින් ම අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, ලබාගෙන වාසය කරයි.\n\nභික්ෂූන් වහන්ස, ඇත්තෙන් ම මේ ධර්ම හයකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය (පූජාවන්ට සුදුසු) වේ, පාහුණෙය්‍ය (අමුත්තන්ට දීමට සුදුසු) වේ, දක්ඛිණෙය්‍ය (දකුණත් පූජාවට සුදුසු) වේ, අඤ්ජලිකරණීය (ඇඳිලි කොට වැඳීමට සුදුසු) වේ, ලෝකයාට අනුත්​තර වූ පින්කෙතක් වේ.",
      "paliTitle": "Dutiyaāhuneyyasuttaṃ",
      "englishTitle": "The Second Discourse on Worthy of Offerings",
      "sinhalaTitle": "දෙවෙනි ආහුනෙය්‍ය සූත්‍රය"
    },
    {
      "number": 3,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi chahi? Saddhindriyena, vīriyindriyena, satindriyena, samādhindriyena, paññindriyena, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Tatiyaṃ.",
      "english": "Monks, a bhikkhu endowed with six qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.\nWhich six? With the faculty of conviction, the faculty of energy, the faculty of mindfulness, the faculty of concentration, the faculty of wisdom, and through the destruction of the taints, having directly known and realized for oneself in this very life the taintless liberation of mind and liberation by wisdom, he abides therein.\nIndeed, monks, a bhikkhu endowed with these six qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.",
      "sinhala": "භික්ෂූනි, ධර්ම හයකින් යුක්ත වූ භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාගේ අනුත්තර පුණ්‍යක්‍ෂේත්‍රය වේ.\n\nකවර නම් ධර්ම හයකින්ද? ශ්‍රද්ධා ඉන්ද්‍රිය, වීර්ය ඉන්ද්‍රිය, සති ඉන්ද්‍රිය, සමාධි ඉන්ද්‍රිය, ප්‍රඥා ඉන්ද්‍රිය යන ධර්ම පස සහ, ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් ආශ්‍රව රහිත වූ චෙතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දැකිය හැකි ධර්මය තුළම තමා විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කිරීම යන ධර්මයයි.\n\nභික්ෂූනි, මේ ධර්ම හයකින් යුක්ත වූ භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාගේ අනුත්තර පුණ්‍යක්‍ෂේත්‍රය වේ.",
      "paliTitle": "Indriyasuttaṃ",
      "englishTitle": "Discourse on the Faculties",
      "sinhalaTitle": "ඉන්ද්‍රිය සූත්‍රය"
    },
    {
      "number": 4,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi chahi? Saddhābalena, vīriyabalena, satibalena, samādhibalena, paññābalena, āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Catutthaṃ.",
      "english": "Monks, a bhikkhu endowed with six qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and is an unsurpassed field of merit for the world. Which six? With the power of conviction, with the power of energy, with the power of mindfulness, with the power of concentration, with the power of wisdom, and through the destruction of the taints, having realized for oneself with direct knowledge and actualized the taintless liberation of mind and liberation through wisdom in this very life, he abides therein. Monks, a bhikkhu endowed with these six qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and is an unsurpassed field of merit for the world.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්ම හයකින් සමන්වාගත වූ භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින්කෙතක් වේ. කවර හයකින්ද?\n\nශ්‍රද්ධා බලයෙන්, වීර්ය බලයෙන්, සති බලයෙන්, සමාධි බලයෙන්, ප්‍රඥා බලයෙන්, ආසවයන්ගේ ක්ෂය කිරීමෙන් කෙලෙසුන් රහිත වූ චේතෝවිමුක්තිය සහ ප්‍රඥා විමුක්තිය මේ ආත්මභාවයෙහිම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, සාක්ෂාත් කොට, පැමිණ වාසය කරයි.\n\nභික්ෂූන් වහන්ස, මේ ධර්ම හයකින් සමන්වාගත වූ භික්ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින්කෙතක් වේ.",
      "paliTitle": "Balasuttaṃ",
      "englishTitle": "The Discourse on Strengths",
      "sinhalaTitle": "බල සූත්‍රය"
    },
    {
      "number": 5,
      "pali": "‘‘Chahi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅgantveva saṅkhaṃ gacchati. ‘‘Katamehi chahi? Idha, bhikkhave, rañño bhadro assājānīyo khamo hoti rūpānaṃ, khamo saddānaṃ, khamo gandhānaṃ, khamo rasānaṃ, khamo phoṭṭhabbānaṃ, vaṇṇasampanno ca hoti. Imehi kho, bhikkhave, chahi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅgantveva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi chahi? Idha, bhikkhave, bhikkhu khamo hoti rūpānaṃ, khamo saddānaṃ, khamo gandhānaṃ, khamo rasānaṃ, khamo phoṭṭhabbānaṃ, khamo dhammānaṃ. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Pañcamaṃ.",
      "english": "“Monks, an excellent thoroughbred horse of a king, endowed with six qualities, is worthy of a king, fit for a king’s use, and comes to be reckoned as a king’s asset. Which six? Here, monks, a king’s excellent thoroughbred horse is tolerant of sights, tolerant of sounds, tolerant of odors, tolerant of tastes, tolerant of tactile sensations, and is possessed of excellent appearance. Endowed with these six qualities, monks, a king’s excellent thoroughbred horse is worthy of a king, fit for a king’s use, and comes to be reckoned as a king’s asset.\n\n“Even so, monks, a monk endowed with six qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world. Which six? Here, monks, a monk is tolerant of sights, tolerant of sounds, tolerant of odors, tolerant of tastes, tolerant of tactile sensations, and tolerant of mental phenomena. Endowed with these six qualities, monks, a monk is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world.”",
      "sinhala": "භික්‍ෂූණි, අංග සයකින් යුක්ත වූ රජුගේ භද්‍ර අශ්වාජානීයයා රජුට සුදුසු වේ, රජුට භුක්ති විඳීමට සුදුසු වේ, රජුගේ වස්තුවක් ලෙසම ගණන් ගැනේ.\n\nඒ කවර සයක්ද? භික්‍ෂූණි, මෙහිලා රජුගේ භද්‍ර අශ්වාජානීයයා රූපයන්ට ක‍්‍ෂම වේ, ශබ්දයන්ට ක‍්‍ෂම වේ, ගන්ධයන්ට ක‍්‍ෂම වේ, රසයන්ට ක‍්‍ෂම වේ, ස්පර්ශයන්ට ක‍්‍ෂම වේ, වර්ණ සම්පන්නද වේ. භික්‍ෂූණි, මේ අංග සයෙන් යුක්ත වූ රජුගේ භද්‍ර අශ්වාජානීයයා රජුට සුදුසු වේ, රජුට භුක්ති විඳීමට සුදුසු වේ, රජුගේ වස්තුවක් ලෙසම ගණන් ගැනේ.\n\nඑලෙසින්ම, භික්‍ෂූණි, ධර‍්ම සයකින් යුක්ත වූ භික්‍ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය‍්‍ය වේ, අඤ‍්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ.\n\nඒ කවර සයක්ද? භික්‍ෂූණි, මෙහිලා භික්‍ෂුවක් රූපයන්ට ක‍්‍ෂම වේ, ශබ්දයන්ට ක‍්‍ෂම වේ, ගන්ධයන්ට ක‍්‍ෂම වේ, රසයන්ට ක‍්‍ෂම වේ, ස්පර්ශයන්ට ක‍්‍ෂම වේ, ධර‍්මයන්ට ක‍්‍ෂම වේ. භික්‍ෂූණි, මේ ධර‍්ම සයෙන් යුක්ත වූ භික්‍ෂුවක් ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය‍්‍ය වේ, අඤ‍්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ.",
      "paliTitle": "Paṭhamaājānīyasuttaṃ",
      "englishTitle": "The First Thoroughbred Discourse",
      "sinhalaTitle": "පඨමාජානීය සූත්‍රය"
    },
    {
      "number": 6,
      "pali": "‘‘Chahi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅgantveva saṅkhaṃ gacchati. Katamehi chahi? Idha, bhikkhave, rañño bhadro assājānīyo khamo hoti rūpānaṃ, khamo saddānaṃ, khamo gandhānaṃ, khamo rasānaṃ, khamo phoṭṭhabbānaṃ, balasampanno ca hoti. Imehi kho, bhikkhave, chahi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅgantveva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi chahi? Idha, bhikkhave, bhikkhu khamo hoti rūpānaṃ …pe… khamo dhammānaṃ. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, a king’s excellent thoroughbred horse, endowed with six qualities, is worthy of a king, fit for a king’s use, and is reckoned as a king’s asset. Which six? Here, bhikkhus, a king’s excellent thoroughbred horse endures forms, endures sounds, endures odors, endures flavors, endures tactile sensations, and is endowed with strength. Indeed, bhikkhus, a king’s excellent thoroughbred horse, endowed with these six qualities, is worthy of a king, fit for a king’s use, and is reckoned as a king’s asset.\n\nIn the same way, bhikkhus, a bhikkhu endowed with six qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world. Which six? Here, bhikkhus, a bhikkhu endures forms, endures sounds, endures odors, endures flavors, endures tactile sensations, endures mental phenomena. Indeed, bhikkhus, a bhikkhu endowed with these six qualities is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence, an unsurpassed field of merit for the world.",
      "sinhala": "භික්ෂූනි, අංග සයකින් සමන්වාගත වූ රජුගේ භද්‍ර වූ අශ්වාජානීය අශ්වයා රජුට සුදුසු වේ, රජුට භෝග්‍ය වේ, රජුගේ අංගයක් ලෙසම ගණන් ගැනේ. කවර සයකින්ද? භික්ෂූනි, මෙහි රජුගේ භද්‍ර වූ අශ්වාජානීය අශ්වයා රූපයන් ඉවසා වදාරයි, ශබ්දයන් ඉවසා වදාරයි, ගන්ධයන් ඉවසා වදාරයි, රසයන් ඉවසා වදාරයි, ඵොට්ඨබ්බයන් ඉවසා වදාරයි, බලසම්පන්න ද වේ. භික්ෂූනි, මේ අංග සයකින් සමන්වාගත වූ රජුගේ භද්‍ර වූ අශ්වාජානීය අශ්වයා රජුට සුදුසු වේ, රජුට භෝග්‍ය වේ, රජුගේ අංගයක් ලෙසම ගණන් ගැනේ.\n\nභික්ෂූනි, එලෙසින්ම ධර්ම සයකින් සමන්වාගත වූ භික්ෂුව ආහුණෙය වේ, පාහුණෙය වේ, දක්ඛිණෙය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ. කවර සයකින්ද? භික්ෂූනි, මෙහි භික්ෂුව රූපයන් ඉවසා වදාරයි, ශබ්දයන් ඉවසා වදාරයි, ගන්ධයන් ඉවසා වදාරයි, රසයන් ඉවසා වදාරයි, ඵොට්ඨබ්බයන් ඉවසා වදාරයි, ධර්මයන් ඉවසා වදාරයි. භික්ෂූනි, මේ ධර්ම සයකින් සමන්වාගත වූ භික්ෂුව ආහුණෙය වේ, පාහුණෙය වේ, දක්ඛිණෙය වේ, අඤ්ජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින් කෙතක් වේ.",
      "paliTitle": "Dutiyaājānīyasuttaṃ",
      "englishTitle": "The Second Thoroughbred Discourse",
      "sinhalaTitle": "දෙවෙනි ආජානීය සූත්‍රය"
    },
    {
      "number": 7,
      "pali": "‘‘Chahi, bhikkhave, aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅgantveva saṅkhaṃ gacchati. Katamehi chahi? Idha, bhikkhave, rañño bhadro assājānīyo khamo hoti rūpānaṃ, khamo saddānaṃ, khamo gandhānaṃ, khamo rasānaṃ, khamo phoṭṭhabbānaṃ, javasampanno ca hoti. Imehi kho, bhikkhave, chahi aṅgehi samannāgato rañño bhadro assājānīyo rājāraho hoti rājabhoggo, rañño aṅgantveva saṅkhaṃ gacchati. ‘‘Evamevaṃ kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassa. Katamehi chahi? Idha, bhikkhave, bhikkhu khamo hoti rūpānaṃ… pe… khamo dhammānaṃ. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Sattamaṃ.",
      "english": "Monks, a king’s fine thoroughbred horse, endowed with six qualities, is fit for a king, worthy of royal use, and is reckoned as an asset of the king. Which six? Here, monks, a king’s fine thoroughbred horse is patient with sights, patient with sounds, patient with smells, patient with tastes, patient with tactile sensations, and is endowed with swiftness. Indeed, monks, a king’s fine thoroughbred horse, endowed with these six qualities, is fit for a king, worthy of royal use, and is reckoned as an asset of the king.\n\nIn the same way, monks, a monk endowed with six qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world. Which six? Here, monks, a monk is patient with sights, patient with sounds, patient with smells, patient with tastes, patient with tactile sensations, and patient with mental phenomena. Indeed, monks, a monk endowed with these six qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.",
      "sinhala": "භික්ෂූණි, අංග හයකින් යුක්ත වූ රජුගේ උසස් පුහුණු අශ්වයා රජුට සුදුසු වේ, රජුගේ පරිභෝජනයට සුදුසු වේ, රජුගේ සම්පතක් ලෙසම ගණන් ගැනේ. ඒ අංග හය කවරේද? භික්ෂූණි, මෙහිලා රජුගේ උසස් පුහුණු අශ්වයා රූපයන්ට ඉවසීමෙන් යුක්ත වේ, ශබ්දයන්ට ඉවසීමෙන් යුක්ත වේ, ගන්ධයන්ට ඉවසීමෙන් යුක්ත වේ, රසයන්ට ඉවසීමෙන් යුක්ත වේ, ස්පර්ශයන්ට ඉවසීමෙන් යුක්ත වේ, තවද වේග සම්පන්න ද වේ. භික්ෂූණි, මේ අංග හයෙන් යුක්ත වූ රජුගේ උසස් පුහුණු අශ්වයා රජුට සුදුසු වේ, රජුගේ පරිභෝජනයට සුදුසු වේ, රජුගේ සම්පතක් ලෙසම ගණන් ගැනේ.\n\nභික්ෂූණි, එපරිද්දෙන්ම ධර්ම හයකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණී වේ, ලෝකයාට නිරුත්තර වූ පින්කෙතක් වේ. ඒ ධර්ම හය කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව රූපයන්ට ඉවසීමෙන් යුක්ත වේ, ශබ්දයන්ට ඉවසීමෙන් යුක්ත වේ, ගන්ධයන්ට ඉවසීමෙන් යුක්ත වේ, රසයන්ට ඉවසීමෙන් යුක්ත වේ, ස්පර්ශයන්ට ඉවසීමෙන් යුක්ත වේ, ධර්මයන්ට ඉවසීමෙන් යුක්ත වේ. භික්ෂූණි, මේ ධර්ම හයෙන් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය වේ, පාහුණෙය්‍ය වේ, දක්ඛිණෙය්‍ය වේ, අඤ්ජලිකරණී වේ, ලෝකයාට නිරුත්තර වූ පින්කෙතක් වේ.",
      "paliTitle": "Tatiyaājānīyasuttaṃ",
      "englishTitle": "The Third Noble Steed Discourse",
      "sinhalaTitle": "තතියාජානීය සූත්‍රය"
    },
    {
      "number": 8,
      "pali": "[dī. ni. 3.327] ‘‘Chayimāni, bhikkhave, anuttariyāni. Katamāni cha? Dassanānuttariyaṃ, savanānuttariyaṃ, lābhānuttariyaṃ, sikkhānuttariyaṃ, pāricariyānuttariyaṃ, anussatānuttariyaṃ – imāni kho, bhikkhave, cha anuttariyānī’’ti. Aṭṭhamaṃ.",
      "english": "Monastics, there are these six unsurpassed things. Which six? The unsurpassed seeing, the unsurpassed hearing, the unsurpassed gain, the unsurpassed training, the unsurpassed service, and the unsurpassed recollection – these, monastics, are the six unsurpassed things.",
      "sinhala": "භික්ෂූනි, මේවා සය අනුත්තරියෝ ය. කවර සයක්ද? දැකීමෙහි අනුත්තරිය, ශ්‍ර‍‌වණයෙහි අනුත්තරිය, ලාභයෙහි අනුත්තරිය, ශික්ෂාවෙහි අනුත්තරිය, උපස්ථානයෙහි අනුත්තරිය, අනුස්සතියෙහි අනුත්තරිය – භික්ෂූනි, මේවා සය අනුත්තරියෝ ය.",
      "paliTitle": "Anuttariyasuttaṃ",
      "englishTitle": "The Discourse on the Supreme",
      "sinhalaTitle": "අනුත්තරිය සූත්‍රය"
    },
    {
      "number": 9,
      "pali": "[dī. ni. 3.327] ‘‘Chayimāni, bhikkhave, anussatiṭṭhānāni. Katamāni cha? Buddhānussati, dhammānussati, saṅghānussati, sīlānussati, cāgānussati, devatānussati – imāni kho, bhikkhave, cha anussatiṭṭhānānī’’ti. Navamaṃ.",
      "english": "Monks, there are these six grounds for recollection. Which six? The recollection of the Buddha, the recollection of the Dhamma, the recollection of the Saṅgha, the recollection of one's own virtuous conduct, the recollection of one's own generosity, and the recollection of devas – these, monks, are the six grounds for recollection.",
      "sinhala": "මහණෙනි, මේ අනුස්සතිස්ථාන සයකි. ඒ සය කවරවාහුද? බුද්ධානුස්සතිය, ධම්මානුස්සතිය, සංඝානුස්සතිය, සීලානුස්සතිය, චාගානුස්සතිය, දේවතානුස්සතිය. මහණෙනි, ඇත්තෙන්ම මේ අනුස්සතිස්ථාන සය වේ.",
      "paliTitle": "Anussatiṭṭhānasuttaṃ",
      "englishTitle": "Mindfulness Foundations Discourse",
      "sinhalaTitle": "අනුස්සතිට්ඨාන සූත්‍රය"
    },
    {
      "number": 10,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Atha kho mahānāmo sakko yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno, kho mahānāmo sakko bhagavantaṃ etadavoca – ‘‘yo so, bhante, ariyasāvako āgataphalo viññātasāsano, so katamena vihārena bahulaṃ viharatī’’ti? ‘‘Yo so, mahānāma, ariyasāvako āgataphalo viññātasāsano, so iminā vihārena bahulaṃ viharati. [a. ni. 11.11] Idha, mahānāma, ariyasāvako tathāgataṃ anussarati – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Yasmiṃ, mahānāma, samaye ariyasāvako tathāgataṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti tathāgataṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma – ‘ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotaṃ samāpanno buddhānussatiṃ bhāveti’’’. ‘‘Puna caparaṃ, mahānāma, ariyasāvako dhammaṃ anussarati – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Yasmiṃ, mahānāma, samaye ariyasāvako dhammaṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti dhammaṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhita pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma – ‘ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotaṃ samāpanno dhammānussatiṃ bhāveti’’’. ‘‘Puna caparaṃ, mahānāma, ariyasāvako saṅghaṃ anussarati – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Yasmiṃ, mahānāma, samaye ariyasāvako saṅghaṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti saṅghaṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma – ‘ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotaṃ samāpanno saṅghānussatiṃ bhāveti’’’. ‘‘Puna caparaṃ, mahānāma, ariyasāvako attano sīlāni anussarati akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni. Yasmiṃ, mahānāma, samaye ariyasāvako sīlaṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti sīlaṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma – ‘ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotaṃ samāpanno sīlānussatiṃ bhāveti’’’. ‘‘Puna caparaṃ, mahānāma, ariyasāvako attano cāgaṃ anussarati – ‘lābhā vata me, suladdhaṃ vata me! Yohaṃ maccheramalapariyuṭṭhitāya pajāya vigatamalamaccherena cetasā agāraṃ ajjhāvasāmi muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato’ti. Yasmiṃ, mahānāma, samaye ariyasāvako cāgaṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti cāgaṃ ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma – ‘ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya pajāya abyāpajjo viharati, dhammasotaṃ samāpanno cāgānussatiṃ bhāveti’’’. ‘‘Puna caparaṃ, mahānāma, ariyasāvako devatānussatiṃ bhāveti – ‘santi devā cātumahārājikā [cātummahārājikā (sī. syā. kaṃ. pī.)], santi devā tāvatiṃsā, santi devā yāmā, santi devā tusitā, santi devā nimmānaratino, santi devā paranimmitavasavattino, santi devā brahmakāyikā, santi devā tatuttari [tatuttariṃ (sī. syā. kaṃ. pī.), taduttari (ka.) a. ni. 6.25; visuddhi. 1.162 passitabbaṃ]. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tattha upapannā [tattha uppannā (sī.), tatthūpapannā (syā. kaṃ.), tatthupapannā (a. ni. 3.71)], mayhampi tathārūpā saddhā saṃvijjati. Yathārūpena sīlena samannāgatā tā devatā ito cutā tattha upapannā, mayhampi tathārūpaṃ sīlaṃ saṃvijjati. Yathārūpena sutena samannāgatā tā devatā ito cutā tattha upapannā, mayhampi tathārūpaṃ sutaṃ saṃvijjati. Yathārūpena cāgena samannāgatā tā devatā ito cutā tattha upapannā, mayhampi tathārūpo cāgo saṃvijjati. Yathārūpāya paññāya samannāgatā tā devatā ito cutā tattha upapannā, mayhampi tathārūpā paññā saṃvijjatī’ti. Yasmiṃ, mahānāma, samaye ariyasāvako attano ca tāsañca devatānaṃ saddhañca sīlañca sutañca cāgañca paññañca anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti tā devatā ārabbha. Ujugatacitto kho pana, mahānāma, ariyasāvako labhati atthavedaṃ, labhati dhammavedaṃ, labhati dhammūpasaṃhitaṃ pāmojjaṃ. Pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vediyati, sukhino cittaṃ samādhiyati. Ayaṃ vuccati, mahānāma – ‘ariyasāvako visamagatāya pajāya samappatto viharati, sabyāpajjāya [sabyāpajjhāya… abyāpajjho (ka.)] pajāya abyāpajjo [sabyāpajjhāya… abyāpajjho (ka.)] viharati, dhammasotaṃ samāpanno devatānussatiṃ bhāveti’’’. ‘‘Yo so, mahānāma, ariyasāvako āgataphalo viññātasāsano, so iminā vihārena bahulaṃ viharatī’’ti. Dasamaṃ. ",
      "english": "On one occasion, the Blessed One was staying among the Sakyans, in Kapilavatthu, at the Nigrodha Park. Then Mahānāma the Sakyan approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, Mahānāma the Sakyan said to the Blessed One, \"Venerable sir, what kind of dwelling does that noble disciple frequently abide in, who has attained the fruit of stream-entry and understood the teaching?\" \"Mahānāma, the noble disciple who has attained the fruit and understood the teaching frequently abides in this dwelling.\n\nHere, Mahānāma, a noble disciple recollects the Tathāgata: 'Indeed, the Blessed One is an Arahant, a Fully Enlightened One, endowed with knowledge and conduct, a Fortunate One, knower of the world, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.' At whatever time, Mahānāma, a noble disciple recollects the Tathāgata, at that time their mind is not overcome by lust, not overcome by hatred, not overcome by delusion; at that time their mind is made straight by focusing on the Tathāgata.\n\nWhen their mind is straight, Mahānāma, the noble disciple gains profound understanding of the goal, gains profound understanding of the Dhamma, and gains joy associated with the Dhamma. Being joyful, rapture arises in them; with a rapturous mind, their body becomes calm; with a calm body, they experience happiness; being happy, their mind becomes concentrated. This, Mahānāma, is said of the noble disciple: 'They abide having attained equality among an unequal generation; they abide free from affliction among an afflicted generation; they have entered the stream of Dhamma and cultivate recollection of the Buddha.'\n\nFurthermore, Mahānāma, a noble disciple recollects the Dhamma: 'The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.' At whatever time, Mahānāma, a noble disciple recollects the Dhamma, at that time their mind is not overcome by lust, not overcome by hatred, not overcome by delusion; at that time their mind is made straight by focusing on the Dhamma.\n\nWhen their mind is straight, Mahānāma, the noble disciple gains profound understanding of the goal, gains profound understanding of the Dhamma, and gains joy associated with the Dhamma. Being joyful, rapture arises in them; with a rapturous mind, their body becomes calm; with a calm body, they experience happiness; being happy, their mind becomes concentrated. This, Mahānāma, is said of the noble disciple: 'They abide having attained equality among an unequal generation; they abide free from affliction among an afflicted generation; they have entered the stream of Dhamma and cultivate recollection of the Dhamma.'\n\nFurthermore, Mahānāma, a noble disciple recollects the Saṅgha: 'The Saṅgha of the Blessed One's disciples is practicing the good way; practicing the straight way; practicing the methodical way; practicing the proper way; that is, the four pairs of persons, the eight individual noble ones – this Saṅgha of the Blessed One's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.' At whatever time, Mahānāma, a noble disciple recollects the Saṅgha, at that time their mind is not overcome by lust, not overcome by hatred, not overcome by delusion; at that time their mind is made straight by focusing on the Saṅgha.\n\nWhen their mind is straight, Mahānāma, the noble disciple gains profound understanding of the goal, gains profound understanding of the Dhamma, and gains joy associated with the Dhamma. Being joyful, rapture arises in them; with a rapturous mind, their body becomes calm; with a calm body, they experience happiness; being happy, their mind becomes concentrated. This, Mahānāma, is said of the noble disciple: 'They abide having attained equality among an unequal generation; they abide free from affliction among an afflicted generation; they have entered the stream of Dhamma and cultivate recollection of the Saṅgha.'\n\nFurthermore, Mahānāma, a noble disciple recollects their own virtues, which are unbroken, untorn, unblemished, unblotched, freeing, praised by the wise, ungrasped, and conducive to concentration. At whatever time, Mahānāma, a noble disciple recollects their own virtue, at that time their mind is not overcome by lust, not overcome by hatred, not overcome by delusion; at that time their mind is made straight by focusing on their virtue.\n\nWhen their mind is straight, Mahānāma, the noble disciple gains profound understanding of the goal, gains profound understanding of the Dhamma, and gains joy associated with the Dhamma. Being joyful, rapture arises in them; with a rapturous mind, their body becomes calm; with a calm body, they experience happiness; being happy, their mind becomes concentrated. This, Mahānāma, is said of the noble disciple: 'They abide having attained equality among an unequal generation; they abide free from affliction among an afflicted generation; they have entered the stream of Dhamma and cultivate recollection of their virtue.'\n\nFurthermore, Mahānāma, a noble disciple recollects their own generosity: 'It is truly a gain for me, it is truly well-gained for me!'\n\nI, dwelling in a home among people overwhelmed by the defilement of stinginess, remain with a mind free from the defilement of stinginess, free in giving, with open hands, delighting in relinquishing, responsive to requests, and delighting in the sharing of gifts. At such a time, Mahānāma, when a noble disciple recollects generosity, his mind is not beset by greed, his mind is not beset by hatred, nor is his mind beset by delusion; rather, his mind is straightened out and directed towards generosity. Indeed, Mahānāma, a noble disciple whose mind is thus straightened out gains insight into the goal, gains insight into the Dhamma, and gains joy connected with the Dhamma. To one who is joyful, rapture arises; to one with a rapturous mind, the body becomes tranquil; to one whose body is tranquil, happiness is experienced; to one who is happy, the mind becomes concentrated. This, Mahānāma, is called a noble disciple who dwells in harmony among a disharmonious populace, who dwells free from affliction among an afflicted populace, and having entered the stream of Dhamma, cultivates the recollection of generosity.\n\nFurthermore, Mahānāma, a noble disciple cultivates the recollection of the devas, thinking: 'There are devas of the Four Great Kings; there are devas of the Thirty-three; there are Yāma devas; there are Tusita devas; there are Nimmanarati devas; there are Paranimmitavasavatti devas; there are devas of Brahmā's retinue; and there are devas superior to them. With such faith endowed, those devas, having passed away from here, were reborn there; such faith also exists in me. With such virtue endowed, those devas, having passed away from here, were reborn there; such virtue also exists in me. With such learning endowed, those devas, having passed away from here, were reborn there; such learning also exists in me. With such generosity endowed, those devas, having passed away from here, were reborn there; such generosity also exists in me. With such wisdom endowed, those devas, having passed away from here, were reborn there; such wisdom also exists in me.' At such a time, Mahānāma, when a noble disciple recollects his own faith, virtue, learning, generosity, and wisdom, as well as those of the devas, his mind is not beset by greed, his mind is not beset by hatred, nor is his mind beset by delusion; rather, his mind is straightened out and directed towards those devas. Indeed, Mahānāma, a noble disciple whose mind is thus straightened out gains insight into the goal, gains insight into the Dhamma, and gains joy connected with the Dhamma. To one who is joyful, rapture arises; to one with a rapturous mind, the body becomes tranquil; to one whose body is tranquil, happiness is experienced; to one who is happy, the mind becomes concentrated. This, Mahānāma, is called a noble disciple who dwells in harmony among a disharmonious populace, who dwells free from affliction among an afflicted populace, and having entered the stream of Dhamma, cultivates the recollection of the devas.\n\nThat noble disciple, Mahānāma, who has attained the fruit of stream-entry and understood the teaching, dwells predominantly in this abiding.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ශාක්‍ය දේශයෙහි කපිලවස්තු නුවර නිග්‍රෝධාරාමයෙහි වැඩවසන සේක. එකල්හි මහානාම ශාක්‍යයාණෝ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙකින් වැඩහුන්හ. එක් පසෙක වැඩහුන් මහානාම ශාක්‍යයාණෝ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: \"වහන්ස, යම් අරියශ්‍රාවකයෙක් (මාර්ග) ඵලයට පැමිණ, ශාසනය (නිවන) අවබෝධ කරගෙන සිටී ද, හෙතෙම බොහෝකොට කවර විහරණයකින් වාසය කරයි ද?\" \"මහානාමය, යම් අරියශ්‍රාවකයෙක් (මාර්ග) ඵලයට පැමිණ, ශාසනය (නිවන) අවබෝධ කරගෙන සිටී ද, හෙතෙම බොහෝකොට මේ විහරණයෙන් වාසය කරයි. මහානාමය, මෙහිලා අරියශ්‍රාවකයා තථාගතයන් වහන්සේ අනුස්මරණය කරයි: 'ඒ භාග්‍යවතුන් වහන්සේ අරහං (සියලු කෙලෙසුන්ගෙන් දුරු වූ), සම්මාසම්බුද්ධ (නිරුත්තර සම්‍යක් සම්බුද්ධ), විජ්ජාචරණසම්පන්න (විද්‍යා හා චරණ ධර්මයෙන් යුක්ත වූ), සුගත (යහපත් ගමනක් ඇති), ලෝකවිදූ (ලෝකය අවබෝධ කළ), අනුත්තරෝ පුරිසදම්මසාරථී (පුරුෂයන් දමනය කිරීමෙහි අනුත්තර වූ සාරථී), සත්ථා දේවමනුස්සානං (දෙවිමිනිසුන්ට ශාස්තෘ වූ), බුද්ධ (සියලු කෙලෙසුන් නසා අවබෝධ කළ), භගවා (සියලු භාග්‍යයන්ගෙන් යුක්ත වූ) සේකැ'යි. මහානාමය, යම් සමයෙක අරියශ්‍රාවකයා තථාගතයන් වහන්සේ අනුස්මරණය කරයි ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි, ද්වේෂයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි, මෝහයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි; ඒ සමයෙහි තථාගතයන් වහන්සේ අරභයා ඔහුගේ සිත සෘජු බවට, සන්සුන් බවට පත්වෙයි. මහානාමය, සෘජු බවට පත්වූ සිතක් ඇති අරියශ්‍රාවකයා අර්ථය (නිවන) පිළිබඳ ප්‍රමෝදය ලබයි, ධර්මය පිළිබඳ ප්‍රමෝදය ලබයි, ධර්මයට අනුව උපන් ප්‍රමෝදය ලබයි. ප්‍රමුදිත වූ ඔහුට ප්‍රීතිය උපදියි, ප්‍රීතියෙන් යුක්ත සිතක් ඇත්තාගේ කය සංහිඳෙයි, සංහිඳුණු කයක් ඇත්තා සුඛය විඳියි, සුඛිත වූ සිත සම්‍යක් සමාධියට පත්වෙයි. මහානාමය, මේ (භාවනාව) මෙසේ කියනු ලැබේ: 'අරියශ්‍රාවකයා විෂම ගමන් ඇති (නොමග ගිය) සත්ව ප්‍රජාව අතර සමත්ව (සෘජු මාර්ගයට පැමිණ) වාසය කරයි, ව්‍යාපාදයෙන් යුත් සත්ව ප්‍රජාව අතර අව්‍යාපාදයෙන් වාසය කරයි, ධර්ම ධාරාවට පැමිණ බුද්ධානුස්සතිය වඩයි.'\n\nතවද මහානාමය, අරියශ්‍රාවකයා ධර්මය අනුස්මරණය කරයි: 'භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත (මැනවින් දේශනා කරන ලද) වූ ධර්මය, සන්දිට්ඨික (තමා විසින්ම දැකිය හැකි), අකාලික (කල් නොගොස් විපාක දෙන), ඒහිපස්සික (එව, බලව යැයි පැවසිය හැකි), ඕපනයික (තමා වෙත පමුණුවා ගත හැකි), පච්චත්තං වේදිතබ්බෝ විඤ්ඤූහී (ප්‍රඥාවන්තයන් විසින් තමා තුළින්ම අත්දැකිය යුතු) වේ' යි. මහානාමය, යම් සමයෙක අරියශ්‍රාවකයා ධර්මය අනුස්මරණය කරයි ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි, ද්වේෂයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි, මෝහයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි; ඒ සමයෙහි ධර්මය අරභයා ඔහුගේ සිත සෘජු බවට පත්වෙයි. මහානාමය, සෘජු බවට පත්වූ සිතක් ඇති අරියශ්‍රාවකයා අර්ථය පිළිබඳ ප්‍රමෝදය ලබයි, ධර්මය පිළිබඳ ප්‍රමෝදය ලබයි, ධර්මයට අනුව උපන් ප්‍රමෝදය ලබයි. ප්‍රමුදිත වූ ඔහුට ප්‍රීතිය උපදියි, ප්‍රීතියෙන් යුක්ත සිතක් ඇත්තාගේ කය සංහිඳෙයි, සංහිඳුණු කයක් ඇත්තා සුඛය විඳියි, සුඛිත වූ සිත සම්‍යක් සමාධියට පත්වෙයි. මහානාමය, මේ (භාවනාව) මෙසේ කියනු ලැබේ: 'අරියශ්‍රාවකයා විෂම ගමන් ඇති සත්ව ප්‍රජාව අතර සමත්ව වාසය කරයි, ව්‍යාපාදයෙන් යුත් සත්ව ප්‍රජාව අතර අව්‍යාපාදයෙන් වාසය කරයි, ධර්ම ධාරාවට පැමිණ ධම්මානුස්සතිය වඩයි.'\n\nතවද මහානාමය, අරියශ්‍රාවකයා සංඝයා අනුස්මරණය කරයි: 'භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා සුපටිපන්න (මැනවින් පිළිපන්), උජුපටිපන්න (ඍජුව පිළිපන්), ඤායපටිපන්න (නිවනට මඟ පමුණුවන දහමෙහි පිළිපන්), සාමීචිපටිපන්න (ගරු සරු ඇතිව පිළිපන්) වන සේක. එනම්, සතර පුරුෂ යුගලයක් වූ, අට මහා පුරුෂ පුද්ගලයන්ගෙන් යුත් ඒ භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ආහුනෙය්‍ය (දුර සිට ගෙනැවිත් දිය යුතු දන් ලැබීමට සුදුසු), පාහුනෙය්‍ය (ආගන්තුක සත්කාර ලැබීමට සුදුසු), දක්ඛිණෙය්‍ය (දක්ෂිණා දීමට සුදුසු), අඤ්ජලිකරණීය (ඇඳිලි බැඳ වඳින්නට සුදුසු), ලෝකයාගේ අනුත්තර පුණ්‍යක්ෂේත්‍රය (උතුම්ම පින්කෙත) වන සේකැ'යි. මහානාමය, යම් සමයෙක අරියශ්‍රාවකයා සංඝයා අනුස්මරණය කරයි ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි, ද්වේෂයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි, මෝහයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි; ඒ සමයෙහි සංඝයා අරභයා ඔහුගේ සිත සෘජු බවට පත්වෙයි. මහානාමය, සෘජු බවට පත්වූ සිතක් ඇති අරියශ්‍රාවකයා අර්ථය පිළිබඳ ප්‍රමෝදය ලබයි, ධර්මය පිළිබඳ ප්‍රමෝදය ලබයි, ධර්මයට අනුව උපන් ප්‍රමෝදය ලබයි. ප්‍රමුදිත වූ ඔහුට ප්‍රීතිය උපදියි, ප්‍රීතියෙන් යුක්ත සිතක් ඇත්තාගේ කය සංහිඳෙයි, සංහිඳුණු කයක් ඇත්තා සුඛය විඳියි, සුඛිත වූ සිත සම්‍යක් සමාධියට පත්වෙයි. මහානාමය, මේ (භාවනාව) මෙසේ කියනු ලැබේ: 'අරියශ්‍රාවකයා විෂම ගමන් ඇති සත්ව ප්‍රජාව අතර සමත්ව වාසය කරයි, ව්‍යාපාදයෙන් යුත් සත්ව ප්‍රජාව අතර අව්‍යාපාදයෙන් වාසය කරයි, ධර්ම ධාරාවට පැමිණ සංඝානුස්සතිය වඩයි.'\n\nතවද මහානාමය, අරියශ්‍රාවකයා තමාගේ ශීලය අනුස්මරණය කරයි: (ඒ ශීලය) අඛණ්ඩ (නොබිඳුණු), අච්ඡිද්ද (සිදුරු නොවුණු), අසබල (කැලැල් නොමැති), අකම්මාස (කළු පැල්ලම් නොමැති), භුජිස්ස (නිදහස් වූ), විඤ්ඤුප්පසත්ථ (ප්‍රඥාවන්තයන් විසින් ප්‍රශංසා කරන ලද), අපරාමට්ඨ (තෘෂ්ණාවෙන් නොඇලුනු), සමාධි සංවත්තනික (සමාධිය පිණිස පවත්නා) වේ යි. මහානාමය, යම් සමයෙක අරියශ්‍රාවකයා ශීලය අනුස්මරණය කරයි ද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි, ද්වේෂයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි, මෝහයෙන් පිරිහෙලනු ලැබූ සිතක් නොවෙයි; ඒ සමයෙහි ශීලය අරභයා ඔහුගේ සිත සෘජු බවට පත්වෙයි. මහානාමය, සෘජු බවට පත්වූ සිතක් ඇති අරියශ්‍රාවකයා අර්ථය පිළිබඳ ප්‍රමෝදය ලබයි, ධර්මය පිළිබඳ ප්‍රමෝදය ලබයි, ධර්මයට අනුව උපන් ප්‍රමෝදය ලබයි. ප්‍රමුදිත වූ ඔහුට ප්‍රීතිය උපදියි, ප්‍රීතියෙන් යුක්ත සිතක් ඇත්තාගේ කය සංහිඳෙයි, සංහිඳුණු කයක් ඇත්තා සුඛය විඳියි, සුඛිත වූ සිත සම්‍යක් සමාධියට පත්වෙයි. මහානාමය, මේ (භාවනාව) මෙසේ කියනු ලැබේ: 'අරියශ්‍රාවකයා විෂම ගමන් ඇති සත්ව ප්‍රජාව අතර සමත්ව වාසය කරයි, ව්‍යාපාදයෙන් යුත් සත්ව ප්‍රජාව අතර අව්‍යාපාදයෙන් වාසය කරයි, ධර්ම ධාරාවට පැමිණ ශීලානුස්සතිය වඩයි.'\n\nතවද මහානාමය, අරියශ්‍රාවකයා තමාගේ ත්‍යාගශීලී භාවය අනුස්මරණය කරයි: 'නුදුරු අනාගතයේ උතුම් නිවනින් ලැබෙන ලාභය මට ලැබීම සැබැවින්ම භාග්‍යයකි, මා ලද දෙය මැනවින් ලැබුණේය!\n\nමසුරු මලයෙන් වෙලී සිටින ප්‍රජාව අතර, මසුරු මලයෙන් පහව ගිය සිතකින්, කැමැත්තෙන් දෙන සුළු වූ, පිරිසිදු දෑත් ඇති, පරිත්‍යාගයෙහි ඇලුණු, අයැදින්නන්ට ලෙහෙසියෙන් සමීප විය හැකි, දන් බෙදා දීමෙහි ඇලුණු මම ගිහි ගෙය වාසය කරමි යනුවෙන් ආර්ය ශ්‍රාවකයා දානය සිහි කරයි. මහානාම, යම් කලක ආර්ය ශ්‍රාවකයා දානය සිහි කරයිද, ඒ කල ඔහුට රාගයෙන් වෙලී ගිය සිතක් නොවේ, ද්වේෂයෙන් වෙලී ගිය සිතක් නොවේ, මෝහයෙන් වෙලී ගිය සිතක් නොවේ; ඒ කල ඔහුගේ සිත දානය අරභයා සෘජු බවට පැමිණෙන්නේමය. මහානාම, සෘජු බවට පැමිණි සිතක් ඇති ආර්ය ශ්‍රාවකයා අර්ථය පිළිබඳ දැනීම ලබයි, ධර්මය පිළිබඳ දැනීම ලබයි, ධර්මය හා සම්බන්ධ ප්‍රීතිය ලබයි. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය උපදී, ප්‍රීතිමත් වූ තැනැත්තාගේ කය සංහිඳෙයි, සංහිඳුණු කය ඇති තැනැත්තා සුවය විඳියි, සුවපත් වූ තැනැත්තාගේ සිත සමාධිමත් වෙයි. මහානාම, මෙය කියනු ලැබේ – ‘ආර්ය ශ්‍රාවකයා විෂමත්වයට පැමිණි ප්‍රජාව අතර සමත්ව වාසය කරයි, ව්‍යාබාධ සහිත ප්‍රජාව අතර ව්‍යාබාධ රහිතව වාසය කරයි, ධර්ම ධාරාවට පිවිසියේය, දාන අනුස්සතිය වඩයි’’’ යනුවෙන්.\n\nමහානාම, තවද, ආර්ය ශ්‍රාවකයා දෙවියන් පිළිබඳ අනුස්සතිය වඩයි – ‘චාතුම්මහාරාජික නම් දෙවිවරු වෙති, තාවතිංස නම් දෙවිවරු වෙති, යාම නම් දෙවිවරු වෙති, තුසිත නම් දෙවිවරු වෙති, නිර්මාණරති නම් දෙවිවරු වෙති, පරනිර්මිත වසවර්ති නම් දෙවිවරු වෙති, බ්‍රහ්මකායික නම් දෙවිවරු වෙති, ඒ බ්‍රහ්මකායිකයන්ටත් වඩා උසස් දෙවිවරු වෙති. යම් ආකාරයක ශ්‍රද්ධාවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එහි (දෙව්ලොව) උපන්නේද, මටද ඒ ආකාරයේ ශ්‍රද්ධාවක් ඇත. යම් ආකාරයක සීලයකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එහි උපන්නේද, මටද ඒ ආකාරයේ සීලයක් ඇත. යම් ආකාරයක ශ්‍රැතයකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එහි උපන්නේද, මටද ඒ ආකාරයේ ශ්‍රැතයක් ඇත. යම් ආකාරයක දානයකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එහි උපන්නේද, මටද ඒ ආකාරයේ දානයක් ඇත. යම් ආකාරයක ප්‍රඥාවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව එහි උපන්නේද, මටද ඒ ආකාරයේ ප්‍රඥාවක් ඇතැයි’ (දේවතානුස්සතිය වඩයි). මහානාම, යම් කලක ආර්ය ශ්‍රාවකයා තමන්ගේද ඒ දෙවිවරුන්ගේද ශ්‍රද්ධාවද, සීලයද, ශ්‍රැතයද, දානයද, ප්‍රඥාවද සිහි කරයිද, ඒ කල ඔහුට රාගයෙන් වෙලී ගිය සිතක් නොවේ, ද්වේෂයෙන් වෙලී ගිය සිතක් නොවේ, මෝහයෙන් වෙලී ගිය සිතක් නොවේ; ඒ කල ඔහුගේ සිත ඒ දෙවිවරුන් අරභයා සෘජු බවට පැමිණෙන්නේමය. මහානාම, සෘජු බවට පැමිණි සිතක් ඇති ආර්ය ශ්‍රාවකයා අර්ථය පිළිබඳ දැනීම ලබයි, ධර්මය පිළිබඳ දැනීම ලබයි, ධර්මය හා සම්බන්ධ ප්‍රීතිය ලබයි. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය උපදී, ප්‍රීතිමත් වූ තැනැත්තාගේ කය සංහිඳෙයි, සංහිඳුණු කය ඇති තැනැත්තා සුවය විඳියි, සුවපත් වූ තැනැත්තාගේ සිත සමාධිමත් වෙයි. මහානාම, මෙය කියනු ලැබේ – ‘ආර්ය ශ්‍රාවකයා විෂමත්වයට පැමිණි ප්‍රජාව අතර සමත්ව වාසය කරයි, ව්‍යාබාධ සහිත ප්‍රජාව අතර ව්‍යාබාධ රහිතව වාසය කරයි, ධර්ම ධාරාවට පිවිසියේය, දේවතානුස්සතිය වඩයි’’’ යනුවෙන්.\n\nමහානාම, යම් ඒ ආර්ය ශ්‍රාවකයා ඵලයන්ට පැමිණියේද, ශාසනය අවබෝධ කළේද, ඔහු මේ විහරණයෙන් බහුල වශයෙන් වාසය කරයි.",
      "paliTitle": "Mahānāmasuttaṃ",
      "englishTitle": "The Discourse to Mahanama",
      "sinhalaTitle": "මහානාම සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Āhuneyyavaggo paṭhamo. Tassuddānaṃ – Dve āhuneyyā indriya, balāni tayo ājānīyā; Anuttariya anussatī, mahānāmena te dasāti.",
    "english": "Āhuneyya Chapter, the First. Summary:",
    "sinhala": "ආහුනෙය්‍යවග්ගො පඨමො. තස්සුද්දානං – දෙව ආහුනෙය්‍යා ඉන්ද්‍රිය, බලානි තයො ආජානීයා; අනුත්තරිය අනුස්සති, මහානාමෙන තෙ දසාති."
  }
}