{
  "id": "an6.3",
  "title": {
    "pali": "Anuttariyavaggo",
    "english": "The Chapter on the Unsurpassed",
    "sinhala": "අනුත්තරිය වග්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati sāmagāmake pokkharaṇiyāyaṃ. Atha kho aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ pokkharaṇiyaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho sā devatā bhagavantaṃ etadavoca – ‘‘Tayome, bhante, dhammā bhikkhuno parihānāya saṃvattanti. Katame tayo? Kammārāmatā, bhassārāmatā, niddārāmatā – ime kho, bhante, tayo dhammā bhikkhuno parihānāya saṃvattantī’’ti. Idamavoca sā devatā. Samanuñño satthā ahosi. Atha kho sā devatā ‘‘samanuñño me satthā’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ pokkharaṇiyaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho, bhikkhave, sā devatā maṃ etadavoca – ‘tayome, bhante, dhammā bhikkhuno parihānāya saṃvattanti. Katame tayo? Kammārāmatā, bhassārāmatā, niddārāmatā – ime kho, bhante, tayo dhammā bhikkhuno parihānāya saṃvattantī’ti. Idamavoca, bhikkhave, sā devatā. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Tesaṃ vo [kho (ka.)], bhikkhave, alābhā tesaṃ dulladdhaṃ, ye vo devatāpi jānanti kusalehi dhammehi parihāyamāne’’. ‘‘Aparepi, bhikkhave, tayo parihāniye dhamme desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘katame ca, bhikkhave, tayo parihāniyā dhammā? Saṅgaṇikārāmatā, dovacassatā, pāpamittatā – ime kho, bhikkhave, tayo parihāniyā dhammā’’. ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ parihāyiṃsu kusalehi dhammehi, sabbete imeheva chahi dhammehi parihāyiṃsu kusalehi dhammehi. Yepi hi keci, bhikkhave, anāgatamaddhānaṃ parihāyissanti kusalehi dhammehi, sabbete imeheva chahi dhammehi parihāyissanti kusalehi dhammehi. Yepi hi keci, bhikkhave, etarahi parihāyanti kusalehi dhammehi, sabbete imeheva chahi dhammehi parihāyanti kusalehi dhammehī’’ti. Paṭhamaṃ.",
      "english": "Once the Blessed One was dwelling among the Sakyans, in Sāmagāmaka, by a lotus pond. Then, a certain deity, when the night was far advanced, with splendid radiance illuminating the entire lotus pond, approached the Blessed One. Having approached and paid homage to the Blessed One, she stood to one side. Standing to one side, that deity said to the Blessed One: \"Venerable Sir, these three things lead to a monk's decline. Which three? Delight in activity, delight in talk, and delight in sleep – these three things, Venerable Sir, lead to a monk's decline.\" That deity said this. The Teacher approved. Then that deity, thinking \"My Teacher approves,\" paid homage to the Blessed One, circumambulated him respectfully, and vanished right there.\n\nThen, when that night had passed, the Blessed One addressed the monks, saying: \"Monks, last night, when the night was far advanced, a certain deity, with splendid radiance illuminating the entire lotus pond, approached me. Having approached and paid homage to me, she stood to one side. Standing to one side, Monks, that deity said to me: 'Venerable Sir, these three things lead to a monk's decline. Which three? Delight in activity, delight in talk, and delight in sleep – these three things, Venerable Sir, lead to a monk's decline.' Monks, that deity said this. Having said this, she paid homage to me, circumambulated me respectfully, and vanished right there. Monks, it is a loss for them, it is ill-gained by them, when even deities know of their decline in wholesome states.\"\n\n\"Monks, I shall declare three other states that lead to decline. Listen to that, attend carefully; I shall speak.\" \"Yes, Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this: \"And which, Monks, are these three states that lead to decline? Delight in company, being difficult to admonish, and having evil friends – these, Monks, are the three states that lead to decline.\"\n\n\"Monks, whoever in the past declined in wholesome states, all of them declined in wholesome states by means of these six states. And whoever in the future will decline in wholesome states, all of them will decline in wholesome states by means of these six states. And whoever in the present are declining in wholesome states, all of them are declining in wholesome states by means of these six states.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ ශාක්‍ය ජනපදයේ සාමගාමක නම් ගමෙහි පොකුණක් අසල වැඩසිටියාහ. ඉක්බිති එක්තරා දෙවියෙක් අභික්‍රාන්ත රාත්‍රියෙහි, අභික්‍රාන්ත වර්ණයෙන් යුක්තව, මුළු පොකුණම ආලෝකවත් කරමින්, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව සිටියේය. එකත්පස්ව සිටි ඒ දෙවියෝ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: \"වහන්ස, මේ ධර්ම තුනක් භික්ෂුවකගේ පිරිහීමට හේතු වේ. ඒ තුන කවරේද? කර්මාන්ත කෙරෙහි ඇල්ම, කතාබහ කෙරෙහි ඇල්ම, නිද්‍රාව කෙරෙහි ඇල්ම - වහන්ස, මේ ධර්ම තුන භික්ෂුවකගේ පිරිහීමට හේතු වේ.\" ඒ දෙවියෝ මෙය පැවසූහ. ශාස්තෘන් වහන්සේ එය අනුමත කළ සේක. ඉක්බිති ඒ දෙවියෝ, \"මාගේ ශාස්තෘන් වහන්සේ අනුමත කළ සේකැ\"යි සිතා, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, ප්‍රදක්ෂිණා කර, එතැනම අතුරුදහන් වූහ.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ රාත්‍රිය අවසන් වීමෙන් පසු භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, මේ රාත්‍රියෙහි එක්තරා දෙවියෙක් අභික්‍රාන්ත රාත්‍රියෙහි, අභික්‍රාන්ත වර්ණයෙන් යුක්තව, මුළු පොකුණම ආලෝකවත් කරමින්, මා වෙත පැමිණියේය. පැමිණ මට වන්දනා කොට, එකත්පස්ව සිටියේය. මහණෙනි, එකත්පස්ව සිටි ඒ දෙවියෝ මට මෙය පැවසූහ: 'වහන්ස, මේ ධර්ම තුනක් භික්ෂුවකගේ පිරිහීමට හේතු වේ. ඒ තුන කවරේද? කර්මාන්ත කෙරෙහි ඇල්ම, කතාබහ කෙරෙහි ඇල්ම, නිද්‍රාව කෙරෙහි ඇල්ම - වහන්ස, මේ ධර්ම තුන භික්ෂුවකගේ පිරිහීමට හේතු වේ.' මහණෙනි, ඒ දෙවියෝ මෙය පැවසූහ. මෙය පවසා මට වන්දනා කොට, ප්‍රදක්ෂිණා කර, එතැනම අතුරුදහන් වූහ. මහණෙනි, යම් භික්ෂූන් කුසල ධර්මයන්ගෙන් පිරිහෙමින් සිටින බව දෙවියන් පවා දන්නේ නම්, ඒ ඔවුන්ගේ මහත් අලාභයකි, දුර්ලභ ලාභයකි.\"\n\n\"මහණෙනි, තවත් පිරිහීමට හේතු වන ධර්ම තුනක් මම දේශනා කරන්නෙමි. එය අසව්, හොඳින් මෙනෙහි කරව්; මම දේශනා කරන්නෙමි.\" \"එසේය, වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, පිරිහීමට හේතු වන ධර්ම තුන කවරේද? සමූහයන් සමඟ ඇසුරට ඇල්ම, කීමට දුෂ්කර වීම, පාපමිත්‍රයන් ඇසුරු කිරීම - මහණෙනි, මේවා පිරිහීමට හේතු වන ධර්ම තුන වේ.\"\n\n\"මහණෙනි, යම් කිසිවෙක් අතීත කාලයෙහි කුසල ධර්මයන්ගෙන් පිරිහී ගියේද, ඒ සියල්ලෝම මේ ධර්ම හයෙන්ම කුසල ධර්මයන්ගෙන් පිරිහී ගියහ. මහණෙනි, යම් කිසිවෙක් අනාගත කාලයෙහි කුසල ධර්මයන්ගෙන් පිරිහී යන්නේද, ඒ සියල්ලෝම මේ ධර්ම හයෙන්ම කුසල ධර්මයන්ගෙන් පිරිහී යන්නාහ. මහණෙනි, යම් කිසිවෙක් වර්තමාන කාලයෙහි කුසල ධර්මයන්ගෙන් පිරිහෙන්නේද, ඒ සියල්ලෝම මේ ධර්ම හයෙන්ම කුසල ධර්මයන්ගෙන් පිරිහෙන්නාහ.\"\n\nපළමු කොටස.",
      "paliTitle": "Sāmakasuttaṃ",
      "englishTitle": "Discourse of Sāmaka",
      "sinhalaTitle": "සාමක සූත්‍රය"
    },
    {
      "number": 22,
      "pali": "‘‘Chayime, bhikkhave, aparihāniye dhamme desessāmi, taṃ suṇātha…pe… katame ca, bhikkhave, cha aparihāniyā dhammā? Na kammārāmatā, na bhassārāmatā, na niddārāmatā, na saṅgaṇikārāmatā, sovacassatā, kalyāṇamittatā – ime kho, bhikkhave, cha aparihāniyā dhammā. ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ na parihāyiṃsu kusalehi dhammehi, sabbete imeheva chahi dhammehi na parihāyiṃsu kusalehi dhammehi. Yepi hi keci, bhikkhave, anāgatamaddhānaṃ na parihāyissanti kusalehi dhammehi, sabbete imeheva chahi dhammehi na parihāyissanti kusalehi dhammehi. Yepi hi keci, bhikkhave, etarahi na parihāyanti kusalehi dhammehi, sabbete imeheva chahi dhammehi na parihāyanti kusalehi dhammehī’’ti. Dutiyaṃ.",
      "english": "Monks, I will teach you these six conditions for non-decline. Listen to them. And what, monks, are these six conditions for non-decline? They are: not delighting in activity, not delighting in idle talk, not delighting in sleep, not delighting in company, being amenable to instruction, and having admirable friends. These, monks, are the six conditions for non-decline.\n\nIndeed, monks, whoever in the past did not decline in wholesome qualities, all of them did not decline in wholesome qualities by means of these same six conditions. And whoever in the future will not decline in wholesome qualities, all of them will not decline in wholesome qualities by means of these same six conditions. And whoever at present do not decline in wholesome qualities, all of them do not decline in wholesome qualities by means of these same six conditions.",
      "sinhala": "මහණෙනි, පිරිහීමට හේතු නොවන ධ‍ර්‍ම සයක් මම ඔබට දේශනා කරන්නෙමි, එය අසව්. මහණෙනි, පිරිහීමට හේතු නොවන ධ‍ර්‍ම සය කවරේද? කර්මාන්තයන්හි ඇලී නොසිටීම, වචන කතාවට ඇලී නොසිටීම, නිද්‍රාවට ඇලී නොසිටීම, සංගණිකාවට ඇලී නොසිටීම, කීකරු බව, කල්‍ය‍ාණ මිත්‍රශීලී බව – මහණෙනි, මේ ධ‍ර්‍ම සය පිරිහීමට හේතු නොවන ධ‍ර්‍ම වේ.\n\nමහණෙනි, යම් කෙනෙක් අතීත කාලයෙහි කුසල ධ‍ර්‍මයන්ගෙන් පිරිහීමට ලක් නොවූවෝද, ඔවුන් සියල්ලෝම මේ ධ‍ර්‍ම සය හේතුකොටගෙනම කුසල ධ‍ර්‍මයන්ගෙන් පිරිහීමට ලක් නොවූහ. මහණෙනි, යම් කෙනෙක් අනාගත කාලයෙහි කුසල ධ‍ර්‍මයන්ගෙන් පිරිහීමට ලක් නොවන්නාහුද, ඔවුන් සියල්ලෝම මේ ධ‍ර්‍ම සය හේතුකොටගෙනම කුසල ධ‍ර්‍මයන්ගෙන් පිරිහීමට ලක් නොවන්නාහ. මහණෙනි, යම් කෙනෙක් වර්තමාන කාලයෙහි කුසල ධ‍ර්‍මයන්ගෙන් පිරිහීමට ලක් නොවන්නාහුද, ඔවුන් සියල්ලෝම මේ ධ‍ර්‍ම සය හේතුකොටගෙනම කුසල ධ‍ර්‍මයන්ගෙන් පිරිහීමට ලක් නොවන්නාහ.",
      "paliTitle": "Aparihāniyasuttaṃ",
      "englishTitle": "Discourse on Non-Decline",
      "sinhalaTitle": "අපරිහානිය සූත්‍රය"
    },
    {
      "number": 23,
      "pali": "‘‘‘Bhaya’nti, bhikkhave, kāmānametaṃ adhivacanaṃ; ‘dukkha’nti, bhikkhave, kāmānametaṃ adhivacanaṃ; ‘rogo’ti, bhikkhave, kāmānametaṃ adhivacanaṃ; ‘gaṇḍo’ti, bhikkhave, kāmānametaṃ adhivacanaṃ; ‘saṅgo’ti, bhikkhave, kāmānametaṃ adhivacanaṃ; ‘paṅko’ti, bhikkhave, kāmānametaṃ adhivacanaṃ. ‘‘Kasmā ca, bhikkhave, ‘bhaya’nti kāmānametaṃ adhivacanaṃ? Kāmarāgarattāyaṃ, bhikkhave, chandarāgavinibaddho diṭṭhadhammikāpi bhayā na parimuccati, samparāyikāpi bhayā na parimuccati, tasmā ‘bhaya’nti kāmānametaṃ adhivacanaṃ. Kasmā ca, bhikkhave, dukkhanti…pe… rogoti… gaṇḍoti… saṅgoti… paṅkoti kāmānametaṃ adhivacanaṃ? Kāmarāgarattāyaṃ, bhikkhave, chandarāgavinibaddho diṭṭhadhammikāpi paṅkā na parimuccati, samparāyikāpi paṅkā na parimuccati, tasmā ‘paṅko’ti kāmānametaṃ adhivacana’’nti. ‘‘Bhayaṃ dukkhaṃ rogo gaṇḍo, saṅgo paṅko ca ubhayaṃ; Ete kāmā pavuccanti, yattha satto puthujjano. ‘‘Upādāne bhayaṃ disvā, jātimaraṇasambhave; Anupādā vimuccanti, jātimaraṇasaṅkhaye. ‘‘Te khemappattā sukhino, diṭṭhadhammābhinibbutā; Sabbaverabhayātītā [sabbe verabhayātītā (syā.)], sabbadukkhaṃ upaccagu’’nti. tatiyaṃ;",
      "english": "“Monks, ‘danger’ is a designation for sense-pleasures; monks, ‘suffering’ is a designation for sense-pleasures; monks, ‘disease’ is a designation for sense-pleasures; monks, ‘a boil’ is a designation for sense-pleasures; monks, ‘entanglement’ is a designation for sense-pleasures; monks, ‘mire’ is a designation for sense-pleasures.\n\nAnd why, monks, is ‘danger’ a designation for sense-pleasures? Monks, one who is infatuated by sensual passion, bound by lustful desire, is not liberated from dangers in this present life, nor is he liberated from dangers in the next life. Therefore, ‘danger’ is a designation for sense-pleasures.\n\nAnd why, monks, is ‘suffering’ a designation for sense-pleasures? Monks, one who is infatuated by sensual passion, bound by lustful desire, is not liberated from suffering in this present life, nor is he liberated from suffering in the next life. Therefore, ‘suffering’ is a designation for sense-pleasures.\n\nAnd why, monks, is ‘disease’ a designation for sense-pleasures? Monks, one who is infatuated by sensual passion, bound by lustful desire, is not liberated from disease in this present life, nor is he liberated from disease in the next life. Therefore, ‘disease’ is a designation for sense-pleasures.\n\nAnd why, monks, is ‘a boil’ a designation for sense-pleasures? Monks, one who is infatuated by sensual passion, bound by lustful desire, is not liberated from a boil in this present life, nor is he liberated from a boil in the next life. Therefore, ‘a boil’ is a designation for sense-pleasures.\n\nAnd why, monks, is ‘entanglement’ a designation for sense-pleasures? Monks, one who is infatuated by sensual passion, bound by lustful desire, is not liberated from entanglement in this present life, nor is he liberated from entanglement in the next life. Therefore, ‘entanglement’ is a designation for sense-pleasures.\n\nAnd why, monks, is ‘mire’ a designation for sense-pleasures? Monks, one who is infatuated by sensual passion, bound by lustful desire, is not liberated from the mire in this present life, nor is he liberated from the mire in the next life. Therefore, ‘mire’ is a designation for sense-pleasures.\n\nDanger, suffering, disease, a boil, entanglement, and mire in both aspects; these are what sense-pleasures are called, where the ordinary person is attached.\n\nHaving seen danger in clinging, which is the origin of birth and death, those who are without clinging are liberated with the cessation of birth and death.\n\nThey, having attained security, are happy, completely cooled in this very life; they have transcended all hostility and fear, and have gone beyond all suffering.",
      "sinhala": "මහණෙනි, ‘භය’ යනු කාමයන්ට නමෙකි. මහණෙනි, ‘දුක්’ යනු කාමයන්ට නමෙකි. මහණෙනි, ‘රෝග’ යනු කාමයන්ට නමෙකි. මහණෙනි, ‘ගැට’ යනු කාමයන්ට නමෙකි. මහණෙනි, ‘ඇලීම’ යනු කාමයන්ට නමෙකි. මහණෙනි, ‘කිලිටි’ යනු කාමයන්ට නමෙකි.\n\nමහණෙනි, ‘භය’ යනු කාමයන්ට නමක් වන්නේ කුමක් හෙයින් ද? මහණෙනි, කාමරාගයෙන් ඇලී, ඡන්දරාගයෙන් බැඳී සිටින පුද්ගලයා මේ ආත්මයේදී ද භයෙන් නොමිදෙයි. පරලොවදී ද භයෙන් නොමිදෙයි. එහෙයින්, ‘භය’ යනු කාමයන්ට නමෙකි.\n\nමහණෙනි, දුක් යනු... රෝග යනු... ගැට යනු... ඇලීම යනු... කිලිටි යනු කාමයන්ට නමක් වන්නේ කුමක් හෙයින් ද? මහණෙනි, කාමරාගයෙන් ඇලී, ඡන්දරාගයෙන් බැඳී සිටින පුද්ගලයා මේ ආත්මයේදී ද කිලිටි බවෙන් නොමිදෙයි. පරලොවදී ද කිලිටි බවෙන් නොමිදෙයි. එහෙයින්, ‘කිලිටි’ යනු කාමයන්ට නමෙකි.\n\nභය, දුක්, රෝග, ගැට, ඇලීම්, කිලිටි යන මේ දෙලොවටම අදාළ වන දෑ කාම යැයි කියනු ලැබේ. පෘථග්ජනයා ඒවාට ඇලී වාසය කරයි.\n\nඉපදීම හා මරණය ඇතිවීමට හේතු වන උපාදානයෙහි භය දැක, උපාදානයක් රහිතව ඉපදීම හා මරණය ක්ෂය කිරීමෙන් ඔවුහු මිදෙති.\n\nඔවුහු කෙලෙස් බියෙන් තොර වී, සුව ඇත්තෝ වී, මේ ආත්මයේදී ම පිරිනිවීම ලැබූවෝ වෙති. සියලු වෛරයෙන් හා භයෙන් ඉක්ම ගොස්, සියලු දුකින් එතෙර වූවෝ වෙති.",
      "paliTitle": "Bhayasuttaṃ",
      "englishTitle": "Discourse on Fear",
      "sinhalaTitle": "භය සූත්‍රය"
    },
    {
      "number": 24,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu himavantaṃ pabbatarājaṃ padāleyya, ko pana vādo chavāya avijjāya! Katamehi chahi? Idha, bhikkhave, bhikkhu samādhissa samāpattikusalo hoti, samādhissa ṭhitikusalo hoti, samādhissa vuṭṭhānakusalo hoti, samādhissa kallitakusalo [kallatākusalo (syā. kaṃ. ka.) saṃ. ni. 3.665 passitabbaṃ] hoti, samādhissa gocarakusalo hoti, samādhissa abhinīhārakusalo hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu himavantaṃ pabbatarājaṃ padāleyya, ko pana vādo chavāya avijjāyā’’ti! Catutthaṃ.",
      "english": "Monks, a bhikkhu endowed with six qualities could split apart Himavanta, the king of mountains – how much more so this trivial ignorance! Which six? Here, monks, a bhikkhu is skilled in entering concentration, skilled in maintaining it, skilled in emerging from it, skilled in making it malleable, skilled in its range, and skilled in directing it. Indeed, monks, a bhikkhu endowed with these six qualities could split apart Himavanta, the king of mountains – how much more so this trivial ignorance!",
      "sinhala": "භික්ෂූණි, ධර්ම සයකින් සමන්විත වූ භික්ෂුවක් හිමාලය පර්වත රාජයා වුවද බිඳ හෙලිය හැකියි. එසේ නම්, කෙළෙසුන් නිසා දුබල වූ අවිද්‍යාව ගැන කවර කතාද? ඒ ධර්ම සය නම් කවරේද?\n\nභික්ෂූණි, මෙහිලා භික්ෂුව සමාධියට සමවැදීමේ දක්ෂ වේ, සමාධියේ පැවැත්මෙහි දක්ෂ වේ, සමාධියෙන් නැගිටීමෙහි දක්ෂ වේ, සමාධිය කාර්යයෝචිත බවට පත්කිරීමෙහි දක්ෂ වේ, සමාධියේ විෂය පථයෙහි දක්ෂ වේ, සමාධිය මනා ලෙස යෙදීමෙහි දක්ෂ වේ.\n\nභික්ෂූණි, මේ ධර්ම සයෙන් සමන්විත වූ භික්ෂුවක් හිමාලය පර්වත රාජයා වුවද බිඳ හෙලිය හැකියි. එසේ නම්, කෙළෙසුන් නිසා දුබල වූ අවිද්‍යාව ගැන කවර කතාද?",
      "paliTitle": "Himavantasuttaṃ",
      "englishTitle": "The Himavanta Discourse",
      "sinhalaTitle": "හිමවන්ත සූත්‍රය"
    },
    {
      "number": 25,
      "pali": "‘‘Chayimāni, bhikkhave, anussatiṭṭhānāni. Katamāni cha? Idha, bhikkhave, ariyasāvako tathāgataṃ anussarati – ‘itipi so bhagavā…pe… satthā devamanussānaṃ buddho bhagavā’ti. Yasmiṃ, bhikkhave, samaye ariyasāvako tathāgataṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Idampi kho, bhikkhave, ārammaṇaṃ karitvā evamidhekacce sattā visujjhanti. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako dhammaṃ anussarati – ‘svākkhāto bhagavatā dhammo… pe… paccattaṃ veditabbo viññūhī’ti. Yasmiṃ, bhikkhave, samaye ariyasāvako dhammaṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Idampi kho, bhikkhave, ārammaṇaṃ karitvā evamidhekacce sattā visujjhanti. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako saṅghaṃ anussarati – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Yasmiṃ, bhikkhave, samaye ariyasāvako saṅghaṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Idampi kho, bhikkhave, ārammaṇaṃ karitvā evamidhekacce sattā visujjhanti. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako attano sīlāni anussarati akhaṇḍāni…pe… samādhisaṃvattanikāni. Yasmiṃ, bhikkhave, samaye ariyasāvako sīlaṃ anussarati, nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Idampi kho, bhikkhave, ārammaṇaṃ karitvā evamidhekacce sattā visujjhanti. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako attano cāgaṃ anussarati – ‘lābhā vata me! Suladdhaṃ vata me…pe… yācayogo dānasaṃvibhāgarato’ti. Yasmiṃ…pe… evamidhekacce sattā visujjhanti. ‘‘Puna caparaṃ, bhikkhave, ariyasāvako devatā anussarati – ‘santi devā cātumahārājikā, santi devā tāvatiṃsā, santi devā yāmā, santi devā tusitā, santi devā nimmānaratino, santi devā paranimmitavasavattino, santi devā brahmakāyikā, santi devā tatuttari. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tattha upapannā; mayhampi tathārūpā saddhā saṃvijjati. Yathārūpena sīlena… sutena… cāgena… paññāya samannāgatā tā devatā ito cutā tattha upapannā; mayhampi tathārūpā paññā saṃvijjatī’’’ ti. ‘‘Yasmiṃ, bhikkhave, samaye ariyasāvako attano ca tāsañca devatānaṃ saddhañca sīlañca sutañca cāgañca paññañca anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, bhikkhave, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Idampi kho, bhikkhave, ārammaṇaṃ karitvā evamidhekacce sattā visujjhanti. Imāni kho, bhikkhave, cha anussatiṭṭhānānī’’ti. Pañcamaṃ.",
      "english": "There are, monks, these six grounds for recollection. Which six?\n\nHere, monks, a noble disciple recollects the Tathāgata thus: ‘He is indeed the Blessed One, the Arahant, the Perfectly Self-Awakened One, accomplished in true knowledge and conduct, the Fortunate One, the Knower of the worlds, the unexcelled leader of persons to be tamed, the teacher of gods and humans, the Awakened One, the Blessed One.’ Monks, at whatever time a noble disciple recollects the Tathāgata, at that time their mind is not overcome by sensual passion, not overcome by ill-will, not overcome by delusion; at that time their mind is straight, released, liberated, risen above greed. Indeed, monks, 'greed' is a term for the five strands of sensual pleasure. And indeed, monks, by making this a mental object, some beings purify themselves in this way.\n\nFurthermore, monks, a noble disciple recollects the Dhamma thus: ‘The Dhamma is well-expounded by the Blessed One, visible here and now, timeless, inviting inspection, onward-leading, to be personally realized by the wise.’ Monks, at whatever time a noble disciple recollects the Dhamma, at that time their mind is not overcome by sensual passion, not overcome by ill-will, not overcome by delusion; at that time their mind is straight, released, liberated, risen above greed. Indeed, monks, 'greed' is a term for the five strands of sensual pleasure. And indeed, monks, by making this a mental object, some beings purify themselves in this way.\n\nFurthermore, monks, a noble disciple recollects the Saṅgha thus: ‘The Saṅgha of the Blessed One’s disciples is practicing the good way, practicing the straight way, practicing the judicious way, practicing the dutiful way; that is, the four pairs of persons, the eight types of individuals — this Saṅgha of the Blessed One’s disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, the unexcelled field of merit for the world.’ Monks, at whatever time a noble disciple recollects the Saṅgha, at that time their mind is not overcome by sensual passion, not overcome by ill-will, not overcome by delusion; at that time their mind is straight, released, liberated, risen above greed. Indeed, monks, 'greed' is a term for the five strands of sensual pleasure. And indeed, monks, by making this a mental object, some beings purify themselves in this way.\n\nFurthermore, monks, a noble disciple recollects their own virtues: 'unbroken, untorn, unblemished, unspotted, freeing, praised by the wise, ungrasped, conducive to concentration.' Monks, at whatever time a noble disciple recollects virtue, at that time their mind is not overcome by sensual passion, not overcome by ill-will, not overcome by delusion; at that time their mind is straight, released, liberated, risen above greed. Indeed, monks, 'greed' is a term for the five strands of sensual pleasure. And indeed, monks, by making this a mental object, some beings purify themselves in this way.\n\nFurthermore, monks, a noble disciple recollects their own generosity: 'It is a gain for me! It is a great blessing for me, that this stain of stinginess has been abandoned in me. I dwell with an open hand, with a clear mind, delighting in giving and sharing, one fit to be asked.' Monks, at whatever time a noble disciple recollects generosity, at that time their mind is not overcome by sensual passion, not overcome by ill-will, not overcome by delusion; at that time their mind is straight, released, liberated, risen above greed. Indeed, monks, 'greed' is a term for the five strands of sensual pleasure. And indeed, monks, by making this a mental object, some beings purify themselves in this way.\n\nFurthermore, monks, a noble disciple recollects the devas: 'There are devas of the Four Great Kings, there are devas of Tāvatiṃsa, there are devas of Yāma, there are devas of Tusita, there are devas who delight in creating, there are devas who control creations of others, there are devas of Brahmā's assembly, and there are devas superior to them. With such faith as those devas were endowed, having passed away from here, they were reborn there; I too possess such faith. With such virtue as those devas were endowed, having passed away from here, they were reborn there; I too possess such virtue. With such learning as those devas were endowed, having passed away from here, they were reborn there; I too possess such learning. With such generosity as those devas were endowed, having passed away from here, they were reborn there; I too possess such generosity. With such wisdom as those devas were endowed, having passed away from here, they were reborn there; I too possess such wisdom.' Monks, at whatever time a noble disciple recollects their own faith, virtue, learning, generosity, and wisdom, as well as those of the devas, at that time their mind is not overcome by sensual passion, not overcome by ill-will, not overcome by delusion; at that time their mind is straight, released, liberated, risen above greed. Indeed, monks, 'greed' is a term for the five strands of sensual pleasure. And indeed, monks, by making this a mental object, some beings purify themselves in this way.\n\nThese, monks, are the six grounds for recollection.",
      "sinhala": "මහණෙනි, මේ අනුස්සතිස්ථාන (සිහිකිරීමට කරුණු) සයකි. කවරේද ඒ සය? මහණෙනි, මෙහිලා ආර්යශ්‍රාවකයා තථාගතයන් වහන්සේ සිහි කරයි. ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මා සම්බුද්ධ, විජ්ජා චරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තර පුරිස දම්ම සාරථී, දෙවි මිනිසුන්ට ශාස්තෘ වූ, සම්බුද්ධ වූ, භාග්‍යවතුන් වහන්සේය’ කියායි. මහණෙනි, යම් සමයෙක ආර්යශ්‍රාවකයා තථාගතයන් වහන්සේ සිහි කරයිද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පෙළඹී නොපවතී. ද්වේෂයෙන් පෙළඹී නොපවතී. මෝහයෙන් පෙළඹී නොපවතී. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූයේ, මුදා හරින ලද්දේ, බැඳීම්වලින් මිදුණේ වෙයි. මහණෙනි, ‘බැඳීම’ යනු පඤ්ච කාමගුණයන්ට නමෙකි. මහණෙනි, මේ ආලම්බනය කරගෙනද මෙහිලා ඇතැම් සත්ත්වයෝ පිරිසිදු වෙති.\n\nතවද මහණෙනි, ආර්යශ්‍රාවකයා ධර්මය සිහි කරයි. ‘භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත වූ, මේ ආත්මභාවයේදීම පල දෙන, කල් නොයවා පල දෙන, ඒහිපස්සික වූ, ඕපනයික වූ, නුවණැත්තන් විසින් තමා තුළින්ම අවබෝධ කළ යුතු ධර්මයයි’ කියායි. මහණෙනි, යම් සමයෙක ආර්යශ්‍රාවකයා ධර්මය සිහි කරයිද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පෙළඹී නොපවතී. ද්වේෂයෙන් පෙළඹී නොපවතී. මෝහයෙන් පෙළඹී නොපවතී. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූයේ, මුදා හරින ලද්දේ, බැඳීම්වලින් මිදුණේ වෙයි. මහණෙනි, ‘බැඳීම’ යනු පඤ්ච කාමගුණයන්ට නමෙකි. මහණෙනි, මේ ආලම්බනය කරගෙනද මෙහිලා ඇතැම් සත්ත්වයෝ පිරිසිදු වෙති.\n\nතවද මහණෙනි, ආර්යශ්‍රාවකයා සංඝයා සිහි කරයි. ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා වහන්සේ මනා ප්‍රතිපදාවෙන් යුක්තය, ඍජු ප්‍රතිපදාවෙන් යුක්තය, ඥාය ප්‍රතිපදාවෙන් යුක්තය, සාමීචි ප්‍රතිපදාවෙන් යුක්තය. එනම් යුගල වශයෙන් සිව් දෙනාද, පුද්ගල වශයෙන් අට දෙනාද වන භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා වහන්සේ ආහුනෙය්‍ය වෙති, පාහුනෙය්‍ය වෙති, දක්ඛිණෙය්‍ය වෙති, අඤ්ජලිකරණෙය්‍ය වෙති, ලෝකයාට අනුත්තර වූ පින් කෙතය’ කියායි. මහණෙනි, යම් සමයෙක ආර්යශ්‍රාවකයා සංඝයා සිහි කරයිද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පෙළඹී නොපවතී. ද්වේෂයෙන් පෙළඹී නොපවතී. මෝහයෙන් පෙළඹී නොපවතී. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූයේ, මුදා හරින ලද්දේ, බැඳීම්වලින් මිදුණේ වෙයි. මහණෙනි, ‘බැඳීම’ යනු පඤ්ච කාමගුණයන්ට නමෙකි. මහණෙනි, මේ ආලම්බනය කරගෙනද මෙහිලා ඇතැම් සත්ත්වයෝ පිරිසිදු වෙති.\n\nතවද මහණෙනි, ආර්යශ්‍රාවකයා තමාගේ සිල් සිහි කරයි. ‘තමාගේ සිල් ඛණ්ඩ නොවූ, ඡිද්‍ර නොවූ, ශබල නොවූ, කම්මාස නොවූ, නිදහස් වූ, ප්‍රශංසනීය වූ, නුවණැත්තන් විසින් ප්‍රශංසා කරන ලද, තෘෂ්ණාවෙන් නොඇලුණු, සමාධිය පිණිස පවතින සිල්ය’ කියායි. මහණෙනි, යම් සමයෙක ආර්යශ්‍රාවකයා සිල් සිහි කරයිද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පෙළඹී නොපවතී. ද්වේෂයෙන් පෙළඹී නොපවතී. මෝහයෙන් පෙළඹී නොපවතී. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූයේ, මුදා හරින ලද්දේ, බැඳීම්වලින් මිදුණේ වෙයි. මහණෙනි, ‘බැඳීම’ යනු පඤ්ච කාමගුණයන්ට නමෙකි. මහණෙනි, මේ ආලම්බනය කරගෙනද මෙහිලා ඇතැම් සත්ත්වයෝ පිරිසිදු වෙති.\n\nතවද මහණෙනි, ආර්යශ්‍රාවකයා තමාගේ ත්‍යාගශීලී බව සිහි කරයි. ‘අහෝ, මට ලාභයකි! අහෝ, මට මනාකොට ලැබීමකි! මම මසුරු මලයෙන් පෙළුණු ලෝකයා අතර, අනුග්‍රහයෙන් තොර නොවී, ත්‍යාගශීලී සිත් ඇත්තෙක් වී, දන් බෙදා දීමට ඇලුම් කරන්නෙකැයි’ කියායි. මහණෙනි, යම් සමයෙක ආර්යශ්‍රාවකයා තමාගේ ත්‍යාගශීලී බව සිහි කරයිද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පෙළඹී නොපවතී. ද්වේෂයෙන් පෙළඹී නොපවතී. මෝහයෙන් පෙළඹී නොපවතී. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූයේ, මුදා හරින ලද්දේ, බැඳීම්වලින් මිදුණේ වෙයි. මහණෙනි, ‘බැඳීම’ යනු පඤ්ච කාමගුණයන්ට නමෙකි. මහණෙනි, මේ ආලම්බනය කරගෙනද මෙහිලා ඇතැම් සත්ත්වයෝ පිරිසිදු වෙති.\n\nතවද මහණෙනි, ආර්යශ්‍රාවකයා දෙවිවරුන් සිහි කරයි. ‘චාතුම්මහාරාජික දෙවිවරු වෙති. තාවතිංස දෙවිවරු වෙති. යාම දෙවිවරු වෙති. තුසිත දෙවිවරු වෙති. නිම්මානරති දෙවිවරු වෙති. පරනිම්මිතවසවර්ති දෙවිවරු වෙති. බ්‍රහ්මකායික දෙවිවරු වෙති. ඊට ඉහළින්ද දෙවිවරු වෙති. යම් ස්වභාවයක ශ්‍රද්ධාවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව ඒ දෙව්ලොව උපන්නාහුද, මටත් එවැනි ශ්‍රද්ධාවක් පවතී. යම් ස්වභාවයක ශීලයකින්, ශ්‍රැතයකින්, ත්‍යාගයකින්, ප්‍රඥාවකින් යුක්තව ඒ දෙවිවරු මෙලොවින් චුතව ඒ දෙව්ලොව උපන්නාහුද, මටත් එවැනි ශීලයක්, ශ්‍රැතයක්, ත්‍යාගයක්, ප්‍රඥාවක් පවතී’ කියායි. මහණෙනි, යම් සමයෙක ආර්යශ්‍රාවකයා තමාගේද, ඒ දෙවිවරුන්ගේද ශ්‍රද්ධාව, ශීලය, ශ්‍රැතය, ත්‍යාගය සහ ප්‍රඥාව සිහි කරයිද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් පෙළඹී නොපවතී. ද්වේෂයෙන් පෙළඹී නොපවතී. මෝහයෙන් පෙළඹී නොපවතී. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූයේ, මුදා හරින ලද්දේ, බැඳීම්වලින් මිදුණේ වෙයි. මහණෙනි, ‘බැඳීම’ යනු පඤ්ච කාමගුණයන්ට නමෙකි. මහණෙනි, මේ ආලම්බනය කරගෙනද මෙහිලා ඇතැම් සත්ත්වයෝ පිරිසිදු වෙති. මහණෙනි, මේවා අනුස්සතිස්ථාන සයයි.",
      "paliTitle": "Anussatiṭṭhānasuttaṃ",
      "englishTitle": "The Discourse on the Bases of Recollection",
      "sinhalaTitle": "අනුස්සති ස‍්ථාන සූත‍්‍රය"
    },
    {
      "number": 26,
      "pali": "Tatra kho āyasmā mahākaccāno bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahākaccānassa paccassosuṃ. Āyasmā mahākaccāno etadavoca – ‘‘acchariyaṃ, āvuso; abbhutaṃ, āvuso! Yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sambādhe okāsādhigamo anubuddho sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ cha anussatiṭṭhānāni. ‘‘Katamāni cha? Idhāvuso, ariyasāvako tathāgataṃ anussarati – ‘itipi so bhagavā …pe… satthā devamanussānaṃ buddho bhagavā’ti. Yasmiṃ, āvuso, samaye ariyasāvako tathāgataṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṃ karitvā evamidhekacce sattā visuddhidhammā bhavanti. ‘‘Puna caparaṃ, āvuso, ariyasāvako dhammaṃ anussarati – ‘svākkhāto bhagavatā dhammo…pe… paccattaṃ veditabbo viññūhī’ti. Yasmiṃ, āvuso, samaye ariyasāvako dhammaṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṃ karitvā evamidhekacce sattā visuddhidhammā bhavanti. ‘‘Puna caparaṃ, āvuso, ariyasāvako saṅghaṃ anussarati – ‘suppaṭipanno bhagavato sāvakasaṅgho…pe… anuttaraṃ puññakkhettaṃ lokassā’ti. Yasmiṃ, āvuso, samaye ariyasāvako saṅghaṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṃ karitvā evamidhekacce sattā visuddhidhammā bhavanti. ‘‘Puna caparaṃ, āvuso, ariyasāvako attano sīlāni anussarati akhaṇḍāni…pe… samādhisaṃvattanikāni. Yasmiṃ, āvuso, samaye ariyasāvako attano sīlaṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṃ karitvā evamidhekacce sattā visuddhidhammā bhavanti. ‘‘Puna caparaṃ, āvuso, ariyasāvako attano cāgaṃ anussarati – ‘lābhā vata me, suladdhaṃ vata me…pe… yācayogo dānasaṃvibhāgarato’ti. Yasmiṃ, āvuso, samaye ariyasāvako attano cāgaṃ anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṃ karitvā evamidhekacce sattā visuddhidhammā bhavanti. ‘‘Puna caparaṃ, āvuso, ariyasāvako devatā anussarati – ‘santi devā cātumahārājikā, santi devā… pe… tatuttari. Yathārūpāya saddhāya samannāgatā tā devatā ito cutā tattha upapannā; mayhampi tathārūpā saddhā saṃvijjati. Yathārūpena sīlena…pe… sutena… cāgena… paññāya samannāgatā tā devatā ito cutā tattha upapannā; mayhampi tathārūpā paññā saṃvijjatī’ti. Yasmiṃ, āvuso, samaye ariyasāvako attano ca tāsañca devatānaṃ saddhañca sīlañca sutañca cāgañca paññañca anussarati nevassa tasmiṃ samaye rāgapariyuṭṭhitaṃ cittaṃ hoti, na dosapariyuṭṭhitaṃ cittaṃ hoti, na mohapariyuṭṭhitaṃ cittaṃ hoti; ujugatamevassa tasmiṃ samaye cittaṃ hoti, nikkhantaṃ muttaṃ vuṭṭhitaṃ gedhamhā. ‘Gedho’ti kho, āvuso, pañcannetaṃ kāmaguṇānaṃ adhivacanaṃ. Sa kho so, āvuso, ariyasāvako sabbaso ākāsasamena cetasā viharati vipulena mahaggatena appamāṇena averena abyāpajjena. Idampi kho, āvuso, ārammaṇaṃ karitvā evamidhekacce sattā visuddhidhammā bhavanti. ‘‘Acchariyaṃ, āvuso; abbhutaṃ, āvuso! Yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sambādhe okāsādhigamo anubuddho sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ cha anussatiṭṭhānānī’’ti. Chaṭṭhaṃ.",
      "english": "There then, the venerable Mahākaccāna addressed the monks, saying, “Friends, monks!” “Friend,” those monks replied to the venerable Mahākaccāna. The venerable Mahākaccāna said this: “It is wonderful, friends; it is amazing, friends! How fully understood and penetrated by the Blessed One, the Knower, the Seer, the Arahant, the Fully Self-Awakened One, is this attainment of an opening in the midst of obstruction, for the purification of beings, for the overcoming of sorrow and lamentation, for the passing away of pain and distress, for the attainment of the path, for the realization of Nibbāna—namely, these six mindfulness-meditations.\n\n“Which six? Here, friends, a noble disciple recollects the Tathāgata thus: ‘Indeed, that Blessed One is an Arahant, a Fully Self-Awakened One, accomplished in true knowledge and conduct, fortunate, knower of the worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.’ Friends, at the time a noble disciple recollects the Tathāgata, their mind is not overcome by greed, nor overcome by hatred, nor overcome by delusion; at that time, their mind is straight, released, freed, risen above craving. Indeed, friends, ‘craving’ is a term for the five strands of sensual pleasure. Friends, that noble disciple dwells with a mind like the sky, vast, sublime, immeasurable, without hostility, without ill-will. Indeed, friends, by making this the object of their meditation, some beings here become purified in nature.\n\n“Furthermore, friends, a noble disciple recollects the Dhamma thus: ‘The Dhamma is well-expounded by the Blessed One, visible in this very life, immediately effective, inviting one to come and see, onward-leading, to be personally realized by the wise.’ Friends, at the time a noble disciple recollects the Dhamma, their mind is not overcome by greed, nor overcome by hatred, nor overcome by delusion; at that time, their mind is straight, released, freed, risen above craving. Indeed, friends, ‘craving’ is a term for the five strands of sensual pleasure. Friends, that noble disciple dwells with a mind like the sky, vast, sublime, immeasurable, without hostility, without ill-will. Indeed, friends, by making this the object of their meditation, some beings here become purified in nature.\n\n“Furthermore, friends, a noble disciple recollects the Saṅgha thus: ‘The Saṅgha of the Blessed One’s disciples is practicing well, practicing uprightly, practicing for the path, practicing with integrity—that is, the four pairs of persons, the eight types of individuals—this Saṅgha of the Blessed One’s disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, the unsurpassed field of merit for the world.’ Friends, at the time a noble disciple recollects the Saṅgha, their mind is not overcome by greed, nor overcome by hatred, nor overcome by delusion; at that time, their mind is straight, released, freed, risen above craving. Indeed, friends, ‘craving’ is a term for the five strands of sensual pleasure. Friends, that noble disciple dwells with a mind like the sky, vast, sublime, immeasurable, without hostility, without ill-will. Indeed, friends, by making this the object of their meditation, some beings here become purified in nature.\n\n“Furthermore, friends, a noble disciple recollects their own virtues thus: ‘They are unbroken, unblemished, unspotted, unmarred, freeing, praised by the wise, ungrasped, conducive to concentration.’ Friends, at the time a noble disciple recollects their own virtues, their mind is not overcome by greed, nor overcome by hatred, nor overcome by delusion; at that time, their mind is straight, released, freed, risen above craving. Indeed, friends, ‘craving’ is a term for the five strands of sensual pleasure. Friends, that noble disciple dwells with a mind like the sky, vast, sublime, immeasurable, without hostility, without ill-will. Indeed, friends, by making this the object of their meditation, some beings here become purified in nature.\n\n“Furthermore, friends, a noble disciple recollects their own generosity thus: ‘It is truly a gain for me, it is truly well-obtained by me, that I live in a house with a mind free from the stain of stinginess, open-handed, clean-handed, delighting in giving, approachable by beggars, delighting in distributing gifts.’ Friends, at the time a noble disciple recollects their own generosity, their mind is not overcome by greed, nor overcome by hatred, nor overcome by delusion; at that time, their mind is straight, released, freed, risen above craving. Indeed, friends, ‘craving’ is a term for the five strands of sensual pleasure. Friends, that noble disciple dwells with a mind like the sky, vast, sublime, immeasurable, without hostility, without ill-will. Indeed, friends, by making this the object of their meditation, some beings here become purified in nature.\n\n“Furthermore, friends, a noble disciple recollects the deities thus: ‘There are the Devas of the Four Great Kings, there are the Devas of the Thirty-three, there are the Yama Devas, there are the Tusita Devas, there are the Nimmanarati Devas, there are the Paranimmitavasavatti Devas, there are the Brahma-bodied Devas, and there are Devas of higher realms. With such faith as those deities possessed, they passed away from here and reappeared there; and such faith exists in me too.’\n\nWith such virtue, learning, generosity, and wisdom were those deities endowed, who, having departed from here, were reborn there; and such wisdom is found in me too. Friends, at such a time when a noble disciple recollects his own faith, virtue, learning, generosity, and wisdom, and those of the deities, his mind at that time is not beset by greed, not beset by aversion, and not beset by delusion; his mind at that time is straightened, departed, released, and arisen from craving. Indeed, friends, 'craving' is a designation for the five cords of sensuality. Indeed, friends, that noble disciple dwells with a mind like space, expansive, great, immeasurable, without hostility, and without ill will. Indeed, friends, by making this a basis for meditation, some beings here become purified in nature.\n\n‘Wonderful, friends! Astounding, friends! To such an extent has the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, comprehended the discovery of an opening amidst constriction for the purification of beings, for the transcending of sorrow and lamentation, for the disappearance of pain and distress, for the attainment of the path, for the realization of Nibbāna—namely, these six recollections!’",
      "sinhala": "එවිට ආයුෂ්මත් මහාකච්චාන තෙරණුවෝ භික්ෂූන් අමතා, “ඇවැත්නි භික්ෂූනි”යි කීහ. “ඇවැත්නි”යි ඒ භික්ෂූහු ආයුෂ්මත් මහාකච්චාන තෙරණුවන්ට පිළිතුරු දුන්හ. ආයුෂ්මත් මහාකච්චාන තෙරණුවෝ මෙසේ වදාළහ: “ඇවැත්නි, ආශ්චර්යයකි! ඇවැත්නි, අද්භූතයකි! තුන්ලෝකයම දන්නා, සියල්ල දකිනා, රහත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් සත්වයන්ගේ පිරිසිදු වීම පිණිසත්, ශෝක පරිදේවයන් ඉක්මවා යාම පිණිසත්, දුක් දොම්නස් නැති කිරීම පිණිසත්, නිවැරදි මාර්ගය අවබෝධ කර ගැනීම පිණිසත්, නිර්වාණය ප්‍රත්‍යක්ෂ කිරීම පිණිසත්, සංසාර බාධාවෙන් මිදීමට හේතුවක් වන, මේ අනුස්සතිස්ථාන (මතක් කළ යුතු කරුණු) සය අවබෝධ කරන ලද්දේය.\n\n“ඒ සය කවරේද? ඇවැත්නි, මෙහිලා ආර්ය ශ්‍රාවකයා තථාගතයන් වහන්සේ අනුස්මරණය කරයි: ‘ඒ භාග්‍යවතුන් වහන්සේ අරහත්ය, ... (පි...) දෙවි මිනිසුන්ගේ ශාස්තෘවරයාය, බුද්ධය, භාග්‍යවත්ය’ යනුවෙනි. ඇවැත්නි, යම් සමයෙක ආර්ය ශ්‍රාවකයා තථාගතයන් වහන්සේ අනුස්මරණය කරන්නේද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් මුළා වූවක් නොවෙයි, ද්වේෂයෙන් මුළා වූවක් නොවෙයි, මෝහයෙන් මුළා වූවක් නොවෙයි. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූවක් වෙයි, ගේදහයෙන් (කාම ගිජු බවින්) මිදුණක් වෙයි, මුදාගත් එකක් වෙයි, නැගී සිටි එකක් වෙයි. ඇවැත්නි, ‘ගේදහය’ යනු පඤ්ච කාමගුණවලට (ඇලීමට) කියන නමකි. ඇවැත්නි, ඒ ආර්ය ශ්‍රාවකයා, මුළුමනින්ම ආකාසය හා සමාන වූ සිතකින්, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතකින් වාසය කරයි. ඇවැත්නි, මේ ආලම්බනය (වස්තුව) ද අරමුණු කොට මෙහි ඇතැම් සත්ත්වයෝ විශුද්ධ ස්වභාව ඇත්තෝ (පිරිසිදු භාවයට පැමිණෙන්නෝ) වෙති.\n\nතවද, ඇවැත්නි, ආර්ය ශ්‍රාවකයා ධර්මය අනුස්මරණය කරයි: ‘භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත වූ ධර්මය... (පි...) නුවණැත්තවුන් විසින් තමන් තුළින්ම අවබෝධ කළ යුත්තේය’ යනුවෙනි. ඇවැත්නි, යම් සමයෙක ආර්ය ශ්‍රාවකයා ධර්මය අනුස්මරණය කරන්නේද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් මුළා වූවක් නොවෙයි, ද්වේෂයෙන් මුළා වූවක් නොවෙයි, මෝහයෙන් මුළා වූවක් නොවෙයි. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූවක් වෙයි, ගේදහයෙන් (කාම ගිජු බවින්) මිදුණක් වෙයි, මුදාගත් එකක් වෙයි, නැගී සිටි එකක් වෙයි. ඇවැත්නි, ‘ගේදහය’ යනු පඤ්ච කාමගුණවලට (ඇලීමට) කියන නමකි. ඇවැත්නි, ඒ ආර්ය ශ්‍රාවකයා, මුළුමනින්ම ආකාසය හා සමාන වූ සිතකින්, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතකින් වාසය කරයි. ඇවැත්නි, මේ ආලම්බනය (වස්තුව) ද අරමුණු කොට මෙහි ඇතැම් සත්ත්වයෝ විශුද්ධ ස්වභාව ඇත්තෝ (පිරිසිදු භාවයට පැමිණෙන්නෝ) වෙති.\n\nතවද, ඇවැත්නි, ආර්ය ශ්‍රාවකයා සංඝයා අනුස්මරණය කරයි: ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා වහන්සේ සුප්‍රතිපන්නය... (පි...) ලෝකයාට අනුත්තර වූ පින් කෙතය’ යනුවෙනි. ඇවැත්නි, යම් සමයෙක ආර්ය ශ්‍රාවකයා සංඝයා අනුස්මරණය කරන්නේද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් මුළා වූවක් නොවෙයි, ද්වේෂයෙන් මුළා වූවක් නොවෙයි, මෝහයෙන් මුළා වූවක් නොවෙයි. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූවක් වෙයි, ගේදහයෙන් (කාම ගිජු බවින්) මිදුණක් වෙයි, මුදාගත් එකක් වෙයි, නැගී සිටි එකක් වෙයි. ඇවැත්නි, ‘ගේදහය’ යනු පඤ්ච කාමගුණවලට (ඇලීමට) කියන නමකි. ඇවැත්නි, ඒ ආර්ය ශ්‍රාවකයා, මුළුමනින්ම ආකාසය හා සමාන වූ සිතකින්, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතකින් වාසය කරයි. ඇවැත්නි, මේ ආලම්බනය (වස්තුව) ද අරමුණු කොට මෙහි ඇතැම් සත්ත්වයෝ විශුද්ධ ස්වභාව ඇත්තෝ (පිරිසිදු භාවයට පැමිණෙන්නෝ) වෙති.\n\nතවද, ඇවැත්නි, ආර්ය ශ්‍රාවකයා තමාගේ සිල් අනුස්මරණය කරයි: ‘අඛණ්ඩ වූ, ඡිද්‍ර රහිත වූ... (පි...) සමාධියට උපකාරී වන සිල් ඇත්තේය’ යනුවෙනි. ඇවැත්නි, යම් සමයෙක ආර්ය ශ්‍රාවකයා තමාගේ සිල් අනුස්මරණය කරන්නේද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් මුළා වූවක් නොවෙයි, ද්වේෂයෙන් මුළා වූවක් නොවෙයි, මෝහයෙන් මුළා වූවක් නොවෙයි. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූවක් වෙයි, ගේදහයෙන් (කාම ගිජු බවින්) මිදුණක් වෙයි, මුදාගත් එකක් වෙයි, නැගී සිටි එකක් වෙයි. ඇවැත්නි, ‘ගේදහය’ යනු පඤ්ච කාමගුණවලට (ඇලීමට) කියන නමකි. ඇවැත්නි, ඒ ආර්ය ශ්‍රාවකයා, මුළුමනින්ම ආකාසය හා සමාන වූ සිතකින්, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතකින් වාසය කරයි. ඇවැත්නි, මේ ආලම්බනය (වස්තුව) ද අරමුණු කොට මෙහි ඇතැම් සත්ත්වයෝ විශුද්ධ ස්වභාව ඇත්තෝ (පිරිසිදු භාවයට පැමිණෙන්නෝ) වෙති.\n\nතවද, ඇවැත්නි, ආර්ය ශ්‍රාවකයා තමාගේ ත්‍යාගශීලී බව අනුස්මරණය කරයි: ‘මහත් ලාභයකි මට, යහපත් කොට ලැබුණකි මට... (පි...) ඉල්ලා සිටින අයට දන් දීමේත්, බෙදා හදා ගැනීමේත් ඇලුණු ස්වභාව ඇත්තේය’ යනුවෙනි. ඇවැත්නි, යම් සමයෙක ආර්ය ශ්‍රාවකයා තමාගේ ත්‍යාගශීලී බව අනුස්මරණය කරන්නේද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් මුළා වූවක් නොවෙයි, ද්වේෂයෙන් මුළා වූවක් නොවෙයි, මෝහයෙන් මුළා වූවක් නොවෙයි. ඒ සමයෙහි ඔහුගේ සිත කෙළින් වූවක් වෙයි, ගේදහයෙන් (කාම ගිජු බවින්) මිදුණක් වෙයි, මුදාගත් එකක් වෙයි, නැගී සිටි එකක් වෙයි. ඇවැත්නි, ‘ගේදහය’ යනු පඤ්ච කාමගුණවලට (ඇලීමට) කියන නමකි. ඇවැත්නි, ඒ ආර්ය ශ්‍රාවකයා, මුළුමනින්ම ආකාසය හා සමාන වූ සිතකින්, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතකින් වාසය කරයි. ඇවැත්නි, මේ ආලම්බනය (වස්තුව) ද අරමුණු කොට මෙහි ඇතැම් සත්ත්වයෝ විශුද්ධ ස්වභාව ඇත්තෝ (පිරිසිදු භාවයට පැමිණෙන්නෝ) වෙති.\n\nතවද, ඇවැත්නි, ආර්ය ශ්‍රාවකයා දෙවියන් අනුස්මරණය කරයි: ‘චාතුම්මහාරාජික දෙවියෝ වෙති, ... (පි...) ඊටත් උසස් දෙවියෝ වෙති. යම් ආකාරයක ශ්‍රද්ධාවකින් යුක්තව ඒ දෙවියෝ මෙලොවින් චුත වී (මිය ගොස්) එතැන උපන්නෝද, ඒ ආකාරයකම ශ්‍රද්ධාවක් මට ද ඇත.\n\nයම් අයුරකින් ශ්‍රද්ධාවෙන්, ශීලයෙන්, ඇසූ පිරූ තැන් ඇති බවින්, ත්‍යාගයෙන්, ප්‍රඥාවෙන් සමන්විත වූ ඒ දෙවියෝ මෙලොවින් චුතව එතැන උපන්නාහුද, එබඳු ප්‍රඥාවක් මා තුළද පවතී. මිත්‍රවරුනි, යම් සමයක ආර්ය ශ්‍රාවක තෙමේ තමාගේද, ඒ දෙවියන්ගේද ශ්‍රද්ධාව, ශීලය, ඇසූ පිරූ තැන් ඇති බව, ත්‍යාගය සහ ප්‍රඥාව සිහි කරයිද, ඒ සමයෙහි ඔහුගේ සිත රාගයෙන් යටපත් වූවක් නොවේ, ද්වේෂයෙන් යටපත් වූවක් නොවේ, මෝහයෙන් යටපත් වූවක් නොවේ. එම සමයෙහි ඔහුගේ සිත ඍජු වූවක්ම වෙයි, ගිජු බවෙන් නික්මුණු, මිදුණු, නැගී සිටි සිතක් වෙයි. මිත්‍රවරුනි, 'ගිජු බව' යනු පස්කම් ගුණයන්ට නමකි. මිත්‍රවරුනි, ඒ ආර්ය ශ්‍රාවක තෙමේ අහස හා සම වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් වාසය කරයි. මිත්‍රවරුනි, මේද අරමුණු කරගෙන මෙසේ සමහර සත්ත්වයෝ විශුද්ධි ස්වභාවයෙන් යුක්ත වෙත්.\n\nමිත්‍රවරුනි, එය පුදුම සහගතය! මිත්‍රවරුනි, එය විශ්මයජනකය! ඒ දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මාසම්බුදුරජාණන් වහන්සේ විසින් සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක පරිදේවයන් ඉක්මවා යාම පිණිස, දුක් දොම්නස් නැති කිරීම පිණිස, ඤාය ධර්මය අවබෝධ කරගැනීම පිණිස, නිර්වාණය ප්‍රත්‍යක්ෂ කිරීම පිණිස, සම්බාධයේදී අවකාශය අවබෝධ කරගැනීම කුමක්ද යත්, මේ ෂඩ් අනුස්සති ස්ථානයන්ය.\nෂෂ්ඨයයි.",
      "paliTitle": "Mahākaccānasuttaṃ",
      "englishTitle": "Mahākaccāna Sutta",
      "sinhalaTitle": "මහකච්චාන සූත්‍රය"
    },
    {
      "number": 27,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, samayā manobhāvanīyassa bhikkhuno dassanāya upasaṅkamitu’’nti? ‘‘Chayime, bhikkhu, samayā manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ’’. ‘‘Katame cha? Idha, bhikkhu, yasmiṃ samaye bhikkhu kāmarāgapariyuṭṭhitena cetasā viharati kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ nappajānāti tasmiṃ samaye manobhāvanīyo bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ahaṃ kho, āvuso, kāmarāgapariyuṭṭhitena cetasā viharāmi kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ nappajānāmi. Sādhu vata me, āyasmā, kāmarāgassa pahānāya dhammaṃ desetū’ti. Tassa manobhāvanīyo bhikkhu kāmarāgassa pahānāya dhammaṃ deseti. Ayaṃ, bhikkhu, paṭhamo samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. ‘‘Puna caparaṃ, bhikkhu, yasmiṃ samaye bhikkhu byāpādapariyuṭṭhitena cetasā viharati byāpādaparetena, uppannassa ca byāpādassa nissaraṇaṃ yathābhūtaṃ nappajānāti tasmiṃ samaye manobhāvanīyo bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ahaṃ kho, āvuso, byāpādapariyuṭṭhitena cetasā viharāmi byāpādaparetena, uppannassa ca byāpādassa nissaraṇaṃ yathābhūtaṃ nappajānāmi. Sādhu vata me, āyasmā, byāpādassa pahānāya dhammaṃ desetū’ti. Tassa manobhāvanīyo bhikkhu byāpādassa pahānāya dhammaṃ deseti. Ayaṃ, bhikkhu, dutiyo samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. ‘‘Puna caparaṃ, bhikkhu, yasmiṃ samaye bhikkhu thinamiddhapariyuṭṭhitena cetasā viharati thinamiddhaparetena, uppannassa ca thinamiddhassa nissaraṇaṃ yathābhūtaṃ nappajānāti tasmiṃ samaye manobhāvanīyo bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ahaṃ kho, āvuso, thinamiddhapariyuṭṭhitena cetasā viharāmi thinamiddhaparetena, uppannassa ca thinamiddhassa nissaraṇaṃ yathābhūtaṃ nappajānāmi. Sādhu vata me, āyasmā, thinamiddhassa pahānāya dhammaṃ desetū’ti. Tassa manobhāvanīyo bhikkhu thinamiddhassa pahānāya dhammaṃ deseti. Ayaṃ, bhikkhu, tatiyo samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. ‘‘Puna caparaṃ, bhikkhu, yasmiṃ samaye bhikkhu uddhaccakukkuccapariyuṭṭhitena cetasā viharati uddhaccakukkuccaparetena, uppannassa ca uddhaccakukkuccassa nissaraṇaṃ yathābhūtaṃ nappajānāti tasmiṃ samaye manobhāvanīyo bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ahaṃ kho, āvuso, uddhaccakukkuccapariyuṭṭhitena cetasā viharāmi uddhaccakukkuccaparetena, uppannassa ca uddhaccakukkuccassa nissaraṇaṃ yathābhūtaṃ nappajānāmi. Sādhu vata me, āyasmā, uddhaccakukkuccassa pahānāya dhammaṃ desetū’ti. Tassa manobhāvanīyo bhikkhu uddhaccakukkuccassa pahānāya dhammaṃ deseti. Ayaṃ, bhikkhu, catuttho samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. ‘‘Puna caparaṃ, bhikkhu, yasmiṃ samaye bhikkhu vicikicchāpariyuṭṭhitena cetasā viharati vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṃ yathābhūtaṃ nappajānāti tasmiṃ samaye manobhāvanīyo bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ahaṃ, āvuso, vicikicchāpariyuṭṭhitena cetasā viharāmi vicikicchāparetena, uppannāya ca vicikicchāya nissaraṇaṃ yathābhūtaṃ nappajānāmi. Sādhu vata me, āyasmā, vicikicchāya pahānāya dhammaṃ desetū’ti. Tassa manobhāvanīyo bhikkhu vicikicchāya pahānāya dhammaṃ deseti. Ayaṃ, bhikkhu, pañcamo samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. ‘‘Puna caparaṃ, bhikkhu, yasmiṃ samaye bhikkhu yaṃ nimittaṃ āgamma yaṃ nimittaṃ manasikaroto anantarā āsavānaṃ khayo hoti taṃ nimittaṃ nappajānāti tasmiṃ samaye manobhāvanīyo bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ahaṃ kho, āvuso, yaṃ nimittaṃ āgamma yaṃ nimittaṃ manasikaroto anantarā āsavānaṃ khayo hoti, taṃ nimittaṃ nappajānāmi. Sādhu vata me, āyasmā, āsavānaṃ khayāya dhammaṃ desetū’ti. Tassa manobhāvanīyo bhikkhu āsavānaṃ khayāya dhammaṃ deseti. Ayaṃ, bhikkhu, chaṭṭho samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. Ime kho, bhikkhu, cha samayā manobhāvanīyassa bhikkhuno dassanāya upasaṅkamitu’’nti. Sattamaṃ.",
      "english": "Then a certain bhikkhu approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, that bhikkhu said to the Blessed One: \"Bhante, how many occasions are there for approaching a bhikkhu who is worthy of esteem?\" \"Bhikkhu, these are the six occasions for approaching a bhikkhu who is worthy of esteem.\" \"Which six? Here, bhikkhu, when a bhikkhu lives with his mind beset by sensual desire, overwhelmed by sensual desire, and he does not understand as it truly is the escape from sensual desire that has arisen, at that time he should approach a bhikkhu who is worthy of esteem and say to him thus: 'Friend, my mind is beset by sensual desire, overwhelmed by sensual desire, and I do not understand as it truly is the escape from sensual desire that has arisen. It would be good if you, venerable sir, would teach me the Dhamma for the abandoning of sensual desire.' Then that bhikkhu worthy of esteem teaches him the Dhamma for the abandoning of sensual desire. This, bhikkhu, is the first occasion for approaching a bhikkhu who is worthy of esteem.\"\n\n\"Furthermore, bhikkhu, when a bhikkhu lives with his mind beset by ill will, overwhelmed by ill will, and he does not understand as it truly is the escape from ill will that has arisen, at that time he should approach a bhikkhu who is worthy of esteem and say to him thus: 'Friend, my mind is beset by ill will, overwhelmed by ill will, and I do not understand as it truly is the escape from ill will that has arisen. It would be good if you, venerable sir, would teach me the Dhamma for the abandoning of ill will.' Then that bhikkhu worthy of esteem teaches him the Dhamma for the abandoning of ill will. This, bhikkhu, is the second occasion for approaching a bhikkhu who is worthy of esteem.\"\n\n\"Furthermore, bhikkhu, when a bhikkhu lives with his mind beset by sloth and torpor, overwhelmed by sloth and torpor, and he does not understand as it truly is the escape from sloth and torpor that has arisen, at that time he should approach a bhikkhu who is worthy of esteem and say to him thus: 'Friend, my mind is beset by sloth and torpor, overwhelmed by sloth and torpor, and I do not understand as it truly is the escape from sloth and torpor that has arisen. It would be good if you, venerable sir, would teach me the Dhamma for the abandoning of sloth and torpor.' Then that bhikkhu worthy of esteem teaches him the Dhamma for the abandoning of sloth and torpor. This, bhikkhu, is the third occasion for approaching a bhikkhu who is worthy of esteem.\"\n\n\"Furthermore, bhikkhu, when a bhikkhu lives with his mind beset by restlessness and remorse, overwhelmed by restlessness and remorse, and he does not understand as it truly is the escape from restlessness and remorse that has arisen, at that time he should approach a bhikkhu who is worthy of esteem and say to him thus: 'Friend, my mind is beset by restlessness and remorse, overwhelmed by restlessness and remorse, and I do not understand as it truly is the escape from restlessness and remorse that has arisen. It would be good if you, venerable sir, would teach me the Dhamma for the abandoning of restlessness and remorse.' Then that bhikkhu worthy of esteem teaches him the Dhamma for the abandoning of restlessness and remorse. This, bhikkhu, is the fourth occasion for approaching a bhikkhu who is worthy of esteem.\"\n\n\"Furthermore, bhikkhu, when a bhikkhu lives with his mind beset by doubt, overwhelmed by doubt, and he does not understand as it truly is the escape from doubt that has arisen, at that time he should approach a bhikkhu who is worthy of esteem and say to him thus: 'Friend, my mind is beset by doubt, overwhelmed by doubt, and I do not understand as it truly is the escape from doubt that has arisen. It would be good if you, venerable sir, would teach me the Dhamma for the abandoning of doubt.' Then that bhikkhu worthy of esteem teaches him the Dhamma for the abandoning of doubt. This, bhikkhu, is the fifth occasion for approaching a bhikkhu who is worthy of esteem.\"\n\n\"Furthermore, bhikkhu, when a bhikkhu does not discern the sign by which, by attending to it, the destruction of the taints occurs immediately, at that time he should approach a bhikkhu who is worthy of esteem and say to him thus: 'Friend, I do not discern the sign by which, by attending to it, the destruction of the taints occurs immediately. It would be good if you, venerable sir, would teach me the Dhamma for the destruction of the taints.' Then that bhikkhu worthy of esteem teaches him the Dhamma for the destruction of the taints. This, bhikkhu, is the sixth occasion for approaching a bhikkhu who is worthy of esteem.\"\n\n\"These, bhikkhu, are the six occasions for approaching a bhikkhu who is worthy of esteem.\"",
      "sinhala": "එවිට එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසිය: \"ස්වාමීනී, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුත්තේ කවර අවස්ථාවලද?\" \"භික්ෂුව, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුත්තේ මේ අවස්ථා හයෙහිදීය.\"\n\n\"ඒ හය කවරේද? භික්ෂුව, මෙහි යම් අවස්ථාවක භික්ෂුවක් කාමරාගයෙන් යටපත් වූ, කාමරාගයෙන් වෙලුණු සිතකින් වාසය කරයිද, හටගත් කාමරාගයෙන් මිදීම යථාභූත ලෙස නොදනීද, එවැනි අවස්ථාවක සිත දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ පැවසිය යුතුය: 'ඇවැත්නි, මම කාමරාගයෙන් යටපත් වූ, කාමරාගයෙන් වෙලුණු සිතකින් වාසය කරමි. හටගත් කාමරාගයෙන් මිදීම යථාභූත ලෙස නොදනිමි. මාගේ කාමරාගය ප්‍රහාණය කිරීම සඳහා ආයුෂ්මත් ඔබ මට ධර්මය දේශනා කළ මැනව.' එවිට සිත දියුණු කළ ඒ භික්ෂුව ඔහුට කාමරාගය ප්‍රහාණය කිරීම සඳහා ධර්මය දේශනා කරයි. භික්ෂුව, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුතු පළමු අවස්ථාව මෙයයි.\"\n\n\"තවද භික්ෂුව, යම් අවස්ථාවක භික්ෂුවක් ව්‍යාපාදයෙන් යටපත් වූ, ව්‍යාපාදයෙන් වෙලුණු සිතකින් වාසය කරයිද, හටගත් ව්‍යාපාදයෙන් මිදීම යථාභූත ලෙස නොදනීද, එවැනි අවස්ථාවක සිත දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ පැවසිය යුතුය: 'ඇවැත්නි, මම ව්‍යාපාදයෙන් යටපත් වූ, ව්‍යාපාදයෙන් වෙලුණු සිතකින් වාසය කරමි. හටගත් ව්‍යාපාදයෙන් මිදීම යථාභූත ලෙස නොදනිමි. මාගේ ව්‍යාපාදය ප්‍රහාණය කිරීම සඳහා ආයුෂ්මත් ඔබ මට ධර්මය දේශනා කළ මැනව.' එවිට සිත දියුණු කළ ඒ භික්ෂුව ඔහුට ව්‍යාපාදය ප්‍රහාණය කිරීම සඳහා ධර්මය දේශනා කරයි. භික්ෂුව, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුතු දෙවන අවස්ථාව මෙයයි.\"\n\n\"තවද භික්ෂුව, යම් අවස්ථාවක භික්ෂුවක් ථීනමිද්ධයෙන් යටපත් වූ, ථීනමිද්ධයෙන් වෙලුණු සිතකින් වාසය කරයිද, හටගත් ථීනමිද්ධයෙන් මිදීම යථාභූත ලෙස නොදනීද, එවැනි අවස්ථාවක සිත දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ පැවසිය යුතුය: 'ඇවැත්නි, මම ථීනමිද්ධයෙන් යටපත් වූ, ථීනමිද්ධයෙන් වෙලුණු සිතකින් වාසය කරමි. හටගත් ථීනමිද්ධයෙන් මිදීම යථාභූත ලෙස නොදනිමි. මාගේ ථීනමිද්ධය ප්‍රහාණය කිරීම සඳහා ආයුෂ්මත් ඔබ මට ධර්මය දේශනා කළ මැනව.' එවිට සිත දියුණු කළ ඒ භික්ෂුව ඔහුට ථීනමිද්ධය ප්‍රහාණය කිරීම සඳහා ධර්මය දේශනා කරයි. භික්ෂුව, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුතු තෙවන අවස්ථාව මෙයයි.\"\n\n\"තවද භික්ෂුව, යම් අවස්ථාවක භික්ෂුවක් උද්ධච්චකුක්කුච්චයෙන් යටපත් වූ, උද්ධච්චකුක්කුච්චයෙන් වෙලුණු සිතකින් වාසය කරයිද, හටගත් උද්ධච්චකුක්කුච්චයෙන් මිදීම යථාභූත ලෙස නොදනීද, එවැනි අවස්ථාවක සිත දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ පැවසිය යුතුය: 'ඇවැත්නි, මම උද්ධච්චකුක්කුච්චයෙන් යටපත් වූ, උද්ධච්චකුක්කුච්චයෙන් වෙලුණු සිතකින් වාසය කරමි. හටගත් උද්ධච්චකුක්කුච්චයෙන් මිදීම යථාභූත ලෙස නොදනිමි. මාගේ උද්ධච්චකුක්කුච්චය ප්‍රහාණය කිරීම සඳහා ආයුෂ්මත් ඔබ මට ධර්මය දේශනා කළ මැනව.' එවිට සිත දියුණු කළ ඒ භික්ෂුව ඔහුට උද්ධච්චකුක්කුච්චය ප්‍රහාණය කිරීම සඳහා ධර්මය දේශනා කරයි. භික්ෂුව, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුතු සිව්වන අවස්ථාව මෙයයි.\"\n\n\"තවද භික්ෂුව, යම් අවස්ථාවක භික්ෂුවක් විචිකිච්ඡාවෙන් යටපත් වූ, විචිකිච්ඡාවෙන් වෙලුණු සිතකින් වාසය කරයිද, හටගත් විචිකිච්ඡාවෙන් මිදීම යථාභූත ලෙස නොදනීද, එවැනි අවස්ථාවක සිත දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ පැවසිය යුතුය: 'ඇවැත්නි, මම විචිකිච්ඡාවෙන් යටපත් වූ, විචිකිච්ඡාවෙන් වෙලුණු සිතකින් වාසය කරමි. හටගත් විචිකිච්ඡාවෙන් මිදීම යථාභූත ලෙස නොදනිමි. මාගේ විචිකිච්ඡාව ප්‍රහාණය කිරීම සඳහා ආයුෂ්මත් ඔබ මට ධර්මය දේශනා කළ මැනව.' එවිට සිත දියුණු කළ ඒ භික්ෂුව ඔහුට විචිකිච්ඡාව ප්‍රහාණය කිරීම සඳහා ධර්මය දේශනා කරයි. භික්ෂුව, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුතු පස්වන අවස්ථාව මෙයයි.\"\n\n\"තවද භික්ෂුව, යම් අවස්ථාවක භික්ෂුවක්, යම් නිමිත්තක් අරමුණු කරගෙන, යම් නිමිත්තක් මෙනෙහි කිරීමෙන් අනතුරුව ආසවයන් ක්ෂය වන්නේද, ඒ නිමිත්ත නොදනීද, එවැනි අවස්ථාවක සිත දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ පැවසිය යුතුය: 'ඇවැත්නි, යම් නිමිත්තක් අරමුණු කරගෙන, යම් නිමිත්තක් මෙනෙහි කිරීමෙන් අනතුරුව ආසවයන් ක්ෂය වන්නේද, මම ඒ නිමිත්ත නොදනිමි. මාගේ ආසවයන් ක්ෂය කිරීම සඳහා ආයුෂ්මත් ඔබ මට ධර්මය දේශනා කළ මැනව.' එවිට සිත දියුණු කළ ඒ භික්ෂුව ඔහුට ආසවයන් ක්ෂය කිරීම සඳහා ධර්මය දේශනා කරයි. භික්ෂුව, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුතු සයවන අවස්ථාව මෙයයි. භික්ෂුව, සිත දියුණු කළ භික්ෂුවක් දැකීමට යා යුතු මේ අවස්ථා හය මේවාය.\"",
      "paliTitle": "Paṭhamasamayasuttaṃ",
      "englishTitle": "The First Samaya Sutta",
      "sinhalaTitle": "පළමු සමය සූත‍්‍රය"
    },
    {
      "number": 28,
      "pali": "Ekaṃ samayaṃ sambahulā therā bhikkhū bārāṇasiyaṃ viharanti isipatane migadāye. Atha kho tesaṃ therānaṃ bhikkhūnaṃ pacchābhattaṃ piṇḍapātapaṭikkantānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘ko nu kho, āvuso, samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamitu’’nti? Evaṃ vutte aññataro bhikkhu there bhikkhū etadavoca – ‘‘yasmiṃ, āvuso, samaye manobhāvanīyo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto pāde pakkhāletvā nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā, so samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamitu’’nti. Evaṃ vutte aññataro bhikkhu taṃ bhikkhuṃ etadavoca – ‘‘na kho, āvuso, so samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. Yasmiṃ, āvuso, samaye manobhāvanīyo bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto pāde pakkhāletvā nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā, cārittakilamathopissa tasmiṃ samaye appaṭippassaddho hoti, bhattakilamathopissa tasmiṃ samaye appaṭippassaddho hoti. Tasmā so asamayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. Yasmiṃ, āvuso, samaye manobhāvanīyo bhikkhu sāyanhasamayaṃ paṭisallānā vuṭṭhito vihārapacchāyāyaṃ nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā, so samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamitu’’nti. Evaṃ vutte aññataro bhikkhu taṃ bhikkhuṃ etadavoca – ‘‘na kho, āvuso, so samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. Yasmiṃ, āvuso, samaye manobhāvanīyo bhikkhu sāyanhasamayaṃ paṭisallānā vuṭṭhito vihārapacchāyāyaṃ nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā, yadevassa divā samādhinimittaṃ manasikataṃ hoti tadevassa tasmiṃ samaye samudācarati. Tasmā so asamayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. Yasmiṃ, āvuso, samaye manobhāvanīyo bhikkhu rattiyā paccūsasamayaṃ paccuṭṭhāya nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā, so samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamitu’’nti. Evaṃ vutte aññataro bhikkhu taṃ bhikkhuṃ etadavoca – ‘‘na kho, āvuso, so samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. Yasmiṃ, āvuso, samaye manobhāvanīyo bhikkhu rattiyā paccūsasamayaṃ paccuṭṭhāya nisinno hoti pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā, ojaṭṭhāyissa tasmiṃ samaye kāyo hoti phāsussa hoti buddhānaṃ sāsanaṃ manasi kātuṃ. Tasmā so asamayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamitu’’nti. Evaṃ vutte āyasmā mahākaccāno there bhikkhū etadavoca – ‘‘sammukhā metaṃ, āvuso, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘chayime, bhikkhu, samayā manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ’’’. ‘‘Katame cha? Idha, bhikkhu, yasmiṃ samaye bhikkhu kāmarāgapariyuṭṭhitena cetasā viharati kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ nappajānāti, tasmiṃ samaye manobhāvanīyo bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ahaṃ kho, āvuso, kāmarāgapariyuṭṭhitena cetasā viharāmi kāmarāgaparetena, uppannassa ca kāmarāgassa nissaraṇaṃ yathābhūtaṃ nappajānāmi. Sādhu vata me āyasmā kāmarāgassa pahānāya dhammaṃ desetū’ti. Tassa manobhāvanīyo bhikkhu kāmarāgassa pahānāya dhammaṃ deseti. Ayaṃ, bhikkhu, paṭhamo samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. ‘‘Puna caparaṃ, bhikkhu, yasmiṃ samaye bhikkhu byāpādapariyuṭṭhitena cetasā viharati…pe… thinamiddhapariyuṭṭhitena cetasā viharati… uddhaccakukkuccapariyuṭṭhitena cetasā viharati… vicikicchāpariyuṭṭhitena cetasā viharati… yaṃ nimittaṃ āgamma yaṃ nimittaṃ manasikaroto anantarā āsavānaṃ khayo hoti, taṃ nimittaṃ na jānāti na passati, tasmiṃ samaye manobhāvanīyo bhikkhu upasaṅkamitvā evamassa vacanīyo – ‘ahaṃ kho, āvuso, yaṃ nimittaṃ āgamma yaṃ nimittaṃ manasikaroto anantarā āsavānaṃ khayo hoti taṃ nimittaṃ na jānāmi na passāmi. Sādhu vata me āyasmā āsavānaṃ khayāya dhammaṃ desetū’ti. Tassa manobhāvanīyo bhikkhu āsavānaṃ khayāya dhammaṃ deseti. Ayaṃ, bhikkhu, chaṭṭho samayo manobhāvanīyassa bhikkhuno dassanāya upasaṅkamituṃ. ‘‘Sammukhā metaṃ, āvuso, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘ime kho, bhikkhu, cha samayā manobhāvanīyassa bhikkhuno dassanāya upasaṅkamitu’’’nti. Aṭṭhamaṃ.",
      "english": "At one time, many elder bhikkhus were staying in Bārāṇasī, at Isipatana, in the Deer Park. Then, after the meal, having returned from their alms-round, those elder bhikkhus, sitting together assembled in the round pavilion, this conversation arose among them: \"Friends, what is indeed the proper time to approach a bhikkhu whose mind is cultivated?\" When this was said, a certain bhikkhu said to the elder bhikkhus: \"Friends, the time when a bhikkhu whose mind is cultivated, having returned from his alms-round after the meal, having washed his feet, is seated, having folded his legs crosswise, having set his body upright, and having established mindfulness in front of him — that is the proper time to approach a bhikkhu whose mind is cultivated.\" When this was said, another bhikkhu said to that bhikkhu: \"Friends, that is not indeed the proper time to approach a bhikkhu whose mind is cultivated. Friends, the time when a bhikkhu whose mind is cultivated, having returned from his alms-round after the meal, having washed his feet, is seated, having folded his legs crosswise, having set his body upright, and having established mindfulness in front of him — at that time, the weariness from his wandering for alms is not yet fully subsided for him, nor is the weariness from his meal yet fully subsided for him. Therefore, that is not the proper time to approach a bhikkhu whose mind is cultivated. Friends, the time when a bhikkhu whose mind is cultivated, having arisen from his seclusion in the evening, is seated in the shade behind the monastery, having folded his legs crosswise, having set his body upright, and having established mindfulness in front of him — that is the proper time to approach a bhikkhu whose mind is cultivated.\" When this was said, another bhikkhu said to that bhikkhu: \"Friends, that is not indeed the proper time to approach a bhikkhu whose mind is cultivated. Friends, the time when a bhikkhu whose mind is cultivated, having arisen from his seclusion in the evening, is seated in the shade behind the monastery, having folded his legs crosswise, having set his body upright, and having established mindfulness in front of him — whatever meditation object he had attended to during the day, that very object recurs to him at that time. Therefore, that is not the proper time to approach a bhikkhu whose mind is cultivated. Friends, the time when a bhikkhu whose mind is cultivated, having risen at dawn in the last watch of the night, is seated, having folded his legs crosswise, having set his body upright, and having established mindfulness in front of him — that is the proper time to approach a bhikkhu whose mind is cultivated.\" When this was said, another bhikkhu said to that bhikkhu: \"Friends, that is not indeed the proper time to approach a bhikkhu whose mind is cultivated. Friends, the time when a bhikkhu whose mind is cultivated, having risen at dawn in the last watch of the night, is seated, having folded his legs crosswise, having set his body upright, and having established mindfulness in front of him — at that time, his body is feeling invigorated, and it is conducive for him to apply his mind to the Buddha's teaching. Therefore, that is not the proper time to approach a bhikkhu whose mind is cultivated.\"\n\nWhen this was said, the Venerable Mahākaccāna said to the elder bhikkhus: \"Friends, I have heard and received this directly from the Blessed One himself: 'Bhikkhus, there are these six proper times to approach a bhikkhu whose mind is cultivated.'\" \"Which six? Here, bhikkhus, when a bhikkhu dwells with his mind overcome by sensual desire, obsessed by sensual desire, and he does not understand as it truly is the escape from the sensual desire that has arisen — at that time, one should approach the bhikkhu whose mind is cultivated and say to him thus: 'Friends, I dwell with my mind overcome by sensual desire, obsessed by sensual desire, and I do not understand as it truly is the escape from the sensual desire that has arisen. It would be good if the Venerable One would teach me the Dhamma for the abandoning of sensual desire.' Then the bhikkhu whose mind is cultivated teaches him the Dhamma for the abandoning of sensual desire. This, bhikkhus, is the first proper time to approach a bhikkhu whose mind is cultivated.\n\n\"Furthermore, bhikkhus, when a bhikkhu dwells with his mind overcome by ill-will, obsessed by ill-will, and he does not understand as it truly is the escape from the ill-will that has arisen — at that time, one should approach the bhikkhu whose mind is cultivated and say to him thus: 'Friends, I dwell with my mind overcome by ill-will, obsessed by ill-will, and I do not understand as it truly is the escape from the ill-will that has arisen. It would be good if the Venerable One would teach me the Dhamma for the abandoning of ill-will.' Then the bhikkhu whose mind is cultivated teaches him the Dhamma for the abandoning of ill-will. This, bhikkhus, is the second proper time to approach a bhikkhu whose mind is cultivated.\n\n\"Furthermore, bhikkhus, when a bhikkhu dwells with his mind overcome by sloth and torpor, obsessed by sloth and torpor, and he does not understand as it truly is the escape from the sloth and torpor that has arisen — at that time, one should approach the bhikkhu whose mind is cultivated and say to him thus: 'Friends, I dwell with my mind overcome by sloth and torpor, obsessed by sloth and torpor, and I do not understand as it truly is the escape from the sloth and torpor that has arisen. It would be good if the Venerable One would teach me the Dhamma for the abandoning of sloth and torpor.' Then the bhikkhu whose mind is cultivated teaches him the Dhamma for the abandoning of sloth and torpor. This, bhikkhus, is the third proper time to approach a bhikkhu whose mind is cultivated.\n\n\"Furthermore, bhikkhus, when a bhikkhu dwells with his mind overcome by restlessness and remorse, obsessed by restlessness and remorse, and he does not understand as it truly is the escape from the restlessness and remorse that have arisen — at that time, one should approach the bhikkhu whose mind is cultivated and say to him thus: 'Friends, I dwell with my mind overcome by restlessness and remorse, obsessed by restlessness and remorse, and I do not understand as it truly is the escape from the restlessness and remorse that have arisen. It would be good if the Venerable One would teach me the Dhamma for the abandoning of restlessness and remorse.' Then the bhikkhu whose mind is cultivated teaches him the Dhamma for the abandoning of restlessness and remorse. This, bhikkhus, is the fourth proper time to approach a bhikkhu whose mind is cultivated.\n\n\"Furthermore, bhikkhus, when a bhikkhu dwells with his mind overcome by doubt, obsessed by doubt, and he does not understand as it truly is the escape from the doubt that has arisen — at that time, one should approach the bhikkhu whose mind is cultivated and say to him thus: 'Friends, I dwell with my mind overcome by doubt, obsessed by doubt, and I do not understand as it truly is the escape from the doubt that has arisen. It would be good if the Venerable One would teach me the Dhamma for the abandoning of doubt.' Then the bhikkhu whose mind is cultivated teaches him the Dhamma for the abandoning of doubt. This, bhikkhus, is the fifth proper time to approach a bhikkhu whose mind is cultivated.\n\n\"Furthermore, bhikkhus, when, relying on which sign, by attending to which sign, the destruction of the taints immediately follows, but he does not know or see that sign — at that time, one should approach the bhikkhu whose mind is cultivated and say to him thus: 'Friends, relying on which sign, by attending to which sign, the destruction of the taints immediately follows, I do not know or see that sign. It would be good if the Venerable One would teach me the Dhamma for the destruction of the taints.' Then the bhikkhu whose mind is cultivated teaches him the Dhamma for the destruction of the taints.\"\n\nMonk, this is the sixth occasion for approaching a monk who is cultivating his mind. Friend, I have heard this directly from the Blessed One, directly received it: 'Monk, these are the six occasions for approaching a monk who is cultivating his mind.'",
      "sinhala": "එක් සමයක බොහෝ රහත් භික්ෂූන් වහන්සේලා බරණැසෙහි ඉසිපතන මිගදාය නම් ස්ථානයේ වැඩවසමින් සිටියහ. එක් දිනක් දන් වළඳා, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, මණ්ඩලමාලකයේ රැස්ව වැඩහිඳ සිටි ඒ රහත් භික්ෂූන් වහන්සේලාට මේ අන්තරා කථාව හටගත්තේය: ‘‘ඇවැත්නි, සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලය කවරේ ද?’’\n\nමෙසේ කී කල්හි එක්තරා භික්ෂුවක් ඒ රහත් භික්ෂූන් වහන්සේලාට මෙසේ කීවේය: ‘‘ඇවැත්නි, යම් කලෙක සිත් දියුණු කළ භික්ෂුවක් දන් වළඳා, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, පා දොවාගෙන, පලක් බැඳ, ඍජු කයින් යුතුව, සිහිය මුහුණට පිහිටුවාගෙන වැඩහිඳ සිටී ද, ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයයි.’’\n\nමෙසේ කී කල්හි තවත් එක්තරා භික්ෂුවක් ඒ භික්ෂුවට මෙසේ කීවේය: ‘‘ඇවැත්නි, ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයක් නොවේ. ඇවැත්නි, යම් කලෙක සිත් දියුණු කළ භික්ෂුවක් දන් වළඳා, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, පා දොවාගෙන, පලක් බැඳ, ඍජු කයින් යුතුව, සිහිය මුහුණට පිහිටුවාගෙන වැඩහිඳ සිටී ද, ඒ වේලාවෙහි ඔහුගේ චාරිකා වෙහෙස ද, ආහාර වෙහෙස ද සන්සිඳී නොපවතී. එබැවින් ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයක් නොවේ. ඇවැත්නි, යම් කලෙක සිත් දියුණු කළ භික්ෂුවක් සවස් කාලයෙහි භාවනාවෙන් නැඟිට, විහාරයේ පසුපස සෙවණෙහි පලක් බැඳ, ඍජු කයින් යුතුව, සිහිය මුහුණට පිහිටුවාගෙන වැඩහිඳ සිටී ද, ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයයි.’’\n\nමෙසේ කී කල්හි තවත් එක්තරා භික්ෂුවක් ඒ භික්ෂුවට මෙසේ කීවේය: ‘‘ඇවැත්නි, ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයක් නොවේ. ඇවැත්නි, යම් කලෙක සිත් දියුණු කළ භික්ෂුවක් සවස් කාලයෙහි භාවනාවෙන් නැඟිට, විහාරයේ පසුපස සෙවණෙහි පලක් බැඳ, ඍජු කයින් යුතුව, සිහිය මුහුණට පිහිටුවාගෙන වැඩහිඳ සිටී ද, දිවා කාලයේ දී යම් සමාධි නිමිත්තක් මෙනෙහි කර සිටියේ ද, ඒ (නිමිත්ත) ම ඒ වේලාවෙහි ඔහුගේ සිතට නැඟෙයි. එබැවින් ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයක් නොවේ. ඇවැත්නි, යම් කලෙක සිත් දියුණු කළ භික්ෂුවක් රාත්‍රියෙහි අලුයම් කාලයෙහි පිබිද, පලක් බැඳ, ඍජු කයින් යුතුව, සිහිය මුහුණට පිහිටුවාගෙන වැඩහිඳ සිටී ද, ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයයි.’’\n\nමෙසේ කී කල්හි තවත් එක්තරා භික්ෂුවක් ඒ භික්ෂුවට මෙසේ කීවේය: ‘‘ඇවැත්නි, ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයක් නොවේ. ඇවැත්නි, යම් කලෙක සිත් දියුණු කළ භික්ෂුවක් රාත්‍රියෙහි අලුයම් කාලයෙහි පිබිද, පලක් බැඳ, ඍජු කයින් යුතුව, සිහිය මුහුණට පිහිටුවාගෙන වැඩහිඳ සිටී ද, ඒ වේලාවෙහි ඔහුගේ ශරීරය ප්‍රබෝධමත්ව පවතී. බුදුරජාණන් වහන්සේලාගේ ශාසනය (ධර්මය) මෙනෙහි කිරීමට ද එය සුදුසු වේ. එබැවින් ඒ කාලය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු කාලයක් නොවේ.’’\n\nමෙසේ කී කල්හි ආයුෂ්මත් මහාකච්චාන ස්ථවිරයන් වහන්සේ ඒ රහත් භික්ෂූන් වහන්සේලාට මෙසේ කීවේය: ‘‘ඇවැත්නි, මේ ධර්මය භාග්‍යවතුන් වහන්සේගෙන් මා විසින් අසා ඇත, භාග්‍යවතුන් වහන්සේ ඉදිරියේ දී ම ග්‍රහණය කරගෙන ඇත. ‘භික්ෂුව, සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට මේ කාලයෝ සය දෙනෙක් වෙති.’\n\nඒ සය දෙනා කවරහු ද? භික්ෂුව, මෙහි යම් කලෙක භික්ෂුවක් කාමරාගයෙන් යටවූ සිතින් යුතුව, කාමරාගයෙන් පෙළුණු සිතින් යුතුව වාසය කරයි ද, හටගත් කාමරාගයෙන් මිදීම යථාභූතව නොදනී ද, ඒ වේලාවෙහි සිත් දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ කිව යුත්තේය: ‘‘ඇවැත්නි, මා කාමරාගයෙන් යටවූ සිතින්, කාමරාගයෙන් පෙළුණු සිතින් වාසය කරමි. හටගත් කාමරාගයෙන් මිදීම යථාභූතව නොදනිමි. වහන්ස, කාමරාගය ප්‍රහාණය කිරීම පිණිස මට ධර්මය දේශනා කරනු මැනැවි!’’ එවිට සිත් දියුණු කළ භික්ෂුව ඔහුට කාමරාගය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කරයි. භික්ෂුව, මෙය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු පළමු වන කාලයයි.\n\nතවද භික්ෂුව, යම් කලෙක භික්ෂුවක් ව්‍යාපාදයෙන් යටවූ සිතින් යුතුව, ව්‍යාපාදයෙන් පෙළුණු සිතින් යුතුව වාසය කරයි ද, හටගත් ව්‍යාපාදයෙන් මිදීම යථාභූතව නොදනී ද, ඒ වේලාවෙහි සිත් දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ කිව යුත්තේය: ‘‘ඇවැත්නි, මා ව්‍යාපාදයෙන් යටවූ සිතින්, ව්‍යාපාදයෙන් පෙළුණු සිතින් වාසය කරමි. හටගත් ව්‍යාපාදයෙන් මිදීම යථාභූතව නොදනිමි. වහන්ස, ව්‍යාපාදය ප්‍රහාණය කිරීම පිණිස මට ධර්මය දේශනා කරනු මැනැවි!’’ එවිට සිත් දියුණු කළ භික්ෂුව ඔහුට ව්‍යාපාදය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කරයි. භික්ෂුව, මෙය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු දෙවන කාලයයි.\n\nතවද භික්ෂුව, යම් කලෙක භික්ෂුවක් ථීනමිද්ධයෙන් යටවූ සිතින් යුතුව, ථීනමිද්ධයෙන් පෙළුණු සිතින් යුතුව වාසය කරයි ද, හටගත් ථීනමිද්ධයෙන් මිදීම යථාභූතව නොදනී ද, ඒ වේලාවෙහි සිත් දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ කිව යුත්තේය: ‘‘ඇවැත්නි, මා ථීනමිද්ධයෙන් යටවූ සිතින්, ථීනමිද්ධයෙන් පෙළුණු සිතින් වාසය කරමි. හටගත් ථීනමිද්ධයෙන් මිදීම යථාභූතව නොදනිමි. වහන්ස, ථීනමිද්ධය ප්‍රහාණය කිරීම පිණිස මට ධර්මය දේශනා කරනු මැනැවි!’’ එවිට සිත් දියුණු කළ භික්ෂුව ඔහුට ථීනමිද්ධය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කරයි. භික්ෂුව, මෙය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු තෙවන කාලයයි.\n\nතවද භික්ෂුව, යම් කලෙක භික්ෂුවක් උද්ධච්චකුක්කුච්චයෙන් යටවූ සිතින් යුතුව, උද්ධච්චකුක්කුච්චයෙන් පෙළුණු සිතින් යුතුව වාසය කරයි ද, හටගත් උද්ධච්චකුක්කුච්චයෙන් මිදීම යථාභූතව නොදනී ද, ඒ වේලාවෙහි සිත් දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ කිව යුත්තේය: ‘‘ඇවැත්නි, මා උද්ධච්චකුක්කුච්චයෙන් යටවූ සිතින්, උද්ධච්චකුක්කුච්චයෙන් පෙළුණු සිතින් වාසය කරමි. හටගත් උද්ධච්චකුක්කුච්චයෙන් මිදීම යථාභූතව නොදනිමි. වහන්ස, උද්ධච්චකුක්කුච්චය ප්‍රහාණය කිරීම පිණිස මට ධර්මය දේශනා කරනු මැනැවි!’’ එවිට සිත් දියුණු කළ භික්ෂුව ඔහුට උද්ධච්චකුක්කුච්චය ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කරයි. භික්ෂුව, මෙය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු සිව්වන කාලයයි.\n\nතවද භික්ෂුව, යම් කලෙක භික්ෂුවක් විචිකිච්ඡාවෙන් යටවූ සිතින් යුතුව, විචිකිච්ඡාවෙන් පෙළුණු සිතින් යුතුව වාසය කරයි ද, හටගත් විචිකිච්ඡාවෙන් මිදීම යථාභූතව නොදනී ද, ඒ වේලාවෙහි සිත් දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ කිව යුත්තේය: ‘‘ඇවැත්නි, මා විචිකිච්ඡාවෙන් යටවූ සිතින්, විචිකිච්ඡාවෙන් පෙළුණු සිතින් වාසය කරමි. හටගත් විචිකිච්ඡාවෙන් මිදීම යථාභූතව නොදනිමි. වහන්ස, විචිකිච්ඡාව ප්‍රහාණය කිරීම පිණිස මට ධර්මය දේශනා කරනු මැනැවි!’’ එවිට සිත් දියුණු කළ භික්ෂුව ඔහුට විචිකිච්ඡාව ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කරයි. භික්ෂුව, මෙය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු පස්වන කාලයයි.\n\nතවද භික්ෂුව, යම් නිමිත්තක් අරමුණු කරගෙන, යම් නිමිත්තක් මෙනෙහි කිරීමෙන් ක්ෂණිකව ආශ්‍රවයන්ගේ ක්ෂය වීම සිදුවේ ද, ඒ නිමිත්ත නොදනී ද, නොදකී ද, ඒ වේලාවෙහි සිත් දියුණු කළ භික්ෂුවක් වෙත ගොස් මෙසේ කිව යුත්තේය: ‘‘ඇවැත්නි, මා යම් නිමිත්තක් අරමුණු කරගෙන, යම් නිමිත්තක් මෙනෙහි කිරීමෙන් ක්ෂණිකව ආශ්‍රවයන්ගේ ක්ෂය වීම සිදුවේ ද, ඒ නිමිත්ත නොදනිමි, නොදකිමි. වහන්ස, ආශ්‍රවයන්ගේ ක්ෂය කිරීම පිණිස මට ධර්මය දේශනා කරනු මැනැවි!’’ එවිට සිත් දියුණු කළ භික්ෂුව ඔහුට ආශ්‍රවයන්ගේ ක්ෂය කිරීම පිණිස ධර්මය දේශනා කරයි. භික්ෂුව, මෙය සිත් දියුණු කළ භික්ෂුවක් දැකීම පිණිස උපසංක්‍රමණය කිරීමට සුදුසු සයවන කාලයයි.\n\nමහණෙනි, මනස භාවනා කරන භික්ෂුවක් දර්ශනයට පැමිණීමට මෙය හයවන අවස්ථාවයි.\n\nආයුෂ්මතුනි, මෙය මා විසින් භාග්‍යවතුන් වහන්සේගෙන් සෘජුවම අසා, සෘජුවම පිළිගන්නා ලද්දකි – ‘මහණෙනි, මනස භාවනා කරන භික්ෂුවක් දර්ශනයට පැමිණීමට මේවා සැබවින්ම අවස්ථා හයකි’ යනුයි.\n\nඅටවැනිය.",
      "paliTitle": "Dutiyasamayasuttaṃ",
      "englishTitle": "Second Discourse on the Gathering",
      "sinhalaTitle": "දෙවන සමය සූත්‍රය"
    },
    {
      "number": 29,
      "pali": "Atha kho bhagavā āyasmantaṃ udāyiṃ āmantesi – ‘‘kati nu kho, udāyi, anussatiṭṭhānānī’’ti? Evaṃ vutte āyasmā udāyī tuṇhī ahosi. Dutiyampi kho bhagavā āyasmantaṃ udāyiṃ āmantesi – ‘‘kati nu kho, udāyi, anussatiṭṭhānānī’’ti? Dutiyampi kho āyasmā udāyī tuṇhī ahosi. Tatiyampi kho bhagavā āyasmantaṃ udāyiṃ āmantesi – ‘‘kati nu kho, udāyi, anussatiṭṭhānānī’’ti? Tatiyampi kho āyasmā udāyī tuṇhī ahosi. Atha kho āyasmā ānando āyasmantaṃ udāyiṃ etadavoca – ‘‘satthā taṃ, āvuso udāyi, āmantesī’’ti. ‘‘Suṇomahaṃ, āvuso ānanda, bhagavato. Idha, bhante, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati – seyyathidaṃ ekampi jātiṃ dvepi jātiyo…pe…. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Idaṃ, bhante, anussatiṭṭhāna’’nti. Atha kho bhagavā āyasmantaṃ ānandaṃ āmantesi – ‘‘aññāsiṃ kho ahaṃ, ānanda – ‘nevāyaṃ udāyī moghapuriso adhicittaṃ anuyutto viharatī’ti. Kati nu kho, ānanda, anussatiṭṭhānānī’’ti? ‘‘Pañca, bhante, anussatiṭṭhānāni. Katamāni pañca? Idha, bhante, bhikkhu vivicceva kāmehi…pe… tatiyaṃ jhānaṃ upasampajja viharati. Idaṃ, bhante, anussatiṭṭhānaṃ evaṃ bhāvitaṃ evaṃ bahulīkataṃ diṭṭhadhammasukhavihārāya saṃvattati. ‘‘Puna caparaṃ, bhante, bhikkhu ālokasaññaṃ manasi karoti, divā saññaṃ adhiṭṭhāti, yathā divā tathā rattiṃ, yathā rattiṃ tathā divā; iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Idaṃ, bhante, anussatiṭṭhānaṃ evaṃ bhāvitaṃ evaṃ bahulīkataṃ ñāṇadassanappaṭilābhāya saṃvattati. ‘‘Puna caparaṃ, bhante, bhikkhu imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā nakhā dantā taco maṃsaṃ nhāru [nahāru (sī. pī.) dī. ni. 2.377; ma. ni. 1.110] aṭṭhi aṭṭhimiñjaṃ vakkaṃ hadayaṃ yakanaṃ kilomakaṃ pihakaṃ papphāsaṃ antaṃ antaguṇaṃ udariyaṃ karīsaṃ pittaṃ semhaṃ pubbo lohitaṃ sedo medo assu vasā kheḷo siṅghāṇikā lasikā mutta’nti. Idaṃ, bhante, anussatiṭṭhānaṃ evaṃ bhāvitaṃ evaṃ bahulīkataṃ kāmarāgappahānāya saṃvattati. ‘‘Puna caparaṃ, bhante, bhikkhu seyyathāpi passeyya sarīraṃ sīvathikāya chaḍḍitaṃ [chaḍḍitaṃ (sī. syā. pī.)] ekāhamataṃ vā dvīhamataṃ vā tīhamataṃ vā uddhumātakaṃ vinīlakaṃ vipubbakajātaṃ. So imameva kāyaṃ evaṃ [evanti idaṃ satipaṭṭhānasuttādīsu natthi] upasaṃharati – ‘ayampi kho kāyo evaṃdhammo evaṃbhāvī evaṃanatīto’’’ti [etaṃ anatītoti (sī.)]. ‘‘Seyyathāpi vā pana [seyyathā vā pana (syā.)] passeyya sarīraṃ sīvathikāya chaḍḍitaṃ kākehi vā khajjamānaṃ kulalehi vā khajjamānaṃ gijjhehi vā khajjamānaṃ sunakhehi vā khajjamānaṃ siṅgālehi [sigālehi (sī.)] vā khajjamānaṃ vividhehi vā pāṇakajātehi khajjamānaṃ. So imameva kāyaṃ evaṃ upasaṃharati – ‘ayampi kho kāyo evaṃdhammo evaṃbhāvī evaṃanatīto’’’ti. ‘‘Seyyathāpi vā pana passeyya sarīraṃ sīvathikāya chaḍḍitaṃ aṭṭhikasaṅkhalikaṃ samaṃsalohitaṃ nhārusambandhaṃ…pe… aṭṭhikasaṅkhalikaṃ nimmaṃsalohitamakkhitaṃ nhārusambandhaṃ… aṭṭhikasaṅkhalikaṃ apagatamaṃsalohitaṃ nhārusambandhaṃ. Aṭṭhikāni apagatasambandhāni disāvidisāvikkhittāni [disāvidisāsu vikkhittāni (sī.)], aññena hatthaṭṭhikaṃ aññena pādaṭṭhikaṃ aññena jaṅghaṭṭhikaṃ aññena ūruṭṭhikaṃ aññena kaṭiṭṭhikaṃ [kaṭaṭṭhikaṃ (sī.)] aññena [piṭṭhikaṇḍakaṃ aññena sīsakaṭāhaṃ (sī. pī.), piṭṭhikaṇḍakaṭṭhikaṃ aññena sīsakaṭāhaṃ (syā. kaṃ.)] phāsukaṭṭhikaṃ aññena piṭṭhikaṇṭakaṭṭhikaṃ aññena khandhaṭṭhikaṃ aññena gīvaṭṭhikaṃ aññena hanukaṭṭhikaṃ aññena dantakaṭṭhikaṃ aññena sīsakaṭāhaṃ [piṭṭhikaṇḍakaṃ aññena sīsakaṭāhaṃ (sī. pī.), piṭṭhikaṇḍakaṭṭhikaṃ aññena sīsakaṭāhaṃ (syā. kaṃ.)], aṭṭhikāni setāni saṅkhavaṇṇappaṭibhāgāni [saṅkhavaṇṇūpanibhāni (sī. syā. pī.)] aṭṭhikāni puñjakitāni [puñjakatāni (pī.)] terovassikāni aṭṭhikāni pūtīni cuṇṇakajātāni. So imameva kāyaṃ evaṃ upasaṃharati – ‘ayampi kho kāyo evaṃdhammo evaṃbhāvī evaṃanatīto’ti. Idaṃ, bhante, anussatiṭṭhānaṃ evaṃ bhāvitaṃ evaṃ bahulīkataṃ asmimānasamugghātāya saṃvattati. ‘‘Puna caparaṃ, bhante, bhikkhu sukhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. Idaṃ, bhante, anussatiṭṭhānaṃ evaṃ bhāvitaṃ evaṃ bahulīkataṃ anekadhātupaṭivedhāya saṃvattati. Imāni kho, bhante, pañca anussatiṭṭhānānī’’ti. ‘‘Sādhu, sādhu, ānanda! Tena hi tvaṃ, ānanda, idampi chaṭṭhaṃ anussatiṭṭhānaṃ dhārehi. Idhānanda, bhikkhu satova abhikkamati satova paṭikkamati satova tiṭṭhati satova nisīdati satova seyyaṃ kappeti satova kammaṃ adhiṭṭhāti. Idaṃ, ānanda, anussatiṭṭhānaṃ evaṃ bhāvitaṃ evaṃ bahulīkataṃ satisampajaññāya saṃvattatī’’ti. Navamaṃ.",
      "english": "Then the Blessed One addressed Venerable Udayin, \"Udayin, how many are the bases for recollection?\" When this was said, Venerable Udayin remained silent. A second time, the Blessed One addressed Venerable Udayin, \"Udayin, how many are the bases for recollection?\" A second time, Venerable Udayin remained silent. A third time, the Blessed One addressed Venerable Udayin, \"Udayin, how many are the bases for recollection?\" A third time, Venerable Udayin remained silent. Then Venerable Ananda said to Venerable Udayin, \"Friend Udayin, the Teacher is addressing you.\"\n\n\"I am listening to the Blessed One, friend Ananda. Here, venerable sir, a monk recollects his manifold past existences, that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births; many aeons of cosmic contraction, many aeons of cosmic expansion, many aeons of cosmic contraction and expansion. He recollects: ‘There I was named thus, of such a clan, of such an appearance, fed in such a way, experienced such pleasure and pain, lived for so long. Passing away from there, I was reborn elsewhere. There too I was named thus, of such a clan, of such an appearance, fed in such a way, experienced such pleasure and pain, lived for so long. Passing away from there, I was reborn here.’ Thus, with all details and characteristics, he recollects his manifold past existences. This, venerable sir, is a basis for recollection.\"\n\nThen the Blessed One addressed Venerable Ananda, \"Ananda, I knew that this Udayin, this worthless person, does not abide devoted to the higher mind. Ananda, how many are the bases for recollection?\"\n\n\"Venerable sir, there are five bases for recollection. Which five? Here, venerable sir, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and abides in the first jhāna, which is accompanied by applied and sustained thought, born of seclusion, and filled with rapture and pleasure. With the stilling of applied and sustained thought, he enters and abides in the second jhāna, which has internal confidence and unification of mind, is free from applied and sustained thought, born of concentration, and filled with rapture and pleasure. With the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body; he enters and abides in the third jhāna, of which the noble ones declare, ‘He dwells in pleasure with equanimity and mindfulness.’ This, venerable sir, is a basis for recollection which, when developed and frequently practiced in this way, leads to a pleasant abiding in this very life.\n\n\"Furthermore, venerable sir, a monk attends to the perception of light; he fixes his mind on the perception of daytime, so that as it is by day so it is by night, and as it is by night so it is by day. Thus, with an open and unhindered mind, he develops a mind full of radiance. This, venerable sir, is a basis for recollection which, when developed and frequently practiced in this way, leads to the acquisition of knowledge and vision.\n\n\"Furthermore, venerable sir, a monk contemplates this very body, from the soles of the feet upwards, from the crown of the head downwards, enclosed by skin, full of manifold impurities, reflecting: ‘There is in this body hair of the head, hair of the body, nails, teeth, skin, flesh, sinews, bones, bone marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, intestinal mesentery, stomach, feces, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, joint-fluid, urine.’ This, venerable sir, is a basis for recollection which, when developed and frequently practiced in this way, leads to the abandoning of sensual passion.\n\n\"Furthermore, venerable sir, a monk might see a body cast away in a charnel ground, one day dead, two days dead, or three days dead, bloated, discolored, and festering. He then applies this perception to his own body: ‘This body too is of the same nature, it will be like that, it is not exempt from that fate.’\n\n\"Or again, venerable sir, a monk might see a body cast away in a charnel ground, being devoured by crows, or by kites, or by vultures, or by dogs, or by jackals, or by various kinds of maggots. He then applies this perception to his own body: ‘This body too is of the same nature, it will be like that, it is not exempt from that fate.’\n\n\"Or again, venerable sir, a monk might see a body cast away in a charnel ground: a skeleton with flesh and blood, held together by tendons; a skeleton without flesh but smeared with blood, held together by tendons; a skeleton without flesh and blood, held together by tendons. He might see bones disjoined and scattered in all directions—a hand-bone here, a foot-bone there, a shin-bone here, a thigh-bone there, a hip-bone here, a rib-bone here, a spine-bone here, a shoulder-bone here, a neck-bone here, a jaw-bone here, a tooth-bone here, a skull here. He might see bones bleached white, resembling a conch shell; bones piled up, more than a year old; bones disintegrated into dust. He then applies this perception to his own body: ‘This body too is of the same nature, it will be like that, it is not exempt from that fate.’ This, venerable sir, is a basis for recollection which, when developed and frequently practiced in this way, leads to the uprooting of the conceit ‘I am’.\n\n\"Furthermore, venerable sir, a monk, with the abandoning of pleasure and pain, and with the previous disappearance of joy and grief, enters and abides in the fourth jhāna, which is neither painful nor pleasant, and purified by equanimity and mindfulness. This, venerable sir, is a basis for recollection which, when developed and frequently practiced in this way, leads to the penetration of many elements of existence.\"\n\n\"Indeed, Venerable Sir, these are the five grounds for recollection.\"\n\n\"Excellent, excellent, Ananda! Therefore, Ananda, hold this also as the sixth ground for recollection. Here, Ananda, a monk goes forward mindfully, goes back mindfully, stands mindfully, sits mindfully, lies down mindfully, and undertakes work mindfully. This ground for recollection, Ananda, when thus developed and repeatedly cultivated, conduces to mindfulness and clear comprehension.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් උදායි තෙරුන්ට ආමන්ත්‍රණය කර, “උදායි, අනුස්සතිස්ථාන කීයක් තිබේදැයි” විචාළහ. මෙසේ විචාළ කල්හි ආයුෂ්මත් උදායි තෙරුන් නිහඬව සිටියේය. දෙවෙනි වරටත් භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් උදායි තෙරුන්ට ආමන්ත්‍රණය කර, “උදායි, අනුස්සතිස්ථාන කීයක් තිබේදැයි” විචාළහ. දෙවෙනි වරටත් ආයුෂ්මත් උදායි තෙරුන් නිහඬව සිටියේය. තුන්වෙනි වරටත් භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් උදායි තෙරුන්ට ආමන්ත්‍රණය කර, “උදායි, අනුස්සතිස්ථාන කීයක් තිබේදැයි” විචාළහ. තුන්වෙනි වරටත් ආයුෂ්මත් උදායි තෙරුන් නිහඬව සිටියේය. එවිට ආයුෂ්මත් ආනන්ද තෙරුන් ආයුෂ්මත් උදායි තෙරුන්ට මෙසේ කීවේය: “ඇවැත් උදායි, ශාස්තෲන් වහන්සේ ඔබ කැඳවූ සේක.” (එවිට ආයුෂ්මත් උදායි තෙරුන් කීවේය:) “ඇවැත් ආනන්ද, මම භාග්‍යවතුන් වහන්සේට ශ්‍රවණය කරමි. වහන්ස, මෙහිලා භික්ෂුව නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරයි. එනම්, එක් ආත්මයක්, දෙආත්මයක්, යනාදී වශයෙන් ආකාර සහිතව, විස්තර සහිතව නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරයි. වහන්ස, මෙය අනුස්සතිස්ථානයකි.”\n\nඑවිට භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද තෙරුන්ට ආමන්ත්‍රණය කර මෙසේ වදාළහ: “ආනන්ද, ‘මේ උදායි නම් හිස් පුරුෂයා අධිචිත්ත ශික්ෂාවෙහි යෙදී වාසය නොකරයි’ යන බව මම දැන සිටියෙමි. ආනන්ද, අනුස්සතිස්ථාන කීයක් තිබේද?” (ආනන්ද තෙරුන් කීවේය:) “වහන්ස, අනුස්සතිස්ථාන පහකි. ඒ පහ කවරේද? වහන්ස, මෙහිලා භික්ෂුව කාමයන්ගෙන් වෙන්ව... යනාදී වශයෙන් තුන්වන ධ්‍යානයට එළඹ වාසය කරයි. වහන්ස, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද මේ අනුස්සතිස්ථානය මේ ආත්මභාවයේදීම සුව විහරණය පිණිස පවතී.\n\n“තවද, වහන්ස, භික්ෂුව ආලෝක සංඥාව මෙනෙහි කරයි. දිවා සංඥාව අධිෂ්ඨාන කරයි. දවාලෙහි යම්සේද, රාත්‍රියෙහිද එසේමය. රාත්‍රියෙහි යම්සේද, දවාලෙහිද එසේමය. මෙසේ විවෘත වූ, අවුරන ලද්දක් නැති සිතින් ආලෝක සහිත සිත වඩයි. වහන්ස, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද මේ අනුස්සතිස්ථානය ඥානදර්ශනය ලැබීම පිණිස පවතී.\n\n“තවද, වහන්ස, භික්ෂුව පාදතලයේ සිට ඉහළටද, කෙස් අග සිට පහළටද, සමෙන් අවසන් වන, නොයෙක් ආකාර වූ අශුචියෙන් පිරුණු මේ ශරීරය මෙසේ විමසා බලයි: ‘මේ කයෙහි කෙස්, ලොම්, නිය, දත්, සම, මස්, නහර, ඇට, ඇටමිදුළු, වකුගඩු, හෘදය, අක්මාව, දලබුව, ප්ලීහාව, පෙනහළු, බඩවැල්, බඩවැල් කැරලි, බඩවැලෙහි ඇති දේ, මළමුත්‍රා, පිත, සෙම, සැරව, ලේ, දහදිය, මේදය, කඳුළු, වුරුණු තෙල්, කෙළ, සොටු, ලසිකා, මුත්‍රා යන දේ ඇතැයි.’ වහන්ස, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද මේ අනුස්සතිස්ථානය කාමරාගය ප්‍රහාණය කිරීම පිණිස පවතී.\n\n“තවද, වහන්ස, යම්සේ භික්ෂුව සුසානයෙහි දමන ලද, එක් දිනක් මළ, දෙදිනක් මළ, තෙදිනක් මළ, ඉදිමුණු, නිල් පැහැ ගැන්වුණු, සැරව සහිත වූ සිරුරක් දකීද, ඒ භික්ෂුව මේ කයද එබඳු ස්වභාවයක් ඇත්තේය, මෙබඳු බවට පත්වන්නේය, මෙයින් නොඉක්මවන්නේයැයි මෙසේ තමාටම උපමා කරයි.\n\n“නැතහොත්, යම්සේ භික්ෂුව සුසානයෙහි දමන ලද, කපුටන් විසින් හෝ, උකුස්සන් විසින් හෝ, ගිජුලිහිණින් විසින් හෝ, බල්ලන් විසින් හෝ, හිවළුන් විසින් හෝ, නොයෙක් විධ ප්‍රාණීන් විසින් හෝ කනු ලබන සිරුරක් දකීද, ඒ භික්ෂුව මේ කයද එබඳු ස්වභාවයක් ඇත්තේය, මෙබඳු බවට පත්වන්නේය, මෙයින් නොඉක්මවන්නේයැයි මෙසේ තමාටම උපමා කරයි.\n\n“නැතහොත්, යම්සේ භික්ෂුව සුසානයෙහි දමන ලද, මස් ලේ සහිත වූ නහර වලින් බැඳුණු ඇටසැකිල්ලක් දකීද, ... (යනාදී වශයෙන්) මස් ලේ නොමැති, නහර වලින් පමණක් බැඳුණු ඇටසැකිල්ලක් දකීද, ... මස් ලේ පහව ගිය, නහර වලින් බැඳුණු ඇටසැකිල්ලක් දකීද, සම්බන්ධකම් නැතිව දිසා ද උපදිසාද වශයෙන් විසිරී ගිය ඇටද, එක් අතැටියක් එක් තැනක, එක් පාදැටියක් එක් තැනක, එක් කෙණ්ඩැටියක් එක් තැනක, එක් කලවා ඇටයක් එක් තැනක, එක් කටීඇටයක් එක් තැනක, එක් ඉළඇටයක් එක් තැනක, එක් කොඳු ඇටයක් එක් තැනක, එක් කරවැලියක් එක් තැනක, එක් ගෙල ඇටයක් එක් තැනක, එක් හනු ඇටයක් එක් තැනක, එක් දත් ඇටයක් එක් තැනක, එක් හිස් කබලක් එක් තැනක වශයෙන්, සුදු පැහැති, හක්ගෙඩියක වර්ණයට සමාන වූ ඇටද, වසරකට වඩා පැරණි, ගොඩ ගැසූ ඇටද, දිරාපත් වී කුඩු වී ගිය ඇටද දකීද, ඒ භික්ෂුව මේ කයද එබඳු ස්වභාවයක් ඇත්තේය, මෙබඳු බවට පත්වන්නේය, මෙයින් නොඉක්මවන්නේයැයි මෙසේ තමාටම උපමා කරයි. වහන්ස, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද මේ අනුස්සතිස්ථානය ‘මම වෙමි’ යන මානය මුලිනුපුටා දැමීම පිණිස පවතී.\n\n“තවද, වහන්ස, භික්ෂුව සුවයද ප්‍රහාණය කිරීමෙන්... යනාදී වශයෙන් සිව්වන ධ්‍යානයට එළඹ වාසය කරයි. වහන්ස, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද මේ අනුස්සතිස්ථානය නොයෙක් ධාතූන් අවබෝධ කිරීම පිණිස පවතී.\n\nභාග්‍යවතුන් වහන්ස, මේවා පස අනුස්සතිස්ථානයෝය.\n\nආනන්දයෙනි, ඉතා මැනවි, ඉතා මැනවි! එහෙයින් ආනන්දයෙනි, ඔබ මේ සයවැනි අනුස්සතිස්ථානය ද දරාගන්න. ආනන්දයෙනි, මෙහි භික්ෂුව සිහියෙන් යුතුවම ඉදිරියට යයි; සිහියෙන් යුතුවම පසුපසට එයි; සිහියෙන් යුතුවම සිටියි; සිහියෙන් යුතුවම හිඳගනියි; සිහියෙන් යුතුවම සයනය කරයි; සිහියෙන් යුතුවම තම කටයුත්තක් අදිටන් කරයි. ආනන්දයෙනි, මේ අනුස්සතිස්ථානය මෙසේ වඩන ලද්දක්, මෙසේ බහුල වශයෙන් කරන ලද්දක් සතිසම්පජඤ්ඤය පිණිස පවතී. නවවැනි සූත්‍රයයි.",
      "paliTitle": "Udāyīsuttaṃ",
      "englishTitle": "The Udāyī Discourse",
      "sinhalaTitle": "උදායී සූත්‍‍රය"
    },
    {
      "number": 30,
      "pali": "‘‘Chayimāni, bhikkhave, anuttariyāni. Katamāni cha? Dassanānuttariyaṃ, savanānuttariyaṃ, lābhānuttariyaṃ, sikkhānuttariyaṃ, pāricariyānuttariyaṃ, anussatānuttariyanti. ‘‘Katamañca, bhikkhave, dassanānuttariyaṃ? Idha, bhikkhave, ekacco hatthiratanampi dassanāya gacchati, assaratanampi dassanāya gacchati, maṇiratanampi dassanāya gacchati, uccāvacaṃ vā pana dassanāya gacchati, samaṇaṃ vā brāhmaṇaṃ vā micchādiṭṭhikaṃ micchāpaṭipannaṃ dassanāya gacchati. Atthetaṃ, bhikkhave, dassanaṃ; netaṃ natthīti vadāmi. Tañca kho etaṃ, bhikkhave, dassanaṃ hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ, na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Yo ca kho, bhikkhave, tathāgataṃ vā tathāgatasāvakaṃ vā dassanāya gacchati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno, etadānuttariyaṃ, bhikkhave, dassanānaṃ sattānaṃ visuddhiyā sokaparidevānaṃ [sokapariddavānaṃ (sī.)] samatikkamāya dukkhadomanassānaṃ atthaṅgamāya [atthagamāya (sī.)] ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ tathāgataṃ vā tathāgatasāvakaṃ vā dassanāya gacchati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno. Idaṃ vuccati, bhikkhave, dassanānuttariyaṃ. Iti dassanānuttariyaṃ. ‘‘Savanānuttariyañca kathaṃ hoti? Idha, bhikkhave, ekacco bherisaddampi [bherisaddassapi (ka.) evaṃ vīṇāsaddampiiccādīsupi] savanāya gacchati, vīṇāsaddampi savanāya gacchati, gītasaddampi savanāya gacchati, uccāvacaṃ vā pana savanāya gacchati, samaṇassa vā brāhmaṇassa vā micchādiṭṭhikassa micchāpaṭipannassa dhammassavanāya gacchati. Atthetaṃ, bhikkhave, savanaṃ; netaṃ natthīti vadāmi. Tañca kho etaṃ, bhikkhave, savanaṃ hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ, na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Yo ca kho, bhikkhave, tathāgatassa vā tathāgatasāvakassa vā dhammassavanāya gacchati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno, etadānuttariyaṃ, bhikkhave, savanānaṃ sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ tathāgatassa vā tathāgatasāvakassa vā dhammassavanāya gacchati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno. Idaṃ vuccati, bhikkhave, savanānuttariyaṃ. Iti dassanānuttariyaṃ, savanānuttariyaṃ. ‘‘Lābhānuttariyañca kathaṃ hoti? Idha, bhikkhave, ekacco puttalābhampi labhati, dāralābhampi labhati, dhanalābhampi labhati, uccāvacaṃ vā pana lābhaṃ labhati, samaṇe vā brāhmaṇe vā micchādiṭṭhike micchāpaṭipanne saddhaṃ paṭilabhati. Attheso, bhikkhave, lābho; neso natthīti vadāmi. So ca kho eso, bhikkhave, lābho hīno gammo pothujjaniko anariyo anatthasaṃhito, na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Yo ca kho, bhikkhave, tathāgate vā tathāgatasāvake vā saddhaṃ paṭilabhati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno, etadānuttariyaṃ, bhikkhave, lābhānaṃ sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ tathāgate vā tathāgatasāvake vā saddhaṃ paṭilabhati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno. Idaṃ vuccati, bhikkhave, lābhānuttariyaṃ. Iti dassanānuttariyaṃ, savanānuttariyaṃ, lābhānuttariyaṃ. ‘‘Sikkhānuttariyañca kathaṃ hoti? Idha, bhikkhave, ekacco hatthismimpi sikkhati, assasmimpi sikkhati, rathasmimpi sikkhati, dhanusmimpi sikkhati, tharusmimpi sikkhati, uccāvacaṃ vā pana sikkhati, samaṇassa vā brāhmaṇassa vā micchādiṭṭhikassa micchāpaṭipannassa [micchāpaṭipattiṃ (ka.)] sikkhati. Atthesā, bhikkhave, sikkhā; nesā natthīti vadāmi. Sā ca kho esā, bhikkhave, sikkhā hīnā gammā pothujjanikā anariyā anatthasaṃhitā, na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Yo ca kho, bhikkhave, tathāgatappavedite dhammavinaye adhisīlampi sikkhati, adhicittampi sikkhati, adhipaññampi sikkhati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno, etadānuttariyaṃ, bhikkhave, sikkhānaṃ sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ tathāgatappavedite dhammavinaye adhisīlampi sikkhati, adhicittampi sikkhati, adhipaññampi sikkhati, niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno. Idaṃ vuccati, bhikkhave, sikkhānuttariyaṃ. Iti dassanānuttariyaṃ, savanānuttariyaṃ, lābhānuttariyaṃ, sikkhānuttariyaṃ. ‘‘Pāricariyānuttariyañca kathaṃ hoti? Idha, bhikkhave, ekacco khattiyampi paricarati, brāhmaṇampi paricarati, gahapatimpi paricarati, uccāvacaṃ vā pana paricarati, samaṇaṃ vā brāhmaṇaṃ vā micchādiṭṭhikaṃ micchāpaṭipannaṃ paricarati. Atthesā, bhikkhave, pāricariyā; nesā natthīti vadāmi. Sā ca kho esā, bhikkhave, pāricariyā hīnā gammā pothujjanikā anariyā anatthasaṃhitā, na nibbidāya… pe… na nibbānāya saṃvattati. Yo ca kho, bhikkhave, tathāgataṃ vā tathāgatasāvakaṃ vā paricarati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno, etadānuttariyaṃ, bhikkhave, pāricariyānaṃ sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ tathāgataṃ vā tathāgatasāvakaṃ vā paricarati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno. Idaṃ vuccati, bhikkhave, pāricariyānuttariyaṃ. Iti dassanānuttariyaṃ, savanānuttariyaṃ, lābhānuttariyaṃ, sikkhānuttariyaṃ, pāricariyānuttariyaṃ. ‘‘Anussatānuttariyañca kathaṃ hoti? Idha, bhikkhave, ekacco puttalābhampi anussarati, dāralābhampi anussarati, dhanalābhampi anussarati, uccāvacaṃ vā pana lābhaṃ anussarati, samaṇaṃ vā brāhmaṇaṃ vā micchādiṭṭhikaṃ micchāpaṭipannaṃ anussarati. Atthesā, bhikkhave, anussati; nesā natthīti vadāmi. Sā ca kho esā, bhikkhave, anussati hīnā gammā pothujjanikā anariyā anatthasaṃhitā, na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. Yo ca kho, bhikkhave, tathāgataṃ vā tathāgatasāvakaṃ vā anussarati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno, etadānuttariyaṃ, bhikkhave, anussatīnaṃ sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, yadidaṃ tathāgataṃ vā tathāgatasāvakaṃ vā anussarati niviṭṭhasaddho niviṭṭhapemo ekantagato abhippasanno. Idaṃ vuccati, bhikkhave, anussatānuttariyaṃ. Imāni kho, bhikkhave, cha anuttariyānī’’ti. ‘‘Ye dassanānuttaraṃ laddhā [ye dassanavaraṃ laddhā (sī. pī.), dassanānuttariyaṃ laddhā (syā. kaṃ.)], savanañca anuttaraṃ; Lābhānuttariyaṃ laddhā, sikkhānuttariye ratā [anuttariyaṃ tathā (ka.)]. ‘‘Upaṭṭhitā pāricariyā, bhāvayanti anussatiṃ; Vivekappaṭisaṃyuttaṃ, khemaṃ amatagāminiṃ. ‘‘Appamāde pamuditā, nipakā sīlasaṃvutā; Te ve kālena paccenti [paccanti (syā. ka.)], yattha dukkhaṃ nirujjhatī’’ti. dasamaṃ; ",
      "english": "Monks, there are these six unexcelled things. Which six? The unexcelled in seeing, the unexcelled in hearing, the unexcelled in gain, the unexcelled in training, the unexcelled in service, and the unexcelled in recollection.\n\nAnd what, monks, is the unexcelled in seeing? Here, monks, some individual goes to see a noble elephant, goes to see a noble horse, goes to see a noble gem, or indeed goes to see various other things. Or they go to see ascetics or brahmins who hold wrong views and practice wrongly. That seeing, monks, exists; I do not say it does not exist. Yet, monks, that seeing is inferior, vulgar, ordinary, ignoble, and unbeneficial. It does not lead to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, or Nibbana. But, monks, when someone goes to see the Tathagata or a disciple of the Tathagata, deeply rooted in faith, deeply rooted in love, having reached an unwavering conviction, completely serene and confident—this is the unexcelled among all forms of seeing. It leads to the purification of beings, to the overcoming of sorrow and lamentation, to the vanishing of pain and displeasure, to the attainment of the path, and to the realization of Nibbana. This is when one goes to see the Tathagata or a disciple of the Tathagata, deeply rooted in faith, deeply rooted in love, having reached an unwavering conviction, completely serene and confident. This, monks, is called the unexcelled in seeing. Thus, the unexcelled in seeing.\n\nAnd how, monks, is there the unexcelled in hearing? Here, monks, some individual goes to hear the sound of a drum, goes to hear the sound of a lute, goes to hear the sound of singing, or indeed goes to hear various other sounds. Or they go to hear the teaching of ascetics or brahmins who hold wrong views and practice wrongly. That hearing, monks, exists; I do not say it does not exist. Yet, monks, that hearing is inferior, vulgar, ordinary, ignoble, and unbeneficial. It does not lead to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, or Nibbana. But, monks, when someone goes to hear the Dhamma of the Tathagata or a disciple of the Tathagata, deeply rooted in faith, deeply rooted in love, having reached an unwavering conviction, completely serene and confident—this is the unexcelled among all forms of hearing. It leads to the purification of beings, to the overcoming of sorrow and lamentation, to the vanishing of pain and displeasure, to the attainment of the path, and to the realization of Nibbana. This is when one goes to hear the Dhamma of the Tathagata or a disciple of the Tathagata, deeply rooted in faith, deeply rooted in love, having reached an unwavering conviction, completely serene and confident. This, monks, is called the unexcelled in hearing. Thus, the unexcelled in seeing, and the unexcelled in hearing.\n\nAnd how, monks, is there the unexcelled in gain? Here, monks, some individual gains children, gains a spouse, gains wealth, or indeed gains various other things. Or they gain faith in ascetics or brahmins who hold wrong views and practice wrongly. That gain, monks, exists; I do not say it does not exist. Yet, monks, that gain is inferior, vulgar, ordinary, ignoble, and unbeneficial. It does not lead to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, or Nibbana. But, monks, when someone gains faith in the Tathagata or a disciple of the Tathagata, deeply rooted in faith, deeply rooted in love, having reached an unwavering conviction, completely serene and confident—this is the unexcelled among all forms of gain. It leads to the purification of beings, to the overcoming of sorrow and lamentation, to the vanishing of pain and displeasure, to the attainment of the path, and to the realization of Nibbana. This is when one gains faith in the Tathagata or a disciple of the Tathagata, deeply rooted in faith, deeply rooted in love, having reached an unwavering conviction, completely serene and confident. This, monks, is called the unexcelled in gain. Thus, the unexcelled in seeing, the unexcelled in hearing, and the unexcelled in gain.\n\nAnd how, monks, is there the unexcelled in training? Here, monks, some individual trains in elephant riding, trains in horse riding, trains in charioteering, trains in archery, trains in swordsmanship, or indeed trains in various other skills. Or they train under ascetics or brahmins who hold wrong views and practice wrongly. That training, monks, exists; I do not say it does not exist. Yet, monks, that training is inferior, vulgar, ordinary, ignoble, and unbeneficial. It does not lead to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, or Nibbana.\n\nAnd indeed, monks, in the Dhamma and Vinaya proclaimed by the Tathāgata, whoever trains in the higher morality, trains in the higher mind, trains in the higher wisdom, with deep-rooted faith, with profound affection, having arrived at a definite conclusion, and with strong confidence—this, monks, is the unsurpassed training for the purification of beings, for the overcoming of sorrow and lamentation, for the disappearance of pain and displeasure, for the attainment of the true method, for the realization of Nibbāna; namely, one who trains in the higher morality, trains in the higher mind, trains in the higher wisdom in the Dhamma and Vinaya proclaimed by the Tathāgata, with deep-rooted faith, with profound affection, having arrived at a definite conclusion, and with strong confidence. This, monks, is called the unsurpassed training. Thus, there is the unsurpassed sight, the unsurpassed hearing, the unsurpassed gain, the unsurpassed training.\n\nAnd how, monks, is there the unsurpassed service? Here, monks, someone serves a warrior, serves a brahmin, serves a householder, or serves various kinds of people, or serves an ascetic or brahmin who holds wrong views and practices wrongly. Indeed, monks, such service exists; I do not say it does not exist. But this service, monks, is inferior, vulgar, ordinary, ignoble, and unbeneficial; it does not lead to disenchantment… it does not lead to Nibbāna. But whoever, monks, serves the Tathāgata or a disciple of the Tathāgata, with deep-rooted faith, with profound affection, having arrived at a definite conclusion, and with strong confidence—this, monks, is the unsurpassed service for the purification of beings, for the overcoming of sorrow and lamentation, for the disappearance of pain and displeasure, for the attainment of the true method, for the realization of Nibbāna; namely, one who serves the Tathāgata or a disciple of the Tathāgata with deep-rooted faith, with profound affection, having arrived at a definite conclusion, and with strong confidence. This, monks, is called the unsurpassed service. Thus, there is the unsurpassed sight, the unsurpassed hearing, the unsurpassed gain, the unsurpassed training, the unsurpassed service.\n\nAnd how, monks, is there the unsurpassed recollection? Here, monks, someone recollects the gain of children, recollects the gain of wives, recollects the gain of wealth, or recollects various kinds of gains, or recollects an ascetic or brahmin who holds wrong views and practices wrongly. Indeed, monks, such recollection exists; I do not say it does not exist. But this recollection, monks, is inferior, vulgar, ordinary, ignoble, and unbeneficial; it does not lead to disenchantment, nor to dispassion, nor to cessation, nor to tranquility, nor to direct knowledge, nor to full enlightenment, nor to Nibbāna. But whoever, monks, recollects the Tathāgata or a disciple of the Tathāgata, with deep-rooted faith, with profound affection, having arrived at a definite conclusion, and with strong confidence—this, monks, is the unsurpassed recollection for the purification of beings, for the overcoming of sorrow and lamentation, for the disappearance of pain and displeasure, for the attainment of the true method, for the realization of Nibbāna; namely, one who recollects the Tathāgata or a disciple of the Tathāgata with deep-rooted faith, with profound affection, having arrived at a definite conclusion, and with strong confidence. This, monks, is called the unsurpassed recollection. These, monks, are the six unsurpassed things.\n\nThose who have gained the unsurpassed sight, and the unsurpassed hearing;\nWho have gained the unsurpassed gain, and delight in the unsurpassed training.\nEngaged in unsurpassed service, they cultivate recollection;\nConnected with seclusion, safe, leading to the Deathless.\nDelighting in heedfulness, they are discerning and restrained by morality;\nThey indeed mature in due time, where suffering ceases.",
      "sinhala": "භික්ෂූනි, මේ අනුත්තරිය ධර්ම සයක් තිබේ. ඒ සය කුමක්ද යත්? දර්ශන අනුත්තරිය, ශ්‍රවණ අනුත්තරිය, ලාභ අනුත්තරිය, ශික්ෂා අනුත්තරිය, පාරිචර්යා අනුත්තරිය, අනුස්සති අනුත්තරිය යනුයි.\n\nභික්ෂූනි, දර්ශන අනුත්තරිය යනු කුමක්ද? භික්ෂූනි, මෙහි සමහරෙක් හස්ති රත්නයක් හෝ දැකීමට යයි, අශ්ව රත්නයක් හෝ දැකීමට යයි, මාණික්‍ය රත්නයක් හෝ දැකීමට යයි, නොයෙක් ආකාර වූ දෑ හෝ දැකීමට යයි, නැතහොත් මිත්‍යාදෘෂ්ඨික වූ, මිත්‍යාප්‍රතිපදාවේ පිහිටි ශ්‍රමණයකු හෝ බ්‍රාහ්මණයකු හෝ දැකීමට යයි. භික්ෂූනි, මේ දැකීමක් ඇත; මේ දැකීම නැතැයි මම නොකියමි. එහෙත් භික්ෂූනි, ඒ දැකීම පහත්ය, ග්‍රාම්‍යය, පෘථග්ජනයන්ට අයත්ය, ආර්ය නොවේ, අර්ථ සහිත නොවේ, එය කලකිරීමට, නොඇල්වීමට, නිරෝධයට, උපශමයට, අභිඥාවට, සම්බෝධියට හෝ නිර්වාණයට හේතු නොවේ. යම්හෙයකින් භික්ෂූනි, කවරෙක් හෝ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයකු හෝ දැකීමට යන්නේ, (උන්වහන්සේ කෙරෙහි) තදින් පිහිටි ශ්‍රද්ධාවෙන්, තදින් පිහිටි ප්‍රේමයෙන්, ඒකාන්ත වූ සිතින්, ඉතා පැහැදුණු සිතින් යුක්තව යන්නේ නම්, භික්ෂූනි, මෙය දර්ශනයන් අතුරින් අනුත්තරියයි. (එනම්) සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක හා වැලපීම් ඉක්මවා යෑම පිණිස, දුක් හා දොම්නස් නැති කිරීම පිණිස, ඥානය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය ප්‍රත්‍යක්ෂ කිරීම පිණිස හේතුවන දෙය නම්, යම් මේ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයකු හෝ දැකීමට යන්නේ, තදින් පිහිටි ශ්‍රද්ධාවෙන්, තදින් පිහිටි ප්‍රේමයෙන්, ඒකාන්ත වූ සිතින්, ඉතා පැහැදුණු සිතින් යුක්තව යෑමයි. භික්ෂූනි, මෙය දර්ශන අනුත්තරිය යැයි කියනු ලැබේ. මේ දර්ශන අනුත්තරියයි.\n\nශ්‍රවණ අනුත්තරිය කුමන අයුරකින් වේද? භික්ෂූනි, මෙහි සමහරෙක් බෙර ශබ්දයක් හෝ ඇසීමට යයි, වීණා ශබ්දයක් හෝ ඇසීමට යයි, ගීත ශබ්දයක් හෝ ඇසීමට යයි, නොයෙක් ආකාර වූ ශබ්දයන් හෝ ඇසීමට යයි, නැතහොත් මිත්‍යාදෘෂ්ඨික වූ, මිත්‍යාප්‍රතිපදාවේ පිහිටි ශ්‍රමණයකුගේ හෝ බ්‍රාහ්මණයකුගේ ධර්මය ඇසීමට යයි. භික්ෂූනි, මේ ඇසීමක් ඇත; මේ ඇසීම නැතැයි මම නොකියමි. එහෙත් භික්ෂූනි, ඒ ඇසීම පහත්ය, ග්‍රාම්‍යය, පෘථග්ජනයන්ට අයත්ය, ආර්ය නොවේ, අර්ථ සහිත නොවේ, එය කලකිරීමට, නොඇල්වීමට, නිරෝධයට, උපශමයට, අභිඥාවට, සම්බෝධියට හෝ නිර්වාණයට හේතු නොවේ. යම්හෙයකින් භික්ෂූනි, කවරෙක් හෝ තථාගතයන් වහන්සේගේ හෝ තථාගත ශ්‍රාවකයකුගේ ධර්මය ඇසීමට යන්නේ, (උන්වහන්සේ කෙරෙහි) තදින් පිහිටි ශ්‍රද්ධාවෙන්, තදින් පිහිටි ප්‍රේමයෙන්, ඒකාන්ත වූ සිතින්, ඉතා පැහැදුණු සිතින් යුක්තව යන්නේ නම්, භික්ෂූනි, මෙය ශ්‍රවණයන් අතුරින් අනුත්තරියයි. (එනම්) සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක හා වැලපීම් ඉක්මවා යෑම පිණිස, දුක් හා දොම්නස් නැති කිරීම පිණිස, ඥානය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය ප්‍රත්‍යක්ෂ කිරීම පිණිස හේතුවන දෙය නම්, යම් මේ තථාගතයන් වහන්සේගේ හෝ තථාගත ශ්‍රාවකයකුගේ ධර්මය ඇසීමට යන්නේ, තදින් පිහිටි ශ්‍රද්ධාවෙන්, තදින් පිහිටි ප්‍රේමයෙන්, ඒකාන්ත වූ සිතින්, ඉතා පැහැදුණු සිතින් යුක්තව යෑමයි. භික්ෂූනි, මෙය ශ්‍රවණ අනුත්තරිය යැයි කියනු ලැබේ. මේ දර්ශන අනුත්තරියයි, ශ්‍රවණ අනුත්තරියයි.\n\nලාභ අනුත්තරිය කුමන අයුරකින් වේද? භික්ෂූනි, මෙහි සමහරෙක් පුත්‍ර ලාභයක් හෝ ලබයි, දාරක (භාර්යා) ලාභයක් හෝ ලබයි, ධන ලාභයක් හෝ ලබයි, නොයෙක් ආකාර වූ ලාභයන් හෝ ලබයි, නැතහොත් මිත්‍යාදෘෂ්ඨික වූ, මිත්‍යාප්‍රතිපදාවේ පිහිටි ශ්‍රමණයන් හෝ බ්‍රාහ්මණයන් කෙරෙහි ශ්‍රද්ධාව ලබයි. භික්ෂූනි, මේ ලාභයක් ඇත; මේ ලාභය නැතැයි මම නොකියමි. එහෙත් භික්ෂූනි, ඒ ලාභය පහත්ය, ග්‍රාම්‍යය, පෘථග්ජනයන්ට අයත්ය, ආර්ය නොවේ, අර්ථ සහිත නොවේ, එය කලකිරීමට, නොඇල්වීමට, නිරෝධයට, උපශමයට, අභිඥාවට, සම්බෝධියට හෝ නිර්වාණයට හේතු නොවේ. යම්හෙයකින් භික්ෂූනි, කවරෙක් හෝ තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශ්‍රාවකයකු කෙරෙහි ශ්‍රද්ධාව ලබන්නේ, තදින් පිහිටි ශ්‍රද්ධාවෙන්, තදින් පිහිටි ප්‍රේමයෙන්, ඒකාන්ත වූ සිතින්, ඉතා පැහැදුණු සිතින් යුක්තව නම්, භික්ෂූනි, මෙය ලාභයන් අතුරින් අනුත්තරියයි. (එනම්) සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක හා වැලපීම් ඉක්මවා යෑම පිණිස, දුක් හා දොම්නස් නැති කිරීම පිණිස, ඥානය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය ප්‍රත්‍යක්ෂ කිරීම පිණිස හේතුවන දෙය නම්, යම් මේ තථාගතයන් වහන්සේ කෙරෙහි හෝ තථාගත ශ්‍රාවකයකු කෙරෙහි ශ්‍රද්ධාව ලබන්නේ, තදින් පිහිටි ශ්‍රද්ධාවෙන්, තදින් පිහිටි ප්‍රේමයෙන්, ඒකාන්ත වූ සිතින්, ඉතා පැහැදුණු සිතින් යුක්තව ලැබීමයි. භික්ෂූනි, මෙය ලාභ අනුත්තරිය යැයි කියනු ලැබේ. මේ දර්ශන අනුත්තරියයි, ශ්‍රවණ අනුත්තරියයි, ලාභ අනුත්තරියයි.\n\nශික්ෂා අනුත්තරිය කුමන අයුරකින් වේද? භික්ෂූනි, මෙහි සමහරෙක් හස්ති ශිල්පය හෝ පුහුණු වෙයි, අශ්ව ශිල්පය හෝ පුහුණු වෙයි, රථ ශිල්පය හෝ පුහුණු වෙයි, ධනු ශිල්පය හෝ පුහුණු වෙයි, කඩු ශිල්පය හෝ පුහුණු වෙයි, නොයෙක් ආකාර වූ ශිල්පයන් හෝ පුහුණු වෙයි, නැතහොත් මිත්‍යාදෘෂ්ඨික වූ, මිත්‍යාප්‍රතිපදාවේ පිහිටි ශ්‍රමණයකුගේ හෝ බ්‍රාහ්මණයකුගේ (මිත්‍යා) ශික්ෂාව හෝ පුහුණු වෙයි. භික්ෂූනි, මේ ශික්ෂාවක් ඇත; මේ ශික්ෂාව නැතැයි මම නොකියමි. එහෙත් භික්ෂූනි, ඒ ශික්ෂාව පහත්ය, ග්‍රාම්‍යය, පෘථග්ජනයන්ට අයත්ය, ආර්ය නොවේ, අර්ථ සහිත නොවේ, එය කලකිරීමට, නොඇල්වීමට, නිරෝධයට, උපශමයට, අභිඥාවට, සම්බෝධියට හෝ නිර්වාණයට හේතු නොවේ.\n\nමහණෙනි, යමෙක් නම් තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද මේ ධර්ම විනයෙහි අධිශීලය ද පුහුණු කරයි, අධිචිත්තය ද පුහුණු කරයි, අධිප්‍රඥාව ද පුහුණු කරයි, ස්ථිර පැහැදුණු ශ්‍රද්ධාවෙන් යුක්තව, ස්ථිර ප්‍රේමයෙන් යුක්තව, එකාන්ත ගතියට පැමිණ, ඉතා මැනවින් පැහැද සිටින්නේද, මහණෙනි, මේ ශික්ෂාවන් අතර අනුත්තරයයි. සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක-පරිදේවයන් ඉක්මවීම පිණිස, දුක්-දොම්නස් නැති කිරීම පිණිස, (ආර්ය) ඥානය අවබෝධ කිරීම පිණිස, නිවන සාක්ෂාත් කිරීම පිණිස, යමෙක් තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනයෙහි අධිශීලය ද පුහුණු කරයි, අධිචිත්තය ද පුහුණු කරයි, අධිප්‍රඥාව ද පුහුණු කරයි, ස්ථිර ශ්‍රද්ධාවෙන්, ස්ථිර ප්‍රේමයෙන්, එකාන්ත ගතියෙන් යුක්තව, මනාකොට පැහැද සිටින්නේ නම්, මහණෙනි, මේ ශික්ෂාවන් අතර අනුත්තරයයි. මහණෙනි, මේ ශික්ෂානුත්තරියයයි කියනු ලැබේ. මෙසේ දර්ශනානුත්තරියය, ශ්‍රවණානුත්තරියය, ලාභානුත්තරියය, ශික්ෂානුත්තරියය (කියන ලද) වෙයි.\n\n\"පාරිචරියානුත්තරියය (උපස්ථාන කිරීමෙහි අනුත්තරය) කෙසේ වේද? මහණෙනි, මේ ලෝකයේ සමහරෙක් ක්ෂත්‍රියයෙකුට ද උපස්ථාන කරයි, බ්‍රාහ්මණයෙකුට ද උපස්ථාන කරයි, ගෘහපතියෙකුට ද උපස්ථාන කරයි, නැතහොත් උස්-මිටි නොයෙක් අයට උපස්ථාන කරයි, නැතහොත් මිත්‍යාදෘෂ්ටික වූ, මිත්‍යා ප්‍රතිපදාවෙහි යෙදුණු ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ උපස්ථාන කරයි. මහණෙනි, මේ උපස්ථානයෝ ඇත්තාහ; මේවා නැතැයි මම නොකියමි. මහණෙනි, ඒ උපස්ථානය නම් හීන වූ, ග්‍රාම්‍ය වූ, පෘථග්ජනයන්ට අයත් වූ, අනාර්ය වූ, අනර්ථ සහිත වූවකි. එය කලකිරීම පිණිස නොපවතී, නොඇලීම පිණිස නොපවතී, (ක්ලේශ) නිරෝධය පිණිස නොපවතී, සන්සිඳීම පිණිස නොපවතී, අභිඥාව පිණිස නොපවතී, සම්බෝධිය පිණිස නොපවතී, නිවන පිණිස නොපවතී. මහණෙනි, සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක-පරිදේවයන් ඉක්මවීම පිණිස, දුක්-දොම්නස් නැති කිරීම පිණිස, (ආර්ය) ඥානය අවබෝධ කිරීම පිණිස, නිවන සාක්ෂාත් කිරීම පිණිස, යමෙක් තථාගතයන් වහන්සේට හෝ තථාගත ශ්‍රාවකයෙකුට හෝ ස්ථිර ශ්‍රද්ධාවෙන්, ස්ථිර ප්‍රේමයෙන්, එකාන්ත ගතියෙන් යුක්තව, මනාකොට පැහැද සිටින්නේ නම් උපස්ථාන කරයිද, මහණෙනි, මේ උපස්ථානයන් අතර අනුත්තරයයි. මහණෙනි, මේ පාරිචරියානුත්තරියයයි කියනු ලැබේ. මෙසේ දර්ශනානුත්තරියය, ශ්‍රවණානුත්තරියය, ලාභානුත්තරියය, ශික්ෂානුත්තරියය, පාරිචරියානුත්තරියය (කියන ලද) වෙයි.\n\n\"අනුස්සතීනුත්තරියය (අනුස්සති අතර අනුත්තරය) කෙසේ වේද? මහණෙනි, මේ ලෝකයේ සමහරෙක් පුත්‍ර ලාභය ද සිහි කරයි, භාර්යා ලාභය ද සිහි කරයි, ධන ලාභය ද සිහි කරයි, නැතහොත් උස්-මිටි නොයෙක් ලාභ සිහි කරයි, නැතහොත් මිත්‍යාදෘෂ්ටික වූ, මිත්‍යා ප්‍රතිපදාවෙහි යෙදුණු ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ සිහි කරයි. මහණෙනි, මේ අනුස්සතියෝ ඇත්තාහ; මේවා නැතැයි මම නොකියමි. මහණෙනි, ඒ අනුස්සතිය නම් හීන වූ, ග්‍රාම්‍ය වූ, පෘථග්ජනයන්ට අයත් වූ, අනාර්ය වූ, අනර්ථ සහිත වූවකි. එය කලකිරීම පිණිස නොපවතී, නොඇලීම පිණිස නොපවතී, (ක්ලේශ) නිරෝධය පිණිස නොපවතී, සන්සිඳීම පිණිස නොපවතී, අභිඥාව පිණිස නොපවතී, සම්බෝධිය පිණිස නොපවතී, නිවන පිණිස නොපවතී. මහණෙනි, සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක-පරිදේවයන් ඉක්මවීම පිණිස, දුක්-දොම්නස් නැති කිරීම පිණිස, (ආර්ය) ඥානය අවබෝධ කිරීම පිණිස, නිවන සාක්ෂාත් කිරීම පිණිස, යමෙක් තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙකු හෝ ස්ථිර ශ්‍රද්ධාවෙන්, ස්ථිර ප්‍රේමයෙන්, එකාන්ත ගතියෙන් යුක්තව, මනාකොට පැහැද සිටින්නේ නම් සිහි කරයිද, මහණෙනි, මේ අනුස්සතීන් අතර අනුත්තරයයි. මහණෙනි, මේ අනුස්සතීනුත්තරියයයි කියනු ලැබේ. මහණෙනි, මේවා නම් ෂඩ අනුත්තරියයෝ (අනුත්තර ධර්ම සය) වෙති.\n\nයමෝ දර්ශනානුත්තරියය ලබා ඇත්තාහු ද, ශ්‍රවණානුත්තරියය ද ලබා ඇත්තාහු ද, ලාභානුත්තරියය ලබා ඇත්තාහු ද, ශික්ෂානුත්තරියයෙහි නිරත වූවෝ ද,\nපාරිචරියානුත්තරියයෙහි පිහිටා සිටින්නෝ, විවේකයෙන් යුක්ත වූ, නිර්භය වූ, අමා මහ නිවන කරා යන අනුස්සතිය වඩත් ද,\nඅප්‍රමාදයෙන් ප්‍රීතිමත් වන්නාහු ද, නුවණැත්තෝ ද, සිල් සංවරයෙන් යුක්ත වන්නාහු ද, ඔවුහු නිසැකවම කාලය පැමිණි කල්හි, යම් තැනක දුක නිරුද්ධ වේ ද, (එම නිවනට) පැමිණෙත්.",
      "paliTitle": "Anuttariyasuttaṃ",
      "englishTitle": "The Unsurpassed Discourse",
      "sinhalaTitle": "අනුත්තරිය සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Anuttariyavaggo [sāmakavaggo (ka.)] tatiyo. Tassuddānaṃ – Sāmako aparihāniyo, bhayaṃ himavānussati; Kaccāno dve ca samayā, udāyī anuttariyenāti.",
    "english": "Chapter Three: The Unsurpassable",
    "sinhala": "තෙවැනි අනුත්තරිය වර‍්ගය"
  }
}