{
  "id": "an6.10",
  "title": {
    "pali": "Ānisaṃsavaggo",
    "english": "The Chapter on Advantages",
    "sinhala": "ආනිසංස වර්ගය"
  },
  "sections": [
    {
      "number": 96,
      "pali": "‘‘Channaṃ, bhikkhave, pātubhāvo dullabho lokasmiṃ. Katamesaṃ channaṃ? Tathāgatassa arahato sammāsambuddhassa pātubhāvo dullabho lokasmiṃ, tathāgatappaveditassa dhammavinayassa desetā puggalo dullabho lokasmiṃ, ariyāyatane paccājāti dullabhā [paccājāto dullabho (syā.)] lokasmiṃ, indriyānaṃ avekallatā dullabhā lokasmiṃ, ajaḷatā aneḷamūgatā dullabhā lokasmiṃ, kusale dhamme chando [kusaladhammacchando (sī. syā. pī.)] dullabho lokasmiṃ. Imesaṃ kho, bhikkhave, channaṃ pātubhāvo dullabho lokasmi’’nti. Paṭhamaṃ.",
      "english": "Monks, the appearance of six things is rare in the world. Which six? The appearance of a Tathāgata, an Arahant, a Perfectly Self-Enlightened One, is rare in the world; a person who teaches the Dhamma-Vinaya proclaimed by the Tathāgata is rare in the world; rebirth in a noble spiritual sphere is rare in the world; the soundness of one's faculties is rare in the world; freedom from dullness and mental incapacitation is rare in the world; aspiration for wholesome states is rare in the world. Indeed, Monks, the appearance of these six things is rare in the world.",
      "sinhala": "මහණෙනි, ලෝකයෙහි ධර්ම හයක් පහළවීම දුර්ලභය. ඒ කවර හයක්ද?\n\nලෝකයෙහි රහත් වූ සම්මාසම්බුදු තථාගතයන් වහන්සේගේ පහළවීම දුර්ලභය. තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කරන පුද්ගලයා ලෝකයෙහි දුර්ලභය. ආර්ය භූමියක නැවත ඉපදීම ලෝකයෙහි දුර්ලභය. ඉන්ද්‍රියන්ගේ විකල නොවීම ලෝකයෙහි දුර්ලභය. අඳුරු නොවීමත්, ගොළුබිහිරි නොවීමත් ලෝකයෙහි දුර්ලභය. කුසල ධර්මයන් කෙරෙහි ඡන්දය ලෝකයෙහි දුර්ලභය.\n\nමහණෙනි, මේ ධර්ම හය පහළවීම ලෝකයෙහි දුර්ලභය.",
      "paliTitle": "Pātubhāvasuttaṃ"
    },
    {
      "number": 97,
      "pali": "‘‘Chayime, bhikkhave, ānisaṃsā sotāpattiphalasacchikiriyāya. Katame cha? Saddhammaniyato hoti, aparihānadhammo hoti, pariyantakatassa dukkhaṃ hoti [dukkhaṃ na hoti (syā. pī. ka.)], asādhāraṇena ñāṇena samannāgato hoti, hetu cassa sudiṭṭho, hetusamuppannā ca dhammā. Ime kho, bhikkhave, cha ānisaṃsā sotāpattiphalasacchikiriyāyā’’ti. Dutiyaṃ.",
      "english": "Monks, these six are the advantages of realizing the fruit of stream-entry. Which six? He is assured in the True Dhamma; he is incapable of falling away; his suffering is brought to an end; he is endowed with knowledge unique to noble ones; he has thoroughly seen the cause; and phenomena arisen from causes. These, monks, are the six advantages for the realization of the fruit of stream-entry.",
      "sinhala": "භික්‍ෂූණි, සෝතාපත්තිඵලය සාක්‍ෂාත් කිරීම සඳහා මේ ආනිසංස හය වෙති. ඒ හය කවරේද?\n\nඔහු සද්ධර්මයේ නියත ස්ථාවර බවට පත් වෙයි. ඔහු පිරිහීමට ලක් නොවන ස්වභාවයෙන් යුක්ත වෙයි. ඔහුගේ දුක සීමා කරන ලද්දක් වෙයි. ඔහු අන්‍ය සාමාන්‍යයන්ට පොදු නොවන ඥානයකින් සමන්විත වෙයි. ඔහුට හේතු ධර්මයන් මැනවින් අවබෝධ වී ඇත. හේතුන්ගෙන් හටගත් ධර්මයන්ද ඔහුට මැනවින් අවබෝධ වී ඇත.\n\nභික්‍ෂූණි, සෝතාපත්තිඵලය සාක්‍ෂාත් කිරීම සඳහා මේ ආනිසංස හය වෙති.",
      "paliTitle": "Ānisaṃsasuttaṃ"
    },
    {
      "number": 98,
      "pali": "‘‘‘So vata, bhikkhave, bhikkhu kañci saṅkhāraṃ niccato samanupassanto anulomikāya khantiyā samannāgato bhavissatī’ti netaṃ ṭhānaṃ vijjati. ‘Anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatī’ti netaṃ ṭhānaṃ vijjati. ‘Sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ [arahattaphalaṃ (ka.) paṭi. ma. 3.36] vā sacchikarissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘‘So vata, bhikkhave, bhikkhu sabbasaṅkhāre [sabbasaṅkhāraṃ (sī. pī.)] aniccato samanupassanto anulomikāya khantiyā samannāgato bhavissatī’ti ṭhānametaṃ vijjati. ‘Anulomikāya khantiyā samannāgato sammattaniyāmaṃ okkamissatī’ti ṭhānametaṃ vijjati. ‘Sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatī’ti ṭhānametaṃ vijjatī’’ti. Tatiyaṃ.",
      "english": "Indeed, O monks, for a monk who perceives any conditioned phenomenon as permanent to be endowed with conforming endurance – this is not possible. For one not endowed with conforming endurance to enter the fixed course of rightness – this is not possible. For one not entering the fixed course of rightness to realize the fruit of stream-entry, or the fruit of once-returning, or the fruit of non-returning, or Arahantship – this is not possible. Indeed, O monks, for a monk who perceives all conditioned phenomena as impermanent to be endowed with conforming endurance – this is possible. For one endowed with conforming endurance to enter the fixed course of rightness – this is possible. For one entering the fixed course of rightness to realize the fruit of stream-entry, or the fruit of once-returning, or the fruit of non-returning, or Arahantship – this is possible.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් කිසිදු සංස්කාරයක් නිත්‍ය වශයෙන් දකිමින් අනුලෝමික ක‍්ෂාන්තියෙන් යුක්ත වන්නේය යන මේ කාරණය සිදු විය නොහැක. අනුලෝමික ක‍්ෂාන්තියෙන් යුක්ත නොවන තැනැත්තා සම්මත්තනියාමයට (නිවැරදි මාර්ගයට) පිවිසෙන්නේය යන මේ කාරණය සිදු විය නොහැක. සම්මත්තනියාමයට නොපිවිසෙන තැනැත්තා සෝවාන් ඵලය හෝ සකදාගාමී ඵලය හෝ අනාගාමී ඵලය හෝ අරහත්වය සාක‍්ෂාත් කරන්නේය යන මේ කාරණය සිදු විය නොහැක.\n\nමහණෙනි, යම් භික්ෂුවක් සියලු සංස්කාර අනිත්‍ය වශයෙන් දකිමින් අනුලෝමික ක‍්ෂාන්තියෙන් යුක්ත වන්නේය යන මේ කාරණය සිදු විය හැකිය. අනුලෝමික ක‍්ෂාන්තියෙන් යුක්ත වූ තැනැත්තා සම්මත්තනියාමයට (නිවැරදි මාර්ගයට) පිවිසෙන්නේය යන මේ කාරණය සිදු විය හැකිය. සම්මත්තනියාමයට පිවිසෙන තැනැත්තා සෝවාන් ඵලය හෝ සකදාගාමී ඵලය හෝ අනාගාමී ඵලය හෝ අරහත්වය සාක‍්ෂාත් කරන්නේය යන මේ කාරණය සිදු විය හැකිය.",
      "paliTitle": "Aniccasuttaṃ"
    },
    {
      "number": 99,
      "pali": "‘‘So vata, bhikkhave, bhikkhu kañci saṅkhāraṃ sukhato samanupassanto…pe… sabbasaṅkhāre dukkhato samanupassanto…pe… ṭhānametaṃ vijjati’’. Catutthaṃ.",
      "english": "Indeed, monks, while a bhikkhu who regards any conditioned phenomenon as pleasant will not enter upon the path to the calming of all conditioned phenomena, for a bhikkhu who regards all conditioned phenomena as suffering, it is possible to enter upon the path to the calming of all conditioned phenomena.",
      "sinhala": "එම්බා මහණෙනි, යම් භික්ෂුවක් යම්කිසි සංස්කාරයක් සැපය ලෙසින් දකින කල්හි, උපාදාන රහිතව නිදහස් වීම නම් සිදු නොවේ. එහෙත් යම් භික්ෂුවක් සියලු සංස්කාරයන් දුක ලෙසින් දකින කල්හි, උපාදාන රහිතව නිදහස් වීම සිදුවිය හැකි කරුණකි.",
      "paliTitle": "Dukkhasuttaṃ"
    },
    {
      "number": 100,
      "pali": "‘‘So vata, bhikkhave, bhikkhu kañci dhammaṃ attato samanupassanto…pe… sabbadhamme [sabbadhammaṃ (sī. pī.), kiñcidhammaṃ (ka.) paṭi. ma. 3.36] anattato samanupassanto…pe… ṭhānametaṃ vijjati’’. Pañcamaṃ.",
      "english": "It is indeed the case, bhikkhus, that a monk perceiving any phenomenon as self is unable to realize Nibbana; but a monk perceiving all phenomena as not-self is able to realize Nibbana—this is a possibility.",
      "sinhala": "මහණෙනි, සැබවින්ම, යම් භික්ෂුවක් කිසියම් ධර්මයක් ආත්මය වශයෙන් මැනවින් මෙනෙහි කරමින්, සියලු ධර්මයන් අනාත්මය වශයෙන් මැනවින් මෙනෙහි කරන්නේ නම්, එය සිදුවිය හැක්කකි.",
      "paliTitle": "Anattasuttaṃ"
    },
    {
      "number": 101,
      "pali": "‘‘‘So vata, bhikkhave, bhikkhu nibbānaṃ dukkhato samanupassanto anulomikāya khantiyā samannāgato bhavissatī’ti netaṃ ṭhānaṃ vijjati. ‘Anulomikāya khantiyā asamannāgato sammattaniyāmaṃ okkamissatī’ti netaṃ ṭhānaṃ vijjati. ‘Sammattaniyāmaṃ anokkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘‘So vata, bhikkhave, bhikkhu nibbānaṃ sukhato samanupassanto anulomikāya khantiyā samannāgato bhavissatī’ti ṭhānametaṃ vijjati. ‘Anulomikāya khantiyā samannāgato sammattaniyāmaṃ okkamissatī’ti ṭhānametaṃ vijjati. ‘Sammattaniyāmaṃ okkamamāno sotāpattiphalaṃ vā sakadāgāmiphalaṃ vā anāgāmiphalaṃ vā arahattaṃ vā sacchikarissatī’ti ṭhānametaṃ vijjatī’’ti. Chaṭṭhaṃ.",
      "english": "Indeed, monks, that a monk, perceiving Nibbana as suffering, will be endowed with receptive acceptance – this is not possible. That one, not endowed with receptive acceptance, will enter the certainty of rightness – this is not possible. That one, not entering the certainty of rightness, will realize the fruit of stream-entry, or the fruit of once-returning, or the fruit of non-returning, or Arahantship – this is not possible.\n\nIndeed, monks, that a monk, perceiving Nibbana as happiness, will be endowed with receptive acceptance – this is possible. That one, endowed with receptive acceptance, will enter the certainty of rightness – this is possible. That one, entering the certainty of rightness, will realize the fruit of stream-entry, or the fruit of once-returning, or the fruit of non-returning, or Arahantship – this is possible.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් නිවන දුකක් ලෙසින් දකිමින් අනුලෝමික ක්ෂාන්තියෙන් යුක්ත වන්නේ යැයි, මේ කරුණ සිදු විය නොහැක්කකි. අනුලෝමික ක්ෂාන්තියෙන් යුක්ත නොවී සම්‍යක් නියාමයට පැමිණෙන්නේ යැයි, මේ කරුණ සිදු විය නොහැක්කකි. සම්‍යක් නියාමයට නොපැමිණ සෝවාන් ඵලය හෝ සකදාගාමී ඵලය හෝ අනාගාමී ඵලය හෝ අරහත්වය හෝ සාක්ෂාත් කරන්නේ යැයි, මේ කරුණ සිදු විය නොහැක්කකි. මහණෙනි, යම් භික්ෂුවක් නිවන සැපයක් ලෙසින් දකිමින් අනුලෝමික ක්ෂාන්තියෙන් යුක්ත වන්නේ යැයි, මේ කරුණ සිදු විය හැක්කකි. අනුලෝමික ක්ෂාන්තියෙන් යුක්තව සම්‍යක් නියාමයට පැමිණෙන්නේ යැයි, මේ කරුණ සිදු විය හැක්කකි. සම්‍යක් නියාමයට පැමිණ සෝවාන් ඵලය හෝ සකදාගාමී ඵලය හෝ අනාගාමී ඵලය හෝ අරහත්වය හෝ සාක්ෂාත් කරන්නේ යැයි, මේ කරුණ සිදු විය හැක්කකි.",
      "paliTitle": "Nibbānasuttaṃ"
    },
    {
      "number": 102,
      "pali": "‘‘Cha, bhikkhave, ānisaṃse sampassamānena alameva bhikkhunā sabbasaṅkhāresu anodhiṃ karitvā aniccasaññaṃ upaṭṭhāpetuṃ. Katame cha? ‘Sabbasaṅkhārā ca me anavatthitā [anavaṭṭhitato (sī. syā. pī.)] khāyissanti, sabbaloke ca me mano nābhiramissati [na ramissati (ka.)], sabbalokā ca me mano vuṭṭhahissati, nibbānapoṇañca me mānasaṃ bhavissati, saṃyojanā ca me pahānaṃ gacchissanti [gacchanti (syā. pī. ka.)], paramena ca sāmaññena samannāgato bhavissāmī’ti. Ime kho, bhikkhave, cha ānisaṃse sampassamānena alameva bhikkhunā sabbasaṅkhāresu anodhiṃ karitvā aniccasaññaṃ upaṭṭhāpetu’’nti. Sattamaṃ.",
      "english": "Monks, by seeing these six advantages, it is indeed enough for a monk to establish the perception of impermanence in all conditioned phenomena, without any reservation. What are these six? ‘All conditioned phenomena will appear to me as unstable; my mind will not delight in the entire world; my mind will withdraw from the entire world; my mental disposition will incline towards Nibbāna; my fetters will be abandoned; and I will be endowed with the highest spiritual attainment.’ Monks, by seeing these six advantages, it is indeed enough for a monk to establish the perception of impermanence in all conditioned phenomena, without any reservation.",
      "sinhala": "මහණෙනි, මේ ආනිසංස හය මැනැවින් දකින භික්‍ෂු​වකට සියලු​ සංස්කාර ධර්මයන්හි කිසිදු සීමාවක් නොතබා අනිත්‍ය​සංඥාව උපස්ථාපනය කිරීමට සෑහේ.\n\nඒ හය කවරේද යත්?\n\n‘මට සියලු​ සංස්කාර ධර්ම අස්ථිර (අනිත්‍ය) වශයෙන් පෙනෙන්නේය. සියලු​ ලෝකයෙහි මගේ සිත නො ඇලෙන්නේය. සියලු​ ලෝකයෙන් මගේ සිත මුදවා ගන්නේය. මගේ මනස නිවනට නැමුණක් වන්නේය. මගේ සංයෝජන ධර්ම ප්‍ර​හාණය වන්නේය. පරම ශ්‍රේෂ්ඨ ශ්‍ර​මණභාවයෙන් යුක්ත වන්නේය’ යන මේවායි.\n\nමහණෙනි, මේ ආනිසංස හය මැනැවින් දකින භික්‍ෂු​වකට සියලු​ සංස්කාර ධර්මයන්හි කිසිදු සීමාවක් නොතබා අනිත්‍ය​සංඥාව උපස්ථාපනය කිරීමට සෑහේ.",
      "paliTitle": "Anavatthitasuttaṃ"
    },
    {
      "number": 103,
      "pali": "‘‘Cha, bhikkhave, ānisaṃse sampassamānena alameva bhikkhunā sabbasaṅkhāresu anodhiṃ karitvā dukkhasaññaṃ upaṭṭhāpetuṃ. Katame cha? ‘Sabbasaṅkhāresu ca me nibbidasaññā paccupaṭṭhitā bhavissati, seyyathāpi ukkhittāsike vadhake. Sabbalokā ca me mano vuṭṭhahissati, nibbāne ca santadassāvī bhavissāmi, anusayā ca me samugghātaṃ gacchissanti [gacchanti (pī. ka.)], kiccakārī ca bhavissāmi, satthā ca me pariciṇṇo bhavissati mettāvatāyā’ti. Ime kho, bhikkhave, cha ānisaṃse sampassamānena alameva bhikkhunā sabbasaṅkhāresu anodhiṃ karitvā dukkhasaññaṃ upaṭṭhāpetu’’nti. Aṭṭhamaṃ.",
      "english": "Monks, for a monk who sees these six advantages, it is enough to universally establish the perception of suffering in all fabrications. Which six? ‘The perception of disenchantment will be present for me in all fabrications, just as if facing a murderer with an upraised sword. And my mind will be disengaged from all worlds; and I will be one who sees peace in Nibbāna; and my underlying defilements will be eradicated; and I will be one who has accomplished what is to be done; and the Teacher will have been served by me with devotion.’ Monks, for a monk who sees these six advantages, it is enough to universally establish the perception of suffering in all fabrications.",
      "sinhala": "මහණෙනි, මේ ආනිසංස සයක් දකිමින්, සියලු සංස්කාරයන්හි සීමා නොකර, දුක්ඛ සංඥාව මනසට නැඟීමට භික්‍ෂුවට ප්‍රමාණවත්ය. ඒ සය කවරේද?\n\n‘සියලු සංස්කාරයන්හි මා හට නොඇලීමේ සංඥාව (නිබ්බිදා සංඥාව) පහළ වන්නේය, කඩුව එසවූ ඝාතකයෙකු මෙන්. සියලු ලෝකයෙන් මාගේ සිත ඉවත්වන්නේය. නිර්වාණය ශාන්ත වශයෙන් දකින්නෙක් වන්නේය. මාගේ අනුසයෝ සමුච්ඡේදයට පැමිණෙන්නේය. මා විසින් කළ යුතු දේ කරන්නෙක් වන්නේය. ශාස්තෘන් වහන්සේ මා විසින් සේවනය කරනු ලැබුවේ වන්නේය.’\n\nමහණෙනි, මේ ආනිසංස සය දකිමින්, සියලු සංස්කාරයන්හි සීමා නොකර, දුක්ඛ සංඥාව මනසට නැඟීමට භික්‍ෂුවට ප්‍රමාණවත්ය. අටවෙනි සූත්‍රයයි.",
      "paliTitle": "Ukkhittāsikasuttaṃ"
    },
    {
      "number": 104,
      "pali": "‘‘Cha, bhikkhave, ānisaṃse sampassamānena alameva bhikkhunā sabbadhammesu anodhiṃ karitvā anattasaññaṃ upaṭṭhāpetuṃ. Katame cha? Sabbaloke ca atammayo bhavissāmi, ahaṅkārā ca me uparujjhissanti, mamaṅkārā ca me uparujjhissanti, asādhāraṇena ca ñāṇena samannāgato bhavissāmi, hetu ca me sudiṭṭho bhavissati, hetusamuppannā ca dhammā. Ime kho, bhikkhave, cha ānisaṃse sampassamānena alameva bhikkhunā sabbadhammesu anodhiṃ karitvā anattasaññaṃ upaṭṭhāpetu’’nti. Navamaṃ.",
      "english": "Monks, a monk who contemplates these six advantages should indeed establish the perception of non-self in all phenomena without any limitation. What are these six? I will be non-identified with anything in the entire world; my conceits of ‘I am’ will cease; my conceits of ‘mine’ will cease; I will be endowed with unshared knowledge; the cause will be clearly seen by me; and phenomena arisen from cause will also be clearly seen. Monks, a monk who contemplates these six advantages should indeed establish the perception of non-self in all phenomena without any limitation.",
      "sinhala": "භික්ෂූන් වහන්ස, ආනිසංස හයක් මැනවින් දකිමින්, සියලු ධර්මයන් කෙරෙහි කිසිදු සීමාවක් නොකොට අනත්ත සංඥාව පිහිටුවා ගැනීමට භික්ෂුවකට ප්‍රමාණවත්ය. එම ආනිසංස හය කවරේද යත්: සියලු ලෝකයෙහි කිසිදු දෙයකට මම බැඳී නොසිටින්නෙමි; මාගේ ‘මම’ යන හැඟීම් (අහංකාරයන්) නිරුද්ධ වනු ඇත; මාගේ ‘මාගේය’ යන හැඟීම් (මමක්කාරයන්) නිරුද්ධ වනු ඇත; මම අසාධාරණ වූ ඥානයකින් යුක්ත වන්නෙමි; හේතුවද, හේතූන්ගෙන් හටගත් ධර්මයන්ද මා විසින් මැනවින් අවබෝධ කර ගත්තක් වනු ඇත. භික්ෂූන් වහන්ස, මේ ආනිසංස හය මැනවින් දකිමින්, සියලු ධර්මයන් කෙරෙහි කිසිදු සීමාවක් නොකොට අනත්ත සංඥාව පිහිටුවා ගැනීමට භික්ෂුවකට ප්‍රමාණවත්ය.",
      "paliTitle": "Atammayasuttaṃ"
    },
    {
      "number": 105,
      "pali": "‘‘Tayome, bhikkhave, bhavā pahātabbā, tīsu sikkhāsu sikkhitabbaṃ. Katame tayo bhavā pahātabbā? Kāmabhavo, rūpabhavo, arūpabhavo – ime tayo bhavā pahātabbā. Katamāsu tīsu sikkhāsu sikkhitabbaṃ? Adhisīlasikkhāya, adhicittasikkhāya, adhipaññāsikkhāya – imāsu tīsu sikkhāsu sikkhitabbaṃ. Yato kho, bhikkhave, bhikkhuno ime tayo bhavā pahīnā honti, imāsu ca tīsu sikkhāsu sikkhitasikkho hoti – ayaṃ vuccati, bhikkhave, bhikkhu acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’ti. Dasamaṃ.",
      "english": "Monks, these three modes of existence are to be abandoned, and in three trainings one should train. Which are these three modes of existence to be abandoned? The existence in the realm of sensual desire, the existence in the realm of form, and the existence in the realm of the formless – these are the three modes of existence to be abandoned. In which three trainings should one train? In the training in higher virtue, in the training in higher mind, and in the training in higher wisdom – in these three trainings one should train. When, monks, for a monk these three modes of existence have been abandoned, and he is thoroughly trained in these three trainings, then that monk, monks, is said to have cut off craving, to have unraveled the fetters, and by rightly comprehending conceit, to have made an end of suffering.",
      "sinhala": "මහණෙනි, මේ භව තුනක් ප්‍රහීණ කළ යුතුයි, සික්ඛා තුනක හික්මිය යුතුයි. ප්‍රහීණ කළ යුතු භව තුන කවරේද? කාම භවය, රූප භවය, අරූප භවයයි. මේ භව තුන ප්‍රහීණ කළ යුතුයි. හික්මිය යුතු සික්ඛා තුන කවරේද? අධිසීල සික්ඛාව, අධිචිත්ත සික්ඛාව, අධිප්‍රඥා සික්ඛාවයි. මේ සික්ඛා තුනෙහි හික්මිය යුතුයි. මහණෙනි, යම් මහණකු විසින් මේ භව තුන ප්‍රහීණ කරනු ලැබූ කල්හි, මේ සික්ඛා තුනෙහි හික්මී පුහුණුව ලැබූ කල්හි – ඒ මහණ, මහණෙනි, තෘෂ්ණාව සිඳලූයේ, සංයෝජන දුරු කළේ, මැනවින් මානය අවබෝධ කර ප්‍රහීණ කිරීමෙන් දුක කෙළවර කළේ යැයි කියනු ලැබේ.",
      "paliTitle": "Bhavasuttaṃ"
    },
    {
      "number": 106,
      "pali": "‘‘Tisso imā, bhikkhave, taṇhā pahātabbā, tayo ca mānā. Katamā tisso taṇhā pahātabbā? Kāmataṇhā, bhavataṇhā, vibhavataṇhā – imā tisso taṇhā pahātabbā. Katame tayo mānā pahātabbā? Māno, omāno, atimāno – ime tayo mānā pahātabbā. Yato kho, bhikkhave, bhikkhuno imā tisso taṇhā pahīnā honti, ime ca tayo mānā; ayaṃ vuccati, bhikkhave, bhikkhu acchecchi taṇhaṃ, vivattayi saṃyojanaṃ, sammā mānābhisamayā antamakāsi dukkhassā’’ti. Ekādasamaṃ. ",
      "english": "Monks, these three cravings are to be abandoned, and three types of conceit. Which are the three cravings to be abandoned? Craving for sensual pleasures, craving for existence, craving for non-existence – these three cravings are to be abandoned. Which are the three types of conceit to be abandoned? Conceit, contempt, arrogance – these three types of conceit are to be abandoned. When, monks, these three cravings are abandoned by a monk, and these three types of conceit, then such a monk is called one who has cut off craving, undone the fetters, and by the right comprehension of conceit, has made an end of suffering.",
      "sinhala": "මහණෙනි, මේ තෘෂ්ණාවන් තුනක් ද, මානයන් තුනක් ද පහ කළ යුතු වෙති. කවර නම් තෘෂ්ණාවෝ තුනක් පහ කළ යුතු වෙත් ද? කාමතෘෂ්ණාව, භවතෘෂ්ණාව, විභවතෘෂ්ණාව – මේ තෘෂ්ණාවෝ තුන පහ කළ යුතු වෙති. කවර නම් මානයෝ තුනක් පහ කළ යුතු වෙත් ද? මානය, ඕමානය, අතිමානය – මේ මානයෝ තුන පහ කළ යුතු වෙති. මහණෙනි, යම් කලෙක භික්‍ෂුවකට මේ තෘෂ්ණාවන් තුන පහ වී ඇත්ද, මේ මානයන් තුන ද පහ වී ඇත්ද; ඔහු තෘෂ්ණාව සිඳලීය, සංයෝජන පෙරළා දැමීය, මානය මැනවින් ප්‍රත්‍යක්‍ෂ කිරීමෙන් දුක කෙළවර කෙළේයැයි කියනු ලැබේ.",
      "paliTitle": "Taṇhāsuttaṃ"
    }
  ],
  "footer": {
    "pali": "Ānisaṃsavaggo dasamo. [pañcamo (syā. ka.)] Tassuddānaṃ – Pātubhāvo ānisaṃso, aniccadukkhaanattato; Nibbānaṃ anavatthi, ukkhittāsi atammayo; Bhavā taṇhāyekā dasāti. Dutiyapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}