{
  "id": "an6.5",
  "title": {
    "pali": "Dhammikavaggo",
    "english": "The Chapter on the Righteous",
    "sinhala": "ධම්මික වග්ගය"
  },
  "sections": [
    {
      "number": 43,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiyaṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto āyasmantaṃ ānandaṃ āmantesi – ‘‘āyāmānanda, yena pubbārāmo migāramātupāsādo tenupasaṅkamissāma divāvihārāyā’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Atha kho bhagavā āyasmatā ānandena saddhiṃ yena pubbārāmo migāramātupāsādo tenupasaṅkami. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito āyasmantaṃ ānandaṃ āmantesi – ‘‘āyāmānanda, yena pubbakoṭṭhako tenupasaṅkamissāma gattāni parisiñcitu’’nti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Atha kho bhagavā āyasmatā ānandena saddhiṃ yena pubbakoṭṭhako tenupasaṅkami gattāni parisiñcituṃ. Pubbakoṭṭhake gattāni parisiñcitvā paccuttaritvā ekacīvaro aṭṭhāsi gattāni pubbāpayamāno. Tena kho pana samayena rañño pasenadissa kosalassa seto nāma nāgo mahātūriya [mahāturiya (sī. syā. kaṃ. pī.)] tāḷitavāditena pubbakoṭṭhakā paccuttarati. Apissu taṃ jano disvā evamāha – ‘‘abhirūpo vata, bho, rañño nāgo; dassanīyo vata, bho, rañño nāgo; pāsādiko vata, bho, rañño nāgo; kāyupapanno vata, bho, rañño nāgo’’ti! Evaṃ vutte āyasmā udāyī bhagavantaṃ etadavoca – ‘‘hatthimeva nu kho, bhante, mahantaṃ brahantaṃ [mahantaṃ bruhantaṃ (sī.), mahattaṃ brahmattaṃ (ka.)] kāyupapannaṃ jano disvā evamāha – ‘nāgo vata, bho, nāgo’ti, udāhu aññampi kañci [kiñci (ka.)] mahantaṃ brahantaṃ kāyupapannaṃ jano disvā evamāha – ‘nāgo vata, bho, nāgo’’’ti? ‘‘Hatthimpi kho, udāyi, mahantaṃ brahantaṃ kāyupapannaṃ jano disvā evamāha – ‘nāgo vata, bho, nāgo’ti! Assampi kho, udāyi, mahantaṃ brahantaṃ…pe… goṇampi kho, udāyi, mahantaṃ brahantaṃ…pe… uragampi [nāgampi (ka.)] kho, udāyi, mahantaṃ brahantaṃ…pe… rukkhampi kho, udāyi, mahantaṃ brahantaṃ…pe… manussampi kho, udāyi, mahantaṃ brahantaṃ kāyupapannaṃ jano disvā evamāha – ‘nāgo vata, bho, nāgo’ti! Api ca, udāyi, yo sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya āguṃ na karoti kāyena vācāya manasā, tamahaṃ ‘nāgo’ti brūmī’’ti. ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāva subhāsitaṃ cidaṃ, bhante, bhagavatā – api ca, udāyi, yo sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya āguṃ na karoti kāyena vācāya manasā, tamahaṃ ‘nāgo’ti brūmī’’ti. Idañca panāhaṃ, bhante, bhagavatā subhāsitaṃ imāhi gāthāhi anumodāmi – ‘‘Manussabhūtaṃ sambuddhaṃ, attadantaṃ samāhitaṃ; Iriyamānaṃ brahmapathe, cittassūpasame rataṃ. ‘‘Yaṃ manussā namassanti, sabbadhammāna pāraguṃ; Devāpi taṃ [naṃ (sī. pī.)] namassanti, iti me arahato sutaṃ. ‘‘Sabbasaṃyojanātītaṃ, vanā nibbana [nibbāna (sī. syā. kaṃ. pī.)] māgataṃ; Kāmehi nekkhammarataṃ [nekkhamme rataṃ (ka. sī.)], muttaṃ selāva kañcanaṃ. ‘‘Sabbe accarucī nāgo, himavāññe siluccaye; Sabbesaṃ nāganāmānaṃ, saccanāmo anuttaro. ‘‘Nāgaṃ vo [te (ka.)] kittayissāmi, na hi āguṃ karoti so; Soraccaṃ avihiṃsā ca, pādā nāgassa te duve. ‘‘Tapo ca brahmacariyaṃ, caraṇā nāgassa tyāpare; Saddhāhattho mahānāgo, upekkhāsetadantavā. ‘‘Sati gīvā siro paññā, vīmaṃsā dhammacintanā; Dhammakucchisamātapo, viveko tassa vāladhi. ‘‘So jhāyī assāsarato, ajjhattaṃ susamāhito [ajjhattupasamāhito (syā. ka.)]; Gacchaṃ samāhito nāgo, ṭhito nāgo samāhito. ‘‘Seyyaṃ samāhito nāgo, nisinnopi samāhito; Sabbattha saṃvuto nāgo, esā nāgassa sampadā. ‘‘Bhuñjati anavajjāni, sāvajjāni na bhuñjati; Ghāsamacchādanaṃ laddhā, sannidhiṃ parivajjayaṃ. ‘‘Saṃyojanaṃ aṇuṃ thūlaṃ, sabbaṃ chetvāna bandhanaṃ; Yena yeneva gacchati, anapekkhova gacchati. ‘‘Yathāpi udake jātaṃ, puṇḍarīkaṃ pavaḍḍhati; Nupalippati [na upalippati (sī. syā. kaṃ. pī.), nupalimpati (ka.)] toyena, sucigandhaṃ manoramaṃ. ‘‘Tatheva loke sujāto, buddho loke viharati; Nupalippati lokena, toyena padumaṃ yathā. ‘‘Mahāginīva jalito [mahāggini pajjalito (sī. syā. kaṃ.)], anāhārūpasammati; Saṅkhāresūpasantesu [aṅgāresu ca santesu (ka.)], nibbutoti pavuccati. ‘‘Atthassāyaṃ viññāpanī, upamā viññūhi desitā; Viññassanti [viññissanti (ka.)] mahānāgā, nāgaṃ nāgena desitaṃ. ‘‘Vītarāgo vītadoso, vītamoho anāsavo; Sarīraṃ vijahaṃ nāgo, parinibbissati [parinibbāti (pī. ka.)] anāsavo’’ti. paṭhamaṃ;",
      "english": "Once the Blessed One was staying at Savatthi, in Jeta's Grove, Anathapindika's park. Then, in the morning, the Blessed One dressed, took his bowl and robe, and entered Savatthi for alms. Having walked for alms in Savatthi and returned from his alms round after the meal, the Blessed One addressed Venerable Ananda: \"Come, Ananda, let us go to the Eastern Park, Migaramata's Palace, for our midday rest.\" \"Yes, venerable sir,\" replied Venerable Ananda to the Blessed One. Then the Blessed One, together with Venerable Ananda, went to the Eastern Park, Migaramata's Palace. Then, in the evening, having emerged from his solitary retreat, the Blessed One addressed Venerable Ananda: \"Come, Ananda, let us go to the Eastern Bathing Hall to bathe our limbs.\" \"Yes, venerable sir,\" replied Venerable Ananda to the Blessed One. Then the Blessed One, together with Venerable Ananda, went to the Eastern Bathing Hall to bathe his limbs. Having bathed his limbs at the Eastern Bathing Hall and come out, he stood wearing a single robe, drying his limbs. At that time, King Pasenadi of Kosala's white elephant, named Seto, came out of the Eastern Bathing Hall amidst the sound of great musical instruments being played. Seeing it, people exclaimed: \"Oh, what a handsome Nāga is the king's Nāga! Oh, what a splendid Nāga is the king's Nāga! Oh, what a pleasing Nāga is the king's Nāga! Oh, what a magnificent body the king's Nāga possesses!\" When this was said, Venerable Udayi said to the Blessed One: \"Venerable sir, is it only when people see a great, magnificent, embodied elephant that they exclaim, 'Oh, what a Nāga! Oh, what a Nāga!' or do they also exclaim, 'Oh, what a Nāga! Oh, what a Nāga!' when they see any other great, magnificent, embodied being?\" \"Indeed, Udayi, when people see a great, magnificent, embodied elephant, they exclaim, 'Oh, what a Nāga! Oh, what a Nāga!' When people see a great, magnificent, embodied horse, they exclaim, 'Oh, what a Nāga! Oh, what a Nāga!' When people see a great, magnificent, embodied ox, they exclaim, 'Oh, what a Nāga! Oh, what a Nāga!' When people see a great, magnificent, embodied snake, they exclaim, 'Oh, what a Nāga! Oh, what a Nāga!' When people see a great, magnificent, embodied tree, they exclaim, 'Oh, what a Nāga! Oh, what a Nāga!' When people see a great, magnificent, embodied human being, they exclaim, 'Oh, what a Nāga! Oh, what a Nāga!' But, Udayi, I declare that one who, in this world with its deities, Māras, and Brahmās, among the generation with its ascetics and brahmins, its gods and humans, commits no offense by body, speech, or mind – that one I call a Nāga.\"\n\n\"It is astonishing, venerable sir, it is amazing, venerable sir! How well spoken this is by the Blessed One: 'But, Udayi, I declare that one who, in this world with its deities, Māras, and Brahmās, among the generation with its ascetics and brahmins, its gods and humans, commits no offense by body, speech, or mind – that one I call a Nāga.'\" \"And furthermore, venerable sir, I endorse this well-spoken statement by the Blessed One with these verses:\"\n\nThe Fully Awakened One, who has become human,\nSelf-controlled and well-concentrated,\nMoving on the path of holiness,\nDelighting in the calming of the mind.\n\nThe one whom humans venerate,\nThe master of all phenomena;\nEven the devas venerate him,\nSo have I heard from the Arahant.\n\nGone beyond all fetters,\nHaving come from the jungle to Nibbāna;\nDelighting in renunciation from sensual pleasures,\nLiberated like gold from a rock.\n\nThis Nāga surpasses all,\nAs the Himalayas surpass other mountains;\nOf all those called 'Nāga',\nHe is the true Nāga, unsurpassed.\n\nI will extol this Nāga for you,\nFor he commits no offense;\nGentleness and non-violence\nThese are the Nāga's two feet.\n\nAusterity and the holy life,\nThese are the Nāga's other conduct;\nThe Great Nāga has faith as his hand,\nAnd equanimity as his white tusk.\n\nMindfulness is his neck, wisdom his head,\nCritical inquiry and reflection on the Dhamma;\nThe ardent practice of Dhamma is his inner warmth,\nSolitude is his tail.\n\nHe is a meditator, delighting in inner peace,\nWell-concentrated within himself;\nWhen walking, the Nāga is concentrated,\nWhen standing, the Nāga is concentrated.\n\nWhen lying down, the Nāga is concentrated,\nWhen sitting, he is also concentrated;\nEverywhere the Nāga is restrained,\nThis is the Nāga's accomplishment.\n\nHe consumes only the blameless,\nHe does not consume the blameworthy;\nHaving obtained food and clothing,\nHe avoids accumulation.\n\nHaving cut all fetters, subtle and gross,\nAll bonds;\nWherever he goes,\nHe goes without attachment.\n\nJust as a white lotus, born in water,\nGrows luxuriantly;\nIt is not soiled by the water,\nPure-scented and delightful to the mind.\n\nSimilarly, the Buddha, well-born in the world,\nDwells in the world;\nHe is not soiled by the world,\nLike a lotus by water.\n\nLike a great fire blazing,\nIt subsides without fuel;\nWhen the fabrications have entirely ceased,\nHe is said to have attained Nibbāna.\n\nThis is an explanation of the meaning, an analogy taught by the discerning. The great Arahants will comprehend the path of the Arahant, as taught by an Arahant. Free from lust, free from hatred, free from delusion, without taints—that Arahant, abandoning the body, will attain final Nibbāna, without taints.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුවෙහි සිවුරු පොරවා, පාත්‍ර සිවුරු රැගෙන සැවැත් නුවරට පිඬු සිඟා වැඩම කළ සේක. සැවැත් නුවර පිඬු සිඟා වැඩි සේක. දහවල් භෝජනයෙන් පසු පිණ්ඩපාතයෙන් නැවත පැමිණ ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: “ආනන්ද, දිවා විහරණය පිණිස මිගාරමාතු ප්‍රාසාදය පිහිටි පූර්වාරාමය වෙත යමු.” “එසේය, භාග්‍යවතුන් වහන්සැ”යි ආයුෂ්මත් ආනන්ද හිමියෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද හිමියන් සමඟ මිගාරමාතු ප්‍රාසාදය පිහිටි පූර්වාරාමය වෙත වැඩම කළ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි ප්‍රතිසංලීන භාවයෙන් නැඟී සිට ආයුෂ්මත් ආනන්ද හිමියන්ට මෙසේ ඇමතූ සේක: “ආනන්ද, ශරීරය සෝදා ගැනීමට පුබ්බකොට්ඨකය (පෙරකොටුව) වෙත යමු.” “එසේය, භාග්‍යවතුන් වහන්සැ”යි ආයුෂ්මත් ආනන්ද හිමියෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ආනන්ද හිමියන් සමඟ ශරීරය සෝදා ගැනීමට පුබ්බකොට්ඨකය වෙත වැඩම කළ සේක. පුබ්බකොට්ඨකයෙහි ශරීරය සෝදා, ආපසු පැමිණ, තනි සිවුරකින් ශරීරය වියළවමින් සිටි සේක. එසමයෙහි කෝසල රජු වූ පසේනදී රජුගේ \"සේත\" නම් හස්ති රාජයා මහා තූර්ය වාදන හඬින් යුතුව පුබ්බකොට්ඨකය අසලින් බැස යමින් සිටියේය. ඒ සෙනඟ (ජනතාව) එය දැක මෙසේ කීහ: “පින්වත්නි, රජුගේ ඇතා ඉතා අලංකාරය! පින්වත්නි, රජුගේ ඇතා ඉතා දර්ශනීයය! පින්වත්නි, රජුගේ ඇතා ඉතා ප්‍රිය මනාපය! පින්වත්නි, රජුගේ ඇතා උතුම් ශරීරයකින් යුක්තය!”\n\nමෙසේ කී කල්හි ආයුෂ්මත් උදායි හිමියෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “භාග්‍යවතුන් වහන්ස, මහත් වූ, උදාර වූ ශරීරයකින් යුක්ත ඇතෙකු දැක ජනතාව ‘පින්වත්නි, මේ නාගයෙකි! නාගයෙකි!’ යැයි කියන්නේද, නැතහොත් වෙනත් යම් කිසි මහත් වූ, උදාර වූ ශරීරයකින් යුක්ත කෙනෙකු දැක ජනතාව ‘පින්වත්නි, මේ නාගයෙකි! නාගයෙකි!’ යැයි කියන්නේද?” “උදායි, මහත් වූ, උදාර වූ ශරීරයකින් යුක්ත ඇතෙකු දැක ද ජනතාව ‘පින්වත්නි, මේ නාගයෙකි! නාගයෙකි!’ යැයි කියති. උදායි, මහත් වූ, උදාර වූ ශරීරයකින් යුක්ත අශ්වයෙකු දැක ද ජනතාව ‘පින්වත්නි, මේ නාගයෙකි! නාගයෙකි!’ යැයි කියති. උදායි, මහත් වූ, උදාර වූ ශරීරයකින් යුක්ත ගොනෙකු දැක ද ජනතාව ‘පින්වත්නි, මේ නාගයෙකි! නාගයෙකි!’ යැයි කියති. උදායි, මහත් වූ, උදාර වූ ශරීරයකින් යුක්ත සර්පයෙකු දැක ද ජනතාව ‘පින්වත්නි, මේ නාගයෙකි! නාගයෙකි!’ යැයි කියති. උදායි, මහත් වූ, උදාර වූ ශරීරයකින් යුක්ත වෘක්ෂයක් දැක ද ජනතාව ‘පින්වත්නි, මේ නාගයෙකි! නාගයෙකි!’ යැයි කියති. උදායි, මහත් වූ, උදාර වූ ශරීරයකින් යුක්ත මනුෂ්‍යයෙකු දැක ද ජනතාව ‘පින්වත්නි, මේ නාගයෙකි! නාගයෙකි!’ යැයි කියති! එහෙත්, උදායි, යම් පුද්ගලයෙක් දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත මේ ලෝකයෙහි කයින් වචනයෙන් මනසින් වරදක් නොකරයිද, මම ඔහු ‘නාගයෙකි’ යැයි කියමි.”\n\n“ආශ්චර්‍යය, භාග්‍යවතුන් වහන්ස, අද්භූතය, භාග්‍යවතුන් වහන්ස! භාග්‍යවතුන් වහන්සේ විසින් කොතරම් මනාව වදාරන ලද්දේද! ‘උදායි, යම් පුද්ගලයෙක් දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත මේ ලෝකයෙහි කයින් වචනයෙන් මනසින් වරදක් නොකරයිද, මම ඔහු ‘නාගයෙකි’ යැයි කියමි’ යන මේ දේශනාව!” “භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් මනාව වදාරන ලද මේ (දේශනාව) මම මේ ගාථාවන්ගෙන් අනුමෝදන් කරමි:\n\nමනුෂ්‍ය භාවයට පත් වූ, ස්වයං දමනයෙන් යුක්ත වූ, සමථයෙන් යුක්ත වූ, බ්‍රහ්ම මාර්ගයෙහි හැසිරෙන, සිතේ උපශාන්තියෙහි ඇලුණු ඒ සම්බුදුරජාණන් වහන්සේව (මම අනුමෝදන් කරමි).\n\nයම් නාගයෙකුට (සම්බුදුරජාණන් වහන්සේට) මනුෂ්‍යයෝ නමස්කාර කරත්ද, සියලු ධර්මයන්ගේ පරතෙරට පැමිණි ඒ නාගයාට දෙවියෝ ද නමස්කාර කරත්. මේ මා අරහත් වූ බුදුරදුන්ගෙන් අසන ලද්දකි.\n\nසියලු සංයෝජනයන් ඉක්මවා ගිය, (සංසාර) වනයෙන් නිවනට පැමිණි, කාමයන්ගෙන් නික්මීමෙහි ඇලුණු, පර්වතයකින් නිදහස් වූ රනක් මෙන් වූ ඒ නාගයාට (මම අනුමෝදන් කරමි).\n\nහිමාලයේ ඇති අනෙකුත් පර්වත මුදුන් සියල්ලට වඩා හිමාලය පර්වතය බැබළෙන්නා සේම, සියලු නාග යන නාමයන් අතරින් සත්‍ය නාමය ඇති නාගයා (බුදුරජාණන් වහන්සේ) අනුත්තරය (උත්තරීතරය).\n\nවරදක් නොකරන ඒ නාගයා ගැන මම ඔබට වර්ණනා කරමි. ඉවසීම හා අවිහිංසාව ඒ නාගයාගේ පාද දෙක වෙති.\n\nතපස හා බ්‍රහ්මචර්යාව ඒ නාගයාගේ අනෙකුත් හැසිරීම් වෙති. ශ්‍රද්ධාව නම් වූ හස්තයන් ඇති ඒ මහා නාගයා, උපේක්ෂාව නම් වූ සුදු දත් ඇති කෙනෙකි.\n\nසතිය ගෙල වෙයි, ප්‍රඥාව හිස වෙයි. විමංසාව (විචාරය) ධර්මයන් ගැන කල්පනා කිරීම වෙයි. ධර්මය නම් වූ කුසෙහි සමථය හා තපස වෙයි. විවේකය ඔහුගේ වල්ගය වෙයි.\n\nඔහු ධ්‍යාන කරන්නෙකි, ආශ්වාස ප්‍රශ්වාසයන්හි ඇලී සිටින්නෙකි, අභ්‍යන්තරයෙන් මනාව සමථයට පත් වූවෙකි. යන කල්හි ඒ නාගයා සමථයෙන් යුක්තය. සිටින කල්හි ඒ නාගයා සමථයෙන් යුක්තය.\n\nසැතපෙන කල්හි ඒ නාගයා සමථයෙන් යුක්තය. හිඳ සිටින කල්හි ද සමථයෙන් යුක්තය. සියලු තැන්හි ඒ නාගයා සංවරය. මේ ඒ නාගයාගේ සම්පත්තියයි.\n\n(ඒ නාගයා) නිරවද්‍ය දෑ අනුභව කරයි, සාවද්‍ය දෑ අනුභව නොකරයි. අහාරපාන සහ වස්ත්‍ර ලැබුණත්, ඒවා ගබඩා කිරීමෙන් වළකී.\n\nසියුම් හෝ ස්ථූල වූ සියලු බැඳීම්, සියලු සංයෝජන ඡේදනය කර, යම් යම් තැනකට යන්නේද, අපේක්ෂා රහිතවම යයි.\n\nජලයෙහි හටගෙන වැඩෙන පියුමක් ජලයෙන් නොකිලිටෙයිද, පිරිසිදු සුවඳින් යුක්තව මනහර වෙයිද,\n\nඑසේම ලෝකයෙහි මනාව උපන් බුදුරජාණන් වහන්සේ ලෝකයෙහි වැඩවසන සේක. පියුමක් ජලයෙන් නොකිලිටෙන්නා සේම, ලෝකයෙන් කිලිටි නොවෙති.\n\nමහත් ගින්නක් මෙන් දැල්වී, ආහාර නැති කල්හි සන්සිඳෙයිද, එසේම, (කායික, වාචසික, මානසික) සංස්කාරයන් සන්සිඳුනු කල්හි ‘නිර්වාණයට පත් විය’ යැයි කියනු ලැබේ.\n\nමෙය අර්ථය පැහැදිලි කරන්නකි. මෙය නුවණැත්තන් විසින් දේශනා කරන ලද උපමාවකි. නාගයෙකු (සියලු කෙලෙස් නසා අවසන් කළ උතුමකු) විසින් දේශනා කරන ලද නාගයාගේ (එවැනි නිර්මල උතුමකුගේ) ස්වභාවය මහා නාගයෝ (රහතන් වහන්සේලා) අවබෝධ කරගන්නාහ.\n\nරාගය, ද්වේෂය සහ මෝහය දුරු කළ, ආශ්‍ර​ව රහිත වූ නාගයා (රහතන් වහන්සේ), දේහය අතහැර දමමින්, ආශ්‍ර​වයන්ගෙන් තොරව පිරිනිවන් පානු ඇත.",
      "paliTitle": "Nāgasuttaṃ",
      "englishTitle": "The Nāga Discourse",
      "sinhalaTitle": "නාග සූත්‍රය"
    },
    {
      "number": 44,
      "pali": "Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena migasālāya upāsikāya nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho migasālā [migasāṇā (ka.) a. ni. 10.75] upāsikā yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho migasālā upāsikā āyasmantaṃ ānandaṃ etadavoca – ‘‘Kathaṃ kathaṃ nāmāyaṃ, bhante ānanda, bhagavatā dhammo desito aññeyyo, yatra hi nāma brahmacārī ca abrahmacārī ca ubho samasamagatikā bhavissanti abhisamparāyaṃ? Pitā me, bhante, purāṇo brahmacārī ahosi ārācārī virato methunā gāmadhammā. So kālaṅkato bhagavatā byākato sakadāgāmisatto [sakadāgāmipatto (ka. syā. pī.)] tusitaṃ kāyaṃ upapannoti. Petteyyopi [pettayyo piyo (sī. pī. ka.), pitu piyo (syā. kaṃ.)] me, bhante, isidatto abrahmacārī ahosi sadārasantuṭṭho. Sopi kālaṅkato bhagavatā byākato sakadāgāmipatto tusitaṃ kāyaṃ upapannoti. Kathaṃ kathaṃ nāmāyaṃ, bhante ānanda, bhagavatā dhammo desito aññeyyo, yatra hi nāma brahmacārī ca abrahmacārī ca ubho samasamagatikā bhavissanti abhisamparāya’’nti? ‘‘Evaṃ kho panetaṃ, bhagini, bhagavatā byākata’’nti. Atha kho āyasmā ānando migasālāya upāsikāya nivesane piṇḍapātaṃ gahetvā uṭṭhāyāsanā pakkāmi. Atha kho āyasmā ānando pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena migasālāya upāsikāya nivesanaṃ tenupasaṅkamiṃ; upasaṅkamitvā paññatte āsane nisīdiṃ. Atha kho, bhante, migasālā upāsikā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho, bhante, migasālā upāsikā maṃ etadavoca – ‘kathaṃ kathaṃ nāmāyaṃ, bhante ānanda, bhagavatā dhammo desito aññeyyo, yatra hi nāma brahmacārī ca abrahmacārī ca ubho samasamagatikā bhavissanti abhisamparāyaṃ. Pitā me, bhante, purāṇo brahmacārī ahosi ārācārī virato methunā gāmadhammā. So kālaṅkato bhagavatā byākato sakadāgāmipatto tusitaṃ kāyaṃ upapannoti. Petteyyopi me, bhante, isidatto abrahmacārī ahosi sadārasantuṭṭho. Sopi kālaṅkato bhagavatā byākato sakadāgāmipatto tusitaṃ kāyaṃ upapannoti. Kathaṃ kathaṃ nāmāyaṃ, bhante ānanda, bhagavatā dhammo desito aññeyyo, yatra hi nāma brahmacārī ca abrahmacārī ca ubho samasamagatikā bhavissanti abhisamparāya’nti? Evaṃ vutte ahaṃ, bhante, migasālaṃ upāsikaṃ etadavocaṃ – ‘evaṃ kho panetaṃ, bhagini, bhagavatā byākata’’’nti. ‘‘Kā cānanda, migasālā upāsikā bālā abyattā ammakā ammakasaññā [ambakā ambakapaññā (sī. pī.), ambakā ambakasaññā (syā. kaṃ.) a. ni. 10.75 passitabbaṃ], ke ca purisapuggalaparopariyañāṇe? Chayime, ānanda, puggalā santo saṃvijjamānā lokasmiṃ. ‘‘Katame cha? Idhānanda, ekacco puggalo sorato hoti sukhasaṃvāso, abhinandanti sabrahmacārī ekattavāsena. Tassa savanenapi akataṃ hoti, bāhusaccenapi akataṃ hoti, diṭṭhiyāpi appaṭividdhaṃ hoti, sāmāyikampi vimuttiṃ na labhati. So kāyassa bhedā paraṃ maraṇā hānāya pareti no visesāya, hānagāmīyeva hoti no visesagāmī. ‘‘Idha panānanda, ekacco puggalo sorato hoti sukhasaṃvāso, abhinandanti sabrahmacārī ekattavāsena. Tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. So kāyassa bhedā paraṃ maraṇā visesāya pareti no hānāya, visesagāmīyeva hoti no hānagāmī. ‘‘Tatrānanda, pamāṇikā pamiṇanti – ‘imassapi teva dhammā aparassapi teva dhammā, kasmā tesaṃ eko hīno eko paṇīto’ti! Tañhi tesaṃ, ānanda, hoti dīgharattaṃ ahitāya dukkhāya. ‘‘Tatrānanda, yvāyaṃ puggalo sorato hoti sukhasaṃvāso, abhinandanti sabrahmacārī ekattavāsena, tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. Ayaṃ, ānanda, puggalo amunā purimena puggalena abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imaṃ hānanda, puggalaṃ dhammasoto nibbahati, tadantaraṃ ko jāneyya aññatra tathāgatena! Tasmātihānanda, mā puggalesu pamāṇikā ahuvattha; mā puggalesu pamāṇaṃ gaṇhittha. Khaññati hānanda, puggalesu pamāṇaṃ gaṇhanto. Ahaṃ vā, ānanda, puggalesu pamāṇaṃ gaṇheyyaṃ, yo vā panassa mādiso. ‘‘Idha panānanda, ekaccassa puggalassa kodhamāno adhigato [avigato (ka.)] hoti, samayena samayañcassa lobhadhammā uppajjanti. Tassa savanenapi akataṃ hoti, bāhusaccenapi akataṃ hoti, diṭṭhiyāpi appaṭividdhaṃ hoti, sāmāyikampi vimuttiṃ na labhati. So kāyassa bhedā paraṃ maraṇā hānāya pareti no visesāya, hānagāmīyeva hoti no visesagāmī. ‘‘Idha panānanda, ekaccassa puggalassa kodhamāno adhigato hoti, samayena samayañcassa lobhadhammā uppajjanti. Tassa savanenapi kataṃ hoti…pe… no hānagāmī. ‘‘Tatrānanda, pamāṇikā pamiṇanti…pe… yo vā panassa mādiso. ‘‘Idha, panānanda, ekaccassa puggalassa kodhamāno adhigato hoti, samayena samayañcassa vacīsaṅkhārā uppajjanti. Tassa savanenapi akataṃ hoti…pe… sāmāyikampi vimuttiṃ na labhati. So kāyassa bhedā paraṃ maraṇā hānāya pareti no visesāya, hānagāmīyeva hoti no visesagāmī. ‘‘Idha panānanda, ekaccassa puggalassa kodhamāno adhigato hoti, samayena samayañcassa vacīsaṅkhārā uppajjanti. Tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. So kāyassa bhedā paraṃ maraṇā visesāya pareti no hānāya, visesagāmīyeva hoti no hānagāmī. ‘‘Tatrānanda, pamāṇikā pamiṇanti – ‘imassapi teva dhammā, aparassapi teva dhammā. Kasmā tesaṃ eko hīno, eko paṇīto’ti? Tañhi tesaṃ, ānanda, hoti dīgharattaṃ ahitāya dukkhāya. ‘‘Tatrānanda, yassa puggalassa kodhamāno adhigato hoti, samayena samayañcassa vacīsaṅkhārā uppajjanti, tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. Ayaṃ, ānanda, puggalo amunā purimena puggalena abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imaṃ hānanda, puggalaṃ dhammasoto nibbahati. Tadantaraṃ ko jāneyya aññatra tathāgatena! Tasmātihānanda, mā puggalesu pamāṇikā ahuvattha; mā puggalesu pamāṇaṃ gaṇhittha. Khaññati hānanda, puggalesu pamāṇaṃ gaṇhanto. Ahaṃ vā, ānanda, puggalesu pamāṇaṃ gaṇheyyaṃ, yo vā panassa mādiso. ‘‘Kā cānanda, migasālā upāsikā bālā abyattā ammakā ammakasaññā, ke ca purisapuggalaparopariyañāṇe! Ime kho, ānanda, cha puggalā santo saṃvijjamānā lokasmiṃ. ‘‘Yathārūpena, ānanda, sīlena purāṇo samannāgato ahosi, tathārūpena sīlena isidatto samannāgato abhavissa. Nayidha purāṇo isidattassa gatimpi aññassa. Yathārūpāya ca, ānanda, paññāya isidatto samannāgato ahosi, tathārūpāya paññāya purāṇo samannāgato abhavissa. Nayidha isidatto purāṇassa gatimpi aññassa. Iti kho, ānanda, ime puggalā ubho ekaṅgahīnā’’ti. Dutiyaṃ.",
      "english": "Then indeed, the Venerable Ananda, having dressed in the morning, taking his bowl and robe, approached the residence of Migasālā the lay follower. Having approached, he sat down on the seat that had been prepared. Then indeed, Migasālā the lay follower approached the Venerable Ananda. Having approached, she bowed to the Venerable Ananda and sat down to one side. Seated to one side, Migasālā the lay follower said to the Venerable Ananda: \"Venerable Ananda, how is it that the Dhamma taught by the Blessed One is to be understood, such that both a practitioner of the holy life and one who does not practice the holy life might attain an equal destination in the world to come? My father, Venerable sir, was a lifelong practitioner of the holy life, observing purity, abstaining from sexual intercourse and village ways. When he passed away, the Blessed One declared that he was a once-returner, reborn in the Tusita realm. And my paternal uncle, Venerable sir, Isidatta, was one who did not practice the holy life, content with his own wife. When he too passed away, the Blessed One declared that he was a once-returner, reborn in the Tusita realm. Venerable Ananda, how then is the Dhamma taught by the Blessed One to be understood, such that both a practitioner of the holy life and one who does not practice the holy life might attain an equal destination in the world to come?\" \"Indeed, sister, the Blessed One has declared it to be so.\"\n\nThen indeed, the Venerable Ananda, having received alms food at Migasālā the lay follower's residence, rose from his seat and departed. Then indeed, the Venerable Ananda, having returned from his alms round after his meal, approached the Blessed One. Having approached, he bowed to the Blessed One and sat down to one side. Seated to one side, the Venerable Ananda said to the Blessed One: \"Here, Venerable sir, in the morning, having dressed, taking my bowl and robe, I approached the residence of Migasālā the lay follower. Having approached, I sat down on the prepared seat. Then, Venerable sir, Migasālā the lay follower approached me. Having approached, she bowed to me and sat down to one side. Seated to one side, Venerable sir, Migasālā the lay follower said to me: ‘Venerable Ananda, how is it that the Dhamma taught by the Blessed One is to be understood, such that both a practitioner of the holy life and one who does not practice the holy life might attain an equal destination in the world to come? My father, Venerable sir, was a lifelong practitioner of the holy life, observing purity, abstaining from sexual intercourse and village ways. When he passed away, the Blessed One declared that he was a once-returner, reborn in the Tusita realm. And my paternal uncle, Venerable sir, Isidatta, was one who did not practice the holy life, content with his own wife. When he too passed away, the Blessed One declared that he was a once-returner, reborn in the Tusita realm. Venerable Ananda, how then is the Dhamma taught by the Blessed One to be understood, such that both a practitioner of the holy life and one who does not practice the holy life might attain an equal destination in the world to come?’ When this was said, Venerable sir, I said to Migasālā the lay follower: ‘Indeed, sister, the Blessed One has declared it to be so.’\"\n\n\"What is Migasālā the lay follower, Ananda? She is foolish, undeveloped, a mere mother, with a mother's perceptions! And who has the knowledge to discern the higher and lower states of individuals? Ananda, there are these six types of individuals existing in the world. Which six? Here, Ananda, a certain individual is gentle, easy to live with; his companions in the holy life rejoice at living together with him. Yet, for him, nothing has been accomplished through hearing, nothing has been accomplished through extensive learning, the view has not been thoroughly penetrated, and he does not attain temporary liberation. When his body breaks up, after death, he goes to decline, not to distinction; he is one who heads for decline, not for distinction.\n\nBut here, Ananda, a certain individual is gentle, easy to live with; his companions in the holy life rejoice at living together with him. Yet, for him, something has been accomplished through hearing, something has been accomplished through extensive learning, the view has been thoroughly penetrated, and he attains temporary liberation. When his body breaks up, after death, he goes to distinction, not to decline; he is one who heads for distinction, not for decline.\n\nTherein, Ananda, those who judge by measure might make a judgment: ‘The qualities of this one are the same, and the qualities of that one are the same, so why is one inferior and one superior?’ That, Ananda, would indeed lead to their harm and suffering for a long time.\n\nTherein, Ananda, the individual who is gentle, easy to live with, and whose companions in the holy life rejoice at living together with him, and for whom something has been accomplished through hearing, something has been accomplished through extensive learning, the view has been thoroughly penetrated, and he attains temporary liberation: this individual, Ananda, is more advanced and more sublime than that former individual. What is the reason for this? Because, Ananda, the stream of Dhamma carries this individual along; who else could know the inner distinction apart from a Tathagata? Therefore, Ananda, do not be among those who judge individuals by superficial measures; do not take individuals as your measure.\n\nO Ananda, making an estimate of individuals leads to error. Only I, O Ananda, or someone like me, might make an accurate estimate of individuals. Here, O Ananda, for a certain individual, anger and conceit are present, and from time to time, states of greed arise in him. For him, even listening has not been effective, much learning has not been effective, right view has not been penetrated, and he does not attain even temporary liberation. Upon the breakup of the body, after death, he goes to decline, not to distinction; he is one who heads for decline, not for distinction.\n\nHere, O Ananda, for a certain individual, anger and conceit are present, and from time to time, states of greed arise in him. For him, listening has been effective, much learning has been effective, right view has been penetrated, and he attains temporary liberation. Upon the breakup of the body, after death, he goes to distinction, not to decline; he is one who heads for distinction, not for decline.\n\nThere, O Ananda, those who make estimates do so. But making an estimate of individuals leads to error. Only I, O Ananda, or someone like me, might make an accurate estimate of individuals.\n\nHere, O Ananda, for a certain individual, anger and conceit are present, and from time to time, verbal formations arise in him. For him, even listening has not been effective, much learning has not been effective, right view has not been penetrated, and he does not attain even temporary liberation. Upon the breakup of the body, after death, he goes to decline, not to distinction; he is one who heads for decline, not for distinction.\n\nHere, O Ananda, for a certain individual, anger and conceit are present, and from time to time, verbal formations arise in him. For him, listening has been effective, much learning has been effective, right view has been penetrated, and he attains temporary liberation. Upon the breakup of the body, after death, he goes to distinction, not to decline; he is one who heads for distinction, not for decline.\n\nThere, O Ananda, those who make estimates would estimate thus: 'For this one, there are these very same qualities, and for that other one, there are also these very same qualities. Why, then, is one of them inferior and one superior?' And that, O Ananda, would lead to their harm and suffering for a long time.\n\nThere, O Ananda, for the individual for whom anger and conceit are present, and from time to time verbal formations arise, but for whom listening has been effective, much learning has been effective, right view has been penetrated, and temporary liberation has been attained—this individual, O Ananda, is more advanced and more distinguished than that former individual. What is the reason for this? Because, O Ananda, the stream of the Dhamma carries this individual along. Who, apart from the Tathagata, would know such a difference?\n\nTherefore, O Ananda, do not be those who estimate individuals; do not take measure of individuals. O Ananda, making an estimate of individuals leads to error. Only I, O Ananda, or someone like me, might make an accurate estimate of individuals.\n\nWho, O Ananda, is the lay follower Migasala, foolish, ignorant, naive, holding naive perceptions? And who has knowledge of the superior and inferior faculties of individuals? These six types of individuals, O Ananda, are existing and present in the world.\n\nWhatever kind of virtue Purana was endowed with, Isidatta would have been endowed with the same kind of virtue. But Purana would not even know Isidatta's destination. And whatever kind of wisdom Isidatta was endowed with, Purana would have been endowed with the same kind of wisdom. But Isidatta would not even know Purana's destination. Thus, O Ananda, both these individuals are deficient in one aspect.",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන, මිගසාලා උපාසිකාවගේ නිවස වෙත වැඩම කළ සේක. වැඩම කොට පනවා තිබූ ආසනයේ වැඩ සිටි සේක. එවිට මිගසාලා උපාසිකාව ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වෙත පැමිණියාය. පැමිණ, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූවාය. එකත්පස්ව වාඩි වී සිටි මිගසාලා උපාසිකාව ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ පැවසුවාය: ‘‘පූජ්‍ය ආනන්ද ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්මය කෙසේ නම් දත යුතුද? බඹසර රැකි කෙනා සහ බඹසර නොරැකි කෙනා යන දෙදෙනාම පරලොව එකම ගතියකට පත්වන බව කියනු ලැබේ. ස්වාමීනි, මගේ පියා කලක් තිස්සේ බඹසර රකින්නෙක් විය. දුරින් සිටින්නෙක් විය. මෛථුන ගාමධර්මයෙන් වැළකී සිටියේය. හෙතෙම කලුරිය කළ පසු භාග්‍යවතුන් වහන්සේ විසින් වදාළේ ඔහු සකදාගාමී වී තුසිත දෙව්ලොව උපන් බවය. ස්වාමීනි, මගේ පියාගේ සොහොයුරා වූ ඉසිදත්ත නම් තැනැත්තා බඹසර නොරැක්කේය. තම භාර්යාව සමඟ සතුටු වූවෙක් විය. හෙතෙම කලුරිය කළ පසු භාග්‍යවතුන් වහන්සේ විසින් වදාළේ ඔහුද සකදාගාමී වී තුසිත දෙව්ලොව උපන් බවය. පූජ්‍ය ආනන්ද ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්මය කෙසේ නම් දත යුතුද? බඹසර රැකි කෙනා සහ බඹසර නොරැකි කෙනා යන දෙදෙනාම පරලොව එකම ගතියකට පත්වන බව කියනු ලැබේ’’ යැයි කීවාය. ‘‘නංගිය, භාග්‍යවතුන් වහන්සේ විසින් එය එසේම වදාරන ලද්දකි’’ යැයි ආනන්ද ස්ථවිරයන් වහන්සේ පැවසූ සේක. ඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මිගසාලා උපාසිකාවගේ නිවසෙහි පිණ්ඩපාතය වළඳා, ආසනයෙන් නැඟිට පිටත්ව ගිය සේක.\n\nඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ දහවල් දානය වැළඳීමෙන් පසු, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණි සේක. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වැඩ සිටි සේක. එකත්පස්ව වැඩ සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවාය: ‘‘ස්වාමීනි, මෙහිදී මම පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන, මිගසාලා උපාසිකාවගේ නිවස වෙත වැඩම කළෙමි. වැඩම කොට පනවා තිබූ ආසනයේ වාඩි වූයෙමි. ස්වාමීනි, එවිට මිගසාලා උපාසිකාව මා වෙත පැමිණියාය. පැමිණ, මට වන්දනා කොට එකත්පස්ව වාඩි වූවාය. ස්වාමීනි, එකත්පස්ව වාඩි වී සිටි මිගසාලා උපාසිකාව මට මෙසේ පැවසුවාය: ‘පූජ්‍ය ආනන්ද ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්මය කෙසේ නම් දත යුතුද? බඹසර රැකි කෙනා සහ බඹසර නොරැකි කෙනා යන දෙදෙනාම පරලොව එකම ගතියකට පත්වන බව කියනු ලැබේ. ස්වාමීනි, මගේ පියා කලක් තිස්සේ බඹසර රකින්නෙක් විය. දුරින් සිටින්නෙක් විය. මෛථුන ගාමධර්මයෙන් වැළකී සිටියේය. හෙතෙම කලුරිය කළ පසු භාග්‍යවතුන් වහන්සේ විසින් වදාළේ ඔහු සකදාගාමී වී තුසිත දෙව්ලොව උපන් බවය. ස්වාමීනි, මගේ පියාගේ සොහොයුරා වූ ඉසිදත්ත නම් තැනැත්තා බඹසර නොරැක්කේය. තම භාර්යාව සමඟ සතුටු වූවෙක් විය. හෙතෙම කලුරිය කළ පසු භාග්‍යවතුන් වහන්සේ විසින් වදාළේ ඔහුද සකදාගාමී වී තුසිත දෙව්ලොව උපන් බවය. පූජ්‍ය ආනන්ද ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්මය කෙසේ නම් දත යුතුද? බඹසර රැකි කෙනා සහ බඹසර නොරැකි කෙනා යන දෙදෙනාම පරලොව එකම ගතියකට පත්වන බව කියනු ලැබේ’ යැයි කී විට, ස්වාමීනි, මම මිගසාලා උපාසිකාවට මෙසේ පැවසුවෙමි: ‘නංගිය, භාග්‍යවතුන් වහන්සේ විසින් එය එසේම වදාරන ලද්දකි’.\"\n\n‘‘ආනන්දය, මිගසාලා උපාසිකාව කවර නම් බාල, නොදන්නා, මෝඩ, මෝඩ අදහස් ඇත්තියක්ද? පුද්ගලයන්ගේ උස් පහත් බව දැනීමේ නුවණ කවරෙකුට නම් තිබේද? ආනන්දය, මේ ලෝකයෙහි පුද්ගලයන් සය දෙනෙක් සිටිති. ඔවුහු සැබවින්ම ජීවත්ව සිටිති.\n\nඒ සය දෙනා කවරහුද? ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් පහසුවෙන් හික්මවිය හැකි, පහසුවෙන් ඇසුරු කළ හැකි කෙනෙකි. ඔහුගේ බඹසර සගයෝ ඔහු සමඟ එක්ව වාසය කිරීමට සතුටු වෙති. ඔහුට ශ්‍රවණයෙන්ද කිසිවක් සිදු වී නැත. බහුශ්‍රැතභාවයෙන්ද කිසිවක් සිදු වී නැත. දෘෂ්ටියෙන්ද අවබෝධයක් ලැබී නැත. තාවකාලික වූ විමුක්තියද නොලබයි. හෙතෙම කය බිඳී මරණින් මතු හානියටම පත්වෙයි, උසස් බවකට නොපත්වෙයි. හානිය කරාම යන කෙනෙක් වෙයි, උසස් බව කරා යන කෙනෙක් නොවෙයි.\n\nආනන්දය, මෙහි තවත් ඇතැම් පුද්ගලයෙක් පහසුවෙන් හික්මවිය හැකි, පහසුවෙන් ඇසුරු කළ හැකි කෙනෙකි. ඔහුගේ බඹසර සගයෝ ඔහු සමඟ එක්ව වාසය කිරීමට සතුටු වෙති. ඔහුට ශ්‍රවණයෙන්ද යහපතක් සිදු වී ඇත. බහුශ්‍රැතභාවයෙන්ද යහපතක් සිදු වී ඇත. දෘෂ්ටියෙන්ද අවබෝධයක් ලැබී ඇත. තාවකාලික වූ විමුක්තියද ලබයි. හෙතෙම කය බිඳී මරණින් මතු උසස් බවටම පත්වෙයි, හානියට නොපත්වෙයි. උසස් බව කරාම යන කෙනෙක් වෙයි, හානිය කරා යන කෙනෙක් නොවෙයි.\n\nආනන්දය, එහිදී සසඳා බලන (සසඳන) පුද්ගලයෝ මෙසේ මැන බලති: ‘මොහුටත් ඒ ධර්මයන්ම ඇත, අර අයටත් ඒ ධර්මයන්ම ඇත. එසේ නම් ඔවුන්ගෙන් එක් අයෙක් පහත් වන්නේත්, එක් අයෙක් උසස් වන්නේත් ඇයි?’ ආනන්දය, ඒ ඔවුන්ට බොහෝ කලක් අහිත පිණිසත්, දුක පිණිසත් වෙයි.\n\nආනන්දය, මෙහි යම් පුද්ගලයෙක් පහසුවෙන් හික්මවිය හැකි, පහසුවෙන් ඇසුරු කළ හැකි කෙනෙක් වෙයිද, ඔහුගේ බඹසර සගයෝ ඔහු සමඟ එක්ව වාසය කිරීමට සතුටු වෙතිද, ඔහුට ශ්‍රවණයෙන්ද යහපතක් සිදු වී ඇත, බහුශ්‍රැතභාවයෙන්ද යහපතක් සිදු වී ඇත, දෘෂ්ටියෙන්ද අවබෝධයක් ලැබී ඇත, තාවකාලික වූ විමුක්තියද ලබයිද, ආනන්දය, මේ පුද්ගලයා අර පෙර කී පුද්ගලයාට වඩා අභික්ක්‍රාන්තතර (ඉතා උසස්) සහ ප්‍රණීතතර (ඉතා ප්‍රණීත) කෙනෙක් වෙයි. එයට හේතුව කුමක්ද? ආනන්දය, මේ පුද්ගලයා ධර්ම ප්‍රවාහය විසින් ගෙන යනු ලබයි. එය අතරමැද ඇති වෙනස තථාගතයන් වහන්සේ හැර වෙන කවරෙක් නම් දන්නේද? එබැවින් ආනන්දය, පුද්ගලයන් සම්බන්ධයෙන් මැන බලන්නෝ (සසඳන්නෝ) නොවන්න. පුද්ගලයන් සම්බන්ධයෙන් මැනීම් (සසඳා බැලීම්) නොකරන්න.\n\nආනන්දය, පුද්ගලයන් මනින්නට (තක්සේරු කරන්නට) යාම වැරදියි. ආනන්දය, පුද්ගලයන් මනින්නට පුළුවන් මට හෝ මට සමාන කෙනෙකුට පමණයි.\n\nආනන්දය, මේ ශාසනයෙහි සමහර පුද්ගලයන්ට ක්‍රෝධය හා මානය පහව ගොස් නැත, විටින් විට ඔවුන්ට ලෝභ ස්වභාවයන්ද ඇති වේ. ඔහුට ශ්‍රවණයද (ධර්මය ඇසීමද) ඵල සහිත වී නැත, බහුශ්‍රැතභාවයද (බොහෝ සේ ධර්මය ඉගෙනීමද) ඵල සහිත වී නැත, දෘෂ්ටියෙන්ද (ප්‍රඥාවෙන්ද) ධර්මය අවබෝධ කරගෙන නැත, තාවකාලික විමුක්තියද (සමාධියෙන් ලැබෙන විමුක්තියද) නොලබයි. හේ කාය භේදයෙන්, මරණින් මතු හානිය පිණිස යයි, උසස් බව පිණිස නොවේ, හානිය කරාම යන්නෙක් වේ, උසස් බව කරා යන්නෙක් නොවේ.\n\nආනන්දය, මේ ශාසනයෙහි සමහර පුද්ගලයන්ට ක්‍රෝධය හා මානය පහව ගොස් නැත, විටින් විට ඔවුන්ට ලෝභ ස්වභාවයන්ද ඇති වේ. එහෙත් ඔහුට ශ්‍රවණයද ඵල සහිත වී ඇත, බහුශ්‍රැතභාවයද ඵල සහිත වී ඇත, දෘෂ්ටියෙන්ද ධර්මය අවබෝධ කරගෙන ඇත, තාවකාලික විමුක්තියද ලබයි. හේ කාය භේදයෙන්, මරණින් මතු උසස් බව පිණිස යයි, හානිය පිණිස නොවේ, උසස් බව කරාම යන්නෙක් වේ, හානිය කරා යන්නෙක් නොවේ.\n\nආනන්දය, එහිදී පුද්ගලයන් මනින්නට (තක්සේරු කරන්නට) යන අය මනින්නට (තක්සේරු කරන්නට) යති. ආනන්දය, පුද්ගලයන් මනින්නට යාම වැරදියි. ආනන්දය, පුද්ගලයන් මනින්නට පුළුවන් මට හෝ මට සමාන කෙනෙකුට පමණයි.\n\nආනන්දය, මේ ශාසනයෙහි සමහර පුද්ගලයන්ට ක්‍රෝධය හා මානය පහව ගොස් නැත, විටින් විට ඔවුන්ට වචී සංස්කාරයන්ද (අකුසල කථා ආදියට හේතුවන චේතනාද) ඇති වේ. ඔහුට ශ්‍රවණයද ඵල සහිත වී නැත, බහුශ්‍රැතභාවයද ඵල සහිත වී නැත, දෘෂ්ටියෙන්ද ධර්මය අවබෝධ කරගෙන නැත, තාවකාලික විමුක්තියද නොලබයි. හේ කාය භේදයෙන්, මරණින් මතු හානිය පිණිස යයි, උසස් බව පිණිස නොවේ, හානිය කරාම යන්නෙක් වේ, උසස් බව කරා යන්නෙක් නොවේ.\n\nආනන්දය, මේ ශාසනයෙහි සමහර පුද්ගලයන්ට ක්‍රෝධය හා මානය පහව ගොස් නැත, විටින් විට ඔවුන්ට වචී සංස්කාරයන්ද ඇති වේ. එහෙත් ඔහුට ශ්‍රවණයද ඵල සහිත වී ඇත, බහුශ්‍රැතභාවයද ඵල සහිත වී ඇත, දෘෂ්ටියෙන්ද ධර්මය අවබෝධ කරගෙන ඇත, තාවකාලික විමුක්තියද ලබයි. හේ කාය භේදයෙන්, මරණින් මතු උසස් බව පිණිස යයි, හානිය පිණිස නොවේ, උසස් බව කරාම යන්නෙක් වේ, හානිය කරා යන්නෙක් නොවේ.\n\nආනන්දය, එහිදී පුද්ගලයන් මනින්නට (තක්සේරු කරන්නට) යන අය මෙසේ සිතති: ‘මේ පුද්ගලයාටත් ඒ ධර්මයන්ම (ක්‍රෝධ, මාන, වචී සංස්කාර) ඇත, අනිත් පුද්ගලයාටත් ඒ ධර්මයන්ම ඇත. කෙසේ නම් ඒ දෙදෙනාගෙන් එක් අයෙක් පහත් වන්නේද, එක් අයෙක් උසස් වන්නේද?’ ආනන්දය, එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත් දුක පිණිසත් වන්නේය.\n\nආනන්දය, යම් පුද්ගලයෙකුට ක්‍රෝධය හා මානය පහව ගොස් නැති අතර, විටින් විට වචී සංස්කාරයන්ද ඇති වේ නම්, නමුත් ඔහුට ශ්‍රවණයද ඵල සහිත වී ඇත, බහුශ්‍රැතභාවයද ඵල සහිත වී ඇත, දෘෂ්ටියෙන්ද ධර්මය අවබෝධ කරගෙන ඇත, තාවකාලික විමුක්තියද ලබයි නම්; ආනන්දය, මේ පුද්ගලයා පෙර කී පුද්ගලයාට වඩා උසස්ය, ප්‍රණීතය. එයට හේතුව කුමක්ද? ආනන්දය, මේ පුද්ගලයා ධර්ම ප්‍රවාහය විසින් ගෙන යනු ලබයි. ඒ අභ්‍යන්තර වෙනස තථාගතයන් වහන්සේ හැර වෙන කවරෙක් නම් දන්නේද! එබැවින් ආනන්දය, ඔබලා පුද්ගලයන් මනින්නට යන අය නොවන්න; පුද්ගලයන් මනින්නට නොයන්න. ආනන්දය, පුද්ගලයන් මනින්නට යාම වැරදියි. ආනන්දය, පුද්ගලයන් මනින්නට පුළුවන් මට හෝ මට සමාන කෙනෙකුට පමණයි.\n\nආනන්දය, මිගසාලා උපාසිකාව යනු බාල, නුපුහුණු, අදක්ෂ, දරුවන් මෙන් සිතන තැනැත්තියක් පමණි; පුද්ගලයන්ගේ උසස් පහත් බව දැනීමේ ඥානය ඇය කෙරෙහි කවරේද! ආනන්දය, සැබවින්ම මේ පුද්ගලයන් සදෙන ලෝකයෙහි සිටිති, ජීවත්ව සිටිති.\n\nආනන්දය, පුරාණ (නම් භික්ෂුව) කවර ආකාරයක සීලයකින් යුක්ත වූයේද, ඉසිදත්තද එවැනිම සීලයකින් යුක්ත වන්නට ඉඩ තිබුණි. (එහෙත්) පුරාණට මෙහිදී ඉසිදත්තගේ ගතිය (අවබෝධය) දැනගත නොහැකි විය. ආනන්දය, ඉසිදත්ත කවර ආකාරයක ප්‍රඥාවකින් යුක්ත වූයේද, පුරාණද එවැනිම ප්‍රඥාවකින් යුක්ත වන්නට ඉඩ තිබුණි. (එහෙත්) ඉසිදත්තට මෙහිදී පුරාණගේ ගතිය (අවබෝධය) දැනගත නොහැකි විය. මෙසේ ආනන්දය, මේ පුද්ගලයන් දෙදෙනාම එක් අංගයකින් හීන වූවෝ වෙති.\n\n(දෙවැනි කොටස නිමි.)",
      "paliTitle": "Migasālāsuttaṃ",
      "englishTitle": "Migasālā Sutta",
      "sinhalaTitle": "මිගසාලා සූත‍්‍රය"
    },
    {
      "number": 45,
      "pali": "‘‘Dāliddiyaṃ [dāḷiddiyaṃ (sī.)], bhikkhave, dukkhaṃ lokasmiṃ kāmabhogino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yampi, bhikkhave, daliddo [daḷiddo (sī.)] assako anāḷhiko [anaddhiko (syā. kaṃ.)] iṇaṃ ādiyati, iṇādānampi, bhikkhave, dukkhaṃ lokasmiṃ kāmabhogino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yampi, bhikkhave, daliddo assako anāḷhiko iṇaṃ ādiyitvā vaḍḍhiṃ paṭissuṇāti, vaḍḍhipi, bhikkhave, dukkhā lokasmiṃ kāmabhogino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yampi, bhikkhave, daliddo assako anāḷhiko vaḍḍhiṃ paṭissuṇitvā kālābhataṃ [kālagataṃ (ka.)] vaḍḍhiṃ na deti, codentipi naṃ; codanāpi, bhikkhave, dukkhā lokasmiṃ kāmabhogino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yampi, bhikkhave, daliddo assako anāḷhiko codiyamāno na deti, anucarantipi naṃ; anucariyāpi, bhikkhave, dukkhā lokasmiṃ kāmabhogino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yampi, bhikkhave, daliddo assako anāḷhiko anucariyamāno na deti, bandhantipi naṃ; bandhanampi, bhikkhave, dukkhaṃ lokasmiṃ kāmabhogino’’ti? ‘‘Evaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dāliddiyampi dukkhaṃ lokasmiṃ kāmabhogino, iṇādānampi dukkhaṃ lokasmiṃ kāmabhogino, vaḍḍhipi dukkhā lokasmiṃ kāmabhogino, codanāpi dukkhā lokasmiṃ kāmabhogino, anucariyāpi dukkhā lokasmiṃ kāmabhogino, bandhanampi dukkhaṃ lokasmiṃ kāmabhogino; evamevaṃ kho, bhikkhave, yassa kassaci saddhā natthi kusalesu dhammesu, hirī natthi kusalesu dhammesu, ottappaṃ natthi kusalesu dhammesu, vīriyaṃ natthi kusalesu dhammesu, paññā natthi kusalesu dhammesu – ayaṃ vuccati, bhikkhave, ariyassa vinaye daliddo assako anāḷhiko. ‘‘Sa kho so, bhikkhave, daliddo assako anāḷhiko saddhāya asati kusalesu dhammesu, hiriyā asati kusalesu dhammesu, ottappe asati kusalesu dhammesu, vīriye asati kusalesu dhammesu, paññāya asati kusalesu dhammesu, kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. Idamassa iṇādānasmiṃ vadāmi. ‘‘So tassa kāyaduccaritassa paṭicchādanahetu pāpikaṃ icchaṃ paṇidahati [padahati (ka.)]. ‘Mā maṃ jaññū’ti icchati, ‘mā maṃ jaññū’ti saṅkappati, ‘mā maṃ jaññū’ti vācaṃ bhāsati, ‘mā maṃ jaññū’ti kāyena parakkamati. So tassa vacīduccaritassa paṭicchādanahetu…pe… so tassa manoduccaritassa paṭicchādanahetu…pe… ‘mā maṃ jaññū’ti kāyena parakkamati. Idamassa vaḍḍhiyā vadāmi. ‘‘Tamenaṃ pesalā sabrahmacārī evamāhaṃsu – ‘ayañca so āyasmā evaṃkārī evaṃsamācāro’ti. Idamassa codanāya vadāmi. ‘‘Tamenaṃ araññagataṃ vā rukkhamūlagataṃ vā suññāgāragataṃ vā vippaṭisārasahagatā pāpakā akusalavitakkā samudācaranti. Idamassa anucariyāya vadāmi. ‘‘Sa kho so, bhikkhave, daliddo assako anāḷhiko kāyena duccaritaṃ caritvā vācāya duccaritaṃ caritvā manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā nirayabandhane vā bajjhati tiracchānayonibandhane vā. Nāhaṃ, bhikkhave, aññaṃ ekabandhanampi samanupassāmi evaṃdāruṇaṃ evaṃkaṭukaṃ [evaṃdukkhaṃ (syā. kaṃ. ka.)] evaṃantarāyakaraṃ anuttarassa yogakkhemassa adhigamāya, yathayidaṃ, bhikkhave, nirayabandhanaṃ vā tiracchānayonibandhanaṃ vā’’ti. ‘‘Dāliddiyaṃ dukkhaṃ loke, iṇādānañca vuccati; Daliddo iṇamādāya, bhuñjamāno vihaññati. ‘‘Tato anucaranti naṃ, bandhanampi nigacchati; Etañhi bandhanaṃ dukkhaṃ, kāmalābhābhijappinaṃ. ‘‘Tatheva ariyavinaye, saddhā yassa na vijjati; Ahirīko anottappī, pāpakammavinibbayo. ‘‘Kāyaduccaritaṃ katvā, vacīduccaritāni ca; Manoduccaritaṃ katvā, ‘mā maṃ jaññū’ti icchati. ‘‘So saṃsappati [saṅkappati (ka.)] kāyena, vācāya uda cetasā; Pāpakammaṃ pavaḍḍhento, tattha tattha punappunaṃ. ‘‘So pāpakammo dummedho, jānaṃ dukkaṭamattano; Daliddo iṇamādāya, bhuñjamāno vihaññati. ‘‘Tato anucaranti naṃ, saṅkappā mānasā dukhā; Gāme vā yadi vāraññe, yassa vippaṭisārajā. ‘‘So pāpakammo dummedho, jānaṃ dukkaṭamattano; Yonimaññataraṃ gantvā, niraye vāpi bajjhati. ‘‘Etañhi bandhanaṃ dukkhaṃ, yamhā dhīro pamuccati; Dhammaladdhehi bhogehi, dadaṃ cittaṃ pasādayaṃ. ‘‘Ubhayattha kaṭaggāho, saddhassa gharamesino; Diṭṭhadhammahitatthāya, samparāyasukhāya ca; Evametaṃ gahaṭṭhānaṃ, cāgo puññaṃ pavaḍḍhati. ‘‘Tatheva ariyavinaye, saddhā yassa patiṭṭhitā; Hirīmano ca ottappī, paññavā sīlasaṃvuto. ‘‘Eso kho ariyavinaye, ‘sukhajīvī’ti vuccati; Nirāmisaṃ sukhaṃ laddhā, upekkhaṃ adhitiṭṭhati. ‘‘Pañca nīvaraṇe hitvā, niccaṃ āraddhavīriyo; Jhānāni upasampajja, ekodi nipako sato. ‘‘Evaṃ ñatvā yathābhūtaṃ, sabbasaṃyojanakkhaye; Sabbaso anupādāya, sammā cittaṃ vimuccati. ‘‘Tassa sammā vimuttassa, ñāṇaṃ ce hoti tādino; ‘Akuppā me vimuttī’ti, bhavasaṃyojanakkhaye. ‘‘Etaṃ kho paramaṃ ñāṇaṃ, etaṃ sukhamanuttaraṃ; Asokaṃ virajaṃ khemaṃ, etaṃ ānaṇyamuttama’’nti. tatiyaṃ;",
      "english": "“Is poverty, monks, suffering in the world for those who enjoy sensual pleasures?” “Yes, venerable sir.” “And furthermore, monks, when a poor person, without property, without means, takes on a debt, taking on debt, too, monks, is suffering in the world for those who enjoy sensual pleasures.” “Yes, venerable sir.” “And furthermore, monks, when a poor person, without property, without means, having taken on a debt, agrees to interest, interest, too, monks, is suffering in the world for those who enjoy sensual pleasures.” “Yes, venerable sir.” “And furthermore, monks, when a poor person, without property, without means, having agreed to interest, does not pay the interest when it is due, they pursue him; pursuit, too, monks, is suffering in the world for those who enjoy sensual pleasures.” “Yes, venerable sir.” “And furthermore, monks, when a poor person, without property, without means, being pursued, does not pay, they follow after him; being followed after, too, monks, is suffering in the world for those who enjoy sensual pleasures.” “Yes, venerable sir.” “And furthermore, monks, when a poor person, without property, without means, being followed after, does not pay, they bind him; being bound, too, monks, is suffering in the world for those who enjoy sensual pleasures.” “Yes, venerable sir.”\n\nThus, monks, poverty is suffering in the world for those who enjoy sensual pleasures; taking on debt is suffering in the world for those who enjoy sensual pleasures; interest is suffering in the world for those who enjoy sensual pleasures; being pursued is suffering in the world for those who enjoy sensual pleasures; being followed after is suffering in the world for those who enjoy sensual pleasures; being bound is suffering in the world for those who enjoy sensual pleasures. In the same way, monks, whoever has no faith in wholesome qualities, no moral shame in wholesome qualities, no moral dread in wholesome qualities, no energy in wholesome qualities, no wisdom in wholesome qualities—such a one, monks, is called \"poor, without property, without means\" in the Noble Discipline.\n\nThat poor person, monks, without property, without means, being without faith in wholesome qualities, without moral shame in wholesome qualities, without moral dread in wholesome qualities, without energy in wholesome qualities, and without wisdom in wholesome qualities, acts wrongly by body, acts wrongly by speech, and acts wrongly by mind. This I say is like taking on debt for him.\n\nBecause of concealing that bodily misconduct, he forms an evil wish: he wishes ‘Let no one know me!’, he resolves ‘Let no one know me!’, he speaks ‘Let no one know me!’, and he strives with his body so ‘Let no one know me!’. Because of concealing that verbal misconduct, he forms an evil wish: he wishes ‘Let no one know me!’, he resolves ‘Let no one know me!’, he speaks ‘Let no one know me!’, and he strives with his body so ‘Let no one know me!’. Because of concealing that mental misconduct, he forms an evil wish: he wishes ‘Let no one know me!’, he resolves ‘Let no one know me!’, he speaks ‘Let no one know me!’, and he strives with his body so ‘Let no one know me!’. This I say is like the interest for him.\n\nThen his virtuous fellow celibates speak of him thus: ‘This venerable one acts in such a way, behaves in such a way.’ This I say is like the pursuit for him.\n\nWhether he has gone to a forest, or to the root of a tree, or to an empty dwelling, evil unwholesome thoughts accompanied by remorse assail him. This I say is like being followed after for him.\n\nThat poor person, monks, without property, without means, having acted wrongly by body, acted wrongly by speech, and acted wrongly by mind, upon the breakup of the body, after death, is bound in the fetters of hell or in the fetters of the animal realm. I do not, monks, see any other single bondage so cruel, so bitter, so obstructive to the attainment of the unsurpassed security from bondage, as these, monks, the fetters of hell or the fetters of the animal realm.\n\nPoverty is suffering in the world,\nAnd taking on debt is also called suffering.\nA poor person, taking on debt,\nSuffers as he consumes.\n\nThen they follow after him,\nAnd he also incurs bondage.\nThis indeed is suffering, this bondage\nFor those who yearn for sensual gains.\n\nSimilarly, in the Noble Discipline,\nOne who has no faith,\nWithout moral shame and without moral dread,\nIs given over to unwholesome actions.\n\nHaving done wrong by body,\nAnd wrong by speech,\nHaving done wrong by mind,\nHe wishes: ‘Let no one know me!’\n\nHe creeps with his body,\nOr with speech, or with mind,\nIncreasing his unwholesome actions\nAgain and again here and there.\n\nThat evil-doer, foolish\nAnd knowing his own misdeeds,\nIs like a poor person who has taken on debt\nAnd suffers while consuming.\n\nThen mental intentions of suffering\nFollow after him, born of remorse,\nWhether he is in a village or in the wilderness.\n\nThat evil-doer, foolish\nAnd knowing his own misdeeds,\nHaving gone to one or another of the realms,\nIs bound even in hell.\n\nThis indeed is suffering, this bondage\nFrom which the wise one is freed;\nBy giving from wealth righteously obtained,\nHe gladdens his mind.\n\nBoth for the benefit of this life\nAnd for the happiness of the next,\nThere is a strong adherence for the faithful householder;\nThus, for householders, generosity increases merit.\n\nSimilarly, in the Noble Discipline,\nOne whose faith is established,\nWho is endowed with moral shame and moral dread,\nWho is wise, and restrained by virtue.\n\nSuch a one is called 'one who lives happily' in the Noble Discipline; having attained unworldly happiness, he stands firm in equanimity.\n\nHaving abandoned the five hindrances, constantly energetic, having entered the absorptions, unified in mind, sagacious, and mindful.\n\nThus, by knowing things as they truly are, with the destruction of all fetters, and without clinging to anything whatsoever, the mind is rightly liberated.\n\nFor such a rightly liberated one, there arises the knowledge: 'My liberation is unshakeable,' upon the destruction of the fetters of existence.\n\nThis indeed is the supreme knowledge, this is unsurpassed happiness; this is sorrowless, stainless, secure, this is the supreme freedom from spiritual debt.",
      "sinhala": "‘‘භික්‍ෂූනි, ලෝකයේ කාමභෝගී පුද්ගලයාට දරිද්‍රතාව දුකක් නොවේද?’’ ‘‘එසේය, ස්වාමීනි.’’ ‘‘භික්‍ෂූනි, එපමණක් නොව, දරිද්‍ර, අයිතිකරුවෙක් නැති, ධනයක් නැති පුද්ගලයා ණයක් ගනී. ණය ගැනීමද, භික්‍ෂූනි, ලෝකයේ කාමභෝගී පුද්ගලයාට දුකකි.’’ ‘‘එසේය, ස්වාමීනි.’’ ‘‘භික්‍ෂූනි, එපමණක් නොව, දරිද්‍ර, අයිතිකරුවෙක් නැති, ධනයක් නැති පුද්ගලයා ණයක් ගෙන පොලියට එකඟ වෙයි. පොලියද, භික්‍ෂූනි, ලෝකයේ කාමභෝගී පුද්ගලයාට දුකකි.’’ ‘‘එසේය, ස්වාමීනි.’’ ‘‘භික්‍ෂූනි, එපමණක් නොව, දරිද්‍ර, අයිතිකරුවෙක් නැති, ධනයක් නැති පුද්ගලයා පොලියට එකඟ වී නියමිත කාලයට පොලිය නොගෙවයි, එවිට ඔහුව දෝෂාරෝපණය කරනු ලැබේ. දෝෂාරෝපණයද, භික්‍ෂූනි, ලෝකයේ කාමභෝගී පුද්ගලයාට දුකකි.’’ ‘‘එසේය, ස්වාමීනි.’’ ‘‘භික්‍ෂූනි, එපමණක් නොව, දරිද්‍ර, අයිතිකරුවෙක් නැති, ධනයක් නැති පුද්ගලයා දෝෂාරෝපණය කරනු ලැබුවද නොගෙවයි, එවිට ඔහුව පසුපස හඹා යනු ලැබේ. පසුපස හඹා යෑමද, භික්‍ෂූනි, ලෝකයේ කාමභෝගී පුද්ගලයාට දුකකි.’’ ‘‘එසේය, ස්වාමීනි.’’ ‘‘භික්‍ෂූනි, එපමණක් නොව, දරිද්‍ර, අයිතිකරුවෙක් නැති, ධනයක් නැති පුද්ගලයා පසුපස හඹා යනු ලැබුවද නොගෙවයි, එවිට ඔහුව බඳිනු ලැබේ. බන්ධනයද, භික්‍ෂූනි, ලෝකයේ කාමභෝගී පුද්ගලයාට දුකකි.’’ ‘‘එසේය, ස්වාමීනි.’’ ‘‘භික්‍ෂූනි, මෙලෙසින්ම ලෝකයේ කාමභෝගී පුද්ගලයාට දරිද්‍රතාවද දුකකි, ණය ගැනීමද දුකකි, පොලියද දුකකි, දෝෂාරෝපණයද දුකකි, පසුපස හඹා යෑමද දුකකි, බන්ධනයද දුකකි. භික්‍ෂූනි, එලෙසින්ම යමෙකුට කුසල් දහම් කෙරෙහි ශ්‍රද්ධා නැතිද, කුසල් දහම් කෙරෙහි හිරි නැතිද, කුසල් දහම් කෙරෙහි ඔත්තප්ප නැතිද, කුසල් දහම් කෙරෙහි වීර්ය නැතිද, කුසල් දහම් කෙරෙහි ප්‍රඥා නැතිද – භික්‍ෂූනි, ආර්ය විනයෙහි මොහු 'දරිද්‍ර, අයිතිකරුවෙක් නැති, ධනයක් නැති පුද්ගලයා' යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, කුසල් දහම් කෙරෙහි ශ්‍රද්ධා නැති, කුසල් දහම් කෙරෙහි හිරි නැති, කුසල් දහම් කෙරෙහි ඔත්තප්ප නැති, කුසල් දහම් කෙරෙහි වීර්ය නැති, කුසල් දහම් කෙරෙහි ප්‍රඥා නැති ඒ දරිද්‍ර, අයිතිකරුවෙක් නැති, ධනයක් නැති පුද්ගලයා කයින් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. මෙය ඔහුගේ ණය ගැනීම යැයි මම කියමි.\n\nඔහු තමන්ගේ කාය දුශ්චරිතය වසා ගැනීම පිණිස නපුරු පැතුම් ඇතිකර ගනියි. ‘මා කිසිවෙක් නොදැනේවා’ යැයි පතයි, ‘මා කිසිවෙක් නොදැනේවා’ යැයි සිතයි, ‘මා කිසිවෙක් නොදැනේවා’ යැයි වචන කියයි, ‘මා කිසිවෙක් නොදැනේවා’ යැයි කයින් ක්‍රියා කරයි. ඔහු තමන්ගේ වචී දුශ්චරිතය වසා ගැනීම පිණිස...පෙ... ඔහු තමන්ගේ මනෝ දුශ්චරිතය වසා ගැනීම පිණිස...පෙ... ‘මා කිසිවෙක් නොදැනේවා’ යැයි කයින් ක්‍රියා කරයි. මෙය ඔහුගේ පොලිය යැයි මම කියමි.\n\nඒ මොහුට යහපත් ගති ඇති සබ්‍රහ්මචාරීන් මෙසේ කියති – ‘මේ ආයුෂ්මත් මෙබඳු ක්‍රියා ඇති, මෙබඳු හැසිරීම් ඇති පුද්ගලයෙකි’ කියා. මෙය ඔහුගේ දෝෂාරෝපණය යැයි මම කියමි.\n\nඒ මොහුට අරණ්‍යයකට ගිය කලද, ගස්මුලකට ගිය කලද, හිස් ගෙයකට ගිය කලද, පසුතැවිලි සහිත නපුරු අකුසල් විතර්ක ඇතිවෙයි. මෙය ඔහුගේ පසුපස හඹා යෑම යැයි මම කියමි.\n\nභික්‍ෂූනි, ඒ දරිද්‍ර, අයිතිකරුවෙක් නැති, ධනයක් නැති පුද්ගලයා කයින් දුසිරිත් කර, වචනයෙන් දුසිරිත් කර, සිතින් දුසිරිත් කර, ශරීරය බිඳී මරණයෙන් පසු නිරය බන්ධනයෙහි හෝ තිරිසන් යෝනි බන්ධනයෙහි හෝ බැඳෙයි. භික්‍ෂූනි, මේ නිරය බන්ධනයට හෝ තිරිසන් යෝනි බන්ධනයට හෝ වඩා එලෙස දරුණු, එලෙස කටුක, අනුත්තර වූ යෝගක්‍ෂේමය අවබෝධ කර ගැනීමට එලෙස අන්තරායකර වූ වෙන එකම බන්ධනයක්වත් මම නොදකිමි.\n\nලෝකයේ දරිද්‍රතාව දුකකි, ණය ගැනීමද දුකක් යැයි කියනු ලැබේ;\nදරිද්‍ර පුද්ගලයා ණයක් ගෙන, එය භුක්ති විඳිමින් පීඩාවට පත්වෙයි.\nඑවිට ඔහුව පසුපස හඹා යනු ලැබේ, බන්ධනයටද පත්වෙයි;\nකාම සැප ලැබීම අපේක්‍ෂා කරන අයට මේ බන්ධනය දුකකි.\nඑලෙසින්ම ආර්ය විනයෙහි යමෙකුට ශ්‍රද්ධා නැතිද;\nඔහු හිරි නැති, ඔත්තප්ප නැති, පාපකර්මයන්ට බැඳුණු අයෙකි.\nකාය දුශ්චරිතයද, වචී දුශ්චරිතයන්ද, මනෝ දුශ්චරිතයද කර, ‘මා කිසිවෙක් නොදැනේවා’ යැයි පතයි.\nඔහු කයින් හෝ වචනයෙන් හෝ සිතින් හෝ රිංගා යයි;\nඑතැන එතැන නැවත නැවතත් පාපකර්ම වර්ධනය කරමින්.\nඒ පාපකර්ම ඇති, දුර්මති පුද්ගලයා, තමන්ගේ අයහපත් ක්‍රියාව දැන දැනත්,\nණය ගත් දරිද්‍රයෙකු මෙන්, එය භුක්ති විඳිමින් පීඩාවට පත්වෙයි.\nඑවිට ඔහුව, පසුතැවීමෙන් හටගත්, දුක්ඛිත මානසික සංකල්පයන් පසුපස හඹා යනු ලැබේ;\nගමෙහි හෝ අරණ්‍යයෙහි හෝ වේවා, යමෙකුට පසුතැවීම හටගන්නේද.\nඒ පාපකර්ම ඇති, දුර්මති පුද්ගලයා, තමන්ගේ අයහපත් ක්‍රියාව දැන දැනත්,\nයම් කිසි යෝනියකට ගොස්, නිරයෙහිද බැඳෙයි.\nමේ බන්ධනය දුකකි, එයින් ධීරයා (නුවණැත්තා) මිදෙයි;\nධර්මයෙන් ලැබූ භෝගයන්ගෙන් දන් දෙමින් සිත පහදවා ගනිමින්.\nශ්‍රද්ධාවන්ත ගිහියාට දෙලොවම යහපති;\nමේ ආත්මයේ හිත සුව පිණිසත්, පරලොව සුව පිණිසත්;\nමෙලෙසින් ගෘහස්ථයන්ගේ පරිත්‍යාගය පින වඩවයි.\nඑලෙසින්ම ආර්ය විනයෙහි යමෙකුට ශ්‍රද්ධා පිහිටා තිබේ නම්;\nඔහු හිරි ඇති, ඔත්තප්ප ඇති, ප්‍රඥාවන්ත, සිල් රැකි අයෙකි.\n\nමොහු ආර‍්‍ය විනයෙහි, 'සුවසේ ජීවත්වන්නා' යැයි කියනු ලැබේ. නිරාමිස සුවය ලබා, උපේක්ෂාවෙහි පිහිටා සිටී.\n\nපංච නීවරණ දුරුකොට, නිරන්තරයෙන් වීර‍්‍යය ආරම්භ කළ, ධ‍්යාන උපදවාගෙන, ඒකාග‍්‍ර සිත් ඇත්තෙක්, ඤාණවන්තයෙක්, සිහි ඇත්තෙක් බවට පත්වෙයි.\n\nමෙසේ ඇත්ත ඇති සැටියෙන් දැන, සියලු සංයෝජන ක්ෂය වීමෙන්, සියලු අයුරින් උපාදාන රහිතව, සිත මනා කොට විමුක්ත වෙයි.\n\nමනා කොට විමුක්ත වූ ඒ ස්ථීර ස්වභාවයෙන් යුත් පුද්ගලයාට, 'මාගේ විමුක්තිය නොසෙල්වෙන්නීය' යැයි භව සංයෝජන ක්ෂය වීමෙන් ඤාණය ඇති වෙයි.\n\nමෙය නියත වශයෙන්ම පරම ඤාණයයි. මෙය අතිශයින් උතුම් සුවයකි. ශෝක රහිත වූ, කෙලෙස් රහිත වූ, ක්ෂේම වූ (තත්ත්වයකි). මෙය උතුම්ම ණය නැති බවයි.",
      "paliTitle": "Iṇasuttaṃ",
      "englishTitle": "The Discourse on Debt",
      "sinhalaTitle": "ණය සූත්‍රය"
    },
    {
      "number": 46,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā mahācundo cetīsu viharati sayaṃjātiyaṃ [sahajātiyaṃ (sī. pī.), sañjātiyaṃ (syā. kaṃ.)]. Tatra kho āyasmā mahācundo bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahācundassa paccassosuṃ. Āyasmā mahācundo etadavoca – ‘‘Idhāvuso, dhammayogā bhikkhū jhāyī bhikkhū apasādenti – ‘ime pana jhāyinomhā, jhāyinomhāti jhāyanti pajjhāyanti nijjhāyanti avajjhāyanti [apajjhāyanti (ma. ni. 1.508)]. Kimime [kiṃ hime (sī. syā. kaṃ. pī.)] jhāyanti, kintime jhāyanti, kathaṃ ime jhāyantī’ti? Tattha dhammayogā ca bhikkhū nappasīdanti, jhāyī ca bhikkhū nappasīdanti, na ca bahujanahitāya paṭipannā honti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. ‘‘Idha panāvuso, jhāyī bhikkhū dhammayoge bhikkhū apasādenti – ‘ime pana dhammayogamhā, dhammayogamhāti uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatī asampajānā asamāhitā vibbhantacittā pākatindriyā. Kimime dhammayogā, kintime dhammayogā, kathaṃ ime dhammayogā’ti? Tattha jhāyī ca bhikkhū nappasīdanti, dhammayogā ca bhikkhū nappasīdanti, na ca bahujanahitāya paṭipannā honti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. ‘‘Idha panāvuso, dhammayogā bhikkhū dhammayogānaññeva bhikkhūnaṃ vaṇṇaṃ bhāsanti, no jhāyīnaṃ bhikkhūnaṃ vaṇṇaṃ bhāsanti. Tattha dhammayogā ca bhikkhū nappasīdanti, jhāyī ca bhikkhū nappasīdanti, na ca bahujanahitāya paṭipannā honti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. ‘‘Idha panāvuso, jhāyī bhikkhū jhāyīnaññeva bhikkhūnaṃ vaṇṇaṃ bhāsanti, no dhammayogānaṃ bhikkhūnaṃ vaṇṇaṃ bhāsanti. Tattha jhāyī ca bhikkhū nappasīdanti, dhammayogā ca bhikkhū nappasīdanti, na ca bahujanahitāya paṭipannā honti bahujanasukhāya bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. ‘‘Tasmātihāvuso, evaṃ sikkhitabbaṃ – ‘dhammayogā samānā jhāyīnaṃ bhikkhūnaṃ vaṇṇaṃ bhāsissāmā’ti. Evañhi vo, āvuso, sikkhitabbaṃ. Taṃ kissa hetu? Acchariyā hete, āvuso, puggalā dullabhā lokasmiṃ, ye amataṃ dhātuṃ kāyena phusitvā viharanti. Tasmātihāvuso, evaṃ sikkhitabbaṃ – ‘jhāyī samānā dhammayogānaṃ bhikkhūnaṃ vaṇṇaṃ bhāsissāmā’ti. Evañhi vo, āvuso, sikkhitabbaṃ. Taṃ kissa hetu? Acchariyā hete, āvuso, puggalā dullabhā lokasmiṃ ye gambhīraṃ atthapadaṃ paññāya ativijjha passantī’’ti. Catutthaṃ.",
      "english": "Thus have I heard. On one occasion, the Venerable Mahācunda was dwelling among the Cetis at Sayaṃjātiya. Thereupon, the Venerable Mahācunda addressed the monks, saying, “Friends, monks.” “Friend,” those monks replied to the Venerable Mahācunda. The Venerable Mahācunda spoke thus:\n\n“Here, friends, Dhamma-devoted monks criticize meditating monks, saying, ‘These meditators, claiming ‘we are meditators, we are meditators,’ simply brood, ponder, observe, and muse. What are they meditating on? What kind of meditation is this? How are they meditating?’ In such a case, the Dhamma-devoted monks are not pleased, and the meditating monks are not pleased, nor do they practice for the welfare of the many, for the happiness of the many, for the benefit, welfare, and happiness of many people, of gods and humans.\n\n“But here, friends, meditating monks criticize Dhamma-devoted monks, saying, ‘These Dhamma-devoted ones, claiming ‘we are Dhamma-devoted, we are Dhamma-devoted,’ are arrogant, impudent, fickle, garrulous, with scattered speech, unmindful, undiscerning, unconcentrated, with distracted minds, and with uncontrolled senses. What are these Dhamma-devoted ones doing? What kind of Dhamma-devotion is this? How are they Dhamma-devoted?’ In such a case, the meditating monks are not pleased, and the Dhamma-devoted monks are not pleased, nor do they practice for the welfare of the many, for the happiness of the many, for the benefit, welfare, and happiness of many people, of gods and humans.\n\n“But here, friends, Dhamma-devoted monks praise only Dhamma-devoted monks, and do not praise meditating monks. In such a case, the Dhamma-devoted monks are not pleased, and the meditating monks are not pleased, nor do they practice for the welfare of the many, for the happiness of the many, for the benefit, welfare, and happiness of many people, of gods and humans.\n\n“But here, friends, meditating monks praise only meditating monks, and do not praise Dhamma-devoted monks. In such a case, the meditating monks are not pleased, and the Dhamma-devoted monks are not pleased, nor do they practice for the welfare of the many, for the happiness of the many, for the benefit, welfare, and happiness of many people, of gods and humans.\n\n“Therefore, friends, this is how you should train: ‘Being Dhamma-devoted, we will praise meditating monks.’ Indeed, friends, this is how you should train. And why is that? These are truly rare and wonderful individuals in the world, friends, who dwell having directly experienced the Deathless element. Therefore, friends, this is how you should train: ‘Being meditators, we will praise Dhamma-devoted monks.’ Indeed, friends, this is how you should train. And why is that? These are truly rare and wonderful individuals in the world, friends, who discern with wisdom the profound meaning.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයක ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේ චේතිය රටේ සයංජාති නම් ස්ථානයේ වැඩවසන සේක.\n\nඑහිදී ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"ඇවැත්නි භික්ෂූනි!\" \"ඇවැත්නි!\" කියා ඒ භික්ෂූහු ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක:\n\n\"ඇවැත්නි, මේ ශාසනයෙහි, ධර්මයට යෝගී වූ භික්ෂූහු ධ්‍යාන කරන්නා වූ භික්ෂූන්ට අවමන් කරති. ‘මේ අය ධ්‍යාන කරන්නෝය, ධ්‍යාන කරන්නෝයැයි කියමින්, සිතෙහි ගැලී සිටිති, දැවෙති, ලතැවෙති, පිරිහෙති. මොවුන් කුමක් ධ්‍යාන කරත්ද? මොවුන් කිනම් අයුරින් ධ්‍යාන කරත්ද? මොවුන් කෙසේ ධ්‍යාන කරත්ද?’ යනුවෙන්. එහිදී ධර්මයට යෝගී භික්ෂූහු ද සතුටු නොවෙති, ධ්‍යාන කරන්නා වූ භික්ෂූහු ද සතුටු නොවෙති. තව ද ඔවුහු බොහෝ ජනයාගේ යහපත පිණිස ද, බොහෝ ජනයාගේ සැපය පිණිස ද, බොහෝ ජනයාගේ අර්ථය, හිත හා සැපය පිණිස ද, දෙවි මිනිසුන්ගේ යහපත පිණිස ද පිළිපදින්නෝ නොවෙති.\n\n\"ඇවැත්නි, මෙහි දී, ධ්‍යාන කරන්නා වූ භික්ෂූහු ධර්මයට යෝගී භික්ෂූන්ට අවමන් කරති. ‘මේ අය ධර්මයට යෝගී වූවෝය, ධර්මයට යෝගී වූවෝය’ කියමින්, උද්ධත වූවෝය, නොහික්මුණු වූවෝය, චපල වූවෝය, කටකාර වූවෝය, විසිරුණු වචන ඇති වූවෝය, සිහි නැති වූවෝය, නුවණින් නොසලකන්නා වූවෝය, නොසන්සුන් වූවෝය, මුළා වූ සිත් ඇති වූවෝය, ඉන්ද්‍රියයන්ට වසඟ වූවෝය. මොවුන් කුමන ධර්මයට යෝගී වූවෝද? මොවුන් කෙසේ ධර්මයට යෝගී වූවෝද? මොවුන් කිනම් අයුරින් ධර්මයට යෝගී වූවෝද?’ යනුවෙන්. එහිදී ධ්‍යාන කරන්නා වූ භික්ෂූහු ද සතුටු නොවෙති, ධර්මයට යෝගී භික්ෂූහු ද සතුටු නොවෙති. තව ද ඔවුහු බොහෝ ජනයාගේ යහපත පිණිස ද, බොහෝ ජනයාගේ සැපය පිණිස ද, බොහෝ ජනයාගේ අර්ථය, හිත හා සැපය පිණිස ද, දෙවි මිනිසුන්ගේ යහපත පිණිස ද පිළිපදින්නෝ නොවෙති.\n\n\"ඇවැත්නි, මෙහි දී, ධර්මයට යෝගී භික්ෂූහු ධර්මයට යෝගී භික්ෂූන්ගේ ගුණ ම ප්‍රශංසා කරති. ධ්‍යාන කරන්නා වූ භික්ෂූන්ගේ ගුණ ප්‍රශංසා නොකරති. එහිදී ධර්මයට යෝගී භික්ෂූහු ද සතුටු නොවෙති, ධ්‍යාන කරන්නා වූ භික්ෂූහු ද සතුටු නොවෙති. තව ද ඔවුහු බොහෝ ජනයාගේ යහපත පිණිස ද, බොහෝ ජනයාගේ සැපය පිණිස ද, බොහෝ ජනයාගේ අර්ථය, හිත හා සැපය පිණිස ද, දෙවි මිනිසුන්ගේ යහපත පිණිස ද පිළිපදින්නෝ නොවෙති.\n\n\"ඇවැත්නි, මෙහි දී, ධ්‍යාන කරන්නා වූ භික්ෂූහු ධ්‍යාන කරන්නා වූ භික්ෂූන්ගේ ගුණ ම ප්‍රශංසා කරති. ධර්මයට යෝගී භික්ෂූන්ගේ ගුණ ප්‍රශංසා නොකරති. එහිදී ධ්‍යාන කරන්නා වූ භික්ෂූහු ද සතුටු නොවෙති, ධර්මයට යෝගී භික්ෂූහු ද සතුටු නොවෙති. තව ද ඔවුහු බොහෝ ජනයාගේ යහපත පිණිස ද, බොහෝ ජනයාගේ සැපය පිණිස ද, බොහෝ ජනයාගේ අර්ථය, හිත හා සැපය පිණිස ද, දෙවි මිනිසුන්ගේ යහපත පිණිස ද පිළිපදින්නෝ නොවෙති.\n\n\"එබැවින්, ඇවැත්නි, මෙසේ හික්මිය යුතු ය: ‘අපි ධර්මයට යෝගී වූවෝ වෙමින්, ධ්‍යාන කරන්නා වූ භික්ෂූන්ගේ ගුණ ප්‍රශංසා කරන්නෙමු’ යනුවෙන්. ඇවැත්නි, ඔබ විසින් මෙසේ ම හික්මිය යුතු ය. ඒ කුමන කරුණක් නිසා ද? ඇවැත්නි, අමෘත ධාතුව (නිවන) කයින් ස්පර්ශ කොට (සෘජුව අත්දකිමින්) වාසය කරන්නා වූ පුද්ගලයෝ ලෝකයෙහි දුර්ලභයහ. එබැවින්, ඇවැත්නි, මෙසේ හික්මිය යුතු ය: ‘අපි ධ්‍යාන කරන්නා වූවෝ වෙමින්, ධර්මයට යෝගී භික්ෂූන්ගේ ගුණ ප්‍රශංසා කරන්නෙමු’ යනුවෙන්. ඇවැත්නි, ඔබ විසින් මෙසේ ම හික්මිය යුතු ය. ඒ කුමන කරුණක් නිසා ද? ඇවැත්නි, ගැඹුරු අර්ථ පදයන් (ධර්මයේ ගැබුරු කරුණු) ප්‍රඥාවෙන් විනිවිද (පසක් කොට) දකින්නා වූ පුද්ගලයෝ ලෝකයෙහි දුර්ලභයහ.\"",
      "paliTitle": "Mahācundasuttaṃ",
      "englishTitle": "Mahācunda Sutta",
      "sinhalaTitle": "මහාචුන්ද සූත‍්‍රය"
    },
    {
      "number": 47,
      "pali": "Atha kho moḷiyasīvako [moliyasīvako (sī. pī.), moḷisīvako (ka.)] paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho moḷiyasīvako paribbājako bhagavantaṃ etadavoca – ‘‘‘sandiṭṭhiko dhammo, sandiṭṭhiko dhammo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti? ‘‘Tena hi, sīvaka, taññevettha paṭipucchāmi. Yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, sīvaka, santaṃ vā ajjhattaṃ lobhaṃ ‘atthi me ajjhattaṃ lobho’ti pajānāsi, asantaṃ vā ajjhattaṃ lobhaṃ ‘natthi me ajjhattaṃ lobho’ti pajānāsī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yaṃ kho tvaṃ, sīvaka, santaṃ vā ajjhattaṃ lobhaṃ ‘atthi me ajjhattaṃ lobho’ti pajānāsi, asantaṃ vā ajjhattaṃ lobhaṃ ‘natthi me ajjhattaṃ lobho’ti pajānāsi – evampi kho, sīvaka, sandiṭṭhiko dhammo hoti…pe…. ‘‘Taṃ kiṃ maññasi, sīvaka, santaṃ vā ajjhattaṃ dosaṃ…pe… santaṃ vā ajjhattaṃ mohaṃ…pe… santaṃ vā ajjhattaṃ lobhadhammaṃ…pe… santaṃ vā ajjhattaṃ dosadhammaṃ…pe… santaṃ vā ajjhattaṃ mohadhammaṃ ‘atthi me ajjhattaṃ mohadhammo’ti pajānāsi, asantaṃ vā ajjhattaṃ mohadhammaṃ ‘natthi me ajjhattaṃ mohadhammo’ti pajānāsī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yaṃ kho tvaṃ, sīvaka, santaṃ vā ajjhattaṃ mohadhammaṃ ‘atthi me ajjhattaṃ mohadhammo’ti pajānāsi, asantaṃ vā ajjhattaṃ mohadhammaṃ ‘natthi me ajjhattaṃ mohadhammo’ti pajānāsi – evaṃ kho, sīvaka, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti. ‘‘Abhikkantaṃ, bhante, abhikkantaṃ, bhante…pe… upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Pañcamaṃ.",
      "english": "Then the wandering ascetic Moḷiyasīvaka approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging polite and memorable conversation, he sat down to one side. Seated to one side, the wandering ascetic Moḷiyasīvaka said to the Blessed One: “‘The Dhamma is visible here and now, the Dhamma is visible here and now,’ it is said, venerable sir. To what extent, venerable sir, is the Dhamma visible here and now, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise?”\n\n“In that case, Sīvaka, I shall ask you in return about this. You should answer it as you deem fit. What do you think, Sīvaka? When there is greed within you, do you understand, ‘There is greed within me’? Or when there is no greed within you, do you understand, ‘There is no greed within me’?” “Yes, venerable sir.” “That which you, Sīvaka, understand – when there is greed within you, ‘There is greed within me,’ or when there is no greed within you, ‘There is no greed within me’ – in this way too, Sīvaka, the Dhamma is visible here and now, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise.\n\n“What do you think, Sīvaka? When there is ill-will within you, do you understand, ‘There is ill-will within me’? Or when there is no ill-will within you, do you understand, ‘There is no ill-will within me’? When there is delusion within you, do you understand, ‘There is delusion within me’? Or when there is no delusion within you, do you understand, ‘There is no delusion within me’? When there is the potential for greed within you, do you understand, ‘There is the potential for greed within me’? Or when there is no potential for greed within you, do you understand, ‘There is no potential for greed within me’? When there is the potential for ill-will within you, do you understand, ‘There is the potential for ill-will within me’? Or when there is no potential for ill-will within you, do you understand, ‘There is no potential for ill-will within me’? When there is the potential for delusion within you, do you understand, ‘There is the potential for delusion within me’? Or when there is no potential for delusion within you, do you understand, ‘There is no potential for delusion within me’?”\n\n“Yes, venerable sir.” “That which you, Sīvaka, understand – when there is the potential for delusion within you, ‘There is the potential for delusion within me,’ or when there is no potential for delusion within you, ‘There is no potential for delusion within me’ – in this way, Sīvaka, the Dhamma is visible here and now, timeless, inviting one to come and see, leading inwards, and to be directly experienced by the wise.”\n\n“Excellent, venerable sir! Excellent, venerable sir! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to hold up a lamp in the darkness for those with eyes to see forms, so too has the Blessed One made the Dhamma clear in various ways. Let the Blessed One remember me as a lay follower who has taken refuge from this day forth for as long as life lasts.”",
      "sinhala": "එවිට මොළියසීවක පරිබ්‍රාජක තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියේය; එළඹ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහිපත් කළ යුතු කථා පැවැත්වීමෙන් පසු එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි මොළියසීවක පරිබ්‍රාජක තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය – ‘‘භාග්‍යවතුන් වහන්ස, ‘සන්දිට්ඨික ධර්මය, සන්දිට්ඨික ධර්මය’ යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර කරුණකින් ධර්මය සන්දිට්ඨික ද, කාලයකට යටත් නොවන ද, එව! බලව! යැයි ඇරයුම් කළ හැකි ද, තමන් වෙත එළවාගත හැකි ද, ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම අවබෝධ කළ යුතු ද වන්නේද?’’\n\n‘‘එසේ නම්, සීවක, මම ඔබගෙන් මෙහිදී ප්‍රතිප්‍රශ්නයක් අසමි. ඔබට කැමති පරිදි එයට පිළිතුරු දෙන්න. සීවක, ඔබ කුමක් සිතන්නෙහි ද? තමන් තුළ ලෝභය තිබේ නම් ‘මා තුළ ලෝභය ඇතැ’යි ද, තමන් තුළ ලෝභය නැත්නම් ‘මා තුළ ලෝභය නැතැ’යි ද ඔබ දන්නෙහි ද?’’ ‘‘එසේය, භාග්‍යවතුන් වහන්ස.’’ ‘‘සීවක, ඔබ තමන් තුළ ලෝභය තිබේ නම් ‘මා තුළ ලෝභය ඇතැ’යි ද, තමන් තුළ ලෝභය නැත්නම් ‘මා තුළ ලෝභය නැතැ’යි ද යමක් දන්නෙහි ද – සීවක, මෙලෙසින් ද ධර්මය සන්දිට්ඨික වන්නේය, කාලයකට යටත් නොවන වන්නේය, එව! බලව! යැයි ඇරයුම් කළ හැකි වන්නේය, තමන් වෙත එළවාගත හැකි වන්නේය, ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම අවබෝධ කළ යුතු වන්නේය.’’\n\n‘‘සීවක, ඔබ කුමක් සිතන්නෙහි ද? තමන් තුළ ද්වේෂය තිබේ නම් ‘මා තුළ ද්වේෂය ඇතැ’යි ද, නැත්නම් ‘මා තුළ ද්වේෂය නැතැ’යි ද ඔබ දන්නෙහි ද? තමන් තුළ මෝහය තිබේ නම් ‘මා තුළ මෝහය ඇතැ’යි ද, නැත්නම් ‘මා තුළ මෝහය නැතැ’යි ද ඔබ දන්නෙහි ද? තමන් තුළ ලෝභ ධර්මය තිබේ නම් ‘මා තුළ ලෝභ ධර්මය ඇතැ’යි ද, නැත්නම් ‘මා තුළ ලෝභ ධර්මය නැතැ’යි ද ඔබ දන්නෙහි ද? තමන් තුළ ද්වේෂ ධර්මය තිබේ නම් ‘මා තුළ ද්වේෂ ධර්මය ඇතැ’යි ද, නැත්නම් ‘මා තුළ ද්වේෂ ධර්මය නැතැ’යි ද ඔබ දන්නෙහි ද? තමන් තුළ මෝහ ධර්මය තිබේ නම් ‘මා තුළ මෝහ ධර්මය ඇතැ’යි ද, තමන් තුළ මෝහ ධර්මය නැත්නම් ‘මා තුළ මෝහ ධර්මය නැතැ’යි ද ඔබ දන්නෙහි ද?’’ ‘‘එසේය, භාග්‍යවතුන් වහන්ස.’’ ‘‘සීවක, ඔබ තමන් තුළ මෝහ ධර්මය තිබේ නම් ‘මා තුළ මෝහ ධර්මය ඇතැ’යි ද, තමන් තුළ මෝහ ධර්මය නැත්නම් ‘මා තුළ මෝහ ධර්මය නැතැ’යි ද යමක් දන්නෙහි ද – සීවක, මෙලෙසින් ද ධර්මය සන්දිට්ඨික වන්නේය, කාලයකට යටත් නොවන වන්නේය, එව! බලව! යැයි ඇරයුම් කළ හැකි වන්නේය, තමන් වෙත එළවාගත හැකි වන්නේය, ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම අවබෝධ කළ යුතු වන්නේය.’’\n\n‘‘අතිශයින් ම අලංකාරය, භාග්‍යවතුන් වහන්ස! අතිශයින් ම අලංකාරය, භාග්‍යවතුන් වහන්ස! භාග්‍යවතුන් වහන්ස, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වැසූ දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේ ද, ඇස් ඇති අයට රූප පෙනෙනු පිණිස අන්ධකාරයේ තෙල් පහනක් දල්වන්නේ ද, එලෙසින් ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය දේශනා කර ඇත. භාග්‍යවතුන් වහන්ස, මම ඒ භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, සංඝයා ද සරණ යමි. භාග්‍යවතුන් වහන්ස, අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා සලකන සේක්වා!’’",
      "paliTitle": "Paṭhamasandiṭṭhikasuttaṃ",
      "englishTitle": "First Discourse on the Immediately Verifiable",
      "sinhalaTitle": "පළමු සන්දිට්ඨික සූත්‍රය"
    },
    {
      "number": 48,
      "pali": "Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘‘sandiṭṭhiko dhammo, sandiṭṭhiko dhammo’ti, bho gotama, vuccati. Kittāvatā nu kho, bho gotama, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti? ‘‘Tena hi, brāhmaṇa, taññevettha paṭipucchissāmi. Yathā te khameyya tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, brāhmaṇa, santaṃ vā ajjhattaṃ rāgaṃ ‘atthi me ajjhattaṃ rāgo’ti pajānāsi, asantaṃ vā ajjhattaṃ rāgaṃ ‘natthi me ajjhattaṃ rāgo’ti pajānāsī’’ti? ‘‘Evaṃ, bho’’. ‘‘Yaṃ kho tvaṃ, brāhmaṇa, santaṃ vā ajjhattaṃ rāgaṃ ‘atthi me ajjhattaṃ rāgo’ti pajānāsi, asantaṃ vā ajjhattaṃ rāgaṃ ‘natthi me ajjhattaṃ rāgo’ti pajānāsi – evampi kho, brāhmaṇa, sandiṭṭhiko dhammo hoti…pe…. ‘‘Taṃ kiṃ maññasi, brāhmaṇa, santaṃ vā ajjhattaṃ dosaṃ…pe… santaṃ vā ajjhattaṃ mohaṃ… pe… santaṃ vā ajjhattaṃ kāyasandosaṃ…pe… santaṃ vā ajjhattaṃ vacīsandosaṃ…pe… santaṃ vā ajjhattaṃ manosandosaṃ ‘atthi me ajjhattaṃ manosandoso’ti pajānāsi, asantaṃ vā ajjhattaṃ manosandosaṃ ‘natthi me ajjhattaṃ manosandoso’ti pajānāsī’’ti? ‘‘Evaṃ, bho’’. ‘‘Yaṃ kho tvaṃ, brāhmaṇa, santaṃ vā ajjhattaṃ manosandosaṃ ‘atthi me ajjhattaṃ manosandoso’ti pajānāsi, asantaṃ vā ajjhattaṃ manosandosaṃ ‘natthi me ajjhattaṃ manosandoso’ti pajānāsi – evaṃ kho, brāhmaṇa, sandiṭṭhiko dhammo hoti akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Chaṭṭhaṃ.",
      "english": "Then a certain brahmin approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging courteous and memorable remarks, he sat down to one side. Seated to one side, that brahmin said to the Blessed One: \"'Directly visible Dhamma, directly visible Dhamma,' it is said, venerable Gotama. To what extent, venerable Gotama, is the Dhamma said to be directly visible, timeless, inviting inspection, onward-leading, and to be personally experienced by the wise?\"\n\n\"In that case, brahmin, I shall question you about this. You should answer as you see fit. What do you think, brahmin? When there is lust within you, do you understand, 'There is lust within me'? And when there is no lust within you, do you understand, 'There is no lust within me'?\" \"Yes, venerable sir.\"\n\n\"When you, brahmin, understand, 'There is lust within me' when there is lust within you, and understand, 'There is no lust within me' when there is no lust within you – in this way too, brahmin, the Dhamma is directly visible, timeless, inviting inspection, onward-leading, and to be personally experienced by the wise.\"\n\n\"What do you think, brahmin? When there is hatred within you, do you understand, 'There is hatred within me'? And when there is no hatred within you, do you understand, 'There is no hatred within me'? When there is delusion within you, do you understand, 'There is delusion within me'? And when there is no delusion within you, do you understand, 'There is no delusion within me'? When there is bodily corruption within you, do you understand, 'There is bodily corruption within me'? And when there is no bodily corruption within you, do you understand, 'There is no bodily corruption within me'? When there is verbal corruption within you, do you understand, 'There is verbal corruption within me'? And when there is no verbal corruption within you, do you understand, 'There is no verbal corruption within me'? And when there is mental corruption within you, do you understand, 'There is mental corruption within me'? And when there is no mental corruption within you, do you understand, 'There is no mental corruption within me'?\" \"Yes, venerable sir.\"\n\n\"When you, brahmin, understand, 'There is mental corruption within me' when there is mental corruption within you, and understand, 'There is no mental corruption within me' when there is no mental corruption within you – in this way, brahmin, the Dhamma is directly visible, timeless, inviting inspection, onward-leading, and to be personally experienced by the wise.\"\n\n\"Excellent, venerable Gotama! Excellent, venerable Gotama! May the venerable Gotama accept me as a lay follower who has taken refuge from this day forth as long as life lasts.\"",
      "sinhala": "එවිට එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථා බහ නිමවා එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ‘‘භවත් ගෞතමයන් වහන්ස, ‘ධර්මය තමාටම ප්‍රත්‍යක්ෂ වේ, ධර්මය තමාටම ප්‍රත්‍යක්ෂ වේ’ යැයි කියනු ලැබේ. භවත් ගෞතමයන් වහන්ස, කවර පමණකින්ද මේ ධර්මය තමාටම ප්‍රත්‍යක්ෂ වන එකක් වන්නේද, කිසිදු කාලයක් නොගන්නා එකක් වන්නේද, ‘ඇවිත් බලන්නැයි’ කියන එකක් වන්නේද, (නිවනට) පමුණුවන එකක් වන්නේද, නුවණැත්තන් විසින් තම තමා තුළින්ම අවබෝධ කරගත යුතු එකක් වන්නේද?’’\n\n‘‘එසේ නම්, බ්‍රාහ්මණය, මම ඔබටම මේ ගැන පෙරළා ප්‍රශ්න කරන්නෙමි. ඔබට යම්සේ රුචිවේද, එසේ එය විස්තර කරන්න.’’ ‘‘බ්‍රාහ්මණය, ඔබ මේ කුමක් සිතන්නෙහිද? තමා තුළ රාගය තිබෙන විට ‘මා තුළ රාගය ඇතැ’යි ඔබ දන්නෙහිද? තමා තුළ රාගය නැති විට ‘මා තුළ රාගය නැතැ’යි ඔබ දන්නෙහිද?’’ ‘‘එසේය, භවත්නි.’’ ‘‘බ්‍රාහ්මණය, යම් හෙයකින් ඔබ තමා තුළ රාගය තිබෙන විට ‘මා තුළ රාගය ඇතැ’යි දන්නෙහිද, තමා තුළ රාගය නැති විට ‘මා තුළ රාගය නැතැ’යි දන්නෙහිද, බ්‍රාහ්මණය, මේ අයුරින්ද ධර්මය තමාටම ප්‍රත්‍යක්ෂ වන එකක් වන්නේය...පෙ....\n\n‘‘බ්‍රාහ්මණය, ඔබ මේ කුමක් සිතන්නෙහිද? තමා තුළ ද්වේෂය තිබෙන විට...පෙ... තමා තුළ මෝහය තිබෙන විට...පෙ... තමා තුළ කායික දූෂණය තිබෙන විට...පෙ... තමා තුළ වාචසික දූෂණය තිබෙන විට...පෙ... තමා තුළ මානසික දූෂණය තිබෙන විට ‘මා තුළ මානසික දූෂණය ඇතැ’යි ඔබ දන්නෙහිද? තමා තුළ මානසික දූෂණය නැති විට ‘මා තුළ මානසික දූෂණය නැතැ’යි ඔබ දන්නෙහිද?’’ ‘‘එසේය, භවත්නි.’’ ‘‘බ්‍රාහ්මණය, යම් හෙයකින් ඔබ තමා තුළ මානසික දූෂණය තිබෙන විට ‘මා තුළ මානසික දූෂණය ඇතැ’යි දන්නෙහිද, තමා තුළ මානසික දූෂණය නැති විට ‘මා තුළ මානසික දූෂණය නැතැ’යි දන්නෙහිද, බ්‍රාහ්මණය, මේ අයුරින් ධර්මය තමාටම ප්‍රත්‍යක්ෂ වන එකක් වන්නේය, කිසිදු කාලයක් නොගන්නා එකක් වන්නේය, ‘ඇවිත් බලන්නැයි’ කියන එකක් වන්නේය, (නිවනට) පමුණුවන එකක් වන්නේය, නුවණැත්තන් විසින් තම තමා තුළින්ම අවබෝධ කරගත යුතු එකක් වන්නේය.’’\n\n‘‘ඉතා මැනවි, භවත් ගෞතමයන් වහන්ස! ඉතා මැනවි, භවත් ගෞතමයන් වහන්ස! ...පෙ... භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි තිබෙන තෙක් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Dutiyasandiṭṭhikasuttaṃ",
      "englishTitle": "The Second Discourse on the Visible",
      "sinhalaTitle": "දෙවන සන්දිට්ඨික සූත්‍රය"
    },
    {
      "number": 49,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā ca khemo āyasmā ca sumano sāvatthiyaṃ viharanti andhavanasmiṃ. Atha kho āyasmā ca khemo āyasmā ca sumano yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā khemo bhagavantaṃ etadavoca – ‘‘Yo so, bhante, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto tassa na evaṃ hoti – ‘atthi me seyyoti vā atthi me sadisoti vā atthi me hīnoti vā’’’ti. Idamavocāyasmā khemo. Samanuñño satthā ahosi. Atha kho āyasmā khemo ‘‘samanuñño me satthā’’ti uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho āyasmā sumano acirapakkante āyasmante kheme bhagavantaṃ etadavoca – ‘‘yo so, bhante, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto tassa na evaṃ hoti – ‘natthi me seyyoti vā natthi me sadisoti vā natthi me hīnoti vā’’’ti. Idamavocāyasmā sumano. Samanuñño satthā ahosi. Atha kho āyasmā sumano ‘‘samanuñño me satthā’’ti uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā acirapakkantesu āyasmante ca kheme āyasmante ca sumane bhikkhū āmantesi – ‘‘evaṃ kho, bhikkhave, kulaputtā aññaṃ byākaronti. Attho ca vutto attā ca anupanīto. Atha ca pana idhekacce moghapurisā hasamānakā [hasamānakaṃ (ka.) mahāva. 245] maññe aññaṃ byākaronti. Te pacchā vighātaṃ āpajjantī’’ti. ‘‘Na ussesu na omesu, samatte nopanīyare [nopaniyyare (syā. pī. ka.)]; Khīṇā jāti vusitaṃ brahmacariyaṃ, caranti saṃyojanavippamuttā’’ti. sattamaṃ;",
      "english": "On one occasion, the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. Now at that time, Venerable Khema and Venerable Sumana were dwelling in Sāvatthī, in the Blind Man's Grove. Then Venerable Khema and Venerable Sumana approached the Blessed One; having approached, they paid homage to the Blessed One and sat down to one side.\n\nSeated to one side, Venerable Khema said to the Blessed One, \"Venerable sir, for that bhikkhu who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who has laid down the burden, who has attained his own true goal, who has completely severed the fetters of existence, and who is completely liberated through perfect knowledge—it does not occur to him thus: ‘I am superior’ or ‘I am equal’ or ‘I am inferior’.\" This is what Venerable Khema said. The Teacher approved. Then Venerable Khema, thinking, \"My Teacher has approved,\" rose from his seat, paid homage to the Blessed One, circumambulated him respectfully, and departed.\n\nThen, not long after Venerable Khema had departed, Venerable Sumana said to the Blessed One, \"Venerable sir, for that bhikkhu who is an Arahant, whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who has laid down the burden, who has attained his own true goal, who has completely severed the fetters of existence, and who is completely liberated through perfect knowledge—it does not occur to him thus: ‘I am not superior’ or ‘I am not equal’ or ‘I am not inferior’.\" This is what Venerable Sumana said. The Teacher approved. Then Venerable Sumana, thinking, \"My Teacher has approved,\" rose from his seat, paid homage to the Blessed One, circumambulated him respectfully, and departed.\n\nThen, not long after Venerable Khema and Venerable Sumana had departed, the Blessed One addressed the bhikkhus: \"It is in this way, bhikkhus, that sons of good families declare knowledge. The meaning has been expressed, and the self has not been implied. But some deluded persons here, laughing as it were, declare knowledge. They later fall into distress.\"\n\n\"They are not involved in what is superior, or in what is inferior, or in what is equal. Their birth is destroyed, the holy life has been lived; they wander free from all fetters.\"",
      "sinhala": "එක් සමයෙක භාග්‍ය​වතුන් වහන්සේ සැවැත්නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයේ වැඩසිටියාහ. ඒ සමයෙහි ආයුෂ්මත් ඛේම ස්ථවිරයන් වහන්සේත්, ආයුෂ්මත් සුමන ස්ථවිරයන් වහන්සේත් සැවැත්නුවර අන්ධවනයේ වාසය කළහ. එවිට ආයුෂ්මත් ඛේම ස්ථවිරයන් වහන්සේත්, ආයුෂ්මත් සුමන ස්ථවිරයන් වහන්සේත් භාග්‍ය​වතුන් වහන්සේ වෙත පැමිණ, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූහ. එක් පසෙකින් වාඩි වී සිටි ආයුෂ්මත් ඛේම ස්ථවිරයන් වහන්සේ භාග්‍ය​වතුන් වහන්සේට මෙය පැවසූහ: \"වහන්ස, යම් ඒ රහත්, ක්ෂීණා​ශ්‍රව, බඹසර අවසන් කළ, කළ යුතු දේ අවසන් කළ, බර පහ කළ, තමන්ගේ සැබෑ අරමුණට පැමිණි, භවය හා සම්බන්ධ සියලු බැඳීම් ක්ෂය කළ, සම්‍යක් ප්‍ර​ඥා​වෙන් විමුක්ත වූ භික්ෂුවක් වේද, ඔහුට මෙසේ සිතක් ඇති නොවේ: ‘මට වඩා උසස් කෙනෙක් ඇතැයි හෝ, මට සමාන කෙනෙක් ඇතැයි හෝ, මට වඩා පහත් කෙනෙක් ඇතැයි හෝ.’\" ආයුෂ්මත් ඛේම ස්ථවිරයන් වහන්සේ මෙය පැවසූහ. ශාස්තෲන් වහන්සේ එයට එකඟ වූහ. එවිට ආයුෂ්මත් ඛේම ස්ථවිරයන් වහන්සේ, “ශාස්තෲන් වහන්සේ මා හා එකඟ වූ සේකැ”යි පවසා, ආසනයෙන් නැගිට, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර, පැදකුණු කර පිටත්ව ගියහ. ආයුෂ්මත් ඛේම ස්ථවිරයන් වහන්සේ පිටත්ව ගොස් වැඩි වේලාවක් ගතවීමටත් පෙර, ආයුෂ්මත් සුමන ස්ථවිරයන් වහන්සේ භාග්‍ය​වතුන් වහන්සේට මෙය පැවසූහ: “වහන්ස, යම් ඒ රහත්, ක්ෂීණා​ශ්‍රව, බඹසර අවසන් කළ, කළ යුතු දේ අවසන් කළ, බර පහ කළ, තමන්ගේ සැබෑ අරමුණට පැමිණි, භවය හා සම්බන්ධ සියලු බැඳීම් ක්ෂය කළ, සම්‍යක් ප්‍ර​ඥා​වෙන් විමුක්ත වූ භික්ෂුවක් වේද, ඔහුට මෙසේ සිතක් ඇති නොවේ: ‘මට වඩා උසස් කෙනෙක් නැතැයි හෝ, මට සමාන කෙනෙක් නැතැයි හෝ, මට වඩා පහත් කෙනෙක් නැතැයි හෝ.’\" ආයුෂ්මත් සුමන ස්ථවිරයන් වහන්සේ මෙය පැවසූහ. ශාස්තෲන් වහන්සේ එයට එකඟ වූහ. එවිට ආයුෂ්මත් සුමන ස්ථවිරයන් වහන්සේ, “ශාස්තෲන් වහන්සේ මා හා එකඟ වූ සේකැ”යි පවසා, ආසනයෙන් නැගිට, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර, පැදකුණු කර පිටත්ව ගියහ.\n\nආයුෂ්මත් ඛේම ස්ථවිරයන් වහන්සේත්, ආයුෂ්මත් සුමන ස්ථවිරයන් වහන්සේත් පිටත්ව ගොස් වැඩි වේලාවක් ගතවීමටත් පෙර, භාග්‍ය​වතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: “මහණෙනි, කුලපුත්‍රයෝ (තමන්ගේ) රහත් බව ප්‍ර​කාශ කරන්නේ මෙසේය. එහිදී අදහසද ප්‍ර​කාශ කරනු ලැබේ, ආත්මයක්ද නොපෙන්වයි. නමුත් ඇතැම් හිස් පුරුෂයෝ සිනාසෙමින්, (තමන්ගේ) ආත්මයක් ඇතැයි සිතා අන්‍ය දේ ප්‍ර​කාශ කරති. ඔවුහු පසුව විඝාතයට පත් වෙති.”\n\nඋසස් බවෙහි හෝ පහත් බවෙහි හෝ නොඇලී, සම බවෙහිද නොපැමිණෙති;\nජාතිය ක්ෂය වී ඇත, බඹසර අවසන් කොට ඇත,\nසියලු සංයෝජනවලින් විමුක්තව ඔවුහු හැසිරෙති.",
      "paliTitle": "Khemasuttaṃ",
      "englishTitle": "The Khema Discourse",
      "sinhalaTitle": "ඛේම සූත‍්‍රය"
    },
    {
      "number": 50,
      "pali": "[a. ni. 5.24, 168; 2.7.65] ‘‘Indriyasaṃvare, bhikkhave, asati indriyasaṃvaravipannassa hatūpanisaṃ hoti sīlaṃ; sīle asati sīlavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi na pāripūriṃ gacchati, pheggupi na pāripūriṃ gacchati, sāropi na pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, indriyasaṃvare asati indriyasaṃvaravipannassa hatūpanisaṃ hoti sīlaṃ…pe… vimuttiñāṇadassanaṃ. ‘‘Indriyasaṃvare, bhikkhave, sati indriyasaṃvarasampannassa upanisasampannaṃ hoti sīlaṃ; sīle sati sīlasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi pāripūriṃ gacchati, pheggupi pāripūriṃ gacchati, sāropi pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, indriyasaṃvare sati indriyasaṃvarasampannassa upanisasampannaṃ hoti sīlaṃ…pe… vimuttiñāṇadassana’’nti. Aṭṭhamaṃ.",
      "english": "Bhikkhus, when there is no restraint of the sense faculties, for one who is deprived of restraint of the sense faculties, moral conduct has its foundation destroyed. When there is no moral conduct, for one who is deprived of moral conduct, right concentration has its foundation destroyed. When there is no right concentration, for one who is deprived of right concentration, knowledge and vision of things as they actually are has its foundation destroyed. When there is no knowledge and vision of things as they actually are, for one who is deprived of knowledge and vision of things as they actually are, disenchantment and dispassion have their foundation destroyed. When there is no disenchantment and dispassion, for one who is deprived of disenchantment and dispassion, knowledge and vision of liberation has its foundation destroyed. Just as, Bhikkhus, a tree deprived of branches and foliage – its outer bark does not reach full development, its inner bark does not reach full development, its sapwood does not reach full development, its heartwood does not reach full development. In the same way, Bhikkhus, when there is no restraint of the sense faculties, for one who is deprived of restraint of the sense faculties, moral conduct has its foundation destroyed; when there is no moral conduct, for one who is deprived of moral conduct, right concentration has its foundation destroyed; when there is no right concentration, for one who is deprived of right concentration, knowledge and vision of things as they actually are has its foundation destroyed; when there is no knowledge and vision of things as they actually are, for one who is deprived of knowledge and vision of things as they actually are, disenchantment and dispassion have their foundation destroyed; when there is no disenchantment and dispassion, for one who is deprived of disenchantment and dispassion, knowledge and vision of liberation has its foundation destroyed.\n\nBhikkhus, when there is restraint of the sense faculties, for one who is endowed with restraint of the sense faculties, moral conduct is well-founded. When there is moral conduct, for one who is endowed with moral conduct, right concentration is well-founded. When there is right concentration, for one who is endowed with right concentration, knowledge and vision of things as they actually are is well-founded. When there is knowledge and vision of things as they actually are, for one who is endowed with knowledge and vision of things as they actually are, disenchantment and dispassion are well-founded. When there is disenchantment and dispassion, for one who is endowed with disenchantment and dispassion, knowledge and vision of liberation is well-founded. Just as, Bhikkhus, a tree endowed with branches and foliage – its outer bark reaches full development, its inner bark reaches full development, its sapwood reaches full development, its heartwood reaches full development. In the same way, Bhikkhus, when there is restraint of the sense faculties, for one who is endowed with restraint of the sense faculties, moral conduct is well-founded; when there is moral conduct, for one who is endowed with moral conduct, right concentration is well-founded; when there is right concentration, for one who is endowed with right concentration, knowledge and vision of things as they actually are is well-founded; when there is knowledge and vision of things as they actually are, for one who is endowed with knowledge and vision of things as they actually are, disenchantment and dispassion are well-founded; when there is disenchantment and dispassion, for one who is endowed with disenchantment and dispassion, knowledge and vision of liberation is well-founded.",
      "sinhala": "භික්ෂූණි, ඉන්ද්‍රිය සංවරය නැති කල්හි, ඉන්ද්‍රිය සංවරයෙන් පිරිහුණු තැනැත්තාට ශීලය නිෂ්ඵල වේ. ශීලය නැති කල්හි, ශීලයෙන් පිරිහුණු තැනැත්තාට සම්‍යක් සමාධිය නිෂ්ඵල වේ. සම්‍යක් සමාධිය නැති කල්හි, සම්‍යක් සමාධියෙන් පිරිහුණු තැනැත්තාට යථාභූත ඥාන දර්ශනය නිෂ්ඵල වේ. යථාභූත ඥාන දර්ශනය නැති කල්හි, යථාභූත ඥාන දර්ශනයෙන් පිරිහුණු තැනැත්තාට නිර්වේද විරාගය නිෂ්ඵල වේ. නිර්වේද විරාගය නැති කල්හි, නිර්වේද විරාගයෙන් පිරිහුණු තැනැත්තාට විමුක්ති ඥාන දර්ශනය නිෂ්ඵල වේ. භික්ෂූණි, යම් සේ අතුපතරින් හා පත්‍රවලින් හීන වූ ගසක් වේ ද, එහි පොත්ත ද වැඩෙන්නේ නැත. බඩපොත්ත ද වැඩෙන්නේ නැත. පළුව ද වැඩෙන්නේ නැත. සාරය ද වැඩෙන්නේ නැත. භික්ෂූණි, එසේම, ඉන්ද්‍රිය සංවරය නැති කල්හි, ඉන්ද්‍රිය සංවරයෙන් පිරිහුණු තැනැත්තාට ශීලය නිෂ්ඵල වේ. ශීලය නැති කල්හි, ශීලයෙන් පිරිහුණු තැනැත්තාට සම්‍යක් සමාධිය නිෂ්ඵල වේ. සම්‍යක් සමාධිය නැති කල්හි, සම්‍යක් සමාධියෙන් පිරිහුණු තැනැත්තාට යථාභූත ඥාන දර්ශනය නිෂ්ඵල වේ. යථාභූත ඥාන දර්ශනය නැති කල්හි, යථාභූත ඥාන දර්ශනයෙන් පිරිහුණු තැනැත්තාට නිර්වේද විරාගය නිෂ්ඵල වේ. නිර්වේද විරාගය නැති කල්හි, නිර්වේද විරාගයෙන් පිරිහුණු තැනැත්තාට විමුක්ති ඥාන දර්ශනය නිෂ්ඵල වේ.\n\nභික්ෂූණි, ඉන්ද්‍රිය සංවරය ඇති කල්හි, ඉන්ද්‍රිය සංවරයෙන් යුක්ත වූ තැනැත්තාට ශීලය උපනිශ්‍රය සම්පූර්ණ වේ. ශීලය ඇති කල්හි, ශීලයෙන් යුක්ත වූ තැනැත්තාට සම්‍යක් සමාධිය උපනිශ්‍රය සම්පූර්ණ වේ. සම්‍යක් සමාධිය ඇති කල්හි, සම්‍යක් සමාධියෙන් යුක්ත වූ තැනැත්තාට යථාභූත ඥාන දර්ශනය උපනිශ්‍රය සම්පූර්ණ වේ. යථාභූත ඥාන දර්ශනය ඇති කල්හි, යථාභූත ඥාන දර්ශනයෙන් යුක්ත වූ තැනැත්තාට නිර්වේද විරාගය උපනිශ්‍රය සම්පූර්ණ වේ. නිර්වේද විරාගය ඇති කල්හි, නිර්වේද විරාගයෙන් යුක්ත වූ තැනැත්තාට විමුක්ති ඥාන දර්ශනය උපනිශ්‍රය සම්පූර්ණ වේ. භික්ෂූණි, යම් සේ අතුපතරින් හා පත්‍රවලින් යුක්ත වූ ගසක් වේ ද, එහි පොත්ත ද සම්පූර්ණත්වයට පත්වේ. බඩපොත්ත ද සම්පූර්ණත්වයට පත්වේ. පළුව ද සම්පූර්ණත්වයට පත්වේ. සාරය ද සම්පූර්ණත්වයට පත්වේ. භික්ෂූණි, එසේම, ඉන්ද්‍රිය සංවරය ඇති කල්හි, ඉන්ද්‍රිය සංවරයෙන් යුක්ත වූ තැනැත්තාට ශීලය උපනිශ්‍රය සම්පූර්ණ වේ. ශීලය ඇති කල්හි, ශීලයෙන් යුක්ත වූ තැනැත්තාට සම්‍යක් සමාධිය උපනිශ්‍රය සම්පූර්ණ වේ. සම්‍යක් සමාධිය ඇති කල්හි, සම්‍යක් සමාධියෙන් යුක්ත වූ තැනැත්තාට යථාභූත ඥාන දර්ශනය උපනිශ්‍රය සම්පූර්ණ වේ. යථාභූත ඥාන දර්ශනය ඇති කල්හි, යථාභූත ඥාන දර්ශනයෙන් යුක්ත වූ තැනැත්තාට නිර්වේද විරාගය උපනිශ්‍රය සම්පූර්ණ වේ. නිර්වේද විරාගය ඇති කල්හි, නිර්වේද විරාගයෙන් යුක්ත වූ තැනැත්තාට විමුක්ති ඥාන දර්ශනය උපනිශ්‍රය සම්පූර්ණ වේ.",
      "paliTitle": "Indriyasaṃvarasuttaṃ",
      "englishTitle": "Sutta on Sense Restraint",
      "sinhalaTitle": "ඉන්ද්‍රියසංවර සූත්‍රය"
    },
    {
      "number": 51,
      "pali": "Atha kho āyasmā ānando yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Kittāvatā nu kho, āvuso sāriputta, bhikkhu assutañceva dhammaṃ suṇāti, sutā cassa dhammā na sammosaṃ gacchanti, ye cassa dhammā pubbe cetasā samphuṭṭhapubbā te ca samudācaranti, aviññātañca vijānātī’’ti? ‘‘Āyasmā kho ānando bahussuto. Paṭibhātu āyasmantaṃyeva ānanda’’nti. ‘‘Tenahāvuso sāriputta, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho āyasmā sāriputto āyasmato ānandassa paccassosi. Āyasmā ānando etadavoca – ‘‘Idhāvuso sāriputta, bhikkhu dhammaṃ pariyāpuṇāti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthaṃ udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ. So yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti, yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ vāceti, yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti, yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati. Yasmiṃ āvāse therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā tasmiṃ āvāse vassaṃ upeti. Te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ; imassa kvattho’ti? Te tassa āyasmato avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Ettāvatā kho, āvuso sāriputta, bhikkhu assutañceva dhammaṃ suṇāti, sutā cassa dhammā na sammosaṃ gacchanti, ye cassa dhammā pubbe cetasā samphuṭṭhapubbā te ca samudācaranti, aviññātañca vijānātī’’ti. ‘‘Acchariyaṃ, āvuso, abbhutaṃ, āvuso, yāva subhāsitaṃ cidaṃ āyasmatā ānandena. Imehi ca mayaṃ chahi dhammehi samannāgataṃ āyasmantaṃ ānandaṃ dhārema. Āyasmā hi ānando dhammaṃ pariyāpuṇāti – suttaṃ geyyaṃ veyyākaraṇaṃ gāthaṃ udānaṃ itivuttakaṃ jātakaṃ abbhutadhammaṃ vedallaṃ. Āyasmā ānando yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti, āyasmā ānando yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ vāceti, āyasmā ānando yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti, āyasmā ānando yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati. Āyasmā ānando yasmiṃ āvāse therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā tasmiṃ āvāse vassaṃ upeti. Te āyasmā ānando kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ; imassa kvattho’ti? Te āyasmato ānandassa avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodentī’’ti. Navamaṃ.",
      "english": "Then, the Venerable Ānanda went to where the Venerable Sāriputta was. Having approached, he exchanged greetings with the Venerable Sāriputta. Having concluded the courteous and memorable conversation, he sat down to one side. Seated to one side, the Venerable Ānanda said to the Venerable Sāriputta: \"To what extent, friend Sāriputta, does a monk hear teachings he has not heard before, and the teachings he has heard do not become confused for him, and the teachings he has previously contacted with his mind are brought to mind, and he fully understands what he did not understand before?\"\n\n\"The Venerable Ānanda is very learned. Let the Venerable Ānanda himself explain.\" \"In that case, friend Sāriputta, listen, attend carefully with your mind; I will speak.\" \"Yes, friend,\" replied the Venerable Sāriputta to the Venerable Ānanda.\n\nThe Venerable Ānanda said this: \"Here, friend Sāriputta, a monk masters the Dhamma—discourses, mixed prose and verse, expositions, verses, inspired utterances, 'as it was said' discourses, birth stories, astonishing phenomena, and questions and answers. He teaches that Dhamma to others extensively, just as he heard it and just as he mastered it. He recites that Dhamma for others extensively, just as he heard it and just as he mastered it. He chants that Dhamma extensively, just as he heard it and just as he mastered it. He contemplates, examines, and reflects upon that Dhamma with his mind, just as he heard it and just as he mastered it. He undertakes the Rains Retreat in a dwelling where elder monks reside who are very learned, who have studied the tradition, who uphold the Dhamma, who uphold the Vinaya, and who uphold the Summaries (Mātikās). From time to time, he approaches them and questions and inquires: 'How is this, Venerable Sir? What is the meaning of this?' They reveal what was unrevealed to that venerable one, make plain what was not plain, and dispel his doubts about various points of Dhamma that give rise to doubt. To this extent, friend Sāriputta, a monk hears teachings he has not heard before, and the teachings he has heard do not become confused for him, and the teachings he has previously contacted with his mind are brought to mind, and he fully understands what he did not understand before.\"\n\n\"It is amazing, friend! It is wonderful, friend! How well said this is by the Venerable Ānanda! And we acknowledge the Venerable Ānanda to be endowed with these six qualities. For the Venerable Ānanda masters the Dhamma—discourses, mixed prose and verse, expositions, verses, inspired utterances, 'as it was said' discourses, birth stories, astonishing phenomena, and questions and answers. The Venerable Ānanda teaches that Dhamma to others extensively, just as he heard it and just as he mastered it. The Venerable Ānanda recites that Dhamma for others extensively, just as he heard it and just as he mastered it. The Venerable Ānanda chants that Dhamma extensively, just as he heard it and just as he mastered it. The Venerable Ānanda contemplates, examines, and reflects upon that Dhamma with his mind, just as he heard it and just as he mastered it. The Venerable Ānanda undertakes the Rains Retreat in a dwelling where elder monks reside who are very learned, who have studied the tradition, who uphold the Dhamma, who uphold the Vinaya, and who uphold the Summaries (Mātikās). From time to time, the Venerable Ānanda approaches them and questions and inquires: 'How is this, Venerable Sir? What is the meaning of this?' They reveal what was unrevealed to the Venerable Ānanda, make plain what was not plain, and dispel his doubts about various points of Dhamma that give rise to doubt.\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ වෙතට පැමිණියහ. පැමිණ, ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ සමඟ සම්‍මෝදනීය කථාවෙන් සතුටු වූහ. එම ප්‍රියමනාප, සිහිකටයුතු කථාව නිමාකර, එකත්පසෙකින් වැඩහුන්හ. එකත්පසෙකින් වැඩහුන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: \"ආයුෂ්මත් ශාරිපුත්‍රයෙනි, කෙසේද භික්ෂුවක් නුඇසූ ධර්මයක් අසන්නේ, අසන ලද ධර්මය අමතක නොවන්නේ, පෙර සිතින් අත්විඳින ලද ධර්මයන් නැවත සිහියට එන්නේ, නොදන්නා දේ විශේෂයෙන් දැනගන්නේ?\"\n\n\"ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ නියත වශයෙන්ම බහුශ්‍රැතයෙකි. ඒ සඳහා ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේටම වැටහේවා!\"\n\n\"එසේ නම් ආයුෂ්මත් ශාරිපුත්‍රයෙනි, සවන් දෙන්න, හොඳින් මෙනෙහි කරන්න; මම කියන්නෙමි.\"\n\n\"එසේය ආයුෂ්මතුනි!\" යැයි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට පිළිවදන් දුන්හ. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මෙය පැවසූහ: \"ආයුෂ්මත් ශාරිපුත්‍රයෙනි, මෙහිදී භික්ෂුවක් ධර්මය ඉගෙන ගනී – එනම්, සූත්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන නව අංග ශාසනයයි. ඔහු තමා ඇසූ පරිදි, ඉගෙන ගත් පරිදි, ධර්මය අනුන්ට විස්තරාත්මකව දේශනා කරයි. තමා ඇසූ පරිදි, ඉගෙන ගත් පරිදි, ධර්මය අනුන්ට විස්තරාත්මකව කටපාඩම් කරවයි. තමා ඇසූ පරිදි, ඉගෙන ගත් පරිදි, ධර්මය විස්තරාත්මකව සජ්ඣායනා කරයි. තමා ඇසූ පරිදි, ඉගෙන ගත් පරිදි, ධර්මය සිතින් අනු-විතර්ක කරයි, අනු-විචාරය කරයි, මනසින් අනුපේක්ෂා කරයි. බහුශ්‍රැත වූ, ආගමයන්හි නිපුණ වූ, ධර්මය දත්, විනය දත්, මාතිකා දත් ථේර භික්ෂූන් වහන්සේලා වාසය කරන ආවාසයක ඔහු වස් සමාදන් වෙයි. ඔහු කලින් කලට ඔවුන් වහන්සේලා වෙත පැමිණ, විමසීම් කරයි, ප්‍රශ්න අසයි – 'ස්වාමීනි, මෙය කෙසේද? මෙහි අර්ථය කුමක්ද?' ඔවුහු එම ආයුෂ්මතාණන් වහන්සේට නොපැහැදිලි දේ පැහැදිලි කරති, අප්‍රකට දේ ප්‍රකට කරති, විවිධ සැක උපදවන ධර්ම කාරණා පිළිබඳ සැක දුරු කරති. ආයුෂ්මත් ශාරිපුත්‍රයෙනි, මේ අයුරින්මයි භික්ෂුවක් නුඇසූ ධර්මයක් අසන්නේ, අසන ලද ධර්මය අමතක නොවන්නේ, පෙර සිතින් අත්විඳින ලද ධර්මයන් නැවත සිහියට එන්නේ, නොදන්නා දේ විශේෂයෙන් දැනගන්නේ.\"\n\n\"ආයුෂ්මතුනි, එය පුදුම සහගතය! ආයුෂ්මතුනි, එය අද්භූතය! ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ විසින් කෙතරම් මනාව මෙය දේශනා කර ඇත්ද! අපි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මෙම ධර්ම සය (ගුණාංග සය) සම්පූර්ණ කළ කෙනෙකු ලෙස දරමු. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ නියත වශයෙන්ම ධර්මය ඉගෙන ගනිති – සූත්‍ර, ගේය්‍ය, වෛය්‍යාකරණ, ගාථා, උදාන, ඉතිවුත්තක, ජාතක, අබ්භූතධම්ම, වේදල්ල යන නව අංග ශාසනය. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ තමා ඇසූ පරිදි, ඉගෙන ගත් පරිදි, ධර්මය අනුන්ට විස්තරාත්මකව දේශනා කරති. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ තමා ඇසූ පරිදි, ඉගෙන ගත් පරිදි, ධර්මය අනුන්ට විස්තරාත්මකව කටපාඩම් කරවති. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ තමා ඇසූ පරිදි, ඉගෙන ගත් පරිදි, ධර්මය විස්තරාත්මකව සජ්ඣායනා කරති. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ තමා ඇසූ පරිදි, ඉගෙන ගත් පරිදි, ධර්මය සිතින් අනු-විතර්ක කරති, අනු-විචාරය කරති, මනසින් අනුපේක්ෂා කරති. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ බහුශ්‍රැත වූ, ආගමයන්හි නිපුණ වූ, ධර්මය දත්, විනය දත්, මාතිකා දත් ථේර භික්ෂූන් වහන්සේලා වාසය කරන ආවාසයක වස් සමාදන් වෙති. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ කලින් කලට ඔවුන් වහන්සේලා වෙත පැමිණ, විමසීම් කරති, ප්‍රශ්න අසති – 'ස්වාමීනි, මෙය කෙසේද? මෙහි අර්ථය කුමක්ද?' ඔවුහු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට නොපැහැදිලි දේ පැහැදිලි කරති, අප්‍රකට දේ ප්‍රකට කරති, විවිධ සැක උපදවන ධර්ම කාරණා පිළිබඳ සැක දුරු කරති.\"",
      "paliTitle": "Ānandasuttaṃ",
      "englishTitle": "The Ānanda Sutta",
      "sinhalaTitle": "ආනන්ද සූත්‍රය"
    },
    {
      "number": 52,
      "pali": "Atha kho jāṇussoṇi [jāṇusoṇi (ka.)] brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘Khattiyā, bho gotama, kiṃadhippāyā, kiṃupavicārā, kiṃadhiṭṭhānā, kiṃabhinivesā, kiṃpariyosānā’’ti? ‘‘Khattiyā kho, brāhmaṇa, bhogādhippāyā paññūpavicārā balādhiṭṭhānā pathavībhinivesā issariyapariyosānā’’ti. ‘‘Brāhmaṇā pana, bho gotama, kiṃadhippāyā, kiṃupavicārā, kiṃadhiṭṭhānā, kiṃabhinivesā, kiṃpariyosānā’’ti? ‘‘Brāhmaṇā kho, brāhmaṇa, bhogādhippāyā paññūpavicārā mantādhiṭṭhānā yaññābhinivesā brahmalokapariyosānā’’ti. ‘‘Gahapatikā pana, bho gotama, kiṃadhippāyā, kiṃupavicārā, kiṃadhiṭṭhānā, kiṃabhinivesā, kiṃpariyosānā’’ti? ‘‘Gahapatikā kho, brāhmaṇa, bhogādhippāyā paññūpavicārā sippādhiṭṭhānā kammantābhinivesā niṭṭhitakammantapariyosānā’’ti. ‘‘Itthī pana, bho gotama, kiṃadhippāyā, kiṃupavicārā, kiṃadhiṭṭhānā, kiṃabhinivesā, kiṃpariyosānā’’ti? ‘‘Itthī kho, brāhmaṇa, purisādhippāyā alaṅkārūpavicārā puttādhiṭṭhānā asapatībhinivesā issariyapariyosānā’’ti. ‘‘Corā pana, bho gotama, kiṃadhippāyā, kiṃupavicārā, kiṃadhiṭṭhānā, kiṃabhinivesā, kiṃpariyosānā’’ti? ‘‘Corā kho, brāhmaṇa, ādānādhippāyā gahanūpavicārā satthādhiṭṭhānā andhakārābhinivesā adassanapariyosānā’’ti. ‘‘Samaṇā pana, bho gotama, kiṃadhippāyā, kiṃupavicārā, kiṃadhiṭṭhānā, kiṃabhinivesā, kiṃpariyosānā’’ti? ‘‘Samaṇā kho, brāhmaṇa, khantisoraccādhippāyā paññūpavicārā sīlādhiṭṭhānā ākiñcaññābhinivesā [akiñcanābhinivesā (syā. ka.)] nibbānapariyosānā’’ti. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Khattiyānampi bhavaṃ gotamo jānāti adhippāyañca upavicārañca adhiṭṭhānañca abhinivesañca pariyosānañca. Brāhmaṇānampi bhavaṃ gotamo jānāti…pe… gahapatīnampi bhavaṃ gotamo jānāti… itthīnampi bhavaṃ gotamo jānāti… corānampi bhavaṃ gotamo jānāti … samaṇānampi bhavaṃ gotamo jānāti adhippāyañca upavicārañca adhiṭṭhānañca abhinivesañca pariyosānañca. Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ.",
      "english": "Then the brahmin Jāṇussoṇi approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the courteous and memorable talk, he sat down to one side.\n\nAs he sat to one side, the brahmin Jāṇussoṇi said to the Blessed One: \"Reverend Gotama, what is the aim of warriors, what is their pursuit, what is their foundation, what is their strong adherence, and what is their ultimate goal?\"\n\n\"Warriors, brahmin, aim for wealth, pursue wisdom, are founded on strength, strongly adhere to dominion over land, and their ultimate goal is sovereignty.\"\n\n\"But brahmins, Reverend Gotama, what is their aim, what is their pursuit, what is their foundation, what is their strong adherence, and what is their ultimate goal?\"\n\n\"Brahmins, brahmin, aim for wealth, pursue wisdom, are founded on sacred texts, strongly adhere to sacrificial rites, and their ultimate goal is the Brahma-world.\"\n\n\"But householders, Reverend Gotama, what is their aim, what is their pursuit, what is their foundation, what is their strong adherence, and what is their ultimate goal?\"\n\n\"Householders, brahmin, aim for wealth, pursue wisdom, are founded on crafts, strongly adhere to their work, and their ultimate goal is the completion of their work.\"\n\n\"But women, Reverend Gotama, what is their aim, what is their pursuit, what is their foundation, what is their strong adherence, and what is their ultimate goal?\"\n\n\"Women, brahmin, aim for a man, pursue adornments, are founded on children, strongly adhere to being without rivals, and their ultimate goal is authority.\"\n\n\"But thieves, Reverend Gotama, what is their aim, what is their pursuit, what is their foundation, what is their strong adherence, and what is their ultimate goal?\"\n\n\"Thieves, brahmin, aim for plunder, pursue dense hiding places, are founded on weapons, strongly adhere to darkness, and their ultimate goal is not being seen.\"\n\n\"But ascetics, Reverend Gotama, what is their aim, what is their pursuit, what is their foundation, what is their strong adherence, and what is their ultimate goal?\"\n\n\"Ascetics, brahmin, aim for patience and gentleness, pursue wisdom, are founded on moral conduct, strongly adhere to non-possessiveness, and their ultimate goal is Nibbāna.\"\n\n\"Wonderful, Reverend Gotama! Amazing, Reverend Gotama! Reverend Gotama knows the aim, the pursuit, the foundation, the strong adherence, and the ultimate goal even of warriors. Reverend Gotama knows even of brahmins the aim, the pursuit, the foundation, the strong adherence, and the ultimate goal. Reverend Gotama knows even of householders the aim, the pursuit, the foundation, the strong adherence, and the ultimate goal. Reverend Gotama knows even of women the aim, the pursuit, the foundation, the strong adherence, and the ultimate goal. Reverend Gotama knows even of thieves the aim, the pursuit, the foundation, the strong adherence, and the ultimate goal. Reverend Gotama knows even of ascetics the aim, the pursuit, the foundation, the strong adherence, and the ultimate goal. Excellent, Reverend Gotama! Excellent, Reverend Gotama! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to carry a lamp into the darkness so that those with eyes could see forms, in the same way has Reverend Gotama made the Dhamma clear in various ways. Let Reverend Gotama accept me as a lay follower who has taken refuge from this day forth for as long as life lasts.\"",
      "sinhala": "ඉක්බිති ජාණුස්සෝණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කතාව නිමවා එක්පසෙක වාඩි විය.\n\nඑක්පසෙක වාඩි වී සිටි ජාණුස්සෝණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘භවත් ගෞතමයන් වහන්ස, ක්ෂත්‍රියයෝ කුමක් අරමුණු කොට ඇත්තාහුද, කුමක් විමර්ශනය කරන්නාහුද, කුමක් අධිෂ්ඨාන කොට ඇත්තාහුද, කුමක් කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහුද, කුමක් අවසානය කොට ඇත්තාහුද?’’\n\n‘‘බ්‍රාහ්මණය, ක්ෂත්‍රියයෝ භෝග සම්පත් අරමුණු කොට ඇත්තාහ. ප්‍රඥාව විමර්ශනය කරන්නාහ. බලය අධිෂ්ඨාන කොට ඇත්තාහ. පෘථිවිය (රාජ්‍යය) කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහ. ආධිපත්‍යය (ඉසුරු) අවසානය කොට ඇත්තාහ.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, එසේනම් බ්‍රාහ්මණයෝ කුමක් අරමුණු කොට ඇත්තාහුද, කුමක් විමර්ශනය කරන්නාහුද, කුමක් අධිෂ්ඨාන කොට ඇත්තාහුද, කුමක් කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහුද, කුමක් අවසානය කොට ඇත්තාහුද?’’\n\n‘‘බ්‍රාහ්මණය, බ්‍රාහ්මණයෝ භෝග සම්පත් අරමුණු කොට ඇත්තාහ. ප්‍රඥාව විමර්ශනය කරන්නාහ. මන්ත්‍ර අධිෂ්ඨාන කොට ඇත්තාහ. යඥා කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහ. බ්‍රහ්ම ලෝකය අවසානය කොට ඇත්තාහ.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, එසේනම් ගෘහපතියෝ කුමක් අරමුණු කොට ඇත්තාහුද, කුමක් විමර්ශනය කරන්නාහුද, කුමක් අධිෂ්ඨාන කොට ඇත්තාහුද, කුමක් කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහුද, කුමක් අවසානය කොට ඇත්තාහුද?’’\n\n‘‘බ්‍රාහ්මණය, ගෘහපතියෝ භෝග සම්පත් අරමුණු කොට ඇත්තාහ. ප්‍රඥාව විමර්ශනය කරන්නාහ. ශිල්පය අධිෂ්ඨාන කොට ඇත්තාහ. කර්මාන්ත කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහ. කර්මාන්ත නිමවීම අවසානය කොට ඇත්තාහ.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, එසේනම් ස්ත්‍රිය කුමක් අරමුණු කොට ඇත්තීද, කුමක් විමර්ශනය කරන්නීද, කුමක් අධිෂ්ඨාන කොට ඇත්තීද, කුමක් කෙරෙහි දැඩි ලෙස ඇලී සිටින්නේද, කුමක් අවසානය කොට ඇත්තීද?’’\n\n‘‘බ්‍රාහ්මණය, ස්ත්‍රිය පුරුෂයෙකු අරමුණු කොට ඇත්තීය. ආභරණ විමර්ශනය කරන්නීය. දරුවන් අධිෂ්ඨාන කොට ඇත්තීය. සපත්නියක් නැතිකම කෙරෙහි දැඩි ලෙස ඇලී සිටින්නීය. ආධිපත්‍යය (ගෘහ මූලිකත්වය) අවසානය කොට ඇත්තීය.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, එසේනම් චෝරයෝ කුමක් අරමුණු කොට ඇත්තාහුද, කුමක් විමර්ශනය කරන්නාහුද, කුමක් අධිෂ්ඨාන කොට ඇත්තාහුද, කුමක් කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහුද, කුමක් අවසානය කොට ඇත්තාහුද?’’\n\n‘‘බ්‍රාහ්මණය, චෝරයෝ සොරකම් කිරීම අරමුණු කොට ඇත්තාහ. සැඟවී සිටීම විමර්ශනය කරන්නාහ. ආයුධ අධිෂ්ඨාන කොට ඇත්තාහ. අඳුර කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහ. නොපෙනී සිටීම අවසානය කොට ඇත්තාහ.’’\n\n‘‘භවත් ගෞතමයන් වහන්ස, එසේනම් ශ්‍රමණයෝ කුමක් අරමුණු කොට ඇත්තාහුද, කුමක් විමර්ශනය කරන්නාහුද, කුමක් අධිෂ්ඨාන කොට ඇත්තාහුද, කුමක් කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහුද, කුමක් අවසානය කොට ඇත්තාහුද?’’\n\n‘‘බ්‍රාහ්මණය, ශ්‍රමණයෝ ඉවසීම සහ සන්සුන්කම අරමුණු කොට ඇත්තාහ. ප්‍රඥාව විමර්ශනය කරන්නාහ. සීලය අධිෂ්ඨාන කොට ඇත්තාහ. කිසිවක් නැතිකම (නිර්වස්තුක භාවය) කෙරෙහි දැඩි ලෙස ඇලී සිටින්නාහ. නිර්වාණය අවසානය කොට ඇත්තාහ.’’\n\n‘‘ආශ්චර්යයකි භවත් ගෞතමයන් වහන්ස, අද්භූතයකි භවත් ගෞතමයන් වහන්ස! ක්ෂත්‍රියයන්ගේද, බ්‍රාහ්මණයන්ගේද, ගෘහපතියන්ගේද, ස්ත්‍රීන්ගේද, චෝරයන්ගේද, ශ්‍රමණයන්ගේද අරමුණද, විමර්ශනයද, අධිෂ්ඨානයද, දැඩි ලෙස ඇලී සිටීමද, අවසානයද භවත් ගෞතමයන් වහන්සේ දන්නා සේක. භවත් ගෞතමයන් වහන්ස, ඉතා මනහරය, භවත් ගෞතමයන් වහන්ස, ඉතා මනහරය! යටිකුරු කළ දෙයක් උඩුකුරු කරන්නාක් මෙන් හෝ වැසූ දෙයක් හෙළි කරන්නාක් මෙන් හෝ මංමුළා වූවෙකුට මඟ පෙන්වන්නාක් මෙන් හෝ ඇස් ඇති අයට රූප දැක්වීම පිණිස අඳුරෙහි තෙල් පහනක් දරන්නාක් මෙන් භාග්‍යවතුන් වහන්සේ විසින් බොහෝ ආකාරයෙන් ධර්මය දේශනා කරන ලදී. ඒ මම භවත් ගෞතමයන් වහන්සේද ධර්මයද භික්ෂු සංඝයාද සරණ යමි. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Khattiyasuttaṃ",
      "englishTitle": "The Khattiya Discourse",
      "sinhalaTitle": "ඛත්තිය සූත‍්‍රය"
    },
    {
      "number": 53,
      "pali": "Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘Atthi nu kho, bho gotama, eko dhammo bhāvito bahulīkato yo ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ, yo ca attho samparāyiko’’ti? ‘‘Atthi kho, brāhmaṇa, eko dhammo bhāvito bahulīkato yo ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ, yo ca attho samparāyiko’’ti. ‘‘Katamo pana, bho gotama, eko dhammo bhāvito bahulīkato yo ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ, yo ca attho samparāyiko’’ti? ‘‘Appamādo kho, brāhmaṇa, eko dhammo bhāvito bahulīkato ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ, yo ca attho samparāyiko’’. ‘‘Seyyathāpi, brāhmaṇa, yāni kānici jaṅgalānaṃ [jaṅgamānaṃ (sī. pī.) a. ni. 10.15; ma. ni. 1.300] pāṇānaṃ padajātāni, sabbāni tāni hatthipade samodhānaṃ gacchanti; hatthipadaṃ tesaṃ aggamakkhāyati, yadidaṃ mahantattena. Evamevaṃ kho, brāhmaṇa, appamādo eko dhammo bhāvito bahulīkato ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ, yo ca attho samparāyiko. ‘‘Seyyathāpi, brāhmaṇa, kūṭāgārassa yā kāci gopānasiyo sabbā tā kūṭaṅgamā kūṭaninnā kūṭasamosaraṇā, kūṭaṃ tāsaṃ aggamakkhāyati; evamevaṃ kho, brāhmaṇa …pe…. ‘‘Seyyathāpi, brāhmaṇa, pabbajalāyako pabbajaṃ [babbajalāyako babbajaṃ (sī. pī.)] lāyitvā agge gahetvā odhunāti nidhunāti nicchādeti; evamevaṃ kho, brāhmaṇa…pe…. ‘‘Seyyathāpi, brāhmaṇa, ambapiṇḍiyā vaṇṭacchinnāya yāni kānici ambāni vaṇṭūpanibandhanāni sabbāni tāni tadanvayāni bhavanti; evamevaṃ kho, brāhmaṇa…pe…. ‘‘Seyyathāpi, brāhmaṇa, ye keci khuddarājāno [kuḍḍarājāno (sī. syā. aṭṭha.), kuddarājāno (pī.) a. ni. 10.15] sabbete rañño cakkavattissa anuyantā [anuyuttā (sī. syā. kaṃ. pī.)] bhavanti, rājā tesaṃ cakkavattī aggamakkhāyati; evamevaṃ kho, brāhmaṇa…pe…. ‘‘Seyyathāpi, brāhmaṇa, yā kāci tārakarūpānaṃ pabhā sabbā tā candassa pabhāya kalaṃ nāgghanti soḷasiṃ, candappabhā tāsaṃ aggamakkhāyati. Evamevaṃ kho, brāhmaṇa, appamādo eko dhammo bhāvito bahulīkato ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ yo ca attho samparāyiko. ‘‘Ayaṃ kho, brāhmaṇa, eko dhammo bhāvito bahulīkato ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ, yo ca attho samparāyiko’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Ekādasamaṃ.",
      "english": "Then a certain brahmin approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging cordial and memorable talk, he sat down to one side.\n\nSitting to one side, that brahmin said to the Blessed One: \"Is there, indeed, good Gotama, a single quality, developed and cultivated, that encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come?\"\n\n\"Indeed, brahmin, there is a single quality, developed and cultivated, that encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\"\n\n\"And what, good Gotama, is that single quality, developed and cultivated, that encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come?\"\n\n\"It is heedfulness, brahmin, that single quality, developed and cultivated, which encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\"\n\n\"Just as, brahmin, whatever footprints there are of creatures that walk, all of them fit within an elephant's footprint; the elephant's footprint is declared the foremost among them, in terms of its great size. In the same way, brahmin, heedfulness is that single quality, developed and cultivated, which encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\n\n\"Just as, brahmin, whatever rafters there are in a peaked house, all of them converge on the peak, incline towards the peak, meet at the peak; the peak is declared the foremost among them. In the same way, brahmin, heedfulness is that single quality, developed and cultivated, which encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\n\n\"Just as, brahmin, a reed-cutter, having cut the reeds, takes them by their tops, shakes them, cleans them thoroughly, and purifies them of unwanted parts. In the same way, brahmin, heedfulness is that single quality, developed and cultivated, which encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\n\n\"Just as, brahmin, when a cluster of mangoes is detached from its stalk, whatever mangoes were attached to that stalk, all of them fall accordingly. In the same way, brahmin, heedfulness is that single quality, developed and cultivated, which encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\n\n\"Just as, brahmin, whatever petty kings there are, all of them are subject to a universal monarch; the universal monarch is declared the foremost among them. In the same way, brahmin, heedfulness is that single quality, developed and cultivated, which encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\n\n\"Just as, brahmin, whatever radiance there is from the stars, all of it does not amount to a sixteenth part of the moon's radiance; the moon's radiance is declared the foremost among them. In the same way, brahmin, heedfulness is that single quality, developed and cultivated, which encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\n\n\"This, brahmin, is that single quality, developed and cultivated, which encompasses and maintains both kinds of welfare – welfare in this present life, and welfare in the life to come.\"\n\n\"Excellent, good Gotama! Excellent, good Gotama! Just as if one were to set upright what was overturned, or to reveal what was hidden, or to show the way to one who was lost, or to hold up a lamp in the darkness so that those with eyes could see forms – in the same way, the Dhamma has been made clear in many ways by the good Gotama. I go for refuge to the good Gotama, and to the Dhamma, and to the Sangha. May the good Gotama accept me as a lay follower who has gone for refuge from this day forward for as long as life lasts.\"",
      "sinhala": "එවිට එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. ප්‍රියශීලී, සිහිකටයුතු කථා බස් හුවමාරු කරගෙන, එකත්පසෙකින් වාඩි විය.\n\nඑකත්පසෙකින් වාඩි වී සිටි ඒ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භවත් ගෞතමයන් වහන්ස, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, මෙලොව අර්ථයද, පරලොව අර්ථයද යන අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතින එක් ධර්මයක් ඇද්ද?”\n\n“බ්‍රාහ්මණය, ඇත්තෙන්ම තිබේ. වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, මෙලොව අර්ථයද, පරලොව අර්ථයද යන අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතින එක් ධර්මයක් තිබේ.”\n\n“භවත් ගෞතමයන් වහන්ස, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, මෙලොව අර්ථයද, පරලොව අර්ථයද යන අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතින ඒ එක් ධර්මය කුමක්ද?”\n\n“බ්‍රාහ්මණය, අප්‍රමාදය නම් එක් ධර්මය, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, මෙලොව අර්ථයද, පරලොව අර්ථයද යන අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතී.”\n\n“බ්‍රාහ්මණය, යම්සේ වන සතුන්ගේ යම්කිසි පිය සටහන් ඇත්ද, ඒ සියල්ල ඇතාගේ පිය සටහනට ඇතුළත් වේ. ඒවා අතරින් ඇතාගේ පිය සටහන, විශාලත්වය නිසා, ප්‍රධාන ලෙස සැලකේ. එලෙසින්ම, බ්‍රාහ්මණය, අප්‍රමාදය නම් එක් ධර්මය, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, එය අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතී. එනම්, මෙලොව අර්ථයද, පරලොව අර්ථයද.”\n\n“බ්‍රාහ්මණය, යම්සේ කූටාගාරයක යම් රූස්සන් ඇත්ද, ඒ සියල්ල මූකල වෙතම ගමන් කරයි, මූකල වෙතම නැඹුරු වේ, මූකල වෙතම එක්රැස් වේ. ඒවා අතරින් මූකල ප්‍රධාන ලෙස සැලකේ. එලෙසින්ම, බ්‍රාහ්මණය, අප්‍රමාදය නම් එක් ධර්මය, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, එය අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතී. එනම්, මෙලොව අර්ථයද, පරලොව අර්ථයද.”\n\n“බ්‍රාහ්මණය, යම්සේ තණ අස්වන්නෙක් තණකොළ කපා, අග්‍රයෙන් අල්ලා සොලවා, ගසා, වෙන්කර හරින්නේද. එලෙසින්ම, බ්‍රාහ්මණය, අප්‍රමාදය නම් එක් ධර්මය, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, එය අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතී. එනම්, මෙලොව අර්ථයද, පරලොව අර්ථයද.”\n\n“බ්‍රාහ්මණය, යම්සේ ගොබෙන් කඩා දමන ලද අඹ පොකුරක් වේද, ඒ ගොබයට බැඳී ඇති යම් අඹ ගෙඩි ඇත්ද, ඒ සියල්ල එයටම අනුගත වේ. එලෙසින්ම, බ්‍රාහ්මණය, අප්‍රමාදය නම් එක් ධර්මය, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, එය අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතී. එනම්, මෙලොව අර්ථයද, පරලොව අර්ථයද.”\n\n“බ්‍රාහ්මණය, යම් කුඩා රජවරුන් ඇත්ද, ඒ සියල්ලෝම සක්විති රජුට යටත් වෙති. ඒ සියලු රජවරුන් අතර සක්විති රජු ප්‍රධාන ලෙස සැලකේ. එලෙසින්ම, බ්‍රාහ්මණය, අප්‍රමාදය නම් එක් ධර්මය, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, එය අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතී. එනම්, මෙලොව අර්ථයද, පරලොව අර්ථයද.”\n\n“බ්‍රාහ්මණය, යම්කිසි තාරකා රූපවල දීප්තියක් ඇත්ද, ඒ සියල්ල චන්ද්‍රයාගේ දීප්තියෙන් ෂෝඩශ කලා භාගයකටවත් වටින්නේ නැත. ඒවා අතරින් චන්ද්‍රයාගේ දීප්තිය ප්‍රධාන ලෙස සැලකේ. එලෙසින්ම, බ්‍රාහ්මණය, අප්‍රමාදය නම් එක් ධර්මය, වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, එය අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතී. එනම්, මෙලොව අර්ථයද, පරලොව අර්ථයද.”\n\n“බ්‍රාහ්මණය, මෙයයි වැඩූ විට, බහුල වශයෙන් පුරුදු කළ විට, මෙලොව අර්ථයද, පරලොව අර්ථයද යන අර්ථ දෙකම මනාකොට ඇතුළත් කරගෙන පවතින එක් ධර්මය.”\n\n“භවත් ගෞතමයන් වහන්ස, ඉතා මනහරයි! භවත් ගෞතමයන් වහන්ස, ඉතා මනහරයි! භවත් ගෞතමයන් වහන්ස, යම්සේ යටිකුරු කරන ලද්දක් උඩුකුරු කරන්නේද, වසා තබන ලද්දක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේද, ඇස් ඇති අයට රූප දැකීම සඳහා අන්ධකාරයේ තෙල් පහනක් දරන්නේද, එසේම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය දේශනා කරන ලදී. ඒ මම භවත් ගෞතමයන් වහන්සේත්, ධර්මයත්, භික්ෂු සංඝයාත් සරණ යමි. භවත් ගෞතමයන් වහන්සේ මා අද පටන් දිවි හිමි කොට සරණ ගිය උපාසකයකු ලෙස දරණ සේක්වා!”",
      "paliTitle": "Appamādasuttaṃ",
      "englishTitle": "Discourse on Heedfulness",
      "sinhalaTitle": "අප්‍රමාද සූත්‍රය"
    },
    {
      "number": 54,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena āyasmā dhammiko jātibhūmiyaṃ āvāsiko hoti sabbaso jātibhūmiyaṃ sattasu āvāsesu. Tatra sudaṃ āyasmā dhammiko āgantuke bhikkhū akkosati paribhāsati vihiṃsati vitudati roseti vācāya. Te ca āgantukā bhikkhū āyasmatā dhammikena akkosiyamānā paribhāsiyamānā vihesiyamānā vitudiyamānā rosiyamānā vācāya pakkamanti, na saṇṭhanti [na saṇṭhahanti (sī.)], riñcanti āvāsaṃ. Atha kho jātibhūmakānaṃ [jātibhūmikānaṃ (syā. pī. ka.)] upāsakānaṃ etadahosi – ‘‘mayaṃ kho bhikkhusaṅghaṃ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. Atha ca pana āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsaṃ. Ko nu kho hetu ko paccayo yena āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsa’’nti? Atha kho jātibhūmakānaṃ upāsakānaṃ etadahosi – ‘‘ayaṃ kho āyasmā dhammiko āgantuke bhikkhū akkosati paribhāsati vihiṃsati vitudati roseti vācāya. Te ca āgantukā bhikkhū āyasmatā dhammikena akkosiyamānā paribhāsiyamānā vihesiyamānā vitudiyamānā rosiyamānā vācāya pakkamanti, na saṇṭhanti, riñcanti āvāsaṃ. Yaṃnūna mayaṃ āyasmantaṃ dhammikaṃ pabbājeyyāmā’’ti. Atha kho jātibhūmakā upāsakā yena āyasmā dhammiko tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ dhammikaṃ etadavocuṃ – ‘‘pakkamatu, bhante, āyasmā dhammiko imamhā āvāsā; alaṃ te idha vāsenā’’ti. Atha kho āyasmā dhammiko tamhā āvāsā aññaṃ āvāsaṃ agamāsi. Tatrapi sudaṃ āyasmā dhammiko āgantuke bhikkhū akkosati paribhāsati vihiṃsati vitudati roseti vācāya. Te ca āgantukā bhikkhū āyasmatā dhammikena akkosiyamānā paribhāsiyamānā vihesiyamānā vitudiyamānā rosiyamānā vācāya pakkamanti, na saṇṭhanti, riñcanti āvāsaṃ. Atha kho jātibhūmakānaṃ upāsakānaṃ etadahosi – ‘‘mayaṃ kho bhikkhusaṅghaṃ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. Atha ca pana āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsaṃ. Ko nu kho hetu ko paccayo yena āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsa’’nti? Atha kho jātibhūmakānaṃ upāsakānaṃ etadahosi – ‘‘ayaṃ kho āyasmā dhammiko āgantuke bhikkhū akkosati paribhāsati vihiṃsati vitudati roseti vācāya. Te ca āgantukā bhikkhū āyasmatā dhammikena akkosiyamānā paribhāsiyamānā vihesiyamānā vitudiyamānā rosiyamānā vācāya pakkamanti, na saṇṭhanti, riñcanti āvāsaṃ. Yaṃnūna mayaṃ āyasmantaṃ dhammikaṃ pabbājeyyāmā’’ti. Atha kho jātibhūmakā upāsakā yenāyasmā dhammiko tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ dhammikaṃ etadavocuṃ – ‘‘pakkamatu, bhante, āyasmā dhammiko imamhāpi āvāsā; alaṃ te idha vāsenā’’ti. Atha kho āyasmā dhammiko tamhāpi āvāsā aññaṃ āvāsaṃ agamāsi. Tatrapi sudaṃ āyasmā dhammiko āgantuke bhikkhū akkosati paribhāsati vihiṃsati vitudati roseti vācāya. Te ca āgantukā bhikkhū āyasmatā dhammikena akkosiyamānā paribhāsiyamānā vihesiyamānā vitudiyamānā rosiyamānā vācāya pakkamanti, na saṇṭhanti, riñcanti āvāsaṃ. Atha kho jātibhūmakānaṃ upāsakānaṃ etadahosi – ‘‘mayaṃ kho bhikkhusaṅghaṃ paccupaṭṭhitā cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena. Atha ca pana āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsaṃ. Ko nu kho hetu ko paccayo yena āgantukā bhikkhū pakkamanti, na saṇṭhanti, riñcanti āvāsa’’nti? Atha kho jātibhūmakānaṃ upāsakānaṃ etadahosi – ‘‘ayaṃ kho āyasmā dhammiko āgantuke bhikkhū akkosati…pe…. Yaṃnūna mayaṃ āyasmantaṃ dhammikaṃ pabbājeyyāma sabbaso jātibhūmiyaṃ sattahi āvāsehī’’ti. Atha kho jātibhūmakā upāsakā yenāyasmā dhammiko tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ dhammikaṃ etadavocuṃ – ‘‘pakkamatu, bhante, āyasmā dhammiko sabbaso jātibhūmiyaṃ sattahi āvāsehī’’ti. Atha kho āyasmato dhammikassa etadahosi – ‘‘pabbājito khomhi jātibhūmakehi upāsakehi sabbaso jātibhūmiyaṃ sattahi āvāsehi. Kahaṃ nu kho dāni gacchāmī’’ti? Atha kho āyasmato dhammikassa etadahosi – ‘‘yaṃnūnāhaṃ yena bhagavā tenupasaṅkameyya’’nti. Atha kho āyasmā dhammiko pattacīvaramādāya yena rājagahaṃ tena pakkāmi. Anupubbena yena rājagahaṃ gijjhakūṭo pabbato yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ dhammikaṃ bhagavā etadavoca – ‘‘handa kuto nu tvaṃ, brāhmaṇa dhammika, āgacchasī’’ti? ‘‘Pabbājito ahaṃ, bhante, jātibhūmakehi upāsakehi sabbaso jātibhūmiyaṃ sattahi āvāsehī’’ti. ‘‘Alaṃ, brāhmaṇa dhammika, kiṃ te iminā, yaṃ taṃ tato tato pabbājenti, so tvaṃ tato tato pabbājito mameva santike āgacchasi’’. ‘‘Bhūtapubbaṃ, brāhmaṇa dhammika, sāmuddikā vāṇijā tīradassiṃ sakuṇaṃ gahetvā nāvāya samuddaṃ ajjhogāhanti. Te atīradakkhiṇiyā [atīradassaniyā (syā.), atīradassiyā (ka.)] nāvāya tīradassiṃ sakuṇaṃ muñcanti. So gacchateva puratthimaṃ disaṃ, gacchati pacchimaṃ disaṃ, gacchati uttaraṃ disaṃ, gacchati dakkhiṇaṃ disaṃ, gacchati uddhaṃ, gacchati anudisaṃ. Sace so samantā tīraṃ passati, tathāgatakova [tathāgato (ka.) dī. ni. 1.497 passitabbaṃ] hoti. Sace pana so samantā tīraṃ na passati tameva nāvaṃ paccāgacchati. Evamevaṃ kho, brāhmaṇa dhammika, yaṃ taṃ tato tato pabbājenti so tvaṃ tato tato pabbājito mameva santike āgacchasi. ‘‘Bhūtapubbaṃ, brāhmaṇa dhammika, rañño korabyassa suppatiṭṭho nāma nigrodharājā ahosi pañcasākho sītacchāyo manoramo. Suppatiṭṭhassa kho pana, brāhmaṇa dhammika, nigrodharājassa dvādasayojanāni abhiniveso ahosi, pañca yojanāni mūlasantānakānaṃ. Suppatiṭṭhassa kho pana, brāhmaṇa dhammika, nigrodharājassa tāva mahantāni phalāni ahesuṃ; seyyathāpi nāma āḷhakathālikā. Evamassa sādūni phalāni ahesuṃ; seyyathāpi nāma khuddaṃ madhuṃ anelakaṃ. Suppatiṭṭhassa kho pana, brāhmaṇa dhammika, nigrodharājassa ekaṃ khandhaṃ rājā paribhuñjati saddhiṃ itthāgārena, ekaṃ khandhaṃ balakāyo paribhuñjati, ekaṃ khandhaṃ negamajānapadā paribhuñjanti, ekaṃ khandhaṃ samaṇabrāhmaṇā paribhuñjanti, ekaṃ khandhaṃ migā [migapakkhino (sī. syā. pī.)] paribhuñjanti. Suppatiṭṭhassa kho pana, brāhmaṇa dhammika, nigrodharājassa na koci phalāni rakkhati, na ca sudaṃ [na ca puna (ka.)] aññamaññassa phalāni hiṃsanti. ‘‘Atha kho, brāhmaṇa dhammika, aññataro puriso suppatiṭṭhassa nigrodharājassa yāvadatthaṃ phalāni bhakkhitvā sākhaṃ bhañjitvā pakkāmi. Atha kho, brāhmaṇa dhammika, suppatiṭṭhe nigrodharāje adhivatthāya devatāya etadahosi – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho! Yāva pāpo manusso [yāva pāpamanusso (syā.), yāvatā pāpamanusso (ka.)], yatra hi nāma suppatiṭṭhassa nigrodharājassa yāvadatthaṃ phalāni bhakkhitvā sākhaṃ bhañjitvā pakkamissati, yaṃnūna suppatiṭṭho nigrodharājā āyatiṃ phalaṃ na dadeyyā’ti. Atha kho, brāhmaṇa dhammika, suppatiṭṭho nigrodharājā āyatiṃ phalaṃ na adāsi. ‘‘Atha kho, brāhmaṇa dhammika, rājā korabyo yena sakko devānamindo tenupasaṅkami; upasaṅkamitvā sakkaṃ devānamindaṃ etadavoca – ‘yagghe, mārisa, jāneyyāsi suppatiṭṭho nigrodharājā phalaṃ na detī’ti? Atha kho, brāhmaṇa dhammika, sakko devānamindo tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsi [abhisaṅkhāresi (syā. ka.)], yathā bhusā vātavuṭṭhi āgantvā suppatiṭṭhaṃ nigrodharājaṃ pavattesi [pātesi (sī. pī.)] ummūlamakāsi. Atha kho, brāhmaṇa dhammika, suppatiṭṭhe nigrodharāje adhivatthā devatā dukkhī dummanā assumukhī rudamānā ekamantaṃ aṭṭhāsi. ‘‘Atha kho, brāhmaṇa dhammika, sakko devānamindo yena suppatiṭṭhe nigrodharāje adhivatthā devatā tenupasaṅkami; upasaṅkamitvā suppatiṭṭhe nigrodharāje adhivatthaṃ devataṃ etadavoca – ‘kiṃ nu tvaṃ, devate, dukkhī dummanā assumukhī rudamānā ekamantaṃ ṭhitā’ti? ‘Tathā hi pana me, mārisa, bhusā vātavuṭṭhi āgantvā bhavanaṃ pavattesi ummūlamakāsī’ti. ‘Api nu tvaṃ, devate, rukkhadhamme ṭhitāya bhusā vātavuṭṭhi āgantvā bhavanaṃ pavattesi ummūlamakāsī’ti? ‘Kathaṃ pana, mārisa, rukkho rukkhadhamme ṭhito hotī’ti? ‘Idha, devate, rukkhassa mūlaṃ mūlatthikā haranti, tacaṃ tacatthikā haranti, pattaṃ pattatthikā haranti, pupphaṃ pupphatthikā haranti, phalaṃ phalatthikā haranti. Na ca tena devatāya anattamanatā vā anabhinandi [anabhiraddhi (sī.)] vā karaṇīyā. Evaṃ kho, devate, rukkho rukkhadhamme ṭhito hotī’ti. ‘Aṭṭhitāyeva kho me, mārisa, rukkhadhamme bhusā vātavuṭṭhi āgantvā bhavanaṃ pavattesi ummūlamakāsī’ti. ‘Sace kho tvaṃ, devate, rukkhadhamme tiṭṭheyyāsi, siyā [siyāpi (sī. pī.)] te bhavanaṃ yathāpure’ti? ‘Ṭhassāmahaṃ, [tiṭṭheyyāmahaṃ (syā.)] mārisa, rukkhadhamme, hotu me bhavanaṃ yathāpure’’’ti. ‘‘Atha kho, brāhmaṇa dhammika, sakko devānamindo tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsi [abhisaṅkhāri (syā. ka.)], yathā bhusā vātavuṭṭhi āgantvā suppatiṭṭhaṃ nigrodharājaṃ ussāpesi, sacchavīni mūlāni ahesuṃ. Evamevaṃ kho, brāhmaṇa dhammika, api nu taṃ samaṇadhamme ṭhitaṃ jātibhūmakā upāsakā pabbājesuṃ sabbaso jātibhūmiyaṃ sattahi āvāsehī’’ti? ‘‘Kathaṃ pana, bhante, samaṇo samaṇadhamme ṭhito hotī’’ti? ‘‘Idha, brāhmaṇa dhammika, samaṇo akkosantaṃ na paccakkosati, rosantaṃ na paṭirosati, bhaṇḍantaṃ na paṭibhaṇḍati. Evaṃ kho, brāhmaṇa dhammika, samaṇo samaṇadhamme ṭhito hotī’’ti. ‘‘Aṭṭhitaṃyeva maṃ, bhante, samaṇadhamme jātibhūmakā upāsakā pabbājesuṃ sabbaso jātibhūmiyaṃ sattahi āvāsehī’’ti. [a. ni. 7.66; 7.73] ‘‘Bhūtapubbaṃ, brāhmaṇa dhammika, sunetto nāma satthā ahosi titthakaro kāmesu vītarāgo. Sunettassa kho pana, brāhmaṇa dhammika, satthuno anekāni sāvakasatāni ahesuṃ. Sunetto satthā sāvakānaṃ brahmalokasahabyatāya dhammaṃ desesi. Ye kho pana, brāhmaṇa dhammika, sunettassa satthuno brahmalokasahabyatāya dhammaṃ desentassa cittāni na pasādesuṃ te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjiṃsu. Ye kho pana, brāhmaṇa dhammika, sunettassa satthuno brahmalokasahabyatāya dhammaṃ desentassa cittāni pasādesuṃ te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjiṃsu. ‘‘Bhūtapubbaṃ, brāhmaṇa dhammika, mūgapakkho nāma satthā ahosi…pe… aranemi nāma satthā ahosi… kuddālako nāma satthā ahosi… hatthipālo nāma satthā ahosi… jotipālo nāma satthā ahosi titthakaro kāmesu vītarāgo. Jotipālassa kho pana, brāhmaṇa dhammika, satthuno anekāni sāvakasatāni ahesuṃ. Jotipālo satthā sāvakānaṃ brahmalokasahabyatāya dhammaṃ desesi. Ye kho pana, brāhmaṇa dhammika, jotipālassa satthuno brahmalokasahabyatāya dhammaṃ desentassa cittāni na pasādesuṃ te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjiṃsu. Ye kho pana, brāhmaṇa dhammika, jotipālassa satthuno brahmalokasahabyatāya dhammaṃ desentassa cittāni pasādesuṃ te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjiṃsu. ‘‘Taṃ kiṃ maññasi, brāhmaṇa dhammika, yo ime cha satthāre titthakare kāmesu vītarāge, anekasataparivāre sasāvakasaṅghe paduṭṭhacitto akkoseyya paribhāseyya, bahuṃ so apuññaṃ pasaveyyā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Yo kho, brāhmaṇa dhammika, ime cha satthāre titthakare kāmesu vītarāge anekasataparivāre sasāvakasaṅghe paduṭṭhacitto akkoseyya paribhāseyya, bahuṃ so apuññaṃ pasaveyya. Yo ekaṃ diṭṭhisampannaṃ puggalaṃ paduṭṭhacitto akkosati paribhāsati, ayaṃ tato bahutaraṃ apuññaṃ pasavati. Taṃ kissa hetu? Nāhaṃ, brāhmaṇa dhammika, ito bahiddhā evarūpiṃ khantiṃ [evarūpaṃ khantaṃ (syā.)] vadāmi, yathāmaṃ sabrahmacārīsu. Tasmātiha, brāhmaṇa dhammika, evaṃ sikkhitabbaṃ – ‘na no samasabrahmacārīsu [na no āmasabrahmacārīsu (syā.), na no sabrahmacārīsu (sī. pī.)] cittāni paduṭṭhāni bhavissantī’’’ti. Evañhi te, brāhmaṇa dhammika, sikkhitabbanti. ‘‘Sunetto mūgapakkho ca, aranemi ca brāhmaṇo; Kuddālako ahu satthā, hatthipālo ca māṇavo. ‘‘Jotipālo ca govindo, ahu sattapurohito; Ahiṃsakā [abhisekā (syā.)] atītaṃse, cha satthāro yasassino. ‘‘Nirāmagandhā karuṇedhimuttā [vimuttā (sī. syā. pī.)], kāmasaṃyojanātigā [kāmasaṃyojanātitā (syā.)]; Kāmarāgaṃ virājetvā, brahmalokūpagā ahuṃ [ahu (bahūsu), ahū (ka. sī.)]. ‘‘Ahesuṃ sāvakā tesaṃ, anekāni satānipi; Nirāmagandhā karuṇedhimuttā, kāmasaṃyojanātigā; Kāmarāgaṃ virājetvā, brahmalokūpagā ahuṃ [ahu (bahūsu), ahū (ka. sī.)]. ‘‘Yete isī bāhirake, vītarāge samāhite; Paduṭṭhamanasaṅkappo, yo naro paribhāsati; Bahuñca so pasavati, apuññaṃ tādiso naro. ‘‘Yo cekaṃ diṭṭhisampannaṃ, bhikkhuṃ buddhassa sāvakaṃ; Paduṭṭhamanasaṅkappo, yo naro paribhāsati; Ayaṃ tato bahutaraṃ, apuññaṃ pasave naro. ‘‘Na sādhurūpaṃ āsīde, diṭṭhiṭṭhānappahāyinaṃ; Sattamo puggalo eso, ariyasaṅghassa vuccati. ‘‘Avītarāgo kāmesu, yassa pañcindriyā mudū; Saddhā sati ca vīriyaṃ, samatho ca vipassanā. ‘‘Tādisaṃ bhikkhumāsajja, pubbeva upahaññati; Attānaṃ upahantvāna, pacchā aññaṃ vihiṃsati. ‘‘Yo ca rakkhati attānaṃ, rakkhito tassa bāhiro; Tasmā rakkheyya attānaṃ, akkhato paṇḍito sadā’’ti. dvādasamaṃ; ",
      "english": "At one time, the Blessed One was staying near Rājagaha, on Vulture Peak Mountain. Now, at that time, the Venerable Dhammika was residing throughout Jātibhūmi, in all seven of its residences. And there, the Venerable Dhammika would abuse, revile, torment, harass, and verbally insult the visiting monastics. And those visiting monastics, being abused, reviled, tormented, harassed, and verbally insulted by the Venerable Dhammika, would depart, not staying, abandoning the residence. Then it occurred to the lay followers of Jātibhūmi: \"Indeed, we consistently attend to the monastic community, providing them with robes, alms food, monastic dwellings, and all necessary requisites including medicines for the sick. Yet, the visiting monastics depart, they do not remain, they abandon the residence. What, then, is the reason, what is the cause, for which the visiting monastics depart, do not remain, and abandon the residence?\" Then it occurred to the lay followers of Jātibhūmi: \"This Venerable Dhammika abuses, reviles, torments, harasses, and verbally insults the visiting monastics. And those visiting monastics, being abused, reviled, tormented, harassed, and verbally insulted by the Venerable Dhammika, depart, not remaining, abandoning the residence. What if we were to expel the Venerable Dhammika?\" Then the lay followers of Jātibhūmi approached the Venerable Dhammika; having approached him, they said to him: \"Venerable Dhammika, Venerable sir, please depart from this residence; your stay here is sufficient.\"\n\nThen the Venerable Dhammika went from that residence to another residence. And there too, the Venerable Dhammika would abuse, revile, torment, harass, and verbally insult the visiting monastics. And those visiting monastics, being abused, reviled, tormented, harassed, and verbally insulted by the Venerable Dhammika, would leave, not staying, abandoning the residence. Then it occurred to the lay followers of Jātibhūmi: \"Indeed, we consistently attend to the monastic community, providing them with robes, alms food, monastic dwellings, and all necessary requisites including medicines for the sick. Yet, the visiting monastics depart, they do not remain, they abandon the residence. What, then, is the reason, what is the cause, for which the visiting monastics depart, do not remain, and abandon the residence?\" Then it occurred to the lay followers of Jātibhūmi: \"This Venerable Dhammika abuses, reviles, torments, harasses, and verbally insults the visiting monastics. And those visiting monastics, being abused, reviled, tormented, harassed, and verbally insulted by the Venerable Dhammika, depart, not remaining, abandoning the residence. What if we were to expel the Venerable Dhammika?\" Then the lay followers of Jātibhūmi approached the Venerable Dhammika; having approached him, they said to him: \"Venerable Dhammika, Venerable sir, please depart from this residence also; your stay here is sufficient.\"\n\nThen the Venerable Dhammika went from that residence also to another residence. And there too, the Venerable Dhammika would abuse, revile, torment, harass, and verbally insult the visiting monastics. And those visiting monastics, being abused, reviled, tormented, harassed, and verbally insulted by the Venerable Dhammika, would leave, not staying, abandoning the residence. Then it occurred to the lay followers of Jātibhūmi: \"Indeed, we consistently attend to the monastic community, providing them with robes, alms food, monastic dwellings, and all necessary requisites including medicines for the sick. Yet, the visiting monastics depart, they do not remain, they abandon the residence. What, then, is the reason, what is the cause, for which the visiting monastics depart, do not remain, and abandon the residence?\" Then it occurred to the lay followers of Jātibhūmi: \"This Venerable Dhammika abuses, reviles, torments, harasses, and verbally insults the visiting monastics. And those visiting monastics, being abused, reviled, tormented, harassed, and verbally insulted by the Venerable Dhammika, depart, not remaining, abandoning the residence. What if we were to expel the Venerable Dhammika from all seven residences throughout Jātibhūmi?\" Then the lay followers of Jātibhūmi approached the Venerable Dhammika; having approached him, they said to him: \"Venerable Dhammika, Venerable sir, please depart from all seven residences throughout Jātibhūmi.\" Then it occurred to the Venerable Dhammika: \"Indeed, I have been expelled by the lay followers of Jātibhūmi from all seven residences throughout Jātibhūmi. Where shall I go now?\" Then it occurred to the Venerable Dhammika: \"What if I were to approach the Blessed One?\" Then the Venerable Dhammika, taking his bowl and robe, set out for Rājagaha. In due course, he approached the Blessed One at Rājagaha, on Vulture Peak Mountain; having approached and respectfully saluted the Blessed One, he sat down to one side.\n\nAs Venerable Dhammika sat to one side, the Blessed One said to him: \"Now, Brāhmaṇa Dhammika, where have you come from?\"\n\"Venerable Sir, I have been expelled by the native lay followers from all seven residences in my native land.\"\n\"Enough, Brāhmaṇa Dhammika, what is this to you, that they expel you from one place after another? Having been expelled from here and there, you come to me alone.\"\n\n\"In the past, Brāhmaṇa Dhammika, sea-faring merchants would take a land-sighting bird and launch their ship into the ocean. When their ship was out of sight of land, they would release the land-sighting bird. It would fly towards the east, it would fly towards the west, it would fly towards the north, it would fly towards the south, it would fly upwards, it would fly in the intermediate directions. If it saw land anywhere around, it would head directly there. But if it saw no land anywhere around, it would return to that very ship. In the same way, Brāhmaṇa Dhammika, when they expel you from one place after another, you, having been expelled from here and there, come to me alone.\"\n\n\"In the past, Brāhmaṇa Dhammika, there was a king of banyan trees named Suppatiṭṭha, belonging to King Korabya. It had five branches, provided cool shade, and was delightful. Now, Brāhmaṇa Dhammika, that king of banyan trees, Suppatiṭṭha, occupied an area of twelve leagues and its root system spread for five leagues. The fruits of that king of banyan trees, Suppatiṭṭha, Brāhmaṇa Dhammika, were as large as pots for measuring grain. And its fruits were as sweet as pure, unadulterated honey. Now, Brāhmaṇa Dhammika, one branch of that king of banyan trees, Suppatiṭṭha, was enjoyed by the king together with his harem; one branch was enjoyed by the army; one branch was enjoyed by the townsfolk and countryfolk; one branch was enjoyed by ascetics and brahmans; and one branch was enjoyed by animals. No one guarded the fruits of that king of banyan trees, Suppatiṭṭha, Brāhmaṇa Dhammika, nor did anyone harm another's fruits. Then, Brāhmaṇa Dhammika, a certain man ate as many fruits as he wished from the king of banyan trees, Suppatiṭṭha, broke a branch, and went away. Then, Brāhmaṇa Dhammika, the deity dwelling in the king of banyan trees, Suppatiṭṭha, thought: 'Oh, how astonishing! Oh, how amazing! How wicked this person is! He ate as many fruits as he wished from the king of banyan trees, Suppatiṭṭha, broke a branch, and went away! What if the king of banyan trees, Suppatiṭṭha, were not to bear fruit in the future?' So, Brāhmaṇa Dhammika, the king of banyan trees, Suppatiṭṭha, bore no more fruit in the future.\"\n\n\"Then, Brāhmaṇa Dhammika, King Korabya approached Sakka, ruler of devas. Having approached, he said to Sakka, ruler of devas: 'Pray, venerable sir, be aware that the king of banyan trees, Suppatiṭṭha, is not bearing fruit!' Then, Brāhmaṇa Dhammika, Sakka, ruler of devas, manifested such a display of psychic power that a fierce storm came, caused the king of banyan trees, Suppatiṭṭha, to fall, and uprooted it. Then, Brāhmaṇa Dhammika, the deity dwelling in the king of banyan trees, Suppatiṭṭha, stood to one side, distressed, dejected, tearful, and weeping.\"\n\n\"Then, Brāhmaṇa Dhammika, Sakka, ruler of devas, approached the deity dwelling in the king of banyan trees, Suppatiṭṭha. Having approached, he said to the deity dwelling in the king of banyan trees: 'Why, deity, are you standing to one side, distressed, dejected, tearful, and weeping?' 'Indeed, venerable sir, a fierce storm came, caused my dwelling to fall, and uprooted it.' 'But, deity, were you abiding in the way of trees when a fierce storm came, caused your dwelling to fall, and uprooted it?' 'How, venerable sir, does a tree abide in the way of trees?' 'Here, deity, those who seek roots take the tree's roots; those who seek bark take its bark; those who seek leaves take its leaves; those who seek flowers take its flowers; those who seek fruit take its fruit. And by that, the deity should feel neither displeasure nor dissatisfaction. This, deity, is how a tree abides in the way of trees.' 'Indeed, venerable sir, it was because I was not abiding in the way of trees that a fierce storm came, caused my dwelling to fall, and uprooted it.' 'If you had indeed abided in the way of trees, deity, your dwelling would still be as it was before.'\n\n\"I shall remain, good sir, in the nature of a tree; let my dwelling be as before.\"\n\nThen, O righteous brahmin, Sakka, the lord of devas, performed such a feat of psychic power that a fierce storm of wind and rain came and uprooted a well-established royal banyan tree, revealing its bare roots. In the same way, O righteous brahmin, did the lay followers of your native land drive you, who were established in the ascetic's way of life, completely out of your native land with seven settlements?\n\n\"But how, venerable sir, is an ascetic established in the ascetic's way of life?\"\n\n\"Here, O righteous brahmin, an ascetic does not insult back one who insults him; he does not rage back at one who rages at him; he does not quarrel back with one who quarrels with him. It is in this way, O righteous brahmin, that an ascetic is established in the ascetic's way of life.\"\n\n\"Venerable sir, it was while I was not established in the ascetic's way of life that the lay followers of my native land drove me completely out of my native land with seven settlements.\"\n\n\"Once upon a time, O righteous brahmin, there was a teacher named Sunetto, an independent founder of a religious path, free from sensual passion. That teacher Sunetto, O righteous brahmin, had many hundreds of disciples. Teacher Sunetto taught the Dhamma to his disciples for the sake of companionship with the Brahmā world. Those, O righteous brahmin, who did not gladden their minds when teacher Sunetto was teaching the Dhamma for the sake of companionship with the Brahmā world, upon the breaking up of the body, after death, reappeared in the state of woe, a bad destination, a downfall, in hell. But those, O righteous brahmin, who gladdened their minds when teacher Sunetto was teaching the Dhamma for the sake of companionship with the Brahmā world, upon the breaking up of the body, after death, reappeared in a good destination, in the heavenly world.\n\n\"Once upon a time, O righteous brahmin, there was a teacher named Mūgapakkha... there was a teacher named Araṇemi... there was a teacher named Kuddālaka... there was a teacher named Hatthipāla... there was a teacher named Jotīpāla, an independent founder of a religious path, free from sensual passion. That teacher Jotīpāla, O righteous brahmin, had many hundreds of disciples. Teacher Jotīpāla taught the Dhamma to his disciples for the sake of companionship with the Brahmā world. Those, O righteous brahmin, who did not gladden their minds when teacher Jotīpāla was teaching the Dhamma for the sake of companionship with the Brahmā world, upon the breaking up of the body, after death, reappeared in the state of woe, a bad destination, a downfall, in hell. But those, O righteous brahmin, who gladdened their minds when teacher Jotīpāla was teaching the Dhamma for the sake of companionship with the Brahmā world, upon the breaking up of the body, after death, reappeared in a good destination, in the heavenly world.\n\n\"What do you think, O righteous brahmin? If someone were, with a corrupt mind, to insult and abuse these six teachers, independent founders of religious paths, free from sensual passion, surrounded by hundreds of disciples with their communities of disciples, would he accrue much demerit?\"\n\n\"Yes, venerable sir.\"\n\n\"Indeed, O righteous brahmin, if someone were, with a corrupt mind, to insult and abuse these six teachers, independent founders of religious paths, free from sensual passion, surrounded by hundreds of disciples with their communities of disciples, he would accrue much demerit. But if someone, with a corrupt mind, insults and abuses a single individual who is accomplished in right view, that person accrues even greater demerit than that. And why is that? O righteous brahmin, I do not speak of such forbearance outside of this teaching as I do among my fellow monastics. Therefore, O righteous brahmin, you should train yourselves thus: 'Our minds shall not be corrupted towards our fellow monastics.' Thus, O righteous brahmin, you should train yourselves.\n\nSunetto, and Mūgapakkha, and the brahmin Araṇemi;\nKuddālaka was a teacher, and Hatthipāla, a young man.\n\nAnd Jotīpāla, a cowherd, was a royal chaplain.\nThese six renowned teachers in the past were non-violent.\n\nUndefiled by defilements, liberated by compassion,\nHaving transcended the fetters of sensual desire;\nHaving eradicated sensual lust, they ascended to the Brahmā world.\n\nTheir disciples were also many hundreds.\nUndefiled by defilements, liberated by compassion,\nHaving transcended the fetters of sensual desire;\nHaving eradicated sensual lust, they ascended to the Brahmā world.\n\nThat person who, with a corrupt intention, abuses these external sages\nWho are free from passion and composed in mind,\nSuch a person accrues much demerit.\n\nBut the person who, with a corrupt intention,\nAbuses a single bhikkhu, a disciple of the Buddha,\nWho is accomplished in right view,\nThat person accrues even greater demerit than that.\n\nOne should not approach ignoble conduct towards one who has abandoned fixed views.\nThis seventh individual is said to belong to the Noble Sangha.\n\nOne who is not free from sensual passion, whose five spiritual faculties are weak:\nFaith, mindfulness, energy, tranquility, and insight.\n\nWhoever assails such a monk first harms themselves. Having harmed themselves, they then harm others.\n\nAnd whoever protects themselves, for them, others are also protected. Therefore, the wise person should always protect themselves, remaining unharmed.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ සම්පූර්ණයෙන්ම ජාතිභූමියෙහි වූ වාසස්ථාන හතෙහිම වාසය කරන භික්ෂුවක් වූ සේක. එහිදී ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ පැමිණි භික්ෂූන්ට වචනයෙන් බැණ වදින සේක, නින්දා කරන සේක, හිංසා කරන සේක, දොස් පවසන සේක, කෝපයට පත් කරන සේක. ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ විසින් වචනයෙන් බැණ වදිනු ලබන, නින්දා කරනු ලබන, හිංසා කරනු ලබන, දොස් පවසනු ලබන, කෝපයට පත් කරනු ලබන එම පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති.\n\nඑවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරුන්ට මෙබඳු අදහසක් ඇති විය: ‘‘අපි සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර යන සිව්පසයෙන් භික්ෂූසංඝයාට උපස්ථාන කරන්නෙමු. එසේ තිබියදීත්, පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති. පැමිණි භික්ෂූන් නික්ම යෑමටත්, එහි නොරැඳීමටත්, වාසස්ථානය අත්හැරීමටත් හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’’ එවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරුන්ට මෙබඳු අදහසක් ඇති විය: ‘‘ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ පැමිණි භික්ෂූන්ට වචනයෙන් බැණ වදින සේක, නින්දා කරන සේක, හිංසා කරන සේක, දොස් පවසන සේක, කෝපයට පත් කරන සේක. ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ විසින් වචනයෙන් බැණ වදිනු ලබන, නින්දා කරනු ලබන, හිංසා කරනු ලබන, දොස් පවසනු ලබන, කෝපයට පත් කරනු ලබන එම පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති. එසේ නම් අපි ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේට මෙම ආවාසයෙන් පිටත් කර හරින්නෙමුදැයි.’’ එවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරු ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ වෙත පැමිණියහ; පැමිණ, ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේට මෙසේ පැවසූහ: ‘‘පින්වතුන් වහන්ස, ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ මෙම ආවාසයෙන් නික්ම යන සේක්වා; ඔබට මෙහි වාසය කිරීම සුදුසු නැත.’’\n\nඑවිට ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ එම ආවාසයෙන් වෙනත් ආවාසයකට වැඩම කළ සේක. එහිදීද ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ පැමිණි භික්ෂූන්ට වචනයෙන් බැණ වදින සේක, නින්දා කරන සේක, හිංසා කරන සේක, දොස් පවසන සේක, කෝපයට පත් කරන සේක. ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ විසින් වචනයෙන් බැණ වදිනු ලබන, නින්දා කරනු ලබන, හිංසා කරනු ලබන, දොස් පවසනු ලබන, කෝපයට පත් කරනු ලබන එම පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති.\n\nඑවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරුන්ට මෙබඳු අදහසක් ඇති විය: ‘‘අපි සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර යන සිව්පසයෙන් භික්ෂූසංඝයාට උපස්ථාන කරන්නෙමු. එසේ තිබියදීත්, පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති. පැමිණි භික්ෂූන් නික්ම යෑමටත්, එහි නොරැඳීමටත්, වාසස්ථානය අත්හැරීමටත් හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’’ එවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරුන්ට මෙබඳු අදහසක් ඇති විය: ‘‘ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ පැමිණි භික්ෂූන්ට වචනයෙන් බැණ වදින සේක, නින්දා කරන සේක, හිංසා කරන සේක, දොස් පවසන සේක, කෝපයට පත් කරන සේක. ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ විසින් වචනයෙන් බැණ වදිනු ලබන, නින්දා කරනු ලබන, හිංසා කරනු ලබන, දොස් පවසනු ලබන, කෝපයට පත් කරනු ලබන එම පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති. එසේ නම් අපි ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේට මෙම ආවාසයෙන් පිටත් කර හරින්නෙමුදැයි.’’ එවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරු ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ වෙත පැමිණියහ; පැමිණ, ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේට මෙසේ පැවසූහ: ‘‘පින්වතුන් වහන්ස, ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ මෙම ආවාසයෙන්ද නික්ම යන සේක්වා; ඔබට මෙහි වාසය කිරීම සුදුසු නැත.’’\n\nඑවිට ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ එම ආවාසයෙන්ද වෙනත් ආවාසයකට වැඩම කළ සේක. එහිදීද ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ පැමිණි භික්ෂූන්ට වචනයෙන් බැණ වදින සේක, නින්දා කරන සේක, හිංසා කරන සේක, දොස් පවසන සේක, කෝපයට පත් කරන සේක. ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ විසින් වචනයෙන් බැණ වදිනු ලබන, නින්දා කරනු ලබන, හිංසා කරනු ලබන, දොස් පවසනු ලබන, කෝපයට පත් කරනු ලබන එම පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති.\n\nඑවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරුන්ට මෙබඳු අදහසක් ඇති විය: ‘‘අපි සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර යන සිව්පසයෙන් භික්ෂූසංඝයාට උපස්ථාන කරන්නෙමු. එසේ තිබියදීත්, පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති. පැමිණි භික්ෂූන් නික්ම යෑමටත්, එහි නොරැඳීමටත්, වාසස්ථානය අත්හැරීමටත් හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’’ එවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරුන්ට මෙබඳු අදහසක් ඇති විය: ‘‘ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ පැමිණි භික්ෂූන්ට වචනයෙන් බැණ වදින සේක, නින්දා කරන සේක, හිංසා කරන සේක, දොස් පවසන සේක, කෝපයට පත් කරන සේක. ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ විසින් වචනයෙන් බැණ වදිනු ලබන, නින්දා කරනු ලබන, හිංසා කරනු ලබන, දොස් පවසනු ලබන, කෝපයට පත් කරනු ලබන එම පැමිණි භික්ෂූහු නික්ම යති, එහි නොරැඳෙති, වාසස්ථානය අත්හරිති. එසේ නම් අපි ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේට ජාතිභූමියෙහි පිහිටි වාසස්ථාන හතෙන්ම පිටත් කර හරින්නෙමුදැයි.’’ එවිට ජාතිභූමියෙහි වාසය කරන උපාසකවරු ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ වෙත පැමිණියහ; පැමිණ, ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේට මෙසේ පැවසූහ: ‘‘පින්වතුන් වහන්ස, ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ ජාතිභූමියෙහි පිහිටි වාසස්ථාන හතෙන්ම නික්ම යන සේක්වා.’’\n\nඑවිට ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේට මෙබඳු අදහසක් ඇති විය: ‘‘ජාතිභූමියෙහි වාසය කරන උපාසකවරු විසින් ජාතිභූමියෙහි පිහිටි සියලුම වාසස්ථාන හතෙන්ම මා පිටත් කර හරින ලදී. දැන් මම කොහි යන්නෙම්ද?’’ එවිට ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේට මෙබඳු අදහසක් ඇති විය: ‘‘එසේ නම් මම භාග්‍යවතුන් වහන්සේ වෙත පැමිණෙන්නෙම්දැයි.’’ එවිට ආයුෂ්මත් ධම්මික ස්ථවිරයන් වහන්සේ පාත්‍රය හා සිවුරු රැගෙන රජගහ නුවර දෙසට පිටත්ව ගිය සේක. පිළිවෙළින් රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි වැඩසිටින භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වැඩ සිටි සේක.\n\nඑක්පසෙක වැඩහුන් ආයුෂ්මත් ධම්මික බ්‍රාහ්මණයා හට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “එම්බා ධම්මික බ්‍රාහ්මණය, ඔබ කොහි සිට පැමිණෙන්නේදැයි?” “ස්වාමීනී, මා උපන් දේශයේ ගිහියන් විසින්, එහි ඇති ආවාස හතකින්ම සම්පූර්ණයෙන්ම නෙරපා දමන ලද්දෙමි.” “බ්‍රාහ්මණ ධම්මික, එයින් ඔබට කුමක්ද? එය අනවශ්‍යය. ඔබව තැනින් තැන නෙරපා හරිනවා නම්, එලෙස තැනින් තැන නෙරපනු ලැබ ඔබ මා වෙතම පැමිණෙන්නේය.”\n\n“බ්‍රාහ්මණ ධම්මික, පෙර කලෙක මුහුදු යාත්‍රා කරන වෙළෙන්දෝ තොටුපොළක් පෙනෙන්නාවූ කුරුල්ලකු රැගෙන නැවකින් මුහුදට පිවිසෙති. ඔවුහු තොටුපොළක් නොපෙනෙන නැවෙන් තොටුපොළ පෙනෙන්නාවූ කුරුල්ලා මුදති. හෙතෙම නැගෙනහිර දිශාවට යයි, බස්නාහිර දිශාවට යයි, උතුරු දිශාවට යයි, දකුණු දිශාවට යයි, ඉහළට යයි, අනු දිශාවන්ටද යයි. යම් හෙයකින් ඔහු අවටින් තොටුපොළක් දුටුවහොත්, එහිම යයි. එහෙත් යම් හෙයකින් ඔහු අවටින් තොටුපොළක් නොදුටුවහොත්, එම නැව වෙතම ආපසු එයි. බ්‍රාහ්මණ ධම්මික, එලෙසින්ම ඔබව තැනින් තැන නෙරපා හරිනවා නම්, එලෙස තැනින් තැන නෙරපනු ලැබ ඔබ මා වෙතම පැමිණෙන්නේය.”\n\n“බ්‍රාහ්මණ ධම්මික, පෙර කලෙක කෝරබ්‍ය රජුට අතු පහකින් යුක්ත, සිසිල් සෙවණ දෙන, මනරම් වූ ‘සුප්පතිට්ඨ’ නම් නුග රජ ගසක් විය. බ්‍රාහ්මණ ධම්මික, සුප්පතිට්ඨ නම් ඒ නුග රජ ගසට යොදුන් දොළොසක් පුරා විහිදී ගිය විවරයක් ද, යොදුන් පහක් පුරා විහිදුනු මුල් ද විය. බ්‍රාහ්මණ ධම්මික, සුප්පතිට්ඨ නම් ඒ නුග රජ ගසේ ඵල, ආලක ප්‍රමාණයේ භාජනයක් තරම් විශාල විය. එහි ඵල එලෙසම මිහිරි විය; එනම්, කිසිදු පණුවන් නැති මී පැණි මෙනි. බ්‍රාහ්මණ ධම්මික, සුප්පතිට්ඨ නම් ඒ නුග රජ ගසේ එක් අත්තක ඵල රජු සිය අන්තඃපුරය සමඟ පරිභෝග කළේය. එක් අත්තක ඵල සේනාංකයෝ පරිභෝග කළහ. එක් අත්තක ඵල නගර වැසි ජනපද වැසියෝ පරිභෝග කළහ. එක් අත්තක ඵල ශ්‍රමණ බ්‍රාහ්මණයෝ පරිභෝග කළහ. එක් අත්තක ඵල මුවෝ පරිභෝග කළහ. බ්‍රාහ්මණ ධම්මික, සුප්පතිට්ඨ නම් ඒ නුග රජ ගසේ ඵල කිසිවෙක් රක්ෂා නොකළේය, ඔවුහු එකිනෙකාට ඵලවලට හානි නොකළෝය.”\n\n“එකල්හි, බ්‍රාහ්මණ ධම්මික, යම්කිසි පුරුෂයෙක් සුප්පතිට්ඨ නම් ඒ නුග රජ ගසේ ඵල අවශ්‍ය පමණට අනුභව කොට අත්තක් බිඳ දමා නික්ම ගියේය. එකල්හි, බ්‍රාහ්මණ ධම්මික, සුප්පතිට්ඨ නම් ඒ නුග රජ ගසේ අධිගෘහිත දෙවතාවට මෙසේ සිතුණි: ‘අහෝ පුදුම ය, අහෝ ආශ්චර්ය ය! කෙසේ නම් මෙතරම් පවිටු මිනිසෙක්, සුප්පතිට්ඨ නම් මේ නුග රජ ගසේ ඵල අවශ්‍ය පමණට අනුභව කොට අත්තක් බිඳ දමා යන්නේ ද? (නුග රජ ගස) මින් මතු ඵල නොදේවීවා!’ එකල්හි, බ්‍රාහ්මණ ධම්මික, සුප්පතිට්ඨ නම් ඒ නුග රජ ගස මින් මතු ඵල නොදුන්නේය.”\n\n“එකල්හි, බ්‍රාහ්මණ ධම්මික, කෝරබ්‍ය රජු දෙවියන්ට අධිපති ශක්‍රයා වෙත පැමිණියේය. පැමිණ ශක්‍ර දේවේන්ද්‍රයාට මෙසේ කීවේය: ‘පින්වත්නි, සුප්පතිට්ඨ නම් නුග රජ ගස ඵල නොදෙන බව ඔබ දන්නවාද?’ එකල්හි, බ්‍රාහ්මණ ධම්මික, ශක්‍ර දේවේන්ද්‍රයා එවැනි සෘද්ධි අභිසංස්කාරයක් සිදුකළේය, එයින් ප්‍රචණ්ඩ වූ සුළං වැසි පැමිණ සුප්පතිට්ඨ නම් නුග රජ ගස පෙරළා, මුල් සහිතව උපුටා දැමීය. එකල්හි, බ්‍රාහ්මණ ධම්මික, සුප්පතිට්ඨ නම් ඒ නුග රජ ගසේ අධිගෘහිත දෙවතාව දුකින්, කණගාටුවෙන්, කඳුළු පිරි මුහුණින් හඬමින් එක්පසෙක සිටියාය.”\n\n“එකල්හි, බ්‍රාහ්මණ ධම්මික, ශක්‍ර දේවේන්ද්‍රයා සුප්පතිට්ඨ නම් ඒ නුග රජ ගසේ අධිගෘහිත දෙවතාව වෙත පැමිණියේය. පැමිණ, සුප්පතිට්ඨ නම් ඒ නුග රජ ගසේ අධිගෘහිත දෙවතාවට මෙසේ කීවේය: ‘දේවතාවිය, ඔබ දුකින්, කණගාටුවෙන්, කඳුළු පිරි මුහුණින් හඬමින් එක්පසෙක සිටින්නේ කුමටද?’ ‘පින්වත්නි, මට එසේ වන්නේ ප්‍රචණ්ඩ වූ සුළං වැසි පැමිණ මගේ වාසස්ථානය පෙරළා, මුල් සහිතව උපුටා දැමූ බැවිනි’යි. ‘දේවතාවිය, ඔබ ගස් දැහැමෙහි (රුක්ඛ ධර්මයෙහි) පිහිටා සිටියදී ද ප්‍රචණ්ඩ වූ සුළං වැසි පැමිණ වාසස්ථානය පෙරළා, මුල් සහිතව උපුටා දැමුවේදැයි?’ ‘පින්වත්නි, කෙසේ නම් ගසක් රුක්ඛ ධර්මයෙහි පිහිටා සිටින්නේදැයි?’ ‘දේවතාවිය, මෙහිදී ගසක මුල් මුල් අවශ්‍ය අය ගෙන යති. පොතු පොතු අවශ්‍ය අය ගෙන යති. කොළ කොළ අවශ්‍ය අය ගෙන යති. මල් මල් අවශ්‍ය අය ගෙන යති. ඵල ඵල අවශ්‍ය අය ගෙන යති. එයින් ඒ දෙවතාවට අසතුටක් හෝ අකමැත්තක් ඇති කරගත යුතු නොවේ. දේවතාවිය, මෙලෙසින්ම ගසක් රුක්ඛ ධර්මයෙහි පිහිටා සිටී'යි.’ ‘පින්වත්නි, මම රුක්ඛ ධර්මයෙහි පිහිටා නොසිටි හෙයින්ම ප්‍රචණ්ඩ වූ සුළං වැසි පැමිණ මගේ වාසස්ථානය පෙරළා, මුල් සහිතව උපුටා දැමීය’යි. ‘දේවතාවිය, යම් හෙයකින් ඔබ රුක්ඛ ධර්මයෙහි පිහිටා සිටියේ නම්, ඔබට පෙර පරිදිම වාසස්ථානය ලැබෙනු ඇත’යි?”\n\n'ආයුෂ්මත්මය, මම වෘක්ෂධර්මයෙහි පිහිටන්නෙමි. මාගේ විහාරය පෙර පරිදිම වේවායි.' එවිට, දම්වැඩි බමුණ, දෙවියන්ගේ අධිපති වූ ශක්‍රදේවේන්ද්‍රයා එබඳු සෘද්ධි අභිසංඛාරයක් කළේය. එනම්, තද සුළං වැස්සක් පැමිණ, හොඳින් පිහිටා තිබූ නුග රජ ගස උදුරා දැමූයෙන්, එහි මුල්ද නිරාවරණය විය. දම්වැඩි බමුණ, එසේම, ඔබ ශ්‍රමණ ධර්මයෙහි පිහිටියා වූවක්ද, ඔබේ ජාති භූමියේ උපාසකයෝ මුළු ජාති භූමියෙන්ම ආවාස හතකින් පිටුවහල් කළාහුදැයි?' 'භාග්‍යවතුන් වහන්ස, එසේනම් ශ්‍රමණයෙක් ශ්‍රමණ ධර්මයෙහි පිහිටා සිටින්නේ කෙසේදැයි?' 'දම්වැඩි බමුණ, මෙහිදී ශ්‍රමණයෙක් තමන්ට බණින්නෙකුට පෙරළා නොබණියි. කිපෙන්නෙකුට පෙරළා නොකිපෙයි. රණ්ඩු කරන්නෙකුට පෙරළා රණ්ඩු නොකරයි. දම්වැඩි බමුණ, ශ්‍රමණයෙක් ශ්‍රමණ ධර්මයෙහි පිහිටා සිටින්නේ මෙසේය.' 'භාග්‍යවතුන් වහන්ස, මා ශ්‍රමණ ධර්මයෙහි පිහිටා නොසිටියද, ජාතිභූමියේ උපාසකයෝ මුළු ජාති භූමියෙන්ම ආවාස හතකින් මා පිටුවහල් කළාහුය.'\n\n'දම්වැඩි බමුණ, පෙර විසූ කාලයක කාමයන්ගෙන් වීතරාගී වූ සුනෙත්ත නම් තීර්ථක ශාස්තෲවරයෙක් විය. දම්වැඩි බමුණ, ඒ සුනෙත්ත ශාස්තෲවරයාට නොයෙක් සියගණනක් ශ්‍රාවකයෝ සිටියහ. සුනෙත්ත ශාස්තෲවරයා තම ශ්‍රාවකයන්ට බ්‍රහ්මලෝක සහභාගීත්වය පිණිස ධර්මය දේශනා කළේය. දම්වැඩි බමුණ, ඒ සුනෙත්ත ශාස්තෲවරයා බ්‍රහ්මලෝක සහභාගීත්වය පිණිස ධර්මය දේශනා කරන කල්හි යම් අයෙක් සිත පහදවා නොගත්තාහුද, ඔවුහු ශරීරය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත නිරයෙහි උපන්නාහුය. දම්වැඩි බමුණ, ඒ සුනෙත්ත ශාස්තෲවරයා බ්‍රහ්මලෝක සහභාගීත්වය පිණිස ධර්මය දේශනා කරන කල්හි යම් අයෙක් සිත පහදවා ගත්තාහුද, ඔවුහු ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයෙහි උපන්නාහුය.'\n\n'දම්වැඩි බමුණ, පෙර විසූ කාලයක මූගපක්ඛ නම් ශාස්තෲවරයෙක් විය... අරණේමි නම් ශාස්තෲවරයෙක් විය... කුද්දාලක නම් ශාස්තෲවරයෙක් විය... හත්ථිපාල නම් ශාස්තෲවරයෙක් විය... ජෝතිපාල නම් තීර්ථක ශාස්තෲවරයෙක් විය, කාමයන්ගෙන් වීතරාගී වූ. දම්වැඩි බමුණ, ඒ ජෝතිපාල ශාස්තෲවරයාට නොයෙක් සියගණනක් ශ්‍රාවකයෝ සිටියහ. ජෝතිපාල ශාස්තෲවරයා තම ශ්‍රාවකයන්ට බ්‍රහ්මලෝක සහභාගීත්වය පිණිස ධර්මය දේශනා කළේය. දම්වැඩි බමුණ, ඒ ජෝතිපාල ශාස්තෲවරයා බ්‍රහ්මලෝක සහභාගීත්වය පිණිස ධර්මය දේශනා කරන කල්හි යම් අයෙක් සිත පහදවා නොගත්තාහුද, ඔවුහු ශරීරය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත නිරයෙහි උපන්නාහුය. දම්වැඩි බමුණ, ඒ ජෝතිපාල ශාස්තෲවරයා බ්‍රහ්මලෝක සහභාගීත්වය පිණිස ධර්මය දේශනා කරන කල්හි යම් අයෙක් සිත පහදවා ගත්තාහුද, ඔවුහු ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයෙහි උපන්නාහුය.'\n\n'දම්වැඩි බමුණ, ඔබ මේ පිළිබඳව කුමක් සිතන්නෙහිද? යම් කෙනෙක් කාමයන්ගෙන් වීතරාගී වූ, නොයෙක් සියගණනක් ශ්‍රාවක පිරිවරින් යුක්ත වූ, ශ්‍රාවක සංඝයාද සහිත වූ, මේ ශාස්තෲවරුන් සදෙනාට ද්වේෂ සහගත සිතින් බණීද, පරිභව කෙරේද, හෙතෙම බොහෝ අකුසල් රැස් කරන්නේ නොවේදැයි?' 'එසේය, භාග්‍යවතුන් වහන්ස.' 'දම්වැඩි බමුණ, යම් කෙනෙක් කාමයන්ගෙන් වීතරාගී වූ, නොයෙක් සියගණනක් ශ්‍රාවක පිරිවරින් යුක්ත වූ, ශ්‍රාවක සංඝයාද සහිත වූ, මේ ශාස්තෲවරුන් සදෙනාට ද්වේෂ සහගත සිතින් බණීද, පරිභව කෙරේද, හෙතෙම බොහෝ අකුසල් රැස් කරන්නේමය. යම් කෙනෙක් එක් දෘෂ්ටි සම්පන්න පුද්ගලයෙකුට ද්වේෂ සහගත සිතින් බණීද, පරිභව කෙරේද, හෙතෙම ඊටත් වඩා බොහෝ අකුසල් රැස් කරන්නේය. ඒ කුමක් හෙයින්ද? දම්වැඩි බමුණ, මා සබ්‍රහ්මචාරීන් කෙරෙහි දක්වන ලද පරිදි, මෙයින් පිටස්තර වූ එවැනි ඉවසීමක් මා නොදෙසමි. එබැවින්, දම්වැඩි බමුණ, මෙසේ හික්මිය යුතුය – ‘අපගේ සිත සබ්‍රහ්මචාරීන් කෙරෙහි ද්වේෂ සහගත නොවන්නේය’ යනුවෙනි. දම්වැඩි බමුණ, ඔබ මෙසේම හික්මිය යුතුය.'\n\n'සුනෙත්ත, මූගපක්ඛ යන මේ ශාස්තෲවරු ද, අරණේමි නම් බ්‍රාහ්මණයා ද, කුද්දාලක නම් ශාස්තෲවරයා ද, හත්ථිපාල නම් මානවකයා ද, ජෝතිපාල ද ගෝවින්ද ද සත්පුරෝහිත විය. අතීත කාලයෙහි විසූ මේ යසස් ඇති ශාස්තෲවරු සදෙනා අහිංසකයෝ වූහ. ඔවුහු ආමගන්ධයන්ගෙන් තොර වූවාහුය, කරුණාවෙන් අධිමුක්ත වූවාහුය, කාම සංයෝජන ඉක්මවා ගියාහුය. කාමරාගය දුරු කොට, බ්‍රහ්මලෝකයට පැමිණියාහුය. ඔවුන්ට ශ්‍රාවකයෝ ද නොයෙක් සියගණනක් වූහ. ඔවුහු ද ආමගන්ධයන්ගෙන් තොර වූවාහුය, කරුණාවෙන් අධිමුක්ත වූවාහුය, කාම සංයෝජන ඉක්මවා ගියාහුය. කාමරාගය දුරු කොට, බ්‍රහ්මලෝකයට පැමිණියාහුය. යම් පුරුෂයෙක් කාමයන්ගෙන් වීතරාගී වූ, සමාධිගත වූ, මේ බාහිර ඍෂිවරුන්ට ද්වේෂ සහගත සිතින් පරිභව කෙරේද, එබඳු පුරුෂ තෙමේ බොහෝ අකුසල් රැස් කරන්නේය. යම් පුරුෂයෙක් බුදුරජාණන් වහන්සේගේ ශ්‍රාවකයෙක් වූ, එක් දෘෂ්ටි සම්පන්න භික්ෂුවකට ද්වේෂ සහගත සිතින් පරිභව කෙරේද, ඒ පුරුෂයා ඊටත් වඩා බොහෝ අකුසල් රැස් කරන්නේය. මිථ්‍යාදෘෂ්ටි දුරුකළ තැනැත්තෙකුට අයහපත් ලෙස නොපැමිණිය යුතුය. හෙතෙම ආර්ය සංඝයාගේ සත්වන පුද්ගලයා ලෙස කියනු ලැබේ. කාමයන් කෙරෙහි නොවරදවා ඇලුණු, යම් පුද්ගලයකුගේ පංච ඉන්ද්‍රියයන් මෘදු වෙයිද; එනම්, ශ්‍රද්ධා, සති, වීරිය, සමථ, විපස්සනා.'\n\nඑබඳු භික්‍ෂුවකට අපහාස කරන හෝ හිංසා කරන තැනැත්තා පළමුව තමාටම හානි පමුණුවා ගනී. තමාට හානි පමුණුවා ගත් හෙතෙම, අනතුරුව අන්‍යයන්ටද හිංසා කරයි.\n\nයමෙක් තමා රැක ගන්නේද, ඔහුට බාහිර ලෝකයද රැක ගැණේ. එහෙයින්, ප්‍රඥාවන්තයා හානියට පත් නොවී සිටීම පිණිස හැමවිටම තමා රැක ගත යුතුය.",
      "paliTitle": "Dhammikasuttaṃ",
      "englishTitle": "The Dhammika Sutta",
      "sinhalaTitle": "ධම්මික සූත‍්‍රය"
    },
    {
      "number": 2,
      "pali": "Dutiyapaṇṇāsakaṃ",
      "english": "The Second Fifty",
      "sinhala": "දෙවන පනස",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Dhammikavaggo pañcamo. Tassuddānaṃ – Nāgamigasālā iṇaṃ, cundaṃ dve sandiṭṭhikā duve; Khemaindriya ānanda, khattiyā appamādena dhammikoti. Paṭhamapaṇṇāsakaṃ samattaṃ.",
    "english": "The Fifth Righteous Chapter",
    "sinhala": "පස්වන ධම්‍මික වග්ගය"
  }
}