{
  "id": "an6.12",
  "title": {
    "pali": "Sāmaññavaggo",
    "english": "The Section on Recluseship",
    "sinhala": "සාමඤ්ඤ වග්ගය"
  },
  "sections": [
    {
      "number": 117,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo kāye kāyānupassī viharituṃ. Katame cha? Kammārāmataṃ, bhassārāmataṃ, niddārāmataṃ, saṅgaṇikārāmataṃ, indriyesu aguttadvārataṃ, bhojane amattaññutaṃ. Ime kho, bhikkhave, cha dhamme appahāya abhabbo kāye kāyānupassī viharituṃ. ‘‘Cha, bhikkhave, dhamme pahāya bhabbo kāye kāyānupassī viharituṃ. Katame cha? Kammārāmataṃ, bhassārāmataṃ, niddārāmataṃ, saṅgaṇikārāmataṃ, indriyesu aguttadvārataṃ, bhojane amattaññutaṃ – ime kho, bhikkhave, cha dhamme pahāya bhabbo kāye kāyānupassī viharitu’’nti. Paṭhamaṃ.",
      "english": "Monks, without abandoning six qualities, one is incapable of dwelling contemplating the body in the body. Which six? Attachment to activities, attachment to idle chatter, attachment to sleep, attachment to company, unguarded sense doors, and lack of moderation in food. Indeed, monks, without abandoning these six qualities, one is incapable of dwelling contemplating the body in the body.\n\nMonks, having abandoned six qualities, one is capable of dwelling contemplating the body in the body. Which six? Attachment to activities, attachment to idle chatter, attachment to sleep, attachment to company, unguarded sense doors, and lack of moderation in food. Indeed, monks, having abandoned these six qualities, one is capable of dwelling contemplating the body in the body.",
      "sinhala": "භික්‍ෂූණි, ධර්මයන් සයක් අත්නොහැර, කයෙහි කය අනුපස්සනා කරමින් වාසය කිරීමට නොහැකියි. ඒ සය කවරේද? ක්‍රියාකාරකම් කෙරෙහි ඇලීම, නිෂ්ඵල කතාබහෙහි ඇලීම, නින්දෙහි ඇලීම, සමූහයෙහි ඇලීම, ඉන්ද්‍රිය දොරටු ආරක්‍ෂා නොකිරීම, ආහාරයෙහි පමණ නොදැනීමයි. භික්‍ෂූණි, මේ ධර්මයන් සය අත්නොහැර, කයෙහි කය අනුපස්සනා කරමින් වාසය කිරීමට නොහැකියි.\n\nභික්‍ෂූණි, ධර්මයන් සයක් අත්හැර, කයෙහි කය අනුපස්සනා කරමින් වාසය කිරීමට හැකියි. ඒ සය කවරේද? ක්‍රියාකාරකම් කෙරෙහි ඇලීම, නිෂ්ඵල කතාබහෙහි ඇලීම, නින්දෙහි ඇලීම, සමූහයෙහි ඇලීම, ඉන්ද්‍රිය දොරටු ආරක්‍ෂා නොකිරීම, ආහාරයෙහි පමණ නොදැනීමයි. භික්‍ෂූණි, මේ ධර්මයන් සය අත්හැර, කයෙහි කය අනුපස්සනා කරමින් වාසය කිරීමට හැකියි.",
      "paliTitle": "Kāyānupassīsuttaṃ"
    },
    {
      "number": 118,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo ajjhattaṃ kāye…pe… bahiddhā kāye…pe… ajjhattabahiddhā kāye…pe… ajjhattaṃ vedanāsu…pe… bahiddhā vedanāsu…pe… ajjhattabahiddhā vedanāsu…pe… ajjhattaṃ citte…pe… bahiddhā citte…pe… ajjhattabahiddhā citte…pe… ajjhattaṃ dhammesu…pe… bahiddhā dhammesu…pe… ajjhattabahiddhā dhammesu dhammānupassī viharituṃ. Katame cha? Kammārāmataṃ, bhassārāmataṃ, niddārāmataṃ, saṅgaṇikārāmataṃ, indriyesu aguttadvārataṃ, bhojane amattaññutaṃ. Ime kho, bhikkhave, cha dhamme pahāya bhabbo ajjhattabahiddhā dhammesu dhammānupassī viharitu’’nti. Dutiyaṃ.",
      "english": "Monks, without having abandoned six qualities, one is incapable of dwelling contemplating the body internally, contemplating the body externally, contemplating the body both internally and externally; contemplating feelings internally, contemplating feelings externally, contemplating feelings both internally and externally; contemplating the mind internally, contemplating the mind externally, contemplating the mind both internally and externally; contemplating mental phenomena internally, contemplating mental phenomena externally, contemplating mental phenomena both internally and externally. Which six? Delight in activity, delight in idle chatter, delight in sleep, delight in company, unguardedness of the sense doors, and immoderation in food. Having abandoned these six qualities, monks, one is capable of dwelling contemplating mental phenomena both internally and externally.",
      "sinhala": "මහණෙනි, ධර්‍[ZWJ]ම හයක් අත්නොහැර, කයෙහි අභ්‍යන්තරයෙහි, බාහිරයෙහි, අභ්‍යන්තරයෙහි හා බාහිරයෙහි; වේදනාවන්හි අභ්‍යන්තරයෙහි, බාහිරයෙහි, අභ්‍යන්තරයෙහි හා බාහිරයෙහි; සිතෙහි අභ්‍යන්තරයෙහි, බාහිරයෙහි, අභ්‍යන්තරයෙහි හා බාහිරයෙහි; ධර්‍[ZWJ]මයන්හි අභ්‍යන්තරයෙහි, බාහිරයෙහි, අභ්‍යන්තරයෙහි හා බාහිරයෙහි ධර්‍[ZWJ]මානුපස්සීව වාසය කිරීමට නොහැක්කේය.\n\nඒ හය කවරහුද?\n\nකර්‍[ZWJ]මාන්තයන්හි ඇල්ම, කතාවෙහි ඇල්ම, නිද්‍රාවෙහි ඇල්ම, සමූහ ඇසුරෙහි ඇල්ම, ඉන්ද්‍රියයන්හි අසංවර බව, ආහාරයෙහි පමණ නොදැනීම.\n\nමහණෙනි, මේ ධර්‍[ZWJ]ම හය අත්හැර, තමාගේ ද අනුන්ගේ ද ධර්‍[ZWJ]මයන්හි ධර්‍[ZWJ]මානුපස්සීව වාසය කිරීමට හැක්කේය.",
      "paliTitle": "Dhammānupassīsuttaṃ"
    },
    {
      "number": 119,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato tapusso [tapasso (pī.) a. ni. 1.248] gahapati tathāgate niṭṭhaṅgato amataddaso amataṃ sacchikatvā iriyati. Katamehi chahi? Buddhe aveccappasādena, dhamme aveccappasādena, saṅghe aveccappasādena, ariyena sīlena, ariyena ñāṇena, ariyāya vimuttiyā. Imehi kho, bhikkhave, chahi dhammehi samannāgato tapusso gahapati tathāgate niṭṭhaṅgato amataddaso amataṃ sacchikatvā iriyatī’’ti. Tatiyaṃ.",
      "english": "Monks, Tapussa the householder, endowed with six qualities, has attained ultimate conviction concerning the Tathagata, has seen the Deathless, and having realized the Deathless, he conducts himself. What are these six? With unwavering confidence in the Buddha, with unwavering confidence in the Dhamma, with unwavering confidence in the Sangha, with noble virtue, with noble knowledge, and with noble liberation. Indeed, monks, Tapussa the householder, endowed with these six qualities, has attained ultimate conviction concerning the Tathagata, has seen the Deathless, and having realized the Deathless, he conducts himself.",
      "sinhala": "භික්ෂූණි, තපස්සු ගෘහපති මේ ධර්ම හයෙන් සමන්නාගත වූයේ තථාගතයන් වහන්සේ කෙරෙහි නොසැලෙන විශ්වාසයකින් යුක්ත වූ, අමරණීයත්වය දුටු, අමරණීයත්වය ප්‍රත්‍යක්ෂ කොටගෙන හැසිරෙයි.\n\nඒ හය කුමක්ද? බුදුරදුන් කෙරෙහි නොසැලෙන පැහැදීමකින්, දහම් කෙරෙහි නොසැලෙන පැහැදීමකින්, සංඝයා කෙරෙහි නොසැලෙන පැහැදීමකින්, ආර්ය ශීලයෙන්, ආර්ය ඤාණයෙන් සහ ආර්ය විමුක්තියෙන්.\n\nසත්‍ය වශයෙන්ම, භික්ෂූණි, තපස්සු ගෘහපති මේ ධර්ම හයෙන් සමන්නාගත වූයේ තථාගතයන් වහන්සේ කෙරෙහි නොසැලෙන විශ්වාසයකින් යුක්ත වූ, අමරණීයත්වය දුටු, අමරණීයත්වය ප්‍රත්‍යක්ෂ කොටගෙන හැසිරෙයි.",
      "paliTitle": "Tapussasuttaṃ"
    },
    {
      "number": 120,
      "numberRange": "120-139",
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhalliko gahapati…pe… sudatto gahapati anāthapiṇḍiko… citto gahapati macchikāsaṇḍiko… hatthako āḷavako… mahānāmo sakko… uggo gahapati vesāliko… uggato gahapati… sūrambaṭṭho [sūro ambaṭṭho (ka.)] … jīvako komārabhacco… nakulapitā gahapati… tavakaṇṇiko gahapati… pūraṇo gahapati… isidatto gahapati… sandhāno [santāno (ka.)] gahapati… vicayo [vijayo (sī. syā. pī.)] gahapati… vijayamāhiko [vajjiyamahito (sī. syā. pī.)] gahapati… meṇḍako gahapati … vāseṭṭho upāsako… ariṭṭho upāsako… sāraggo [sādatto (syā.)] upāsako tathāgate niṭṭhaṅgato amataddaso amataṃ sacchikatvā iriyati. Katamehi chahi? Buddhe aveccappasādena, dhamme aveccappasādena, saṅghe aveccappasādena, ariyena sīlena, ariyena ñāṇena, ariyāya vimuttiyā. Imehi kho, bhikkhave, chahi dhammehi samannāgato sāraggo upāsako tathāgate niṭṭhaṅgato amataddaso amataṃ sacchikatvā iriyatī’’ti. Tevīsatimaṃ. Sāmaññavaggo dvādasamo.",
      "english": "Monks, Bhalliko the householder, Sudatto the householder Anāthapiṇḍika, Citto the householder from Macchikāsaṇḍa, Hatthaka from Āḷavī, Mahānāma the Sakyan, Ugga the householder from Vesālī, Uggata the householder, Sūrambaṭṭha, Jīvaka Komārabhacca, Nakulapitā the householder, Tavakaṇṇika the householder, Pūraṇa the householder, Isidatta the householder, Sandhāna the householder, Vicaya the householder, Vijayamāhika the householder, Meṇḍaka the householder, Vāseṭṭha the lay follower, Ariṭṭha the lay follower, and Sāragga the lay follower—each and every one of these, endowed with six qualities, having attained certainty in the Tathāgata, having seen the Deathless, and having realized the Deathless, abides.\n\nWhich six? With unwavering faith in the Buddha, with unwavering faith in the Dhamma, with unwavering faith in the Saṅgha, with noble virtue, with noble knowledge, and with noble liberation.\n\nMonks, Sāragga the lay follower, endowed with these six qualities, having attained certainty in the Tathāgata, having seen the Deathless, and having realized the Deathless, abides.",
      "sinhala": "භික්ෂූණි, මේ සය ආකාර ධර්මයන්ගෙන් සමන්වාගත වූ භල්ලික ගෘහපති, අනාථපිණ්ඩික සුදත්ත ගෘහපති, මච්ඡිකාසණ්ඩික චිත්ත ගෘහපති, ආළවක හත්ථක, මහානාම ශාක්‍ය, වෛශාලී උග්ග ගෘහපති, උග්ගත ගෘහපති, සූරඅම්බට්ඨ, ජීවක කෝමාරභච්ච, නකුලපිතෘ ගෘහපති, තවකණ්ණික ගෘහපති, පූරණ ගෘහපති, ඉසිදත්ත ගෘහපති, සන්ධන ගෘහපති, විචය ගෘහපති, විජයමාහික ගෘහපති, මේණ්ඩක ගෘහපති, වාසෙට්ඨ උපාසක, අරිට්ඨ උපාසක, සාරග්ග උපාසක – යන මේ අය තථාගතයන් වහන්සේ කෙරෙහි නිශ්චිත අචල විශ්වාසයකට පැමිණ, අමෘතය දැක, අමෘතය සාක්ෂාත් කරගෙන, ඒ අනුව හැසිරෙයි.\n\nකුමන සය ආකාර ධර්මයන්ගෙන් ද?\n\nබුදුරජාණන් වහන්සේ කෙරෙහි අවේච්චප්ප්‍රසාදයෙන්, ධර්මය කෙරෙහි අවේච්චප්ප්‍රසාදයෙන්, සංඝයා වහන්සේ කෙරෙහි අවේච්චප්ප්‍රසාදයෙන්, ආර්ය ශීලයෙන්, ආර්ය ඥානයෙන්, ආර්ය විමුක්තියෙනි.\n\nභික්ෂූණි, මේ සය ආකාර ධර්මයන්ගෙන් සමන්වාගත වූ සාරග්ග උපාසක තථාගතයන් වහන්සේ කෙරෙහි නිශ්චිත අචල විශ්වාසයකට පැමිණ, අමෘතය දැක, අමෘතය සාක්ෂාත් කරගෙන, ඒ අනුව හැසිරෙයි.",
      "paliTitle": "Bhallikādisuttāni"
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}