{
  "id": "an6.8",
  "title": {
    "pali": "Arahattavaggo",
    "english": "The Arahant Chapter",
    "sinhala": "අරහත් වග්ගය"
  },
  "sections": [
    {
      "number": 75,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu diṭṭheva dhamme dukkhaṃ viharati savighātaṃ saupāyāsaṃ sapariḷāhaṃ, kāyassa bhedā paraṃ maraṇā duggati pāṭikaṅkhā. Katamehi chahi? Kāmavitakkena, byāpādavitakkena, vihiṃsāvitakkena, kāmasaññāya, byāpādasaññāya, vihiṃsāsaññāya – imehi, kho, bhikkhave, chahi dhammehi samannāgato bhikkhu diṭṭheva dhamme dukkhaṃ viharati savighātaṃ saupāyāsaṃ sapariḷāhaṃ, kāyassa bhedā paraṃ maraṇā duggati pāṭikaṅkhā. ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ, kāyassa bhedā paraṃ maraṇā sugati pāṭikaṅkhā. Katamehi chahi? Nekkhammavitakkena, abyāpādavitakkena, avihiṃsāvitakkena, nekkhammasaññāya, abyāpādasaññāya, avihiṃsāsaññāya – imehi, kho, bhikkhave, chahi dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ, kāyassa bhedā paraṃ maraṇā sugati pāṭikaṅkhā’’ti. Paṭhamaṃ.",
      "english": "Monks, a bhikkhu endowed with six qualities lives in suffering in this very life, with vexation, with despair, with torment. Upon the breaking up of the body, after death, a woeful destination is to be expected. Which six? With thoughts of sensuality, with thoughts of ill-will, with thoughts of harm, with perceptions of sensuality, with perceptions of ill-will, with perceptions of harm – it is with these six qualities, monks, that a bhikkhu lives in suffering in this very life, with vexation, with despair, with torment. Upon the breaking up of the body, after death, a woeful destination is to be expected.\n\nMonks, a bhikkhu endowed with six qualities lives in happiness in this very life, without vexation, without despair, without torment. Upon the breaking up of the body, after death, a happy destination is to be expected. Which six? With thoughts of renunciation, with thoughts of non-ill-will, with thoughts of non-harm, with perceptions of renunciation, with perceptions of non-ill-will, with perceptions of non-harm – it is with these six qualities, monks, that a bhikkhu lives in happiness in this very life, without vexation, without despair, without torment. Upon the breaking up of the body, after death, a happy destination is to be expected.",
      "sinhala": "මහණෙනි, ධර්ම හයකින් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයේදීම දුකෙන් වාසය කරයි, විඝාත සහිතව, උපායාස සහිතව, පරිළාහ සහිතව. ශරීරය බිඳී මරණින් මතු දුගතියක් අපේක්ෂා කළ යුතු වේ. ඒ කවර හයද? කාමවිතර්කයෙන්, ව්‍යාපාදවිතර්කයෙන්, විහිංසාවිතර්කයෙන්, කාමසංඥාවෙන්, ව්‍යාපාදසංඥාවෙන්, විහිංසාසංඥාවෙන් – මහණෙනි, මේ ධර්ම හයකින් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයේදීම දුකෙන් වාසය කරයි, විඝාත සහිතව, උපායාස සහිතව, පරිළාහ සහිතව. ශරීරය බිඳී මරණින් මතු දුගතියක් අපේක්ෂා කළ යුතු වේ.\n\nමහණෙනි, ධර්ම හයකින් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයේදීම සුවයෙන් වාසය කරයි, විඝාත රහිතව, උපායාස රහිතව, පරිළාහ රහිතව. ශරීරය බිඳී මරණින් මතු සුගතියක් අපේක්ෂා කළ යුතු වේ. ඒ කවර හයද? නෛෂ්ක්‍රම්‍යවිතර්කයෙන්, අව්‍යාපාදවිතර්කයෙන්, අවිහිංසාවිතර්කයෙන්, නෛෂ්ක්‍රම්‍යසංඥාවෙන්, අව්‍යාපාදසංඥාවෙන්, අවිහිංසාසංඥාවෙන් – මහණෙනි, මේ ධර්ම හයකින් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයේදීම සුවයෙන් වාසය කරයි, විඝාත රහිතව, උපායාස රහිතව, පරිළාහ රහිතව. ශරීරය බිඳී මරණින් මතු සුගතියක් අපේක්ෂා කළ යුතු වේ.",
      "paliTitle": "Dukkhasuttaṃ",
      "englishTitle": "Discourse on Suffering",
      "sinhalaTitle": "දුක්ඛ සූත්‍රය"
    },
    {
      "number": 76,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. Katame cha? Mānaṃ, omānaṃ, atimānaṃ, adhimānaṃ, thambhaṃ, atinipātaṃ. Ime kho, bhikkhave, cha dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. ‘‘Cha, bhikkhave, dhamme pahāya bhabbo arahattaṃ sacchikātuṃ. Katame cha? Mānaṃ, omānaṃ, atimānaṃ, adhimānaṃ, thambhaṃ, atinipātaṃ. Ime kho, bhikkhave, cha dhamme pahāya bhabbo arahattaṃ sacchikātu’’nti. Dutiyaṃ.",
      "english": "Monks, without abandoning six things, one is unable to realize arahantship. Which six? Conceit, disparagement, arrogance, presumption, obstinacy, and excessive self-abasement. Indeed, monks, without abandoning these six things, one is unable to realize arahantship.\n\nMonks, having abandoned six things, one is capable of realizing arahantship. Which six? Conceit, disparagement, arrogance, presumption, obstinacy, and excessive self-abasement. Indeed, monks, having abandoned these six things, one is capable of realizing arahantship.",
      "sinhala": "මහණෙනි, දහම් සයක් දුරු නොකොට අරහත්වය සාක්ෂාත් කිරීමට නොහැක්කේය. ඒ කවර දහම් සයක්ද? මානය, ඕමානය, අතිමානය, අධිමානය, ථම්භය, අතිනිපාතය යනුයි. මහණෙනි, මේ දහම් සය දුරු නොකොට අරහත්වය සාක්ෂාත් කිරීමට නොහැක්කේය. මහණෙනි, දහම් සයක් ප්‍ර‍හාණය කොට අරහත්වය සාක්ෂාත් කිරීමට හැක්කේය. ඒ කවර දහම් සයක්ද? මානය, ඕමානය, අතිමානය, අධිමානය, ථම්භය, අතිනිපාතය යනුයි. මහණෙනි, මේ දහම් සය ප්‍ර‍හාණය කොට අරහත්වය සාක්ෂාත් කිරීමට හැක්කේය.",
      "paliTitle": "Arahattasuttaṃ",
      "englishTitle": "The Discourse on Arahantship",
      "sinhalaTitle": "අරහත් සූත‍්‍රය"
    },
    {
      "number": 77,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo uttarimanussadhammaṃ alamariyañāṇadassanavisesaṃ sacchikātuṃ. Katame cha? Muṭṭhassaccaṃ, asampajaññaṃ, indriyesu aguttadvārataṃ, bhojane amattaññutaṃ, kuhanaṃ, lapanaṃ. Ime kho, bhikkhave, cha dhamme appahāya abhabbo uttarimanussadhammaṃ alamariyañāṇadassanavisesaṃ sacchikātuṃ. ‘‘Cha, bhikkhave, dhamme pahāya bhabbo uttarimanussadhammaṃ alamariyañāṇadassanavisesaṃ sacchikātuṃ. Katame cha? Muṭṭhassaccaṃ, asampajaññaṃ, indriyesu aguttadvārataṃ, bhojane amattaññutaṃ, kuhanaṃ, lapanaṃ. Ime kho, bhikkhave, cha dhamme pahāya bhabbo uttarimanussadhammaṃ alamariyañāṇadassanavisesaṃ sacchikātu’’nti. Tatiyaṃ.",
      "english": "Monks, by not abandoning six qualities, one is incapable of realizing a superhuman state, a truly noble distinction of knowledge and vision. Which six? Forgetfulness of mindfulness, lack of clear comprehension, unguardedness of the sense doors, immoderation in food, hypocrisy, and ingratiating speech. Indeed, monks, by not abandoning these six qualities, one is incapable of realizing a superhuman state, a truly noble distinction of knowledge and vision.\n\nMonks, by abandoning six qualities, one is capable of realizing a superhuman state, a truly noble distinction of knowledge and vision. Which six? Forgetfulness of mindfulness, lack of clear comprehension, unguardedness of the sense doors, immoderation in food, hypocrisy, and ingratiating speech. Indeed, monks, by abandoning these six qualities, one is capable of realizing a superhuman state, a truly noble distinction of knowledge and vision.",
      "sinhala": "මහණෙනි, කරුණු සයක් අත්නොහැර උතුම් මනුෂ්‍ය ධර්මය වූ අතිශයින් උතුම් වූ ආර්‍ය ඥාන දර්ශන විශේෂය සාක්ෂාත් කිරීමට සමර්ථ නොවෙයි. කවරේද ඒ සය? සිහි මුළාවීම, අසම්පජඤ්‍ඤය, ඉන්ද්‍රියයන්හි දොරටු අරක් නොගත් බව, භෝජනයෙහි පමණ නොදැනීම, කුහකකම් කිරීම, ලාභ අපේක්ෂාවෙන් වර්ණනා කිරීම යන මේවාය. මහණෙනි, මේ කරුණු සය අත්නොහැර උතුම් මනුෂ්‍ය ධර්මය වූ අතිශයින් උතුම් වූ ආර්‍ය ඥාන දර්ශන විශේෂය සාක්ෂාත් කිරීමට සමර්ථ නොවෙයි.\n\nමහණෙනි, කරුණු සයක් අත්හැර උතුම් මනුෂ්‍ය ධර්මය වූ අතිශයින් උතුම් වූ ආර්‍ය ඥාන දර්ශන විශේෂය සාක්ෂාත් කිරීමට සමර්ථ වෙයි. කවරේද ඒ සය? සිහි මුළාවීම, අසම්පජඤ්‍ඤය, ඉන්ද්‍රියයන්හි දොරටු අරක් නොගත් බව, භෝජනයෙහි පමණ නොදැනීම, කුහකකම් කිරීම, ලාභ අපේක්ෂාවෙන් වර්ණනා කිරීම යන මේවාය. මහණෙනි, මේ කරුණු සය අත්හැර උතුම් මනුෂ්‍ය ධර්මය වූ අතිශයින් උතුම් වූ ආර්‍ය ඥාන දර්ශන විශේෂය සාක්ෂාත් කිරීමට සමර්ථ වෙයි.",
      "paliTitle": "Uttarimanussadhammasuttaṃ",
      "englishTitle": "Discourse on Superhuman Qualities",
      "sinhalaTitle": "උත්තරී මනුෂ්‍<ZWJ>ය ධර්<ZWJ>ම සූත‍්‍ර<ZWJ>ය"
    },
    {
      "number": 78,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhasomanassabahulo viharati, yoni cassa āraddhā hoti āsavānaṃ khayāya. Katamehi chahi? Idha, bhikkhave, bhikkhu dhammārāmo hoti, bhāvanārāmo hoti, pahānārāmo hoti, pavivekārāmo hoti, abyāpajjhārāmo hoti, nippapañcārāmo hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhasomanassabahulo viharati, yoni cassa āraddhā hoti āsavānaṃ khayāyā’’ti. Catutthaṃ.",
      "english": "Monks, a monk endowed with six qualities dwells abundant in joy and happiness in this very life, and for him, the proper endeavor for the destruction of the taints is aroused. Which six are these? Here, monks, a monk delights in the Dhamma, delights in mental cultivation, delights in relinquishment, delights in seclusion, delights in non-affliction, and delights in non-proliferation. Indeed, monks, a monk endowed with these six qualities dwells abundant in joy and happiness in this very life, and for him, the proper endeavor for the destruction of the taints is aroused.",
      "sinhala": "භික්ෂූනි, ධර්ම හයකින් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයෙහිම බොහෝ සුවයෙන් හා සොම්නසින් වාසය කරයි. ඔහුට ආශ්‍රවයන් ක්ෂය කිරීම සඳහා මාර්ගය ද ආරම්භ වී ඇත.\n\nඒ ධර්ම හය කවරේද?\n\nභික්ෂූනි, මෙහිලා භික්ෂුව ධර්මයෙහි ඇලී වාසය කරයි, භාවනාවෙහි ඇලී වාසය කරයි, කෙලෙස් ප්‍රහීණය කිරීමෙහි ඇලී වාසය කරයි, විවේකයෙහි ඇලී වාසය කරයි, අව්‍යාපජ්ඣයෙහි ඇලී වාසය කරයි, ප්‍රපඤ්ච රහිත බවෙහි ඇලී වාසය කරයි.\n\nභික්ෂූනි, ධර්ම මේ හයෙන් යුක්ත වූ භික්ෂුවක් මේ ආත්මභාවයෙහිම බොහෝ සුවයෙන් හා සොම්නසින් වාසය කරයි. ඔහුට ආශ්‍රවයන් ක්ෂය කිරීම සඳහා මාර්ගය ද ආරම්භ වී ඇත.",
      "paliTitle": "Sukhasomanassasuttaṃ",
      "englishTitle": "The Discourse on Happiness and Joy",
      "sinhalaTitle": "සුඛ සෝමනස්ස සූත‍්‍රය"
    },
    {
      "number": 79,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu abhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ [phātikattuṃ (sī.), phātikātuṃ (syā. kaṃ. pī.)]. Katamehi chahi? Idha, bhikkhave, bhikkhu na āyakusalo ca hoti, na apāyakusalo ca hoti, na upāyakusalo ca hoti, anadhigatānaṃ kusalānaṃ dhammānaṃ adhigamāya na chandaṃ janeti, adhigate kusale dhamme na ārakkhati [sārakkhati (sī. syā. kaṃ. pī)], sātaccakiriyāya na sampādeti. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu abhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātuṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu āyakusalo ca hoti, apāyakusalo ca hoti, upāyakusalo ca hoti, anadhigatānaṃ kusalānaṃ dhammānaṃ adhigamāya chandaṃ janeti, adhigate kusale dhamme ārakkhati, sātaccakiriyāya sampādeti. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu bhabbo anadhigataṃ vā kusalaṃ dhammaṃ adhigantuṃ, adhigataṃ vā kusalaṃ dhammaṃ phātiṃ kātu’’nti. Pañcamaṃ.",
      "english": "Monks, a monk endowed with six qualities is incapable of attaining wholesome states not yet attained, or of bringing to growth wholesome states already attained. Which six? Here, monks, a monk is not skilled in what constitutes gain, is not skilled in what constitutes loss, is not skilled in the means, does not generate a wish for the attainment of wholesome states not yet attained, does not guard wholesome states already attained, and does not fulfill them with continuous effort. Monks, a monk endowed with these six qualities is indeed incapable of attaining wholesome states not yet attained, or of bringing to growth wholesome states already attained.\n\nMonks, a monk endowed with six qualities is capable of attaining wholesome states not yet attained, or of bringing to growth wholesome states already attained. Which six? Here, monks, a monk is skilled in what constitutes gain, is skilled in what constitutes loss, is skilled in the means, generates a wish for the attainment of wholesome states not yet attained, guards wholesome states already attained, and fulfills them with continuous effort. Monks, a monk endowed with these six qualities is indeed capable of attaining wholesome states not yet attained, or of bringing to growth wholesome states already attained.",
      "sinhala": "භික්‍ෂූණි, ධර්මයන් සයකින් සමන්විත වූ භික්‍ෂුවකට නොලැබූ කුශල ධර්මයක් ලබා ගැනීමට හෝ ලැබූ කුශල ධර්මයක් වැඩීමට නොහැක්කේය. ඒ කුමක්ද මේ ධර්ම සය? භික්‍ෂූණි, මෙහිලා භික්‍ෂුව ආය (දියුණුවට හේතු වන දේ) පිළිබඳ දක්ෂ නොවන්නේය, අපාය (පිරිහීමට හේතු වන දේ) පිළිබඳ දක්ෂ නොවන්නේය, උපක්‍රම (නිවැරදි ක්‍රමවේද) පිළිබඳ දක්ෂ නොවන්නේය, නොලැබූ කුශල ධර්මයන් ලබා ගැනීම පිණිස ඡන්දය (අභිලාෂය) උපදවන්නේ නැත, ලැබූ කුශල ධර්මයන් ආරක්ෂා කරන්නේ නැත, නිරන්තර ක්‍රියාකාරිත්වයෙන් (නොකඩවා වීර්ය කිරීමෙන්) ඒවා සම්පූර්ණ කරන්නේද නැත. භික්‍ෂූණි, මේ ධර්ම සයෙන් සමන්විත වූ භික්‍ෂුවකට නොලැබූ කුශල ධර්මයක් ලබා ගැනීමට හෝ ලැබූ කුශල ධර්මයක් වැඩීමට නොහැක්කේය.\n\nභික්‍ෂූණි, ධර්මයන් සයකින් සමන්විත වූ භික්‍ෂුවකට නොලැබූ කුශල ධර්මයක් ලබා ගැනීමට හෝ ලැබූ කුශල ධර්මයක් වැඩීමට හැක්කේය. ඒ කුමක්ද මේ ධර්ම සය? භික්‍ෂූණි, මෙහිලා භික්‍ෂුව ආය (දියුණුවට හේතු වන දේ) පිළිබඳ දක්ෂ වන්නේය, අපාය (පිරිහීමට හේතු වන දේ) පිළිබඳ දක්ෂ වන්නේය, උපක්‍රම (නිවැරදි ක්‍රමවේද) පිළිබඳ දක්ෂ වන්නේය, නොලැබූ කුශල ධර්මයන් ලබා ගැනීම පිණිස ඡන්දය (අභිලාෂය) උපදවයි, ලැබූ කුශල ධර්මයන් ආරක්ෂා කරයි, නිරන්තර ක්‍රියාකාරිත්වයෙන් (නොකඩවා වීර්ය කිරීමෙන්) ඒවා සම්පූර්ණ කරයි. භික්‍ෂූණි, මේ ධර්ම සයෙන් සමන්විත වූ භික්‍ෂුවකට නොලැබූ කුශල ධර්මයක් ලබා ගැනීමට හෝ ලැබූ කුශල ධර්මයක් වැඩීමට හැක්කේය.",
      "paliTitle": "Adhigamasuttaṃ",
      "englishTitle": "Discourse on Attainment",
      "sinhalaTitle": "අධිගම සූත්‍රය"
    },
    {
      "number": 80,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu nacirasseva mahantattaṃ [mahattaṃ (syā. kaṃ.)] vepullattaṃ pāpuṇāti dhammesu. Katamehi chahi? Idha, bhikkhave, bhikkhu ālokabahulo ca hoti yogabahulo ca vedabahulo ca asantuṭṭhibahulo ca anikkhittadhuro ca kusalesu dhammesu uttari ca patāreti [pakaroti (ka.)]. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu nacirasseva mahantattaṃ vepullattaṃ pāpuṇāti dhammesū’’ti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, a monk endowed with six qualities very soon attains greatness and full development in the teachings. Which six? Here, bhikkhus, a monk becomes one abundant in insight, abundant in diligent application, abundant in deep understanding, abundant in non-contentment with wholesome states, one who does not abandon the spiritual burden regarding wholesome qualities, and one who brings about further development. Indeed, bhikkhus, a monk endowed with these six qualities very soon attains greatness and full development in the teachings.",
      "sinhala": "භික්ෂූණි, ධර්‍මයන් හයකින් යුක්ත වූ භික්ෂුව, නොබෝ කලකින්ම ධර්‍මයෙහි මහත් බවටද, විපුල බවටද පැමිණෙන්නේය. ඒ ධර්‍ම හය කවරේද?\n\nභික්ෂූණි, මෙහිලා භික්ෂුව ආලෝක බහුල වන්නේය. යෝග බහුල වන්නේය. ප්‍රත්‍යක්‍ෂ ඥානය බහුල වන්නේය. කුසල ධර්‍මයන් පිළිබඳව සෑහීමකට පත් නොවන්නෙක් වන්නේය. කුසල ධර්‍මයන්හි අත්නොහළ වීර්‍යයෙන් යුක්ත වන්නේය. තවද, කුසල ධර්‍මයන් වඩාත් දියුණු කරන්නේය.\n\nභික්ෂූණි, මේ ධර්‍ම හයෙන් යුක්ත වූ භික්ෂුව, නොබෝ කලකින්ම ධර්‍මයෙහි මහත් බවටද, විපුල බවටද පැමිණෙන්නේය.",
      "paliTitle": "Mahantattasuttaṃ",
      "englishTitle": "The Discourse on Greatness",
      "sinhalaTitle": "මහන්තත්ත සූත්‍රය"
    },
    {
      "number": 81,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi chahi? Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pāpiccho ca, micchādiṭṭhi ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Chahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi chahi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, appiccho ca, sammādiṭṭhi ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Sattamaṃ.",
      "english": "Monks, one endowed with six qualities is cast into hell as surely as if they were carried and laid there. Which six? Here, one takes life, takes what is not given, engages in sexual misconduct, speaks falsely, has wicked desires, and holds wrong view. Indeed, monks, one endowed with these six qualities is cast into hell as surely as if they were carried and laid there.\n\nMonks, one endowed with six qualities is conveyed to heaven as surely as if they were carried and laid there. Which six? Here, one abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, has few desires, and holds right view. Indeed, monks, one endowed with these six qualities is conveyed to heaven as surely as if they were carried and laid there.",
      "sinhala": "භික්ෂූනි, ධර්මයන් සයකින් සමන්විත වූවෙක් යම්සේ ගෙනැවිත් හෙළුවාක් මෙන්, එසේම නිරයේ උපදී. කවර නම් සයකින් ද? ප්‍රාණඝාතය කරන්නෙක් වේ, අදත්තාදානය කරන්නෙක් වේ, කාමයන්හි වරදවා හැසිරෙන්නෙක් වේ, මුසාවාද කියන්නෙක් වේ, පවිටු කැමැත්තෙන් යුක්ත වූවෙක් ද වේ, මිත්‍යාදෘෂ්ටියෙන් යුක්ත වූවෙක් ද වේ. භික්ෂූනි, මේ සය ධර්මයන්ගෙන් සමන්විත වූවෙක් යම්සේ ගෙනැවිත් හෙළුවාක් මෙන්, එසේම නිරයේ උපදී.\n\nභික්ෂූනි, ධර්මයන් සයකින් සමන්විත වූවෙක් යම්සේ ගෙනැවිත් හෙළුවාක් මෙන්, එසේම ස්වර්ගයේ උපදී. කවර නම් සයකින් ද? ප්‍රාණඝාතයෙන් වැළකුණෙක් වේ, අදත්තාදානයෙන් වැළකුණෙක් වේ, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණෙක් වේ, මුසාවාදයෙන් වැළකුණෙක් වේ, අල්පේච්ඡ වූවෙක් ද වේ, සම්මාදිට්ඨියෙන් යුක්ත වූවෙක් ද වේ. භික්ෂූනි, මේ සය ධර්මයන්ගෙන් සමන්විත වූවෙක් යම්සේ ගෙනැවිත් හෙළුවාක් මෙන්, එසේම ස්වර්ගයේ උපදී.",
      "paliTitle": "Paṭhamanirayasuttaṃ",
      "englishTitle": "The First Hell Sutta",
      "sinhalaTitle": "ප්‍රථම නිරය සූත්‍රය"
    },
    {
      "number": 82,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi chahi [musāvādī hoti, pisuṇavācā hoti, pharusavāco hoti, samphappalāpī hoti, (sī. syā. pī.) evaṃ sukkapakkhepi]? Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti [musāvādī hoti, pisuṇavācā hoti, pharusavāco hoti, samphappalāpī hoti, (sī. syā. pī.) evaṃ sukkapakkhepi], luddho ca, pagabbho ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Chahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi chahi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, aluddho ca, appagabbho ca. Imehi kho bhikkhave chahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Aṭṭhamaṃ.",
      "english": "Monks, a person endowed with six qualities is plunged into hell as if picked up and put there. Which six? One takes the life of living beings, takes what is not given, engages in sexual misconduct, speaks falsely, is avaricious, and is presumptuous. Monks, a person endowed with these six qualities is plunged into hell as if picked up and put there.\n\nMonks, a person endowed with six qualities is plunged into heaven as if picked up and put there. Which six? One abstains from taking the life of living beings, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, is not avaricious, and is not presumptuous. Monks, a person endowed with these six qualities is plunged into heaven as if picked up and put there.",
      "sinhala": "භික්ෂූණි, ධර්මයන් සයකින් යුක්ත වූ තැනැත්තා කෙලින්ම ගෙන ගොස් දැමුවාක් මෙන් නිරයේ පිහිටුවනු ලැබේ. ඒ ධර්මයන් සය කවරේද? ඔහු ප්‍රාණඝාතයෙහි යෙදෙයි. අදින්නාදානයෙහි යෙදෙයි. කාමමිථ්‍යාචාරයෙහි යෙදෙයි. මුසාවාදයෙහි යෙදෙයි. ලෝභී ද වේ. නිර්ලජ්ජී ද වේ. භික්ෂූණි, මේ ධර්මයන් සයකින් යුක්ත වූ තැනැත්තා කෙලින්ම ගෙන ගොස් දැමුවාක් මෙන් නිරයේ පිහිටුවනු ලැබේ.\n\nභික්ෂූණි, ධර්මයන් සයකින් යුක්ත වූ තැනැත්තා කෙලින්ම ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයේ පිහිටුවනු ලැබේ. ඒ ධර්මයන් සය කවරේද? ඔහු ප්‍රාණඝාතයෙන් වෙන්වූයේ වේ. අදින්නාදානයෙන් වෙන්වූයේ වේ. කාමමිථ්‍යාචාරයෙන් වෙන්වූයේ වේ. මුසාවාදයෙන් වෙන්වූයේ වේ. අලෝභී ද වේ. ලැජ්ජාශීලී ද වේ. භික්ෂූණි, මේ ධර්මයන් සයකින් යුක්ත වූ තැනැත්තා කෙලින්ම ගෙන ගොස් දැමුවාක් මෙන් ස්වර්ගයේ පිහිටුවනු ලැබේ.",
      "paliTitle": "Dutiyanirayasuttaṃ",
      "englishTitle": "Second Discourse on Hell",
      "sinhalaTitle": "දෙවන නිරය සූත්‍රය"
    },
    {
      "number": 83,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu abhabbo aggaṃ dhammaṃ arahattaṃ sacchikātuṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu assaddho hoti, ahiriko hoti, anottappī hoti, kusīto hoti, duppañño hoti, kāye ca jīvite ca sāpekkho hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu abhabbo aggaṃ dhammaṃ arahattaṃ sacchikātuṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo aggaṃ dhammaṃ arahattaṃ sacchikātuṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu saddho hoti, hirimā hoti, ottappī hoti, āraddhavīriyo hoti, paññavā hoti, kāye ca jīvite ca anapekkho hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu bhabbo aggaṃ dhammaṃ arahattaṃ sacchikātu’’nti. Navamaṃ.",
      "english": "Monks, a bhikkhu endowed with six qualities is incapable of realizing the ultimate liberation of Arahantship. What six? Here, monks, a bhikkhu is without conviction; is without moral shame; is without moral dread; is indolent; is without penetrative wisdom; and is attached to his body and life. Monks, a bhikkhu endowed with these six qualities is indeed incapable of realizing the ultimate liberation of Arahantship.\n\nMonks, a bhikkhu endowed with six qualities is capable of realizing the ultimate liberation of Arahantship. What six? Here, monks, a bhikkhu is endowed with conviction; is endowed with moral shame; is endowed with moral dread; is resolute in his effort; is endowed with penetrative wisdom; and is unattached to his body and life. Monks, a bhikkhu endowed with these six qualities is indeed capable of realizing the ultimate liberation of Arahantship.",
      "sinhala": "මහණෙනි, ධර්ම සයක් ඇති භික්ෂුව අර්හත්වය නම් වූ අග්‍ර ධර්මය සාක්ෂාත් කිරීමට නුසුදුසු ය. ඒ සය කවරේ ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව ශ්‍රද්ධාවෙන් තොර වේ; හිරියෙන් තොර වේ; ඔත්තප්පයෙන් තොර වේ; අලස වේ; ප්‍රඥාවෙන් තොර වේ; කය සහ ජීවිතය කෙරෙහි ඇල්මක් ඇතිව වාසය කරයි. මහණෙනි, මෙබඳු ධර්ම සයක් ඇති භික්ෂුව අර්හත්වය නම් වූ අග්‍ර ධර්මය සාක්ෂාත් කිරීමට නුසුදුසු ය.\n\nමහණෙනි, ධර්ම සයක් ඇති භික්ෂුව අර්හත්වය නම් වූ අග්‍ර ධර්මය සාක්ෂාත් කිරීමට සුදුසු ය. ඒ සය කවරේ ද? මහණෙනි, මේ ශාසනයෙහි භික්ෂුව ශ්‍රද්ධාවෙන් යුක්ත වේ; හිරියෙන් යුක්ත වේ; ඔත්තප්පයෙන් යුක්ත වේ; වීර්යය පටන්ගත්තෙක් වේ; ප්‍රඥාවන්ත වේ; කය සහ ජීවිතය කෙරෙහි ඇල්මක් නැතිව වාසය කරයි. මහණෙනි, මෙබඳු ධර්ම සයක් ඇති භික්ෂුව අර්හත්වය නම් වූ අග්‍ර ධර්මය සාක්ෂාත් කිරීමට සුදුසු ය.",
      "paliTitle": "Aggadhammasuttaṃ",
      "englishTitle": "The Aggadhamma Discourse",
      "sinhalaTitle": "අග්‍ර ධර්‍ම සූත්‍රය"
    },
    {
      "number": 84,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgatassa bhikkhuno yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi. Katamehi chahi? Idha, bhikkhave, bhikkhu mahiccho hoti, vighātavā, asantuṭṭho, itarītaracīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena, assaddho hoti, dussīlo hoti, kusīto hoti, muṭṭhassati hoti, duppañño hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgatassa bhikkhuno yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu, no vuddhi. ‘‘Chahi, bhikkhave, dhammehi samannāgatassa bhikkhuno yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Katamehi chahi? Idha, bhikkhave, bhikkhu na mahiccho hoti, avighātavā, santuṭṭho, itarītaracīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena, saddho hoti, sīlavā hoti, āraddhavīriyo hoti, satimā hoti, paññavā hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgatassa bhikkhuno yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā, kusalesu dhammesu no parihānī’’ti. Dasamaṃ. ",
      "english": "Monks, for a monk endowed with six qualities, as the night or day passes, only decline is to be expected in wholesome states, not growth. What are these six? Here, monks, a monk is greedy, full of ill-will, discontented with any kind of robes, almsfood, dwelling, and medicinal requisites for the sick; he is faithless, immoral, lazy, unmindful, and unwise. For a monk endowed with these six qualities, monks, as the night or day passes, only decline is to be expected in wholesome states, not growth.\n\nMonks, for a monk endowed with six qualities, as the night or day passes, only growth is to be expected in wholesome states, not decline. What are these six? Here, monks, a monk is not greedy, free from ill-will, contented with any kind of robes, almsfood, dwelling, and medicinal requisites for the sick; he is faithful, virtuous, energetic, mindful, and wise. For a monk endowed with these six qualities, monks, as the night or day passes, only growth is to be expected in wholesome states, not decline.",
      "sinhala": "භික්ෂූණි, ධර්ම සයක් සමගින් යුක්ත වූ භික්ෂුවකට යම් රාත්‍රියක් හෝ දිවා කාලයක් හෝ උදා වේද, කුසල ධර්මයන්හි හානියක්ම අපේක්ෂා කළ යුත්තේය, දියුණුවක් නොවේ. ඒ ධර්ම සය කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව මහා ඉච්ඡාවෙන් යුක්ත වෙයි, අතිශයින් දුක් සහිත වෙයි, යම්කිසි චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකරකින් සතුටු නොවන්නේ වෙයි, ශ්‍රද්ධාව රහිත වෙයි, දුශ්ශීල වෙයි, කම්මැලි වෙයි, මුළා වූ සිහියෙන් යුක්ත වෙයි, දුෂ්ප්‍රඥා ඇත්තෙක් වෙයි. භික්ෂූණි, මේ ධර්ම සය සමගින් යුක්ත වූ භික්ෂුවකට යම් රාත්‍රියක් හෝ දිවා කාලයක් හෝ උදා වේද, කුසල ධර්මයන්හි හානියක්ම අපේක්ෂා කළ යුත්තේය, දියුණුවක් නොවේ.\n\nභික්ෂූණි, ධර්ම සයක් සමගින් යුක්ත වූ භික්ෂුවකට යම් රාත්‍රියක් හෝ දිවා කාලයක් හෝ උදා වේද, කුසල ධර්මයන්හි දියුණුවක්ම අපේක්ෂා කළ යුත්තේය, පරිහානියක් නොවේ. ඒ ධර්ම සය කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුව මහා ඉච්ඡාවෙන් යුක්ත නොවන්නේ වෙයි, දුක් සහිත නොවන්නේ වෙයි, යම්කිසි චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකරකින් සතුටු වන්නේ වෙයි, ශ්‍රද්ධාවෙන් යුක්ත වෙයි, සිල්වත් වෙයි, ආරම්භ කළ වීර්යයෙන් යුක්ත වෙයි, සිහියෙන් යුක්ත වෙයි, ප්‍රඥාවෙන් යුක්ත වෙයි. භික්ෂූණි, මේ ධර්ම සය සමගින් යුක්ත වූ භික්ෂුවකට යම් රාත්‍රියක් හෝ දිවා කාලයක් හෝ උදා වේද, කුසල ධර්මයන්හි දියුණුවක්ම අපේක්ෂා කළ යුත්තේය, පරිහානියක් නොවේ.",
      "paliTitle": "Rattidivasasuttaṃ",
      "englishTitle": "The Night and Day Sutta",
      "sinhalaTitle": "රාත්‍රී දිවා සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Arahattavaggo aṭṭhamo. [tatiyo (syā. ka.)] Tassuddānaṃ – Dukkhaṃ arahattaṃ uttari ca, sukhaṃ adhigamena ca; Mahantattaṃ dvayaṃ niraye [mahattadvayaniraye (syā.)], aggadhammañca rattiyoti.",
    "english": "The Eighth Chapter on Arahantship",
    "sinhala": "අටවැනි අරහත් ව‍ර්ගය"
  }
}