{
  "id": "an6.4",
  "title": {
    "pali": "Devatāvaggo",
    "english": "The Chapter on Divinities",
    "sinhala": "දේවතා වග්ගය"
  },
  "sections": [
    {
      "number": 31,
      "pali": "‘‘Chayime, bhikkhave, dhammā sekhassa bhikkhuno parihānāya saṃvattanti. Katame cha? Kammārāmatā, bhassārāmatā, niddārāmatā, saṅgaṇikārāmatā, indriyesu aguttadvāratā, bhojane amattaññutā – ime kho, bhikkhave, cha dhammā sekhassa bhikkhuno parihānāya saṃvattanti. ‘‘Chayime, bhikkhave, dhammā sekhassa bhikkhuno aparihānāya saṃvattanti. Katame cha? Na kammārāmatā, na bhassārāmatā, na niddārāmatā, na saṅgaṇikārāmatā, indriyesu guttadvāratā, bhojane mattaññutā – ime kho, bhikkhave, cha dhammā sekhassa bhikkhuno aparihānāya saṃvattantī’’ti. Paṭhamaṃ.",
      "english": "Monks, these six things conduce to the decline of a disciple in training. Which six? Delight in activity, delight in idle chatter, delight in sleep, delight in company, unguarded sense doors, and a lack of moderation in food. These six things, monks, conduce to the decline of a disciple in training.\n\nMonks, these six things conduce to the non-decline of a disciple in training. Which six? Not delighting in activity, not delighting in idle chatter, not delighting in sleep, not delighting in company, guarding the sense doors, and moderation in food. These six things, monks, conduce to the non-decline of a disciple in training.",
      "sinhala": "මහණෙනි, සිල්වත් භික්‍ෂුවකගේ පිරිහීමට හේතු වන මේ ධර්‍ම හයක් ඇත. ඒ හය කවරේද? කර්‍මයන්හි ඇලී සිටීම, කතාවෙහි ඇලී සිටීම, නිදීමෙහි ඇලී සිටීම, සමූහයා හා ඇසුරෙහි ඇලී සිටීම, ඉන්ද්‍රියයන්හි අරක් නොගත් දොරටු ඇති බව, භෝජනයෙහි පමණ නොදැනීම යනුයි. මහණෙනි, මේ ධර්‍ම හයම සිල්වත් භික්‍ෂුවකගේ පිරිහීමට හේතු වේ.\n\nමහණෙනි, සිල්වත් භික්‍ෂුවකගේ නොපිරිහීමට හේතු වන මේ ධර්‍ම හයක් ඇත. ඒ හය කවරේද? කර්‍මයන්හි නොඇලී සිටීම, කතාවෙහි නොඇලී සිටීම, නිදීමෙහි නොඇලී සිටීම, සමූහයා හා ඇසුරෙහි නොඇලී සිටීම, ඉන්ද්‍රියයන්හි අරක්ගත් දොරටු ඇති බව, භෝජනයෙහි පමණ දැනීම යනුයි. මහණෙනි, මේ ධර්‍ම හයම සිල්වත් භික්‍ෂුවකගේ නොපිරිහීමට හේතු වේ.",
      "paliTitle": "Sekhasuttaṃ"
    },
    {
      "number": 32,
      "pali": "Atha kho aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho sā devatā bhagavantaṃ etadavoca – ‘‘Chayime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame cha? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, appamādagāravatā, paṭisanthāragāravatā [paṭisandhāragāravatā (ka.)] – ime kho, bhante, cha dhammā bhikkhuno aparihānāya saṃvattantī’’ti. Idamavoca sā devatā. Samanuñño satthā ahosi. Atha kho sā devatā ‘‘samanuñño me satthā’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho, bhikkhave, sā devatā maṃ etadavoca – ‘chayime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame cha? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, appamādagāravatā, paṭisanthāragāravatā – ime kho, bhante, cha dhammā bhikkhuno aparihānāya saṃvattantī’ti. Idamavoca, bhikkhave, sā devatā. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. ‘‘Satthugaru dhammagaru, saṅghe ca tibbagāravo; Appamādagaru bhikkhu, paṭisanthāragāravo; Abhabbo parihānāya, nibbānasseva santike’’ti. dutiyaṃ;",
      "english": "Then, as the night was advancing, a certain deity, with resplendent beauty, illuminating the entire Jeta Grove, approached the Blessed One. Having approached, she paid homage to the Blessed One and stood to one side. Standing to one side, that deity said to the Blessed One: \"Venerable sir, these six qualities lead to a bhikkhu's non-decline and growth on the path. What are these six? Reverence for the Teacher, reverence for the Dhamma, reverence for the Saṅgha, reverence for the training, reverence for heedfulness, and reverence for hospitality – Venerable sir, these six qualities indeed lead to a bhikkhu's non-decline.\" That deity spoke thus. The Teacher assented. Then, thinking \"The Teacher has assented to me,\" that deity paid homage to the Blessed One, circled him clockwise, and then vanished right there.\n\nThen, when that night had passed, the Blessed One addressed the bhikkhus: \"Bhikkhus, this past night, a certain deity, as the night was advancing, with resplendent beauty, illuminating the entire Jeta Grove, approached me. Having approached, she paid homage to me and stood to one side. Standing to one side, bhikkhus, that deity said to me: 'Venerable sir, these six qualities lead to a bhikkhu's non-decline and growth on the path. What are these six? Reverence for the Teacher, reverence for the Dhamma, reverence for the Saṅgha, reverence for the training, reverence for heedfulness, and reverence for hospitality – Venerable sir, these six qualities indeed lead to a bhikkhu's non-decline.' Bhikkhus, that deity spoke thus. Having said this, she paid homage to me, circled me clockwise, and then vanished right there.\"\n\nThe bhikkhu who reveres the Teacher, reveres the Dhamma,\nAnd has intense reverence for the Saṅgha;\nThe bhikkhu who reveres heedfulness, reveres hospitality;\nIs incapable of decline and is truly close to Nibbāna.",
      "sinhala": "එසමයෙහි එක්තරා දෙවියෙක් අභිරම්‍ය රාත්‍රියෙහි, අභිරම්‍ය වර්ණයෙන් මුළු ජේතවනාරාමයම බබුළුවා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව සිටියේය. එකත්පස්ව සිටි ඒ දෙවියා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: “ස්වාමීනි, මේ ධර්ම සයක් භික්ෂුවකගේ පිරිහීමට පත් නොවීම පිණිස පවතී. කවරේද ඒ සය? ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවය, ධර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, අප්‍රමාදය කෙරෙහි ගෞරවය, සහ ප්‍රණීතව පිළිගැනීම කෙරෙහි ගෞරවය යන මේ ධර්ම සය භික්ෂුවකගේ පිරිහීමට පත් නොවීම පිණිස පවතී.” ඒ දෙවියා මෙය පැවසීය. ශාස්තෘන් වහන්සේ එය අනුමත කළසේක. ඉක්බිති ඒ දෙවියා “ශාස්තෘන් වහන්සේ මා අනුමත කළසේකැ”යි සිතා භාග්‍යවතුන් වහන්සේට වන්දනා කොට ප්‍රදක්ෂිණා කර, එතැනම අතුරුදහන් විය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ රාත්‍රිය අවසන් වූ කල්හි භික්ෂූන් වහන්සේලා අමතා මෙසේ වදාළසේක: “මහණෙනි, මේ රාත්‍රියේ එක්තරා දෙවියෙක් අභිරම්‍ය රාත්‍රියෙහි, අභිරම්‍ය වර්ණයෙන් මුළු ජේතවනාරාමයම බබුළුවා මා වෙත පැමිණියේය. පැමිණ මට වන්දනා කොට එකත්පස්ව සිටියේය. මහණෙනි, එකත්පස්ව සිටි ඒ දෙවියා මට මෙය පැවසීය: ‘ස්වාමීනි, මේ ධර්ම සයක් භික්ෂුවකගේ පිරිහීමට පත් නොවීම පිණිස පවතී. කවරේද ඒ සය? ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවය, ධර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, අප්‍රමාදය කෙරෙහි ගෞරවය, සහ ප්‍රණීතව පිළිගැනීම කෙරෙහි ගෞරවය යන මේ ධර්ම සය භික්ෂුවකගේ පිරිහීමට පත් නොවීම පිණිස පවතී.’ මහණෙනි, ඒ දෙවියා මෙය පැවසීය. මෙය පවසා මට වන්දනා කොට ප්‍රදක්ෂිණා කර, එතැනම අතුරුදහන් විය.”\n\nශාස්තෘන් වහන්සේට ගරු කරන, ධර්මයට ගරු කරන, සංඝයා කෙරෙහි තදින් ගෞරවය ඇති; අප්‍රමාදයට ගරු කරන, සහ ප්‍රණීතව පිළිගැනීමට ගරු කරන භික්ෂුව, පිරිහීමට පත් නොවීමට සමර්ථය. නිරන්තරයෙන්ම නිවනට සමීපව සිටියි.",
      "paliTitle": "Paṭhamaaparihānasuttaṃ"
    },
    {
      "number": 33,
      "pali": "‘‘Imaṃ, bhikkhave, rattiṃ aññatarā devatā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitā kho, bhikkhave, sā devatā maṃ etadavoca – ‘chayime, bhante, dhammā bhikkhuno aparihānāya saṃvattanti. Katame cha? Satthugāravatā, dhammagāravatā, saṅghagāravatā, sikkhāgāravatā, hirigāravatā, ottappagāravatā – ime kho, bhante, cha dhammā bhikkhuno aparihānāya saṃvattantī’ti. Idamavoca, bhikkhave, sā devatā. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. ‘‘Satthugaru dhammagaru, saṅghe ca tibbagāravo; Hiriottappasampanno, sappatisso sagāravo; Abhabbo parihānāya, nibbānasseva santike’’ti. tatiyaṃ;",
      "english": "Monks, this very night, a certain deity, when the night was far advanced and of surpassing beauty, illuminating the entire Jeta Grove, came to where I was. Having approached, she paid homage to me and stood to one side. Monks, as she stood to one side, that deity said to me: ‘Venerable Sir, there are these six qualities that lead to a monk's non-decline. What are these six? Reverence for the Teacher, reverence for the Dhamma, reverence for the Sangha, reverence for the training, moral shame, and moral dread. Indeed, Venerable Sir, these six qualities lead to a monk's non-decline.’ Monks, that deity said this. Having said this, she paid homage to me, circumambulated me with her right side towards me, and then vanished right there.\n\nOne who reveres the Teacher, reveres the Dhamma, and holds deep reverence for the Sangha; endowed with moral shame and moral dread, respectful and reverent; is incapable of decline, and is certainly close to Nibbana.",
      "sinhala": "භික්ෂූණි, මේ රාත්‍රියේ, රාත්‍රිය පහන් වෙද්දී, අතිශයින් දීප්තිමත් වූ වර්ණයෙන් යුත් එකතරා දේවතාවියක් මුළු ජේතවනාරාමයම බබුළුවා, මා සිටින තැනට පැමිණියාය. පැමිණ, මට ආචාර කොට, එකත්පස්ව සිට ගත්තාය. භික්ෂූණි, එකත්පස්ව සිටි ඒ දේවතාවිය මාහට මෙසේ කීවාය: ‘ස්වාමීනි, ධර්ම හයක් භික්ෂුවකට පිරිහීමට පත් නොවීමට හේතු වෙයි. ඒ කවර හයක්ද? ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවය, ධර්මය කෙරෙහි ගෞරවය, සංඝයා කෙරෙහි ගෞරවය, ශික්ෂාව කෙරෙහි ගෞරවය, පවට ලජ්ජා වීම කෙරෙහි ගෞරවය, පවට බිය වීම කෙරෙහි ගෞරවය – ස්වාමීනි, මේ ධර්ම හය භික්ෂුවකට පිරිහීමට පත් නොවීමට හේතු වෙයි’ කියාය. භික්ෂූණි, ඒ දේවතාවිය මෙය කීවාය. මෙය කියා, මට ආචාර කොට, ප්‍රදක්ෂිණා කොට, එහිම අතුරුදහන් වූවාය.\n\nශාස්තෘන් වහන්සේ කෙරෙහි ගරු කරන, ධර්මය කෙරෙහි ගරු කරන, සංඝයා කෙරෙහි ද දැඩි ගෞරවයෙන් යුතු, ලජ්ජාවෙන් හා බියෙන් යුක්ත වූ, ගෞරවයෙන් හා භක්තියෙන් යුක්ත වූ තැනැත්තා පිරිහීමකට පත් නොවන්නේය. නිර්වාණයටම ආසන්න වෙයි.",
      "paliTitle": "Dutiyaaparihānasuttaṃ"
    },
    {
      "number": 34,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmato mahāmoggallānassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘katamesānaṃ devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma [sotāpannāmhā (sī.), sotāpannāmha (syā. kaṃ. pī.)] avinipātadhammā niyatā sambodhiparāyaṇā’’’ti? Tena kho pana samayena tisso nāma bhikkhu adhunākālaṅkato aññataraṃ brahmalokaṃ upapanno hoti. Tatrapi naṃ evaṃ jānanti – ‘‘tisso brahmā mahiddhiko mahānubhāvo’’ti. Atha kho āyasmā mahāmoggallāno – seyyathāpi nāma balavā puriso samiñjitaṃ [sammiñjitaṃ (sī. syā. kaṃ. pī.)] vā bāhaṃ pasāreyya pasāritaṃ vā bāhaṃ samiñjeyya, evamevaṃ – jetavane antarahito tasmiṃ brahmaloke pāturahosi. Addasā kho tisso brahmā āyasmantaṃ mahāmoggallānaṃ dūratova āgacchantaṃ. Disvāna āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘ehi kho, mārisa moggallāna; svāgataṃ [sāgataṃ (sī.)], mārisa moggallāna; cirassaṃ kho, mārisa moggallāna; imaṃ pariyāyamakāsi, yadidaṃ idhāgamanāya. Nisīda, mārisa moggallāna, idamāsanaṃ paññatta’’nti. Nisīdi kho āyasmā mahāmoggallāno paññatte āsane. Tissopi kho brahmā āyasmantaṃ mahāmoggallānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho tissaṃ brahmānaṃ āyasmā mahāmoggallāno etadavoca – ‘‘Katamesānaṃ kho, tissa, devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’’’ti? ‘‘Cātumahārājikānaṃ kho, mārisa moggallāna, devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’’’ti. ‘‘Sabbesaññeva nu kho, tissa, cātumahārājikānaṃ devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’’’ti? ‘‘Na kho, mārisa moggallāna, sabbesaṃ cātumahārājikānaṃ devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’ti. Ye kho te, mārisa moggallāna, cātumahārājikā devā buddhe aveccappasādena asamannāgatā dhamme aveccappasādena asamannāgatā saṅghe aveccappasādena asamannāgatā ariyakantehi sīlehi asamannāgatā na tesaṃ devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’ti. Ye ca kho te, mārisa moggallāna, cātumahārājikā devā buddhe aveccappasādena samannāgatā, dhamme aveccappasādena samannāgatā, saṅghe aveccappasādena samannāgatā ariyakantehi sīlehi samannāgatā, tesaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’’’ti. ‘‘Cātumahārājikānaññeva nu kho, tissa, devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’ti udāhu tāvatiṃsānampi devānaṃ…pe… yāmānampi devānaṃ… tusitānampi devānaṃ… nimmānaratīnampi devānaṃ… paranimmitavasavattīnampi devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’’’ti? ‘‘Paranimmitavasavattīnampi kho, mārisa moggallāna, devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’’’ti. ‘‘Sabbesaññeva nu kho, tissa, paranimmitavasavattīnaṃ devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’’’ti? ‘‘Na kho, mārisa moggallāna, sabbesaṃ paranimmitavasavattīnaṃ devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’ti. Ye kho te, mārisa moggallāna, paranimmitavasavattī devā buddhe aveccappasādena asamannāgatā, dhamme aveccappasādena asamannāgatā, saṅghe aveccappasādena asamannāgatā, ariyakantehi sīlehi asamannāgatā, na tesaṃ devānaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’ti. Ye ca kho te, mārisa moggallāna, paranimmitavasavattī devā buddhe aveccappasādena samannāgatā, dhamme aveccappasādena samannāgatā, saṅghe aveccappasādena samannāgatā, ariyakantehi sīlehi samannāgatā tesaṃ evaṃ ñāṇaṃ hoti – ‘sotāpannā nāma avinipātadhammā niyatā sambodhiparāyaṇā’’’ti. Atha kho āyasmā mahāmoggallāno tissassa brahmuno bhāsitaṃ abhinanditvā anumoditvā – ‘‘seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evamevaṃ – ‘brahmaloke antarahito jetavane pāturahosī’’’ti. Catutthaṃ.",
      "english": "On one occasion, the Blessed One was staying at Savatthi, in Jeta's Grove, Anathapindika's monastery. Then, while the Venerable Maha Moggallana was in solitude and seclusion, this thought arose in his mind: \"Which devas have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'?\"\n\nNow, at that time, a bhikkhu named Tissa had recently passed away and had been reborn in a certain brahma-world. There, they knew him as \"Brahma Tissa, mighty and powerful.\" Then, just as a strong person might extend a flexed arm or flex an extended arm, so too the Venerable Maha Moggallana disappeared from Jeta's Grove and appeared in that brahma-world.\n\nBrahma Tissa saw the Venerable Maha Moggallana coming from afar. Having seen the Venerable Maha Moggallana, he said to him: \"Come, friend Moggallana; welcome, friend Moggallana; it has been a long time, friend Moggallana, since you made this journey to come here. Sit down, friend Moggallana, this seat is prepared for you.\" The Venerable Maha Moggallana sat down on the prepared seat. And Brahma Tissa, having paid homage to the Venerable Maha Moggallana, sat down to one side.\n\nTo Brahma Tissa, who was seated to one side, the Venerable Maha Moggallana said this: \"Which devas, Tissa, have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'?\"\n\n\"The devas of the Four Great Kings, friend Moggallana, have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'.\"\n\n\"Do all the devas of the Four Great Kings, Tissa, have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'?\"\n\n\"No, friend Moggallana, not all the devas of the Four Great Kings have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'. Those devas of the Four Great Kings, friend Moggallana, who are not endowed with unwavering faith in the Buddha, not endowed with unwavering faith in the Dhamma, not endowed with unwavering faith in the Sangha, and not endowed with the virtues cherished by the noble ones—those devas do not have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'. But those devas of the Four Great Kings, friend Moggallana, who are endowed with unwavering faith in the Buddha, endowed with unwavering faith in the Dhamma, endowed with unwavering faith in the Sangha, and endowed with the virtues cherished by the noble ones—those devas do have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'.\"\n\n\"Is it only the devas of the Four Great Kings, Tissa, who have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'—or do the devas of Tavatimsa, Yama, Tusita, Nimmanarati, and Paranimmita-vasavatti also have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'?\"\n\n\"Even the devas of Paranimmita-vasavatti, friend Moggallana, have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'.\"\n\n\"Do all the devas of Paranimmita-vasavatti, Tissa, have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'?\"\n\n\"No, friend Moggallana, not all the devas of Paranimmita-vasavatti have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'. Those devas of Paranimmita-vasavatti, friend Moggallana, who are not endowed with unwavering faith in the Buddha, not endowed with unwavering faith in the Dhamma, not endowed with unwavering faith in the Sangha, and not endowed with the virtues cherished by the noble ones—those devas do not have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'. But those devas of Paranimmita-vasavatti, friend Moggallana, who are endowed with unwavering faith in the Buddha, endowed with unwavering faith in the Dhamma, endowed with unwavering faith in the Sangha, and endowed with the virtues cherished by the noble ones—those devas do have this knowledge: 'Those called stream-enterers are by nature not subject to falling into lower realms, are certain of their ultimate goal, and are bound for supreme enlightenment'.\"\n\nThen the Venerable Maha Moggallana, having approved and rejoiced in what Brahma Tissa had said, just as a strong person might extend a flexed arm or flex an extended arm, disappeared from the brahma-world and appeared in Jeta's Grove.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ තනිව, විවේකයෙන් වැඩසිටින කල්හි මෙබඳු සිතුවිල්ලක් පහළ විය: ‘‘‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් කවර දෙවියන්ට ඇත්ද?’’ එසමයෙහි තිස්ස නම් භික්ෂුවක් අලුතෙන් කළුරිය කොට යම් බ්‍රහ්මලෝකයක උපත ලබා සිටියේය. එහිදීද ‘‘තිස්ස බ්‍රහ්මයා මහත් සෘද්ධි ඇත්තෙකි, මහත් ආනුභාව සම්පන්නයෙකි’’ යනුවෙන් ඔහු හඳුනති. එකල්හි ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ, යම්සේ බලවත් පුරුෂයෙක් හැකිලූ බාහුව දිග හරින්නේද, දිග හැරී බාහුව හැකිළුවද, එපරිද්දෙන්ම ජේතවනාරාමයෙහි අතුරුදන්ව, ඒ බ්‍රහ්මලෝකයෙහි පහළ වූ සේක. තිස්ස බ්‍රහ්මයා ඈතදීම වැඩඑන ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ දුටුවේය. දැක, ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: ‘‘මිත්‍ර මෝග්ගල්ලානයෙනි, වඩිනු මැනවි. මිත්‍ර මෝග්ගල්ලානයෙනි, ඔබ සාදරයෙන් පිළිගනිමු. මිත්‍ර මෝග්ගල්ලානයෙනි, මෙහි පැමිණීමට මෙබඳු ගමනක් ඔබ බොහෝ කලකින් කළේය. මිත්‍ර මෝග්ගල්ලානයෙනි, වාඩිවනු මැනවි, මේ අසුන සූදානම් කර ඇත.’’ ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ සූදානම් කර තිබූ අසුනෙහි වැඩසිටි සේක. තිස්ස බ්‍රහ්මයාද ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි තිස්ස බ්‍රහ්මයාට ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ මෙසේ වදාළ සේක: ‘‘තිස්ස, ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් කවර දෙවියන්ට ඇත්ද?’’\n\n‘‘මිත්‍ර මෝග්ගල්ලානයෙනි, සිව්මහරජ දෙවියන්ට ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් ඇත.’’ ‘‘තිස්ස, සිව්මහරජ දෙවියන් සියල්ලන්ටම ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් ඇත්ද?’’ ‘‘මිත්‍ර මෝග්ගල්ලානයෙනි, සිව්මහරජ දෙවියන් සියල්ලන්ටම ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් නැත. මිත්‍ර මෝග්ගල්ලානයෙනි, යම් සිව්මහරජ දෙවියෝ බුදුන් කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත නොවෙත්ද, ධර්මය කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත නොවෙත්ද, සංඝයා කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත නොවෙත්ද, ආර්යකාන්ත ශීලයෙන් යුක්ත නොවෙත්ද, ඒ දෙවියන්ට ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් නැත. මිත්‍ර මෝග්ගල්ලානයෙනි, යම් සිව්මහරජ දෙවියෝ බුදුන් කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත වෙත්ද, ධර්මය කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත වෙත්ද, සංඝයා කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත වෙත්ද, ආර්යකාන්ත ශීලයෙන් යුක්ත වෙත්ද, ඒ දෙවියන්ට ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් ඇත.’’\n\n‘‘තිස්ස, ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානය සිව්මහරජ දෙවියන්ට පමණක් ඇත්ද, නැතහොත් තව්තිසා දෙවියන්ටද, යාම දෙවියන්ටද, තුසිත දෙවියන්ටද, නිර්මාණරති දෙවියන්ටද, පරනිම්මිතවසවත්ති දෙවියන්ටද ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් ඇත්ද?’’ ‘‘මිත්‍ර මෝග්ගල්ලානයෙනි, පරනිම්මිතවසවත්ති දෙවියන්ටද ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් ඇත.’’ ‘‘තිස්ස, පරනිම්මිතවසවත්ති දෙවියන් සියල්ලන්ටම ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් ඇත්ද?’’ ‘‘මිත්‍ර මෝග්ගල්ලානයෙනි, පරනිම්මිතවසවත්ති දෙවියන් සියල්ලන්ටම ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් නැත. මිත්‍ර මෝග්ගල්ලානයෙනි, යම් පරනිම්මිතවසවත්ති දෙවියෝ බුදුන් කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත නොවෙත්ද, ධර්මය කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත නොවෙත්ද, සංඝයා කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත නොවෙත්ද, ආර්යකාන්ත ශීලයෙන් යුක්ත නොවෙත්ද, ඒ දෙවියන්ට ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් නැත. මිත්‍ර මෝග්ගල්ලානයෙනි, යම් පරනිම්මිතවසවත්ති දෙවියෝ බුදුන් කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත වෙත්ද, ධර්මය කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත වෙත්ද, සංඝයා කෙරෙහි චලනය නොවන ප්‍රසාදයෙන් යුක්ත වෙත්ද, ආර්යකාන්ත ශීලයෙන් යුක්ත වෙත්ද, ඒ දෙවියන්ට ‘සෝවාන් වූවෝ නම් අපායට නොවැටෙන ස්වභාවය ඇත්තෝය, නිශ්චිත වශයෙන් සම්බෝධිය පරමායන කොට ඇත්තෝය’ යන මෙබඳු ඥානයක් ඇත.’’\n\nඑකල්හි ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ තිස්ස බ්‍රහ්මයාගේ බසට සතුටු වී අනුමෝදන් වී, යම්සේ බලවත් පුරුෂයෙක් හැකිලූ බාහුව දිග හරින්නේද, දිග හැරී බාහුව හැකිළුවද, එපරිද්දෙන්ම බ්‍රහ්මලෝකයෙහි අතුරුදන්ව ජේතවනාරාමයෙහි පහළ වූ සේක.",
      "paliTitle": "Mahāmoggallānasuttaṃ"
    },
    {
      "number": 35,
      "pali": "‘‘Chayime, bhikkhave, dhammā vijjābhāgiyā. Katame cha? Aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā, nirodhasaññā – ime kho, bhikkhave, cha dhammā vijjābhāgiyā’’ti. Pañcamaṃ.",
      "english": "Monastics, there are these six qualities conducive to true knowledge. Which six? The perception of impermanence; the perception of suffering in what is impermanent; the perception of non-self in suffering; the perception of abandonment; the perception of dispassion; the perception of cessation. These, monastics, are the six qualities conducive to true knowledge.",
      "sinhala": "මහණෙනි, විද්‍යාවට භාග්‍යවන්ත වූ ධර්මයෝ සය දෙනෙක් වෙති. ඒ සය දෙනා කවරහුද යත්: අනිත්‍ය සංඥාව, අනිත්‍ය වූ දෙයෙහි දුක්ඛ සංඥාව, දුකෙහි අනාත්ම සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව, නිරෝධ සංඥාවයි. මහණෙනි, මේ ධර්මයෝ සය දෙන විද්‍යාවට භාග්‍යවන්ත වෙති.",
      "paliTitle": "Vijjābhāgiyasuttaṃ"
    },
    {
      "number": 36,
      "pali": "[dī. ni. 3.325; ma. ni. 3.44; cūḷava. 216] ‘‘Chayimāni, bhikkhave, vivādamūlāni. Katamāni cha? Idha, bhikkhave, bhikkhu kodhano hoti upanāhī. Yo so, bhikkhave, bhikkhu kodhano hoti upanāhī so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu satthari agāravo viharati appatisso, dhamme agāravo viharati appatisso, saṅghe agāravo viharati appatisso, sikkhāya na paripūrakārī so saṅghe vivādaṃ janeti, yo hoti vivādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpaṃ ce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha. Tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpaṃ ce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha, tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṃ hoti. Evametassa pāpakassa vivādamūlassa āyatiṃ anavassavo hoti. ‘‘Puna caparaṃ, bhikkhave, bhikkhu makkhī hoti paḷāsī…pe… issukī hoti maccharī… saṭho hoti māyāvī… pāpiccho hoti micchādiṭṭhi… sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī. Yo so, bhikkhave, bhikkhu sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, bhikkhave, bhikkhu satthari agāravo viharati appatisso, dhamme…pe… saṅghe agāravo viharati appatisso, sikkhāya na paripūrakārī, so saṅghe vivādaṃ janeti, yo hoti vivādo bahujanāhitāya bahujanāsukhāya bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpaṃ ce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha. Tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpaṃ ce tumhe, bhikkhave, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha. Tatra tumhe, bhikkhave, tasseva pāpakassa vivādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṃ hoti. Evametassa pāpakassa vivādamūlassa āyatiṃ anavassavo hoti. Imāni kho, bhikkhave, cha vivādamūlānī’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these six roots of contention. What are these six? Here, monks, a bhikkhu is given to anger and resentment. That bhikkhu, monks, who is given to anger and resentment, dwells without respect and without deference for the Teacher, without respect and without deference for the Dhamma, without respect and without deference for the Sangha, and does not fully fulfill the training. That bhikkhu, monks, who dwells without respect and without deference for the Teacher, without respect and without deference for the Dhamma, without respect and without deference for the Sangha, and does not fully fulfill the training, creates contention within the Sangha. Such contention leads to the harm of many people, to the unhappiness of many people, to the disadvantage, detriment, and suffering of many people, both devas and humans. Monks, if you were to discern such a root of contention, whether internally or externally, then, monks, you should strive for the abandonment of that detrimental root of contention. If, monks, you do not discern such a root of contention, whether internally or externally, then, monks, you should practice for the non-arising of that detrimental root of contention in the future. Thus, there is the abandonment of that detrimental root of contention. Thus, there is the non-arising of that detrimental root of contention in the future.\n\nFurthermore, monks, a bhikkhu is contemptuous and arrogant; or envious and stingy; or fraudulent and deceitful; or of evil desires and wrong views; or one who grasps firmly onto his own views, holding them stubbornly and finding it hard to relinquish them. That bhikkhu, monks, who grasps firmly onto his own views, holding them stubbornly and finding it hard to relinquish them, dwells without respect and without deference for the Teacher, without respect and without deference for the Dhamma, without respect and without deference for the Sangha, and does not fully fulfill the training. That bhikkhu, monks, who dwells without respect and without deference for the Teacher, without respect and without deference for the Dhamma, without respect and without deference for the Sangha, and does not fully fulfill the training, creates contention within the Sangha. Such contention leads to the harm of many people, to the unhappiness of many people, to the disadvantage, detriment, and suffering of many people, both devas and humans. Monks, if you were to discern such a root of contention, whether internally or externally, then, monks, you should strive for the abandonment of that detrimental root of contention. If, monks, you do not discern such a root of contention, whether internally or externally, then, monks, you should practice for the non-arising of that detrimental root of contention in the future. Thus, there is the abandonment of that detrimental root of contention. Thus, there is the non-arising of that detrimental root of contention in the future. These, monks, are the six roots of contention.",
      "sinhala": "භික්ෂූණි, මේ විවාද මූල හයකි. ඒ හය කුමක්ද? භික්ෂූණි, මෙහිලා යම් භික්ෂුවක් කිපෙනසුලු වන්නේද, වෛර බැඳගන්නේද. භික්ෂූණි, ඒ යම් භික්ෂුවක් කිපෙනසුලු වී, වෛර බැඳගන්නා කෙනෙක් වේද, හෙතෙම ශාස්තෘන් වහන්සේ කෙරෙහිද ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයි. ධර්මය කෙරෙහිද ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයි. සංඝයා කෙරෙහිද ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයි. ශික්ෂාවද සම්පූර්ණයෙන් පුරන්නේ නැත. භික්ෂූණි, ඒ යම් භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයිද, ධර්මය කෙරෙහි ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයිද, සංඝයා කෙරෙහි ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයිද, ශික්ෂාවද සම්පූර්ණයෙන් පුරන්නේ නැතැයිද, හෙතෙම සංඝයා තුළ ආරවුල් ඇති කරයි. ඒ ආරවුල බොහෝ ජනයාට අහිත පිණිසද, බොහෝ ජනයාට දුක් පිණිසද, බොහෝ ජනයාට අනර්ථය පිණිසද, අහිත පිණිසද, දෙවි මිනිසුන්ට දුක් පිණිසද වෙයි. භික්ෂූණි, යම් හෙයකින් නුඹලා මෙබඳු විවාද මූලයක් තමන් තුළින් හෝ පිටතින් හෝ දකින්නෙහු නම්, එහිදී නුඹලා ඒ පාපී විවාද මූලය ප්‍රහාණය කිරීම සඳහා වීර්ය කළ යුතුය. භික්ෂූණි, යම් හෙයකින් නුඹලා මෙබඳු විවාද මූලයක් තමන් තුළින් හෝ පිටතින් හෝ නොදකින්නෙහු නම්, එහිදී නුඹලා ඒ පාපී විවාද මූලය අනාගතයෙහි නොනැඟීම සඳහා පිළිපැදිය යුතුය. මෙලෙසින් ඒ පාපී විවාද මූලය ප්‍රහාණය කිරීම සිදු වෙයි. මෙලෙසින් ඒ පාපී විවාද මූලය අනාගතයෙහි නොනැඟීම සිදු වෙයි.\n\nනැවතත් භික්ෂූණි, යම් භික්ෂුවක් වරද වසාගන්නාසුලු වන්නේද, අනුන්ගේ ගුණ මකා දමන්නාසුලු වන්නේද. ඊර්ෂ්‍යා ඇත්තෙක් වන්නේද, මසුරු වන්නේද. සූක්ෂ්ම කපටියෙක් වන්නේද, මායාවී වන්නේද. පාපී ආශාවන් ඇත්තෙක් වන්නේද, මිථ්‍යා දෘෂ්ඨිකයෙක් වන්නේද. තමාගේ දෘෂ්ඨිය දැඩිව අල්ලාගන්නාසුලු වන්නේද, දැඩි මතධාරී වන්නේද, අත්හැරීමට අපහසු වන්නේද. භික්ෂූණි, ඒ යම් භික්ෂුවක් තමාගේ දෘෂ්ඨිය දැඩිව අල්ලාගන්නාසුලු වේද, දැඩි මතධාරී වේද, අත්හැරීමට අපහසු වේද, හෙතෙම ශාස්තෘන් වහන්සේ කෙරෙහිද ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයි. ධර්මය කෙරෙහිද ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයි. සංඝයා කෙරෙහිද ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයි. ශික්ෂාවද සම්පූර්ණයෙන් පුරන්නේ නැත. භික්ෂූණි, ඒ යම් භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයිද, ධර්මය කෙරෙහිද ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයිද, සංඝයා කෙරෙහිද ගෞරවයෙන් තොරව, අප්‍රතිපත්තිමත් ලෙස වාසය කරයිද, ශික්ෂාවද සම්පූර්ණයෙන් පුරන්නේ නැතැයිද, හෙතෙම සංඝයා තුළ ආරවුල් ඇති කරයි. ඒ ආරවුල බොහෝ ජනයාට අහිත පිණිසද, බොහෝ ජනයාට දුක් පිණිසද, බොහෝ ජනයාට අනර්ථය පිණිසද, අහිත පිණිසද, දෙවි මිනිසුන්ට දුක් පිණිසද වෙයි. භික්ෂූණි, යම් හෙයකින් නුඹලා මෙබඳු විවාද මූලයක් තමන් තුළින් හෝ පිටතින් හෝ දකින්නෙහු නම්, එහිදී නුඹලා ඒ පාපී විවාද මූලය ප්‍රහාණය කිරීම සඳහා වීර්ය කළ යුතුය. භික්ෂූණි, යම් හෙයකින් නුඹලා මෙබඳු විවාද මූලයක් තමන් තුළින් හෝ පිටතින් හෝ නොදකින්නෙහු නම්, එහිදී නුඹලා ඒ පාපී විවාද මූලය අනාගතයෙහි නොනැඟීම සඳහා පිළිපැදිය යුතුය. මෙලෙසින් ඒ පාපී විවාද මූලය ප්‍රහාණය කිරීම සිදු වෙයි. මෙලෙසින් ඒ පාපී විවාද මූලය අනාගතයෙහි නොනැඟීම සිදු වෙයි. භික්ෂූණි, මේ විවාද මූල හය වෙති.",
      "paliTitle": "Vivādamūlasuttaṃ"
    },
    {
      "number": 37,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena veḷukaṇḍakī [veḷukaṇḍakiyā (a. ni. 7.53; 2.134; saṃ. ni. 2.173)] nandamātā upāsikā sāriputtamoggallānappamukhe bhikkhusaṅghe chaḷaṅgasamannāgataṃ dakkhiṇaṃ patiṭṭhāpeti. Addasā kho bhagavā dibbena cakkhunā visuddhena atikkantamānusakena veḷukaṇḍakiṃ nandamātaraṃ upāsikaṃ sāriputtamoggallānappamukhe bhikkhusaṅghe chaḷaṅgasamannāgataṃ dakkhiṇaṃ patiṭṭhāpentiṃ. Disvā bhikkhū āmantesi – ‘‘esā, bhikkhave, veḷukaṇḍakī nandamātā upāsikā sāriputtamoggallānappamukhe bhikkhusaṅghe chaḷaṅgasamannāgataṃ dakkhiṇaṃ patiṭṭhāpeti’’. ‘‘Kathañca, bhikkhave, chaḷaṅgasamannāgatā dakkhiṇā hoti? Idha, bhikkhave, dāyakassa tīṇaṅgāni honti, paṭiggāhakānaṃ tīṇaṅgāni. Katamāni dāyakassa tīṇaṅgāni? Idha, bhikkhave, dāyako pubbeva dānā sumano hoti, dadaṃ cittaṃ pasādeti, datvā attamano hoti. Imāni dāyakassa tīṇaṅgāni. ‘‘Katamāni paṭiggāhakānaṃ tīṇaṅgāni? Idha, bhikkhave, paṭiggāhakā vītarāgā vā honti rāgavinayāya vā paṭipannā, vītadosā vā honti dosavinayāya vā paṭipannā, vītamohā vā honti mohavinayāya vā paṭipannā. Imāni paṭiggāhakānaṃ tīṇaṅgāni. Iti dāyakassa tīṇaṅgāni, paṭiggāhakānaṃ tīṇaṅgāni. Evaṃ kho, bhikkhave, chaḷaṅgasamannāgatā dakkhiṇā hoti. ‘‘Evaṃ chaḷaṅgasamannāgatāya, bhikkhave, dakkhiṇāya na sukaraṃ puññassa pamāṇaṃ gahetuṃ – ‘ettako puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattatī’ti. Atha kho asaṅkhyeyyo [asaṅkheyyo (sī. syā. kaṃ. pī.)] appameyyo mahāpuññakkhandhotveva saṅkhaṃ gacchati. ‘‘Seyyathāpi, bhikkhave, mahāsamudde na sukaraṃ udakassa pamāṇaṃ gahetuṃ – ‘ettakāni udakāḷhakānīti vā ettakāni udakāḷhakasatānīti vā ettakāni udakāḷhakasahassānīti vā ettakāni udakāḷhakasatasahassānī’ti vā. Atha kho asaṅkhyeyyo appameyyo mahāudakakkhandhotveva saṅkhaṃ gacchati. Evamevaṃ kho, bhikkhave, evaṃ chaḷaṅgasamannāgatāya dakkhiṇāya na sukaraṃ puññassa pamāṇaṃ gahetuṃ – ‘ettako puññābhisando kusalābhisando sukhassāhāro sovaggiko sukhavipāko saggasaṃvattaniko iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattatī’ti. Atha kho asaṅkhyeyyo appameyyo mahāpuññakkhandhotveva saṅkhaṃ gacchatī’’ti. [pe. va. 305 petavatthumhipi] ‘‘Pubbeva dānā sumano, dadaṃ cittaṃ pasādaye; Datvā attamano hoti, esā yaññassa [puññassa (ka.)] sampadā. ‘‘Vītarāgā [vītarāgo (syā. kaṃ. ka.) evaṃ anantarapadattayepi] vītadosā, vītamohā anāsavā; Khettaṃ yaññassa sampannaṃ, saññatā brahmacārayo [brahmacārino (syā. kaṃ.)]. ‘‘Sayaṃ ācamayitvāna, datvā sakehi pāṇibhi; Attano parato ceso, yañño hoti mahapphalo. [a. ni. 4.40] ‘‘Evaṃ yajitvā medhāvī, saddho muttena cetasā; Abyāpajjaṃ sukhaṃ lokaṃ, paṇḍito upapajjatī’’ti. sattamaṃ;",
      "english": "One time, the Blessed One was staying in Sāvatthī, at Jetavana, in Anāthapiṇḍika's monastery. Now at that time, the lay follower Nandamātā from Veḷukaṇḍakī was establishing a gift endowed with six factors to the community of monks headed by Sāriputta and Moggallāna.\n\nThe Blessed One saw, with his purified divine eye, surpassing that of humans, Nandamātā, the lay follower from Veḷukaṇḍakī, establishing a gift endowed with six factors to the community of monks headed by Sāriputta and Moggallāna. Having seen this, he addressed the monks: \"Monks, this lay follower Nandamātā from Veḷukaṇḍakī is establishing a gift endowed with six factors to the community of monks headed by Sāriputta and Moggallāna.\"\n\n\"And how, monks, is a gift endowed with six factors?\" \"Here, monks, there are three factors on the part of the giver, and three factors on the part of the recipients. What are the three factors on the part of the giver? Here, monks, the giver is gladdened before giving, gladdens their mind while giving, and is joyful after giving. These are the three factors on the part of the giver.\"\n\n\"What are the three factors on the part of the recipients? Here, monks, the recipients are either free from greed, or are practicing for the subduing of greed; they are either free from hatred, or are practicing for the subduing of hatred; they are either free from delusion, or are practicing for the subduing of delusion. These are the three factors on the part of the recipients. Thus, there are three factors on the part of the giver, and three factors on the part of the recipients. It is in this way, monks, that a gift is endowed with six factors.\"\n\n\"Monks, for a gift thus endowed with six factors, it is not easy to measure its merit— 'This much is the outflow of merit, the outflow of wholesome deeds, the nourishment for happiness, conducive to a good rebirth, resulting in happiness, leading to heaven, conducive to what is desirable, agreeable, pleasing, beneficial, and happiness.' Rather, it is reckoned as an immeasurable, incalculable great mass of merit.\"\n\n\"Just as, monks, it is not easy to measure the water in the great ocean— 'This many water *āḷhakas*, or this many hundreds of water *āḷhakas*, or this many thousands of water *āḷhakas*, or this many hundreds of thousands of water *āḷhakas*.' Rather, it is reckoned as an immeasurable, incalculable great mass of water. In the same way, monks, for a gift thus endowed with six factors, it is not easy to measure its merit— 'This much is the outflow of merit, the outflow of wholesome deeds, the nourishment for happiness, conducive to a good rebirth, resulting in happiness, leading to heaven, conducive to what is desirable, agreeable, pleasing, beneficial, and happiness.' Rather, it is reckoned as an immeasurable, incalculable great mass of merit.\"\n\nJoyful before the gift, one gladdens the mind while giving; joyful after giving, this is the accomplishment of the offering.\n\nThose free from greed, free from hatred, free from delusion, without defilements; restrained, leading the holy life—they are a fertile field for the offering.\n\nHaving offered by one's own hands, this offering brings great fruit both for oneself and for others.\n\nHaving offered in this way, the wise one, full of faith and with a liberated mind, attains a non-afflicting, happy world.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් ආරාමයේ අනේපිඬු සිටුහුගේ උයනේ වැඩවසන සේක. එසමයෙහි වේළුකණ්ඩකී නන්දමාතා උපාසිකාව සැරියුත් මුගලන් මහ රහතන් වහන්සේලා ප්‍රමුඛ භික්ෂු සංඝයාට ෂඩංග සමන්වාගත දක්ෂිණාවක් පිහිටුවා (පිළිගන්වා) සිටියාය. භාග්‍යවතුන් වහන්සේ විශුද්ධ වූ, මනුෂ්‍ය ස්වභාවය ඉක්මවූ දිව්‍ය චක්ෂුසින් වේළුකණ්ඩකී නන්දමාතා උපාසිකාව සැරියුත් මුගලන් මහ රහතන් වහන්සේලා ප්‍රමුඛ භික්ෂු සංඝයාට ෂඩංග සමන්වාගත දක්ෂිණාවක් පිළිගන්වන අයුරු දැක වදාළ සේක. (එය) දැක භික්ෂූන් වහන්සේලා අමතා වදාළ සේක: \"මහණෙනි, මේ වේළුකණ්ඩකී නන්දමාතා උපාසිකාව සැරියුත් මුගලන් මහ රහතන් වහන්සේලා ප්‍රමුඛ භික්ෂු සංඝයාට ෂඩංග සමන්වාගත දක්ෂිණාවක් පිළිගන්වන්නීය.\"\n\n\"මහණෙනි, ෂඩංග සමන්වාගත දක්ෂිණාවක් කෙසේ නම් වන්නේද? මහණෙනි, මෙහි දායකයාට අංග තුනක්ද, පිළිගන්නා වූ අයට අංග තුනක්ද වෙති. දායකයාගේ ඒ අංග තුන කවරේද? මහණෙනි, මෙහි දායකයා දානයට පෙර පටන්ම සතුටු සිතින් යුක්ත වේ. දන් දෙන කල්හි සිත පහදවා ගනී. දන් දුන් පසුද ප්‍රීතිමත් වේ. දායකයාගේ අංග තුන මේවාය.\"\n\n\"පිළිගන්නා වූ අයගේ අංග තුන කවරේද? මහණෙනි, මෙහි පිළිගන්නා වූ අය රාගයෙන් තොර වූවෝ වෙත්වා, නොඑසේනම් රාගය දුරු කිරීම පිණිස පිළිපදින්නෝ වෙත්වා. ද්වේෂයෙන් තොර වූවෝ වෙත්වා, නොඑසේනම් ද්වේෂය දුරු කිරීම පිණිස පිළිපදින්නෝ වෙත්වා. මෝහයෙන් තොර වූවෝ වෙත්වා, නොඑසේනම් මෝහය දුරු කිරීම පිණිස පිළිපදින්නෝ වෙත්වා. පිළිගන්නා වූ අයගේ අංග තුන මේවාය. මෙසේ දායකයාගේ අංග තුනක්ද, පිළිගන්නා වූ අයගේ අංග තුනක්ද (සමඟ) මහණෙනි, මෙසේ ෂඩංග සමන්වාගත දක්ෂිණාවක් වන්නේය.\"\n\n\"මහණෙනි, මෙසේ ෂඩංග සමන්වාගත වූ දක්ෂිණාවක පිනෙහි ප්‍රමාණය 'මේ තරම් පුණ්‍යානිසංසයක්, මේ තරම් කුසලානිසංසයක්, සැප පිණිස හේතු වන, සුගතිගාමී වන, සැප විපාක දෙන, ස්වර්ගය පිණිස පමුණුවන, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත පිණිස, සැප පිණිස පවතී' යැයි ගැනීමට පහසු නොවේ. එහෙත් එය අසංඛ්‍ය වූ, අප්‍රමාණ වූ, මහා පුණ්‍යස්කන්ධයක් වශයෙන්ම ගණන් ගැනේ.\"\n\n\"මහණෙනි, යම්සේ මහා සාගරයේ ජල ප්‍රමාණය 'මේ තරම් ජල ආළක ප්‍රමාණයක් යැයි හෝ, මේ තරම් ජල ආළක සිය ගණනක් යැයි හෝ, මේ තරම් ජල ආළක දහස් ගණනක් යැයි හෝ, මේ තරම් ජල ආළක ලක්ෂ ගණනක් යැයි හෝ' කියා මැනීමට පහසු නොවේද, එහෙත් එය අසංඛ්‍ය වූ, අප්‍රමාණ වූ, මහා ජලස්කන්ධයක් වශයෙන්ම ගණන් ගැනේ. මහණෙනි, එපරිද්දෙන්ම මෙසේ ෂඩංග සමන්වාගත වූ දක්ෂිණාවක පිනෙහි ප්‍රමාණය 'මේ තරම් පුණ්‍යානිසංසයක්, මේ තරම් කුසලානිසංසයක්, සැප පිණිස හේතු වන, සුගතිගාමී වන, සැප විපාක දෙන, ස්වර්ගය පිණිස පමුණුවන, ඉෂ්ට වූ, කාන්ත වූ, මනාප වූ, හිත පිණිස, සැප පිණිස පවතී' යැයි ගැනීමට පහසු නොවේ. එහෙත් එය අසංඛ්‍ය වූ, අප්‍රමාණ වූ, මහා පුණ්‍යස්කන්ධයක් වශයෙන්ම ගණන් ගැනේය.\"\n\n\"දානයට පෙර පටන්ම සතුටු සිතින් යුක්ත වේ. දන් දෙන කල්හි සිත පහදවා ගනී. දන් දුන් පසුද ප්‍රීතිමත් වේ. මේ යඥයේ සම්පත්තියයි.\nරාගය දුරු කළ, ද්වේෂය දුරු කළ, මෝහය දුරු කළ, ආශ්‍රව රහිත වූ, හික්මුණු බ්‍රහ්මචාරීහු යඥයට සාරවත් වූ කෙතකි.\nතමන් විසින්ම (කැමැත්තෙන්) පිළියෙල කොට, තමන්ගේම දෑතින් දන් දුන් කල්හි, තමාටද, අනුන්ටද, ඒ යඥය මහත් ඵලදායක වේ.\nමෙසේ නුවණැති පුද්ගලයා දානය දී, ශ්‍රද්ධාවෙන් යුතුව, මුදිත සිතින් යුක්තව, (පරහිංසාවෙන් තොර වූ) අව්‍යාපාජ්‍ය වූ සැපවත් ලෝකයට පණ්ඩිතයා උපත ලබන්නේය.\"",
      "paliTitle": "Chaḷaṅgadānasuttaṃ"
    },
    {
      "number": 38,
      "pali": "Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘ahañhi, bho gotama, evaṃvādī evaṃdiṭṭhi – ‘natthi attakāro, natthi parakāro’’’ti. ‘‘Māhaṃ, brāhmaṇa, evaṃvādiṃ evaṃdiṭṭhiṃ addasaṃ vā assosiṃ vā. Kathañhi nāma sayaṃ abhikkamanto, sayaṃ paṭikkamanto evaṃ vakkhati – ‘natthi attakāro, natthi parakāro’’’ti! ‘‘Taṃ kiṃ maññasi, brāhmaṇa, atthi ārabbhadhātū’’ti? ‘‘Evaṃ, bho’’. ‘‘Ārabbhadhātuyā sati ārabbhavanto sattā paññāyantī’’ti? ‘‘Evaṃ, bho’’. ‘‘Yaṃ kho, brāhmaṇa, ārabbhadhātuyā sati ārabbhavanto sattā paññāyanti, ayaṃ sattānaṃ attakāro ayaṃ parakāro’’. ‘‘Taṃ kiṃ maññasi, brāhmaṇa, atthi nikkamadhātu…pe… atthi parakkamadhātu… atthi thāmadhātu… atthi ṭhitidhātu… atthi upakkamadhātū’’ti? ‘‘Evaṃ, bho’’. ‘‘Upakkamadhātuyā sati upakkamavanto sattā paññāyantī’’ti? ‘‘Evaṃ, bho’’. ‘‘Yaṃ kho, brāhmaṇa, upakkamadhātuyā sati upakkamavanto sattā paññāyanti, ayaṃ sattānaṃ attakāro ayaṃ parakāro’’. ‘‘Māhaṃ, brāhmaṇa [taṃ kiṃ maññasi brāhmaṇa māhaṃ (ka.)], evaṃvādiṃ evaṃdiṭṭhiṃ addasaṃ vā assosiṃ vā. Kathañhi nāma sayaṃ abhikkamanto sayaṃ paṭikkamanto evaṃ vakkhati – ‘natthi attakāro natthi parakāro’’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti! Aṭṭhamaṃ.",
      "english": "Then a certain brahmin approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging courteous and memorable remarks, he sat down to one side. As he sat to one side, that brahmin said to the Blessed One: \"Indeed, Master Gotama, I hold such a view, I hold such a doctrine: 'There is no individual agent, there is no external agent.'\"\n\n\"Brahmin, I have never seen or heard anyone holding such a view, holding such a doctrine. How can one, who himself goes forward and himself goes back, assert: 'There is no individual agent, there is no external agent'?\" \"What do you think, brahmin, is there an element of initiative?\" \"Yes, Master.\" \"When the element of initiative is present, are beings discerned to be initiating?\" \"Yes, Master.\" \"Indeed, brahmin, when the element of initiative is present and beings are discerned to be initiating, this is the individual agency for beings, and this is the external agency.\" \"What do you think, brahmin, is there an element of exertion?\" \"Yes, Master.\" \"What do you think, brahmin, is there an element of striving?\" \"Yes, Master.\" \"What do you think, brahmin, is there an element of endurance?\" \"Yes, Master.\" \"What do you think, brahmin, is there an element of steadfastness?\" \"Yes, Master.\" \"What do you think, brahmin, is there an element of enterprise?\" \"Yes, Master.\" \"When the element of enterprise is present, are beings discerned to be enterprising?\" \"Yes, Master.\" \"Indeed, brahmin, when the element of enterprise is present and beings are discerned to be enterprising, this is the individual agency for beings, and this is the external agency.\"\n\n\"Brahmin, I have never seen or heard anyone holding such a view, holding such a doctrine. How can one, who himself goes forward and himself goes back, assert: 'There is no individual agent, there is no external agent'?\" \"Excellent, Master Gotama! Excellent! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms — in the same way has Master Gotama made the Dhamma clear in various ways. I go for refuge to Master Gotama, to the Dhamma, and to the Sangha of bhikkhus. From this day forth, as long as life lasts, I take refuge.\"",
      "sinhala": "එවිට එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කතා බස් නිමා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ඒ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “භවත් ගෞතමයන් වහන්ස, ‘තමාගේ ක්‍රියාවක් හෝ අනුන්ගේ ක්‍රියාවක් නැත’ යන මෙබඳු වාද ඇත්තෙක්ද, මෙබඳු දෘෂ්ටි ඇත්තෙක්ද වෙමි.”\n\n“බ්‍රාහ්මණය, මෙබඳු වාද ඇත්තෙක් හෝ මෙබඳු දෘෂ්ටි ඇත්තෙක් මම නොදුටුවෙමි, නොඇසීමි. කෙසේ නම් කෙනෙක් තමාම ඉදිරියට යමින්, තමාම පසුපසට යමින් ‘තමාගේ ක්‍රියාවක් හෝ අනුන්ගේ ක්‍රියාවක් නැත’ යැයි පවසන්නේද?”\n\n“බ්‍රාහ්මණය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද, ආරම්භක ධාතුවක් (උත්සාහ කිරීමේ ස්වභාවයක්) ඇත්තේද?” “එසේය, භවත්නි.” “ආරම්භක ධාතුවක් ඇති කල්හි ආරම්භ කරන සත්වයෝ පෙනී සිටිත්ද?” “එසේය, භවත්නි.” “බ්‍රාහ්මණය, ආරම්භක ධාතුවක් ඇති කල්හි ආරම්භ කරන සත්වයෝ පෙනී සිටිත්ද, මෙය සත්වයන්ගේ තමාගේ ක්‍රියාවක්ද, මෙය අනුන්ගේ ක්‍රියාවක්ද වෙයි.”\n\n“බ්‍රාහ්මණය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද, නික්කම ධාතුවක් (වෙහෙසීමේ ස්වභාවයක්) ඇත්තේද... පරාක්‍රම ධාතුවක් (වීර්යයේ ස්වභාවයක්) ඇත්තේද... ඨාම ධාතුවක් (බලයේ ස්වභාවයක්) ඇත්තේද... ඨිති ධාතුවක් (ස්ථායීභාවයේ ස්වභාවයක්) ඇත්තේද... උපක්‍රම ධාතුවක් (උත්සාහයේ ස්වභාවයක්) ඇත්තේද?” “එසේය, භවත්නි.” “උපක්‍රම ධාතුවක් ඇති කල්හි උපක්‍රම කරන සත්වයෝ පෙනී සිටිත්ද?” “එසේය, භවත්නි.” “බ්‍රාහ්මණය, උපක්‍රම ධාතුවක් ඇති කල්හි උපක්‍රම කරන සත්වයෝ පෙනී සිටිත්ද, මෙය සත්වයන්ගේ තමාගේ ක්‍රියාවක්ද, මෙය අනුන්ගේ ක්‍රියාවක්ද වෙයි.”\n\n“බ්‍රාහ්මණය, මෙබඳු වාද ඇත්තෙක් හෝ මෙබඳු දෘෂ්ටි ඇත්තෙක් මම නොදුටුවෙමි, නොඇසීමි. කෙසේ නම් කෙනෙක් තමාම ඉදිරියට යමින්, තමාම පසුපසට යමින් ‘තමාගේ ක්‍රියාවක් හෝ අනුන්ගේ ක්‍රියාවක් නැත’ යැයි පවසන්නේද?”\n\n“ඉතා මැනවි, භවත් ගෞතමයන් වහන්ස... මේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා සලකන සේක්වා!”",
      "paliTitle": "Attakārīsuttaṃ"
    },
    {
      "number": 39,
      "pali": "‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Lobho nidānaṃ kammānaṃ samudayāya, doso nidānaṃ kammānaṃ samudayāya, moho nidānaṃ kammānaṃ samudayāya. Na, bhikkhave, lobhā alobho samudeti; atha kho, bhikkhave, lobhā lobhova samudeti. Na, bhikkhave, dosā adoso samudeti; atha kho, bhikkhave, dosā dosova samudeti. Na, bhikkhave, mohā amoho samudeti; atha kho, bhikkhave, mohā mohova samudeti. Na, bhikkhave, lobhajena kammena dosajena kammena mohajena kammena devā paññāyanti, manussā paññāyanti, yā vā panaññāpi kāci sugatiyo. Atha kho, bhikkhave, lobhajena kammena dosajena kammena mohajena kammena nirayo paññāyati tiracchānayoni paññāyati pettivisayo paññāyati, yā vā panaññāpi kāci duggatiyo. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāya. ‘‘Tīṇimāni, bhikkhave, nidānāni kammānaṃ samudayāya. Katamāni tīṇi? Alobho nidānaṃ kammānaṃ samudayāya, adoso nidānaṃ kammānaṃ samudayāya, amoho nidānaṃ kammānaṃ samudayāya. Na, bhikkhave, alobhā lobho samudeti; atha kho, bhikkhave, alobhā alobhova samudeti. Na, bhikkhave, adosā doso samudeti; atha kho, bhikkhave, adosā adosova samudeti. Na, bhikkhave, amohā moho samudeti; atha kho, bhikkhave, amohā amohova samudeti. Na, bhikkhave, alobhajena kammena adosajena kammena amohajena kammena nirayo paññāyati tiracchānayoni paññāyati pettivisayo paññāyati, yā vā panaññāpi kāci duggatiyo. Atha kho, bhikkhave, alobhajena kammena adosajena kammena amohajena kammena devā paññāyanti, manussā paññāyanti, yā vā panaññāpi kāci sugatiyo. Imāni kho, bhikkhave, tīṇi nidānāni kammānaṃ samudayāyā’’ti. Navamaṃ.",
      "english": "Monks, these are the three roots for the origination of kamma. Which three? Greed is a root for the origination of kamma, hatred is a root for the origination of kamma, delusion is a root for the origination of kamma. Monks, non-greed does not arise from greed; rather, monks, greed arises from greed. Monks, non-hatred does not arise from hatred; rather, monks, hatred arises from hatred. Monks, non-delusion does not arise from delusion; rather, monks, delusion arises from delusion. Monks, through kamma born of greed, through kamma born of hatred, through kamma born of delusion, gods do not manifest, humans do not manifest, nor do any other happy destinations. Rather, monks, through kamma born of greed, through kamma born of hatred, through kamma born of delusion, hell manifests, the animal realm manifests, the realm of hungry ghosts manifests, or any other unhappy destinations. Indeed, monks, these are the three roots for the origination of kamma.\n\nMonks, these are the three roots for the origination of kamma. Which three? Non-greed is a root for the origination of kamma, non-hatred is a root for the origination of kamma, non-delusion is a root for the origination of kamma. Monks, greed does not arise from non-greed; rather, monks, non-greed arises from non-greed. Monks, hatred does not arise from non-hatred; rather, monks, non-hatred arises from non-hatred. Monks, delusion does not arise from non-delusion; rather, monks, non-delusion arises from non-delusion. Monks, through kamma born of non-greed, through kamma born of non-hatred, through kamma born of non-delusion, hell does not manifest, the animal realm does not manifest, the realm of hungry ghosts does not manifest, nor do any other unhappy destinations. Rather, monks, through kamma born of non-greed, through kamma born of non-hatred, through kamma born of non-delusion, gods manifest, humans manifest, or any other happy destinations. Indeed, monks, these are the three roots for the origination of kamma.",
      "sinhala": "මහණෙනි, කර්මයන්ගේ ඇතිවීමට මේ කාරණා තුනක් මුල්වේ. ඒ කාරණා තුන කවරේද? ලෝභය කර්මයන්ගේ ඇතිවීමට මුල්වේ, ද්වේෂය කර්මයන්ගේ ඇතිවීමට මුල්වේ, මෝහය කර්මයන්ගේ ඇතිවීමට මුල්වේ. මහණෙනි, ලෝභයෙන් අලෝභය හට නොගනී; මහණෙනි, ලෝභයෙන් ලෝභයම හටගනී. මහණෙනි, ද්වේෂයෙන් අද්වේෂය හට නොගනී; මහණෙනි, ද්වේෂයෙන් ද්වේෂයම හටගනී. මහණෙනි, මෝහයෙන් අමෝහය හට නොගනී; මහණෙනි, මෝහයෙන් මෝහයම හටගනී. මහණෙනි, ලෝභයෙන් උපන් කර්මයෙන්, ද්වේෂයෙන් උපන් කර්මයෙන්, මෝහයෙන් උපන් කර්මයෙන් දෙවිවරු පහළ නොවේ; මනුෂ්‍යයෝ පහළ නොවේ; හෝ අන්‍ය යම් කිසි සුගතියක් පහළ නොවේ. මහණෙනි, එහෙත් ලෝභයෙන් උපන් කර්මයෙන්, ද්වේෂයෙන් උපන් කර්මයෙන්, මෝහයෙන් උපන් කර්මයෙන් නිරය පහළවේ, තිරිසන් යෝනිය පහළවේ, ප්‍රේත විෂය පහළවේ, හෝ අන්‍ය යම් කිසි දුගතියක් පහළවේ. මහණෙනි, කර්මයන්ගේ ඇතිවීමට මේ කාරණා තුනක් මුල්වේ.\n\nමහණෙනි, කර්මයන්ගේ ඇතිවීමට මේ කාරණා තුනක් මුල්වේ. ඒ කාරණා තුන කවරේද? අලෝභය කර්මයන්ගේ ඇතිවීමට මුල්වේ, අද්වේෂය කර්මයන්ගේ ඇතිවීමට මුල්වේ, අමෝහය කර්මයන්ගේ ඇතිවීමට මුල්වේ. මහණෙනි, අලෝභයෙන් ලෝභය හට නොගනී; මහණෙනි, අලෝභයෙන් අලෝභයම හටගනී. මහණෙනි, අද්වේෂයෙන් ද්වේෂය හට නොගනී; මහණෙනි, අද්වේෂයෙන් අද්වේෂයම හටගනී. මහණෙනි, අමෝහයෙන් මෝහය හට නොගනී; මහණෙනි, අමෝහයෙන් අමෝහයම හටගනී. මහණෙනි, අලෝභයෙන් උපන් කර්මයෙන්, අද්වේෂයෙන් උපන් කර්මයෙන්, අමෝහයෙන් උපන් කර්මයෙන් නිරය පහළ නොවේ; තිරිසන් යෝනිය පහළ නොවේ; ප්‍රේත විෂය පහළ නොවේ; හෝ අන්‍ය යම් කිසි දුගතියක් පහළ නොවේ. මහණෙනි, එහෙත් අලෝභයෙන් උපන් කර්මයෙන්, අද්වේෂයෙන් උපන් කර්මයෙන්, අමෝහයෙන් උපන් කර්මයෙන් දෙවිවරු පහළවේ, මනුෂ්‍යයෝ පහළවේ, හෝ අන්‍ය යම් කිසි සුගතියක් පහළවේ. මහණෙනි, කර්මයන්ගේ ඇතිවීමට මේ කාරණා තුනක් මුල්වේ.",
      "paliTitle": "Nidānasuttaṃ"
    },
    {
      "number": 40,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kimilāyaṃ viharati niculavane. Atha kho āyasmā kimilo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā kimilo bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hotī’’ti? ‘‘Idha, kimila, tathāgate parinibbute bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari agāravā viharanti appatissā, dhamme agāravā viharanti appatissā, saṅghe agāravā viharanti appatissā, sikkhāya agāravā viharanti appatissā, appamāde agāravā viharanti appatissā, paṭisanthāre [paṭisandhāre (ka.) a. ni. 5.201; 7.59] agāravā viharanti appatissā. Ayaṃ kho, kimila, hetu ayaṃ paccayo yena tathāgate parinibbute saddhammo na ciraṭṭhitiko hoti’’. ‘‘Ko pana, bhante, hetu ko paccayo yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti? ‘‘Idha, kimila, tathāgate parinibbute bhikkhū bhikkhuniyo upāsakā upāsikāyo satthari sagāravā viharanti sappatissā, dhamme sagāravā viharanti sappatissā, saṅghe sagāravā viharanti sappatissā, sikkhāya sagāravā viharanti sappatissā, appamāde sagāravā viharanti sappatissā, paṭisanthāre sagāravā viharanti sappatissā. Ayaṃ kho, kimila, hetu ayaṃ paccayo yena tathāgate parinibbute saddhammo ciraṭṭhitiko hotī’’ti. Dasamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying in Kimilā, in the Nicula Wood. Then the Venerable Kimila approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, the Venerable Kimila said to the Blessed One: \"Bhante, what is the cause, what is the condition, by which, when the Tathāgata has attained final Nibbāna, the True Dhamma does not last long?\" \"Here, Kimila, when the Tathāgata has attained final Nibbāna, monks, nuns, male lay followers, and female lay followers dwell without reverence and without respect for the Teacher; they dwell without reverence and without respect for the Dhamma; they dwell without reverence and without respect for the Saṅgha; they dwell without reverence and without respect for the training; they dwell without reverence and without respect for diligence; they dwell without reverence and without respect for hospitality. This, Kimila, is the cause, this is the condition, by which, when the Tathāgata has attained final Nibbāna, the True Dhamma does not last long.\"\n\n\"But, Bhante, what is the cause, what is the condition, by which, when the Tathāgata has attained final Nibbāna, the True Dhamma lasts long?\" \"Here, Kimila, when the Tathāgata has attained final Nibbāna, monks, nuns, male lay followers, and female lay followers dwell with reverence and with respect for the Teacher; they dwell with reverence and with respect for the Dhamma; they dwell with reverence and with respect for the Saṅgha; they dwell with reverence and with respect for the training; they dwell with reverence and with respect for diligence; they dwell with reverence and with respect for hospitality. This, Kimila, is the cause, this is the condition, by which, when the Tathāgata has attained final Nibbāna, the True Dhamma lasts long.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ කිමිලාවෙහි නිකුල වනයෙහි වැඩසිටින සේක. එකල්හි ආයුෂ්මත් කිමිලෝ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹියහ. එළඹ භාග්‍යවතුන් වහන්සේට ආදරයෙන් වන්දනා කොට එකත්පසෙක වාඩිවූහ.\n\nඑකත්පසෙක වාඩිවී සිටි ආයුෂ්මත් කිමිලෝ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: ‘‘භාග්‍යවතුන් වහන්ස, තථාගතයන් වහන්සේ පිරිනිවී කල්හි සද්ධර්මය කල් නොපවතින්නේ කවර හේතුවකින්ද, කවර ප්‍රත්‍යයකින්ද?’’\n\n‘‘කිමිල, මෙහි තථාගතයන් වහන්සේ පිරිනිවී කල්හි භික්ෂූහු, භික්ෂුණීහු, උපාසකයෝ, උපාසිකාවෝ ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් හා අවනත භාවයෙන් තොරව වාසය කරත්. ධර්මය කෙරෙහි අගෞරවයෙන් හා අවනත භාවයෙන් තොරව වාසය කරත්. සංඝයා කෙරෙහි අගෞරවයෙන් හා අවනත භාවයෙන් තොරව වාසය කරත්. ශික්ෂාව කෙරෙහි අගෞරවයෙන් හා අවනත භාවයෙන් තොරව වාසය කරත්. අප්‍රමාදය කෙරෙහි අගෞරවයෙන් හා අවනත භාවයෙන් තොරව වාසය කරත්. පිළිසඳර කෙරෙහි අගෞරවයෙන් හා අවනත භාවයෙන් තොරව වාසය කරත්. කිමිල, තථාගතයන් වහන්සේ පිරිනිවී කල්හි සද්ධර්මය කල් නොපවතින්නේ මේ හේතුවයි, මේ ප්‍රත්‍යයයි.’’\n\n‘‘භාග්‍යවතුන් වහන්ස, තථාගතයන් වහන්සේ පිරිනිවී කල්හි සද්ධර්මය කල් පවතින්නේ කවර හේතුවකින්ද, කවර ප්‍රත්‍යයකින්ද?’’\n\n‘‘කිමිල, මෙහි තථාගතයන් වහන්සේ පිරිනිවී කල්හි භික්ෂූහු, භික්ෂුණීහු, උපාසකයෝ, උපාසිකාවෝ ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් හා අවනත භාවයෙන් යුක්තව වාසය කරත්. ධර්මය කෙරෙහි ගෞරවයෙන් හා අවනත භාවයෙන් යුක්තව වාසය කරත්. සංඝයා කෙරෙහි ගෞරවයෙන් හා අවනත භාවයෙන් යුක්තව වාසය කරත්. ශික්ෂාව කෙරෙහි ගෞරවයෙන් හා අවනත භාවයෙන් යුක්තව වාසය කරත්. අප්‍රමාදය කෙරෙහි ගෞරවයෙන් හා අවනත භාවයෙන් යුක්තව වාසය කරත්. පිළිසඳර කෙරෙහි ගෞරවයෙන් හා අවනත භාවයෙන් යුක්තව වාසය කරත්. කිමිල, තථාගතයන් වහන්සේ පිරිනිවී කල්හි සද්ධර්මය කල් පවතින්නේ මේ හේතුවයි, මේ ප්‍රත්‍යයයි.’’",
      "paliTitle": "Kimilasuttaṃ"
    },
    {
      "number": 41,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā sāriputto rājagahe viharati gijjhakūṭe pabbate. Atha kho āyasmā sāriputto pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sambahulehi bhikkhūhi saddhiṃ gijjhakūṭā pabbatā orohanto addasa aññatarasmiṃ padese mahantaṃ dārukkhandhaṃ. Disvā bhikkhū āmantesi – ‘‘passatha no, āvuso, tumhe amuṃ mahantaṃ dārukkhandha’’nti? ‘‘Evamāvuso’’ti. ‘‘Ākaṅkhamāno, āvuso, bhikkhu iddhimā cetovasippatto amuṃ dārukkhandhaṃ pathavītveva adhimucceyya. Taṃ kissa hetu? Atthi, āvuso, amumhi dārukkhandhe pathavīdhātu, yaṃ nissāya bhikkhu iddhimā cetovasippatto amuṃ dārukkhandhaṃ pathavītveva adhimucceyya. Ākaṅkhamāno, āvuso, bhikkhu iddhimā cetovasippatto amuṃ dārukkhandhaṃ āpotveva adhimucceyya …pe… tejotveva adhimucceyya… vāyotveva adhimucceyya… subhantveva adhimucceyya… asubhantveva adhimucceyya. Taṃ kissa hetu? Atthi, āvuso, amumhi dārukkhandhe asubhadhātu, yaṃ nissāya bhikkhu iddhimā cetovasippatto amuṃ dārukkhandhaṃ asubhantveva adhimucceyyā’’ti. Ekādasamaṃ.",
      "english": "Thus have I heard. At one time, the Venerable Sāriputta was staying at Rājagaha, on Vulture Peak Mountain. Then, in the forenoon, the Venerable Sāriputta, having dressed and taken his bowl and robe, descended from Vulture Peak Mountain together with a large number of monks. He saw a large log in a certain place. Having seen it, he addressed the monks: “Friends, do you see that large log?” “Yes, friend,” they replied.\n\n“Friends, if a monk who possesses psychic powers and is master of his mind wishes, he could determine that log to be earth.” “For what reason?” “Because, friends, there is the earth element in that log, relying on which a monk who possesses psychic powers and is master of his mind could determine that log to be earth. If, friends, a monk who possesses psychic powers and is master of his mind wishes, he could determine that log to be water; if he wishes, he could determine that log to be fire; if he wishes, he could determine that log to be wind; if he wishes, he could determine that log to be beautiful; if he wishes, he could determine that log to be unattractive.” “For what reason?” “Because, friends, there is the element of unattractiveness in that log, relying on which a monk who possesses psychic powers and is master of his mind could determine that log to be unattractive.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි වැඩ වාසය කළ සේක. ඉන්පසු ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ පෙරවරුවේ හැඳ, පාත්‍ර​ සිවුරු රැගෙන බොහෝ භික්ෂූන් වහන්සේලා සමඟ ගිජ්ජකූට පර්වතයෙන් බසිමින් සිටිය දී එක්තරා ස්ථානයක මහත් වූ දර කඳක් දුටු සේක.\n\nඑය දැක භික්ෂූන් වහන්සේලා ඇමතූ සේක: \"ඇවැත්නි, ඔබලා ඒ මහත් වූ දර කඳ දකින්නාහුද?\" \"එසේය, ඇවැත්නි.\" \"ඇවැත්නි, සෘද්ධිමත් වූ, චිත්ත වශීභාවයට පැමිණි භික්ෂුවක් අභිප්‍රේත කරන්නේ නම්, ඒ දර කඳ පෘථිවියක් ලෙසම අධිමුක්ත කළ හැක. ඒ මක්නිසාද යත්? ඇවැත්නි, ඒ දර කඳෙහි පෘථිවි ධාතුවක් ඇත. එය අරමුණු කරගෙන සෘද්ධිමත් වූ, චිත්ත වශීභාවයට පැමිණි භික්ෂුව ඒ දර කඳ පෘථිවියක් ලෙසම අධිමුක්ත කළ හැක. ඇවැත්නි, සෘද්ධිමත් වූ, චිත්ත වශීභාවයට පැමිණි භික්ෂුවක් අභිප්‍රේත කරන්නේ නම්, ඒ දර කඳ ජලය ලෙසම අධිමුක්ත කළ හැක. ඇවැත්නි, සෘද්ධිමත් වූ, චිත්ත වශීභාවයට පැමිණි භික්ෂුවක් අභිප්‍රේත කරන්නේ නම්, ඒ දර කඳ තේජස (ගින්න) ලෙසම අධිමුක්ත කළ හැක. ඇවැත්නි, සෘද්ධිමත් වූ, චිත්ත වශීභාවයට පැමිණි භික්ෂුවක් අභිප්‍රේත කරන්නේ නම්, ඒ දර කඳ වායුව ලෙසම අධිමුක්ත කළ හැක. ඇවැත්නි, සෘද්ධිමත් වූ, චිත්ත වශීභාවයට පැමිණි භික්ෂුවක් අභිප්‍රේත කරන්නේ නම්, ඒ දර කඳ සුභයක් ලෙසම අධිමුක්ත කළ හැක. ඇවැත්නි, සෘද්ධිමත් වූ, චිත්ත වශීභාවයට පැමිණි භික්ෂුවක් අභිප්‍රේත කරන්නේ නම්, ඒ දර කඳ අසුභයක් ලෙසම අධිමුක්ත කළ හැක. ඒ මක්නිසාද යත්? ඇවැත්නි, ඒ දර කඳෙහි අසුභ ධාතුවක් ඇත. එය අරමුණු කරගෙන සෘද්ධිමත් වූ, චිත්ත වශීභාවයට පැමිණි භික්ෂුව ඒ දර කඳ අසුභයක් ලෙසම අධිමුක්ත කළ හැක.\"",
      "paliTitle": "Dārukkhandhasuttaṃ"
    },
    {
      "number": 42,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena icchānaṅgalaṃ nāma kosalānaṃ brāhmaṇagāmo tadavasari. Tatra sudaṃ bhagavā icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Assosuṃ kho icchānaṅgalakā brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito icchānaṅgalaṃ anuppatto icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno… pe… buddho bhagavā’ti. So imaṃ lokaṃ sadevakaṃ…pe… arahataṃ dassanaṃ hotī’’ti. Atha kho icchānaṅgalakā brāhmaṇagahapatikā tassā rattiyā accayena pahūtaṃ khādanīyaṃ bhojanīyaṃ ādāya yena icchānaṅgalavanasaṇḍo tenupasaṅkamiṃsu; upasaṅkamitvā bahidvārakoṭṭhake aṭṭhaṃsu uccāsaddā mahāsaddā. Tena kho pana samayena āyasmā nāgito bhagavato upaṭṭhāko hoti. Atha kho bhagavā āyasmantaṃ nāgitaṃ āmantesi – ‘‘ke pana te, nāgita, uccāsaddā mahāsaddā kevaṭṭā maññe macchavilope’’ti? ‘‘Ete, bhante, icchānaṅgalakā brāhmaṇagahapatikā pahūtaṃ khādanīyaṃ bhojanīyaṃ ādāya bahidvārakoṭṭhake ṭhitā bhagavantaṃyeva uddissa bhikkhusaṅghañcā’’ti. ‘‘Māhaṃ, nāgita, yasena samāgamaṃ, mā ca mayā yaso. Yo kho, nāgita, nayimassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī assa akicchalābhī akasiralābhī, yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī, so taṃ mīḷhasukhaṃ middhasukhaṃ lābhasakkārasilokasukhaṃ sādiyeyyā’’ti. ‘‘Adhivāsetu dāni, bhante, bhagavā; adhivāsetu, sugato; adhivāsanakālo dāni, bhante, bhagavato. Yena yeneva dāni, bhante, bhagavā gamissati, tanninnāva bhavissanti brāhmaṇagahapatikā negamā ceva jānapadā ca. Seyyathāpi, bhante, thullaphusitake deve vassante yathāninnaṃ udakāni pavattanti; evamevaṃ kho, bhante, yena yeneva dāni bhagavā gamissati, tanninnāva bhavissanti brāhmaṇagahapatikā negamā ceva jānapadā ca. Taṃ kissa hetu? Tathā hi, bhante, bhagavato sīlapaññāṇa’’nti. ‘‘Māhaṃ, nāgita, yasena samāgamaṃ, mā ca mayā yaso. Yo kho, nāgita, nayimassa nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī assa akicchalābhī akasiralābhī, yassāhaṃ nekkhammasukhassa pavivekasukhassa upasamasukhassa sambodhasukhassa nikāmalābhī akicchalābhī akasiralābhī, so taṃ mīḷhasukhaṃ middhasukhaṃ lābhasakkārasilokasukhaṃ sādiyeyya. ‘‘Idhāhaṃ, nāgita, bhikkhuṃ passāmi gāmantavihāriṃ samāhitaṃ nisinnaṃ. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘idānimaṃ āyasmantaṃ [ārāmiko vā ghaṭṭessati samaṇuddeso vā, taṃ tamhā (ka. sī. pī.) ārāmiko vā ghaṭṭessati samaṇuddeso vā, so taṃ tamhā (ka. sī.) a. ni. 8.86 passitabbaṃ] ārāmiko vā upaṭṭhahissati samaṇuddeso vā taṃ tamhā [ārāmiko vā ghaṭṭessati samaṇuddeso vā, taṃ tamhā (ka. sī. pī.) ārāmiko vā ghaṭṭessati samaṇuddeso vā, so taṃ tamhā (ka. sī.) a. ni. 8.86 passitabbaṃ] samādhimhā cāvessatī’ti. Tenāhaṃ, nāgita, tassa bhikkhuno na attamano homi gāmantavihārena. Idha panāhaṃ, nāgita, bhikkhuṃ passāmi āraññikaṃ araññe pacalāyamānaṃ nisinnaṃ. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘idāni ayamāyasmā imaṃ niddākilamathaṃ paṭivinodetvā araññasaññaṃyeva manasi karissati ekatta’nti. Tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi āraññikaṃ araññe asamāhitaṃ nisinnaṃ. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘idāni ayamāyasmā asamāhitaṃ vā cittaṃ samādahissati, samāhitaṃ vā cittaṃ anurakkhissatī’ti. Tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi āraññikaṃ araññe samāhitaṃ nisinnaṃ. Tassa mayhaṃ, nāgita, evaṃ hoti – ‘idāni ayamāyasmā avimuttaṃ vā cittaṃ vimocessati, vimuttaṃ vā cittaṃ anurakkhissatī’ti. Tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi gāmantavihāriṃ lābhiṃ cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. So taṃ lābhasakkārasilokaṃ nikāmayamāno riñcati paṭisallānaṃ riñcati araññavanapatthāni pantāni senāsanāni; gāmanigamarājadhāniṃ osaritvā vāsaṃ kappeti. Tenāhaṃ, nāgita, tassa bhikkhuno na attamano homi gāmantavihārena. ‘‘Idha panāhaṃ, nāgita, bhikkhuṃ passāmi āraññikaṃ lābhiṃ cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārānaṃ. So taṃ lābhasakkārasilokaṃ paṭipaṇāmetvā na riñcati paṭisallānaṃ na riñcati araññavanapatthāni pantāni senāsanāni. Tenāhaṃ, nāgita, tassa bhikkhuno attamano homi araññavihārena. Yasmāhaṃ, nāgita, samaye addhānamaggappaṭipanno na kañci [na kiñci (sī. pī. ka.)] passāmi purato vā pacchato vā, phāsu me, nāgita, tasmiṃ samaye hoti antamaso uccārapassāvakammāyā’’ti. Dvādasamaṃ. ",
      "english": "Thus have I heard: At one time, the Fortunate One, while on a wandering tour through the Kosala country with a large community of monastics, arrived at a brahmin village of the Kosalans named Icchānaṅgala. There, the Fortunate One resided in Icchānaṅgala, in the Icchānaṅgala forest grove.\n\nThe householder brahmins of Icchānaṅgala heard, \"Indeed, friends, the ascetic Gotama, a Sakyan son, who has gone forth from the Sakyan clan, has arrived at Icchānaṅgala and is residing in Icchānaṅgala, in the Icchānaṅgala forest grove. Furthermore, this excellent reputation concerning the Venerable Gotama has arisen: 'Indeed, that Fortunate One is an Arahant, a Perfectly Self-Enlightened One, endowed with knowledge and conduct, the Fortunate One, the Knower of the world, the unsurpassed trainer of tamable people, the teacher of gods and humans, the Buddha, the Fortunate One.' He makes known this world with its deities, its Māras, and its Brahmās, this generation with its ascetics and brahmins, its rulers and its people, having realized it for himself with direct knowledge. He proclaims the Dhamma, lovely in its beginning, lovely in its middle, and lovely in its end. He expounds the holy life both in its spirit and in its letter, entirely complete and purified. It is good indeed to see such Arahants.\"\n\nThen, after that night, the householder brahmins of Icchānaṅgala, having taken abundant soft and hard food, approached the Icchānaṅgala forest grove. Having arrived, they stood outside the gatehouse, making a loud noise, a great clamor.\n\nNow at that time, the Venerable Nāgita was the Fortunate One's attendant.\n\nThen the Fortunate One addressed the Venerable Nāgita, \"Who are those, Nāgita, making a loud noise, a great clamor? Are they, perhaps, fishermen disturbing fish?\"\n\n\"Venerable Sir, these are the householder brahmins of Icchānaṅgala, who have taken abundant soft and hard food and are standing outside the gatehouse, intending it for the Fortunate One and the community of monastics.\"\n\n\"Nāgita, may I not encounter fame, nor fame me. Whoever, Nāgita, would not be one who obtains at will, without difficulty, without trouble, this happiness of renunciation, happiness of seclusion, happiness of tranquility, happiness of awakening—whereas I am one who obtains at will, without difficulty, without trouble, this happiness of renunciation, happiness of seclusion, happiness of tranquility, happiness of awakening—such a one might indeed delight in the happiness of excrement, the happiness of sleepiness, the happiness of gain, honor, and praise.\"\n\n\"Venerable Sir, let the Fortunate One assent now; let the Sugata assent. It is now the time for the Fortunate One to assent, Venerable Sir. Wherever the Fortunate One goes now, Venerable Sir, the householder brahmins, both townspeople and country dwellers, will be inclined towards him. Just as, Venerable Sir, when the sky rains heavily, the waters flow downwards according to the slope; in the same way, Venerable Sir, wherever the Fortunate One goes now, the householder brahmins, both townspeople and country dwellers, will be inclined towards him. What is the reason for that? Because, Venerable Sir, the Fortunate One has virtue and wisdom.\"\n\n\"Nāgita, may I not encounter fame, nor fame me. Whoever, Nāgita, would not be one who obtains at will, without difficulty, without trouble, this happiness of renunciation, happiness of seclusion, happiness of tranquility, happiness of awakening—whereas I am one who obtains at will, without difficulty, without trouble, this happiness of renunciation, happiness of seclusion, happiness of tranquility, happiness of awakening—such a one might indeed delight in the happiness of excrement, the happiness of sleepiness, the happiness of gain, honor, and praise.\n\n\"Here, Nāgita, I see a monastic residing near a village, sitting in concentration. Concerning him, Nāgita, it occurs to me: 'Now this venerable one, either a monastery attendant or a novice, will disturb him, will dislodge him from that concentration.' Therefore, Nāgita, I am not pleased with that monastic's village-dwelling.\n\n\"But here, Nāgita, I see a forest-dwelling monastic sitting in the forest, nodding off. Concerning him, Nāgita, it occurs to me: 'Now this venerable one, having dispelled this weariness of sleep, will bring to mind the perception of the forest and solitude.' Therefore, Nāgita, I am pleased with that monastic's forest-dwelling.\n\n\"But here, Nāgita, I see a forest-dwelling monastic sitting in the forest, without concentration. Concerning him, Nāgita, it occurs to me: 'Now this venerable one will either establish his unconcentrated mind in concentration, or he will maintain his concentrated mind.' Therefore, Nāgita, I am pleased with that monastic's forest-dwelling.\n\n\"But here, Nāgita, I see a forest-dwelling monastic sitting in the forest, in concentration. Concerning him, Nāgita, it occurs to me: 'Now this venerable one will either free his unfreed mind, or he will maintain his freed mind.' Therefore, Nāgita, I am pleased with that monastic's forest-dwelling.\n\n\"But here, Nāgita, I see a monastic residing near a village, who is a recipient of robes, alms-food, lodgings, and medicinal requisites for the sick.\n\nHe, desiring that gain, honor, and renown, abandons seclusion and forsakes remote forest and wilderness dwellings. Having moved to villages, towns, and royal cities, he takes up residence there. Therefore, Nāgita, I am not pleased with that monk's dwelling near a village. But here, Nāgita, I see a monk who is a forest dweller and a recipient of robes, alms-food, dwellings, and medicinal requisites for the sick. He, having rejected that gain, honor, and renown, does not abandon seclusion, nor does he abandon remote forest and wilderness dwellings. Therefore, Nāgita, I am pleased with that monk's forest dwelling. At whatever time, Nāgita, I am traveling on a long road and I see no one ahead or behind, it is comfortable for me, Nāgita, at that time, even for answering the calls of nature.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයෙහි චාරිකා කරමින් මහත් භික්ෂුසංඝයා සමඟ කෝසල දේශයෙහි බ්‍රාහ්මණ ගමක් වූ ඉච්ඡානංගල නම් ගම කරා වැඩම කළ සේක. එහි භාග්‍යවතුන් වහන්සේ ඉච්ඡානංගල ගමෙහි ඉච්ඡානංගල වනයෙහි වැඩසිටියහ.\n\nඉච්ඡානංගල වැසි බමුණු ගෘහපතියෝ මෙසේ ඇසූහ. \"අහෝ පින්වතුනි, ශාක්‍ය පුත්‍ර වූ, ශාක්‍ය කුලයෙන් පැවිදි වූ ගෞතම ශ්‍රමණයෝ ඉච්ඡානංගලයට පැමිණ, ඉච්ඡානංගල ගමෙහි ඉච්ඡානංගල වනයෙහි වැඩවසති. ඒ භවත් ගෞතමයන් වහන්සේගේ යහපත් කීර්ති ඝෝෂාව මෙසේ පැතිර ගොස් ඇත: ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විජ්ජාචරණසම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථි, සත්ථා දේවමනුස්සානං, බුද්ධ, භාග්‍යවතුන් වහන්සේ ය’ යනුවෙනි. ඒ භාග්‍යවතුන් වහන්සේ දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණ ප්‍රජාව සහිත, දෙව් මිනිසුන් සහිත වූ මේ ලෝකය තමන් වහන්සේම අභිඥාවෙන් අවබෝධ කොට ප්‍රකාශ කරන සේක. උන්වහන්සේ ආදිකල්‍යාණ වූ, මධ්‍යකල්‍යාණ වූ, පරියෝසානකල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන සේක. එබඳු රහතන් වහන්සේලා දැකීම සුදුසු වන්නේය.”\n\nඑකල්හි ඉච්ඡානංගල වැසි බමුණු ගෘහපතියෝ ඒ රාත්‍රිය අවසන් වූ පසු බොහෝ වූ කැවිලි හා බත් රැගෙන ඉච්ඡානංගල වනය තිබූ තැනට පැමිණියහ. පැමිණ, වනයෙහි දොරකඩින් පිටත මහත් ශබ්ද නගමින්, ඝෝෂා කරමින් සිටියහ.\n\nඑකල්හි ආයුෂ්මත් නාගිත තෙරුන් භාග්‍යවතුන් වහන්සේට උපස්ථාන කරන්නා විය. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් නාගිත තෙරුන් අමතා වදාළ සේක. “නාගිතය, මේ කවරෝ ද මහත් ශබ්ද නගමින්, ඝෝෂා කරමින් සිටින්නේ? මා හට සිතෙන පරිදි මොවුන් ධීවරයන් මාළු මරණ ශබ්දය වැනි යි නේද?”\n\n“ස්වාමීනි, මේ ඉච්ඡානංගල වැසි බමුණු ගෘහපතිවරු යි. බොහෝ වූ කැවිලි හා බත් රැගෙන දොරකඩින් පිටත සිටින්නේ භාග්‍යවතුන් වහන්සේ සහ භික්ෂුසංඝයා අරමුණු කරගෙනය.\"\n\n“නාගිතය, මම යසස සමඟ එක් නො වෙමි, යසස ද මා සමඟ එක් නො වේ. නාගිතය, යම් කෙනෙක් මේ නෛෂ්ක්‍රම්‍යสุขය, විවේකสุขය, උපශමสุขය, සම්බෝධිสุขය කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නෙක් නොවේ නම්, (ඔහුට එය නොලැබෙන බැවින්) ඒ අසූචි වැනි කාමසුඛය, නිදිමතෙන් ඇතිවන කාමසුඛය, ලාභ සත්කාර ප්‍රශංසාสุขය කැමති විය හැකි ය. නමුත් මා මේ නෛෂ්ක්‍රම්‍යสุขය, විවේකสุขය, උපශමสุขය, සම්බෝධිสุขය කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නේ නම්, (මට එය අවශ්‍ය නොවන බැවින්) මම ඒ අසූචි වැනි කාමසුඛය, නිදිමතෙන් ඇතිවන කාමසුඛය, ලාභ සත්කාර ප්‍රශංසාสุขය කැමති නොවෙමි.\"\n\n“ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ මෙය පිළිගන්නා සේක්වා. සුගතයන් වහන්සේ පිළිගන්නා සේක්වා. ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේට මෙය පිළිගැනීමට සුදුසු කාලය යි. ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ යම් යම් ප්‍රදේශයකට වඩින්නේ ද, නගර වැසියන් හා ජනපද වැසියන් වන බමුණු ගෘහපතියෝ එම ප්‍රදේශයටම නැඹුරු වනු ඇත. ස්වාමීනි, යම් සේ මහ වර්ෂාවක් වසින කල ජලය බෑවුම දිගේ ගලා යන්නේ ද, එසෙම ස්වාමීනි, දැන් භාග්‍යවතුන් වහන්සේ යම් යම් ප්‍රදේශයකට වඩින්නේ ද, නගර වැසියන් හා ජනපද වැසියන් වන බමුණු ගෘහපතියෝ එම ප්‍රදේශයටම නැඹුරු වනු ඇත. එයට හේතුව කුමක් ද? ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ සීලය හා ප්‍රඥාව එබඳු වන බැවිනි.”\n\n“නාගිතය, මම යසස සමඟ එක් නො වෙමි, යසස ද මා සමඟ එක් නො වේ. නාගිතය, යම් කෙනෙක් මේ නෛෂ්ක්‍රම්‍යสุขය, විවේකสุขය, උපශමสุขය, සම්බෝධිสุขය කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නෙක් නොවේ නම්, (ඔහුට එය නොලැබෙන බැවින්) ඒ අසූචි වැනි කාමසුඛය, නිදිමතෙන් ඇතිවන කාමසුඛය, ලාභ සත්කාර ප්‍රශංසාสุขය කැමති විය හැකි ය. නමුත් මා මේ නෛෂ්ක්‍රම්‍යสุขය, විවේකสุขය, උපශමสุขය, සම්බෝධිสุขය කැමති පරිදි, අපහසුවකින් තොරව, වෙහෙසකින් තොරව ලබන්නේ නම්, (මට එය අවශ්‍ය නොවන බැවින්) මම ඒ අසූචි වැනි කාමසුඛය, නිදිමතෙන් ඇතිවන කාමසුඛය, ලාභ සත්කාර ප්‍රශංසාสุขය කැමති නොවෙමි.\"\n\n“නාගිතය, මෙහිලා මම ගම අසල වාසය කරන, සමාධියෙන් යුතුව වැඩසිටින භික්ෂුවක් දකිමි. නාගිතය, මට මෙසේ සිතේ: ‘දැන් මේ ආයුෂ්මත්වරයාට ආරාමිකයෙක් හෝ සාමණේරවරයෙක් හෝ බාධා කරනු ඇත, ඔහුව ඒ සමාධියෙන් චලනය කරනු ඇත’ කියා. එබැවින් නාගිතය, මම ගම අසල වාසය කරන ඒ භික්ෂුව කෙරෙහි සතුටු නො වෙමි.\"\n\n“නාගිතය, මෙහිලා මම අරණ්‍යවාසී වූ, අරණ්‍යයෙහි නිදි කිරමින් සිටින භික්ෂුවක් දකිමි. නාගිතය, මට මෙසේ සිතේ: ‘දැන් මේ ආයුෂ්මත්වරයා මේ නිදිමත වෙහෙස දුරු කොට අරණ්‍ය සංඥාවම මෙනෙහි කරනු ඇත, එකඟ බවට පත් වනු ඇත’ කියා. එබැවින් නාගිතය, මම අරණ්‍යයෙහි වාසය කරන ඒ භික්ෂුව කෙරෙහි සතුටු වෙමි.”\n\n“නාගිතය, මෙහිලා මම අරණ්‍යවාසී වූ, අරණ්‍යයෙහි නොසමාහිත ව වැඩසිටින භික්ෂුවක් දකිමි. නාගිතය, මට මෙසේ සිතේ: ‘දැන් මේ ආයුෂ්මත්වරයා නොසමාහිත සිත සමාධිගත කරනු ඇත, නැතහොත් සමාධිගත වූ සිත ආරක්ෂා කරනු ඇත’ කියා. එබැවින් නාගිතය, මම අරණ්‍යයෙහි වාසය කරන ඒ භික්ෂුව කෙරෙහි සතුටු වෙමි.”\n\n“නාගිතය, මෙහිලා මම අරණ්‍යවාසී වූ, අරණ්‍යයෙහි සමාධියෙන් යුතුව වැඩසිටින භික්ෂුවක් දකිමි. නාගිතය, මට මෙසේ සිතේ: ‘දැන් මේ ආයුෂ්මත්වරයා නොවිමුක්ත වූ සිත විමුක්ත කරනු ඇත, නැතහොත් විමුක්ත වූ සිත ආරක්ෂා කරනු ඇත’ කියා. එබැවින් නාගිතය, මම අරණ්‍යයෙහි වාසය කරන ඒ භික්ෂුව කෙරෙහි සතුටු වෙමි.”\n\n“නාගිතය, මෙහිලා මම ගම අසල වාසය කරන, සිව්පසය වන සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ ඖෂධ පරිෂ්කාර ලබන භික්ෂුවක් දකිමි.\"\n\nඔහු ඒ ලාභ, සත්කාර, කීර්ති ප්‍රශංසාව අපේක්ෂා කරමින් ප්‍රතිසංලීන භාවයෙන් ඉවත් වෙයි, වන අරණ්‍යයන්ගෙන්ද, වනගත ප්‍රදේශයන්ගෙන්ද, දුරස්ථ සේනාසනවලින්ද ඉවත් වෙයි; ගම්, නියම්ගම්, රාජධානිවලට එළඹ වාසය කරයි. එහෙයින්, නාගිත, ගම් ආසන්නයේ වාසය කිරීම හේතුවෙන් මම ඒ භික්‍ෂුව කෙරෙහි සතුටු නොවෙමි.\n\nඑහෙත්, නාගිත, මෙහිලා මම සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර යන ප්‍රත්‍යයන් ලබන ආරණ්‍යවාසී භික්‍ෂුවක් දකිමි. ඔහු ඒ ලාභ, සත්කාර, කීර්ති ප්‍රශංසාව ප්‍රතික්ෂේප කොට ප්‍රතිසංලීන භාවයෙන් ඉවත් නොවෙයි, වන අරණ්‍යයන්ගෙන්ද, වනගත ප්‍රදේශයන්ගෙන්ද, දුරස්ථ සේනාසනවලින්ද ඉවත් නොවෙයි. එහෙයින්, නාගිත, ආරණ්‍යවාසය හේතුවෙන් මම ඒ භික්‍ෂුව කෙරෙහි සතුටු වෙමි. නාගිත, යම් කලෙක මම දුර ගමනක යෙදී සිටින විට ඉදිරියෙන් හෝ පසුපසින් කිසිවකු නොදකිමිද, නාගිත, ඒ කලට අවම වශයෙන් මලමුත්‍ර පහකිරීමේ කටයුතු සඳහා පවා මට සැප පහසු වෙයි.",
      "paliTitle": "Nāgitasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Devatāvaggo [sekkhaparihāniyavaggo (syā.)] catuttho. Tassuddānaṃ – Sekhā dve aparihāni, moggallāna vijjābhāgiyā; Vivādadānattakārī nidānaṃ, kimiladārukkhandhena nāgitoti.",
    "english": "",
    "sinhala": ""
  }
}