{
  "id": "an6.9",
  "title": {
    "pali": "Sītivaggo",
    "english": "The Chapter on Extinction",
    "sinhala": "සීති වග්ගය"
  },
  "sections": [
    {
      "number": 85,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu abhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ. Katamehi chahi [visuddhi. 1.64 ādayo vitthāro]? Idha, bhikkhave, bhikkhu yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ na niggaṇhāti, yasmiṃ samaye cittaṃ paggahetabbaṃ tasmiṃ samaye cittaṃ na paggaṇhāti, yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ tasmiṃ samaye cittaṃ na sampahaṃseti, yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ tasmiṃ samaye cittaṃ na ajjhupekkhati, hīnādhimuttiko ca hoti, sakkāyābhirato ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu abhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu bhabbo anuttaraṃ sītibhāvaṃ sacchikātuṃ. Katamehi chahi? Idha, bhikkhave, bhikkhu yasmiṃ samaye cittaṃ niggahetabbaṃ tasmiṃ samaye cittaṃ niggaṇhāti, yasmiṃ samaye cittaṃ paggahetabbaṃ tasmiṃ samaye cittaṃ paggaṇhāti, yasmiṃ samaye cittaṃ sampahaṃsitabbaṃ tasmiṃ samaye cittaṃ sampahaṃseti, yasmiṃ samaye cittaṃ ajjhupekkhitabbaṃ tasmiṃ samaye cittaṃ ajjhupekkhati, paṇītādhimuttiko ca hoti, nibbānābhirato ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu bhabbo anuttaraṃ sītibhāvaṃ sacchikātu’’nti. Paṭhamaṃ.",
      "english": "Monastics, a bhikkhu endowed with six qualities is incapable of realizing the unexcelled liberation. What are these six? Here, monastics, a bhikkhu does not restrain his mind when it ought to be restrained; he does not arouse his mind when it ought to be aroused; he does not gladden his mind when it ought to be gladdened; he does not regard his mind with equanimity when it ought to be regarded with equanimity; and he is inclined towards what is inferior; and he takes delight in the notion of self. Indeed, monastics, a bhikkhu endowed with these six qualities is incapable of realizing the unexcelled liberation.\n\nMonastics, a bhikkhu endowed with six qualities is capable of realizing the unexcelled liberation. What are these six? Here, monastics, a bhikkhu restrains his mind when it ought to be restrained; he arouses his mind when it ought to be aroused; he gladdens his mind when it ought to be gladdened; he regards his mind with equanimity when it ought to be regarded with equanimity; and he is inclined towards what is excellent; and he takes delight in Nibbana. Indeed, monastics, a bhikkhu endowed with these six qualities is capable of realizing the unexcelled liberation.",
      "sinhala": "මහණෙනි, ධර්මයන් සයකින් සමන්විත වූ භික්‍ෂුව නිරුත්තර ශාන්තිය සාක්ෂාත් කිරීමට අසමර්ථ වෙයි. කවර ධර්මතා සයකින්ද? මහණෙනි, මෙහිලා භික්‍ෂුව යම් කලක සිත සංවර කළ යුතුද, එකල සිත සංවර නොකරයි. යම් කලක සිත ප්‍රබෝධවත් කළ යුතුද, එකල සිත ප්‍රබෝධවත් නොකරයි. යම් කලක සිත ප්‍රීතිමත් කළ යුතුද, එකල සිත ප්‍රීතිමත් නොකරයි. යම් කලක සිත උපේක්ෂාවෙන් යුතුව විමසිය යුතුද, එකල සිත උපේක්ෂාවෙන් යුතුව නොවිමසයි. තවද, ඔහු පහත් අරමුණු කෙරෙහි නැඹුරු වූවෙක් වෙයි. සක්කාය දෘෂ්ටියට ඇළුණෙක් වෙයි. මහණෙනි, මේ ධර්මතා සයකින් සමන්විත වූ භික්‍ෂුව නිරුත්තර ශාන්තිය සාක්ෂාත් කිරීමට අසමර්ථ වෙයි.\n\nමහණෙනි, ධර්මයන් සයකින් සමන්විත වූ භික්‍ෂුව නිරුත්තර ශාන්තිය සාක්ෂාත් කිරීමට සමර්ථ වෙයි. කවර ධර්මතා සයකින්ද? මහණෙනි, මෙහිලා භික්‍ෂුව යම් කලක සිත සංවර කළ යුතුද, එකල සිත සංවර කරයි. යම් කලක සිත ප්‍රබෝධවත් කළ යුතුද, එකල සිත ප්‍රබෝධවත් කරයි. යම් කලක සිත ප්‍රීතිමත් කළ යුතුද, එකල සිත ප්‍රීතිමත් කරයි. යම් කලක සිත උපේක්ෂාවෙන් යුතුව විමසිය යුතුද, එකල සිත උපේක්ෂාවෙන් යුතුව විමසයි. තවද, ඔහු උසස් අරමුණු කෙරෙහි නැඹුරු වූවෙක් වෙයි. නිර්වාණයට ඇළුණෙක් වෙයි. මහණෙනි, මේ ධර්මතා සයකින් සමන්විත වූ භික්‍ෂුව නිරුත්තර ශාන්තිය සාක්ෂාත් කිරීමට සමර්ථ වෙයි.",
      "paliTitle": "Sītibhāvasuttaṃ",
      "englishTitle": "Discourse on Tranquility",
      "sinhalaTitle": "ශාන්තභාව සූත්‍රය"
    },
    {
      "number": 86,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Kammāvaraṇatāya samannāgato hoti, kilesāvaraṇatāya samannāgato hoti, vipākāvaraṇatāya samannāgato hoti, assaddho ca hoti, acchandiko ca, duppañño ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Na kammāvaraṇatāya samannāgato hoti, na kilesāvaraṇatāya samannāgato hoti, na vipākāvaraṇatāya samannāgato hoti, saddho ca hoti, chandiko ca, paññavā ca. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Dutiyaṃ.",
      "english": "Monks, one who is endowed with six qualities, even while listening to the True Dhamma, is incapable of entering the definite path leading to certainty in wholesome states. Which six? He is endowed with obstruction by kamma, he is endowed with obstruction by defilements, he is endowed with obstruction by karmic results, and he is faithless, without aspiration, and unwise. Indeed, monks, one who is endowed with these six qualities, even while listening to the True Dhamma, is incapable of entering the definite path leading to certainty in wholesome states.\n\nMonks, one who is endowed with six qualities, while listening to the True Dhamma, is capable of entering the definite path leading to certainty in wholesome states. Which six? He is not endowed with obstruction by kamma, he is not endowed with obstruction by defilements, he is not endowed with obstruction by karmic results, and he is endowed with faith, with aspiration, and with wisdom. Indeed, monks, one who is endowed with these six qualities, while listening to the True Dhamma, is capable of entering the definite path leading to certainty in wholesome states.",
      "sinhala": "භික්ෂූන් වහන්ස, ධර්මයන් සයකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍රවණය කළත්, කුසල ධර්මයන්හි ස්ථාවර භාවයට පත්වීමටත්, නිවනට යන ස්ථිර මාර්ගයට එළඹීමටත් අසමත් වෙයි. ඒ සය කුමක්ද? කර්මාවරණයෙන් යුක්ත වෙයි, ක්ලේශාවරණයෙන් යුක්ත වෙයි, විපාකාවරණයෙන් යුක්ත වෙයි, අශ්‍රද්ධාවන්ත වෙයි, අඡන්දික වෙයි, දුෂ්ප්‍රාඥ වෙයි. භික්ෂූන් වහන්ස, මේ ධර්මයන් සයකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍රවණය කළත්, කුසල ධර්මයන්හි ස්ථාවර භාවයට පත්වීමටත්, නිවනට යන ස්ථිර මාර්ගයට එළඹීමටත් අසමත් වෙයි.\n\nභික්ෂූන් වහන්ස, ධර්මයන් සයකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍රවණය කරන්නේ නම්, කුසල ධර්මයන්හි ස්ථාවර භාවයට පත්වීමටත්, නිවනට යන ස්ථිර මාර්ගයට එළඹීමටත් සමත් වෙයි. ඒ සය කුමක්ද? කර්මාවරණයෙන් යුක්ත නොවෙයි, ක්ලේශාවරණයෙන් යුක්ත නොවෙයි, විපාකාවරණයෙන් යුක්ත නොවෙයි, ශ්‍රද්ධාවන්ත වෙයි, ඡන්දික වෙයි, ප්‍රාඥ වෙයි. භික්ෂූන් වහන්ස, මේ ධර්මයන් සයකින් යුක්ත වූ තැනැත්තා සද්ධර්මය ශ්‍රවණය කරන්නේ නම්, කුසල ධර්මයන්හි ස්ථාවර භාවයට පත්වීමටත්, නිවනට යන ස්ථිර මාර්ගයට එළඹීමටත් සමත් වෙයි.",
      "paliTitle": "Āvaraṇasuttaṃ",
      "englishTitle": "The Discourse on Hindrances",
      "sinhalaTitle": "ආවරණ සූත‍්‍රය"
    },
    {
      "number": 87,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Mātā jīvitā voropitā hoti, pitā jīvitā voropito hoti, arahaṃ [arahā (syā. kaṃ.), arahanto (ka.)] jīvitā voropito hoti, tathāgatassa duṭṭhena cittena lohitaṃ uppāditaṃ hoti, saṅgho bhinno hoti, duppañño hoti jaḷo eḷamūgo. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Na mātā jīvitā voropitā hoti, na pitā jīvitā voropito hoti, na arahaṃ jīvitā voropito hoti, na tathāgatassa duṭṭhena cittena lohitaṃ uppāditaṃ hoti, na saṅgho bhinno hoti, paññavā hoti ajaḷo aneḷamūgo. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Tatiyaṃ.",
      "english": "Monks, one endowed with six qualities, even while listening to the True Dhamma, is incapable of entering the path of certainty, into the certainty of wholesome states. What are these six? The mother has been deprived of life, the father has been deprived of life, an Arahant has been deprived of life, blood has been shed from a Tathāgata with malicious intent, the Saṅgha has been split, and he is lacking wisdom, dull-witted, and unresponsive. Monks, one endowed with these six qualities, even while listening to the True Dhamma, is incapable of entering the path of certainty, into the certainty of wholesome states.\n\nMonks, one endowed with six qualities, while listening to the True Dhamma, is capable of entering the path of certainty, into the certainty of wholesome states. What are these six? The mother has not been deprived of life, the father has not been deprived of life, an Arahant has not been deprived of life, blood has not been shed from a Tathāgata with malicious intent, the Saṅgha has not been split, and he is wise, not dull-witted, and not unresponsive. Monks, one endowed with these six qualities, while listening to the True Dhamma, is capable of entering the path of certainty, into the certainty of wholesome states.",
      "sinhala": "මහණෙනි, ධර්ම සයක්‌ සමඟින් යුක්තවූ තැනැත්තෙක්‌ සද්ධර්මය ශ‍්‍රවණය කරමින් සිටියත්, කුසල ධර්මයන්හි නිශ්චිත භාවයට පත්වීමට, නිවනට පත්වීමට සමර්ථ නොවෙයි. කවර සයකින් ද? මවට ජීවිතක්ෂය සිදුකරනු ලැබ ඇත. පියාට ජීවිතක්ෂය සිදුකරනු ලැබ ඇත. රහතන් වහන්සේ නමකට ජීවිතක්ෂය සිදුකරනු ලැබ ඇත. තථාගතයන් වහන්සේට දුෂ්ට සිතකින් ලේ සෙලවීමක් සිදුකරනු ලැබ ඇත. සංඝ භේදයක් සිදුකරනු ලැබ ඇත. මහා ප‍්‍රඥාවක් නැති, අඥාන, ගොළු බවට පත්වූවෙක් වෙයි. මහණෙනි, සැබවින්ම මේ ධර්ම සය සමඟින් යුක්තවූ තැනැත්තා සද්ධර්මය ශ‍්‍රවණය කරමින් සිටියත්, කුසල ධර්මයන්හි නිශ්චිත භාවයට පත්වීමට, නිවනට පත්වීමට සමර්ථ නොවෙයි.\n\nමහණෙනි, ධර්ම සයක්‌ සමඟින් යුක්තවූ තැනැත්තෙක්‌ සද්ධර්මය ශ‍්‍රවණය කරන්නේ නම්, කුසල ධර්මයන්හි නිශ්චිත භාවයට පත්වීමට, නිවනට පත්වීමට සමර්ථ වෙයි. කවර සයකින් ද? මවට ජීවිතක්ෂය සිදුකරනු ලැබ නොමැත. පියාට ජීවිතක්ෂය සිදුකරනු ලැබ නොමැත. රහතන් වහන්සේ නමකට ජීවිතක්ෂය සිදුකරනු ලැබ නොමැත. තථාගතයන් වහන්සේට දුෂ්ට සිතකින් ලේ සෙලවීමක් සිදුකරනු ලැබ නොමැත. සංඝ භේදයක් සිදුකරනු ලැබ නොමැත. ප‍්‍රඥාවන්ත වෙයි, අඥාන නොවේ, ගොළු බවට පත්වූවෙක් නොවේ. මහණෙනි, සැබවින්ම මේ ධර්ම සය සමඟින් යුක්තවූ තැනැත්තා සද්ධර්මය ශ‍්‍රවණය කරන්නේ නම්, කුසල ධර්මයන්හි නිශ්චිත භාවයට පත්වීමට, නිවනට පත්වීමට සමර්ථ වෙයි.",
      "paliTitle": "Voropitasuttaṃ",
      "englishTitle": "Discourse on What is Cut Off",
      "sinhalaTitle": "ඉවත් කළ සූත්‍‌රය"
    },
    {
      "number": 88,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Tathāgatappavedite dhammavinaye desiyamāne na sussūsati, na sotaṃ odahati, na aññā cittaṃ upaṭṭhāpeti [upaṭṭhapeti (sī. syā. kaṃ. pī.)], anatthaṃ gaṇhāti, atthaṃ riñcati, ananulomikāya khantiyā samannāgato hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇantopi saddhammaṃ abhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. ‘‘Chahi, bhikkhave, dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammattaṃ. Katamehi chahi? Tathāgatappavedite dhammavinaye desiyamāne sussūsati, sotaṃ odahati, aññā cittaṃ upaṭṭhāpeti, atthaṃ gaṇhāti, anatthaṃ riñcati, anulomikāya khantiyā samannāgato hoti. Imehi kho, bhikkhave, chahi dhammehi samannāgato suṇanto saddhammaṃ bhabbo niyāmaṃ okkamituṃ kusalesu dhammesu sammatta’’nti. Catutthaṃ.",
      "english": "Monks, one endowed with six qualities, even while listening to the True Dhamma, is incapable of entering the fixed path, of attaining certainty in wholesome states. What are these six? When the Dhamma and Discipline proclaimed by the Tathāgata are being taught, one does not listen eagerly, does not lend an ear, does not direct the mind towards understanding, grasps what is unbeneficial, abandons what is beneficial, and is endowed with an acceptance that is not in accordance with the Dhamma. Monks, one endowed with these six qualities, even while listening to the True Dhamma, is incapable of entering the fixed path, of attaining certainty in wholesome states.\n\nMonks, one endowed with six qualities, while listening to the True Dhamma, is capable of entering the fixed path, of attaining certainty in wholesome states. What are these six? When the Dhamma and Discipline proclaimed by the Tathāgata are being taught, one listens eagerly, lends an ear, directs the mind towards understanding, grasps what is beneficial, abandons what is unbeneficial, and is endowed with an acceptance that is in accordance with the Dhamma. Monks, one endowed with these six qualities, while listening to the True Dhamma, is capable of entering the fixed path, of attaining certainty in wholesome states.",
      "sinhala": "මහණෙනි, කරුණු සයකින් යුක්ත වූ පුද්ගලයා සද්ධර්මය ශ්‍රවණය කරමින් සිටියත්, කුසල ධර්මයන්හි ස්ථිරත්වයට පත්වෙමින්, නිත්‍ය ධර්ම මාර්ගයට පිවිසීමට නොහැක්කේය. කවර සයකින් ද? තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කරනු ලබන විට ඔහු සවන් නොදෙයි, කන යොමා නොබලයි, ඥානය පිණිස සිත පිහිටුවා නොගනියි, අනර්ථය අල්ලා ගනියි, අර්ථය අත්හරියි, ධර්මයට අනුකූල නොවන පිළිගැනීමකින් යුක්ත වෙයි. මහණෙනි, මේ කරුණු සයෙන් යුක්ත වූ පුද්ගලයා සද්ධර්මය ශ්‍රවණය කරමින් සිටියත්, කුසල ධර්මයන්හි ස්ථිරත්වයට පත්වෙමින්, නිත්‍ය ධර්ම මාර්ගයට පිවිසීමට නොහැක්කේය.\n\nමහණෙනි, කරුණු සයකින් යුක්ත වූ පුද්ගලයා සද්ධර්මය ශ්‍රවණය කරමින්, කුසල ධර්මයන්හි ස්ථිරත්වයට පත්වෙමින්, නිත්‍ය ධර්ම මාර්ගයට පිවිසීමට සමර්ථය. කවර සයකින් ද? තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනය දේශනා කරනු ලබන විට ඔහු සවන් දෙයි, කන යොමා බලයි, ඥානය පිණිස සිත පිහිටුවා ගනියි, අර්ථය අල්ලා ගනියි, අනර්ථය අත්හරියි, ධර්මයට අනුකූල වන පිළිගැනීමකින් යුක්ත වෙයි. මහණෙනි, මේ කරුණු සයෙන් යුක්ත වූ පුද්ගලයා සද්ධර්මය ශ්‍රවණය කරමින්, කුසල ධර්මයන්හි ස්ථිරත්වයට පත්වෙමින්, නිත්‍ය ධර්ම මාර්ගයට පිවිසීමට සමර්ථය.",
      "paliTitle": "Sussūsatisuttaṃ",
      "englishTitle": "Discourse on Listening",
      "sinhalaTitle": "සුස්සූසති සූත්‍රය"
    },
    {
      "number": 89,
      "pali": "‘‘Cha, bhikkhave, dhamme appahāya abhabbo diṭṭhisampadaṃ sacchikātuṃ. Katame cha? Sakkāyadiṭṭhiṃ, vicikicchaṃ, sīlabbataparāmāsaṃ, apāyagamanīyaṃ rāgaṃ, apāyagamanīyaṃ dosaṃ, apāyagamanīyaṃ mohaṃ. Ime kho, bhikkhave, cha dhamme appahāya abhabbo diṭṭhisampadaṃ sacchikātuṃ. ‘‘Cha, bhikkhave, dhamme pahāya bhabbo diṭṭhisampadaṃ sacchikātuṃ. Katame cha? Sakkāyadiṭṭhiṃ, vicikicchaṃ, sīlabbataparāmāsaṃ, apāyagamanīyaṃ rāgaṃ, apāyagamanīyaṃ dosaṃ, apāyagamanīyaṃ mohaṃ. Ime kho, bhikkhave, cha dhamme pahāya bhabbo diṭṭhisampadaṃ sacchikātu’’nti. Pañcamaṃ.",
      "english": "Monks, without abandoning six things, one is incapable of realizing the accomplishment of right view. Which six? The view of self-identification, skeptical wavering, clinging to rites and rituals, lust that leads to the lower realms, aversion that leads to the lower realms, and delusion that leads to the lower realms. These six things, monks, without abandoning them, one is incapable of realizing the accomplishment of right view.\n\nMonks, by abandoning six things, one is capable of realizing the accomplishment of right view. Which six? The view of self-identification, skeptical wavering, clinging to rites and rituals, lust that leads to the lower realms, aversion that leads to the lower realms, and delusion that leads to the lower realms. These six things, monks, by abandoning them, one is capable of realizing the accomplishment of right view.",
      "sinhala": "භික්ෂූනි, ධ​ර්ම කාරණා හයක් ප්‍රහීණ නොකිරීමෙන් යමෙකුට දෘෂ්ටි සම්පදාව සාක්ෂාත් කිරීමට නොහැකි වේ. ඒ හය කවරේද? සක්කායදිට්ඨිය, විචිකිච්ඡාව, සීලබ්බතපරාමාසය, අපායගාමී රාගය, අපායගාමී ද්වේෂය, අපායගාමී මෝහය යන මේ ධ​ර්ම කාරණා හය ප්‍රහීණ නොකිරීමෙන් යමෙකුට දෘෂ්ටි සම්පදාව සාක්ෂාත් කිරීමට නොහැකි වේ.\n\nභික්ෂූනි, ධ​ර්ම කාරණා හයක් ප්‍රහීණ කිරීමෙන් යමෙකුට දෘෂ්ටි සම්පදාව සාක්ෂාත් කිරීමට හැකි වේ. ඒ හය කවරේද? සක්කායදිට්ඨිය, විචිකිච්ඡාව, සීලබ්බතපරාමාසය, අපායගාමී රාගය, අපායගාමී ද්වේෂය, අපායගාමී මෝහය යන මේ ධ​ර්ම කාරණා හය ප්‍රහීණ කිරීමෙන් යමෙකුට දෘෂ්ටි සම්පදාව සාක්ෂාත් කිරීමට හැකි වේ.",
      "paliTitle": "Appahāyasuttaṃ",
      "englishTitle": "The Non-Abandonment Discourse",
      "sinhalaTitle": "අපහාය සූත්‍රය"
    },
    {
      "number": 90,
      "pali": "‘‘Chayime, bhikkhave, dhammā diṭṭhisampannassa puggalassa pahīnā. Katame cha? Sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso, apāyagamanīyo rāgo, apāyagamanīyo doso, apāyagamanīyo moho. Ime kho, bhikkhave, cha dhammā diṭṭhisampannassa puggalassa pahīnā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these six qualities are abandoned in a person who is perfected in view. Which six? Identity view, skeptical doubt, clinging to rites and rituals, sensual desire that leads to the states of woe, ill-will that leads to the states of woe, and delusion that leads to the states of woe. Indeed, monks, these six qualities are abandoned in a person who is perfected in view.",
      "sinhala": "භික්ෂූණි, සම්මාදිට්ඨියෙන් යුක්ත පුද්ගලයා හට මේ ධර්ම සයක් ප්‍ර‍්‍රහීණ වී ඇත. ඒ සය කවරේද?\nසක්කාය දිට්ඨිය, විචිකිච්ඡාව, සීලබ්බත පරාමාසය, අපායගාමී රාගය, අපායගාමී ද්වේශය, අපායගාමී මෝහය යන මේවා යි.\nභික්ෂූණි, සැබවින්ම, සම්මාදිට්ඨියෙන් යුක්ත පුද්ගලයා හට මේ ධර්ම සය ප්‍ර‍්‍රහීණ වී ඇත.",
      "paliTitle": "Pahīnasuttaṃ",
      "englishTitle": "Discourse on the Abandoned",
      "sinhalaTitle": "ප්ZWJරහීණ සූත්ZWJරය"
    },
    {
      "number": 91,
      "pali": "‘‘Cha, bhikkhave, dhamme abhabbo diṭṭhisampanno puggalo uppādetuṃ. Katame cha? Sakkāyadiṭṭhiṃ, vicikicchaṃ, sīlabbataparāmāsaṃ, apāyagamanīyaṃ rāgaṃ, apāyagamanīyaṃ dosaṃ, apāyagamanīyaṃ mohaṃ. Ime kho, bhikkhave, cha dhamme abhabbo diṭṭhisampanno puggalo uppādetu’’nti. Sattamaṃ.",
      "english": "Monks, a person endowed with right view is incapable of generating six things. Which six?\n\nSelf-view, skeptical doubt, grasping at rites and rituals, craving leading to states of woe, aversion leading to states of woe, and delusion leading to states of woe. Indeed, monks, these are the six things that a person endowed with right view is incapable of generating.",
      "sinhala": "මහණෙනි, දිට්ඨිසම්පන්න වූ පුද්ගලයාට කරුණු සයක් ඇති කර ගැනීමට නොහැකිය. කවරේද ඒ සය?\n\nසක්කායදිට්ඨිය, විචිකිච්ඡාව, සීලබ්බතපරාමාසය, අපායගාමී රාගය, අපායගාමී ද්වේෂය, සහ අපායගාමී මෝහය යන මේවාය.\n\nමහණෙනි, දිට්ඨිසම්පන්න වූ පුද්ගලයාට මේ කරුණු සය ඇති කර ගැනීමට නොහැකියි.",
      "paliTitle": "Abhabbasuttaṃ",
      "englishTitle": "The Discourse on the Incapable",
      "sinhalaTitle": "අභබ්බ සූත්‍රය"
    },
    {
      "number": 92,
      "pali": "‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo satthari agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo dhamme agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo saṅghe agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo sikkhāya agāravo viharituṃ appatisso, abhabbo diṭṭhisampanno puggalo anāgamanīyaṃ vatthuṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo aṭṭhamaṃ bhavaṃ nibbattetuṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these six impossible states. Which six?\nIt is impossible for a person endowed with right view to dwell disrespectfully and without deference towards the Teacher. It is impossible for a person endowed with right view to dwell disrespectfully and without deference towards the Dhamma. It is impossible for a person endowed with right view to dwell disrespectfully and without deference towards the Sangha. It is impossible for a person endowed with right view to dwell disrespectfully and without deference towards the training. It is impossible for a person endowed with right view to revert to that which has been transcended. It is impossible for a person endowed with right view to take rebirth for an eighth time.\nThese, monks, are the six impossible states.",
      "sinhala": "මහණෙනි, මේ නොවිය හැක්‍ය වූ කරුණු සයකි. කවරේද ඒ සය?\n\nදිට්ඨි සම්පන්න පුද්ගලයාට ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් හා අවනත භාවයකින් තොරව වාසය කිරීම නොහැක්කේය.\n\nදිට්ඨි සම්පන්න පුද්ගලයාට ධර්මය කෙරෙහි අගෞරවයෙන් හා අවනත භාවයකින් තොරව වාසය කිරීම නොහැක්කේය.\n\nදිට්ඨි සම්පන්න පුද්ගලයාට සංඝයා කෙරෙහි අගෞරවයෙන් හා අවනත භාවයකින් තොරව වාසය කිරීම නොහැක්කේය.\n\nදිට්ඨි සම්පන්න පුද්ගලයාට ශික්ෂාව කෙරෙහි අගෞරවයෙන් හා අවනත භාවයකින් තොරව වාසය කිරීම නොහැක්කේය.\n\nදිට්ඨි සම්පන්න පුද්ගලයාට නැවත නොපැමිණිය යුතු තත්ත්වයකට (දුගතියකට) නැවත පැමිණීම නොහැක්කේය.\n\nදිට්ඨි සම්පන්න පුද්ගලයාට අටවන භවයක් උපදවා ගැනීම නොහැක්කේය.\n\nමහණෙනි, මේවාමයි නොවිය හැක්‍ය වූ කරුණු සය.",
      "paliTitle": "Paṭhamaabhabbaṭṭhānasuttaṃ",
      "englishTitle": "The First Discourse on Impossibilities",
      "sinhalaTitle": "පළමුවන අභ්‍<ZWJ>යස්<ZWJ>ථාන සූත<ZWJ>්‍රය"
    },
    {
      "number": 93,
      "pali": "‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo kañci [kiñci (ka.) vibha. 809; ma. ni. 3.127] saṅkhāraṃ niccato upagantuṃ, abhabbo diṭṭhisampanno puggalo kañci saṅkhāraṃ sukhato upagantuṃ, abhabbo diṭṭhisampanno puggalo kañci dhammaṃ attato upagantuṃ, abhabbo diṭṭhisampanno puggalo ānantariyaṃ kammaṃ [ānantariyakammaṃ (sī.), anantariyakammaṃ (syā. pī.) a. ni. 4.162 passitabbaṃ] kātuṃ, abhabbo diṭṭhisampanno puggalo kotūhalamaṅgalena suddhiṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo ito bahiddhā dakkhiṇeyyaṃ gavesituṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Navamaṃ.",
      "english": "Monks, there are these six impossibilities. Which six? It is impossible for a person endowed with right view to regard any conditioned phenomenon as permanent. It is impossible for a person endowed with right view to regard any conditioned phenomenon as pleasant. It is impossible for a person endowed with right view to regard any phenomenon as a self. It is impossible for a person endowed with right view to commit an immediate retribution karma. It is impossible for a person endowed with right view to seek purity through superstitious rites and ceremonies. It is impossible for a person endowed with right view to seek worthy recipients of offerings outside of this teaching. These, monks, are the six impossibilities.",
      "sinhala": "භික්ෂූණි, මේ අභව්‍ය ස්ථාන හයකි. ඒ කවර හයක්ද?\n\nසම්මා දිට්ඨියෙන් යුක්ත පුද්ගලයාට කිසිදු සංස්කාරයක් නිත්‍ය යැයි ගැනීම අභව්‍යය. සම්මා දිට්ඨියෙන් යුක්ත පුද්ගලයාට කිසිදු සංස්කාරයක් සැප යැයි ගැනීම අභව්‍යය. සම්මා දිට්ඨියෙන් යුක්ත පුද්ගලයාට කිසිදු ධර්මයක් ආත්මය යැයි ගැනීම අභව්‍යය. සම්මා දිට්ඨියෙන් යුක්ත පුද්ගලයාට ආනන්තරිය කර්මයක් කිරීම අභව්‍යය. සම්මා දිට්ඨියෙන් යුක්ත පුද්ගලයාට කෝතුහල මංගල්‍යයන්ගෙන් පාරිශුද්ධිය අපේක්ෂා කිරීම අභව්‍යය. සම්මා දිට්ඨියෙන් යුක්ත පුද්ගලයාට මෙයින් පිටත (වෙනත් ශාසනයක) දක්ෂිණාවට සුදුස්සෙකු සෙවීම අභව්‍යය.\n\nභික්ෂූණි, මේවා අභව්‍ය ස්ථාන හයයි.",
      "paliTitle": "Dutiyaabhabbaṭṭhānasuttaṃ",
      "englishTitle": "The Second Discourse on Impossibilities",
      "sinhalaTitle": "දෙවන අභබ‌්බ‌ට්ඨාන සූ‍ත්‍රය"
    },
    {
      "number": 94,
      "pali": "‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo mātaraṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo pitaraṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo arahantaṃ jīvitā voropetuṃ, abhabbo diṭṭhisampanno puggalo tathāgatassa duṭṭhena cittena lohitaṃ uppādetuṃ, abhabbo diṭṭhisampanno puggalo saṅghaṃ bhindituṃ, abhabbo diṭṭhisampanno puggalo aññaṃ satthāraṃ uddisituṃ. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Dasamaṃ.",
      "english": "Monks, there are these six impossible situations. Which six?\n\nIt is impossible for a person who has attained right view to deprive their mother of life. It is impossible for a person who has attained right view to deprive their father of life. It is impossible for a person who has attained right view to deprive an Arahant of life. It is impossible for a person who has attained right view to cause the Tathagata to bleed with malicious intent. It is impossible for a person who has attained right view to cause a schism in the monastic community. It is impossible for a person who has attained right view to declare another as their supreme teacher.\n\nThese, monks, are the six impossible situations.",
      "sinhala": "භික්ෂූනි, මේ නොවිය හැකි ස්ථාන හයකි. ඒ කුමන හයද? දෘෂ්ටි සම්පන්න පුද්ගලයාට මවකගේ ජීවිතය නැති කිරීම නොහැකිය. දෘෂ්ටි සම්පන්න පුද්ගලයාට පියෙකුගේ ජීවිතය නැති කිරීම නොහැකිය. දෘෂ්ටි සම්පන්න පුද්ගලයාට අරහත් කෙනෙකුගේ ජීවිතය නැති කිරීම නොහැකිය. දෘෂ්ටි සම්පන්න පුද්ගලයාට තථාගතයන් වහන්සේගේ සිරුරේ ක‍්‍රෝධ සහිත සිතකින් ලේ සෙලවීම නොහැකිය. දෘෂ්ටි සම්පන්න පුද්ගලයාට සංඝ භේදයක් කිරීම නොහැකිය. දෘෂ්ටි සම්පන්න පුද්ගලයාට වෙනත් ශාස්තෘවරයෙකු සරණ යාම නොහැකිය. භික්ෂූනි, මේවා එම නොවිය හැකි ස්ථාන හයයි.",
      "paliTitle": "Tatiyaabhabbaṭṭhānasuttaṃ",
      "englishTitle": "The Third Impossibility Discourse",
      "sinhalaTitle": "තෙවැනි අභබ්බස්\\u200dථාන සූත්\\u200dරය"
    },
    {
      "number": 95,
      "pali": "‘‘Chayimāni, bhikkhave, abhabbaṭṭhānāni. Katamāni cha? Abhabbo diṭṭhisampanno puggalo sayaṃkataṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo paraṃkataṃ [parakataṃ (sī. syā.)] sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo sayaṃkatañca paraṃkatañca sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo asayaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ, abhabbo diṭṭhisampanno puggalo asayaṃkārañca aparaṃkārañca adhiccasamuppannaṃ sukhadukkhaṃ paccāgantuṃ. Taṃ kissa hetu? Tathā hissa, bhikkhave, diṭṭhisampannassa puggalassa hetu ca sudiṭṭho hetusamuppannā ca dhammā. Imāni kho, bhikkhave, cha abhabbaṭṭhānānī’’ti. Ekādasamaṃ. ",
      "english": "Monks, there are these six impossible conditions. Which six?\nAn individual endowed with right view cannot affirm that pleasure and pain are self-made;\nan individual endowed with right view cannot affirm that pleasure and pain are made by another;\nan individual endowed with right view cannot affirm that pleasure and pain are made both by oneself and by another;\nan individual endowed with right view cannot affirm that pleasure and pain are not made by oneself, but arisen by chance;\nan individual endowed with right view cannot affirm that pleasure and pain are not made by another, but arisen by chance;\nan individual endowed with right view cannot affirm that pleasure and pain are not made by oneself and not made by another, but arisen by chance.\n\nWhy is that? Because, monks, for an individual endowed with right view, the cause is clearly seen, and the phenomena arisen from a cause are also clearly seen. These, monks, are the six impossible conditions.",
      "sinhala": "භික්‍ෂූණි, මේ අභව්‍ය ස්ථාන හයකි. ඒ කවර හයද?\n\nදෘෂ්ටිසම්පන්න පුද්ගලයාට තමා විසින්ම කරන ලද සැප දුක් ඇතැයි පිළිගැනීමට නොහැකිය.\nදෘෂ්ටිසම්පන්න පුද්ගලයාට අන්‍යයන් විසින් කරන ලද සැප දුක් ඇතැයි පිළිගැනීමට නොහැකිය.\nදෘෂ්ටිසම්පන්න පුද්ගලයාට තමා විසින්ම හා අන්‍යයන් විසින් කරන ලද සැප දුක් ඇතැයි පිළිගැනීමට නොහැකිය.\nදෘෂ්ටිසම්පන්න පුද්ගලයාට තමාගේ ක්‍රියාවෙන් නොවන, හදිසියේ අහේතුකව හටගත් සැප දුක් ඇතැයි පිළිගැනීමට නොහැකිය.\nදෘෂ්ටිසම්පන්න පුද්ගලයාට අන්‍යයන්ගේ ක්‍රියාවෙන් නොවන, හදිසියේ අහේතුකව හටගත් සැප දුක් ඇතැයි පිළිගැනීමට නොහැකිය.\nදෘෂ්ටිසම්පන්න පුද්ගලයාට තමාගේ හෝ අන්‍යයන්ගේ ක්‍රියාවෙන් නොවන, හදිසියේ අහේතුකව හටගත් සැප දුක් ඇතැයි පිළිගැනීමට නොහැකිය.\n\nඑයට හේතුව කුමක්ද? භික්‍ෂූණි, මක්නිසාද යත්, දෘෂ්ටිසම්පන්න පුද්ගලයාට හේතුව මනාව දක්නා ලද්දේය. හේතු ප්‍රත්‍යයෙන් හටගත් ධර්මයන්ද මනාව දක්නා ලද්දේය.\n\nභික්‍ෂූණි, මේවා ඒ අභව්‍ය ස්ථාන හයයි.",
      "paliTitle": "Catutthaabhabbaṭṭhānasuttaṃ",
      "englishTitle": "The Fourth Discourse on Impossible Grounds",
      "sinhalaTitle": "සිව්වන අභබ්බට්ඨාන සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Sītivaggo navamo. [catuttho (syā. ka.)] Tassuddānaṃ – Sītibhāvaṃ āvaraṇaṃ, voropitā sussūsati; Appahāya pahīnābhabbo, taṭṭhānā caturopi cāti.",
    "english": "The Ninth Chapter on Coolness",
    "sinhala": "නවවන සීති වග‍්ගය"
  }
}