{
  "id": "an6.2",
  "title": {
    "pali": "Sāraṇīyavaggo",
    "english": "The Chapter on Amiable Qualities",
    "sinhala": "සාරණීය වර්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "‘‘Chayime, bhikkhave, dhammā sāraṇīyā [sārāṇīyā (sī. syā. kaṃ. pī.)]. Katame cha? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ vacīkammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi sabrahmacārīhi sādhāraṇabhogī, ayampi dhammo sāraṇīyo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni tathārūpehi sīlehi sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo. Ime kho, bhikkhave, cha dhammā sāraṇīyā’’ti. Paṭhamaṃ.",
      "english": "Monks, these six qualities inspire harmony. Which six?\n\nHere, monks, a bhikkhu maintains acts of loving-kindness in body towards his fellow practitioners, both in public and in private. This too is a quality that inspires harmony.\n\nFurthermore, monks, a bhikkhu maintains acts of loving-kindness in speech towards his fellow practitioners, both in public and in private. This too is a quality that inspires harmony.\n\nFurthermore, monks, a bhikkhu maintains acts of loving-kindness in mind towards his fellow practitioners, both in public and in private. This too is a quality that inspires harmony.\n\nFurthermore, monks, whatever gains are righteous and obtained in accordance with the Dhamma, even if it is only the contents of his alms-bowl, the bhikkhu does not partake of such gains alone; he shares them with his virtuous fellow practitioners. This too is a quality that inspires harmony.\n\nFurthermore, monks, the bhikkhu lives in shared virtue with his fellow practitioners, both in public and in private. These are the virtues that are unbroken, untorn, unblemished, unspotted, liberating, praised by the wise, ungrasped, and conducive to concentration. This too is a quality that inspires harmony.\n\nFurthermore, monks, the bhikkhu lives in shared view with his fellow practitioners, both in public and in private. This is the noble view that is liberating, leading its practitioner to the right destruction of suffering. This too is a quality that inspires harmony.\n\nThese, monks, are the six qualities that inspire harmony.",
      "sinhala": "භික්ෂූනි, මේ සාරණීය ධර්ම සයක් ඇත. කවරේද ඒ සය?\n\nභික්ෂූනි, මේ ශාසනයෙහි භික්ෂුවකට ශ්‍රේෂ්ඨ බ්‍රහ්මචාරීන් කෙරෙහි ප්‍රසිද්ධියේ හෝ රහසින් හෝ මෛත්‍රිය මුල්කරගත් කායික කර්මයක් පවතී නම්, මේ ධර්මය ද සාරණීය ධර්මයකි.\n\nතවද භික්ෂූනි, භික්ෂුවකට ශ්‍රේෂ්ඨ බ්‍රහ්මචාරීන් කෙරෙහි ප්‍රසිද්ධියේ හෝ රහසින් හෝ මෛත්‍රිය මුල්කරගත් වාචසික කර්මයක් පවතී නම්, මේ ධර්මය ද සාරණීය ධර්මයකි.\n\nතවද භික්ෂූනි, භික්ෂුවකට ශ්‍රේෂ්ඨ බ්‍රහ්මචාරීන් කෙරෙහි ප්‍රසිද්ධියේ හෝ රහසින් හෝ මෛත්‍රිය මුල්කරගත් මානසික කර්මයක් පවතී නම්, මේ ධර්මය ද සාරණීය ධර්මයකි.\n\nතවද භික්ෂූනි, ධර්මයට අනුව, ධර්මයෙන් ලබන ලද යම් ලාභ සම්පත් ඇත්නම්, අවම වශයෙන් පාත්‍රයට ලැබුණු ආහාර ප්‍රමාණයකින් වුවද, සිල්වත් ශ්‍රේෂ්ඨ බ්‍රහ්මචාරීන් සමඟ ඒවා බෙදාගෙන පරිභෝග කරන්නෙක්, සමගිව පරිභෝග කරන්නෙක් වේ නම්, මේ ධර්මය ද සාරණීය ධර්මයකි.\n\nතවද භික්ෂූනි, යම් ඒ සීලයෝ කැඩීම් බිඳීම් නැත්තාහු, හිල් නොවැටුණාහු, නොකැලැල් වූවාහු, අවුල් නොකළාහු, නිදහස් වූවාහු, නුවණැත්තන් විසින් ප්‍රශංසා කරන ලද්දාහු, නොඅල්ලා ගත්තාහු, සමාධියට උපකාරී වන්නාහු වෙත් නම්, එවැනි සීලයන්ගෙන් සමන්විතව, ශ්‍රේෂ්ඨ බ්‍රහ්මචාරීන් සමඟ ප්‍රසිද්ධියේ හෝ රහසින් හෝ සමගිව වාසය කරන්නේ නම්, මේ ධර්මය ද සාරණීය ධර්මයකි.\n\nතවද භික්ෂූනි, යම් ඒ ආර්ය වූ, නිවනට පමුණුවන, එයට ක්‍රියා කරන තැනැත්තාට මනාව දුක් ක්ෂය කිරීමට උපකාර වන දෘෂ්ටිය ඇත්නම්, එවැනි දෘෂ්ටියකින් සමන්විතව, ශ්‍රේෂ්ඨ බ්‍රහ්මචාරීන් සමඟ ප්‍රසිද්ධියේ හෝ රහසින් හෝ සමගිව වාසය කරන්නේ නම්, මේ ධර්මය ද සාරණීය ධර්මයකි.\n\nභික්ෂූනි, මේ ධර්ම සය සාරණීය ධර්මයෝ වෙත්.",
      "paliTitle": "Paṭhamasāraṇīyasuttaṃ",
      "englishTitle": "The First Discourse on Harmony",
      "sinhalaTitle": "ප‍්‍රථම සාරණීය සූත‍්‍රය"
    },
    {
      "number": 12,
      "pali": "‘‘Chayime, bhikkhave, dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattanti. Katame cha? Idha, bhikkhave, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhuno mettaṃ vacīkammaṃ paccupaṭṭhitaṃ hoti…pe… mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi sabrahmacārīhi sādhāraṇabhogī, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni tathārūpehi sīlehi sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. Ime kho, bhikkhave, cha dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattantī’’ti. Dutiyaṃ.",
      "english": "Monks, these six principles are conducive to remembrance, conducive to affection, conducive to respect, conducive to cohesion, to non-dispute, to unity, and to oneness. Which six?\n\nHere, monks, a monk maintains bodily action imbued with loving-kindness towards his fellow practitioners of the holy life, both openly and in private. This principle too is conducive to remembrance, conducive to affection, conducive to respect, conducive to cohesion, to non-dispute, to unity, and to oneness.\n\nFurthermore, monks, a monk maintains verbal action imbued with loving-kindness towards his fellow practitioners of the holy life, both openly and in private; and likewise maintains mental action imbued with loving-kindness towards his fellow practitioners of the holy life, both openly and in private. This principle too is conducive to remembrance, conducive to affection, conducive to respect, conducive to cohesion, to non-dispute, to unity, and to oneness.\n\nFurthermore, monks, a monk, concerning those gains that are righteous and obtained righteously—even as little as what is contained in the alms-bowl—does not enjoy such gains without sharing. He enjoys them in common with his virtuous fellow practitioners of the holy life. This principle too is conducive to remembrance, conducive to affection, conducive to respect, conducive to cohesion, to non-dispute, to unity, and to oneness.\n\nFurthermore, monks, a monk lives possessing such virtues—unbroken, unblemished, unspotted, uncorrupted, liberating, praised by the wise, untainted by craving, and conducive to concentration—sharing these virtues with his fellow practitioners of the holy life, both openly and in private. This principle too is conducive to remembrance, conducive to affection, conducive to respect, conducive to cohesion, to non-dispute, to unity, and to oneness.\n\nFurthermore, monks, a monk lives possessing that noble, liberating view, which guides one who practices accordingly to the right destruction of suffering, sharing this view with his fellow practitioners of the holy life, both openly and in private. This principle too is conducive to remembrance, conducive to affection, conducive to respect, conducive to cohesion, to non-dispute, to unity, and to oneness.\n\nThese, monks, are the six principles conducive to remembrance, conducive to affection, conducive to respect, conducive to cohesion, to non-dispute, to unity, and to oneness.",
      "sinhala": "භික්ෂූනි, සිහි කළ යුතු, ප්‍රිය උපදවන, ගෞරව උපදවන, සංග්‍රහයට, අවිවාදයට, සමඟියට, එකමුතුභාවයට හේතු වන ධර්ම සයක් ඇත. ඒ සය කවරේද?\n\nභික්ෂූනි, මෙහිලා භික්ෂුවකට සබ්‍රහ්මචාරීන් කෙරෙහි ප්‍රසිද්ධියේ ද රහසින් ද මෛත්‍රී සහගත කය කර්මයක් පවතී. මේ ධර්මය ද සිහි කළ යුතු, ප්‍රිය උපදවන, ගෞරව උපදවන, සංග්‍රහයට, අවිවාදයට, සමඟියට, එකමුතුභාවයට හේතු වේ.\n\nතවද, භික්ෂූනි, භික්ෂුවකට සබ්‍රහ්මචාරීන් කෙරෙහි ප්‍රසිද්ධියේ ද රහසින් ද මෛත්‍රී සහගත වචී කර්මයක් පවතී. මේ ධර්මය ද සිහි කළ යුතු, ප්‍රිය උපදවන, ගෞරව උපදවන, සංග්‍රහයට, අවිවාදයට, සමඟියට, එකමුතුභාවයට හේතු වේ. තවද, භික්ෂූනි, භික්ෂුවකට සබ්‍රහ්මචාරීන් කෙරෙහි ප්‍රසිද්ධියේ ද රහසින් ද මෛත්‍රී සහගත මනෝ කර්මයක් පවතී. මේ ධර්මය ද සිහි කළ යුතු, ප්‍රිය උපදවන, ගෞරව උපදවන, සංග්‍රහයට, අවිවාදයට, සමඟියට, එකමුතුභාවයට හේතු වේ.\n\nතවද, භික්ෂූනි, භික්ෂුව යම් ඒ ධර්මානුකූල වූ, ධර්මයෙන් ලත් ලාභයන් වේ ද, ඉතා අවම වශයෙන් පාත්‍රයට ලැබුණු සුළු ප්‍රමාණය පවා, සිල්වත් සබ්‍රහ්මචාරීන් සමඟ සමසේ පරිභෝග කරන්නෙකු වේ. මේ ධර්මය ද සිහි කළ යුතු, ප්‍රිය උපදවන, ගෞරව උපදවන, සංග්‍රහයට, අවිවාදයට, සමඟියට, එකමුතුභාවයට හේතු වේ.\n\nතවද, භික්ෂූනි, භික්ෂුව යම් ඒ ඛණ්ඩ නො වූ, ඡිද්‍ර නො වූ, ශබල නො වූ, කර්මාෂ නො වූ, නිදහස් වූ, ප්‍රඥාවන්තයන් විසින් ප්‍රශංසා කරන ලද, තෘෂ්ණාවෙන් හා දෘෂ්ටියෙන් පහස්ස නො කරන ලද, සමාධියට උපකාර වන ශීලයන් වේ ද, එබඳු ශීලයන්ගෙන් සබ්‍රහ්මචාරීන් සමඟ ප්‍රසිද්ධියේ ද රහසින් ද ශීල සමානත්වයට පැමිණ වාසය කරයි. මේ ධර්මය ද සිහි කළ යුතු, ප්‍රිය උපදවන, ගෞරව උපදවන, සංග්‍රහයට, අවිවාදයට, සමඟියට, එකමුතුභාවයට හේතු වේ.\n\nතවද, භික්ෂූනි, භික්ෂුව යම් ඒ ආර්ය වූ, නිවනට පමුණුවන සුළු වූ, ඒ අනුව ක්‍රියා කරන තැනැත්තාට මැනවින් දුක් ක්ෂය කිරීම පිණිස යොමු කරන දෘෂ්ටියක් වේ ද, එබඳු දෘෂ්ටියකින් සබ්‍රහ්මචාරීන් සමඟ ප්‍රසිද්ධියේ ද රහසින් ද දෘෂ්ටි සමානත්වයට පැමිණ වාසය කරයි. මේ ධර්මය ද සිහි කළ යුතු, ප්‍රිය උපදවන, ගෞරව උපදවන, සංග්‍රහයට, අවිවාදයට, සමඟියට, එකමුතුභාවයට හේතු වේ.\n\nභික්ෂූනි, මේ ධර්ම සය ම සිහි කළ යුතු, ප්‍රිය උපදවන, ගෞරව උපදවන, සංග්‍රහයට, අවිවාදයට, සමඟියට, එකමුතුභාවයට හේතු වේ.",
      "paliTitle": "Dutiyasāraṇīyasuttaṃ",
      "englishTitle": "Second Discourse on Conciliation",
      "sinhalaTitle": "දෙවන සාරණීය සූත්‍රය"
    },
    {
      "number": 13,
      "pali": "‘‘Chayimā, bhikkhave, nissāraṇīyā dhātuyo. Katamā cha? Idha, bhikkhave, bhikkhu evaṃ vadeyya – ‘mettā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me byāpādo cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ mettāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa byāpādo cittaṃ pariyādāya ṭhassati [ṭhassatīti (sabbattha) dī. ni. 3.326 passitabbaṃ], netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, byāpādassa yadidaṃ mettācetovimuttī’’’ti [mettācetovimutti (sabbattha)]. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘karuṇā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me vihesā cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ karuṇāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa vihesā cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, vihesāya yadidaṃ karuṇācetovimuttī’’’ti. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘muditā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me arati cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ muditāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa arati cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, aratiyā yadidaṃ muditācetovimuttī’’’ti. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘upekkhā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me rāgo cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ upekkhāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa rāgo cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, rāgassa yadidaṃ upekkhācetovimuttī’’’ti. ‘‘Idha pana, bhikkhave, bhikkhu evaṃ vadeyya – ‘animittā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā; atha ca pana me nimittānusāri viññāṇaṃ hotī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ animittāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya; atha ca panassa nimittānusāri viññāṇaṃ bhavissati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, sabbanimittānaṃ yadidaṃ animittācetovimuttī’’’ti. ‘‘Idha pana bhikkhave, bhikkhu evaṃ vadeyya – ‘asmīti kho me vigataṃ [vigate (syā.)], ayamahamasmīti ca [ayaṃ cakāro dī. ni. 3.326 natthi] na samanupassāmi; atha ca pana me vicikicchākathaṃkathāsallaṃ cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā heva’ntissa vacanīyo – ‘māyasmā, evaṃ avaca; mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso yaṃ asmīti vigate ayamahamasmīti ca na samanupassato; atha ca panassa vicikicchākathaṃkathāsallaṃ cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇañhetaṃ, āvuso, vicikicchākathaṃkathāsallassa yadidaṃ asmīti mānasamugghāto’ti. Imā kho, bhikkhave, cha nissāraṇīyā dhātuyo’’ti. Tatiyaṃ.",
      "english": "Bhikkhus, there are these six elements of release. Which six?\n\nHere, Bhikkhus, a monk might say: ‘Indeed, the mind-release of loving-kindness has been developed by me, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken; yet, ill-will still takes hold of my mind.’ He should be told: ‘Venerable sir, do not speak thus; do not misrepresent the Blessed One, for it is not good to misrepresent the Blessed One, and the Blessed One would not speak thus. Friend, it is impossible, there is no occasion for it, that when the mind-release of loving-kindness has been developed, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken, ill-will would still take hold of one’s mind. Such a situation does not exist. Indeed, friend, this is the escape from ill-will, namely the mind-release of loving-kindness.’\n\nHere again, Bhikkhus, a monk might say: ‘Indeed, the mind-release of compassion has been developed by me, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken; yet, cruelty still takes hold of my mind.’ He should be told: ‘Venerable sir, do not speak thus; do not misrepresent the Blessed One, for it is not good to misrepresent the Blessed One, and the Blessed One would not speak thus. Friend, it is impossible, there is no occasion for it, that when the mind-release of compassion has been developed, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken, cruelty would still take hold of one’s mind. Such a situation does not exist. Indeed, friend, this is the escape from cruelty, namely the mind-release of compassion.’\n\nHere again, Bhikkhus, a monk might say: ‘Indeed, the mind-release of appreciative joy has been developed by me, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken; yet, discontent still takes hold of my mind.’ He should be told: ‘Venerable sir, do not speak thus; do not misrepresent the Blessed One, for it is not good to misrepresent the Blessed One, and the Blessed One would not speak thus. Friend, it is impossible, there is no occasion for it, that when the mind-release of appreciative joy has been developed, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken, discontent would still take hold of one’s mind. Such a situation does not exist. Indeed, friend, this is the escape from discontent, namely the mind-release of appreciative joy.’\n\nHere again, Bhikkhus, a monk might say: ‘Indeed, the mind-release of equanimity has been developed by me, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken; yet, lust still takes hold of my mind.’ He should be told: ‘Venerable sir, do not speak thus; do not misrepresent the Blessed One, for it is not good to misrepresent the Blessed One, and the Blessed One would not speak thus. Friend, it is impossible, there is no occasion for it, that when the mind-release of equanimity has been developed, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken, lust would still take hold of one’s mind. Such a situation does not exist. Indeed, friend, this is the escape from lust, namely the mind-release of equanimity.’\n\nHere again, Bhikkhus, a monk might say: ‘Indeed, the signless mind-release has been developed by me, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken; yet, my consciousness still follows signs.’ He should be told: ‘Venerable sir, do not speak thus; do not misrepresent the Blessed One, for it is not good to misrepresent the Blessed One, and the Blessed One would not speak thus. Friend, it is impossible, there is no occasion for it, that when the signless mind-release has been developed, frequently practiced, made a vehicle, made a foundation, established, thoroughly familiarized, and perfectly undertaken, consciousness would still follow signs. Such a situation does not exist. Indeed, friend, this is the escape from all signs, namely the signless mind-release.’\n\nHere again, Bhikkhus, a monk might say: ‘Indeed, the conceit ‘I am’ has vanished for me, and I do not perceive ‘This I am’; yet, the dart of doubt and perplexity still takes hold of my mind.’ He should be told: ‘Venerable sir, do not speak thus; do not misrepresent the Blessed One, for it is not good to misrepresent the Blessed One, and the Blessed One would not speak thus. Friend, it is impossible, there is no occasion for it, that when the conceit ‘I am’ has vanished and one does not perceive ‘This I am,’ the dart of doubt and perplexity would still take hold of one’s mind. Such a situation does not exist. Indeed, friend, this is the escape from the dart of doubt and perplexity, namely the uprooting of the conceit ‘I am’.’\n\nThese, Bhikkhus, are the six elements of release.",
      "sinhala": "මහණෙනි, මේ නිස්සරණයට පමුණුවන ධාතු සයක් ඇත. ඒ සය කවරේද?\n\nමහණෙනි, මෙහිලා භික්ෂුවක් මෙසේ කියයි: ‘මා විසින් මෛත්‍රී චේතෝවිමුක්තිය වඩන ලද්දීය, බහුල වශයෙන් පුරුදු කරන ලද්දීය, යානයක් කොට ගන්නා ලද්දීය, පදනමක් කොට ගන්නා ලද්දීය, හොඳින් පිහිටුවන ලද්දීය, හොඳින් හුරු පුරුදු කරන ලද්දීය, මැනවින් සම්පූර්ණ කරන ලද්දීය; එහෙත් ව්‍යාපාදය මාගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතී’ කියා. ඔහුට මෙසේ කිව යුතුයි: ‘ආයුෂ්මතුනි, එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා නොකරන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා කිරීම සුදුසු නැත. භාග්‍යවතුන් වහන්සේ එසේ වදාරන්නේ නැත. ආයුෂ්මතුනි, මෛත්‍රී චේතෝවිමුක්තිය වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී, යානයක් කොට ගන්නා ලද්දී, පදනමක් කොට ගන්නා ලද්දී, හොඳින් පිහිටුවන ලද්දී, හොඳින් හුරු පුරුදු කරන ලද්දී, මැනවින් සම්පූර්ණ කරන ලද්දී වූ විට; එහෙත් ව්‍යාපාදය ඔහුගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතිනු ඇත යනු කිසිසේත් සිදුවිය නොහැක්කකි, අවස්ථාවක් නැත. එය එසේ විය නොහැක. ආයුෂ්මතුනි, ව්‍යාපාදයෙන් මිදීම වන්නේ මේ මෛත්‍රී චේතෝවිමුක්තියමයි.’\n\nමහණෙනි, මෙහිලා භික්ෂුවක් මෙසේ කියයි: ‘මා විසින් කරුණා චේතෝවිමුක්තිය වඩන ලද්දීය, බහුල වශයෙන් පුරුදු කරන ලද්දීය, යානයක් කොට ගන්නා ලද්දීය, පදනමක් කොට ගන්නා ලද්දීය, හොඳින් පිහිටුවන ලද්දීය, හොඳින් හුරු පුරුදු කරන ලද්දීය, මැනවින් සම්පූර්ණ කරන ලද්දීය; එහෙත් පීඩාව මාගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතී’ කියා. ඔහුට මෙසේ කිව යුතුයි: ‘ආයුෂ්මතුනි, එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා නොකරන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා කිරීම සුදුසු නැත. භාග්‍යවතුන් වහන්සේ එසේ වදාරන්නේ නැත. ආයුෂ්මතුනි, කරුණා චේතෝවිමුක්තිය වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී, යානයක් කොට ගන්නා ලද්දී, පදනමක් කොට ගන්නා ලද්දී, හොඳින් පිහිටුවන ලද්දී, හොඳින් හුරු පුරුදු කරන ලද්දී, මැනවින් සම්පූර්ණ කරන ලද්දී වූ විට; එහෙත් පීඩාව ඔහුගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතිනු ඇත යනු කිසිසේත් සිදුවිය නොහැක්කකි, අවස්ථාවක් නැත. එය එසේ විය නොහැක. ආයුෂ්මතුනි, පීඩාවෙන් මිදීම වන්නේ මේ කරුණා චේතෝවිමුක්තියමයි.’\n\nමහණෙනි, මෙහිලා භික්ෂුවක් මෙසේ කියයි: ‘මා විසින් මුදිතා චේතෝවිමුක්තිය වඩන ලද්දීය, බහුල වශයෙන් පුරුදු කරන ලද්දීය, යානයක් කොට ගන්නා ලද්දීය, පදනමක් කොට ගන්නා ලද්දීය, හොඳින් පිහිටුවන ලද්දීය, හොඳින් හුරු පුරුදු කරන ලද්දීය, මැනවින් සම්පූර්ණ කරන ලද්දීය; එහෙත් අරතිය මාගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතී’ කියා. ඔහුට මෙසේ කිව යුතුයි: ‘ආයුෂ්මතුනි, එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා නොකරන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා කිරීම සුදුසු නැත. භාග්‍යවතුන් වහන්සේ එසේ වදාරන්නේ නැත. ආයුෂ්මතුනි, මුදිතා චේතෝවිමුක්තිය වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී, යානයක් කොට ගන්නා ලද්දී, පදනමක් කොට ගන්නා ලද්දී, හොඳින් පිහිටුවන ලද්දී, හොඳින් හුරු පුරුදු කරන ලද්දී, මැනවින් සම්පූර්ණ කරන ලද්දී වූ විට; එහෙත් අරතිය ඔහුගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතිනු ඇත යනු කිසිසේත් සිදුවිය නොහැක්කකි, අවස්ථාවක් නැත. එය එසේ විය නොහැක. ආයුෂ්මතුනි, අරතියෙන් මිදීම වන්නේ මේ මුදිතා චේතෝවිමුක්තියමයි.’\n\nමහණෙනි, මෙහිලා භික්ෂුවක් මෙසේ කියයි: ‘මා විසින් උපේක්ඛා චේතෝවිමුක්තිය වඩන ලද්දීය, බහුල වශයෙන් පුරුදු කරන ලද්දීය, යානයක් කොට ගන්නා ලද්දීය, පදනමක් කොට ගන්නා ලද්දීය, හොඳින් පිහිටුවන ලද්දීය, හොඳින් හුරු පුරුදු කරන ලද්දීය, මැනවින් සම්පූර්ණ කරන ලද්දීය; එහෙත් රාගය මාගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතී’ කියා. ඔහුට මෙසේ කිව යුතුයි: ‘ආයුෂ්මතුනි, එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා නොකරන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා කිරීම සුදුසු නැත. භාග්‍යවතුන් වහන්සේ එසේ වදාරන්නේ නැත. ආයුෂ්මතුනි, උපේක්ඛා චේතෝවිමුක්තිය වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී, යානයක් කොට ගන්නා ලද්දී, පදනමක් කොට ගන්නා ලද්දී, හොඳින් පිහිටුවන ලද්දී, හොඳින් හුරු පුරුදු කරන ලද්දී, මැනවින් සම්පූර්ණ කරන ලද්දී වූ විට; එහෙත් රාගය ඔහුගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතිනු ඇත යනු කිසිසේත් සිදුවිය නොහැක්කකි, අවස්ථාවක් නැත. එය එසේ විය නොහැක. ආයුෂ්මතුනි, රාගයෙන් මිදීම වන්නේ මේ උපේක්ඛා චේතෝවිමුක්තියමයි.’\n\nමහණෙනි, මෙහිලා භික්ෂුවක් මෙසේ කියයි: ‘මා විසින් අනිමිත්ත චේතෝවිමුක්තිය වඩන ලද්දීය, බහුල වශයෙන් පුරුදු කරන ලද්දීය, යානයක් කොට ගන්නා ලද්දීය, පදනමක් කොට ගන්නා ලද්දීය, හොඳින් පිහිටුවන ලද්දීය, හොඳින් හුරු පුරුදු කරන ලද්දීය, මැනවින් සම්පූර්ණ කරන ලද්දීය; එහෙත් නිමිති අනුව පවතින විඤ්ඤාණය මා සතු වී ඇත’ කියා. ඔහුට මෙසේ කිව යුතුයි: ‘ආයුෂ්මතුනි, එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා නොකරන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා කිරීම සුදුසු නැත. භාග්‍යවතුන් වහන්සේ එසේ වදාරන්නේ නැත. ආයුෂ්මතුනි, අනිමිත්ත චේතෝවිමුක්තිය වඩන ලද්දී, බහුල වශයෙන් පුරුදු කරන ලද්දී, යානයක් කොට ගන්නා ලද්දී, පදනමක් කොට ගන්නා ලද්දී, හොඳින් පිහිටුවන ලද්දී, හොඳින් හුරු පුරුදු කරන ලද්දී, මැනවින් සම්පූර්ණ කරන ලද්දී වූ විට; එහෙත් නිමිති අනුව පවතින විඤ්ඤාණය ඔහුගේ සතු වනු ඇත යනු කිසිසේත් සිදුවිය නොහැක්කකි, අවස්ථාවක් නැත. එය එසේ විය නොහැක. ආයුෂ්මතුනි, සියලු නිමිතිවලින් මිදීම වන්නේ මේ අනිමිත්ත චේතෝවිමුක්තියමයි.’\n\nමහණෙනි, මෙහිලා භික්ෂුවක් මෙසේ කියයි: ‘මා ‘මම වෙමි’ යන මානය දුරු වී ඇත, ‘මේ මම වෙමි’ කියාත් මම නොදකිමි; එහෙත් විචිකිච්ඡා කථංකථා සල්‍යය මාගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතී’ කියා. ඔහුට මෙසේ කිව යුතුයි: ‘ආයුෂ්මතුනි, එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා නොකරන්න. භාග්‍යවතුන් වහන්සේට අභූත චෝදනා කිරීම සුදුසු නැත. භාග්‍යවතුන් වහන්සේ එසේ වදාරන්නේ නැත. ආයුෂ්මතුනි, ‘මම වෙමි’ යන මානය දුරු වී ඇති, ‘මේ මම වෙමි’ කියා නොදකින කල්හි; එහෙත් විචිකිච්ඡා කථංකථා සල්‍යය ඔහුගේ සිත මුළුමනින්ම ග්‍රහණය කරගෙන පවතිනු ඇත යනු කිසිසේත් සිදුවිය නොහැක්කකි, අවස්ථාවක් නැත. එය එසේ විය නොහැක. ආයුෂ්මතුනි, විචිකිච්ඡා කථංකථා සල්‍යයෙන් මිදීම වන්නේ ‘මම වෙමි’ යන මානය මුලිනුපුටා දැමීමයි.’ මහණෙනි, මේවා අර නිස්සරණයට පමුණුවන ධාතු සයයි.",
      "paliTitle": "Nissāraṇīyasuttaṃ",
      "englishTitle": "Discourse on Deliverance",
      "sinhalaTitle": "නිස්සරණ සූත්‍රය"
    },
    {
      "number": 14,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso, bhikkhavo’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Tathā tathā, āvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā [kālaṃkiriyā (ka.) a. ni. 3.110]. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā? ‘‘Idhāvuso, bhikkhu kammārāmo hoti kammarato kammārāmataṃ anuyutto, bhassārāmo hoti bhassarato bhassārāmataṃ anuyutto, niddārāmo hoti niddārato niddārāmataṃ anuyutto, saṅgaṇikārāmo hoti saṅgaṇikarato saṅgaṇikārāmataṃ anuyutto, saṃsaggārāmo hoti saṃsaggarato saṃsaggārāmataṃ anuyutto, papañcārāmo hoti papañcarato papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato na bhaddakaṃ maraṇaṃ hoti, na bhaddikā kālakiriyā. Ayaṃ vuccatāvuso – ‘bhikkhu sakkāyābhirato nappajahāsi [na pahāsi (sī. syā. kaṃ. pī.)] sakkāyaṃ sammā dukkhassa antakiriyāya’’’. ‘‘Tathā tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā? ‘‘Idhāvuso, bhikkhu na kammārāmo hoti na kammarato na kammārāmataṃ anuyutto, na bhassārāmo hoti na bhassarato na bhassārāmataṃ anuyutto, na niddārāmo hoti na niddārato niddārāmataṃ anuyutto, na saṅgaṇikārāmo hoti na saṅgaṇikarato na saṅgaṇikārāmataṃ anuyutto, na saṃsaggārāmo hoti na saṃsaggarato na saṃsaggārāmataṃ anuyutto, na papañcārāmo hoti na papañcarato na papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato bhaddakaṃ maraṇaṃ hoti, bhaddikā kālakiriyā. Ayaṃ vuccatāvuso – ‘bhikkhu nibbānābhirato pajahāsi sakkāyaṃ sammā dukkhassa antakiriyāyā’’’ti. ‘‘Yo papañcamanuyutto, papañcābhirato mago; Virādhayī so nibbānaṃ, yogakkhemaṃ anuttaraṃ. ‘‘Yo ca papañcaṃ hitvāna, nippapañcapade rato; Ārādhayī so nibbānaṃ, yogakkhemaṃ anuttara’’nti. catutthaṃ;",
      "english": "Thereupon, the venerable Sāriputta addressed the monks, saying, “Friends, monks!” “Friends!” those monks replied to the venerable Sāriputta. The venerable Sāriputta then said this:\n\n“Friends, a monk lives in such a way that as he lives, his death is not auspicious, nor is his passing auspicious.\n\nAnd how, friends, does a monk live in such a way that as he lives, his death is not auspicious, nor is his passing auspicious? Here, friends, a monk delights in work, is devoted to work, and committed to delighting in work. He delights in idle chatter, is devoted to idle chatter, and committed to delighting in idle chatter. He delights in sleep, is devoted to sleep, and committed to delighting in sleep. He delights in company, is devoted to company, and committed to delighting in company. He delights in social engagement, is devoted to social engagement, and committed to delighting in social engagement. He delights in proliferation, is devoted to proliferation, and committed to delighting in proliferation. It is in this way, friends, that a monk lives, such that as he lives, his death is not auspicious, nor is his passing auspicious. This, friends, is said of a monk: ‘He delights in self-identification and has not abandoned self-identification for the complete cessation of suffering.’\n\nFriends, a monk lives in such a way that as he lives, his death is auspicious, and his passing is auspicious.\n\nAnd how, friends, does a monk live in such a way that as he lives, his death is auspicious, and his passing is auspicious? Here, friends, a monk does not delight in work, is not devoted to work, nor committed to delighting in work. He does not delight in idle chatter, is not devoted to idle chatter, nor committed to delighting in idle chatter. He does not delight in sleep, is not devoted to sleep, nor committed to delighting in sleep. He does not delight in company, is not devoted to company, nor committed to delighting in company. He does not delight in social engagement, is not devoted to social engagement, nor committed to delighting in social engagement. He does not delight in proliferation, is not devoted to proliferation, nor committed to delighting in proliferation. It is in this way, friends, that a monk lives, such that as he lives, his death is auspicious, and his passing is auspicious. This, friends, is said of a monk: ‘He delights in Nibbāna and has abandoned self-identification for the complete cessation of suffering.’\n\nThe deluded one who is committed to proliferation, who delights in proliferation,\nHe deviates from Nibbāna, the unsurpassed security from bondage.\n\nBut whoever, having abandoned proliferation, delights in the state free from proliferation,\nHe attains Nibbāna, the unsurpassed security from bondage.",
      "sinhala": "එහිදී ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලා අමතා, “ඇවැත්නි භික්ෂූනි!” කියා වදාළ සේක. “ඇවැත්නි!” යැයි ඒ භික්ෂූහු ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: “ඇවැත්නි, යම් භික්ෂුවක් තමන්ට අභද්‍ර මරණයක් වන, අභද්‍ර කාලක්‍රියාවක් වන ආකාරයෙන් වාසය කරයි. ඇවැත්නි, භික්ෂුවක් කෙසේ නම් තමන්ට අභද්‍ර මරණයක් වන, අභද්‍ර කාලක්‍රියාවක් වන ආකාරයෙන් වාසය කරන්නේද?”\n\n“ඇවැත්නි, මෙහිලා භික්ෂුව ක්‍රියාකාරකම්වලට ඇලී වාසය කරන්නේය, ක්‍රියාකාරකම්වලට සතුටු වන්නේය, ක්‍රියාකාරකම්වලට ඇලීම අනුගමනය කරන්නේය. කථාබහට ඇලී වාසය කරන්නේය, කථාබහට සතුටු වන්නේය, කථාබහට ඇලීම අනුගමනය කරන්නේය. නිදීමට ඇලී වාසය කරන්නේය, නිදීමට සතුටු වන්නේය, නිදීමට ඇලීම අනුගමනය කරන්නේය. පිරිසක් සමඟ ගැවසීමට ඇලී වාසය කරන්නේය, පිරිසක් සමඟ ගැවසීමට සතුටු වන්නේය, පිරිසක් සමඟ ගැවසීමට ඇලීම අනුගමනය කරන්නේය. ඇසුරට ඇලී වාසය කරන්නේය, ඇසුරට සතුටු වන්නේය, ඇසුරට ඇලීම අනුගමනය කරන්නේය. ප්‍රපංචයන්ට ඇලී වාසය කරන්නේය, ප්‍රපංචයන්ට සතුටු වන්නේය, ප්‍රපංචයන්ට ඇලීම අනුගමනය කරන්නේය. ඇවැත්නි, භික්ෂුව මෙලෙස තමන්ට අභද්‍ර මරණයක් වන, අභද්‍ර කාලක්‍රියාවක් වන ආකාරයෙන් වාසය කරයි. ඇවැත්නි, මෙයට කියනු ලබන්නේ, ‘භික්ෂුව සක්කායයට ඇලී සිටින්නේය, දුක නිසි ලෙස කෙළවර කිරීම සඳහා සක්කායය අත් නොහරින්නේය’ යනුවෙනි.”\n\n“ඇවැත්නි, භික්ෂුවක් තමන්ට භද්‍ර මරණයක් වන, භද්‍ර කාලක්‍රියාවක් වන ආකාරයෙන් වාසය කරයි. ඇවැත්නි, භික්ෂුවක් කෙසේ නම් තමන්ට භද්‍ර මරණයක් වන, භද්‍ර කාලක්‍රියාවක් වන ආකාරයෙන් වාසය කරන්නේද?”\n\n“ඇවැත්නි, මෙහිලා භික්ෂුව ක්‍රියාකාරකම්වලට ඇලී වාසය නොකරන්නේය, ක්‍රියාකාරකම්වලට සතුටු නොවන්නේය, ක්‍රියාකාරකම්වලට ඇලීම අනුගමනය නොකරන්නේය. කථාබහට ඇලී වාසය නොකරන්නේය, කථාබහට සතුටු නොවන්නේය, කථාබහට ඇලීම අනුගමනය නොකරන්නේය. නිදීමට ඇලී වාසය නොකරන්නේය, නිදීමට සතුටු නොවන්නේය, නිදීමට ඇලීම අනුගමනය නොකරන්නේය. පිරිසක් සමඟ ගැවසීමට ඇලී වාසය නොකරන්නේය, පිරිසක් සමඟ ගැවසීමට සතුටු නොවන්නේය, පිරිසක් සමඟ ගැවසීමට ඇලීම අනුගමනය නොකරන්නේය. ඇසුරට ඇලී වාසය නොකරන්නේය, ඇසුරට සතුටු නොවන්නේය, ඇසුරට ඇලීම අනුගමනය නොකරන්නේය. ප්‍රපංචයන්ට ඇලී වාසය නොකරන්නේය, ප්‍රපංචයන්ට සතුටු නොවන්නේය, ප්‍රපංචයන්ට ඇලීම අනුගමනය නොකරන්නේය. ඇවැත්නි, භික්ෂුව මෙලෙස තමන්ට භද්‍ර මරණයක් වන, භද්‍ර කාලක්‍රියාවක් වන ආකාරයෙන් වාසය කරයි. ඇවැත්නි, මෙයට කියනු ලබන්නේ, ‘භික්ෂුව නිවනට ඇලී සිටින්නේය, දුක නිසි ලෙස කෙළවර කිරීම සඳහා සක්කායය අත්හරින්නේය’ යනුවෙනි.”\n\nයම් මෝඩ පුද්ගලයෙක් ප්‍රපංචයන් අනුගමනය කරන්නේද, ප්‍රපංචයන්ට ඇලී සතුටු වන්නේද; ඔහු අනුත්තර වූ යෝගක්‍ෂේමයක් වන නිවන පිරිහුවා වේ.\n\nයම් කෙනෙක් ප්‍රපංචයන් අත්හැර, ප්‍රපංච රහිත තත්වයට ඇලී සිටින්නේ නම්; ඔහු අනුත්තර වූ යෝගක්‍ෂේමයක් වන නිවන අත්පත් කරගත්තා වේ.",
      "paliTitle": "Bhaddakasuttaṃ",
      "englishTitle": "Bhaddaka Sutta",
      "sinhalaTitle": "භද‍්දක සූත්‍රය"
    },
    {
      "number": 15,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘tathā tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti? ‘‘Idhāvuso, bhikkhu kammārāmo hoti kammarato kammārāmataṃ anuyutto, bhassārāmo hoti… pe… niddārāmo hoti… saṅgaṇikārāmo hoti… saṃsaggārāmo hoti… papañcārāmo hoti papañcarato papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā anutappā hoti. Ayaṃ vuccatāvuso – ‘bhikkhu sakkāyābhirato nappajahāsi sakkāyaṃ sammā dukkhassa antakiriyāya’’’. ‘‘Tathā tathāvuso, bhikkhu vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā hoti. Kathañcāvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā hoti? ‘‘Idhāvuso, bhikkhu na kammārāmo hoti na kammarato na kammārāmataṃ anuyutto, na bhassārāmo hoti…pe… na niddārāmo hoti… na saṅgaṇikārāmo hoti… na saṃsaggārāmo hoti… na papañcārāmo hoti na papañcarato na papañcārāmataṃ anuyutto. Evaṃ kho, āvuso, bhikkhu tathā tathā vihāraṃ kappeti yathā yathāssa vihāraṃ kappayato kālakiriyā ananutappā hoti. Ayaṃ vuccatāvuso – ‘bhikkhu nibbānābhirato pajahāsi sakkāyaṃ sammā dukkhassa antakiriyāyā’’’ti. ‘‘Yo papañcamanuyutto, papañcābhirato mago; Virādhayī so nibbānaṃ, yogakkhemaṃ anuttaraṃ. ‘‘Yo ca papañcaṃ hitvāna, nippapañcapade rato; Ārādhayī so nibbānaṃ, yogakkhemaṃ anuttara’’nti. pañcamaṃ;",
      "english": "There, the Venerable Sāriputta addressed the monks: “Friends, a monk lives in such a way that when he lives in that way, death comes with regret. And how, friends, does a monk live in such a way that when he lives in that way, death comes with regret? Here, friends, a monk delights in activity, is devoted to activity, committed to delighting in activity; he delights in talk, is devoted to talk, committed to delighting in talk; he delights in sleep, is devoted to sleep, committed to delighting in sleep; he delights in company, is devoted to company, committed to delighting in company; he delights in association, is devoted to association, committed to delighting in association; he delights in mental proliferation, is devoted to mental proliferation, committed to delighting in mental proliferation. It is in this way, friends, that a monk lives in such a way that when he lives in that way, death comes with regret. This is called, friends, a monk who ‘delights in the existing body/identity and has not abandoned the existing body/identity for the complete ending of suffering.’”\n\n“Friends, a monk lives in such a way that when he lives in that way, death comes without regret. And how, friends, does a monk live in such a way that when he lives in that way, death comes without regret? Here, friends, a monk does not delight in activity, is not devoted to activity, is not committed to delighting in activity; he does not delight in talk, is not devoted to talk, is not committed to delighting in talk; he does not delight in sleep, is not devoted to sleep, is not committed to delighting in sleep; he does not delight in company, is not devoted to company, is not committed to delighting in company; he does not delight in association, is not devoted to association, is not committed to delighting in association; he does not delight in mental proliferation, is not devoted to mental proliferation, is not committed to delighting in mental proliferation. It is in this way, friends, that a monk lives in such a way that when he lives in that way, death comes without regret. This is called, friends, a monk who ‘delights in Nibbāna and has abandoned the existing body/identity for the complete ending of suffering.’”\n\nOne who is devoted to mental proliferation, a fool delighting in mental proliferation, he misses Nibbāna, the unsurpassed security from bondage.\n\nBut one who has abandoned mental proliferation, delighting in the state free from proliferation, he attains Nibbāna, the unsurpassed security from bondage.",
      "sinhala": "එහිදී ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළහ:\n\n\"ඇවැත්නි, භික්ෂුවක් තම වාසය සකස් කරගන්නේ කෙසේද යත්, එලෙස වාසය කරන ඔහුට මරණ මංචකයේදී පසුතැවීම ඇතිවේ. ඇවැත්නි, භික්ෂුවක් තම වාසය සකස් කරගන්නේ කෙසේද යත්, එලෙස වාසය කරන ඔහුට මරණ මංචකයේදී පසුතැවීම ඇතිවන්නේ කෙසේද? ඇවැත්නි, මෙහිලා භික්ෂුවක් කාර්යයන්හි ඇලී සිටියි, කාර්යයන්හි සතුටු වෙයි, කාර්යයන්හි ඇලීමෙහි නිරත වෙයි. වචන කතා කිරීමෙහි ඇලී සිටියි, වචන කතා කිරීමෙහි සතුටු වෙයි, වචන කතා කිරීමෙහි ඇලීමෙහි නිරත වෙයි. නිද්‍රාවෙහි ඇලී සිටියි, නිද්‍රාවෙහි සතුටු වෙයි, නිද්‍රාවෙහි ඇලීමෙහි නිරත වෙයි. සමූහයන් සමඟ එක්වීමෙහි ඇලී සිටියි, සමූහයන් සමඟ එක්වීමෙහි සතුටු වෙයි, සමූහයන් සමඟ එක්වීමෙහි ඇලීමෙහි නිරත වෙයි. ආශ්‍රයන්හි ඇලී සිටියි, ආශ්‍රයන්හි සතුටු වෙයි, ආශ්‍රයන්හි ඇලීමෙහි නිරත වෙයි. ප්‍රපංචයන්හි ඇලී සිටියි, ප්‍රපංචයන්හි සතුටු වෙයි, ප්‍රපංචයන්හි ඇලීමෙහි නිරත වෙයි. ඇවැත්නි, භික්ෂුවක් තම වාසය සකස් කරගන්නේ මේ අයුරිනි, එලෙස වාසය කරන ඔහුට මරණ මංචකයේදී පසුතැවීම ඇතිවෙයි. ඇවැත්නි, මෙවැන්නා මෙසේ කියනු ලැබේ: ‘දුක නිවැරදිව කෙළවර කිරීම පිණිස, භික්ෂුව ආත්ම දෘෂ්ටියෙහි ඇලී සිටින්නෙකි, ආත්ම දෘෂ්ටිය අත්නොහළ කෙනෙකි.’\"\n\n\"ඇවැත්නි, භික්ෂුවක් තම වාසය සකස් කරගන්නේ කෙසේද යත්, එලෙස වාසය කරන ඔහුට මරණ මංචකයේදී පසුතැවීමක් ඇති නොවේ. ඇවැත්නි, භික්ෂුවක් තම වාසය සකස් කරගන්නේ කෙසේද යත්, එලෙස වාසය කරන ඔහුට මරණ මංචකයේදී පසුතැවීමක් ඇති නොවන්නේ කෙසේද? ඇවැත්නි, මෙහිලා භික්ෂුවක් කාර්යයන්හි ඇලී නොසිටියි, කාර්යයන්හි සතුටු නොවෙයි, කාර්යයන්හි ඇලීමෙහි නිරත නොවෙයි. වචන කතා කිරීමෙහි ඇලී නොසිටියි, වචන කතා කිරීමෙහි සතුටු නොවෙයි, වචන කතා කිරීමෙහි ඇලීමෙහි නිරත නොවෙයි. නිද්‍රාවෙහි ඇලී නොසිටියි, නිද්‍රාවෙහි සතුටු නොවෙයි, නිද්‍රාවෙහි ඇලීමෙහි නිරත නොවෙයි. සමූහයන් සමඟ එක්වීමෙහි ඇලී නොසිටියි, සමූහයන් සමඟ එක්වීමෙහි සතුටු නොවෙයි, සමූහයන් සමඟ එක්වීමෙහි ඇලීමෙහි නිරත නොවෙයි. ආශ්‍රයන්හි ඇලී නොසිටියි, ආශ්‍රයන්හි සතුටු නොවෙයි, ආශ්‍රයන්හි ඇලීමෙහි නිරත නොවෙයි. ප්‍රපංචයන්හි ඇලී නොසිටියි, ප්‍රපංචයන්හි සතුටු නොවෙයි, ප්‍රපංචයන්හි ඇලීමෙහි නිරත නොවෙයි. ඇවැත්නි, භික්ෂුවක් තම වාසය සකස් කරගන්නේ මේ අයුරිනි, එලෙස වාසය කරන ඔහුට මරණ මංචකයේදී පසුතැවීමක් ඇති නොවේ. ඇවැත්නි, මෙවැන්නා මෙසේ කියනු ලැබේ: ‘දුක නිවැරදිව කෙළවර කිරීම පිණිස, භික්ෂුව නිවනෙහි ඇලී සිටින්නෙකි, ආත්ම දෘෂ්ටිය අත්හළ කෙනෙකි.’\"\n\nයම් පුද්ගලයෙක් ප්‍රපංචයන්හි නිරතව, ප්‍රපංචයන්හි ඇලී මුළා වූවෙක් වේද,\nඔහු අනුත්තර වූ, කෙලෙස් බන්ධනයන්ගෙන් නිදහස් වූ, නිර්වාණය මඟ හරියි.\n\nයමෙක් ප්‍රපංචයන් අත්හැර, ප්‍රපංච රහිත තත්වයේ (නිවනෙහි) ඇලී සිටින්නේද,\nඔහු අනුත්තර වූ, කෙලෙස් බන්ධනයන්ගෙන් නිදහස් වූ, නිර්වාණය අත්පත් කරගනී.",
      "paliTitle": "Anutappiyasuttaṃ",
      "englishTitle": "Discourse on the Regrettable Person",
      "sinhalaTitle": "අනුතප්පිය සූත‍්‍රය"
    },
    {
      "number": 16,
      "pali": "Ekaṃ samayaṃ bhagavā bhaggesu viharati susumāragire [suṃsumāragire (sī. pī.), saṃsumāragire (katthaci)] bhesakaḷāvane migadāye. Tena kho pana samayena nakulapitā gahapati ābādhiko hoti dukkhito bāḷhagilāno. Atha kho nakulamātā gahapatānī nakulapitaraṃ gahapatiṃ etadavoca – ‘‘Mā kho tvaṃ, gahapati, sāpekkho [sāpekho (pī. ka.)] kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī mamaccayena sakkhissati [na sakkhissati (sī. syā. kaṃ.), sakkoti (pī. ka.)] dārake posetuṃ, gharāvāsaṃ sandharitu’nti [sandharitunti (ka.), saṇṭharituṃ (syā.)]. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Kusalāhaṃ, gahapati, kappāsaṃ kantituṃ veṇiṃ olikhituṃ. Sakkomahaṃ, gahapati, tavaccayena dārake posetuṃ, gharāvāsaṃ sandharituṃ. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. ‘‘Siyā kho pana te, gahapati, evamassa – ‘nakulamātā gahapatānī mamaccayena aññaṃ gharaṃ [bhattāraṃ (syā. kaṃ.), vīraṃ (sī.)] gamissatī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Tvañceva kho, gahapati, jānāsi ahañca, yaṃ no [yadā te (sī.), yathā (syā.), yathā no (pī.)] soḷasavassāni gahaṭṭhakaṃ brahmacariyaṃ samāciṇṇaṃ [samādinnaṃ (sī.)]. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. ‘‘Siyā kho pana te, gahapati, evamassa – ‘nakulamātā gahapatānī mamaccayena na dassanakāmā bhavissati bhagavato na dassanakāmā bhikkhusaṅghassā’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Ahañhi, gahapati, tavaccayena dassanakāmatarā ceva bhavissāmi bhagavato, dassanakāmatarā ca bhikkhusaṅghassa. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. ‘‘Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī mamaccayena sīlesu [nakulamātā… na sīlesu (sī. pī.)] paripūrakārinī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā sīlesu paripūrakāriniyo, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. ‘‘Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī lābhinī [nakulamātā gahapatānī na lābhinī (pī.)] ajjhattaṃ cetosamathassā’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā lābhiniyo ajjhattaṃ cetosamathassa, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā, gahapati, sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā. ‘‘Siyā kho pana te, gahapati, evamassa – ‘na nakulamātā gahapatānī imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane viharatī’ti. Na kho panetaṃ, gahapati, evaṃ daṭṭhabbaṃ. Yāvatā kho, gahapati, tassa bhagavato sāvikā gihī odātavasanā imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane viharanti, ahaṃ tāsaṃ aññatarā. Yassa kho panassa kaṅkhā vā vimati vā – ayaṃ so bhagavā arahaṃ sammāsambuddho bhaggesu viharati susumāragire bhesakaḷāvane migadāye – taṃ bhagavantaṃ upasaṅkamitvā pucchatu. Tasmātiha tvaṃ, gahapati, mā sāpekkho kālamakāsi. Dukkhā gahapati sāpekkhassa kālakiriyā; garahitā ca bhagavatā sāpekkhassa kālakiriyā’’ti. Atha kho nakulapituno gahapatissa nakulamātarā [nakulamātāya (sī. syā.), nakulamātuyā (ka.)] gahapatāniyā iminā ovādena ovadiyamānassa so ābādho ṭhānaso paṭippassambhi. Vuṭṭhahi [vuṭṭhāti (ka.)] ca nakulapitā gahapati tamhā ābādhā; tathā pahīno ca pana nakulapituno gahapatissa so ābādho ahosi. Atha kho nakulapitā gahapati gilānā vuṭṭhito [‘‘gilānabhāvato vuṭṭhāya ṭhito, bhāvappadhāno hi ayaṃ niddeso’’ti ṭīkāsaṃvaṇṇanā] aciravuṭṭhito gelaññā daṇḍamolubbha yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho nakulapitaraṃ gahapatiṃ bhagavā etadavoca – ‘‘Lābhā te, gahapati, suladdhaṃ te, gahapati! Yassa te nakulamātā gahapatānī anukampikā atthakāmā ovādikā anusāsikā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā sīlesu paripūrakāriniyo, nakulamātā gahapatānī tāsaṃ aññatarā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā lābhiniyo ajjhattaṃ cetosamathassa, nakulamātā gahapatānī tāsaṃ aññatarā. Yāvatā kho, gahapati, mama sāvikā gihī odātavasanā imasmiṃ dhammavinaye ogādhappattā patigādhappattā assāsappattā tiṇṇavicikicchā vigatakathaṃkathā vesārajjappattā aparappaccayā satthusāsane viharanti, nakulamātā gahapatānī tāsaṃ aññatarā. Lābhā te, gahapati, suladdhaṃ te, gahapati! Yassa te nakulamātā gahapatānī anukampikā atthakāmā ovādikā anusāsikā’’ti. Chaṭṭhaṃ.",
      "english": "At one time, the Blessed One was dwelling among the Bhaggas, in the Deer Park at Bhesakaḷāvana, on Susumārāgiri. Now at that time, Nakulapitā, the householder, was afflicted, suffering, gravely ill. Then Nakulamātā, the householder's wife, said to Nakulapitā, the householder: \"Householder, do not pass away with attachment. Householder, death with attachment is suffering; and death with attachment has been condemned by the Blessed One. Perhaps, Householder, you might think: 'After my passing, Nakulamātā, the householder's wife, will not be able to raise the children or maintain the household.' But Householder, this should not be seen in that way. Householder, I am skilled in spinning cotton and carding wool. I am capable, Householder, of raising the children and maintaining the household after your passing. Therefore, Householder, do not pass away with attachment. Householder, death with attachment is suffering; and death with attachment has been condemned by the Blessed One. Perhaps, Householder, you might think: 'After my passing, Nakulamātā, the householder's wife, will take another husband.' But Householder, this should not be seen in that way. You know, Householder, and I know, that for sixteen years we have lived the holy life as householders. Therefore, Householder, do not pass away with attachment. Householder, death with attachment is suffering; and death with attachment has been condemned by the Blessed One. Perhaps, Householder, you might think: 'After my passing, Nakulamātā, the householder's wife, will not desire to see the Blessed One, nor desire to see the Saṅgha of bhikkhus.' But Householder, this should not be seen in that way. Indeed, Householder, after your passing, I will be even more desirous of seeing the Blessed One, and even more desirous of seeing the Saṅgha of bhikkhus. Therefore, Householder, do not pass away with attachment. Householder, death with attachment is suffering; and death with attachment has been condemned by the Blessed One. Perhaps, Householder, you might think: 'After my passing, Nakulamātā, the householder's wife, will not be one who perfects the precepts.' But Householder, this should not be seen in that way. Householder, among the Blessed One's female lay disciples who wear white clothes and perfect the precepts, I am one of them. If anyone has any doubt or uncertainty about this – that the Blessed One, the Arahant, the Perfectly Self-Awakened One, is dwelling among the Bhaggas, in the Deer Park at Bhesakaḷāvana, on Susumārāgiri – let him approach that Blessed One and inquire. Therefore, Householder, do not pass away with attachment. Householder, death with attachment is suffering; and death with attachment has been condemned by the Blessed One. Perhaps, Householder, you might think: 'After my passing, Nakulamātā, the householder's wife, will not be an obtainer of inner tranquility of mind.' But Householder, this should not be seen in that way. Householder, among the Blessed One's female lay disciples who wear white clothes and are obtainers of inner tranquility of mind, I am one of them. If anyone has any doubt or uncertainty about this – that the Blessed One, the Arahant, the Perfectly Self-Awakened One, is dwelling among the Bhaggas, in the Deer Park at Bhesakaḷāvana, on Susumārāgiri – let him approach that Blessed One and inquire. Therefore, Householder, do not pass away with attachment. Householder, death with attachment is suffering; and death with attachment has been condemned by the Blessed One. Perhaps, Householder, you might think: 'After my passing, Nakulamātā, the householder's wife, will not have gained a firm grounding, a deep penetration, and assurance in this Dhamma and Discipline; she will not have crossed over doubt, removed perplexity, attained fearlessness, and dwell without dependence on others in the Teacher's Dispensation.' But Householder, this should not be seen in that way. Householder, among the Blessed One's female lay disciples who wear white clothes, and who have gained a firm grounding, a deep penetration, and assurance in this Dhamma and Discipline; who have crossed over doubt, removed perplexity, attained fearlessness, and dwell without dependence on others in the Teacher's Dispensation, I am one of them. If anyone has any doubt or uncertainty about this – that the Blessed One, the Arahant, the Perfectly Self-Awakened One, is dwelling among the Bhaggas, in the Deer Park at Bhesakaḷāvana, on Susumārāgiri – let him approach that Blessed One and inquire. Therefore, Householder, do not pass away with attachment. Householder, death with attachment is suffering; and death with attachment has been condemned by the Blessed One.\"\n\nWhen he was admonished with this advice by the householder Nakulamātā, that illness immediately subsided. And householder Nakulapitā recovered from that illness; and indeed, that illness of householder Nakulapitā was abandoned in such a way. Then, householder Nakulapitā, having recovered from his illness, having recently recovered from his sickness, and leaning on a staff, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As householder Nakulapitā sat to one side, the Blessed One spoke to him thus: \"Gain is yours, householder; well-gained is yours, householder! For you have the householder Nakulamātā who is compassionate, desiring your welfare, one who advises, and one who instructs. As many, householder, as are my female lay disciples dressed in white who perfectly fulfill the precepts, the householder Nakulamātā is one of them. As many, householder, as are my female lay disciples dressed in white who have gained inner tranquility of mind, the householder Nakulamātā is one of them. As many, householder, as are my female lay disciples dressed in white who have attained profound insight, firm footing, and assurance in this Dhamma and Discipline, who have overcome uncertainty, dispelled all perplexity, attained fearlessness, and dwell relying on none other in the Teacher's Dispensation, the householder Nakulamātā is one of them. Gain is yours, householder; well-gained is yours, householder! For you have the householder Nakulamātā who is compassionate, desiring your welfare, one who advises, and one who instructs.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ භග්ග ජනපදයේ, සුංසුමාරගිරි නම් ස්ථානයේ, භේසකළා වනයෙහි, මිගදාය නම් උයනෙහි වැඩසිටින සේක. එවිට නකුලපිතා නම් ගෘහපතියා රෝගාබාධිතව, දුකින් පෙළෙමින්, අතිශයින්ම ගිලන්ව සිටියේය. එකල්හි නකුලමාතා ගෘහපතිනිය නකුලපිතා ගෘහපතියාට මෙසේ පැවසුවාය – ‘‘ගෘහපතිය, ඔබ සැපේක්ෂව (ආශා බැඳගෙන) කලුරිය නොකරන්න. ගෘහපතිය, සැපේක්ෂව කලුරිය කිරීම දුකකි; භාග්‍යවතුන් වහන්සේ විසින් ද සැපේක්ෂව කලුරිය කිරීම ගැරහීමට ලක්කරන ලද්දකි.\n\n‘‘ගෘහපතිය, ඔබට සමහරවිට මෙසේ සිතෙන්නට පුළුවන – ‘මා මළ පසුව නකුලමාතා ගෘහපතිනියට දරුවන් පෝෂණය කිරීමටත්, ගෘහ ජීවිතය පවත්වාගෙන යාමටත් නොහැකි වනු ඇතැ’යි. ගෘහපතිය, එය එසේ දැක්විය යුතු දෙයක් නොවේ. ගෘහපතිය, මම කපු කටින්නටත්, නූල් ඔතන්නටත් දක්ෂයෙක්මි. ගෘහපතිය, මා ඔබගේ මරණයෙන් පසුව දරුවන් පෝෂණය කිරීමටත්, ගෘහ ජීවිතය පවත්වාගෙන යාමටත් සමර්ථය. එහෙයින් ගෘහපතිය, ඔබ සැපේක්ෂව කලුරිය නොකරන්න. ගෘහපතිය, සැපේක්ෂව කලුරිය කිරීම දුකකි; භාග්‍යවතුන් වහන්සේ විසින් ද සැපේක්ෂව කලුරිය කිරීම ගැරහීමට ලක්කරන ලද්දකි.\n\n‘‘ගෘහපතිය, ඔබට සමහරවිට මෙසේ සිතෙන්නට පුළුවන – ‘මා මළ පසුව නකුලමාතා ගෘහපතිනිය වෙනත් ගෘහයකට යනු ඇතැ’යි. ගෘහපතිය, එය එසේ දැක්විය යුතු දෙයක් නොවේ. ගෘහපතිය, වසර දහසයක් මුළුල්ලේ අප විසින් ගෘහස්ථ බ්‍රහ්මචාරී ජීවිතයක් ගත කළ බව ඔබත් දන්නා දෙයකි, මමත් දන්නා දෙයකි. එහෙයින් ගෘහපතිය, ඔබ සැපේක්ෂව කලුරිය නොකරන්න. ගෘහපතිය, සැපේක්ෂව කලුරිය කිරීම දුකකි; භාග්‍යවතුන් වහන්සේ විසින් ද සැපේක්ෂව කලුරිය කිරීම ගැරහීමට ලක්කරන ලද්දකි.\n\n‘‘ගෘහපතිය, ඔබට සමහරවිට මෙසේ සිතෙන්නට පුළුවන – ‘මා මළ පසුව නකුලමාතා ගෘහපතිනිය භාග්‍යවතුන් වහන්සේ දැකීමට කැමැති නොවනු ඇත, භික්ෂුසංඝයා දැකීමට කැමැති නොවනු ඇතැ’යි. ගෘහපතිය, එය එසේ දැක්විය යුතු දෙයක් නොවේ. ගෘහපතිය, ඇත්ත වශයෙන්ම මා ඔබගේ මරණයෙන් පසුව භාග්‍යවතුන් වහන්සේ දැකීමට වඩාත් කැමැත්තෙන් සිටින කෙනෙක් වනු ඇත, භික්ෂුසංඝයා දැකීමට ද වඩාත් කැමැත්තෙන් සිටින කෙනෙක් වනු ඇත. එහෙයින් ගෘහපතිය, ඔබ සැපේක්ෂව කලුරිය නොකරන්න. ගෘහපතිය, සැපේක්ෂව කලුරිය කිරීම දුකකි; භාග්‍යවතුන් වහන්සේ විසින් ද සැපේක්ෂව කලුරිය කිරීම ගැරහීමට ලක්කරන ලද්දකි.\n\n‘‘ගෘහපතිය, ඔබට සමහරවිට මෙසේ සිතෙන්නට පුළුවන – ‘මා මළ පසුව නකුලමාතා ගෘහපතිනිය සිල් පිරීමෙහි සම්පූර්ණ නොවනු ඇතැ’යි. ගෘහපතිය, එය එසේ දැක්විය යුතු දෙයක් නොවේ. ගෘහපතිය, යම් පමණකට භාග්‍යවතුන් වහන්සේගේ ගිහි සුදු වස්ත්‍රධාරී ශ්‍රාවිකාවෝ සිල් පිරීමෙහි සම්පූර්ණ වෙත් ද, මම ඔවුන් අතුරින් එක් අයෙක්මි. යම් කිසිවෙකුට සැකයක් හෝ විමතියක් වේ නම් – මේ අරහත් සම්මා සම්බුද්ධ භාග්‍යවතුන් වහන්සේ භග්ග ජනපදයේ, සුංසුමාරගිරි නම් ස්ථානයේ, භේසකළා වනයෙහි, මිගදාය නම් උයනෙහි වැඩසිටින සේක – ඔහු ඒ භාග්‍යවතුන් වහන්සේ වෙත එළඹ විමසාවා. එහෙයින් ගෘහපතිය, ඔබ සැපේක්ෂව කලුරිය නොකරන්න. ගෘහපතිය, සැපේක්ෂව කලුරිය කිරීම දුකකි; භාග්‍යවතුන් වහන්සේ විසින් ද සැපේක්ෂව කලුරිය කිරීම ගැරහීමට ලක්කරන ලද්දකි.\n\n‘‘ගෘහපතිය, ඔබට සමහරවිට මෙසේ සිතෙන්නට පුළුවන – ‘මා මළ පසුව නකුලමාතා ගෘහපතිනිය අභ්‍යන්තර චිත්ත සමාධිය ලබන්නියක් නොවනු ඇතැ’යි. ගෘහපතිය, එය එසේ දැක්විය යුතු දෙයක් නොවේ. ගෘහපතිය, යම් පමණකට භාග්‍යවතුන් වහන්සේගේ ගිහි සුදු වස්ත්‍රධාරී ශ්‍රාවිකාවෝ අභ්‍යන්තර චිත්ත සමාධිය ලබත් ද, මම ඔවුන් අතුරින් එක් අයෙක්මි. යම් කිසිවෙකුට සැකයක් හෝ විමතියක් වේ නම් – මේ අරහත් සම්මා සම්බුද්ධ භාග්‍යවතුන් වහන්සේ භග්ග ජනපදයේ, සුංසුමාරගිරි නම් ස්ථානයේ, භේසකළා වනයෙහි, මිගදාය නම් උයනෙහි වැඩසිටින සේක – ඔහු ඒ භාග්‍යවතුන් වහන්සේ වෙත එළඹ විමසාවා. එහෙයින් ගෘහපතිය, ඔබ සැපේක්ෂව කලුරිය නොකරන්න. ගෘහපතිය, සැපේක්ෂව කලුරිය කිරීම දුකකි; භාග්‍යවතුන් වහන්සේ විසින් ද සැපේක්ෂව කලුරිය කිරීම ගැරහීමට ලක්කරන ලද්දකි.\n\n‘‘ගෘහපතිය, ඔබට සමහරවිට මෙසේ සිතෙන්නට පුළුවන – ‘මා මළ පසුව නකුලමාතා ගෘහපතිනිය මේ ධර්ම විනයෙහි ගැඹුරට පිවිසියා වූ ද, දැඩි ලෙස පිහිටියා වූ ද, විශ්වාසය ලැබුවා වූ ද, සැකයෙන් එතෙර වූ ද, කම්පාවෙන් තොර වූ ද, ධෛර්යය ලැබුවා වූ ද, ශාස්තෘන් වහන්සේගේ ශාසනයෙහි අන් අයගේ ඇසුර නැතිව (තමන්ගේ ශ්‍රද්ධාව මත) වාසය කරන්නියක් නොවනු ඇතැ’යි. ගෘහපතිය, එය එසේ දැක්විය යුතු දෙයක් නොවේ. ගෘහපතිය, යම් පමණකට භාග්‍යවතුන් වහන්සේගේ ගිහි සුදු වස්ත්‍රධාරී ශ්‍රාවිකාවෝ මේ ධර්ම විනයෙහි ගැඹුරට පිවිසියා වූ ද, දැඩි ලෙස පිහිටියා වූ ද, විශ්වාසය ලැබුවා වූ ද, සැකයෙන් එතෙර වූ ද, කම්පාවෙන් තොර වූ ද, ධෛර්යය ලැබුවා වූ ද, ශාස්තෘන් වහන්සේගේ ශාසනයෙහි අන් අයගේ ඇසුර නැතිව වාසය කෙරෙත් ද, මම ඔවුන් අතුරින් එක් අයෙක්මි. යම් කිසිවෙකුට සැකයක් හෝ විමතියක් වේ නම් – මේ අරහත් සම්මා සම්බුද්ධ භාග්‍යවතුන් වහන්සේ භග්ග ජනපදයේ, සුංසුමාරගිරි නම් ස්ථානයේ, භේසකළා වනයෙහි, මිගදාය නම් උයනෙහි වැඩසිටින සේක – ඔහු ඒ භාග්‍යවතුන් වහන්සේ වෙත එළඹ විමසාවා. එහෙයින් ගෘහපතිය, ඔබ සැපේක්ෂව කලුරිය නොකරන්න. ගෘහපතිය, සැපේක්ෂව කලුරිය කිරීම දුකකි; භාග්‍යවතුන් වහන්සේ විසින් ද සැපේක්ෂව කලුරිය කිරීම ගැරහීමට ලක්කරන ලද්දකි’’යි.\n\nනකුලමාතා ගෘහණිය විසින් මේ අවවාදයෙන් අවවාද කරනු ලබන විට ඒ ආබාධය ඒ මොහොතේදීම සම්පූර්ණයෙන් සන්සිඳුණේය. නකුලපිතා ගෘහපතියා ඒ ආබාධයෙන් සුවය ලැබීය. ඒ ආබාධය නකුලපිතා ගෘහපතියාට එසේම පහව ගියේය.\n\nඉක්බිති නකුලපිතා ගෘහපතියා අසනීපයෙන් සුවය ලබා, රෝගාබාධයෙන් සුව වී බොහෝ කල් නොගොස්, සැරයටියකට බර වී භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය.\n\nඑක් පසෙකින් වාඩි වී සිටි නකුලපිතා ගෘහපතියාට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: \"ගෘහපතිය, ඔබට ලාභයකි! ගෘහපතිය, ඔබට යහපත් දෙයක් ලැබී ඇත! යම් හෙයකින් නකුලමාතා ගෘහණිය ඔබට අනුකම්පා කරන්නියක්, වැඩ කැමැත්තියක්, අවවාද දෙන්නියක්, අනුශාසනා කරන්නියක් වේද (එය ඔබට ලාභයකි).\n\nගෘහපතිය, මාගේ යම් ශ්‍රාවිකාවෝ ගෘහණියෝ ධවල වස්ත්‍ර හැඳගත්තු, ශීලයන්හි සම්පූර්ණ ක්‍‍රියාකරන්නියෝ වෙත්ද, නකුලමාතා ගෘහණිය ඒ අය අතුරින් කෙනෙකි.\n\nගෘහපතිය, මාගේ යම් ශ්‍රාවිකාවෝ ගෘහණියෝ ධවල වස්ත්‍ර හැඳගත්තු, අභ්‍යන්තර චිත්ත සමාධිය ලබන්නියෝ වෙත්ද, නකුලමාතා ගෘහණිය ඒ අය අතුරින් කෙනෙකි.\n\nගෘහපතිය, මාගේ යම් ශ්‍‍රාවිකාවෝ ගෘහණියෝ ධවල වස්ත්‍ර හැඳගත්තු, මේ ධර්ම විනයෙහි ගැඹුරට පිවිසියා වූ, ස්ථිර පදනමක් ලැබුවා වූ, සැනසීම ලැබුවා වූ, සැකයෙන් එතෙර වූ, විචිකිච්ඡාව දුරු කළා වූ, නිර්භීතභාවයට පත්වූ, ශාස්තෘන් වහන්සේගේ ශාසනයෙහි අනුන් කෙරෙන් නොපැවැති (අපරප්‍රත්‍ය) ව වාසය කෙරෙත්ද, නකුලමාතා ගෘහණිය ඒ අය අතුරින් කෙනෙකි.\n\nගෘහපතිය, ඔබට ලාභයකි! ගෘහපතිය, ඔබට යහපත් දෙයක් ලැබී ඇත! යම් හෙයකින් නකුලමාතා ගෘහණිය ඔබට අනුකම්පා කරන්නියක්, වැඩ කැමැත්තියක්, අවවාද දෙන්නියක්, අනුශාසනා කරන්නියක් වේද.\"",
      "paliTitle": "Nakulapitusuttaṃ",
      "englishTitle": "The Nakulapita Sutta",
      "sinhalaTitle": "නකුලපිතා සූත්‍රය"
    },
    {
      "number": 17,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Āyasmāpi kho sāriputto sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Āyasmāpi kho mahāmoggallāno…pe… āyasmāpi kho mahākassapo… āyasmāpi kho mahākaccāyano… āyasmāpi kho mahākoṭṭhiko [mahākoṭṭhito (sī. pī.)] … āyasmāpi kho mahācundo… āyasmāpi kho mahākappino… āyasmāpi kho anuruddho… āyasmāpi kho revato… āyasmāpi kho ānando sāyanhasamayaṃ paṭisallānā vuṭṭhito yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Atha kho bhagavā bahudeva rattiṃ nisajjāya vītināmetvā uṭṭhāyāsanā vihāraṃ pāvisi. Tepi kho āyasmanto acirapakkantassa bhagavato uṭṭhāyāsanā yathāvihāraṃ agamaṃsu. Ye pana tattha bhikkhū navā acirapabbajitā adhunāgatā imaṃ dhammavinayaṃ te yāva sūriyuggamanā kākacchamānā supiṃsu. Addasā kho bhagavā dibbena cakkhunā visuddhena atikkantamānusakena te bhikkhū yāva sūriyuggamanā kākacchamāne supante. Disvā yenupaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘Kahaṃ nu kho, bhikkhave, sāriputto? Kahaṃ mahāmoggallāno? Kahaṃ mahākassapo? Kahaṃ mahākaccāyano? Kahaṃ mahākoṭṭhiko? Kahaṃ mahācundo? Kahaṃ mahākappino? Kahaṃ anuruddho? Kahaṃ revato? Kahaṃ ānando? Kahaṃ nu kho te, bhikkhave, therā sāvakā gatā’’ti? ‘‘Tepi kho, bhante, āyasmanto acirapakkantassa bhagavato uṭṭhāyāsanā yathāvihāraṃ agamaṃsū’’ti. ‘‘Kena no [kena no (ka.), ke nu (katthaci)] tumhe, bhikkhave, therā bhikkhū nāgatāti [bhikkhū navā (sī. syā. kaṃ. pī.), bhikkhū gatāti (?)] yāva sūriyuggamanā kākacchamānā supatha? Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘rājā khattiyo muddhābhisitto [muddhābhisitto (ka.)] yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ rajjaṃ kārento janapadassa vā piyo manāpo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘rājā khattiyo muddhābhisitto yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ rajjaṃ kārento janapadassa vā piyo manāpo’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘raṭṭhiko…pe… pettaṇiko… senāpatiko… gāmagāmaṇiko [gāmagāmiko (sī. pī.)] … pūgagāmaṇiko yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ pūgagāmaṇikattaṃ kārento pūgassa vā piyo manāpo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘pūgagāmaṇiko yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharanto yāvajīvaṃ pūgagāmaṇikattaṃ vā kārento pūgassa vā piyo manāpo’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘samaṇo vā brāhmaṇo vā yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto indriyesu aguttadvāro bhojane amattaññū jāgariyaṃ ananuyutto avipassako kusalānaṃ dhammānaṃ pubbarattāpararattaṃ bodhipakkhiyānaṃ [bodhapakkhiyānaṃ (sī.), bodhapakkhikānaṃ (pī.)] dhammānaṃ bhāvanānuyogaṃ ananuyutto āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘samaṇo vā brāhmaṇo vā yāvadatthaṃ seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto indriyesu aguttadvāro bhojane amattaññū jāgariyaṃ ananuyutto avipassako kusalānaṃ dhammānaṃ pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogaṃ ananuyutto āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanto’’’ti. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘indriyesu guttadvārā bhavissāma, bhojane mattaññuno, jāgariyaṃ anuyuttā, vipassakā kusalānaṃ dhammānaṃ, pubbarattāpararattaṃ bodhipakkhiyānaṃ dhammānaṃ, bhāvanānuyogamanuyuttā viharissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Sattamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Sāvatthī, at Jeta's Grove, in Anāthapiṇḍika's monastery. Then, in the evening, having risen from seclusion, the Blessed One approached the service hall. Having approached, he sat down on the seat prepared for him.\n\nAnd the Venerable Sāriputta, in the evening, having risen from seclusion, approached the service hall. Having approached, he paid homage to the Blessed One and sat down to one side. And the Venerable Mahāmoggallāna, the Venerable Mahākassapa, the Venerable Mahākaccāyana, the Venerable Mahākoṭṭhika, the Venerable Mahācunda, the Venerable Mahākappina, the Venerable Anuruddha, the Venerable Revata, and the Venerable Ānanda, in the evening, having risen from seclusion, approached the service hall. Having approached, they paid homage to the Blessed One and sat down to one side.\n\nThen the Blessed One, having spent much of the night sitting, rose from his seat and entered his dwelling. And those venerable ones, soon after the Blessed One had departed, rose from their seats and went to their respective dwellings. But those monks who were new, recently ordained, having recently arrived in this Dhamma and Vinaya, slept, snoring until sunrise.\n\nThe Blessed One saw, with his purified divine eye, surpassing that of humans, those monks sleeping and snoring until sunrise. Having seen this, he approached the service hall. Having approached, he sat down on the seat prepared for him. Having sat down, the Blessed One addressed the monks: “Where, monks, is Sāriputta? Where is Mahāmoggallāna? Where is Mahākassapa? Where is Mahākaccāyana? Where is Mahākoṭṭhika? Where is Mahācunda? Where is Mahākappina? Where is Anuruddha? Where is Revata? Where is Ānanda? Where, monks, have those elder disciples gone?”\n\n“Venerable sir, those venerable ones, soon after the Blessed One had departed, rose from their seats and went to their respective dwellings.”\n\n“How is it, monks, that you, the new monks, slept snoring until sunrise? What do you think, monks? Have you ever seen or heard of a king, a kṣatriya, consecrated by anointing the head, who, indulging fully in the pleasure of sleeping, the pleasure of lying down, the pleasure of drowsiness, and ruling his kingdom throughout his life, is dear and pleasing to his people?”\n\n“No, Venerable sir.”\n\n“Good, monks! Indeed, I too, monks, have neither seen nor heard of a king, a kṣatriya, consecrated by anointing the head, who, indulging fully in the pleasure of sleeping, the pleasure of lying down, the pleasure of drowsiness, and ruling his kingdom throughout his life, is dear and pleasing to his people.”\n\n“What do you think, monks, have you ever seen or heard of a district chief, a commander, a village headman, or a guild leader who, indulging fully in the pleasure of sleeping, the pleasure of lying down, the pleasure of drowsiness, and carrying out his role throughout his life, is dear and pleasing to his community?”\n\n“No, Venerable sir.”\n\n“Good, monks! Indeed, I too, monks, have neither seen nor heard of a guild leader who, indulging fully in the pleasure of sleeping, the pleasure of lying down, the pleasure of drowsiness, and carrying out his role as a guild leader throughout his life, is dear and pleasing to his guild.”\n\n“What do you think, monks, have you ever seen or heard of a recluse or a brahmin who, indulging fully in the pleasure of sleeping, the pleasure of lying down, the pleasure of drowsiness, with unguarded sense doors, without moderation in eating, not devoted to wakefulness, not cultivating insight into wholesome states, not devoted to the development of the factors of awakening during the first and last watches of the night, can realize, with direct knowledge, in this very life, the liberation of mind and liberation by wisdom that is free from defilements, and abide therein?”\n\n“No, Venerable sir.”\n\n“Good, monks! Indeed, I too, monks, have neither seen nor heard of a recluse or a brahmin who, indulging fully in the pleasure of sleeping, the pleasure of lying down, the pleasure of drowsiness, with unguarded sense doors, without moderation in eating, not devoted to wakefulness, not cultivating insight into wholesome states, not devoted to the development of the factors of awakening during the first and last watches of the night, can realize, with direct knowledge, in this very life, the liberation of mind and liberation by wisdom that is free from defilements, and abide therein.”\n\n“Therefore, monks, this is how you should train yourselves: ‘We will live with guarded sense doors, with moderation in eating, devoted to wakefulness, cultivating insight into wholesome states, and during the first and last watches of the night, we will live devoted to the development of the factors of awakening.’”\n\nThus, monks, you should train yourselves.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනාථපිණ්ඩික සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි ප්‍රතිසල්ලීන භාවයෙන් නැඟී සිට, උපස්ථාන ශාලාව වෙත එළඹි සේක; එළඹ, පනවන ලද ආසනයක වැඩහුන් සේක. ආයුෂ්මත් ශ්‍රී සාරිපුත්ත ස්ථවිරයන් වහන්සේ ද සවස් කාලයෙහි ප්‍රතිසල්ලීන භාවයෙන් නැඟී සිට, උපස්ථාන ශාලාව වෙත එළඹි සේක; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක වැඩහුන් සේක. ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් මහාකච්චායන ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් මහාකොට්ඨිත ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් මහාකප්පින ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් රේවත ස්ථවිරයන් වහන්සේ ද, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ද සවස් කාලයෙහි ප්‍රතිසල්ලීන භාවයෙන් නැඟී සිට, උපස්ථාන ශාලාව වෙත එළඹි සේක; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක වැඩහුන් සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ රැයෙහි වැඩි වේලාවක් වැඩසිට, අසුනෙන් නැඟී, විහාරයට වැඩි සේක. ඒ ආයුෂ්මත්හු ද භාග්‍යවතුන් වහන්සේ වඩිනා ලද නොබෝ වේලාවකින් අසුනෙන් නැඟී, තමන් තමන්ගේ විහාරයන් වෙත ගියහ. එහෙත්, එහි සිටි අලුතින් පැවිදි වූ, මේ ධර්ම විනයට අලුතින් පැමිණි යම් භික්ෂූහු වෙත් ද, ඔවුහු හිරු උදාවන තුරු ගොරවමින් නිදාගත්හ. භාග්‍යවතුන් වහන්සේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින්, ඒ භික්ෂූන් හිරු උදාවන තුරු ගොරවමින් නිදාගෙන සිටිනු දුටු සේක. දැක, උපස්ථාන ශාලාව වෙත එළඹි සේක; එළඹ, පනවන ලද ආසනයක වැඩහුන් සේක. වැඩහිඳ, භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක – ‘‘මහණෙනි, සාරිපුත්ත කොහි ද? මහාමොග්ගල්ලාන කොහි ද? මහාකාශ්‍යප කොහි ද? මහාකච්චායන කොහි ද? මහාකොට්ඨිත කොහි ද? මහාචුන්ද කොහි ද? මහාකප්පින කොහි ද? අනුරුද්ධ කොහි ද? රේවත කොහි ද? ආනන්ද කොහි ද? මහණෙනි, ඒ ථේර ශ්‍රාවකයෝ කොහි ගියාහු ද?’’යි. ‘‘භාග්‍යවතුන් වහන්සේ වඩිනා ලද නොබෝ වේලාවකින්, ඒ ආයුෂ්මත්හු ද අසුනෙන් නැඟී, තමන් තමන්ගේ විහාරයන් වෙත වැඩියහ, ස්වාමීනී’’ යි. ‘‘කිනම් හේතුවක් නිසා ද, මහණෙනි, තරුණ භික්ෂූන් වන ඔබලා හිරු උදාවන තුරු ගොරවමින් නිදාගත්තේ? මහණෙනි, ඔබලා මේ කුමක් සිතන්නහු ද? ඔබලා විසින් දැක තිබේ ද, නැතහොත් අසා තිබේ ද, ‘මුදුනෙහි අභිෂේක කරන ලද ක්ෂත්‍රීය රජෙක් යම් පමණකින් සැපසේ නිදන්නට, සැපසේ ඇලී ඉන්නට, තද නින්දට පත්වන්නට පුරුදු වී වසන්නේ, ජීවිතාන්තය දක්වා රාජ්‍යය පාලනය කරන්නේ, රට වැසියන්ට ප්‍රිය වන්නේ, මනාප වන්නේ ය’ කියා?’’ ‘‘එසේ නොවේ, ස්වාමීනී’’. ‘‘සාදු, මහණෙනි! මහණෙනි, මා විසින් ද එය දැක නොතිබේ, අසා ද නොතිබේ – ‘මුදුනෙහි අභිෂේක කරන ලද ක්ෂත්‍රීය රජෙක් යම් පමණකින් සැපසේ නිදන්නට, සැපසේ ඇලී ඉන්නට, තද නින්දට පත්වන්නට පුරුදු වී වසන්නේ, ජීවිතාන්තය දක්වා රාජ්‍යය පාලනය කරන්නේ, රට වැසියන්ට ප්‍රිය වන්නේ, මනාප වන්නේ ය’ කියා’’. ‘‘මහණෙනි, ඔබලා මේ කුමක් සිතන්නහු ද? ඔබලා විසින් දැක තිබේ ද, නැතහොත් අසා තිබේ ද, ‘දේශාධිපතියෙක් හෝ, නුවර ප්‍රධානියෙක් හෝ, සේනාපතියෙක් හෝ, ගම් ප්‍රධානියෙක් හෝ, ගණ ප්‍රධානියෙක් (සංවිධානයක නායකයෙක්) හෝ යම් පමණකින් සැපසේ නිදන්නට, සැපසේ ඇලී ඉන්නට, තද නින්දට පත්වන්නට පුරුදු වී වසන්නේ, ජීවිතාන්තය දක්වා එම ගණ ප්‍රධාන තත්ත්වය දරන්නේ, එම පිරිසට ප්‍රිය වන්නේ, මනාප වන්නේ ය’ කියා?’’ ‘‘එසේ නොවේ, ස්වාමීනී’’. ‘‘සාදු, මහණෙනි! මහණෙනි, මා විසින් ද එය දැක නොතිබේ, අසා ද නොතිබේ – ‘ගණ ප්‍රධානියෙක් යම් පමණකින් සැපසේ නිදන්නට, සැපසේ ඇලී ඉන්නට, තද නින්දට පත්වන්නට පුරුදු වී වසන්නේ, ජීවිතාන්තය දක්වා එම ගණ ප්‍රධාන තත්ත්වය දරන්නේ, එම පිරිසට ප්‍රිය වන්නේ, මනාප වන්නේ ය’ කියා’’. ‘‘මහණෙනි, ඔබලා මේ කුමක් සිතන්නහු ද? ඔබලා විසින් දැක තිබේ ද, නැතහොත් අසා තිබේ ද, ‘පැවිද්දෙක් හෝ බ්‍රාහ්මණයෙක් හෝ යම් පමණකින් සැපසේ නිදන්නට, සැපසේ ඇලී ඉන්නට, තද නින්දට පත්වන්නට පුරුදු වී වසන්නේ, ඉන්ද්‍රියයන්හි නොරක්නා ලද දොරටු ඇත්තේ, භෝජනයෙහි පමණ නොදන්නේ, රාත්‍රියෙහි පිබිදීමෙහි නොයෙදෙන්නේ, කුසල ධර්මයන්හි විදර්ශනා රහිත වූයේ, රාත්‍රියේ මුල් යාමයේ හා අග යාමයේ බෝධිපාක්ෂික ධර්මයන් භාවනා කිරීමෙහි නොයෙදෙන්නේ, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයෙහිම තමා විසින් අභිඥා ඥානයෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරන්නේ ය’ කියා?’’ ‘‘එසේ නොවේ, ස්වාමීනී’’. ‘‘සාදු, මහණෙනි! මහණෙනි, මා විසින් ද එය දැක නොතිබේ, අසා ද නොතිබේ – ‘පැවිද්දෙක් හෝ බ්‍රාහ්මණයෙක් හෝ යම් පමණකින් සැපසේ නිදන්නට, සැපසේ ඇලී ඉන්නට, තද නින්දට පත්වන්නට පුරුදු වී වසන්නේ, ඉන්ද්‍රියයන්හි නොරක්නා ලද දොරටු ඇත්තේ, භෝජනයෙහි පමණ නොදන්නේ, රාත්‍රියෙහි පිබිදීමෙහි නොයෙදෙන්නේ, කුසල ධර්මයන්හි විදර්ශනා රහිත වූයේ, රාත්‍රියේ මුල් යාමයේ හා අග යාමයේ බෝධිපාක්ෂික ධර්මයන් භාවනා කිරීමෙහි නොයෙදෙන්නේ, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයෙහිම තමා විසින් අභිඥා ඥානයෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරන්නේ ය’ කියා’’. ‘‘එබැවින්, මහණෙනි, ඔබලා මෙසේ හික්මිය යුතු ය – ‘අපි ඉන්ද්‍රියයන්හි ආරක්‍ෂා කරන ලද දොරටු ඇත්තෝ වන්නෙමු, භෝජනයෙහි පමණ දන්නෝ වන්නෙමු, රාත්‍රියෙහි පිබිදීමෙහි යෙදෙන්නෝ වන්නෙමු, කුසල ධර්මයන්හි විදර්ශනා ඇත්තෝ වන්නෙමු, රාත්‍රියේ මුල් යාමයේ හා අග යාමයේ බෝධිපාක්ෂික ධර්මයන් භාවනා කිරීමෙහි යෙදෙමින් වසන්නෙමු’ කියා’’.\n\nඑසේ හෙයින්, භික්ෂූණි, ඔබලා මෙලෙස පුහුණු විය යුතුය.",
      "paliTitle": "Soppasuttaṃ",
      "englishTitle": "Discourse on Sleep",
      "sinhalaTitle": "නින්ද සූත්‍රය"
    },
    {
      "number": 18,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ carati mahatā bhikkhusaṅghena saddhiṃ. Addasā kho bhagavā addhānamaggappaṭipanno aññatarasmiṃ padese macchikaṃ macchabandhaṃ macche vadhitvā vadhitvā vikkiṇamānaṃ. Disvā maggā okkamma aññatarasmiṃ rukkhamūle paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, amuṃ macchikaṃ macchabandhaṃ macche vadhitvā vadhitvā vikkiṇamāna’’nti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘macchiko macchabandho macche vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘macchiko macchabandho macche vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, macche vajjhe vadhāyupanīte [vadhāyānīte (syā. kaṃ.), vadhāya nīte (ka.)] pāpakena manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘goghātako gāvo vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘goghātako gāvo vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, gāvo vajjhe vadhāyupanīte pāpakena manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati’’. ‘‘Taṃ kiṃ maññatha, bhikkhave, api nu tumhehi diṭṭhaṃ vā sutaṃ vā – ‘orabbhiko…pe… sūkariko [sokariko (syā.)] …pe… sākuṇiko…pe… māgaviko mage [mige (syā. kaṃ.)] vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Sādhu, bhikkhave! Mayāpi kho etaṃ, bhikkhave, neva diṭṭhaṃ na sutaṃ – ‘māgaviko mage vadhitvā vadhitvā vikkiṇamāno tena kammena tena ājīvena hatthiyāyī vā assayāyī vā rathayāyī vā yānayāyī vā bhogabhogī vā mahantaṃ vā bhogakkhandhaṃ ajjhāvasanto’ti. Taṃ kissa hetu? Te hi so, bhikkhave, mage vajjhe vadhāyupanīte pāpakena manasānupekkhati, tasmā so neva hatthiyāyī hoti na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasati. Te hi (nāma) [( ) bahūsu natthi] so, bhikkhave, tiracchānagate pāṇe vajjhe vadhāyupanīte pāpakena manasānupekkhamāno [manasānupekkhati, tasmā so (syā. ka.)] neva hatthiyāyī bhavissati [hoti (syā. ka.)] na assayāyī na rathayāyī na yānayāyī na bhogabhogī, na mahantaṃ bhogakkhandhaṃ ajjhāvasissati [ajjhāvasati (syā. ka.)]. Ko pana vādo yaṃ manussabhūtaṃ vajjhaṃ vadhāyupanītaṃ pāpakena manasānupekkhati! Tañhi tassa [taṃ hissa (pī. ka.)], bhikkhave, hoti dīgharattaṃ ahitāya dukkhāya. Kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjatī’’ti. Aṭṭhamaṃ.",
      "english": "One time, the Blessed One was wandering in the Kosala country with a large community of monastics. As the Blessed One was journeying on the road, He saw in a certain place a fisherman, a fish-catcher, repeatedly killing fish and selling them. Having seen this, He left the road and sat down on a seat prepared at the root of a certain tree. Having sat down, the Blessed One addressed the monastics: \"Monastics, do you see that fisherman, that fish-catcher, repeatedly killing fish and selling them?\" \"Yes, Venerable Sir.\"\n\n\"What do you think, monastics? Have you ever seen or heard of a fisherman, a fish-catcher, who, by that action and livelihood of repeatedly killing and selling fish, becomes one who rides on elephants, or rides on horses, or rides in chariots, or rides in vehicles, or enjoys great wealth, or dwells possessing a great mass of riches?\" \"No, Venerable Sir.\" \"Good, monastics! I too, monastics, have neither seen nor heard of a fisherman, a fish-catcher, who, by that action and livelihood of repeatedly killing and selling fish, becomes one who rides on elephants, or rides on horses, or rides in chariots, or rides in vehicles, or enjoys great wealth, or dwells possessing a great mass of riches.\" What is the reason for that? Because, monastics, he looks upon those fish, destined for slaughter and brought for slaughter, with an evil mind. Therefore, he does not become one who rides on elephants, nor rides on horses, nor rides in chariots, nor rides in vehicles, nor enjoys great wealth, nor dwells possessing a great mass of riches.\n\n\"What do you think, monastics? Have you ever seen or heard of a cattle butcher who, by that action and livelihood of repeatedly killing and selling cattle, becomes one who rides on elephants, or rides on horses, or rides in chariots, or rides in vehicles, or enjoys great wealth, or dwells possessing a great mass of riches?\" \"No, Venerable Sir.\" \"Good, monastics! I too, monastics, have neither seen nor heard of a cattle butcher who, by that action and livelihood of repeatedly killing and selling cattle, becomes one who rides on elephants, or rides on horses, or rides in chariots, or rides in vehicles, or enjoys great wealth, or dwells possessing a great mass of riches.\" What is the reason for that? Because, monastics, he looks upon those cattle, destined for slaughter and brought for slaughter, with an evil mind. Therefore, he does not become one who rides on elephants, nor rides on horses, nor rides in chariots, nor rides in vehicles, nor enjoys great wealth, nor dwells possessing a great mass of riches.\n\n\"What do you think, monastics? Have you ever seen or heard of a sheep butcher, or a pig butcher, or a fowler, or a hunter who, by that action and livelihood of repeatedly killing and selling deer, becomes one who rides on elephants, or rides on horses, or rides in chariots, or rides in vehicles, or enjoys great wealth, or dwells possessing a great mass of riches?\" \"No, Venerable Sir.\" \"Good, monastics! I too, monastics, have neither seen nor heard of a hunter who, by that action and livelihood of repeatedly killing and selling deer, becomes one who rides on elephants, or rides on horses, or rides in chariots, or rides in vehicles, or enjoys great wealth, or dwells possessing a great mass of riches.\" What is the reason for that? Because, monastics, he looks upon those deer, destined for slaughter and brought for slaughter, with an evil mind. Therefore, he does not become one who rides on elephants, nor rides on horses, nor rides in chariots, nor rides in vehicles, nor enjoys great wealth, nor dwells possessing a great mass of riches. Indeed, monastics, one who looks upon these animals, destined for slaughter and brought for slaughter, with an evil mind, will not become one who rides on elephants, nor rides on horses, nor rides in chariots, nor rides in vehicles, nor enjoys great wealth, nor dwells possessing a great mass of riches. How much more so, then, if one looks upon a human being, destined for slaughter and brought for slaughter, with an evil mind! That, monastics, will certainly lead to harm and suffering for a long time. With the breaking up of the body, after death, he is reborn in the lower realms, in a miserable destination, in a state of ruin, in hell.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ මහා භික්ෂූ සංඝයා වහන්සේලා සමඟ කෝසල දේශයේ චාරිකා කරමින් වැඩසිටියහ. මාර්ගයේ ගමන් කරමින් සිටි භාග්‍යවතුන් වහන්සේ එක්තරා ප්‍රදේශයක මසුන් මරා මරා විකුණමින් සිටින ධීවරයෙක් දුටු සේක. (එය) දැක මඟින් ඉවත්ව එක්තරා රුක් මුලක පනවන ලද අසුනක වැඩහුන් සේක. වැඩහිඳ භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා, ‘‘මහණෙනි, මසුන් මරා මරා විකුණමින් සිටින මේ ධීවරයා නුඹලා දකිනවාදැයි’’ වදාළ සේක.\n\n‘‘එසේය, භාග්‍යවතුන් වහන්ස.’’\n\n‘‘මහණෙනි, මේ ගැන කුමක් සිතන්නහුද? මසුන් මරා මරා විකුණන ධීවරයෙක් ඒ කර්මයෙන්, ඒ ජීවිකාවෙන් ඇතා පිට යන අයෙක් හෝ අශ්වයා පිට යන අයෙක් හෝ රථයෙන් යන අයෙක් හෝ යානයෙන් යන අයෙක් හෝ භෝග සම්පත් භුක්ති විඳින අයෙක් හෝ විශාල භෝග සම්පත් සමූහයකට අධිපති වූ අයෙක් ලෙස නුඹලා විසින් දැක තිබේද හෝ අසා තිබේද?’’\n\n‘‘නැත, භාග්‍යවතුන් වහන්ස.’’\n\n‘‘සාධු, මහණෙනි! මහණෙනි, ධීවරයා මසුන් මරා මරා විකුණමින් ඒ කර්මයෙන්, ඒ ජීවිකාවෙන් ඇතා පිට යන අයෙක් හෝ අශ්වයා පිට යන අයෙක් හෝ රථයෙන් යන අයෙක් හෝ යානයෙන් යන අයෙක් හෝ භෝග සම්පත් භුක්ති විඳින අයෙක් හෝ විශාල භෝග සම්පත් සමූහයකට අධිපති වූ අයෙක් වන බව මා විසින්ද දැක නැත, අසා නැත. ඊට හේතුව කුමක්ද? මහණෙනි, මරණයට පත් කිරීමට එළවා ගෙන එන ලද ඒ මසුන් ඔහු පාපී සිතින් බලයි. එබැවින් ඔහු ඇතා පිට යන අයෙක් හෝ නොවේ, අශ්වයා පිට යන අයෙක් හෝ නොවේ, රථයෙන් යන අයෙක් හෝ නොවේ, යානයෙන් යන අයෙක් හෝ නොවේ, භෝග සම්පත් භුක්ති විඳින්නෙක් හෝ නොවේ, විශාල භෝග සම්පත් සමූහයකට අධිපති වන්නේද නොවේ.\n\n‘‘මහණෙනි, මේ ගැන කුමක් සිතන්නහුද? ගව ඝාතකයෙක් ගවයන් මරා මරා විකුණමින් ඒ කර්මයෙන්, ඒ ජීවිකාවෙන් ඇතා පිට යන අයෙක් හෝ අශ්වයා පිට යන අයෙක් හෝ රථයෙන් යන අයෙක් හෝ යානයෙන් යන අයෙක් හෝ භෝග සම්පත් භුක්ති විඳින අයෙක් හෝ විශාල භෝග සම්පත් සමූහයකට අධිපති වූ අයෙක් ලෙස නුඹලා විසින් දැක තිබේද හෝ අසා තිබේද?’’\n\n‘‘නැත, භාග්‍යවතුන් වහන්ස.’’\n\n‘‘සාධු, මහණෙනි! මහණෙනි, ගව ඝාතකයෙක් ගවයන් මරා මරා විකුණමින් ඒ කර්මයෙන්, ඒ ජීවිකාවෙන් ඇතා පිට යන අයෙක් හෝ අශ්වයා පිට යන අයෙක් හෝ රථයෙන් යන අයෙක් හෝ යානයෙන් යන අයෙක් හෝ භෝග සම්පත් භුක්ති විඳින අයෙක් හෝ විශාල භෝග සම්පත් සමූහයකට අධිපති වූ අයෙක් වන බව මා විසින්ද දැක නැත, අසා නැත. ඊට හේතුව කුමක්ද? මහණෙනි, මරණයට පත් කිරීමට එළවා ගෙන එන ලද ඒ ගවයන් ඔහු පාපී සිතින් බලයි. එබැවින් ඔහු ඇතා පිට යන අයෙක් හෝ නොවේ, අශ්වයා පිට යන අයෙක් හෝ නොවේ, රථයෙන් යන අයෙක් හෝ නොවේ, යානයෙන් යන අයෙක් හෝ නොවේ, භෝග සම්පත් භුක්ති විඳින්නෙක් හෝ නොවේ, විශාල භෝග සම්පත් සමූහයකට අධිපති වන්නේද නොවේ.’’\n\n‘‘මහණෙනි, මේ ගැන කුමක් සිතන්නහුද? බැටළුවන් මරා විකුණන බැටළු ඝාතකයෙක් හෝ ඌරන් මරා විකුණන ඌරු ඝාතකයෙක් හෝ කුරුල්ලන් මරා විකුණන කුරුළු දඩයම්කරුවෙක් හෝ මුවන් මරා විකුණන මුව දඩයම්කරුවෙක් ඒ කර්මයෙන්, ඒ ජීවිකාවෙන් ඇතා පිට යන අයෙක් හෝ අශ්වයා පිට යන අයෙක් හෝ රථයෙන් යන අයෙක් හෝ යානයෙන් යන අයෙක් හෝ භෝග සම්පත් භුක්ති විඳින අයෙක් හෝ විශාල භෝග සම්පත් සමූහයකට අධිපති වූ අයෙක් ලෙස නුඹලා විසින් දැක තිබේද හෝ අසා තිබේද?’’\n\n‘‘නැත, භාග්‍යවතුන් වහන්ස.’’\n\n‘‘සාධු, මහණෙනි! මහණෙනි, බැටළුවන් මරා විකුණන බැටළු ඝාතකයෙක් හෝ ඌරන් මරා විකුණන ඌරු ඝාතකයෙක් හෝ කුරුල්ලන් මරා විකුණන කුරුළු දඩයම්කරුවෙක් හෝ මුවන් මරා විකුණන මුව දඩයම්කරුවෙක් ඒ කර්මයෙන්, ඒ ජීවිකාවෙන් ඇතා පිට යන අයෙක් හෝ අශ්වයා පිට යන අයෙක් හෝ රථයෙන් යන අයෙක් හෝ යානයෙන් යන අයෙක් හෝ භෝග සම්පත් භුක්ති විඳින අයෙක් හෝ විශාල භෝග සම්පත් සමූහයකට අධිපති වූ අයෙක් වන බව මා විසින්ද දැක නැත, අසා නැත. ඊට හේතුව කුමක්ද? මහණෙනි, මරණයට පත් කිරීමට එළවා ගෙන එන ලද ඒ මුවන් ඔහු පාපී සිතින් බලයි. එබැවින් ඔහු ඇතා පිට යන අයෙක් හෝ නොවේ, අශ්වයා පිට යන අයෙක් හෝ නොවේ, රථයෙන් යන අයෙක් හෝ නොවේ, යානයෙන් යන අයෙක් හෝ නොවේ, භෝග සම්පත් භුක්ති විඳින්නෙක් හෝ නොවේ, විශාල භෝග සම්පත් සමූහයකට අධිපති වන්නේද නොවේ. මහණෙනි, මරණයට පත් කිරීමට එළවා ගෙන එන ලද තිරිසන් සතුන් ඔහු පාපී සිතින් බලන කල්හි ඔහු ඇතා පිට යන අයෙක් හෝ නොවනු ඇත, අශ්වයා පිට යන අයෙක් හෝ නොවනු ඇත, රථයෙන් යන අයෙක් හෝ නොවනු ඇත, යානයෙන් යන අයෙක් හෝ නොවනු ඇත, භෝග සම්පත් භුක්ති විඳින්නෙක් හෝ නොවනු ඇත, විශාල භෝග සම්පත් සමූහයකට අධිපති වන්නේද නොවනු ඇත. මරණයට සුදුසු වූ, මරණයට පත් කිරීමට එළවා ගෙන එන ලද මනුෂ්‍යයෙක් පාපී සිතින් බලන කල්හි, කවර කථාවක්ද (ඔහුට සිදුවන විපාක ගැන)! මහණෙනි, එය ඔහුට දීර්ඝ කාලයක් අහිත පිණිස, දුක් පිණිස වන්නේය. ශරීරය බිඳී මරණයෙන් පසු ඔහු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට උපදින්නේය.’’",
      "paliTitle": "Macchabandhasuttaṃ",
      "englishTitle": "The Fisherman",
      "sinhalaTitle": "මාළු උගුල සූත්‍රය"
    },
    {
      "number": 19,
      "pali": "Ekaṃ samayaṃ bhagavā nātike [nādike (sī. syā. kaṃ. pī.) a. ni. 8.73] viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā. Bhāvetha no tumhe, bhikkhave, maraṇassati’’nti? Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘ahaṃ kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ rattindivaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ divasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ cattāro pañca ālope saṅkhāditvā [saṅkharitvā (ka.)] ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekaṃ ālopaṃ saṅkhāditvā [saṃharitvā (ka.)] ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Aññataropi kho bhikkhu bhagavantaṃ etadavoca – ‘‘ahampi kho, bhante, bhāvemi maraṇassati’’nti. ‘‘Yathā kathaṃ pana tvaṃ, bhikkhu, bhāvesi maraṇassati’’nti? ‘‘Idha mayhaṃ, bhante, evaṃ hoti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ assasitvā vā passasāmi passasitvā vā assasāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Evaṃ kho ahaṃ, bhante, bhāvemi maraṇassati’’nti. Evaṃ vutte bhagavā te bhikkhū etadavoca – ‘‘yo cāyaṃ [yvāyaṃ (pī. ka.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ rattindivaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti. ‘‘Yo cāyaṃ [yopāyaṃ (ka.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ divasaṃ jīveyyaṃ, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti. ‘‘Yo cāyaṃ, bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekapiṇḍapātaṃ bhuñjāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti. ‘‘Yo cāyaṃ, bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ cattāro pañca ālope saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Ime vuccanti, bhikkhave, bhikkhū pamattā viharanti dandhaṃ maraṇassatiṃ bhāventi āsavānaṃ khayāya. ‘‘Yo ca khvāyaṃ [yopāyaṃ (ka.)], bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ ekaṃ ālopaṃ saṅkhāditvā ajjhoharāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’’’ti. ‘‘Yo cāyaṃ, bhikkhave, bhikkhu evaṃ maraṇassatiṃ bhāveti – ‘aho vatāhaṃ tadantaraṃ jīveyyaṃ yadantaraṃ assasitvā vā passasāmi passasitvā vā assasāmi, bhagavato sāsanaṃ manasi kareyyaṃ, bahu vata me kataṃ assā’ti. Ime vuccanti, bhikkhave, bhikkhū appamattā viharanti tikkhaṃ maraṇassatiṃ bhāventi āsavānaṃ khayāya. ‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘appamattā viharissāma, tikkhaṃ maraṇassatiṃ bhāvessāma āsavānaṃ khayāyā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Navamaṃ.",
      "english": "At one time, the Blessed One was staying at Nadika, in the Brick House. There, the Blessed One addressed the monastics, saying, \"Monastics!\" \"Venerable sir,\" those monastics replied to the Blessed One. The Blessed One spoke this: \"Mindfulness of death, monastics, when developed and frequently practiced, has great fruit and great benefit, leads to the Deathless, and culminates in the Deathless. Do you, monastics, develop mindfulness of death?\" When this was said, a certain monastic said to the Blessed One, \"Indeed, venerable sir, I develop mindfulness of death.\" \"But how, monastic, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: 'Oh, if only I might live for a day and a night, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me.' Thus, venerable sir, I develop mindfulness of death.\" Another monastic also said to the Blessed One, \"Indeed, venerable sir, I too develop mindfulness of death.\" \"But how, monastic, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: 'Oh, if only I might live for a day, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me.' Thus, venerable sir, I develop mindfulness of death.\" Another monastic also said to the Blessed One, \"Indeed, venerable sir, I too develop mindfulness of death.\" \"But how, monastic, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: 'Oh, if only I might live for the interval it takes me to consume one alms-meal, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me.' Thus, venerable sir, I develop mindfulness of death.\" Another monastic also said to the Blessed One, \"Indeed, venerable sir, I too develop mindfulness of death.\" \"But how, monastic, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: 'Oh, if only I might live for the interval it takes me to chew and swallow four or five mouthfuls, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me.' Thus, venerable sir, I develop mindfulness of death.\" Another monastic also said to the Blessed One, \"Indeed, venerable sir, I too develop mindfulness of death.\" \"But how, monastic, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: 'Oh, if only I might live for the interval it takes me to chew and swallow one mouthful, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me.' Thus, venerable sir, I develop mindfulness of death.\" Another monastic also said to the Blessed One, \"Indeed, venerable sir, I too develop mindfulness of death.\" \"But how, monastic, do you develop mindfulness of death?\" \"Here, venerable sir, it occurs to me thus: 'Oh, if only I might live for the interval it takes to breathe in and breathe out, or breathe out and breathe in, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me.' Thus, venerable sir, I develop mindfulness of death.\"\n\nWhen this was said, the Blessed One said to those monastics: \"Monastics, this monastic who develops mindfulness of death thus: 'Oh, if only I might live for a day and a night, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me' — and this monastic who develops mindfulness of death thus: 'Oh, if only I might live for a day, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me' — and this monastic who develops mindfulness of death thus: 'Oh, if only I might live for the interval it takes me to consume one alms-meal, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me' — and this monastic who develops mindfulness of death thus: 'Oh, if only I might live for the interval it takes me to chew and swallow four or five mouthfuls, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me' — these monastics, monastics, are said to be living heedlessly, developing mindfulness of death slowly for the destruction of the effluents. But this monastic, monastics, who develops mindfulness of death thus: 'Oh, if only I might live for the interval it takes me to chew and swallow one mouthful, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me' — and this monastic, monastics, who develops mindfulness of death thus: 'Oh, if only I might live for the interval it takes to breathe in and breathe out, or breathe out and breathe in, I would heed the teaching of the Blessed One. Much indeed would have been accomplished by me' —\"\n\nThese, monks, are called monks who dwell heedfully, cultivating keen mindfulness of death for the destruction of the taints. Therefore, monks, you should train yourselves thus: 'We will dwell heedfully; we will cultivate keen mindfulness of death for the destruction of the taints.' Thus indeed, monks, you should train yourselves.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ නාදිකයේ ගිඤ්ජකාආවාසයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි” කියා. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, මරණානුස්සතිය වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි මහාඵල ඇත්තේය, මහානිසංස ඇත්තේය, අමෘතයෙහි ගිලී ඇත්තේය, අමෘතය අවසන් කොට ඇත්තේය. මහණෙනි, නුඹලා මරණානුස්සතිය වඩන්නාහු නොවේදැ”යි (පැවසූ සේක).\n\nමෙසේ වදාළ කල්හි එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, මම නම් මරණානුස්සතිය වඩමි” කියා. “මහණ, එසේනම් නුඹ කෙසේ නම් මරණානුස්සතිය වඩන්නෙහිද?” “වහන්ස, මේ ශාසනයෙහි මට මෙසේ සිතේ: ‘අහෝ, මම රෑ දවල් දෙකම ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ කියා. වහන්ස, මම නම් මෙසේ මරණානුස්සතිය වඩමි” කියා.\n\nතවත් එක්තරා භික්ෂුවක්ද භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, මමද මරණානුස්සතිය වඩමි” කියා. “මහණ, එසේනම් නුඹ කෙසේ නම් මරණානුස්සතිය වඩන්නෙහිද?” “වහන්ස, මේ ශාසනයෙහි මට මෙසේ සිතේ: ‘අහෝ, මම දවසක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ කියා. වහන්ස, මම නම් මෙසේ මරණානුස්සතිය වඩමි” කියා.\n\nතවත් එක්තරා භික්ෂුවක්ද භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, මමද මරණානුස්සතිය වඩමි” කියා. “මහණ, එසේනම් නුඹ කෙසේ නම් මරණානුස්සතිය වඩන්නෙහිද?” “වහන්ස, මේ ශාසනයෙහි මට මෙසේ සිතේ: ‘අහෝ, මම එක් පිණ්ඩපාතයක් වළඳන තරම් කාලයක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ කියා. වහන්ස, මම නම් මෙසේ මරණානුස්සතිය වඩමි” කියා.\n\nතවත් එක්තරා භික්ෂුවක්ද භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, මමද මරණානුස්සතිය වඩමි” කියා. “මහණ, එසේනම් නුඹ කෙසේ නම් මරණානුස්සතිය වඩන්නෙහිද?” “වහන්ස, මේ ශාසනයෙහි මට මෙසේ සිතේ: ‘අහෝ, මම බත් කටවල් හතරක් හෝ පහක් කටෙහි දමා දිරවා ගිලින තරම් කාලයක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ කියා. වහන්ස, මම නම් මෙසේ මරණානුස්සතිය වඩමි” කියා.\n\nතවත් එක්තරා භික්ෂුවක්ද භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, මමද මරණානුස්සතිය වඩමි” කියා. “මහණ, එසේනම් නුඹ කෙසේ නම් මරණානුස්සතිය වඩන්නෙහිද?” “වහන්ස, මේ ශාසනයෙහි මට මෙසේ සිතේ: ‘අහෝ, මම බත් කටක් කටෙහි දමා දිරවා ගිලින තරම් කාලයක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ කියා. වහන්ස, මම නම් මෙසේ මරණානුස්සතිය වඩමි” කියා.\n\nතවත් එක්තරා භික්ෂුවක්ද භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, මමද මරණානුස්සතිය වඩමි” කියා. “මහණ, එසේනම් නුඹ කෙසේ නම් මරණානුස්සතිය වඩන්නෙහිද?” “වහන්ස, මේ ශාසනයෙහි මට මෙසේ සිතේ: ‘අහෝ, මම හුස්ම ගෙන පිටකරන හෝ පිටකර නැවත ගන්නා තරම් කාලයක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ කියා. වහන්ස, මම නම් මෙසේ මරණානුස්සතිය වඩමි” කියා.\n\nමෙසේ වදාළ කල්හි භාග්‍යවතුන් වහන්සේ ඒ භික්ෂූන්ට මෙසේ වදාළ සේක: “මහණෙනි, යම් භික්ෂුවක් ‘අහෝ, මම රෑ දවල් දෙකම ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ යනුවෙන් මරණානුස්සතිය වඩන්නේද. මහණෙනි, යම් භික්ෂුවක් ‘අහෝ, මම දවසක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ යනුවෙන් මරණානුස්සතිය වඩන්නේද. මහණෙනි, යම් භික්ෂුවක් ‘අහෝ, මම එක් පිණ්ඩපාතයක් වළඳන තරම් කාලයක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ යනුවෙන් මරණානුස්සතිය වඩන්නේද. මහණෙනි, යම් භික්ෂුවක් ‘අහෝ, මම බත් කටවල් හතරක් හෝ පහක් කටෙහි දමා දිරවා ගිලින තරම් කාලයක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ යනුවෙන් මරණානුස්සතිය වඩන්නේද. මහණෙනි, මේ භික්ෂූහු ආශ්‍රවයන්ගේ ක්ෂය වීම පිණිස ප්‍රමාදව වාසය කරන්නාහු යැයි, මන්දගාමීව මරණානුස්සතිය වඩන්නාහු යැයි කියනු ලැබේ.\n\nමහණෙනි, යම් භික්ෂුවක් ‘අහෝ, මම බත් කටක් කටෙහි දමා දිරවා ගිලින තරම් කාලයක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ යනුවෙන් මරණානුස්සතිය වඩන්නේද. මහණෙනි, යම් භික්ෂුවක් ‘අහෝ, මම හුස්ම ගෙන පිටකරන හෝ පිටකර නැවත ගන්නා තරම් කාලයක් ජීවත් වන්නට ලැබුණොත්, භාග්‍යවතුන් වහන්සේගේ ශාසනය මනසෙහි තබාගනිමි, සැබවින්ම බොහෝ දේ මා විසින් සිදු කරනු ලැබෙන්නේය’ යනුවෙන් මරණානුස්සතිය වඩන්නේද.\n\nභික්ෂූණි, ආශ්‍රවයන්ගේ ක්ෂය පිණිස අප්‍රමාදීව වාසය කරමින්, තියුණු මරණානුස්සතිය වඩන භික්ෂූහු යැයි කියනු ලබන්නේ මොවුහු යි. එබැවින්, භික්ෂූණි, මෙසේ හික්මිය යුතු යි: ‘අප ආශ්‍රවයන්ගේ ක්ෂය පිණිස අප්‍රමාදීව වාසය කරන්නෙමු; තියුණු මරණානුස්සතිය වඩන්නෙමු’ කියා යි. භික්ෂූණි, සැබවින් ම මෙලෙසින් ම නුඹලා විසින් හික්මිය යුතු යි.",
      "paliTitle": "Paṭhamamaraṇassatisuttaṃ",
      "englishTitle": "First Discourse on the Recollection of Death",
      "sinhalaTitle": "පළමු මරණානුස‍්සති සූත‍්‍රය"
    },
    {
      "number": 20,
      "pali": "Ekaṃ samayaṃ bhagavā nātike viharati giñjakāvasathe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘maraṇassati, bhikkhave, bhāvitā bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā. Kathaṃ bhāvitā ca, bhikkhave, maraṇassati kathaṃ bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā? ‘‘Idha, bhikkhave, bhikkhu divase nikkhante rattiyā patihitāya [paṭigatāya (ka.) a. ni. 8.74] iti paṭisañcikkhati – ‘bahukā kho me paccayā maraṇassa – ahi vā maṃ ḍaṃseyya, vicchiko vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya; tena me assa kālakiriyā, so mamassa antarāyo. Upakkhalitvā vā papateyyaṃ, bhattaṃ vā me bhuttaṃ byāpajjeyya, pittaṃ vā me kuppeyya, semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ; tena me assa kālakiriyā, so mamassa antarāyo’ti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘atthi nu kho me pāpakā akusalā dhammā appahīnā, ye me assu rattiṃ kālaṃ karontassa antarāyāyā’’’ti. ‘‘Sace, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthi me pāpakā akusalā dhammā appahīnā, ye me assu rattiṃ kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘natthi me pāpakā akusalā dhammā appahīnā, ye me assu rattiṃ kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu. ‘‘Idha pana, bhikkhave, bhikkhu rattiyā nikkhantāya divase patihite iti paṭisañcikkhati – ‘bahukā kho me paccayā maraṇassa – ahi vā maṃ ḍaṃseyya, vicchiko vā maṃ ḍaṃseyya, satapadī vā maṃ ḍaṃseyya; tena me assa kālakiriyā so mamassa antarāyo. Upakkhalitvā vā papateyyaṃ, bhattaṃ vā me bhuttaṃ byāpajjeyya, pittaṃ vā me kuppeyya, semhaṃ vā me kuppeyya, satthakā vā me vātā kuppeyyuṃ; tena me assa kālakiriyā so mamassa antarāyo’ti. Tena, bhikkhave, bhikkhunā iti paṭisañcikkhitabbaṃ – ‘atthi nu kho me pāpakā akusalā dhammā appahīnā, ye me assu divā kālaṃ karontassa antarāyāyā’’’ti. ‘‘Sace, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘atthi me pāpakā akusalā dhammā appahīnā, ye me assu divā kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘natthi me pāpakā akusalā dhammā appahīnā, ye me assu divā kālaṃ karontassa antarāyāyā’ti, tena, bhikkhave, bhikkhunā teneva pītipāmojjena vihātabbaṃ ahorattānusikkhinā kusalesu dhammesu. Evaṃ bhāvitā kho, bhikkhave, maraṇassati evaṃ bahulīkatā mahapphalā hoti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Dasamaṃ. ",
      "english": "At one time, the Blessed One was staying in Nātika, in the Brick House. There, the Blessed One addressed the bhikkhus: “Monks, when mindfulness of death is developed and frequently practiced, it is of great fruit and great benefit, culminating in the Deathless, ending in the Deathless. And how, monks, is mindfulness of death developed and frequently practiced so that it is of great fruit and great benefit, culminating in the Deathless, ending in the Deathless?”\n\n“Here, monks, a bhikkhu, when the day has passed and the night has arrived, reflects thus: ‘Many indeed are the causes of my death – a snake might bite me, a scorpion might sting me, a centipede might bite me; thereby I might die, and that would be an obstacle for me. I might stumble and fall, the food I have eaten might disagree with me, my bile might be agitated, my phlegm might be agitated, my cutting winds might be agitated; thereby I might die, and that would be an obstacle for me.’ That bhikkhu, monks, should then reflect thus: ‘Are there any evil, unwholesome qualities within me that have not been abandoned, which would be an obstacle for me if I were to die tonight?’”\n\n“If, monks, while reviewing, the bhikkhu thus knows: ‘There are indeed evil, unwholesome qualities within me that have not been abandoned, which would be an obstacle for me if I were to die tonight,’ then, monks, that bhikkhu should apply extraordinary zeal, effort, exertion, indefatigability, mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome qualities. Just as, monks, if one’s robe were on fire or one’s head were on fire, one would apply extraordinary zeal, effort, exertion, indefatigability, mindfulness, and clear comprehension for extinguishing that very robe or head; in the same way, monks, that bhikkhu should apply extraordinary zeal, effort, exertion, indefatigability, mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome qualities.”\n\n“But if, monks, while reviewing, the bhikkhu thus knows: ‘There are no evil, unwholesome qualities within me that have not been abandoned, which would be an obstacle for me if I were to die tonight,’ then, monks, that bhikkhu should dwell in joy and gladness, continuously training in wholesome qualities day and night.”\n\n“Here again, monks, a bhikkhu, when the night has passed and the day has arrived, reflects thus: ‘Many indeed are the causes of my death – a snake might bite me, a scorpion might sting me, a centipede might bite me; thereby I might die, and that would be an obstacle for me. I might stumble and fall, the food I have eaten might disagree with me, my bile might be agitated, my phlegm might be agitated, my cutting winds might be agitated; thereby I might die, and that would be an obstacle for me.’ That bhikkhu, monks, should then reflect thus: ‘Are there any evil, unwholesome qualities within me that have not been abandoned, which would be an obstacle for me if I were to die during the day?’”\n\n“If, monks, while reviewing, the bhikkhu thus knows: ‘There are indeed evil, unwholesome qualities within me that have not been abandoned, which would be an obstacle for me if I were to die during the day,’ then, monks, that bhikkhu should apply extraordinary zeal, effort, exertion, indefatigability, mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome qualities. Just as, monks, if one’s robe were on fire or one’s head were on fire, one would apply extraordinary zeal, effort, exertion, indefatigability, mindfulness, and clear comprehension for extinguishing that very robe or head; in the same way, monks, that bhikkhu should apply extraordinary zeal, effort, exertion, indefatigability, mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome qualities.”\n\n“But if, monks, while reviewing, the bhikkhu thus knows: ‘There are no evil, unwholesome qualities within me that have not been abandoned, which would be an obstacle for me if I were to die during the day,’ then, monks, that bhikkhu should dwell in joy and gladness, continuously training in wholesome qualities day and night.”\n\n“It is in this way, monks, that mindfulness of death, when developed and frequently practiced, is of great fruit and great benefit, culminating in the Deathless, ending in the Deathless.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ නාතික ගම් ප්‍රදේශයේ ගිඤ්ජකා වසථ නම් ගෘහයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: ‘‘මහණෙනි, මරණානුස්සතිය වැඩුවිට, බහුල වශයෙන් පුරුදු කළවිට මහාඵලදායක, මහානිසංස ඇති, අමා නිවනට පිවිසීමට හේතුවන, අමා නිවනින් අවසන් වන ධර්මයකි. මහණෙනි, කෙසේ වැඩුවිටද, කෙසේ බහුල වශයෙන් පුරුදු කළවිටද මරණානුස්සතිය මහාඵලදායක, මහානිසංස ඇති, අමා නිවනට පිවිසීමට හේතුවන, අමා නිවනින් අවසන් වන ධර්මයක් වන්නේ?’’\n\n‘‘මහණෙනි, මෙහිලා භික්ෂුව දවස ගෙවී රාත්‍රිය එළඹුණු කල්හි මෙසේ සිහි කරයි: ‘මට මරණයට හේතුවන කරුණු බොහෝය – සර්පයෙක් මා දෂ්ඨ කළ හැකිය, වෘශ්චිකයෙක් මා දෂ්ඨ කළ හැකිය, සතපාදියෙක් (පත්තෑවෙක්) මා දෂ්ඨ කළ හැකිය; ඒ හේතුවෙන් මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායක් විය හැකිය. නැතහොත් මට ලිස්සා වැටී මරණය සිදුවිය හැකිය, මා විසින් වළඳන ලද ආහාරය විෂ විය හැකිය, මගේ පිත් රෝගය කුපිත විය හැකිය, සෙම් රෝගය කුපිත විය හැකිය, ශරීරයේ පිහිටි වාත රෝග කුපිත විය හැකිය; ඒ හේතුවෙන් මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායක් විය හැකිය’යි. මහණෙනි, එවිට ඒ භික්ෂුව විසින් මෙසේ සිහි කටයුතුය: ‘රාත්‍රියේදී මරණයට පත්වන්නේ නම්, මට අන්තරායක් විය හැකි, ප්‍රහීණ නොකරන ලද පව්කාර අකුසල ධර්ම තිබේදැ’යි.’’\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුව පිරික්සමින් මෙසේ දැන ගන්නේ නම්: ‘රාත්‍රියේදී මරණයට පත්වන්නේ නම්, මට අන්තරායක් විය හැකි, ප්‍රහීණ නොකරන ලද පව්කාර අකුසල ධර්ම තිබේදැ’යි, මහණෙනි, එවිට ඒ භික්ෂුව විසින් එම පව්කාර අකුසල ධර්ම ප්‍රහීණ කිරීම පිණිස අධික කැමැත්තද, වීර්යයද, උත්සාහයද, නොපසුබට උත්සාහයද, සිහියද, සම්පජඤ්ඤයද ඇතිකරගත යුතුය. මහණෙනි, යම්සේ ගිනිගත් වස්ත්‍ර ඇත්තෙක් හෝ ගිනිගත් හිස ඇත්තෙක් හෝ තම වස්ත්‍රයේ හෝ හිසෙහි ගින්න නිවීමට අධික කැමැත්තද, වීර්යයද, උත්සාහයද, නොපසුබට උත්සාහයද, සිහියද, සම්පජඤ්ඤයද ඇතිකරගන්නේද, මහණෙනි, එපරිද්දෙන්ම ඒ භික්ෂුව විසින් එම පව්කාර අකුසල ධර්ම ප්‍රහීණ කිරීම පිණිස අධික කැමැත්තද, වීර්යයද, උත්සාහයද, නොපසුබට උත්සාහයද, සිහියද, සම්පජඤ්ඤයද ඇතිකරගත යුතුය.’’\n\n‘‘නමුත් මහණෙනි, යම් හෙයකින් භික්ෂුව පිරික්සමින් මෙසේ දැන ගන්නේ නම්: ‘රාත්‍රියේදී මරණයට පත්වන්නේ නම්, මට අන්තරායක් විය හැකි, ප්‍රහීණ නොකරන ලද පව්කාර අකුසල ධර්ම නැතැ’යි, මහණෙනි, එවිට ඒ භික්ෂුව විසින් එම ප්‍රීති ප්‍රමෝදයෙන්ම දිවා රෑ නොනැවතී කුසල ධර්මයන්හි පුහුණු වෙමින් වාසය කළ යුතුය.’’\n\n‘‘මහණෙනි, මෙහිලා භික්ෂුව රාත්‍රිය ගෙවී දවස එළඹුණු කල්හි මෙසේ සිහි කරයි: ‘මට මරණයට හේතුවන කරුණු බොහෝය – සර්පයෙක් මා දෂ්ඨ කළ හැකිය, වෘශ්චිකයෙක් මා දෂ්ඨ කළ හැකිය, සතපාදියෙක් (පත්තෑවෙක්) මා දෂ්ඨ කළ හැකිය; ඒ හේතුවෙන් මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායක් විය හැකිය. නැතහොත් මට ලිස්සා වැටී මරණය සිදුවිය හැකිය, මා විසින් වළඳන ලද ආහාරය විෂ විය හැකිය, මගේ පිත් රෝගය කුපිත විය හැකිය, සෙම් රෝගය කුපිත විය හැකිය, ශරීරයේ පිහිටි වාත රෝග කුපිත විය හැකිය; ඒ හේතුවෙන් මගේ මරණය සිදුවිය හැකිය, එය මට අන්තරායක් විය හැකිය’යි. මහණෙනි, එවිට ඒ භික්ෂුව විසින් මෙසේ සිහි කටයුතුය: ‘දිවා කාලයේදී මරණයට පත්වන්නේ නම්, මට අන්තරායක් විය හැකි, ප්‍රහීණ නොකරන ලද පව්කාර අකුසල ධර්ම තිබේදැ’යි.’’\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුව පිරික්සමින් මෙසේ දැන ගන්නේ නම්: ‘දිවා කාලයේදී මරණයට පත්වන්නේ නම්, මට අන්තරායක් විය හැකි, ප්‍රහීණ නොකරන ලද පව්කාර අකුසල ධර්ම තිබේදැ’යි, මහණෙනි, එවිට ඒ භික්ෂුව විසින් එම පව්කාර අකුසල ධර්ම ප්‍රහීණ කිරීම පිණිස අධික කැමැත්තද, වීර්යයද, උත්සාහයද, නොපසුබට උත්සාහයද, සිහියද, සම්පජඤ්ඤයද ඇතිකරගත යුතුය. මහණෙනි, යම්සේ ගිනිගත් වස්ත්‍ර ඇත්තෙක් හෝ ගිනිගත් හිස ඇත්තෙක් හෝ තම වස්ත්‍රයේ හෝ හිසෙහි ගින්න නිවීමට අධික කැමැත්තද, වීර්යයද, උත්සාහයද, නොපසුබට උත්සාහයද, සිහියද, සම්පජඤ්ඤයද ඇතිකරගන්නේද, මහණෙනි, එපරිද්දෙන්ම ඒ භික්ෂුව විසින් එම පව්කාර අකුසල ධර්ම ප්‍රහීණ කිරීම පිණිස අධික කැමැත්තද, වීර්යයද, උත්සාහයද, නොපසුබට උත්සාහයද, සිහියද, සම්පජඤ්ඤයද ඇතිකරගත යුතුය.’’\n\n‘‘නමුත් මහණෙනි, යම් හෙයකින් භික්ෂුව පිරික්සමින් මෙසේ දැන ගන්නේ නම්: ‘දිවා කාලයේදී මරණයට පත්වන්නේ නම්, මට අන්තරායක් විය හැකි, ප්‍රහීණ නොකරන ලද පව්කාර අකුසල ධර්ම නැතැ’යි, මහණෙනි, එවිට ඒ භික්ෂුව විසින් එම ප්‍රීති ප්‍රමෝදයෙන්ම දිවා රෑ නොනැවතී කුසල ධර්මයන්හි පුහුණු වෙමින් වාසය කළ යුතුය. මහණෙනි, මෙසේ වඩන ලද, මෙසේ බහුල වශයෙන් පුරුදු කරන ලද මරණානුස්සතිය මහාඵලදායක, මහානිසංස ඇති, අමා නිවනට පිවිසීමට හේතුවන, අමා නිවනින් අවසන් වන ධර්මයක් වන්නේය’යි.’’",
      "paliTitle": "Dutiyamaraṇassatisuttaṃ",
      "englishTitle": "The Second Discourse on Mindfulness of Death",
      "sinhalaTitle": "දෙවන මරණානුස‍්සති සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Sāraṇīyavaggo dutiyo. Tassuddānaṃ – Dve sāraṇī nisāraṇīyaṃ, bhaddakaṃ anutappiyaṃ; Nakulaṃ soppamacchā ca, dve honti maraṇassatīti.",
    "english": "The Second Chapter on Conciliation",
    "sinhala": "දෙවන සාරණීය වර්ගය"
  }
}