{
  "id": "an6.6",
  "title": {
    "pali": "Mahāvaggo",
    "english": "The Great Chapter",
    "sinhala": "මහාවග්ගය"
  },
  "sections": [
    {
      "number": 55,
      "pali": "[mahāva. 243 āgataṃ] Evaṃ, me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena āyasmā soṇo rājagahe viharati sītavanasmiṃ. Atha kho āyasmato soṇassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘ye kho keci bhagavato sāvakā āraddhavīriyā viharanti, ahaṃ tesaṃ aññataro. Atha ca pana me na anupādāya āsavehi cittaṃ vimuccati, saṃvijjanti kho pana me kule bhogā, sakkā bhogā ca bhuñjituṃ puññāni ca kātuṃ. Yaṃnūnāhaṃ sikkhaṃ paccakkhāya hīnāyāvattitvā bhoge ca bhuñjeyyaṃ puññāni ca kareyya’’nti. Atha kho bhagavā āyasmato soṇassa cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso sammiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ sammiñjeyya, evamevaṃ kho – gijjhakūṭe pabbate antarahito sītavane āyasmato soṇassa sammukhe pāturahosi. Nisīdi bhagavā paññatte āsane. Āyasmāpi kho soṇo bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ soṇaṃ bhagavā etadavoca – ‘‘Nanu te, soṇa, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘ye kho keci bhagavato sāvakā āraddhavīriyā viharanti, ahaṃ tesaṃ aññataro. Atha ca pana me na anupādāya āsavehi cittaṃ vimuccati, saṃvijjanti kho pana me kule bhogā, sakkā bhogā [bhoge (mahāva. 243)] ca bhuñjituṃ puññāni ca kātuṃ. Yaṃnūnāhaṃ sikkhaṃ paccakkhāya hīnāyāvattitvā bhoge ca bhuñjeyyaṃ puññāni ca kareyya’’’nti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, soṇa, kusalo tvaṃ pubbe agāriyabhūto [āgārikabhūto (syā.), agārikabhūto (mahāva. 243)] vīṇāya tantissare’’ti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, soṇa, yadā te vīṇāya tantiyo accāyatā honti, api nu te vīṇā tasmiṃ samaye saravatī vā hoti kammaññā vā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kiṃ maññasi, soṇa, yadā te vīṇāya tantiyo atisithilā honti, api nu te vīṇā tasmiṃ samaye saravatī vā hoti kammaññā vā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yadā pana te, soṇa, vīṇāya tantiyo na accāyatā honti nātisithilā same guṇe patiṭṭhitā, api nu te vīṇā tasmiṃ samaye saravatī vā hoti kammaññā vā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho, soṇa, accāraddhavīriyaṃ uddhaccāya saṃvattati, atisithilavīriyaṃ kosajjāya saṃvattati. Tasmātiha tvaṃ, soṇa, vīriyasamathaṃ adhiṭṭhahaṃ, indriyānañca samataṃ paṭivijjha, tattha ca nimittaṃ gaṇhāhī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā soṇo bhagavato paccassosi. Atha kho bhagavā āyasmantaṃ soṇaṃ iminā ovādena ovaditvā – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evamevaṃ kho – sītavane antarahito gijjhakūṭe pabbate pāturahosi. Atha kho āyasmā soṇo aparena samayena vīriyasamathaṃ adhiṭṭhāsi, indriyānañca samataṃ paṭivijjhi, tattha ca nimittaṃ aggahesi. Atha kho āyasmā soṇo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anāgāriyaṃ pabbajanti tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā soṇo arahataṃ ahosi. Atha kho āyasmato soṇassa arahattappattassa etadahosi – ‘‘yaṃnūnāhaṃ yena bhagavā tenupasaṅkameyyaṃ; upasaṅkamitvā bhagavato santike aññaṃ byākareyya’’nti. Atha kho āyasmā soṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā soṇo bhagavantaṃ etadavoca – ‘‘Yo so, bhante, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto, so cha ṭhānāni adhimutto hoti – nekkhammādhimutto hoti, pavivekādhimutto hoti, abyāpajjādhimutto [abyāpajjhādhimutto (ka.) mahāva. 244 passitabbaṃ] hoti, taṇhākkhayādhimutto hoti, upādānakkhayādhimutto hoti, asammohādhimutto hoti. ‘‘Siyā kho pana, bhante, idhekaccassa āyasmato evamassa – ‘kevalaṃsaddhāmattakaṃ nūna ayamāyasmā nissāya nekkhammādhimutto’ti. Na kho panetaṃ, bhante, evaṃ daṭṭhabbaṃ. Khīṇāsavo, bhante, bhikkhu vusitavā katakaraṇīyo karaṇīyaṃ attano asamanupassanto katassa vā paṭicayaṃ khayā rāgassa vītarāgattā nekkhammādhimutto hoti, khayā dosassa vītadosattā nekkhammādhimutto hoti, khayā mohassa vītamohattā nekkhammādhimutto hoti. ‘‘Siyā kho pana, bhante, idhekaccassa āyasmato evamassa – ‘lābhasakkārasilokaṃ nūna ayamāyasmā nikāmayamāno pavivekādhimutto’ti. Na kho panetaṃ, bhante, evaṃ daṭṭhabbaṃ. Khīṇāsavo, bhante, bhikkhu vusitavā katakaraṇīyo karaṇīyaṃ attano asamanupassanto katassa vā paṭicayaṃ khayā rāgassa vītarāgattā pavivekādhimutto hoti, khayā dosassa vītadosattā pavivekādhimutto hoti, khayā mohassa vītamohattā pavivekādhimutto hoti. ‘‘Siyā kho pana, bhante, idhekaccassa āyasmato evamassa – ‘sīlabbataparāmāsaṃ nūna ayamāyasmā sārato paccāgacchanto abyāpajjādhimutto’ti. Na kho panetaṃ, bhante, evaṃ daṭṭhabbaṃ. Khīṇāsavo, bhante, bhikkhu vusitavā katakaraṇīyo karaṇīyaṃ attano asamanupassanto katassa vā paṭicayaṃ khayā rāgassa vītarāgattā abyāpajjādhimutto hoti, khayā dosassa vītadosattā abyāpajjādhimutto hoti, khayā mohassa vītamohattā abyāpajjādhimutto hoti. ‘‘Khayā rāgassa vītarāgattā taṇhākkhayādhimutto hoti, khayā dosassa vītadosattā taṇhākkhayādhimutto hoti, khayā mohassa vītamohattā taṇhākkhayādhimutto hoti. ‘‘Khayā rāgassa vītarāgattā upādānakkhayādhimutto hoti, khayā dosassa vītadosattā upādānakkhayādhimutto hoti, khayā mohassa vītamohattā upādānakkhayādhimutto hoti. ‘‘Khayā rāgassa vītarāgattā asammohādhimutto hoti, khayā dosassa vītadosattā asammohādhimutto hoti, khayā mohassa vītamohattā asammohādhimutto hoti. ‘‘Evaṃ sammā vimuttacittassa, bhante, bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṃ [āpātaṃ (ka.)] āgacchanti, nevassa cittaṃ pariyādiyanti. Amissīkatamevassa cittaṃ hoti ṭhitaṃ āneñjappattaṃ vayañcassānupassati. Bhusā cepi sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā manassa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti. Amissīkatamevassa cittaṃ hoti ṭhitaṃ āneñjappattaṃ vayañcassānupassati. Seyyathāpi, bhante, selo pabbato acchiddo asusiro ekagghano. Atha puratthimāya cepi disāya āgaccheyya bhusā vātavuṭṭhi neva naṃ saṅkampeyya na sampakampeyya na sampavedheyya, atha pacchimāya cepi disāya āgaccheyya bhusā vātavuṭṭhi…pe… atha uttarāya cepi disāya āgaccheyya bhusā vātavuṭṭhi… atha dakkhiṇāya cepi disāya āgaccheyya bhusā vātavuṭṭhi neva naṃ saṅkampeyya na sampakampeyya na sampavedheyya; evamevaṃ kho, bhante, evaṃ sammāvimuttacittassa bhikkhuno bhusā cepi cakkhuviññeyyā rūpā cakkhussa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti. Amissīkatamevassa cittaṃ hoti ṭhitaṃ āneñjappattaṃ vayañcassānupassati. Bhusā cepi sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā… manoviññeyyā dhammā manassa āpāthaṃ āgacchanti, nevassa cittaṃ pariyādiyanti. Amissīkatamevassa cittaṃ hoti ṭhitaṃ āneñjappattaṃ vayañcassānupassatī’’ti. ‘‘Nekkhammaṃ adhimuttassa, pavivekañca cetaso; Abyāpajjādhimuttassa, upādānakkhayassa ca. ‘‘Taṇhākkhayādhimuttassa, asammohañca cetaso; Disvā āyatanuppādaṃ, sammā cittaṃ vimuccati. ‘‘Tassa sammā vimuttassa, santacittassa bhikkhuno; Katassa paṭicayo natthi, karaṇīyaṃ na vijjati. ‘‘Selo yathā ekagghano, vātena na samīrati; Evaṃ rūpā rasā saddā, gandhā phassā ca kevalā. ‘‘Iṭṭhā dhammā aniṭṭhā ca, nappavedhenti tādino; Ṭhitaṃ cittaṃ vippamuttaṃ [vimutañca (ka.) mahāva. 244; kathā. 266], vayañcassānupassatī’’ti. paṭhamaṃ;",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Rājagaha, on Gijjhakūṭa Mountain. At that time, Venerable Soṇa was dwelling in Rājagaha, in the Cool Grove. Then, while Venerable Soṇa was alone, in seclusion, this thought arose in his mind: \"Among the Blessed One's disciples who dwell with aroused energy, I am one. Yet, my mind is not liberated from the defilements without clinging. Indeed, there are riches in my family; it would be possible for me to enjoy these riches and perform meritorious deeds. What if I were to renounce the training, revert to a lower state, and then enjoy riches and perform meritorious deeds?\"\n\nThen the Blessed One, having known with his mind the thought in Venerable Soṇa's mind—just as a strong man might extend his flexed arm or flex his extended arm—vanished from Gijjhakūṭa Mountain and reappeared before Venerable Soṇa in the Cool Grove. The Blessed One sat down on the seat prepared for him. Venerable Soṇa, after bowing to the Blessed One, sat down to one side. As Venerable Soṇa sat to one side, the Blessed One said to him: \"Soṇa, did this thought not arise in your mind while you were alone, in seclusion: 'Among the Blessed One's disciples who dwell with aroused energy, I am one. Yet, my mind is not liberated from the defilements without clinging. Indeed, there are riches in my family; it would be possible for me to enjoy these riches and perform meritorious deeds. What if I were to renounce the training, revert to a lower state, and then enjoy riches and perform meritorious deeds?'\" \"Yes, Venerable Sir.\"\n\n\"What do you think, Soṇa? When you were a lay follower previously, were you skilled in playing the lute, in its string music?\" \"Yes, Venerable Sir.\" \"What do you think, Soṇa? When the strings of your lute were too taut, was your lute at that time melodious or playable?\" \"No, Venerable Sir.\" \"What do you think, Soṇa? When the strings of your lute were too loose, was your lute at that time melodious or playable?\" \"No, Venerable Sir.\" \"But when the strings of your lute, Soṇa, were neither too taut nor too loose, but evenly tuned, was your lute at that time melodious or playable?\" \"Yes, Venerable Sir.\"\n\n\"In the same way, Soṇa, excessive energy leads to restlessness, and slack energy leads to laziness. Therefore, Soṇa, firmly establish the proper balance of energy, penetrate the equilibrium of the spiritual faculties, and therein grasp the skillful means.\" \"Yes, Venerable Sir,\" Venerable Soṇa replied to the Blessed One.\n\nThen the Blessed One, having given Venerable Soṇa this admonition—just as a strong man might extend his flexed arm or flex his extended arm—vanished from the Cool Grove and reappeared on Gijjhakūṭa Mountain. Then, at a later time, Venerable Soṇa firmly established the proper balance of energy, penetrated the equilibrium of the spiritual faculties, and therein grasped the skillful means. Then, Venerable Soṇa, dwelling alone, secluded, diligent, ardent, and resolute, not long thereafter—by realizing for himself with direct knowledge and attaining it in this very life—dwelt in that unsurpassed culmination of the holy life, for the sake of which noble sons rightly go forth from home to homelessness. He knew: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.\" And Venerable Soṇa became one of the Arahants.\n\nThen, when Venerable Soṇa had attained Arahantship, this thought occurred to him: \"What if I were to approach the Blessed One; having approached, I would declare my knowledge in the presence of the Blessed One?\" Then Venerable Soṇa approached the Blessed One; having approached, he bowed to the Blessed One and sat down to one side. As Venerable Soṇa sat to one side, he said to the Blessed One: \"Venerable Sir, a bhikkhu who is an Arahant, whose defilements are destroyed, who has lived the holy life, done what had to be done, laid down the burden, attained the true goal, whose fetters of existence are utterly destroyed, one who is rightly liberated through perfect knowledge, is strongly inclined towards six things: he is strongly inclined towards renunciation, he is strongly inclined towards seclusion, he is strongly inclined towards non-affliction, he is strongly inclined towards the destruction of craving, he is strongly inclined towards the destruction of clinging, he is strongly inclined towards freedom from delusion. It might be, Venerable Sir, that some venerable one might think: 'This venerable one is merely inclined towards renunciation based solely on faith.' But, Venerable Sir, this should not be seen in that way.\"\n\nVenerable Sir, a monk whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who sees nothing further to be done for himself, and for whom there is no accumulation stemming from what has been done, is inclined towards renunciation due to the destruction of lust and being free from lust; is inclined towards renunciation due to the destruction of hatred and being free from hatred; is inclined towards renunciation due to the destruction of delusion and being free from delusion. Venerable Sir, it might be that some venerable one might think: ‘Surely this venerable one is inclined towards seclusion, desiring gain, honor, and fame.’ But, Venerable Sir, this should not be seen in this way. Venerable Sir, a monk whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who sees nothing further to be done for himself, and for whom there is no accumulation stemming from what has been done, is inclined towards seclusion due to the destruction of lust and being free from lust; is inclined towards seclusion due to the destruction of hatred and being free from hatred; is inclined towards seclusion due to the destruction of delusion and being free from delusion.\n\nVenerable Sir, it might be that some venerable one might think: ‘Surely this venerable one is inclined towards harmlessness, considering mere rules and rituals as the essence.’ But, Venerable Sir, this should not be seen in this way. Venerable Sir, a monk whose defilements are destroyed, who has lived the holy life, who has done what had to be done, who sees nothing further to be done for himself, and for whom there is no accumulation stemming from what has been done, is inclined towards harmlessness due to the destruction of lust and being free from lust; is inclined towards harmlessness due to the destruction of hatred and being free from hatred; is inclined towards harmlessness due to the destruction of delusion and being free from delusion.\n\nDue to the destruction of lust and being free from lust, he is inclined towards the destruction of craving; due to the destruction of hatred and being free from hatred, he is inclined towards the destruction of craving; due to the destruction of delusion and being free from delusion, he is inclined towards the destruction of craving.\n\nDue to the destruction of lust and being free from lust, he is inclined towards the destruction of clinging; due to the destruction of hatred and being free from hatred, he is inclined towards the destruction of clinging; due to the destruction of delusion and being free from delusion, he is inclined towards the destruction of clinging.\n\nDue to the destruction of lust and being free from lust, he is inclined towards non-delusion; due to the destruction of hatred and being free from hatred, he is inclined towards non-delusion; due to the destruction of delusion and being free from delusion, he is inclined towards non-delusion.\n\nVenerable Sir, for such a monk whose mind is rightly liberated, even if very strong visible forms come into the range of his eye, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong audible sounds come into the range of his ear, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong olfactory odors come into the range of his nose, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong gustatory tastes come into the range of his tongue, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong tactile sensations come into the range of his body, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong mentally cognizable phenomena come into the range of his mind, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away.\n\nJust as, Venerable Sir, a solid rock mountain, without cracks or holes, a single mass, even if a violent storm, wind and rain, should come from the eastern direction, it would not shake it, nor make it tremble, nor make it quiver; even if a violent storm, wind and rain, should come from the western direction, it would not shake it, nor make it tremble, nor make it quiver; even if a violent storm, wind and rain, should come from the northern direction, it would not shake it, nor make it tremble, nor make it quiver; even if a violent storm, wind and rain, should come from the southern direction, it would not shake it, nor make it tremble, nor make it quiver. Even so, Venerable Sir, for such a monk whose mind is rightly liberated, even if very strong visible forms come into the range of his eye, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong audible sounds come into the range of his ear, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong olfactory odors come into the range of his nose, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong gustatory tastes come into the range of his tongue, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong tactile sensations come into the range of his body, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away. Even if very strong mentally cognizable phenomena come into the range of his mind, they do not overpower his mind. His mind remains unmixed, steady, and attained to imperturbability, and he perceives their passing away.\n\nFor one inclined towards renunciation and seclusion of mind, inclined towards harmlessness and the destruction of clinging,\nfor one inclined towards the destruction of craving and non-delusion of mind, having seen the arising of sense bases, the mind is rightly liberated.\nFor that rightly liberated monk, with a tranquil mind, there is no accumulation stemming from what has been done, and no duty remains.\nJust as a solid rock mass is not stirred by the wind, so too forms, tastes, sounds, odors, and contacts, all of them,\ndesirable and undesirable phenomena do not perturb such a one. His mind is steady and fully liberated, and he perceives their passing away.",
      "sinhala": "මා හට මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ඣකූට පර්වතයෙහි වැඩ වාසය කරන සේක. එකල්හි ආයුෂ්මත් සෝණ තෙරණුවෝ රජගහ නුවර සීතවනයෙහි වැඩ වාසය කරති. ඉක්බිති ආයුෂ්මත් සෝණ තෙරණුවෝ විවේක ස්ථානයකට ගොස්, තනිව භාවනා කරමින් සිටියදී, මෙබඳු චිත්ත විතර්කයක් පහළ විය: “යම් කෙනෙක් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයෝ වී වීර්යය අරඹා වාසය කෙරෙත්ද, මම ඔවුන් අතුරින් එක් කෙනෙක්මි. එහෙත් මාගේ සිත උපාදානයෙන් තොරව ආශ්‍රවයන්ගෙන් මිදෙන්නේ නැත. මාගේ කුලයට අයත් භෝග සම්පත් තිබේ. භෝග පරිභෝජනය කිරීමටත් පින්කම් කිරීමටත් පුළුවන. යහපති, මම ශික්ෂාව අත්හැර, පහත් තත්ත්වයට පත්ව, භෝග පරිභෝජනය කරමින්, පින්කම් කරන්නෙම් නම්” යනුවෙනි. ඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් සෝණ තෙරණුවන්ගේ සිතෙහි පහළ වූ චිත්ත විතර්කය චේතසිකව දැනගෙන, යම්සේ බලවත් පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නේද, දිග හැරූ අතක් හකුළුවන්නේද, එපරිද්දෙන්ම ගිජ්ඣකූට පර්වතයෙන් අතුරුදහන් වී, සීතවනයෙහි ආයුෂ්මත් සෝණ තෙරණුවන් ඉදිරියෙහි පහළ වූ සේක. භාග්‍යවතුන් වහන්සේ පනවන ලද අසුනෙහි වැඩ හුන් සේක. ආයුෂ්මත් සෝණ තෙරණුවෝද භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක වැඩ හුන්හ. එකත්පසෙක වැඩ සිටි ආයුෂ්මත් සෝණ තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “සෝණය, විවේක ස්ථානයකට ගොස්, තනිව භාවනා කරමින් සිටියදී, නුඹට මෙබඳු චිත්ත විතර්කයක් පහළ නොවූයේද: ‘යම් කෙනෙක් භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයෝ වී වීර්යය අරඹා වාසය කෙරෙත්ද, මම ඔවුන් අතුරින් එක් කෙනෙක්මි. එහෙත් මාගේ සිත උපාදානයෙන් තොරව ආශ්‍රවයන්ගෙන් මිදෙන්නේ නැත. මාගේ කුලයට අයත් භෝග සම්පත් තිබේ. භෝග පරිභෝජනය කිරීමටත් පින්කම් කිරීමටත් පුළුවන. යහපති, මම ශික්ෂාව අත්හැර, පහත් තත්ත්වයට පත්ව, භෝග පරිභෝජනය කරමින්, පින්කම් කරන්නෙම් නම්’ යනුවෙනි?” “එසේය, භාග්‍යවතුන් වහන්ස.”\n\n“සෝණය, නුඹ පෙර ගිහියකුව සිටියදී වීණා වාදනයෙහි දක්ෂයෙකු වූයේ යැයි කල්පනා කරන්නේද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “සෝණය, නුඹ කෙසේ සිතන්නෙහිද, නුඹේ වීණාවේ තත් අධිකව තද වූ විට, ඒ සමයෙහි නුඹේ වීණාව නාදවත් වන්නේද, කාර්යක්ෂම වන්නේද?” “නැත, භාග්‍යවතුන් වහන්ස.” “සෝණය, නුඹ කෙසේ සිතන්නෙහිද, නුඹේ වීණාවේ තත් අධිකව ලිහිල් වූ විට, ඒ සමයෙහි නුඹේ වීණාව නාදවත් වන්නේද, කාර්යක්ෂම වන්නේද?” “නැත, භාග්‍යවතුන් වහන්ස.” “නුමුත් සෝණය, නුඹේ වීණාවේ තත් අධිකව තද නොවී, අධිකව ලිහිල් නොවී සම වූ ස්වභාවයක පිහිටි විට, ඒ සමයෙහි නුඹේ වීණාව නාදවත් වන්නේද, කාර්යක්ෂම වන්නේද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “එපරිද්දෙන්ම සෝණය, අධික ලෙස අරඹන ලද වීර්යය උද්ධච්චයට හෙවත් සිතෙහි නොසන්සුන් භාවයට හේතු වේ. අධික ලෙස ලිහිල් වූ වීර්යය අලස බවට හේතු වේ. එබැවින් සෝණය, නුඹ වීර්යයෙහි සම බව අධිෂ්ඨාන කරනු. ඉන්ද්‍රියයන්ගේ සමතාව අවබෝධ කරගනු. එහිදී නිමිති ගන්නෙහි.” “එසේය, භාග්‍යවතුන් වහන්ස” යැයි ආයුෂ්මත් සෝණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් සෝණ තෙරණුවන්ට මේ අවවාදයෙන් අවවාද කොට, යම්සේ බලවත් පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නේද, දිග හැරූ අතක් හකුළුවන්නේද, එපරිද්දෙන්ම සීතවනයෙන් අතුරුදහන් වී, ගිජ්ඣකූට පර්වතයෙහි පහළ වූ සේක. ඉක්බිති ආයුෂ්මත් සෝණ තෙරණුවෝ පසු කලෙක වීර්යයෙහි සම බව අධිෂ්ඨාන කළහ. ඉන්ද්‍රියයන්ගේ සමතාව අවබෝධ කරගත්හ. එහිදී නිමිතිද ගත්හ. ඉක්බිති ආයුෂ්මත් සෝණ තෙරණුවෝ තනිව, විවේකව, අප්‍රමාදීව, දැඩි වීර්යයෙන්, යොමු කරන ලද සිතින් යුතුව වාසය කරමින්, වැඩි කලක් නොගොස්ම – යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචරියාවේ කෙළවර, මේ ආත්මභාවයෙහිදීම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය කළහ. “ඉපදීම ක්ෂය විය. බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කරන ලදී. කළ යුතු දේ කරන ලදී. නැවත මේ භාවයට පැමිණීමක් නැත” යි අවබෝධ කළහ. ආයුෂ්මත් සෝණ තෙරණුවෝද රහතුන් වහන්සේලා අතුරින් එක් නමක් වූ සේක.\n\nඉක්බිති රහත්භාවයට පත්ව සිටි ආයුෂ්මත් සෝණ තෙරණුවන්ට මෙබඳු අදහසක් ඇති විය: “යහපති, මම භාග්‍යවතුන් වහන්සේ වැඩ සිටින තැනට පැමිණෙන්නෙම්. පැමිණ භාග්‍යවතුන් වහන්සේ සමීපයෙහිදී අරහත් ඵලය ප්‍රකාශ කරන්නෙම්” යනුවෙනි. ඉක්බිති ආයුෂ්මත් සෝණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩ සිටින තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක වැඩ හුන්හ. එකත්පසෙක වැඩ සිටි ආයුෂ්මත් සෝණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “භාග්‍යවතුන් වහන්ස, යම් භික්ෂුවක් රහත්ද, ක්ෂීණාශ්‍රවද, බ්‍රහ්මචර්යාව සම්පූර්ණ කළේද, කළ යුතු දේ කළේද, බර පහ කළේද, තමාගේ සැබෑ අරමුණට පැමිණියේද, භව සංයෝජන ක්ෂය කළේද, මනා ප්‍රඥාවෙන් විමුක්ත වූයේද, හෙතෙම මේ කරුණු සය කෙරෙහි අධිමුක්ත වන්නේය – නෛෂ්ක්‍රම්‍යය කෙරෙහි අධිමුක්ත වන්නේය. විවේකය කෙරෙහි අධිමුක්ත වන්නේය. අව්‍යාපාදය කෙරෙහි අධිමුක්ත වන්නේය. තණ්හාක්ෂය කෙරෙහි අධිමුක්ත වන්නේය. උපාදානක්ෂය කෙරෙහි අධිමුක්ත වන්නේය. අසම්මෝහය කෙරෙහි අධිමුක්ත වන්නේය. භාග්‍යවතුන් වහන්ස, ඇතැම් ආයුෂ්මතෙකුට මෙසේ සිතෙන්නට පුළුවන: ‘මේ ආයුෂ්මත් තෙරණුවෝ හුදු ශ්‍රද්ධාව පමණක් නිසැකයෙන්ම පදනම් කරගෙන නෛෂ්ක්‍රම්‍යය කෙරෙහි අධිමුක්ත වූවා විය යුතුයි’ කියා. භාග්‍යවතුන් වහන්ස, මෙය එසේ නොදැක්ක යුතුය.\n\nවහන්ස, ක්ෂීණාශ්‍රව භික්ෂුවක් බඹසර වසා නිමකර, කළ යුතු දේ කර අවසන් කර, තමාට තවත් කළ යුතු දෙයක් හෝ කළ දෙයට පලක් නොදකිනුයේ, රාගය ක්ෂය කිරීමෙන්, රාගයෙන් වෙන් වූ බැවින් නෛෂ්ක්‍රම්‍යයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. ද්වේෂය ක්ෂය කිරීමෙන්, ද්වේෂයෙන් වෙන් වූ බැවින් නෛෂ්ක්‍රම්‍යයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. මෝහය ක්ෂය කිරීමෙන්, මෝහයෙන් වෙන් වූ බැවින් නෛෂ්ක්‍රම්‍යයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි.\n\nවහන්ස, එහෙත් සමහර ආයුෂ්මතුන්ගේ සිතට මෙවැනි සිතුවිල්ලක් පැමිණිය හැකිය: ‘සැබැවින්ම මේ ආයුෂ්මත් ලාභ සත්කාර කීර්ති ප්‍රශංසා කැමතිවූයේම විවේකයට නැඹුරු වූ සිත් ඇත්තෙක්’ කියා. වහන්ස, එහෙත් එය එසේ නොබැලිය යුතුය. වහන්ස, ක්ෂීණාශ්‍රව භික්ෂුවක් බඹසර වසා නිමකර, කළ යුතු දේ කර අවසන් කර, තමාට තවත් කළ යුතු දෙයක් හෝ කළ දෙයට පලක් නොදකිනුයේ, රාගය ක්ෂය කිරීමෙන්, රාගයෙන් වෙන් වූ බැවින් විවේකයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. ද්වේෂය ක්ෂය කිරීමෙන්, ද්වේෂයෙන් වෙන් වූ බැවින් විවේකයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. මෝහය ක්ෂය කිරීමෙන්, මෝහයෙන් වෙන් වූ බැවින් විවේකයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි.\n\nවහන්ස, එහෙත් සමහර ආයුෂ්මතුන්ගේ සිතට මෙවැනි සිතුවිල්ලක් පැමිණිය හැකිය: ‘සැබැවින්ම මේ ආයුෂ්මත් සීලබ්බත පරාමාසයම සාරය කොටගෙන අව්‍යාපජ්ජයට නැඹුරු වූ සිත් ඇත්තෙක්’ කියා. වහන්ස, එහෙත් එය එසේ නොබැලිය යුතුය. වහන්ස, ක්ෂීණාශ්‍රව භික්ෂුවක් බඹසර වසා නිමකර, කළ යුතු දේ කර අවසන් කර, තමාට තවත් කළ යුතු දෙයක් හෝ කළ දෙයට පලක් නොදකිනුයේ, රාගය ක්ෂය කිරීමෙන්, රාගයෙන් වෙන් වූ බැවින් අව්‍යාපජ්ජයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. ද්වේෂය ක්ෂය කිරීමෙන්, ද්වේෂයෙන් වෙන් වූ බැවින් අව්‍යාපජ්ජයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. මෝහය ක්ෂය කිරීමෙන්, මෝහයෙන් වෙන් වූ බැවින් අව්‍යාපජ්ජයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි.\n\nරාගය ක්ෂය කිරීමෙන්, රාගයෙන් වෙන් වූ බැවින් තණ්හාව ක්ෂය කිරීමට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. ද්වේෂය ක්ෂය කිරීමෙන්, ද්වේෂයෙන් වෙන් වූ බැවින් තණ්හාව ක්ෂය කිරීමට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. මෝහය ක්ෂය කිරීමෙන්, මෝහයෙන් වෙන් වූ බැවින් තණ්හාව ක්ෂය කිරීමට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි.\n\nරාගය ක්ෂය කිරීමෙන්, රාගයෙන් වෙන් වූ බැවින් උපාදානය ක්ෂය කිරීමට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. ද්වේෂය ක්ෂය කිරීමෙන්, ද්වේෂයෙන් වෙන් වූ බැවින් උපාදානය ක්ෂය කිරීමට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. මෝහය ක්ෂය කිරීමෙන්, මෝහයෙන් වෙන් වූ බැවින් උපාදානය ක්ෂය කිරීමට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි.\n\nරාගය ක්ෂය කිරීමෙන්, රාගයෙන් වෙන් වූ බැවින් අවිමෝහයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. ද්වේෂය ක්ෂය කිරීමෙන්, ද්වේෂයෙන් වෙන් වූ බැවින් අවිමෝහයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි. මෝහය ක්ෂය කිරීමෙන්, මෝහයෙන් වෙන් වූ බැවින් අවිමෝහයට නැඹුරු වූ සිත් ඇත්තෙක් වෙයි.\n\nවහන්ස, මෙසේ මනා කොට මිදුණු සිත් ඇති භික්ෂුවකට ඉතා දරුණු වුවත් ඇසට හඳුනාගත හැකි රූප, ඇසේ පථයට පැමිණියත්, ඒවා ඔහුගේ සිත පිරිහෙලන්නේ නැත. ඔහුගේ සිත නොකලතාගත් තත්ත්වයකින්, නොසෙල්වෙන ස්වභාවයට පැමිණ, පවතියි. ඔහු ඒ රූපයන්ගේ නැතිවීමම අනුපස්සනා කරයි. ඉතා දරුණු වුවත් කනට හඳුනාගත හැකි ශබ්ද... නාසයට හඳුනාගත හැකි ගන්ධ... දිවට හඳුනාගත හැකි රස... කයට හඳුනාගත හැකි ස්පර්ශ... මනසට හඳුනාගත හැකි ධර්ම මනසේ පථයට පැමිණියත්, ඒවා ඔහුගේ සිත පිරිහෙලන්නේ නැත. ඔහුගේ සිත නොකලතාගත් තත්ත්වයකින්, නොසෙල්වෙන ස්වභාවයට පැමිණ, පවතියි. ඔහු ඒ ධර්මයන්ගේ නැතිවීමම අනුපස්සනා කරයි.\n\nවහන්ස, යම්සේ සිදුරු නැති, හිස් තැන් නැති, තනි ගල්කුට්ටියක් මෙන් වූ ගල් පර්වතයක් වේද, එවිට නැගෙනහිර දිශාවෙන් ඉතා තද සුළං වැසි පැමිණියත්, එය ඒ පර්වතය නොසෙල්වයි, නොකලතයි, නොපෙළයි. බටහිර දිශාවෙන් ඉතා තද සුළං වැසි පැමිණියත්... උතුරු දිශාවෙන් ඉතා තද සුළං වැසි පැමිණියත්... දකුණු දිශාවෙන් ඉතා තද සුළං වැසි පැමිණියත්, එය ඒ පර්වතය නොසෙල්වයි, නොකලතයි, නොපෙළයි. වහන්ස, එපරිද්දෙන්ම මෙසේ මනා කොට මිදුණු සිත් ඇති භික්ෂුවකට ඉතා දරුණු වුවත් ඇසට හඳුනාගත හැකි රූප, ඇසේ පථයට පැමිණියත්, ඒවා ඔහුගේ සිත පිරිහෙලන්නේ නැත. ඔහුගේ සිත නොකලතාගත් තත්ත්වයකින්, නොසෙල්වෙන ස්වභාවයට පැමිණ, පවතියි. ඔහු ඒ රූපයන්ගේ නැතිවීමම අනුපස්සනා කරයි. ඉතා දරුණු වුවත් කනට හඳුනාගත හැකි ශබ්ද... නාසයට හඳුනාගත හැකි ගන්ධ... දිවට හඳුනාගත හැකි රස... කයට හඳුනාගත හැකි ස්පර්ශ... මනසට හඳුනාගත හැකි ධර්ම මනසේ පථයට පැමිණියත්, ඒවා ඔහුගේ සිත පිරිහෙලන්නේ නැත. ඔහුගේ සිත නොකලතාගත් තත්ත්වයකින්, නොසෙල්වෙන ස්වභාවයට පැමිණ, පවතියි. ඔහු ඒ ධර්මයන්ගේ නැතිවීමම අනුපස්සනා කරයි.\n\nනෛෂ්ක්‍රම්‍යයට නැඹුරු වූ, සිත්හි විවේකයට නැඹුරු වූ, අව්‍යාපජ්ජයට නැඹුරු වූ, උපාදානය ක්ෂය කිරීමට නැඹුරු වූ,\n\nතණ්හාව ක්ෂය කිරීමට නැඹුරු වූ, සිත්හි අවිමෝහයට නැඹුරු වූ (ඒ භික්ෂුවගේ), ආයතනවල ඇතිවීම (සහ නැතිවීම) දැක, සිත මනා කොට මිදෙයි.\n\nමනා කොට මිදුණු, සන්සුන් සිත් ඇති ඒ භික්ෂුවට කළ දෙයක විපාකයක් නැත, තවදුරටත් කළ යුතු කිසිවක් නොපවතියි.\n\nතනි ගල්කුට්ටියක් මෙන් වූ පර්වතයක් සුළඟින් නොසෙල්වෙන්නා සේ, එලෙසම රූප, රස, ශබ්ද, ගන්ධ, සහ ස්පර්ශ සියල්ල,\n\nඉෂ්ට වූත්, අනිෂ්ට වූත් ධර්මයන් එවැනි තත්ත්වයට පත් වූ පුද්ගලයා නොසෙල්වයි. ස්ථාවර වූ, මනා කොට මිදුණු සිත ඇත්තේ, ඔහු ඒවායේ නැතිවීමම අනුපස්සනා කරයි.",
      "paliTitle": "Soṇasuttaṃ"
    },
    {
      "number": 56,
      "pali": "Tena kho pana samayena āyasmā phagguno [phegguno (ka.), phagguṇo (sī. syā.)] ābādhiko hoti dukkhito bāḷhagilāno. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘āyasmā, bhante, phagguno ābādhiko dukkhito bāḷhagilāno. Sādhu, bhante, bhagavā yenāyasmā phagguno tenupasaṅkamatu anukampaṃ upādāyā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yenāyasmā phagguno tenupasaṅkami. Addasā kho āyasmā phagguno bhagavantaṃ dūratova āgacchantaṃ. Disvāna mañcake samadhosi [samañcopi (sī. syā. pī.), saṃ + dhū + ī = samadhosi]. Atha kho bhagavā āyasmantaṃ phaggunaṃ etadavoca – ‘‘alaṃ, phagguna, mā tvaṃ mañcake samadhosi. Santimāni āsanāni parehi paññattāni, tatthāhaṃ nisīdissāmī’’ti. Nisīdi bhagavā paññatte āsane. Nisajja kho bhagavā āyasmantaṃ phaggunaṃ etadavoca – ‘‘Kacci te, phagguna, khamanīyaṃ kacci yāpanīyaṃ? Kacci te dukkhā vedanā paṭikkamanti, no abhikkamanti; paṭikkamosānaṃ paññāyati, no abhikkamo’’ti? ‘‘Na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. ‘‘Seyyathāpi, bhante, balavā puriso tiṇhena sikharena muddhani [muddhānaṃ (sī. pī.)] abhimattheyya [abhimaṭṭheyya (syā.)]; evamevaṃ kho me, bhante, adhimattā vātā muddhani [hananti (sī. pī.), ohananti (syā.)] ūhananti. Na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. ‘‘Seyyathāpi, bhante, balavā puriso daḷhena varattakkhaṇḍena sīsaveṭhanaṃ dadeyya; evamevaṃ kho me, bhante, adhimattā sīse sīsavedanā. Na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. ‘‘Seyyathāpi, bhante, dakkho goghātako vā goghātakantevāsī vā tiṇhena govikantanena kucchiṃ parikanteyya; evamevaṃ kho me, bhante, adhimattā vātā kucchiṃ parikantanti. Na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo. ‘‘Seyyathāpi, bhante, dve balavanto purisā dubbalataraṃ purisaṃ nānābāhāsu gahetvā aṅgārakāsuyā santāpeyyuṃ samparitāpeyyuṃ; evamevaṃ kho me, bhante, adhimatto kāyasmiṃ ḍāho. Na me, bhante, khamanīyaṃ na yāpanīyaṃ. Bāḷhā me dukkhā vedanā abhikkamanti, no paṭikkamanti; abhikkamosānaṃ paññāyati, no paṭikkamo’’ti. Atha kho bhagavā āyasmantaṃ phaggunaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmi. Atha kho āyasmā phagguno acirapakkantassa bhagavato kālamakāsi. Tamhi cassa samaye maraṇakāle indriyāni vippasīdiṃsu. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘āyasmā, bhante, phagguno acirapakkantassa bhagavato kālamakāsi. Tamhi cassa samaye maraṇakāle indriyāni vippasīdiṃsū’’ti. ‘‘Kiṃ hānanda, phaggunassa [pheggunassa ānanda (ka.)] bhikkhuno indriyāni na vippasīdissanti! Phaggunassa, ānanda, bhikkhuno pañcahi orambhāgiyehi saṃyojanehi cittaṃ avimuttaṃ ahosi. Tassa taṃ dhammadesanaṃ sutvā pañcahi orambhāgiyehi saṃyojanehi cittaṃ vimuttaṃ. ‘‘Chayime, ānanda, ānisaṃsā kālena dhammassavane [dhammasavaṇe (sī.)] kālena atthupaparikkhāya. Katame cha? Idhānanda, bhikkhuno pañcahi orambhāgiyehi saṃyojanehi cittaṃ avimuttaṃ hoti. So tamhi samaye maraṇakāle labhati tathāgataṃ dassanāya. Tassa tathāgato dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Tassa taṃ dhammadesanaṃ sutvā pañcahi orambhāgiyehi saṃyojanehi cittaṃ vimuccati. Ayaṃ, ānanda, paṭhamo ānisaṃso kālena dhammassavane. ‘‘Puna caparaṃ, ānanda, bhikkhuno pañcahi orambhāgiyehi saṃyojanehi cittaṃ avimuttaṃ hoti. So tamhi samaye maraṇakāle na heva kho [no ca kho (ka.)] labhati tathāgataṃ dassanāya, api ca kho tathāgatasāvakaṃ labhati dassanāya. Tassa tathāgatasāvako dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Tassa taṃ dhammadesanaṃ sutvā pañcahi orambhāgiyehi saṃyojanehi cittaṃ vimuccati. Ayaṃ, ānanda, dutiyo ānisaṃso kālena dhammassavane. ‘‘Puna caparaṃ, ānanda, bhikkhuno pañcahi orambhāgiyehi saṃyojanehi cittaṃ avimuttaṃ hoti. So tamhi samaye maraṇakāle na heva kho labhati tathāgataṃ dassanāya, napi tathāgatasāvakaṃ labhati dassanāya; api ca kho yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati. Tassa yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakkayato anuvicārayato manasānupekkhato pañcahi orambhāgiyehi saṃyojanehi cittaṃ vimuccati. Ayaṃ, ānanda, tatiyo ānisaṃso kālena atthupaparikkhāya. ‘‘Idhānanda, bhikkhuno pañcahi orambhāgiyehi saṃyojanehi cittaṃ vimuttaṃ hoti, anuttare ca kho upadhisaṅkhaye cittaṃ avimuttaṃ hoti. So tamhi samaye maraṇakāle labhati tathāgataṃ dassanāya. Tassa tathāgato dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ…pe… brahmacariyaṃ pakāseti. Tassa taṃ dhammadesanaṃ sutvā anuttare upadhisaṅkhaye cittaṃ vimuccati. Ayaṃ, ānanda, catuttho ānisaṃso kālena dhammassavane. ‘‘Puna caparaṃ, ānanda, bhikkhuno pañcahi orambhāgiyehi saṃyojanehi cittaṃ vimuttaṃ hoti, anuttare ca kho upadhisaṅkhaye cittaṃ avimuttaṃ hoti. So tamhi samaye maraṇakāle na heva kho labhati tathāgataṃ dassanāya, api ca kho tathāgatasāvakaṃ labhati dassanāya. Tassa tathāgatasāvako dhammaṃ deseti ādikalyāṇaṃ…pe… parisuddhaṃ brahmacariyaṃ pakāseti. Tassa taṃ dhammadesanaṃ sutvā anuttare upadhisaṅkhaye cittaṃ vimuccati. Ayaṃ, ānanda, pañcamo ānisaṃso kālena dhammassavane. ‘‘Puna caparaṃ, ānanda, bhikkhuno pañcahi orambhāgiyehi saṃyojanehi cittaṃ vimuttaṃ hoti, anuttare ca kho upadhisaṅkhaye cittaṃ avimuttaṃ hoti. So tamhi samaye maraṇakāle na heva kho labhati tathāgataṃ dassanāya, napi tathāgatasāvakaṃ labhati dassanāya; api ca kho yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati. Tassa yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakkayato anuvicārayato manasānupekkhato anuttare upadhisaṅkhaye cittaṃ vimuccati. Ayaṃ, ānanda, chaṭṭho ānisaṃso kālena atthupaparikkhāya. Ime kho, ānanda, cha ānisaṃsā kālena dhammassavane kālena atthupaparikkhāyā’’ti. Dutiyaṃ.",
      "english": "Now at that time, Venerable Phagguna was afflicted, suffering, and gravely ill. Then Venerable Ananda approached the Blessed One, and having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, Venerable Ananda said this to the Blessed One: \"Venerable sir, Venerable Phagguna is afflicted, suffering, and gravely ill. It would be good, venerable sir, if the Blessed One would approach Venerable Phagguna, out of compassion.\" The Blessed One consented by his silence. Then in the evening, the Blessed One, risen from seclusion, approached Venerable Phagguna. Venerable Phagguna saw the Blessed One coming from afar. And having seen him, he stirred on his bed. Then the Blessed One said this to Venerable Phagguna: \"Enough, Phagguna, do not stir on your bed. There are these seats prepared by others; I will sit there.\" The Blessed One sat down on the seat prepared. Having sat down, the Blessed One said this to Venerable Phagguna: \"I hope, Phagguna, you are able to bear it, I hope you are getting by? I hope your painful feelings are subsiding and not increasing; I hope their subsiding is apparent, not their increasing?\" \"No, venerable sir, I am not able to bear it, nor am I getting by. My severe painful feelings are increasing, not subsiding; their increasing is apparent, not their subsiding.\n\n\"Just as, venerable sir, a strong man might cleave one's head with a sharp sword; even so, venerable sir, exceedingly strong winds cut through my head. I am not able to bear it, nor am I getting by. My severe painful feelings are increasing, not subsiding; their increasing is apparent, not their subsiding.\n\n\"Just as, venerable sir, a strong man might bind one's head with a strong leather thong; even so, venerable sir, I have exceedingly severe head pains in my head. I am not able to bear it, nor am I getting by. My severe painful feelings are increasing, not subsiding; their increasing is apparent, not their subsiding.\n\n\"Just as, venerable sir, a skilled butcher or his apprentice might carve up an ox's belly with a sharp butcher's knife; even so, venerable sir, exceedingly strong winds carve through my belly. I am not able to bear it, nor am I getting by. My severe painful feelings are increasing, not subsiding; their increasing is apparent, not their subsiding.\n\n\"Just as, venerable sir, two strong men might seize a weaker man by his arms and roast and char him over a pit of coals; even so, venerable sir, there is exceedingly severe burning in my body. I am not able to bear it, nor am I getting by. My severe painful feelings are increasing, not subsiding; their increasing is apparent, not their subsiding.\"\n\nThen the Blessed One, having instructed, encouraged, inspired, and gladdened Venerable Phagguna with a Dhamma talk, rose from his seat and departed. Then Venerable Phagguna passed away not long after the Blessed One had departed. And at the time of his passing, his faculties became perfectly clear.\n\nThen Venerable Ananda approached the Blessed One, and having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, Venerable Ananda said this to the Blessed One: \"Venerable sir, Venerable Phagguna passed away not long after the Blessed One had departed. And at the time of his passing, his faculties became perfectly clear.\" \"Ananda, why would the faculties of the bhikkhu Phagguna not become perfectly clear! Ananda, the mind of the bhikkhu Phagguna was not yet liberated from the five lower fetters. Having heard that Dhamma teaching, his mind became liberated from the five lower fetters.\n\n\"Ananda, there are these six benefits in listening to the Dhamma at the right time, and in reflecting on its meaning at the right time. What are the six? Here, Ananda, the mind of a bhikkhu is not yet liberated from the five lower fetters. At the time of his passing, he gains an audience with the Tathagata. For him, the Tathagata teaches the Dhamma, which is lovely in the beginning, lovely in the middle, and lovely in the end, with meaning and with phrasing; he proclaims the entirely perfect and purified spiritual life. Having heard that Dhamma teaching, his mind becomes liberated from the five lower fetters. This, Ananda, is the first benefit in listening to the Dhamma at the right time.\n\n\"Furthermore, Ananda, the mind of a bhikkhu is not yet liberated from the five lower fetters. At the time of his passing, he certainly does not gain an audience with the Tathagata, but he does gain an audience with a disciple of the Tathagata.\n\nTo him, a disciple of the Tathāgata teaches the Dhamma, which is beautiful in its beginning, beautiful in its middle, and beautiful in its consummation, complete in its meaning and its phrasing, and he proclaims the utterly perfect and purified holy life. Having heard that teaching of the Dhamma, his mind is liberated from the five lower fetters. This, Ananda, is the second benefit of listening to the Dhamma at the appropriate time.\n\nFurthermore, Ananda, there is the case where a bhikkhu's mind is not yet liberated from the five lower fetters. At that time, at the time of death, he does not get to see the Tathāgata, nor does he get to see a disciple of the Tathāgata. But instead, he reflects upon, ponders, and contemplates with his mind the Dhamma as he has heard and learned it. While he is thus reflecting upon, pondering, and contemplating with his mind the Dhamma as he has heard and learned it, his mind is liberated from the five lower fetters. This, Ananda, is the third benefit of examining the meaning at the appropriate time.\n\nHere, Ananda, a bhikkhu's mind is liberated from the five lower fetters, but his mind is not yet liberated in regard to the unsurpassed destruction of all substrata for existence. At that time, at the time of death, he gets to see the Tathāgata. To him, the Tathāgata teaches the Dhamma, which is beautiful in its beginning, beautiful in its middle, and beautiful in its consummation, complete in its meaning and its phrasing, and he proclaims the utterly perfect and purified holy life. Having heard that teaching of the Dhamma, his mind is liberated in regard to the unsurpassed destruction of all substrata for existence. This, Ananda, is the fourth benefit of listening to the Dhamma at the appropriate time.\n\nFurthermore, Ananda, there is the case where a bhikkhu's mind is liberated from the five lower fetters, but his mind is not yet liberated in regard to the unsurpassed destruction of all substrata for existence. At that time, at the time of death, he does not get to see the Tathāgata, but he does get to see a disciple of the Tathāgata. To him, a disciple of the Tathāgata teaches the Dhamma, which is beautiful in its beginning, beautiful in its middle, and beautiful in its consummation, complete in its meaning and its phrasing, and he proclaims the utterly perfect and purified holy life. Having heard that teaching of the Dhamma, his mind is liberated in regard to the unsurpassed destruction of all substrata for existence. This, Ananda, is the fifth benefit of listening to the Dhamma at the appropriate time.\n\nFurthermore, Ananda, there is the case where a bhikkhu's mind is liberated from the five lower fetters, but his mind is not yet liberated in regard to the unsurpassed destruction of all substrata for existence. At that time, at the time of death, he does not get to see the Tathāgata, nor does he get to see a disciple of the Tathāgata. But instead, he reflects upon, ponders, and contemplates with his mind the Dhamma as he has heard and learned it. While he is thus reflecting upon, pondering, and contemplating with his mind the Dhamma as he has heard and learned it, his mind is liberated in regard to the unsurpassed destruction of all substrata for existence. This, Ananda, is the sixth benefit of examining the meaning at the appropriate time. These, Ananda, are the six benefits of listening to the Dhamma at the appropriate time and examining the meaning at the appropriate time.",
      "sinhala": "එකල ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේ රෝගාතුරව, දුක් විඳිමින්, දැඩි ගිලන්ව සිටියහ. එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේ රෝගාතුරව, දුක් විඳිමින්, දැඩි ගිලන්ව සිටිති. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේ වෙත වැඩම කළහොත් ඉතා යහපත්ය.” භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දතාවයෙන් එය පිළිගත් සේක. ඉන්පසු භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි භාවනානුයෝගීව සිට නික්ම, ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට වැඩම කළ සේක. ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ දුරින්ම වඩිනවා දැක, ඇඳ මත සෙලවූහ. එවිට භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේට මෙසේ වදාළ සේක: “ඵග්ගුණය, එපමණයි, ඔබ ඇඳ මත සෙලවෙන්න එපා. මෙහි අන්‍යයන් විසින් පනවන ලද ආසන තිබේ, මා එහි වාඩි වන්නෙමි.” භාග්‍යවතුන් වහන්සේ පනවන ලද අසුනෙහි වැඩ හුන් සේක. වැඩ හිඳ, භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේට මෙසේ වදාළ සේක: “ඵග්ගුණය, ඔබට ඉවසිය හැකිද? ජීවත් විය හැකිද? දුක්ඛ වේදනා අඩු වී යයිද, වැඩි නොවෙයිද? අඩු වීමක් පෙනෙයිද, වැඩි වීමක් නොපෙනෙයිද?” “ස්වාමීනි, මට ඉවසිය නොහැක, ජීවත් විය නොහැක. මාගේ දුක්ඛ වේදනා දැඩිව වැඩි වේ, අඩුවන්නේ නැත; වැඩි වීමක් පෙනේ, අඩු වීමක් නොපෙනේ.” “ස්වාමීනි, යම්සේ බලවත් පුරුෂයෙක් තියුණු කටුවකින් හිස සිදුරු කර හරින්නේ ද, එපරිද්දෙන්ම ස්වාමීනි, මාගේ හිසෙහි අධික වාත වේදනා ඇති වී, ඉහළට විදින්නාක් මෙන් දැනේ. ස්වාමීනි, මට ඉවසිය නොහැක, ජීවත් විය නොහැක. මාගේ දුක්ඛ වේදනා දැඩිව වැඩි වේ, අඩුවන්නේ නැත; වැඩි වීමක් පෙනේ, අඩු වීමක් නොපෙනේ.” “ස්වාමීනි, යම්සේ බලවත් පුරුෂයෙක් තද සම් පටියකින් හිස වෙලන්නේ ද, එපරිද්දෙන්ම ස්වාමීනි, මාගේ හිසෙහි අධික හිස රුදාවක් ඇත. ස්වාමීනි, මට ඉවසිය නොහැක, ජීවත් විය නොහැක. මාගේ දුක්ඛ වේදනා දැඩිව වැඩි වේ, අඩුවන්නේ නැත; වැඩි වීමක් පෙනේ, අඩු වීමක් නොපෙනේ.” “ස්වාමීනි, යම්සේ දක්ෂ ගව ඝාතකයෙක් හෝ ගව ඝාතක ශිෂ්‍යයෙක් තියුණු මස් කැපුම් පිහියකින් බඩ විදින්නේ ද, එපරිද්දෙන්ම ස්වාමීනි, මාගේ බඩෙහි අධික වාත වේදනා විදින්නාක් මෙන් දැනේ. ස්වාමීනි, මට ඉවසිය නොහැක, ජීවත් විය නොහැක. මාගේ දුක්ඛ වේදනා දැඩිව වැඩි වේ, අඩුවන්නේ නැත; වැඩි වීමක් පෙනේ, අඩු වීමක් නොපෙනේ.” “ස්වාමීනි, යම්සේ බලවත් පුරුෂයෝ දෙදෙනෙක් දුර්වල පුද්ගලයෙකු දෙබාහුවෙන් අල්ලාගෙන අඟුරු ගොඩක තබා තවනවා ද, දවාලනවා ද, එපරිද්දෙන්ම ස්වාමීනි, මාගේ ශරීරයෙහි අධික දැවිල්ලක් ඇත. ස්වාමීනි, මට ඉවසිය නොහැක, ජීවත් විය නොහැක. මාගේ දුක්ඛ වේදනා දැඩිව වැඩි වේ, අඩුවන්නේ නැත; වැඩි වීමක් පෙනේ, අඩු වීමක් නොපෙනේ.”\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේට ධර්ම කථාවකින් කරුණු පෙන්වා, සමාදන් කරවා, උද්දීපනය කරවා, සතුටු කරවා, අසුනෙන් නැගිට වැඩම කළ සේක. ඉන්පසු භාග්‍යවතුන් වහන්සේ වැඩම කොට වැඩි වේලාවක් ගතවීමට පෙර ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේ කාලක්‍රියා කළ සේක. ඒ මරණ මොහොතේ උන්වහන්සේගේ ඉන්ද්‍රියන් මැනවින් ප්‍රසන්න විය.\n\nඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ වැඩම කොට වැඩි වේලාවක් ගතවීමට පෙර ආයුෂ්මත් ඵග්ගුණ ස්ථවිරයන් වහන්සේ කාලක්‍රියා කළ සේක. ඒ මරණ මොහොතේ උන්වහන්සේගේ ඉන්ද්‍රියන් මැනවින් ප්‍රසන්න විය.” “ආනන්දය, ඵග්ගුණ භික්ෂුවගේ ඉන්ද්‍රියන් ප්‍රසන්න නොවන්නේ කෙසේද! ආනන්දය, ඵග්ගුණ භික්ෂුවගේ සිත පහළ භාගයේ සංයෝජන පහෙන් මුදවා නොතිබුණි. එම ධර්ම දේශනාව අසා, ඔහුගේ සිත පහළ භාගයේ සංයෝජන පහෙන් මුදා හරින ලදී.”\n\n“ආනන්දය, නියම කලට ධර්මය ශ්‍රවණය කිරීමෙහි සහ නියම කලට අර්ථය පිරික්සා බැලීමෙහි ආනිසංස හයක් ඇත. ඒ කවර හයක්ද? ආනන්දය, මෙහිලා භික්ෂුවකගේ සිත පහළ භාගයේ සංයෝජන පහෙන් මුදවා නොතිබේ. ඔහු මරණාසන්න මොහොතේ තථාගතයන් වහන්සේ දැකීමට අවස්ථාව ලබයි. ඔහුට තථාගතයන් වහන්සේ මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරති. ඔහු එම ධර්ම දේශනාව අසා, පහළ භාගයේ සංයෝජන පහෙන් සිත මුදා ගනියි. ආනන්දය, නියම කලට ධර්මය ශ්‍රවණය කිරීමෙහි මෙය පළමු ආනිසංසයයි.\n\nතවද, ආනන්දය, භික්ෂුවකගේ සිත පහළ භාගයේ සංයෝජන පහෙන් මුදවා නොතිබේ. ඔහු මරණාසන්න මොහොතේ තථාගතයන් වහන්සේ දැකීමට අවස්ථාව නොලැබුවත්, තථාගත ශ්‍රාවකයෙකු දැකීමට අවස්ථාව ලබයි.\n\nඑවිට තථාගත ශ්‍රාවකයෙක් ඔහුට ආදි කල්‍යාණ, මධ්‍ය කල්‍යාණ, පර්යවසාන කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් සම්පූර්ණ වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන ධර්මය දේශනා කරයි. ඔහු එම ධර්ම දේශනාව අසා පඤ්ච ඕරම්භාගීය සංයෝජනවලින් සිත මිදෙයි. ආනන්දයෙනි, නියම වේලාවට ධර්මය ශ්‍රවණය කිරීමේ දෙවන ආනිසංසය මෙයයි.\n\nතවද, ආනන්දයෙනි, භික්ෂුවකගේ සිත පඤ්ච ඕරම්භාගීය සංයෝජනවලින් නොමිදුණු විට, ඔහු මරණාසන්න වේලාවේදී තථාගතයන් වහන්සේ දැකීමට නොලබයි, තථාගත ශ්‍රාවකයකු දැකීමටද නොලබයි. එහෙත් ඔහු තමා අසා දැනගත්, තමා ප්‍රගුණ කළ ධර්මය සිතින් විතර්ක කරයි, විචාරය කරයි, මනසින් විමසා බලයි. ඔහු තමා අසා දැනගත්, තමා ප්‍රගුණ කළ ධර්මය සිතින් විතර්ක කරන, විචාරය කරන, මනසින් විමසා බලන කල්හි පඤ්ච ඕරම්භාගීය සංයෝජනවලින් සිත මිදෙයි. ආනන්දයෙනි, නියම වේලාවට අර්ථය විමසා බැලීමේ තුන්වන ආනිසංසය මෙයයි.\n\nආනන්දයෙනි, මෙහි භික්ෂුවකගේ සිත පඤ්ච ඕරම්භාගීය සංයෝජනවලින් මිදුණේ වුවද, අනුත්තර උපධිසංඛයයෙන් සිත නොමිදුණේ වෙයි. ඔහු මරණාසන්න වේලාවේදී තථාගතයන් වහන්සේ දැකීමට ලබයි. එවිට තථාගතයන් වහන්සේ ඔහුට ආදි කල්‍යාණ, මධ්‍ය කල්‍යාණ, පර්යවසාන කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් සම්පූර්ණ වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන ධර්මය දේශනා කරයි. ඔහු එම ධර්ම දේශනාව අසා අනුත්තර උපධිසංඛයයෙන් සිත මිදෙයි. ආනන්දයෙනි, නියම වේලාවට ධර්මය ශ්‍රවණය කිරීමේ සිව්වන ආනිසංසය මෙයයි.\n\nතවද, ආනන්දයෙනි, භික්ෂුවකගේ සිත පඤ්ච ඕරම්භාගීය සංයෝජනවලින් මිදුණේ වුවද, අනුත්තර උපධිසංඛයයෙන් සිත නොමිදුණේ වෙයි. ඔහු මරණාසන්න වේලාවේදී තථාගතයන් වහන්සේ දැකීමට නොලබයි, එහෙත් තථාගත ශ්‍රාවකයකු දැකීමට ලබයි. එවිට තථාගත ශ්‍රාවකයා ඔහුට ආදි කල්‍යාණ, මධ්‍ය කල්‍යාණ, පර්යවසාන කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් සම්පූර්ණ වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන ධර්මය දේශනා කරයි. ඔහු එම ධර්ම දේශනාව අසා අනුත්තර උපධිසංඛයයෙන් සිත මිදෙයි. ආනන්දයෙනි, නියම වේලාවට ධර්මය ශ්‍රවණය කිරීමේ පස්වන ආනිසංසය මෙයයි.\n\nතවද, ආනන්දයෙනි, භික්ෂුවකගේ සිත පඤ්ච ඕරම්භාගීය සංයෝජනවලින් මිදුණේ වුවද, අනුත්තර උපධිසංඛයයෙන් සිත නොමිදුණේ වෙයි. ඔහු මරණාසන්න වේලාවේදී තථාගතයන් වහන්සේ දැකීමට නොලබයි, තථාගත ශ්‍රාවකයකු දැකීමටද නොලබයි. එහෙත් ඔහු තමා අසා දැනගත්, තමා ප්‍රගුණ කළ ධර්මය සිතින් විතර්ක කරයි, විචාරය කරයි, මනසින් විමසා බලයි. ඔහු තමා අසා දැනගත්, තමා ප්‍රගුණ කළ ධර්මය සිතින් විතර්ක කරන, විචාරය කරන, මනසින් විමසා බලන කල්හි අනුත්තර උපධිසංඛයයෙන් සිත මිදෙයි. ආනන්දයෙනි, නියම වේලාවට අර්ථය විමසා බැලීමේ සයවන ආනිසංසය මෙයයි. ආනන්දයෙනි, නියම වේලාවට ධර්මය ශ්‍රවණය කිරීමේ සහ නියම වේලාවට අර්ථය විමසා බැලීමේ ආනිසංස සය මේවාය.",
      "paliTitle": "Phaggunasuttaṃ"
    },
    {
      "number": 57,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘pūraṇena, bhante, kassapena chaḷabhijātiyo paññattā – kaṇhābhijāti paññattā, nīlābhijāti paññattā, lohitābhijāti paññattā, haliddābhijāti paññattā, sukkābhijāti paññattā, paramasukkābhijāti paññattā. ‘‘Tatridaṃ, bhante, pūraṇena kassapena kaṇhābhijāti paññattā, orabbhikā sūkarikā sākuṇikā māgavikā luddā macchaghātakā corā coraghātakā bandhanāgārikā ye vā panaññepi keci kurūrakammantā. ‘‘Tatridaṃ, bhante, pūraṇena kassapena nīlābhijāti paññattā, bhikkhū kaṇṭakavuttikā ye vā panaññepi keci kammavādā kriyavādā. ‘‘Tatridaṃ, bhante, pūraṇena kassapena lohitābhijāti paññattā, nigaṇṭhā ekasāṭakā. ‘‘Tatridaṃ, bhante, pūraṇena kassapena haliddābhijāti paññattā, gihī odātavasanā acelakasāvakā. ‘‘Tatridaṃ, bhante, pūraṇena kassapena sukkābhijāti paññattā, ājīvakā ājīvakiniyo. ‘‘Tatridaṃ, bhante, pūraṇena kassapena paramasukkābhijāti paññattā, nando vaccho kiso saṃkicco makkhali gosālo. Pūraṇena, bhante, kassapena imā chaḷabhijātiyo paññattā’’ti. ‘‘Kiṃ panānanda, pūraṇassa kassapassa sabbo loko etadabbhanujānāti imā chaḷabhijātiyo paññāpetu’’nti? ‘‘No hetaṃ, bhante’’. ‘‘Seyyathāpi, ānanda, puriso daliddo assako anāḷhiko, tassa akāmakassa bilaṃ olaggeyyuṃ – ‘idaṃ te, ambho purisa, maṃsañca khāditabbaṃ, mūlañca anuppadātabba’nti. Evamevaṃ kho, ānanda, pūraṇena kassapena appaṭiññāya etesaṃ samaṇabrāhmaṇānaṃ imā chaḷabhijātiyo paññattā, yathā taṃ bālena abyattena akhettaññunā akusalena. ‘‘Ahaṃ kho panānanda, chaḷabhijātiyo paññāpemi. Taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Bhagavā etadavoca – ‘‘katamā cānanda, chaḷabhijātiyo? Idhānanda, ekacco kaṇhābhijātiyo samāno kaṇhaṃ dhammaṃ abhijāyati. Idha panānanda, ekacco kaṇhābhijātiyo samāno sukkaṃ dhammaṃ abhijāyati. Idha panānanda, ekacco kaṇhābhijātiyo samāno akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati. Idha panānanda, ekacco sukkābhijātiyo samāno kaṇhaṃ dhammaṃ abhijāyati. Idha panānanda, ekacco sukkābhijātiyo samāno sukkaṃ dhammaṃ abhijāyati. Idha panānanda, ekacco sukkābhijātiyo samāno akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati. ‘‘Kathañcānanda, kaṇhābhijātiyo samāno kaṇhaṃ dhammaṃ abhijāyati? Idhānanda, ekacco nīce kule paccājāto hoti – caṇḍālakule vā nesādakule vā venakule [veṇakule (sabbattha)] vā rathakārakule vā pukkusakule vā, dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Evaṃ kho, ānanda, kaṇhābhijātiyo samāno kaṇhaṃ dhammaṃ abhijāyati. ‘‘Kathañcānanda, kaṇhābhijātiyo samāno sukkaṃ dhammaṃ abhijāyati? Idhānanda, ekacco nīce kule paccājāto hoti – caṇḍālakule vā…pe… seyyāvasathapadīpeyyassa. So kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. So kāyena sucaritaṃ caritvā, vācāya sucaritaṃ caritvā, manasā sucaritaṃ caritvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Evaṃ kho, ānanda, kaṇhābhijātiyo samāno sukkaṃ dhammaṃ abhijāyati. ‘‘Kathañcānanda, kaṇhābhijātiyo samāno akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati? Idhānanda, ekacco nīce kule paccājāto hoti – caṇḍālakule vā…pe… so ca hoti dubbaṇṇo duddasiko okoṭimako. So kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati. So evaṃ pabbajito samāno pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacitto, saā bojjhaṅge yathābhūtaṃ bhāvetvā akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati. Evaṃ kho, ānanda, kaṇhābhijātiyo samāno akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati. ‘‘Kathañcānanda, sukkābhijātiyo samāno kaṇhaṃ dhammaṃ abhijāyati? Idhānanda, ekacco ucce kule paccājāto hoti – khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā, aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe. So ca hoti abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā, vācāya duccaritaṃ caritvā, manasā duccaritaṃ caritvā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Evaṃ kho, ānanda, sukkābhijātiyo samāno kaṇhaṃ dhammaṃ abhijāyati. ‘‘Kathañcānanda, sukkābhijātiyo samāno sukkaṃ dhammaṃ abhijāyati? Idhānanda, ekacco ucce kule paccājāto hoti – khattiyamahāsālakule vā…pe… seyyāvasathapadīpeyyassa. So kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. So kāyena sucaritaṃ caritvā, vācāya sucaritaṃ caritvā, manasā sucaritaṃ caritvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Evaṃ kho, ānanda, sukkābhijātiyo samāno sukkaṃ dhammaṃ abhijāyati. ‘‘Kathañcānanda, sukkābhijātiyo samāno akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati? Idhānanda, ekacco ucce kule paccājāto hoti – khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā, aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe. So ca hoti abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati. So evaṃ pabbajito samāno pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacitto, satta bojjhaṅge yathābhūtaṃ bhāvetvā akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati. Evaṃ kho, ānanda, sukkābhijātiyo samāno akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati. Imā kho, ānanda, chaḷabhijātiyo’’ti. Tatiyaṃ.",
      "english": "Once the Blessed One was dwelling in Rājagaha, on Gijjhakūṭa mountain. Then the Venerable Ānanda approached the Blessed One; having approached and respectfully saluted the Blessed One, he sat down to one side. Seated to one side, the Venerable Ānanda said to the Blessed One: \"Venerable sir, Pūraṇa Kassapa has declared six classes of beings: the class of dark beings has been declared, the class of blue beings has been declared, the class of red beings has been declared, the class of yellow beings has been declared, the class of white beings has been declared, and the class of supremely white beings has been declared. Herein, Venerable sir, Pūraṇa Kassapa declared the class of dark beings to be sheep-butchers, pig-butchers, bird-hunters, wild animal hunters, executioners, fishermen, thieves, brigands, jailers, or anyone else who engages in cruel occupations. Herein, Venerable sir, Pūraṇa Kassapa declared the class of blue beings to be monks who live a thorny existence, or any others who uphold the doctrine of action and exertion. Herein, Venerable sir, Pūraṇa Kassapa declared the class of red beings to be the Nirgranthas (Jains) who wear a single robe. Herein, Venerable sir, Pūraṇa Kassapa declared the class of yellow beings to be lay followers who wear white garments and are disciples of the Acelakas (naked ascetics). Herein, Venerable sir, Pūraṇa Kassapa declared the class of white beings to be the male and female Ājīvakas. Herein, Venerable sir, Pūraṇa Kassapa declared the class of supremely white beings to be Nanda Vaccha, Kisa Saṅkicca, and Makkhali Gosāla. Venerable sir, Pūraṇa Kassapa has declared these six classes of beings.\"\n\n\"But Ānanda, does the whole world approve of Pūraṇa Kassapa’s declaration of these six classes of beings?\" \"No, Venerable sir.\" \"Just as, Ānanda, if a man were poor, destitute, and wretched, and against his will, a debt were foisted upon him, saying: ‘You, good man, must eat this meat and also pay the price for it.’ In the same way, Ānanda, Pūraṇa Kassapa has declared these six classes of beings without the consent of these recluses and brahmins, like a fool, an unskilled person, one ignorant of the field, one lacking wisdom. However, Ānanda, I declare six classes of beings. Listen to that, attend carefully; I will speak.\" \"Yes, Venerable sir,\" replied the Venerable Ānanda to the Blessed One. The Blessed One spoke thus: \"Which, Ānanda, are these six classes of beings?\n\n\"Here, Ānanda, someone born into a dark class of beings gives rise to a dark state. Here again, Ānanda, someone born into a dark class of beings gives rise to a bright state. Here again, Ānanda, someone born into a dark class of beings gives rise to a state that is neither dark nor bright: Nibbāna. Here again, Ānanda, someone born into a bright class of beings gives rise to a dark state. Here again, Ānanda, someone born into a bright class of beings gives rise to a bright state. Here again, Ānanda, someone born into a bright class of beings gives rise to a state that is neither dark nor bright: Nibbāna.\n\n\"And how, Ānanda, does someone born into a dark class of beings give rise to a dark state? Here, Ānanda, someone is reborn into a low family – a family of scavengers, or hunters, or bamboo-workers, or cart-makers, or refuse-collectors – a poor family with little food and drink, living a life of hardship, where sustenance is obtained with difficulty. And such a person is ugly, repulsive, hunchbacked, afflicted by many diseases – blind, or crippled, or lame, or paralyzed – and does not obtain food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, or lights. That person performs bad conduct with the body, bad conduct with speech, bad conduct with mind. Having performed bad conduct with the body, bad conduct with speech, and bad conduct with mind, upon the breakup of the body, after death, that person reappears in a state of deprivation, a bad destination, a lower realm, hell. Thus, Ānanda, someone born into a dark class of beings gives rise to a dark state.\n\n\"And how, Ānanda, does someone born into a dark class of beings give rise to a bright state? Here, Ānanda, someone is reborn into a low family – a family of scavengers, or hunters, or bamboo-workers, or cart-makers, or refuse-collectors – a poor family with little food and drink, living a life of hardship, where sustenance is obtained with difficulty. And such a person is ugly, repulsive, hunchbacked, afflicted by many diseases – blind, or crippled, or lame, or paralyzed – and does not obtain food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, or lights. That person performs good conduct with the body, good conduct with speech, good conduct with mind. Having performed good conduct with the body, good conduct with speech, and good conduct with mind, upon the breakup of the body, after death, that person reappears in a good destination, a heavenly world. Thus, Ānanda, someone born into a dark class of beings gives rise to a bright state.\n\n\"And how, Ānanda, does someone born into a dark class of beings give rise to a state that is neither dark nor bright: Nibbāna? Here, Ānanda, someone is reborn into a low family – a family of scavengers, or hunters, or bamboo-workers, or cart-makers, or refuse-collectors – a poor family with little food and drink, living a life of hardship, where sustenance is obtained with difficulty. And such a person is ugly, repulsive, hunchbacked. That person shaves off their hair and beard, puts on saffron robes, and goes forth from the home life into homelessness. Having thus gone forth, abandoning the five hindrances, which are corruptions of the mind and enfeeble the wisdom, with a mind well-established in the four foundations of mindfulness, having developed the seven factors of awakening as they truly are, that person gives rise to a state that is neither dark nor bright: Nibbāna.\n\nThus, Ananda, one of dark origin realizes Nibbāna that is neither dark nor bright.\n\nAnd how, Ananda, does one of bright origin realize dark kamma? Here, Ananda, some individual is reborn into a high family – a family of great kṣatriyas, or a family of great brahmins, or a family of great householders, wealthy, with great riches, great possessions, abundant gold and silver, abundant assets and equipment, abundant grain and wealth. And he is handsome, good-looking, pleasing, endowed with supreme beauty of complexion, gaining food, drink, clothing, vehicles, garlands, scents, ointments, bedding, lodging, and lamps. He commits misconduct by body, commits misconduct by speech, and commits misconduct by mind. Having committed misconduct by body, misconduct by speech, and misconduct by mind, at the breaking up of the body, after death, he reappears in a state of deprivation, a bad destination, a downfall, in hell. Thus, Ananda, one of bright origin realizes dark kamma.\n\nAnd how, Ananda, does one of bright origin realize bright kamma? Here, Ananda, some individual is reborn into a high family – a family of great kṣatriyas, or a family of great brahmins, or a family of great householders, wealthy, with great riches, great possessions, abundant gold and silver, abundant assets and equipment, abundant grain and wealth. And he is handsome, good-looking, pleasing, endowed with supreme beauty of complexion, gaining food, drink, clothing, vehicles, garlands, scents, ointments, bedding, lodging, and lamps. He conducts himself well by body, conducts himself well by speech, and conducts himself well by mind. Having conducted himself well by body, well by speech, and well by mind, at the breaking up of the body, after death, he reappears in a good destination, in the heavenly world. Thus, Ananda, one of bright origin realizes bright kamma.\n\nAnd how, Ananda, does one of bright origin realize Nibbāna that is neither dark nor bright? Here, Ananda, some individual is reborn into a high family – a family of great kṣatriyas, or a family of great brahmins, or a family of great householders, wealthy, with great riches, great possessions, abundant gold and silver, abundant assets and equipment, abundant grain and wealth. And he is handsome, good-looking, pleasing, endowed with supreme beauty of complexion, gaining food, drink, clothing, vehicles, garlands, scents, ointments, bedding, lodging, and lamps. He shaves off his hair and beard, puts on saffron robes, and goes forth from the home life into homelessness. Having thus gone forth, he abandons the five hindrances, which are corruptions of the mind that weaken wisdom; his mind is well-established in the four foundations of mindfulness; and having developed the seven factors of awakening as they truly are, he realizes Nibbāna that is neither dark nor bright. Thus, Ananda, one of bright origin realizes Nibbāna that is neither dark nor bright.\n\nThese, Ananda, are the six kinds of origin.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රාජග්‍රහයෙහි ගිජුකුළු පව්වෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ; එළඹ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වැඩසිටියහ. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ සැල කළහ: \"වහන්ස, පූරණ කස්සප විසින් අභිජාති (උපත් ස්වභාවයන්) ෂඩයෝ (සය දෙනෙක්) ප්‍රඥප්ත කර ඇත. එනම්: කළු අභිජාතිය ප්‍රඥප්ත කර ඇත, නිල් අභිජාතිය ප්‍රඥප්ත කර ඇත, රතු අභිජාතිය ප්‍රඥප්ත කර ඇත, කහ අභිජාතිය ප්‍රඥප්ත කර ඇත, සුදු අභිජාතිය ප්‍රඥප්ත කර ඇත, පරම සුදු අභිජාතිය ප්‍රඥප්ත කර ඇත.\"\n\n\"වහන්ස, එහි පූරණ කස්සප විසින් කළු අභිජාතිය වශයෙන් ප්‍රඥප්ත කර ඇත්තේ බැටළුවන් මරන්නන්, ඌරන් මරන්නන්, කුරුල්ලන් මරන්නන්, මෘගයන් මරන්නන්, දඩයම්කරුවන්, මාළු මරන්නන්, සොරුන්, සොරුන් මරන්නන්, බන්ධනාගාර නිලධාරීන්, හෝ වෙනත් යම් කුරිරු කර්මාන්ත ඇත්තවුන්ය.\"\n\n\"වහන්ස, එහි පූරණ කස්සප විසින් නිල් අභිජාතිය වශයෙන් ප්‍රඥප්ත කර ඇත්තේ කටුක ප්‍රතිපත්ති (තපස්) රකින්නාවූ භික්ෂූන් වහන්සේලා හෝ වෙනත් යම් කර්මවාදීන් (කර්මය පවතින්නේ යැයි කියන්නන්), ක්‍රියාප්‍රවාදීන් (ක්‍රියාව පවතින්නේ යැයි කියන්නන්) ය.\"\n\n\"වහන්ස, එහි පූරණ කස්සප විසින් රතු අභිජාතිය වශයෙන් ප්‍රඥප්ත කර ඇත්තේ ඒකසාටක නමැති නිගණ්ඨයන්ය.\"\n\n\"වහන්ස, එහි පූරණ කස්සප විසින් කහ අභිජාතිය වශයෙන් ප්‍රඥප්ත කර ඇත්තේ සුදු වස්ත්‍ර හැඳගත් ගිහියන්, සහ අචේලක ශ්‍රාවකයන්ය.\"\n\n\"වහන්ස, එහි පූරණ කස්සප විසින් සුදු අභිජාතිය වශයෙන් ප්‍රඥප්ත කර ඇත්තේ ආජීවකයන් සහ ආජීවිකාවන්ය.\"\n\n\"වහන්ස, එහි පූරණ කස්සප විසින් පරම සුදු අභිජාතිය වශයෙන් ප්‍රඥප්ත කර ඇත්තේ නන්දවච්ච, කිස, සංකිච්ච, මක්ඛලී ගෝසාල යන අයයි. වහන්ස, පූරණ කස්සප විසින් මේ ෂඩ අභිජාති ධර්මයන් ප්‍රඥප්ත කර ඇත\" යැයි කීය.\n\n\"ආනන්දය, පූරණ කස්සප විසින් මේ ෂඩ අභිජාති ධර්මයන් ප්‍රඥප්ත කිරීම සියලු ලෝකයා විසින් අනුදැන වදාළාද?\" \"වහන්ස, එසේ නොවේ.\"\n\n\"ආනන්දය, යම්සේ දුගී වූ, අයිතියක් නැති, ධනයක් නැති පුරුෂයෙකුට, ඔහු අකමැති වුවද, 'ඇයි පුරුෂය, මේ මස් ඔබ අනුභව කළ යුතු ය, මූල්‍ය ද ගෙවිය යුතු ය' යැයි ණයක් පටවනවා නම්, එසෙයින්ම, ආනන්දය, පූරණ කස්සප විසින් මේ ෂඩ අභිජාති ධර්මයන් ප්‍රඥප්ත කර ඇත්තේ, මේ ශ්‍රමණ-බ්‍රාහ්මණයන්ගේ අනුමැතියක් නොමැතිව, අඥානයෙකු, අදක්ෂයෙකු, ක්ෂේත්‍රඥතාවක් නොමැත්තෙකු, අකුශල පුද්ගලයෙකු විසින් මෙන් ය.\"\n\n\"එහෙත් ආනන්දය, මම (මා විසින්) ෂඩ අභිජාති ධර්මයන් ප්‍රඥප්ත කරමි. ඒ අසා, මැනවින් මෙනෙහි කරව; මම දේශනා කරන්නෙමි\" යැයි වදාළ සේක. \"එසේය, වහන්ස\" යැයි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"ආනන්දය, කවරේද ඒ ෂඩ අභිජාති ධර්මයෝ? ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් කළු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් කළු ධර්මයක් (අකුසල කර්මයක්) උපදවා ගනී. ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් කළු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් සුදු ධර්මයක් (කුසල කර්මයක්) උපදවා ගනී. ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් කළු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් කළු ද නොවන සුදු ද නොවන නිර්වාණය අවබෝධ කරගනී. ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් සුදු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් කළු ධර්මයක් (අකුසල කර්මයක්) උපදවා ගනී. ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් සුදු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් සුදු ධර්මයක් (කුසල කර්මයක්) උපදවා ගනී. ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් සුදු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් කළු ද නොවන සුදු ද නොවන නිර්වාණය අවබෝධ කරගනී.\"\n\n\"ආනන්දය, කළු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් කළු ධර්මයක් උපදවා ගන්නේ කෙසේද? ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් පහත් කුලයක උපත ලබා සිටී – එනම්: චණ්ඩාල කුලයක හෝ නේසාද කුලයක හෝ වේණ කුලයක හෝ රථකාර කුලයක හෝ පුක්කුස කුලයක හෝ ය. ඔහු දුගී ය, අල්ප වූ අහර බීම ඇත්තේ ය, දුෂ්කර ජීවන රටාවක් ඇත්තේ ය, යම් තැනක අහර වස්ත්‍ර ඉතා දුෂ්කර ලෙස ලැබේද එබඳු තැනක ය. ඔහු දුර්වර්ණ ය, දැකීමට අප්‍රිය ය, අංගවිකල ය, බොහෝ ආබාධ ඇත්තේ ය; කණ ය, හෝ අතපය අඩපණ ය, හෝ කොර ය, හෝ අංශභාග රෝගී ය. අහර, පැන්, වස්ත්‍ර, යාන, මල්, සුවඳ විලවුන්, සයන, ගේ දොර, පහන් සඳහා ලාභ නැත්තේ ය. ඔහු කයින් දුශ්චරිතයෙහි හැසිරෙයි, වචනයෙන් දුශ්චරිතයෙහි හැසිරෙයි, සිතින් දුශ්චරිතයෙහි හැසිරෙයි. ඔහු කයින් දුශ්චරිතයෙහි හැසිර, වචනයෙන් දුශ්චරිතයෙහි හැසිර, සිතින් දුශ්චරිතයෙහි හැසිර, කය බිඳීමෙන් මරණින් මතු අපාය නම් වූ දුර්ගතියට, විනිපාතයට, නිරයට උපදී. ආනන්දය, මෙලෙසින් කළු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් කළු ධර්මයක් උපදවා ගනී.\"\n\n\"ආනන්දය, කළු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් සුදු ධර්මයක් උපදවා ගන්නේ කෙසේද? ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් පහත් කුලයක උපත ලබා සිටී – එනම්: චණ්ඩාල කුලයක හෝ නේසාද කුලයක හෝ වේණ කුලයක හෝ රථකාර කුලයක හෝ පුක්කුස කුලයක හෝ ය. ඔහු දුගී ය, අල්ප වූ අහර බීම ඇත්තේ ය, දුෂ්කර ජීවන රටාවක් ඇත්තේ ය, යම් තැනක අහර වස්ත්‍ර ඉතා දුෂ්කර ලෙස ලැබේද එබඳු තැනක ය. ඔහු දුර්වර්ණ ය, දැකීමට අප්‍රිය ය, අංගවිකල ය, බොහෝ ආබාධ ඇත්තේ ය; කණ ය, හෝ අතපය අඩපණ ය, හෝ කොර ය, හෝ අංශභාග රෝගී ය. අහර, පැන්, වස්ත්‍ර, යාන, මල්, සුවඳ විලවුන්, සයන, ගේ දොර, පහන් සඳහා ලාභ නැත්තේ ය. ඔහු කයින් සුචරිතයෙහි හැසිරෙයි, වචනයෙන් සුචරිතයෙහි හැසිරෙයි, සිතින් සුචරිතයෙහි හැසිරෙයි. ඔහු කයින් සුචරිතයෙහි හැසිර, වචනයෙන් සුචරිතයෙහි හැසිර, සිතින් සුචරිතයෙහි හැසිර, කය බිඳීමෙන් මරණින් මතු සුගතිය නම් වූ ස්වර්ග ලෝකයට උපදී. ආනන්දය, මෙලෙසින් කළු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් සුදු ධර්මයක් උපදවා ගනී.\"\n\n\"ආනන්දය, කළු අභිජාති ස්වභාවය ඇත්තෙක් වෙමින් කළු ද නොවන සුදු ද නොවන නිර්වාණය අවබෝධ කරගන්නේ කෙසේද? ආනන්දය, මෙහි ඇතැම් පුද්ගලයෙක් පහත් කුලයක උපත ලබා සිටී – එනම්: චණ්ඩාල කුලයක හෝ නේසාද කුලයක හෝ වේණ කුලයක හෝ රථකාර කුලයක හෝ පුක්කුස කුලයක හෝ ය. ඔහු දුගී ය, අල්ප වූ අහර බීම ඇත්තේ ය, දුෂ්කර ජීවන රටාවක් ඇත්තේ ය, යම් තැනක අහර වස්ත්‍ර ඉතා දුෂ්කර ලෙස ලැබේද එබඳු තැනක ය. ඔහු දුර්වර්ණ ය, දැකීමට අප්‍රිය ය, අංගවිකල ය. ඔහු කෙස් රැවුල් බහා, කහ සිවුරු හැඳ, ගිහිගෙයින් නික්ම අනගාරික (පැවිදි) බවට පත්වෙයි. මෙසේ පැවිදි වූ ඔහු, සිතෙහි කෙලෙස් වන ප්‍රඥාව දුබල කරන පස් නිවරණ (සිත ආවරණය කරන) ධර්මයන් ප්‍රහීණ කොට, සිව් සතිපට්ඨානයන්හි මැනවින් පිහිටි සිත් ඇත්තෙක් වී, සත් බෝධ්‍යංග (සප්ත බොජ්ඣංග) යථාභූත ලෙස වඩවා, කළු ද නොවන සුදු ද නොවන නිර්වාණය අවබෝධ කරගනී.\"\n\nආනන්දය, මේ අයුරින් කලු උපතක් ඇති (එනම් අකුසල කර්මවලින් උපත ලැබූ) කෙනෙක් කලු නොවූ, සුදු නොවූ නිර්වාණය අවබෝධ කරගනී.\n\nආනන්දය, කෙසේ නම් සුදු උපතක් ඇති (එනම් කුසල කර්මවලින් උපත ලැබූ) කෙනෙක් කලු ධර්මය (එනම් අකුසල කර්ම) අවබෝධ කරගනීද? ආනන්දය, මෙහිලා සමහරෙක් උසස් කුලයක උපත ලබයි – එනම්, ක්ෂත්‍රිය මහසල් කුලයක හෝ බ්‍රාහ්මණ මහසල් කුලයක හෝ ගෘහපති මහසල් කුලයක හෝ වෙයි. ඔවුහු ධනවත්, මහා ධනයෙන් යුක්ත, මහා භෝග සම්පත් ඇති, මහත් වූ රන් රිදී ඇති, මහත් වූ උපකරණ ඇති, මහත් වූ ධන ධාන්‍ය ඇති අය වෙති. එමෙන්ම ඔහු මනරම් රූප සම්පත්තියෙන් යුක්ත, දැකීමට ප්‍රිය උපදවන, පහන් සිත් උපදවන, අග්‍ර වූ ශරීර වර්ණයෙන් හා සිරුරේ පැහැයෙන් යුක්ත වෙයි. ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල් සුවඳ විලවුන්, සයන, ගේ දොර, පහන් ආදිය ලබන්නෙක් වෙයි. ඔහු කයින් දුසිරිත්හි හැසිරෙයි, වචනයෙන් දුසිරිත්හි හැසිරෙයි, සිතින් දුසිරිත්හි හැසිරෙයි. ඔහු කයින් දුසිරිත්හි හැසිර, වචනයෙන් දුසිරිත්හි හැසිර, සිතින් දුසිරිත්හි හැසිර, ශරීරය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරයෙහි උපදී. ආනන්දය, මේ අයුරින් සුදු උපතක් ඇති (එනම් කුසල කර්මවලින් උපත ලැබූ) කෙනෙක් කලු ධර්මය (එනම් අකුසල කර්ම) අවබෝධ කරගනී.\n\nආනන්දය, කෙසේ නම් සුදු උපතක් ඇති (එනම් කුසල කර්මවලින් උපත ලැබූ) කෙනෙක් සුදු ධර්මය (එනම් කුසල කර්ම) අවබෝධ කරගනීද? ආනන්දය, මෙහිලා සමහරෙක් උසස් කුලයක උපත ලබයි – එනම්, ක්ෂත්‍රිය මහසල් කුලයක හෝ බ්‍රාහ්මණ මහසල් කුලයක හෝ ගෘහපති මහසල් කුලයක හෝ වෙයි. ඔවුහු ධනවත්, මහා ධනයෙන් යුක්ත, මහා භෝග සම්පත් ඇති, මහත් වූ රන් රිදී ඇති, මහත් වූ උපකරණ ඇති, මහත් වූ ධන ධාන්‍ය ඇති අය වෙති. එමෙන්ම ඔහු මනරම් රූප සම්පත්තියෙන් යුක්ත, දැකීමට ප්‍රිය උපදවන, පහන් සිත් උපදවන, අග්‍ර වූ ශරීර වර්ණයෙන් හා සිරුරේ පැහැයෙන් යුක්ත වෙයි. ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල් සුවඳ විලවුන්, සයන, ගේ දොර, පහන් ආදිය ලබන්නෙක් වෙයි. ඔහු කයින් සුසිරිත්හි හැසිරෙයි, වචනයෙන් සුසිරිත්හි හැසිරෙයි, සිතින් සුසිරිත්හි හැසිරෙයි. ඔහු කයින් සුසිරිත්හි හැසිර, වචනයෙන් සුසිරිත්හි හැසිර, සිතින් සුසිරිත්හි හැසිර, ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයන්හි උපදී. ආනන්දය, මේ අයුරින් සුදු උපතක් ඇති (එනම් කුසල කර්මවලින් උපත ලැබූ) කෙනෙක් සුදු ධර්මය (එනම් කුසල කර්ම) අවබෝධ කරගනී.\n\nආනන්දය, කෙසේ නම් සුදු උපතක් ඇති (එනම් කුසල කර්මවලින් උපත ලැබූ) කෙනෙක් කලු නොවූ, සුදු නොවූ නිර්වාණය අවබෝධ කරගනීද? ආනන්දය, මෙහිලා සමහරෙක් උසස් කුලයක උපත ලබයි – එනම්, ක්ෂත්‍රිය මහසල් කුලයක හෝ බ්‍රාහ්මණ මහසල් කුලයක හෝ ගෘහපති මහසල් කුලයක හෝ වෙයි. ඔවුහු ධනවත්, මහා ධනයෙන් යුක්ත, මහා භෝග සම්පත් ඇති, මහත් වූ රන් රිදී ඇති, මහත් වූ උපකරණ ඇති, මහත් වූ ධන ධාන්‍ය ඇති අය වෙති. එමෙන්ම ඔහු මනරම් රූප සම්පත්තියෙන් යුක්ත, දැකීමට ප්‍රිය උපදවන, පහන් සිත් උපදවන, අග්‍ර වූ ශරීර වර්ණයෙන් හා සිරුරේ පැහැයෙන් යුක්ත වෙයි. ආහාර, පාන, වස්ත්‍ර, යාන වාහන, මල් සුවඳ විලවුන්, සයන, ගේ දොර, පහන් ආදිය ලබන්නෙක් වෙයි. ඔහු කෙස් රැවුල් කපා කසාවත් හැඳගෙන ගිහිගෙයින් නික්ම අනගාරික (පැවිදි) බවට පැමිණෙයි. එසේ පැවිදි වූ ඔහු, සිතෙහි කෙලෙස් වන, ප්‍රඥාව දුර්වල කරන පංච නීවරණ දුරු කොට, සිහිය පිහිටුවාගත් සිත් ඇතිව සිව් සතිපට්ඨානයන්හි මනාකොට පිහිටා, සප්ත බෝධ්‍යංග ධර්මයන් යථාර්ථාවබෝධයෙන් වඩා, කලු නොවූ, සුදු නොවූ නිර්වාණය අවබෝධ කරගනී. ආනන්දය, මේ අයුරින් සුදු උපතක් ඇති (එනම් කුසල කර්මවලින් උපත ලැබූ) කෙනෙක් කලු නොවූ, සුදු නොවූ නිර්වාණය අවබෝධ කරගනී. ආනන්දය, මේවා සය වැදෑරුම් උපත් (අභිජාති) වෙති.",
      "paliTitle": "Chaḷabhijātisuttaṃ"
    },
    {
      "number": 58,
      "pali": "‘‘Chahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Katamehi chahi? Idha, bhikkhave, bhikkhuno ye āsavā saṃvarā pahātabbā te saṃvarena pahīnā honti, ye āsavā paṭisevanā pahātabbā te paṭisevanāya pahīnā honti, ye āsavā adhivāsanā pahātabbā te adhivāsanāya pahīnā honti, ye āsavā parivajjanā pahātabbā te parivajjanāya pahīnā honti, ye āsavā vinodanā pahātabbā te vinodanāya pahīnā honti, ye āsavā bhāvanā pahātabbā te bhāvanāya pahīnā honti. ‘‘Katame ca, bhikkhave, āsavā saṃvarā pahātabbā ye saṃvarena pahīnā honti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso cakkhundriyasaṃvarasaṃvuto viharati. Yaṃ hissa, bhikkhave, cakkhundriyasaṃvaraṃ asaṃvutassa viharato uppajjeyyuṃ āsavā vighātapariḷāhā, cakkhundriyasaṃvaraṃ saṃvutassa viharato evaṃsa te āsavā vighātapariḷāhā na honti. Paṭisaṅkhā yoniso sotindriya…pe… ghānindriya… jivhindriya… kāyindriya… manindriyasaṃvarasaṃvuto viharati. Yaṃ hissa, bhikkhave, manindriyasaṃvaraṃ asaṃvutassa viharato uppajjeyyuṃ āsavā vighātapariḷāhā, manindriyasaṃvaraṃ saṃvutassa viharato evaṃsa te āsavā vighātapariḷāhā na honti. Ime vuccanti, bhikkhave, āsavā saṃvarā pahātabbā ye saṃvarena pahīnā honti. ‘‘Katame ca, bhikkhave, āsavā paṭisevanā pahātabbā ye paṭisevanāya pahīnā honti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso cīvaraṃ paṭisevati – ‘yāvadeva sītassa paṭighātāya, uṇhassa paṭighātāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ [ḍaṃsa… siriṃsapasamphassānaṃ (sī. syā. kaṃ. pī) ma. ni. 1.23] paṭighātāya, yāvadeva hirikopīnapaṭicchādanatthaṃ’. Paṭisaṅkhā yoniso piṇḍapātaṃ paṭisevati – ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya, vihiṃsūparatiyā brahmacariyānuggahāya, iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro ca’ [phāsuvihāro cāti (sī. syā. kaṃ. pī.)]. Paṭisaṅkhā yoniso senāsanaṃ paṭisevati – ‘yāvadeva sītassa paṭighātāya, uṇhassa paṭighātāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ paṭighātāya, yāvadeva utuparissayavinodanapaṭisallānārāmatthaṃ’. Paṭisaṅkhā yoniso gilānappaccayabhesajjaparikkhāraṃ paṭisevati – ‘yāvadeva uppannānaṃ veyyābādhikānaṃ vedanānaṃ paṭighātāya, abyābajjhaparamatāyā’ti. Yaṃ hissa, bhikkhave, appaṭisevato uppajjeyyuṃ āsavā vighātapariḷāhā, paṭisevato evaṃsa te āsavā vighātapariḷāhā na honti. Ime vuccanti, bhikkhave, āsavā paṭisevanā pahātabbā ye paṭisevanāya pahīnā honti. ‘‘Katame ca, bhikkhave, āsavā adhivāsanā pahātabbā ye adhivāsanāya pahīnā honti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso khamo hoti sītassa uṇhassa, jighacchāya, pipāsāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ, duruttānaṃ durāgatānaṃ vacanapathānaṃ, uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko hoti. Yaṃ hissa, bhikkhave, anadhivāsato uppajjeyyuṃ āsavā vighātapariḷāhā, adhivāsato evaṃsa te āsavā vighātapariḷāhā na honti. Ime vuccanti, bhikkhave, āsavā adhivāsanā pahātabbā ye adhivāsanāya pahīnā honti. ‘‘Katame ca, bhikkhave, āsavā parivajjanā pahātabbā ye parivajjanāya pahīnā honti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso caṇḍaṃ hatthiṃ parivajjeti, caṇḍaṃ assaṃ parivajjeti, caṇḍaṃ goṇaṃ parivajjeti, caṇḍaṃ kukkuraṃ parivajjeti, ahiṃ khāṇuṃ kaṇṭakaṭṭhānaṃ sobbhaṃ papātaṃ candanikaṃ oḷigallaṃ, yathārūpe anāsane nisinnaṃ, yathārūpe agocare carantaṃ, yathārūpe pāpake mitte bhajantaṃ viññū sabrahmacārī pāpakesu ṭhānesu okappeyyuṃ, so tañca anāsanaṃ tañca agocaraṃ te ca pāpake mitte paṭisaṅkhā yoniso parivajjeti. Yaṃ hissa, bhikkhave, aparivajjayato uppajjeyyuṃ āsavā vighātapariḷāhā, parivajjayato evaṃsa te āsavā vighātapariḷāhā na honti. Ime vuccanti, bhikkhave, āsavā parivajjanā pahātabbā ye parivajjanāya pahīnā honti. ‘‘Katame ca, bhikkhave, āsavā vinodanā pahātabbā ye vinodanāya pahīnā honti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gameti, paṭisaṅkhā yoniso uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti byantīkaroti anabhāvaṃ gameti. Yaṃ hissa, bhikkhave, avinodayato uppajjeyyuṃ āsavā vighātapariḷāhā, vinodayato evaṃsa te āsavā vighātapariḷāhā na honti. Ime vuccanti, bhikkhave, āsavā vinodanā pahātabbā ye vinodanāya pahīnā honti. ‘‘Katame ca, bhikkhave, āsavā bhāvanā pahātabbā ye bhāvanāya pahīnā honti? Idha, bhikkhave, bhikkhu paṭisaṅkhā yoniso satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, paṭisaṅkhā yoniso dhammavicayasambojjhaṅgaṃ bhāveti…pe… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Yaṃ hissa, bhikkhave, abhāvayato uppajjeyyuṃ āsavā vighātapariḷāhā, bhāvayato evaṃsa te āsavā vighātapariḷāhā na honti. Ime vuccanti, bhikkhave, āsavā bhāvanā pahātabbā ye bhāvanāya pahīnā honti. ‘‘Imehi kho, bhikkhave, chahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Catutthaṃ.",
      "english": "Bhikkhus, a monk endowed with six qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world. Which six? Here, bhikkhus, a monk's taints that are to be abandoned by restraint are abandoned by restraint. His taints that are to be abandoned by appropriate use are abandoned by appropriate use. His taints that are to be abandoned by endurance are abandoned by endurance. His taints that are to be abandoned by avoidance are abandoned by avoidance. His taints that are to be abandoned by dispelling are abandoned by dispelling. His taints that are to be abandoned by development are abandoned by development.\n\nAnd which, bhikkhus, are the taints to be abandoned by restraint, which are abandoned by restraint? Here, bhikkhus, a monk dwells restrained with the restraint of the eye faculty, having reflected wisely. For, bhikkhus, if he were to dwell unrestrained in the restraint of the eye faculty, taints, vexation, and feverishness would arise in him. But when he dwells restrained in the restraint of the eye faculty, those taints, vexation, and feverishness do not arise in him. Having reflected wisely, he dwells restrained with the restraint of the ear faculty; having reflected wisely, he dwells restrained with the restraint of the nose faculty; having reflected wisely, he dwells restrained with the restraint of the tongue faculty; having reflected wisely, he dwells restrained with the restraint of the body faculty; having reflected wisely, he dwells restrained with the restraint of the mind faculty. For, bhikkhus, if he were to dwell unrestrained in the restraint of the mind faculty, taints, vexation, and feverishness would arise in him. But when he dwells restrained in the restraint of the mind faculty, those taints, vexation, and feverishness do not arise in him. These, bhikkhus, are called the taints to be abandoned by restraint, which are abandoned by restraint.\n\nAnd which, bhikkhus, are the taints to be abandoned by appropriate use, which are abandoned by appropriate use? Here, bhikkhus, a monk makes appropriate use of robes, having reflected wisely: 'Only for warding off cold, for warding off heat, for warding off the touch of gnats, mosquitoes, wind, sun, and creeping things, and solely for covering the parts of the body that cause shame.' Having reflected wisely, he makes appropriate use of almsfood: 'Not for amusement, nor for intoxication, nor for adornment, nor for beautification, but solely for the maintenance and sustenance of this body, for the cessation of harm, and for the support of the spiritual life. Thus, I will eliminate old feelings and not give rise to new feelings, and there will be for me a journey through life, blamelessness, and comfortable dwelling.' Having reflected wisely, he makes appropriate use of lodging: 'Only for warding off cold, for warding off heat, for warding off the touch of gnats, mosquitoes, wind, sun, and creeping things, and solely for dispelling the dangers of the seasons and for the sake of secluded meditation.' Having reflected wisely, he makes appropriate use of requisites for the sick and medicine: 'Only for warding off arisen painful feelings of affliction, and for the attainment of the highest freedom from suffering.' For, bhikkhus, if he were not to make appropriate use, taints, vexation, and feverishness would arise in him. But when he makes appropriate use, those taints, vexation, and feverishness do not arise in him. These, bhikkhus, are called the taints to be abandoned by appropriate use, which are abandoned by appropriate use.\n\nAnd which, bhikkhus, are the taints to be abandoned by endurance, which are abandoned by endurance? Here, bhikkhus, a monk, having reflected wisely, is an endurer of cold, heat, hunger, thirst, the touch of gnats, mosquitoes, wind, sun, and creeping things, of ill-spoken and unwelcome words; he is of a nature to endure arisen bodily feelings that are painful, sharp, severe, piercing, disagreeable, unpleasant, and life-threatening. For, bhikkhus, if he were not to endure, taints, vexation, and feverishness would arise in him. But when he endures, those taints, vexation, and feverishness do not arise in him. These, bhikkhus, are called the taints to be abandoned by endurance, which are abandoned by endurance.\n\nAnd which, bhikkhus, are the taints to be abandoned by avoidance, which are abandoned by avoidance? Here, bhikkhus, a monk, having reflected wisely, avoids a wild elephant, avoids a wild horse, avoids a wild bull, avoids a wild dog; he avoids a snake, a tree stump, a thorny patch, a pit, a precipice, a dirty pool, a cesspool. He wisely reflects and avoids any inappropriate seat, any unsuitable pasture, and any bad friends, which wise fellow-practitioners might consider to be occasions for demerit. For, bhikkhus, if he were not to avoid, taints, vexation, and feverishness would arise in him. But when he avoids, those taints, vexation, and feverishness do not arise in him. These, bhikkhus, are called the taints to be abandoned by avoidance, which are abandoned by avoidance.\n\nAnd which, bhikkhus, are the taints to be abandoned by dispelling, which are abandoned by dispelling?\n\nHere, monks, a monk, having wisely reflected, does not tolerate an arisen thought of sensual desire, but abandons it, dispels it, makes it cease, and brings it to an end. Having wisely reflected, he does not tolerate an arisen thought of ill-will, but abandons it, dispels it, makes it cease, and brings it to an end. Having wisely reflected, he does not tolerate an arisen thought of harming, but abandons it, dispels it, makes it cease, and brings it to an end. Similarly, he does not tolerate any evil, unwholesome states that have arisen, but abandons them, dispels them, makes them cease, and brings them to an end.\n\nFor if, monks, while not dispelling them, defilements, vexations, and fevers would arise for him, then by dispelling them, those defilements, vexations, and fevers do not arise for him. These, monks, are called defilements to be abandoned by eradication, which are abandoned by eradication.\n\nAnd what, monks, are the defilements to be abandoned by cultivation, which are abandoned by cultivation? Here, monks, a monk, having wisely reflected, cultivates the mindfulness factor of awakening, which is based on seclusion, based on dispassion, based on cessation, and culminates in relinquishment. Having wisely reflected, he cultivates the investigation of phenomena factor of awakening, which is based on seclusion, based on dispassion, based on cessation, and culminates in relinquishment. Having wisely reflected, he cultivates the energy factor of awakening, which is based on seclusion, based on dispassion, based on cessation, and culminates in relinquishment. Having wisely reflected, he cultivates the rapture factor of awakening, which is based on seclusion, based on dispassion, based on cessation, and culminates in relinquishment. Having wisely reflected, he cultivates the tranquillity factor of awakening, which is based on seclusion, based on dispassion, based on cessation, and culminates in relinquishment. Having wisely reflected, he cultivates the concentration factor of awakening, which is based on seclusion, based on dispassion, based on cessation, and culminates in relinquishment. Having wisely reflected, he cultivates the equanimity factor of awakening, which is based on seclusion, based on dispassion, based on cessation, and culminates in relinquishment.\n\nFor if, monks, while not cultivating these, defilements, vexations, and fevers would arise for him, then by cultivating them, those defilements, vexations, and fevers do not arise for him. These, monks, are called defilements to be abandoned by cultivation, which are abandoned by cultivation.\n\nMonks, a monk endowed with these six qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, and is an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, ධර්මයන් සයකින් යුක්ත වූ භික්‍ෂුවක් ආහුණෙය්‍ය (දුර සිට ගෙනා දන් පිළිගැනීමට සුදුසු), පාහුණෙය්‍ය (අමුත්තන් වෙනුවෙන් තබා දෙන දන් පිළිගැනීමට සුදුසු), දක්ඛිණෙය්‍ය (දක්‍ෂිණාවට සුදුසු), අඤ්ජලිකරණීය (දෝත නඟා වන්දනා කිරීමට සුදුසු) වේ. ලොවට අනුත්තර වූ පින් කෙතක් වන්නේය. කවර නම් සයකින් ද? මහණෙනි, මෙහිලා භික්‍ෂුවකට සංවරය කරණකොට ගෙන ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ සංවරයෙන් ප්‍රහීණ වෙති. ප්‍රත්‍යවේක්‍ෂා කිරීමෙන් ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ ප්‍රත්‍යවේක්‍ෂාවෙන් ප්‍රහීණ වෙති. ඉවසීමෙන් ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ ඉවසීමෙන් ප්‍රහීණ වෙති. වැළකීමෙන් ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ වැළකීමෙන් ප්‍රහීණ වෙති. දුරුකිරීමෙන් ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ දුරුකිරීමෙන් ප්‍රහීණ වෙති. භා’වනා කිරීමෙන් ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ භා’වනා කිරීමෙන් ප්‍රහීණ වෙති.\n\nමහණෙනි, සංවරයෙන් ප්‍රහීණ කළ යුතු, සංවරයෙන් ප්‍රහීණ වන ආශ්‍රවයෝ කවරහු ද? මහණෙනි, මෙහිලා භික්‍ෂුවක් නුවණින් මෙනෙහි කොට චක්‍ෂුරින්ද්‍රිය සංවරයෙන් සංවරව වාසය කරයි. මහණෙනි, යම් ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ චක්‍ෂුරින්ද්‍රිය සංවරයෙන් අසංවරව වාසය කරන්නාහට උපදිත් නම්, චක්‍ෂුරින්ද්‍රිය සංවරයෙන් සංවරව වාසය කරන්නාහට ඒ ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ නොඋපදිත්. නුවණින් මෙනෙහි කොට ශ්‍රෝතේන්ද්‍රිය සංවරයෙන් සංවරව වාසය කරයි. නුවණින් මෙනෙහි කොට ඝ්‍රාණේන්ද්‍රිය සංවරයෙන් සංවරව වාසය කරයි. නුවණින් මෙනෙහි කොට ජිව්හේන්ද්‍රිය සංවරයෙන් සංවරව වාසය කරයි. නුවණින් මෙනෙහි කොට කායේන්ද්‍රිය සංවරයෙන් සංවරව වාසය කරයි. නුවණින් මෙනෙහි කොට මනින්ද්‍රිය සංවරයෙන් සංවරව වාසය කරයි. මහණෙනි, යම් ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ මනින්ද්‍රිය සංවරයෙන් අසංවරව වාසය කරන්නාහට උපදිත් නම්, මනින්ද්‍රිය සංවරයෙන් සංවරව වාසය කරන්නාහට ඒ ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ නොඋපදිත්. මහණෙනි, මේ ආශ්‍රවයෝ සංවරයෙන් ප්‍රහීණ කළ යුතු, සංවරයෙන් ප්‍රහීණ වන ආශ්‍රවයෝ යැයි කියනු ලැබේ.\n\nමහණෙනි, ප්‍රත්‍යවේක්‍ෂා කිරීමෙන් ප්‍රහීණ කළ යුතු, ප්‍රත්‍යවේක්‍ෂාවෙන් ප්‍රහීණ වන ආශ්‍රවයෝ කවරහු ද? මහණෙනි, මෙහිලා භික්‍ෂුවක් නුවණින් මෙනෙහි කොට සිවුර පරිභෝග කරයි – ‘කෙලෙසින් හෝ සීතල දුරු කිරීමට ද, උණුසුම දුරු කිරීමට ද, මැසි-මදුරු, සුළං, අව්, සර්ප ස්පර්ශයන් දුරු කිරීමට ද, කෙලෙසින් හෝ ලජ්ජා සහගත දේ වසා ගැනීමට ද’ යනුවෙනි. නුවණින් මෙනෙහි කොට පිණ්ඩපාතය පරිභෝග කරයි – ‘දුවා යැමට (නැටුම්, ගැයුම් ආදියට) නොවේ, මත්වීමට නොවේ, සැරසීමට නොවේ, අලංකාර කිරීමට නොවේ. කෙලෙසින් හෝ මේ ශරීරයේ පැවැත්මට, යැපීමට, (හිංසාවට හේතු වන) කායික පීඩා සංසිඳුවීමට, බ්‍රහ්මචාරී ජීවිතයට අනුග්‍රහයක් පිණිස ය. මෙසේ පරණ වේදනාවන් දුරු කරමි, අලුත් වේදනාවන් ඇති නොකරමි. මගේ ජීවිතය යැපෙන්නේය, දෝෂ රහිත බව ද, පහසුවෙන් විසීම ද වන්නේය’ යනුවෙනි. නුවණින් මෙනෙහි කොට සේනාසනය පරිභෝග කරයි – ‘කෙලෙසින් හෝ සීතල දුරු කිරීමට ද, උණුසුම දුරු කිරීමට ද, මැසි-මදුරු, සුළං, අව්, සර්ප ස්පර්ශයන් දුරු කිරීමට ද, කෙලෙසින් හෝ සෘතු උපද්‍රව දුරු කිරීමට ද, ප්‍රතිසංලීන භා’වනාවට ඇලී සිටීමට ද’ යනුවෙනි. නුවණින් මෙනෙහි කොට ගිලන්පස බෙහෙත් පිරිකර පරිභෝග කරයි – ‘කෙලෙසින් හෝ උපන් ව්‍යාධිමත් වේදනාවන් දුරු කිරීමට ද, ව්‍යාධි රහිත පරමාර්ථය පිණිස ද’ යනුවෙනි. මහණෙනි, යම් ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ (මෙසේ) අනුභව නොකරන්නාහට උපදිත් නම්, (මෙසේ) අනුභව කරන්නාහට ඒ ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ නොඋපදිත්. මහණෙනි, මේ ආශ්‍රවයෝ ප්‍රත්‍යවේක්‍ෂා කිරීමෙන් ප්‍රහීණ කළ යුතු, ප්‍රත්‍යවේක්‍ෂාවෙන් ප්‍රහීණ වන ආශ්‍රවයෝ යැයි කියනු ලැබේ.\n\nමහණෙනි, ඉවසීමෙන් ප්‍රහීණ කළ යුතු, ඉවසීමෙන් ප්‍රහීණ වන ආශ්‍රවයෝ කවරහු ද? මහණෙනි, මෙහිලා භික්‍ෂුවක් නුවණින් මෙනෙහි කොට සීතල, උණුසුම, බඩගින්න, පිපාසය, මැසි-මදුරු, සුළං, අව්, සර්ප ස්පර්ශයන්, නපුරු හා දොස් කියන වචන මාර්ගයන්, උපන් වූ දුක් වූ තියුණු වූ රළු වූ කටුක වූ අසතුටු වූ අප්‍රිය වූ ප්‍රාණය නසන ස්වභාවයෙන් යුත් ශාරීරික වේදනාවන් ඉවසන සුළු වේ. මහණෙනි, යම් ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ නොඉවසන්නාහට උපදිත් නම්, ඉවසන්නාහට ඒ ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ නොඋපදිත්. මහණෙනි, මේ ආශ්‍රවයෝ ඉවසීමෙන් ප්‍රහීණ කළ යුතු, ඉවසීමෙන් ප්‍රහීණ වන ආශ්‍රවයෝ යැයි කියනු ලැබේ.\n\nමහණෙනි, වැළකීමෙන් ප්‍රහීණ කළ යුතු, වැළකීමෙන් ප්‍රහීණ වන ආශ්‍රවයෝ කවරහු ද? මහණෙනි, මෙහිලා භික්‍ෂුවක් නුවණින් මෙනෙහි කොට දරුණු ඇතකු ද, දරුණු අශ්වයකු ද, දරුණු ගවයකු ද, දරුණු බල්ලකු ද දුරු කරයි (වැළකී සිටියි). සර්පයකු ද, දඬු කැබැල්ලක් ද, කටු සහිත ස්ථානයක් ද, අගාධයක් ද, පර්වතයකින් පහළට ඇති ගල් බිමක් ද, කානු ද, අපිරිසිදු ස්ථාන ද (වැළකී සිටියි). යම් ආකාරයේ අසුන් ගැනීමකට, යම් ආකාරයේ අගෝචරයක හැසිරීමකට, යම් ආකාරයේ පව් මිතුරන් සේවනය කිරීමට (සම්බන්ධ වීමට) විචක්‍ෂණශීලී සබ්‍රහ්මචාරීන් පව් සිදු වන ස්ථාන ලෙස සලකනු ලබයි ද, හෙතෙම එම අසුන් ගැනීම් ද, එම අගෝචර ද, එම පව් මිතුරන් ද නුවණින් මෙනෙහි කොට දුරු කරයි. මහණෙනි, යම් ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ (මෙසේ) නොවැළකී සිටින්නාහට උපදිත් නම්, (මෙසේ) වැළකී සිටින්නාහට ඒ ආශ්‍රවයෝ හා විඝාත පරිදාහයෝ නොඋපදිත්. මහණෙනි, මේ ආශ්‍රවයෝ වැළකීමෙන් ප්‍රහීණ කළ යුතු, වැළකීමෙන් ප්‍රහීණ වන ආශ්‍රවයෝ යැයි කියනු ලැබේ.\n\nමහණෙනි, දුරුකිරීමෙන් ප්‍රහීණ කළ යුතු, දුරුකිරීමෙන් ප්‍රහීණ වන ආශ්‍රවයෝ කවරහු ද?\n\nමහණෙනි, මෙහිලා භික්ෂුව නුවණින් මෙනෙහි කොට හටගත් කාමවිතර්කය නොඉවසයි, දුරු කරයි, මුළුමනින්ම ඉවත් කරයි, නැති කරයි, අභාවයට පමුණුවයි. නුවණින් මෙනෙහි කොට හටගත් ව්‍යාපාදවිතර්කයද නොඉවසයි, දුරු කරයි, මුළුමනින්ම ඉවත් කරයි, නැති කරයි, අභාවයට පමුණුවයි. නුවණින් මෙනෙහි කොට හටගත් විහිංසාවිතර්කයද නොඉවසයි, දුරු කරයි, මුළුමනින්ම ඉවත් කරයි, නැති කරයි, අභාවයට පමුණුවයි. හටගත් හටගත් පාපී අකුසල ධර්මයන්ද නොඉවසයි, දුරු කරයි, මුළුමනින්ම ඉවත් කරයි, නැති කරයි, අභාවයට පමුණුවයි. මහණෙනි, යම් හෙයකින් ඔහු ඒවා ඉවත් නොකරන්නේ නම් ආශ්‍රවයන්ද, විඝාතයන්ද, පරිදාහයන්ද උපදිනු ඇත. එහෙත් ඒවා ඉවත් කරන කල්හි එම ආශ්‍රවයෝද, විඝාතයෝද, පරිදාහයෝද නොපවතී. මහණෙනි, මේවා ඉවත් කිරීමෙන් ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ යැයි කියනු ලැබේ. ඒවා ඉවත් කිරීමෙන් ප්‍රහීණ වූවාහු වෙති.\n\n\"මහණෙනි, භාවනාවෙන් ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ කවරහුද? යම් ආශ්‍රවයෝ භාවනාවෙන් ප්‍රහීණ වූවාහු වෙත්ද? මහණෙනි, මෙහිලා භික්ෂුව නුවණින් මෙනෙහි කොට විවේකය ඇසුරු කොට ඇති, විරාගය ඇසුරු කොට ඇති, නිරෝධය ඇසුරු කොට ඇති, මුදාහැරීමට නැඹුරු වූ සතිසම්බොජ්ඣංගය වඩයි. නුවණින් මෙනෙහි කොට විවේකය ඇසුරු කොට ඇති, විරාගය ඇසුරු කොට ඇති, නිරෝධය ඇසුරු කොට ඇති, මුදාහැරීමට නැඹුරු වූ ධම්මවිචයසම්බොජ්ඣංගය වඩයි. නුවණින් මෙනෙහි කොට විවේකය ඇසුරු කොට ඇති, විරාගය ඇසුරු කොට ඇති, නිරෝධය ඇසුරු කොට ඇති, මුදාහැරීමට නැඹුරු වූ වීරියසම්බොජ්ඣංගය වඩයි. නුවණින් මෙනෙහි කොට විවේකය ඇසුරු කොට ඇති, විරාගය ඇසුරු කොට ඇති, නිරෝධය ඇසුරු කොට ඇති, මුදාහැරීමට නැඹුරු වූ පීතිසම්බොජ්ඣංගය වඩයි. නුවණින් මෙනෙහි කොට විවේකය ඇසුරු කොට ඇති, විරාගය ඇසුරු කොට ඇති, නිරෝධය ඇසුරු කොට ඇති, මුදාහැරීමට නැඹුරු වූ පස්සද්ධිසම්බොජ්ඣංගය වඩයි. නුවණින් මෙනෙහි කොට විවේකය ඇසුරු කොට ඇති, විරාගය ඇසුරු කොට ඇති, නිරෝධය ඇසුරු කොට ඇති, මුදාහැරීමට නැඹුරු වූ සමාධිසම්බොජ්ඣංගය වඩයි. නුවණින් මෙනෙහි කොට විවේකය ඇසුරු කොට ඇති, විරාගය ඇසුරු කොට ඇති, නිරෝධය ඇසුරු කොට ඇති, මුදාහැරීමට නැඹුරු වූ උපේක්ඛාසම්බොජ්ඣංගය වඩයි. මහණෙනි, යම් හෙයකින් ඔහු ඒවා නොවඩන්නේ නම් ආශ්‍රවයන්ද, විඝාතයන්ද, පරිදාහයන්ද උපදිනු ඇත. එහෙත් ඒවා වඩන කල්හි එම ආශ්‍රවයෝද, විඝාතයෝද, පරිදාහයෝද නොපවතී. මහණෙනි, මේවා භාවනාවෙන් ප්‍රහීණ කළ යුතු ආශ්‍රවයෝ යැයි කියනු ලැබේ. ඒවා භාවනාවෙන් ප්‍රහීණ වූවාහු වෙති.\"\n\n\"මහණෙනි, මේ ධර්ම සයෙන් යුක්ත වූ භික්ෂුව දූරයෙහි සිට ගෙනත් දෙන දන් පිළිගැනීමට සුදුසු වේ. අමුත්තන්ට කරන සත්කාර සම්මාන පිළිගැනීමට සුදුසු වේ. දක්ෂිණා වශයෙන් දෙන දන් පිළිගැනීමට සුදුසු වේ. ඇඳිලි බැඳ වන්දනා කිරීමට සුදුසු වේ. ලෝකයාගේ අනුත්තර පුණ්‍යක්ෂේත්‍රය වන්නේය.\"",
      "paliTitle": "Āsavasuttaṃ"
    },
    {
      "number": 59,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā nātike viharati giñjakāvasathe. Atha kho dārukammiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho dārukammikaṃ gahapatiṃ bhagavā etadavoca – ‘‘api nu te, gahapati, kule dānaṃ dīyatī’’ti? ‘‘Dīyati me, bhante, kule dānaṃ. Tañca kho ye te bhikkhū āraññikā piṇḍapātikā paṃsukūlikā arahanto vā arahattamaggaṃ vā samāpannā, tathārūpesu me, bhante, bhikkhūsu dānaṃ dīyatī’’ti. ‘‘Dujjānaṃ kho etaṃ, gahapati, tayā gihinā kāmabhoginā puttasambādhasayanaṃ ajjhāvasantena, kāsikacandanaṃ paccanubhontena, mālāgandhavilepanaṃ dhārayantena, jātarūparajataṃ sādiyantena ime vā arahanto ime vā arahattamaggaṃ samāpannāti. ‘‘Āraññiko cepi, gahapati, bhikkhu hoti uddhato unnaḷo capalo mukharo vikiṇṇavāco muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Evaṃ so tenaṅgena gārayho. Āraññiko cepi, gahapati, bhikkhu hoti anuddhato anunnaḷo acapalo amukharo avikiṇṇavāco upaṭṭhitassati sampajāno samāhito ekaggacitto saṃvutindriyo. Evaṃ so tenaṅgena pāsaṃso. ‘‘Gāmantavihārī cepi, gahapati, bhikkhu hoti uddhato…pe… evaṃ so tenaṅgena gārayho. Gāmantavihārī cepi, gahapati, bhikkhu hoti anuddhato…pe… evaṃ so tenaṅgena pāsaṃso. ‘‘Piṇḍapātiko cepi, gahapati, bhikkhu hoti uddhato…pe… evaṃ so tenaṅgena gārayho. Piṇḍapātiko cepi, gahapati, bhikkhu hoti anuddhato…pe… evaṃ so tenaṅgena pāsaṃso. ‘‘Nemantaniko cepi, gahapati, bhikkhu hoti uddhato…pe… evaṃ so tenaṅgena gārayho. Nemantaniko cepi, gahapati, bhikkhu hoti anuddhato…pe… evaṃ so tenaṅgena pāsaṃso. ‘‘Paṃsukūliko cepi, gahapati, bhikkhu hoti uddhato…pe… evaṃ so tenaṅgena gārayho. Paṃsukūliko cepi, gahapati, bhikkhu hoti anuddhato…pe… evaṃ so tenaṅgena pāsaṃso. ‘‘Gahapaticīvaradharo cepi, gahapati, bhikkhu hoti uddhato unnaḷo capalo mukharo vikiṇṇavāco muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Evaṃ so tenaṅgena gārayho. Gahapaticīvaradharo cepi, gahapati, bhikkhu hoti anuddhato anunnaḷo acapalo amukharo avikiṇṇavāco upaṭṭhitassati sampajāno samāhito ekaggacitto saṃvutindriyo. Evaṃ so tenaṅgena pāsaṃso. ‘‘Iṅgha tvaṃ, gahapati, saṅghe dānaṃ [dānāni (ka.)] dehi. Saṅghe te dānaṃ dadato cittaṃ pasīdissati. So tvaṃ pasannacitto kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissasī’’ti. ‘‘Esāhaṃ, bhante, ajjatagge saṅghe dānaṃ dassāmī’’ti. Pañcamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying in Nātika at the Brick Hall. Then Dārukammika the householder approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side.\n\nAs Dārukammika the householder sat to one side, the Blessed One said to him, “Householder, is almsgiving practiced in your home?” “Yes, Venerable Sir, almsgiving is practiced in my home. However, Venerable Sir, that alms is given to those monks who are forest dwellers, alms-round practitioners, rag-robe wearers, Arahants, or those who have entered the path to Arahantship.”\n\n“It is difficult for you, householder, as a layperson, one who enjoys sense pleasures, who dwells in a bed crowded with children, who experiences Kasi sandalwood, who wears garlands, scents, and unguents, and who delights in gold and silver, to discern whether these are Arahants or those who have entered the path to Arahantship.”\n\n“Householder, even if a monk is a forest dweller, but is agitated, conceited, fickle, garrulous, scattered in speech, unmindful, without clear comprehension, unconcentrated, with a deluded mind, and with uncontrolled faculties, he is blameworthy on account of those qualities. But householder, even if a monk is a forest dweller, and is not agitated, not conceited, not fickle, not garrulous, not scattered in speech, mindful, with clear comprehension, concentrated, with a unified mind, and with restrained faculties, he is praiseworthy on account of those qualities.”\n\n“Householder, even if a monk is a village dweller, and is agitated, conceited, fickle, garrulous, scattered in speech, unmindful, without clear comprehension, unconcentrated, with a deluded mind, and with uncontrolled faculties, he is blameworthy on account of those qualities. But householder, even if a monk is a village dweller, and is not agitated, not conceited, not fickle, not garrulous, not scattered in speech, mindful, with clear comprehension, concentrated, with a unified mind, and with restrained faculties, he is praiseworthy on account of those qualities.”\n\n“Householder, even if a monk is an alms-round practitioner, and is agitated, conceited, fickle, garrulous, scattered in speech, unmindful, without clear comprehension, unconcentrated, with a deluded mind, and with uncontrolled faculties, he is blameworthy on account of those qualities. But householder, even if a monk is an alms-round practitioner, and is not agitated, not conceited, not fickle, not garrulous, not scattered in speech, mindful, with clear comprehension, concentrated, with a unified mind, and with restrained faculties, he is praiseworthy on account of those qualities.”\n\n“Householder, even if a monk is a recipient of invited meals, and is agitated, conceited, fickle, garrulous, scattered in speech, unmindful, without clear comprehension, unconcentrated, with a deluded mind, and with uncontrolled faculties, he is blameworthy on account of those qualities. But householder, even if a monk is a recipient of invited meals, and is not agitated, not conceited, not fickle, not garrulous, not scattered in speech, mindful, with clear comprehension, concentrated, with a unified mind, and with restrained faculties, he is praiseworthy on account of those qualities.”\n\n“Householder, even if a monk is a rag-robe wearer, and is agitated, conceited, fickle, garrulous, scattered in speech, unmindful, without clear comprehension, unconcentrated, with a deluded mind, and with uncontrolled faculties, he is blameworthy on account of those qualities. But householder, even if a monk is a rag-robe wearer, and is not agitated, not conceited, not fickle, not garrulous, not scattered in speech, mindful, with clear comprehension, concentrated, with a unified mind, and with restrained faculties, he is praiseworthy on account of those qualities.”\n\n“Householder, even if a monk is a wearer of robes provided by householders, and is agitated, conceited, fickle, garrulous, scattered in speech, unmindful, without clear comprehension, unconcentrated, with a deluded mind, and with uncontrolled faculties, he is blameworthy on account of those qualities. But householder, even if a monk is a wearer of robes provided by householders, and is not agitated, not conceited, not fickle, not garrulous, not scattered in speech, mindful, with clear comprehension, concentrated, with a unified mind, and with restrained faculties, he is praiseworthy on account of those qualities.”\n\n“So then, householder, give donations to the Saṅgha. When you give donations to the Saṅgha, your mind will become clear and serene. With a serene mind, with the breaking up of the body, after death, you will be reborn in a good destination, a heavenly world.” “Venerable Sir, from this day forward, I shall give donations to the Saṅgha.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී.\n\nඑක් සමයෙක භාග්‍යවතුන් වහන්සේ නාතික නුවර ගිඤ්ජකාවසථ නම් වූ මාලිගාවේ වැඩවසන සේක. එ කල්හි දාරුකර්මික නම් ගෘහපති භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි දාරුකර්මික ගෘහපතිට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ගෘහපතිය, ඔබගේ නිවසෙහි දන් දෙනු ලබන්නේද?” “ස්වාමීනි, මාගේ නිවසෙහි දන් දෙනු ලැබේ. එහෙත් වනයෙහි වාසය කරන, පිණ්ඩපාතයෙන් යැපෙන, පංසുകൂලික චීවරධාරී වූ, අරහත්වයට පැමිණි හෝ අරහත්වයට මාර්ගයෙහි සිටින යම් භික්ෂූහු වෙත්ද, ස්වාමීනි, එබඳු භික්ෂූන්ට මා විසින් දන් දෙනු ලැබේ.”\n\n“ගෘහපතිය, ඔබ ගිහියෙකු ලෙස, කාමභෝගීව, දරු පිරිසක් සමඟ එකට නිදාගනිමින්, කාසි රටේ චන්දනය ආලේප කරමින්, මල්, සුවඳ විලවුන් ආදිය පැළඳගෙන, රන් රිදී භෝග පරිභෝග කරමින් සිටින කෙනෙකුට, ‘මේ අරහත්හුය, මේ අරහත් මාර්ගයට පැමිණියෝය’ කියා දැනගැනීම අපහසු කාරණයකි.”\n\n“ගෘහපතිය, යම් භික්ෂුවක් ආරාණ්‍යක වුවද, ඔහු උද්ධත නම්, අහංකාර නම්, චපල නම්, වචන බහුල නම්, විසිරුණු වචන ඇති නම්, සිහි නැති නම්, සම්ප්‍රඥා නැති නම්, සමාධි රහිත නම්, විභ්‍රාන්ත සිත් ඇති නම්, ඉන්ද්‍රියයන්ට වසඟ වූ නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු නින්දාවට පත් වේ. යම් භික්ෂුවක් ආරාණ්‍යක වුවද, ඔහු අනුද්ධත නම්, අහංකාර නැති නම්, අචපල නම්, වචන බහුල නැති නම්, විසිරුණු වචන නැති නම්, උපස්ථාපිත සිහි ඇති නම්, සම්ප්‍රඥාවෙන් යුක්ත නම්, සමාධිගත නම්, එකඟ සිත් ඇති නම්, සංවර ඉන්ද්‍රියයන් ඇති නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු ප්‍රශංසාවට පත් වේ.\n\nගෘහපතිය, යම් භික්ෂුවක් ගම් අසල වාසය කරන කෙනෙකු වුවද, ඔහු උද්ධත නම්, අහංකාර නම්, චපල නම්, වචන බහුල නම්, විසිරුණු වචන ඇති නම්, සිහි නැති නම්, සම්ප්‍රඥා නැති නම්, සමාධි රහිත නම්, විභ්‍රාන්ත සිත් ඇති නම්, ඉන්ද්‍රියයන්ට වසඟ වූ නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු නින්දාවට පත් වේ. යම් භික්ෂුවක් ගම් අසල වාසය කරන කෙනෙකු වුවද, ඔහු අනුද්ධත නම්, අහංකාර නැති නම්, අචපල නම්, වචන බහුල නැති නම්, විසිරුණු වචන නැති නම්, උපස්ථාපිත සිහි ඇති නම්, සම්ප්‍රඥාවෙන් යුක්ත නම්, සමාධිගත නම්, එකඟ සිත් ඇති නම්, සංවර ඉන්ද්‍රියයන් ඇති නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු ප්‍රශංසාවට පත් වේ.\n\nගෘහපතිය, යම් භික්ෂුවක් පිණ්ඩපාතයෙන් යැපෙන කෙනෙකු වුවද, ඔහු උද්ධත නම්, අහංකාර නම්, චපල නම්, වචන බහුල නම්, විසිරුණු වචන ඇති නම්, සිහි නැති නම්, සම්ප්‍රඥා නැති නම්, සමාධි රහිත නම්, විභ්‍රාන්ත සිත් ඇති නම්, ඉන්ද්‍රියයන්ට වසඟ වූ නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු නින්දාවට පත් වේ. යම් භික්ෂුවක් පිණ්ඩපාතයෙන් යැපෙන කෙනෙකු වුවද, ඔහු අනුද්ධත නම්, අහංකාර නැති නම්, අචපල නම්, වචන බහුල නැති නම්, විසිරුණු වචන නැති නම්, උපස්ථාපිත සිහි ඇති නම්, සම්ප්‍රඥාවෙන් යුක්ත නම්, සමාධිගත නම්, එකඟ සිත් ඇති නම්, සංවර ඉන්ද්‍රියයන් ඇති නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු ප්‍රශංසාවට පත් වේ.\n\nගෘහපතිය, යම් භික්ෂුවක් ආරාධනා පිළිගන්නා කෙනෙකු වුවද, ඔහු උද්ධත නම්, අහංකාර නම්, චපල නම්, වචන බහුල නම්, විසිරුණු වචන ඇති නම්, සිහි නැති නම්, සම්ප්‍රඥා නැති නම්, සමාධි රහිත නම්, විභ්‍රාන්ත සිත් ඇති නම්, ඉන්ද්‍රියයන්ට වසඟ වූ නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු නින්දාවට පත් වේ. යම් භික්ෂුවක් ආරාධනා පිළිගන්නා කෙනෙකු වුවද, ඔහු අනුද්ධත නම්, අහංකාර නැති නම්, අචපල නම්, වචන බහුල නැති නම්, විසිරුණු වචන නැති නම්, උපස්ථාපිත සිහි ඇති නම්, සම්ප්‍රඥාවෙන් යුක්ත නම්, සමාධිගත නම්, එකඟ සිත් ඇති නම්, සංවර ඉන්ද්‍රියයන් ඇති නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු ප්‍රශංසාවට පත් වේ.\n\nගෘහපතිය, යම් භික්ෂුවක් පංසുകൂලික චීවරධාරී වුවද, ඔහු උද්ධත නම්, අහංකාර නම්, චපල නම්, වචන බහුල නම්, විසිරුණු වචන ඇති නම්, සිහි නැති නම්, සම්ප්‍රඥා නැති නම්, සමාධි රහිත නම්, විභ්‍රාන්ත සිත් ඇති නම්, ඉන්ද්‍රියයන්ට වසඟ වූ නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු නින්දාවට පත් වේ. යම් භික්ෂුවක් පංසുകൂලික චීවරධාරී වුවද, ඔහු අනුද්ධත නම්, අහංකාර නැති නම්, අචපල නම්, වචන බහුල නැති නම්, විසිරුණු වචන නැති නම්, උපස්ථාපිත සිහි ඇති නම්, සම්ප්‍රඥාවෙන් යුක්ත නම්, සමාධිගත නම්, එකඟ සිත් ඇති නම්, සංවර ඉන්ද්‍රියයන් ඇති නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු ප්‍රශංසාවට පත් වේ.\n\nගෘහපතිය, යම් භික්ෂුවක් ගෘහපති චීවරධාරී වුවද, ඔහු උද්ධත නම්, අහංකාර නම්, චපල නම්, වචන බහුල නම්, විසිරුණු වචන ඇති නම්, සිහි නැති නම්, සම්ප්‍රඥා නැති නම්, සමාධි රහිත නම්, විභ්‍රාන්ත සිත් ඇති නම්, ඉන්ද්‍රියයන්ට වසඟ වූ නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු නින්දාවට පත් වේ. යම් භික්ෂුවක් ගෘහපති චීවරධාරී වුවද, ඔහු අනුද්ධත නම්, අහංකාර නැති නම්, අචපල නම්, වචන බහුල නැති නම්, විසිරුණු වචන නැති නම්, උපස්ථාපිත සිහි ඇති නම්, සම්ප්‍රඥාවෙන් යුක්ත නම්, සමාධිගත නම්, එකඟ සිත් ඇති නම්, සංවර ඉන්ද්‍රියයන් ඇති නම්, එසේ නම්, ඒ ගුණය නිසා ඔහු ප්‍රශංසාවට පත් වේ.\n\n“ගෘහපතිය, එසේ නම් ඔබ සඟරුවනට දන් දෙන්න. සඟරුවනට දන් දෙන ඔබට සිත පහදින්නේය. ඔබ පහන් සිතින් කය බිඳී මරණින් මතු සුගති ස්වර්ග ලෝකයෙහි උපදින්නේය.” “ස්වාමීනි, අද පටන් මම සඟරුවනට දන් දෙන්නෙමි” යි ඔහු පැවසීය.\n\nපස්වැන්නයි.",
      "paliTitle": "Dārukammikasuttaṃ"
    },
    {
      "number": 60,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tena kho pana samayena sambahulā therā bhikkhū pacchābhattaṃ piṇḍapātapaṭikkantā maṇḍalamāḷe sannisinnā sannipatitā abhidhammakathaṃ kathenti. Tatra sudaṃ āyasmā citto hatthisāriputto therānaṃ bhikkhūnaṃ abhidhammakathaṃ kathentānaṃ antarantarā kathaṃ opāteti. Atha kho āyasmā mahākoṭṭhiko āyasmantaṃ cittaṃ hatthisāriputtaṃ etadavoca – ‘‘māyasmā citto hatthisāriputto therānaṃ bhikkhūnaṃ abhidhammakathaṃ kathentānaṃ antarantarā kathaṃ opātesi, yāva kathāpariyosānaṃ āyasmā citto āgametū’’ti. Evaṃ vutte āyasmato cittassa hatthisāriputtassa sahāyakā bhikkhū āyasmantaṃ mahākoṭṭhikaṃ etadavocuṃ – ‘‘māyasmā mahākoṭṭhiko āyasmantaṃ cittaṃ hatthisāriputtaṃ apasādesi, paṇḍito āyasmā citto hatthisāriputto. Pahoti cāyasmā citto hatthisāriputto therānaṃ bhikkhūnaṃ abhidhammakathaṃ kathetu’’nti. ‘‘Dujjānaṃ kho etaṃ, āvuso, parassa cetopariyāyaṃ ajānantehi. Idhāvuso, ekacco puggalo tāvadeva soratasorato hoti, nivātanivāto hoti, upasantupasanto hoti, yāva satthāraṃ upanissāya viharati aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ. Yato ca kho so vapakassateva satthārā, vapakassati garuṭṭhāniyehi sabrahmacārīhi, so saṃsaṭṭho viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi raññā rājamahāmattehi titthiyehi titthiyasāvakehi. Tassa saṃsaṭṭhassa vissatthassa pākatassa bhassamanuyuttassa viharato rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena sikkhaṃ paccakkhāya hīnāyāvattati. ‘‘Seyyathāpi, āvuso, goṇo kiṭṭhādo dāmena vā baddho [ārāme vā bandho (ka.)] vaje vā oruddho. Yo nu kho, āvuso, evaṃ vadeyya – ‘na dānāyaṃ goṇo kiṭṭhādo punadeva kiṭṭhaṃ otarissatī’ti, sammā nu kho so, āvuso, vadamāno vadeyyā’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Ṭhānañhetaṃ, āvuso, vijjati, yaṃ so goṇo kiṭṭhādo dāmaṃ vā chetvā vajaṃ vā bhinditvā, atha punadeva kiṭṭhaṃ otareyyāti. Evamevaṃ kho, āvuso, idhekacco puggalo tāvadeva soratasorato hoti, nivātanivāto hoti, upasantupasanto hoti yāva satthāraṃ upanissāya viharati aññataraṃ vā garuṭṭhāniyaṃ sabrahmacāriṃ. Yato ca kho so vapakassateva satthārā, vapakassati garuṭṭhāniyehi sabrahmacārīhi, so saṃsaṭṭho viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi raññā rājamahāmattehi titthiyehi titthiyasāvakehi. Tassa saṃsaṭṭhassa vissatthassa pākatassa bhassamanuyuttassa viharato rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena sikkhaṃ paccakkhāya hīnāyāvattati. ‘‘Idha panāvuso, ekacco puggalo vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. So ‘lābhimhi paṭhamassa jhānassā’ti saṃsaṭṭho viharati bhikkhūhi…pe… sikkhaṃ paccakkhāya hīnāyāvattati. Seyyathāpi, āvuso, cātumahāpathe thullaphusitako devo vassanto [thullaphusitake deve vassante (ka.)] rajaṃ antaradhāpeyya, cikkhallaṃ pātukareyya. Yo nu kho, āvuso, evaṃ vadeyya – ‘na dāni amusmiṃ [amukasmiṃ (ka.)] cātumahāpathe punadeva rajo pātubhavissatī’ti, sammā nu kho so, āvuso, vadamāno vadeyyā’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Ṭhānañhetaṃ, āvuso, vijjati, yaṃ amusmiṃ cātumahāpathe manussā vā atikkameyyuṃ, gopasū vā atikkameyyuṃ, vātātapo vā snehagataṃ pariyādiyeyya, atha punadeva rajo pātubhaveyyāti. Evamevaṃ kho, āvuso, idhekacco puggalo vivicceva kāmehi…pe… paṭhamaṃ jhānaṃ upasampajja viharati. So ‘lābhimhi paṭhamassa jhānassā’ti saṃsaṭṭho viharati bhikkhūhi…pe… sikkhaṃ paccakkhāya hīnāyāvattati. ‘‘Idha panāvuso, ekacco puggalo vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. So ‘lābhimhi dutiyassa jhānassā’ti saṃsaṭṭho viharati bhikkhūhi…pe… sikkhaṃ paccakkhāya hīnāyāvattati. Seyyathāpi, āvuso, gāmassa vā nigamassa vā avidūre mahantaṃ taḷākaṃ. Tattha thullaphusitako devo vuṭṭho sippisambukampi sakkharakaṭhalampi antaradhāpeyya. Yo nu kho, āvuso, evaṃ vadeyya – ‘na dāni amusmiṃ taḷāke punadeva sippisambukā vā sakkharakaṭhalā vā pātubhavissantī’ti, sammā nu kho so, āvuso, vadamāno vadeyyā’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Ṭhānañhetaṃ, āvuso, vijjati, yaṃ amusmiṃ taḷāke manussā vā piveyyuṃ, gopasū vā piveyyuṃ, vātātapo vā snehagataṃ pariyādiyeyya, atha punadeva sippisambukāpi sakkharakaṭhalāpi pātubhaveyyunti. Evamevaṃ kho, āvuso, idhekacco puggalo vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. So ‘lābhimhi dutiyassa jhānassā’ti saṃsaṭṭho viharati bhikkhūhi…pe… sikkhaṃ paccakkhāya hīnāyāvattati. ‘‘Idha panāvuso, ekacco puggalo pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. So ‘lābhimhi tatiyassa jhānassā’ti saṃsaṭṭho viharati bhikkhūhi…pe… sikkhaṃ paccakkhāya hīnāyāvattati. Seyyathāpi, āvuso, purisaṃ paṇītabhojanaṃ bhuttāviṃ ābhidosikaṃ bhojanaṃ nacchādeyya. Yo nu kho, āvuso, evaṃ vadeyya – ‘na dāni amuṃ purisaṃ punadeva bhojanaṃ chādessatī’ti, sammā nu kho so, āvuso, vadamāno vadeyyā’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Ṭhānañhetaṃ, āvuso, vijjati, amuṃ purisaṃ paṇītabhojanaṃ bhuttāviṃ yāvassa sā ojā kāye ṭhassati tāva na aññaṃ bhojanaṃ chādessati. Yato ca khvassa sā ojā antaradhāyissati, atha punadeva taṃ bhojanaṃ chādeyyāti. Evamevaṃ kho, āvuso, idhekacco puggalo pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. So ‘lābhimhi tatiyassa jhānassā’ti saṃsaṭṭho viharati bhikkhūhi…pe… sikkhaṃ paccakkhāya hīnāyāvattati. ‘‘Idha, panāvuso, ekacco puggalo sukhassa ca pahānā dukkhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. So ‘lābhimhi catutthassa jhānassā’ti saṃsaṭṭho viharati bhikkhūhi…pe… sikkhaṃ paccakkhāya hīnāyāvattati. Seyyathāpi, āvuso, pabbatasaṅkhepe udakarahado nivāto vigataūmiko. Yo nu kho, āvuso, evaṃ vadeyya – ‘na dāni amusmiṃ udakarahade punadeva ūmi pātubhavissatī’ti, sammā nu kho so, āvuso, vadamāno vadeyyā’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Ṭhānañhetaṃ, āvuso, vijjati, yā puratthimāya disāya āgaccheyya bhusā vātavuṭṭhi. Sā tasmiṃ udakarahade ūmiṃ janeyya. Yā pacchimāya disāya āgaccheyya…pe… yā uttarāya disāya āgaccheyya… yā dakkhiṇāya disāya āgaccheyya bhusā vātavuṭṭhi. Sā tasmiṃ udakarahade ūmiṃ janeyyāti. Evamevaṃ kho, āvuso, idhekacco puggalo sukhassa ca pahānā dukkhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. So ‘lābhimhi catutthassa jhānassā’ti saṃsaṭṭho viharati bhikkhūhi…pe… sikkhaṃ paccakkhāya hīnāyāvattati. ‘‘Idha, panāvuso, ekacco puggalo sabbanimittānaṃ amanasikārā animittaṃ cetosamādhiṃ upasampajja viharati. So ‘lābhimhi animittassa cetosamādhissā’ti saṃsaṭṭho viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi raññā rājamahāmattehi titthiyehi titthiyasāvakehi. Tassa saṃsaṭṭhassa vissatthassa pākatassa bhassamanuyuttassa viharato rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena sikkhaṃ paccakkhāya hīnāyāvattati. Seyyathāpi, āvuso, rājā vā rājamahāmatto vā caturaṅginiyā senāya addhānamaggappaṭipanno aññatarasmiṃ vanasaṇḍe ekarattiṃ vāsaṃ upagaccheyya. Tatra [tattha (sī. pī.)] hatthisaddena assasaddena rathasaddena pattisaddena bheripaṇavasaṅkhatiṇavaninnādasaddena cīrikasaddo [ciriḷikāsaddo (sī. syā. kaṃ. pī.)] antaradhāyeyya [antaradhāpeyya (syā. pī. ka.)]. Yo nu kho, āvuso, evaṃ vadeyya – ‘na dāni amusmiṃ vanasaṇḍe punadeva cīrikasaddo pātubhavissatī’ti, sammā nu kho so, āvuso, vadamāno vadeyyā’’ti? ‘‘No hidaṃ, āvuso’’. ‘‘Ṭhānañhetaṃ, āvuso, vijjati, yaṃ so rājā vā rājamahāmatto vā tamhā vanasaṇḍā pakkameyya, atha punadeva cīrikasaddo pātubhaveyyāti. Evamevaṃ kho, āvuso, idhekacco puggalo sabbanimittānaṃ amanasikārā animittaṃ cetosamādhiṃ upasampajja viharati. So ‘lābhimhi animittassa cetosamādhissā’ti saṃsaṭṭho viharati bhikkhūhi bhikkhunīhi upāsakehi upāsikāhi raññā rājamahāmattehi titthiyehi titthiyasāvakehi. Tassa saṃsaṭṭhassa vissatthassa pākatassa bhassamanuyuttassa viharato rāgo cittaṃ anuddhaṃseti. So rāgānuddhaṃsitena cittena sikkhaṃ paccakkhāya hīnāyāvattatī’’ti. Atha kho āyasmā citto hatthisāriputto aparena samayena sikkhaṃ paccakkhāya hīnāyāvattati. Atha kho cittassa hatthisāriputtassa sahāyakā bhikkhū yenāyasmā mahākoṭṭhiko tenupasaṅkamiṃsu; upasaṅkamitvā āyasmantaṃ mahākoṭṭhikaṃ etadavocuṃ – ‘‘kiṃ nu kho āyasmatā mahākoṭṭhikena citto hatthisāriputto cetasā ceto paricca vidito – ‘imāsañca imāsañca vihārasamāpattīnaṃ citto hatthisāriputto lābhī, atha ca pana sikkhaṃ paccakkhāya hīnāyāvattissatī’ti; udāhu devatā etamatthaṃ ārocesuṃ – ‘citto, bhante, hatthisāriputto imāsañca imāsañca vihārasamāpattīnaṃ lābhī, atha ca pana sikkhaṃ paccakkhāya hīnāyāvattissatī’’’ti? ‘‘Cetasā ceto paricca vidito me, āvuso – ‘citto hatthisāriputto imāsañca imāsañca vihārasamāpattīnaṃ lābhī, atha ca pana sikkhaṃ paccakkhāya hīnāyāvattissatī’ti. Devatāpi me etamatthaṃ ārocesuṃ – ‘citto, bhante, hatthisāriputto imāsañca imāsañca vihārasamāpattīnaṃ lābhī, atha ca pana sikkhaṃ paccakkhāya hīnāyāvattissatī’’ti. Atha kho cittassa hatthisāriputtassa sahāyakā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘citto, bhante, hatthisāriputto imāsañca imāsañca vihārasamāpattīnaṃ lābhī, atha ca pana sikkhaṃ paccakkhāya hīnāyāvattatī’’ti. ‘‘Na, bhikkhave, citto ciraṃ sarissati [padissati (ka.)] nekkhammassā’’ti. Atha kho citto hatthisāriputto nacirasseva kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbaji. Atha kho āyasmā citto hatthisāriputto eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā citto hatthisāriputto arahataṃ ahosīti. Chaṭṭhaṃ.",
      "english": "Thus have I heard – on one occasion the Blessed One was staying in Bārāṇasī, at Isipatana in the Deer Park. Now at that time, many elder bhikkhus, after their meal, having returned from their alms round, had gathered and were seated together in the round hall, discussing the higher Dhamma. There, indeed, the Venerable Citta Hatthisāriputta interrupted the elder bhikkhus here and there while they were discussing the higher Dhamma. Then the Venerable Mahākoṭṭhika said to the Venerable Citta Hatthisāriputta: “Venerable Citta Hatthisāriputta, do not interrupt the elder bhikkhus while they are discussing the higher Dhamma. Let Venerable Citta wait until the discussion is finished.” When this was said, the bhikkhus who were friends of Venerable Citta Hatthisāriputta said to Venerable Mahākoṭṭhika: “Venerable Mahākoṭṭhika, do not disparage Venerable Citta Hatthisāriputta. Venerable Citta Hatthisāriputta is wise. Indeed, Venerable Citta Hatthisāriputta is capable of discussing the higher Dhamma with the elder bhikkhus.”\n\n“Friends, it is indeed difficult to know, when one does not discern another’s mental states. Here, friends, some individual is extremely gentle, extremely humble, extremely tranquil, as long as he lives in dependence on the Teacher or some other respected fellow monastic. But when he separates himself from the Teacher, separates himself from the respected fellow monastics, he mixes freely with bhikkhus, bhikkhunīs, laymen, laywomen, kings, royal ministers, sectarians, and their disciples. As he lives mingled, confident, unreserved, and prone to idle chatter, lust stains his mind. With his mind stained by lust, he renounces the training and reverts to a lower state.\n\n“Just as, friends, a crop-eating bull is tied with a rope or confined in a pen. If someone, friends, were to say: ‘This crop-eating bull will certainly not enter the crops again,’ would he, friends, be speaking correctly?” “No, friends.” “Friends, it is possible for that crop-eating bull, having broken its rope or burst through its pen, to enter the crops again. In the same way, friends, some individual here is extremely gentle, extremely humble, extremely tranquil, as long as he lives in dependence on the Teacher or some other respected fellow monastic. But when he separates himself from the Teacher, separates himself from the respected fellow monastics, he mixes freely with bhikkhus, bhikkhunīs, laymen, laywomen, kings, royal ministers, sectarians, and their disciples. As he lives mingled, confident, unreserved, and prone to idle chatter, lust stains his mind. With his mind stained by lust, he renounces the training and reverts to a lower state.\n\n“Here again, friends, some individual, quite secluded from sensual pleasures and unwholesome states, enters and abides in the first jhāna. Thinking, ‘I am an obtainer of the first jhāna,’ he mixes freely with bhikkhus, bhikkhunīs, laymen, laywomen, kings, royal ministers, sectarians, and their disciples. As he lives mingled, confident, unreserved, and prone to idle chatter, lust stains his mind. With his mind stained by lust, he renounces the training and reverts to a lower state. Just as, friends, on a crossroads, when a heavy rain falls, it would cause the dust to disappear and mud to appear. If someone, friends, were to say: ‘Now, on that crossroads, dust will certainly not reappear,’ would he, friends, be speaking correctly?” “No, friends.” “Friends, it is possible for dust to reappear on that crossroads, if people or cattle were to pass over it, or if wind and sun were to dry up its moisture. In the same way, friends, some individual here, quite secluded from sensual pleasures and unwholesome states, enters and abides in the first jhāna. Thinking, ‘I am an obtainer of the first jhāna,’ he mixes freely with bhikkhus, bhikkhunīs, laymen, laywomen, kings, royal ministers, sectarians, and their disciples. As he lives mingled, confident, unreserved, and prone to idle chatter, lust stains his mind. With his mind stained by lust, he renounces the training and reverts to a lower state.\n\n“Here again, friends, some individual, with the stilling of applied thought and sustained thought, enters and abides in the second jhāna. Thinking, ‘I am an obtainer of the second jhāna,’ he mixes freely with bhikkhus, bhikkhunīs, laymen, laywomen, kings, royal ministers, sectarians, and their disciples. As he lives mingled, confident, unreserved, and prone to idle chatter, lust stains his mind. With his mind stained by lust, he renounces the training and reverts to a lower state. Just as, friends, not far from a village or town, there is a large pond. If a heavy rain were to fall there, it would cause even the shells and gravel to disappear. If someone, friends, were to say: ‘Now, in that pond, shells or gravel will certainly not reappear,’ would he, friends, be speaking correctly?” “No, friends.”\n\n“It is possible, friend, that in a certain pond, people might drink, or cattle might drink, or wind and sun might dry up the moisture, and yet, once again, shells and pebbles might appear. Even so, friend, some individual here, with the subsiding of initial thought and discursive thought, attains and abides in the second jhāna. He, thinking ‘I am an attainer of the second jhāna,’ associates with monastics... and then rejects the training and falls back to a lower state.\n\n“Here again, friend, some individual, with the fading of rapture, attains and abides in the third jhāna. He, thinking ‘I am an attainer of the third jhāna,’ associates with monastics... and then rejects the training and falls back to a lower state. Just as, friend, for a person who has eaten excellent food, ordinary food would not appeal. If someone, friend, were to say thus: ‘Now, ordinary food will never again appeal to that person,’ would he, friend, be speaking rightly?” “No, indeed, friend.” “It is possible, friend, for that person who has eaten excellent food, that as long as that nourishment remains in his body, other food will not appeal. But when that nourishment disappears, then that food might appeal to him again. Even so, friend, some individual here, with the fading of rapture, attains and abides in the third jhāna. He, thinking ‘I am an attainer of the third jhāna,’ associates with monastics... and then rejects the training and falls back to a lower state.\n\n“Here again, friend, some individual, by the abandoning of pleasure and the abandoning of pain, attains and abides in the fourth jhāna. He, thinking ‘I am an attainer of the fourth jhāna,’ associates with monastics... and then rejects the training and falls back to a lower state. Just as, friend, in a mountain-enclosed area, a pool of water might be sheltered from the wind and free from waves. If someone, friend, were to say thus: ‘Now, waves will never again appear in that pool of water,’ would he, friend, be speaking rightly?” “No, indeed, friend.” “It is possible, friend, that a strong wind and rain might come from the eastern direction. That might generate waves in that pool of water. Or a strong wind and rain might come from the western direction... or from the northern direction... or from the southern direction. That might generate waves in that pool of water. Even so, friend, some individual here, by the abandoning of pleasure and the abandoning of pain, attains and abides in the fourth jhāna. He, thinking ‘I am an attainer of the fourth jhāna,’ associates with monastics... and then rejects the training and falls back to a lower state.\n\n“Here again, friend, some individual, by not attending to any signs, attains and abides in the signless concentration of mind. He, thinking ‘I am an attainer of the signless concentration of mind,’ associates with monastics, nuns, male lay followers, female lay followers, kings, royal ministers, sectarians, and disciples of sectarians. To him who is thus associated, relaxed, open, and given to talk, as he dwells, lust defiles his mind. He, with his mind thus defiled by lust, rejects the training and falls back to a lower state. Just as, friend, a king or a royal minister, with a four-fold army, might be proceeding along a road, and might encamp for a night in some forest grove. There, by the sound of elephants, the sound of horses, the sound of chariots, the sound of infantry, and the sound of drums, kettle-drums, conchs, and tom-toms, the sound of the cicadas would be obliterated. If someone, friend, were to say thus: ‘Now, the sound of cicadas will never again appear in that forest grove,’ would he, friend, be speaking rightly?” “No, indeed, friend.” “It is possible, friend, that when that king or royal minister departs from that forest grove, then the sound of cicadas might reappear again. Even so, friend, some individual here, by not attending to any signs, attains and abides in the signless concentration of mind. He, thinking ‘I am an attainer of the signless concentration of mind,’ associates with monastics, nuns, male lay followers, female lay followers, kings, royal ministers, sectarians, and disciples of sectarians. To him who is thus associated, relaxed, open, and given to talk, as he dwells, lust defiles his mind. He, with his mind thus defiled by lust, rejects the training and falls back to a lower state.”\n\nThen, indeed, Venerable Citta Hatthisariputta, after some time, rejected the training and fell back to a lower state.\n\nThen, the companion monastics of Citta Hatthisāriputta approached the Venerable Mahākoṭṭhika. Having approached, they said this to the Venerable Mahākoṭṭhika: “Was it that the Venerable Mahākoṭṭhika knew Citta Hatthisāriputta by directly comprehending his mind with his own mind, understanding: ‘Citta Hatthisāriputta is a recipient of these and these attainments of abiding, yet he will renounce the training and return to a lower state’? Or did deities report this matter, saying: ‘Venerable sir, Citta Hatthisāriputta is a recipient of these and these attainments of abiding, yet he will renounce the training and return to a lower state’?”\n\n“Friends, I knew Citta Hatthisāriputta by directly comprehending his mind with my own mind, understanding: ‘Citta Hatthisāriputta is a recipient of these and these attainments of abiding, yet he will renounce the training and return to a lower state.’ Deities also reported this matter to me, saying: ‘Venerable sir, Citta Hatthisāriputta is a recipient of these and these attainments of abiding, yet he will renounce the training and return to a lower state.’”\n\nThen, the companion monastics of Citta Hatthisāriputta approached the Blessed One. Having approached, they bowed to the Blessed One and sat down to one side. Having sat down to one side, those monastics said this to the Blessed One: “Venerable sir, Citta Hatthisāriputta is a recipient of these and these attainments of abiding, yet he has renounced the training and returned to a lower state.”\n\n“Monastics, Citta will not long remain estranged from the path of renunciation.”\n\nThen, not long after, Citta Hatthisāriputta shaved off his hair and beard, put on saffron robes, and went forth from the home life into homelessness. Then, the Venerable Citta Hatthisāriputta, living alone, secluded, diligent, ardent, and resolute, not long after, by his own direct knowledge, in this very life, realized and attained the unsurpassed culmination of the spiritual life—for the sake of which young men of good family rightly go forth from the home life into homelessness—and he abided therein.\n\nHe directly knew: “Birth is destroyed, the spiritual life has been lived, what had to be done has been done, there is no further state of being for this world.” And so, the Venerable Citta Hatthisāriputta became one of the Arahants.",
      "sinhala": "මා විසින් මෙසේ අසන ලදි – එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ බරණැස ඉසිපතනයේ මිගදාය නම් වූ ස්ථානයේ වැඩ සිටි සේක. එකල බොහෝ ථේර භික්ෂූහු දහවල් දන් වළඳා, පිඬුසිඟා වැඩ, මණ්ඩලමාලයේ රැස්වී වාඩි වී, අභිධර්ම කථාවක් කරමින් සිටියහ. එහිදී ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේ ථේර භික්ෂූන් වහන්සේලා අභිධර්ම කථාවක් කරද්දී අතරින් පතර කථා කරන්නට විය. එවිට ආයුෂ්මත් මහාකෝට්ඨික ස්ථවිරයන් වහන්සේ ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ පැවසූ සේක: “ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්ස, ථේර භික්ෂූන් වහන්සේලා අභිධර්ම කථාවක් කරද්දී අතරින් පතර කථා නොකරනු මැනව. ආයුෂ්මත් චිත්ත ස්ථවිරයන් වහන්ස, කථාව අවසන් වනතුරු ඉවසනු මැනව.” එසේ පැවසූ විට ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේගේ මිත්‍ර භික්ෂූහු ආයුෂ්මත් මහාකෝට්ඨික ස්ථවිරයන් වහන්සේට මෙසේ පැවසූහ: “ආයුෂ්මත් මහාකෝට්ඨික ස්ථවිරයන් වහන්ස, ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේට අවමන් නොකරනු මැනව. ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේ පණ්ඩිතයෙකි. ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේට ථේර භික්ෂූන් වහන්සේලා සමඟ අභිධර්ම කථා කිරීමට හැකියාව ඇත.”\n\n“ඇවැත්නි, අනුන්ගේ සිත්වල ගති ස්වභාවය නොදැන සිටින අයට එය තේරුම් ගැනීම දුෂ්කර දෙයකි. ඇවැත්නි, මෙහි ඇතැම් පුද්ගලයෙක් ශාස්තෘන් වහන්සේ හෝ ගෞරවණීය බ්‍රහ්මචාරියෙකු ඇසුරු කරගෙන සිටින තාක් ඉතාමත් ශාන්තව, ඉතාමත් නිහතමානීව, ඉතාමත් සංසිඳී වාසය කරයි. නමුත් ඔහු ශාස්තෘන් වහන්සේගෙන් ඈත් වූ විටත්, ගෞරවණීය බ්‍රහ්මචාරීන්ගෙන් ඈත් වූ විටත්, ඔහු භික්ෂූන්, භික්ෂුණීන්, උපාසකයන්, උපාසිකාවන්, රජවරුන්, රාජ අමාත්‍යවරුන්, තීර්ථකයන් සහ ඔවුන්ගේ ශ්‍රාවකයන් සමඟ මිශ්‍ර වී වාසය කරයි. එසේ මිශ්‍රව, විශ්වාසවන්තව, ප්‍රකටව, කථාබහෙහි යෙදී වාසය කරන ඔහුගේ සිත රාගය විසින් කිලිටි කරයි. ඔහු රාගයෙන් කිලිටි වූ සිතින් ශික්ෂාව අත්හැර හීන තත්ත්වයකට පත් වේ.\n\n“ඇවැත්නි, යම් සේ ධාන්‍ය කන ගවයෙක් ලණුවකින් බැඳ හෝ ගාලක කොටු කර හෝ සිටී ද, ඇවැත්නි, යමෙක් මෙසේ කියන්නේ නම්: ‘දැන් මේ ධාන්‍ය කන ගවයා නැවත ධාන්‍යයට නොයනු ඇතැයි’ කියා, ඇවැත්නි, ඔහු එසේ කියන්නේ නිවැරදිව ද?” “නැත, ඇවැත්නි.” “ඇවැත්නි, ඒ ධාන්‍ය කන ගවයා ලණුව කඩා හෝ ගාල බිඳ දමා හෝ නැවත ධාන්‍යයට ඇතුළු විය හැකි බවට ඉඩක් ඇත. ඇවැත්නි, එලෙසින්ම මෙහි ඇතැම් පුද්ගලයෙක් ශාස්තෘන් වහන්සේ හෝ ගෞරවණීය බ්‍රහ්මචාරියෙකු ඇසුරු කරගෙන සිටින තාක් ඉතාමත් ශාන්තව, ඉතාමත් නිහතමානීව, ඉතාමත් සංසිඳී වාසය කරයි. නමුත් ඔහු ශාස්තෘන් වහන්සේගෙන් ඈත් වූ විටත්, ගෞරවණීය බ්‍රහ්මචාරීන්ගෙන් ඈත් වූ විටත්, ඔහු භික්ෂූන්, භික්ෂුණීන්, උපාසකයන්, උපාසිකාවන්, රජවරුන්, රාජ අමාත්‍යවරුන්, තීර්ථකයන් සහ ඔවුන්ගේ ශ්‍රාවකයන් සමඟ මිශ්‍ර වී වාසය කරයි. එසේ මිශ්‍රව, විශ්වාසවන්තව, ප්‍රකටව, කථාබහෙහි යෙදී වාසය කරන ඔහුගේ සිත රාගය විසින් කිලිටි කරයි. ඔහු රාගයෙන් කිලිටි වූ සිතින් ශික්ෂාව අත්හැර හීන තත්ත්වයකට පත් වේ.\n\n“ඇවැත්නි, මෙහි ඇතැම් පුද්ගලයෙක් කාමයන්ගෙන් වෙන්ව... (ආදී වශයෙන්)... පළමු ධ්‍යානයට එළඹ වාසය කරයි. ඔහු ‘මම පළමු ධ්‍යානය ලැබූ කෙනෙක්මි’යි සිතා භික්ෂූන් සමඟ මිශ්‍ර වී... (ආදී වශයෙන්)... ශික්ෂාව අත්හැර හීන තත්ත්වයකට පත් වේ. ඇවැත්නි, යම් සේ සතර මහා මාවතක ඝනව වසින වැස්සක් දූවිලි නැති කර, මඩ ඇති කරන්නේ ද, ඇවැත්නි, යමෙක් මෙසේ කියන්නේ නම්: ‘දැන් ඒ සතර මහා මාවතේ නැවත දූවිලි ඇති නොවනු ඇතැයි’ කියා, ඇවැත්නි, ඔහු එසේ කියන්නේ නිවැරදිව ද?” “නැත, ඇවැත්නි.” “ඇවැත්නි, ඒ සතර මහා මාවතේ මිනිසුන් හෝ ගව පශු සම්පත් හෝ ගමන් කර, සුළඟ සහ හිරු රශ්මිය තෙතමනය වියළා දැමීමෙන් නැවත දූවිලි ඇති විය හැකි බවට ඉඩක් ඇත. ඇවැත්නි, එලෙසින්ම මෙහි ඇතැම් පුද්ගලයෙක් කාමයන්ගෙන් වෙන්ව... (ආදී වශයෙන්)... පළමු ධ්‍යානයට එළඹ වාසය කරයි. ඔහු ‘මම පළමු ධ්‍යානය ලැබූ කෙනෙක්මි’යි සිතා භික්ෂූන් සමඟ මිශ්‍ර වී... (ආදී වශයෙන්)... ශික්ෂාව අත්හැර හීන තත්ත්වයකට පත් වේ.\n\n“ඇවැත්නි, මෙහි ඇතැම් පුද්ගලයෙක් විතර්ක විචාරයන් සංසිඳීමෙන්... (ආදී වශයෙන්)... දෙවන ධ්‍යානයට එළඹ වාසය කරයි. ඔහු ‘මම දෙවන ධ්‍යානය ලැබූ කෙනෙක්මි’යි සිතා භික්ෂූන් සමඟ මිශ්‍ර වී... (ආදී වශයෙන්)... ශික්ෂාව අත්හැර හීන තත්ත්වයකට පත් වේ. ඇවැත්නි, යම් සේ ගමකට හෝ නියම්ගමකට නුදුරින් මහත් පොකුණක් ඇත්තේ ද, එහි ඝනව වසින වැස්සකින් සිප්පි කටු ද, ගල් කැබලි ද නැති වී යන්නේ ය. ඇවැත්නි, යමෙක් මෙසේ කියන්නේ නම්: ‘දැන් ඒ පොකුණේ නැවත සිප්පි කටු හෝ ගල් කැබලි හෝ ඇති නොවනු ඇතැයි’ කියා, ඇවැත්නි, ඔහු එසේ කියන්නේ නිවැරදිව ද?” “නැත, ඇවැත්නි.”\n\nආයුෂ්මත්නි, මෙය සිදුවිය හැක්කකි. යම් පොකුණක මිනිසුන් හෝ පානය කරනු ඇත. ගවයන් හෝ පානය කරනු ඇත. සුළඟ හා අව්ව විසින් එහි තෙතමනය සිඳුවා දමනු ඇත. එසේ වුවද නැවත සිප්පි කටු හා ගල් කැබලි පහළ වනු ඇත. ආයුෂ්මත්නි, ඒ ආකාරයෙන්ම, මෙහිලා ඇතැම් පුද්ගලයෙක් විතර්ක හා විචාරයන් සංසිඳවීමෙන්, අභ්‍යන්තර පැහැදීමෙන් හා සිතේ එකඟතාවයෙන්, විතර්ක රහිතව, විචාර රහිතව, සමාධියෙන් උපන් ප්‍රීතිය හා සැපය ඇතිව දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. හේ 'මම දෙවන ධ්‍යානයට ලාභියෙක්මි' යි සිතමින් භික්ෂූන් සමඟ මිශ්‍රව වාසය කරයි... (කාලයත් සමඟ) ශික්ෂාව අත්හැර පිරිහීමකට පත් වේ.\n\nආයුෂ්මත්නි, මෙහිලා තවත් ඇතැම් පුද්ගලයෙක් ප්‍රීතිය කෙරෙහිද විරාගී වීමෙන්, උපේක්ෂාවෙන් යුතුව වාසය කරයි. සිහියෙන් හා මනා දැනුමෙන් යුතුව, කයින්ද සුවය විඳිමින්, ආර්යයන් වහන්සේලා යම් ධ්‍යානයක් ගැන 'උපේක්ෂා සහගතය, සිහි කල්පනාවෙන් යුක්තය, සුවසේ විහරණය වන්නේය' යැයි වදාළ සේක්ද, එබඳු තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. හේ 'මම තෙවන ධ්‍යානයට ලාභියෙක්මි' යි සිතමින් භික්ෂූන් සමඟ මිශ්‍රව වාසය කරයි... (කාලයත් සමඟ) ශික්ෂාව අත්හැර පිරිහීමකට පත් වේ. ආයුෂ්මත්නි, යම් සේ ප්‍රණීත භෝජන වැළඳූ පුද්ගලයෙකුට සවස ආහාරය කෙරෙහි ආශාවක් ඇති නොවේ. ආයුෂ්මත්නි, යමෙක් මෙසේ කියන්නේ නම්: 'දැන් ඒ පුද්ගලයාට නැවත ආහාරයක් කෙරෙහි ආශාවක් ඇති නොවනු ඇත', ආයුෂ්මත්නි, එසේ කියන පුද්ගලයා නිවැරදිව කියන්නේද? 'ආයුෂ්මත්නි, එසේ නොවේ.' ආයුෂ්මත්නි, මෙය සිදුවිය හැක්කකි. ප්‍රණීත භෝජන වැළඳූ ඒ පුද්ගලයාගේ ශරීරයේ එහි ඕජාව පවතින තාක්, ඔහුට වෙනත් ආහාරයක් කෙරෙහි ආශාවක් ඇති නොවේ. යම් කලක ඒ ඕජාව අතුරුදහන් වනු ඇත්ද, එවිට නැවත ඔහුට ඒ ආහාරය කෙරෙහි ආශාවක් ඇති විය හැකියි. ආයුෂ්මත්නි, ඒ ආකාරයෙන්ම, මෙහිලා ඇතැම් පුද්ගලයෙක් ප්‍රීතිය කෙරෙහිද විරාගී වීමෙන්... තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. හේ 'මම තෙවන ධ්‍යානයට ලාභියෙක්මි' යි සිතමින් භික්ෂූන් සමඟ මිශ්‍රව වාසය කරයි... (කාලයත් සමඟ) ශික්ෂාව අත්හැර පිරිහීමකට පත් වේ.\n\nආයුෂ්මත්නි, මෙහිලා තවත් ඇතැම් පුද්ගලයෙක් සුවයද දුකද අත්හැරීමෙන්, කලින්ම සතුට හා දොම්නස අතුරුදහන් කිරීමෙන්, දුකක්ද නැති, සුවයක්ද නැති, උපේක්ෂා සහගත සිහියෙන් පිරිසිදු වූ සිවුවන ධ්‍යානයට පැමිණ වාසය කරයි. හේ 'මම සිවුවන ධ්‍යානයට ලාභියෙක්මි' යි සිතමින් භික්ෂූන් සමඟ මිශ්‍රව වාසය කරයි... (කාලයත් සමඟ) ශික්ෂාව අත්හැර පිරිහීමකට පත් වේ. ආයුෂ්මත්නි, යම් සේ පර්වත අතර පිහිටි ජල පොකුණක් සුළං රහිතව, රළ රහිතව පවතීද, ආයුෂ්මත්නි, යමෙක් මෙසේ කියන්නේ නම්: 'දැන් ඒ ජල පොකුණෙහි නැවත රළ පහළ නොවනු ඇත', ආයුෂ්මත්නි, එසේ කියන පුද්ගලයා නිවැරදිව කියන්නේද? 'ආයුෂ්මත්නි, එසේ නොවේ.' ආයුෂ්මත්නි, මෙය සිදුවිය හැක්කකි. පෙරදිගින් බලවත් සුළං සහිත වැස්සක් පැමිණිය හැකියි. එය ඒ ජල පොකුණෙහි රළ ඇති කරනු ඇත. බටහිර දිශාවෙන් හෝ... උතුරු දිශාවෙන් හෝ... දකුණු දිශාවෙන් හෝ බලවත් සුළං සහිත වැස්සක් පැමිණිය හැකියි. එය ඒ ජල පොකුණෙහි රළ ඇති කරනු ඇත. ආයුෂ්මත්නි, ඒ ආකාරයෙන්ම, මෙහිලා ඇතැම් පුද්ගලයෙක් සුවයද දුකද අත්හැරීමෙන්... සිවුවන ධ්‍යානයට පැමිණ වාසය කරයි. හේ 'මම සිවුවන ධ්‍යානයට ලාභියෙක්මි' යි සිතමින් භික්ෂූන් සමඟ මිශ්‍රව වාසය කරයි... (කාලයත් සමඟ) ශික්ෂාව අත්හැර පිරිහීමකට පත් වේ.\n\nආයුෂ්මත්නි, මෙහිලා තවත් ඇතැම් පුද්ගලයෙක් සියලු නිමිතිවලට මනසිකාර නොකිරීමෙන් (සිත යොමු නොකිරීමෙන්), අනිමිත්ත චේතෝසමාධියට (නිමිති රහිත සිත් සමාධියට) පැමිණ වාසය කරයි. හේ 'මම අනිමිත්ත චේතෝසමාධියට ලාභියෙක්මි' යි සිතමින් භික්ෂූන්, භික්ෂුණීන්, උපාසක, උපාසිකාවන්, රජවරුන්, රාජ මහාමාත්‍යවරුන්, තීර්ථකයන් සහ තීර්ථක ශ්‍රාවකයන් සමඟ මිශ්‍රව, විශ්වාසයෙන්, විවෘතව, කතාබහට ලොල්ව වාසය කරන කල්හි රාගය සිත දූෂ්‍ය කරයි. රාගයෙන් දූෂ්‍ය වූ සිතින් හේ ශික්ෂාව අත්හැර පිරිහීමකට පත් වේ. ආයුෂ්මත්නි, යම් සේ රජෙක් හෝ රාජ මහාමාත්‍යවරයෙක් සතරංග සේනාවකින් (ඇතුන්, අසුන්, රථ, පාබල යන සතරංග සේනාවකින්) යුතුව මහා මඟ ගමන් කරමින්, යම්කිසි වනාන්තරයක එක් රැයක් වාසය කරනු ඇත. එහිදී හස්ති ශබ්දයෙන්, අශ්ව ශබ්දයෙන්, රථ ශබ්දයෙන්, පාබල ශබ්දයෙන්, භේරි, පණව, ශංඛ, තිණව යන (වාද්‍ය භාණ්ඩවල) ගිගුම් දෙන ශබ්දයෙන් කිරිළි ශබ්දය අතුරුදහන් වනු ඇත. ආයුෂ්මත්නි, යමෙක් මෙසේ කියන්නේ නම්: 'දැන් ඒ වනාන්තරයෙහි නැවත කිරිළි ශබ්දය පහළ නොවනු ඇත', ආයුෂ්මත්නි, එසේ කියන පුද්ගලයා නිවැරදිව කියන්නේද? 'ආයුෂ්මත්නි, එසේ නොවේ.' ආයුෂ්මත්නි, මෙය සිදුවිය හැක්කකි. ඒ රජ හෝ රාජ මහාමාත්‍යවරයා ඒ වනාන්තරයෙන් පිටව යනු ඇත්ද, එවිට නැවත කිරිළි ශබ්දය පහළ වනු ඇත. ආයුෂ්මත්නි, ඒ ආකාරයෙන්ම, මෙහිලා ඇතැම් පුද්ගලයෙක් සියලු නිමිතිවලට මනසිකාර නොකිරීමෙන් (සිත යොමු නොකිරීමෙන්), අනිමිත්ත චේතෝසමාධියට (නිමිති රහිත සිත් සමාධියට) පැමිණ වාසය කරයි. හේ 'මම අනිමිත්ත චේතෝසමාධියට ලාභියෙක්මි' යි සිතමින් භික්ෂූන්, භික්ෂුණීන්, උපාසක, උපාසිකාවන්, රජවරුන්, රාජ මහාමාත්‍යවරුන්, තීර්ථකයන් සහ තීර්ථක ශ්‍රාවකයන් සමඟ මිශ්‍රව, විශ්වාසයෙන්, විවෘතව, කතාබහට ලොල්ව වාසය කරන කල්හි රාගය සිත දූෂ්‍ය කරයි. රාගයෙන් දූෂ්‍ය වූ සිතින් හේ ශික්ෂාව අත්හැර පිරිහීමකට පත් වේ.\n\nඉක්බිති ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේ වෙනත් සමයක ශික්ෂාව අත්හැර පිරිහීමකට පත් වූ සේක.\n\nඉන්පසු චිත්ත හත්ථිසාරිපුත්තගේ මිත්‍ර භික්ෂූහු ආයුෂ්මත් මහාකෝට්ඨිකයන් වහන්සේ වෙත එළඹියහ. එළඹ, ආයුෂ්මත් මහාකෝට්ඨිකයන් වහන්සේට මෙය පැවසූහ: \"ආයුෂ්මත් මහාකෝට්ඨිකයන් වහන්සේ විසින් චිත්ත හත්ථිසාරිපුත්තයන්ගේ සිතට සිතින් විනිවිද දැනගන්නා ලද්දේද, 'චිත්ත හත්ථිසාරිපුත්ත මේ මේ විහාර සමාපත්තීන් ලාභී වන අතර, නැවත ශික්ෂාව අත්හැර පහත් භාවයට පැමිණෙන්නේය' යනුවෙන්, නැතහොත් දෙවිවරු මේ කාරණය දැනුම් දුන්නාද, 'ස්වාමීනි, චිත්ත හත්ථිසාරිපුත්ත මේ මේ විහාර සමාපත්තීන් ලාභී වන අතර, නැවත ශික්ෂාව අත්හැර පහත් භාවයට පැමිණෙන්නේය' යනුවෙන්?\"\n\n\"ඇවැත්නි, මම සිතට සිතින් විනිවිද දැනගත්තෙමි, 'චිත්ත හත්ථිසාරිපුත්ත මේ මේ විහාර සමාපත්තීන් ලාභී වන අතර, නැවත ශික්ෂාව අත්හැර පහත් භාවයට පැමිණෙන්නේය' යනුවෙන්. දෙවිවරුද මට මේ කාරණය දැන්වූහ, 'ස්වාමීනි, චිත්ත හත්ථිසාරිපුත්ත මේ මේ විහාර සමාපත්තීන් ලාභී වන අතර, නැවත ශික්ෂාව අත්හැර පහත් භාවයට පැමිණෙන්නේය' යනුවෙන්.\"\n\nඉන්පසු චිත්ත හත්ථිසාරිපුත්තගේ මිත්‍ර භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ. එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි වූහ. එකත්පස්ව වැඩ සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: \"ස්වාමීනි, චිත්ත හත්ථිසාරිපුත්ත මේ මේ විහාර සමාපත්තීන් ලාභී වන අතර, නැවත ශික්ෂාව අත්හැර පහත් භාවයට පැමිණෙන්නේය.\" \"මහණෙනි, චිත්ත බොහෝ කලක් නෙක්ඛම්මයෙහි නොපමාවනු ඇත.\"\n\nඉන්පසු චිත්ත හත්ථිසාරිපුත්ත වැඩි කලක් නොගොස්ම කෙස් රැවුල් බා දමා, කසාවත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරිකභාවයට පැමිණියේය. ඉන්පසු ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත, තනිව, ඈත්ව, අප්‍රමාදීව, වීර්යවත්ව, දැඩි අධිෂ්ඨානයෙන් යුතුව වාසය කරමින් වැඩි කලක් නොගොස්ම – කුලපුත්‍රයෝ යමක් පිණිස මනාකොට ගිහි ගෙයින් නික්ම අනගාරිකභාවයට පැමිණෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචාරී ජීවිතයේ අවසානය මෙලොවදීම තමාගේ උසස් ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කළේය. \"ජාතිය ක්ෂය විය, බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මේ භාවය පිණිස කළ යුතු අන් කිසිවක් නැත\" යනුවෙන් ඔහු අවබෝධ කළේය. ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත රහතන් වහන්සේලා අතුරින් එක් නමක් බවට පත් විය.",
      "paliTitle": "Hatthisāriputtasuttaṃ"
    },
    {
      "number": 61,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tena kho pana samayena sambahulānaṃ therānaṃ bhikkhūnaṃ pacchābhattaṃ piṇḍapātapaṭikkantānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayamantarākathā udapādi – ‘‘vuttamidaṃ, āvuso, bhagavatā pārāyane metteyyapañhe – [cūḷani. tissamitteyyamāṇavapucchā 67] ‘‘Yo ubhonte viditvāna, majjhe mantā na lippati [na limpati (ka.)]; Taṃ brūmi mahāpurisoti, sodha sibbini [sibbani (sī. syā. kaṃ. pī.)] maccagā’’ti. ‘‘Katamo nu kho, āvuso, eko anto, katamo dutiyo anto, kiṃ majjhe, kā sibbinī’’ti? Evaṃ vutte aññataro bhikkhu there bhikkhū etadavoca – ‘‘phasso kho, āvuso, eko anto, phassasamudayo dutiyo anto, phassanirodho majjhe, taṇhā sibbinī; taṇhā hi naṃ sibbati tassa tasseva bhavassa abhinibbattiyā. Ettāvatā kho, āvuso, bhikkhu abhiññeyyaṃ abhijānāti, pariññeyyaṃ parijānāti, abhiññeyyaṃ abhijānanto [abhijānitvā (ka.)] pariññeyyaṃ parijānanto [parijānitvā (ka.)] diṭṭheva dhamme dukkhassantakaro hotī’’ti. Evaṃ vutte aññataro bhikkhu there bhikkhū etadavoca – ‘‘atītaṃ kho, āvuso, eko anto, anāgataṃ dutiyo anto, paccuppannaṃ majjhe, taṇhā sibbinī; taṇhā hi naṃ sibbati tassa tasseva bhavassa abhinibbattiyā. Ettāvatā kho, āvuso, bhikkhu abhiññeyyaṃ abhijānāti, pariññeyyaṃ parijānāti, abhiññeyyaṃ abhijānanto, pariññeyyaṃ parijānanto diṭṭheva dhamme dukkhassantakaro hotī’’ti. Evaṃ vutte aññataro bhikkhu there bhikkhū etadavoca – ‘‘sukhā, āvuso, vedanā eko anto, dukkhā vedanā dutiyo anto, adukkhamasukhā vedanā majjhe, taṇhā sibbinī; taṇhā hi naṃ sibbati tassa tasseva bhavassa abhinibbattiyā. Ettāvatā kho, āvuso, bhikkhu abhiññeyyaṃ abhijānāti, pariññeyyaṃ parijānāti, abhiññeyyaṃ abhijānanto, pariññeyyaṃ parijānanto diṭṭheva dhamme dukkhassantakaro hotī’’ti. Evaṃ vutte aññataro bhikkhu there bhikkhū etadavoca – ‘‘nāmaṃ kho, āvuso, eko anto, rūpaṃ dutiyo anto, viññāṇaṃ majjhe, taṇhā sibbinī; taṇhā hi naṃ sibbati tassa tasseva bhavassa abhinibbattiyā. Ettāvatā kho, āvuso, bhikkhu abhiññeyyaṃ abhijānāti, pariññeyyaṃ parijānāti, abhiññeyyaṃ abhijānanto pariññeyyaṃ parijānanto diṭṭheva dhamme dukkhassantakaro hotī’’ti. Evaṃ vutte aññataro bhikkhu there bhikkhū etadavoca – ‘‘cha kho, āvuso, ajjhattikāni āyatanāni eko anto, cha bāhirāni āyatanāni dutiyo anto, viññāṇaṃ majjhe, taṇhā sibbinī; taṇhā hi naṃ sibbati tassa tasseva bhavassa abhinibbattiyā. Ettāvatā kho āvuso, bhikkhu abhiññeyyaṃ abhijānāti, pariññeyyaṃ parijānāti, abhiññeyyaṃ abhijānanto pariññeyyaṃ parijānanto diṭṭheva dhamme dukkhassantakaro hotī’’ti. Evaṃ vutte aññataro bhikkhu there bhikkhū etadavoca – ‘‘sakkāyo kho, āvuso, eko anto, sakkāyasamudayo dutiyo anto, sakkāyanirodho majjhe, taṇhā sibbinī; taṇhā hi naṃ sibbati tassa tasseva bhavassa abhinibbattiyā. Ettāvatā kho, āvuso, bhikkhu abhiññeyyaṃ abhijānāti, pariññeyyaṃ parijānāti, abhiññeyyaṃ abhijānanto pariññeyyaṃ parijānanto [sabbatthapi evameva dissati] diṭṭheva dhamme dukkhassantakaro hotī’’ti. Evaṃ vutte aññataro bhikkhu there bhikkhū etadavoca – ‘‘byākataṃ kho, āvuso, amhehi sabbeheva yathāsakaṃ paṭibhānaṃ. Āyāmāvuso, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavato etamatthaṃ ārocessāma. Yathā no bhagavā byākarissati tathā naṃ dhāressāmā’’ti. ‘‘Evamāvuso’’ti kho therā bhikkhū tassa bhikkhuno paccassosuṃ. Atha kho therā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho therā bhikkhū yāvatako ahosi sabbeheva saddhiṃ kathāsallāpo, taṃ sabbaṃ bhagavato ārocesuṃ. ‘‘Kassa nu kho, bhante, subhāsita’’nti? ‘‘Sabbesaṃ vo, bhikkhave, subhāsitaṃ pariyāyena, api ca yaṃ mayā sandhāya bhāsitaṃ pārāyane metteyyapañhe – ‘‘Yo ubhonte viditvāna, majjhe mantā na lippati; Taṃ brūmi mahāpurisoti, sodha sibbinimaccagā’’ti. ‘‘Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho therā bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘phasso kho, bhikkhave, eko anto, phassasamudayo dutiyo anto, phassanirodho majjhe, taṇhā sibbinī; taṇhā hi naṃ sibbati tassa tasseva bhavassa abhinibbattiyā. Ettāvatā kho, bhikkhave, bhikkhu abhiññeyyaṃ abhijānāti, pariññeyyaṃ parijānāti, abhiññeyyaṃ abhijānanto pariññeyyaṃ parijānanto diṭṭheva dhamme dukkhassantakaro hotī’’ti. Sattamaṃ.",
      "english": "Thus have I heard: At one time the Blessed One was dwelling in Bārāṇasī, at Isipatana, in the Deer Park.\n\nNow at that time, many elder bhikkhus, after their meal, having returned from their alms-round, were sitting together in the assembly hall. This conversation arose among them: “Friends, this was stated by the Blessed One in the Pārāyana, in the Metteyya’s Questions: ‘One who, having understood both extremes, is not defiled by the middle through wisdom; Him I call a great person, one who has transcended the seamstress (craving).’ Now friends, what is the one extreme? What is the second extreme? What is the middle? And what is the seamstress?”\n\nWhen this was said, a certain bhikkhu said to the elder bhikkhus: “Friends, contact is one extreme, the origin of contact is the second extreme, the cessation of contact is the middle, and craving is the seamstress. For craving sews him to the re-becoming of this and that existence. To this extent, friends, a bhikkhu directly knows what is to be directly known and fully comprehends what is to be fully understood. Having directly known what is to be directly known and fully comprehended what is to be fully understood, he becomes one who makes an end to suffering in this very life.”\n\nWhen this was said, a certain bhikkhu said to the elder bhikkhus: “Friends, the past is one extreme, the future is the second extreme, the present is the middle, and craving is the seamstress. For craving sews him to the re-becoming of this and that existence. To this extent, friends, a bhikkhu directly knows what is to be directly known and fully comprehends what is to be fully understood. Having directly known what is to be directly known and fully comprehended what is to be fully understood, he becomes one who makes an end to suffering in this very life.”\n\nWhen this was said, a certain bhikkhu said to the elder bhikkhus: “Friends, pleasant feeling is one extreme, painful feeling is the second extreme, neither-painful-nor-pleasant feeling is the middle, and craving is the seamstress. For craving sews him to the re-becoming of this and that existence. To this extent, friends, a bhikkhu directly knows what is to be directly known and fully comprehends what is to be fully understood. Having directly known what is to be directly known and fully comprehended what is to be fully understood, he becomes one who makes an end to suffering in this very life.”\n\nWhen this was said, a certain bhikkhu said to the elder bhikkhus: “Friends, mind (nāma) is one extreme, matter (rūpa) is the second extreme, consciousness is the middle, and craving is the seamstress. For craving sews him to the re-becoming of this and that existence. To this extent, friends, a bhikkhu directly knows what is to be directly known and fully comprehends what is to be fully understood. Having directly known what is to be directly known and fully comprehended what is to be fully understood, he becomes one who makes an end to suffering in this very life.”\n\nWhen this was said, a certain bhikkhu said to the elder bhikkhus: “Friends, the six internal sense bases are one extreme, the six external sense bases are the second extreme, consciousness is the middle, and craving is the seamstress. For craving sews him to the re-becoming of this and that existence. To this extent, friends, a bhikkhu directly knows what is to be directly known and fully comprehends what is to be fully understood. Having directly known what is to be directly known and fully comprehended what is to be fully understood, he becomes one who makes an end to suffering in this very life.”\n\nWhen this was said, a certain bhikkhu said to the elder bhikkhus: “Friends, identity (sakkāya) is one extreme, the origin of identity is the second extreme, the cessation of identity is the middle, and craving is the seamstress. For craving sews him to the re-becoming of this and that existence. To this extent, friends, a bhikkhu directly knows what is to be directly known and fully comprehends what is to be fully understood. Having directly known what is to be directly known and fully comprehended what is to be fully understood, he becomes one who makes an end to suffering in this very life.”\n\nWhen this was said, a certain bhikkhu said to the elder bhikkhus: “Friends, all of us have each explained according to our own inspiration. Come, friends, let us approach the Blessed One. Having approached him, we will inform the Blessed One of this matter. We shall bear in mind whatever way the Blessed One explains it to us.”\n\n“Yes, friend,” replied the elder bhikkhus to that bhikkhu.\n\nThen the elder bhikkhus approached the Blessed One. Having approached and paid homage to the Blessed One, they sat down to one side. While seated to one side, the elder bhikkhus reported to the Blessed One the entire conversation that had taken place among them.\n\n“Whose explanation, venerable sir, was well-stated?”\n\n“Monks, all of your explanations, in their own way, were well-stated. But that which was stated by me in the Pārāyana, in the Metteyya’s Questions, with reference to this, was: ‘One who, having understood both extremes, is not defiled by the middle through wisdom; Him I call a great person, one who has transcended the seamstress (craving).’ Listen to it, pay careful attention; I shall speak.”\n\n“Yes, venerable sir,” the elder bhikkhus replied to the Blessed One.\n\nThe Blessed One said this: “Contact, bhikkhus, is one extreme; the origin of contact is the second extreme; the cessation of contact is the middle. Craving is the seamstress; for craving stitches it together for the renewed arising of this or that existence. To this extent, bhikkhus, a monk fully knows what is to be fully known and thoroughly understands what is to be thoroughly understood. Fully knowing what is to be fully known and thoroughly understanding what is to be thoroughly understood, he makes an end to suffering right in this very life.”",
      "sinhala": "මේ අයුරින් මා විසින් අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ බරණැස ඉසිපතනයේ මිගදායෙහි වැඩසිටින සේක. එසමයෙහි ම බොහෝ තෙරණුවෝ වූ භික්ෂූහු දහවල් අහරෙන් පසුව පිණ්ඩපාතයෙන් ආපසු වැඩමවා, මණ්ඩලමාලාවක රැස්ව, අසුන්ගෙන සිටියදී මේ අන්තඃකථාව හෙවත් කථාන්තරය ඇති විය: \"ඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් පාරායන වග්ගයේ මෙත්තෙය්‍ය ප්‍රශ්නයේ මෙසේ වදාරණ ලදී: 'යම් කෙනෙක් අන්ත දෙක අවබෝධ කොට මැදට (රාගාදී) කෙලෙස් බද්ධ නොවන්නේද, ඒ පුද්ගලයා මම මහ පුරුෂයෙක් යැයි කියමි. හේ තෘෂ්ණාව නම් වූ මැහුම්කරු ඉක්මවීය.'\"\n\n\"ඇවැත්නි, එක් අන්තයක් යනු කවරේද? දෙවන අන්තය යනු කවරේද? මැද යනු කවරේද? මැහුම්කරු යනු කවරේද?\"\n\nමෙසේ කියන ලද්දේ එක් භික්ෂුවක් එම තෙරවරුන්ට මෙසේ පැවසීය: \"ඇවැත්නි, ස්පර්ශය එක් අන්තයකි. ස්පර්ශයේ හටගැනීම දෙවන අන්තයයි. ස්පර්ශය නිරෝධ කිරීම මැදය. තෘෂ්ණාව මැහුම්කරුවයි. තෘෂ්ණාව යම් සත්වයකු නැවත නැවතත් ඒ ඒ භවයන්හි උපදවීම පිණිස ම මහන්නේය. ඇවැත්නි, මෙපමණකින් භික්ෂුව අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනී, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනී. අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනිමින්, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනිමින්, මේ දැක්මෙහි ම දුක කෙළවර කරන්නෙක් වේ.\"\n\nමෙසේ කියන ලද්දේ එක් භික්ෂුවක් එම තෙරවරුන්ට මෙසේ පැවසීය: \"ඇවැත්නි, අතීතය එක් අන්තයකි. අනාගතය දෙවන අන්තයයි. වර්තමානය මැදය. තෘෂ්ණාව මැහුම්කරුවයි. තෘෂ්ණාව යම් සත්වයකු නැවත නැවතත් ඒ ඒ භවයන්හි උපදවීම පිණිස ම මහන්නේය. ඇවැත්නි, මෙපමණකින් භික්ෂුව අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනී, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනී. අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනිමින්, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනිමින්, මේ දැක්මෙහි ම දුක කෙළවර කරන්නෙක් වේ.\"\n\nමෙසේ කියන ලද්දේ එක් භික්ෂුවක් එම තෙරවරුන්ට මෙසේ පැවසීය: \"ඇවැත්නි, සැප වේදනාව එක් අන්තයකි. දුක් වේදනාව දෙවන අන්තයයි. දුක් නොවන, සැප නොවන (උපේක්ෂා) වේදනාව මැදය. තෘෂ්ණාව මැහුම්කරුවයි. තෘෂ්ණාව යම් සත්වයකු නැවත නැවතත් ඒ ඒ භවයන්හි උපදවීම පිණිස ම මහන්නේය. ඇවැත්නි, මෙපමණකින් භික්ෂුව අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනී, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනී. අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනිමින්, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනිමින්, මේ දැක්මෙහි ම දුක කෙළවර කරන්නෙක් වේ.\"\n\nමෙසේ කියන ලද්දේ එක් භික්ෂුවක් එම තෙරවරුන්ට මෙසේ පැවසීය: \"ඇවැත්නි, නාමය එක් අන්තයකි. රූපය දෙවන අන්තයයි. විඤ්ඤාණය මැදය. තෘෂ්ණාව මැහුම්කරුවයි. තෘෂ්ණාව යම් සත්වයකු නැවත නැවතත් ඒ ඒ භවයන්හි උපදවීම පිණිස ම මහන්නේය. ඇවැත්නි, මෙපමණකින් භික්ෂුව අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනී, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනී. අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනිමින්, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනිමින්, මේ දැක්මෙහි ම දුක කෙළවර කරන්නෙක් වේ.\"\n\nමෙසේ කියන ලද්දේ එක් භික්ෂුවක් එම තෙරවරුන්ට මෙසේ පැවසීය: \"ඇවැත්නි, ෂඩ් ආධ්‍යාත්මික ආයතන එක් අන්තයකි. ෂඩ් බාහිර ආයතන දෙවන අන්තයයි. විඤ්ඤාණය මැදය. තෘෂ්ණාව මැහුම්කරුවයි. තෘෂ්ණාව යම් සත්වයකු නැවත නැවතත් ඒ ඒ භවයන්හි උපදවීම පිණිස ම මහන්නේය. ඇවැත්නි, මෙපමණකින් භික්ෂුව අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනී, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනී. අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනිමින්, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනිමින්, මේ දැක්මෙහි ම දුක කෙළවර කරන්නෙක් වේ.\"\n\nමෙසේ කියන ලද්දේ එක් භික්ෂුවක් එම තෙරවරුන්ට මෙසේ පැවසීය: \"ඇවැත්නි, සක්කාය (පංච උපාදානස්කන්ධය) එක් අන්තයකි. සක්කායයේ හටගැනීම දෙවන අන්තයයි. සක්කායයේ නිරෝධය මැදය. තෘෂ්ණාව මැහුම්කරුවයි. තෘෂ්ණාව යම් සත්වයකු නැවත නැවතත් ඒ ඒ භවයන්හි උපදවීම පිණිස ම මහන්නේය. ඇවැත්නි, මෙපමණකින් භික්ෂුව අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනී, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනී. අභිඤ්ඤායෙන් දැනගත යුතු දේ විශේෂයෙන් දනිමින්, පිරිසිඳ දැනගත යුතු දේ පිරිසිඳ දනිමින්, මේ දැක්මෙහි ම දුක කෙළවර කරන්නෙක් වේ.\"\n\nමෙසේ කියන ලද්දේ එක් භික්ෂුවක් එම තෙරවරුන්ට මෙසේ පැවසීය: \"ඇවැත්නි, අප සියලු දෙනා විසින් තම තමන්ගේ බුද්ධියට අනුව (ප්‍රතිභානයට අනුව) මේ කරුණ පැහැදිලි කරන ලදී. ඇවැත්නි, එසේ නම් අපි භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට යමු. එහි එළඹ භාග්‍යවතුන් වහන්සේට මේ කරුණ දන්වමු. භාග්‍යවතුන් වහන්සේ අපට කෙසේ විස්තර කරනු ඇත්ද, අපි එය එසේම ධාරණය කරගනිමු.\" \"එසේය ඇවැත්නි\"යි කියා එම තෙරවරු ඒ භික්ෂුවගේ වචනයට එකඟ වූහ.\n\nඉක්බිතිව ඒ තෙරවරු භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹියහ. එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙකින් වාඩි වූහ. එකත්පසෙකින් වාඩි වී සිටි ඒ තෙරවරු තමන් සියලු දෙනා අතර ඇති වූ කථාසල්ලාපය කොපමණක් වීද, ඒ සියල්ල භාග්‍යවතුන් වහන්සේට දැන්වූහ. \"භාග්‍යවතුන් වහන්ස, කාගේ කථාවද මනාව පැවසූයේ?\" \"මහණෙනි, වාරයෙන් (ක්‍රමයෙන්) කල්පනා කරන විට නුඹලා සියලු දෙනාගේම කථාව මනාව පැවසූවකි. එහෙත් මා විසින් පාරායන වග්ගයේ මෙත්තෙය්‍ය ප්‍රශ්නයේදී යමක් අරමුණු කොට වදාරණ ලද්දේද: 'යම් කෙනෙක් අන්ත දෙක අවබෝධ කොට මැදට (රාගාදී) කෙලෙස් බද්ධ නොවන්නේද, ඒ පුද්ගලයා මම මහ පුරුෂයෙක් යැයි කියමි. හේ තෘෂ්ණාව නම් වූ මැහුම්කරු ඉක්මවීය.' එය අසව්, හොඳින් මෙනෙහි කරව්; මම එය කියන්නෙමි.\" \"එසේය, භාග්‍යවතුන් වහන්ස,\"යි කියා ඒ තෙරවරු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n'මහණෙනි, ස්පර්ශය එක් කෙළවරකි. ස්පර්ශයේ හටගැනීම දෙවන කෙළවරයි. ස්පර්ශයේ නිරෝධය මධ්‍යයයි. තණ්හාව මහන්නියයි. ඒ තණ්හාවම (සත්වයාව) ඒ ඒ භවයේම නැවත නැවත ඉපදවීම පිණිස මහයි. මහණෙනි, මේ ප්‍රමාණයෙන් භික්ෂුව අභිඥායෙන් දැනගත යුතු දෑ දනී, පිරිසිඳ දැනගත යුතු දෑ පිරිසිඳ දනී. අභිඥායෙන් දැනගත යුතු දෑ දන්නා, පිරිසිඳ දැනගත යුතු දෑ පිරිසිඳ දන්නා ඒ භික්ෂුව මේ ආත්මභාවයේදීම දුක කෙළවර කරන්නෙක් වේ.'",
      "paliTitle": "Majjhesuttaṃ"
    },
    {
      "number": 62,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena daṇḍakappakaṃ nāma kosalānaṃ nigamo tadavasari. Atha kho bhagavā maggā okkamma aññatarasmiṃ rukkhamūle paññatte āsane nisīdi. Te ca bhikkhū daṇḍakappakaṃ pavisiṃsu āvasathaṃ pariyesituṃ. Atha kho āyasmā ānando sambahulehi bhikkhūhi saddhiṃ yena aciravatī nadī tenupasaṅkami gattāni parisiñcituṃ. Aciravatiyā nadiyā gattāni parisiñcitvā paccuttaritvā ekacīvaro aṭṭhāsi gattāni pubbāpayamāno. Atha kho aññataro bhikkhu yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ etadavoca – ‘‘kiṃ nu kho, āvuso ānanda, sabbaṃ cetaso samannāharitvā nu kho devadatto bhagavatā byākato – ‘āpāyiko devadatto nerayiko kappaṭṭho atekiccho’ti [cūḷava. 348; a. ni. 8.7 passitabbaṃ], udāhu kenacideva pariyāyenā’ti? ‘‘Evaṃ kho panetaṃ, āvuso, bhagavatā byākata’’nti. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, sambahulehi bhikkhūhi saddhiṃ yena aciravatī nadī tenupasaṅkamiṃ gattāni parisiñcituṃ. Aciravatiyā nadiyā gattāni parisiñcitvā paccuttaritvā ekacīvaro aṭṭhāsiṃ gattāni pubbāpayamāno. Atha kho, bhante, aññataro bhikkhu yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ etadavoca – ‘kiṃ nu kho, āvuso, ānanda sabbaṃ cetaso samannāharitvā nu kho devadatto bhagavatā byākato – āpāyiko devadatto nerayiko kappaṭṭho atekicchoti, udāhu kenacideva pariyāyenā’ti? Evaṃ vutte ahaṃ, bhante, taṃ bhikkhuṃ etadavocaṃ – ‘evaṃ kho panetaṃ, āvuso, bhagavatā byākata’’’nti. ‘‘So vā [so ca (syā.)] kho, ānanda, bhikkhu navo bhavissati acirapabbajito, thero vā pana bālo abyatto. Kathañhi nāma yaṃ mayā ekaṃsena byākataṃ tattha dvejjhaṃ āpajjissati! Nāhaṃ, ānanda, aññaṃ ekapuggalampi samanupassāmi, yo evaṃ mayā sabbaṃ cetaso samannāharitvā byākato, yathayidaṃ devadatto. Yāvakīvañcāhaṃ, ānanda, devadattassa vālaggakoṭinittudanamattampi sukkadhammaṃ addasaṃ; neva tāvāhaṃ devadattaṃ byākāsiṃ – ‘āpāyiko devadatto nerayiko kappaṭṭho atekiccho’ti. Yato ca kho ahaṃ, ānanda, devadattassa vālaggakoṭinittudanamattampi sukkadhammaṃ na addasaṃ; athāhaṃ devadattaṃ byākāsiṃ – ‘āpāyiko devadatto nerayiko kappaṭṭho atekiccho’ti. ‘‘Seyyathāpi, ānanda, gūthakūpo sādhikaporiso pūro gūthassa samatittiko. Tatra puriso sasīsako nimuggo assa. Tassa kocideva puriso uppajjeyya atthakāmo hitakāmo yogakkhemakāmo tamhā gūthakūpā uddharitukāmo. So taṃ gūthakūpaṃ samantānuparigacchanto neva passeyya tassa purisassa vālaggakoṭinittudanamattampi gūthena amakkhitaṃ, yattha taṃ gahetvā uddhareyya. Evamevaṃ kho ahaṃ, ānanda, yato devadattassa vālaggakoṭinittudanamattampi sukkadhammaṃ na addasaṃ; athāhaṃ devadattaṃ byākāsiṃ – ‘āpāyiko devadatto nerayiko kappaṭṭho atekiccho’ti. Sace tumhe, ānanda, suṇeyyātha tathāgatassa purisindriyañāṇāni vibhajissāmī’’ti [vibhajantassāti (sī. syā. pī.)]? ‘‘Etassa, bhagavā, kālo; etassa, sugata, kālo yaṃ bhagavā purisindriyañāṇāni vibhajeyya. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tenahānanda, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā ānando bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idhāhaṃ, ānanda, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa kusalā dhammā antarahitā, akusalā dhammā sammukhībhūtā. Atthi ca khvassa kusalamūlaṃ asamucchinnaṃ, tamhā tassa kusalā kusalaṃ pātubhavissati. Evamayaṃ puggalo āyatiṃ aparihānadhammo bhavissatī’ti. Seyyathāpi, ānanda, bījāni akhaṇḍāni apūtīni avātātapahatāni sāradāni sukhasayitāni sukhette suparikammakatāya bhūmiyā nikkhittāni. Jāneyyāsi tvaṃ, ānanda, imāni bījāni vuddhiṃ virūḷhiṃ vepullaṃ āpajjissantī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho ahaṃ, ānanda, idhekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa kusalā dhammā antarahitā, akusalā dhammā sammukhībhūtā. Atthi ca khvassa kusalamūlaṃ asamucchinnaṃ, tamhā tassa kusalā kusalaṃ pātubhavissati. Evamayaṃ puggalo āyatiṃ aparihānadhammo bhavissatī’ti. Evampi kho, ānanda, tathāgatassa purisapuggalo cetasā ceto paricca vidito hoti. Evampi kho, ānanda, tathāgatassa purisindriyañāṇaṃ cetasā ceto paricca viditaṃ hoti. Evampi kho, ānanda, tathāgatassa āyatiṃ dhammasamuppādo cetasā ceto paricca vidito hoti. ‘‘Idha panāhaṃ, ānanda, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa akusalā dhammā antarahitā, kusalā dhammā sammukhībhūtā. Atthi ca khvassa akusalamūlaṃ asamucchinnaṃ, tamhā tassa akusalā akusalaṃ pātubhavissati. Evamayaṃ puggalo āyatiṃ parihānadhammo bhavissatī’ti. Seyyathāpi, ānanda, bījāni akhaṇḍāni apūtīni avātātapahatāni sāradāni sukhasayitāni puthusilāya nikkhittāni. Jāneyyāsi tvaṃ, ānanda, nayimāni bījāni vuddhiṃ virūḷhiṃ vepullaṃ āpajjissantī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho ahaṃ, ānanda, idhekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa akusalā dhammā antarahitā, kusalā dhammā sammukhībhūtā. Atthi ca khvassa akusalamūlaṃ asamucchinnaṃ, tamhā tassa akusalā akusalaṃ pātubhavissati. Evamayaṃ puggalo āyatiṃ parihānadhammo bhavissatī’ti. Evampi kho, ānanda, tathāgatassa purisapuggalo cetasā ceto paricca vidito hoti. Evampi kho, ānanda, tathāgatassa purisindriyañāṇaṃ cetasā ceto paricca viditaṃ hoti. Evampi kho, ānanda, tathāgatassa āyatiṃ dhammasamuppādo cetasā ceto paricca vidito hoti. ‘‘Idha panāhaṃ, ānanda, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘natthi imassa puggalassa vālaggakoṭinittudanamattopi sukko dhammo, samannāgatoyaṃ puggalo ekantakāḷakehi akusalehi dhammehi, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjissatī’ti. Seyyathāpi, ānanda, bījāni khaṇḍāni pūtīni vātātapahatāni sukhette suparikammakatāya bhūmiyā nikkhittāni. Jāneyyāsi tvaṃ, ānanda, nayimāni bījāni vuddhiṃ virūḷhiṃ vepullaṃ āpajjissantī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho ahaṃ, ānanda, idhekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘natthi imassa puggalassa vālaggakoṭinittudanamattopi sukko dhammo, samannāgatoyaṃ puggalo ekantakāḷakehi akusalehi dhammehi, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjissatī’ti. Evampi kho, ānanda, tathāgatassa purisapuggalo cetasā ceto paricca vidito hoti. Evampi kho, ānanda, tathāgatassa purisindriyañāṇaṃ cetasā ceto paricca viditaṃ hoti. Evampi kho, ānanda, tathāgatassa āyatiṃ dhammasamuppādo cetasā ceto paricca vidito hotī’’ti. Evaṃ vutte āyasmā ānando bhagavantaṃ etadavoca – ‘‘sakkā nu kho, bhante, imesaṃ tiṇṇaṃ puggalānaṃ aparepi tayo puggalā sappaṭibhāgā paññāpetu’’nti? ‘‘Sakkā, ānandā’’ti bhagavā avoca – ‘‘idhāhaṃ, ānanda, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa kusalā dhammā antarahitā, akusalā dhammā sammukhībhūtā. Atthi ca khvassa kusalamūlaṃ asamucchinnaṃ, tampi sabbena sabbaṃ samugghātaṃ gacchati. Evamayaṃ puggalo āyatiṃ parihānadhammo bhavissatī’ti. Seyyathāpi, ānanda, aṅgārāni ādittāni sampajjalitāni sajotibhūtāni puthusilāya nikkhittāni. Jāneyyāsi tvaṃ, ānanda, nayimāni aṅgārāni vuddhiṃ virūḷhiṃ vepullaṃ āpajjissantī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Seyyathāpi vā pana, ānanda, sāyanhasamayaṃ [sāyanhasamaye (syā. ka.)] sūriye ogacchante, jāneyyāsi tvaṃ, ānanda, āloko antaradhāyissati andhakāro pātubhavissatī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Seyyathāpi vā, panānanda, abhido addharattaṃ bhattakālasamaye, jāneyyāsi tvaṃ, ānanda, āloko antarahito andhakāro pātubhūto’’ti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho ahaṃ, ānanda, idhekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa kusalā dhammā antarahitā, akusalā dhammā sammukhībhūtā. Atthi ca khvassa kusalamūlaṃ asamucchinnaṃ, tampi sabbena sabbaṃ samugghātaṃ gacchati. Evamayaṃ puggalo āyatiṃ parihānadhammo bhavissatī’ti. Evampi kho, ānanda, tathāgatassa purisapuggalo cetasā ceto paricca vidito hoti. Evampi kho, ānanda, tathāgatassa purisindriyañāṇaṃ cetasā ceto paricca viditaṃ hoti. Evampi kho, ānanda, tathāgatassa āyatiṃ dhammasamuppādo cetasā ceto paricca vidito hoti. ‘‘Idha panāhaṃ, ānanda, ekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa akusalā dhammā antarahitā, kusalā dhammā sammukhībhūtā. Atthi ca khvassa akusalamūlaṃ asamucchinnaṃ, tampi sabbena sabbaṃ samugghātaṃ gacchati. Evamayaṃ puggalo āyatiṃ aparihānadhammo bhavissatī’ti. Seyyathāpi, ānanda, aṅgārāni ādittāni sampajjalitāni sajotibhūtāni sukkhe tiṇapuñje vā kaṭṭhapuñje vā nikkhittāni. Jāneyyāsi tvaṃ, ānanda, imāni aṅgārāni vuḍḍhiṃ virūḷhiṃ vepullaṃ āpajjissantī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Seyyathāpi vā panānanda, rattiyā paccūsasamayaṃ [rattipaccūsasamaye (ka.)] sūriye uggacchante, jāneyyāsi tvaṃ, ānanda, andhakāro antaradhāyissati, āloko pātubhavissatī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Seyyathāpi vā panānanda, abhido majjhanhike bhattakālasamaye, jāneyyāsi tvaṃ, ānanda, andhakāro antarahito āloko pātubhūto’’ti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho ahaṃ, ānanda, idhekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa akusalā dhammā antarahitā, kusalā dhammā sammukhībhūtā. Atthi ca khvassa akusalamūlaṃ asamucchinnaṃ, tampi sabbena sabbaṃ samugghātaṃ gacchati. Evamayaṃ puggalo āyatiṃ aparihānadhammo bhavissatī’ti. Evampi kho, ānanda, tathāgatassa purisapuggalo cetasā ceto paricca vidito hoti. Evampi kho, ānanda, tathāgatassa purisindriyañāṇaṃ cetasā ceto paricca viditaṃ hoti. Evampi kho, ānanda, tathāgatassa āyatiṃ dhammasamuppādo cetasā ceto paricca vidito hoti. ‘‘Idha panāhaṃ, ānanda, ekaccaṃ puggalaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘natthi imassa puggalassa vālaggakoṭinittudanamattopi akusalo dhammo, samannāgatoyaṃ puggalo ekantasukkehi anavajjehi dhammehi, diṭṭheva dhamme parinibbāyissatī’ti. Seyyathāpi, ānanda, aṅgārāni sītāni nibbutāni sukkhe tiṇapuñje vā kaṭṭhapuñje vā nikkhittāni. Jāneyyāsi tvaṃ, ānanda, nayimāni aṅgārāni vuḍḍhiṃ virūḷhiṃ vepullaṃ āpajjissantī’’ti? ‘‘Evaṃ, bhante’’. ‘‘Evamevaṃ kho ahaṃ, ānanda, idhekaccaṃ puggalaṃ evaṃ cetasā ceto paricca pajānāmi – ‘imassa kho puggalassa vijjamānā kusalāpi dhammā akusalāpi dhammā’ti. Tamenaṃ aparena samayena evaṃ cetasā ceto paricca pajānāmi – ‘natthi imassa puggalassa vālaggakoṭinittudanamattopi akusalo dhammo, samannāgatoyaṃ puggalo ekantasukkehi anavajjehi dhammehi, diṭṭheva dhamme parinibbāyissatī’ti. Evampi kho, ānanda, tathāgatassa purisapuggalo cetasā ceto paricca vidito hoti. Evampi kho, ānanda, tathāgatassa purisindriyañāṇaṃ cetasā ceto paricca viditaṃ hoti. Evampi kho, ānanda, tathāgatassa āyatiṃ dhammasamuppādo cetasā ceto paricca vidito hoti. ‘‘Tatrānanda, ye te purimā tayo puggalā tesaṃ tiṇṇaṃ puggalānaṃ eko aparihānadhammo, eko parihānadhammo, eko āpāyiko nerayiko. Tatrānanda, yeme pacchimā tayo puggalā imesaṃ tiṇṇaṃ puggalānaṃ eko parihānadhammo, eko aparihānadhammo, eko parinibbānadhammo’’ti. Aṭṭhamaṃ.",
      "english": "Thus have I heard: On one occasion the Blessed One, while on a tour in the Kosala country together with a large community of monastics, arrived at a Kosalan town named Daṇḍakappaka. Then the Blessed One, turning aside from the road, sat down on a prepared seat at the foot of a certain tree. And those monastics entered Daṇḍakappaka to search for lodging.\n\nThen Venerable Ānanda, together with several monastics, went to the Aciravatī river to bathe their bodies. After bathing their bodies in the Aciravatī river and returning, he stood, clad in a single robe, drying his body.\n\nThen a certain monastic approached Venerable Ānanda; and having approached, he said to Venerable Ānanda, “Friend Ānanda, was Devadatta declared by the Blessed One, having fully discerned his entire mental state—‘Devadatta is headed for a state of woe, an inhabitant of hell, destined for an eon, beyond recovery’—or was it in some other way?” “Indeed, friend, it was declared by the Blessed One in that manner.”\n\nThen Venerable Ānanda went to the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, Venerable Ānanda said to the Blessed One, “Here, venerable sir, I went with several monastics to the Aciravatī river to bathe our bodies. After bathing our bodies in the Aciravatī river and returning, I stood clad in a single robe, drying my body. Then, venerable sir, a certain monastic approached me; having approached, he said to me, ‘Friend Ānanda, was Devadatta declared by the Blessed One, having fully discerned his entire mental state—‘Devadatta is headed for a state of woe, an inhabitant of hell, destined for an eon, beyond recovery’—or was it in some other way?’ When this was said, venerable sir, I told that monastic, ‘Indeed, friend, it was declared by the Blessed One in that manner.’”\n\n“That monastic, Ānanda, must be either new, recently ordained, or an elder who is foolish and inexperienced. How could there be any doubt about that which I have unequivocally declared? Ānanda, I do not perceive even one other individual whom I have thus declared, having fully discerned their entire mental state, in the same way as Devadatta. As long as I perceived even a hair-tip's worth of wholesome qualities in Devadatta, I did not declare Devadatta to be ‘headed for a state of woe, an inhabitant of hell, destined for an eon, beyond recovery.’ But when I no longer perceived even a hair-tip's worth of wholesome qualities in Devadatta, then I declared Devadatta to be ‘headed for a state of woe, an inhabitant of hell, destined for an eon, beyond recovery.’\n\n“Just as, Ānanda, if there were a pit of excrement, more than a man's height deep, filled to the brim with excrement. And a man were immersed in it up to his head. And some person should come, wishing for his welfare, his benefit, his security from bondage, desiring to pull him out of that pit of excrement. That person, going around the entire pit, would not see even a hair-tip's worth of the man's body that was not smeared with excrement, by which he could grasp him and pull him out. Even so, Ānanda, when I no longer perceived even a hair-tip's worth of wholesome qualities in Devadatta, then I declared Devadatta to be ‘headed for a state of woe, an inhabitant of hell, destined for an eon, beyond recovery.’ If you wish, Ānanda, I shall expound upon the Tathāgata’s knowledge of the faculties of individuals.” “Venerable sir, it is time; Fortunate One, it is time for the Blessed One to expound upon the knowledge of the faculties of individuals. Having heard it from the Blessed One, the monastics will remember it.”\n\n“In that case, Ānanda, listen, and pay careful attention; I shall speak.” “Yes, venerable sir,” Venerable Ānanda replied to the Blessed One. The Blessed One said: “Here, Ānanda, I discern the mind of a certain individual with my own mind, thus: ‘This individual has both wholesome and unwholesome qualities present.’\n\nThen, at a later time, I discern that individual’s mind with my own mind, thus: ‘This individual’s wholesome qualities have disappeared, and unwholesome qualities have become manifest. Yet, the root of wholesome qualities within them is not severed, and from that, wholesome qualities will reappear for them. Thus, this individual will not be subject to decline in the future.’\n\n“Just as, Ānanda, seeds that are unbroken, unspoiled, not damaged by wind or sun, mature, well-planted in a good field, in well-prepared soil. Would you know, Ānanda, that these seeds will grow, sprout, and come to full development?” “Yes, venerable sir.”\n\n“Even so, Ānanda, here I discern the mind of a certain individual with my own mind, thus: ‘This individual has both wholesome and unwholesome qualities present.’\n\nThen, at a later time, I comprehend by encompassing his mind with my own mind: ‘In this person, wholesome qualities have disappeared, unwholesome qualities have come to the fore. However, his root of wholesome conduct is not entirely eradicated; therefore, wholesome qualities will again manifest for him. Thus, this person will not decline in the future.’ In this way, Ananda, the individual person is known by the Tathagata, by encompassing his mind with his own mind. In this way, Ananda, the faculties of that person are known by the Tathagata, by encompassing his mind with his own mind. In this way, Ananda, the future arising of qualities is known by the Tathagata, by encompassing his mind with his own mind.\n\n“Furthermore, Ananda, in this teaching, I comprehend a certain person by encompassing his mind with my own mind: ‘In this person, both wholesome and unwholesome qualities exist.’ Then, at a later time, I comprehend by encompassing his mind with my own mind: ‘In this person, unwholesome qualities have disappeared, wholesome qualities have come to the fore. However, his root of unwholesome conduct is not entirely eradicated; therefore, unwholesome qualities will again manifest for him. Thus, this person will decline in the future.’ Just as, Ananda, seeds that are unbroken, not rotten, not damaged by wind or sun, mature, and well-stored, are placed on a bare rock. Would you know, Ananda, whether these seeds would come to growth, increase, and fullness?” “Yes, Venerable Sir.”\n\n“In the same way, Ananda, in this teaching, I comprehend a certain person by encompassing his mind with my own mind: ‘In this person, both wholesome and unwholesome qualities exist.’ Then, at a later time, I comprehend by encompassing his mind with my own mind: ‘In this person, unwholesome qualities have disappeared, wholesome qualities have come to the fore. However, his root of unwholesome conduct is not entirely eradicated; therefore, unwholesome qualities will again manifest for him. Thus, this person will decline in the future.’ In this way, Ananda, the individual person is known by the Tathagata, by encompassing his mind with his own mind. In this way, Ananda, the faculties of that person are known by the Tathagata, by encompassing his mind with his own mind. In this way, Ananda, the future arising of qualities is known by the Tathagata, by encompassing his mind with his own mind.\n\n“Furthermore, Ananda, in this teaching, I comprehend a certain person by encompassing his mind with my own mind: ‘In this person, both wholesome and unwholesome qualities exist.’ Then, at a later time, I comprehend by encompassing his mind with my own mind: ‘In this person, there is not even a white quality equivalent to the tip of a hair's breadth. This person is endowed solely with utterly dark, unwholesome qualities, and upon the breakup of the body, after death, he will be reborn in a state of deprivation, a bad destination, a state of ruin, in hell.’ Just as, Ananda, seeds that are broken, rotten, and damaged by wind and sun, are placed in a good field that has been well-prepared. Would you know, Ananda, whether these seeds would come to growth, increase, and fullness?” “Yes, Venerable Sir.”\n\n“In the same way, Ananda, in this teaching, I comprehend a certain person by encompassing his mind with my own mind: ‘In this person, both wholesome and unwholesome qualities exist.’ Then, at a later time, I comprehend by encompassing his mind with my own mind: ‘In this person, there is not even a white quality equivalent to the tip of a hair's breadth. This person is endowed solely with utterly dark, unwholesome qualities, and upon the breakup of the body, after death, he will be reborn in a state of deprivation, a bad destination, a state of ruin, in hell.’ In this way, Ananda, the individual person is known by the Tathagata, by encompassing his mind with his own mind. In this way, Ananda, the faculties of that person are known by the Tathagata, by encompassing his mind with his own mind. In this way, Ananda, the future arising of qualities is known by the Tathagata, by encompassing his mind with his own mind.”\n\nWhen this was said, Venerable Ananda said to the Blessed One: “Venerable Sir, is it possible to declare three other types of persons corresponding to these three?” “It is possible, Ananda,” the Blessed One said. “Here, Ananda, I comprehend a certain person by encompassing his mind with my own mind: ‘In this person, both wholesome and unwholesome qualities exist.’ Then, at a later time, I comprehend by encompassing his mind with my own mind: ‘In this person, wholesome qualities have disappeared, unwholesome qualities have come to the fore. His root of wholesome conduct, although not entirely eradicated at first, is now utterly destroyed. Thus, this person will decline in the future.’ Just as, Ananda, glowing embers, ablaze and fully incandescent, are placed on a bare rock. Would you know, Ananda, whether these embers would come to growth, increase, and fullness?” “Yes, Venerable Sir.”\n\nJust as, Ānanda, when the sun is setting in the evening, would you know, Ānanda, that the light will vanish and darkness will appear? “Yes, Venerable Sir.” Just as, Ānanda, in the depth of midnight at mealtime, would you know, Ānanda, that the light has vanished and darkness has appeared? “Yes, Venerable Sir.” In the same way, Ānanda, I comprehend the mind of a certain individual with my own mind, thus: ‘This person indeed possesses both wholesome and unwholesome states.’ Then, at a later time, I comprehend his mind with my own mind, thus: ‘This person’s wholesome states have vanished, and unwholesome states have become manifest. Furthermore, any unsevered root of wholesome action he may have, that too is being eradicated completely. Thus, this person will be one prone to decline in the future.’ In this way, Ānanda, the individual person is known by the Tathāgata, having comprehended his mind with His own mind. In this way, Ānanda, the knowledge of the individual's faculties is known by the Tathāgata, having comprehended his mind with His own mind. In this way, Ānanda, the future arising of states is known by the Tathāgata, having comprehended his mind with His own mind.\n\nFurthermore, Ānanda, in this teaching, I comprehend the mind of a certain individual with my own mind, thus: ‘This person indeed possesses both wholesome and unwholesome states.’ Then, at a later time, I comprehend his mind with my own mind, thus: ‘This person’s unwholesome states have vanished, and wholesome states have become manifest. Furthermore, any unsevered root of unwholesome action he may have, that too is being eradicated completely. Thus, this person will be one not prone to decline in the future.’ Just as, Ānanda, burning, blazing, radiating coals placed on a pile of dry grass or a pile of dry wood. Would you know, Ānanda, that these coals will grow, develop, and expand? “Yes, Venerable Sir.” Just as, Ānanda, when the sun is rising in the early dawn, would you know, Ānanda, that darkness will vanish and light will appear? “Yes, Venerable Sir.” Just as, Ānanda, in the depth of midday at mealtime, would you know, Ānanda, that darkness has vanished and light has appeared? “Yes, Venerable Sir.” In the same way, Ānanda, I comprehend the mind of a certain individual with my own mind, thus: ‘This person indeed possesses both wholesome and unwholesome states.’ Then, at a later time, I comprehend his mind with my own mind, thus: ‘This person’s unwholesome states have vanished, and wholesome states have become manifest. Furthermore, any unsevered root of unwholesome action he may have, that too is being eradicated completely. Thus, this person will be one not prone to decline in the future.’ In this way, Ānanda, the individual person is known by the Tathāgata, having comprehended his mind with His own mind. In this way, Ānanda, the knowledge of the individual's faculties is known by the Tathāgata, having comprehended his mind with His own mind. In this way, Ānanda, the future arising of states is known by the Tathāgata, having comprehended his mind with His own mind.\n\nFurthermore, Ānanda, in this teaching, I comprehend the mind of a certain individual with my own mind, thus: ‘This person indeed possesses both wholesome and unwholesome states.’ Then, at a later time, I comprehend his mind with my own mind, thus: ‘This person has not even an unwholesome state as minute as the tip of a hair. This person is endowed with entirely pure and blameless states, and will attain final liberation in this very life.’ Just as, Ānanda, cold, extinguished coals placed on a pile of dry grass or a pile of dry wood. Would you know, Ānanda, that these coals will not grow, develop, or expand? “Yes, Venerable Sir.” In the same way, Ānanda, I comprehend the mind of a certain individual with my own mind, thus: ‘This person indeed possesses both wholesome and unwholesome states.’ Then, at a later time, I comprehend his mind with my own mind, thus: ‘This person has not even an unwholesome state as minute as the tip of a hair. This person is endowed with entirely pure and blameless states, and will attain final liberation in this very life.’ In this way, Ānanda, the individual person is known by the Tathāgata, having comprehended his mind with His own mind. In this way, Ānanda, the knowledge of the individual's faculties is known by the Tathāgata, having comprehended his mind with His own mind. In this way, Ānanda, the future arising of states is known by the Tathāgata, having comprehended his mind with His own mind.\n\nIn this regard, Ānanda, of those three former persons, one is one whose nature is not to decline, one is one whose nature is to decline, and one is destined for states of woe, for hell. In this regard, Ānanda, of these three latter persons, one is one whose nature is to decline, one is one whose nature is not to decline, and one is one whose nature is to attain complete Nibbāna.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී.\n\nඑක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මහත් භික්ෂුසඞ්ඝයක් සමඟ කෝසල ජනපදයේ චාරිකාවේ වඩිමින් දණ්ඩකප්පක නම් වූ කෝසලවරුන්ගේ නියම්ගම වෙත වැඩමකළ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ මගින් බැස යම් කිසි රුක් මුලක පණවන ලද ආසනයක වැඩහුන් සේක. ඒ භික්ෂූහු ආවාසයක් සොයා දණ්ඩකප්පකයට පිවිසුණහ. ඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ බොහෝ භික්ෂූන් සමඟ ශරීරය සෝදා ගැනීමට අචිරවතී නදිය වෙත එළඹුණ සේක. අචිරවතී නදියෙහි ශරීරය සෝදා, ගොඩට නැඟී, එක සිවුරක් පොරවාගෙන ශරීරය වියළා ගනිමින් සිටි සේක. ඉක්බිති එක්තරා භික්ෂුවක් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වෙත එළඹ, එළඹ, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙය පැවසීය – \"ඇවැත් ආනන්දයෙනි, දේවදත්ත ආපයාත්මක බවත්, නිරයට වැටෙන බවත්, කල්පයක් පුරා එහි සිටින බවත්, සුවකළ නොහැකි බවත් භාග්‍යවතුන් වහන්සේ සිතෙහි සියල්ල මෙනෙහි කර සම්පූර්ණයෙන්ම වදාළ සේක්ද, එසේ නොමැති නම් යම් කිසි කරුණකින් වදාළ සේක්ද?\" \"ඇවැත්නි, ඒ කාරණය භාග්‍යවතුන් වහන්සේ විසින් එසේම වදාරණ ලදී.\"\n\nඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹ, එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූ සේක. එක් පසෙකින් වැඩහුන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූ සේක – \"භාග්‍යවතුන් වහන්ස, මෙහිදී මම බොහෝ භික්ෂූන් සමඟ ශරීරය සෝදා ගැනීමට අචිරවතී නදිය වෙත එළඹියෙමි. අචිරවතී නදියෙහි ශරීරය සෝදා, ගොඩට නැඟී, එක සිවුරක් පොරවාගෙන ශරීරය වියළා ගනිමින් සිටියෙමි. භාග්‍යවතුන් වහන්ස, ඉක්බිති එක්තරා භික්ෂුවක් මා වෙත එළඹ, එළඹ, මට මෙසේ පැවසීය – ‘ඇවැත් ආනන්දයෙනි, දේවදත්ත ආපයාත්මක බවත්, නිරයට වැටෙන බවත්, කල්පයක් පුරා එහි සිටින බවත්, සුවකළ නොහැකි බවත් භාග්‍යවතුන් වහන්සේ සිතෙහි සියල්ල මෙනෙහි කර සම්පූර්ණයෙන්ම වදාළ සේක්ද, එසේ නොමැති නම් යම් කිසි කරුණකින් වදාළ සේක්ද?’ මෙසේ පැවසූ කල්හි, භාග්‍යවතුන් වහන්ස, මම ඒ භික්ෂුවට මෙසේ පැවසුවෙමි – ‘ඇවැත්නි, ඒ කාරණය භාග්‍යවතුන් වහන්සේ විසින් එසේම වදාරණ ලදී’ යනුවෙනි.\"\n\n\"ආනන්දයෙනි, ඒ භික්ෂුව අලුත් පැවිදි වූ, මෑතකදී පැවිදි වූ කෙනෙක් හෝ විය හැකියි, නැතහොත් වයස්ගත වුවත් බාල, අව්‍යක්ත කෙනෙක් හෝ විය හැකියි. මා විසින් එකාන්තයෙන් වදාරණ ලද දෙයක් පිළිබඳව කෙසේ නම් සැකයක් ඇති විය හැකිද! ආනන්දයෙනි, දේවදත්තයා පිළිබඳව යම් සේ මා විසින් සිතෙහි සියල්ල සම්පූර්ණයෙන්ම මෙනෙහි කර වදාරණ ලද්දේ ද, ඒ ආකාරයට වදාරණ ලද වෙනත් එක පුද්ගලයෙක්වත් මම නොදකිමි. ආනන්දයෙනි, යම්තාක් කල් දේවදත්තයාගේ කෙස් අගක් පමණවත් කුසල ධර්මයක් මම දුටුවා නම්; ඒ තාක් කල් මම දේවදත්තයා ‘ආපයාත්මක ය, නිරයට වැටෙන සුළු ය, කල්පයක් පුරා එහි සිටින්නේ ය, සුවකළ නොහැකි ය’ යැයි නොපැවසුවෙමි. ආනන්දයෙනි, යම් කලක දේවදත්තයාගේ කෙස් අගක් පමණවත් කුසල ධර්මයක් මම නොදුටුවෙම් ද; එකල්හි මම දේවදත්තයා ‘ආපයාත්මක ය, නිරයට වැටෙන සුළු ය, කල්පයක් පුරා එහි සිටින්නේ ය, සුවකළ නොහැකි ය’ යැයි පැවසුවෙමි.\n\nආනන්දයෙනි, යම් සේ එක් පුරුෂයෙකුගේ උසටත් වඩා පිරී, අසූචිවලින් අඩක් පමණ පිරී ඉතිරී ගිය අසූචි වළක් වේද, එහි එක් පුරුෂයෙක් හිසද සමඟ ගිලී සිටින්නට පුළුවන. එම පුද්ගලයාට වැඩ කැමති, හිත කැමති, යෝගක්ෂේමය කැමති, ඒ අසූචි වළෙන් ඔහුව ගොඩ ගැනීමට කැමති යම් කිසි පුරුෂයෙක් පහළ වනු ඇත. ඔහු ඒ අසූචි වළ වටා සිව් දිසාවටම යමින්, අසූචියෙන් තැවරී නොමැති, අල්ලාගෙන ගොඩට ගැනීමට හැකි කෙස් අගක් පමණවත් ස්ථානයක් ඒ පුරුෂයාගේ ශරීරයෙහි නොදකිනු ඇත. ආනන්දයෙනි, එපරිද්දෙන්ම මම දේවදත්තයාගේ කෙස් අගක් පමණවත් කුසල ධර්මයක් නොදුටුවෙම් ද; එකල්හි මම දේවදත්තයා ‘ආපයාත්මක ය, නිරයට වැටෙන සුළු ය, කල්පයක් පුරා එහි සිටින්නේ ය, සුවකළ නොහැකි ය’ යැයි පැවසුවෙමි. ආනන්දයෙනි, යම් හෙයකින් නුඹලාට ඇසීමට කැමැත්තක් ඇත්නම්, මම තථාගතයන් වහන්සේගේ පුරිසින්ද්‍රිය ඥාන විස්තර කරන්නෙමි.\"\n\n\"භාග්‍යවතුන් වහන්ස, මේ සඳහා කාලය යි; සුගතයන් වහන්ස, භාග්‍යවතුන් වහන්සේ පුරිසින්ද්‍රිය ඥාන විස්තර කිරීමට මෙය සුදුසු කාලය යි. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය ධාරණය කර ගනු ඇත.\"\n\n\"එසේ නම්, ආනන්දයෙනි, අසන්න, මනාව මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.\" \"එසේ ය, භාග්‍යවතුන් වහන්සැ\" යි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන් සේක. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක – \"ආනන්දයෙනි, මෙහිදී මම යම් කිසි පුද්ගලයෙකු පිළිබඳව සිතින් සිත අවබෝධ කරගනිමින් මෙසේ දනිමි – ‘මේ පුද්ගලයාට කුසල ධර්ම ද පවතිත්, අකුසල ධර්ම ද පවතිත්’ කියා.\n\nපසුව තවත් සමයක මම ඔහුව සිතින් සිත අවබෝධ කරගනිමින් මෙසේ දනිමි – ‘මේ පුද්ගලයාගේ කුසල ධර්ම අතුරුදහන් වී ඇත, අකුසල ධර්ම මුහුණට පැමිණ ඇත. නමුත් ඔහුගේ කුසල මූලයක් සිඳී නොගොස් පවතී. එම නිසා ඔහුට කුසලයෙන් කුසලයක් පහළ වනු ඇත. මෙසේ මේ පුද්ගලයා අනාගතයේ දී පිරිහීමට පත් නොවන ස්වභාවය ඇත්තෙක් වනු ඇත’ යනුවෙනි. ආනන්දයෙනි, යම් සේ නොබිඳුණු, නරක් නොවුණු, සුළඟින් හා අව්වෙන් නොනැසී ගිය, සාරවත්, මනාව රෝපණය කරන ලද බීජ, හොඳින් සකස් කරන ලද සාරවත් භූමියක තබන ලද ද, මේ බීජ වර්ධනයටත්, වැඩීමටත්, විශාලත්වයටත් පැමිණෙනු ඇතැයි ඔබ දන්නේද?\" \"එසේ ය, භාග්‍යවතුන් වහන්ස.\" \"ආනන්දයෙනි, එපරිද්දෙන්ම මම මෙහිදී යම් කිසි පුද්ගලයෙකු පිළිබඳව සිතින් සිත අවබෝධ කරගනිමින් මෙසේ දනිමි – ‘මේ පුද්ගලයාට කුසල ධර්ම ද පවතිත්, අකුසල ධර්ම ද පවතිත්’ කියා.\n\nපසුව මම එම පුද්ගලයාගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාගේ කුසල් ධර්ම අතුරුදහන් වී, අකුසල් ධර්ම මතු වී ඇත. එහෙත් ඔහුගේ කුසල මූලයන් සිඳී ගොස් නැත. එබැවින් ඔහුට කුසල් මතු වනු ඇත. මේ පුද්ගලයා අනාගතයේදී පිරිහීමට ලක් නොවන ස්වභාවයෙන් යුක්ත වනු ඇතැයි.' ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට පුද්ගලයෙකුගේ චේතෝපරිය ඥානයෙන් ඔහුගේ පුද්ගල ස්වභාවය අවබෝධ වේ. ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට චේතෝපරිය ඥානයෙන් පුද්ගලයෙකුගේ ඉන්ද්‍රියයන්ගේ පරිණත බව පිළිබඳ ඥානය අවබෝධ වේ. ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට චේතෝපරිය ඥානයෙන් පුද්ගලයෙකුගේ අනාගත ධර්මෝත්පත්තිය (ධර්මයන්ගේ පහළවීම) අවබෝධ වේ.\n\nආනන්දයෙනි, මෙහිදී මම එක්තරා පුද්ගලයෙකුගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාට කුසල් ධර්මද, අකුසල් ධර්මද යන දෙකම පවතී.' පසුව මම එම පුද්ගලයාගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාගේ අකුසල් ධර්ම අතුරුදහන් වී, කුසල් ධර්ම මතු වී ඇත. එහෙත් ඔහුගේ අකුසල මූලයන් සිඳී ගොස් නැත. එබැවින් ඔහුට අකුසල් මතු වනු ඇත. මේ පුද්ගලයා අනාගතයේදී පිරිහීමට ලක්වන ස්වභාවයෙන් යුක්ත වනු ඇතැයි.' ආනන්දයෙනි, යම් සේ නොකැඩුණු, නොකුණු වූ, සුළං සහ හිරු රශ්මියෙන් නොනැසුණු, හොඳින් වැඩුණු, සුවසේ තබාගත් බීජ මහපොළොව මත තබා තිබේද, ආනන්දයෙනි, ඔබ දන්නවාද, මේ බීජ වැඩීමක්, පැළවීමක්, විපුලත්වයක් (මහත් ඵලයක්) නොලබන බව? \"එසේය, භාග්‍යවතුන් වහන්ස.\" ආනන්දයෙනි, මේ අයුරින්ම මම එක්තරා පුද්ගලයෙකුගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාට කුසල් ධර්මද, අකුසල් ධර්මද යන දෙකම පවතී.' පසුව මම එම පුද්ගලයාගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාගේ අකුසල් ධර්ම අතුරුදහන් වී, කුසල් ධර්ම මතු වී ඇත. එහෙත් ඔහුගේ අකුසල මූලයන් සිඳී ගොස් නැත. එබැවින් ඔහුට අකුසල් මතු වනු ඇත. මේ පුද්ගලයා අනාගතයේදී පිරිහීමට ලක්වන ස්වභාවයෙන් යුක්ත වනු ඇතැයි.' ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට පුද්ගලයෙකුගේ චේතෝපරිය ඥානයෙන් ඔහුගේ පුද්ගල ස්වභාවය අවබෝධ වේ. ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට චේතෝපරිය ඥානයෙන් පුද්ගලයෙකුගේ ඉන්ද්‍රියයන්ගේ පරිණත බව පිළිබඳ ඥානය අවබෝධ වේ. ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට චේතෝපරිය ඥානයෙන් පුද්ගලයෙකුගේ අනාගත ධර්මෝත්පත්තිය අවබෝධ වේ.\n\nආනන්දයෙනි, මෙහිදී මම එක්තරා පුද්ගලයෙකුගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාට කුසල් ධර්මද, අකුසල් ධර්මද යන දෙකම පවතී.' පසුව මම එම පුද්ගලයාගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාට හිසකෙස් අගක් තරම් හෝ කුසල ධර්මයක් නොමැත. මේ පුද්ගලයා ඒකාන්තයෙන් කළු පැහැති (සම්පූර්ණයෙන්ම අකුසල) ධර්මයන්ගෙන් යුක්තය. කය බිඳී මරණයෙන් පසු අපායට, දුගතියට, විනිපාතයට, නිරයට උපදිනු ඇතැයි.' ආනන්දයෙනි, යම් සේ කැඩුණු, කුණු වූ, සුළං සහ හිරු රශ්මියෙන් නැසූ බීජ හොඳින් සකස් කළ කෙතක පොළොව මත තබා තිබේද, ආනන්දයෙනි, ඔබ දන්නවාද, මේ බීජ වැඩීමක්, පැළවීමක්, විපුලත්වයක් නොලබන බව? \"එසේය, භාග්‍යවතුන් වහන්ස.\" ආනන්දයෙනි, මේ අයුරින්ම මම එක්තරා පුද්ගලයෙකුගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාට කුසල් ධර්මද, අකුසල් ධර්මද යන දෙකම පවතී.' පසුව මම එම පුද්ගලයාගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාට හිසකෙස් අගක් තරම් හෝ කුසල ධර්මයක් නොමැත. මේ පුද්ගලයා ඒකාන්තයෙන් කළු පැහැති (සම්පූර්ණයෙන්ම අකුසල) ධර්මයන්ගෙන් යුක්තය. කය බිඳී මරණයෙන් පසු අපායට, දුගතියට, විනිපාතයට, නිරයට උපදිනු ඇතැයි.' ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට පුද්ගලයෙකුගේ චේතෝපරිය ඥානයෙන් ඔහුගේ පුද්ගල ස්වභාවය අවබෝධ වේ. ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට චේතෝපරිය ඥානයෙන් පුද්ගලයෙකුගේ ඉන්ද්‍රියයන්ගේ පරිණත බව පිළිබඳ ඥානය අවබෝධ වේ. ආනන්දයෙනි, මේ අයුරින් තථාගතයන් වහන්සේට චේතෝපරිය ඥානයෙන් පුද්ගලයෙකුගේ අනාගත ධර්මෝත්පත්තිය අවබෝධ වේ.\n\nමෙසේ පැවසූ විට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: \"භාග්‍යවතුන් වහන්ස, මේ පුද්ගලයන් තිදෙනාට සමාන වූ තවත් පුද්ගලයන් තිදෙනෙකු පෙන්වා දීමට හැකිදැයි?\" \"ආනන්දයෙනි, පුළුවනැයි\" භාග්‍යවතුන් වහන්සේ වදාළ සේක: \"ආනන්දයෙනි, මෙහිදී මම එක්තරා පුද්ගලයෙකුගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාට කුසල් ධර්මද, අකුසල් ධර්මද යන දෙකම පවතී.' පසුව මම එම පුද්ගලයාගේ සිත චේතෝපරිය ඥානයෙන් විනිවිද මෙසේ දැනගනිමි: 'මේ පුද්ගලයාගේ කුසල් ධර්ම අතුරුදහන් වී, අකුසල් ධර්ම මතු වී ඇත. එහෙත් ඔහුගේ කුසල මූලයන් සිඳී ගොස් නොතිබුණත්, එයද සම්පූර්ණයෙන්ම උදුරා දමයි (සමුච්ඡේදනය කරයි). මේ පුද්ගලයා අනාගතයේදී පිරිහීමට ලක්වන ස්වභාවයෙන් යුක්ත වනු ඇතැයි.' ආනන්දයෙනි, යම් සේ දැල්වී, මනාව ඇවිළී, දීප්තිමත්ව බැබලෙන ගිනි අඟුරු මහපොළොව මත තබා තිබේද, ආනන්දයෙනි, ඔබ දන්නවාද, මේ ගිනි අඟුරු වැඩීමක්, පැළවීමක්, විපුලත්වයක් නොලබන බව? \"එසේය, භාග්‍යවතුන් වහන්ස.\"\n\nආනන්දයෙනි, යම් සේ සවස් යාමයේ, හිරු බැස යන විට, ආලෝකය අතුරුදන් වී අන්ධකාරය ඇතිවන්නේ යැයි ඔබ දන්නේද? එසේය, භාග්‍යවතුන් වහන්ස. ආනන්දයෙනි, එසේම මධ්‍යම රාත්‍රියෙහි, භෝජන වේලාවෙහි, ආලෝකය නැතිවී අන්ධකාරය ඇතිවී තිබේ යැයි ඔබ දන්නේද? එසේය, භාග්‍යවතුන් වහන්ස. ආනන්දයෙනි, එලෙසින්ම මම මෙහිලා එක්තරා පුද්ගලයෙකුගේ සිත, මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයා තුළ කුසල ධර්මයන් ද අකුසල ධර්මයන් ද පවතී’ කියා. පසුව තවත් කලෙක, මම ඔහුගේ සිත, මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයාගේ කුසල ධර්මයන් අතුරුදහන් වී ඇත, අකුසල ධර්මයන් ඔහුට මුහුණට මුහුණලා (ඉදිරියට පැමිණ) ඇත. තවද, ඔහුගේ සිඳී නොගිය කුසල මූලයක් තිබුණද, එයද මුළුමනින්ම උදුරා දමනු ලැබේ (විනාශ වී යයි). මෙලෙස මේ පුද්ගලයා අනාගතයේදී පිරිහීමට ලක්වන ස්වභාවයෙන් යුක්ත වනු ඇත’ කියා. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට පුද්ගලයා සිතින් සිත පිරිසිඳ විදිත වේ. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට පුද්ගලයාගේ ඉන්ද්‍රියයන්ගේ පරිණතභාවය පිළිබඳ ඥානය සිතින් සිත පිරිසිඳ විදිත වේ. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට අනාගතයේදී ධර්මයන් හටගැනීම සිතින් සිත පිරිසිඳ විදිත වේ.\n\nආනන්දයෙනි, මෙහිලා තවත් එක්තරා පුද්ගලයෙකුගේ සිත, මම මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයා තුළ කුසල ධර්මයන් ද අකුසල ධර්මයන් ද පවතී’ කියා. පසුව තවත් කලෙක, මම ඔහුගේ සිත, මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයාගේ අකුසල ධර්මයන් අතුරුදහන් වී ඇත, කුසල ධර්මයන් ඔහුට මුහුණට මුහුණලා (ඉදිරියට පැමිණ) ඇත. තවද, ඔහුගේ සිඳී නොගිය අකුසල මූලයක් තිබුණද, එයද මුළුමනින්ම උදුරා දමනු ලැබේ (විනාශ වී යයි). මෙලෙස මේ පුද්ගලයා අනාගතයේදී නොපිරිහෙන ස්වභාවයෙන් යුක්ත වනු ඇත’ කියා. ආනන්දයෙනි, යම් සේ දැල්වූ, හොඳින් ඇවිලුණු, දීප්තිමත්ව ඇති අඟුරු, වියළි තණ ගොඩක හෝ දර ගොඩක තැබූ විට, මේ අඟුරු වර්ධනයට, පැතිරීමට, මහත් වීමට පැමිණෙන්නේ යැයි ඔබ දන්නේද? එසේය, භාග්‍යවතුන් වහන්ස. ආනන්දයෙනි, යම් සේ රාත්‍රියේ අලුයම් කාලයේ, හිරු උදා වන විට, අන්ධකාරය අතුරුදන් වී ආලෝකය ඇතිවන්නේ යැයි ඔබ දන්නේද? එසේය, භාග්‍යවතුන් වහන්ස. ආනන්දයෙනි, එසේම මධ්‍යාහ්න භෝජන වේලාවෙහි, අන්ධකාරය නැතිවී ආලෝකය ඇතිවී තිබේ යැයි ඔබ දන්නේද? එසේය, භාග්‍යවතුන් වහන්ස. ආනන්දයෙනි, එලෙසින්ම මම මෙහිලා එක්තරා පුද්ගලයෙකුගේ සිත, මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයා තුළ කුසල ධර්මයන් ද අකුසල ධර්මයන් ද පවතී’ කියා. පසුව තවත් කලෙක, මම ඔහුගේ සිත, මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයාගේ අකුසල ධර්මයන් අතුරුදහන් වී ඇත, කුසල ධර්මයන් ඔහුට මුහුණට මුහුණලා (ඉදිරියට පැමිණ) ඇත. තවද, ඔහුගේ සිඳී නොගිය අකුසල මූලයක් තිබුණද, එයද මුළුමනින්ම උදුරා දමනු ලැබේ (විනාශ වී යයි). මෙලෙස මේ පුද්ගලයා අනාගතයේදී නොපිරිහෙන ස්වභාවයෙන් යුක්ත වනු ඇත’ කියා. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට පුද්ගලයා සිතින් සිත පිරිසිඳ විදිත වේ. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට පුද්ගලයාගේ ඉන්ද්‍රියයන්ගේ පරිණතභාවය පිළිබඳ ඥානය සිතින් සිත පිරිසිඳ විදිත වේ. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට අනාගතයේදී ධර්මයන් හටගැනීම සිතින් සිත පිරිසිඳ විදිත වේ.\n\nආනන්දයෙනි, මෙහිලා තවත් එක්තරා පුද්ගලයෙකුගේ සිත, මම මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයා තුළ කුසල ධර්මයන් ද අකුසල ධර්මයන් ද පවතී’ කියා. පසුව තවත් කලෙක, මම ඔහුගේ සිත, මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයා තුළ කෙස් අගක් තරම්වත් අකුසල ධර්මයක් නැත, මේ පුද්ගලයා ඒකාන්තයෙන් පිරිසිදු වූ, නිර්වද්‍ය ධර්මයන්ගෙන් යුක්තය, ඔහු මේ ආත්මභාවයේදීම පිරිනිවන් පාන්නේය’ කියා. ආනන්දයෙනි, යම් සේ සිසිල් වූ, නිවී ගිය අඟුරු, වියළි තණ ගොඩක හෝ දර ගොඩක තැබූ විට, මේ අඟුරු වර්ධනයට, පැතිරීමට, මහත් වීමට පැමිණෙන්නේ නැතැයි ඔබ දන්නේද? එසේය, භාග්‍යවතුන් වහන්ස. ආනන්දයෙනි, එලෙසින්ම මම මෙහිලා එක්තරා පුද්ගලයෙකුගේ සිත, මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයා තුළ කුසල ධර්මයන් ද අකුසල ධර්මයන් ද පවතී’ කියා. පසුව තවත් කලෙක, මම ඔහුගේ සිත, මාගේ සිතින් පිරිසිඳ මෙසේ දනිමි: ‘මේ පුද්ගලයා තුළ කෙස් අගක් තරම්වත් අකුසල ධර්මයක් නැත, මේ පුද්ගලයා ඒකාන්තයෙන් පිරිසිදු වූ, නිර්වද්‍ය ධර්මයන්ගෙන් යුක්තය, ඔහු මේ ආත්මභාවයේදීම පිරිනිවන් පාන්නේය’ කියා. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට පුද්ගලයා සිතින් සිත පිරිසිඳ විදිත වේ. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට පුද්ගලයාගේ ඉන්ද්‍රියයන්ගේ පරිණතභාවය පිළිබඳ ඥානය සිතින් සිත පිරිසිඳ විදිත වේ. ආනන්දයෙනි, මෙලෙසින්ම තථාගතයන් වහන්සේට අනාගතයේදී ධර්මයන් හටගැනීම සිතින් සිත පිරිසිඳ විදිත වේ.\n\nආනන්දය, එහි යම් ඒ පෙර සිටි පුද්ගලයන් තිදෙනෙක් වෙත්ද, ඒ පුද්ගලයන් තිදෙනාගෙන් එක් අයෙක් තම අධිගමයන්ගෙන් පිරිහීමක් නැති ස්වභාවය ඇත්තෙක් වෙයි, එක් අයෙක් අධිගමයන්ගෙන් පිරිහෙන ස්වභාවය ඇත්තෙක් වෙයි, එක් අයෙක් දුගතිවලට හෙවත් නිරයට යන ස්වභාවය ඇත්තෙක් වෙයි.\nආනන්දය, එහි යම් මේ පසුකාලීන පුද්ගලයන් තිදෙනෙක් වෙත්ද, මේ පුද්ගලයන් තිදෙනාගෙන් එක් අයෙක් අධිගමයන්ගෙන් පිරිහෙන ස්වභාවය ඇත්තෙක් වෙයි, එක් අයෙක් අධිගමයන්ගෙන් පිරිහීමක් නැති ස්වභාවය ඇත්තෙක් වෙයි, එක් අයෙක් පිරිනිවන් පාන ස්වභාවය ඇත්තෙක් වෙයි.",
      "paliTitle": "Purisindriyañāṇasuttaṃ"
    },
    {
      "number": 63,
      "pali": "‘‘Nibbedhikapariyāyaṃ vo, bhikkhave, dhammapariyāyaṃ desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamo ca so, bhikkhave, nibbedhikapariyāyo dhammapariyāyo? Kāmā, bhikkhave, veditabbā, kāmānaṃ nidānasambhavo veditabbo, kāmānaṃ vemattatā veditabbā, kāmānaṃ vipāko veditabbo, kāmanirodho [kāmānaṃ nirodho (ka.) evaṃ vedanānirodho-iccādīsupi] veditabbo, kāmanirodhagāminī [kāmānaṃ nirodhagāminī (ka.) evaṃ vedanānirodhagāminī-iccādīsupi] paṭipadā veditabbā. ‘‘Vedanā, bhikkhave, veditabbā, vedanānaṃ nidānasambhavo veditabbo, vedanānaṃ vemattatā veditabbā, vedanānaṃ vipāko veditabbo, vedanānirodho veditabbo, vedanānirodhagāminī paṭipadā veditabbā. ‘‘Saññā, bhikkhave, veditabbā, saññānaṃ nidānasambhavo veditabbo, saññānaṃ vemattatā veditabbā, saññānaṃ vipāko veditabbo, saññānirodho veditabbo, saññānirodhagāminī paṭipadā veditabbā. ‘‘Āsavā, bhikkhave, veditabbā, āsavānaṃ nidānasambhavo veditabbo, āsavānaṃ vemattatā veditabbā, āsavānaṃ vipāko veditabbo, āsavanirodho veditabbo, āsavanirodhagāminī paṭipadā veditabbā. ‘‘Kammaṃ, bhikkhave, veditabbaṃ, kammānaṃ nidānasambhavo veditabbo, kammānaṃ vemattatā veditabbā, kammānaṃ vipāko veditabbo, kammanirodho veditabbo, kammanirodhagāminī paṭipadā veditabbā. ‘‘Dukkhaṃ, bhikkhave, veditabbaṃ, dukkhassa nidānasambhavo veditabbo, dukkhassa vemattatā veditabbā, dukkhassa vipāko veditabbo, dukkhanirodho veditabbo, dukkhanirodhagāminī paṭipadā veditabbā. ‘‘‘Kāmā, bhikkhave, veditabbā, kāmānaṃ nidānasambhavo veditabbo, kāmānaṃ vemattatā veditabbā, kāmānaṃ vipāko veditabbo, kāmanirodho veditabbo, kāmanirodhagāminī paṭipadā veditabbā’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ [ma. ni. 1.166; saṃ. ni. 4.268]? Pañcime, bhikkhave, kāmaguṇā – cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā, sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Api ca kho, bhikkhave, nete kāmā kāmaguṇā nāmete [te kāmaguṇā nāma nete kāmā (ka.)] ariyassa vinaye vuccanti – [kathā. 514] ‘‘Saṅkapparāgo purisassa kāmo, Nete [na te (syā.)] kāmā yāni citrāni loke; Saṅkapparāgo purisassa kāmo, Tiṭṭhanti citrāni tatheva loke; Athettha dhīrā vinayanti chanda’’nti. ‘‘Katamo ca, bhikkhave, kāmānaṃ nidānasambhavo? Phasso, bhikkhave, kāmānaṃ nidānasambhavo. ‘‘Katamā ca, bhikkhave, kāmānaṃ vemattatā? Añño, bhikkhave, kāmo rūpesu, añño kāmo saddesu, añño kāmo gandhesu, añño kāmo rasesu, añño kāmo phoṭṭhabbesu. Ayaṃ vuccati, bhikkhave, kāmānaṃ vemattatā. ‘‘Katamo ca, bhikkhave, kāmānaṃ vipāko? Yaṃ kho, bhikkhave, kāmayamāno tajjaṃ tajjaṃ attabhāvaṃ abhinibbatteti puññabhāgiyaṃ vā apuññabhāgiyaṃ vā, ayaṃ vuccati, bhikkhave, kāmānaṃ vipāko. ‘‘Katamo ca, bhikkhave, kāmanirodho? Phassanirodho [phassanirodhā (syā.)], bhikkhave, kāmanirodho. Ayameva ariyo aṭṭhaṅgiko maggo kāmanirodhagāminī paṭipadā, seyyathidaṃ – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi. ‘‘Yato kho [yato ca kho (bahūsu)], bhikkhave, ariyasāvako evaṃ kāme pajānāti, evaṃ kāmānaṃ nidānasambhavaṃ pajānāti, evaṃ kāmānaṃ vemattataṃ pajānāti, evaṃ kāmānaṃ vipākaṃ pajānāti, evaṃ kāmanirodhaṃ pajānāti, evaṃ kāmanirodhagāminiṃ paṭipadaṃ pajānāti, so imaṃ nibbedhikaṃ brahmacariyaṃ pajānāti kāmanirodhaṃ. Kāmā, bhikkhave, veditabbā…pe… kāmanirodhagāminī [sabbatthapi evameva dissati] paṭipadā veditabbāti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Vedanā, bhikkhave, veditabbā…pe… vedanānirodhagāminī paṭipadā veditabbāti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tisso imā, bhikkhave, vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. ‘‘Katamo ca, bhikkhave, vedanānaṃ nidānasambhavo? Phasso, bhikkhave, vedanānaṃ nidānasambhavo. ‘‘Katamā ca, bhikkhave, vedanānaṃ vemattatā? Atthi, bhikkhave, sāmisā sukhā vedanā, atthi nirāmisā sukhā vedanā, atthi sāmisā dukkhā vedanā, atthi nirāmisā dukkhā vedanā, atthi sāmisā adukkhamasukhā vedanā, atthi nirāmisā adukkhamasukhā vedanā. Ayaṃ vuccati, bhikkhave, vedanānaṃ vemattatā. ‘‘Katamo ca, bhikkhave, vedanānaṃ vipāko? Yaṃ kho, bhikkhave, vediyamāno [vedayamāno (syā. kaṃ.) a. ni. 4.233] tajjaṃ tajjaṃ attabhāvaṃ abhinibbatteti puññabhāgiyaṃ vā apuññabhāgiyaṃ vā, ayaṃ vuccati, bhikkhave, vedanānaṃ vipāko. ‘‘Katamo ca, bhikkhave, vedanānirodho? Phassanirodho [phassanirodhā (syā. kaṃ. ka.)], bhikkhave, vedanānirodho. Ayameva ariyo aṭṭhaṅgiko maggo vedanānirodhagāminī paṭipadā, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. ‘‘Yato kho, bhikkhave, ariyasāvako evaṃ vedanaṃ pajānāti, evaṃ vedanānaṃ nidānasambhavaṃ pajānāti, evaṃ vedanānaṃ vemattataṃ pajānāti, evaṃ vedanānaṃ vipākaṃ pajānāti, evaṃ vedanānirodhaṃ pajānāti, evaṃ vedanānirodhagāminiṃ paṭipadaṃ pajānāti. So imaṃ nibbedhikaṃ brahmacariyaṃ pajānāti vedanānirodhaṃ. Vedanā, bhikkhave, veditabbā…pe… vedanānirodhagāminī paṭipadā veditabbāti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Saññā, bhikkhave, veditabbā…pe… saññānirodhagāminī paṭipadā veditabbāti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Chayimā, bhikkhave, saññā – rūpasaññā, saddasaññā, gandhasaññā, rasasaññā, phoṭṭhabbasaññā, dhammasaññā. ‘‘Katamo ca, bhikkhave, saññānaṃ nidānasambhavo? Phasso, bhikkhave, saññānaṃ nidānasambhavo. ‘‘Katamā ca, bhikkhave, saññānaṃ vemattatā? Aññā, bhikkhave, saññā rūpesu, aññā saññā saddesu [aññā bhikkhave rūpesu saññā aññā saddesu saññā (ka.) evaṃ sesesupi], aññā saññā gandhesu, aññā saññā rasesu, aññā saññā phoṭṭhabbesu, aññā saññā dhammesu. Ayaṃ vuccati, bhikkhave, saññānaṃ vemattatā. ‘‘Katamo ca, bhikkhave, saññānaṃ vipāko? Vohāravepakkaṃ [vohāravepakkāhaṃ (syā. pī.), vohārapakkāhaṃ (sī.)], bhikkhave, saññaṃ [saññā (syā. pī.)] vadāmi. Yathā yathā naṃ sañjānāti tathā tathā voharati, evaṃ saññī ahosinti [ahosīti (ka.)]. Ayaṃ vuccati, bhikkhave, saññānaṃ vipāko. ‘‘Katamo ca, bhikkhave, saññānirodho? Phassanirodho, [phassanirodhā (syā. ka.)] bhikkhave, saññānirodho. Ayameva ariyo aṭṭhaṅgiko maggo saññānirodhagāminī paṭipadā, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. ‘‘Yato kho, bhikkhave, ariyasāvako evaṃ saññaṃ pajānāti, evaṃ saññānaṃ nidānasambhavaṃ pajānāti, evaṃ saññānaṃ vemattataṃ pajānāti, evaṃ saññānaṃ vipākaṃ pajānāti, evaṃ saññānirodhaṃ pajānāti, evaṃ saññānirodhagāminiṃ paṭipadaṃ pajānāti, so imaṃ nibbedhikaṃ brahmacariyaṃ pajānāti saññānirodhaṃ. Saññā, bhikkhave, veditabbā…pe… saññānirodhagāminī paṭipadā veditabbāti. Iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Āsavā, bhikkhave, veditabbā…pe… āsavanirodhagāminī [sabbatthapi evameva dissati] paṭipadā veditabbāti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tayome, bhikkhave, āsavā – kāmāsavo, bhavāsavo, avijjāsavo. ‘‘Katamo ca, bhikkhave, āsavānaṃ nidānasambhavo? Avijjā, bhikkhave, āsavānaṃ nidānasambhavo. ‘‘Katamā ca, bhikkhave, āsavānaṃ vemattatā? Atthi, bhikkhave, āsavā nirayagamanīyā [nirayagāminiyā (sī. ka.)], atthi āsavā tiracchānayonigamanīyā, atthi āsavā pettivisayagamanīyā, atthi āsavā manussalokagamanīyā, atthi āsavā devalokagamanīyā. Ayaṃ vuccati, bhikkhave, āsavānaṃ vemattatā. ‘‘Katamo ca, bhikkhave, āsavānaṃ vipāko? Yaṃ kho, bhikkhave, avijjāgato tajjaṃ tajjaṃ attabhāvaṃ abhinibbatteti puññabhāgiyaṃ vā apuññabhāgiyaṃ vā, ayaṃ vuccati, bhikkhave, āsavānaṃ vipāko. ‘‘Katamo ca, bhikkhave, āsavanirodho? Avijjānirodho, bhikkhave, āsavanirodho. Ayameva ariyo aṭṭhaṅgiko maggo āsavanirodhagāminī [sabbatthapi evameva dissati] paṭipadā, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. ‘‘Yato kho, bhikkhave, ariyasāvako evaṃ āsave pajānāti, evaṃ āsavānaṃ nidānasambhavaṃ pajānāti, evaṃ āsavānaṃ vemattataṃ pajānāti, evaṃ āsavānaṃ vipākaṃ pajānāti, evaṃ āsavānaṃ nirodhaṃ pajānāti, evaṃ āsavānaṃ nirodhagāminiṃ paṭipadaṃ pajānāti, so imaṃ nibbedhikaṃ brahmacariyaṃ pajānāti āsavanirodhaṃ. Āsavā, bhikkhave, veditabbā…pe… āsavanirodhagāminī [sabbatthapi evameva dissati] paṭipadā veditabbāti. Iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Kammaṃ, bhikkhave, veditabbaṃ…pe… kammanirodhagāminī [sabbatthapi evameva dissati] paṭipadā veditabbāti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? [kathā. 539] Cetanāhaṃ, bhikkhave, kammaṃ vadāmi. Cetayitvā kammaṃ karoti – kāyena vācāya manasā. ‘‘Katamo ca, bhikkhave, kammānaṃ nidānasambhavo? Phasso, bhikkhave, kammānaṃ nidānasambhavo. ‘‘Katamā ca, bhikkhave, kammānaṃ vemattatā? Atthi, bhikkhave, kammaṃ nirayavedanīyaṃ, atthi kammaṃ tiracchānayonivedanīyaṃ, atthi kammaṃ pettivisayavedanīyaṃ, atthi kammaṃ manussalokavedanīyaṃ, atthi kammaṃ devalokavedanīyaṃ. Ayaṃ vuccati, bhikkhave, kammānaṃ vemattatā. ‘‘Katamo ca, bhikkhave, kammānaṃ vipāko? Tividhāhaṃ [imāhaṃ (ka.)], bhikkhave, kammānaṃ vipākaṃ vadāmi – diṭṭheva [diṭṭhe vā (sī.)] dhamme, upapajje vā [upapajjaṃ vā (ka. sī., a. ni. 10.217), upapajja vā (?), ma. ni. 3.303 pāḷiyā tadatthavaṇṇanāya ca saṃsaddetabbaṃ], apare vā pariyāye. Ayaṃ vuccati, bhikkhave, kammānaṃ vipāko. ‘‘Katamo ca, bhikkhave, kammanirodho? Phassanirodho, [phassanirodhā (ka. sī. syā. ka.)] bhikkhave, kammanirodho. Ayameva ariyo aṭṭhaṅgiko maggo kammanirodhagāminī [sabbatthapi evameva dissati] paṭipadā, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. ‘‘Yato kho, bhikkhave, ariyasāvako evaṃ kammaṃ pajānāti, evaṃ kammānaṃ nidānasambhavaṃ pajānāti, evaṃ kammānaṃ vemattataṃ pajānāti, evaṃ kammānaṃ vipākaṃ pajānāti, evaṃ kammanirodhaṃ pajānāti, evaṃ kammanirodhagāminiṃ paṭipadaṃ pajānāti, so imaṃ nibbedhikaṃ brahmacariyaṃ pajānāti kammanirodhaṃ. Kammaṃ, bhikkhave, veditabbaṃ…pe… kammanirodhagāminī paṭipadā veditabbāti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Dukkhaṃ, bhikkhave, veditabbaṃ, dukkhassa nidānasambhavo veditabbo, dukkhassa vemattatā veditabbā, dukkhassa vipāko veditabbo, dukkhanirodho veditabbo, dukkhanirodhagāminī paṭipadā veditabbāti. Iti kho panetaṃ vuttaṃ, kiñcetaṃ paṭicca vuttaṃ? Jātipi dukkhā, jarāpi dukkhā, byādhipi dukkho [byādhipi dukkhā (syā. pī. ka.)], maraṇampi dukkhaṃ, sokaparidevadukkhadomanassupāyāsāpi dukkhā, yampicchaṃ na labhati tampi dukkhaṃ, saṃkhittena pañcupādānakkhandhā [pañcupādānakkhandhāpi (ka.)] dukkhā. ‘‘Katamo ca, bhikkhave, dukkhassa nidānasambhavo? Taṇhā, bhikkhave, dukkhassa nidānasambhavo. ‘‘Katamā ca, bhikkhave, dukkhassa vemattatā? Atthi, bhikkhave, dukkhaṃ adhimattaṃ, atthi parittaṃ, atthi dandhavirāgi, atthi khippavirāgi. Ayaṃ vuccati, bhikkhave, dukkhassa vemattatā. ‘‘Katamo ca, bhikkhave, dukkhassa vipāko? Idha, bhikkhave, ekacco yena dukkhena abhibhūto pariyādinnacitto [pariyādiṇṇacitto (ka.)] socati kilamati paridevati, urattāḷiṃ kandati, sammohaṃ āpajjati, yena vā pana dukkhena abhibhūto pariyādinnacitto bahiddhā pariyeṭṭhiṃ āpajjati – ‘ko [so na (ka.)] ekapadaṃ dvipadaṃ jānāti [pajānāti (ka.)] imassa dukkhassa nirodhāyā’ti? Sammohavepakkaṃ vāhaṃ, bhikkhave, dukkhaṃ vadāmi pariyeṭṭhivepakkaṃ vā. Ayaṃ vuccati, bhikkhave, dukkhassa vipāko. ‘‘Katamo ca, bhikkhave, dukkhanirodho? Taṇhānirodho, [taṇhānirodhā (ka. sī. syā. ka.)] bhikkhave, dukkhanirodho. Ayameva ariyo aṭṭhaṅgiko maggo dukkhassa nirodhagāminī paṭipadā, seyyathidaṃ – sammādiṭṭhi…pe… sammāsamādhi. ‘‘Yato kho, bhikkhave, ariyasāvako evaṃ dukkhaṃ pajānāti, evaṃ dukkhassa nidānasambhavaṃ pajānāti, evaṃ dukkhassa vemattataṃ pajānāti, evaṃ dukkhassa vipākaṃ pajānāti, evaṃ dukkhanirodhaṃ pajānāti, evaṃ dukkhanirodhagāminiṃ paṭipadaṃ pajānāti, so imaṃ nibbedhikaṃ brahmacariyaṃ pajānāti dukkhanirodhaṃ. Dukkhaṃ, bhikkhave, veditabbaṃ, dukkhassa nidānasambhavo veditabbo, dukkhassa vemattatā veditabbā, dukkhassa vipāko veditabbo, dukkhanirodho veditabbo, dukkhanirodhagāminī paṭipadā veditabbāti. Iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘Ayaṃ kho so, bhikkhave, nibbedhikapariyāyo dhammapariyāyo’’ti. Navamaṃ.",
      "english": "\"Monks, I will teach you a discourse on penetration, a teaching that penetrates to the core. Listen to it, attend carefully, I will speak.\" \"Yes, Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this: \"And what, monks, is that discourse on penetration, that teaching that penetrates to the core?\n\n\"Monks, sensual desires are to be understood; their causal arising is to be understood; their diversity is to be understood; their result is to be understood; their cessation is to be understood; the path leading to their cessation is to be understood.\n\n\"Monks, feelings are to be understood; their causal arising is to be understood; their diversity is to be understood; their result is to be understood; their cessation is to be understood; the path leading to their cessation is to be understood.\n\n\"Monks, perceptions are to be understood; their causal arising is to be understood; their diversity is to be understood; their result is to be understood; their cessation is to be understood; the path leading to their cessation is to be understood.\n\n\"Monks, taints are to be understood; their causal arising is to be understood; their diversity is to be understood; their result is to be understood; their cessation is to be understood; the path leading to their cessation is to be understood.\n\n\"Monks, actions are to be understood; their causal arising is to be understood; their diversity is to be understood; their result is to be understood; their cessation is to be understood; the path leading to their cessation is to be understood.\n\n\"Monks, suffering is to be understood; its causal arising is to be understood; its diversity is to be understood; its result is to be understood; its cessation is to be understood; the path leading to its cessation is to be understood.\n\n\"‘Monks, sensual desires are to be understood; their causal arising is to be understood; their diversity is to be understood; their result is to be understood; their cessation is to be understood; the path leading to their cessation is to be understood’—this is what was said. And in reference to what was this said? Monks, these five strands of sensuality are: forms cognizable by the eye that are desirable, lovely, pleasing, agreeable, associated with sensual desire, and engendering passion; sounds cognizable by the ear... smells cognizable by the nose... tastes cognizable by the tongue... tactile sensations cognizable by the body that are desirable, lovely, pleasing, agreeable, associated with sensual desire, and engendering passion. However, monks, these are not called ‘sensual desires’ in the Discipline of the Noble Ones; rather, they are called ‘strands of sensuality.’\nThe lust of intention is a person’s sensuality,\nNot the beautiful objects in the world.\nThe lust of intention is a person’s sensuality;\nThe beautiful objects remain as they are in the world.\nBut the wise subdue their desire for them.\"\n\n\"And what, monks, is the causal arising of sensual desires? Contact, monks, is the causal arising of sensual desires.\"\n\n\"And what, monks, is the diversity of sensual desires? Monks, there is one kind of sensual desire concerning forms, another concerning sounds, another concerning smells, another concerning tastes, and another concerning tactile sensations. This, monks, is called the diversity of sensual desires.\"\n\n\"And what, monks, is the result of sensual desires? Monks, when one desires, one generates for oneself a corresponding existence, whether partaking of merit or partaking of demerit. This, monks, is called the result of sensual desires.\"\n\n\"And what, monks, is the cessation of sensual desires? The cessation of contact, monks, is the cessation of sensual desires. This Noble Eightfold Path itself is the path leading to the cessation of sensual desires, namely: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration.\"\n\n\"Monks, when a noble disciple thus understands sensual desires, thus understands their causal arising, thus understands their diversity, thus understands their result, thus understands their cessation, and thus understands the path leading to their cessation, then that disciple understands this penetrative holy life for the cessation of sensual desires. That which was said: ‘Monks, sensual desires are to be understood; their causal arising is to be understood; their diversity is to be understood; their result is to be understood; their cessation is to be understood; the path leading to their cessation is to be understood’—it was said in reference to this.\n\n\"‘Monks, feelings are to be understood; their causal arising is to be understood; their diversity is to be understood; their result is to be understood; their cessation is to be understood; the path leading to their cessation is to be understood’—this is what was said. And in reference to what was this said? Monks, these are the three feelings: pleasant feeling, painful feeling, and neither-painful-nor-pleasant feeling.\n\n\"And what, monks, is the causal arising of feelings? Contact, monks, is the causal arising of feelings.\"\n\n\"And what, monks, is the diversity of feelings?\"\n\nMonks, there is feeling of pleasure associated with sensuality, there is feeling of pleasure unassociated with sensuality, there is feeling of pain associated with sensuality, there is feeling of pain unassociated with sensuality, there is feeling of neither-pleasure-nor-pain associated with sensuality, there is feeling of neither-pleasure-nor-pain unassociated with sensuality. This, monks, is called the diversity of feelings. And what, monks, is the result of feelings? When one experiences feeling, monks, one repeatedly generates a corresponding existence — either conducive to merit or conducive to demerit. This, monks, is called the result of feelings. And what, monks, is the cessation of feelings? The cessation of contact, monks, is the cessation of feelings. This Noble Eightfold Path itself is the practice leading to the cessation of feelings, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. When, monks, a noble disciple thus understands feeling, thus understands the origin and arising of feelings, thus understands the diversity of feelings, thus understands the result of feelings, thus understands the cessation of feelings, and thus understands the practice leading to the cessation of feelings, they then understand this penetrative holy life as the cessation of feelings. Monks, feeling is to be known, the origin and arising of feelings is to be known, the diversity of feelings is to be known, the result of feelings is to be known, the cessation of feelings is to be known, the practice leading to the cessation of feelings is to be known. That which was stated refers to this.\n\nMonks, perception is to be known, the origin and arising of perceptions is to be known, the diversity of perceptions is to be known, the result of perceptions is to be known, the cessation of perceptions is to be known, the practice leading to the cessation of perceptions is to be known. This too was stated. What was this stated in reference to? Monks, there are these six perceptions: perception of forms, perception of sounds, perception of odors, perception of tastes, perception of tactile sensations, perception of mental phenomena. And what, monks, is the origin and arising of perceptions? Contact, monks, is the origin and arising of perceptions. And what, monks, is the diversity of perceptions? One perception, monks, is with regard to forms; another perception with regard to sounds; another perception with regard to odors; another perception with regard to tastes; another perception with regard to tactile sensations; another perception with regard to mental phenomena. This, monks, is called the diversity of perceptions. And what, monks, is the result of perceptions? I declare, monks, that perception ripens in terms of expression. As one perceives something, so one expresses it, saying, 'Thus I perceived it.' This, monks, is called the result of perceptions. And what, monks, is the cessation of perceptions? The cessation of contact, monks, is the cessation of perceptions. This Noble Eightfold Path itself is the practice leading to the cessation of perceptions, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. When, monks, a noble disciple thus understands perception, thus understands the origin and arising of perceptions, thus understands the diversity of perceptions, thus understands the result of perceptions, thus understands the cessation of perceptions, and thus understands the practice leading to the cessation of perceptions, they then understand this penetrative holy life as the cessation of perceptions. Monks, perception is to be known, the origin and arising of perceptions is to be known, the diversity of perceptions is to be known, the result of perceptions is to be known, the cessation of perceptions is to be known, the practice leading to the cessation of perceptions is to be known. That which was stated refers to this.\n\nMonks, the taints are to be known, the origin and arising of the taints is to be known, the diversity of the taints is to be known, the result of the taints is to be known, the cessation of the taints is to be known, the practice leading to the cessation of the taints is to be known. This too was stated. What was this stated in reference to? Monks, there are these three taints: the taint of sensuality, the taint of existence, and the taint of ignorance. And what, monks, is the origin and arising of the taints? Ignorance, monks, is the origin and arising of the taints. And what, monks, is the diversity of the taints? Monks, there are taints that lead to hell, there are taints that lead to the animal realm, there are taints that lead to the realm of hungry ghosts, there are taints that lead to the human world, there are taints that lead to the divine worlds. This, monks, is called the diversity of the taints. And what, monks, is the result of the taints? When, monks, one is caught in ignorance, one repeatedly generates a corresponding existence — either conducive to merit or conducive to demerit. This, monks, is called the result of the taints. And what, monks, is the cessation of the taints? The cessation of ignorance, monks, is the cessation of the taints. This Noble Eightfold Path itself is the practice leading to the cessation of the taints, namely: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. When, monks, a noble disciple thus understands the taints, thus understands the origin and arising of the taints, thus understands the diversity of the taints, thus understands the result of the taints, thus understands the cessation of the taints, and thus understands the practice leading to the cessation of the taints, they then understand this penetrative holy life as the cessation of the taints.\n\nDefilements, bhikkhus, are to be known, and the path leading to the cessation of defilements is to be known. What was thus stated, was stated with reference to this.\n\nAction, bhikkhus, is to be known, and the path leading to the cessation of action is to be known. Thus, this was stated. With reference to what was this stated? Intention, bhikkhus, I declare to be action. Having intended, one performs action—by body, by speech, and by mind.\n\nAnd what, bhikkhus, is the origin of actions? Contact, bhikkhus, is the origin of actions.\n\nAnd what, bhikkhus, is the diversity of actions? There is, bhikkhus, action ripening in hell, there is action ripening in the animal realm, there is action ripening in the realm of hungry ghosts, there is action ripening in the human world, and there is action ripening in the divine worlds. This, bhikkhus, is called the diversity of actions.\n\nAnd what, bhikkhus, is the result of actions? I declare, bhikkhus, the result of actions to be threefold: either in this very life, or in a subsequent birth, or in another later occasion. This, bhikkhus, is called the result of actions.\n\nAnd what, bhikkhus, is the cessation of action? The cessation of contact, bhikkhus, is the cessation of action. This Noble Eightfold Path itself is the practice leading to the cessation of action, namely: right understanding, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.\n\nWhen, bhikkhus, a noble disciple thus understands action, thus understands the origin of actions, thus understands the diversity of actions, thus understands the result of actions, thus understands the cessation of action, and thus understands the path leading to the cessation of action, then that one understands this penetrating holy life as the cessation of action. Action, bhikkhus, is to be known, and the path leading to the cessation of action is to be known. What was thus stated, was stated with reference to this.\n\nDukkha, bhikkhus, is to be known, the origin of dukkha is to be known, the diversity of dukkha is to be known, the result of dukkha is to be known, the cessation of dukkha is to be known, and the path leading to the cessation of dukkha is to be known. Thus, this was stated. With reference to what was this stated? Birth is dukkha, old age is dukkha, sickness is dukkha, death is dukkha, sorrow, lamentation, pain, grief, and despair are dukkha; not getting what one wants is dukkha; in brief, the five aggregates subject to clinging are dukkha.\n\nAnd what, bhikkhus, is the origin of dukkha? Craving, bhikkhus, is the origin of dukkha.\n\nAnd what, bhikkhus, is the diversity of dukkha? There is, bhikkhus, extreme dukkha, there is slight dukkha; there is that which is slow to fade, and there is that which fades quickly. This, bhikkhus, is called the diversity of dukkha.\n\nAnd what, bhikkhus, is the result of dukkha? Here, bhikkhus, some individual, overwhelmed and with mind consumed by dukkha, grieves, laments, weeps, beats their breast, and falls into delusion. Or, overwhelmed and with mind consumed by dukkha, they search outside themselves, thinking, “Who knows a single word or a dual word for the cessation of this dukkha?” I declare, bhikkhus, that dukkha which ripens in delusion, or that which ripens in searching, is the result of dukkha. This, bhikkhus, is called the result of dukkha.\n\nAnd what, bhikkhus, is the cessation of dukkha? The cessation of craving, bhikkhus, is the cessation of dukkha. This Noble Eightfold Path itself is the practice leading to the cessation of dukkha, namely: right understanding, right intention, right speech, right action, right livelihood, right effort, right mindfulness, and right concentration.\n\nWhen, bhikkhus, a noble disciple thus understands dukkha, thus understands the origin of dukkha, thus understands the diversity of dukkha, thus understands the result of dukkha, thus understands the cessation of dukkha, and thus understands the path leading to the cessation of dukkha, then that one understands this penetrating holy life as the cessation of dukkha. Dukkha, bhikkhus, is to be known, its origin is to be known, its diversity is to be known, its result is to be known, its cessation is to be known, and the path leading to its cessation is to be known. What was thus stated, was stated with reference to this.\n\nThis, bhikkhus, is that discourse on penetration, that discourse on the Dhamma.",
      "sinhala": "\"මහණෙනි, මම ඔබට නිබ්බේදික ධර්ම පර්යායයක් දේශනා කරමි. එය අසන්න, මනාව මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.\"\n\n\"එසේය, භාග්‍යවතුන් වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, ඒ නිබ්බේදික ධර්ම පර්යායය කවරේද? මහණෙනි, කාමයන් දැනගත යුතු ය. කාමයන්ගේ හටගැනීමේ හේතුව දැනගත යුතු ය. කාමයන්ගේ විවිධත්වය දැනගත යුතු ය. කාමයන්ගේ විපාකය දැනගත යුතු ය. කාම නිරෝධය දැනගත යුතු ය. කාම නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය.\n\nමහණෙනි, වේදනා දැනගත යුතු ය. වේදනාවන්ගේ හටගැනීමේ හේතුව දැනගත යුතු ය. වේදනාවන්ගේ විවිධත්වය දැනගත යුතු ය. වේදනාවන්ගේ විපාකය දැනගත යුතු ය. වේදනා නිරෝධය දැනගත යුතු ය. වේදනා නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය.\n\nමහණෙනි, සංඥා දැනගත යුතු ය. සංඥාවන්ගේ හටගැනීමේ හේතුව දැනගත යුතු ය. සංඥාවන්ගේ විවිධත්වය දැනගත යුතු ය. සංඥාවන්ගේ විපාකය දැනගත යුතු ය. සංඥා නිරෝධය දැනගත යුතු ය. සංඥා නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය.\n\nමහණෙනි, ආසවයන් දැනගත යුතු ය. ආසවයන්ගේ හටගැනීමේ හේතුව දැනගත යුතු ය. ආසවයන්ගේ විවිධත්වය දැනගත යුතු ය. ආසවයන්ගේ විපාකය දැනගත යුතු ය. ආසව නිරෝධය දැනගත යුතු ය. ආසව නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය.\n\nමහණෙනි, කර්මය දැනගත යුතු ය. කර්මයන්ගේ හටගැනීමේ හේතුව දැනගත යුතු ය. කර්මයන්ගේ විවිධත්වය දැනගත යුතු ය. කර්මයන්ගේ විපාකය දැනගත යුතු ය. කර්ම නිරෝධය දැනගත යුතු ය. කර්ම නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය.\n\nමහණෙනි, දුක දැනගත යුතු ය. දුකෙහි හටගැනීමේ හේතුව දැනගත යුතු ය. දුකෙහි විවිධත්වය දැනගත යුතු ය. දුකෙහි විපාකය දැනගත යුතු ය. දුක් නිරෝධය දැනගත යුතු ය. දුක් නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය.\n\n\"මහණෙනි, කාමයන් දැනගත යුතු ය, කාමයන්ගේ හටගැනීමේ හේතුව දැනගත යුතු ය, කාමයන්ගේ විවිධත්වය දැනගත යුතු ය, කාමයන්ගේ විපාකය දැනගත යුතු ය, කාම නිරෝධය දැනගත යුතු ය, කාම නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය\"යි මෙසේ යම් කරුණක් කියන ලද්දේ ද, ඒ කුමක් අරභයා කියන ලද්දේ ද? මහණෙනි, මේ පස්වැදෑරුම් කාමගුණ වෙත්: ඇසින් හැඳිනිය යුතු, ඉෂ්ට වූ, කාන්තිමත් වූ, මන වඩන සුලු වූ, ප්‍රිය ස්වභාවයක් ඇති, කාමය හා බැඳුණු, ඇල්ම උපදවන රූප; කනින් හැඳිනිය යුතු ශබ්ද; නාසයෙන් හැඳිනිය යුතු ගඳ; දිවෙන් හැඳිනිය යුතු රස; කයින් හැඳිනිය යුතු, ඉෂ්ට වූ, කාන්තිමත් වූ, මන වඩන සුලු වූ, ප්‍රිය ස්වභාවයක් ඇති, කාමය හා බැඳුණු, ඇල්ම උපදවන ස්පර්ශ. එහෙත් මහණෙනි, මේවා කාමයන් නොවෙත්, මේවා කාමගුණ ලෙස ආර්ය විනයෙහි කියනු ලැබේ.\n\nපුද්ගලයාගේ සංකල්ප රාගය කාමයයි,\nලෝකයේ ඇති සිත්කළු දේ කාම නොවෙත්.\nපුද්ගලයාගේ සංකල්ප රාගය කාමයයි,\nසිත්කළු දෑ ලෝකයෙහි එලෙසම පවතී.\nඑහෙත් එහිදී නුවණැත්තෝ (කාමයන් කෙරෙහි වූ) ඡන්දය (රාගය) දුරු කරති.\n\nමහණෙනි, කාමයන්ගේ හටගැනීමේ හේතුව කවරේද? මහණෙනි, ස්පර්ශය කාමයන්ගේ හටගැනීමේ හේතුවයි. මහණෙනි, කාමයන්ගේ විවිධත්වය කවරේද? මහණෙනි, රූපයන්හි එක් කාමයකි. ශබ්දයන්හි එක් කාමයකි. ගන්ධයන්හි එක් කාමයකි. රසයන්හි එක් කාමයකි. ස්පර්ශයන්හි එක් කාමයකි. මහණෙනි, මෙය කාමයන්ගේ විවිධත්වය යැයි කියනු ලැබේ. මහණෙනි, කාමයන්ගේ විපාකය කවරේද? මහණෙනි, යමක් කාමයන් කැමති වන පුද්ගලයා පුණ්‍ය කොටසට අයත් වූ හෝ අපුණ්‍ය කොටසට අයත් වූ හෝ ඒ ඒ ආත්මභාවය උපදවයි ද, මහණෙනි, මෙය කාමයන්ගේ විපාකය යැයි කියනු ලැබේ. මහණෙනි, කාම නිරෝධය කවරේද? මහණෙනි, ස්පර්ශ නිරෝධය කාම නිරෝධයයි. මේ ආර්ය අෂ්ටාංගික මාර්ගයම කාම නිරෝධයට ගමන් කරන ප්‍රතිපදාවයි. එනම්: සම්‍යක් දෘෂ්ටිය, සම්‍යක් සංකල්පය, සම්‍යක් වචනය, සම්‍යක් කර්මාන්තය, සම්‍යක් ආජීවය, සම්‍යක් ව්‍යායාමය, සම්‍යක් ස්මෘතිය, සම්‍යක් සමාධිය.\n\nමහණෙනි, යම් කලෙක ආර්ය ශ්‍රාවකයා මෙසේ කාමයන් තේරුම් ගනී ද, මෙසේ කාමයන්ගේ හටගැනීමේ හේතුව තේරුම් ගනී ද, මෙසේ කාමයන්ගේ විවිධත්වය තේරුම් ගනී ද, මෙසේ කාමයන්ගේ විපාකය තේරුම් ගනී ද, මෙසේ කාම නිරෝධය තේරුම් ගනී ද, මෙසේ කාම නිරෝධයට ගමන් කරන ප්‍රතිපදාව තේරුම් ගනී ද, හෙතෙම කාම නිරෝධය වන මේ නිබ්බේදික බ්‍රහ්මචර්යාව තේරුම් ගනී. \"මහණෙනි, කාමයන් දැනගත යුතු ය... කාම නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය\"යි යමක් කියන ලද්දේ ද, ඒ මෙය අරභයා කියන ලද්දකි.\n\n\"මහණෙනි, වේදනා දැනගත යුතු ය... වේදනා නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුතු ය\"යි මෙසේ යමක් කියන ලද්දේ ද, ඒ කුමක් අරභයා කියන ලද්දේ ද? මහණෙනි, මේ වේදනා තුනකි: සුඛ වේදනාව, දුක්ඛ වේදනාව, අදුක්ඛමසුඛ වේදනාව. මහණෙනි, වේදනාවන්ගේ හටගැනීමේ හේතුව කවරේද? මහණෙනි, ස්පර්ශය වේදනාවන්ගේ හටගැනීමේ හේතුවයි. මහණෙනි, වේදනාවන්ගේ විවිධත්වය කවරේද?\n\nමහණෙනි, ආමිස සහිත සුඛ වේදනාවක් ඇත, ආමිසයෙන් තොර සුඛ වේදනාවක් ඇත, ආමිස සහිත දුක්‌ඛ වේදනාවක් ඇත, ආමිසයෙන් තොර දුක්‌ඛ වේදනාවක් ඇත, ආමිස සහිත අදුක්ඛමසුඛ වේදනාවක් ඇත, ආමිසයෙන් තොර අදුක්ඛමසුඛ වේදනාවක් ඇත. මහණෙනි, මෙය වේදනාවන්ගේ වෙනස්කම යැයි කියනු ලැබේ.\n\nමහණෙනි, වේදනාවන්ගේ විපාකය කවරේද? මහණෙනි, යමක් අත්විඳින තැනැත්තා පිං සිදුවන හෝ පව් සිදුවන ඒ ඒ භවයන් නැවත නැවත ඇති කරන්නේද, මහණෙනි, මෙය වේදනාවන්ගේ විපාකය යැයි කියනු ලැබේ.\n\nමහණෙනි, වේදනා නිරෝධය කවරේද? මහණෙනි, ස්පර්ශය නැති කිරීම වේදනා නිරෝධයයි. වේදනා නිරෝධයට ගමන් කරන ප්‍රතිපදාව නම් මේ ආර්ය අෂ්ටාංගික මාර්ගයමය. එනම්, සම්මා දිට්ඨිය... සම්මා සමාධියයි.\n\nමහණෙනි, යම් හෙයකින් ආර්ය ශ්‍රාවක තෙම මෙසේ වේදනාව හඳුනාගනීද, මෙසේ වේදනාවන්ගේ හටගැනීමේ හේතුව හඳුනාගනීද, මෙසේ වේදනාවන්ගේ වෙනස්කම හඳුනාගනීද, මෙසේ වේදනාවන්ගේ විපාකය හඳුනාගනීද, මෙසේ වේදනා නිරෝධය හඳුනාගනීද, මෙසේ වේදනා නිරෝධයට ගමන් කරන ප්‍රතිපදාව හඳුනාගනීද, හෙතෙම මේ විනිවිද යන බ්‍රහ්මචර්යාව හඳුනාගනී, වේදනා නිරෝධය ද හඳුනාගනී. මහණෙනි, වේදනාව දැනගත යුත්තකි... වේදනා නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුත්තකි යැයි යමක් කියන ලද්දේද, එය මේ කරුණ පදනම් කරගෙන කියන ලද්දකි.\n\nමහණෙනි, සංඥාව දැනගත යුත්තකි... සංඥා නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුත්තකි යැයි යමක් කියන ලද්දේද, එය කුමක් අරභයා කියන ලද්දේද? මහණෙනි, මේ සංඥාවන් සයකි – රූප සංඥාව, ශබ්ද සංඥාව, ගන්ධ සංඥාව, රස සංඥාව, ස්පර්ශ සංඥාව, ධම්ම සංඥාවයි.\n\nමහණෙනි, සංඥාවන්ගේ හටගැනීමේ හේතුව කවරේද? මහණෙනි, ස්පර්ශය සංඥාවන්ගේ හටගැනීමේ හේතුවයි.\n\nමහණෙනි, සංඥාවන්ගේ වෙනස්කම කවරේද? මහණෙනි, රූපයන් පිළිබඳව වෙන සංඥාවකි, ශබ්දයන් පිළිබඳව වෙන සංඥාවකි, ගන්ධයන් පිළිබඳව වෙන සංඥාවකි, රසයන් පිළිබඳව වෙන සංඥාවකි, ස්පර්ශයන් පිළිබඳව වෙන සංඥාවකි, ධර්මයන් පිළිබඳව වෙන සංඥාවකි. මහණෙනි, මෙය සංඥාවන්ගේ වෙනස්කම යැයි කියනු ලැබේ.\n\nමහණෙනි, සංඥාවන්ගේ විපාකය කවරේද? මහණෙනි, සංඥාව, ව්‍යවහාරයෙහි විපාක දෙන සුළු දෙයක් යැයි මම කියමි. යම් යම් අයුරකින් හෙතෙම එය හඳුනාගනීද, ඒ ඒ අයුරින් හෙතෙම ව්‍යවහාර කරයි, 'මෙසේ මා හඳුනාගතිමි' යනුවෙනි. මහණෙනි, මෙය සංඥාවන්ගේ විපාකය යැයි කියනු ලැබේ.\n\nමහණෙනි, සංඥා නිරෝධය කවරේද? මහණෙනි, ස්පර්ශය නැති කිරීම සංඥා නිරෝධයයි. සංඥා නිරෝධයට ගමන් කරන ප්‍රතිපදාව නම් මේ ආර්ය අෂ්ටාංගික මාර්ගයමය. එනම්, සම්මා දිට්ඨිය... සම්මා සමාධියයි.\n\nමහණෙනි, යම් හෙයකින් ආර්ය ශ්‍රාවක තෙම මෙසේ සංඥාව හඳුනාගනීද, මෙසේ සංඥාවන්ගේ හටගැනීමේ හේතුව හඳුනාගනීද, මෙසේ සංඥාවන්ගේ වෙනස්කම හඳුනාගනීද, මෙසේ සංඥාවන්ගේ විපාකය හඳුනාගනීද, මෙසේ සංඥා නිරෝධය හඳුනාගනීද, මෙසේ සංඥා නිරෝධයට ගමන් කරන ප්‍රතිපදාව හඳුනාගනීද, හෙතෙම මේ විනිවිද යන බ්‍රහ්මචර්යාව හඳුනාගනී, සංඥා නිරෝධය ද හඳුනාගනී. මහණෙනි, සංඥාව දැනගත යුත්තකි... සංඥා නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුත්තකි යැයි යමක් කියන ලද්දේද, එය මේ කරුණ පදනම් කරගෙන කියන ලද්දකි.\n\nමහණෙනි, ආශ්‍රවයන් දැනගත යුත්තාහ... ආශ්‍රව නිරෝධයට ගමන් කරන ප්‍රතිපදාව දැනගත යුත්තාහ යැයි යමක් කියන ලද්දේද, එය කුමක් අරභයා කියන ලද්දේද? මහණෙනි, මේ ආශ්‍රවයන් තුනකි – කාමාශ්‍රවය, භවාශ්‍රවය, අවිද්‍යාශ්‍රවයයි.\n\nමහණෙනි, ආශ්‍රවයන්ගේ හටගැනීමේ හේතුව කවරේද? මහණෙනි, අවිද්‍යාව ආශ්‍රවයන්ගේ හටගැනීමේ හේතුවයි.\n\nමහණෙනි, ආශ්‍රවයන්ගේ වෙනස්කම කවරේද? මහණෙනි, නිරයට ගමන් කරවන සුළු ආශ්‍රවයෝ ඇත්තාහ, තිරිසන් යෝනියට ගමන් කරවන සුළු ආශ්‍රවයෝ ඇත්තාහ, ප්‍රේත ලෝකයට ගමන් කරවන සුළු ආශ්‍රවයෝ ඇත්තාහ, මනුෂ්‍ය ලෝකයට ගමන් කරවන සුළු ආශ්‍රවයෝ ඇත්තාහ, දෙව්ලොවට ගමන් කරවන සුළු ආශ්‍රවයෝ ඇත්තාහ. මහණෙනි, මෙය ආශ්‍රවයන්ගේ වෙනස්කම යැයි කියනු ලැබේ.\n\nමහණෙනි, ආශ්‍රවයන්ගේ විපාකය කවරේද? මහණෙනි, අවිද්‍යාවට ගොදුරු වූ තැනැත්තා පිං සිදුවන හෝ පව් සිදුවන ඒ ඒ භවයන් නැවත නැවත ඇති කරන්නේද, මහණෙනි, මෙය ආශ්‍රවයන්ගේ විපාකය යැයි කියනු ලැබේ.\n\nමහණෙනි, ආශ්‍රව නිරෝධය කවරේද? මහණෙනි, අවිද්‍යාව නැති කිරීම ආශ්‍රව නිරෝධයයි. ආශ්‍රව නිරෝධයට ගමන් කරන ප්‍රතිපදාව නම් මේ ආර්ය අෂ්ටාංගික මාර්ගයමය. එනම්, සම්මා දිට්ඨිය... සම්මා සමාධියයි.\n\nමහණෙනි, යම් හෙයකින් ආර්ය ශ්‍රාවක තෙම මෙසේ ආශ්‍රවයන් හඳුනාගනීද, මෙසේ ආශ්‍රවයන්ගේ හටගැනීමේ හේතුව හඳුනාගනීද, මෙසේ ආශ්‍රවයන්ගේ වෙනස්කම හඳුනාගනීද, මෙසේ ආශ්‍රවයන්ගේ විපාකය හඳුනාගනීද, මෙසේ ආශ්‍රව නිරෝධය හඳුනාගනීද, මෙසේ ආශ්‍රව නිරෝධයට ගමන් කරන ප්‍රතිපදාව හඳුනාගනීද, හෙතෙම මේ විනිවිද යන බ්‍රහ්මචර්යාව හඳුනාගනී, ආශ්‍රව නිරෝධය ද හඳුනාගනී.\n\nබික්ෂූනි, ආශ්‍රවයන් දැනගත යුතුය; ආශ්‍රවයන්ගේ නිදානසම්භවය දැනගත යුතුය; ආශ්‍රවයන්ගේ වෛමත්ත්‍යතාව දැනගත යුතුය; ආශ්‍රවයන්ගේ විපාකය දැනගත යුතුය; ආශ්‍රව නිරෝධය දැනගත යුතුය; ආශ්‍රව නිරෝධයට ගමන් කරන ප්‍රතිපදාවද දැනගත යුතුය. ඒ යමක් කියන ලද්දේද, එය මේ කරුණ අරභයා කියන ලද්දකි.\n\n‘බික්ෂූනි, කර්මය දැනගත යුතුය; කර්මයන්ගේ නිදානසම්භවය දැනගත යුතුය; කර්මයන්ගේ වෛමත්ත්‍යතාව දැනගත යුතුය; කර්මයන්ගේ විපාකය දැනගත යුතුය; කර්ම නිරෝධය දැනගත යුතුය; කර්ම නිරෝධයට ගමන් කරන ප්‍රතිපදාවද දැනගත යුතුය’යි කියන ලද්දේය. ඒ කුමක් අරභයා කියන ලද්දේද? බික්ෂූනි, මම චේතනාව කර්මය යැයි කියමි. කයෙන්, වචනයෙන්, මනසින් චේතනා කොට කර්ම කරයි.\n\nබික්ෂූනි, කර්මයන්ගේ නිදානසම්භවය කවරේද? බික්ෂූනි, ස්පර්ශය (ඵස්සය) කර්මයන්ගේ නිදානසම්භවයයි. බික්ෂූනි, කර්මයන්ගේ වෛමත්ත්‍යතාව කවරේද? බික්ෂූනි, නිරයේ විපාක දෙන කර්ම ඇත, තිරශ්චීන යෝනියේ විපාක දෙන කර්ම ඇත, ප්‍රේත විෂයෙහි විපාක දෙන කර්ම ඇත, මනුෂ්‍ය ලෝකයේ විපාක දෙන කර්ම ඇත, දේව ලෝකයේ විපාක දෙන කර්ම ඇත. බික්ෂූනි, මෙය කර්මයන්ගේ වෛමත්ත්‍යතාව යැයි කියනු ලැබේ. බික්ෂූනි, කර්මයන්ගේ විපාකය කවරේද? බික්ෂූනි, මම කර්මයන්ගේ විපාක තුන් ආකාරයකින් කියමි – මේ ආත්මභාවයේදීම, නැවත උපත ලබන ආත්මභාවයකදී හෝ වෙනත් අවස්ථාවකදී (පසුකාලීනව). බික්ෂූනි, මෙය කර්මයන්ගේ විපාකය යැයි කියනු ලැබේ. බික්ෂූනි, කර්ම නිරෝධය කවරේද? බික්ෂූනි, ස්පර්ශ නිරෝධය (ඵස්ස නිරෝධය) කර්ම නිරෝධයයි. අරිය අෂ්ටාංගික මාර්ගයම කර්ම නිරෝධයට ගමන් කරන ප්‍රතිපදාවයි. එනම්: සම්මා දිට්ඨිය, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධියයි.\n\nබික්ෂූනි, යම් හෙයකින් ආර්ය<b>ශ්‍රා</b>වක තෙමේ මෙසේ කර්මය අවබෝධ කරගනීද, මෙසේ කර්මයන්ගේ නිදානසම්භවය අවබෝධ කරගනීද, මෙසේ කර්මයන්ගේ වෛමත්ත්‍යතාව අවබෝධ කරගනීද, මෙසේ කර්මයන්ගේ විපාකය අවබෝධ කරගනීද, මෙසේ කර්ම නිරෝධය අවබෝධ කරගනීද, මෙසේ කර්ම නිරෝධයට ගමන් කරන ප්‍රතිපදාව අවබෝධ කරගනීද, ඒ ඔහු කර්ම නිරෝධයම වන මේ ගැඹුරු බ්‍රහ්ම<b>චර්යා</b>ව අවබෝධ කරගනී. ‘බික්ෂූනි, කර්මය දැනගත යුතුය; කර්මයන්ගේ නිදානසම්භවය දැනගත යුතුය; කර්මයන්ගේ වෛමත්ත්‍යතාව දැනගත යුතුය; කර්මයන්ගේ විපාකය දැනගත යුතුය; කර්ම නිරෝධය දැනගත යුතුය; කර්ම නිරෝධයට ගමන් කරන ප්‍රතිපදාවද දැනගත යුතුය’යි ඒ යමක් කියන ලද්දේද, එය මේ කරුණ අරභයා කියන ලද්දකි.\n\n‘බික්ෂූනි, දුක දැනගත යුතුය; දුකෙහි නිදානසම්භවය දැනගත යුතුය; දුකෙහි වෛමත්ත්‍යතාව දැනගත යුතුය; දුකෙහි විපාකය දැනගත යුතුය; දුක්ඛ නිරෝධය දැනගත යුතුය; දුක්ඛ නිරෝධයට ගමන් කරන ප්‍රතිපදාවද දැනගත යුතුය’යි කියන ලද්දේය. ඒ කුමක් අරභයා කියන ලද්දේද? ජාතියද දුකකි, ජරාවද දුකකි, ව්යා<b>ධි</b>යද දුකකි, මරණයද දුකකි, <b>ශෝ</b>කය, වැළපීම, කායික දුක, මානසික දුක සහ දැඩි වේදනාද දුකකි, යමක් කැමතිව ලැබීමට නොහැකි වීමද දුකකි. සංක්ෂිප්තයෙන් කියතොත්, පඤ්ච උපාදාන<b>ස්කන්ධයෝ</b> දුකකි.\n\nබික්ෂූනි, දුකෙහි නිදානසම්භවය කවරේද? බික්ෂූනි, තණ්හාව දුකෙහි නිදානසම්භවයයි. බික්ෂූනි, දුකෙහි වෛමත්ත්‍යතාව කවරේද? බික්ෂූනි, අධිමාත්‍ර (දැඩි) දුක ඇත, පරීත්ත (සුළු) දුක ඇත, සෙමින් වියෝ වන (ක්‍රමානුකූලව දුරුවන) දුක ඇත, ඉක්මනින් වියෝ වන (නිරුද්ධ වන) දුක ඇත. බික්ෂූනි, මෙය දුකෙහි වෛමත්ත්‍යතාව යැයි කියනු ලැබේ. බික්ෂූනි, දුකෙහි විපාකය කවරේද? බික්ෂූනි, මෙහි ඇතැමෙක් යම් දුකකින් යටපත් වී, සිත් තැවුලට පත්ව, <b>ශෝ</b>ක කරයි, වෙහෙසට පත්වේ, හඬා වැලපේ, පපුවට ගසාගෙන හඬයි, සිහිමොළොස් නැති භාවයට පත්වේ. හෝ යම් දුකකින් යටපත් වී, සිත් තැවුලට පත්ව, ‘මේ දුක නිරුද්ධ කිරීමට එක් පියවරක් හෝ දෙකක් (කිසියම් ක්‍රමයක්) දන්නේ කවරෙක්ද?’යි බාහිරින් සොයා යයි. බික්ෂූනි, මම දුකෙහි විපාකය සිහිමොළොස් බවට පත්වීම හෝ සොයා යෑමට පත්වීම යැයි කියමි. බික්ෂූනි, මෙය දුකෙහි විපාකය යැයි කියනු ලැබේ. බික්ෂූනි, දුක්ඛ නිරෝධය කවරේද? බික්ෂූනි, තණ්හා නිරෝධය දුක්ඛ නිරෝධයයි. අරිය අෂ්ටාංගික මාර්ගයම දුක්ඛ නිරෝධයට ගමන් කරන ප්‍රතිපදාවයි. එනම්: සම්මා දිට්ඨිය, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධියයි.\n\nබික්ෂූනි, යම් හෙයකින් ආර්ය<b>ශ්‍රා</b>වක තෙමේ මෙසේ දුක අවබෝධ කරගනීද, මෙසේ දුකෙහි නිදානසම්භවය අවබෝධ කරගනීද, මෙසේ දුකෙහි වෛමත්ත්‍යතාව අවබෝධ කරගනීද, මෙසේ දුකෙහි විපාකය අවබෝධ කරගනීද, මෙසේ දුක්ඛ නිරෝධය අවබෝධ කරගනීද, මෙසේ දුක්ඛ නිරෝධයට ගමන් කරන ප්‍රතිපදාව අවබෝධ කරගනීද, ඒ ඔහු දුක්ඛ නිරෝධයම වන මේ ගැඹුරු බ්‍රහ්ම<b>චර්යා</b>ව අවබෝධ කරගනී. ‘බික්ෂූනි, දුක දැනගත යුතුය, දුකෙහි නිදානසම්භවය දැනගත යුතුය, දුකෙහි වෛමත්ත්‍යතාව දැනගත යුතුය, දුකෙහි විපාකය දැනගත යුතුය, දුක්ඛ නිරෝධය දැනගත යුතුය, දුක්ඛ නිරෝධයට ගමන් කරන ප්‍රතිපදාවද දැනගත යුතුය’යි ඒ යමක් කියන ලද්දේද, එය මේ කරුණ අරභයා කියන ලද්දකි.\n\nබික්ෂූනි, මේ ඒ විනිවිද දකින (ගැඹුරු) ධර්ම පර්යායයි.",
      "paliTitle": "Nibbedhikasuttaṃ"
    },
    {
      "number": 64,
      "pali": "[ma. ni. 1.148; vibha. 760; a. ni. 10.21; paṭi. ma. 2.44] ‘‘Chayimāni, bhikkhave, tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Katamāni cha? Idha, bhikkhave, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato…pe… idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ, dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampi, bhikkhave, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ, dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti. Yampi, bhikkhave, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Yampi, bhikkhave, tathāgato āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Imāni kho, bhikkhave, cha tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Tatra ce, bhikkhave, pare tathāgataṃ ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ ñāṇena upasaṅkamitvā pañhaṃ pucchanti. Yathā yathā, bhikkhave, tathāgatassa ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ ñāṇaṃ viditaṃ tathā tathā tesaṃ tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ ñāṇena pañhaṃ puṭṭho byākaroti. ‘‘Tatra ce, bhikkhave, pare tathāgataṃ atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ ñāṇena upasaṅkamitvā pañhaṃ pucchanti. Yathā yathā, bhikkhave, tathāgatassa atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ ñāṇaṃ viditaṃ tathā tathā tesaṃ tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ ñāṇena pañhaṃ puṭṭho byākaroti. ‘‘Tatra ce, bhikkhave, pare tathāgataṃ jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ ñāṇena upasaṅkamitvā pañhaṃ pucchanti. Yathā yathā, bhikkhave, tathāgatassa jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ ñāṇaṃ viditaṃ, tathā tathā tesaṃ tathāgato jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ ñāṇena pañhaṃ puṭṭho byākaroti. ‘‘Tatra ce, bhikkhave, pare tathāgataṃ pubbenivāsānussatiṃ yathābhūtaṃ ñāṇena upasaṅkamitvā pañhaṃ pucchanti. Yathā yathā, bhikkhave, tathāgatassa pubbenivāsānussatiṃ yathābhūtaṃ ñāṇaṃ viditaṃ, tathā tathā tesaṃ tathāgato pubbenivāsānussatiṃ yathābhūtaṃ ñāṇena pañhaṃ puṭṭho byākaroti. ‘‘Tatra ce, bhikkhave, pare tathāgataṃ sattānaṃ cutūpapātaṃ yathābhūtaṃ ñāṇena upasaṅkamitvā pañhaṃ pucchanti. Yathā yathā, bhikkhave, tathāgatassa sattānaṃ cutūpapātaṃ yathābhūtaṃ ñāṇaṃ viditaṃ, tathā tathā tesaṃ tathāgato sattānaṃ cutūpapātaṃ yathābhūtaṃ ñāṇena pañhaṃ puṭṭho byākaroti. ‘‘Tatra ce, bhikkhave, pare tathāgataṃ āsavānaṃ khayā…pe… yathābhūtaṃ ñāṇena upasaṅkamitvā pañhaṃ pucchanti. Yathā yathā, bhikkhave, tathāgatassa āsavānaṃ khayā…pe… yathābhūtaṃ ñāṇaṃ viditaṃ, tathā tathā tesaṃ tathāgato āsavānaṃ khayā…pe… yathābhūtaṃ ñāṇena pañhaṃ puṭṭho byākaroti. ‘‘Tatra, bhikkhave, yampidaṃ [yamidaṃ (sī. pī.), yadidaṃ (ka.)] ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ ñāṇaṃ tampi samāhitassa vadāmi no asamāhitassa. Yampidaṃ [yadidaṃ (ka.)] atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ ñāṇaṃ tampi samāhitassa vadāmi no asamāhitassa. Yampidaṃ [yadidaṃ (ka.)] jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ ñāṇaṃ tampi samāhitassa vadāmi no asamāhitassa. Yampidaṃ [yadidaṃ (ka.)] pubbenivāsānussatiṃ yathābhūtaṃ ñāṇaṃ tampi samāhitassa vadāmi no asamāhitassa. Yampidaṃ [yadidaṃ (ka.)] sattānaṃ cutūpapātaṃ yathābhūtaṃ ñāṇaṃ tampi samāhitassa vadāmi no asamāhitassa. Yampidaṃ [yadidaṃ (ka.)] āsavānaṃ khayā…pe… yathābhūtaṃ ñāṇaṃ tampi samāhitassa vadāmi no asamāhitassa. Iti kho, bhikkhave, samādhi maggo, asamādhi kummaggo’’ti. Dasamaṃ. ",
      "english": "Monks, these are the six powers of a Tathāgata, by virtue of which the Tathāgata claims the foremost position, roars his lion's roar in assemblies, and sets in motion the sublime wheel. Which six?\n\nHere, monks, the Tathāgata discerns as it truly is what is possible as possible and what is impossible as impossible. That the Tathāgata discerns as it truly is what is possible as possible and what is impossible as impossible—this, too, monks, is a power of the Tathāgata, by virtue of which the Tathāgata claims the foremost position, roars his lion's roar in assemblies, and sets in motion the sublime wheel.\n\nFurthermore, monks, the Tathāgata discerns as it truly is the result of past, future, and present actions, regarding their grounds, their causes, and their consequences. That the Tathāgata discerns as it truly is the result of past, future, and present actions, regarding their grounds, their causes, and their consequences—this, too, monks, is a power of the Tathāgata, by virtue of which the Tathāgata claims the foremost position, roars his lion's roar in assemblies, and sets in motion the sublime wheel.\n\nFurthermore, monks, the Tathāgata discerns as it truly is the defilement, the purification, and the emergence from the jhānas, emancipations, concentrations, and attainments. That the Tathāgata discerns as it truly is the defilement, the purification, and the emergence from the jhānas, emancipations, concentrations, and attainments—this, too, monks, is a power of the Tathāgata, by virtue of which the Tathāgata claims the foremost position, roars his lion's roar in assemblies, and sets in motion the sublime wheel.\n\nFurthermore, monks, the Tathāgata recollects his manifold past existences, that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion. He recollects: “There I had such a name, belonged to such a clan, had such an appearance, such was my food, such was my experience of pleasure and pain, such was the end of my life. Passing away from there, I reappeared elsewhere. There too I had such a name, belonged to such a clan, had such an appearance, such was my food, such was my experience of pleasure and pain, such was the end of my life. Passing away from there, I reappeared here.” Thus, he recollects his manifold past existences with their distinct characteristics and details. That the Tathāgata recollects his manifold past existences, that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion, recollecting: “There I had such a name, belonged to such a clan, had such an appearance, such was my food, such was my experience of pleasure and pain, such was the end of my life. Passing away from there, I reappeared elsewhere. There too I had such a name, belonged to such a clan, had such an appearance, such was my food, such was my experience of pleasure and pain, such was the end of my life. Passing away from there, I reappeared here,” thus recollecting his manifold past existences with their distinct characteristics and details—this, too, monks, is a power of the Tathāgata, by virtue of which the Tathāgata claims the foremost position, roars his lion's roar in assemblies, and sets in motion the sublime wheel.\n\nFurthermore, monks, the Tathāgata, with the divine eye, purified and surpassing that of humans, sees beings passing away and reappearing; he sees them, with the divine eye, purified and surpassing that of humans, as inferior and superior, beautiful and ugly, fortunate and unfortunate, and he discerns how beings fare according to their kamma. That the Tathāgata, with the divine eye, purified and surpassing that of humans, sees beings passing away and reappearing; he sees them, with the divine eye, purified and surpassing that of humans, as inferior and superior, beautiful and ugly, fortunate and unfortunate, and he discerns how beings fare according to their kamma—this, too, monks, is a power of the Tathāgata, by virtue of which the Tathāgata claims the foremost position, roars his lion's roar in assemblies, and sets in motion the sublime wheel.\n\nFurthermore, monks, by the destruction of the taints, the Tathāgata here and now, having realized with his own direct knowledge, enters and abides in the taintless liberation of mind and liberation by wisdom. That the Tathāgata, by the destruction of the taints, here and now, having realized with his own direct knowledge, enters and abides in the taintless liberation of mind and liberation by wisdom—this, too, monks, is a power of the Tathāgata, by virtue of which the Tathāgata claims the foremost position, roars his lion's roar in assemblies, and sets in motion the sublime wheel. These, monks, are the six powers of a Tathāgata, possessing which the Tathāgata claims the foremost position, roars his lion's roar in assemblies, and sets in motion the sublime wheel.\n\nIf, monks, others approach the Tathāgata and question him regarding his knowledge of what is possible as possible and what is impossible as impossible, as it truly is, then, just as that knowledge of what is possible as possible and what is impossible as impossible is known to the Tathāgata as it truly is, so too, when questioned on this, the Tathāgata answers them with that knowledge of what is possible as possible and what is impossible as impossible, as it truly is.\n\nIf, monks, others approach the Tathāgata and question him regarding his knowledge of the result of past, future, and present actions, regarding their grounds, their causes, and their consequences, as it truly is, then, just as that knowledge of the result of past, future, and present actions, regarding their grounds, their causes, and their consequences, is known to the Tathāgata as it truly is, so too, when questioned on this, the Tathāgata answers them with that knowledge of the result of past, future, and present actions, regarding their grounds, their causes, and their consequences, as it truly is.\n\nIf, monks, others approach the Tathāgata and question him regarding his knowledge of the defilement, the purification, and the emergence from the jhānas, emancipations, concentrations, and attainments, as it truly is, then, just as that knowledge of the defilement, the purification, and the emergence from the jhānas, emancipations, concentrations, and attainments is known to the Tathāgata as it truly is, so too, when questioned on this, the Tathāgata answers them with that knowledge of the defilement, the purification, and the emergence from the jhānas, emancipations, concentrations, and attainments, as it truly is.\n\nIf, monks, others approach the Tathāgata and question him regarding his knowledge of the recollection of past lives, as it truly is, then, just as that knowledge of the recollection of past lives is known to the Tathāgata as it truly is, so too, when questioned on this, the Tathāgata answers them with that knowledge of the recollection of past lives, as it truly is.\n\nMonks, just as the Tathāgata’s knowledge of the recollection of past lives as it actually is, is known by him, so too, when questioned by others concerning this knowledge of the recollection of past lives as it actually is, the Tathāgata explains it to them. And if, monks, others approach the Tathāgata and question him concerning the knowledge of the passing away and re-arising of beings as it actually is, then just as the Tathāgata’s knowledge of the passing away and re-arising of beings as it actually is, is known by him, so too, when questioned by them concerning this knowledge of the passing away and re-arising of beings as it actually is, the Tathāgata explains it to them. And if, monks, others approach the Tathāgata and question him concerning the knowledge of the destruction of the taints as it actually is, then just as the Tathāgata’s knowledge of the destruction of the taints as it actually is, is known by him, so too, when questioned by them concerning this knowledge of the destruction of the taints as it actually is, the Tathāgata explains it to them.\n\nMonks, concerning this — whatever knowledge there is of what is possible as possible and what is impossible as impossible, as it truly is — that too I declare belongs to one who is concentrated, not to one who is not concentrated. Whatever knowledge there is of the results of past, future, and present actions, according to their conditions and causes, as it truly is — that too I declare belongs to one who is concentrated, not to one who is not concentrated. Whatever knowledge there is of the defilement, purification, and emergence from the jhānas, liberations, concentrations, and attainments, as it truly is — that too I declare belongs to one who is concentrated, not to one who is not concentrated. Whatever knowledge there is of the recollection of past lives, as it truly is — that too I declare belongs to one who is concentrated, not to one who is not concentrated. Whatever knowledge there is of the passing away and re-arising of beings, as it truly is — that too I declare belongs to one who is concentrated, not to one who is not concentrated. Whatever knowledge there is of the destruction of the taints, as it truly is — that too I declare belongs to one who is concentrated, not to one who is not concentrated. Thus, monks, concentration is the path, and lack of concentration is the wrong path.",
      "sinhala": "භික්ෂූනි, මේවා තථාගතයන්වහන්සේගේ තථාගත ඥාන බලයන් සයකි. යම් බලයන්ගෙන් යුක්ත වූ තථාගතයන්වහන්සේ වෘෂභ ස්ථානයට පැමිණි බව ප්‍රකාශ කරන්නේද, පිරිස් මැද සිංහනාද කරන්නේද, ධර්ම චක්‍රය පවත්වන්නේද. කවරේද ඒ සය?\n\nභික්ෂූනි, මෙහිලා තථාගතයන්වහන්සේ සිදුවිය යුතු දේ සිදුවිය යුත්තක් ලෙසද, සිදුවිය නොහැකි දේ සිදුවිය නොහැක්කක් ලෙසද ඇති සැටියෙන් අවබෝධ කරයි. භික්ෂූනි, තථාගතයන්වහන්සේ යම් හෙයකින් සිදුවිය යුතු දේ සිදුවිය යුත්තක් ලෙසද, සිදුවිය නොහැකි දේ සිදුවිය නොහැක්කක් ලෙසද ඇති සැටියෙන් අවබෝධ කරන්නේද, භික්ෂූනි, මේද තථාගතයන්වහන්සේගේ ඥාන බලයකි. යම් බලයක් අරබයා තථාගතයන්වහන්සේ වෘෂභ ස්ථානයට පැමිණි බව ප්‍රකාශ කරන්නේද, පිරිස් මැද සිංහනාද කරන්නේද, ධර්ම චක්‍රය පවත්වන්නේද.\n\nතවද භික්ෂූනි, තථාගතයන්වහන්සේ අතීත, අනාගත, වර්තමාන කර්මයන්හි විපාකයන්ට හේතු වන ආකාරයද, ඒ විපාක සිදුවන ස්වභාවයද ඇති සැටියෙන් අවබෝධ කරයි. භික්ෂූනි, තථාගතයන්වහන්සේ යම් හෙයකින් අතීත, අනාගත, වර්තමාන කර්මයන්හි විපාකයන්ට හේතු වන ආකාරයද, ඒ විපාක සිදුවන ස්වභාවයද ඇති සැටියෙන් අවබෝධ කරන්නේද, භික්ෂූනි, මේද තථාගතයන්වහන්සේගේ ඥාන බලයකි. යම් බලයක් අරබයා තථාගතයන්වහන්සේ වෘෂභ ස්ථානයට පැමිණි බව ප්‍රකාශ කරන්නේද, පිරිස් මැද සිංහනාද කරන්නේද, ධර්ම චක්‍රය පවත්වන්නේද.\n\nතවද භික්ෂූනි, තථාගතයන්වහන්සේ ධ්‍යාන, විමෝක්ෂ, සමාධි සහ සමාපත්තිවල කෙලෙසීමද, පිරිසිදු වීමද, නැවත නැඟී සිටීමද ඇති සැටියෙන් අවබෝධ කරයි. භික්ෂූනි, තථාගතයන්වහන්සේ යම් හෙයකින් ධ්‍යාන, විමෝක්ෂ, සමාධි සහ සමාපත්තිවල කෙලෙසීමද, පිරිසිදු වීමද, නැවත නැඟී සිටීමද ඇති සැටියෙන් අවබෝධ කරන්නේද, භික්ෂූනි, මේද තථාගතයන්වහන්සේගේ ඥාන බලයකි. යම් බලයක් අරබයා තථාගතයන්වහන්සේ වෘෂභ ස්ථානයට පැමිණි බව ප්‍රකාශ කරන්නේද, පිරිස් මැද සිංහනාද කරන්නේද, ධර්ම චක්‍රය පවත්වන්නේද.\n\nතවද භික්ෂූනි, තථාගතයන්වහන්සේ නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි. එනම් – එක ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති සතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, නොයෙක් සංවට්ට කල්ප ද, නොයෙක් විවට්ට කල්ප ද, නොයෙක් සංවට්ට විවට්ට කල්ප ද යන මෙසේ ස්වභාවයන් සහිත වූ, අරමුණු සහිත වූ නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි. භික්ෂූනි, තථාගතයන්වහන්සේ යම් හෙයකින් නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරන්නේද, එනම් – එක ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති සතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, නොයෙක් සංවට්ට කල්ප ද, නොයෙක් විවට්ට කල්ප ද, නොයෙක් සංවට්ට විවට්ට කල්ප ද යන මෙසේ ස්වභාවයන් සහිත වූ, අරමුණු සහිත වූ නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරන්නේද, භික්ෂූනි, මේද තථාගතයන්වහන්සේගේ ඥාන බලයකි. යම් බලයක් අරබයා තථාගතයන්වහන්සේ වෘෂභ ස්ථානයට පැමිණි බව ප්‍රකාශ කරන්නේද, පිරිස් මැද සිංහනාද කරන්නේද, ධර්ම චක්‍රය පවත්වන්නේද.\n\nතවද භික්ෂූනි, තථාගතයන්වහන්සේ දිව්‍ය වූ, පිරිසිදු වූ, මිනිස් ඇස ඉක්ම වූ චක්ඛුස මගින් (දිවැසින්) සත්වයන්ගේ චුති-උප්පත්ති දක්නේය. හීන වූ, ප්‍රණීත වූ, මනා පැහැයක් ඇති, දුර්වර්ණ වූ, සුගති දුර්ගතිවල උපදින, කර්මානුරූපව ගමන් කරන සත්වයන් ඇති සැටියෙන් අවබෝධ කරයි. භික්ෂූනි, තථාගතයන්වහන්සේ යම් හෙයකින් දිව්‍ය වූ, පිරිසිදු වූ, මිනිස් ඇස ඉක්ම වූ චක්ඛුස මගින් (දිවැසින්) සත්වයන්ගේ චුති-උප්පත්ති දක්නේය. හීන වූ, ප්‍රණීත වූ, මනා පැහැයක් ඇති, දුර්වර්ණ වූ, සුගති දුර්ගතිවල උපදින, කර්මානුරූපව ගමන් කරන සත්වයන් ඇති සැටියෙන් අවබෝධ කරන්නේද, භික්ෂූනි, මේද තථාගතයන්වහන්සේගේ ඥාන බලයකි. යම් බලයක් අරබයා තථාගතයන්වහන්සේ වෘෂභ ස්ථානයට පැමිණි බව ප්‍රකාශ කරන්නේද, පිරිස් මැද සිංහනාද කරන්නේද, ධර්ම චක්‍රය පවත්වන්නේද.\n\nතවද භික්ෂූනි, තථාගතයන්වහන්සේ ආශ්‍රවයන් ක්ෂය කිරීමෙන් කෙලෙස් රහිත වූ, චේතෝවිමුක්තියද, ප්‍රඥා විමුක්තියද, මේ ආත්මභාවයේදීම ස්වයංව අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන වාසය කරයි. භික්ෂූනි, තථාගතයන්වහන්සේ යම් හෙයකින් ආශ්‍රවයන් ක්ෂය කිරීමෙන් කෙලෙස් රහිත වූ, චේතෝවිමුක්තියද, ප්‍රඥා විමුක්තියද, මේ ආත්මභාවයේදීම ස්වයංව අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන වාසය කරන්නේද, භික්ෂූනි, මේද තථාගතයන්වහන්සේගේ ඥාන බලයකි. යම් බලයක් අරබයා තථාගතයන්වහන්සේ වෘෂභ ස්ථානයට පැමිණි බව ප්‍රකාශ කරන්නේද, පිරිස් මැද සිංහනාද කරන්නේද, ධර්ම චක්‍රය පවත්වන්නේද.\n\nභික්ෂූනි, මේවා තථාගතයන්වහන්සේගේ ඥාන බලයන් සයකි. යම් බලයන්ගෙන් යුක්ත වූ තථාගතයන්වහන්සේ වෘෂභ ස්ථානයට පැමිණි බව ප්‍රකාශ කරන්නේද, පිරිස් මැද සිංහනාද කරන්නේද, ධර්ම චක්‍රය පවත්වන්නේද.\n\nභික්ෂූනි, එහිලා යම් කිසිවෙක් තථාගතයන්වහන්සේ වෙතට සිදුවිය යුතු දේ සිදුවිය යුත්තක් ලෙසද, සිදුවිය නොහැකි දේ සිදුවිය නොහැක්කක් ලෙසද ඇති සැටියෙන් අවබෝධ කරන ඥානය ගැන විමසීමට පැමිණ ප්‍රශ්න අසන්නේ නම්, භික්ෂූනි, තථාගතයන්වහන්සේගේ සිදුවිය යුතු දේ සිදුවිය යුත්තක් ලෙසද, සිදුවිය නොහැකි දේ සිදුවිය නොහැක්කක් ලෙසද ඇති සැටියෙන් අවබෝධ කරන ඥානය යම් අයුරකින් ප්‍රකට වී ඇත්ද, ඒ අයුරින්ම තථාගතයන්වහන්සේ ඔවුන්ට සිදුවිය යුතු දේ සිදුවිය යුත්තක් ලෙසද, සිදුවිය නොහැකි දේ සිදුවිය නොහැක්කක් ලෙසද ඇති සැටියෙන් අවබෝධ කරන ඥානය සම්බන්ධයෙන් අසන ලද ප්‍රශ්නයට පිළිතුරු දෙයි.\n\nභික්ෂූනි, එහිලා යම් කිසිවෙක් තථාගතයන්වහන්සේ වෙතට අතීත, අනාගත, වර්තමාන කර්මයන්හි විපාකයන්ට හේතු වන ආකාරයද, ඒ විපාක සිදුවන ස්වභාවයද ඇති සැටියෙන් අවබෝධ කරන ඥානය ගැන විමසීමට පැමිණ ප්‍රශ්න අසන්නේ නම්, භික්ෂූනි, තථාගතයන්වහන්සේගේ අතීත, අනාගත, වර්තමාන කර්මයන්හි විපාකයන්ට හේතු වන ආකාරයද, ඒ විපාක සිදුවන ස්වභාවයද ඇති සැටියෙන් අවබෝධ කරන ඥානය යම් අයුරකින් ප්‍රකට වී ඇත්ද, ඒ අයුරින්ම තථාගතයන්වහන්සේ ඔවුන්ට අතීත, අනාගත, වර්තමාන කර්මයන්හි විපාකයන්ට හේතු වන ආකාරයද, ඒ විපාක සිදුවන ස්වභාවයද ඇති සැටියෙන් අවබෝධ කරන ඥානය සම්බන්ධයෙන් අසන ලද ප්‍රශ්නයට පිළිතුරු දෙයි.\n\nභික්ෂූනි, එහිලා යම් කිසිවෙක් තථාගතයන්වහන්සේ වෙතට ධ්‍යාන, විමෝක්ෂ, සමාධි සහ සමාපත්තිවල කෙලෙසීමද, පිරිසිදු වීමද, නැවත නැඟී සිටීමද ඇති සැටියෙන් අවබෝධ කරන ඥානය ගැන විමසීමට පැමිණ ප්‍රශ්න අසන්නේ නම්, භික්ෂූනි, තථාගතයන්වහන්සේගේ ධ්‍යාන, විමෝක්ෂ, සමාධි සහ සමාපත්තිවල කෙලෙසීමද, පිරිසිදු වීමද, නැවත නැඟී සිටීමද ඇති සැටියෙන් අවබෝධ කරන ඥානය යම් අයුරකින් ප්‍රකට වී ඇත්ද, ඒ අයුරින්ම තථාගතයන්වහන්සේ ඔවුන්ට ධ්‍යාන, විමෝක්ෂ, සමාධි සහ සමාපත්තිවල කෙලෙසීමද, පිරිසිදු වීමද, නැවත නැඟී සිටීමද ඇති සැටියෙන් අවබෝධ කරන ඥානය සම්බන්ධයෙන් අසන ලද ප්‍රශ්නයට පිළිතුරු දෙයි.\n\nභික්ෂූනි, එහිලා යම් කිසිවෙක් තථාගතයන්වහන්සේ වෙතට පෙර විසූ කඳ පිළිවෙළ ඇති සැටියෙන් අවබෝධ කරන ඥානය ගැන විමසීමට පැමිණ ප්‍රශ්න අසන්නේ නම්.\n\nමහණෙනි, තථාගතයාණන් වහන්සේට යම් යම් අයුරින් පෙර විසූ කඳපිළිවෙළ සිහි කිරීමේ යථාභූත ඥානය අවබෝධ වී තිබේද, ඒ ඒ අයුරින් තථාගතයාණන් වහන්සේ පෙර විසූ කඳපිළිවෙළ සිහි කිරීමේ යථාභූත ඥානයෙන් ප්‍රශ්න අසන ලද කල්හි උත්තර දෙන්නේය.\n\nමහණෙනි, එහිදී අන්‍යයෝ තථාගතයාණන් වහන්සේ වෙත සත්වයන්ගේ චුතී-උපත් ස්වභාවය පිළිබඳ යථාභූත ඥානයෙන් පැමිණ ප්‍රශ්න අසත්ද, මහණෙනි, තථාගතයාණන් වහන්සේට යම් යම් අයුරින් සත්වයන්ගේ චුතී-උපත් ස්වභාවය පිළිබඳ යථාභූත ඥානය අවබෝධ වී තිබේද, ඒ ඒ අයුරින් තථාගතයාණන් වහන්සේ සත්වයන්ගේ චුතී-උපත් ස්වභාවය පිළිබඳ යථාභූත ඥානයෙන් ප්‍රශ්න අසන ලද කල්හි උත්තර දෙන්නේය. මහණෙනි, එහිදී අන්‍යයෝ තථාගතයාණන් වහන්සේ වෙත ආසවයන් ක්ෂය කිරීම පිළිබඳ යථාභූත ඥානයෙන් පැමිණ ප්‍රශ්න අසත්ද, මහණෙනි, තථාගතයාණන් වහන්සේට යම් යම් අයුරින් ආසවයන් ක්ෂය කිරීම පිළිබඳ යථාභූත ඥානය අවබෝධ වී තිබේද, ඒ ඒ අයුරින් තථාගතයාණන් වහන්සේ ආසවයන් ක්ෂය කිරීම පිළිබඳ යථාභූත ඥානයෙන් ප්‍රශ්න අසන ලද කල්හි උත්තර දෙන්නේය.\n\nමහණෙනි, එහිදී යම් මේ, කාරණා සිදුවිය හැකි ආකාරය ද, සිදුවිය නොහැකි කාරණා සිදුවිය නොහැකි ආකාරය ද යථාභූතව දැනීම නම් වූ ඥානය වේද, එයද සමාධිමත් අයටම කියමි, අසමාධිමත් අයට නොකියමි. යම් මේ, අතීත, අනාගත, වර්තමාන කර්මයන්ගේ (ක්‍රියාවන්ගේ) විපාක සිදුවන හේතූන් ද, ඒවායේ විපාකයන් ද යථාභූතව දැනීම නම් වූ ඥානය වේද, එයද සමාධිමත් අයටම කියමි, අසමාධිමත් අයට නොකියමි. යම් මේ, ධ්‍යාන, විමෝක්ෂ, සමාධි, සමාපත්තිවල කෙලෙසීම, පිරිසිදු වීම, හා ඒවායෙන් නැගී සිටීම පිළිබඳ යථාභූත ඥානය වේද, එයද සමාධිමත් අයටම කියමි, අසමාධිමත් අයට නොකියමි. යම් මේ, පෙර විසූ කඳපිළිවෙළ සිහි කිරීමේ යථාභූත ඥානය වේද, එයද සමාධිමත් අයටම කියමි, අසමාධිමත් අයට නොකියමි. යම් මේ, සත්වයන්ගේ චුතී-උපත් ස්වභාවය පිළිබඳ යථාභූත ඥානය වේද, එයද සමාධිමත් අයටම කියමි, අසමාධිමත් අයට නොකියමි. යම් මේ, ආසවයන් ක්ෂය කිරීම පිළිබඳ යථාභූත ඥානය වේද, එයද සමාධිමත් අයටම කියමි, අසමාධිමත් අයට නොකියමි. මෙසේ, මහණෙනි, සමාධිය මාර්ගයයි, අසමාධිය කුමඟයයි.",
      "paliTitle": "Sīhanādasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Mahāvaggo chaṭṭho. [paṭhamo (syā. ka.)] Tassuddānaṃ – Soṇo phagguno bhijāti, āsavā dāruhatthi ca; Majjhe ñāṇaṃ nibbedhikaṃ, sīhanādoti te dasāti.",
    "english": "",
    "sinhala": ""
  }
}