{
  "id": "mil.7",
  "title": {
    "pali": "Arūpadhammavavattanavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Satiuppajjanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "Rājā āha ‘‘bhante nāgasena, katihākārehi sati uppajjatī’’ti? ‘‘Sattarasahākārehi, mahārāja, sati uppajjatī’’ti. ‘‘Katamehi sattarasahākārehī’’ti? ‘‘Abhijānatopi, mahārāja, sati uppajjati, kaṭumikāyapi sati uppajjati, oḷārikaviññāṇatopi sati uppajjati, hitaviññāṇatopi sati uppajjati, ahitaviññāṇatopi sati uppajjati, sabhāganimittatopi sati uppajjati, visabhāganimittatopi sati uppajjati, kathābhiññāṇatopi sati uppajjati, lakkhaṇatopi sati uppajjati, sāraṇatopi sati uppajjati, muddātopi sati uppajjati, gaṇanātopi sati uppajjati, dhāraṇatopi sati uppajjati, bhāvanatopi sati uppajjati, potthakanibandhanatopi sati uppajjati, upanikkhepatopi sati uppajjati, anubhūtatopi sati uppajjatīti. ‘‘Kathaṃ abhijānato sati uppajjati? Yathā, mahārāja, āyasmā ca ānando khujjuttarā ca upāsikā, ye vā pana aññepi keci jātissarā jātiṃ saranti, evaṃ abhijānato sati uppajjati. ‘‘Kathaṃ kaṭumikāya sati uppajjati? Yo pakatiyā muṭṭhassatiko, pare ca taṃ sarāpanatthaṃ nibandhanti, evaṃ kaṭumikāya sati uppajjati. ‘‘Kathaṃ oḷārikaviññāṇato sati uppajjati? Yadā rajje vā abhisitto hoti, sotāpattiphalaṃ vā patto hoti, evaṃ oḷārikaviññāṇato sati uppajjati. ‘‘Kathaṃ hitaviññāṇato sati uppajjati? Yamhi sukhāpito, ‘amukasmiṃ evaṃ sukhāpito’ti sarati, evaṃ hitaviññāṇato sati uppajjati. ‘‘Kathaṃ ahitaviññāṇato sati uppajjati? Yamhi dukkhāpito, ‘amukasmiṃ evaṃ dukkhāpito’ti sarati, evaṃ ahitaviññāṇato sati uppajjati. ‘‘Kathaṃ sabhāganimittato sati uppajjati? Sadisaṃ puggalaṃ disvā mātaraṃ vā pitaraṃ vā bhātaraṃ vā bhaginiṃ vā sarati, oṭṭhaṃ vā goṇaṃ vā gadrabhaṃ vā disvā aññaṃ tādisaṃ oṭṭhaṃ vā goṇaṃ vā gadrabhaṃ vā sarati, evaṃ sabhāganimittato sati uppajjati. ‘‘Kathaṃ visabhāganimattato sati uppajjati? Asukassa nāma vaṇṇo ediso, saddo ediso, gandho ediso, raso ediso, phoṭṭhabbo edisoti sarati, evampi visabhāganimittatopi ṃsati uppajjati. ‘‘Kathaṃ kathābhiññāṇato sati uppajjati? Yo pakatiyā muṭṭhassatiko hoti, taṃ pare sarāpenti, tena so sarati, evaṃ kathābhiññāṇato sati uppajjati. ‘‘Kathaṃ lakkhaṇato sati uppajjati? Yo pakatiyā balībaddānaṃ aṅgena jānāti, lakkhaṇena jānāti, evaṃ lakkhaṇato sati uppajjati. ‘‘Kathaṃ sāraṇato sati uppajjati? Yo pakatiyā muṭṭhassatiko hoti, yo taṃ ‘sarāhi bho, sarāhi bho’ti punappunaṃ sarāpeti, evaṃ sāraṇato sati uppajjati. ‘‘Kathaṃ muddāto sati uppajjati? Lipiyā sikkhitattā jānāti ‘imassa akkharassa anantaraṃ imaṃ akkharaṃ kātabba’nti evaṃ muddāto sati uppajjati. ‘‘Kathaṃ gaṇanāto sati uppajjati? Gaṇanāya sikkhitattā gaṇakā bahumpi gaṇenti, evaṃ gaṇanāto sati uppajjati. ‘‘Kathaṃ dhāraṇato sati uppajjati? Dhāraṇāya sikkhitattā dhāraṇakā bahumpi dhārenti, evaṃ dhāraṇato sati uppajjati. ‘‘Kathaṃ bhāvanāto sati uppajjati? Idha bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati, seyyathīdaṃ, ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ pubbenivāsaṃ anussarati, evaṃ bhāvanāto sati uppajjati. ‘‘Kathaṃ potthakanibandhanato sati uppajjati? Rājāno anusāsaniyaṃ assarantā [anussarantā (sabbattha)] etaṃ potthakaṃ āharathāti, tena potthakena anussaranti, evaṃ potthakanibandhanato sati uppajjati. ‘‘Kathaṃ upanikkhepato sati uppajjati? Upanikkhittaṃ bhaṇḍaṃ disvā sarati, evaṃ upanikkhepato sati uppajjati. ‘‘Kathaṃ anubhūtato sati uppajjati? Diṭṭhattā rūpaṃ sarati, sutattā saddaṃ sarati, ghāyitattā gandhaṃ sarati, sāyitattā rasaṃ sarati, phuṭṭhattā phoṭṭhabbaṃ sarati, viññātattā dhammaṃ sarati, evaṃ anubhūtato sati uppajjati. Imehi kho, mahārāja, sattarasahākārehi sati uppajjatī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Satiuppajjanapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Buddhaguṇasatipaṭilābhapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Rājā āha ‘‘bhante nāgasena, tumhe etaṃ bhaṇatha ‘yo vassasataṃ akusalaṃ kareyya, maraṇakāle ca ekaṃ buddhaguṇaṃ satiṃ paṭilabheyya, so devesu uppajjeyyā’ti etaṃ na saddahāmi, evañca pana vadetha ‘etena pāṇātipātena niraye uppajjeyyā’ti etampi na saddahāmī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, khuddakopi pāsāṇo vinā nāvāya udake uppilaveyyā’’ti. ‘‘Na hi, bhante’’ti. ‘‘Kiṃ nu kho, mahārāja, vāhasatampi pāsāṇānaṃ nāvāya āropitaṃ udake uppilaveyyā’’ti? ‘‘Āma, bhante’’ti. ‘‘Yathā, mahārāja, nāvā, evaṃ kusalāni kammāni daṭṭhabbānī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Buddhaguṇasatipaṭilābhapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Dukkhappahānavāyamapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Rājā āha ‘‘bhante nāgasena, kiṃ tumhe atītassa dukkhassa pahānāya vāyamathā’’ti? ‘‘Na hi, mahārājā’’ti. ‘‘Kiṃ pana, bhante, anāgatassa dukkhassa pahānāya vāyamathā’’ti? ‘‘Na hi, mahārājā’’ti. ‘‘Kiṃ pana paccuppannassa dukkhassa pahānāya vāyamathā’’ti? ‘‘Na hi, mahārājā’’ti. ‘‘Yadi tumhe na atītassa dukkhassa pahānāya vāyamatha, na anāgatassa dukkhassa pahānāya vāyamatha, na paccuppannassa dukkhassa pahānāya vāyamatha, atha kimatthāya vāyamathā’’ti. Thero āha ‘kinti, mahārāja, idañca dukkhaṃ nirujjheyya, aññañca dukkhaṃ nuppajjeyyā’ti etadatthāya vāyamāmā’’ti. ‘‘Atthi pana te, bhante nāgasena, anāgataṃ dukkha’’nti? ‘‘Natthi [kathā. 828, 829 passitabbaṃ], mahārājā’’ti ‘‘tumhe kho, bhante nāgasena, atipaṇḍitā, ye tumhe asantānaṃ anāgatānaṃ dukkhānaṃ pahānāya vāyamathā’’ti? ‘‘Atthi pana te, mahārāja, keci paṭirājāno paccatthikā paccāmittā paccupaṭṭhitā hontī’’ti? ‘‘Āma, bhante, atthī’’ti. ‘‘Kiṃnu kho, mahārāja, tadā tumhe parikhaṃ khaṇāpeyyātha, pākāraṃ cināpeyyātha gopuraṃ kārāpeyyātha, aṭṭālakaṃ kārāpeyyātha, dhaññaṃ atiharāpeyyāthā’’ti? ‘‘Na hi, bhante, paṭikacceva taṃ paṭiyattaṃ hotī’’ti. ‘‘Kiṃ tumhe, mahārāja, tadā hatthismiṃ sikkheyyātha, assasmiṃ sikkheyyātha, rathasmiṃ sikkheyyātha, dhanusmiṃ sikkheyyātha, tharusmiṃ sikkheyyāthā’’ti? ‘‘Na hi, bhante, paṭikacceva taṃ sikkhitaṃ hotī’’ti. ‘‘Kissatthāyā’’ti? ‘‘Anāgatānaṃ, bhante, bhayānaṃ paṭibāhanatthāyā’’ti. ‘‘Kiṃ nu kho, mahārāja, atthi anāgataṃ bhaya’’nti? ‘‘Natthi, bhante’’ti. ‘‘Tumhe ca kho, mahārāja, atipaṇḍitā, ye tumhe asantānaṃ anāgatānaṃ bhayānaṃ paṭibāhanatthāya paṭiyādethā’’ti. ‘‘Bhiyyo opammaṃ karohīti. ‘‘Taṃ kiṃ maññasi, mahārāja, yadā tvaṃ pipāsito bhaveyyāsi, tadā tvaṃ udapānaṃ khaṇāpeyyāsi, pokkharaṇiṃ khaṇāpeyyāsi, taḷākaṃ khaṇāpeyyāsi ‘pānīyaṃ pivissāmī’’’ti? ‘‘Na hi, bhante, paṭikacceva taṃ paṭiyattaṃ hotī’’ti. ‘‘Kissatthāyā’’ti? ‘‘Anāgatānaṃ, bhante, pipāsānaṃ paṭibāhanatthāya paṭiyattaṃ hotī’’ti. ‘‘Atthi pana, mahārāja, anāgatā pipāsā’’ti? ‘‘Natthi, bhante’’ti. ‘‘Tumhe kho, mahārāja, atipaṇḍitā, ye tumhe asantānaṃ anāgatānaṃ pipāsānaṃ paṭibāhanatthāya taṃ paṭiyādethā’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, yadā tvaṃ bubhukkhito bhaveyyāsi, tadā tvaṃ khettaṃ kasāpeyyāsi, sāliṃ vapāpeyyāsi ‘bhattaṃ bhuñjissāmī’’’ti? ‘‘Na hi, bhante, paṭikacceva taṃ paṭiyattaṃ hotī’’ti. ‘‘Kissatthāyā’’ti. ‘‘Anāgatānaṃ, bhante, bubhukkhānaṃ paṭibāhanatthāyā’’ti. ‘‘Atthi pana, mahārāja, anāgatā bubhukkhā’’ti? ‘‘Natthi, bhante’’ti. ‘‘Tumhe kho, mahārāja, atipaṇḍitā, ye tumhe asantānaṃ anāgatānaṃ bubhukkhānaṃ paṭibāhanatthāya paṭiyādethā’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Dukkhappahānavāyamapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Brahmalokapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Rājā āha ‘‘bhante nāgasena, kīvadūro ito brahmaloko’’ti? ‘‘Dūro kho, mahārāja, ito brahmaloko kūṭāgāramattā silā tamhā patitā ahorattena aṭṭhacattālīsayojanasahassāni bhassamānā catūhi māsehi pathaviyaṃ patiṭṭhaheyyā’’ti. ‘‘Bhante nāgasena, tumhe evaṃ bhaṇatha ‘seyyathāpi balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evameva iddhimā bhikkhu cetovasippatto jambudīpe antarahito brahmaloke pātubhaveyyā’ti etaṃ vacanaṃ na saddahāmi, evaṃ atisīghaṃ tāva bahūni yojanasatāni gacchissatī’’ti. Thero āha ‘‘kuhiṃ pana, mahārāja, tava jātabhūmī’’ti? ‘‘Atthi, bhante, alasando nāma dīpo, tatthāhaṃ jāto’’ti. ‘‘Kīva dūro, mahārāja, ito alasando hotī’’ti? ‘‘Dvimattāni, bhante, yojanasatānī’’ti. ‘‘Abhijānāsi nu tvaṃ, mahārāja, tattha kiñcideva karaṇīyaṃ karitvā saritā’’ti? ‘‘Āma, bhante, sarāmī’’ti. ‘‘Lahuṃ kho tvaṃ, mahārāja, gatosi dvimattāni yojanasatānī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Brahmalokapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Dvinnaṃ lokuppannānaṃ samakabhāvapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Rājā āha ‘‘bhante nāgasena, yo idha kālaṅkato brahmaloke uppajjeyya, yo ca idha kālaṅkato kasmīre uppajjeyya, ko cirataraṃ ko sīghatara’’nti? ‘‘Samakaṃ, mahārājā’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Kuhiṃ pana, mahārāja, tava jātanagara’’nti? ‘‘Atthi, bhante, kalasigāmo nāma, tatthāhaṃ jāto’’ti. ‘‘Kīva dūro, mahārāja, ito kalasigāmo hotī’’ti. ‘‘Dvimattāni, bhante, yojanasatānī’’ti. ‘‘Kīva dūraṃ, mahārāja, ito kasmīraṃ hotī’’ti? ‘‘Dvādasa, bhante, yojanānī’’ti. ‘‘Iṅgha, tvaṃ mahārāja, kalasigāmaṃ cintehī’’ti. ‘‘Cintito, bhante’’ti. ‘‘Iṅgha, tvaṃ mahārāja, kasmīraṃ cintehī’’ti. ‘‘Cintitaṃ bhante’’ti. ‘‘Katamaṃ nu kho, mahārāja, cirena cintitaṃ, katamaṃ sīghatara’’nti? ‘‘Samakaṃ bhante’’ti. ‘‘Evameva kho, mahārāja, yo idha kālaṅkato brahmaloke uppajjeyya, yo ca idha kālaṅkato kasmīre uppajjeyya, samakaṃ yeva uppajjantī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, dve sakuṇā ākāsena gaccheyyuṃ, tesu eko ucce rukkhe nisīdeyya, eko nīce rukkhe nisīdeyya, tesaṃ samakaṃ patiṭṭhitānaṃ katamassa chāyā paṭhamataraṃ pathaviyaṃ patiṭṭhaheyya, katamassa chāyā cirena pathaviyaṃ patiṭṭhaheyyā’’ti? ‘‘Samakaṃ, bhante’’ti. ‘‘Evameva kho, mahārāja, yo idha kālaṅkato brahmaloke uppajjeyya, yo ca idha kālaṅkato kasmīre uppajjeyya, samakaṃ yeva uppajjantī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Dvinnaṃ lokuppannānaṃ samakabhāvapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Bojjhaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Rājā āha ‘‘kati nu kho, bhante nāgasena, bojjhaṅgā’’ti? ‘‘Satta kho, mahārāja, bojjhaṅgā’’ti. ‘‘Katihi pana, bhante, bojjhaṅgehi bujjhatī’’ti? ‘‘Ekena kho, mahārāja, bojjhaṅgena bujjhati dhammavicayasambojjhaṅgenā’’ti. ‘‘Atha kissa nu kho, bhante, vuccanti ‘satta bojjhaṅgā’’’ti? ‘‘Taṃ kiṃ maññasi, mahārāja, asi kosiyā pakkhitto aggahito hatthena ussahati chejjaṃ chinditu’’nti. ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, dhammavicayasambojjhaṅgena vinā chahi bojjhaṅgehi na bujjhatī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Bojjhaṅgapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Pāpapuññānaṃ appānappabhāvapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Rājā āha ‘‘bhante nāgasena, kataraṃ nu kho bahutaraṃ puññaṃ vā apuññaṃ vā’’ti? ‘‘Puññaṃ kho, mahārāja, bahutaraṃ, apuññaṃ thoka’’nti. ‘‘Kena kāraṇenā’’ti? ‘‘Apuññaṃ kho, mahārāja, karonto vippaṭisārī hoti ‘pāpakammaṃ mayā kata’nti, tena pāpaṃ na vaḍḍhati. Puññaṃ kho, mahārāja, karonto avippaṭisārī hoti, avippaṭisārino pāmojjaṃ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyati, samāhito yathābhūtaṃ pajānāti, tena kāraṇena puññaṃ vaḍḍhati. Puriso kho, mahārāja, chinnahatthapādo bhagavato ekaṃ uppalahatthaṃ datvā ekanavutikappāni vinipātaṃ na gacchissati. Imināpi, mahārāja, kāraṇena bhaṇāmi ‘puññaṃ bahutaraṃ, apuññaṃ thoka’’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Pāpapuññānaṃ appānappabhāvapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Jānantājānantapāpakaraṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Rājā āha ‘‘bhante nāgasena, yo jānanto pāpakammaṃ karoti, yo ajānanto pāpakammaṃ karoti, kassa bahutaraṃ apuñña’’nti? Thero āha ‘‘yo kho, mahārāja, ajānanto pāpakammaṃ karoti, tassa bahutaraṃ apuñña’’nti. ‘‘Tena hi, bhante nāgasena, yo amhākaṃ rājaputto vā rājamahāmatto vā ajānanto pāpakammaṃ karoti, taṃ mayaṃ diguṇaṃ daṇḍemā’’ti? ‘‘Taṃ kiṃ maññasi, mahārāja, tattaṃ ayoguḷaṃ ādittaṃ sampajjalitaṃ sajotibhūtaṃ eko jānanto gaṇheyya, eko ajānanto gaṇheyya, katamo [kassa (ka.)] balavataraṃ ḍayheyyā’’ti. ‘‘Yo kho, bhante, ajānanto gaṇheyya, so [tassa (pī. ka.)] balavataraṃ ḍayheyyā’’ti. ‘‘Evameva kho, mahārāja, yo ajānanto pāpakammaṃ karoti, tassa bahutaraṃ apuñña’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Jānantājānantapāpakaraṇapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Uttarakurukādigamanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Rājā āha ‘‘bhante nāgasena, atthi koci, yo iminā sarīrena uttarakuruṃ vā gaccheyya, brahmalokaṃ vā, aññaṃ vā pana dīpa’’nti? ‘‘Atthi, mahārāja, yo iminā cātummahābhūtikena kāyena uttarakuruṃ vā gaccheyya, brahmalokaṃ vā, aññaṃ vā pana dīpa’’nti. ‘‘Kathaṃ, bhante nāgasena, iminā cātummahābhūtikena kāyena uttarakuruṃ vā gaccheyya, brahmalokaṃ vā, aññaṃ vā pana dīpa’’nti? ‘‘Abhijānāsi nu, tvaṃ mahārāja, imissā pathaviyā vidatthiṃ vā ratanaṃ vā laṅghitā’’ti? ‘‘Āma, bhante, abhijānāmi ‘ahaṃ, bhante nāgasena, aṭṭhapi rataniyo laṅghemī’’’ti. ‘‘Kathaṃ, tvaṃ mahārāja, aṭṭhapi rataniyo laṅghesī’’ti? ‘‘Ahañhi, bhante, cittaṃ uppādemi ‘ettha nipatissāmī’ti saha cittuppādena kāyo me lahuko hotī’’ti. ‘‘Evameva kho, mahārāja, iddhimā bhikkhu cetovasippatto kāyaṃ citte samāropetvā cittavasena vehāsaṃ gacchatī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Uttarakurukādigamanapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Dīghaṭṭhipañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Rājā āha ‘‘bhante nāgasena, tumhe evaṃ bhaṇatha ‘aṭṭhikāni dīghāni yojanasatikānipī’ti, rukkhopi tāva natthi yojanasatiko, kuto pana aṭṭhikāni dīghāni yojanasatikāni bhavissantī’’ti? ‘‘Taṃ kiṃ maññasi, mahārāja, sutaṃ te ‘mahāsamudde pañcayojanasatikāpi macchā atthī’’’ti? ‘‘Āma, bhante, suta’’nti. ‘‘Nanu mahārāja, pañcayojanasatikassa macchassa aṭṭhikāni dīghāni bhavissanti yojanasatikānipī’’ti? ‘‘Kallosi, bhante nāgasenā’’ti. Dīghaṭṭhipañho dasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "Assāsapassāsanirodhapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "Rājā āha ‘‘bhante nāgasena, tumhe evaṃ bhaṇatha ‘sakkā assāsapassāse nirodhetu’’’nti? ‘‘Āma, mahārāja, sakkā assāsapassāse nirodhetu’’nti. ‘‘Kathaṃ, bhante nāgasena, sakkā assāsapassāse nirodhetu’’nti. ‘‘Taṃ kiṃ maññasi, mahārāja, sutapubbo te koci kākacchamāno’’ti. ‘‘Āma, bhante, sutapubbo’’ti. ‘‘Kiṃ nu kho, mahārāja, so saddo kāye namite virameyyā’’ti. ‘‘Āma, bhante, virameyyā’’ti. ‘‘So hi nāma, mahārāja, saddo abhāvitakāyassa abhāvitasīlassa abhāvitacittassa abhāvitapaññassa kāye namite viramissati, kiṃ pana bhāvitakāyassa bhāvitasīlassa bhāvitacittassa bhāvitapaññassa catutthajjhānaṃ samāpannassa assāsapassāsā na nirujjhissantī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Assāsapassāsanirodhapañho ekādasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "Samuddapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "Rājā āha ‘‘bhante nāgasena, ‘samuddo samuddo’ti vuccati, kena kāraṇena udakaṃ ‘samuddo’ti vuccatī’’ti? Thero āha ‘‘yattakaṃ, mahārāja, udakaṃ, tattakaṃ loṇaṃ. Yattakaṃ loṇaṃ, tattakaṃ udakaṃ. Tasmā ‘samuddo’ti vuccatī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Samuddapañho dvādasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "Samuddaekarasapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "Rājā āha ‘‘bhante nāgasena, kena kāraṇena samuddo ekaraso loṇaraso’’ti? ‘‘Cirasaṇṭhitattā kho, mahārāja, udakassa samuddo ekaraso loṇaraso’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Samuddaekarasapañho terasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "Sukhumapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "Rājā āha ‘‘bhante nāgasena, sakkā sabbaṃ sukhumaṃ chinditu’’nti? ‘‘Āma, mahārāja, sakkā sabbaṃ sukhumaṃ chinditu’’nti. ‘‘Kiṃ pana, bhante, sabbaṃ sukhuma’’nti? ‘‘Dhammo kho, mahārāja, sabbasukhumo, na kho, mahārāja, dhammā sabbe sukhumā, ‘sukhuma’nti vā ‘thūla’nti vā dhammānametamadhivacanaṃ. Yaṃ kiñci chinditabbaṃ, sabbaṃ taṃ paññāya chindati, natthi dutiyaṃ paññāya chedana’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Sukhumapañho cuddasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "Viññāṇanānatthapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "Rājā āha ‘‘bhante nāgasena, ‘viññāṇa’nti vā ‘paññā’ti vā ‘bhūtasmiṃ jīvo’ti vā ime dhammā nānatthā ceva nānābyañjanā ca, udāhu ekatthā byañjanameva nāna’’nti? ‘‘Vijānanalakkhaṇaṃ, mahārāja, viññāṇaṃ, pajānanalakkhaṇā paññā, bhūtasmiṃ jīvo nupalabbhatī’’ti. ‘‘Yadi jīvo nupalabbhati, atha ko carahi cakkhunā rūpaṃ passati, sotena saddaṃ suṇāti, ghānena gandhaṃ ghāyati, jivhāya rasaṃ sāyati, kāyena phoṭṭhabbaṃ phusati, manasā dhammaṃ vijānātī’’ti? Thero āha ‘‘yadi jīvo cakkhunā rūpaṃ passati…pe… manasā dhammaṃ vijānāti, so jīvo cakkhudvāresu uppāṭitesu mahantena ākāsena bahimukho suṭṭhutaraṃ rūpaṃ passeyya, sotesu uppāṭitesu, ghāne uppāṭite, jivhāya uppāṭitāya, kāye uppāṭite mahantena ākāsena suṭṭhutaraṃ saddaṃ suṇeyya, gandhaṃ ghāyeyya, rasaṃ sāyeyya, phoṭṭhabbaṃ phuseyyā’’ti? ‘‘Na hi, bhante’’ti. ‘‘Tena hi, mahārāja, bhūtasmiṃ jīvo nupalabbhatī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Viññāṇanānatthapañho pannarasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "Arūpadhammavavatthānadukkarapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "Rājā āha ‘‘bhante nāgasena, dukkaraṃ nu kho bhagavatā kata’’nti? Thero āha ‘‘dukkaraṃ, mahārāja, bhagavatā kata’’nti. ‘‘Kiṃ pana, bhante nāgasena, bhagavatā dukkaraṃ kata’’nti. ‘‘Dukkaraṃ, mahārāja, bhagavatā kataṃ imesaṃ arūpīnaṃ cittacetasikānaṃ dhammānaṃ ekārammaṇe vattamānānaṃ vavatthānaṃ akkhātaṃ ‘ayaṃ phasso, ayaṃ vedanā, ayaṃ saññā, ayaṃ cetanā, idaṃ citta’’’nti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso nāvāya mahāsamuddaṃ ajjhogāhetvā hatthapuṭena udakaṃ gahetvā jivhāya sāyitvā jāneyya nu kho, mahārāja, so puriso ‘‘idaṃ gaṅgāya udakaṃ, idaṃ yamunāya udakaṃ, idaṃ aciravatiyā udakaṃ, idaṃ sarabhuyā udakaṃ, idaṃ mahiyā udaka’’’nti? ‘‘Dukkaraṃ, bhante, jānitu’’nti. ‘‘Ito dukkarataraṃ kho, mahārāja, bhagavatā kataṃ imesaṃ arūpīnaṃ cittacetasikānaṃ dhammānaṃ ekārammaṇe vattamānānaṃ vavatthānaṃ akkhātaṃ ‘ayaṃ phasso, ayaṃ vedanā, ayaṃ saññā, ayaṃ cetanā, idaṃ citta’’’nti. ‘‘Suṭṭhu, bhante’’ti rājā abbhānumodīti. Arūpadhammavavatthānadukkarapañho soḷasamo. Arūpadhammavavatthānavaggo sattamo. Imasmiṃ vagge soḷasa pañhā. Milindapañhapucchāvisajjanā Thero āha ‘‘jānāsi kho, mahārāja, sampati kā velā’’ti? ‘‘Āma, bhante, jānāmi ‘sampati paṭhamo yāmo atikkanto, majjhimo yāmo pavattati, ukkā padīpīyanti, cattāri paṭākāni āṇattāni gamissanti bhaṇḍato rājadeyyānī’’’ti. Yonakā evamāhaṃsu ‘‘kallosi, mahārāja, paṇḍito thero’’ti. ‘‘Āma, bhaṇe, paṇḍito thero, ediso ācariyo bhaveyya mādiso ca antevāsī, nacirasseva paṇḍito dhammaṃ ājāneyyā’’ti. Tassa pañhaveyyākaraṇena tuṭṭho rājā theraṃ nāgasenaṃ satasahassagghanakena kambalena acchādetvā ‘‘bhante nāgasena, ajjatagge te aṭṭhasataṃ bhattaṃ paññapemi, yaṃ kiñci antepure kappiyaṃ, tena ca pavāremī’’ti āha. Alaṃ mahārāja jīvāmī’’ti. ‘‘Jānāmi, bhante nāgasena, jīvasi, api ca attānañca rakkha, mamañca rakkhāhī’’ti. ‘‘Kathaṃ attānaṃ rakkhasi, ‘nāgaseno milindaṃ rājānaṃ pasādeti, na ca kiñci alabhī’ti parāpavādo [parappavādo (ka.)] āgaccheyyāti, evaṃ attānaṃ rakkha. Kathaṃ mamaṃ rakkhasi, ‘milindo rājā pasanno pasannākāraṃ na karotī’ti parāpavādo āgaccheyyāti, evaṃ mamaṃ rakkhāhī’’ti. ‘‘Tathā hotu, mahārājā’’ti. ‘‘Seyyathāpi, bhante, sīho migarājā suvaṇṇapañjare pakkhittopi bahimukho yeva hoti, evameva kho ahaṃ, bhante, kiñcāpi agāraṃ ajjhāvasāmi bahimukho yeva pana acchāmi. Sace ahaṃ, bhante, agārasmā anāgāriyaṃ pabbajeyyaṃ, na ciraṃ jīveyyaṃ, bahū me paccatthikā’’ti. Atha kho āyasmā nāgaseno milindassa rañño pañhaṃ visajjetvā uṭṭhāyāsanā saṅghārāmaṃ agamāsi. Acirapakkante ca āyasmante nāgasene milindassa rañño etadahosi ‘‘kiṃ mayā pucchitaṃ, kiṃ bhadantena nāgasenena visajjita’’nti? Atha kho milindassa rañño etadahosi ‘‘sabbaṃ mayā supucchitaṃ, sabbaṃ bhadantena nāgasenena suvisajjita’’nti. Āyasmatopi nāgasenassa saṅghārāmagatassa etadahosi ‘‘kiṃ milindena raññā pucchitaṃ, kiṃ mayā visajjita’’nti. Atha kho āyasmato nāgasenassa etadahosi ‘‘sabbaṃ milindena raññā supucchitaṃ, sabbaṃ mayā suvisajjita’’nti. Atha kho āyasmā nāgaseno tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena milindassa rañño nivesanaṃ tenupasaṅkami, upasaṅkamitvā paññatte āsane nisīdi. Atha kho milindo rājā āyasmantaṃ nāgasenaṃ abhivādetvā ekamantaṃ nisīdi, ekamantaṃ nisinno kho milindo rājā āyasmantaṃ nāgasenaṃ etadavoca – ‘‘Mā kho bhadantassa evaṃ ahosi ‘nāgaseno mayā pañhaṃ pucchito’ti teneva somanassena taṃ rattāvasesaṃ vītināmesīti na te evaṃ daṭṭhabbaṃ. Tassa mayhaṃ, bhante, taṃ rattāvasesaṃ etadahosi ‘kiṃ mayā pucchitaṃ, kiṃ bhadantena visajjita’nti, ‘sabbaṃ mayā supucchitaṃ, sabbaṃ bhadantena suvisajjita’’’nti. Theropi evamāha – ‘‘mā kho mahārājassa evaṃ ahosi ‘milindassa rañño mayā pañho visajjito’ti teneva somanassena taṃ rattāvasesaṃ vītināmesīti na te evaṃ daṭṭhabbaṃ. Tassa mayhaṃ, mahārāja, taṃ rattāvasesaṃ etadahosi ‘kiṃ milindena raññā pucchitaṃ, kiṃ mayā visajjita’nti, ‘sabbaṃ milindena raññā supucchitaṃ, sabbaṃ mayā suvisajjita’’’nti itiha te mahānāgā aññamaññassa subhāsitaṃ samanumodiṃsūti. Milindapañhapucchāvisajjanā niṭṭhitā. Aṭṭhamantaparivajjanīyaṭṭhānāni Bhassappavādo [bhassappavedī (sī. pī.)] vetaṇḍī, atibuddhi vicakkhaṇo; Milindo ñāṇabhedāya, nāgasenamupāgami. Vasanto tassa chāyāya, paripucchaṃ punappunaṃ; Pabhinnabuddhi hutvāna, sopi āsi tipeṭako. Navaṅgaṃ anumajjanto, rattibhāge rahogato; Addakkhi meṇḍake pañhe, dunniveṭhe saniggahe. ‘‘Pariyāyabhāsitaṃ atthi, atthi sandhāyabhāsitaṃ; Sabhāvabhāsitaṃ atthi, dhammarājassa sāsane. ‘‘Tesamatthaṃ aviññāya, meṇḍake jinabhāsite; Anāgatamhi addhāne, viggaho tattha hessati. ‘‘Handa kathiṃ pasādetvā, chejjāpessāmi meṇḍake; Tassa niddiṭṭhamaggena, niddisissantyanāgate’’ti. Atha kho milindo rājā pabhātāya rattiyā uddhaste [uṭṭhite (syā.), uggate (sī. pī.)] aruṇe sīsaṃ nhatvā sirasi añjaliṃ paggahetvā atītānāgatapaccuppanne sammāsambuddhe anussaritvā aṭṭha vattapadāni samādiyi ‘‘ito me anāgatāni satta divasāni aṭṭha guṇe samādiyitvā tapo caritabbo bhavissati, sohaṃ ciṇṇatapo samāno ācariyaṃ ārādhetvā meṇḍake pañhe pucchissāmī’’ti. Atha kho milindo rājā pakatidussayugaṃ apanetvā ābharaṇāni ca omuñcitvā kāsāvaṃ nivāsetvā muṇḍakapaṭisīsakaṃ sīse paṭimuñcitvā munibhāvamupagantvā aṭṭha guṇe samādiyi ‘‘imaṃ sattāhaṃ mayā na rājattho anusāsitabbo, na rāgūpasañhitaṃ cittaṃ uppādetabbaṃ, na dosūpasañhitaṃ cittaṃ uppādetabbaṃ, na mohūpasañhitaṃ cittaṃ uppādetabbaṃ, dāsakammakaraporise janepi nivātavuttinā bhavitabbaṃ, kāyikaṃ vācasikaṃ anurakkhitabbaṃ, chapi āyatanāni niravasesato anurakkhitabbāni, mettābhāvanāya mānasaṃ pakkhipitabba’’nti. Ime aṭṭha guṇe samādiyitvā tesveva aṭṭhasu guṇesu mānasaṃ patiṭṭhapetvā bahi anikkhamitvā sattāhaṃ vītināmetvā aṭṭhame divase pabhātāya rattiyā pageva pātarāsaṃ katvā okkhittacakkhu mitabhāṇī susaṇṭhitena iriyāpathena avikkhittena cittena haṭṭhena udaggena vippasannena theraṃ nāgasenaṃ upasaṅkamitvā therassa pāde sirasā vanditvā ekamantaṃ ṭhito idamavoca – ‘‘Atthi me, bhante nāgasena, koci attho tumhehi saddhiṃ mantayitabbo, na tattha añño koci tatiyo icchitabbo, suññe okāse pavivitte araññe aṭṭhaṅgupāgate samaṇasāruppe. Tattha so pañho pucchitabbo bhavissati, tattha me guyhaṃ na kātabbaṃ na rahassakaṃ, arahāmahaṃ rahassakaṃ suṇituṃ sumantane upagate, upamāyapi so attho upaparikkhitabbo, yathā kiṃ viya, yathā nāma, bhante nāgasena, mahāpathavī nikkhepaṃ arahati nikkhepe upagate. Evameva kho, bhante nāgasena, arahāmahaṃ rahassakaṃ suṇituṃ sumantane upagate’’ti. Garunā saha pavivittapavanaṃ pavisitvā idamavoca – ‘‘bhante nāgasena, idha purisena mantayitukāmena aṭṭha ṭhānāni parivajjayitabbāni bhavanti, na tesu ṭhānesu viññū puriso atthaṃ manteti, mantitopi attho paripatati na sambhavati. Katamāni aṭṭha ṭhānāni? Visamaṭṭhānaṃ parivajjanīyaṃ, sabhayaṃ parivajjanīyaṃ, ativātaṭṭhānaṃ parivajjanīyaṃ, paṭicchannaṭṭhānaṃ parivajjanīyaṃ, devaṭṭhānaṃ parivajjanīyaṃ, pantho parivajjanīyo, saṅgāmo [saṅkamo (sī. pī.)] parivajjanīyo, udakatitthaṃ parivajjanīyaṃ. Imāni aṭṭha ṭhānāni parivajjanīyānī’’ti. Thero āha ‘‘ko doso visamaṭṭhāne, sabhaye, ativāte, paṭicchanne, devaṭṭhāne, panthe, saṅgāme, udakatitthe’’ti? ‘‘Visame, bhante nāgasena, mantito attho vikirati vidhamati paggharati na sambhavati, sabhaye mano santassati, santassito na sammā atthaṃ samanupassati, ativāte saddo avibhūto hoti, paṭicchanne upassutiṃ tiṭṭhanti, devaṭṭhāne mantito attho garukaṃ pariṇamati, panthe mantito attho tuccho bhavati, saṅgāme cañcalo bhavati, udakatitthe pākaṭo bhavati. Bhavatīha – ‘‘‘Visamaṃ sabhayaṃ ativāto, paṭicchannaṃ devanissitaṃ; Pantho ca saṅgāmo titthaṃ, aṭṭhete parivajjiyā’’’ti. Aṭṭha mantanassa parivajjanīyaṭṭhānāni. Aṭṭhamantavināsakapuggalā ‘‘Bhante nāgasena, aṭṭhime puggalā mantiyamānā mantitaṃ atthaṃ byāpādenti. Katame aṭṭha? Rāgacarito dosacarito mohacarito mānacarito luddho alaso ekacintī bāloti. Ime aṭṭha puggalā mantitaṃ atthaṃ byāpādentī’’ti. Thero āha ‘‘tesaṃ ko doso’’ti? ‘‘Rāgacarito, bhante nāgasena, rāgavasena mantitaṃ atthaṃ byāpādeti, dosacarito dosavasena mantitaṃ atthaṃ byāpādeti, mohacarito mohavasena mantitaṃ atthaṃ byāpādeti, mānacarito mānavasena mantitaṃ atthaṃ byāpādeti, luddho lobhavasena mantitaṃ atthaṃ byāpādeti, alaso alasatāya mantitaṃ atthaṃ byāpādeti, ekacintī ekacintitāya mantitaṃ atthaṃ byāpādeti, bālo bālatāya mantitaṃ atthaṃ byāpādeti. Bhavatīha – ‘‘‘Ratto duṭṭho ca mūḷho ca, mānī luddho tathālaso; Ekacintī ca bālo ca, ete atthavināsakā’’’ti. Aṭṭha mantavināsakapuggalā. Navaguyhamantavidhaṃsakaṃ ‘‘Bhante nāgasena, navime puggalā mantitaṃ guyhaṃ vivaranti na dhārenti. Katame nava? Rāgacarito dosacarito mohacarito bhīruko āmisagaruko itthī soṇḍo paṇḍako dārako’’ti. Thero āha ‘‘tesaṃ ko doso’’ti? ‘‘Rāgacarito, bhante nāgasena, rāgavasena mantitaṃ guyhaṃ vivarati na dhāreti, dosacarito, bhante, dosavasena mantitaṃ guyhaṃ vivarati na dhāreti, mūḷho mohavasena mantitaṃ guyhaṃ vivarati na dhāreti, bhīruko bhayavasena mantitaṃ guyhaṃ vivarati na dhāreti, āmisagaruko āmisahetu mantitaṃ guyhaṃ vivarati na dhāreti, itthī paññāya ittaratāya mantitaṃ guyhaṃ vivarati na dhāreti, soṇḍiko surālolatāya mantitaṃ guyhaṃ vivarati na dhāreti, paṇḍako anekaṃsikatāya mantitaṃ guyhaṃ vivarati na dhāreti, dārako capalatāya mantitaṃ guyhaṃ vivarati na dhāreti. Bhavatīha – ‘‘‘Ratto duṭṭho ca mūḷho ca, bhīru āmisagaruko [āmisacakkhuko (sī. pī.)]; Itthī soṇḍo paṇḍako ca, navamo bhavati dārako. ‘‘Navete puggalā loke, ittarā calitā calā; Etehi mantitaṃ guyhaṃ, khippaṃ bhavati pākaṭa’’’nti. Nava guyhamantavidhaṃsakā puggalā. Aṭṭha paññāpaṭilābhakāraṇaṃ ‘‘Bhante nāgasena, aṭṭhahi kāraṇehi buddhi pariṇamati paripākaṃ gacchati. Katamehi aṭṭhahi? Vayapariṇāmena buddhi pariṇamati paripākaṃ gacchati, yasapariṇāmena buddhi pariṇamati paripākaṃ gacchati, paripucchāya buddhi pariṇamati paripākaṃ gacchati, titthasaṃvāsena buddhi pariṇamati paripākaṃ gacchati, yoniso manasikārena buddhi pariṇamati paripākaṃ gacchati, sākacchāya buddhi pariṇamati paripākaṃ gacchati, snehūpasevanena buddhi pariṇamati paripākaṃ gacchati, patirūpadesavāsena buddhi pariṇamati paripākaṃ gacchati. Bhavatīha – ‘‘‘Vayena yasapucchāhi, titthavāsena yoniso; Sākacchā snehasaṃsevā, patirūpavasena ca. ‘‘Etāni aṭṭha ṭhānāni, buddhivisadakāraṇā; Yesaṃ etāni sambhonti, tesaṃ buddhi pabhijjatī’’’ti. Aṭṭha paññāpaṭilābhakāraṇāni. Ācariyaguṇaṃ ‘‘Bhante nāgasena, ayaṃ bhūmibhāgo aṭṭha mantadosavivajjito, ahañca loke paramo mantisahāyo [mantasahāyo (sī.)], guyhamanurakkhī cāhaṃ yāvāhaṃ jīvissāmi tāva guyhamanurakkhissāmi, aṭṭhahi ca me kāraṇehi buddhi pariṇāmaṃ gatā, dullabho etarahi mādiso antevāsī, sammā paṭipanne antevāsike ye ācariyānaṃ pañcavīsati ācariyaguṇā, tehi guṇehi ācariyena sammā paṭipajjitabbaṃ. Katame pañcavīsati guṇā? ‘‘Idha, bhante nāgasena, ācariyena antevāsimhi satataṃ samitaṃ ārakkhā upaṭṭhapetabbā, asevanasevanā jānitabbā, pamattāppamattā jānitabbā, seyyavakāso jānitabbo, gelaññaṃ jānitabbaṃ, bhojanassa [bhojanīyaṃ (syā.)] laddhāladdhaṃ jānitabbaṃ, viseso jānitabbo, pattagataṃ saṃvibhajitabbaṃ, assāsitabbo ‘mā bhāyi, attho te abhikkamatī’ti, ‘iminā puggalena paṭicaratī’ti [paṭicarāhīti (ka.)] paṭicāro jānitabbo, gāme paṭicāro jānitabbo, vihāre paṭicāro jānitabbo, na tena hāso davo kātabbo [na tena saha sallāpo kātabbo (sī. pī.)], tena saha ālāpo kātabbo, chiddaṃ disvā adhivāsetabbaṃ, sakkaccakārinā bhavitabbaṃ, akhaṇḍakārinā bhavitabbaṃ, arahassakārinā bhavitabbaṃ, niravasesakārinā bhavitabbaṃ, ‘janemimaṃ [jānemimaṃ (syā.)] sippesū’ti janakacittaṃ upaṭṭhapetabbaṃ, ‘kathaṃ ayaṃ na parihāyeyyā’ti vaḍḍhicittaṃ upaṭṭhapetabbaṃ, ‘balavaṃ imaṃ karomi sikkhābalenā’ti cittaṃ upaṭṭhapetabbaṃ, mettacittaṃ upaṭṭhapetabbaṃ, āpadāsu na vijahitabbaṃ, karaṇīye nappamajjitabbaṃ, khalite dhammena paggahetabboti. Ime kho, bhante, pañcavīsati ācariyassa ācariyaguṇā, tehi guṇehi mayi sammā paṭipajjassu, saṃsayo me, bhante, uppanno, atthi meṇḍakapañhā jinabhāsitā, anāgate addhāne tattha viggaho uppajjissati, anāgate ca addhāne dullabhā bhavissanti tumhādisā buddhimanto, tesu me pañhesu cakkhuṃ dehi paravādānaṃ niggahāyā’’ti. Upāsakaguṇaṃ Thero ‘‘sādhū’’ti sampaṭicchitvā dasa upāsakassa upāsakaguṇe paridīpesi. ‘‘Dasa ime, mahārāja, upāsakassa upāsakaguṇā. Katame dasa, idha, mahārāja, upāsako saṅghena samānasukhadukkho hoti, dhammādhipateyyo hoti, yathābalaṃ saṃvibhāgarato hoti, jinasāsanaparihāniṃ disvā abhivaḍḍhiyā vāyamati. Sammādiṭṭhiko hoti, apagatakotūhalamaṅgaliko jīvitahetupi na aññaṃ satthāraṃ uddisati, kāyikavācasikañcassa rakkhitaṃ hoti, samaggārāmo hoti samaggarato, anusūyako hoti, na ca kuhanavasena sāsane carati, buddhaṃ saraṇaṃ gato hoti, dhammaṃ saraṇaṃ gato hoti, saṅghaṃ saraṇaṃ gato hoti. Ime kho, mahārāja, dasa upāsakassa upāsakaguṇā, te sabbe guṇā tayi saṃvijjanti, taṃ te yuttaṃ pattaṃ anucchavikaṃ patirūpaṃ yaṃ tvaṃ jinasāsanaparihāniṃ disvā abhivaḍḍhiṃ icchasi, karomi te okāsaṃ, puccha maṃ tvaṃ yathāsukha’’nti. Meṇḍakapañhārambhakathā niṭṭhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Meṇḍakapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": "Meṇḍakapañhārambhakathā"
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}