{
  "id": "mil.4",
  "title": {
    "pali": "Nibbānavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Phassādivinibbhujanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "Rājā āha ‘‘bhante nāgasena, sakkā imesaṃ dhammānaṃ ekatobhāvagatānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetuṃ ‘ayaṃ phasso, ayaṃ vedanā, ayaṃ saññā, ayaṃ cetanā, idaṃ viññāṇaṃ, ayaṃ vitakko, ayaṃ vicāro’ti’’? ‘‘Na sakkā, mahārāja, imesaṃ dhammānaṃ ekatobhāvagatānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetuṃ ‘ayaṃ phasso, ayaṃ vedanā, ayaṃ saññā, ayaṃ cetanā, idaṃ viññāṇaṃ, ayaṃ vitakko, ayaṃ vicāro’’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, rañño sūdo arasaṃ vā rasaṃ vā [yūsaṃ vā rasaṃ vā (sī. syā. pī.)] kareyya, so tattha dadhimpi pakkhipeyya, loṇampi pakkhipeyya, siṅgiverampi pakkhipeyya, jīrakampi pakkhipeyya, maricampi pakkhipeyya, aññānipi pakārāni pakkhipeyya, tamenaṃ rājā evaṃ vadeyya, ‘dadhissa me rasaṃ āhara, loṇassa me rasaṃ āhara, siṅgiverassa me rasaṃ āhara, jīrakassa me rasaṃ āhara, maricassa me rasaṃ āhara, sabbesaṃ me pakkhittānaṃ rasaṃ āharā’ti. Sakkā nu kho, mahārāja, tesaṃ rasānaṃ ekatobhāvagatānaṃ vinibbhujitvā vinibbhujitvā rasaṃ āharituṃ ambilattaṃ vā lavaṇattaṃ vā tittakattaṃ vā kaṭukattaṃ vā kasāyattaṃ vā madhurattaṃ vā’’ti? ‘‘Na hi, bhante, sakkā tesaṃ rasānaṃ ekatobhāvagatānaṃ vinibbhujitvā vinibbhujitvā rasaṃ āharituṃ ambilattaṃ vā lavaṇattaṃ vā tittakattaṃ vā kaṭukattaṃ vā kasāyattaṃ vā madhurattaṃ vā, api ca kho pana sakena sakena lakkhaṇena upaṭṭhahantī’’ti. ‘‘Evameva kho, mahārāja, na sakkā imesaṃ dhammānaṃ ekatobhāvagatānaṃ vinibbhujitvā vinibbhujitvā nānākaraṇaṃ paññāpetuṃ ‘ayaṃ phasso, ayaṃ vedanā, ayaṃ saññā, ayaṃ cetanā, idaṃ viññāṇaṃ, ayaṃ vitakko, ayaṃ vicāro’ti, api ca kho pana sakena sakena lakkhaṇena upaṭṭhahantī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Phassādivinibbhujanapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Nāgasenapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Thero āha ‘‘loṇaṃ, mahārāja, cakkhuviññeyya’’nti. ‘‘Āma, bhante, cakkhuviññeyya’’nti. ‘‘Suṭṭhu kho, mahārāja, jānāhī’’ti. ‘‘Kiṃ pana, bhante, jivhāviññeyya’’nti? ‘‘Āma, mahārāja, jivhāviññeyya’’nti. ‘‘Kiṃ pana, bhante, sabbaṃ loṇaṃ jivhāya vijānātī’’ti? ‘‘Āma, mahārāja, sabbaṃ loṇaṃ jivhāya vijānāti’’. ‘‘Yadi, bhante, sabbaṃ loṇaṃ jivhāya vijānāti, kissa pana taṃ sakaṭehi balībaddā [balibaddā (sī. pī.)] āharanti, nanu loṇameva āharitabba’’nti? ‘‘Na sakkā, mahārāja, loṇameva āharituṃ ekatobhāvagatā ete dhammā gocaranānattagatā loṇaṃ garubhāvo cāti. Sakkā pana, mahārāja, loṇaṃ tulāya tulayitu’’nti? ‘‘Āma, bhante, sakkā’’ti. ‘‘Na sakkā, mahārāja, loṇaṃ tulāya tulayituṃ, garubhāvo tulāya tuliyatī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Nāgasenapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Pañcāyatanakammanibbattapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Rājā āha ‘‘bhante nāgasena, yānimāni pañcāyatanāni, kiṃ nu tāni nānākammehi nibbattāni, udāhu ekena kammenā’’ti? ‘‘Nānākammehi, mahārāja, nibbattāni, na ekena kammenā’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, ekasmiṃ khette nānābījāni vappeyyuṃ, tesaṃ nānābījānaṃ nānāphalāni nibbatteyyu’’nti? ‘‘Āma, bhante, nibbatteyyu’’nti. ‘‘Evameva kho, mahārāja, yāni yāni pañcāyatanāni, tāni tāni nānākammehi nibbattāni, na ekena kammenā’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Pañcāyatanakammanibbattapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Kammanānākaraṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Rājā āha ‘‘bhante nāgasena, kena kāraṇena manussā na sabbe samakā, aññe appāyukā, aññe dīghāyukā, aññe bahvābādhā aññe appābādhā, aññe dubbaṇṇā, aññe vaṇṇavanto, aññe appesakkhā, aññe mahesakkhā, aññe appabhogā, aññe mahābhogā, aññe nīcakulīnā, aññe mahākulīnā, aññe duppaññā, aññe paññavanto’’ti? Thero āha ‘‘kissa pana, mahārāja, rukkhā na sabbe samakā, aññe ambilā, aññe lavaṇā, aññe tittakā, aññe kaṭukā, aññe kasāvā, aññe madhurā’’ti? ‘‘Maññāmi, bhante, bījānaṃ nānākaraṇenā’’ti. ‘‘Evameva kho, mahārāja, kammānaṃ nānākaraṇena manussā na sabbe samakā, aññe appāyukā, aññe dīghāyukā, aññe bahvābādhā, aññe appābādhā, aññe dubbaṇṇā, aññe vaṇṇavanto, aññe appesakkhā, aññe mahesakkhā, aññe appabhogā, aññe mahābhogā, aññe nīcakulīnā, aññe mahākulīnā, aññe duppaññā, aññe paññavanto. Bhāsitampetaṃ mahārāja bhagavatā – ‘kammassakā, māṇava, sattā kammadāyādā kammayonī kammabandhū kammappaṭisaraṇā, kammaṃ satte vibhajati yadidaṃ hīnappaṇītatāyā’’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Kammanānākaraṇapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Vāyāmakaraṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Rājā āha ‘‘bhante nāgasena, tumhe bhaṇatha ‘kinti imaṃ dukkhaṃ nirujjheyya, aññañca dukkhaṃ nuppajjeyyā’ti. Etadatthā, mahārāja, amhākaṃ pabbajjā’’ti. ‘‘Kiṃ paṭikacceva vāyamitena, nanu sampatte kāle vāyamitabba’’nti? Thero āha ‘‘sampatte kāle, mahārāja, vāyāmo akiccakaro bhavati, paṭikacceva vāyāmo kiccakaro bhavatī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, yadā tvaṃ pipāsito bhaveyyāsi, tadā tvaṃ udapānaṃ khaṇāpeyyāsi, taḷākaṃ khaṇāpeyyāsi ‘pānīyaṃ pivissāmī’ti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, sampatte kāle vāyāmo akiccakaro bhavati, paṭikacceva vāyāmo kiccakaro bhavatī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, yadā tvaṃ bubhukkhito bhaveyyāsi, tadā tvaṃ khettaṃ kasāpeyyāsi, sāliṃ ropāpeyyāsi, dhaññaṃ atiharāpeyyāsi ‘bhattaṃ bhuñjissāmī’ti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, sampatte kāle vāyāmo akiccakaro bhavati, paṭikacceva vāyāmo kiccakaro bhavatīti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, yadā te saṅgāmo paccupaṭṭhito bhaveyya, tadā tvaṃ parikhaṃ khaṇāpeyyāsi, pākāraṃ kārāpeyyāsi, gopuraṃ kārāpeyyāsi, aṭṭālakaṃ kārāpeyyāsi, dhaññaṃ atiharāpeyyāsi, tadā tvaṃ hatthismiṃ sikkheyyāsi, assasmiṃ sikkheyyāsi, rathasmiṃ sikkheyyāsi, dhanusmiṃ sikkheyyāsi, tharusmiṃ sikkheyyāsī’’ti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, sampatte kāle vāyāmo akiccakaro bhavati, paṭikacceva vāyāmo kiccakaro bhavati. Bhāsitampetaṃ mahārāja bhagavatā – ‘‘‘Paṭikacceva taṃ kayirā, yaṃ jaññā hitamattano; Na sākaṭikacintāya, mantā dhīro parakkame. ‘‘‘Yathā sākaṭiko maṭṭhaṃ [nāma (sī. pī. ka.) saṃ. ni. 1.103], samaṃ hitvā mahāpathaṃ; Visamaṃ maggamāruyha, akkhacchinnova jhāyati. ‘‘‘Evaṃ dhammā apakkamma, adhammamanuvattiya; Mando maccu mukhaṃ patto, akkhacchinnova jhāyatī’’’ti [socatīti (sabbattha)]. ‘‘Kallosi, bhante nāgasenā’’ti. Vāyāmakaraṇapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Nerayikaggiuṇhabhāvapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Rājā āha ‘‘bhante nāgasena, tumhe bhaṇatha ‘pākatikaaggito nerayiko aggi mahābhitāpataro hoti, khuddakopi pāsāṇo pākatike aggimhi pakkhitto divasampi paccamāno [dhamamāno (sī. pī.)] na vilayaṃ gacchati, kūṭāgāramattopi pāsāṇo nerayikaggimhi pakkhitto khaṇena vilayaṃ gacchatī’ti, etaṃ vacanaṃ na saddahāmi, evañca pana vadetha ‘ye ca tattha uppannā sattā, te anekānipi vassasahassāni niraye paccamānā na vilayaṃ gacchantī’ti, tampi vacanaṃ na saddahāmī’’ti. Thero āha ‘‘taṃ kiṃ maññasi, mahārāja, yā tā santi makariniyopi susumāriniyopi kacchapiniyopi moriniyopi kapotiniyopi, kiṃnu tā kakkhaḷāni pāsāṇāni sakkharāyo ca khādantī’’ti? ‘‘Āma, bhante, khādantī’’ti. ‘‘Kiṃ pana tāni tāsaṃ kucchiyaṃ koṭṭhabbhantaragatāni vilayaṃ gacchantī’’ti? ‘‘Āma, bhante, vilayaṃ gacchantī’’ti. ‘‘Yo pana tāsaṃ kucchiyaṃ gabbho, sopi vilayaṃ gacchatī’’ti? ‘‘Na hi bhante’’ti. ‘‘Kena kāraṇenā’’ti? ‘‘Maññāmi, bhante, kammādhikatena na vilayaṃ gacchatī’’ti. ‘‘Evameva kho, mahārāja, kammādhikatena nerayikā sattā anekānipi vassasahassāni niraye paccamānā na vilayaṃ gacchanti. Bhāsitampetaṃ, mahārāja, bhagavatā – ‘so na tāva kālaṃ karoti, yāva na taṃ pāpakammaṃ byantīhotī’’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, yā tā santi sīhiniyopi byagghiniyopi dīpiniyopi kukkuriniyopi, kiṃnu tā kakkhaḷāni aṭṭhikāni maṃsāni khādantīti? ‘‘Āma, bhante, khādantī’’ti. ‘‘Kiṃ pana tāni tāsaṃ kucchiyaṃ koṭṭhabbhantaragatāni vilayaṃ gacchantī’’ti? ‘‘Āma, bhante, vilayaṃ gacchantī’’ti. ‘‘Yo pana tāsaṃ kucchiyaṃ gabbho, sopi vilayaṃ gacchatī’’ti? ‘‘Na hi bhante’’ti. ‘‘Kena kāraṇenā’’ti? ‘‘Maññāmi, bhante, kammādhikatena na vilayaṃ gacchatī’’ti. ‘‘Evameva kho, mahārāja, kammādhikatena nerayikā sattā anekānipi vassasahassāni niraye paccamānā na vilayaṃ gacchantī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, yā tā santi yonakasukhumāliniyopi khattiyasukhumāliniyopi brāhmaṇasukhumāliniyopi gahapatisukhumāliniyopi, kiṃnu tā kakkhaḷāni khajjakāni maṃsāni khādantī’’ti? ‘‘Āma, bhante, khādantī’’ti. ‘‘Kiṃ pana tāni tāsaṃ kucchiyaṃ koṭṭhabbhantaragatāni vilayaṃ gacchantī’’ti? ‘‘Āma, bhante, vilayaṃ gacchantī’’ti. ‘‘Yo pana tāsaṃ kucchiyaṃ gabbho sopi vilayaṃ gacchatī’’ti? ‘‘Na hi bhante’’ti. ‘‘Kena kāraṇenā’’ti. ‘‘Maññāmi, bhante, kammādhikatena na vilayaṃ gacchatī’’ti. ‘‘Evameva kho, mahārāja, kammādhikatena nerayikā sattā anekānipi vassasahassāni niraye paccamānā na vilayaṃ gacchanti. Bhāsitampetaṃ, mahārāja, bhagavatā – ‘‘so na tāva kālaṃ karoti, yāva na taṃ pāpakammaṃ byantīhotī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Nerayikaggiuṇhabhāvapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Pathavisandhārakapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Rājā āha ‘‘bhante nāgasena, tumhe bhaṇatha ‘ayaṃ mahā pathavī udake patiṭṭhitā, udakaṃ vāte patiṭṭhitaṃ, vāto ākāse patiṭṭhito’ti, etampi vacanaṃ na saddahāmī’’ti. Thero dhammakarakena [dhammakaraṇena (ka.)] udakaṃ gahetvā rājānaṃ milindaṃ saññāpesi ‘‘yathā, mahārāja, imaṃ udakaṃ vātena ādhāritaṃ, evaṃ tampi udakaṃ vātena ādhārita’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Pathavisandhārakapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Nirodhanibbānapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Rājā āha ‘‘bhante nāgasena, nirodho nibbāna’’nti? ‘‘Āma, mahārāja, nirodho nibbāna’’nti. ‘‘Kathaṃ, bhante, nāgasena, nirodho nibbāna’’nti? ‘‘Sabbe bālaputhujjanā kho, mahārāja, ajjhattikabāhire āyatane abhinandanti abhivadanti ajjhosāya tiṭṭhanti, te tena sotena vuyhanti, na parimuccanti jātiyā jarāya maraṇena sokena paridevena dukkhehi domanassehi upāyāsehi na parimuccanti dukkhasmāti vadāmi. Sutavā ca kho, mahārāja, ariyasāvako ajjhattikabāhire āyatane nābhinandati nābhivadati nājjhosāya tiṭṭhati, tassa taṃ anabhinandato anabhivadato anajjhosāya tiṭṭhato taṇhā nirujjhati, taṇhānirodhā upādānanirodho, upādānanirodhā bhavanirodho, bhavanirodhā jātinirodho, jātinirodhā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā nirujjhanti, evametassa kevalassa dukkhakkhandhassa nirodho hoti, evaṃ kho, mahārāja, nirodho nibbāna’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Nirodhanibbānapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Nibbānalabhanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Rājā āha ‘‘bhante nāgasena, sabbeva labhanti nibbāna’’nti? ‘‘Na kho, mahārāja, sabbeva labhanti nibbānaṃ, api ca kho, mahārāja, yo sammā paṭipanno abhiññeyye dhamme abhijānāti, pariññeyye dhamme parijānāti, pahātabbe dhamme pajahati, bhāvetabbe dhamme bhāveti, sacchikātabbe dhamme sacchikaroti, so labhati nibbāna’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Nibbānalabhanapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Nibbānasukhajānanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Rājā āha ‘‘bhante nāgasena, yo na labhati nibbānaṃ, jānāti so ‘sukhaṃ nibbāna’’’nti? ‘‘Āma, mahārāja, yo na labhati nibbānaṃ, jānāti so ‘sukhaṃ nibbāna’’’nti. ‘‘Kathaṃ, bhante nāgasena, alabhanto jānāti ‘sukhaṃ nibbāna’’’nti? ‘‘Taṃ kiṃ maññasi, mahārāja, yesaṃ nacchinnā hatthapādā, jāneyyuṃ te, mahārāja, ‘dukkhaṃ hatthapādacchedana’’’nti? ‘‘Āma, bhante, jāneyyu’’nti. ‘‘Kathaṃ jāneyyu’’nti? ‘‘Aññesaṃ, bhante, chinnahatthapādānaṃ paridevitasaddaṃ sutvā jānanti ‘dukkhaṃ hatthapādacchedana’’’nti. ‘‘Evameva kho, mahārāja, yesaṃ diṭṭhaṃ nibbānaṃ, tesaṃ saddaṃ sutvā jānāti ‘sukhaṃ nibbāna’’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Nibbānasukhajānanapañho dasamo. Nibbānavaggo catuttho. Imasmiṃ vagge dasa pañhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}