{
  "id": "mil.6",
  "title": {
    "pali": "Sativaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Kāyapiyāyanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "Rājā āha ‘‘bhante nāgasena, piyo pabbajitānaṃ kāyo’’ti? ‘‘Na kho, mahārāja, piyo pabbajitānaṃ kāyo’’ti. ‘‘Atha kissa nu kho, bhante, kelāyatha mamāyathā’’ti? ‘‘Kiṃ pana te, mahārāja, kadāci karahaci saṅgāmagatassa kaṇḍappahāro hotī’’ti? ‘‘Āma, bhante, hotī’’ti. ‘‘Kiṃnu kho, mahārāja, so vaṇo ālepena ca ālimpīyati telena ca makkhīyati sukhumena ca coḷapaṭṭena paliveṭhīyatī’’ti? ‘‘Āma, bhante, ālepena ca ālimpīyati telena ca makkhīyati sukhumena ca coḷapaṭṭena paliveṭhīyatī’’ti. ‘‘Kiṃnu kho, mahārāja, piyo te vaṇo, tena ālepena ca ālimpīyati telena ca makkhīyati sukhumena ca coḷapaṭṭena paliveṭhīyatī’’ti? ‘‘Na me, bhante, piyo vaṇo, api ca maṃsassa ruhanatthāya ālepena ca ālimpīyati telena ca makkhīyati sukhumena ca coḷapaṭṭena paliveṭhīyatī’’ti. ‘‘Evameva kho, mahārāja, appiyo pabbajitānaṃ kāyo, atha ca pabbajitā anajjhositā kāyaṃ pariharanti brahmacariyānuggahāya. Api ca kho, mahārāja, vaṇūpamo kāyo vutto bhagavatā, tena pabbajitā vaṇamiva kāyaṃ pariharanti anajjhositā. Bhāsitampetaṃ mahārāja bhagavatā – ‘‘‘Allacammapaṭicchanno, navadvāro mahāvaṇo; Samantato paggharati, asucipūtigandhiyo’’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Kāyapiyāyanapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Sabbaññūbhāvapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Rājā āha ‘‘bhante nāgasena, buddho sabbaññū sabbadassāvī’’ti? ‘‘Āma, mahārāja, bhagavā sabbaññū sabbadassāvī’’ti. ‘‘Atha kissa nu kho, bhante nāgasena, sāvakānaṃ anupubbena sikkhāpadaṃ paññapesī’’ti? ‘‘Atthi pana te mahārāja, koci vejjo, yo imissaṃ pathaviyaṃ sabbabhesajjāni jānātī’’ti? ‘‘Āma, bhante, atthī’’ti. ‘‘Kiṃnu kho, mahārāja, so vejjo gilānakaṃ sampatte kāle bhesajjaṃ pāyeti, udāhu asampatte kāle’’ti? ‘‘Sampatte kāle, bhante, gilānakaṃ bhesajjaṃ pāyeti, no asampatte kāle’’ti? ‘‘Evameva kho, mahārāja, bhagavā sabbaññū sabbadassāvī na asampatte kāle sāvakānaṃ sikkhāpadaṃ paññāpeti, sampatte kāle sāvakānaṃ sikkhāpadaṃ paññāpeti yāvajīvaṃ anatikkamanīya’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Sabbaññūbhāvapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Mahāpurisalakkhaṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Rājā āha ‘‘bhante nāgasena, buddho dvattiṃsamahāpurisalakkhaṇehi samannāgato asītiyā ca anubyañjanehi parirañjito suvaṇṇavaṇṇo kañcanasannibhattaco byāmappabho’’ti? ‘‘Āma, mahārāja, bhagavā dvattiṃsamahāpurisalakkhaṇehi samannāgato asītiyā ca anubyañjanehi parirañjito suvaṇṇavaṇṇo kañcanasannibhattaco byāmappabho’’ti. ‘‘Kiṃ panassa, bhante, mātāpitaropi dvattiṃsamahāpurisalakkhaṇehi samannāgatā asītiyā ca anubyañjanehi parirañjitā suvaṇṇavaṇṇā kañcanasannibhattacā byāmappabhā’’ti? ‘‘No cassa, mahārāja, mātāpitaro dvattiṃsamahāpurisalakkhaṇehi samannāgatā asītiyā ca anubyañjanehi parirañjitā suvaṇṇavaṇṇā kañcanasannibhattacā byāmappabhā’’ti. ‘‘Evaṃ sante kho, bhante nāgasena, na uppajjati buddho dvattiṃsamahāpurisalakkhaṇehi samannāgato asītiyā ca anubyañjanehi parirañjito suvaṇṇavaṇṇo kañcanasannibhattaco byāmappabhoti, api ca mātusadiso vā putto hoti mātupakkho vā, pitusadiso vā putto hoti pitupakkho vā’’ti. Thero āha ‘‘atthi pana, mahārāja, kiñci padumaṃ satapatta’’nti? ‘‘Āma, bhante, atthī’’ti. ‘‘Tassa pana kuhiṃ sambhavo’’ti? ‘‘Kaddame jāyati udake āsīyatī’’ti. ‘‘Kiṃnu kho, mahārāja, padumaṃ kaddamena sadisaṃ vaṇṇena vā gandhena vā rasena vā’’ti? ‘‘Na hi, bhante’’ti. ‘‘Atha udakena vā gandhena vā rasena vā’’ti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, bhagavā dvattiṃsamahāpurisalakkhaṇehi samannāgato asītiyā ca anubyañjanehi parirañjito suvaṇṇavaṇṇo kañcanasannibhattaco byāmappabho, no cassa mātāpitaro dvattiṃsamahāpurisalakkhaṇehi samannāgatā asītiyā ca anubyañjanehi parirañjitā suvaṇṇavaṇṇā kañcanasannibhattacā byāmappabhā’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Mahāpurisalakkhaṇapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Bhagavato brahmacāripañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Rājā āha ‘‘bhante nāgasena, buddho brahmacārī’’ti? ‘‘Āma, mahārāja, bhagavā brahmacārī’’ti. ‘‘Tena hi, bhante nāgasena, buddho brahmuno sisso’’ti? ‘‘Atthi pana te, mahārāja, hatthipāmokkho’’ti? ‘‘Atthi, bhante’’ti. ‘‘Kiṃnu kho, mahārāja, so hatthī kadāci karahaci koñcanādaṃ nadatīti? ‘‘Āma, bhante, nadatī’’ti ‘‘tena hi, mahārāja, so hatthī koñcasakuṇassa sisso’’ti? ‘‘Na hi, bhante’’ti. ‘‘Kiṃ pana, mahārāja, brahmā sabuddhiko abuddhiko’’ti? ‘‘Sabuddhiko, bhante’’ti. ‘‘Tena hi, mahārāja, brahmā bhagavato sisso’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Bhagavato brahmacāripañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Bhagavato upasampadāpañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Rājā āha ‘‘bhante nāgasena, upasampadā sundarā’’ti? ‘‘Āma, mahārāja, upasampadā sundarā’’ti. ‘‘Atthi pana, bhante, buddhassa upasampadā, udāhu natthī’’ti? ‘‘Upasampanno kho, mahārāja, bhagavā bodhirukkhamūle saha sabbaññutañāṇena, natthi bhagavato upasampadā aññehi dinnā, yathā sāvakānaṃ, mahārāja, bhagavā sikkhāpadaṃ paññapeti yāvajīvaṃ anatikkamanīya’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Bhagavato upasampadāpañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Assubhesajjābhesajjapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Rājā āha ‘‘bhante nāgasena, yo ca mātari matāya rodati, yo ca dhammapemena rodati, ubhinnaṃ tesaṃ rodantānaṃ kassa assu bhesajjaṃ, kassa na bhesajja’’nti? ‘‘Ekassa kho, mahārāja, assu rāgadosamohehi samalaṃ uṇhaṃ, ekassa pītisomanassena vimalaṃ sītalaṃ. Yaṃ kho, mahārāja, sītalaṃ, taṃ bhesajjaṃ, yaṃ uṇhaṃ, taṃ na bhesajja’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Assubhesajjābhesajjapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Sarāgavītarāganānākaraṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Rājā āha ‘‘bhante nāgasena, kiṃ nānākaraṇaṃ sarāgassa ca vītarāgassa cā’’ti? ‘‘Eko kho, mahārāja, ajjhosito, eko anajjhosito’’ti. ‘‘Kiṃ etaṃ, bhante, ajjhosito anajjhosito nāmā’’ti? ‘‘Eko kho, mahārāja, atthiko, eko anatthiko’’ti. ‘‘Passāmahaṃ, bhante, evarūpaṃ yo ca sarāgo, yo ca vītarāgo, sabbopeso sobhanaṃ yeva icchati khādanīyaṃ vā bhojanīyaṃ vā, na koci pāpakaṃ icchatī’’ti. ‘‘Avītarāgo kho, mahārāja, rasapaṭisaṃvedī ca rasarāgapaṭisaṃvedī ca bhojanaṃ bhuñjati, vītarāgo pana rasapaṭisaṃvedī bhojanaṃ bhuñjati, no ca kho rasarāgapaṭisaṃvedī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Sarāgavītarāganānākaraṇapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Paññāpatiṭṭhānapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Rājā āha ‘‘bhante nāgasena, paññā kuhiṃ paṭivasatī’’ti? ‘‘Na katthaci mahārājā’’ti. ‘‘Tena hi, bhante nāgasena, natthi paññā’’ti. ‘‘Vāto, mahārāja, kuhiṃ paṭivasatī’’ti? ‘‘Na katthaci bhante’’ti. ‘‘Tena hi, mahārāja, natthi vāto’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Paññāpatiṭṭhānapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Saṃsārapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Rājā āha ‘‘bhante nāgasena, yaṃ panetaṃ brūsi ‘saṃsāro’ti, katamo so saṃsāro’’ti? ‘‘Idha, mahārāja, jāto idheva marati, idha mato aññatra uppajjati, tahiṃ jāto tahiṃ yeva marati, tahiṃ mato aññatra uppajjati, evaṃ kho, mahārāja, saṃsāro hotī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso pakkaṃ ambaṃ khāditvā aṭṭhiṃ ropeyya, tato mahanto ambarukkho nibbattitvā phalāni dadeyya, atha so puriso tatopi pakkaṃ ambaṃ khāditvā aṭṭhiṃ ropeyya, tatopi mahanto ambarukkho nibbattitvā phalāni dadeyya, evametesaṃ rukkhānaṃ koṭi na paññāyati, evameva kho, mahārāja, idha jāto idheva marati, idha mato aññatra uppajjati, tahiṃ jāto tahiṃ yeva marati, tahiṃ mato aññatra uppajjati, evaṃ kho, mahārāja, saṃsāro hotī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Saṃsārapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Cirakatasaraṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Rājā āha ‘‘bhante nāgasena, kena atītaṃ cirakataṃ saratī’’ti? ‘‘Satiyā, mahārājā’’ti. ‘‘Nanu, bhante nāgasena, cittena sarati no satiyā’’ti? ‘‘Abhijānāsi nu, tvaṃ mahārāja, kiñcideva karaṇīyaṃ katvā pamuṭṭha’’nti? ‘‘Āma bhante’’ti. ‘‘Kiṃ nu kho, tvaṃ mahārāja, tasmiṃ samaye acittako ahosī’’ti? ‘‘Na hi, bhante, sati tasmiṃ samaye nāhosī’’ti. ‘‘Atha kasmā, tvaṃ mahārāja, evamāha ‘cittena sarati, no satiyā’’’ti? ‘‘Kallosi, bhante nāgasenā’’ti. Cirakatasaraṇapañho dasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "Abhijānantasatipañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "Rājā āha ‘‘bhante nāgasena, sabbā sati abhijānantī uppajjati, udāhu kaṭumikāva satī’’ti? ‘‘Abhijānantīpi, mahārāja, kaṭumikāpi satī’’ti. ‘‘Evañhi kho, bhante nāgasena, sabbā sati abhijānantī, natthi kaṭumikā satī’’ti? ‘‘Yadi natthi, mahārāja, kaṭumikā sati, natthi kiñci sippikānaṃ kammāyatanehi vā sippāyatanehi vā vijjāṭṭhānehi vā karaṇīyaṃ, niratthakā ācariyā, yasmā ca kho, mahārāja, atthi kaṭumikā sati, tasmā atthi kammāyatanehi vā sippāyatanehi vā vijjāṭṭhānehi vā karaṇīyaṃ, attho ca ācariyehī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Abhijānantasatipañho ekādasamo. Sativaggo chaṭṭho. Imasmiṃ vagge ekādasa pañhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}