{
  "id": "mil.1",
  "title": {
    "pali": "Mahāvaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Paññattipañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "Atha kho milindo rājā yenāyasmā nāgaseno tenupasaṅkami, upasaṅkamitvā āyasmatā nāgasenena saddhiṃ sammodi, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Āyasmāpi kho nāgaseno paṭisammodanīyeneva [paṭisammodi, teneva (sī.)] milindassa rañño cittaṃ ārādhesi. Atha kho milindo rājā āyasmantaṃ nāgasenaṃ etadavoca ‘‘kathaṃ bhadanto ñāyati, kinnāmosi bhante’’ti? ‘‘Nāgaseno’’ti kho ahaṃ, mahārāja, ñāyāmi, ‘‘nāgaseno’’ti kho maṃ, mahārāja, sabrahmacārī samudācaranti, api ca mātāpitaro nāmaṃ karonti ‘‘nāgaseno’’ti vā ‘‘sūraseno’’ti vā ‘‘vīraseno’’ti vā ‘‘sīhaseno’’ti vā, api ca kho, mahārāja, saṅkhā samaññā paññatti vohāro nāmamattaṃ yadidaṃ nāgasenoti, na hettha puggalo upalabbhatīti. Atha kho milindo rājā evamāha ‘‘suṇantu me bhonto pañcasatā yonakā asītisahassā ca bhikkhū, ayaṃ nāgaseno evamāha ‘na hettha puggalo upalabbhatī’ti, kallaṃ nu kho tadabhinanditu’’nti. Atha kho milindo rājā āyasmantaṃ nāgasenaṃ etadavoca ‘‘sace, bhante nāgasena, puggalo nūpalabbhati, ko carahi tumhākaṃ cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ deti, ko taṃ paribhuñjati, ko sīlaṃ rakkhati, ko bhāvanamanuyuñjati, ko maggaphalanibbānāni sacchikaroti, ko pāṇaṃ hanati, ko adinnaṃ ādiyati, ko kāmesumicchācāraṃ carati, ko musā bhaṇati, ko majjaṃ pivati, ko pañcānantariyakammaṃ karoti, tasmā natthi kusalaṃ, natthi akusalaṃ, natthi kusalākusalānaṃ kammānaṃ kattā vā kāretā vā, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, sace, bhante nāgasena, yo tumhe māreti, natthi tassāpi pāṇātipāto, tumhākampi, bhante nāgasena, natthi ācariyo, natthi upajjhāyo, natthi upasampadā. ‘Nāgasenoti maṃ, mahārāja, sabrahmacārī samudācarantī’ti yaṃ vadesi, ‘katamo ettha nāgaseno? Kinnu kho, bhante, kesā nāgaseno’’ti? ‘‘Na hi mahārājā’’ti. ‘‘Lomā nāgaseno’’ti? ‘‘Na hi mahārājā’’ti. ‘‘Nakhā…pe… dantā…pe… taco…pe… maṃsaṃ…pe… nhāru…pe… aṭṭhi…pe… aṭṭhimiñjaṃ…pe… vakkaṃ…pe… hadayaṃ…pe… yakanaṃ…pe… kilomakaṃ…pe… pihakaṃ…pe… papphāsaṃ…pe… antaṃ…pe… antaguṇaṃ…pe… udariyaṃ…pe… karīsaṃ…pe… pittaṃ…pe… semhaṃ…pe… pubbo…pe… lohitaṃ…pe… sedo…pe… medo…pe… assu…pe… vasā…pe… kheḷo…pe… siṅghāṇikā…pe… lasikā…pe… muttaṃ…pe… matthake matthaluṅgaṃ nāgaseno’’ti? ‘‘Na himahārājā’’ti. ‘‘Kiṃ nu kho, bhante, rūpaṃ nāgaseno’’ti? ‘‘Nahi mahārājā’’ti. ‘‘Vedanā nāgaseno’’ti?‘‘Na hi mahārājā’’ti. ‘‘Saññā nāgaseno’’ti? ‘‘Na hi mahārājā’’ti. ‘‘Saṅkhārā nāgaseno’’ti? ‘‘Na hi mahārājā’’ti. ‘‘Viññāṇaṃ nāgaseno’’ti? ‘‘Na hi mahārājā’’ti. ‘‘Kiṃ pana, bhante, rūpavedanāsaññāsaṅkhāraviññāṇaṃ nāgaseno’’ti? ‘‘Na hi mahārājā’’ti. ‘‘Kiṃ pana, bhante, aññatra rūpavedanāsaññāsaṅkhāraviññāṇaṃ nāgaseno’’ti? ‘‘Na hi mahārājā’’ti. ‘‘Tamahaṃ bhante, pucchanto pucchanto na passāmi nāgasenaṃ. Nāgasenasaddo yeva nu kho, bhante, nāgaseno’’ti? ‘‘Na hi mahārājā’’ti. ‘‘Ko panettha nāgaseno, alikaṃ tvaṃ, bhante, bhāsasi musāvādaṃ, natthi nāgaseno’’ti. Atha kho āyasmā nāgaseno milindaṃ rājānaṃ etadavoca ‘‘tvaṃ khosi, mahārāja, khattiyasukhumālo accantasukhumālo, tassa te, mahārāja, majjhanhikasamayaṃ tattāya bhūmiyā uṇhāya vālikāya kharāya sakkharakathalikāya [kharā sakkharakaṭhalavālikā (sī. pī.)] madditvā pādenāgacchantassa pādā rujjanti, kāyo kilamati, cittaṃ upahaññati, dukkhasahagataṃ kāyaviññāṇaṃ uppajjati, kiṃ nu kho tvaṃ pādenāgatosi, udāhu vāhanenā’’ti? ‘‘Nāhaṃ, bhante, pādenāgacchāmi, rathenāhaṃ āgatosmī’’ti. ‘‘Sace, tvaṃ mahārāja, rathenāgatosi, rathaṃ me ārocehi, kiṃ nu kho, mahārāja, īsā ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Akkho ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Cakkāni ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Rathapañjaraṃ ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Rathadaṇḍako ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Yugaṃ ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Rasmiyo ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Patodalaṭṭhi ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Kiṃ nu kho, mahārāja, īsāakkhacakkarathapañjararathadaṇḍayugarasmipatodā ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Kiṃ pana, mahārāja, aññatra īsāakkhacakkarathapañjararathadaṇḍayugarasmipatodā ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Tamahaṃ, mahārāja, pucchanto pucchanto na passāmi rathaṃ. Rathasaddoyeva nu kho, mahārāja, ratho’’ti? ‘‘Na hi bhante’’ti. ‘‘Ko panettha ratho, alikaṃ, tvaṃ mahārāja, bhāsasi musāvādaṃ, natthi ratho, tvaṃsi, mahārāja, sakalajambudīpe aggarājā, kassa pana tvaṃ bhāyitvā musāvādaṃ bhāsasi, suṇantu me bhonto pañcasatā yonakā asītisahassā ca bhikkhū, ayaṃ milindo rājā evamāha ‘rathenāhaṃ āgatosmī’ti, sace tvaṃ, mahārāja, rathenāgato‘si, rathaṃ me ārocehī’ti vutto samāno rathaṃ na sampādeti, kallaṃ nu kho tadabhinanditu’’nti. Evaṃ vutte pañcasatā yonakā āyasmato nāgasenassa sādhukāraṃ datvā milindaṃ rājānaṃ etadavocuṃ ‘‘idāni kho tvaṃ, mahārāja, sakkonto bhāsassū’’ti. Atha kho milindo rājā āyasmantaṃ nāgasenaṃ etadavoca ‘‘nāhaṃ, bhante nāgasena, musā bhaṇāmi, īsañca paṭicca akkhañca paṭicca cakkāni ca paṭicca rathapañjarañca paṭicca rathadaṇḍakañca paṭicca ‘ratho’ti saṅkhā samaññā paññatti vohāro nāmamattaṃ pavattatī’’ti. ‘‘Sādhu kho, tvaṃ mahārāja, rathaṃ jānāsi, evameva kho, mahārāja, mayhampi kese ca paṭicca lome ca paṭicca…pe… matthake matthaluṅgañca paṭicca rūpañca paṭicca vedanañca paṭicca saññañca paṭicca saṅkhāre ca paṭicca viññāṇañca paṭicca ‘nāgaseno’ti saṅkhā samaññā paññatti vohāro nāmamattaṃ pavattati, paramatthato panettha puggalo nūpalabbhati. Bhāsitampetaṃ, mahārāja, vajirāya bhikkhuniyā bhagavato sammukhā – ‘‘‘Yathā hi aṅgasambhārā, hoti saddo ratho iti; Evaṃ khandhesu santesu, hoti ‘‘satto’’ti sammutī’’’ti [passa saṃ. ni. 1.171]. ‘‘Acchariyaṃ, bhante nāgasena, abbhutaṃ, bhante nāgasena, aticitrāni pañhapaṭibhānāni visajjitāni, yadi buddho tiṭṭheyya sādhukāraṃ dadeyya, sādhu sādhu nāgasena, aticitrāni pañhapaṭibhānāni visajjitānī’’ti. Paññattipañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Vassagaṇanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Kativassosi tvaṃ, bhante nāgasenā’’ti? ‘‘Sattavassohaṃ, mahārājā’’ti. ‘‘Ke te, bhante, satta, tvaṃ vā satta, gaṇanā vā sattā’’ti? Tena kho pana samayena milindassa rañño sabbābharaṇapaṭimaṇḍitassa alaṅkatapaṭiyattassa pathaviyaṃ chāyā dissati, udakamaṇike ca chāyā dissati. Atha kho āyasmā nāgaseno milindaṃ rājānaṃ etadavoca ‘‘ayaṃ te, mahārāja, chāyā pathaviyaṃ udakamaṇike ca dissati, kiṃ pana, mahārāja, tvaṃ vā rājā, chāyā vā rājā’’ti? ‘‘Ahaṃ, bhante nāgasena, rājā, nāyaṃ chāyā rājā, maṃ pana nissāya chāyā pavattatī’’ti. ‘‘Evameva kho, mahārāja, vassānaṃ gaṇanā satta, na panāhaṃ satta, maṃ pana nissāya satta pavattati, chāyūpamaṃ mahārājā’’ti. ‘‘Acchariyaṃ, bhante nāgasena, abbhutaṃ, bhante nāgasena, aticitrāni pañhapaṭibhānāni visajjitānī’’ti. Vassagaṇanapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Vīmaṃsanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Rājā āha ‘‘bhante nāgasena, sallapissasi mayā saddhi’’nti? ‘‘Sace, tvaṃ mahārāja, paṇḍitavādaṃ [paṇḍitavādā (sī. pī.)] sallapissasi sallapissāmi, sace pana rājavādaṃ sallapissasi na sallapissāmī’’ti. ‘‘Kathaṃ, bhante nāgasena, paṇḍitā sallapantī’’ti? ‘‘Paṇḍitānaṃ kho, mahārāja, sallāpe āveṭhanampi kayirati, nibbeṭhanampi kayirati, niggahopi kayirati, paṭikammampi kayirati, vissāsopi [visesopi (sī. pī.)] kayirati, paṭivissāsopi kayirati, na ca tena paṇḍitā kuppanti, evaṃ kho, mahārāja, paṇḍitā sallapantī’’ti. ‘‘Kathaṃ pana, bhante, rājāno sallapantī’’ti? ‘‘Rājāno kho, mahārāja, sallāpe ekaṃ vatthuṃ paṭijānanti, yo taṃ vatthuṃ vilometi, tassa daṇḍaṃ āṇāpenti ‘imassa daṇḍaṃ paṇethā’ti, evaṃ kho, mahārāja, rājāno sallapantī’’ti. ‘‘Paṇḍitavādāhaṃ, bhante, sallapissāmi, no rājavādaṃ, vissaṭṭho bhadanto sallapatu yathā bhikkhunā vā sāmaṇerena vā upāsakena vā ārāmikena vā saddhiṃ sallapati, evaṃ vissaṭṭho bhadanto sallapatu mā bhāyatū’’ti. ‘‘Suṭṭhu mahārājā’’ti thero abbhānumodi. Rājā āha ‘‘bhante nāgasena, pucchissāmī’’ti. ‘‘Puccha mahārājā’’ti. ‘‘Pucchitosi me bhante’’ti. ‘‘Visajjitaṃ mahārājā’’ti. ‘‘Kiṃ pana, bhante, tayā visajjita’’nti? ‘‘Kiṃ pana, mahārāja, tayā pucchita’’nti. Vīmaṃsanapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Anantakāyapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Atha kho milindassa rañño etadahosi ‘‘paṇḍito kho ayaṃ bhikkhu paṭibalo mayā saddhiṃ sallapituṃ, bahukāni ca me ṭhānāni pucchitabbāni bhavissanti, yāva apucchitāni yeva tāni ṭhānāni bhavissanti, atha sūriyo atthaṃ gamissati, yaṃnūnāhaṃ sve antepure sallapeyya’’nti. Atha kho rājā devamantiyaṃ etadavoca ‘‘tena hi, tvaṃ devamantiya, bhadantassa āroceyyāsi ‘sve antepure raññā saddhiṃ sallāpo bhavissatī’’’ti. Idaṃ vatvā milindo rājā uṭṭhāyāsanā theraṃ nāgasenaṃ āpucchitvā rathaṃ abhirūhitvā ‘‘nāgaseno nāgaseno’’ti sajjhāyaṃ karonto pakkāmi. Atha kho devamantiyo āyasmantaṃ nāgasenaṃ etadavoca ‘‘rājā, bhante, milindo evamāha ‘sve antepure raññā saddhiṃ sallāpo bhavissatī’’’ti. ‘‘Suṭṭhū’’ti thero abbhānumodi. Atha kho tassā rattiyā accayena devamantiyo ca anantakāyo ca maṅkuro ca sabbadinno ca yena milindo rājā tenupasaṅkamiṃsu, upasaṅkamitvā rājānaṃ milindaṃ etadavocuṃ ‘‘āgacchatu, mahārāja, bhadanto nāgaseno’’ti? ‘‘Āma āgacchatū’’ti. ‘‘Kittakehi bhikkhūhi saddhiṃ āgacchatū’’ti? ‘‘Yattake bhikkhū icchati, tattakehi bhikkhūhi saddhiṃ āgacchatū’’ti. Atha kho sabbadinno āha ‘‘āgacchatu, mahārāja, dasahi bhikkhūhi saddhi’’nti, dutiyampi kho rājā āha ‘‘yattake bhikkhū icchati, tattakehi bhikkhūhi saddhiṃ āgacchatū’’ti. Dutiyampi kho sabbadinno āha ‘‘āgacchatu, mahārāja, dasahi bhikkhūhi saddhi’’nti. Tatiyampi kho rājā āha ‘‘yattake bhikkhū icchati, tattakehi bhikkhūhi saddhiṃ āgacchatū’’ti. Tatiyampi kho sabbadinno āha ‘‘āgacchatu, mahārāja, dasahi bhikkhūhi saddhi’’nti. ‘‘Sabbo panāyaṃ sakkāro paṭiyādito, ahaṃ bhaṇāmi ‘yattake bhikkhū icchati, tattakehi bhikkhūhi saddhiṃ āgacchatū’ti. Ayaṃ, bhaṇe sabbadinno, aññathā bhaṇati, kiṃ nu mayaṃ nappaṭibalā bhikkhūnaṃ bhojanaṃ dātu’’nti? Evaṃ vutte sabbadinno maṅku ahosi. Atha kho devamantiyo ca anantakāyo ca maṅkuro ca yenāyasmā nāgaseno tenupasaṅkamiṃsu, upasaṅkamitvā āyasmantaṃ nāgasenaṃ etadavocuṃ ‘‘rājā, bhante, milindo evamāha ‘yattake bhikkhū icchati, tattakehi bhikkhūhi saddhiṃ āgacchatū’’’ti. Atha kho āyasmā nāgaseno pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya asītiyā bhikkhusahassehi saddhiṃ sāgalaṃ pāvisi. Atha kho anantakāyo āyasmantaṃ nāgasenaṃ nissāya gacchanto āyasmantaṃ nāgasenaṃ etadavoca ‘‘bhante nāgasena, yaṃ panetaṃ brūsi ‘nāgaseno’ti, katamo ettha, nāgaseno’’ti? Thero āha ‘‘ko panettha ‘nāgaseno’ti maññasī’’ti? ‘‘Yo so, bhante, abbhantare vāto jīvo pavisati ca nikkhamati ca, so ‘nāgaseno’ti maññāmī’’ti. ‘‘Yadi paneso vāto nikkhamitvā nappaviseyya, pavisitvā na nikkhameyya, jīveyya nu kho so puriso’’ti? ‘‘Na hi bhante’’ti. ‘‘Ye panime saṅkhadhamakā saṅkhaṃ dhamenti, tesaṃ vāto puna pavisatī’’ti? ‘‘Na hi bhante’’ti. ‘‘Ye panime vaṃsadhamakā vaṃsaṃ dhamenti, tesaṃ vāto puna pavisatī’’ti? ‘‘Na hi bhante’’ti. ‘‘Ye panime siṅgadhamakā siṅgaṃ dhamenti, tesaṃ vāto puna pavisatī’’ti? ‘‘Na hi bhante’’ti. ‘‘Atha kissa pana tena na marantī’’ti. ‘‘Nāhaṃ paṭibalo tayā vādinā saddhiṃ sallapituṃ, sādhu, bhante, atthaṃ jappehī’’ti. ‘‘Neso jīvo, assāsapassāsā nāmete kāyasaṅkhārā’’ti thero abhidhammakathaṃ kathesi. Atha anantakāyo upāsakattaṃ paṭivedesīti. Anantakāyapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Pabbajjapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Atha kho āyasmā nāgaseno yena milindassa rañño nivesanaṃ tenupasaṅkami, upasaṅkamitvā paññatte āsane nisīdi. Atha kho milindo rājā āyasmantaṃ nāgasenaṃ saparisaṃ paṇītena khādanīyena bhojanīyena sahatthā santappetvā sampavāretvā ekamekaṃ bhikkhuṃ ekamekena dussayugena acchādetvā āyasmantaṃ nāgasenaṃ ticīvarena acchādetvā āyasmantaṃ nāgasenaṃ etadavoca ‘‘bhante nāgasena dasahi, bhikkhūhi saddhiṃ idha nisīdatha, avasesā gacchantū’’ti. Atha kho milindo rājā āyasmantaṃ nāgasenaṃ bhuttāviṃ onītapattapāṇiṃ viditvā aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi, ekamantaṃ nisinno kho milindo rājā āyasmantaṃ nāgasenaṃ etadavoca ‘‘bhante nāgasena, kimhi hoti kathāsallāpo’’ti? ‘‘Atthena mayaṃ, mahārāja, atthikā, atthe hotu kathāsallāpo’’ti. Rājā āha ‘‘kimatthiyā, bhante nāgasena, tumhākaṃ pabbajjā, ko ca tumhākaṃ paramattho’’ti. Thero āha ‘‘kinti, mahārāja, idaṃ dukkhaṃ nirujjheyya, aññañca dukkhaṃ na uppajjeyyāti. Etadatthā, mahārāja, amhākaṃ pabbajjā, anupādā parinibbānaṃ kho pana amhākaṃ paramattho’’ti. ‘‘Kiṃ pana, bhante nāgasena, sabbe etadatthāya pabbajantī’’ti? ‘‘Na hi, mahārāja, keci etadatthāya pabbajanti, keci rājābhinītā [rājabhītitā (sī.)] pabbajanti, keci corābhinītā [corabhītitā (sī.)] pabbajanti, keci iṇaṭṭā pabbajanti, keci ājīvikatthāya pabbajanti, ye pana sammā pabbajanti, te etadatthāya pabbajantī’’ti. ‘‘Tvaṃ pana, bhante, etadatthāya pabbajitosī’’ti? ‘‘Ahaṃ kho, mahārāja, daharako santo pabbajito, na jānāmi imassa nāmatthāya pabbajāmīti, api ca kho me evaṃ ahosi ‘paṇḍitā ime samaṇā sakyaputtiyā, te maṃ sikkhāpessantī’ti, svāhaṃ tehi sikkhāpito jānāmi ca passāmi ca ‘imassa nāmatthāya pabbajjā’’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Pabbajjapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Paṭisandhipañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Rājā āha ‘‘bhante nāgasena, atthi koci mato na paṭisandahatī’’ti. Thero āha ‘‘koci paṭisandahati, koci na paṭisandahatī’’ti. ‘‘Ko paṭisandahati, ko na paṭisandahatī’’ti? ‘‘Sakileso, mahārāja, paṭisandahati, nikkileso na paṭisandahatī’’ti. ‘‘Tvaṃ pana, bhante nāgasena, paṭisandahissasī’’ti? ‘‘Sace, mahārāja, saupādāno bhavissāmi paṭisandahissāmi, sace anupādāno bhavissāmi na paṭisandahissāmī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Paṭisandhipañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Yonisomanasikārapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Rājā āha ‘‘bhante nāgasena, yo na paṭisandahati, nanu so yoniso manasikārena na paṭisandahatī’’ti? ‘‘Yoniso ca mahārāja, manasikārena paññāya ca aññehi ca kusalehi dhammehī’’ti. ‘‘Nanu, bhante, yoniso manasikāro yeva paññā’’ti? ‘‘Na hi, mahārāja, añño manasikāro, aññā paññā, imesaṃ kho, mahārāja, ajeḷakagoṇamahiṃsaoṭṭhagadrabhānampi manasikāro atthi, paññā pana tesaṃ natthī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Yonisomanasikārapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Manasikāralakkhaṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Rājā āha ‘‘kiṃlakkhaṇo, bhante nāgasena, manasikāro, kiṃlakkhaṇā paññā’’ti? ‘‘Ūhanalakkhaṇo kho, mahārāja, manasikāro, chedanalakkhaṇā paññā’’ti. ‘‘Kathaṃ ūhanalakkhaṇo manasikāro, kathaṃ chedanalakkhaṇā paññā, opammaṃ karohī’’ti. ‘‘Jānāsi, tvaṃ mahārāja, yavalāvake’’ti. ‘‘Āma, bhante, jānāmī’’ti. ‘‘Kathaṃ, mahārāja, yavalāvakā yavaṃ lunantī’’ti? ‘‘Vāmena, bhante, hatthena yavakalāpaṃ gahetvā dakkhiṇena hatthena dāttaṃ gahetvā dāttena chindantī’’ti. ‘‘Yathā, mahārāja, yavalāvako vāmena hatthena yavakalāpaṃ gahetvā dakkhiṇena hatthena dāttaṃ gahetvā yavaṃ chindati, evameva kho, mahārāja, yogāvacaro manasikārena mānasaṃ gahetvā paññāya kilese chindati, evaṃ kho, mahārāja, ūhanalakkhaṇo manasikāro, evaṃ chedanalakkhaṇā paññā’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Manasikāralakkhaṇapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Sīlalakkhaṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Rājā āha ‘‘bhante nāgasena, yaṃ panetaṃ brūsi ‘aññehi ca kusalehi dhammehī’ti, katame te kusalā dhammā’’ti? ‘‘Sīlaṃ, mahārāja, saddhā vīriyaṃ sati samādhi, ime te kusalā dhammā’’ti. ‘‘Kiṃlakkhaṇaṃ, bhante, sīla’’nti? ‘‘Patiṭṭhānalakkhaṇaṃ, mahārāja, sīlaṃ sabbesaṃ kusalānaṃ dhammānaṃ, indriyabalabojjhaṅgamaggaṅgasatipaṭṭhānasammappadhānaiddhipādajhānavimokkhasa- mādhisamāpattīnaṃ sīlaṃ patiṭṭhaṃ, sīle patiṭṭhito kho, mahārāja, yogāvacaro sīlaṃ nissāya sīle patiṭṭhāya pañcindriyāni bhāveti saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriyanti, sabbe kusalā dhammā na parihāyantī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, ye keci bījagāmabhūtagāmā vuḍḍhiṃ virūḷhiṃ vepullaṃ āpajjanti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya vuḍḍhiṃ virūḷhiṃ vepullaṃ āpajjanti. Evameva kho, mahārāja, yogāvacaro sīlaṃ nissāya sīle patiṭṭhāya pañcindriyāni bhāveti saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriya’’nti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, ye keci balakaraṇīyā kammantā kayiranti, sabbe te pathaviṃ nissāya pathaviyaṃ patiṭṭhāya kayiranti. Evameva kho, mahārāja, yogāvacaro sīlaṃ nissāya sīle patiṭṭhāya pañcindriyāni bhāveti saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriya’’nti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, nagaravaḍḍhakī nagaraṃ māpetukāmo paṭhamaṃ nagaraṭṭhānaṃ sodhāpetvā khāṇukaṇṭakaṃ apakaḍḍhāpetvā bhūmiṃ samaṃ kārāpetvā tato aparabhāge vīthicatukkasiṅghāṭakādiparicchedena vibhajitvā nagaraṃ māpeti. Evameva kho, mahārāja, yogāvacaro sīlaṃ nissāya sīle patiṭṭhāya pañcindriyāni bhāveti saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriya’’nti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, laṅghako sippaṃ dassetukāmo pathaviṃ khaṇāpetvā sakkharakathalaṃ apakaḍḍhāpetvā bhūmiṃ samaṃ kārāpetvā mudukāya bhūmiyā sippaṃ dasseti. Evameva kho, mahārāja, yogāvacaro sīlaṃ nissāya sīle patiṭṭhāya pañcindriyāni bhāveti saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriyanti. Bhāsitampetaṃ, mahārāja, bhagavatā – ‘‘‘Sīle patiṭṭhāya naro sapañño, cittaṃ paññañca bhāvayaṃ; Ātāpī nipako bhikkhu, so imaṃ vijaṭaye jaṭa’nti [passa saṃ. ni. 1.23]. ‘‘‘Ayaṃ patiṭṭhā dharaṇīva pāṇinaṃ, idañca mūlaṃ kusalābhivuḍḍhiyā; Mukhañcidaṃ sabbajinānusāsane, yo sīlakkhandho varapātimokkhiyo’’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Sīlalakkhaṇapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Sampasādanalakkhaṇasaddhāpañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Rājā āha ‘‘bhante nāgasena, kiṃlakkhaṇā saddhā’’ti? ‘‘Sampasādanalakkhaṇā ca, mahārāja, saddhā, sampakkhandanalakkhaṇā cā’’ti. ‘‘Kathaṃ, bhante, sampasādanalakkhaṇā saddhā’’ti? ‘‘Saddhā kho, mahārāja, uppajjamānā nīvaraṇe vikkhambheti, vinīvaraṇaṃ cittaṃ hoti acchaṃ vippasannaṃ anāvilaṃ. Evaṃ kho, mahārāja, sampasādanalakkhaṇā saddhā’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, rājā cakkavattī caturaṅginiyā senāya saddhiṃ addhānamaggappaṭipanno parittaṃ udakaṃ tareyya, taṃ udakaṃ hatthīhi ca assehi ca rathehi ca pattīhi ca khubhitaṃ bhaveyya āvilaṃ luḷitaṃ kalalībhūtaṃ. Uttiṇṇo ca rājā cakkavattī manusse āṇāpeyya ‘pānīyaṃ, bhaṇe, āharatha, pivissāmī’ti, rañño ca udakappasādako maṇi bhaveyya. ‘Evaṃ devā’ti kho te manussā rañño cakkavattissa paṭissutvā taṃ udakappasādakaṃ maṇiṃ udake pakkhipeyyuṃ, tasmiṃ udake pakkhittamatte saṅkhasevālapaṇakaṃ vigaccheyya, kaddamo ca sannisīdeyya, acchaṃ bhaveyya udakaṃ vippasannaṃ anāvilaṃ. Tato rañño cakkavattissa pānīyaṃ upanāmeyyuṃ ‘pivatu, deva, pānīya’nti. ‘‘Yathā, mahārāja, udakaṃ, evaṃ cittaṃ daṭṭhabbaṃ, yathā te manussā, evaṃ yogāvacaro daṭṭhabbo, yathā saṅkhasevālapaṇakaṃ kaddamo ca, evaṃ kilesā daṭṭhabbā. Yathā udakappasādako maṇi, evaṃ saddhā daṭṭhabbā, yathā udakappasādake maṇimhi udake pakkhittamatte saṅkhasevālapaṇakaṃ vigaccheyya, kaddamo ca sannisīdeyya, acchaṃ bhaveyya udakaṃ vippasannaṃ anāvilaṃ, evameva kho, mahārāja, saddhā uppajjamānā nīvaraṇe vikkhambheti, vinīvaraṇaṃ cittaṃ hoti acchaṃ vippasannaṃ anāvilaṃ, evaṃ kho, mahārāja, sampasādanalakkhaṇā saddhā’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Sampasādanalakkhaṇasaddhāpañho dasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "Sampakkhandanalakkhaṇasaddhāpañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "‘‘Kathaṃ, bhante, sampakkhandanalakkhaṇā saddhā’’ti,? ‘‘Yathā, mahārāja, yogāvacaro aññesaṃ cittaṃ vimuttaṃ passitvā sotāpattiphale vā sakadāgāmiphale vā anāgāmiphale vā arahatte vā sampakkhandati yogaṃ karoti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Evaṃ kho, mahārāja, sampakkhandanalakkhaṇā saddhā’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, uparipabbate mahāmegho abhippavasseyya, taṃ udakaṃ yathāninnaṃ pavattamānaṃ pabbatakandarapadarasākhā paripūretvā nadiṃ paripūreyya, sā ubhato kūlāni saṃvissandantī gaccheyya, atha mahājanakāyo āgantvā tassā nadiyā uttānataṃ vā gambhīrataṃ vā ajānanto bhīto vitthato tīre tiṭṭheyya, athaññataro puriso āgantvā attano thāmañca balañca sampassanto gāḷhaṃ kacchaṃ bandhitvā pakkhanditvā tareyya, taṃ tiṇṇaṃ passitvā mahājanakāyopi tareyya. Evameva kho, mahārāja, yogāvacaro aññesaṃ cittaṃ vimuttaṃ passitvā sotāpattiphale vā sakadāgāmiphale vā anāgāmiphale vā arahatte vā sampakkhandati yogaṃ karoti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Evaṃ kho, mahārāja, sampakkhandanalakkhaṇā saddhāti. Bhāsitampetaṃ, mahārāja, bhagavatā saṃyuttanikāyavare – ‘‘‘Saddhāya taratī oghaṃ, appamādena aṇṇavaṃ; Vīriyena dukkhamacceti, paññāya parisujjhatī’’’ti [passa saṃ. ni. 1.246]. ‘‘Kallosi, bhante nāgasenā’’ti. Sampakkhandanalakkhaṇasaddhāpañho ekādasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "Vīriyalakkhaṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "Rājā āha ‘‘bhante nāgasena, kiṃlakkhaṇaṃ vīriya’’nti? ‘‘Upatthambhanalakkhaṇaṃ, mahārāja, vīriyaṃ, vīriyūpatthambhitā sabbe kusalā dhammā na parihāyantī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, puriso gehe patante aññena dārunā upatthambheyya, upatthambhitaṃ santaṃ evaṃ taṃ gehaṃ na pateyya. Evameva kho, mahārāja, upatthambhanalakkhaṇaṃ vīriyaṃ, vīriyūpatthambhitā sabbe kusalā dhammā na parihāyantī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, parittakaṃ senaṃ mahatī senā bhañjeyya, tato rājā aññamaññaṃ anussāreyya anupeseyya attano parittakāya senāya balaṃ anupadaṃ dadeyya, tāya saddhiṃ parittakā senā mahatiṃ senaṃ bhañjeyya. Evameva kho, mahārāja, upatthambhanalakkhaṇaṃ vīriyaṃ, vīriyūpatthambhitā sabbe kusalā dhammā na parihāyanti. Bhāsitampetaṃ, mahārāja, bhagavatā – ‘vīriyavā kho, bhikkhave, ariyasāvako akusalaṃ pajahati, kusalaṃ bhāveti. Sāvajjaṃ pajahati, anavajjaṃ bhāveti. Suddhamattānaṃ pariharatī’’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Vīriyalakkhaṇapañho dvādasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "Satilakkhaṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "Rājā āha ‘‘bhante nāgasena, kiṃlakkhaṇā satī’’ti? ‘‘Apilāpanalakkhaṇā, mahārāja, sati, upaggaṇhanalakkhaṇā cā’’ti. ‘‘Kathaṃ, bhante, apilāpanalakkhaṇā satī’’ti? ‘‘Sati, mahārāja, uppajjamānā kusalākusalasāvajjānavajjahīnappaṇītakaṇhasukkasappaṭibhāgadhamme apilāpeti ‘ime cattāro satipaṭṭhānā, ime cattāro sammappadhānā, ime cattāro iddhipādā, imāni pañcindriyāni, imāni pañca balāni, ime satta bojjhaṅgā, ayaṃ ariyo aṭṭhaṅgiko maggo, ayaṃ samatho, ayaṃ vipassanā, ayaṃ vijjā, ayaṃ vimuttī’ti. Tato yogāvacaro sevitabbe dhamme sevati, asevitabbe dhamme na sevati. Bhajitabbe dhamme bhajati abhajittabbe dhamme na bhajati. Evaṃ kho, mahārāja, apilāpanalakkhaṇā satī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, rañño cakkavattissa bhaṇḍāgāriko rājānaṃ cakkavattiṃ sāyaṃ pātaṃ yasaṃ sarāpeti ‘ettakā, deva, te hatthī, ettakā assā, ettakā rathā, ettakā pattī, ettakaṃ hiraññaṃ, ettakaṃ suvaṇṇaṃ, ettakaṃ sāpateyyaṃ, taṃ devo saratū’ti rañño sāpateyyaṃ apilāpeti. Evameva kho, mahārāja, sati uppajjamānā kusalākusalasāvajjānavajjahīnappaṇītakaṇhasukkasappaṭibhāgadhamme apilāpeti ‘ime cattāro satipaṭṭhānā, ime cattāro sammappadhānā, ime cattāro iddhipādā, imāni pañcindriyāni, imāni pañca balāni, ime satta bojjhaṅgā, ayaṃ ariyo aṭṭhaṅgiko maggo, ayaṃ samatho, ayaṃ vipassanā, ayaṃ vijjā, ayaṃ vimuttī’ti. Tato yogāvacaro sevitabbe dhamme sevati, asevitabbe dhamme na sevati. Bhajitabbe dhamme bhajati, abhajitabbe dhamme na bhajati. Evaṃ kho, mahārāja, apilāpanalakkhaṇā satī’’ti. ‘‘Kathaṃ, bhante, upaggaṇhanalakkhaṇā satī’’ti? ‘‘Sati, mahārāja, uppajjamānā hitāhitānaṃ dhammānaṃ gatiyo samanveti ‘ime dhammā hitā, ime dhammā ahitā. Ime dhammā upakārā, ime dhammā anupakārā’ti. Tato yogāvacaro ahite dhamme apanudeti, hite dhamme upaggaṇhāti. Anupakāre dhamme apanudeti, upakāre dhamme upaggaṇhāti. Evaṃ kho, mahārāja, upaggaṇhanalakkhaṇā satī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, rañño cakkavattissa pariṇāyakaratanaṃ rañño hitāhite jānāti ‘ime rañño hitā, ime ahitā. Ime upakārā, ime anupakārā’ti. Tato ahite apanudeti, hite upaggaṇhāti. Anupakāre apanudeti, upakāre upaggaṇhāti. Evameva kho, mahārāja, sati uppajjamānā hitāhitānaṃ dhammānaṃ gatiyo samanveti ‘ime dhammā hitā, ime dhammā ahitā. Ime dhammā upakārā, ime dhammā anupakārā’ti. Tato yogāvacaro ahite dhamme apanudeti, hite dhamme upaggaṇhā’ti. Anupakāre dhamme apanudeti, upakāre damme upaggaṇhāti. Evaṃ kho, mahārāja, upaggaṇhanalakkhaṇā sati. Bhāsitampetaṃ, mahārāja, bhagavatā – ‘satiñca khvāhaṃ, bhikkhave, sabbatthikaṃ vadāmī’’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Satilakkhaṇapañho terasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "Samādhipañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "Rājā āha ‘‘bhante nāgasena, kiṃlakkhaṇo samādhī’’ti? ‘‘Pamukhalakkhaṇo, mahārāja, samādhi, ye keci kusalā dhammā, sabbe te samādhipamukhā honti samādhininnā samādhipoṇā samādhipabbhārā’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kūṭāgārassa yā yāci gopānasiyo, sabbā tā kūṭaṅgamā honti kūṭaninnā kūṭasamosaraṇā, kūṭaṃ tāsaṃ aggamakkhāyati. Evameva kho, mahārāja, ye keci kusalā dhammā, sabbe te samādhipamukhā honti samādhininnā samādhipoṇā samādhipabbhārāti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, koci rājā caturaṅginiyā senāya saddhiṃ saṅgāmaṃ otareyya, sabbāva senā hatthī ca assā ca rathā ca pattī ca tappamukhā [tampamukhā (syā. ka.)] bhaveyyuṃ tanninnā tappoṇā tappabbhārā taṃ yeva anupariyāyeyyuṃ. Evameva kho, mahārāja, ye keci kusalā dhammā, sabbe te samādhipamukhā honti samādhininnā samādhipoṇā samādhipabbhārā. Evaṃ kho, mahārāja, pamukhalakkhaṇo samādhi. Bhāsitampetaṃ, mahārāja, bhagavatā – ‘‘samādhiṃ, bhikkhave, bhāvetha, samāhito, bhikkhave, bhikkhu yathābhūtaṃ pajānātī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Samādhipañho cuddasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "Paññālakkhaṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "Rājā āha ‘‘bhante nāgasena, kiṃlakkhaṇā paññā’’ti? ‘‘Pubbeva kho, mahārāja, mayā vuttaṃ ‘chedanalakkhaṇā paññā’ti, api ca obhāsanalakkhaṇā paññā’’ti. ‘‘Kathaṃ, bhante, obhāsanalakkhaṇā paññā’’ti? ‘‘Paññā, mahārāja, uppajjamānā avijjandhakāraṃ vidhameti, vijjobhāsaṃ janeti, ñāṇālokaṃ vidaṃseti, ariyasaccāni pākaṭāni karoti. Tato yogāvacaro ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā sammappaññāya passatī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, puriso andhakāre gehe padīpaṃ paveseyya, paviṭṭho padīpo andhakāraṃ vidhameti, obhāsaṃ janeti, ālokaṃ vidaṃseti, rūpāni pākaṭāni karoti. Evameva kho, mahārāja, paññā uppajjamānā avijjandhakāraṃ vidhameti, vijjobhāsaṃ janeti, ñāṇālokaṃ vidaṃseti, ariyasaccāni pākaṭāni karoti. Tato yogāvacaro ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā sammappaññāya passati. Evaṃ kho, mahārāja, obhāsanalakkhaṇā paññā’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Paññālakkhaṇapañho pannarasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "Nānādhammānaṃ ekakiccaabhinipphādanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "Rājā āha ‘‘bhante nāgasena, ime dhammā nānā santā ekaṃ atthaṃ abhinipphādentī’’ti? ‘‘Āma, mahārāja, ime dhammā nānā santā ekaṃ atthaṃ abhinipphādenti, kilese hanantī’’ti. ‘‘Kathaṃ, bhante, ime dhammā nānā santā ekaṃ atthaṃ abhinipphādenti, kilese hananti? Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, senā nānā santā hatthī ca assā ca rathā ca pattī ca ekaṃ atthaṃ abhinipphādenti, saṅgāme parasenaṃ abhivijinanti. Evameva kho, mahārāja, ime dhammā nānā santā ekaṃ atthaṃ abhinipphādenti, kilese hanantī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Nānādhammānaṃ ekakiccaabhinipphādanapañho soḷasamo. Mahāvaggo paṭhamo. Imasmiṃ vagge soḷasa pañhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}