{
  "id": "mil.15",
  "title": {
    "pali": "Vessantaravaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Vessantarapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, sabbeva bodhisattā puttadāraṃ denti, udāhu vessantareneva raññā puttadāraṃ dinna’’nti? ‘‘Sabbepi, mahārāja, bodhisattā puttadāraṃ denti, na vessantareneva raññā puttadāraṃ dinna’’nti. ‘‘Api ca kho, bhante nāgasena, tesaṃ anumatena dentī’’ti. ‘‘Bhariyā, mahārāja, anumatā, dārakā pana bālatāya vilapiṃsu [lālapiṃsu (sī. pī.)], yadi te atthato jāneyyuṃ, tepi anumodeyyuṃ, na te vilapeyyu’’nti. ‘‘Dukkaraṃ, bhante nāgasena, bodhisattena kataṃ, yaṃ so attano orase piye putte brāhmaṇassa dāsatthāya adāsi. ‘‘Idampi dutiyaṃ dukkarato dukkarataraṃ, yaṃ so attano orase piye putte bālake taruṇake latāya bandhitvā tena brāhmaṇena latāya anumajjīyante disvā ajjhupekkhi. ‘‘Idampi tatiyaṃ dukkarato dukkarataraṃ, yaṃ so sakena balena bandhanā muccitvā āgate dārake sārajjamupagate punadeva latāya bandhitvā adāsi. ‘‘Idampi catutthaṃ dukkarato dukkarataraṃ, yaṃ so dārake ‘ayaṃ kho, tāta, yakkho khādituṃ neti amhe’ti vilapante ‘mā bhāyitthā’ti na assāsesi. ‘‘Idampi pañcamaṃ dukkarato dukkarataraṃ, yaṃ so jālissa kumārassa rudamānassa pādesu nipatitvā ‘alaṃ, tāta, kaṇhājinaṃ nivattehi, ahameva gacchāmi yakkhena saha, khādatu maṃ yakkho’ti yācamānassa evaṃ na sampaṭicchi. ‘‘Idampi chaṭṭhaṃ dukkarato dukkarataraṃ, yaṃ so jālissa kumārassa ‘pāsāṇasamaṃ nūna te, tāta, hadayaṃ, yaṃ tvaṃ amhākaṃ dukkhitānaṃ pekkhamāno nimmanussake brahāraññe yakkhena nīyamāne na nivāresī’ti vilapamānassa kāruññaṃ nākāsi. ‘‘Idampi sattamaṃ dukkarato dukkarataraṃ, yaṃ tassa ruḷaruḷassa bhīmabhīmassa nīte dārake adassanaṃ gamite na phali hadayaṃ satadhā vā sahassadhā vā, puññakāmena manujena kiṃ paradukkhāpanena, nanu nāma sakadānaṃ dātabbaṃ hotī’’ti? ‘‘Dukkarassa, mahārāja, katattā bodhisattassa kittisaddo dasasahassiyā lokadhātuyā sadevamanussesu abbhuggato, devā devabhavane pakittenti, asurā asurabhavane pakittenti, garuḷā garuḷabhavane pakittenti, nāgā nāgabhavane pakittenti, yakkhā yakkhabhavane pakittenti, anupubbena tassa kittisaddo paramparāya ajjetarahi idha amhākaṃ samayaṃ anuppatto, taṃ mayaṃ dānaṃ pakittentā vikopentā nisinnā sudinnaṃ, udāhu duddinnanti. So kho panāyaṃ, mahārāja, kittisaddo nipuṇānaṃ viññūnaṃ vidūnaṃ vibhāvīnaṃ bodhisattānaṃ dasa guṇe anudassati. Katame dasa? Agedhatā nirālayatā cāgo pahānaṃ apunarāvattitā sukhumatā mahantatā duranubodhatā dullabhatā asadisatā buddhadhammassa, so kho panāyaṃ, mahārāja, kittisaddo nipuṇānaṃ viññūnaṃ vidūnaṃ vibhāvīnaṃ bodhisattānaṃ ime dasa guṇe anudassatī’’ti. ‘‘Bhante nāgasena, yo paraṃ dukkhāpetvā dānaṃ deti, api nu taṃ dānaṃ sukhavipākaṃ hoti saggasaṃvattanika’’nti? ‘‘Āma, mahārāja, kiṃ vattabba’’nti. ‘‘Iṅgha, bhante nāgasena, kāraṇaṃ upadassehī’’ti. ‘‘Idha, mahārāja, koci samaṇo vā brāhmaṇo vā sīlavā hoti kalyāṇadhammo, so bhaveyya pakkhahato vā pīṭhasappī vā aññataraṃ vā byādhiṃ āpanno, tamenaṃ yo koci puññakāmo yānaṃ āropetvā patthitaṃ desamanupāpeyya, api nu kho, mahārāja, tassa purisassa tatonidānaṃ kiñci sukhaṃ nibbatteyya saggasaṃvattanikaṃ taṃ kamma’’nti? ‘‘Āma, bhante, kiṃ vattabbaṃ? Hatthiyānaṃ vā so, bhante, puriso labheyya assayānaṃ vā rathayānaṃ vā, thale thalayānaṃ jale jalayānaṃ devesu devayānaṃ manussesu manussayānaṃ, tadanucchavikaṃ tadanulomikaṃ bhave bhave nibbatteyya, tadanucchavikāni tadanulomikāni cassa sukhāni nibbatteyyuṃ, sugatito sugatiṃ gaccheyya, teneva kammābhisandena iddhiyānaṃ abhiruyha patthitaṃ nibbānanagaraṃ pāpuṇeyyā’’ti. ‘‘Tena hi, mahārāja, paradukkhāpanena dinnadānaṃ sukhavipākaṃ hoti saggasaṃvattanikaṃ, yaṃ so puriso balībadde dukkhāpetvā evarūpaṃ sukhaṃ anubhavati. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yathā paradukkhāpanena dinnadānaṃ sukhavipākaṃ hoti saggasaṃvattanikaṃ. Idha, mahārāja, yo koci rājā janapadato dhammikaṃ baliṃ uddharāpetvā āṇāpavattanena dānaṃ dadeyya, api nu kho so, mahārāja, rājā tatonidānaṃ kiñci sukhaṃ anubhaveyya saggasaṃvattanikaṃ taṃ dāna’’nti? ‘‘Āma, bhante, kiṃ vattabbaṃ, tatonidānaṃ so, bhante, rājā uttariṃ anekasatasahassaguṇaṃ labheyya. Rājūnaṃ atirājā bhaveyya, devānaṃ atidevo bhaveyya, brahmānaṃ atibrahmā bhaveyya, samaṇānaṃ atisamaṇo bhaveyya, brāhmaṇānaṃ atibrāhmaṇo bhaveyya, arahantānaṃ atiarahā [atiarahanto (syā. ka.)] bhaveyyā’’ti. ‘‘Tena hi, mahārāja, paradukkhāpanena dinnadānaṃ sukhavipākaṃ hoti saggasaṃvattanikaṃ, yaṃ so rājā balinā janaṃ pīḷetvā dinnadānena evarūpaṃ uttariṃ yasasukhaṃ anubhavatī’’ti. ‘‘Atidānaṃ, bhante nāgasena, vessantarena raññā dinnaṃ, yaṃ so sakaṃ bhariyaṃ parassa bhariyatthāya adāsi, sake orase putte brāhmaṇassa dāsatthāya adāsi, atidānaṃ nāma, bhante nāgasena, loke vidūhi ninditaṃ garahitaṃ, yathā nāma, bhante nāgasena, atibhārena sakaṭassa akkho bhijjati, atibhārena nāvā osīdati, atibhuttena bhojanaṃ visamaṃ pariṇamati, ativassena dhaññaṃ vinassati, atidānena bhogakkhayaṃ upeti, atitāpena pathavī upaḍayhati, atirāgena ummattako hoti, atidosena vajjho hoti, atimohena anayaṃ āpajjati, atilobhena coraggahaṇamupagacchati, atibhayena nirujjhati, atipūrena nadī uttarati, ativātena asani patati, atiagginā odanaṃ uttarati, atisañcaraṇena na ciraṃ jīvati. Evameva kho, bhante nāgasena, atidānaṃ nāma loke vidūhi ninditaṃ garahitaṃ, atidānaṃ, bhante nāgasena, vessantarena raññā dinnaṃ, na tattha kiñci phalaṃ icchitabba’’nti. ‘‘Atidānaṃ, mahārāja, loke vidūhi vaṇṇitaṃ thutaṃ pasatthaṃ, ye keci yādisaṃ kīdisaṃ dānaṃ denti [keci yādisaṃ tādisaṃ dānaṃ denti (syā.)], atidānadāyī loke kittiṃ pāpuṇāti. Yathā, mahārāja, atipavaratāya dibbaṃ vanamūlaṃ gahitampi hatthapāse ṭhitānaṃ parajanānaṃ na dassayati, agado atijaccatāya [atiusabhatāya (ka.)] pīḷāya samugghātako rogānaṃ antakaro, aggi atijotitāya ḍahati, udakaṃ atisītatāya nibbāpeti, padumaṃ parisuddhatāya na upalimpati vārikaddamena, maṇi atiguṇatāya kāmadado, vajiraṃ atitikhiṇatāya vijjhati maṇimuttāphalikaṃ, pathavī atimahantatāya naroragamigapakkhijalaselapabbatadume dhāreti, samuddo atimahantatāya aparipūraṇo, sineru atibhāratāya acalo, ākāso ativitthāratāya ananto, sūriyo atippabhatāya timiraṃ ghāteti, sīho atijātitāya vigatabhayo, mallo atibalavatāya paṭimallaṃ khippaṃ ukkhipati, rājā atipuññatāya adhipati, bhikkhu atisīlavantatāya nāgayakkhanaramarūhi namassanīyo, buddho atiaggatāya [ativisiṭṭhatāya (syā.)] anupamo. Evameva kho, mahārāja, atidānaṃ nāma loke vidūhi vaṇṇitaṃ thutaṃ pasatthaṃ, ye keci yādisaṃ kīdisaṃ dānaṃ denti, atidānadāyī loke kittiṃ pāpuṇāti, atidānena vessantaro rājā dasasahassiyā lokadhātuyā vaṇṇito thuto pasattho mahito kittito, teneva atidānena vessantaro rājā ajjetarahi buddho jāto aggo sadevake loke. ‘‘Atthi pana, mahārāja, loke ṭhapanīyaṃ dānaṃ, yaṃ dakkhiṇeyye anuppatte na dātabba’’nti? ‘‘Dasa kho panimāni, bhante nāgasena, dānāni, yāni loke adānasammatāni, yo tāni dānāni deti, so apāyagāmī hoti. Katamāni dasa? Majjadānaṃ, bhante nāgasena, loke adānasammataṃ, yo taṃ dānaṃ deti, so apāyagāmī hoti. Samajjadānaṃ…pe… itthidānaṃ…pe… usabhadānaṃ…pe… cittakammadānaṃ…pe… satthadānaṃ …pe… visadānaṃ…pe… saṅkhalikadānaṃ…pe… kukkuṭasūkaradānaṃ…pe… tulākūṭamānakūṭadānaṃ, bhante nāgasena, loke adānasammataṃ hoti, yo taṃ dānaṃ deti, so apāyagāmī hoti. Imāni kho, bhante nāgasena, dasa dānāni loke adānasammatāni, yo tāni dānāni deti, so apāyagāmī hotī’’ti. ‘‘Nāhaṃ taṃ, mahārāja, adānasammataṃ pucchāmi, imaṃ khvāhaṃ, mahārāja, taṃ pucchāmi ‘atthi pana, mahārāja, loke ṭhapanīyaṃ dānaṃ, yaṃ dakkhiṇeyye anuppatte na dātabba’nti. ‘‘Natthi, bhante nāgasena, loke ṭhapanīyaṃ dānaṃ. Yaṃ dakkhiṇeyye anuppatte na dātabbaṃ, cittappasāde uppanne keci dakkhiṇeyyānaṃ bhojanaṃ denti, keci acchādanaṃ, keci sayanaṃ, keci āvasathaṃ, keci attharaṇapāvuraṇaṃ, keci dāsidāsaṃ, keci khettavatthuṃ, keci dvipadacatuppadaṃ, keci sataṃ sahassaṃ satasahassaṃ, keci mahārajjaṃ, keci jīvitampi dentī’’ti. ‘‘Yadi pana, mahārāja, keci jīvitampi denti, kiṃ kāraṇā vessantaraṃ dānapatiṃ atibāḷhaṃ paripātesi sudinne putte ca dāre ca? ‘‘Api nu kho, mahārāja, atthi lokapakati lokāciṇṇaṃ, labhati pitā puttaṃ iṇaṭṭo vā ājīvikapakato vā āvapituṃ vā [ādhāpetuṃ vā (syā.), ādhapituṃ vā (ka.)] vikkiṇituṃ vā’’ti? ‘‘Āma, bhante, labhati pitā puttaṃ iṇaṭṭo vā ājīvikapakato vā āvapituṃ vā vikkiṇituṃ vā’’ti. ‘‘Yadi, mahārāja, labhati pitā puttaṃ iṇaṭṭo vā ājīvikapakato vā āvapituṃ vā vikkiṇituṃ vā, vessantaropi, mahārāja, rājā alabhamāno sabbaññutañāṇaṃ upadduto dukkhito tassa dhammadhanassa paṭilābhāya puttadāraṃ āvapesi ca vikkiṇi ca. Iti, mahārāja, vessantarena raññā aññesaṃ dinnaṃ yeva dinnaṃ, kataṃ yeva kataṃ. Kissa pana tvaṃ, mahārāja, tena dānena vessantaraṃ dānapatiṃ atibāḷhaṃ apasādesī’’ti? ‘‘Nāhaṃ, bhante nāgasena, vessantarassa dānapatino dānaṃ garahāmi, api ca puttadāraṃ yācante niminitvā attānaṃ dātabba’’nti. ‘‘Etaṃ kho, mahārāja, asabbhikāraṇaṃ, yaṃ puttadāraṃ yācante attānaṃ dadeyya, yaṃ yaṃ hi yācante taṃ tadeva dātabbaṃ, etaṃ sappurisānaṃ kammaṃ. Yathā, mahārāja, koci puriso pānīyaṃ āharāpeyya, tassa yo bhojanaṃ dadeyya, api nu so, mahārāja, puriso tassa kiccakārī assā’’ti? ‘‘Na hi, bhante, yaṃ so āharāpeti, tameva tassa dento kiccakārī assā’’ti. ‘‘Evameva kho, mahārāja, vessantaro rājā brāhmaṇe puttadāraṃ yācante puttadāraṃ yeva adāsi. Sace, mahārāja, brāhmaṇo vessantarassa sarīraṃ yāceyya, na so, mahārāja, attānaṃ rakkheyya na kampeyya na rajjeyya, tassa dinnaṃ pariccattaṃ yeva sarīraṃ bhaveyya. Sace, mahārāja, koci vessantaraṃ dānapatiṃ upagantvā yāceyya ‘dāsattaṃ me upehī’ti, dinnaṃ pariccattaṃ yevassa sarīraṃ bhaveyya, na so datvā tapeyya [ṭhapeyya (sī.)], rañño, mahārāja, vessantarassa kāyo bahusādhāraṇo. ‘‘Yathā, mahārāja, pakkā maṃsapesi bahusādhāraṇā, evameva kho, mahārāja, rañño vessantarassa kāyo bahusādhāraṇo. Yathā vā pana, mahārāja, phalito [phalino (?)] rukkho nānādijagaṇasādhāraṇo, evameva kho, mahārāja, rañño vessantarassa kāyo bahusādhāraṇo. Kiṃ kāraṇā? ‘Evāhaṃ paṭipajjanto sammāsambodhiṃ pāpuṇissāmī’ti. ‘‘Yathā, mahārāja, puriso adhano dhanatthiko dhanapariyesanaṃ caramāno ajapathaṃ saṅkupathaṃ vettapathaṃ gacchati, jalathalavāṇijjaṃ karoti, kāyena vācāya manasā dhanaṃ ārādheti, dhanappaṭilābhāya vāyamati. Evameva kho, mahārāja, vessantaro dānapati adhano buddhadhanena sabbaññutañāṇaratanappaṭilābhāya yācakānaṃ dhanadhaññaṃ dāsidāsaṃ yānavāhanaṃ sakalasāpateyyaṃ sakaṃ puttadāraṃ attānañca cajitvā sammāsambodhiṃ yeva pariyesati. ‘‘Yathā vā pana, mahārāja, amacco muddakāmo muddādhikaraṇaṃ yaṃ kiñci gehe dhanadhaññaṃ hiraññasuvaṇṇaṃ, taṃ sabbaṃ datvāpi muddappaṭilābhāya vāyamati. Evameva kho, mahārāja, vessantaro dānapati sabbaṃ taṃ bāhirabbhantaradhanaṃ datvā jīvitampi paresaṃ datvā sammāsambodhiṃ yeva pariyesati. ‘‘Api ca, mahārāja, vessantarassa dānapatino evaṃ ahosi ‘yaṃ so brāhmaṇo yācati, tamevāhaṃ tassa dento kiccakārī nāma homī’ti, evaṃ so tassa puttadāramadāsi. Na kho, mahārāja, vessantaro dānapati dessatāya brāhmaṇassa puttadāramadāsi, na adassanakāmatāya puttadāramadāsi, na atibahukā me puttadārā, ‘na sakkomi te posetu’nti puttadāramadāsi, na ukkaṇṭhito ‘appiyā me’ti nīharitukāmatāya puttadāramadāsi. Atha kho sabbaññutañāṇaratanasseva piyattā sabbaññutañāṇassa kāraṇā vessantaro rājā evarūpaṃ atulaṃ vipulamanuttaraṃ piyaṃ manāpaṃ dayitaṃ pāṇasamaṃ puttadāradānavaraṃ brāhmaṇassa adāsi. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena cariyāpiṭake – ‘‘‘Na me dessā ubho puttā, maddī devī na dessiyā; Sabbaññutaṃ piyaṃ mayhaṃ, tasmā piye adāsaha’nti. ‘‘Tasmā, mahārāja, vessataro rājā puttadānaṃ [puttadāraṃ (ka.)] datvā paṇṇasālaṃ pavisitvā nipajji. Tassa atipemena dukkhitassa balavasoko uppajji, hadayavatthu uṇhamahosi. Nāsikāya appahontiyā mukhena uṇhe assāsapassāse vissajjesi, assūni parivattitvā lohitabindūni hutvā nettehi nikkhamiṃsu. Evameva kho, mahārāja, dukkhena vessantaro rājā brāhmaṇassa puttadāramadāsi ‘mā me dānapatho parihāyī’ti. ‘‘Api ca, mahārāja, vessantaro rājā dve atthavase paṭicca brāhmaṇassa dve dārake adāsi. Katame dve? Dānapatho ca me aparihīno bhavissati, dukkhite ca me puttake vanamūlaphalehi itonidānaṃ ayyako mocessatīti. Jānāti hi, mahārāja, vessantaro rājā ‘na me dārakā sakkā kenaci dāsabhogena bhuñjituṃ, ime ca dārake ayyako nikkiṇissati, evaṃ amhākampi gamanaṃ bhavissatī’ti. Ime kho, mahārāja, dve atthavase paṭicca brāhmaṇassa dve dārake adāsi. ‘‘Api ca, mahārāja, vessantaro rājā jānāti ‘ayaṃ kho brāhmaṇo jiṇṇo vuḍḍho mahallako dubbalo bhaggo daṇḍaparāyaṇo khīṇāyuko parittapuñño, neso samattho ime dārake dāsabhogena bhuñjitu’nti. Sakkuṇeyya pana, mahārāja, puriso pākatikena balena ime candimasūriye evaṃmahiddhike evaṃmahānubhāve gahetvā peḷāya vā samugge vā pakkhipitvā nippabhe katvā thālakaparibhogena [padīpaparibhogena (syā.)] paribhuñjitu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, imasmiṃ loke candimasūriyappaṭibhāgassa vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjitunti. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. Yathā, mahārāja, rañño cakkavattissa maṇiratanaṃ subhaṃ jātimantaṃ aṭṭhaṃsaṃ suparikammakataṃ catuhatthāyāmaṃ sakaṭanābhipariṇāhaṃ na sakkā kenaci pilotikāya veṭhetvā peḷāya pakkhipitvā satthakanisānaparibhogena paribhuñjituṃ, evameva kho, mahārāja, loke cakkavattirañño maṇiratanappaṭibhāgassa vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. Yathā, mahārāja, tidhā pabhinno sabbaseto sattappatiṭṭhito aṭṭharatanubbedho navaratanāyāmapariṇāho pāsādiko dassanīyo uposatho nāgarājā na sakkā kenaci suppena vā sarāvena vā pidahituṃ, govacchako viya vacchakasālāya pakkhipitvā pariharituṃ vā, evameva kho, mahārāja, loke uposathanāgarājappaṭibhāgassa vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. Yathā, mahārāja, mahāsamuddo dīghaputhulavitthiṇṇo gambhīro appameyyo duruttaro apariyogāḷho anāvaṭo na sakkā kenaci sabbattha pidahitvā ekatitthena paribhogaṃ kātuṃ, evameva kho, mahārāja, loke mahāsamuddappaṭibhāgassa vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. Yathā, mahārāja, himavanto pabbatarājā pañcayojanasataṃ accuggato nabhe tisahassayojanāyāmavitthāro caturāsītikūṭasahassappaṭimaṇḍito pañcannaṃ mahānadīsatānaṃ pabhavo mahābhūtagaṇālayo nānāvidhagandhadharo dibbosadhasatasamalaṅkato nabhe valāhako viya accuggato dissati, evameva kho, mahārāja, loke himavantapabbatarājappaṭibhāgassa vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. Yathā, mahārāja, rattandhakāratimisāyaṃ uparipabbatagge jalamāno mahāaggikkhandho suvidūrepi paññāyati, evameva kho, mahārāja, vessantaro rājā pabbatagge jalamāno mahāaggikkhandho viya suvidūrepi pākaṭo paññāyati, tassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena vessantarassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. Yathā, mahārāja, himavante pabbate nāgapupphasamaye ujuvāte vāyante dasa dvādasa yojanāni pupphagandho vāyati, evameva kho, mahārāja, vessantarassa rañño api yojanasahassehipi yāva akaniṭṭhabhavanaṃ etthantare surāsuragaruḷagandhabbayakkharakkhasamahoragakinnaraindabhavanesu kittisaddo abbhuggato, sīlavaragandho cassa sampavāyati, tena tassa dārakā na sakkā kenaci dāsabhogena bhuñjituṃ. Anusiṭṭho, mahārāja, jālī kumāro pitarā vessantarena raññā ‘ayyako te, tāta, tumhe brāhmaṇassa dhanaṃ datvā nikkiṇanto taṃ nikkhasahassaṃ datvā nikkiṇātu, kaṇhājinaṃ nikkiṇanto dāsasataṃ dāsisataṃ hatthisataṃ assasataṃ dhenusataṃ usabhasataṃ nikkhasatanti sabbasataṃ datvā nikkiṇātu, yadi te, tāta, ayyako tumhe brāhmaṇassa hatthato āṇāya balasā mudhā gaṇhāti, mā tumhe ayyakassa vacanaṃ karittha, brāhmaṇasseva anuyāyino hothā’ti, evamanusāsitvā putte pesesi, tato jālīkumāro gantvā ayyakena puṭṭho kathesi – ‘‘‘Sahassagghaṃ hi maṃ tāta, brāhmaṇassa pitā adā; Atho kaṇhājinaṃ kaññaṃ, hatthīnañca satena cā’’’ti. ‘‘Sunibbeṭhito, bhante nāgasena, pañho; subhinnaṃ diṭṭhijālaṃ; sumaddito paravādo; sakasamayo sudīpito; byañjanaṃ suparisodhitaṃ; suvibhatto attho; evametaṃ tathā sampaṭicchāmī’’ti. Vessantarapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Dukkarakārikapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, sabbeva bodhisattā dukkarakārikaṃ karonti, udāhu gotameneva bodhisattena dukkarakārikā katā’’ti? ‘‘Natthi, mahārāja, sabbesaṃ bodhisattānaṃ dukkarakārikā, gotameneva bodhisattena dukkarakārikā katā’’ti. ‘‘Bhante nāgasena, yadi evaṃ ayuttaṃ, yaṃ bodhisattānaṃ bodhisattehi vemattatā hotī’’ti. ‘‘Catūhi, mahārāja, ṭhānehi bodhisattānaṃ bodhisattehi vemattatā hoti. Katamehi catūhi? Kulavemattatā padhānavemattatā [addhānavemattatā (sī. syā. pī.)] āyuvemattatā pamāṇavemattatāti. Imehi kho, mahārāja, catūhi ṭhānehi bodhisattānaṃ bodhisattehi vemattatā hoti. Sabbesampi, mahārāja, buddhānaṃ rūpe sīle samādhimhi paññāya vimuttiyā vimuttiñāṇadassane catuvesārajje dasatathāgatabale chaasādhāraṇañāṇe cuddasabuddhañāṇe aṭṭhārasabuddhadhamme kevale ca buddhaguṇe [buddhadhamme (sī. pī.)] natthi vemattatā, sabbepi buddhā buddhadhammehi samasamā’’ti. ‘‘Yadi, bhante nāgasena, sabbepi buddhā buddhadhammehi samasamā, kena kāraṇena gotameneva bodhisattena dukkarakārikā katā’’ti? ‘‘Aparipakke, mahārāja, ñāṇe aparipakkāya bodhiyā gotamo bodhisatto nekkhammamabhinikkhanto aparipakkaṃ ñāṇaṃ paripācayamānena dukkarakārikā katā’’ti. ‘‘Bhante nāgasena, kena kāraṇena bodhisatto aparipakke ñāṇe aparipakkāya bodhiyā mahābhinikkhamanaṃ nikkhanto, nanu nāma ñāṇaṃ paripācetvā paripakke ñāṇe nikkhamitabba’’nti? ‘‘Bodhisatto, mahārāja, viparītaṃ itthāgāraṃ disvā vippaṭisārī ahosi, tassa vippaṭisārissa arati uppajji, araticittaṃ uppannaṃ disvā aññataro mārakāyiko devaputto ‘ayaṃ kho kālo araticittassa vinodanāyā’ti vehāse ṭhatvā idaṃ vacanamabravi – ‘‘Mārisa, mā kho tvaṃ ukkaṇṭhito ahosi, ito te sattame divase dibbaṃ cakkaratanaṃ pātubhavissati sahassāraṃ sanemikaṃ sanābhikaṃ sabbākāraparipūraṃ, pathavigatāni ca te ratanāni ākāsaṭṭhāni ca sayameva upagacchissanti, dvisahassaparittadīpaparivāresu catūsu mahādīpesu ekamukhena āṇā pavattissati, parosahassañca te puttā bhavissanti sūrā vīraṅgarūpā parasenappamaddanā, tehi puttehi parikiṇṇo sattaratanasamannāgato catuddīpamanusāsissasī’ti. ‘‘Yathā nāma divasasantattaṃ ayosūlaṃ sabbattha upaḍahantaṃ kaṇṇasotaṃ paviseyya, evameva kho, mahārāja, bodhisattassa taṃ vacanaṃ kaṇṇasotaṃ pavisittha, iti so pakatiyāva ukkaṇṭhito tassā devatāya vacanena bhiyyosomattāya ubbijji saṃvijji saṃvegamāpajji. ‘‘Yathā pana, mahārāja, mahatimahāaggikkhandho jalamāno aññena kaṭṭhena upaḍahito bhiyyosomattāya jaleyya, evameva kho, mahārāja, bodhisatto pakatiyāva ukkaṇṭhito tassā devatāya vacanena bhiyyosomattāya ubbijji saṃvijji saṃvegamāpajji. ‘‘Yathā vā pana, mahārāja, mahāpathavī pakatitintā nibbattaharitasaddalā āsittodakā cikkhallajātā punadeva mahāmeghe abhivuṭṭhe bhiyyosomattāya cikkhallatarā assa, evameva kho, mahārāja, bodhisatto pakatiyāva ukkaṇṭhito tassā devatāya vacanena bhiyyosomattāya ubbijji saṃvijji saṃvegamāpajjī’’ti. ‘‘Api nu kho, bhante nāgasena, bodhisattassa yadi sattame divase dibbaṃ cakkaratanaṃ nibbatteyya, paṭinivatteyya bodhisatto dibbe cakkaratane nibbatte’’ti? ‘‘Na hi, mahārāja, sattame divase bodhisattassa dibbaṃ cakkaratanaṃ nibbatteyya, api ca palobhanatthāya tāya devatāya musā bhaṇitaṃ, yadipi, mahārāja, sattame divase dibbaṃ cakkaratanaṃ nibbatteyya, bodhisatto na nivatteyya. Kiṃ kāraṇaṃ? ‘Anicca’nti, mahārāja, bodhisatto daḷhaṃ aggahesi, ‘dukkhaṃ anattā’ti daḷhaṃ aggahesi, upādānakkhayaṃ patto. ‘‘Yathā, mahārāja, anotattadahato udakaṃ gaṅgaṃ nadiṃ pavisati, gaṅgāya nadiyā mahāsamuddaṃ pavisati, mahāsamuddato pātālamukhaṃ pavisati, api nu, mahārāja, taṃ udakaṃ pātālamukhagataṃ paṭinivattitvā mahāsamuddaṃ paviseyya, mahāsamuddato gaṅgaṃ nadiṃ paviseyya, gaṅgāya nadiyā puna anotattaṃ paviseyyā’’ti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, bodhisattena kappānaṃ satasahassaṃ caturo ca asaṅkhyeyye kusalaṃ paripācitaṃ imassa bhavassa kāraṇā, soyaṃ antimabhavo anuppatto paripakkaṃ bodhiñāṇaṃ chahi vassehi buddho bhavissati sabbaññū loke aggapuggalo, api nu kho, mahārāja, bodhisatto cakkaratanakāraṇā [cakkaratanassa kāraṇā (sī. syā. pī.)] paṭinivatteyyā’’ti [parinivatteyyāti (sī. pī. ka.)]? ‘‘Na hi, bhante’’ti. ‘‘Api ca, mahārāja, mahāpathavī parivatteyya sakānanā sapabbatā, natveva bodhisatto paṭinivatteyya apatvā sammāsambodhiṃ. Āroheyyapi ce, mahārāja, gaṅgāya udakaṃ paṭisotaṃ, natveva bodhisatto paṭinivatteyya apatvā sammāsambodhiṃ; visusseyyapi ce, mahārāja, mahāsamuddo aparimitajaladharo gopade udakaṃ viya, natveva bodhisatto paṭinivatteyya apatvā sammāsambodhiṃ; phaleyyapi ce, mahārāja, sinerupabbatarājā satadhā vā sahassadhā vā, natveva bodhisatto paṭinivatteyya apatvā sammāsambodhiṃ; pateyyumpi ce, mahārāja, candimasūriyā satārakā leḍḍu viya chamāyaṃ, natveva bodhisatto paṭinivatteyya apatvā sammāsambodhiṃ; saṃvatteyyapi ce, mahārāja, ākāso kilañjamiva, natveva bodhisatto paṭinivatteyya apatvā sammāsambodhiṃ. Kiṃ kāraṇā? Padālitattā sabbabandhanāna’’nti. ‘‘Bhante nāgasena, kati loke bandhanānī’’ti? ‘‘Dasa kho panimāni, mahārāja, loke bandhanāni, yehi bandhanehi baddhā sattā na nikkhamanti, nikkhamitvāpi paṭinivattanti. Katamāni dasa? Mātā, mahārāja, loke bandhanaṃ, pitā, mahārāja, loke bandhanaṃ, bhariyā, mahārāja, loke bandhanaṃ, puttā, mahārāja, loke bandhanaṃ, ñātī, mahārāja, loke bandhanaṃ, mittaṃ, mahārāja, loke bandhanaṃ, dhanaṃ, mahārāja, loke bandhanaṃ, lābhasakkāro, mahārāja, loke bandhanaṃ, issariyaṃ, mahārāja, loke bandhanaṃ, pañca kāmaguṇā, mahārāja, loke bandhanaṃ, imāni kho mahārāja dasa loke bandhanāni, yehi bandhanehi baddhā sattā na nikkhamanti, nikkhamitvāpi paṭinivattanti, tāni dasa bandhanāni bodhisattassa chinnāni padālitāni, tasmā, mahārāja, bodhisatto na paṭinivattatī’’ti. ‘‘Bhante nāgasena, yadi bodhisatto uppanne araticitte devatāya vacanena aparipakke ñāṇe aparipakkāya bodhiyā nekkhammamabhinikkhanto, kiṃ tassa dukkarakārikāya katāya, nanu nāma sabbabhakkhena bhavitabbaṃ ñāṇaparipākaṃ āgamayamānenā’’ti? ‘‘Dasa kho panime, mahārāja, puggalā lokasmiṃ oññātā avaññātā hīḷitā khīḷitā garahitā paribhūtā acittīkatā. Katame dasa? Itthī, mahārāja, vidhavā lokasmiṃ oññātā avaññātā hīḷitā khīḷitā garahitā paribhūtā acittīkatā. Dubbalo, mahārāja, puggalo…pe… amittañāti, mahārāja, puggalo…pe… mahagghaso, mahārāja, puggalo…pe… agarukulavāsiko, mahārāja, puggalo…pe… pāpamitto, mahārāja, puggalo…pe… dhanahīno, mahārāja, puggalo…pe… ācārahīno, mahārāja, puggalo…pe… kammahīno, mahārāja, puggalo…pe… payogahīno, mahārāja, puggalo lokasmiṃ oññāto avaññāto hīḷito khīḷito garahito paribhūto acittīkato. Ime kho, mahārāja, dasa puggalā lokasmiṃ oññātā avaññātā hīḷitā khīḷitā garahitā paribhūtā acittīkatā. Imāni kho, mahārāja, dasa ṭhānāni anussaramānassa bodhisattassa evaṃ saññā uppajji ‘māhaṃ kammahīno assaṃ payogahīno garahito devamanussānaṃ, yaṃnūnāhaṃ kammassāmī assaṃ kammagaru kammādhipateyyo kammasīlo kammadhorayho kammaniketavā appamatto vihareyya’nti, evaṃ kho, mahārāja, bodhisatto ñāṇaṃ paripācento dukkarakārikaṃ akāsī’’ti. ‘‘Bhante nāgasena, bodhisatto dukkarakārikaṃ karonto evamāha ‘na kho panāhaṃ imāya kaṭukāya dukkarakārikāya adhigacchāmi uttarimanussadhammaṃ alamariyañāṇadassanavisesaṃ, siyā nu kho añño maggo bodhāyā’ti. Api nu tasmiṃ samaye bodhisattassa maggaṃ ārabbha satisammoso ahosī’’ti? ‘‘Pañcavīsati kho panime, mahārāja, cittadubbalīkaraṇā dhammā, yehi dubbalīkataṃ cittaṃ na sammā samādhiyati āsavānaṃ khayāya. Katame pañcavīsati? Kodho, mahārāja, cittadubbalīkaraṇo dhammo, yena dubbalīkataṃ cittaṃ na sammā samādhiyati āsavānaṃ khayāya, upanāho…pe… makkho…pe… paḷāso… pe… issā…pe… macchariyaṃ…pe… māyā…pe… sāṭheyyaṃ…pe… thambho…pe… sārambho…pe… māno…pe… atimāno …pe… mado…pe… pamādo…pe… thinamiddhaṃ…pe… tandi [nandī (pī. ka.)] … pe… ālasyaṃ…pe… pāpamittatā…pe… rūpā…pe… saddā…pe… gandhā…pe… rasā…pe… phoṭṭhabbā… pe… khudāpipāsā…pe… arati, mahārāja, cittadubbalīkaraṇo dhammo, yena dubbalīkataṃ cittaṃ na sammā samādhiyati āsavānaṃ khayāya. Ime kho, mahārāja, pañcavīsati cittadubbalīkaraṇā dhammā, yehi dubbalīkataṃ cittaṃ na sammā samādhiyati āsavānaṃ khayāya. Bodhisattassa kho, mahārāja, khudāpipāsā [khudāpipāsā (sī. pī. ka.)] kāyaṃ pariyādiyiṃsu, kāye pariyādinne cittaṃ na sammā samādhiyati āsavānaṃ khayāya. Satasahassaṃ, mahārāja, kappānaṃ [kappe (ka.)] caturo ca asaṅkhyeyye kappe bodhisatto catunnaṃ yeva ariyasaccānaṃ abhisamayaṃ anvesi tāsu tāsu jātīsu, kiṃ panassa pacchime bhave abhisamayajātiyaṃ maggaṃ ārabbha satisammoso hessati? Api ca, mahārāja, bodhisattassa saññāmattaṃ uppajji ‘siyā nu kho añño maggo bodhāyā’ti. Pubbe kho, mahārāja, bodhisatto ekamāsiko samāno pitu sakkassa kammante sītāya jambucchāyāya sirisayane pallaṅkaṃ ābhujitvā nisinno vivicceva kāmehi vicicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja vihāsi…pe… catutthaṃ jhānaṃ upasampajja vihāsī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmi, ñāṇaṃ paripācento bodhisatto dukkarakārikaṃ akāsī’’ti. Dukkarakārikapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Kusalākusalabalavatarapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, katamaṃ adhimattaṃ balavataraṃ kusalaṃ vā akusalaṃ vā’’ti? ‘‘Kusalaṃ, mahārāja, adhimattaṃ balavataraṃ, no tathā akusala’nti. ‘‘Nāhaṃ, bhante nāgasena, taṃ vacanaṃ sampaṭicchāmi ‘kusalaṃ adhimattaṃ balavataraṃ, no tathā akusala’nti, dissanti, bhante nāgasena, idha pāṇātipātino adinnādāyino kāmesumicchācārino musāvādino gāmaghātikā panthadūsakā nekatikā vañcanikā, sabbe te tāvatakena pāpena labhanti hatthacchedaṃ pādacchedaṃ hatthapādacchedaṃ kaṇṇacchedaṃ nāsacchedaṃ kaṇṇanāsacchedaṃ bilaṅgathālikaṃ saṅkhamuṇḍikaṃ rāhumukhaṃ jotimālikaṃ hatthapajjotikaṃ erakavattikaṃ cīrakavāsikaṃ eṇeyyakaṃ baḷisamaṃsikaṃ kahāpaṇikaṃ khārāpatacchikaṃ palighaparivattikaṃ palālapīṭhakaṃ tattenapi telena osiñcanaṃ sunakhehipi khādāpanaṃ jīvasūlāropanaṃ asināpi sīsacchedaṃ, keci rattiṃ pāpaṃ katvā rattiṃ yeva vipākaṃ anubhavanti, keci rattiṃ katvā divā yeva anubhavanti, keci divā katvā divā yeva anubhavanti, keci divā katvā rattiṃ yeva anubhavanti, keci dve tayo divase vītivatte anubhavanti, sabbepi te diṭṭheva dhamme vipākaṃ anubhavanti. Atthi pana, bhante nāgasena, koci ekassa vā dvinnaṃ vā tiṇṇaṃ vā catunnaṃ vā pañcannaṃ vā dasannaṃ vā satassa vā sahassassa vā satasahassassa vā saparivāraṃ dānaṃ datvā diṭṭhadhammikaṃ bhogaṃ vā yasaṃ vā sukhaṃ vā anubhavitā sīlena vā uposathakammena vā’’ti? ‘‘Atthi, mahārāja, cattāro purisā dānaṃ datvā sīlaṃ samādiyitvā uposathakammaṃ katvā diṭṭheva dhamme teneva sarīradehena tidasapure samanuppattā’’ti [yasamanupattāti (sī. pī.)]. ‘‘Ko ca ko ca bhante’’ti? ‘‘Mandhātā, mahārāja, rājā, nimi rājā, sādhīno rājā, guttilo ca gandhabbo’’ti. ‘‘Bhante nāgasena, anekehi taṃ bhavasahassehi antaritaṃ, dvinnampetaṃ amhākaṃ [dīpitaṃ, amhākampetaṃ (ka.)] parokkhaṃ, yadi samatthosi vattamānake bhave bhagavato dharamānakāle kathehī’’ti? ‘‘Vattamānakepi, mahārāja, bhave puṇṇako dāso therassa sāriputtassa bhojanaṃ datvā tadaheva seṭṭhiṭṭhānaṃ ajjhupagato, so etarahi puṇṇako seṭṭhīti paññāyi, gopālamātā devī attano kese vikkiṇitvā laddhehi aṭṭhahi kahāpaṇehi therassa mahākaccāyanassa attaṭṭhamakassa piṇḍapātaṃ datvā tadaheva rañño candapajjotassa [udenassa (sī. pī.)] aggamahesiṭṭhānaṃ pattā. Suppiyā upāsikā aññatarassa gilānabhikkhuno attano ūrumaṃsena paṭicchādanīyaṃ datvā dutiyadivase yeva rūḷhavaṇā sañchavī [sacchavī (sī. pī.)] arogā jātā. Mallikā devī bhagavato ābhidosikaṃ kummāsapiṇḍaṃ datvā tadaheva rañño kosalassa aggamahesī jātā. Sumano mālākāro aṭṭhahi sumanapupphamuṭṭhīhi bhagavantaṃ pūjetvā taṃ divasaṃ yeva mahāsampattiṃ patto. Ekasāṭako brāhmaṇo uttarasāṭakena bhagavantaṃ pūjetvā taṃ divasaṃ yeva sabbaṭṭhakaṃ labhi, sabbepete, mahārāja, diṭṭhadhammikaṃ bhogañca yasañca anubhaviṃsū’’ti. ‘‘Bhante nāgasena, vicinitvā pariyesitvā cha jane yeva addasāsī’’ti. ‘‘Āma, mahārājā’’ti. ‘‘Tena hi, bhante nāgasena, akusalaṃ yeva adhimattaṃ balavataraṃ, no tathā kusalaṃ. Ahañhi, bhante nāgasena, ekadivasaṃ yeva dasapi purise passāmi pāpassa kammassa vipākena sūlesu āropente, vīsampi tiṃsampi cattālīsampi paññāsampi purisasatampi purisasahassampi passāmi pāpassa kammassa vipākena sūlesu āropente. Nandakulassa, bhante nāgasena, bhaddasālo nāma senāpatiputto ahosi. Tena ca raññā candaguttena saṅgāmo samupabyūḷho ahosi. Tasmiṃ kho pana, bhante nāgasena, saṅgāme ubhato balakāye asītikabandharūpāni ahesuṃ, ekasmiṃ kira sīsakabandhe paripāte [paripuṇṇe (sabbattha)] ekaṃ kabandharūpaṃ uṭṭhahati, sabbepete pāpasseva kammassa vipākena anayabyasanaṃ āpannā. Imināpi, bhante nāgasena, kāraṇena bhaṇāmi akusalaṃ yeva adhimattaṃ balavataraṃ, no tathā kusala’’nti. ‘‘Suyyati, bhante nāgasena, imasmiṃ buddhasāsane kosalena raññā asadisadānaṃ dinna’’nti? ‘‘Āma, mahārāja, suyyatī’’ti. ‘‘Api nu kho, bhante nāgasena, kosalarājā taṃ asadisaṃ dānaṃ datvā tatonidānaṃ kañci diṭṭhadhammikaṃ bhogaṃ vā yasaṃ vā sukhaṃ vā paṭilabhī’’ti [paṭilabhatīti (ka.)]? ‘‘Na hi, mahārājā’’ti. ‘‘Yadi, bhante nāgasena, kosalarājā evarūpaṃ anuttaraṃ dānaṃ datvāpi na labhi [na labhati (ka.)] tatonidānaṃ kañci diṭṭhadhammikaṃ bhogaṃ vā yasaṃ vā sukhaṃ vā, tena hi, bhante nāgasena, akusalaṃ yeva adhimattaṃ balavataraṃ, no tathā kusala’’nti. ‘‘Parittattā, mahārāja, akusalaṃ khippaṃ pariṇamati, vipulattā kusalaṃ dīghena kālena pariṇamati, upamāyapi, mahārāja, etaṃ upaparikkhitabbaṃ. Yathā, mahārāja, aparante janapade kumudabhaṇḍikā nāma dhaññajāti māsalūnā [māsapūrā (ka.)] antogehagatā hoti, sālayo chappañcamāsehi pariṇamanti, kiṃ panettha, mahārāja, antaraṃ ko viseso kumudabhaṇḍikāya ca sālīnañcā’’ti? ‘‘Parittattā, bhante, kumudabhaṇḍikāya, vipulattā ca sālīnaṃ. Sālayo, bhante nāgasena, rājārahā rājabhojanaṃ, kumudabhaṇḍikā dāsakammakarānaṃ bhojana’’nti. ‘‘Evameva kho, mahārāja, parittattā akusalaṃ khippaṃ pariṇamati, vipulattā kusalaṃ dīghena kālena pariṇamatī’’ti. ‘‘Yaṃ tattha, bhante nāgasena, khippaṃ pariṇamati, taṃ nāma loke adhimattaṃ balavataraṃ, tasmā akusalaṃ balavataraṃ, no tathā kusalaṃ. Yathā nāma, bhante nāgasena, yo koci yodho mahatimahāyuddhaṃ pavisitvā paṭisattuṃ upakacchake gahetvā ākaḍḍhitvā khippataraṃ sāmino upaneyya, so yodho loke samattho sūro nāma. Yo ca bhisakko khippaṃ sallaṃ uddharati rogamapaneti, so bhisakko cheko nāma. Yo gaṇako sīghasīghaṃ gaṇetvā khippaṃ dassayati, so gaṇako cheko nāma. Yo mallo khippaṃ paṭimallaṃ ukkhipitvā uttānakaṃ pāteti, so mallo samattho sūro nāma. Evameva kho, bhante nāgasena, yaṃ khippaṃ pariṇamati kusalaṃ vā akusalaṃ vā, taṃ loke adhimattaṃ balavatara’’nti. ‘‘Ubhayampi taṃ, mahārāja, kammaṃ samparāyavedanīyameva, api ca kho akusalaṃ sāvajjatāya khaṇena diṭṭhadhammavedanīyaṃ hoti, pubbakehi, mahārāja, khattiyehi ṭhapito eso niyamo ‘yo pāṇaṃ hanati, so daṇḍāraho…pe… yo adinnaṃ ādiyati…pe… yo paradāraṃ gacchati…pe… yo musā bhaṇati…pe… yo gāmaṃ ghāteti…pe… yo panthaṃ dūseti…pe… yo nikatiṃ karoti…pe… yo vañcanaṃ karoti, so daṇḍāraho vadhitabbo chettabbo bhettabbo hantabbo’ti. Taṃ te upādāya vicinitvā vicinitvā daṇḍenti vadhenti chindanti bhindanti hananti ca, api nu, mahārāja, atthi kehici ṭhapito niyamo ‘yo dānaṃ vā deti, sīlaṃ vā rakkhati, uposathakammaṃ vā karoti, tassa dhanaṃ vā yasaṃ vā dātabba’nti; api nu taṃ vicinitvā vicinitvā dhanaṃ vā yasaṃ vā denti, corassa katakammassa vadhabandhanaṃ viyā’’ti? ‘‘Na hi, bhante’’ti. ‘‘Yadi, mahārāja, dāyakānaṃ vicinitvā vicinitvā dhanaṃ vā yasaṃ vā dadeyyuṃ, kusalampi diṭṭhadhammavedanīyaṃ bhaveyya, yasmā ca kho, mahārāja, dāyake na vicinanti ‘dhanaṃ vā yasaṃ vā dassāmā’ti, tasmā kusalaṃ na diṭṭhadhammavedanīyaṃ. Iminā, mahārāja, kāraṇena akusalaṃ diṭṭhadhammavedanīyaṃ, samparāyeva so adhimattaṃ balavataraṃ vedanaṃ vedayatī’’ti. ‘‘Sādhu, bhante nāgasena, tavādisena buddhimantena vinā neso pañho sunibbeṭhiyo, lokikaṃ, bhante nāgasena, lokuttarena viññāpita’’nti. Kusalākusalabalavatarapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Pubbapetādisapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, ime dāyakā dānaṃ datvā pubbapetānaṃ ādisanti [uddisanti (ka. sī.)] ‘idaṃ tesaṃ pāpuṇātū’ti, api nu te kiñci tatonidānaṃ vipākaṃ paṭilabhantī’’ti? ‘‘Keci, mahārāja, paṭilabhanti, keci nappaṭilabhantī’’ti. ‘‘Ke, bhante, paṭilabhanti, ke nappaṭilabhantī’’ti? ‘‘Nirayūpapannā, mahārāja, nappaṭilabhanti, saggagatā nappaṭilabhanti, tiracchānayonigatā nappaṭilabhanti, catunnaṃ petānaṃ tayo petā nappaṭilabhanti vantāsikā khuppipāsino nijjhāmataṇhikā, labhanti petā paradattūpajīvino, tepi saramānā yeva labhantī’’ti. ‘‘Tena hi, bhante nāgasena, dāyakānaṃ dānaṃ visositaṃ [visotaṃ (sī. pī.)] hoti aphalaṃ, yesaṃ uddissa kataṃ yadi te nappaṭilabhantī’’ti? ‘‘Na hi taṃ, mahārāja, dānaṃ aphalaṃ hoti avipākaṃ, dāyakā yeva tassa phalaṃ anubhavantī’’ti. ‘‘Tena hi, bhante nāgasena, kāraṇena maṃ saññāpehī’’ti. ‘‘Idha, mahārāja, keci manussā macchamaṃsasurābhattakhajjakāni paṭiyādetvā ñātikulaṃ gacchanti, yadi te ñātakā taṃ upāyanaṃ na sampaṭiccheyyuṃ, api nu taṃ upāyanaṃ visositaṃ gaccheyya vinasseyya vā’’ti? ‘‘Na hi, bhante, sāmikānaṃ yeva taṃ hotī’’ti. ‘‘Evameva kho, mahārāja, dāyakā yeva tassa phalaṃ anubhavanti. Yathā pana, mahārāja, puriso gabbhaṃ paviṭṭho asati purato nikkhamanamukhe kena nikkhameyyā’’ti. ‘‘Paviṭṭheneva bhante’’ti. ‘‘Evameva kho, mahārāja, dāyakā yeva tassa phalaṃ anubhavantī’’ti. ‘‘Hotu, bhante nāgasena, evametaṃ tathā sampaṭicchāmi, dāyakā yeva tassa phalaṃ anubhavanti, na mayaṃ taṃ kāraṇaṃ vilomemāti. ‘‘Bhante nāgasena, yadi imesaṃ dāyakānaṃ dinnadānaṃ pubbapetānaṃ pāpuṇāti, te ca tassa vipākaṃ anubhavanti. Tena hi yo pāṇātipātī luddo lohitapāṇī paduṭṭhamanasaṅkappo manusse ghātetvā dāruṇaṃ kammaṃ katvā pubbapetānaṃ ādiseyya ‘imassa me kammassa vipāko pubbapetānaṃ pāpuṇātū’ti, api nu tassa vipāko pubbapetānaṃ pāpuṇātī’’ti? ‘‘Na hi, mahārājā’’ti. ‘‘Bhante nāgasena, ko tattha hetu kiṃ kāraṇaṃ, yena kusalaṃ pāpuṇāti akusalaṃ na pāpuṇātī’’ti? ‘‘Neso, mahārāja, pañho pucchitabbo, mā ca tvaṃ, mahārāja, ‘visajjako atthī’ti apucchitabbaṃ pucchi, ‘kissa ākāso nirālambo, kissa gaṅgā uddhammukhā na sandati, kissa ime manussā ca dijā ca dvipadā migā catuppadā’ti tampi maṃ tvaṃ pucchissasī’’ti. ‘‘Nāhaṃ taṃ, bhante nāgasena, vihesāpekkho pucchāmi, api ca nibbāhanatthāya [nibbānatthāya (ka.)] sandehassa pucchāmi, bahū manussā loke vāmagāmino [pāpagāhino (syā.)] vicakkhukā, ‘kinti te otāraṃ na labheyyu’nti evāhaṃ taṃ pucchāmī’’ti. ‘‘Na sakkā, mahārāja, saha akatena ananumatena saha pāpaṃ kammaṃ saṃvibhajituṃ. ‘‘Yathā, mahārāja, manussā udakanibbāhanena udakaṃ suvidūrampi haranti, api nu, mahārāja, sakkā ghanamahāselapabbato [pabbatato (ka.)] nibbāhanena yathicchitaṃ haritu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, sakkā kusalaṃ saṃvibhajituṃ, na sakkā akusalaṃ saṃvibhajituṃ. Yathā vā pana, mahārāja, sakkā telena padīpo jāletuṃ, api nu, mahārāja, sakkā udakena padīpo jāletu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, sakkā kusalaṃ saṃvibhajituṃ, na sakkā akusalaṃ saṃvibhajituṃ. Yathā vā pana, mahārāja, kassakā taḷākato udakaṃ nīharitvā dhaññaṃ paripācenti, api nu kho, mahārāja, sakkā mahāsamuddato udakaṃ nīharitvā dhaññaṃ paripācetu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Evameva kho, mahārāja, sakkā kusalaṃ saṃvibhajituṃ, na sakkā akusalaṃ saṃvibhajitu’’nti. ‘‘Bhante nāgasena, kena kāraṇena sakkā kusalaṃ saṃvibhajituṃ, na sakkā akusalaṃ saṃvibhajituṃ. Kāraṇena maṃ saññāpehi, nāhaṃ andho anāloko sutvā vedissāmī’’ti. ‘‘Akusalaṃ, mahārāja, thokaṃ, kusalaṃ bahukaṃ, thokattā akusalaṃ kattāraṃ yeva pariyādiyati, bahukattā kusalaṃ sadevakaṃ lokaṃ ajjhottharatī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, parittaṃ ekaṃ udakabindu pathaviyaṃ nipateyya, api nu kho taṃ, mahārāja, udakabindu dasapi dvādasapi yojanāni ajjhotthareyyā’’ti? ‘‘Na hi, bhante, yattha taṃ udakabindu nipatitaṃ, tattheva pariyādiyatī’’ti. ‘‘Kena kāraṇena, mahārājā’’ti? ‘‘Parittattā, bhante, udakabindussā’’ti. ‘‘Evameva kho, mahārāja, parittaṃ akusalaṃ parittattā kattāraṃ yeva pariyādiyati, na sakkā saṃvibhajituṃ. ‘‘Yathā vā pana, mahārāja, mahatimahāmegho abhivasseyya tappayanto dharaṇitalaṃ, api nu kho so, mahārāja, mahāmegho samantato otthareyyā’’ti. ‘‘Āma, bhante, pūrayitvā so mahāmegho sobbhasara saritasākhākandarapadaradahataḷāka [mātikātaḷāka (ka.)] udapānapokkharaṇiyo dasapi dvādasapi yojanāni ajjhotthareyyā’’ti. ‘‘Kena kāraṇena, mahārājā’’ti? ‘‘Mahantattā, bhante, meghassā’’ti. ‘‘Evameva kho, mahārāja, kusalaṃ bahukaṃ, bahukattā sakkā devamanussehipi saṃvibhajitu’’nti. ‘‘Bhante nāgasena, kena kāraṇena akusalaṃ thokaṃ kusalaṃ bahutara’’nti? ‘‘Idha, mahārāja, yo koci dānaṃ deti, sīlaṃ samādiyati, uposathakammaṃ karoti, so haṭṭho pahaṭṭho hasito pamudito pasannamānaso vedajāto hoti, tassa aparāparaṃ pīti uppajjati, pītimanassa bhiyyo bhiyyo kusalaṃ pavaḍḍhati. ‘‘Yathā, mahārāja, udapāne bahusalilasampuṇṇe ekena desena udakaṃ paviseyya, ekena nikkhameyya, nikkhamantepi aparāparaṃ uppajjati, na sakkā hoti khayaṃ pāpetuṃ. Evameva kho, mahārāja, kusalaṃ bhiyyo bhiyyo pavaḍḍhati. Vassasatepi ce, mahārāja, puriso kataṃ kusalaṃ āvajjeyya, āvajjite āvajjite bhiyyo bhiyyo kusalaṃ pavaḍḍhati. Tassa taṃ kusalaṃ sakkā hoti yathicchakehi saddhiṃ saṃvibhajituṃ, idamettha, mahārāja, kāraṇaṃ, yena kāraṇena kusalaṃ bahutaraṃ. ‘‘Akusalaṃ pana, mahārāja, karonto pacchā vippaṭisārī hoti, vippaṭisārino cittaṃ paṭilīyati paṭikuṭati paṭivattati na sampasārīyati socati tappati hāyati khīyati na parivaḍḍhati tattheva pariyādiyati. Yathā, mahārāja, sukkhāya nadiyā mahāpuḷināya unnatāvanatāya kuṭilasaṅkuṭilāya uparito parittaṃ udakaṃ āgacchantaṃ hāyati khīyati na parivaḍḍhati tattheva pariyādiyati. Evameva kho, mahārāja, akusalaṃ karontassa cittaṃ paṭilīyati paṭikuṭati paṭivattati na sampasārīyati socati tappati hāyati khīyati na parivaḍḍhati tattheva pariyādiyati, idamettha, mahārāja, kāraṇaṃ, yena kāraṇena akusalaṃ thoka’’nti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Pubbapetādisapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Supinapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, imasmiṃ loke naranāriyo supinaṃ passanti kalyāṇampi pāpakampi, diṭṭhapubbampi adiṭṭhapubbampi, katapubbampi akatapubbampi, khemampi sabhayampi, dūrepi santikepi, bahuvidhānipi anekavaṇṇasahassāni dissanti, kiñcetaṃ supinaṃ nāma, ko cetaṃ passatī’’ti? ‘‘Nimittametaṃ, mahārāja, supinaṃ nāma, yaṃ cittassa āpāta [āpātha (sī. pī.)] mupagacchati. Chayime, mahārāja, supinaṃ passanti, vātiko supinaṃ passati, pittiko supinaṃ passati, semhiko supinaṃ passati, devatūpasaṃhārato supinaṃ passati, samudāciṇṇato supinaṃ passati, pubbanimittato supinaṃ passati, tatra, mahārāja, yaṃ pubbanimittato supinaṃ passati, taṃ yeva saccaṃ, avasesaṃ micchā’’ti. ‘‘Bhante nāgasena, yo pubbanimittato supinaṃ passati, kiṃ tassa cittaṃ sayaṃ gantvā taṃ nimittaṃ vicināti, taṃ vā nimittaṃ cittassa āpātamupagacchati, añño vā āgantvā tassa ārocetī’’ti? ‘‘Na, mahārāja, tassa cittaṃ sayaṃ gantvā taṃ nimittaṃ vicināti, nāpi añño koci āgantvā tassa āroceti, atha kho taṃ yeva nimittaṃ cittassa āpātamupagacchati. Yathā, mahārāja, ādāso na sayaṃ kuhiñci gantvā chāyaṃ vicināti, nāpi añño koci chāyaṃ ānetvā ādāsaṃ āropeti [āroceti (ka.)], atha kho yato kutoci chāyā āgantvā ādāsassa āpātamupagacchati, evameva kho, mahārāja, na tassa cittaṃ sayaṃ gantvā taṃ nimittaṃ vicināti, nāpi añño koci āgantvā āroceti, atha kho yato kutoci nimittaṃ āgantvā cittassa āpātamupagacchatī’’ti. ‘‘Bhante nāgasena, yaṃ taṃ cittaṃ supinaṃ passati, api nu taṃ cittaṃ jānāti ‘evaṃ nāma vipāko bhavissati khemaṃ vā bhayaṃ vā’ti? ‘‘Na hi, mahārāja, taṃ cittaṃ jānāti ‘evaṃvipāko bhavissati khemaṃ vā bhayaṃ vā’ti, nimitte pana uppanne aññesaṃ katheti, tato te atthaṃ kathentī’’ti. ‘‘Iṅgha, bhante nāgasena, kāraṇaṃ me dassehī’’ti. ‘‘Yathā, mahārāja, sarīre tilakā pīḷakā daddūni uṭṭhahanti lābhāya vā alābhāya vā, yasāya vā ayasāya vā, nindāya vā pasaṃsāya vā, sukhāya vā dukkhāya vā, api nu tā, mahārāja, pīḷakā jānitvā uppajjanti ‘imaṃ nāma mayaṃ atthaṃ nipphādessāmā’’’ti? ‘‘Na hi, bhante, yādise tā okāse pīḷakā sambhavanti, tattha tā pīḷakā disvā nemittakā byākaronti ‘evaṃ nāma vipāko bhavissatī’’’ti. ‘‘Evameva kho, mahārāja, yaṃ taṃ cittaṃ supinaṃ passati, na taṃ cittaṃ jānāti ‘evaṃ nāma vipāko bhavissati khemaṃ vā bhayaṃ vā’ti, nimitte pana uppanne aññesaṃ katheti, tato te atthaṃ kathentī’’ti. ‘‘Bhante nāgasena, yo supinaṃ passati, so niddāyanto, udāhu jāgaranto [jagganto (sī. pī.)] passatī’’ti? ‘‘Yo so, mahārāja, supinaṃ passati, na so niddāyanto passati, nāpi jāgaranto passati. Api ca okkante middhe asampatte bhavaṅge etthantare supinaṃ passati. Middhasamārūḷhassa, mahārāja, cittaṃ bhavaṅgagataṃ hoti, bhavaṅgagataṃ cittaṃ nappavattati, appavattaṃ cittaṃ sukhadukkhaṃ nappajānāti, appaṭivijānantassa supino na hoti, pavattamāne citte supinaṃ passati. ‘‘Yathā, mahārāja, timire andhakāre appabhāse suparisuddhepi ādāse chāyā na dissati, evameva kho, mahārāja, middhasamārūḷhe citte bhavaṅgagate tiṭṭhamānepi sarīre cittaṃ appavattaṃ hoti, appavatte citte supinaṃ na passati. Yathā, mahārāja, ādāso, evaṃ sarīraṃ daṭṭhabbaṃ; yathā andhakāro, evaṃ middhaṃ daṭṭhabbaṃ; yathā āloko, evaṃ cittaṃ daṭṭhabbaṃ. ‘‘Yathā vā pana, mahārāja, mahikotthaṭassa sūriyassa pabhā na dissati santā yeva sūriyarasmi appavattā hoti, appavattāya sūriyarasmiyā āloko na hoti, evameva kho, mahārāja, middhasamārūḷhassa cittaṃ bhavaṅgagataṃ hoti, bhavaṅgagataṃ cittaṃ nappavattati, appavatte citte supinaṃ na passati. Yathā, mahārāja, sūriyo, evaṃ sarīraṃ daṭṭhabbaṃ; yathā mahikottharaṇaṃ, evaṃ middhaṃ daṭṭhabbaṃ; yathā sūriyarasmi, evaṃ cittaṃ daṭṭhabbaṃ. ‘‘Dvinnaṃ, mahārāja, santepi sarīre cittaṃ appavattaṃ hoti, middhasamārūḷhassa bhavaṅgagatassa santepi sarīre cittaṃ appavattaṃ hoti, nirodhasamāpannassa santepi sarīre cittaṃ appavattaṃ hoti, jāgarantassa, mahārāja, cittaṃ lolaṃ hoti vivaṭaṃ pākaṭaṃ anibaddhaṃ, evarūpassa citte nimittaṃ āpātaṃ na upeti. Yathā, mahārāja, purisaṃ vivaṭaṃ pākaṭaṃ akiriyaṃ arahassaṃ rahassakāmā parivajjenti, evameva kho, mahārāja, jāgarantassa dibbo attho āpātaṃ na upeti, tasmā jāgaranto supinaṃ na passati. Yathā vā pana, mahārāja, bhikkhuṃ bhinnājīvaṃ anācāraṃ pāpamittaṃ dussīlaṃ kusītaṃ hīnavīriyaṃ kusalā bodhipakkhiyā dhammā āpātaṃ na upenti, evameva kho, mahārāja, jāgarantassa dibbo attho āpātaṃ na upeti, tasmā jāgaranto supinaṃ na passatī’’ti. ‘‘Bhante nāgasena, atthi middhassa ādimajjhapariyosāna’’nti? ‘‘Āma, mahārāja, atthi middhassa ādimajjhapariyosāna’’nti. ‘‘Katamaṃ ādi, katamaṃ majjhaṃ, katamaṃ pariyosāna’’nti? ‘‘Yo, mahārāja, kāyassa onāho pariyonāho dubbalyaṃ mandatā akammaññatā kāyassa, ayaṃ middhassa ādi; yo, mahārāja, kapiniddāpareto vokiṇṇakaṃ jaggati [vokiṇṇataṃ gacchati (nisya)], idaṃ middhassa majjhaṃ; bhavaṅgagati pariyosanaṃ. Majjhūpagato, mahārāja, kapiniddāpareto supinaṃ passati. Yathā, mahārāja, koci yatacārī samāhitacitto ṭhitadhammo acalabuddhi pahīnakotūhalasaddaṃ vanamajjhogāhitvā sukhumaṃ atthaṃ cintayati, na ca so tattha middhaṃ okkamati, so tattha samāhito ekaggacitto sukhumaṃ atthaṃ paṭivijjhati, evameva kho, mahārāja, jāgaro na middhasamāpanno, majjhūpagato kapiniddāpareto supinaṃ passati. Yathā, mahārāja, kotūhalasaddo, evaṃ jāgaraṃ daṭṭhabbaṃ; yathā vivittaṃ vanaṃ, evaṃ kapiniddāpareto daṭṭhabbo; yathā so kotūhalasaddaṃ ohāya middhaṃ vivajjetvā majjhattabhūto sukhumaṃ atthaṃ paṭivijjhati, evaṃ jāgaro na middhasamāpanno kapiniddāpareto supinaṃ passatī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Supinapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Akālamaraṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, ye te sattā maranti, sabbe te kāle yeva maranti, udāhu akālepi marantī’’ti? ‘‘Atthi, mahārāja, kālepi maraṇaṃ, atthi akālepi maraṇa’’nti. ‘‘Bhante nāgasena, ke kāle maranti, ke akāle marantī’’ti? ‘‘Diṭṭhapubbā pana, mahārāja, tayā ambarukkhā vā jamburukkhā vā, aññasmā vā pana phalarukkhā phalāni patantāni āmāni ca pakkāni cā’’ti? ‘‘Āma, bhante’’ti. ‘‘Yāni tāni, mahārāja, phalāni rukkhato patanti, sabbāni tāni kāle yeva patanti, udāhu akālepī’’ti? ‘‘Yāni tāni, bhante nāgasena, phalāni paripakkāni vilīnāni patanti, sabbāni tāni kāle patanti. Yāni pana tāni avasesāni phalāni tesu kānici kimividdhāni patanti, kānici laguḷahatāni [sakuṇapahatā (syā.), lakuṭahatāni (sī. pī. ka.)] patanti, kānici vātappahatāni patanti, kānici antopūtikāni hutvā patanti, sabbāni tāni akāle patantī’’ti. ‘‘Evameva kho, mahārāja, ye te jarāvegahatā maranti, te yeva kāle maranti, avasesā keci kammappaṭibāḷhā maranti, keci gatippaṭibāḷhā maranti, keci kiriyappaṭibāḷhā marantī’’ti. ‘‘Bhante nāgasena, ye te kammappaṭibāḷhā maranti, yepi te gatippaṭibāḷhā maranti, yepi te kiriyappaṭibāḷhā maranti, yepi te jarāvegappaṭibāḷhā maranti, sabbe te kāle yeva maranti, yopi mātukucchigato marati, so tassa kālo, kāle yeva so marati. Yopi vijātaghare marati, so tassa kālo, sopi kāle yeva marati. Yopi māsiko marati…pe… yopi vassasatiko marati, so tassa kālo, kāle yeva so marati, tena hi, bhante nāgasena, akāle maraṇaṃ nāma na hoti, ye keci maranti, sabbe te kāle yeva marantī’’ti. ‘‘Sattime, mahārāja, vijjamānepi uttariṃ āyusmiṃ akāle maranti. Katame satta? Jighacchito, mahārāja, bhojanaṃ alabhamāno upahatabbhantaro vijjamānepi uttariṃ āyusmiṃ akāle marati, pipāsito, mahārāja, pānīyaṃ alabhamāno parisukkhahadayo vijjamānepi uttariṃ āyusmiṃ akāle marati, ahinā daṭṭho, mahārāja, visavegābhihato tikicchakaṃ alabhamāno vijjamānepi uttariṃ āyusmiṃ akāle marati, visamāsito, mahārāja, ḍayhantesu aṅgapaccaṅgesu agadaṃ alabhamāno vijjamānepi uttariṃ āyusmiṃ akāle marati, aggigato, mahārāja, jhāyamāno nibbāpanaṃ alabhamāno vijjamānepi uttariṃ āyusmiṃ akāle marati, udakagato, mahārāja, patiṭṭhaṃ alabhamāno vijjamānepi uttariṃ āyusmiṃ akāle marati, sattihato, mahārāja, ābādhiko bhisakkaṃ alabhamāno vijjamānepi uttariṃ āyusmiṃ akāle marati, ime kho, mahārāja, satta vijjamānepi uttariṃ āyusmiṃ akāle maranti. Tatrāpāhaṃ, mahārāja, ekaṃsena vadāmi. ‘‘Aṭṭhavidhena, mahārāja, sattānaṃ kālaṅkiriyā hoti, vātasamuṭṭhānena pittasamuṭṭhānena semhasamuṭṭhānena sannipātikena utuvipariṇāmena visamaparihārena opakkamikena kammavipākena, mahārāja, sattānaṃ kālaṅkiriyā hoti. Tatra, mahārāja, yadidaṃ kammavipākena kālaṅkiriyā, sā yeva tattha sāmayikā [sāmāyikā (ka.)] kālaṅkiriyā, avasesā asāmayikā kālaṅkiriyāti. Bhavati ca – ‘‘‘Jighacchāya pipāsāya, ahidaṭṭhā [ahidaṭṭho (sī.), ahinā daṭṭho (pī.)] visena ca; Aggiudakasattīhi, akāle tattha mīyati; Vātapittena semhena, sannipātenutūhi ca; Visamopakkamakammehi, akāle tattha mīyatī’ti. ‘‘Keci, mahārāja, sattā pubbe katena tena tena akusalakammavipākena maranti. Idha, mahārāja, yo pubbe pare jighacchāya māreti, so bahūni vassasatasahassāni jighacchāya paripīḷito chāto parikilanto sukkhamilātahadayo bubhukkhito [sukkhito (sī. pī. ka.)] visukkhito jhāyanto abbhantaraṃ pariḍayhanto jighacchāya yeva marati daharopi majjhimopi mahallakopi, idampi tassa sāmayikamaraṇaṃ. ‘‘Yo pubbe pare pipāsāya māreti, so bahūni vassasatasahassāni peto hutvā nijjhāmataṇhiko samāno lūkho kiso parisukkhitahadayo pipāsāya yeva marati daharopi majjhimopi mahallakopi, idampi tassa sāmayikamaraṇaṃ. ‘‘Yo pubbe pare ahinā ḍaṃsāpetvā māreti, so bahūni vassasatasahassāni ajagaramukheneva ajagaramukhaṃ kaṇhasappamukheneva kaṇhasappamukhaṃ parivattitvā tehi khāyitakhāyito ahīhi daṭṭho yeva marati daharopi majjhimopi mahallakopi, idampi tassa sāmayikamaraṇaṃ. ‘‘Yo pubbe pare visaṃ datvā māreti, so bahūni vassasatasahassāni ḍayhantehi aṅgapaccaṅgehi bhijjamānena sarīrena kuṇapagandhaṃ vāyanto viseneva marati daharopi majjhimopi mahallakopi, idampi tassa sāmayikamaraṇaṃ. ‘‘Yo pubbe pare agginā māreti, so bahūni vassasatasahassāni aṅgārapabbateneva aṅgārapabbataṃ yamavisayeneva yamavisayaṃ parivattitvā daḍḍhavidaḍḍhagatto agginā yeva marati daharopi majjhimopi malallakopi, idampi tassa sāmayikamaraṇaṃ. ‘‘Yo pubbe pare udakena māreti, so bahūni vassasatasahassāni hataviluttabhaggadubbalagatto khubbhitacitto [khubhitacitto (sī. pī.)] udakeneva [udake yeva (bahūsu)] marati daharopi majjhimopi mahallakopi, idampi tassa sāmayikamaraṇaṃ. ‘‘Yo pubbe pare sattiyā māreti, so bahūni vassasatasahassāni chinnabhinnakoṭṭitavikoṭṭito sattimukhasamāhato sattiyā yeva marati daharopi majjhimopi mahallakopi, idampi tassa sāmayikamaraṇaṃ’’. ‘‘Bhante nāgasena, akāle maraṇaṃ atthīti yaṃ vadeti, iṅgha me tvaṃ tattha kāraṇaṃ atidisāti’’. ‘‘Yathā, mahārāja, mahatimahāaggikkhandho ādinnatiṇakaṭṭhasākhāpalāso pariyādinnabhakkho upādānasaṅkhayā nibbāyati, so aggi vuccati ‘anītiko anupaddavo samaye nibbuto nāmā’ti, evameva kho, mahārāja, yo koci bahūni divasasahassāni jīvitvā jarājiṇṇo āyukkhayā anītiko anupaddavo marati, so vuccati ‘samaye maraṇamupagato’ti. ‘‘Yathā vā pana, mahārāja, mahatimahāaggikkhandho ādinnatiṇakaṭṭhasākhāpalāso assa, taṃ apariyādinne yeva tiṇakaṭṭhasākhāpalāse mahatimahāmegho abhippavassitvā nibbāpeyya, api nu kho, mahārāja, mahāaggikkhandho samaye nibbuto nāma hotī’’ti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana so, mahārāja, pacchimo aggikkhandho purimakena aggikkhandhena samasamagatiko nāhosī’’ti? ‘‘Āgantukena, bhante, meghena paṭipīḷito so aggikkhandho asamaye nibbuto’’ti. Evameva kho, mahārāja, yo koci akāle marati, so āgantukena rogena paṭipīḷito vātasamuṭṭhānena vā pittasamuṭṭhānena vā semhasamuṭṭhānena vā sannipātikena vā utupariṇāmajena vā visamaparihārajena vā opakkamikena vā jighacchāya vā pipāsāya vā sappadaṭṭhena vā visamāsitena vā agginā vā udakena vā sattivegappaṭipīḷito vā akāle marati. Idamettha, mahārāja, kāraṇaṃ, yena kāraṇena akāle maraṇaṃ atthi. ‘‘Yathā vā pana, mahārāja, gagane mahatimahāvalāhako uṭṭhahitvā ninnañca thalañca paripūrayanto abhivassati, so vuccati ‘megho anītiko anupaddavo vassatī’ti. Evameva kho, mahārāja, yo koci ciraṃ jīvitvā jarājiṇṇo āyukkhayā anītiko anupaddavo marati, so vuccati ‘samaye maraṇamupagato’ti. ‘‘Yathā vā pana, mahārāja, gagane mahatimahāvalāhako uṭṭhahitvā antarāyeva mahatā vātena abbhatthaṃ gaccheyya, api nu kho so, mahārāja, mahāvalāhako samaye vigato nāma hotī’’ti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana so, mahārāja, pacchimo valāhako purimena valāhakena samasamagatiko nāhosī’’ti? ‘‘Āgantukena, bhante, vātena paṭipīḷito so valāhako asamayappatto yeva vigato’’ti. ‘‘Evameva kho, mahārāja, yo koci akāle marati, so āgantukena rogena paṭipīḷito vātasamuṭṭhānena vā…pe… sattivegappaṭipīḷito vā akāle marati. Idamettha, mahārāja, kāraṇaṃ, yena kāraṇena akāle maraṇaṃ atthīti. ‘‘Yathā vā pana, mahārāja, balavā āsīviso kupito kiñcideva purisaṃ ḍaṃseyya, tassa taṃ visaṃ anītikaṃ anupaddavaṃ maraṇaṃ pāpeyya, taṃ visaṃ vuccati ‘anītikamanupaddavaṃ koṭigata’nti. Evameva kho, mahārāja, yo koci ciraṃ jīvitvā jarājiṇṇo āyukkhayā anītiko anupaddavo marati, so vuccati ‘anītiko anupaddavo jīvitakoṭigato sāmayikaṃ maraṇamupagato’ti. ‘‘Yathā vā pana, mahārāja, balavatā āsīvisena daṭṭhassa antarāyeva āhituṇḍiko agadaṃ datvā avisaṃ kareyya, api nu kho taṃ, mahārāja, visaṃ samaye vigataṃ nāma hotī’’ti? ‘‘Na hi bhante’’ti. ‘‘Kissa pana taṃ, mahārāja, pacchimaṃ visaṃ purimakena visena samasamagatikaṃ nāhosī’’ti? ‘‘Āgantukena, bhante, agadena paṭipīḷitaṃ visaṃ akoṭigataṃ yeva vigata’’nti. ‘‘Evameva kho, mahārāja, yo koci akāle marati, so āgantukena rogena paṭipīḷito vātasamuṭṭhānena vā…pe… sattivegappaṭipīḷito vā akāle marati. Idamettha, mahārāja, kāraṇaṃ, yena kāraṇena akāle maraṇaṃ atthīti. ‘‘Yathā vā pana, mahārāja, issāso saraṃ pāteyya, sace so saro yathāgatigamanapathamatthakaṃ gacchati, so saro vuccati ‘anītiko anupaddavo yathāgatigamanapathamatthakaṃ gato nāmā’ti. Evameva kho, mahārāja, yo koci ciraṃ jīvitvā jarājiṇṇo āyukkhayā anītiko anupaddavo marati, so vuccati ‘anītiko anupaddavo samaye maraṇamupagato’ti. ‘‘Yathā vā pana, mahārāja, issāso saraṃ pāteyya, tassa taṃ saraṃ tasmiṃ yeva khaṇe koci gaṇheyya, api nu kho so, mahārāja, saro yathāgatigamanapathamatthakaṃ gato nāma hotī’’ti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana so, mahārāja, pacchimo saro purimakena sarena samasamagatiko nāhosī’’ti? ‘‘Āgantukena, bhante, gahaṇena tassa sarassa gamanaṃ upacchinna’’nti. ‘‘Evameva kho, mahārāja, yo koci akāle marati, so āgantukena rogena paṭipīḷito vātasamuṭṭhānena vā…pe… sattivegappaṭipīḷito vā akāle marati. Idamettha, mahārāja, kāraṇaṃ, yena kāraṇena akāle maraṇaṃ atthīti. ‘‘Yathā vā pana, mahārāja, yo koci lohamayaṃ bhājanaṃ ākoṭeyya, tassa ākoṭanena saddo nibbattitvā yathāgatigamanapathamatthakaṃ gacchati, so saddo vuccati ‘anītiko anupaddavo yathāgatigamanapathamatthakaṃ gato nāmā’ti. Evameva kho, mahārāja, yo koci bahūni divasasahassāni jīvitvā jarājiṇṇo āyukkhayā anītiko anupaddavo marati, so vuccati ‘anītiko anupaddavo samaye maraṇamupāgato’ti. ‘‘Yathā vā pana, mahārāja, yo koci lohamayaṃ bhājanaṃ ākoṭeyya, tassa ākoṭanena saddo nibbatteyya, nibbatte sadde adūragate koci āmaseyya, saha āmasanena saddo nirujjheyya, api nu kho so, mahārāja, saddo yathāgatigamanapathamatthakaṃ gato nāma hotī’’ti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana, mahārāja, pacchimo saddo purimakena saddena samasamagatiko nāhosī’’ti? ‘‘Āgantukena, bhante, āmasanena so saddo uparato’’ti. ‘‘Evameva kho, mahārāja, yo koci akāle marati, so āgantukena rogena paṭipīḷito vātasamuṭṭhānena vā…pe… sattivegappaṭipīḷito vā akāle marati. Idamettha mahārāja kāraṇaṃ, yena kāraṇena akāle maraṇaṃ atthīti. ‘‘Yathā vā pana, mahārāja, khette suvirūḷhaṃ dhaññabījaṃ sammā pavattamānena vassena otatavitataākiṇṇabahuphalaṃ hutvā [uṭṭhitaākiṇṇabahuphalaṃ bhavitvā (syā.)] sassuṭṭhānasamayaṃ pāpuṇāti, taṃ dhaññaṃ vuccati ‘anītikamanupaddavaṃ samayasampattaṃ nāma hotī’ti. Evameva kho, mahārāja, yo koci bahūni divasasahassāni jīvitvā jarājiṇṇo āyukkhayā anītiko anupaddavo marati, so vuccati ‘anītiko anupaddavo samaye maraṇamupagato’ti. ‘‘Yathā vā pana, mahārāja, khette suvirūḷhaṃ dhaññabījaṃ udakena vikalaṃ mareyya, api nu kho taṃ, mahārāja, dhaññaṃ asamayasampattaṃ nāma hotī’’ti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana taṃ, mahārāja, pacchimaṃ dhaññaṃ purimakena dhaññena samasamagatikaṃ nāhosī’’ti? ‘‘Āgantukena, bhante, uṇhena paṭipīḷitaṃ taṃ dhaññaṃ mata’’nti. ‘‘Evameva kho, mahārāja, yo koci akāle marati, so āgantukena rogena paṭipīḷito vātasamuṭṭhānena vā…pe… sattivegappaṭipīḷito vā akāle marati. Idamettha, mahārāja, kāraṇaṃ, yena kāraṇena akāle maraṇaṃ atthīti. ‘‘Sutapubbaṃ pana tayā, mahārāja, ‘sampannataruṇasassaṃ kimayo uṭṭhahitvā samūlaṃ nāsentī’’’ti? ‘‘Sutapubbañceva taṃ, bhante, amhehi diṭṭhapubbañcā’’ti. ‘‘Kiṃ nu kho taṃ, mahārāja, sassaṃ kāle naṭṭhaṃ, udāhu akāle naṭṭha’’nti? ‘‘Akāle, bhante, yadi kho taṃ, bhante, sassaṃ kimayo na khādeyyuṃ, sassuddharaṇasamayaṃ pāpuṇeyyā’’ti. ‘‘Kiṃ pana, mahārāja, āgantukena upaghātena sassaṃ vinassati, nirupaghātaṃ sassaṃ sassuddharaṇasamayaṃ pāpuṇātī’’ti? ‘‘Āma, bhante’’ti. ‘‘Evameva kho, mahārāja, yo koci akāle marati, so āgantukena rogena paṭipīḷito vātasamuṭṭhānena vā…pe… sattivegappaṭipīḷito vā marati. Idamettha, mahārāja, kāraṇaṃ, yena kāraṇena akāle maraṇaṃ atthīti. ‘‘Sutapubbaṃ pana tayā, mahārāja, ‘sampanne sasse phalabhāranamite mañcaritapatte karakavassaṃ nāma vassajāti nipatitvā vināseti aphalaṃ karotī’ti? ‘‘Sutapubbañceva taṃ, bhante, amhehi diṭṭhapubbañcā’’ti. ‘‘Api nu kho taṃ, mahārāja, sassaṃ kāle naṭṭhaṃ, udāhu akāle naṭṭha’’nti? ‘‘Akāle, bhante, yadi kho taṃ, bhante, sassaṃ karakavassaṃ na vasseyya sassuddharaṇasamayaṃ pāpuṇeyyā’’ti. ‘‘Kiṃ pana, mahārāja, āgantukena upaghātena sassaṃ vinassati, nirupaghātaṃ sassaṃ sassuddharaṇasamayaṃ pāpuṇātī’’ti? ‘‘Āma, bhante’’ti. ‘‘Evameva kho, mahārāja, yo koci akāle marati, so āgantukena rogena paṭipīḷito vātasamuṭṭhānena vā pittasamuṭṭhānena vā semhasamuṭṭhānena vā sannipātikena vā utupariṇāmajena vā visamaparihārajena vā opakkamikena vā jighacchāya vā pipāsāya vā sappadaṭṭhena vā visamāsitena vā agginā vā udakena vā sattivegappaṭipīḷito vā akāle marati. Yadi pana āgantukena rogena paṭipīḷito na bhaveyya, samayeva maraṇaṃ pāpuṇeyya. Idamettha, mahārāja, kāraṇaṃ, yena kāraṇena akāle maraṇaṃ atthī’’ti. ‘‘Acchariyaṃ, bhante nāgasena, abbhutaṃ bhante nāgasena, sudassitaṃ kāraṇaṃ, sudassitaṃ opammaṃ akāle maraṇassa paridīpanāya, ‘atthi akāle maraṇa’nti uttānīkataṃ pākaṭaṃ kataṃ vibhūtaṃ kataṃ, acittavikkhittakopi, bhante nāgasena, manujo ekamekenapi tāva opammena niṭṭhaṃ gaccheyya ‘atthi akāle maraṇa’nti, kiṃ pana manujo sacetano? Paṭhamopammenevāhaṃ, bhante, saññatto ‘atthi akāle maraṇa’nti, api ca aparāparaṃ nibbāhanaṃ sotukāmo na sampaṭicchi’’nti. Akālamaraṇapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Cetiyapāṭihāriyapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, sabbesaṃ parinibbutānaṃ cetiye pāṭihīraṃ hoti, udāhu ekaccānaṃ yeva hotī’’ti? ‘‘Ekaccānaṃ, mahārāja, hoti, ekaccānaṃ na hotī’’ti. ‘‘Katamesaṃ, bhante, hoti, katamesaṃ na hotī’’ti? ‘‘Tiṇṇannaṃ, mahārāja, aññatarassa adhiṭṭhānā parinibbutassa cetiye pāṭihīraṃ hoti. Katamesaṃ tiṇṇannaṃ? Idha, mahārāja, arahā devamanussānaṃ anukampāya tiṭṭhantova adhiṭṭhāti ‘evaṃnāma cetiye pāṭihīraṃ hotū’ti, tassa adhiṭṭhānavasena cetiye pāṭihīraṃ hoti, evaṃ arahato adhiṭṭhānavasena parinibbutassa cetiye pāṭihīraṃ hoti. ‘‘Puna caparaṃ, mahārāja, devatā manussānaṃ anukampāya parinibbutassa cetiye pāṭihīraṃ dassenti ‘iminā pāṭihīrena saddhammo niccasampaggahito bhavissati, manussā ca pasannā kusalena abhivaḍḍhissantī’ti, evaṃ devatānaṃ adhiṭṭhānavasena parinibbutassa cetiye pāṭihīraṃ hoti. ‘‘Puna caparaṃ, mahārāja, itthī vā puriso vā saddho pasanno paṇḍito byatto medhāvī buddhisampanno yoniso cintayitvā gandhaṃ vā mālaṃ vā dussaṃ vā aññataraṃ vā kiñci adhiṭṭhahitvā cetiye ukkhipati ‘evaṃnāma hotū’ti, tassapi adhiṭṭhānavasena parinibbutassa cetiye pāṭihīraṃ hoti, evaṃ manussānaṃ adhiṭṭhānavasena parinibbutassa cetiye pāṭihīraṃ hoti. ‘‘Imesaṃ kho, mahārāja, tiṇṇannaṃ aññatarassa adhiṭṭhānavasena parinibbutassa cetiye pāṭihīraṃ hoti. ‘‘Yadi, mahārāja, tesaṃ adhiṭṭhānaṃ na hoti, khīṇāsavassapi chaḷabhiññassa cetovasippattassa cetiye pāṭihīraṃ na hoti, asatipi, mahārāja, pāṭihīre caritaṃ disvā suparisuddhaṃ okappetabbaṃ niṭṭhaṃ gantabbaṃ saddahitabbaṃ ‘suparinibbuto ayaṃ buddhaputto’’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Cetiyapāṭihāriyapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Dhammābhisamayapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, ye te sammā paṭipajjanti, tesaṃ sabbesaṃ yeva dhammābhisamayo hoti, udāhu kassaci na hotī’’ti? ‘‘Kassaci, mahārāja, hoti, kassaci na hotī’’ti. ‘‘Kassa bhante hoti, kassa na hotī’’ti? ‘‘Tiracchānagatassa, mahārāja, suppaṭipannassāpi dhammābhisamayo na hoti, pettivisayūpapannassa…pe… micchādiṭṭhikassa…pe… kuhakassa…pe… mātughātakassa…pe… pitughātakassa…pe… arahantaghātakassa…pe… saṅghabhedakassa…pe… lohituppādakassa…pe… theyyasaṃvāsakassa…pe… titthiyapakkantassa…pe… bhikkhunidūsakassa…pe… terasannaṃ garukāpattīnaṃ aññataraṃ āpajjitvā avuṭṭhitassa…pe… paṇḍakassa…pe… ubhatobyañjanakassa suppaṭipannassāpi dhammābhisamayo na hoti… pe… yopi manussadaharako ūnakasattavassiko, tassa suppaṭipannassāpi dhammābhisamayo na hoti. Imesaṃ kho, mahārāja, soḷasannaṃ puggalānaṃ suppaṭipannānampi dhammābhisamayo na hotī’’ti. ‘‘Bhante nāgasena, ye te pannarasa puggalā viruddhā yeva, tesaṃ dhammābhisamayo hotu vā mā vā hotu, atha kena kāraṇena manussadaharakassa ūnakasattavassikassa suppaṭipannassāpi dhammābhisamayo na hoti? Ettha tāva pañho bhavati ‘nanu nāma daharakassa na rāgo hoti, na doso hoti, na moho hoti, na māno hoti, na micchādiṭṭhi hoti, na arati hoti, na kāmavitakko hoti, amissito kilesehi, so nāma daharako yutto ca patto ca arahati ca cattāri saccāni ekapaṭivedhena paṭivijjhitu’’’nti. ‘‘Taññevettha, mahārāja, kāraṇaṃ, yenāhaṃ kāraṇena bhaṇāmi ‘ūnakasattavassikassa suppaṭipannassāpi dhammābhisamayo na hotī’ti. Yadi, mahārāja, ūnakasattavassiko rajanīye rajjeyya, dussanīye dusseyya, mohanīye muyheyya, madanīye majjeyya, diṭṭhiṃ vijāneyya, ratiñca aratiñca vijāneyya, kusalākusalaṃ vitakkeyya, bhaveyya tassa dhammābhisamayo, api ca, mahārāja, ūnakasattavassikassa cittaṃ abalaṃ dubbalaṃ parittaṃ appaṃ thokaṃ mandaṃ avibhūtaṃ, asaṅkhatā nibbānadhātu garukā bhārikā vipulā mahatī. Ūnakasattavassiko, mahārāja, tena dubbalena cittena parittakena mandena avibhūtena na sakkoti garukaṃ bhārikaṃ vipulaṃ mahatiṃ asaṅkhataṃ nibbānadhātuṃ paṭivijjhituṃ. ‘‘Yathā, mahārāja, sinerupabbatarājā garuko bhāriko vipulo mahanto, api nu kho taṃ, mahārāja, puriso attano pākatikena thāmabalavīriyena sakkuṇeyya sinerupabbatarājānaṃ uddharitu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Kena kāraṇena mahārājā’’ti? ‘‘Dubbalattā, bhante, purisassa, mahantattā sinerupabbatarājassā’’ti. ‘‘Evameva kho, mahārāja, ūnakasattavassikassa cittaṃ abalaṃ dubbalaṃ parittaṃ appaṃ thokaṃ mandaṃ avibhūtaṃ, asaṅkhatā nibbānadhātu garukā bhārikā vipulā mahatī. Ūnakasattavassiko tena dubbalena cittena parittena mandena avibhūtena na sakkoti garukaṃ bhārikaṃ vipulaṃ mahatiṃ asaṅkhataṃ nibbānadhātuṃ paṭivijjhituṃ, tena kāraṇena ūnakasattavassikassa suppaṭipannassāpi dhammābhisamayo na hoti. ‘‘Yathā vā pana, mahārāja, ayaṃ mahāpathavī dīghā āyatā puthulā vitthatā visālā vitthiṇṇā vipulā mahantā, api nu kho taṃ, mahārāja, mahāpathaviṃ sakkā parittakena udakabindukena temetvā udakacikkhallaṃ kātu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Kena kāraṇena, mahārājā’’ti? ‘‘Parittattā, bhante, udakabindussa, mahantattā mahāpathaviyā’’ti. ‘‘Evameva kho, mahārāja, ūnakasattavassikassa cittaṃ abalaṃ dubbalaṃ parittaṃ appaṃ thokaṃ mandaṃ avibhūtaṃ, asaṅkhatā nibbānadhātu dīghā āyatā puthulā vitthatā visālā vitthiṇṇā vipulā mahantā. Ūnakasattavassiko tena dubbalena cittena parittakena mandena avibhūtena na sakkoti mahatiṃ asaṅkhataṃ nibbānadhātuṃ paṭivijjhituṃ, tena kāraṇena ūnakasattavassikassa suppaṭipannassāpi dhammābhisamayo na hoti. ‘‘Yathā vā pana, mahārāja, abaladubbalaparittaappathokamandaggi bhaveyya, api nu kho, mahārāja, tāvatakena mandena agginā sakkā sadevake loke andhakāraṃ vidhamitvā ālokaṃ dassetu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Kena kāraṇena mahārājā’’ti? ‘‘Mandattā, bhante, aggissa, lokassa mahantattā’’ti. ‘‘Evameva kho, mahārāja, ūnakasattavassikassa cittaṃ abalaṃ dubbalaṃ parittaṃ appaṃ thokaṃ mandaṃ avibhūtaṃ, mahatā ca avijjandhakārena pihitaṃ. Tasmā dukkaraṃ ñāṇālokaṃ dassayituṃ, tena kāraṇena ūnakasattavassikassa suppaṭipannassāpi dhammābhisamayo na hoti. ‘‘Yathā vā pana, mahārāja, āturo kiso aṇuparimitakāyo sālakakimi hatthināgaṃ tidhā pabhinnaṃ navāyataṃ tivitthataṃ dasapariṇāhaṃ aṭṭharatanikaṃ sakaṭṭhānamupagataṃ disvā gilituṃ parikaḍḍheyya, api nu kho so, mahārāja, sālakakimi sakkuṇeyya taṃ hatthināgaṃ gilitu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Kena kāraṇena, mahārājā’’ti? ‘‘Parittattā, bhante, sālakakimissa, mahantattā hatthināgassā’’ti. ‘‘Evameva kho, mahārāja, ūnakasattavassikassa cittaṃ abalaṃ dubbalaṃ parittaṃ appaṃ thokaṃ mandaṃ avibhūtaṃ, mahatī asaṅkhatā nibbānadhātu. So tena dubbalena cittena parittakena mandena avibhūtena na sakkoti mahatiṃ asaṅkhataṃ nibbānadhātuṃ paṭivijjhituṃ, tena kāraṇena ūnakasattavassikassa suppaṭipannassāpi dhammābhisamayo na hotī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Dhammābhisamayapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Ekantasukhanibbānapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Bhante nāgasena, kiṃ ekantasukhaṃ nibbānaṃ, udāhu dukkhena missa’’nti? ‘‘Ekantasukhaṃ, mahārāja, nibbānaṃ, dukkhena amissa’’nti. ‘‘Na mayaṃ taṃ, bhante nāgasena, vacanaṃ saddahāma ‘ekantasukhaṃ nibbāna’nti, evamettha mayaṃ, bhante nāgasena, paccema ‘nibbānaṃ dukkhena missa’nti, kāraṇañcettha upalabhāma ‘nibbānaṃ dukkhena missa’nti. Katamaṃ ettha kāraṇaṃ? Ye te, bhante nāgasena, nibbānaṃ pariyesanti, tesaṃ dissati kāyassa ca cittassa ca ātāpo paritāpo ṭhānacaṅkamanisajjāsayanāhārapariggaho middhassa ca uparodho āyatanānañca paṭipīḷanaṃ dhanadhaññapiyañātimittappajahanaṃ. Ye keci loke sukhitā sukhasamappitā, te sabbepi pañcahi kāmaguṇehi āyatane ramenti brūhenti, manāpikamanāpikabahuvidhasubhanimittena rūpena cakkhuṃ ramenti brūhenti, manāpikamanāpikagītavāditabahuvidhasubhanimittena saddena sotaṃ ramenti brūhenti, manāpikamanāpikapupphaphalapattatacamūlasārabahuvidhasubhanimittena gandhena ghānaṃ ramenti brūhenti, manāpikamanāpikakhajjabhojjaleyyapeyyasāyanīyabahuvidhasubhanimittena rasena jivhaṃ ramenti bruhenti, manāpikamanāpikasaṇhasukhumamudumaddavabahuvidhasubhanimittena phassena kāyaṃ ramenti brūhenti, manāpikamanāpikakalyāṇapāpakasubhāsubhabahuvidhavitakkamanasikārena manaṃ ramenti brūhenti. Tumhe taṃ cakkhusotaghānajivhākāyamanobrūhanaṃ hanatha upahanatha, chindatha upacchindatha, rundhatha uparundhatha. Tena kāyopi paritapati, cittampi paritapati, kāye paritatte kāyikadukkhavedanaṃ vediyati, citte paritatte cetasikadukkhavedanaṃ vedayati. Nanu māgaṇḍiyopi [māgandiyopi (sī. pī.)] paribbājako bhagavantaṃ garahamāno evamāha ‘bhūnahu [bhūtahacco (pī.), bhūnahacco (ka.)] samaṇo gotamo’ti. Idamettha kāraṇaṃ, yenāhaṃ kāraṇena brūmi ‘nibbānaṃ dukkhena missa’’’nti. ‘‘Na hi, mahārāja, nibbānaṃ dukkhena missaṃ, ekantasukhaṃ nibbānaṃ. Yaṃ pana tvaṃ, mahārāja, brūsi ‘nibbānaṃ dukkha’nti, netaṃ dukkhaṃ nibbānaṃ nāma, nibbānassa pana sacchikiriyāya pubbabhāgo eso, nibbānapariyesanaṃ etaṃ, ekantasukhaṃ yeva, mahārāja, nibbānaṃ, na dukkhena missaṃ. Ettha kāraṇaṃ vadāmi. Atthi, mahārāja, rājūnaṃ rajjasukhaṃ nāmā’’ti? ‘‘Āma, bhante, atthi rājūnaṃ rajjasukha’’nti. ‘‘Api nu kho taṃ, mahārāja, rajjasukhaṃ dukkhena missa’’nti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana te, mahārāja, rājāno paccante kupite tesaṃ paccantanissitānaṃ paṭisedhāya amaccehi pariṇāyakehi bhaṭehi balatthehi parivutā pavāsaṃ gantvā ḍaṃsamakasavātātapapaṭipīḷitā samavisame paridhāvanti, mahāyuddhañca karonti, jīvitasaṃsayañca pāpuṇantī’’ti? ‘‘Netaṃ, bhante nāgasena, rajjasukhaṃ nāma, rajjasukhassa pariyesanāya pubbabhāgo eso, dukkhena, bhante nāgasena, rājāno rajjaṃ pariyesitvā rajjasukhaṃ anubhavanti, evaṃ, bhante nāgasena, rajjasukhaṃ dukkhena amissaṃ, aññaṃ taṃ rajjasukhaṃ, aññaṃ dukkha’’nti. ‘‘Evameva kho, mahārāja, ekantasukhaṃ nibbānaṃ, na dukkhena missaṃ. Ye pana taṃ nibbānaṃ pariyesanti, te kāyañca cittañca ātāpetvā ṭhānacaṅkamanisajjāsayanāhāraṃ pariggahetvā middhaṃ uparundhitvā āyatanāni paṭipīḷetvā kāyañca jīvitañca pariccajitvā dukkhena nibbānaṃ pariyesitvā ekantasukhaṃ nibbānaṃ anubhavanti, nihatapaccāmittā viya rājāno rajjasukhaṃ. Evaṃ, mahārāja, ekantasukhaṃ nibbānaṃ, na dukkhena missaṃ, aññaṃ nibbānaṃ, aññaṃ dukkhanti. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi ekantasukhaṃ nibbānaṃ, na dukkhena missaṃ, aññaṃ dukkhaṃ, aññaṃ nibbānanti. Atthi, mahārāja, ācariyānaṃ sippavantānaṃ sippasukhaṃ nāmā’’ti? ‘‘Āma, bhante, atthi ācariyānaṃ sippavantānaṃ sippasukha’’nti. ‘‘Api nu kho taṃ, mahārāja, sippasukhaṃ dukkhena missa’’nti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana te, mahārāja, ācariyā [idaṃ padaṃ sī. pī. potthakesu natthi] ācariyānaṃ abhivādanapaccuṭṭhānena udakāharaṇagharasammajjanadantakaṭṭhamukhodakānuppadānena ucchiṭṭhapaṭiggahaṇaucchādananahāpanapādaparikammena sakacittaṃ nikkhipitvā paracittānuvattanena dukkhaseyyāya visamabhojanena kāyaṃ ātāpentī’’ti? ‘‘Netaṃ, bhante nāgasena, sippasukhaṃ nāma, sippapariyesanāya pubbabhāgo eso, dukkhena, bhante nāgasena, ācariyā sippaṃ pariyesitvā sippasukhaṃ anubhavanti, evaṃ, bhante nāgasena, sippasukhaṃ dukkhena amissaṃ, aññaṃ taṃ sippasukhaṃ, aññaṃ dukkha’’nti. ‘‘Evameva kho, mahārāja, ekantasukhaṃ nibbānaṃ, na dukkhena missaṃ. Ye pana taṃ nibbānaṃ pariyesanti, te kāyañca cittañca ātāpetvā ṭhānacaṅkamanisajjāsayanāhāraṃ pariggahetvā middhaṃ uparundhitvā āyatanāni paṭipīḷetvā kāyañca jīvitañca pariccajitvā dukkhena nibbānaṃ pariyesitvā ekantasukhaṃ nibbānaṃ anubhavanti, ācariyā viya sippasukhaṃ. Evaṃ, mahārāja, ekantasukhaṃ nibbānaṃ, na dukkhena missaṃ, aññaṃ dukkhaṃ, aññaṃ nibbāna’’nti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Ekantasukhanibbānapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Nibbānarūpasaṇṭhānapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Bhante nāgasena, ‘nibbānaṃ nibbāna’nti yaṃ vadesi, sakkā pana tassa nibbānassa rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayitu’’nti? ‘‘Appaṭibhāgaṃ, mahārāja, nibbānaṃ, na sakkā nibbānassa rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayitu’’nti. ‘‘Etampāhaṃ, bhante nāgasena, na sampaṭicchāmi, yaṃ atthidhammassa nibbānassa rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā apaññāpanaṃ, kāraṇena maṃ saññāpehī’’ti. ‘‘Hotu, mahārāja, kāraṇena taṃ saññāpessāmi. Atthi, mahārāja, mahāsamuddo nāmā’’ti? ‘‘Āma, bhante, attheso mahāsamuddo’’ti. ‘‘Sace taṃ, mahārāja, koci evaṃ puccheyya ‘kittakaṃ, mahārāja, mahāsamudde udakaṃ, kati pana te sattā, ye mahāsamudde paṭivasantī’ti, evaṃ puṭṭho tvaṃ, mahārāja, kinti tassa byākareyyāsī’’ti? ‘‘Sace maṃ, bhante, koci evaṃ puccheyya ‘kittakaṃ, mahārāja, mahāsamudde udakaṃ, kati pana te sattā, ye mahāsamudde paṭivasantī’ti, tamahaṃ, bhante, evaṃ vadeyyaṃ ‘apucchitabbaṃ maṃ tvaṃ ambho purisa pucchasi, nesā pucchā kenaci pucchitabbā, ṭhapanīyo eso pañho. Avibhatto lokakkhāyikehi mahāsamuddo, na sakkā mahāsamudde udakaṃ pariminituṃ sattā vā ye tattha vāsamupagatāti evāhaṃ bhante tassa paṭivacanaṃ dadeyya’’’nti. ‘‘Kissa pana, tvaṃ mahārāja, atthidhamme mahāsamudde evaṃ paṭivacanaṃ dadeyyāsi, nanu vigaṇetvā [minitvā (ka.)] tassa ācikkhitabbaṃ ‘ettakaṃ mahāsamudde udakaṃ, ettakā ca sattā mahāsamudde paṭivasantī’’ti? ‘‘Na sakkā, bhante, avisayo eso pañho’’ti. ‘‘Yathā, mahārāja, atthidhamme yeva mahāsamudde na sakkā udakaṃ parigaṇetuṃ [pariminituṃ (ka.)] sattā vā ye tattha vāsamupagatā, evameva kho, mahārāja, atthidhammasseva nibbānassa na sakkā rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayituṃ, vigaṇeyya, mahārāja, iddhimā cetovasippatto mahāsamudde udakaṃ tatrāsaye ca satte, na tveva so iddhimā cetovasippatto sakkuṇeyya nibbānassa rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayituṃ. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, atthidhammasseva nibbānassa na sakkā rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayitunti. Atthi, mahārāja, devesu arūpakāyikā nāma devā’’ti. ‘‘Āma, bhante, suyyati ‘atthi devesu arūpakāyikā nāma devā’’’ti. ‘‘Sakkā pana, mahārāja, tesaṃ arūpakāyikānaṃ devānaṃ rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayitu’’nti? ‘‘Na hi, bhante’’ti. ‘‘Tena hi, mahārāja, natthi arūpakāyikā devā’’ti? ‘‘Atthi, bhante, arūpakāyikā devā, na ca sakkā tesaṃ rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayitu’’nti. ‘‘Yathā, mahārāja, atthisattānaṃ yeva arūpakāyikānaṃ devānaṃ na sakkā rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayituṃ, evameva kho, mahārāja, atthidhammasseva nibbānassa na sakkā rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayitu’’nti. ‘‘Bhante nāgasena, hotu ekantasukhaṃ nibbānaṃ, na ca sakkā tassa rūpaṃ vā saṇṭhānaṃ vā vayaṃ vā pamāṇaṃ vā opammena vā kāraṇena vā hetunā vā nayena vā upadassayituṃ. Atthi pana, bhante, nibbānassa guṇaṃ aññehi anupaviṭṭhaṃ kiñci opammanidassanamatta’’nti? ‘‘Sarūpato, mahārāja, natthi, guṇato pana sakkā kiñci opammanidassanamattaṃ upadassayitu’’nti. ‘‘Sādhu, bhante nāgasena, yathāhaṃ labhāmi nibbānassa guṇatopi ekadesaparidīpanamattaṃ, tathā sīghaṃ brūhi, nibbāpehi me hadayapariḷāhaṃ vinaya sītalamadhuravacanamālutenā’’ti. ‘‘Padumassa, mahārāja, eko guṇo nibbānaṃ anupaviṭṭho, udakassa dve guṇā, agadassa tayo guṇā, mahāsamuddassa cattāro guṇā, bhojanassa pañca guṇā, ākāsassa dasa guṇā, maṇiratanassa tayo guṇā, lohitacandanassa tayo guṇā, sappimaṇḍassa tayo guṇā, girisikharassa pañca guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘padumassa eko guṇo nibbānaṃ anupaviṭṭho’ti yaṃ vadesi, katamo padumassa eko guṇo nibbānaṃ anupaviṭṭho’’ti? ‘‘Yathā, mahārāja, padumaṃ anupalittaṃ udakena, evameva kho, mahārāja, nibbānaṃ sabbakilesehi anupalittaṃ. Ayaṃ, mahārāja, padumassa eko guṇo nibbānaṃ anupaviṭṭho’’ti. ‘‘Bhante nāgasena, ‘udakassa dve guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame udakassa dve guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, udakaṃ sītalaṃ pariḷāhanibbāpanaṃ, evameva kho, mahārāja, nibbānaṃ sītalaṃ sabbakilesapariḷāhanibbāpanaṃ. Ayaṃ, mahārāja, udakassa paṭhamo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, udakaṃ kilantatasitapipāsitaghammābhitattānaṃ janapasupajānaṃ pipāsāvinayanaṃ, evameva kho, mahārāja, nibbānaṃ kāmataṇhābhavataṇhāvibhavataṇhāpipāsāvinayanaṃ. Ayaṃ, mahārāja, udakassa dutiyo guṇo nibbānaṃ anupaviṭṭho. Ime kho, mahārāja, udakassa dve guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘agadassa tayo guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame agadassa tayo guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, agado visapīḷitānaṃ sattānaṃ paṭisaraṇaṃ, evameva kho, mahārāja, nibbānaṃ kilesavisapīḷitānaṃ sattānaṃ paṭisaraṇaṃ. Ayaṃ, mahārāja, agadassa paṭhamo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, agado rogānaṃ antakaro, evameva kho, mahārāja, nibbānaṃ sabbadukkhānaṃ antakaraṃ. Ayaṃ, mahārāja, agadassa dutiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, agado amataṃ, evameva kho, mahārāja, nibbānaṃ amataṃ. Ayaṃ, mahārāja, agadassa tatiyo guṇo nibbānaṃ anupaviṭṭho. Ime kho, mahārāja, agadassa tayo guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘mahāsamuddassa cattāro guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame mahāsamuddassa cattāro guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, mahāsamuddo suñño sabbakuṇapehi, evameva kho, mahārāja, nibbānaṃ suññaṃ sabbakilesakuṇapehi. Ayaṃ, mahārāja, mahāsamuddassa paṭhamo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, mahāsamuddo mahanto anorapāro, na paripūrati sabbasavantīhi, evameva kho, mahārāja, nibbānaṃ mahantaṃ anorapāraṃ, na pūrati sabbasattehi. Ayaṃ, mahārāja, mahāsamuddassa dutiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, mahāsamuddo mahantānaṃ bhūtānaṃ āvāso, evameva kho, mahārāja, nibbānaṃ mahantānaṃ arahantānaṃ vimalakhīṇāsavabalappattavasībhūtamahābhūtānaṃ āvāso. Ayaṃ, mahārāja, mahāsamuddassa tatiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, mahāsamuddo aparimitavividhavipulavīcipupphasaṃkusumito, evameva kho, mahārāja, nibbānaṃ aparimitavividhavipulaparisuddhavijjāvimuttipupphasaṃkusumitaṃ. Ayaṃ, mahārāja, mahāsamuddassa catuttho guṇo nibbānaṃ anupaviṭṭho. Ime kho, mahārāja, mahāsamuddassa cattāro guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘bhojanassa pañca guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame bhojanassa pañca guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, bhojanaṃ sabbasattānaṃ āyudhāraṇaṃ, evameva kho, mahārāja, nibbānaṃ sacchikataṃ jarāmaraṇanāsanato āyudhāraṇaṃ. Ayaṃ, mahārāja, bhojanassa paṭhamo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, bhojanaṃ sabbasattānaṃ balavaḍḍhanaṃ, evameva kho, mahārāja, nibbānaṃ sacchikataṃ sabbasattānaṃ iddhibalavaḍḍhanaṃ. Ayaṃ, mahārāja, bhojanassa dutiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, bhojanaṃ sabbasattānaṃ vaṇṇajananaṃ, evameva kho, mahārāja, nibbānaṃ sacchikataṃ sabbasattānaṃ guṇavaṇṇajananaṃ. Ayaṃ, mahārāja, bhojanassa tatiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, bhojanaṃ sabbasattānaṃ darathavūpasamanaṃ, evameva kho, mahārāja, nibbānaṃ sacchikataṃ sabbasattānaṃ sabbakilesadarathavūpasamanaṃ. Ayaṃ, mahārāja, bhojanassa catuttho guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, bhojanaṃ sabbasattānaṃ jighacchādubbalyapaṭivinodanaṃ, evameva kho, mahārāja, nibbānaṃ sacchikataṃ sabbasattānaṃ sabbadukkhajighacchādubbalyapaṭivinodanaṃ. Ayaṃ, mahārāja, bhojanassa pañcamo guṇo nibbānaṃ anupaviṭṭho. Ime kho, mahārāja, bhojanassa pañca guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘ākāsassa dasa guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame ākāsassa dasa guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, ākāso na jāyati, na jīyati, na mīyati, na cavati, na uppajjati, duppasaho, acorāharaṇo, anissito, vihagagamano, nirāvaraṇo, ananto. Evameva kho, mahārāja, nibbānaṃ na jāyati, na jīyati, na mīyati, na cavati, na uppajjati, duppasahaṃ, acorāharaṇaṃ, anissitaṃ, ariyagamanaṃ, nirāvaraṇaṃ, anantaṃ. Ime kho, mahārāja, ākāsassa dasa guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘maṇiratanassa tayo guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame maṇiratanassa tayo guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, maṇiratanaṃ kāmadadaṃ, evameva kho, mahārāja, nibbānaṃ kāmadadaṃ. Ayaṃ, mahārāja, maṇiratanassa paṭhamo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, maṇiratanaṃ hāsakaraṃ, evameva kho, mahārāja, nibbānaṃ hāsakaraṃ. Ayaṃ, mahārāja, maṇiratanassa dutiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, maṇiratanaṃ ujjotattakaraṃ, evameva kho, mahārāja, nibbānaṃ ujjotattakaraṃ [ujjotatthakaraṃ (sī. pī.), ujjotitatthakaraṃ (syā.)]. Ayaṃ, mahārāja, maṇiratanassa tatiyo guṇo nibbānaṃ anupaviṭṭho. Ime kho, mahārāja, maṇiratanassa tayo guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘lohitacandanassa tayo guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame lohitacandanassa tayo guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, lohitacandanaṃ dullabhaṃ, evameva kho, mahārāja, nibbānaṃ dullabhaṃ. Ayaṃ, mahārāja, lohitacandanassa paṭhamo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, lohitacandanaṃ asamasugandhaṃ, evameva kho, mahārāja, nibbānaṃ asamasugandhaṃ. Ayaṃ, mahārāja, lohitacandanassa dutiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, lohitacandanaṃ sajjanapasatthaṃ [sabbajanapasatthaṃ (syā.)], evameva kho, mahārāja, nibbānaṃ ariyasajjanapasatthaṃ. Ayaṃ, mahārāja, lohitacandanassa tatiyo guṇo nibbānaṃ anupaviṭṭho. Ime kho, mahārāja, lohitacandanassa tayo guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘sappimaṇḍassa tayo guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame sappimaṇḍassa tayo guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, sappimaṇḍo vaṇṇasampanno, evameva kho, mahārāja, nibbānaṃ guṇavaṇṇasampannaṃ. Ayaṃ, mahārāja, sappimaṇḍassa paṭhamo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, sappimaṇḍo gandhasampanno, evameva kho, mahārāja, nibbānaṃ sīlagandhasampannaṃ. Ayaṃ, mahārāja, sappimaṇḍassa dutiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, sappimaṇḍo rasasampanno, evameva kho, mahārāja, nibbānaṃ rasasampannaṃ. Ayaṃ, mahārāja, sappimaṇḍassa tatiyo guṇo nibbānaṃ anupaviṭṭho. Ime kho, mahārāja, sappimaṇḍassa tayo guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Bhante nāgasena, ‘girisikharassa pañca guṇā nibbānaṃ anupaviṭṭhā’ti yaṃ vadesi, katame girisikharassa pañca guṇā nibbānaṃ anupaviṭṭhā’’ti? ‘‘Yathā, mahārāja, girisikharaṃ accuggataṃ, evameva kho, mahārāja, nibbānaṃ accugataṃ. Ayaṃ, mahārāja, girisikharassa paṭhamo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, girisikharaṃ acalaṃ, evameva kho, mahārāja, nibbānaṃ acalaṃ. Ayaṃ, mahārāja, girisikharassa dutiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, girisikharaṃ duradhirohaṃ, evameva kho, mahārāja, nibbānaṃ duradhirohaṃ sabbakilesānaṃ. Ayaṃ, mahārāja, girisikharassa tatiyo guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, girisikharaṃ sabbabījānaṃ avirūhanaṃ, evameva kho, mahārāja, nibbānaṃ sabbakilesānaṃ avirūhanaṃ. Ayaṃ, mahārāja, girisikharassa catuttho guṇo nibbānaṃ anupaviṭṭho. Puna caparaṃ, mahārāja, girisikharaṃ anunayappaṭighavippamuttaṃ, evameva kho, mahārāja, nibbānaṃ anunayappaṭighavippamuttaṃ. Ayaṃ, mahārāja, girisikharassa pañcamo guṇo nibbānaṃ anupaviṭṭho. Ime kho, mahārāja, girisikharassa pañca guṇā nibbānaṃ anupaviṭṭhā’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Nibbānarūpasaṇṭhānapañho dasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "Nibbānasacchikaraṇapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "‘‘Bhante nāgasena, tumhe bhaṇatha ‘nibbānaṃ na atītaṃ, na anāgataṃ, na paccuppannaṃ, na uppannaṃ na anuppannaṃ na uppādanīya’nti. Idha, bhante nāgasena, yo koci sammāpaṭipanno nibbānaṃ sacchikaroti, so uppannaṃ sacchikaroti, udāhu uppādetvā sacchikarotī’’ti? ‘‘Yo koci, mahārāja, sammāpaṭipanno nibbānaṃ sacchikaroti, so na uppannaṃ sacchikaroti, na uppādetvā sacchikaroti, api ca, mahārāja, atthesā nibbānadhātu, yaṃ so sammāpaṭipanno sacchikarotī’’ti. ‘‘Mā, bhante nāgasena, imaṃ pañhaṃ paṭicchannaṃ katvā dīpehi, vivaṭaṃ pākaṭaṃ katvā dīpehi chandajāto ussāhajāto, yaṃ te sikkhitaṃ, taṃ sabbaṃ etthevākirāhi, etthāyaṃ jano sammūḷho vimatijāto saṃsayapakkhando, bhindetaṃ antodosasalla’’nti. ‘‘Atthesā, mahārāja, nibbānadhātu santā sukhā paṇītā, taṃ sammāpaṭipanno jinānusiṭṭhiyā saṅkhāre sammasanto paññāya sacchikaroti. Yathā, mahārāja, antevāsiko ācariyānusiṭṭhiyā vijjaṃ paññāya sacchikaroti, evameva kho, mahārāja, sammāpaṭipanno jinānusiṭṭhiyā paññāya nibbānaṃ sacchikaroti. ‘‘Kathaṃ pana taṃ nibbānaṃ daṭṭhabbanti? Anītito nirupaddavato abhayato khemato santato sukhato sātato paṇītato sucito sītalato daṭṭhabbaṃ. ‘‘Yathā, mahārāja, puriso bahukaṭṭhapuñjena jalitakaṭṭhitena agginā dayhamāno vāyāmena tato muñcitvā niraggikokāsaṃ pavisitvā tattha paramasukhaṃ labheyya, evameva kho, mahārāja, yo sammāpaṭipanno, so yoniso manasikārena byapagatatividhaggisantāpaṃ paramasukhaṃ nibbānaṃ sacchikaroti. Yathā, mahārāja, aggi, evaṃ tividhaggi daṭṭhabbo; yathā aggigato puriso, evaṃ sammāpaṭipanno daṭṭhabbo; yathā niraggikokāso, evaṃ nibbānaṃ daṭṭhabbaṃ. ‘‘Yathā vā pana, mahārāja, puriso ahikukkuramanussakuṇapasarīravaḷañjakoṭṭhāsarāsigato kuṇapajaṭājaṭitantaramanupaviṭṭho vāyāmena tato muñcitvā nikkuṇapokāsaṃ pavisitvā tattha paramasukhaṃ labheyya, evameva kho, mahārāja, yo sammāpaṭipanno, so yoniso manasikārena byapagatakilesakuṇapaṃ paramasukhaṃ nibbānaṃ sacchikaroti. Yathā, mahārāja, kuṇapaṃ, evaṃ pañca kāmaguṇā daṭṭhabbā; yathā kuṇapagato puriso, evaṃ sammāpaṭipanno daṭṭhabbo; yathā nikkuṇapokāso, evaṃ nibbānaṃ daṭṭhabbaṃ. ‘‘Yathā vā pana, mahārāja, puriso bhīto tasito kampito viparītavibbhantacitto vāyāmena tato muñcitvā daḷhaṃ thiraṃ acalaṃ abhayaṭṭhānaṃ pavisitvā tattha paramasukhaṃ labheyya, evameva kho, mahārāja, yo sammāpaṭipanno, so yoniso manasikārena byapagatabhayasantāsaṃ paramasukhaṃ nibbānaṃ sacchikaroti. Yathā, mahārāja, bhayaṃ, evaṃ jātijarābyādhimaraṇaṃ paṭicca aparāparaṃ pavattabhayaṃ daṭṭhabbaṃ; yathā bhīto puriso, evaṃ sammāpaṭipanno daṭṭhabbo; yathā abhayaṭṭhānaṃ, evaṃ nibbānaṃ daṭṭhabbaṃ. ‘‘Yathā vā pana, mahārāja, puriso kiliṭṭhamalinakalalakaddamadese patito vāyāmena taṃ kalalakaddamaṃ apavāhetvā parisuddhavimaladesamupagantvā tattha paramasukhaṃ labheyya, evameva kho, mahārāja, yo sammāpaṭipanno, so yoniso manasikārena byapagatakilesamalakaddamaṃ paramasukhaṃ nibbānaṃ sacchikaroti. Yathā, mahārāja, kalalaṃ, evaṃ lābhasakkārasiloko daṭṭhabbo; yathā kalalagato puriso, evaṃ sammāpaṭipanno daṭṭhabbo; yathā parisuddhavimaladeso, evaṃ nibbānaṃ daṭṭhabbaṃ. ‘‘Tañca pana nibbānaṃ sammāpaṭipanno kinti sacchikaroti? Yo so, mahārāja, sammāpaṭipanno, so saṅkhārānaṃ pavattaṃ sammasati. Pavattaṃ sammasamāno tattha jātiṃ passati jaraṃ passati byādhiṃ passati maraṇaṃ passati, na tattha kiñci sukhaṃ sātaṃ passati āditopi majjhatopi pariyosānatopi. So tattha kiñci na gayhūpagaṃ passati. Yathā, mahārāja, puriso divasasantatte ayoguḷe jalite tatte kaṭhite āditopi majjhatopi pariyosānatopi na kiñci gayhūpagaṃ padesaṃ passati, evameva kho, mahārāja, yo saṅkhārānaṃ pavattaṃ sammasati, so pavattaṃ sammasamāno tattha jātiṃ passati jaraṃ passati byādhiṃ passati maraṇaṃ passati, na tattha kiñci sukhaṃ sātaṃ passati āditopi majjhatopi pariyosānatopi. So tattha [idaṃ padadvayaṃ sī. pī. potthakesu natthi] na kiñci gayhūpagaṃ passati, tassa gayhūpagaṃ apassantassa citte arati saṇṭhāti, kāyasmiṃ ḍāho okkamati, so atāṇo asaraṇo asaraṇībhūto bhavesu nibbindati. ‘‘Yathā, mahārāja, puriso jalitajālaṃ mahantaṃ aggikkhandhaṃ paviseyya, so tattha atāṇo asaraṇo asaraṇībhūto aggimhi nibbindeyya, evameva kho, mahārāja, tassa gayhūpagaṃ apassantassa citte arati saṇṭhāti, kāyasmiṃ ḍāho okkamati, so atāṇo asaraṇo asaraṇībhūto bhavesu nibbindati. ‘‘Tassa pavatte bhayadassāvissa evaṃ cittaṃ uppajjati ‘santattaṃ kho panetaṃ pavattaṃ sampajjalitaṃ bahudukkhaṃ bahūpāyāsaṃ, yadi koci labhetha appavattaṃ etaṃ santaṃ etaṃ paṇītaṃ, yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhakkhayo virāgo nirodho nibbāna’nti. Iti hetaṃ [hitaṃ (sī.), hi idaṃ (pī.)] tassa appavatte cittaṃ pakkhandati pasīdati pahaṃsayati tusayati [pahaṃsīyati kuhīyati (sī. pī.)]‘paṭiladdhaṃ kho me nissaraṇa’nti. ‘‘Yathā, mahārāja, puriso vippanaṭṭho videsapakkhando nibbāhanamaggaṃ disvā tattha pakkhandati pasīdati pahaṃsayati tusayati [pahaṃsīyati kuhīyati (sī. pī.)] ‘paṭiladdho me nibbāhanamaggo’ti, evameva kho, mahārāja, pavatte bhayadassāvissa appavatte cittaṃ pakkhandati pasīdati pahaṃsayati tusayati [pahaṃsīyati kuhīyati (sī. pī.)] ‘paṭiladdhaṃ kho me nissaraṇa’nti. ‘‘So appavattatthāya maggaṃ āyūhati gavesati bhāveti bahulīkaroti, tassa tadatthaṃ sati santiṭṭhati, tadatthaṃ vīriyaṃ santiṭṭhati, tadatthaṃ pīti santiṭṭhati, tassa taṃ cittaṃ aparāparaṃ manasikaroto pavattaṃ samatikkamitvā appavattaṃ okkamati, appavattamanuppatto, mahārāja, sammāpaṭipanno ‘nibbānaṃ sacchikarotī’ti vuccatī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Nibbānasacchikaraṇapañho ekādasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "Nibbānasannihitapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "‘‘Bhante nāgasena, atthi so padeso puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya uddhaṃ vā adho vā tiriyaṃ vā, yattha nibbānaṃ sannihita’’nti? ‘‘Natthi, mahārāja, so padeso puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya uddhaṃ vā adho vā tiriyaṃ vā, yattha nibbānaṃ sannihita’’nti. ‘‘Yadi, bhante nāgasena, natthi nibbānassa sannihitokāso, tena hi natthi nibbānaṃ? Yesañca taṃ nibbānaṃ sacchikataṃ, tesampi sacchikiriyā micchā, kāraṇaṃ tattha vakkhāmi, yathā, bhante nāgasena, mahiyā dhaññuṭṭhānaṃ khettaṃ atthi, gandhuṭṭhānaṃ pupphaṃ atthi, pupphuṭṭhānaṃ gumbo atthi, phaluṭṭhānaṃ rukkho atthi, ratanuṭṭhānaṃ ākaro atthi, tattha yo koci yaṃ yaṃ icchati, so tattha gantvā taṃ taṃ harati, evameva kho, bhante nāgasena, yadi nibbānaṃ atthi, tassa nibbānassa uṭṭhānokāsopi icchitabbo, yasmā ca kho, bhante nāgasena, nibbānassa uṭṭhānokāso natthi, tasmā natthi nibbānanti brūmi, yesañca nibbānaṃ sacchikataṃ, tesampi sacchikiriyā micchā’’ti. ‘‘Natthi, mahārāja, nibbānassa sannihitokāso, atthi cetaṃ nibbānaṃ, sammāpaṭipanno yoniso manasikārena nibbānaṃ sacchikaroti. Yathā pana, mahārāja, atthi aggi nāma, natthi tassa sannihitokāso, dve kaṭṭhāni saṅghaṭṭento aggiṃ adhigacchati. Evameva kho, mahārāja, atthi nibbānaṃ, natthi tassa sannihitokāso, sammāpaṭipanno yoniso manasikārena nibbānaṃ sacchikaroti. ‘‘Yathā vā pana, mahārāja, atthi satta ratanāni nāma. Seyyathidaṃ, cakkaratanaṃ hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanaṃ. Na ca tesaṃ ratanānaṃ sannihitokāso atthi, khattiyassa pana sammāpaṭipannassa paṭipattibalena tāni ratanāni upagacchanti. Evameva kho, mahārāja, atthi nibbānaṃ, natthi tassa sannihitokāso, sammāpaṭipanno yoniso manasikārena nibbānaṃ sacchikarotī’’ti. ‘‘Bhante nāgasena, nibbānassa sannihitokāso mā hotu, atthi pana taṃ ṭhānaṃ, yattha ṭhito sammāpaṭipanno nibbānaṃ sacchikarotī’’ti? ‘‘Āma, mahārāja, atthi taṃ ṭhānaṃ, yattha ṭhito sammāpaṭipanno nibbānaṃ sacchikarotī’’ti. ‘‘Katamaṃ pana, bhante, taṃ ṭhānaṃ, yattha ṭhito sammāpaṭipanno nibbānaṃ sacchikarotī’’ti? ‘‘Sīlaṃ, mahārāja, ṭhānaṃ, sīle patiṭṭhito yoniso manasikaronto sakkayavanepi cīnavilātepi alasandepi nigumbepi [nikumbepi (sī. syā. pī.)] kāsikosalepi kasmīrepi gandhārepi nagamuddhanipi brahmalokepi yattha katthacipi ṭhito sammāpaṭipanno nibbānaṃ sacchikaroti. Yathā, mahārāja, yo koci cakkhumā puriso sakayavanepi cīnavilātepi alasandepi nigumbepi kāsikosalepi kasmīrepi gandhārepi nagamuddhanipi brahmalokepi yattha katthacipi ṭhito ākāsaṃ passati, evameva kho, mahārāja, sīle patiṭṭhito yoniso manasikaronto sakayavanepi… pe… yattha katthacipi ṭhito sammāpaṭipanno nibbānaṃ sacchikaroti. ‘‘Yathā vā pana, mahārāja, sakayavanepi…pe… yattha katthacipi ṭhitassa pubbadisā atthi, evameva kho, mahārāja, sīle patiṭṭhitassa yoniso manasikarontassa sakkayavanepi…pe… yattha katthacipi ṭhitassa sammāpaṭipannassa atthi nibbānasacchikiriyā’’ti. ‘‘Sādhu, bhante nāgasena, desitaṃ tayā nibbānaṃ, desitā nibbānasacchikiriyā, parikkhatā sīlaguṇā, dassitā sammāpaṭipatti, ussāpito dhammaddhajo, saṇṭhapitā dhammanetti, avañjho suppayuttānaṃ sammāpayogo, evametaṃ gaṇivarapavara tathā sampaṭicchāmī’’ti. Nibbānasannihitapañho dvādasamo. Vessantaravaggo tatiyo. Imasmiṃ vagge dvādasa pañhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}