{
  "id": "mil.12",
  "title": {
    "pali": "Santhavavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Santhavapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā – ‘‘‘Santhavato bhayaṃ jātaṃ, niketā jāyate rajo; Aniketamasanthavaṃ, etaṃ ve munidassana’nti. ‘‘Puna ca bhagavatā bhaṇitaṃ ‘vihāre kāraye ramme, vāsayettha bahussute’ti. Yadi, bhante nāgasena, tathāgatena bhaṇitaṃ ‘santhavato bhayaṃ jātaṃ, niketā jāyate rajo. Aniketamasanthavaṃ, etaṃ ve munidassana’nti, tena hi ‘vihāre kāraye ramme, vāsayettha bahussute’ti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatena bhaṇitaṃ ‘vihāre kāraye ramme, vāsayettha bahussute’ti, tena hi ‘santhavato bhayaṃ jātaṃ, niketā jāyate rajo. Aniketamasanthavaṃ, etaṃ ve munidassana’nti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘santhavato bhayaṃ jātaṃ, niketā jāyate rajo. Aniketamasanthavaṃ, etaṃ ve munidassana’nti. Bhaṇitañca ‘vihāre kāraye ramme, vāsayettha bahussute’ti. Yaṃ, mahārāja, bhagavatā bhaṇitaṃ ‘santhavato bhayaṃ jātaṃ, niketā jāyate rajo. Aniketamasanthavaṃ, etaṃ ve munidassana’nti, taṃ sabhāvavacanaṃ asesavacanaṃ nissesavacanaṃ nippariyāyavacanaṃ samaṇānucchavaṃ samaṇasāruppaṃ samaṇappatirūpaṃ samaṇārahaṃ samaṇagocaraṃ samaṇappaṭipadā samaṇappaṭipatti. Yathā, mahārāja, āraññako migo araññe pavane caramāno nirālayo aniketo yathicchakaṃ sayati, evameva kho, mahārāja, bhikkhunā ‘santhavato bhayaṃ jātaṃ, niketā jāyate rajo. Aniketamasanthavaṃ, etaṃ ve munidassana’nti cintetabbaṃ. ‘‘Yaṃ pana, mahārāja, bhagavatā bhaṇitaṃ ‘vihāre kāraye ramme, vāsayettha bahussute’ti, taṃ dve atthavase sampassamānena bhagavatā bhaṇitaṃ. Katame dve? Vihāradānaṃ nāma sabbabuddhehi vaṇṇitaṃ anumataṃ thomitaṃ pasatthaṃ, taṃ te vihāradānaṃ datvā jātijarāmaraṇā parimuccissantīti. Ayaṃ tāva paṭhamo ānisaṃso vihāradāne. ‘‘Puna caparaṃ vihāre vijjamāne bhikkhuniyo byattasaṅketā bhavissanti, sulabhaṃ dassanaṃ dassanakāmānaṃ, anikete duddassanā bhavissantīti. Ayaṃ dutiyo ānisaṃso vihāradāne. Ime dve atthavase sampassamānena bhagavatā bhaṇitaṃ ‘vihāre kāraye ramme, vāsayettha bahussute’ti, na tattha buddhaputtena ālayo karaṇīyo nikete’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Santhavapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Udarasaṃyatapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā – ‘‘‘Uttiṭṭhe nappamajjeyya, udare saṃyato siyā’ti. ‘‘Puna ca bhagavatā bhaṇitaṃ ‘ahaṃ kho panudāyi, appekadā iminā pattena samatittikampi bhuñjāmi, bhiyyopi bhuñjāmī’ti. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘uttiṭṭhe nappamajjeyya, udare saṃyato siyā’ti, tena hi ‘ahaṃ kho panudāyi, appekadā iminā pattena samatitthikampi bhuñjāmi, bhiyyopi bhuñjāmī’ti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatena bhaṇitaṃ ‘ahaṃ kho panudāyi, appekadā iminā pattena samatitthikampi bhuñjāmi, bhiyyopi bhuñjāmī’ti, tena hi ‘uttiṭṭhe nappamajjeyya, udare saṃyato siyā’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘uttiṭṭhe nappamajjeyya, udare saṃyato siyā’ti, bhaṇitañca ‘ahaṃ kho panudāyi, appekadā iminā pattena samatittikampi bhuñjāmi, bhiyyopi bhuñjāmī’ti. Yaṃ, mahārāja, bhagavatā bhaṇitaṃ ‘uttiṭṭhe nappamajjeyya, udare saṃyato siyā’ti, taṃ sabhāvavacanaṃ asesavacanaṃ nissesavacanaṃ nippariyāyavacanaṃ bhūtavacanaṃ tacchavacanaṃ yāthāvavacanaṃ aviparītavacanaṃ isivacanaṃ munivacanaṃ bhagavantavacanaṃ arahantavacanaṃ paccekabuddhavacanaṃ jinavacanaṃ sabbaññuvacanaṃ tathāgatassa arahato sammāsambuddhassa vacanaṃ. ‘‘Udare asaṃyato, mahārāja, pāṇampi hanati, adinnampi ādiyati, paradārampi gacchati, musāpi bhaṇati, majjampi pivati, mātarampi jīvitā voropeti, pitarampi jīvitā voropeti, arahantampi jīvitā voropeti, saṅghampi bhindati, duṭṭhena cittena tathāgatassa lohitampi uppādeti. Nanu, mahārāja, devadatto udare asaṃyato saṅghaṃ bhinditvā kappaṭṭhiyaṃ kammaṃ āyūhi [āyūhati (ka.)]. Evarūpāni, mahārāja, aññānipi bahuvidhāni kāraṇāni disvā bhagavatā bhaṇitaṃ ‘uttiṭṭhe nappamajjeyya, udare saṃyato siyā’ti. ‘‘Udare saṃyato, mahārāja, catusaccābhisamayaṃ abhisameti, cattāri sāmaññaphalāni sacchikaroti, catūsu paṭisambhidāsu aṭṭhasu samāpattīsu chasu abhiññāsu vasībhāvaṃ pāpuṇāti, kevalañca samaṇadhammaṃ pūreti. Nanu, mahārāja, sukapotako udare saṃyato hutvā yāva tāvatiṃsabhavanaṃ kampetvā sakkaṃ devānamindaṃ upaṭṭhānamupanesi, evarūpāni, mahārāja, aññānipi bahuvidhāni kāraṇāni disvā bhagavatā bhaṇitaṃ ‘uttiṭṭhe nappamajjeyya, udare saṃyato siyā’ti. ‘‘Yaṃ pana, mahārāja, bhagavatā bhaṇitaṃ ‘ahaṃ kho panudāyi appekadā iminā pattena samatittikampi bhuñjāmi, bhiyyopi bhuñjāmī’ti, taṃ katakiccena niṭṭhitakiriyena siddhatthena vusitavosānena nirāvaraṇena sabbaññunā sayambhunā tathāgatena attānaṃ upādāya bhaṇitaṃ. ‘‘Yathā, mahārāja, vantassa virittassa anuvāsitassa āturassa sappāyakiriyā icchitabbā hoti, evameva kho, mahārāja, sakilesassa adiṭṭhasaccassa udare saṃyamo karaṇīyo hoti. Yathā, mahārāja, maṇiratanassa sappabhāsassa jātimantassa abhijātiparisuddhassa majjananighaṃsanaparisodhanena karaṇīyaṃ na hoti, evameva kho, mahārāja, tathāgatassa buddhavisaye pāramiṃ gatassa kiriyākaraṇesu āvaraṇaṃ na hotī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Udarasaṃyatapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Buddhaappābādhapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘ahamasmi, bhikkhave, brāhmaṇo yācayogo sadā payatapāṇi antimadehadharo anuttaro bhisakko sallakatto’ti. Puna ca bhaṇitaṃ bhagavatā ‘etadaggaṃ, bhikkhave, mama sāvakānaṃ bhikkhūnaṃ appābādhānaṃ yadidaṃ bākulo’ti. Bhagavato ca sarīre bahukkhattuṃ ābādho uppanno dissati. Yadi, bhante nāgasena, tathāgato anuttaro, tena hi ‘etadaggaṃ…pe… bākulo’ti yaṃ vacanaṃ, taṃ micchā. Yadi thero bākulo appābādhānaṃ aggo, tena hi ‘ahamasmi…pe… sallakatto’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘ahamasmi…pe… sallakatto’ti, bhaṇitañca ‘etadaggaṃ…pe… bākulo’ti, tañca pana bāhirānaṃ āgamānaṃ adhigamānaṃ pariyattīnaṃ attani vijjamānataṃ sandhāya bhāsitaṃ. ‘‘Santi kho pana, mahārāja, bhagavato sāvakā ṭhānacaṅkamikā, te ṭhānena caṅkamena divārattiṃ vītināmenti, bhagavā pana, mahārāja, ṭhānena caṅkamena nisajjāya sayanena divārattiṃ vītināmeti, ye te, mahārāja, bhikkhū ṭhānacaṅkamikā, te tena aṅgena atirekā. ‘‘Santi kho pana, mahārāja, bhagavato sāvakā ekāsanikā, te jīvitahetupi dutiyaṃ bhojanaṃ na bhuñjanti, bhagavā pana, mahārāja, dutiyampi yāva tatiyampi bhojanaṃ bhuñjati, ye te, mahārāja, bhikkhū ekāsanikā, te tena aṅgena atirekā, anekavidhāni, mahārāja, tāni kāraṇāni tesaṃ tesaṃ taṃ taṃ sandhāya bhaṇitāni. Bhagavā pana, mahārāja, anuttaro sīlena samādhinā paññāya vimuttiyā vimuttiñāṇadassanena dasahi ca balehi catūhi vesārajjehi aṭṭhārasahi buddhadhammehi chahi asādhāraṇehi ñāṇehi, kevale ca buddhavisaye taṃ sandhāya bhaṇitaṃ ‘ahamasmi…pe… sallakatto’ti. ‘‘Idha, mahārāja, manussesu eko jātimā hoti, eko dhanavā, eko vijjavā, eko sippavā, eko sūro, eko vicakkhaṇo, sabbepete abhibhaviya rājā yeva tesaṃ uttamo hoti, evameva kho, mahārāja, bhagavā sabbasattānaṃ aggo jeṭṭho seṭṭho. ‘‘Yaṃ pana āyasmā bākulo appābādho ahosi, taṃ abhinīhāravasena, so hi, mahārāja, anomadassissa bhagavato udaravātābādhe uppanne vipassissa ca bhagavato aṭṭhasaṭṭhiyā ca bhikkhusatasahassānaṃ tiṇapupphakaroge uppanne sayaṃ tāpaso samāno nānābhesajjehi taṃ byādhiṃ apanetvā appābādhataṃ patto, bhaṇito ca ‘etadaggaṃ…pe… bākulo’ti. ‘‘Bhagavato, mahārāja, byādhimhi uppajjantepi anuppajjantepi dhutaṅgaṃ ādiyantepi anādiyantepi natthi bhagavatā sadiso koci satto. Bhāsitampetaṃ mahārāja bhagavatā devātidevena saṃyuttanikāyavaralañchake – ‘‘‘Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññīnāsaññino vā, tathāgato tesaṃ aggamakkhāyati arahaṃ sammāsambuddho’ti. ‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’’ti. Buddhaappābādhapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Magguppādanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘tathāgato bhikkhave, arahaṃ sammāsambuddho anuppannassa maggassa uppādetā’ti. Puna ca bhaṇitaṃ ‘addasaṃ khvāhaṃ, bhikkhave, purāṇaṃ maggaṃ purāṇaṃ añjasaṃ pubbakehi sammāsambuddhehi anuyāta’nti. Yadi, bhante nāgasena, tathāgato anuppannassa maggassa uppādetā, tena hi ‘addasaṃ khvāhaṃ, bhikkhave, purāṇaṃ maggaṃ purāṇaṃ añjasaṃ pubbakehi sammāsambuddhehi anuyāta’nti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatena bhaṇitaṃ ‘addasaṃ khvāhaṃ, bhikkhave, purāṇaṃ maggaṃ purāṇaṃ añjasaṃ pubbakehi sammāsambuddhehi anuyāta’nti, tena hi ‘tathāgato, bhikkhave, arahaṃ sammāsambuddho anuppannassa maggassa uppādetā’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘tathāgato, bhikkhave, arahaṃ sammāsambuddho anuppannassa maggassa uppādetā’ti. Bhaṇitañca ‘addasaṃ khvāhaṃ, bhikkhave, purāṇaṃ maggaṃ purāṇaṃ añjasaṃ pubbakehi sammāsambuddhehi anuyāta’nti, taṃ dvayampi sabhāvavacanameva, pubbakānaṃ, mahārāja, tathāgatānaṃ antaradhānena asati anusāsake maggo antaradhāyi, taṃ [so taṃ (sī. pī. ka.)] tathāgato maggaṃ luggaṃ paluggaṃ gūḷhaṃ pihitaṃ paṭicchannaṃ asañcaraṇaṃ paññācakkhunā sampassamāno [sammasamāno (sī. pī.)] addasa pubbakehi sammāsambuddhehi anuyātaṃ, taṃkāraṇā āha ‘addasaṃ khvāhaṃ, bhikkhave, purāṇaṃ maggaṃ purāṇaṃ añjasaṃ pubbakehi sammāsambuddhehi anuyāta’nti. ‘‘Pubbakānaṃ, mahārāja, tathāgatānaṃ antaradhānena asati anusāsake luggaṃ paluggaṃ gūḷhaṃ pihitaṃ paṭicchannaṃ asañcaraṇaṃ maggaṃ yaṃ dāni tathāgato sañcaraṇaṃ akāsi, taṃkāraṇā āha ‘tathāgato, bhikkhave, arahaṃ sammāsambuddho anuppannassa maggassa uppādetā’ti. ‘‘Idha, mahārāja, rañño cakkavattissa antaradhānena maṇiratanaṃ girisikhantare nilīyati, aparassa cakkavattissa sammāpaṭipattiyā upagacchati, api nu kho taṃ, mahārāja, maṇiratanaṃ tassa pakata’’nti? ‘‘Na hi, bhante, pākatikaṃ yeva taṃ maṇiratanaṃ, tena pana nibbattita’’nti [nibbattanti (sī. pī.)]. ‘‘Evameva kho, mahārāja, pākatikaṃ pubbakehi tathāgatehi anuciṇṇaṃ aṭṭhaṅgikaṃ sivaṃ maggaṃ asati anusāsake luggaṃ paluggaṃ gūḷhaṃ pihitaṃ paṭicchannaṃ asañcaraṇaṃ bhagavā paññācakkhunā sampassamāno uppādesi, sañcaraṇaṃ akāsi, taṃkāraṇā āha ‘tathāgato, bhikkhave, arahaṃ sammāsambuddho anuppannassa maggassa uppādetā’ti. ‘‘Yathā vā pana, mahārāja, santaṃ yeva puttaṃ yoniyā janayitvā mātā ‘janikā’ti vuccati, evameva kho, mahārāja, tathāgato santaṃ yeva maggaṃ luggaṃ paluggaṃ gūḷhaṃ pihitaṃ paṭicchannaṃ asañcaraṇaṃ paññācakkhunā sampassamāno uppādesi, sañcaraṇaṃ akāsi, taṃkāraṇā āha ‘tathāgato, bhikkhave, arahaṃ sammāsambuddho anuppannassa maggassa uppādetā’ti. ‘‘Yathā vā pana, mahārāja, koci puriso yaṃ kiñci naṭṭhaṃ passati, ‘tena taṃ bhaṇḍaṃ nibbattita’nti jano voharati, evameva kho, mahārāja, tathāgato santaṃ yeva maggaṃ luggaṃ paluggaṃ gūḷhaṃ pihitaṃ paṭicchannaṃ asañcaraṇaṃ paññācakkhunā sampassamāno uppādesi, sañcaraṇaṃ akāsi, taṃkāraṇā āha ‘tathāgato, bhikkhave, arahaṃ sammāsambuddho anuppannassa maggassa uppādetā’ti. ‘‘Yathā vā pana, mahārāja, koci puriso vanaṃ sodhetvā bhūmiṃ nīharati, ‘tassa sā bhūmī’ti jano voharati, na cesā bhūmi tena pavattitā, taṃ bhūmiṃ kāraṇaṃ katvā bhūmisāmiko nāma hoti, evameva kho, mahārāja, tathāgato santaṃ yeva maggaṃ luggaṃ paluggaṃ gūḷhaṃ pihitaṃ paṭicchannaṃ asañcaraṇaṃ paññāya sampassamāno uppādesi, sañcaraṇaṃ akāsi, taṃkāraṇā āha ‘tathāgato, bhikkhave, arahaṃ sammāsambuddho anuppannassa maggassa uppādetā’’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Magguppādanapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Buddhaaviheṭhakapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘pubbe vāhaṃ manussabhūto samāno sattānaṃ aviheṭhakajātiko ahosi’nti. Puna ca bhaṇitaṃ ‘lomasakassapo nāma isi samāno anekasate pāṇe ghātayitvā vājapeyyaṃ mahāyaññaṃ yajī’ti. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘pubbe vāhaṃ manussabhūto samāno sattānaṃ aviheṭhakajātiko ahosi’nti, tena hi ‘lomasakassapena isinā anekasate pāṇe ghātayitvā vājapeyyaṃ mahāyaññaṃ yajita’nti yaṃ vacanaṃ, taṃ micchā. Yadi ‘lomasakassapena isinā anekasate pāṇe ghātayitvā vājapeyyaṃ mahāyaññaṃ yajitaṃ’, tena hi ‘pubbe vāhaṃ manussabhūto samāno sattānaṃ aviheṭhakajātiko ahosi’nti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘pubbe vāhaṃ manussabhūto samāno sattānaṃ aviheṭhakajātiko ahosi’nti, ‘lomasakassapena isinā anekasate pāṇe ghātayitvā vājapeyyaṃ mahāyaññaṃ yajitaṃ’, tañca pana rāgavasena visaññinā, no sacetanenā’’ti. ‘‘Aṭṭhime, bhante nāgasena, puggalā pāṇaṃ hananti. Katame aṭṭha? Ratto rāgavasena pāṇaṃ hanati, duṭṭho dosavasena pāṇaṃ hanati, mūḷho mohavasena pāṇaṃ hanati, mānī mānavasena pāṇaṃ hanati, luddho lobhavasena pāṇaṃ hanati, akiñcano jīvikatthāya pāṇaṃ hanati, bālo hassavasena [aññāṇavasena (ka. sī.)] pāṇaṃ hanati, rājā vinayanavasena pāṇaṃ hanati. Ime kho, bhante nāgasena, aṭṭha puggalā pāṇaṃ hananti. Pākatikaṃ yeva, bhante nāgasena, bodhisattena kata’’nti. ‘‘Na, mahārāja, pākatikaṃ bodhisattena kataṃ, yadi, mahārāja, bodhisatto pakatibhāvena onameyya mahāyaññaṃ yajituṃ, na yimaṃ gāthaṃ bhaṇeyya – ‘‘‘Sasamuddapariyāyaṃ, mahiṃ sāgarakuṇḍalaṃ; Na icche saha nindāya, evaṃ seyha [sayha (sī. pī.)] vijānahī’ti. ‘‘Evaṃvādī, mahārāja, bodhisatto saha dassanena candavatiyā rājakaññāya visaññī ahosi khittacitto ratto visaññibhūto ākulākulo turitaturito tena vikkhittabhantaluḷitacittena mahatimahāpasughātagalaruhirasañcayaṃ vājapeyyaṃ mahāyaññaṃ yaji. ‘‘Yathā, mahārāja, ummattako khittacitto jalitampi jātavedaṃ akkamati, kupitampi āsīvisaṃ gaṇhāti, mattampi hatthiṃ upeti, samuddampi atīradassiṃ pakkhandati, candanikampi oḷigallampi omaddati, kaṇṭakādhānampi abhiruhati, papātepi patati, asucimpi bhakkheti, naggopi rathiyā carati, aññampi bahuvidhaṃ akiriyaṃ karoti. Evameva kho, mahārāja, bodhisatto saha dassanena candavatiyā rājakaññāya visaññī ahosi khittacitto ratto visaññibhūto ākulākulo turitaturito, tena vikkhittabhantaluḷitacittena mahatimahāpasughātagalaruhirasañcayaṃ vājapeyyaṃ mahāyaññaṃ yaji. ‘‘Khittacittena, mahārāja, kataṃ pāpaṃ diṭṭhadhammepi na mahāsāvajjaṃ hoti, samparāye vipākenapi no tathā. Idha, mahārāja, koci ummattako vajjhamāpajjeyya, tassa tumhe kiṃ daṇḍaṃ dhārethā’’ti? ‘‘Ko, bhante, ummattakassa daṇḍo bhavissati, taṃ mayaṃ pothāpetvā nīharāpema, esova tassa daṇḍo’’ti. ‘‘Iti kho, mahārāja, ummattakassa aparādhe daṇḍopi na bhavati, tasmā ummattakassa katepi na doso bhavati satekiccho. Evameva kho, mahārāja, lomasakassapo isi saha dassanena candavatiyā rājakaññāya visaññī ahosi khittacitto ratto visaññibhūto visaṭapayāto ākulākulo turitaturito, tena vikkhittabhantaluḷitacittena mahatimahāpasughātagalaruhirasañcayaṃ vājapeyyaṃ mahāyaññaṃ yaji. Yadā ca pana pakaticitto ahosi paṭiladdhassati, tadā punadeva pabbajitvā pañcābhiññāyo nibbattetvā brahmalokūpago ahosī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Buddhaaviheṭhakapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Chaddantajotipālārabbhapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā chaddanto nāgarājā – ‘‘‘Vadhissametanti parāmasanto, kāsāvamaddakkhi dhajaṃ isīnaṃ; Dukkhena phuṭṭhassudapādi saññā, arahaddhajo sabbhi avajjharūpo’ti. ‘‘Puna ca bhaṇitaṃ ‘jotipālamāṇavo samāno kassapaṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ muṇḍakavādena samaṇakavādena asabbhāhi pharusāhi vācāhi akkosi paribhāsī’ti. Yadi, bhante nāgasena, bodhisatto tiracchānagato samāno kāsāvaṃ abhipūjayi, tena hi ‘jotipālena māṇavena kassapo bhagavā arahaṃ sammāsambuddho muṇḍakavādena samaṇakavādena asabbhāhi pharusāhi vācāhi akkuṭṭho paribhāsito’ti yaṃ vacanaṃ, taṃ micchā. Yadi jotipālena māṇavena kassapo bhagavā arahaṃ sammāsambuddho muṇḍakavādena samaṇakavādena asabbhāhi pharusāhi vācāhi akkuṭṭho paribhāsito, tena hi ‘chaddantena nāgarājena kāsāvaṃ pūjita’nti tampi vacanaṃ micchā. Yadi tiracchānagatena bodhisattena kakkhaḷakharakaṭukavedanaṃ vedayamānena luddakena nivatthaṃ kāsāvaṃ pūjitaṃ, kiṃ manussabhūto samāno paripakkañāṇo paripakkāya bodhiyā kassapaṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ dasabalaṃ lokanāyakaṃ uditoditaṃ jalitabyāmobhāsaṃ pavaruttamaṃ pavararucirakāsikakāsāvamabhipārutaṃ disvā na pūjayi? Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabboti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā chaddanto nāgarājā ‘vadhissametanti…pe… avajjharūpo’ti. Jotipālena ca māṇavena kassapo bhagavā arahaṃ sammāsambuddho muṇḍakavādena samaṇakavādena asabbhāhi pharusāhi vācāhi akkuṭṭho paribhāsito, tañca pana jātivasena kulavasena. Jotipālo, mahārāja, māṇavo assaddhe appasanne kule paccājāto, tassa mātāpitaro bhaginibhātaro dāsidāsaceṭakaparivārakamanussā brahmadevatā brahmagarukā, te ‘brāhmaṇā eva uttamā pavarā’ti avasese pabbajite garahanti jigucchanti, tesaṃ taṃ vacanaṃ sutvā jotipālo māṇavo ghaṭikārena kumbhakārena satthāraṃ dassanāya pakkosito evamāha ‘kiṃ pana tena muṇḍakena samaṇakena diṭṭhenā’ti. ‘‘Yathā, mahārāja, amataṃ visamāsajja tittakaṃ hoti, yathā ca sītodakaṃ aggimāsajja uṇhaṃ hoti, evameva kho, mahārāja, jotipālo māṇavo assaddhe appasanne kule paccājāto, so kulavasena andho hutvā [so kulajātivasena andho bhavitvā (syā.)] tathāgataṃ akkosi paribhāsi. ‘‘Yathā, mahārāja, jalitapajjalito mahāaggikkhandho sappabhāso udakamāsajja upahatappabhātejo sītalo kāḷako bhavati paripakkanigguṇḍiphalasadiso, evameva kho, mahārāja, jotipālo māṇavo puññavā saddho ñāṇavipulasappabhāso assaddhe appasanne kule paccājāto, so kulavasena andho hutvā tathāgataṃ akkosi paribhāsi, upagantvā ca buddhaguṇamaññāya ceṭakabhūto viya ahosi, jinasāsane pabbajitvā abhiññā ca samāpattiyo ca nibbattetvā brahmalokūpago ahosī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Chaddantajotipālārabbhapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Ghaṭikārapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘ghaṭikārassa kumbhakārassa āvesanaṃ sabbaṃ temāsaṃ ākāsacchadanaṃ aṭṭhāsi, na devotivassī’ti. Puna ca bhaṇitaṃ ‘kassapassa tathāgatassa [bhagavato arahato sammāsambuddhassa (ma. ni. 2.289)] kuṭi ovassatī’ti. Kissa pana, bhante nāgasena, tathāgatassa evamussannakusalamūlassa [evarūpassa ussannakusalamūlassa (ka.)] kuṭi ovassati, tathāgatassa nāma so ānubhāvo icchitabbo? Yadi, bhante nāgasena, ghaṭikārassa kumbhakārassa āvesanaṃ anovassaṃ ākāsacchadanaṃ ahosi, tena hi ‘tathāgatassa kuṭi ovassatī’ti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatassa kuṭi ovassati, tena hi ‘ghaṭikārassa kumbhakārassa āvesanaṃ anovassakaṃ ahosi ākāsacchadana’nti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘ghaṭikārassa kumbhakārassa āvesanaṃ sabbaṃ temāsaṃ ākāsacchadanaṃ aṭṭhāsi, na devotivassī’ti. Bhaṇitañca ‘kassapassa tathāgatassa kuṭi ovassatī’ti. Ghaṭikāro, mahārāja, kumbhakāro sīlavā kalyāṇadhammo ussannakusalamūlo andhe jiṇṇe mātāpitaro poseti, tassa asammukhā anāpucchāyevassa ghare tiṇaṃ haritvā bhagavato kuṭiṃ chādesuṃ, so tena tiṇaharaṇena akampitaṃ asañcalitaṃ susaṇṭhitaṃ vipulamasamaṃ pītiṃ paṭilabhati, bhiyyo somanassañca atulaṃ uppādesi ‘aho vata me bhagavā lokuttamo suvissattho’ti, tena tassa diṭṭhadhammiko vipāko nibbatto. Na hi, mahārāja, tathāgato tāvatakena vikārena calati. ‘‘Yathā, mahārāja, sineru girirājā anekasatasahassavātasampahārenapi na kampati na calati, mahodadhi varappavarasāgaro anekasatanahutamahāgaṅgāsatasahassehipi na pūrati na vikāramāpajjati, evameva kho, mahārāja, tathāgato na tāvatakena vikārena calati. ‘‘Yaṃ pana, mahārāja, tathāgatassa kuṭi ovassati, taṃ mahato janakāyassa anukampāya. Dveme, mahārāja, atthavase sampassamānā tathāgatā sayaṃ nimmitaṃ paccayaṃ nappaṭisevanti, ‘ayaṃ aggadakkhiṇeyyo satthā’ti bhagavato paccayaṃ datvā devamanussā sabbaduggatito parimuccissantīti, dassetvā vuttiṃ pariyesantīti ‘mā aññe upavadeyyu’nti. Ime dve atthavase sampassamānā tathāgatā sayaṃ nimmitaṃ paccayaṃ nappaṭisevanti. Yadi, mahārāja, sakko vā taṃ kuṭiṃ anovassaṃ kareyya brahmā vā sayaṃ vā, sāvajjaṃ bhaveyya taṃ yeva karaṇaṃ [kāraṇaṃ (sī. pī.)] sadosaṃ saniggahaṃ, ime vibhūtaṃ [vibhūsaṃ (sī. pī.)] katvā lokaṃ sammohenti adhikataṃ karontīti, tasmā taṃ karaṇaṃ vajjanīyaṃ. Na, mahārāja, tathāgatā vatthuṃ yācanti, tāya avatthuyācanāya aparibhāsiyā bhavantī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Ghaṭikārapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Brāhmaṇarājavādapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ tathāgatena ‘ahamasmi, bhikkhave, brāhmaṇo yācayogo’ti. Puna ca bhaṇitaṃ ‘rājāhamasmi selā’ti. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘ahamasmi, bhikkhave, brāhmaṇo yācayogo’ti, tena hi ‘rājāhamasmi selā’ti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatena bhaṇitaṃ ‘rājāhamasmi selā’ti, tena hi ‘ahamasmi, bhikkhave, brāhmaṇo yācayogo’ti tampi vacanaṃ micchā. Khattiyo vā hi bhaveyya brāhmaṇo vā, natthi ekāya jātiyā dve vaṇṇā nāma, ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘ahamasmi, bhikkhave, brāhmaṇo yācayogo’ti, puna ca bhaṇitaṃ ‘rājāhamasmi selā’ti, tattha kāraṇaṃ atthi, yena kāraṇena tathāgato brāhmaṇo ca rājā ca hotī’’ti. ‘‘Kiṃ pana taṃ, bhante nāgasena, kāraṇaṃ, yena kāraṇena tathāgato brāhmaṇo ca rājā ca hoti’’? ‘‘Sabbe, mahārāja, pāpakā akusalā dhammā tathāgatassa bāhitā pahīnā apagatā byapagatā ucchinnā khīṇā khayaṃ pattā nibbutā upasantā, tasmā tathāgato ‘brāhmaṇo’ti vuccati. ‘‘Brāhmaṇo nāma saṃsayamanekaṃsaṃ vimatipathaṃ vītivatto, bhagavāpi, mahārāja, saṃsayamanekaṃsaṃ vimatipathaṃ vītivatto, tena kāraṇena tathāgato ‘brāhmaṇo’ti vuccati. ‘‘Brāhmaṇo nāma sabbabhavagatiyoninissaṭo malarajagatavippamutto asahāyo, bhagavāpi, mahārāja, sabbabhavagatiyoninissaṭo malarajagatavippamutto asahāyo, tena kāraṇena tathāgato ‘brāhmaṇo’ti vuccati. ‘‘Brāhmaṇā nāma aggaseṭṭhavarapavaradibbavihārabahulo, bhagavāpi, mahārāja, aggaseṭṭhavarapavaradibbavihārabahulo, tenāpi kaparaṇena tathāgato ‘‘brāhmaṇo’’ti vuccati. ‘‘Brāhmaṇo nāma ajjhayana ajjhāpana dānappaṭiggahaṇa dama saṃyamaniyamapubbamanusiṭṭhi paveṇi vaṃsa dharaṇo, bhagavāpi, mahārāja, ajjhayana ajjhāpana dānappaṭiggahaṇa dama saṃyama niyama pubbajināciṇṇa anusiṭṭhi paveṇi vaṃsa dharaṇo tenāpi kāraṇena tathāgato ‘brāhmaṇo’ti vuccati. ‘‘Brāhmaṇo nāma brahāsukhavihārajjhānajhāyī; bhagavāpi, mahārāja, brahāsukhavihārajjhānajhāyī, tenāpi kāraṇena tathāgato ‘brāhmaṇo’ti vuccati. ‘‘Brāhmaṇo nāma sabbabhavābhavagatīsu abhijātivattitamanucaritaṃ jānāti, bhagavāpi, mahārāja, sabbabhavābhavagatīsu abhijātivattitamanucaritaṃ jānāti, tenāpi kāraṇena tathāgato ‘brāhmaṇo’ti vuccati. ‘‘Brāhmaṇoti, mahārāja, bhagavato netaṃ nāmaṃ mātarā kataṃ, na pitarā kataṃ, na bhātarā kataṃ, na bhaginiyā kataṃ, na mittāmaccehi kataṃ, na ñātisālohitehi kataṃ, na samaṇabrāhmaṇehi kataṃ, na devatāhi kataṃ, vimokkhantikametaṃ buddhānaṃ bhagavantānaṃ nāmaṃ bodhiyā yeva mūle mārasenaṃ vidhamitvā atītānāgatapaccuppanne pāpake akusale dhamme bāhetvā saha sabbaññutañāṇassa paṭilābhā paṭiladdhapātubhūtasamuppannamatte sacchikā paññatti yadidaṃ brāhmaṇoti, tena kāraṇena tathāgato vuccati ‘brāhmaṇo’’’ti. ‘‘Kena pana, bhante nāgasena, kāraṇena tathāgato vuccati ‘rājā’’’ti? ‘‘Rājā nāma, mahārāja, yo koci rajjaṃ kāreti lokamanusāsati, bhagavāpi, mahārāja, dasasahassiyā lokadhātuyā dhammena rajjaṃ kāreti, sadevakaṃ lokaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ anusāsati, tenāpi kāraṇena tathāgato vuccati ‘rājā’ti. ‘‘Rājā nāma, mahārāja, sabbajanamanusse abhibhavitvā nandayanto ñātisaṅghaṃ, socayanto amittasaṅghaṃ, mahatimahāyasasiriharaṃ thirasāradaṇḍaṃ anūnasatasalākālaṅkataṃ ussāpeti paṇḍaravimalasetacchattaṃ, bhagavāpi, mahārāja, socayanto mārasenaṃ micchāpaṭipannaṃ, nandayanto devamanusse sammāpaṭipanne dasasahassiyā lokadhātuyā mahatimahāyasasiriharaṃ khantithirasāradaṇḍaṃ ñāṇavarasatasalākālaṅkataṃ ussāpeti aggavaravimuttipaṇḍaravimalasetacchattaṃ, tenāpi kāraṇena tathāgato vuccati ‘rājā’ti. ‘‘Rājā nāma upagatasampattajanānaṃ bahūnamabhivandanīyo bhavati, bhagavāpi, mahārāja, upagatasampattadevamanussānaṃ bahūnamabhivandanīyo, tenāpi kāraṇena tathāgato vuccati ‘rājā’ti. ‘‘Rājā nāma yassa kassaci ārādhakassa pasīditvā varitaṃ varaṃ datvā kāmena tappayati, bhagavāpi, mahārāja, yassa kassaci kāyena vācāya manasā ārādhakassa pasīditvā varitaṃ varamanuttaraṃ sabbadukkhaparimuttiṃ datvā asesakāmavarena ca tappayati, tenāpi kāraṇena tathāgato vuccati ‘rājā’ti. ‘‘Rājā nāma āṇaṃ vītikkamantaṃ vigarahati jhāpeti [jāpeti (sī. pī.)] dhaṃseti, bhagavatopi, mahārāja, sāsanavare āṇaṃ atikkamanto alajjī maṅkubhāvena oññāto hīḷito garahito bhavitvā vajjati jinasāsanavaramhā, tenāpi kāraṇena tathāgato vuccati ‘rājā’ti. ‘‘Rājā nāma pubbakānaṃ dhammikānaṃ rājūnaṃ paveṇimanusiṭṭhiyā dhammādhammamanudīpayitvā dhammena rajjaṃ kārayamāno pihayito piyo patthito bhavati janamanussānaṃ, ciraṃ rājakulavaṃsaṃ ṭhapayati dhammaguṇabalena, bhagavāpi, mahārāja, pubbakānaṃ sayambhūnaṃ paveṇimanusiṭṭhiyā dhammādhammamanudīpayitvā dhammena lokamanusāsamāno pihayito piyo patthito devamanussānaṃ ciraṃ sāsanaṃ pavatteti dhammaguṇabalena, tenāpi kāraṇena tathāgato vuccati ‘rājā’ti. Evamanekavidhaṃ, mahārāja, kāraṇaṃ, yena kāraṇena tathāgato brāhmaṇopi bhaveyya rājāpi bhaveyya, sunipuṇo bhikkhu kappampi no naṃ sampādeyya, kiṃ atibahuṃ bhaṇitena, saṃkhittaṃ sampaṭicchitabba’’nti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Brāhmaṇarājavādapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Gāthābhigītabhojanakathāpañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā – ‘‘‘Gāthābhigītaṃ me abhojaneyyaṃ [abhojanīyaṃ (ka.) su. ni. 81 passitabbaṃ], sampassataṃ brāhmaṇa nesa dhammā; Gāthābhigītaṃ panudanti buddhā, dhamme satī brāhmaṇa vuttiresā’ti. ‘‘Puna ca bhagavā parisāya dhammaṃ desento kathento anupubbikathaṃ paṭhamaṃ tāva dānakathaṃ katheti, pacchā sīlakathaṃ, tassa bhagavato sabbalokissarassa bhāsitaṃ sutvā devamanussā abhisaṅkharitvā dānaṃ denti, tassa taṃ uyyojitaṃ dānaṃ sāvakā paribhuñjanti. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘gāthābhigītaṃ me abhojaneyya’nti, tena hi ‘bhagavā dānakathaṃ paṭhamaṃ kathetī’ti yaṃ vacanaṃ, taṃ micchā. Yadi dānakathaṃ paṭhamaṃ katheti, tena hi ‘gāthābhigītaṃ me abhojaneyya’nti tampi vacanaṃ micchā. Kiṃ kāraṇaṃ? Yo so, bhante, dakkhiṇeyyo gihīnaṃ piṇḍapātadānassa vipākaṃ katheti, tassa te dhammakathaṃ sutvā pasannacittā aparāparaṃ dānaṃ denti, ye taṃ dānaṃ paribhuñjanti, sabbe te gāthābhigītaṃ paribhuñjanti. Ayampi ubhato koṭiko pañho nipuṇo gambhīro tapānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘gāthābhigītaṃ me abhojaneyyaṃ, sampassataṃ brāhmaṇa nesa dhammo. Gāthābhigītaṃ panudanti buddhā, dhamme satī brāhmaṇa vuttiresā’ti, katheti ca bhagavā paṭhamaṃ dānakathaṃ, tañca pana kiriyaṃ sabbesaṃ tathāgatānaṃ paṭhamaṃ dānakathāya, tattha cittaṃ abhiramāpetvā pacchā sīle niyojenti. Yathā, mahārāja, manussā taruṇadārakānaṃ paṭhamaṃ tāva kīḷābhaṇḍakāni denti. Seyyathidaṃ, vaṅkakaṃ ghaṭikaṃ ciṅgulakaṃ pattāḷhakaṃ rathakaṃ dhanukaṃ, pacchā te sake sake kamme niyojenti. Evameva kho, mahārāja, tathāgato paṭhamaṃ dānakathāya cittaṃ abhiramāpetvā pacchā sīle niyojeti. ‘‘Yathā vā pana, mahārāja, bhisakko nāma āturānaṃ paṭhamaṃ tāva catūhapañcāhaṃ telaṃ pāyeti balakaraṇāya sinehanāya, pacchā vireceti. Evameva kho, mahārāja, tathāgato paṭhamaṃ tāva dānakathāya cittaṃ abhiramāpetvā pacchā sīle niyojeti. Dāyakānaṃ, mahārāja, dānapatīnaṃ cittaṃ mudukaṃ hoti maddavaṃ siniddhaṃ, tena te dānasetusaṅkamena dānanāvāya saṃsārasāgarapāramanugacchanti, tasmā tesaṃ paṭhamaṃ kammabhūmimanusāsati, na ca kenaci [tena (sī. pī.)] viññattimāpajjatī’’ti. ‘‘Bhante nāgasena, ‘viññatti’nti yaṃ vadesi, kati pana tā viññattiyo’’ti? ‘‘Dvemā, mahārāja, viññattiyo kāyaviññatti vacīviññatti cāti. Tattha atthi kāyaviññatti sāvajjā, atthi anavajjā. Atthi vacīviññatti sāvajjā, atthi anavajjā. ‘‘Katamā kāyaviññatti sāvajjā? Idhekacco bhikkhu kulāni upagantvā anokāse ṭhito ṭhānaṃ bhañjati, ayaṃ kāyaviññatti sāvajjā. Tāya ca viññāpitaṃ ariyā na paribhuñjanti, so ca puggalo ariyānaṃ samaye oññāto hoti hīḷito khīḷito garahito paribhūto acittīkato, bhinnājīvotveva saṅkhaṃ gacchati. ‘‘Puna caparaṃ, mahārāja, idhekacco bhikkhu kulāni upagantvā anokāse ṭhito galaṃ paṇāmetvā morapekkhitaṃ pekkhati ‘evaṃ ime passantī’ti, tena ca te passanti. Ayampi kāyaviññatti sāvajjā. Tāya ca viññāpitaṃ ariyā na paribhuñjanti, so ca puggalo ariyānaṃ samaye oññāto hoti hīḷito khīḷito garahito paribhūto acittīkato, bhinnājīvotveva saṅkhaṃ gacchati. ‘‘Puna caparaṃ, mahārāja, idhekacco bhikkhu hanukāya vā bhamukāya vā aṅguṭṭhena vā viññāpeti, ayampi kāyaviññatti sāvajjā, tāya ca viññāpitaṃ ariyā na paribhuñjanti, so ca puggalo ariyānaṃ samaye oññāto hoti hīḷito khīḷito garahito paribhūto acittīkato, bhinnājīvotveva saṅkhaṃ gacchati. ‘‘Katamā kāyaviññatti anavajjā? Idha bhikkhu kulāni upagantvā sato samāhito sampajāno ṭhānepi aṭṭhānepi yathānusiṭṭhiṃ gantvā ṭhāne tiṭṭhati, dātukāmesu tiṭṭhati, adātukāmesu pakkamati. Ayaṃ kāyaviññatti anavajjā, tāya ca viññāpitaṃ ariyā paribhuñjanti, so ca puggalo ariyānaṃ samaye vaṇṇito hoti thuto pasattho sallekhitācāro, parisuddhājīvotveva saṅkhaṃ gacchati. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena – ‘Na ve yācanti sappaññā, dhīro ca veditumarahati [ariyā garahanti yācanaṃ (sī. pī.)]; Uddissa ariyā tiṭṭhanti, esā ariyāna yācanā’ti. ‘‘Katamā vacīviññatti sāvajjā? Idha, mahārāja, bhikkhu vācāya bahuvidhaṃ viññāpeti cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhāraṃ, ayaṃ vacīviññatti sāvajjā, tāya ca viññāpitaṃ ariyā na paribhuñjanti, so ca puggalo ariyānaṃ samaye oññāto hoti hīḷito khīḷito garahito paribhūto acittīkato, bhinnājīvotveva saṅkhaṃ gacchati. ‘‘Puna caparaṃ, mahārāja, idhekacco bhikkhu paresaṃ sāvento evaṃ bhaṇati ‘iminā me attho’ti, tāya ca vācāya paresaṃ sāvitāya tassa lābho uppajjati, ayampi vacīviññatti sāvajjā, tāya ca viññāpitaṃ ariyā na paribhuñjanti, so ca puggalo ariyānaṃ samaye oññāto hoti hīḷito khīḷito garahito paribhūto acittīkato, bhinnājīvotveva saṅkhaṃ gacchati. ‘‘Puna caparaṃ, mahārāja, idhekacco bhikkhu vacīvipphārena parisāya sāveti ‘evañca evañca bhikkhūnaṃ dātabba’nti, tañca te vacanaṃ sutvā parikittitaṃ abhiharanti, ayampi vacīviññatti sāvajjā, tāya ca viññāpitaṃ ariyā na paribhuñjanti, so ca puggalo ariyānaṃ samaye oññāto hoti hīḷito khīḷito garahito paribhūto acittīkato, bhinnājīvotveva saṅkhaṃ gacchati. ‘‘Nanu, mahārāja, theropi sāriputto atthaṅgate sūriye rattibhāge gilāno samāno therena mahāmoggallānena bhesajjaṃ pucchīyamāno vācaṃ bhindi, tassa tena vacībhedena bhesajjaṃ uppajji. Atha thero sāriputto ‘vacībhedena me imaṃ bhesajjaṃ uppannaṃ, mā me ājīvo bhijjī’ti ājīvabhedabhayā taṃ bhesajjaṃ pajahi na upajīvi. Evampi vacīviññatti sāvajjā, tāya ca viññāpitaṃ ariyā na paribhuñjanti. So ca puggalo ariyānaṃ samaye oññāto hoti hīḷito khīḷito garahito paribhūto acittīkato, bhinnājīvotveva saṅkhaṃ gacchati. ‘‘Katamā vacīviññatti anavajjā? Idha, mahārāja, bhikkhu sati paccaye bhesajjaṃ viññāpeti ñātipavāritesu kulesu, ayaṃ vacīviññatti anavajjā, tāya ca viññāpitaṃ ariyā paribhuñjanti, so ca puggalo ariyānaṃ samaye vaṇṇito hoti thomito pasattho, parisuddhājīvotveva saṅkhaṃ gacchati, anumato tathāgatehi arahantehi sammāsambuddhehi. ‘‘Yaṃ pana, mahārāja, tathāgato kasibhāradvājassa brāhmaṇassa bhojanaṃ pajahi [pajahati (ka.)], taṃ āveṭhanaviniveṭhanakaḍḍhananiggahappaṭikammena nibbatti, tasmā tathāgato taṃ piṇḍapātaṃ paṭikkhipi na upajīvī’’ti. ‘‘Sabbakālaṃ, bhante nāgasena, tathāgate bhuñjamāne devatā dibbaṃ ojaṃ patte ākiranti, udāhu ‘sūkaramaddave ca madhupāyāse cā’ti dvīsu yeva piṇḍapātesu ākiriṃsū’’ti? ‘‘Sabbakālaṃ, mahārāja, tathāgate bhuñjamāne devatā dibbaṃ ojaṃ gahetvā upatiṭṭhitvā uddhaṭuddhaṭe ālope ākiranti. ‘‘Yathā, mahārāja, rañño sūdo rañño bhuñjantassa sūpaṃ gahetvā upatiṭṭhitvā kabaḷe kabaḷe sūpaṃ ākirati, evameva kho, mahārāja, sabbakālaṃ tathāgate bhuñjamāne devatā dibbaṃ ojaṃ gahetvā upatiṭṭhitvā uddhaṭuddhaṭe ālope dibbaṃ ojaṃ ākiranti. Verañjāyampi, mahārāja, tathāgatassa sukkhayavapulake [sukkhayavamūlake (ka.)] bhuñjamānassa devatā dibbena ojena temayitvā temayitvā upasaṃhariṃsu, tena tathāgatassa kāyo upacito ahosī’’ti. ‘‘Lābhā vata, bhante nāgasena, tāsaṃ devatānaṃ, yā tathāgatassa sarīrappaṭijaggane satataṃ samitaṃ ussukkamāpannā. Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Gāthābhigītabhojanakathāpañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Dhammadesanāya appossukkapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Bhante nāgasena, tumhe bhaṇatha ‘tathāgatena catūhi ca asaṅkhyeyyehi kappānaṃ satasahassena ca etthantare sabbaññutañāṇaṃ paripācitaṃ mahato janakāyassa samuddharaṇāyā’ti. Puna ca ‘sabbaññutaṃ pattassa appossukkatāya cittaṃ nami, no dhammadesanāyā’ti. ‘‘Yathā nāma, bhante nāgasena, issāso vā issāsantevāsī vā bahuke divase saṅgāmatthāya upāsanaṃ sikkhitvā sampatte mahāyuddhe osakkeyya, evameva kho, bhante nāgasena, tathāgatena catūhi ca asaṅkhyeyyehi kappānaṃ satasahassena ca etthantare sabbaññutañāṇaṃ paripācetvā mahato janakāyassa samuddharaṇāya sabbaññutaṃ pattena dhammadesanāya osakkitaṃ. ‘‘Yathā vā pana, bhante nāgasena, mallo vā mallantevāsī vā bahuke divase nibbuddhaṃ sikkhitvā sampatte mallayuddhe osakkeyya, evameva kho, bhante nāgasena, tathāgatena catūhi ca asaṅkhyeyyehi kappānaṃ satasahassena ca etthantare sabbaññutañāṇaṃ paripācetvā mahato janakāyassa samuddharaṇāya sabbaññutaṃ pattena dhammadesanāya osakkitaṃ. ‘‘Kiṃ nu kho, bhante nāgasena, tathāgatena bhayā osakkitaṃ, udāhu apākaṭatāya osakkitaṃ, udāhu dubbalatāya osakkitaṃ, udāhu asabbaññutāya osakkitaṃ, kiṃ tattha kāraṇaṃ, iṅgha me tvaṃ kāraṇaṃ brūhi kaṅkhāvitaraṇāya. Yadi, bhante nāgasena, tathāgatena catūhi ca asaṅkhyeyyehi kappānaṃ satasahassena ca etthantare sabbaññutañāṇaṃ paripācitaṃ mahato janakāyassa samuddharaṇāya, tena hi ‘sabbaññutaṃ pattassa appossukkatāya cittaṃ nami, no dhammadesanāyā’ti yaṃ vacanaṃ, taṃ micchā. Yadi sabbaññutaṃ pattassa appossukkatāya cittaṃ nami no dhammadesanāya, tena hi ‘tathāgatena catūhi ca asaṅkhyeyyeti kappānaṃ satasahassena ca etthantare sabbaññutañāṇaṃ paripācitaṃ mahato janakāyassa samuddharaṇāyā’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho gambhīro dunnibbeṭho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Paripācitañca, mahārāja, tathāgatena catūhi ca asaṅkhyeyyehi kappānaṃ satasahassena ca etthantare sabbaññutañāṇaṃ mahato janakāyassa samuddharaṇāya, pattasabbaññutassa ca appossukkatāya cittaṃ nami, no dhammadesanāya. Tañca pana dhammassa gambhīranipuṇaduddasaduranubodhasukhumaduppaṭivedhataṃ sattānañca ālayārāmataṃ sakkāyadiṭṭhiyā daḷhasuggahitatañca disvā ‘kiṃ nu kho, kathaṃ nu kho’ti appossukkatāya cittaṃ nami, no dhammadesanāya, sattānaṃ paṭivedhacintanamānasaṃ yevetaṃ. ‘‘Yathā, mahārāja, bhisakko sallakatto anekabyādhiparipīḷitaṃ naraṃ upasaṅkamitvā evaṃ cintayati ‘kena nu kho upakkamena katamena vā bhesajjena imassa byādhi vūpasameyyā’ti, evameva kho, mahārāja, tathāgatassa sabbakilesabyādhiparipīḷitaṃ janaṃ dhammassa ca gambhīranipuṇaduddasaduranubodhasukhumaduppaṭivedhataṃ disvā ‘kiṃ nu kho, kathaṃ nu kho’ti appossukkatāya cittaṃ nami, no dhammadesanāya, sattānaṃ paṭivedhacintanamānasaṃ yevetaṃ. ‘‘Yathā, mahārāja, rañño khattiyassa muddhāvasittassa dovārikaanīkaṭṭhapārisajjanegamabhaṭabala [balattha (sī. pī.)] amaccarājaññarājūpajīvine jane disvā evaṃ cittamuppajjeyya ‘kiṃ nu kho, kathaṃ nu kho ime saṅgaṇhissāmī’ti, evameva kho, mahārāja, tathāgatassa dhammassa gambhīranipuṇaduddasaduranubodhasukhumaduppaṭivedhataṃ sattānañca ālayārāmataṃ sakkāyadiṭṭhiyā daḷhasuggahitatañca disvā ‘kiṃ nu kho, kathaṃ nu kho’ti appossukkatāya cittaṃ nami, no dhammadesanāya, sattānaṃ paṭivedhacintanamānasaṃ yevetaṃ. ‘‘Api ca, mahārāja, sabbesaṃ tathāgatānaṃ dhammatā esā, yaṃ brahmunā āyācitā dhammaṃ desenti. Tattha pana kiṃ kāraṇaṃ? Ye tena samayena manussā tāpasaparibbājakā samaṇabrāhmaṇā, sabbete brahmadevatā honti brahmagarukā brahmaparāyaṇā, tasmā tassa balavato yasavato ñātassa paññātassa uttarassa accuggatassa onamanena sadevako loko onamissati okappessati adhimuccissatīti iminā ca, mahārāja, kāraṇena tathāgatā brahmunā āyācitā dhammaṃ desenti. ‘‘Yathā, mahārāja, koci rājā vā rājamahāmatto vā yassa onamati apacitiṃ karoti, balavatarassa tassa onamanena avasesā janatā onamati apacitiṃ karoti, evameva kho, mahārāja, brahme onamite tathāgatānaṃ sadevako loko onamissati, pūjitapūjako mahārāja, loko, tasmā so brahmā sabbesaṃ tathāgatānaṃ āyācati dhammadesanāya, tena ca kāraṇena tathāgatā brahmunā āyācitā dhammaṃ desentī’’ti. ‘‘Sādhu, bhante nāgasena, sunibbeṭhito pañho, atibhadrakaṃ veyyākaraṇaṃ, evametaṃ tathā sampaṭicchāmī’’ti. Dhammadesanāya appossukkapañho dasamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "Ācariyānācariyapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "‘‘Bhante, nāgasena, bhāsitampetaṃ bhagavatā – ‘‘‘Na me ācariyo atthi, sadiso me na vijjati; Sadevakasmiṃ lokasmiṃ, natthi me paṭipuggalo’ti [mahāva. 11]. ‘‘Puna ca bhaṇitaṃ ‘iti kho, bhikkhave, āḷāro kālāmo ācariyo me samāno antevāsiṃ maṃ samānaṃ attanā samasamaṃ ṭhapesi, uḷārāya ca maṃ pūjāya pūjesī’ti. Yadi, bhante nāgasena, tathāgatena bhaṇitaṃ ‘na me ācariyo atthi, sadiso me na vijjati. Sadevakasmiṃ lokasmiṃ, natthi me paṭipuggalo’ti, tena hi ‘iti kho, bhikkhave, āḷāro kālāmo ācariyo me samāno antevāsiṃ maṃ samānaṃ attanā samasamaṃ ṭhapesī’ti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatena bhaṇitaṃ ‘iti kho, bhikkhave, āḷāro kālāmo ācariyo me samāno antevāsiṃ maṃ samānaṃ attanā samasamaṃ ṭhapesī’ti, tena hi ‘na me ācariyo atthi, sadiso me na vijjati. Sadevakasmiṃ lokasmiṃ, natthi me paṭipuggalo’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Bhāsitampetaṃ, mahārāja, tathāgatena ‘na me ācariyo atthi, sadiso me na vijjati. Sadevakasmiṃ lokasmiṃ, natthi me paṭipuggalo’ti, bhaṇitañca ‘iti kho, bhikkhave, āḷāro kālāmo ācariyo me samāno antevāsiṃ maṃ samānaṃ attanā samasamaṃ ṭhapesi, uḷārāya ca maṃ pūjāya pūjesī’ti. ‘‘Tañca pana vacanaṃ pubbeva sambodhā anabhisambuddhassa bodhisattasseva sato ācariyabhāvaṃ sandhāya bhāsitaṃ. ‘Pañcime, mahārāja, pubbeva sambodhā anabhisambuddhassa bodhisattassa sato ācariyā, yehi anusiṭṭho bodhisatto tattha tattha divasaṃ vītināmesi. Katame pañca? Ye te, mahārāja, aṭṭha brāhmaṇā jātamatte bodhisatte lakkhaṇāni pariggaṇhiṃsu, seyyathīdaṃ, rāmo dhajo lakkhaṇo mantī yañño suyāmo subhojo sudattoti. Te tassa sotthiṃ pavedayitvā rakkhākammaṃ akaṃsu, te ca paṭhamaṃ ācariyā. ‘‘Puna caparaṃ, mahārāja, bodhisattassa pitā suddhodano rājā yaṃ tena samayena abhijātaṃ udiccajātimantaṃ padakaṃ veyyākaraṇaṃ chaḷaṅgavantaṃ sabbamittaṃ nāma brāhmaṇaṃ upanetvā sovaṇṇena bhiṅgārena [bhiṅkārena (sī. pī.)] udakaṃ oṇojetvā ‘imaṃ kumāraṃ sikkhāpehī’ti adāsi, ayaṃ dutiyo ācariyo. ‘‘Puna caparaṃ, mahārāja, yā sā devatā bodhisattaṃ saṃvejesī, yassā vacanaṃ sutvā bodhisatto saṃviggo ubbiggo tasmiṃ yeva khaṇe nekkhammaṃ nikkhamitvā pabbaji, ayaṃ tatiyo ācariyo. ‘‘Puna caparaṃ, mahārāja, āḷāro kālāmo ākiñcaññāyatanassa parikammaṃ ācikkhi, ayaṃ catuttho ācariyo. ‘‘Puna caparaṃ, mahārāja, udako rāmaputto nevasaññānāsaññāyatanassa parikammaṃ ācikkhi [ācikkhati (ka.)], ayaṃ pañcamo ācariyo. Ime kho, mahārāja, pubbeva sambodhā anabhisambuddhassa bodhisattassa sato pañca ācariyā. Te ca pana ācariyā lokiye dhamme. Imasmiñca pana, mahārāja, lokuttare dhamme sabbaññutañāṇappaṭivedhāya natthi tathāgatassa anuttaro anusāsako, sayambhū, mahārāja, tathāgato anācariyako, tasmā kāraṇā tathāgatena bhaṇitaṃ ‘na me ācariyo atthi, sadiso me na vijjati. Sadevakasmiṃ lokasmiṃ, natthi me paṭipuggalo’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Ācariyānācariyapañho ekādasamo. Santhavavaggo pañcamo. Imasmiṃ vagge ekādasa pañho. Meṇḍakapañho niṭṭhito.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Anumānapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}