{
  "id": "mil.2",
  "title": {
    "pali": "Addhānavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Dhammasantatipañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "Rājā āha ‘‘bhante nāgasena, yo uppajjati, so eva so, udāhu añño’’ti? Thero āha ‘‘na ca so, na ca añño’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, yadā tvaṃ daharo taruṇo mando uttānaseyyako ahosi, so yeva tvaṃ etarahi mahanto’’ti? ‘‘Na hi, bhante, añño so daharo taruṇo mando uttānaseyyako ahosi, añño ahaṃ etarahi mahanto’’ti. ‘‘Evaṃ sante kho, mahārāja, mātātipi na bhavissati, pitātipi na bhavissati, ācariyotipi na bhavissati, sippavātipi na bhavissati, sīlavātipi na bhavissati, paññavātipi na bhavissati. Kiṃ nu kho, mahārāja, aññā eva kalalassa mātā, aññā abbudassa mātā, aññā pesiyā mātā, aññā ghanassa mātā, aññā khuddakassa mātā, aññā mahantassa mātā, añño sippaṃ sikkhati, añño sikkhito bhavati, añño pāpakammaṃ karoti, aññassa hatthapādā chijjantī’’ti? ‘‘Na hi, bhante. Tvaṃ pana, bhante, evaṃ vutte kiṃ vadeyyāsī’’ti? Thero āha ‘‘ahaññeva kho, mahārāja, daharo ahosiṃ taruṇo mando uttānaseyyako, ahaññeva etarahi mahanto, imameva kāyaṃ nissāya sabbe te ekasaṅgahitā’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso padīpaṃ padīpeyya, kiṃ so sabbarattiṃ padīpeyyā’’ti? ‘‘Āma, bhante, sabbarattiṃ padīpeyyā’’ti. ‘‘Kiṃ nu kho, mahārāja, yā purime yāme acci, sā majjhime yāme accī’’ti? ‘‘Na hi bhante’’ti. ‘‘Yā majjhime yāme acci, sā pacchime yāme accī’’ti? ‘‘Na hi bhante’’ti. ‘‘Kiṃ nu kho, mahārāja, añño so ahosi purime yāme padīpo, añño majjhime yāme padīpo, añño pacchime yāme padīpo’’ti? ‘‘Na hi bhante, taṃ yeva nissāya sabbarattiṃ padīpito’’ti. ‘‘Evameva kho, mahārāja, dhammasantati sandahati, añño uppajjati, añño nirujjhati, apubbaṃ acarimaṃ viya sandahati, tena na ca so, na ca añño, purimaviññāṇe pacchimaviññāṇaṃ saṅgahaṃ gacchatī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, khīraṃ duyhamānaṃ kālantarena dadhi parivatteyya, dadhito navanītaṃ, navanītato ghataṃ parivatteyya, yo nu kho, mahārāja, evaṃ vadeyya ‘yaṃ yeva khīraṃ taṃ yeva dadhi, yaṃ yeva dadhi taṃ yeva navanītaṃ, yaṃ yeva navanītaṃ taṃ yeva ghata’nti, sammā nu kho so, mahārāja, vadamāno vadeyyā’’ti? ‘‘Na hi bhante, taṃyeva nissāya sambhūta’’nti. ‘‘Evameva kho, mahārāja, dhammasantati sandahati, añño uppajjati, añño nirujjhati, apubbaṃ acarimaṃ viya sandahati, tena na ca so, na ca añño, purimaviññāṇe pacchimaviññāṇaṃ saṅgahaṃ gacchatī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Dhammasantatipañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Paṭisandahanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Rājā āha ‘‘bhante nāgasena, yo na paṭisandahati, jānāti so ‘na paṭisandahissāmī’ti? ‘‘Āma, mahārāja, yo na paṭisandahati, jānāti so ‘na paṭisandahissāmī’ti. ‘‘Kathaṃ, bhante, jānātī’’ti? ‘‘Yo hetu yo paccayo, mahārāja, paṭisandahanāya, tassa hetussa tassa paccayassa uparamā jānāti so ‘na paṭisandahissāmī’’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kassako gahapatiko kasitvā ca vapitvā ca dhaññāgāraṃ paripūreyya. So aparena samayena neva kasseyya na vappeyya, yathāsambhatañca dhaññaṃ paribhuñjeyya vā visajjeyya vā yathā paccayaṃ vā kareyya, jāneyya so, mahārāja, kassako gahapatiko ‘na me dhaññāgāraṃ paripūressatī’ti? ‘‘Āma, bhante, jāneyyā’’ti. ‘‘Kathaṃ jāneyyā’’ti? ‘‘Yo hetu yo paccayo dhaññāgārassa paripūraṇāya, tassa hetussa tassa paccayassa uparamā jānāti ‘na me dhaññāgāraṃ paripūressatī’’’ti. ‘‘Evameva kho, mahārāja, yo hetu yo paccayo paṭisandahanāya, tassa hetussa tassa paccayassa uparamā jānāti so ‘na paṭisandahissāmī’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Paṭisandahanapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Ñāṇapaññāpañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Rājā āha ‘‘bhante nāgasena, yassa ñāṇaṃ uppannaṃ, tassa paññā uppannā’’ti? ‘‘Āma, mahārāja, yassa ñāṇaṃ uppannaṃ, tassa paññā uppannā’’ti. ‘‘Kiṃ, bhante, yaññeva ñāṇaṃ sā yeva paññā’’ti? ‘‘Āma, mahārāja, yaññeva ñāṇaṃ sā yeva paññā’’ti. ‘‘Yassa pana, bhante, taññeva ñāṇaṃ sā yeva paññā uppannā, kiṃ sammuyheyya so, udāhu na sammuyheyyā’’ti? ‘‘Katthaci, mahārāja, sammuyheyya, katthaci na sammuyheyyā’’ti. ‘‘Kuhiṃ, bhante, sammuyheyyā’’ti? ‘‘Aññātapubbesu vā, mahārāja, sippaṭṭhānesu, agatapubbāya vā disāya, assutapubbāya vā nāmapaññattiyā sammuyheyyā’’ti. ‘‘Kuhiṃ na sammuyheyyā’’ti? ‘‘Yaṃ kho pana, mahārāja, tāya paññāya kataṃ ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā, tahiṃ na sammuyheyyā’’ti. ‘‘Moho panassa, bhante, kuhiṃ gacchatī’’ti? ‘‘Moho kho, mahārāja, ñāṇe uppannamatte tattheva nirujjhatī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso andhakāragehe padīpaṃ āropeyya, tato andhakāro nirujjheyya, āloko pātubhaveyya. Evameva kho, mahārāja, ñāṇe uppannamatte moho tattheva nirujjhatī’’ti. ‘‘Paññā pana, bhante, kuhiṃ gacchatī’’ti? ‘‘Paññāpi kho, mahārāja, sakiccayaṃ katvā tattheva nirujjhati, yaṃ pana tāya paññāya kataṃ ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā, taṃ na nirujjhatī’’ti. ‘‘Bhante nāgasena, yaṃ panetaṃ brūsi ‘paññā sakiccayaṃ katvā tattheva nirujjhati, yaṃ pana tāya paññāya kataṃ ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā, taṃ na nirujjhatī’ti, tassa opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, yo koci puriso rattiṃ lekhaṃ pesetukāmo lekhakaṃ pakkosāpetvā padīpaṃ āropetvā lekhaṃ likhāpeyya, likhite pana lekhe padīpaṃ vijjhāpeyya, vijjhāpitepi padīpe lekhaṃ na vinasseyya. Evameva kho, mahārāja, paññā sakiccayaṃ katvā tattheva nirujjhati, yaṃ pana tāya paññāya kataṃ ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā, taṃ na nirujjhatī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, puratthimesu janapadesu manussā anugharaṃ pañca pañca udakaghaṭakāni ṭhapenti ālimpanaṃ vijjhāpetuṃ, ghare paditte tāni pañca udakaghaṭakāni gharassūpari khipanti, tato aggi vijjhāyati, kiṃ nu kho, mahārāja, tesaṃ manussānaṃ evaṃ hoti ‘puna tehi ghaṭehi ghaṭakiccaṃ karissāmā’’’ti? ‘‘Na hi, bhante, alaṃ tehi ghaṭehi, kiṃ tehi ghaṭehī’’ti? ‘‘Yathā, mahārāja, pañca udakaghaṭakāni, evaṃ pañcindriyāni daṭṭhabbāni saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriyaṃ. Yathā te manussā, evaṃ yogāvacaro daṭṭhabbo. Yathā aggi, evaṃ kilesā daṭṭhabbā. Yathā pañcahi udakaghaṭakehi aggi vijjhāpīyati, evaṃ pañcindriyehi kilesā vijjhāpiyanti, vijjhāpitāpi kilesā na puna sambhavanti. Evameva kho, mahārāja, paññā sakiccayaṃ katvā tattheva nirujjhati, yaṃ pana tāya paññāya kataṃ ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā, taṃ na nirujjhatī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, vejjo pañcamūlabhesajjāni gahetvā gilānakaṃ upasaṅkamitvā tāni pañcamūlabhesajjāni pisitvā [piṃsitvā (sī. pī.)] gilānakaṃ pāyeyya, tehi ca dosā niddhameyyuṃ, kiṃ nu kho, mahārāja, tassa vejjassa evaṃ hoti ‘puna tehi pañcamūlabhesajjehi bhesajjakiccaṃ karissāmī’’’ti? ‘‘Na hi, bhante, alaṃ tehi pañcamūlabhesajjehi, kiṃ tehi pañcamūlabhesajjehī’’ti? ‘‘Yathā, mahārāja, pañcamūlabhesajjāni, evaṃ pañcindriyāni daṭṭhabbāni saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriyaṃ, yathā vejjo, evaṃ yogāvacaro daṭṭhabbo. Yathā byādhi, evaṃ kilesā daṭṭhabbā. Yathā byādhito puriso, evaṃ puthujjano daṭṭhabbo. Yathā pañcamūlabhesajjehi gilānassa dosā niddhantā, dose niddhante gilāno arogo hoti, evaṃ pañcindriyehi kilesā niddhamīyanti, niddhamitā ca kilesā na puna sambhavanti. Evameva kho, mahārāja, paññā sakiccayaṃ katvā tattheva nirujjhati, yaṃ pana tāya paññāya kataṃ ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā, taṃ na nirujjhatī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, saṅgāmāvacaro yodho pañca kaṇḍāni gahetvā saṅgāmaṃ otareyya parasenaṃ vijetuṃ, so saṅgāmagato tāni pañca kaṇḍāni khipeyya, tehi ca parasenā bhijjeyya, kiṃ nu kho, mahārāja, tassa saṅgāmāvacarassa yodhassa evaṃ hoti ‘puna tehi kaṇḍehi kaṇḍakiccaṃ karissāmī’’’ti? ‘‘Na hi, bhante, alaṃ tehi kaṇḍehi, kiṃ tehi kaṇḍehī’’ti? ‘‘Yathā, mahārāja, pañca kaṇḍāni, evaṃ pañcindriyāni daṭṭhabbāni saddhindriyaṃ vīriyindriyaṃ satindriyaṃ samādhindriyaṃ paññindriyaṃ. Yathā, mahārāja, saṅgāmāvacaro yodho, evaṃ yogāvacaro daṭṭhabbo. Yathā parasenā, evaṃ kilesā daṭṭhabbā. Yathā pañcahi kaṇḍehi parasenā bhijjati, evaṃ pañcindriyehi kilesā bhijjanti, bhaggā ca kilesā na puna sambhavanti. Evameva kho, mahārāja, paññā sakiccayaṃ katvā tattheva nirujjhati, yaṃ pana tāya paññāya kataṃ ‘anicca’nti vā ‘dukkha’nti vā ‘anattā’ti vā, taṃ na nirujjhatī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Ñāṇapaññāpañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Paṭisandahanapuggalavediyanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Rājā āha ‘‘bhante nāgasena, yo na paṭisandahati, vedeti so kiñci dukkhaṃ vedana’’nti? Thero āha ‘‘kiñci vedeti, kiñci na vedetī’’ti. ‘‘Kiṃ vedeti, kiṃ na vedetī’’ti? ‘‘Kāyikaṃ, mahārāja, vedanaṃ vedeti, cetasikaṃ vedanaṃ na vedetī’’ti. ‘‘Kathaṃ, bhante, kāyikaṃ vedanaṃ vedeti, kathaṃ cetasikaṃ vedanaṃ na vedetī’’ti? ‘‘Yo hetu yo paccayo kāyikāya dukkhavedanāya uppattiyā, tassa hetussa tassa paccayassa anuparamā kāyikaṃ dukkhavedanaṃ vedeti, yo hetu yo paccayo cetasikāya dukkhavedanāya uppattiyā, tassa hetussa tassa paccayassa uparamā cetasikaṃ dukkhavedanaṃ na vedeti. Bhāsitampetaṃ, mahārāja, bhagavatā – ‘so ekaṃ vedanaṃ vedeti kāyikaṃ na cetasika’’’nti. ‘‘Bhante nāgasena, yo dukkhaṃ vedanaṃ vedeti, kasmā so na parinibbāyatī’’ti? ‘‘Natthi, mahārāja, arahato anunayo vā paṭigho vā, na ca arahanto apakkaṃ pātenti paripākaṃ āgamenti paṇḍitā. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Nābhinandāmi maraṇaṃ, nābhinandāmi jīvitaṃ; Kālañca paṭikaṅkhāmi, nibbisaṃ bhatako yathā. ‘‘‘Nābhinandāmi maraṇaṃ, nābhinandāmi jīvitaṃ; Kālañca paṭikaṅkhāmi, sampajāno patissato’’’ti. ‘‘Kallosi, bhante nāgasenā’’ti [passa theragā. 654]. Paṭisandahanapuggalavediyanapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Vedanāpañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Rājā āha ‘‘bhante nāgasena, sukhā vedanā kusalā vā akusalā vā abyākatā vā’’ti? ‘‘Siyā, mahārāja, kusalā, siyā akusalā, siyā abyākatā’’ti. ‘‘Yadi, bhante, kusalā na dukkhā, yadi dukkhā na kusalā, kusalaṃ dukkhanti nuppajjatī’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, idha purisassa hatthe tattaṃ ayoguḷaṃ nikkhipeyya, dutiye hatthe sītaṃ himapiṇḍaṃ nikkhipeyya, kiṃ nu kho, mahārāja, ubhopi te daheyyu’’nti? ‘‘Āma, bhante, ubhopi te daheyyu’’nti. ‘‘Kiṃ nu kho, te mahārāja, ubhopi uṇhā’’ti? ‘‘Na hi bhante’’ti. ‘‘Kiṃ pana te, mahārāja, ubhopi sītalā’’ti? ‘‘Na hi bhante’’ti. ‘‘Ājānāhi niggahaṃ yadi tattaṃ dahati, na ca te ubhopi uṇhā, tena nuppajjati. Yadi sītalaṃ dahati, na ca te ubhopi sītalā, tena nuppajjati. Kissa pana te, mahārāja, ubhopi dahanti, na ca te ubhopi uṇhā, na ca te ubhopi sītalā? Ekaṃ uṇhaṃ, ekaṃ sītalaṃ, ubhopi te dahanti, tena nuppajjatī’’ti. ‘‘Nāhaṃ paṭibalo tayā vādinā saddhiṃ sallapituṃ, sādhu atthaṃ jappehī’’ti. Tato thero abhidhammasaṃyuttāya kathāya rājānaṃ milindaṃ saññāpesi – ‘‘Chayimāni, mahārāja, gehanissitāni somanassāni, cha nekkhammanissitāni somanassāni, cha gehanissitāni domanassāni, cha nekkhammanissitāni domanassāni, cha gehanissitā upekkhā, cha nekkhammanissitā upekkhāti, imāni cha chakkāni, atītāpi chattiṃsavidhā vedanā, anāgatāpi chattiṃsavidhā vedanā, paccuppannāpi chattiṃsavidhā vedanā, tadekajjhaṃ abhisaññuhitvā abhisampiṇḍetvā aṭṭhasataṃ vedanā hontī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Vedanāpañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Nāmarūpaekattanānattapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Rājā āha ‘‘bhante nāgasena, ko paṭisandahatī’’ti? Thero āha ‘‘nāmarūpaṃ kho, mahārāja, paṭisandahatī’’ti. ‘‘Kiṃ imaṃ yeva nāmarūpaṃ paṭisandahatī’’ti? ‘‘Na kho, mahārāja, imaṃ yeva nāmarūpaṃ paṭisandahati, iminā pana, mahārāja, nāmarūpena kammaṃ karoti sobhanaṃ vā pāpakaṃ vā, tena kammena aññaṃ nāmarūpaṃ paṭisandahatī’’ti. ‘‘Yadi, bhante, na imaṃ yeva nāmarūpaṃ paṭisandahati, nanu so mutto bhavissati pāpakehi kammehī’’ti? Thero āha ‘‘yadi na paṭisandaheyya, mutto bhaveyya pāpakehi kammehi. Yasmā ca kho, mahārāja, paṭisandahati, tasmā na mutto pāpakehi kammehī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso aññatarassa purisassa ambaṃ avahareyya, tamenaṃ ambasāmiko gahetvā rañño dasseyya ‘iminā deva purisena mayhaṃ ambā avahaṭā’ti, so evaṃ vadeyya ‘nāhaṃ, deva, imassa ambe avaharāmi, aññe te ambā, ye iminā ropitā, aññe te ambā, ye mayā avahaṭā, nāhaṃ daṇḍappatto’ti. Kiṃ nu kho so, mahārāja, puriso daṇḍappatto bhaveyyā’’ti? ‘‘Āma, bhante, daṇḍappatto bhaveyyā’’ti. ‘‘Kena kāraṇenā’’ti? ‘‘Kiñcāpi so evaṃ vadeyya, purimaṃ, bhante, ambaṃ appaccakkhāya pacchimena ambena so puriso daṇḍappatto bhaveyyā’’ti. ‘‘Evameva kho, mahārāja, iminā nāmarūpena kammaṃ karoti sobhanaṃ vā pāpakaṃ vā, tena kammena aññaṃ nāmarūpaṃ paṭisandahati, tasmā na mutto pāpakehi kammehī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso aññatarassa purisassa sāliṃ avahareyya…pe… ucchuṃ avahareyya…pe… yathā mahārāja koci puriso hemantakāle aggiṃ jāletvā visibbetvā [visīvetvā (sī. pī.)] avijjhāpetvā pakkameyya, atha kho so aggi aññatarassa purisassa khettaṃ ḍaheyya [upaḍaheyya (ka.)], tamenaṃ khettasāmiko gahetvā rañño dasseyya ‘iminā, deva, purisena mayhaṃ khettaṃ daḍḍha’nti. So evaṃ vadeyya ‘nāhaṃ, deva, imassa khettaṃ jhāpemi, añño so aggi, yo mayā avijjhāpito, añño so aggi, yenimassa khettaṃ daḍḍhaṃ, nāhaṃ daṇḍappatto’ti. Kiṃ nu kho so, mahārāja, puriso daṇḍappatto bhaveyyā’’ti? ‘‘Āma, bhante, daṇḍappatto bhaveyyā’’ti. ‘‘Kena kāraṇenā’’ti? ‘‘Kiñcāpi so evaṃ vadeyya, purimaṃ, bhante, aggiṃ appaccakkhāya pacchimena agginā so puriso daṇḍappatto bhaveyyā’’ti. ‘‘Evameva kho, mahārāja, iminā nāmarūpena kammaṃ karoti sobhanaṃ vā pāpakaṃ vā, tena kammena aññaṃ nāmarūpaṃ paṭisandahati, tasmā na mutto pāpakehi kammehī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso padīpaṃ ādāya pāsādaṃ abhirūhitvā bhuñjeyya, padīpo jhāyamāno tiṇaṃ jhāpeyya, tiṇaṃ jhāyamānaṃ gharaṃ jhāpeyya, gharaṃ jhāyamānaṃ gāmaṃ jhāpeyya, gāmajano taṃ purisaṃ gahetvā evaṃ vadeyya ‘kissa tvaṃ, bho purisa, gāmaṃ jhāpesī’ti, so evaṃ vadeyya ‘nāhaṃ, bho, gāmaṃ jhāpemi, añño so padīpaggi, yassāhaṃ ālokena bhuñjiṃ, añño so aggi, yena gāmo jhāpito’ti, te vivadamānā tava santike āgaccheyyuṃ, kassa tvaṃ, mahārāja, aṭṭaṃ [atthaṃ (sī. pī.)] dhāreyyāsī’’ti? ‘‘Gāmajanassa bhante’’ti. ‘‘Kiṃ kāraṇā’’ti? ‘‘Kiñcāpi so evaṃ vadeyya, api ca tato eva so aggi nibbatto’’ti. ‘‘Evameva kho, mahārāja, kiñcāpi aññaṃ māraṇantikaṃ nāmarūpaṃ, aññaṃ paṭisandhismiṃ nāmarūpaṃ, api ca tato yeva taṃ nibbattaṃ, tasmā na mutto pāpakehi kammehī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso dahariṃ dārikaṃ vāretvā suṅkaṃ datvā pakkameyya. Sā aparena samayena mahatī assa vayappattā, tato añño puriso suṅkaṃ datvā vivāhaṃ kareyya, itaro āgantvā evaṃ vadeyya ‘kissa pana me tvaṃ, ambho purisa, bhariyaṃ nesī’ti? So evaṃ vadeyya ‘nāhaṃ tava bhariyaṃ nemi, aññā sā dārikā daharī taruṇī, yā tayā vāritā ca dinnasuṅkā ca, aññāyaṃ dārikā mahatī vayappattā mayā vāritā ca dinnasuṅkā cā’ti, te vivadamānā tava santike āgaccheyyuṃ. Kassa tvaṃ, mahārāja, aṭṭaṃ dhāreyyāsī’’ti? ‘‘Purimassa bhante’’ti. ‘‘Kiṃ kāraṇā’’ti? ‘‘Kiñcāpi so evaṃ vadeyya, api ca tato yeva sā mahatī nibbattā’’ti. ‘‘Evameva kho, mahārāja, kiñcāpi aññaṃ māraṇantikaṃ nāmarūpaṃ, aññaṃ paṭisandhismiṃ nāmarūpaṃ, api ca tato yeva taṃ nibbattaṃ, tasmā naparimutto pāpakehi kammehī’’ti. ‘‘Bhiyyo opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso gopālakassa hatthato khīraghaṭaṃ kiṇitvā tasseva hatthe nikkhipitvā pakkameyya ‘sve gahetvā gamissāmī’ti, taṃ aparajju dadhi sampajjeyya. So āgantvā evaṃ vadeyya ‘dehi me khīraghaṭa’nti. So dadhiṃ dasseyya. Itaro evaṃ vadeyya ‘nāhaṃ tava hatthato dadhiṃ kiṇāmi, dehi me khīraghaṭa’nti. So evaṃ vadeyya ‘ajānato te khīraṃ dadhibhūta’nti te vivadamānā tava santike āgaccheyyuṃ, kassa tvaṃ mahārāja, aṭṭaṃ dhāreyyāsī’’ti? ‘‘Gopālakassa bhante’’ti. ‘‘Kiṃ kāraṇā’’ti? ‘‘Kiñcāpi so evaṃ vadeyya, api ca tato yeva taṃ nibbatta’’nti. ‘‘Evameva kho, mahārāja, kiñcāpi aññaṃ māraṇantikaṃ nāmarūpaṃ, aññaṃ paṭisandhismiṃ nāmarūpaṃ, api ca tato yeva taṃ nibbattaṃ, tasmā na parimutto pāpakehi kammehī’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Nāmarūpaekattanānattapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Therapaṭisandahanāpaṭisandahanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Rājā āha ‘‘bhante nāgasena, tvaṃ pana paṭisandahissasī’’ti? ‘‘Alaṃ, mahārāja, kiṃ te tena pucchitena, nanu mayā paṭikacceva akkhātaṃ ‘sace, mahārāja, saupādāno bhavissāmi, paṭisandahissāmi, sace anupādāno bhavissāmi, na paṭisandahissāmī’’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kocideva puriso rañño adhikāraṃ kareyya. Rājā tuṭṭho adhikāraṃ dadeyya, so tena adhikārena pañcahi kāmaguṇehi samappito samaṅgibhūto paricareyya, so ce janassa āroceyya ‘na me rājā kiñci paṭikarotī’ ti. Kiṃ nu kho so, mahārāja, puriso yuttakārī bhaveyyā’’ti? ‘‘Na hi bhante’’ti. ‘‘Evameva kho, mahārāja, kiṃ te tena pucchitena, nanu mayā paṭikacceva akkhātaṃ ‘sace saupādāno bhavissāmi, paṭisandahissāmi, sace anupādāno bhavissāmi, na paṭisandahissāmī’’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Therapaṭisandahanāpaṭisandahanapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Nāmarūpapaṭisandahanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Rājā āha ‘‘bhante nāgasena, yaṃ panetaṃ brūsi ‘nāmarūpa’nti, tattha katamaṃ nāmaṃ, katamaṃ rūpa’’nti. ‘‘Yaṃ tattha, mahārāja, oḷārikaṃ, etaṃ rūpaṃ, ye tattha sukhumā cittacetasikā dhammā, etaṃ nāma’’nti. ‘‘Bhante nāgasena, kena kāraṇena nāmaṃ yeva na paṭisandahati, rūpaṃ yeva vā’’ti? ‘‘Aññamaññūpanissitā, mahārāja, ete dhammā ekatova uppajjantī’’ti. ‘‘Opammaṃ karohī’’ti. ‘‘Yathā, mahārāja, kukkuṭiyā kalalaṃ na bhaveyya, aṇḍampi na bhaveyya, yañca tattha kalalaṃ, yañca aṇḍaṃ, ubhopete aññamaññūpanissitā, ekatova nesaṃ uppatti hoti. Evameva kho, mahārāja, yadi tattha nāmaṃ na bhaveyya, rūpampi na bhaveyya, yañceva tattha nāmaṃ, yañceva rūpaṃ, ubhopete aññamaññūpanissitā, ekatova nesaṃ uppatti hoti. Evametaṃ dīghamaddhānaṃ sandhāvita’’nti. ‘‘Kallosi, bhante nāgasenā’’ti. Nāmarūpapaṭisandahanapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Addhānapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Rājā āha ‘‘bhante nāgasena, yaṃ panetaṃ brūsi ‘dīghamaddhāna’nti, kimetaṃ addhānaṃ nāmā’’ti? ‘‘Atīto, mahārāja, addhā, anāgato addhā, paccuppanno addhā’’ti. ‘‘Kiṃ pana, bhante, sabbe addhā atthī’’ti? ‘‘Koci, mahārāja, addhā atthi, koci natthī’’ti. ‘‘Katamo pana, bhante, atthi, katamo natthī’’ti? ‘‘Ye te, mahārāja, saṅkhārā atītā vigatā niruddhā vipariṇatā, so addhā natthi, ye dhammā vipākā, ye ca vipākadhammadhammā, ye ca aññatra paṭisandhiṃ denti, so addhā atthi. Ye sattā kālaṅkatā aññatra uppannā, so ca addhā atthi. Ye sattā kālaṅkatā aññatra anuppannā, so addhā natthi. Ye ca sattā parinibbutā, so ca addhā natthi parinibbutattā’’ti. ‘‘Kallosi, bhante nāgasenā’’ti. Addhānapañho navamo. Addhānavaggo dutiyo. Imasmiṃ vagge nava pañhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}