{
  "id": "mil.8",
  "title": {
    "pali": "Iddhibalavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Katādhikārasaphalapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "Atha kho milindo rājā katāvakāso nipacca garuno pāde sirasi añjaliṃ katvā etadavoca ‘‘bhante nāgasena, ime titthiyā evaṃ bhaṇanti [vañco bhavati aphalo (sī. pī. ka.)] ‘yadi buddho pūjaṃ sādiyati, na parinibbuto buddho saṃyutto lokena antobhaviko lokasmiṃ lokasādhāraṇo, tasmā tassa kato adhikāro avañjho bhavati saphalo. Yadi parinibbuto visaṃyutto lokena nissaṭo sabbabhavehi, tassa pūjā nuppajjati, parinibbuto na kiñci sādiyati, asādiyantassa kato adhikāro vañjho bhavati aphalo’ti ubhato koṭiko eso pañho, neso visayo appattamānasānaṃ, mahantānaṃ yeveso visayo, bhindetaṃ diṭṭhijālaṃ ekaṃse ṭhapaya, taveso pañho anuppatto, anāgatānaṃ jinaputtānaṃ cakkhuṃ dehi paravādaniggahāyā’’ti. Thero āha ‘‘parinibbuto, mahārāja, bhagavā, na ca bhagavā pūjaṃ sādiyati, bodhimūle yeva tathāgatassa sādiyanā pahīnā, kiṃ pana anupādisesāya nibbānadhātuyā parinibbutassa. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Pūjiyantā [pūjitā (syā.)] asamasamā, sadevamānusehi te; Na sādiyanti sakkāraṃ, buddhānaṃ esa dhammatā’’’ti. Rājā āha ‘‘bhante nāgasena, putto vā pituno vaṇṇaṃ bhāsati, pitā vā puttassa vaṇṇaṃ bhāsati, na cetaṃ kāraṇaṃ paravādānaṃ niggahāya, pasādappakāsanaṃ nāmetaṃ, iṅgha me tvaṃ tattha kāraṇaṃ sammā brūhi sakavādassa patiṭṭhāpanāya diṭṭhijālaviniveṭhanāyā’’ti. Thero āha ‘‘parinibbuto, mahārāja, bhagavā, na ca bhagavā pūjaṃ sādiyati, asādiyantasseva tathāgatassa devamanussā dhāturatanaṃ vatthuṃ karitvā tathāgatassa ñāṇaratanārammaṇena sammāpaṭipattiṃ sevantā tisso sampattiyo paṭilabhanti. ‘‘Yathā, mahārāja, mahatimahāaggikkhandho pajjalitvā nibbāyeyya, api nu kho so, mahārāja, mahāaggikkhandho sādiyati tiṇakaṭṭhupādāna’’nti? ‘‘Jalamānopi so, bhante, mahāaggikkhandho tiṇakaṭṭhupādānaṃ na sādiyati, kiṃ pana nibbuto upasanto acetano sādiyati? ‘‘Tasmiṃ pana, mahārāja, aggikkhandhe uparate upasante loke aggi suñño hotī’’ti. ‘‘Na hi, bhante, kaṭṭhaṃ aggissa vatthu hoti upādānaṃ, ye keci manussā aggikāmā, te attano thāmabalavīriyena paccattapurisakārena kaṭṭhaṃ manthayitvā [madditvā (ka.)] aggiṃ nibbattetvā tena agginā aggikaraṇīyāni kammāni karontī’’ti. ‘‘Tena hi, mahārāja, titthiyānaṃ vacanaṃ micchā bhavati ‘asādiyantassa kato adhikāro vañjho bhavati aphalo’ti. ‘‘Yathā, mahārāja, mahatimahāaggikkhandho pajjali, evameva bhagavā dasasahassiyā [dasasahassimhi (sī. pī. ka.)] lokadhātuyā buddhasiriyā pajjali. Yathā, mahārāja, mahatimahāaggikkhandho pajjalitvā nibbuto, evameva bhagavā dasasahassiyā lokadhātuyā buddhasiriyā pajjalitvā anupādisesāya nibbānadhātuyā parinibbuto. Yathā, mahārāja, nibbuto aggikkhandho tiṇakaṭṭhupādānaṃ na sādiyati, evameva kho lokahitassa sādiyanā pahīnā upasantā. Yathā, mahārāja, manussā nibbute aggikkhandhe anupādāne attano thāmabalavīriyena paccattapurisakārena kaṭṭhaṃ manthayitvā aggiṃ nibbattetvā tena agginā aggikaraṇīyāni kammāni karonti, evameva kho devamanussā tathāgatassa parinibbutassa asādiyantasseva dhāturatanaṃ vatthuṃ karitvā tathāgatassa ñāṇaratanārammaṇena sammāpaṭipattiṃ sevantā tisso sampattiyo paṭilabhanti, imināpi, mahārāja, kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphalo. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi yena kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphalo. Yathā, mahārāja, mahatimahāvāto vāyitvā uparameyya, api nu kho so, mahārāja, uparato vāto sādiyati puna nibbattāpana’’nti? ‘‘Na hi, bhante, uparatassa vātassa ābhogo vā manasikāro vā puna nibbattāpanāya’’. ‘‘Kiṃ kāraṇaṃ’’? ‘‘Acetanā sā vāyodhātū’’ti. ‘‘Api nu tassa, mahārāja, uparatassa vātassa vātoti samaññā apagacchatī’’ti? ‘‘Na hi, bhante, tālavaṇṭavidhūpanāni vātassa uppattiyā paccayā, ye keci manussā uṇhābhitattā pariḷāhaparipīḷitā, te tālavaṇṭena vā vidhūpanena vā attano thāmabalavīriyena paccattapurisakārena taṃ nibbattetvā tena vātena uṇhaṃ nibbāpenti pariḷāhaṃ vūpasamentī’’ti. ‘‘Tena hi, mahārāja, titthiyānaṃ vacanaṃ micchā bhavati ‘asādiyantassa kato adhikāro vañjho bhavati aphalo’ti. ‘‘Yathā, mahārāja, mahatimahāvāto vāyi, evameva bhagavā dasasahassiyā lokadhātuyā sītalamadhurasantasukhumamettāvātena upavāyi. Yathā, mahārāja, mahatimahāvāto vāyitvā uparato, evameva bhagavā sītalamadhurasantasukhumamettāvātena upavāyitvā anupādisesāya nibbānadhātuyā parinibbuto. Yathā, mahārāja, uparato vāto puna nibbattāpanaṃ na sādiyati, evameva lokahitassa sādiyanā pahīnā upasantā. Yathā, mahārāja, te manussā uṇhābhitattā pariḷāhaparipīḷitā, evameva devamanussā tividhaggisantāpapariḷāhaparipīḷitā. Yathā tālavaṇṭavidhūpanāni vātassa nibbattiyā paccayā honti, evameva tathāgatassa dhātu ca ñāṇaratanañca paccayo hoti tissannaṃ sampattīnaṃ paṭilābhāya. Yathā manussā uṇhābhitattā pariḷāhaparipīḷitā tālavaṇṭena vā vidhūpanena vā vātaṃ nibbattetvā uṇhaṃ nibbāpenti pariḷāhaṃ vūpasamenti, evameva devamanussā tathāgatassa parinibbutassa asādiyantasseva dhātuñca ñāṇaratanañca pūjetvā kusalaṃ nibbattetvā tena kusalena tividhaggisantāpapariḷāhaṃ nibbāpenti vūpasamenti. Imināpi, mahārāja, kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphaloti. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi paravādānaṃ niggahāya. Yathā, mahārāja, puriso bheriṃ ākoṭetvā saddaṃ nibbatteyya, yo so bherisaddo purisena nibbattito, so saddo antaradhāyeyya, api nu kho so, mahārāja, saddo sādiyati puna nibbattāpana’’nti? ‘‘Na hi, bhante, antarahito so saddo, natthi tassa puna uppādāya ābhogo vā manasikāro vā, sakiṃ nibbatte bherisadde antarahite so bherisaddo samucchinno hoti. Bherī pana, bhante, paccayo hoti saddassa nibbattiyā, atha puriso paccaye sati attajena vāyāmena bheriṃ akoṭetvā saddaṃ nibbattetī’’ti. ‘‘Evameva kho, mahārāja, bhagavā sīlasamādhipaññāvimuttivimuttiñāṇadassanaparibhāvitaṃ dhāturatanañca dhammañca vinayañca anusiṭṭhañca [anusatthiñca (sī. pī.)] satthāraṃ ṭhapayitvā sayaṃ anupādisesāya nibbānadhātuyā parinibbuto, na ca parinibbute bhagavati sampattilābho upacchinno hoti, bhavadukkhapaṭipīḷitā sattā dhāturatanañca dhammañca vinayañca anusiṭṭhañca paccayaṃ karitvā sampattikāmā sampattiyo paṭilabhanti, imināpi, mahārāja, kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphaloti. ‘‘Diṭṭhañcetaṃ, mahārāja, bhagavatā anāgatamaddhānaṃ. Kathitañca bhaṇitañca ācikkhitañca ‘siyā kho panānanda, tumhākaṃ evamassa atītasatthukaṃ pāvacanaṃ natthi no satthāti, na kho panetaṃ, ānanda, evaṃ daṭṭhabbaṃ, yo vo, ānanda, mayā dhammo ca vinayo ca desito paññatto, so vo mamaccayena satthā’ti. Parinibbutassa tathāgatassa asādiyantassa kato adhikāro vañjho bhavati aphaloti, taṃ tesaṃ titthiyānaṃ vacanaṃ micchā abhūtaṃ vitathaṃ alikaṃ viruddhaṃ viparītaṃ dukkhadāyakaṃ dukkhavipākaṃ apāyagamanīyanti. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi yena kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphalo. Sādiyati nu kho, mahārāja, ayaṃ mahāpathavī ‘sabbabījāni mayi saṃviruhantū’’’ti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana tāni, mahārāja, bījāni asādiyantiyā mahāpathaviyā saṃviruhitvā daḷhamūlajaṭāpatiṭṭhitā khandhasārasākhāparivitthiṇṇā pupphaphaladharā hontī’’ti? ‘‘Asādiyantīpi, bhante, mahāpathavī tesaṃ bījānaṃ vatthuṃ hoti paccayaṃ deti viruhanāya, tāni bījāni taṃ vatthuṃ nissāya tena paccayena saṃviruhitvā daḷhamūlajaṭāpatiṭṭhitā khandhasārasākhāparivitthiṇṇā pupphaphaladharā hontī’’ti. ‘‘Tena hi, mahārāja, titthiyā sake vāde naṭṭhā honti hatā viruddhā, sace te bhaṇanti ‘asādiyantassa kato adhikāro vañjho bhavati aphalo’ ti. ‘‘Yathā, mahārāja, mahāpathavī, evaṃ tathāgato arahaṃ sammāsambuddho. Yathā, mahārāja, mahāpathavī na kiñci sādiyati, evaṃ tathāgato na kiñci sādiyati. Yathā, mahārāja, tāni bījāni pathaviṃ nissāya saṃviruhitvā daḷhamūlajaṭāpatiṭṭhitā khandhasārasākhāparivitthiṇṇā pupphaphaladharā honti, evaṃ devamanussā tathāgatassa parinibbutassa asādiyantasseva dhātuñca ñāṇaratanañca nissāya daḷhakusalamūlapatiṭṭhitā samādhikkhandhadhammasārasīlasākhāparivitthiṇṇā vimuttipupphasāmaññaphaladharā honti, imināpi, mahārāja, kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphaloti. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi yena kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphalo. Sādiyanti nu kho, mahārāja, ime oṭṭhā goṇā gadrabhā ajā pasū manussā antokucchismiṃ kimikulānaṃ sambhava’’nti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana te, mahārāja, kimayo tesaṃ asādiyantānaṃ antokucchismiṃ sambhavitvā bahuputtanattā vepullataṃ pāpuṇantī’’ti? ‘‘Pāpassa, bhante, kammassa balavatāya asādiyantānaṃ yeva tesaṃ sattānaṃ antokucchismiṃ kimayo sambhavitvā bahuputtanattā vepullataṃ pāpuṇantī’’ti. ‘‘Evameva kho, mahārāja, tathāgatassa parinibbutassa asādiyantasseva dhātussa ca ñāṇārammaṇassa ca balavatāya tathāgate kato adhikāro avañjho bhavati saphaloti. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi yena kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphalo. Sādiyanti nu kho, mahārāja, ime manussā ime aṭṭhanavuti rogā kāye nibbattantū’’ti? ‘‘Na hi, bhante’’ti. ‘‘Kissa pana te, mahārāja, rogā asādiyantānaṃ kāye nipatantī’’ti? ‘‘Pubbe katena, bhante, duccaritenā’’ti. ‘‘Yadi, mahārāja, pubbe kataṃ akusalaṃ idha vedanīyaṃ hoti, tena hi, mahārāja, pubbe katampi idha katampi kusalākusalaṃ kammaṃ avañjhaṃ bhavati saphalanti. Imināpi, mahārāja, kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphaloti. ‘‘Sutapubbaṃ pana tayā, mahārāja, nandako nāma yakkho theraṃ sāriputtaṃ āsādayitvā pathaviṃ paviṭṭho’’ti? ‘‘Āma, bhante, suyyati, loke pākaṭo eso’’ti. ‘‘Api nu kho, mahārāja, thero sāriputto sādiyi nandakassa yakkhassa mahāpathavigilana’’nti [pavattamānepi (syā.)]. ‘‘Ubbattiyantepi, bhante, sadevake loke patamānepi chamāyaṃ candimasūriye vikirantepi sinerupabbatarāje thero sāriputto na parassa dukkhaṃ sādiyeyya. Taṃ kissa hetu? Yena hetunā thero sāriputto kujjheyya vā dusseyya vā, so hetu therassa sāriputtassa samūhato samucchinno, hetuno samugghātitattā, bhante, thero sāriputto jīvitahārakepi kopaṃ na kareyyā’’ti. ‘‘Yadi, mahārāja, thero sāriputto nandakassa yakkhassa pathavigilanaṃ na sādiyi, kissa pana nandako yakkho pathaviṃ paviṭṭho’’ti? ‘‘Akusalassa, bhante, kammassa balavatāyā’’ti. ‘‘Yadi, mahārāja, akusalassa kammassa balavatāya nandako yakkho pathaviṃ paviṭṭho, asādiyantassāpi kato aparādho avañjho bhavati saphalo. Tena hi, mahārāja, akusalassapi kammassa balavatāya asādiyantassa kato adhikāro avañjho bhavati saphaloti. Imināpi, mahārāja, kāraṇena tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphaloti. ‘‘Kati nu kho te, mahārāja, manussā, ye etarahi mahāpathaviṃ paviṭṭhā, atthi te tattha savaṇa’’nti? ‘‘Āma, bhante, suyyatī’’ti. ‘‘Iṅgha tvaṃ, mahārāja, sāvehī’’ti? ‘‘Ciñcamāṇavikā, bhante, suppabuddho ca sakko, devadatto ca thero, nandako ca yakkho, nando ca māṇavakoti. Sutametaṃ, bhante, ime pañca janā mahāpathaviṃ paviṭṭhā’’ti. ‘‘Kismiṃ te, mahārāja, aparaddhā’’ti? ‘‘Bhagavati ca, bhante, sāvakesu cā’’ti. ‘‘Api nu kho, mahārāja, bhagavā vā sāvakā vā sādiyiṃsu imesaṃ mahāpathavipavisana’’nti? ‘‘Na hi bhante’’ti. ‘‘Tena hi, mahārāja, tathāgatassa parinibbutassa asādiyantasseva kato adhikāro avañjho bhavati saphalo’’ti. ‘‘Suviññāpito, bhante nāgasena, pañho gambhīro uttānīkato, guyhaṃ vidaṃsitaṃ, gaṇṭhi bhinno, gahanaṃ agahanaṃ kataṃ, naṭṭhā paravādā, bhaggā kudiṭṭhī, nippabhā jātā kutitthiyā, tvaṃ gaṇīvarapavaramāsajjā’’ti. Katādhikārasaphalapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Sabbaññubhāvapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, buddho sabbaññū’’ti? ‘‘Āma, mahārāja, bhagavā sabbaññū, na ca bhagavato satataṃ samitaṃ ñāṇadassanaṃ paccupaṭṭhitaṃ, āvajjanapaṭibaddhaṃ bhagavato sabbaññutañāṇaṃ, āvajjitvā yadicchakaṃ jānātī’’ti. ‘‘Tena hi, bhante nāgasena, buddho asabbaññūti. Yadi tassa pariyesanāya sabbaññutañāṇaṃ hotī’’ti. ‘‘Vāhasataṃ kho, mahārāja, vīhīnaṃ aḍḍhacūḷañca vāhā vīhisattambaṇāni dve ca tumbā ekaccharākkhaṇe pavattacittassa ettakā vīhī lakkhaṃ ṭhapīyamānā [ṭhapīyamāne (sī. pī.)] parikkhayaṃ pariyādānaṃ gaccheyyuṃ? ‘‘Tatrime sattavidhā cittā pavattanti, ye te, mahārāja, sarāgā sadosā samohā sakilesā abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā, tesaṃ taṃ cittaṃ garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Abhāvitattā cittassa. Yathā, mahārāja, vaṃsanāḷassa vitatassa visālassa vitthiṇṇassa saṃsibbitavisibbitassa sākhājaṭājaṭitassa ākaḍḍhiyantassa garukaṃ hoti āgamanaṃ dandhaṃ. Kiṃ kāraṇā? Saṃsibbitavisibbitattā sākhānaṃ. Evameva kho, mahārāja, ye te sarāgā sadosā samohā sakilesā abhāvitakāyā abhāvitasīlā abhāvitacittā abhāvitapaññā, tesaṃ taṃ cittaṃ garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Saṃsibbitavisibbitattā kilesehi, idaṃ paṭhamaṃ cittaṃ. ‘‘Tatridaṃ dutiyaṃ cittaṃ vibhattamāpajjati – ye te, mahārāja, sotāpannā pihitāpāyā diṭṭhippattā viññātasatthusāsanā, tesaṃ taṃ cittaṃ tīsu ṭhānesu lahukaṃ uppajjati lahukaṃ pavattati. Uparibhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Tīsu ṭhānesu cittassa parisuddhattā upari kilesānaṃ appahīnattā. Yathā, mahārāja, vaṃsanāḷassa tipabbagaṇṭhiparisuddhassa upari sākhājaṭājaṭitassa ākaḍḍhiyantassa yāva tipabbaṃ tāva lahukaṃ eti, tato upari thaddhaṃ. Kiṃ kāraṇā? Heṭṭhā parisuddhattā upari sākhājaṭājaṭitattā. Evameva kho, mahārāja, ye te sotāpannā pihitāpāyā diṭṭhippattā viññātasatthusāsanā, tesaṃ taṃ cittaṃ tīsu ṭhānesu lahukaṃ uppajjati lahukaṃ pavattati, uparibhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Tīsu ṭhānesu cittassa parisuddhattā upari kilesānaṃ appahīnattā, idaṃ dutiyaṃ cittaṃ. ‘‘Tatridaṃ tatiyaṃ cittaṃ vibhattamāpajjati – ye te, mahārāja, sakadāgāmino, yesaṃ rāgadosamohā tanubhūtā, tesaṃ taṃ cittaṃ pañcasu ṭhānesu lahukaṃ uppajjati lahukaṃ pavattati, uparibhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Pañcasu ṭhānesu cittassa parisuddhattā upari kilesānaṃ appahīnattā. Yathā, mahārāja, vaṃsanāḷassa pañcapabbagaṇṭhiparisuddhassa upari sākhājaṭājaṭitassa ākaḍḍhiyantassa yāva pañcapabbaṃ tāva lahukaṃ eti, tato upari thaddhaṃ. Kiṃ kāraṇā? Heṭṭhā parisuddhattā upari sākhājaṭājaṭitattā. Evameva kho, mahārāja, ye te sakadāgāmino, yesaṃ rāgadosamohā tanubhūtā, tesaṃ taṃ cittaṃ pañcasu ṭhānesu lahukaṃ uppajjati lahukaṃ pavattati, uparibhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Pañcasu ṭhānesu cittassa parisuddhattā upari kilesānaṃ appahīnattā, idaṃ tatiyaṃ cittaṃ. ‘‘Tatridaṃ catutthaṃ cittaṃ vibhattamāpajjati – ye te, mahārāja, anāgāmino, yesaṃ pañcorambhāgiyāni saññojanāni pahīnāni, tesaṃ taṃ cittaṃ dasasu ṭhānesu lahukaṃ uppajjati lahukaṃ pavattati, uparibhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Dasasu ṭhānesu cittassa parisuddhattā upari kilesānaṃ appahīnattā. Yathā, mahārāja, vaṃsanāḷassa dasapabbagaṇṭhiparisuddhassa upari sākhājaṭājaṭitassa ākaḍḍhiyantassa yāva dasapabbaṃ tāva lahukaṃ eti, tato upari thaddhaṃ. Kiṃ kāraṇā? Heṭṭhā parisuddhattā upari sākhājaṭājaṭitattā. Evameva kho, mahārāja, ye te anāgāmino, yesaṃ pañcorambhāgiyāni saññojanāni pahīnāni, tesaṃ taṃ cittaṃ dasasu ṭhānesu lahukaṃ uppajjati lahukaṃ pavattati, uparibhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Dasasu ṭhānesu cittassa parisuddhattā upari kilesānaṃ appahīnattā, idaṃ catutthaṃ cittaṃ. ‘‘Tatridaṃ pañcamaṃ cittaṃ vibhattamāpajjati – ye te, mahārāja, arahanto khīṇāsavā dhotamalā vantakilesā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaññojanā pattapaṭisambhidā sāvakabhūmīsu parisuddhā, tesaṃ taṃ cittaṃ sāvakavisaye lahukaṃ uppajjati lahukaṃ pavattati, paccekabuddhabhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Parisuddhattā sāvakavisaye, aparisuddhattā paccekabuddhavisaye. Yathā, mahārāja, vaṃsanāḷassa sabbapabbagaṇṭhiparisuddhassa ākaḍḍhiyantassa lahukaṃ hoti āgamanaṃ adandhaṃ. Kiṃ kāraṇā? Sabbapabbagaṇṭhiparisuddhattā agahanattā vaṃsassa. Evameva kho, mahārāja, ye te arahanto khīṇāsavā dhotamalā vantakilesā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaññojanā pattapaṭisambhidā sāvakabhūmīsu parisuddhā, tesaṃ taṃ cittaṃ sāvakavisaye lahukaṃ uppajjati lahukaṃ pavattati, paccekabuddhabhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Parisuddhattā sāvakavisaye, aparisuddhattā paccekabuddhavisaye, idaṃ pañcamaṃ cittaṃ. ‘‘Tatridaṃ chaṭṭhaṃ cittaṃ vibhattamāpajjati – ye te, mahārāja, paccekabuddhā sayambhuno anācariyakā ekacārino khaggavisāṇakappā sakavisaye parisuddhavimalacittā, tesaṃ taṃ cittaṃ sakavisaye lahukaṃ uppajjati lahukaṃ pavattati, sabbaññubuddhabhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Parisuddhattā sakavisaye mahantattā sabbaññubuddhavisayassa. Yathā, mahārāja, puriso sakavisayaṃ parittaṃ nadiṃ rattimpi divāpi yadicchaka acchambhito otareyya, atha parato mahāsamuddaṃ gambhīraṃ vitthataṃ agādhamapāraṃ disvā bhāyeyya, dandhāyeyya na visaheyya otarituṃ. Kiṃ kāraṇā? Tiṇṇattā [ciṇṇattā (sī. syā. pī.)] sakavisayassa, mahantattā ca mahāsamuddassa. Evameva kho, mahārāja, ye te paccekabuddhā sayambhuno anācariyakā ekacārino khaggavisāṇakappā sakavisaye parisuddhavimalacittā, tesaṃ taṃ cittaṃ sakavisaye lahukaṃ uppajjati lahukaṃ pavattati, sabbaññubuddhabhūmīsu garukaṃ uppajjati dandhaṃ pavattati. Kiṃ kāraṇā? Parisuddhattā sakavisaye mahantattā sabbaññubuddhavisayassa, idaṃ chaṭṭhaṃ cittaṃ. ‘‘Tatridaṃ sattamaṃ cittaṃ vibhattamāpajjati – ye te, mahārāja, sammāsambuddhā sabbaññuno dasabaladharā catuvesārajjavisāradā aṭṭhārasahi buddhadhammehi samannāgatā anantajinā anāvaraṇañāṇā, tesaṃ taṃ cittaṃ sabbattha lahukaṃ uppajjati lahukaṃ pavattati. Kiṃ kāraṇā? Sabbattha parisuddhattā. Api nu kho, mahārāja, nārācassa sudhotassa vimalassa niggaṇṭhissa sukhumadhārassa ajimhassa avaṅkassa akuṭilassa daḷhacāpasamārūḷhassa khomasukhume vā kappāsasukhume vā kambalasukhume vā balavanipātitassa dandhāyitattaṃ vā lagganaṃ vā hotī’’ti? ‘‘Na hi, bhante, ‘‘kiṃ kāraṇā’’? ‘‘Sukhumattā vatthānaṃ sudhotattā nārācassa nipātassa ca balavattā’’ti, evameva kho, mahārāja, ye te sammāsambuddhā sabbaññuno dasabaladharā catuvesārajjavisāradā aṭṭhārasahi buddhadhammehi samannāgatā anantajinā anāvaraṇañāṇā, tesaṃ taṃ cittaṃ sabbattha lahukaṃ uppajjati lahukaṃ pavattati. Kiṃ kāraṇā? Sabbattha parisuddhattā, idaṃ sattamaṃ cittaṃ. ‘‘Tatra, mahārāja, yadidaṃ sabbaññubuddhānaṃ cittaṃ, taṃ channampi cittānaṃ gaṇanaṃ atikkamitvā asaṅkhyeyyena guṇena parisuddhañca lahukañca. Yasmā ca bhagavato cittaṃ parisuddhañca lahukañca, tasmā, mahārāja, bhagavā yamakapāṭihīraṃ dasseti. Yamakapāṭihīre, mahārāja, ñātabbaṃ buddhānaṃ bhagavantānaṃ cittaṃ evaṃ lahuparivattanti, na tattha sakkā uttariṃ kāraṇaṃ vattuṃ, tepi, mahārāja, pāṭihīrā sabbaññubuddhānaṃ cittaṃ upādāya gaṇanampi saṅkhampi kalampi kalabhāgampi na upenti, āvajjanapaṭibaddhaṃ, mahārāja, bhagavato sabbaññutañāṇaṃ, āvajjetvā yadicchakaṃ jānāti. ‘‘Yathā, mahārāja, puriso hatthe ṭhapitaṃ yaṃ kiñci dutiye hatthe ṭhapeyya vivaṭena mukhena vācaṃ nicchāreyya, mukhagataṃ bhojanaṃ gileyya, ummīletvā vā nimīleyya, nimīletvā vā ummīleyya, samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, cirataraṃ etaṃ, mahārāja, lahutaraṃ bhagavato sabbaññutañāṇaṃ, lahutaraṃ āvajjanaṃ, āvajjetvā yadicchakaṃ jānāti, āvajjanavikalamattakena na tāvatā buddhā bhagavanto asabbaññuno nāma hontī’’ti. ‘‘Āvajjanampi, bhante nāgasena, pariyesanāya kātabbaṃ, iṅgha maṃ tattha kāraṇena saññāpehī’’ti. ‘‘Yathā, mahārāja, purisassa aḍḍhassa mahaddhanassa mahābhogassa pahūtajātarūparajatassa pahūtavittūpakaraṇassa pahūtadhanadhaññassa sālivīhiyavataṇḍulatilamuggamāsapubbaṇṇāparaṇṇasappitelanavanītakhīradadhimadhuguḷaphāṇitā ca khaḷopikumbhipīṭharakoṭṭhabhājanagatā bhaveyyuṃ, tassa ca purisassa pāhunako āgaccheyya bhattāraho bhattābhikaṅkhī, tassa ca gehe yaṃ randhaṃ bhojanaṃ, taṃ pariniṭṭhitaṃ bhaveyya, kumbhito taṇḍule nīharitvā bhojanaṃ randheyya, api ca kho so, mahārāja, tāvatakena bhojanavekallamattakena adhano nāma kapaṇo nāma bhaveyyā’’ti? ‘‘Na hi, bhante, cakkavattirañño gharepi, bhante, akāle bhojanavekallaṃ hoti, kiṃ pana gahapatikassā’’ti? ‘‘Evameva kho, mahārāja, tathāgatassa āvajjanavikalamattakaṃ sabbaññutañāṇaṃ āvajjetvā yadicchakaṃ jānāti. ‘‘Yathā vā pana, mahārāja, rukkho assa phalito oṇatavinato piṇḍibhārabharito, na kiñci tattha patitaṃ phalaṃ bhaveyya, api nu kho so, mahārāja, rukkho tāvatakena patitaphalavekallamattakena aphalo nāma bhaveyyā’’ti? ‘‘Na hi, bhante, patanapaṭibaddhāni tāni rukkhaphalāni, patite yadicchakaṃ labhatī’’ti. ‘‘Evameva kho, mahārāja, tathāgatassa āvajjanapaṭibaddhaṃ sabbaññutañāṇaṃ āvajjetvā yadicchakaṃ jānātī’’ti. ‘‘Bhante nāgasena, āvajjetvā āvajjetvā buddho yadicchakaṃ jānātī’’ti? ‘‘Āma, mahārāja, bhagavā āvajjetvā āvajjetvā yadicchakaṃ jānātī’’ti. ‘‘Yathā, mahārāja, cakkavattī rājā yadā cakkaratanaṃ sarati ‘upetu me cakkaratana’nti, sarite cakkaratanaṃ upeti, evameva kho, mahārāja, tathāgato āvajjetvā āvajjetvā yadicchakaṃ jānātī’’ti. ‘‘Daḷhaṃ, bhante nāgasena, kāraṇaṃ, buddho sabbaññū, sampaṭicchāma buddho sabbaññū’’ti. Buddhasabbaññubhāvapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Devadattapabbajjapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, devadatto kena pabbājito’’ti? ‘‘Cha yime, mahārāja, khattiyakumārā bhaddiyo ca anuruddho ca ānando ca bhagu ca kimilo [kimbilo (sī. pī.) ma. ni. 2.166 passitabbaṃ] ca devadatto ca upālikappako sattamo abhisambuddhe satthari sakyakulānandajanane bhagavantaṃ anupabbajantā nikkhamiṃsu, te bhagavā pabbājesī’’ti. ‘‘Nanu, bhante, devadattena pabbajitvā saṅgho bhinno’’ti? ‘‘Āma, mahārāja, devadattena pabbajitvā saṅgho bhinno, na gihī saṅghaṃ bhindati, na bhikkhunī, na sikkhamānā, na sāmaṇero, na sāmaṇerī saṅghaṃ bhindati, bhikkhu pakatatto samānasaṃvāsako samānasīmāyaṃ ṭhito saṅghaṃ bhindatīti. Saṅghabhedako, bhante, puggalo kiṃ kammaṃ phusatī’’ti? ‘‘Kappaṭṭhitikaṃ, mahārāja, kammaṃ phusatī’’ti. ‘‘Kiṃ pana, bhante nāgasena, buddho jānāti ‘devadatto pabbajitvā saṅghaṃ bhindissati, saṅghaṃ bhinditvā kappaṃ niraye paccissatī’’’ti? ‘‘Āma, mahārāja, tathāgato jānāti ‘devadatto pabbajitvā saṅghaṃ bhindissati, saṅghaṃ bhinditvā kappaṃ niraye paccissatī’’’ti. ‘‘Yadi, bhante nāgasena, buddho jānāti ‘devadatto pabbajitvā saṅghaṃ bhindissati, saṅghaṃ bhinditvā kappaṃ niraye paccissatī’ti, tena hi, bhante nāgasena, buddho kāruṇiko anukampako hitesī sabbasattānaṃ ahitaṃ apanetvā hitamupadahatīti yaṃ vacanaṃ, taṃ micchā. Yadi taṃ ajānitvā pabbājesi, tena hi buddho asabbaññūti, ayampi ubhato koṭiko pañho tavānuppatto, vijaṭehi etaṃ mahājaṭaṃ, bhinda parāpavādaṃ, anāgate addhāne tayā sadisā buddhimanto bhikkhū dullabhā bhavissanti, ettha tava balaṃ pakāsehī’’ti. ‘‘Kāruṇiko, mahārāja, bhagavā sabbaññū ca, kāruññena, mahārāja, bhagavā sabbaññutañāṇena devadattassa gatiṃ olokento addasa devadattaṃ āpāyikaṃ kammaṃ [aparāpariyakammaṃ (sī. syā. pī.)] āyūhitvā anekāni kappakoṭisatasahassāni nirayena nirayaṃ vinipātena vinipātaṃ gacchantaṃ, taṃ bhagavā sabbaññutañāṇena jānitvā imassa apariyantakataṃ kammaṃ mama sāsane pabbajitassa pariyantakataṃ bhavissati, purimaṃ upādāya pariyantakataṃ dukkhaṃ bhavissati, apabbajitopi ayaṃ moghapuriso kappaṭṭhiyameva kammaṃ āyūhissatīti kāruññena devadattaṃ pabbājesī’’ti. ‘‘Tena hi, bhante nāgasena, buddho vadhitvā telena makkheti, papāte pātetvā hatthaṃ deti, māretvā jīvitaṃ pariyesati, yaṃ so paṭhamaṃ dukkhaṃ datvā pacchā sukhaṃ upadahatī’’ti? ‘‘Vadhetipi, mahārāja, tathāgato sattānaṃ hitavasena, pātetipi sattānaṃ hitavasena, māretipi sattānaṃ hitavasena, vadhitvāpi, mahārāja, tathāgato sattānaṃ hitameva upadahati, pātetvāpi sattānaṃ hitameva upadahati, māretvāpi sattānaṃ hitameva upadahati. Yathā, mahārāja, mātāpitaro nāma vadhitvāpi pātayitvāpi puttānaṃ hitameva upadahanti, evameva kho, mahārāja, tathāgato vadhetipi sattānaṃ hitavasena, pātetipi sattānaṃ hitavasena, māretipi sattānaṃ hitavasena, vadhitvāpi, mahārāja, tathāgato sattānaṃ hitameva upadahati, pātetvāpi sattānaṃ hitameva upadahati, māretvāpi sattānaṃ hitameva upadahati, yena yena yogena sattānaṃ guṇavuḍḍhi hoti, tena tena yogena sabbasattānaṃ hitameva upadahati. Sace, mahārāja, devadatto na pabbājeyya, gihibhūto samāno nirayasaṃvattanikaṃ bahuṃ pāpakammaṃ katvā anekāni kappakoṭisatasahassāni nirayena nirayaṃ vinipātena vinipātaṃ gacchanto bahuṃ dukkhaṃ vedayissati, taṃ bhagavā jānamāno kāruññena devadattaṃ pabbājesi, ‘mama sāsane pabbajitassa dukkhaṃ pariyantakataṃ bhavissatī’ti kāruññena garukaṃ dukkhaṃ lahukaṃ akāsi. ‘‘Yathā vā, mahārāja, dhanayasasiriñātibalena balavā puriso attano ñātiṃ vā mittaṃ vā raññā garukaṃ daṇḍaṃ dhārentaṃ attano bahuvissatthabhāvena samatthatāya garukaṃ daṇḍaṃ lahukaṃ akāsi, evameva kho, mahārāja, bhagavā bahūni kappakoṭisatasahassāni dukkhaṃ vedayamānaṃ devadattaṃ pabbājetvā sīlasamādhipaññāvimuttibalasamatthabhāvena garukaṃ dukkhaṃ lahukaṃ akāsi. ‘‘Yathā vā pana, mahārāja, kusalo bhisakko sallakatto garukaṃ rogaṃ balavosadhabalena lahukaṃ karoti, evameva kho, mahārāja, bahūni kappakoṭisatasahassāni dukkhaṃ vedayamānaṃ devadattaṃ bhagavā rogaññutāya pabbājetvā kāruññabalo patthaddhadhammosadhabalena garukaṃ dukkhaṃ lahukaṃ akāsi. Api nu kho so, mahārāja, bhagavā bahuvedanīyaṃ devadattaṃ appavedanīyaṃ karonto kiñci apuññaṃ āpajjeyyā’’ti? ‘‘Na kiñci, bhante, apuññaṃ āpajjeyya antamaso gaddūhanamattampī’’ti. ‘‘Imampi kho, mahārāja, kāraṇaṃ atthato sampaṭiccha, yena kāraṇena bhagavā devadattaṃ pabbājesi. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena bhagavā devadattaṃ pabbājesi. Yathā, mahārāja, coraṃ āgucāriṃ gahetvā rañño dasseyyuṃ, ‘ayaṃ kho, deva, coro āgucārī, imassa yaṃ icchasi, taṃ daṇḍaṃ paṇehī’ti. Tamenaṃ rājā evaṃ vadeyya ‘tena hi, bhaṇe, imaṃ coraṃ bahinagaraṃ nīharitvā āghātane sīsaṃ chindathā’’ti, ‘evaṃ devā’ti kho te rañño paṭissutvā taṃ bahinagaraṃ nīharitvā āghātanaṃ nayeyyuṃ. Tamenaṃ passeyya kocideva puriso rañño santikā laddhavaro laddhayasadhanabhogo ādeyyavacano balavicchitakārī, so tassa kāruññaṃ katvā te purise evaṃ vadeyya ‘alaṃ, bho, kiṃ tumhākaṃ imassa sīsacchedanena, tena hi bho imassa hatthaṃ vā pādaṃ vā chinditvā jīvitaṃ rakkhatha, ahametassa kāraṇā rañño santike paṭivacanaṃ karissāmī’ti. Te tassa balavato vacanena tassa corassa hatthaṃ vā pādaṃ vā chinditvā jīvitaṃ rakkheyyuṃ. Api nu kho so, mahārāja, puriso evaṃ kārī tassa corassa kiccakārī assā’’ti? ‘‘Jīvitadāyako so, bhante, puriso tassa corassa, jīvite dinne kiṃ tassa akataṃ nāma atthī’’ti? ‘‘Yā pana hatthapādacchedane vedanā, so tāya vedanāya kiñci apuññaṃ āpajjeyyā’’ti? ‘‘Attano katena so, bhante, coro dukkhavedanaṃ vedayati, jīvitadāyako pana puriso na kiñci apuññaṃ āpajjeyyā’’ti. ‘‘Evameva kho, mahārāja, bhagavā kāruññena devadattaṃ pabbājesi ‘mama sāsane pabbajitassa dukkhaṃ pariyantakataṃ bhavissatī’ti. Pariyantakatañca, mahārāja, devadattassa dukkhaṃ, devadatto, mahārāja, maraṇakāle – ‘‘‘Imehi aṭṭhīhi tamaggapuggalaṃ, devātidevaṃ naradammasārathiṃ; Samantacakkhuṃ satapuññalakkhaṇaṃ, pāṇehi buddhaṃ saraṇaṃ upemī’ti. ‘‘Pāṇupetaṃ saraṇamagamāsi. Devadatto, mahārāja, cha koṭṭhāse kate kappe atikkante paṭhamakoṭṭhāse saṅghaṃ bhindi, pañca koṭṭhāse niraye paccitvā tato muccitvā aṭṭhissaro nāma paccekabuddho bhavissati. Api nu kho so, mahārāja, bhagavā evaṃ kārī devadattassa kiccakārī assā’’ti? ‘‘Sabbadado, bhante nāgasena, tathāgato devadattassa, yaṃ tathāgato devadattaṃ paccekabodhiṃ pāpessati, kiṃ tathāgatena devadattassa akataṃ nāma atthī’’ti? ‘‘Yaṃ pana, mahārāja, devadatto saṅghaṃ bhinditvā niraye dukkhavedanaṃ vedayati, api nu kho bhagavā tatonidānaṃ kiñci apuññaṃ āpajjeyyā’’ti? ‘‘Na hi, bhante, attanā katena, bhante, devadatto kappaṃ niraye paccati, dukkhapariyantakārako satthā na kiñci apuññaṃ āpajjatī’’ti. ‘‘Imampi kho, tvaṃ mahārāja, kāraṇaṃ atthato sampaṭiccha, yena kāraṇena bhagavā devadattaṃ pabbājesi. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena bhagavā devadattaṃ pabbājesi. Yathā, mahārāja, kusalo bhisakko sallakatto vātapittasemhasannipātautupariṇāmavisamaparihāraopakkamikopakkantaṃ pūtikuṇapaduggandhābhisañchannaṃ antosallaṃ susiragataṃ pubbaruhirasampuṇṇaṃ vaṇaṃ vūpasamento vaṇamukhaṃ kakkhaḷatikhiṇakhārakaṭukena bhesajjena anulimpati paripaccanāya, paripaccitvā mudubhāvamupagataṃ satthena vikantayitvā ḍahati salākāya, daḍḍhe khāralavaṇaṃ deti, bhesajjena anulimpati vaṇaruhanāya byādhitassa sotthibhāvamanuppattiyā, api nu kho so, mahārāja, bhisakko sallakatto ahitacitto bhesajjena anulimpati, satthena vikanteti, ḍahati salākāya, khāralavaṇaṃ detī’’ti? ‘‘Na hi, bhante, hitacitto sotthikāmo tāni kiriyāni karotī’’ti. ‘‘Yā panassa bhesajjakiriyākaraṇena uppannā dukkhavedanā, tatonidānaṃ so bhisakko sallakatto kiñci apuññaṃ āpajjeyyā’’ti? ‘‘Hitacitto, bhante, sotthikāmo bhisakko sallakatto tāni kiriyāni karoti, kiṃ so tatonidānaṃ apuññaṃ āpajjeyya, saggagāmī so, bhante, bhisakko sallakatto’’ti. ‘‘Evameva kho, mahārāja, kāruññena bhagavā devadattaṃ pabbājesi dukkhaparimuttiyā. ‘‘Aparampi, mahārāja, uttariṃ kāraṇaṃ suṇohi, yena kāraṇena bhagavā devadattaṃ pabbājesi. Yathā, mahārāja, puriso kaṇṭakena viddho assa, athaññataro puriso tassa hitakāmo sotthikāmo tiṇhena kaṇṭakenavā satthamukhena vā samantato chinditvā paggharantena lohitena taṃ kaṇṭakaṃ nīhareyya, api nu kho so, mahārāja, puriso ahitakāmo taṃ kaṇṭakaṃ nīharatī’’ti? ‘‘Na hi, bhante, hitakāmo so, bhante, puriso sotthikāmo taṃ kaṇṭakaṃ nīharati. Sace so, bhante, taṃ kaṇṭakaṃ na nīhareyya, maraṇaṃ vā so tena pāpuṇeyya maraṇamattaṃ vā dukkha’’nti. ‘‘Evameva kho, mahārāja, tathāgato kāruññena devadattaṃ pabbājesi dukkhaparimuttiyā. Sace mahārāja, bhagavā devadattaṃ na pabbājeyya, kappakoṭisatasahassampi devadatto bhavaparamparāya niraye pacceyyā’’ti. ‘‘Anusotagāmiṃ, bhante nāgasena, devadattaṃ tathāgato paṭisotaṃ pāpesi, vipanthapaṭipannaṃ devadattaṃ panthe paṭipādesi, papāte patitassa devadattassa patiṭṭhaṃ adāsi, visamagataṃ devadattaṃ tathāgato samaṃ āropesi, ime ca, bhante nāgasena, hetū imāni ca kāraṇāni na sakkā aññena sandassetuṃ aññatra tavādisena buddhimatā’’ti. Devadattapabbajjapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Pathavicalanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā – ‘aṭṭhime, bhikkhave [aṭṭhime ānanda (a. ni. 8.70)], hetū aṭṭha paccayā mahato bhūmicālassa pātubhāvāyā’ti. Asesavacanaṃ idaṃ, nissesavacanaṃ idaṃ, nippariyāyavacanaṃ idaṃ, natthañño navamo hetu mahato bhūmicālassa pātubhāvāya. Yadi, bhante nāgasena, añño navamo hetu bhaveyya mahato bhūmicālassa pātubhāvāya, tampi hetuṃ bhagavā katheyya. Yasmā ca kho, bhante nāgasena, natthañño navamo hetu mahato bhūmicālassa pātubhāvāya, tasmā anācikkhito bhagavatā, ayañca navamo hetu dissati mahato bhūmicālassa pātubhāvāya, yaṃ vessantarena raññā mahādāne dīyamāne sattakkhattuṃ mahāpathavī kampitāti. Yadi, bhante nāgasena, aṭṭheva hetū aṭṭha paccayā mahato bhūmicālassa pātubhāvāya, tena hi vessantarena raññā mahādāne dīyamāne sattakkhattuṃ mahāpathavī kampitāti yaṃ vacanaṃ, taṃ micchā. Yadi vessantarena raññā mahādāne dīyamāne sattakkhattuṃ mahāpathavī kampitā, tena hi aṭṭheva hetū aṭṭha paccayā mahato bhūmicālassa pātubhāvāyāti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho sukhumo dunniveṭhiyo andhakaraṇo ceva gambhīro ca, so tavānuppatto, neso aññena ittarapaññena sakkā visajjetuṃ aññatra tavādisena buddhimatā’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā – ‘aṭṭhime, bhikkhave, hetū aṭṭha paccayā mahato bhūmicālassa pātubhāvāyā’ti. Yaṃ vessantarena raññā mahādāne dīyamāne sattakkhattuṃ mahāpathavī kampitā, tañca pana akālikaṃ kadācuppattikaṃ aṭṭhahi hetūhi vippamuttaṃ, tasmā agaṇitaṃ aṭṭhahi hetūhi. ‘‘Yathā, mahārāja, loke tayo yeva meghā gaṇīyanti vassiko hemantiko pāvusakoti. Yadi te muñcitvā añño megho pavassati, na so megho gaṇīyati sammatehi meghehi, akālameghotveva saṅkhaṃ gacchati. Evameva kho, mahārāja, vessantarena raññā mahādāne dīyamāne yaṃ sattakkhattuṃ mahāpathavī kampitā, akālikaṃ etaṃ kadācuppattikaṃ aṭṭhahi hetūhi vippamuttaṃ, na taṃ gaṇīyati aṭṭhahi hetūhi. ‘‘Yathā vā pana, mahārāja, himavantā pabbatā pañca nadisatāni sandanti, tesaṃ, mahārāja, pañcannaṃ nadisatānaṃ daseva nadiyo nadigaṇanāya gaṇīyanti. Seyyathīdaṃ, gaṅgā yamunā aciravatī sarabhū mahī sindhu sarassatī vetravatī vītaṃsā candabhāgāti, avasesā nadiyo nadigaṇanāya agaṇitā. Kiṃ kāraṇā? Na tā nadiyo dhuvasalilā. Evameva kho, mahārāja, vessantarena raññā mahādāne dīyamāne yaṃ sattakkhattuṃ mahāpathavī kampitā, akālikaṃ etaṃ kadācuppattikaṃ aṭṭhahi hetūhi vippamuttaṃ, na taṃ gaṇīyati aṭṭhahi hetūhi. ‘‘Yathā vā pana, mahārāja, rañño satampi dvisatampi tisatampi amaccā honti, tesaṃ cha yeva janā amaccagaṇanāya gaṇīyanti. Seyyathīdaṃ, senāpati purohito akkhadasso bhaṇḍāgāriko chattaggāhako khaggaggāhako. Ete yeva amaccagaṇanāya gaṇīyanti. Kiṃ kāraṇā? Yuttattā rājaguṇehi, avasesā agaṇitā, sabbe amaccātveva saṅkhaṃ gacchanti. Evameva kho, mahārāja, vessantarena raññā mahādāne dīyamāne yaṃ sattakkhattuṃ mahāpathavī kampitā, akālikaṃ etaṃ kadācuppattikaṃ aṭṭhahi hetūhi vippamuttaṃ, na taṃ gaṇīyati aṭṭhahi hetūhi. ‘‘Suyyati nu kho, mahārāja, etarahi jinasāsane katādhikārānaṃ diṭṭhadhammasukhavedanīyakammaṃ, kitti ca yesaṃ abbhuggatā devamanussesū’’ti? ‘‘Āma, bhante, suyyati etarahi jinasāsane katādhikārānaṃ diṭṭhadhammasukhavedanīyakammaṃ, kitti ca yesaṃ abbhuggatā devamanussesu satta janāti’’. ‘‘Ke ca te, mahārājā’’ti? ‘‘Sumano ca, bhante, mālākāro, ekasāṭako ca brāhmaṇo, puṇṇo ca bhatako, mallikā ca devī, gopālamātā ca devī, suppiyā ca upāsikā, puṇṇā ca dāsīti ime satta diṭṭhadhammasukhavedanīyā sattā, kitti ca imesaṃ abbhuggatā devamanussesū’’ti. ‘‘Aparepi suyyanti nu kho atīte mānusakeneva sarīradehena tidasabhavanaṃ gatā’’ti? ‘‘Āma, bhante, suyyantī’’ti. ‘‘Ke ca te, mahārājā’’ti? ‘‘Guttilo ca gandhabbo, sādhīno ca rājā, nimi ca rājā, mandhātā ca rājāti ime caturo janā suyyanti, teneva mānusakena sarīradehena tidasabhavanaṃ gatā’’ti. ‘‘Sucirampi kataṃ suyyati sukatadukkaṭanti? Sutapubbaṃ pana tayā, mahārāja, atīte vā addhāne vattamāne vā addhāne itthannāmassa dāne dīyamāne sakiṃ vā dvikkhattuṃ vā tikkhattuṃ vā mahāpathavī kampitā’’ti? ‘‘Na hi bhante’’ti. ‘‘Atthi me, mahārāja, āgamo adhigamo pariyatti savanaṃ sikkhābalaṃ sussūsā paripucchā ācariyupāsanaṃ, mayāpi na sutapubbaṃ ‘itthannāmassa dāne dīyamāne sakiṃ vā dvikkhattuṃ vā tikkhattuṃ vā mahāpathavī kampitā’ti ṭhapetvā vessantarassa rājavasabhassa dānavaraṃ. Bhagavato ca, mahārāja, kassapassa, bhagavato ca sakyamuninoti dvinnaṃ buddhānaṃ antare gaṇanapathaṃ vītivattā vassakoṭiyo atikkantā, tatthapi me savanaṃ natthi ‘itthannāmassa dāne dīyamāne sakiṃ vā dvikkhattuṃ vā tikkhattuṃ vā mahāpathavī kampitā’ti. Na, mahārāja, tāvatakena vīriyena tāvatakena parakkamena mahāpathavī kampati, guṇabhārabharitā, mahārāja, sabbasoceyyakiriyaguṇabhārabharitā dhāretuṃ na visahantī mahāpathavī calati kampati pavedhati. ‘‘Yathā, mahārāja, sakaṭassa atibhārabharitassa nābhiyo ca nemiyo ca phalanti akkho bhijjati, evameva kho, mahārāja, sabbasoceyyakiriyaguṇabhārabharitā mahāpathavī dhāretuṃ na visahantī calati kampati pavedhati. ‘‘Yathā vā pana, mahārāja, gaganaṃ anilajalavegasañchāditaṃ ussannajalabhārabharitaṃ ativātena phuṭitattā nadati ravati gaḷagaḷāyati, evameva kho, mahārāja, mahāpathavī rañño vessantarassa dānabalavipulaussannabhārabharitā dhāretuṃ na visahantī calati kampati pavedhati. Na hi, mahārāja, rañño vessantarassa cittaṃ rāgavasena pavattati, na dosavasena pavattati, na mohavasena pavattati, na mānavasena pavattati, na diṭṭhivasena pavattati, na kilesavasena pavattati, na vitakkavasena pavattati, na arativasena pavattati, atha kho dānavasena bahulaṃ pavattati ‘kinti anāgatā yācakā mama santike āgaccheyyuṃ, āgatā ca yācakā yathākāmaṃ labhitvā attamanā bhaveyyu’nti satataṃ samitaṃ dānaṃ pati mānasaṃ ṭhapitaṃ hoti. Rañño, mahārāja, vessantarassa satataṃ samitaṃ dasasu ṭhānesu mānasaṃ ṭhapitaṃ hoti dame same khantiyaṃ saṃvare yame niyame akkodhe avihiṃsāyaṃ sacce soceyye. Rañño, mahārāja, vessantarassa kāmesanā pahīnā, bhavesanā paṭippassaddhā, brahmacariyesanāya yeva ussukkaṃ āpanno, rañño, mahārāja, vessantarassa attarakkhā [pararakkhāya (sī. pī.)] pahīnā, sabbasattarakkhāya ussukkaṃ āpanno ‘kinti ime sattā samaggā assu arogā sadhanā dīghāyukā’ti bahulaṃ yeva mānasaṃ pavattati. Dadamāno ca, mahārāja, vessantaro rājā taṃ dānaṃ na bhavasampattihetu deti, na dhanahetu deti, na paṭidānahetu deti, na upalāpanahetu deti, na āyuhetu deti, na vaṇṇahetu deti, na sukhahetu deti, na balahetu deti, na yasahetu deti, na puttahetu deti, na dhītuhetu deti, atha kho sabbaññutañāṇahetu sabbaññutañāṇaratanassa kāraṇā evarūpe atulavipulānuttare dānavare adāsi, sabbaññutaṃ patto ca imaṃ gāthaṃ abhāsi – ‘‘‘Jāliṃ kaṇhājinaṃ dhītaṃ, maddideviṃ patibbataṃ; Cajamāno na cintesiṃ, bodhiyā yeva kāraṇā’ti. ‘‘Vessantaro, mahārāja, rājā akkodhena kodhaṃ jināti, asādhuṃ sādhunā jināti, kadariyaṃ dānena jināti, alikavādinaṃ saccena jināti, sabbaṃ akusalaṃ kusalena jināti. Tassa evaṃ dadamānassa dhammānugatassa dhammasīsakassa [dhammāsīsakassa (ka.)] dānanissandabalava [dānanissandabala (sī. pī.)] vīriyavipulavipphārena heṭṭhā mahāvātā sañcalanti saṇikaṃ saṇikaṃ sakiṃ sakiṃ ākulākulā vāyanti onamanti unnamanti vinamanti, chinnapattapādapā [sīnnappattapādapā (sī.)] papatanti, gumbaṃ gumbaṃ valāhakā gagane sandhāvanti, rajosañcitā vātā dāruṇā honti, gaganaṃ uppīḷitā vātā vāyanti, sahasā dhamadhamāyanti, mahābhīmo saddo niccharati, tesu vātesu kupitesu udakaṃ saṇikaṃ saṇikaṃ calati, udake calite khubbhanti macchakacchapā, yamakayamakā ūmiyo jāyanti, jalacarā sattā tasanti, jalavīci yuganaddho vattati, vīcinādo pavattati, ghorā bubbuḷā [pubbuḷā (ka.)] uṭṭhahanti, pheṇamālā bhavanti, uttarati mahāsamuddo, disāvidisaṃ dhāvati udakaṃ, uddhaṃsotapaṭisotamukhā sandanti saliladhārā, tasanti asurā garuḷā nāgā yakkhā, ubbijjanti ‘kiṃ nu kho, kathaṃ nu kho, sāgaro viparivattatī’ti, gamanapathamesanti bhītacittā, khubhite luḷite jaladhāre pakampati mahāpathavī sanagā sasāgarā, parivattati sinerugiri kūṭaselasikharo vinamamāno hoti, vimanā honti ahinakulabiḷārakoṭṭhukasūkaramigapakkhino, rudanti yakkhā appesakkhā, hasanti yakkhā mahesakkhā kampamānāya mahāpathaviyā. ‘‘Yathā, mahārāja, mahati mahāpariyoge uddhanagate udakasampuṇṇe ākiṇṇataṇḍule heṭṭhato aggi jalamāno paṭhamaṃ tāva pariyogaṃ santāpeti, pariyogo santatto udakaṃ santāpeti, udakaṃ santattaṃ taṇḍulaṃ santāpeti, taṇḍulaṃ santattaṃ ummujjati nimujjati, bubbuḷakajātaṃ hoti, pheṇamālā uttarati; evameva kho, mahārāja, vessantaro rājā yaṃ loke duccajaṃ, taṃ caji, tassa taṃ duccajaṃ cajantassa dānassa sabhāvanissandena heṭṭhā mahāvātā dhāretuṃ na visahantā parikuppiṃsu [parikampiṃsu (ka.)], mahāvātesu parikupitesu [parikhubbhitesu (syā.)] udakaṃ kampi, udake kampite mahāpathavī kampi, iti tadā mahāvātā ca udakañca mahāpathavī cāti ime tayo ekamanā viya ahesuṃ mahādānanissandena vipulabalavīriyena natthediso, mahārāja, aññassa dānānubhāvo, yathā vessantarassa rañño mahādānānubhāvo. Yathā, mahārāja, mahiyā bahuvidhā maṇayo vijjanti. Seyyathīdaṃ, indanīlo mahānīlo jotiraso veḷuriyo ummāpuppho sirīsapuppho manoharo sūriyakanto candakanto vajiro khajjopanako phussarāgo lohitaṅgo masāragalloti, ete sabbe atikkamma cakkavattimaṇi aggamakkhāyati, cakkavattimaṇi, mahārāja, samantā yojanaṃ obhāseti. Evameva kho, mahārāja, yaṃ kiñci mahiyā dānaṃ vijjati api asadisadānaṃ paramaṃ, taṃ sabbaṃ atikkamma vessantarassa rañño mahādānaṃ aggamakkhāyati, vessantarassa, mahārāja, rañño mahādāne dīyamāne sattakkhattuṃ mahāpathavī kampitā’’ti. ‘‘Acchariyaṃ, bhante nāgasena, buddhānaṃ, abbhutaṃ, bhante nāgasena, buddhānaṃ, yaṃ tathāgato bodhisatto samāno asamo lokena evaṃkhanti evaṃcitto evaṃadhimutti evaṃadhippāyo, bodhisattānaṃ, bhante nāgasena, parakkamo dakkhāpito, pāramī ca jinānaṃ bhiyyo obhāsitā, cariyaṃ caratopi tāva tathāgatassa sadevake loke seṭṭhabhāvo anudassito. Sādhu, bhante nāgasena, thomitaṃ jinasāsanaṃ, jotitā jinapāramī, chinno titthiyānaṃ vādagaṇṭhi, bhinno parāpavādakumbho [gumbo tayā viddhaṃsito (syā.)], pañho gambhīro uttānīkato, gahanaṃ agahanaṃ kataṃ, sammā laddhaṃ jinaputtānaṃ nibbāhanaṃ [nibbāyanaṃ (ka.)], evametaṃ gaṇivarapavara tathā sampaṭicchāmā’’ti. Pathavicalanapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Sivirājacakkhudānapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, tumhe evaṃ bhaṇatha ‘sivirājena yācakassa cakkhūni dinnāni, andhassa sato puna dibbacakkhūni uppannānī’ti, etampi vacanaṃ sakasaṭaṃ saniggahaṃ sadosaṃ ‘hetusamugghāte ahetusmiṃ avatthusmiṃ natthi dibbacakkhussa uppādo’ti sutte vuttaṃ, yadi, bhante nāgasena, sivirājena yācakassa cakkhūni dinnāni, tena hi ‘puna dibbacakkhūni uppannānī’ti yaṃ vacanaṃ, taṃ micchā; yadi dibbacakkhūni uppannāni, tena hi ‘sivirājena yācakassa cakkhūni dinnānī’ti yaṃ vacanaṃ, tampi micchā. Ayampi ubhato koṭiko pañho gaṇṭhitopi gaṇṭhitaro veṭhatopi veṭhataro gahanatopi gahanataro, so tavānuppatto, tattha chandamabhijanehi nibbāhanāya paravādānaṃ niggahāyā’’ti. ‘‘Dinnāni, mahārāja, sivirājena yācakassa cakkhūni, tattha mā vimatiṃ uppādehi, puna dibbāni ca cakkhūni uppannāni, tatthāpi mā vimatiṃ janehī’’ti. ‘‘Api nu kho, bhante nāgasena, hetusamugghāte ahetusmiṃ avatthusmiṃ dibbacakkhu uppajjatī’’ti? ‘‘Na hi, mahārājā’’ti. ‘‘Kiṃ pana, bhante, ettha kāraṇaṃ, yena kāraṇena hetusamugghāte ahetusmiṃ avatthusmiṃ dibbacakkhu uppajjati, iṅgha tāva kāraṇena maṃ saññāpehī’’ti? ‘‘Kiṃ pana, mahārāja, atthi loke saccaṃ nāma, yena saccavādino saccakiriyaṃ karontī’’ti? ‘‘Āma, bhante, atthi loke saccaṃ nāma, saccena, bhante nāgasena, saccavādino saccakiriyaṃ katvā devaṃ vassāpenti, aggiṃ nibbāpenti, visaṃ paṭihananti, aññampi vividhaṃ kattabbaṃ karontī’’ti. ‘‘Tena hi, mahārāja, yujjati sameti sivirājassa saccabalena dibbacakkhūni uppannānīti, saccabalena, mahārāja, avatthusmiṃ dibbacakkhu uppajjati, saccaṃ yeva tattha vatthu bhavati dibbacakkhussa uppādāya. ‘‘Yathā, mahārāja, ye keci sattā saccamanugāyanti ‘mahāmegho pavassatū’ti, tesaṃ saha saccamanugītena mahāmegho pavassati, api nu kho, mahārāja, atthi ākāse vassahetu sannicito ‘yena hetunā mahāmegho pavassatī’’’ti? ‘‘Na hi, bhante, saccaṃ yeva tattha hetu bhavati mahato meghassa pavassanāyā’’ti. ‘‘Evameva kho, mahārāja, natthi tassa pakatihetu, saccaṃ yevettha vatthu bhavati dibbacakkhussa uppādāyāti. ‘‘Yathā vā pana, mahārāja, ye keci sattā saccamanugāyanti ‘jalitapajjalitamahāaggikkhandho paṭinivattatū’ti, tesaṃ saha saccamanugītena jalitapajjalitamahāaggikkhandho khaṇena paṭinivattati. Api nu kho, mahārāja, atthi tasmiṃ jalitapajjalite mahāaggikkhandhe hetu sannicito ‘yena hetunā jalitapajjalitamahāaggikkhandho khaṇena paṭinivattatī’’ti? ‘‘Na hi, bhante, saccaṃ yeva tattha vatthu hoti tassa jalitapajjalitassa mahāaggikkhandhassa khaṇena paṭinivattanāyā’’ti. ‘‘Evameva kho, mahārāja, natthi tassa pakatihetu, saccaṃ yevettha vatthu bhavati dibbacakkhussa uppādāyāti. ‘‘Yathā vā pana, mahārāja, ye keci sattā saccamanugāyanti ‘visaṃ halāhalaṃ agadaṃ bhavatū’ti. Tesaṃ saha saccamanugītena visaṃ halāhalaṃ khaṇena agadaṃ bhavati, api nu kho, mahārāja, atthi tasmiṃ halāhalavise hetu sannicito ‘yena hetunā visaṃ halāhalaṃ khaṇena agadaṃ bhavatī’’’ti? ‘‘Na hi, bhante, saccaṃ yeva tattha hetu bhavati visassa halāhalassa khaṇena paṭighātāyā’’ti. ‘‘Evameva kho, mahārāja, vinā pakatihetuṃ saccaṃ yevettha vatthu bhavati dibbacakkhussa uppādāyāti. ‘‘Catunnampi, mahārāja, ariyasaccānaṃ paṭivedhāya natthaññaṃ vatthu, saccaṃ vatthuṃ katvā cattāri ariyasaccāni paṭivijjhantīti. Atthi, mahārāja, cīnavisaye cīnarājā, so mahāsamudde kīḷitukāmo [baliṃ kātukāmo (sī. pī.)] catumāse catumāse saccakiriyaṃ katvā saha rathena antomahāsamudde yojanaṃ pavisati, tassa rathasīsassa purato purato mahāvārikkhandho paṭikkamati, nikkhantassa puna ottharati, api nu kho, mahārāja, so mahāsamuddo sadevamanussenapi lokena pakatikāyabalena sakkā paṭikkamāpetu’’nti? ‘‘Atiparittakepi, bhante, taḷāke udakaṃ na sakkā sadevamanussenapi lokena pakatikāyabalena paṭikkamāpetuṃ, kiṃ pana mahāsamudde udaka’’nti? ‘‘Imināpi, mahārāja, kāraṇena saccabalaṃ ñātabbaṃ ‘natthi taṃ ṭhānaṃ, yaṃ saccena na pattabba’nti. ‘‘Nagare, mahārāja, pāṭaliputte asoko dhammarājā sanegamajānapadaamaccabhaṭabalamahāmattehi parivuto gaṅgaṃ nadiṃ [gaṅgānadiṃ (sī.)] navasalilasampuṇṇaṃ samatitthikaṃ sambharitaṃ pañcayojanasatāyāmaṃ yojanaputhulaṃ sandamānaṃ disvā amacce evamāha ‘atthi koci, bhaṇe, samattho, yo imaṃ mahāgaṅgaṃ paṭisotaṃ sandāpetu’nti. Amaccā āhaṃsu ‘dukkaraṃ devā’ti. ‘‘Tasmiṃ yeva gaṅgākūle ṭhitā bandhumatī nāma gaṇikā assosi raññā kira evaṃ vuttaṃ ‘sakkā nu kho imaṃ mahāgaṅgaṃ paṭisotaṃ sandāpetu’nti, sā evamāha ‘ahañhi nagare pāṭaliputte gaṇikā rūpūpajīvinī antimajīvikā, mama tāva rājā saccakiriyaṃ passatū’ti. Atha sā saccakiriyaṃ akāsi, saha tassā saccakiriyāya khaṇena sā mahāgaṅgā gaḷagaḷāyantī paṭisotaṃ sandittha mahato janakāyassa passato. ‘‘Atha rājā gaṅgāya āvaṭṭaūmivegajanitaṃ halāhalasaddaṃ sutvā vimhito acchariyabbhutajāto amacce evamāha ‘kissāyaṃ, bhaṇe, mahāgaṅgā paṭisotaṃ sandatī’ti? ‘Bandhumatī, mahārāja, gaṇikā tava vacanaṃ sutvā saccakiriyaṃ akāsi, tassā saccakiriyāya mahāgaṅgā uddhaṃmukhā sandatī’ti. ‘‘Atha saṃviggahadayo rājā turitaturito sayaṃ gantvā taṃ gaṇikaṃ pucchi ‘saccaṃ kira, je, tayā saccakiriyāya ayaṃ gaṅgā paṭisotaṃ sandāpitā’ti? ‘Āma devā’ti. Rājā āha ‘kiṃ te tattha balaṃ atthi, ko vā te vacanaṃ ādiyati anummatto, kena tvaṃ balena imaṃ mahāgaṅgaṃ paṭisotaṃ sandāpesī’ti? Sā āha ‘saccabalenāhaṃ, mahārāja, imaṃ mahāgaṅgaṃ paṭisotaṃ sandāpesi’nti. Rājā āha ‘kiṃ te saccabalaṃ atthi coriyā dhuttiyā asatiyā chinnikāya pāpiyā bhinnasīlāya [pāpikāya bhinnasīmāya (sī.)] hiriatikkantikāya andhajanapalobhikāyā’ti. ‘Saccaṃ, mahārāja, tādisikā ahaṃ, tādisikāyapi me, mahārāja, saccakiriyā atthi, yāyāhaṃ icchamānā sadevakampi lokaṃ parivatteyya’nti. Rājā āha ‘katamā pana sā hoti saccakiriyā, iṅgha maṃ sāvehī’ti. ‘Yo me, mahārāja, dhanaṃ deti khattiyo vā brāhmaṇo vā vesso vā suddo vā añño vā koci, tesaṃ samakaṃ yeva upaṭṭhahāmi, ‘‘khattiyo’’ti viseso natthi, ‘‘suddo’’ti atimaññanā [atimaññamāno (ka.)] natthi, anunayappaṭighavippamuttā dhanassāmikaṃ paricarāmi, esā me deva saccakiriyā, yāyāhaṃ imaṃ mahāgaṅgaṃ paṭisotaṃ sandāpesi’nti. ‘‘Itipi, mahārāja, sacce ṭhitā na kiñci atthaṃ na vindanti. Dinnāni ca, mahārāja, sivirājena yācakassa cakkhūni, dibbacakkhūni ca uppannāni, tañca saccakiriyāya. Yaṃ pana sutte vuttaṃ ‘maṃsacakkhusmiṃ naṭṭhe ahetusmiṃ avatthusmiṃ natthi dibbacakkhussa uppādo’ti. Taṃ bhāvanāmayaṃ cakkhuṃ sandhāya vuttaṃ, evametaṃ, mahārāja, dhārehī’’ti. ‘‘Sādhu, bhante nāgasena, sunibbeṭhito pañho, suniddiṭṭho niggaho, sumadditā paravādā, evametaṃ tathā sampaṭicchāmī’’ti. Sivirājacakkhudānapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Gabbhāvakkantipañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘tiṇṇaṃ kho pana, bhikkhave, sannipātā gabbhassa avakkanti [gabbhassāvakkanti (ma. ni. 1.408)] hoti, idha mātāpitaro ca sannipatitā honti, mātā ca utunī hoti, gandhabbo ca paccupaṭṭhito hoti, imesaṃ kho, bhikkhave, tiṇṇaṃ sannipātā gabbhassa avakkanti hotī’ti, asesavacanametaṃ, nissesavacanametaṃ, nippariyāyavacanametaṃ, arahassavacanametaṃ, sadevamanussānaṃ majjhe nisīditvā bhaṇitaṃ, ayañca dvinnaṃ sannipātā gabbhassa avakkanti dissati, dukūlena tāpasena pārikāya tāpasiyā utunikāle dakkhiṇena hatthaṅguṭṭhena nābhi parāmaṭṭhā, tassa tena nābhiparāmasanena sāmakumāro nibbatto. Mātaṅgenāpi isinā brāhmaṇakaññāya utunikāle dakkhiṇena hatthaṅguṭṭhena nābhi parāmaṭṭhā, tassa tena nābhiparāmasanena maṇḍabyo nāma māṇavako nibbattoti. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘tiṇṇaṃ kho pana, bhikkhave, sannipātā gabbhassa avakkanti hotī’ti. Tena hi sāmo ca kumāro maṇḍabyo ca māṇavako ubhopi te nābhiparāmasanena nibbattāti yaṃ vacanaṃ, taṃ micchā. Yadi, bhante, tathāgatena bhaṇitaṃ ‘sāmo ca kumāro maṇḍabyo ca māṇavako nābhiparāmasanena nibbattā’’ti, tena hi ‘tiṇṇaṃ kho pana, bhikkhave, sannipātā gabbhassa avakkanti hotī’ti yaṃ vacanaṃ, tampi micchā. Ayampi ubhato koṭiko pañho sugambhīro sunipuṇo visayo buddhimantānaṃ, so tavānuppatto, chinda vimatipathaṃ, dhārehi ñāṇavarappajjota’’nti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘tiṇṇaṃ kho pana, bhikkhave, sannipātā gabbhassa avakkanti hoti, idha mātāpitaro ca sannipatitā honti, mātā ca utunī hoti, gandhabbo ca paccupaṭṭhito hoti, evaṃ tiṇṇaṃ sannipātā gabbhassa avakkanti hotī’ti. Bhaṇitañca ‘sāmo ca kumāro maṇḍabyo ca māṇavako nābhiparāmasanena nibbattā’’ti. ‘‘Tena hi, bhante nāgasena, yena kāraṇena pañho suvinicchito hoti, tena kāraṇena maṃ saññāpehī’’ti. ‘‘Sutapubbaṃ pana tayā, mahārāja, saṃkicco ca kumāro isisiṅgo ca tāpaso thero ca kumārakassapo ‘iminā nāma te nibbattā’’ti? ‘‘Āma, bhante, suyyati, abbhuggatā tesaṃ jāti, dve migadhenuyo tāva utunikāle dvinnaṃ tāpasānaṃ passāvaṭṭhānaṃ āgantvā sasambhavaṃ passāvaṃ piviṃsu, tena passāvasambhavena saṃkicco ca kumāro isisiṅgo ca tāpaso nibbattā. Therassa udāyissa bhikkhunupassayaṃ upagatassa rattacittena bhikkhuniyā aṅgajātaṃ upanijjhāyantassa sambhavaṃ kāsāve mucci. Atha kho āyasmā udāyi taṃ bhikkhuniṃ etadavoca ‘gaccha bhagini, udakaṃ āhara antaravāsakaṃ dhovissāmī’ti. ‘Āharayya ahameva dhovissāmī’ti. Tato sā bhikkhunī utunisamaye taṃ sambhavaṃ ekadesaṃ mukhena aggahesi, ekadesaṃ aṅgajāte pakkhipi, tena thero kumārakassapo nibbattoti etaṃ jano āhā’’ti. ‘‘Api nu kho tvaṃ, mahārāja, saddahasi taṃ vacana’’nti? ‘‘Āma bhante, balavaṃ tattha mayaṃ kāraṇaṃ upalabhāma, yena mayaṃ kāraṇena saddahāma ‘iminā kāraṇena nibbattā’’ti. ‘‘Kiṃ panettha, mahārāja, kāraṇa’’nti? ‘‘Suparikammakate, bhante, kalale bījaṃ nipatitvā khippaṃ saṃviruhatī’’ti. ‘‘Āma mahārājā’’ti. ‘‘Evameva kho, bhante, sā bhikkhunī utunī samānā saṇṭhite kalale ruhire pacchinnavege ṭhitāya dhātuyā taṃ sambhavaṃ gahetvā tasmiṃ kalale pakkhipi, tena tassā gabbho saṇṭhāsi, evaṃ tattha kāraṇaṃ paccema tesaṃ nibbattiyā’’ti. ‘‘Evametaṃ, mahārāja, tathā sampaṭicchāmi, yonippavesena gabbho sambhavatīti. Sampaṭicchasi pana, tvaṃ mahārāja, therassa kumārakassapassa gabbhāvakkamana’’nti? ‘‘Āma bhante’’ti. ‘‘Sādhu, mahārāja, paccāgatosi mama visayaṃ, ekavidhenapi gabbhāvakkantiṃ kathayanto mamānubalaṃ bhavissasi, atha yā pana tā dve migadhenuyo passāvaṃ pivitvā gabbhaṃ paṭilabhiṃsu, tāsaṃ tvaṃ saddahasi gabbhassāvakkamana’’nti? ‘‘Āma, bhante, yaṃ kiñci bhuttaṃ pītaṃ khāyitaṃ lehitaṃ, sabbaṃ taṃ kalalaṃ osarati, ṭhānagataṃ vuḍḍhimāpajjati. Yathā, bhante nāgasena, yā kāci saritā nāma, sabbā tā mahāsamuddaṃ osaranti, ṭhānagatā vuḍḍhimāpajjanti. Evameva kho, bhante nāgasena, yaṃ kiñci bhuttaṃ pītaṃ khāyitaṃ lehitaṃ, sabbaṃ taṃ kalalaṃ osarati, ṭhānagataṃ vuḍḍhimāpajjati, tenāhaṃ kāraṇena saddahāmi mukhagatenapi gabbhassa avakkanti hotī’’ti. ‘‘Sādhu, mahārāja, gāḷhataraṃ upagatosi mama visayaṃ, mukhapānenapi dvayasannipāto bhavati. Saṃkiccassa ca, mahārāja, kumārassa isisiṅgassa ca tāpasassa therassa ca kumārakassapassa gabbhāvakkamanaṃ sampaṭicchasī’’ti? ‘‘Āma, bhante, sannipāto osaratī’’ti. ‘‘Sāmopi, mahārāja, kumāro maṇḍabyopi māṇavako tīsu sannipātesu antogadhā, ekarasā yeva purimena, tattha kāraṇaṃ vakkhāmi. Dukūlo ca, mahārāja, tāpaso pārikā ca tāpasī ubhopi te araññavāsā ahesuṃ pavivekādhimuttā uttamatthagavesakā, tapatejena yāva brahmalokaṃ santāpesuṃ. Tesaṃ tadā sakko devānamindo sāyaṃ pātaṃ upaṭṭhānaṃ āgacchati. So tesaṃ garukatamettatāya upadhārento addasa anāgatamaddhāne dvinnampi tesaṃ cakkhūnaṃ antaradhānaṃ, disvā te evamāha ‘ekaṃ me, bhonto, vacanaṃ karotha, sādhu ekaṃ puttaṃ janeyyātha, so tumhākaṃ upaṭṭhāko bhavissati ālambano cā’ti. ‘Alaṃ, kosiya, mā evaṃ bhaṇī’ti. Te tassa taṃ vacanaṃ na sampaṭicchiṃsu. Anukampako atthakāmo sakko devānamindo dutiyampi…pe… tatiyampi te evamāha ‘ekaṃ me, bhonto, vacanaṃ karotha, sādhu ekaṃ puttaṃ janeyyātha, so tumhākaṃ upaṭṭhāko bhavissati ālambano cā’ti. Tatiyampi te āhaṃsu ‘alaṃ, kosiya, mā tvaṃ kho amhe anatthe niyojehi, kadāyaṃ kāyo na bhijjissati, bhijjatu ayaṃ kāyo bhedanadhammo, bhijjantiyāpi dharaṇiyā patantepi selasikhare phalantepi ākāse patantepi candimasūriye neva mayaṃ lokadhammehi missayissāma, mā tvaṃ amhākaṃ sammukhabhāvaṃ upagaccha, upagatassa te eso vissāso, anatthacaro tvaṃ maññe’ti. Tato sakko devānamindo tesaṃ manaṃ alabhamāno garukato pañjaliko puna yāci ‘yadi me vacanaṃ na ussahatha kātuṃ, yadā tāpasī utunī hoti pupphavatī, tadā tvaṃ, bhante, dakkhiṇena hatthaṅguṭṭhena nābhiṃ parāmaseyyāsi, tena sā gabbhaṃ lacchati, sannipāto yevesa gabbhāvakkantiyā’ti. ‘Sakkomahaṃ, kosiya, taṃ vacanaṃ kātuṃ, na tāvatakena amhākaṃ tapo bhijjati, hotū’ti sampaṭicchiṃsu. Tāya ca pana velāya devabhavane atthi devaputto ussannakusalamūlo khīṇāyuko āyukkhayappatto yadicchakaṃ samattho okkamituṃ api cakkavattikulepi. Atha sakko devānamindo taṃ devaputtaṃ upasaṅkamitvā evamāha ‘ehi kho, mārisa, supabhāto te divaso, atthasiddhi upagatā, yamahaṃ te upaṭṭhānamāgamiṃ, ramaṇīye te okāse vāso bhavissati, patirūpe kule paṭisandhi bhavissati, sundarehi mātāpitūhi vaḍḍhetabbo, ehi me vacanaṃ karohī’ti yāci. Dutiyampi…pe… tatiyampi yāci sirasi pañjalikato. Tato so devaputto evamāha ‘katamaṃ taṃ, mārisa, kulaṃ, yaṃ tvaṃ abhikkhaṇaṃ kittayasi punappuna’nti. ‘Dukūlo ca tāpaso pārikā ca tāpasī’ti. So tassa vacanaṃ sutvā tuṭṭho sampaṭicchi ‘sādhu, mārisa, yo tava chando, so hotu, ākaṅkhamāno ahaṃ, mārisa, patthite kule uppajjeyyaṃ, kimhi kule uppajjāmi aṇḍaje vā jalābuje vā saṃsedaje vā opapātike vā’ti? ‘Jalābujāya, mārisa, yoniyā uppajjāhī’ti. Atha sakko devānamindo uppattidivasaṃ vigaṇetvā dukūlassa tāpasassa ārocesi ‘asukasmiṃ nāma divase tāpasī utunī bhavissati pupphavatī, tadā tvaṃ, bhante, dakkhiṇena hatthaṅguṭṭhena nābhiṃ parāmaseyyāsī’ti. Tasmiṃ, mahārāja, divase tāpasī ca utunī pupphavatī ahosi, devaputto ca tatthūpago paccupaṭṭhito ahosi, tāpaso ca dakkhiṇena hatthaṅguṭṭhena tāpasiyā nābhiṃ parāmasi, iti te tayo sannipātā ahesuṃ, nābhiparāmasanena tāpasiyā rāgo udapādi, so panassā rāgo nābhiparāmasanaṃ paṭicca mā tvaṃ sannipātaṃ ajjhācārameva maññi, ūhasanampi [hasanampi (ka.)] sannipāto, ullapanampi sannipāto, upanijjhāyanampi sannipāto, pubbabhāgabhāvato rāgassa uppādāya āmasanena sannipāto jāyati, sannipātā okkamanaṃ hotīti. ‘‘Anajjhācārepi, mahārāja, parāmasanena gabbhāvakkanti hoti. Yathā, mahārāja, aggi jalamāno aparāmasanopi upagatassa sītaṃ byapahanti, evameva kho, mahārāja, anajjhācārepi parāmasanena gabbhāvakkanti hoti. ‘‘Catunnaṃ, mahārāja, vasena sattānaṃ gabbhāvakkanti hoti kammavasena yonivasena kulavasena āyācanavasena, api ca sabbepete sattā kammasambhavā kammasamuṭṭhānā. ‘‘Kathaṃ, mahārāja, kammavasena sattānaṃ gabbhāvakkanti hoti? Ussannakusalamūlā, mahārāja, sattā yadicchakaṃ uppajjanti khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā devesu vā aṇḍajāya vā yoniyā jalābujāya vā yoniyā saṃsedajāya vā yoniyā opapātikāya vā yoniyā. Yathā, mahārāja, puriso aḍḍho mahaddhano mahābhogo pahūtajātarūparajato pahūtavittūpakaraṇo pahūtadhanadhañño pahūtañātipakkho dāsiṃ vā dāsaṃ vā khettaṃ vā vatthuṃ vā gāmaṃ vā nigamaṃ vā janapadaṃ vā yaṃ kiñci manasā abhipatthitaṃ, yadicchakaṃ dviguṇatiguṇampi dhanaṃ datvā kiṇāti, evameva kho, mahārāja, ussannakusalamūlā sattā yadicchakaṃ uppajjanti khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā devesu vā aṇḍajāya vā yoniyā jalābujāya vā yoniyā saṃsedajaya vā yoniyā opapātikāya vā yoniyā. Evaṃ kammavasena sattānaṃ gabbhāvakkanti hoti. ‘‘Kathaṃ yonivasena sattānaṃ gabbhāvakkanti hoti? Kukkuṭānaṃ, mahārāja, vātena gabbhāvakkanti hoti. Balākānaṃ meghasaddena gabbhāvakkanti hoti. Sabbepi devā agabbhaseyyakā sattā yeva, tesaṃ nānāvaṇṇena gabbhāvakkanti hoti. Yathā, mahārāja, manussā nānāvaṇṇena mahiyā caranti, keci purato paṭicchādenti, keci pacchato paṭicchādenti, keci naggā honti, keci bhaṇḍū honti setapaṭadharā, keci moḷibaddhā honti, keci bhaṇḍū kāsāvavasanā honti, keci kāsāvavasanā moḷibaddhā honti, keci jaṭino vākacīradharā [vākacīrā (ka.)] honti, keci cammavasanā honti, keci rasmiyo nivāsenti, sabbepete manussā nānāvaṇṇena mahiyā caranti, evameva kho, mahārāja, sattā yeva te sabbe, tesaṃ nānāvaṇṇena gabbhāvakkanti hoti. Evaṃ yonivasena sattānaṃ gabbhāvakkanti hoti. ‘‘Kathaṃ kulavasena sattānaṃ gabbhāvakkanti hoti? Kulaṃ nāma, mahārāja, cattāri kulāni aṇḍajaṃ jalābujaṃ saṃsedajaṃ opapātikaṃ. Yadi tattha gandhabbo yato kutoci āgantvā aṇḍaje kule uppajjati, so tattha aṇḍajo hoti…pe… jalābuje kule…pe… saṃsedaje kule…pe… opapātike kule uppajjati, so tattha opapātiko hoti. Tesu tesu kulesu tādisā yeva sattā sambhavanti. Yathā, mahārāja, himavati nerupabbataṃ ye keci migapakkhino upenti, sabbe te sakavaṇṇaṃ vijahitvā suvaṇṇavaṇṇā honti, evameva kho, mahārāja, yo koci gandhabbo yato kutoci āgantvā aṇḍajaṃ yoniṃ upagantvā sabhāvavaṇṇaṃ vijahitvā aṇḍajo hoti…pe… jalābujaṃ…pe… saṃsedajaṃ…pe… opapātikaṃ yoniṃ upagantvā sabhāvavaṇṇaṃ vijahitvā opapātiko hoti, evaṃ kulavasena sattānaṃ gabbhāvakkanti hoti. ‘‘Kathaṃ āyācanavasena sattānaṃ gabbhāvakkanti hoti? Idha, mahārāja, kulaṃ hoti aputtakaṃ bahusāpateyyaṃ saddhaṃ pasannaṃ sīlavantaṃ kalyāṇadhammaṃ tapanissitaṃ, devaputto ca ussannakusalamūlo cavanadhammo hoti. Atha sakko devānamindo tassa kulassa anukampāya taṃ devaputtaṃ āyācati ‘paṇidhehi, mārisa, asukassa kulassa mahesiyā kucchi’nti. So tassa āyācanahetu taṃ kulaṃ paṇidheti. Yathā, mahārāja, manussā puññakāmā samaṇaṃ manobhāvanīyaṃ āyācitvā gehaṃ upanenti, ayaṃ upagantvā sabbassa kulassa sukhāvaho bhavissatīti. Evameva kho, mahārāja, sakko devānamindo taṃ devaputtaṃ āyācitvā taṃ kulaṃ upaneti. Evaṃ āyācanavasena sattānaṃ gabbhāvakkanti hoti. ‘‘Sāmo, mahārāja, kumāro sakkena devānamindena āyācito pārikāya tāpasiyā kucchiṃ okkanto. Sāmo, mahārāja, kumāro katapuñño, mātāpitaro sīlavanto kalyāṇadhammā, āyācako sakko, tiṇṇaṃ cetopaṇidhiyā sāmo kumāro nibbatto. Idha, mahārāja, nayakusalo puriso sukaṭṭhe anūpakhette bījaṃ ropeyya, api nu tassa bījassa antarāyaṃ vivajjentassa vuḍḍhiyā koci antarāyo bhaveyyā’’ti? ‘‘Na hi, bhante, nirupaghātaṃ bījaṃ khippaṃ saṃviruheyyā’’ti. ‘‘Evameva kho, mahārāja, sāmo kumāro mutto uppannantarāyehi tiṇṇaṃ cetopaṇidhiyā nibbatto. ‘‘Api nu kho, mahārāja, sutapubbaṃ tayā isīnaṃ manopadosena iddho phīto mahājanapado sajano samucchinno’’ti? ‘‘Āma, bhante, suyyati. Mahiyā daṇḍakāraññaṃ [daṇḍakīraññaṃ (ma. ni. 2.65)] majjhāraññaṃ kāliṅgāraññaṃ mātaṅgāraññaṃ, sabbaṃ taṃ araññaṃ araññabhūtaṃ, sabbepete janapadā isīnaṃ manopadosena khayaṃ gatā’’ti. ‘‘Yadi, mahārāja, tesaṃ manopadosena susamiddhā janapadā ucchijjanti, api nu kho tesaṃ manopasādena kiñci nibbatteyyā’’ti? ‘‘Āma bhante’’ti. ‘‘Tena hi, mahārāja, sāmo kumāro tiṇṇaṃ balavantānaṃ cetopasādena nibbatto isinimmito devanimmito puññanimmitoti. Evametaṃ, mahārāja, dhārehi. ‘‘Tayome, mahārāja, devaputtā sakkena devānamindena āyācitā kulaṃ uppannā. Katame tayo? Sāmo kumāro mahāpanādo kusarājā, tayopete bodhisattā’’ti. ‘‘Suniddiṭṭhā, bhante nāgasena, gabbhāvakkanti, sukathitaṃ kāraṇaṃ, andhakāro āloko kato, jaṭā vijaṭitā, nicchuddhā paravādā, evametaṃ tathā sampaṭicchāmī’’ti. Gabbhāvakkantipañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Saddhammantaradhānapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘pañceva dāni, ānanda, vassasatāni [vassasahassāni (sī.) passa a. ni. 8.51] saddhammo ṭhassatī’ti. Puna ca parinibbānasamaye subhaddena paribbājakena pañhaṃ puṭṭhena bhagavatā bhaṇitaṃ ‘ime ca, subhadda [dī. ni. 2.214 passitabbaṃ], bhikkhū sammā vihareyyuṃ, asuñño loko arahantehi assā’ti, asesavacanametaṃ, nissesavacanametaṃ, nippariyāyavacanametaṃ. Yadi, bhante nāgasena, tathāgatena bhaṇitaṃ ‘pañceva dāni, ānanda, vassasatāni saddhammo ṭhassatī’ti, tena hi ‘asuñño loko arahantehi assā’ti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatena bhaṇitaṃ ‘asuñño loko arahantehi assā’ti, tena hi ‘pañceva dāni, ānanda, vassasatāni saddhammo ṭhassatī’ti tampi vacanaṃ micchā. Ayampi ubhato koṭiko pañho gahanatopi gahanataro balavatopi balavataro gaṇṭhitopi gaṇṭhitaro, so tavānuppatto, tattha te ñāṇabalavipphāraṃ dassehi makaro viya sāgarabbhantaragato’’ti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘pañceva dāni, ānanda, vassasatāni saddhammo ṭhassatī’ti. Parinibbānasamaye ca subhaddassa paribbājakassa bhaṇitaṃ ‘ime ca, subhadda, bhikkhū sammā vihareyyuṃ, asuñño loko arahantehi assā’ti. Tañca pana, mahārāja, bhagavato vacanaṃ nānatthañceva hoti nānābyañjanañca, ayaṃ sāsanaparicchedo, ayaṃ paṭipatti paridīpanāti dūraṃ vivajjitā te ubho aññamaññaṃ. Yathā, mahārāja, nabhaṃ pathavito dūraṃ vivajjitaṃ, nirayaṃ saggato dūraṃ vivajjitaṃ, kusalaṃ akusalato dūraṃ vivajjitaṃ, sukhaṃ dukkhato dūraṃ vivajjitaṃ. Evameva kho, mahārāja, te ubho aññamaññaṃ dūraṃ vivajjitā. ‘‘Api ca, mahārāja, mā te pucchā moghā assa [assu (sī. syā.)], rasato te saṃsanditvā kathayissāmi ‘pañceva dāni, ānanda, vassasatāni saddhammo ṭhassatī’ti yaṃ bhagavā āha, taṃ khayaṃ paridīpayanto sesakaṃ paricchindi, vassasahassaṃ, ānanda, saddhammo tiṭṭheyya, sace bhikkhuniyo na pabbājeyyuṃ. Pañceva dāni, ānanda, vassasatāni saddhammo ṭhassatīti. Api nu kho, mahārāja, bhagavā evaṃ vadanto saddhammassa antaradhānaṃ vā vadeti abhisamayaṃ vā paṭikkosatī’’ti? ‘‘Na hi bhante’’ti. ‘‘Naṭṭhaṃ, mahārāja, parikittayanto sesakaṃ paridīpayanto paricchindi. Yathā, mahārāja, puriso naṭṭhāyiko sabbasesakaṃ gahetvā janassa paridīpeyya ‘ettakaṃ me bhaṇḍaṃ naṭṭhaṃ, idaṃ sesaka’nti. Evameva kho, mahārāja, bhagavā naṭṭhaṃ paridīpayanto sesakaṃ devamanussānaṃ kathesi ‘pañceva dāni, ānanda, vassasatāni saddhammo ṭhassatī’ti. Yaṃ pana, mahārāja, bhagavatā bhaṇitaṃ ‘pañceva dāni, ānanda, vassasatāni saddhammo ṭhassatī’ti, sāsanaparicchedo eso. ‘‘Yaṃ pana parinibbānasamaye subhaddassa paribbājakassa samaṇe parikittayanto āha ‘ime ca, subhadda, bhikkhū sammā vihareyyuṃ, asuñño loko arahantehi assā’ti, paṭipattiparidīpanā esā, tvaṃ pana taṃ paricchedañca paridīpanañca ekarasaṃ karosi. Yadi pana te chando, ekarasaṃ katvā kathayissāmi, sādhukaṃ suṇohi manasikarohi avikkhittamānaso [avicalamānaso (sī.) avimānaso (pī. ka.)]. ‘‘Idha, mahārāja, taḷāko bhaveyya navasalilasampuṇṇo sammukhamuttariyamāno paricchinno parivaṭumakato, apariyādiṇṇe yeva tasmiṃ taḷāke udakūpari mahāmegho aparāparaṃ anuppabandho abhivasseyya, api nu kho, mahārāja, tasmiṃ taḷāke udakaṃ parikkhayaṃ pariyādānaṃ gaccheyyā’’ti? ‘‘Na hi bhante’’ti. ‘‘Kena kāraṇena mahārājā’’ti? ‘‘Meghassa, bhante, anuppabandhatāyā’’ti. ‘‘Evameva kho, mahārāja, jinasāsanavarasaddhammataḷāko ācārasīlaguṇavattapaṭipattivimalanavasalilasampuṇṇo uttariyamāno bhavaggamabhibhavitvā ṭhito. Yadi tattha buddhaputtā ācārasīlaguṇavattapaṭipattimeghavassaṃ aparāparaṃ anuppabandhāpeyyuṃ abhivassāpeyyuṃ. Evamidaṃ jinasāsanavarasaddhammataḷāko ciraṃ dīghamaddhānaṃ tiṭṭheyya, arahantehi loko asuñño bhaveyya, imamatthaṃ bhagavatā sandhāya bhāsitaṃ ‘ime ca, subhadda, bhikkhū sammā vihareyyuṃ, asuñño loko arahantehi assā’ti. ‘‘Idha pana, mahārāja, mahati mahāaggikkhandhe jalamāne aparāparaṃ sukkhatiṇakaṭṭhagomayāni upasaṃhareyyuṃ, api nu kho so, mahārāja, aggikkhandho nibbāyeyyā’’ti? ‘‘Na hi, bhante, bhiyyo bhiyyo so aggikkhandho jaleyya, bhiyyo bhiyyo pabhāseyyā’’ti. ‘‘Evameva kho, mahārāja, dasasahassiyā [dasasahassimhi (bahūsu)] lokadhātuyā jinasāsanavarampi ācārasīlaguṇavattapaṭipattiyā jalati pabhāsati. Yadi pana, mahārāja, taduttariṃ buddhaputtā pañcahi padhāniyaṅgehi samannāgatā satatamappamattā padaheyyuṃ, tīsu sikkhāsu chandajātā sikkheyyuṃ, cārittañca sīlaṃ samattaṃ paripūreyyuṃ, evamidaṃ jinasāsanavaraṃ bhiyyo bhiyyo ciraṃ dīghamaddhānaṃ tiṭṭheyya, asuñño loko arahantehi assāti imamatthaṃ bhagavatā sandhāya bhāsitaṃ ‘ime ca, subhadda, bhikkhū sammā vihareyyuṃ, asuñño loko arahantehi assā’ti. ‘‘Idha pana, mahārāja, siniddhasamasumajjitasappabhāsavimalādāsaṃ [sappabhaṃ suvimalādāsaṃ (sī.)] saṇhasukhumagerukacuṇṇena aparāparaṃ majjeyyuṃ, api nu kho, mahārāja, tasmiṃ ādāse malakaddamarajojallaṃ jāyeyyā’’ti? ‘‘Na hi, bhante, aññadatthu vimalataraṃ yeva bhaveyyā’’ti. ‘‘Evameva kho, mahārāja, jinasāsanavaraṃ pakatinimmalaṃ byapagatakilesamalarajojallaṃ, yadi taṃ buddhaputtā ācārasīlaguṇavattapaṭipattisallekhadhutaguṇena jinasāsanavaraṃ sallakkheyyuṃ [sallikkheyyuṃ (sī. pī.)], evamidaṃ jinasāsanavaraṃ ciraṃ dīghamaddhānaṃ tiṭṭheyya, asuñño ca loko arahantehi assāti imamatthaṃ bhagavatā sandhāya bhāsitaṃ ‘ime ca, subhadda, bhikkhū sammā vihareyyuṃ, asuñño loko arahantehi assā’ti. Paṭipattimūlakaṃ, mahārāja, satthusāsanaṃ paṭipattikāraṇaṃ paṭipattiyā anantarahitāya tiṭṭhatī’’ti. ‘‘Bhante nāgasena, ‘saddhammantaradhāna’nti yaṃ vadesi, katamaṃ taṃ saddhammantaradhāna’’nti? ‘‘Tīṇimāni, mahārāja, sāsanantaradhānāni. Katamāni tīṇi? Adhigamantaradhānaṃ paṭipattantaradhānaṃ liṅgantaradhānaṃ, adhigame, mahārāja, antarahite suppaṭipannassāpi dhammābhisamayo na hoti, paṭipattiyā antarahitāya sikkhāpadapaññatti antaradhāyati, liṅgaṃyeva tiṭṭhati, liṅge antarahite paveṇupacchedo hoti, imāni kho, mahārāja, tīṇi antaradhānānī’’ti. ‘‘Suviññāpito, bhante nāgasena, pañho, gambhīro uttānīkato, gaṇṭhi bhinno, naṭṭhā paravādā bhaggā nippabhā katā, tvaṃ gaṇivaravasabhamāsajjāti. Saddhammantaradhānapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Akusalacchedanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, tathāgato sabbaṃ akusalaṃ jhāpetvā sabbaññutaṃ patto, udāhu sāvasese akusale sabbaññutaṃ patto’’ti? ‘‘Sabbaṃ, mahārāja, akusalaṃ jhāpetvā bhagavā sabbaññutaṃ patto, natthi bhagavato sesekaṃ akusala’’nti. ‘‘Kiṃ pana, bhante, dukkhā vedanā tathāgatassa kāye uppannapubbā’’ti? ‘‘Āma, mahārāja, rājagahe bhagavato pādo sakalikāya [sakkhalikāya (syā. ka.)] khato, lohitapakkhandikābādho uppanno, kāye abhisanne jīvakena vireko kārito, vātābādhe uppanne upaṭṭhākena therena uṇhodakaṃ pariyiṭṭha’’nti. ‘‘Yadi, bhante nāgasena, tathāgato sabbaṃ akusalaṃ jhāpetvā sabbaññutaṃ patto, tena hi bhagavato pādo sakalikāya khato, lohitapakkhandikā ca ābādho uppannoti yaṃ vacanaṃ, taṃ micchā. Yadi tathāgatassa pādo sakalikāya khato, lohitapakkhandikā ca ābādho uppanno, tena hi tathāgato sabbaṃ akusalaṃ jhāpetvā sabbaññutaṃ pattoti tampi vacanaṃ micchā. Natthi, bhante, vinā kammena vedayitaṃ, sabbaṃ taṃ vedayitaṃ kammamūlakaṃ, taṃ kammeneva vedayati, ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti [nibbāyitabboti (ka.)]. ‘‘Na hi, mahārāja, sabbaṃ taṃ vedayitaṃ kammamūlakaṃ. Aṭṭhahi, mahārāja, kāraṇehi vedayitāni uppajjanti, yehi kāraṇehi puthū sattā vedanā vediyanti. Katamehi aṭṭhahi? Vātasamuṭṭhānānipi kho, mahārāja, idhekaccāni vedayitāni uppajjanti, pittasamuṭṭhānānipi kho, mahārāja…pe… semhasamuṭṭhānānipi kho, mahārāja…pe… sannipātikānipi kho, mahārāja…pe… utupariṇāmajānipi kho, mahārāja…pe… visamaparihārajānipi kho, mahārāja…pe… opakkamikānipi kho, mahārāja…pe… kammavipākajānipi kho, mahārāja, idhekaccāni vedayitāni uppajjanti. Imehi kho, mahārāja, aṭṭhahi kāraṇehi puthū sattā vedanā vedayanti. Tattha ye te puggalā ‘satte kammaṃ vibādhatī’ti vadeyyuṃ, te ime puggalā sattakāraṇaṃ paṭibāhanti. Tesaṃ taṃ vacanaṃ micchā’’ti. ‘‘Bhante nāgasena, yañca vātikaṃ yañca pittikaṃ yañca semhikaṃ yañca sannipātikaṃ yañca utupariṇāmajaṃ yañca visamaparihārajaṃ yañca opakkamikaṃ, sabbete kammasamuṭṭhānā yeva, kammeneva te sabbe sambhavantī’’ti. ‘‘Yadi, mahārāja, tepi sabbe kammasamuṭṭhānāva ābādhā bhaveyyuṃ, na tesaṃ koṭṭhāsato lakkhaṇāni bhaveyyuṃ. Vāto kho, mahārāja, kuppamāno dasavidhena kuppati sītena uṇhena jighacchāya vipāsāya atibhuttena ṭhānena padhānena ādhāvanena upakkamena kammavipākena. Tatra ye te nava vidhā, na te atīte, na anāgate, vattamānake bhave uppajjanti, tasmā na vattabbā ‘kammasambhavā sabbā vedanā’ti. Pittaṃ, mahārāja, kuppamānaṃ tividhena kuppati sītena uṇhena visamabhojanena. Semhaṃ, mahārāja, kuppamānaṃ tividhena kuppati sītena uṇhena annapānena. Yo ca, mahārāja, vāto yañca pittaṃ yañca semhaṃ, tehi tehi kopehi kuppitvā missī hutvā sakaṃ sakaṃ vedanaṃ ākaḍḍhati. Utupariṇāmajā, mahārāja, vedanā utupariyāmena uppajjati. Visamaparihārajā vedanā visamaparihārena uppajjati. Opakkamikā, mahārāja, vedanā atthi kiriyā, atthi kammavipākā, kammavipākajā vedanā pubbe katena kammena uppajjati. Iti kho, mahārāja, appaṃ kammavipākajaṃ, bahutaraṃ avasesaṃ. Tattha bālā ‘sabbaṃ kammavipākajaṃ yevā’ti atidhāvanti. Taṃ kammaṃ na sakkā vinā buddhañāṇena vavatthānaṃ kātuṃ. ‘‘Yaṃ pana, mahārāja, bhagavato pādo sakalikāya khato, taṃ vedayitaṃ neva vātasamuṭṭhānaṃ, na pittasamuṭṭhānaṃ, na semhasamuṭṭhānaṃ, na sannipātikaṃ, na utupariṇāmajaṃ, na visamaparihārajaṃ, na kammavipākajaṃ, opakkamikaṃ yeva. Devadatto hi, mahārāja, bahūni jātisatasahassāni tathāgate āghātaṃ bandhi, so tena āghātena mahatiṃ garuṃ silaṃ gahetvā ‘matthake pātessāmī’ti muñci, athaññe dve selā āgantvā taṃ silaṃ tathāgataṃ asampattaṃ yeva sampaṭicchiṃsu, tāsaṃ pahārena papaṭikā bhijjitvā bhagavato pāde patitvā ruhiraṃ [nipatitvā rudhiraṃ (syā.)] uppādesi, kammavipākato vā, mahārāja, bhagavato esā vedanā nibbattā kiriyato vā, tatuddhaṃ natthaññā vedanā. ‘‘Yathā, mahārāja, khettaduṭṭhatāya vā bījaṃ na sambhavati bījaduṭṭhatāya vā. Evameva kho, mahārāja, kammavipākato vā bhagavato esā vedanā nibbattā kiriyato vā, tatuddhaṃ natthaññā vedanā. ‘‘Yathā vā pana, mahārāja, koṭṭhaduṭṭhatāya vā bhojanaṃ visamaṃ pariṇamati āhāraduṭṭhatāya vā, evameva kho, mahārāja, kammavipākato vā bhagavato esā vedanā nibbattā kiriyato vā, tatuddhaṃ natthaññā vedanā. Api ca, mahārāja, natthi bhagavato kammavipākajā vedanā, natthi visamaparihārajā vedanā, avasesehi samuṭṭhānehi bhagavato vedanā uppajjati, tāya ca pana vedanāya na sakkā bhagavantaṃ jīvitā voropetuṃ. ‘‘Nipatanti, mahārāja, imasmiṃ cātumahābhūtike [cātummahābhūtike (sī.)] kāye iṭṭhāniṭṭhā subhāsubhavedanā. Idha, mahārāja, ākāse khitto leḍḍu mahāpathaviyā nipatati, api nu kho so, mahārāja, leḍḍu pubbe katena mahāpathaviyā nipatī’’ti? ‘‘Na hi, bhante, natthi so, bhante, hetu mahāpathaviyā, yena hetunā mahāpathavī kusalākusalavipākaṃ paṭisaṃvedeyya, paccuppannena, bhante, akammakena hetunā so leḍḍu mahāpathaviyaṃ nipatati. Yathā, mahārāja, mahāpathavī, evaṃ tathāgato daṭṭhabbo. Yathā leḍḍu pubbe akatena mahāpathaviyaṃ nipatati, evameva kho, mahārāja, tathāgatassa pubbe akatena sā sakalikāpāde nipatitā. ‘‘Idha pana, mahārāja, manussā mahāpathaviṃ bhindanti ca khaṇanti ca, api nu kho, mahārāja, te manussā pubbe katena mahāpathaviṃ bhindanti ca khaṇanti cā’’ti? ‘‘Na hi bhante’’ti. ‘‘Evameva kho, mahārāja, yā sā sakalikā bhagavato pāde nipatitā, na sā sakalikā pubbe katena bhagavato pāde nipatitā. Yopi, mahārāja, bhagavato lohitapakkhandikābādho uppanno, sopi ābādho na pubbe katena uppanno, sannipātikeneva uppanno, ye keci, mahārāja, bhagavato kāyikā ābādhā uppannā, na te kammābhinibbattā, channaṃ etesaṃ samuṭṭhānānaṃ aññatarato nibbattā. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena saṃyuttanikāyavaralañchake moḷiyasīvake [moliyasivake (syā. ka.) saṃ. ni. 4.269 passitabbaṃ] veyyākaraṇe – ‘‘‘Pittasamuṭṭhānānipi kho, sīvaka, idhekaccāni vedayitāni uppajjanti. Sāmampi kho etaṃ, sīvaka, veditabbaṃ, yathā pittasamuṭṭhānānipi idhekaccāni vedayitāni uppajjanti. Lokassapi kho etaṃ, sīvaka, saccasammataṃ, yathā pittasamuṭṭhānānipi idhekaccāni vedayitāni uppajjanti. Tatra, sīvaka, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino ‘‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā, sabbaṃ taṃ pubbe katahetū’’ti. Yañca sāmaṃ ñātaṃ, tañca atidhāvanti, yañca loke saccasammataṃ, tañca atidhāvanti. Tasmā tesaṃ samaṇabrāhmaṇānaṃ micchāti vadāmi. ‘‘‘Semhasamuṭṭhānānipi kho, sīvaka, idhekaccāni vedayitāni uppajjanti. Vātasamuṭṭhānānipi kho, sīvaka…pe… sannipātikānipi kho, sīvaka…pe… utupariṇāmajānipi kho, sīvaka…pe… visamaparihārajānipi kho, sīvaka…pe… opakkamikānipi kho, sīvaka…pe… kammavipākajānipi kho, sīvaka, idhekaccāni vedayitāni uppajjanti. Sāmampi kho etaṃ, sīvaka, veditabbaṃ, yathā kammavipākajānipi idhekaccāni vedayitāni uppajjanti. Lokassapi kho etaṃ, sīvaka, saccasammataṃ, yathā kammavipākajānipi idhekaccāni vedayitāni uppajjanti. Tatra, sīvaka, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino ‘‘yaṃ kiñcāyaṃ purisapuggalo paṭisaṃvedeti sukhaṃ vā dukkhaṃ vā adukkhamasukhaṃ vā, sabbaṃ taṃ pubbe katahetū’’ti. Yañca sāmaṃ ñātaṃ, tañca atidhāvanti, yañca loke saccasammataṃ, tañca atidhāvanti. Tasmā tesaṃ samaṇabrāhmaṇānaṃ micchāti vadāmī’’’ti. ‘‘Itipi, mahārāja, na sabbā vedanā kammavipākajā, sabbaṃ, mahārāja, akusalaṃ jhāpetvā bhagavā sabbaññutaṃ pattoti evametaṃ dhārehī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Akusalacchedanapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Uttarikaraṇīyapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Bhante nāgasena, tumhe bhaṇatha ‘yaṃ kiñci karaṇīyaṃ tathāgatassa, sabbaṃ taṃ bodhiyā yeva mūle pariniṭṭhitaṃ, natthi tathāgatassa uttariṃ karaṇīyaṃ, katassa vā paticayo’ti, idañca temāsaṃ paṭisallānaṃ dissati. Yadi, bhante nāgasena, yaṃ kiñci karaṇīyaṃ tathāgatassa, sabbaṃ taṃ bodhiyā yeva mūle pariniṭṭhitaṃ, natthi tathāgatassa uttariṃ karaṇīyaṃ, katassa vā paticayo, tena hi ‘temāsaṃ paṭisallīno’ti yaṃ vacanaṃ, taṃ micchā. Yadi temāsaṃ paṭisallīno, tena hi ‘yaṃ kiñci karaṇīyaṃ, tathāgatassa, sabbaṃ taṃ bodhiyā yeva mūle pariniṭṭhita’nti tampi vacanaṃ micchā. Natthi katakaraṇīyassa paṭisallānaṃ, sakaraṇīyasseva paṭisallānaṃ yathā nāma byādhitasseva bhesajjena karaṇīyaṃ hoti, abyādhitassa kiṃ bhesajjena. Chātasseva bhojanena karaṇīyaṃ hoti, achātassa kiṃ bhojanena. Evameva kho, bhante nāgasena, natthi katakaraṇīyassa paṭisallānaṃ, sakaraṇīyasseva paṭisallānaṃ. Ayampi ubhato koṭiko pañho tavānuppatto, so tayā nibbāhitabbo’’ti. ‘‘Yaṃ kiñci, mahārāja, karaṇīyaṃ tathāgatassa, sabbaṃ taṃ bodhiyā yeva mūle pariniṭṭhitaṃ, natthi tathāgatassa uttariṃ karaṇīyaṃ, katassa vā paticayo, bhagavā ca temāsaṃ paṭisallīno, paṭisallānaṃ kho, mahārāja, bahuguṇaṃ, sabbepi tathāgatā paṭisallīyitvā sabbaññutaṃ pattā, taṃ te sukataguṇamanussarantā paṭisallānaṃ sevanti. Yathā, mahārāja, puriso rañño santikā laddhavaro paṭiladdhabhogo taṃ sukataguṇamanussaranto aparāparaṃ rañño upaṭṭhānaṃ eti. Evameva kho, mahārāja, sabbepi tathāgatā paṭisallīyitvā sabbaññutaṃ pattā, taṃ te sukataguṇamanussarantā paṭisallānaṃ sevanti. ‘‘Yathā vā pana, mahārāja, puriso āturo dukkhito bāḷhagilāno bhisakkamupasevitvā sotthimanuppatto taṃ sukataguṇamanussaranto aparāparaṃ bhisakkamupasevati. Evameva kho, mahārāja, sabbepi tathāgatā paṭisallīyitvā sabbaññutaṃ pattā, taṃ te sukataguṇamanussarantā paṭisallānaṃ sevanti. ‘‘Aṭṭhavīsati kho panime, mahārāja, paṭisallānaguṇā, ye guṇe samanussarantā [samanupassantā (sī. pī.)] tathāgatā paṭisallānaṃ sevanti. Katame aṭṭhavīsati? Idha, mahārāja, paṭisallānaṃ paṭisallīyamānaṃ attānaṃ rakkhati, āyuṃ vaḍḍheti, balaṃ deti, vajjaṃ pidahati, ayasamapaneti, yasamupaneti, aratiṃ vinodeti, ratimupadahati, bhayamapaneti, vesārajjaṃ karoti, kosajjamapaneti, vīriyamabhijaneti, rāgamapaneti, dosamapaneti, mohamapaneti, mānaṃ nihanti, vitakkaṃ bhañjati, cittaṃ ekaggaṃ karoti, mānasaṃ snehayati [sobhayati (sī.)], hāsaṃ janeti, garukaṃ karoti, lābhamuppādayati, namassiyaṃ karoti, pītiṃ pāpeti, pāmojjaṃ karoti, saṅkhārānaṃ sabhāvaṃ dassayati, bhavappaṭisandhiṃ ugghāṭeti, sabbasāmaññaṃ deti. Ime kho, mahārāja, aṭṭhavīsati paṭisallānaguṇā, ye guṇe samanussarantā tathāgatā paṭisallānaṃ sevanti. ‘‘Api ca kho, mahārāja, tathāgatā santaṃ sukhaṃ samāpattiratiṃ anubhavitukāmā paṭisallānaṃ sevanti pariyositasaṅkappā. Catūhi kho, mahārāja, kāraṇehi tathāgatā paṭisallānaṃ sevanti. Katamehi catūhi? Vihāraphāsutāyapi, mahārāja, tathāgatā paṭisallānaṃ sevanti, anavajjaguṇabahulatāyapi tathāgatā paṭisallānaṃ sevanti, asesaariyavīthitopi tathāgatā paṭisallānaṃ sevanti, sabbabuddhānaṃ thutathomitavaṇṇitapasatthatopi tathāgatā paṭisallānaṃ sevanti. Imehi kho, mahārāja, catūhi kāraṇehi tathāgatā paṭisallānaṃ sevanti. Iti kho, mahārāja, tathāgatā paṭisallānaṃ sevanti na sakaraṇīyatāya, na katassa vā paticayāya, atha kho guṇavisesadassāvitāya tathāgatā paṭisallānaṃ sevantī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Uttarikaraṇīyapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Iddhibaladassanapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Bhante nāgasena, bhāsitampetaṃ bhagavatā ‘tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, so ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’ti. Puna ca bhaṇitaṃ ‘ito tiṇṇaṃ māsānaṃ accayena tathāgato parinibbāyissatī’ti. Yadi, bhante nāgasena, bhagavatā bhaṇitaṃ ‘tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā…pe… kappāvasesaṃ vā’ti, tena hi temāsaparicchedo micchā. Yadi, bhante, tathāgatena bhaṇitaṃ ‘ito tiṇṇaṃ māsānaṃ accayena tathāgato parinibbāyissatī’ti, tena hi ‘‘tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā…pe… kappāvasesaṃ vā’ti tampi vacanaṃ micchā. Natthi tathāgatānaṃ aṭṭhāne gajjitaṃ. Amoghavacanā buddhā bhagavanto tathavacanā advejjhavacanā. Ayampi ubhato koṭiko pañho gambhīro sunipuṇo dunnijjhāpayo tavānuppatto, bhindetaṃ diṭṭhijālaṃ, ekaṃse ṭhapaya, bhinda paravāda’’nti. ‘‘Bhāsitampetaṃ, mahārāja, bhagavatā ‘tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā…pe… kappāvasesaṃ vā’ti, temāsaparicchedo ca bhaṇito, so ca pana kappo āyukappo vuccati. Na, mahārāja, bhagavā attano balaṃ kittayamāno evamāha, iddhibalaṃ pana mahārāja, bhagavā parikittayamāno evamāha ‘tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā…pe… kappāvasesaṃ vā’ti. ‘‘Yathā, mahārāja, rañño assājānīyo bhaveyya sīghagati anilajavo, tassa rājā javabalaṃ parikittayanto sanegamajānapadabhaṭabalabrāhmaṇagahapatikaamaccajanamajjhe evaṃ vadeyya ‘ākaṅkhamāno me, bho, ayaṃ hayavaro sāgarajalapariyantaṃ mahiṃ anuvicaritvā khaṇena idhāgaccheyyā’ti, na ca taṃ javagatiṃ tassaṃ parisāyaṃ dasseyya, vijjati ca so javo tassa, samattho ca so khaṇena sāgarajalapariyantaṃ mahiṃ anuvicarituṃ. Evameva kho, mahārāja, bhagavā attano iddhibalaṃ parikittayamāno evamāha, tampi tevijjānaṃ chaḷabhiññānaṃ arahantānaṃ vimalakhīṇāsavānaṃ devamanussānañca majjhe nisīditvā bhaṇitaṃ ‘tathāgatassa kho, ānanda, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, so ākaṅkhamāno, ānanda, tathāgato kappaṃ vā tiṭṭheyya kappāvasesaṃ vā’ti. Vijjati ca taṃ, mahārāja, iddhibalaṃ bhagavato, samattho ca bhagavā iddhibalena kappaṃ vā ṭhātuṃ kappāvasesaṃ vā, na ca bhagavā taṃ iddhibalaṃ tassaṃ parisāyaṃ dasseti, anatthiko, mahārāja, bhagavā sabbabhavehi, garahitā ca tathāgatassa sabbabhavā. Bhāsitampetaṃ, mahārāja, bhagavatā ‘seyyathāpi, bhikkhave, appamattakopi gūtho duggandho hoti. Evameva kho ahaṃ, bhikkhave, appamattakampi bhavaṃ na vaṇṇemi antamaso accharāsaṅghātamattampī’ti api nu kho, mahārāja, bhagavā sabbabhavagatiyoniyo gūthasamaṃ disvā iddhibalaṃ nissāya bhavesu chandarāgaṃ kareyyā’’ti? ‘‘Na hi bhante’’ti. ‘‘Tena hi, mahārāja, bhagavā iddhibalaṃ parikittayamāno evarūpaṃ buddhasīhanādamabhinadī’’ti. ‘‘Sādhu, bhante nāgasena, evametaṃ tathā sampaṭicchāmī’’ti. Iddhibaladassanapañho dasamo. Iddhibalavaggo paṭhamo. Imasmiṃ vagge dasa pañhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}