{
  "id": "mil.17",
  "title": {
    "pali": "Gadrabhavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Gadrabhaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, ‘gadrabhassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, gadrabho nāma saṅkārakūṭepi catukkepi siṅghāṭakepi gāmadvārepi thusarāsimhipi yattha katthaci sayati, na sayanabahulo hoti, evameva kho, mahārāja, yoginā yogāvacarena tiṇasanthārepi paṇṇasanthārepi kaṭṭhamañcakepi chamāyapi yattha katthaci cammakhaṇḍaṃ pattharitvā yattha katthaci sayitabbaṃ, na sayanabahulena bhavitabbaṃ. Idaṃ, mahārāja, gadrabhassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena ‘kaliṅgarūpadhānā, bhikkhave, etarahi mama sāvakā viharanti appamattā ātāpino padhānasmi’nti. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatināpi – ‘‘‘Pallaṅkena nisinnassa, jaṇṇukenābhivassati; Alaṃ phāsuvihārāya, pahitattassa bhikkhuno’’’ti. Gadrabhaṅgapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Kukkuṭaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, ‘kukkuṭassa pañca aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni pañca aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, kukkuṭo kālena samayena paṭisallīyati, evameva kho, mahārāja, yoginā yogāvacarena kālena samayeneva cetiyaṅgaṇaṃ sammajjitvā pānīyaṃ paribhojanīyaṃ upaṭṭhapetvā sarīraṃ paṭijaggitvā nahāyitvā cetiyaṃ vanditvā vuḍḍhānaṃ bhikkhūnaṃ dassanāya gantvā kālena samayena suññāgāraṃ pavisitabbaṃ. Idaṃ, mahārāja, kukkuṭassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, kukkuṭo kālena samayeneva vuṭṭhāti. Evameva kho, mahārāja, yoginā yogāvacarena kālena samayeneva vuṭṭhahitvā cetiyaṅgaṇaṃ sammajjitvā pānīyaṃ paribhojanīyaṃ upaṭṭhapetvā sarīraṃ paṭijaggitvā cetiyaṃ vanditvā punadeva suññāgāraṃ pavisitabbaṃ. Idaṃ, mahārāja, kukkuṭassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, kukkuṭo pathaviṃ khaṇitvā khaṇitvā ajjhohāraṃ ajjhoharati. Evameva kho, mahārāja, yoginā yogāvacarena paccavekkhitvā paccavekkhitvā ajjhohāraṃ ajjhoharitabbaṃ ‘neva davāya na madāya na maṇḍanāya na vibhūsanāya, yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya, iti purāṇañca vedanaṃ paṭihaṅkhāmi navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro cā’ti. Idaṃ, mahārāja, kukkuṭassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena – ‘‘‘Kantāre puttamaṃsaṃva, akkhassabbhañjanaṃ yathā; Evaṃ āhari āhāraṃ, yāpanatthamamucchito’ti. ‘‘Puna caparaṃ, mahārāja, kukkuṭo sacakkhukopi rattiṃ andho hoti. Evameva kho, mahārāja, yoginā yogāvacarena anandheneva andhena viya bhavitabbaṃ, araññepi gocaragāme piṇḍāya carantenapi rajanīyesu rūpasaddagandharasaphoṭṭhabbadhammesu andhena badhirena mūgena viya bhavitabbaṃ, na nimittaṃ gahetabbaṃ, nānubyañjanaṃ gahetabbaṃ. Idaṃ, mahārāja, kukkuṭassa catutthaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena mahākaccāyanena – ‘Cakkhumāssa yathā andho, sotavā badhiro yathā; Paññavāssa [jivhāvassa (sī. pī.)] yathā mūgo, balavā dubbaloriva; Attaatthe [atha atthe (sī. pī.)] samuppanne, sayetha matasāyika’nti. ‘‘Puna caparaṃ, mahārāja, kukkuṭo leḍḍudaṇḍalaguḷamuggarehi paripātiyantopi sakaṃ gehaṃ na vijahati. Evameva kho, mahārāja, yoginā yogāvacarena cīvarakammaṃ karontenapi navakammaṃ karontenapi vattappaṭivattaṃ karontenapi uddisantenapi uddisāpentenapi yoniso manasikāro na vijahitabbo, sakaṃ kho panetaṃ, mahārāja, yogino gehaṃ, yadidaṃ yoniso manasikāro. Idaṃ, mahārāja, kukkuṭassa pañcamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena ‘ko ca, bhikkhave, bhikkhuno gocaro sako pettiko visayo? Yadidaṃ cattāro satipaṭṭhānā’ti. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatināpi – ‘‘‘Yathā sudanto mātaṅgo, sakaṃ soṇḍaṃ na maddati; Bhakkhābhakkhaṃ vijānāti, attano vuttikappanaṃ. ‘‘‘Tatheva buddhaputtena, appamattena vā pana; Jinavacanaṃ na madditabbaṃ, manasikāravaruttama’’’nti. Kukkuṭaṅgapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Kalandakaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, ‘kalandakassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, kalandako paṭisattumhi opatante naṅguṭṭhaṃ papphoṭetvā mahantaṃ katvā teneva naṅguṭṭhalaguḷena paṭisattuṃ paṭibāhati, evameva kho, mahārāja, yoginā yogāvacarena kilesasattumhi opatante satipaṭṭhānalaguḷaṃ papphoṭetvā mahantaṃ katvā teneva satipaṭṭhānalaguḷena sabbakilesā paṭibāhitabbā. Idaṃ, mahārāja, kalandakassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena cūḷapanthakena – ‘Yadā kilesā opatanti, sāmaññaguṇadhaṃsanā; Satipaṭṭhānalaguḷena, hantabbā te punappuna’’’nti. Kalandakaṅgapañho tatiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Dīpiniyaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, ‘dīpiniyā ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, dīpinī sakiṃ yeva gabbhaṃ gaṇhāti, na punappunaṃ purisaṃ upeti? Evameva kho, mahārāja, yoginā yogāvacarena āyatiṃ paṭisandhiṃ uppattiṃ gabbhaseyyaṃ cutiṃ bhedaṃ khayaṃ vināsaṃ saṃsārabhayaṃ duggatiṃ visamaṃ sampīḷitaṃ disvā ‘punabbhave nappaṭisandahissāmī’ti yoniso manasikāro karaṇīyo. Idaṃ, mahārāja, dīpiniyā ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena suttanipāte dhaniyagopālakasutte – ‘‘‘Usabhoriva chetva bandhanāni, nāgo pūtilataṃva dālayitvā; Nāhaṃ punupessaṃ gabbhaseyyaṃ, atha ce patthayasī pavassa devā’’’ti. Dīpiniyaṅgapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Dīpikaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, ‘dīpikassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, dīpiko araññe tiṇagahanaṃ vā vanagahanaṃ vā pabbatagahanaṃ vā nissāya nilīyitvā mige gaṇhāti, evameva kho, mahārāja, yoginā yogāvacarena vivekaṃ sevitabbaṃ araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ appasaddaṃ appanigghosaṃ vijanavātaṃ manussarāhaseyyakaṃ paṭisallānasāruppaṃ; vivekaṃ sevamāno hi, mahārāja, yogī yogāvacaro nacirasseva chaḷabhiññāsu ca vasibhāvaṃ pāpuṇāti. Idaṃ, mahārāja, dīpikassa paṭhamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therehi dhammasaṅgāhakehi – ‘‘‘Yathāpi dīpiko nāma, nilīyitvā gaṇhate [gaṇhatī (sī. pī.)] mige; Tathevāyaṃ buddhaputto, yuttayogo vipassako; Araññaṃ pavisitvāna, gaṇhāti phalamuttama’nti. ‘‘Puna caparaṃ, mahārāja, dīpiko yaṃ kiñci pasuṃ vadhitvā vāmena passena patitaṃ na bhakkheti. Evameva kho, mahārāja, yoginā yogāvacarena veḷudānena vā pattadānena vā pupphadānena vā phaladānena vā sinānadānena vā mattikādānena vā cuṇṇadānena vā dantakaṭṭhadānena vā mukhodakadānena vā cātukamyatāya vā muggasupyatāya [muggasuppatāya (sī. pī.)] vā pāribhaṭa [pāribhaṭṭatāya (sī. pī.)] yatāya vā jaṅghapesanīyena vā vejjakammena vā dūtakammena vā pahiṇagamanena vā piṇḍapaṭipiṇḍena vā dānānuppadānena vā vatthuvijjāya vā nakkhattavijjāya vā aṅgavijjāya [nagavijjāya (ka.)] vā aññataraññatarena vā buddhappaṭikuṭṭhena micchājīvena nipphāditaṃ bhojanaṃ na bhuñjitabbaṃ [paribhuñjitabbaṃ (sī. pī.)] vāmena passena patitaṃ pasuṃ viya dīpiko. Idaṃ, mahārāja, dīpikassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Vacīviññattivipphārā, uppannaṃ madhupāyasaṃ; Sace bhutto bhaveyyāhaṃ, sājīvo garahito mama. ‘‘‘Yadipi me antaguṇaṃ, nikkhamitvā bahī care; Neva bhindeyyamājīvaṃ, cajamānopi jīvita’’’nti. Dīpikaṅgapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Kummaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, ‘kummassa pañca aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni pañca aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, kummo udakacaro udakeyeva vāsaṃ kappeti, evameva kho, mahārāja, yoginā yogāvacarena sabbapāṇabhūtapuggalānaṃ hitānukampinā mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena sabbāvantaṃ lokaṃ pharitvā viharitabbaṃ. Idaṃ, mahārāja, kummassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, kummo udake uppilavanto sīsaṃ ukkhipitvā yadi koci passati, tattheva nimujjati gāḷhamogāhati ‘mā maṃ te puna passeyyu’nti, evameva kho, mahārāja, yoginā yogāvacarena kilesesu opatantesu ārammaṇasare nimujjitabbaṃ gāḷhamogāhitabbaṃ ‘mā maṃ kilesā puna passeyyu’nti. Idaṃ, mahārāja, kummassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, kummo udakato nikkhamitvā kāyaṃ otāpeti, evameva kho, mahārāja, yoginā yogāvacarena nisajjaṭṭhānasayanacaṅkamato mānasaṃ nīharitvā sammappadhāne mānasaṃ otāpetabbaṃ. Idaṃ, mahārāja, kummassa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, kummo pathaviṃ khaṇitvā vivitte vāsaṃ kappeti, evameva kho, mahārāja, yoginā yogāvacarena lābhasakkārasilokaṃ pajahitvā suññaṃ vivittaṃ kānanaṃ vanapatthaṃ pabbataṃ kandaraṃ giriguhaṃ appasaddaṃ appanigghosaṃ pavivittamogāhitvā vivitte yeva vāsaṃ upagantabbaṃ. Idaṃ, mahārāja, kummassa catutthaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena upasenena vaṅgantaputtena – ‘‘‘Vivittaṃ appanigghosaṃ, vāḷamiganisevitaṃ; Seve senāsanaṃ bhikkhu, paṭisallānakāraṇā’ti. ‘‘Puna caparaṃ, mahārāja, kummo cārikaṃ caramāno yadi kañci passati vā, saddaṃ suṇāti vā, soṇḍipañcamāni aṅgāni sake kapāle nidahitvā appossukko tuṇhībhūto tiṭṭhati kāyamanurakkhanto, evameva kho, mahārāja, yoginā yogāvacarena sabbattha rūpasaddagandharasaphoṭṭhabbadhammesu āpatantesu chasu dvāresu saṃvarakavāṭaṃ anugghāṭetvā mānasaṃ samodahitvā saṃvaraṃ katvā satena sampajānena vihātabbaṃ samaṇadhammaṃ anurakkhamānena. Idaṃ, mahārāja, kummassa pañcamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena saṃyuttanikāyavare kummūpamasuttante – ‘‘‘Kummova aṅgāni sake kapāle, samodahaṃ bhikkhu manovitakke; Anissito aññamaheṭhayāno, parinibbutonūpavadeyya kañcī’’’ti. Kummaṅgapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Vaṃsaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, ‘vaṃsassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, vaṃso yattha vāto, tattha anulometi, nāññatthamanudhāvati, evameva kho, mahārāja, yoginā yogāvacarena yaṃ buddhena bhagavatā bhāsitaṃ navaṅgaṃ satthu sāsanaṃ, taṃ anulomayitvā kappiye anavajje ṭhatvā samaṇadhammaṃ yeva pariyesitabbaṃ. Idaṃ, mahārāja, vaṃsassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ mahārāja therena rāhulena – ‘‘‘Navaṅgaṃ buddhavacanaṃ, anulometvāna sabbadā; Kappiye anavajjasmiṃ, ṭhatvāpāyaṃ samuttari’’’nti. Vaṃsaṅgapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Cāpaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, ‘cāpassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, cāpo sutacchito namito [mito (sī. pī. ka.)] yāvaggamūlaṃ samakameva anunamati nappaṭitthambhati, evameva kho, mahārāja, yoginā yogāvacarena theranavamajjhimasamakesu anunamitabbaṃ nappaṭipharitabbaṃ. Idaṃ, mahārāja, cāpassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena vidhura [puṇṇaka] jātake – ‘‘‘Cāpovūnudaro dhīro, vaṃso vāpi pakampaye [cāpo vā nuna me dhīro, vaṃsova anulomayaṃ (sī. pī. ka.)]; Paṭilomaṃ na vatteyya, sa rājavasatiṃ vase’’’ti. Cāpaṅgapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Vāyasaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Bhante nāgasena, ‘vāyasassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, vāyaso āsaṅkitaparisaṅkito yattappayatto carati, evameva kho, mahārāja, yoginā yogāvacarena āsaṅkitaparisaṅkitena yattapayattena upaṭṭhitāya satiyā saṃvutehi indriyehi caritabbaṃ. Idaṃ, mahārāja, vāyasassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, vāyaso yaṃ kiñci bhojanaṃ disvā ñātīhi saṃvibhajitvā bhuñjati, evameva kho, mahārāja, yoginā yogāvacarena ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi, tathārūpehi lābhehi paṭivibhattabhoginā bhavitabbaṃ sīlavantehi sabrahmacārīhi. Idaṃ, mahārāja, vāyasassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Sace me upanāmenti, yathāladdhaṃ tapassino; Sabbe saṃvibhajitvāna, tato bhuñjāmi bhojana’’’nti. Vāyasaṅgapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Makkaṭaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Bhante nāgasena, ‘makkaṭassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, makkaṭo vāsamupagacchanto tathārūpe okāse mahatimahārukkhe pavivitte sabbaṭṭhakasākhe [sabbatthakasākhe (syā.), sabbaṭṭhasākhe (ka.)] bhīruttāṇe vāsamupagacchati, evameva kho, mahārāja, yoginā yogāvacarena lajjiṃ pesalaṃ sīlavantaṃ kalyāṇadhammaṃ bahussutaṃ dhammadharaṃ vinayadharaṃ piyaṃ garubhāvanīyaṃ vattāraṃ vacanakkhamaṃ ovādakaṃ viññāpakaṃ sandassakaṃ samādapakaṃ samuttejakaṃ sampahaṃsakaṃ evarūpaṃ kalyāṇamittaṃ ācariyaṃ nissāya viharitabbaṃ. Idaṃ, mahārāja, makkaṭassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, makkaṭo rukkhe yeva carati tiṭṭhati nisīdati, yadi niddaṃ okkamati, tattheva rattiṃ vāsamanubhavati. Evameva kho, mahārāja, yoginā yogāvacarena pavanābhimukhena bhavitabbaṃ, pavane yeva ṭhānacaṅkamanisajjāsayanaṃ niddaṃ okkamitabbaṃ, tattheva satipaṭṭhānamanubhavitabbaṃ. Idaṃ, mahārāja, makkaṭassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Caṅkamantopi tiṭṭhanto, nisajjāsayanena vā; Pavane sobhate bhikkhu, pavanantaṃva vaṇṇita’’’nti. Makkaṭaṅgapañho dasamo. Gadrabhavaggo paṭhamo. Tassuddānaṃ – Gadrabho ceva [ghorassaro ca (sī. syā. pī.)] kukkuṭo, kalando dīpini dīpiko; Kummo vaṃso ca cāpo ca, vāyaso atha makkaṭoti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}