{
  "id": "mil.22",
  "title": {
    "pali": "Makkaṭakavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Panthamakkaṭakaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1,
      "pali": "‘‘Bhante nāgasena, ‘panthamakkaṭakassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, panthamakkaṭako panthe makkaṭajālavitānaṃ katvā yadi tattha jālake laggati kimi vā makkhikā vā paṭaṅgo vā, taṃ gahetvā bhakkhayati, evameva kho, mahārāja, yoginā yogāvacarena chasu dvāresu satipaṭṭhānajālavitānaṃ katvā yadi tattha kilesamakkhikā bajjhanti, tattheva ghātetabbā. Idaṃ, mahārāja, panthamakkaṭakassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena anuruddhena – ‘‘‘Cittaṃ niyame chasu dvāresu, satipaṭṭhānavaruttame; Kilesā tattha laggā ce, hantabbā te vipassinā’’’ti. Panthamakkaṭakaṅgapañho paṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "Thanassitadārakaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 2,
      "pali": "‘‘Bhante nāgasena, ‘thanassitadārakassa ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, thanassitadārako sadatthe laggati, khīratthiko rodati, evameva kho, mahārāja, yoginā yogāvacarena sadatthe laggitabbaṃ, sabbattha dhammañāṇena bhavitabbaṃ, uddese paripucchāya sammappayoge paviveke garusaṃvāse kalyāṇamittasevane. Idaṃ, mahārāja, thanassitadārakassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena dīghanikāyavare parinibbānasuttante – ‘‘‘Iṅghaṃ tumhe, ānanda, sāratthe [sadatthe (sī. pī.)] ghaṭatha, sāratthe anuyuñjatha; Sāratthe appamattā ātāpino pahitattā viharathā’’’ti. Thanassitadārakaṅgapañho dutiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Cittakadharakummaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "‘‘Bhante nāgasena, ‘cittakadharakummassa [cittakathalakummassa (sī. pī.)] ekaṃ aṅgaṃ gahetabba’nti yaṃ vadesi, katamaṃ taṃ ekaṃ aṅgaṃ gahetabba’’nti? ‘‘Yathā, mahārāja, cittakadharakummo udakabhayā udakaṃ parivajjetvā vicarati, tāya ca pana udakaṃ parivajjanāya āyunā na parihāyati, evameva kho, mahārāja, yoginā yogāvacarena pamāde bhayadassāvinā bhavitabbaṃ, appamāde guṇavisesadassāvinā. Tāya ca pana bhayadassāvitāya na parihāyati sāmaññā, nibbānassa santike upeti [ṭhapeti (ka.)]. Idaṃ, mahārāja, cittakadharakummassa ekaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena dhammapade – ‘‘‘Appamādarato bhikkhu, pamāde bhayadassi vā; Abhabbo parihānāya, nibbānasseva santike’’’ti. Cittakadharakummaṅgapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Pavanaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘‘Bhante nāgasena, ‘pavanassa pañca aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni pañca aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, pavanaṃ nāma asucijanaṃ paṭicchādeti, evameva kho, mahārāja, yoginā yogāvacarena paresaṃ aparaddhaṃ khalitaṃ paṭicchādetabbaṃ na vivaritabbaṃ. Idaṃ, mahārāja, pavanassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, pavanaṃ suññaṃ pacurajanehi, evameva kho, mahārāja, yoginā yogāvacarena rāgadosamohamānadiṭṭhijālehi sabbehi ca kilesehi suññena bhavitabbaṃ. Idaṃ, mahārāja, pavanassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, pavanaṃ vivittaṃ janasambādharahitaṃ, evameva kho, mahārāja, yoginā yogāvacarena pāpakehi akusalehi dhammehi anariyehi pavivittena bhavitabbaṃ. Idaṃ, mahārāja, pavanassa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, pavanaṃ santaṃ parisuddhaṃ, evameva kho, mahārāja, yoginā yogāvacarena santena parisuddhena bhavitabbaṃ, nibbutena pahīnamānena pahīnamakkhena bhavitabbaṃ. Idaṃ, mahārāja, pavanassa catutthaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, pavanaṃ ariyajanasaṃsevitaṃ, evameva kho, mahārāja, yoginā yogāvacarena ariyajanasaṃsevitena bhavitabbaṃ. Idaṃ, mahārāja, pavanassa pañcamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena saṃyuttanikāyavare – ‘‘‘Pavivittehi ariyehi, pahitattehi jhāyibhi; Niccaṃ āraddhavīriyehi, paṇḍitehi sahāvase’’’ti. Pavanaṅgapañho catuttho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Rukkhaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Bhante nāgasena, ‘rukkhassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, rukkho nāma pupphaphaladharo, evameva kho, mahārāja, yoginā yogāvacarena vimuttipupphasāmaññaphaladhārinā bhavitabbaṃ. Idaṃ, mahārāja, rukkhassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, rukkho upagatānamanuppaviṭṭhānaṃ janānaṃ chāyaṃ deti, evameva kho, mahārāja, yoginā yogāvacarena upagatānamanuppaviṭṭhānaṃ puggalānaṃ āmisappaṭisandhārena vā dhammappaṭisanthārena vā paṭisantharitabbaṃ. Idaṃ, mahārāja, rukkhassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, rukkho chāyāvemattaṃ na karoti, evameva kho, mahārāja, yoginā yogāvacarena sabbasattesu vemattatā na kātabbā, coravadhakapaccatthikesupi attanipi samasamā mettābhāvanā kātabbā, ‘kinti ime sattā averā abyāpajjā [abyāpajjhā (sī.)] anīghā sukhī attānaṃ parihareyyu’nti. Idaṃ, mahārāja, rukkhassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Vadhake devadattamhi, core aṅgulimālake; Dhanapāle rāhule ca, sabbattha samako munī’’’ti. Rukkhaṅgapañho pañcamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "Meghaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Bhante nāgasena, ‘meghassa pañca aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni pañca aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, megho uppannaṃ rajojallaṃ vūpasameti, evameva kho, mahārāja, yoginā yogāvacarena uppannaṃ kilesarajojallaṃ vūpasametabbaṃ. Idaṃ, mahārāja, meghassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, megho pathaviyā uṇhaṃ nibbāpeti, evameva kho, mahārāja, yoginā yogāvacarena mettābhāvanāya sadevako loko nibbāpetabbo. Idaṃ, mahārāja, meghassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, megho sabbabījāni viruhāpeti, evameva kho, mahārāja, yoginā yogāvacarena sabbasattānaṃ saddhaṃ uppādetvā taṃ saddhābījaṃ tīsu sampattīsu ropetabbaṃ, dibbamānusikāsu sukhasampattīsu yāvaparamatthanibbānasukhasampatti. Idaṃ, mahārāja, meghassa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, megho ututo samuṭṭhahitvā dharaṇitalaruhe tiṇarukkhalatāgumbaosadhivanappatayo parirakkhati, evameva kho, mahārāja, yoginā yogāvacarena yoniso manasikāraṃ nibbattetvā tena yoniso manasikārena samaṇadhammo parirakkhitabbo, yoniso manasikāramūlakā sabbe kusalā dhammā. Idaṃ, mahārāja, meghassa catutthaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, megho vassamāno naditaḷākapokkharaṇiyo kandarapadarasarasobbhaudapānāni ca paripūreti udakadhārāhi, evameva kho, mahārāja, yoginā yogāvacarena āgamapariyattiyā dhammameghamabhivassayitvā adhigamakāmānaṃ mānasaṃ paripūrayitabbaṃ. Idaṃ, mahārāja, meghassa pañcamaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena sāriputtena dhammasenāpatinā – ‘‘‘Bodhaneyyaṃ janaṃ disvā, satasahassepi yojane; Khaṇena upagantvāna, bodheti taṃ mahāmunī’’’ti. Meghaṅgapañho chaṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "Maṇiratanaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Bhante nāgasena, ‘maṇiratanassa tīṇi aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni tīṇi aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, maṇiratanaṃ ekantaparisuddhaṃ, evameva kho, mahārāja, yoginā yogāvacarena ekantaparisuddhājīvena bhavitabbaṃ. Idaṃ, mahārāja, maṇiratanassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, maṇiratanaṃ na kenaci saddhiṃ missīyati, evameva kho, mahārāja, yoginā yogāvacarena pāpehi pāpasahāyehi saddhiṃ na missitabbaṃ. Idaṃ, mahārāja, maṇiratanassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, maṇiratanaṃ jātiratanehi yojīyati, evameva kho, mahārāja, yoginā yogāvacarena uttamavarajātimantehi saddhiṃ saṃvasitabbaṃ, paṭipannakaphalaṭṭhasekkhaphalasamaṅgīhi sotāpannasakadāgāmianāgāmiarahantatevijjachaḷabhiññasamaṇamaṇiratanehi saddhiṃ saṃvasitabbaṃ. Idaṃ, mahārāja, maṇiratanassa tatiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena suttanipāte – ‘‘‘Suddhā suddhehi saṃvāsaṃ, kappayavho patissatā; Tato samaggā nipakā, dukkhassantaṃ karissathā’’’ti. Maṇiratanapañho sattamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "Māgavikaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 8,
      "pali": "‘‘Bhante nāgasena, ‘māgavikassa cattāri aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni cattāri aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, māgaviko appamiddho hoti, evameva kho, mahārāja, yoginā yogāvacarena appamiddhena bhavitabbaṃ. Idaṃ, mahārāja, māgavikassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, māgaviko migesu yeva cittaṃ upanibandhati, evameva kho, mahārāja, yoginā yogāvacarena ārammaṇesu yeva cittaṃ upanibandhitabbaṃ. Idaṃ, mahārāja, māgavikassa dutiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, māgaviko kālaṃ kammassa jānāti, evameva kho, mahārāja, yoginā yogāvacarena paṭisallānassa kālo jānitabbo ‘ayaṃ kālo paṭisallānassa, ayaṃ kālo nikkhamanāyā’ti. Idaṃ, mahārāja, māgavikassa tatiyaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, māgaviko migaṃ disvā hāsamabhijaneti ‘imaṃ lacchāmī’ti, evameva kho, mahārāja, yoginā yogāvacarena ārammaṇe abhiramitabbaṃ, hāsamabhijanetabbaṃ ‘uttariṃ visesamadhigacchissāmī’ti. Idaṃ, mahārāja, māgavikassa catutthaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ mahārāja therena mogharājena – ‘‘‘Ārammaṇe labhitvāna, pahitattena bhikkhunā; Bhiyyo hāso janetabbo, adhigacchissāmi uttari’’’nti. Māgavikaṅgapañho aṭṭhamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "Bāḷisikaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Bhante nāgasena, ‘bāḷisikassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, bāḷisiko baḷisena macche uddharati, evameva kho, mahārāja, yoginā yogāvacarena ñāṇena uttariṃ sāmaññaphalāni uddharitabbāni. Idaṃ, mahārāja, bāḷisikassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, bāḷisiko parittakaṃ vadhitvā vipulaṃ lābhamadhigacchati, evameva kho, mahārāja, yoginā yogāvacarena parittalokāmisamattaṃ pariccajitabbaṃ. Lokāmisamattaṃ, mahārāja, pariccajitvā yogī yogāvacaro vipulaṃ sāmaññaphalaṃ adhigacchati. Idaṃ, mahārāja, bāḷisikassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, therena rāhulena – ‘‘‘Suññatañcānimittañca, vimokkhañcāppaṇihitaṃ; Caturo phale chaḷabhiññā, cajitvā lokāmisaṃ labhe’’’ti. Bāḷisikaṅgapañho navamo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "Tacchakaṅgapañho",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Bhante nāgasena, ‘tacchakassa dve aṅgāni gahetabbānī’ti yaṃ vadesi, katamāni tāni dve aṅgāni gahetabbānī’’ti? ‘‘Yathā, mahārāja, tacchako kāḷasuttaṃ anulometvā rukkhaṃ tacchati, evameva kho, mahārāja, yoginā yogāvacarena jinasāsanamanulomayitvā sīlapathaviyaṃ patiṭṭhahitvā saddhāhatthena paññāvāsiṃ gahetvā kilesā tacchetabbā. Idaṃ, mahārāja, tacchakassa paṭhamaṃ aṅgaṃ gahetabbaṃ. ‘‘Puna caparaṃ, mahārāja, tacchako phegguṃ apaharitvā sāramādiyati, evameva kho, mahārāja, yoginā yogāvacarena sassataṃ ucchedaṃ taṃ jīvaṃ taṃ sarīraṃ aññaṃ jīvaṃ aññaṃ sarīraṃ taduttamaṃ aññaduttamaṃ akatamabhabbaṃ apurisakāraṃ abrahmacariyavāsaṃ sattavināsaṃ navasattapātubhāvaṃ saṅkhārasassatabhāvaṃ yo karoti, so paṭisaṃvedeti, añño karoti, añño paṭisaṃvedeti, kammaphaladassanā ca kiriyaphaladiṭṭhi ca iti evarūpāni ceva aññāni ca vivādapathāni apanetvā saṅkhārānaṃ sabhāvaṃ paramasuññataṃ nirīhanijjīvataṃ [nisattanijīvataṃ (ka.)] accantaṃ suññataṃ ādiyitabbaṃ. Idaṃ, mahārāja, tacchakassa dutiyaṃ aṅgaṃ gahetabbaṃ. Bhāsitampetaṃ, mahārāja, bhagavatā devātidevena suttanipāte – ‘‘‘Kāraṇḍavaṃ niddhamatha, kasambuṃ apakassatha; Tato palāpe vāhetha, assamaṇe samaṇamānine. ‘‘‘Niddhamitvāna pāpicche, pāpaācāragocare; Suddhā suddhehi saṃvāsaṃ, kappayavho patissatā; Tato samaggā nipakā, dukkhassantaṃ karissathā’’’ti. Tacchakaṅgapañho dasamo. Makkaṭakavaggo chaṭṭho. Tassuddānaṃ – Makkaṭo dārako kummo, vanaṃ rukkho ca pañcamo; Megho maṇi māgaviko, bāḷisī tacchakena cāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}