{
  "id": "dn.3.7",
  "title": {
    "pali": "Lakkhaṇasuttaṃ",
    "english": "The Discourse on Characteristics",
    "sinhala": "ලක්ඛණ සූත්‍රය"
  },
  "sections": [
    {
      "number": 198,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhaddante’’ti [bhadanteti (sī. syā. pī.)] te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca –",
      "english": "Thus have I heard. At one time the Blessed One was living at Savatthi, in Jeta's Grove, Anathapindika's Park. There the Blessed One addressed the monks, saying: \"Monks.\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this:",
      "sinhala": "මෙවන්‍ යෙකින් මා විසින් අසන ලදී: එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවනාරාමයෙහි අනේපිඬු සිටුතුමාගේ ආරාමයෙහි වැඩ වාසය කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා, “මහණෙනි” යයි වදාළ සේක. “භාග්‍යවතුන් වහන්ස” යයි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:",
      "paliTitle": "Dvattiṃsamahāpurisalakkhaṇāni",
      "englishTitle": "Thirty-two Marks of a Great Man",
      "sinhalaTitle": "දෙතිස් මහාපුරුෂ ලක්ෂණ"
    },
    {
      "number": 199,
      "pali": "‘‘Dvattiṃsimāni, bhikkhave, mahāpurisassa mahāpurisalakkhaṇāni, yehi samannāgatassa mahāpurisassa dveva gatiyo bhavanti anaññā. Sace agāraṃ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni satta ratanāni bhavanti; seyyathidaṃ, cakkaratanaṃ hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ adaṇḍena asatthena dhammena abhivijiya ajjhāvasati. Sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭṭacchado [vivaṭacchado (syā. ka.), vivattacchado (sī. pī.)].",
      "english": "\"Monks, a great man possesses these thirty-two marks of a great man. For a great man endowed with these, there are only two possible destinies, no other. If he lives the household life, he becomes a wheel-turning monarch, a righteous king who rules according to Dhamma, a conqueror of the four quarters, who establishes the security of his realm and is endowed with the seven treasures. These are the seven treasures he possesses: namely, the wheel treasure, the elephant treasure, the horse treasure, the jewel treasure, the woman treasure, the treasurer treasure, and the counselor treasure as the seventh. Moreover, he has over a thousand sons who are valiant, heroic in form, and destroyers of the armies of their enemies. He dwells having conquered this earth up to the ocean shore, without force or weapons, but by means of Dhamma. But if he goes forth from the household life into homelessness, he becomes an Arahant, a fully enlightened Buddha in the world, one who has removed the veil.\"",
      "sinhala": "‘‘මහණෙනි, මහා පුරුෂ ලක්ෂණ තිස් දෙකක් ඇත. ඒ ලක්ෂණ වලින් යුක්ත වූ මහා පුරුෂයාට ගති දෙකක් පමණක් මිස වෙනත් ගතියක් නැත. හෙතෙම ගිහිගෙයි වාසය කරන්නේ නම්, ධර්මිෂ්ඨ වූ ධර්මරාජ වූ සතර දිග්විජය කළ ජනපදවල ස්ථාවරත්වය ලබාගත් සප්ත රත්නයන්ගෙන් සමන්විත වූ සක්විති රජෙක් වන්නේය. එනම්, සක් රුවන, ඇත් රුවන, අස් රුවන, මැණික් රුවන, බිසව රුවන, සිටු රුවන, සත්වෙනි පරිණායක රුවන යන මේ සත් රුවන ඔහුට ඇත. වීර ශූර ස්වරූප ඇති අනුන්ගේ සේනාවන් මර්දනය කරන්නාවූ දහසකට අධික පුත්‍රයන් ඔහුට වන්නාහ. හෙතෙම මුහුද කෙළවර කොට ඇති මේ පොළොව දඬු රහිතව, අවි රහිතව ධර්මයෙන් යටත් කරගෙන වාසය කරයි. යම් හෙයකින් ගිහිගෙන් අනගාරික ජීවිතයකට පැවිදි වන්නේ නම්, ලෝකයෙහි විවෘත ආවරණ ඇති [විවෘත ආවරණ (ස්‍යා. ක.), විවර්ත ආවරණ (සී. පී.)] අර්හත් වූ සම්මා සම්බුද්ධ වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 200,
      "pali": "‘‘Katamāni ca tāni, bhikkhave, dvattiṃsa mahāpurisassa mahāpurisalakkhaṇāni, yehi samannāgatassa mahāpurisassa dveva gatiyo bhavanti anaññā? Sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭṭacchado. ‘‘Idha, bhikkhave, mahāpuriso suppatiṭṭhitapādo hoti. Yampi, bhikkhave, mahāpuriso suppatiṭṭhitapādo hoti, idampi, bhikkhave, mahāpurisassa mahāpurisalakkhaṇaṃ bhavati. ‘‘Puna caparaṃ, bhikkhave, mahāpurisassa heṭṭhāpādatalesu cakkāni jātāni honti sahassārāni sanemikāni sanābhikāni sabbākāraparipūrāni [sabbākāraparipūrāni suvibhattantarāni (sī. pī.)]. Yampi, bhikkhave, mahāpurisassa heṭṭhāpādatalesu cakkāni jātāni honti sahassārāni sanemikāni sanābhikāni sabbākāraparipūrāni, idampi, bhikkhave, mahāpurisassa mahāpurisalakkhaṇaṃ bhavati. ‘‘Puna caparaṃ, bhikkhave, mahāpuriso āyatapaṇhi hoti…pe… dīghaṅguli hoti… mudutalunahatthapādo hoti… jālahatthapādo hoti… ussaṅkhapādo hoti… eṇijaṅgho hoti… ṭhitakova anonamanto ubhohi pāṇitalehi jaṇṇukāni parimasati parimajjati… kosohitavatthaguyho hoti… suvaṇṇavaṇṇo hoti kañcanasannibhattaco… sukhumacchavi hoti, sukhumattā chaviyā rajojallaṃ kāye na upalimpati… ekekalomo hoti, ekekāni lomāni lomakūpesu jātāni… uddhaggalomo hoti, uddhaggāni lomāni jātāni nīlāni añjanavaṇṇāni kuṇḍalāvaṭṭāni [kuṇḍalāvattāni (bahūsu)] dakkhiṇāvaṭṭakajātāni [dakkhiṇāvattakajātāni (sī. syā. pī.)] … brahmujugatto hoti… sattussado hoti… sīhapubbaddhakāyo hoti… citantaraṃso [pitantaraṃso (syā.)] hoti… nigrodhaparimaṇḍalo hoti, yāvatakvassa kāyo tāvatakvassa byāmo yāvatakvassa byāmo tāvatakvassa kāyo… samavaṭṭakkhandho hoti… rasaggasaggī hoti… sīhahanu hoti… cattālīsadanto hoti … samadanto hoti… aviraḷadanto hoti… susukkadāṭho hoti… pahūtajivho hoti… brahmassaro hoti karavīkabhāṇī… abhinīlanetto hoti… gopakhumo hoti… uṇṇā bhamukantare jātā hoti, odātā mudutūlasannibhā. Yampi, bhikkhave, mahāpurisassa uṇṇā bhamukantare jātā hoti, odātā mudutūlasannibhā, idampi, bhikkhave, mahāpurisassa mahāpurisalakkhaṇaṃ bhavati. ‘‘Puna caparaṃ, bhikkhave, mahāpuriso uṇhīsasīso hoti. Yampi, bhikkhave, mahāpuriso uṇhīsasīso hoti, idampi, bhikkhave, mahāpurisassa mahāpurisalakkhaṇaṃ bhavati. ‘‘Imāni kho tāni, bhikkhave, dvattiṃsa mahāpurisassa mahāpurisalakkhaṇāni, yehi samannāgatassa mahāpurisassa dveva gatiyo bhavanti anaññā. Sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭṭacchado. ‘‘Imāni kho, bhikkhave, dvattiṃsa mahāpurisassa mahāpurisalakkhaṇāni bāhirakāpi isayo dhārenti, no ca kho te jānanti – ‘imassa kammassa kaṭattā idaṃ lakkhaṇaṃ paṭilabhatī’ti. (1) ",
      "english": "\"And what, monks, are those thirty-two marks of a great man with which a great man is endowed, by reason of which he has only two possible destinies, and no other? If he lives the household life, he becomes a wheel-turning monarch… but if he goes forth from the household life into homelessness, he becomes a fully enlightened Arahant, one who has drawn back the veil from the world. Here, monks, a great man has well-planted feet. The fact that a great man has well-planted feet, this, monks, is a mark of a great man. Furthermore, monks, on the soles of the great man's feet, wheels appear, with a thousand spokes, with rims and hubs, complete in every respect. The fact that on the soles of the great man's feet, wheels appear, with a thousand spokes, with rims and hubs, complete in every respect, this, monks, is a mark of a great man. Furthermore, monks, a great man has projecting heels… has long fingers… has soft and tender hands and feet… has webbed hands and feet… has ankles like rounded pots… has legs like an antelope… standing without bending, he can touch and rub his knees with both hands… has his male organs withdrawn into a sheath… has skin the color of gold… has delicate skin such that dust and dirt do not adhere to his body… has a single hair in each pore… has hairs that grow upwards; the hairs grow upwards, are blue-black like añjana eye-paint, curled in rings, turning to the right… has a body that is perfectly upright… has the seven taste nerves well connected… has the front half of his body like a lion… has shoulders that are well-rounded… has a frame like a banyan tree: the length of his body is equal to the span of his arms, and the span of his arms is equal to the length of his body… has evenly rounded shoulders… has a keen sense of taste… has a jaw like a lion… has forty teeth… has even teeth… has teeth without gaps… has very white canine teeth… has a large tongue… has a voice like Brahma, a melodious tone… has deep blue eyes… has eyelashes like a cow… between the eyebrows a soft white down grows like cotton wool. The fact that between the eyebrows a soft white down grows like cotton wool, this, monks, is a mark of a great man. Furthermore, monks, a great man has a head like a turban. The fact that a great man has a head like a turban, this, monks, is a mark of a great man. These, monks, are the thirty-two marks of a great man with which a great man is endowed, by reason of which he has only two possible destinies, and no other. If he lives the household life, he becomes a wheel-turning monarch… but if he goes forth from the household life into homelessness, he becomes a fully enlightened Arahant, one who has drawn back the veil from the world. These thirty-two marks of a great man, monks, are possessed even by outside ascetics, but they do not know, 'It is as a result of doing such and such a deed that one gains this mark.'\"",
      "sinhala": "‘‘මහණෙනි, මහාපුරුෂ ලක්ෂණ නම් වූ ඒ තිස් දෙක කවරේ ද? යම් ලක්ෂණවලින් යුක්ත වූ මහාපුරුෂයාට වෙනත් ගති දෙකක් නොවන්නේ ද? ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වේ...යම් හෙයකින් ගිහිගෙයින් නික්ම අනගාරික ජීවිතයකට පැවිදි වන්නේ නම්, ලෝකයෙහි විවෘත වූ ආවරණ ඇති අරහත් වූ සම්මා සම්බුද්ධ වේ. මහණෙනි, මෙහි මහාපුරුෂයා මනාව පිහිටි පාද ඇත්තේ වෙයි. මහණෙනි, යම් මහාපුරුෂයෙක් මනාව පිහිටි පාද ඇත්තේ වේ නම්, මහණෙනි, මෙය ද මහාපුරුෂයාගේ මහාපුරුෂ ලක්ෂණයකි.\n\nතවද මහණෙනි, මහාපුරුෂයාගේ යටිපතුල්වල දහසක් අර ඇති, වළලු ඇති, නාභි ඇති, සියලු ආකාරයෙන් සම්පූර්ණ වූ [සියලු ආකාරයෙන් සම්පූර්ණ වූ, මනාව බෙදුණු අන්තර ඇති] චක්‍රයන් උපදී. මහණෙනි, යම් මහාපුරුෂයෙකුගේ යටිපතුල්වල දහසක් අර ඇති, වළලු ඇති, නාභි ඇති, සියලු ආකාරයෙන් සම්පූර්ණ වූ චක්‍රයන් උපදී නම්, මහණෙනි, මෙය ද මහාපුරුෂයාගේ මහාපුරුෂ ලක්ෂණයකි.\n\nතවද මහණෙනි, මහාපුරුෂයා දික් වූ විලුඹ ඇත්තේ වෙයි...දිගු ඇඟිලි ඇත්තේ වෙයි… මෘදු වූ, තරුණ වූ අත් පා ඇත්තේ වෙයි… දැල් බැඳි අත් පා ඇත්තේ වෙයි… උස් වූ වළලුකර ඇත්තේ වෙයි… මුවෙකුගේ කලවා වැනි කලවා ඇත්තේ වෙයි… සිටගෙන සිටියද නො නැමී අත් දෙකින් දණහිස් ස්පර්ශ කරයි, පිරිමදියි… කොස් ඇටයක් සේ ඇතුළට ගිය පුරුෂ ගුහ්‍ය ඇත්තේ වෙයි… රන්වන් පාට ඇත්තේ වෙයි, රන් පැහැ සමක් ඇත්තේ වෙයි… සියුම් සම ඇත්තේ වෙයි, සියුම් වූ සම නිසා ශරීරයෙහි දූවිලි තැවරෙන්නේ නැත… එක එක ලොම් ඇත්තේ වෙයි, එක එක ලොම් ලොම් කූපවල හටගනී… උඩට නැඟුණු ලොම් ඇත්තේ වෙයි, උඩට නැඟුණු ලොම් හටගනී, නිල් පාට ඇත්තේය, අඳුන් වන් පාට ඇත්තේය, කරකැවුණු ලොම් දක්ෂිණාවර්තව හටගනී [දකුණට කරකැවුණු ලොම් හටගනී] … බඹුන් මෙන් ඍජු වූ ගත ඇත්තේ වෙයි… මිහිරි හඬ ඇත්තේ වෙයි… සිංහයෙකුගේ ඉදිරි භාගයක් වැනි ශරීරයක් ඇත්තේ වෙයි… පිරුණු අන්සය ඇත්තේ [පුෂ්ටිමත් වූ අන්සය ඇත්තේ] වෙයි… නුගරුක පරිමණ්ඩල ඇත්තේ වෙයි, යම් පමණක් ශරීරය ද, එපමණක් විතස්තිය, යම් පමණක් විතස්තිය ද, එපමණක් ශරීරය වෙයි… සම වූ වටකුරු ස්කන්ධය ඇත්තේ වෙයි… රසයන් ලැබීමේ අග්‍රස්ථානය ඇත්තේ වෙයි… සිංහ හනු ඇත්තේ වෙයි… හතළිස් දත් ඇත්තේ වෙයි… සම දත් ඇත්තේ වෙයි… නො පරතර වූ දත් ඇත්තේ වෙයි… ඉතා සුදු දළ දත් ඇත්තේ වෙයි… බොහෝ දිව ඇත්තේ වෙයි… බ්‍රහ්ම ස්වරය ඇත්තේ වෙයි, කරවීක පක්ෂියෙකු මෙන් කථා කරයි… ඉතා නිල් ඇස් ඇත්තේ වෙයි… ගවයාගේ ඇස් මෙන් ඇස් ඇත්තේ වෙයි… ඌර්ණ රෝම ධාතුව ඇහිබැමි අතරෙහි උපදී, සුදුය, මෘදු කපු පුළුන් වැනි ය. මහණෙනි, යම් මහාපුරුෂයෙකුගේ ඌර්ණ රෝම ධාතුව ඇහිබැමි අතරෙහි උපදී ද, සුදු ද, මෘදු කපු පුළුන් වැනි ද, මහණෙනි, මෙය ද මහාපුරුෂයාගේ මහාපුරුෂ ලක්ෂණයකි.\n\nතවද මහණෙනි, මහාපුරුෂයා උෂ්ණීෂ ශීර්ෂ ඇත්තේ වෙයි. මහණෙනි, යම් මහාපුරුෂයෙක් උෂ්ණීෂ ශීර්ෂ ඇත්තේ වේ නම්, මහණෙනි, මෙය ද මහාපුරුෂයාගේ මහාපුරුෂ ලක්ෂණයකි.\n\nමහණෙනි, මේවා මහාපුරුෂයාගේ මහාපුරුෂ ලක්ෂණ නම් වූ තිස් දෙකය. යම් ලක්ෂණවලින් යුක්ත වූ මහාපුරුෂයාට වෙනත් ගති දෙකක් නොවන්නේ ද? ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වේ...යම් හෙයකින් ගිහිගෙයින් නික්ම අනගාරික ජීවිතයකට පැවිදි වන්නේ නම්, ලෝකයෙහි විවෘත වූ ආවරණ ඇති අරහත් වූ සම්මා සම්බුද්ධ වේ. මහණෙනි, මේවා මහාපුරුෂයාගේ මහාපුරුෂ ලක්ෂණ තිස් දෙකය. එසේ වූ බාහිර තාපසයෝ ද දරත්. එහෙත් ඔවුහු, ‘මේ කර්මය කිරීමෙන් මේ ලක්ෂණය ලබන්නේ ය’ යි නො දනිති. (1)",
      "paliTitle": ""
    },
    {
      "number": 201,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno daḷhasamādāno ahosi kusalesu dhammesu, avatthitasamādāno kāyasucarite vacīsucarite manosucarite dānasaṃvibhāge sīlasamādāne uposathupavāse matteyyatāya petteyyatāya sāmaññatāya brahmaññatāya kule jeṭṭhāpacāyitāya aññataraññataresu ca adhikusalesu dhammesu. So tassa kammassa kaṭattā upacitattā ussannattā vipulattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. So tattha aññe deve dasahi ṭhānehi adhiggaṇhāti dibbena āyunā dibbena vaṇṇena dibbena sukhena dibbena yasena dibbena ādhipateyyena dibbehi rūpehi dibbehi saddehi dibbehi gandhehi dibbehi rasehi dibbehi phoṭṭhabbehi. So tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati. Suppatiṭṭhitapādo hoti. Samaṃ pādaṃ bhūmiyaṃ nikkhipati, samaṃ uddharati, samaṃ sabbāvantehi pādatalehi bhūmiṃ phusati.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former dwelling place, when he was previously a human being, was firm in resolve regarding skillful qualities, unwavering in resolve regarding good conduct of body, good conduct of speech, good conduct of mind, in generosity, sharing, in the undertaking of morality, in the observance of the Uposatha, in respect for mother, in respect for father, in respect for ascetics, in respect for brahmins, in honoring elders in the family, and in various other exceedingly skillful qualities. Due to the performance of that action, its accumulation, its abundance, its magnitude, on the dissolution of the body, after death, he is reborn in a good destination, a heavenly world. There, he surpasses the other gods in ten ways: with divine lifespan, with divine beauty, with divine happiness, with divine glory, with divine sovereignty, with divine forms, with divine sounds, with divine smells, with divine tastes, with divine tactile sensations. Having passed away from there, when he comes to this existence, he obtains this mark of a great man: He has well-established feet. He places his foot evenly on the ground, lifts it evenly, and touches the ground evenly with the entire sole of his foot.\"",
      "sinhala": "‘‘මහණෙනි, යම්සේ තථාගතයන් පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර නිකේතනයෙහි, පළමුව මනුෂ්‍ය භූතව සිටියදී කුසල ධර්මයන්හි දැඩි අධිෂ්ඨාන ඇති වූයේ ද, පිහිටි අධිෂ්ඨාන ඇති වූයේ ද, කාය සුචරිතයෙහි, වාචී සුචරිතයෙහි, මනෝ සුචරිතයෙහි, දාන සංවිභාගයෙහි, සීල සමාදානයෙහි, උපෝසථ සමාදානයෙහි, මව් කෙරෙහි දැක්විය යුතු යුතුකම්හි, පියා කෙරෙහි දැක්විය යුතු යුතුකම්හි, ශ්‍රමණ ගරුත්වයේහි, බ්‍රාහ්මණ ගරුත්වයේහි, කුලයෙහි වැඩිහිටියන්ට සැලකීමෙහි, අනෙකුත් වූ අධික කුසල ධර්මයන්හි යෙදුනේ ද, හේ ඒ කර්මය කිරීමෙන්, වැඩීමෙන්, උස් කිරීමෙන්, විශාල කිරීමෙන් කය බිඳීමෙන් මරණින් මතු සුගතියෙහි, ස්වර්ග ලෝකයෙහි උපදී. හෙතෙම එහි අනෙක් දෙවියන් දස ආකාරයකින් ඉක්මවයි. එනම් දිව්‍ය ආයුෂයෙන්, දිව්‍ය වර්ණයෙන්, දිව්‍ය සැපයෙන්, දිව්‍ය යසසින්, දිව්‍ය ආධිපත්‍යයෙන්, දිව්‍ය රූපයන්ගෙන්, දිව්‍ය ශබ්දයන්ගෙන්, දිව්‍ය ගන්ධයන්ගෙන්, දිව්‍ය රසයන්ගෙන්, දිව්‍ය ස්පර්ශයන්ගෙන් ඉක්මවයි. හෙතෙම එතැනින් චුතව මෙලොවට පැමිණියේ මහා පුරිස ලක්ෂණයක් ලබයි. මනාව පිහිටි පාද ඇත්තේ වෙයි. සම සේ පාදය බිමෙහි තබයි. සම සේ උද්ධරණය කරයි. සම සේ සියලු අන්තවලින් යුත් පාද තලයෙන් බිම ස්පර්ශ කරයි.",
      "paliTitle": "(1) Suppatiṭṭhitapādatālakkhaṇaṃ",
      "englishTitle": "The Mark of Well-Planted Foot-Soles",
      "sinhalaTitle": "සුප්‍රතිෂ්ඨිත පාද තල ලක්ෂණය"
    },
    {
      "number": 202,
      "pali": "‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni satta ratanāni bhavanti; seyyathidaṃ, cakkaratanaṃ hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ akhilamanimittamakaṇṭakaṃ iddhaṃ phītaṃ khemaṃ sivaṃ nirabbudaṃ adaṇḍena asatthena dhammena abhivijiya ajjhāvasati. Rājā samāno kiṃ labhati? Akkhambhiyo [avikkhambhiyo (sī. pī.)] hoti kenaci manussabhūtena paccatthikena paccāmittena. Rājā samāno idaṃ labhati. ‘‘Sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭṭacchado. Buddho samāno kiṃ labhati? Akkhambhiyo hoti abbhantarehi vā bāhirehi vā paccatthikehi paccāmittehi rāgena vā dosena vā mohena vā samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"Endowed with that characteristic, if he lives the household life, he becomes a wheel-turning monarch, a righteous king, a king of righteousness, victorious in the four quarters, who has achieved stability in the country, possessed of the seven treasures. These seven treasures are: the wheel treasure, the elephant treasure, the horse treasure, the jewel treasure, the woman treasure, the treasurer treasure, and the counselor treasure as the seventh. Moreover, he has over a thousand sons who are heroic, of fierce appearance, and crushers of the armies of enemies. He conquers and dwells possessing this earth bounded by the ocean, without opposition, without weapons, without obstacles, prosperous, abundant, secure, free from danger, and untroubled, by righteousness, not by force. What does he gain by being a king? He is unassailable by any hostile person, by any enemy in human form. This is what he gains by being a king. But if he goes forth from the household life into homelessness, he becomes an Arahant, a Fully Enlightened Buddha, in the world with the veil removed. What does he gain by being a Buddha? He is unassailable by internal or external hostile persons or enemies, by lust, by hatred, by delusion, by any ascetic or brahmin, by any god, by Mara, by Brahma, or by anyone in the world. This is what he gains by being a Buddha.\" This is what the Blessed One said.",
      "sinhala": "‘‘යම් හෙයකින් ඔහු ඒ ලක්ෂණයෙන් යුක්ත වූයේ ගිහිගෙයි වාසය කරන්නේ නම්, ඔහු ධර්මිෂ්ඨ වූ ධර්මරාජ වූ සතර දිසාව ජයගත් ජනපදවල ස්ථාවරභාවයට පැමිණි සප්ත රත්නයන්ගෙන් සමන්විත වූ සක්විති රජෙක් වන්නේ ය. ඔහුට මේ සප්ත රත්නයන් වන්නේ ය. එනම්, චක්‍රරත්නය, හස්තිරත්නය, අශ්වරත්නය, මණිරත්නය, ස්ත්‍රීරත්නය, ගෘහපතිරත්නය, සත්වන පරිණායක රත්නය යන මේවා ය. එසේ ම ඔහුට ශූර වූ වීර ස්වරූප ඇති සතුරු සේනාවන් මඬින්නාවූ පුත්‍රයන් දහසකට අධික සංඛ්‍යාවක් වෙති. ඔහු මුළු පොළොව සයුරින් කෙළවර වූ සතුරු උවදුරු නැති සශ්‍රීක වූ සුවපහසු වූ භය රහිත වූ කරදර නැති දඬුවම් රහිත ආයුධ රහිත ධර්මයෙන් ජයගෙන වාසය කරයි. රජ වූ ඔහුට කිමෙක් ලැබේද? කිසිම මනුෂ්‍යයෙකුට හෝ සතුරෙකුට හෝ විරුද්ධවාදියෙකුට හෝ බාධා කළ නොහැකි වන්නේ ය. රජ වූ ඔහුට මෙය ලැබෙන්නේ ය. යම් හෙයකින් ඔහු ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැවිදි වන්නේ නම්, ලෝකයෙහි වැසී නොපවතින ආවරණ ඇති අරහත් වූ සම්මා සම්බුද්ධ වෙයි. බුදු වූ ඔහුට කිමෙක් ලැබේද? ඇතුළතින් හෝ පිටතින් හෝ සතුරන්ගෙන් හෝ විරුද්ධවාදීන්ගෙන් හෝ රාගයෙන් හෝ ද්වේශයෙන් හෝ මෝහයෙන් හෝ ශ්‍රමණයාගෙන් හෝ බ්‍රාහ්මණයන්ගෙන් හෝ දෙවියන්ගෙන් හෝ මාරයාගෙන් හෝ බ්‍රහ්මයාගෙන් හෝ ලෝකයෙහි කිසිවෙකුට හෝ බාධා කළ නොහැකි වන්නේ ය. බුදු වූ ඔහුට මෙය ලැබෙන්නේ ය.’’ භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 203,
      "pali": "Tatthetaṃ vuccati – ‘‘Sacce ca dhamme ca dame ca saṃyame, Soceyyasīlālayuposathesu ca; Dāne ahiṃsāya asāhase rato, Daḷhaṃ samādāya samattamācari [samantamācari (syā. ka.)]. ‘‘So tena kammena divaṃ samakkami [apakkami (syā. ka.)], Sukhañca khiḍḍāratiyo ca anvabhi [aṃnvabhi (ṭīkā)]; Tato cavitvā punarāgato idha, Samehi pādehi phusī vasundharaṃ. ‘‘Byākaṃsu veyyañjanikā samāgatā, Samappatiṭṭhassa na hoti khambhanā; Gihissa vā pabbajitassa vā puna [pana (syā.)], Taṃ lakkhaṇaṃ bhavati tadatthajotakaṃ. ‘‘Akkhambhiyo hoti agāramāvasaṃ, Parābhibhū sattubhi nappamaddano; Manussabhūtenidha hoti kenaci, Akkhambhiyo tassa phalena kammuno. ‘‘Sace ca pabbajjamupeti tādiso, Nekkhammachandābhirato vicakkhaṇo; Aggo na so gacchati jātu khambhanaṃ, Naruttamo esa hi tassa dhammatā’’ti. ",
      "english": "Thus, it is said regarding that: \"In truth and in righteousness, in taming and in restraint, in purity, virtuous conduct, alms-giving, and observances, in giving, in harmlessness, and in non-violence being delighted, firmly undertaking, he behaves perfectly.\"\n\n\"By that action, he goes to heaven, and experiences happiness and delightful pleasures; having passed away from there, he comes back here again, touches the earth with level feet.\"\n\n\"Diviners, having assembled, declare, for one who is perfectly established, there is no obstruction; whether for a householder or a renunciate again, that characteristic is indicative of that meaning.\"\n\n\"He is unobstructable dwelling in a house, unvanquished, uncrushed by enemies; by anyone who has become a human being here, he is unobstructable by the fruit of that action.\"\n\n\"And if such a one goes forth into homelessness, delighting in the desire for renunciation, discerning; that excellent one never goes to obstruction; for this best of men, this is the nature of things.\"",
      "sinhala": "එහි මෙය කියනු ලැබේ – “සත්‍යයෙහිද, ධර්මයෙහිද, දමනයෙහිද, සංයමයෙහිද, පිරිසිදු බවෙහිද, සීලයේ ඇලීමෙහිද, උපෝසථයන්හිද, දානයෙහිද, අවිහිංසාවෙහිද, දරුණු නොවී සිටීමෙහිද ඇලුණු ඔහු, දැඩිව සමාදන්ව සියල්ල මැනවින් ආචරණය කරයි.\n\nඔහු ඒ කර්මය හේතුවෙන් දිව්‍ය ලෝකයට පැමිණියේය. සැපයද, ක්‍රීඩාවන්ද, රතියන්ද අනුභව කළේය. එතැනින් චුතව නැවත මෙලොවට පැමිණ, සම වූ පාදයන්ගෙන් වසුන්දරාව ස්පර්ශ කරයි.\n\nඑකතුවූ වෛයාකරණිකයෝ (ලක්ෂණ ශාස්ත්‍රඥයෝ) ප්‍රකාශ කළහ. මනාකොට පිහිටි ඔහුට කිසිවකින් බාධාවක් නොවන්නේය. ගිහියාට හෝ පැවිද්දාට හෝ නැවතත් එම ලක්ෂණය ඒ අර්ථය දක්වන්නක් වන්නේය.\n\nගිහිගෙයි වාසය කරද්දී ඔහුට කිසිවකුගෙන් බාධාවක් නොවන්නේය. සතුරන් විසින් පරාභවයට පත් නොකළ හැකි වන්නේය. මනුෂ්‍යයකු වී මෙලොවෙහි කිසිවකුටත් ඔහුට බාධා කළ නොහැකි වන්නේ ඒ කර්මයේ ඵලයෙනි.\n\nඑබඳු වූ ඔහු පැවිදි බවට පැමිණෙන්නේ නම්, නෛෂ්ක්‍රම්‍යයෙහි ඇලුණු නුවණැති ඔහු උතුම් තැනැත්තෙකි. ඔහු කිසි කලෙක බාධාවකට නොපැමිණෙන්නේය. ඒ නරෝත්තමයාගේ ධර්මතාවය එයයි.”",
      "paliTitle": ""
    },
    {
      "number": 204,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno bahujanassa sukhāvaho ahosi, ubbegauttāsabhayaṃ apanuditā, dhammikañca rakkhāvaraṇaguttiṃ saṃvidhātā, saparivārañca dānaṃ adāsi. So tassa kammassa kaṭattā upacitattā ussannattā vipulattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati. Heṭṭhāpādatalesu cakkāni jātāni honti sahassārāni sanemikāni sanābhikāni sabbākāraparipūrāni suvibhattantarāni. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Mahāparivāro hoti; mahāssa honti parivārā brāhmaṇagahapatikā negamajānapadā gaṇakamahāmattā anīkaṭṭhā dovārikā amaccā pārisajjā rājāno bhogiyā kumārā. Rājā samāno idaṃ labhati. Sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭṭacchado. Buddho samāno kiṃ labhati? Mahāparivāro hoti; mahāssa honti parivārā bhikkhū bhikkhuniyo upāsakā upāsikāyo devā manussā asurā nāgā gandhabbā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, having in a previous birth, a previous existence, a previous dwelling, having previously been a human being, was a bringer of happiness to many people, dispelled fear and dread and terror, established righteous protection, defense, and security, and gave gifts along with attendants. Due to the performance of that action, its accumulation, its abundance, its greatness, on the dissolution of the body, after death, he is reborn in a good destination, a heavenly world…pe… having passed away from there, having come to this state, he obtains this mark of a great man: on the soles of his feet wheels appear, with a thousand spokes, with rims, with hubs, complete in every way, well-defined in their divisions. Being endowed with that mark, if he lives the household life, he becomes a wheel-turning monarch…pe… being a monarch, what does he obtain? He has a great retinue; he has a great retinue of Brahmins, householders, townsfolk, countryfolk, accountants, high officials, army officers, gatekeepers, ministers, courtiers, kings, princes. Being a monarch, he obtains this. But if he goes forth from the household life into homelessness, he becomes an Arahant, a Fully Enlightened Buddha in the world, with the veil removed. Being a Buddha, what does he obtain? He has a great retinue; he has a great retinue of monks, nuns, male lay followers, female lay followers, gods, humans, asuras, nāgas, gandhabbas. Being a Buddha, he obtains this.\" The Blessed One said this matter.",
      "sinhala": "‘‘මහණෙනි, යම් ඒ තථාගතයන් වහන්සේ පෙර ආත්මයේ, පෙර භවයේ, පෙර වාසස්ථානයේ, පළමුව මනුෂ්‍යයෙක්ව සිටියදී බොහෝ ජනයාට සැප ගෙන දෙන්නෙක් වූ සේක් ද, උද්වේගය, තැතිගැනීම, භය දුරු කරන්නෙක් වූ සේක් ද, ධර්මානුකූල ආරක්ෂාවරණ හා ආරක්ෂාව සලසන්නෙක් වූ සේක් ද, පිරිවර සහිතව දානය දුන්නෙක් වූ සේක් ද, ඒ කර්මය කිරීමෙන්, රැස් කිරීමෙන්, උසස් කිරීමෙන්, විශාල කිරීමෙන් කය බිඳී මරණින් මතු සුගතියෙහි ස්වර්ග ලෝකයෙහි උපදී...ඒ චුතව මෙලොවට පැමිණ මහපුරිස ලක්ෂණයක් ලබයි. යටිපතුල්වල දහසක් කථා ඇති රෝද සලකුණු උපදී. එහි වළලු ඇත. අක්ෂය ඇත. සියලු ආකාරයෙන් සම්පූර්ණව හොඳින් වෙන් වූ අන්තරයන්ගෙන් යුක්ත වෙයි. ඒ ලක්ෂණයෙන් යුක්ත වූයේ ගිහිගෙයි වාසය කරන්නේ නම් සක්විති රජෙක් වෙයි...රජ වූයේ කුමක් ලබයිද? මහත් පිරිවරක් ඇත්තේ වෙයි. බ්‍රාහ්මණ ගෘහපතියෝ ද නෛගම ජනපදවාසීහු ද ගණක මහ ඇමතියෝ ද සේනාධිපතියෝ ද ද්වාරපාලකයෝ ද ඇමතියෝ ද පිරිස් ඇත්තෝ ද රජවරු ද භෝගී කුමාරවරු ද ඔහුට මහත් පිරිවර වෙති. රජ වූයේ මෙය ලබයි. යම්සේ ගිහිගෙන් අනගාරික ජීවිතයට පැවිදි වන්නේ නම් ලෝකයෙහි වැසීමක් නැති අරහත් වූ සම්‍යක් සම්බුද්ධ වෙයි. බුදු වූයේ කුමක් ලබයිද? මහත් පිරිවරක් ඇත්තේ වෙයි. භික්ෂූන් භික්ෂුණීන් උපාසක උපාසිකාවන් දෙවියන් මිනිසුන් අසුරයන් නාගයන් ගාන්ධර්වයන් ඔහුට මහත් පිරිවර වෙති. බුදු වූයේ මෙය ලබයි\". භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(2) Pādatalacakkalakkhaṇaṃ",
      "englishTitle": "The Foot-Sole Wheel Mark",
      "sinhalaTitle": "පාදතල චක්‍ර ලක්ෂණය"
    },
    {
      "number": 205,
      "pali": "Tatthetaṃ vuccati – ‘‘Pure puratthā purimāsu jātisu, Manussabhūto bahunaṃ sukhāvaho; Ubbhegauttāsabhayāpanūdano, Guttīsu rakkhāvaraṇesu ussuko. ‘‘So tena kammena divaṃ samakkami, Sukhañca khiḍḍāratiyo ca anvabhi; Tato cavitvā punarāgato idha, Cakkāni pādesu duvesu vindati. ‘‘Samantanemīni sahassarāni ca, Byākaṃsu veyyañjanikā samāgatā; Disvā kumāraṃ satapuññalakkhaṇaṃ, Parivāravā hessati sattumaddano. Tathā hī cakkāni samantanemini, Sace na pabbajjamupeti tādiso; Vatteti cakkaṃ pathaviṃ pasāsati, Tassānuyantādha [tassānuyuttā idha (sī. pī.), tassānuyantā idha (syā. ka.)] bhavanti khattiyā. ‘‘Mahāyasaṃ saṃparivārayanti naṃ, Sace ca pabbajjamupeti tādiso; Nekkhammachandābhirato vicakkhaṇo, Devāmanussāsurasakkarakkhasā [sattarakkhasā (ka.) sī. syāaṭṭhakathā oloketabbā]. ‘‘Gandhabbanāgā vihagā catuppadā, Anuttaraṃ devamanussapūjitaṃ; Mahāyasaṃ saṃparivārayanti na’’nti. ",
      "english": "Therefore, it is said: \"Formerly, in previous births, being a human, he brought much happiness; dispelling fear and trembling and terror, he was zealous in guarding, protecting, and defending.\n\n\"So by that action, he ascended to heaven and experienced happiness, joy, and delight; having passed away from there, he came back here again, and finds wheels on both feet.\n\n\"With rims all around, and with a thousand spokes, the interpreters, assembled together, declared; having seen the prince with a hundred marks of merit, ‘He will have a retinue and be a subduer of enemies.’\n\n\"For thus indeed are the wheels with rims all around, if such a one does not go forth into homelessness; he will turn the wheel, rule the earth, and the nobles will follow him here.\n\n\"They will surround him, the one of great glory, and if such a one goes forth into homelessness; delighting in the desire for renunciation, discerning, gods, humans, asuras, and demons,\n\n\"Gandharvas, nagas, birds, quadrupeds, will surround him, the one of unsurpassed glory, honored by gods and humans.\"",
      "sinhala": "‘‘එහි මෙය කියනු ලැබේ – “පෙර පෙර ජාතීන්හි, මිනිසත් බව ලැබූ බොහෝ දෙනාට සැප ගෙන දෙන්නෙක් වූයේ ය; තැතිගැනීම්, උත්‍රාසයන්, භය දුරු කරන්නෙක් වූයේ ය; ආරක්ෂාවන්හි, රැකවරණයන්හි උත්සුක වූයේ ය.\n\n‘‘ඔහු ඒ කර්මය හේතුවෙන් දිව්‍ය ලෝකයට පැමිණියේ ය, සැපය ද සෙල්ලම් සන්තෝෂය ද අනුභව කළේ ය; එතැනින් චුත ව නැවත මෙහි පැමිණ, දෙපා දෙකෙහි සක්ක ලකුණු ලබයි.\n\n‘‘වටකුරු දාර ඇති දහසක් කිරණ ඇති සක්ක ලකුණු, එක්වූ ලකුණු කියන්නෝ විස්තර කළහ; කුමාරයා සත්පුරුෂ ලකුණින් යුක්තව දැක, සතුරු මර්දනය කරන්නා වූ මොහු පිරිවර සහිත වන්නේ ය. එසේ ම වටකුරු දාර ඇති ඒ සක්ක ලකුණු යම්සේ ද, එබඳු වූ ඔහු පැවිදි බවට නොපැමිණෙන්නේ නම්; පොළොව පාලනය කරමින් සක්විති රජකම කරවයි, ඔහු අනුව යන්නෝ ක්ෂත්‍රියයෝ වෙති.\n\n‘‘මහා යසස් ඇත්තා වූ ඔහු වට කර ගනිති, එබඳු වූ ඔහු පැවිදි බවට පැමිණෙන්නේ නම්; නෛෂ්ක්‍රම්‍යයෙහි ඇලුම් කළ විචක්ෂණ වූ ඔහු, දෙවියෝ ද මිනිස්සු ද අසුරයෝ ද සක්කරයෝ ද රක්ඛස්සයෝ ද වට කර ගනිත්.\n\n‘‘ගාන්ධර්වයෝ ද නාගයෝ ද පක්ෂීහු ද සිව්පාවෝ ද, දෙවි මිනිසුන් විසින් පුදන ලද අනුත්තර වූ ඔහු; මහා යසස් ඇත්තා වූ ඔහු වට කර ගනිත්’’’.",
      "paliTitle": ""
    },
    {
      "number": 206,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno pāṇātipātaṃ pahāya pāṇātipātā paṭivirato ahosi nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī vihāsi. So tassa kammassa kaṭattā upacitattā ussannattā vipulattā…pe… so tato cuto itthattaṃ āgato samāno imāni tīṇi mahāpurisalakkhaṇāni paṭilabhati. Āyatapaṇhi ca hoti, dīghaṅguli ca brahmujugatto ca. ‘‘So tehi lakkhaṇehi samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Dīghāyuko hoti ciraṭṭhitiko, dīghamāyuṃ pāleti, na sakkā hoti antarā jīvitā voropetuṃ kenaci manussabhūtena paccatthikena paccāmittena. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Dīghāyuko hoti ciraṭṭhitiko, dīghamāyuṃ pāleti, na sakkā hoti antarā jīvitā voropetuṃ paccatthikehi paccāmittehi samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former dwelling, having previously been a human being, having abandoned the taking of life, abstained from taking life. He had laid aside the stick and the weapon, was conscientious, merciful, and compassionate, living with kindness towards all living beings. Because of the performance, accumulation, abundance, and fullness of that action... when he passed away from there and came to this state, he obtains these three marks of a great man: He has long heels, long fingers, and a straight body like Brahmā. Endowed with these marks, if he lives the household life, he becomes a wheel-turning monarch... Being a king, what does he gain? He is long-lived and endures long, maintains a long life; it is not possible for any hostile or inimical human being to deprive him of life before its end. Being a king, he gains this... Being a Buddha, what does he gain? He is long-lived and endures long, maintains a long life; it is not possible for any hostile or inimical person, any ascetic or brahmin, any god, Māra, Brahmā, or anyone in the world to deprive him of life before its end. Being a Buddha, he gains this.\" This is what the Blessed One said.",
      "sinhala": "‘‘මහණෙනි, තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර නිකේතනයෙහි, පළමුව මනුෂ්‍ය භූතව සිටියදී ප්‍රාණඝාතය දුරු කොට ප්‍රාණඝාතයෙන් වැළැක්කාහු දඬු මුගුරු පහ කොට ලජ්ජා ඇත්තාහු දයා ඇත්තාහු සියලු ප්‍රාණභූතයන්ගේ හිතානුකම්පී ව වාසය කළහ. හේ ඒ කර්මය කිරීමෙන්, රැස් කිරීමෙන්, උස් කිරීමෙන්, විශාල කිරීමෙන් ...පෙ... හෙ තෙමේ එතැනින් චුත ව මෙලොවට පැමිණියේ මහා පුරිස ලක්ෂණ තුනක් ලබයි. එනම්, දික් වූ විලුඹ ඇත්තේ ද, දිගු ඇඟිලි ඇත්තේ ද, ඍජු වූ බ්‍රහ්ම කාය ඇත්තේ ද වෙයි.\n\n‘‘හෙතෙමේ ඒ ලක්ෂණවලින් සමන්විත වූයේ ගිහිගෙයි වාසය කරන්නේ නම් සක්විති රජෙක් වෙයි ...පෙ... රජ වූයේ කවරක් ලබන්නේ ද? ආයු වැඩි ඇත්තේ බොහෝ කලක් ජීවත් වන්නේ දීර්ඝායුෂ පවත්වන්නේ ය. කිසි මනුෂ්‍ය භූතයෙකුට හෝ විරුද්ධවාදියෙකුට හෝ සතුරෙකුට හෝ අතරතුර දී ජීවිතයෙන් පහ කිරීමට නොහැකි වේ. රජ වූයේ මෙය ලබයි ... බුදු වූයේ කවරක් ලබන්නේ ද? ආයු වැඩි ඇත්තේ බොහෝ කලක් ජීවත් වන්නේ දීර්ඝායුෂ පවත්වන්නේ ය. විරුද්ධවාදීන්ට හෝ සතුරන්ට හෝ ශ්‍රමණයාට හෝ බ්‍රාහ්මණයට හෝ දේවතාවාට හෝ මාරයාට හෝ බ්‍රහ්මයාට හෝ ලෝකයෙහි කිසිවෙකුට හෝ අතරතුර දී ජීවිතයෙන් පහ කිරීමට නොහැකි වේ. බුදු වූයේ මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(3-5) Āyatapaṇhitāditilakkhaṇaṃ",
      "englishTitle": "The Three Characteristics Beginning with Well-Directedness",
      "sinhalaTitle": "ආයතපණිහිත ආදී වූ ත්‍රිලක්ෂණ"
    },
    {
      "number": 207,
      "pali": "Tatthetaṃ vuccati – ‘‘Māraṇavadhabhayattano [maraṇavadhabhayattano (sī. pī. ka.), maraṇavadhabhayamattano (syā.)] viditvā, Paṭivirato paraṃ māraṇāyahosi; Tena sucaritena saggamagamā [tena so sucaritena saggamagamāsi (syā.)], Sukataphalavipākamanubhosi. ‘‘Caviya punaridhāgato samāno, Paṭilabhati idha tīṇi lakkhaṇāni; Bhavati vipuladīghapāsaṇhiko, Brahmāva suju subho sujātagatto. ‘‘Subhujo susu susaṇṭhito sujāto, Mudutalunaṅguliyassa honti; Dīghā tībhi purisavaraggalakkhaṇehi, Cirayapanāya [cirayāpanāya (syā.)] kumāramādisanti. ‘‘Bhavati yadi gihī ciraṃ yapeti, Cirataraṃ pabbajati yadi tato hi; Yāpayati ca vasiddhibhāvanāya, Iti dīghāyukatāya taṃ nimitta’’nti. ",
      "english": "Herein, it is said: \"Knowing the fear of death and violence to himself, he was restrained from killing others. By that good conduct, he went to heaven, experiencing the ripening of wholesome deeds.\"\n\n\"Having passed away and being reborn here again, he obtains here three characteristics: He becomes one with a large, long, smooth body, like Brahmā, very upright, beautiful, and well-formed in body.\"\n\n\"He has beautiful arms, is very handsome, is well-formed, and well-born, with soft and tender fingers. He is long-lived, with the best qualities of a man in three ways; they indicate a long life for the child.\"\n\n\"If he remains a householder, he lives long; but if he goes forth from home, it is even longer. He lives for the sake of accomplishment and development. Thus, that is the indication for long life.\"",
      "sinhala": "තත්ථෙතං වුච්චති – ‘‘මාරණවධභයත්තනො විදිත්වා, පටිවිරතො පරං මාරණාය හොසි; තෙන සුචරිතෙන සග්ගමගමා, සුකතඵලවිපාකමනුභොසි. ‘‘චවි‌ත්‍වා පුනරිධාගතො සමානො, පටිලභති ඉධ තීණි ලක්ඛණානි; භවති විපුලදීඝපාසණ්හිකො, බ්‍රහ්மாவ සුජු සුභො සුජාතගත්තො. ‘‘සුභුජො සුසු සුසණ්ඨිතො සුජාතො, මුදුතලුනඞ්ගුලියස්ස හොන්ති; දීඝා තීභි පුරිසවරග්ගලක්ඛණෙහි, චිරයාපනාය කුමාරමාදිසන්ති. ‘‘භවති යදි ගිහී චිරං යපෙති, චිරතරං පබ්බජති යදි තතො හි; යාපයති ච වසිද්ධිභාවනාය, ඉති දීඝායුකතාය තං නිමිත්ත’’න්ති.",
      "paliTitle": ""
    },
    {
      "number": 208,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno dātā ahosi paṇītānaṃ rasitānaṃ khādanīyānaṃ bhojanīyānaṃ sāyanīyānaṃ lehanīyānaṃ pānānaṃ. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati, sattussado hoti, sattassa ussadā honti; ubhosu hatthesu ussadā honti, ubhosu pādesu ussadā honti, ubhosu aṃsakūṭesu ussadā honti, khandhe ussado hoti. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Lābhī hoti paṇītānaṃ rasitānaṃ khādanīyānaṃ bhojanīyānaṃ sāyanīyānaṃ lehanīyānaṃ pānānaṃ. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Lābhī hoti paṇītānaṃ rasitānaṃ khādanīyānaṃ bhojanīyānaṃ sāyanīyānaṃ lehanīyānaṃ pānānaṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former dwelling, having previously been a human being, was a giver of exquisite tastes, edibles, foods, savories, lickables, and drinks. Due to the performance of that action... he, passing away from there, coming to this state, obtains this mark of a great man: he is one of seven ascetics, he has seven ascetics; he has ascetics on both hands, he has ascetics on both feet, he has ascetics on both shoulder blades, he has an ascetic on his neck. Endowed with that mark, if he lives at home, he becomes a wheel-turning monarch... what does he gain as a monarch? He gains exquisite tastes, edibles, foods, savories, lickables, and drinks. As a monarch, he gains this... what does a Buddha gain? He gains exquisite tastes, edibles, foods, savories, lickables, and drinks. As a Buddha, he gains this.\" The Blessed One spoke this matter.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයේ, පෙර භවයේ, පෙර නිකේතනයේ, පළමුව මනුෂ්‍යයෙක්ව සිටියදී උතුම් වූ රසවත් වූ කෑම වර්ග, භෝජන වර්ග, සයන වර්ග, ලෙහෙය වර්ග, පාන වර්ග දන් දුන්නේ ද, ඒ කර්මය කිරීමේ හේතුවෙන්...ඒ... හෙතෙම එතැනින් චුතව මෙලොවට පැමිණි කල්හි මේ මහා පුරිස ලක්ෂණය ලබන්නේ ය. එනම් සත් උස්සද ඇත්තේ වෙයි. සත් ආකාර උස්සද ඇත්තේ වෙයි. අත් දෙකෙහි උස්සද ඇත්තේ වෙයි. පාද දෙකෙහි උස්සද ඇත්තේ වෙයි. අංශ කූට දෙකෙහි උස්සද ඇත්තේ වෙයි. ස්කන්ධයෙහි උස්සද ඇත්තේ වෙයි. ඒ ලක්ෂණයෙන් සමන්විත වූ හෙතෙම ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වන්නේ ය...ඒ... රජ වූ කල්හි කුමක් ලබන්නේ ද? උතුම් වූ රසවත් වූ කෑම වර්ග, භෝජන වර්ග, සයන වර්ග, ලෙහෙය වර්ග, පාන වර්ග ලබන්නේ ය. රජ වූ කල්හි මෙය ලබන්නේ ය. බුදු වූ කල්හි කුමක් ලබන්නේ ද? උතුම් වූ රසවත් වූ කෑම වර්ග, භෝජන වර්ග, සයන වර්ග, ලෙහෙය වර්ග, පාන වර්ග ලබන්නේ ය. බුදු වූ කල්හි මෙය ලබන්නේ ය.’’ භාග්‍යවතුන් වහන්සේ මෙම අර්ථය වදාළ සේක.",
      "paliTitle": "(6) Sattussadatālakkhaṇaṃ",
      "englishTitle": "Characteristic of the Seven Prominences",
      "sinhalaTitle": "සප්ත උසස් ලක්ෂණය"
    },
    {
      "number": 209,
      "pali": "Tatthetaṃ vuccati – ‘‘Khajjabhojjamatha leyya sāyiyaṃ, Uttamaggarasadāyako ahu; Tena so sucaritena kammunā, Nandane ciramabhippamodati. ‘‘Satta cussade idhādhigacchati, Hatthapādamudutañca vindati; Āhu byañjananimittakovidā, Khajjabhojjarasalābhitāya naṃ. ‘‘Yaṃ gihissapi [na taṃ gihissāpi (syā.)] tadatthajotakaṃ, Pabbajjampi ca tadādhigacchati; Khajjabhojjarasalābhiruttamaṃ, Āhu sabbagihibandhanacchida’’nti. ",
      "english": "Therefore, this is said: \"Chewable food, edible food, lickable food, and drinkable food, he was a giver of the best and choicest flavors; by that well-done deed, he delights for a long time in Nandana.\n\n\"Seven kinds of excellence he obtains here, and he finds hands and feet that are soft; those skilled in interpreting signs declare, it is due to his obtaining the flavor of chewable food and edible food.\n\n\"That which is illuminating for even a householder, which even a householder does not have, and he attains even the going forth; having obtained the best flavor of chewable food and edible food, they say, he is a cutter of all the bonds of householders.\"",
      "sinhala": "තත්ථேதං වුච්චති – ‘‘ඛජ්ජභෝජ්ජමථ ලෙය්‍ය සායියං, උත්තමග්ගරසදායකෝ අහු; තේන සෝ සුචරිතේන කම්මුනා, නන්දනේ චිරමභිප්පමෝදති. ‘‘සත්ත චුස්සදේ ඉධාධිගච්ඡති, හත්ථපාදමුදුතඤ්ච වින්දති; ආහු බ්‍යඤ්ජනනිමිත්තකෝවිදා, ඛජ්ජභෝජ්ජරසලාභිතාය නං. ‘‘යං ගිහිස්සපි [න තං ගිහිස්සාපි (ස්‍යා.)] තදත්ථජෝතකං, පබ්බජ්ජම්පි ච තදාධිගච්ඡති; ඛජ්ජභෝජ්ජරසලාභිරුත්තමං, ආහු සබ්බගිහිබන්ධනච්ඡිදන්’’ති.\n \nඑහිලා මෙසේ කියනු ලැබේ – යමෙක්‌ දන් දෙන දෑ අතර ආහාර, කැවිලි, ලෙවකා බොන දෑ, සපයා බොන දෑ යන උතුම් වූ අග්‍ර රසයන් දෙන්නේ වේ ද, හෙතෙම ඒ යහපත් කර්මය හේතුවෙන් නන්දන උයනේ බොහෝ කාලයක්‌ ප්‍රීතියෙන් වාසය කරයි. හෙතෙම මෙහි දී උසස්‌ වූ සත් ආකාර ශබ්දයන් ලබන්නේ ය. මෘදු වූ අත් පා ද ලබන්නේ ය. ආහාර පාන රස ලැබීම හේතුවෙන් ඔහුට එම ඵල ලැබෙන බව ව්‍යඤ්ජන නිමිති දන්නා නුවණැත්තෝ පවසති. එය ගිහියාට වුව ද දුර්ලභ ය. එම අර්ථය ප්‍රකාශ කරන්නකි. පැවිද්ද ද එකල්හි ම ඔහු ලබයි. ආහාර පාන රස ලැබීම අතුරින් උතුම් වූ එය සියලු ගිහි බැඳුම් සිඳින්නක්‌ බව කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 210,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno catūhi saṅgahavatthūhi janaṃ saṅgāhako ahosi – dānena peyyavajjena [piyavācena (syā. ka.)] atthacariyāya samānattatāya. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imāni dve mahāpurisalakkhaṇāni paṭilabhati. Mudutalunahatthapādo ca hoti jālahatthapādo ca. ‘‘So tehi lakkhaṇehi samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Susaṅgahitaparijano hoti, susaṅgahitāssa honti brāhmaṇagahapatikā negamajānapadā gaṇakamahāmattā anīkaṭṭhā dovārikā amaccā pārisajjā rājāno bhogiyā kumārā. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Susaṅgahitaparijano hoti, susaṅgahitāssa honti bhikkhū bhikkhuniyo upāsakā upāsikāyo devā manussā asurā nāgā gandhabbā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a previous birth, a previous existence, a previous dwelling, having previously been a human being, was one who bound people together with the four bases of sympathy: by giving, by kindly speech, by beneficial conduct, and by impartiality. Through having performed that deed...he...having passed away from there and come to this state, obtains these two marks of a great man. He has hands and feet that are soft and tender, and he has hands and feet with a web-like pattern. Endowed with these characteristics, if he lives the household life, he becomes a wheel-turning monarch...being a king, what does he obtain? He has a well-integrated retinue. He has well-integrated Brahmins and householders, town and country dwellers, accountants, great ministers, army officers, gatekeepers, advisors, courtiers, tributary kings, and princes. Being a king, this he obtains...being a Buddha, what does he obtain? He has a well-integrated retinue. He has well-integrated monks, nuns, male lay followers, female lay followers, gods, humans, asuras, nāgas, and gandhabbas. Being a Buddha, this he obtains.\" This is what the Blessed One said.",
      "sinhala": "‘‘මහණෙනි, තථාගතයන් වහන්සේ පෙර ආත්මයේ, පෙර භවයේ, පෙර වාසස්ථානයේ, පළමුව මනුෂ්‍ය භවයෙහි සිටියදී දානයෙන්, ප්‍රිය වචනයෙන්, අර්ථචර්යාවෙන්, සමානාත්මතාවයෙන් යන සතර සංග්‍රහ වස්තූන්ගෙන් ජනයා සංග්‍රහ කළේ ද, ඒ කර්මය කිරීම හේතුකොට ගෙන ...පෙ... උන්වහන්සේ එතැනින් චුතව මෙලොවට පැමිණ මෙම මහා පුරුෂ ලක්ෂණ දෙක ලබයි. මෘදු තරුණ අත් පා ඇති තැනැත්තෙක් ද වෙයි. දැල් බැඳි අත් පා ඇති තැනැත්තෙක් ද වෙයි. උන්වහන්සේ ඒ ලක්ෂණ වලින් යුක්තව ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වෙයි...පෙ... රජ වූයේ නම් කිම ලබා ගන්නේද? මැනවින් සංග්‍රහ කරන ලද පිරිවර ඇත්තේ වෙයි. බ්‍රාහ්මණ ගෘහපතියෝ ද නෛගම ජානපදයෝ ද ගණක මහාමාත්‍යයෝ ද සේනා සංවිධායකයෝ ද ද්වාරිකයෝ ද අමාත්‍යයෝ ද පාරිසද්‍යයෝ ද භෝගික රජවරු ද කුමාරවරු ද යන මොහු මැනවින් සංග්‍රහ කරන ලද්දෝ වෙති. රජ වූයේ නම් මෙය ලබයි... බුදු වූයේ නම් කිම ලබා ගන්නේද? මැනවින් සංග්‍රහ කරන ලද පිරිවර ඇත්තේ වෙයි. භික්ෂූන් භික්ෂුණීන් උපාසක උපාසිකාවන් දෙවියන් මනුෂ්‍යයන් අසුරයන් නාගයන් ගන්ධර්වයන් යන මොහු මැනවින් සංග්‍රහ කරන ලද්දෝ වෙති. බුදු වූයේ නම් මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මෙම අර්ථය වදාළ සේක.",
      "paliTitle": "(7-8) Karacaraṇamudujālatālakkhaṇāni",
      "englishTitle": "Marks of Soft, Webbed Hands and Feet",
      "sinhalaTitle": "මෘදු ජාල හස්තපාද ලක්ෂණ"
    },
    {
      "number": 211,
      "pali": "Tatthetaṃ vuccati – ‘‘Dānampi catthacariyatañca [dānampi ca atthacariyatampi ca (sī. pī.)], Piyavāditañca samānattatañca [piyavadatañca samānachandatañca (sī. pī.)]; Kariyacariyasusaṅgahaṃ bahūnaṃ, Anavamatena guṇena yāti saggaṃ. ‘‘Caviya punaridhāgato samāno, Karacaraṇamudutañca jālino ca; Atirucirasuvaggudassaneyyaṃ, Paṭilabhati daharo susu kumāro. ‘‘Bhavati parijanassavo vidheyyo, Mahimaṃ āvasito susaṅgahito; Piyavadū hitasukhataṃ jigīsamāno [jigiṃ samāno (sī. syā. pī.)], Abhirucitāni guṇāni ācarati. ‘‘Yadi ca jahati sabbakāmabhogaṃ, Kathayati dhammakathaṃ jino janassa; Vacanapaṭikarassābhippasannā, Sutvāna dhammānudhammamācarantī’’ti. ",
      "english": "Here it is said: \"Generosity, beneficial conduct, kind speech, and impartiality, these four ways of doing service lead to heaven, being of great benefit, when not despised.\"\n\nHaving passed away and been reborn here again, one obtains, as a tender young boy, hands and feet that are soft and webbed, and is exceedingly beautiful, fair-skinned, and pleasing to behold.\n\nHe becomes obedient and compliant to his retinue, full of greatness, well-regarded, desiring pleasing speech, welfare, and happiness, and practices delightful virtues.\n\nAnd if the Conqueror renounces all sensual pleasures and speaks the Dhamma to the people, those who are pleased with his instruction, having heard, practice the Dhamma in accordance with the Dhamma.",
      "sinhala": "තත්‍ථෙතං වුච්චති – ‘‘දානම්පි ච අත්ථචරියතා ච, පියවාදිතඤ්ච සමානත්තතා ච; කරියචරියසුසඞ්ගහං බහූනං, අනවමතෙන ගුණෙන යාති සග්ගං. ‘‘චවිය පුනරිධාගතෝ සමානෝ, කරචරණමුදුතඤ්ච ජාලිනෝ ච; අතිරුචිරසුවග්ගුදස්සනෙය්‍යං, පටිලභති දහරෝ සුසු කුමාරෝ. ‘‘භවති පරිජනස්සවෝ විධෙය්‍යෝ, මහිමං ආවසිතෝ සුසඞ්ගහිතෝ; පියවදූ හිතසුඛතං ජිගීසමානෝ, අභිරුචිතානි ගුණානි ආචරති. ‘‘යදි ච ජහති සබ්බකාමභෝගං, කථයති ධම්මක්ථං ජිනෝ ජනස්ස; වචනපටිකරස්සාභිප්පසන්නා, සුත්වාන ධම්මානුධම්මමාචරන්තී’’ති.",
      "paliTitle": ""
    },
    {
      "number": 212,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno [samāno bahuno janassa (sī. pī.)] atthūpasaṃhitaṃ dhammūpasaṃhitaṃ vācaṃ bhāsitā ahosi, bahujanaṃ nidaṃsesi, pāṇīnaṃ hitasukhāvaho dhammayāgī. So tassa kammassa kaṭattā… pe… so tato cuto itthattaṃ āgato samāno imāni dve mahāpurisalakkhaṇāni paṭilabhati. Ussaṅkhapādo ca hoti, uddhaggalomo ca. ‘‘So tehi lakkhaṇehi samannāgato, sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Aggo ca hoti seṭṭho ca pāmokkho ca uttamo ca pavaro ca kāmabhogīnaṃ. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Aggo ca hoti seṭṭho ca pāmokkho ca uttamo ca pavaro ca sabbasattānaṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, because the Tathāgata, in a past birth, a past existence, a past dwelling, formerly being a human being, spoke speech connected with benefit, connected with the Dhamma, dissuaded many people, was a giver of the Dhamma sacrifice bringing benefit and happiness to beings, as a result of doing that action... he, having passed away from there, having come to this state, obtains these two marks of a great man. He has high-soled feet and upward-growing body hairs. \"Being endowed with those marks, if he lives the household life, he becomes a wheel-turning monarch... what does he gain as a king? He is the foremost, the best, the chief, the highest, the most excellent of those who enjoy sensual pleasures. This he gains as a king... what does he gain as a Buddha? He is the foremost, the best, the chief, the highest, the most excellent of all beings. This he gains as a Buddha.\" This was the meaning spoken by the Blessed One.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසස්ථානයෙහි, පළමුව මනුෂ්‍යයෙක්ව සිටියදී බොහෝ දෙනාට අර්ථ සහිත වූ ධර්මයට අනුකූල වූ වචන කථා කළසේක් ද, බොහෝ දෙනාට අවවාද අනුශාසනා කළසේක් ද, සතුන්ගේ හිතසුව පිණිස හේතු වූ ධර්ම යාගයෙහි නිරත වූසේක් ද, එම කර්මය කළ හෙයින් ...පෙ... උන්වහන්සේ එතැනින් චුතව මෙලොව ඉපදීම ලබන කල්හි මේ මහා පුරිස ලක්ෂණ දෙක ලබන සේක. එනම් උස්සංඛ පාද ඇති වන අතර, සිරුරෙහි රෝම උඩට වැඩෙයි.\n\n‘‘උන්වහන්සේ එම ලක්ෂණ වලින් යුක්ත වූයේ, ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වන්නේ ය...පෙ... රජ වූ කල්හි කුමක් ලබන්නේද? කාමභෝගීන්ට අග්‍ර වන්නේය, ශ්‍රේෂ්ඨ වන්නේය, ප්‍රධාන වන්නේය, උත්තම වන්නේය, විශිෂ්ට වන්නේය. රජ වූ කල්හි මෙය ලබන්නේය... බුදු වූ කල්හි කුමක් ලබන්නේද? සියලු සත්වයන්ට අග්‍ර වන්නේය, ශ්‍රේෂ්ඨ වන්නේය, ප්‍රධාන වන්නේය, උත්තම වන්නේය, විශිෂ්ට වන්නේය. බුදු වූ කල්හි මෙය ලබන්නේය’’. භාග්‍යවතුන් වහන්සේ මෙම අර්ථය වදාළ සේක.",
      "paliTitle": "(9-10) Ussaṅkhapādauddhaggalomatālakkhaṇāni",
      "englishTitle": "Characteristics of Raised Feet and Upward-Pointing Hair",
      "sinhalaTitle": "උස්‌සංඛපාද උද්ධග්ගලෝම ලක්ෂණ"
    },
    {
      "number": 213,
      "pali": "Tatthetaṃ vuccati – ‘‘Atthadhammasahitaṃ [atthadhammasaṃhitaṃ (ka. sī. pī.), atthadhammupasaṃhitaṃ (ka.)] pure giraṃ, Erayaṃ bahujanaṃ nidaṃsayi; Pāṇinaṃ hitasukhāvaho ahu, Dhammayāgamayajī [dhammayāgaṃ assaji (ka.)] amaccharī. ‘‘Tena so sucaritena kammunā, Suggatiṃ vajati tattha modati; Lakkhaṇāni ca duve idhāgato, Uttamappamukhatāya [uttamasukhatāya (syā.), uttamapamukkhatāya (ka.)] vindati. ‘‘Ubbhamuppatitalomavā saso, Pādagaṇṭhirahu sādhusaṇṭhitā; Maṃsalohitācitā tacotthatā, Uparicaraṇasobhanā [uparijānusobhanā (syā.), upari ca pana sobhanā (sī. pī.)] ahu. ‘‘Gehamāvasati ce tathāvidho, Aggataṃ vajati kāmabhoginaṃ; Tena uttaritaro na vijjati, Jambudīpamabhibhuyya iriyati. ‘‘Pabbajampi ca anomanikkamo, Aggataṃ vajati sabbapāṇinaṃ; Tena uttaritaro na vijjati, Sabbalokamabhibhuyya viharatī’’ti. ",
      "english": "Therefore, it is said: “He first uttered speech endowed with meaning and the Dhamma, stirring up many people and dispelling their doubts. He was the bringer of benefit and happiness to beings, a non-miserly performer of the sacrifice of Dhamma. By that well-performed action, he goes to a good destination and rejoices there. And having come here, he obtains two marks, pre-eminence and utmost happiness. Hairs grow upwards, he is a hare; his ankles are well formed; his skin is covered with flesh and blood; and he has beautiful feet, walking above others. If such a one dwells at home, he attains the foremost place among those who enjoy sense pleasures. There is none higher than him, and he rules over Jambudīpa. And if he goes forth, a peerless renunciant, he attains the foremost place among all beings. There is none higher than him, and he dwells having overcome the entire world.”",
      "sinhala": "එහිලා මෙය කියනු ලැබේ: “යම් කෙනෙක් අර්ථ සහිත ධර්මයෙන් යුක්ත වූ ප්‍රථම වචනය පවසත් ද, බොහෝ දෙනා ප්‍රකාශ කරමින් සැක දුරු කෙරෙත් ද, සතුන්ගේ හිතසුව පිණිස හේතු වූයේ ද, මසුරු නැතිව ධර්මය නමැති යාගය පුදන්නේ ද,\n\nඒ සුචරිත කර්මය හේතු කොටගෙන ඔහු සුගතියට පැමිණ එහි සතුටු වෙයි. මෙලොවට පැමිණීමෙන් උත්තම ප්‍රමුඛත්වය නිසා ලක්ෂණ දෙකක් ලබයි.\n\nඉහළට නැඟී සිටි රෝම ඇත්තේ ද, හොඳින් පිහිටි පාදවල ගැට ඇත්තේ ද, මස් හා ලේවලින් පිරුණු සමින් යුක්ත වූයේ ද, කලවා ප්‍රදේශය මනාව බබළන්නේ ද වෙයි.\n\nඑබඳු ගුණ ඇති ඔහු ගෘහයක වාසය කරන්නේ නම් කාමභෝගීන් අතර අග්‍රත්වයට පැමිණෙයි. ඔහුට වඩා උසස් කිසිවෙක් නැත. ජම්බුද්වීපය අභිබවා ඔහු හැසිරෙයි.\n\nපැවිද්දට පැමිණියහොත් අනුපමේය ගමනින් යුක්ත ඔහු සියලු සතුන් අතර අග්‍රත්වයට පැමිණෙයි. ඔහුට වඩා උසස් කිසිවෙක් නැත. මුළු ලෝකයම අභිබවා ඔහු වාසය කරයි.”",
      "paliTitle": ""
    },
    {
      "number": 214,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno sakkaccaṃ vācetā ahosi sippaṃ vā vijjaṃ vā caraṇaṃ vā kammaṃ vā – ‘kiṃ time khippaṃ vijāneyyuṃ, khippaṃ paṭipajjeyyuṃ, na ciraṃ kilisseyyu’’nti. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati. Eṇijaṅgho hoti. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Yāni tāni rājārahāni rājaṅgāni rājūpabhogāni rājānucchavikāni tāni khippaṃ paṭilabhati. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Yāni tāni samaṇārahāni samaṇaṅgāni samaṇūpabhogāni samaṇānucchavikāni, tāni khippaṃ paṭilabhati. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former abode, having previously been a human being, was a conscientious instigator, either in a craft or a science or conduct or work, thinking, 'How might these quickly understand, quickly practice, and not be defiled for long?' By the completion of that action…having passed away from there, on arriving here, he obtains this mark of a great man. He has antelope-like shanks. Possessed of that mark, if he lives the household life, he becomes a wheel-turning monarch…being a king, what does he gain? Those royal possessions, royal requisites, royal enjoyments, and royal privileges which are befitting a king, he obtains them quickly. Being a king, he gains this… being a Buddha, what does he gain? Those monastic possessions, monastic requisites, monastic enjoyments, and monastic privileges which are befitting a renunciate, he obtains them quickly. Being a Buddha, he gains this.\" The Blessed One spoke this matter.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයේ, පෙර භවයේ, පෙර වාසස්ථානයේ, පළමුව මනුෂ්‍යයෙක්ව සිටියදී, ‘මොවුන් ඉක්මනින් දැනගන්නා සැටියටත්, ඉක්මනින් පිළිපදින සැටියටත්, බොහෝ කල් ක්ලේශයන්ට නොවැටෙන සැටියටත්’ යන අදහසින් යුතුව ශිල්පයක් හෝ විද්‍යාවක් හෝ චරණයක් හෝ කර්මයක් හෝ උගන්වන්නෙක් වූයේද, එම කර්මය කිරීම හේතුවෙන්...පෙ.... හෙතෙම එතැනින් චුතව මෙලොවට පැමිණ මෙම මහා පුරිස ලක්ෂණය ලබයි. එනම් මුවෙකුගේ වැනි කෙණ්ඩා ඇති බව වෙයි. එම ලක්ෂණයෙන් යුක්ත වූ හෙතෙම ගිහිගෙයි වාසය කරන්නේ නම් සක්විති රජෙක් වන්නේය...පෙ... රජෙක්ව සිටීමෙන් කුමක් ලබන්නේද? රජෙකුට සුදුසු, රාජාංගයන්, රාජ්‍ය භෝගයන්, රාජ තත්වයට අනුරූප දෑ ක්ෂණිකව ලබයි. රජෙක්ව සිටීමෙන් මෙය ලබයි... බුදුව සිටීමෙන් කුමක් ලබන්නේද? ශ්‍රමණෙකුට සුදුසු, ශ්‍රමණාංගයන්, ශ්‍රමණ භෝගයන්, ශ්‍රමණ තත්වයට අනුරූප දෑ ක්ෂණිකව ලබයි. බුදුව සිටීමෙන් මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මෙම අර්ථය වදාළ සේක.",
      "paliTitle": "(11) Eṇijaṅghalakkhaṇaṃ",
      "englishTitle": "Characteristic of Antelope Legs",
      "sinhalaTitle": "ඒණිජංඝා ලක‍්ෂණය"
    },
    {
      "number": 215,
      "pali": "Tatthetaṃ vuccati – ‘‘Sippesu vijjācaraṇesu kammesu [kammasu (sī. pī.)], Kathaṃ vijāneyyuṃ [vijāneyya (sī. pī.), vijāneyyu (syā.)] lahunti icchati; Yadūpaghātāya na hoti kassaci, Vāceti khippaṃ na ciraṃ kilissati. ‘‘Taṃ kammaṃ katvā kusalaṃ sukhudrayaṃ [sukhindriyaṃ (ka.)], Jaṅghā manuññā labhate susaṇṭhitā; Vaṭṭā sujātā anupubbamuggatā, Uddhaggalomā sukhumattacotthatā. ‘‘Eṇeyyajaṅghoti tamāhu puggalaṃ, Sampattiyā khippamidhāhu [khippamidāhu (?)] lakkhaṇaṃ; Gehānulomāni yadābhikaṅkhati, Apabbajaṃ khippamidhādhigacchati [khippamidādhigacchati (?)]. ‘‘Sace ca pabbajjamupeti tādiso, Nekkhammachandābhirato vicakkhaṇo; Anucchavikassa yadānulomikaṃ, Taṃ vindati khippamanomavikkamo [nikkamo (sī. syā. pī.)]’’ti. ",
      "english": "Here, in that connection, it is said: \"In crafts, in knowledge and conduct, in actions, one desires to quickly understand how; if it is not for the harm of anyone, he quickly teaches it, he does not suffer for long. Having done that skillful action, resulting in happiness, he obtains calves that are delightful, well-formed, round, well-born, sequentially developed, with upward-growing hairs, and with smooth, refined skin. They call that person 'deer-calved,' here they quickly declare that characteristic because of prosperity; when he desires things agreeable to a householder’s life, he quickly obtains them here without forsaking the world. And if such a person goes forth, delighting in the desire for renunciation, discerning, when something suitable is agreeable to him, he quickly finds that incomparable strength.\"",
      "sinhala": "එහි මෙසේ කියනු ලැබේ – ‘‘ශිල්පයන්හි, විද්‍යාවෙහි හැසිරීමෙහි, කර්මයන්හි කෙසේ ඉක්මනින් දැනගන්නේ දැයි (යමෙක්) කැමති වේ ද, යම් (කර්මයක්) කිසිවෙකුට උපද්‍රවයක් නො වේ ද, (ඔහු) ඉක්මනින් උගනී, බොහෝ කාලයක් වෙහෙසෙන්නේ නැත. ‘‘ඒ කුසල කර්මය සැප විපාක ඇති ව කර, මනරම් වූ, මනා ව පිහිටි, වටකුරු වූ, මනාව උපන්, පිළිවෙළින් මතුවූ, උඩු අතට වැඩුණු ලොම් ඇති, සියුම් සමක් ඇති වළලුකර ලබයි. ‘‘මුවෙකුගේ වළලුකර ඇත්තෙක් යැයි ඔහු පුද්ගලයා හඳුන්වයි, සම්පත්තියෙන් ඉක්මනින් මෙහි ලක්ෂණය වන්නේ යම් ගෙයකට අනුලෝම වන්නේ ද, යම් විටෙක (ගිහිගෙයි වාසයට) අපේක්ෂා කරන්නේ ද, ඉක්මනින් මෙහි දී අත් නොහරී. ‘‘එබඳු වූ (පුද්ගලයෙක්) පැවිද්දට පැමිණෙන්නේ නම්, නෛෂ්ක්‍රම්‍යයෙහි ඇලුණු, විචක්ෂණ වූයේ නම්, තමාට ගැළපෙන දෙයට අනුලෝම වූයේ නම්, එය ඉක්මනින් සොයා ගනී, අනුන් ඉක්මවා යන වික්‍රමයෙන් යුක්ත වේ.’’",
      "paliTitle": ""
    },
    {
      "number": 216,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno samaṇaṃ vā brāhmaṇaṃ vā upasaṅkamitvā paripucchitā ahosi – ‘‘kiṃ, bhante, kusalaṃ, kiṃ akusalaṃ, kiṃ sāvajjaṃ, kiṃ anavajjaṃ, kiṃ sevitabbaṃ, kiṃ na sevitabbaṃ, kiṃ me karīyamānaṃ dīgharattaṃ ahitāya dukkhāya assa, kiṃ vā pana me karīyamānaṃ dīgharattaṃ hitāya sukhāya assā’’ti. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati. Sukhumacchavi hoti, sukhumattā chaviyā rajojallaṃ kāye na upalimpati. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Mahāpañño hoti, nāssa hoti koci paññāya sadiso vā seṭṭho vā kāmabhogīnaṃ. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Mahāpañño hoti puthupañño hāsapañño [hāsupañño (sī. pī.)] javanapañño tikkhapañño nibbedhikapañño, nāssa hoti koci paññāya sadiso vā seṭṭho vā sabbasattānaṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a previous birth, a previous existence, a previous dwelling place, having been formerly a human being, approached a recluse or a brahmin and asked: ‘Venerable sir, what is skillful? What is unskillful? What is blameworthy? What is blameless? What should be cultivated? What should not be cultivated? What, if I do, will lead to long-term harm and suffering? Or what, if I do, will lead to long-term benefit and happiness?’ Because of performing that action...having passed away from there, upon arriving here, he obtains this mark of a great man: he has delicate skin; because of the delicacy of his skin, dust and dirt do not cling to his body. Endowed with that mark, if he lives at home, he becomes a wheel-turning monarch…being a king, what does he obtain? He becomes greatly wise; no one among those enjoying sense pleasures is equal or superior to him in wisdom. Being a king, he obtains this… being a Buddha, what does he obtain? He is greatly wise, broadly wise, quick-witted, swift in wisdom, sharp in wisdom, penetrating in wisdom; no one among all beings is equal or superior to him in wisdom. Being a Buddha, he obtains this.\" This is what the Blessed One said.",
      "sinhala": "‘‘මහණෙනි, යම්සේ තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසස්ථානයෙහි, පළමුව මනුෂ්‍ය භූතව සිටිමින් ශ්‍රමණ­යෙකු හෝ බ්‍රාහ්මණයෙකු හෝ වෙත එළඹ, ‘ස්වාමීනි, කුමක් කුසලද, කුමක් අකුසලද, කුමක් සාවද්‍යද, කුමක් අනවද්‍යද, කුමක් සෙවිය යුතුද, කුමක් නොසෙවිය යුතුද, මා විසින් කරනු ලබන්නේ කුමක් දීර්ඝ කාලයක් මුළුල්ලෙහි අවැඩ පිණිස දුක් පිණිස වන්නේද, නැතහොත් මා විසින් කරනු ලබන්නේ කුමක් දීර්ඝ කාලයක් මුළුල්ලෙහි වැඩ පිණිස සැප පිණිස වන්නේදැ’යි විචාළේද, හෙතෙම ඒ කර්මය කිරීම හේතුකොටගෙන...හෙතෙම එතැනින් චුතව මෙලොවට පැමිණියේම මේ මහා පුරිස ලක්ෂණය ලබයි. සියුම් සම ඇත්තේ වෙයි, සියුම් වූ සම නිසා ශරීරයෙහි දූවිලි මඩ නොගෑවෙයි. හෙතෙම ඒ ලක්ෂණයෙන් යුක්ත වූයේ ගිහිගෙයි වෙසේ නම්, සක්විති රජෙක් වන්නේය... රජ වූයේ කුමක් ලබන්නේද? මහත් ප්‍රඥා ඇත්තේ වෙයි, කාමභෝගීන්ට ඔහුගේ ප්‍රඥාවට සමාන වූ හෝ උසස් වූ හෝ කිසිවෙක් නැත්තේ වෙයි. රජ වූයේ මෙය ලබයි... බුදු වූයේ කුමක් ලබන්නේද? මහත් ප්‍රඥා ඇත්තේ වෙයි, පුළුල් ප්‍රඥා ඇත්තේ වෙයි, හාස්‍ය ප්‍රඥා ඇත්තේ වෙයි, ඉක්මන් ප්‍රඥා ඇත්තේ වෙයි, තියුණු ප්‍රඥා ඇත්තේ වෙයි, විනිවිද යන ප්‍රඥා ඇත්තේ වෙයි, සියලු සත්වයන් අතර ඔහුගේ ප්‍රඥාවට සමාන වූ හෝ උසස් වූ හෝ කිසිවෙක් නැත්තේ වෙයි. බුදු වූයේ මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(12) Sukhumacchavilakkhaṇaṃ",
      "englishTitle": "Characteristic of Subtle Skin",
      "sinhalaTitle": "සූක්ෂ්මඡවි ලක්ෂණය"
    },
    {
      "number": 217,
      "pali": "Tatthetaṃ vuccati – ‘‘Pure puratthā purimāsu jātisu, Aññātukāmo paripucchitā ahu; Sussūsitā pabbajitaṃ upāsitā, Atthantaro atthakathaṃ nisāmayi. ‘‘Paññāpaṭilābhagatena [paññāpaṭilābhakatena (sī. pī.) ṭīkā oloketabbā] kammunā, Manussabhūto sukhumacchavī ahu; Byākaṃsu uppādanimittakovidā, Sukhumāni atthāni avecca dakkhiti. ‘‘Sace na pabbajjamupeti tādiso, Vatteti cakkaṃ pathaviṃ pasāsati; Atthānusiṭṭhīsu pariggahesu ca, Na tena seyyo sadiso ca vijjati. ‘‘Sace ca pabbajjamupeti tādiso, Nekkhammachandābhirato vicakkhaṇo; Paññāvisiṭṭhaṃ labhate anuttaraṃ, Pappoti bodhiṃ varabhūrimedhaso’’ti. ",
      "english": "Thus, it is said in that regard: \"Formerly, in previous births, desiring to know what was unknown, he inquired; he listened attentively, served the renunciate, and carefully considered the meaning and the exposition.\n\n\"Having attained the benefit of wisdom through that action, he became a human being with delicate skin; those skilled in interpreting omens declared, 'Having understood subtle meanings, he will be skilled.'\n\n\"If such a one does not go forth into homelessness, he will turn the wheel, rule the earth; there will not be anyone better or equal to him in the instruction of meaning and in the grasp of definitions.\n\n\"But if such a one goes forth into homelessness, delighting in renunciation, discerning, he obtains unsurpassed distinction in wisdom, the noble one of vast intelligence attains enlightenment.\"",
      "sinhala": "එහි මේ කාරණය මෙසේ කියනු ලැබේ: ‘‘පෙර පෙර ආත්ම භවයන්හි, නොදත් දේ දැනගැනීමට කැමැත්තෙන් විමසන ලදී; මැනවින් අසන ලදී, පැවිද්දන් ඇසුරු කරන ලදී, අර්ථයන්හි අර්ථ කථාවන් හොඳින් අසන ලදී. ‘‘ප්‍රඥා පටිලාභය ඇතිකරන කර්මයෙන්, මනුෂ්‍යයෙක්ව ඉපදී සියුම් සමක් ඇත්තේ විය; උපතේ සලකුණු දන්නා අය ව්‍යාකරණය කළහ. මොහු සියුම් අර්ථයන් දැන දැක්වීමට සමත් වන්නේ යයි කීහ. ‘‘එබඳු තැනැත්තෙක් පැවිදි නොවන්නේ නම්, චක්‍රවර්ති රාජ්‍යය පවත්වමින් පෘථිවිය පාලනය කරන්නේ ය; අර්ථයන්හි අනුශාසනා වලදීත්, පරිග්‍රහයන්හිදීත් ඔහුට වඩා ශ්‍රේෂ්ඨ වූවෙක් හෝ සමාන වූවෙක් හෝ නැත්තේ ය. ‘‘එබඳු තැනැත්තෙක් පැවිදි වන්නේ නම්, නෛෂ්ක්‍රම්‍යයට ඇලුම් කරන නුවණැත්තෙක් වන්නේ ය; ප්‍රඥාවෙන් විශිෂ්ට වූ අනුත්තර ඵලය ලබන්නේ ය; ශ්‍රේෂ්ඨ වූ භූරි ප්‍රඥාවෙන් යුක්තව බෝධියට පැමිණෙන්නේ ය.’’",
      "paliTitle": ""
    },
    {
      "number": 218,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno akkodhano ahosi anupāyāsabahulo, bahumpi vutto samāno nābhisajji na kuppi na byāpajji na patitthīyi, na kopañca dosañca appaccayañca pātvākāsi. Dātā ca ahosi sukhumānaṃ mudukānaṃ attharaṇānaṃ pāvuraṇānaṃ [pāpuraṇānaṃ (sī. syā. pī.)] khomasukhumānaṃ kappāsikasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ. So tassa kammassa kaṭattā upacitattā…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati. Suvaṇṇavaṇṇo hoti kañcanasannibhattaco. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Lābhī hoti sukhumānaṃ mudukānaṃ attharaṇānaṃ pāvuraṇānaṃ khomasukhumānaṃ kappāsikasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Lābhī hoti sukhumānaṃ mudukānaṃ attharaṇānaṃ pāvuraṇānaṃ khomasukhumānaṃ kappāsikasukhumānaṃ koseyyasukhumānaṃ kambalasukhumānaṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata in a former birth, a former existence, a former dwelling, having previously been a human being, was without anger, abounding in patience. Though spoken to much, he neither resented, nor was angry, nor bore malice, nor was he resistant; and he did not display anger, hatred, or discontent. He was also a giver of fine and soft coverings, spreads of delicate linen, delicate cotton, delicate silk, and delicate wool. By the performance and accumulation of that action… he, passing away from there and coming to this state, obtains this mark of a great man: he is of golden color, with skin like burnished gold. Endowed with that mark, if he lives the household life, he becomes a wheel-turning monarch… Being a king, what does he gain? He gains fine and soft coverings, spreads of delicate linen, delicate cotton, delicate silk, and delicate wool. Being a king, he gains this… Being a Buddha, what does he gain? He gains fine and soft coverings, spreads of delicate linen, delicate cotton, delicate silk, and delicate wool. Being a Buddha, he gains this.\" The Blessed One spoke this meaning.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්ම භවයෙහි, පෙර වාසස්ථානයෙහි, පළමුව මනුෂ්‍යයෙක් ව සිටියදී ක්‍රෝධ නොකරන සුලු වූයේ ද, බොහෝ උපක්‍රමයන්ගෙන් යුක්ත වූයේ ද, බොහෝ දේ පවසනු ලැබුව ද කිපුණේ නැද්ද, තරහ ගත්තේ නැද්ද, වෛර කළේ නැද්ද, නොසතුටු වූයේ නැද්ද, කිපීම, ද්වේෂය හා නොපැහැදීම ප්‍රකට නොකළේ ද, සියුම් මෘදු ඇතිරිලි, පොරෝනාවන්, සිහින් කපු ඇතිරිලි, සිහින් කපු පුළුන් ඇතිරිලි, සිහින් සේද ඇතිරිලි, සිහින් ලොම් ඇතිරිලි දානය කිරීමෙහි දායකයෙක් වූයේ ද, ඒ කර්මය කිරීමෙන්, රැස් කිරීමෙන් ...පෙ... හෙතෙම එතැනින් චුත ව මෙලොවට පැමිණ මෙම මහා පුරුෂ ලක්ෂණය ලබයි. රන්වන් පැහැ ඇත්තේ වේ. රන් පැහැයට සමාන සමක් ඇත්තේ වේ.\n\n‘‘ඒ ලක්ෂණයෙන් යුක්ත වූ හෙතෙම ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වන්නේ ය...රජ වූයේ නම් කිම ලබා ද? සියුම් මෘදු ඇතිරිලි, පොරෝනාවන්, සිහින් කපු ඇතිරිලි, සිහින් කපු පුළුන් ඇතිරිලි, සිහින් සේද ඇතිරිලි, සිහින් ලොම් ඇතිරිලි ලබන්නේ ය. රජ වූයේ මෙය ලබයි… බුදු වූයේ නම් කිම ලබා ද? සියුම් මෘදු ඇතිරිලි, පොරෝනාවන්, සිහින් කපු ඇතිරිලි, සිහින් කපු පුළුන් ඇතිරිලි, සිහින් සේද ඇතිරිලි, සිහින් ලොම් ඇතිරිලි ලබන්නේ ය. බුදු වූයේ මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(13) Suvaṇṇavaṇṇalakkhaṇaṃ",
      "englishTitle": "The Mark of Golden Complexion",
      "sinhalaTitle": "සුවර්ණ වර්ණ ලක්ෂණය"
    },
    {
      "number": 219,
      "pali": "Tatthetaṃ vuccati – ‘‘Akkodhañca adhiṭṭhahi adāsi [adāsi ca (sī. pī.)], Dānañca vatthāni sukhumāni succhavīni; Purimatarabhave ṭhito abhivissaji, Mahimiva suro abhivassaṃ. ‘‘Taṃ katvāna ito cuto dibbaṃ, Upapajji [upapajja (sī. pī.)] sukataphalavipākamanubhutvā; Kanakatanusannibho idhābhibhavati, Suravarataroriva indo. ‘‘Gehañcāvasati naro apabbajja, Micchaṃ mahatimahiṃ anusāsati [pasāsati (syā.)]; Pasayha sahidha sattaratanaṃ [pasayha abhivasana-varataraṃ (sī. pī.)], Paṭilabhati vimala [vipula (syā.), vipulaṃ (sī. pī.)] sukhumacchaviṃ suciñca. ‘‘Lābhī acchādanavatthamokkhapāvuraṇānaṃ, Bhavati yadi anāgāriyataṃ upeti; Sahito [suhita (syā.), sa hi (sī. pī.)] purimakataphalaṃ anubhavati, Na bhavati katassa panāso’’ti. ",
      "english": "Therein, this is said: \"And he established himself in non-anger, he gave, and also gave robes, fine and beautiful to the touch; Standing in a former existence, he generously bestowed, like a mighty rain cloud pouring down. Having done that, passing away from here to the divine, he arose, experiencing the fruition of wholesome deeds; With a body like burnished gold, here he outshines, like Indra among the best of the gods. And a person, dwelling in a house without renouncing, wrongly instructs (others) with great power; Suppressing (others), he attains here the seven precious jewels, he obtains pure, fine, beautiful skin and purity. He is the gainer of robes for covering, cloths, shawls, and cloaks, if he goes forth into homelessness; Endowed, he experiences the fruit of deeds done formerly; there is no destruction of deeds done.\"",
      "sinhala": "එහි මෙය කියනු ලැබේ – ‘‘ක්‍රෝධ නොකර අධිෂ්ඨාන කරගෙන දන් දුන්නේ ය, සියුම් වූ, මනාවූ වස්ත්‍ර ද දන් දුන්නේ ය; පෙර භවයක සිට එය බෙදා දුන්නේ ය, වර්ෂාව වස්සන සූර්යයා මෙන් බැබළුණේ ය. ‘‘ඒ කර්මය කර මෙලොවින් චුත වූ ඔහු දිව්‍ය ලෝකයේ උපත ලබන්නේ ය, සුකෘත කර්මවල විපාක අනුභව කරන්නේ ය; රන්වන් ශරීරයකින් යුක්තව මෙහි ආධිපත්‍යය පතුරුවන්නේ ය, දෙවියන් අතර ශ්‍රේෂ්ඨ ඉන්ද්‍රයා මෙනි. ‘‘ගිහිගෙයි වසන නමුදු යම් නරයෙක් නිවැරදිව මහත් වූ පෘථිවිය පාලනය කරන්නේ ද, බලහත්කාරයෙන් මෙහි සත් රුවන ලබා ගන්නේ ද, හේ විමල වූ, විශාල වූ සියුම් සමක් ද ලබා ගන්නේ ය. ‘‘ඇඳුම්, වස්ත්‍ර, පොරෝනාවන් ලබන්නේ ය, යම් හෙයකින් ඔහු අනගාරික බවට පැමිණෙන්නේ ද; පෙර කරන ලද කර්මවල ඵල අනුභව කරන්නේ ය, කරන ලද කර්මය නිෂ්ඵල නොවේ’’ යයි.",
      "paliTitle": ""
    },
    {
      "number": 220,
      "pali": "Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno cirappanaṭṭhe sucirappavāsino ñātimitte suhajje sakhino samānetā ahosi. Mātarampi puttena samānetā ahosi, puttampi mātarā samānetā ahosi, pitarampi puttena samānetā ahosi, puttampi pitarā samānetā ahosi, bhātarampi bhātarā samānetā ahosi, bhātarampi bhaginiyā samānetā ahosi, bhaginimpi bhātarā samānetā ahosi, bhaginimpi bhaginiyā samānetā ahosi, samaṅgīkatvā [samaggiṃ katvā (sī. syā. pī.)] ca abbhanumoditā ahosi. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati – kosohitavatthaguyho hoti. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Pahūtaputto hoti, parosahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Pahūtaputto hoti, anekasahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "And also, monks, the Tathāgata, in a former birth, a former existence, a former abode, having previously been a human being, was one who brought together long-separated, long-exiled relatives, friends, well-wishers, and companions. He brought together a mother with her son, he brought together a son with his mother, he brought together a father with his son, he brought together a son with his father, he brought together a brother with a brother, he brought together a brother with a sister, he brought together a sister with a brother, he brought together a sister with a sister, and, having created concord, he rejoiced. As a result of performing that action… departing from there, upon coming to this state, he obtains this mark of a great man: he has retracted genitals. \"Possessing this mark, if he lives in a house, he becomes a wheel-turning monarch… What does a king gain by being a king? He has many sons; indeed, he has more than a thousand sons, heroes, of heroic form, destroyers of the armies of others. Being a king, he gains this… What does a Buddha gain by being a Buddha? He has many sons; indeed, he has many thousands of sons, heroes, of heroic form, destroyers of the armies of others. Being a Buddha, he gains this.\" This is what the Blessed One said.",
      "sinhala": "මහණෙනි, යම් කලෙක තථාගතයන් වහන්සේ පෙර ආත්ම භවයෙහි, පෙර වාසස්ථානයෙහි, පළමුව මනුෂ්‍යයකු වූ කල්හි බොහෝ කලක් දුර බැහැර සිටින ඥාතීන්, මිතුරන්, හිතවතුන්, සහෝදරයන් එක්කාසු කරන්නෙක් වූ සේක් ද, මව සහ පුත්‍රයා එක්කාසු කරන්නෙක් වූ සේක් ද, පුත්‍රයා සහ මව එක්කාසු කරන්නෙක් වූ සේක් ද, පියා සහ පුත්‍රයා එක්කාසු කරන්නෙක් වූ සේක් ද, පුත්‍රයා සහ පියා එක්කාසු කරන්නෙක් වූ සේක් ද, සහෝදරයා සහ සහෝදරයා එක්කාසු කරන්නෙක් වූ සේක් ද, සහෝදරයා සහ සහෝදරිය එක්කාසු කරන්නෙක් වූ සේක් ද, සහෝදරිය සහ සහෝදරයා එක්කාසු කරන්නෙක් වූ සේක් ද, සහෝදරිය සහ සහෝදරිය එක්කාසු කරන්නෙක් වූ සේක් ද, එකඟ කර සතුටු වූ සේක් ද, හෙතෙම ඒ කර්මය කිරීමෙන්... ඒ හේතුවෙන් මරණින් මතු මෙලොව ඉපදීමෙන් මේ මහා පුරිස ලක්ෂණය ලබන්නේ ය. එනම්, යටපත් වූ වස්ත්‍රයෙන් වැසී ගිය රහස් ඉන්ද්‍රිය ඇත්තෙක් වන්නේ ය. ඒ ලක්ෂණයෙන් යුක්ත වූ හෙතෙම ගිහිගෙයි වාසය කරන්නේ නම් සක්විති රජෙක් වන්නේ ය. රජෙක්ව සිට කිම ලබා ද? බොහෝ පුත්‍රයන් ලබන්නේ ය. දහසකට වැඩි වීර ශූර පරසතුරු සේනා මර්දනය කරන්නාවූ පුත්‍රයන් ඔහුට වන්නේ ය. රජෙක්ව සිට මෙය ලබන්නේ ය. බුදු වූ විට කිම ලබා ද? බොහෝ පුත්‍රයන් ලබන්නේ ය. අනේක සහස් ගණන් වීර ශූර පරසතුරු සේනා මර්දනය කරන්නාවූ පුත්‍රයන් ඔහුට වන්නේ ය. බුදු වූ විට මෙය ලබන්නේ ය”. භාග්‍යවතුන් වහන්සේ මෙම අර්ථය වදාළ සේක.",
      "paliTitle": "(14) Kosohitavatthaguyhalakkhaṇaṃ",
      "englishTitle": "Characteristic of the Sheathed Organ",
      "sinhalaTitle": "කෝසෝහිත වස්තුවේ ගුහ්‍ය ලක්ෂණය"
    },
    {
      "number": 221,
      "pali": "Tatthetaṃ vuccati – ‘‘Pure puratthā purimāsu jātisu, Cirappanaṭṭhe sucirappavāsino; Ñātī suhajje sakhino samānayi, Samaṅgikatvā anumoditā ahu. ‘‘So tena [sa tena (ka.)] kammena divaṃ samakkami, Sukhañca khiḍḍāratiyo ca anvabhi; Tato cavitvā punarāgato idha, Kosohitaṃ vindati vatthachādiyaṃ. ‘‘Pahūtaputto bhavatī tathāvidho, Parosahassañca [parosahassassa (sī. pī.)] bhavanti atrajā; Sūrā ca vīrā ca [sūrā ca vīraṅgarūpā (ka.)] amittatāpanā, Gihissa pītiṃjananā piyaṃvadā. ‘‘Bahūtarā pabbajitassa iriyato, Bhavanti puttā vacanānusārino; Gihissa vā pabbajitassa vā puna, Taṃ lakkhaṇaṃ jāyati tadatthajotaka’’nti. Paṭhamabhāṇavāro niṭṭhito. ",
      "english": "There it is said, \"Formerly, in previous births, having lived a long time in an established place, he gathered relatives, friends, and companions, and having treated them well, he rejoiced.\n\n\"Through that action, he went to heaven, and experienced happiness and playful delights. Having passed away from there, he returned here again, and finds a treasure concealed and covered with cloth.\n\n\"He becomes a father of many children of such quality, and thousands of others become his dependents. They are brave and heroic, destroyers of enemies, bringing joy to the householder, and speaking affectionately.\n\n\"Many more sons of the recluse, behaving rightly, follow his instructions. Whether for a householder or a recluse, that characteristic arises, revealing that meaning.\" The first recitation section is finished.",
      "sinhala": "තත්‍ථෙතං වුච්චති – ‘‘පූරෙ පුරත්ථා පුරිමාසු ජාතීසු, චිරප්පනට්ඨෙ සුචිරප්පවාසිනො; ඤාතී සුහජ්ජෙ සඛිනො සමානයි, සමඞ්ගිකත්වා අනුමොදිතා අහු.\n\n‘‘සො තෙන කම්මෙන දිවං සමක්කමි, සුඛඤ්ච ඛිඩ්ඩා රතියො ච අන්වභි; තතො චවිත්වා පුනරාගතො ඉධ, කොසොහිතං වින්දති වත්ථඡාදියං.\n\n‘‘පහූතපුත්තො භවතී තථාවිධො, පරො සහස්සඤ්ච භවන්ති අත්‍රජා; සූරා ච වීරා ච අමිත්තතාපනා, ගිහිස්ස පීතිං ජනනා පියංවදා.\n\n‘‘බහූතරා පබ්බජිතස්ස ඉරියතො, භවන්ති පුත්තා වචනානුසාරිනො; ගිහිස්ස වා පබ්බජිතස්ස වා පුන, තං ලක්ඛණං ජායති තදත්ථජොතක’’න්ති. පඨමභාණවාරො නිට්ඨිතො.",
      "paliTitle": ""
    },
    {
      "number": 222,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno mahājanasaṅgahaṃ [mahājanasaṅgāhakaṃ (ka.)] samekkhamāno [samapekkhamāno (ka.)] samaṃ jānāti sāmaṃ jānāti, purisaṃ jānāti purisavisesaṃ jānāti – ‘ayamidamarahati ayamidamarahatī’ti tattha tattha purisavisesakaro ahosi. So tassa kammassa kaṭattā… pe… so tato cuto itthattaṃ āgato samāno imāni dve mahāpurisalakkhaṇāni paṭilabhati. Nigrodha parimaṇḍalo ca hoti, ṭhitakoyeva ca anonamanto ubhohi pāṇitalehi jaṇṇukāni parimasati parimajjati. ‘‘So tehi lakkhaṇehi samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Aḍḍho hoti mahaddhano mahābhogo pahūtajātarūparajato pahūtavittūpakaraṇo pahūtadhanadhañño paripuṇṇakosakoṭṭhāgāro. Rājā samāno idaṃ labhati…pe… buddho samāno kiṃ labhati? Aḍḍho hoti mahaddhano mahābhogo. Tassimāni dhanāni honti, seyyathidaṃ, saddhādhanaṃ sīladhanaṃ hiridhanaṃ ottappadhanaṃ sutadhanaṃ cāgadhanaṃ paññādhanaṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, knowing and considering in his previous birth, previous existence, previous abode, when he was formerly a human being, gathering the great multitude, knowing equally, knowing himself, knowing the person, knowing the distinction of persons, that ‘this one is worthy of this, this one is worthy of that,’ he was there a maker of distinctions among persons. Through the performance of that karma… on… he, having passed away from there and come to this state, obtains these two marks of a great man. He is of even proportion like a banyan tree, and standing he touches and rubs his knees with both hands without bending over. Endowed with those marks, if he lives the household life, he becomes a wheel-turning monarch… on… being a monarch, what does he obtain? He is wealthy, of great wealth, of great possessions, with abundant gold and silver, abundant means of enjoyment, abundant wealth and grain, with storehouses and granaries filled to overflowing. Being a monarch, this he obtains… on… being a Buddha, what does he obtain? He is wealthy, of great wealth, of great possessions. These are the riches he possesses: the wealth of faith, the wealth of virtue, the wealth of conscience, the wealth of fear of wrongdoing, the wealth of learning, the wealth of generosity, the wealth of wisdom. Being a Buddha, this he obtains.\" This matter the Blessed One stated.",
      "sinhala": "‘‘මහණෙනි, යම් ඒ තථාගතයන් පෙර ආත්මය, පෙර භවය, පෙර නිකේතනය, පළමුව මනුෂ්‍ය භූතව සිටිමින් මහජන සංග්‍රහය මැනවින් බලා සමව දනී, සාමව දනී, පුරුෂයා දනී, පුරුෂ විශෙෂය දනී, ‘මොහු මෙයට සුදුසුය, මොහු මෙයට සුදුසුය’යි එහි එහි පුරුෂ විශෙෂ කරන්නෙක් විය. හේ ඒ කර්මය කිරීමෙන් ...පෙ... හේ එතැනින් චුතව මෙලොවට පැමිණියේ මේ මහා පුරිස ලක්‍ෂණ දෙක ලබයි. නුගරුක පරිමණ්ඩල වන්නේත්, සිටි සැටියේම නැමුණේ නැතිව දෙඅත්ලෙන් දණහිස් පිරිමදියි, සම්බාහනය කරයි. ‘‘හෙතෙම ඒ ලක්‍ෂණ වලින් සමන්විත වූයේ ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වෙයි...පෙ... රජ වූයේ කුමක් ලබයිද? ධනවත් වන්නේ මහත් ධන ඇත්තේ මහත් භෝග ඇත්තේ බොහෝ රන් රිදී ඇත්තේ බොහෝ වස්ත්‍රෝපකරණ ඇත්තේ බොහෝ ධනධාන්‍ය ඇත්තේ පිරිපුන් කොසොල් ගබඩා ඇත්තේ වෙයි. රජ වූයේ මෙය ලබයි...පෙ... බුදු වූයේ කුමක් ලබයිද? ධනවත් වන්නේ මහත් ධන ඇත්තේ මහත් භෝග ඇත්තේ වෙයි. ඔහුට මේ ධනයෝ වෙත්. එනම්: ශ්‍ර‍ද්ධා ධනය, සීල ධනය, හිරි ධනය, ඔත්තප්ප ධනය, සුත ධනය, ත්‍යාග ධනය, ප්‍ර‍ඥා ධනය යන ඒවායි. බුදු වූයේ මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(15-16) Parimaṇḍalaanonamajaṇṇuparimasanalakkhaṇāni",
      "englishTitle": "Marks of proper robe, knee, and non-rubbing",
      "sinhalaTitle": "පිරිමඩුලු බව සහ දණ නොගැටීමේ ලක්ෂණ"
    },
    {
      "number": 223,
      "pali": "Tatthetaṃ vuccati – ‘‘Tuliya paṭivicaya cintayitvā, Mahājanasaṅgahanaṃ [mahājanaṃ saṅgāhakaṃ (ka.)] samekkhamāno; Ayamidamarahati tattha tattha, Purisavisesakaro pure ahosi. ‘‘Mahiñca pana [samā ca pana (syā.), sa hi ca pana (sī. pī.)] ṭhito anonamanto, Phusati karehi ubhohi jaṇṇukāni; Mahiruhaparimaṇḍalo ahosi, Sucaritakammavipākasesakena. ‘‘Bahuvividhanimittalakkhaṇaññū, Atinipuṇā manujā byākariṃsu; Bahuvividhā gihīnaṃ arahāni, Paṭilabhati daharo susu kumāro. ‘‘Idha ca mahīpatissa kāmabhogī, Gihipatirūpakā bahū bhavanti; Yadi ca jahati sabbakāmabhogaṃ, Labhati anuttaraṃ uttamadhanagga’’nti. ",
      "english": "Thus, this matter is spoken of: “Having considered with balanced reflection, anticipating the acceptance of the great multitude; 'This is suitable for this, in that place,' he was formerly a maker of distinctions among individuals.\n\n“And, standing firmly without bending, he touches both knees with his hands; he was endowed with a perfectly round body; through the residual result of well-done deeds.\n\n“Knowing many kinds of indicative signs, men who are very skilled declared; 'The young, very tender boy will obtain many kinds of worthy things for laypeople.'\n\n“And here, for this great king, many who enjoy sensual pleasures will become lay leaders; and if he abandons all sensual pleasures, he will obtain the unsurpassed, supreme treasure.\"",
      "sinhala": "මෙය මෙසේ කියනු ලැබේ – \"තමන්ගේ බුද්ධියෙන් විමසා මහා ජනයාගේ යහපත සලකා බලමින්, 'මේ තැනැත්තා මෙයට සුදුසුයි' යනුවෙන් ඒ ඒ තැනෙහි පුරුෂයන්ගේ විශේෂත්වය හඳුනාගන්නට ඔහු පෙර කාලයේ සමත් විය. තවද ඔහු නැමීමක් නැතිව පොළොවේ ස්ථිරව සිට, දණහිස් දෙක අත්වලින් ස්පර්ශ කරයි. යහපත් ක්‍රියාවන්හි විපාකයේ ඉතිරි කොටසින් ඔහු විශාල වටකුරු ශරීරයක් ඇති අයෙක් විය. බොහෝ ආකාර වූ නිමිති හා ලක්ෂණ දන්නා, ඉතා සියුම් නුවණැති මිනිසුන් මෙසේ පැවසුවා. මේ ලාබාල කුමාරයා ගිහියන්ට ලැබිය යුතු බොහෝ ආකාර වූ සම්පත් ලබන්නේය. මෙහි රජුගේ බොහෝ කාමභෝගී, ගිහි වේශ ඇති අය වෙති. යම් හෙයකින් ඔහු සියලු කාමභෝග අත්හරින්නේ නම්, ඔහු අනුත්තර වූ උතුම් ධනයක් ලබන්නේය.\"",
      "paliTitle": ""
    },
    {
      "number": 224,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno bahujanassa atthakāmo ahosi hitakāmo phāsukāmo yogakkhemakāmo – ‘kintime saddhāya vaḍḍheyyuṃ, sīlena vaḍḍheyyuṃ, sutena vaḍḍheyyuṃ [sutena vaḍḍheyyuṃ, buddhiyā vaḍḍheyyuṃ (syā.)], cāgena vaḍḍheyyuṃ, dhammena vaḍḍheyyuṃ, paññāya vaḍḍheyyuṃ, dhanadhaññena vaḍḍheyyuṃ, khettavatthunā vaḍḍheyyuṃ, dvipadacatuppadehi vaḍḍheyyuṃ, puttadārehi vaḍḍheyyuṃ, dāsakammakaraporisehi vaḍḍheyyuṃ, ñātīhi vaḍḍheyyuṃ, mittehi vaḍḍheyyuṃ, bandhavehi vaḍḍheyyu’nti. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imāni tīṇi mahāpurisalakkhaṇāni paṭilabhati. Sīhapubbaddhakāyo ca hoti citantaraṃso ca samavaṭṭakkhandho ca. ‘‘So tehi lakkhaṇehi samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Aparihānadhammo hoti, na parihāyati dhanadhaññena khettavatthunā dvipadacatuppadehi puttadārehi dāsakammakaraporisehi ñātīhi mittehi bandhavehi, na parihāyati sabbasampattiyā. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Aparihānadhammo hoti, na parihāyati saddhāya sīlena sutena cāgena paññāya, na parihāyati sabbasampattiyā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former abode, having previously been a human being, was desirous of the welfare of many people, desirous of their benefit, desirous of their comfort, desirous of their security from bondage, thinking: ‘How might they increase in faith, increase in virtue, increase in learning, increase in generosity, increase in righteousness, increase in wisdom, increase in wealth and grain, increase in fields and property, increase in bipeds and quadrupeds, increase in children and wives, increase in servants, laborers, and men, increase in relatives, increase in friends, increase in kin?’ Because of having performed that action… he, having passed away from there, having come to this state, obtains these three marks of a great man. He has the forepart of his body like a lion, his inner skin is smooth, and his shoulders are well-rounded. Endowed with those marks, if he lives at home, he becomes a wheel-turning monarch… being a king, what does he gain? He is of a non-declining nature, he does not decline in wealth and grain, in fields and property, in bipeds and quadrupeds, in children and wives, in servants, laborers, and men, in relatives, in friends, in kin; he does not decline in all prosperity. Being a king, this he gains… being a Buddha, what does he gain? He is of a non-declining nature, he does not decline in faith, in virtue, in learning, in generosity, in wisdom; he does not decline in all prosperity. Being a Buddha, this he gains.’\" The Blessed One said this matter.",
      "sinhala": "‘‘මහණෙනි, තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසයෙහි, පළමුව මනුෂ්‍යයෙක් ව සිටියදී බොහෝ ජනයාට වැඩ කැමැති වූයේ, හිත කැමැති වූයේ, පහසුව කැමැති වූයේ, යෝගක්‍ෂේම කැමැති වූයේ මෙසේ සිතූ සේක: ‘කෙසේ නම් මොවුහු ශ්‍රද්ධාවෙන් වැඩෙත් නම්, ශීලයෙන් වැඩෙත් නම්, ශ්‍රැතියෙන් වැඩෙත් නම්, පරිත්‍යාගයෙන් වැඩෙත් නම්, ධර්මයෙන් වැඩෙත් නම්, ප්‍රඥාවෙන් වැඩෙත් නම්, ධන ධාන්‍යයෙන් වැඩෙත් නම්, කෙත් වතු වලින් වැඩෙත් නම්, දෙපාවුන් සිව්පාවුන්ගෙන් වැඩෙත් නම්, පුත්‍ර දාරාවන්ගෙන් වැඩෙත් නම්, දාස කම්කරුවන් පුරුෂයන්ගෙන් වැඩෙත් නම්, ඥාතීන්ගෙන් වැඩෙත් නම්, මිත්‍රයින්ගෙන් වැඩෙත් නම්, බන්ධුන්ගෙන් වැඩෙත් නම්’ යනුයි. හෙතෙම ඒ කර්මය කිරීම හේතුකොට ගෙන… ඒ භවයෙන් චුත ව මෙලොවට පැමිණ මේ මහා පුරිස ලක්‍ෂණ තුන ලබයි. එනම් සිංහ පූර්වාර්ධ කය ඇති වීම, චිතාන්තරංශ වීම, සමවට්ටස්කන්ධ වීම යන ඒවායි.\n\n‘‘හෙතෙම ඒ ලක්‍ෂණවලින් යුක්ත වූයේ ගිහිගෙයි වාසය කරන්නේ නම් සක්විති රජෙක් වෙයි… රජ වූයේ කුමක් ලබයි ද? පිරිහීමට පත් නොවන ස්වභාවය ඇත්තේ වෙයි. ධන ධාන්‍යයෙන්, කෙත් වතු වලින්, දෙපාවුන් සිව්පාවුන්ගෙන්, පුත්‍ර දාරාවන්ගෙන්, දාස කම්කරුවන් පුරුෂයන්ගෙන්, ඥාතීන්ගෙන්, මිත්‍රයින්ගෙන්, බන්ධුන්ගෙන් පිරිහෙන්නේ නැත. සියලු සම්පත්වලින් පිරිහෙන්නේ නැත. රජ වූයේ මෙය ලබයි… බුදු වූයේ කුමක් ලබයි ද? පිරිහීමට පත් නොවන ස්වභාවය ඇත්තේ වෙයි. ශ්‍රද්ධාවෙන්, ශීලයෙන්, ශ්‍රැතියෙන්, පරිත්‍යාගයෙන්, ප්‍රඥාවෙන් පිරිහෙන්නේ නැත. සියලු සම්පත්වලින් පිරිහෙන්නේ නැත. බුදු වූයේ මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(17-19) Sīhapubbaddhakāyāditilakkhaṇaṃ",
      "englishTitle": "Three Characteristics starting with Lion's Fore-Body",
      "sinhalaTitle": "සිංහ පූර්වාර්ධකාය ආදි ත්‍රිලක්ෂණ"
    },
    {
      "number": 225,
      "pali": "Tatthetaṃ vuccati – ‘‘Saddhāya sīlena sutena buddhiyā, Cāgena dhammena bahūhi sādhuhi; Dhanena dhaññena ca khettavatthunā, Puttehi dārehi catuppadehi ca. ‘‘Ñātīhi mittehi ca bandhavehi ca, Balena vaṇṇena sukhena cūbhayaṃ; Kathaṃ na hāyeyyuṃ pareti icchati, Atthassa middhī ca [idaṃ samiddhañca (ka.), addhaṃ samiddhañca (syā.)] panābhikaṅkhati. ‘‘Sa sīhapubbaddhasusaṇṭhito ahu, Samavaṭṭakkhandho ca citantaraṃso; Pubbe suciṇṇena katena kammunā, Ahāniyaṃ pubbanimittamassa taṃ. ‘‘Gihīpi dhaññena dhanena vaḍḍhati, Puttehi dārehi catuppadehi ca; Akiñcano pabbajito anuttaraṃ, Pappoti bodhiṃ asahānadhammata’’nti [sambodhimahānadhammatanti (syā. ka.) ṭīkā oloketabbā]. ",
      "english": "Thus it is said: \"Through faith, virtue, learning, and wisdom, through generosity, the Dhamma, and many virtuous qualities; through wealth, grain, fields, and property, through children, wives, and four-footed beasts;\n\nThrough relatives, friends, and kin, through strength, beauty, happiness, and both, one wishes, 'Why should they not diminish for others?' and yet one desires prosperity and abundance for oneself.\n\nHe was like a lion, well-established and firmly set, with well-rounded limbs and bright inner rays; due to deeds well-performed in the past, that former sign was not to be destroyed.\n\nEven a householder prospers through grain and wealth, through children, wives, and four-footed beasts; while the mendicant, without possessions, attains the unsurpassed enlightenment, unshakeable in the Dhamma.\"",
      "sinhala": "තත්ථෙතං වුච්චති – ‘‘සද්ධාය සීලෙන සුතෙන බුද්ධියා, චාගෙන ධම්මෙන බහූහි සාධුහි; ධනෙන ධඤ්ඤෙන ච ඛෙත්තවත්‍ථුනා, පුත්‌තෙහි දාරෙහි චතුප්‌පදෙහි ච.\n\n‘‘ඤාතීහි මිත්‌තෙහි ච බන්‌ධවෙහි ච, බලෙන වණ්‌ණෙන සුඛෙන චූභයං; කථං න හායෙය්‍යුං පරෙති ඉච්‌ඡති, අත්‌ථස්‌ස මිද්‌ධී ච පනාභිකං‌ඛති.\n\n‘‘ස සීහපුබ්‌බද්‌ධසුසණ්‌ඨිතො අහු, සමවට්‌ඨක්‌ඛන්‌ධො ච චිතන්‌තරං‌සො; පුබ්‌බෙ සුචිණ්‌ණෙන කතෙන කම්‌මුනා, අහානියං පුබ්‌බනිමිත්‌තමස්‌ස තං.\n\n‘‘ගිහීපි ධඤ්‌ඤෙන ධනෙන වඩ්‌ඪති, පුත්‌තෙහි දාරෙහි චතුප්‌පදෙහි ච; අකිඤ්‌චනො පබ්‌බජිතො අනුත්‌තරං, පප්‌පොති බොධිං අසහානධම්‌මතා’’න්‌ති.",
      "paliTitle": ""
    },
    {
      "number": 226,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno sattānaṃ aviheṭhakajātiko ahosi pāṇinā vā leḍḍunā vā daṇḍena vā satthena vā. So tassa kammassa kaṭattā upacitattā…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati, rasaggasaggī hoti, uddhaggāssa rasaharaṇīyo gīvāya jātā honti samābhivāhiniyo [samavāharasaharaṇiyo (syā.)]. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Appābādho hoti appātaṅko, samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Appābādho hoti appātaṅko samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"Furthermore, monks, the Tathāgata, in a previous birth, a previous existence, a previous dwelling, when he was formerly a human being, was one who did not harm beings, whether with his hand, or with a clod, or with a stick, or with a weapon. Due to performing and accumulating that action… he, on passing away from there, on coming to this state, obtains this mark of a great man: he has exquisite taste; taste-carrying veins that go upwards from the neck are generated in him, which are evenly carrying. Endowed with that mark, if he lives in a house, he becomes a wheel-turning monarch… as a monarch, what does he obtain? He is free from disease and free from affliction, endowed with a digestion that evenly ripens, neither too cold nor too hot. As a monarch, he obtains this… as a Buddha, what does he obtain? He is free from disease and free from affliction, endowed with a digestion that evenly ripens, neither too cold nor too hot, moderate and fit for exertion. As a Buddha, he obtains this.\" The Blessed One spoke this meaning.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසයෙහි, පළමුව මනුෂ්‍යයෙක්ව සිටියදී සත්වයන්ට අතින් හෝ, මැටි කැටයකින් හෝ, දණ්ඩකින් හෝ, ආයුධයකින් හෝ හිංසා නොකරන සුලූ ස්වභාව ඇත්තෙක් වූ සේක් ද, හෙතෙම ඒ කර්මය කිරීමෙන්, රැස් කිරීමෙන් ...පෙ... හෙතෙම එතැනින් චුතව මෙලොවට පැමිණියේ මහා පුරිස ලක්ෂණය ලබන්නේ ය. රසඥතාවයෙන් අග්‍ර වූ රසහරණ නහර ඇත්තේ වෙයි. බෙල්ලෙහි උඩු අතට ගමන් කරන සමව ගලා බසින රසහරණ නහර උපදී. හෙතෙම ඒ ලක්ෂණයෙන් යුක්ත වූයේ ගිහිගෙයි වාසය කරන්නේ නම් සක්විති රජෙක් වන්නේ ය...පෙ... රජෙක්ව සිටීමෙන් කිම ලබා ද? රෝග අඩු වූයේ ද, දුක් අඩු වූයේ ද, මධ්‍යස්ථව පිරිණමන ආහාර ජීර්ණ ශක්තියෙන් යුක්ත වූයේ ද, අධික ශීත නොවූ, අධික උෂ්ණ නොවූ ශරීර ඇත්තේ වෙයි. රජෙක්ව සිටීමෙන් මෙය ලබයි. බුදුවීමෙන් කිම ලබා ද? රෝග අඩු වූයේ ද, දුක් අඩු වූයේ ද, මධ්‍යස්ථව පිරිණමන ආහාර ජීර්ණ ශක්තියෙන් යුක්ත වූයේ ද, අධික ශීත නොවූ, අධික උෂ්ණ නොවූ, මධ්‍යම ප්‍රධානයට සුදුසු ශරීර ඇත්තේ වෙයි. බුදුවීමෙන් මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මෙම අර්ථය වදාළ සේක.",
      "paliTitle": "(20) Rasaggasaggitālakkhaṇaṃ",
      "englishTitle": "Characteristic of Supreme Heavenly Essence",
      "sinhalaTitle": "ප්‍රශංසිත අග්‍ර රස ලක‍්ෂණය"
    },
    {
      "number": 227,
      "pali": "Tatthetaṃ vuccati – ‘‘Na pāṇidaṇḍehi panātha leḍḍunā, Satthena vā maraṇavadhena [māraṇavadhena (ka.)] vā pana; Ubbādhanāya paritajjanāya vā, Na heṭhayī janatamaheṭhako ahu. ‘‘Teneva so sugatimupecca modati, Sukhapphalaṃ kariya sukhāni vindati; Samojasā [sampajjasā (sī. pī.), pāmuñjasā (syā.), sāmañca sā (ka.)] rasaharaṇī susaṇṭhitā, Idhāgato labhati rasaggasaggitaṃ. ‘‘Tenāhu naṃ atinipuṇā vicakkhaṇā, Ayaṃ naro sukhabahulo bhavissati; Gihissa vā pabbajitassa vā puna [pana (syā.)], Taṃ lakkhaṇaṃ bhavati tadatthajotaka’’nti. ",
      "english": "Thus, it is said in that connection: \"He did not injure living beings with his hands, nor with a stick, nor with a weapon, nor with a deadly punishment; he was one who did not harm, not injuring the populace. Through that very deed, having attained a good destination, he rejoices, having done a pleasant deed, he experiences happiness; thoroughly established with strength, of delightful essence, and well-composed, having come here, he obtains the flavor of the highest delight. Therefore, the very wise and discerning say of him: 'This person will be abundant in happiness, whether he be a householder or again one who has gone forth; that characteristic will be indicative of that meaning.'\"",
      "sinhala": "තත්ථேதං වුච්චති – ‘‘න පාණිදණ්ඩෙහි පනාථ ලෙඩ්ඩුනා, සත්ථෙන වා මරණවධෙන [මාරණවධෙන (ක.)] වා පන; උබ්බාධනාය පරිතජ්ජනාය වා, න හෙඨයී ජනතමහෙඨකෝ අහු. ‘‘තෙනෙව සො සුගතිමුපෙච්ච මොදති, සුඛප්ඵලං කිරිය සුඛානි වින්දති; සමෝජසා [සම්පජ්ජසා (සී. පී.), පාමුඤ්ජසා (ස්‍යා.), සාමඤ්ච සා (ක.)] රසහරණී සුසංඨිතා, ඉධාගතෝ ලභති රසග්ගසග්ගිතං. ‘‘තෙනාහු නං අතිනිපුණා විචක්ඛණා, අයං නරෝ සුඛබහුලෝ භවිස්සති; ගිහිස්ස වා පබ්බජිතස්ස වා පුන [පන (ස්‍යා.)], තං ලක්ඛණං භවති තදත්ථජෝතකන්ති.",
      "paliTitle": ""
    },
    {
      "number": 228,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno na ca visaṭaṃ, na ca visāci [na ca visācitaṃ (sī. pī.), na ca visāvi (syā.)], na ca pana viceyya pekkhitā, ujuṃ tathā pasaṭamujumano, piyacakkhunā bahujanaṃ udikkhitā ahosi. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imāni dve mahāpurisalakkhaṇāni paṭilabhati. Abhinīlanetto ca hoti gopakhumo ca. ‘‘So tehi lakkhaṇehi samannāgato, sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Piyadassano hoti bahuno janassa, piyo hoti manāpo brāhmaṇagahapatikānaṃ negamajānapadānaṃ gaṇakamahāmattānaṃ anīkaṭṭhānaṃ dovārikānaṃ amaccānaṃ pārisajjānaṃ rājūnaṃ bhogiyānaṃ kumārānaṃ. Rājā samāno idaṃ labhati…pe… buddho samāno kiṃ labhati? Piyadassano hoti bahuno janassa, piyo hoti manāpo bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ devānaṃ manussānaṃ asurānaṃ nāgānaṃ gandhabbānaṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former dwelling, having previously been a human being, was neither distracted, nor scattered, nor of wavering attention, but with direct, straightforward mind, with affectionate eyes, looked upon the multitude. As a result of performing that action…he…having passed away from there, on arising here, obtains these two marks of a great man. He has deeply blue eyes and eyelashes like a cow's. \"Endowed with these characteristics, if he lives at home, he becomes a wheel-turning monarch…he…being a king, what does he obtain? He is pleasing to behold to many people, he is dear and agreeable to brahmins and householders, town and country dwellers, accountants and high officials, army officers, doorkeepers, ministers, courtiers, kings, enjoyers, and princes. Being a king, this he obtains…he…being a Buddha, what does he obtain? He is pleasing to behold to many people, he is dear and agreeable to monks, nuns, laymen, laywomen, gods, humans, asuras, nāgas, and gandhabbas. Being a Buddha, this he obtains.\" This is what the Blessed One said.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසස්ථානයෙහි, පළමුව මනුෂ්‍යයෙක්ව සිටියදී විසිරුණු සිත් ඇතිව නොසිටියේ ද, ව්‍යාකූල සිත් ඇතිව නොසිටියේ ද, නුවණින් විමසා නොබැලුවේ ද, කෙළින් මනා සිත් ඇතිව එලෙසම පැතිර ගියේ ද, ප්‍රිය ඇස් ඇතිව බොහෝ දෙනා දෙස බැලුවේ ද, ඒ කර්මය කිරීම හේතුවෙන් ...හෙතෙම එතැනින් චුතව මෙලොව ඉපදීමෙන් මේ මහා පුරිස ලක්‍ෂණ දෙක ලබයි. එනම් අභිනීල නෙත් ඇති වන්නේ ද, ගොපලු ඇස් ඇත්තෙක් ද වෙයි. හෙතෙම ඒ ලක්‍ෂණ වලින් යුක්ත වූයේ ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වන්නේ ය...රජෙක්ව සිටීමෙන් කිමෙක් ලබන්නේ ද? බොහෝ දෙනාට ප්‍රිය දර්ශනීය වන්නේ ය, බ්‍රාහ්මණ ගෘහපතියන්ට ද, නෛගම ජනපද වැසියන්ට ද, ගණක මහාමාත්‍යවරුන්ට ද, සේනාපතියන්ට ද, දොරටුපාලයන්ට ද, අමාත්‍යවරුන්ට ද, පිරිස්වලට ද, රජවරුන්ට ද, භෝගීන්ට ද, කුමාරවරුන්ට ද ප්‍රිය වන්නේ ය, මනාප වන්නේ ය. රජෙක්ව සිටීමෙන් මෙය ලබන්නේ ය...බුදුව සිටීමෙන් කිමෙක් ලබන්නේ ද? බොහෝ දෙනාට ප්‍රිය දර්ශනීය වන්නේ ය, භික්‍ෂූන්ට ද, භික්‍ෂුණීන්ට ද, උපාසකයන්ට ද, උපාසිකාවන්ට ද, දෙවියන්ට ද, මනුෂ්‍යයන්ට ද, අසුරයන්ට ද, නාගයන්ට ද, ගාන්ධර්වයන්ට ද ප්‍රිය වන්නේ ය, මනාප වන්නේ ය. බුදුව සිටීමෙන් මෙය ලබන්නේ ය’’. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(21-22) Abhinīlanettagopakhumalakkhaṇāni",
      "englishTitle": "Characteristics of Deep Blue Eyes and Ox-like Eyelashes",
      "sinhalaTitle": "අභිනීල නෙත් සහ දිගු ඇහිපිළි ලක්ෂණ"
    },
    {
      "number": 229,
      "pali": "Tatthetaṃ vuccati – ‘‘Na ca visaṭaṃ na ca visāci [visācitaṃ (sī. pī.), visāvi (syā.)], na ca pana viceyyapekkhitā; Ujuṃ tathā pasaṭamujumano, piyacakkhunā bahujanaṃ udikkhitā. ‘‘Sugatīsu so phalavipākaṃ, Anubhavati tattha modati; Idha ca pana bhavati gopakhumo, Abhinīlanettanayano sudassano. ‘‘Abhiyogino ca nipuṇā, Bahū pana nimittakovidā; Sukhumanayanakusalā manujā, Piyadassanoti abhiniddisanti naṃ. ‘‘Piyadassano gihīpi santo ca, Bhavati bahujanapiyāyito; Yadi ca na bhavati gihī samaṇo hoti, Piyo bahūnaṃ sokanāsano’’ti. ",
      "english": "Here it is said: \"Neither scattered nor dispersed, nor looking for a flaw; Straight, thus expanded, with a straight mind, looking upon many people with a loving eye.\n\n\"He experiences the fruition of good destinations, and rejoices there; And here, he becomes a protector of cattle, with dark blue eyes and fair to behold.\n\n\"And many energetic and skilled, clever in interpreting signs, people skilled in subtle discernment, designate him as 'pleasant to behold.'\n\n\"Being a pleasant to behold householder, he becomes beloved by many people; And if he does not remain a householder, he becomes a renunciate, beloved by many, a destroyer of sorrow.\"",
      "sinhala": "තත්‍රෙතං වුච්චති – ‘‘න ච විසටං න ච විසාචි, න ච පන විචෙය්‍යපෙක්ඛිතා; උජුං තථා පසඨමුජුමනො, පියචක්ඛුනා බහුජනං උදික්ඛිතා. ‘‘සුගතීසු සො ඵලවිපාකං, අනුභවති තත්ථ මොදති; ඉධ ච පන භවති ගොපඛුමො, අභිනීලනෙත්තනයනො සුදස්සනො. ‘‘අභියොගිනො ච නිපුණා, බහූ පන නිමිත්තකොවිදා; සුඛුමනයනකුසලා මනුජා, පියදස්සනොති අභිනිද්දිසන්ති නං. ‘‘පියදස්සනො ගිහීපි සන්තො ච, භවති බහුජනපියායිතො; යදි ච න භවති ගිහී සමණො හොති, පියො බහූනං සොකනාසනො’’ති.",
      "paliTitle": ""
    },
    {
      "number": 230,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno bahujanapubbaṅgamo ahosi kusalesu dhammesu bahujanapāmokkho kāyasucarite vacīsucarite manosucarite dānasaṃvibhāge sīlasamādāne uposathupavāse matteyyatāya petteyyatāya sāmaññatāya brahmaññatāya kule jeṭṭhāpacāyitāya aññataraññataresu ca adhikusalesu dhammesu. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati – uṇhīsasīso hoti. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Mahāssa jano anvāyiko hoti, brāhmaṇagahapatikā negamajānapadā gaṇakamahāmattā anīkaṭṭhā dovārikā amaccā pārisajjā rājāno bhogiyā kumārā. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Mahāssa jano anvāyiko hoti, bhikkhū bhikkhuniyo upāsakā upāsikāyo devā manussā asurā nāgā gandhabbā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former dwelling, having previously been a human being, was a forerunner in meritorious deeds for many people, an instigator of many people in skillful qualities: in bodily good conduct, verbal good conduct, mental good conduct, the generosity of sharing gifts, the undertaking of precepts, the observance of the Uposatha, in dutifulness to mother, dutifulness to father, in respect to ascetics, in respect to Brahmins, in honoring elders in the family, and in various other superior meritorious qualities. Due to the performance of that action... having passed away from there, upon arriving here, he attains this mark of a great man: he has an uṇhīsa on his head. Endowed with that mark, if he lives the household life, he becomes a wheel-turning monarch... being a king, what does he gain? He has a great following: Brahmins and householders, town and country dwellers, accountants and high officials, army officers, gatekeepers, ministers, courtiers, kings, enjoyers, and princes. Being a king, this he gains... Being a Buddha, what does he gain? He has a great following: monks, nuns, laymen, laywomen, gods, humans, asuras, nāgas, and gandhabbas. Being a Buddha, this he gains.\" This is what the Blessed One said.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසස්ථානයෙහි, පළමුව මනුෂ්‍ය භවයෙහි සිටියදී බොහෝ දෙනාට කුශල ධර්මයන්හි පුරෝගාමී වූ සේක් ද, බොහෝ දෙනාට කුශල ධර්මයන්හි ප්‍රධාන වූ සේක් ද, කාය සුචරිතයෙහි, වාග් සුචරිතයෙහි, මනෝ සුචරිතයෙහි, දාන සංවිභාගයෙහි, ශීල සමාදානයෙහි, උපෝසථ සමාදානයෙහි, මව් කෙරෙහි දැක්විය යුතු යුතුකම් කිරීමෙහි, පියා කෙරෙහි දැක්විය යුතු යුතුකම් කිරීමෙහි, ශ්‍රමණ ගුණයෙහි, බ්‍රාහ්මණ ගුණයෙහි, කුලයෙහි වැඩිහිටියන්ට සැලකීමෙහි හා අනෙකුත් බොහෝ කුශල ධර්මයන්හි නිරත වූ සේක් ද, හෙතෙම ඒ කර්මය කිරීම හේතුවෙන්... ඒ කර්මය කිරීම ආදී හේතුකොටගෙන මරණින් මතු මෙලොව ඉපදීම ලබන්නේ මහා පුරිස ලක්ෂණයක් වන උෂ්ණීෂ ශීර්ෂය ලබයි. උන්වහන්සේ එම ලක්ෂණයෙන් සමන්විතව ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වන්නේ ය... රජෙක්ව සිටීමෙන් කුමක් ලබන්නේ ද? බ්‍රාහ්මණයෝ, ගෘහපතියෝ, නෛගම ජනපදයෝ, ගණකාධිකාරීහු, අණිකට්ඨයෝ, ද්වාරිකයෝ, අමාත්‍යයෝ, පිරිස් ඇත්තෝ, රජවරු, භෝජකයෝ, කුමාරවරු යන මොවුහු මහත් වූ පිරිසක් වශයෙන් ඔහු අනුව යති. රජෙක්ව සිටීමෙන් මෙය ලබයි... බුදුවීමෙන් කුමක් ලබන්නේ ද? භික්ෂූහු, භික්ෂුණීහු, උපාසකයෝ, උපාසිකාවෝ, දෙවියෝ, මනුෂ්‍යයෝ, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ යන මොවුහු මහත් වූ පිරිසක් වශයෙන් ඔහු අනුව යති. බුදුවීමෙන් මෙය ලබයි\". භාග්‍යවතුන් වහන්සේ මෙම අර්ථය වදාළ සේක.",
      "paliTitle": "(23) Uṇhīsasīsalakkhaṇaṃ",
      "englishTitle": "The Mark of the Cranial Protuberance",
      "sinhalaTitle": "උෂ්ණීෂ ශීර්ෂ ලක්ෂණය"
    },
    {
      "number": 231,
      "pali": "Tatthetaṃ vuccati – ‘‘Pubbaṅgamo sucaritesu ahu, Dhammesu dhammacariyābhirato; Anvāyiko bahujanassa ahu, Saggesu vedayittha puññaphalaṃ. ‘‘Veditvā so sucaritassa phalaṃ, Uṇhīsasīsattamidhajjhagamā; Byākaṃsu byañjananimittadharā, Pubbaṅgamo bahujanaṃ hessati. ‘‘Paṭibhogiyā manujesu idha, Pubbeva tassa abhiharanti tadā; Yadi khattiyo bhavati bhūmipati, Paṭihārakaṃ bahujane labhati. ‘‘Atha cepi pabbajati so manujo, Dhammesu hoti paguṇo visavī; Tassānusāsaniguṇābhirato, Anvāyiko bahujano bhavatī’’ti. ",
      "english": "Therein this is said: \"He was foremost in good conduct, delighting in righteous living in accordance with the Dhamma; he was a follower of many people, he experienced the fruits of merit in heavenly realms.\n\n\"Having experienced the fruit of good conduct, he attained the state of being a crowned king here; those skilled in interpreting signs and omens declared, 'He will be foremost to many people.'\n\n\"Among humans here, offerings are brought to him beforehand; if he becomes a noble, a ruler of the earth, he obtains homage from many people.\n\n\"But even if that man goes forth, he becomes skilled and confident in the Dhamma; delighting in the instruction given by him, many people become his followers.\"",
      "sinhala": "තත්‍ථෙතං වුච්චති – ‘‘සුචරිතයන්හි පුබ්බංගමෝ වූයේ වෙයි, ධර්මයන්හි ධම්මචරියාවෙහි ඇලුනේ වෙයි; බොහෝ ජනයාට අන්වායික වූයේ වෙයි, ස්වර්ගයන්හි පින්ඵලය වින්දේ වෙයි. ‘‘හෙතෙම සුචරිතයේ ඵලය දැන උෂ්ණීෂ ශීර්ෂත්වය මෙහි අධිගමනය කළේය; ව්‍යඤ්ජන නිමිත්තධරයෝ ව්‍යාකරණය කළහ, බොහෝ ජනයාට පුබ්බංගමෝ වන්නේය. ‘‘මනුෂ්‍යයන් අතරෙහි මෙහි ප්‍රතිභෝගී වූයේ වෙයි, පෙරටුව ඔහුට ඒ මොහොතෙහි අභිහරණය කෙරෙති; යම් හෙයකින් ක්ෂත්‍රිය වූ භූමිපතියෙක් වන්නේ නම්, බොහෝ ජනයා කෙරෙන් ප්‍රතිහාරක ලබන්නේය. ‘‘අථ චෙපි ඒ මනුෂ්‍යයා පැවිදි වන්නේ නම්, ධර්මයන්හි විශාරද වූයේ පගුණෝ වන්නේය; ඔහුගේ අනුශාසනා ගුණයෙහි ඇලුනේ, බොහෝ ජනයා අන්වායික වන්නේය’’යි.",
      "paliTitle": ""
    },
    {
      "number": 232,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno musāvādaṃ pahāya musāvādā paṭivirato ahosi, saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. So tassa kammassa kaṭattā upacitattā…pe… so tato cuto itthattaṃ āgato samāno imāni dve mahāpurisalakkhaṇāni paṭilabhati. Ekekalomo ca hoti, uṇṇā ca bhamukantare jātā hoti odātā mudutūlasannibhā. ‘‘So tehi lakkhaṇehi samannāgato, sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Mahāssa jano upavattati, brāhmaṇagahapatikā negamajānapadā gaṇakamahāmattā anīkaṭṭhā dovārikā amaccā pārisajjā rājāno bhogiyā kumārā. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Mahāssa jano upavattati, bhikkhū bhikkhuniyo upāsakā upāsikāyo devā manussā asurā nāgā gandhabbā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former abode, having previously been a human being, having abandoned false speech, abstained from false speech; he was a speaker of truth, consistent with truth, reliable, trustworthy, not deceiving the world. Because of the performance and accumulation of that karma…he…having passed away from there, upon coming to this state, obtains these two marks of a great man: He has one hair per pore, and a soft, white tuft of hair grows between his eyebrows, like soft cotton wool. Endowed with these marks, if he lives the household life, he becomes a wheel-turning monarch…being a king, what does he gain? A large populace attends upon him: brahmins and householders, town and country dwellers, accountants and high officials, troops, gatekeepers, ministers, courtiers, kings, enjoyers, and princes. Being a king, this he gains… being a Buddha, what does he gain? A large populace attends upon him: monks, nuns, male lay followers, female lay followers, gods, humans, asuras, nāgas, and gandhabbas. Being a Buddha, this he gains.\" This was the meaning spoken by the Blessed One.",
      "sinhala": "“මහණෙනි, තථාගතයන් වහන්සේ පෙර ආත්මයේදී, පෙර භවයේදී, පෙර වාසස්ථානයේදී, පළමුව මනුෂ්‍යයෙක්ව සිටියදී මුසාවාදය දුරු කොට මුසාවාදයෙන් වැළකී සිටියාහු වේද, සත්‍යවාදී වූයේ, සත්‍යසන්ධ වූයේ, ස්ථිර වූයේ, විශ්වාස කිරීමට සුදුසු වූයේ, ලෝකයා නොරවටන්නා වූයේ වේද, ඒ කර්මය කිරීමේ හේතුවෙන්, රැස් කිරීමේ හේතුවෙන් ...ඒ හේතුවෙන් එතැනින් චුතව මෙලොවට පැමිණි කල්හි මේ මහා පුරිස ලක්ෂණ දෙක ලබන්නේය. එනම් එක් එක් රෝමයක් ඇති වන්නේය. තවද නළල් තලයේ රෝම ඌර්ණාවක් හටගන්නේය. එය සුදු පැහැතිය, කපු පුළුන් මෙන් මෘදුය.\n\n“ඒ ලක්ෂණ වලින් සමන්විත වූයේ, යම්සේ ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වන්නේද ...රජ වූයේ කවරක් ලබන්නේද? මහත් ජනකායක් ඔහු වෙත පැමිණෙන්නේය. එනම් බ්‍රාහ්මණ ගෘහපතියෝ, නෛගම ජනපද වැසියෝ, ගණකාධිකාරී මහාමාත්‍යවරු, සේනාධිපතියෝ, ද්වාරපාලකයෝ, අමාත්‍යවරු, පිරිස්වල සිටින්නෝ, රජවරු, භෝගීන්, කුමාරවරු වෙති. රජ වූයේ මෙය ලබන්නේය… බුදු වූයේ කවරක් ලබන්නේද? මහත් ජනකායක් ඔහු වෙත පැමිණෙන්නේය. එනම් භික්ෂූන් භික්ෂුණීන් උපාසක උපාසිකාවන් දෙවියන් මනුෂ්‍යයන් අසුරයන් නාගයන් ගන්ධර්වයන් වෙති. බුදු වූයේ මෙය ලබන්නේය’’. භාග්‍යවතුන් වහන්සේ මෙම අර්ථය වදාළ සේක.",
      "paliTitle": "(24-25) Ekekalomatāuṇṇālakkhaṇāni",
      "englishTitle": "Marks of Individual Hairs and the Uṇṇā",
      "sinhalaTitle": "තනි තනි රෝම හා ඌර්‍ණා ලෝම ලක්‍ෂණ"
    },
    {
      "number": 233,
      "pali": "Tatthetaṃ vuccati – ‘‘Saccappaṭiñño purimāsu jātisu, Advejjhavāco alikaṃ vivajjayi; Na so visaṃvādayitāpi kassaci, Bhūtena tacchena tathena bhāsayi [tosayi (sī. pī.)]. ‘‘Setā susukkā mudutūlasannibhā, Uṇṇā sujātā [uṇṇāssa jātā (ka. sī.)] bhamukantare ahu; Na lomakūpesu duve ajāyisuṃ, Ekekalomūpacitaṅgavā ahu. ‘‘Taṃ lakkhaṇaññū bahavo samāgatā, Byākaṃsu uppādanimittakovidā; Uṇṇā ca lomā ca yathā susaṇṭhitā, Upavattatī īdisakaṃ bahujjano. ‘‘Gihimpi santaṃ upavattatī jano, Bahu puratthāpakatena kammunā; Akiñcanaṃ pabbajitaṃ anuttaraṃ, Buddhampi santaṃ upavattati jano’’ti. ",
      "english": "Therein this is said: \"True to his word in former births, avoiding falsehood, with speech free from duplicity, he was not one who deceived anyone, he spoke with what was real, true, and factual. \"White, very white, like soft cotton, a well-formed hair grew between his eyebrows; two hairs did not grow in the hair follicles, he was one whose body was covered with one hair per pore. \"Many who know the marks, gathered together, skilled in the causes of arising, declared: 'Both the hair and the woolly hair are very well-placed; the multitude attends to one who possesses such qualities.' \"Even a householder is attended to by the multitude, through deeds done long ago; how much more so is an unexcelled, homeless ascetic, even a Buddha.\"",
      "sinhala": "තත්‍රෙතං වුච්චති – ‘‘සච්චපටිඤ්ඤො පුරිමාසු ජාතිසු, අද්වෙජ්ඣවාචො අලිකං විවජ්ජයි; න සො විසංවාදයිතාපි කස්සචි, භූතෙන තච්ඡෙන තථෙන භාසයි. ‘‘සෙතා සුසුක්කා මුදුතූලසන්නිභා, උණ්ණා සුජාතා භමූකන්තරෙ අහු; න ලොමකූපேசு දුවේ අජායිසුං, එකෙකලොමූපචිතඞ්ගවා අහු. ‘‘තං ලක්ඛණඤ්ඤූ බහවො සමාගතා, බ්‍යාකංසු උප්පාදනિમিত্তකොවිදා; උණ්ණා ච ලොමා ච යථා සුසණ්ඨිතා, උපවත්තතී ඊදිසකං බහුජ්ජනො. ‘‘ගිහිම්පි සන්තං උපවත්තතී ජනො, බහු පුරත්ථාපකතෙන කම්මුනා; අකිඤ්චනං පබ්බජිතං අනුත්තරං, බුද්ධම්පි සන්තං උපවත්තති ජනො’’ති.",
      "paliTitle": ""
    },
    {
      "number": 234,
      "pali": "‘‘Yampi, bhikkhave tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato ahosi. Ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya, iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā ahosi. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imāni dve mahāpurisalakkhaṇāni paṭilabhati. Cattālīsadanto ca hoti aviraḷadanto ca. ‘‘So tehi lakkhaṇehi samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Abhejjapariso hoti, abhejjāssa honti parisā, brāhmaṇagahapatikā negamajānapadā gaṇakamahāmattā anīkaṭṭhā dovārikā amaccā pārisajjā rājāno bhogiyā kumārā. Rājā samāno idaṃ labhati … buddho samāno kiṃ labhati? Abhejjapariso hoti, abhejjāssa honti parisā, bhikkhū bhikkhuniyo upāsakā upāsikāyo devā manussā asurā nāgā gandhabbā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former dwelling, when he was previously a human being, having abandoned divisive speech, refrained from divisive speech. Having heard something here, he would not repeat it there to cause dissension among these people; or having heard something there, he would not repeat it here to cause dissension among those people. Thus, he was one who reunited those who were divided, or encouraged those who were united, delighting in harmony, rejoicing in harmony, happy with harmony, speaking words that create harmony. As a result of performing that action… he, having passed away from there and come to this state, obtains these two marks of a great man: He has forty teeth, and his teeth are evenly spaced. Endowed with these characteristics, if he lives at home, he becomes a wheel-turning monarch… being a king, what does he obtain? He has an unbreakable retinue; his retinue is unbreakable, consisting of brahmins and householders, town and country dwellers, accountants and ministers, soldiers, gatekeepers, advisors, courtiers, kings, princes. Being a king, this he obtains… being a Buddha, what does he obtain? He has an unbreakable retinue; his retinue is unbreakable, consisting of monks, nuns, male lay followers, female lay followers, gods, humans, asuras, nāgas, gandhabbas. Being a Buddha, this he obtains.\" This is what the Blessed One said.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසස්ථානයෙහි, පළමුව මනුෂ්‍යයෙක් ව සිටියදී, කේලාම් බස් දුරු කොට කේලාම් බස්වලින් වැළැක්කාහු ද, මෙතැනින් අසා ඔවුන් බිඳවීම පිණිස අන් තැනක නොකියන්නාහු ද, එතැනින් අසා ඔවුන් බිඳවීම පිණිස මෙතැනක නොකියන්නාහු ද, මෙසේ භින්න වූවන්ගේ සංධානය කරන්නාහු ද, එක්වූවන්ගේ අනුප්‍රදානය කරන්නාහු ද, සමගි වීමෙහි ඇලුනේ සමගි වීමෙහි රතිය ඇත්තේ සමගි වීමෙහි නන්දිය ඇත්තේ සමගි කරණීය වචන කථා කරන්නාහු ද, හෙතෙම ඒ කර්මය කිරීමෙන් ...පෙ... හෙතෙම එතැනින් චුතව මෙලොවට පැමිණියේ සමාන වූයේ මේ මහා පුරිස ලක්ෂණ දෙක ලබයි. සතලිස් දත් ඇත්තේ ද වෙයි. නොපරතර වූ දත් ඇත්තේ ද වෙයි. හෙතෙම ඒ ලක්ෂණයන්ගෙන් සමන්විත වූයේ ගිහිගෙයි වෙසේ නම්, සක්විති රජෙක් වෙයි ...පෙ... රජ වූයේ කවරක් ලබයි ද? බිඳිය නොහැකි පිරිසක් ඇත්තේ වෙයි. ඔහුට බිඳිය නොහැකි පිරිසක් වෙති. බ්‍රාහ්මණ ගෘහපතියෝ නෛගම ජනපද වැසියෝ ගණක මහාමාත්‍යයෝ අනීකස්ථයෝ ද්වාරිකයෝ අමාත්‍යයෝ පාරිසජ්ජයෝ භෝග්‍ය රජදරුවෝ කුමාරයෝ වෙති. රජ වූයේ මෙය ලබයි ... බුදු වූයේ කවරක් ලබයි ද? බිඳිය නොහැකි පිරිසක් ඇත්තේ වෙයි. ඔහුට බිඳිය නොහැකි පිරිසක් වෙති. භික්ෂූ භික්ෂුණී උපාසක උපාසිකා දෙවියෝ මනුෂ්‍යයෝ අසුරයෝ නාගයෝ ගාන්ධර්වයෝ වෙති. බුදු වූයේ මෙය ලබයි. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(26-27) Cattālīsaaviraḷadantalakkhaṇāni",
      "englishTitle": "Forty Characteristics of Close-set Teeth",
      "sinhalaTitle": "හතළිස් අවිරළ දත් ලක‍්ෂණ"
    },
    {
      "number": 235,
      "pali": "Tatthetaṃ vuccati – ‘‘Vebhūtiyaṃ sahitabhedakāriṃ, Bhedappavaḍḍhanavivādakāriṃ; Kalahappavaḍḍhanaākiccakāriṃ, Sahitānaṃ bhedajananiṃ na bhaṇi. ‘‘Avivādavaḍḍhanakariṃ sugiraṃ, Bhinnānusandhijananiṃ abhaṇi; Kalahaṃ janassa panudī samaṅgī, Sahitehi nandati pamodati ca. ‘‘Sugatīsu so phalavipākaṃ, Anubhavati tattha modati; Dantā idha honti aviraḷā sahitā, Caturo dasassa mukhajā susaṇṭhitā. ‘‘Yadi khattiyo bhavati bhūmipati, Avibhediyāssa parisā bhavati; Samaṇo ca hoti virajo vimalo, Parisāssa hoti anugatā acalā’’ti. ",
      "english": "There it is said: \"He did not speak words that cause division among those who are united, that increase discord, that cause strife, that increase quarrels, that generate division among those who are united. He spoke well-spoken words that increase harmony, that generate a joining together of those who are divided; he removes quarrels from people, being harmonious, he rejoices and is glad with those who are united.\n\n\"He experiences the fruition of that in happy destinies, he rejoices there; his teeth here are even, close together, and well-set, forty in number, born in the mouth.\n\n\"If he becomes a noble ruler of the earth, his assembly is undivided; and if he becomes a recluse, without passion and pure, his assembly follows him, unwavering.\"",
      "sinhala": "යම් තැනක දී මෙසේ කියනු ලැබේ: “සම්මුතිය බිඳීමෙහි කාරක වූ, භේදය වැඩිකිරීමෙහි විවාදයෙහි කාරක වූ, කලහය වැඩිකිරීමෙහි අකී‍්‍රයෙහි කාරක වූ, එක්වූවන්ගේ භේදය උපදවන්නා වූ වචන නොකියයි. අවිවාදය වැඩිකිරීමෙහි කාරක වූ මනා වචන කියයි; භින්නානුසන්ධි ජනනය කරන්නා වූ වචන නොකියයි; කලහය දුරු කොට සමගි කරයි; එක්වූවන් හා ප්‍රීති වෙයි, සතුටු වෙයි. හේ ශුභගතිවල විපාක අත්දකියි. එහි සතුටු වෙයි. මෙහි දත් අවිරල වූයේ එක්ව පිහිටියේ වෙයි. දසයෙහි සතරක් වූ මුඛයෙන් හටගත් මනාව පිහිටි දත් ඇත. යම් හෙයකින් ක්ෂත්‍රිය වූයේ භූමිපතියෙක් වන්නේ නම්, ඔහුගේ පිරිස අවිභේද්‍ය වන්නේය. ශ්‍රමණ වූයේ විරජස් වූයේ විමල වූයේ නම් ඔහුගේ පිරිස ඔහු අනුව යන්නේය, නොසැලෙන්නේය.”",
      "paliTitle": ""
    },
    {
      "number": 236,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato ahosi. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā, tathārūpiṃ vācaṃ bhāsitā ahosi. So tassa kammassa kaṭattā upacitattā…pe… so tato cuto itthattaṃ āgato samāno imāni dve mahāpurisalakkhaṇāni paṭilabhati. Pahūtajivho ca hoti brahmassaro ca karavīkabhāṇī. ‘‘So tehi lakkhaṇehi samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Ādeyyavāco hoti, ādiyantissa vacanaṃ brāhmaṇagahapatikā negamajānapadā gaṇakamahāmattā anīkaṭṭhā dovārikā amaccā pārisajjā rājāno bhogiyā kumārā. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Ādeyyavāco hoti, ādiyantissa vacanaṃ bhikkhū bhikkhuniyo upāsakā upāsikāyo devā manussā asurā nāgā gandhabbā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former abode, when he was previously a human being, having abandoned harsh speech, abstained from harsh speech. That speech which was refined, pleasing to the ear, endearing, touching the heart, polite, liked by many people, and pleasing to many people, such speech he spoke. Because of the performance and accumulation of that action...he...having passed away from there and come to this state, he obtains these two marks of a great man. He has a large tongue and a Brahma-like voice, and speaks like a karavika bird. Being endowed with these marks, if he lives in a house, he becomes a wheel-turning monarch...as a monarch, what does he obtain? He is one whose word is heeded; his word is heeded by the Brahmins, householders, townsfolk, country people, accountants, high officials, army officers, gatekeepers, ministers, courtiers, kings, rulers, and princes. As a monarch, he obtains this...as a Buddha, what does he obtain? He is one whose word is heeded; his word is heeded by monks, nuns, male lay followers, female lay followers, gods, humans, asuras, nāgas, and gandhabbas. As a Buddha, he obtains this.\" The Blessed One said this matter.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසස්ථානයෙහි, පළමුව මනුෂ්‍යයෙක්ව සිටියදී රළු වචනය දුරු කොට රළු වචනයෙන් වැළැක්කාහු ද, යම් ඒ වචනයක් මෘදු වූ කන්කළු වූ ප්‍රේමණීය වූ හෘදයාංගම වූ පුරවැසියන් විසින් ප්‍රිය වූ බොහෝ දෙනාට මනාප වූයේ ද, එබඳු වූ වචනයක් කථා කළාහු ද, හෙතෙම ඒ කර්මය කිරීම හේතුවෙන්, වැඩීම හේතුවෙන්... ඒ ආත්මභාවයෙන් චුත වූ මෙලොවට පැමිණියේ සමාන වූයේ මේ මහා පුරිස ලක්ෂණ දෙක ලබන්නේ ය. විශාල දිවක් ඇත්තෙක් ද, බ්‍රහ්ම ස්වර ඇත්තෙක් ද, කරවීක පක්ෂියෙකු මෙන් කථා කරන්නෙක් ද වෙයි. හෙතෙම ඒ ලක්ෂණ වලින් යුක්ත වූයේ ගිහිගෙයි වාසය කරන්නේ නම් සක්විති රජෙක් වන්නේ ය... රජ වූයේ කුමක් ලබන්නේ ද? පිළිගත යුතු වචන ඇත්තෙක් වන්නේ ය. බ්‍රාහ්මණයෝ, ගෘහපතියෝ, නෛගම ජනපදවාසීහු, ගණකාධිකාරීහු, මහ ඇමතියෝ, සේනා සංවිධායකයෝ, දොරටුපාලයෝ, අමාත්‍යයෝ, පිරිස් ඇත්තෝ, රජවරු, භෝගිකයෝ, කුමාරවරු යන මොවුහු ඔහුගේ වචනය පිළිගන්නාහ. රජ වූයේ මෙය ලබන්නේ ය... බුදු වූයේ කුමක් ලබන්නේ ද? පිළිගත යුතු වචන ඇත්තෙක් වන්නේ ය. භික්ෂූහු, භික්ෂුණීහු, උපාසකයෝ, උපාසිකාවෝ, දෙවියෝ, මනුෂ්‍යයෝ, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ යන මොවුහු ඔහුගේ වචනය පිළිගන්නාහ. බුදු වූයේ මෙය ලබන්නේ ය.’’ භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(28-29) Pahūtajivhābrahmassaralakkhaṇāni",
      "englishTitle": "Marks of the Ample Tongue and Divine Voice",
      "sinhalaTitle": "දිගු දිව සහ බ්U+200Dරහ්U+200Dම ස්U+200Dවර ලක්U+200Dෂණ"
    },
    {
      "number": 237,
      "pali": "Tatthetaṃ vuccati – ‘‘Akkosabhaṇḍanavihesakāriṃ, Ubbādhikaṃ [ubbādhakaraṃ (syā.)] bahujanappamaddanaṃ; Abāḷhaṃ giraṃ so na bhaṇi pharusaṃ, Madhuraṃ bhaṇi susaṃhitaṃ [susahitaṃ (syā.)] sakhilaṃ. ‘‘Manaso piyā hadayagāminiyo, Vācā so erayati kaṇṇasukhā; Vācāsuciṇṇaphalamanubhavi, Saggesu vedayatha [vedayati (?) ṭīkā oloketabbā] puññaphalaṃ. ‘‘Veditvā so sucaritassa phalaṃ, Brahmassarattamidhamajjhagamā; Jivhāssa hoti vipulā puthulā, Ādeyyavākyavacano bhavati. ‘‘Gihinopi ijjhati yathā bhaṇato, Atha ce pabbajati so manujo; Ādiyantissa vacanaṃ janatā, Bahuno bahuṃ subhaṇitaṃ bhaṇato’’ti. ",
      "english": "Herein, it is said: \"He does not utter harsh speech that causes reviling, quarreling, and injury, that is obstructive and crushes many people; but he speaks speech that is unconfused, sweet, well-composed, and friendly.\n\n\"He utters speech that is pleasing to the mind and touches the heart, speech that is delightful to the ear; he experiences the fruit of speech well-practiced, he feels the result of merit in the heavens.\n\n\"Having known the fruit of good conduct, he attained to this Brahma-like voice; his tongue becomes broad and thick, he becomes one whose speech is worthy of acceptance.\n\n\"Even for a householder, it succeeds when he speaks thus; and if that person goes forth, people listen to his words from beginning to end when he speaks well and speaks much.\"",
      "sinhala": "තත්ථෙතං වුච්චති – ‘‘අක්කොසභණ්ඩනවිහෙසකාරිං, උබ්බාධිකං බහුජනප්පමද්දනං; අබාළ්හං ගිරං සො න භණි ඵරුසං, මධුරං භණි සුසංහිතං සඛිලං. ‘‘මනසො පියා හදයගාමිනියො, වාචා සො එරයති කණ්ණසුඛා; වාචාසුචිණ්ණඵලමනુભවි, සග්ගෙසු වෙදයථ පුඤ්ඤඵලං. ‘‘වෙදිත්වා සො සුචරිතස්ස ඵලං, බ්‍රහ්මස්සරත්තමිධමජ්ඣගමා; ජිව්හාස්ස හොති විපුලා පුථුලා, ආදෙය්‍යවාක්‍යවචනො භවති. ‘‘ගිහිනොපි ඉජ්ඣති යථා භණතො, අථ චෙ පබ්බජති සො මනුජො; ආදියන්තිස්ස වචනං ජනතා, බහුනො බහුං සුභණිතං භණතො’’ති.",
      "paliTitle": ""
    },
    {
      "number": 238,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno samphappalāpaṃ pahāya samphappalāpā paṭivirato ahosi kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā ahosi kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. So tassa kammassa kaṭattā…pe… so tato cuto itthattaṃ āgato samāno imaṃ mahāpurisalakkhaṇaṃ paṭilabhati, sīhahanu hoti. ‘‘So tena lakkhaṇena samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī…pe… rājā samāno kiṃ labhati? Appadhaṃsiyo hoti kenaci manussabhūtena paccatthikena paccāmittena. Rājā samāno idaṃ labhati… buddho samāno kiṃ labhati? Appadhaṃsiyo hoti abbhantarehi vā bāhirehi vā paccatthikehi paccāmittehi, rāgena vā dosena vā mohena vā samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"And also, monks, the Tathāgata, in a former birth, a former existence, a former dwelling, having been formerly a human being, having abandoned frivolous talk, refrained from frivolous talk, being a speaker of what is timely, a speaker of what is true, a speaker of what is beneficial, a speaker of the Dhamma, a speaker of the Discipline, spoke speech that was a treasure, at the right time, with a reason, limited, connected with meaning. He, by the doing of that action… having passed away from there, having come to this state, obtains this mark of a great man: he has a lion's jaw.\n\n\"He, endowed with that mark, if he lives at home, becomes a wheel-turning monarch… being a king, what does he obtain? He is unassailable by any hostile human being, any enemy. Being a king, he obtains this… being a Buddha, what does he obtain? He is unassailable by internal or external adversaries, enemies, by passion, by hatred, by delusion, by a contemplative, by a brahmin, by a god, by Māra, by Brahmā, or by anyone in the world. Being a Buddha, he obtains this.\" The Blessed One spoke this matter.",
      "sinhala": "‘‘මහණෙනි, යම් හෙයකින් තථාගතයන් වහන්සේ පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර වාසයෙහි, පළමුව මනුෂ්‍ය භවයෙහි සිටියදී සම්ඵප්‍රලාපය දුරු කොට සම්ඵප්‍රලාපයෙන් වැළැක්කාහු ද, කාලෝචිත වචන කථා කරන්නා වූ, භූත කථා (ඇත්ත) කථා කරන්නා වූ, අර්ථවත් වචන කථා කරන්නා වූ, ධර්මානුකූල වචන කථා කරන්නා වූ, විනයානුකූල වචන කථා කරන්නා වූ, නිධානයක් බඳු වූ වචන කථා කරන්නා වූ, කාලයාගේ ඇවෑමෙන් හේතු සහිත ව, සීමා සහිත ව, අර්ථයෙන් යුක්ත වූ වචන කථා කළාහු ද, හෙතෙම ඒ කර්මය කිරීමෙන් ...පෙ... හෙතෙම එතැනින් චුත ව මෙලොව ඉපදීමෙන් මේ මහා පුරිස ලක්ෂණය ලබන්නේ ය. එනම් සිංහ හනුක ඇත්තේ වෙයි.\n\nහෙතෙම ඒ ලක්ෂණයෙන් යුක්ත වූයේ ගිහිගෙයි වාසය කරන්නේ නම්, සක්විති රජෙක් වන්නේ ය...පෙ... රජ වූයේ කවරක් ලබන්නේ ද? කිසි මනුෂ්‍යයකුට හෝ සතුරකුට හෝ විරුද්ධවාදියකුට හෝ පහර දිය නොහැකි වන්නේ ය. රජ වූයේ මෙය ලබන්නේ ය... බුදු වූයේ කවරක් ලබන්නේ ද? ඇතුළතින් හෝ පිටතින් හෝ සතුරන්ට හෝ විරුද්ධවාදීන්ට හෝ රාගයෙන් හෝ ද්වේෂයෙන් හෝ මෝහයෙන් හෝ ශ්‍රමණයාට හෝ බ්‍රාහ්මණයාට හෝ දේවතාවාට හෝ මාරයාට හෝ බ්‍රහ්මයාට හෝ ලෝකයෙහි කිසිවකුට හෝ පහර දිය නොහැකි වන්නේ ය. බුදු වූයේ මෙය ලබන්නේ ය’’. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(30) Sīhahanulakkhaṇaṃ",
      "englishTitle": "Lion's Jaw Characteristic",
      "sinhalaTitle": "සිංහ හනු ලක්ෂණය"
    },
    {
      "number": 239,
      "pali": "Tatthetaṃ vuccati – ‘‘Na samphappalāpaṃ na muddhataṃ [buddhatanti (ka.)], Avikiṇṇavacanabyappatho ahosi; Ahitamapi ca apanudi, Hitamapi ca bahujanasukhañca abhaṇi. ‘‘Taṃ katvā ito cuto divamupapajji, Sukataphalavipākamanubhosi; Caviya punaridhāgato samāno, Dvidugamavaratarahanuttamalattha. ‘‘Rājā hoti suduppadhaṃsiyo, Manujindo manujādhipati mahānubhāvo; Tidivapuravarasamo bhavati, Suravarataroriva indo. ‘‘Gandhabbāsurayakkharakkhasebhi [surasakkarakkhasebhi (syā.)], Surehi na hi bhavati suppadhaṃsiyo; Tathatto yadi bhavati tathāvidho, Idha disā ca paṭidisā ca vidisā cā’’ti. ",
      "english": "Therein this is said: \"Not idle chatter, not thoughtlessness, and his speech was not scattered in its expression; he warded off what was harmful, and spoke what was beneficial and conducive to the happiness of many. Having done that, passing away from here, he was reborn in heaven, experiencing the fruition of his good deeds. Deceasing again, and being reborn here, he attained the highest, incomparable, and excellent wisdom. He becomes a king, very difficult to overcome, a lord of men, a ruler of men, of great power; he becomes like the excellent celestial city, like Indra among the best of the gods. By gandhabbas, asuras, yakkhas, and rakkhasas, and by the gods, he is not easily overcome; if he is such a person, of such a kind, here, in the east, the west, the north, the south, and the intermediate directions.\"",
      "sinhala": "එහිලා මෙය කියනු ලැබේ: \"ඔහු නිෂ්ඵල කතා නොකළේ ය; මුඪ බවක් ද (නොපෙන්වූයේ ය); විසිරුණු වචනවලින් යුත් බොරු කතා ඔහු තුළ නොතිබිණි; අහිතකර දේ දුරු කළේ ය; හිතකර දේ ද බොහෝ දෙනාට සැප ගෙන දෙන දේ ද කීවේ ය. \"ඒ (කර්මය) කොට මෙලොවින් චුත ව දිව්‍ය ලෝකයට පැමිණියේ ය; මැනවින් කළ කර්මවල විපාක අනුභව කළේ ය; නැවත චුත ව මෙහි පැමිණි කල්හි දෙවරක් දුගතියට නොගොස් උසස් ම තත්ත්වයට පැමිණියේ ය. \"ඔහු පහසුවෙන් පරාජය කළ නොහැකි රජෙක් වේ; මිනිසුන්ගේ අධිපති වූ මහත් ආනුභාව සම්පන්න වූ මනුෂ්‍යෙන්ද්‍රයෙක් වේ; ඔහු තිස්තුන් දෙව්ලොවට සමාන වේ; සුරයන් අතර ශ්‍රේෂ්ඨ වූ ඉන්ද්‍රයා මෙන් වේ. \"ගාන්ධර්වයන්, අසුරයන්, යක්ෂයන්, රක්ෂසයන් හෝ සුරයන් විසින් ඔහු පහසුවෙන් පරාජය කළ නොහැකිය; ඔහු එබඳු ස්වභාවයකින් යුක්ත නම්, මෙහි දිශාව ද, ප්‍රතිදිශාව ද, විදිශාව ද (ආරක්ෂා වන්නේ ය).\"",
      "paliTitle": ""
    },
    {
      "number": 240,
      "pali": "‘‘Yampi, bhikkhave, tathāgato purimaṃ jātiṃ purimaṃ bhavaṃ purimaṃ niketaṃ pubbe manussabhūto samāno micchājīvaṃ pahāya sammāājīvena jīvikaṃ kappesi, tulākūṭa kaṃsakūṭa mānakūṭa ukkoṭana vañcana nikati sāciyoga chedana vadha bandhana viparāmosa ālopa sahasākārā [sāhasākārā (sī. syā. pī.)] paṭivirato ahosi. So tassa kammassa kaṭattā upacitattā ussannattā vipulattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. So tattha aññe deve dasahi ṭhānehi adhigaṇhāti dibbena āyunā dibbena vaṇṇena dibbena sukhena dibbena yasena dibbena ādhipateyyena dibbehi rūpehi dibbehi saddehi dibbehi gandhehi dibbehi rasehi dibbehi phoṭṭhabbehi. So tato cuto itthattaṃ āgato samāno imāni dve mahāpurisalakkhaṇāni paṭilabhati, samadanto ca hoti susukkadāṭho ca. ‘‘So tehi lakkhaṇehi samannāgato sace agāraṃ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni satta ratanāni bhavanti, seyyathidaṃ – cakkaratanaṃ hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ akhilamanimittamakaṇṭakaṃ iddhaṃ phītaṃ khemaṃ sivaṃ nirabbudaṃ adaṇḍena asatthena dhammena abhivijiya ajjhāvasati. Rājā samāno kiṃ labhati? Suciparivāro hoti sucissa honti parivārā brāhmaṇagahapatikā negamajānapadā gaṇakamahāmattā anīkaṭṭhā dovārikā amaccā pārisajjā rājāno bhogiyā kumārā. Rājā samāno idaṃ labhati. ‘‘Sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭṭacchado. Buddho samāno kiṃ labhati? Suciparivāro hoti, sucissa honti parivārā, bhikkhū bhikkhuniyo upāsakā upāsikāyo devā manussā asurā nāgā gandhabbā. Buddho samāno idaṃ labhati’’. Etamatthaṃ bhagavā avoca.",
      "english": "\"Furthermore, monks, when the Tathāgata in a previous birth, a previous existence, a previous abode, being formerly a human being, having abandoned wrong livelihood, maintained his life with right livelihood, abstaining from false balance, false metal, false measure, bribery, deception, trickery, fraudulent actions, mutilation, killing, bondage, robbery, plunder, and violence. Due to the performance and accumulation of that action, its abundance and magnitude, upon the dissolution of the body, after death, he is reborn in a good destination, a heavenly world. There he surpasses other gods in ten respects: with divine lifespan, divine beauty, divine happiness, divine glory, divine dominion, divine sights, divine sounds, divine smells, divine tastes, and divine tactile sensations. Having passed away from there, when he comes to this state of existence, he obtains these two marks of a great man: he has even teeth and very white canines. Endowed with these marks, if he lives at home, he becomes a wheel-turning monarch, a righteous king, a king of righteousness, a conqueror of the four quarters, who has attained stability in his country and is endowed with the seven treasures. These seven treasures are his: the wheel treasure, the elephant treasure, the horse treasure, the jewel treasure, the woman treasure, the treasurer treasure, and the advisor treasure as the seventh. Moreover, he has over a thousand sons who are brave, heroic in appearance, and destroyers of enemy armies. He conquers and rules this earth up to the ocean's border, without violence, without weapons, righteously. Being a king, what does he obtain? He has a pure retinue. He has pure followers: brahmins, householders, townsfolk, country folk, accountants, high officials, troop leaders, doorkeepers, ministers, courtiers, kings, princes. Being a king, this he obtains. But if he goes forth from the household life into homelessness, he becomes an Arahant, a fully enlightened Buddha in the world, with the veil removed. Being a Buddha, what does he obtain? He has a pure retinue. He has pure followers: monks, nuns, laymen, laywomen, gods, humans, asuras, nāgas, gandhabbas. Being a Buddha, this he obtains.\" This is what the Blessed One said.",
      "sinhala": "‘‘මහණෙනි, යම් ඒ තථාගතයන් පෙර ආත්මයෙහි, පෙර භවයෙහි, පෙර නිකේතනයෙහි, පළමුව මනුෂ්‍ය භූත වූයේ, මිථ්‍යා ජීවිකාව දුරු කොට සම්මා ආජීවයෙන් ජීවිකාව කෙළේ ද, තරාදි කූට කිරීම, ලෝහ කූට කිරීම, මිනුම් කූට කිරීම, අල්ලස් ගැනීම, වංචා කිරීම, රැවටීම, සාචි යෝගය, කැපීම, මැරීම, බැඳීම, විපරීත කිරීම, ආලෝපය, සහසික ක්‍රියා යන මේවායින් වැළකුණේ ද, හේ ඒ කර්මය කිරීමෙන්, වර්ධනය කිරීමෙන්, උස් කිරීමෙන්, විශාල කිරීමෙන් කය බිඳී මරණින් මතු සුගතියෙහි ස්වර්ග ලෝකයෙහි උපදී. හේ එහි අනෙක් දෙවියන්ට වඩා දස ආකාරයකින් අධික වන්නේ ය. දිව්‍ය ආයුෂයෙන් ද, දිව්‍ය වර්ණයෙන් ද, දිව්‍ය සැපයෙන් ද, දිව්‍ය යසසින් ද, දිව්‍ය ආධිපත්‍යයෙන් ද, දිව්‍ය රූපවලින් ද, දිව්‍ය ශබ්දවලින් ද, දිව්‍ය ගන්ධවලින් ද, දිව්‍ය රසවලින් ද, දිව්‍ය ස්පර්ශවලින් ද (අධික වෙයි). හේ එතැනින් චුත ව මෙලොවට පැමිණියේ මේ මහා පුරිස ලක්ෂණ දෙක ලබයි. එනම් සම දත් ඇති බවත්, ඉතා සුදු වූ දළ දත් ඇති බවත් ය. හේ ඒ ලක්ෂණවලින් යුක්ත වූයේ ගිහිගෙයි වාසය කරන්නේ නම්, ධර්මිෂ්ඨ වූ ධර්ම රාජ වූ සතර දිග් විජය කළ ජනපදයන්හි ස්ථාවර වූ සප්ත රත්නයන්ගෙන් යුක්ත වූ සක්විති රජෙක් වෙයි. ඔහුට මේ සප්ත රත්නයන් වෙති. එනම්: චක්‍රරත්නය, හස්තිරත්නය, අශ්වරත්නය, මණිරත්නය, ස්ත්‍රීරත්නය, ගහපතිරත්නය, සත්වන පරිණායක රත්නය යන මේ යි. ඔහුට ශූර වූ, වීර ස්වරූප ඇති, සතුරු සේනාවන් මඩින පුත්‍රයෝ දහස් ගණනක් වෙති. හේ සාගරය කෙළවර කොට ඇති මේ පොළොව කිසිවකින් අඩු නැති ව, උපද්‍රව රහිත ව, සෞභාග්‍යයෙන් පිරිපුන් ව, ක්ෂේම ව, ශාන්ත ව, කරදර නැති ව, දඬු නැති ව, අවි නැති ව, ධර්මයෙන් යටත් කොට ගෙන වාසය කරයි. රජ වූයේ කිමෙක් ලබන්නේ ද? යහපත් පිරිවර ඇත්තේ වෙයි. යහපත් වූ පිරිවර බ්‍රාහ්මණ ගෘහපතියෝ වෙති. නෛගම ජනපදයෝ ද, ගණක මහාමාත්‍යයෝ ද, අනීකස්ථයෝ ද, ද්වාරිකයෝ ද, අමාත්‍යයෝ ද, පාරිසජ්ජයෝ ද, භෝගික කුමාරයෝ ද වෙති. රජ වූයේ මෙය ලබයි. යම් කලෙක ගිහිගෙන් අනගාරික බවට පැවිදි වන්නේ ද, ලෝකයෙහි වැස්ම ඉවත් කළ අර්හත් වූ සම්මා සම්බුද්ධ වෙයි. බුද්ධ වූයේ කිමෙක් ලබන්නේ ද? යහපත් පිරිවර ඇත්තේ වෙයි. යහපත් වූ පිරිවර භික්ෂූහු, භික්ෂුණීහු, උපාසකයෝ, උපාසිකාවෝ, දෙවියෝ, මනුෂ්‍යයෝ, අසුරයෝ, නාගයෝ, ගාන්ධර්වයෝ වෙති. බුද්ධ වූයේ මෙය ලබයි’’. භාග්‍යවතුන් වහන්සේ මේ අර්ථය වදාළ සේක.",
      "paliTitle": "(31-32) Samadantasusukkadāṭhālakkhaṇāni",
      "englishTitle": "Marks of Even Teeth and Pure White Tusks",
      "sinhalaTitle": "සම දත් හා සුසුදු දළ ලක‍්ෂණ"
    },
    {
      "number": 241,
      "pali": "Tatthetaṃ vuccati – ‘‘Micchājīvañca avassaji samena vuttiṃ, Sucinā so janayittha dhammikena; Ahitamapi ca apanudi, Hitamapi ca bahujanasukhañca acari. ‘‘Sagge vedayati naro sukhapphalāni, Karitvā nipuṇebhi vidūhi sabbhi; Vaṇṇitāni tidivapuravarasamo, Abhiramati ratikhiḍḍāsamaṅgī. ‘‘Laddhānaṃ mānusakaṃ bhavaṃ tato, Cavitvāna sukataphalavipākaṃ; Sesakena paṭilabhati lapanajaṃ, Samamapi sucisusukkaṃ [laddhāna manussakaṃ bhavaṃ tato caviya, puna sukataphalavipākasesakena; paṭilabhati lapanajaṃ samamapi, suci ca suvisuddhasusukkaṃ (syā.)]. ‘‘Taṃ veyyañjanikā samāgatā bahavo, Byākaṃsu nipuṇasammatā manujā; Sucijanaparivāragaṇo bhavati, Dijasamasukkasucisobhanadanto. ‘‘Rañño hoti bahujano, Suciparivāro mahatiṃ mahiṃ anusāsato; Pasayha na ca janapadatudanaṃ, Hitamapi ca bahujanasukhañca caranti. ‘‘Atha ce pabbajati bhavati vipāpo, Samaṇo samitarajo vivaṭṭacchado; Vigatadarathakilamatho, Imamapi ca paramapi ca [imampi ca parampi ca (pī.), paraṃpi paramaṃpi ca (syā.)] passati lokaṃ. ‘‘Tassovādakarā bahugihī ca pabbajitā ca, Asuciṃ garahitaṃ dhunanti pāpaṃ; Sa hi sucibhi parivuto bhavati, Malakhilakalikilese panudehī’’ti [tassovādakarā bahugihī ca, pabbajitā ca asucivigarahita; panudipāpassa hi sucibhiparivuto, bhavati malakhilakakilese panudeti (syā.)]. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. ",
      "english": "Here, it is said thus: \"He abandoned wrong livelihood and lived righteously; with purity, he generated righteous wealth; he removed what was harmful and practiced what was beneficial and conducive to the happiness of many.\n\n\"In heaven, that person experiences pleasant fruits, having performed deeds praised by the wise and skillful; equal to the excellent heavenly city, he delights in pleasures and amusements.\n\n\"Having obtained human existence after passing away from there, due to the remaining result of good deeds, he again attains speech that is agreeable, even and very pure and bright.\n\n\"Many experts, gathered together, wise people who are highly regarded, declare, ‘He has a following of pure individuals, with teeth as bright and pure as the twice-born birds.’\n\n\"He becomes a king with many people, a pure following, ruling the great earth; he does not oppress the people with force, and he practices what is beneficial and conducive to the happiness of many.\n\n\"And if he goes forth, he becomes free from evil, a monk with calmed passions, with the veil removed; devoid of anxieties and weariness, he sees both this world and the next.\n\n\"Lay followers and monks who follow his advice shake off impurity, what is blameworthy, and evil; he is surrounded by pure ones, removing the defilements of stain, thorn, and conflict.\"\n\nThis is what the Blessed One said. Delighted, those monks rejoiced in the words of the Blessed One.",
      "sinhala": "‘‘එතෙහිදං වුච්චති – ‘‘මිච්ඡාජීවඤ්ච අවස්සජි සමෙන වුත්තිං, සුචිනා සො ජනයිත්ථ ධම්මිකෙන; අහිතමපි ච අපනුදි, හිතමපි ච බහුජනසුඛඤ්ච ආචරි. ‘‘සග්ගෙ වේදයාති නරෝ සුඛප්ඵලානි, කරිත්වා නිපුණෙහි විදූහි සබ්භි; වණ්ණිතානි තිදිවපුරවරසමෝ, අභිරමති රතිඛිඩ්ඩාසමංගී. ‘‘ලද්ධානං මානුසකං භවං තතෝ, චවිත්වාන සුකතඵලවිපාකං; සෙසකෙන පටිලභති ලපනජං, සමමපි සුචිසුසුක්කං. ‘‘තං වෙය්‍යාඤ්ජනිකා සමාගතා බහවෝ, බ්‍යාකංසු නිපුණසම්මතා මනුජා; සුචිජනපරිවාරගණෝ භවති, දිජසමසුක්කසුචිසොභනදන්තෝ. ‘‘රඤ්ඤෝ හොති බහුජනෝ, සුචිපරිවාරෝ මහතිං මහිං අනුසාසතෝ; පසය්හ න ච ජනපදතුදනං, හිතමපි ච බහුජනසුඛඤ්ච චරන්ති. ‘‘අථ චේ පබ්බජති භවති විපාපෝ, සමණෝ සමිතරජෝ විවට්ටච්ඡදෝ; විගතදරථකිලමථෝ, ඉමමපි ච පරමපි ච පස්සති ලෝකං. ‘‘තස්සෝවාදකරා බහුගිහී ච පබ්බජිතා ච, අසුචිං ගරහිතං ධුනන්ති පාපං; ස හි සුචිභි පරිවුතෝ භවති, මලඛිලකලිකිලේසෙ පනුදෙහී’’ති. ඉදමවෝච භගවා. අත්තමනා තෙ භික්ඛූ භගවතෝ භාසිතං අභිනන්දුන්ති.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Lakkhaṇasuttaṃ niṭṭhitaṃ sattamaṃ.",
    "english": "The Seventh Lakkhaṇa Sutta",
    "sinhala": "හත්වන ලක‍්ඛණ සූත්‍රය"
  }
}