{
  "id": "dn.3.3",
  "title": {
    "pali": "Cakkavattisuttaṃ",
    "english": "The Discourse on the Wheel-turning Monarch",
    "sinhala": "සක්විති සූත්‍රය"
  },
  "sections": [
    {
      "number": 80,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā magadhesu viharati mātulāyaṃ. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhaddante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘attadīpā, bhikkhave, viharatha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā. Kathañca pana, bhikkhave, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Vedanāsu vedanānupassī…pe… citte cittānupassī…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo, dhammadīpo dhammasaraṇo anaññasaraṇo. ‘‘Gocare, bhikkhave, caratha sake pettike visaye. Gocare, bhikkhave, carataṃ sake pettike visaye na lacchati māro otāraṃ, na lacchati māro ārammaṇaṃ [āramaṇaṃ (?)]. Kusalānaṃ, bhikkhave, dhammānaṃ samādānahetu evamidaṃ puññaṃ pavaḍḍhati. ",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Magadha, at Mātulā. Thereupon the Blessed One addressed the bhikkhus, saying, \"Bhikkhus.\" \"Venerable sir,\" those bhikkhus replied to the Blessed One. The Blessed One said this: \"Bhikkhus, dwell with yourselves as an island, with yourselves as a refuge, with no other as a refuge; with the Dhamma as an island, with the Dhamma as a refuge, with no other as a refuge. And how, bhikkhus, does a bhikkhu dwell with himself as an island, with himself as a refuge, with no other as a refuge, with the Dhamma as an island, with the Dhamma as a refuge, with no other as a refuge?\"\n\n\"Here, bhikkhus, a bhikkhu dwells contemplating the body in the body, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. He dwells contemplating feelings in feelings... He dwells contemplating mind in mind... He dwells contemplating mental phenomena in mental phenomena, ardent, clearly comprehending, and mindful, having overcome covetousness and displeasure concerning the world. In this way, bhikkhus, a bhikkhu dwells with himself as an island, with himself as a refuge, with no other as a refuge, with the Dhamma as an island, with the Dhamma as a refuge, with no other as a refuge.\"\n\n\"Bhikkhus, range in your proper sphere, in your ancestral domain. When ranging, bhikkhus, in your proper sphere, in your ancestral domain, Māra will find no opportunity, Māra will find no foothold. Because of undertaking wholesome qualities, bhikkhus, in this way merit increases.\"",
      "sinhala": "මෙලෙස මා විසින් අසන ලදි. එක් සමයෙක්හි භාග්‍ය​වතුන් වහන්සේ මගධ දේශයේ මාතුලා නම් ගමෙහි වැඩසිටින සේක. එහිදී භාග්‍ය​වතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" කියා වදාළ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍ය​වතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍ය​වතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, තමා පිහිටකොටගෙන, තමා සරණකොටගෙන, අන් සරණක් නැතිව වාසය කරව්. ධර්ම​ය පිහිටකොටගෙන, ධර්ම​ය සරණකොටගෙන, අන් සරණක් නැතිව වාසය කරව්.\"\n\n\"මහණෙනි, එහෙත් භික්ෂුවක් කෙසේ නම් තමා පිහිටකොටගෙන, තමා සරණකොටගෙන, අන් සරණක් නැතිව වාසය කරන්නේද? ධර්ම​ය පිහිටකොටගෙන, ධර්ම​ය සරණකොටගෙන, අන් සරණක් නැතිව වාසය කරන්නේද? මහණෙනි, මෙහිලා භික්ෂුවක් කයෙහි කය අනුව දක්නේ කෙලෙස් තවන වීරියෙන් යුක්තව, සිහි නුවණින් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි ඇති දැඩි ආශාවන් සහ දොම්නස් දුරුකරමින් වාසය කරයි. වේදනාවන්හි වේදනා අනුව දක්නේ... සිතෙහි සිත අනුව දක්නේ... ධර්මයන්හි ධර්ම අනුව දක්නේ කෙලෙස් තවන වීරියෙන් යුක්තව, සිහි නුවණින් යුක්තව, සිහියෙන් යුක්තව, ලෝකයෙහි ඇති දැඩි ආශාවන් සහ දොම්නස් දුරුකරමින් වාසය කරයි. මහණෙනි, මෙලෙස භික්ෂුවක් තමා පිහිටකොටගෙන, තමා සරණකොටගෙන, අන් සරණක් නැතිව වාසය කරයි; ධර්ම​ය පිහිටකොටගෙන, ධර්ම​ය සරණකොටගෙන, අන් සරණක් නැතිව වාසය කරයි.\"\n\n\"මහණෙනි, තම ගෝචර භූමියෙහි, තම පාරම්පරික විෂයයෙහි හැසිරෙව්. මහණෙනි, තම ගෝචර භූමියෙහි, තම පාරම්පරික විෂයයෙහි හැසිරෙන අයට මාරයාට අවස්ථාවක් නොලැබේ, මාරයාට අරමුණක් නොලැබේ. මහණෙනි, කුසල ධර්මයන් සමාදන් වීම හේතුවෙන් මෙලෙස මෙම පින වර්ධනය වේ.\"",
      "paliTitle": "Attadīpasaraṇatā",
      "englishTitle": "Self-reliance",
      "sinhalaTitle": "අත්තදීපසරණතා"
    },
    {
      "number": 81,
      "pali": "‘‘Bhūtapubbaṃ, bhikkhave, rājā daḷhanemi nāma ahosi cakkavattī [cakkavatti (syā. pī.)] dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni satta ratanāni ahesuṃ seyyathidaṃ – cakkaratanaṃu hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā ahesuṃ sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ adaṇḍena asatthena dhammena [dhammena samena (syā. ka.)] abhivijiya ajjhāvasi.",
      "english": "\"Once in the past, monks, there was a king named Daḷhanemi, a wheel-turning monarch, a righteous king, a king of Dhamma, a conqueror of the four quarters, who had achieved stability in his country and was endowed with the seven treasures. These were the seven treasures he possessed: the wheel treasure, the elephant treasure, the horse treasure, the jewel treasure, the woman treasure, the treasurer treasure, and the counselor treasure as the seventh. Furthermore, he had more than a thousand sons, heroes, valiant in form, destroyers of the armies of others. He conquered this earth bounded by the sea without force, without weapons, by the Dhamma.\"",
      "sinhala": "භික්‍ෂූණී, පෙර කාලෙක දළ්හනේමි නම් රජෙක් විය. ඔහු සක්විති රජෙක් විය. ධර්මිෂ්ඨ, ධර්මරාජ වූ ඔහු සිව්දිග් විජයග්‍රහණය කළ ජනපදවල ස්ථාවරත්වය ලබා සත් රුවනින් සමන්විත විය. ඔහුට සත් රුවනක් වූහ. එනම්: චක්‍ර රත්නය, හස්ති රත්නය, අශ්ව රත්නය, මණි රත්නය, ස්ත්‍රී රත්නය, ගහපති රත්නය, පරිණායක රත්නය යන සත් වැදෑරුම් රත්නයන්ය. ඔහුට ශූර වීර පෙනුමෙන් යුතු අන්‍ය සේනාවන් මර්දනය කරන දහසකට අධික පුත්‍රයෝ වූහ. ඔහු දණ්ඩෙන් තොරව, අවියෙන් තොරව ධර්මයෙන් මෙම මුළු පොළොව සයුරු කෙළවර දක්වා ජයගෙන වාසය කළේය.",
      "paliTitle": "Daḷhanemicakkavattirājā",
      "englishTitle": "Daḷhanemi, the Wheel-Turning Monarch",
      "sinhalaTitle": "දළ්හනේමිචක්කවත්තිරාජා"
    },
    {
      "number": 82,
      "pali": "‘‘Atha kho, bhikkhave, rājā daḷhanemi bahunnaṃ vassānaṃ bahunnaṃ vassasatānaṃ bahunnaṃ vassasahassānaṃ accayena aññataraṃ purisaṃ āmantesi – ‘yadā tvaṃ, ambho purisa, passeyyāsi dibbaṃ cakkaratanaṃ osakkitaṃ ṭhānā cutaṃ, atha me āroceyyāsī’ti. ‘Evaṃ, devā’ti kho, bhikkhave, so puriso rañño daḷhanemissa paccassosi. Addasā kho, bhikkhave, so puriso bahunnaṃ vassānaṃ bahunnaṃ vassasatānaṃ bahunnaṃ vassasahassānaṃ accayena dibbaṃ cakkaratanaṃ osakkitaṃ ṭhānā cutaṃ, disvāna yena rājā daḷhanemi tenupasaṅkami; upasaṅkamitvā rājānaṃ daḷhanemiṃ etadavoca – ‘yagghe, deva, jāneyyāsi, dibbaṃ te cakkaratanaṃ osakkitaṃ ṭhānā cuta’nti. Atha kho, bhikkhave, rājā daḷhanemi jeṭṭhaputtaṃ kumāraṃ āmantāpetvā [āmantetvā (syā. ka.)] etadavoca – ‘dibbaṃ kira me, tāta kumāra, cakkaratanaṃ osakkitaṃ ṭhānā cutaṃ. Sutaṃ kho pana metaṃ – yassa rañño cakkavattissa dibbaṃ cakkaratanaṃ osakkati ṭhānā cavati, na dāni tena raññā ciraṃ jīvitabbaṃ hotīti. Bhuttā kho pana me mānusakā kāmā, samayo dāni me dibbe kāme pariyesituṃ. Ehi tvaṃ, tāta kumāra, imaṃ samuddapariyantaṃ pathaviṃ paṭipajja. Ahaṃ pana kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajissāmī’ti.",
      "english": "\"Then, bhikkhus, King Daḷhanemi, after the lapse of many years, many hundreds of years, many thousands of years, addressed a certain man: 'When, good man, you should see the divine wheel-jewel receding, fallen from its place, then inform me.' 'Even so, sire,' that man replied to King Daḷhanemi. Then, bhikkhus, that man, after the lapse of many years, many hundreds of years, many thousands of years, saw the divine wheel-jewel receding, fallen from its place. Having seen it, he approached King Daḷhanemi, and having approached, said this to King Daḷhanemi: 'May your majesty know, your divine wheel-jewel is receding, fallen from its place.' Then, bhikkhus, King Daḷhanemi had his eldest son, the prince, summoned and said this: 'It seems, dear prince, that my divine wheel-jewel is receding, fallen from its place. And this has been heard by me: \"For whatever wheel-turning king the divine wheel-jewel recedes, falls from its place, that king does not have long to live.\" Human pleasures have been enjoyed by me, the time has come for me to seek divine pleasures. Come now, dear prince, administer this earth bounded by the sea. But I, having shaved off my hair and beard, having put on saffron robes, will go forth from the house to homelessness.'\"",
      "sinhala": "“මහණෙනි, ඉක්බිති දළ්හනේමි රජ බොහෝ වසර ගණනක්, බොහෝ සියවස් ගණනක්, බොහෝ දහස් වසර ගණනක් ඇවෑමෙන් එක්තරා පුරුෂයෙකු අමතා මෙසේ කීවේය. ‘අම්බෝ පුරුෂය, යම් කලෙක ඔබ දිව්‍යමය චක්‍රරත්නයක් ස්ථානයෙන් චුතව ලිස්සා යනවා දකින්නෙහි නම්, එවිට මට ඒ බව දන්වන්න.’ ‘එසේය දේවයිනි,’ මහණෙනි, ඒ පුරුෂයා දළ්හනේමි රජුට පිළිතුරු දුන්නේය. මහණෙනි, ඒ පුරුෂයා බොහෝ වසර ගණනක්, බොහෝ සියවස් ගණනක්, බොහෝ දහස් වසර ගණනක් ඇවෑමෙන් දිව්‍යමය චක්‍රරත්නයක් ස්ථානයෙන් චුතව ලිස්සා යනවා දුටුවේය. දැක දළ්හනේමි රජු වෙත ගියේය. ගොස් දළ්හනේමි රජුට මෙසේ කීවේය. ‘දේවයිනි, ඔබ දැනගත යුතුයි, ඔබගේ දිව්‍යමය චක්‍රරත්නය ස්ථානයෙන් චුතව ලිස්සා ගොස් ඇත.’ මහණෙනි, ඉක්බිති දළ්හනේමි රජු තම වැඩිමහල් පුත් කුමාරයා කැඳවා මෙසේ කීවේය. ‘පිය පුත්‍ර කුමාරය, මාගේ දිව්‍යමය චක්‍රරත්නය ස්ථානයෙන් චුතව ලිස්සා ගොස් ඇත. යම් සක්විති රජෙකුගේ දිව්‍යමය චක්‍රරත්නයක් ස්ථානයෙන් චුත වී ලිස්සා යන්නේ නම්, ඒ රජු බොහෝ කලක් ජීවත් නොවිය යුතුයි කියා මට අසන්නට ලැබී තිබේ. මම මිනිස් කාමයන් භුක්ති වින්දෙමි, දැන් දිව්‍ය කාමයන් සෙවීමට කාලය එළඹ ඇත. පුත්‍ර කුමාරය, ඔබ මේ මුහුද කෙළවර කොට ඇති පොළොවෙහි රාජ්‍යය පිළිගන්න. මම කෙස් රැවුල් බූ ගා කසාවත් හැඳ ගිහිගෙයින් අනගාරික ජීවිතයකට පැවිදි වන්නෙමි.’",
      "paliTitle": ""
    },
    {
      "number": 83,
      "pali": "‘‘Atha kho, bhikkhave, rājā daḷhanemi jeṭṭhaputtaṃ kumāraṃ sādhukaṃ rajje samanusāsitvā kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbaji. Sattāhapabbajite kho pana, bhikkhave, rājisimhi dibbaṃ cakkaratanaṃ antaradhāyi. ‘‘Atha kho, bhikkhave, aññataro puriso yena rājā khattiyo muddhābhisitto [muddhāvasitto (sī. syā. pī.) evamuparipi] tenupasaṅkami; upasaṅkamitvā rājānaṃ khattiyaṃ muddhābhisittaṃ etadavoca – ‘yagghe, deva, jāneyyāsi, dibbaṃ cakkaratanaṃ antarahita’nti. Atha kho, bhikkhave, rājā khattiyo muddhābhisitto dibbe cakkaratane antarahite anattamano ahosi, anattamanatañca paṭisaṃvedesi. So yena rājisi tenupasaṅkami; upasaṅkamitvā rājisiṃ etadavoca – ‘yagghe, deva, jāneyyāsi, dibbaṃ cakkaratanaṃ antarahita’nti. Evaṃ vutte, bhikkhave, rājisi rājānaṃ khattiyaṃ muddhābhisittaṃ etadavoca – ‘mā kho tvaṃ, tāta, dibbe cakkaratane antarahite anattamano ahosi, mā anattamanatañca paṭisaṃvedesi, na hi te, tāta, dibbaṃ cakkaratanaṃ pettikaṃ dāyajjaṃ. Iṅgha tvaṃ, tāta, ariye cakkavattivatte vattāhi. Ṭhānaṃ kho panetaṃ vijjati, yaṃ te ariye cakkavattivatte vattamānassa tadahuposathe pannarase sīsaṃnhātassa [sīsaṃ nahātassa (sī. pī.), sīsanhātassa (syā.)] uposathikassa uparipāsādavaragatassa dibbaṃ cakkaratanaṃ pātubhavissati sahassāraṃ sanemikaṃ sanābhikaṃ sabbākāraparipūra’nti. ",
      "english": "Then, bhikkhus, King Daḷhanemi properly instructed his eldest son, the prince, in the kingdom, shaved off his hair and beard, put on saffron robes, and went forth from the household life into homelessness. Now, bhikkhus, seven days after the royal ascetic had gone forth, the divine wheel-treasure disappeared. Then, bhikkhus, a certain man approached King, the anointed Khattiya; having approached, he said this to King, the anointed Khattiya: ‘May your majesty know, the divine wheel-treasure has disappeared.’ Then, bhikkhus, when the divine wheel-treasure had disappeared, King, the anointed Khattiya, was displeased, and he felt the displeasure. He approached the royal ascetic; having approached, he said this to the royal ascetic: ‘May your reverence know, the divine wheel-treasure has disappeared.’ When this was said, bhikkhus, the royal ascetic said this to King, the anointed Khattiya: ‘Do not, dear one, be displeased when the divine wheel-treasure has disappeared, and do not feel displeasure; for the divine wheel-treasure is not your paternal inheritance. Go now, dear one, and conduct yourself according to the Ariyan wheel-turning practice. For it is possible that, while you are conducting yourself according to the Ariyan wheel-turning practice, on the fifteenth day, the sabbath day, with your head bathed, keeping the sabbath, having gone up to the upper palace, the divine wheel-treasure will appear to you, with its thousand spokes, with its rim, with its hub, complete in every way.’",
      "sinhala": "‘‘මහණෙනි, ඉක්බිති දළහනේමි රජ තෙමේ සිය කුමරු වූ ජෙට්ඨපුත්‍රයා රාජ්‍යයෙහි මැනවින් අනුශාසනා කොට කෙස් රැවුල් බහා කසාවත් හැඳ ගිහිගෙන් නික්ම අනගාරික බවට පැවිදි විය. මහණෙනි, මෙසේ සතියක් පැවිදිව සිටි රජිසිහුගේ දිව්‍යමය සක්ර රුවන අතුරුදහන් විය. ‘‘මහණෙනි, ඉක්බිති එක් පුරුෂයෙක් රජ වූ ක්ෂත්‍රිය මුර්ධාභිෂේක ලද්දහු වෙත එළඹියේ ය; එළඹ රජ වූ ක්ෂත්‍රිය මුර්ධාභිෂේක ලද්දහුට මෙය කී ය: ‘දේවයන් වහන්ස, ඔබ දැනගත මැනව, දිව්‍යමය සක්ර රුවන අතුරුදන් වී ඇතැ’යි කී ය. මහණෙනි, ඉක්බිති රජ වූ ක්ෂත්‍රිය මුර්ධාභිෂේක ලද්දාහු දිව්‍යමය සක්ර රුවන අතුරුදන් වූ කල්හි අනාත්මභාවයට පැමිණියේ ය, අනාත්මභාවය ද පිළිසන් වේදනාවෙන් වින්දේ ය. හෙතෙම රජිසිහු වෙත එළඹියේ ය; එළඹ රජිසිහුට මෙය කී ය: ‘දේවයන් වහන්ස, ඔබ දැනගත මැනව, දිව්‍යමය සක්ර රුවන අතුරුදන් වී ඇතැ’යි කී ය. මහණෙනි, මෙසේ කී කල්හි රජිසි තෙමේ රජ වූ ක්ෂත්‍රිය මුර්ධාභිෂේක ලද්දහුට මෙය කී ය: ‘පිය රජ, ඔබ දිව්‍යමය සක්ර රුවන අතුරුදන් වූ කල්හි අනාත්මභාවයට නොපැමිණෙන්න, අනාත්මභාවය ද පිළිසන් වේදනාවෙන් නොවින්ද මැනව, පිය රජ, දිව්‍යමය සක්ර රුවන ඔබට පාරම්පරික උරුමයක් නොවේ. එහෙයින් ඔබ ආර්ය චක්‍රවර්ති වෘත්තයෙහි හැසිරෙන්න. ඔබ ආර්ය චක්‍රවර්ති වෘත්තයෙහි හැසිරෙද්දී යම් හෙයකින් පොහෝ දිනයෙහි පසළොස්වක පොහෝ දිනක හිස සෝදා උතුම් ප්‍රාසාදයකට නැඟී උපෝසථ ශීලයෙහි සිටින ඔබට සියක් දාර ඇති නේමි සහිත නාභි සහිත සියලු ආකාරයෙන් පරිපූර්ණ දිව්‍යමය සක්ර රුවන පහළ වන්නේ නම් එය සුදුසුය.’",
      "paliTitle": ""
    },
    {
      "number": 84,
      "pali": "‘‘‘Katamaṃ pana taṃ, deva, ariyaṃ cakkavattivatta’nti? ‘Tena hi tvaṃ, tāta, dhammaṃyeva nissāya dhammaṃ sakkaronto dhammaṃ garuṃ karonto [garukaronto (sī. syā. pī.)] dhammaṃ mānento dhammaṃ pūjento dhammaṃ apacāyamāno dhammaddhajo dhammaketu dhammādhipateyyo dhammikaṃ rakkhāvaraṇaguttiṃ saṃvidahassu antojanasmiṃ balakāyasmiṃ khattiyesu anuyantesu [anuyuttesu (sī. pī.)] brāhmaṇagahapatikesu negamajānapadesu samaṇabrāhmaṇesu migapakkhīsu. Mā ca te, tāta, vijite adhammakāro pavattittha. Ye ca te, tāta, vijite adhanā assu, tesañca dhanamanuppadeyyāsi [dhanamanuppadajjeyyāsi (sī. syā. pī.)]. Ye ca te, tāta, vijite samaṇabrāhmaṇā madappamādā paṭiviratā khantisoracce niviṭṭhā ekamattānaṃ damenti, ekamattānaṃ samenti, ekamattānaṃ parinibbāpenti, te kālena kālaṃ upasaṅkamitvā paripuccheyyāsi pariggaṇheyyāsi – ‘‘kiṃ, bhante, kusalaṃ, kiṃ akusalaṃ, kiṃ sāvajjaṃ, kiṃ anavajjaṃ, kiṃ sevitabbaṃ, kiṃ na sevitabbaṃ, kiṃ me karīyamānaṃ dīgharattaṃ ahitāya dukkhāya assa, kiṃ vā pana me karīyamānaṃ dīgharattaṃ hitāya sukhāya assā’’ti? Tesaṃ sutvā yaṃ akusalaṃ taṃ abhinivajjeyyāsi, yaṃ kusalaṃ taṃ samādāya vatteyyāsi. Idaṃ kho, tāta, taṃ ariyaṃ cakkavattivatta’nti. ",
      "english": "'But what, O god, is that Ariyan Wheel-Turning practice?' 'Then, dear son, relying solely on the Dhamma, honoring the Dhamma, respecting the Dhamma, esteeming the Dhamma, venerating the Dhamma, revering the Dhamma, having the Dhamma as your banner, the Dhamma as your ensign, the Dhamma as your sovereign, you should provide righteous protection, shelter, and guard for your inner people, your armed forces, the nobles, the followers, the brahmins and householders, the town and country dwellers, the ascetics and brahmins, and the beasts and birds. Let no unrighteous conduct prevail in your realm, dear son. And those in your realm, dear son, who are without wealth, you should provide wealth for them. Those ascetics and brahmins in your realm, dear son, who have given up intoxication and negligence, who are devoted to patience and gentleness, who tame just one, calm just one, bring to extinguishment just one: from time to time you should approach them and inquire of them, investigate them: \"What, venerable sirs, is skillful? What is unskillful? What is blameworthy? What is blameless? What should be cultivated? What should not be cultivated? What, if I do it, will be for my long-term harm and suffering? Or what, if I do it, will be for my long-term benefit and happiness?\" Having heard from them, you should abandon what is unskillful, and adopting what is skillful, you should conduct yourself accordingly. This, dear son, is that Ariyan Wheel-Turning practice.'",
      "sinhala": "‘‘දේවය, ආර්‍ය්‍ය වූ චක්‍රවර්ති වෘත්තය නම් කවරේදැ’’යි විචාළේය. ‘‘එසේ නම්, පුත්‍රය, ඔබ ධර්මයම නිශ්‍රය කොට, ධර්මයට සත්කාර කරමින්, ධර්මයට ගරු කරමින්, ධර්මය මනමින්, ධර්මයට පූජා කරමින්, ධර්මය අපචායනය කරමින්, ධර්මය ධ්වජ කොට ඇති, ධර්මය කේතු කොට ඇති, ධර්මය අධිපති කොට ඇති, අන්තඃපුර ජනයා කෙරෙහිද, බළකායෙහිද, රජුන්ට යටත් වැ රාජකාරී කරන අය කෙරෙහිද, බ්‍රාහ්මණ ගෘහපතියන් කෙරෙහිද, නෛගම ජනපද වැසියන් කෙරෙහිද, ශ්‍රමණ බ්‍රාහ්මණයන් කෙරෙහිද, මෘග පක්ෂීන් කෙරෙහිද ධර්මානුකූල ආරක්ෂාවරණයක් සලස්වන්න. පුත්‍රය, ඔබගේ රාජ්‍යයෙහි අධර්මය සිදු නොවිය යුතුය. පුත්‍රය, ඔබගේ රාජ්‍යයෙහි යම් දුගී දුප්පත් අය ඇත්නම්, ඔවුන්ට ධනය ලබා දිය යුතුය. පුත්‍රය, ඔබගේ රාජ්‍යයෙහි යම් ශ්‍රමණ බ්‍රාහ්මණයෝ මද ප්‍රමාද වලින් වැළකී, ඉවසීමෙහි හා මෘදු බවෙහි පිහිටා, තමන්ගේ සිත දමනය කෙරෙත්ද, තමන්ගේ සිත සන්සිඳුවා ගනිත්ද, තමන්ගේ සිත පිරිනිවන් දක්වද්ද, ඔවුන් කලින් කලට එළඹ, විචාළ යුතුය, හොඳින් දැනගත යුතුය. ‘‘ස්වාමීනි, කුසලය කුමක්ද, අකුසලය කුමක්ද, සාවද්‍යය කුමක්ද, අනවද්‍යය කුමක්ද, සේවනය කළ යුත්තේ කුමක්ද, සේවනය නොකළ යුත්තේ කුමක්ද, මා විසින් කරනු ලබන්නේ දීර්ඝ කාලයක් මුළුල්ලෙහි අහිත පිණිස දුක් පිණිස වන්නේ කුමක්ද, නැතහොත් මා විසින් කරනු ලබන්නේ දීර්ඝ කාලයක් මුළුල්ලෙහි හිත පිණිස සැප පිණිස වන්නේ කුමක්දැ’’යි විචාළ යුතුය. ඔවුන්ගේ වචන අසා යමක් අකුසල නම් එය අත්හැරිය යුතුය, යමක් කුසල නම් එය සමාදන්ව පිළිපැදිය යුතුය. පුත්‍රය, මෙය ආර්‍ය්‍ය වූ චක්‍රවර්ති වෘත්තය නමි.’’",
      "paliTitle": "Cakkavattiariyavattaṃ",
      "englishTitle": "The Discourse on the Wheel-Turning Noble Duty",
      "sinhalaTitle": "චක්කවත්ති අරියවත්‌තං"
    },
    {
      "number": 85,
      "pali": "‘‘‘Evaṃ, devā’ti kho, bhikkhave, rājā khattiyo muddhābhisitto rājisissa paṭissutvā ariye cakkavattivatte [ariyaṃ cakkavattivattaṃ (ka.)] vatti. Tassa ariye cakkavattivatte vattamānassa tadahuposathe pannarase sīsaṃnhātassa uposathikassa uparipāsādavaragatassa dibbaṃ cakkaratanaṃ pāturahosi sahassāraṃ sanemikaṃ sanābhikaṃ sabbākāraparipūraṃ. Disvāna rañño khattiyassa muddhābhisittassa etadahosi – ‘sutaṃ kho pana metaṃ – yassa rañño khattiyassa muddhābhisittassa tadahuposathe pannarase sīsaṃnhātassa uposathikassa uparipāsādavaragatassa dibbaṃ cakkaratanaṃ pātubhavati sahassāraṃ sanemikaṃ sanābhikaṃ sabbākāraparipūraṃ, so hoti rājā cakkavattī’ti. Assaṃ nu kho ahaṃ rājā cakkavattīti. ‘‘Atha kho, bhikkhave, rājā khattiyo muddhābhisitto uṭṭhāyāsanā ekaṃsaṃ utarāsaṅgaṃ karitvā vāmena hatthena bhiṅkāraṃ gahetvā dakkhiṇena hatthena cakkaratanaṃ abbhukkiri – ‘pavattatu bhavaṃ cakkaratanaṃ, abhivijinātu bhavaṃ cakkaratana’nti. ‘‘Atha kho taṃ, bhikkhave, cakkaratanaṃ puratthimaṃ disaṃ pavatti, anvadeva rājā cakkavattī saddhiṃ caturaṅginiyā senāya. Yasmiṃ kho pana, bhikkhave, padese cakkaratanaṃ patiṭṭhāsi, tattha rājā cakkavattī vāsaṃ upagacchi saddhiṃ caturaṅginiyā senāya. Ye kho pana, bhikkhave, puratthimāya disāya paṭirājāno, te rājānaṃ cakkavattiṃ upasaṅkamitvā evamāhaṃsu – ‘ehi kho, mahārāja, svāgataṃ te [sāgataṃ (sī. pī.)] mahārāja, sakaṃ te, mahārāja, anusāsa, mahārājā’ti. Rājā cakkavattī evamāha – ‘pāṇo na hantabbo, adinnaṃ nādātabbaṃ, kāmesumicchā na caritabbā, musā na bhāsitabbā, majjaṃ na pātabbaṃ, yathābhuttañca bhuñjathā’ti. Ye kho pana, bhikkhave, puratthimāya disāya paṭirājāno, te rañño cakkavattissa anuyantā [anuyuttā (sī. pī.)] ahesuṃ.",
      "english": "\"Yes, gods,\" the anointed royal king, having promised the royal son, set in motion the Ariyan Wheel-Turning practice. While the Ariyan Wheel-Turning practice was being set in motion by him, on the fifteenth day, the day of the observance, having bathed his head, being one who keeps the observance, having gone to the upper excellent terrace, there appeared to him a divine Wheel-Jewel, with a thousand spokes, with a rim, with a hub, complete in every way. Seeing this, the thought occurred to the anointed royal king: \"I have heard that for whatever anointed royal king, on the fifteenth day, the day of the observance, having bathed his head, being one who keeps the observance, having gone to the upper excellent terrace, there appears a divine Wheel-Jewel, with a thousand spokes, with a rim, with a hub, complete in every way, he is a Wheel-Turning king. Could I be a Wheel-Turning king?\"\n\nThen, the anointed royal king, rising from his seat, arranging his upper robe over one shoulder, taking a water-pouring vessel in his left hand, sprinkled the Wheel-Jewel with his right hand, saying, \"May the Wheel-Jewel proceed, may the Wheel-Jewel conquer.\"\n\nThen, that Wheel-Jewel proceeded to the eastern direction, and the Wheel-Turning king followed right behind with his four-division army. In whatever region the Wheel-Jewel stopped, there the Wheel-Turning king stayed with his four-division army. Those opposing kings in the eastern direction approached the Wheel-Turning king and said, \"Come, great king, welcome, great king, it is yours, great king, instruct, great king.\" The Wheel-Turning king said, \"Life should not be taken, what is not given should not be taken, misconduct in sensual pleasures should not be engaged in, lies should not be spoken, intoxicants should not be drunk, and eat according to what you have.\" Those opposing kings in the eastern direction became followers of the Wheel-Turning king.",
      "sinhala": "‘‘මහණෙනි, රජෙක්, ක්ෂත්‍රිය රජෙක්, මූර්ධභිෂේක ලැබූ රජෙක්, ‘එසේය දෙවියනි’යි කියා රජිස්සට ප්‍රතිඥා දී ආර්ය චක්‍රවර්ති වෘත්තයෙහි හැසිරෙයි. ඔහු ආර්ය චක්‍රවර්ති වෘත්තයෙහි හැසිරෙන කල්හි, ඒ උපෝසථ දිනයෙහි, පසළොස්වක පොහෝ දිනයෙහි, හිස සෝදා ස්නානය කොට, උපෝසථ සමාදන්ව, ප්‍රාසාද මස්තකයට නැගී සිටින කල්හි, දිව්‍යමය චක්‍රරත්නයක් පහළ විය. එය දහසක් අරයන්ගෙන් යුක්ත වූ, නේමි වලින් යුක්ත වූ, නාභියෙන් යුක්ත වූ, සියලු ආකාරයෙන් පරිපූර්ණ වූ රත්නයකි. එය දැක ක්ෂත්‍රිය මූර්ධභිෂේක ලැබූ රජුට මෙබඳු සිතක් ඇති විය. ‘යම් ක්ෂත්‍රිය මූර්ධභිෂේක ලැබූ රජෙක්, උපෝසථ දිනයෙහි, පසළොස්වක පොහෝ දිනයෙහි, හිස සෝදා ස්නානය කොට, උපෝසථ සමාදන්ව, ප්‍රාසාද මස්තකයට නැගී සිටින කල්හි, දහසක් අරයන්ගෙන් යුක්ත වූ, නේමි වලින් යුක්ත වූ, නාභියෙන් යුක්ත වූ, සියලු ආකාරයෙන් පරිපූර්ණ වූ දිව්‍යමය චක්‍රරත්නයක් පහළ වන්නේ නම්, ඔහු චක්‍රවර්ති රජෙක් වන්නේය’ යනු මට අසන්නට ලැබී ඇත. මම චක්‍රවර්ති රජෙක් වන්නෙම්දැ’යි සිතුවේය. ‘‘මහණෙනි, ඉක්බිති ක්ෂත්‍රිය මූර්ධභිෂේක ලැබූ රජ තෙමේ ආසනයෙන් නැගිට එක පැත්තකට උතුරු සළුව පොරවා වම් අතින් භිංකාරය ගෙන දකුණු අතින් චක්‍රරත්නයට ජලය ඉස ‘චක්‍රරත්නය පෙරටු ගමන් කරව, චක්‍රරත්නය ජය ගන්නවා’යි කීවේය. ‘‘මහණෙනි, ඉක්බිති ඒ චක්‍රරත්නය පෙරදිග බලා පෙරටු ගමන් කළේය. චක්‍රවර්ති රජු සතර අඟින් යුත් සේනාව සමග එය අනුව ගියේය. මහණෙනි, යම් ප්‍රදේශයක චක්‍රරත්නය පිහිටියේද, චක්‍රවර්ති රජු සතර අඟින් යුත් සේනාව සමග එහි වාසය කළේය. මහණෙනි, පෙරදිග සිටි ප්‍රතිරාජවරු චක්‍රවර්ති රජු වෙත පැමිණ මෙසේ කීහ. ‘මහ රජ, එන්න, ඔබට සාදරයෙන් පිළිගනිමු. මහරජ, මෙය ඔබ සතුය. මහරජ, අනුශාසනා කරන්න’යි කීහ. චක්‍රවර්ති රජ මෙසේ කීවේය. ‘පණ ඇති සතුන් නොමරන්න, නුදුන් දෙය නොගන්න, කාමයෙහි වරදවා නොයෙදෙන්න, බොරු නොකියන්න, මත්පැන් පානය නොකරන්න, ලැබුණු දෙයින් යථා පරිදි භුක්ති විඳින්න’යි කීවේය. මහණෙනි, පෙරදිග සිටි ප්‍රතිරාජවරු චක්‍රවර්ති රජු අනුව ගියෝ වූහ.",
      "paliTitle": "Cakkaratanapātubhāvo",
      "englishTitle": "Appearance of the Wheel Jewel",
      "sinhalaTitle": "චක්‌කරතනපාතුභාවො"
    },
    {
      "number": 86,
      "pali": "‘‘Atha kho taṃ, bhikkhave, cakkaratanaṃ puratthimaṃ samuddaṃ ajjhogāhetvā [ajjhogahetvā (sī. syā. pī.)] paccuttaritvā dakkhiṇaṃ disaṃ pavatti…pe… dakkhiṇaṃ samuddaṃ ajjhogāhetvā paccuttaritvā pacchimaṃ disaṃ pavatti, anvadeva rājā cakkavattī saddhiṃ caturaṅginiyā senāya. Yasmiṃ kho pana, bhikkhave, padese cakkaratanaṃ patiṭṭhāsi, tattha rājā cakkavattī vāsaṃ upagacchi saddhiṃ caturaṅginiyā senāya. Ye kho pana, bhikkhave, pacchimāya disāya paṭirājāno, te rājānaṃ cakkavattiṃ upasaṅkamitvā evamāhaṃsu – ‘ehi kho, mahārāja, svāgataṃ te, mahārāja, sakaṃ te, mahārāja, anusāsa, mahārājā’ti. Rājā cakkavattī evamāha – ‘pāṇo na hantabbo, adinnaṃ nādātabbaṃ, kāmesumicchā na caritabbā, musā na bhāsitabbā, majjaṃ na pātabbaṃ, yathābhuttañca bhuñjathā’ti. Ye kho pana, bhikkhave, pacchimāya disāya paṭirājāno, te rañño cakkavattissa anuyantā ahesuṃ.",
      "english": "Then, bhikkhus, that wheel-jewel, having plunged into the eastern sea and come out again, proceeded towards the south… …having plunged into the southern sea and come out again, it proceeded towards the west, and King Wheel-Turner followed right after with his four-division army. Now, bhikkhus, in whatever region the wheel-jewel stood, there King Wheel-Turner took up residence together with his four-division army. Then, bhikkhus, those opposing kings in the western direction approached King Wheel-Turner and said thus: ‘Come, great king, welcome to you, great king, it is your own, great king, instruct us, great king.’ King Wheel-Turner said thus: ‘Living beings must not be killed, what is not given must not be taken, misconduct in sensual pleasures must not be engaged in, falsehood must not be spoken, intoxicants must not be drunk, and eat according to what is rightfully yours.’ Then, bhikkhus, those opposing kings in the western direction became followers of King Wheel-Turner.",
      "sinhala": "‘‘ඉක්බිතිව, මහණෙනි, ඒ චක්‍රරත්නය නැගෙනහිර මුහුදට බැස නැවත ගොඩට පැමිණ දකුණු දිශාවට පැවතුණේය. ...පෙ... දකුණු මුහුදට බැස නැවත ගොඩට පැමිණ බටහිර දිශාවට පැවතුණේය. සක්විති රජු සතර අංගයන්ගෙන් යුත් සේනාව සමඟ එය අනුවම ගියේය. මහණෙනි, යම් ප්‍රදේශයක චක්‍රරත්නය පිහිටියේද, එහි සක්විති රජු සතර අංගයන්ගෙන් යුත් සේනාව සමඟ වාසය කළේය. මහණෙනි, යම් බටහිර දිශාවක ප්‍රතිරාජවරු සිටියාහුද, ඒ රජවරු සක්විති රජු වෙත එළඹ මෙසේ කීහ: ‘මහරජ, එන්න, ඔබ වෙත සාදරයෙන් පිළිගැනීමක් වේවා. මහරජ, මේ ඔබ සතුය. මහරජ, අනුශාසනා කරන්න’ කියායි. සක්විති රජ මෙසේ කීවේය: ‘පණ ඇති කිසිවෙකු නොමරන්න. නුදුන් දෙය නොගන්න. කාමයන්හි වරදවා නොයෙදෙන්න. බොරු නොකියන්න. මත්පැන් නොබොන්න. ලැබුණු දෙයින් සැපසේ අනුභව කරන්න’ කියායි. මහණෙනි, යම් බටහිර දිශාවක ප්‍රතිරාජවරු සිටියාහුද, ඔවුහු සක්විති රජුගේ අනුගාමිකයෝ වූහ.",
      "paliTitle": ""
    },
    {
      "number": 87,
      "pali": "‘‘Atha kho taṃ, bhikkhave, cakkaratanaṃ pacchimaṃ samuddaṃ ajjhogāhetvā paccuttaritvā uttaraṃ disaṃ pavatti, anvadeva rājā cakkavattī saddhiṃ caturaṅginiyā senāya. Yasmiṃ kho pana, bhikkhave, padese cakkaratanaṃ patiṭṭhāsi, tattha rājā cakkavattī vāsaṃ upagacchi saddhiṃ caturaṅginiyā senāya. Ye kho pana, bhikkhave, uttarāya disāya paṭirājāno, te rājānaṃ cakkavattiṃ upasaṅkamitvā evamāhaṃsu – ‘ehi kho, mahārāja, svāgataṃ te, mahārāja, sakaṃ te, mahārāja, anusāsa, mahārājā’ti. Rājā cakkavattī evamāha – ‘pāṇo na hantabbo, adinnaṃ nādātabbaṃ, kāmesumicchā na caritabbā, musā na bhāsitabbā, majjaṃ na pātabbaṃ, yathābhuttañca bhuñjathā’ti. Ye kho pana, bhikkhave, uttarāya disāya paṭirājāno, te rañño cakkavattissa anuyantā ahesuṃ. ‘‘Atha kho taṃ, bhikkhave, cakkaratanaṃ samuddapariyantaṃ pathaviṃ abhivijinitvā tameva rājadhāniṃ paccāgantvā rañño cakkavattissa antepuradvāre atthakaraṇapamukhe [aḍḍakaraṇapamukhe (ka.)] akkhāhataṃ maññe aṭṭhāsi rañño cakkavattissa antepuraṃ upasobhayamānaṃ.",
      "english": "\"Then, bhikkhus, that wheel-treasure plunged into the western sea, rose up again, and proceeded towards the northern direction, and the wheel-turning monarch followed right along with his fourfold army. And, bhikkhus, in whatever region the wheel-treasure stopped, there the wheel-turning monarch took up residence together with his fourfold army. And, bhikkhus, whatever opposing rulers there were in the northern direction, those rulers approached the wheel-turning monarch and spoke thus: ‘Come, Your Majesty, welcome to you, Your Majesty, this is your own, Your Majesty, instruct us, Your Majesty.’ The wheel-turning monarch spoke thus: ‘Life is not to be destroyed, what is not given is not to be taken, misconduct in sexual pleasures is not to be practiced, falsehood is not to be spoken, intoxicants are not to be drunk, and eat according to what is proper.’ And, bhikkhus, whatever opposing rulers there were in the northern direction, they became followers of the wheel-turning monarch. Then, bhikkhus, that wheel-treasure, having completely conquered the earth as far as the ocean's boundary, returned to that very capital city and, I think, stood fixed at the main gate for settling disputes of the wheel-turning monarch, illuminating the inner chambers of the wheel-turning monarch.\"",
      "sinhala": "‘‘ඉක්බිති භික්‍ෂූණෙනි, ඒ චක්‍රරත්නය බටහිර මුහුදට බැස නැවත නැඟී උතුරු දිශාවට පැවතුණේය. සක්විති රජ්ජුරුවෝ සතර අඟින් යුත් සේනාව සමඟ එය අනුව ගියහ. භික්‍ෂූණෙනි, යම් ප්‍රදේශයක චක්‍රරත්නය පිහිටියේ ද, සක්විති රජ්ජුරුවෝ සතර අඟින් යුත් සේනාව සමඟ එහි වාසය කළහ. භික්‍ෂූණෙනි, උතුරු දිශාවේ යම් ප්‍රතිරාජවරු වූවෝ ද, ඔවුහු සක්විති රජු වෙත එළඹ මෙසේ කීහ. ‘මහරජ, එන්න, මහරජ, ඔබට සාදරයෙන් පිළිගනිමු. මහරජ, මේ ඔබ සතුය. මහරජ, අනුශාසනා කරන්න, මහරජාණෙනි.’ සක්විති රජ්ජුරුවෝ මෙසේ කීහ. ‘ප්‍රාණඝාත නොකළ යුතුයි. නුදුන් දෙය නොගත යුතුයි. කාමයන්හි වරදවා නොහැසිරිය යුතුයි. බොරු නොකිය යුතුයි. මත්පැන් නොගත යුතුයි. ලැබුණු දෙයින් සැපසේ වළඳන්න.’ භික්‍ෂූණෙනි, උතුරු දිශාවේ යම් ප්‍රතිරාජවරු වූවෝ ද, ඔවුහු සක්විති රජු අනුව යන්නෝ වූහ. ඉක්බිති භික්‍ෂූණෙනි, ඒ චක්‍රරත්නය මුහුද කෙළවර වූ පොළොව ජයගෙන ඒ රජ මාළිගාවටම නැවත පැමිණ රජුගේ අන්තඃපුර ද්වාරයෙහි අක්ෂය තබා තිබෙන්නාක් මෙන් රජුගේ අන්තඃපුරය බබළවමින් සිටියේය.",
      "paliTitle": ""
    },
    {
      "number": 88,
      "pali": "‘‘Dutiyopi kho, bhikkhave, rājā cakkavattī…pe… tatiyopi kho, bhikkhave, rājā cakkavattī… catutthopi kho, bhikkhave, rājā cakkavattī… pañcamopi kho, bhikkhave, rājā cakkavattī… chaṭṭhopi kho, bhikkhave, rājā cakkavattī… sattamopi kho, bhikkhave, rājā cakkavattī bahunnaṃ vassānaṃ bahunnaṃ vassasatānaṃ bahunnaṃ vassasahassānaṃ accayena aññataraṃ purisaṃ āmantesi – ‘yadā tvaṃ, ambho purisa, passeyyāsi dibbaṃ cakkaratanaṃ osakkitaṃ ṭhānā cutaṃ, atha me āroceyyāsī’ti. ‘Evaṃ, devā’ti kho, bhikkhave, so puriso rañño cakkavattissa paccassosi. Addasā kho, bhikkhave, so puriso bahunnaṃ vassānaṃ bahunnaṃ vassasatānaṃ bahunnaṃ vassasahassānaṃ accayena dibbaṃ cakkaratanaṃ osakkitaṃ ṭhānā cutaṃ. Disvāna yena rājā cakkavattī tenupasaṅkami; upasaṅkamitvā rājānaṃ cakkavattiṃ etadavoca – ‘yagghe, deva, jāneyyāsi, dibbaṃ te cakkaratanaṃ osakkitaṃ ṭhānā cuta’nti?",
      "english": "\"Again, monks, the wheel-turning monarch... again, monks, the third wheel-turning monarch... again, monks, the fourth wheel-turning monarch... again, monks, the fifth wheel-turning monarch... again, monks, the sixth wheel-turning monarch... again, monks, the seventh wheel-turning monarch, after the lapse of many years, many hundreds of years, many thousands of years, addressed a certain man: ‘When, good man, you see the divine wheel-treasure receding, falling from its place, then inform me.’ ‘Yes, lord,’ that man replied to the wheel-turning monarch. Then, monks, that man, after the lapse of many years, many hundreds of years, many thousands of years, saw the divine wheel-treasure receding, falling from its place. Having seen it, he approached the wheel-turning monarch and said to him: ‘May your majesty know that your divine wheel-treasure is receding, falling from its place.’\"",
      "sinhala": "‘‘මහණෙනි, දෙවනුව ද සක්විති රජෙක්...මහණෙනි, තෙවනුව ද සක්විති රජෙක්… මහණෙනි, සතරවනුව ද සක්විති රජෙක්… මහණෙනි, පස්වනුව ද සක්විති රජෙක්… මහණෙනි, සවනුව ද සක්විති රජෙක්… මහණෙනි, සත්වනුව ද සක්විති රජෙක් බොහෝ වසර ගණනක් ඇවෑමෙන්, බොහෝ සියවස ගණනක් ඇවෑමෙන්, බොහෝ දහස් වසර ගණනක් ඇවෑමෙන් එක්තරා පුරුෂයෙකු අමතා මෙසේ කීවේ ය. ‘අහෝ පුරුෂය, යම් කලෙක ඔබ දිව්‍යමය සක්කරත්නය ගිය තැනින් පහව ගැලවී ගියා දකී නම්, එවිට මට දන්වව’යි කීවේ ය. ‘එසේ ය දේවයිනි’යි මහණෙනි, ඒ පුරුෂයා සක්විති රජුට පිළිවදන් දුන්නේ ය. මහණෙනි, ඒ පුරුෂයා බොහෝ වසර ගණනක් ඇවෑමෙන්, බොහෝ සියවස ගණනක් ඇවෑමෙන්, බොහෝ දහස් වසර ගණනක් ඇවෑමෙන් දිව්‍යමය සක්කරත්නය ගිය තැනින් පහව ගැලවී ගිය බව දුටුවේ ය. දැක සක්විති රජු යම් තැනක ද එතැනට පැමිණියේ ය. පැමිණ සක්විති රජුට මෙය පැවසී ය. ‘දේවයිනි, ඔබ දැනගත මැනවි. ඔබගේ දිව්‍යමය සක්කරත්නය ගිය තැනින් පහව ගැලවී ගියේ ය’යි කී ය.",
      "paliTitle": "Dutiyādicakkavattikathā",
      "englishTitle": "The Second Discourse on the Wheel-Turning King",
      "sinhalaTitle": "දෙ‍්‍වතිය ආදිචක‍්කවත්‍තිකථා"
    },
    {
      "number": 89,
      "pali": "‘‘Atha kho, bhikkhave, rājā cakkavattī jeṭṭhaputtaṃ kumāraṃ āmantāpetvā etadavoca – ‘dibbaṃ kira me, tāta kumāra, cakkaratanaṃ osakkitaṃ, ṭhānā cutaṃ, sutaṃ kho pana metaṃ – yassa rañño cakkavattissa dibbaṃ cakkaratanaṃ osakkati, ṭhānā cavati, na dāni tena raññā ciraṃ jīvitabbaṃ hotīti. Bhuttā kho pana me mānusakā kāmā, samayo dāni me dibbe kāme pariyesituṃ, ehi tvaṃ, tāta kumāra, imaṃ samuddapariyantaṃ pathaviṃ paṭipajja. Ahaṃ pana kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajissāmī’ti. ‘‘Atha kho, bhikkhave, rājā cakkavattī jeṭṭhaputtaṃ kumāraṃ sādhukaṃ rajje samanusāsitvā kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbaji. Sattāhapabbajite kho pana, bhikkhave, rājisimhi dibbaṃ cakkaratanaṃ antaradhāyi.",
      "english": "\"Then, bhikkhus, the wheel-turning monarch summoned his eldest son and said to him: ‘It seems, dear prince, that my divine wheel-treasure has receded, has moved from its place. And I have heard it said that when the divine wheel-treasure of a wheel-turning monarch recedes, moves from its place, that monarch does not have long to live. I have enjoyed human pleasures, and now it is time for me to seek divine pleasures. Come, dear prince, administer this earth bounded by the ocean. I, however, will shave off my hair and beard, put on saffron robes, and go forth from the house life into homelessness.’\"\n\n\"Then, bhikkhus, the wheel-turning monarch carefully instructed his eldest son in the kingdom, shaved off his hair and beard, put on saffron robes, and went forth from the house life into homelessness. When the royal sage had gone forth for a week, bhikkhus, the divine wheel-treasure disappeared.\"",
      "sinhala": "‘‘ඉක්බිති භික්‍ෂූන්‌ලා, සක්‌විති රජ තෙමේ වැඩිමහලු කුමරු කැඳවා මෙසේ කීයේය. ‘පින්වත් කුමරු, මාගේ දිව්‍යමය සක්‌රත්න රථය ලිහිල් වී ගිලිහී, තැනින් චුත වූ සැටියකි. යම් සක්‌විති රජෙකුගේ දිව්‍යමය සක්‌රත්න රථය ලිහිල් වී ගිලිහී, තැනින් චුත වේ නම්, ඒ රජු බොහෝ කල් ජීවත් නොවිය යුතු යයි මවිසින් අසන ලදී. මවිසින් මනුෂ්‍ය කාමයන් වළඳන ලදී. දැන් මා හට දිව්‍ය කාමයන් සෙවීමට කාලයයි. එම්බල පුත්‍රය, ඔබ මේ සමුද්‍රාන්තයෙහි පවතින පොළොවෙහි රජය පිළිගන්න. මම කෙස් රැවුල් බහා කසාවන් වස්ත්‍ර පොරවා ගිහිගෙයින් නික්‌ම අනගාරික ජීවිතයට පැවිදි වන්නෙමි’ කියායි. ‘‘ඉක්බිති භික්‍ෂූන්‌ලා, සක්‌විති රජ තෙමේ වැඩිමහලු කුමරු මැනවින් රාජ්‍යයෙහි අනුශාසනා කොට කෙස් රැවුල් බහා කසාවන් වස්ත්‍ර පොරවා ගිහිගෙයින් නික්‌ම අනගාරික ජීවිතයට පැවිදි විය. භික්‍ෂූන්‌ලා, රජ ඍෂිවරයා පැවිදි වී සතියක් ගත වූ පසු දිව්‍යමය සක්‌රත්න රථය අතුරුදහන් විය.",
      "paliTitle": ""
    },
    {
      "number": 90,
      "pali": "‘‘Atha kho, bhikkhave, aññataro puriso yena rājā khattiyo muddhābhisitto tenupasaṅkami; upasaṅkamitvā rājānaṃ khattiyaṃ muddhābhisittaṃ etadavoca – ‘yagghe, deva, jāneyyāsi, dibbaṃ cakkaratanaṃ antarahita’nti? Atha kho, bhikkhave, rājā khattiyo muddhābhisitto dibbe cakkaratane antarahite anattamano ahosi. Anattamanatañca paṭisaṃvedesi; no ca kho rājisiṃ upasaṅkamitvā ariyaṃ cakkavattivattaṃ pucchi. So samateneva sudaṃ janapadaṃ pasāsati. Tassa samatena janapadaṃ pasāsato pubbenāparaṃ janapadā na pabbanti, yathā taṃ pubbakānaṃ rājūnaṃ ariye cakkavattivatte vattamānānaṃ. ‘‘Atha kho, bhikkhave, amaccā pārisajjā gaṇakamahāmattā anīkaṭṭhā dovārikā mantassājīvino sannipatitvā rājānaṃ khattiyaṃ muddhābhisittaṃ etadavocuṃ – ‘na kho te, deva, samatena (sudaṃ) janapadaṃ pasāsato pubbenāparaṃ janapadā pabbanti, yathā taṃ pubbakānaṃ rājūnaṃ ariye cakkavattivatte vattamānānaṃ. Saṃvijjanti kho te, deva, vijite amaccā pārisajjā gaṇakamahāmattā anīkaṭṭhā dovārikā mantassājīvino mayañceva aññe ca [aññe ca paṇḍite samaṇabrāhmaṇe puccheyyāsi (ka.)] ye mayaṃ ariyaṃ cakkavattivattaṃ dhārema. Iṅgha tvaṃ, deva, amhe ariyaṃ cakkavattivattaṃ puccha. Tassa te mayaṃ ariyaṃ cakkavattivattaṃ puṭṭhā byākarissāmā’ti.",
      "english": "Then, bhikkhus, a certain man approached a crowned and anointed noble king and said this to him: ‘May your majesty know, the divine wheel-treasure has disappeared.’ Then, bhikkhus, the crowned and anointed noble king, with the disappearance of the divine wheel-treasure, became unhappy. He experienced unhappiness, but he did not approach a royal sage to ask about the noble wheel-turning ordinance. He just ruled the country by evenhandedness. Because he ruled the country by evenhandedness, the country did not prosper as it had formerly done, as it had for former kings who followed the noble wheel-turning ordinance. Then, bhikkhus, his ministers, courtiers, accountants, high officials, troops, gatekeepers, and those living by counsel, gathered together and said this to the crowned and anointed noble king: ‘Your majesty, because you are ruling the country by evenhandedness, the country does not prosper as it had formerly done, as it had for former kings who followed the noble wheel-turning ordinance. However, your majesty, there exist in your realm ministers, courtiers, accountants, high officials, troops, gatekeepers, and those living by counsel, both ourselves and others, who remember the noble wheel-turning ordinance. Your majesty, you should ask us about the noble wheel-turning ordinance. When asked, we will explain the noble wheel-turning ordinance to you.’",
      "sinhala": "‘‘මහණෙනි, අනතුරුව එක්තරා පුරුෂයෙක් රජ වූ ක්ෂත්‍රිය, මූර්ධාභිෂේක ලද්දාවූ රජු වෙත පැමිණියේය. පැමිණ රජ වූ ක්ෂත්‍රිය, මූර්ධාභිෂේක ලද්දාවූ රජුට මෙය කීවේය. ‘දේවයන් වහන්ස, ඔබ දැනගත මැනව. දිව්‍යමය චක්‍රරත්නය අතුරුදහන් විය’ කියායි. මහණෙනි, අනතුරුව රජ වූ ක්ෂත්‍රිය, මූර්ධාභිෂේක ලද්දාවූ රජු දිව්‍යමය චක්‍රරත්නය අතුරුදහන් වූ කල්හි සතුටු නොවූයේය. සතුටු නොවීමක් ද අත්දැක්කේය. එහෙත් ආර්ය චක්‍රවර්ති වෘත්තය රජිසිවරුන් වෙත එළඹ විමසුවේ නැත. හෙතෙම සාමයෙන් පමණක් ජනපදය පාලනය කරයි. ඔහුගේ සාමයෙන් ජනපදය පාලනය කිරීමෙන් පළමුව මෙන් පසු කලක ජනපද දියුණු නොවෙයි. යම්සේ ඒ පළමු රජවරුන්ගේ ආර්ය චක්‍රවර්ති වෘත්තයෙහි හැසිරෙන්නන්ගේ සිදුවූ පරිද්දෙන්ද එසේමයි. මහණෙනි, අනතුරුව ඇමතියෝ ද පිරිස් ද ගණකාධිකාරී මහ ඇමතියෝ ද සේනා සංවිධායකයෝ ද දොරටුපාලකයෝ ද මන්ත්‍රීන් වශයෙන් ජීවත්වන්නෝ ද රැස්ව රජ වූ ක්ෂත්‍රිය, මූර්ධාභිෂේක ලද්දාවූ රජුට මෙය කීවෝය. ‘දේවයන් වහන්ස, ඔබගේ සාමයෙන් ජනපදය පාලනය කිරීමෙන් පළමුව මෙන් පසු කලක ජනපද දියුණු නොවෙයි. යම්සේ ඒ පළමු රජවරුන්ගේ ආර්ය චක්‍රවර්ති වෘත්තයෙහි හැසිරෙන්නන්ගේ සිදුවූ පරිද්දෙන්ද එසේමයි. දේවයන් වහන්ස, ඔබගේ රාජ්‍යයෙහි ඇමතියෝ ද පිරිස් ද ගණකාධිකාරී මහ ඇමතියෝ ද සේනා සංවිධායකයෝ ද දොරටුපාලකයෝ ද මන්ත්‍රීන් වශයෙන් ජීවත්වන්නෝ ද අපි ද වෙමු. අන්‍යයෝ ද වෙති. [අන්‍ය වූ නුවණැති ශ්‍රමණ බ්‍රාහ්මණයන්ගෙන් විමසිය යුතුය (ක.)] අපි යම් ආර්ය චක්‍රවර්ති වෘත්තයක් දරම් ද, එහෙයින් දේවයන් වහන්ස, ඔබ අපෙන් ආර්ය චක්‍රවර්ති වෘත්තය විමසන්න. ඔබ විසින් අපෙන් ආර්ය චක්‍රවර්ති වෘත්තය විමසන ලදුව අපි එය ව්‍යාකරණය කරන්නෙමු’ කියායි.",
      "paliTitle": ""
    },
    {
      "number": 91,
      "pali": "‘‘Atha kho, bhikkhave, rājā khattiyo muddhābhisitto amacce pārisajje gaṇakamahāmatte anīkaṭṭhe dovārike mantassājīvino sannipātetvā ariyaṃ cakkavattivattaṃ pucchi. Tassa te ariyaṃ cakkavattivattaṃ puṭṭhā byākariṃsu. Tesaṃ sutvā dhammikañhi kho rakkhāvaraṇaguttiṃ saṃvidahi, no ca kho adhanānaṃ dhanamanuppadāsi. Adhanānaṃ dhane ananuppadiyamāne dāliddiyaṃ vepullamagamāsi. Dāliddiye vepullaṃ gate aññataro puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyi. Tamenaṃ aggahesuṃ. Gahetvā rañño khattiyassa muddhābhisittassa dassesuṃ – ‘ayaṃ, deva, puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti. Evaṃ vutte, bhikkhave, rājā khattiyo muddhābhisitto taṃ purisaṃ etadavoca – ‘saccaṃ kira tvaṃ, ambho purisa, paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti [ādiyasīti (syā.)]? ‘Saccaṃ, devā’ti. ‘Kiṃ kāraṇā’ti? ‘Na hi, deva, jīvāmī’ti. Atha kho, bhikkhave, rājā khattiyo muddhābhisitto tassa purisassa dhanamanuppadāsi – ‘iminā tvaṃ, ambho purisa, dhanena attanā ca jīvāhi, mātāpitaro ca posehi, puttadārañca posehi, kammante ca payojehi, samaṇabrāhmaṇesu [samaṇesu brāhmaṇesu (bahūsu)] uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpehi sovaggikaṃ sukhavipākaṃ saggasaṃvattanika’nti. ‘Evaṃ, devā’ti kho, bhikkhave, so puriso rañño khattiyassa muddhābhisittassa paccassosi. ‘‘Aññataropi kho, bhikkhave, puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyi. Tamenaṃ aggahesuṃ. Gahetvā rañño khattiyassa muddhābhisittassa dassesuṃ – ‘ayaṃ, deva, puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti. Evaṃ vutte, bhikkhave, rājā khattiyo muddhābhisitto taṃ purisaṃ etadavoca – ‘saccaṃ kira tvaṃ, ambho purisa, paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti? ‘Saccaṃ, devā’ti. ‘Kiṃ kāraṇā’ti? ‘Na hi, deva, jīvāmī’ti. Atha kho, bhikkhave, rājā khattiyo muddhābhisitto tassa purisassa dhanamanuppadāsi – ‘iminā tvaṃ, ambho purisa, dhanena attanā ca jīvāhi, mātāpitaro ca posehi, puttadārañca posehi, kammante ca payojehi, samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpehi sovaggikaṃ sukhavipākaṃ saggasaṃvattanika’nti. ‘Evaṃ, devā’ti kho, bhikkhave, so puriso rañño khattiyassa muddhābhisittassa paccassosi.",
      "english": "Then, monks, the anointed king, the warrior, summoned his ministers, courtiers, accountants, chief officers, doorkeepers, and those who lived by counsel, and inquired about the Ariyan Wheel-Turning Duty. They, when asked about the Ariyan Wheel-Turning Duty, explained it. Having heard them, he provided righteous protection, shelter, and security, but he did not provide wealth to the poor. Because wealth was not provided to the poor, poverty became widespread. When poverty became widespread, a certain man took what was not given, known as theft. They arrested him. Having arrested him, they showed him to the anointed king, the warrior: 'This man, your majesty, has taken what was not given, known as theft.' When this was said, monks, the anointed king, the warrior, said this to that man: 'Is it true, good man, that you took what was not given, known as theft?' 'It is true, your majesty.' 'Why?' 'Because, your majesty, I do not live.' Then, monks, the anointed king, the warrior, provided wealth to that man: 'With this wealth, good man, may you live yourself, support your mother and father, support your children and wife, engage in work, and establish an uplifting offering to contemplatives and brahmins, with heavenly results, ripening in happiness, leading to heaven.' 'So be it, your majesty,' monks, that man replied to the anointed king, the warrior. Again, monks, a certain man took what was not given, known as theft. They arrested him. Having arrested him, they showed him to the anointed king, the warrior: 'This man, your majesty, has taken what was not given, known as theft.' When this was said, monks, the anointed king, the warrior, said this to that man: 'Is it true, good man, that you took what was not given, known as theft?' 'It is true, your majesty.' 'Why?' 'Because, your majesty, I do not live.' Then, monks, the anointed king, the warrior, provided wealth to that man: 'With this wealth, good man, may you live yourself, support your mother and father, support your children and wife, engage in work, and establish an uplifting offering to contemplatives and brahmins, with heavenly results, ripening in happiness, leading to heaven.' 'So be it, your majesty,' monks, that man replied to the anointed king, the warrior.",
      "sinhala": "‘‘මහණෙනි, එකල්හි මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජතෙමේ ඇමතියන්, පිරිස්වල සභිකයන්, ගණකාධිකාරි මහාමාත්‍යයන්, සේනා සංවිධායකයන්, ද්වාරපාලකයන්, මන්ත්‍රීන් හා උපදේශකයන් රැස් කරවා ආර්ය චක්‍රවර්ති වෘත්තය විචාළේය. ඔහු විසින් විචාරනු ලැබූ ඔවුන් ආර්ය චක්‍රවර්ති වෘත්තය පැහැදිලි කළහ. ඔවුන්ගේ වචන අසා ධර්මානුකූල ආරක්ෂාව, වැටකෙළිය හා ආරක්ෂක විධිවිධාන සැලසුවේය. එහෙත් දුප්පතුන්ට ධනය නොදුන්නේය. දුප්පතුන්ට ධනය නොදීම හේතුවෙන් දරිද්‍රතාවය වැඩි විය. දරිද්‍රතාවය වැඩි වූ කල්හි එක් පුරුෂයෙක් අනුන් විසින් නොදෙන ලද්දක් සොරකම් කිරීමක් වශයෙන් ගත්තේය. ඔහු අල්ලා ගන්නා ලදී. අල්ලා ගෙන මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජුට පෙන්වූහ. ‘දේවයන් වහන්ස, මේ පුරුෂයා අනුන් විසින් නොදෙන ලද්දක් සොරකම් කිරීමක් වශයෙන් ගත්තේය’යි දැන්වූහ. මහණෙනි, මෙසේ කී කල්හි මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජතෙමේ ඒ පුරුෂයාට මෙසේ කීවේය. ‘අහෝ පුරුෂය, ඔබ අනුන් විසින් නොදෙන ලද්දක් සොරකම් කිරීමක් වශයෙන් ගත්තා දැ’යි ඇසීය. ‘එසේය දේවයෙනි’යි කීවේය. ‘ඒ කුමන හේතුවක් නිසාදැ’යි ඇසීය. ‘දේවයෙනි, මම ජීවත් නොවෙමි’යි කීවේය. මහණෙනි, එකල්හි මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජතෙමේ ඒ පුරුෂයාට ධනයක් දුන්නේය. ‘අහෝ පුරුෂය, ඔබ මේ ධනයෙන් ඔබද ජීවත් වන්න. මව්පියන්ද පෝෂණය කරන්න. භාර්යාව හා දරුවන්ද පෝෂණය කරන්න. කර්මාන්තවලද යොදවන්න. ශ්‍රමණ බ්‍රාහ්මණයන් කෙරෙහි උසස් වූ දක්ෂිණාව ස්වර්ගයට හේතුවන සැප විපාක ඇති ස්වර්ග සම්පත්තිය පිණිස පිහිටුවන්න’යි කීවේය. ‘එසේය දේවයෙනි’යි මහණෙනි, ඒ පුරුෂයා මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජුට පිළිතුරු දුන්නේය.\n\n‘‘මහණෙනි, තවත් පුරුෂයෙක් අනුන් විසින් නොදෙන ලද්දක් සොරකම් කිරීමක් වශයෙන් ගත්තේය. ඔහු අල්ලා ගන්නා ලදී. අල්ලා ගෙන මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජුට පෙන්වූහ. ‘දේවයන් වහන්ස, මේ පුරුෂයා අනුන් විසින් නොදෙන ලද්දක් සොරකම් කිරීමක් වශයෙන් ගත්තේය’යි දැන්වූහ. මහණෙනි, මෙසේ කී කල්හි මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජතෙමේ ඒ පුරුෂයාට මෙසේ කීවේය. ‘අහෝ පුරුෂය, ඔබ අනුන් විසින් නොදෙන ලද්දක් සොරකම් කිරීමක් වශයෙන් ගත්තා දැ’යි ඇසීය. ‘එසේය දේවයෙනි’යි කීවේය. ‘ඒ කුමන හේතුවක් නිසාදැ’යි ඇසීය. ‘දේවයෙනි, මම ජීවත් නොවෙමි’යි කීවේය. මහණෙනි, එකල්හි මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජතෙමේ ඒ පුරුෂයාට ධනයක් දුන්නේය. ‘අහෝ පුරුෂය, ඔබ මේ ධනයෙන් ඔබද ජීවත් වන්න. මව්පියන්ද පෝෂණය කරන්න. භාර්යාව හා දරුවන්ද පෝෂණය කරන්න. කර්මාන්තවලද යොදවන්න. ශ්‍රමණ බ්‍රාහ්මණයන් කෙරෙහි උසස් වූ දක්ෂිණාව ස්වර්ගයට හේතුවන සැප විපාක ඇති ස්වර්ග සම්පත්තිය පිණිස පිහිටුවන්න’යි කීවේය. ‘එසේය දේවයෙනි’යි මහණෙනි, ඒ පුරුෂයා මෞලිභිෂේක ලැබූ ක්ෂත්‍රිය රජුට පිළිතුරු දුන්නේය.",
      "paliTitle": "Āyuvaṇṇādipariyānikathā",
      "englishTitle": "Discourse on the Decline of Life, Beauty, etc.",
      "sinhalaTitle": "ආයුවණ්ණාදිපරියානිකථා"
    },
    {
      "number": 92,
      "pali": "‘‘Assosuṃ kho, bhikkhave, manussā – ‘ye kira, bho, paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyanti, tesaṃ rājā dhanamanuppadetī’ti. Sutvāna tesaṃ etadahosi – ‘yaṃnūna mayampi paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyeyyāmā’ti. Atha kho, bhikkhave, aññataro puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyi. Tamenaṃ aggahesuṃ. Gahetvā rañño khattiyassa muddhābhisittassa dassesuṃ – ‘ayaṃ, deva, puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti. Evaṃ vutte, bhikkhave, rājā khattiyo muddhābhisitto taṃ purisaṃ etadavoca – ‘saccaṃ kira tvaṃ, ambho purisa, paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti? ‘Saccaṃ, devā’ti. ‘Kiṃ kāraṇā’ti? ‘Na hi, deva, jīvāmī’ti. Atha kho, bhikkhave, rañño khattiyassa muddhābhisittassa etadahosi – ‘sace kho ahaṃ yo yo paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyissati, tassa tassa dhanamanuppadassāmi, evamidaṃ adinnādānaṃ pavaḍḍhissati. Yaṃnūnāhaṃ imaṃ purisaṃ sunisedhaṃ nisedheyyaṃ, mūlaghaccaṃ [mūlaghacchaṃ (syā.), mūlachejja (ka.)] kareyyaṃ, sīsamassa chindeyya’nti. Atha kho, bhikkhave, rājā khattiyo muddhābhisitto purise āṇāpesi – ‘tena hi, bhaṇe, imaṃ purisaṃ daḷhāya rajjuyā pacchābāhaṃ [pacchābāhuṃ (syā.)] gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhamitvā dakkhiṇato nagarassa sunisedhaṃ nisedhetha, mūlaghaccaṃ karotha, sīsamassa chindathā’ti. ‘Evaṃ, devā’ti kho, bhikkhave, te purisā rañño khattiyassa muddhābhisittassa paṭissutvā taṃ purisaṃ daḷhāya rajjuyā pacchābāhaṃ gāḷhabandhanaṃ bandhitvā khuramuṇḍaṃ karitvā kharassarena paṇavena rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ parinetvā dakkhiṇena dvārena nikkhamitvā dakkhiṇato nagarassa sunisedhaṃ nisedhesuṃ, mūlaghaccaṃ akaṃsu, sīsamassa chindiṃsu.",
      "english": "\"Monks, people heard that, 'They say, good sirs, that the king punishes with fines those who take what is not given, that which is reckoned as theft.' Having heard this, it occurred to them, 'Suppose we too should take what is not given, that which is reckoned as theft.' Then, monks, a certain man took what was not given, that which is reckoned as theft. They arrested him. Having arrested him, they showed him to the anointed warrior-king, saying, 'This man, Your Majesty, has taken what was not given, that which is reckoned as theft.' When this was said, monks, the anointed warrior-king said to that man, 'Is it true, fellow, that you took what was not given, that which is reckoned as theft?' 'It is true, Your Majesty.' 'Why?' 'Because, Your Majesty, I cannot make a living.' Then, monks, it occurred to the anointed warrior-king, 'If I were to punish with fines each and every one who takes what is not given, that which is reckoned as theft, this taking of what is not given would increase. Suppose I were to utterly suppress this man, put him to death, cut off his head.' Then, monks, the anointed warrior-king commanded his men, 'Go, bind this man with a strong rope, with his arms tied tightly behind his back, shave his head bald, parade him around from street to street, from crossroads to crossroads, with a harsh-sounding drum, lead him out through the southern gate, and to the south of the city utterly suppress him, put him to death, cut off his head.' 'Yes, Your Majesty,' the men replied to the anointed warrior-king, and binding that man with a strong rope, with his arms tied tightly behind his back, shaving his head bald, parading him around from street to street, from crossroads to crossroads, with a harsh-sounding drum, leading him out through the southern gate, and to the south of the city, they utterly suppressed him, put him to death, and cut off his head.",
      "sinhala": "‘‘මහණෙනි, ‘යම් කෙනෙක් අනුන් සතු දෙයක් සොරකම් කිරීම යන ගණයට ගන්නා ලද්දේ එය ගනිත් නම්, රජ තෙමේ ඔවුන්ට දඬුවම් පමුණුවන්නේ ය’යි මනුෂ්‍යයෝ ඇසූහ. ඇසූ ඔවුන්ට මෙබඳු අදහසක් විය. ‘අපිත් අනුන් සතු දෙයක් සොරකම් කිරීම යන ගණයට ගන්නා ලද්දේ එය ගනිමු නම් මැනැවැ’යි සිතූහ. මහණෙනි, එකල්හි එක් පුරුෂයෙක් අනුන් සතු දෙයක් සොරකම් කිරීම යන ගණයට ගන්නා ලද්දේ එය ගත්තේ ය. ඔහු අල්ලා ගන්නා ලදී. අල්ලා ගෙන රජු වූ ක්ෂත්‍රියයාට ඔටුනු පැළඳවූ රජුට පෙන්වූහ. ‘දේවයන් වහන්ස, මේ පුරුෂයා අනුන් සතු දෙයක් සොරකම් කිරීම යන ගණයට ගන්නා ලද්දේ එය ගත්තේ ය’යි කීහ. මහණෙනි, මෙසේ කී කල්හි රජු වූ ක්ෂත්‍රියයා ඔටුනු පැළඳවූ රජ තෙමේ ඒ පුරුෂයාට මෙය කී ය. ‘අහෝ පුරුෂය, ඔබ අනුන් සතු දෙයක් සොරකම් කිරීම යන ගණයට ගන්නා ලද්දේ එය ගත්තෙහි දැ’යි ඇසී ය. ‘එසේය දේවයෙනි’යි කී ය. ‘කුමක් නිසාදැ’යි ඇසී ය. ‘දේවයෙනි, මම ජීවත් නොවෙමි’යි කී ය. මහණෙනි, එකල්හි රජු වූ ක්ෂත්‍රියයාට ඔටුනු පැළඳවූ රජුට මෙබඳු අදහසක් විය. ‘යම් යම් කෙනෙක් අනුන් සතු දෙයක් සොරකම් කිරීම යන ගණයට ගන්නා ලද්දේ එය ගන්නේ නම්, ඔවුන් ඔවුන්ට මම දඬුවම් පමුණුවන්නෙම් නම්, මෙසේ මේ අනුන් සතුදේ ගැනීම වැඩි වන්නේ ය. මම මේ පුරුෂයා හොඳින් නිරුද්ධ කර මූලෝත්පාටනය කර හිස සිඳින්නෙම් නම් මැනැවැ’යි සිතී ය. මහණෙනි, එකල්හි රජු වූ ක්ෂත්‍රියයා ඔටුනු පැළඳවූ රජ තෙමේ පුරුෂයන්ට අණ කෙළේ ය. ‘එසේ නම්, මේ පුරුෂයා තද වූ ලණුවකින් පිටුපසට දෑත් තදින් බැඳ, හිස මුඩු කර, රළු හඬ ඇති බෙරයකින් වීථියෙන් වීථියට, සන්ධිස්ථානයෙන් සන්ධිස්ථානයට ගෙන ගොස් දකුණු දොරටුවෙන් පිටතට ගෙන ගොස් නගරයට දකුණු දිශාවෙන් හොඳින් නිරුද්ධ කර මූලෝත්පාටනය කර හිස සිඳින්න’යි කී ය. මහණෙනි, ‘එසේය දේවයන් වහන්සැ’යි ඒ පුරුෂයෝ රජු වූ ක්ෂත්‍රියයාට ඔටුනු පැළඳවූ රජුට පිළිතුරු දී ඒ පුරුෂයා තද වූ ලණුවකින් පිටුපසට දෑත් තදින් බැඳ, හිස මුඩු කර, රළු හඬ ඇති බෙරයකින් වීථියෙන් වීථියට, සන්ධිස්ථානයෙන් සන්ධිස්ථානයට ගෙන ගොස් දකුණු දොරටුවෙන් පිටතට ගෙන ගොස් නගරයට දකුණු දිශාවෙන් හොඳින් නිරුද්ධ කර මූලෝත්පාටනය කර හිස සිඳ දැමූහ.",
      "paliTitle": ""
    },
    {
      "number": 93,
      "pali": "‘‘Assosuṃ kho, bhikkhave, manussā – ‘ye kira, bho, paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyanti, te rājā sunisedhaṃ nisedheti, mūlaghaccaṃ karoti, sīsāni tesaṃ chindatī’ti. Sutvāna tesaṃ etadahosi – ‘yaṃnūna mayampi tiṇhāni satthāni kārāpessāma [kārāpeyyāma (syā. pī.) kārāpeyyāmāti (ka. sī.)], tiṇhāni satthāni kārāpetvā yesaṃ adinnaṃ theyyasaṅkhātaṃ ādiyissāma, te sunisedhaṃ nisedhessāma, mūlaghaccaṃ karissāma, sīsāni tesaṃ chindissāmā’ti. Te tiṇhāni satthāni kārāpesuṃ, tiṇhāni satthāni kārāpetvā gāmaghātampi upakkamiṃsu kātuṃ, nigamaghātampi upakkamiṃsu kātuṃ, nagaraghātampi upakkamiṃsu kātuṃ, panthaduhanampi [panthadūhanaṃpi (sī. syā. pī.)] upakkamiṃsu kātuṃ. Yesaṃ te adinnaṃ theyyasaṅkhātaṃ ādiyanti, te sunisedhaṃ nisedhenti, mūlaghaccaṃ karonti, sīsāni tesaṃ chindanti.",
      "english": "\"Monks, people heard: 'It seems, good sirs, that those who take what is not given, reckoned as theft, the king severely punishes, utterly destroys, and cuts off their heads.' Having heard this, they thought: 'Suppose we also should have sharp swords made. Having had sharp swords made, we shall severely punish, utterly destroy, and cut off the heads of those from whom we take what is not given, reckoned as theft.' They had sharp swords made. Having had sharp swords made, they proceeded to commit village slaughter, proceeded to commit town slaughter, proceeded to commit city slaughter, and proceeded to commit highway robbery. Those from whom they took what was not given, reckoned as theft, they severely punished, utterly destroyed, and cut off their heads.\"",
      "sinhala": "‘‘මහණෙනි, මනුෂ්‍යයෝ ඇසූහ. ‘යම් කෙනෙක් අනුන් සතු දෙය සොරකම් කිරීම යන ගණයට ගෙන ගනිත් නම්, රජතුමා ඔවුන් හොඳින් වළක්වා, මුලිනුපුටා දමා, ඔවුන්ගේ හිස් සිඳි’ යනුයි. ඔවුන් එය අසා මෙසේ සිතූහ. ‘අපිත් ඉතා තියුණු ආයුධ කරවමු නම් මැනව. තියුණු ආයුධ කරවා අනුන් සතු දෙය සොරකම් කිරීම යන ගණයට ගෙන යම් කෙනෙකු ගනිත් නම්, ඔවුන් හොඳින් වළක්වා, මුලිනුපුටා දමා, ඔවුන්ගේ හිස් සිඳිමු’ යනුයි. ඔව්හු තියුණු ආයුධ කරවූහ. තියුණු ආයුධ කරවා ගම් විනාශ කිරීමට පටන් ගත්හ. නියම්ගම් විනාශ කිරීමට පටන් ගත්හ. නගර විනාශ කිරීමට පටන් ගත්හ. මං පහරන්නට පටන් ගත්හ. ඔවුන් අනුන් සතු දෙය සොරකම් කිරීම යන ගණයට ගෙන යම් කෙනෙකු ගනිත් නම්, ඔවුන් හොඳින් වළක්වා, මුලිනුපුටා දමා, ඔවුන්ගේ හිස් සිඳින්නට වූහ.",
      "paliTitle": ""
    },
    {
      "number": 94,
      "pali": "‘‘Iti kho, bhikkhave, adhanānaṃ dhane ananuppadiyamāne dāliddiyaṃ vepullamagamāsi, dāliddiye vepullaṃ gate adinnādānaṃ vepullamagamāsi, adinnādāne vepullaṃ gate satthaṃ vepullamagamāsi, satthe vepullaṃ gate pāṇātipāto vepullamagamāsi, pāṇātipāte vepullaṃ gate tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ asītivassasahassāyukānaṃ manussānaṃ cattārīsavassasahassāyukā puttā ahesuṃ. ‘‘Cattārīsavassasahassāyukesu, bhikkhave, manussesu aññataro puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyi. Tamenaṃ aggahesuṃ. Gahetvā rañño khattiyassa muddhābhisittassa dassesuṃ – ‘ayaṃ, deva, puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti. Evaṃ vutte, bhikkhave, rājā khattiyo muddhābhisitto taṃ purisaṃ etadavoca – ‘saccaṃ kira tvaṃ, ambho purisa, paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti? ‘Na hi, devā’ti sampajānamusā abhāsi.",
      "english": "\"Thus, bhikkhus, when wealth was not provided to the poor, poverty increased greatly; when poverty increased greatly, stealing increased greatly; when stealing increased greatly, violence increased greatly; when violence increased greatly, killing living beings increased greatly; when killing living beings increased greatly, the lifespan of those beings declined, and their beauty also declined. As their lifespan declined and their beauty declined, the children of humans who lived for eighty thousand years had a lifespan of forty thousand years. In a time when humans lived for forty thousand years, bhikkhus, one man took what was not given, which is called stealing. They arrested him. Having arrested him, they showed him to the anointed noble king, saying, 'This man, Your Majesty, has taken what was not given, which is called stealing.' When this was said, bhikkhus, the anointed noble king said to that man, 'Is it true, good man, that you have taken what was not given, which is called stealing?' 'No, Your Majesty,' he lied knowingly.\"",
      "sinhala": "‘‘මහණෙනි, මෙසේ දුප්පතුන්ට ධනය නූපදින කල්හි දිළිඳුකම වැඩි විය, දිළිඳුකම වැඩි වූ කල්හි සොරකම වැඩි විය, සොරකම වැඩි වූ කල්හි අවි ආයුධ භාවිතය වැඩි විය, අවි ආයුධ භාවිතය වැඩි වූ කල්හි සතුන් මැරීම වැඩි විය, සතුන් මැරීම වැඩි වූ කල්හි ඒ සත්ත්වයන්ගේ ආයුෂ ද පිරිහී ගියේ ය, වර්ණය ද පිරිහී ගියේ ය. ආයුෂයෙන් ද පිරිහී වර්ණයෙන් ද පිරිහී යන ඔවුන්ට අසූ දහසක් අවුරුදු ආයුෂ ඇති මනුෂ්‍යයන්ට හතළිස් දහසක් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ වූහ.\n\n‘‘මහණෙනි, හතළිස් දහසක් අවුරුදු ආයුෂ ඇති මනුෂ්‍යයන් අතර එක්තරා පුරුෂයෙක් අනුන්ගේ සොරකම් කරන ලද දෙයක් ගන්නා ලදී. ඔහුව අල්ලා ගන්නා ලදී. අල්ලා ගෙන රජු වූ ක්ෂත්‍රියයාට ඔහුව පෙන්වූහ. ‘දේවයන් වහන්ස, මේ පුරුෂයා අනුන්ගේ සොරකම් කරන ලද දෙයක් ගත්තේ ය’ කියා සැල කළහ. මහණෙනි, මෙසේ කී විට රජු වූ ක්ෂත්‍රියයා එම පුරුෂයාට මෙසේ කීවේ ය. ‘අහෝ පුරුෂය, ඔබ අනුන්ගේ සොරකම් කරන ලද දෙයක් ගත්තා ද, එය සත්‍යයක් ද?’ ‘දෙවියනි, නැත’ කියා දැන දැන ම බොරු කීවේ ය.",
      "paliTitle": ""
    },
    {
      "number": 95,
      "pali": "‘‘Iti kho, bhikkhave, adhanānaṃ dhane ananuppadiyamāne dāliddiyaṃ vepullamagamāsi. Dāliddiye vepullaṃ gate adinnādānaṃ vepullamagamāsi, adinnādāne vepullaṃ gate satthaṃ vepullamagamāsi. Satthe vepullaṃ gate pāṇātipāto vepullamagamāsi, pāṇātipāte vepullaṃ gate musāvādo vepullamagamāsi, musāvāde vepullaṃ gate tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ cattārīsavassasahassāyukānaṃ manussānaṃ vīsativassasahassāyukā puttā ahesuṃ. ‘‘Vīsativassasahassāyukesu, bhikkhave, manussesu aññataro puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyi. Tamenaṃ aññataro puriso rañño khattiyassa muddhābhisittassa ārocesi – ‘itthannāmo, deva, puriso paresaṃ adinnaṃ theyyasaṅkhātaṃ ādiyī’ti pesuññamakāsi.",
      "english": "\"Thus, bhikkhus, when wealth was not provided for the poor, poverty increased greatly. When poverty increased greatly, taking what was not given increased greatly; when taking what was not given increased greatly, weapons increased greatly. When weapons increased greatly, killing living beings increased greatly; when killing living beings increased greatly, false speech increased greatly; when false speech increased greatly, the lifespan of those beings also declined, and their beauty also declined. As their lifespan declined and their beauty declined, humans who had a lifespan of forty thousand years had children with a lifespan of twenty thousand years.\n\n\"When humans had a lifespan of twenty thousand years, bhikkhus, a certain man took what was not given, considered as theft, belonging to others. Then another man informed the king, a khattiya anointed on the head, about him: ‘So-and-so, your majesty, has taken what was not given, considered as theft, belonging to others,’ he spoke slander.\"",
      "sinhala": "‘‘මහණෙනි, මෙසේ දුගීන්ට ධනය නූපදනා කල්හි දිළිඳුකම මහත් විය. දිළිඳුකම මහත් වූ කල්හි සොරකම මහත් විය. සොරකම මහත් වූ කල්හි අවි ආයුධ භාවිතය මහත් විය. අවි ආයුධ භාවිතය මහත් වූ කල්හි පණ නැසීම මහත් විය. පණ නැසීම මහත් වූ කල්හි බොරු කීම මහත් විය. බොරු කීම මහත් වූ කල්හි ඒ සත්ත්වයන්ගේ ආයුෂ ද පිරිහෙන්නට විය. වර්ණය ද පිරිහෙන්නට විය. ආයුෂයෙන් ද පිරිහෙමින්, වර්ණයෙන් ද පිරිහෙමින් සතළිස් දහසක් අවුරුදු ආයුෂ ඇති මිනිසුන්ට විසි දහසක් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ වූහ. ‘‘මහණෙනි, විසි දහසක් අවුරුදු ආයුෂ ඇති මනුෂ්‍යයන් අතර එක්තරා පුරුෂයෙක් අනුන්ගේ අයිතියට අයත් සොරකම් කරන ලද්දක් ගත්තේය. එවිට එක්තරා පුරුෂයෙක් ඒ පුරුෂයා ගැන රජුට, ක්ෂත්‍රියයාට, මූර්ධභිෂේක ලද්දාට මෙසේ දැන්වීය. ‘දේවයන් වහන්ස, ഇന്ന නමින් ඇති පුරුෂයා අනුන්ගේ අයිතියට අයත් සොරකම් කරන ලද්දක් ගත්තේ ය’යි ඔවුහු කේලාම් කීහ.",
      "paliTitle": ""
    },
    {
      "number": 96,
      "pali": "‘‘Iti kho, bhikkhave, adhanānaṃ dhane ananuppadiyamāne dāliddiyaṃ vepullamagamāsi. Dāliddiye vepullaṃ gate adinnādānaṃ vepullamagamāsi, adinnādāne vepullaṃ gate satthaṃ vepullamagamāsi, satthe vepullaṃ gate pāṇātipāto vepullamagamāsi, pāṇātipāte vepullaṃ gate musāvādo vepullamagamāsi, musāvāde vepullaṃ gate pisuṇā vācā vepullamagamāsi, pisuṇāya vācāya vepullaṃ gatāya tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ vīsativassasahassāyukānaṃ manussānaṃ dasavassasahassāyukā puttā ahesuṃ. ‘‘Dasavassasahassāyukesu, bhikkhave, manussesu ekidaṃ sattā vaṇṇavanto honti, ekidaṃ sattā dubbaṇṇā. Tattha ye te sattā dubbaṇṇā, te vaṇṇavante satte abhijjhāyantā paresaṃ dāresu cārittaṃ āpajjiṃsu.",
      "english": "\"Thus, bhikkhus, with wealth not being provided to the poor, poverty increased greatly. With poverty greatly increased, taking what was not given increased greatly; with taking what was not given greatly increased, weapons increased greatly; with weapons greatly increased, killing living beings increased greatly; with killing living beings greatly increased, false speech increased greatly; with false speech greatly increased, malicious speech increased greatly; with malicious speech greatly increased, the lifespan of those beings declined, and their beauty also declined. As their lifespan and beauty declined, humans who had lived for twenty thousand years had children who lived for ten thousand years.\n\n\"Among humans living for ten thousand years, bhikkhus, some beings were beautiful, and some beings were ugly. Among those beings who were ugly, envying the beautiful beings, they committed adultery with the wives of others.\"",
      "sinhala": "‘‘මහණෙනි, මෙසේ දුගී අයට ධනය නූපදින කල්හි දිළිඳුකම වැඩිවියට පැමිණියේය. දිළිඳුකම වැඩිවියට පැමිණි කල්හි සොරකම වැඩිවියට පැමිණියේය. සොරකම වැඩිවියට පැමිණි කල්හි අවි ආයුධ භාවිතය වැඩිවියට පැමිණියේය. අවි ආයුධ භාවිතය වැඩිවියට පැමිණි කල්හි සතුන් මැරීම වැඩිවියට පැමිණියේය. සතුන් මැරීම වැඩිවියට පැමිණි කල්හි බොරු කීම වැඩිවියට පැමිණියේය. බොරු කීම වැඩිවියට පැමිණි කල්හි කේළාම් කීම වැඩිවියට පැමිණියේය. කේළාම් කීම වැඩිවියට පැමිණීම නිසා ඒ සත්ත්වයන්ගේ ආයුෂද පිරිහී ගියේය, වර්ණයද පිරිහී ගියේය. එසේ ආයුෂයෙන්ද පිරිහෙමින්, වර්ණයෙන්ද පිරිහෙමින් විසි දහසක් අවුරුදු ආයු ඇති මිනිසුන්ට දස දහසක් අවුරුදු ආයු ඇති පුත්‍රයෝ වූහ. ‘‘මහණෙනි, දස දහසක් අවුරුදු ආයු ඇති මිනිසුන් අතර ඇතැම් සත්ත්වයෝ වර්ණවත් වූහ, ඇතැම් සත්ත්වයෝ අවලස්සන වූහ. එහි යම් ඒ අවලස්සන සත්ත්වයෝ වෙත්ද, ඔවුහු වර්ණවත් සත්ත්වයන් දෙස ලොභ සිතින් බලා අනුන්ගේ භාර්යාවන් කෙරෙහි දුරාචාරයෙහි යෙදුණාහුය.",
      "paliTitle": ""
    },
    {
      "number": 97,
      "pali": "‘‘Iti kho, bhikkhave, adhanānaṃ dhane ananuppadiyamāne dāliddiyaṃ vepullamagamāsi. Dāliddiye vepullaṃ gate…pe… kāmesumicchācāro vepullamagamāsi, kāmesumicchācāre vepullaṃ gate tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ dasavassasahassāyukānaṃ manussānaṃ pañcavassasahassāyukā puttā ahesuṃ.",
      "english": "\"Thus, bhikkhus, when wealth was not provided to those who were without wealth, poverty increased greatly. When poverty increased greatly... for them... misconduct in sensual pleasures increased greatly, and when misconduct in sensual pleasures increased greatly, the lifespan of those beings declined, and their complexion also declined. For those whose lifespan was declining and whose complexion was declining, the sons of humans who had a lifespan of ten thousand years had a lifespan of five thousand years.\"",
      "sinhala": "‘‘මහණෙනි, මෙසේ දුගීන්ට ධනය නූපදනා කල්හි දිළිඳුකම පැතිර ගියේය. දිළිඳුකම පැතිර ගිය කල්හි ... කාමයෙහි වරදවා හැසිරීම පැතිර ගියේය. කාමයෙහි වරදවා හැසිරීම පැතිර ගිය කල්හි ඒ සත්ත්වයන්ගේ ආයුෂ ද පිරිහී ගියේය, වර්ණය ද පිරිහී ගියේය. ආයුෂයෙන් ද පිරිහී යන්නාවූ, වර්ණයෙන් ද පිරිහී යන්නාවූ දසවර්ෂ සහස්‍රා‍‍යුෂ ඇති මනුෂ්‍යයන්ට පස්වර්ෂ සහස්‍රා‍‍යුෂ ඇති පුත්‍රයෝ වූහ.",
      "paliTitle": ""
    },
    {
      "number": 98,
      "pali": "‘‘Pañcavassasahassāyukesu, bhikkhave, manussesu dve dhammā vepullamagamaṃsu – pharusāvācā samphappalāpo ca. Dvīsu dhammesu vepullaṃ gatesu tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ pañcavassasahassāyukānaṃ manussānaṃ appekacce aḍḍhateyyavassasahassāyukā, appekacce dvevassasahassāyukā puttā ahesuṃ.",
      "english": "\"When people lived for five thousand years, bhikkhus, two qualities grew abundant: harsh speech and frivolous talk. When these two qualities grew abundant, the lifespan and complexion of those beings declined. As their lifespan and complexion declined, the sons of those five-thousand-year-living people were sometimes two thousand five hundred years old, and sometimes two thousand years old.\"",
      "sinhala": "භික්ෂූණී, පන්දහසක් අවුරුදු ආයුෂ ඇති මනුෂ්‍යයන් අතර දරුණු වචන කථා කිරීම සහ හිස් වචන කථා කිරීම යන ධර්මතා දෙක වර්ධනය විය. එම ධර්මතා දෙක වර්ධනය වූ විට එම සත්ත්වයන්ගේ ආයුෂද පිරිහී ගියේය, වර්ණයද පිරිහී ගියේය.\n\nඑම ආයුෂයෙන්ද පිරිහී යන, වර්ණයෙන්ද පිරිහී යන පන්දහසක් අවුරුදු ආයුෂ ඇති මනුෂ්‍යයන්ට ඇතැම් අය අවුරුදු දෙදහස් පන්සියයක් ආයුෂ ඇති පුත්‍රයන් විය, ඇතැම් අය අවුරුදු දෙදහසක් ආයුෂ ඇති පුත්‍රයන් විය.",
      "paliTitle": ""
    },
    {
      "number": 99,
      "pali": "‘‘Aḍḍhateyyavassasahassāyukesu, bhikkhave, manussesu abhijjhābyāpādā vepullamagamaṃsu. Abhijjhābyāpādesu vepullaṃ gatesu tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ aḍḍhateyyavassasahassāyukānaṃ manussānaṃ vassasahassāyukā puttā ahesuṃ.",
      "english": "\"When humans lived for two and a half thousand years, monks, covetousness and ill will grew abundant. When covetousness and ill will had grown abundant, the lifespan of those beings declined, and their appearance also declined. As their lifespan declined and their appearance declined, the children of those humans who lived for two and a half thousand years lived for a thousand years.\"",
      "sinhala": "‘‘මහණෙනි, අවුරුදු දෙදහස් පන්සියයක් ආයු ඇති මිනිසුන් අතර අභිධ්‍යා ව්‍යාපාද වැඩුණා. අභිධ්‍යා ව්‍යාපාද වැඩුණු කල්හි ඒ සත්ත්වයන්ගේ ආයුෂ ද පිරිහුණා, වර්ණය ද පිරිහුණා. එසේ ආයුෂයෙන් ද පිරිහෙමින්, වර්ණයෙන් ද පිරිහෙමින් සිටි අවුරුදු දෙදහස් පන්සියයක් ආයු ඇති මනුෂ්‍යයන්ට අවුරුදු දහසක් ආයු ඇති පුත්‍රයෝ වූහ.",
      "paliTitle": ""
    },
    {
      "number": 100,
      "pali": "‘‘Vassasahassāyukesu, bhikkhave, manussesu micchādiṭṭhi vepullamagamāsi. Micchādiṭṭhiyā vepullaṃ gatāya tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ vassasahassāyukānaṃ manussānaṃ pañcavassasatāyukā puttā ahesuṃ.",
      "english": "\"In the past, bhikkhus, when humans lived for a thousand years, wrong view increased greatly. With the increase of wrong view, the lifespan and beauty of those beings declined. As their lifespan and beauty declined, the children of those humans who lived for a thousand years had a lifespan of five hundred years.\"",
      "sinhala": "‘‘මහණෙනි, වසර දහස් ගණනක් ආයු ඇති මිනිසුන් අතර මිථ්‍යාදෘෂ්ටිය පැතිර ගියේය. මිථ්‍යාදෘෂ්ටිය පැතිර යාමෙන් ඒ සත්ත්වයන්ගේ ආයුෂ ද පිරිහුණේ ය, වර්ණය ද පිරිහුණේ ය. එසේ ආයුෂයෙන් ද පිරිහෙමින්, වර්ණයෙන් ද පිරිහෙමින් සිටි වසර දහස් ගණනක් ආයු ඇති මිනිසුන්ට වසර පන්සියයක් ආයු ඇති පුත්‍රයෝ වූහ.",
      "paliTitle": ""
    },
    {
      "number": 101,
      "pali": "‘‘Pañcavassasatāyukesu, bhikkhave, manussesu tayo dhammā vepullamagamaṃsu. Adhammarāgo visamalobho micchādhammo. Tīsu dhammesu vepullaṃ gatesu tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ pañcavassasatāyukānaṃ manussānaṃ appekacce aḍḍhateyyavassasatāyukā, appekacce dvevassasatāyukā puttā ahesuṃ. ‘‘Aḍḍhateyyavassasatāyukesu, bhikkhave, manussesu ime dhammā vepullamagamaṃsu. Amatteyyatā apetteyyatā asāmaññatā abrahmaññatā na kule jeṭṭhāpacāyitā.",
      "english": "\"In the case of humans living for five hundred years, monks, three things attained abundance: unrighteous lust, uneven greed, and false teachings. When these three things had attained abundance, the life span of those beings declined, and their complexion declined. As their life span declined and their complexion declined, there were offspring of those humans who had lived for five hundred years, some living for two hundred and fifty years, and some living for two hundred years. In the case of humans living for two hundred and fifty years, monks, these things attained abundance: disrespect towards mothers, disrespect towards fathers, lack of ascetic practice, lack of spiritual practice, and failure to honor the elders in the family.\"",
      "sinhala": "භික්‍ෂූන් වහන්ස, පන්සිය වසක් ආයු ඇති මිනිසුන් අතර තුන් ධර්මයක් වැඩුණහ. අධර්ම රාගය, විෂම ලෝභය, මිථ්‍යා ධර්මය යන මේ ධර්ම තුන වැඩුණු කල්හි ඒ සත්ත්‍වයන්ගේ ආයුෂ ද පිරිහුණි, වර්ණය ද පිරිහුණි. ආයුෂයෙන් ද පිරිහෙමින්, වර්ණයෙන් ද පිරිහෙමින් සිටින පන්සිය වසක් ආයු ඇති මිනිසුන්ට ඇතැම් කෙනෙක් දෙසිය පනස් වසක් ආයු ඇති පුත්‍රයන් වූහ, ඇතැම් කෙනෙක් දෙසිය වසක් ආයු ඇති පුත්‍රයන් වූහ.\n\nභික්‍ෂූන් වහන්ස, දෙසිය පනස් වසක් ආයු ඇති මිනිසුන් අතර මේ ධර්ම වැඩුණහ. මව්පියන්ට සැලකීමක් නැති බව, පියවරුන්ට සැලකීමක් නැති බව, ශ්‍ර‍මණ ගුණය නැති බව, බ්‍රාහ්මණ ගුණය නැති බව, කුලයේ වැඩිහිටියන්ට සැලකීමක් නැති බව යන මේවායි.",
      "paliTitle": ""
    },
    {
      "number": 102,
      "pali": "‘‘Iti kho, bhikkhave, adhanānaṃ dhane ananuppadiyamāne dāliddiyaṃ vepullamagamāsi. Dāliddiye vepullaṃ gate adinnādānaṃ vepullamagamāsi. Adinnādāne vepullaṃ gate satthaṃ vepullamagamāsi. Satthe vepullaṃ gate pāṇātipāto vepullamagamāsi. Pāṇātipāte vepullaṃ gate musāvādo vepullamagamāsi. Musāvāde vepullaṃ gate pisuṇā vācā vepullamagamāsi. Pisuṇāya vācāya vepullaṃ gatāya kāmesumicchācāro vepullamagamāsi. Kāmesumicchācāre vepullaṃ gate dve dhammā vepullamagamaṃsu, pharusā vācā samphappalāpo ca. Dvīsu dhammesu vepullaṃ gatesu abhijjhābyāpādā vepullamagamaṃsu. Abhijjhābyāpādesu vepullaṃ gatesu micchādiṭṭhi vepullamagamāsi. Micchādiṭṭhiyā vepullaṃ gatāya tayo dhammā vepullamagamaṃsu, adhammarāgo visamalobho micchādhammo. Tīsu dhammesu vepullaṃ gatesu ime dhammā vepullamagamaṃsu, amatteyyatā apetteyyatā asāmaññatā abrahmaññatā na kule jeṭṭhāpacāyitā. Imesu dhammesu vepullaṃ gatesu tesaṃ sattānaṃ āyupi parihāyi, vaṇṇopi parihāyi. Tesaṃ āyunāpi parihāyamānānaṃ vaṇṇenapi parihāyamānānaṃ aḍḍhateyyavassasatāyukānaṃ manussānaṃ vassasatāyukā puttā ahesuṃ. ",
      "english": "\"Thus, bhikkhus, when wealth was not given to the poor, poverty increased greatly. When poverty increased greatly, taking what was not given increased greatly. When taking what was not given increased greatly, weapons increased greatly. When weapons increased greatly, the taking of life increased greatly. When the taking of life increased greatly, false speech increased greatly. When false speech increased greatly, divisive speech increased greatly. When divisive speech increased greatly, misconduct in regard to sensual pleasures increased greatly. When misconduct in regard to sensual pleasures increased greatly, two things increased greatly: harsh speech and idle chatter. When these two things increased greatly, covetousness and ill will increased greatly. When covetousness and ill will increased greatly, wrong view increased greatly. When wrong view increased greatly, three things increased greatly: unrighteous lust, excessive greed, and wrong Dhamma. When these three things increased greatly, these things increased greatly: lack of respect for mother, lack of respect for father, lack of respect for ascetics, lack of respect for brahmins, and no honoring of elders in the family. When these things increased greatly, the lifespan of those beings declined, and their beauty also declined. As their lifespan declined and their beauty declined, the children of humans who had lived for eighty thousand years had a lifespan of one hundred years.\"",
      "sinhala": "‘‘මහණෙනි, මෙසේ දුගීන්ට ධනය නූපදනා කල දරිද්‍රතාවය පැතිර ගියේය. දරිද්‍රතාවය පැතිර ගිය කල සොරකම පැතිර ගියේය. සොරකම පැතිර ගිය කල ආයුධ භාවිතය පැතිර ගියේය. ආයුධ භාවිතය පැතිර ගිය කල සතුන් මැරීම පැතිර ගියේය. සතුන් මැරීම පැතිර ගිය කල බොරු කීම පැතිර ගියේය. බොරු කීම පැතිර ගිය කල කේලාම් කීම පැතිර ගියේය. කේලාම් කීම පැතිර ගිය කල කාමයෙහි වරදවා හැසිරීම පැතිර ගියේය. කාමයෙහි වරදවා හැසිරීම පැතිර ගිය කල වචනයෙන් කෙරෙන දුෂ්ටකම් දෙකක් පැතිර ගියේය, එනම් කඨින වචන සහ හිස් වචන යනුයි. එම දුෂ්ටකම් දෙක පැතිර ගිය කල අභිධ්‍යා සහ ව්‍යාපාදය පැතිර ගියේය. අභිධ්‍යා සහ ව්‍යාපාදය පැතිර ගිය කල මිථ්‍යා දෘෂ්ටිය පැතිර ගියේය. මිථ්‍යා දෘෂ්ටිය පැතිර ගිය කල අධර්මයෙහි ඇලීම, විෂම ලෝභය, මිථ්‍යා ධර්මය යන තුන පැතිර ගියේය. එම තුන පැතිර ගිය කල මව්පියන්ට සැලකීම නැතිකම, ගුරුවරුන්ට සැලකීම නැතිකම, ශ්‍ර‍මණ බ්‍රාහ්මණයන්ට සැලකීම නැතිකම, කුලයේ වැඩිහිටියන්ට සැලකීම නැතිකම යන මේ දහම් පැතිර ගියේය. මෙම දහම් පැතිර ගිය කල ඒ සත්ත්වයන්ගේ ආයුෂද පිරිහී ගියේය, වර්ණයද පිරිහී ගියේය. එසේ ආයුෂයෙන්ද පිරිහෙමින් වර්ණයෙන්ද පිරිහෙමින් සිටි එකසිය පනස් අවුරුදු ආයු ඇති මනුෂ්‍යයන්ට අවුරුදු සියයක් ආයු ඇති දරුවෝ වූහ.",
      "paliTitle": ""
    },
    {
      "number": 103,
      "pali": "‘‘Bhavissati, bhikkhave, so samayo, yaṃ imesaṃ manussānaṃ dasavassāyukā puttā bhavissanti. Dasavassāyukesu, bhikkhave, manussesu pañcavassikā [pañcamāsikā (ka. sī.)] kumārikā alaṃpateyyā bhavissanti. Dasavassāyukesu, bhikkhave, manussesu imāni rasāni antaradhāyissanti, seyyathidaṃ, sappi navanītaṃ telaṃ madhu phāṇitaṃ loṇaṃ. Dasavassāyukesu, bhikkhave, manussesu kudrūsako aggaṃ bhojanānaṃ [aggabhojanaṃ (syā.)] bhavissati. Seyyathāpi, bhikkhave, etarahi sālimaṃsodano aggaṃ bhojanānaṃ; evameva kho, bhikkhave, dasavassāyukesu manussesu kudrūsako aggaṃ bhojanānaṃ bhavissati. ‘‘Dasavassāyukesu, bhikkhave, manussesu dasa kusalakammapathā sabbena sabbaṃ antaradhāyissanti, dasa akusalakammapathā atibyādippissanti [ativiya dippissanti (syā. pī.), ativyādippissanti (sī.)]. Dasavassāyukesu, bhikkhave, manussesu kusalantipi na bhavissati, kuto pana kusalassa kārako. Dasavassāyukesu, bhikkhave, manussesu ye te bhavissanti amatteyyā apetteyyā asāmaññā abrahmaññā na kule jeṭṭhāpacāyino, te pujjā ca bhavissanti pāsaṃsā ca. Seyyathāpi, bhikkhave, etarahi matteyyā petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino pujjā ca pāsaṃsā ca; evameva kho, bhikkhave, dasavassāyukesu manussesu ye te bhavissanti amatteyyā apetteyyā asāmaññā abrahmaññā na kule jeṭṭhāpacāyino, te pujjā ca bhavissanti pāsaṃsā ca. ‘‘Dasavassāyukesu, bhikkhave, manussesu na bhavissati mātāti vā mātucchāti vā mātulānīti vā ācariyabhariyāti vā garūnaṃ dārāti vā. Sambhedaṃ loko gamissati yathā ajeḷakā kukkuṭasūkarā soṇasiṅgālā [soṇasigālā (sī. pī.)]. ‘‘Dasavassāyukesu, bhikkhave, manussesu tesaṃ sattānaṃ aññamaññamhi tibbo āghāto paccupaṭṭhito bhavissati tibbo byāpādo tibbo manopadoso tibbaṃ vadhakacittaṃ. Mātupi puttamhi puttassapi mātari; pitupi puttamhi puttassapi pitari; bhātupi bhaginiyā bhaginiyāpi bhātari tibbo āghāto paccupaṭṭhito bhavissati tibbo byāpādo tibbo manopadoso tibbaṃ vadhakacittaṃ. Seyyathāpi, bhikkhave, māgavikassa migaṃ disvā tibbo āghāto paccupaṭṭhito hoti tibbo byāpādo tibbo manopadoso tibbaṃ vadhakacittaṃ; evameva kho, bhikkhave, dasavassāyukesu manussesu tesaṃ sattānaṃ aññamaññamhi tibbo āghāto paccupaṭṭhito bhavissati tibbo byāpādo tibbo manopadoso tibbaṃ vadhakacittaṃ. Mātupi puttamhi puttassapi mātari; pitupi puttamhi puttassapi pitari; bhātupi bhaginiyā bhaginiyāpi bhātari tibbo āghāto paccupaṭṭhito bhavissati tibbo byāpādo tibbo manopadoso tibbaṃ vadhakacittaṃ.",
      "english": "Monks, there will be a time when the children of these humans will be ten years old. Among those humans who are ten years old, girls who are five years old will be ready for marriage. Among those humans who are ten years old, these flavors will disappear: ghee, fresh butter, oil, honey, molasses, and salt. Among those humans who are ten years old, kudrūsaka rice will be the best of foods. Just as now rice with meat is the best of foods, so too, monks, among those humans who are ten years old, kudrūsaka rice will be the best of foods.\n\nAmong those humans who are ten years old, the ten courses of wholesome action will completely disappear, and the ten courses of unwholesome action will flourish exceedingly. Among those humans who are ten years old, there will be no such thing as wholesome, let alone anyone doing wholesome deeds. Among those humans who are ten years old, those who will be irreverent towards their mothers, irreverent towards their fathers, unrespectful of ascetics, unrespectful of brahmins, and who do not honor the elders in their family, will be honored and praised. Just as now those who are reverent towards their mothers, reverent towards their fathers, respectful of ascetics, respectful of brahmins, and who honor the elders in their family are honored and praised, so too, monks, among those humans who are ten years old, those who will be irreverent towards their mothers, irreverent towards their fathers, unrespectful of ascetics, unrespectful of brahmins, and who do not honor the elders in their family, will be honored and praised.\n\nAmong those humans who are ten years old, there will be no such thing as 'mother,' 'maternal aunt,' 'wife of a maternal uncle,' 'wife of a teacher,' or 'wives of those worthy of respect.' The world will be in a state of promiscuity like goats, chickens, pigs, dogs, and jackals.\n\nAmong those humans who are ten years old, intense hatred will be present among those beings, intense ill-will, intense mental corruption, and intense thoughts of killing. Even between a mother and son, and between a son and mother; even between a father and son, and between a son and father; even between a brother and sister, and between a sister and brother, intense hatred will be present, intense ill-will, intense mental corruption, and intense thoughts of killing. Just as, monks, when a hunter sees a deer, intense hatred is present, intense ill-will, intense mental corruption, and intense thoughts of killing, so too, monks, among those humans who are ten years old, intense hatred will be present among those beings, intense ill-will, intense mental corruption, and intense thoughts of killing. Even between a mother and son, and between a son and mother; even between a father and son, and between a son and father; even between a brother and sister, and between a sister and brother, intense hatred will be present, intense ill-will, intense mental corruption, and intense thoughts of killing.",
      "sinhala": "‘‘මහණෙනි, යම් කලෙක මේ මනුෂ්‍යයන්ගේ දස වසක් ආයු ඇති දරුවෝ වෙත් ද, ඒ කාලය පැමිණෙන්නේ ය. මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි පස් වසක් පමණ වයසැති දැරියක් විවාහයට සුදුසු වන්නී ය. මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි සප්පි, වෙඬරු, තෙල්, මී, උක් හකුරු, ලුණු යන මේ රස අතුරුදහන් වන්නේ ය. මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි කුරහන් බත් භෝජනයන් අතර අග්‍ර වන්නේ ය. මහණෙනි, දැන් යම්සේ සාලි සහ මස් මිශ්‍ර බත් භෝජනයන් අතර අග්‍ර වේ ද, එපරිද්දෙන් ම මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි කුරහන් බත් භෝජනයන් අතර අග්‍ර වන්නේ ය.\n\n‘‘මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි දස කුසල කර්මපථ සියල්ලෙන් සියල්ල ම අතුරුදහන් වන්නේ ය. දස අකුසල කර්මපථ ඉතා පැතිරෙන්නේ ය. මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි කුසලයෙක් ඇතැයි යන වචනයකුදු නො වන්නේ ය. කුසලය කරන්නෙක් කෙසේ නම් වන්නේ ද? මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි යම් කෙනෙක් මව්පියන්ට සැලකීමක් නැත්තාහු ද, ගුරුවරුන්ට සැලකීමක් නැත්තාහු ද, ශ්‍රමණ ගුණය නැත්තාහු ද, බ්‍රාහ්මණ ගුණය නැත්තාහු ද, කුලයෙහි වැඩිහිටියන්ට ගරු නොකරන්නාහු ද, ඔවුහු පුදනු ලැබීමට ද ප්‍රශංසාවට ද පැමිණෙන්නාහු ය. මහණෙනි, දැන් යම්සේ මව්පියන්ට සලකන්නාහු ද, ගුරුවරුන්ට සලකන්නාහු ද, ශ්‍රමණ ගුණය යුක්ත වූවාහු ද, බ්‍රාහ්මණ ගුණය යුක්ත වූවාහු ද, කුලයෙහි වැඩිහිටියන්ට ගරු කරන්නාහු ද, ඔවුහු පුදනු ලැබීමට ද ප්‍රශංසාවට ද පැමිණෙත් ද, එපරිද්දෙන් ම මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි යම් කෙනෙක් මව්පියන්ට සැලකීමක් නැත්තාහු ද, ගුරුවරුන්ට සැලකීමක් නැත්තාහු ද, ශ්‍රමණ ගුණය නැත්තාහු ද, බ්‍රාහ්මණ ගුණය නැත්තාහු ද, කුලයෙහි වැඩිහිටියන්ට ගරු නොකරන්නාහු ද, ඔවුහු පුදනු ලැබීමට ද ප්‍රශංසාවට ද පැමිණෙන්නාහු ය.\n\n‘‘මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි මව යයි හෝ මස්සිනා යයි හෝ නැන්දණිය යයි හෝ ආචාර්ය භාර්යාව යයි හෝ ගුරුවරුන්ගේ භාර්යාවෝ යයි හෝ කෙනෙක් නො වන්නාහ. එළුවන් කුකුළන් ඌරන් බල්ලන් නරියන් යන මොවුන්ගේ හැසිරීම්වලට සමානව ලෝකය හැසිරෙන්නේ ය.\n\n‘‘මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි ඒ සත්ත්වයන්ගේ එකිනෙකා කෙරෙහි තියුණු ක්‍රෝධයක් එළඹ සිටින්නේ ය. තියුණු ද්වේෂයක්, තියුණු මානසික දොම්නසක්, තියුණු මරණ චේතනාවක් පවතින්නේ ය. මවටත් පුත්‍රයා කෙරෙහි පුත්‍රයාටත් මව කෙරෙහි පියාටත් පුත්‍රයා කෙරෙහි පුත්‍රයාටත් පියා කෙරෙහි සහෝදරයාටත් සහෝදරිය කෙරෙහි සහෝදරියටත් සහෝදරයා කෙරෙහි තියුණු ක්‍රෝධයක් එළඹ සිටින්නේ ය. තියුණු ද්වේෂයක්, තියුණු මානසික දොම්නසක්, තියුණු මරණ චේතනාවක් පවතින්නේ ය. මහණෙනි, යම්සේ මෘගයන් මරන්නෙකුට මුවෙකු දැකීමෙන් තියුණු ක්‍රෝධයක් එළඹ සිටී ද, තියුණු ද්වේෂයක්, තියුණු මානසික දොම්නසක්, තියුණු මරණ චේතනාවක් පවතී ද, එපරිද්දෙන් ම මහණෙනි, දස වසක් ආයු ඇති මනුෂ්‍යයන් අතරෙහි ඒ සත්ත්වයන්ගේ එකිනෙකා කෙරෙහි තියුණු ක්‍රෝධයක් එළඹ සිටින්නේ ය. තියුණු ද්වේෂයක්, තියුණු මානසික දොම්නසක්, තියුණු මරණ චේතනාවක් පවතින්නේ ය. මවටත් පුත්‍රයා කෙරෙහි පුත්‍රයාටත් මව කෙරෙහි පියාටත් පුත්‍රයා කෙරෙහි පුත්‍රයාටත් පියා කෙරෙහි සහෝදරයාටත් සහෝදරිය කෙරෙහි සහෝදරියටත් සහෝදරයා කෙරෙහි තියුණු ක්‍රෝධයක් එළඹ සිටින්නේ ය. තියුණු ද්වේෂයක්, තියුණු මානසික දොම්නසක්, තියුණු මරණ චේතනාවක් පවතින්නේ ය.",
      "paliTitle": "Dasavassāyukasamayo",
      "englishTitle": "The Occasion of the Ten-Year Lifespan",
      "sinhalaTitle": "දසවස්සායුක සමය"
    },
    {
      "number": 104,
      "pali": "‘‘Dasavassāyukesu, bhikkhave, manussesu sattāhaṃ satthantarakappo bhavissati. Te aññamaññamhi migasaññaṃ paṭilabhissanti. Tesaṃ tiṇhāni satthāni hatthesu pātubhavissanti. Te tiṇhena satthena ‘esa migo esa migo’ti aññamaññaṃ jīvitā voropessanti. ‘‘Atha kho tesaṃ, bhikkhave, sattānaṃ ekaccānaṃ evaṃ bhavissati – ‘mā ca mayaṃ kañci [kiñci (ka.)], mā ca amhe koci, yaṃnūna mayaṃ tiṇagahanaṃ vā vanagahanaṃ vā rukkhagahanaṃ vā nadīviduggaṃ vā pabbatavisamaṃ vā pavisitvā vanamūlaphalāhārā yāpeyyāmā’ti. Te tiṇagahanaṃ vā vanagahanaṃ vā rukkhagahanaṃ vā nadīviduggaṃ vā pabbatavisamaṃ vā [te tiṇagahanaṃ vanagahanaṃ rukkhagahanaṃ nadīviduggaṃ pabbatavisamaṃ (sī. pī.)] pavisitvā sattāhaṃ vanamūlaphalāhārā yāpessanti. Te tassa sattāhassa accayena tiṇagahanā vanagahanā rukkhagahanā nadīviduggā pabbatavisamā nikkhamitvā aññamaññaṃ āliṅgitvā sabhāgāyissanti samassāsissanti – ‘diṭṭhā, bho, sattā jīvasi, diṭṭhā, bho, sattā jīvasī’ti.",
      "english": "\"In the case of human beings living for ten years, bhikkhus, there will be a week of sword-strife. They will have the perception of animals towards each other. Sharp swords will appear in their hands. They will deprive each other of life with the sharp sword, thinking, 'This is an animal, this is an animal.'\n\n\"Then, bhikkhus, it will occur to some of those beings: 'Let us not harm anyone, and let no one harm us. Why don't we enter a dense thicket of grass, a dense thicket of trees, a dense thicket of shrubs, a difficult river passage, or an uneven mountain region, and live on roots and fruits of the forest?' They will enter a dense thicket of grass, a dense thicket of trees, a dense thicket of shrubs, a difficult river passage, or an uneven mountain region, and for a week they will live on roots and fruits of the forest.\n\n\"At the end of that week, having emerged from the dense thicket of grass, the dense thicket of trees, the dense thicket of shrubs, the difficult river passage, or the uneven mountain region, they will embrace each other, rejoice together, and console each other, saying, 'O friend, I am glad to see you alive! O friend, I am glad to see you alive!'\"",
      "sinhala": "‘‘මහණෙනි, දස වසරක් ආයු ඇති මනුෂ්‍යයන් අතර සත් දවසක් ශස්ත්‍රාන්තර කල්පයක් ඇති වන්නේ ය. ඔවුන් එකිනෙකා කෙරෙහි මෘග සංඥාව ලබන්නාහ. ඔවුන්ගේ අත්වල තියුණු ආයුධ පහළ වන්නේ ය. ‘මේ මෘගයෙකි, මේ මෘගයෙකි’ යි ඔවුහු තියුණු ආයුධවලින් එකිනෙකාගේ ජීවිත විනාශ කරන්නාහ.\n\n‘‘මහණෙනි, එකල්හි ඒ සත්ත්වයන්ගෙන් ඇතැමෙකුට මෙවැනි අදහසක් ඇති වන්නේ ය. ‘අපි කිසිවෙකුත් නොමරමු. කිසිවෙකුත් අප නොමරාවා. අපි තණ පඳුරකට වුව ද, වන පඳුරකට වුව ද, රුක් පඳුරකට වුව ද, ගංගා දුර්ගයකට වුව ද, පර්වත දුර්ගයකට වුව ද ඇතුළු වී වනමූලඵල ආහාරයෙන් ජීවත් වෙමු’ යි සිතන්නාහ. ඔවුහු තණ පඳුරකට වුව ද, වන පඳුරකට වුව ද, රුක් පඳුරකට වුව ද, ගංගා දුර්ගයකට වුව ද, පර්වත දුර්ගයකට වුව ද ඇතුළු වී සත් දවසක් වනමූලඵල ආහාරයෙන් ජීවත් වන්නාහ. ඒ සත් දවස ගෙවුණු පසු ඔවුහු තණ පඳුරුවලින්, වන පඳුරුවලින්, රුක් පඳුරුවලින්, ගංගා දුර්ගවලින්, පර්වත දුර්ගවලින් නික්ම එකිනෙකා වැළඳ ගෙන සතුටු වන්නාහ. සැනසුම් ලබන්නාහ. ‘පින්වත, ඔබ ජීවත්ව සිටිනු දැක්කෙමි. පින්වත, ඔබ ජීවත්ව සිටිනු දැක්කෙමි’ යි කියන්නාහ.",
      "paliTitle": ""
    },
    {
      "number": 105,
      "pali": "‘‘Atha kho tesaṃ, bhikkhave, sattānaṃ evaṃ bhavissati – ‘mayaṃ kho akusalānaṃ dhammānaṃ samādānahetu evarūpaṃ āyataṃ ñātikkhayaṃ pattā. Yaṃnūna mayaṃ kusalaṃ kareyyāma. Kiṃ kusalaṃ kareyyāma? Yaṃnūna mayaṃ pāṇātipātā virameyyāma, idaṃ kusalaṃ dhammaṃ samādāya vatteyyāmā’ti. Te pāṇātipātā viramissanti, idaṃ kusalaṃ dhammaṃ samādāya vattissanti. Te kusalānaṃ dhammānaṃ samādānahetu āyunāpi vaḍḍhissanti, vaṇṇenapi vaḍḍhissanti. Tesaṃ āyunāpi vaḍḍhamānānaṃ vaṇṇenapi vaḍḍhamānānaṃ dasavassāyukānaṃ manussānaṃ vīsativassāyukā puttā bhavissanti. ‘‘Atha kho tesaṃ, bhikkhave, sattānaṃ evaṃ bhavissati – ‘mayaṃ kho kusalānaṃ dhammānaṃ samādānahetu āyunāpi vaḍḍhāma, vaṇṇenapi vaḍḍhāma. Yaṃnūna mayaṃ bhiyyosomattāya kusalaṃ kareyyāma. Kiṃ kusalaṃ kareyyāma? Yaṃnūna mayaṃ adinnādānā virameyyāma… kāmesumicchācārā virameyyāma… musāvādā virameyyāma… pisuṇāya vācāya virameyyāma… pharusāya vācāya virameyyāma… samphappalāpā virameyyāma… abhijjhaṃ pajaheyyāma… byāpādaṃ pajaheyyāma… micchādiṭṭhiṃ pajaheyyāma… tayo dhamme pajaheyyāma – adhammarāgaṃ visamalobhaṃ micchādhammaṃ… yaṃnūna mayaṃ matteyyā assāma petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino, idaṃ kusalaṃ dhammaṃ samādāya vatteyyāmā’ti. Te matteyyā bhavissanti petteyyā sāmaññā brahmaññā kule jeṭṭhāpacāyino, idaṃ kusalaṃ dhammaṃ samādāya vattissanti. ‘‘Te kusalānaṃ dhammānaṃ samādānahetu āyunāpi vaḍḍhissanti, vaṇṇenapi vaḍḍhissanti. Tesaṃ āyunāpi vaḍḍhamānānaṃ vaṇṇenapi vaḍḍhamānānaṃ vīsativassāyukānaṃ manussānaṃ cattārīsavassāyukā puttā bhavissanti… cattārīsavassāyukānaṃ manussānaṃ asītivassāyukā puttā bhavissanti… asītivassāyukānaṃ manussānaṃ saṭṭhivassasatāyukā puttā bhavissanti… saṭṭhivassasatāyukānaṃ manussānaṃ vīsatitivassasatāyukā puttā bhavissanti… vīsatitivassasatāyukānaṃ manussānaṃ cattārīsachabbassasatāyukā puttā bhavissanti. Cattārīsachabbassasatāyukānaṃ manussānaṃ dvevassasahassāyukā puttā bhavissanti… dvevassasahassāyukānaṃ manussānaṃ cattārivassasahassāyukā puttā bhavissanti… cattārivassasahassāyukānaṃ manussānaṃ aṭṭhavassasahassāyukā puttā bhavissanti… aṭṭhavassasahassāyukānaṃ manussānaṃ vīsativassasahassāyukā puttā bhavissanti… vīsativassasahassāyukānaṃ manussānaṃ cattārīsavassasahassāyukā puttā bhavissanti… cattārīsavassasahassāyukānaṃ manussānaṃ asītivassasahassāyukā puttā bhavissanti… asītivassasahassāyukesu, bhikkhave, manussesu pañcavassasatikā kumārikā alaṃpateyyā bhavissanti. ",
      "english": "Then, monks, these beings will think: ‘We have suffered such prolonged destruction of relatives because of undertaking unwholesome practices. Suppose we were to do what is wholesome. What wholesome thing should we do? Suppose we were to abstain from taking life and undertake this wholesome practice.’ They will abstain from taking life and undertake this wholesome practice. Because of undertaking wholesome practices, they will increase in both lifespan and beauty. As they increase in lifespan and beauty, the children of those humans with a lifespan of ten years will have a lifespan of twenty years.\n\nThen, monks, these beings will think: ‘We are increasing in both lifespan and beauty because of undertaking wholesome practices. Suppose we were to do even more wholesome deeds. What wholesome thing should we do? Suppose we were to abstain from taking what is not given…abstain from sexual misconduct…abstain from false speech…abstain from malicious speech…abstain from harsh speech…abstain from idle chatter…abandon covetousness…abandon ill-will…abandon wrong view…abandon these three things: unrighteous lust, perverse greed, and false teaching…Suppose we were to be respectful to our mothers, respectful to our fathers, respectful to ascetics, respectful to brahmins, and respectful to the elders in our family, undertaking this wholesome practice.’ They will be respectful to their mothers, respectful to their fathers, respectful to ascetics, respectful to brahmins, and respectful to the elders in their family, undertaking this wholesome practice.\n\nBecause of undertaking wholesome practices, they will increase in both lifespan and beauty. As they increase in lifespan and beauty, the children of those humans with a lifespan of twenty years will have a lifespan of forty years…the children of those humans with a lifespan of forty years will have a lifespan of eighty years…the children of those humans with a lifespan of eighty years will have a lifespan of six hundred years…the children of those humans with a lifespan of six hundred years will have a lifespan of two thousand years…the children of those humans with a lifespan of two thousand years will have a lifespan of four thousand years. The children of those humans with a lifespan of four thousand years will have a lifespan of eight thousand years…the children of those humans with a lifespan of eight thousand years will have a lifespan of twenty thousand years…the children of those humans with a lifespan of twenty thousand years will have a lifespan of forty thousand years…the children of those humans with a lifespan of forty thousand years will have a lifespan of eighty thousand years…Among those humans with a lifespan of eighty thousand years, monks, girls of five years old will be of marriageable age.",
      "sinhala": "‘‘මහණෙනි, එකල්හි ඒ සත්ත්‍වයන්ට මෙබඳු සිතක් ඇති වන්නේ ය. ‘අපි අකුශල ධර්ම සමාදන් වීම හේතු කොටගෙන මෙබඳු දීර්ඝ කාලයක් ඥාති සංක්ෂය වීමකට පැමිණියෙමු. අපි කුශලයක් කළ යුතු නම් මැනවි. කුමක් නම් කුශලයක් කරමු ද? අපි ප්‍රාණඝාතයෙන් වැළකිය යුතු නම් මැනවි. මෙය කුශල ධර්මයක් ලෙස සමාදන් වී වසමු’යි කියා ය. ඔවුහු ප්‍රාණඝාතයෙන් වැළකෙන්නාහ. මෙය කුශල ධර්මයක් ලෙස සමාදන් වී වසන්නාහ. ඔවුහු කුශල ධර්ම සමාදන් වීම හේතු කොටගෙන ආයුෂයෙන් ද වැඩෙන්නාහ. වර්ණයෙන් ද වැඩෙන්නාහ. එසේ ආයුෂයෙන් ද වැඩෙමින්, වර්ණයෙන් ද වැඩෙමින් සිටින දස අවුරුදු ආයුෂ ඇති මිනිසුන්ට විසි අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ. ‘‘මහණෙනි, එකල්හි ඒ සත්ත්‍වයන්ට මෙබඳු සිතක් ඇති වන්නේ ය. ‘අපි කුශල ධර්ම සමාදන් වීම හේතු කොටගෙන ආයුෂයෙන් ද වැඩෙමු. වර්ණයෙන් ද වැඩෙමු. අපි තව තවත් කුශලයක් කළ යුතු නම් මැනවි. කුමක් නම් කුශලයක් කරමු ද? අපි අදත්තාදානයෙන් වැළකිය යුතු නම් මැනවි… කාමයෙහි වරදවා හැසිරීමෙන් වැළකිය යුතු නම් මැනවි… බොරු කීමෙන් වැළකිය යුතු නම් මැනවි… කේලාම් බසින් වැළකිය යුතු නම් මැනවි… පරුෂ වචනයෙන් වැළකිය යුතු නම් මැනවි… හිස් වචන කීමෙන් වැළකිය යුතු නම් මැනවි… අභිධ්‍යාව දුරු කළ යුතු නම් මැනවි… ව්‍යාපාදය දුරු කළ යුතු නම් මැනවි… මිථ්‍යා දෘෂ්ටිය දුරු කළ යුතු නම් මැනවි… අධර්ම රාගය, විෂම ලෝභය, මිථ්‍යා ධර්මය යන මේ ධර්ම තුන දුරු කළ යුතු නම් මැනවි… අපි මව්පියන්ට සැලකිය යුතු වන්නෙමු. වැඩිහිටියන්ට සැලකිය යුතු වන්නෙමු. ශ්‍රමණ බ්‍රාහ්මණයන්ට සැලකිය යුතු වන්නෙමු. කුලයෙහි වැඩිමහල්ලන්ට ගරු බුහුමන් කරන්නෙමු. මෙය කුශල ධර්මයක් ලෙස සමාදන් වී වසමු’යි කියා ය. ඔවුහු මව්පියන්ට සලකන්නෝ ද, වැඩිහිටියන්ට සලකන්නෝ ද, ශ්‍රමණ බ්‍රාහ්මණයන්ට සලකන්නෝ ද, කුලයෙහි වැඩිමහල්ලන්ට ගරු බුහුමන් කරන්නෝ ද වන්නාහ. මෙය කුශල ධර්මයක් ලෙස සමාදන් වී වසන්නාහ. ‘‘ඔවුහු කුශල ධර්ම සමාදන් වීම හේතු කොටගෙන ආයුෂයෙන් ද වැඩෙන්නාහ. වර්ණයෙන් ද වැඩෙන්නාහ. එසේ ආයුෂයෙන් ද වැඩෙමින්, වර්ණයෙන් ද වැඩෙමින් සිටින විසි අවුරුදු ආයුෂ ඇති මිනිසුන්ට හතළිස් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… හතළිස් අවුරුදු ආයුෂ ඇති මිනිසුන්ට අසූ අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… අසූ අවුරුදු ආයුෂ ඇති මිනිසුන්ට සිය හැට අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… සිය හැට අවුරුදු ආයුෂ ඇති මිනිසුන්ට දෙසිය විසි අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… දෙසිය විසි අවුරුදු ආයුෂ ඇති මිනිසුන්ට සාරසිය හතලිස් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ. සාරසිය හතලිස් අවුරුදු ආයුෂ ඇති මිනිසුන්ට දෙදහස් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… දෙදහස් අවුරුදු ආයුෂ ඇති මිනිසුන්ට හාරදහස් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… හාරදහස් අවුරුදු ආයුෂ ඇති මිනිසුන්ට අටදහස් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… අටදහස් අවුරුදු ආයුෂ ඇති මිනිසුන්ට විසිදහස් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… විසිදහස් අවුරුදු ආයුෂ ඇති මිනිසුන්ට හතළිස්දහස් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… හතළිස්දහස් අවුරුදු ආයුෂ ඇති මිනිසුන්ට අසූදහස් අවුරුදු ආයුෂ ඇති පුත්‍රයෝ උපදින්නාහ… මහණෙනි, අසූදහස් අවුරුදු ආයුෂ ඇති මිනිසුන් අතර අවුරුදු පහක් වයසැති කුමාරිකාවන් විවාහයට සුදුසු වන්නාහ.",
      "paliTitle": "Āyuvaṇṇādivaḍḍhanakathā",
      "englishTitle": "Discourse on the Increase of Life, Beauty, etc.",
      "sinhalaTitle": "ආයු වර්ණාදි වර්ධන කථාව"
    },
    {
      "number": 106,
      "pali": "‘‘Asītivassasahassāyukesu, bhikkhave, manussesu tayo ābādhā bhavissanti, icchā, anasanaṃ, jarā. Asītivassasahassāyukesu, bhikkhave, manussesu ayaṃ jambudīpo iddho ceva bhavissati phīto ca, kukkuṭasampātikā gāmanigamarājadhāniyo [gāmanigamajanapadā rājadhāniyo (ka.)]. Asītivassasahassāyukesu, bhikkhave, manussesu ayaṃ jambudīpo avīci maññe phuṭo bhavissati manussehi, seyyathāpi naḷavanaṃ vā saravanaṃ [sāravanaṃ (syā.)] vā. Asītivassasahassāyukesu, bhikkhave, manussesu ayaṃ bārāṇasī ketumatī nāma rājadhānī bhavissati iddhā ceva phītā ca bahujanā ca ākiṇṇamanussā ca subhikkhā ca. Asītivassasahassāyukesu, bhikkhave, manussesu imasmiṃ jambudīpe caturāsītinagarasahassāni bhavissanti ketumatīrājadhānīpamukhāni. Asītivassasahassāyukesu, bhikkhave, manussesu ketumatiyā rājadhāniyā saṅkho nāma rājā uppajjissati cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni satta ratanāni bhavissanti, seyyathidaṃ, cakkaratanaṃ hatthiratanaṃ assaratanaṃ maṇiratanaṃ itthiratanaṃ gahapatiratanaṃ pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā bhavissanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ adaṇḍena asatthena dhammena abhivijiya ajjhāvasissati. ",
      "english": "\"In the time when humans live for eighty thousand years, bhikkhus, there will be three diseases: desire, lack of food, and old age. In the time when humans live for eighty thousand years, bhikkhus, this Jambudīpa will be prosperous and flourishing, with villages, towns, and capital cities close together like a hen's wing. In the time when humans live for eighty thousand years, bhikkhus, this Jambudīpa will seem like it's touching Avīci hell, so crowded will it be with people, just like a reed forest or a thicket of reeds. In the time when humans live for eighty thousand years, bhikkhus, this Bārāṇasī will be known as Ketumatī, a prosperous and flourishing capital city, full of people, crowded with humans, and with abundant food. In the time when humans live for eighty thousand years, bhikkhus, in this Jambudīpa there will be eighty-four thousand cities, with Ketumatī as the chief capital. In the time when humans live for eighty thousand years, bhikkhus, in the capital city of Ketumatī, a king named Saṅkha will arise, a wheel-turning monarch, a righteous king, a king of righteousness, a conqueror of the four quarters, who has attained stability in his country, and is endowed with the seven treasures. These seven treasures will be his: the wheel treasure, the elephant treasure, the horse treasure, the jewel treasure, the woman treasure, the householder treasure, and the counselor treasure as the seventh. He will have over a thousand sons, valiant and heroic, crushers of the armies of others. He will conquer and rule this earth, bounded by the ocean, not by force, not by weapons, but by righteousness.\"",
      "sinhala": "‘‘මහණෙනි, අසූ දහසක් අවුරුදු ආයු ඇති මිනිසුන්ගේ රෝග තුනක් වන්නේ ය, එනම්, ආශාව, නො කෑම සහ ජරාව යි. මහණෙනි, අසූ දහසක් අවුරුදු ආයු ඇති මිනිසුන්ගේ මේ ජම්බුද්වීපය සෞභාග්‍යවත් මෙන් ම සශ්‍රීක ද වන්නේ ය, කුකුළු පොරයක දී මෙන් ගම්, නියම්ගම්, නගර සහ රාජධානි එකිනෙක ගැටෙන්නේ ය. මහණෙනි, අසූ දහසක් අවුරුදු ආයු ඇති මිනිසුන්ගේ මේ ජම්බුද්වීපය මිනිසුන්ගෙන් පිරී ඉතිරී යන බැවින් අවීචියක් මෙන් වන්නේ ය, එනම්, එය උක් වනයක් හෝ සාර වනයක් මෙන් වන්නේ ය. මහණෙනි, අසූ දහසක් අවුරුදු ආයු ඇති මිනිසුන්ගේ මේ බරණැස් නුවර කේතුමතී නම් රාජධානිය වන්නේ ය, එය සෞභාග්‍යවත් මෙන් ම සශ්‍රීක ද බොහෝ ජනයාගෙන් පිරී ඉතිරී ගිය ද සුභික්ෂ ද වන්නේ ය. මහණෙනි, අසූ දහසක් අවුරුදු ආයු ඇති මිනිසුන්ගේ මේ ජම්බුද්වීපයෙහි කේතුමතී රාජධානිය ප්‍රධාන කොට ගත් නගර සූවිසි දහසක් වන්නේ ය. මහණෙනි, අසූ දහසක් අවුරුදු ආයු ඇති මිනිසුන්ගේ කේතුමතී රාජධානියෙහි සංඛ නම් සක්විති රජෙක් උපදින්නේ ය, ඔහු ධර්මිෂ්ඨ වූ ධර්ම රාජයෙක් වන්නේ ය, සිව්දිග් විජයග්‍රාහී වූ ජනපදයන්හි ස්ථාවරත්වය ලබා ගත් සත් රුවනින් යුක්ත වන්නේ ය. ඔහුට මේ සත් රුවන වන්නේ ය, එනම්, චක්‍ර රත්නය, හස්ති රත්නය, අශ්ව රත්නය, මණි රත්නය, ස්ත්‍රී රත්නය, ගහපති රත්නය සහ පරිණායක රත්නය සත් වනුව යි. ඔහුට ශූර වූ වීර පෙනුමැති සතුරු සේනාවන් මඬින පුත්‍රයන් දහසකට වැඩි ගණනක් වන්නේ ය. ඔහු මේ මුළු පොළොව සයුර කෙළවර කොට දඬු මුගුරු නැතිව අවි ආයුධ නැතිව ධර්මයෙන් ම යටත් කරගෙන වාසය කරන්නේ ය.’’",
      "paliTitle": "Saṅkharājauppatti",
      "englishTitle": "The Origin of Saṅkharāja",
      "sinhalaTitle": "සඞ්ඛරාජ උප්පත්තිය"
    },
    {
      "number": 107,
      "pali": "‘‘Asītivassasahassāyukesu, bhikkhave, manussesu metteyyo nāma bhagavā loke uppajjissati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. Seyyathāpāhametarahi loke uppanno arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedessati, seyyathāpāhametarahi imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedemi. So dhammaṃ desessati ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsessati; seyyathāpāhametarahi dhammaṃ desemi ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsemi. So anekasahassaṃ [anekasatasahassaṃ (ka.)] bhikkhusaṃghaṃ pariharissati, seyyathāpāhametarahi anekasataṃ bhikkhusaṃghaṃ pariharāmi.",
      "english": "\"In the future, when people live for eighty thousand years, the Blessed One named Metteyya will arise in the world, a worthy one, a fully enlightened one, perfect in knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of those who can be trained, teacher of gods and humans, a Buddha, a Blessed One. Just as I have arisen in the world at this time, a worthy one, a fully enlightened one, perfect in knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of those who can be trained, teacher of gods and humans, a Buddha, a Blessed One. He will make known this world—with its gods, its Māras, its Brahmās, this generation with its ascetics and brahmins, its gods and humans—having realized it himself with direct knowledge, just as I make known this world—with its gods, its Māras, its Brahmās, this generation with its ascetics and brahmins, its gods and humans—having realized it myself with direct knowledge. He will teach the Dhamma that is good in the beginning, good in the middle, and good in the end, with its meaning and phrasing, proclaiming the holy life that is perfectly complete and pure; just as I now teach the Dhamma that is good in the beginning, good in the middle, and good in the end, with its meaning and phrasing, proclaiming the holy life that is perfectly complete and pure. He will lead a Saṅgha of many thousands of monks, just as I now lead a Saṅgha of many hundreds of monks.\"",
      "sinhala": "‘‘මහණෙනි, අසූදහසක් අවුරුදු ආයු ඇති මිනිසුන් අතරේ මෛත්‍රෙය්‍ය නම් භාග්‍යවතුන් වහන්සේ ලොව පහළ වන සේක. අරහත් වූ, සම්මා සම්බුද්ධ වූ, විජ්ජාචරණ සම්පන්න වූ, සුගත වූ, ලෝකවිදූ වූ, අනුත්තර වූ, පුරිසදම්මසාරථී වූ, දේවමනුෂ්‍යයන්ට ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවත් වූ සේක. යම්සේ මම මේ කාලයෙහි ලොව පහළ වී අරහත් වූ, සම්මා සම්බුද්ධ වූ, විජ්ජාචරණ සම්පන්න වූ, සුගත වූ, ලෝකවිදූ වූ, අනුත්තර වූ, පුරිසදම්මසාරථී වූ, දේවමනුෂ්‍යයන්ට ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවත් වූයෙම් ද, එසෙයින් ම උන්වහන්සේ දේවතාවන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත මේ ලෝකය තමන්ගේම නුවණින් දැන ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරන සේක. යම්සේ මම මේ කාලයෙහි දේවතාවන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත, දෙවි මිනිසුන් සහිත මේ ලෝකය තමන්ගේම නුවණින් දැන ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරම් ද, එසෙයින් ම උන්වහන්සේ දහම් දෙසන සේක. මුල යහපත් වූ, මැද යහපත් වූ, අවසානය යහපත් වූ, අර්ථ සහිත වූ, ව්‍යඤ්ජන සහිත වූ, මුළුමනින් පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන සේක. යම්සේ මම මේ කාලයෙහි දහම් දෙසමි ද, මුල යහපත් වූ, මැද යහපත් වූ, අවසානය යහපත් වූ, අර්ථ සහිත වූ, ව්‍යඤ්ජන සහිත වූ, මුළුමනින් පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමි ද, එසෙයින් ම උන්වහන්සේ බොහෝ දහස් ගණන් භික්ෂු සංඝයා පිරිවරන සේක. යම්සේ මම මේ කාලයෙහි බොහෝ සිය ගණන් භික්ෂු සංඝයා පිරිවරාගෙන සිටිම් ද, එසෙයින් ම උන්වහන්සේත් පිරිවරන සේක.’’",
      "paliTitle": "Metteyyabuddhuppādo",
      "englishTitle": "The arising of Metteyya Buddha",
      "sinhalaTitle": "මෛත්‍රෙය බුද්ධුප්පාදො"
    },
    {
      "number": 108,
      "pali": "‘‘Atha kho, bhikkhave, saṅkho nāma rājā yo so yūpo raññā mahāpanādena kārāpito. Taṃ yūpaṃ ussāpetvā ajjhāvasitvā taṃ datvā vissajjitvā samaṇabrāhmaṇakapaṇaddhikavaṇibbakayācakānaṃ dānaṃ datvā metteyyassa bhagavato arahato sammāsambuddhassa santike kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajissati. So evaṃ pabbajito samāno eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati.",
      "english": "\"Then, monks, there will be a king named Saṅkha, who will have that sacrificial post erected by the king with great expenditure. Having raised up that post, occupied it, given it, and bestowed it, having given gifts to ascetics, brahmins, the poor, the needy, beggars, and supplicants, having shaved off his hair and beard in the presence of the Blessed Lord Metteyya, the Arahant, the Perfectly Enlightened One, having put on the ochre robes, he will go forth from the household life into homelessness. So, having gone forth in that way, living alone, secluded, diligent, ardent, and resolute, before long, for the sake of which sons of good families rightly go forth from the household life into homelessness, that unsurpassed consummation of the holy life, he will realize it for himself with direct knowledge in this very life, and having attained to it, he will abide.\"",
      "sinhala": "“මහණෙනි, ඉක්බිති සංඛ නම් රජෙක් යම් කෙනෙක් ඒ යූපය රජු විසින් මහත් ප්‍රණාදයෙන් කරවන ලද්දේ ද, ඒ යූපය ඔසවා, අධිවාස කොට, එය දන් දී, විසුරුවා හැර, ශ්‍රමණ බ්‍රාහ්මණ දුගී මගී යාචකයන්ට දන් දී, මෛත්‍රෙය භාග්‍යවතුන් වහන්සේගේ, අරහත් වූ, සම්මා සම්බුද්ධයන් වහන්සේගේ සමීපයෙහි කෙස් රැවුල් බහා, කසාවත් හැඳ, ගිහි ගෙයින් අනගාරිය ජීවිතයට පැවිදි වන්නේ ය. එසේ පැවිදි වූ ඔහු තනිව, වෙන්ව, අප්‍රමාදීව, වීර්යය ඇතිව, මනා වු සිහියෙන් යුක්තව වාසය කරමින්, යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ ගිහි ගෙයින් අනගාරිය ජීවිතයට මැනවින් පැවිදි වෙත් ද, ඒ අනුත්තර බ්‍රහ්මචරියා පර්යන්තය මේ ජීවිතයේදීම තමා විසින්ම විශේෂ දැනුමෙන් සාක්ෂාත් කොට, උපසම්පදා ලබා වාසය කරන්නේ ය.”",
      "paliTitle": ""
    },
    {
      "number": 109,
      "pali": "‘‘Attadīpā, bhikkhave, viharatha attasaraṇā anaññasaraṇā, dhammadīpā dhammasaraṇā anaññasaraṇā. Kathañca, bhikkhave, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo dhammadīpo dhammasaraṇo anaññasaraṇo? Idha, bhikkhave, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Vedanāsu vedanānupassī…pe… citte cittānupassī…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Evaṃ kho, bhikkhave, bhikkhu attadīpo viharati attasaraṇo anaññasaraṇo dhammadīpo dhammasaraṇo anaññasaraṇo.",
      "english": "\"Monks, dwell making yourselves your island, yourselves your refuge, with no other refuge; making the Dharma your island, the Dharma your refuge, with no other refuge. And how, monks, does a monk dwell making himself his island, himself his refuge, with no other refuge; making the Dharma his island, the Dharma his refuge, with no other refuge? Here, monks, a monk dwells contemplating the body in the body, ardent, fully knowing, mindful, having removed covetousness and displeasure in the world. He dwells contemplating feelings in feelings... He dwells contemplating mind in mind... He dwells contemplating phenomena in phenomena, ardent, fully knowing, mindful, having removed covetousness and displeasure in the world. Thus, monks, a monk dwells making himself his island, himself his refuge, with no other refuge; making the Dharma his island, the Dharma his refuge, with no other refuge.\"",
      "sinhala": "‘‘මහණෙනි, තමන් දිවයින කරගෙන, තමන් සරණ කරගෙන, අන්‍ය සරණක් නැතිව වාසය කරන්න. ධර්මය දිවයින කරගෙන, ධර්මය සරණ කරගෙන, අන්‍ය සරණක් නැතිව වාසය කරන්න. මහණෙනි, භික්ෂුවක් කෙසේ නම් තමන් දිවයින කරගෙන, තමන් සරණ කරගෙන, අන්‍ය සරණක් නැතිව, ධර්මය දිවයින කරගෙන, ධර්මය සරණ කරගෙන, අන්‍ය සරණක් නැතිව වාසය කරන්නේ ද?\n\nමහණෙනි, මේ ශාසනයෙහි භික්ෂුව කයෙහි කායානුපස්සීව, කෙලෙස් තවන වීර්ය ඇතිව, මනා සිහියෙන් යුක්තව, ලෝකයෙහි අභිධ්‍යා දෝමනස්සයන් දුරු කරමින් වාසය කරයි. වේදනාවන්හි වේදනානුපස්සීව… සිතෙහි චිත්තානුපස්සීව… ධර්මයන්හි ධම්මානුපස්සීව කෙලෙස් තවන වීර්ය ඇතිව, මනා සිහියෙන් යුක්තව, ලෝකයෙහි අභිධ්‍යා දෝමනස්සයන් දුරු කරමින් වාසය කරයි. මහණෙනි, භික්ෂුව මෙසේ තමන් දිවයින කරගෙන, තමන් සරණ කරගෙන, අන්‍ය සරණක් නැතිව, ධර්මය දිවයින කරගෙන, ධර්මය සරණ කරගෙන, අන්‍ය සරණක් නැතිව වාසය කරයි.’’",
      "paliTitle": ""
    },
    {
      "number": 110,
      "pali": "‘‘Gocare, bhikkhave, caratha sake pettike visaye. Gocare, bhikkhave, carantā sake pettike visaye āyunāpi vaḍḍhissatha, vaṇṇenapi vaḍḍhissatha, sukhenapi vaḍḍhissatha, bhogenapi vaḍḍhissatha, balenapi vaḍḍhissatha. ‘‘Kiñca, bhikkhave, bhikkhuno āyusmiṃ? Idha, bhikkhave, bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīriyasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, cittasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti, vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. So imesaṃ catunnaṃ iddhipādānaṃ bhāvitattā bahulīkatattā ākaṅkhamāno kappaṃ vā tiṭṭheyya kappāvasesaṃ vā. Idaṃ kho, bhikkhave, bhikkhuno āyusmiṃ. ‘‘Kiñca, bhikkhave, bhikkhuno vaṇṇasmiṃ? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Idaṃ kho, bhikkhave, bhikkhuno vaṇṇasmiṃ. ‘‘Kiñca, bhikkhave, bhikkhuno sukhasmiṃ? Idha, bhikkhave, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Idaṃ kho, bhikkhave, bhikkhuno, sukhasmiṃ. ‘‘Kiñca, bhikkhave, bhikkhuno bhogasmiṃ? Idha, bhikkhave, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ. Tathā tatiyaṃ. Tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati. Tathā dutiyaṃ. Tathā tatiyaṃ. Tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Idaṃ kho, bhikkhave, bhikkhuno bhogasmiṃ. ‘‘Kiñca, bhikkhave, bhikkhuno balasmiṃ? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idaṃ kho, bhikkhave, bhikkhuno balasmiṃ. ‘‘Nāhaṃ, bhikkhave, aññaṃ ekabalampi samanupassāmi yaṃ evaṃ duppasahaṃ, yathayidaṃ, bhikkhave, mārabalaṃ. Kusalānaṃ, bhikkhave, dhammānaṃ samādānahetu evamidaṃ puññaṃ pavaḍḍhatī’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. ",
      "english": "Wander, monks, in your own ancestral territory. Wandering, monks, in your own ancestral territory, you will increase in lifespan, you will increase in beauty, you will increase in happiness, you will increase in wealth, you will increase in strength.\n\nAnd what, monks, is a monk's increase in lifespan? Here, monks, a monk develops the path to power consisting of concentration due to desire, and striving; he develops the path to power consisting of concentration due to energy, and striving; he develops the path to power consisting of concentration due to mind, and striving; he develops the path to power consisting of concentration due to investigation, and striving. Because he has developed and cultivated these four paths to power, if he wishes, he might remain for a kalpa, or for the remainder of a kalpa. This, monks, is a monk's increase in lifespan.\n\nAnd what, monks, is a monk's increase in beauty? Here, monks, a monk is virtuous, dwells restrained by the restraint of the monastic code, possessed of good conduct and proper behavior, seeing danger in the slightest faults, training himself in the training rules. This, monks, is a monk's increase in beauty.\n\nAnd what, monks, is a monk's increase in happiness? Here, monks, quite secluded from sensual pleasures, secluded from unwholesome states, he enters and dwells in the first jhāna, which is accompanied by thought and examination, born of seclusion, filled with rapture and happiness. With the subsiding of thought and examination…he enters and dwells in the second jhāna…he enters and dwells in the third jhāna…he enters and dwells in the fourth jhāna. This, monks, is a monk's increase in happiness.\n\nAnd what, monks, is a monk's increase in wealth? Here, monks, a monk dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus above, below, across, everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility, without ill-will. He dwells pervading one direction with a mind imbued with compassion…He dwells pervading one direction with a mind imbued with gladness…He dwells pervading one direction with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth. Thus above, below, across, everywhere, and to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility, without ill-will. This, monks, is a monk's increase in wealth.\n\nAnd what, monks, is a monk's increase in strength? Here, monks, a monk, through the destruction of the taints, having realized it for himself with direct knowledge, enters and dwells in the taintless liberation of mind, liberation by wisdom, in this very life. This, monks, is a monk's increase in strength.\n\nI do not, monks, see even one other strength that is so difficult to overcome, as this, monks, the strength of Māra. Due to undertaking wholesome qualities, this merit thus increases.\n\nThat is what the Blessed One said. The monks were satisfied, and delighted in the Blessed One's words.",
      "sinhala": "‘‘මහණෙනි, ඔබගේ පියාපරම්පරාවෙන් ආ දායාදයට අයත් සීමාවන් තුළ හැසිරෙන්න. මහණෙනි, ඔබගේ පියාපරම්පරාවෙන් ආ දායාදයට අයත් සීමාවන් තුළ හැසිරෙමින් ආයුෂයෙන් ද වර්ධනය වන්නහු ය, ශරීර වර්ණයෙන් ද වර්ධනය වන්නහු ය, සැපයෙන් ද වර්ධනය වන්නහු ය, භෝග සම්පත්තියෙන් ද වර්ධනය වන්නහු ය, ශක්තියෙන් ද වර්ධනය වන්නහු ය.\n\n‘‘මහණෙනි, භික්ෂුවකගේ ආයුෂ වැඩීමට කවර කරුණක් ද? මහණෙනි, මේ සස්නෙහි භික්ෂුව ඡන්ද සමාධි ප්‍රධාන සංස්කාරයන්ගෙන් සමන්විත සෘද්ධිපාදය වඩයි. වීර්ය සමාධි ප්‍රධාන සංස්කාරයන්ගෙන් සමන්විත සෘද්ධිපාදය වඩයි. චිත්ත සමාධි ප්‍රධාන සංස්කාරයන්ගෙන් සමන්විත සෘද්ධිපාදය වඩයි. විමංසා සමාධි ප්‍රධාන සංස්කාරයන්ගෙන් සමන්විත සෘද්ධිපාදය වඩයි. හෙතෙම මේ සෘද්ධිපාද සතර මැනවින් වඩන ලද්දේ, බොහෝ වාරයක් පුරුදු කරන ලද්දේ නම් කල්පයක් හෝ කල්පාවශේෂයක් හෝ සිටීමට කැමති වන්නේ ය. මහණෙනි, භික්ෂුවකගේ ආයුෂ වැඩීම මෙය යි.\n\n‘‘මහණෙනි, භික්ෂුවකගේ ශරීර වර්ණය වැඩීමට කවර කරුණක් ද? මහණෙනි, මේ සස්නෙහි භික්ෂුව සිල්වත් වන්නේ ය. ප්‍රාතිමෝක්ෂ සංවර සීලයෙන් සංයුක්තව වාසය කරයි. යහපත් ආචාර ගෝචරත්වයෙන් යුක්ත වේ. අනුමාත්‍ර වූ වරදෙහි පවා බිය දකින්නේ ය. හික්මීමේ පදයන්හි සමාදන්ව හික්මෙයි. මහණෙනි, භික්ෂුවකගේ ශරීර වර්ණය වැඩීම මෙය යි.\n\n‘‘මහණෙනි, භික්ෂුවකගේ සැපය වැඩීමට කවර කරුණක් ද? මහණෙනි, මේ සස්නෙහි භික්ෂුව කාමයන්ගෙන් වෙන්ව ම, අකුසල ධර්මයන්ගෙන් වෙන්ව ම විතර්ක සහිතව විචාර සහිතව විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු වන ධ්‍යානය උපසම්පදා කර වාසය කරයි. විතර්ක විචාරයන්ගේ සංසිඳීමෙන් ...පෙ... දෙවන ධ්‍යානය ...පෙ... තුන්වන ධ්‍යානය ...පෙ... සතරවන ධ්‍යානය උපසම්පදා කර වාසය කරයි. මහණෙනි, භික්ෂුවකගේ සැපය වැඩීම මෙය යි.\n\n‘‘මහණෙනි, භික්ෂුවකගේ භෝග සම්පත්තිය වැඩීමට කවර කරුණක් ද? මහණෙනි, මේ සස්නෙහි භික්ෂුව මෛත්‍රිය සහගත සිතින් එක් දිශාවක් ස්පර්ශ කර වාසය කරයි. එලෙස ම දෙවන දිශාව ස්පර්ශ කරයි. එලෙස ම තුන්වන දිශාව ස්පර්ශ කරයි. එලෙස ම සතරවන දිශාව ස්පර්ශ කරයි. මෙසේ උඩ යට සරස සියලු අතින් සියලු සත්වයන් කෙරෙහි මෛත්‍රී සහගත වූ විශාල වූ මහත් වූ අප්‍රමාණ වූ වෛර රහිත වූ ක්‍රෝධ රහිත වූ සිතින් මුළු ලෝකය ම ස්පර්ශ කර වාසය කරයි. කරුණා සහගත සිතින් ...පෙ... මුදිතා සහගත සිතින් ...පෙ... උපේක්ෂා සහගත සිතින් එක් දිශාවක් ස්පර්ශ කර වාසය කරයි. එලෙස ම දෙවන දිශාව ස්පර්ශ කරයි. එලෙස ම තුන්වන දිශාව ස්පර්ශ කරයි. එලෙස ම සතරවන දිශාව ස්පර්ශ කරයි. මෙසේ උඩ යට සරස සියලු අතින් සියලු සත්වයන් කෙරෙහි උපේක්ෂා සහගත වූ විශාල වූ මහත් වූ අප්‍රමාණ වූ වෛර රහිත වූ ක්‍රෝධ රහිත වූ සිතින් මුළු ලෝකය ම ස්පර්ශ කර වාසය කරයි. මහණෙනි, භික්ෂුවකගේ භෝග සම්පත්තිය වැඩීම මෙය යි.\n\n‘‘මහණෙනි, භික්ෂුවකගේ ශක්තිය වැඩීමට කවර කරුණක් ද? මහණෙනි, මේ සස්නෙහි භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චිත්ත විමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ජීවිතයේ දී ම තමා විසින් ම විශේෂ දැනුමෙන් දැන ප්‍රත්‍යක්ෂ කොට උපසම්පදා කර වාසය කරයි. මහණෙනි, භික්ෂුවකගේ ශක්තිය වැඩීම මෙය යි.\n\n‘‘මහණෙනි, මේ මාර බලයට වඩා දරාගත නොහැකි වෙනත් එක බලයක් වත් මම නොදකිමි. මහණෙනි, කුසල ධර්මයන්හි සමාදන් වීම හේතුවෙන් මෙසේ මේ පින් වැඩෙන්නේ ය.’’\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගත්තාහු ය.",
      "paliTitle": "Bhikkhunoāyuvaṇṇādivaḍḍhanakathā",
      "englishTitle": "The Discourse on Increasing a Monk's Life, Complexion, etc.",
      "sinhalaTitle": "භික්‍ෂුණෝආයුවණ්ණාදිවඩ්ඪනකථා"
    }
  ],
  "footer": {
    "pali": "Cakkavattisuttaṃ niṭṭhitaṃ tatiyaṃ.",
    "english": "The Cakkavattisutta is finished, the third.",
    "sinhala": "චක්කවත්ති සූත්‍රය නිමි."
  }
}