{
  "id": "dn.3.9",
  "title": {
    "pali": "Āṭānāṭiyasuttaṃ",
    "english": "Āṭānāṭiya Discourse",
    "sinhala": "ආටානාටිය සූත්‍රය"
  },
  "sections": [
    {
      "number": 275,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho cattāro mahārājā [mahārājāno (ka.)] mahatiyā ca yakkhasenāya mahatiyā ca gandhabbasenāya mahatiyā ca kumbhaṇḍasenāya mahatiyā ca nāgasenāya catuddisaṃ rakkhaṃ ṭhapetvā catuddisaṃ gumbaṃ ṭhapetvā catuddisaṃ ovaraṇaṃ ṭhapetvā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ gijjhakūṭaṃ pabbataṃ obhāsetvā [gijjhakūṭaṃ obhāsetvā (sī. syā. pī.)] yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Tepi kho yakkhā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu, appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu, appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu, appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu, appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu.",
      "english": "Thus have I heard: At one time the Blessed One was dwelling at Rājagaha, on Vulture Peak Mountain. Then the four Great Kings, with a great army of yakkhas, a great army of gandhabbas, a great army of kumbhaṇḍas, and a great army of nāgas, having established protection in the four directions, having established guards in the four directions, having established a barrier in the four directions, when the night was far advanced, with surpassing radiance illuminating the entirety of Vulture Peak Mountain, approached the Blessed One; having approached, they paid homage to the Blessed One and sat down to one side. Those yakkhas also, some of them, having paid homage to the Blessed One, sat down to one side; some of them exchanged courteous greetings with the Blessed One, conversing in a friendly and civil manner, and sat down to one side; some of them, raising their joined palms towards the Blessed One, sat down to one side; some of them announced their name and clan and sat down to one side; some of them silently sat down to one side.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ඣකූට පර්වතයෙහි වැඩ වාසය කරන සේක. එකල්හි මහා රජවරු සතර දෙනා මහත් යක්ෂ සේනාවත්, මහත් ගන්ධර්ව සේනාවත්, මහත් කුම්භාණ්ඩ සේනාවත්, මහත් නාග සේනාවත් යන සතර දිසාවෙහි ආරක්ෂාව තබා, සතර දිසාවෙහි ගුප්ත ආරක්ෂාව තබා, සතර දිසාවෙහි වැටවල් තබා, රාත්‍රිය ඉක්ම ගිය කල්හි, බබළන ශරීර වර්ණයෙන් යුක්තව, මුළු ගිජ්ඣකූට පර්වතයම බබුළුවමින්, භාග්‍යවතුන් වහන්සේ වැඩ සිටින තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට නමස්කාර කොට එකත්පස්ව හුන්හ. ඒ යක්ෂයන් අතුරෙන් ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේට නමස්කාර කොට එකත්පස්ව හුන්හ. ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු කථාව, සිහි කටයුතු කථාව නිමවා එකත්පස්ව හුන්හ. ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේ වෙතට ඇඳිලි බැඳ එකත්පස්ව හුන්හ. ඇතැම් කෙනෙක් නම සහ ගෝත්‍රය ප්‍රකාශ කොට එකත්පස්ව හුන්හ. ඇතැම් කෙනෙක් නිශ්ශබ්දව එකත්පස්ව හුන්හ.",
      "paliTitle": "Paṭhamabhāṇavāro",
      "englishTitle": "First Recitation Section",
      "sinhalaTitle": "පළමු භාණවරය"
    },
    {
      "number": 276,
      "pali": "Ekamantaṃ nisinno kho vessavaṇo mahārājā bhagavantaṃ etadavoca – ‘‘santi hi, bhante, uḷārā yakkhā bhagavato appasannā. Santi hi, bhante, uḷārā yakkhā bhagavato pasannā. Santi hi, bhante, majjhimā yakkhā bhagavato appasannā. Santi hi, bhante, majjhimā yakkhā bhagavato pasannā. Santi hi, bhante, nīcā yakkhā bhagavato appasannā. Santi hi, bhante, nīcā yakkhā bhagavato pasannā. Yebhuyyena kho pana, bhante, yakkhā appasannāyeva bhagavato. Taṃ kissa hetu? Bhagavā hi, bhante, pāṇātipātā veramaṇiyā dhammaṃ deseti, adinnādānā veramaṇiyā dhammaṃ deseti, kāmesumicchācārā veramaṇiyā dhammaṃ deseti, musāvādā veramaṇiyā dhammaṃ deseti, surāmerayamajjappamādaṭṭhānā veramaṇiyā dhammaṃ deseti. Yebhuyyena kho pana, bhante, yakkhā appaṭiviratāyeva pāṇātipātā, appaṭiviratā adinnādānā, appaṭiviratā kāmesumicchācārā, appaṭiviratā musāvādā, appaṭiviratā surāmerayamajjappamādaṭṭhānā. Tesaṃ taṃ hoti appiyaṃ amanāpaṃ. Santi hi, bhante, bhagavato sāvakā araññavanapatthāni pantāni senāsanāni paṭisevanti appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni [manussarāhaseyyakāni (sī. syā. pī.)] paṭisallānasāruppāni. Tattha santi uḷārā yakkhā nivāsino, ye imasmiṃ bhagavato pāvacane appasannā. Tesaṃ pasādāya uggaṇhātu, bhante, bhagavā āṭānāṭiyaṃ rakkhaṃ bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ guttiyā rakkhāya avihiṃsāya phāsuvihārāyā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho vessavaṇo mahārājā bhagavato adhivāsanaṃ viditvā tāyaṃ velāyaṃ imaṃ āṭānāṭiyaṃ rakkhaṃ abhāsi –",
      "english": "Having sat down to one side, Vessavaṇa the Great King said this to the Blessed One: \"Venerable sir, there are indeed yakkhas who are eminent and not pleased with the Blessed One. There are indeed yakkhas who are eminent and pleased with the Blessed One. There are indeed yakkhas who are middling and not pleased with the Blessed One. There are indeed yakkhas who are middling and pleased with the Blessed One. There are indeed yakkhas who are lowly and not pleased with the Blessed One. There are indeed yakkhas who are lowly and pleased with the Blessed One. But for the most part, venerable sir, the yakkhas are not at all pleased with the Blessed One. Why is that? Because, venerable sir, the Blessed One teaches the Dhamma on abstaining from the taking of life, the Blessed One teaches the Dhamma on abstaining from taking what is not given, the Blessed One teaches the Dhamma on abstaining from misconduct in sensual pleasures, the Blessed One teaches the Dhamma on abstaining from false speech, the Blessed One teaches the Dhamma on abstaining from intoxicants causing negligence. But for the most part, venerable sir, the yakkhas are not abstaining from the taking of life, not abstaining from taking what is not given, not abstaining from misconduct in sensual pleasures, not abstaining from false speech, not abstaining from intoxicants causing negligence. That is displeasing and disagreeable to them. Venerable sir, there are disciples of the Blessed One who frequent remote resting places in forests and woodlands—places that are quiet, with little noise, devoid of people, secluded from men, suitable for retreat. There are eminent yakkhas living there who are not pleased with this teaching of the Blessed One. For the pleasing of those yakkhas, venerable sir, may the Blessed One learn the Āṭānāṭiya protection for the safety, protection, non-violence, and comfortable dwelling of monks, nuns, laymen, and laywomen.” The Blessed One consented in silence. Then Vessavaṇa the Great King, knowing that the Blessed One had consented, on that occasion recited this Āṭānāṭiya protection:",
      "sinhala": "එකත්පස්ව හුන් වෙසවණ මહારාජ තෙම භාග්‍යවතුන් වහන්සේට මෙය පැවසීය. “ස්වාමීනී, භාග්‍යවතුන් වහන්සේ කෙරෙහි නොප්‍රසන්න වූ උසස් යක්ෂයෝ ද සිටිති. ස්වාමීනී, භාග්‍යවතුන් වහන්සේ කෙරෙහි ප්‍රසන්න වූ උසස් යක්ෂයෝ ද සිටිති. ස්වාමීනී, භාග්‍යවතුන් වහන්සේ කෙරෙහි නොප්‍රසන්න වූ මධ්‍යම යක්ෂයෝ ද සිටිති. ස්වාමීනී, භාග්‍යවතුන් වහන්සේ කෙරෙහි ප්‍රසන්න වූ මධ්‍යම යක්ෂයෝ ද සිටිති. ස්වාමීනී, භාග්‍යවතුන් වහන්සේ කෙරෙහි නොප්‍රසන්න වූ පහත් යක්ෂයෝ ද සිටිති. ස්වාමීනී, භාග්‍යවතුන් වහන්සේ කෙරෙහි ප්‍රසන්න වූ පහත් යක්ෂයෝ ද සිටිති. එහෙත් ස්වාමීනී, බොහෝ දුරට යක්ෂයෝ භාග්‍යවතුන් වහන්සේ කෙරෙහි නොප්‍රසන්න වූවෝ ම වෙති. එයට හේතුව කුමක් ද? ස්වාමීනී, භාග්‍යවතුන් වහන්සේ ප්‍රාණඝාතයෙන් වැළකීමෙහි ධර්මය දේශනා කරන සේක. අදත්තාදානයෙන් වැළකීමෙහි ධර්මය දේශනා කරන සේක. කාමමිථ්‍යාචාරයෙන් වැළකීමෙහි ධර්මය දේශනා කරන සේක. මුසාවාදයෙන් වැළකීමෙහි ධර්මය දේශනා කරන සේක. සුරාමේරයමජ්ජපමාදට්ඨානයෙන් වැළකීමෙහි ධර්මය දේශනා කරන සේක. එහෙත් ස්වාමීනී, බොහෝ දුරට යක්ෂයෝ ප්‍රාණඝාතයෙන් නොවැළකී සිටිති. අදත්තාදානයෙන් නොවැළකී සිටිති. කාමමිථ්‍යාචාරයෙන් නොවැළකී සිටිති. මුසාවාදයෙන් නොවැළකී සිටිති. සුරාමේරයමජ්ජපමාදට්ඨානයෙන් නොවැළකී සිටිති. එය ඔවුන්ට අප්‍රිය වේ. අමනාප වේ. ස්වාමීනී, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයෝ වනයෙහි වනපෙත්වල දුරස්ථ වූ ජනයාගෙන් තොර වූ නිශ්ශබ්ද වූ මහ හඬක් නැති පාළු සුළං හමන මිනිසුන්ගෙන් සැඟවුණු ප්‍රදේශවල වාසය කරමින් ඒකාන්තයෙන් වාසය කිරීම සුදුසු විහාරයන්හි වාසය කරති. එහි භාග්‍යවතුන් වහන්සේගේ මෙම ශාසනය කෙරෙහි නොප්‍රසන්න වූ උසස් යක්ෂයෝ වාසය කරති. ස්වාමීනී, ඔවුන්ගේ ප්‍රසාදය සඳහා භාග්‍යවතුන් වහන්සේ භික්ෂූන්ගේ, භික්ෂුණීන්ගේ, උපාසකයන්ගේ, උපාසිකාවන්ගේ ආරක්ෂාව සඳහා, රැකවරණය සඳහා, අවිහිංසාව සඳහා, පහසුවෙන් වාසය කිරීම සඳහා ආටානාටිය නම් ආරක්ෂාව ඉගෙන ගන්නා සේක්වා.” භාග්‍යවතුන් වහන්සේ නිහඬ පිළිගැනීමෙන් එය ඉවසා වදාළ සේක. අනතුරුව වෙසවණ මහරජු භාග්‍යවතුන් වහන්සේගේ ඉවසීම දැන ඒ මොහොතෙහි ම මේ ආටානාටිය ආරක්ෂාව පැවසීය.",
      "paliTitle": ""
    },
    {
      "number": 277,
      "pali": "‘‘Vipassissa ca [ime cakārā porāṇapotthakesu natthi] namatthu, cakkhumantassa sirīmato. Sikhissapi ca [ime cakārā porāṇapotthakesu natthi] namatthu, sabbabhūtānukampino. ‘‘Vessabhussa ca [ime cakārā porāṇapotthakesu natthi] namatthu, nhātakassa tapassino; Namatthu kakusandhassa, mārasenāpamaddino. ‘‘Koṇāgamanassa namatthu, brāhmaṇassa vusīmato; Kassapassa ca [ime cakārā porāṇapotthakesu natthi] namatthu, vippamuttassa sabbadhi. ‘‘Aṅgīrasassa namatthu, sakyaputtassa sirīmato; Yo imaṃ dhammaṃ desesi [dhammamadesesi (sī. syā. pī.), dhammaṃ deseti (?)], sabbadukkhāpanūdanaṃ. ‘‘Ye cāpi nibbutā loke, yathābhūtaṃ vipassisuṃ; Te janā apisuṇātha [apisuṇā (sī. syā. pī.)], mahantā vītasāradā. ‘‘Hitaṃ devamanussānaṃ, yaṃ namassanti gotamaṃ; Vijjācaraṇasampannaṃ, mahantaṃ vītasāradaṃ.",
      "english": "Homage to Vipassi, the eye-endowed, the glorious one. Homage also to Sikhi, the compassionate one towards all beings.\n\nHomage also to Vessabhu, the cleansing, the ardent one; Homage to Kakusandha, the subduer of the army of Mara.\n\nHomage to Konagamana, the brahmin of fulfilled life; Homage also to Kassapa, the one freed in all respects.\n\nHomage to Angirasa, the glorious son of the Sakyans; Who taught this Dhamma, the dispeller of all suffering.\n\nThose who are extinguished in the world, having seen according to reality; Those people, free from malice, are great, devoid of fear.\n\nFor the good of gods and humans, they pay homage to Gotama; Accomplished in knowledge and conduct, great, devoid of fear.",
      "sinhala": "‘‘ඇස් ඇති, ශ්‍රීමත් විපස්සි භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා. සියලු සත්වයන් කෙරෙහි අනුකම්පා කරන්නා වූ සිඛී භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා.\n‘‘ස්නානය කළ, තපස් රකින්නා වූ වෙස්සභූ භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා. මාර සේනාව මඩින ලද කකුසඳ භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා.\n‘‘වාසනාවන්ත වූ කොණාගමන බ්‍රාහ්මණ භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා. සියල්ලෙහිම විමුක්තිය ලැබූ කාශ්‍යප භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා.\n‘‘ශ්‍රීමත් ශාක්‍යපුත්‍ර වූ අංගීරස භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා. යම් භාග්‍යවතුන් වහන්සේ නමක් සියලු දුක් නැති කරන මේ ධර්මය දේශනා කළ සේක් ද, උන්වහන්සේට ද නමස්කාර වේවා.\n‘‘ලෝකයෙහි යම් කෙනෙක් නිවුණාහු ද, යථා පරිදි විදර්ශනා කළාහු ද, ඒ ජනයා ද ගුණ කියන්නාහු ය, ශ්‍රේෂ්ඨ වූ නිර්භය වූවාහු ය.\n‘‘දේව මනුෂ්‍යයන්ට හිත වූ යම් ගෞතමයන් වහන්සේ නමස්කාර කරත් ද, විද්‍යාචරණ සම්පන්න වූ, ශ්‍රේෂ්ඨ වූ, නිර්භය වූ උන්වහන්සේට ද නමස්කාර වේවා.",
      "paliTitle": ""
    },
    {
      "number": 278,
      "pali": "‘‘Yato uggacchati sūriyo [suriyo (sī. syā. pī.)], ādicco maṇḍalī mahā. Yassa cuggacchamānassa, saṃvarīpi nirujjhati; Yassa cuggate sūriye, ‘divaso’ti pavuccati. ‘‘Rahadopi tattha gambhīro, samuddo saritodako; Evaṃ taṃ tattha jānanti, ‘samuddo saritodako’. ‘‘Ito ‘sā purimā disā’, iti naṃ ācikkhatī jano; Yaṃ disaṃ abhipāleti, mahārājā yasassi so. ‘‘Gandhabbānaṃ adhipati [ādhipati (sī. syā. pī.) evamuparipi], ‘dhataraṭṭho’ti nāmaso; Ramatī naccagītehi, gandhabbehi purakkhato. ‘‘Puttāpi tassa bahavo, ekanāmāti me sutaṃ; Asīti dasa eko ca, indanāmā mahabbalā. Te cāpi buddhaṃ disvāna, buddhaṃ ādiccabandhunaṃ; Dūratova namassanti, mahantaṃ vītasāradaṃ. ‘‘Namo te purisājañña, namo te purisuttama; Kusalena samekkhasi, amanussāpi taṃ vandanti; Sutaṃ netaṃ abhiṇhaso, tasmā evaṃ vademase. ‘‘‘Jinaṃ vandatha gotamaṃ, jinaṃ vandāma gotamaṃ; Vijjācaraṇasampannaṃ, buddhaṃ vandāma gotamaṃ’.",
      "english": "From where the sun arises, the great orb, the radiant one; and as it arises, even darkness ceases; and as the sun has risen, it is called ‘day.’\n\nEven a lake there is deep, a sea with river-water; thus they know it there, ‘a sea with river-water.’\n\n‘This is the eastern direction,’ thus people declare; the direction that is governed by the glorious Great King.\n\nThe overlord of the Gandharvas, named Dhataraṭṭha; he delights in dance and song, attended by Gandharvas.\n\nHe also has many sons, all with one name, so I have heard; eighty, ten, and one, named Inda, of great strength. Seeing the Buddha, the kinsman of the sun, even they from afar pay homage to the Buddha, the great one, free from anxiety.\n\nHomage to you, O noble man; homage to you, O supreme man; with skill you consider. Even non-humans venerate you; this we have heard repeatedly, therefore we speak thus.\n\n‘Venerate the Conqueror Gotama, we venerate the Conqueror Gotama; accomplished in knowledge and conduct, we venerate the Buddha Gotama.’",
      "sinhala": "‘‘හිරු උදා වන්නේ යම් තැනක සිට ද, යම් හිරු මඬලක් උදාවන විට අඳුර දුරු වේ ද, යම් හිරු උදාවීම හේතුවෙන් ‘දිනය’ යැයි කියනු ලැබේ ද;\n\n‘‘එහි ගැඹුරු විල ද ඇත. ගංගා ජලය සහිත මුහුද ද ඇත. එහිදී එය ‘ගංගා ජලය සහිත මුහුද’ ලෙස ඔවුහු හඳුනති.\n\n‘‘මෙතැන් සිට ‘ඒ පෙරදිගයි’ කියා ජනයා එය හඳුන්වති. යම් දිශාවක් යසස් ඇති මහාරාජයා විසින් පාලනය කරනු ලැබේ ද;\n\n‘‘ගන්ධර්වයන්ගේ අධිපති, ‘ධෘතරාෂ්ට්‍ර’ නම් වේ. ඔහු ගන්ධර්වයන් විසින් වට කරනු ලැබ නාට්‍ය ගීතවලින් සතුටු වෙයි.\n\n‘‘ඔහුට බොහෝ පුත්‍රයෝ ද සිටිති. ඔවුන් සියල්ලෝ ම එකම නමින් හඳුන්වනු ලැබෙති. අසූ එකක් දස දෙනෙක් ද වෙති. ඔවුහු ඉන්ද්‍ර නම් වන අතර මහත් බලවත් වෙති. ඔවුන් ද බුදුන් දැක, සූර්ය වංශික බුදුන් දැක, දුර සිට ම නමස්කාර කරති. මහත් වූ කෙලෙස් රහිත බිය දුරු කළ උත්තමයාණන්ට නමස්කාර කරති.\n\n‘‘නමෝ තේ පුරිසාජඤ්ඤ, නමෝ තේ පුරිසොත්තම. යහපතින් විමසා බලන ඔබ වහන්සේට නමස්කාර වේවා. අමනුෂ්‍යයෝ ද ඔබට වඳිති. මෙය නිතර අසන්නට ලැබෙන දෙයක් නොවේ. එබැවින් මෙසේ කියමු.\n\n‘‘‘ජින ගෞතමයන් වඳින්න. ජින ගෞතමයන්ට වඳිමු. විද්‍යාචරණ සම්පන්න බුදු ගෞතමයන් වඳිමු.’’’",
      "paliTitle": ""
    },
    {
      "number": 279,
      "pali": "‘‘Yena petā pavuccanti, pisuṇā piṭṭhimaṃsikā. Pāṇātipātino luddā [luddhā (pī. ka.)], corā nekatikā janā. ‘‘Ito ‘sā dakkhiṇā disā’, iti naṃ ācikkhatī jano; Yaṃ disaṃ abhipāleti, mahārājā yasassi so. ‘‘Kumbhaṇḍānaṃ adhipati, ‘virūḷho’ iti nāmaso; Ramatī naccagītehi, kumbhaṇḍehi purakkhato. ‘‘Puttāpi tassa bahavo, ekanāmāti me sutaṃ; Asīti dasa eko ca, indanāmā mahabbalā. Te cāpi buddhaṃ disvāna, buddhaṃ ādiccabandhunaṃ; Dūratova namassanti, mahantaṃ vītasāradaṃ. ‘‘Namo te purisājañña, namo te purisuttama; Kusalena samekkhasi, amanussāpi taṃ vandanti; Sutaṃ netaṃ abhiṇhaso, tasmā evaṃ vademase. ‘‘‘Jinaṃ vandatha gotamaṃ, jinaṃ vandāma gotamaṃ; Vijjācaraṇasampannaṃ, buddhaṃ vandāma gotamaṃ’.",
      "english": "\"By which deeds are beings called 'departed ones,' backbiting slanderers, murderers, cruel beings, thieves, and deceivers.\" \"This is the southern direction,\" thus people declare it; the direction which that glorious great king rules over. \"He is the chief of the Kumbhaṇḍas, by the name of Virūḷha; he delights in dancing and song, surrounded by Kumbhaṇḍas.\" \"He also has many sons, of one name, so I have heard; one hundred and eighty, all named Inda, of great power.\" They too, having seen the Buddha, the Buddha, kinsman of the sun, from afar pay homage to the great one, devoid of arrogance. \"Homage to you, noblest of men, homage to you, supreme of men; with skill you regard even non-humans who pay homage to you; This has been heard repeatedly, therefore we speak thus.\" \"'Pay homage to the Conqueror Gotama, we pay homage to the Conqueror Gotama; Accomplished in knowledge and conduct, we pay homage to the Buddha Gotama.'\"",
      "sinhala": "“කුමණ ක්‍රියාවකින් ප්‍රේතයන් යයි කියනු ලබත් ද, කේලාම් කියන්නෝ ද, පිටුපසින් කතා කරන්නෝ ද, ප්‍රාණඝාත කරන්නෝ ද, ලෝභී වූවෝ ද, සොරකම් කරන්නෝ ද, නීච ජනයෝ ද වෙති. “මෙතැන් සිට දකුණු දිශාව මෙයයි” කියා ජනයා ඔහු හඳුන්වති; යම් දිශාවක් යසස් ඇති මහා රජතෙම පාලනය කෙරේද,\n\n“කුම්භාණ්ඩයන්ගේ අධිපති වූ විරූඪ නම් ඇත්තා කුම්භාණ්ඩයන් විසින් පෙරටු කරණ ලද්දේ නටමින් ගයමින් සතුටු වෙයි.\n\n“එසේම ඔහුට බොහෝ පුත්‍රයෝ ද වෙති, ඔවුන් සියල්ලෝම එකම නමින් යුක්තයයි මම අසා ඇත්තෙමි; අනූ එකක් දස දෙනෙක් හා එක් අයෙක් ඉන්ද්‍ර නම් මහත් බල ඇත්තාහ. ඒ අය ද බුදුන් දැක, සූර්ය වංශික බුදුන් දැක බොහෝ දුර සිටම මහත් වූ කෙලෙස් රහිත සාරද ඇති බුදුන්ට නමස්කාර කරති.\n\n“පුරිස ශ්‍රේෂ්ඨයාණෙනි, ඔබට නමස්කාර වේවා; පුරිස උත්තමයාණෙනි, ඔබට නමස්කාර වේවා; ඔබ කුසලයෙන් මැනවින් විමසන්නෙහි ද, අමනුෂ්‍යයෝ ද ඔබ වඳිත් ද; මෙය නිතර අසන ලද්දේ වෙයි, එහෙයින් මෙසේ කියමු.\n\n“ජින ගෞතමයන් වඳින්න, ජින ගෞතමයන් වඳිමු; විද්‍යාචරණ සම්පන්න වූ බුදු ගෞතමයන් වඳිමු”.",
      "paliTitle": ""
    },
    {
      "number": 280,
      "pali": "‘‘Yattha coggacchati sūriyo, ādicco maṇḍalī mahā. Yassa coggacchamānassa, divasopi nirujjhati; Yassa coggate sūriye, ‘saṃvarī’ti pavuccati. ‘‘Rahadopi tattha gambhīro, samuddo saritodako; Evaṃ taṃ tattha jānanti, ‘samuddo saritodako’. ‘‘Ito ‘sā pacchimā disā’, iti naṃ ācikkhatī jano; Yaṃ disaṃ abhipāleti, mahārājā yasassi so. ‘‘Nāgānañca adhipati, ‘virūpakkho’ti nāmaso; Ramatī naccagītehi, nāgeheva purakkhato. ‘‘Puttāpi tassa bahavo, ekanāmāti me sutaṃ; Asīti dasa eko ca, indanāmā mahabbalā. Te cāpi buddhaṃ disvāna, buddhaṃ ādiccabandhunaṃ; Dūratova namassanti, mahantaṃ vītasāradaṃ. ‘‘Namo te purisājañña, namo te purisuttama; Kusalena samekkhasi, amanussāpi taṃ vandanti; Sutaṃ netaṃ abhiṇhaso, tasmā evaṃ vademase. ‘‘‘Jinaṃ vandatha gotamaṃ, jinaṃ vandāma gotamaṃ; Vijjācaraṇasampannaṃ, buddhaṃ vandāma gotamaṃ’.",
      "english": "Where the sun sets, the great orb of the sun, and with the setting of which, even the day ceases; where the sun has set, it is called 'Saṃvarī.'\n\nThere also is a deep lake, a sea with river-water; thus, there they know it as 'a sea with river-water.'\n\n'This is the western direction,' so people declare it; the direction which is governed by that glorious great king.\n\nThe overlord of the Nāgas, named Virūpakkha, delights in dance and song, attended by Nāgas.\n\nHe also has many sons, all of the same name, so I have heard: eighty, ten, and one, powerful ones named Inda. They too, having seen the Buddha, the Buddha, kinsman of the sun, from afar salute him, the great one, free from fear.\n\n'Homage to you, O noblest of men; homage to you, O supreme among men. With skill you observe; even non-humans pay homage to you; this we have heard repeatedly, therefore we speak thus.\n\n'Pay homage to the Conqueror Gotama, we pay homage to the Conqueror Gotama; accomplished in knowledge and conduct, we pay homage to the Buddha Gotama.'",
      "sinhala": "‘‘මහා මණ්ඩලාකාර සූර්යයා උදාවන තැන සහ යම් තැනක සූර්යයා බැස යන විට දවසද නිරුද්ධ වන්නේද, යම් තැනක සූර්යයා බැස යන විට ‘සංවරී’ යනුවෙන් කියනු ලැබේ.\n\nඑහි ගැඹුරු විලක්ද ඇත. ගංගා ජලය ඇති මුහුදක්ද ඇත. එසේ ඒ ගැන එහි ‘ගංගා ජලය ඇති මුහුද’ ලෙස දනිති.\n\n‘‘මේ බටහිර දිශාවයි’’ කියා මිනිස්සු එය හඳුන්වති. යම් දිශාවක් යසස් ඇති මහාරාජයා රකින්නේද.\n\n‘‘විරූපාක්‍ෂ’’ නම් නාගයන්ගේ අධිපතියෙක්ද ඇත. ඔහු නාගයන් විසින් පිරිවරන ලද්දේ නර්තනයෙන් හා ගීතයෙන් සතුටු වෙයි.\n\nඔහුට බොහෝ පුත්‍රයෝද ඇත. ඔවුන් සියල්ලන්ටම එකම නමක් ඇතැයි මට අසන්නට ලැබී ඇත. අසූ එකක්ද දසයක්ද එකක්ද යනුවෙන් ඉන්ද්‍ර නම් ඇති මහත් බලවත් පුත්‍රයෝ වෙති. ඔවුහුද බුදුන් දැක, සූර්ය වංශයට අයත් බුදුන් දැක, දුර සිටම මහත් වූ, භය රහිත බුදුන්ට නමස්කාර කරති.\n\n‘‘පුරිස අජානීය ඔබට නමෝ වේවා! පුරිස උත්තම ඔබට නමෝ වේවා! ඔබ කුසලයෙන් මැනවින් විමසන බැවින් අමනුෂ්‍යයෝද ඔබට වඳිති. මෙය අපි බොහෝ වාර ගණනක් අසා ඇත්තෙමු. එබැවින් මෙසේ කියමු.\n\n‘‘ජින ගෞතමයන් වඳින්න. අපි ජින ගෞතමයන් වඳිමු. විද්‍යාචරණ සම්පන්න බුදු ගෞතමයන් වඳිමු’’.",
      "paliTitle": ""
    },
    {
      "number": 281,
      "pali": "‘‘Yena uttarakuruvho [uttarakurū rammā (sī. syā. pī.)], mahāneru sudassano. Manussā tattha jāyanti, amamā apariggahā. ‘‘Na te bījaṃ pavapanti, napi nīyanti naṅgalā; Akaṭṭhapākimaṃ sāliṃ, paribhuñjanti mānusā. ‘‘Akaṇaṃ athusaṃ suddhaṃ, sugandhaṃ taṇḍulapphalaṃ; Tuṇḍikīre pacitvāna, tato bhuñjanti bhojanaṃ. ‘‘Gāviṃ ekakhuraṃ katvā, anuyanti disodisaṃ; Pasuṃ ekakhuraṃ katvā, anuyanti disodisaṃ. ‘‘Itthiṃ vā vāhanaṃ [itthī-vāhanaṃ (sī. pī.), itthīṃ vāhanaṃ (syā.)] katvā, anuyanti disodisaṃ; Purisaṃ vāhanaṃ katvā, anuyanti disodisaṃ. ‘‘Kumāriṃ vāhanaṃ katvā, anuyanti disodisaṃ; Kumāraṃ vāhanaṃ katvā, anuyanti disodisaṃ. ‘‘Te yāne abhiruhitvā, Sabbā disā anupariyāyanti [anupariyanti (syā.)]; Pacārā tassa rājino. ‘‘Hatthiyānaṃ assayānaṃ, dibbaṃ yānaṃ upaṭṭhitaṃ; Pāsādā sivikā ceva, mahārājassa yasassino. ‘‘Tassa ca nagarā ahu, Antalikkhe sumāpitā; Āṭānāṭā kusināṭā parakusināṭā, Nāṭasuriyā [nāṭapuriyā (sī. pī.), nāṭapariyā (syā.)] parakusiṭanāṭā. ‘‘Uttarena kasivanto [kapivanto (sī. syā. pī)], Janoghamaparena ca; Navanavutiyo ambaraambaravatiyo, Āḷakamandā nāma rājadhānī. ‘‘Kuverassa kho pana, mārisa, mahārājassa visāṇā nāma rājadhānī; Tasmā kuvero mahārājā, ‘vessavaṇo’ti pavuccati. ‘‘Paccesanto pakāsenti, tatolā tattalā tatotalā; Ojasi tejasi tatojasī, sūro rājā ariṭṭho nemi. ‘‘Rahadopi tattha dharaṇī nāma, yato meghā pavassanti; Vassā yato patāyanti, sabhāpi tattha sālavatī [bhagalavatī (sī. syā. pī.)] nāma. ‘‘Yattha yakkhā payirupāsanti, tattha niccaphalā rukkhā; Nānā dijagaṇā yutā, mayūrakoñcābhirudā; Kokilādīhi vagguhi. ‘‘Jīvañjīvakasaddettha, atho oṭṭhavacittakā; Kukkuṭakā [kukutthakā (sī. pī.)] kuḷīrakā, vane pokkharasātakā. ‘‘Sukasāḷikasaddettha, daṇḍamāṇavakāni ca; Sobhati sabbakālaṃ sā, kuveranaḷinī sadā. ‘‘Ito ‘sā uttarā disā’, iti naṃ ācikkhatī jano; Yaṃ disaṃ abhipāleti, mahārājā yasassi so. ‘‘Yakkhānañca adhipati, ‘kuvero’ iti nāmaso; Ramatī naccagītehi, yakkheheva purakkhato. ‘‘Puttāpi tassa bahavo, ekanāmāti me sutaṃ; Asīti dasa eko ca, indanāmā mahabbalā. ‘‘Te cāpi buddhaṃ disvāna, buddhaṃ ādiccabandhunaṃ; Dūratova namassanti, mahantaṃ vītasāradaṃ. ‘‘Namo te purisājañña, namo te purisuttama; Kusalena samekkhasi, amanussāpi taṃ vandanti; Sutaṃ netaṃ abhiṇhaso, tasmā evaṃ vademase. ‘‘‘Jinaṃ vandatha gotamaṃ, jinaṃ vandāma gotamaṃ; Vijjācaraṇasampannaṃ, buddhaṃ vandāma gotama’’’nti. ‘‘Ayaṃ kho sā, mārisa, āṭānāṭiyā rakkhā bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ guttiyā rakkhāya avihiṃsāya phāsuvihārāya.",
      "english": "\"Where Uttarakuru is, delightful, and great Mount Meru is visible. There, humans are born, without possessions and without attachment.\n\n\"They do not sow seeds, nor are plows used; humans partake of rice that ripens without cultivation.\n\n\"The grains are without chaff, without husk, pure, fragrant, and bear a rice-kernel fruit; having cooked it in a kettle, then they eat the meal.\n\n\"Having made a cow a single-hooved mount, they go in various directions; having made a beast a single-hooved mount, they go in various directions.\n\n\"Having made a woman a vehicle, they go in various directions; having made a man a vehicle, they go in various directions.\n\n\"Having made a maiden a vehicle, they go in various directions; having made a youth a vehicle, they go in various directions.\n\n\"Having mounted those vehicles, they travel around in all directions; they are messengers of that king.\n\n\"Elephant-vehicles, horse-vehicles, and divine vehicles are provided; palaces and palanquins too, for the glorious great king.\n\n\"And cities of his there are, well-measured in the sky: Āṭānāṭā, Kusināṭā, Parakusināṭā, Nāṭasuriyā, Parakusiṭanāṭā.\n\n\"North of Kasivanto, and beyond Janogha; ninety-nine cities, celestial and cloud-like, Āḷakamandā by name, is the royal capital.\n\n\"Of Kuvera, indeed, your reverence, the great king, Visāṇā by name is the royal capital; therefore Kuvera, the great king, is called 'Vessavaṇa.'\n\n\"Paccesanto proclaims, and Tatolā, Tattalā, Tatotalā; Ojasi, Tejasi, Tatojasī, Sūro, Rājā, Ariṭṭho, Nemi.\n\n\"A lake also is there, Dharaṇī by name, from which the clouds rain; from which the rains spread forth; a hall also is there, Sālavatī by name.\n\n\"Where the yakshas attend, there are trees that are always fruitful; filled with various flocks of birds, resounding with peacocks and herons; with the sweet sounds of cuckoos and the like.\n\n\"The call of the jīvañjīvaka is there, and also the oṭṭhavacittaka; kukkuṭakā, kuḷīrakā, in the forest are pokkharasātakā.\n\n\"The sound of parrots and sālikas is there, and daṇḍamāṇavakāni too; that Kuvera's lotus pool is always beautiful, at all times.\n\n\"'This is the northern direction,' thus people announce it; that direction which the glorious great king protects.\n\n\"The overlord of the yakshas, 'Kuvera' by name; delights in dance and song, attended by the yakshas.\n\n\"Many sons also he has, all of one name, so I have heard; eighty, ten, and one, named Inda, of great power.\n\n\"They too, having seen the Buddha, the Buddha, kinsman of the sun; from afar they bow down, to the great one, free from fear.\n\n\"'Homage to you, noble among men, homage to you, best of men; with skill you observe, even non-humans venerate you; this is heard repeatedly, therefore thus we speak.\n\n\"'Venerate the Jina, Gotama, we venerate the Jina, Gotama; accomplished in knowledge and conduct, we venerate the Buddha, Gotama.'\"\n\n\"This, your reverence, is the Āṭānāṭiya protection for monks, nuns, laymen, and laywomen, for their safety, for their protection, for their non-harming, for their comfortable dwelling.\"",
      "sinhala": "‘‘යම් උතුරුකුරු දිශාවක් ඇත්තේද, මහා මේරුව මනාව දර්ශනය වන්නේද, එහි මනුෂ්‍යයෝ අයිති මමත්වය නැත්තාහුද, පරිග්‍රහය නැත්තාහුද, උපදිත්.\nඔවුහු බීජ වපුරන්නේත් නැත. නඟුල් යොදන්නේත් නැත. හී වගා නොකළ සාලි බත් මනුෂ්‍යයෝ පරිභෝජනය කරත්.\nඔවුන් රහිත, තුෂ රහිත, පිරිසිදු, සුවඳවත් සහල් ඵලයෙන් යුක්ත බත්, තුණ්ඩිකීර නම් උපකරණයෙන් පිස, පසුව භෝජනය කරත්.\nඑක් කුරක් ඇති ගවයන් සකස් කොට, දිශාවෙන් දිශාවට යත්. එක් කුරක් ඇති හරකුන් සකස් කොට, දිශාවෙන් දිශාවට යත්.\nගෑනුන් වාහන කොට සකස් කොට, දිශාවෙන් දිශාවට යත්. පුරුෂයන් වාහන කොට සකස් කොට, දිශාවෙන් දිශාවට යත්.\nකුමාරියන් වාහන කොට සකස් කොට, දිශාවෙන් දිශාවට යත්. කුමාරයන් වාහන කොට සකස් කොට, දිශාවෙන් දිශාවට යත්.\nඔවුහු යානාවල නැගී සියලු දිශාවන්ට යෙත්. ඒ රජුගේ පරිචාරකයෝ වෙත්.\nඇත් යානා, අස් යානා, දිව්‍ය යානා, ඒ ශ්‍රීමත් මහරජුට ලැබී ඇත. ප්‍රාසාද, සිවිකා ද එසේමය.\nඒ රජුට අහසේ මනාව මනින ලද නගර ඇත්තේය. ආටානාටා, කුසිනාටා, පරකූසිනාටා, නාටසූරියා, පරකූසිටනාටා යන නගරයි.\nඋතුරින් කසිවන්ත නම් නගරයත්, ජනඝ නම් නදියෙන් එතෙර අම්බර අම්බරවතී නම් අනූ අනූ කෝටි නගර ඇත්තේය. ආලකමන්දා නම් රාජධානිය ද ඇත්තේය.\nමහණෙනි, කුවේර මහරජුගේ විශාණා නම් රාජධානියක් ඇත. ඒ නිසා කුවේර මහරජ ‘වෙසවණ’ යන නමින් කියනු ලැබේ.\nපච්චේසන්තෝ, පකාසෙන්ති, තතෝලා, තත්තලා, තතෝතලා, ඕජසී, තේජසී, තතෝජසී, සූරෝ රජු අරිට්ඨෝ නේමී නම් වූ නගරද ඇත.\nඑහි ධරණී නම් විලක් ඇත. එයින් වලාහු වසිත්. වැසි වසින තැන සාලවතී නම් සභාව ඇත.\nයම් තැනක යක්ෂයෝ එළඹ සිටිත්ද, එහි නිරන්තරයෙන් ඵල දරන රුක් ඇත. නොයෙක් පක්ෂි සමූහයාගෙන් යුක්ත වූ මොණරුන්, කොස්ලිඳුන්ගේ නාදය ඇත්තේය. කොවුලන් ආදී මිහිරි හඬින් යුක්ත කුරුල්ලෝද එහි වෙසෙත්.\nජීවංජීවක පක්ෂීන්ගේ හඬ ඇසේ. එසේම ඔට්ඨවචිත්තකයෝද වෙති. කුකුළන්, කුලීරකයෝ, වනෙහි පොක්කරසාතකයෝ වෙති.\nගිරවුන්, සැලළිහිණියන්ගේ හඬ ඇසේ. දණ්ඩමානවකයෝද වෙති. කුවේර නළිනී නම් වූ එය සෑම කල්හිම බබළයි.\n‘මේ උතුරු දිශාවයි’ කියා ජනයා එය පවසති. යම් දිශාවක් ශ්‍රීමත් මහරජ්ජුරුවෝ පාලනය කෙරෙත් ද,\nයක්ෂයන්ගේ අධිපති වූ කුවේර නම් රජු යක්ෂයන් විසින් පෙරටු කොට නටමින් ගයමින් රමණය කරයි.\nඒ රජුට එක නමක් ඇති බොහෝ පුත්‍රයෝ සිටිත්. අසූ එකක් ඉන්ද්‍ර නම් ඇති මහ බල ඇත්තෝ වෙති.\nඔවුහු බුදුන් දැක, හිරු කුලයේ බුදුන් දුරින්ම නමස්කාර කරති. මහත් වූ භය රහිත බුදුන්ට නමස්කාර කරති.\nපුරිස අජානීය ඔබට නමෝ වේවා. පුරිස උත්තමයාණෙනි ඔබට නමෝ වේවා. කුසලයෙන් මැනවින් විමසන ඔබ වහන්සේට අමනුෂ්‍යයෝත් වඳිත්. මෙය නිතර අසන ලද්දේය. එහෙයින් මෙසේ කියමු.\n‘ජින ගෞතමයන් වඳින්න. අපි ජින ගෞතමයන් වඳිමු. විද්‍යාචරණ සම්පන්න වූ බුදු ගෞතමයන් වඳිමු.’\nමහණෙනි, ආටානාටිය ආරක්ෂාව භික්ෂූන්ට, භික්ෂුණීන්ට, උපාසකයන්ට, උපාසිකාවන්ට ආරක්ෂාව පිණිස, ගුප්ත බව පිණිස, අවිහිංසාව පිණිස, පහසුවෙන් වාසය කිරීම පිණිස වේ.",
      "paliTitle": ""
    },
    {
      "number": 282,
      "pali": "‘‘Yassa kassaci, mārisa, bhikkhussa vā bhikkhuniyā vā upāsakassa vā upāsikāya vā ayaṃ āṭānāṭiyā rakkhā suggahitā bhavissati samattā pariyāputā [pariyāpuṭā (ka.)]. Taṃ ce amanusso yakkho vā yakkhinī vā yakkhapotako vā yakkhapotikā vā yakkhamahāmatto vā yakkhapārisajjo vā yakkhapacāro vā, gandhabbo vā gandhabbī vā gandhabbapotako vā gandhabbapotikā vā gandhabbamahāmatto vā gandhabbapārisajjo vā gandhabbapacāro vā, kumbhaṇḍo vā kumbhaṇḍī vā kumbhaṇḍapotako vā kumbhaṇḍapotikā vā kumbhaṇḍamahāmatto vā kumbhaṇḍapārisajjo vā kumbhaṇḍapacāro vā, nāgo vā nāgī vā nāgapotako vā nāgapotikā vā nāgamahāmatto vā nāgapārisajjo vā nāgapacāro vā, paduṭṭhacitto bhikkhuṃ vā bhikkhuniṃ vā upāsakaṃ vā upāsikaṃ vā gacchantaṃ vā anugaccheyya, ṭhitaṃ vā upatiṭṭheyya, nisinnaṃ vā upanisīdeyya, nipannaṃ vā upanipajjeyya. Na me so, mārisa, amanusso labheyya gāmesu vā nigamesu vā sakkāraṃ vā garukāraṃ vā. Na me so, mārisa, amanusso labheyya āḷakamandāya nāma rājadhāniyā vatthuṃ vā vāsaṃ vā. Na me so, mārisa, amanusso labheyya yakkhānaṃ samitiṃ gantuṃ. Apissu naṃ, mārisa, amanussā anāvayhampi naṃ kareyyuṃ avivayhaṃ. Apissu naṃ, mārisa, amanussā attāhipi paripuṇṇāhi paribhāsāhi paribhāseyyuṃ. Apissu naṃ, mārisa, amanussā rittaṃpissa pattaṃ sīse nikkujjeyyuṃ. Apissu naṃ, mārisa, amanussā sattadhāpissa muddhaṃ phāleyyuṃ. ‘‘Santi hi, mārisa, amanussā caṇḍā ruddhā [ruddā (sī. pī.)] rabhasā, te neva mahārājānaṃ ādiyanti, na mahārājānaṃ purisakānaṃ ādiyanti, na mahārājānaṃ purisakānaṃ purisakānaṃ ādiyanti. Te kho te, mārisa, amanussā mahārājānaṃ avaruddhā nāma vuccanti. Seyyathāpi, mārisa, rañño māgadhassa vijite mahācorā. Te neva rañño māgadhassa ādiyanti, na rañño māgadhassa purisakānaṃ ādiyanti, na rañño māgadhassa purisakānaṃ purisakānaṃ ādiyanti. Te kho te, mārisa, mahācorā rañño māgadhassa avaruddhā nāma vuccanti. Evameva kho, mārisa, santi amanussā caṇḍā ruddhā rabhasā, te neva mahārājānaṃ ādiyanti, na mahārājānaṃ purisakānaṃ ādiyanti, na mahārājānaṃ purisakānaṃ purisakānaṃ ādiyanti. Te kho te, mārisa, amanussā mahārājānaṃ avaruddhā nāma vuccanti. Yo hi koci, mārisa, amanusso yakkho vā yakkhinī vā…pe… gandhabbo vā gandhabbī vā … kumbhaṇḍo vā kumbhaṇḍī vā… nāgo vā nāgī vā nāgapotako vā nāgapotikā vā nāgamahāmatto vā nāgapārisajjo vā nāgapacāro vā paduṭṭhacitto bhikkhuṃ vā bhikkhuniṃ vā upāsakaṃ vā upāsikaṃ vā gacchantaṃ vā anugaccheyya, ṭhitaṃ vā upatiṭṭheyya, nisinnaṃ vā upanisīdeyya, nipannaṃ vā upanipajjeyya. Imesaṃ yakkhānaṃ mahāyakkhānaṃ senāpatīnaṃ mahāsenāpatīnaṃ ujjhāpetabbaṃ vikkanditabbaṃ viravitabbaṃ – ‘ayaṃ yakkho gaṇhāti, ayaṃ yakkho āvisati, ayaṃ yakkho heṭheti, ayaṃ yakkho viheṭheti, ayaṃ yakkho hiṃsati, ayaṃ yakkho vihiṃsati, ayaṃ yakkho na muñcatī’ti.",
      "english": "\"For any bhikkhu, bhikkhuni, male lay follower, or female lay follower, to whom this Āṭānāṭiya protection is well grasped, fully learned, and mastered, if any non-human – a yaksha, a yakshini, a yaksha cub, a yakshini cub, a yaksha great minister, a yaksha attendant, a yaksha messenger; a gandhabba, a gandhabbi, a gandhabba cub, a gandhabbi cub, a gandhabba great minister, a gandhabba attendant, a gandhabba messenger; a kumbhaṇḍa, a kumbhaṇḍi, a kumbhaṇḍa cub, a kumbhaṇḍi cub, a kumbhaṇḍa great minister, a kumbhaṇḍa attendant, a kumbhaṇḍa messenger; a nāga, a nāgi, a nāga cub, a nāgi cub, a nāga great minister, a nāga attendant, a nāga messenger – with a malevolent mind, pursues or harasses a bhikkhu, a bhikkhuni, a male lay follower, or a female lay follower who is walking, standing, sitting, or lying down, that non-human, Mārisa, would not receive honor or respect in villages or towns. That non-human, Mārisa, would not receive a place or dwelling in the royal city named Āḷakamandā. That non-human, Mārisa, would not be allowed to attend the yakshas’ assembly. Furthermore, Mārisa, non-humans would treat that one as if he were carrying off what should not be carried off, or not carrying off what should be. Furthermore, Mārisa, non-humans would reproach that one with complete curses. Furthermore, Mārisa, non-humans would overturn his bowl on his head. Furthermore, Mārisa, non-humans would split his head into seven pieces.\n\n\"For there are, Mārisa, non-humans who are fierce, violent, and impetuous. They do not heed the Great Kings, nor do they heed the Great Kings' attendants, nor do they heed the Great Kings' attendants' attendants. Those non-humans, Mārisa, are called the Great Kings’ outlaws. Just as, Mārisa, in the territory of King Māgadha there are great robbers. They do not heed King Māgadha, nor do they heed King Māgadha's attendants, nor do they heed King Māgadha's attendants' attendants. Those great robbers, Mārisa, are called King Māgadha’s outlaws. In the same way, Mārisa, there are non-humans who are fierce, violent, and impetuous. They do not heed the Great Kings, nor do they heed the Great Kings' attendants, nor do they heed the Great Kings' attendants' attendants. Those non-humans, Mārisa, are called the Great Kings’ outlaws. If any non-human – a yaksha, a yakshini… a gandhabba, a gandhabbi… a kumbhaṇḍa, a kumbhaṇḍi… a nāga, a nāgi, a nāga cub, a nāgi cub, a nāga great minister, a nāga attendant, a nāga messenger – with a malevolent mind, pursues or harasses a bhikkhu, a bhikkhuni, a male lay follower, or a female lay follower who is walking, standing, sitting, or lying down, then proclamation, outcry, and denunciation should be made to these yakshas, great yakshas, generals, and great generals: ‘This yaksha is seizing, this yaksha is possessing, this yaksha is harming, this yaksha is injuring, this yaksha is hurting, this yaksha is oppressing, this yaksha does not let go.’\"",
      "sinhala": "‘‘මාරිස, යම් කිසි භික්ෂුවකට හෝ භික්ෂුණියකට හෝ උපාසකයකුට හෝ උපාසිකාවකට හෝ මේ ආටානාටිය ආරක්ෂාව මැනවින් උග්‍රහණය කරන ලද්දේ වේ ද, සම්පූර්ණ කරන ලද්දේ වේ ද, හොඳින් ඉගෙන ගන්නා ලද්දේ වේ ද, ඒ පුද්ගලයාට යම් අමනුෂ්‍යයෙක්, එනම් යක්ෂයෙක් හෝ යක්ෂණියක් හෝ යක්ෂ පැටවෙක් හෝ යක්ෂ දුවක් හෝ යක්ෂ මහා ඇමතියෙක් හෝ යක්ෂ පිරිසක් හෝ යක්ෂ සේවකයෙක් හෝ, ගන්ධර්වයෙක් හෝ ගන්ධර්වියක් හෝ ගන්ධර්ව පැටවෙක් හෝ ගන්ධර්ව දුවක් හෝ ගන්ධර්ව මහා ඇමතියෙක් හෝ ගන්ධර්ව පිරිසක් හෝ ගන්ධර්ව සේවකයෙක් හෝ, කුම්භාණ්ඩයෙක් හෝ කුම්භාණ්ඩියක් හෝ කුම්භාණ්ඩ පැටවෙක් හෝ කුම්භාණ්ඩ දුවක් හෝ කුම්භාණ්ඩ මහා ඇමතියෙක් හෝ කුම්භාණ්ඩ පිරිසක් හෝ කුම්භාණ්ඩ සේවකයෙක් හෝ, නාගයෙක් හෝ නාගිනියක් හෝ නාග පැටවෙක් හෝ නාග දුවක් හෝ නාග මහා ඇමතියෙක් හෝ නාග පිරිසක් හෝ නාග සේවකයෙක් හෝ, ද්වේෂ සහගත සිතින් යුක්තව භික්ෂුවක් හෝ භික්ෂුණියක් හෝ උපාසකයෙක් හෝ උපාසිකාවක් හෝ ගමන් කරද්දී පසුපස එළවන්නේ නම්, සිටගෙන සිටින්නේ නම්, වාඩි වී සිටින්නේ නම්, සැතපී සිටින්නේ නම්, මාරිස, ඒ අමනුෂ්‍යයාට ගම්වල හෝ නියම්ගම්වල හෝ සත්කාරයක් හෝ ගරුකාරයක් හෝ ලැබිය නොහැකිය. මාරිස, ඒ අමනුෂ්‍යයාට ආලකමන්දා නම් රජදහනියේ වස්තුවක් හෝ වාසස්ථානයක් හෝ ලැබිය නොහැකිය. මාරිස, ඒ අමනුෂ්‍යයාට යක්ෂයන්ගේ සමිතිවලට යෑමට ලැබිය නොහැකිය. එසේම, මාරිස, අමනුෂ්‍යයෝ ඔහුට බලහත්කාරයෙන් දඬුවම් කරති. එසේම, මාරිස, අමනුෂ්‍යයෝ ඔහුට සම්පූර්ණ වචනවලින් බැණ වදිති. එසේම, මාරිස, අමනුෂ්‍යයෝ ඔහුගේ හිස් පාත්‍රය ඔහුගේ හිස මත උඩුකුරු කරති. එසේම, මාරිස, අමනුෂ්‍යයෝ ඔහුගේ හිස සත් කඩකට පලති.\n\nමාරිස, දරුණු වූ, කිපුණු, ඉක්මන් අමනුෂ්‍යයෝ සිටිති. ඔවුහු මහා රජුන්වත් ගණන් ගන්නේ නැත. මහා රජුන්ගේ පුරුෂයන්වත් ගණන් ගන්නේ නැත. මහා රජුන්ගේ පුරුෂයන්ගේ පුරුෂයන්වත් ගණන් ගන්නේ නැත. මාරිස, ඒ අමනුෂ්‍යයන් මහා රජුන්ට අවනත නොවූවෝ යැයි කියනු ලැබේ. මාරිස, මගධ රජුගේ රාජ්‍යයේ මහා සොරසමූහයක් සිටින්නා සේ ය. ඔවුහු මගධ රජුන්වත් ගණන් ගන්නේ නැත. මගධ රජුන්ගේ පුරුෂයන්වත් ගණන් ගන්නේ නැත. මගධ රජුන්ගේ පුරුෂයන්ගේ පුරුෂයන්වත් ගණන් ගන්නේ නැත. මාරිස, ඒ මහා සොරසමූහයා මගධ රජුන්ට අවනත නොවූවෝ යැයි කියනු ලැබේ. මාරිස, එපරිද්දෙන්ම දරුණු වූ, කිපුණු, ඉක්මන් අමනුෂ්‍යයෝ සිටිති. ඔවුහු මහා රජුන්වත් ගණන් ගන්නේ නැත. මහා රජුන්ගේ පුරුෂයන්වත් ගණන් ගන්නේ නැත. මහා රජුන්ගේ පුරුෂයන්ගේ පුරුෂයන්වත් ගණන් ගන්නේ නැත. මාරිස, ඒ අමනුෂ්‍යයන් මහා රජුන්ට අවනත නොවූවෝ යැයි කියනු ලැබේ. මාරිස, යම් කිසි අමනුෂ්‍යයෙක්, එනම් යක්ෂයෙක් හෝ යක්ෂණියක් හෝ... ගන්ධර්වයෙක් හෝ ගන්ධර්වියක් හෝ ... කුම්භාණ්ඩයෙක් හෝ කුම්භාණ්ඩියක් හෝ ... නාගයෙක් හෝ නාගිනියක් හෝ නාග පැටවෙක් හෝ නාග දුවක් හෝ නාග මහා ඇමතියෙක් හෝ නාග පිරිසක් හෝ නාග සේවකයෙක් හෝ ද්වේෂ සහගත සිතින් යුක්තව භික්ෂුවක් හෝ භික්ෂුණියක් හෝ උපාසකයෙක් හෝ උපාසිකාවක් හෝ ගමන් කරද්දී පසුපස එළවන්නේ නම්, සිටගෙන සිටින්නේ නම්, වාඩි වී සිටින්නේ නම්, සැතපී සිටින්නේ නම්, ඒ යක්ෂයන්ගේ, මහා යක්ෂයන්ගේ, සේනාපතියන්ගේ, මහා සේනාපතියන්ගේ නම් කියා හෙළා දැකිය යුතුයි. මොරගැසිය යුතුයි. කෑ ගැසිය යුතුයි. ‘මේ යක්ෂයා අල්ලා ගනී. මේ යක්ෂයා ආවේශ කරයි. මේ යක්ෂයා පීඩා කරයි. මේ යක්ෂයා විහිංසා කරයි. මේ යක්ෂයා හිංසා කරයි. මේ යක්ෂයා විහිංසා කරයි. මේ යක්ෂයා අත් නොහරී’ කියා ප්‍රකාශ කළ යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 283,
      "pali": "‘‘Katamesaṃ yakkhānaṃ mahāyakkhānaṃ senāpatīnaṃ mahāsenāpatīnaṃ? ‘‘Indo somo varuṇo ca, bhāradvājo pajāpati; Candano kāmaseṭṭho ca, kinnughaṇḍu nighaṇḍu ca. ‘‘Panādo opamañño ca, devasūto ca mātali; Cittaseno ca gandhabbo, naḷo rājā janesabho [janosabho (syā.)]. ‘‘Sātāgiro hemavato, puṇṇako karatiyo guḷo; Sivako mucalindo ca, vessāmitto yugandharo. ‘‘Gopālo supparodho ca [suppagedho ca (sī. syā. pī.)], hiri netti [hirī nettī (sī. pī.)] ca mandiyo; Pañcālacaṇḍo āḷavako, pajjunno sumano sumukho; Dadhimukho maṇi māṇivaro [maṇi mānicaro (syā. pī.)] dīgho, atho serīsako saha. ‘‘Imesaṃ yakkhānaṃ mahāyakkhānaṃ senāpatīnaṃ mahāsenāpatīnaṃ ujjhāpetabbaṃ vikkanditabbaṃ viravitabbaṃ – ‘ayaṃ yakkho gaṇhāti, ayaṃ yakkho āvisati, ayaṃ yakkho heṭheti, ayaṃ yakkho viheṭheti, ayaṃ yakkho hiṃsati, ayaṃ yakkho vihiṃsati, ayaṃ yakkho na muñcatī’ti. ‘‘Ayaṃ kho sā, mārisa, āṭānāṭiyā rakkhā bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ guttiyā rakkhāya avihiṃsāya phāsuvihārāya. Handa ca dāni mayaṃ, mārisa, gacchāma bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassadāni tumhe mahārājāno kālaṃ maññathā’’ti.",
      "english": "\"Who are those chieftains, great chieftains, commanders, great commanders of the spirits?\" \"Indra, Soma, Varuṇa, Bharadvaja, Pajapati; Candana, Kamaseṭṭha, Kinnughaṇḍu, Nighaṇḍu; Panāda, Opamañña, Devasūta, Mātali; Cittasena the gandharva, Nala the king Janesabha; Sātāgira of Himavat, Puṇṇaka, Karatiya, Guḷa; Sivaka, Mucalinda, Vessāmitta, Yugandhara; Gopāla, Supparodha, Hiri, Netti, Mandiya; Pañcālacaṇḍa, Āḷavaka, Pajjunna, Sumana, Sumukha; Dadhimukha, Maṇi, Māṇivara, Dīgha, and Serīsaka together. These are the chieftains, great chieftains, commanders, great commanders of the spirits to whom announcement should be made, proclamation should be made, declaration should be made: ‘This spirit seizes, this spirit possesses, this spirit harasses, this spirit severely harasses, this spirit injures, this spirit severely injures, this spirit does not release.’ This, venerable sir, is the Āṭānāṭiya defense for the protection, for the safety, for the non-harming, for the comfortable abiding of monks, nuns, laymen, and laywomen. Now, venerable sir, we shall go, for we have much to do, much to accomplish.\" \"Whenever you think it is time, great kings.\"",
      "sinhala": "‘‘කුමන යක්ෂයන්ගේ ද, මහා යක්ෂයන්ගේ ද, සේනාපතීන්ගේ ද, මහා සේනාපතීන්ගේ ද (නම් දැක්විය යුතු ද)? ‘‘ඉන්ද්‍ර, සෝම, වරුණ යන දෙවියෝ ද, භාරද්වාජ, ප්‍රජාපති යන දෙවියෝ ද වෙති. චන්දන, කාමසෙට්ඨ, කිన్నుඝණ්ඩු, නිඝණ්ඩු යන දෙවියෝ ද වෙති. පනාද, ඕපමඤ්ඤ, දවසූත, මාතලි යන දෙවියෝ ද වෙති. චිත්තසේන නම් ගන්ධර්වයා ද, නළ රජු ද, ජනෙසභ නම් රජු ද වෙති. සාතාගිර, හේමවත, පුණ්ණක, කරතිය, ගුල, සිවක, මුචලින්ද, වෙස්සාමිත්ත, යුගන්ධර යන දෙවියෝ ද වෙති. ගෝපාල, සුප්පරෝධ [සුප්පගේධ ද (සී. ස්‍යා. පී.)], හිරි, නෙත්ති [හිරී නෙත්ති (සී. පී.)] ද මන්දි ද වෙති. පඤ්චාලචණ්ඩ, ආලවක, පජ්ජුන්න, සුමන, සුමුඛ යන දෙවියෝ ද, දධිමුඛ, මණි, මාණිවර [මණි මාණිචරො (ස්‍යා. පී.)] දීඝ, සහ සේරිස්සක යන දෙවියෝ ද වෙති. ‘මේ යක්ෂයා ගනී, මේ යක්ෂයා ආවිෂ්ට වේ, මේ යක්ෂයා හිරිහැර කරයි, මේ යක්ෂයා විහිංසා කරයි, මේ යක්ෂයා හිංසා කරයි, මේ යක්ෂයා විහිංසා කරයි, මේ යක්ෂයා මුදන්නේ නැත’යි යනුවෙන් මේ යක්ෂයන්ගේ ද, මහා යක්ෂයන්ගේ ද, සේනාපතීන්ගේ ද, මහා සේනාපතීන්ගේ ද නම් ප්‍රකාශ කළ යුතු ය, හඬ නැඟිය යුතු ය, මොර ගැසිය යුතු ය. මාර්‍යාවනි, භික්ෂූන්ගේ ද, භික්ෂුණීන්ගේ ද, උපාසකයන්ගේ ද, උපාසිකාවන්ගේ ද ආරක්ෂාව පිණිස ද, රැකවරණය පිණිස ද, අවිහිංසාව පිණිස ද, පහසුවෙන් වාසය කිරීම පිණිස ද ආටානාටිය නම් මේ ආරක්ෂාව වෙයි. මාර්‍යාවනි, දැන් අපි යමු. අපට බොහෝ කටයුතු ඇත, බොහෝ දේ කළ යුතුව ඇත”’ “මහ රජවරුනි, දැන් ඔබලාට කාලය යෝග්‍ය යයි සිතේ නම් (යන්න)”’යි වදාළේ ය.",
      "paliTitle": ""
    },
    {
      "number": 284,
      "pali": "Atha kho cattāro mahārājā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyiṃsu. Tepi kho yakkhā uṭṭhāyāsanā appekacce bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyiṃsu. Appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā tatthevantaradhāyiṃsu. Appekacce yena bhagavā tenañjaliṃ paṇāmetvā tatthevantaradhāyiṃsu. Appekacce nāmagottaṃ sāvetvā tatthevantaradhāyiṃsu. Appekacce tuṇhībhūtā tatthevantaradhāyiṃsūti. Paṭhamabhāṇavāro niṭṭhito. ",
      "english": "Then the four Great Kings, rising from their seats, having bowed down to the Blessed One, and circumambulating him, vanished from that spot. Those yakkhas too, rising from their seats, some bowed down to the Blessed One, circumambulated him, and vanished from that spot. Some exchanged courteous greetings with the Blessed One, and after amicable and memorable talk, vanished from that spot. Some, raising their joined hands in reverence towards the Blessed One, vanished from that spot. Some, announcing their names and clans, vanished from that spot. Some remained silent and vanished from that spot. The first recitation section is finished.",
      "sinhala": "ඉක්බිතිව සතර මහා රාජවරු ආසනවලින් නැගිට භාග්‍යවතුන් වහන්සේට වැඳ ප්‍රදක්ෂිණා කොට එතැනම අතුරුදහන් වූහ. ඒ යක්ෂයන් ද ආසනවලින් නැගිට ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේට වැඳ ප්‍රදක්ෂිණා කොට එතැනම අතුරුදහන් වූහ. ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු කථාව, සිහි කටයුතු කථාව නිමවා එතැනම අතුරුදහන් වූහ. ඇතැම් කෙනෙක් භාග්‍යවතුන් වහන්සේ සිටි දෙසට ඇඳිලි බැඳ එතැනම අතුරුදහන් වූහ. ඇතැම් කෙනෙක් තම නාමය හා ගෝත්‍රය ප්‍රකාශ කොට එතැනම අතුරුදහන් වූහ. ඇතැම් කෙනෙක් නිශ්ශබ්දව එතැනම අතුරුදහන් වූහ. පළමුවන භාණවාරය නිමි.",
      "paliTitle": ""
    },
    {
      "number": 285,
      "pali": "Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ cattāro mahārājā mahatiyā ca yakkhasenāya mahatiyā ca gandhabbasenāya mahatiyā ca kumbhaṇḍasenāya mahatiyā ca nāgasenāya catuddisaṃ rakkhaṃ ṭhapetvā catuddisaṃ gumbaṃ ṭhapetvā catuddisaṃ ovaraṇaṃ ṭhapetvā abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ gijjhakūṭaṃ pabbataṃ obhāsetvā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdiṃsu. Tepi kho, bhikkhave, yakkhā appekacce maṃ abhivādetvā ekamantaṃ nisīdiṃsu. Appekacce mayā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Appekacce yenāhaṃ tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu. Appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu. Appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu.",
      "english": "Then, as the night was ending, the Blessed One addressed the monks: \"Monks, during this night, the Four Great Kings, with a great host of yakkhas, a great host of gandhabbas, a great host of kumbhaṇḍas, and a great host of nāgas, having established guard in the four directions, having established barricades in the four directions, having established protection in the four directions, as the night was passing, with surpassing radiance illuminating the entire Vulture Peak mountain, approached me; having approached, they paid homage to me and sat down to one side. Moreover, monks, some of those yakkhas, having paid homage to me, sat down to one side. Some exchanged greetings with me, conversed with amiable and courteous talk, and sat down to one side. Some, toward where I was, extended their joined palms and sat down to one side. Some announced their name and clan and sat down to one side. Some remained silent and sat down to one side.",
      "sinhala": "ඉක්බිති භාග්‍යවතුන් වහන්සේ එම රාත්‍රිය පහන් වීමෙන් පසු භික්ෂූන් ඇමතූ සේක: \"මහණෙනි, මේ රාත්‍රියේ සතර මහා රජවරු මහත් වූ යක්ෂ සේනාව, මහත් වූ ගන්ධර්ව සේනාව, මහත් වූ කුම්භාණ්ඩ සේනාව, මහත් වූ නාග සේනාව යන සතර දිසාවෙහි ආරක්ෂාව තබා, සතර දිසාවෙහි ගුම්බ තබා, සතර දිසාවෙහි ආවරණ තබා, රාත්‍රිය ඉක්ම ගිය පසු, බබළන ශරීර වර්ණයෙන් යුක්තව, මුළු ගිජ්ඣකූට පර්වතයම බබුළුවමින්, මා වෙත පැමිණියහ. පැමිණ මා වැඳ එකත්පසෙකින් හිඳගත්හ. මහණෙනි, ඒ යක්ෂයන් අතුරෙන් ඇතැම් කෙනෙක් මා වැඳ එකත්පසෙකින් හිඳගත්හ. ඇතැම් කෙනෙක් මා සමග සතුටු වූහ. සතුටු විය යුතු කථා, සිහි කටයුතු කථා පවසා නිමවා එකත්පසෙකින් හිඳගත්හ. ඇතැම් කෙනෙක් මා දෙසට ඇඳිලි බැඳ එකත්පසෙකින් හිඳගත්හ. ඇතැම් කෙනෙක් තම නාම ගෝත්‍ර ප්‍රකාශ කර එකත්පසෙකින් හිඳගත්හ. ඇතැම් කෙනෙක් නිශ්ශබ්දව එකත්පසෙකින් හිඳගත්හ.\"",
      "paliTitle": "Dutiyabhāṇavāro",
      "englishTitle": "Second Recitation Section",
      "sinhalaTitle": "දෙවන භාණවාරය"
    },
    {
      "number": 286,
      "pali": "‘‘Ekamantaṃ nisinno kho, bhikkhave, vessavaṇo mahārājā maṃ etadavoca – ‘santi hi, bhante, uḷārā yakkhā bhagavato appasannā…pe… santi hi, bhante nīcā yakkhā bhagavato pasannā. Yebhuyyena kho pana, bhante, yakkhā appasannāyeva bhagavato. Taṃ kissa hetu? Bhagavā hi, bhante, pāṇātipātā veramaṇiyā dhammaṃ deseti… surāmerayamajjappamādaṭṭhānā veramaṇiyā dhammaṃ deseti. Yebhuyyena kho pana, bhante, yakkhā appaṭiviratāyeva pāṇātipātā… appaṭiviratā surāmerayamajjappamādaṭṭhānā. Tesaṃ taṃ hoti appiyaṃ amanāpaṃ. Santi hi, bhante, bhagavato sāvakā araññavanapatthāni pantāni senāsanāni paṭisevanti appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppāni. Tattha santi uḷārā yakkhā nivāsino, ye imasmiṃ bhagavato pāvacane appasannā, tesaṃ pasādāya uggaṇhātu, bhante, bhagavā āṭānāṭiyaṃ rakkhaṃ bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ guttiyā rakkhāya avihiṃsāya phāsuvihārāyā’ti. Adhivāsesiṃ kho ahaṃ, bhikkhave, tuṇhībhāvena. Atha kho, bhikkhave, vessavaṇo mahārājā me adhivāsanaṃ viditvā tāyaṃ velāyaṃ imaṃ āṭānāṭiyaṃ rakkhaṃ abhāsi –",
      "english": "\"Monks, when King Vessavana was seated to one side, he said to me: 'Venerable sir, there are indeed eminent yakkhas who are not pleased with the Blessed One…and there are indeed lowly yakkhas who are pleased with the Blessed One. But for the most part, venerable sir, the yakkhas are displeased with the Blessed One. What is the reason for that? Because, venerable sir, the Blessed One teaches the Dhamma regarding abstaining from killing… he teaches the Dhamma regarding abstaining from intoxicants that cause negligence. But for the most part, venerable sir, the yakkhas do not abstain from killing…they do not abstain from intoxicants that cause negligence. That is displeasing and disagreeable to them. Venerable sir, there are disciples of the Blessed One who frequent secluded forest and woodland retreats, quiet and still, devoid of clamor, where the wind blows freely, hidden from humans, suitable for seclusion. Residing there are eminent yakkhas who are displeased with this teaching of the Blessed One. For the pleasing of those yakkhas, venerable sir, may the Blessed One learn the Āṭānāṭiya protection for the safety, protection, non-violence, and comfortable dwelling of monks, nuns, laymen, and laywomen.' Monks, I consented with silence. Then, monks, King Vessavana, knowing of my consent, on that occasion recited this Āṭānāṭiya protection:\"",
      "sinhala": "‘‘මහණෙනි, වෙසවණ මහරජ මා වෙත පැමිණ එකත්පස්ව හිඳ මෙසේ කීවේය: ‘ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කෙරෙහි අප්‍රසාදයෙන් සිටින උදාර යක්ෂයෝ සිටිති...පෙ... ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කෙරෙහි ප්‍රසාදයෙන් සිටින නීච යක්ෂයෝ ද සිටිති. එහෙත් ස්වාමීනි, බොහෝ යක්ෂයෝ භාග්‍යවතුන් වහන්සේ කෙරෙහි අප්‍රසාද ඇත්තාහු වෙති. එයට හේතුව කුමක්ද? ස්වාමීනි, භාග්‍යවතුන් වහන්සේ ප්‍රාණඝාතයෙන් වැළකීමෙහි ධර්මය දේශනා කරන සේක... සුරාපානයෙන්, මේර පානයෙන් හා මත්ද්‍රව්‍ය භාවිතයෙන් සිදුවන ප්‍රමාදයෙන් වැළකීමෙහි ධර්මය දේශනා කරන සේක. එහෙත් ස්වාමීනි, බොහෝ යක්ෂයෝ ප්‍රාණඝාතයෙන් නොවැළකී සිටින්නාහු වෙති... සුරාපානයෙන්, මේර පානයෙන් හා මත්ද්‍රව්‍ය භාවිතයෙන් සිදුවන ප්‍රමාදයෙන් නොවැළකී සිටින්නාහු වෙති. එය ඔවුන්ට අප්‍රිය වේ, අමනාප වේ. ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකයෝ වනවාසීව, වනපෙත්වල, පාළු සෙනසුන්වල වාසය කරති. එම ස්ථාන ඝෝෂා රහිතය, නිශ්ශබ්දය, පාළු සුළං හමන ඒවාය, මනුෂ්‍යයන්ගෙන් දුරස් වූ රහස්‍ය ස්ථානයන්ගෙන් යුක්තය, භාවනාවට සුදුසුය. එහි උදාර යක්ෂයෝ වාසය කරති. ඔවුන් භාග්‍යවතුන් වහන්සේගේ මේ ශාසනය කෙරෙහි අප්‍රසාද ඇත්තාහු වෙති. ඔවුන්ගේ ප්‍රසාදය පිණිස භාග්‍යවතුන් වහන්සේ භික්ෂූන්ගේ, භික්ෂුණීන්ගේ, උපාසකයන්ගේ, උපාසිකාවන්ගේ ආරක්ෂාව පිණිස, නොපෙළීම පිණිස, පහසු විහරණය පිණිස ආටානාටිය නම් ආරක්ෂාව ඉගෙනගත මැනව’ යි කීවේය. මහණෙනි, මම නිහඬව එය ඉවසුවෙමි. මහණෙනි, වෙසවණ මහරජ මාගේ ඉවසීම දැන ඒ මොහොතෙහිම මේ ආටානාටිය නම් ආරක්ෂාව ප්‍රකාශ කළේය –",
      "paliTitle": ""
    },
    {
      "number": 287,
      "pali": "‘Vipassissa ca namatthu, cakkhumantassa sirīmato. Sikhissapi ca namatthu, sabbabhūtānukampino. ‘Vessabhussa ca namatthu, nhātakassa tapassino; Namatthu kakusandhassa, mārasenāpamaddino. ‘Koṇāgamanassa namatthu, brāhmaṇassa vusīmato; Kassapassa ca namatthu, vippamuttassa sabbadhi. ‘Aṅgīrasassa namatthu, sakyaputtassa sirīmato; Yo imaṃ dhammaṃ desesi, sabbadukkhāpanūdanaṃ. ‘Ye cāpi nibbutā loke, yathābhūtaṃ vipassisuṃ; Te janā apisuṇātha, mahantā vītasāradā. ‘Hitaṃ devamanussānaṃ, yaṃ namassanti gotamaṃ; Vijjācaraṇasampannaṃ, mahantaṃ vītasāradaṃ.",
      "english": "Homage to Vipassi, the one with vision, the glorious one. Homage also to Sikhi, the compassionate one toward all beings.\n\nHomage also to Vessabhu, the cleansed one, the ascetic. Homage to Kakusandha, the subduer of the army of Mara.\n\nHomage to Konagamana, the brahmin who has lived the noble life. Homage also to Kassapa, who is released in every way.\n\nHomage to Angirasa, the glorious son of the Sakyans, who taught this Dhamma, the remover of all suffering.\n\nThose who are extinguished in the world, who have seen reality as it is, those people, without malice, are great, free from fear.\n\nGood for gods and humans is the one whom they venerate, Gotama, accomplished in knowledge and conduct, great, free from fear.",
      "sinhala": "‘ඇස් ඇති, සිරි ඇති විපස්සි භාග්‍යවතුන් වහන්සේට නමස්කාර වේවා. සියලු සත්වයන් කෙරෙහි අනුකම්පා කරන්නාවූ සිඛී භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා.\n\n‘මල රහිත වූ, තපස් ඇති වෙස්සභූ භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා. මාර සේනාවන් මඩින ලද කකුසන්ධ භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා.\n\n‘ කෙලෙස් නැති බමුණු වූ කෝණාගමන භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා. සර්වප්‍රකාරයෙන්ම මිදුණු කාශ්‍යප භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා.\n\n‘සිරි ඇති ශාක්‍ය පුත්‍ර වූ අංගීරස භාග්‍යවතුන් වහන්සේට ද නමස්කාර වේවා. යම් භාග්‍යවතුන් වහන්සේ නමක් සියලු දුක් නැති කරන මේ ධර්මය දේශනා කළ සේක් ද, උන්වහන්සේට නමස්කාර වේවා.\n\n‘යම් කෙනෙක් ලෝකයෙහි පිරිනිවන් පෑවාහු ද, යථාභූත ඥානයෙන් දුටුවාහු ද, ඒ උතුම් වූ, භය රහිත වූ ජනයාට ද නමස්කාර වේවා.\n\n‘දේව මනුෂ්‍යයන්ට හිත වූ යම් ගෞතම බුදුරජාණන් වහන්සේ නමස්කාර කරත් ද, විද්‍යාචරණ සම්පන්න වූ, උතුම් වූ, භය රහිත වූ ඒ භාග්‍යවතුන් වහන්සේට නමස්කාර වේවා.",
      "paliTitle": ""
    },
    {
      "number": 288,
      "pali": "‘Yato uggacchati sūriyo, ādicco maṇḍalī mahā. Yassa cuggacchamānassa, saṃvarīpi nirujjhati; Yassa cuggate sūriye, ‘‘divaso’’ti pavuccati. ‘Rahadopi tattha gambhīro, samuddo saritodako; Evaṃ taṃ tattha jānanti, ‘‘samuddo saritodako’’. ‘Ito ‘‘sā purimā disā’’, iti naṃ ācikkhatī jano; Yaṃ disaṃ abhipāleti, mahārājā yasassi so. ‘Gandhabbānaṃ adhipati, ‘‘dhataraṭṭho’’ti nāmaso; Ramatī naccagītehi, gandhabbehi purakkhato. ‘Puttāpi tassa bahavo, ekanāmāti me sutaṃ; Asīti dasa eko ca, indanāmā mahabbalā. ‘Te cāpi buddhaṃ disvāna, buddhaṃ ādiccabandhunaṃ; Dūratova namassanti, mahantaṃ vītasāradaṃ. ‘Namo te purisājañña, namo te purisuttama; Kusalena samekkhasi, amanussāpi taṃ vandanti; Sutaṃ netaṃ abhiṇhaso, tassā evaṃ vademase. ‘‘Jinaṃ vandatha gotamaṃ, jinaṃ vandāma gotamaṃ; Vijjācaraṇasampannaṃ, buddhaṃ vandāma gotamaṃ’’.",
      "english": "From where the sun rises, the great radiant orb, the sun; and with the rising of which, the night also ceases; and with the rising of which sun, it is said, \"It is day.\"\n\nThere also is a deep lake, a sea with river-water; thus they know it there, \"a sea with river-water.\"\n\n\"This is the eastern direction,\" thus people declare it; the direction that is governed by the glorious great king.\n\nThe lord of the Gandharvas, named Dhataraṭṭha; he delights in dance and song, attended by Gandharvas.\n\nHe has many sons, I have heard, all of one name; eighty-one, named Inda, of great strength.\n\nThose too, having seen the Buddha, the Buddha, kinsman of the sun; from afar they pay homage, to the great one, devoid of fear.\n\n\"Homage to you, O excellent man; homage to you, O supreme man; with skillful insight, you regard; even non-humans venerate you.\" We have heard this repeatedly; therefore, we speak thus:\n\n\"Venerate the Conqueror Gotama; we venerate the Conqueror Gotama; accomplished in knowledge and conduct, we venerate the Buddha Gotama.\"",
      "sinhala": "‘යම් තැනකින් සූර්යයා උදාවන්නේද, ආදිච්ච මණ්ඩලී මහා නම් වූ හිරු උදාවන්නේද, යම් හිරු උදාවන කල්හි අඳුර දුරු වන්නේද, යම් හිරු උදාවීම නිසා දවස යයි කියනු ලැබේ ද,\n\n‘එහි ගැඹුරු විලක්ද, ගංගා ජලය ඇති මුහුදක්ද ඇත. එහි එය දන්නේ ගංගා ජලය ඇති මුහුද ලෙසයි.\n\n‘මෙතැන් සිට “ඒ පෙරදිගය” යයි ජනයා හඳුන්වති. යම් දිසාවක් යසස් ඇති මහාරාජයා පාලනය කරන්නේද,\n\n‘ගන්ධබ්බයන්ගේ අධිපති, “ධතරට්ඨ” යන නමින් යුක්තය. ඔහු නර්තනයන් ගීතයන් කෙරෙහි ඇලී ගැලී ගන්ධබ්බයන් විසින් පෙරටු කොට ගෙන වෙසෙයි.\n\n‘ඔහුට බොහෝ පුත්‍රයෝද සිටිති. ඔවුන් සියල්ලෝම එකම නමින් හඳුන්වනු ලබති. අනූ එක දෙනෙක් ඉන්දන නමින් මහත් බල ඇත්තෝ වෙති.\n\n‘ඔවුහු බුදුරජාණන් වහන්සේ දැක, හිරුගේ ඥාතියෙකු බඳු බුදුරජාණන් වහන්සේ දුර සිටම නමස්කාර කරති. මහත් වූ කෙලෙස් රහිත බුදුරජාණන් වහන්සේට නමස්කාර වේවා.\n\n‘පුරිස ආජානීය ඔබට නමස්කාර වේවා. පුරුෂෝත්තම ඔබට නමස්කාර වේවා. ඔබ කුසලයෙන් විමසන බැවින් අමනුෂ්‍යයෝද ඔබට වන්දනා කරති. එය නිතර අසන්නට ලැබේ. ඒ නිසා මෙසේ කියමු.\n\n‘‘ජින ගෞතමයන් වන්දනා කරව්, ජින ගෞතමයන් වන්දනා කරමු. විද්‍යාචරණ සම්පන්න වූ බුදු ගෞතමයන් වන්දනා කරමු.’’’",
      "paliTitle": ""
    },
    {
      "number": 289,
      "pali": "‘Yena petā pavuccanti, pisuṇā piṭṭhimaṃsikā. Pāṇātipātino luddā, corā nekatikā janā. ‘Ito ‘‘sā dakkhiṇā disā’’, iti naṃ ācikkhatī jano; Yaṃ disaṃ abhipāleti, mahārājā yasassi so. ‘Kumbhaṇḍānaṃ adhipati, ‘‘virūḷho’’ iti nāmaso; Ramatī naccagītehi, kumbhaṇḍehi purakkhato. ‘Puttāpi tassa bahavo, ekanāmāti me sutaṃ; Asīti dasa eko ca, indanāmā mahabbalā. ‘Te cāpi buddhaṃ disvāna, buddhaṃ ādiccabandhunaṃ; Dūratova namassanti, mahantaṃ vītasāradaṃ. ‘Namo te purisājañña, namo te purisuttama; Kusalena samekkhasi, amanussāpi taṃ vandanti; Sutaṃ netaṃ abhiṇhaso, tasmā evaṃ vademase. ‘‘Jinaṃ vandatha gotamaṃ, jinaṃ vandāma gotamaṃ; Vijjācaraṇasampannaṃ, buddhaṃ vandāma gotamaṃ’’.",
      "english": "'By which (deeds) are beings called \"departed spirits,\" slanderers, backbiters, murderers, cruel, thieves, deceitful people. \"This is the southern direction,\" so people declare it; The direction which is governed by a glorious great king. \"Virūḷha\" by name, the overlord of the Kumbhaṇḍas; He delights in dance and song, attended by Kumbhaṇḍas. \"He also has many sons, all with the same name, so I have heard; Eighty-one, all named Inda, of great power. \"They too, having seen the Buddha, the Buddha, kinsman of the sun; From afar they pay homage to the great one, free from fear. \"Homage to you, O noble man; homage to you, O supreme man; With skill you regard (all beings); even non-humans venerate you; This has been heard repeatedly, therefore we say thus: \"Venerate the Conqueror Gotama, we venerate the Conqueror Gotama; Accomplished in knowledge and conduct, we venerate the Buddha Gotama.\"'",
      "sinhala": "යම් හෙයකින් ප්‍රේතයන් යයි කියනු ලබන්නේ ද, කේලාම් කියන්නාවූ ද පිටුපසින් කතා කරන්නාවූ ද, ප්‍රාණඝාත කරන්නාවූ ද දරුණු වූ ද, සොරකම් කරන්නාවූ ද නින්දිත වූ ද ජනයා යම් දිශාවකට යත් ද; “ඔය දක්ෂිණ දිශාවයි” කියා ජනයා එය හඳුන්වති. යම් දිශාවක් යසස් ඇති මහරජ්ජුරුවන් විසින් පාලනය කරනු ලබන්නේ ද; “විරූඪ” යන නමින් කුම්භාණ්ඩයන්ගේ අධිපති ඔහු වේ. ඔහු කුම්භාණ්ඩයන් විසින් පිරිවරාගෙන නෘත්‍ය ගීතවලින් සතුටු වෙයි. “ඔහුගේ පුත්‍රයෝ බොහෝ දෙනෙක් ද සිටිති. ඔවුන් සියල්ලන්ට ම එකම නමක් ඇතැ”යි මම අසා ඇත්තෙමි. අසූ එකසිය දස දෙනෙක් ඉන්ද්‍ර යන නමින් මහත් බල ඇති ව සිටිති. “ඔවුහු ද සූර්ය වංශික බුදුරජාණන් වහන්සේ දැක, බිය රහිත වූ මහන්ත වූ බුදුරජාණන් වහන්සේට දුර සිට ම නමස්කාර කරති. “පුරිස ශ්‍රේෂ්ඨ වූ ඔබට නමස්කාර වේවා! පුරුෂෝත්තමයාණන් වහන්සේට නමස්කාර වේවා! ඔබ වහන්සේ කුසලයෙන් මැනවින් විමසා බලන සේක. මනුෂ්‍යයන් නොවන අය ද ඔබට වඳිති. මෙය නිතර අසන්නට ලැබෙයි. එබැවින් මෙසේ කියමු. “ගෞතම ජිනේන්ද්‍රයන් වඳින්න. ගෞතම ජිනේන්ද්‍රයන්ට අපි වඳිමු. විද්‍යාචරණ සම්පන්න වූ ගෞතම බුදුරජාණන් වහන්සේට වඳිමු’’.",
      "paliTitle": ""
    },
    {
      "number": 290,
      "pali": "‘Yattha coggacchati sūriyo, ādicco maṇḍalī mahā. Yassa coggacchamānassa, divasopi nirujjhati; Yassa coggate sūriye, ‘‘saṃvarī’’ti pavuccati. ‘Rahadopi tattha gambhīro, samuddo saritodako; Evaṃ taṃ tattha jānanti, samuddo saritodako. ‘Ito ‘‘sā pacchimā disā’’, iti naṃ ācikkhatī jano; Yaṃ disaṃ abhipāleti, mahārājā yasassi so. ‘Nāgānañca adhipati, ‘‘virūpakkho’’ti nāmaso; Ramatī naccagītehi, nāgeheva purakkhato. ‘Puttāpi tassa bahavo, ekanāmāti me sutaṃ; Asīti dasa eko ca, indanāmā mahabbalā. ‘Te cāpi buddhaṃ disvāna, buddhaṃ ādiccabandhunaṃ; Dūratova namassanti, mahantaṃ vītasāradaṃ. ‘Namo te purisājañña, namo te purisuttama; Kusalena samekkhasi, amanussāpi taṃ vandanti; Sutaṃ netaṃ abhiṇhaso, tasmā evaṃ vademase. ‘‘Jinaṃ vandatha gotamaṃ, jinaṃ vandāma gotamaṃ; Vijjācaraṇasampannaṃ, buddhaṃ vandāma gotamaṃ’’.",
      "english": "Where the sun sets, the great radiant orb, at whose setting even the day ceases, where the sun has set, it is called \"Saṃvarī.\"\n\nThere also is a deep lake, a sea with river water; thus they know it there: a sea with river water.\n\n\"This is the western direction,\" so people declare it, the direction ruled by the glorious great king,\n\nChief of the Nāgas, named Virūpakkha, he delights in dance and song, surrounded by Nāgas.\n\nHe has many sons, all with one name, so I have heard: eighty, ten, and one, all named Inda, of great power.\n\nHaving seen the Buddha, the Buddha, kinsman of the sun, from afar they pay homage to the great one, free from fear.\n\n\"Homage to you, noble man; homage to you, best of men! With skill you regard us; even non-humans venerate you.\" This we have heard repeatedly, therefore we speak thus:\n\n\"Venerate the Conqueror Gotama, we venerate the Conqueror Gotama, accomplished in knowledge and conduct, we venerate the Buddha Gotama.\"",
      "sinhala": "‘මහත් වූ මණ්ඩලාකාර හිරු උදාවන්නේ යම් තැනක ද, හිරු උදාවෙමින් සිටිය දී දිනය ද නිරුද්ධ වන්නේ ද, හිරු බැස ගිය පසු “සංවරී” යයි කියනු ලබන්නේ ද, ගැඹුරු විල ද, ගංගා ජලය සහිත සමුද්‍රය ද යම් තැනක වේ ද, එහි ගංගා ජලය සහිත සමුද්‍රය ඇති බව ඔවුහු දනිති. ‘මේ “බටහිර දිශාව” යැයි ජනයා එය හඳුන්වති. යසස් ඇති මහරජු යම් දිශාවක් පාලනය කරන්නේ ද, ‘නාගයන්ගේ අධිපති වූ විරූපක්ෂ නම් රජු නාගයන් විසින් පෙරටු කොට ගෙන නර්තනයෙන් හා ගීතයෙන් සතුටු වන්නේ ය. ‘ඔහුට එකම නමක් ඇති බොහෝ පුත්‍රයෝ ඇතැයි මම අසා ඇත්තෙමි. අසූ එක් දස දෙනෙක් ඉන්ද්‍ර නම් ඇති මහත් බල ඇත්තෝ වෙති. ‘ඔවුහු ද ආදිත්‍යයාගේ ඥාතියෙකු වූ බුදුන් දැක, දුර සිට ම මහත් වූ භය රහිත බුදුන්ට නමස්කාර කරති. ‘පුරිස අජානීය ඔබට නමස්කාර වේවා! පුරුෂෝත්තම ඔබට නමස්කාර වේවා! ඔබ කුසලයෙන් විමසන්නෙහි නම්, අමනුෂ්‍යයෝ ද ඔබට වන්දනා කරති. මෙය නිතර අසන්නට ලැබෙන දෙයක් බැවින් මෙසේ කියමු. “ජින ගෞතමයන්ට වන්දනා කරව්, අපි ජින ගෞතමයන්ට වන්දනා කරමු. විද්‍යාචරණ සම්පන්න වූ බුදු ගෞතමයන්ට වන්දනා කරමු.”’",
      "paliTitle": ""
    },
    {
      "number": 291,
      "pali": "‘Yena uttarakuruvho, mahāneru sudassano. Manussā tattha jāyanti, amamā apariggahā. ‘Na te bījaṃ pavapanti, nāpi nīyanti naṅgalā; Akaṭṭhapākimaṃ sāliṃ, paribhuñjanti mānusā. ‘Akaṇaṃ athusaṃ suddhaṃ, sugandhaṃ taṇḍulapphalaṃ; Tuṇḍikīre pacitvāna, tato bhuñjanti bhojanaṃ. ‘Gāviṃ ekakhuraṃ katvā, anuyanti disodisaṃ; Pasuṃ ekakhuraṃ katvā, anuyanti disodisaṃ. ‘Itthiṃ vā vāhanaṃ katvā, anuyanti disodisaṃ; Purisaṃ vāhanaṃ katvā, anuyanti disodisaṃ. ‘Kumāriṃ vāhanaṃ katvā, anuyanti disodisaṃ; Kumāraṃ vāhanaṃ katvā, anuyanti disodisaṃ. ‘Te yāne abhiruhitvā, Sabbā disā anupariyāyanti; Pacārā tassa rājino. ‘Hatthiyānaṃ assayānaṃ, Dibbaṃ yānaṃ upaṭṭhitaṃ; Pāsādā sivikā ceva, Mahārājassa yasassino. ‘Tassa ca nagarā ahu, Antalikkhe sumāpitā; Āṭānāṭā kusināṭā parakusināṭā, Nāṭasuriyā parakusiṭanāṭā. ‘Uttarena kasivanto, Janoghamaparena ca; Navanavutiyo ambaraambaravatiyo, Āḷakamandā nāma rājadhānī. ‘Kuverassa kho pana, mārisa, mahārājassa visāṇā nāma rājadhānī; Tasmā kuvero mahārājā, ‘‘vessavaṇo’’ti pavuccati. ‘Paccesanto pakāsenti, tatolā tattalā tatotalā; Ojasi tejasi tatojasī, sūro rājā ariṭṭho nemi. ‘Rahadopi tattha dharaṇī nāma, yato meghā pavassanti; Vassā yato patāyanti, sabhāpi tattha sālavatī nāma. ‘Yattha yakkhā payirupāsanti, tattha niccaphalā rukkhā; Nānā dijagaṇā yutā, mayūrakoñcābhirudā; Kokilādīhi vagguhi. ‘Jīvañjīvakasaddettha, atho oṭṭhavacittakā; Kukkuṭakā kuḷīrakā, vane pokkharasātakā. ‘Sukasāḷika saddettha, daṇḍamāṇavakāni ca; Sobhati sabbakālaṃ sā, kuveranaḷinī sadā. ‘Ito ‘‘sā uttarā disā’’, iti naṃ ācikkhatī jano; Yaṃ disaṃ abhipāleti, mahārājā yasassi so. ‘Yakkhānañca adhipati, ‘‘kuvero’’ iti nāmaso; Ramatī naccagītehi, yakkheheva purakkhato. ‘Puttāpi tassa bahavo, ekanāmāti me sutaṃ; Asīti dasa eko ca, indanāmā mahabbalā. ‘Te cāpi buddhaṃ disvāna, buddhaṃ ādiccabandhunaṃ; Dūratova namassanti, mahantaṃ vītasāradaṃ. ‘Namo te purisājañña, namo te purisuttama; Kusalena samekkhasi, amanussāpi taṃ vandanti; Sutaṃ netaṃ abhiṇhaso, tasmā evaṃ vademase. ‘‘Jinaṃ vandatha gotamaṃ, jinaṃ vandāma gotamaṃ; Vijjācaraṇasampannaṃ, buddhaṃ vandāma gotama’’nti.",
      "english": "'Where Uttarakuru is, where Mount Meru is beautiful, there humans are born, without possessions and without attachment. They do not sow seeds, nor are plows led; humans partake of rice that ripens without cultivation. Grainless, huskless, pure, fragrant, the fruit of rice grains; having cooked it in a pot, then they partake of the meal. Having made a cow a single-hoofed vehicle, they go in every direction; having made an ox a single-hoofed vehicle, they go in every direction. Having made a woman a vehicle, they go in every direction; having made a man a vehicle, they go in every direction. Having made a maiden a vehicle, they go in every direction; having made a boy a vehicle, they go in every direction. Having mounted those vehicles, they travel around in all directions; they are messengers of that king. Elephant vehicles, horse vehicles, divine vehicles are prepared; palaces and palanquins as well, for the glorious Great King. And he had cities, well-measured in the sky; Āṭānāṭā, Kusināṭā, Parakusināṭā, Nāṭasuriyā, Parakusiṭanāṭā. North of Kasivanta, and beyond the multitude of people; ninety-nine ambaraambravatiyo, is the capital city named Āḷakamandā. For Kuvera, the Great King, good sir, is a capital named Visāṇā; therefore Kuvera the Great King is called \"Vessavaṇa.\" Announcers proclaim, Tatolā, Tattalā, Tatotalā; Ojasi, Tejasi, Tatojasi, Sūro the king, Ariṭṭho, Nemi. There is also a lake named Dharaṇī, from where clouds rain; where the rains spread, there is also a hall named Sālavatī. Where the yakkhas attend, there are trees with constant fruit; filled with various flocks of birds, resounding with peacocks and herons; with the sweet sounds of cuckoos and others. The sound of the jīvañjīvaka is there, and also the oṭṭhavacittakā; kukkuṭakā, kuḷīrakā, in the forest, pokkharasātakā. Parrots and mynas sing there, and daṇḍamāṇavakāni too; it always shines, the kuveranaḷinī always. 'This is \"the northern direction,\"' thus people describe it; the direction that the glorious Great King rules. And the overlord of the yakkhas, with the name \"Kuvera\"; delights in dance and song, surrounded by yakkhas. He also has many sons, I have heard, with one name; eighty-one, with the name Inda, of great strength. They too, having seen the Buddha, the Buddha, the kinsman of the sun; salute him from afar, the great one, free from fear. Homage to you, noblest of men, homage to you, supreme among men; with skill you examine, even non-humans revere you; this is heard repeatedly, therefore we speak thus. 'Revere the Victor, Gotama, we revere the Victor, Gotama; accomplished in knowledge and conduct, we revere the Buddha, Gotama.'\"",
      "sinhala": "‘යෙන උත්තරකුරුවෝ, මහානෙරු සුදස්සනො. මනුස්සා තත්ථ ජායන්ති, අමමා අපරිග්ගහා.\n\n‘න තෙ බීජං පවපන්ති, නාපි නීයන්ති නඞ්ගලා; අකට්ඨපාකිමං සාලිං, පරිභුඤ්ජන්ති මානුසා.\n\n‘අකණං අථුසං සුද්ධං, සුගන්ධං තණ්ඩලප්ඵලං; තුණ්ඩිකීරෙ පචිත්වාන, තතො භුඤ්ජන්ති භෝජනං.\n\n‘ගාවිං ඒකඛුරං කත්වා, අනුයන්ති දිසොදිසං; පසුං ඒකඛුරං කත්වා, අනුයන්ති දිසොදිසං.\n\n‘ඉත්ථිං වා වාහනං කත්වා, අනුයන්ති දිසොදිසං; පුරිසං වාහනං කත්වා, අනුයන්ති දිසොදිසං.\n\n‘කුමාරිං වාහනං කත්වා, අනුයන්ති දිසොදිසං; කුමාරං වාහනං කත්වා, අනුයන්ති දිසොදිසං.\n\n‘තෙ යානෙ අභිරුහිත්වා, සබ්බා දිසා අනුපරියායන්ති; පචාරා තස්ස රාජිනො.\n\n‘හත්ථියානං අස්සයානං, දිබ්බං යානං උපට්ඨිතං; පාසාදා සිවිකා චෙව, මහාරාජස්ස යසස්සිනො.\n\n‘තස්ස ච නගරා අහු, අන්තලික්ඛෙ සුමාපිතා; ආටානාටා කුසිනාටා පරකුසිනාටා, නාටසුරියා පරකුසිටනාටා.\n\n‘උත්තරෙන කසිවන්තො, ජනොඝමපරෙන ච; නවනවුතියො අම්බරඅම්බරවතීයො, ආළකමන්දා නාම රාජධානී.\n\n‘කුවෙරස්ස ඛො පන, මාරිස, මහාරාජස්ස විසාණා නාම රාජධානී; තස්මා කුවෙරො මහාරාජා, ‘‘වෙස්සවණො’’ති පවුච්චති.\n\n‘පච්චෙසන්තො පකාසෙන්ති, තතොලා තත්තලා තතොතලා; ඕජසි තෙජසි තතෝජසී, සූරො රාජා අරිට්ඨො නෙමි.\n\n‘රහදොපි තත්ථ ධරණී නාම, යතො මෙඝා පවස්සන්ති; වස්සා යතො පතායන්ති, සභාපි තත්ථ සාලවතී නාම.\n\n‘යත්ථ යක්ඛා පයිරුපාසන්ති, තත්ථ නිච්චඵලා රුක්ඛා; නානා දිජගණා යුතා, මයූරකොඤ්චාභිරුදා; කොකිලාදීහි වග්ගුහි.\n\n‘ජීවඤ්ජීවකසද්දෙත්ථ, අථො ඔට්ඨවචිත්තකා; කුක්කුටකා කුළීරකා, වනෙ පොක්ඛරසාතකා.\n\n‘සුකසාලික සද්දෙත්ථ, දණ්ඩමාණවකානි ච; සොභති සබ්බකාලං සා, කුවෙරනළිනී සදා.\n\n‘ඉතො ‘‘සා උත්තරා දිසා’’, ඉති නං ආචික්ඛතී ජනො; යං දිසං අභිපාලෙති, මහාරාජා යසස්සි සො.\n\n‘යක්ඛානඤ්ච අධිපති, ‘‘කුවෙරො’’ ඉති නාමසො; රමතී නච්චගීතෙහි, යක්ඛෙහි එව පුරක්ඛතො.\n\n‘පුත්තාපි තස්ස බහවො, එකනාමාති මෙ සුතං; අසීති දස එකො ච, ඉන්දනාමා මහබ්බලා.\n\n‘තෙ චාපි බුද්ධං දිස්වාන, බුද්ධං ආදිච්චබන්ධුනං; දූරතොව නමස්සන්ති, මහන්තං වීතසාරදං.\n\n‘නමො තෙ පුරිසාජඤ්ඤ, නමො තෙ පුරිසොත්තම; කුසලෙන සමෙක්ඛසි, අමනුස්සාපි තං වන්දන්ති; සුතං නෙතං අභිණ්හසො, තස්මා එවං වදෙමසෙ.\n\n‘‘ජිනං වන්දථ ගොතමං, ජිනං වන්දාම ගොතමං; විජ්ජාචරණසම්පන්නං, බුද්ධං වන්දාම ගොතම’’න්ති.",
      "paliTitle": ""
    },
    {
      "number": 292,
      "pali": "‘Ayaṃ kho sā, mārisa, āṭānāṭiyā rakkhā bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ guttiyā rakkhāya avihiṃsāya phāsuvihārāya. Yassa kassaci, mārisa, bhikkhussa vā bhikkhuniyā vā upāsakassa vā upāsikāya vā ayaṃ āṭānāṭiyā rakkhā suggahitā bhavissati samattā pariyāputā taṃ ce amanusso yakkho vā yakkhinī vā…pe… gandhabbo vā gandhabbī vā…pe… kumbhaṇḍo vā kumbhaṇḍī vā…pe… nāgo vā nāgī vā nāgapotako vā nāgapotikā vā nāgamahāmatto vā nāgapārisajjo vā nāgapacāro vā, paduṭṭhacitto bhikkhuṃ vā bhikkhuniṃ vā upāsakaṃ vā upāsikaṃ vā gacchantaṃ vā anugaccheyya, ṭhitaṃ vā upatiṭṭheyya, nisinnaṃ vā upanisīdeyya, nipannaṃ vā upanipajjeyya. Na me so, mārisa, amanusso labheyya gāmesu vā nigamesu vā sakkāraṃ vā garukāraṃ vā. Na me so, mārisa, amanusso labheyya āḷakamandāya nāma rājadhāniyā vatthuṃ vā vāsaṃ vā. Na me so, mārisa, amanusso labheyya yakkhānaṃ samitiṃ gantuṃ. Apissu naṃ, mārisa, amanussā anāvayhampi naṃ kareyyuṃ avivayhaṃ. Apissu naṃ, mārisa, amanussā attāhi paripuṇṇāhi paribhāsāhi paribhāseyyuṃ. Apissu naṃ, mārisa, amanussā rittaṃpissa pattaṃ sīse nikkujjeyyuṃ. Apissu naṃ, mārisa, amanussā sattadhāpissa muddhaṃ phāleyyuṃ. Santi hi, mārisa, amanussā caṇḍā ruddhā rabhasā, te neva mahārājānaṃ ādiyanti, na mahārājānaṃ purisakānaṃ ādiyanti, na mahārājānaṃ purisakānaṃ purisakānaṃ ādiyanti. Te kho te, mārisa, amanussā mahārājānaṃ avaruddhā nāma vuccanti. Seyyathāpi, mārisa, rañño māgadhassa vijite mahācorā. Te neva rañño māgadhassa ādiyanti, na rañño māgadhassa purisakānaṃ ādiyanti, na rañño māgadhassa purisakānaṃ purisakānaṃ ādiyanti. Te kho te, mārisa, mahācorā rañño māgadhassa avaruddhā nāma vuccanti. Evameva kho, mārisa, santi amanussā caṇḍā ruddhā rabhasā, te neva mahārājānaṃ ādiyanti, na mahārājānaṃ purisakānaṃ ādiyanti, na mahārājānaṃ purisakānaṃ purisakānaṃ ādiyanti. Te kho te, mārisa, amanussā mahārājānaṃ avaruddhā nāma vuccanti. Yo hi koci, mārisa, amanusso yakkho vā yakkhinī vā…pe… gandhabbo vā gandhabbī vā…pe… kumbhaṇḍo vā kumbhaṇḍī vā…pe… nāgo vā nāgī vā…pe… paduṭṭhacitto bhikkhuṃ vā bhikkhuniṃ vā upāsakaṃ vā upāsikaṃ vā gacchantaṃ vā upagaccheyya, ṭhitaṃ vā upatiṭṭheyya, nisinnaṃ vā upanisīdeyya, nipannaṃ vā upanipajjeyya. Imesaṃ yakkhānaṃ mahāyakkhānaṃ senāpatīnaṃ mahāsenāpatīnaṃ ujjhāpetabbaṃ vikkanditabbaṃ viravitabbaṃ – ‘ayaṃ yakkho gaṇhāti, ayaṃ yakkho āvisati, ayaṃ yakkho heṭheti, ayaṃ yakkho viheṭheti, ayaṃ yakkho hiṃsati, ayaṃ yakkho vihiṃsati, ayaṃ yakkho na muñcatī’ti.",
      "english": "\"This, friend, is the Āṭānāṭiya protection for the safety, guarding, non-harming, and comfortable dwelling of monks, nuns, laymen, and laywomen. If, friend, any monk, nun, layman, or laywoman has well-grasped, completely learned, and mastered this Āṭānāṭiya protection, and if any non-human being, whether a yaksha or yakshini...or a gandhabba or gandhabbi...or a kumbhaṇḍa or kumbhaṇḍi...or a nāga or nāgi, a young nāga or young nāgi, a nāga great minister or nāga attendant or nāga follower, with a malevolent mind, should follow a monk, nun, layman, or laywoman who is walking, or stand near one who is standing, or sit near one who is sitting, or lie down near one who is lying down, that non-human being, friend, would not receive honor or respect in the villages or towns. That non-human being, friend, would not receive a dwelling or habitation in the royal city named Āḷakamandā. That non-human being, friend, would not be able to attend the assembly of yakshas. Moreover, friend, the non-humans would treat that non-human being with disrespect. Furthermore, friend, the non-humans would rebuke that non-human being with complete and utter reproaches. Moreover, friend, the non-humans would overturn that non-human being's empty bowl on his head. Furthermore, friend, the non-humans would split that non-human being's head into seven pieces. For there are, friend, non-humans who are fierce, angry, and violent; they do not obey the Great Kings, nor do they obey the attendants of the Great Kings, nor do they obey the attendants of the attendants of the Great Kings. These non-humans, friend, are called the outlaws of the Great Kings. Just as, friend, in the territory of King Māgadha there are great thieves; they do not obey King Māgadha, nor do they obey the attendants of King Māgadha, nor do they obey the attendants of the attendants of King Māgadha. These great thieves, friend, are called the outlaws of King Māgadha. Just so, friend, there are non-humans who are fierce, angry, and violent; they do not obey the Great Kings, nor do they obey the attendants of the Great Kings, nor do they obey the attendants of the attendants of the Great Kings. These non-humans, friend, are called the outlaws of the Great Kings. If any non-human being, friend, whether a yaksha or yakshini...or a gandhabba or gandhabbi...or a kumbhaṇḍa or kumbhaṇḍi...or a nāga or nāgi...with a malevolent mind, should approach a monk, nun, layman, or laywoman who is walking, or stand near one who is standing, or sit near one who is sitting, or lie down near one who is lying down, you should denounce, cry out against, and shout against these yakshas, great yakshas, commanders, and great commanders, saying: 'This yaksha is seizing, this yaksha is possessing, this yaksha is harming, this yaksha is injuring, this yaksha is hurting, this yaksha is violating, this yaksha does not release!'\"",
      "sinhala": "“පින්වත්නි, භික්‍ෂූන් භික්‍ෂුණීන් උපාසක උපාසිකාවන්ගේ ආරක්ෂාව පිණිස, රැකවරණය පිණිස, අවිහිංසාව පිණිස, පහසුවෙන් වාසය කිරීම පිණිස ආටානාටිය ආරක්ෂාව මෙය වේ. පින්වත්නි, යම් භික්‍ෂුවකට හෝ භික්‍ෂුණියකට හෝ උපාසකයෙකුට හෝ උපාසිකාවකට හෝ මෙම ආටානාටිය ආරක්ෂාව මනාව උග්‍රහණය කරන ලද්දේ වේ නම්, සම්පූර්ණ කරන ලද්දේ වේ නම්, හොඳින් ඉගෙන ගන්නා ලද්දේ වේ නම්, එවැනි අයෙකුට යම් අමනුෂ්‍ය යක්ෂයෙක් හෝ යක්ෂණියක් හෝ…පෙ.… ගන්ධර්වයෙක් හෝ ගන්ධර්වියක් හෝ…පෙ.… කුම්භාණ්ඩයෙක් හෝ කුම්භාණ්ඩියක් හෝ…පෙ.… නාගයෙක් හෝ නාගිනියක් හෝ නාග පැටවෙක් හෝ නාග දුවක් හෝ නාග මහා ඇමතියෙක් හෝ නාග පිරිසක් හෝ නාග පරිචාරකයෙක් හෝ ද්වේෂ සහගත සිතින් භික්‍ෂුවක් හෝ භික්‍ෂුණියක් හෝ උපාසකයෙක් හෝ උපාසිකාවක් හෝ ගමන් කරද්දී පසුපස එලවන්නේ නම්, සිටගෙන සිටින්නෙකු වෙත එළඹෙන්නේ නම්, හිඳගෙන සිටින්නෙකු වෙත ළං වන්නේ නම්, නිදා සිටින්නෙකු වෙත ළං වන්නේ නම්, පින්වත්නි, ඒ අමනුෂ්‍යයාට ගම්වල හෝ නියම්ගම්වල හෝ සත්කාරයක් හෝ ගරුකාරයක් හෝ නොලැබෙන්නේය. පින්වත්නි, ඒ අමනුෂ්‍යයාට ආලකමන්දා නම් රජදහනේ වස්තුවක් හෝ වාසස්ථානයක් හෝ නොලැබෙන්නේය. පින්වත්නි, ඒ අමනුෂ්‍යයාට යක්ෂයන්ගේ රැස්වීමකට යෑමට නොලැබෙන්නේය. එසේම, පින්වත්නි, අමනුෂ්‍යයෝ ඔහුට ගෙන ආ යුතු දේ පවා නොකරන්නාහ. එසේම, පින්වත්නි, අමනුෂ්‍යයෝ ඔහුව සම්පූර්ණ වචනවලින් පරිභව කරන්නාහ. එසේම, පින්වත්නි, අමනුෂ්‍යයෝ ඔහුගේ හිස් පාත්‍රය ඔහුගේ හිස මත උඩු යටිකුරු කරන්නාහ. එසේම, පින්වත්නි, අමනුෂ්‍යයෝ ඔහුගේ හිස සත් කඩකට පළන්නාහ. පින්වත්නි, දරුණු වූ, ක්‍රෝධ වූ, ඉක්මන් වූ අමනුෂ්‍යයෝ සිටිති. ඔවුන් මහරජුන්වත් ගණන් ගන්නේ නැත. මහරජුන්ගේ සේවකයන්වත් ගණන් ගන්නේ නැත. මහරජුන්ගේ සේවකයන්ගේ සේවකයන්වත් ගණන් ගන්නේ නැත. පින්වත්නි, ඒ අමනුෂ්‍යයන් මහරජුන්ට අවනත නොවූවෝ යයි කියනු ලැබේ. පින්වත්නි, මගධ රජුගේ රාජ්‍යයේ මහා සොරුන් මෙන්, ඔවුන් මගධ රජුන්වත් ගණන් ගන්නේ නැත. මගධ රජුන්ගේ සේවකයන්වත් ගණන් ගන්නේ නැත. මගධ රජුන්ගේ සේවකයන්ගේ සේවකයන්වත් ගණන් ගන්නේ නැත. පින්වත්නි, ඒ මහා සොරුන් මගධ රජුට අවනත නොවූවෝ යයි කියනු ලැබේ. එපරිද්දෙන්ම, පින්වත්නි, දරුණු වූ, ක්‍රෝධ වූ, ඉක්මන් වූ අමනුෂ්‍යයෝ සිටිති. ඔවුන් මහරජුන්වත් ගණන් ගන්නේ නැත. මහරජුන්ගේ සේවකයන්වත් ගණන් ගන්නේ නැත. මහරජුන්ගේ සේවකයන්ගේ සේවකයන්වත් ගණන් ගන්නේ නැත. පින්වත්නි, ඒ අමනුෂ්‍යයන් මහරජුන්ට අවනත නොවූවෝ යයි කියනු ලැබේ. පින්වත්නි, යම් අමනුෂ්‍ය යක්ෂයෙක් හෝ යක්ෂණියක් හෝ…පෙ.… ගන්ධර්වයෙක් හෝ ගන්ධර්වියක් හෝ…පෙ.… කුම්භාණ්ඩයෙක් හෝ කුම්භාණ්ඩියක් හෝ…පෙ.… නාගයෙක් හෝ නාගිනියක් හෝ…පෙ.… ද්වේෂ සහගත සිතින් භික්‍ෂුවක් හෝ භික්‍ෂුණියක් හෝ උපාසකයෙක් හෝ උපාසිකාවක් හෝ ගමන් කරද්දී ළඟා වන්නේ නම්, සිටගෙන සිටින්නෙකු වෙත එළඹෙන්නේ නම්, හිඳගෙන සිටින්නෙකු වෙත ළං වන්නේ නම්, නිදා සිටින්නෙකු වෙත ළං වන්නේ නම්, ඒ යක්ෂයන්ට, මහා යක්ෂයන්ට, සේනාපතියන්ට, මහා සේනාපතියන්ට මෙසේ දොස් පැවරිය යුතුය. හඬ නැගිය යුතුය. මොර ගැසිය යුතුය. විලාප නැගිය යුතුය. ‘මේ යක්ෂයා ග්‍රහණය කරයි. මේ යක්ෂයා ආවේශ කරයි. මේ යක්ෂයා පීඩා කරයි. මේ යක්ෂයා විහිංසා කරයි. මේ යක්ෂයා හිංසා කරයි. මේ යක්ෂයා විහිංසා කරයි. මේ යක්ෂයා මුදන්නේ නැත’ යැයි කියමින්.”",
      "paliTitle": ""
    },
    {
      "number": 293,
      "pali": "‘Katamesaṃ yakkhānaṃ mahāyakkhānaṃ senāpatīnaṃ mahāsenāpatīnaṃ? ‘Indo somo varuṇo ca, bhāradvājo pajāpati; Candano kāmaseṭṭho ca, kinnughaṇḍu nighaṇḍu ca. ‘Panādo opamañño ca, devasūto ca mātali; Cittaseno ca gandhabbo, naḷo rājā janesabho. ‘Sātāgiro hevamato, puṇṇako karatiyo guḷo; Sivako mucalindo ca, vessāmitto yugandharo. ‘Gopālo supparodho ca, hiri netti ca mandiyo; Pañcālacaṇḍo āḷavako, pajjunno sumano sumukho; Dadhimukho maṇi māṇivaro dīgho, atho serīsako saha. ‘Imesaṃ yakkhānaṃ mahāyakkhānaṃ senāpatīnaṃ mahāsenāpatīnaṃ ujjhāpetabbaṃ vikkanditabbaṃ viravitabbaṃ – ‘‘ayaṃ yakkho gaṇhāti, ayaṃ yakkho āvisati, ayaṃ yakkho heṭheti, ayaṃ yakkho viheṭheti, ayaṃ yakkho hiṃsati, ayaṃ yakkho vihiṃsati, ayaṃ yakkho na muñcatī’’ti. Ayaṃ kho, mārisa, āṭānāṭiyā rakkhā bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ guttiyā rakkhāya avihiṃsāya phāsuvihārāya. Handa ca dāni mayaṃ, mārisa, gacchāma, bahukiccā mayaṃ bahukaraṇīyā’’’ti. ‘‘‘Yassa dāni tumhe mahārājāno kālaṃ maññathā’’’ti.",
      "english": "Which of these yakkhas, great yakkhas, commanders, and great commanders are they? They are: Indra, Soma, Varuṇa, Bharadvaja, Pajāpati; Candana, Kāmaseṭṭha, Kinnughaṇḍu, Nighaṇḍu; Panāda, Opamañña, Devasūta, Mātali; Cittasena the gandhabba, Nala the king, Janesabha; Sātāgira, Hevamata, Puṇṇaka, Karatiya, Guḷa; Sivaka, Mucalinda, Vessāmitta, Yugandhara; Gopāla, Supparodha, Hiri, Netti, Mandiya; Pañcālacaṇḍa, Āḷavaka, Pajjunna, Sumana, Sumukha; Dadhimukha, Maṇi, Māṇivara, Dīgha, and Serīsaka, together. These are the yakkhas, great yakkhas, commanders, and great commanders of whom it should be proclaimed, shouted out, and cried aloud: \"This yakkha is seizing, this yakkha is possessing, this yakkha is afflicting, this yakkha is harming, this yakkha is injuring, this yakkha is seriously injuring, this yakkha is not releasing.\" This, friend, is the Āṭānāṭiya protection for the bhikkhus, bhikkhunis, upāsakas, and upāsikās, for their safety, protection, non-violence, and comfortable dwelling. Now then, friend, we must go, we have much to do, we have much to attend to. \"Great kings, do what you think is the proper time.\"",
      "sinhala": "‘කුමන යක්ෂයන්ගේද, මහා යක්ෂයන්ගේද, සේනාපතියන්ගේද, මහා සේනාපතියන්ගේද? ‘ඉන්ද්‍ර, සෝම, වරුණ සහ භාරද්වාජ, ප්‍රජාපති, චන්දන, කාමසෙට්ඨ, කිංනුඝණ්ඩු, නිඝණ්ඩු, පනාද, ඕපමඤ්ඤ, දේවසූත, මාතලී, චිත්තසේන නම් ගන්ධර්ව, නළ රජ, ජනෙසභ, සාතාගිර, හේමවත, පුණ්ණක, කරතිය, ගුළ, සිවක, මුචලින්ද, වෙස්සාමිත්ත, යුගන්ධර, ගෝපාල, සුප්පරෝධ, හිරි, නෙත්ති, මන්දිය, පඤ්චාලචණ්ඩ, ආළවක, පජ්ජුන්න, සුමන, සුමුඛ, දධිමුඛ, මණි, මාණිවර, දීඝ සහ සේරීසක යන මොවුන්ගේ නම් උච්ඡාරණය කළ යුතුය, හඬ නගා ප්‍රකාශ කළ යුතුය, මොරගැසිය යුතුය – “මෙම යක්ෂයා ගනී, මෙම යක්ෂයා ආවේශ වේ, මෙම යක්ෂයා පීඩා කරයි, මෙම යක්ෂයා විහේඨන කරයි, මෙම යක්ෂයා හිංසා කරයි, මෙම යක්ෂයා විහිංසා කරයි, මෙම යක්ෂයා මුදන්නේ නැත” කියාය. මාර්‍යෂ, ආටානාටිය ආරක්ෂාව භික්ෂූන්ගේ, භික්ෂුණීන්ගේ, උපාසකයන්ගේ, උපාසිකාවන්ගේ ආරක්ෂාව පිණිස, රක්ෂාව පිණිස, අවිහිංසාව පිණිස, පහසුවෙන් වාසය කිරීම පිණිස වෙයි. මාර්‍යෂ, දැන් අපි යමු, අපට බොහෝ කටයුතු ඇත, බොහෝ දේ කිරීමට ඇත.’ ‘‘‘මහරජවරුනි, දැන් ඔබ කුමන කාලයක් සුදුසු යයි සිතන සේක්ද’’’ යනුයි.",
      "paliTitle": ""
    },
    {
      "number": 294,
      "pali": "‘‘Atha kho, bhikkhave, cattāro mahārājā uṭṭhāyāsanā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyiṃsu. Tepi kho, bhikkhave, yakkhā uṭṭhāyāsanā appekacce maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyiṃsu. Appekacce mayā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā tatthevantaradhāyiṃsu. Appekacce yenāhaṃ tenañjaliṃ paṇāmetvā tatthevantaradhāyiṃsu. Appekacce nāmagottaṃ sāvetvā tatthevantaradhāyiṃsu. Appekacce tuṇhībhūtā tatthevantaradhāyiṃsu.",
      "english": "\"Then, monks, the four Great Kings rose from their seats, paid homage to me, circumambulated me, and vanished right there. Those yakkhas, monks, also rose from their seats; some paid homage to me, circumambulated me, and vanished right there. Some exchanged courteous greetings with me, conversing with polite and memorable talk, and vanished right there. Some extended their joined palms towards me and vanished right there. Some announced their names and clans and vanished right there. Some remained silent and vanished right there.\"",
      "sinhala": "‘‘ඉක්බිතිව, මහණෙනි, සතර මහා රජවරු අසුන්වලින් නැගිට මා වැඳ ප්‍රදක්ෂිණා කොට එතැනම අතුරුදහන් වූහ. මහණෙනි, ඒ යක්ෂයෝ ද අසුන්වලින් නැගිට ඇතැම් කෙනෙක් මා වැඳ ප්‍රදක්ෂිණා කොට එතැනම අතුරුදහන් වූහ. ඇතැම් කෙනෙක් මා සමඟ සතුටු වූහ. සතුටු විය යුතු කථා සිහිපත් කළ යුතු කථා නිමවා එතැනම අතුරුදහන් වූහ. ඇතැම් කෙනෙක් යම් තැනෙක්හි මම සිටිම් ද, එතැනට ඇඳිලි බැඳ එතැනම අතුරුදහන් වූහ. ඇතැම් කෙනෙක් නාම ගෝත්‍රය ප්‍රකාශ කොට එතැනම අතුරුදහන් වූහ. ඇතැම් කෙනෙක් නිශ්ශබ්දව එතැනම අතුරුදහන් වූහ.",
      "paliTitle": ""
    },
    {
      "number": 295,
      "pali": "‘‘Uggaṇhātha, bhikkhave, āṭānāṭiyaṃ rakkhaṃ. Pariyāpuṇātha, bhikkhave, āṭānāṭiyaṃ rakkhaṃ. Dhāretha, bhikkhave, āṭānāṭiyaṃ rakkhaṃ. Atthasaṃhitā [atthasaṃhitāyaṃ (syā.)], bhikkhave, āṭānāṭiyā rakkhā bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ guttiyā rakkhāya avihiṃsāya phāsuvihārāyā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. ",
      "english": "\"Learn, monks, the Āṭānāṭiya protection. Master, monks, the Āṭānāṭiya protection. Bear in mind, monks, the Āṭānāṭiya protection. It is connected with the goal, monks, this Āṭānāṭiya protection, for the safety, guarding, non-harming, and comfortable dwelling of monks, nuns, laymen, and laywomen.\"\n\nThis the Blessed One said. Pleased, those monks rejoiced in the Blessed One's words.",
      "sinhala": "“මහණෙනි, ආටානාටිය ආරක්ෂාව උගන්න. මහණෙනි, ආටානාටිය ආරක්ෂාව හොඳින් ප්‍රගුණ කරන්න. මහණෙනි, ආටානාටිය ආරක්ෂාව ධාරණය කරගන්න. මහණෙනි, ආටානාටිය ආරක්ෂාව අර්ථ සහිතයි, භික්ෂූන්ගේ, භික්ෂුණීන්ගේ, උපාසකයන්ගේ, උපාසිකාවන්ගේ ආරක්ෂාවට, රක්ෂාවට, අවිහිංසාවට, පහසු විහරණයට හේතු වෙයි” යනුවෙන් භාග්‍යවතුන් වහන්සේ වදාළ සේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගත්තාහුය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Āṭānāṭiyasuttaṃ niṭṭhitaṃ navamaṃ.",
    "english": "The Ninth Āṭānāṭiya Sutta Concluded",
    "sinhala": "නවවන ආටානාටිය සූත්‍U+200Dරය නිමයි."
  }
}