{
  "id": "dn1",
  "title": {
    "pali": "Pāthikasuttaṃ",
    "english": "The Pāthika Sutta",
    "sinhala": "පාථික සූත‍්‍රය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā mallesu viharati anupiyaṃ nāma [anuppiyaṃ nāma (syā.)] mallānaṃ nigamo. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya anupiyaṃ piṇḍāya pāvisi. Atha kho bhagavato etadahosi – ‘‘atippago kho tāva anupiyāyaṃ [anupiyaṃ (ka.)] piṇḍāya carituṃ. Yaṃnūnāhaṃ yena bhaggavagottassa paribbājakassa ārāmo, yena bhaggavagotto paribbājako tenupasaṅkameyya’’nti.",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling among the Mallas, at a market town of the Mallas named Anupiya.\n\nThen, in the forenoon, the Blessed One dressed, and taking his bowl and robe, entered Anupiya for alms. Then it occurred to the Blessed One: \"It is still too early to wander for alms in Anupiya. Let me now approach the park of the ascetic Bhaggavagotta, to where the ascetic Bhaggavagotta is.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ මල්ලවරුන්ගේ අනුපිය නම් නියම්ගමෙහි වැඩසිටින සේක. ඉන්පසු භාග්‍යවතුන් වහන්සේ පෙරවරුවෙහි සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන අනුපිය නියම්ගමෙහි පිණ්ඩපාතය පිණිස වැඩි සේක. එකල්හි භාග්‍යවතුන් වහන්සේට මෙසේ සිතුණි: \"අනුපිය නියම්ගමෙහි පිණ්ඩපාතය පිණිස හැසිරීමට තවමත් අතිශයින්ම ඉක්මන් වැඩියි. මම යම් තැනක භග්ගවගෝත්‍ර පරිබ්‍රාජකයාගේ ආරාමයද, යම් තැනක භග්ගවගෝත්‍ර පරිබ්‍රාජකයාද, ඒ තැනට උපසංක්‍රමණය කරන්නේ නම් හොඳයැයි.\"",
      "paliTitle": "Sunakkhattavatthu",
      "englishTitle": "Sunakkhatta's Story",
      "sinhalaTitle": "සුනක‍්ඛත‍්ත වස‍්තුව"
    },
    {
      "number": 2,
      "pali": "Atha kho bhagavā yena bhaggavagottassa paribbājakassa ārāmo, yena bhaggavagotto paribbājako tenupasaṅkami. Atha kho bhaggavagotto paribbājako bhagavantaṃ etadavoca – ‘‘etu kho, bhante, bhagavā. Svāgataṃ, bhante, bhagavato. Cirassaṃ kho, bhante, bhagavā imaṃ pariyāyamakāsi yadidaṃ idhāgamanāya. Nisīdatu, bhante, bhagavā, idamāsanaṃ paññatta’’nti. Nisīdi bhagavā paññatte āsane. Bhaggavagottopi kho paribbājako aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhaggavagotto paribbājako bhagavantaṃ etadavoca – ‘‘purimāni, bhante, divasāni purimatarāni sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ etadavoca – ‘paccakkhāto dāni mayā, bhaggava, bhagavā. Na dānāhaṃ bhagavantaṃ uddissa viharāmī’ti. Kaccetaṃ, bhante, tatheva, yathā sunakkhatto licchaviputto avacā’’ti? ‘‘Tatheva kho etaṃ, bhaggava, yathā sunakkhatto licchaviputto avaca’’.",
      "english": "Then the Blessed One approached the park of the wanderer Bhaggavagotta, where the wanderer Bhaggavagotta was. Then the wanderer Bhaggavagotta said to the Blessed One: \"Please come, Venerable Sir, Blessed One. Welcome, Venerable Sir, to the Blessed One. It has been a long time, Venerable Sir, since the Blessed One made this journey, this coming here. Please sit down, Venerable Sir, Blessed One; this seat has been prepared.\" The Blessed One sat down on the prepared seat. And the wanderer Bhaggavagotta, taking a certain low seat, sat down to one side. Seated to one side, the wanderer Bhaggavagotta said to the Blessed One: \"Some days ago, Venerable Sir, even before that, Sunakkhatta, the Licchavi's son, came to me; and having approached, he said this to me: 'Now, Bhaggava, I have rejected the Blessed One. I no longer live for the sake of the Blessed One.' Is that so, Venerable Sir, as Sunakkhatta, the Licchavi's son, said?\" \"Indeed, Bhaggava, it is exactly as Sunakkhatta, the Licchavi's son, said.\"",
      "sinhala": "ඉන්පසු භාග්‍යවතුන් වහන්සේ භග්ගවගොත්ත පරිබ්‍රාජකයාගේ ආරාමය තිබූ තැනටත්, භග්ගවගොත්ත පරිබ්‍රාජකයා සිටි තැනටත් වැඩියහ. ඉන්පසු භග්ගවගොත්ත පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, භාග්‍යවතුන් වහන්සේ වැඩම කළ මැනව. වහන්ස, භාග්‍යවතුන් වහන්සේට සුආගතයි. වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහි වැඩම කිරීමේ මේ අවස්ථාව බොහෝ කලකට පසුව සිදු කළ සේක. වහන්ස, භාග්‍යවතුන් වහන්සේ වැඩහිඳින සේක්වා, මේ ආසනය පනවා ඇත.\" භාග්‍යවතුන් වහන්සේ පනවන ලද ආසනයෙහි වැඩසිටි සේක. භග්ගවගොත්ත පරිබ්‍රාජකයාද වෙනත් පහත් ආසනයක් ගෙන එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි භග්ගවගොත්ත පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"වහන්ස, පෙර දවස්වල, ඊටත් පෙර දවස්වල, සුනක්ඛත්ත ලිච්ඡවි පුත්‍රයා මා වෙත පැමිණියේය. පැමිණ මට මෙසේ කීවේය: 'භග්ගවය, දැන් මා විසින් භාග්‍යවතුන් වහන්සේ ප්‍රතික්ෂේප කරනු ලැබ ඇත. දැන් මම භාග්‍යවතුන් වහන්සේ අරමුණු කරගෙන නොසිටිමි' කියාය. වහන්ස, සුනක්ඛත්ත ලිච්ඡවි පුත්‍රයා කී පරිදිම එය එසේමද?\" \"භග්ගවය, සුනක්ඛත්ත ලිච්ඡවි පුත්‍රයා කී පරිදිම එය එසේමයි.\"",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Purimāni, bhaggava, divasāni purimatarāni sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho, bhaggava, sunakkhatto licchaviputto maṃ etadavoca – ‘paccakkhāmi dānāhaṃ, bhante, bhagavantaṃ. Na dānāhaṃ, bhante, bhagavantaṃ uddissa viharissāmī’ti. ‘Evaṃ vutte, ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ, ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhīti. Napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmīti. Evaṃ sante, moghapurisa, ko santo kaṃ paccācikkhasi? Passa, moghapurisa, yāvañca [yāva ca (ka.)] te idaṃ aparaddha’nti.",
      "english": "Some days ago, Bhaggava, even earlier, Sunakkhatta the Licchavi prince approached me, and after bowing to me, he sat down to one side. As he was sitting to one side, Bhaggava, Sunakkhatta the Licchavi prince said this to me: ‘Venerable Sir, I now renounce the Blessed One. Venerable Sir, I shall no longer live dedicating myself to the Blessed One.’ When this was said, Bhaggava, I said this to Sunakkhatta the Licchavi prince: ‘Sunakkhatta, did I ever tell you, “Come, Sunakkhatta, live dedicating yourself to me”?’ ‘No, Venerable Sir.’ ‘Or did you tell me, “Venerable Sir, I shall live dedicating myself to the Blessed One”?’ ‘No, Venerable Sir.’ ‘So then, Sunakkhatta, I do not tell you, “Come, Sunakkhatta, live dedicating yourself to me.” Nor do you tell me, “Venerable Sir, I shall live dedicating myself to the Blessed One.” If that is the case, you foolish man, who are you, and whom are you renouncing? See, you foolish man, how much you have erred!’",
      "sinhala": "භග්ගව, මීට පෙර දිනවල, සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයා මා සිටි තැනට පැමිණියේය; පැමිණ, මා වන්දනා කර, එකත්පස්ව වාඩි විය. භග්ගව, එකත්පස්ව වාඩි වී සිටි සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයා මට මෙසේ කීවේය: ‘ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේව ප්‍රතික්ෂේප කරමි. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ අරභයා හැසිරෙන්නේ නැත.’ එසේ කී කල්හි, භග්ගව, මම සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයාට මෙසේ කීවෙමි: ‘සුනක්ඛත්ත, මම ඔබට මෙසේ කිව්වෙම්ද; එන්න, සුනක්ඛත්ත, ඔබ මා අරභයා හැසිරෙන්න’ කියා? ‘එසේ නැත, ස්වාමීනි.’ ‘නැතහොත් ඔබ මා හට මෙසේ කීවෙහිද; ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ අරභයා හැසිරෙමි’ කියා? ‘එසේ නැත, ස්වාමීනි.’ ‘එසේනම්, සුනක්ඛත්ත, මම ඔබට මෙසේ නොකියමි; එන්න, සුනක්ඛත්ත, ඔබ මා අරභයා හැසිරෙන්න’ කියා. ඔබත් මට මෙසේ නොකියයි; ‘ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ අරභයා හැසිරෙමි’ කියා. එසේ නම්, හිස් පුරුෂය, කවුරුන් සිට කවරෙකු ප්‍රතික්ෂේප කරන්නේද? බලන්න, හිස් පුරුෂය, ඔබට මේ කොපමණ වරදක්ද!’",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "‘Na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotī’ti. ‘Api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te uttarimanussadhammā iddhipāṭihāriyaṃ karissāmī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me uttarimanussadhammā iddhipāṭihāriyaṃ karissatī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te uttarimanussadhammā iddhipāṭihāriyaṃ karissāmī’ti; napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me uttarimanussadhammā iddhipāṭihāriyaṃ karissatī’ti. Evaṃ sante, moghapurisa, ko santo kaṃ paccācikkhasi? Taṃ kiṃ maññasi, sunakkhatta, kate vā uttarimanussadhammā iddhipāṭihāriye akate vā uttarimanussadhammā iddhipāṭihāriye yassatthāya mayā dhammo desito so niyyāti takkarassa sammā dukkhakkhayāyā’ti? ‘Kate vā, bhante, uttarimanussadhammā iddhipāṭihāriye akate vā uttarimanussadhammā iddhipāṭihāriye yassatthāya bhagavatā dhammo desito so niyyāti takkarassa sammā dukkhakkhayāyā’ti. ‘Iti kira, sunakkhatta, kate vā uttarimanussadhammā iddhipāṭihāriye, akate vā uttarimanussadhammā iddhipāṭihāriye, yassatthāya mayā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāya. Tatra, sunakkhatta, kiṃ uttarimanussadhammā iddhipāṭihāriyaṃ kataṃ karissati? Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti.",
      "english": "“Indeed, Venerable Sir, the Blessed One does not perform any superhuman feat of psychic power for me.” “Now, Sunakkhatta, did I ever say to you: ‘Come, Sunakkhatta, live for my sake, and I will perform a superhuman feat of psychic power for you’?” “No, Venerable Sir, you did not.” “Or did you say to me: ‘Venerable Sir, I will live for the Blessed One's sake, and the Blessed One will perform a superhuman feat of psychic power for me’?” “No, Venerable Sir, I did not.” “So then, Sunakkhatta, neither did I say to you: ‘Come, Sunakkhatta, live for my sake, and I will perform a superhuman feat of psychic power for you,’ nor did you say to me: ‘Venerable Sir, I will live for the Blessed One's sake, and the Blessed One will perform a superhuman feat of psychic power for me.’ That being the case, you deluded man, who are you to find fault with whom? What do you think, Sunakkhatta? Whether a superhuman feat of psychic power is performed or not performed, does the Dhamma that I have taught lead to the complete cessation of suffering for one who practices it correctly?” “Whether, Venerable Sir, a superhuman feat of psychic power is performed or not performed, the Dhamma that the Blessed One has taught leads to the complete cessation of suffering for one who practices it correctly.” “So then, Sunakkhatta, whether a superhuman feat of psychic power is performed or not performed, the Dhamma that I have taught leads to the complete cessation of suffering for one who practices it correctly. In that case, Sunakkhatta, what use will performing a superhuman feat of psychic power be? See, you deluded man, how greatly you have erred in this matter!”",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මා වෙනුවෙන් උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් නොකළ සේකැ'යි. සුනක්ඛත්ත, මම ඔබට මෙසේ කීවෙම්ද: 'එන්න, සුනක්ඛත්ත, මා අරමුණු කරගෙන වාසය කරන්න, මම ඔබට උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් කරන්නෙමි' කියා? එසේ නොවේ, භාග්‍යවතුන් වහන්ස. නැතහොත් ඔබ මා හට මෙසේ කීවෙහිද: 'භාග්‍යවතුන් වහන්ස, මම භාග්‍යවතුන් වහන්සේ අරමුණු කරගෙන වාසය කරන්නෙමි, භාග්‍යවතුන් වහන්සේ මා වෙනුවෙන් උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් කරනු ඇතැ'යි? එසේ නොවේ, භාග්‍යවතුන් වහන්ස. එසේ නම්, සුනක්ඛත්ත, මම ඔබට 'එන්න, සුනක්ඛත්ත, මා අරමුණු කරගෙන වාසය කරන්න, මම ඔබට උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් කරන්නෙමි' කියා නොකීවෙමි. ඔබ ද මා හට 'භාග්‍යවතුන් වහන්ස, මම භාග්‍යවතුන් වහන්සේ අරමුණු කරගෙන වාසය කරන්නෙමි, භාග්‍යවතුන් වහන්සේ මා වෙනුවෙන් උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් කරනු ඇතැ'යි නොකීවෙහි. එසේ තිබියදී, මොඝපුරුෂය, කවුරු සිට කවුරුට දොස් පවරන්නේද? සුනක්ඛත්ත, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් කරන ලද හෝ නොකරන ලද අවස්ථාවකදී, මා විසින් දේශනා කරන ලද ධර්මය, යම් අර්ථයක් සඳහා දේශනා කරන ලද්දේද, එය ඒ අයුරින් පිළිපදින තැනැත්තාට දුකෙහි සැබෑ අවසානය සඳහා යොමු වන්නේද? භාග්‍යවතුන් වහන්ස, උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් කරන ලද හෝ නොකරන ලද අවස්ථාවකදී, භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය, යම් අර්ථයක් සඳහා දේශනා කරන ලද්දේද, එය ඒ අයුරින් පිළිපදින තැනැත්තාට දුකෙහි සැබෑ අවසානය සඳහා යොමු වන්නේය. එසේ නම්, සුනක්ඛත්ත, උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් කරන ලද හෝ නොකරන ලද අවස්ථාවකදී, මා විසින් දේශනා කරන ලද ධර්මය, යම් අර්ථයක් සඳහා දේශනා කරන ලද්දේද, එය ඒ අයුරින් පිළිපදින තැනැත්තාට දුකෙහි සැබෑ අවසානය සඳහා යොමු වන්නේය. එසේ නම්, සුනක්ඛත්ත, උත්තරීතර මනුෂ්‍ය ධර්මයකට අයත් ඍද්ධි ප්‍රාතිහාර්යයක් කිරීමෙන් ඇති ප්‍රයෝජනය කුමක්ද? මොඝපුරුෂය, ඔබ කොපමණ වරදක් කර ඇත්තේදැ'යි බලන්න.",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘Na hi pana me, bhante, bhagavā aggaññaṃ paññapetī’ti [paññāpetīti (pī.)]? ‘Api nu tāhaṃ, sunakkhatta, evaṃ avacaṃ – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te aggaññaṃ paññapessāmī’ti? ‘No hetaṃ, bhante’. ‘Tvaṃ vā pana maṃ evaṃ avaca – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me aggaññaṃ paññapessatī’ti? ‘No hetaṃ, bhante’. ‘Iti kira, sunakkhatta, nevāhaṃ taṃ vadāmi – ehi tvaṃ, sunakkhatta, mamaṃ uddissa viharāhi, ahaṃ te aggaññaṃ paññapessāmīti. Napi kira maṃ tvaṃ vadesi – ahaṃ, bhante, bhagavantaṃ uddissa viharissāmi, bhagavā me aggaññaṃ paññapessatī’ti. Evaṃ sante, moghapurisa, ko santo kaṃ paccācikkhasi? Taṃ kiṃ maññasi, sunakkhatta, paññatte vā aggaññe, apaññatte vā aggaññe, yassatthāya mayā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāyā’ti? ‘Paññatte vā, bhante, aggaññe, apaññatte vā aggaññe, yassatthāya bhagavatā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāyā’ti. ‘Iti kira, sunakkhatta, paññatte vā aggaññe, apaññatte vā aggaññe, yassatthāya mayā dhammo desito, so niyyāti takkarassa sammā dukkhakkhayāya. Tatra, sunakkhatta, kiṃ aggaññaṃ paññattaṃ karissati? Passa, moghapurisa, yāvañca te idaṃ aparaddhaṃ’.",
      "english": "\"Venerable Sir, the Blessed One does not declare the cosmic genesis to me.\"\n\n\"Sunakkhatta, did I ever say to you: 'Come, Sunakkhatta, live devoted to me, and I will declare the cosmic genesis to you'?\"\n\n\"No, Venerable Sir.\"\n\n\"Or did you, for your part, ever say to me: 'Venerable Sir, I will live devoted to the Blessed One, and the Blessed One will declare the cosmic genesis to me'?\"\n\n\"No, Venerable Sir.\"\n\n\"So then, Sunakkhatta, neither did I say to you: 'Come, Sunakkhatta, live devoted to me, and I will declare the cosmic genesis to you.' Nor did you say to me: 'Venerable Sir, I will live devoted to the Blessed One, and the Blessed One will declare the cosmic genesis to me.' That being the case, foolish man, who are you, and whom are you criticizing? What do you think, Sunakkhatta, whether the cosmic genesis is declared or not declared, does the Dhamma taught by me, for the sake of which it was taught, lead the practitioner to the complete cessation of suffering?\"\n\n\"Venerable Sir, whether the cosmic genesis is declared or not declared, the Dhamma taught by the Blessed One, for the sake of which it was taught, leads the practitioner to the complete cessation of suffering.\"\n\n\"So then, Sunakkhatta, whether the cosmic genesis is declared or not declared, the Dhamma taught by me, for the sake of which it was taught, leads the practitioner to the complete cessation of suffering. In that case, Sunakkhatta, what will the declared cosmic genesis accomplish? See, foolish man, how far you have erred in this matter.\"",
      "sinhala": "‘භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ මට ආග්‍රඥය දේශනා නොකරන සේකැ’යි?\n‘සුනක්ඛත්තය, මා විසින් ඔබට මෙසේ කියන ලද්දේද – “එන්න, සුනක්ඛත්තය, මා අරමුණු කරගෙන වාසය කරන්න, මම ඔබට ආග්‍රඥය දේශනා කරන්නෙමි” කියා?’\n‘එසේ නොවේ, භාග්‍යවතුන් වහන්ස’.\n‘නැතහොත් ඔබ විසින් මට මෙසේ කියන ලද්දේද – “භාග්‍යවතුන් වහන්ස, මම භාග්‍යවතුන් වහන්සේ අරමුණු කරගෙන වාසය කරන්නෙමි, භාග්‍යවතුන් වහන්සේ මට ආග්‍රඥය දේශනා කරන සේකැ”යි?’\n‘එසේ නොවේ, භාග්‍යවතුන් වහන්ස’.\n‘එසේ නම්, සුනක්ඛත්තය, මා විසින් ඔබට මෙසේ කියන ලද්දේද – “එන්න, සුනක්ඛත්තය, මා අරමුණු කරගෙන වාසය කරන්න, මම ඔබට ආග්‍රඥය දේශනා කරන්නෙමි” කියා නොවේ. ඔබ විසින්ද මට මෙසේ කියන ලද්දේ නොවේ – “භාග්‍යවතුන් වහන්ස, මම භාග්‍යවතුන් වහන්සේ අරමුණු කරගෙන වාසය කරන්නෙමි, භාග්‍යවතුන් වහන්සේ මට ආග්‍රඥය දේශනා කරන සේකැ”යි කියා. එසේ තිබියදී, මොඝපුරුෂය, කවරෙක් සිට කවරෙකුට චෝදනා කරන්නේද? සුනක්ඛත්තය, ඔබ කුමක් සිතන්නේද? ආග්‍රඥය දේශනා කර තිබුණත්, නොකර තිබුණත්, මා විසින් යම් අර්ථයක් පිණිස ධර්මය දේශනා කරන ලදද, එය එසේ පිළිපදින්නාට නිසි පරිදි දුක් ක්ෂ​ය වීම පිණිස පවතින්නේද?’\n‘භාග්‍යවතුන් වහන්ස, ආග්‍රඥය දේශනා කර තිබුණත්, නොකර තිබුණත්, භාග්‍යවතුන් වහන්සේ විසින් යම් අර්ථයක් පිණිස ධර්මය දේශනා කරන ලදද, එය එසේ පිළිපදින්නාට නිසි පරිදි දුක් ක්ෂ​ය වීම පිණිස පවතින්නේය’.\n‘එසේ නම්, සුනක්ඛත්තය, ආග්‍රඥය දේශනා කර තිබුණත්, නොකර තිබුණත්, මා විසින් යම් අර්ථයක් පිණිස ධර්මය දේශනා කරන ලදද, එය එසේ පිළිපදින්නාට නිසි පරිදි දුක් ක්ෂ​ය වීම පිණිස පවතින්නේය. එහිදී, සුනක්ඛත්තය, ආග්‍රඥය දේශනා කිරීම කුමක් කරන්නේද? බලන්න, මොඝපුරුෂය, මේ ඔබ කෙතරම් වරදක් කර ඇත්තේද යන්න’.",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘Anekapariyāyena kho te, sunakkhatta, mama vaṇṇo bhāsito vajjigāme – itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavāti. Iti kho te, sunakkhatta, anekapariyāyena mama vaṇṇo bhāsito vajjigāme. ‘Anekapariyāyena kho te, sunakkhatta, dhammassa vaṇṇo bhāsito vajjigāme – svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhīti. Iti kho te, sunakkhatta, anekapariyāyena dhammassa vaṇṇo bhāsito vajjigāme. ‘Anekapariyāyena kho te, sunakkhatta, saṅghassa vaṇṇo bhāsito vajjigāme – suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā, esa bhagavato sāvakasaṅgho, āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassāti. Iti kho te, sunakkhatta, anekapariyāyena saṅghassa vaṇṇo bhāsito vajjigāme. ‘Ārocayāmi kho te, sunakkhatta, paṭivedayāmi kho te, sunakkhatta. Bhavissanti kho te, sunakkhatta, vattāro, no visahi sunakkhatto licchaviputto samaṇe gotame brahmacariyaṃ carituṃ, so avisahanto sikkhaṃ paccakkhāya hīnāyāvattoti. Iti kho te, sunakkhatta, bhavissanti vattāro’ti. Evaṃ pi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko.",
      "english": "\"Indeed, Sunakkhatta, in many ways, my praise was declared in Vajjigāma: ‘He is indeed the Blessed One, the Arahant, the Perfectly Self-Awakened One, endowed with knowledge and conduct, the Fortunate One, the Knower of the Worlds, the Unexcelled Trainer of persons to be tamed, the Teacher of gods and humans, the Buddha, the Blessed One.’ Thus, Sunakkhatta, in many ways, my praise was declared in Vajjigāma.\n\nIndeed, Sunakkhatta, in many ways, the praise of the Dhamma was declared in Vajjigāma: ‘The Dhamma is well-proclaimed by the Blessed One, directly visible, immediate, inviting one to come and see, progressive, to be personally experienced by the wise.’ Thus, Sunakkhatta, in many ways, the praise of the Dhamma was declared in Vajjigāma.\n\nIndeed, Sunakkhatta, in many ways, the praise of the Saṅgha was declared in Vajjigāma: ‘The Saṅgha of the Blessed One’s disciples is practicing well, practicing straightforwardly, practicing insightfully, practicing respectfully; that is, the four pairs of persons, the eight individual noble ones—this is the Saṅgha of the Blessed One’s disciples, worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.’ Thus, Sunakkhatta, in many ways, the praise of the Saṅgha was declared in Vajjigāma.\n\nIndeed, Sunakkhatta, I announce to you; indeed, Sunakkhatta, I declare to you: ‘Indeed, Sunakkhatta, there will be those who say: “Sunakkhatta, the Licchavi’s son, was unable to lead the holy life under the ascetic Gotama; being unable, he renounced the training and returned to a lower state.”’ Thus, Sunakkhatta, there will be those who say. Yet, Bhaggava, even though spoken to by me in this way, Sunakkhatta, the Licchavi’s son, departed from this Dhamma and Discipline, as one who is destined for a state of woe, for hell.\"",
      "sinhala": "‘සුනක්ඛත්තය, වජ්ජිග්‍රාමයෙහිදී ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විජ්ජාචරණසම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථි, සත්ථා දේවමනුස්සානං, බුද්ධ, භගවා යනුවෙනි’ යි මාගේ ගුණ බොහෝ ආකාරයෙන් ඔබට වර්ණනා කරන ලදී. සුනක්ඛත්තය, මෙසේ වජ්ජිග්‍රාමයෙහිදී මාගේ ගුණ බොහෝ ආකාරයෙන් ඔබට වර්ණනා කරන ලදී.\n\n‘සුනක්ඛත්තය, වජ්ජිග්‍රාමයෙහිදී ‘භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත වූ ධර්‍මය ස්වයං දෘෂ්ටික, කාලය ඉක්මවූ, පැමිණ බලන්නට සුදුසු, නිර්වාණයට පමුණුවන, ප්‍රඥාවන්තයින් විසින් තමන් තුළින්ම අවබෝධ කළ යුතු ය’ යි ධර්‍මයේ ගුණ බොහෝ ආකාරයෙන් ඔබට වර්ණනා කරන ලදී. සුනක්ඛත්තය, මෙසේ වජ්ජිග්‍රාමයෙහිදී ධර්‍මයේ ගුණ බොහෝ ආකාරයෙන් ඔබට වර්ණනා කරන ලදී.\n\n‘සුනක්ඛත්තය, වජ්ජිග්‍රාමයෙහිදී ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා සුපටිපන්න ය, උජුපටිපන්න ය, ඤායපටිපන්න ය, සාමීචිපටිපන්න ය. ඒ මේ සතරක් වූ පුරුෂ යුගල, අටක් වූ පුරිෂ පුග්ගල යන මේ භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ආහුනෙය්‍ය, පාහුනෙය්‍ය, දක්ඛිණෙය්‍ය, අංජලිකරණීය වේ, ලෝකයාට අනුත්තර වූ පින්කෙතක් වේ’ යි සංඝයාගේ ගුණ බොහෝ ආකාරයෙන් ඔබට වර්ණනා කරන ලදී. සුනක්ඛත්තය, මෙසේ වජ්ජිග්‍රාමයෙහිදී සංඝයාගේ ගුණ බොහෝ ආකාරයෙන් ඔබට වර්ණනා කරන ලදී.\n\n‘සුනක්ඛත්තය, මම ඔබට දන්වමි, සුනක්ඛත්තය, මම ඔබට දන්වා සිටිමි. සුනක්ඛත්තය, ‘ලිච්ඡවී පුත් සුනක්ඛත්ත ගෞතම ශ්‍රමණයා කෙරෙහි බ්‍රහ්මචරියාවෙහි හැසිරීමට නොහැකි විය. ඔහු නොහැකි බැවින් සික්ෂාව ප්‍රතික්ෂේප කර හීන තත්ත්වයට පත් විය’ යනුවෙන් ඔබට කියන්නට මිනිසුන් සිටිනු ඇත. සුනක්ඛත්තය, මෙසේ ඔබට කියන්නට මිනිසුන් සිටිනු ඇත.’ භග්ගවය, මෙසේ මා විසින් කියනු ලැබුවද, ලිච්ඡවී පුත් සුනක්ඛත්ත මේ ධර්‍ම විනයෙන් පිට වී ගියේය, යම් සේ ඔහු අපායගාමී වූයේ නිරයගාමී වූයේ ද ඒ ආකාරයටමය.",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Ekamidāhaṃ, bhaggava, samayaṃ thūlūsu [bumūsu (sī. pī.)] viharāmi uttarakā nāma thūlūnaṃ nigamo. Atha khvāhaṃ, bhaggava, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sunakkhattena licchaviputtena pacchāsamaṇena uttarakaṃ piṇḍāya pāvisiṃ. Tena kho pana samayena acelo korakkhattiyo kukkuravatiko catukkuṇḍiko [catukuṇḍiko (sī. pī.) catukoṇḍiko (syā. ka.)] chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjati. Addasā kho, bhaggava, sunakkhatto licchaviputto acelaṃ korakkhattiyaṃ kukkuravatikaṃ catukkuṇḍikaṃ chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādantaṃ mukheneva bhuñjantaṃ. Disvānassa etadahosi – ‘sādhurūpo vata, bho, ayaṃ [arahaṃ (sī. syā. pī.)] samaṇo catukkuṇḍiko chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjatī’ti. ‘‘Atha khvāhaṃ, bhaggava, sunakkhattassa licchaviputtassa cetasā cetoparivitakkamaññāya sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘tvampi nāma, moghapurisa, samaṇo sakyaputtiyo [moghapurisa sakyaputtiyo (sī. syā. pī.)] paṭijānissasī’ti! ‘Kiṃ pana maṃ, bhante, bhagavā evamāha – ‘tvampi nāma, moghapurisa, samaṇo sakyaputtiyo [moghapurisa sakyaputtiyo (sī. syā. pī.)] paṭijānissasī’ti? ‘Nanu te, sunakkhatta, imaṃ acelaṃ korakkhattiyaṃ kukkuravatikaṃ catukkuṇḍikaṃ chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādantaṃ mukheneva bhuñjantaṃ disvāna etadahosi – sādhurūpo vata, bho, ayaṃ samaṇo catukkuṇḍiko chamānikiṇṇaṃ bhakkhasaṃ mukheneva khādati, mukheneva bhuñjatī’ti? ‘Evaṃ, bhante. Kiṃ pana, bhante, bhagavā arahattassa maccharāyatī’ti? ‘Na kho ahaṃ, moghapurisa, arahattassa maccharāyāmi. Api ca, tuyhevetaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ, taṃ pajaha. Mā te ahosi dīgharattaṃ ahitāya dukkhāya. Yaṃ kho panetaṃ, sunakkhatta, maññasi acelaṃ korakkhattiyaṃ – sādhurūpo ayaṃ samaṇoti [maññasi ‘‘acelo korakhattiyo sādhurūpo arahaṃ samaṇoti’’ (syā.)]. So sattamaṃ divasaṃ alasakena kālaṅkarissati. Kālaṅkato [kālakato (sī. syā. pī.)] ca kālakañcikā [kālakañjā (sī. pī.), kālakañjikā (syā.)] nāma asurā sabbanihīno asurakāyo, tatra upapajjissati. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍessanti. Ākaṅkhamāno ca tvaṃ, sunakkhatta, acelaṃ korakkhattiyaṃ upasaṅkamitvā puccheyyāsi – jānāsi, āvuso korakkhattiya [acela korakhattiya (ka.)], attano gatinti? Ṭhānaṃ kho panetaṃ, sunakkhatta, vijjati yaṃ te acelo korakkhattiyo byākarissati – jānāmi, āvuso sunakkhatta, attano gatiṃ; kālakañcikā nāma asurā sabbanihīno asurakāyo, tatrāmhi upapannoti. ‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yena acelo korakkhattiyo tenupasaṅkami; upasaṅkamitvā acelaṃ korakkhattiyaṃ etadavoca – ‘byākato khosi, āvuso korakkhattiya, samaṇena gotamena – acelo korakkhattiyo sattamaṃ divasaṃ alasakena kālaṅkarissati. Kālaṅkato ca kālakañcikā nāma asurā sabbanihīno asurakāyo, tatra upapajjissati. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍessantī’ti. Yena tvaṃ, āvuso korakkhattiya, mattaṃ mattañca bhattaṃ bhuñjeyyāsi, mattaṃ mattañca pānīyaṃ piveyyāsi. Yathā samaṇassa gotamassa micchā assa vacana’nti.",
      "english": "Once, Venerable sir, I was residing among the Thulus, in a town of the Thulus called Uttarakā. Then, Venerable sir, in the morning, having dressed and taken my bowl and robes, I entered Uttarakā for alms, with Sunakkhatta the Licchavi's son as my attendant. At that time, the naked ascetic Korakkhattiya, who practiced the dog-asceticism, was on all fours, eating food fallen on the ground directly with his mouth, consuming it directly with his mouth. Sunakkhatta the Licchavi's son, Venerable sir, saw the naked ascetic Korakkhattiya, who practiced the dog-asceticism, on all fours, eating food fallen on the ground directly with his mouth, consuming it directly with his mouth. Having seen him, this thought occurred to him: ‘Indeed, what a virtuous ascetic this is, on all fours, eating food fallen on the ground directly with his mouth, consuming it directly with his mouth!’ Then, Venerable sir, having understood the thought process in the mind of Sunakkhatta the Licchavi's son through my own mind, I said to Sunakkhatta the Licchavi's son, ‘You, misguided man, claim to be an ascetic, a son of the Sakyans!’ ‘But why, Venerable Sir, does the Blessed One say this to me: ‘You, misguided man, claim to be an ascetic, a son of the Sakyans!’’ ‘Didn't you, Sunakkhatta, — having seen this naked ascetic Korakkhattiya, who practiced the dog-asceticism, on all fours, eating food fallen on the ground directly with his mouth, consuming it directly with his mouth — think this: ‘Indeed, what a virtuous ascetic this is, on all fours, eating food fallen on the ground directly with his mouth, consuming it directly with his mouth!’’ ‘Yes, Venerable Sir. But, Venerable Sir, is the Blessed One jealous of arahantship?’ ‘No, misguided man, I am not jealous of arahantship. However, this evil view has arisen in you; abandon it. May it not be to your harm and suffering for a long time. For as for this naked ascetic Korakkhattiya, Sunakkhatta, whom you consider a virtuous ascetic, he will die of dysentery on the seventh day. And having died, he will be reborn among the Kālakañcikā asuras, the lowest class of asuras. And when he has died, they will cast him away in the cemetery among the clumps of grass. If you wish, Sunakkhatta, you may approach the naked ascetic Korakkhattiya and ask him: ‘Friend Korakkhattiya, do you know your destiny?’ It is possible, Sunakkhatta, that the naked ascetic Korakkhattiya will declare to you: ‘I know my destiny, friend Sunakkhatta; I have been reborn among the Kālakañcikā asuras, the lowest class of asuras.’’\n\nThen, Venerable sir, Sunakkhatta the Licchavi's son approached the naked ascetic Korakkhattiya; having approached, he said to the naked ascetic Korakkhattiya: ‘Friend Korakkhattiya, the ascetic Gotama has declared regarding you: The naked ascetic Korakkhattiya will die of dysentery on the seventh day. And having died, he will be reborn among the Kālakañcikā asuras, the lowest class of asuras. And when he has died, they will cast him away in the cemetery among the clumps of grass.’ ‘Therefore, friend Korakkhattiya, you should eat a little food and drink a little water, so that the ascetic Gotama's words may prove false.’",
      "sinhala": "එක් කලෙක භග්ගව, මම තුලූ නම් ගමේ, උත්තරක නම් තුලූ ජනපදයක වාසය කළෙමි. එවිට භග්ගව, මම පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන, ලීච්ඡවී පුත්‍ර සුනක්ඛත්ත නම් පසුපසින් ගිය ශ්‍රමණයෙකු සමඟින් උත්තරක ගමට පිඬු සිඟා පිවිසියෙමි. ඒ අවස්ථාවේ කොරක්ඛත්තිය නම්, සිව් කුළුණක් මෙන් හිඳින, නිරුවත්, සුනඛ වෘත ඇත්තෙක් බිම විසිරී ඇති ආහාර කටින්ම කමින්, කටින්ම වළඳමින් සිටියේය. භග්ගව, ලීච්ඡවී පුත්‍ර සුනක්ඛත්ත බිම විසිරී ඇති ආහාර කටින්ම කමින්, කටින්ම වළඳමින් සිටි කොරක්ඛත්තිය නම්, සිව් කුළුණක් මෙන් හිඳින, නිරුවත්, සුනඛ වෘත ඇත්තා දුටුවේය. ඔහු දැක ඔහුට මෙසේ සිතුණි: “අහෝ, මේ සිව් කුළුණක් මෙන් හිඳින ශ්‍රමණයෙක් නම් ඉතා යහපත්ය! බිම විසිරී ඇති ආහාර කටින්ම කමින්, කටින්ම වළඳයි!” කියාය. එවිට භග්ගව, මම ලීච්ඡවී පුත්‍ර සුනක්ඛත්තගේ සිත්හි වූ සිතුවිලි සිතින් දැන, ලීච්ඡවී පුත්‍ර සුනක්ඛත්තට මෙසේ කීවෙමි: “නුඹත් නම්, හිස් පුරුෂය, ශාක්‍ය පුත්‍ර ශ්‍රමණයෙක් යැයි පිළිගන්නේද?!” කියාය. “භාග්‍යවතුන් වහන්ස, කුමක් නිසාද භාග්‍යවතුන් වහන්සේ මට මෙසේ වදාරන්නේ: ‘නුඹත් නම්, හිස් පුරුෂය, ශාක්‍ය පුත්‍ර ශ්‍රමණයෙක් යැයි පිළිගන්නේද?’ කියා?” “සුනක්ඛත්ත, නුඹට බිම විසිරී ඇති ආහාර කටින්ම කමින්, කටින්ම වළඳමින් සිටින මේ කොරක්ඛත්තිය නම්, සිව් කුළුණක් මෙන් හිඳින, නිරුවත්, සුනඛ වෘත ඇත්තා දැක මෙසේ සිතුණේ නැද්ද: ‘අහෝ, මේ සිව් කුළුණක් මෙන් හිඳින ශ්‍රමණයෙක් නම් ඉතා යහපත්ය! බිම විසිරී ඇති ආහාර කටින්ම කමින්, කටින්ම වළඳයි’ කියා?” “එසේය, භාග්‍යවතුන් වහන්ස. එහෙත් භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ රහත්බවට ඊර්ෂ්‍යා කරන්නේද?” “හිස් පුරුෂය, මම රහත්බවට ඊර්ෂ්‍යා නොකරමි. එහෙත්, නුඹට මේ පාපී දෘෂ්ටියක් හටගෙන තිබේ. එය අත්හරින්න. එය නුඹට බොහෝ කලක් අහිත පිණිසත්, දුක පිණිසත් නොපවතීවා. සුනක්ඛත්ත, නුඹ යම් මේ නිරුවත් කොරක්ඛත්තිය ගැන “මේ යහපත් ශ්‍රමණයෙකි” යැයි සිතන්නේද, ඔහු සත්වෙනි දින අලසක රෝගයෙන් මිය යනු ඇත. මිය ගොස්, ඉතාමත්ම පහත් අසුර කය වන කාලකඤ්චිකා නම් අසුරයන් අතර උපදිනු ඇත. මියගිය ඔහු බීරණ කණු සහිත සුසානයක දමනු ඇත. සුනක්ඛත්ත, නුඹට කැමති නම්, නිරුවත් කොරක්ඛත්තිය වෙත ගොස් මෙසේ විමසිය හැකිය: “ඇවැත් කොරක්ඛත්තිය, නුඹ නුඹගේ ගතිය දන්නෙහිද?” කියාය. සුනක්ඛත්ත, නිරුවත් කොරක්ඛත්තිය නුඹට මෙසේ පැහැදිලි කිරීමට ඉඩ ඇත: “ඇවැත් සුනක්ඛත්ත, මම මාගේ ගතිය දනිමි; ඉතාමත්ම පහත් අසුර කය වන කාලකඤ්චිකා නම් අසුරයන් අතර මම ඉපිද සිටිමි” කියාය.”\n\nඑවිට භග්ගව, ලීච්ඡවී පුත්‍ර සුනක්ඛත්ත කොරක්ඛත්තිය නම් නිරුවත් තවුසා වෙත ගියේය. එහි ගොස් කොරක්ඛත්තිය නම් නිරුවත් තවුසාට මෙසේ කීවේය: “ඇවැත් කොරක්ඛත්තිය, ශ්‍රමණ ගෞතමයන් වහන්සේ විසින් ඔබ ගැන මෙසේ ප්‍රකාශ කර ඇත: ‘නිරුවත් කොරක්ඛත්තිය සත්වෙනි දින අලසක රෝගයෙන් මිය යනු ඇත. මිය ගොස්, ඉතාමත්ම පහත් අසුර කය වන කාලකඤ්චිකා නම් අසුරයන් අතර උපදිනු ඇත. මියගිය ඔහු බීරණ කණු සහිත සුසානයක දමනු ඇත’ කියාය. එබැවින් ඇවැත් කොරක්ඛත්තිය, ඔබ තරමක් තරමක් වත් බත් අනුභව කරන්න, තරමක් තරමක් වත් පානය කරන්න. එසේ කළොත් ශ්‍රමණ ගෞතමයන් වහන්සේගේ වචනය වැරදි වනු ඇතැයි.”",
      "paliTitle": "Korakkhattiyavatthu",
      "englishTitle": "Story of Korakkhattiya",
      "sinhalaTitle": "කෝරක්ඛත්තිය වස්තුව"
    },
    {
      "number": 8,
      "pali": "‘‘Atha kho, bhaggava, sunakkhatto licchaviputto ekadvīhikāya sattarattindivāni gaṇesi, yathā taṃ tathāgatassa asaddahamāno. Atha kho, bhaggava, acelo korakkhattiyo sattamaṃ divasaṃ alasakena kālamakāsi. Kālaṅkato ca kālakañcikā nāma asurā sabbanihīno asurakāyo, tatra upapajji. Kālaṅkatañca naṃ bīraṇatthambake susāne chaḍḍesuṃ.",
      "english": "Then, Bhaggava, Sunakkhatta, the son of the Licchavis, counted seven days and nights, day by day, as one disbelieving the Tathāgata. Then, Bhaggava, the naked ascetic Korakkhattiya died on the seventh day from an intestinal obstruction. Having died, he was reborn among the Kālakañcikā asuras, the lowest class of asuras. And they abandoned his dead body in the Bīraṇatthambaka charnel ground.",
      "sinhala": "ඉන්පසු භග්ගව, ලිච්ඡවි පු‍ත්‍රයා තථාගතයන් වහන්සේ කෙරෙහි නොඇදහීමෙන්, දින එක දෙකක් ගත කරමින් සත් දිනක් ගණන් කළේය. ඉන්පසු භග්ගව, අචේල කෝරක්ඛත්තිය සත්වන දින අලසක රෝගයෙන් මිය ගියේය. මිය ගිය ඔහු, සියලු අසුර නිකායන්ගෙන් පහත්ම වූ කාලකඤ්චිකා නම් අසුරයන් අතර උපන්නේය. මිය ගිය ඔහුගේ සිරුර බීලෑ කණු සහිත සොහොනෙහි දමා ගියාහුය.",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘Assosi kho, bhaggava, sunakkhatto licchaviputto – ‘acelo kira korakkhattiyo alasakena kālaṅkato bīraṇatthambake susāne chaḍḍito’ti. Atha kho, bhaggava, sunakkhatto licchaviputto yena bīraṇatthambakaṃ susānaṃ, yena acelo korakkhattiyo tenupasaṅkami; upasaṅkamitvā acelaṃ korakkhattiyaṃ tikkhattuṃ pāṇinā ākoṭesi – ‘jānāsi, āvuso korakkhattiya, attano gati’nti? Atha kho, bhaggava, acelo korakkhattiyo pāṇinā piṭṭhiṃ paripuñchanto vuṭṭhāsi. ‘Jānāmi, āvuso sunakkhatta, attano gatiṃ. Kālakañcikā nāma asurā sabbanihīno asurakāyo, tatrāmhi upapanno’ti vatvā tattheva uttāno papati [paripati (syā. ka.)].",
      "english": "Indeed, Bhaggava, Sunakkhatta, the Licchavi's son, heard that the naked ascetic Korakkhattiya had died of a bowel obstruction and was discarded in the Bīraṇatthambaka charnel ground.\n\nThen, Bhaggava, Sunakkhatta, the Licchavi's son, approached the Bīraṇatthambaka charnel ground, where the naked ascetic Korakkhattiya was. Having approached, he struck the naked ascetic Korakkhattiya three times with his hand, saying, \"Do you know, friend Korakkhattiya, your destination?\"\n\nThen, Bhaggava, the naked ascetic Korakkhattiya, wiping his back with his hand, arose.\n\n\"I know, friend Sunakkhatta, my destination. I have been reborn among the Kālakañcika asuras, who are the lowest order of asuras,\" he said, and then fell back down right there, lying face up.",
      "sinhala": "භග්ගවයෙනි, ලිච්ඡවිපුත්‍ර සුනක්ඛත්ත තෙමේ මෙසේ ඇසූයේය: \"නිරුවත් කෝරක්ඛත්තිය අලසක රෝගයෙන් මියගොස් බීරණථම්භක සුසානයේ දමා ඇතැයි\". ඉක්බිති භග්ගවයෙනි, ලිච්ඡවිපුත්‍ර සුනක්ඛත්ත තෙමේ බීරණථම්භක සුසානය තිබූ තැනට, නිරුවත් කෝරක්ඛත්තිය සිටි තැනට පැමිණියේය. එහි පැමිණ, නිරුවත් කෝරක්ඛත්තියට තුන් වරක් අතින් තට්ටු කරමින්: \"ඇවැත් කෝරක්ඛත්තිය, නුඹගේ ගතිය දන්නෙහිද?\" යනුවෙන් විමසුවේය. ඉක්බිති භග්ගවයෙනි, නිරුවත් කෝරක්ඛත්තිය අතින් පිට පිරිමදිමින් නැගිට්ටේය. \"ඇවැත් සුනක්ඛත්ත, මාගේ ගතිය මම දනිමි. කාලකඤ්චික නම් අසුරයෝ සියලු අසුර කායයන්ගෙන් ඉතාමත්ම පහත් අසුර කායයෝ වෙති, මම එහි උපන්නෙමි\" යැයි පවසා, එතැනම උඩුබැලිව වැටුණේය.",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ korakkhattiyaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ, aññathā vā’ti? ‘Yatheva me, bhante, bhagavā acelaṃ korakkhattiyaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no aññathā’ti. ‘Taṃ kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ, akataṃ vāti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho maṃ tvaṃ, moghapurisa, uttarimanussadhammā iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotīti. Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti. ‘‘Evampi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko.",
      "english": "Then, Bhaggava, Sunakkhatta the Licchavi prince approached me; having approached me, he paid homage and sat down to one side. As he sat to one side, Bhaggava, I said to Sunakkhatta the Licchavi prince: 'What do you think, Sunakkhatta? Was the result exactly as I declared to you concerning the naked ascetic Korakkhattiya, or was it otherwise?' 'Just as the Blessed One, Venerable Sir, declared to me concerning the naked ascetic Korakkhattiya, so indeed was the result, not otherwise.' 'What do you think, Sunakkhatta? If this is so, was an extraordinary human phenomenon, a psychic power, accomplished or not accomplished?' 'Indeed, Venerable Sir, if this is so, an extraordinary human phenomenon, a psychic power, was accomplished, not not accomplished.' 'Yet, even though I, foolish man, was performing an extraordinary human phenomenon, a psychic power, you still said this: \"Indeed, Venerable Sir, the Blessed One does not perform an extraordinary human phenomenon, a psychic power.\" See, foolish man, how greatly you have erred in this!'\n\nThus, Bhaggava, even though he was spoken to by me in this manner, Sunakkhatta the Licchavi prince still departed from this Dhamma and Discipline, thereby destined for a woeful state, for hell.",
      "sinhala": "එවිට, භග්ගව, සුනක්ඛත්ත ලිච්ඡවිපුත්‍ර‍යා මා සිටි තැනට පැමිණියේය. පැමිණ මා වැඳ එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි සුනක්ඛත්ත ලිච්ඡවිපුත්‍ර‍යාට, භග්ගව, මම මෙසේ කීවෙමි: \"සුනක්ඛත්තය, ඔබ කුමක් සිතන්නේද? මා ඔබට අචේල කෝරක්ඛත්තිය පිළිබඳව විස්තර කළ ආකාරයටම එහි විපාකය එසේමද, නැතහොත් වෙනස්ද?\" \"ස්වාමීනි, භාග්‍ය‍වතුන් වහන්සේ මට අචේල කෝරක්ඛත්තිය පිළිබඳව විස්තර කළ ආකාරයටම එහි විපාකය එසේමය, වෙනස් නොවේ.\" \"සුනක්ඛත්තය, ඔබ කුමක් සිතන්නේද? එසේ නම්, මිනිසුන්ට උසස් වූ ඉර්ධිප්‍ර‍ාතිහාර්ය‍යක් කර තිබේද, නැතහොත් නොකර තිබේද?\" \"ස්වාමීනි, සැබැවින්ම, එසේ නම් මිනිසුන්ට උසස් වූ ඉර්ධිප්‍ර‍ාතිහාර්ය‍යක් කර තිබේ, නොකර නැත.\" \"එසේ වුවද, මෝඝ පුරුෂය, මිනිසුන්ට උසස් වූ ඉර්ධිප්‍ර‍ාතිහාර්ය‍යක් කරන මා පිළිබඳව ඔබ මෙසේ කියයි: 'ස්වාමීනි, භාග්‍ය‍වතුන් වහන්සේ මිනිසුන්ට උසස් වූ ඉර්ධිප්‍ර‍ාතිහාර්ය‍යක් නොකරති' යනුවෙනි. බලන්න, මෝඝ පුරුෂය, ඔබ කෙතරම් වරදක් කර ඇත්දැයි!\"\n\nඑසේ වුවද, භග්ගව, සුනක්ඛත්ත ලිච්ඡවිපුත්‍ර‍යා මා විසින් මෙසේ කියනු ලබන විට, ඔහු මේ ධර්ම‍ විනයෙන් ඉවත්ව ගියේය. එය අපායිකයෙකුට, නිරයගාමියෙකුට සුදුසු පරිදිය.",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "‘‘Ekamidāhaṃ, bhaggava, samayaṃ vesāliyaṃ viharāmi mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena acelo kaḷāramaṭṭako vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. Tassa sattavatapadāni [sattavattapadāni (syā. pī.)] samattāni samādinnāni honti – ‘yāvajīvaṃ acelako assaṃ, na vatthaṃ paridaheyyaṃ, yāvajīvaṃ brahmacārī assaṃ, na methunaṃ dhammaṃ paṭiseveyyaṃ, yāvajīvaṃ surāmaṃseneva yāpeyyaṃ, na odanakummāsaṃ bhuñjeyyaṃ. Puratthimena vesāliṃ udenaṃ nāma cetiyaṃ, taṃ nātikkameyyaṃ, dakkhiṇena vesāliṃ gotamakaṃ nāma cetiyaṃ, taṃ nātikkameyyaṃ, pacchimena vesāliṃ sattambaṃ nāma cetiyaṃ, taṃ nātikkameyyaṃ, uttarena vesāliṃ bahuputtaṃ nāma [bahuputtakaṃ nāma (syā.)] cetiyaṃ taṃ nātikkameyya’nti. So imesaṃ sattannaṃ vatapadānaṃ samādānahetu lābhaggappatto ceva yasaggappatto ca vajjigāme.",
      "english": "At one time, Bhagga, I was dwelling in Vesālī, in the Great Wood, in the peaked assembly hall. Now at that time, the naked ascetic Kaḷāramaṭṭaka was residing in Vesālī, having attained the highest gain and the highest fame among the Vajji people. He had completely undertaken these seven vows: 'For as long as I live, I shall be a naked ascetic; I shall wear no clothes. For as long as I live, I shall be a celibate practitioner; I shall not indulge in sexual activity. For as long as I live, I shall sustain myself only with liquor and meat; I shall not eat boiled rice or gruel. To the east of Vesālī, there is a shrine named Udēna; I shall not pass beyond it. To the south of Vesālī, there is a shrine named Gotamaka; I shall not pass beyond it. To the west of Vesālī, there is a shrine named Sattamba; I shall not pass beyond it. To the north of Vesālī, there is a shrine named Bahuputta; I shall not pass beyond it.' Because of undertaking these seven vows, he had attained the highest gain and the highest fame among the Vajji people.",
      "sinhala": "භග්ගවය, එක් සමයකදී මම වෙසාලියෙහි මහ වනයේ කූටාගාර ශාලාවේ වාසය කළෙමි. එකල නග්න තාපස කලාමාරමට්‍ටක නම් තෙමේ වෙසාලියෙහි වාසය කළේය. ඔහු වජ්ජි දනව්වෙහි ලාභයේ අග්‍රභාවයටත්, යසසෙහි අග්‍රභාවයටත් පැමිණ සිටියේය. ඔහු විසින් සත් ව්‍රත පද සම්පූර්ණයෙන් සමාදන් කරගෙන තිබුණි – ‘ජීවිතාන්තය තෙක් මම නග්නව සිටින්නෙමි, වස්ත්‍ර නොපළඳින්නෙමි. ජීවිතාන්තය තෙක් මම බඹසර රකිමි, මෛථුන ධර්මයෙහි නොයෙදෙන්නෙමි. ජීවිතාන්තය තෙක් මම සුරා මස්වලින්ම යැපෙන්නෙමි, බත් සහ කැඳ නොඅනුභව කරන්නෙමි. වෙසාලියට නැගෙනහිරින් උදේන නම් චේතියක් ඇත, එය නොපසුකරන්නෙමි. වෙසාලියට දකුණින් ගෝතමක නම් චේතියක් ඇත, එය නොපසුකරන්නෙමි. වෙසාලියට බටහිරින් සත්තම්බ නම් චේතියක් ඇත, එය නොපසුකරන්නෙමි. වෙසාලියට උතුරින් බහුපුත්ත නම් චේතියක් ඇත, එය නොපසුකරන්නෙෙමි.’ ඔහු මේ සත් ව්‍රත පද සමාදන් කරගැනීමේ හේතුවෙන් වජ්ජි දනව්වෙහි ලාභයේ අග්‍රභාවයටත්, යසසෙහි අග්‍රභාවයටත් පැමිණ සිටියේය.",
      "paliTitle": "Acelakaḷāramaṭṭakavatthu",
      "englishTitle": "Story of Crude Naked Ascetics",
      "sinhalaTitle": "කාළාර අචේලකයන්ගේ වස්‍තුව"
    },
    {
      "number": 12,
      "pali": "‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yena acelo kaḷāramaṭṭako tenupasaṅkami; upasaṅkamitvā acelaṃ kaḷāramaṭṭakaṃ pañhaṃ apucchi. Tassa acelo kaḷāramaṭṭako pañhaṃ puṭṭho na sampāyāsi. Asampāyanto kopañca dosañca appaccayañca pātvākāsi. Atha kho, bhaggava, sunakkhattassa licchaviputtassa etadahosi – ‘sādhurūpaṃ vata bho arahantaṃ samaṇaṃ āsādimhase [asādiyimhase (syā.)]. Mā vata no ahosi dīgharattaṃ ahitāya dukkhāyā’ti.",
      "english": "Then, Reverend Bhaggava, Sunakkhatta the Licchavi’s son approached the naked ascetic Kaḷāramaṭṭaka; having approached, he asked the naked ascetic Kaḷāramaṭṭaka a question. When asked the question, the naked ascetic Kaḷāramaṭṭaka could not answer it. Not being able to answer, he displayed anger, displeasure, and resentment. Then, Reverend Bhaggava, this thought occurred to Sunakkhatta the Licchavi’s son: ‘How excellent indeed! We have insulted an Arahant ascetic. May it not be for our harm and suffering for a long time!’",
      "sinhala": "භග්ගව, ඉන්පසු සුනක්ඛත්ත ලිච්ඡවි කුමරු, නිරුවත් කලාපමට්ඨක තපස්වියා වෙත එළඹියේය; එළඹ, ඔහු නිරුවත් කලාපමට්ඨක තපස්වියාගෙන් ප‍්‍රශ්නයක් විමසීය. ඔහුගෙන් ප‍්‍රශ්න අසනු ලැබූ කලාපමට්ඨක නිරුවත් තපස්වියාට ඊට පිළිතුරු දීමට නොහැකි විය. පිළිතුරු දීමට නොහැකිව, ඔහු කෝපය, ද්වේෂය සහ අප‍්‍රසාදය ප‍්‍රකට කළේය. භග්ගව, ඉන්පසු සුනක්ඛත්ත ලිච්ඡවි කුමරුට මේ සිතිවිල්ල ඇතිවිය – ‘අහෝ, අපි මේ භෝවරුන් අතර වූ අරහත් ශ‍්‍රමණයෙකුට (නොසුදුසු ලෙස) අපහාස කළෙමු. එය අපට බොහෝ කලක් අහිත පිණිසත් දුක පිණිසත් නොවේවා!’",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘tvampi nāma, moghapurisa, samaṇo sakyaputtiyo paṭijānissasī’ti! ‘Kiṃ pana maṃ, bhante, bhagavā evamāha – tvampi nāma, moghapurisa, samaṇo sakyaputtiyo paṭijānissasī’ti? ‘Nanu tvaṃ, sunakkhatta, acelaṃ kaḷāramaṭṭakaṃ upasaṅkamitvā pañhaṃ apucchi. Tassa te acelo kaḷāramaṭṭako pañhaṃ puṭṭho na sampāyāsi. Asampāyanto kopañca dosañca appaccayañca pātvākāsi. Tassa te etadahosi – ‘‘sādhurūpaṃ vata, bho, arahantaṃ samaṇaṃ āsādimhase. Mā vata no ahosi dīgharattaṃ ahitāya dukkhāyā’ti. ‘Evaṃ, bhante. Kiṃ pana, bhante, bhagavā arahattassa maccharāyatī’ti? ‘Na kho ahaṃ, moghapurisa, arahattassa maccharāyāmi, api ca tuyhevetaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ, taṃ pajaha. Mā te ahosi dīgharattaṃ ahitāya dukkhāya. Yaṃ kho panetaṃ, sunakkhatta, maññasi acelaṃ kaḷāramaṭṭakaṃ – sādhurūpo ayaṃ [arahaṃ (syā.)] samaṇoti, so nacirasseva parihito sānucāriko vicaranto odanakummāsaṃ bhuñjamāno sabbāneva vesāliyāni cetiyāni samatikkamitvā yasā nihīno [yasānikiṇṇo (ka.)] kālaṃ karissatī’ti. ‘‘‘Atha kho, bhaggava, acelo kaḷāramaṭṭako nacirasseva parihito sānucāriko vicaranto odanakummāsaṃ bhuñjamāno sabbāneva vesāliyāni cetiyāni samatikkamitvā yasā nihīno kālamakāsi.",
      "english": "Then, Bhaggava, Sunakkhatta the Licchavi prince approached me; having approached me, he paid homage and sat down to one side. As he sat to one side, Bhaggava, I said this to Sunakkhatta the Licchavi prince: \"You, foolish man, will also claim to be a recluse, a son of the Sakyan!\" \"But why, venerable sir, does the Blessed One say to me thus: 'You, foolish man, will also claim to be a recluse, a son of the Sakyan'?\" \"Did you not, Sunakkhatta, approach the naked ascetic Kaḷāramaṭṭaka and ask him a question? When that naked ascetic Kaḷāramaṭṭaka was questioned by you, he could not answer. Unable to answer, he displayed anger, ill-will, and displeasure. Then this thought occurred to you: 'Indeed, we have offended a worthy ascetic, an Arahant. May this not be for our long-term harm and suffering!'\" \"It is so, venerable sir. But, venerable sir, is the Blessed One jealous of Arahantship?\" \"I am not jealous of Arahantship, foolish man; rather, this evil view has arisen in you, so abandon it. May it not be for your long-term harm and suffering. And as for that naked ascetic Kaḷāramaṭṭaka, Sunakkhatta, whom you consider to be a worthy ascetic, he will, before long, having fallen from his standing, wandering with his followers, eating gruel and rice, passing all the shrines of Vesālī, die having become disrespected.\"\n\nThen, Bhaggava, before long, the naked ascetic Kaḷāramaṭṭaka, having fallen from his standing, wandering with his followers, eating gruel and rice, passing all the shrines of Vesālī, died having become disrespected.",
      "sinhala": "‘‘එවිට, භග්ගව, සුනක්ඛත්ත ලිච්ඡවි පුත්‍රයා මා සිටි තැනට පැමිණියේය; පැමිණ, මට ආචාර කර, එකත්පසෙක වාඩිවිය. එකත්පසෙක වාඩිවී සිටි සුනක්ඛත්ත ලිච්ඡවි පුත්‍රයාට, භග්ගව, මම මෙසේ කීවෙමි: ‘නුඹත්, මෝඝ පුරුෂය, ශාක්‍යපුත්‍ර ශ්‍රමණයෙකැයි ප්‍රකාශ කරන්නෙහිය!’ ‘භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ මට කුමක් නිසා මෙසේ කියන්නේද – නුඹත්, මෝඝ පුරුෂය, ශාක්‍යපුත්‍ර ශ්‍රමණයෙකැයි ප්‍රකාශ කරන්නෙහිය’ කියා? ‘සුනක්ඛත්තය, නුඹ කලාපරමට්ඨක නම් නිරුවත් තාපසයා වෙත ගොස් ප්‍රශ්නයක් ඇසුවේ නොවේද? නුඹ විසින් ප්‍රශ්න කරන ලද එම කලාපරමට්ඨක නිරුවත් තාපසයාට එයට පිළිතුරු දීමට නොහැකි විය. පිළිතුරු දීමට නොහැකි වූ හෙතෙම ක්‍රෝධය, දෝෂය සහ අප්‍රසාදය ප්‍රකාශ කළේය. එවිට නුඹට මෙසේ සිතුණේය – ‘‘අහෝ, අපි රහත් වූ යහපත් ශ්‍රමණයෙකුට අපහාස කළෙමු. අපට එය දීර්ඝ කාලයක් අහිත පිණිස දුක් පිණිස නොවේවා!” කියා. ‘එසේය, භාග්‍යවතුන් වහන්ස. එසේනම් භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ රහත් භාවයට ඊර්ෂ්‍යා කරන්නේද?’ කියා. ‘මෝඝ පුරුෂය, මම රහත් භාවයට ඊර්ෂ්‍යා නොකරමි. එහෙත් නුඹට මේ පාපී දෘෂ්ටියක් හටගෙන ඇත, එය අත්හරින්න. එය නුඹට දීර්ඝ කාලයක් අහිත පිණිස දුක් පිණිස නොවේවා. සුනක්ඛත්තය, නුඹ මේ කලාපරමට්ඨක නම් නිරුවත් තාපසයා – ‘මේ රහත් වූ යහපත් ශ්‍රමණයෙකි’ කියා සිතන්නේ, ඔහු වැඩි කලක් නොගොස්ම පිරිහී, අනුගාමිකයන්ද සමඟ හැසිරෙමින්, බත් කැඳ වළඳමින්, සියලුම වෛශාලි චෛත්‍යයන් පසුකර, යසසින් පිරිහී මියයන්නේය’ කියා.\n\n‘‘එවිට, භග්ගව, කලාපරමට්ඨක නිරුවත් තාපසයා වැඩි කලක් නොගොස්ම පිරිහී, අනුගාමිකයන්ද සමඟ හැසිරෙමින්, බත් කැඳ වළඳමින්, සියලුම වෛශාලි චෛත්‍යයන් පසුකර, යසසින් පිරිහී මිය ගියේය.",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "‘‘Assosi kho, bhaggava, sunakkhatto licchaviputto – ‘acelo kira kaḷāramaṭṭako parihito sānucāriko vicaranto odanakummāsaṃ bhuñjamāno sabbāneva vesāliyāni cetiyāni samatikkamitvā yasā nihīno kālaṅkato’ti. Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ kaḷāramaṭṭakaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ, aññathā vā’ti? ‘Yatheva me, bhante, bhagavā acelaṃ kaḷāramaṭṭakaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no aññathā’ti. ‘Taṃ kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ akataṃ vā’ti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho maṃ tvaṃ, moghapurisa, uttarimanussadhammā iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotī’’ti. Passa, moghapurisa, yāvañca te idaṃ aparaddha’nti. ‘‘Eva’mpi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko.",
      "english": "Sunakkhatta, the Licchavi's son, indeed heard, Bhaggava, 'It is said that the naked ascetic Kaḷāramaṭṭaka, having wandered about with his followers, eating a mixture of rice and gruel, and having surpassed all the shrines in Vesālī, had died, devoid of fame.' Then, Bhaggava, Sunakkhatta, the Licchavi's son, approached me; having approached and paid homage to me, he sat down to one side. As he was sitting to one side, Bhaggava, I spoke to Sunakkhatta, the Licchavi's son, saying: 'What do you think, Sunakkhatta, was the outcome exactly as I declared to you concerning the naked ascetic Kaḷāramaṭṭaka, or was it otherwise?' 'Bhante, the outcome was exactly as the Blessed One declared to me concerning the naked ascetic Kaḷāramaṭṭaka, it was not otherwise.' 'What do you think, Sunakkhatta, if this is so, has a superhuman feat of psychic power been accomplished or not accomplished?' 'Certainly, Bhante, if this is so, a superhuman feat of psychic power has been accomplished, not left unaccomplished.' 'Yet even so, foolish man, when I performed a superhuman feat of psychic power, you said thus: \"Indeed, Bhante, the Blessed One does not perform a superhuman feat of psychic power for me.\"' 'See, foolish man, how greatly you have erred!'\n\nEven though he was being spoken to by me in this way, Bhaggava, Sunakkhatta, the Licchavi's son, indeed fell away from this Dhamma and Discipline, just as one who is destined for a state of woe, for hell.",
      "sinhala": "භග්ගව, සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයාට ඇසුණි, 'කලාරමට්ඨක නම් නිරුවත් තවුසා පිරිහීමට පත්ව, අනුචරයන් සමඟ හැසිරෙමින්, බත් කුම්බුස් වළඳමින්, සියලුම වෛශාලි චෛත්‍යයන් අතික්‍රමණය කර, යසසින් පිරිහී, මිය ගියේය' කියාය. භග්ගව, එකල්හි සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයා මා වෙත එළඹියේය; එළඹ, මට ආචාර කොට, එකත්පස්ව වාඩි විය. භග්ගව, එකත්පස්ව වාඩි වී සිටි සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයාට මම මෙය කීවෙමි: 'සුනක්ඛත්ත, නුඹ කුමක් සිතන්නෙහිද? කලාරමට්ඨක නම් නිරුවත් තවුසා ගැන මා විසින් නුඹට දේශනා කළ පරිදිමද ඔහුගේ විපාකය වූයේ, එසේ නැතිනම් වෙනත් ආකාරයකටද?' 'ස්වාමීනී, භාග්‍යවතුන් වහන්සේ කලාරමට්ඨක නම් නිරුවත් තවුසා ගැන මා හට දේශනා කළ පරිදිම ඔහුගේ විපාකය විය; වෙනත් ආකාරයකට නොවේ' යි ඔහු කීවේය. 'සුනක්ඛත්ත, නුඹ කුමක් සිතන්නෙහිද? එසේ වූ විට, උත්තරීතර මනුෂ්‍ය ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් සිදු වූයේද, නැතිනම් නොවූයේද?' 'නියත වශයෙන්ම, ස්වාමීනී, එසේ වූ විට, උත්තරීතර මනුෂ්‍ය ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් සිදු විය; නොවූයේ නොවේ' යි ඔහු කීවේය. 'මෝඝපුරුෂය, මෙසේ මා උත්තරීතර මනුෂ්‍ය ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යය කරන විටත් නුඹ මෙසේ කියන්නෙහිද – 'ස්වාමීනී, භාග්‍යවතුන් වහන්සේ උත්තරීතර මනුෂ්‍ය ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් නොකරන සේකැයි' කියායි.' 'මෝඝපුරුෂය, නුඹට කොපමණ නම් වරදක් වී ඇත්දැයි බලනු!'\n\nභග්ගව, මෙසේ මා විසින් කියනු ලබන විටත්, සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයා මේ ධර්මවිනයෙන් බැහැර වී ගියේය; ඔහු අපායගාමී වූ, නිරයගාමී වූ පුද්ගලයෙකු මෙන් විය.",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "‘‘Ekamidāhaṃ, bhaggava, samayaṃ tattheva vesāliyaṃ viharāmi mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena acelo pāthikaputto [pāṭikaputto (sī. syā. pī.)] vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. So vesāliyaṃ parisati evaṃ vācaṃ bhāsati – ‘samaṇopi gotamo ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo gotamo upaḍḍhapathaṃ āgaccheyya, ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, cattārāhaṃ karissāmi. Cattāri ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’ti.",
      "english": "At one time, Blessed One, I was dwelling right there in Vesālī, in the Mahāvana, in the Gabled Hall. Now at that time, Acelo Pāthikaputta was residing in Vesālī, having attained the highest gain and highest fame in the Vajjī villages. He spoke thus in the assembly in Vesālī: ‘Even recluse Gotama is one who proclaims knowledge, and I too am one who proclaims knowledge. Indeed, one who proclaims knowledge is worthy to show a superhuman feat of psychic power to another who proclaims knowledge. Let recluse Gotama come halfway, and I too will go halfway. There, both of us will perform superhuman feats of psychic power. If recluse Gotama performs one superhuman feat of psychic power, I will perform two. If recluse Gotama performs two superhuman feats of psychic power, I will perform four. If recluse Gotama performs four superhuman feats of psychic power, I will perform eight. Thus, whatever number of superhuman feats of psychic power recluse Gotama performs, I will perform double that number.’",
      "sinhala": "භාග්‍යවතුන් වහන්ස, එක් කලක මම ඒ වෛශාලියේම මහා වනයේ කූටාගාර ශාලාවේ වැඩසිටියෙමි. ඒ දිනවල වජ්ජි ග්‍රාමයේ පාථිකපුත්ත නම් නිරුවත් තවුසාට ලාභයේ අග්‍රතම භාවයත්, යශසෙහි අග්‍රතම භාවයත් ලැබී වෛශාලියේ වාසය කරමින් සිටියේය. ඔහු වෛශාලියේ පිරිස් අමතා මෙසේ කීවේය – ‘ශ්‍රමණ ගෞතමයන් වහන්සේද ඥානවාදියෙකි, මමද ඥානවාදියෙක්මි. ඥානවාදියෙකු විසින් ඥානවාදියෙකුට උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යයක් පෙන්විය යුතුය. ශ්‍රමණ ගෞතමයන් වහන්සේ අඩ මගක් පැමිණිය යුතුය, මමද අඩ මගක් යා යුතුය. අපි දෙදෙනාම එහිදී උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යයක් කරමු. ශ්‍රමණ ගෞතමයන් වහන්සේ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ එක් ඉර්ධි ප්‍රාතිහාර්යයක් කරන්නේ නම්, මම දෙකක් කරන්නෙමි. ශ්‍රමණ ගෞතමයන් වහන්සේ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යයන් දෙකක් කරන්නේ නම්, මම හතරක් කරන්නෙමි. ශ්‍රමණ ගෞතමයන් වහන්සේ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යයන් හතරක් කරන්නේ නම්, මම අටක් කරන්නෙමි. මේ අයුරින් ශ්‍රමණ ගෞතමයන් වහන්සේ කොපමණ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යයක් කරන්නේද, ඊට දෙගුණයක් දෙගුණයක් මම කරන්නෙමි’යි.",
      "paliTitle": "Acelapāthikaputtavatthu",
      "englishTitle": "Story of Acelapāthika's Son",
      "sinhalaTitle": "අචේලපාථිකපුත්‍ර වස්තුව"
    },
    {
      "number": 16,
      "pali": "‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho, bhaggava, sunakkhatto licchaviputto maṃ etadavoca – ‘acelo, bhante, pāthikaputto vesāliyaṃ paṭivasati lābhaggappatto ceva yasaggappatto ca vajjigāme. So vesāliyaṃ parisati evaṃ vācaṃ bhāsati – samaṇopi gotamo ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo gotamo upaḍḍhapathaṃ āgaccheyya, ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, cattārāhaṃ karissāmi. Cattāri ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttari manussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’’ti. ‘‘Evaṃ vutte, ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘abhabbo kho, sunakkhatta, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti.",
      "english": "Then, Bhaggava, Sunakkhatta the Licchavi prince approached me; having approached me, he bowed to me and sat down to one side. Having sat down to one side, Bhaggava, Sunakkhatta the Licchavi prince said this to me: ‘Venerable sir, Acelo Pathikaputta lives in Vesali, having attained the highest gain and the highest fame in Vajjigāma. He speaks thus in the assembly in Vesali: ‘The recluse Gotama is one who proclaims knowledge, and I am also one who proclaims knowledge. Indeed, one who proclaims knowledge is fit to demonstrate a superhuman feat of psychic power to another who proclaims knowledge. Let the recluse Gotama come halfway, and I too will go halfway. There, both of us shall perform a superhuman feat of psychic power. If the recluse Gotama performs one superhuman feat of psychic power, I shall perform two. If the recluse Gotama performs two superhuman feats of psychic power, I shall perform four. If the recluse Gotama performs four superhuman feats of psychic power, I shall perform eight. Thus, however many superhuman feats of psychic power the recluse Gotama performs, I shall perform twice that number, twice that number.’\n\nWhen this was said, Bhaggava, I said to Sunakkhatta the Licchavi prince: ‘It is impossible, Sunakkhatta, for Acelo Pathikaputta to come into my presence without abandoning that speech, without abandoning that thought, and without relinquishing that view. Even if he were to think, ‘I shall go into the presence of the recluse Gotama without abandoning that speech, without abandoning that thought, and without relinquishing that view,’ his head would surely split into pieces.’",
      "sinhala": "එවිට භග්ගව, ලිච්ඡවි පුත්‍ර සුනක්ඛත්ත මා වෙත පැමිණියේය; පැමිණ මා වන්දනා කර එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි භග්ගව, ලිච්ඡවි පුත්‍ර සුනක්ඛත්ත මට මෙසේ කීවේය – ‘ස්වාමීනි, පාථික පුත්‍ර අචේල වෛශාලියේ වාසය කරයි. ඔහු වජ්ජි ග්‍රාමයේ ලාභ අග්‍රත්වයටත් යශස අග්‍රත්වයටත් පත් වී සිටියි. ඔහු වෛශාලියේ සභාවේ මෙවන් වචනයක් කියයි – ශ්‍රමණ ගෞතමද ඥානවාදීය, මමද ඥානවාදීය. ඥානවාදියකු ඥානවාදියකු සමඟ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යයක් පෙන්විය යුතුය. ශ්‍රමණ ගෞතම අඩ මගක් එන්නේය, මමද අඩ මගක් යන්නේය. එහිදී අප දෙදෙනාම උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යය කරන්නෙමු. ශ්‍රමණ ගෞතම එක් උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යයක් කරන්නේ නම්, මම දෙකක් කරන්නෙමි. ශ්‍රමණ ගෞතම උත්තරීතර මනුෂ්‍ය ධර්මයන් වූ ඉර්ධි ප්‍රාතිහාර්යයන් දෙකක් කරන්නේ නම්, මම හතරක් කරන්නෙමි. ශ්‍රමණ ගෞතම උත්තරීතර මනුෂ්‍ය ධර්මයන් වූ ඉර්ධි ප්‍රාතිහාර්යයන් හතරක් කරන්නේ නම්, මම අටක් කරන්නෙමි. මේ අයුරින් ශ්‍රමණ ගෞතම කොපමණ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යය කරන්නේද, ඊට දෙගුණයක් දෙගුණයක් මම කරන්නෙමි’යි.\n\n‘මෙසේ කී කල්හි, භග්ගව, මම ලිච්ඡවි පුත්‍ර සුනක්ඛත්තට මෙසේ කීවෙමි – ‘සුනක්ඛත්ත, පාථික පුත්‍ර අචේලට ඒ වචනය අත් නොහැර, ඒ සිත අත් නොහැර, ඒ දෘෂ්ටිය අත් නොහැර මා ඉදිරියට පැමිණීමට නොහැකිය. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම් – ‘මම ඒ වචනය අත් නොහැර, ඒ සිත අත් නොහැර, ඒ දෘෂ්ටිය අත් නොහැර ශ්‍රමණ ගෞතමයන් ඉදිරියට යන්නෙමි’යි, එවිට ඔහුගේ හිසද පැළී යනු ඇතැයි.’",
      "paliTitle": ""
    },
    {
      "number": 17,
      "pali": "‘Rakkhatetaṃ, bhante, bhagavā vācaṃ, rakkhatetaṃ sugato vāca’nti. ‘Kiṃ pana maṃ tvaṃ, sunakkhatta, evaṃ vadesi – rakkhatetaṃ, bhante, bhagavā vācaṃ, rakkhatetaṃ sugato vāca’nti? ‘Bhagavatā cassa, bhante, esā vācā ekaṃsena odhāritā [ovāditā (ka.)] – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Acelo ca, bhante, pāthikaputto virūparūpena bhagavato sammukhībhāvaṃ āgaccheyya, tadassa bhagavato musā’ti.",
      "english": "\"Venerable sir, may the Blessed One protect this statement! May the Fortunate One protect this statement!\" \"But Sunakkhatta, why do you speak to me thus: 'Venerable sir, may the Blessed One protect this statement! May the Fortunate One protect this statement!'?\" \"Venerable sir, it was unequivocally declared by the Blessed One that the naked ascetic Pāthikaputta is incapable of coming into my presence without abandoning that statement, without abandoning that intention, and without relinquishing that view. If he were to think, 'I will come into the presence of the recluse Gotama without abandoning that statement, without abandoning that intention, and without relinquishing that view,' then his head would surely split. But venerable sir, if the naked ascetic Pāthikaputta were to come into the Blessed One's presence, even in a grotesque form, then that statement of the Blessed One would be false.\"",
      "sinhala": "'භාග්‍ය​වතුන් වහන්ස, භාග්‍ය​වතුන් වහන්සේ ඒ වචනය රකින්න. සුගතයන් වහන්ස, සුගතයන් වහන්සේ ඒ වචනය රකින්න'යි. 'සුනක්ඛත්තය, එසේ නම් ඔබ මා හට 'භාග්‍ය​වතුන් වහන්ස, භාග්‍ය​වතුන් වහන්සේ ඒ වචනය රකින්න. සුගතයන් වහන්ස, සුගතයන් වහන්සේ ඒ වචනය රකින්න'යි කියා කුමක් නිසාද කියන්නේ?' 'වහන්ස, භාග්‍ය​වතුන් වහන්සේ විසින් 'නිරුවත් පාඨිකපුත්‍ර​යා ඒ වචනය අත්නොහැර, ඒ සිත අත්නොහැර, ඒ දෘෂ්ටිය අත්නොහැර මා ඉදිරියට පැමිණීමට නොහැකි වන්නේය' යන මේ වචනය නිසැකවම ප්‍ර​කාශ කරන ලදී. යම් හෙයකින් ඔහුට 'මම ඒ වචනය අත්නොහැර, ඒ සිත අත්නොහැර, ඒ දෘෂ්ටිය අත්නොහැර ශ්‍ර​මණ ගෞතමයන් වහන්සේ ඉදිරියට යන්නෙමි'යි සිතුණහොත්, ඔහුගේ හිස සත් කඩකට පැළී යන්නේය'යිද (ප්‍ර​කාශ කරන ලදී). නමුත් වහන්ස, නිරුවත් පාඨිකපුත්‍ර​යා විරූප ස්වරූපයෙන් භාග්‍ය​වතුන් වහන්සේ ඉදිරියට පැමිණියේය. එසේ නම් එය භාග්‍ය​වතුන් වහන්සේට අසත්‍යයක් වන්නේය'යි.'",
      "paliTitle": ""
    },
    {
      "number": 18,
      "pali": "‘Api nu, sunakkhatta, tathāgato taṃ vācaṃ bhāseyya yā sā vācā dvayagāminī’ti? ‘Kiṃ pana, bhante, bhagavatā acelo pāthikaputto cetasā ceto paricca vidito – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti? ‘Udāhu, devatā bhagavato etamatthaṃ ārocesuṃ – abhabbo, bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti?",
      "english": "\"Sunakkhatta, would the Tathāgata utter such a two-way speech?\" \"But venerable sir, did the Blessed One know, having encompassed with his mind the mind of Pāthikaputta the naked ascetic, that 'it is impossible for Pāthikaputta the naked ascetic to come into my presence without abandoning that speech, without abandoning that thought, and without giving up that view. If he were to think, \"I will go into the presence of the ascetic Gotama without abandoning that speech, without abandoning that thought, and without giving up that view,\" then his head would surely split asunder'?\" \"Or did deities report this matter to the Blessed One: 'Venerable sir, it is impossible for Pāthikaputta the naked ascetic to come into the Blessed One's presence without abandoning that speech, without abandoning that thought, and without giving up that view. If he were to think, \"I will go into the presence of the ascetic Gotama without abandoning that speech, without abandoning that thought, and without giving up that view,\" then his head would surely split asunder'?\"",
      "sinhala": "'සුනක්ඛත්තය, තථාගතයන් වහන්සේ දෙයාකාර වූ, එබඳු වචනයක් වදාළා ද?'\n\n'භාග්‍යවතුන් වහන්ස, අචේල පාථිකපුත්ත තෙමේ ඒ වචනයත්, ඒ සිතත්, ඒ දෘෂ්ටියත් අත්නොහැර මාගේ සමීපයට ඒමට නොහැකි බවත්, යම් හෙයකින් ඔහුට – ‘ඒ වචනයත්, ඒ සිතත්, ඒ දෘෂ්ටියත් අත්නොහැර මම ශ්‍රමණ ගෞතමයන්ගේ සමීපයට යන්නෙමි’ කියා සිතක් ඇති වූයේ නම්, ඔහුගේ හිස වුව ද පුපුරා යන්නේයැයි යන කාරණයත්, භාග්‍යවතුන් වහන්සේ සිතින් සිත දැන අවබෝධ කරගත් සේක් ද?'\n\n'එසේත් නැතිනම්, දෙවියන් විසින් භාග්‍යවතුන් වහන්සේට මේ කාරණය සැලකර සිටියා ද? – ‘භාග්‍යවතුන් වහන්ස, අචේල පාථිකපුත්ත තෙමේ ඒ වචනයත්, ඒ සිතත්, ඒ දෘෂ්ටියත් අත්නොහැර භාග්‍යවතුන් වහන්සේගේ සමීපයට ඒමට නොහැක්කේය. යම් හෙයකින් ඔහුට – ‘ඒ වචනයත්, ඒ සිතත්, ඒ දෘෂ්ටියත් අත්නොහැර මම ශ්‍රමණ ගෞතමයන්ගේ සමීපයට යන්නෙමි’ කියා සිතක් ඇති වූයේ නම්, ඔහුගේ හිස වුව ද පුපුරා යන්නේයැ’යි කියා.'",
      "paliTitle": ""
    },
    {
      "number": 19,
      "pali": "‘Cetasā ceto paricca vidito ceva me, sunakkhatta, acelo pāthikaputto abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti. ‘Devatāpi me etamatthaṃ ārocesuṃ – abhabbo, bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti. ‘Ajitopi nāma licchavīnaṃ senāpati adhunā kālaṅkato tāvatiṃsakāyaṃ upapanno. Sopi maṃ upasaṅkamitvā evamārocesi – alajjī, bhante, acelo pāthikaputto; musāvādī, bhante, acelo pāthikaputto. Mampi, bhante, acelo pāthikaputto byākāsi vajjigāme – ajito licchavīnaṃ senāpati mahānirayaṃ upapannoti. Na kho panāhaṃ, bhante, mahānirayaṃ upapanno; tāvatiṃsakāyamhi upapanno. Alajjī, bhante, acelo pāthikaputto; musāvādī, bhante, acelo pāthikaputto; abhabbo ca, bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti. ‘Iti kho, sunakkhatta, cetasā ceto paricca vidito ceva me acelo pāthikaputto abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Devatāpi me etamatthaṃ ārocesuṃ – abhabbo, bhante, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā bhagavato sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti. ‘So kho panāhaṃ, sunakkhatta, vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkamissāmi divāvihārāya. Yassadāni tvaṃ, sunakkhatta, icchasi, tassa ārocehī’ti.",
      "english": "Sunakkhatta, having encompassed his mind with my mind, it is known to me that the naked ascetic Pāthikaputta is incapable of coming into my presence without abandoning that speech, without abandoning that thought, and without relinquishing that view. If he were to think thus – ‘I will go into the presence of the recluse Gotama without abandoning that speech, without abandoning that thought, and without relinquishing that view,’ then his head would certainly split.\n\nEven devas reported this matter to me: ‘Venerable sir, the naked ascetic Pāthikaputta is incapable of coming into the presence of the Blessed One without abandoning that speech, without abandoning that thought, and without relinquishing that view. If he were to think thus – ‘I will go into the presence of the recluse Gotama without abandoning that speech, without abandoning that thought, and without relinquishing that view,’ then his head would certainly split.’\n\nAjita, the commander of the Licchavis, who has recently died, has been reborn in the Tāvatiṃsa realm. He also approached me and reported thus: ‘Venerable sir, the naked ascetic Pāthikaputta is shameless; venerable sir, the naked ascetic Pāthikaputta is a liar. Venerable sir, the naked ascetic Pāthikaputta also declared about me in Vajjigāma – ‘Ajita, the commander of the Licchavis, has been reborn in the great hell.’ But venerable sir, I have not been reborn in the great hell; I have been reborn in the Tāvatiṃsa realm. Venerable sir, the naked ascetic Pāthikaputta is shameless; venerable sir, the naked ascetic Pāthikaputta is a liar; and venerable sir, the naked ascetic Pāthikaputta is incapable of coming into the presence of the Blessed One without abandoning that speech, without abandoning that thought, and without relinquishing that view. If he were to think thus – ‘I will go into the presence of the recluse Gotama without abandoning that speech, without abandoning that thought, and without relinquishing that view,’ then his head would certainly split.’\n\nThus, Sunakkhatta, having encompassed his mind with my mind, it is known to me that the naked ascetic Pāthikaputta is incapable of coming into my presence without abandoning that speech, without abandoning that thought, and without relinquishing that view. If he were to think thus – ‘I will go into the presence of the recluse Gotama without abandoning that speech, without abandoning that thought, and without relinquishing that view,’ then his head would certainly split.\n\nEven devas reported this matter to me: ‘Venerable sir, the naked ascetic Pāthikaputta is incapable of coming into the presence of the Blessed One without abandoning that speech, without abandoning that thought, and without relinquishing that view. If he were to think thus – ‘I will go into the presence of the recluse Gotama without abandoning that speech, without abandoning that thought, and without relinquishing that view,’ then his head would certainly split.’\n\nTherefore, Sunakkhatta, after having gone for alms in Vesālī and after my meal, having put away my alms-bowl, I will approach the park of the naked ascetic Pāthikaputta for my day’s abiding. Now, Sunakkhatta, you may report it to whomever you wish.",
      "sinhala": "'සුනක්ඛත්තය, මම චිත්තයෙන් චිත්තය පිරිසිඳ දැන සිටිමි. නිරුවත් පාඨිකපුත්‍රයාට එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර මා හමුවට ඒමට නොහැකියි. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම් – 'මම එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර ශ්‍රමණ ගෞතමයන් වහන්සේ හමුවට යන්නෙමි' කියා, ඔහුගේ හිස පුපුරා යනු ඇත.\n\n'දෙවියෝ ද මට මේ අර්ථය දැන්වූහ – \"වහන්ස, නිරුවත් පාඨිකපුත්‍රයාට එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර භාග්‍යවතුන් වහන්සේ හමුවට ඒමට නොහැකියි. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම් – 'මම එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර ශ්‍රමණ ගෞතමයන් වහන්සේ හමුවට යන්නෙමි' කියා, ඔහුගේ හිස පුපුරා යනු ඇත.\"\n\n'ලිච්ඡවීන්ගේ අජිත නම් සේනාපති දැන් මිය ගොස් තව්තිසා දෙව්ලොව උපත ලබා සිටියි. ඔහු ද මා වෙත පැමිණ මෙසේ දැන්වීය – \"වහන්ස, නිරුවත් පාඨිකපුත්‍රයා නිර්ලජ්ජී ය; වහන්ස, නිරුවත් පාඨිකපුත්‍රයා බොරු කියන්නෙකි. වහන්ස, නිරුවත් පාඨිකපුත්‍රයා වජ්ජිග්‍රාමයේදී මටත් මෙසේ පැවසුවා – 'ලිච්ඡවීන්ගේ අජිත සේනාපති මහා නිරයට උපත ලැබුවා' කියා. නමුත්, වහන්ස, මම මහා නිරයට උපත ලැබුවේ නැහැ. මම තව්තිසා දෙව්ලොව උපත ලැබුවා. වහන්ස, නිරුවත් පාඨිකපුත්‍රයා නිර්ලජ්ජී ය; වහන්ස, නිරුවත් පාඨිකපුත්‍රයා බොරු කියන්නෙකි. වහන්ස, එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර භාග්‍යවතුන් වහන්සේ හමුවට ඒමට ද නිරුවත් පාඨිකපුත්‍රයාට නොහැකියි. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම් – 'මම එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර ශ්‍රමණ ගෞතමයන් වහන්සේ හමුවට යන්නෙමි' කියා, ඔහුගේ හිස පුපුරා යනු ඇත.\"\n\n'එසේනම්, සුනක්ඛත්තය, චිත්තයෙන් චිත්තය පිරිසිඳ දැන සිටි මාහට, නිරුවත් පාඨිකපුත්‍රයාට එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර මා හමුවට ඒමට නොහැකි බව වැටහී ඇත. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම් – 'මම එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර ශ්‍රමණ ගෞතමයන් වහන්සේ හමුවට යන්නෙමි' කියා, ඔහුගේ හිස පුපුරා යනු ඇත. දෙවියෝ ද මට මේ අර්ථය දැන්වූහ – \"වහන්ස, නිරුවත් පාඨිකපුත්‍රයාට එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර භාග්‍යවතුන් වහන්සේ හමුවට ඒමට නොහැකියි. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම් – 'මම එම වචනයත්, එම සිතත්, එම දෘෂ්ටියත් අත්නොහැර ශ්‍රමණ ගෞතමයන් වහන්සේ හමුවට යන්නෙමි' කියා, ඔහුගේ හිස පුපුරා යනු ඇත.\"\n\n'එසේනම්, සුනක්ඛත්තය, මම වෛශාලියේ පිණ්ඩපාතයෙහි හැසිර දානය වැළඳීමෙන් පසු, දවල් විවේක ගැනීම සඳහා නිරුවත් පාඨිකපුත්‍රයාගේ ආරාමය වෙත යන්නෙමි. දැන් සුනක්ඛත්තය, ඔබට යම් කෙනෙකුට දැන්වීමට අවශ්‍ය නම්, ඔහුට දන්වන්න.",
      "paliTitle": ""
    },
    {
      "number": 20,
      "pali": "‘‘Atha khvāhaṃ [atha kho svāhaṃ (syā.)], bhaggava, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya vesāliṃ piṇḍāya pāvisiṃ. Vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkamiṃ divāvihārāya. Atha kho, bhaggava, sunakkhatto licchaviputto taramānarūpo vesāliṃ pavisitvā yena abhiññātā abhiññātā licchavī tenupasaṅkami; upasaṅkamitvā abhiññāte abhiññāte licchavī etadavoca – ‘esāvuso, bhagavā vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkami divāvihārāya. Abhikkamathāyasmanto abhikkamathāyasmanto, sādhurūpānaṃ samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissatī’ti. Atha kho, bhaggava, abhiññātānaṃ abhiññātānaṃ licchavīnaṃ etadahosi – ‘sādhurūpānaṃ kira, bho, samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissati; handa vata, bho, gacchāmā’ti. Yena ca abhiññātā abhiññātā brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā [nānātitthiya (syā.)] samaṇabrāhmaṇā tenupasaṅkami. Upasaṅkamitvā abhiññāte abhiññāte nānātitthiye [nānātitthiya (syā.)] samaṇabrāhmaṇe etadavoca – ‘esāvuso, bhagavā vesāliyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātappaṭikkanto yena acelassa pāthikaputtassa ārāmo tenupasaṅkami divāvihārāya. Abhikkamathāyasmanto abhikkamathāyasmanto, sādhurūpānaṃ samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissatī’ti. Atha kho, bhaggava, abhiññātānaṃ abhiññātānaṃ nānātitthiyānaṃ samaṇabrāhmaṇānaṃ etadahosi – ‘sādhurūpānaṃ kira, bho, samaṇānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ bhavissati; handa vata, bho, gacchāmā’ti. ‘‘Atha kho, bhaggava, abhiññātā abhiññātā licchavī, abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā yena acelassa pāthikaputtassa ārāmo tenupasaṅkamiṃsu. Sā esā, bhaggava, parisā mahā hoti [parisā hoti (sī. syā. pī.)] anekasatā anekasahassā.",
      "english": "Then I, Bhaggava, having dressed in the morning and taken my bowl and robe, entered Vesālī for alms. Having wandered for alms in Vesālī, after the meal, having returned from my alms round, I approached the park of Pathikaputta, the naked ascetic, for my day’s abiding.\n\nThen, Bhaggava, Sunakkhatta, the Licchavī’s son, hurriedly entered Vesālī and approached the well-known, prominent Licchavīs. Having approached the well-known, prominent Licchavīs, he spoke to them thus: ‘Friends, the Blessed One, having wandered for alms in Vesālī, after the meal, having returned from his alms round, has approached the park of Pathikaputta, the naked ascetic, for his day’s abiding. Come, venerable sirs, come! The marvelous superhuman phenomena of a virtuous ascetic will manifest!’\n\nThen, Bhaggava, the well-known, prominent Licchavīs thought: ‘Indeed, sirs, the marvelous superhuman phenomena of a virtuous ascetic will manifest; come then, sirs, let us go!’\n\nHe also approached the well-known, prominent brahmin householders, leading lay householders, and ascetics and brahmins of various other sects. Having approached the well-known, prominent ascetics and brahmins of various other sects, he spoke to them thus: ‘Friends, the Blessed One, having wandered for alms in Vesālī, after the meal, having returned from his alms round, has approached the park of Pathikaputta, the naked ascetic, for his day’s abiding. Come, venerable sirs, come! The marvelous superhuman phenomena of a virtuous ascetic will manifest!’\n\nThen, Bhaggava, the well-known, prominent ascetics and brahmins of various other sects thought: ‘Indeed, sirs, the marvelous superhuman phenomena of a virtuous ascetic will manifest; come then, sirs, let us go!’\n\nThen, Bhaggava, the well-known, prominent Licchavīs, and the well-known, prominent brahmin householders, leading lay householders, and ascetics and brahmins of various other sects, all approached the park of Pathikaputta, the naked ascetic. That assembly, Bhaggava, was large, consisting of many hundreds, many thousands.",
      "sinhala": "එවිට, භග්ගව, මම පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු ගෙන, වෛශාලියට පිඬු සිඟා පිවිසියෙමි. වෛශාලියේ පිඬු සිඟා වදාරා, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, දවල් විවේක ගැනීම සඳහා පාථිකපුත්ත නම් නිරුවත් තවුසාගේ ආරාමය වෙත පැමිණියෙමි. එවිට, භග්ගව, සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයා ඉක්මන් ස්වභාවයකින් යුතුව වෛශාලියට පිවිස, ප්‍රසිද්ධ ප්‍රසිද්ධ ලිච්ඡවීන් වෙත එළඹ, එළඹ, ප්‍රසිද්ධ ප්‍රසිද්ධ ලිච්ඡවීන්ට මෙය කීවේය – ‘මිත්‍රවරුනි, භාග්‍ය​වතුන් වහන්සේ වෛශාලියේ පිඬු සිඟා වදාරා, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, දවල් විවේකය සඳහා පාථිකපුත්ත නම් නිරුවත් තවුසාගේ ආරාමය වෙත පැමිණ සිටී. එළඹෙව් ආයුෂ්මතුනි, එළඹෙව් ආයුෂ්මතුනි, යහපත් වූ ශ්‍ර​මණවරුන්ගේ උත්තරීතර මනුෂ්‍ය ධර්මයන්ගේ ඍද්ධි ප්‍රාතිහාර්යයක් ඇති වනු ඇතැයි’. එවිට, භග්ගව, ප්‍රසිද්ධ ප්‍රසිද්ධ ලිච්ඡවීන්ට මෙසේ සිතුණි – ‘මිත්‍රවරුනි, සැබවින්ම යහපත් වූ ශ්‍ර​මණවරුන්ගේ උත්තරීතර මනුෂ්‍ය ධර්මයන්ගේ ඍද්ධි ප්‍රාතිහාර්යයක් ඇති වනු ඇත; එසේ නම්, මිත්‍රවරුනි, අපි යමු’යි. ඔහු (සුනක්ඛත්ත ලිච්ඡවිපුත්‍රයා) ප්‍රසිද්ධ ප්‍රසිද්ධ වූ බ්‍රාහ්මණ මහාශාලාවන්, ධනවත් ගෘහපතියන් සහ නානාතිත්ථික ශ්‍ර​මණ බ්‍රාහ්මණයන් සිටින තැනට එළඹියේය. එළඹ, ප්‍රසිද්ධ ප්‍රසිද්ධ වූ නානාතිත්ථික ශ්‍ර​මණ බ්‍රාහ්මණයන්ට මෙය කීවේය – ‘මිත්‍රවරුනි, භාග්‍ය​වතුන් වහන්සේ වෛශාලියේ පිඬු සිඟා වදාරා, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් ආපසු වැඩමවා, දවල් විවේකය සඳහා පාථිකපුත්ත නම් නිරුවත් තවුසාගේ ආරාමය වෙත පැමිණ සිටී. එළඹෙව් ආයුෂ්මතුනි, එළඹෙව් ආයුෂ්මතුනි, යහපත් වූ ශ්‍ර​මණවරුන්ගේ උත්තරීතර මනුෂ්‍ය ධර්මයන්ගේ ඍද්ධි ප්‍රාතිහාර්යයක් ඇති වනු ඇතැයි’. එවිට, භග්ගව, ප්‍රසිද්ධ ප්‍රසිද්ධ වූ නානාතිත්ථික ශ්‍ර​මණ බ්‍රාහ්මණයන්ට මෙසේ සිතුණි – ‘මිත්‍රවරුනි, සැබවින්ම යහපත් වූ ශ්‍ර​මණවරුන්ගේ උත්තරීතර මනුෂ්‍ය ධර්මයන්ගේ ඍද්ධි ප්‍රාතිහාර්යයක් ඇති වනු ඇත; එසේ නම්, මිත්‍රවරුනි, අපි යමු’යි. එවිට, භග්ගව, ප්‍රසිද්ධ ප්‍රසිද්ධ වූ ලිච්ඡවීහු, ප්‍රසිද්ධ ප්‍රසිද්ධ වූ බ්‍රාහ්මණ මහාශාලාවෝ, ධනවත් ගෘහපතියෝ සහ නානාතිත්ථික ශ්‍ර​මණ බ්‍රාහ්මණවරු පාථිකපුත්ත නම් නිරුවත් තවුසාගේ ආරාමය වෙත පැමිණියහ. භග්ගව, ඒ සභාව සිය ගණන් දහස් ගණන් වූ විශාල පිරිසකින් සමන්විත විය.",
      "paliTitle": "Iddhipāṭihāriyakathā",
      "englishTitle": "Discourse on Miraculous Powers",
      "sinhalaTitle": "ඉර‍්ධි ප‍්‍රාතිහාර්‍ය කතාව"
    },
    {
      "number": 21,
      "pali": "‘‘Assosi kho, bhaggava, acelo pāthikaputto – ‘abhikkantā kira abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo mayhaṃ ārāme divāvihāraṃ nisinno’ti. Sutvānassa bhayaṃ chambhitattaṃ lomahaṃso udapādi. Atha kho, bhaggava, acelo pāthikaputto bhīto saṃviggo lomahaṭṭhajāto yena tindukakhāṇuparibbājakārāmo tenupasaṅkami. ‘‘Assosi kho, bhaggava, sā parisā – ‘acelo kira pāthikaputto bhīto saṃviggo lomahaṭṭhajāto yena tindukakhāṇuparibbājakārāmo tenupasaṅkanto’ti [tenupasaṅkamanto (sī. pī. ka.)]. Atha kho, bhaggava, sā parisā aññataraṃ purisaṃ āmantesi – ‘Ehi tvaṃ, bho purisa, yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkama. Upasaṅkamitvā acelaṃ pāthikaputtaṃ evaṃ vadehi – abhikkamāvuso, pāthikaputta, abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā, samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno; bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā samaṇopi gotamo ñāṇavādo, ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ. Samaṇo gotamo upaḍḍhapathaṃ āgaccheyya ahampi upaḍḍhapathaṃ gaccheyyaṃ. Te tattha ubhopi uttarimanussadhammā iddhipāṭihāriyaṃ kareyyāma. Ekaṃ ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, dvāhaṃ karissāmi. Dve ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, cattārāhaṃ karissāmi. Cattāri ce samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyāni karissati, aṭṭhāhaṃ karissāmi. Iti yāvatakaṃ yāvatakaṃ samaṇo gotamo uttarimanussadhammā iddhipāṭihāriyaṃ karissati, taddiguṇaṃ taddiguṇāhaṃ karissāmī’ti abhikkamasseva [abhikkamayeva (sī. syā. pī.)] kho; āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno’ti.",
      "english": "Indeed, Bhaggava, Pathikaputta the naked ascetic heard, \"Distinguished and well-known Licchavis have come, and distinguished and well-known eminent brahmins, householders, and ascetics and brahmins of various sects have come. Even the ascetic Gotama is staying for the day in my park.\"\n\nHaving heard this, fear, agitation, and horripilation arose in him. Then, Bhaggava, Pathikaputta the naked ascetic, fearful, agitated, and with hair standing on end, approached the wandering ascetics' park at Tindukakhāṇa.\n\nIndeed, Bhaggava, that assembly heard, \"Pathikaputta the naked ascetic, fearful, agitated, and with hair standing on end, has approached the wandering ascetics' park at Tindukakhāṇa.\"\n\nThen, Bhaggava, that assembly addressed a certain man, \"Come, good man, go to the wandering ascetics' park at Tindukakhāṇa, to Pathikaputta the naked ascetic. Having approached him, say this to Pathikaputta the naked ascetic: 'Come, friend Pathikaputta, distinguished and well-known Licchavis have come, and distinguished and well-known eminent brahmins, householders, and ascetics and brahmins of various sects have come. Even the ascetic Gotama is staying for the day in your park. Furthermore, friend Pathikaputta, this statement was made by you in the assembly in Vesālī: \"The ascetic Gotama is a proponent of knowledge, and I too am a proponent of knowledge. Indeed, a proponent of knowledge ought to demonstrate a superhuman feat of psychic power to another proponent of knowledge. Let the ascetic Gotama come halfway, and I too will go halfway. There, both of us will perform a superhuman feat of psychic power. If the ascetic Gotama performs one superhuman feat of psychic power, I will perform two. If the ascetic Gotama performs two superhuman feats of psychic power, I will perform four. If the ascetic Gotama performs four superhuman feats of psychic power, I will perform eight. Thus, whatever number of superhuman feats of psychic power the ascetic Gotama performs, I will perform twice that number, twice that number.\" Indeed, friend Pathikaputta, come halfway. The ascetic Gotama has arrived first and is staying for the day in your park.'\"",
      "sinhala": "භග්ගව, පාථිකපුත්ත නම් නිරුවත් තවුසා ඇසුවේය: ‘ප්‍රකට, ඉතා ප්‍රකට වූ ලිච්ඡවීන් පැමිණ සිටිති. ප්‍රකට, ඉතා ප්‍රකට වූ මහසල් බමුණන්, ගහපති නෙචයිකවරුන්, නානාවිධ තීර්ථක ශ්‍රමණයන් හා බ්‍රාහ්මණයන් පැමිණ සිටිති. ශ්‍රමණ ගෞතමයන්ද මගේ ආරාමයේ දවල් විවේකයෙන් වැඩ සිටිති’ කියාය. එය අසා ඔහුට භයක්, තැතිගැනීමක්, ලොමුදැහැගැනීමක් ඇති විය. ඉන්පසු භග්ගව, පාථිකපුත්ත නම් නිරුවත් තවුසා බියට පත්, සංවේගයට පත්, ලොමුදැහැගත් ස්වභාවයෙන් තින්දුකඛාණ නම් පිරිවැජි ආරාමය දෙසට ගියේය. භග්ගව, ඒ පිරිස ඇසූහ: ‘පාථිකපුත්ත නම් නිරුවත් තවුසා බියට පත්, සංවේගයට පත්, ලොමුදැහැගත් ස්වභාවයෙන් තින්දුකඛාණ නම් පිරිවැජි ආරාමය දෙසට එයි’ කියාය. ඉන්පසු භග්ගව, ඒ පිරිස එක්තරා පුරුෂයෙකු අමතා කීහ: ‘එම්බා පුරුෂය, නුඹ තින්දුකඛාණ නම් පිරිවැජි ආරාමය වෙතට යව. පාථිකපුත්ත නම් නිරුවත් තවුසා සිටින තැනට ගොස් ඔහු වෙතට එළඹෙව. එළඹී පාථිකපුත්ත නම් නිරුවත් තවුසාට මෙසේ කියව: ‘ඇවැත් පාථිකපුත්ත, එන්න! ප්‍රකට, ඉතා ප්‍රකට වූ ලිච්ඡවීහු පැමිණ සිටිති. ප්‍රකට, ඉතා ප්‍රකට වූ මහසල් බමුණෝ, ගහපති නෙචයිකවරු, නානාවිධ තීර්ථක ශ්‍රමණ බ්‍රාහ්මණයෝ පැමිණ සිටිති. ශ්‍රමණ ගෞතමයන් වහන්සේද ඔබවහන්සේගේ ආරාමයේ දවල් විවේකයෙන් වැඩ සිටිති. ඇවැත් පාථිකපුත්ත, ඔබ විසින් වෛශාලියේ පිරිසක් මැද මේ වචනය කියන ලද්දේය: ‘ශ්‍රමණ ගෞතමයන් වහන්සේද ඥානවාදියෙකි, මමද ඥානවාදියෙක්මි. ඥානවාදියෙක් නම් ඥානවාදියෙකු සමඟ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඍද්ධි ප්‍රාතිහාර්යයක් දැක්වීමට සුදුසුය.’ ශ්‍රමණ ගෞතමයන් වහන්සේ අඩ මගක් පැමිණිය යුතුය. මමද අඩ මගක් යා යුතුය. එහිදී අපි දෙදෙනාම උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඍද්ධි ප්‍රාතිහාර්යයක් කරමු. ශ්‍රමණ ගෞතමයන් වහන්සේ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ එක් ඍද්ධි ප්‍රාතිහාර්යයක් කරන්නේ නම්, මම දෙකක් කරන්නෙමි. ශ්‍රමණ ගෞතමයන් වහන්සේ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඍද්ධි ප්‍රාතිහාර්යයන් දෙකක් කරන්නේ නම්, මම හතරක් කරන්නෙමි. ශ්‍රමණ ගෞතමයන් වහන්සේ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඍද්ධි ප්‍රාතිහාර්යයන් හතරක් කරන්නේ නම්, මම අටක් කරන්නෙමි. මේ අයුරින් ශ්‍රමණ ගෞතමයන් වහන්සේ කොපමණ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඍද්ධි ප්‍රාතිහාර්යයන් කරන්නේද, ඊට දෙගුණයක් දෙගුණයක් මම කරන්නෙමි’යි. ඇවැත් පාථිකපුත්ත, අඩ මගක්වත් පැමිණෙන්න. ශ්‍රමණ ගෞතමයන් වහන්සේ නම් සියල්ලටම පෙර පැමිණ ඔබවහන්සේගේ ආරාමයේ දවල් විවේකයෙන් වැඩ සිටිති’ කියාය.",
      "paliTitle": ""
    },
    {
      "number": 22,
      "pali": "‘‘Evaṃ, bhoti kho, bhaggava, so puriso tassā parisāya paṭissutvā yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo; ahampi ñāṇavādo. Ñāṇavādo kho pana ñāṇavādena arahati uttarimanussadhammā iddhipāṭihāriyaṃ dassetuṃ…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva kho, āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno’ti. ‘‘Evaṃ vutte, bhaggava, acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati [saṃsabbati (ka.)], na sakkoti āsanāpi vuṭṭhātuṃ. Atha kho so, bhaggava, puriso acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti. Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ.",
      "english": "Thus, indeed, Bhaggava, that man, having assented to that assembly, approached the Tindukakhaṇa wanderers' park, to where the naked ascetic Pathikaputta was. Having approached, he said to the naked ascetic Pathikaputta: “Come forth, friend Pathikaputta! The prominent and renowned Licchavis have arrived, as have the prominent and renowned great brahman householders, wealthy householders, and ascetics and brahmans of various sects. Even the ascetic Gotama is present, taking his day’s rest in your park. But this statement, friend Pathikaputta, was made by you in the assembly in Vesālī: ‘Even the ascetic Gotama is a proponent of knowledge; I too am a proponent of knowledge. A proponent of knowledge, however, deserves to demonstrate a superhuman feat of psychic power to another proponent of knowledge. If the ascetic Gotama performs one psychic feat, I will perform double that. If the ascetic Gotama performs two psychic feats, I will perform double that. If the ascetic Gotama performs three psychic feats, I will perform double that, I will perform double that.’ So come forth, friend Pathikaputta, even a short distance. The ascetic Gotama has arrived first and is sitting in your park for his day’s rest.”\n\nWhen this was said, Bhaggava, the naked ascetic Pathikaputta, saying “I am coming, friend, I am coming, friend,” just slumped there and was unable to get up from his seat. Then, Bhaggava, that man said to the naked ascetic Pathikaputta: “What is it, friend Pathikaputta? Have your legs stuck to the seat, or has the seat stuck to your legs? You say, ‘I am coming, friend, I am coming, friend,’ but you slump right there and cannot get up from your seat!” Even when he was spoken to in this way, Bhaggava, the naked ascetic Pathikaputta, saying “I am coming, friend, I am coming, friend,” just slumped there and was unable to get up from his seat.",
      "sinhala": "භග්ගව, එසේය, ඒ පුරුෂයා ඒ පිරිසට පොරොන්දු වී තින්දුක-කාණ පරිබ්‍රාජකාරාමය දෙසට, අචේල පාථිකපුත්ත සිටින තැනට පැමිණියේය. පැමිණ, අචේල පාථිකපුත්තට මෙසේ කීවේය: ‘ඇවැත් පාථිකපුත්ත, එන්න! ප්‍රසිද්ධ, ප්‍රකට ලිච්ඡවීන් පැමිණ සිටිති. ප්‍රසිද්ධ, ප්‍රකට මහාශාල බ්‍රාහ්මණයෝ ද, ගෘහපති සිටුවරු ද, නානාවිධ තීර්ථක ශ්‍රමණබ්‍රාහ්මණයෝ ද පැමිණ සිටිති. ශ්‍රමණ ගෞතමයන් වහන්සේ ද ඔබගේ ආරාමයේ දවල් විවේකයෙන් වැඩ සිටිති. ඇවැත් පාථිකපුත්ත, වෛශාලියේ ඒ පිරිස ඉදිරියේ ඔබ මේ වචනය පැවසුවා නොවේ ද: \"ශ්‍රමණ ගෞතමයන් වහන්සේ ද ඥාණවාදී ය; මා ද ඥාණවාදී ය. ඥාණවාදියෙකුට ඥාණවාදියෙකු සමඟ උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඉර්ධි ප්‍රාතිහාර්යයක් දැක්වීමට සුදුසු ය... ඒ ද්විගුණ කොට මම ද ද්විගුණ කොට පෙන්වමි\" කියා. ඇවැත් පාථිකපුත්ත, අඩ මාවතක් පමණ (එනම් කෙටි දුරක්) වත් එන්න. ශ්‍රමණ ගෞතමයන් වහන්සේ සියල්ලට පෙර පැමිණ ඔබගේ ආරාමයේ දවල් විවේකයෙන් වැඩ සිටිති.’\n\nභග්ගව, මෙසේ කී කල්හි, අචේල පාථිකපුත්ත ‘ඇවැත්නි, මම එමි, ඇවැත්නි, මම එමි’ යැයි කියා එතනම ගාටා යන්නේය, ආසනයෙන් ද නැගිටීමට නොහැකි විය. භග්ගව, එවිට ඒ පුරුෂයා අචේල පාථිකපුත්තට මෙසේ කීවේය: ‘ඇවැත් පාථිකපුත්ත, කුමක්ද, ඔබගේ කකුල් පුටුවට ඇලී තිබේද, එසේත් නැත්නම් පුටුව ඔබගේ කකුල්වලට ඇලී තිබේද? \"ඇවැත්නි, මම එමි, ඇවැත්නි, මම එමි\" යැයි කියා එතනම ගාටා යන්නේ ඔබ ආසනයෙන් ද නැගිටීමට නොහැකි වේ.’ භග්ගව, මෙසේ කියනු ලැබුවත්, අචේල පාථිකපුත්ත ‘ඇවැත්නි, මම එමි, ඇවැත්නි, මම එමි’ යැයි කියා එතනම ගාටා යන්නේය, ආසනයෙන් ද නැගිටීමට නොහැකි විය.",
      "paliTitle": ""
    },
    {
      "number": 23,
      "pali": "‘‘Yadā kho so, bhaggava, puriso aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto. Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho [parābhūtarūpo bho ayaṃ (syā. ka.), parābhūtarūpo (sī. pī.)], acelo pāthikaputto. Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Evaṃ vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ‘ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyya’nti, muddhāpi tassa vipateyyāti. Paṭhamabhāṇavāro niṭṭhito.",
      "english": "When, Bhaggava, that person knew: \"This naked ascetic Pāthikaputta is utterly defeated. Saying, ‘I am coming, friends, I am coming, friends,’ he just shuffles in that very place and cannot even rise from his seat.\" Then, having come to that assembly, he reported thus: \"Friends, this naked ascetic Pāthikaputta is utterly defeated. Saying, ‘I am coming, friends, I am coming, friends,’ he just shuffles in that very place and cannot even rise from his seat.\" When this was said, I, Bhaggava, addressed that assembly thus: \"Friends, it is impossible for the naked ascetic Pāthikaputta, without abandoning that speech, without abandoning that thought, without relinquishing that view, to come into my presence. Even if he were to think thus: ‘Without abandoning that speech, without abandoning that thought, without relinquishing that view, I will come into the presence of the recluse Gotama,’ his head would surely split asunder.\"",
      "sinhala": "භග්ගවයෙනි, යම් කලෙක ඒ පුරුෂයා ‘මේ පාථිකපුත්ත නම් නිරුවත් තෙමේ පරාජය වූවෙකි. ‘මිත්‍‍්‍රය, එමි, මිත්‍‍්‍රය, එමි’ යැයි කියා එතැනම දඟලයි, අසුනෙන් නැඟී සිටීමට පවා නොහැකියි’ කියා දැනගත්තේද, එවිට හෙතෙම ඒ පිරිස වෙත පැමිණ මෙසේ දැන්වීය: ‘ඇවැත්නි, මේ පාථිකපුත්ත නම් නිරුවත් තෙමේ පරාජය වූවෙකි. ‘මිත්‍‍්‍රය, එමි, මිත්‍‍්‍රය, එමි’ යැයි කියා එතැනම දඟලයි, අසුනෙන් නැඟී සිටීමට පවා නොහැකියි’ යනුවෙනි. භග්ගවයෙනි, මෙසේ කී කල්හි මම ඒ පිරිසට මෙය කීමි: ‘ඇවැත්නි, ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය නොදුරලා මේ නිරුවත් පාථිකපුත්ත තෙමේ මා ඉදිරියට ඒමට නුසුදුස්සෙකි. ‘මම ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය නොදුරලා ශ‍්‍රමණ ගෞතමයන්ගේ ඉදිරියට යන්නෙමි’ යැයි ඔහුට එසේ සිතතොත්, ඔහුගේ හිස පවා පැළී යන්නේය.’\n\nපළමු භාණවාරය නිම විය.",
      "paliTitle": ""
    },
    {
      "number": 24,
      "pali": "‘‘Atha kho, bhaggava, aññataro licchavimahāmatto uṭṭhāyāsanā taṃ parisaṃ etadavoca – ‘tena hi, bho, muhuttaṃ tāva āgametha, yāvāhaṃ gacchāmi [paccāgacchāmi (?)]. Appeva nāma ahampi sakkuṇeyyaṃ acelaṃ pāthikaputtaṃ imaṃ parisaṃ ānetu’nti. ‘‘Atha kho so, bhaggava, licchavimahāmatto yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantaṃ te seyyo, abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva kho, āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho panesā, āvuso pāthikaputta, samaṇena gotamena parisati vācā – abhabbo kho acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyāti. Abhikkamāvuso pāthikaputta, abhikkamaneneva te jayaṃ karissāma, samaṇassa gotamassa parājaya’nti. ‘‘Evaṃ vutte, bhaggava, acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ. Atha kho so, bhaggava, licchavimahāmatto acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti. Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ.",
      "english": "Then, Bhaggava, a certain Licchavi great minister rose from his seat and said to that assembly: ‘Well then, sirs, wait a moment until I go. Perhaps I too might be able to bring the naked ascetic Pāthikaputta to this assembly.’ Then, Bhaggava, that Licchavi great minister approached the Tindukakhāṇa wanderers’ park, where the naked ascetic Pāthikaputta was. Having approached, he said to the naked ascetic Pāthikaputta: ‘Come, friend Pāthikaputta, it would be good for you to come. Well-known and distinguished Licchavis have arrived, as have well-known and distinguished great and wealthy brahmins, householders, and recluses and brahmins of various sects. Even the recluse Gotama is sitting in your park for his day-rest. Furthermore, friend Pāthikaputta, this statement was made by you in the assembly in Vesālī: \"Even the recluse Gotama is a proponent of knowledge and a questioner of righteous matters, and I would make him doubly so defeated.\" Just come, friend Pāthikaputta, even halfway. The recluse Gotama arrived first of all and is sitting in your park for his day-rest. And furthermore, friend Pāthikaputta, this statement was made by the recluse Gotama in the assembly: \"The naked ascetic Pāthikaputta is incapable of coming into my presence without abandoning that statement, without abandoning that thought, and without relinquishing that view. Even if he were to think: 'I will go into the presence of the recluse Gotama without abandoning that statement, without abandoning that thought, and without relinquishing that view,' his head would split into pieces.\" Come, friend Pāthikaputta, by your very coming we shall achieve victory and the recluse Gotama's defeat.’\n\nWhen this was said, Bhaggava, the naked ascetic Pāthikaputta, saying ‘I am coming, friend, I am coming, friend,’ merely shuffled there and was unable to rise from his seat. Then, Bhaggava, that Licchavi great minister said to the naked ascetic Pāthikaputta: ‘What is it, friend Pāthikaputta? Have your thighs stuck to the seat, or has the seat stuck to your thighs? Saying ‘I am coming, friend, I am coming, friend,’ you merely shuffle there and are unable to rise from your seat.’ Even when this was said, Bhaggava, the naked ascetic Pāthikaputta, saying ‘I am coming, friend, I am coming, friend,’ merely shuffled there and was unable to rise from his seat.",
      "sinhala": "එවිට භාග්‍යව, එක්තරා ලිච්ඡවී මහාමාත්‍යවරයෙක් ආසනයෙන් නැඟිට ඒ පිරිසට මෙය කීවේය: ‘එසේ නම්, භවත්නි, මම ගොස් එනතුරු මොහොතක් රැඳී සිටිනු මැනවි. සමහර විට මටද අචේල පාථිකපුත්ත මේ පිරිස වෙත කැඳවාගෙන ඒමට හැකි වනු ඇතැයි.’\n\nඑවිට භාග්‍යව, ඒ ලිච්ඡවී මහාමාත්‍යවරයා තින්දුකඛාණ පරිබ්‍රාජකාරාමය වෙතත්, අචේල පාථිකපුත්ත සිටි තැනටත් පැමිණියේය. පැමිණ, අචේල පාථිකපුත්තට මෙය කීවේය: ‘එනු මැන ආයුෂ්මත් පාථිකපුත්ත, ඔබ පැමිණීම යහපත්ය. බොහෝ ප්‍රකට ලිච්ඡවීන් පැමිණ සිටිති. බොහෝ ප්‍රකට බ්‍රාහ්මණ මහාසාලවරු, ගෘහපති සිටුවරු, නානාවිධ තීර්ථකයෝ, ශ්‍රමණ බ්‍රාහ්මණයෝ ද පැමිණ සිටිති. ශ්‍රමණ ගෞතමයන් වහන්සේද ඔබගේ ආරාමයේ දවල් විවේකයෙන් වැඩ සිටිති. ආයුෂ්මත් පාථිකපුත්ත, ඔබ විසින් වෛශාලියේ ඒ පිරිස අතර මේ වචනය කියා ඇත: ‘ශ්‍රමණ ගෞතමයන් වහන්සේද ඥානවාදියෙකි... ඒ වචනය මම ඒ අයුරින්ම, දෙගුණ තෙගුණ කොට කරන්නෙමි’ යනුවෙන්. ආයුෂ්මත් පාථිකපුත්ත, අර්ධ මාර්ගය දක්වාම එනු මැන. සියල්ලටම පෙර ශ්‍රමණ ගෞතමයන් වහන්සේ පැමිණ ඔබගේ ආරාමයේ දවල් විවේකයෙන් වැඩ සිටිති. ආයුෂ්මත් පාථිකපුත්ත, ශ්‍රමණ ගෞතමයන් වහන්සේ විසින්ද ඒ පිරිස අතර මේ වචනය කියා ඇත: ‘අචේල පාථිකපුත්ත ඒ වචනය අත්නොහැර, ඒ සිත අත්නොහැර, ඒ දෘෂ්ටිය අත්නොහැර මා හමුවට ඒමට අපොහොසත්ය. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම්: ‘මම ඒ වචනය අත්නොහැර, ඒ සිත අත්නොහැර, ඒ දෘෂ්ටිය අත්නොහැර ශ්‍රමණ ගෞතමයන් වහන්සේ හමුවට යන්නෙමි’ කියා, ඔහුගේ හිසද පැලී යන්නේය.’ එනු මැන ආයුෂ්මත් පාථිකපුත්ත, පැමිණීමෙන්ම අපි ඔබට ජයදෙන්නෙමු, ශ්‍රමණ ගෞතමයන් වහන්සේට පරාජය හිමිවනු ඇතැයි.’\n\nමෙසේ කියනු ලැබූ කල්හි, භාග්‍යව, අචේල පාථිකපුත්ත ‘එමි ආයුෂ්මත්, එමි ආයුෂ්මත්’ යැයි පවසා එතැනම බඩගායි, ආසනයෙන් නැඟිටීමටද නොහැකි විය. එවිට භාග්‍යව, ඒ ලිච්ඡවී මහාමාත්‍යවරයා අචේල පාථිකපුත්තට මෙය කීවේය: ‘ආයුෂ්මත් පාථිකපුත්ත, කුමක්ද ඔබට සිදුවී ඇත්තේ? ඔබේ දණහිස් පුටුවට ඇලී ඇත්ද, නැතිනම් පුටුව ඔබේ දණහිස් වලට ඇලී ඇත්ද? ‘එමි ආයුෂ්මත්, එමි ආයුෂ්මත්’ යැයි පවසා එතැනම බඩගායි, ආසනයෙන් නැඟිටීමටද නොහැකි විය.’ මෙසේද කියනු ලැබූ කල්හි භාග්‍යව, අචේල පාථිකපුත්ත ‘එමි ආයුෂ්මත්, එමි ආයුෂ්මත්’ යැයි පවසා එතැනම බඩගායි, ආසනයෙන් නැඟිටීමටද නොහැකි විය.",
      "paliTitle": ""
    },
    {
      "number": 25,
      "pali": "‘‘Yadā kho so, bhaggava, licchavimahāmatto aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho [parābhūtarūpo (sī. pī.), parābhūtarūpo ayaṃ (syā.)], acelo pāthikaputto āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti. Evaṃ vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sace pāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi [yāhi varattāhi (syā. ka.)] bandhitvā goyugehi āviñcheyyāmāti [āviñjeyyāmāti (syā.), āvijjheyyāmāti (sī. pī.)], tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti.",
      "english": "When that great Licchavi minister, O Bhaggava, realized – ‘This naked ascetic Pāthikaputta is utterly defeated; saying “I am coming, friend! I am coming, friend!” he is just wriggling there and cannot even rise from his seat’ – he then came to that assembly and reported thus: ‘Friends, this naked ascetic Pāthikaputta is utterly defeated; saying “I am coming, friend! I am coming, friend!” he is just wriggling there and cannot even rise from his seat.’ When this was said, I, O Bhaggava, spoke thus to that assembly: ‘Indeed, friends, it is impossible for the naked ascetic Pāthikaputta, without abandoning that statement, without abandoning that intention, and without relinquishing that view, to come into my presence. Even if he were to think thus – “Without abandoning that statement, without abandoning that intention, and without relinquishing that view, I shall go into the presence of the recluse Gotama” – his head would indeed split apart. Even if the venerable Licchavis were to think thus – “We shall bind the naked ascetic Pāthikaputta with straps and drag him with yoked oxen” – those straps would break, or Pāthikaputta himself. But it is impossible for the naked ascetic Pāthikaputta, without abandoning that statement, without abandoning that intention, and without relinquishing that view, to come into my presence. Even if he were to think thus – “Without abandoning that statement, without abandoning that intention, and without relinquishing that view, I shall go into the presence of the recluse Gotama” – his head would indeed split apart.’",
      "sinhala": "භග්ගවය, යම් කලෙක ඒ ලිච්ඡවී මහාමාත්‍යයා ‘මේ පාථිකපුත්ත නම් නග්න ශ්‍රමණයා පරාජය වී ඇත. ‘අවසර, මම එමි, අවසර, මම එමි’ යැයි කියා එතනම බඩගායි. ආසනයෙන් නැගිටින්නටවත් නොහැකියි’ කියා දැනගත්තේය. එවිට ඔහු ඒ පිරිස වෙත පැමිණ මෙසේ දැන්වීය: ‘පින්වතුනි, පාථිකපුත්ත නම් මේ නග්න ශ්‍රමණයා පරාජය වී ඇත. ‘අවසර, මම එමි, අවසර, මම එමි’ යැයි කියා එතනම බඩගායි. ආසනයෙන් නැගිටින්නටවත් නොහැකියි.’ භග්ගවය, මෙසේ පැවසූ කල්හි, මම ඒ පිරිසට මෙය කීවෙමි: ‘ඇවැත්නි, පාථිකපුත්ත නම් නග්න ශ්‍රමණයාට ඒ වචනය අත්නොහැර, ඒ සිත අත්නොහැර, ඒ දෘෂ්ටිය අත්නොහැර මා ඉදිරියට පැමිණෙන්නට නොහැකියි. යම් හෙයකින් ඔහුට ‘මම ඒ වචනය අත්නොහැර, ඒ සිත අත්නොහැර, ඒ දෘෂ්ටිය අත්නොහැර ශ්‍රමණ ගෞතමයන්ගේ ඉදිරියට යන්නෙමි’ කියා සිතේ නම්, ඔහුගේ හිස පවා දෙකඩ වන්නේය. යම් හෙයකින් පින්වත් ලිච්ඡවීන්ට ‘අපි පාථිකපුත්ත නම් නග්න ශ්‍රමණයා ලණු වලින් බැඳ ගොන් යුවලකින් අදින්නෙමු’ කියා සිතේ නම්, ඒ ලණු කැඩී යන්නේය, නැතහොත් පාථිකපුත්ත කැඩී යන්නේය. එහෙත් පාථිකපුත්ත නම් නග්න ශ්‍රමණයාට ඒ වචනය අත්නොහැර, ඒ සිත අත්නොහැර, ඒ දෘෂ්ටිය අත්නොහැර මා ඉදිරියට පැමිණෙන්නට නොහැකියි. යම් හෙයකින් ඔහුට ‘මම ඒ වචනය අත්නොහැර, ඒ සිත අත්නොහැර, ඒ දෘෂ්ටිය අත්නොහැර ශ්‍රමණ ගෞතමයන්ගේ ඉදිරියට යන්නෙමි’ කියා සිතේ නම්, ඔහුගේ හිස පවා දෙකඩ වන්නේය.’",
      "paliTitle": ""
    },
    {
      "number": 26,
      "pali": "‘‘Atha kho, bhaggava, jāliyo dārupattikantevāsī uṭṭhāyāsanā taṃ parisaṃ etadavoca – ‘tena hi, bho, muhuttaṃ tāva āgametha, yāvāhaṃ gacchāmi; appeva nāma ahampi sakkuṇeyyaṃ acelaṃ pāthikaputtaṃ imaṃ parisaṃ ānetu’’nti. ‘‘Atha kho, bhaggava, jāliyo dārupattikantevāsī yena tindukakhāṇuparibbājakārāmo, yena acelo pāthikaputto tenupasaṅkami. Upasaṅkamitvā acelaṃ pāthikaputtaṃ etadavoca – ‘abhikkamāvuso pāthikaputta, abhikkantaṃ te seyyo. Abhikkantā abhiññātā abhiññātā licchavī, abhikkantā abhiññātā abhiññātā ca brāhmaṇamahāsālā gahapatinecayikā nānātitthiyā samaṇabrāhmaṇā. Samaṇopi gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho pana te esā, āvuso pāthikaputta, vesāliyaṃ parisati vācā – samaṇopi gotamo ñāṇavādo…pe… taddiguṇaṃ taddiguṇāhaṃ karissāmīti. Abhikkamasseva, kho āvuso pāthikaputta, upaḍḍhapathaṃ. Sabbapaṭhamaṃyeva āgantvā samaṇo gotamo āyasmato ārāme divāvihāraṃ nisinno. Bhāsitā kho panesā, āvuso pāthikaputta, samaṇena gotamena parisati vācā – abhabbo acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sace pāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi bandhitvā goyugehi āviñcheyyāmāti. Tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ āgaccheyyanti, muddhāpi tassa vipateyyāti. Abhikkamāvuso pāthikaputta, abhikkamaneneva te jayaṃ karissāma, samaṇassa gotamassa parājaya’nti. ‘‘Evaṃ vutte, bhaggava, acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvuso’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātuṃ. Atha kho, bhaggava, jāliyo dārupattikantevāsī acelaṃ pāthikaputtaṃ etadavoca – ‘kiṃ su nāma te, āvuso pāthikaputta, pāvaḷā su nāma te pīṭhakasmiṃ allīnā, pīṭhakaṃ su nāma te pāvaḷāsu allīnaṃ? Āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappasi, na sakkosi āsanāpi vuṭṭhātu’nti. Evampi kho, bhaggava, vuccamāno acelo pāthikaputto ‘‘āyāmi āvuso, āyāmi āvuso’’ti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātunti.",
      "english": "Then, Bhaggava, Jāliya, the disciple of Dārupattika, rising from his seat, said this to that assembly: ‘Well then, sirs, wait a moment while I go; perhaps I too might be able to bring the naked Pāthikaputta to this assembly.’\n\nThen, Bhaggava, Jāliya, the disciple of Dārupattika, approached the wanderers’ park of Tindukakhāṇa, where the naked Pāthikaputta was. Having approached, he said to the naked Pāthikaputta: ‘Come forth, friend Pāthikaputta, it is better for you to come forth. The well-known, famous Licchavis have arrived, and well-known, famous great wealthy brahmins, householders, and recluses and brahmins of various sects have arrived. Even the recluse Gotama is staying in your park for his midday rest. And this statement was indeed made by you, friend Pāthikaputta, in the assembly in Vesālī, saying: \"Even the recluse Gotama is a proponent of knowledge, and whatever he does, I will double that, I will double that.\" So just come forth, friend Pāthikaputta, half way. The recluse Gotama, having come first of all, is staying in your park for his midday rest. And this statement, friend Pāthikaputta, was indeed made by the recluse Gotama in the assembly: \"The naked Pāthikaputta is unable to come into my presence without abandoning that statement, without abandoning that thought, without relinquishing that view. If it were to occur to him, ‘I would go into the presence of the recluse Gotama without abandoning that statement, without abandoning that thought, without relinquishing that view,’ then his head would split into pieces.\" \"If it were to occur to the venerable Licchavis, ‘We will bind the naked Pāthikaputta with straps and drag him with a yoke of oxen,’ then those straps would break, or Pāthikaputta would break.\" Indeed, the naked Pāthikaputta is unable to come into my presence without abandoning that statement, without abandoning that thought, without relinquishing that view. If it were to occur to him, ‘I would go into the presence of the recluse Gotama without abandoning that statement, without abandoning that thought, without relinquishing that view,’ then his head would split into pieces.\" ‘Come forth, friend Pāthikaputta, by your coming forth we shall achieve victory, and the recluse Gotama will be defeated!’\n\nWhen this was said, Bhaggava, the naked Pāthikaputta, saying, ‘I’m coming, friend, I’m coming, friend,’ just crawled there, unable even to rise from his seat.\n\nThen, Bhaggava, Jāliya, the disciple of Dārupattika, said to the naked Pāthikaputta: ‘What is it, friend Pāthikaputta, have your testicles perhaps stuck to the seat, or has the seat perhaps stuck to your testicles? You say, \"I’m coming, friend, I’m coming, friend,\" yet you just crawl there, unable to rise from your seat!’ Even when this was said, Bhaggava, the naked Pāthikaputta, saying, ‘I’m coming, friend, I’m coming, friend,’ just crawled there, unable even to rise from his seat.",
      "sinhala": "එවිට භග්ගව, දාරුපත්තිකගේ අන්තේවාසී ජාලිය අසුනෙන් නැගිට, ඒ පිරිසට මෙසේ කීවේය: ‘එසේ නම්, භවත්නි, මා යන තෙක් මොහොතක් රැඳී සිටිනු මැනවි; සමහරවිට මටද නිරුවත් පාඨිකපුත්‍රව මේ පිරිස වෙත කැඳවාගෙන ඒමට හැකිවේවි.’\n\nඑවිට භග්ගව, දාරුපත්තිකගේ අන්තේවාසී ජාලිය තිඳුකඛාණ පරිබ්‍රාජකාරාමය වෙතත්, නිරුවත් පාඨිකපුත්‍ර සිටි තැනටත් පැමිණියේය. පැමිණ, නිරුවත් පාඨිකපුත්‍රට මෙසේ කීවේය: ‘එන්න, ආයුෂ්මත් පාඨිකපුත්‍ර, ඔබ පැමිණීම යහපත්ය. ප්‍ර‍කට, ප්‍ර‍කට ලිච්ඡවීහු පැමිණ සිටිති. ප්‍ර‍කට, ප්‍ර‍කට බ්‍රාහ්මණ මහසල්වරු, ගෘහපති නෙචයිකයෝ, විවිධ තීර්ථකයෝ, ශ්‍ර‍මණ බ්‍රාහ්මණයෝද පැමිණ සිටිති. ශ්‍ර‍මණ ගෞතමයන් වහන්සේද ආයුෂ්මතුන්ගේ ආරාමයේ දවල් විවේකයෙන් වැඩසිටිති. භවත් පාඨිකපුත්‍ර, වෛශාලියේ පිරිසක් මැද ඔබ විසින් මේ වදන ප්‍ර‍කාශ කරනු ලැබීය: ‘ශ්‍ර‍මණ ගෞතමයන් වහන්සේ ඥානවන්තයෙක් වෙති... ඒ දෙගුණයක් මම කරන්නෙමි’ කියා. භවත් පාඨිකපුත්‍ර, අර්ධ මාර්ගය හෝ පැමිණෙන්න. සියල්ලන්ටම පළමුව පැමිණ, ශ්‍ර‍මණ ගෞතමයන් වහන්සේ ආයුෂ්මතුන්ගේ ආරාමයේ දවල් විවේකයෙන් වැඩසිටිති. භවත් පාඨිකපුත්‍ර, ශ්‍ර‍මණ ගෞතමයන් වහන්සේ විසින්ද පිරිසක් මැද මේ වදන ප්‍ර‍කාශ කරනු ලැබීය: ‘නිරුවත් පාඨිකපුත්‍රට ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත් නොහැර, මා ඉදිරියට ඒමට නොහැකිය. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම්: ‘මම ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත් නොහැර, ශ්‍ර‍මණ ගෞතමයන් වහන්සේගේ ඉදිරියට යන්නෙමි’ කියා, ඔහුගේ හිස සත් කඩකට පැළී යනු ඇත. යම් හෙයකින් ආයුෂ්මත් ලිච්ඡවීන්ට මෙසේ සිතෙන්නේ නම්: ‘අපි නිරුවත් පාඨිකපුත්‍රව වරපටින් බැඳ ගොන් යුවළකින් ඇදගෙන යන්නෙමු’ කියා, ඒ වරපට කැඩී යනු ඇත, නැතහොත් පාඨිකපුත්‍ර වැනසී යනු ඇත. නමුත් නිරුවත් පාඨිකපුත්‍රට ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත් නොහැර, මා ඉදිරියට ඒමට නොහැකිය. යම් හෙයකින් ඔහුට මෙසේ සිතෙන්නේ නම්: ‘මම ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත් නොහැර, ශ්‍ර‍මණ ගෞතමයන් වහන්සේගේ ඉදිරියට යන්නෙමි’ කියා, ඔහුගේ හිස සත් කඩකට පැළී යනු ඇත.’ එන්න, ආයුෂ්මත් පාඨිකපුත්‍ර, ඔබගේ පැමිණීමෙන්ම අපි ජය ලබන්නෙමු, ශ්‍ර‍මණ ගෞතමයන් වහන්සේගේ පරාජය වේවා!’ කියා.\n\nමෙසේ කී කල්හි, භග්ගව, නිරුවත් පාඨිකපුත්‍ර ‘මම එමි ආයුෂ්මත්නි, මම එමි ආයුෂ්මත්නි’ යැයි කියා, එතනම බඩගායි (ගමන් කිරීමට උත්සාහ කරයි), අසුනෙන් නැගිටීමටවත් නොහැක. එවිට භග්ගව, දාරුපත්තිකගේ අන්තේවාසී ජාලිය නිරුවත් පාඨිකපුත්‍රට මෙසේ කීවේය: ‘මොකක්ද ආයුෂ්මත් පාඨිකපුත්‍ර, ඔබගේ පාද පුටුවට ඇලී තිබේද, නැතිනම් පුටුව ඔබගේ පාදවලට ඇලී තිබේද? ‘මම එමි ආයුෂ්මත්නි, මම එමි ආයුෂ්මත්නි’ යැයි කියා, එතනම බඩගාන්නෙහිය, අසුනෙන් නැගිටීමටවත් නොහැක’ කියා. මෙසේ භග්ගව, කියන ලද නමුත්, නිරුවත් පාඨිකපුත්‍ර ‘මම එමි ආයුෂ්මත්නි, මම එමි ආයුෂ්මත්නි’ යැයි කියා, එතනම බඩගායි (ගමන් කිරීමට උත්සාහ කරයි), අසුනෙන් නැගිටීමටවත් නොහැක.",
      "paliTitle": ""
    },
    {
      "number": 27,
      "pali": "‘‘Yadā kho, bhaggava, jāliyo dārupattikantevāsī aññāsi – ‘parābhūtarūpo ayaṃ acelo pāthikaputto ‘āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti, atha naṃ etadavoca – ‘Bhūtapubbaṃ, āvuso pāthikaputta, sīhassa migarañño etadahosi – yaṃnūnāhaṃ aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappeyyaṃ. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhameyyaṃ, āsayā nikkhamitvā vijambheyyaṃ, vijambhitvā samantā catuddisā anuvilokeyyaṃ, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadeyyaṃ, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkameyyaṃ. So varaṃ varaṃ migasaṃghe [migasaṃghaṃ (syā. ka.)] vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupeyya’nti. ‘Atha kho, āvuso, so sīho migarājā aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappesi. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhami, āsayā nikkhamitvā vijambhi, vijambhitvā samantā catuddisā anuvilokesi, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadi, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkāmi. So varaṃ varaṃ migasaṅghe vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupesi.",
      "english": "When indeed, Bhaggava, Jāliya, the disciple of Dārupattika, understood, \"This naked ascetic Pathikaputta is utterly defeated; having said 'I am coming, friend, I am coming, friend,' he merely squirms right there and cannot even get up from his seat,\" then he said this to him: \"Formerly, friend Pathikaputta, it occurred to a lion, the king of beasts: 'What if I were to make a lair in a certain forest thicket? Having made a lair there, in the evening, I would emerge from the lair. Having emerged from the lair, I would stretch. Having stretched, I would look around in all four directions. Having looked around in all four directions, I would roar the lion's roar three times. Having roared the lion's roar three times, I would go out for prey. Having repeatedly struck down the best of the deer herds and eaten the tenderest flesh, I would return to that very lair.' Then indeed, friend, that lion, the king of beasts, made a lair in a certain forest thicket. Having made a lair there, in the evening, he emerged from the lair. Having emerged from the lair, he stretched. Having stretched, he looked around in all four directions. Having looked around in all four directions, he roared the lion's roar three times. Having roared the lion's roar three times, he went out for prey. He repeatedly struck down the best of the deer herds and, having eaten the tenderest flesh, he returned to that very lair.\"",
      "sinhala": "භග්ගව, දාරුපත්තිකයෙකුගේ ශිෂ්‍ය​යෙකු වූ ජාලිය දිටීය: ‘මේ නග්න පාථිකපුත්ත පරාජය වී ඇත. ‘එමි මිත්‍රය, එමි මිත්‍රය’ යැයි පවසමින් ඔහු එතැනම බඩගා යයි, අසුනෙන් නැගිටින්නටවත් නොහැක’යි. එවිට ඔහු ඔහුට මෙසේ කීවේය:\n\n‘මිත්‍ර පාථිකපුත්ත, පෙර කලක මෘගරාජ සිංහයාට මෙසේ සිතුණි: ‘කෙසේ හෝ මම එක්තරා වනසණ්ඩයක් ඇසුරු කරගෙන වාසස්ථා​නයක් කල්පනා කරමි. එහි වාසස්ථා​නයක් කල්පනා කොට, සවස් කාලයේදී වාසස්ථා​නයෙන් පිටතට යමි. වාසස්ථා​නයෙන් පිටතට ගොස් විහිදෙමි. විහිද තෙම සිව් දිසාවටම විමසා බලමි. සිව් දිසාවටම විමසා බලා තුන් වරක් සිංහනාද කරමි. තුන් වරක් සිංහනාද කොට ගොදුරු පිණිස යමි. ඔහු වරින් වර මෘග සමූහයා මරා, මෘදු මාංස අනුභව කොට නැවතත් එම වාසස්ථා​නයටම පිවිසෙමි’යි.\n\nමිත්‍රය, එවිට ඒ මෘගරාජ සිංහයා එක්තරා වනසණ්ඩයක් ඇසුරු කොට වාසස්ථා​නයක් කල්පනා කෙළේය. එහි වාසස්ථා​නයක් කල්පනා කොට, සවස් කාලයේදී වාසස්ථා​නයෙන් පිටතට ගියේය. වාසස්ථා​නයෙන් පිටතට ගොස් විහිදෙන්නට විය. විහිද තෙම සිව් දිසාවටම විමසා බැලීය. සිව් දිසාවටම විමසා බලා තුන් වරක් සිංහනාද කෙළේය. තුන් වරක් සිංහනාද කොට ගොදුරු පිණිස ගියේය. ඔහු වරින් වර මෘග සමූහයා මරා, මෘදු මාංස අනුභව කොට නැවතත් එම වාසස්ථා​නයටම පිවිසියේය.",
      "paliTitle": ""
    },
    {
      "number": 28,
      "pali": "‘Tasseva kho, āvuso pāthikaputta, sīhassa migarañño vighāsasaṃvaḍḍho jarasiṅgālo [jarasigālo (sī. syā. pī.)] ditto ceva balavā ca. Atha kho, āvuso, tassa jarasiṅgālassa etadahosi – ko cāhaṃ, ko sīho migarājā. Yaṃnūnāhampi aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappeyyaṃ. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhameyyaṃ, āsayā nikkhamitvā vijambheyyaṃ, vijambhitvā samantā catuddisā anuvilokeyyaṃ, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadeyyaṃ, tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkameyyaṃ. So varaṃ varaṃ migasaṅghe vadhitvā mudumaṃsāni mudumaṃsāni bhakkhayitvā tameva āsayaṃ ajjhupeyya’nti. ‘Atha kho so, āvuso, jarasiṅgālo aññataraṃ vanasaṇḍaṃ nissāya āsayaṃ kappesi. Tatrāsayaṃ kappetvā sāyanhasamayaṃ āsayā nikkhami, āsayā nikkhamitvā vijambhi, vijambhitvā samantā catuddisā anuvilokesi, samantā catuddisā anuviloketvā tikkhattuṃ sīhanādaṃ nadissāmīti siṅgālakaṃyeva anadi bheraṇḍakaṃyeva [bhedaṇḍakaṃyeva (ka.)] anadi, ke ca chave siṅgāle, ke pana sīhanādeti [sīhanāde (?)]. ‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti.",
      "english": "Indeed, friend Pāthikaputta, an old jackal, nourished by the scraps of that same lion, the king of beasts, became both plump and strong. Then, friend, it occurred to that old jackal: 'Who am I? Who is the lion, the king of beasts? Why don't I too establish a lair, taking refuge in some forest grove? Having established a lair there, I would emerge from it in the evening. Having emerged from the lair, I would stretch. Having stretched, I would look around in all four directions. Having looked around in all four directions, I would let out a lion's roar three times. Having roared a lion's roar three times, I would go out for prey. Having repeatedly killed the best of the prey, eaten the choicest flesh, I would then return to that same lair.'\n\nThen, friend, that old jackal established a lair, taking refuge in a certain forest grove. Having established a lair there, he emerged from it in the evening. Having emerged from the lair, he stretched. Having stretched, he looked around in all four directions. Having looked around in all four directions, with the intention of roaring a lion's roar three times, he only howled a jackal's howl; he merely howled the cry of a bheraṇḍaka. 'What are these wretched jackals? And who then can roar a lion's roar?'\n\nJust so, friend Pāthikaputta, you, living on the Sugata's bounty and partaking of the Sugata's surplus, imagine that the Tathāgatas, Arahants, Perfectly Self-Enlightened Ones, can be disparaged. 'What are these wretched Pāthikaputtas? And what can be the disparagement of the Tathāgatas, Arahants, Perfectly Self-Enlightened Ones?'",
      "sinhala": "මිත්‍ර පාථිකපුත්තය, මෘග‍රාජ සිංහයාගේ ඉඳුල් වලින් වැඩුණු මහලු හිවලා අහංකාර විය, බලවත් විය. මිත්‍ර‍ය, එ කල්හි ඒ මහලු හිවලාට මෙසේ සිතුණි: 'මම කවරෙක්ද, මෘග‍රාජ සිංහයා කවරෙක්ද? මම ද යම් කිසි වනසැඩක් ඇසුරු කොටගෙන වාසස්ථානයක් තනා ගන්නෙම් නම්. එහි වාසස්ථානයක් තනාගෙන සවස් වේලාවෙහි වාසස්ථානයෙන් නික්මෙමි. වාසස්ථානයෙන් නික්ම ඇඹරෙමි. ඇඹරී සිව්දිසා බලාගෙන, සිව්දිසා බලාගෙන තුන් වරක් සිංහනාද කරමි. තුන් වරක් සිංහනාද කර භෝජනය පිණිස යමි. මම වරින් වර මුව සමූහයන් මරා, මෘදු මාංශයන් භක්ෂණය කොට ඒ වාසස්ථානයටම ඇතුල් වන්නෙමි'යි.\n\nමිත්‍ර‍ය, එ කල්හි ඒ මහලු හිවලා යම් කිසි වනසැඩක් ඇසුරු කොටගෙන වාසස්ථානයක් තනා ගත්තේය. එහි වාසස්ථානයක් තනාගෙන සවස් වේලාවෙහි වාසස්ථානයෙන් නික්මුණි. වාසස්ථානයෙන් නික්ම ඇඹරුණි. ඇඹරී සිව්දිසා බැලුවේය. සිව්දිසා බලාගෙන 'තුන් වරක් සිංහනාද කරන්නෙමි' යි සිතා හිවලුන්ගේ නාදයම නිකුත් කළේය, බේරණ්ඩා නාදයම නිකුත් කළේය. 'මේ මළකුණක් වැනි හිවලුන් කවරහුද? සිංහනාද කරන්නේ කවරෙක්ද?'\n\nමිත්‍ර පාථිකපුත්තය, එසේම නුඹ සුගතයන් වහන්සේගේ අවශේෂයන්ගෙන් ජීවත් වෙමින්, සුගතයන් වහන්සේගේ ඉඳුල් අනුභව කරමින්, අරහත් වූ සම්මාසම්බුදු වූ තථාගතයන් වහන්සේට අගෞරව කළ යුතුයැයි සිතන්නෙහි. 'මළකුණක් වැනි පාථිකපුත්තයෝ කවරහුද? අරහත් වූ සම්මාසම්බුදු වූ තථාගතයන් වහන්සේලාට කරන අගෞරවය කවරේද?'",
      "paliTitle": ""
    },
    {
      "number": 29,
      "pali": "‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī iminā opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca – ‘Sīhoti attānaṃ samekkhiyāna, Amaññi kotthu migarājāhamasmi; Tatheva [tameva (syā.)] so siṅgālakaṃ anadi, Ke ca chave siṅgāle ke pana sīhanāde’ti. ‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti.",
      "english": "Indeed, Bhaggava, Jāliya, the disciple of Dārupattika, was unable to dislodge the naked Pāthikaputta from that seat with this simile. Then he said to him: ‘The jackal, considering himself a lion, thought: “I am the king of beasts.” Just so, he roared a jackal’s roar. What are contemptible jackals, and what is a lion’s roar?’\n\n‘Just so, friend Pāthikaputta, living off the achievements of the Sugata, eating the leftovers of the Sugata, you presume to insult the Tathāgatas, the Arahants, the Perfectly Self-Awakened Ones. What are contemptible Pāthikaputtas, and what is the insult to the Tathāgatas, the Arahants, the Perfectly Self-Awakened Ones?’",
      "sinhala": "යම් හෙයකින්, භග්ගව, ජාලිය නම් දාරුපත්තිකාගේ අතවැසියා මේ උපමාවෙන් පඨිකපුත‍්‍ර නම් නිරුවත් තවුසාට ඒ ආසනයෙන් චලනය කිරීමට නොහැකි විය.\n\nඉක්බිති ඔහුට මෙසේ කීවේය: 'යම් නරියෙක් තමා සිංහයෙකු සේ සලකා, \"මම මෘගරාජයා වෙමි\"යි සිතුවේද, එලෙසම ඒ නරියා හඬ පෑවේය: \"නපුරු නරි කවුරුන්ද, සිංහනාද කවුරුන්ද?\" යනුවෙනි.'\n\n'එලෙසම, ආයුෂ්මත් පඨිකපුත‍්‍ර, නුඹ සුගතයන්ගේ කීර්තිමත් කටයුතු අතර ජීවත් වෙමින්, සුගතයන් විසින් ඉතිරි කළ දේ පරිභෝග කරමින්, අරහත් වූ, සම්මා සම්බුදු වූ තථාගතයන් වහන්සේලාට අපහාස කළ යුතු යැයි සිතන්නෙහි. නපුරු පඨිකපුත‍්‍ර කවුරුන්ද, අරහත් වූ, සම්මා සම්බුදු වූ තථාගතයන් වහන්සේලාට කළ හැකි අපහාසයක් කෙසේ විය හැකිද?'",
      "paliTitle": ""
    },
    {
      "number": 30,
      "pali": "‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca – ‘Aññaṃ anucaṅkamanaṃ, attānaṃ vighāse samekkhiya; Yāva attānaṃ na passati, kotthu tāva byagghoti maññati. Tatheva so siṅgālakaṃ anadi; Ke ca chave siṅgāle ke pana sīhanāde’ti. ‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti.",
      "english": "Indeed, Bhagga, Jāliya, the disciple of Dārupattika, was not able to dislodge the naked Pāthikaputta from that seat even with this simile. Then he said to him: ‘There is another way of wandering about, where one reflects upon oneself amidst worthlessness; as long as one does not truly see oneself, a jackal thinks it is a tiger. Just so, that jackal cried out, \"What are these miserable jackals? What, then, is a lion's roar?\"’ ‘Indeed, just so, friend Pāthikaputta, living on the remnants of the Sugata, partaking of the Sugata's surplus, you think it proper to insult the Tathagatas, Arahants, Perfectly Self-Enlightened Ones. What are these wretched Pāthikaputtas? What, then, is the insult directed at the Tathagatas, Arahants, Perfectly Self-Enlightened Ones?’",
      "sinhala": "යම් හෙයකින් භග්ගව, දාරුපත්තිකගේ අතවැසි ජාලිය මේ උපමාවෙන් පවා අචේල පාඨිකපුත්තව ඒ අසුනෙන් පහකිරීමට නොහැකි විය. එවිට ඔහුට මෙසේ කීවේය: ‘තමා ලාමක යැයි සලකමින්, අන් අය පසුපස යන්නා වූ කොත්ථු හිවලා, යම්තාක් කල් තමා ව්‍යාඝ්‍රයකු යැයි නොදකින්නේද, ඒ තාක් තමා ව්‍යාඝ්‍රයකු යැයි සිතයි. එසේම ඔහු හිවලාට හඬගෑවේය: ‘කවරහුද නීච හිවලුන්, කවරහුද සිංහනාද?’ ‘ඇවැත් පාඨිකපුත්තය, එසේම ඔබ සුගතයන් වහන්සේගේ ධර්මයෙන් යැපෙමින්, තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේලාට අපහාස කළ යුතු යැයි සිතන්නෙහි. කවරහුද නීච පාඨිකපුත්තයෝ, කවරහුද තථාගත, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේලාට කරන අපහාසය?’",
      "paliTitle": ""
    },
    {
      "number": 31,
      "pali": "‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha naṃ etadavoca – ‘Bhutvāna bheke [bhiṅge (ka.)] khalamūsikāyo, Kaṭasīsu khittāni ca koṇapāni [kūṇapāni (syā.)]; Mahāvane suññavane vivaḍḍho, Amaññi kotthu migarājāhamasmi. Tatheva so siṅgālakaṃ anadi; Ke ca chave siṅgāle ke pana sīhanāde’ti. ‘Evameva kho tvaṃ, āvuso pāthikaputta, sugatāpadānesu jīvamāno sugatātirittāni bhuñjamāno tathāgate arahante sammāsambuddhe āsādetabbaṃ maññasi. Ke ca chave pāthikaputte, kā ca tathāgatānaṃ arahantānaṃ sammāsambuddhānaṃ āsādanā’ti.",
      "english": "But indeed, Bhaggava, Jāliya, the disciple of Dārupattika, was not able to dislodge Acelaka Pāthikaputta from that seat even with this simile. Then he said to him: ‘Having eaten frogs and mice from the threshing floor, and corpses thrown in charnel grounds; grown up in a great, empty forest, the jackal thought, “I am the king of beasts.” Just so, he made a jackal’s howl. What are wretched jackals? What, then, is a lion’s roar?’\n\n‘Just so, friend Pāthikaputta, you, living on the remnants of the Sugata’s teachings, eating what is left over from the Sugata, think you can insult the Tathāgatas, the Arahants, the Perfectly Enlightened Ones. What are wretched Pāthikaputtas, and what is an insult to the Tathāgatas, the Arahants, the Perfectly Enlightened Ones?’",
      "sinhala": "භග්ගව, දාරුපත්තිකගේ අතවැසි ජාලිය, මේ උපමාවෙන්ද පාථිකපුත්ත නම් නිරුවත් තවුසාට ඒ අසුනෙන් ඉවත් කිරීමට නොහැකි විය. එවිට ඔහුට මෙසේ කීවේය: ‘ගෙම්බන් සහ කෙත්වතු මීයන් කා, සොහොන් බිම්වල දමා තිබූ මළ සිරුරුද අනුභව කර, මහත් වූ හිස් වනයක වැඩුන නරියෙක්, “මම මෘග‍්‍රාජයා වෙමි” යැයි සිතුවේය. එලෙසම, ඒ නරියා ගොරවා කීවේ, “කෙළෙස් සහිත නරි කොහිද, සිංහනාද කොහිද?” යනුවෙනි.\n\n‘එලෙසම, ආයුෂ්මත්වූ පාථිකපුත්ත, ඔබ සුගතයන් වහන්සේලාගේ අනුග්‍රහයෙන් ජීවත් වෙමින්, සුගතයන් වහන්සේලාගේ ඉතිරි දේ අනුභව කරමින්, අරහත් වූ සම්මාසම්බුදු තථාගතයන් වහන්සේලාට අවමන් කළ හැකි යැයි සිතයි. කෙළෙස් සහිත පාථිකපුත්තයෝ කොහිද, අරහත් වූ සම්මාසම්බුදු තථාගතයන් වහන්සේලාට අවමන් කිරීම කොහිද?’",
      "paliTitle": ""
    },
    {
      "number": 32,
      "pali": "‘‘Yato kho, bhaggava, jāliyo dārupattikantevāsī imināpi opammena neva asakkhi acelaṃ pāthikaputtaṃ tamhā āsanā cāvetuṃ. Atha taṃ parisaṃ āgantvā evamārocesi – ‘parābhūtarūpo, bho, acelo pāthikaputto āyāmi āvuso, āyāmi āvusoti vatvā tattheva saṃsappati, na sakkoti āsanāpi vuṭṭhātu’nti.",
      "english": "Indeed, Bhaggava, Jāliya, the disciple of Dārupattika, was unable to dislodge the naked ascetic Pāthikaputta from that seat, even with this simile. Then, having gone to that assembly, he reported thus: ‘Sirs, the naked ascetic Pāthikaputta is utterly defeated. Though saying, “I am coming, friends, I am coming, friends,” he merely shuffles about right there and cannot even stand up from his seat.’",
      "sinhala": "භග්ගව, දාරුපත්තිකගේ අතවැසියා වූ ජාලියට මේ උපමාවෙන් පවා නිරුවත් පාථිකපුත්ත එම ආසනයෙන් ඉවත් කිරීමට නොහැකි විය. එවිට ඒ පිරිස වෙත පැමිණ මෙසේ දැන්වී ය: ‘පින්වතුනි, නිරුවත් පාථිකපුත්ත පරාජය වී, ‘ඇවැත්නි, මම එමි, ඇවැත්නි, මම එමි’ යැයි පවසා එතැනම බඩගායි. ආසනයෙන් නැගිටීමට පවා නොහැකි ය.’",
      "paliTitle": ""
    },
    {
      "number": 33,
      "pali": "‘‘Evaṃ vutte, ahaṃ, bhaggava, taṃ parisaṃ etadavocaṃ – ‘abhabbo kho, āvuso, acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyya. Sacepāyasmantānaṃ licchavīnaṃ evamassa – mayaṃ acelaṃ pāthikaputtaṃ varattāhi bandhitvā nāgehi [goyugehi (sabbattha) aṭṭhakathā passitabbā] āviñcheyyāmāti. Tā varattā chijjeyyuṃ pāthikaputto vā. Abhabbo pana acelo pāthikaputto taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā mama sammukhībhāvaṃ āgantuṃ. Sacepissa evamassa – ahaṃ taṃ vācaṃ appahāya taṃ cittaṃ appahāya taṃ diṭṭhiṃ appaṭinissajjitvā samaṇassa gotamassa sammukhībhāvaṃ gaccheyyanti, muddhāpi tassa vipateyyā’ti.",
      "english": "When this was said, I, Bhaggava, said this to that assembly: ‘Indeed, friends, it is impossible for the naked ascetic Paṭikaputta to come into my presence without abandoning that statement, without abandoning that thought, and without relinquishing that view. Even if he were to think, “I will go into the presence of the recluse Gotama without abandoning that statement, without abandoning that thought, and without relinquishing that view,” his head would surely split open. Even if the venerable Licchavis were to think, “We will bind the naked ascetic Paṭikaputta with leather straps and drag him with ox-teams,” those straps would break, or Paṭikaputta himself would break. But it is impossible for the naked ascetic Paṭikaputta to come into my presence without abandoning that statement, without abandoning that thought, and without relinquishing that view. Even if he were to think, “I will go into the presence of the recluse Gotama without abandoning that statement, without abandoning that thought, and without relinquishing that view,” his head would surely split open.’",
      "sinhala": "මෙසේ පැවසූ කල, භග්ගව, මම ඒ පිරිසට මෙය කීමි – ‘ඇවැත්නි, පථිකපුත්‍ර නිරුවතා ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත්නොහැර මා හමුවට ඒමට අපොහොසත්ය. යම් හෙයකින් ඔහුට මෙසේ සිතේ නම් – ‘මම ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත්නොහැර ශ්‍රමණ ගෞතමයන් වහන්සේ හමුවට යන්නෙමි’ කියා, ඔහුගේ හිස පවා පැළී විසිරී යන්නේය. යම් හෙයකින් ආයුෂ්මත් ලිච්ඡවීන්ට මෙසේ සිතේ නම් – ‘අපි පථිකපුත්‍ර නිරුවතා වරපටිවලින් බැඳ, ඇතුන් ලවා ඔහුව ඇදගෙන යමු’ කියා, ඒ වරපටි හෝ පථිකපුත්‍ර නිරුවතා හෝ බිඳී යන්නේය. ඇත්තෙන්ම, පථිකපුත්‍ර නිරුවතා ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත්නොහැර මා හමුවට ඒමට අපොහොසත්ය. යම් හෙයකින් ඔහුට මෙසේ සිතේ නම් – ‘මම ඒ වචනය නොහැර, ඒ සිත නොහැර, ඒ දෘෂ්ටිය අත්නොහැර ශ්‍රමණ ගෞතමයන් වහන්සේ හමුවට යන්නෙමි’ කියා, ඔහුගේ හිස පවා පැළී විසිරී යන්නේය’යි.",
      "paliTitle": ""
    },
    {
      "number": 34,
      "pali": "‘‘Atha khvāhaṃ, bhaggava, taṃ parisaṃ dhammiyā kathāya sandassesiṃ samādapesiṃ samuttejesiṃ sampahaṃsesiṃ, taṃ parisaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā mahābandhanā mokkhaṃ karitvā caturāsītipāṇasahassāni mahāviduggā uddharitvā tejodhātuṃ samāpajjitvā sattatālaṃ vehāsaṃ abbhuggantvā aññaṃ sattatālampi acciṃ [aggiṃ (syā.)] abhinimminitvā pajjalitvā dhūmāyitvā [dhūpāyitvā (sī. pī.)] mahāvane kūṭāgārasālāyaṃ paccuṭṭhāsiṃ.",
      "english": "Then, Bhaggava, I instructed, encouraged, inspired, and gladdened that assembly with a talk on the Dhamma. Having instructed, encouraged, inspired, and gladdened that assembly with a talk on the Dhamma, having freed them from great bondage, having rescued eighty-four thousand beings from great peril, having entered the fire element absorption, having risen into the air to the height of seven palm trees, and having created another blaze seven palm trees high, having blazed and emitted smoke, I then reappeared in the gabled hall in the great forest.",
      "sinhala": "ඉක්බිති භග්ගව, මම ඒ පිරිසට ධර්ම‍ කථාවකින් සත්‍ය අවබෝධ කරවා, සමාදන් කරවා, උනන්දු කරවා, සතුටු කරවා, මහත් බැඳීම් වලින් මුදවා, අසූ හාර දහසක් ප්‍රාණීන් මහා දුර්ගයෙන් මුදවා, තේජෝ ධාතුවට සමවැදී, තල් ගස් හතක් පමණ අහසට නැඟී, තවත් තල් ගස් හතක් පමණ වූ දැල්ලක් මවා, දැල්වී දුම් දමා, මහා වනයෙහි කූටාගාර ශාලාවෙහි නැවත පහළ වීමි.",
      "paliTitle": ""
    },
    {
      "number": 35,
      "pali": "‘‘Atha kho, bhaggava, sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho ahaṃ, bhaggava, sunakkhattaṃ licchaviputtaṃ etadavocaṃ – ‘taṃ kiṃ maññasi, sunakkhatta, yatheva te ahaṃ acelaṃ pāthikaputtaṃ ārabbha byākāsiṃ, tatheva taṃ vipākaṃ aññathā vā’ti? ‘Yatheva me, bhante, bhagavā acelaṃ pāthikaputtaṃ ārabbha byākāsi, tatheva taṃ vipākaṃ, no aññathā’ti. ‘Taṃ kiṃ maññasi, sunakkhatta, yadi evaṃ sante kataṃ vā hoti uttarimanussadhammā iddhipāṭihāriyaṃ, akataṃ vā’ti? ‘Addhā kho, bhante, evaṃ sante kataṃ hoti uttarimanussadhammā iddhipāṭihāriyaṃ, no akata’nti. ‘Evampi kho maṃ tvaṃ, moghapurisa, uttarimanussadhammā iddhipāṭihāriyaṃ karontaṃ evaṃ vadesi – na hi pana me, bhante, bhagavā uttarimanussadhammā iddhipāṭihāriyaṃ karotīti. Passa, moghapurisa, yāvañca te idaṃ aparaddhaṃ’ti. ‘‘Evampi kho, bhaggava, sunakkhatto licchaviputto mayā vuccamāno apakkameva imasmā dhammavinayā, yathā taṃ āpāyiko nerayiko.",
      "english": "Then, Bhaggava, Sunakkhatta, the Licchavi son, approached me; having approached me, he bowed to me and sat down to one side. As Sunakkhatta, the Licchavi son, sat to one side, I, Bhaggava, said this to him: ‘What do you think, Sunakkhatta, is the result just as I declared it to you concerning Pāthikaputta, the naked ascetic, or is it otherwise?’ ‘Just as the Fortunate One, revered sir, declared to me concerning Pāthikaputta, the naked ascetic, so indeed is the result, not otherwise,’ he replied. ‘What do you think, Sunakkhatta, if that is the case, has an extraordinary human quality, a feat of psychic power, been performed or not performed?’ ‘Surely, revered sir, if that is the case, an extraordinary human quality, a feat of psychic power, has been performed, not left undone,’ he replied. ‘Even so, you, foolish man, while I was performing an extraordinary human quality, a feat of psychic power, said this: \"Indeed, the Fortunate One, revered sir, does not perform an extraordinary human quality, a feat of psychic power for me.\" See, foolish man, how greatly you have erred in this matter!’\n\nEven so, Bhaggava, as I spoke to him, Sunakkhatta, the Licchavi son, departed from this Dhamma and Discipline, destined for a lower realm, for hell.",
      "sinhala": "‘‘එවිට භග්ගව, ලිච්ඡවී පුත්‍ර සුනක්ඛත්ත මා සිටි තැනට පැමිණියේය; පැමිණ මා වැඳ එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ලිච්ඡවී පුත්‍ර සුනක්ඛත්තට, භග්ගව, මම මෙසේ කීවෙමි – ‘සුනක්ඛත්ත, නුඹ කුමක් සිතන්නෙහිද? මම අචේල පාථිකපුත්‍රයා ගැන නුඹට පැහැදිලි කළ ආකාරයටම ඒ විපාකය සිදු වූවාද, නැත්නම් වෙනස් ආකාරයකටද?’ ‘ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අචේල පාථිකපුත්‍රයා ගැන මට පැහැදිලි කළ ආකාරයටම ඒ විපාකය සිදු විය, වෙනස් ආකාරයකට නොවේ’යි. ‘සුනක්ඛත්ත, නුඹ කුමක් සිතන්නෙහිද? එසේ වූ කල්හි අතිමනුස්ස ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් සිදු වූවාද, නැත්නම් සිදු නොවූවාද?’ ‘ඇත්තෙන්ම ස්වාමීනි, එසේ වූ කල්හි අතිමනුස්ස ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් සිදු විය, සිදු නොවූයේ නොවේ’යි. ‘මෝඝ පුරුෂය, මෙසේ මා අතිමනුස්ස ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් කරන විටත් නුඹ මෙසේ කියයි – ‘ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අතිමනුස්ස ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් නොකරන සේක’යි. මෝඝ පුරුෂය, නුඹට මේ කොපමණ වරදක් වීදැයි බලනු’යි. ‘‘භග්ගව, මා විසින් මෙසේ කියනු ලැබූ ලිච්ඡවී පුත්‍ර සුනක්ඛත්ත මේ ධර්ම විනයෙන් බැහැර විය, නිරයට වැටෙන, අපාගත වන්නෙක් මෙන්.",
      "paliTitle": ""
    },
    {
      "number": 36,
      "pali": "‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi. Tañca pajānāmi [‘‘tañcapajānāmī’’ti idaṃ syāpotthakenatthi], tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ [pajānanaṃ (syā. ka.) aṭṭhakathāsaṃvaṇṇanā passitabbā] na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā, yadabhijānaṃ tathāgato no anayaṃ āpajjati.",
      "english": "And I, Bhaggava, understand the foremost. I understand that, and I understand what is even superior to that. Having understood that, I do not cling to it. And for me, by not clinging, ultimate peace is known personally. Knowing which, the Tathagata does not fall into ruin.",
      "sinhala": "භග්ගව, මම අග්ගඤ්ඤයද දනිමි. ඒද දනිමි. ඊටත් වඩා උත්තරීතර වූ දෙයද දනිමි. ඒ දැනගැනීම මම නොපරාමර්ශනය කරමි. නොපරාමර්ශනය කරන හෙයින්, මට තමන් විසින්ම නිවන අවබෝධ වී ඇත. යම් දෙයක් අවබෝධ කරගැනීමෙන් තථාගතයන් වහන්සේ කිසිදු අනර්ථයකට පත් නොවේ.",
      "paliTitle": "Aggaññapaññattikathā",
      "englishTitle": "Discourse on the Concept of Origins",
      "sinhalaTitle": "අග්ගඤ්ඤ පඤ්ඤත්ති කථාව"
    },
    {
      "number": 37,
      "pali": "‘‘Santi, bhaggava, eke samaṇabrāhmaṇā issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā, ‘āmo’ti [āmāti (syā.)] paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana [kathaṃ vihitakaṃno pana (ka.)] tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –",
      "english": "Bhaggava, there are some ascetics and brahmins who proclaim a supreme lordship, a divine state, a mastership, a pre-eminence. Having approached them, I speak thus: ‘Is it true, venerable sirs, that you proclaim a supreme lordship, a divine state, a mastership, a pre-eminence?’ And they, thus questioned by me, acknowledge, ‘Yes.’ Then I speak thus to them: ‘But how, venerable sirs, do you establish this supreme lordship, this divine state, this mastership, this pre-eminence?’ Questioned by me, they are unable to answer, and being unable to answer, they question me in return. Questioned by them, I explain:",
      "sinhala": "භාග්‍යව, සමහර ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ ඊශ්වරභාවය, බ්‍රහ්මභාවය, ආචාර්යභාවය, අග්‍රභාවය ප්‍රකාශ කරති. මම ඔවුන් කරා එළඹ මෙසේ කියමි: ‘ආයුෂ්මතුන් වහන්සේලා ඊශ්වරභාවය, බ්‍රහ්මභාවය, ආචාර්යභාවය, අග්‍රභාවය ප්‍රකාශ කරන්නේ ඇත්තටමද?’ මා විසින් මෙසේ අසන ලද ඔවුහු ‘එසේය’යි පිළිගනිති. මම ඔවුන්ට මෙසේ කියමි: ‘ආයුෂ්මතුන් වහන්සේලා ඊශ්වරභාවය, බ්‍රහ්මභාවය, ආචාර්යභාවය, අග්‍රභාවය ප්‍රකාශ කරන්නේ කිනම් ආකාරයෙන්ද?’ මා විසින් අසන ලද ඔවුහු එය පැහැදිලි කිරීමට සමත් නොවෙති. එසේ සමත් නොවීමෙන් මාගෙන්ම නැවත ප්‍රශ්න කරති. ඔවුන් විසින් අසන ලද මම පිළිතුරු දෙමි:",
      "paliTitle": ""
    },
    {
      "number": 38,
      "pali": "‘Hoti kho so, āvuso, samayo yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne loke yebhuyyena sattā ābhassarasaṃvattanikā honti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino ciraṃ dīghamaddhānaṃ tiṭṭhanti. ‘Hoti kho so, āvuso, samayo yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko vivaṭṭati. Vivaṭṭamāne loke suññaṃ brahmavimānaṃ pātubhavati. Atha kho [atha (sī. syā. pī.)] aññataro satto āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā suññaṃ brahmavimānaṃ upapajjati. So tattha hoti manomayo pītibhakkho sayaṃpabho antalikkhacaro subhaṭṭhāyī, ciraṃ dīghamaddhānaṃ tiṭṭhati. ‘Tassa tattha ekakassa dīgharattaṃ nivusitattā anabhirati paritassanā uppajjati – aho vata aññepi sattā itthattaṃ āgaccheyyunti. Atha aññepi sattā āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā brahmavimānaṃ upapajjanti tassa sattassa sahabyataṃ. Tepi tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti.",
      "english": "Friends, there comes a time, at some point after a very long period, when this world undergoes contraction. As the world contracts, beings mostly become those reborn in the Ābhassara realm. There they are mind-made, feeding on joy, self-luminous, moving through space, dwelling in glory, and they remain there for a very long, extended period.\n\nFriends, there also comes a time, at some point after a very long period, when this world undergoes evolution. As the world evolves, an empty Brahma-realm appears. Then, due to the exhaustion of life-span or the exhaustion of merit, a certain being falls from the Ābhassara realm and is reborn in that empty Brahma-realm. There he is mind-made, feeding on joy, self-luminous, moving through space, dwelling in glory, and he remains there for a very long, extended period.\n\nHaving dwelled there alone for a long time, discontent and anguish arise in him. He yearns, 'Oh, if only other beings would come to this state of being!' Then other beings, due to the exhaustion of life-span or the exhaustion of merit, fall from the Ābhassara realm and are reborn in the Brahma-realm as companions to that being. They too are mind-made, feeding on joy, self-luminous, moving through space, dwelling in glory, and they remain there for a very long, extended period.",
      "sinhala": "ඇවැත්නි, යම් කලක, දීර්ඝ කාලයක් ගතවීමෙන් පසුව, මේ ලෝකය සංවට්ටනය (විනාශය) වන කාලයක් පැමිණේ. ලෝකය සංවට්ටනය වෙද්දී, බොහෝ සත්වයෝ ආභස්සර බ්‍ර‌හ්ම ලෝකයට පැමිණෙති. ඔවුහු එහි මනෝමය වෙති, ප්‍ර‌ීතියෙන් යැපෙන්නෝ වෙති, ස්වයංප්‍ර‌භා ඇත්තෝ වෙති, අහසේ හැසිරෙන්නෝ වෙති, සුභ ස්ථානයක සිටින්නෝ වෙති. දීර්ඝ කාලයක් එහි වෙසෙති.\n\nඇවැත්නි, යම් කලක, දීර්ඝ කාලයක් ගතවීමෙන් පසුව, මේ ලෝකය විවට්ටනය (නැවත ඇතිවීම) වන කාලයක් පැමිණේ. ලෝකය විවට්ටනය වෙද්දී, හිස් බ්‍ර‌හ්ම විමානයක් පහළ වේ. ඉක්බිති එක්තරා සත්වයෙක්, ආයුෂ ගෙවී යාමෙන් හෝ පින් ගෙවී යාමෙන් හෝ, ආභස්සර ලෝකයෙන් චුත වී, හිස් බ්‍ර‌හ්ම විමානයේ උපත ලබයි. ඔහු එහි මනෝමය වෙයි, ප්‍ර‌ීතියෙන් යැපෙන්නෙක් වෙයි, ස්වයංප්‍ර‌භා ඇත්තෙක් වෙයි, අහසේ හැසිරෙන්නෙක් වෙයි, සුභ ස්ථානයක සිටින්නෙක් වෙයි, දීර්ඝ කාලයක් එහි වෙසෙයි.\n\nඔහුට එහි තනිවම දීර්ඝ කාලයක් විසූ නිසා, අරතිය (අසතුට) සහ පරිත්‍රාසය (දැඩි තැවීම) ඇති වේ – \"අහෝ, අන්‍ය සත්වයෝද මේ තත්ත්වයට පැමිණියේ නම්!\" යනුවෙන්. ඉක්බිති අන්‍ය සත්වයෝද, ආයුෂ ගෙවී යාමෙන් හෝ පින් ගෙවී යාමෙන් හෝ, ආභස්සර ලෝකයෙන් චුත වී, ඒ සත්ත්වයාගේ සහාය පිණිස බ්‍ර‌හ්ම විමානයට උපත ලබති. ඔවුහුද එහි මනෝමය වෙති, ප්‍ර‌ීතියෙන් යැපෙන්නෝ වෙති, ස්වයංප්‍ර‌භා ඇත්තෝ වෙති, අහසේ හැසිරෙන්නෝ වෙති, සුභ ස්ථානයක සිටින්නෝ වෙති. දීර්ඝ කාලයක් එහි වෙසෙති.",
      "paliTitle": ""
    },
    {
      "number": 39,
      "pali": "‘Tatrāvuso, yo so satto paṭhamaṃ upapanno, tassa evaṃ hoti – ahamasmi brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā [sañjitā (sī. pī.), sajjitā (syā. kaṃ.)] vasī pitā bhūtabhabyānaṃ, mayā ime sattā nimmitā. Taṃ kissa hetu? Mamañhi pubbe etadahosi – aho vata aññepi sattā itthattaṃ āgaccheyyunti; iti mama ca manopaṇidhi. Ime ca sattā itthattaṃ āgatāti. ‘Yepi te sattā pacchā upapannā, tesampi evaṃ hoti – ayaṃ kho bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ; iminā mayaṃ bhotā brahmunā nimmitā. Taṃ kissa hetu? Imañhi mayaṃ addasāma idha paṭhamaṃ upapannaṃ; mayaṃ panāmha pacchā upapannāti.",
      "english": "There, friend, that being who was reborn first thinks thus: ‘I am Brahmā, the Great Brahmā, the Conqueror, the Unconquered, the All-seeing, the Wielder of Power, the Lord, the Creator, the Constructor, the Chief, the Producer, the Master, the Father of all that is and will be. By me these beings were created.’ For what reason is that? ‘For it occurred to me previously: “Oh, if only other beings would come to this state of being!” Thus was my mental aspiration. And these beings have come to this state of being.’\n\nAnd those beings who were reborn later also think thus: ‘This reverend Brahmā, the Great Brahmā, the Conqueror, the Unconquered, the All-seeing, the Wielder of Power, the Lord, the Creator, the Constructor, the Chief, the Producer, the Master, the Father of all that is and will be. By this reverend Brahmā were we created.’ For what reason is that? ‘For we saw him here, reborn first; but we were reborn later.’",
      "sinhala": "එහිදී ඇවැත්නි, යම් ඒ සත්ත්වයා පළමුව උපන්නේද, ඔහුට මෙසේ සිතේ: ‘මම බ්‍රහ්මයා වෙමි, මහා බ්‍රහ්මයා වෙමි, අභිභවනය කරන්නා වෙමි, අභිභවනය නොකරන ලද්දා වෙමි, අන් කිසිවකුටත් වඩා දකින්නා වෙමි, වසඟයෙහි පවත්වන්නා වෙමි, ඊශ්වරයා වෙමි, කර්තෘ වෙමි, නිර්මාතෘ වෙමි, ශ්‍රේෂ්ඨයා වෙමි, සියල්ල සකස් කරන්නා වෙමි, වසඟයට පත්කරගත්තා වෙමි, උපන් හා උපදින සියල්ලන්ගේ පියා වෙමි. මා විසින් මේ සත්ත්වයෝ මවන ලද්දාහුය.’ ඒ කුමක් නිසාද? මක්නිසාද මට පෙර මෙබඳු සිතක් ඇතිවිය: ‘අහෝ යහපති! තවත් සත්ත්වයෝද මෙබඳු තත්ත්වයකට පැමිණෙත්වා!’ මේ මාගේ මනෝප්‍රණිධිය විය. තවද මේ සත්ත්වයෝ මේ තත්ත්වයට පැමිණියාහුය.\n\nපසුව උපන් යම් සත්ත්වයෝ වෙත්ද, ඔවුන්ටද මෙසේ සිතේ: ‘මේ භවත් බ්‍රහ්මයා මහා බ්‍රහ්මයා ය, අභිභවනය කරන්නා ය, අභිභවනය නොකරන ලද්දා ය, අන් කිසිවකුටත් වඩා දකින්නා ය, වසඟයෙහි පවත්වන්නා ය, ඊශ්වරයා ය, කර්තෘ ය, නිර්මාතෘ ය, ශ්‍රේෂ්ඨයා ය, සියල්ල සකස් කරන්නා ය, වසඟයට පත්කරගත්තා ය, උපන් හා උපදින සියල්ලන්ගේ පියා ය. මේ භවත් බ්‍රහ්මයා විසින් අපි නිර්මාණය කරන ලද්දාහුය.’ ඒ කුමක් නිසාද? මක්නිසාද අපි මේ භවත් බ්‍රහ්මයා මෙහි පළමුව උපන් බව දුටුවෙමු. අපි නම් පසුව උපන්නාහුය.",
      "paliTitle": ""
    },
    {
      "number": 40,
      "pali": "‘Tatrāvuso, yo so satto paṭhamaṃ upapanno, so dīghāyukataro ca hoti vaṇṇavantataro ca mahesakkhataro ca. Ye pana te sattā pacchā upapannā, te appāyukatarā ca honti dubbaṇṇatarā ca appesakkhatarā ca. ‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati; tato paraṃ nānussarati. ‘So evamāha – yo kho so bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ, yena mayaṃ bhotā brahmunā nimmitā. So nicco dhuvo [sassato dīghāyuko (syā. ka.)] sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassati. Ye pana mayaṃ ahumhā tena bhotā brahmunā nimmitā, te mayaṃ aniccā addhuvā [addhuvā asassatā (syā. ka.)] appāyukā cavanadhammā itthattaṃ āgatā’ti. Evaṃvihitakaṃ no tumhe āyasmanto issarakuttaṃ brahmakuttaṃ ācariyakaṃ aggaññaṃ paññapethāti. ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi. Tañca pajānāmi, tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā. Yadabhijānaṃ tathāgato no anayaṃ āpajjati.",
      "english": "There, friends, that being who was reborn first is longer-lived, more beautiful, and more powerful. But those beings who were reborn later are shorter-lived, less beautiful, and less powerful.\n\nIt is indeed possible, friends, that a certain being, having fallen away from that realm, comes to this state of being. Having come to this state of being, he goes forth from the home life into homelessness. Having gone forth from the home life into homelessness, he applies himself to ardent effort, to striving, to perseverance, to diligence, to proper attention, and thereby touches such a concentration of mind. With his mind thus concentrated, he recollects that previous existence, but he does not recollect beyond that.\n\nHe speaks thus: 'That venerable Brahma, the Great Brahma, the conqueror, the unconquered, the all-seeing, the wielder of power, the lord, the maker, the creator, the best, the ordainer, the master, the father of all that has been and will be, by whom we have been created. He is eternal, steadfast, perpetual, of an unchanging nature, and will remain thus for all eternity. But we who were created by that venerable Brahma are impermanent, unstable, short-lived, subject to falling away, and have come to this state of being.' Thus, venerable sirs, do you declare a doctrine of a divine creator, a doctrine of a Brahma creator, a foremost teaching?\n\nThey spoke thus: 'It is indeed so, friend Gotama, as Venerable Gotama says.'\n\nAnd I, Bhaggava, know the foremost teaching. And I know it, and I know what is even higher than it. And knowing it, I do not cling to it. And because I do not cling, Nibbana is realized by me personally. The Tathagata, knowing thus, does not fall into error.",
      "sinhala": "එහිදී පින්වත්නි, යම් සත්වයෙක් මුලින්ම උපන්නේද, ඔහු වඩාත් දීර්ඝායුෂ ඇත්තෙක්, වඩාත් වර්ණවත් ඇත්තෙක්, වඩාත් මහානුභාව සම්පන්න ඇත්තෙක් වේ. යම් සත්වයෝ පසුව උපන්නාහුද, ඔවුහු වඩාත් අල්පායුෂ ඇත්තෝ, වඩාත් දුර්වර්ණ ඇත්තෝ, වඩාත් අල්පේශාක්‍ය ඇත්තෝ වෙති.\n\nපින්වත්නි, මෙබඳු අවස්ථාවක් තිබේ. යම් සත්වයෙක් එම භවයෙන් චුත වී මිනිස් ලොවට පැමිණෙයි. මිනිස් ලොවට පැමිණි හෙතෙම ගිහි ජීවිතයෙන් නික්ම පැවිදි වෙයි. ගිහි ජීවිතයෙන් නික්ම පැවිදි වූ හෙතෙම උත්සාහයෙන්, වීර්යයෙන්, භාවනා අනුයෝගයෙන්, අප්‍රමාදයෙන් සහ මනා මනසිකාරයෙන් යුක්තව එබඳු චිත්ත සමාධියක් ස්පර්ශ කරයි. එසේ සමාධිගත වූ සිතින් එම පූර්ව නිවාසය සිහි කරයි; එහෙත් ඉන් ඔබ්බට සිහි නොකරයි.\n\nඔහු මෙසේ කියයි: 'යම් ඒ භාග්‍යවත් බ්‍රහ්මයා මහා බ්‍රහ්මයා වේද, අභිභවනය කරන්නා වූද, අභිභවනය කළ නොහැකි වූද, අන් අර්ථයන් දන්නා වූද, වසඟයෙහි පවත්වන්නා වූද, ඊශ්වර වූද, කර්තෘ වූද, නිර්මාතෘ වූද, ශ්‍රේෂ්ඨ වූද, ස්වයංව පහළ වූද, වසී වූද, උපන් හා උපදින සියල්ලන්ගේ පියා වූද, ඒ භාග්‍යවත් බ්‍රහ්මයා විසින් අප මවන ලද්දේය. ඔහු නිත්‍යය, ධ්‍රැවය, ශාශ්වතය, විපරිණාම නොවෙන ස්වභාවය ඇත්තේය, සදාකාලිකවම එලෙසම පවතින්නේය. යම් අප ඒ භාග්‍යවත් බ්‍රහ්මයා විසින් මවන ලද්දෝ නම්, අපි අනිත්‍යයෝ, අධ්‍රැවයෝ, අල්පායුෂ ඇත්තෝ, චුත වන ස්වභාවය ඇත්තෝ, මිනිස් ලොවට පැමිණියෝ වෙමු.' මේ අයුරින් පින්වත්නි, ඔබලා ඊශ්වරත්වය, බ්‍රහ්මත්වය, ආචාර්යත්වය අග්‍ර යැයි සලකා ප්‍රකාශ කරන්නහුද? ඔවුහු මෙසේ කීහ: \"පින්වත් ගෞතමයනි, ඔබ වහන්සේ ප්‍රකාශ කළ අයුරින්ම අපට අසන්නට ලැබුණේය.\"\n\nභග්ගව, මම අග්‍රප්‍රඥාව දනිමි. මම එය දනිමි, ඊට වඩා උසස් දෑ ද දනිමි. එය දැනගෙනද, මම එයට ඇලී නොසිටිමි. නොඇලී සිටින මා හට, ස්වයං වශයෙන්ම නිර්වාණය අවබෝධ වී ඇත. යමක් අවබෝධ කරගැනීමෙන් තථාගතයා අනර්ථයට පත් නොවේද.",
      "paliTitle": ""
    },
    {
      "number": 41,
      "pali": "‘‘Santi, bhaggava, eke samaṇabrāhmaṇā khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti, tesāhaṃ puṭṭho byākaromi –",
      "english": "O Bhaggava, there are some ascetics and brahmins who declare a primeval doctrine concerning beings corrupted by amusement. I approach them and say, ‘Is it true, venerable sirs, that you declare a primeval doctrine concerning beings corrupted by amusement?’ And when thus questioned by me, they acknowledge, ‘Yes.’ I then say to them, ‘But in what manner, venerable sirs, do you declare a primeval doctrine concerning beings corrupted by amusement?’ When questioned by me, they are unable to explain, and being unable to explain, they question me back, and when questioned by them, I explain:",
      "sinhala": "භග්ගව, සමහර ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ ක්‍රීඩා ප්‍රදෝෂික ආචාර්යවාදයක් වූ අග්‍රඤ්ඤය ප්‍රඥප්ත කරති. මම ඔවුන් වෙත එළඹ මෙසේ කියමි: ‘ආයුෂ්මත්වරුනි, ඇත්තටම ඔබලා ක්‍රීඩා ප්‍රදෝෂික ආචාර්යවාදයක් වූ අග්‍රඤ්ඤය ප්‍රඥප්ත කරන්නේදැයි’ කියා. මා විසින් මෙසේ විමසූ විට ඔවුහු ‘එසේය’යි පිළිගනිති. මම ඔවුන්ට මෙසේ කියමි: ‘ආයුෂ්මත්වරුනි, ඔබලා කෙසේ නම් ක්‍රීඩා ප්‍රදෝෂික ආචාර්යවාදයක් වූ අග්‍රඤ්ඤය ප්‍රඥප්ත කරන්නේදැයි’ කියා. මා විසින් විමසූ විට ඔවුහු පිළිතුරු දීමට නොහැකි වෙති. එසේ පිළිතුරු දීමට නොහැකි වීමෙන් ඔවුහු මා වෙතින්ම ප්‍රතිප්‍රශ්න අසති. ඔවුන් විසින් මා විමසූ විට, මම පැහැදිලි කරමි –",
      "paliTitle": ""
    },
    {
      "number": 42,
      "pali": "‘Santāvuso, khiḍḍāpadosikā nāma devā. Te ativelaṃ hassakhiḍḍāratidhammasamāpannā [hasakhiḍḍāratidhammasamāpannā (ka.)] viharanti. Tesaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati, satiyā sammosā [satiyā sammosāya (syā.)] te devā tamhā kāyā cavanti. ‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati, itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati, agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati; tato paraṃ nānussarati. ‘So evamāha – ye kho te bhonto devā na khiḍḍāpadosikā te na ativelaṃ hassakhiḍḍāratidhammasamāpannā viharanti. Tesaṃ nātivelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati na sammussati, satiyā asammosā te devā tamhā kāyā na cavanti, niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā khiḍḍāpadosikā te mayaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannā viharimhā, tesaṃ no ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati, satiyā sammosā evaṃ [sammosā eva (sī. pī.) sammosā te (syā. ka.)] mayaṃ tamhā kāyā cutā, aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatāti. Evaṃvihitakaṃ no tumhe āyasmanto khiḍḍāpadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti. ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi…pe… yadabhijānaṃ tathāgato no anayaṃ āpajjati.",
      "english": "Friends, there are gods called the Play-Polluted. They dwell excessively engaged in the habit of mirth, play, and delight. As they dwell excessively engaged in the habit of mirth, play, and delight, their mindfulness becomes lost. Due to the loss of their mindfulness, those gods pass away from that realm. Friends, it is possible that a certain being, having passed away from that realm, comes to this human state. Having come to this human state, he goes forth from the home life into homelessness. Having gone forth from the home life into homelessness, he applies himself to ardent striving, to exertion, to application, to heedfulness, and to right attention, and thus attains such a concentration of mind that when his mind is thus concentrated, he recollects that previous existence, but he does not recollect beyond that.\n\nHe then speaks thus: ‘Those venerable gods who are not Play-Polluted do not dwell excessively engaged in the habit of mirth, play, and delight. As they dwell not excessively engaged in the habit of mirth, play, and delight, their mindfulness does not become lost. Due to the non-loss of their mindfulness, those gods do not pass away from that realm. They are permanent, stable, eternal, not subject to change, and will remain thus for eternity. But we, who were Play-Polluted, we dwelt excessively engaged in the habit of mirth, play, and delight. As we dwelt excessively engaged in the habit of mirth, play, and delight, our mindfulness became lost. Due to the loss of our mindfulness, we passed away from that realm, impermanent, unstable, short-lived, subject to passing away, and have come to this human state.’ ‘In this manner, Venerables, you set forth the primal doctrine concerning the Play-Polluted gods.’ They said this: ‘Indeed, good Gotama, we have heard it thus, just as Venerable Gotama says.’\n\n‘And I, Bhaggava, know the primal doctrine, which, having comprehended, the Tathagata does not fall into error.",
      "sinhala": "ආයුෂ්මතුනි, ක‍්‍රීඩාප‍්‍රදෝෂික නම් දෙවිවරු සිටිති. ඔවුහු අධික ලෙස සිනාසීමෙහි හා ක‍්‍රීඩාවෙහි ඇලී වාසය කරති. එසේ අධික ලෙස සිනාසීමෙහි හා ක‍්‍රීඩාවෙහි ඇලී වාසය කරන ඔවුනගේ සිහිය මුළා වේ. සිහිය මුළා වීම නිසා ඒ දෙවිවරු ඒ කයෙන් චුත වෙති.\n\nආයුෂ්මතුනි, ඒ කයෙන් චුත වූ යම් සත්වයෙක් මේ මිනිස් ලොවට පැමිණීම සිදු විය හැකිය. මේ මිනිස් ලොවට පැමිණි ඔහු ගිහි ගෙයින් නික්ම අනගාරික ප‍්‍රව්‍රජ්‍යාවට පැමිණෙයි. ගිහි ගෙයින් නික්ම අනගාරික ප‍්‍රව්‍රජ්‍යාවට පැමිණි ඔහු වීර්යය, ප‍්‍රධන්ය, අනුයෝගය, අප‍්‍රමාදය, සහ මනා මෙනෙහි කිරීම අනුගමනය කරමින් එවැනි චිත්ත සමාධියක් ලබා ගනියි. එසේ සමාධිගත වූ සිතින් ඔහු ඒ පූර්ව නිවාසය සිහි කරයි; එතැනින් ඔබ්බට සිහි නොකරයි.\n\nඔහු මෙසේ කියයි: ‘යම් ඒ භවත් දෙවිවරු ක‍්‍රීඩාප‍්‍රදෝෂික නොවනවාහුද, ඔවුහු අධික ලෙස සිනාසීමෙහි හා ක‍්‍රීඩාවෙහි ඇලී වාසය නොකරති. අධික ලෙස සිනාසීමෙහි හා ක‍්‍රීඩාවෙහි නොඇලී වාසය කරන ඔවුනගේ සිහිය මුළා නොවේ. සිහිය නොමුළා වීම නිසා ඒ දෙවිවරු ඒ කයෙන් චුත නොවෙති. ඔවුහු නිත්‍යව, ස්ථිරව, සදාකාලිකව, වෙනස් නොවන ස්වභාවයකින් යුතුව සදහටම එලෙසම පවතිනු ඇත. යම් අපි නම් ක‍්‍රීඩාප‍්‍රදෝෂික වූවෝද, අපි අධික ලෙස සිනාසීමෙහි හා ක‍්‍රීඩාවෙහි ඇලී වාසය කළෙමු. එසේ අධික ලෙස සිනාසීමෙහි හා ක‍්‍රීඩාවෙහි ඇලී වාසය කළ අපගේ සිහිය මුළා විය. සිහිය මුළා වීම නිසා අපි ඒ කයෙන් චුත වී, අනිත්‍ය වූවන්, අස්ථිර වූවන්, අල්පායුෂ වූවන්, චුති ස්වභාවයෙන් යුක්ත වූවන් ලෙස මේ මිනිස් ලොවට පැමිණියෙමු යි. ආයුෂ්මත්නි, මේ ක‍්‍රීඩාප‍්‍රදෝෂික ගුරු මතය මෙලෙසින් පනවන්නාහුද?’\n\nඔවුහු මෙසේ කීහ: ‘ආයුෂ්මත් ගෞතමය, අපට අසන්නට ලැබුණේ ඔබ වහන්සේ පැවසූ පරිදියි.’\n\nභග්ගව, මම අග‍්‍රඤ්ඤය දනිමි...පෙ... යමක් දැන ගැනීමෙන් තථාගතයන් වහන්සේ වැරදි මඟකට නොපැමිණෙති.",
      "paliTitle": ""
    },
    {
      "number": 43,
      "pali": "‘‘Santi, bhaggava, eke samaṇabrāhmaṇā manopadosikaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –",
      "english": "There are, O Bhaggava, some ascetics and brahmins who proclaim a supreme doctrine rooted in mental defilement. I approach them and say, ‘Is it true, venerable sirs, that you proclaim a supreme doctrine rooted in mental defilement?’ And when thus questioned by me, they affirm, ‘Yes.’ Then I say to them, ‘But venerable sirs, how do you constitute this supreme doctrine rooted in mental defilement?’ When questioned by me, they are unable to explain, and being unable to explain, they question me in return. When questioned by them, I explain:",
      "sinhala": "භග්ගව, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ මනෝදෝෂය මුල්කරගත් උතුම් ආචාර්යවාදයක් ප්‍රකාශ කරති. මම ඔවුන් වෙත එළඹ මෙසේ කියමි – ‘ආයුෂ්මතුන් වහන්සේලා සැබැවින්ම මනෝදෝෂය මුල්කරගත් උතුම් ආචාර්යවාදයක් ප්‍රකාශ කරන්නහුද?’ මා විසින් මෙසේ විමසූ විට ඔවුහු ‘එසේය’යි පිළිගනිති. මම ඔවුනට මෙසේ කියමි – ‘එසේනම් ආයුෂ්මතුන් වහන්සේලා කෙසේ වූ මනෝදෝෂය මුල්කරගත් උතුම් ආචාර්යවාදයක් ප්‍රකාශ කරන්නහුද?’ මා විසින් විමසූ විට ඔවුහු එය විස්තර කිරීමට නොහැකි වෙති, නොහැකිව මාගෙන්ම ප්‍රතිප්‍රශ්න අසති. ඔවුනගෙන් විමසූ විට මම විස්තර කරමි –",
      "paliTitle": ""
    },
    {
      "number": 44,
      "pali": "‘Santāvuso, manopadosikā nāma devā. Te ativelaṃ aññamaññaṃ upanijjhāyanti. Te ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsenti. Te aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Te devā tamhā kāyā cavanti. ‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati. ‘So evamāha – ye kho te bhonto devā na manopadosikā te nātivelaṃ aññamaññaṃ upanijjhāyanti. Te nātivelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni nappadūsenti. Te aññamaññaṃ appaduṭṭhacittā akilantakāyā akilantacittā. Te devā tamhā [akilantacittā tamhā (ka.)] kāyā na cavanti, niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā manopadosikā, te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyimhā. Te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsimhā [padosiyimhā (syā.), padūsayimhā (?)]. Te mayaṃ aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Evaṃ mayaṃ [kilantacittāeva mayaṃ (sī. pī.), kilantacittā (ka.)] tamhā kāyā cutā, aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatāti. Evaṃvihitakaṃ no tumhe āyasmanto manopadosikaṃ ācariyakaṃ aggaññaṃ paññapethā’ti. ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ, yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi…pe… yadabhijānaṃ tathāgato no anayaṃ āpajjati.",
      "english": "Friends, there are devas called 'Mind-Polluting Ones'. They gaze upon each other excessively. As they gaze upon each other excessively, their minds become polluted towards one another. With minds polluted towards each other, their bodies become weary and their minds become weary. Those devas fall away from that realm.\n\nIt is, however, possible, friends, that a certain being, having fallen away from that realm, comes to this state of being. Having come to this state of being, he goes forth from the home life into homelessness. Having gone forth from the home life into homelessness, he applies himself to ardent striving, exertion, practice, diligence, and right attention, and thereby touches such a mental concentration that, with his mind thus concentrated, he recollects that past existence, but he does not recollect beyond that.\n\nHe then says this: 'Those venerable devas who are not \"Mind-Polluting Ones\" do not gaze upon each other excessively. As they do not gaze upon each other excessively, their minds do not become polluted towards one another. With minds not polluted towards each other, their bodies are not weary and their minds are not weary. Those devas do not fall away from that realm; they are permanent, stable, eternal, of an unchanging nature, and will remain just so for eternity.\n\nBut we, who were \"Mind-Polluting Ones,\" we gazed upon each other excessively. As we gazed upon each other excessively, our minds became polluted towards one another. With minds polluted towards each other, our bodies became weary and our minds became weary. Thus, having fallen away from that realm, we are impermanent, unstable, short-lived, subject to falling away, and have come to this state of being.'\n\n'It is in this manner, venerable sirs, that you teach us the primordial doctrine of the \"Mind-Polluting Ones.\"'\n\nThey then said this: 'It is indeed, friend Gotama, what we have heard, just as Venerable Gotama says.'\n\nAnd, Bhaggava, I know the primordial doctrine [...] what the Tathāgata fully understands does not lead him to misfortune.",
      "sinhala": "ආයුෂ්මතුනි, මනෝපදෝසික නම් දෙවිවරු සිටිති. ඔවුහු එකිනෙකා අධිකව විමසා බලති. ඔවුහු එකිනෙකා අධිකව විමසා බලමින් එකිනෙකා කෙරෙහි සිත් දූෂණය කරති. ඔවුහු එකිනෙකා කෙරෙහි දූෂිත සිත් ඇති, වෙහෙසට පත් කය ඇති, වෙහෙසට පත් සිත් ඇති අය වෙති. ඒ දෙවිවරු ඒ ලෝකයෙන් චුත වෙති. ආයුෂ්මතුනි, යම් සත්වයෙක් ඒ ලෝකයෙන් චුත වී මිනිස් ලොවට පැමිණීම සිදු වේ. මිනිස් ලොවට පැමිණි විට ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වේ. ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වූ විට තපසින් යුක්තව, වීර්යයෙන් යුක්තව, උත්සාහයෙන් යුක්තව, අප්‍රමාදයෙන් යුක්තව, මනා මෙනෙහි කිරීමකින් යුක්තව එබඳු චිත්ත සමාධියක් ස්පර්ශ කරයි. එසේ සමාධිගත වූ සිතින් ඒ පූර්ව නිවාසය සිහි කරයි, ඊට එහා සිහි නොකරයි.\n\nඔහු මෙසේ කියයි – යම් ඒ භවත් දෙවිවරු මනෝපදෝසික නොවේද, ඔවුහු අධිකව එකිනෙකා විමසා නොබලති. ඔවුහු අධිකව එකිනෙකා විමසා නොබලමින් එකිනෙකා කෙරෙහි සිත් දූෂණය නොකරති. ඔවුහු එකිනෙකා කෙරෙහි දූෂිත නොවන සිත් ඇති, වෙහෙසට පත් නොවන කය ඇති, වෙහෙසට පත් නොවන සිත් ඇති අය වෙති. ඒ දෙවිවරු ඒ ලෝකයෙන් චුත නොවෙති, නිත්‍ය, ස්ථිර, ශාශ්වත, විපරිණාමයට පත් නොවන ස්වභාව ඇතිව සදාකාලිකවම එසේම පවතිනු ඇත. යම් අප මනෝපදෝසික වූවෝද, අපි අධිකව එකිනෙකා විමසා බැලුවෙමු. අපි අධිකව එකිනෙකා විමසා බලමින් එකිනෙකා කෙරෙහි සිත් දූෂණය කළෙමු. අපි එකිනෙකා කෙරෙහි දූෂිත සිත් ඇති, වෙහෙසට පත් කය ඇති, වෙහෙසට පත් සිත් ඇති අය වූවෙමු. මෙසේ අපි ඒ ලෝකයෙන් චුත වූවෙමු, අනිත්‍ය, අස්ථිර, කෙටි ආයුෂ ඇති, චුත වන ස්වභාව ඇතිව මිනිස් ලොවට පැමිණියෙමු. ආයුෂ්මතුනි, නුඹලා මෙබඳු මනෝපදෝසික ආචාර්යවරුන් අග්‍ර යැයි පනවන්නහු යැයි.\n\nඔවුහු මෙසේ කීහ – ආයුෂ්මත් ගෞතමයන් වහන්සේ වදාරණ ලෙසම, ආයුෂ්මතුනි, අපට අසන්නට ලැබුණි. භග්ගව, අග්‍ර ඤාණය ද මම දනිමි... (පෙ)... යමක් අවබෝධ කර ඇති හෙයින් තථාගතයන් වහන්සේ විනාශයට පත් නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 45,
      "pali": "‘‘Santi, bhaggava, eke samaṇabrāhmaṇā adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapenti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te ca me evaṃ puṭṭhā ‘āmo’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘kathaṃvihitakaṃ pana tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? Te mayā puṭṭhā na sampāyanti, asampāyantā mamaññeva paṭipucchanti. Tesāhaṃ puṭṭho byākaromi –",
      "english": "Venerable sir, there are some recluses and brahmins who declare a supreme doctrine of fortuitous origination. I approach them and say, ‘Is it true, venerable sirs, that you declare a supreme doctrine of fortuitous origination?’ And they, thus questioned by me, affirm, ‘Yes.’ Then I say to them, ‘But in what manner, venerable sirs, do you declare a supreme doctrine of fortuitous origination?’ They, questioned by me, are unable to respond, and being unable to respond, they question me back. Questioned by them, I explain:",
      "sinhala": "භග්ගව, සමහර ශ්‍ර​මණ-බ්‍රාහ්මණයෝ අධිච්චසමුප්පන්න වූ ප්‍ර​ධාන ආචාර්ය මතයක් පනවති. මම ඔවුන් කරා එළඹ මෙසේ කියමි: \"ඇවැත්නි, ඔබලා අධිච්චසමුප්පන්න වූ ප්‍ර​ධාන ආචාර්ය මතයක් පනවන්නේ සැබෑවක් ද?\" මා විසින් මෙසේ විමසූ විට, ඔවුහු \"එසේය\"යි පිළිගනිති. එවිට මම මෙසේ කියමි: \"එසේ නම් ඇවැත්නි, ඔබලා කවර ආකාරයක අධිච්චසමුප්පන්න වූ ප්‍ර​ධාන ආචාර්ය මතයක් පනවන්නේද?\" මා විසින් ප්‍ර​ශ්න කරන ලද ඔවුහු පිළිතුරු දීමට අපොහොසත් වෙති. පිළිතුරු දීමට නොහැකි බැවින් ඔවුහු මටම පෙරළා ප්‍ර​ශ්න කරති. ඔවුන් විසින් ප්‍ර​ශ්න කරන ලද මම විස්තර කරමි –",
      "paliTitle": ""
    },
    {
      "number": 46,
      "pali": "‘Santāvuso, asaññasattā nāma devā. Saññuppādā ca pana te devā tamhā kāyā cavanti. ‘Ṭhānaṃ kho panetaṃ, āvuso, vijjati. Yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ [idaṃ padaṃ brahmajālasutte na dissati. evaṃ (pī. ka.)] saññuppādaṃ anussarati, tato paraṃ nānussarati. ‘So evamāha – adhiccasamuppanno attā ca loko ca. Taṃ kissa hetu? Ahañhi pubbe nāhosiṃ, somhi etarahi ahutvā santatāya [sattakāya (sī. pī.), sattāya (ka. sī.)] pariṇatoti. Evaṃvihitakaṃ no tumhe āyasmanto adhiccasamuppannaṃ ācariyakaṃ aggaññaṃ paññapethā’ti? ‘Te evamāhaṃsu – evaṃ kho no, āvuso gotama, sutaṃ yathevāyasmā gotamo āhā’ti. ‘‘Aggaññañcāhaṃ, bhaggava, pajānāmi tañca pajānāmi, tato ca uttaritaraṃ pajānāmi, tañca pajānaṃ na parāmasāmi, aparāmasato ca me paccattaññeva nibbuti viditā. Yadabhijānaṃ tathāgato no anayaṃ āpajjati.",
      "english": "\"Friends, there are gods called non-percipient beings. And with the arising of perception, those gods pass away from that realm. Indeed, friends, this is a possibility: that a certain being, having passed away from that realm, comes to this state of existence. Having come to this state of existence, he goes forth from the home life into homelessness. Having gone forth from the home life into homelessness, he applies himself to ardent endeavor, to exertion, to constant application, to diligence, to right attention, and thereby attains such a concentration of mind that, with his mind thus concentrated, he recollects the arising of that perception, but does not recollect beyond that. He then says: 'The self and the world arose without cause.' 'For what reason?' 'Because I did not exist before, but now I am, having emerged into being from non-existence.' 'Venerable Ones, is it such a teaching of spontaneous generation, a foremost doctrine, that you proclaim?' They replied: 'It is indeed, Venerable Gotama, as you have said, that we have heard it.'\"\n\n\"Bhaggava, I know their foremost doctrine, and I know that, and I know what is even more superior to that. And knowing it, I do not cling to it. And not clinging, liberation is personally known to me. By comprehending this, the Tathagata does not fall into error.\"",
      "sinhala": "ආයුෂ්මතුනි, අසඤ්ඤසත්ත නම් දෙවිවරු සිටිති. නමුත් සංඥාව පහළවීමෙන් ඒ දෙවිවරු ඒ කයෙන් චුත වෙති. ආයුෂ්මතුනි, මෙබඳු අවස්ථාවක් තිබේ. යම් සත්වයෙක් ඒ කයෙන් චුත වී මේ මිනිස් ලොවට පැමිණෙයි. මේ තත්ත්වයට පැමිණි පසු, ඔහු ගිහි ගෙයින් නික්ම අනගාරිකත්වයෙහි පැවිදි වෙයි. ගිහි ගෙයින් නික්ම අනගාරිකත්වයෙහි පැවිදි වූ පසු, ඔහු වීර්යයෙන්, ප‍්‍රධානයෙන්, නොනැවතී උත්සාහ කිරීමෙන්, අප‍්‍රමාදයෙන් හා මනා මෙනෙහි කිරීමෙන්, එවැනි චිත්ත සමාධියක් ලබයි. එසේ සමාධිගත වූ සිතින්, ඔහු ඒ සංඥාව පහළවීම සිහි කරයි; ඊට පෙර දෙයක් සිහි නොකරයි.\n\nඔහු මෙසේ කියයි: ‘ආත්මයද, ලෝකයද අහේතුකව හටගත්තේය. එයට හේතුව කුමක්ද? මම පෙර සිටියේ නැත, නමුත් දැන් මම නොවී සිටි නමුත්, දැන් පවතින බවට පත් වී ඇත.’ ‘ආයුෂ්මතුනි, ඔබලා මේ ආකාරයෙන්, අහේතුකව හටගන්නා ලද මේ ආචාර්යවාදය අග‍්‍ර කොට ප‍්‍රකාශ කරන්නහුද?’ ඔවුහු මෙසේ කීහ: ‘ගෞතම ආයුෂ්මතුනි, ආයුෂ්මත් ගෞතමයන් වහන්සේ පැවසූ ආකාරයටම අපට එසේ අසන්නට ලැබුණි.’\n\nභග්ගව, මම මේ අග‍්‍ර දේ දනිමි, ඒ දේ ද දනිමි, ඊටත් වඩා උසස් දේ දනිමි. ඒ දන්නා දෙයෙහි නොඇලෙමි. නොඇලුණු හෙයින් මට තමා තුළම නිවන ප‍්‍රත්‍යක්ෂ විය. යමක් මනාකොට අවබෝධ කිරීමෙන් තථාගතයන් වහන්සේ පිරිහීමකට පත් නොවෙති.",
      "paliTitle": ""
    },
    {
      "number": 47,
      "pali": "‘‘Evaṃvādiṃ kho maṃ, bhaggava, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘viparīto samaṇo gotamo bhikkhavo ca. Samaṇo gotamo evamāha – yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, sabbaṃ tasmiṃ samaye asubhantveva [asubhanteva (sī. syā. pī.)] pajānātī’ti [sañjānātīti (sī. pī.)]. Na kho panāhaṃ, bhaggava, evaṃ vadāmi – ‘yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, sabbaṃ tasmiṃ samaye asubhantveva pajānātī’ti. Evañca khvāhaṃ, bhaggava, vadāmi – ‘yasmiṃ samaye subhaṃ vimokkhaṃ upasampajja viharati, subhantveva tasmiṃ samaye pajānātī’ti. ‘‘Te ca, bhante, viparītā, ye bhagavantaṃ viparītato dahanti bhikkhavo ca. Evaṃpasanno ahaṃ, bhante, bhagavati. Pahoti me bhagavā tathā dhammaṃ desetuṃ, yathā ahaṃ subhaṃ vimokkhaṃ upasampajja vihareyya’’nti.",
      "english": "\"Bhaggava, some ascetics and brahmins falsely, vainly, untruthfully, and groundlessly misrepresent me, speaking and explaining thus: ‘The recluse Gotama and his bhikkhus are mistaken. The recluse Gotama says this: “When one enters and dwells in the beautiful liberation, at that time one perceives everything as unbeautiful.”’ But I, Bhaggava, do not say this: ‘When one enters and dwells in the beautiful liberation, at that time one perceives everything as unbeautiful.’ Instead, Bhaggava, I say this: ‘When one enters and dwells in the beautiful liberation, at that time one perceives everything as beautiful.’\n\n\"Those, Venerable Sir, are indeed mistaken who misrepresent the Blessed One and his bhikkhus as mistaken. So deeply confident am I, Venerable Sir, in the Blessed One. The Blessed One is able to teach me the Dhamma in such a way that I myself might enter and dwell in the beautiful liberation.\"",
      "sinhala": "භග්ගව, මා මෙසේ වදාරන්නා වූද, මෙසේ දේශනා කරන්නා වූද සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ සත්‍යයෙන් තොරව, හිස් අයුරින්, අසත්‍යයෙන්, අභූතයෙන් චෝදනා කරති: ‘ශ්‍රමණ ගෞතමයන් වහන්සේත් භික්ෂූනුත් විපරීත ය. ශ්‍රමණ ගෞතමයන් වහන්සේ මෙසේ කියන සේක: යම් කලෙක සුභ විමෝක්ෂය උපදවාගෙන වාසය කරයිද, ඒ කල සකල වස්තුව අසුභය යැයිම ප්‍රඥාවෙන් දකී’ කියා. එහෙත් භග්ගව, මම මෙසේ නොකියමි: ‘යම් කලෙක සුභ විමෝක්ෂය උපදවාගෙන වාසය කරයිද, ඒ කල සකල වස්තුව අසුභය යැයිම ප්‍රඥාවෙන් දකී’ කියා. භග්ගව, මම නම් මෙසේ කියමි: ‘යම් කලෙක සුභ විමෝක්ෂය උපදවාගෙන වාසය කරයිද, ඒ කල සකල වස්තුව සුභය යැයිම ප්‍රඥාවෙන් දකී’ කියා.\n\nවහන්ස, භාග්‍යවතුන් වහන්සේ සහ භික්ෂූන් වහන්සේලා විපරීත යැයි සලකන යම් අය වෙත්ද, ඔවුහුම විපරීත වෙති. වහන්ස, මම භාග්‍යවතුන් වහන්සේ කෙරෙහි මෙසේම ප්‍රසන්න වෙමි. භාග්‍යවතුන් වහන්සේට මා හට සුභ විමෝක්ෂය උපදවාගෙන වාසය කිරීමට හැකි වන සේ ධර්මය දේශනා කිරීමට පුළුවන.",
      "paliTitle": ""
    },
    {
      "number": 48,
      "pali": "‘‘Dukkaraṃ kho etaṃ, bhaggava, tayā aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena subhaṃ vimokkhaṃ upasampajja viharituṃ. Iṅgha tvaṃ, bhaggava, yo ca te ayaṃ mayi pasādo, tameva tvaṃ sādhukamanurakkhā’’ti. ‘‘Sace taṃ, bhante, mayā dukkaraṃ aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena subhaṃ vimokkhaṃ upasampajja viharituṃ. Yo ca me ayaṃ, bhante, bhagavati pasādo, tamevāhaṃ sādhukamanurakkhissāmī’’ti. Idamavoca bhagavā. Attamano bhaggavagotto paribbājako bhagavato bhāsitaṃ abhinandīti.",
      "english": "\"Indeed, Bhaggava, it is difficult for you, holding a different view, having a different acceptance, a different preference, pursuing a different path, and living a different way of life, to attain and dwell in the pure liberation. Well then, Bhaggava, as for this confidence you have in me, you should carefully preserve that very confidence.\" \"If, Venerable Sir, it is indeed difficult for me, holding a different view, having a different acceptance, a different preference, pursuing a different path, and living a different way of life, to attain and dwell in the pure liberation, then as for this confidence I have in the Blessed One, Venerable Sir, I will carefully preserve that very confidence.\" The Blessed One said this. The wanderer of the Bhaggava clan, delighted in mind, rejoiced in the Blessed One's words.",
      "sinhala": "භග්ගවය, වෙනත් දෘෂ්ටීන් ඇති, වෙනත් ඉවසීම් ඇති, වෙනත් රුචීන් ඇති, වෙනත් පිළිවෙත් අනුගමනය කරන, වෙනත් ජීවන රටාවක් ඇති නුඹට ශුභ විමුක්තියට එළඹ වාසය කිරීම දුෂ්කරය. එහෙයින් භග්ගවය, නුඹට මා කෙරෙහි ඇති මේ පැහැදීම හොඳින් ආරක්ෂා කරගනු මැනවි.\n\nභන්තේ, යම් හෙයකින් වෙනත් දෘෂ්ටීන් ඇති, වෙනත් ඉවසීම් ඇති, වෙනත් රුචීන් ඇති, වෙනත් පිළිවෙත් අනුගමනය කරන, වෙනත් ජීවන රටාවක් ඇති මට ශුභ විමුක්තියට එළඹ වාසය කිරීම දුෂ්කර නම්, භන්තේ, භාග්‍යවතුන් වහන්සේ කෙරෙහි මට ඇති මේ පැහැදීම මම හොඳින් ආරක්ෂා කරගන්නෙමි.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. භග්ගවගොත්ත පරිබ්‍රාජකයා ප්‍රීතිමත් සිත් ඇතිව භාග්‍යවතුන් වහන්සේගේ බස් වහර අභිනන්දනය කළේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Pāthikasuttaṃ [pāṭikasuttantaṃ (sī. syā. kaṃ. pī.)] niṭṭhitaṃ paṭhamaṃ.",
    "english": "First Pāthika Sutta Concluded.",
    "sinhala": "පළමු පාඨික සූත‍්‍රය නිමි."
  }
}