{
  "id": "dn10",
  "title": {
    "pali": "Saṅgītisuttaṃ",
    "english": "Saṅgītisuttaṃ",
    "sinhala": "සංගීති සූත්‍රය"
  },
  "sections": [
    {
      "number": 296,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā mallesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena pāvā nāma mallānaṃ nagaraṃ tadavasari. Tatra sudaṃ bhagavā pāvāyaṃ viharati cundassa kammāraputtassa ambavane. ",
      "english": "Thus have I heard: At one time the Blessed One was wandering among the Mallas, together with a large Saṅgha of monks, about five hundred monks in all, and arrived at Pāvā, a town of the Mallas. There the Blessed One was staying at Pāvā, in the mango grove of Cunda the metalworker's son.",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ මහත් භික්ෂු සංඝයා සමඟ මල්ල රාජ්‍යයේ සැරිසරමින් පන්සියයක් පමණ භික්ෂූන් පිරිවරාගෙන මල්ලවරුන්ගේ පාවා නම් නගරයට පැමිණියහ. ඒ භාග්‍යවතුන් වහන්සේ පාවා නුවර චුන්ද නම් කම්මල්කරුගේ අඹ වනයේ වැඩ වාසය කළහ.",
      "paliTitle": ""
    },
    {
      "number": 297,
      "pali": "Tena kho pana samayena pāveyyakānaṃ mallānaṃ ubbhatakaṃ nāma navaṃ sandhāgāraṃ [santhāgāraṃ (sī. pī.), saṇṭhāgāraṃ (syā. kaṃ.)] acirakāritaṃ hoti anajjhāvuṭṭhaṃ [anajjhāvutthaṃ (sī. syā. pī. ka.)] samaṇena vā brāhmaṇena vā kenaci vā manussabhūtena. Assosuṃ kho pāveyyakā mallā – ‘‘bhagavā kira mallesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi pāvaṃ anuppatto pāvāyaṃ viharati cundassa kammāraputtassa ambavane’’ti. Atha kho pāveyyakā mallā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho pāveyyakā mallā bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, pāveyyakānaṃ mallānaṃ ubbhatakaṃ nāma navaṃ sandhāgāraṃ acirakāritaṃ hoti anajjhāvuṭṭhaṃ samaṇena vā brāhmaṇena vā kenaci vā manussabhūtena. Tañca kho, bhante, bhagavā paṭhamaṃ paribhuñjatu, bhagavatā paṭhamaṃ paribhuttaṃ pacchā pāveyyakā mallā paribhuñjissanti. Tadassa pāveyyakānaṃ mallānaṃ dīgharattaṃ hitāya sukhāyā’’ti. Adhivāsesi kho bhagavā tuṇhībhāvena.",
      "english": "Now at that time, the Mallas of Pava had a newly built assembly hall called Ubbhataka, not long completed, which had not been occupied by any ascetic, brahmin, or anyone of human birth. The Mallas of Pava heard, \"The Blessed One, while wandering on tour among the Mallas with a great Sangha of monks, with about five hundred monks, has arrived at Pava and is staying in Cunda the smith's mango grove in Pava.\" Then the Mallas of Pava approached the Blessed One; having approached, they paid homage to the Blessed One and sat down to one side. Sitting to one side, the Mallas of Pava said this to the Blessed One: \"Here, Lord, the Mallas of Pava have a newly built assembly hall called Ubbhataka, not long completed, which has not been occupied by any ascetic, brahmin, or anyone of human birth. Let the Blessed One use it first, Lord; after it has been used first by the Blessed One, then the Mallas of Pava will use it. That will be for the long-term benefit and happiness of the Mallas of Pava.\" The Blessed One accepted by remaining silent.",
      "sinhala": "එකල්හි පාවෙය්‍යකයන්ගේ මල්ලවයන්ට අභිනවයෙන් කරවන ලද, කිසිම ශ්‍රමණ බ්‍රාහ්මණයෙකු විසින් හෝ මනුෂ්‍ය භූතයෙකු විසින් හෝ තවම භාවිතා නොකරන ලද උබ්භටක නම් නව සන්‍ථාගාරයක් විය. පාවෙය්‍යක මල්ලවයෝ මෙසේ ඇසූහ: “භාග්‍යවතුන් වහන්සේ මල්ලව රාජ්‍යයේ සැරිසරමින් මහත් භික්ෂු සංඝයා සමඟ පන්සියයක් පමණ භික්ෂූන් පිරිවරා පාවා නුවරට පැමිණ කුණ්ඩලකේසි කම්මාරපුත්‍රයාගේ අඹ වනයේ වැඩ වසන සේකැ”යි. ඉක්බිති පාවෙය්‍යක මල්ලවයෝ භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක හුන්හ. එකත්පසෙක හුන් පාවෙය්‍යක මල්ලවයෝ භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: “ස්වාමීනි, මෙහි පාවෙය්‍යකයන්ගේ මල්ලවයන්ට අභිනවයෙන් කරවන ලද, කිසිම ශ්‍රමණ බ්‍රාහ්මණයෙකු විසින් හෝ මනුෂ්‍ය භූතයෙකු විසින් හෝ තවම භාවිතා නොකරන ලද උබ්භටක නම් නව සන්‍ථාගාරයක් ඇත. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ එය පළමුව භාවිතා කළ මැනව. භාග්‍යවතුන් වහන්සේ විසින් පළමුව භාවිතා කළ පසු පාවෙය්‍යක මල්ලවයෝ භාවිතා කරති. එය පාවෙය්‍යකයන්ගේ මල්ලවයන්ට බොහෝ කලක් හිත සුව පිණිස වන්නේය.” භාග්‍යවතුන් වහන්සේ නිහඬතාවයෙන් එය ඉවසා වදාළ සේක.",
      "paliTitle": "Ubbhatakanavasandhāgāraṃ",
      "englishTitle": "New Unroofed Assembly Hall",
      "sinhalaTitle": "නව එළිමහන් සභා ශාලාව"
    },
    {
      "number": 298,
      "pali": "Atha kho pāveyyakā mallā bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā yena sandhāgāraṃ tenupasaṅkamiṃsu; upasaṅkamitvā sabbasanthariṃ [sabbasanthariṃ santhataṃ (ka.)] sandhāgāraṃ santharitvā bhagavato āsanāni paññāpetvā udakamaṇikaṃ patiṭṭhapetvā telapadīpaṃ āropetvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho te pāveyyakā mallā bhagavantaṃ etadavocuṃ – ‘‘sabbasantharisanthataṃ [sabbasanthariṃ santhataṃ (sī. pī. ka.)], bhante, sandhāgāraṃ, bhagavato āsanāni paññattāni, udakamaṇiko patiṭṭhāpito, telapadīpo āropito. Yassadāni, bhante, bhagavā kālaṃ maññatī’’ti.",
      "english": "Then the Mallas of Pava, knowing of the Blessed One's acceptance, rose from their seats, bowed down to the Blessed One, circumambulated him, and approached the assembly hall. Having approached, they spread out the assembly hall completely covered with a layer, arranged seats for the Blessed One, placed a water pot, and lit an oil lamp, and then approached the Blessed One. Having approached, they bowed down to the Blessed One and stood to one side. Standing to one side, those Mallas of Pava said this to the Blessed One: \"The assembly hall, Venerable Sir, is completely covered with a layer, seats have been arranged for the Blessed One, a water pot has been placed, and an oil lamp has been lit. Now is the time, Venerable Sir, for the Blessed One to do as he deems fit.\"",
      "sinhala": "ඉක්බිති පාවෙය්‍යක මල්ලවරු භාග්‍යවතුන් වහන්සේගේ අධිවාසනය දැන, ආසනවලින් නැඟිට භාග්‍යවතුන් වහන්සේට වැඳ ප්‍රදක්ෂිණා කොට යම් සන්‍ථාගාරයක් වේද, එතැනට පැමිණියහ. පැමිණ සියලු අතුරුතුරු ඇති සන්‍ථාගාරය අතුරවා, භාග්‍යවතුන් වහන්සේ උදෙසා අසුන් පනවා, පැන් කළය තබා, තෙල් පහන දල්වා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක සිටියහ. එකත්පසෙක සිටි ඒ පාවෙය්‍යක මල්ලවරු භාග්‍යවතුන් වහන්සේට මෙය පැවසුවෝය: “ස්වාමීනී, සන්‍ථාගාරය සියලු අතුරුතුරු ඇතිව අතුරන ලද්දේය. භාග්‍යවතුන් වහන්සේ උදෙසා අසුන් පනවන ලද්දේය. පැන් කළය තබන ලද්දේය. තෙල් පහන දල්වන ලද්දේය. ස්වාමීනී, භාග්‍යවතුන් වහන්සේ දැන් කාලය යයි සිතන දෙයක් වේ නම් (කළ මැනව)”යි.",
      "paliTitle": ""
    },
    {
      "number": 299,
      "pali": "Atha kho bhagavā nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena sandhāgāraṃ tenupasaṅkami; upasaṅkamitvā pāde pakkhāletvā sandhāgāraṃ pavisitvā majjhimaṃ thambhaṃ nissāya puratthābhimukho nisīdi. Bhikkhusaṅghopi kho pāde pakkhāletvā sandhāgāraṃ pavisitvā pacchimaṃ bhittiṃ nissāya puratthābhimukho nisīdi bhagavantaṃyeva purakkhatvā. Pāveyyakāpi kho mallā pāde pakkhāletvā sandhāgāraṃ pavisitvā puratthimaṃ bhittiṃ nissāya pacchimābhimukhā nisīdiṃsu bhagavantaṃyeva purakkhatvā. Atha kho bhagavā pāveyyake malle bahudeva rattiṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uyyojesi – ‘‘abhikkantā kho, vāseṭṭhā, ratti. Yassadāni tumhe kālaṃ maññathā’’ti. ‘‘Evaṃ, bhante’’ti kho pāveyyakā mallā bhagavato paṭissutvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkamiṃsu.",
      "english": "Then the Blessed One, having dressed, taking his bowl and robe, approached the assembly hall together with the Sangha of monks. Having approached, having washed his feet, having entered the assembly hall, he sat down facing east, leaning against the middle pillar. The Sangha of monks also, having washed their feet, having entered the assembly hall, sat down facing east, leaning against the western wall, keeping the Blessed One in front of them. The Mallas of Pava also, having washed their feet, having entered the assembly hall, sat down facing west, leaning against the eastern wall, keeping the Blessed One in front of them. Then the Blessed One, having instructed, encouraged, aroused, and delighted the Mallas of Pava with a Dhamma talk far into the night, dismissed them, saying: \"The night is far advanced, Vasetthas. Now is the time for you to do as you think fit.\" \"So be it, venerable sir,\" the Mallas of Pava replied to the Blessed One. Rising from their seats, they paid homage to the Blessed One, circumambulated him, and departed.",
      "sinhala": "ඉක්බිති භාග්‍යවතුන් වහන්සේ සිවුරු හැඳ පට සිවුරු ගෙන භික්ෂු සංඝයා සමඟ යම් තැනෙක සන්‍ථාගාරයක් (රැස්වීම් ශාලාවක්) ඇත්ද, එහි වැඩම කළහ. වැඩම කර පාද සෝදා සන්‍ථාගාරයට පිවිස මැද කණුවට හේත්තු වී නැගෙනහිර දිශාව බලා වැඩසිටියහ. භික්ෂු සංඝයා ද පාද සෝදා සන්‍ථාගාරයට පිවිස බටහිර බිත්තියට හේත්තු වී භාග්‍යවතුන් වහන්සේ පෙරටු කරගෙන නැගෙනහිර දිශාව බලා වැඩසිටියහ. පාවෙය්‍යක මල්ලවරු ද පාද සෝදා සන්‍ථාගාරයට පිවිස නැගෙනහිර බිත්තියට හේත්තු වී භාග්‍යවතුන් වහන්සේ පෙරටු කරගෙන බටහිර දිශාව බලා උන්නාහුය. ඉක්බිති භාග්‍යවතුන් වහන්සේ පාවෙය්‍යක මල්ලවරුන්ට බොහෝ රාත්‍රියක් ධර්ම කථාවෙන් කරුණු දක්වා සමාදන් කරවා උත්තේජනය කරවා සතුටු කරවා පිටත් කර හැරියහ. “වාසෙට්ඨයෙනි, රාත්‍රිය බොහෝ ඉක්ම ගියාය. දැන් නුඹලා යා යුතු කාලය දනිව්” යයි වදාළහ. “එසේය, ස්වාමීනි” යැයි පාවෙය්‍යක මල්ලවරු භාග්‍යවතුන් වහන්සේට පිළිතුරු දී ආසනයෙන් නැගිට භාග්‍යවතුන් වහන්සේට වැඳ පැදකුණු කොට පිටත්ව ගියහ.",
      "paliTitle": ""
    },
    {
      "number": 300,
      "pali": "Atha kho bhagavā acirapakkantesu pāveyyakesu mallesu tuṇhībhūtaṃ tuṇhībhūtaṃ bhikkhusaṃghaṃ anuviloketvā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘vigatathinamiddho [vigatathīnamiddho (sī. syā. kaṃ. pī.)] kho, sāriputta, bhikkhusaṅgho. Paṭibhātu taṃ, sāriputta, bhikkhūnaṃ dhammīkathā. Piṭṭhi me āgilāyati. Tamahaṃ āyamissāmī’’ti [āyameyyāmīti (syā. kaṃ.)]. ‘‘Evaṃ, bhante’’ti kho āyasmā sāriputto bhagavato paccassosi. Atha kho bhagavā catugguṇaṃ saṅghāṭiṃ paññapetvā dakkhiṇena passena sīhaseyyaṃ kappesi pāde pādaṃ accādhāya, sato sampajāno uṭṭhānasaññaṃ manasi karitvā.",
      "english": "Then the Blessed One, after the Mallas of Pava had departed not long after, having surveyed the Sangha of monks who were silent, utterly silent, addressed the venerable Sariputta: \"The Sangha of monks, Sariputta, is free from sloth and torpor. Let a Dhamma talk occur to you, Sariputta, for the monks. My back is aching. I will stretch it.\" \"Even so, venerable sir,\" the venerable Sariputta replied to the Blessed One. Then the Blessed One, having folded his outer robe in four, arranged it and lay down on his right side in the lion's posture, placing one foot on the other, mindful and fully aware, focusing in his mind on the thought of rising.",
      "sinhala": "ඉක්බිති භාග්‍යවතුන් වහන්සේ පාවෙය්‍යක මල්ලවරුන් පිටත්ව ගොස් ටික වේලාවකින් නිශ්ශබ්ද වූ, නිශ්ශබ්ද වූ භික්ෂු සංඝයා දෙස බලා ආයුෂ්මත් සාරිපුත්තයන් ඇමතූ සේක: “සාරිපුත්තය, භික්ෂු සංඝයාගේ ථීනමිද්ධය පහව ගොස් ඇත. සාරිපුත්තය, ඔබට භික්ෂූන් උදෙසා ධර්ම කථාවක් බැබළේවා. මගේ පිට කොන්ද රිදෙනවා. මම එය දිගු කරන්නෙමි.” “එසේය, ස්වාමීනි” යයි ආයුෂ්මත් සාරිපුත්තයන් භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය. ඉක්බිති භාග්‍යවතුන් වහන්සේ සිවුගුණයක් කළ සඟළ වස්ත්‍රය පනවා දකුණු ඇලයෙන් සිංහ සෙයියාව කල්පනා කළේ පාදයක් පාදයක් මත තබා සිහියෙන් හා නුවණින් යුතුව නැගිටීමේ සඤ්ඤාව මනසෙහි තබාගෙනය.",
      "paliTitle": ""
    },
    {
      "number": 301,
      "pali": "Tena kho pana samayena nigaṇṭho nāṭaputto pāvāyaṃ adhunākālaṅkato hoti. Tassa kālaṅkiriyāya bhinnā nigaṇṭhā dvedhikajātā [ddheḷhakajātā (syā. kaṃ.)] bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti [vicaranti (syā. kaṃ.)] – ‘‘na tvaṃ imaṃ dhammavinayaṃ ājānāsi, ahaṃ imaṃ dhammavinayaṃ ājānāmi, kiṃ tvaṃ imaṃ dhammavinayaṃ ājānissasi! Micchāpaṭipanno tvamasi, ahamasmi sammāpaṭipanno. Sahitaṃ me, asahitaṃ te. Purevacanīyaṃ pacchā avaca, pacchāvacanīyaṃ pure avaca. Adhiciṇṇaṃ te viparāvattaṃ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosī’’ti. Vadhoyeva kho maññe nigaṇṭhesu nāṭaputtiyesu vattati. Yepi [yepi te (sī. pī.)] nigaṇṭhassa nāṭaputtassa sāvakā gihī odātavasanā, tepi nigaṇṭhesu nāṭaputtiyesu nibbinnarūpā virattarūpā paṭivānarūpā, yathā taṃ durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite bhinnathūpe appaṭisaraṇe.",
      "english": "At that time, Nigantha Nataputta had recently died in Pava. With his death, the Niganthas were split, divided into two factions, quarrelsome, given to contention, addicted to disputes, attacking each other with verbal weapons: \"You don't understand this Doctrine and Discipline, I understand this Doctrine and Discipline! How could you understand this Doctrine and Discipline? You are practicing wrongly, I am practicing rightly. What I say is consistent, what you say is inconsistent. You said what should be said earlier later, and you said what should be said later earlier. What you have long practiced is overturned. Your doctrine has been refuted, you are defeated, go away to disentangle yourself, or disentangle yourself if you can!\" It was as if slaughter itself was occurring among the Niganthas, the followers of Nataputta. And those lay disciples of Nigantha Nataputta, wearing white clothes, were disgusted, disaffected, and turned away from the Niganthas, because of that Doctrine and Discipline that was badly proclaimed, poorly expounded, not leading out, not conducive to peace, not proclaimed by a fully enlightened Buddha, having a broken stupa, without refuge.",
      "sinhala": "එසමයෙහි නාථපුත්‍ර වූ නිගණ්ඨයා පාවා නුවරදී මෑතකදී මියගියේ විය. ඔහු මිය යාමෙන් පසු නිගණ්ඨයෝ භේද වූවෝ ද්වෛධික වූවෝ [දෙපක්ෂ වූවෝ] විවාද කරන්නෝ කලහ කරන්නෝ වාද විවාද කරන්නෝ එකිනෙකා මුඛසත්තිවලින් අනිනු ලබමින් වාසය කෙරති. \"නුඹ මේ ධර්ම විනය නො දන්නෙහි. මම මේ ධර්ම විනය දනිමි. නුඹ මේ ධර්ම විනය කෙසේ දැන ගන්නෙහි ද? නුඹ මිථ්‍යා ප්‍රතිපන්නයෙක් වෙහි. මම සම්මා ප්‍රතිපන්නයෙක් වෙමි. මාගේ මතය නිවැරදි ය. නුඹේ මතය නිවැරදි නොවේ. පළමුව කිවයුතු දෙය පසුව කීවෙහි. පසුව කිවයුතු දෙය පළමුව කීවෙහි. නුඹ විසින් පුරුදු කරන ලද්ද විපරීතය. නුඹේ වාදය ආරෝපණය කරන ලදී. නුඹ හෙළා දකින ලද්දේ වෙහි. වාදයෙන් මිදීම පිණිස හැසිරෙව. හැකි නම් වාදය බිඳ හෙළව\"යි කියමින් ඔවුහු වාද කරති. නාථපුත්‍ර වූ නිගණ්ඨයන් කෙරෙහි වධයක් මෙන් ඇත්තේ යයි මම සිතමි. යම් නාථපුත්‍ර වූ නිගණ්ඨයන්ගේ ශ්‍රාවකයෝ ගිහි සුදු වස්ත්‍ර ඇත්තෝ වෙත් ද, ඔහු ද නාථපුත්‍ර වූ නිගණ්ඨයන් කෙරෙහි කලකිරුණු ස්වභාව ඇත්තෝ ද, විරක්ත ස්වභාව ඇත්තෝ ද, පිළිකුල් ස්වභාව ඇත්තෝ ද වෙති. මන්ද යත්, එය දුර්‍ව්‍යාඛ්‍යාත වූ ධර්ම විනයක් ද, දුර්‍ප්‍රවේදිත වූ ධර්ම විනයක් ද, නිවන කරා නො යන එකක් ද, උපසමයට නො පමුණුවන්නක් ද, සම්මා සම්බුදුන් විසින් නො දේශනා කරන ලද්දක් ද, බිඳුණු ස්තූපයක් මෙන් වූවාක් ද, පිළිසරණක් රහිත වූවක් ද වෙයි.",
      "paliTitle": "Bhinnanigaṇṭhavatthu",
      "englishTitle": "The Schism of the Niganthas",
      "sinhalaTitle": "භින්න නිගණ්ඨ වස්තුව"
    },
    {
      "number": 302,
      "pali": "Atha kho āyasmā sāriputto bhikkhū āmantesi – ‘‘nigaṇṭho, āvuso, nāṭaputto pāvāyaṃ adhunākālaṅkato, tassa kālaṅkiriyāya bhinnā nigaṇṭhā dvedhikajātā…pe… bhinnathūpe appaṭisaraṇe’’. ‘‘Evañhetaṃ, āvuso, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite. Ayaṃ kho panāvuso amhākaṃ [asmākaṃ (pī.)] bhagavatā [bhagavato (ka. sī.)] dhammo svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Tattha sabbeheva saṅgāyitabbaṃ, na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. ‘‘Katamo cāvuso, amhākaṃ bhagavatā [bhagavato (ka. sī.)] dhammo svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito; yattha sabbeheva saṅgāyitabbaṃ, na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ? ",
      "english": "Then venerable Sāriputta addressed the monks, \"Friends, Nigaṇṭha Nātaputta has recently died in Pāvā. With his death, the Nigaṇṭhas are split into two factions... ending in split factions with no refuge.\" \"That is how it is, friends, when the Dhamma and discipline are poorly taught and proclaimed, not leading out, not leading to peace, not proclaimed by a rightly self-awakened one. But friends, this Dhamma of ours has been well-proclaimed by the Blessed One, well-taught, leading out, leading to peace, proclaimed by a rightly self-awakened one. In that, all should gather together in concord, not argue, so that this holy life might be long-lasting and endure for a long time, and that will be for the benefit of many people, for the happiness of many people, out of compassion for the world, for the welfare, benefit, and happiness of gods and humans.\" \"And what, friends, is this Dhamma that has been well-proclaimed by our Blessed One, well-taught, leading out, leading to peace, proclaimed by a rightly self-awakened one; in which all should gather together in concord, not argue, so that this holy life might be long-lasting and endure for a long time, and that will be for the benefit of many people, for the happiness of many people, out of compassion for the world, for the welfare, benefit, and happiness of gods and humans?\"",
      "sinhala": "එවිට ආයුෂ්මත් සාරිපුත්තයන් වහන්සේ භික්ෂූන් ඇමතූහ: “ඇවැත්නි, නිගණ්ඨ නාථපුත්‍රයා පාවා නුවරදී මෑතකදී කාලක්‍රියා කළේය. ඔහුගේ මරණයෙන් පසු නිගණ්ඨයෝ භේද වූහ, දෙපක්ෂ වූහ…පෙ… භින්න වූ ස්ථූප ඇතිව ප්‍රතිසරණ රහිත වූහ.” “ඇවැත්නි, මෙය මෙසේම වන්නේය. මන්ද යත් ධර්ම විනය දුර්‍ව්‍යාඛ්‍යාත වූ විට, දුර්‍ප්‍රකාශිත වූ විට, නිඃයානික නොවන විට, උපසමයට නොපමුණුවන විට, සම්මා සම්බුද්ධ දේශිත නොවන විට මෙසේ වෙයි. ඇවැත්නි, අපගේ භාග්‍යවතුන් වහන්සේ විසින් ධර්මය ස්වාක්ඛ්‍යාතය, සුප්‍රකාශිතය, නිඃයානිකය, උපසමයට පමුණුවන්නකි, සම්මා සම්බුද්ධ දේශිතය. එහිදී සියල්ලෝම එක්ව ගායනා කළ යුතුය, විවාද නොකළ යුතුය. එසේ කළහොත් මේ බ්‍රහ්මචර්යාව බොහෝ කල් පවතී, චිරස්ථිතියක් වේ. එය බොහෝ ජනයාගේ හිතසුව පිණිස, ලෝකානුකම්පාව පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිතසුව පිණිස හේතු වන්නේය.” “ඇවැත්නි, අපගේ භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත, සුප්‍රකාශිත, නිඃයානික, උපසමයට පමුණුවන්නා වූ, සම්මා සම්බුද්ධ දේශිත ධර්මය කවරේද? එහිදී සියල්ලෝම එක්ව ගායනා කළ යුතුය, විවාද නොකළ යුතුය. එසේ කළහොත් මේ බ්‍රහ්මචර්යාව බොහෝ කල් පවතී, චිරස්ථිතියක් වේ. එය බොහෝ ජනයාගේ හිතසුව පිණිස, ලෝකානුකම්පාව පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිතසුව පිණිස හේතු වන්නේද?”",
      "paliTitle": ""
    },
    {
      "number": 303,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena eko dhammo sammadakkhāto. Tattha sabbeheva saṅgāyitabbaṃ, na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Katamo eko dhammo? Sabbe sattā āhāraṭṭhitikā. Sabbe sattā saṅkhāraṭṭhitikā. Ayaṃ kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena eko dhammo sammadakkhāto. Tattha sabbeheva saṅgāyitabbaṃ, na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. ",
      "english": "\"Friends, there is one principle well-proclaimed by that Blessed One, the knowing, the seeing, the worthy one, the fully self-awakened one. Therein, all should agree, and not dispute, so that this holy life might be long-lasting and enduring, for the benefit of the many, for the happiness of the many, out of compassion for the world, for the welfare, benefit, and happiness of gods and humans. What is that one principle? All beings are sustained by nutriment. All beings are sustained by conditions. This, friends, is the one principle well-proclaimed by that Blessed One, the knowing, the seeing, the worthy one, the fully self-awakened one. Therein, all should agree, and not dispute, so that this holy life might be long-lasting and enduring, for the benefit of the many, for the happiness of the many, out of compassion for the world, for the welfare, benefit, and happiness of gods and humans.\"",
      "sinhala": "“ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අර්හත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් එක් ධර්මයක් මැනවින් දේශනා කරන ලදී. එහි සියල්ලෝම එක්ව ගායනා කළ යුතුයි. විවාද නොකළ යුතුයි. යම්සේ මේ බ්‍ර‍හ්මචරියාව දීර්ඝායු වේද, චිරස්ථායි වේද, එය බොහෝ ජනයාගේ හිත සුව පිණිසද, ලෝකානුකම්පාව පිණිසද, දෙව් මිනිසුන්ගේ අර්ථය, හිතසුව පිණිසද වන්නේය. කවර නම් ඒ එක් ධර්මය ද යත්, සියලු සත්ත්වයෝ ආහාර නිසා පවතීති. සියලු සත්ත්වයෝ සංස්කාර නිසා පවතීති. ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අර්හත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් එක් ධර්මයක් මැනවින් දේශනා කරන ලදී. එහි සියල්ලෝම එක්ව ගායනා කළ යුතුයි. විවාද නොකළ යුතුයි. යම්සේ මේ බ්‍ර‍හ්මචරියාව දීර්ඝායු වේද, චිරස්ථායි වේද, එය බොහෝ ජනයාගේ හිත සුව පිණිසද, ලෝකානුකම්පාව පිණිසද, දෙව් මිනිසුන්ගේ අර්ථය, හිතසුව පිණිසද වන්නේය.”",
      "paliTitle": "Ekakaṃ",
      "englishTitle": "The Unit",
      "sinhalaTitle": "ඒකකය"
    },
    {
      "number": 304,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena dve dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ, na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Katame dve [dve dhammo (syā. kaṃ.) evamuparipi]? ‘‘Nāmañca rūpañca. ‘‘Avijjā ca bhavataṇhā ca. ‘‘Bhavadiṭṭhi ca vibhavadiṭṭhi ca. ‘‘Ahirikañca [ahirīkañca (katthaci)] anottappañca. ‘‘Hirī ca ottappañca. ‘‘Dovacassatā ca pāpamittatā ca. ‘‘Sovacassatā ca kalyāṇamittatā ca. ‘‘Āpattikusalatā ca āpattivuṭṭhānakusalatā ca. ‘‘Samāpattikusalatā ca samāpattivuṭṭhānakusalatā ca. ‘‘Dhātukusalatā ca manasikārakusalatā ca. ‘‘Āyatanakusalatā ca paṭiccasamuppādakusalatā ca. ‘‘Ṭhānakusalatā ca aṭṭhānakusalatā ca. ‘‘Ajjavañca lajjavañca. ‘‘Khanti ca soraccañca. ‘‘Sākhalyañca paṭisanthāro ca. ‘‘Avihiṃsā ca soceyyañca. ‘‘Muṭṭhassaccañca asampajaññañca. ‘‘Sati ca sampajaññañca. ‘‘Indriyesu aguttadvāratā ca bhojane amattaññutā ca. ‘‘Indriyesu guttadvāratā ca bhojane mattaññutā ca. ‘‘Paṭisaṅkhānabalañca [paṭisandhānabalañca (syā.)] bhāvanābalañca. ‘‘Satibalañca samādhibalañca. ‘‘Samatho ca vipassanā ca. ‘‘Samathanimittañca paggahanimittañca. ‘‘Paggaho ca avikkhepo ca. ‘‘Sīlavipatti ca diṭṭhivipatti ca. ‘‘Sīlasampadā ca diṭṭhisampadā ca. ‘‘Sīlavisuddhi ca diṭṭhivisuddhi ca. ‘‘Diṭṭhivisuddhi kho pana yathā diṭṭhissa ca padhānaṃ. ‘‘Saṃvego ca saṃvejanīyesu ṭhānesu saṃviggassa ca yoniso padhānaṃ. ‘‘Asantuṭṭhitā ca kusalesu dhammesu appaṭivānitā ca padhānasmiṃ. ‘‘Vijjā ca vimutti ca. ‘‘Khayeñāṇaṃ anuppādeñāṇaṃ. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena dve dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ, na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. ",
      "english": "\"Friends, two things have been well-proclaimed by that Blessed One, who knows, who sees, the Worthy One, the Fully Enlightened One. Therein, all should come together in concord, not dispute, so that this holy life might last long and be enduring, for the benefit of the many, for the happiness of the many, out of compassion for the world, for the welfare, benefit, and happiness of gods and humans. What are the two?\n\n\"Name and form.\n\"Ignorance and craving for existence.\n\"The view of existence and the view of non-existence.\n\"Shamelessness and lack of dread.\n\"Shame and dread of wrongdoing.\n\"Insubordination and bad friendship.\n\"Subordination and good friendship.\n\"Skill in offenses and skill in emerging from offenses.\n\"Skill in attainments and skill in emerging from attainments.\n\"Skill in elements and skill in attention.\n\"Skill in sense bases and skill in dependent origination.\n\"Skill in what is possible and skill in what is impossible.\n\"Honesty and modesty.\n\"Patience and gentleness.\n\"Sociability and friendliness.\n\"Non-harming and purity.\n\"Forgetfulness and lack of clear comprehension.\n\"Mindfulness and clear comprehension.\n\"Unguardedness of the sense doors and immoderation in food.\n\"Guardedness of the sense doors and moderation in food.\n\"The power of reflection and the power of development.\n\"The power of mindfulness and the power of concentration.\n\"Tranquility and insight.\n\"The sign of tranquility and the sign of exertion.\n\"Exertion and non-distraction.\n\"Corruption of moral virtue and corruption of views.\n\"Accomplishment of moral virtue and accomplishment of views.\n\"Purity of moral virtue and purity of views.\n\"And the purity of views is, indeed, the effort according to one's view.\n\"Agitation and, in agitating situations, the wise effort of one who is agitated.\n\"Dissatisfaction with skillful qualities and non-abandoning of effort.\n\"Knowledge and liberation.\n\"The knowledge of destruction and the knowledge of non-arising.\n\n\"These, friends, are the two things well-proclaimed by that Blessed One, who knows, who sees, the Worthy One, the Fully Enlightened One. Therein, all should come together in concord, not dispute, so that this holy life might last long and be enduring, for the benefit of the many, for the happiness of the many, out of compassion for the world, for the welfare, benefit, and happiness of gods and humans.\"",
      "sinhala": "‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් ධර්මතා දෙකක් මැනවින් දේශනා කරන ලදී. එහි සියල්ලන් විසින් ම එක්ව ගායනා කළ යුතු ය, විවාද නොකළ යුතු ය, යම්සේ මේ බ්‍රහ්මචර්යාව බොහෝ කල් පවතී ද, චිරස්ථිත වේ ද, එය බොහෝ ජනයාගේ හිත සුව පිණිස ද, ලෝකානුකම්පාව පිණිස ද, දෙව් මිනිසුන්ගේ යහපත පිණිස ද, හිත සුව පිණිස ද වන්නේ ය. කවර ධර්මතා දෙකක් ද? ‘‘නාමය සහ රූපය ය. ‘‘අවිද්‍යාව සහ භවතෘෂ්ණාව ය. ‘‘භවදෘෂ්ටිය සහ විභවදෘෂ්ටිය ය. ‘‘අහිරිකය (ලැජ්ජා නැතිකම) සහ අනොත්තප්පය (පවට බිය නැතිකම) ය. ‘‘හිරිය (ලැජ්ජාව) සහ ඔත්තප්පය (පවට බිය) ය. ‘‘දොවචස් බව (අවවාද පිළිගැනීමට අකමැති බව) සහ පාපමිත්‍රත්වය (නරක මිතුරන් ඇසුරු කිරීම) ය. ‘‘සොවචස් බව (අවවාද පිළිගැනීමට කැමැති බව) සහ කල්‍යාණමිත්‍රත්වය (යහපත් මිතුරන් ඇසුරු කිරීම) ය. ‘‘ආපත්ති කුසලතාවය (වැරදි හඳුනා ගැනීමේ දක්ෂතාවය) සහ ආපත්ති වුට්ඨාන කුසලතාවය (වැරදි වලින් නැගී සිටීමේ දක්ෂතාවය) ය. ‘‘සමාපත්ති කුසලතාවය (සමාධියට පැමිණීමේ දක්ෂතාවය) සහ සමාපත්ති වුට්ඨාන කුසලතාවය (සමාධියෙන් නැගී සිටීමේ දක්ෂතාවය) ය. ‘‘ධාතු කුසලතාවය (ධාතු ගැන දැනීමේ දක්ෂතාවය) සහ මනසිකාර කුසලතාවය (මනස මෙහෙයවීමේ දක්ෂතාවය) ය. ‘‘ආයතන කුසලතාවය (ආයතන ගැන දැනීමේ දක්ෂතාවය) සහ පටිච්චසමුප්පාද කුසලතාවය (පටිච්චසමුප්පාදය ගැන දැනීමේ දක්ෂතාවය) ය. ‘‘ඨාන කුසලතාවය (හේතු දැනීමේ දක්ෂතාවය) සහ අට්ඨාන කුසලතාවය (අහේතු දැනීමේ දක්ෂතාවය) ය. ‘‘අජ්ජවය (ඍජු බව) සහ ලජ්ජවය (ලැජ්ජා ගතිය) ය. ‘‘ඛන්තිය (ඉවසීම) සහ සො‍රච්චය (මෘදු බව) ය. ‘‘සාකල්‍යය (හිතවත් බව) සහ පටිසන්ථාරය (සංවාදය) ය. ‘‘අවිහිංසාව (හිංසා නොකිරීම) සහ සෝචෙය්‍යය (පිරිසිදු බව) ය. ‘‘මුට්ඨස්සච්චය (සිහි නැති බව) සහ අසම්පජඤ්ඤය (නුවණ නැති බව) ය. ‘‘සතිය (සිහිය) සහ සම්පජඤ්ඤය (නුවණ) ය. ‘‘ඉන්ද්‍රියයන්හි අගුත්තද්වාරතාවය (ඉන්ද්‍රියන් නොරකින බව) සහ භෝජනයෙහි අමත්තඤ්ඤුතාවය (අහාර පමණ නොදැනීම) ය. ‘‘ඉන්ද්‍රියයන්හි ගුත්තද්වාරතාවය (ඉන්ද්‍රියන් රකින බව) සහ භෝජනයෙහි මත්තඤ්ඤුතාවය (අහාර පමණ දැනීම) ය. ‘‘පටිසංඛාන බලය (නැවත සලකා බැලීමේ ශක්තිය) සහ භාවනා බලය (භාවනාවේ ශක්තිය) ය. ‘‘සති බලය (සිහියේ ශක්තිය) සහ සමාධි බලය (සමාධියේ ශක්තිය) ය. ‘‘සමථය (සන්සිඳීම) සහ විපස්සනාව (විදර්ශනාව) ය. ‘‘සමථ නිමිත්ත (සන්සිඳීමේ හේතුව) සහ පග්ගහ නිමිත්ත (උත්සාහයේ හේතුව) ය. ‘‘පග්ගහය (උත්සාහය) සහ අවික්ඛේපය (අවික්ෂිප්ත බව) ය. ‘‘සීල විපත්තිය (ශීලයේ පිරිහීම) සහ දිට්ඨි විපත්තිය (දෘෂ්ටියේ පිරිහීම) ය. ‘‘සීල සම්පදාව (ශීලයේ සම්පූර්ණත්වය) සහ දිට්ඨි සම්පදාව (දෘෂ්ටියේ සම්පූර්ණත්වය) ය. ‘‘සීල විශුද්ධිය (ශීලයේ විශුද්ධිය) සහ දිට්ඨි විශුද්ධිය (දෘෂ්ටියේ විශුද්ධිය) ය. ‘‘දිට්ඨි විශුද්ධිය (දෘෂ්ටියේ විශුද්ධිය) යනු යම් සේ දිට්ඨියක් ඇත්තහුගේ වීර්යය ය. ‘‘සංවේගය (කම්පාව) සහ සංවේජනීය ස්ථානයන්හි සංවේගයට පැමිණි තැනැත්තාගේ යෝනිසෝ වීර්යය ය. ‘‘කුසල ධර්මයන්හි අසන්තුෂ්ටිය (සතුටු නොවීම) සහ වීර්යයෙහි අප්‍රතිවානිතාවය (නොපසුබට උත්සාහය) ය. ‘‘විද්‍යාව (නැණ) සහ විමුක්තිය (නිදහස් වීම) ය. ‘‘ක්ෂය ඥාණය (ක්ෂය වීම පිළිබඳ දැනුම) අනුත්පාද ඥාණය (නො ඉපදීම පිළිබඳ දැනුම) ය. ‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් මේ ධර්මතා දෙක මැනවින් දේශනා කරන ලදී. එහි සියල්ලන් විසින් ම එක්ව ගායනා කළ යුතු ය, විවාද නොකළ යුතු ය, යම්සේ මේ බ්‍රහ්මචර්යාව බොහෝ කල් පවතී ද, චිරස්ථිත වේ ද, එය බොහෝ ජනයාගේ හිත සුව පිණිස ද, ලෝකානුකම්පාව පිණිස ද, දෙව් මිනිසුන්ගේ යහපත පිණිස ද, හිත සුව පිණිස ද වන්නේ ය.",
      "paliTitle": "Dukaṃ",
      "englishTitle": "Suffering",
      "sinhalaTitle": "දුක"
    },
    {
      "number": 305,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena tayo dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Katame tayo? ‘‘Tīṇi akusalamūlāni – lobho akusalamūlaṃ, doso akusalamūlaṃ, moho akusalamūlaṃ. ‘‘Tīṇi kusalamūlāni – alobho kusalamūlaṃ, adoso kusalamūlaṃ, amoho kusalamūlaṃ. ‘‘Tīṇi duccaritāni – kāyaduccaritaṃ, vacīduccaritaṃ, manoduccaritaṃ. ‘‘Tīṇi sucaritāni – kāyasucaritaṃ, vacīsucaritaṃ, manosucaritaṃ. ‘‘Tayo akusalavitakkā – kāmavitakko, byāpādavitakko, vihiṃsāvitakko. ‘‘Tayo kusalavitakkā – nekkhammavitakko, abyāpādavitakko, avihiṃsāvitakko. ‘‘Tayo akusalasaṅkappā – kāmasaṅkappo, byāpādasaṅkappo, vihiṃsāsaṅkappo. ‘‘Tayo kusalasaṅkappā – nekkhammasaṅkappo, abyāpādasaṅkappo, avihiṃsāsaṅkappo. ‘‘Tisso akusalasaññā – kāmasaññā, byāpādasaññā, vihiṃsāsaññā. ‘‘Tisso kusalasaññā – nekkhammasaññā, abyāpādasaññā, avihiṃsāsaññā. ‘‘Tisso akusaladhātuyo – kāmadhātu, byāpādadhātu, vihiṃsādhātu. ‘‘Tisso kusaladhātuyo – nekkhammadhātu, abyāpādadhātu, avihiṃsādhātu. ‘‘Aparāpi tisso dhātuyo – kāmadhātu, rūpadhātu, arūpadhātu. ‘‘Aparāpi tisso dhātuyo – rūpadhātu, arūpadhātu, nirodhadhātu. ‘‘Aparāpi tisso dhātuyo – hīnadhātu, majjhimadhātu, paṇītadhātu. ‘‘Tisso taṇhā – kāmataṇhā, bhavataṇhā, vibhavataṇhā. ‘‘Aparāpi tisso taṇhā – kāmataṇhā, rūpataṇhā, arūpataṇhā. ‘‘Aparāpi tisso taṇhā – rūpataṇhā, arūpataṇhā, nirodhataṇhā. ‘‘Tīṇi saṃyojanāni – sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso. ‘‘Tayo āsavā – kāmāsavo, bhavāsavo, avijjāsavo. ‘‘Tayo bhavā – kāmabhavo, rūpabhavo, arūpabhavo. ‘‘Tisso esanā – kāmesanā, bhavesanā, brahmacariyesanā. ‘‘Tisso vidhā – seyyohamasmīti vidhā, sadisohamasmīti vidhā, hīnohamasmīti vidhā. ‘‘Tayo addhā – atīto addhā, anāgato addhā, paccuppanno addhā. ‘‘Tayo antā – sakkāyo anto, sakkāyasamudayo anto, sakkāyanirodho anto. ‘‘Tisso vedanā – sukhā vedanā, dukkhā vedanā, adukkhamasukhā vedanā. ‘‘Tisso dukkhatā – dukkhadukkhatā, saṅkhāradukkhatā, vipariṇāmadukkhatā. ‘‘Tayo rāsī – micchattaniyato rāsi, sammattaniyato rāsi, aniyato rāsi. ‘‘Tayo tamā [tisso kaṅkhā (bahūsu) aṭṭhakathā oloketabbā] – atītaṃ vā addhānaṃ ārabbha kaṅkhati vicikicchati nādhimuccati na sampasīdati, anāgataṃ vā addhānaṃ ārabbha kaṅkhati vicikicchati nādhimuccati na sampasīdati, etarahi vā paccuppannaṃ addhānaṃ ārabbha kaṅkhati vicikicchati nādhimuccati na sampasīdati. ‘‘Tīṇi tathāgatassa arakkheyyāni – parisuddhakāyasamācāro āvuso tathāgato, natthi tathāgatassa kāyaduccaritaṃ, yaṃ tathāgato rakkheyya – ‘mā me idaṃ paro aññāsī’ti. Parisuddhavacīsamācāro āvuso, tathāgato, natthi tathāgatassa vacīduccaritaṃ, yaṃ tathāgato rakkheyya – ‘mā me idaṃ paro aññāsī’ti. Parisuddhamanosamācāro, āvuso, tathāgato, natthi tathāgatassa manoduccaritaṃ yaṃ tathāgato rakkheyya – ‘mā me idaṃ paro aññāsī’ti. ‘‘Tayo kiñcanā – rāgo kiñcanaṃ, doso kiñcanaṃ, moho kiñcanaṃ. ‘‘Tayo aggī – rāgaggi, dosaggi, mohaggi. ‘‘Aparepi tayo aggī – āhuneyyaggi, gahapataggi, dakkhiṇeyyaggi. ‘‘Tividhena rūpasaṅgaho – sanidassanasappaṭighaṃ rūpaṃ [sanidassanasappaṭigharūpaṃ (syā. kaṃ.) evamitaradvayepi], anidassanasappaṭighaṃ rūpaṃ, anidassanaappaṭighaṃ rūpaṃ. ‘‘Tayo saṅkhārā – puññābhisaṅkhāro, apuññābhisaṅkhāro, āneñjābhisaṅkhāro. ‘‘Tayo puggalā – sekkho puggalo, asekkho puggalo, nevasekkhonāsekkho puggalo. ‘‘Tayo therā – jātithero, dhammathero, sammutithero [sammatithero (syā. kaṃ.)]. ‘‘Tīṇi puññakiriyavatthūni – dānamayaṃ puññakiriyavatthu, sīlamayaṃ puññakiriyavatthu, bhāvanāmayaṃ puññakiriyavatthu. ‘‘Tīṇi codanāvatthūni – diṭṭhena, sutena, parisaṅkāya. ‘‘Tisso kāmūpapattiyo [kāmuppattiyo (sī.), kāmupapattiyo (syā. pī. ka.)] – santāvuso sattā paccupaṭṭhitakāmā, te paccupaṭṭhitesu kāmesu vasaṃ vattenti, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Ayaṃ paṭhamā kāmūpapatti. Santāvuso, sattā nimmitakāmā, te nimminitvā nimminitvā kāmesu vasaṃ vattenti, seyyathāpi devā nimmānaratī. Ayaṃ dutiyā kāmūpapatti. Santāvuso sattā paranimmitakāmā, te paranimmitesu kāmesu vasaṃ vattenti, seyyathāpi devā paranimmitavasavattī. Ayaṃ tatiyā kāmūpapatti. ‘‘Tisso sukhūpapattiyo [sukhupapattiyo (syā. pī. ka.)] – santāvuso sattā [sattā sukhaṃ (syā. kaṃ.)] uppādetvā uppādetvā sukhaṃ viharanti, seyyathāpi devā brahmakāyikā. Ayaṃ paṭhamā sukhūpapatti. Santāvuso, sattā sukhena abhisannā parisannā paripūrā paripphuṭā. Te kadāci karahaci udānaṃ udānenti – ‘aho sukhaṃ, aho sukha’nti, seyyathāpi devā ābhassarā. Ayaṃ dutiyā sukhūpapatti. Santāvuso, sattā sukhena abhisannā parisannā paripūrā paripphuṭā. Te santaṃyeva tusitā [santusitā (syā. kaṃ.)] sukhaṃ [cittasukhaṃ (syā. ka.)] paṭisaṃvedenti, seyyathāpi devā subhakiṇhā. Ayaṃ tatiyā sukhūpapatti. ‘‘Tisso paññā – sekkhā paññā, asekkhā paññā, nevasekkhānāsekkhā paññā. ‘‘Aparāpi tisso paññā – cintāmayā paññā, sutamayā paññā, bhāvanāmayā paññā. ‘‘Tīṇāvudhāni – sutāvudhaṃ, pavivekāvudhaṃ, paññāvudhaṃ. ‘‘Tīṇindriyāni – anaññātaññassāmītindriyaṃ, aññindriyaṃ, aññātāvindriyaṃ. ‘‘Tīṇi cakkhūni – maṃsacakkhu, dibbacakkhu, paññācakkhu. ‘‘Tisso sikkhā – adhisīlasikkhā, adhicittasikkhā, adhipaññāsikkhā. ‘‘Tisso bhāvanā – kāyabhāvanā, cittabhāvanā, paññābhāvanā. ‘‘Tīṇi anuttariyāni – dassanānuttariyaṃ, paṭipadānuttariyaṃ, vimuttānuttariyaṃ. ‘‘Tayo samādhī – savitakkasavicāro samādhi, avitakkavicāramatto samādhi, avitakkaavicāro samādhi. ‘‘Aparepi tayo samādhī – suññato samādhi, animitto samādhi, appaṇihito samādhi. ‘‘Tīṇi soceyyāni – kāyasoceyyaṃ, vacīsoceyyaṃ, manosoceyyaṃ. ‘‘Tīṇi moneyyāni – kāyamoneyyaṃ, vacīmoneyyaṃ, manomoneyyaṃ. ‘‘Tīṇi kosallāni – āyakosallaṃ, apāyakosallaṃ, upāyakosallaṃ. ‘‘Tayo madā – ārogyamado, yobbanamado, jīvitamado. ‘‘Tīṇi ādhipateyyāni – attādhipateyyaṃ, lokādhipateyyaṃ, dhammādhipateyyaṃ. ‘‘Tīṇi kathāvatthūni – atītaṃ vā addhānaṃ ārabbha kathaṃ katheyya – ‘evaṃ ahosi atītamaddhāna’nti; anāgataṃ vā addhānaṃ ārabbha kathaṃ katheyya – ‘evaṃ bhavissati anāgatamaddhāna’nti; etarahi vā paccuppannaṃ addhānaṃ ārabbha kathaṃ katheyya – ‘evaṃ hoti etarahi paccuppannaṃ addhāna’nti. ‘‘Tisso vijjā – pubbenivāsānussatiñāṇaṃ vijjā, sattānaṃ cutūpapāteñāṇaṃ vijjā, āsavānaṃ khayeñāṇaṃ vijjā. ‘‘Tayo vihārā – dibbo vihāro, brahmā vihāro, ariyo vihāro. ‘‘Tīṇi pāṭihāriyāni – iddhipāṭihāriyaṃ, ādesanāpāṭihāriyaṃ, anusāsanīpāṭihāriyaṃ. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena tayo dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. ",
      "english": "\"Friends, these three things have been well-proclaimed by the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Enlightened One. All should recite them together…for the benefit, welfare, and happiness of gods and humans. What three?\n\n\"The three unwholesome roots: Greed is an unwholesome root, hatred is an unwholesome root, delusion is an unwholesome root.\n\n\"The three wholesome roots: Non-greed is a wholesome root, non-hatred is a wholesome root, non-delusion is a wholesome root.\n\n\"The three kinds of bad conduct: Bad bodily conduct, bad verbal conduct, bad mental conduct.\n\n\"The three kinds of good conduct: Good bodily conduct, good verbal conduct, good mental conduct.\n\n\"The three unwholesome thoughts: Sensual thought, malicious thought, harmful thought.\n\n\"The three wholesome thoughts: Thought of renunciation, thought of non-malice, thought of harmlessness.\n\n\"The three unwholesome intentions: Sensual intention, malicious intention, harmful intention.\n\n\"The three wholesome intentions: Intention of renunciation, intention of non-malice, intention of harmlessness.\n\n\"The three unwholesome perceptions: Sensual perception, malicious perception, harmful perception.\n\n\"The three wholesome perceptions: Perception of renunciation, perception of non-malice, perception of harmlessness.\n\n\"The three unwholesome elements: The element of sensuality, the element of malice, the element of harmfulness.\n\n\"The three wholesome elements: The element of renunciation, the element of non-malice, the element of harmlessness.\n\n\"Again, the three elements: The element of sensuality, the element of form, the element of formlessness.\n\n\"Again, the three elements: The element of form, the element of formlessness, the element of cessation.\n\n\"Again, the three elements: The inferior element, the intermediate element, the superior element.\n\n\"The three kinds of craving: Craving for sensual pleasures, craving for existence, craving for non-existence.\n\n\"Again, the three kinds of craving: Craving for sensual pleasures, craving for form, craving for formlessness.\n\n\"Again, the three kinds of craving: Craving for form, craving for formlessness, craving for cessation.\n\n\"The three fetters: Belief in a self, doubt, clinging to rites and rituals.\n\n\"The three taints: The taint of sensuality, the taint of existence, the taint of ignorance.\n\n\"The three kinds of existence: Sensual existence, form existence, formless existence.\n\n\"The three kinds of seeking: Seeking sensual pleasures, seeking existence, seeking the holy life.\n\n\"The three conceits: The conceit 'I am better', the conceit 'I am equal', the conceit 'I am worse'.\n\n\"The three times: The past time, the future time, the present time.\n\n\"The three limits: The limit of self, the limit of the arising of self, the limit of the cessation of self.\n\n\"The three feelings: Pleasant feeling, painful feeling, neither-painful-nor-pleasant feeling.\n\n\"The three kinds of suffering: Suffering of suffering, suffering of formations, suffering of change.\n\n\"The three destinies: The destiny fixed for wrongness, the destiny fixed for rightness, the unfixed destiny.\n\n\"The three kinds of doubt: One doubts and is uncertain and does not become confident or settled regarding the past time; one doubts and is uncertain and does not become confident or settled regarding the future time; one doubts and is uncertain and does not become confident or settled regarding the present time.\n\n\"The three things that do not need guarding in the Tathagata: The Tathagata, friend, has perfectly pure bodily conduct. There is no bad bodily conduct in the Tathagata that the Tathagata would need to guard, thinking, 'May others not know this about me.' The Tathagata, friend, has perfectly pure verbal conduct. There is no bad verbal conduct in the Tathagata that the Tathagata would need to guard, thinking, 'May others not know this about me.' The Tathagata, friend, has perfectly pure mental conduct. There is no bad mental conduct in the Tathagata that the Tathagata would need to guard, thinking, 'May others not know this about me.'\n\n\"The three defilements: Greed is a defilement, hatred is a defilement, delusion is a defilement.\n\n\"The three fires: The fire of greed, the fire of hatred, the fire of delusion.\n\n\"Again, the three fires: The fire worthy of offerings, the fire of the householder, the fire worthy of gifts.\n\n\"The three ways of classifying form: Form that is visible and impinges, form that is invisible but impinges, form that is invisible and does not impinge.\n\n\"The three kinds of fabrication: Meritorious fabrication, demeritorious fabrication, imperturbable fabrication.\n\n\"The three kinds of persons: The trainee, the one beyond training, the neither-trainee-nor-beyond-training.\n\n\"The three elders: The elder by birth, the elder by Dhamma, the elder by convention.\n\n\"The three bases for making merit: The basis for making merit consisting of giving, the basis for making merit consisting of morality, the basis for making merit consisting of meditation.\n\n\"The three instigations: By what is seen, by what is heard, by what is thought.\n\n\"The three kinds of sensual rebirth: There are, friend, beings with sensuality present, who conduct their lives dwelling in present sensuality, such as humans, some gods, and some beings in states of loss. This is the first kind of sensual rebirth. There are, friend, beings with created sensuality, who having created and created, conduct their lives dwelling in created sensuality, such as the gods delighting in creation. This is the second kind of sensual rebirth. There are, friend, beings with sensuality created by others, who conduct their lives dwelling in sensuality created by others, such as the gods who have power over the creations of others. This is the third kind of sensual rebirth.\n\n\"The three kinds of rebirth into happiness: There are, friend, beings who having produced and produced happiness, dwell in happiness, such as the Brahmakayika gods. This is the first kind of rebirth into happiness. There are, friend, beings who are saturated, pervaded, filled, and overflowing with happiness, who occasionally utter the exclamation, 'Oh, happiness! Oh, happiness!' such as the Abhassara gods. This is the second kind of rebirth into happiness. There are, friend, beings who are saturated, pervaded, filled, and overflowing with happiness, who experiencing happiness are simply content, such as the Subhakinna gods. This is the third kind of rebirth into happiness.\n\n\"The three kinds of wisdom: Wisdom of the trainee, wisdom of one beyond training, wisdom of neither-trainee-nor-beyond-training.\n\n\"Again, the three kinds of wisdom: Wisdom arising from thinking, wisdom arising from hearing, wisdom arising from meditation.\n\n\"The three weapons: The weapon of learning, the weapon of seclusion, the weapon of wisdom.\n\n\"The three faculties: The faculty 'I shall come to know the unknown', the faculty of knowledge, the faculty of one who knows.\n\n\"The three eyes: The eye of flesh, the divine eye, the eye of wisdom.\n\n\"The three trainings: The training in higher morality, the training in higher mind, the training in higher wisdom.\n\n\"The three developments: Development of the body, development of the mind, development of wisdom.\n\n\"The three unsurpassed qualities: Unsurpassed seeing, unsurpassed practice, unsurpassed liberation.\n\n\"The three kinds of concentration: Concentration with initial and sustained thought, concentration with sustained thought alone, concentration without initial and sustained thought.\n\n\"Again, the three kinds of concentration: Concentration on emptiness, concentration on the signless, concentration on the undirected.\n\n\"The three kinds of purity: Purity of body, purity of speech, purity of mind.\n\n\"The three kinds of silence: Silence of body, silence of speech, silence of mind.\n\n\"The three kinds of skill: Skill in gain, skill in loss, skill in means.\n\n\"The three kinds of intoxication: Intoxication with health, intoxication with youth, intoxication with life.\n\n\"The three kinds of sovereignty: Sovereignty over oneself, sovereignty over the world, sovereignty over the Dhamma.\n\n\"The three topics of discussion: Concerning the past time, one might speak thus: ‘Thus it was in the past time.’ Concerning the future time, one might speak thus: ‘Thus it will be in the future time.’ Concerning the present time, one might speak thus: ‘Thus it is in the present time.’\n\n\"The three knowledges: Knowledge of the recollection of past lives, knowledge of the passing away and rebirth of beings, knowledge of the destruction of the taints.\n\n\"The three abidings: Divine abiding, Brahma abiding, noble abiding.\n\n\"The three miracles: The miracle of psychic power, the miracle of mind-reading, the miracle of instruction.\n\n\"These, friends, are the three things well-proclaimed by the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Enlightened One. All should recite them together…for the benefit, welfare, and happiness of gods and humans.\"",
      "sinhala": "‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේ විසින් ධර්ම තුනක් මැනවින් දේශනා කරන ලදී. එහි සියල්ලෝම එක්ව ගායනා කළ යුතුය. දෙවියන්ට හා මනුෂ්‍යයන්ට හිත පිණිස, සුව පිණිස වේ. කවර තුනක්ද? ‘‘අකුසල මූලයන් තුනකි - ලෝභය අකුසල මූලයකි, ද්වේෂය අකුසල මූලයකි, මෝහය අකුසල මූලයකි. ‘‘කුසල මූලයන් තුනකි - අලෝභය කුසල මූලයකි, අද්වේෂය කුසල මූලයකි, අමෝහය කුසල මූලයකි. ‘‘දුශ්චරිත තුනකි - කාය දුශ්චරිතය, වාචී දුශ්චරිතය, මනෝ දුශ්චරිතය. ‘‘සුචරිත තුනකි - කාය සුචරිතය, වාචී සුචරිතය, මනෝ සුචරිතය. ‘‘අකුසල විතර්ක තුනකි - කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය. ‘‘කුසල විතර්ක තුනකි - නෙක්ඛම්ම විතර්කය, අව්‍යාපාද විතර්කය, අවිහිංසා විතර්කය. ‘‘අකුසල සංකල්ප තුනකි - කාම සංකල්පය, ව්‍යාපාද සංකල්පය, විහිංසා සංකල්පය. ‘‘කුසල සංකල්ප තුනකි - නෙක්ඛම්ම සංකල්පය, අව්‍යාපාද සංකල්පය, අවිහිංසා සංකල්පය. ‘‘අකුසල සංඥා තුනකි - කාම සංඥාව, ව්‍යාපාද සංඥාව, විහිංසා සංඥාව. ‘‘කුසල සංඥා තුනකි - නෙක්ඛම්ම සංඥාව, අව්‍යාපාද සංඥාව, අවිහිංසා සංඥාව. ‘‘අකුසල ධාතු තුනකි - කාම ධාතුව, ව්‍යාපාද ධාතුව, විහිංසා ධාතුව. ‘‘කුසල ධාතු තුනකි - නෙක්ඛම්ම ධාතුව, අව්‍යාපාද ධාතුව, අවිහිංසා ධාතුව. ‘‘තවත් ධාතු තුනකි - කාම ධාතුව, රූප ධාතුව, අරූප ධාතුව. ‘‘තවත් ධාතු තුනකි - රූප ධාතුව, අරූප ධාතුව, නිරෝධ ධාතුව. ‘‘තවත් ධාතු තුනකි - හීන ධාතුව, මධ්‍යම ධාතුව, ප්‍රණීත ධාතුව. ‘‘තෘෂ්ණා තුනකි - කාම තෘෂ්ණාව, භව තෘෂ්ණාව, විභව තෘෂ්ණාව. ‘‘තවත් තෘෂ්ණා තුනකි - කාම තෘෂ්ණාව, රූප තෘෂ්ණාව, අරූප තෘෂ්ණාව. ‘‘තවත් තෘෂ්ණා තුනකි - රූප තෘෂ්ණාව, අරූප තෘෂ්ණාව, නිරෝධ තෘෂ්ණාව. ‘‘සංයෝජන තුනකි - සක්කාය දිට්ඨිය, විචිකිච්ඡාව, සීලබ්බත පරාමාසය. ‘‘ආශ්‍රව තුනකි - කාමාශ්‍රව, භවාශ්‍රව, අවිද්‍යාශ්‍රව. ‘‘භව තුනකි - කාම භවය, රූප භවය, අරූප භවය. ‘‘එසනා තුනකි - කාමෙසනා, භවෙසනා, බ්‍රහ්මචරියෙසනා. ‘‘විධා තුනකි - මම අන්‍යයන්ට වඩා උතුම් වෙමියි යන විධ, මම අන්‍යයන්ට සමාන වෙමියි යන විධ, මම අන්‍යයන්ට වඩා හීන වෙමියි යන විධ. ‘‘අද්ධාවන් තුනකි - අතීත අද්ධාව, අනාගත අද්ධාව, ප්‍රත්‍යුත්පන්න අද්ධාව. ‘‘අන්ත තුනකි - සක්කාය අන්තය, සක්කාය සමුදය අන්තය, සක්කාය නිරෝධ අන්තය. ‘‘වේදනා තුනකි - සුඛ වේදනාව, දුඃඛ වේදනාව, අදුඃඛමසුඛ වේදනාව. ‘‘දුඃඛතා තුනකි - දුඃඛදුඃඛතාව, සංඛාරදුඃඛතාව, විපරිණාමදුඃඛතාව. ‘‘රාශි තුනකි - මිථ්‍යාත්ව නියත රාශිය, සම්මාත්ව නියත රාශිය, අනියත රාශිය. ‘‘තමස් තුනකි - අතීත කාලය අරභයා සැක කරයි, විචිකිච්ඡා කරයි, අධිමුක්ත නොවේ, සතුටු නොවෙයි. අනාගත කාලය අරභයා සැක කරයි, විචිකිච්ඡා කරයි, අධිමුක්ත නොවේ, සතුටු නොවෙයි. දැන් පවත්නා වර්තමාන කාලය අරභයා සැක කරයි, විචිකිච්ඡා කරයි, අධිමුක්ත නොවේ, සතුටු නොවෙයි. ‘‘තථාගතයන් වහන්සේගේ ආරක්ෂා කළ යුතු දේ තුනකි - ඇවැත්නි, තථාගතයන් වහන්සේ පිරිසිදු කාය සමාචාර ඇත්තාහ. තථාගතයන් වහන්සේට කාය දුශ්චරිතයක් නැත. ‘මාගේ මේ (වැරැද්ද) අනුන් දැනගනීවි’ යයි තථාගතයන් වහන්සේ ආරක්ෂා කරන්නේ යමක් වේ නම් එය නැත. ඇවැත්නි, තථාගතයන් වහන්සේ පිරිසිදු වාචී සමාචාර ඇත්තාහ. තථාගතයන් වහන්සේට වාචී දුශ්චරිතයක් නැත. ‘මාගේ මේ (වැරැද්ද) අනුන් දැනගනීවි’ යයි තථාගතයන් වහන්සේ ආරක්ෂා කරන්නේ යමක් වේ නම් එය නැත. ඇවැත්නි, තථාගතයන් වහන්සේ පිරිසිදු මනෝ සමාචාර ඇත්තාහ. තථාගතයන් වහන්සේට මනෝ දුශ්චරිතයක් නැත. ‘මාගේ මේ (වැරැද්ද) අනුන් දැනගනීවි’ යයි තථාගතයන් වහන්සේ ආරක්ෂා කරන්නේ යමක් වේ නම් එය නැත. ‘‘කිංචන තුනකි - රාගය කිංචනයකි, ද්වේෂය කිංචනයකි, මෝහය කිංචනයකි. ‘‘අග්ගි තුනකි - රාගග්ගි, ද්වේෂාග්ගි, මෝහාග්ගි. ‘‘තවත් අග්ගි තුනකි - ආහුනෙය්‍යග්ගි, ගහපතග්ගි, දක්ඛිණෙය්‍යග්ගි. ‘‘ත්‍රිවිධ රූප සංග්‍රහයකි - දැකිය හැකි, ගැටෙන රූපය, දැකිය නොහැකි, ගැටෙන රූපය, දැකිය නොහැකි, නොගැටෙන රූපය. ‘‘සංඛාර තුනකි - පුණ්‍යාභිසංඛාරය, අපුණ්‍යාභිසංඛාරය, ආනෙඤ්ජාභිසංඛාරය. ‘‘පුද්ගලයෝ තුනකි - ශෛක්ෂ පුද්ගලයා, අශෛක්ෂ පුද්ගලයා, නෛවශෛක්ෂනාශෛක්ෂ පුද්ගලයා. ‘‘ස්ථවිරවරු තුනකි - ජාති ස්ථවිර, ධර්ම ස්ථවිර, සම්මුති ස්ථවිර. ‘‘පින්කිරීමේ වස්තු තුනකි - දානමය පින්කිරීමේ වස්තුව, සීලමය පින්කිරීමේ වස්තුව, භාවනාමය පින්කිරීමේ වස්තුව. ‘‘චෝදනා වස්තු තුනකි - දැකීමෙන්, ඇසීමෙන්, පරීක්ෂා කිරීමෙන්. ‘‘කාමෝපපත්ති තුනකි - ඇවැත්නි, ඇතැම් සත්වයෝ වර්තමාන කාමයන් ඇත්තාහු එම වර්තමාන කාමයන්හි වාසය කරමින් හැසිරෙති. යම් සේ මනුෂ්‍යයෝද ඇතැම් දෙවියෝද ඇතැම් විනිපාතකයෝද වෙත්ද, මෙය පළමුවන කාමෝපපත්තියයි. ඇවැත්නි, ඇතැම් සත්වයෝ නිර්මිත කාමයන් ඇත්තාහු නිර්මාණය කර කර කාමයන්හි වාසය කරමින් හැසිරෙති. යම් සේ නිර්මාණරතී දෙවියෝද, මෙය දෙවන කාමෝපපත්තියයි. ඇවැත්නි, ඇතැම් සත්වයෝ පරනිර්මිත කාමයන් ඇත්තාහු අනුන් විසින් මවන ලද කාමයන්හි වාසය කරමින් හැසිරෙති. යම් සේ පරනිර්මිත වසවර්තී දෙවියෝද, මෙය තුන්වන කාමෝපපත්තියයි. ‘‘සුඛෝපපත්ති තුනකි - ඇවැත්නි, ඇතැම් සත්වයෝ උපදවා උපදවා සැප විඳිති. යම් සේ බ්‍රහ්ම කායික දෙවියෝද, මෙය පළමුවන සුඛෝපපත්තියයි. ඇවැත්නි, ඇතැම් සත්වයෝ සැපයෙන් තෙමී, වටවී, පිරී, ස්පර්ශ වී සිටිත්. ඔවුහු කලාතුරකින් උදන් අනිත් - ‘අහෝ සැපය, අහෝ සැපය’ යි. යම් සේ ආභස්සර දෙවියෝද, මෙය දෙවන සුඛෝපපත්තියයි. ඇවැත්නි, ඇතැම් සත්වයෝ සැපයෙන් තෙමී, වටවී, පිරී, ස්පර්ශ වී සිටිත්. ඔවුහු සන්තුෂ්ඨිමත් සිතින් යුතුව සැපය පටිසංවේදී වෙති. යම් සේ සුභකිණ්හ දෙවියෝද, මෙය තුන්වන සුඛෝපපත්තියයි. ‘‘ප්‍රඥා තුනකි - ශෛක්ෂ ප්‍රඥාව, අශෛක්ෂ ප්‍රඥාව, නෛවශෛක්ෂනාශෛක්ෂ ප්‍රඥාව. ‘‘තවත් ප්‍රඥා තුනකි - චින්තාමය ප්‍රඥාව, ශ්‍රැතමය ප්‍රඥාව, භාවනාමය ප්‍රඥාව. ‘‘ආයුධ තුනකි - ශ්‍රැත ආයුධය, විවේක ආයුධය, ප්‍රඥා ආයුධය. ‘‘ඉන්ද්‍රිය තුනකි - අනඤ්ඤාතඤ්ඤස්සාමීතින්ද්‍රිය, අඤ්ඤින්ද්‍රිය, අඤ්ඤාතාවින්ද්‍රිය. ‘‘චක්ෂුස් තුනකි - මාංශ චක්ෂුස, දිව්‍ය චක්ෂුස, ප්‍රඥා චක්ෂුස. ‘‘ශික්ෂා තුනකි - අධිශීල ශික්ෂාව, අධිචිත්ත ශික්ෂාව, අධිප්‍රඥා ශික්ෂාව. ‘‘භාවනා තුනකි - කාය භාවනාව, චිත්ත භාවනාව, ප්‍රඥා භාවනාව. ‘‘අනුත්තරීය තුනකි - දර්ශනානුත්තරිය, පටිපදානුත්තරිය, විමුක්තානුත්තරිය. ‘‘සමාධි තුනකි - සවිතක්ක සවිචාර සමාධිය, අවිතක්ක විචාරමත්ත සමාධිය, අවිතක්ක අවිචාර සමාධිය. ‘‘තවත් සමාධි තුනකි - ශුන්‍යතා සමාධිය, අනිමිත්ත සමාධිය, අප්පණිහිත සමාධිය. ‘‘ශෞච්‍ය තුනකි - කාය ශෞච්‍යය, වාචී ශෞච්‍යය, මනෝ ශෞච්‍යය. ‘‘මෞනය තුනකි - කාය මෞනය, වාචී මෞනය, මනෝ මෞනය. ‘‘කෞශල්‍ය තුනකි - ආය කෞශල්‍ය, අපාය කෞශල්‍ය, උපාය කෞශල්‍ය. ‘‘මද තුනකි - ආරෝග්‍ය මදය, යොබ්බන මදය, ජීවිත මදය. ‘‘ආධිපත්‍ය තුනකි - ආත්මාධිපත්‍යය, ලෝකාධිපත්‍යය, ධර්මාධිපත්‍යය. ‘‘කථාවස්තු තුනකි - අතීත කාලය අරභයා කෙසේ කථා කරන්නේද? ‘අතීත කාලයෙහි මෙසේ විය’ යි කථා කරයි. අනාගත කාලය අරභයා කෙසේ කථා කරන්නේද? ‘අනාගත කාලයෙහි මෙසේ වන්නේය’ යි කථා කරයි. දැන් පවත්නා වර්තමාන කාලය අරභයා කෙසේ කථා කරන්නේද? ‘දැන් පවත්නා වර්තමාන කාලයෙහි මෙසේ වන්නේය’ යි කථා කරයි. ‘‘විද්‍යා තුනකි - පූර්ව නිවාස අනුස්සති ඥානය විද්‍යාවකි, සත්වයන්ගේ චුතූපපාත ඥානය විද්‍යාවකි, ආශ්‍රවයන්ගේ ක්ෂයවීම පිළිබඳ ඥානය විද්‍යාවකි. ‘‘විහාර තුනකි - දිව්‍ය විහාරය, බ්‍රහ්ම විහාරය, ආර්ය විහාරය. ‘‘ප්‍රාතිහාර්ය තුනකි - ඍද්ධි ප්‍රාතිහාර්යය, ආදේශනා ප්‍රාතිහාර්යය, අනුශාසනා ප්‍රාතිහාර්යය. ‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේ විසින් මේ ධර්ම තුන මැනවින් දේශනා කරන ලදී. එහි සියල්ලෝම එක්ව ගායනා කළ යුතුය. දෙවියන්ට හා මනුෂ්‍යයන්ට හිත පිණිස, සුව පිණිස වේ.",
      "paliTitle": "Tikaṃ",
      "englishTitle": "The Triad",
      "sinhalaTitle": "ත්‍රිකය"
    },
    {
      "number": 306,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena cattāro dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ, na vivaditabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Katame cattāro? ‘‘Cattāro satipaṭṭhānā. Idhāvuso, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Vedanāsu vedanānupassī…pe… citte cittānupassī…pe… dhammesu dhammānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. ‘‘Cattāro sammappadhānā. Idhāvuso, bhikkhu anuppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ anuppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Anuppannānaṃ kusalānaṃ dhammānaṃ uppādāya chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. Uppannānaṃ kusalānaṃ dhammānaṃ ṭhitiyā asammosāya bhiyyobhāvāya vepullāya bhāvanāya pāripūriyā chandaṃ janeti vāyamati vīriyaṃ ārabhati cittaṃ paggaṇhāti padahati. ‘‘Cattāro iddhipādā. Idhāvuso, bhikkhu chandasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Cittasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Vīriyasamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. Vīmaṃsāsamādhipadhānasaṅkhārasamannāgataṃ iddhipādaṃ bhāveti. ‘‘Cattāri jhānāni. Idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ [paṭhamajjhānaṃ (syā. kaṃ.)] upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ [dutiyajjhānaṃ (syā. kaṃ.)] upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ [tatiyajjhānaṃ (syā. kaṃ.)] upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā, adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ [catutthajjhānaṃ (syā. kaṃ.)] upasampajja viharati.",
      "english": "\"Friend, these four qualities have been well proclaimed by that Blessed One, the Knower, the Seer, the Arahant, the Perfectly Enlightened One. All should come together regarding them; there should be no dispute… for the benefit, welfare, and happiness of gods and humans. What are the four? The four foundations of mindfulness. Here, friend, a bhikkhu dwells contemplating the body in the body, ardent, fully knowing, mindful, having removed longing and dejection in the world. He dwells contemplating feelings in feelings… He dwells contemplating mind in mind… He dwells contemplating phenomena in phenomena, ardent, fully knowing, mindful, having removed longing and dejection in the world. The four right exertions. Here, friend, a bhikkhu generates desire, endeavors, arouses energy, strengthens his mind, and exerts himself for the non-arising of unarisen evil, unwholesome qualities. He generates desire, endeavors, arouses energy, strengthens his mind, and exerts himself for the abandoning of arisen evil, unwholesome qualities. He generates desire, endeavors, arouses energy, strengthens his mind, and exerts himself for the arising of unarisen wholesome qualities. He generates desire, endeavors, arouses energy, strengthens his mind, and exerts himself for the maintenance, non-decay, increase, abundance, development, and perfection of arisen wholesome qualities. The four bases of power. Here, friend, a bhikkhu develops the basis of power that possesses concentration due to desire and striving. He develops the basis of power that possesses concentration due to mind and striving. He develops the basis of power that possesses concentration due to energy and striving. He develops the basis of power that possesses concentration due to investigation and striving. The four jhānas. Here, friend, a bhikkhu, quite secluded from sensual pleasures, secluded from unwholesome qualities, enters and dwells in the first jhāna, which is accompanied by thought and examination, born of seclusion, filled with delight and happiness. With the subsiding of thought and examination, he enters and dwells in the second jhāna, which has internal confidence, unification of mind, is without thought and examination, born of concentration, filled with delight and happiness. With the fading away of delight, he dwells with equanimity, mindful and fully knowing, and experiences happiness with the body; that is what the noble ones declare: ‘Equanimous, mindful, one who dwells happily,’ he enters and dwells in the third jhāna. With the abandoning of pleasure and the abandoning of pain, with the previous disappearance of joy and sorrow, he enters and dwells in the fourth jhāna, which has purity of mindfulness due to equanimity, neither painful nor pleasant.\"",
      "sinhala": "‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින් දැන දකින අරහත් වූ සම්මා සම්බුදුරජාණන් වහන්සේ විසින් ධර්ම හතරක් මැනවින් දේශනා කරන ලදී. එහි දී සියල්ලෝම එක්ව ගායනා කළ යුතුයි, විවාද නොකළ යුතුයි… දෙවියන්ට සහ මිනිසුන්ට යහපත පිණිස, හිත පිණිස, සුව පිණිස. කවර සතරක් ද? ‘‘සතර සතිපට්ඨානයෝ ය. ඇවැත්නි, මෙහි භික්ෂුව ලෝකයෙහි අභිධ්‍යා දෝමනස්සයන් දුරු කොට කායෙහි කායානුපස්සීව වාසය කරයි. වේදනාවන්හි වේදනානුපස්සීව… සිතෙහි චිත්තානුපස්සීව… ධර්මයන්හි ධම්මානුපස්සීව වාසය කරයි. ලෝකයෙහි අභිධ්‍යා දෝමනස්සයන් දුරු කොට කායෙහි කායානුපස්සීව වාසය කරයි. ‘‘සතර සම්‍යක්ප්‍රධානයෝ ය. ඇවැත්නි, මෙහි භික්ෂුව නූපන් පාපී අකුසල ධර්මයන්ගේ නූපදවීම පිණිස කැමැත්ත උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත පිහිටුවයි, උත්සාහ කරයි. උපන් පාපී අකුසල ධර්මයන්ගේ දුරු කිරීම පිණිස කැමැත්ත උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත පිහිටුවයි, උත්සාහ කරයි. නූපන් කුසල ධර්මයන්ගේ ඉපදවීම පිණිස කැමැත්ත උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත පිහිටුවයි, උත්සාහ කරයි. උපන් කුසල ධර්මයන්ගේ පැවැත්ම පිණිස, නොමුලා වීම පිණිස, වැඩි වැඩියෙන් දියුණුවීම පිණිස, වර්ධනය වීම පිණිස, පරිපූර්ණ වීම පිණිස කැමැත්ත උපදවයි, වෑයම් කරයි, වීර්යය අරඹයි, සිත පිහිටුවයි, උත්සාහ කරයි. ‘‘සතර ඉද්ධිපාද ය. ඇවැත්නි, මෙහි භික්ෂුව ඡන්ද සමාධි ප්‍රධාන සංඛාර සමන්විත වූ ඉද්ධිපාදය වඩයි. චිත්ත සමාධි ප්‍රධාන සංඛාර සමන්විත වූ ඉද්ධිපාදය වඩයි. වීර්ය සමාධි ප්‍රධාන සංඛාර සමන්විත වූ ඉද්ධිපාදය වඩයි. විමංසා සමාධි ප්‍රධාන සංඛාර සමන්විත වූ ඉද්ධිපාදය වඩයි. ‘‘සතර ධ්‍යානයෝ ය. ඇවැත්නි, මෙහි භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු වන ධ්‍යානයට පැමිණ වාසය කරයි. විතර්ක විචාරයන්ගේ සංසිඳීමෙන් තමා තුළ පැහැදීම ඇති කරන සිතේ එකඟ බව ඇති කරන, විතර්ක රහිත විචාර රහිත සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. ප්‍රීතියෙහි ද විරාගයෙන් යුක්තව උපේක්ෂා සහගතව වාසය කරයි. සිහියෙන් යුක්තව, නුවණින් යුක්තව සැපය කයින් විඳී. යම් ඒ ආර්යයෝ ‘උපේක්ෂා සහගත සිහි ඇති සැප විහරණ ඇති’ යැයි කියත් නම්, ඒ තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. සැපය දුරු කිරීමෙන් ද, දුක දුරු කිරීමෙන් ද, සතුට හා අසතුට පළමුවෙන්ම නැති කිරීමෙන් දුකක් ද නොවූ සැපයක් ද නොවූ උපේක්ෂා සහගත සිහියෙන් පිරිසිදු වූ සතරවන ධ්‍යානයට පැමිණ වාසය කරයි.",
      "paliTitle": "Catukkaṃ",
      "englishTitle": "The Fours",
      "sinhalaTitle": "චතුෂ්කය"
    },
    {
      "number": 307,
      "pali": "‘‘Catasso samādhibhāvanā. Atthāvuso, samādhibhāvanā bhāvitā bahulīkatā diṭṭhadhammasukhavihārāya saṃvattati. Atthāvuso, samādhibhāvanā bhāvitā bahulīkatā ñāṇadassanapaṭilābhāya saṃvattati. Atthāvuso samādhibhāvanā bhāvitā bahulīkatā satisampajaññāya saṃvattati. Atthāvuso samādhibhāvanā bhāvitā bahulīkatā āsavānaṃ khayāya saṃvattati. ‘‘Katamā cāvuso, samādhibhāvanā bhāvitā bahulīkatā diṭṭhadhammasukhavihārāya saṃvattati? Idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ, āvuso, samādhibhāvanā bhāvitā bahulīkatā diṭṭhadhammasukhavihārāya saṃvattati. ‘‘Katamā cāvuso, samādhibhāvanā bhāvitā bahulīkatā ñāṇadassanapaṭilābhāya saṃvattati? Idhāvuso, bhikkhu ālokasaññaṃ manasi karoti, divāsaññaṃ adhiṭṭhāti yathā divā tathā rattiṃ, yathā rattiṃ tathā divā. Iti vivaṭena cetasā apariyonaddhena sappabhāsaṃ cittaṃ bhāveti. Ayaṃ, āvuso samādhibhāvanā bhāvitā bahulīkatā ñāṇadassanapaṭilābhāya saṃvattati. ‘‘Katamā cāvuso, samādhibhāvanā bhāvitā bahulīkatā satisampajaññāya saṃvattati? Idhāvuso, bhikkhuno viditā vedanā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti. Viditā saññā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti. Viditā vitakkā uppajjanti, viditā upaṭṭhahanti, viditā abbhatthaṃ gacchanti. Ayaṃ, āvuso, samādhibhāvanā bhāvitā bahulīkatā satisampajaññāya saṃvattati. ‘‘Katamā cāvuso, samādhibhāvanā bhāvitā bahulīkatā āsavānaṃ khayāya saṃvattati? Idhāvuso, bhikkhu pañcasu upādānakkhandhesu udayabbayānupassī viharati. Iti rūpaṃ, iti rūpassa samudayo, iti rūpassa atthaṅgamo. Iti vedanā…pe… iti saññā… iti saṅkhārā… iti viññāṇaṃ, iti viññāṇassa samudayo, iti viññāṇassa atthaṅgamo. Ayaṃ, āvuso, samādhibhāvanā bhāvitā bahulīkatā āsavānaṃ khayāya saṃvattati.",
      "english": "\"There are these four developments of concentration. In one case, a development of concentration, when developed and cultivated, leads to pleasant abiding here and now. In one case, a development of concentration, when developed and cultivated, leads to the attainment of knowledge and vision. In one case, a development of concentration, when developed and cultivated, leads to mindfulness and alertness. In one case, a development of concentration, when developed and cultivated, leads to the destruction of the taints.\n\n\"And what, friends, is the development of concentration that, when developed and cultivated, leads to pleasant abiding here and now? Here, friends, quite secluded from sensual pleasures, secluded from unwholesome states, a bhikkhu enters and abides in the first jhāna, which is accompanied by applied and sustained thought…and then the fourth jhāna. This, friends, is the development of concentration that, when developed and cultivated, leads to pleasant abiding here and now.\n\n\"And what, friends, is the development of concentration that, when developed and cultivated, leads to the attainment of knowledge and vision? Here, friends, a bhikkhu attends to the perception of light, establishes the perception of day. As during the day, so during the night; as during the night, so during the day. Thus, with a mind that is open and unconfined, he develops a mind that is radiant. This, friends, is the development of concentration that, when developed and cultivated, leads to the attainment of knowledge and vision.\n\n\"And what, friends, is the development of concentration that, when developed and cultivated, leads to mindfulness and alertness? Here, friends, a bhikkhu understands feeling when it arises, understands when it is present, and understands when it disappears. He understands perception when it arises, understands when it is present, and understands when it disappears. He understands thought when it arises, understands when it is present, and understands when it disappears. This, friends, is the development of concentration that, when developed and cultivated, leads to mindfulness and alertness.\n\n\"And what, friends, is the development of concentration that, when developed and cultivated, leads to the destruction of the taints? Here, friends, a bhikkhu abides contemplating rise and fall in the five aggregates subject to clinging. Thus: 'Such is form, such is the arising of form, such is the passing away of form. Such is feeling… Such is perception… Such are mental formations… Such is consciousness, such is the arising of consciousness, such is the passing away of consciousness.' This, friends, is the development of concentration that, when developed and cultivated, leads to the destruction of the taints.\"",
      "sinhala": "‘‘ආවුසෝ, සමාධි භාවනා සතරෙකි. ආවුසෝ, භාවනා වඩන ලද, බහුල කරන ලද කවර සමාධි භාවනාවක් දෘෂ්ටධර්ම සුඛ විහරණය පිණිස පවතියි ද? ආවුසෝ, භාවනා වඩන ලද, බහුල කරන ලද කවර සමාධි භාවනාවක් ඥාණ දර්ශන ප්‍රතිලාභය පිණිස පවතියි ද? ආවුසෝ, භාවනා වඩන ලද, බහුල කරන ලද කවර සමාධි භාවනාවක් සති සම්පජඤ්ඤය පිණිස පවතියි ද? ආවුසෝ, භාවනා වඩන ලද, බහුල කරන ලද කවර සමාධි භාවනාවක් ආශ‍්‍රවයන්ගේ ක්ෂය පිණිස පවතියි ද?\n\n‘‘ආවුසෝ, භාවනා වඩන ලද, බහුල කරන ලද කවර සමාධි භාවනාවක් දෘෂ්ටධර්ම සුඛ විහරණය පිණිස පවතියි ද යත්: ආවුසෝ, මෙහි භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම විතර්ක සහිතව...පෙ... සතරවන ධ්‍යානයට පැමිණ වාසය කරයි. ආවුසෝ, මේ භාවනා වඩන ලද, බහුල කරන ලද සමාධි භාවනාව දෘෂ්ටධර්ම සුඛ විහරණය පිණිස පවතියි.\n\n‘‘ආවුසෝ, භාවනා වඩන ලද, බහුල කරන ලද කවර සමාධි භාවනාවක් ඥාණ දර්ශන ප්‍රතිලාභය පිණිස පවතියි ද යත්: ආවුසෝ, මෙහි භික්ෂුව ආලෝක සංඥාව මෙනෙහි කරයි. දිවා සංඥාව අධිෂ්ඨාන කරයි. යම්සේ දිවාද, එසේ රාත්‍රිය ද, යම්සේ රාත්‍රිය ද, එසේ දිවා ද වෙයි. මෙසේ විවෘත වූ සිතින්, වැසී නොගිය සිතින් යුතුව බබළන සිත වඩයි. ආවුසෝ, මේ භාවනා වඩන ලද, බහුල කරන ලද සමාධි භාවනාව ඥාණ දර්ශන ප්‍රතිලාභය පිණිස පවතියි.\n\n‘‘ආවුසෝ, භාවනා වඩන ලද, බහුල කරන ලද කවර සමාධි භාවනාවක් සති සම්පජඤ්ඤය පිණිස පවතියි ද යත්: ආවුසෝ, මෙහි භික්ෂුවට වේදනාවන් හටගන්නා බව දන්නේ ය, පවත්නා බව දන්නේ ය, නැතිවී යන බව දන්නේ ය. සංඥාවන් හටගන්නා බව දන්නේ ය, පවත්නා බව දන්නේ ය, නැතිවී යන බව දන්නේ ය. විතර්කයන් හටගන්නා බව දන්නේ ය, පවත්නා බව දන්නේ ය, නැතිවී යන බව දන්නේ ය. ආවුසෝ, මේ භාවනා වඩන ලද, බහුල කරන ලද සමාධි භාවනාව සති සම්පජඤ්ඤය පිණිස පවතියි.\n\n‘‘ආවුසෝ, භාවනා වඩන ලද, බහුල කරන ලද කවර සමාධි භාවනාවක් ආශ‍්‍රවයන්ගේ ක්ෂය පිණිස පවතියි ද යත්: ආවුසෝ, මෙහි භික්ෂුව පඤ්ච උපාදානස්කන්ධයන්හි උදය වැය දක්නා සුලූව වාසය කරයි. මෙසේ රූපය, මෙසේ රූපයාගේ හටගැනීම, මෙසේ රූපයාගේ නැතිවීම වෙයි. මෙසේ වේදනාව...පෙ... මෙසේ සංඥාව... මෙසේ සංස්කාර... මෙසේ විඤ්ඤාණය, මෙසේ විඤ්ඤාණයාගේ හටගැනීම, මෙසේ විඤ්ඤාණයාගේ නැතිවීම වෙයි. ආවුසෝ, මේ භාවනා වඩන ලද, බහුල කරන ලද සමාධි භාවනාව ආශ‍්‍රවයන්ගේ ක්ෂය පිණිස පවතියි.",
      "paliTitle": ""
    },
    {
      "number": 308,
      "pali": "‘‘Catasso appamaññā. Idhāvuso, bhikkhu mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati. Tathā dutiyaṃ. Tathā tatiyaṃ. Tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena [abyāpajjhena (sī. syā. kaṃ. pī.)] pharitvā viharati. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati. Tathā dutiyaṃ. Tathā tatiyaṃ. Tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. ‘‘Cattāro āruppā. [arūpā (syā. kaṃ. pī.)] Idhāvuso, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. ‘‘Cattāri apassenāni. Idhāvuso, bhikkhu saṅkhāyekaṃ paṭisevati, saṅkhāyekaṃ adhivāseti, saṅkhāyekaṃ parivajjeti, saṅkhāyekaṃ vinodeti.",
      "english": "\"Four boundless states. Here, friend, a bhikkhu dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus above, below, across, everywhere, and in every way, he dwells pervading the entire world with a mind imbued with loving-kindness, vast, exalted, boundless, without hostility, and without ill-will. He dwells pervading one direction with a mind imbued with compassion…pe… He dwells pervading one direction with a mind imbued with gladness…pe… He dwells pervading one direction with a mind imbued with equanimity, likewise the second, likewise the third, likewise the fourth. Thus above, below, across, everywhere, and in every way, he dwells pervading the entire world with a mind imbued with equanimity, vast, exalted, boundless, without hostility, and without ill-will.\n\n\"Four immaterial attainments. Here, friend, a bhikkhu, with the complete surmounting of perceptions of form, with the passing away of perceptions of sensory impingement, with non-attention to perceptions of diversity, thinking, ‘Space is infinite,’ attains to and dwells in the sphere of infinite space. With the complete surmounting of the sphere of infinite space, thinking, ‘Consciousness is infinite,’ he attains to and dwells in the sphere of infinite consciousness. With the complete surmounting of the sphere of infinite consciousness, thinking, ‘There is nothing,’ he attains to and dwells in the sphere of nothingness. With the complete surmounting of the sphere of nothingness, he attains to and dwells in the sphere of neither-perception-nor-non-perception.\n\n\"Four kinds of avoidance. Here, friend, a bhikkhu, considering, makes use of one thing; considering, he endures one thing; considering, he avoids one thing; considering, he dispels one thing.",
      "sinhala": "‘‘අප්පමඤ්ඤා සතරෙකි. ඇවැත්නි, මෙහි භික්ෂුව මෛත්‍රී සහගත සිතින් එක් දිසාවක් ස්පර්ශ කොට වාසය කරයි. එසේම දෙවන දිසාව ස්පර්ශ කරයි. එසේම තුන්වන දිසාව ස්පර්ශ කරයි. එසේම සිව්වන දිසාව ස්පර්ශ කරයි. මෙසේ උඩ යට සරස දිසා භාගයන්හි සියලු තන්හි සියලු සත්වයන් කෙරෙහි මෛත්‍රී සහගත වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ක්‍රෝධ රහිත වූ සිතින් මුළු ලෝකය ස්පර්ශ කොට වාසය කරයි. කරුණා සහගත සිතින්…පෙ… මුදිතා සහගත සිතින්…පෙ… උපේක්ෂා සහගත සිතින් එක් දිසාවක් ස්පර්ශ කොට වාසය කරයි. එසේම දෙවන දිසාව ස්පර්ශ කරයි. එසේම තුන්වන දිසාව ස්පර්ශ කරයි. එසේම සිව්වන දිසාව ස්පර්ශ කරයි. මෙසේ උඩ යට සරස දිසා භාගයන්හි සියලු තන්හි සියලු සත්වයන් කෙරෙහි උපේක්ෂා සහගත වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ක්‍රෝධ රහිත වූ සිතින් මුළු ලෝකය ස්පර්ශ කොට වාසය කරයි.’’\n\n‘‘ආරූපාවචර සතරෙකි. ඇවැත්නි, මෙහි භික්ෂුව සියලු ආකාරයෙන් රූප සංඥාවන් ඉක්මවා, පටිඝ සංඥාවන්ගේ අස්තංගමයෙන්, නානත්ව සංඥාවන්ගේ අමනසිකාරයෙන් ‘අනන්ත වූ ආකාශය’ යැයි ආකාසානඤ්චායතනය උපසම්පදා කොට වාසය කරයි. සියලු ආකාරයෙන් ආකාසානඤ්චායතනය ඉක්මවා ‘අනන්ත වූ විඤ්ඤාණය’ යැයි විඤ්ඤාණඤ්චායතනය උපසම්පදා කොට වාසය කරයි. සියලු ආකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා ‘කිසිවක් නැත’ යැයි ආකිඤ්චඤ්ඤායතනය උපසම්පදා කොට වාසය කරයි. සියලු ආකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනය උපසම්පදා කොට වාසය කරයි.’’\n\n‘‘අපස්සෙන සතරෙකි. ඇවැත්නි, මෙහි භික්ෂුව සලකා බලා ඇතැමෙක් සේවනය කරයි. සලකා බලා ඇතැමෙක් ඉවසයි. සලකා බලා ඇතැමෙක් වළක්වයි. සලකා බලා ඇතැමෙක් දුරු කරයි.",
      "paliTitle": ""
    },
    {
      "number": 309,
      "pali": "‘‘Cattāro ariyavaṃsā. Idhāvuso, bhikkhu santuṭṭho hoti itarītarena cīvarena, itarītaracīvarasantuṭṭhiyā ca vaṇṇavādī, na ca cīvarahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca cīvaraṃ na paritassati, laddhā ca cīvaraṃ agadhito [agathito (sī. pī.)] amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati; tāya ca pana itarītaracīvarasantuṭṭhiyā nevattānukkaṃseti na paraṃ vambheti. Yo hi tattha dakkho analaso sampajāno paṭissato, ayaṃ vuccatāvuso – ‘bhikkhu porāṇe aggaññe ariyavaṃse ṭhito’. ‘‘Puna caparaṃ, āvuso, bhikkhu santuṭṭho hoti itarītarena piṇḍapātena, itarītarapiṇḍapātasantuṭṭhiyā ca vaṇṇavādī, na ca piṇḍapātahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca piṇḍapātaṃ na paritassati, laddhā ca piṇḍapātaṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati; tāya ca pana itarītarapiṇḍapātasantuṭṭhiyā nevattānukkaṃseti na paraṃ vambheti. Yo hi tattha dakkho analaso sampajāno paṭissato, ayaṃ vuccatāvuso – ‘bhikkhu porāṇe aggaññe ariyavaṃse ṭhito’. ‘‘Puna caparaṃ, āvuso, bhikkhu santuṭṭho hoti itarītarena senāsanena, itarītarasenāsanasantuṭṭhiyā ca vaṇṇavādī, na ca senāsanahetu anesanaṃ appatirūpaṃ āpajjati; aladdhā ca senāsanaṃ na paritassati, laddhā ca senāsanaṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati; tāya ca pana itarītarasenāsanasantuṭṭhiyā nevattānukkaṃseti na paraṃ vambheti. Yo hi tattha dakkho analaso sampajāno paṭissato, ayaṃ vuccatāvuso – ‘bhikkhu porāṇe aggaññe ariyavaṃse ṭhito’. ‘‘Puna caparaṃ, āvuso, bhikkhu pahānārāmo hoti pahānarato, bhāvanārāmo hoti bhāvanārato; tāya ca pana pahānārāmatāya pahānaratiyā bhāvanārāmatāya bhāvanāratiyā nevattānukkaṃseti na paraṃ vambheti. Yo hi tattha dakkho analaso sampajāno paṭissato ayaṃ vuccatāvuso – ‘bhikkhu porāṇe aggaññe ariyavaṃse ṭhito’.",
      "english": "\"There are these four noble lineages. Here, a bhikkhu is content with whatever robes he obtains, and he speaks in praise of contentment with whatever robes he obtains; and he does not resort to improper or forbidden ways for the sake of robes. And if he does not obtain robes, he is not worried; and having obtained robes, he uses them unattached, uninfatuated, unabsorbed, seeing the danger in them, understanding the escape from them; and through that contentment with whatever robes he obtains, he does not exalt himself or disparage others. For a bhikkhu who is skilled in these qualities, not lazy, fully aware, and mindful, is said to be established in the ancient, original, noble lineage.\n\n\"Furthermore, a bhikkhu is content with whatever alms food he obtains, and he speaks in praise of contentment with whatever alms food he obtains; and he does not resort to improper or forbidden ways for the sake of alms food. And if he does not obtain alms food, he is not worried; and having obtained alms food, he uses it unattached, uninfatuated, unabsorbed, seeing the danger in it, understanding the escape from it; and through that contentment with whatever alms food he obtains, he does not exalt himself or disparage others. For a bhikkhu who is skilled in these qualities, not lazy, fully aware, and mindful, is said to be established in the ancient, original, noble lineage.\n\n\"Furthermore, a bhikkhu is content with whatever dwelling he obtains, and he speaks in praise of contentment with whatever dwelling he obtains; and he does not resort to improper or forbidden ways for the sake of a dwelling. And if he does not obtain a dwelling, he is not worried; and having obtained a dwelling, he uses it unattached, uninfatuated, unabsorbed, seeing the danger in it, understanding the escape from it; and through that contentment with whatever dwelling he obtains, he does not exalt himself or disparage others. For a bhikkhu who is skilled in these qualities, not lazy, fully aware, and mindful, is said to be established in the ancient, original, noble lineage.\n\n\"Furthermore, a bhikkhu delights in abandoning defilements, is devoted to abandoning defilements, delights in developing wholesome qualities, and is devoted to developing wholesome qualities; and through that delight in abandoning defilements, devotion to abandoning defilements, delight in developing wholesome qualities, and devotion to developing wholesome qualities, he does not exalt himself or disparage others. For a bhikkhu who is skilled in these qualities, not lazy, fully aware, and mindful, is said to be established in the ancient, original, noble lineage.\"",
      "sinhala": "‘‘ආර්‍ය වංශ හතරක් ඇත. ඇවැත්නි, මෙහි භික්ෂුව යම් පමණකින් ලැබුණ සිවුරකින් සතුටු වෙයි ද, එසේ ලැබුණු සිවුරෙන් සතුටුවීමෙහි ගුණ කියයි ද, සිවුරු හේතුවෙන් නුසුදුසු අනේසනාවෙහි නොයෙළෙයි ද, සිවුරු නොලැබු‍ණ කල්හි නොතැවෙයි ද, සිවුරු ලැබු‍ණ කල්හි නොඇලෙයි ද, නොඇලී වාසය කෙරෙයි ද, නොගැටෙයි ද, එහි ආදීනව දකියි ද, නිස්සරණ ප්‍රඥා ඇතිව පරිභෝග කරයි ද, එහෙයින් යම් පමණකින් ලැබුණු සිවුරෙන් සතුටුවීම නිසා තමා උසස් කොට නොසලකයි ද, අනුන් හෙළා නොදකියි ද, යමෙක් එහි දක්ෂ වේ ද, අලස නොවී වීර්යය කරයි ද, මනා සිහියෙන් යුක්ත වේ ද, ආරක්ෂා සහිත වේ ද, ඇවැත්නි, මොහු ‘පැරණි වූ අග්‍ර වූ ආර්‍ය වංශයෙහි පිහිටි භික්ෂුව’ යැයි කියනු ලැබේ.\n\n‘‘තවද ඇවැත්නි, භික්ෂුව යම් පමණකින් ලැබුණු පිණ්ඩපාතයෙන් සතුටු වෙයි ද, එසේ ලැබුණු පිණ්ඩපාතයෙන් සතුටුවීමෙහි ගුණ කියයි ද, පිණ්ඩපාතය හේතුවෙන් නුසුදුසු අනේසනාවෙහි නොයෙළෙයි ද, පිණ්ඩපාතය නොලැබු‍ණ කල්හි නොතැවෙයි ද, පිණ්ඩපාතය ලැබු‍ණ කල්හි නොඇලෙයි ද, නොඇලී වාසය කෙරෙයි ද, නොගැටෙයි ද, එහි ආදීනව දකියි ද, නිස්සරණ ප්‍රඥා ඇතිව පරිභෝග කරයි ද, එහෙයින් යම් පමණකින් ලැබුණු පිණ්ඩපාතයෙන් සතුටුවීම නිසා තමා උසස් කොට නොසලකයි ද, අනුන් හෙළා නොදකියි ද, යමෙක් එහි දක්ෂ වේ ද, අලස නොවී වීර්යය කරයි ද, මනා සිහියෙන් යුක්ත වේ ද, ආරක්ෂා සහිත වේ ද, ඇවැත්නි, මොහු ‘පැරණි වූ අග්‍ර වූ ආර්‍ය වංශයෙහි පිහිටි භික්ෂුව’ යැයි කියනු ලැබේ.\n\n‘‘තවද ඇවැත්නි, භික්ෂුව යම් පමණකින් ලැබුණු සෙනසුනෙන් සතුටු වෙයි ද, එසේ ලැබුණු සෙනසුනෙන් සතුටුවීමෙහි ගුණ කියයි ද, සෙනසුන හේතුවෙන් නුසුදුසු අනේසනාවෙහි නොයෙළෙයි ද, සෙනසුන නොලැබු‍ණ කල්හි නොතැවෙයි ද, සෙනසුන ලැබු‍ණ කල්හි නොඇලෙයි ද, නොඇලී වාසය කෙරෙයි ද, නොගැටෙයි ද, එහි ආදීනව දකියි ද, නිස්සරණ ප්‍රඥා ඇතිව පරිභෝග කරයි ද, එහෙයින් යම් පමණකින් ලැබුණු සෙනසුනෙන් සතුටුවීම නිසා තමා උසස් කොට නොසලකයි ද, අනුන් හෙළා නොදකියි ද, යමෙක් එහි දක්ෂ වේ ද, අලස නොවී වීර්යය කරයි ද, මනා සිහියෙන් යුක්ත වේ ද, ආරක්ෂා සහිත වේ ද, ඇවැත්නි, මොහු ‘පැරණි වූ අග්‍ර වූ ආර්‍ය වංශයෙහි පිහිටි භික්ෂුව’ යැයි කියනු ලැබේ.\n\n‘‘තවද ඇවැත්නි, භික්ෂුව ප්‍රහාණයෙහි ඇලුණේ වෙයි ද, ප්‍රහාණයෙහි ඇලුම් ඇත්තේ වෙයි ද, භාවනාවෙහි ඇලුණේ වෙයි ද, භාවනාවෙහි ඇලුම් ඇත්තේ වෙයි ද, එහෙයින් යම් පමණකින් ප්‍රහාණයෙහි ඇලීම නිසා ද, ප්‍රහාණයෙහි ඇලුම් ඇතිවීම නිසා ද, භාවනාවෙහි ඇලීම නිසා ද, භාවනාවෙහි ඇලුම් ඇතිවීම නිසා ද, තමා උසස් කොට නොසලකයි ද, අනුන් හෙළා නොදකියි ද, යමෙක් එහි දක්ෂ වේ ද, අලස නොවී වීර්යය කරයි ද, මනා සිහියෙන් යුක්ත වේ ද, ආරක්ෂා සහිත වේ ද, ඇවැත්නි, මොහු ‘පැරණි වූ අග්‍ර වූ ආර්‍ය වංශයෙහි පිහිටි භික්ෂුව’ යැයි කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 310,
      "pali": "‘‘Cattāri padhānāni. Saṃvarapadhānaṃ pahānapadhānaṃ bhāvanāpadhānaṃ [bhāvanāppadhānaṃ (syā.)] anurakkhaṇāpadhānaṃ [anurakkhanāppadhānaṃ (syā.)]. Katamañcāvuso, saṃvarapadhānaṃ? Idhāvuso, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati, rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati, rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. Idaṃ vuccatāvuso, saṃvarapadhānaṃ. ‘‘Katamañcāvuso, pahānapadhānaṃ? Idhāvuso, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti pajahati vinodeti byantiṃ karoti [byantī karoti (syā. kaṃ.)] anabhāvaṃ gameti. Uppannaṃ byāpādavitakkaṃ…pe… uppannaṃ vihiṃsāvitakkaṃ… uppannuppanne pāpake akusale dhamme nādhivāseti pajahati vinodeti byantiṃ karoti anabhāvaṃ gameti. Idaṃ vuccatāvuso, pahānapadhānaṃ. ‘‘Katamañcāvuso, bhāvanāpadhānaṃ? Idhāvuso, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Dhammavicayasambojjhaṅgaṃ bhāveti… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Idaṃ vuccatāvuso, bhāvanāpadhānaṃ. ‘‘Katamañcāvuso, anurakkhaṇāpadhānaṃ? Idhāvuso, bhikkhu uppannaṃ bhadrakaṃ [bhaddakaṃ (syā. kaṃ. pī.)] samādhinimittaṃ anurakkhati – aṭṭhikasaññaṃ, puḷuvakasaññaṃ [puḷavakasaññaṃ (sī. pī.)], vinīlakasaññaṃ, vicchiddakasaññaṃ, uddhumātakasaññaṃ. Idaṃ vuccatāvuso, anurakkhaṇāpadhānaṃ. ‘‘Cattāri ñāṇāni – dhamme ñāṇaṃ, anvaye ñāṇaṃ, pariye [paricce (sī. ka.), paricchede (syā. pī. ka.) ṭīkā oloketabbā] ñāṇaṃ, sammutiyā ñāṇaṃ [sammatiñāṇaṃ (syā. kaṃ.)]. ‘‘Aparānipi cattāri ñāṇāni – dukkhe ñāṇaṃ, dukkhasamudaye ñāṇaṃ, dukkhanirodhe ñāṇaṃ, dukkhanirodhagāminiyā paṭipadāya ñāṇaṃ.",
      "english": "\"There are these four efforts. The effort of restraint, the effort of abandoning, the effort of developing, and the effort of maintaining. And what, friends, is the effort of restraint? Here, friends, a bhikkhu, seeing a form with the eye, is neither a taker of signs nor details. Because those evil, unwholesome qualities of covetousness and displeasure might invade him if he dwells unrestrained in the eye faculty, he practices restraint for its control, he guards the eye faculty, he undertakes the restraint of the eye faculty. Hearing a sound with the ear... Smelling an odor with the nose... Tasting a flavor with the tongue... Touching a tangible object with the body... Cognizing a mental object with the mind, he is neither a taker of signs nor details. Because those evil, unwholesome qualities of covetousness and displeasure might invade him if he dwells unrestrained in the mind faculty, he practices restraint for its control, he guards the mind faculty, he undertakes the restraint of the mind faculty. This is called, friends, the effort of restraint. And what, friends, is the effort of abandoning? Here, friends, a bhikkhu does not tolerate an arisen thought of sensual desire; he abandons it, dispels it, brings it to an end, makes it not exist. An arisen thought of ill will... An arisen thought of harmfulness... He does not tolerate arisen evil, unwholesome qualities; he abandons them, dispels them, brings them to an end, makes them not exist. This is called, friends, the effort of abandoning. And what, friends, is the effort of developing? Here, friends, a bhikkhu develops the mindfulness enlightenment factor, which is dependent on seclusion, dependent on dispassion, dependent on cessation, resulting in relinquishment. He develops the investigation of phenomena enlightenment factor... He develops the energy enlightenment factor... He develops the rapture enlightenment factor... He develops the tranquility enlightenment factor... He develops the concentration enlightenment factor... He develops the equanimity enlightenment factor, which is dependent on seclusion, dependent on dispassion, dependent on cessation, resulting in relinquishment. This is called, friends, the effort of developing. And what, friends, is the effort of maintaining? Here, friends, a bhikkhu maintains an arisen good sign of concentration: the perception of a skeleton, the perception of a worm-infested corpse, the perception of a bluish corpse, the perception of a fissured corpse, the perception of a bloated corpse. This is called, friends, the effort of maintaining. There are these four knowledges: knowledge of the Dhamma, knowledge of inference, knowledge of definition, knowledge of convention. And also these four knowledges: knowledge of suffering, knowledge of the origin of suffering, knowledge of the cessation of suffering, knowledge of the path leading to the cessation of suffering.\"",
      "sinhala": "‘‘ප්‍රධාන වීර්ය්‍ය සතරකි. සංවර ප්‍රධානය, ප්‍රහාණ ප්‍රධානය, භාවනා ප්‍රධානය, අනුරක්ෂණ ප්‍රධානය යන ඒවායි. ආවුසෝ, සංවර ප්‍රධානය යනු කවරේද? ආවුසෝ, මෙහි භික්ෂුව ඇසින් රූපයක් දැක එහි නිමිති නොගන්නේය. අනු වැഞ്ජනද නොගන්නේය. යම් හෙයකින් ඇස නමැති ඉන්ද්‍රිය සංවර කර නොගෙන වාසය කරන ඔහු කෙරෙහි අභිධ්‍යා දෝමනස්ස යන පාපී අකුසල ධර්ම ගලා එත්ද, එය සංවර කිරීම පිණිස පිළිපදියි. ඇස නමැති ඉන්ද්‍රිය රකියි. ඇස නමැති ඉන්ද්‍රියෙහි සංවරයට පැමිණෙයි. කනින් ශබ්දයක් අසා... නාසයෙන් ගන්ධයක් ආඝ්‍රාණය කොට... දිවෙන් රසයක් විඳ... කයින් පහසක් ස්පර්ශ කොට... මනසින් අරමුණක් දැන එහි නිමිති නොගන්නේය. අනු වැഞ്ජනද නොගන්නේය. යම් හෙයකින් මනස නමැති ඉන්ද්‍රිය සංවර කර නොගෙන වාසය කරන ඔහු කෙරෙහි අභිධ්‍යා දෝමනස්ස යන පාපී අකුසල ධර්ම ගලා එත්ද, එය සංවර කිරීම පිණිස පිළිපදියි. මනස නමැති ඉන්ද්‍රිය රකියි. මනස නමැති ඉන්ද්‍රියෙහි සංවරයට පැමිණෙයි. ආවුසෝ, මෙය සංවර ප්‍රධානය යයි කියනු ලැබේ. ‘‘ආවුසෝ, ප්‍රහාණ ප්‍රධානය යනු කවරේද? ආවුසෝ, මෙහි භික්ෂුව උපන් කාම විතර්කය ඉවසන්නේ නැත. දුරු කරයි. විනාශ කරයි. නැති කරයි. අභාවයට පමුණුවයි. උපන් ව්‍යාපාද විතර්කය...පෙ... උපන් විහිංසා විතර්කය... උපන් උපන් පාපී අකුසල ධර්ම ඉවසන්නේ නැත. දුරු කරයි. විනාශ කරයි. නැති කරයි. අභාවයට පමුණුවයි. ආවුසෝ, මෙය ප්‍රහාණ ප්‍රධානය යයි කියනු ලැබේ. ‘‘ආවුසෝ, භාවනා ප්‍රධානය යනු කවරේද? ආවුසෝ, මෙහි භික්ෂුව විවේකය මත පිහිටි, විරාගය මත පිහිටි, නිරෝධය මත පිහිටි, අත්හැරීමෙන් කෙළවර වූ සති සම්බොජ්ඣංගය වඩයි. ධර්ම විචය සම්බොජ්ඣංගය වඩයි... වීර්ය්‍ය සම්බොජ්ඣංගය වඩයි... ප්‍රීති සම්බොජ්ඣංගය වඩයි... ප්‍රශ්‍රබ්ධි සම්බොජ්ඣංගය වඩයි... සමාධි සම්බොජ්ඣංගය වඩයි... උපේක්ෂා සම්බොජ්ඣංගය වඩයි. විවේකය මත පිහිටි, විරාගය මත පිහිටි, නිරෝධය මත පිහිටි, අත්හැරීමෙන් කෙළවර වූ සති සම්බොජ්ඣංගය වඩයි. ආවුසෝ, මෙය භාවනා ප්‍රධානය යයි කියනු ලැබේ. ‘‘ආවුසෝ, අනුරක්ෂණ ප්‍රධානය යනු කවරේද? ආවුසෝ, මෙහි භික්ෂුව උපන් යම් යහපත් සමාධි නිමිත්තක් වේද එය ආරක්ෂා කරයි. එනම් අස්ථි සංඥාව, පණුවන් ගැසූ මළ සිරුර පිළිබඳ සංඥාව, නිල් පැහැ ගැන්වුණු මළ සිරුර පිළිබඳ සංඥාව, සිදුරු ඇති මළ සිරුර පිළිබඳ සංඥාව, ඉදිමුණු මළ සිරුර පිළිබඳ සංඥාව යන ඒවායි. ආවුසෝ, මෙය අනුරක්ෂණ ප්‍රධානය යයි කියනු ලැබේ. ‘‘ඥාන සතරකි. එනම් ධර්මය පිළිබඳ ඥානය, අන්වය පිළිබඳ ඥානය, පර්‍යය පිළිබඳ ඥානය, සම්මුතිය පිළිබඳ ඥානය යන ඒවායි. ‘‘තවත් ඥාන සතරකි. එනම් දුක පිළිබඳ ඥානය, දුක්ඛ සමුදය පිළිබඳ ඥානය, දුක්ඛ නිරෝධය පිළිබඳ ඥානය, දුක්ඛ නිරෝධයට පමුණුවන මාර්ගය පිළිබඳ ඥානය යන ඒවායි.",
      "paliTitle": ""
    },
    {
      "number": 311,
      "pali": "‘‘Cattāri sotāpattiyaṅgāni – sappurisasaṃsevo, saddhammassavanaṃ, yonisomanasikāro, dhammānudhammappaṭipatti. ‘‘Cattāri sotāpannassa aṅgāni. Idhāvuso, ariyasāvako buddhe aveccappasādena samannāgato hoti – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho, bhagavā’ti. Dhamme aveccappasādena samannāgato hoti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko [opanayiko (syā. kaṃ.)] paccattaṃ veditabbo viññūhī’ti. Saṅghe aveccappasādena samannāgato hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho ujuppaṭipanno bhagavato sāvakasaṅgho ñāyappaṭipanno bhagavato sāvakasaṅgho sāmīcippaṭipanno bhagavato sāvakasaṅgho yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā, esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Ariyakantehi sīlehi samannāgato hoti akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi. ‘‘Cattāri sāmaññaphalāni – sotāpattiphalaṃ, sakadāgāmiphalaṃ, anāgāmiphalaṃ, arahattaphalaṃ. ‘‘Catasso dhātuyo – pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu. ‘‘Cattāro āhārā – kabaḷīkāro āhāro oḷāriko vā sukhumo vā, phasso dutiyo, manosañcetanā tatiyā, viññāṇaṃ catutthaṃ. ‘‘Catasso viññāṇaṭṭhitiyo. Rūpūpāyaṃ vā, āvuso, viññāṇaṃ tiṭṭhamānaṃ tiṭṭhati rūpārammaṇaṃ [rūpāramaṇaṃ (?)] rūpappatiṭṭhaṃ nandūpasecanaṃ vuddhiṃ virūḷhiṃ vepullaṃ āpajjati; vedanūpāyaṃ vā āvuso…pe… saññūpāyaṃ vā, āvuso…pe… saṅkhārūpāyaṃ vā, āvuso, viññāṇaṃ tiṭṭhamānaṃ tiṭṭhati saṅkhārārammaṇaṃ saṅkhārappatiṭṭhaṃ nandūpasecanaṃ vuddhiṃ virūḷhiṃ vepullaṃ āpajjati. ‘‘Cattāri agatigamanāni – chandāgatiṃ gacchati, dosāgati gacchati, mohāgatiṃ gacchati, bhayāgatiṃ gacchati. ‘‘Cattāro taṇhuppādā – cīvarahetu vā, āvuso, bhikkhuno taṇhā uppajjamānā uppajjati; piṇḍapātahetu vā, āvuso, bhikkhuno taṇhā uppajjamānā uppajjati; senāsanahetu vā, āvuso, bhikkhuno taṇhā uppajjamānā uppajjati; itibhavābhavahetu vā, āvuso, bhikkhuno taṇhā uppajjamānā uppajjati. ‘‘Catasso paṭipadā – dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā. ‘‘Aparāpi catasso paṭipadā – akkhamā paṭipadā, khamā paṭipadā, damā paṭipadā, samā paṭipadā. ‘‘Cattāri dhammapadāni – anabhijjhā dhammapadaṃ, abyāpādo dhammapadaṃ, sammāsati dhammapadaṃ, sammāsamādhi dhammapadaṃ. ‘‘Cattāri dhammasamādānāni – atthāvuso, dhammasamādānaṃ paccuppannadukkhañceva āyatiñca dukkhavipākaṃ. Atthāvuso, dhammasamādānaṃ paccuppannadukkhaṃ āyatiṃ sukhavipākaṃ. Atthāvuso, dhammasamādānaṃ paccuppannasukhaṃ āyatiṃ dukkhavipākaṃ. Atthāvuso, dhammasamādānaṃ paccuppannasukhañceva āyatiñca sukhavipākaṃ. ‘‘Cattāro dhammakkhandhā – sīlakkhandho, samādhikkhandho, paññākkhandho, vimuttikkhandho. ‘‘Cattāri balāni – vīriyabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ. ‘‘Cattāri adhiṭṭhānāni – paññādhiṭṭhānaṃ, saccādhiṭṭhānaṃ, cāgādhiṭṭhānaṃ, upasamādhiṭṭhānaṃ.",
      "english": "\"There are these four factors of stream-entry: association with good people, hearing the true Dhamma, wise reflection, and practice in accordance with the Dhamma. These are the four qualities of a stream-enterer. Here, a noble disciple is endowed with confirmed confidence in the Buddha, thinking, ‘Indeed, the Blessed One is an Arahant, perfectly enlightened, accomplished in knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of those who can be trained, teacher of gods and humans, enlightened, blessed.’ They are endowed with confirmed confidence in the Dhamma, thinking, ‘The Dhamma is well proclaimed by the Blessed One, directly visible, immediate, inviting one to come and see, applicable, to be personally experienced by the wise.’ They are endowed with confirmed confidence in the Sangha, thinking, ‘The Sangha of the Blessed One’s disciples is practicing the good way, practicing the straight way, practicing the true way, practicing the proper way; that is, the four pairs of persons, the eight individual types—this Sangha of the Blessed One’s disciples is worthy of gifts, worthy of hospitality, worthy of offerings, worthy of reverential salutation, the unsurpassed field of merit for the world.’ They are endowed with the moral habits that are praised by the noble ones, unbroken, without gaps, unspotted, without blemishes, free, praised by the wise, uncorrupted, leading to concentration. These are the four fruits of reclusiveness: the fruit of stream-entry, the fruit of once-returning, the fruit of non-returning, and the fruit of Arahantship. These are the four elements: the earth element, the water element, the fire element, and the air element. These are the four nutriments: edible food, coarse or refined; contact as the second; mental volition as the third; and consciousness as the fourth. These are the four stations of consciousness. When consciousness remains established in dependence on form, supported by form, finding enjoyment there, it grows, increases, and expands. When consciousness remains established in dependence on feeling... When consciousness remains established in dependence on perception... When consciousness remains established in dependence on mental formations, supported by mental formations, finding enjoyment there, it grows, increases, and expands. These are the four ways of going to ruin: going to ruin through desire, going to ruin through hatred, going to ruin through delusion, going to ruin through fear. These are the four origins of craving: A bhikkhu’s craving, when arising, arises because of robes; a bhikkhu’s craving, when arising, arises because of alms-food; a bhikkhu’s craving, when arising, arises because of lodgings; a bhikkhu’s craving, when arising, arises because of this-and-that kind of existence. These are the four paths: the painful path with slow understanding, the painful path with quick understanding, the pleasant path with slow understanding, the pleasant path with quick understanding. And there are also these four paths: the path of intolerance, the path of tolerance, the path of taming, the path of calming. These are the four Dhamma-principles: the Dhamma-principle of non-covetousness, the Dhamma-principle of non-ill-will, the Dhamma-principle of right mindfulness, the Dhamma-principle of right concentration. These are the four kinds of commitment to principles: there is, friends, a commitment to principles that results in present suffering and future painful result. There is, friends, a commitment to principles that results in present suffering and future pleasant result. There is, friends, a commitment to principles that results in present pleasure and future painful result. There is, friends, a commitment to principles that results in present pleasure and future pleasant result. These are the four aggregates of Dhamma: the aggregate of moral conduct, the aggregate of concentration, the aggregate of wisdom, the aggregate of liberation. These are the four powers: the power of energy, the power of mindfulness, the power of concentration, the power of wisdom. These are the four determinations: the determination of wisdom, the determination of truth, the determination of generosity, the determination of tranquility.\"",
      "sinhala": "‘‘සතර සෝතාපත්ති අංගයෝ නම්: සත්පුරුෂ සේවනය, සද්ධර්මය ශ්‍රවණය කිරීම, යෝනිසෝ මනසිකාරය, ධර්මානුධර්ම ප්‍රතිපදාව යනුයි. ‘‘සතර සෝතාපන්න වූවහුගේ අංගයෝ වෙත්. මහණෙනි, මේ ලෝකයෙහි ආර්ය ශ්‍රාවක බුදුන් කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත වේ. එනම් ‘ඒ භාග්‍යවතුන් වහන්සේ අර්හත් වන සේක, සම්මා සම්බුද්ධ වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තර පුරිසදම්ම සාරථී වන සේක, දෙවි මිනිසුන්ගේ ශාස්තෘ වන සේක, බුද්ධ වන සේක, භාග්‍යවත් වන සේක’ යනුවෙනි. ධර්මය කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත වේ. ‘භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනාව දේශනා කරන ලද්දේ ය. එය ක්ෂණික නොවන, දැකිය හැකි, ‘එන්න, බලන්න’ යැයි කිව හැකි, තමා තුළටම ගෙන ආ හැකි, නුවණැත්තන් විසින් තම තමන්ගේ නුවණින්ම දැනගත යුත්තකි’ යනුවෙනි. සංඝයා කෙරෙහි නොසැලෙන පැහැදීමෙන් යුක්ත වේ. ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා යහපත් පිළිවෙතෙහි යෙදුණාහු වෙති. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා අවංක පිළිවෙතෙහි යෙදුණාහු වෙති. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ඥාය පිළිවෙතෙහි යෙදුණාහු වෙති. භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා සාමීචි පිළිවෙතෙහි යෙදුණාහු වෙති. එනම් පුරිස යුග සතරක් ද, පුරිස පුද්ගලයෝ අට දෙනෙක් ද වෙති. ඒ භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ආහුතිය ලැබීමට සුදුසු වෙති. පාහුතිය ලැබීමට සුදුසු වෙති. දක්ෂිණාව ලැබීමට සුදුසු වෙති. ඇ‍ඳිලි බැඳීමට සුදුසු වෙති. ලෝකයාගේ අනුත්තර පුණ්‍ය ක්ෂේත්‍රය වෙති’ යනුවෙනි. කැඩීම් නැති, සිදුරු නැති, කිලුටු නැති, කර්මාශ්‍රිත නොවන, තෘෂ්ණාවෙන් නිදහස් වූ, නුවණැත්තන් විසින් ප්‍රශංසා කරන ලද, (මිථ්‍යා දෘෂ්ටිවලින්) ස්පර්ශ නොකරන ලද, සමාධිය පිණිස පවතින ආර්යයන් විසින් ප්‍රිය කරන ලද සීලයන්ගෙන් යුක්ත වේ.\n\n‘‘සතර සාමඤ්ඤ ඵලයෝ නම්: සෝතාපත්ති ඵලය, සකදාගාමි ඵලය, අනාගාමි ඵලය, අරහත් ඵලය යනුයි.\n\n‘‘සතර ධාතුයෝ නම්: පඨවී ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යනුයි.\n\n‘‘සතර ආහාරයෝ නම්: කබලිංකාර ආහාරය, එය स्थूल හෝ සියුම් වේ. ස්පර්ශය දෙවැන්නයි. මනෝසංචේතනා තෙවැන්නයි. විඤ්ඤාණය සිව්වැන්නයි.\n\n‘‘සතර විඤ්ඤාණට්ඨිති නම්: ඇවැත්නි, රූපය උපයෝගී කරගෙන විඤ්ඤාණය පවතී නම්, රූපය අරමුණු කොට, රූපයෙහි පිහිටා, ඇලීම වඩමින්, වැඩීමත්, පැතිරීමත්, විශාල වීමත් කරා එළඹෙයි. ඇවැත්නි, වේදනාව උපයෝගී කරගෙන... ඇවැත්නි, සංඥාව උපයෝගී කරගෙන... ඇවැත්නි, සංස්කාර උපයෝගී කරගෙන විඤ්ඤාණය පවතී නම්, සංස්කාර අරමුණු කොට, සංස්කාරයෙහි පිහිටා, ඇලීම වඩමින්, වැඩීමත්, පැතිරීමත්, විශාල වීමත් කරා එළඹෙයි.\n\n‘‘සතර අගතිගාමී නම්: ඡන්දයෙන් අගතියට යයි. ද්වේෂයෙන් අගතියට යයි. මෝහයෙන් අගතියට යයි. භයෙන් අගතියට යයි.\n\n‘‘සතර තණ්හා උත්පාදයෝ නම්: ඇවැත්නි, භික්ෂුවට සිවුරු හේතු කොටගෙන තෘෂ්ණාව උපදින කල්හි උපදී. ඇවැත්නි, භික්ෂුවට පිණ්ඩපාතය හේතු කොටගෙන තෘෂ්ණාව උපදින කල්හි උපදී. ඇවැත්නි, භික්ෂුවට සෙනසුන හේතු කොටගෙන තෘෂ්ණාව උපදින කල්හි උපදී. ඇවැත්නි, භික්ෂුවට භවය හෝ අභවය හේතු කොටගෙන තෘෂ්ණාව උපදින කල්හි උපදී.\n\n‘‘සතර ප්‍රතිපදාවෝ නම්: දුක්ඛා පටිපදා දන්ධාභිඤ්ඤා, දුක්ඛා පටිපදා ඛිප්පාභිඤ්ඤා, සුඛා පටිපදා දන්ධාභිඤ්ඤා, සුඛා පටිපදා ඛිප්පාභිඤ්ඤා යනුයි.\n\n‘‘තවත් සතර ප්‍රතිපදාවෝ නම්: අක්ඛමා පටිපදා, ඛමා පටිපදා, දමා පටිපදා, සමා පටිපදා යනුයි.\n\n‘‘සතර ධම්මපදාවෝ නම්: අනභිජ්ඣා ධම්මපදං, අබ්‍යාපාදෝ ධම්මපදං, සම්මාසති ධම්මපදං, සම්මාසමාධි ධම්මපදං යනුයි.\n\n‘‘සතර ධම්මසමාදානයෝ නම්: ඇවැත්නි, ඇතැම් ධර්ම සමාදානයක් ඇත. එය වර්තමාන දුකට ද, මතු දුක් විපාකයට ද හේතු වේ. ඇවැත්නි, ඇතැම් ධර්ම සමාදානයක් ඇත. එය වර්තමාන දුකට ද, මතු සැප විපාකයට ද හේතු වේ. ඇවැත්නි, ඇතැම් ධර්ම සමාදානයක් ඇත. එය වර්තමාන සැපට ද, මතු දුක් විපාකයට ද හේතු වේ. ඇවැත්නි, ඇතැම් ධර්ම සමාදානයක් ඇත. එය වර්තමාන සැපට ද, මතු සැප විපාකයට ද හේතු වේ.\n\n‘‘සතර ධම්මක්ඛන්ධයෝ නම්: සීලක්ඛන්ධෝ, සමාධික්ඛන්ධෝ, පඤ්ඤාක්ඛන්ධෝ, විමුත්තික්ඛන්ධෝ යනුයි.\n\n‘‘සතර බලයෝ නම්: වීරිය බලං, සති බලං, සමාධි බලං, පඤ්ඤා බලං යනුයි.\n\n‘‘සතර අධිෂ්ඨානයෝ නම්: පඤ්ඤාධිට්ඨානං, සච්චාධිට්ඨානං, චාගාධිට්ඨානං, උපසමාධිට්ඨානං යනුයි.",
      "paliTitle": ""
    },
    {
      "number": 312,
      "pali": "‘‘Cattāri pañhabyākaraṇāni – [cattāro pañhābyākaraṇā (sī. syā. kaṃ. pī.)] ekaṃsabyākaraṇīyo pañho, paṭipucchābyākaraṇīyo pañho, vibhajjabyākaraṇīyo pañho, ṭhapanīyo pañho. ‘‘Cattāri kammāni – atthāvuso, kammaṃ kaṇhaṃ kaṇhavipākaṃ; atthāvuso, kammaṃ sukkaṃ sukkavipākaṃ; atthāvuso, kammaṃ kaṇhasukkaṃ kaṇhasukkavipākaṃ; atthāvuso, kammaṃ akaṇhaasukkaṃ akaṇhaasukkavipākaṃ kammakkhayāya saṃvattati. ‘‘Cattāro sacchikaraṇīyā dhammā – pubbenivāso satiyā sacchikaraṇīyo; sattānaṃ cutūpapāto cakkhunā sacchikaraṇīyo; aṭṭha vimokkhā kāyena sacchikaraṇīyā; āsavānaṃ khayo paññāya sacchikaraṇīyo. ‘‘Cattāro oghā – kāmogho, bhavogho, diṭṭhogho, avijjogho. ‘‘Cattāro yogā – kāmayogo, bhavayogo, diṭṭhiyogo, avijjāyogo. ‘‘Cattāro visaññogā – kāmayogavisaññogo, bhavayogavisaññogo, diṭṭhiyogavisaññogo, avijjāyogavisaññogo. ‘‘Cattāro ganthā – abhijjhā kāyagantho, byāpādo kāyagantho, sīlabbataparāmāso kāyagantho, idaṃsaccābhiniveso kāyagantho. ‘‘Cattāri upādānāni – kāmupādānaṃ [kāmūpādānaṃ (sī. pī.) evamitaresupi], diṭṭhupādānaṃ, sīlabbatupādānaṃ, attavādupādānaṃ. ‘‘Catasso yoniyo – aṇḍajayoni, jalābujayoni, saṃsedajayoni, opapātikayoni. ‘‘Catasso gabbhāvakkantiyo. Idhāvuso, ekacco asampajāno mātukucchiṃ okkamati, asampajāno mātukucchismiṃ ṭhāti, asampajāno mātukucchimhā nikkhamati, ayaṃ paṭhamā gabbhāvakkanti. Puna caparaṃ, āvuso, idhekacco sampajāno mātukucchiṃ okkamati, asampajāno mātukucchismiṃ ṭhāti, asampajāno mātukucchimhā nikkhamati, ayaṃ dutiyā gabbhāvakkanti. Puna caparaṃ, āvuso, idhekacco sampajāno mātukucchiṃ okkamati, sampajāno mātukucchismiṃ ṭhāti, asampajāno mātukucchimhā nikkhamati, ayaṃ tatiyā gabbhāvakkanti. Puna caparaṃ, āvuso, idhekacco sampajāno mātukucchiṃ okkamati, sampajāno mātukucchismiṃ ṭhāti, sampajāno mātukucchimhā nikkhamati, ayaṃ catutthā gabbhāvakkanti. ‘‘Cattāro attabhāvapaṭilābhā. Atthāvuso, attabhāvapaṭilābho, yasmiṃ attabhāvapaṭilābhe attasañcetanāyeva kamati, no parasañcetanā. Atthāvuso, attabhāvapaṭilābho, yasmiṃ attabhāvapaṭilābhe parasañcetanāyeva kamati, no attasañcetanā. Atthāvuso, attabhāvapaṭilābho, yasmiṃ attabhāvapaṭilābhe attasañcetanā ceva kamati parasañcetanā ca. Atthāvuso, attabhāvapaṭilābho, yasmiṃ attabhāvapaṭilābhe neva attasañcetanā kamati, no parasañcetanā.",
      "english": "\"There are these four ways of answering questions: a question that should be answered directly; a question that should be answered by counter-questioning; a question that should be answered by making a distinction; a question that should be set aside.\n\nThere are these four kinds of deeds: there is, friend, a deed that is dark with dark result; there is, friend, a deed that is bright with bright result; there is, friend, a deed that is dark-and-bright with dark-and-bright result; there is, friend, a deed that is neither-dark-nor-bright with neither-dark-nor-bright result, which conduces to the destruction of deeds.\n\nThere are these four things to be realized: past abodes are to be realized by mindfulness; the passing away and reappearance of beings is to be realized by the eye; the eight liberations are to be realized by the body; the destruction of the taints is to be realized by wisdom.\n\nThere are these four floods: the flood of sensual desire, the flood of becoming, the flood of views, the flood of ignorance.\n\nThere are these four yokes: the yoke of sensual desire, the yoke of becoming, the yoke of views, the yoke of ignorance.\n\nThere are these four unyokings: unyoking from the yoke of sensual desire, unyoking from the yoke of becoming, unyoking from the yoke of views, unyoking from the yoke of ignorance.\n\nThere are these four bonds: covetousness is a body-bond, ill-will is a body-bond, adherence to rules and observances is a body-bond, insistence that this alone is the truth is a body-bond.\n\nThere are these four kinds of clinging: clinging to sensual pleasures, clinging to views, clinging to rules and observances, clinging to a doctrine of self.\n\nThere are these four modes of generation: egg-born, womb-born, moisture-born, spontaneously born.\n\nThere are these four descents into the womb. Here, friend, someone descends into the mother's womb without awareness, remains in the mother's womb without awareness, and emerges from the mother's womb without awareness. This is the first descent into the womb. Furthermore, friend, here someone descends into the mother's womb with awareness, remains in the mother's womb without awareness, and emerges from the mother's womb without awareness. This is the second descent into the womb. Furthermore, friend, here someone descends into the mother's womb with awareness, remains in the mother's womb with awareness, and emerges from the mother's womb without awareness. This is the third descent into the womb. Furthermore, friend, here someone descends into the mother's womb with awareness, remains in the mother's womb with awareness, and emerges from the mother's womb with awareness. This is the fourth descent into the womb.\n\nThere are these four kinds of attainment of individual existence. There is, friend, an attainment of individual existence in which one only functions by one's own perception, not by the perception of another. There is, friend, an attainment of individual existence in which one only functions by the perception of another, not by one's own perception. There is, friend, an attainment of individual existence in which one functions both by one's own perception and by the perception of another. There is, friend, an attainment of individual existence in which one functions neither by one's own perception nor by the perception of another.\"",
      "sinhala": "‘‘ප්‍රශ්න විසඳන ආකාර සතරෙකි. එනම් ඒකාංශිකව විසඳිය යුතු ප්‍රශ්න, ප්‍රතිප්‍රශ්න මගින් විසඳිය යුතු ප්‍රශ්න, විභාග කොට විසඳිය යුතු ප්‍රශ්න, තහනම් කළ යුතු ප්‍රශ්න යන ඒවායි.\n\n‘‘කර්ම සතරෙකි. ඇවැත්නි, කළු කර්ම කළු විපාක ඇත්තේ ය. ඇවැත්නි, සුදු කර්ම සුදු විපාක ඇත්තේ ය. ඇවැත්නි, කළු සුදු කර්ම කළු සුදු විපාක ඇත්තේ ය. ඇවැත්නි, අවර්ණ අසුදු කර්ම අවර්ණ අසුදු විපාක ඇත්තේ ය. එය කර්ම ක්ෂය වීම පිණිස පවතියි.\n\n‘‘සাক্ষාත් කළ යුතු ධර්ම සතරෙකි. පෙර විසූ ආත්මය සිහියෙන් යුතුව සච්චි කරණීය වේ. සත්වයන්ගේ චුතිය හා උත්පත්තිය ඇසින් සච්චි කරණීය වේ. අෂ්ට විමෝක්ෂ කයින් සච්චි කරණීය වේ. ආශ්‍රවයන්ගේ ක්ෂය ප්‍රඥාවෙන් සච්චි කරණීය වේ.\n\n‘‘ඕඝ සතරෙකි. කාමෝඝ, භවෝඝ, දිට්ඨෝඝ, අවිජ්ජෝඝ යන ඒවායි.\n\n‘‘යෝග සතරෙකි. කාම යෝග, භව යෝග, දිට්ඨි යෝග, අවිජ්ජා යෝග යන ඒවායි.\n\n‘‘විසංයෝජන සතරෙකි. කාම යෝග වි සංයෝජන, භව යෝග වි සංයෝජන, දිට්ඨි යෝග වි සංයෝජන, අවිජ්ජා යෝග වි සංයෝජන යන ඒවායි.\n\n‘‘ග්‍රන්ථ සතරෙකි. අභිජ්ඣාව කාය ග්‍රන්ථයකි, ව්‍යාපාදය කාය ග්‍රන්ථයකි, සීලබ්බත පරාමාසය කාය ග්‍රන්ථයකි, ඉදං සච්චාභිනිවේසය කාය ග්‍රන්ථයකි.\n\n‘‘උපාදාන සතරෙකි. කාමූ‍පාදාන, දිට්ඨූ‍පාදාන, සීලබ්බතූ‍පාදාන, අත්තවාදූ‍පාදාන යන ඒවායි.\n\n‘‘යෝනි සතරෙකි. අණ්ඩජ යෝනි, ජලාබුජ යෝනි, සංසේදජ යෝනි, ඕපපාතික යෝනි යන ඒවායි.\n\n‘‘ගර්භාවක්‍රාන්තීන් සතරෙකි. ඇවැත්නි, ඇතැම් පුද්ගලයෙක් නො දැන මවු කුසට බැස ගනියි. නො දැන මවු කුසෙහි සිටියි. නො දැන මවු කුසින් නික්මෙයි. මෙය පළමුවන ගර්භාවක්‍රාන්තියයි. නැවත ද, ඇවැත්නි, ඇතැම් පුද්ගලයෙක් දැන මවු කුසට බැස ගනියි. නො දැන මවු කුසෙහි සිටියි. නො දැන මවු කුසින් නික්මෙයි. මෙය දෙවන ගර්භාවක්‍රාන්තියයි. නැවත ද, ඇවැත්නි, ඇතැම් පුද්ගලයෙක් දැන මවු කුසට බැස ගනියි. දැන මවු කුසෙහි සිටියි. නො දැන මවු කුසින් නික්මෙයි. මෙය තුන්වන ගර්භාවක්‍රාන්තියයි. නැවත ද, ඇවැත්නි, ඇතැම් පුද්ගලයෙක් දැන මවු කුසට බැස ගනියි. දැන මවු කුසෙහි සිටියි. දැන මවු කුසින් නික්මෙයි. මෙය සතරවන ගර්භාවක්‍රාන්තියයි.\n\n‘‘ආත්මභාව ප්‍රතිලාභ සතරෙකි. ඇවැත්නි, යම් ආත්මභාව ප්‍රතිලාභයක් ඇත් ද, එහි තමාගේ හැඟීමක් පමණක් කැමැති වෙයි. අනුන්ගේ හැඟීමක් කැමැති නො වෙයි. ඇවැත්නි, යම් ආත්මභාව ප්‍රතිලාභයක් ඇත් ද, එහි අනුන්ගේ හැඟීමක් පමණක් කැමැති වෙයි. තමාගේ හැඟීමක් කැමැති නො වෙයි. ඇවැත්නි, යම් ආත්මභාව ප්‍රතිලාභයක් ඇත් ද, එහි තමාගේ හැඟීමත් අනුන්ගේ හැඟීමත් යන දෙක ම කැමැති වෙයි. ඇවැත්නි, යම් ආත්මභාව ප්‍රතිලාභයක් ඇත් ද, එහි තමාගේ හැඟීමක් වත් අනුන්ගේ හැඟීමක් වත් කැමැති නො වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 313,
      "pali": "‘‘Catasso dakkhiṇāvisuddhiyo. Atthāvuso, dakkhiṇā dāyakato visujjhati no paṭiggāhakato. Atthāvuso, dakkhiṇā paṭiggāhakato visujjhati no dāyakato. Atthāvuso, dakkhiṇā neva dāyakato visujjhati no paṭiggāhakato. Atthāvuso, dakkhiṇā dāyakato ceva visujjhati paṭiggāhakato ca. ‘‘Cattāri saṅgahavatthūni – dānaṃ, peyyavajjaṃ [piyavajjaṃ (syā. kaṃ. ka.)], atthacariyā, samānattatā. ‘‘Cattāro anariyavohārā – musāvādo, pisuṇāvācā, pharusāvācā, samphappalāpo. ‘‘Cattāro ariyavohārā – musāvādā veramaṇī [veramaṇi (ka.)], pisuṇāya vācāya veramaṇī, pharusāya vācāya veramaṇī, samphappalāpā veramaṇī. ‘‘Aparepi cattāro anariyavohārā – adiṭṭhe diṭṭhavāditā, assute sutavāditā, amute mutavāditā, aviññāte viññātavāditā. ‘‘Aparepi cattāro ariyavohārā – adiṭṭhe adiṭṭhavāditā, assute assutavāditā, amute amutavāditā, aviññāte aviññātavāditā. ‘‘Aparepi cattāro anariyavohārā – diṭṭhe adiṭṭhavāditā, sute assutavāditā, mute amutavāditā, viññāte aviññātavāditā. ‘‘Aparepi cattāro ariyavohārā – diṭṭhe diṭṭhavāditā, sute sutavāditā, mute mutavāditā, viññāte viññātavāditā.",
      "english": "\"There are these four kinds of purity of offerings. In one case, the offering is purified on the part of the giver, but not on the part of the recipient. In one case, the offering is purified on the part of the recipient, but not on the part of the giver. In one case, the offering is purified neither on the part of the giver nor on the part of the recipient. In one case, the offering is purified both on the part of the giver and on the part of the recipient.\n\n\"These are the four bases of sympathy: giving, kind speech, beneficial service, and consistency.\n\n\"These are the four kinds of ignoble speech: lying, divisive speech, harsh speech, and idle chatter.\n\n\"These are the four kinds of noble speech: abstaining from lying, abstaining from divisive speech, abstaining from harsh speech, abstaining from idle chatter.\n\n\"Again, these are four kinds of ignoble speech: claiming to have seen what has not been seen, claiming to have heard what has not been heard, claiming to have sensed what has not been sensed, claiming to have known what has not been known.\n\n\"Again, these are four kinds of noble speech: saying one has not seen what has not been seen, saying one has not heard what has not been heard, saying one has not sensed what has not been sensed, saying one has not known what has not been known.\n\n\"Again, these are four kinds of ignoble speech: claiming not to have seen what has been seen, claiming not to have heard what has been heard, claiming not to have sensed what has been sensed, claiming not to have known what has been known.\n\n\"Again, these are four kinds of noble speech: saying one has seen what has been seen, saying one has heard what has been heard, saying one has sensed what has been sensed, saying one has known what has been known.\"",
      "sinhala": "‘‘දක්ෂිණාවිශුද්ධි සතරකි. ඇවැත්නි, දක්ෂිණාව දායකයා නිසා පිරිසිදු වේ, ප්‍රතිග්‍රාහකයා නිසා නොවේ. ඇවැත්නි, දක්ෂිණාව ප්‍රතිග්‍රාහකයා නිසා පිරිසිදු වේ, දායකයා නිසා නොවේ. ඇවැත්නි, දක්ෂිණාව දායකයා නිසාත් පිරිසිදු නොවේ, ප්‍රතිග්‍රාහකයා නිසාත් නොවේ. ඇවැත්නි, දක්ෂිණාව දායකයා නිසාත් පිරිසිදු වේ, ප්‍රතිග්‍රාහකයා නිසාත් පිරිසිදු වේ. ‘‘සංග්‍රහ වස්තු සතරකි - දානය, ප්‍රිය වචනය, අර්ථචර්යාව, සමානාත්මතාවය. ‘‘අනാര്യ ව්‍යවහාර සතරකි - බොරු කීම, කේලාම් කීම, රළු වචන කීම, හිස් වචන කීම. ‘‘ආර්ය ව්‍යවහාර සතරකි - බොරු කීමෙන් වැළකීම, කේලාම් කීමෙන් වැළකීම, රළු වචන කීමෙන් වැළකීම, හිස් වචන කීමෙන් වැළකීම. ‘‘තවත් අනാര്യ ව්‍යවහාර සතරකි - නොදුටු දෙය දුටු බව කීම, නො ඇසූ දෙය ඇසූ බව කීම, නො විඳි දෙය විඳි බව කීම, නොදත් දෙය දත් බව කීම. ‘‘තවත් ආර්ය ව්‍යවහාර සතරකි - නොදුටු දෙය නොදුටු බව කීම, නො ඇසූ දෙය නො ඇසූ බව කීම, නො විඳි දෙය නො විඳි බව කීම, නොදත් දෙය නොදත් බව කීම. ‘‘තවත් අනാര്യ ව්‍යවහාර සතරකි - දුටු දෙය නොදුටු බව කීම, ඇසූ දෙය නොඇසූ බව කීම, විඳි දෙය නොවිඳි බව කීම, දත් දෙය නොදත් බව කීම. ‘‘තවත් ආර්ය ව්‍යවහාර සතරකි - දුටු දෙය දුටු බව කීම, ඇසූ දෙය ඇසූ බව කීම, විඳි දෙය විඳි බව කීම, දත් දෙය දත් බව කීම.",
      "paliTitle": ""
    },
    {
      "number": 314,
      "pali": "‘‘Cattāro puggalā. Idhāvuso, ekacco puggalo attantapo hoti attaparitāpanānuyogamanuyutto. Idhāvuso, ekacco puggalo parantapo hoti paraparitāpanānuyogamanuyutto. Idhāvuso, ekacco puggalo attantapo ca hoti attaparitāpanānuyogamanuyutto, parantapo ca paraparitāpanānuyogamanuyutto. Idhāvuso, ekacco puggalo neva attantapo hoti na attaparitāpanānuyogamanuyutto na parantapo na paraparitāpanānuyogamanuyutto. So anattantapo aparantapo diṭṭheva dhamme nicchāto nibbuto sītībhūto [sītibhūto (ka.)] sukhappaṭisaṃvedī brahmabhūtena attanā viharati. ‘‘Aparepi cattāro puggalā. Idhāvuso, ekacco puggalo attahitāya paṭipanno hoti no parahitāya. Idhāvuso, ekacco puggalo parahitāya paṭipanno hoti no attahitāya. Idhāvuso, ekacco puggalo neva attahitāya paṭipanno hoti no parahitāya. Idhāvuso, ekacco puggalo attahitāya ceva paṭipanno hoti parahitāya ca. ‘‘Aparepi cattāro puggalā – tamo tamaparāyano, tamo jotiparāyano, joti tamaparāyano, joti jotiparāyano. ‘‘Aparepi cattāro puggalā – samaṇamacalo, samaṇapadumo, samaṇapuṇḍarīko, samaṇesu samaṇasukhumālo. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena cattāro dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Paṭhamabhāṇavāro niṭṭhito. ",
      "english": "\"There are these four types of individuals. Here, a certain individual, having become one who torments himself, is committed to the practice of self-mortification. Here, a certain individual, having become one who torments others, is committed to the practice of mortifying others. Here, a certain individual, having become one who torments himself, is committed to the practice of self-mortification, and having become one who torments others, is committed to the practice of mortifying others. Here, a certain individual is neither one who torments himself, nor committed to the practice of self-mortification, nor one who torments others, nor committed to the practice of mortifying others. Being not a self-tormentor, nor an other-tormentor, he is in this very life without craving, cooled, peaceful, experiencing happiness, abiding with a self that has become Brahman.\n\n\"Again, there are these four types of individuals. Here, a certain individual is committed to his own welfare, but not to the welfare of others. Here, a certain individual is committed to the welfare of others, but not to his own welfare. Here, a certain individual is committed neither to his own welfare nor to the welfare of others. Here, a certain individual is committed both to his own welfare and to the welfare of others.\n\n\"Again, there are these four types of individuals: one who is darkness going to darkness, one who is darkness going to light, one who is light going to darkness, one who is light going to light.\n\n\"Again, there are these four types of individuals: the ascetic who is unmoving, the ascetic who is a lotus, the ascetic who is a white lotus, the ascetic who is the most refined among ascetics.\n\n\"These, friends, are the four qualities well-proclaimed by that Blessed One, who knows, who sees, the Arahant, the Perfectly Enlightened One; and all should recite them in unison… for the benefit, welfare, and happiness of gods and humans.\"\n\nThe first recitation section is finished.",
      "sinhala": "‘‘ආවුසෝ, පුද්ගලයෝ සතර දෙනෙක් වෙති. ආවුසෝ, මෙලොව ඇතැම් පුද්ගලයෙක් තමා තවනසුලු වන්නේ ය. තමා පෙළීමෙහි යෙදුණේ වෙයි. ආවුසෝ, මෙලොව ඇතැම් පුද්ගලයෙක් අනුන් තවනසුලු වන්නේ ය. අනුන් පෙළීමෙහි යෙදුණේ වෙයි. ආවුසෝ, මෙලොව ඇතැම් පුද්ගලයෙක් තමා තවනසුලු ද වන්නේ ය. තමා පෙළීමෙහි යෙදුණේ ද වෙයි. අනුන් තවනසුලු ද වන්නේ ය. අනුන් පෙළීමෙහි යෙදුණේ ද වෙයි. ආවුසෝ, මෙලොව ඇතැම් පුද්ගලයෙක් තමා නොතවනසුලු ද නොවන්නේ ය. තමා පෙළීමෙහි යෙදුණේ ද නොවෙයි. අනුන් නොතවනසුලු ද නොවන්නේ ය. අනුන් පෙළීමෙහි යෙදුණේ ද නොවෙයි. හෙතෙම තමා නොතවනසුලු වූයේ, අනුන් නොතවනසුලු වූයේ, මේ ජීවිතයෙහි ම පිපාසිත බව දුරු කළේ, නිවුණේ, සිහිල් වූයේ, සැප වේදනාවන් විඳිමින්, බ්‍රහ්ම වූ ආත්මභාවයෙන් යුක්ත ව වාසය කරයි. ‘‘තව ද පුද්ගලයෝ සතර දෙනෙක් වෙති. ආවුසෝ, මෙලොව ඇතැම් පුද්ගලයෙක් තමාගේ හිත පිණිස පිළිපන්නේ වෙයි. අනුන්ගේ හිත පිණිස නොවෙයි. ආවුසෝ, මෙලොව ඇතැම් පුද්ගලයෙක් අනුන්ගේ හිත පිණිස පිළිපන්නේ වෙයි. තමාගේ හිත පිණිස නොවෙයි. ආවුසෝ, මෙලොව ඇතැම් පුද්ගලයෙක් තමාගේ හිත පිණිස ද පිළිපන්නේ නොවෙයි. අනුන්ගේ හිත පිණිස ද නොවෙයි. ආවුසෝ, මෙලොව ඇතැම් පුද්ගලයෙක් තමාගේ හිත පිණිසත් පිළිපන්නේ වෙයි. අනුන්ගේ හිත පිණිසත් වෙයි. ‘‘තව ද පුද්ගලයෝ සතර දෙනෙක් වෙති. අඳුරෙන් අඳුර කරා යන පුද්ගලයා ය, අඳුරෙන් එළිය කරා යන පුද්ගලයා ය, එළියෙන් අඳුර කරා යන පුද්ගලයා ය, එළියෙන් එළිය කරා යන පුද්ගලයා ය යනුවෙනි. ‘‘තව ද පුද්ගලයෝ සතර දෙනෙක් වෙති. නොසැලෙන ශ‍්‍රමණයා ය, පියුම් ශ‍්‍රමණයා ය, පුණ්ඩරීක ශ‍්‍රමණයා ය, ශ‍්‍රමණයන් අතර මෘදු වූ ශ‍්‍රමණයා ය යනුවෙනි. ‘‘ආවුසෝ, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අර්හත් වූ, සම්මා සම්බුදු වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මේ ධර්ම සතර මැනවින් දේශනා කරන ලද්දේ ය. එහි සියල්ලෝ ම එක්ව ගායනා කළ යුතු ය… දෙවියන් හා මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස ය. පළමුවන භාණ වාරය නිමියේ ය.",
      "paliTitle": ""
    },
    {
      "number": 315,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena pañca dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Katame pañca? ‘‘Pañcakkhandhā. Rūpakkhandho vedanākkhandho saññākkhandho saṅkhārakkhandho viññāṇakkhandho. ‘‘Pañcupādānakkhandhā. Rūpupādānakkhandho [rūpūpādānakkhandho (sī. syā. kaṃ. pī.) evamitaresupi] vedanupādānakkhandho saññupādānakkhandho saṅkhārupādānakkhandho viññāṇupādānakkhandho. ‘‘Pañca kāmaguṇā. Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasañhitā rajanīyā, sotaviññeyyā saddā… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasañhitā rajanīyā. ‘‘Pañca gatiyo – nirayo, tiracchānayoni, pettivisayo, manussā, devā. ‘‘Pañca macchariyāni – āvāsamacchariyaṃ, kulamacchariyaṃ, lābhamacchariyaṃ, vaṇṇamacchariyaṃ, dhammamacchariyaṃ. ‘‘Pañca nīvaraṇāni – kāmacchandanīvaraṇaṃ, byāpādanīvaraṇaṃ, thinamiddhanīvaraṇaṃ, uddhaccakukkuccanīvaraṇaṃ, vicikicchānīvaraṇaṃ. ‘‘Pañca orambhāgiyāni saññojanāni – sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso, kāmacchando, byāpādo. ‘‘Pañca uddhambhāgiyāni saññojanāni – rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā. ‘‘Pañca sikkhāpadāni – pāṇātipātā veramaṇī, adinnādānā veramaṇī, kāmesumicchācārā veramaṇī, musāvādā veramaṇī, surāmerayamajjappamādaṭṭhānā veramaṇī.",
      "english": "\"Friend, there are these five things well-proclaimed by that Blessed One, the Knower, the Seer, the Worthy One, the Fully Enlightened One. All should chant them together…for the benefit, welfare, and happiness of gods and humans. What five? The five aggregates: the aggregate of form, the aggregate of feeling, the aggregate of perception, the aggregate of mental formations, the aggregate of consciousness. The five aggregates of clinging: the aggregate of clinging to form, the aggregate of clinging to feeling, the aggregate of clinging to perception, the aggregate of clinging to mental formations, the aggregate of clinging to consciousness. The five sense pleasures: forms cognizable by the eye that are desirable, lovely, agreeable, pleasing, connected with desire, and arousing passion; sounds cognizable by the ear…; odors cognizable by the nose…; flavors cognizable by the tongue…; tactile objects cognizable by the body that are desirable, lovely, agreeable, pleasing, connected with desire, and arousing passion. The five destinations: hell, the animal realm, the realm of ghosts, humans, gods. The five kinds of miserliness: miserliness about dwellings, miserliness about families, miserliness about gains, miserliness about praise, miserliness about the Dhamma. The five hindrances: the hindrance of sensual desire, the hindrance of ill-will, the hindrance of sloth and torpor, the hindrance of restlessness and remorse, the hindrance of doubt. The five lower fetters: personality belief, doubt, clinging to rites and rituals, sensual desire, ill-will. The five higher fetters: craving for form, craving for formlessness, conceit, restlessness, ignorance. The five training precepts: abstaining from taking life, abstaining from taking what is not given, abstaining from misconduct in sexual pleasures, abstaining from false speech, abstaining from intoxicants causing heedlessness.\"",
      "sinhala": "‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ ද, දක්නා වූ ද, අරහත් වූ ද, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් පඤ්ච ධර්මයන් මැනවින් දේශනා කරන ලදී. එහි සියල්ලන් විසින් ම එක්ව ගායනා කළ යුතුයි... දෙව් මිනිසුන්ට වැඩ පිණිස, හිත පිණිස, සැප පිණිස. කවර පසක් ද? ‘‘පඤ්චස්කන්ධයෝ ය. රූපස්කන්ධය, වේදනාස්කන්ධය, සඤ්ඤාස්කන්ධය, සංඛාරස්කන්ධය, විඤ්ඤාණස්කන්ධය යි. ‘‘පඤ්ච උපාදානස්කන්ධයෝ ය. රූප උපාදානස්කන්ධය, වේදනා උපාදානස්කන්ධය, සඤ්ඤා උපාදානස්කන්ධය, සංඛාර උපාදානස්කන්ධය, විඤ්ඤාණ උපාදානස්කන්ධය යි. ‘‘පඤ්ච කාම ගුණයෝ ය. ඇසින් දැනගත යුතු වූ, ඉෂ්ට වූ, ප්‍රිය වූ, මනාප වූ, ප්‍රිය ස්වරූප ඇති, කාමය උපදවන, ඇලෙන සුළු රූපයෝ ය, කනින් දැනගත යුතු වූ ශබ්දයෝ... නාසයෙන් දැනගත යුතු වූ ගන්ධයෝ... දිවෙන් දැනගත යුතු වූ රසයෝ... කයින් දැනගත යුතු වූ, ඉෂ්ට වූ, ප්‍රිය වූ, මනාප වූ, ප්‍රිය ස්වරූප ඇති, කාමය උපදවන, ඇලෙන සුළු ස්පර්ශයෝ ය. ‘‘පඤ්ච ගතියෝ - නිරය, තිරිසන් යෝනි, ප්‍රේත විෂය, මනුෂ්‍යයෝ, දෙවියෝ ය. ‘‘පඤ්ච මච්ඡරියයෝ - ආවාස මසුරුකම, කුල මසුරුකම, ලාභ මසුරුකම, වර්ණ මසුරුකම, ධර්ම මසුරුකම යි. ‘‘පඤ්ච නීවරණයෝ - කාමච්ඡන්ද නීවරණය, ව්‍යාපාද නීවරණය, ථීනමිද්ධ නීවරණය, උද්ධච්ච කුක්කුච්ච නීවරණය, විචිකිච්ඡා නීවරණය යි. ‘‘පඤ්ච ඕරම්භාගිය සංයෝජනයෝ - සක්කාය දිට්ඨිය, විචිකිච්ඡාව, සීලබ්බත පරාමාසය, කාමච්ඡන්දය, ව්‍යාපාදය යි. ‘‘පඤ්ච උද්ධම්භාගිය සංයෝජනයෝ - රූප රාගය, අරූප රාගය, මානය, උද්ධච්චය, අවිද්‍යාව යි. ‘‘පඤ්ච සික්ඛාපදයෝ - ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාම මිථ්‍යාචාරයෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, සුරාමේරය මජ්ජපමාදට්ඨානයෙන් වැළකීම යි.",
      "paliTitle": "Pañcakaṃ",
      "englishTitle": "The Fives",
      "sinhalaTitle": "පඤ්චකය"
    },
    {
      "number": 316,
      "pali": "‘‘Pañca abhabbaṭṭhānāni. Abhabbo, āvuso, khīṇāsavo bhikkhu sañcicca pāṇaṃ jīvitā voropetuṃ. Abhabbo khīṇāsavo bhikkhu adinnaṃ theyyasaṅkhātaṃ ādiyituṃ [ādātuṃ (syā. kaṃ. pī.)]. Abhabbo khīṇāsavo bhikkhu methunaṃ dhammaṃ paṭisevituṃ. Abhabbo khīṇāsavo bhikkhu sampajānamusā bhāsituṃ. Abhabbo khīṇāsavo bhikkhu sannidhikārakaṃ kāme paribhuñjituṃ, seyyathāpi pubbe āgārikabhūto. ‘‘Pañca byasanāni – ñātibyasanaṃ, bhogabyasanaṃ, rogabyasanaṃ, sīlabyasanaṃ, diṭṭhibyasanaṃ. Nāvuso, sattā ñātibyasanahetu vā bhogabyasanahetu vā rogabyasanahetu vā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Sīlabyasanahetu vā, āvuso, sattā diṭṭhibyasanahetu vā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. ‘‘Pañca sampadā – ñātisampadā, bhogasampadā, ārogyasampadā, sīlasampadā, diṭṭhisampadā. Nāvuso, sattā ñātisampadāhetu vā bhogasampadāhetu vā ārogyasampadāhetu vā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Sīlasampadāhetu vā, āvuso, sattā diṭṭhisampadāhetu vā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. ‘‘Pañca ādīnavā dussīlassa sīlavipattiyā. Idhāvuso, dussīlo sīlavipanno pamādādhikaraṇaṃ mahatiṃ bhogajāniṃ nigacchati, ayaṃ paṭhamo ādīnavo dussīlassa sīlavipattiyā. Puna caparaṃ, āvuso, dussīlassa sīlavipannassa pāpako kittisaddo abbhuggacchati, ayaṃ dutiyo ādīnavo dussīlassa sīlavipattiyā. Puna caparaṃ, āvuso, dussīlo sīlavipanno yaññadeva parisaṃ upasaṅkamati yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ, avisārado upasaṅkamati maṅkubhūto, ayaṃ tatiyo ādīnavo dussīlassa sīlavipattiyā. Puna caparaṃ, āvuso, dussīlo sīlavipanno sammūḷho kālaṃ karoti, ayaṃ catuttho ādīnavo dussīlassa sīlavipattiyā. Puna caparaṃ, āvuso, dussīlo sīlavipanno kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati, ayaṃ pañcamo ādīnavo dussīlassa sīlavipattiyā. ‘‘Pañca ānisaṃsā sīlavato sīlasampadāya. Idhāvuso, sīlavā sīlasampanno appamādādhikaraṇaṃ mahantaṃ bhogakkhandhaṃ adhigacchati, ayaṃ paṭhamo ānisaṃso sīlavato sīlasampadāya. Puna caparaṃ, āvuso, sīlavato sīlasampannassa kalyāṇo kittisaddo abbhuggacchati, ayaṃ dutiyo ānisaṃso sīlavato sīlasampadāya. Puna caparaṃ, āvuso, sīlavā sīlasampanno yaññadeva parisaṃ upasaṅkamati yadi khattiyaparisaṃ yadi brāhmaṇaparisaṃ yadi gahapatiparisaṃ yadi samaṇaparisaṃ, visārado upasaṅkamati amaṅkubhūto, ayaṃ tatiyo ānisaṃso sīlavato sīlasampadāya. Puna caparaṃ, āvuso, sīlavā sīlasampanno asammūḷho kālaṃ karoti, ayaṃ catuttho ānisaṃso sīlavato sīlasampadāya. Puna caparaṃ, āvuso, sīlavā sīlasampanno kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati, ayaṃ pañcamo ānisaṃso sīlavato sīlasampadāya. ‘‘Codakena, āvuso, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ upaṭṭhapetvā paro codetabbo. Kālena vakkhāmi no akālena, bhūtena vakkhāmi no abhūtena, saṇhena vakkhāmi no pharusena, atthasaṃhitena vakkhāmi no anatthasaṃhitena, mettacittena [mettācittena (katthaci)] vakkhāmi no dosantarenāti. Codakena, āvuso, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ upaṭṭhapetvā paro codetabbo.",
      "english": "\"There are these five instances of being incapable. A bhikkhu who is a perfected one, whose defilements are destroyed, is incapable, reverend, of intentionally taking the life of a living being. A bhikkhu who is a perfected one, whose defilements are destroyed, is incapable of taking what is not given, which is reckoned as theft. A bhikkhu who is a perfected one, whose defilements are destroyed, is incapable of engaging in sexual intercourse. A bhikkhu who is a perfected one, whose defilements are destroyed, is incapable of speaking a deliberate lie. A bhikkhu who is a perfected one, whose defilements are destroyed, is incapable of enjoying pleasures by accumulating provisions, as he did formerly when he was a householder.\n\n\"There are these five calamities: calamity of relatives, calamity of wealth, calamity of disease, calamity of virtue, and calamity of views. It is not because of the calamity of relatives, the calamity of wealth, or the calamity of disease, reverend, that beings, on the dissolution of the body, after death, are reborn in the plane of misery, in a bad destination, in the lower realms, in hell. But it is because of the calamity of virtue or the calamity of views, reverend, that beings, on the dissolution of the body, after death, are reborn in the plane of misery, in a bad destination, in the lower realms, in hell.\n\n\"There are these five kinds of success: success in relatives, success in wealth, success in health, success in virtue, and success in views. It is not because of success in relatives, success in wealth, or success in health, reverend, that beings, on the dissolution of the body, after death, are reborn in a good destination, in a heavenly world. But it is because of success in virtue or success in views, reverend, that beings, on the dissolution of the body, after death, are reborn in a good destination, in a heavenly world.\n\n\"There are these five drawbacks for one who is immoral, through the failure of virtue. Here, reverend, one who is immoral, failing in virtue, through negligence incurs great loss of wealth; this is the first drawback for one who is immoral, through the failure of virtue. Furthermore, reverend, an evil report spreads about one who is immoral, failing in virtue; this is the second drawback for one who is immoral, through the failure of virtue. Furthermore, reverend, one who is immoral, failing in virtue, approaches any assembly whatsoever—whether an assembly of nobles, an assembly of brahmins, an assembly of householders, or an assembly of ascetics—he approaches it hesitant and intimidated; this is the third drawback for one who is immoral, through the failure of virtue. Furthermore, reverend, one who is immoral, failing in virtue, dies confused; this is the fourth drawback for one who is immoral, through the failure of virtue. Furthermore, reverend, one who is immoral, failing in virtue, on the dissolution of the body, after death, is reborn in the plane of misery, in a bad destination, in the lower realms, in hell; this is the fifth drawback for one who is immoral, through the failure of virtue.\n\n\"There are these five benefits for one who is virtuous, through the success of virtue. Here, reverend, one who is virtuous, succeeding in virtue, through diligence attains a great mass of wealth; this is the first benefit for one who is virtuous, through the success of virtue. Furthermore, reverend, a good report spreads about one who is virtuous, succeeding in virtue; this is the second benefit for one who is virtuous, through the success of virtue. Furthermore, reverend, one who is virtuous, succeeding in virtue, approaches any assembly whatsoever—whether an assembly of nobles, an assembly of brahmins, an assembly of householders, or an assembly of ascetics—he approaches it confidently and un-intimidated; this is the third benefit for one who is virtuous, through the success of virtue. Furthermore, reverend, one who is virtuous, succeeding in virtue, dies unconfused; this is the fourth benefit for one who is virtuous, through the success of virtue. Furthermore, reverend, one who is virtuous, succeeding in virtue, on the dissolution of the body, after death, is reborn in a good destination, in a heavenly world; this is the fifth benefit for one who is virtuous, through the success of virtue.\n\n\"A bhikkhu who rebukes another, reverend, intending to rebuke another, should establish these five qualities internally and then rebuke another: 'I will speak at the right time, not at the wrong time; I will speak truthfully, not falsely; I will speak gently, not harshly; I will speak connected with benefit, not unconnected with benefit; I will speak with a mind of loving-kindness, not with inner hate.' A bhikkhu who rebukes another, reverend, intending to rebuke another, should establish these five qualities internally and then rebuke another.\"",
      "sinhala": "‘‘ආවුසෝ, අභබ්බස්ථාන පහකි. ක්ෂීණාශ්‍රව භික්ෂුවක් සිතා මතා සත්වයෙකුගේ ප්‍රාණය නසාලීමට අභබ්බ වේ. ක්ෂීණාශ්‍රව භික්ෂුවක් අනුන් සතු දෙයක් සොර සිතින් ගැනීමට අභබ්බ වේ. ක්ෂීණාශ්‍රව භික්ෂුවක් මෛථුනයෙහි හැසිරීමට අභබ්බ වේ. ක්ෂීණාශ්‍රව භික්ෂුවක් දැන දැන බොරු කීමට අභබ්බ වේ. ක්ෂීණාශ්‍රව භික්ෂුවක් පළමුව ගිහි ජීවිතයේදී මෙන් සංනිධි කාරක කාමයන් පරිභෝජනය කිරීමට අභබ්බ වේ.\n\n‘‘ඥාති ව්‍යසනය, භෝග ව්‍යසනය, රෝග ව්‍යසනය, සීල ව්‍යසනය, දිට්ඨි ව්‍යසනය යනුවෙන් ව්‍යසන පහකි. ආවුසෝ, සත්වයෝ ඥාති ව්‍යසනය හේතුවෙන් හෝ භෝග ව්‍යසනය හේතුවෙන් හෝ රෝග ව්‍යසනය හේතුවෙන් හෝ කය බිඳී මරණින් මතු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට නොපත්වෙති. ආවුසෝ, සත්වයෝ සීල ව්‍යසනය හේතුවෙන් හෝ දිට්ඨි ව්‍යසනය හේතුවෙන් හෝ කය බිඳී මරණින් මතු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට පැමිණෙති.\n\n‘‘ඥාති සම්පදාව, භෝග සම්පදාව, ආරෝග්‍ය සම්පදාව, සීල සම්පදාව, දිට්ඨි සම්පදාව යනුවෙන් සම්පත් පහකි. ආවුසෝ, සත්වයෝ ඥාති සම්පදාව හේතුවෙන් හෝ භෝග සම්පදාව හේතුවෙන් හෝ ආරෝග්‍ය සම්පදාව හේතුවෙන් හෝ කය බිඳී මරණින් මතු සුගතියට, ස්වර්ගයට, ලෝකයට නොපැමිණෙති. ආවුසෝ, සත්වයෝ සීල සම්පදාව හේතුවෙන් හෝ දිට්ඨි සම්පදාව හේතුවෙන් හෝ කය බිඳී මරණින් මතු සුගතියට, ස්වර්ගයට, ලෝකයට පැමිණෙති.\n\n‘‘දුශ්ශීලයාගේ, සීල විපත්තියේ ආදීනව පහකි. ආවුසෝ, මෙහි දුශ්ශීලයා සීලයෙන් පිරිහුණු බැවින් පමාවට කරුණු කොට ගෙන මහත් භෝග හානියකට පැමිණෙයි, මෙය දුශ්ශීලයාගේ සීල විපත්තියේ පළමු ආදීනවයයි. තවද, ආවුසෝ, දුශ්ශීලයාගේ, සීලයෙන් පිරිහුණාහුගේ නරක කීර්ති ශබ්දයක් පැතිරෙයි, මෙය දුශ්ශීලයාගේ සීල විපත්තියේ දෙවන ආදීනවයයි. තවද, ආවුසෝ, දුශ්ශීලයා සීලයෙන් පිරිහුණු යම් පරිසයකට එළඹෙයි නම්, එනම් ක්ෂත්‍රිය පරිසයකට හෝ බ්‍රාහ්මණ පරිසයකට හෝ ගෘහපති පරිසයකට හෝ ශ්‍රමණයන්ගේ පරිසයකට හෝ වේවා, එහි අවිශාරදව, ලජ්ජා සහගතව එළඹෙයි, මෙය දුශ්ශීලයාගේ සීල විපත්තියේ තෙවන ආදීනවයයි. තවද, ආවුසෝ, දුශ්ශීලයා සීලයෙන් පිරිහුණු මුලා වූයේ මරණයට පත්වෙයි, මෙය දුශ්ශීලයාගේ සීල විපත්තියේ සිව්වන ආදීනවයයි. තවද, ආවුසෝ, දුශ්ශීලයා සීලයෙන් පිරිහුණු කය බිඳී මරණින් මතු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට පැමිණෙයි, මෙය දුශ්ශීලයාගේ සීල විපත්තියේ පස්වන ආදීනවයයි.\n\n‘‘සිල්වතාගේ, සීල සම්පදාවේ ආනිසංස පහකි. ආවුසෝ, මෙහි සිල්වතා සීලයෙන් සම්පන්න වූයේ අප්‍රමාදයට කරුණු කොට ගෙන මහත් භෝග සමූහයක් ලබයි, මෙය සිල්වතාගේ සීල සම්පදාවේ පළමු ආනිසංසයයි. තවද, ආවුසෝ, සිල්වතාගේ, සීලයෙන් සම්පන්න වූවාහුගේ යහපත් කීර්ති ශබ්දයක් පැතිරෙයි, මෙය සිල්වතාගේ සීල සම්පදාවේ දෙවන ආනිසංසයයි. තවද, ආවුසෝ, සිල්වතා සීලයෙන් සම්පන්න වූ යම් පරිසයකට එළඹෙයි නම්, එනම් ක්ෂත්‍රිය පරිසයකට හෝ බ්‍රාහ්මණ පරිසයකට හෝ ගෘහපති පරිසයකට හෝ ශ්‍රමණයන්ගේ පරිසයකට හෝ වේවා, එහි විශාරදව, ලජ්ජා රහිතව එළඹෙයි, මෙය සිල්වතාගේ සීල සම්පදාවේ තෙවන ආනිසංසයයි. තවද, ආවුසෝ, සිල්වතා සීලයෙන් සම්පන්න වූයේ මුලා නොවී මරණයට පත්වෙයි, මෙය සිල්වතාගේ සීල සම්පදාවේ සිව්වන ආනිසංසයයි. තවද, ආවුසෝ, සිල්වතා සීලයෙන් සම්පන්න වූ කය බිඳී මරණින් මතු සුගතියට, ස්වර්ගයට, ලෝකයට පැමිණෙයි, මෙය සිල්වතාගේ සීල සම්පදාවේ පස්වන ආනිසංසයයි.\n\n‘‘ආවුසෝ, අනුන් අවවාද කිරීමට කැමති භික්ෂුවක් විසින් කරුණු පහක් තමා තුළ පිහිටුවා ගෙන අනුන්ට අවවාද කළ යුතුය. එනම්, සුදුසු කාලයේදී කථා කරමි, නුසුදුසු කාලයේදී කථා නොකරමි, සත්‍යයෙන් කථා කරමි, අසත්‍යයෙන් කථා නොකරමි, මෘදු වචනයෙන් කථා කරමි, රළු වචනයෙන් කථා නොකරමි, අර්ථ සහිතව කථා කරමි, අනර්ථ සහිතව කථා නොකරමි, මෛත්‍රී සහගත සිතින් කථා කරමි, ද්වේෂ සහගත සිතින් කථා නොකරමියි යන කරුණුයි. ආවුසෝ, අනුන් අවවාද කිරීමට කැමති භික්ෂුවක් විසින් මේ කරුණු පහ තමා තුළ පිහිටුවා ගෙන අනුන්ට අවවාද කළ යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 317,
      "pali": "‘‘Pañca padhāniyaṅgāni. Idhāvuso, bhikkhu saddho hoti, saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato, lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Appābādho hoti appātaṅko, samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya. Asaṭho hoti amāyāvī, yathābhūtaṃ attānaṃ āvikattā satthari vā viññūsu vā sabrahmacārīsu. Āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammādukkhakkhayagāminiyā.",
      "english": "\"There are five striving factors. Here, a bhikkhu has faith; he places faith in the Tathāgata’s enlightenment, thinking: ‘Indeed, the Blessed One is an arahant, a fully enlightened one, accomplished in knowledge and conduct, a fortunate one, a knower of the world, unsurpassed trainer of those who can be trained, teacher of gods and humans, enlightened, blessed.’ He is one of few illnesses, of little sickness, possessing good digestion, not too cold, not too hot, of moderate constitution, fit for striving. He is without deceit or trickery; he reveals himself as he actually is to the Teacher or to wise fellow ব্রহ্মচারীs. He dwells having aroused energy for the abandoning of unskillful qualities and for the acquisition of skillful qualities; he is firm, of steadfast exertion, not shirking his duties in regard to skillful qualities. He is wise, endowed with wisdom that leads to rise and fall, the noble wisdom that leads to the complete destruction of suffering.\"",
      "sinhala": "‘‘පධානියංග ධර්මතා පසෙකි. ආයුෂ්මතුන් වහන්ස, මෙහි භික්ෂුව ශ්‍රද්ධාවන්ත වෙයි. තථාගතයන් වහන්සේගේ බෝධිය කෙරෙහි ශ්‍රද්ධාව ඇතිව සිටියි. ‘ඒ භාග්‍යවතුන් වහන්සේ අර්හත් වන සේක. සම්මා සම්බුද්ධ වන සේක. විද්‍යාචරණ සම්පන්න වන සේක. සුගත වන සේක. ලෝකවිදූ වන සේක. අනුත්තර පුරිසදම්ම සාරථී වන සේක. දෙවි මිනිසුන්ගේ ශාස්තෘ වන සේක. බුද්ධ වන සේක. භාග්‍යවත් වන සේක’ යනුවෙනි. රෝග අඩු බව ඇත්තේ, ශරීර පීඩා අඩු බව ඇත්තේ, මධ්‍යම ප්‍රමාණයෙන් යුක්ත ආහාර දිරවීමේ හැකියාවෙන් යුක්ත වූ, අධික ලෙස ශීතල නොවූ, අධික ලෙස උණුසුම් නොවූ, මධ්‍යම වූ ප්‍රධාන වීර්යයට සුදුසු වූ ශරීරයක් ඇත්තේ වෙයි. කපටි නොවූයේ, මායාකාරී නොවූයේ, තමාගේ සත්‍ය ස්වභාවය ශාස්තෘන් වහන්සේට හෝ නුවණැති සහෝදර බඹසර වසන්නන්ට හෝ හෙළි කරන්නෙක් වෙයි. අකුසල ධර්මයන් දුරු කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත් වීර්යය ආරම්භ කළ තැනැත්තේ, ශක්තිමත් වූයේ, දැඩි උත්සාහය ඇත්තේ, කුසල ධර්මයන්හිලා අත් නොහරින ලද වෑයම් ඇත්තේ වෙයි. නැසෙන නැතිවෙන ස්වභාවය දක්නා නුවණින් යුක්ත වූයේ, ආර්ය වූ, කෙලෙස් සිඳින නුවණින් යුක්ත වූයේ, මනා ලෙස දුක් කෙළවර කරන නුවණින් යුක්ත වූයේ වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 318,
      "pali": "‘‘Pañca suddhāvāsā – avihā, atappā, sudassā, sudassī, akaniṭṭhā. ‘‘Pañca anāgāmino – antarāparinibbāyī, upahaccaparinibbāyī, asaṅkhāraparinibbāyī, sasaṅkhāraparinibbāyī, uddhaṃsotoakaniṭṭhagāmī.",
      "english": "The five Pure Abodes are Aviha, Atappa, Sudassa, Sudassi, and Akaniṭṭha. The five who will not return are one who attains final Nibbana between (birth and death), one who attains final Nibbana upon exertion, one who attains final Nibbana without exertion, one who attains final Nibbana with exertion, and one who goes upstream to Akaniṭṭha.",
      "sinhala": "‘‘පඤ්ච සුද්ධාවාස නම් අවිහ, අතප්ප, සුදස්ස, සුදස්සී, අකනිට්ඨ යන ඒවායි. ‘‘පඤ්ච අනාගාමීහු නම් අන්තරාපරිනිබ්බායී, උපහච්චපරිනිබ්බායී, අසඞ්ඛාරපරිනිබ්බායී, සසඞ්ඛාරපරිනිබ්බායී, උද්ධංසෝතෝඅකනිට්ඨගාමී යන මොහුයි.",
      "paliTitle": ""
    },
    {
      "number": 319,
      "pali": "‘‘Pañca cetokhilā. Idhāvuso, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati. Yo so, āvuso, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ paṭhamo cetokhilo. Puna caparaṃ, āvuso, bhikkhu dhamme kaṅkhati vicikicchati…pe… saṅghe kaṅkhati vicikicchati… sikkhāya kaṅkhati vicikicchati… sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto. Yo so, āvuso, bhikkhu sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, ayaṃ pañcamo cetokhilo.",
      "english": "\"There are these five mental fetters. Here, friend, a bhikkhu is doubtful about the Teacher, is uncertain, does not become confident, does not become serene. That bhikkhu, friend, who is doubtful about the Teacher, is uncertain, does not become confident, does not become serene, his mind does not incline to zeal, to devotion, to continuous effort, to exertion. Whose mind does not incline to zeal, to devotion, to continuous effort, to exertion, this is the first mental fetter. Furthermore, friend, a bhikkhu is doubtful about the Dhamma, is uncertain...about the Saṅgha, he is doubtful, is uncertain...about the training, he is doubtful, is uncertain... he is angry with his spiritual companions, displeased, with injured mind, resentful. That bhikkhu, friend, who is angry with his spiritual companions, displeased, with injured mind, resentful, his mind does not incline to zeal, to devotion, to continuous effort, to exertion. Whose mind does not incline to zeal, to devotion, to continuous effort, to exertion, this is the fifth mental fetter.\"",
      "sinhala": "‘‘පඤ්ච චේතොඛිලා. ඇවැත්නි, මෙහි භික්‍ෂුව ශාස්තෘන් කෙරෙහි සැක කරයි, විචිකිච්ඡා කරයි, අධිමොක්‍ෂණය නොකරයි, සම්ප්‍රසාදයට නොපැමිණෙයි. ඇවැත්නි, යම් භික්‍ෂුවක් ශාස්තෘන් කෙරෙහි සැක කරයි ද, විචිකිච්ඡා කරයි ද, අධිමොක්‍ෂණය නොකරයි ද, සම්ප්‍රසාදයට නොපැමිණෙයි ද, ඔහුගේ සිත වීර්‍ය්‍යය පිණිස, අනුයෝගය පිණිස, නොකඩවා උත්සාහය පිණිස, වීර්‍ය්‍ය කිරීම පිණිස නැමෙන්නේ නැත. යමෙකුගේ සිත වීර්‍ය්‍යය පිණිස, අනුයෝගය පිණිස, නොකඩවා උත්සාහය පිණිස, වීර්‍ය්‍ය කිරීම පිණිස නැමෙන්නේ නැත්නම්, මෙය පළමුවන චිත්තඛීලය වේ.\n\nතවද ඇවැත්නි, භික්‍ෂුව ධර්‍මය කෙරෙහි සැක කරයි, විචිකිච්ඡා කරයි…පෙ… සංඝයා කෙරෙහි සැක කරයි, විචිකිච්ඡා කරයි… ශික්‍ෂාව කෙරෙහි සැක කරයි, විචිකිච්ඡා කරයි… සබ්‍රහ්මචාරීන් කෙරෙහි කිපුණු සිත් ඇතිව, අතෘප්ත සිත් ඇතිව, පහර ලද්දාක් වැනි සිත් ඇතිව, ඛීලයක් වූයේ වෙයි. ඇවැත්නි, යම් භික්‍ෂුවක් සබ්‍රහ්මචාරීන් කෙරෙහි කිපුණු සිත් ඇතිව, අතෘප්ත සිත් ඇතිව, පහර ලද්දාක් වැනි සිත් ඇතිව, ඛීලයක් වූයේ වෙයි ද, ඔහුගේ සිත වීර්‍ය්‍යය පිණිස, අනුයෝගය පිණිස, නොකඩවා උත්සාහය පිණිස, වීර්‍ය්‍ය කිරීම පිණිස නැමෙන්නේ නැත. යමෙකුගේ සිත වීර්‍ය්‍යය පිණිස, අනුයෝගය පිණිස, නොකඩවා උත්සාහය පිණිස, වීර්‍ය්‍ය කිරීම පිණිස නැමෙන්නේ නැත්නම්, මෙය පස්වන චිත්තඛීලය වේ.",
      "paliTitle": ""
    },
    {
      "number": 320,
      "pali": "‘‘Pañca cetasovinibandhā. Idhāvuso, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Yo so, āvuso, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Ayaṃ paṭhamo cetaso vinibandho. Puna caparaṃ, āvuso, bhikkhu kāye avītarāgo hoti… pe… rūpe avītarāgo hoti…pe… puna caparaṃ, āvuso, bhikkhu yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati…pe… puna caparaṃ, āvuso, bhikkhu aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, āvuso, bhikkhu aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Ayaṃ pañcamo cetaso vinibandho. ‘‘Pañcindriyāni – cakkhundriyaṃ, sotindriyaṃ, ghānindriyaṃ, jivhindriyaṃ, kāyindriyaṃ. ‘‘Aparānipi pañcindriyāni – sukhindriyaṃ, dukkhindriyaṃ, somanassindriyaṃ, domanassindriyaṃ, upekkhindriyaṃ. ‘‘Aparānipi pañcindriyāni – saddhindriyaṃ, vīriyindriyaṃ, satindriyaṃ, samādhindriyaṃ, paññindriyaṃ.",
      "english": "\"There are five mental fetters. Here, a bhikkhu, friend, has not overcome craving for sensual pleasures, has not overcome desire, has not overcome affection, has not overcome thirst, has not overcome burning, has not overcome longing. Because that bhikkhu, friend, has not overcome craving for sensual pleasures, has not overcome desire, has not overcome affection, has not overcome thirst, has not overcome burning, has not overcome longing, his mind does not incline towards ardour, towards devotion, towards constancy, towards exertion. Because his mind does not incline towards ardour, towards devotion, towards constancy, towards exertion, this is the first mental fetter. Again, friend, a bhikkhu has not overcome craving for the body… Again, friend, a bhikkhu has not overcome craving for form… Again, friend, a bhikkhu, having eaten until his belly is full, indulges in the pleasure of lying down, the pleasure of reclining, the pleasure of sloth… Again, friend, a bhikkhu undertakes the spiritual life aspiring to some particular group of deities, thinking, ‘By this virtue or observance or austerity or spiritual life, I shall become a god or one of the gods.’ Because that bhikkhu, friend, undertakes the spiritual life aspiring to some particular group of deities, thinking, ‘By this virtue or observance or austerity or spiritual life, I shall become a god or one of the gods,’ his mind does not incline towards ardour, towards devotion, towards constancy, towards exertion. Because his mind does not incline towards ardour, towards devotion, towards constancy, towards exertion, this is the fifth mental fetter. There are five faculties: the eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty. Again, there are five faculties: the pleasure faculty, the pain faculty, the happiness faculty, the sadness faculty, the equanimity faculty. Again, there are five faculties: the faith faculty, the energy faculty, the mindfulness faculty, the concentration faculty, the wisdom faculty.\"",
      "sinhala": "‘‘ආවුසෝ, සිත බැඳ තබන බන්ධන පහකි. ආවුසෝ, මෙහි භික්ෂුව කාමයන් කෙරෙහි නොඉක්මවූ ඇල්ම ඇත්තේ වෙයි; පහ නොවූ කැමැත්ත ඇත්තේ වෙයි; පහ නොවූ ප්‍රේමය ඇත්තේ වෙයි; පහ නොවූ පිපාසය ඇත්තේ වෙයි; පහ නොවූ දැවිල්ල ඇත්තේ වෙයි; පහ නොවූ තෘෂ්ණාව ඇත්තේ වෙයි. ආවුසෝ, යම් භික්ෂුවක් කාමයන් කෙරෙහි නොඉක්මවූ ඇල්ම ඇත්තේ වෙයි ද, පහ නොවූ කැමැත්ත ඇත්තේ වෙයි ද, පහ නොවූ ප්‍රේමය ඇත්තේ වෙයි ද, පහ නොවූ පිපාසය ඇත්තේ වෙයි ද, පහ නොවූ දැවිල්ල ඇත්තේ වෙයි ද, පහ නොවූ තෘෂ්ණාව ඇත්තේ වෙයි ද, ඔහුගේ සිත උත්සාහයට, යෝග්‍යතාවයට, නොකඩවා කිරීමට, වීර්යයට නැමෙන්නේ නැත. යමෙකුගේ සිත උත්සාහයට, යෝග්‍යතාවයට, නොකඩවා කිරීමට, වීර්යයට නැමෙන්නේ නැද්ද, මෙය පළමු සිත බැඳ තබන බන්ධනයයි.\n\nතවද ආවුසෝ, භික්ෂුව කය කෙරෙහි නොඉක්මවූ ඇල්ම ඇත්තේ වෙයි…පෙ…. රූපය කෙරෙහි නොඉක්මවූ ඇල්ම ඇත්තේ වෙයි…පෙ…. තවද ආවුසෝ, භික්ෂුව බඩ පිරෙන පමණට ආහාර වැළඳ සයනයේ සැපය, ඇලී ගැලී වාසය කරයි…පෙ…. තවද ආවුසෝ, භික්ෂුව අනෙක් දෙව් නිකායක් පතා බඹසර හැසිරෙයි. ‘මම මේ සීලයෙන් හෝ ව්‍රතයෙන් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ දෙවෙක් වන්නෙමි, නැතහොත් වෙනත් දෙවියෙක් වන්නෙමි’ කියායි. ආවුසෝ, යම් භික්ෂුවක් අනෙක් දෙව් නිකායක් පතා බඹසර හැසිරෙයි ද, ‘මම මේ සීලයෙන් හෝ ව්‍රතයෙන් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ දෙවෙක් වන්නෙමි, නැතහොත් වෙනත් දෙවියෙක් වන්නෙමි’ කියාද, ඔහුගේ සිත උත්සාහයට, යෝග්‍යතාවයට, නොකඩවා කිරීමට, වීර්යයට නැමෙන්නේ නැත. යමෙකුගේ සිත උත්සාහයට, යෝග්‍යතාවයට, නොකඩවා කිරීමට, වීර්යයට නැමෙන්නේ නැද්ද, මෙය පස්වන සිත බැඳ තබන බන්ධනයයි.\n\n‘‘පඤ්චෙන්ද්‍රියයෝ වෙති. එනම්: චක්ඛුන්‍ද්‍රිය, සොතින්‍ද්‍රිය, ඝාණින්‍ද්‍රිය, ජිව්හින්‍ද්‍රිය, කායින්‍ද්‍රිය යනුයි.\n\nතවද පඤ්චෙන්‍ද්‍රියයෝ වෙති. එනම්: සුඛෙන්‍ද්‍රිය, දුක්ඛෙන්‍ද්‍රිය, සොමනස්සෙන්‍ද්‍රිය, දොමනස්සෙන්‍ද්‍රිය, උපෙක්ඛෙන්‍ද්‍රිය යනුයි.\n\nතවද පඤ්චෙන්‍ද්‍රියයෝ වෙති. එනම්: සද්‍ධින්‍ද්‍රිය, විරියින්‍ද්‍රිය, සතින්‍ද්‍රිය, සමාධින්‍ද්‍රිය, පඤ්ඤින්‍ද්‍රිය යනුයි.",
      "paliTitle": ""
    },
    {
      "number": 321,
      "pali": "‘‘Pañca nissaraṇiyā [nissāraṇīyā (sī. syā. kaṃ. pī.) ṭīkā oloketabbā] dhātuyo. Idhāvuso, bhikkhuno kāme manasikaroto kāmesu cittaṃ na pakkhandati na pasīdati na santiṭṭhati na vimuccati. Nekkhammaṃ kho panassa manasikaroto nekkhamme cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ visaṃyuttaṃ kāmehi. Ye ca kāmapaccayā uppajjanti āsavā vighātā pariḷāhā [vighātapariḷāhā (syā. kaṃ.)], mutto so tehi, na so taṃ vedanaṃ vedeti. Idamakkhātaṃ kāmānaṃ nissaraṇaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhuno byāpādaṃ manasikaroto byāpāde cittaṃ na pakkhandati na pasīdati na santiṭṭhati na vimuccati. Abyāpādaṃ kho panassa manasikaroto abyāpāde cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ visaṃyuttaṃ byāpādena. Ye ca byāpādapaccayā uppajjanti āsavā vighātā pariḷāhā, mutto so tehi, na so taṃ vedanaṃ vedeti. Idamakkhātaṃ byāpādassa nissaraṇaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhuno vihesaṃ manasikaroto vihesāya cittaṃ na pakkhandati na pasīdati na santiṭṭhati na vimuccati. Avihesaṃ kho panassa manasikaroto avihesāya cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ visaṃyuttaṃ vihesāya. Ye ca vihesāpaccayā uppajjanti āsavā vighātā pariḷāhā, mutto so tehi, na so taṃ vedanaṃ vedeti. Idamakkhātaṃ vihesāya nissaraṇaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhuno rūpe manasikaroto rūpesu cittaṃ na pakkhandati na pasīdati na santiṭṭhati na vimuccati. Arūpaṃ kho panassa manasikaroto arūpe cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ visaṃyuttaṃ rūpehi. Ye ca rūpapaccayā uppajjanti āsavā vighātā pariḷāhā, mutto so tehi, na so taṃ vedanaṃ vedeti. Idamakkhātaṃ rūpānaṃ nissaraṇaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhuno sakkāyaṃ manasikaroto sakkāye cittaṃ na pakkhandati na pasīdati na santiṭṭhati na vimuccati. Sakkāyanirodhaṃ kho panassa manasikaroto sakkāyanirodhe cittaṃ pakkhandati pasīdati santiṭṭhati vimuccati. Tassa taṃ cittaṃ sugataṃ subhāvitaṃ suvuṭṭhitaṃ suvimuttaṃ visaṃyuttaṃ sakkāyena. Ye ca sakkāyapaccayā uppajjanti āsavā vighātā pariḷāhā, mutto so tehi, na so taṃ vedanaṃ vedeti. Idamakkhātaṃ sakkāyassa nissaraṇaṃ.",
      "english": "\"There are these five kinds of escape, friends. Here, when a bhikkhu attends to sense pleasures, his mind does not incline towards sense pleasures, does not become clear, does not settle, does not become liberated. But when he attends to renunciation, his mind inclines towards renunciation, becomes clear, settles, becomes liberated. His mind is well-gone, well-developed, well-risen, well-liberated, and detached from sense pleasures. And those defilements, torments, and burning pains that arise conditioned by sense pleasures, he is freed from them; he does not experience that feeling. This is called the escape from sense pleasures.\n\n\"Furthermore, friends, when a bhikkhu attends to ill will, his mind does not incline towards ill will, does not become clear, does not settle, does not become liberated. But when he attends to loving-kindness, his mind inclines towards loving-kindness, becomes clear, settles, becomes liberated. His mind is well-gone, well-developed, well-risen, well-liberated, and detached from ill will. And those defilements, torments, and burning pains that arise conditioned by ill will, he is freed from them; he does not experience that feeling. This is called the escape from ill will.\n\n\"Furthermore, friends, when a bhikkhu attends to harming, his mind does not incline towards harming, does not become clear, does not settle, does not become liberated. But when he attends to harmlessness, his mind inclines towards harmlessness, becomes clear, settles, becomes liberated. His mind is well-gone, well-developed, well-risen, well-liberated, and detached from harming. And those defilements, torments, and burning pains that arise conditioned by harming, he is freed from them; he does not experience that feeling. This is called the escape from harming.\n\n\"Furthermore, friends, when a bhikkhu attends to form, his mind does not incline towards forms, does not become clear, does not settle, does not become liberated. But when he attends to the formless, his mind inclines towards the formless, becomes clear, settles, becomes liberated. His mind is well-gone, well-developed, well-risen, well-liberated, and detached from forms. And those defilements, torments, and burning pains that arise conditioned by forms, he is freed from them; he does not experience that feeling. This is called the escape from forms.\n\n\"Furthermore, friends, when a bhikkhu attends to self-identity, his mind does not incline towards self-identity, does not become clear, does not settle, does not become liberated. But when he attends to the cessation of self-identity, his mind inclines towards the cessation of self-identity, becomes clear, settles, becomes liberated. His mind is well-gone, well-developed, well-risen, well-liberated, and detached from self-identity. And those defilements, torments, and burning pains that arise conditioned by self-identity, he is freed from them; he does not experience that feeling. This is called the escape from self-identity.\"",
      "sinhala": "“පඤ්ච නිස්සරණීය ධාතුයෝ වෙත්. ඇවැත්නි, මෙහිලා භික්ෂුව කාමය මෙනෙහි කරණ කල්හි කාමයන්හි සිත නොඇලෙයි, නොප්‍රසීදයි, නොපිහිටයි, නොමිදෙයි. නෛෂ්ක්‍රම්‍යයම ඔහු මෙනෙහි කරණ කල්හි නෛෂ්ක්‍රම්‍යයෙහි සිත ඇලෙයි, පැහැදෙයි, පිහිටයි, මිදෙයි. ඒ ඔහුගේ සිත මනාගිය, මනාව වැඩූ, මනාව නැංවූ, මනාව මිදුණු, කාමයන්ගෙන් වෙන්වූවකි. යම් කාමයන් හේතුකොටගෙන ආශ්‍රවයෝ, විඝාතයෝ, පරිළාහයෝ උපදිත් නම්, ඔහු ඔවුන්ගෙන් මිදුණේ වෙයි, ඔහු ඒ වේදනාව නොවිඳියි. මෙය කාමයන්ගේ නිස්සරණයයි කියන ලදී. “\n\n“තවද ඇවැත්නි, භික්ෂුව ව්‍යාපාදය මෙනෙහි කරණ කල්හි ව්‍යාපාදයෙහි සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, නොමිදෙයි. අව්‍යාපාදයම ඔහු මෙනෙහි කරණ කල්හි අව්‍යාපාදයෙහි සිත ඇලෙයි, පැහැදෙයි, පිහිටයි, මිදෙයි. ඒ ඔහුගේ සිත මනාගිය, මනාව වැඩූ, මනාව නැංවූ, මනාව මිදුණු, ව්‍යාපාදයෙන් වෙන්වූවකි. යම් ව්‍යාපාදයන් හේතුකොටගෙන ආශ්‍රවයෝ, විඝාතයෝ, පරිළාහයෝ උපදිත් නම්, ඔහු ඔවුන්ගෙන් මිදුණේ වෙයි, ඔහු ඒ වේදනාව නොවිඳියි. මෙය ව්‍යාපාදයේ නිස්සරණයයි කියන ලදී.”\n\n“තවද ඇවැත්නි, භික්ෂුව විහිංසාව මෙනෙහි කරණ කල්හි විහිංසාවෙහි සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, නොමිදෙයි. අවිහිංසාවම ඔහු මෙනෙහි කරණ කල්හි අවිහිංසාවෙහි සිත ඇලෙයි, පැහැදෙයි, පිහිටයි, මිදෙයි. ඒ ඔහුගේ සිත මනාගිය, මනාව වැඩූ, මනාව නැංවූ, මනාව මිදුණු, විහිංසාවෙන් වෙන්වූවකි. යම් විහිංසාවන් හේතුකොටගෙන ආශ්‍රවයෝ, විඝාතයෝ, පරිළාහයෝ උපදිත් නම්, ඔහු ඔවුන්ගෙන් මිදුණේ වෙයි, ඔහු ඒ වේදනාව නොවිඳියි. මෙය විහිංසාවේ නිස්සරණයයි කියන ලදී.”\n\n“තවද ඇවැත්නි, භික්ෂුව රූපය මෙනෙහි කරණ කල්හි රූපයන්හි සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, නොමිදෙයි. අරූපයම ඔහු මෙනෙහි කරණ කල්හි අරූපයෙහි සිත ඇලෙයි, පැහැදෙයි, පිහිටයි, මිදෙයි. ඒ ඔහුගේ සිත මනාගිය, මනාව වැඩූ, මනාව නැංවූ, මනාව මිදුණු, රූපයන්ගෙන් වෙන්වූවකි. යම් රූපයන් හේතුකොටගෙන ආශ්‍රවයෝ, විඝාතයෝ, පරිළාහයෝ උපදිත් නම්, ඔහු ඔවුන්ගෙන් මිදුණේ වෙයි, ඔහු ඒ වේදනාව නොවිඳියි. මෙය රූපයන්ගේ නිස්සරණයයි කියන ලදී.”\n\n“තවද ඇවැත්නි, භික්ෂුව සක්කාය මෙනෙහි කරණ කල්හි සක්කායෙහි සිත නොඇලෙයි, නොපැහැදෙයි, නොපිහිටයි, නොමිදෙයි. සක්කාය නිරෝධයම ඔහු මෙනෙහි කරණ කල්හි සක්කාය නිරෝධයෙහි සිත ඇලෙයි, පැහැදෙයි, පිහිටයි, මිදෙයි. ඒ ඔහුගේ සිත මනාගිය, මනාව වැඩූ, මනාව නැංවූ, මනාව මිදුණු, සක්කායෙන් වෙන්වූවකි. යම් සක්කායන් හේතුකොටගෙන ආශ්‍රවයෝ, විඝාතයෝ, පරිළාහයෝ උපදිත් නම්, ඔහු ඔවුන්ගෙන් මිදුණේ වෙයි, ඔහු ඒ වේදනාව නොවිඳියි. මෙය සක්කායෙහි නිස්සරණයයි කියන ලදී.”",
      "paliTitle": ""
    },
    {
      "number": 322,
      "pali": "‘‘Pañca vimuttāyatanāni. Idhāvuso, bhikkhuno satthā dhammaṃ deseti aññataro vā garuṭṭhāniyo sabrahmacārī. Yathā yathā, āvuso, bhikkhuno satthā dhammaṃ deseti aññataro vā garuṭṭhāniyo sabrahmacārī. Tathā tathā so tasmiṃ dhamme atthapaṭisaṃvedī ca hoti dhammapaṭisaṃvedī ca. Tassa atthapaṭisaṃvedino dhammapaṭisaṃvedino pāmojjaṃ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyati. Idaṃ paṭhamaṃ vimuttāyatanaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhuno na heva kho satthā dhammaṃ deseti aññataro vā garuṭṭhāniyo sabrahmacārī, api ca kho yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena paresaṃ deseti…pe… api ca kho yathāsutaṃ yathāpariyattaṃ dhammaṃ vitthārena sajjhāyaṃ karoti…pe… api ca kho yathāsutaṃ yathāpariyattaṃ dhammaṃ cetasā anuvitakketi anuvicāreti manasānupekkhati…pe… api ca khvassa aññataraṃ samādhinimittaṃ suggahitaṃ hoti sumanasikataṃ sūpadhāritaṃ suppaṭividdhaṃ paññāya. Yathā yathā, āvuso, bhikkhuno aññataraṃ samādhinimittaṃ suggahitaṃ hoti sumanasikataṃ sūpadhāritaṃ suppaṭividdhaṃ paññāya tathā tathā so tasmiṃ dhamme atthapaṭisaṃvedī ca hoti dhammapaṭisaṃvedī ca. Tassa atthapaṭisaṃvedino dhammapaṭisaṃvedino pāmojjaṃ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyati. Idaṃ pañcamaṃ vimuttāyatanaṃ. ‘‘Pañca vimuttiparipācanīyā saññā – aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena pañca dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ [saṅgitiyapañcakaṃ niṭṭhitaṃ (syā. kaṃ.)]. ",
      "english": "\"There are these five liberating abodes. Here, a bhikkhu is taught the Dhamma by the Teacher, or by a respected fellow monk. As the bhikkhu is taught the Dhamma by the Teacher, or by a respected fellow monk, so he experiences the meaning and the Dhamma in that teaching. In him experiencing the meaning and the Dhamma, joy arises; in him being joyful, rapture arises; in him being enraptured, the body becomes tranquil; in him having a tranquil body, he feels happiness; in him being happy, the mind becomes concentrated. This is the first liberating abode.\n\n\"Furthermore, a bhikkhu is not taught the Dhamma by the Teacher, or by a respected fellow monk, but he teaches the Dhamma in detail to others as he has heard and learned it… he recites the Dhamma in detail as he has heard and learned it… he thinks about and reflects upon the Dhamma as he has heard and learned it, he mentally investigates it… he has a certain object of concentration well grasped, well attended to, well ascertained, well penetrated by wisdom. As the bhikkhu has a certain object of concentration well grasped, well attended to, well ascertained, well penetrated by wisdom, so he experiences the meaning and the Dhamma in that teaching. In him experiencing the meaning and the Dhamma, joy arises; in him being joyful, rapture arises; in him being enraptured, the body becomes tranquil; in him having a tranquil body, he feels happiness; in him being happy, the mind becomes concentrated. This is the fifth liberating abode.\n\n\"These are the five perceptions that ripen into liberation: the perception of impermanence, the perception of suffering in impermanence, the perception of not-self in suffering, the perception of abandoning, the perception of dispassion.\n\n\"These five things, friends, have been well proclaimed by that Blessed One, who knows, who sees, the Arahant, the perfectly enlightened Buddha; in this all should be chanted together… for the benefit, welfare, and happiness of gods and humans.\"",
      "sinhala": "‘‘විමුක්ත්‍යායතන පහකි. ඇවැත්නි, මෙහිලා භික්ෂුවකට ශාස්තෘන් වහන්සේ හෝ වෙනත් ගරු කළ යුතු සහබ්‍රහ්මචාරියෙක් ධර්මය දේශනා කරයි. ඇවැත්නි, යම් යම් අයුරකින් භික්ෂුවකට ශාස්තෘන් වහන්සේ හෝ වෙනත් ගරු කළ යුතු සහබ්‍රහ්මචාරියෙක් ධර්මය දේශනා කරන්නේද, එසේ එසේ ඔහු එම ධර්මයෙහි අර්ථ ප්‍රතිසංවේදී ද වෙයි, ධර්ම ප්‍රතිසංවේදී ද වෙයි. අර්ථ ප්‍රතිසංවේදී වූ, ධර්ම ප්‍රතිසංවේදී වූ ඔහුට ප්‍රාමෝද්‍යය (ප්‍රීතිය) උපදී. ප්‍රමුදිත වූ ඔහුට ප්‍රීතිය උපදී. ප්‍රීතිමත් වූ ඔහුගේ කය සංසිඳෙයි. සංසිඳුනු කය ඇති ඔහු සැප විඳියි. සැපවත් වූ ඔහුගේ සිත සමාධිමත් වෙයි. මෙය පළමු විමුක්ත්‍යායතනයයි. ‘‘තවද, ඇවැත්නි, භික්ෂුවකට ශාස්තෘන් වහන්සේ හෝ වෙනත් ගරු කළ යුතු සහබ්‍රහ්මචාරියෙක් ධර්මය දේශනා නොකරයි. එහෙත් ඔහු අසා දැනගත්, උගත් ධර්මය අනුන්ට විස්තර වශයෙන් දේශනා කරයි. …පෙ.… අසා දැනගත්, උගත් ධර්මය විස්තර වශයෙන් සජ්ඣායනා කරයි. …පෙ.… අසා දැනගත්, උගත් ධර්මය සිතින් විතර්ක කරයි, විචාරණය කරයි, මනසින් මෙනෙහි කරයි. …පෙ.… නැතහොත් ඔහුට යම් සමාධි නිමිත්තක් මනාව ගත් දෙයක් වේද, මනාව මෙනෙහි කළ දෙයක් වේද, මනාව ධාරණය කළ දෙයක් වේද, ප්‍රඥාවෙන් මනාව විනිවිද දුටු දෙයක් වේද, ඇවැත්නි, යම් යම් අයුරකින් භික්ෂුවකට යම් සමාධි නිමිත්තක් මනාව ගත් දෙයක් වේද, මනාව මෙනෙහි කළ දෙයක් වේද, මනාව ධාරණය කළ දෙයක් වේද, ප්‍රඥාවෙන් මනාව විනිවිද දුටු දෙයක් වේද, එසේ එසේ ඔහු එම ධර්මයෙහි අර්ථ ප්‍රතිසංවේදී ද වෙයි, ධර්ම ප්‍රතිසංවේදී ද වෙයි. අර්ථ ප්‍රතිසංවේදී වූ, ධර්ම ප්‍රතිසංවේදී වූ ඔහුට ප්‍රාමෝද්‍යය (ප්‍රීතිය) උපදී. ප්‍රමුදිත වූ ඔහුට ප්‍රීතිය උපදී. ප්‍රීතිමත් වූ ඔහුගේ කය සංසිඳෙයි. සංසිඳුනු කය ඇති ඔහු සැප විඳියි. සැපවත් වූ ඔහුගේ සිත සමාධිමත් වෙයි. මෙය පස්වන විමුක්ත්‍යායතනයයි. ‘‘විමුක්ති පරිපාකයට පමුණුවන සංඥා පහකි. එනම්, අනිත්‍ය සංඥාව, අනිත්‍යයෙහි දුක්ඛ සංඥාව, දුක්ඛයෙහි අනัตථ සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව යනුයි. ‘‘ඇවැත්නි, මේ ධර්ම පහ භාග්‍යවතුන් වහන්සේ විසින් මැනවින් දන්නා ලද, මැනවින් දක්නා ලද, අරහත් වූ, සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ විසින් මැනවින් දේශනා කරන ලදී. එහි සියල්ලෝම එක්ව ගායනා කළ යුතුය. …පෙ.… දෙව් මිනිසුන්ට අර්ථය පිණිස, හිත සුව පිණිස (සංගීති පංචකය නිමි).",
      "paliTitle": ""
    },
    {
      "number": 323,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena cha dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Katame cha? ‘‘Cha ajjhattikāni āyatanāni – cakkhāyatanaṃ, sotāyatanaṃ, ghānāyatanaṃ, jivhāyatanaṃ, kāyāyatanaṃ, manāyatanaṃ. ‘‘Cha bāhirāni āyatanāni – rūpāyatanaṃ, saddāyatanaṃ, gandhāyatanaṃ, rasāyatanaṃ, phoṭṭhabbāyatanaṃ, dhammāyatanaṃ. ‘‘Cha viññāṇakāyā – cakkhuviññāṇaṃ, sotaviññāṇaṃ, ghānaviññāṇaṃ, jivhāviññāṇaṃ, kāyaviññāṇaṃ, manoviññāṇaṃ. ‘‘Cha phassakāyā – cakkhusamphasso, sotasamphasso, ghānasamphasso, jivhāsamphasso, kāyasamphasso, manosamphasso. ‘‘Cha vedanākāyā – cakkhusamphassajā vedanā, sotasamphassajā vedanā, ghānasamphassajā vedanā, jivhāsamphassajā vedanā, kāyasamphassajā vedanā, manosamphassajā vedanā. ‘‘Cha saññākāyā – rūpasaññā, saddasaññā, gandhasaññā, rasasaññā, phoṭṭhabbasaññā, dhammasaññā. ‘‘Cha sañcetanākāyā – rūpasañcetanā, saddasañcetanā, gandhasañcetanā, rasasañcetanā, phoṭṭhabbasañcetanā, dhammasañcetanā. ‘‘Cha taṇhākāyā – rūpataṇhā, saddataṇhā, gandhataṇhā, rasataṇhā, phoṭṭhabbataṇhā, dhammataṇhā.",
      "english": "“Friend, these six things have been well-proclaimed by that Blessed One, who knows, who sees, the worthy one, the fully self-awakened one; all should recite them together… for the benefit, welfare, and happiness of gods and humans. What are the six?\n\n“Six internal sense bases: the eye sense base, the ear sense base, the nose sense base, the tongue sense base, the body sense base, the mind sense base.\n\n“Six external sense bases: the form sense base, the sound sense base, the smell sense base, the taste sense base, the touch sense base, the mental-object sense base.\n\n“Six classes of consciousness: eye-consciousness, ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, mind-consciousness.\n\n“Six classes of contact: eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, mind-contact.\n\n“Six classes of feeling: feeling born of eye-contact, feeling born of ear-contact, feeling born of nose-contact, feeling born of tongue-contact, feeling born of body-contact, feeling born of mind-contact.\n\n“Six classes of perception: perception of forms, perception of sounds, perception of smells, perception of tastes, perception of tactile objects, perception of mental objects.\n\n“Six classes of volition: volition regarding forms, volition regarding sounds, volition regarding smells, volition regarding tastes, volition regarding tactile objects, volition regarding mental objects.\n\n“Six classes of craving: craving for forms, craving for sounds, craving for smells, craving for tastes, craving for tactile objects, craving for mental objects.",
      "sinhala": "“ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ භාග්‍යවතුන් වහන්සේ විසින් ධර්ම හයක් මැනවින් දේශනා කරන ලදී; එහි සියල්ලන් විසින් ම එක්ව ගායනා කළ යුතුයි. දෙවියන් හා මිනිසුන්ගේ අර්ථය පිණිස, හිතසුව පිණිස (එය තිබිය යුතුයි). ඒ හය මොනවාද?\n\n“ඇතුළත ආයතන හයකි - චක්ඛායතනය, සෝතායතනය, ඝාණායතනය, ජිව්හායතනය, කායායතනය, මනායතනය.\n\n“බාහිර ආයතන හයකි - රූපායතනය, ශබ්දායතනය, ගන්ධායතනය, රසායතනය, ස්පර්ශායතනය, ධම්මායතනය.\n\n“විඤ්ඤාණ කාය හයකි - චක්ඛු විඤ්ඤාණය, සෝත විඤ්ඤාණය, ඝාණ විඤ්ඤාණය, ජිව්හා විඤ්ඤාණය, කාය විඤ්ඤාණය, මනෝ විඤ්ඤාණය.\n\n“ස්පර්ශ කාය හයකි - චක්ඛු සම්ඵස්සය, සෝත සම්ඵස්සය, ඝාණ සම්ඵස්සය, ජිව්හා සම්ඵස්සය, කාය සම්ඵස්සය, මනෝ සම්ඵස්සය.\n\n“වේදනා කාය හයකි - චක්ඛු සම්ඵස්සයෙන් හටගත් වේදනාව, සෝත සම්ඵස්සයෙන් හටගත් වේදනාව, ඝාණ සම්ඵස්සයෙන් හටගත් වේදනාව, ජිව්හා සම්ඵස්සයෙන් හටගත් වේදනාව, කාය සම්ඵස්සයෙන් හටගත් වේදනාව, මනෝ සම්ඵස්සයෙන් හටගත් වේදනාව.\n\n“සංඥා කාය හයකි - රූප සංඥාව, ශබ්ද සංඥාව, ගන්ධ සංඥාව, රස සංඥාව, ස්පර්ශ සංඥාව, ධම්ම සංඥාව.\n\n“සංචේතනා කාය හයකි - රූප සංචේතනාව, ශබ්ද සංචේතනාව, ගන්ධ සංචේතනාව, රස සංචේතනාව, ස්පර්ශ සංචේතනාව, ධම්ම සංචේතනාව.\n\n“තණ්හා කාය හයකි - රූප තණ්හාව, ශබ්ද තණ්හාව, ගන්ධ තණ්හාව, රස තණ්හාව, ස්පර්ශ තණ්හාව, ධම්ම තණ්හාව.”",
      "paliTitle": "Chakkaṃ",
      "englishTitle": "The Six",
      "sinhalaTitle": "ෂට්කය"
    },
    {
      "number": 324,
      "pali": "‘‘Cha agāravā. Idhāvuso, bhikkhu satthari agāravo viharati appatisso; dhamme agāravo viharati appatisso; saṅghe agāravo viharati appatisso; sikkhāya agāravo viharati appatisso; appamāde agāravo viharati appatisso; paṭisanthāre [paṭisandhāre (ka.)] agāravo viharati appatisso. ‘‘Cha gāravā. Idhāvuso, bhikkhu satthari sagāravo viharati sappatisso; dhamme sagāravo viharati sappatisso; saṅghe sagāravo viharati sappatisso; sikkhāya sagāravo viharati sappatisso; appamāde sagāravo viharati sappatisso; paṭisanthāre sagāravo viharati sappatisso. ‘‘Cha somanassūpavicārā. Cakkhunā rūpaṃ disvā somanassaṭṭhāniyaṃ rūpaṃ upavicarati; sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā. Manasā dhammaṃ viññāya somanassaṭṭhāniyaṃ dhammaṃ upavicarati. ‘‘Cha domanassūpavicārā. Cakkhunā rūpaṃ disvā domanassaṭṭhāniyaṃ rūpaṃ upavicarati…pe… manasā dhammaṃ viññāya domanassaṭṭhāniyaṃ dhammaṃ upavicarati. ‘‘Cha upekkhūpavicārā. Cakkhunā rūpaṃ disvā upekkhāṭṭhāniyaṃ [upekkhāṭhāniyaṃ (ka.)] rūpaṃ upavicarati…pe… manasā dhammaṃ viññāya upekkhāṭṭhāniyaṃ dhammaṃ upavicarati. ‘‘Cha sāraṇīyā dhammā. Idhāvuso, bhikkhuno mettaṃ kāyakammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi [āvī (ka. sī. pī. ka.)] ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, āvuso, bhikkhuno mettaṃ vacīkammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, āvuso, bhikkhuno mettaṃ manokammaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu āvi ceva raho ca. Ayampi dhammo sāraṇīyo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, āvuso, bhikkhu ye te lābhā dhammikā dhammaladdhā antamaso pattapariyāpannamattampi, tathārūpehi lābhehi appaṭivibhattabhogī hoti sīlavantehi sabrahmacārīhi sādhāraṇabhogī. Ayampi dhammo sāraṇīyo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, āvuso, bhikkhu yāni tāni sīlāni akhaṇḍāni acchiddāni asabalāni akammāsāni bhujissāni viññuppasatthāni aparāmaṭṭhāni samādhisaṃvattanikāni, tathārūpesu sīlesu sīlasāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo sāraṇīyo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, āvuso, bhikkhu yāyaṃ diṭṭhi ariyā niyyānikā niyyāti takkarassa sammā dukkhakkhayāya, tathārūpāya diṭṭhiyā diṭṭhisāmaññagato viharati sabrahmacārīhi āvi ceva raho ca. Ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati.",
      "english": "\"There are these six kinds of disrespect. Here, a bhikkhu lives disrespectfully and without deference towards the Teacher; he lives disrespectfully and without deference towards the Dhamma; he lives disrespectfully and without deference towards the Saṅgha; he lives disrespectfully and without deference towards the training; he lives disrespectfully and without deference towards diligence; he lives disrespectfully and without deference towards hospitality.\n\n\"There are these six kinds of respect. Here, a bhikkhu lives respectfully and with deference towards the Teacher; he lives respectfully and with deference towards the Dhamma; he lives respectfully and with deference towards the Saṅgha; he lives respectfully and with deference towards the training; he lives respectfully and with deference towards diligence; he lives respectfully and with deference towards hospitality.\n\n\"There are these six instances of examining things connected with joy. Having seen a form with the eye, he examines a form connected with joy. Having heard a sound with the ear… Having smelled an odor with the nose… Having savored a taste with the tongue… Having felt a tactile object with the body… Having cognized a mental phenomenon with the mind, he examines a mental phenomenon connected with joy.\n\n\"There are these six instances of examining things connected with sadness. Having seen a form with the eye, he examines a form connected with sadness…pe… Having cognized a mental phenomenon with the mind, he examines a mental phenomenon connected with sadness.\n\n\"There are these six instances of examining things connected with equanimity. Having seen a form with the eye, he examines a form connected with equanimity…pe… Having cognized a mental phenomenon with the mind, he examines a mental phenomenon connected with equanimity.\n\n\"There are these six things that promote affection. Here, a bhikkhu maintains bodily acts of loving-kindness towards his fellows in the holy life, both in public and in private. This Dhamma leads to affection, respect, and cohesion, to non-dispute, concord, and unity.\n\n\"Furthermore, a bhikkhu maintains verbal acts of loving-kindness towards his fellows in the holy life, both in public and in private. This Dhamma leads to… unity.\n\n\"Furthermore, a bhikkhu maintains mental acts of loving-kindness towards his fellows in the holy life, both in public and in private. This Dhamma leads to… unity.\n\n\"Furthermore, a bhikkhu shares without reservation with his virtuous fellows in the holy life any gains he has rightly obtained, even the mere contents of his alms bowl. This Dhamma leads to… unity.\n\n\"Furthermore, a bhikkhu dwells together with his fellows in the holy life in the unbroken, impeccable, unblemished, unspotted, liberating, praised by the wise, untarnished, conducive to concentration precepts. This Dhamma leads to… unity.\n\n\"Furthermore, a bhikkhu dwells together with his fellows in the holy life in the view that is noble and emancipating, that leads the one who acts accordingly to the complete destruction of suffering. This Dhamma leads to affection, respect, and cohesion, to non-dispute, concord, and unity.\"",
      "sinhala": "‘‘අගෞරව හයකි. ආයුෂ්මතුන්, මෙහි භික්ෂුව ශාස්තෘන් වහන්සේ කෙරෙහි අගෞරවයෙන් යුතුව අප්‍රතිපත්තියෙන් වාසය කරයි; ධර්මය කෙරෙහි අගෞරවයෙන් යුතුව අප්‍රතිපත්තියෙන් වාසය කරයි; සංඝයා කෙරෙහි අගෞරවයෙන් යුතුව අප්‍රතිපත්තියෙන් වාසය කරයි; ශික්ෂාව කෙරෙහි අගෞරවයෙන් යුතුව අප්‍රතිපත්තියෙන් වාසය කරයි; අප්‍රමාදය කෙරෙහි අගෞරවයෙන් යුතුව අප්‍රතිපත්තියෙන් වාසය කරයි; පිළිසන් කථා කිරීමෙහි අගෞරවයෙන් යුතුව අප්‍රතිපත්තියෙන් වාසය කරයි.\n\n‘‘ගෞරව හයකි. ආයුෂ්මතුන්, මෙහි භික්ෂුව ශාස්තෘන් වහන්සේ කෙරෙහි ගෞරවයෙන් යුතුව ප්‍රතිපත්තියෙන් වාසය කරයි; ධර්මය කෙරෙහි ගෞරවයෙන් යුතුව ප්‍රතිපත්තියෙන් වාසය කරයි; සංඝයා කෙරෙහි ගෞරවයෙන් යුතුව ප්‍රතිපත්තියෙන් වාසය කරයි; ශික්ෂාව කෙරෙහි ගෞරවයෙන් යුතුව ප්‍රතිපත්තියෙන් වාසය කරයි; අප්‍රමාදය කෙරෙහි ගෞරවයෙන් යුතුව ප්‍රතිපත්තියෙන් වාසය කරයි; පිළිසන් කථා කිරීමෙහි ගෞරවයෙන් යුතුව ප්‍රතිපත්තියෙන් වාසය කරයි.\n\n‘‘ප්‍රීතිය උපදවන අරමුණු පිළිබඳ විමසීම් හයකි. ඇසෙන් රූපයක් දැක ප්‍රීතිය ඇතිවිය හැකි රූපයක් මෙනෙහි කරයි; කනෙන් ශබ්දයක් අසා… නාසයෙන් ගන්ධයක් ආඝ්‍රාණය කර… දිවෙන් රසයක් විඳ… කයින් ස්පර්ශයක් ස්පර්ශ කර… මනසින් ධර්මයක් දැන ප්‍රීතිය ඇතිවිය හැකි ධර්මයක් මෙනෙහි කරයි.\n\n‘‘දුක උපදවන අරමුණු පිළිබඳ විමසීම් හයකි. ඇසෙන් රූපයක් දැක දුක ඇතිවිය හැකි රූපයක් මෙනෙහි කරයි…පෙ… මනසින් ධර්මයක් දැන දුක ඇතිවිය හැකි ධර්මයක් මෙනෙහි කරයි.\n\n‘‘උපේක්ෂාව උපදවන අරමුණු පිළිබඳ විමසීම් හයකි. ඇසෙන් රූපයක් දැක උපේක්ෂාව ඇතිවිය හැකි රූපයක් මෙනෙහි කරයි…පෙ… මනසින් ධර්මයක් දැන උපේක්ෂාව ඇතිවිය හැකි ධර්මයක් මෙනෙහි කරයි.\n\n‘‘සිහි කටයුතු ධර්ම හයකි. ආයුෂ්මතුන්, මෙහි භික්ෂුවගේ මෛත්‍රී සහගත කායික කර්මය සහබ්‍රහ්මචාරීන් කෙරෙහි ප්‍රකටව ද රහසින් ද පවත්නේ වෙයි. මේ ධර්මයත් සිහි කටයුතුය, ප්‍රියංකරණය, ගරුකරණය, සංග්‍රහය, විවාද නැති කිරීම, සමගිය හා එකමුතු බව ඇති කිරීමට හේතු වෙයි.\n\n‘‘තවද ආයුෂ්මතුන්, භික්ෂුවගේ මෛත්‍රී සහගත වාචික කර්මය සහබ්‍රහ්මචාරීන් කෙරෙහි ප්‍රකටව ද රහසින් ද පවත්නේ වෙයි. මේ ධර්මයත් සිහි කටයුතුය…පෙ… එකමුතු බව ඇති කිරීමට හේතු වෙයි.\n\n‘‘තවද ආයුෂ්මතුන්, භික්ෂුවගේ මෛත්‍රී සහගත මානසික කර්මය සහබ්‍රහ්මචාරීන් කෙරෙහි ප්‍රකටව ද රහසින් ද පවත්නේ වෙයි. මේ ධර්මයත් සිහි කටයුතුය…පෙ… එකමුතු බව ඇති කිරීමට හේතු වෙයි.\n\n‘‘තවද ආයුෂ්මතුන්, භික්ෂුව යම් ඒ ධර්මානුකූලව ලැබූ ලාභයන් වෙත් ද, පාත්‍රයකට වැටුණු පමණකින් වුව ද සෑහීමකට පත්වේ ද, එබඳු ලාභයන් තමා පමණක් භුක්ති විඳින්නෙක් නොවෙයි. සීලවන්ත සහබ්‍රහ්මචාරීන් හා සමව බෙදාගෙන භුක්ති විඳින්නෙක් වෙයි. මේ ධර්මයත් සිහි කටයුතුය…පෙ… එකමුතු බව ඇති කිරීමට හේතු වෙයි.\n\n‘‘තවද ආයුෂ්මතුන්, භික්ෂුව යම් ඒ නො කැඩුණු, සිදුරු නැති, කිළිටි නැති, වහල් බවින් තොර වූ, නුවණැත්තන් විසින් ප්‍රශංසා කරන ලද, තෘෂ්ණා දෘෂ්ටි වලින් අල්ලා නොගත්, සමාධිය පිණිස පවත්නා සීලයන් වෙත් ද, එබඳු සීලයන්හි සීල සමානත්වයට පැමිණ සහබ්‍රහ්මචාරීන් හා ප්‍රකටව ද රහසින් ද වාසය කරයි. මේ ධර්මයත් සිහි කටයුතුය…පෙ… එකමුතු බව ඇති කිරීමට හේතු වෙයි.\n\n‘‘තවද ආයුෂ්මතුන්, යම් ඒ ආර්ය වූ, නිවනට පමුණුවන, මනා කොට දුක් කෙළවර කිරීම පිණිස පවත්නා දෘෂ්ටියක් වේ ද, එබඳු දෘෂ්ටියෙහි දෘෂ්ටි සමානත්වයට පැමිණ සහබ්‍රහ්මචාරීන් හා ප්‍රකටව ද රහසින් ද වාසය කරයි. මේ ධර්මයත් සිහි කටයුතුය, ප්‍රියංකරණය, ගරුකරණය, සංග්‍රහය, විවාද නැති කිරීම, සමගිය හා එකමුතු බව ඇති කිරීමට හේතු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 325,
      "pali": "Cha vivādamūlāni. Idhāvuso, bhikkhu kodhano hoti upanāhī. Yo so, āvuso, bhikkhu kodhano hoti upanāhī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī [paripūrīkārī (syā. kaṃ.)] hoti. Yo so, āvuso, bhikkhu satthari agāravo viharati appatisso, dhamme agāravo viharati appatisso, saṅghe agāravo viharati appatisso, sikkhāya na paripūrakārī, so saṅghe vivādaṃ janeti. Yo hoti vivādo bahujanaahitāya bahujanaasukhāya anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpaṃ ce tumhe, āvuso, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha. Tatra tumhe, āvuso, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpaṃ ce tumhe, āvuso, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha. Tatra tumhe, āvuso, tasseva pāpakassa vivādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṃ hoti. Evametassa pāpakassa vivādamūlassa āyatiṃ anavassavo hoti. ‘‘Puna caparaṃ, āvuso, bhikkhu makkhī hoti paḷāsī…pe… issukī hoti maccharī…pe… saṭho hoti māyāvī… pāpiccho hoti micchādiṭṭhī… sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī…pe… yo so, āvuso, bhikkhu sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī, so sattharipi agāravo viharati appatisso, dhammepi agāravo viharati appatisso, saṅghepi agāravo viharati appatisso, sikkhāyapi na paripūrakārī hoti. Yo so, āvuso, bhikkhu satthari agāravo viharati appatisso, dhamme agāravo viharati appatisso, saṅghe agāravo viharati appatisso, sikkhāya na paripūrakārī, so saṅghe vivādaṃ janeti. Yo hoti vivādo bahujanaahitāya bahujanaasukhāya anatthāya ahitāya dukkhāya devamanussānaṃ. Evarūpaṃ ce tumhe, āvuso, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā samanupasseyyātha. Tatra tumhe, āvuso, tasseva pāpakassa vivādamūlassa pahānāya vāyameyyātha. Evarūpaṃ ce tumhe, āvuso, vivādamūlaṃ ajjhattaṃ vā bahiddhā vā na samanupasseyyātha. Tatra tumhe, āvuso, tasseva pāpakassa vivādamūlassa āyatiṃ anavassavāya paṭipajjeyyātha. Evametassa pāpakassa vivādamūlassa pahānaṃ hoti. Evametassa pāpakassa vivādamūlassa āyatiṃ anavassavo hoti. ‘‘Cha dhātuyo – pathavīdhātu, āpodhātu, tejodhātu, vāyodhātu, ākāsadhātu, viññāṇadhātu.",
      "english": "There are six roots of disputes. Here, a bhikkhu is angry and harbors resentment. That bhikkhu who is angry and harbors resentment lives without respect and deference for the Teacher, lives without respect and deference for the Dhamma, lives without respect and deference for the Saṅgha, and is not a fulfiller of the training. That bhikkhu who lives without respect and deference for the Teacher, lives without respect and deference for the Dhamma, lives without respect and deference for the Saṅgha, and is not a fulfiller of the training, generates disputes in the Saṅgha. That dispute leads to the harm of many people, to the unhappiness of many people, to the disadvantage, harm, and suffering of gods and humans. If you see such a root of dispute within yourselves or in others, you should strive for the abandoning of that evil root of dispute. If you do not see such a root of dispute within yourselves or in others, you should practice so that such an evil root of dispute does not arise in the future. Thus, there is the abandoning of that evil root of dispute. Thus, there is no arising of that evil root of dispute in the future.\n\nFurthermore, a bhikkhu is disparaging and insolent… proud and jealous… deceitful and scheming… with evil desires and wrong view… clinging to his own views, dogmatic, and difficult to relinquish… That bhikkhu who is clinging to his own views, dogmatic, and difficult to relinquish lives without respect and deference for the Teacher, lives without respect and deference for the Dhamma, lives without respect and deference for the Saṅgha, and is not a fulfiller of the training. That bhikkhu who lives without respect and deference for the Teacher, lives without respect and deference for the Dhamma, lives without respect and deference for the Saṅgha, and is not a fulfiller of the training, generates disputes in the Saṅgha. That dispute leads to the harm of many people, to the unhappiness of many people, to the disadvantage, harm, and suffering of gods and humans. If you see such a root of dispute within yourselves or in others, you should strive for the abandoning of that evil root of dispute. If you do not see such a root of dispute within yourselves or in others, you should practice so that such an evil root of dispute does not arise in the future. Thus, there is the abandoning of that evil root of dispute. Thus, there is no arising of that evil root of dispute in the future.\n\nThere are six elements: the earth element, the water element, the fire element, the air element, the space element, and the consciousness element.",
      "sinhala": "ආයුෂ්මතුනි, විවාද ඇතිවීමට හේතු සයකි. ආයුෂ්මතුනි, මෙහි භික්ෂුව ක්‍රෝධ සහගත වෙයි, වෛර සහගත වෙයි. ආයුෂ්මතුනි, යම් භික්ෂුවක් ක්‍රෝධ සහගත වෙයි නම්, වෛර සහගත වෙයි නම්, ඔහු ශාස්තෘවරයා කෙරෙහිත් ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි, ධර්මය කෙරෙහිත් ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි, සංඝයා කෙරෙහිත් ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි, ශික්ෂාවෙහිත් පරිපූරක නොවෙයි. ආයුෂ්මතුනි, යම් භික්ෂුවක් ශාස්තෘවරයා කෙරෙහි ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි නම්, ධර්මය කෙරෙහි ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි නම්, සංඝයා කෙරෙහි ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි නම්, ශික්ෂාවෙහි පරිපූරක නොවෙයි නම්, ඔහු සංඝයා තුළ විවාද ඇති කරයි. යම් විවාදයක් බොහෝ දෙනාට අහිත පිණිස ද, බොහෝ දෙනාට දුක් පිණිස ද, අනර්ථ පිණිස ද, අහිත පිණිස ද, දෙවියන්ට සහ මනුෂ්‍යයන්ට දුක් පිණිස ද හේතු වෙයි. ආයුෂ්මතුනි, ඔබ තුළ හෝ පිටත මෙවැනි විවාදයක මුලක් දුටුවොත්, ආයුෂ්මතුනි, එහිදී ඔබ එම නරක විවාද මුල දුරු කිරීමට උත්සාහ කළ යුතුය. ආයුෂ්මතුනි, ඔබ තුළ හෝ පිටත මෙවැනි විවාදයක මුලක් නොදුටුවොත්, ආයුෂ්මතුනි, එහිදී ඔබ එම නරක විවාද මුල නැවත ඇතිවීම වැළැක්වීමට පිළිපැදිය යුතුය. මෙලෙස එම නරක විවාද මුල දුරු කිරීම සිදුවේ. මෙලෙස එම නරක විවාද මුල නැවත ඇතිවීම වැළැක්වීම සිදුවේ.\n\nතවද ආයුෂ්මතුනි, භික්ෂුව කුහකයෙක් වෙයි, අගුණ කියන්නෙක් වෙයි…ඊර්ෂ්‍යා කරන්නෙක් වෙයි, මසුරුවෙක් වෙයි…වංචනිකයෙක් වෙයි, මායාකාරී වෙයි…පව් කිරීමට කැමැත්ත ඇත්තෙක් වෙයි, මිථ්‍යා දෘෂ්ටිකයෙක් වෙයි…තම දෘෂ්ටියෙහි දැඩිව ඇලී ගත්, අත්හැරීමට අපහසු ගති ඇත්තෙක් වෙයි… ආයුෂ්මතුනි, යම් භික්ෂුවක් තම දෘෂ්ටියෙහි දැඩිව ඇලී ගත්, අත්හැරීමට අපහසු ගති ඇත්තෙක් වෙයි නම්, ඔහු ශාස්තෘවරයා කෙරෙහිත් ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි, ධර්මය කෙරෙහිත් ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි, සංඝයා කෙරෙහිත් ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි, ශික්ෂාවෙහිත් පරිපූරක නොවෙයි. ආයුෂ්මතුනි, යම් භික්ෂුවක් ශාස්තෘවරයා කෙරෙහි ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි නම්, ධර්මය කෙරෙහි ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි නම්, සංඝයා කෙරෙහි ගෞරවයක් නැතිව, බියක් නැතිව වාසය කරයි නම්, ශික්ෂාවෙහි පරිපූරක නොවෙයි නම්, ඔහු සංඝයා තුළ විවාද ඇති කරයි. යම් විවාදයක් බොහෝ දෙනාට අහිත පිණිස ද, බොහෝ දෙනාට දුක් පිණිස ද, අනර්ථ පිණිස ද, අහිත පිණිස ද, දෙවියන්ට සහ මනුෂ්‍යයන්ට දුක් පිණිස ද හේතු වෙයි. ආයුෂ්මතුනි, ඔබ තුළ හෝ පිටත මෙවැනි විවාදයක මුලක් දුටුවොත්, ආයුෂ්මතුනි, එහිදී ඔබ එම නරක විවාද මුල දුරු කිරීමට උත්සාහ කළ යුතුය. ආයුෂ්මතුනි, ඔබ තුළ හෝ පිටත මෙවැනි විවාදයක මුලක් නොදුටුවොත්, ආයුෂ්මතුනි, එහිදී ඔබ එම නරක විවාද මුල නැවත ඇතිවීම වැළැක්වීමට පිළිපැදිය යුතුය. මෙලෙස එම නරක විවාද මුල දුරු කිරීම සිදුවේ. මෙලෙස එම නරක විවාද මුල නැවත ඇතිවීම වැළැක්වීම සිදුවේ.\n\nධාතු සයකි. එනම්, පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව, ආකාශ ධාතුව, විඤ්ඤාණ ධාතුවයි.",
      "paliTitle": ""
    },
    {
      "number": 326,
      "pali": "‘‘Cha nissaraṇiyā dhātuyo. Idhāvuso, bhikkhu evaṃ vadeyya – ‘mettā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā, atha ca pana me byāpādo cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā hevaṃ’, tissa vacanīyo, ‘māyasmā evaṃ avaca, mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso, yaṃ mettāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya. Atha ca panassa byāpādo cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇaṃ hetaṃ, āvuso, byāpādassa, yadidaṃ mettā cetovimuttī’ti. ‘‘Idha panāvuso, bhikkhu evaṃ vadeyya – ‘karuṇā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Atha ca pana me vihesā cittaṃ pariyādāya tiṭṭhatī’ti, so ‘mā hevaṃ’ tissa vacanīyo ‘māyasmā evaṃ avaca, mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ āvuso, anavakāso, yaṃ karuṇāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya, atha ca panassa vihesā cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇaṃ hetaṃ, āvuso, vihesāya, yadidaṃ karuṇā cetovimuttī’ti. ‘‘Idha panāvuso, bhikkhu evaṃ vadeyya – ‘muditā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Atha ca pana me arati cittaṃ pariyādāya tiṭṭhatī’ti, so ‘mā hevaṃ’ tissa vacanīyo ‘‘māyasmā evaṃ avaca, mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso, yaṃ muditāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya, atha ca panassa arati cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇaṃ hetaṃ, āvuso, aratiyā, yadidaṃ muditā cetovimuttī’ti. ‘‘Idha panāvuso, bhikkhu evaṃ vadeyya – ‘upekkhā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Atha ca pana me rāgo cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā hevaṃ’ tissa vacanīyo ‘māyasmā evaṃ avaca, mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso, yaṃ upekkhāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya, atha ca panassa rāgo cittaṃ pariyādāya ṭhassati netaṃ ṭhānaṃ vijjati. Nissaraṇaṃ hetaṃ, āvuso, rāgassa, yadidaṃ upekkhā cetovimuttī’ti. ‘‘Idha panāvuso, bhikkhu evaṃ vadeyya – ‘animittā hi kho me cetovimutti bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Atha ca pana me nimittānusāri viññāṇaṃ hotī’ti. So ‘mā hevaṃ’ tissa vacanīyo ‘māyasmā evaṃ avaca, mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso, yaṃ animittāya cetovimuttiyā bhāvitāya bahulīkatāya yānīkatāya vatthukatāya anuṭṭhitāya paricitāya susamāraddhāya, atha ca panassa nimittānusāri viññāṇaṃ bhavissati, netaṃ ṭhānaṃ vijjati. Nissaraṇaṃ hetaṃ, āvuso, sabbanimittānaṃ, yadidaṃ animittā cetovimuttī’ti. ‘‘Idha panāvuso, bhikkhu evaṃ vadeyya – ‘asmīti kho me vigataṃ [vighātaṃ (sī. pī.), vigate (syā. ka.)], ayamahamasmīti na samanupassāmi, atha ca pana me vicikicchākathaṅkathāsallaṃ cittaṃ pariyādāya tiṭṭhatī’ti. So ‘mā hevaṃ’ tissa vacanīyo ‘māyasmā evaṃ avaca, mā bhagavantaṃ abbhācikkhi, na hi sādhu bhagavato abbhakkhānaṃ, na hi bhagavā evaṃ vadeyya. Aṭṭhānametaṃ, āvuso, anavakāso, yaṃ asmīti vigate [vighāte (sī. pī.)] ayamahamasmīti asamanupassato, atha ca panassa vicikicchākathaṅkathāsallaṃ cittaṃ pariyādāya ṭhassati, netaṃ ṭhānaṃ vijjati. Nissaraṇaṃ hetaṃ, āvuso, vicikicchākathaṅkathāsallassa, yadidaṃ asmimānasamugghāto’ti.",
      "english": "\"There are these six kinds of deliverance. Here, a bhikkhu might say this: ‘Indeed, I have cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken the liberation of mind by loving-kindness, and yet ill will still overwhelms my mind and remains.’ He should be told, ‘Friend, do not say this. Do not speak this way about the Blessed One. It is not good to misrepresent the Blessed One, for the Blessed One would not say such a thing. This is impossible, there is no chance that when the liberation of mind by loving-kindness has been cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken, ill will would overwhelm his mind and remain. Such a thing cannot be. This is the deliverance from ill will, that is, the liberation of mind by loving-kindness.’\n\n\"Again, a bhikkhu might say this: ‘Indeed, I have cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken the liberation of mind by compassion, and yet harming still overwhelms my mind and remains.’ He should be told, ‘Friend, do not say this. Do not speak this way about the Blessed One. It is not good to misrepresent the Blessed One, for the Blessed One would not say such a thing. This is impossible, there is no chance that when the liberation of mind by compassion has been cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken, harming would overwhelm his mind and remain. Such a thing cannot be. This is the deliverance from harming, that is, the liberation of mind by compassion.’\n\n\"Again, a bhikkhu might say this: ‘Indeed, I have cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken the liberation of mind by gladness, and yet discontent still overwhelms my mind and remains.’ He should be told, ‘Friend, do not say this. Do not speak this way about the Blessed One. It is not good to misrepresent the Blessed One, for the Blessed One would not say such a thing. This is impossible, there is no chance that when the liberation of mind by gladness has been cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken, discontent would overwhelm his mind and remain. Such a thing cannot be. This is the deliverance from discontent, that is, the liberation of mind by gladness.’\n\n\"Again, a bhikkhu might say this: ‘Indeed, I have cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken the liberation of mind by equanimity, and yet lust still overwhelms my mind and remains.’ He should be told, ‘Friend, do not say this. Do not speak this way about the Blessed One. It is not good to misrepresent the Blessed One, for the Blessed One would not say such a thing. This is impossible, there is no chance that when the liberation of mind by equanimity has been cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken, lust would overwhelm his mind and remain. Such a thing cannot be. This is the deliverance from lust, that is, the liberation of mind by equanimity.’\n\n\"Again, a bhikkhu might say this: ‘Indeed, I have cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken the signless liberation of mind, and yet consciousness still follows after signs.’ He should be told, ‘Friend, do not say this. Do not speak this way about the Blessed One. It is not good to misrepresent the Blessed One, for the Blessed One would not say such a thing. This is impossible, there is no chance that when the signless liberation of mind has been cultivated, developed, pursued, established as a base, maintained, thoroughly practiced, and properly undertaken, consciousness would still follow after signs. Such a thing cannot be. This is the deliverance from all signs, that is, the signless liberation of mind.’\n\n\"Again, a bhikkhu might say this: ‘Indeed, the thought “I am” is gone for me, and I do not regard “this I am,” and yet doubt, perplexity, and the dart of uncertainty still overwhelm my mind and remain.’ He should be told, ‘Friend, do not say this. Do not speak this way about the Blessed One. It is not good to misrepresent the Blessed One, for the Blessed One would not say such a thing. This is impossible, there is no chance that when the thought “I am” is gone and one does not regard “this I am,” doubt, perplexity, and the dart of uncertainty would overwhelm his mind and remain. Such a thing cannot be. This is the deliverance from doubt, perplexity, and the dart of uncertainty, that is, the uprooting of the conceit, “I am.”’\"",
      "sinhala": "‘‘නිස්සරණීය ධාතු හයක් ඇත. ඇවැත්නි, මෙහි භික්ෂුවක් මෙසේ කියන්නේ නම්, ‘මා විසින් මෛත්‍රී සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දී, බහුල කරන ලද්දී, යානාවක් මෙන් කරන ලද්දී, පදනමක් මෙන් කරන ලද්දී, මැනවින් පිහිටුවන ලද්දී, හුරු කරන ලද්දී, මැනවින් අරඹන ලද්දී වේ. එසේ වුවද ක්‍රෝධය මාගේ සිත වසාගෙන සිටියි’ කියා නම්, ඔහුට ‘එසේ නොකියන්න’ යැයි කිව යුතුයි. ‘ඔබ එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අගෞරව නොකරන්න. භාග්‍යවතුන් වහන්සේට අගෞරව කිරීම යහපත් නොවේ. භාග්‍යවතුන් වහන්සේ එසේ නොපවසන සේක. ඇවැත්නි, මෙය විය නොහැකි දෙයකි. මෛත්‍රී සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දා වූ, බහුල කරන ලද්දා වූ, යානාවක් මෙන් කරන ලද්දා වූ, පදනමක් මෙන් කරන ලද්දා වූ, මැනවින් පිහිටුවන ලද්දා වූ, හුරු කරන ලද්දා වූ, මැනවින් අරඹන ලද්දා වූ කෙනෙකුගේ සිත ක්‍රෝධයෙන් වසාගෙන සිටිය නොහැකිය. එය එසේ විය නොහැකිය. ඇවැත්නි, ක්‍රෝධයෙන් මිදීමට ඇති මාර්ගය නම් මෛත්‍රී සහගත සිතින් යුත් විමුක්තියයි.’\n\n‘‘තවද ඇවැත්නි, මෙහි භික්ෂුවක් මෙසේ කියන්නේ නම්, ‘මා විසින් කරුණා සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දී, බහුල කරන ලද්දී, යානාවක් මෙන් කරන ලද්දී, පදනමක් මෙන් කරන ලද්දී, මැනවින් පිහිටුවන ලද්දී, හුරු කරන ලද්දී, මැනවින් අරඹන ලද්දී වේ. එසේ වුවද විහිංසාව මාගේ සිත වසාගෙන සිටියි’ කියා නම්, ඔහුට ‘එසේ නොකියන්න’ යැයි කිව යුතුයි. ‘ඔබ එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අගෞරව නොකරන්න. භාග්‍යවතුන් වහන්සේට අගෞරව කිරීම යහපත් නොවේ. භාග්‍යවතුන් වහන්සේ එසේ නොපවසන සේක. ඇවැත්නි, මෙය විය නොහැකි දෙයකි. කරුණා සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දා වූ, බහුල කරන ලද්දා වූ, යානාවක් මෙන් කරන ලද්දා වූ, පදනමක් මෙන් කරන ලද්දා වූ, මැනවින් පිහිටුවන ලද්දා වූ, හුරු කරන ලද්දා වූ, මැනවින් අරඹන ලද්දා වූ කෙනෙකුගේ සිත විහිංසාවෙන් වසාගෙන සිටිය නොහැකිය. එය එසේ විය නොහැකිය. ඇවැත්නි, විහිංසාවෙන් මිදීමට ඇති මාර්ගය නම් කරුණා සහගත සිතින් යුත් විමුක්තියයි.’\n\n‘‘තවද ඇවැත්නි, මෙහි භික්ෂුවක් මෙසේ කියන්නේ නම්, ‘මා විසින් මුදිතා සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දී, බහුල කරන ලද්දී, යානාවක් මෙන් කරන ලද්දී, පදනමක් මෙන් කරන ලද්දී, මැනවින් පිහිටුවන ලද්දී, හුරු කරන ලද්දී, මැනවින් අරඹන ලද්දී වේ. එසේ වුවද අරතිය මාගේ සිත වසාගෙන සිටියි’ කියා නම්, ඔහුට ‘එසේ නොකියන්න’ යැයි කිව යුතුයි. ‘ඔබ එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අගෞරව නොකරන්න. භාග්‍යවතුන් වහන්සේට අගෞරව කිරීම යහපත් නොවේ. භාග්‍යවතුන් වහන්සේ එසේ නොපවසන සේක. ඇවැත්නි, මෙය විය නොහැකි දෙයකි. මුදිතා සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දා වූ, බහුල කරන ලද්දා වූ, යානාවක් මෙන් කරන ලද්දා වූ, පදනමක් මෙන් කරන ලද්දා වූ, මැනවින් පිහිටුවන ලද්දා වූ, හුරු කරන ලද්දා වූ, මැනවින් අරඹන ලද්දා වූ කෙනෙකුගේ සිත අරතියෙන් වසාගෙන සිටිය නොහැකිය. එය එසේ විය නොහැකිය. ඇවැත්නි, අරතියෙන් මිදීමට ඇති මාර්ගය නම් මුදිතා සහගත සිතින් යුත් විමුක්තියයි.’\n\n‘‘තවද ඇවැත්නි, මෙහි භික්ෂුවක් මෙසේ කියන්නේ නම්, ‘මා විසින් උපේක්ෂා සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දී, බහුල කරන ලද්දී, යානාවක් මෙන් කරන ලද්දී, පදනමක් මෙන් කරන ලද්දී, මැනවින් පිහිටුවන ලද්දී, හුරු කරන ලද්දී, මැනවින් අරඹන ලද්දී වේ. එසේ වුවද රාගය මාගේ සිත වසාගෙන සිටියි’ කියා නම්, ඔහුට ‘එසේ නොකියන්න’ යැයි කිව යුතුයි. ‘ඔබ එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අගෞරව නොකරන්න. භාග්‍යවතුන් වහන්සේට අගෞරව කිරීම යහපත් නොවේ. භාග්‍යවතුන් වහන්සේ එසේ නොපවසන සේක. ඇවැත්නි, මෙය විය නොහැකි දෙයකි. උපේක්ෂා සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දා වූ, බහුල කරන ලද්දා වූ, යානාවක් මෙන් කරන ලද්දා වූ, පදනමක් මෙන් කරන ලද්දා වූ, මැනවින් පිහිටුවන ලද්දා වූ, හුරු කරන ලද්දා වූ, මැනවින් අරඹන ලද්දා වූ කෙනෙකුගේ සිත රාගයෙන් වසාගෙන සිටිය නොහැකිය. එය එසේ විය නොහැකිය. ඇවැත්නි, රාගයෙන් මිදීමට ඇති මාර්ගය නම් උපේක්ෂා සහගත සිතින් යුත් විමුක්තියයි.’\n\n‘‘තවද ඇවැත්නි, මෙහි භික්ෂුවක් මෙසේ කියන්නේ නම්, ‘මා විසින් අනිමිත්ත සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දී, බහුල කරන ලද්දී, යානාවක් මෙන් කරන ලද්දී, පදනමක් මෙන් කරන ලද්දී, මැනවින් පිහිටුවන ලද්දී, හුරු කරන ලද්දී, මැනවින් අරඹන ලද්දී වේ. එසේ වුවද මාගේ විඤ්ඤාණය නිමිති අනුව යයි’ කියා නම්, ඔහුට ‘එසේ නොකියන්න’ යැයි කිව යුතුයි. ‘ඔබ එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අගෞරව නොකරන්න. භාග්‍යවතුන් වහන්සේට අගෞරව කිරීම යහපත් නොවේ. භාග්‍යවතුන් වහන්සේ එසේ නොපවසන සේක. ඇවැත්නි, මෙය විය නොහැකි දෙයකි. අනිමිත්ත සහගත සිතින් යුත් විමුක්තිය වඩන ලද්දා වූ, බහුල කරන ලද්දා වූ, යානාවක් මෙන් කරන ලද්දා වූ, පදනමක් මෙන් කරන ලද්දා වූ, මැනවින් පිහිටුවන ලද්දා වූ, හුරු කරන ලද්දා වූ, මැනවින් අරඹන ලද්දා වූ කෙනෙකුගේ විඤ්ඤාණය නිමිති අනුව යාම සිදු විය නොහැකිය. එය එසේ විය නොහැකිය. ඇවැත්නි, සියලු නිමිති වලින් මිදීමට ඇති මාර්ගය නම් අනිමිත්ත සහගත සිතින් යුත් විමුක්තියයි.’\n\n‘‘තවද ඇවැත්නි, මෙහි භික්ෂුවක් මෙසේ කියන්නේ නම්, ‘මාගේ ‘අස්මි’ යන හැඟීම දුරු විය. ‘මම වෙමි’ යැයි මම නොසලකමි. එසේ වුවද විචිකිච්ඡාව, කුකුස, සැකය මාගේ සිත වසාගෙන සිටියි’ කියා නම්, ඔහුට ‘එසේ නොකියන්න’ යැයි කිව යුතුයි. ‘ඔබ එසේ නොකියන්න. භාග්‍යවතුන් වහන්සේට අගෞරව නොකරන්න. භාග්‍යවතුන් වහන්සේට අගෞරව කිරීම යහපත් නොවේ. භාග්‍යවතුන් වහන්සේ එසේ නොපවසන සේක. ඇවැත්නි, මෙය විය නොහැකි දෙයකි. ‘මම වෙමි’ යන හැඟීම දුරු වූ, ‘මම වෙමි’ යැයි නොසලකන කෙනෙකුගේ සිත විචිකිච්ඡාව, කුකුස, සැකය වසාගෙන සිටීම සිදු විය නොහැකිය. එය එසේ විය නොහැකිය. ඇවැත්නි, විචිකිච්ඡාව, කුකුස, සැකයෙන් මිදීමට ඇති මාර්ගය නම් අස්මිමානය නැති කිරීමයි.’",
      "paliTitle": ""
    },
    {
      "number": 327,
      "pali": "‘‘Cha anuttariyāni – dassanānuttariyaṃ, savanānuttariyaṃ, lābhānuttariyaṃ, sikkhānuttariyaṃ, pāricariyānuttariyaṃ, anussatānuttariyaṃ. ‘‘Cha anussatiṭṭhānāni – buddhānussati, dhammānussati, saṅghānussati, sīlānussati, cāgānussati, devatānussati.",
      "english": "There are six unsurpassed things: unsurpassed seeing, unsurpassed hearing, unsurpassed gain, unsurpassed training, unsurpassed attendance, and unsurpassed recollection.\n\nThere are six objects of recollection: recollection of the Buddha, recollection of the Dhamma, recollection of the Saṅgha, recollection of virtue, recollection of generosity, and recollection of the deities.",
      "sinhala": "‘‘අනුත්තරීය හයක් නම් – දර්ශනානුත්තරීය, ශ්‍රවණානුත්තරීය, ලාභානුත්තරීය, සික්ඛානුත්තරීය, පාරිචරියානුත්තරීය, අනුස්සතානුත්තරීය යන ඒවායි.\n\nඅනුස්සතිට්ඨාන හයක් නම් – බුද්ධානුස්සති, ධම්මානුස්සති, සංඝානුස්සති, සීලානුස්සති, චාගානුස්සති, දේවතානුස්සති යන ඒවායි.",
      "paliTitle": ""
    },
    {
      "number": 328,
      "pali": "‘‘Cha satatavihārā. Idhāvuso, bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako [upekkhako ca (syā. ka.)] viharati sato sampajāno. Sotena saddaṃ sutvā…pe… manasā dhammaṃ viññāya neva sumano hoti na dummano, upekkhako viharati sato sampajāno.",
      "english": "Six constant abodes. Here, friend, a bhikkhu, seeing a form with the eye, is neither glad nor sad, but dwells with equanimity, mindful and fully aware. Hearing a sound with the ear… mentally cognizing a phenomenon… is neither glad nor sad, but dwells with equanimity, mindful and fully aware.",
      "sinhala": "‘‘සතතා විහරණ හයකි. ඇවැත්නි, මෙහි භික්ෂුව ඇසින් රූපයක් දැක සතුටු වන්නේ ද නැත, නො සතුටු වන්නේ ද නැත, සිහි ඇතිව නුවණින් යුක්තව උපේක්ෂා සහගතව වාසය කරයි. කනින් ශබ්දයක් අසා...මනසින් ධර්මයක් දැන සතුටු වන්නේ ද නැත, නො සතුටු වන්නේ ද නැත, සිහි ඇතිව නුවණින් යුක්තව උපේක්ෂා සහගතව වාසය කරයි.",
      "paliTitle": ""
    },
    {
      "number": 329,
      "pali": "‘‘Chaḷābhijātiyo. Idhāvuso, ekacco kaṇhābhijātiko samāno kaṇhaṃ dhammaṃ abhijāyati. Idha panāvuso, ekacco kaṇhābhijātiko samāno sukkaṃ dhammaṃ abhijāyati. Idha panāvuso, ekacco kaṇhābhijātiko samāno akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati. Idha panāvuso, ekacco sukkābhijātiko samāno sukkaṃ dhammaṃ abhijāyati. Idha panāvuso, ekacco sukkābhijātiko samāno kaṇhaṃ dhammaṃ abhijāyati. Idha panāvuso, ekacco sukkābhijātiko samāno akaṇhaṃ asukkaṃ nibbānaṃ abhijāyati. ‘‘Cha nibbedhabhāgiyā saññā [nibbedhabhāgiyasaññā (syā. kaṃ.)] – aniccasaññā anicce, dukkhasaññā dukkhe, anattasaññā, pahānasaññā, virāgasaññā, nirodhasaññā. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena cha dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. ",
      "english": "\"There are these six kinds of birth. Here, friend, someone of dark birth realizes a dark teaching. Again, friend, someone of dark birth realizes a bright teaching. Again, friend, someone of dark birth realizes the neither-dark-nor-bright Nibbana. Again, friend, someone of bright birth realizes a bright teaching. Again, friend, someone of bright birth realizes a dark teaching. Again, friend, someone of bright birth realizes the neither-dark-nor-bright Nibbana.\"\n\n\"There are these six perceptions conducive to penetration: the perception of impermanence regarding what is impermanent, the perception of suffering regarding what is suffering, the perception of non-self, the perception of abandoning, the perception of detachment, and the perception of cessation.\"\n\n\"These six things, friend, are well-proclaimed by that Blessed One, who knows, sees, the worthy one, the rightly self-awakened one; about which all should recite together… for the benefit, welfare, and happiness of gods and humans.\"",
      "sinhala": "‘‘ආවුසෝ, අභිජාති හයක් (6) වෙති. ආවුසෝ, මෙලොව ඇතැම් කෙනෙක් කළු අභිජාතිය ඇත්තාහු කළු දහම අවබෝධ කරති. ආවුසෝ, තවද මෙලොව ඇතැම් කෙනෙක් කළු අභිජාතිය ඇත්තාහු සුදු දහම අවබෝධ කරති. ආවුසෝ, තවද මෙලොව ඇතැම් කෙනෙක් කළු අභිජාතිය ඇත්තාහු කළුත් නොවූ සුදුත් නොවූ නිර්වාණය අවබෝධ කරති. ආවුසෝ, තවද මෙලොව ඇතැම් කෙනෙක් සුදු අභිජාතිය ඇත්තාහු සුදු දහම අවබෝධ කරති. ආවුසෝ, තවද මෙලොව ඇතැම් කෙනෙක් සුදු අභිජාතිය ඇත්තාහු කළු දහම අවබෝධ කරති. ආවුසෝ, තවද මෙලොව ඇතැම් කෙනෙක් සුදු අභිජාතිය ඇත්තාහු කළුත් නොවූ සුදුත් නොවූ නිර්වාණය අවබෝධ කරති.\n\n‘‘ක්ෂය කිරීම පිණිස පවත්නා සංඥා හයක් (6) වෙති. එනම්, අනිත්‍ය සංඥාව, දුක්ඛ සංඥාව දුක්ඛෙයෙහි, අනත්ත සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව, නිරෝධ සංඥාව යන ඒවායි.\n\n‘‘ආවුසෝ, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මේ ධර්ම හය මනාව දේශනා කරන ලදී. එහිදී සියල්ලන් විසින් ම එක්ව ගායනා කළ යුතුය. දෙවියන්ට සහ මිනිසුන්ට යහපත පිණිස, හිත පිණිස, සැප පිණිස (එය කළ යුතුය).",
      "paliTitle": ""
    },
    {
      "number": 330,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena satta dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Katame satta? ‘‘Satta ariyadhanāni – saddhādhanaṃ, sīladhanaṃ, hiridhanaṃ, ottappadhanaṃ, sutadhanaṃ, cāgadhanaṃ, paññādhanaṃ. ‘‘Satta bojjhaṅgā – satisambojjhaṅgo, dhammavicayasambojjhaṅgo, vīriyasambojjhaṅgo, pītisambojjhaṅgo, passaddhisambojjhaṅgo, samādhisambojjhaṅgo, upekkhāsambojjhaṅgo. ‘‘Satta samādhiparikkhārā – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati. ‘‘Satta asaddhammā – idhāvuso, bhikkhu assaddho hoti, ahiriko hoti, anottappī hoti, appassuto hoti, kusīto hoti, muṭṭhassati hoti, duppañño hoti. ‘‘Satta saddhammā – idhāvuso, bhikkhu saddho hoti, hirimā hoti, ottappī hoti, bahussuto hoti, āraddhavīriyo hoti, upaṭṭhitassati hoti, paññavā hoti. ‘‘Satta sappurisadhammā – idhāvuso, bhikkhu dhammaññū ca hoti atthaññū ca attaññū ca mattaññū ca kālaññū ca parisaññū ca puggalaññū ca.",
      "english": "\"Reverends, there are seven qualities well-proclaimed by that Blessed One, who knows, who sees, the worthy one, the rightly self-awakened one; all of which should be recited together… for the benefit, welfare, and happiness of gods and humans. What are the seven? Seven Noble Treasures: the treasure of faith, the treasure of virtue, the treasure of conscience, the treasure of concern, the treasure of learning, the treasure of generosity, the treasure of wisdom. Seven Factors of Enlightenment: mindfulness as a factor of enlightenment, investigation of phenomena as a factor of enlightenment, energy as a factor of enlightenment, rapture as a factor of enlightenment, tranquility as a factor of enlightenment, concentration as a factor of enlightenment, equanimity as a factor of enlightenment. Seven accessories to concentration: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness. Seven ignoble qualities: here, reverends, a bhikkhu is without faith, without conscience, without concern, with little learning, lazy, with confused mindfulness, unwise. Seven noble qualities: here, reverends, a bhikkhu has faith, has conscience, has concern, is very learned, with aroused energy, with established mindfulness, wise. Seven qualities of a true person: here, reverends, a bhikkhu understands the Dhamma, understands the meaning, understands himself, understands moderation, understands the proper time, understands the assembly, understands individuals.\"",
      "sinhala": "‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් සප්ත ධර්මයන් මැනවින් දේශනා කරන ලදී. එහි සියල්ලෝම එක්ව ගායනා කළ යුතුය. ඒ දෙවියන් හා මිනිසුන්ගේ අර්ථය පිණිස, හිතසුව පිණිස පවතී. කවර සප්තයක් ද යත්;\n\n‘‘සප්ත ආර්ය ධනයෝ නම්: ශ්‍රද්ධා ධනය, සීල ධනය, හිරි ධනය, ඔත්තප්ප ධනය, ශ්‍රැත ධනය, ත්‍යාග ධනය, ප්‍රඥා ධනය යනුයි.\n\n‘‘සප්ත බොජ්ඣංගාවයව නම්: සති සම්බොජ්ඣංගය, ධම්මවිචය සම්බොජ්ඣංගය, වීර්ය සම්බොජ්ඣංගය, ප්‍රීති සම්බොජ්ඣංගය, ප්‍රශ්‍රබ්ධි සම්බොජ්ඣංගය, සමාධි සම්බොජ්ඣංගය, උපේක්ෂා සම්බොජ්ඣංගය යනුයි.\n\n‘‘සප්ත සමාධි පରିක්ඛාර නම්: සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති යනුයි.\n\n‘‘සප්ත අසද්ධර්මයෝ නම්: ඇවැත්නි, මෙහි භික්ෂුව අශ්‍රද්ධාවන්ත වෙයි, අහිරිමත් වෙයි, අනොත්තප්පී වෙයි, අલ્પශ්‍රැත වෙයි, කුසීත වෙයි, මුඪ වූ සිහි ඇත්තේ වෙයි, දුර්වල ප්‍රඥා ඇත්තේ වෙයි.\n\n‘‘සප්ත සද්ධර්මයෝ නම්: ඇවැත්නි, මෙහි භික්ෂුව ශ්‍රද්ධාවන්ත වෙයි, හිරි ඇත්තේ වෙයි, ඔත්තප්පී වෙයි, බහුශ්‍රැත වෙයි, ආරබ්ධ වීර්ය ඇත්තේ වෙයි, එළඹ සිටි සිහි ඇත්තේ වෙයි, ප්‍රඥාවන්ත වෙයි.\n\n‘‘සප්ත සත්පුරුෂ ධර්මයෝ නම්: ඇවැත්නි, මෙහි භික්ෂුව ධර්මය දන්නා සුලු වෙයි, අර්ථය දන්නා සුලු වෙයි, තමා දන්නා සුලු වෙයි, පමණ දන්නා සුලු වෙයි, කාලය දන්නා සුලු වෙයි, පිරිස දන්නා සුලු වෙයි, පුද්ගලයන් දන්නා සුලු වෙයි.",
      "paliTitle": "Sattakaṃ",
      "englishTitle": "The Chapter of Sevens",
      "sinhalaTitle": "සප්තකය"
    },
    {
      "number": 331,
      "pali": "‘‘Satta niddasavatthūni. Idhāvuso, bhikkhu sikkhāsamādāne tibbacchando hoti, āyatiñca sikkhāsamādāne avigatapemo. Dhammanisantiyā tibbacchando hoti, āyatiñca dhammanisantiyā avigatapemo. Icchāvinaye tibbacchando hoti, āyatiñca icchāvinaye avigatapemo. Paṭisallāne tibbacchando hoti, āyatiñca paṭisallāne avigatapemo. Vīriyārambhe tibbacchando hoti, āyatiñca vīriyārambhe avigatapemo. Satinepakke tibbacchando hoti, āyatiñca satinepakke avigatapemo. Diṭṭhipaṭivedhe tibbacchando hoti, āyatiñca diṭṭhipaṭivedhe avigatapemo. ‘‘Satta saññā – aniccasaññā, anattasaññā, asubhasaññā, ādīnavasaññā, pahānasaññā, virāgasaññā, nirodhasaññā. ‘‘Satta balāni – saddhābalaṃ, vīriyabalaṃ, hiribalaṃ, ottappabalaṃ, satibalaṃ, samādhibalaṃ, paññābalaṃ.",
      "english": "\"Seven grounds for indication: Here, a bhikkhu has intense enthusiasm for undertaking the training, and unwavering affection for undertaking the training in the future. He has intense enthusiasm for contentment with the Dhamma, and unwavering affection for contentment with the Dhamma in the future. He has intense enthusiasm for the abandoning of desires, and unwavering affection for the abandoning of desires in the future. He has intense enthusiasm for seclusion, and unwavering affection for seclusion in the future. He has intense enthusiasm for the instigation of effort, and unwavering affection for the instigation of effort in the future. He has intense enthusiasm for mindfulness and skill, and unwavering affection for mindfulness and skill in the future. He has intense enthusiasm for the penetration of views, and unwavering affection for the penetration of views in the future.\n\n\"Seven perceptions: the perception of impermanence, the perception of not-self, the perception of unattractiveness, the perception of danger, the perception of abandoning, the perception of dispassion, and the perception of cessation.\n\n\"Seven powers: the power of faith, the power of energy, the power of moral shame, the power of fear of wrongdoing, the power of mindfulness, the power of concentration, and the power of wisdom.\"",
      "sinhala": "‘‘අවස්සො, සත්ත්‍ව නිද්දසවත්‍ථූනි. ඇවැත්නි, මෙහි භික්‍ෂුව ශික්‍ෂා සමාදානයේ දැඩි කැමැත්තක්‌ ඇත්තේ වෙයි. ඉදිරියටත් ශික්‍ෂා සමාදානයේ පහ නොවූ ප්‍රේමයක් ඇත්තේ වෙයි. ධම්මානුසන්‍ධියේ දැඩි කැමැත්තක් ඇත්තේ වෙයි. ඉදිරියටත් ධම්මානුසන්‍ධියේ පහ නොවූ ප්‍රේමයක් ඇත්තේ වෙයි. ඉච්ඡාවිනයෙහි දැඩි කැමැත්තක් ඇත්තේ වෙයි. ඉදිරියටත් ඉච්ඡාවිනයෙහි පහ නොවූ ප්‍රේමයක් ඇත්තේ වෙයි. පටිසල්ලානයේ දැඩි කැමැත්තක් ඇත්තේ වෙයි. ඉදිරියටත් පටිසල්ලානයේ පහ නොවූ ප්‍රේමයක් ඇත්තේ වෙයි. විරියාරම්භයෙහි දැඩි කැමැත්තක් ඇත්තේ වෙයි. ඉදිරියටත් විරියාරම්භයෙහි පහ නොවූ ප්‍රේමයක් ඇත්තේ වෙයි. සති නෙපක්කයේ දැඩි කැමැත්තක් ඇත්තේ වෙයි. ඉදිරියටත් සති නෙපක්කයේ පහ නොවූ ප්‍රේමයක් ඇත්තේ වෙයි. දිට්ඨිපටිවේධයෙහි දැඩි කැමැත්තක් ඇත්තේ වෙයි. ඉදිරියටත් දිට්ඨිපටිවේධයෙහි පහ නොවූ ප්‍රේමයක් ඇත්තේ වෙයි.\n\n‘‘සත්ත්‍ව සංඥා – අනිච්ච සංඥාව, අනත්ථ සංඥාව, අසුභ සංඥාව, ආදීනව සංඥාව, පහන සංඥාව, විරාග සංඥාව, නිරෝධ සංඥාව වේ.\n\n‘‘සත්ත්‍ව බල – ශ්‍රද්ධා බලය, විරිය බලය, හිරි බලය, ඔත්තප්ප බලය, සති බලය, සමාධි බලය, ප්‍රඥා බලය වේ.",
      "paliTitle": ""
    },
    {
      "number": 332,
      "pali": "‘‘Satta viññāṇaṭṭhitiyo. Santāvuso, sattā nānattakāyā nānattasaññino, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Ayaṃ paṭhamā viññāṇaṭṭhiti. ‘‘Santāvuso, sattā nānattakāyā ekattasaññino seyyathāpi devā brahmakāyikā paṭhamābhinibbattā. Ayaṃ dutiyā viññāṇaṭṭhiti. ‘‘Santāvuso, sattā ekattakāyā nānattasaññino seyyathāpi devā ābhassarā. Ayaṃ tatiyā viññāṇaṭṭhiti. ‘‘Santāvuso, sattā ekattakāyā ekattasaññino seyyathāpi devā subhakiṇhā. Ayaṃ catutthī viññāṇaṭṭhiti. ‘‘Santāvuso, sattā sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanūpagā. Ayaṃ pañcamī viññāṇaṭṭhiti. ‘‘Santāvuso, sattā sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanūpagā. Ayaṃ chaṭṭhī viññāṇaṭṭhiti. ‘‘Santāvuso, sattā sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanūpagā. Ayaṃ sattamī viññāṇaṭṭhiti. ‘‘Satta puggalā dakkhiṇeyyā – ubhatobhāgavimutto, paññāvimutto, kāyasakkhi, diṭṭhippatto, saddhāvimutto, dhammānusārī, saddhānusārī. ‘‘Satta anusayā – kāmarāgānusayo, paṭighānusayo, diṭṭhānusayo, vicikicchānusayo, mānānusayo, bhavarāgānusayo, avijjānusayo. ‘‘Satta saññojanāni – anunayasaññojanaṃ [kāmasaññojanaṃ (syā. kaṃ.)], paṭighasaññojanaṃ, diṭṭhisaññojanaṃ, vicikicchāsaññojanaṃ, mānasaññojanaṃ, bhavarāgasaññojanaṃ, avijjāsaññojanaṃ. ‘‘Satta adhikaraṇasamathā – uppannuppannānaṃ adhikaraṇānaṃ samathāya vūpasamāya sammukhāvinayo dātabbo, sativinayo dātabbo, amūḷhavinayo dātabbo, paṭiññāya kāretabbaṃ, yebhuyyasikā, tassapāpiyasikā, tiṇavatthārako. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena satta dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Dutiyabhāṇavāro niṭṭhito. ",
      "english": "\"There are seven stations of consciousness. There are beings, friends, who are diverse in body and diverse in perception, such as human beings, some gods, and some beings in states of woe. This is the first station of consciousness.\n\n\"There are beings, friends, who are diverse in body but unified in perception, such as the gods of Brahmā's realm who are newly born. This is the second station of consciousness.\n\n\"There are beings, friends, who are unified in body but diverse in perception, such as the gods of streaming radiance. This is the third station of consciousness.\n\n\"There are beings, friends, who are unified in body and unified in perception, such as the gods replete with glory. This is the fourth station of consciousness.\n\n\"There are beings, friends, who, with the complete surmounting of perceptions of form, with the passing away of perceptions of sensory impingement, not attending to perceptions of diversity, thinking, 'Infinite is space,' reach the dimension of infinite space. This is the fifth station of consciousness.\n\n\"There are beings, friends, who, with the complete surmounting of the dimension of infinite space, thinking, 'Infinite is consciousness,' reach the dimension of infinite consciousness. This is the sixth station of consciousness.\n\n\"There are beings, friends, who, with the complete surmounting of the dimension of infinite consciousness, thinking, 'There is nothing,' reach the dimension of nothingness. This is the seventh station of consciousness.\n\n\"There are seven types of individuals worthy of offerings: one freed in both ways, one freed by wisdom, one who is a body-witness, one attained to view, one freed by faith, one who follows the Dhamma, and one who follows faith.\n\n\"There are seven underlying tendencies: the underlying tendency to sensual lust, the underlying tendency to aversion, the underlying tendency to views, the underlying tendency to doubt, the underlying tendency to conceit, the underlying tendency to craving for existence, and the underlying tendency to ignorance.\n\n\"There are seven fetters: the fetter of resentment, the fetter of aversion, the fetter of views, the fetter of doubt, the fetter of conceit, the fetter of craving for existence, and the fetter of ignorance.\n\n\"There are seven ways of settling legal questions: the principle of settling disputes in the presence of the community, the principle of recollection, the principle of past insanity, the principle of acknowledgment of the offense, the decision by majority, the decision based on the offender's own misdeeds, and the covering over procedure.\n\n\"These, friends, are the seven things well proclaimed by that Blessed One who knows, who sees, the worthy one, the rightly self-awakened one; all should sing them together there…for the benefit, welfare, and happiness of gods and humans.\"\n\nThe second recitation section is finished.",
      "sinhala": "‘‘සත්ත විඤ්ඤාණට්ඨිති යෝ. ඇවැත්නි, නානාත්‍ව කයින් හා නානාත්‍ව සංඥාවන්ගෙන් යුත් සත්ත්වයෝ සිටිත්. එනම් මිනිසුන් ද, ඇතැම් දෙවියන් ද, ඇතැම් විනිපාතිකයන් ද වෙති. මෙය පළමු විඤ්ඤාණට්ඨිති යි. ‘‘ඇවැත්නි, නානාත්‍ව කයින් යුත්, ඒකාත්‍ව සංඥාවන්ගෙන් යුත් සත්ත්වයෝ සිටිත්. එනම් බ්‍රහ්මකායික දෙවියෝ යම් සේ ද, පළමුව උපන් අය යම් සේ ද එසෙයි. මෙය දෙවැනි විඤ්ඤාණට්ඨිති යි. ‘‘ඇවැත්නි, ඒකාත්‍ව කයින් යුත්, නානාත්‍ව සංඥාවන්ගෙන් යුත් සත්ත්වයෝ සිටිත්. එනම් ආභස්සර දෙවියෝ යම් සේ ද එසෙයි. මෙය තෙවැනි විඤ්ඤාණට්ඨිති යි. ‘‘ඇවැත්නි, ඒකාත්‍ව කයින් යුත්, ඒකාත්‍ව සංඥාවන්ගෙන් යුත් සත්ත්වයෝ සිටිත්. එනම් සුභකිණ්හ දෙවියෝ යම් සේ ද එසෙයි. මෙය සිව්වැනි විඤ්ඤාණට්ඨිති යි. ‘‘ඇවැත්නි, සියලු ආකාරයෙන් රූප සංඥාවන් ඉක්මවා, පටිඝ සංඥාවන්ගේ අස්තංගමනයෙන්, නානාත්‍ව සංඥාවන් මෙනෙහි නොකර ‘අනන්ත වූ ආකාශය’ යැයි ආකාශානඤ්චායතනයට පැමිණි සත්ත්වයෝ සිටිත්. මෙය පස්වැනි විඤ්ඤාණට්ඨිති යි. ‘‘ඇවැත්නි, සියලු ආකාරයෙන් ආකාශානඤ්චායතනය ඉක්මවා ‘අනන්ත වූ විඤ්ඤාණය’ යැයි විඤ්ඤාණඤ්චායතනයට පැමිණි සත්ත්වයෝ සිටිත්. මෙය සවැනි විඤ්ඤාණට්ඨිති යි. ‘‘ඇවැත්නි, සියලු ආකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා ‘කිසිවක් නැත’ යැයි ආකිඤ්චඤ්ඤායතනයට පැමිණි සත්ත්වයෝ සිටිත්. මෙය සත්වැනි විඤ්ඤාණට්ඨිති යි. ‘‘සත්පුද්ගලයෝ දක්ෂිණාවට සුදුස්සෝ වෙති. උභතෝභාග විමුක්ත, ප්‍රඥාවිමුක්ත, කාය සක්ඛි, දිට්ඨිප්පත්ත, සද්ධා විමුක්ත, ධම්මානුසාරී, සද්ධානුසාරී යන මොවුහු ය. ‘‘සත් අනුසයෝ නම්: කාමරාගානුසය, පටිඝානුසය, දිට්ඨානුසය, විචිකිච්ඡානුසය, මානානුසය, භවරಾಗානුසය, අවිජ්ජානුසය යන මොවුහු ය. ‘‘සත් සංයෝජන නම්: අනනුය සංයෝජන (කාම සංයෝජන), පටිඝ සංයෝජන, දිට්ඨි සංයෝජන, විචිකිච්ඡා සංයෝජන, මාන සංයෝජන, භවරාග සංයෝජන, අවිද්‍යා සංයෝජන යන මොවුහු ය. ‘‘හටගත් හටගත් අධිකරණයන් සමථයකට පැමිණවීම පිණිස, සංසිඳවීම පිණිස සම්මුඛාවිනය දිය යුතු ය, ස්මෘති විනය දිය යුතු ය, අමූඪ විනය දිය යුතු ය, ප්‍රතිඥාවෙන් කරවට යුතු ය, යෙභුය්‍යසිකා, තස්සපාපියසිකා, තිණවත්ථාරක යන අධිකරණ සමථ සතකි. ‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මේ ධර්ම සත මැනවින් දේශනා කරන ලද්දේ ය. එහි සියල්ලෝ ම එක්ව ගායනා කළ යුතු ය. දෙව් මිනිසුන්ට අර්ථය පිණිස, හිත පිණිස, සැප පිණිස (පැවැත්විය යුතු ය). දෙවැනි භාණ වාරය නිමියේ ය.",
      "paliTitle": ""
    },
    {
      "number": 333,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena aṭṭha dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Katame aṭṭha? ‘‘Aṭṭha micchattā – micchādiṭṭhi, micchāsaṅkappo, micchāvācā, micchākammanto, micchāājīvo, micchāvāyāmo micchāsati, micchāsamādhi. ‘‘Aṭṭha sammattā – sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi. ‘‘Aṭṭha puggalā dakkhiṇeyyā – sotāpanno, sotāpattiphalasacchikiriyāya paṭipanno; sakadāgāmī, sakadāgāmiphalasacchikiriyāya paṭipanno; anāgāmī, anāgāmiphalasacchikiriyāya paṭipanno; arahā, arahattaphalasacchikiriyāya paṭipanno.",
      "english": "\"There are, friends, eight qualities well-proclaimed by that Blessed One, who knows, who sees, the worthy one, the rightly self-awakened one; which should all be chanted together...for the benefit, welfare, and happiness of gods and humans. Which eight? Eight wrongnesses: wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration. Eight rightnesses: right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration. Eight individuals worthy of offerings: one who has entered the stream, one who is practicing for the realization of the fruit of stream-entry; one who returns only once, one who is practicing for the realization of the fruit of once-returning; one who does not return, one who is practicing for the realization of the fruit of non-returning; one who is worthy, one who is practicing for the realization of the fruit of worthiness.\"",
      "sinhala": "‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් අෂ්ට ධර්ම මනාව දේශනා කරන ලදී. එහි සියල්ලෝ ම එක්ව ගායනා කළ යුතු ය… දෙව් මිනිසුන්ගේ අර්ථය පිණිස, හිත සුව පිණිස. කවර අට දෙනෙක් ද? ‘‘අෂ්ට මිථ්‍යාත්වයන් නම් – මිථ්‍යා දෘෂ්ටිය, මිථ්‍යා සංකල්පය, මිථ්‍යා වාක්‍යය, මිථ්‍යා කර්මාන්තය, මිථ්‍යා ආජීවය, මිථ්‍යා ව්‍යායාමය, මිථ්‍යා සතිය, මිථ්‍යා සමාධිය යනුයි. ‘‘අෂ්ට සම්‍යක්ත්වයන් නම් – සම්‍යක් දෘෂ්ටිය, සම්‍යක් සංකල්පය, සම්‍යක් වාක්‍යය, සම්‍යක් කර්මාන්තය, සම්‍යක් ආජීවය, සම්‍යක් ව්‍යායාමය, සම්‍යක් සතිය, සම්‍යක් සමාධිය යනුයි. ‘‘අෂ්ට පුද්ගලයෝ දක්ෂිණාවට සුදුස්සෝ වෙති – සෝතාපන්න වූවෝ ය, සෝතාපත්ති ඵල සාක්ෂාත් කිරීම පිණිස පිළිපන්න වූවෝ ය; සකෘදාගාමී වූවෝ ය, සකෘදාගාමී ඵල සාක්ෂාත් කිරීම පිණිස පිළිපන්න වූවෝ ය; අනාගාමී වූවෝ ය, අනාගාමී ඵල සාක්ෂාත් කිරීම පිණිස පිළිපන්න වූවෝ ය; අරහත් වූවෝ ය, අරහත් ඵල සාක්ෂාත් කිරීම පිණිස පිළිපන්න වූවෝ ය.",
      "paliTitle": "Aṭṭhakaṃ",
      "englishTitle": "The Octad",
      "sinhalaTitle": "අෂ්ටකය"
    },
    {
      "number": 334,
      "pali": "‘‘Aṭṭha kusītavatthūni. Idhāvuso, bhikkhunā kammaṃ kātabbaṃ hoti. Tassa evaṃ hoti – ‘kammaṃ kho me kātabbaṃ bhavissati, kammaṃ kho pana me karontassa kāyo kilamissati, handāhaṃ nipajjāmī’ti! So nipajjati na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ paṭhamaṃ kusītavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhunā kammaṃ kataṃ hoti. Tassa evaṃ hoti – ‘ahaṃ kho kammaṃ akāsiṃ, kammaṃ kho pana me karontassa kāyo kilanto, handāhaṃ nipajjāmī’ti! So nipajjati na vīriyaṃ ārabhati…pe… idaṃ dutiyaṃ kusītavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhunā maggo gantabbo hoti. Tassa evaṃ hoti – ‘maggo kho me gantabbo bhavissati, maggaṃ kho pana me gacchantassa kāyo kilamissati, handāhaṃ nipajjāmī’ti! So nipajjati na vīriyaṃ ārabhati… idaṃ tatiyaṃ kusītavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhunā maggo gato hoti. Tassa evaṃ hoti – ‘ahaṃ kho maggaṃ agamāsiṃ, maggaṃ kho pana me gacchantassa kāyo kilanto, handāhaṃ nipajjāmī’ti! So nipajjati na vīriyaṃ ārabhati… idaṃ catutthaṃ kusītavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhu gāmaṃ vā nigamaṃ vā piṇḍāya caranto na labhati lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa evaṃ hoti – ‘ahaṃ kho gāmaṃ vā nigamaṃ vā piṇḍāya caranto nālatthaṃ lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, tassa me kāyo kilanto akammañño, handāhaṃ nipajjāmī’ti! So nipajjati na vīriyaṃ ārabhati… idaṃ pañcamaṃ kusītavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhu gāmaṃ vā nigamaṃ vā piṇḍāya caranto labhati lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa evaṃ hoti – ‘ahaṃ kho gāmaṃ vā nigamaṃ vā piṇḍāya caranto alatthaṃ lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, tassa me kāyo garuko akammañño, māsācitaṃ maññe, handāhaṃ nipajjāmī’ti! So nipajjati na vīriyaṃ ārabhati… idaṃ chaṭṭhaṃ kusītavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhuno uppanno hoti appamattako ābādho. Tassa evaṃ hoti – ‘uppanno kho me ayaṃ appamattako ābādho; atthi kappo nipajjituṃ, handāhaṃ nipajjāmī’ti! So nipajjati na vīriyaṃ ārabhati… idaṃ sattamaṃ kusītavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhu gilānā vuṭṭhito [gilānavuṭṭhito (saddanīti) a. ni. 6.16 nakulapitusuttaṭīkā passitabbā] hoti aciravuṭṭhito gelaññā. Tassa evaṃ hoti – ‘ahaṃ kho gilānā vuṭṭhito aciravuṭṭhito gelaññā, tassa me kāyo dubbalo akammañño, handāhaṃ nipajjāmī’ti! So nipajjati na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ aṭṭhamaṃ kusītavatthu.",
      "english": "\"There are these eight grounds for laziness. Here, a bhikkhu has some work to do. It occurs to him: ‘I will have to do some work, and while doing the work my body will get tired. Come now, let me lie down.’ So he lies down, not generating energy for attaining the unattained, for realizing the unrealized, for experiencing the unexperienced. This is the first ground for laziness.\n\n\"Furthermore, a bhikkhu has done some work. It occurs to him: ‘I have done some work, and while doing the work my body became tired. Come now, let me lie down.’ So he lies down, not generating energy… This is the second ground for laziness.\n\n\"Furthermore, a bhikkhu has a road to travel. It occurs to him: ‘I will have to travel a road, and while traveling the road my body will get tired. Come now, let me lie down.’ So he lies down, not generating energy… This is the third ground for laziness.\n\n\"Furthermore, a bhikkhu has traveled a road. It occurs to him: ‘I have traveled a road, and while traveling the road my body became tired. Come now, let me lie down.’ So he lies down, not generating energy… This is the fourth ground for laziness.\n\n\"Furthermore, a bhikkhu, while going on alms-round in a village or town, does not get his fill of coarse or fine food. It occurs to him: ‘While going on alms-round in a village or town, I did not get my fill of coarse or fine food; because of that my body is tired and unfit for work. Come now, let me lie down.’ So he lies down, not generating energy… This is the fifth ground for laziness.\n\n\"Furthermore, a bhikkhu, while going on alms-round in a village or town, gets his fill of coarse or fine food. It occurs to him: ‘While going on alms-round in a village or town, I got my fill of coarse or fine food; because of that my body is heavy and unfit for work, I feel as if I have been stuffed. Come now, let me lie down.’ So he lies down, not generating energy… This is the sixth ground for laziness.\n\n\"Furthermore, a bhikkhu is afflicted by a minor illness. It occurs to him: ‘I am afflicted by a minor illness; there is a time for lying down. Come now, let me lie down.’ So he lies down, not generating energy… This is the seventh ground for laziness.\n\n\"Furthermore, a bhikkhu has just recovered from an illness, he has only recently recovered from his sickness. It occurs to him: ‘I have just recovered from an illness, I have only recently recovered from my sickness; because of that my body is weak and unfit for work. Come now, let me lie down.’ So he lies down, not generating energy for attaining the unattained, for realizing the unrealized, for experiencing the unexperienced. This is the eighth ground for laziness.\"",
      "sinhala": "‘‘අටකුසීතවත්ථූනි. මෙහි මහණෙනි, භික්ෂුවකට කර්මයක් කිරීමට තිබේ. ඔහුට මෙවැනි සිතක් ඇති වේ. ‘මට කර්මයක් කිරීමට තිබෙන්නේය. කර්මය කරද්දී මගේ කය වෙහෙසට පත් වන්නේය. එබැවින් මම නිදාගන්නෙමි’යි සිතයි. ඔහු නිදාගනියි. නොලැබූ දෙය ලැබීම පිණිස, අවබෝධ නොකළ දෙය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ දෙය සාක්ෂාත් කිරීම පිණිස වීර්යය ආරම්භ නොකරයි. මෙය පළමුවන කුසීත වස්තුවයි. ‘‘තවද මහණෙනි, භික්ෂුවක් විසින් කර්මයක් කරන ලද්දේ වෙයි. ඔහුට මෙවැනි සිතක් ඇති වේ. ‘මම කර්මයක් කළෙමි. කර්මය කරද්දී මගේ කය වෙහෙසට පත් විය. එබැවින් මම නිදාගන්නෙමි’යි සිතයි. ඔහු නිදාගනියි. වීර්යය ආරම්භ නොකරයි. මෙය දෙවන කුසීත වස්තුවයි. ‘‘තවද මහණෙනි, භික්ෂුවකට මාර්ගයක් ගමන් කිරීමට තිබේ. ඔහුට මෙවැනි සිතක් ඇති වේ. ‘මට මාර්ගයක් ගමන් කිරීමට තිබෙන්නේය. මාර්ගය ගමන් කරද්දී මගේ කය වෙහෙසට පත් වන්නේය. එබැවින් මම නිදාගන්නෙමි’යි සිතයි. ඔහු නිදාගනියි. වීර්යය ආරම්භ නොකරයි. මෙය තුන්වන කුසීත වස්තුවයි. ‘‘තවද මහණෙනි, භික්ෂුවක් විසින් මාර්ගයක් ගමන් කරන ලද්දේ වෙයි. ඔහුට මෙවැනි සිතක් ඇති වේ. ‘මම මාර්ගයක් ගමන් කළෙමි. මාර්ගය ගමන් කරද්දී මගේ කය වෙහෙසට පත් විය. එබැවින් මම නිදාගන්නෙමි’යි සිතයි. ඔහු නිදාගනියි. වීර්යය ආරම්භ නොකරයි. මෙය සතරවන කුසීත වස්තුවයි. ‘‘තවද මහණෙනි, භික්ෂුවක් ගමකට හෝ නියම් ගමකට පිණ්ඩපාතය සඳහා හැසිරෙමින් රළු හෝ සියුම් භෝජනයෙන් ප්‍රමාණවත් පරිදි පූර්ණත්වයට පැමිණෙන්නේ නැත. ඔහුට මෙවැනි සිතක් ඇති වේ. ‘මම ගමකට හෝ නියම් ගමකට පිණ්ඩපාතය සඳහා හැසිරෙමින් රළු හෝ සියුම් භෝජනයෙන් ප්‍රමාණවත් පරිදි පූර්ණත්වයට පැමිණියේ නැත. එබැවින් මගේ කය වෙහෙසට පත්වී අකර්මණ්‍ය වී ඇත. එබැවින් මම නිදාගන්නෙමි’යි සිතයි. ඔහු නිදාගනියි. වීර්යය ආරම්භ නොකරයි. මෙය පස්වන කුසීත වස්තුවයි. ‘‘තවද මහණෙනි, භික්ෂුවක් ගමකට හෝ නියම් ගමකට පිණ්ඩපාතය සඳහා හැසිරෙමින් රළු හෝ සියුම් භෝජනයෙන් ප්‍රමාණවත් පරිදි පූර්ණත්වයට පැමිණෙයි. ඔහුට මෙවැනි සිතක් ඇති වේ. ‘මම ගමකට හෝ නියම් ගමකට පිණ්ඩපාතය සඳහා හැසිරෙමින් රළු හෝ සියුම් භෝජනයෙන් ප්‍රමාණවත් පරිදි පූර්ණත්වයට පැමිණියෙමි. එබැවින් මගේ කය ගරු වී අකර්මණ්‍ය වී ඇත. මම මසින් පුරවන ලද්දෙක් මෙන් වෙමි. එබැවින් මම නිදාගන්නෙමි’යි සිතයි. ඔහු නිදාගනියි. වීර්යය ආරම්භ නොකරයි. මෙය සයවන කුසීත වස්තුවයි. ‘‘තවද මහණෙනි, භික්ෂුවකට සුළු රෝගයක් හටගනී. ඔහුට මෙවැනි සිතක් ඇති වේ. ‘මට මේ සුළු රෝගයක් හටගෙන ඇත. නිදාගැනීමට අවසර ඇත. එබැවින් මම නිදාගන්නෙමි’යි සිතයි. ඔහු නිදාගනියි. වීර්යය ආරම්භ නොකරයි. මෙය සත්වන කුසීත වස්තුවයි. ‘‘තවද මහණෙනි, භික්ෂුවක් රෝගයෙන් නැගිට, රෝගයෙන් මෑතකදී නැගිට සිටියි. ඔහුට මෙවැනි සිතක් ඇති වේ. ‘මම රෝගයෙන් නැගිට, රෝගයෙන් මෑතකදී නැගිට සිටියෙමි. එබැවින් මගේ කය දුර්වල වී අකර්මණ්‍ය වී ඇත. එබැවින් මම නිදාගන්නෙමි’යි සිතයි. ඔහු නිදාගනියි. නොලැබූ දෙය ලැබීම පිණිස, අවබෝධ නොකළ දෙය අවබෝධ කිරීම පිණිස, සාක්ෂාත් නොකළ දෙය සාක්ෂාත් කිරීම පිණිස වීර්යය ආරම්භ නොකරයි. මෙය අටවන කුසීත වස්තුවයි.",
      "paliTitle": ""
    },
    {
      "number": 335,
      "pali": "‘‘Aṭṭha ārambhavatthūni. Idhāvuso, bhikkhunā kammaṃ kātabbaṃ hoti. Tassa evaṃ hoti – ‘kammaṃ kho me kātabbaṃ bhavissati, kammaṃ kho pana me karontena na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ, handāhaṃ vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya, asacchikatassa sacchikiriyāyā’ti! So vīriyaṃ ārabhati appattassa pattiyā, anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ paṭhamaṃ ārambhavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhunā kammaṃ kataṃ hoti. Tassa evaṃ hoti – ‘ahaṃ kho kammaṃ akāsiṃ, kammaṃ kho panāhaṃ karonto nāsakkhiṃ buddhānaṃ sāsanaṃ manasi kātuṃ, handāhaṃ vīriyaṃ ārabhāmi…pe… so vīriyaṃ ārabhati… idaṃ dutiyaṃ ārambhavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhunā maggo gantabbo hoti. Tassa evaṃ hoti – ‘maggo kho me gantabbo bhavissati, maggaṃ kho pana me gacchantena na sukaraṃ buddhānaṃ sāsanaṃ manasi kātuṃ. Handāhaṃ vīriyaṃ ārabhāmi…pe… so vīriyaṃ ārabhati… idaṃ tatiyaṃ ārambhavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhunā maggo gato hoti. Tassa evaṃ hoti – ‘ahaṃ kho maggaṃ agamāsiṃ, maggaṃ kho panāhaṃ gacchanto nāsakkhiṃ buddhānaṃ sāsanaṃ manasi kātuṃ, handāhaṃ vīriyaṃ ārabhāmi…pe… so vīriyaṃ ārabhati… idaṃ catutthaṃ ārambhavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhu gāmaṃ vā nigamaṃ vā piṇḍāya caranto na labhati lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa evaṃ hoti – ‘ahaṃ kho gāmaṃ vā nigamaṃ vā piṇḍāya caranto nālatthaṃ lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, tassa me kāyo lahuko kammañño, handāhaṃ vīriyaṃ ārabhāmi…pe… so vīriyaṃ ārabhati… idaṃ pañcamaṃ ārambhavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhu gāmaṃ vā nigamaṃ vā piṇḍāya caranto labhati lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ. Tassa evaṃ hoti – ‘ahaṃ kho gāmaṃ vā nigamaṃ vā piṇḍāya caranto alatthaṃ lūkhassa vā paṇītassa vā bhojanassa yāvadatthaṃ pāripūriṃ, tassa me kāyo balavā kammañño, handāhaṃ vīriyaṃ ārabhāmi…pe… so vīriyaṃ ārabhati… idaṃ chaṭṭhaṃ ārambhavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhuno uppanno hoti appamattako ābādho. Tassa evaṃ hoti – ‘uppanno kho me ayaṃ appamattako ābādho, ṭhānaṃ kho panetaṃ vijjati yaṃ me ābādho pavaḍḍheyya, handāhaṃ vīriyaṃ ārabhāmi…pe… so vīriyaṃ ārabhati… idaṃ sattamaṃ ārambhavatthu. ‘‘Puna caparaṃ, āvuso, bhikkhu gilānā vuṭṭhito hoti aciravuṭṭhito gelaññā. Tassa evaṃ hoti – ‘ahaṃ kho gilānā vuṭṭhito aciravuṭṭhito gelaññā, ṭhānaṃ kho panetaṃ vijjati yaṃ me ābādho paccudāvatteyya, handāhaṃ vīriyaṃ ārabhāmi appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāyā’’ti! So vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Idaṃ aṭṭhamaṃ ārambhavatthu.",
      "english": "\"There are these eight grounds for exertion. Here, a bhikkhu has some work to do. It occurs to him, 'I will have to do some work, but while doing work, it will not be easy to attend to the Buddha's teaching. Let me rouse my energy for the attainment of the unattained, the realization of the unrealized, the experiencing of the unexperienced!' And he rouses his energy for the attainment of the unattained, the realization of the unrealized, the experiencing of the unexperienced. This is the first ground for exertion.\n\n\"Again, a bhikkhu has done some work. It occurs to him, 'I have done some work, but while doing that work, I was unable to attend to the Buddha's teaching. Let me rouse my energy...' And he rouses his energy… This is the second ground for exertion.\n\n\"Again, a bhikkhu has a journey to undertake. It occurs to him, 'I will have to undertake a journey, but while undertaking a journey, it will not be easy to attend to the Buddha's teaching. Let me rouse my energy...' And he rouses his energy… This is the third ground for exertion.\n\n\"Again, a bhikkhu has completed a journey. It occurs to him, 'I have completed a journey, but while undertaking that journey, I was unable to attend to the Buddha's teaching. Let me rouse my energy...' And he rouses his energy… This is the fourth ground for exertion.\n\n\"Again, a bhikkhu, while wandering for alms in a village or town, does not obtain his fill of coarse or fine food. It occurs to him, 'While wandering for alms in a village or town, I did not obtain my fill of coarse or fine food; my body is now weak and unfit for work. Let me rouse my energy...' And he rouses his energy… This is the fifth ground for exertion.\n\n\"Again, a bhikkhu, while wandering for alms in a village or town, obtains his fill of coarse or fine food. It occurs to him, 'While wandering for alms in a village or town, I obtained my fill of coarse or fine food; my body is now strong and fit for work. Let me rouse my energy...' And he rouses his energy… This is the sixth ground for exertion.\n\n\"Again, a bhikkhu is afflicted by a minor illness. It occurs to him, 'I am afflicted by a minor illness, and there is a possibility that my illness might worsen. Let me rouse my energy...' And he rouses his energy… This is the seventh ground for exertion.\n\n\"Again, a bhikkhu has just recovered from an illness, having only recently recovered from his sickness. It occurs to him, 'I have just recovered from an illness, having only recently recovered from my sickness, and there is a possibility that the illness might relapse. Let me rouse my energy for the attainment of the unattained, the realization of the unrealized, the experiencing of the unexperienced!' And he rouses his energy for the attainment of the unattained, the realization of the unrealized, the experiencing of the unexperienced. This is the eighth ground for exertion.\"",
      "sinhala": "‘‘ආ‍රම්භවත්‍ථූන් අටෙකි. ඇවැත්නි, මෙහිලා භික්‍ෂුව විසින් කර්‍මය කටයුතු වන්නේ ය. ඔහුට මෙසේ වේ: ‘මා විසින් කර්‍මය කටයුතු වන්නේ මැයි. කර්‍මය කරන මට බුද්‍ධශාසනය මෙනෙහි කිරීමට පහසු නො වේ. එහෙයින් මම නො පැමිණි දෙය පැමිණීමටත්, නො අවබෝධ කළ දෙය අවබෝධ කිරීමටත්, සාක්‍ෂාත් නො කළ දෙය සාක්‍ෂාත් කිරීමටත් වීර්යය අරඹන්නෙමි’යි. හෙතෙම නො පැමිණි දෙය පැමිණීමටත්, නො අවබෝධ කළ දෙය අවබෝධ කිරීමටත්, සාක්‍ෂාත් නො කළ දෙය සාක්‍ෂාත් කිරීමටත් වීර්යය අරඹයි. මෙය පළමු වන ආරම්භවත්‍ථු ය. ‘‘තව ද, ඇවැත්නි, භික්‍ෂුව විසින් කර්‍මය කරන ලද්දේ වේ. ඔහුට මෙසේ වේ: ‘මම කර්‍මය කෙළෙමි. කර්‍මය කරන මට බුද්‍ධශාසනය මෙනෙහි කිරීමට නො හැකි විය. එහෙයින් මම වීර්යය අරඹන්නෙමි...’ හෙතෙම වීර්යය අරඹයි. මෙය දෙවන ආරම්භවත්‍ථු ය. ‘‘තව ද, ඇවැත්නි, භික්‍ෂුව විසින් මාර්‍ගය යා යුතු වන්නේ ය. ඔහුට මෙසේ වේ: ‘මා විසින් මාර්‍ගය යා යුතු වන්නේ මැයි. මාර්‍ගය යන මට බුද්‍ධශාසනය මෙනෙහි කිරීමට පහසු නො වේ. එහෙයින් මම වීර්යය අරඹන්නෙමි...’ හෙතෙම වීර්යය අරඹයි. මෙය තෙවන ආරම්භවත්‍ථු ය. ‘‘තව ද, ඇවැත්නි, භික්‍ෂුව විසින් මාර්‍ගය යන ලද්දේ වේ. ඔහුට මෙසේ වේ: ‘මම මාර්‍ගය ගියෙමි. මාර්‍ගය යන මට බුද්‍ධශාසනය මෙනෙහි කිරීමට නො හැකි විය. එහෙයින් මම වීර්යය අරඹන්නෙමි...’ හෙතෙම වීර්යය අරඹයි. මෙය සතර වන ආරම්භවත්‍ථු ය. ‘‘තව ද, ඇවැත්නි, භික්‍ෂුව ගමට හෝ නියම්ගමට හෝ පිඬු පිණිස හැසිරෙමින් රළු වූ හෝ සියුම් වූ හෝ භෝජනයෙන් අවශ්‍ය පමණට පූර්‍ණය නො ලබයි. ඔහුට මෙසේ වේ: ‘මම ගමට හෝ නියම්ගමට හෝ පිඬු පිණිස හැසිරෙමින් රළු වූ හෝ සියුම් වූ හෝ භෝජනයෙන් අවශ්‍ය පමණට පූර්‍ණය නො ලැබීමි. එහෙයින් මාගේ කය සැහැල්ලු ය, කර්‍මණ්‍ය ය. එහෙයින් මම වීර්යය අරඹන්නෙමි...’ හෙතෙම වීර්යය අරඹයි. මෙය පස් වන ආරම්භවත්‍ථු ය. ‘‘තව ද, ඇවැත්නි, භික්‍ෂුව ගමට හෝ නියම්ගමට හෝ පිඬු පිණිස හැසිරෙමින් රළු වූ හෝ සියුම් වූ හෝ භෝජනයෙන් අවශ්‍ය පමණට පූර්‍ණය ලබයි. ඔහුට මෙසේ වේ: ‘මම ගමට හෝ නියම්ගමට හෝ පිඬු පිණිස හැසිරෙමින් රළු වූ හෝ සියුම් වූ හෝ භෝජනයෙන් අවශ්‍ය පමණට පූර්‍ණය ලැබීමි. එහෙයින් මාගේ කය බලවත් ය, කර්‍මණ්‍ය ය. එහෙයින් මම වීර්යය අරඹන්නෙමි...’ හෙතෙම වීර්යය අරඹයි. මෙය සය වන ආරම්භවත්‍ථු ය. ‘‘තව ද, ඇවැත්නි, භික්‍ෂුවට නො පමණ වූ සුළු ආබාධයක් උපන්නා වේ. ඔහුට මෙසේ වේ: ‘මට මේ නො පමණ වූ සුළු ආබාධයක් උපන්නේ ය. මාගේ මේ ආබාධය වැඩෙන්නට හේතු තිබේ. එහෙයින් මම වීර්යය අරඹන්නෙමි...’ හෙතෙම වීර්යය අරඹයි. මෙය සත් වන ආරම්භවත්‍ථු ය. ‘‘තව ද, ඇවැත්නි, භික්‍ෂුව රෝගයෙන් නැඟී සිටියේ වේ. රෝගයෙන් මඳ කලෙකින් නැඟී සිටියේ වේ. ඔහුට මෙසේ වේ: ‘මම රෝගයෙන් නැඟී සිටියෙමි. රෝගයෙන් මඳ කලෙකින් නැඟී සිටියෙමි. මාගේ මේ ආබාධය නැවත පැමිණෙන්නට හේතු තිබේ. එහෙයින් මම නො පැමිණි දෙය පැමිණීමටත්, නො අවබෝධ කළ දෙය අවබෝධ කිරීමටත්, සාක්‍ෂාත් නො කළ දෙය සාක්‍ෂාත් කිරීමටත් වීර්යය අරඹන්නෙමි’යි. හෙතෙම නො පැමිණි දෙය පැමිණීමටත්, නො අවබෝධ කළ දෙය අවබෝධ කිරීමටත්, සාක්‍ෂාත් නො කළ දෙය සාක්‍ෂාත් කිරීමටත් වීර්යය අරඹයි. මෙය අට වන ආරම්භවත්‍ථු ය.’’",
      "paliTitle": ""
    },
    {
      "number": 336,
      "pali": "‘‘Aṭṭha dānavatthūni. Āsajja dānaṃ deti, bhayā dānaṃ deti, ‘adāsi me’ti dānaṃ deti, ‘dassati me’ti dānaṃ deti, ‘sāhu dāna’nti dānaṃ deti, ‘ahaṃ pacāmi, ime na pacanti, nārahāmi pacanto apacantānaṃ dānaṃ na dātu’nti dānaṃ deti, ‘idaṃ me dānaṃ dadato kalyāṇo kittisaddo abbhuggacchatī’ti dānaṃ deti. Cittālaṅkāra-cittaparikkhāratthaṃ dānaṃ deti.",
      "english": "\"There are these eight grounds for giving. One gives a gift out of attachment, one gives a gift out of fear, one gives a gift thinking, 'He gave to me,' one gives a gift thinking, 'He will give to me,' one gives a gift thinking, 'Giving is good,' one gives a gift thinking, 'I cook, these do not cook; it is not proper for me, while cooking, not to give to those who do not cook,' one gives a gift thinking, 'Giving this gift, a good reputation will arise for me.' One gives a gift for the sake of adorning and beautifying the mind.\"",
      "sinhala": "අට ආකාර දාන වස්තු වෙති. ඇලීම නිසා දානය දෙයි, බිය නිසා දානය දෙයි, ‘මට දුන්නා’ යන කාරණය නිසා දානය දෙයි, ‘මට දෙන්නේය’ යන කාරණය නිසා දානය දෙයි, ‘හොඳ දානයක්’ යයි සිතා දානය දෙයි, ‘මම උයමි, මොවුහු නොඋයති, උයන්නෙකු වූ මම නොඋයන්නන්ට දානය නොදීමට සුදුසු නොවෙමි’ යයි සිතා දානය දෙයි, ‘මේ දානය දීමෙන් මට යහපත් කීර්ති ඝෝෂාවක් නැඟෙන්නේය’ යි සිතා දානය දෙයි. සිත අලංකාර කිරීම හා සිත සරසා ගැනීම පිණිස දානය දෙයි.",
      "paliTitle": ""
    },
    {
      "number": 337,
      "pali": "‘‘Aṭṭha dānūpapattiyo. Idhāvuso, ekacco dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So yaṃ deti taṃ paccāsīsati [paccāsiṃsati (sī. syā. kaṃ. pī.)]. So passati khattiyamahāsālaṃ vā brāhmaṇamahāsālaṃ vā gahapatimahāsālaṃ vā pañcahi kāmaguṇehi samappitaṃ samaṅgībhūtaṃ paricārayamānaṃ. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā khattiyamahāsālānaṃ vā brāhmaṇamahāsālānaṃ vā gahapatimahāsālānaṃ vā sahabyataṃ upapajjeyya’nti! So taṃ cittaṃ dahati, taṃ cittaṃ adhiṭṭhāti, taṃ cittaṃ bhāveti, tassa taṃ cittaṃ hīne vimuttaṃ uttari abhāvitaṃ tatrūpapattiyā saṃvattati. Tañca kho sīlavato vadāmi no dussīlassa. Ijjhatāvuso, sīlavato cetopaṇidhi visuddhattā. ‘‘Puna caparaṃ, āvuso, idhekacco dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ…pe… seyyāvasathapadīpeyyaṃ. So yaṃ deti taṃ paccāsīsati. Tassa sutaṃ hoti – ‘cātumahārājikā [cātummahārājikā (sī. syā. pī.)] devā dīghāyukā vaṇṇavanto sukhabahulā’’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā cātumahārājikānaṃ devānaṃ sahabyataṃ upapajjeyya’’nti! So taṃ cittaṃ dahati, taṃ cittaṃ adhiṭṭhāti, taṃ cittaṃ bhāveti, tassa taṃ cittaṃ hīne vimuttaṃ uttari abhāvitaṃ tatrūpapattiyā saṃvattati. Tañca kho sīlavato vadāmi no dussīlassa. Ijjhatāvuso, sīlavato cetopaṇidhi visuddhattā. ‘‘Puna caparaṃ, āvuso, idhekacco dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ…pe… seyyāvasathapadīpeyyaṃ. So yaṃ deti taṃ paccāsīsati. Tassa sutaṃ hoti – ‘tāvatiṃsā devā…pe… yāmā devā…pe… tusitā devā …pe… nimmānaratī devā…pe… paranimmitavasavattī devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā paranimmitavasavattīnaṃ devānaṃ sahabyataṃ upapajjeyya’’nti! So taṃ cittaṃ dahati, taṃ cittaṃ adhiṭṭhāti, taṃ cittaṃ bhāveti, tassa taṃ cittaṃ hīne vimuttaṃ uttari abhāvitaṃ tatrūpapattiyā saṃvattati. Tañca kho sīlavato vadāmi no dussīlassa. Ijjhatāvuso, sīlavato cetopaṇidhi visuddhattā. ‘‘Puna caparaṃ, āvuso, idhekacco dānaṃ deti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So yaṃ deti taṃ paccāsīsati. Tassa sutaṃ hoti – ‘brahmakāyikā devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā brahmakāyikānaṃ devānaṃ sahabyataṃ upapajjeyya’nti! So taṃ cittaṃ dahati, taṃ cittaṃ adhiṭṭhāti, taṃ cittaṃ bhāveti, tassa taṃ cittaṃ hīne vimuttaṃ uttari abhāvitaṃ tatrūpapattiyā saṃvattati. Tañca kho sīlavato vadāmi no dussīlassa; vītarāgassa no sarāgassa. Ijjhatāvuso, sīlavato cetopaṇidhi vītarāgattā. ‘‘Aṭṭha parisā – khattiyaparisā, brāhmaṇaparisā, gahapatiparisā, samaṇaparisā, cātumahārājikaparisā, tāvatiṃsaparisā, māraparisā, brahmaparisā. ‘‘Aṭṭha lokadhammā – lābho ca, alābho ca, yaso ca, ayaso ca, nindā ca, pasaṃsā ca, sukhañca, dukkhañca.",
      "english": "\"There are these eight opportunities for giving. Here, a certain person gives a gift to a contemplative or a brahmin: food, drink, cloth, vehicles, garlands, scents, and unguents, bedding, lodging, and lighting. He anticipates a return for what he gives. He sees a wealthy noble, brahmin, or householder enjoying themselves, provided and endowed with the five cords of sensual pleasure. He thinks, ‘Oh, that after death, when my body breaks up, I might be reborn into the company of wealthy nobles, brahmins, or householders!’ He sets his heart on this, fixes his heart on this, develops his heart on this. That thought of his is liberated from what is inferior but not developed to a higher degree, and it leads to rebirth there. But I say this is so for the ethical, not the unethical. For the ethical, the aspiration of the heart succeeds because of purity. Furthermore, a certain person gives a gift to a contemplative or a brahmin: food, drink … bedding, lodging, and lighting. He anticipates a return for what he gives. He hears that the gods of the Four Great Kings are long-lived, beautiful, and enjoy much happiness.’ He thinks, ‘Oh, that after death, when my body breaks up, I might be reborn into the company of the gods of the Four Great Kings!’ He sets his heart on this, fixes his heart on this, develops his heart on this. That thought of his is liberated from what is inferior but not developed to a higher degree, and it leads to rebirth there. But I say this is so for the ethical, not the unethical. For the ethical, the aspiration of the heart succeeds because of purity. Furthermore, a certain person gives a gift to a contemplative or a brahmin: food, drink … bedding, lodging, and lighting. He anticipates a return for what he gives. He hears that the gods of the Thirty-Three … the Yama gods … the Tusita gods … the gods who love to create … the gods who control what others create are long-lived, beautiful, and enjoy much happiness.’ He thinks, ‘Oh, that after death, when my body breaks up, I might be reborn into the company of the gods who control what others create!’ He sets his heart on this, fixes his heart on this, develops his heart on this. That thought of his is liberated from what is inferior but not developed to a higher degree, and it leads to rebirth there. But I say this is so for the ethical, not the unethical. For the ethical, the aspiration of the heart succeeds because of purity. Furthermore, a certain person gives a gift to a contemplative or a brahmin: food, drink, cloth, vehicles, garlands, scents, and unguents, bedding, lodging, and lighting. He anticipates a return for what he gives. He hears that the Brahmā’s gods are long-lived, beautiful, and enjoy much happiness.’ He thinks, ‘Oh, that after death, when my body breaks up, I might be reborn into the company of the Brahmā’s gods!’ He sets his heart on this, fixes his heart on this, develops his heart on this. That thought of his is liberated from what is inferior but not developed to a higher degree, and it leads to rebirth there. But I say this is so for the ethical, not the unethical; for one free of lust, not for one full of lust. For the ethical, the aspiration of the heart succeeds because of being free of lust. There are eight assemblies: the assembly of nobles, the assembly of brahmins, the assembly of householders, the assembly of contemplatives, the assembly of the gods of the Four Great Kings, the assembly of the gods of the Thirty-Three, the assembly of Māra, and the assembly of Brahmā. There are eight worldly conditions: gain and loss, fame and disgrace, censure and praise, and happiness and suffering.\"",
      "sinhala": "‘‘දානූපපත්තීන් අටක් ඇත. ඇවැත්නි, මෙලොව ඇතැමෙක් ශ්‍රමණයාට හෝ බ්‍රාහ්මණයාට හෝ ආහාර, පාන, වස්ත්‍ර, යාන, මල්, සුවඳ විලවුන්, යහන්, වාසස්ථාන, පහන් ආදිය දෙයි. ඔහු යමක් දෙයි ද එය අපේක්ෂා කරයි. ඔහු ක්ෂත්‍රිය මහේශාක්‍යයකු හෝ බ්‍රාහ්මණ මහේශාක්‍යයකු හෝ ගෘහපති මහේශාක්‍යයකු හෝ පංචකාම ගුණයෙන් සමෘද්ධ වූ, මනාකොට ගැළපුණු පරිචර්යා කරනු දකියි. ‘අහෝ! මම කය බිඳීමෙන් මරණින් මතු ක්ෂත්‍රිය මහේශාක්‍යයන්ගේ හෝ බ්‍රාහ්මණ මහේශාක්‍යයන්ගේ හෝ ගෘහපති මහේශාක්‍යයන්ගේ හෝ සහභාගීත්වයට පැමිණෙන්නෙම් නම් හොඳයි’ කියා ඔහුට මෙබඳු සිතක් ඇති වේ. ඔහු ඒ සිතෙහි දැඩිව සිටියි. ඒ සිත අධිෂ්ඨාන කරයි. ඒ සිත වඩයි. ඔහුගේ ඒ සිත පහත් දෙයින් මිදුණු, උසස් දෙයෙහි නොවැඩුනු හෙයින් එහි ඉපදීම පිණිස පවතී. එය ද සිල්වත්හුගේ යයි කියමි. දුශ්ශීලයාගේ නොවේ. ඇවැත්නි, සිල්වතුන්ගේ චේතනා ප්‍රණිධානය විශුද්ධත්වයෙන් සිදු වේ.\n\n‘‘තවද ඇවැත්නි, මෙලොව ඇතැමෙක් ශ්‍රමණයාට හෝ බ්‍රාහ්මණයාට හෝ ආහාර, පාන, ... යහන්, වාසස්ථාන, පහන් ආදිය දෙයි. ඔහු යමක් දෙයි ද එය අපේක්ෂා කරයි. ‘චාතුම්මහාරාජික දෙවියෝ දීර්ඝායුෂ ඇත්තාහ. වර්ණවත්යහ. බොහෝ සැප ඇත්තාහ’යි ඔහුට අසන්නට ලැබේ. ‘අහෝ! මම කය බිඳීමෙන් මරණින් මතු චාතුම්මහාරාජික දෙවියන්ගේ සහභාගීත්වයට පැමිණෙන්නෙම් නම් හොඳයි’ කියා ඔහුට මෙබඳු සිතක් ඇති වේ. ඔහු ඒ සිතෙහි දැඩිව සිටියි. ඒ සිත අධිෂ්ඨාන කරයි. ඒ සිත වඩයි. ඔහුගේ ඒ සිත පහත් දෙයින් මිදුණු, උසස් දෙයෙහි නොවැඩුනු හෙයින් එහි ඉපදීම පිණිස පවතී. එය ද සිල්වත්හුගේ යයි කියමි. දුශ්ශීලයාගේ නොවේ. ඇවැත්නි, සිල්වතුන්ගේ චේතනා ප්‍රණිධානය විශුද්ධත්වයෙන් සිදු වේ.\n\n‘‘තවද ඇවැත්නි, මෙලොව ඇතැමෙක් ශ්‍රමණයාට හෝ බ්‍රාහ්මණයාට හෝ ආහාර, පාන, ... යහන්, වාසස්ථාන, පහන් ආදිය දෙයි. ඔහු යමක් දෙයි ද එය අපේක්ෂා කරයි. ‘තව්තිසා දෙවියෝ ... යාම දෙවියෝ ... තුසිත දෙවියෝ ... නිම්මානරතී දෙවියෝ ... පරනිම්මිතවසවත්ති දෙවියෝ දීර්ඝායුෂ ඇත්තාහ. වර්ණවත්යහ. බොහෝ සැප ඇත්තාහ’යි ඔහුට අසන්නට ලැබේ. ‘අහෝ! මම කය බිඳීමෙන් මරණින් මතු පරනිම්මිතවසවත්ති දෙවියන්ගේ සහභාගීත්වයට පැමිණෙන්නෙම් නම් හොඳයි’ කියා ඔහුට මෙබඳු සිතක් ඇති වේ. ඔහු ඒ සිතෙහි දැඩිව සිටියි. ඒ සිත අධිෂ්ඨාන කරයි. ඒ සිත වඩයි. ඔහුගේ ඒ සිත පහත් දෙයින් මිදුණු, උසස් දෙයෙහි නොවැඩුනු හෙයින් එහි ඉපදීම පිණිස පවතී. එය ද සිල්වත්හුගේ යයි කියමි. දුශ්ශීලයාගේ නොවේ. ඇවැත්නි, සිල්වතුන්ගේ චේතනා ප්‍රණිධානය විශුද්ධත්වයෙන් සිදු වේ.\n\n‘‘තවද ඇවැත්නි, මෙලොව ඇතැමෙක් ශ්‍රමණයාට හෝ බ්‍රාහ්මණයාට හෝ ආහාර, පාන, වස්ත්‍ර, යාන, මල්, සුවඳ විලවුන්, යහන්, වාසස්ථාන, පහන් ආදිය දෙයි. ඔහු යමක් දෙයි ද එය අපේක්ෂා කරයි. ‘බ්‍රහ්මකායික දෙවියෝ දීර්ඝායුෂ ඇත්තාහ. වර්ණවත්යහ. බොහෝ සැප ඇත්තාහ’යි ඔහුට අසන්නට ලැබේ. ‘අහෝ! මම කය බිඳීමෙන් මරණින් මතු බ්‍රහ්මකායික දෙවියන්ගේ සහභාගීත්වයට පැමිණෙන්නෙම් නම් හොඳයි’ කියා ඔහුට මෙබඳු සිතක් ඇති වේ. ඔහු ඒ සිතෙහි දැඩිව සිටියි. ඒ සිත අධිෂ්ඨාන කරයි. ඒ සිත වඩයි. ඔහුගේ ඒ සිත පහත් දෙයින් මිදුණු, උසස් දෙයෙහි නොවැඩුනු හෙයින් එහි ඉපදීම පිණිස පවතී. එය ද සිල්වත්හුගේ යයි කියමි. දුශ්ශීලයාගේ නොවේ. වීරත රාගී වූවන්ගේ මිස සරාගී වූවන්ගේ නොවේ. ඇවැත්නි, වීරත රාගී වූ සිල්වතුන්ගේ චේතනා ප්‍රණිධානය රාග රහිත බැවින් සිදු වේ.\n\n‘‘පිරිස් අටකි. එනම්, ක්ෂත්‍රිය පරිස, බ්‍රාහ්මණ පරිස, ගෘහපති පරිස, ශ්‍රමණ පරිස, චාතුම්මහාරාජික පරිස, තව්තිසා පරිස, මාර පරිස, බ්‍රහ්ම පරිස යන ඒවායි.\n\n‘‘ලෝක ධර්ම අටකි. එනම්, ලාභය හා අලාභය ද, යසස හා අයසස ද, නින්දාව හා ප්‍රශංසාව ද, සැපය හා දුකය ද යන ඒවායි.",
      "paliTitle": ""
    },
    {
      "number": 338,
      "pali": "‘‘Aṭṭha abhibhāyatanāni. Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni, ‘tāni abhibhuyya jānāmi passāmī’ti evaṃsaññī hoti. Idaṃ paṭhamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni, ‘tāni abhibhuyya jānāmi passāmī’ti – evaṃsaññī hoti. Idaṃ dutiyaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni, ‘tāni abhibhuyya jānāmi passāmī’ti evaṃsaññī hoti. Idaṃ tatiyaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni, ‘tāni abhibhuyya jānāmi passāmī’ti evaṃsaññī hoti. Idaṃ catutthaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni. Seyyathāpi nāma umāpupphaṃ nīlaṃ nīlavaṇṇaṃ nīlanidassanaṃ nīlanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ nīlaṃ nīlavaṇṇaṃ nīlanidassanaṃ nīlanibhāsaṃ. Evameva [evamevaṃ (ka.)] ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni, ‘tāni abhibhuyya jānāmi passāmī’ti evaṃsaññī hoti. Idaṃ pañcamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni. Seyyathāpi nāma kaṇikārapupphaṃ [kaṇṇikārapupphaṃ (syā. kaṃ.)] pītaṃ pītavaṇṇaṃ pītanidassanaṃ pītanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ pītaṃ pītavaṇṇaṃ pītanidassanaṃ pītanibhāsaṃ. Evameva ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni, ‘tāni abhibhuyya jānāmi passāmī’ti evaṃsaññī hoti. Idaṃ chaṭṭhaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. Seyyathāpi nāma bandhujīvakapupphaṃ lohitakaṃ lohitakavaṇṇaṃ lohitakanidassanaṃ lohitakanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ lohitakaṃ lohitakavaṇṇaṃ lohitakanidassanaṃ lohitakanibhāsaṃ. Evameva ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni, ‘tāni abhibhuyya jānāmi passāmī’ti evaṃsaññī hoti. Idaṃ sattamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni. Seyyathāpi nāma osadhitārakā odātā odātavaṇṇā odātanidassanā odātanibhāsā, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ odātaṃ odātavaṇṇaṃ odātanidassanaṃ odātanibhāsaṃ. Evameva ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni, ‘tāni abhibhuyya jānāmi passāmī’ti evaṃsaññī hoti. Idaṃ aṭṭhamaṃ abhibhāyatanaṃ.",
      "english": "There are these eight spheres of mastery. Possessing a perception of form internally, one sees forms externally, limited, beautiful and ugly, thinking, ‘I know them, I see them, having mastered them.’ This is the first sphere of mastery.\n\nPossessing a perception of form internally, one sees forms externally, unlimited, beautiful and ugly, thinking, ‘I know them, I see them, having mastered them.’ This is the second sphere of mastery.\n\nNot possessing a perception of form internally, one sees forms externally, limited, beautiful and ugly, thinking, ‘I know them, I see them, having mastered them.’ This is the third sphere of mastery.\n\nNot possessing a perception of form internally, one sees forms externally, unlimited, beautiful and ugly, thinking, ‘I know them, I see them, having mastered them.’ This is the fourth sphere of mastery.\n\nNot possessing a perception of form internally, one sees forms externally, blue, blue in color, with blue signs, and blue in radiance. Just as a flax flower is blue, blue in color, with blue signs, and blue in radiance; or like a Benares cloth, smooth on both sides, is blue, blue in color, with blue signs, and blue in radiance. So too, not possessing a perception of form internally, one sees forms externally, blue, blue in color, with blue signs, and blue in radiance, thinking, ‘I know them, I see them, having mastered them.’ This is the fifth sphere of mastery.\n\nNot possessing a perception of form internally, one sees forms externally, yellow, yellow in color, with yellow signs, and yellow in radiance. Just as a kanikara flower is yellow, yellow in color, with yellow signs, and yellow in radiance; or like a Benares cloth, smooth on both sides, is yellow, yellow in color, with yellow signs, and yellow in radiance. So too, not possessing a perception of form internally, one sees forms externally, yellow, yellow in color, with yellow signs, and yellow in radiance, thinking, ‘I know them, I see them, having mastered them.’ This is the sixth sphere of mastery.\n\nNot possessing a perception of form internally, one sees forms externally, red, red in color, with red signs, and red in radiance. Just as a bandhujivaka flower is red, red in color, with red signs, and red in radiance; or like a Benares cloth, smooth on both sides, is red, red in color, with red signs, and red in radiance. So too, not possessing a perception of form internally, one sees forms externally, red, red in color, with red signs, and red in radiance, thinking, ‘I know them, I see them, having mastered them.’ This is the seventh sphere of mastery.\n\nNot possessing a perception of form internally, one sees forms externally, white, white in color, with white signs, and white in radiance. Just as a morning star is white, white in color, with white signs, and white in radiance; or like a Benares cloth, smooth on both sides, is white, white in color, with white signs, and white in radiance. So too, not possessing a perception of form internally, one sees forms externally, white, white in color, with white signs, and white in radiance, thinking, ‘I know them, I see them, having mastered them.’ This is the eighth sphere of mastery.",
      "sinhala": "අභිභායතන අටක් ඇත. එක් පුද්ගලයෙක් තමා තුළ රූප සංඥාවෙන් යුක්තව බාහිර රූපයන් සුළු වශයෙන් හොඳ හා නරක වර්ණයෙන් යුක්තව දකී. ‘මම ඒවා අභිබවා දැන ගනිමි, දකිමි’ යනුවෙන් සිතයි. මෙය පළමුවන අභිභායතනයයි.\n\nතවද එක් පුද්ගලයෙක් තමා තුළ රූප සංඥාවෙන් යුක්තව බාහිර රූපයන් අප්‍රමාණ වශයෙන් හොඳ හා නරක වර්ණයෙන් යුක්තව දකී. ‘මම ඒවා අභිබවා දැන ගනිමි, දකිමි’ යනුවෙන් සිතයි. මෙය දෙවන අභිභායතනයයි.\n\nතවද එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් සුළු වශයෙන් හොඳ හා නරක වර්ණයෙන් යුක්තව දකී. ‘මම ඒවා අභිබවා දැන ගනිමි, දකිමි’ යනුවෙන් සිතයි. මෙය තුන්වන අභිභායතනයයි.\n\nතවද එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් අප්‍රමාණ වශයෙන් හොඳ හා නරක වර්ණයෙන් යුක්තව දකී. ‘මම ඒවා අභිබවා දැන ගනිමි, දකිමි’ යනුවෙන් සිතයි. මෙය සිව්වන අභිභායතනයයි.\n\nතවද එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් නිල් පැහැයෙන්, නිල් වර්ණයෙන්, නිල් පැහැයෙන් දිස්වන, නිල් ආලෝකයෙන් යුක්තව දකී. යම් සේද උම්මා මලක් නිල් පැහැති, නිල් වර්ණවත්, නිල් පැහැයෙන් දිස්වන, නිල් ආලෝකයෙන් යුක්ත වේ ද, යම් සේද ඒ බරණැස් සළුවක් දෙපස මැනවින් ඔප දැමූ නිල් පැහැති, නිල් වර්ණවත්, නිල් පැහැයෙන් දිස්වන, නිල් ආලෝකයෙන් යුක්ත වේ ද, එපරිද්දෙන්ම එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් නිල් පැහැයෙන්, නිල් වර්ණයෙන්, නිල් පැහැයෙන් දිස්වන, නිල් ආලෝකයෙන් යුක්තව දකී. ‘මම ඒවා අභිබවා දැන ගනිමි, දකිමි’ යනුවෙන් සිතයි. මෙය පස්වන අභිභායතනයයි.\n\nතවද එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් කහ පැහැයෙන්, කහ වර්ණයෙන්, කහ පැහැයෙන් දිස්වන, කහ ආලෝකයෙන් යුක්තව දකී. යම් සේද කණිකාර මලක් කහ පැහැති, කහ වර්ණවත්, කහ පැහැයෙන් දිස්වන, කහ ආලෝකයෙන් යුක්ත වේ ද, යම් සේද ඒ බරණැස් සළුවක් දෙපස මැනවින් ඔප දැමූ කහ පැහැති, කහ වර්ණවත්, කහ පැහැයෙන් දිස්වන, කහ ආලෝකයෙන් යුක්ත වේ ද, එපරිද්දෙන්ම එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් කහ පැහැයෙන්, කහ වර්ණයෙන්, කහ පැහැයෙන් දිස්වන, කහ ආලෝකයෙන් යුක්තව දකී. ‘මම ඒවා අභිබවා දැන ගනිමි, දකිමි’ යනුවෙන් සිතයි. මෙය සයවන අභිභායතනයයි.\n\nතවද එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් රතු පැහැයෙන්, රතු වර්ණයෙන්, රතු පැහැයෙන් දිස්වන, රතු ආලෝකයෙන් යුක්තව දකී. යම් සේද බන්ධුජීවක මලක් රතු පැහැති, රතු වර්ණවත්, රතු පැහැයෙන් දිස්වන, රතු ආලෝකයෙන් යුක්ත වේ ද, යම් සේද ඒ බරණැස් සළුවක් දෙපස මැනවින් ඔප දැමූ රතු පැහැති, රතු වර්ණවත්, රතු පැහැයෙන් දිස්වන, රතු ආලෝකයෙන් යුක්ත වේ ද, එපරිද්දෙන්ම එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් රතු පැහැයෙන්, රතු වර්ණයෙන්, රතු පැහැයෙන් දිස්වන, රතු ආලෝකයෙන් යුක්තව දකී. ‘මම ඒවා අභිබවා දැන ගනිමි, දකිමි’ යනුවෙන් සිතයි. මෙය සත්වන අභිභායතනයයි.\n\nතවද එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් සුදු පැහැයෙන්, සුදු වර්ණයෙන්, සුදු පැහැයෙන් දිස්වන, සුදු ආලෝකයෙන් යුක්තව දකී. යම් සේද ඔසධි තාරකාවක් සුදු පැහැති, සුදු වර්ණවත්, සුදු පැහැයෙන් දිස්වන, සුදු ආලෝකයෙන් යුක්ත වේ ද, යම් සේද ඒ බරණැස් සළුවක් දෙපස මැනවින් ඔප දැමූ සුදු පැහැති, සුදු වර්ණවත්, සුදු පැහැයෙන් දිස්වන, සුදු ආලෝකයෙන් යුක්ත වේ ද, එපරිද්දෙන්ම එක් පුද්ගලයෙක් තමා තුළ අරූප සංඥාවෙන් යුක්තව බාහිර රූපයන් සුදු පැහැයෙන්, සුදු වර්ණයෙන්, සුදු පැහැයෙන් දිස්වන, සුදු ආලෝකයෙන් යුක්තව දකී. ‘මම ඒවා අභිබවා දැන ගනිමි, දකිමි’ යනුවෙන් සිතයි. මෙය අටවන අභිභායතනයයි.",
      "paliTitle": ""
    },
    {
      "number": 339,
      "pali": "‘‘Aṭṭha vimokkhā. Rūpī rūpāni passati. Ayaṃ paṭhamo vimokkho. ‘‘Ajjhattaṃ arūpasaññī bahiddhā rūpāni passati. Ayaṃ dutiyo vimokkho. ‘‘Subhanteva adhimutto hoti. Ayaṃ tatiyo vimokkho. ‘‘Sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Ayaṃ catuttho vimokkho. ‘‘Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Ayaṃ pañcamo vimokkho. ‘‘Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Ayaṃ chaṭṭho vimokkho. ‘‘Sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Ayaṃ sattamo vimokkho. ‘‘Sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayita nirodhaṃ upasampajja viharati. Ayaṃ aṭṭhamo vimokkho. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena aṭṭha dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. ",
      "english": "\"There are eight liberations. Possessing form, one sees forms. This is the first liberation. Being inwardly without perception of form, one sees forms externally. This is the second liberation. One is resolved only on the beautiful. This is the third liberation. With the complete surmounting of perceptions of form, with the disappearance of perceptions of resistance, with non-attention to perceptions of diversity, thinking, ‘Infinite is space,’ one enters and dwells in the sphere of infinite space. This is the fourth liberation. With the complete surmounting of the sphere of infinite space, thinking, ‘Infinite is consciousness,’ one enters and dwells in the sphere of infinite consciousness. This is the fifth liberation. With the complete surmounting of the sphere of infinite consciousness, thinking, ‘There is nothing,’ one enters and dwells in the sphere of nothingness. This is the sixth liberation. With the complete surmounting of the sphere of nothingness, one enters and dwells in the sphere of neither-perception-nor-non-perception. This is the seventh liberation. With the complete surmounting of the sphere of neither-perception-nor-non-perception, one enters and dwells in the cessation of perception and feeling. This is the eighth liberation. These, friends, are the eight qualities well-proclaimed by that Blessed One, the Knower, the Seer, the Arahant, the Perfectly Enlightened One; about which all should together recite…for the benefit, welfare, and happiness of gods and humans.\"",
      "sinhala": "‘‘විමොක්ෂ අටක් ඇත. රූප ඇත්තෙක් රූපයන් දකියි. මෙය පළමුවන විමොක්ෂයයි. ‘‘තමා තුළ අරූප සංඥා ඇත්තෙක් පිටත රූපයන් දකියි. මෙය දෙවන විමොක්ෂයයි. ‘‘ශුභයෙහිම ඇලුම් වූයේ වෙයි. මෙය තුන්වන විමොක්ෂයයි. ‘‘සියලු ආකාරයෙන් රූප සංඥාවන් ඉක්මවා, ප්‍රතිඝ සංඥාවන්ගේ අസ്തංගම වීමෙන්, නානාත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන් ‘අනන්ත වූ ආකාශය’ යැයි ආකාශානඤ්චායතනයට පැමිණ වාසය කරයි. මෙය සතරවන විමොක්ෂයයි. ‘‘සියලු ආකාරයෙන් ආකාශානඤ්චායතනය ඉක්මවා ‘අනන්ත වූ විඤ්ඤාණය’ යැයි විඤ්ඤාණඤ්චායතනයට පැමිණ වාසය කරයි. මෙය පස්වන විමොක්ෂයයි. ‘‘සියලු ආකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා ‘කිසිවක් නැත’ යැයි ආකිඤ්චඤ්ඤායතනයට පැමිණ වාසය කරයි. මෙය සයවන විමොක්ෂයයි. ‘‘සියලු ආකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ වාසය කරයි. මෙය සත්වන විමොක්ෂයයි. ‘‘සියලු ආකාරයෙන් නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්මවා සංඥා වේදනා නිරෝධයට පැමිණ වාසය කරයි. මෙය අටවන විමොක්ෂයයි. ‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මේ ධර්ම අට මැනවින් දේශනා කරන ලදී. එහි සියල්ලන් විසින්ම සාංගායනා කළ යුතුය. දෙව් මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස…",
      "paliTitle": ""
    },
    {
      "number": 340,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena nava dhammā sammadakkhātā; tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Katame nava? ‘‘Nava āghātavatthūni. ‘Anatthaṃ me acarī’ti āghātaṃ bandhati; ‘anatthaṃ me caratī’ti āghātaṃ bandhati; ‘anatthaṃ me carissatī’ti āghātaṃ bandhati; ‘piyassa me manāpassa anatthaṃ acarī’ti āghātaṃ bandhati…pe… anatthaṃ caratīti āghātaṃ bandhati…pe… anatthaṃ carissatīti āghātaṃ bandhati; ‘appiyassa me amanāpassa atthaṃ acarī’ti āghātaṃ bandhati…pe… atthaṃ caratīti āghātaṃ bandhati… pe… atthaṃ carissatīti āghātaṃ bandhati. ‘‘Nava āghātapaṭivinayā. ‘Anatthaṃ me acari [acarīti (syā. ka.) evaṃ ‘‘carati carissati’’ padesupi], taṃ kutettha labbhā’ti āghātaṃ paṭivineti; ‘anatthaṃ me carati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti; ‘anatthaṃ me carissati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti; ‘piyassa me manāpassa anatthaṃ acari…pe… anatthaṃ carati…pe… anatthaṃ carissati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti; ‘appiyassa me amanāpassa atthaṃ acari…pe… atthaṃ carati…pe… atthaṃ carissati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti.",
      "english": "\"Friends, these nine qualities have been well proclaimed by that Blessed One, the Knower, the Seer, the Worthy One, the Fully Enlightened One; all should chant them together… for the benefit, welfare, and happiness of gods and humans. Which nine?\n\n\"The nine grounds for resentment. ‘He has done me harm’—one harbors resentment; ‘he is doing me harm’—one harbors resentment; ‘he will do me harm’—one harbors resentment; ‘he has done harm to my beloved and agreeable one’—one harbors resentment… he is doing harm… he will do harm; ‘he has done good to my unloved and disagreeable one’—one harbors resentment… he is doing good… he will do good.\n\n\"The nine ways to remove resentment. ‘He has done me harm; what can be gained by that now?’—one removes resentment; ‘he is doing me harm; what can be gained by that now?’—one removes resentment; ‘he will do me harm; what can be gained by that now?’—one removes resentment; ‘he has done harm to my beloved and agreeable one… he is doing harm… he will do harm; what can be gained by that now?’—one removes resentment; ‘he has done good to my unloved and disagreeable one… he is doing good… he will do good; what can be gained by that now?’—one removes resentment.\"",
      "sinhala": "‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ, නව ධර්ම සමූහයක් මැනවින් දේශනා කරන ලදී; එහි සියල්ලන් විසින් ම එක්ව ගායනා කළ යුතුයි… දෙවියන්ට සහ මිනිසුන්ට යහපත පිණිස, හිත පිණිස, සැප පිණිස. නවය කවරේද? ‘‘නව ආඝාත වස්තූහු වෙති. ‘මට අනර්ථයක් කළේය’යි ආඝාතය බඳියි; ‘මට අනර්ථයක් කරන්නේය’යි ආඝාතය බඳියි; ‘මට අනර්ථයක් කරන්නේ ය’යි ආඝාතය බඳියි; ‘මාගේ ප්‍රිය මනාප පුද්ගලයාට අනර්ථයක් කළේය’යි ආඝාතය බඳියි… අනර්ථයක් කරන්නේයයි ආඝාතය බඳියි… අනර්ථයක් කරන්නේ යයි ආඝාතය බඳියි; ‘මාගේ අප්‍රිය අමනාප පුද්ගලයාට අර්ථයක් කළේය’යි ආඝාතය බඳියි… අර්ථයක් කරන්නේයයි ආඝාතය බඳියි… අර්ථයක් කරන්නේ යයි ආඝාතය බඳියි. ‘‘නව ආඝාත ප්‍ර‍තිවිනයෝ වෙති. ‘මට අනර්ථයක් කළේය, එය කෙසේ නම් මෙහි ලැබෙන්නේදැ’යි ආඝාතය දුරු කරන්නේය; ‘මට අනර්ථයක් කරන්නේය, එය කෙසේ නම් මෙහි ලැබෙන්නේදැ’යි ආඝාතය දුරු කරන්නේය; ‘මට අනර්ථයක් කරන්නේ ය, එය කෙසේ නම් මෙහි ලැබෙන්නේදැ’යි ආඝාතය දුරු කරන්නේය; ‘මාගේ ප්‍රිය මනාප පුද්ගලයාට අනර්ථයක් කළේය… අනර්ථයක් කරන්නේය… අනර්ථයක් කරන්නේ ය, එය කෙසේ නම් මෙහි ලැබෙන්නේදැ’යි ආඝාතය දුරු කරන්නේය; ‘මාගේ අප්‍රිය අමනාප පුද්ගලයාට අර්ථයක් කළේය… අර්ථයක් කරන්නේය… අර්ථයක් කරන්නේ ය, එය කෙසේ නම් මෙහි ලැබෙන්නේදැ’යි ආඝාතය දුරු කරන්නේය.",
      "paliTitle": "Navakaṃ",
      "englishTitle": "Chapter of Nines",
      "sinhalaTitle": "නවක වග්‍ගය"
    },
    {
      "number": 341,
      "pali": "‘‘Nava sattāvāsā. Santāvuso, sattā nānattakāyā nānattasaññino, seyyathāpi manussā ekacce ca devā ekacce ca vinipātikā. Ayaṃ paṭhamo sattāvāso. ‘‘Santāvuso, sattā nānattakāyā ekattasaññino, seyyathāpi devā brahmakāyikā paṭhamābhinibbattā. Ayaṃ dutiyo sattāvāso. ‘‘Santāvuso, sattā ekattakāyā nānattasaññino, seyyathāpi devā ābhassarā. Ayaṃ tatiyo sattāvāso. ‘‘Santāvuso, sattā ekattakāyā ekattasaññino, seyyathāpi devā subhakiṇhā. Ayaṃ catuttho sattāvāso. ‘‘Santāvuso, sattā asaññino appaṭisaṃvedino, seyyathāpi devā asaññasattā [asaññisattā (syā. kaṃ.)]. Ayaṃ pañcamo sattāvāso. ‘‘Santāvuso, sattā sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanūpagā. Ayaṃ chaṭṭho sattāvāso. ‘‘Santāvuso, sattā sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanūpagā. Ayaṃ sattamo sattāvāso. ‘‘Santāvuso, sattā sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcāññāyatanūpagā. Ayaṃ aṭṭhamo sattāvāso. ‘‘Santāvuso, sattā sabbaso ākiñcaññāyatanaṃ samatikkamma [samatikkamma santametaṃ paṇītametanti (syā. kaṃ.)] nevasaññānāsaññāyatanūpagā. Ayaṃ navamo sattāvāso.",
      "english": "\"There are, friends, nine abodes of beings. There are beings, friends, who are diverse in body and diverse in perception, such as human beings, some gods, and some beings in the states of woe. This is the first abode of beings.\n\n\"There are beings, friends, who are diverse in body but unified in perception, such as the gods of Brahmā's realm who are newly born. This is the second abode of beings.\n\n\"There are beings, friends, who are unified in body but diverse in perception, such as the gods of Streaming Radiance. This is the third abode of beings.\n\n\"There are beings, friends, who are unified in body and unified in perception, such as the gods of Refulgent Glory. This is the fourth abode of beings.\n\n\"There are beings, friends, who are unpercipient and devoid of sensation, such as the gods of Unconscious beings. This is the fifth abode of beings.\n\n\"There are beings, friends, who, with the complete surmounting of perceptions of form, with the disappearance of perceptions of resistance, and not attending to perceptions of diversity, thinking, ‘Infinite is space,’ reach the dimension of infinite space. This is the sixth abode of beings.\n\n\"There are beings, friends, who, with the complete surmounting of the dimension of infinite space, thinking, ‘Infinite is consciousness,’ reach the dimension of infinite consciousness. This is the seventh abode of beings.\n\n\"There are beings, friends, who, with the complete surmounting of the dimension of infinite consciousness, thinking, ‘There is nothing,’ reach the dimension of nothingness. This is the eighth abode of beings.\n\n\"There are beings, friends, who, with the complete surmounting of the dimension of nothingness, reach the dimension of neither-perception-nor-non-perception. This is the ninth abode of beings.\"",
      "sinhala": "‘‘ආවුසෝ, සත්වාවාස නවයකි. ආවුසෝ, නානාත්වූ කය ඇති, නානාත්වූ සංඥා ඇති සත්ත්වයෝ සිටිත්. එනම් මිනිස්සුද, ඇතැම් දෙවියෝද, ඇතැම් විනිපාතකයෝද වෙති. මෙය පළමුවන සත්වාවාසයයි. ‘‘ආවුසෝ, නානාත්වූ කය ඇති, ඒකාත්වූ සංඥා ඇති සත්ත්වයෝ සිටිත්. එනම් බ්‍රහ්මකායික දෙවියෝය. (ඔවුන්) පළමුව උපන්නාහුය. මෙය දෙවන සත්වාවාසයයි. ‘‘ආවුසෝ, ඒකාත්වූ කය ඇති, නානාත්වූ සංඥා ඇති සත්ත්වයෝ සිටිත්. එනම් ආභස්සර දෙවියෝය. මෙය තෙවන සත්වාවාසයයි. ‘‘ආවුසෝ, ඒකාත්වූ කය ඇති, ඒකාත්වූ සංඥා ඇති සත්ත්වයෝ සිටිත්. එනම් සුභකිණ්හ දෙවියෝය. මෙය සතරවන සත්වාවාසයයි. ‘‘ආවුසෝ, අසංඥවූ, ප්‍රතිසංවේදී නොවන සත්ත්වයෝ සිටිත්. එනම් අසඤ්ඤසත්ත නම් දෙවියෝය. මෙය පස්වන සත්වාවාසයයි. ‘‘ආවුසෝ, සියලු ආකාරයෙන් රූප සංඥාවන් ඉක්මවා, පටිඝ සංඥාවන්ගේ අස්ථංගමයෙන්, නානාත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන් ‘අනන්ත වූ ආකාශය’ යැයි ආකාශානඤ්චායතනයට පැමිණි සත්ත්වයෝ සිටිත්. මෙය සයවන සත්වාවාසයයි. ‘‘ආවුසෝ, සියලු ආකාරයෙන් ආකාශානඤ්චායතනය ඉක්මවා ‘අනන්ත වූ විඤ්ඤාණය’ යැයි විඤ්ඤාණඤ්චායතනයට පැමිණි සත්ත්වයෝ සිටිත්. මෙය සත්වන සත්වාවාසයයි. ‘‘ආවුසෝ, සියලු ආකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා ‘කිසිවක් නැත’ යැයි ආකිඤ්චඤ්ඤායතනයට පැමිණි සත්ත්වයෝ සිටිත්. මෙය අටවන සත්වාවාසයයි. ‘‘ආවුසෝ, සියලු ආකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණි සත්ත්වයෝ සිටිත්. මෙය නවවන සත්වාවාසයයි.",
      "paliTitle": ""
    },
    {
      "number": 342,
      "pali": "‘‘Nava akkhaṇā asamayā brahmacariyavāsāya. Idhāvuso, tathāgato ca loke uppanno hoti arahaṃ sammāsambuddho, dhammo ca desiyati opasamiko parinibbāniko sambodhagāmī sugatappavedito. Ayañca puggalo nirayaṃ upapanno hoti. Ayaṃ paṭhamo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ, āvuso, tathāgato ca loke uppanno hoti arahaṃ sammāsambuddho, dhammo ca desiyati opasamiko parinibbāniko sambodhagāmī sugatappavedito. Ayañca puggalo tiracchānayoniṃ upapanno hoti. Ayaṃ dutiyo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ…pe… pettivisayaṃ upapanno hoti. Ayaṃ tatiyo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ…pe… asurakāyaṃ upapanno hoti. Ayaṃ catuttho akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ…pe… aññataraṃ dīghāyukaṃ devanikāyaṃ upapanno hoti. Ayaṃ pañcamo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ…pe… paccantimesu janapadesu paccājāto hoti milakkhesu [milakkhakesu (syā. kaṃ.) milakkhūsu (ka.)] aviññātāresu, yattha natthi gati bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Ayaṃ chaṭṭho akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ…pe… majjhimesu janapadesu paccājāto hoti. So ca hoti micchādiṭṭhiko viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ [sukaṭa dukkaṭānaṃ (sī. pī.)] kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Ayaṃ sattamo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ…pe… majjhimesu janapadesu paccājāto hoti. So ca hoti duppañño jaḷo eḷamūgo, nappaṭibalo subhāsitadubbhāsitānamatthamaññātuṃ. Ayaṃ aṭṭhamo akkhaṇo asamayo brahmacariyavāsāya. ‘‘Puna caparaṃ, āvuso, tathāgato ca loke na [katthaci nakāro na dissati] uppanno hoti arahaṃ sammāsambuddho, dhammo ca na desiyati opasamiko parinibbāniko sambodhagāmī sugatappavedito. Ayañca puggalo majjhimesu janapadesu paccājāto hoti, so ca hoti paññavā ajaḷo aneḷamūgo, paṭibalo subhāsita-dubbhāsitānamatthamaññātuṃ. Ayaṃ navamo akkhaṇo asamayo brahmacariyavāsāya.",
      "english": "\"There are these nine inopportune times, times unsuitable for living the holy life. Here, a Tathāgata has arisen in the world, an Arahant, a Fully Enlightened One, and the Dhamma is taught, leading to peace, to Nibbana, to enlightenment, proclaimed by the Well-Gone One. But this person has been reborn in hell. This is the first inopportune time, a time unsuitable for living the holy life.\n\n\"Furthermore, a Tathāgata has arisen in the world, an Arahant, a Fully Enlightened One, and the Dhamma is taught, leading to peace, to Nibbana, to enlightenment, proclaimed by the Well-Gone One. But this person has been reborn in the animal realm. This is the second inopportune time, a time unsuitable for living the holy life.\n\n\"Furthermore... he has been reborn in the realm of ghosts. This is the third inopportune time, a time unsuitable for living the holy life.\n\n\"Furthermore... he has been reborn in the realm of demons. This is the fourth inopportune time, a time unsuitable for living the holy life.\n\n\"Furthermore... he has been reborn in some long-lived deva realm. This is the fifth inopportune time, a time unsuitable for living the holy life.\n\n\"Furthermore... he has been reborn in border regions among uncivilized people, where there is no access for bhikkhus, bhikkhunis, male lay followers, or female lay followers. This is the sixth inopportune time, a time unsuitable for living the holy life.\n\n\"Furthermore... he has been reborn in the central lands. But he is a holder of wrong view, of distorted vision, thinking: ‘There is no gift, no sacrifice, no offering; there is no fruit or result of good or bad actions; there is no this world, no other world; there is no mother, no father; there are no beings who are reborn spontaneously; there are no ascetics or brahmins in the world who have rightly practiced and realized this world and the other world for themselves through direct knowledge and then make them known.’ This is the seventh inopportune time, a time unsuitable for living the holy life.\n\n\"Furthermore... he has been reborn in the central lands. But he is stupid, dull, and mute, incapable of understanding the meaning of what is well-spoken or ill-spoken. This is the eighth inopportune time, a time unsuitable for living the holy life.\n\n\"Furthermore, a Tathāgata has not arisen in the world, an Arahant, a Fully Enlightened One, and the Dhamma is not taught, leading to peace, to Nibbana, to enlightenment, proclaimed by the Well-Gone One. But this person has been reborn in the central lands, and he is wise, not dull or mute, capable of understanding the meaning of what is well-spoken or ill-spoken. This is the ninth inopportune time, a time unsuitable for living the holy life.\"",
      "sinhala": "‘‘ආයුෂ්මතුන්, බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු අක‍්‍ෂණ නවයකි. ආයුෂ්මතුන්, මෙහි තථාගතයන් වහන්සේ අරහත් වූ සම්මා සම්බුද්ධ වූ ලෝකයෙහි උපන්නාහු වෙති. උපශමයට හේතු වන, පිරිනිවන් පාමිය හැකි, සම්බෝධියට ගමන් කරන, සුගතයන් විසින් දේශනා කරන ලද ධර්මය දේශනා කරනු ලැබේ. මේ පුද්ගලයා නිරයට පැමිණෙන්නේ ය. ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු පළමුවන අක‍්‍ෂණය යි.\n\n‘‘තවද, ආයුෂ්මතුන්, තථාගතයන් වහන්සේ අරහත් වූ සම්මා සම්බුද්ධ වූ ලෝකයෙහි උපන්නාහු වෙති. උපශමයට හේතු වන, පිරිනිවන් පාමිය හැකි, සම්බෝධියට ගමන් කරන, සුගතයන් විසින් දේශනා කරන ලද ධර්මය දේශනා කරනු ලැබේ. මේ පුද්ගලයා තිරිසන් යෝනියෙහි උපත ලබන්නේ ය. ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු දෙවන අක‍්‍ෂණය යි.\n\n‘‘තවද...පෙ... ප්‍රේත විෂයෙහි උපත ලබන්නේ ය. ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු තෙවන අක‍්‍ෂණය යි.\n\n‘‘තවද...පෙ... අසුර කායෙහි උපත ලබන්නේ ය. ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු සතරවන අක‍්‍ෂණය යි.\n\n‘‘තවද...පෙ... දීර්ඝායුෂ ඇති එක්තරා දෙවනිකායක උපත ලබන්නේ ය. ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු පස්වන අක‍්‍ෂණය යි.\n\n‘‘තවද...පෙ... ප්‍රත්‍යන්ත දේශවල ම්ලේච්ඡයන් අතර නොදන්නා තැනක උපත ලබන්නේ ය. භික්ෂූන්ට, භික්ෂුණීන්ට, උපාසකයන්ට, උපාසිකාවන්ට යාමට එහි මාර්ගයක් නැත. ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු සයවන අක‍්‍ෂණය යි.\n\n‘‘තවද...පෙ... මධ්‍යම ජනපදවල උපත ලබන්නේ ය. ඔහු මිථ්‍යාදෘෂ්ටිකයෙක් වෙයි. විපරීත දෘෂ්ටි ඇත්තේ වෙයි. ‘දෙන දෙයක් නැත. යාග කිරීමක් නැත. හෝම කිරීමක් නැත. සුකෘත දුෂ්කෘත කර්මවල විපාකයක් නැත. මේ ලෝකය නැත. පරලෝකය නැත. මවක් නැත. පියෙක් නැත. ඕපපාතික සත්වයෝ නැත. මේ ලෝකය හා පරලෝකය තමන්ගේම නුවණින් දැන ප්‍රත්‍යක්ෂ කරගෙන ප්‍රකාශ කරන සම්‍යක් වූ ගමන් ඇති, මනා පිළිවෙතෙහි යෙදුණු ශ්‍රමණ බ්‍රාහ්මණයෝ ලෝකයෙහි නැතැ’යි (කියයි). ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු සත්වන අක‍්‍ෂණය යි.\n\n‘‘තවද...පෙ... මධ්‍යම ජනපදවල උපත ලබන්නේ ය. ඔහු දුර්වල ප්‍රඥා ඇත්තේ ය. ජඩ ගොළුය. යහපත් ලෙස කී දෙයෙහිත්, අයහපත් ලෙස කී දෙයෙහිත් අර්ථය දැන ගැනීමට නොහැකි වෙයි. ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු අටවන අක‍්‍ෂණය යි.\n\n‘‘තවද, ආයුෂ්මතුන්, තථාගතයන් වහන්සේ අරහත් වූ සම්මා සම්බුද්ධ වූ ලෝකයෙහි උපන්නාහු නො වෙති. උපශමයට හේතු වන, පිරිනිවන් පාමිය හැකි, සම්බෝධියට ගමන් කරන, සුගතයන් විසින් දේශනා කරන ලද ධර්මය දේශනා කරනු නො ලැබේ. මේ පුද්ගලයා මධ්‍යම ජනපදවල උපත ලබන්නේ ය. ඔහු ප්‍රඥාවන්තයෙක් වෙයි. ජඩ ගොළු නොවෙයි. යහපත් ලෙස කී දෙයෙහිත්, අයහපත් ලෙස කී දෙයෙහිත් අර්ථය දැන ගැනීමට හැකි වෙයි. ආයුෂ්මතුන්, මෙය බ්‍රහ්මචර්යාවෙහි වාසය කිරීමට නුසුදුසු නවවන අක‍්‍ෂණය යි.",
      "paliTitle": ""
    },
    {
      "number": 343,
      "pali": "‘‘Nava anupubbavihārā. Idhāvuso, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā …pe… catutthaṃ jhānaṃ upasampajja viharati. Sabbaso rūpasaññānaṃ samatikkamā…pe… ākāsānañcāyatanaṃ upasampajja viharati. Sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati.",
      "english": "\"The nine successive abidings. Here, friend, a bhikkhu, quite secluded from sense pleasures, secluded from unwholesome states, enters and abides in the first jhana, which is accompanied by thought and examination, born of seclusion, filled with joy and happiness. Through the subsiding of thought and examination… he enters and abides in the second jhana… Through the fading away of joy… he enters and abides in the third jhana… Through the abandoning of pleasure… he enters and abides in the fourth jhana. Through the complete transcending of perceptions of form… he enters and abides in the sphere of infinite space. Through the complete transcending of the sphere of infinite space, thinking, ‘Consciousness is infinite,’ he enters and abides in the sphere of infinite consciousness. Through the complete transcending of the sphere of infinite consciousness, thinking, ‘There is nothing,’ he enters and abides in the sphere of nothingness. Through the complete transcending of the sphere of nothingness, he enters and abides in the sphere of neither-perception-nor-non-perception. Through the complete transcending of the sphere of neither-perception-nor-non-perception, he enters and abides in the cessation of perception and feeling.\"",
      "sinhala": "‘‘ආයුෂ්මතුනි, අනුපිළිවෙළින් පිළිවෙළින් එන නව විහරණ මෙසේයි. මෙහි, ආයුෂ්මතුනි, භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු වන ධ්‍යානය උපසම්පදා කරගෙන වාසය කරයි. විතර්ක විචාරයන්ගේ සංසිඳීමෙන්…පෙ… දෙවන ධ්‍යානය උපසම්පදා කරගෙන වාසය කරයි. ප්‍රීතියෙහිද විරාගයෙන්…පෙ… තුන්වන ධ්‍යානය උපසම්පදා කරගෙන වාසය කරයි. සැපයද ප්‍රහාණය කිරීමෙන්…පෙ… සතරවන ධ්‍යානය උපසම්පදා කරගෙන වාසය කරයි. සියලු ආකාරයෙන් රූප සංඥාවන් ඉක්මවා යාමෙන්…පෙ… ආකාශානඤ්චායතනය උපසම්පදා කරගෙන වාසය කරයි. සියලු ආකාරයෙන් ආකාශානඤ්චායතනය ඉක්මවා ගොස් ‘විඤ්ඤාණය අනන්තය’ යයි විඤ්ඤාණඤ්චායතනය උපසම්පදා කරගෙන වාසය කරයි. සියලු ආකාරයෙන් විඤ්ඤාණඤ්චායතනය ඉක්මවා ගොස් ‘කිසිවක් නැත’ යයි ආකිඤ්චඤ්ඤායතනය උපසම්පදා කරගෙන වාසය කරයි. සියලු ආකාරයෙන් ආකිඤ්චඤ්ඤායතනය ඉක්මවා ගොස් නේවසඤ්ඤානාසඤ්ඤායතනය උපසම්පදා කරගෙන වාසය කරයි. සියලු ආකාරයෙන් නේවසඤ්ඤානාසඤ්ඤායතනය ඉක්මවා ගොස් සංඥා වේදයිත නිරෝධය උපසම්පදා කරගෙන වාසය කරයි.",
      "paliTitle": ""
    },
    {
      "number": 344,
      "pali": "‘‘Nava anupubbanirodhā. Paṭhamaṃ jhānaṃ samāpannassa kāmasaññā niruddhā hoti. Dutiyaṃ jhānaṃ samāpannassa vitakkavicārā niruddhā honti. Tatiyaṃ jhānaṃ samāpannassa pīti niruddhā hoti. Catutthaṃ jhānaṃ samāpannassa assāsapassāssā niruddhā honti. Ākāsānañcāyatanaṃ samāpannassa rūpasaññā niruddhā hoti. Viññāṇañcāyatanaṃ samāpannassa ākāsānañcāyatanasaññā niruddhā hoti. Ākiñcaññāyatanaṃ samāpannassa viññāṇañcāyatanasaññā niruddhā hoti. Nevasaññānāsaññāyatanaṃ samāpannassa ākiñcaññāyatanasaññā niruddhā hoti. Saññāvedayitanirodhaṃ samāpannassa saññā ca vedanā ca niruddhā honti. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena nava dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. ",
      "english": "\"There are nine successive cessations. For one who has attained the first jhāna, perceptions of sensuality are ceased. For one who has attained the second jhāna, initial and sustained thought are ceased. For one who has attained the third jhāna, rapture is ceased. For one who has attained the fourth jhāna, inhalation and exhalation are ceased. For one who has attained the sphere of infinite space, perceptions of form are ceased. For one who has attained the sphere of infinite consciousness, perceptions of the sphere of infinite space are ceased. For one who has attained the sphere of nothingness, perceptions of the sphere of infinite consciousness are ceased. For one who has attained the sphere of neither perception nor non-perception, perceptions of the sphere of nothingness are ceased. For one who has attained the cessation of perception and feeling, both perception and feeling are ceased. These, friends, are the nine things well-proclaimed by that Blessed One, who knows, who sees, the Arahant, the perfectly enlightened Buddha. In this, all should recite together… for the benefit, for the welfare, for the happiness of gods and humans.\"",
      "sinhala": "‘‘අනුපූ‍ර්ව නිරෝධ නවයකි. පළමුවන ඣානය සමාපන්න වූ පුද්ගලයාගේ කාම සංඥාව නිරුද්ධ වේ. දෙවන ඣානය සමාපන්න වූ පුද්ගලයාගේ විතර්ක විචාර නිරුද්ධ වේ. තුන්වන ඣානය සමාපන්න වූ පුද්ගලයාගේ ප්‍රීතිය නිරුද්ධ වේ. සිව්වන ඣානය සමාපන්න වූ පුද්ගලයාගේ ආශ්වාස ප්‍රාශ්වාස නිරුද්ධ වේ. ආකාසානඤ්චායතනය සමාපන්න වූ පුද්ගලයාගේ රූප සංඥාව නිරුද්ධ වේ. විඤ්ඤාණඤ්චායතනය සමාපන්න වූ පුද්ගලයාගේ ආකාසානඤ්චායතන සංඥාව නිරුද්ධ වේ. ආකිඤ්චඤ්ඤායතනය සමාපන්න වූ පුද්ගලයාගේ විඤ්ඤාණඤ්චායතන සංඥාව නිරුද්ධ වේ. නෙවසඤ්ඤානාසඤ්ඤායතනය සමාපන්න වූ පුද්ගලයාගේ ආකිඤ්චඤ්ඤායතන සංඥාව නිරුද්ධ වේ. සඤ්ඤා වේදයිත නිරෝධය සමාපන්න වූ පුද්ගලයාගේ සංඥාව සහ වේදනාව නිරුද්ධ වේ.\n\n‘‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් මේ ධර්ම නවය මැනවින් දේශනා කරන ලදී. එහිදී සියල්ලන් විසින්ම සාංගායනා කළ යුතුයි. දෙවියන් හා මිනිසුන්ගේ අර්ථය පිණිස, හිත සුව පිණිස වේ.",
      "paliTitle": ""
    },
    {
      "number": 345,
      "pali": "‘‘Atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena dasa dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ…pe… atthāya hitāya sukhāya devamanussānaṃ. Katame dasa? ‘‘Dasa nāthakaraṇā dhammā. Idhāvuso, bhikkhu sīlavā hoti. Pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī samādāya sikkhati sikkhāpadesu. Yaṃpāvuso, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati, ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī samādāya sikkhati sikkhāpadesu. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu bahussuto hoti sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthā sabyañjanā [sātthaṃ sabyañjanaṃ (sī. syā. pī.)] kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti [dhatā (ka. sī. syā. kaṃ.)] dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, yaṃpāvuso, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. Yaṃpāvuso, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato khamo padakkhiṇaggāhī anusāsaniṃ. Yaṃpāvuso, bhikkhu suvaco hoti…pe… padakkhiṇaggāhī anusāsaniṃ. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni, tattha dakkho hoti analaso tatrupāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātuṃ. Yaṃpāvuso, bhikkhu yāni tāni sabrahmacārīnaṃ…pe… alaṃ saṃvidhātuṃ. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo [uḷārapāmujjo (sī. pī.), oḷārapāmojjo (syā. kaṃ.)]. Yaṃpāvuso, bhikkhu dhammakāmo hoti…pe… uḷārapāmojjo [uḷārapāmujjo (sī. pī.), oḷārapāmojjo (syā. kaṃ.)]. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu santuṭṭho hoti itarītarehi cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārehi. Yaṃpāvuso, bhikkhu santuṭṭho hoti… pe… parikkhārehi. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yaṃpāvuso, bhikkhu āraddhavīriyo viharati…pe… anikkhittadhuro kusalesu dhammesu. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā. Yaṃpāvuso, bhikkhu satimā hoti…pe… saritā anussaritā. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, āvuso, bhikkhu paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammādukkhakkhayagāminiyā. Yaṃpāvuso, bhikkhu paññavā hoti…pe… sammādukkhakkhayagāminiyā. Ayampi dhammo nāthakaraṇo.",
      "english": "\"Friend, these ten qualities have been well proclaimed by the Blessed One, the knowing, seeing, worthy, fully enlightened one. All should recite them together…for the benefit, welfare, and happiness of gods and humans. Which ten? The ten qualities that are a refuge. Here, friend, a monk is virtuous. He dwells restrained by the Patimokkha restraint, endowed with conduct and suitable resorts, seeing danger in slight faults, he trains himself in the training rules. And that, friend, a monk is virtuous, dwells restrained by the Patimokkha restraint, endowed with conduct and suitable resorts, seeing danger in slight faults, he trains himself in the training rules, this quality too is a refuge.\n\n\"Furthermore, friend, a monk is very learned, a master of the teachings, a storehouse of the teachings. Those teachings that are good in the beginning, good in the middle, and good in the end, with meaning and phrasing, declaring the holy life that is utterly complete and pure—teachings of this sort are much listened to by him, borne in mind, recited verbally, examined in mind, and well-penetrated by view. And that, friend, a monk is very learned…well-penetrated by view, this quality too is a refuge.\n\n\"Furthermore, friend, a monk has good friends, good companions, good comrades. And that, friend, a monk has good friends, good companions, good comrades, this quality too is a refuge.\n\n\"Furthermore, friend, a monk is easy to speak to, endowed with qualities that make one easy to speak to, patient, receptive in accepting instruction. And that, friend, a monk is easy to speak to…receptive in accepting instruction, this quality too is a refuge.\n\n\"Furthermore, friend, a monk is skilled and tireless in whatever various tasks there are for his fellows in the holy life, being endowed with an investigation into the means for doing them, able to do them, able to manage them. And that, friend, a monk is skilled in whatever various tasks there are for his fellows in the holy life…able to manage them, this quality too is a refuge.\n\n\"Furthermore, friend, a monk is one who loves the Dhamma, one whose utterances are pleasing, with surpassing joy in the Abhidhamma and the Abhivinaya. And that, friend, a monk is one who loves the Dhamma…with surpassing joy, this quality too is a refuge.\n\n\"Furthermore, friend, a monk is content with whatever robes, alms food, lodgings, and medicines and provisions for the sick there may be. And that, friend, a monk is content…with provisions, this quality too is a refuge.\n\n\"Furthermore, friend, a monk dwells with aroused energy for abandoning unwholesome qualities and for attaining wholesome qualities, firm, strong in effort, not shirking his duty in wholesome qualities. And that, friend, a monk dwells with aroused energy…not shirking his duty in wholesome qualities, this quality too is a refuge.\n\n\"Furthermore, friend, a monk is mindful, endowed with supreme mindfulness and discrimination, remembering and recollecting what was done long ago, what was said long ago. And that, friend, a monk is mindful…remembering and recollecting, this quality too is a refuge.\n\n\"Furthermore, friend, a monk is wise, endowed with wisdom regarding arising and passing away, noble, penetrative, leading to the complete destruction of suffering. And that, friend, a monk is wise…leading to the complete destruction of suffering, this quality too is a refuge.\"",
      "sinhala": "‘‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් දස ධර්ම මැනවින් දේශනා කරන ලදී. එහි සියල්ලන් විසින් ම එක්ව ගායනා කළ යුතුය. දෙව් මිනිසුන්ට හිතසුව පිණිස වේ. කවර දශය ද යත්: ‘‘නාථකරණ ධර්ම දශයකි. ඇවැත්නි, මෙහි භික්ෂුව සිල්වත් වේ. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ වාසය කරයි. ආචාර ගෝචර සම්පන්න ව කුඩා වරදෙහි පවා භය දක්නා සුලූ වේ. සමාදන් ව ශික්ෂාපදයන්හි හික්මෙයි. ඇවැත්නි, යම් භික්ෂුවක් සිල්වත් වේ ද, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ වාසය කරයි ද, ආචාර ගෝචර සම්පන්න ව කුඩා වරදෙහි පවා භය දක්නා සුලූ වේ ද, සමාදන් ව ශික්ෂාපදයන්හි හික්මෙයි ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, භික්ෂුව බහුශ්‍රැත වේ. ඇසූ ධර්මය දරන සුලූ වේ. ඇසූ ධර්මය රැස් කරන සුලූ වේ. යම් ධර්ම කෙනෙක් මුල යහපත් ද, මැද යහපත් ද, කෙළවර යහපත් ද, අර්ථ සහිත ද, ව්‍යංජන සහිත ද, සියලු ආකාරයෙන් පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කෙරෙත් ද, එබඳු ධර්ම ඔහුට බොහෝ ඇසූ පිරූ තැන් ඇති ඒවා වෙයි. වචනයෙන් දරා සිටී. මනසින් පිරික්සා බලන ලද්දේ වේ. නුවණින් මැනවින් විනිවිද දකින ලද්දේ වේ. ඇවැත්නි, යම් භික්ෂුවක් බහුශ්‍රැත වේ ද, නුවණින් මැනවින් විනිවිද දකින ලද්දේ වේ ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, භික්ෂුව කල්‍යාණ මිත්‍රයා ඇතියෙක් වේ. කල්‍යාණ සහායකයා ඇතියෙක් වේ. කල්‍යාණ සම්පවංකයෙක් වේ. ඇවැත්නි, යම් භික්ෂුවක් කල්‍යාණ මිත්‍රයා ඇතියෙක් වේ ද, කල්‍යාණ සහායකයා ඇතියෙක් වේ ද, කල්‍යාණ සම්පවංකයෙක් වේ ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, භික්ෂුව මනා වචන ඇත්තෙක් වේ. මනා වචන පිළිගැනීමේ ධර්මයන්ගෙන් සමන්විත වේ. ඉවසිලිවන්ත වේ. දක්ෂිණාග්‍රාහී වේ. අනුශාසනා පිළිගන්නා සුලූ වේ. ඇවැත්නි, යම් භික්ෂුවක් මනා වචන ඇත්තෙක් වේ ද, දක්ෂිණාග්‍රාහී වේ ද, අනුශාසනා පිළිගන්නා සුලූ වේ ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, යම් ඒ සබ්‍රහ්මචාරීන්ගේ උස් පහත් කටයුතු වෙත් ද, එහි දක්ෂ වේ. කම්මැලි නැත්තේ වේ. එහි ඒ ඒ උපායට විමසීමෙන් යුක්ත වේ. කිරීමට සමත් වේ. මැනවින් සංවිධානය කිරීමට සමත් වේ. ඇවැත්නි, යම් භික්ෂුවක් ඒ සබ්‍රහ්මචාරීන්ගේ කටයුතුවල දී කිරීමට සමත් වේ ද, මැනවින් සංවිධානය කිරීමට සමත් වේ ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, භික්ෂුව ධර්මකාමී වේ. ප්‍රිය වචන කථා කරන්නෙක් වේ. අභිධර්මයෙහි, අභිවිනයෙහි උදාර ප්‍රමෝද ඇත්තේ වේ. ඇවැත්නි, යම් භික්ෂුවක් ධර්මකාමී වේ ද, උදාර ප්‍රමෝද ඇත්තේ වේ ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, භික්ෂුව ලැබුණු දෙයින් සතුටු වේ. යම් පමණකින් සතුටු වේ ද, ඒ වනාහි සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකරින් සතුටු වන සුලූ වේ. ඇවැත්නි, යම් භික්ෂුවක් ලැබුණු දෙයින් සතුටු වේ ද, පිරිකරින් සතුටු වන සුලූ වේ ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, භික්ෂුව අකුසල ධර්මයන් දුරු කිරීම පිණිස ද, කුසල ධර්මයන් උපදවා ගැනීම පිණිස ද වීරිය ආරම්භ කළේ වාසය කරයි. බලවත් වේ. දැඩි උත්සාහ ඇත්තේ වේ. කුසල ධර්මයන්හිලා අත් නොහරින ලද වීර්ය ඇත්තේ වේ. ඇවැත්නි, යම් භික්ෂුවක් වීර්ය ආරම්භ කළේ වාසය කරයි ද, කුසල ධර්මයන්හිලා අත් නොහරින ලද වීර්ය ඇත්තේ වේ ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, භික්ෂුව සිහි ඇත්තේ වේ. උතුම් වූ සිහියෙන් හා නුවණින් යුක්ත වේ. බොහෝ කලක් කළ ද, බොහෝ කලක් කී ද සිහි කරන්නෙක් වේ. නැවත නැවත සිහි කරන්නෙක් වේ. ඇවැත්නි, යම් භික්ෂුවක් සිහි ඇත්තේ වේ ද, නැවත නැවත සිහි කරන්නෙක් වේ ද, මෙය ද නාථකරණ ධර්මයකි. ‘‘තවද ඇවැත්නි, භික්ෂුව ප්‍රඥාවන්ත වේ. නැතිවීමත්, හට ගැනීමත් යන දෙක දකින ප්‍රඥාවෙන් යුක්ත වේ. ආර්ය වූ කෙලෙස් සිඳින ප්‍රඥාවෙන් යුක්ත වේ. මනා කොට දුක් කෙළවර කිරීම පිණිස පවත්නා ප්‍රඥාවෙන් යුක්ත වේ. ඇවැත්නි, යම් භික්ෂුවක් ප්‍රඥාවන්ත වේ ද, මනා කොට දුක් කෙළවර කිරීම පිණිස පවත්නා ප්‍රඥාවෙන් යුක්ත වේ ද, මෙය ද නාථකරණ ධර්මයකි.",
      "paliTitle": "Dasakaṃ",
      "englishTitle": "The Decad",
      "sinhalaTitle": "දශකය"
    },
    {
      "number": 346,
      "pali": "Dasa kasiṇāyatanāni. Pathavīkasiṇameko sañjānāti, uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Āpokasiṇameko sañjānāti…pe… tejokasiṇameko sañjānāti… vāyokasiṇameko sañjānāti… nīlakasiṇameko sañjānāti… pītakasiṇameko sañjānāti… lohitakasiṇameko sañjānāti… odātakasiṇameko sañjānāti… ākāsakasiṇameko sañjānāti… viññāṇakasiṇameko sañjānāti, uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ.",
      "english": "The ten kasina-spheres: One perceives the earth-kasina, above, below, across, undivided, without limit. One perceives the water-kasina… One perceives the fire-kasina… One perceives the air-kasina… One perceives the blue-kasina… One perceives the yellow-kasina… One perceives the red-kasina… One perceives the white-kasina… One perceives the space-kasina… One perceives the consciousness-kasina, above, below, across, undivided, without limit.",
      "sinhala": "දස කසිණායතන නම්: එකෙක් පඨවී කසිණය ‘උඩ යට සරස නොදෙක අප්‍රමාණ’ වශයෙන් සඤ්ඤා කරයි. එකෙක් ආපෝ කසිණය… එකෙක් තේජෝ කසිණය… එකෙක් වායෝ කසිණය… එකෙක් නීල කසිණය… එකෙක් පීත කසිණය… එකෙක් ලෝහිත කසිණය… එකෙක් ඕදාත කසිණය… එකෙක් ආකාශ කසිණය… එකෙක් විඤ්ඤාණ කසිණය ‘උඩ යට සරස නොදෙක අප්‍රමාණ’ වශයෙන් සඤ්ඤා කරයි.",
      "paliTitle": ""
    },
    {
      "number": 347,
      "pali": "‘‘Dasa akusalakammapathā – pāṇātipāto, adinnādānaṃ, kāmesumicchācāro, musāvādo, pisuṇā vācā, pharusā vācā, samphappalāpo, abhijjhā, byāpādo, micchādiṭṭhi. ‘‘Dasa kusalakammapathā – pāṇātipātā veramaṇī, adinnādānā veramaṇī, kāmesumicchācārā veramaṇī, musāvādā veramaṇī, pisuṇāya vācāya veramaṇī, pharusāya vācāya veramaṇī, samphappalāpā veramaṇī, anabhijjhā, abyāpādo, sammādiṭṭhi.",
      "english": "\"The ten courses of unwholesome action are: the taking of life, taking what is not given, misconduct in sexual pleasures, false speech, divisive speech, harsh speech, idle chatter, covetousness, ill will, and wrong view. The ten courses of wholesome action are: abstaining from taking life, abstaining from taking what is not given, abstaining from misconduct in sexual pleasures, abstaining from false speech, abstaining from divisive speech, abstaining from harsh speech, abstaining from idle chatter, non-covetousness, non-ill will, and right view.\"",
      "sinhala": "“අකුසල කර්මපථ දසයකි. එනම් ප්‍රාණඝාතය, අදත්තාදානය, කාමයේහි මිථ්‍යාචාරය, මුසාවාදය, පිසුණු වචනය, පරුෂ වචනය, සම්ඵප්‍රලාපය, අභිධ්‍යාව, ව්‍යාපාදය, මිථ්‍යාදෘෂ්ටිය යන ඒවායි. කුසල කර්මපථ දසයකි. එනම් ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමයේහි මිථ්‍යාචාරයෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, පිසුණු වචනයෙන් වැළකීම, පරුෂ වචනයෙන් වැළකීම, සම්ඵප්‍රලාපයෙන් වැළකීම, අනභිධ්‍යාව, අව්‍යාපාදය, සම්මාදිට්ඨිය යන ඒවායි.”",
      "paliTitle": ""
    },
    {
      "number": 348,
      "pali": "‘‘Dasa ariyavāsā. Idhāvuso, bhikkhu pañcaṅgavippahīno hoti, chaḷaṅgasamannāgato, ekārakkho, caturāpasseno, paṇunnapaccekasacco, samavayasaṭṭhesano, anāvilasaṅkappo, passaddhakāyasaṅkhāro, suvimuttacitto, suvimuttapañño. ‘‘Kathañcāvuso, bhikkhu pañcaṅgavippahīno hoti? Idhāvuso, bhikkhuno kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ pahīnaṃ hoti, uddhaccakukuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Evaṃ kho, āvuso, bhikkhu pañcaṅgavippahīno hoti. ‘‘Kathañcāvuso, bhikkhu chaḷaṅgasamannāgato hoti? Idhāvuso, bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā…pe… manasā dhammaṃ viññāya neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Evaṃ kho, āvuso, bhikkhu chaḷaṅgasamannāgato hoti. ‘‘Kathañcāvuso, bhikkhu ekārakkho hoti? Idhāvuso, bhikkhu satārakkhena cetasā samannāgato hoti. Evaṃ kho, āvuso, bhikkhu ekārakkho hoti. ‘‘Kathañcāvuso, bhikkhu caturāpasseno hoti? Idhāvuso, bhikkhu saṅkhāyekaṃ paṭisevati, saṅkhāyekaṃ adhivāseti, saṅkhāyekaṃ parivajjeti, saṅkhāyekaṃ vinodeti. Evaṃ kho, āvuso, bhikkhu caturāpasseno hoti. ‘‘Kathañcāvuso, bhikkhu paṇunnapaccekasacco hoti? Idhāvuso, bhikkhuno yāni tāni puthusamaṇabrāhmaṇānaṃ puthupaccekasaccāni, sabbāni tāni nunnāni honti paṇunnāni cattāni vantāni muttāni pahīnāni paṭinissaṭṭhāni. Evaṃ kho, āvuso, bhikkhu paṇunnapaccekasacco hoti. ‘‘Kathañcāvuso, bhikkhu samavayasaṭṭhesano hoti? Idhāvuso, bhikkhuno kāmesanā pahīnā hoti, bhavesanā pahīnā hoti, brahmacariyesanā paṭippassaddhā. Evaṃ kho, āvuso, bhikkhu samavayasaṭṭhesano hoti. ‘‘Kathañcāvuso, bhikkhu anāvilasaṅkappo hoti? Idhāvuso, bhikkhuno kāmasaṅkappo pahīno hoti, byāpādasaṅkappo pahīno hoti, vihiṃsāsaṅkappo pahīno hoti. Evaṃ kho, āvuso, bhikkhu anāvilasaṅkappo hoti. ‘‘Kathañcāvuso, bhikkhu passaddhakāyasaṅkhāro hoti? Idhāvuso, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Evaṃ kho, āvuso, bhikkhu passaddhakāyasaṅkhāro hoti. ‘‘Kathañcāvuso, bhikkhu suvimuttacitto hoti? Idhāvuso, bhikkhuno rāgā cittaṃ vimuttaṃ hoti, dosā cittaṃ vimuttaṃ hoti, mohā cittaṃ vimuttaṃ hoti. Evaṃ kho, āvuso, bhikkhu suvimuttacitto hoti. ‘‘Kathañcāvuso, bhikkhu suvimuttapañño hoti? Idhāvuso, bhikkhu ‘rāgo me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti. ‘Doso me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti. ‘Moho me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti. Evaṃ kho, āvuso, bhikkhu suvimuttapañño hoti. ‘‘Dasa asekkhā dhammā – asekkhā sammādiṭṭhi, asekkho sammāsaṅkappo, asekkhā sammāvācā, asekkho sammākammanto, asekkho sammāājīvo, asekkho sammāvāyāmo, asekkhā sammāsati, asekkho sammāsamādhi, asekkhaṃ sammāñāṇaṃ, asekkhā sammāvimutti. ‘‘Ime kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena dasa dhammā sammadakkhātā. Tattha sabbeheva saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti.",
      "english": "\"There are ten noble abodes. Here, a bhikkhu, freed from five factors, possesses six factors, is guarded by one thing, has four supports, has discarded individual truths, has cut off craving connected with togetherness, has undefiled intentions, has calmed bodily formation, is well-liberated in mind, and is well-liberated in wisdom.\"\n\n\"And how, friend, is a bhikkhu freed from five factors? Here, friend, a bhikkhu has abandoned sensual desire, has abandoned ill-will, has abandoned sloth and torpor, has abandoned restlessness and remorse, has abandoned doubt. In this way, friend, a bhikkhu is freed from five factors.\"\n\n\"And how, friend, does a bhikkhu possess six factors? Here, friend, a bhikkhu, having seen a form with the eye, is neither glad nor sad, but dwells with equanimity, mindful and fully aware. Having heard a sound with the ear… having cognized a phenomenon with the mind, he is neither glad nor sad, but dwells with equanimity, mindful and fully aware. In this way, friend, a bhikkhu possesses six factors.\"\n\n\"And how, friend, is a bhikkhu guarded by one thing? Here, friend, a bhikkhu is endowed with a mind guarded by mindfulness. In this way, friend, a bhikkhu is guarded by one thing.\"\n\n\"And how, friend, does a bhikkhu have four supports? Here, friend, a bhikkhu wisely makes use of one thing, wisely endures one thing, wisely avoids one thing, wisely dispels one thing. In this way, friend, a bhikkhu has four supports.\"\n\n\"And how, friend, has a bhikkhu discarded individual truths? Here, friend, whatever individual truths there are of various ascetics and brahmins, all of them are rejected, discarded, given up, relinquished, abandoned, and relinquished. In this way, friend, a bhikkhu has discarded individual truths.\"\n\n\"And how, friend, has a bhikkhu cut off craving connected with togetherness? Here, friend, a bhikkhu has abandoned craving for sensual pleasures, has abandoned craving for existence, and craving connected with the holy life is calmed. In this way, friend, a bhikkhu has cut off craving connected with togetherness.\"\n\n\"And how, friend, does a bhikkhu have undefiled intentions? Here, friend, a bhikkhu has abandoned sensual thoughts, has abandoned thoughts of ill-will, has abandoned thoughts of harming. In this way, friend, a bhikkhu has undefiled intentions.\"\n\n\"And how, friend, has a bhikkhu calmed bodily formation? Here, friend, a bhikkhu, with the abandoning of pleasure and pain, and with the previous disappearance of joy and sorrow, enters and abides in the fourth jhana, which is neither painful nor pleasant and is the purity of mindfulness due to equanimity. In this way, friend, a bhikkhu has calmed bodily formation.\"\n\n\"And how, friend, is a bhikkhu well-liberated in mind? Here, friend, a bhikkhu's mind is liberated from greed, his mind is liberated from hatred, his mind is liberated from delusion. In this way, friend, a bhikkhu is well-liberated in mind.\"\n\n\"And how, friend, is a bhikkhu well-liberated in wisdom? Here, friend, a bhikkhu understands, 'Greed in me is abandoned, its root is cut off, made like a palm stump, obliterated, not liable to arise again.' He understands, 'Hatred in me is abandoned, its root is cut off, made like a palm stump, obliterated, not liable to arise again.' He understands, 'Delusion in me is abandoned, its root is cut off, made like a palm stump, obliterated, not liable to arise again.' In this way, friend, a bhikkhu is well-liberated in wisdom.\"\n\n\"There are ten trainings for one beyond training: right view for one beyond training, right thought for one beyond training, right speech for one beyond training, right action for one beyond training, right livelihood for one beyond training, right effort for one beyond training, right mindfulness for one beyond training, right concentration for one beyond training, right knowledge for one beyond training, right liberation for one beyond training.\"\n\n\"These ten qualities, friend, have been well-proclaimed by that Blessed One, who knows, who sees, the worthy one, the rightly self-awakened one. About these, all should come together and not dispute, so that this holy life may be long-lasting, of long duration, for the benefit of many people, for the happiness of many people, out of compassion for the world, for the welfare, benefit, and happiness of gods and humans.\"",
      "sinhala": "‘‘ආයුෂ්මතුනි, ආර්‍යාවාස දසයකි. ආයුෂ්මතුනි, මෙහි භික්ෂුව පඤ්චංගයන්ගෙන් ප්‍රහීණ වූයේ වෙයි, ෂඩංගයන්ගෙන් සමන්විත වූයේ වෙයි, එක ආරක්ෂා ඇත්තේ වෙයි, චතුරාපස්සෙනය ඇත්තේ වෙයි, පණුණ පච්චේක සත්‍යය ඇත්තේ වෙයි, සමවය සට්ඨේෂණය ඇත්තේ වෙයි, අනාවිල සංකල්ප ඇත්තේ වෙයි, ප්‍රශ්‍රද්ධ කාය සංස්කාර ඇත්තේ වෙයි, මනාව විමුක්ත වූ චිත්ත ඇත්තේ වෙයි, මනාව විමුක්ත වූ ප්‍රඥා ඇත්තේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ පඤ්චංගයන්ගෙන් ප්‍රහීණ වූයේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුවගේ කාමච්ඡන්දය ප්‍රහීණ වන්නේ වෙයි, ව්‍යාපාදය ප්‍රහීණ වන්නේ වෙයි, ථීනමිද්ධය ප්‍රහීණ වන්නේ වෙයි, උද්ධච්ච කුකුච්චය ප්‍රහීණ වන්නේ වෙයි, විචිකිච්ඡාව ප්‍රහීණ වන්නේ වෙයි. ආයුෂ්මතුනි, මෙසේ භික්ෂුව පඤ්චංගයන්ගෙන් ප්‍රහීණ වූයේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ ෂඩංගයන්ගෙන් සමන්විත වූයේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුව ඇසින් රූපයක් දැක සතුටු වන්නේත් නැත, අසතුටු වන්නේත් නැත, සිහියෙන් හා නුවණින් යුක්තව උපේක්ෂා සහගතව වාසය කරයි. කණින් ශබ්දයක් අසා…පෙ… මනසින් ධර්මයක් දැන සතුටු වන්නේත් නැත, අසතුටු වන්නේත් නැත, සිහියෙන් හා නුවණින් යුක්තව උපේක්ෂා සහගතව වාසය කරයි. ආයුෂ්මතුනි, මෙසේ භික්ෂුව ෂඩංගයන්ගෙන් සමන්විත වූයේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ එක ආරක්ෂා ඇත්තේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුව සිහි නමැති ආරක්ෂාව ඇති සිතින් සමන්විත වූයේ වෙයි. ආයුෂ්මතුනි, මෙසේ භික්ෂුව එක ආරක්ෂා ඇත්තේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ චතුරාපස්සෙනය ඇත්තේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුව නුවණින් විමසා එකක් සේවනය කරයි, නුවණින් විමසා එකක් ඉවසයි, නුවණින් විමසා එකක් වර්ජනය කරයි, නුවණින් විමසා එකක් දුරු කරයි. ආයුෂ්මතුනි, මෙසේ භික්ෂුව චතුරාපස්සෙනය ඇත්තේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ පණුණ පච්චේක සත්‍යය ඇත්තේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුවගේ යම් ඒ පෘථග්ජන ශ්‍ර‍මණ බ්‍රාහ්මණයන්ගේ නොයෙක් පච්චේක සත්‍යයෝ වෙත් ද, ඒ සියල්ලෝ නුන්නාහු වෙති, පණුණාහු වෙති, දුරුකරන ලද්දාහු වෙති, අත්හරින ලද්දාහු වෙති, ප්‍ර‍හීණ කරන ලද්දාහු වෙති, ප්‍රතිනිඃස්සරණය කරන ලද්දාහු වෙති. ආයුෂ්මතුනි, මෙසේ භික්ෂුව පණුණ පච්චේක සත්‍යය ඇත්තේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ සමවය සට්ඨේෂණය ඇත්තේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුවගේ කාමේෂණාව ප්‍රහීණ වන්නේ වෙයි, භවේෂණාව ප්‍රහීණ වන්නේ වෙයි, බ්‍ර‍හ්මචරියේෂණාව සංසිඳෙන්නේ වෙයි. ආයුෂ්මතුනි, මෙසේ භික්ෂුව සමවය සට්ඨේෂණය ඇත්තේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ අනාවිල සංකල්ප ඇත්තේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුවගේ කාම සංකල්පය ප්‍රහීණ වන්නේ වෙයි, ව්‍යාපාද සංකල්පය ප්‍රහීණ වන්නේ වෙයි, විහිංසා සංකල්පය ප්‍රහීණ වන්නේ වෙයි. ආයුෂ්මතුනි, මෙසේ භික්ෂුව අනාවිල සංකල්ප ඇත්තේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ ප්‍රශ්‍රද්ධ කාය සංස්කාර ඇත්තේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුව සැපයෙහි ද පහ වීමෙන් දුකෙහි ද පහ වීමෙන් සොම්නස් දොම්නස් දෙදෙනාගේ පළමුවෙන් ම නැසීමෙන් දුක් ද නොවූ සැප ද නොවූ උපේක්ෂා සිහි පිරිසිදු බව ඇති සතර වන ධ්‍යානයට පැමිණ වාසය කරයි. ආයුෂ්මතුනි, මෙසේ භික්ෂුව ප්‍රශ්‍රද්ධ කාය සංස්කාර ඇත්තේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ මනාව විමුක්ත වූ චිත්ත ඇත්තේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුවගේ රාගයෙන් සිත මිදුණේ වෙයි, ද්වේෂයෙන් සිත මිදුණේ වෙයි, මෝහයෙන් සිත මිදුණේ වෙයි. ආයුෂ්මතුනි, මෙසේ භික්ෂුව මනාව විමුක්ත වූ චිත්ත ඇත්තේ වෙයි. ‘‘ආයුෂ්මතුනි, භික්ෂුව කෙසේ මනාව විමුක්ත වූ ප්‍ර‍ඥා ඇත්තේ වේ ද? ආයුෂ්මතුනි, මෙහි භික්ෂුව ‘මාගේ රාගය ප්‍ර‍හීණ කරන ලද්දේ ය, මුල් සිඳින ලද්දේ ය, තල් ගසක් මෙන් මුලින් උදුරන ලද්දේ ය, නැවත භවයක් ගැනීමට නොහැකි කරන ලද්දේ ය, මතු නැවත නූපදින ස්වභාව ඇත්තේ ය’යි දනී. ‘මාගේ ද්වේෂය ප්‍ර‍හීණ කරන ලද්දේ ය, මුල් සිඳින ලද්දේ ය, තල් ගසක් මෙන් මුලින් උදුරන ලද්දේ ය, නැවත භවයක් ගැනීමට නොහැකි කරන ලද්දේ ය, මතු නැවත නූපදින ස්වභාව ඇත්තේ ය’යි දනී. ‘මාගේ මෝහය ප්‍ර‍හීණ කරන ලද්දේ ය, මුල් සිඳින ලද්දේ ය, තල් ගසක් මෙන් මුලින් උදුරන ලද්දේ ය, නැවත භවයක් ගැනීමට නොහැකි කරන ලද්දේ ය, මතු නැවත නූපදින ස්වභාව ඇත්තේ ය’යි දනී. ආයුෂ්මතුනි, මෙසේ භික්ෂුව මනාව විමුක්ත වූ ප්‍ර‍ඥා ඇත්තේ වෙයි. ‘‘අශෛක්ෂ ධර්ම දශයකි. එනම්, අශෛක්ෂ සම්‍යක්දෘෂ්ටිය, අශෛක්ෂ සම්‍යක්සංකල්පය, අශෛක්ෂ සම්‍යක්වචනය, අශෛක්ෂ සම්‍යක්කර්මාන්තය, අශෛක්ෂ සම්‍යක්ආජීවය, අශෛක්ෂ සම්‍යක්ව්‍යායාමය, අශෛක්ෂ සම්‍යක්ස්මෘතිය, අශෛක්ෂ සම්‍යක්සමාධිය, අශෛක්ෂ සම්‍යක්ඥානය, අශෛක්ෂ සම්‍යක්විමුක්තිය යනුයි. ‘‘ආයුෂ්මතුනි, ඒ භාග්‍යවතුන් වහන්සේ විසින් දන්නා වූ ද දක්නා වූ ද අර්‍හත් වූ ද සම්මා සම්බුද්ධ වූ ද ඒ භාග්‍යවතුන් වහන්සේ විසින් මේ දශ ධර්මයෝ මැනවින් දේශනා කරන ලදහ. එහි සියල්ලෝ විසින් ම එක්ව ගායනා කළ යුතු ය, විවාද නොකළ යුතු ය, යම් හෙයකින් මේ බ්‍ර‍හ්මචර්‍යාව බොහෝ කල් පවත්නේ වන්නේ ද, චිරස්ථිතියක් වන්නේ ද, එය බොහෝ ජනයාගේ හිත පිණිස, බොහෝ ජනයාගේ සැප පිණිස, ලෝකානුකම්පාව පිණිස, දෙව් මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැප පිණිස වන්නේ ය.’’",
      "paliTitle": ""
    },
    {
      "number": 349,
      "pali": "Atha kho bhagavā uṭṭhahitvā āyasmantaṃ sāriputtaṃ āmantesi – ‘sādhu sādhu, sāriputta, sādhu kho tvaṃ, sāriputta, bhikkhūnaṃ saṅgītipariyāyaṃ abhāsī’ti. Idamavocāyasmā sāriputto, samanuñño satthā ahosi. Attamanā te bhikkhū āyasmato sāriputtassa bhāsitaṃ abhinandunti. ",
      "english": "Then the Blessed One, having arisen, addressed the venerable Sāriputta, saying: \"Good, good, Sāriputta, well indeed, Sāriputta, have you spoken to the bhikkhus on the exposition of a collective recitation.\" This the venerable Sāriputta said, and the Teacher approved. Those bhikkhus, delighted, rejoiced in the words of the venerable Sāriputta.",
      "sinhala": "ඉක්බිති භාග්‍යවතුන් වහන්සේ නැඟිට ආයුෂ්මත් සාරිපුත්තයන් අමතා, “සාධු සාධු, සාරිපුත්තය, සාරිපුත්තය, ඔබ භික්ෂූන් සඳහා සංගීතිපරියාය දේශනා කිරීම මැනවි” යැයි වදාළහ. ආයුෂ්මත් සාරිපුත්තයන් මෙය පැවසූ අතර, ශාස්තෘන් වහන්සේ අනුමත වූ සේක. ඒ භික්ෂූන් සතුටු සිත් ඇතිව ආයුෂ්මත් සාරිපුත්තයන්ගේ භාෂිතය අනුමෝදන් වූහ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Saṅgītisuttaṃ niṭṭhitaṃ dasamaṃ.",
    "english": "Tenth Saṅgīti Sutta Concluded.",
    "sinhala": "දසවන සංගීති සූත‍්‍රය අවසන්"
  }
}