{
  "id": "dn2",
  "title": {
    "pali": "Udumbarikasuttaṃ",
    "english": "The Udumbarika Sutta",
    "sinhala": "උදුම්බරිකසූත්‍රය"
  },
  "sections": [
    {
      "number": 49,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena nigrodho paribbājako udumbarikāya paribbājakārāme paṭivasati mahatiyā paribbājakaparisāya saddhiṃ tiṃsamattehi paribbājakasatehi. Atha kho sandhāno gahapati divā divassa [divādivasseva (sī. syā. pī.)] rājagahā nikkhami bhagavantaṃ dassanāya. Atha kho sandhānassa gahapatissa etadahosi – ‘‘akālo kho bhagavantaṃ dassanāya. Paṭisallīno bhagavā. Manobhāvanīyānampi bhikkhūnaṃ asamayo dassanāya. Paṭisallīnā manobhāvanīyā bhikkhū. Yaṃnūnāhaṃ yena udumbarikāya paribbājakārāmo, yena nigrodho paribbājako tenupasaṅkameyya’’nti. Atha kho sandhāno gahapati yena udumbarikāya paribbājakārāmo, tenupasaṅkami.",
      "english": "Thus have I heard: On one occasion the Blessed One was staying in Rājagaha, on Gijjhakūṭa Mountain. Now at that time, Nigrodha the wanderer was dwelling at the Udumbarikā Wanderer's Park, together with a great assembly of wanderers, about three hundred wanderers. Then Sandhāna the householder, in the middle of the day, set out from Rājagaha to see the Blessed One. Then it occurred to Sandhāna the householder: 'It is not the right time to see the Blessed One; the Blessed One is in retreat. Nor is it the right time to see the monks who cultivate the mind; the monks who cultivate the mind are in retreat. What if I were to approach the Udumbarikā Wanderer's Park, where Nigrodha the wanderer is?' So Sandhāna the householder approached the Udumbarikā Wanderer's Park.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ඣකූට පර්වතයෙහි වැඩ වාසය කරති. එසමයෙහි නිග්‍රෝධ පිරිවැජියා තුන්සියයක් පමණ මහත් වූ පිරිවැජි පිරිසක් සමඟ උදම්බරිකා පිරිවැජි ආරාමයෙහි වාසය කරයි.\n\nඉක්බිති සඳහාන ගෘහපතියා දවල් දවසේ භාග්‍යවතුන් වහන්සේ දැකීම පිණිස රජගහ නුවරින් පිටත් විය.\n\nඉක්බිති සඳහාන ගෘහපතියාට මෙබඳු අදහසක් ඇතිවිය: \"භාග්‍යවතුන් වහන්සේ දැකීමට මෙය අකාලයකි. භාග්‍යවතුන් වහන්සේ පටිසල්ලානයෙන් වැඩ සිටිති. මනස දියුණු කළ භික්ෂූන් වහන්සේලා දැකීමටද මෙය අකාලයකි. මනස දියුණු කළ භික්ෂූන් වහන්සේලාද පටිසල්ලානයෙන් වැඩ සිටිති. මම යම් තැනක උදම්බරිකා පිරිවැජි ආරාමය ඇත්ද, යම් තැනක නිග්‍රෝධ පිරිවැජියා ඇත්ද, ඒ තැනට උපසංක්‍රමණය කරන්නේ නම් මැනවි.\"\n\nඉක්බිති සඳහාන ගෘහපතියා යම් තැනක උදම්බරිකා පිරිවැජි ආරාමය ඇත්ද, ඒ තැනට උපසංක්‍රමණය කළේය.",
      "paliTitle": "Nigrodhaparibbājakavatthu",
      "englishTitle": "Story of Nigrodha the Wanderer",
      "sinhalaTitle": "නිග්‍රෝධ පරිබ්බාජක වස්තුව"
    },
    {
      "number": 50,
      "pali": "Tena kho pana samayena nigrodho paribbājako mahatiyā paribbājakaparisāya saddhiṃ nisinno hoti unnādiniyā uccāsaddamahāsaddāya anekavihitaṃ tiracchānakathaṃ kathentiyā. Seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ yānakathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ itibhavābhavakathaṃ iti vā.",
      "english": "Now at that time, the wanderer Nigrodha was seated together with a large assembly of wanderers, making a loud din, a high noise and a great noise, conversing with various kinds of trivial talk. Namely, talk about kings, talk about robbers, talk about chief ministers, talk about armies, talk about danger, talk about battles, talk about food, talk about drink, talk about clothes, talk about beds, talk about garlands, talk about perfumes, talk about relatives, talk about vehicles, talk about villages, talk about market towns, talk about cities, talk about countries, talk about women, talk about heroes, talk about streets, talk about public drinking places, talk about departed ancestors, talk about diversity, talk about the world, talk about the ocean, talk about existence and non-existence, and so on.",
      "sinhala": "ඒ කල්හි, නිග්‍රෝධ පිරිවැජියා මහත් පිරිවැජි පිරිසක් සමඟ මහත් ඝෝෂා කරමින්, උස් හඬින්, මහා හඬින්, නොයෙක් ආකාර වූ ලෞකික කථා කියමින් වාඩි වී සිටියේය.\n\nඑනම්, රජ කථා, සොරුන් පිළිබඳ කථා, අමාත්‍යවරුන් පිළිබඳ කථා, සේනා පිළිබඳ කථා, භය පිළිබඳ කථා, යුද්ධ පිළිබඳ කථා, අහර පිළිබඳ කථා, පාන පිළිබඳ කථා, වස්ත්‍ර පිළිබඳ කථා, සයනය පිළිබඳ කථා, මල් පිළිබඳ කථා, සුවඳ පිළිබඳ කථා, ඥාතීන් පිළිබඳ කථා, යාන වාහන පිළිබඳ කථා, ගම් පිළිබඳ කථා, නියම්ගම් පිළිබඳ කථා, නගර පිළිබඳ කථා, ජනපද පිළිබඳ කථා, ස්ත්‍‍රීන් පිළිබඳ කථා, වීරයන් පිළිබඳ කථා, වීථි පිළිබඳ කථා, ජල ස්ථාන (කල ගෙවල්) පිළිබඳ කථා, පෙරේත කථා, නොයෙක් විෂයයන් පිළිබඳ කථා, ලෝක කථා, සාගර කථා, මේ භවය හා පර භවය පිළිබඳ කථා ආදී යි.",
      "paliTitle": ""
    },
    {
      "number": 51,
      "pali": "Addasā kho nigrodho paribbājako sandhānaṃ gahapatiṃ dūratova āgacchantaṃ. Disvā sakaṃ parisaṃ saṇṭhāpesi – ‘‘appasaddā bhonto hontu, mā bhonto saddamakattha. Ayaṃ samaṇassa gotamassa sāvako āgacchati sandhāno gahapati. Yāvatā kho pana samaṇassa gotamassa sāvakā gihī odātavasanā rājagahe paṭivasanti, ayaṃ tesaṃ aññataro sandhāno gahapati. Appasaddakāmā kho panete āyasmanto appasaddavinītā, appasaddassa vaṇṇavādino. Appeva nāma appasaddaṃ parisaṃ viditvā upasaṅkamitabbaṃ maññeyyā’’ti. Evaṃ vutte te paribbājakā tuṇhī ahesuṃ.",
      "english": "The wandering ascetic Nigrodha saw the householder Sandhāna coming from afar. Having seen him, he quieted his own assembly, saying, \"Sirs, be silent; sirs, do not make any noise. This householder Sandhāna, a disciple of the ascetic Gotama, is coming. Among all those householder disciples of the ascetic Gotama who wear white clothes and dwell in Rājagaha, this householder Sandhāna is one of them. Indeed, these venerable ones are fond of quietude, trained in quietude, and speak in praise of quietude. Perhaps, realizing the assembly is quiet, he might consider it worthy of approach.\" When this was said, those wandering ascetics became silent.",
      "sinhala": "නිග්‍රෝධ පිරිවැජියා දුරදීම සන්ධාන ගෘහපති එනවා දැක්කා. දැක, ඔහු තමන්ගේ පිරිස සන්සුන් කළේය – ‘‘පින්වතුනි, නිශ්ශබ්ද වන්න. පින්වතුනි, ශබ්ද නොකරන්න. මේ ශ්‍රමණ ගෞතමයන්ගේ ශ්‍රාවකයෙකු වන සන්ධාන ගෘහපති එනවා. රජගහ නුවර වාසය කරන, සුදු වස්ත්‍ර ඇඳි, ශ්‍රමණ ගෞතමයන්ගේ යම් ගිහි ශ්‍රාවකයෝ සිටිත්ද, සන්ධාන ගෘහපති ඔවුන්ගෙන් එක් අයෙකි. මේ ආයුෂ්මත්වරු නිශ්ශබ්දතාවයට කැමැත්තෝය, නිශ්ශබ්දතාවයෙන් පුහුණු වූවෝය, නිශ්ශබ්දතාවයේ ගුණ වර්ණනා කරන්නෝය. සමහර විට, නිශ්ශබ්ද පිරිසක් දැක, ළංවිය යුතු යැයි ඔහු සිතාවි.” මෙසේ පැවසූ විට, ඒ පිරිවැජියෝ නිශ්ශබ්ද වූහ.",
      "paliTitle": ""
    },
    {
      "number": 52,
      "pali": "Atha kho sandhāno gahapati yena nigrodho paribbājako tenupasaṅkami, upasaṅkamitvā nigrodhena paribbājakena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sandhāno gahapati nigrodhaṃ paribbājakaṃ etadavoca – ‘‘aññathā kho ime bhonto aññatitthiyā paribbājakā saṅgamma samāgamma unnādino uccāsaddamahāsaddā anekavihitaṃ tiracchānakathaṃ anuyuttā viharanti. Seyyathidaṃ – rājakathaṃ…pe… itibhavābhavakathaṃ iti vā. Aññathā kho [ca (sī. pī.)] pana so bhagavā araññavanapatthāni pantāni senāsanāni paṭisevati appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppānī’’ti.",
      "english": "Then Sandhāna the householder approached Nigrodha the wanderer. Having approached, he exchanged greetings with Nigrodha the wanderer. After exchanging polite and amiable conversation, he sat down to one side. As he sat to one side, Sandhāna the householder said to Nigrodha the wanderer:\n\n“These venerable wanderers of other sects are quite different; when they meet and gather, they are boisterous, loud, and noisy, engaged in all sorts of mundane talk. Such as talk of kings… and so on… or talk of being and non-being. But the Blessed One is quite different; he resorts to remote abodes in forests and jungle thickets, which are quiet, with little noise, secluded, suitable for human privacy, and conducive to contemplation.”",
      "sinhala": "එවිට සන්ධාන ගෘහපති නයිග්‍රෝධ පිරිවැජියා සිටි තැනට පැමිණ, නයිග්‍රෝධ පිරිවැජියා සමඟ සතුටු සාකච්ඡා පැවැත්වීය. සතුටු විය හැකි සිහි කටයුතු කතාවක් කතාබහ කර, එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි සන්ධාන ගෘහපති නයිග්‍රෝධ පිරිවැජියාට මෙය කීවේය – \"පින්වතුනි, මේ වෙනත් ආගම් අදහන පිරිවැජියෝ රැස්වී එක්රැස්වී, ඝෝෂා කරමින්, උස් හඬින් මහ හඬින්, රාජ කථා ආදී මෙලොව පරලොව කථා වැනි නොයෙක් ආකාරයේ තිරශ්චීන කතාවල යෙදෙමින් වාසය කරති.\n\nනමුත් භාග්‍යවතුන් වහන්සේ ශබ්ද රහිත, ඝෝෂා රහිත, ජනයා රහිත, මිනිස් කථාබහෙන් තොර වූ, හුදකලාවට සුදුසු වූ, වන අරණ්‍ය, වන පන්ති ආදී දුරස්ථ සේනාසන සේවනය කරති.\"",
      "paliTitle": ""
    },
    {
      "number": 53,
      "pali": "Evaṃ vutte nigrodho paribbājako sandhānaṃ gahapatiṃ etadavoca – ‘‘yagghe gahapati, jāneyyāsi, kena samaṇo gotamo saddhiṃ sallapati, kena sākacchaṃ samāpajjati, kena paññāveyyattiyaṃ samāpajjati? Suññāgārahatā samaṇassa gotamassa paññā aparisāvacaro samaṇo gotamo nālaṃ sallāpāya. So antamantāneva sevati [antapantāneva (syā.)]. Seyyathāpi nāma gokāṇā pariyantacārinī antamantāneva sevati. Evameva suññāgārahatā samaṇassa gotamassa paññā; aparisāvacaro samaṇo gotamo; nālaṃ sallāpāya. So antamantāneva sevati. Iṅgha, gahapati, samaṇo gotamo imaṃ parisaṃ āgaccheyya, ekapañheneva naṃ saṃsādeyyāma [saṃhareyyāma (ka.)], tucchakumbhīva naṃ maññe orodheyyāmā’’ti.",
      "english": "Indeed, householder, you should know: With whom does the ascetic Gotama converse? With whom does he engage in discussion? With whom does he engage in an intellectual display of wisdom? The ascetic Gotama's wisdom is ruined by solitude; the ascetic Gotama does not frequent assemblies; he is not fit for conversation. He resorts only to remote places. Just as a one-eyed cow, wandering at the fringes, resorts only to remote places; even so, the ascetic Gotama's wisdom is ruined by solitude; the ascetic Gotama does not frequent assemblies; he is not fit for conversation. He resorts only to remote places. Come now, householder, if the ascetic Gotama were to come to this assembly, with a single question we would surely confound him, and I think we would confine him like an empty pot.",
      "sinhala": "මෙසේ කී කල්හි, නිග්‍රෝධ පරිබ්‍රාජකයා සැන්දාන ගෘහපතිට මෙසේ කීවේය: \"ගෘහපතිය, ශ්‍රමණ ගෞතමයන් වහන්සේ කවරෙකු සමග කතාබහ කරන්නේද, කවරෙකු සමග සාකච්ඡා කරන්නේද, කවරෙකු සමග ප්‍රඥාව විදහා පෙන්වීමෙහි යෙදෙන්නේදැයි ඔබ දැනගත යුතුය. ශ්‍රමණ ගෞතමයන් වහන්සේගේ ප්‍රඥාව ශුන්‍යාගාරයෙහි හුරුවූවකි. ශ්‍රමණ ගෞතමයන් වහන්සේ පිරිස් ඇසුරු නොකරති. උන්වහන්සේ කතාබහට නුසුදුසුය. උන්වහන්සේ කෙළවරම, හුදෙකලා තැන්ම ආශ්‍රය කරති. යම් සේ ගොළු ගවදෙනක් සීමාන්තවල ඇවිදින්නේ කෙළවරම, හුදෙකලා තැන්ම ආශ්‍රය කරන්නීය. එසේම ශ්‍රමණ ගෞතමයන් වහන්සේගේ ප්‍රඥාව ශුන්‍යාගාරයෙහි හුරුවූවකි. ශ්‍රමණ ගෞතමයන් වහන්සේ පිරිස් ඇසුරු නොකරති. උන්වහන්සේ කතාබහට නුසුදුසුය. උන්වහන්සේ කෙළවරම, හුදෙකලා තැන්ම ආශ්‍රය කරති. ගෘහපතිය, ශ්‍රමණ ගෞතමයන් වහන්සේ මේ පිරිස වෙත පැමිණියහොත්, එක ප්‍රශ්නයකින්ම අපි උන්වහන්සේව ව්‍යාකූල කරමු. හිස් කළයක් මෙන් උන්වහන්සේව නිහඬ කරමු යැයි මම සිතමි.\"",
      "paliTitle": ""
    },
    {
      "number": 54,
      "pali": "Assosi kho bhagavā dibbāya sotadhātuyā visuddhāya atikkantamānusikāya sandhānassa gahapatissa nigrodhena paribbājakena saddhiṃ imaṃ kathāsallāpaṃ. Atha kho bhagavā gijjhakūṭā pabbatā orohitvā yena sumāgadhāya tīre moranivāpo tenupasaṅkami; upasaṅkamitvā sumāgadhāya tīre moranivāpe abbhokāse caṅkami. Addasā kho nigrodho paribbājako bhagavantaṃ sumāgadhāya tīre moranivāpe abbhokāse caṅkamantaṃ. Disvāna sakaṃ parisaṃ saṇṭhāpesi – ‘‘appasaddā bhonto hontu, mā bhonto saddamakattha, ayaṃ samaṇo gotamo sumāgadhāya tīre moranivāpe abbhokāse caṅkamati. Appasaddakāmo kho pana so āyasmā, appasaddassa vaṇṇavādī. Appeva nāma appasaddaṃ parisaṃ viditvā upasaṅkamitabbaṃ maññeyya. Sace samaṇo gotamo imaṃ parisaṃ āgaccheyya, imaṃ taṃ pañhaṃ puccheyyāma – ‘ko nāma so, bhante, bhagavato dhammo, yena bhagavā sāvake vineti, yena bhagavatā sāvakā vinītā assāsappattā paṭijānanti ajjhāsayaṃ ādibrahmacariya’nti? Evaṃ vutte te paribbājakā tuṇhī ahesuṃ. ",
      "english": "The Blessed One heard, with the divine ear-element, purified and transcending human, this conversation between Sandhāna the householder and Nigrodha the wanderer. Then the Blessed One, having descended from Gijjhakūṭa mountain, approached the Peacock Sanctuary on the bank of the Sumāgadhā river; having approached, he walked up and down in the open air at the Peacock Sanctuary on the bank of the Sumāgadhā river.\n\nNigrodha the wanderer saw the Blessed One walking up and down in the open air at the Peacock Sanctuary on the bank of the Sumāgadhā river. Having seen him, he quieted his assembly, saying: \"Sirs, be silent. Do not make any noise. This ascetic Gotama is walking up and down in the open air at the Peacock Sanctuary on the bank of the Sumāgadhā river. Indeed, that venerable one desires quiet; he praises quietness. Perhaps, having perceived a quiet assembly, he might consider it worthwhile to approach us. If ascetic Gotama were to come to this assembly, we would ask him this question: 'Venerable sir, what is that teaching of the Blessed One by which the Blessed One trains his disciples, and by which, having been trained by the Blessed One, the disciples declare that they have attained reassurance in their aspiration for the fundamental holy life?'\" When this was said, those wanderers remained silent.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ පිරිසිදු වූ, මිනිසුන් ඉක්මවා ගිය දිව්‍යමය සවන්කනින් සන්ධන ගෘහපතියා සහ නිග්‍රෝධ පිරිවැජියා අතර මේ කතාසල්ලාපය ඇසූ සේක. ඉන්පසු භාග්‍යවතුන් වහන්සේ ගිජ්ජකූට පර්වතයෙන් බැස සුමාගධා ගඟ අසල මොරනිවාපයට වැඩම කළ සේක. වැඩම කොට සුමාගධා ගඟ අසල මොරනිවාපයේ එළිමහනේ සක්මන් කළ සේක. නිග්‍රෝධ පිරිවැජියා භාග්‍යවතුන් වහන්සේ සුමාගධා ගඟ අසල මොරනිවාපයේ එළිමහනේ සක්මන් කරනු දුටුවේය. දැක, තම පිරිස සන්සුන් කළේය – ‘ඇවැත්නි, නිශ්ශබ්ද වන්න, ශබ්ද නොකරන්න. මේ ශ්‍රමණ ගෞතමයන් වහන්සේ සුමාගධා ගඟ අසල මොරනිවාපයේ එළිමහනේ සක්මන් කරන සේක. ඒ ආයුෂ්මත් ශ්‍රමණ ගෞතමයන් වහන්සේ නිශ්ශබ්දතාවයට කැමැත්තෙන් යුක්තය, නිශ්ශබ්දතාවය වර්ණනා කරන සේක. සමහරවිට නිශ්ශබ්ද පිරිසක් බව දැනගෙන අප වෙත වැඩම කිරීම සුදුසු යැයි සිතාවි. ශ්‍රමණ ගෞතමයන් වහන්සේ මේ පිරිස වෙත වැඩම කළොත්, අපි උන්වහන්සේගෙන් මේ ප්‍රශ්නය අසමු – ‘ස්වාමීනි, භාග්‍යවතුන් වහන්සේගේ ඒ ධර්මය කුමක්ද? යම් ධර්මයකින් භාග්‍යවතුන් වහන්සේ ශ්‍රාවකයන් හික්මවන සේක්ද, යම් ධර්මයකින් හික්මවන ලද ශ්‍රාවකයෝ සැනසීම ලබා ගෙන, මුල් බ්‍රහ්මචාරී ප්‍රතිපදාව අවබෝධ කරගත්තා යැයි ප්‍රකාශ කරත්ද?’ මෙසේ කී කල්හි ඒ පිරිවැජියෝ නිශ්ශබ්ද වූහ.",
      "paliTitle": ""
    },
    {
      "number": 55,
      "pali": "Atha kho bhagavā yena nigrodho paribbājako tenupasaṅkami. Atha kho nigrodho paribbājako bhagavantaṃ etadavoca – ‘‘etu kho, bhante, bhagavā, svāgataṃ, bhante, bhagavato. Cirassaṃ kho, bhante, bhagavā imaṃ pariyāyamakāsi yadidaṃ idhāgamanāya. Nisīdatu, bhante, bhagavā, idamāsanaṃ paññatta’’nti. Nisīdi bhagavā paññatte āsane. Nigrodhopi kho paribbājako aññataraṃ nīcāsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho nigrodhaṃ paribbājakaṃ bhagavā etadavoca – ‘‘kāya nuttha, nigrodha, etarahi kathāya sannisinnā, kā ca pana vo antarākathā vippakatā’’ti? Evaṃ vutte, nigrodho paribbājako bhagavantaṃ etadavoca, ‘‘idha mayaṃ, bhante, addasāma bhagavantaṃ sumāgadhāya tīre moranivāpe abbhokāse caṅkamantaṃ, disvāna evaṃ avocumhā – ‘sace samaṇo gotamo imaṃ parisaṃ āgaccheyya, imaṃ taṃ pañhaṃ puccheyyāma – ko nāma so, bhante, bhagavato dhammo, yena bhagavā sāvake vineti, yena bhagavatā sāvakā vinītā assāsappattā paṭijānanti ajjhāsayaṃ ādibrahmacariya’nti? Ayaṃ kho no, bhante, antarākathā vippakatā; atha bhagavā anuppatto’’ti.",
      "english": "Then the Blessed One approached where Nigrodha the wanderer was. Then Nigrodha the wanderer said to the Blessed One, \"Come, venerable sir, Blessed One! Welcome, venerable sir, to the Blessed One. It has been a long time, venerable sir, Blessed One, since you made this journey, since you came here. Please sit down, venerable sir, Blessed One; this seat has been prepared.\" The Blessed One sat down on the prepared seat. And Nigrodha the wanderer, taking some low seat, sat down to one side. To Nigrodha the wanderer, who was seated to one side, the Blessed One said, \"Nigrodha, what was the topic of your conversation as you were gathered here just now? And what was the unfinished discussion among you?\" When this was said, Nigrodha the wanderer said to the Blessed One, \"Here, venerable sir, we saw the Blessed One walking in the open air at the Peacock Sanctuary on the bank of the Sumāgadhā. And seeing you, we said this: 'If the ascetic Gotama were to come to this assembly, we would ask him this question: What, venerable sir, is that teaching of the Blessed One by which the Blessed One trains his disciples, by which the Blessed One's disciples, thus trained, attain assurance and declare their attainment of the essence of the holy life?' This, venerable sir, was our unfinished discussion; and then the Blessed One arrived.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ නිග්‍රෝධ පිරිවැජියා සිටි තැනට වැඩියේය. එවිට නිග්‍රෝධ පිරිවැජියා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය – ‘‘වඩින්න, වහන්ස, භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේට මැනවින් වැඩම කළ සේක! වහන්ස, මෙහි වැඩම කිරීමේ මේ අවස්ථාව භාග්‍යවතුන් වහන්සේ බොහෝ කලකට පසුවයි කළේ. වහන්ස, භාග්‍යවතුන් වහන්සේ වැඩහිඳින සේක්වා, මේ අසුන සූදානම් කර ඇත.’’ භාග්‍යවතුන් වහන්සේ පනවන ලද ආසනයෙහි වැඩහුන් සේක. නිග්‍රෝධ පිරිවැජියාද යම්කිසි පහත් අසුනක් ගෙන එක් පසෙකින් වාඩිවිය. එක් පසෙකින් වාඩි වී සිටි නිග්‍රෝධ පිරිවැජියාට භාග්‍යවතුන් වහන්සේ මෙසේ පැවසීය – ‘‘නිග්‍රෝධය, නුඹලා දැන් කුමන කතාවකින් එක්රැස් වී සිටින්නෙහුද, නුඹලාගේ අතරමඟ නැවතුණු කතාව කුමක්ද?’’ මෙසේ පැවසූ විට, නිග්‍රෝධ පිරිවැජියා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය, ‘‘වහන්ස, අපි සුමාගධාවේ තීරයෙහි මොණර අභයභූමියේ එළිමහනේ භාග්‍යවතුන් වහන්සේ සක්මන් කරනවා දුටුවෙමු. දැක මෙසේ පැවසීමු – ‘ශ්‍රමණ ගෞතමයන් වහන්සේ මේ පිරිස වෙත වඩින්නේ නම්, අපි උන්වහන්සේගෙන් මේ ප්‍රශ්නය අසමු – වහන්ස, භාග්‍යවතුන් වහන්සේ යම් ධර්මයකින් ශ්‍රාවකයන් හික්මවන්නේද, භාග්‍යවතුන් වහන්සේ විසින් යම් ධර්මයකින් හික්මවන ලද ශ්‍රාවකයෝ අධ්‍යාශයෙහි මූලික බඹසරෙහි සැනසීම ලැබූ බව ප්‍රකාශ කරද්ද, ඒ භාග්‍යවතුන් වහන්සේගේ ධර්මය කුමක්ද?’ වහන්ස, අපගේ අතරමඟ නැවතුණු කතාව මෙයයි; එතකොට භාග්‍යවතුන් වහන්සේ වැඩම කළ සේකයි.’’",
      "paliTitle": "Tapojigucchāvādo",
      "englishTitle": "Discourse on Abhorrence of Asceticism",
      "sinhalaTitle": "තප ජීගුච්ඡා වාදය"
    },
    {
      "number": 56,
      "pali": "‘‘Dujjānaṃ kho etaṃ, nigrodha, tayā aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena, yenāhaṃ sāvake vinemi, yena mayā sāvakā vinītā assāsappattā paṭijānanti ajjhāsayaṃ ādibrahmacariyaṃ. Iṅgha tvaṃ maṃ, nigrodha, sake ācariyake adhijegucche pañhaṃ puccha – ‘kathaṃ santā nu kho, bhante, tapojigucchā paripuṇṇā hoti, kathaṃ aparipuṇṇā’ti? Evaṃ vutte te paribbājakā unnādino uccāsaddamahāsaddā ahesuṃ – ‘‘acchariyaṃ vata bho, abbhutaṃ vata bho, samaṇassa gotamassa mahiddhikatā mahānubhāvatā, yatra hi nāma sakavādaṃ ṭhapessati, paravādena pavāressatī’’ti.",
      "english": "Indeed, Nigrodha, it is difficult for you—who hold a different view, a different tolerance, a different preference, who practice differently, and who follow a different doctrine—to understand by what means I train my disciples, and by what means my disciples, having been trained by me, acknowledge that they have attained reassurance regarding the fundamental holy life. Come now, Nigrodha, ask me a question concerning the ascetic practices of your own teacher’s doctrine: ‘How, Venerable Sir, is ascetic self-mortification complete, and how is it incomplete?’ When this was said, those wandering ascetics became noisy, making a great clamor and loud shouts: ‘Oh, how wondrous! Oh, how amazing! The great power and majesty of the recluse Gotama, who will set aside his own doctrine and instruct according to the doctrine of others!’",
      "sinhala": "නිග්‍රෝධය, වෙනත් දෘෂ්ටි ඇති, වෙනත් පිළිගැනීම් ඇති, වෙනත් රුචිකත්වයන් ඇති, වෙනත් ව්‍යායාමයන්හි යෙදෙන්නා වූ, වෙනත් ආචාර ධර්මයන් අනුගමනය කරන්නා වූ ඔබට, මා විසින් ශ්‍රාවකයන් හික්මවන ආකාරය සහ මා විසින් හික්මවන ලද ශ්‍රාවකයන් මූලික බ්‍රහ්මචාරී ප්‍රතිපදාවේ අභිප්‍රාය සාක්ෂාත් කර සැනසීම ලැබූ බව පිළිගන්නා ආකාරය දැනගැනීම දුෂ්කරය. එසේනම්, නිග්‍රෝධය, ඔබේ ගුරුවරයාගේ තපෝ ජිගුච්ඡාව (තපස් කිරීම් සහ පව්කම් කෙරෙහි පිළිකුල) පිළිබඳව මගෙන් ප්‍රශ්නයක් අසන්න – ‘ස්වාමීනි, කෙසේ ඇති කල්හි තපෝ ජිගුච්ඡාව සම්පූර්ණ වේද, කෙසේ ඇති කල්හි අසම්පූර්ණ වේද?’ කියා. මෙසේ පැවසූ විට, ඒ පරිබ්‍රාජකයෝ මහත් ඝෝෂාකාරීව, මහත් ශබ්ද නගමින් කතා කරන්නට වූහ – ‘‘අහෝ ආශ්චර්යයකි, අහෝ පුදුමයකි! ශ්‍රමණ භවත් ගෞතමයන්ගේ මහත් ඍද්ධිමත් බවත්, මහත් ආනුභාව සම්පන්න බවත්! යම්තාක් දුරට තමන්ගේ වාදය පසෙක තබා, අන්‍යයන්ගේ වාදයෙන් ප්‍රශ්න කරන්නට ඉදිරිපත් වන්නේය’’ යනුවෙන්.",
      "paliTitle": ""
    },
    {
      "number": 57,
      "pali": "Atha kho nigrodho paribbājako te paribbājake appasadde katvā bhagavantaṃ etadavoca – ‘‘mayaṃ kho, bhante, tapojigucchāvādā [tarojigucchaṃsārodā (ka.)] tapojigucchāsārā tapojigucchāallīnā viharāma. Kathaṃ santā nu kho, bhante, tapojigucchā paripuṇṇā hoti, kathaṃ aparipuṇṇā’’ti? ‘‘Idha, nigrodha, tapassī acelako hoti muttācāro, hatthāpalekhano [hatthāvalekhano (syā.)], na ehibhaddantiko, na tiṭṭhabhaddantiko, nābhihaṭaṃ, na uddissakataṃ, na nimantanaṃ sādiyati, so na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā paṭiggaṇhāti, na eḷakamantaraṃ, na daṇḍamantaraṃ, na musalamantaraṃ, na dvinnaṃ bhuñjamānānaṃ, na gabbhiniyā, na pāyamānāya, na purisantaragatāya, na saṅkittīsu, na yattha sā upaṭṭhito hoti, na yattha makkhikā saṇḍasaṇḍacārinī, na macchaṃ, na maṃsaṃ, na suraṃ, na merayaṃ, na thusodakaṃ pivati, so ekāgāriko vā hoti ekālopiko, dvāgāriko vā hoti dvālopiko, sattāgāriko vā hoti sattālopiko, ekissāpi dattiyā yāpeti, dvīhipi dattīhi yāpeti, sattahipi dattīhi yāpeti; ekāhikampi āhāraṃ āhāreti, dvīhikampi [dvāhikaṃpi (sī. syā.)] āhāraṃ āhāreti, sattāhikampi āhāraṃ āhāreti, iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati. So sākabhakkho vā hoti, sāmākabhakkho vā hoti, nīvārabhakkho vā hoti, daddulabhakkho vā hoti, haṭabhakkho vā hoti, kaṇabhakkho vā hoti, ācāmabhakkho vā hoti, piññākabhakkho vā hoti, tiṇabhakkho vā hoti, gomayabhakkho vā hoti; vanamūlaphalāhāro yāpeti pavattaphalabhojī. So sāṇānipi dhāreti, masāṇānipi dhāreti, chavadussānipi dhāreti, paṃsukūlānipi dhāreti, tirīṭānipi dhāreti, ajinampi dhāreti, ajinakkhipampi dhāreti, kusacīrampi dhāreti, vākacīrampi dhāreti, phalakacīrampi dhāreti, kesakambalampi dhāreti, vāḷakambalampi dhāreti, ulūkapakkhampi dhāreti, kesamassulocakopi hoti kesamassulocanānuyogamanuyutto, ubbhaṭṭhakopi [ubhaṭṭhakopi (syā.), ubbhaṭṭhikopi (ka.)] hoti āsanapaṭikkhitto, ukkuṭikopi hoti ukkuṭikappadhānamanuyutto, kaṇṭakāpassayikopi hoti kaṇṭakāpassaye seyyaṃ kappeti, phalakaseyyampi kappeti, thaṇḍilaseyyampi kappeti, ekapassayikopi hoti rajojalladharo, abbhokāsikopi hoti yathāsanthatiko, vekaṭikopi hoti vikaṭabhojanānuyogamanuyutto, apānakopi hoti apānakattamanuyutto, sāyatatiyakampi udakorohanānuyogamanuyutto viharati. Taṃ kiṃ maññasi, nigrodha, yadi evaṃ sante tapojigucchā paripuṇṇā vā hoti aparipuṇṇā vā’’ti? ‘‘Addhā kho, bhante, evaṃ sante tapojigucchā paripuṇṇā hoti, no aparipuṇṇā’’ti. ‘‘Evaṃ paripuṇṇāyapi kho ahaṃ, nigrodha, tapojigucchāya anekavihite upakkilese vadāmī’’ti. ",
      "english": "Then the wanderer Nigrodha, having made those wanderers quiet, spoke to the Blessed One thus: \"Venerable sir, we live advocating austerity and self-mortification, having austerity and self-mortification as our essence, dedicated to austerity and self-mortification. Venerable sir, how is austerity and self-mortification complete, and how is it incomplete?\"\n\n\"Here, Nigrodha, an ascetic is naked, of free behavior, licking his hands. He does not accept invitations to 'come, good sir,' or 'stop, good sir,' nor food brought specifically for him, nor food made specifically for him, nor food offered as an invitation. He does not accept food from the mouth of a pot, nor from the mouth of a bowl, nor from within a threshold of sheep, nor from within a threshold of sticks, nor from within a threshold of pestles, nor from two people eating, nor from a pregnant woman, nor from a nursing woman, nor from a woman with a man in between, nor from where a general announcement is made, nor from where he is standing nearby, nor from where flies swarm thickly; he does not eat fish, nor meat, nor drink intoxicating liquor, nor fermented liquor, nor rice-gruel. He lives by going to one house for alms and taking one mouthful, or to two houses and taking two mouthfuls, or to seven houses and taking seven mouthfuls. He sustains himself with one donation of food, or with two donations, or with seven donations. He eats food once every day, or once every two days, or once every seven days. In this way, he applies himself to the practice of eating food at regular intervals, even up to once every half-month. He is a feeder on vegetables, or on millet, or on wild rice, or on scraps, or on rice-scum, or on rice-husks, or on rice-water, or on oil-cake, or on grass, or on cow-dung. He sustains himself on roots and fruits of the forest, eating fallen fruits. He wears garments of coarse hemp, or of fine hemp, or of shrouds, or of rag-robes from dust heaps, or of bark, or of deerskin, or of strips of deerskin, or of kusa-grass fabric, or of bark-fiber fabric, or of wood-shaving fabric, or a hair-blanket, or a horse-hair blanket, or owl's wings. He is one who plucks out his hair and beard, dedicated to the practice of plucking out his hair and beard. He stands upright, refusing a seat. He remains in a squatting position, dedicated to the practice of squatting. He lies on a bed of thorns, or makes his bed on planks, or on the bare ground. He sleeps only on one side, covered in dust and dirt. He lives in the open air, just as he lies. He is dedicated to the practice of abnormal eating. He is dedicated to the practice of not drinking water. He lives dedicated to the practice of descending into water three times in the evening.\n\n\"What do you think, Nigrodha? When one is like this, is austerity and self-mortification complete or incomplete?\" \"Certainly, Venerable sir, when one is like this, austerity and self-mortification is complete, not incomplete.\" \"Even in such a complete form of austerity and self-mortification, Nigrodha, I declare there to be various kinds of defilements.\"",
      "sinhala": "එවිට නිග්‍රෝධ පිරිවැසියා ඒ පිරිවැසියන් නිහඬ කොට භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"ස්වාමීනි, අපි තපෝජිගුච්ඡාව (තපස් රැකීම සහ පව්කම් වලට පිළිකුල් කිරීම) වදාරන්නෝ වෙමු, තපෝජිගුච්ඡාව සාරය කොට ඇත්තෝ වෙමු, තපෝජිගුච්ඡාවෙහි ඇලී ගැලී වසන්නෝ වෙමු. ස්වාමීනි, කෙසේ නම් තපෝජිගුච්ඡාව සම්පූර්ණ වන්නේද, කෙසේ නම් එය අසම්පූර්ණ වන්නේද?\"\n\n\"නිග්‍රෝධය, මෙහි ඇතැම් තපස් රකින්නෙක් වස්ත්‍ර රහිතව, නිරුවතින්, නිදහස් හැසිරීම් ඇතිව, අත පිස කන්නෙක් වේ. ‘එන්න, වහන්සැ’ යැයි කැඳවන තැනට නොයයි, ‘නවතිනු, වහන්සැ’ යැයි කැඳවන තැන නොනවතියි. තමා වෙනුවෙන් ගෙනා දෙයක්, තමා වෙනුවෙන් පිසූ දෙයක්, ආරාධනාවක් වශයෙන් ලැබෙන දානයක් නොපිළිගනියි. ඔහු කුම්භි මුඛයෙන් දන් නොගනියි, කලොපි මුඛයෙන් දන් නොගනියි, එළු රැළක් අතරින් දන් නොගනියි, සැරයටි අතරින් දන් නොගනියි, මෝල්ගස් අතරින් දන් නොගනියි, කෑම කන දෙදෙනකු අතරින් දන් නොගනියි, ගැබිනි ස්ත්‍රියකගෙන් දන් නොගනියි, කිරි දෙන ස්ත්‍රියකගෙන් දන් නොගනියි, පිරිමියෙකු සහ ස්ත්‍රියක අතරින් දන් නොගනියි, එක්රැස් වූ අයගෙන් දන් නොගනියි, බල්ලන් සිටින තැනින් දන් නොගනියි, මැස්සන් රංචු වශයෙන් ගැවසෙන තැනින් දන් නොගනියි. මාළු නොකයි, මස් නොකයි, සුරා නොබොයි, මේරය නම් මත්පැන් නොබොයි, නිවුඩු වතුර නොබොයි. ඔහු එක් ගෙදරකින් පමණක් හෝ එක් පිඬුපතක් පමණක් ගෙන යැපේ, ගෙවල් දෙකකින් හෝ පිඬුපත් දෙකක් ගෙන යැපේ, ගෙවල් හතකින් හෝ පිඬුපත් හතක් ගෙන යැපේ. ඔහු දිනකට එක් වරක් හෝ ආහාර ගනියි, දින දෙකකට වරක් හෝ ආහාර ගනියි, දින හතකට වරක් හෝ ආහාර ගනියි. මෙසේ ඔහු අඩ මසකට වරක් පවා වරින් වර භෝජනය කිරීමේ පිළිවෙත අනුගමනය කරමින් ජීවත් වේ. ඔහු ශාක භක්‍ෂකයෙක් වේ, සාමාක ධාන්‍ය භක්‍ෂකයෙක් වේ, නීවාර ධාන්‍ය භක්‍ෂකයෙක් වේ, දද්දුල (පොතු/කුණු) භක්‍ෂකයෙක් වේ, හාට (කුණු සහල්) භක්‍ෂකයෙක් වේ, කණ (තැම්බූ සහල් කුඩු) භක්‍ෂකයෙක් වේ, ආචාම (කැඳ බොර) භක්‍ෂකයෙක් වේ, පිඤ්ඤාක (තලපිටි බොර) භක්‍ෂකයෙක් වේ, තණ භක්‍ෂකයෙක් වේ, ගොම භක්‍ෂකයෙක් වේ. ඔහු වන මූලයන් හා ඵල අනුභව කරමින් යැපේ, ස්වභාවිකව වැටුණු පලතුරු අනුභව කරන්නෙක් වේ. ඔහු සණ වස්ත්‍ර හෝ දරයි, මස්සණ වස්ත්‍ර හෝ දරයි, මෘත දේහ වැසූ වස්ත්‍ර හෝ දරයි, පංසකුල චීවර හෝ දරයි, තිරිති වස්ත්‍ර හෝ දරයි, මුව සම හෝ දරයි, මුව සම කැබැල්ලක් හෝ දරයි, කුස තණ වස්ත්‍ර හෝ දරයි, වැල් පොතු වස්ත්‍ර හෝ දරයි, දැව පොතු වස්ත්‍ර හෝ දරයි, කෙස් කම්බල හෝ දරයි, වාල මුව ලොම් කම්බල හෝ දරයි, බකමුණෙකුගේ පියාපත් (වස්ත්‍රයක් ලෙස) හෝ දරයි. ඔහු කෙස් රැවුල් උගුල්ලන්නෙක් වේ, කෙස් රැවුල් උගුල්ලා දැමීමේ පිළිවෙත අනුගමනය කරන්නෙක් වේ. ඔහු සිටගෙන ඉන්නෙක් වේ, අසුනක් ප්‍රතික්ෂේප කරන්නෙක් වේ. ඔහු උක්කුටික (දණ ගසා) සිටින්නෙක් වේ, උක්කුටික ඉරියව්වෙන් සිටීමේ පිළිවෙත අනුගමනය කරන්නෙක් වේ. කටු ඇඳක සයනය කරයි. ලී පලකයක් මත සයනය කරයි, බිම මත සයනය කරයි. එක් ඇලයකට පමණක් හැරී සයනය කරන්නෙක් වේ, දූවිලි හා මඩ තැවරුණු සිරුරක් ඇත්තෙක් වේ. ඔහු එළිමහනේ වසන්නෙක් වේ, ලැබුණු පරිදිම සතුටින් (එළිමහනේ) වසන්නෙක් වේ. ඔහු විකෘති භෝජන (නොයෙක් ආකාරයේ අමුතු දේ) අනුභව කරන්නෙක් වේ, විකෘති භෝජන අනුභව කිරීමේ පිළිවෙතෙහි යෙදී සිටින්නෙක් වේ. ඔහු ජලය නොබොන්නෙක් වේ, ජලය නොබීමේ පිළිවෙත අනුගමනය කරන්නෙක් වේ. ඔහු සවස් වන තුරු දිනකට තෙවරක් ජලයේ ගිලී සිටීමේ පිළිවෙතෙහි යෙදී ජීවත් වේ.\"\n\n\"නිග්‍රෝධය, මේ පිළිබඳව ඔබ කුමක් සිතන්නෙහිද? මෙසේ සිටින කල තපෝජිගුච්ඡාව සම්පූර්ණ වේද, අසම්පූර්ණ වේද?\"\n\n\"ස්වාමීනි, අනිවාර්යයෙන්ම මෙසේ සිටින කල තපෝජිගුච්ඡාව සම්පූර්ණ වේ, අසම්පූර්ණ නොවෙයි.\"\n\n\"නිග්‍රෝධය, මෙසේ සම්පූර්ණ වූ තපෝජිගුච්ඡාවට වුවද මම නොයෙක් ආකාරයේ උපක්ලේශ පවතින බව කියමි.\"",
      "paliTitle": ""
    },
    {
      "number": 58,
      "pali": "‘‘Yathā kathaṃ pana, bhante, bhagavā evaṃ paripuṇṇāya tapojigucchāya anekavihite upakkilese vadatī’’ti? ‘‘Idha, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā attamano hoti paripuṇṇasaṅkappo. Yampi, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā attamano hoti paripuṇṇasaṅkappo. Ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā attānukkaṃseti paraṃ vambheti. Yampi, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā attānukkaṃseti paraṃ vambheti. Ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā majjati mucchati pamādamāpajjati [madamāpajjati (syā.)]. Yampi, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā majjati mucchati pamādamāpajjati. Ayampi kho, nigrodha, tapassino upakkileso hoti.",
      "english": "“How then, Venerable Sir, does the Blessed One speak of various defilements even in such fully perfected asceticism?”\n\n“Here, Nigrodha, an ascetic undertakes ascetic practice, and by that practice, he becomes pleased with himself, having his resolve perfectly fulfilled. The very fact that an ascetic undertakes ascetic practice and by it becomes pleased with himself, having his resolve perfectly fulfilled—this too, Nigrodha, is a defilement for the ascetic.”\n\n“Furthermore, Nigrodha, an ascetic undertakes ascetic practice, and by that practice, he praises himself and disparages others. The very fact that an ascetic undertakes ascetic practice and by it praises himself and disparages others—this too, Nigrodha, is a defilement for the ascetic.”\n\n“Furthermore, Nigrodha, an ascetic undertakes ascetic practice, and by that practice, he becomes conceited, deluded, and falls into heedlessness. The very fact that an ascetic undertakes ascetic practice and by it becomes conceited, deluded, and falls into heedlessness—this too, Nigrodha, is a defilement for the ascetic.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, එසේනම් භාග්‍යවතුන් වහන්සේ මෙසේ පිරිපුන් වූ තපස් ප්‍රතිපදාවට හා (පව කෙරෙහි) පිළිකුලට නොයෙක් ආකාරයේ උපක්ලේශයන් පවසන්නේ කෙසේද?\n\nමෙහිලා, නිග්‍රෝධය, තපස්වියෙක් තපසක් සමාදන් වෙයි. ඔහු ඒ තපසින් තමා පිළිබඳව සතුටු වෙයි. ඔහුගේ අදහස පිරිපුන් වූයේ වෙයි. නිග්‍රෝධය, යම් හෙයකින් තපස්වී තපසක් සමාදන් වෙයිද, ඔහු ඒ තපසින් තමා පිළිබඳව සතුටු වෙයිද, ඔහුගේ අදහස පිරිපුන් වූයේ වෙයිද, නිග්‍රෝධය, තපස්වියාගේ මෙයද උපක්ලේශයක් වෙයි.\n\nතවද, නිග්‍රෝධය, තපස්වියෙක් තපසක් සමාදන් වෙයි. ඔහු ඒ තපසින් තමා වර්ණනා කරයි, අනුන් හෙළා දකී. නිග්‍රෝධය, යම් හෙයකින් තපස්වී තපසක් සමාදන් වෙයිද, ඔහු ඒ තපසින් තමා වර්ණනා කරයිද, අනුන් හෙළා දකීද, නිග්‍රෝධය, තපස්වියාගේ මෙයද උපක්ලේශයක් වෙයි.\n\nතවද, නිග්‍රෝධය, තපස්වියෙක් තපසක් සමාදන් වෙයි. ඔහු ඒ තපසින් මත් වෙයි, මුසපත් වෙයි, ප්‍රමාදයට පැමිණෙයි. නිග්‍රෝධය, යම් හෙයකින් තපස්වී තපසක් සමාදන් වෙයිද, ඔහු ඒ තපසින් මත් වෙයිද, මුසපත් වෙයිද, ප්‍රමාදයට පැමිණෙයිද, නිග්‍රෝධය, තපස්වියාගේ මෙයද උපක්ලේශයක් වෙයි.",
      "paliTitle": "Upakkileso",
      "englishTitle": "The Defilement",
      "sinhalaTitle": "උපක්ලේශය"
    },
    {
      "number": 59,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena attamano hoti paripuṇṇasaṅkappo. Yampi, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena attamano hoti paripuṇṇasaṅkappo. Ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena attānukkaṃseti paraṃ vambheti. Yampi, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena attānukkaṃseti paraṃ vambheti. Ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena majjati mucchati pamādamāpajjati. Yampi, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena majjati mucchati pamādamāpajjati. Ayampi kho, nigrodha, tapassino upakkileso hoti.",
      "english": "Furthermore, Nigrodha, when an ascetic undertakes ascetic practices, by those ascetic practices he generates gains, homage, and fame. When, by those gains, homage, and fame, he becomes pleased with himself and his intentions are fulfilled, this too, Nigrodha, is a defilement for that ascetic.\n\nFurthermore, Nigrodha, when an ascetic undertakes ascetic practices, by those ascetic practices he generates gains, homage, and fame. When, by those gains, homage, and fame, he praises himself and disparages others, this too, Nigrodha, is a defilement for that ascetic.\n\nFurthermore, Nigrodha, when an ascetic undertakes ascetic practices, by those ascetic practices he generates gains, homage, and fame. When, by those gains, homage, and fame, he becomes intoxicated, deluded, and falls into heedlessness, this too, Nigrodha, is a defilement for that ascetic.",
      "sinhala": "නැවතත්, නිග්‍රෝධය, යම් තපස්සීයෙක් තපසක් සමාදන් වේද, ඔහු ඒ තපසින් ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසා උපදවා ගනියි. ඔහු ඒ ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසාවන් නිසා සතුටු සිතින් යුක්ත වේ, ඔහුගේ අදහස් සම්පූර්ණ වේ. නිග්‍රෝධය, යම් තපස්සීයෙක් තපසක් සමාදන් වේද, ඔහු ඒ තපසින් ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසා උපදවා ගනියි, ඔහු ඒ ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසාවන් නිසා සතුටු සිතින් යුක්ත වේ, ඔහුගේ අදහස් සම්පූර්ණ වේ. මෙයද, නිග්‍රෝධය, තපස්සියාගේ උපක්ලේශයකි.\n\nනැවතත්, නිග්‍රෝධය, යම් තපස්සීයෙක් තපසක් සමාදන් වේද, ඔහු ඒ තපසින් ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසා උපදවා ගනියි. ඔහු ඒ ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසාවන් නිසා තමා වර්ණනා කරයි, අනුන් හෙළා දකී. නිග්‍රෝධය, යම් තපස්සීයෙක් තපසක් සමාදන් වේද, ඔහු ඒ තපසින් ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසා උපදවා ගනියි, ඔහු ඒ ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසාවන් නිසා තමා වර්ණනා කරයි, අනුන් හෙළා දකී. මෙයද, නිග්‍රෝධය, තපස්සියාගේ උපක්ලේශයකි.\n\nනැවතත්, නිග්‍රෝධය, යම් තපස්සීයෙක් තපසක් සමාදන් වේද, ඔහු ඒ තපසින් ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසා උපදවා ගනියි. ඔහු ඒ ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසාවන් නිසා මත් වේ, මුසපත් වේ, ප්<ZWJ>රමාදයට පත් වේ. නිග්‍රෝධය, යම් තපස්සීයෙක් තපසක් සමාදන් වේද, ඔහු ඒ තපසින් ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසා උපදවා ගනියි, ඔහු ඒ ලාභ, සත්කාර, කීර්ති ප්<ZWJ>රශංසාවන් නිසා මත් වේ, මුසපත් වේ, ප්<ZWJ>රමාදයට පත් වේ. මෙයද, නිග්‍රෝධය, තපස්සියාගේ උපක්ලේශයකි.",
      "paliTitle": ""
    },
    {
      "number": 60,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī bhojanesu vodāsaṃ āpajjati – ‘idaṃ me khamati, idaṃ me nakkhamatī’ti. So yañca [yaṃ hi (sī. pī.)] khvassa nakkhamati, taṃ sāpekkho pajahati. Yaṃ panassa khamati, taṃ gadhito [gathito (sī. pī.)] mucchito ajjhāpanno anādīnavadassāvī anissaraṇapañño paribhuñjati…pe… ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati lābhasakkārasilokanikantihetu – ‘sakkarissanti maṃ rājāno rājamahāmattā khattiyā brāhmaṇā gahapatikā titthiyā’ti…pe… ayampi kho, nigrodha, tapassino upakkileso hoti.",
      "english": "Again, Nigrodha, an ascetic makes distinctions regarding food, thinking: 'This is agreeable to me, this is not agreeable to me.' That which is not agreeable to him, he abandons with a sense of attachment. But that which is agreeable to him, he consumes greedily, infatuated, engrossed, not seeing the danger, and without wisdom for release. This too, Nigrodha, is a defilement for an ascetic.\n\nAgain, Nigrodha, an ascetic undertakes austerity for the sake of gain, honor, and renown, thinking: 'Kings, royal ministers, nobles, brahmins, householders, and other ascetics will honor me.' This too, Nigrodha, is a defilement for an ascetic.",
      "sinhala": "තවද, නිග්‍රෝධය, තපස්වියා භෝජනයන් සම්බන්ධයෙන් වෙන්කිරීමකට පැමිණෙයි – ‘මේ මට කැමතියි, මේ මට අකමැතියි’ කියා. ඔහු තමාට අකමැති දෙය අපේක්ෂාවෙන් යුතුව අත්හරියි. යම් දෙයක් නම් ඔහුට කැමති වේද, එය ගිජු වී, මුසපත් වී, ඇලී බැඳී, ආදීනව නොදක්නේ, නික්මීමට ප්‍රඥාවක් නැත්තේ පරිභෝග කරයි. නිග්‍රෝධය, මේද තපස්වියාගේ උපක්ලේශයක් වෙයි.\n\nතවද, නිග්‍රෝධය, තපස්වියා ලාභ, සත්කාර, ප්‍රසිද්ධිය සහ ඇල්ම හේතුවෙන් තපස සමාදන් වෙයි – ‘රජවරු, රාජමහාමාත්‍යයෝ, ක්ෂත්‍රියයෝ, බ්‍රාහ්මණයෝ, ගෘහපතියෝ, තීර්ථකයෝ මට සත්කාර කරනු ඇතැ’යි සිතා. නිග්‍රෝධය, මේද තපස්වියාගේ උපක්ලේශයක් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 61,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī aññataraṃ samaṇaṃ vā brāhmaṇaṃ vā apasādetā [apasāretā (ka.)] hoti – ‘kiṃ panāyaṃ sambahulājīvo [bahulājīvo (sī. pī.)] sabbaṃ saṃbhakkheti. Seyyathidaṃ – mūlabījaṃ khandhabījaṃ phaḷubījaṃ aggabījaṃ bījabījameva pañcamaṃ, asanivicakkaṃ dantakūṭaṃ, samaṇappavādenā’ti…pe… ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī passati aññataraṃ samaṇaṃ vā brāhmaṇaṃ vā kulesu sakkariyamānaṃ garukariyamānaṃ māniyamānaṃ pūjiyamānaṃ. Disvā tassa evaṃ hoti – ‘imañhi nāma sambahulājīvaṃ kulesu sakkaronti garuṃ karonti mānenti pūjenti. Maṃ pana tapassiṃ lūkhājīviṃ kulesu na sakkaronti na garuṃ karonti na mānenti na pūjentī’ti, iti so issāmacchariyaṃ kulesu uppādetā hoti…pe… ayampi kho, nigrodha, tapassino upakkileso hoti.",
      "english": "Furthermore, Nigrodha, an ascetic disparages some other recluse or brahmin, saying: 'Why does this one, living on so many things, consume everything? That is to say, root-seeds, stem-seeds, joint-seeds, cutting-seeds, and fifth, seed-seeds themselves; also things damaged by force and things gnawed by teeth, all under the pretext of being a recluse.' This too, Nigrodha, is an impurity for an ascetic.\n\nFurthermore, Nigrodha, an ascetic sees some other recluse or brahmin being honored, respected, esteemed, and revered by families. Having seen this, it occurs to him thus: 'They indeed honor, respect, esteem, and revere this one, who lives on so many things, in families. But me, an ascetic living a harsh life, they do not honor, do not respect, do not esteem, and do not revere in families.' Thus, he generates envy and stinginess regarding families. This too, Nigrodha, is an impurity for an ascetic.",
      "sinhala": "තවද, නිග්‍රෝධයෙනි, ඇතැම් තපස්වියෙක් අන්‍ය වූ ශ්‍රමණ<ZWJ>යකු හෝ බ්‍රාහ්මණ<ZWJ>යකු – ‘මේ බොහෝ දේවලින් ජීවත්වන්නා, මූල බීජ, කඳ බීජ, ඵල බීජ, අග්<ZWJ>ර බීජ, පස්වනුව බීජ බීජ, අසනිවික, දන්තකූට ආදී වූ මේ සියල්ල ශ්‍රමණ<ZWJ> සම්ප්‍රදායයට අනුව පරිභෝජනය කරන්නේ කෙසේදැයි’ පවසමින් පහත් කොට සලකයි. නිග්‍රෝධයෙනි, මේ ද තපස්වියාගේ උපක්ලේශයක් (කෙලෙසීමක්) වේ.\n\nතවද, නිග්‍රෝධයෙනි, ඇතැම් තපස්වියෙක් අන්‍ය වූ ශ්‍රමණ<ZWJ>යකු හෝ බ්‍රාහ්මණ<ZWJ>යකු ගිහි ගෙවල්හි සත්කාර ලබන, ගරුකාර ලබන, මාන ලබන, පූජා ලබන අයුරු දකියි. එය දැක ඔහුට මෙසේ සිතේ: ‘මේ නම් බොහෝ දේවලින් ජීවත්වන්නකුට ගිහි ගෙවල්හි සත්කාර කරති, ගරුකාර කරති, මාන කරති, පූජා කරති. එහෙත් රළු ජීවිතයක් ගත කරන තපස්වියකු වන මට නම් ගිහි ගෙවල්හි සත්කාර නොකරති, ගරුකාර නොකරති, මාන නොකරති, පූජා නොකරති’ යි. මෙසේ ඔහු ගිහි ගෙවල් සම්බන්ධයෙන් ඊර්ෂ්‍යා මසුරුකම් උපදවයි. නිග්‍රෝධයෙනි, මේ ද තපස්වියාගේ උපක්ලේශයක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 62,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī āpāthakanisādī hoti…pe… ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī attānaṃ adassayamāno kulesu carati – ‘idampi me tapasmiṃ idampi me tapasmi’nti…pe… ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī kiñcideva paṭicchannaṃ sevati. So ‘khamati te ida’nti puṭṭho samāno akkhamamānaṃ āha – ‘khamatī’ti. Khamamānaṃ āha – ‘nakkhamatī’ti. Iti so sampajānamusā bhāsitā hoti…pe… ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tathāgatassa vā tathāgatasāvakassa vā dhammaṃ desentassa santaṃyeva pariyāyaṃ anuññeyyaṃ nānujānāti…pe… ayampi kho, nigrodha, tapassino upakkileso hoti.",
      "english": "Furthermore, Nigrodha, an ascetic sits down on a public thoroughfare, and this too, Nigrodha, is a defilement for the ascetic.\n\nAgain, Nigrodha, an ascetic goes about among families, not making a show of himself, thinking, \"This is my ascetic practice; this is my ascetic practice,\" and this too, Nigrodha, is a defilement for the ascetic.\n\nAgain, Nigrodha, an ascetic practices something hidden. When asked, \"Do you like this?\", if he dislikes it, he says, \"I like it.\" If he likes it, he says, \"I do not like it.\" Thus, he speaks an intentional falsehood, and this too, Nigrodha, is a defilement for the ascetic.\n\nAgain, Nigrodha, an ascetic, when the Tathāgata or a disciple of the Tathāgata is teaching the Dhamma, does not acknowledge a valid and acceptable teaching point that is actually present, and this too, Nigrodha, is a defilement for the ascetic.",
      "sinhala": "නැවතත් තවත්, නිග්‍රෝධයෙනි, තපස්වියා අනුන් දුටු තැන ඉඳගන්නේ වෙයි... නිග්‍රෝධයෙනි, මෙයද තපස්වියාගේ උපක\\u200D්ලේශයකි.\n\nනැවතත් තවත්, නිග්‍රෝධයෙනි, තපස්වියා 'මේකත් මගේ තපසක්, මේකත් මගේ තපසක්' යැයි සිතමින් තමා නොදක්වමින් කුලයන් අතර හැසිරෙයි... නිග්‍රෝධයෙනි, මෙයද තපස්වියාගේ උපක\\u200D්ලේශයකි.\n\nනැවතත් තවත්, නිග්‍රෝධයෙනි, තපස්වියා යම්කිසි සැඟවුණු දෙයක් අනුගමනය කරයි. 'ඔබට මෙය සුදුසුද?' යැයි අසන ලද කල, නුසුදුසු දෙයක් වුවද 'සුදුසුයි' කියා කියයි. සුදුසු දෙයක් වුවද 'නුසුදුසුයි' කියා කියයි. මෙසේ ඔහු දැන දැනම බොරු කී කෙනෙක් වෙයි... නිග්‍රෝධයෙනි, මෙයද තපස්වියාගේ උපක\\u200D්ලේශයකි.\n\nනැවතත් තවත්, නිග්‍රෝධයෙනි, තපස්වියා තථාගතයන් වහන්සේගේ හෝ තථාගත ශ\\u200D්‍රාවකයෙකුගේ හෝ ධර්මය දේශනා කරන විට, පවතින (සත්‍ය වූ) පිළිගත යුතු ක\\u200D්‍රමය නොපිළිගනියි... නිග්‍රෝධයෙනි, මෙයද තපස්වියාගේ උපක\\u200D්ලේශයකි.",
      "paliTitle": ""
    },
    {
      "number": 63,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī kodhano hoti upanāhī. Yampi, nigrodha, tapassī kodhano hoti upanāhī. Ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Puna caparaṃ, nigrodha, tapassī makkhī hoti paḷāsī [palāsī (sī. syā. pī.)] …pe… issukī hoti maccharī… saṭho hoti māyāvī… thaddho hoti atimānī… pāpiccho hoti pāpikānaṃ icchānaṃ vasaṃ gato… micchādiṭṭhiko hoti antaggāhikāya diṭṭhiyā samannāgato… sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī. Yampi, nigrodha, tapassī sandiṭṭhiparāmāsī hoti ādhānaggāhī duppaṭinissaggī. Ayampi kho, nigrodha, tapassino upakkileso hoti. ‘‘Taṃ kiṃ maññasi, nigrodha, yadime tapojigucchā [tapojigucchāya (?)] upakkilesā vā anupakkilesā vā’’ti? ‘‘Addhā kho ime, bhante, tapojigucchā [tapojigucchāya (?)] upakkilesā [upakkilesā hoti (ka.)], no anupakkilesā. Ṭhānaṃ kho panetaṃ, bhante, vijjati yaṃ idhekacco tapassī sabbeheva imehi upakkilesehi samannāgato assa; ko pana vādo aññataraññatarenā’’ti.",
      "english": "Furthermore, O Nigrodha, an ascetic is angry and resentful. Even if, O Nigrodha, an ascetic is angry and resentful—this too, O Nigrodha, is an imperfection for an ascetic.\n\nFurthermore, O Nigrodha, an ascetic is a denier of good and spiteful, jealous and stingy, deceitful and fraudulent, stubborn and arrogant, has evil wishes and is dominated by evil wishes, holds wrong views and is attached to extreme views, and clings to his own views, holds onto them firmly, and is hard to let go of. Even if, O Nigrodha, an ascetic clings to his own views, holds onto them firmly, and is hard to let go of—this too, O Nigrodha, is an imperfection for an ascetic.\n\n“What do you think, O Nigrodha, are these imperfections for the ascetic's practice, or not imperfections?”\n\n“Certainly, Reverend Sir, these are imperfections for the ascetic's practice, not not-imperfections. It is indeed possible, Reverend Sir, that some ascetic might be endowed with all these imperfections; how much more so with some of them.”",
      "sinhala": "තවද, නිග්‍රෝධය, තපස්වියා ක්‍රෝධ සහිත වෙයි, වෛර බඳින සුලු වෙයි. නිග්‍රෝධය, තපස්වියා ක්‍රෝධ සහිත වී වෛර බඳින සුලු වන මේ කරුණ ද තපස්වියාගේ උපක්ලේශයක් ම වෙයි.\n\nතවද, නිග්‍රෝධය, තපස්වියා ගුණමකු වෙයි, පලාසී වෙයි. තවද, නිග්‍රෝධය, තපස්වියා ඊර්ෂ්‍යා සහගත වෙයි, මසුරු වෙයි. තවද, නිග්‍රෝධය, තපස්වියා සඨ වෙයි, මායාවී වෙයි. තවද, නිග්‍රෝධය, තපස්වියා දැඩි ගති ඇති වෙයි, අතිමානී වෙයි. තවද, නිග්‍රෝධය, තපස්වියා පාපිච්ඡ වෙයි, පාපී වූ ඉච්ඡාවන්ට වසඟ වූවෙක් වෙයි. තවද, නිග්‍රෝධය, තපස්වියා මිථ්‍යාදෘෂ්ටික වෙයි, අන්තග්‍රාහී දෘෂ්ටියෙන් යුක්ත වූවෙක් වෙයි. තවද, නිග්‍රෝධය, තපස්වියා තමාගේ දැක්ම දැඩිව අල්ලාගෙන සිටින්නේ වෙයි, තදින් අල්ලාගන්නේ වෙයි, පහසුවෙන් අත්නොහරින්නේ වෙයි. නිග්‍රෝධය, තපස්වියා තමාගේ දැක්ම දැඩිව අල්ලාගෙන සිටින්නේ වෙමින්, තදින් අල්ලාගන්නේ වෙමින්, පහසුවෙන් අත්නොහරින්නේ වන මේ කරුණ ද තපස්වියාගේ උපක්ලේශයක් ම වෙයි.\n\n\"නිග්‍රෝධය, මේවා තපස් රකින්නවුන්ගේ උපක්ලේශයන් ද, නොහොත් උපක්ලේශ නොවේ ද කියා නුඹ කුමක් සිතන්නෙහිද?\" \"වහන්ස, මේවා නියත වශයෙන්ම තපස් රකින්නවුන්ගේ උපක්ලේශයන් ම වෙති, උපක්ලේශ නොවන දේ නොවේ. වහන්ස, මෙලොව ඇතැම් තපස්වී කෙනෙක් මේ සියලු උපක්ලේශයන්ගෙන් යුක්ත විය හැකි බවට කාරණය තිබේ; එසේ නම්, යම් කිසි උපක්ලේශයකින් හෝ කිහිපයකින් යුක්ත වීම ගැන කවර කථා ද?\"",
      "paliTitle": ""
    },
    {
      "number": 64,
      "pali": "‘‘Idha, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā na attamano hoti na paripuṇṇasaṅkappo. Yampi, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā na attamano hoti na paripuṇṇasaṅkappo. Evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā na attānukkaṃseti na paraṃ vambheti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā na majjati na mucchati na pamādamāpajjati…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti.",
      "english": "Here, Nigrodha, an ascetic undertakes austerity, but by that austerity he is not pleased with himself, nor is his intention fulfilled. Moreover, Nigrodha, an ascetic undertakes austerity, but by that austerity he is not pleased with himself, nor is his intention fulfilled. Thus he is purified in that respect.\n\nFurthermore, Nigrodha, an ascetic undertakes austerity, and by that austerity he does not praise himself nor disparage others. Thus he is purified in that respect.\n\nFurthermore, Nigrodha, an ascetic undertakes austerity, and by that austerity he does not become conceited, infatuated, nor negligent. Thus he is purified in that respect.",
      "sinhala": "මෙහි, නිග්‍රෝධයෙනි, තපස් රකින තැනැත්තා තපසක් සමාදන් වෙයි. හෙතෙම ඒ තපසින් තමා ගැන සතුටු වන්නේ නැත, තමාගේ අරමුණු සම්පූර්ණ වී ඇතැයි නොසිතයි. නිග්‍රෝධයෙනි, යම්කිසි තපස් රකින තැනැත්තෙක් තපසක් සමාදන් වේ නම්, හෙතෙම ඒ තපසින් තමා ගැන සතුටු වන්නේ නැත, තමාගේ අරමුණු සම්පූර්ණ වී ඇතැයි නොසිතයි. මෙසේ හෙතෙම ඒ කාරණයෙහි පිරිසිදු වෙයි.\n\nනැවතත්, නිග්‍රෝධයෙනි, තපස් රකින තැනැත්තා තපසක් සමාදන් වෙයි. හෙතෙම ඒ තපසින් තමාට ප්‍රශංසා කරගන්නේ නැත, අනුන්ට නින්දා කරන්නේ නැත. නිග්‍රෝධයෙනි, යම්කිසි තපස් රකින තැනැත්තෙක් තපසක් සමාදන් වේ නම්, හෙතෙම ඒ තපසින් තමාට ප්‍රශංසා කරගන්නේ නැත, අනුන්ට නින්දා කරන්නේ නැත. මෙසේ හෙතෙම ඒ කාරණයෙහි පිරිසිදු වෙයි.\n\nනැවතත්, නිග්‍රෝධයෙනි, තපස් රකින තැනැත්තා තපසක් සමාදන් වෙයි. හෙතෙම ඒ තපසින් උඩඟු වන්නේ නැත, මෝහයට පත් වන්නේ නැත, ප්‍රමාදයට පත් වන්නේ නැත. නිග්‍රෝධයෙනි, යම්කිසි තපස් රකින තැනැත්තෙක් තපසක් සමාදන් වේ නම්, හෙතෙම ඒ තපසින් උඩඟු වන්නේ නැත, මෝහයට පත් වන්නේ නැත, ප්‍රමාදයට පත් වන්නේ නැත. මෙසේ හෙතෙම ඒ කාරණයෙහි පිරිසිදු වෙයි.",
      "paliTitle": "Parisuddhapapaṭikappattakathā",
      "englishTitle": "Discourse on Attaining a Pure Patch",
      "sinhalaTitle": "කෙලෙස් කබොල්ලෙන් පිරිසිදු වීමේ කථාව"
    },
    {
      "number": 65,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena na attamano hoti na paripuṇṇasaṅkappo…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena na attānukkaṃseti na paraṃ vambheti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tapaṃ samādiyati, so tena tapasā lābhasakkārasilokaṃ abhinibbatteti, so tena lābhasakkārasilokena na majjati na mucchati na pamādamāpajjati…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti.",
      "english": "Furthermore, Nigrodha, an ascetic undertakes austerity. Through that austerity, he generates gain, honor, and fame. Yet, because of that gain, honor, and fame, he is not pleased with himself, nor does his purpose become fully satisfied; rather, he remains unattached and free from conceit regarding them. Thus, he is pure in that regard.\n\nFurthermore, Nigrodha, an ascetic undertakes austerity. Through that austerity, he generates gain, honor, and fame. Yet, because of that gain, honor, and fame, he does not praise himself, nor does he disparage others; instead, he maintains a balanced perspective and humility. Thus, he is pure in that regard.\n\nFurthermore, Nigrodha, an ascetic undertakes austerity. Through that austerity, he generates gain, honor, and fame. Yet, because of that gain, honor, and fame, he is not intoxicated, not infatuated, and does not fall into heedlessness; instead, he remains mindful and vigilant. Thus, he is pure in that regard.",
      "sinhala": "තවද, නිග්‍රෝධයෙනි, තපස්වියා තපස් සමාදන් වෙයි. ඔහු ඒ තපසින් ලාභ සත්කාර කීර්ති ප්‍රශංසා ඇති කරයි. ඔහු ඒ ලාභ සත්කාර කීර්ති ප්‍රශංසාවන් නිසා සතුටු නොවේ, ඔහුගේ අදහස ඒ පිළිබඳව සම්පූර්ණ වූවක් නොවේ. මේ ආකාරයෙන් ඔහු ඒ කරුණෙහිලා පිරිසිදු වෙයි.\n\nතවද, නිග්‍රෝධයෙනි, තපස්වියා තපස් සමාදන් වෙයි. ඔහු ඒ තපසින් ලාභ සත්කාර කීර්ති ප්‍රශංසා ඇති කරයි. ඔහු ඒ ලාභ සත්කාර කීර්ති ප්‍රශංසාවන් නිසා තමා වර්ණනා නොකරයි, අනුන් හෙළා නොදකී. මේ ආකාරයෙන් ඔහු ඒ කරුණෙහිලා පිරිසිදු වෙයි.\n\nතවද, නිග්‍රෝධයෙනි, තපස්වියා තපස් සමාදන් වෙයි. ඔහු ඒ තපසින් ලාභ සත්කාර කීර්ති ප්‍රශංසා ඇති කරයි. ඔහු ඒ ලාභ සත්කාර කීර්ති ප්‍රශංසාවන් නිසා නො මත් වෙයි, නො මුසපත් වෙයි, ප්‍රමාදයට නොපැමිණෙයි. මේ ආකාරයෙන් ඔහු ඒ කරුණෙහිලා පිරිසිදු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 66,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī bhojanesu na vodāsaṃ āpajjati – ‘idaṃ me khamati, idaṃ me nakkhamatī’ti. So yañca khvassa nakkhamati, taṃ anapekkho pajahati. Yaṃ panassa khamati, taṃ agadhito amucchito anajjhāpanno ādīnavadassāvī nissaraṇapañño paribhuñjati…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī na tapaṃ samādiyati lābhasakkārasilokanikantihetu – ‘sakkarissanti maṃ rājāno rājamahāmattā khattiyā brāhmaṇā gahapatikā titthiyā’ti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti.",
      "english": "Furthermore, Nigrodha, an ascetic does not fall into partiality regarding foods, thinking, ‘This is agreeable to me, this is disagreeable to me.’ Whatever is disagreeable to him, he abandons without concern. But whatever is agreeable to him, he consumes without greed, without infatuation, unattached, seeing the danger, possessing the wisdom of escape. Thus, he is pure in that respect.\n\nFurthermore, Nigrodha, an ascetic does not undertake ascetic practices for the sake of gain, honor, praise, or renown, thinking, ‘Kings, royal ministers, khattiyas, brahmins, householders, or other sectarians will honor me.’ Thus, he is pure in that respect.",
      "sinhala": "තවද, නිග්‍රෝධය, තපස්වියා භෝජනවලදී ‘මෙය මට කැමතියි, මෙය මට අකැමතියි’ යැයි කිසිදු තෝරාගැනීමක් ඇති නොකරයි. ඔහු යමක් තමාට අකැමති ද, එය අපේක්ෂා රහිතව අත්හරියි. යමක් තමාට කැමති ද, එය ගිජු නොවී, මුසපත් නොවී, ඇලී නොසිටිමින්, ආදීනව දක්නාසුලුව, නිස්සරණ ප්‍රඥාවෙන් යුතුව පරිභෝග කරයි. මෙසේ ඔහු ඒ කාරණයෙහි පිරිසිදු වෙයි.\n\nතවද, නිග්‍රෝධය, තපස්වියා ලාභ, සත්කාර, ප්‍රශංසා අපේක්ෂාවෙන් හෝ ප්‍රියතාවය (ලබාගැනීම) හේතු කොටගෙන තපස සමාදන් නොවේ. ‘රජවරු, රාජ මහාමාත්‍යවරු, ක්ෂත්‍රියයෝ, බ්‍රාහ්මණයෝ, ගෘහපතියෝ, තීර්ථකයෝ මට සත්කාර කරනු ඇතැ’යි යන සිතින් ඔහු තපස සමාදන් නොවේ. මෙසේ ඔහු ඒ කාරණයෙහි පිරිසිදු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 67,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī aññataraṃ samaṇaṃ vā brāhmaṇaṃ vā nāpasādetā hoti – ‘kiṃ panāyaṃ sambahulājīvo sabbaṃ saṃbhakkheti. Seyyathidaṃ – mūlabījaṃ khandhabījaṃ phaḷubījaṃ aggabījaṃ bījabījameva pañcamaṃ, asanivicakkaṃ dantakūṭaṃ, samaṇappavādenā’ti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī passati aññataraṃ samaṇaṃ vā brāhmaṇaṃ vā kulesu sakkariyamānaṃ garu kariyamānaṃ māniyamānaṃ pūjiyamānaṃ. Disvā tassa na evaṃ hoti – ‘imañhi nāma sambahulājīvaṃ kulesu sakkaronti garuṃ karonti mānenti pūjenti. Maṃ pana tapassiṃ lūkhājīviṃ kulesu na sakkaronti na garuṃ karonti na mānenti na pūjentī’ti, iti so issāmacchariyaṃ kulesu nuppādetā hoti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti.",
      "english": "Furthermore, Nigrodha, an ascetic does not disparage any other recluse or brahmin, thinking: ‘Why does this person, living on abundant provisions, consume everything? For instance, root-seeds, stem-seeds, joint-seeds, shoot-seeds, and fifth, the seed of seeds, as well as digging tools and tooth-sticks, all while claiming to be a recluse.’ Thus, in that respect, he is pure.\n\nFurthermore, Nigrodha, an ascetic sees another recluse or brahmin being honored, respected, esteemed, and worshipped by families. Seeing this, he does not think: ‘Indeed, they honor, respect, esteem, and worship this person who lives on abundant provisions among families, but they do not honor, respect, esteem, or worship me, the ascetic living a strict life, among families.’ Thus, he does not arouse envy and jealousy regarding families. Thus, in that respect, he is pure.",
      "sinhala": "නැවතත්, නිග්‍රෝධයෙනි, තපස්වීවරයා අන්‍ය වූ යම් ශ්‍ර[ZWJ]මණයෙකුට හෝ බ්‍ර[ZWJ]ාහ්මණයෙකුට අවඥා නොකරයි. ‘කුමක්ද මේ බොහෝ ජීවීන් ඇති දේ අනුභව කරමින් සියල්ලම ගිල දමන්නේ? එනම්, මුල් බීජ, කඳ බීජ, ගෙඩි බීජ, අග්‍ර බීජ, පස්වැනි බීජ බීජද, විදුලි කෙටීමක් වැනිව, දත් කූටයක් වැනිව (අනුභව කරමින්), ශ්‍ර[ZWJ]මණ ක්‍ර[ZWJ]ියාව යැයි පවසමින් (නින්දා නොකරයි).’ මෙසේ ඔහු ඒ කරුණෙහි පිරිසිදු වේ.\n\nනැවතත්, නිග්‍රෝධයෙනි, තපස්වීවරයා අන්‍ය වූ යම් ශ්‍ර[ZWJ]මණයෙකු හෝ බ්‍ර[ZWJ]ාහ්මණයෙකු හෝ කුලයන් අතර සත්කාර ලබනු, ගෞරව ලබනු, සැලකිලි ලබනු, පූජා ලබනු දකී. දැක ඔහුට මෙසේ සිතක් නොවේ – ‘මේ බොහෝ ජීවීන්ගෙන් යැපෙන්නාට කුලයන් සත්කාර කරති, ගරු කරති, සලකති, පූජා කරති. එහෙත් මා වැනි දුෂ්කර දිවි ඇති තපස්වියාට කුලයන් සත්කාර නොකරති, ගරු නොකරති, සලකන්නේ නැත, පූජා නොකරති.’ මෙසේ ඔහු කුලයන් කෙරෙහි ඊර්ෂ්‍යාව හා මසුරුකම උපදවා නොගනී. මෙසේ ඔහු ඒ කරුණෙහි පිරිසිදු වේ.",
      "paliTitle": ""
    },
    {
      "number": 68,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī na āpāthakanisādī hoti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī na attānaṃ adassayamāno kulesu carati – ‘idampi me tapasmiṃ, idampi me tapasmi’nti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī na kañcideva paṭicchannaṃ sevati, so – ‘khamati te ida’nti puṭṭho samāno akkhamamānaṃ āha – ‘nakkhamatī’ti. Khamamānaṃ āha – ‘khamatī’ti. Iti so sampajānamusā na bhāsitā hoti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī tathāgatassa vā tathāgatasāvakassa vā dhammaṃ desentassa santaṃyeva pariyāyaṃ anuññeyyaṃ anujānāti…pe… evaṃ so tasmiṃ ṭhāne parisuddho hoti.",
      "english": "Furthermore, O Nigrodha, an ascetic is not one who sits ostentatiously, and so he is purified in that respect.\n\nFurthermore, O Nigrodha, an ascetic does not wander among families displaying himself, saying, ‘This too is part of my ascetic practice, this too is part of my ascetic practice,’ and so he is purified in that respect.\n\nFurthermore, O Nigrodha, an ascetic does not engage in anything concealed. When asked, ‘Do you approve of this?’ if he does not approve, he says, ‘I do not approve.’ If he approves, he says, ‘I approve.’ Thus, no intentional falsehood is spoken by him, and so he is purified in that respect.\n\nFurthermore, O Nigrodha, when the Tathāgata or a disciple of the Tathāgata is teaching the Dhamma, an ascetic acknowledges a doctrine that is truly existing and worthy of acknowledgement, and so he is purified in that respect.",
      "sinhala": "තවද, නිග්‍රෝධය, තපස්වියා ආපථකනිසාදී නොවේ. මෙසේ ඔහු ඒ තැනෙහි පිරිසිදු වේ.\n\nතවද, නිග්‍රෝධය, තපස්වියා තමා ප්‍රදර්ශනය කරමින් කුලගෙවල් වල ‘මේකත් මගේ තපස්කමයි, මේකත් මගේ තපස්කමයි’ කියා හැසිරෙන්නේ නැත. මෙසේ ඔහු ඒ තැනෙහි පිරිසිදු වේ.\n\nතවද, නිග්‍රෝධය, තපස්වියා කිසිවක් සඟවා නොපවත්වයි. ඔහු – ‘ඔබට මෙය රුචිදැ’යි අසනු ලැබූ කල්හි, රුචි නොවන දෙයක් නම් – ‘රුචි නැතැ’යි කියයි. රුචි වන දෙයක් නම් – ‘රුචියැ’යි කියයි. මෙසේ ඔහු දැන දැන බොරු නොකියයි. මෙසේ ඔහු ඒ තැනෙහි පිරිසිදු වේ.\n\nතවද, නිග්‍රෝධය, තපස්වියා තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙකු ධර්මය දේශනා කරන විට, පවතින අයුරින්ම, අනුමත කළ යුතු කරුණු අනුමත කරයි. මෙසේ ඔහු ඒ තැනෙහි පිරිසිදු වේ.",
      "paliTitle": ""
    },
    {
      "number": 69,
      "pali": "‘‘Puna caparaṃ, nigrodha, tapassī akkodhano hoti anupanāhī. Yampi, nigrodha, tapassī akkodhano hoti anupanāhī evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Puna caparaṃ, nigrodha, tapassī amakkhī hoti apaḷāsī…pe… anissukī hoti amaccharī… asaṭho hoti amāyāvī… atthaddho hoti anatimānī… na pāpiccho hoti na pāpikānaṃ icchānaṃ vasaṃ gato… na micchādiṭṭhiko hoti na antaggāhikāya diṭṭhiyā samannāgato… na sandiṭṭhiparāmāsī hoti na ādhānaggāhī suppaṭinissaggī. Yampi, nigrodha, tapassī na sandiṭṭhiparāmāsī hoti na ādhānaggāhī suppaṭinissaggī. Evaṃ so tasmiṃ ṭhāne parisuddho hoti. ‘‘Taṃ kiṃ maññasi, nigrodha, yadi evaṃ sante tapojigucchā parisuddhā vā hoti aparisuddhā vā’’ti? ‘‘Addhā kho, bhante, evaṃ sante tapojigucchā parisuddhā hoti no aparisuddhā, aggappattā ca sārappattā cā’’ti. ‘‘Na kho, nigrodha, ettāvatā tapojigucchā aggappattā ca hoti sārappattā ca; api ca kho papaṭikappattā [pappaṭikapattā (ka.)] hotī’’ti.",
      "english": "Furthermore, Nigrodha, an ascetic is not angry and not resentful. Inasmuch as, Nigrodha, an ascetic is not angry and not resentful, in that respect he is purified.\n\nFurthermore, Nigrodha, an ascetic is not a denier and not a rival; not envious and not stingy; not deceitful and not cunning; not arrogant and not conceited; not of evil desires and not fallen under the sway of evil desires; not of wrong view and not endowed with a view that grasps at extremes; not grasping at his own views and not holding fast to them, but readily relinquishing them. Inasmuch as, Nigrodha, an ascetic is not grasping at his own views and not holding fast to them, but readily relinquishing them, in that respect he is purified.\n\n“What do you think, Nigrodha? If that is the case, is the ascetic purification purified or unpurified?”\n\n“Certainly, Venerable Sir, if that is the case, the ascetic purification is purified, not unpurified, and it has reached the summit and attained its essence.”\n\n“No, Nigrodha, by this much the ascetic purification has not reached the summit or attained its essence; but rather, it has only reached the stage of the outer skin.”",
      "sinhala": "තවද, නිග්‍රෝධය, තපස්වීයා කිපීමෙන් තොර වේ, වෛර නොකරයි. නිග්‍රෝධය, යම් හෙයකින් තපස්වීයා කිපීමෙන් තොර වේද, වෛර නොකරයිද, මෙසේ ඔහු ඒ කරුණෙහි පිරිසිදු වේ.\n\nතවද, නිග්‍රෝධය, තපස්වීයා ගුණ මකු නොකරයි, අවමාන නොකරයි. ඊර්ෂ්‍යා නොකරයි, මසුරු නොවේ. කපටිකම් නොකරයි, වංචා නොකරයි. නොතැදේ, අතිමානයෙන් තොර වේ. නපුරු කැමැති නොවේ, නපුරු කැමැති අයගේ වසඟයට නොගියේය. මිත්‍යාදෘෂ්ටික නොවේ, අන්තග්‍රාහී දෘෂ්ටියෙන් යුක්ත නොවේ. තම දෘෂ්ටියට ඇලී නොසිටියි, අල්ලාගෙන නොසිටියි, පහසුවෙන් අත්හරියි. නිග්‍රෝධය, යම් හෙයකින් තපස්වීයා තම දෘෂ්ටියට ඇලී නොසිටියිද, අල්ලාගෙන නොසිටියිද, පහසුවෙන් අත්හරියිද, මෙසේ ඔහු ඒ කරුණෙහි පිරිසිදු වේ.\n\nනිග්‍රෝධය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මෙසේ පවතින විට, මෙම තපස් වත පිරිසිදුද අපිරිසිදුද?\n\nභාග්‍යවතුන් වහන්ස, ඇත්තෙන්ම මෙසේ පවතින විට, මෙම තපස් වත පිරිසිදුය, අපිරිසිදු නොවේ. එය අග්‍රත්වයටද, සාරත්වයටද පැමිණියේය.\n\nනිග්‍රෝධය, මෙපමණකින් තපස් වත අග්‍රත්වයටද සාරත්වයටද පැමිණියේ නොවේ. එහෙත් එය හුදු පතුරු තත්ත්වයටම පැමිණියේය.",
      "paliTitle": ""
    },
    {
      "number": 70,
      "pali": "‘‘Kittāvatā pana, bhante, tapojigucchā aggappattā ca hoti sārappattā ca? Sādhu me, bhante, bhagavā tapojigucchāya aggaññeva pāpetu, sāraññeva pāpetū’’ti. ‘‘Idha, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti. Kathañca, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti? Idha, nigrodha, tapassī na pāṇaṃ atipāteti [atipāpeti (ka. sī. pī. ka.)], na pāṇaṃ atipātayati, na pāṇamatipātayato samanuñño hoti. Na adinnaṃ ādiyati, na adinnaṃ ādiyāpeti, na adinnaṃ ādiyato samanuñño hoti. Na musā bhaṇati, na musā bhaṇāpeti, na musā bhaṇato samanuñño hoti. Na bhāvitamāsīsati [na bhāvitamāsiṃ sati (sī. syā. pī.)], na bhāvitamāsīsāpeti, na bhāvitamāsīsato samanuñño hoti. Evaṃ kho, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti. ‘‘Yato kho, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti, aduṃ cassa hoti tapassitāya. So abhiharati no hīnāyāvattati. So vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. So pacchābhattaṃ piṇḍapātappaṭikkanto nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti. Byāpādappadosaṃ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādappadosā cittaṃ parisodheti. Thinamiddhaṃ [thīnamiddhaṃ (sī. syā. pī.)] pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ vūpasantacitto, uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti.",
      "english": "\"To what extent, venerable sir, is self-mortification and aversion supreme and essential? It would be good, venerable sir, if the Blessed One would lead me to the supreme and essential nature of self-mortification and aversion.\"\n\n\"Here, Nigrodha, an ascetic is restrained by the fourfold restraint. And how, Nigrodha, is an ascetic restrained by the fourfold restraint? Here, Nigrodha, an ascetic does not take life, does not cause others to take life, and does not approve of others taking life. He does not take what is not given, does not cause others to take what is not given, and does not approve of others taking what is not given. He does not speak falsehood, does not cause others to speak falsehood, and does not approve of others speaking falsehood. He does not crave for what has not been developed, nor does he cause others to crave for what has not been developed, nor does he approve of others craving for what has not been developed. Thus, Nigrodha, is an ascetic restrained by the fourfold restraint.\n\nWhen, Nigrodha, an ascetic is restrained by the fourfold restraint, this becomes his ascetic practice. He brings it forward, he does not turn back to a lesser state. He resorts to a secluded lodging: a forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open-air dwelling, a heap of straw. After his meal, having returned from his alms-round, he sits down, folding his legs crosswise, setting his body erect, and establishing mindfulness in front of him. Having abandoned covetousness for the world, he dwells with a mind free from covetousness; he purifies his mind from covetousness. Having abandoned ill will and malice, he dwells with a mind free from ill will, sympathetic to the welfare of all living beings; he purifies his mind from ill will and malice. Having abandoned sloth and torpor, he dwells free from sloth and torpor, perceiving light, mindful and clearly comprehending; he purifies his mind from sloth and torpor. Having abandoned restlessness and remorse, he dwells unagitated, with his mind inwardly peaceful; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having overcome doubt, without perplexity regarding wholesome states; he purifies his mind from doubt.",
      "sinhala": "භාග්‍යවතුන් වහන්ස, කොපමණකින් නම් තපස්-විරතිය අග්‍රභාවයටද, සාරභාවයටද පැමිණෙන්නේද? භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ මාව තපස්-විරතියේ අග්‍රභාවයටම, සාරභාවයටම පමුණුවන සේක්වා!\n\nනිග්‍රෝධයෙනි, මෙහිලා තපස්වියා සිව්වැදෑරුම් සංවරයෙන් යුක්ත වෙයි. නිග්‍රෝධයෙනි, කෙසේද තපස්වියා සිව්වැදෑරුම් සංවරයෙන් යුක්ත වන්නේ? නිග්‍රෝධයෙනි, මෙහිලා තපස්වියා ප්‍රාණඝාතය නොකරයි, අනුන් ලවා ප්‍රාණඝාතය නොකරවයි, ප්‍රාණඝාතය කරන්නාට අනුමත නොකරයි. නොදුන් දෙය නොගනියි, අනුන් ලවා නොදුන් දෙය නොගැන්වයි, නොදුන් දෙය ගන්නාට අනුමත නොකරයි. බොරු නොකියයි, අනුන් ලවා බොරු නොකියවයි, බොරු කියන්නාට අනුමත නොකරයි. පැවැත්ම නොපතයි, අනුන් ලවා පැවැත්ම නොපතවයි, පැවැත්ම පතන්නාට අනුමත නොකරයි. නිග්‍රෝධයෙනි, මේ අයුරින් තපස්වියා සිව්වැදෑරුම් සංවරයෙන් යුක්ත වෙයි.\n\nනිග්‍රෝධයෙනි, යම් හෙයකින් තපස්වියා සිව්වැදෑරුම් සංවරයෙන් යුක්ත වේද, ඒ ඔහුගේ තපස්බව පිණිස වෙයි. ඔහු දියුණුව කරා යයි, පිරිහීම කරා නොයයි. ඔහු හුදෙකලා සෙනසුන් සෙවනය කරයි, එනම් අරණ්‍යය, රුක්මුල්, පර්වත, කඳුරු, ගිරිගුහා, සුසාන, වනාන්තර, එළිමහන් තැන්, පිදුරු ගොඩවල් යි. ඔහු දානය අවසන් කොට, පිණ්ඩපාතයෙන් ආපසු පැමිණ, පලක් බැඳගෙන, කය කෙලින් පිහිටුවා, මුහුණට සමීපයෙන් සිහිය පිහිටුවාගෙන වාඩිවෙයි. ඔහු ලෝකයේ අභිධ්‍යාව දුරු කොට, අභිධ්‍යා රහිත සිතින් වාසය කරයි, අභිධ්‍යාවෙන් සිත පිරිසිදු කරයි. ව්‍යාපාද-ප්‍රදෝෂය දුරු කොට, සියලු සත්වයන්ට හිතානුකම්පීව, ව්‍යාපාද රහිත සිතින් වාසය කරයි, ව්‍යාපාද-ප්‍රදෝෂයෙන් සිත පිරිසිදු කරයි. ථීනමිද්ධය දුරු කොට, ආලෝක සංඥාවෙන් යුක්තව, සිහි නුවණින් යුක්තව, ථීනමිද්ධ රහිතව වාසය කරයි, ථීනමිද්ධයෙන් සිත පිරිසිදු කරයි. උද්ධච්ච-කුක්කුච්චය දුරු කොට, ඇතුළත සිත සන්සුන්ව, නොසන්සුන් බව රහිතව වාසය කරයි, උද්ධච්ච-කුක්කුච්චයෙන් සිත පිරිසිදු කරයි. විචිකිච්ඡාව දුරු කොට, කුසල ධර්මයන් පිළිබඳ සැක රහිතව, විචිකිච්ඡාව තරණය කළ අයෙක්ව වාසය කරයි, විචිකිච්ඡාවෙන් සිත පිරිසිදු කරයි.",
      "paliTitle": "Parisuddhatacappattakathā",
      "englishTitle": "Story of Unattained Pure Skin",
      "sinhalaTitle": "පරිශුද්‍ධ සම නොලැබීමේ කථාව"
    },
    {
      "number": 71,
      "pali": "‘‘So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati. Tathā dutiyaṃ. Tathā tatiyaṃ. Tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. Karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati. Tathā dutiyaṃ. Tathā tatiyaṃ. Tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. ‘‘Taṃ kiṃ maññasi, nigrodha. Yadi evaṃ sante tapojigucchā parisuddhā vā hoti aparisuddhā vā’’ti? ‘‘Addhā kho, bhante, evaṃ sante tapojigucchā parisuddhā hoti no aparisuddhā, aggappattā ca sārappattā cā’’ti. ‘‘Na kho, nigrodha, ettāvatā tapojigucchā aggappattā ca hoti sārappattā ca; api ca kho tacappattā hotī’’ti.",
      "english": "Having abandoned these five hindrances—corruptions of the mind that weaken wisdom—he dwells suffusing one direction with a mind imbued with loving-kindness. So too the second, so too the third, so too the fourth. Thus, upwards, downwards, across, everywhere, in all aspects, the entire world he dwells suffusing with a mind imbued with loving-kindness, vast, exalted, immeasurable, without hostility, without ill-will. With a mind imbued with compassion… with a mind imbued with appreciative joy… with a mind imbued with equanimity, he dwells suffusing one direction. So too the second, so too the third, so too the fourth. Thus, upwards, downwards, across, everywhere, in all aspects, the entire world he dwells suffusing with a mind imbued with equanimity, vast, exalted, immeasurable, without hostility, without ill-will.\n\n“What do you think, Nigrodha? If this is so, is this asceticism and revulsion purified or unpurified?”\n\n“Certainly, venerable sir, if this is so, this asceticism and revulsion is purified, not unpurified. It has reached its culmination and its essence.”\n\n“No, Nigrodha, by this much, this asceticism and revulsion has not reached its culmination or its essence; rather, it has reached its bark.”",
      "sinhala": "ඔහු, ප්‍රඥාව දුබල කරන්නා වූ සිතේ උපක්ලේශයන් වන මේ පස් නිවරණ පහ කොට, මෛත්‍රියෙන් යුක්ත වූ සිතින් එක් දිශාවක් පැතිරී වාසය කරයි. එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද (මෛත්‍රියෙන් යුක්ත වූ සිතින් පැතිරී වාසය කරයි). මෙසේ උඩ, යට, හරස් අතට, සියලු තැන්හි, සියලු ආකාරයෙන්, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, මෛත්‍රියෙන් යුක්ත වූ සිතින් මුළු ලෝකයම පැතිරී වාසය කරයි. කරුණාවෙන් යුක්ත වූ සිතින්, මුදිතාවෙන් යුක්ත වූ සිතින්, උපේක්ෂාවෙන් යුක්ත වූ සිතින් එක් දිශාවක් පැතිරී වාසය කරයි. එලෙසම දෙවන දිශාවද, එලෙසම තෙවන දිශාවද, එලෙසම සිව්වන දිශාවද (උපේක්ෂාවෙන් යුක්ත වූ සිතින් පැතිරී වාසය කරයි). මෙසේ උඩ, යට, හරස් අතට, සියලු තැන්හි, සියලු ආකාරයෙන්, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, උපේක්ෂාවෙන් යුක්ත වූ සිතින් මුළු ලෝකයම පැතිරී වාසය කරයි.\n\nනිග්‍රෝධය, ඔබ මේ කුමක් සිතන්නෙහිද? මෙසේ වන කල්හි තපෝජිගුච්ඡාව පිරිසිදු හෝ අපිරිසිදු හෝ වේද?” “භාග්‍යවතුන් වහන්ස, ඒකාන්තයෙන්ම මෙසේ වන කල්හි තපෝජිගුච්ඡාව පිරිසිදු වේ මිස අපිරිසිදු නොවේ. එය අග්‍රයට පැමිණියා වූද, සාරයට පැමිණියා වූද වේ.” “නිග්‍රෝධය, මේ පමණින් තපෝජිගුච්ඡාව අග්‍රයට පැමිණියා වූද, සාරයට පැමිණියා වූද නොවේ. එසේ වුවද එය පොත්තට පැමිණියා පමණි.”",
      "paliTitle": ""
    },
    {
      "number": 72,
      "pali": "‘‘Kittāvatā pana, bhante, tapojigucchā aggappattā ca hoti sārappattā ca? Sādhu me, bhante, bhagavā tapojigucchāya aggaññeva pāpetu, sāraññeva pāpetū’’ti. ‘‘Idha, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti. Kathañca, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti…pe… yato kho, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti, aduṃ cassa hoti tapassitāya. So abhiharati no hīnāyāvattati. So vivittaṃ senāsanaṃ bhajati…pe… so ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe mettāsahagatena cetasā…pe… karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So anekavihitaṃ pubbenivāsaṃ anussarati seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ, tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘Taṃ kiṃ maññasi, nigrodha, yadi evaṃ sante tapojigucchā parisuddhā vā hoti aparisuddhā vā’’ti? ‘‘Addhā kho, bhante, evaṃ sante tapojigucchā parisuddhā hoti, no aparisuddhā, aggappattā ca sārappattā cā’’ti. ‘‘Na kho, nigrodha, ettāvatā tapojigucchā aggappattā ca hoti sārappattā ca; api ca kho phegguppattā hotī’’ti.",
      "english": "“To what extent, venerable sir, is ascetic practice and scrupulousness foremost and essential? It would be good for me, venerable sir, if the Blessed One would lead me to the foremost and essential aspects of ascetic practice and scrupulousness.”\n\n“Here, Nigrodha, an ascetic is restrained by the fourfold restraint. How, Nigrodha, is an ascetic restrained by the fourfold restraint? Here, Nigrodha, an ascetic does not take life, does not take what is not given, does not speak falsehoods, and does not engage in sexual misconduct. This is how, Nigrodha, an ascetic is restrained by the fourfold restraint. When, Nigrodha, an ascetic is restrained by the fourfold restraint, this contributes to his asceticism. He progresses, he does not regress. He resorts to a secluded dwelling, such as a forest, the root of a tree, a mountain, a ravine, a hillside cave, a charnel ground, a jungle thicket, an open field, or a heap of straw. After his meal, having returned from his alms round, he sits down, folds his legs crosswise, sets his body erect, and establishes mindfulness in front of him. Having abandoned these five hindrances, the defilements of the mind that weaken wisdom, he dwells pervading one direction with a mind imbued with loving-kindness, then a second, then a third, then a fourth. Thus above, below, around, everywhere, to all as to himself, he dwells pervading the entire world with a mind imbued with loving-kindness, vast, exalted, immeasurable, without hostility, without ill will. He dwells pervading one direction with a mind imbued with compassion, then a second, then a third, then a fourth. Thus above, below, around, everywhere, to all as to himself, he dwells pervading the entire world with a mind imbued with compassion, vast, exalted, immeasurable, without hostility, without ill will. He dwells pervading one direction with a mind imbued with appreciative joy, then a second, then a third, then a fourth. Thus above, below, around, everywhere, to all as to himself, he dwells pervading the entire world with a mind imbued with appreciative joy, vast, exalted, immeasurable, without hostility, without ill will. He dwells pervading one direction with a mind imbued with equanimity, then a second, then a third, then a fourth. Thus above, below, around, everywhere, to all as to himself, he dwells pervading the entire world with a mind imbued with equanimity, vast, exalted, immeasurable, without hostility, without ill will. He recollects his manifold past lives, that is, one birth, two births, three, four, five, ten, twenty, thirty, forty, fifty, a hundred, a thousand, a hundred thousand births, and many aeons of cosmic contraction, many aeons of cosmic expansion, many aeons of cosmic contraction and expansion: ‘There I was such a one by name, of such a clan, of such a complexion, nourished on such a food, experiencing such and such pleasant and painful feelings, with such a lifespan. From there having passed away, I arose elsewhere; there too I was such a one by name, of such a clan, of such a complexion, nourished on such a food, experiencing such and such pleasant and painful feelings, with such a lifespan. From there having passed away, I arose here.’ Thus, with its aspects and details, he recollects his manifold past lives.\n\n“What do you think, Nigrodha, if this is the case, is this ascetic practice and scrupulousness pure or impure?”\n\n“Certainly, venerable sir, if this is the case, this ascetic practice and scrupulousness is pure, not impure; it has attained the highest and the essential.”\n\n“Not by this much, Nigrodha, is ascetic practice and scrupulousness attained the highest and the essential; rather, it has attained only the husk.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, තපස් පිළිවෙතක් අග්‍රභාවයටත් සාරත්වයටත් පත්වන්නේ කොපමණකින්ද? භාග්‍යවතුන් වහන්ස, ඒ තපස් පිළිවෙතේ අග්‍රභාවයටත් සාරත්වයටත් මා පමුණුවන සේක්වා! නිග්‍රෝධයෙනි, මෙහිලා තපස්වී සතර පැයකින් යුතු සංවරයකින් යුක්ත වේ. නිග්‍රෝධයෙනි, තපස්වී කෙසේ සතර පැයකින් යුතු සංවරයකින් යුක්ත වේද... යම් හෙයකින් නිග්‍රෝධයෙනි, තපස්වී සතර පැයකින් යුතු සංවරයකින් යුක්ත වේද, එය ඔහුගේ තපස් භාවය පිණිස වේ. ඔහු උසස්භාවයට පත්වේ මිස පහත් තත්ත්වයට නොපත්වේ. ඔහු විවේක සේනාසනයන් භජනය කරයි... ඔහු මේ පංච නීවරණ, සිතෙහි කෙලෙස් සහ ප්‍රඥාව දුබල කරන දෑ දුරුකොට, මෛත්‍රී සහගත සිතින්... කරුණා සහගත සිතින්... මුදිතා සහගත සිතින්... උපේක්ෂා සහගත සිතින් විපුල වූ, මහාර්ගත වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ (බ්‍රහ්මවිහාරයෙන් ලොව) පතුරුවා වාසය කරයි. ඔහු නොයෙක් ආකාර වූ පෙර විසූ කඳපිළිවෙළ සිහි කරයි. එනම් – එක් ජාතියක්, දෙජාතියක්, තෙජාතියක්, සතර ජාතියක්, පස් ජාතියක්, දස ජාතියක්, විසි ජාතියක්, තිස් ජාතියක්, සතළිස් ජාතියක්, පනස් ජාතියක්, සියයක් ජාති, දහසක් ජාති, ලක්ෂයක් ජාති, නොයෙක් සංවට්ට කල්පයන්, නොයෙක් විවට්ට කල්පයන්, නොයෙක් සංවට්ට-විවට්ට කල්පයන් – ‘මම අසුවල් තැන සිටියෙමි, මෙවන් නම් ඇත්තෙමි, මෙවන් ගොත්‍ර ඇත්තෙමි, මෙවන් වර්ණ ඇත්තෙමි, මෙවන් ආහාර ඇත්තෙමි, මෙවන් සැප දුක් විඳින්නෙමි, මෙවන් ආයුෂ අවසානයක් ඇත්තෙමි, මම එතැනින් චුතව අසුවල් තැන උපන්නෙමි, එහිද මම මෙවන් නම් ඇත්තෙමි, මෙවන් ගොත්‍ර ඇත්තෙමි, මෙවන් වර්ණ ඇත්තෙමි, මෙවන් ආහාර ඇත්තෙමි, මෙවන් සැප දුක් විඳින්නෙමි, මෙවන් ආයුෂ අවසානයක් ඇත්තෙමි, මම එතැනින් චුතව මෙහි උපන්නෙමි’යි. මේ අයුරින් ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පෙර විසූ කඳපිළිවෙළ සිහි කරයි. නිග්‍රෝධයෙනි, මේ ගැන කුමක් සිතන්නෙහිද? මෙසේ වූ විට තපස් පිළිවෙත පිරිසිදුද, නැතහොත් අපිරිසිදුද? භාග්‍යවතුන් වහන්ස, සැබවින්ම මෙසේ වූ විට තපස් පිළිවෙත පිරිසිදුය, අපිරිසිදු නොවේ. එය අග්‍රභාවයටත් සාරත්වයටත් පත්වේ. නිග්‍රෝධයෙනි, මෙපමණකින් තපස් පිළිවෙත අග්‍රභාවයට හෝ සාරත්වයට පත් නොවේ. එහෙත් එය නිසරු තත්වයකට පත්වේ.",
      "paliTitle": "Parisuddhaphegguppattakathā",
      "englishTitle": "Account of the Arising of Pure Essence",
      "sinhalaTitle": "පරිශුද්ධ සාරෝත්පත්තිය වස්තුව"
    },
    {
      "number": 73,
      "pali": "‘‘Kittāvatā pana, bhante, tapojigucchā aggappattā ca hoti sārappattā ca? Sādhu me, bhante, bhagavā tapojigucchāya aggaññeva pāpetu, sāraññeva pāpetū’’ti. ‘‘Idha, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti. Kathañca, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti…pe… yato kho, nigrodha, tapassī cātuyāmasaṃvarasaṃvuto hoti, aduṃ cassa hoti tapassitāya. So abhiharati no hīnāyāvattati. So vivittaṃ senāsanaṃ bhajati…pe… so ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe mettāsahagatena cetasā…pe… upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. So anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti. ‘‘Taṃ kiṃ maññasi, nigrodha, yadi evaṃ sante tapojigucchā parisuddhā vā hoti aparisuddhā vā’’ti? ‘‘Addhā kho, bhante, evaṃ sante tapojigucchā parisuddhā hoti no aparisuddhā, aggappattā ca sārappattā cā’’ti.",
      "english": "‘‘To what extent, venerable sir, does asceticism and aversion become supreme and achieve its essence? It would be good, venerable sir, if the Blessed One would lead me to the supreme and essential aspect of asceticism and aversion.’’\n\n‘‘Here, Nigrodha, an ascetic is restrained by the fourfold restraint. And how, Nigrodha, is an ascetic restrained by the fourfold restraint? He practices restraint over all evil actions, refraining from harming any living being, from taking what is not given, from sexual misconduct, and from false speech. When, Nigrodha, an ascetic is thus restrained by the fourfold restraint, that much is his asceticism. He cultivates further, he does not regress. He resorts to a secluded dwelling, cultivates contentment and few wishes, diligently practices meditation, and thereby, having abandoned these five hindrances, these defilements of the mind that weaken wisdom, he dwells pervading one direction with a mind imbued with loving-kindness, likewise pervading the second, third, and fourth directions; pervading above, below, and all around; pervading everywhere, in all aspects, the whole world with a mind abundant, expansive, limitless, free from hostility, free from ill-will, imbued with loving-kindness; with a mind imbued with compassion; with a mind imbued with sympathetic joy; and with a mind imbued with equanimity, abundant, expansive, limitless, free from hostility, free from ill-will. He recollects his manifold past existences. That is to say: one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion, remembering: ‘There I was named thus, of such a clan, of such an appearance, such was my food, such was my experience of pleasure and pain, such was the end of my life. Having passed away from there, I reappeared elsewhere. There too I was named thus, of such a clan, of such an appearance, such was my food, such was my experience of pleasure and pain, such was the end of my life. Having passed away from there, I reappeared here.’ Thus he recollects his manifold past existences with their various modes and details. With the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands them according to their deeds: ‘Indeed, these beings, who were endowed with misconduct of body, misconduct of speech, misconduct of mind, who reviled noble ones, held wrong views, and undertook deeds based on wrong views, upon the break-up of the body, after death, have reappeared in a state of deprivation, a bad destination, a lower realm, in hell. Or these beings, who were endowed with good conduct of body, good conduct of speech, good conduct of mind, who did not revile noble ones, held right views, and undertook deeds based on right views, upon the break-up of the body, after death, have reappeared in a good destination, in a heavenly world.’ Thus with the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands them according to their deeds.\n\n‘‘What do you think, Nigrodha, if this is the case, is that asceticism and aversion purified or unpurified?’’ ‘‘Certainly, venerable sir, if this is the case, that asceticism and aversion is purified, not unpurified; it has attained the supreme and achieved its essence.’’",
      "sinhala": "‘‘භාග්‍යවතුන් වහන්ස, තපස් සීලාචාරය කවර අයුරකින් අග්‍රයටත් සාරයටත් පැමිණෙන්නේද? භාග්‍යවතුන් වහන්ස, ඒ තපස් සීලාචාරය අග්‍රයටත් සාරයටත් පැමිණවීමට මා උදෙසා අනුග්‍රහ කරන සේක්වා!’’\n\n‘‘නිග්‍රෝධයෙනි, මෙහිලා තපස්වී චාතුර්යාම සංවරයෙන් යුක්ත වේ. නිග්‍රෝධයෙනි, තපස්වී කෙසේ නම් චාතුර්යාම සංවරයෙන් යුක්ත වේද යන්න... (විස්තර කී පසු) ... නිග්‍රෝධයෙනි, යම් කලෙක තපස්වී චාතුර්යාම සංවරයෙන් යුක්ත වේද, එය ඔහුගේ තපස් භාවය සඳහා වේ. ඔහු (තපස් සීලාචාරය) ඉදිරියට ගෙන යයි, පිරිහීමට පත් නොවේ. ඔහු හුදෙකලා සේනාසනයක් සේවනය කරයි. ඔහු මේ පංච නීවරණ, එනම් සිත්හි උපක්ලේශයන් සහ ප්‍රඥාව දුර්වල කරන්නා වූ දෑ, දුරුකොට මෙත්තා, කරුණා, මුදිතා, උපේක්ඛා යන සතර බ්‍රහ්මවිහාරයෙන් යුක්ත වූ, විශාල වූ, මහත් වූ, අප්‍රමාණ වූ, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ සිතින් විහිදුවා වාසය කරයි.\n\nඔහු නොයෙක් ආකාර වූ පෙර විසූ කඳපිළිවෙළ සිහි කරයි. එනම් – එක් ආත්ම භාවයක් ද, දෙකක් ද, තුනක් ද, සතරක් ද, පහක් ද, දහයක් ද, විස්සක් ද, තිහක් ද, හතළිහක් ද, පනහක් ද, සියයක් ද, දහසක් ද, සිය දහසක් ද, බොහෝ කල්පයන් ද, බොහෝ සිය කල්පයන් ද, බොහෝ සංවට්ට කල්පයන් ද, බොහෝ විවට්ට කල්පයන් ද, බොහෝ සංවට්ට-විවට්ට කල්පයන් ද වශයෙන් ආකාර සහිතව, අරමුණු සහිතව නොයෙක් ආකාර වූ පෙර විසූ කඳපිළිවෙළ සිහි කරයි.\n\nඔහු පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැස් ඇසින් (දිව්‍ය චක්ෂුසින්) චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ (යහපත් වර්ණ ඇති), දුර්වර්ණ වූ (දුර්වර්ණ ඇති), සුගතිගාමී වූ, දුර්ගතිගාමී වූ සත්වයන් දකී. කර්මානුරූපව ගමන් කරන සත්වයන් මෙසේ තේරුම් ගනී: ‘පින්වත්නි, මේ සත්වයන් කයින් දුසිරිත් කොට, වචනයෙන් දුසිරිත් කොට, සිතින් දුසිරිත් කොට, ආර්යයන්ට අපහාස කරන්නන් වී, මිථ්‍යා දෘෂ්ටිකයන් වී, මිථ්‍යා දෘෂ්ටි කර්මයන් සමාදන් වූවන් වී, ඔවුහු කය බිඳී මරණයෙන් පසු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට උපදිත්. නැතහොත්, මේ පින්වත් සත්වයන් කයින් සුසිරිත් කොට, වචනයෙන් සුසිරිත් කොට, සිතින් සුසිරිත් කොට, ආර්යයන්ට අපහාස නොකරන්නන් වී, සම්මා දෘෂ්ටිකයන් වී, සම්මා දෘෂ්ටි කර්මයන් සමාදන් වූවන් වී, ඔවුහු කය බිඳී මරණයෙන් පසු සුගතියට, ස්වර්ග ලෝකයට උපදිත්’ යි. මෙසේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැස් ඇසින් (දිව්‍ය චක්ෂුසින්) චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගතිගාමී වූ, දුර්ගතිගාමී වූ සත්වයන් දකී. කර්මානුරූපව ගමන් කරන සත්වයන් තේරුම් ගනී.\n\n‘‘නිග්‍රෝධයෙනි, මේ ගැන කුමක් සිතන්නෙහිද, මෙසේ වූ කල තපස් සීලාචාරය පිරිසිදු වේද, අපිරිසිදු වේද?’’ ‘‘භාග්‍යවතුන් වහන්ස, ඇත්තෙන්ම මෙසේ වූ කල තපස් සීලාචාරය පිරිසිදු වේ, අපිරිසිදු නොවේ. අග්‍රප්‍රාප්ත වේ, සාරප්‍රාප්ත වේ.’’",
      "paliTitle": "Parisuddhaaggappattasārappattakathā",
      "englishTitle": "Discourse on Pure Supreme Essence Attainment",
      "sinhalaTitle": "පරිශුද\\u200d්ධ අග\\u200d්‍රසාර ප\\u200d්‍රාප\\u200d්ති කථාව"
    },
    {
      "number": 74,
      "pali": "‘‘Ettāvatā kho, nigrodha, tapojigucchā aggappattā ca hoti sārappattā ca. Iti kho, nigrodha [iti nigrodha (syā.)], yaṃ maṃ tvaṃ avacāsi – ‘ko nāma so, bhante, bhagavato dhammo, yena bhagavā sāvake vineti, yena bhagavatā sāvakā vinītā assāsappattā paṭijānanti ajjhāsayaṃ ādibrahmacariya’nti. Iti kho taṃ, nigrodha, ṭhānaṃ uttaritarañca paṇītatarañca, yenāhaṃ sāvake vinemi, yena mayā sāvakā vinītā assāsappattā paṭijānanti ajjhāsayaṃ ādibrahmacariya’’nti. Evaṃ vutte, te paribbājakā unnādino uccāsaddamahāsaddā ahesuṃ – ‘‘ettha mayaṃ anassāma sācariyakā, na mayaṃ ito bhiyyo uttaritaraṃ pajānāmā’’ti. ",
      "english": "To this extent, Nigrodha, ascetic self-mortification reaches its culmination and attains its essence. Thus, Nigrodha, regarding what you asked me: 'Venerable Sir, what is that teaching of the Blessed One by which the Blessed One disciplines his disciples, by which the disciples, having been disciplined by the Blessed One, declare that they have attained assurance and a deep-seated commitment to the fundamental holy life?' Thus, Nigrodha, that is the position that is far superior and more sublime, by which I discipline my disciples, and by which my disciples, having been disciplined by me, declare that they have attained assurance and a deep-seated commitment to the fundamental holy life. When this was said, those wanderers became noisy, raising a loud and great clamour, saying: \"Here we are undone, together with our teachers! We do not know anything further or more sublime than this!\"",
      "sinhala": "‘‘මේ තරමින්මයි, නිග්‍රෝධය, තපස් පිළිකුළ අග්‍ර තත්ත්වයටද, සාරයටද පැමිණෙන්නේය. එසේ නම්, නිග්‍රෝධය, ඔබ මා හට යමක් කීවේද – ‘ස්වාමීනි, භාග්‍ය\\u200Dවතුන් වහන්සේ යම් ධර්මයකින් ශ්‍රා\\u200Dවකයන් හික්මවන්නේද, යම් ධර්මයකින් භාග්‍ය\\u200Dවතුන් වහන්සේ විසින් හික්මවන ලද ශ්‍රා\\u200Dවකයෝ සැනසීම ලබා, බ්‍ර\\u200Dහ්මචර්යාවේ ආරම්භය වශයෙන් අධිෂ්ඨානයක් පිළිගනිත්ද, ඒ භාග්‍ය\\u200Dවතුන් වහන්සේගේ ධර්මය කුමක් නම්දැයි.’ එසේ නම්, නිග්‍රෝධය, ඒ කරුණ උත්තරීතර සහ ප්‍ර\\u200Dණීතතර දෙයකි, යම් ධර්මයකින් මම ශ්‍රා\\u200Dවකයන් හික්මවම්ද, යම් ධර්මයකින් මා විසින් හික්මවන ලද ශ්‍රා\\u200Dවකයෝ සැනසීම ලබා, බ්‍ර\\u200Dහ්මචර්යාවේ ආරම්භය වශයෙන් අධිෂ්ඨානයක් පිළිගනිත්ද. මෙලෙස කී කල්හි, ඒ පිරිවැජියෝ මහා නාදයෙන්, මහත් හඬින් යුක්තව මෙසේ කීහ – ‘‘මෙතැනදී අපි අපගේ ආචාර්යවරුන් සමඟ පරාජයට පත් වන්නෙමු, මෙයට වඩා උසස් දෙයක් අපි නොදනිමු.’’",
      "paliTitle": ""
    },
    {
      "number": 75,
      "pali": "Yadā aññāsi sandhāno gahapati – ‘‘aññadatthu kho dānime aññatitthiyā paribbājakā bhagavato bhāsitaṃ sussūsanti, sotaṃ odahanti, aññācittaṃ upaṭṭhāpentī’’ti. Atha [atha naṃ (ka.)] nigrodhaṃ paribbājakaṃ etadavoca – ‘‘iti kho, bhante nigrodha, yaṃ maṃ tvaṃ avacāsi – ‘yagghe, gahapati, jāneyyāsi, kena samaṇo gotamo saddhiṃ sallapati, kena sākacchaṃ samāpajjati, kena paññāveyyattiyaṃ samāpajjati, suññāgārahatā samaṇassa gotamassa paññā, aparisāvacaro samaṇo gotamo nālaṃ sallāpāya, so antamantāneva sevati; seyyathāpi nāma gokāṇā pariyantacārinī antamantāneva sevati. Evameva suññāgārahatā samaṇassa gotamassa paññā, aparisāvacaro samaṇo gotamo nālaṃ sallāpāya; so antamantāneva sevati; iṅgha, gahapati, samaṇo gotamo imaṃ parisaṃ āgaccheyya, ekapañheneva naṃ saṃsādeyyāma, tucchakumbhīva naṃ maññe orodheyyāmā’ti. Ayaṃ kho so, bhante, bhagavā arahaṃ sammāsambuddho idhānuppatto, aparisāvacaraṃ pana naṃ karotha, gokāṇaṃ pariyantacāriniṃ karotha, ekapañheneva naṃ saṃsādetha, tucchakumbhīva naṃ orodhethā’’ti. Evaṃ vutte, nigrodho paribbājako tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno nisīdi.",
      "english": "When Sandhāna the householder understood that these ascetics of other sects were indeed listening intently to the Blessed One’s discourse, giving ear, and applying a receptive mind, he then said to Nigrodha the ascetic: \"Indeed, Venerable Nigrodha, what you said to me was: 'Indeed, householder, you should know with whom Sakyamuni Gotama converses, with whom he engages in discussion, with whom he attains proficiency in wisdom. Sakyamuni Gotama's wisdom is like that of an empty house; he does not frequent assemblies, he is unfit for conversation, he associates only with the fringes. Just as a one-eyed cow, wandering along the edges, associates only with the fringes, even so, Sakyamuni Gotama's wisdom is like that of an empty house; he does not frequent assemblies, he is unfit for conversation; he associates only with the fringes. Come, householder, if Sakyamuni Gotama were to come to this assembly, we would surely corner him with a single question, and just like an empty pot, we would, I think, obstruct him.' Here, Venerable sir, is that Blessed One, the Arahant, the Perfectly Self-Awakened One, who has arrived. Now, make him one who does not frequent assemblies, make him a one-eyed cow wandering along the edges, corner him with a single question, and obstruct him like an empty pot!\" When this was said, Nigrodha the ascetic became silent, dismayed, with slumped shoulders, downcast face, brooding deeply, and sat there speechless.",
      "sinhala": "සන්ධාන ගෘහපති තෙමේ මේ අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ භාග්‍යවතුන් වහන්සේගේ දෙසුම හොඳින් අසති, සිත යොදවති, (තමන්ගේ) වෙනත් සිතක් ඇතිකරගනිති (හෙවත් ඒ දෙසට හැරෙති) යැයි දැනගත් කල, නිග්‍රෝධ පරිබ්‍රාජකයාට මෙසේ කීවේය: “පින්වත් නිග්‍රෝධ, ඔබ මට යමක් කීවේද, එනම්: ‘ගෘහපතිය, ඔබ දැනගන්න, ශ්‍රමණ ගෞතමයන් වහන්සේ කා සමඟ සාකච්ඡා කරත්ද? කා සමඟ කතාබහ කරත්ද? කා සමඟ ප්‍රඥාව ප්‍රකට කරත්ද? ශ්‍රමණ ගෞතමයන් වහන්සේගේ ප්‍රඥාව හිස් ගෙයකට සුදුසුය. උන්වහන්සේ පිරිසට සමීප නැත්තෙකි. කතාබහ කිරීමට නුසුදුසුය. උන්වහන්සේ අන්ත සේනාසන (හුදකලා තැන්) ම සේවනය කරති. හරියට අඩුවැඩි ගොන් දෙනක් (ගොන් වැස්සියක්) අන්ත ප්‍රදේශවල ම හැසිරෙන්නී අන්ත සේනාසන ම සේවනය කරන්නාක් මෙනි. එසේම ශ්‍රමණ ගෞතමයන් වහන්සේගේ ප්‍රඥාව හිස් ගෙයකට සුදුසුය. උන්වහන්සේ පිරිසට සමීප නැත්තෙකි. කතාබහ කිරීමට නුසුදුසුය. උන්වහන්සේ අන්ත සේනාසන ම සේවනය කරති. එසේනම් ගෘහපතිය, ශ්‍රමණ ගෞතමයන් වහන්සේ මේ පිරිස වෙත පැමිණෙත්වා, අපි උන්වහන්සේව එක ප්‍රශ්නයකින් ම ව්‍යාකූල කරන්නෙමු, හිස් කළයක් මෙන් උන්වහන්සේව අවහිර කරන්නෙමු’ කියා. පින්වත්නි, මේ ඒ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ මෙහි පැමිණ සිටිති. එසේ නම් උන්වහන්සේව පිරිසට සමීප නැත්තෙකු කරන්න, අන්ත ප්‍රදේශවල හැසිරෙන අඩුවැඩි ගොන් දෙනක් මෙන් කරන්න, එක ප්‍රශ්නයකින් ම උන්වහන්සේව ව්‍යාකූල කරන්න, හිස් කළයක් මෙන් අවහිර කරන්නැ”යි කීවේය. මෙසේ කී කල්හි, නිග්‍රෝධ පරිබ්‍රාජක තෙමේ නිශ්ශබ්ද වී, ලැජ්ජාවට පත්වී, උරහිස් එල්ලාගෙන, යටිකුරු මුහුණින් යුතුව, කල්පනා කරමින්, ප්‍රතිචාරයක් නොමැතිව වාඩි වී සිටියේය.",
      "paliTitle": "Nigrodhassa pajjhāyanaṃ",
      "englishTitle": "Nigrodha's Contemplation",
      "sinhalaTitle": "නිග්‍රෝධගේ කල්‍පනාව"
    },
    {
      "number": 76,
      "pali": "Atha kho bhagavā nigrodhaṃ paribbājakaṃ tuṇhībhūtaṃ maṅkubhūtaṃ pattakkhandhaṃ adhomukhaṃ pajjhāyantaṃ appaṭibhānaṃ viditvā nigrodhaṃ paribbājakaṃ etadavoca – ‘‘saccaṃ kira, nigrodha, bhāsitā te esā vācā’’ti? ‘‘Saccaṃ, bhante, bhāsitā me esā vācā, yathābālena yathāmūḷhena yathāakusalenā’’ti. ‘‘Taṃ kiṃ maññasi, nigrodha. Kinti te sutaṃ paribbājakānaṃ vuḍḍhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ‘ye te ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, evaṃ su te bhagavanto saṃgamma samāgamma unnādino uccāsaddamahāsaddā anekavihitaṃ tiracchānakathaṃ anuyuttā viharanti. Seyyathidaṃ – rājakathaṃ corakathaṃ…pe… itibhavābhavakathaṃ iti vā. Seyyathāpi tvaṃ etarahi sācariyako. Udāhu, evaṃ su te bhagavanto araññavanapatthāni pantāni senāsanāni paṭisevanti appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppāni, seyyathāpāhaṃ etarahī’ti. ‘‘Sutaṃ metaṃ, bhante. Paribbājakānaṃ vuḍḍhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ‘ye te ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, na evaṃ su [nāssu (sī. pī.)] te bhagavanto saṃgamma samāgamma unnādino uccāsaddamahāsaddā anekavihitaṃ tiracchānakathaṃ anuyuttā viharanti. Seyyathidaṃ – rājakathaṃ corakathaṃ…pe… itibhavābhavakathaṃ iti vā, seyyathāpāhaṃ etarahi sācariyako. Evaṃ su te bhagavanto araññavanapatthāni pantāni senāsanāni paṭisevanti appasaddāni appanigghosāni vijanavātāni manussarāhasseyyakāni paṭisallānasāruppāni, seyyathāpi bhagavā etarahī’’’ti. ‘‘Tassa te, nigrodha, viññussa sato mahallakassa na etadahosi – ‘buddho so bhagavā bodhāya dhammaṃ deseti, danto so bhagavā damathāya dhammaṃ deseti, santo so bhagavā samathāya dhammaṃ deseti, tiṇṇo so bhagavā taraṇāya dhammaṃ deseti, parinibbuto so bhagavā parinibbānāya dhammaṃ desetī’’’ti? ",
      "english": "Then the Blessed One, seeing the wanderer Nigrodha silent, dismayed, with slumped shoulders, downcast, pondering, and bereft of words, said to him: \"Is it really true, Nigrodha, that this statement was made by you?\" \"It is true, venerable sir, that this statement was made by me, as a fool, as one deluded, as one unskillful.\"\n\n\"What do you think, Nigrodha? What have you heard the elder, senior wanderers, your teachers and teachers' teachers, saying: 'Did those who were Arahants, Fully Self-Awakened Ones in the past, meet together, gather together, making noise, with loud and great voices, engaging in various kinds of trivial talk? That is, talk of kings, talk of robbers, and so forth, or talk of this or that existence, just as you are now with your teacher. Or did those Blessed Ones resort to secluded wilderness and forest lodgings, quiet, free from loud noises, secluded from people, suitable for retreat and contemplation, just as I am now?'\"\n\n\"I have heard this, venerable sir. The elder, senior wanderers, my teachers and teachers' teachers, saying: 'Those who were Arahants, Fully Self-Awakened Ones in the past, did not meet together, gather together, making noise, with loud and great voices, engaging in various kinds of trivial talk; that is, talk of kings, talk of robbers, and so forth, or talk of this or that existence, just as I am now with my teacher. Rather, those Blessed Ones resorted to secluded wilderness and forest lodgings, quiet, free from loud noises, secluded from people, suitable for retreat and contemplation, just as the Blessed One is now.'\"\n\n\"How is it then, Nigrodha, that being intelligent, being a senior person, it did not occur to you: 'That Blessed One is awakened; he teaches the Dhamma for awakening. He is tamed; he teaches the Dhamma for taming. He is at peace; he teaches the Dhamma for peace. He has crossed over; he teaches the Dhamma for crossing over. He is fully unburdened; he teaches the Dhamma for final unburdening'?\"",
      "sinhala": "එවිට භාග්‍ය‍වතුන් වහන්සේ නිශ්ශබ්ද වී, පසුබට වී, උරහිස් එල්ලා වැටී, මුහුණ පහතට කරගෙන, කල්පනා කරමින්, කිසිවක් පිළිතුරු දීමට නොහැකිව සිටි නිග‍්‍රෝධ පිරිවැජියා දැක ඔහුට මෙසේ වදාළ සේක: “නිග‍්‍රෝධය, සැබැවින්ම මේ වචනය ඔබ විසින්ම කියන ලද්දක්ද?” “ඇත්තය, ස්වාමීනි, මේ වචනය මා විසින්ම කියන ලද්දකි. බාලයෙකු විසින්, මුළා වූවෙකු විසින්, අදක්ෂයෙකු විසින් කියන ලද්දක් සේය.”\n\n“නිග‍්‍රෝධය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? වයෝවෘද්ධ වූ, මහලු වූ, ආචාර්යවරුන් වූ, ආචාර්යවරුන්ගේද ආචාර්යවරුන් වූ පිරිවැජියන් කියන විට ඔබට අසන්නට ලැබුණේ කෙසේද? ‘අතීත කාලයෙහි පහළ වූ යම් අරහත් සම්මා සම්බුදුවරයන් වහන්සේලා සිටියාහුද, ඒ භාග්‍ය‍වතුන් වහන්සේලාද එක්රැස් වී, සමීප වී, මහත් ශබ්ද නගමින්, ඝෝෂා කරමින්, නොයෙක් ආකාර වූ තිරශ්චීන කථාවල යෙදී වාසය කළාහුද? එනම් රාජ කථා, චෝර කථා... මෙලොව පරලලොව පිළිබඳ කථා ආදියෙහිද? යම් සේ ඔබත් ඔබේ ආචාර්යවරයාත් දැන් එසේ කතා කරමින් සිටින්නහුද, එසේමද? නැතහොත්, ඒ භාග්‍ය‍වතුන් වහන්සේලා ශබ්ද රහිත වූ, ඝෝෂා රහිත වූ, ජනයාගෙන් තොර වූ, මිනිසුන් නැති ස්ථාන වූ, පටිසල්ලානයට සුදුසු වූ, අරණ්‍ය, වන ප‍්‍රදේශයන්, හුදෙකලා සේනාසන සේවනය කළාහුද? යම් සේ මා දැන් එසේ සේවනය කරමිද, එසේමද?’ ”\n\n“ස්වාමීනි, මේ මා විසින් අසන ලද්දකි. වයෝවෘද්ධ වූ, මහලු වූ, ආචාර්යවරුන් වූ, ආචාර්යවරුන්ගේද ආචාර්යවරුන් වූ පිරිවැජියන් කියනු ලබන විට මා විසින් අසන ලද්දේ නම්, 'අතීත කාලයෙහි පහළ වූ යම් අරහත් සම්මා සම්බුදුවරයන් වහන්සේලා සිටියාහුද, ඒ භාග්‍ය‍වතුන් වහන්සේලා එක්රැස් වී, සමීප වී, මහත් ශබ්ද නගමින්, ඝෝෂා කරමින්, නොයෙක් ආකාර වූ තිරශ්චීන කථාවල යෙදී වාසය නොකළාහුය. එනම් රාජ කථා, චෝර කථා... මෙලොව පරලොව පිළිබඳ කථා ආදියෙහිද? යම් සේ මාත්, මාගේ ආචාර්යවරයාත් දැන් එසේ කතා කරමින් සිටිමුද, එසේ නොවූහ. ඒ භාග්‍ය‍වතුන් වහන්සේලා ශබ්ද රහිත වූ, ඝෝෂා රහිත වූ, ජනයාගෙන් තොර වූ, මිනිසුන් නැති ස්ථාන වූ, පටිසල්ලානයට සුදුසු වූ අරණ්‍ය, වන ප‍්‍රදේශයන්, හුදෙකලා සේනාසන සේවනය කළාහුය. යම් සේ භාග්‍ය‍වතුන් වහන්සේ දැන් එසේ සේවනය කරන සේක, එසේම’ යනුවෙනි.”\n\n“නිග‍්‍රෝධය, දැනුමැති මහලු අයෙකු වූ ඔබට මේ සිතුවිල්ල ඇති නොවුණාද? ‘ඒ භාග්‍ය‍වතුන් වහන්සේ බුද්ධ වූ සේක, බෝධිය පිණිස ධර්මය දේශනා කරන සේක. ඒ භාග්‍ය‍වතුන් වහන්සේ දමනය වූ සේක, දමනය පිණිස ධර්මය දේශනා කරන සේක. ඒ භාග්‍ය‍වතුන් වහන්සේ ශාන්ත වූ සේක, ශමථය පිණිස ධර්මය දේශනා කරන සේක. ඒ භාග්‍ය‍වතුන් වහන්සේ (සසරින්) එතෙර වූ සේක, එතෙර වීම පිණිස ධර්මය දේශනා කරන සේක. ඒ භාග්‍ය‍වතුන් වහන්සේ පිරිනිවුණු සේක, පිරිනිවීම පිණිස ධර්මය දේශනා කරන සේක.’ යනුවෙන් නොසිතුනාද?”",
      "paliTitle": ""
    },
    {
      "number": 77,
      "pali": "Evaṃ vutte, nigrodho paribbājako bhagavantaṃ etadavoca – ‘‘accayo maṃ, bhante, accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yvāhaṃ evaṃ bhagavantaṃ avacāsiṃ. Tassa me, bhante, bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃ saṃvarāyā’’ti. ‘‘Taggha tvaṃ [taṃ (sī. syā. pī.)], nigrodha, accayo accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yo maṃ tvaṃ evaṃ avacāsi. Yato ca kho tvaṃ, nigrodha, accayaṃ accayato disvā yathādhammaṃ paṭikarosi, taṃ te mayaṃ paṭiggaṇhāma. Vuddhi hesā, nigrodha, ariyassa vinaye, yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti āyatiṃ saṃvaraṃ āpajjati. Ahaṃ kho pana, nigrodha, evaṃ vadāmi – ‘Etu viññū puriso asaṭho amāyāvī ujujātiko, ahamanusāsāmi ahaṃ dhammaṃ desemi. Yathānusiṭṭhaṃ tathā [yathānusiṭṭhaṃ (?)] paṭipajjamāno, yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati sattavassāni. Tiṭṭhantu, nigrodha, satta vassāni. Etu viññū puriso asaṭho amāyāvī ujujātiko, ahamanusāsāmi ahaṃ dhammaṃ desemi. Yathānusiṭṭhaṃ tathā paṭipajjamāno, yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati cha vassāni. Pañca vassāni… cattāri vassāni… tīṇi vassāni… dve vassāni… ekaṃ vassaṃ. Tiṭṭhatu, nigrodha, ekaṃ vassaṃ. Etu viññū puriso asaṭho amāyāvī ujujātiko ahamanusāsāmi ahaṃ dhammaṃ desemi. Yathānusiṭṭhaṃ tathā paṭipajjamāno, yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati satta māsāni. Tiṭṭhantu, nigrodha, satta māsāni… cha māsāni… pañca māsāni … cattāri māsāni… tīṇi māsāni… dve māsāni… ekaṃ māsaṃ… aḍḍhamāsaṃ. Tiṭṭhatu, nigrodha, aḍḍhamāso. Etu viññū puriso asaṭho amāyāvī ujujātiko, ahamanusāsāmi ahaṃ dhammaṃ desemi. Yathānusiṭṭhaṃ tathā paṭipajjamāno, yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati sattāhaṃ’.",
      "english": "When this was said, the wanderer Nigrodha said to the Blessed One: “An offense has overcome me, venerable sir, like a fool, like a deluded one, like an unskillful one, in that I spoke thus to the Blessed One. Therefore, venerable sir, may the Blessed One accept my offense as an offense, for future restraint.”\n\n“Indeed, Nigrodha, an offense has overcome you, like a fool, like a deluded one, like an unskillful one, in that you spoke thus to me. But since, Nigrodha, having seen your offense as an offense, you make amends according to the Dhamma, we accept it from you. For this is growth, Nigrodha, in the Noble Discipline: when one, having seen an offense as an offense, makes amends according to the Dhamma and undertakes future restraint.\n\nBut I, Nigrodha, say this: Let an intelligent person come, one who is not deceitful, not fraudulent, and straightforward by nature. I will instruct; I will teach the Dhamma. Practicing as instructed, he will, having directly known and realized for himself in this very life that unsurpassed culmination of the holy life—for the sake of which noble sons rightly go forth from home into homelessness—attain it and dwell for seven years. Let seven years stand, Nigrodha. Let an intelligent person come, one who is not deceitful, not fraudulent, and straightforward by nature. I will instruct; I will teach the Dhamma. Practicing as instructed, he will, having directly known and realized for himself in this very life that unsurpassed culmination of the holy life—for the sake of which noble sons rightly go forth from home into homelessness—attain it and dwell for six years. Five years… four years… three years… two years… one year. Let one year stand, Nigrodha. Let an intelligent person come, one who is not deceitful, not fraudulent, and straightforward by nature. I will instruct; I will teach the Dhamma. Practicing as instructed, he will, having directly known and realized for himself in this very life that unsurpassed culmination of the holy life—for the sake of which noble sons rightly go forth from home into homelessness—attain it and dwell for seven months. Let seven months stand, Nigrodha… six months… five months… four months… three months… two months… one month… half a month. Let half a month stand, Nigrodha. Let an intelligent person come, one who is not deceitful, not fraudulent, and straightforward by nature. I will instruct; I will teach the Dhamma. Practicing as instructed, he will, having directly known and realized for himself in this very life that unsurpassed culmination of the holy life—for the sake of which noble sons rightly go forth from home into homelessness—attain it and dwell for seven days.",
      "sinhala": "මෙසේ කී කල්හි නිග්‍රෝධ පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"ස්වාමීනි, මා හට අඥානයෙකු මෙන්, මුළාවූවෙකු මෙන්, අකුසල පුද්ගලයෙකු මෙන් වරදක් විය, මම භාග්‍යවතුන් වහන්සේට මෙසේ කී බැවිනි. ස්වාමීනි, ඉදිරියේදී සංවරය පිණිස, භාග්‍යවතුන් වහන්සේ මාගේ ඒ වරද වරදක් ලෙස පිළිගන්නා සේක්වා.\"\n\n\"සැබැවින්ම, නිග්‍රෝධය, නුඹ අඥානයෙකු මෙන්, මුළාවූවෙකු මෙන්, අකුසල පුද්ගලයෙකු මෙන් වරදක් කළේය, මන්ද නුඹ මට මෙසේ කී බැවිනි. නිග්‍රෝධය, නුඹ වරද වරදක් ලෙස දැක ධර්මානුකූලව පිළිසකර කරන්නා වූ හෙයින්, අපි එය පිළිගනිමු. නිග්‍රෝධය, වරද වරදක් ලෙස දැක ධර්මානුකූලව පිළිසකර කොට ඉදිරියේදී සංවරයට පැමිණීම ආර්ය විනයෙහි දියුණුවකි. එම්බා නිග්‍රෝධය, මම මෙසේ කියමි: 'කුහක නොවූ, මායා රහිත වූ, අවංක ස්වභාවයක් ඇති, නුවණැති පුරුෂයෙක් පැමිණේවා. මම ඔහුට අනුශාසනා කරන්නෙමි, මම ධර්මය දේශනා කරන්නෙමි. මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදින්නේ, යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික බවට පැමිණෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචර්යාවේ අවසානය මේ ආත්මයෙහිදීම තමන් විසින්ම අවබෝධ කොට ප්‍රත්‍යක්ෂ කරගෙන අවුරුදු හතක් වාසය කරන්නේය.' නිග්‍රෝධය, සත් වසක් තබා. කුහක නොවූ, මායා රහිත වූ, අවංක ස්වභාවයක් ඇති, නුවණැති පුරුෂයෙක් පැමිණේවා. මම ඔහුට අනුශාසනා කරන්නෙමි, මම ධර්මය දේශනා කරන්නෙමි. මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදින්නේ, යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික බවට පැමිණෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචර්යාවේ අවසානය මේ ආත්මයෙහිදීම තමන් විසින්ම අවබෝධ කොට ප්‍රත්‍යක්ෂ කරගෙන අවුරුදු හයක් වාසය කරන්නේය. අවුරුදු පහක්... අවුරුදු හතරක්... අවුරුදු තුනක්... අවුරුදු දෙකක්... එක් අවුරුද්දක්. නිග්‍රෝධය, එක් වසක් තබා. කුහක නොවූ, මායා රහිත වූ, අවංක ස්වභාවයක් ඇති, නුවණැති පුරුෂයෙක් පැමිණේවා. මම ඔහුට අනුශාසනා කරන්නෙමි, මම ධර්මය දේශනා කරන්නෙමි. මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදින්නේ, යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික බවට පැමිණෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචර්යාවේ අවසානය මේ ආත්මයෙහිදීම තමන් විසින්ම අවබෝධ කොට ප්‍රත්‍යක්ෂ කරගෙන මාස හතක් වාසය කරන්නේය. නිග්‍රෝධය, සත් මසක් තබා... සය මසක්... පස් මසක්... සිව් මසක්... තෙ මසක්... දෙ මසක්... එක් මසක්... අඩ මසක්. නිග්‍රෝධය, අඩ මසක් තබා. කුහක නොවූ, මායා රහිත වූ, අවංක ස්වභාවයක් ඇති, නුවණැති පුරුෂයෙක් පැමිණේවා. මම ඔහුට අනුශාසනා කරන්නෙමි, මම ධර්මය දේශනා කරන්නෙමි. මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදින්නේ, යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික බවට පැමිණෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචර්යාවේ අවසානය මේ ආත්මයෙහිදීම තමන් විසින්ම අවබෝධ කොට ප්‍රත්‍යක්ෂ කරගෙන සත් දවසක් වාසය කරන්නේය.\"",
      "paliTitle": "Brahmacariyapariyosānasacchikiriyā",
      "englishTitle": "Realization of the Holy Life's Consummation",
      "sinhalaTitle": "බඹසර අවසානය සාක‍්ෂාත‍් කිරීම"
    },
    {
      "number": 78,
      "pali": "‘‘Siyā kho pana te, nigrodha, evamassa – ‘antevāsikamyatā no samaṇo gotamo evamāhā’ti. Na kho panetaṃ, nigrodha, evaṃ daṭṭhabbaṃ. Yo eva vo [te (sī. syā.)] ācariyo, so eva vo ācariyo hotu. Siyā kho pana te, nigrodha, evamassa – ‘uddesā no cāvetukāmo samaṇo gotamo evamāhā’ti. Na kho panetaṃ, nigrodha, evaṃ daṭṭhabbaṃ. Yo eva vo uddeso so eva vo uddeso hotu. Siyā kho pana te, nigrodha, evamassa – ‘ājīvā no cāvetukāmo samaṇo gotamo evamāhā’ti. Na kho panetaṃ, nigrodha, evaṃ daṭṭhabbaṃ. Yo eva vo ājīvo, so eva vo ājīvo hotu. Siyā kho pana te, nigrodha, evamassa – ‘ye no dhammā akusalā akusalasaṅkhātā sācariyakānaṃ, tesu patiṭṭhāpetukāmo samaṇo gotamo evamāhā’ti. Na kho panetaṃ, nigrodha, evaṃ daṭṭhabbaṃ. Akusalā ceva vo te dhammā [vodhammā (ka.), te dhammā (syā.)] hontu akusalasaṅkhātā ca sācariyakānaṃ. Siyā kho pana te, nigrodha, evamassa – ‘ye no dhammā kusalā kusalasaṅkhātā sācariyakānaṃ, tehi vivecetukāmo samaṇo gotamo evamāhā’ti. Na kho panetaṃ, nigrodha, evaṃ daṭṭhabbaṃ. Kusalā ceva vo te dhammā hontu kusalasaṅkhātā ca sācariyakānaṃ. Iti khvāhaṃ, nigrodha, neva antevāsikamyatā evaṃ vadāmi, napi uddesā cāvetukāmo evaṃ vadāmi, napi ājīvā cāvetukāmo evaṃ vadāmi, napi ye vo dhammā [napi ye kho dhammā (sī.), napi ye te dhammā (syā.), napi ye ca vo dhammā (ka.)] akusalā akusalasaṅkhātā sācariyakānaṃ, tesu patiṭṭhāpetukāmo evaṃ vadāmi, napi ye vo dhammā [napi ye kho dhammā (sī.), napi ye te dhammā (syā.), napi ye ca vo dhammā (ka.)] kusalā kusalasaṅkhātā sācariyakānaṃ, tehi vivecetukāmo evaṃ vadāmi. Santi ca kho, nigrodha, akusalā dhammā appahīnā saṃkilesikā ponobbhavikā [ponobhavikā (ka.)] sadarā [saddarā (pī. ka.), sadarathā (syā. ka.)] dukkhavipākā āyatiṃ jātijarāmaraṇiyā, yesāhaṃ pahānāya dhammaṃ desemi. Yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodānīyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’’ti.",
      "english": "Perhaps, Nigrodha, you might think: ‘The ascetic Gotama speaks thus because he desires to have us as his disciples.’ But, Nigrodha, this should not be seen in such a way. Let your own teacher remain your teacher. Perhaps, Nigrodha, you might think: ‘The ascetic Gotama speaks thus because he wants to turn us away from our doctrines.’ But, Nigrodha, this should not be seen in such a way. Let your own doctrines remain your doctrines. Perhaps, Nigrodha, you might think: ‘The ascetic Gotama speaks thus because he wants to turn us away from our way of life.’ But, Nigrodha, this should not be seen in such a way. Let your own way of life remain your way of life. Perhaps, Nigrodha, you might think: ‘The ascetic Gotama speaks thus because he wants to establish us in those teachings which our teachers deem unwholesome.’ But, Nigrodha, this should not be seen in such a way. Let those teachings of yours, which your teachers deem unwholesome, remain unwholesome for you. Perhaps, Nigrodha, you might think: ‘The ascetic Gotama speaks thus because he wants to separate us from those teachings which our teachers deem wholesome.’ But, Nigrodha, this should not be seen in such a way. Let those teachings of yours, which your teachers deem wholesome, remain wholesome for you.\n\nThus, Nigrodha, I do not speak in such a way out of a desire for you to be my disciples, nor do I speak thus to turn you away from your doctrines, nor do I speak thus to turn you away from your way of life, nor do I speak thus to establish you in those teachings which your teachers deem unwholesome, nor do I speak thus to separate you from those teachings which your teachers deem wholesome. But, Nigrodha, there are unwholesome states that are unabandoned, conducive to defilement, bringing about renewed existence, accompanied by distress, resulting in suffering, and leading to future birth, aging, and death. It is for the abandonment of these that I teach the Dhamma. As you practice accordingly, the defiling states will be abandoned, the purifying states will increase, and having realized for yourselves, with direct knowledge, the fullness and abundance of wisdom in this very life, you will enter and abide therein.",
      "sinhala": "නිග්‍රෝධයෙනි, සමහර විට ඔබට මෙසේ සිතෙන්නට පුළුවන: ‘ශ්‍රමණ ගෞතමයන් වහන්සේ අපව තමන්ගේ අන්තේවාසිකයන් කරගැනීමේ කැමැත්තෙන් මෙසේ වදාළා’ කියා. එහෙත්, නිග්‍රෝධයෙනි, එය එසේ දැක්ක යුතු නොවේ. ඔබලාගේ ආචාර්යවරයා ඔබලාගේ ආචාර්යවරයාම වේවා. නිග්‍රෝධයෙනි, සමහර විට ඔබට මෙසේ සිතෙන්නට පුළුවන: ‘ශ්‍රමණ ගෞතමයන් වහන්සේ අපගේ ඉගැන්වීමෙන් අපව චලනය කරවීමේ කැමැත්තෙන් මෙසේ වදාළා’ කියා. එහෙත්, නිග්‍රෝධයෙනි, එය එසේ දැක්ක යුතු නොවේ. ඔබලාගේ ඉගැන්වීම ඔබලාගේ ඉගැන්වීමම වේවා. නිග්‍රෝධයෙනි, සමහර විට ඔබට මෙසේ සිතෙන්නට පුළුවන: ‘ශ්‍රමණ ගෞතමයන් වහන්සේ අපගේ ආජීවයෙන් (ජීවනෝපායෙන්) අපව චලනය කරවීමේ කැමැත්තෙන් මෙසේ වදාළා’ කියා. එහෙත්, නිග්‍රෝධයෙනි, එය එසේ දැක්ක යුතු නොවේ. ඔබලාගේ ආජීවය ඔබලාගේ ආජීවයම වේවා. නිග්‍රෝධයෙනි, සමහර විට ඔබට මෙසේ සිතෙන්නට පුළුවන: ‘ශ්‍රමණ ගෞතමයන් වහන්සේ අපගේ ආචාර්යවරුන් විසින් අකුසල ධර්ම ලෙස නම් කර ඇති, අකුසල යැයි සැලකෙන යම් ධර්මතා ඇද්ද, ඒවායෙහිම අපව පිහිටුවීමේ කැමැත්තෙන් මෙසේ වදාළා’ කියා. එහෙත්, නිග්‍රෝධයෙනි, එය එසේ දැක්ක යුතු නොවේ. ඔබලාගේ ආචාර්යවරුන් විසින් අකුසල ධර්ම ලෙස නම් කර ඇති, අකුසල යැයි සැලකෙන ඒ ධර්මතා අකුසල ධර්ම ලෙසම පවතීවා. නිග්‍රෝධයෙනි, සමහර විට ඔබට මෙසේ සිතෙන්නට පුළුවන: ‘ශ්‍රමණ ගෞතමයන් වහන්සේ අපගේ ආචාර්යවරුන් විසින් කුසල ධර්ම ලෙස නම් කර ඇති, කුසල යැයි සැලකෙන යම් ධර්මතා ඇද්ද, ඒවායින් අපව වෙන් කිරීමේ කැමැත්තෙන් මෙසේ වදාළා’ කියා. එහෙත්, නිග්‍රෝධයෙනි, එය එසේ දැක්ක යුතු නොවේ. ඔබලාගේ ආචාර්යවරුන් විසින් කුසල ධර්ම ලෙස නම් කර ඇති, කුසල යැයි සැලකෙන ඒ ධර්මතා කුසල ධර්ම ලෙසම පවතීවා.\n\nනිග්‍රෝධයෙනි, මේ අයුරින් මම ඔබලා මගේ අන්තේවාසිකයන් කර ගැනීමේ කැමැත්තෙන් මෙසේ නොකියමි. ඔබලාගේ ඉගැන්වීමෙන් ඔබව චලනය කරවීමේ කැමැත්තෙන් මෙසේ නොකියමි. ඔබලාගේ ආජීවයෙන් ඔබව චලනය කරවීමේ කැමැත්තෙන් මෙසේ නොකියමි. ඔබලාගේ ආචාර්යවරුන් විසින් අකුසල ධර්ම ලෙස නම් කර ඇති, අකුසල යැයි සැලකෙන යම් ධර්මතා ඇද්ද, ඒවායෙහිම ඔබව පිහිටුවීමේ කැමැත්තෙන් මෙසේ නොකියමි. ඔබලාගේ ආචාර්යවරුන් විසින් කුසල ධර්ම ලෙස නම් කර ඇති, කුසල යැයි සැලකෙන යම් ධර්මතා ඇද්ද, ඒවායින් ඔබව වෙන් කිරීමේ කැමැත්තෙන් මෙසේ නොකියමි. එහෙත්, නිග්‍රෝධයෙනි, දුරු නොකරන ලද, කෙලෙස් සහිත වූ, නැවත භවයට හේතු වන, දුක් සහිත වූ, දුක් විපාක ඇති, අනාගතයේදී ජාති, ජරා, මරණයට හේතු වන යම් අකුසල ධර්මතා ඇද්ද, ඒවා දුරු කිරීම පිණිස මම ධර්මය දේශනා කරමි. මා දේශනා කරන ආකාරයට පිළිපදින විට, කෙලෙස් සහිත ධර්මතා දුරු වනු ඇත. පිරිසිදු ධර්මතා වැඩි දියුණු වනු ඇත. මේ ආත්මභාවයේදීම නුවණෙහි පූර්ණත්වය හා විශාලත්වය තමන් විසින්ම අවබෝධ කොට, සාක්ෂාත් කොට, ප්‍රත්‍යක්ෂ කොට වාසය කරනු ඇත.",
      "paliTitle": "Paribbājakānaṃ pajjhāyanaṃ",
      "englishTitle": "The Brooding of the Ascetics",
      "sinhalaTitle": "පරිබ්‍රාජකයන්ගේ මෙනෙහි කිරීම"
    },
    {
      "number": 79,
      "pali": "Evaṃ vutte, te paribbājakā tuṇhībhūtā maṅkubhūtā pattakkhandhā adhomukhā pajjhāyantā appaṭibhānā nisīdiṃsu yathā taṃ mārena pariyuṭṭhitacittā. Atha kho bhagavato etadahosi – ‘‘sabbe pime moghapurisā phuṭṭhā pāpimatā. Yatra hi nāma ekassapi na evaṃ bhavissati – ‘handa mayaṃ aññāṇatthampi samaṇe gotame brahmacariyaṃ carāma, kiṃ karissati sattāho’’’ti? Atha kho bhagavā udumbarikāya paribbājakārāme sīhanādaṃ naditvā vehāsaṃ abbhuggantvā gijjhakūṭe pabbate paccupaṭṭhāsi [paccuṭṭhāsi (sī. syā. pī.)]. Sandhāno pana gahapati tāvadeva rājagahaṃ pāvisīti. ",
      "english": "When this was said, those wanderers sat down silent, dismayed, with dropped shoulders, faces downcast, brooding, and speechless, as if their minds were assailed by Māra. Then it occurred to the Blessed One: “All these worthless men are assailed by the Evil One. How is it that not even one of them thinks this: ‘Come, let us practice the holy life with the ascetic Gotama, even if just to understand. What harm can seven days do?’” Then the Blessed One, having roared a lion's roar in the wanderers' park at Udumbarikā, rose into the air and reappeared on Vulture Peak mountain. But the householder Sandhāno entered Rājagaha at that very moment.",
      "sinhala": "මෙසේ පැවසූ කල්හි, ඒ පරිබ්‍රාජකයෝ නිහඬව, වික්ෂිප්තව, උරහිස් පහතට හෙළා, මුහුණු පහතට හරවා, මාරයා විසින් සිත් ආක්‍රමණය කරනු ලැබූවන් මෙන්, කල්පනාවේ නිමග්න වී, කිසිදු පිළිතුරක් රහිතව හිඳගත්හ.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේට මෙසේ සිතුණි: ‘‘මේ සියලු මෝඝ පුරුෂයෝ පාපී මාරයා විසින් වෙළා ගනු ලැබ සිටිති. කෙසේද යත්, එක් අයෙකුටවත් මෙසේ සිතක් ඇති නොවේද: ‘එම්බා, අපි අඥානකම නිසා හෝ ශ්‍රමණ ගෞතමයන් වහන්සේ යටතේ සත්දිනක් බ්‍රහ්මචාරීව වාසය කරමු, සත්දිනකින් කුමක් වනවාද?’ යනුවෙන්.’’\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ උදුම්බරිකා නම් පරිබ්‍රාජකාරාමයේදී සිංහනාදයක් කොට, අහසට නැගී ගිජ්ඣකූට පර්වතයෙහි පහළ වූ සේක. එහෙත් සන්ධෘන ගෘහපතියා එසැණින්ම රජගහනුවරට පිවිසියේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Udumbarikasuttaṃ niṭṭhitaṃ dutiyaṃ.",
    "english": "Second Udumbarika Sutta Concluded.",
    "sinhala": "දෙවැනි උදුම්බරික සූත‍්‍රය"
  }
}