{
  "id": "dn4",
  "title": {
    "pali": "Aggaññasuttaṃ",
    "english": "The Aggañña Sutta",
    "sinhala": "අග්ගඤ්ඤ සූත්‍රය"
  },
  "sections": [
    {
      "number": 111,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena vāseṭṭhabhāradvājā bhikkhūsu parivasanti bhikkhubhāvaṃ ākaṅkhamānā. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito pāsādā orohitvā pāsādapacchāyāyaṃ [pāsādacchāyāyaṃ (ka.)] abbhokāse caṅkamati.",
      "english": "Thus have I heard: At one time the Blessed One was dwelling at Sāvatthī, in the Eastern Park, in the palace of Migāramātā. Now at that time, Vāseṭṭha and Bhāradvāja were living as probationers among the bhikkhus, desiring the state of a bhikkhu. Then the Blessed One, arising from seclusion in the evening, descended from the palace and was walking in the open space in the shade behind the palace.",
      "sinhala": "මෙවන් ලෙසින් මා විසින් අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර පූර්වාරාමයෙහි මිගාරමාතු ප්‍රාසාදයේ වැඩවසන සේක. එකල වාසෙට්ඨ සහ භාරද්වාජ යන දෙදෙනා භික්ෂූන් අතර පරිවාසය කරමින් භික්ෂුභාවය අපේක්ෂා කළහ. අනතුරුව භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි ඒකාන්තයෙන් නැගිට ප්‍රාසාදයෙන් බැස ප්‍රාසාදයේ පිටුපස සෙවණෙහි එළිමහනේ සක්මන් කරන සේක.",
      "paliTitle": "Vāseṭṭhabhāradvājā",
      "englishTitle": "Vasettha and Bharadvaja",
      "sinhalaTitle": "වාසෙට්ඨභාරද්වාජා"
    },
    {
      "number": 112,
      "pali": "Addasā kho vāseṭṭho bhagavantaṃ sāyanhasamayaṃ paṭisallānā vuṭṭhitaṃ pāsādā orohitvā pāsādapacchāyāyaṃ abbhokāse caṅkamantaṃ. Disvāna bhāradvājaṃ āmantesi – ‘‘ayaṃ, āvuso bhāradvāja, bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito pāsādā orohitvā pāsādapacchāyāyaṃ abbhokāse caṅkamati. Āyāmāvuso bhāradvāja, yena bhagavā tenupasaṅkamissāma; appeva nāma labheyyāma bhagavato santikā [sammukhā (syā. ka.)] dhammiṃ kathaṃ savanāyā’’ti. ‘‘Evamāvuso’’ti kho bhāradvājo vāseṭṭhassa paccassosi.",
      "english": "Then Vāseṭṭha saw the Blessed One, having risen from seclusion in the evening, descending from the palace and pacing in the open air in the shadow of the palace. Having seen him, he addressed Bhāradvāja, \"This, friend Bhāradvāja, is the Blessed One, having risen from seclusion in the evening, descending from the palace and pacing in the open air in the shadow of the palace. Come, friend Bhāradvāja, let us go to where the Blessed One is; perhaps we might hear a talk on the Dhamma in the presence of the Blessed One.\" \"Very well, friend,\" Bhāradvāja replied to Vāseṭṭha.",
      "sinhala": "වාසෙට්ඨ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි භාවනාවෙන් නැගිට ප්‍රාසාදයෙන් බැස ප්‍රාසාදයේ සෙවණෙහි එළිමහනේ සක්මන් කරමින් වැඩ සිටිනු දුටුවේය. දැක භාරද්වාජ බ්‍රාහ්මණයාට කතා කොට, “භවත් භාරද්වාජයෙනි, අන්න ඒ භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි භාවනාවෙන් නැගිට ප්‍රාසාදයෙන් බැස ප්‍රාසාදයේ සෙවණෙහි එළිමහනේ සක්මන් කරන සේක. භවත් භාරද්වාජයෙනි, එන්න, යම් තැනක භාග්‍යවතුන් වහන්සේ වැඩ සිටින සේද, එහි යමු. භාග්‍යවතුන් වහන්සේගේ සමීපයෙන් ධර්ම කථාවක් ඇසීමට අපට ලැබෙන්නට පුළුවන”යි කීවේය. භාරද්වාජ බ්‍රාහ්මණ තෙමේ “එසේය, භවත්නි”යි කියා වාසෙට්ඨ බ්‍රාහ්මණයාට පිළිතුරු දුන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 113,
      "pali": "Atha kho vāseṭṭhabhāradvājā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā bhagavantaṃ caṅkamantaṃ anucaṅkamiṃsu. Atha kho bhagavā vāseṭṭhaṃ āmantesi – ‘‘tumhe khvattha, vāseṭṭha, brāhmaṇajaccā brāhmaṇakulīnā brāhmaṇakulā agārasmā anagāriyaṃ pabbajitā, kacci vo, vāseṭṭha, brāhmaṇā na akkosanti na paribhāsantī’’ti? ‘‘Taggha no, bhante, brāhmaṇā akkosanti paribhāsanti attarūpāya paribhāsāya paripuṇṇāya, no aparipuṇṇāyā’’ti. ‘‘Yathā kathaṃ pana vo, vāseṭṭha, brāhmaṇā akkosanti paribhāsanti attarūpāya paribhāsāya paripuṇṇāya, no aparipuṇṇāyā’’ti? ‘‘Brāhmaṇā, bhante, evamāhaṃsu – ‘brāhmaṇova seṭṭho vaṇṇo, hīnā aññe vaṇṇā [hīno añño vaṇṇo (sī. pī. ma. ni. 2 madhurasutta)]. Brāhmaṇova sukko vaṇṇo, kaṇhā aññe vaṇṇā [kaṇho añño vaṇṇo (sī. pī. ma. ni. 2 madhurasutta)]. Brāhmaṇāva sujjhanti, no abrāhmaṇā. Brāhmaṇāva [brāhmaṇā (syā.)] brahmuno puttā orasā mukhato jātā brahmajā brahmanimmitā brahmadāyādā. Te tumhe seṭṭhaṃ vaṇṇaṃ hitvā hīnamattha vaṇṇaṃ ajjhupagatā, yadidaṃ muṇḍake samaṇake ibbhe kaṇhe bandhupādāpacce. Tayidaṃ na sādhu, tayidaṃ nappatirūpaṃ, yaṃ tumhe seṭṭhaṃ vaṇṇaṃ hitvā hīnamattha vaṇṇaṃ ajjhupagatā yadidaṃ muṇḍake samaṇake ibbhe kaṇhe bandhupādāpacce’ti. Evaṃ kho no, bhante, brāhmaṇā akkosanti paribhāsanti attarūpāya paribhāsāya paripuṇṇāya, no aparipuṇṇāyā’’ti.",
      "english": "Then Vāseṭṭha and Bhāradvāja approached the Blessed One. Having approached, and having paid homage to the Blessed One, they followed the Blessed One as he was walking. Then the Blessed One addressed Vāseṭṭha, \"You, Vāseṭṭha, born into the brahmin caste, of brahmin lineage, having gone forth from a brahmin family from the household life into homelessness, do the brahmins, Vāseṭṭha, not revile and abuse you?\" \"Indeed, venerable sir, the brahmins revile and abuse us with fully justified abuse, not with unjustified abuse.\" \"But in what way, Vāseṭṭha, do the brahmins revile and abuse you with fully justified abuse, not with unjustified abuse?\" \"The brahmins, venerable sir, say thus: ‘The brahmin caste is the best caste; other castes are inferior. The brahmin caste is the fair caste; other castes are dark. Only brahmins are purified, not non-brahmins. Brahmins are the sons of Brahmā, born of his mouth, born of Brahmā, created by Brahmā, heirs of Brahmā. You have abandoned the best caste and have adopted the inferior caste, namely these shavelings, these ascetics, these menials, these dark fellows, offspring of the feet of Brahmā. This is not good, this is not fitting, that you have abandoned the best caste and have adopted the inferior caste, namely these shavelings, these ascetics, these menials, these dark fellows, offspring of the feet of Brahmā.’ Thus, venerable sir, the brahmins revile and abuse us with fully justified abuse, not with unjustified abuse.\"",
      "sinhala": "ඉක්බිති වස්සේට්ඨ භාරද්වාජ දෙදෙනා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ, භාග්‍යවතුන් වහන්සේ සක්මන් කරද්දී උන්වහන්සේ අනුව සක්මන් කළහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ වස්සේට්ඨයන් ඇමතූ සේක: ‘‘වස්සේට්ඨයෙනි, නුඹලා බ්‍රාහ්මණ කුලවල උපන් බ්‍රාහ්මණ ජාතිකයෝ වෙවු. බ්‍රාහ්මණ කුලවලින් ගිහිගෙන් නික්ම අනගාරික වූවාහුය. වස්සේට්ඨයෙනි, නුඹලාට බ්‍රාහ්මණයෝ බැණ වදින්නේ නැද්ද, පරිභව කරන්නේ නැද්දැ’’යි ඇසූ සේක. ‘‘භාග්‍යවතුන් වහන්ස, සැබැවින්ම බ්‍රාහ්මණයෝ අපට බැණ වදිති. සම්පූර්ණ වූ පරිභවයකින් පරිභව කරති. අසම්පූර්ණ පරිභවයකින් නොවේ’’යි කීහ. ‘‘වස්සේට්ඨයෙනි, කෙසේ නම් බ්‍රාහ්මණයෝ නුඹලාට සම්පූර්ණ වූ පරිභවයකින් බැණ වදිත්ද, පරිභව කෙරෙත්ද? අසම්පූර්ණ පරිභවයකින් නොවේදැ’’යි ඇසූ සේක. ‘‘භාග්‍යවතුන් වහන්ස, බ්‍රාහ්මණයෝ මෙසේ කියති: ‘බ්‍රාහ්මණ වර්ණයම ශ්‍රේෂ්ඨය. අනෙක් වර්ණ පහත්ය. බ්‍රාහ්මණ වර්ණයම සුදුය. අනෙක් වර්ණ කළුය. බ්‍රාහ්මණයෝම පිරිසිදු වෙති. බ්‍රාහ්මණයන් නොවූවෝ පිරිසිදු නොවෙති. බ්‍රාහ්මණයෝ බ්‍රහ්මයාගේ පුත්‍රයෝය. ඔහුගේ මුවින් උපන්නෝය. බ්‍රහ්මයාගෙන් හටගත්තෝය. බ්‍රහ්මයා විසින් මවන ලද්දෝය. බ්‍රහ්මයාගේ දායාදය ඇත්තෝය. නුඹලා මෙබඳු ශ්‍රේෂ්ඨ වර්ණයක් හැර මුඩු වූ, ශ්‍රමණයන් වූ, නිහීනයන් වූ, කළු වූ, බන්ධුපාදාපත්‍යයන් අදහන්නෝය. මෙය යහපත් නොවේ. මෙය නුසුදුසුය. මන්ද නුඹලා ශ්‍රේෂ්ඨ වර්ණයක් හැර මුඩු වූ, ශ්‍රමණයන් වූ, නිහීනයන් වූ, කළු වූ, බන්ධුපාදාපත්‍යයන් අදහන්නෝය’ කියායි. භාග්‍යවතුන් වහන්ස, මෙසේ බ්‍රාහ්මණයෝ අපට සම්පූර්ණ වූ පරිභවයකින් බැණ වදිති. පරිභව කරති. අසම්පූර්ණ පරිභවයකින් නොවේ’’යි කීහ.",
      "paliTitle": ""
    },
    {
      "number": 114,
      "pali": "‘‘Taggha vo, vāseṭṭha, brāhmaṇā porāṇaṃ assarantā evamāhaṃsu – ‘brāhmaṇova seṭṭho vaṇṇo, hīnā aññe vaṇṇā; brāhmaṇova sukko vaṇṇo, kaṇhā aññe vaṇṇā; brāhmaṇāva sujjhanti, no abrāhmaṇā; brāhmaṇāva brahmuno puttā orasā mukhato jātā brahmajā brahmanimmitā brahmadāyādā’ti. Dissanti kho pana, vāseṭṭha, brāhmaṇānaṃ brāhmaṇiyo utuniyopi gabbhiniyopi vijāyamānāpi pāyamānāpi. Te ca brāhmaṇā yonijāva samānā evamāhaṃsu – ‘brāhmaṇova seṭṭho vaṇṇo, hīnā aññe vaṇṇā; brāhmaṇova sukko vaṇṇo, kaṇhā aññe vaṇṇā; brāhmaṇāva sujjhanti, no abrāhmaṇā; brāhmaṇāva brahmuno puttā orasā mukhato jātā brahmajā brahmanimmitā brahmadāyādā’ti. Te [te ca (syā. ka.)] brahmānañceva abbhācikkhanti, musā ca bhāsanti, bahuñca apuññaṃ pasavanti. ",
      "english": "\"Indeed, Vāseṭṭha, these brahmins, while not knowing the ancient words, say thus: ‘Only brahmins are the best caste; other castes are inferior. Only brahmins are the fair caste; other castes are dark. Only brahmins are purified, not non-brahmins. Only brahmins are the offspring of Brahmā, born from his mouth, his creation, made by Brahmā, heirs of Brahmā.’ But indeed, Vāseṭṭha, the brahmins' wives are seen to have their periods, become pregnant, give birth, and nurse their children. Yet these brahmins, being born of a womb, say thus: ‘Only brahmins are the best caste; other castes are inferior. Only brahmins are the fair caste; other castes are dark. Only brahmins are purified, not non-brahmins. Only brahmins are the offspring of Brahmā, born from his mouth, his creation, made by Brahmā, heirs of Brahmā.’ They both slander Brahmā and speak falsely, and generate much demerit.\"",
      "sinhala": "“වාසෙට්ඨයෙනි, ඒකාන්තයෙන්ම බ්‍රාහ්මණයෝ පැරණි මන්ත්‍ර ගායනා කරමින් මෙසේ කියති – ‘බ්‍රාහ්මණ වර්ණයම ශ්‍රේෂ්ඨය, අනෙක් වර්ණයෝ පහත්ය; බ්‍රාහ්මණ වර්ණයම සුදුය, අනෙක් වර්ණයෝ කළුය; බ්‍රාහ්මණයෝම පිරිසිදු වෙති, අබ්‍රාහ්මණයෝ පිරිසිදු නොවෙති; බ්‍රාහ්මණයෝම බ්‍රහ්මයාගේ පුත්‍රයෝය, ඔහුගේම ඖරස පුත්‍රයෝය, මුඛයෙන් උපන්නෝය, බ්‍රහ්මයාගෙන් හටගත්තෝය, බ්‍රහ්මයා විසින් මවන ලද්දෝය, බ්‍රහ්මයාගේ දායාදය ලද්දෝය’ කියාය. එහෙත් වාසෙට්ඨයෙනි, බ්‍රාහ්මණ භාර්යාවෝ ඔවුනට ඔසප් වන්නියෝද වෙති, ගැබ්බර වන්නියෝද වෙති, දරුවන් වදන්නියෝද වෙති, කිරි පොවන්නියෝද වෙති. ඒ බ්‍රාහ්මණයෝ යෝනි මාර්ගයෙන්ම උපන් අය වෙමින් මෙසේ කියති – ‘බ්‍රාහ්මණ වර්ණයම ශ්‍රේෂ්ඨය, අනෙක් වර්ණයෝ පහත්ය; බ්‍රාහ්මණ වර්ණයම සුදුය, අනෙක් වර්ණයෝ කළුය; බ්‍රාහ්මණයෝම පිරිසිදු වෙති, අබ්‍රාහ්මණයෝ පිරිසිදු නොවෙති; බ්‍රාහ්මණයෝම බ්‍රහ්මයාගේ පුත්‍රයෝය, ඔහුගේම ඖරස පුත්‍රයෝය, මුඛයෙන් උපන්නෝය, බ්‍රහ්මයාගෙන් හටගත්තෝය, බ්‍රහ්මයා විසින් මවන ලද්දෝය, බ්‍රහ්මයාගේ දායාදය ලද්දෝය’ කියාය. ඔවුහු බ්‍රහ්මයාටද බොරු චෝදනා කරති, බොරුද කියති, බොහෝ අකුසල්ද රැස් කර ගනිති.”",
      "paliTitle": ""
    },
    {
      "number": 115,
      "pali": "‘‘Cattārome, vāseṭṭha, vaṇṇā – khattiyā, brāhmaṇā, vessā, suddā. Khattiyopi kho, vāseṭṭha, idhekacco pāṇātipātī hoti adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacitto micchādiṭṭhī. Iti kho, vāseṭṭha, yeme dhammā akusalā akusalasaṅkhātā sāvajjā sāvajjasaṅkhātā asevitabbā asevitabbasaṅkhātā naalamariyā naalamariyasaṅkhātā kaṇhā kaṇhavipākā viññugarahitā, khattiyepi te [kho vāseṭṭha (ka.)] idhekacce sandissanti. Brāhmaṇopi kho, vāseṭṭha…pe… vessopi kho, vāseṭṭha…pe… suddopi kho, vāseṭṭha, idhekacco pāṇātipātī hoti adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacitto micchādiṭṭhī. Iti kho, vāseṭṭha, yeme dhammā akusalā akusalasaṅkhātā…pe… kaṇhā kaṇhavipākā viññugarahitā; suddepi te idhekacce sandissanti. ‘‘Khattiyopi kho, vāseṭṭha, idhekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato, kāmesumicchācārā paṭivirato, musāvādā paṭivirato, pisuṇāya vācāya paṭivirato, pharusāya vācāya paṭivirato, samphappalāpā paṭivirato, anabhijjhālu abyāpannacitto, sammādiṭṭhī. Iti kho, vāseṭṭha, yeme dhammā kusalā kusalasaṅkhātā anavajjā anavajjasaṅkhātā sevitabbā sevitabbasaṅkhātā alamariyā alamariyasaṅkhātā sukkā sukkavipākā viññuppasatthā, khattiyepi te idhekacce sandissanti. Brāhmaṇopi kho, vāseṭṭha…pe… vessopi kho, vāseṭṭha…pe… suddopi kho, vāseṭṭha, idhekacco pāṇātipātā paṭivirato hoti…pe… anabhijjhālu, abyāpannacitto, sammādiṭṭhī. Iti kho, vāseṭṭha, yeme dhammā kusalā kusalasaṅkhātā anavajjā anavajjasaṅkhātā sevitabbā sevitabbasaṅkhātā alamariyā alamariyasaṅkhātā sukkā sukkavipākā viññuppasatthā; suddepi te idhekacce sandissanti.",
      "english": "\"Vāseṭṭha, there are these four classes: nobles, brahmins, merchants, and laborers. Now, Vāseṭṭha, some among the nobles here are those who kill living beings, take what is not given, engage in sexual misconduct, speak falsely, speak maliciously, speak harshly, engage in idle chatter, are covetous, have ill will in their minds, and hold wrong views. Thus, Vāseṭṭha, those unskillful qualities, reckoned as unskillful, blameworthy, reckoned as blameworthy, not to be cultivated, reckoned as not to be cultivated, ignoble, reckoned as ignoble, dark, with dark results, censured by the wise – some nobles here are found possessing them. Now, Vāseṭṭha, some among the brahmins… Now, Vāseṭṭha, some among the merchants… Now, Vāseṭṭha, some among the laborers here are those who kill living beings, take what is not given, engage in sexual misconduct, speak falsely, speak maliciously, speak harshly, engage in idle chatter, are covetous, have ill will in their minds, and hold wrong views. Thus, Vāseṭṭha, those unskillful qualities, reckoned as unskillful… dark, with dark results, censured by the wise – some laborers here are found possessing them. Now, Vāseṭṭha, some among the nobles here abstain from killing living beings, abstain from taking what is not given, abstain from sexual misconduct, abstain from false speech, abstain from malicious speech, abstain from harsh speech, abstain from idle chatter, are not covetous, have no ill will in their minds, and hold right view. Thus, Vāseṭṭha, those skillful qualities, reckoned as skillful, blameless, reckoned as blameless, to be cultivated, reckoned as to be cultivated, noble, reckoned as noble, bright, with bright results, praised by the wise – some nobles here are found possessing them. Now, Vāseṭṭha, some among the brahmins… Now, Vāseṭṭha, some among the merchants… Now, Vāseṭṭha, some among the laborers here abstain from killing living beings… are not covetous, have no ill will in their minds, and hold right view. Thus, Vāseṭṭha, those skillful qualities, reckoned as skillful, blameless, reckoned as blameless, to be cultivated, reckoned as to be cultivated, noble, reckoned as noble, bright, with bright results, praised by the wise – some laborers here are found possessing them.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ක්ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශුද්‍ර යනුවෙන් වර්ණ සතරක් ඇත. වාසෙට්ඨයෙනි, මෙලොව ඇතැම් ක්ෂත්‍රියයෙක් ප්‍රාණඝාතකයෙක් වේ. සොරකම් කරන්නෙක් වේ. කාමයෙහි වරදවා හැසිරෙන්නෙක් වේ. බොරු කියන්නෙක් වේ. කේලාම් කියන්නෙක් වේ. රළු වචන කියන්නෙක් වේ. හිස් වචන කියන්නෙක් වේ. අභිධ්‍යා ඇත්තෙක් වේ. ද්වේෂ සහගත සිතක් ඇත්තෙක් වේ. මිථ්‍යා දෘෂ්ටිකයෙක් වේ. වාසෙට්ඨයෙනි, අකුසල යයි සම්මත, අකුසල ගණයෙහිලා සැලකෙන, වරද සහිත යයි සම්මත, වරද සහිත ගණයෙහිලා සැලකෙන, නො ඇසුරු කළ යුතු යයි සම්මත, නො ඇසුරු කළ යුතු ගණයෙහිලා සැලකෙන, ආර්ය නොවූ යයි සම්මත, ආර්ය නොවූ ගණයෙහිලා සැලකෙන, කළු වූ, කළු විපාක ඇති, නුවණැත්තන් විසින් ගැරහිය යුතු යම් ධර්ම කෙනෙක් වෙත් ද, මෙලොව ඇතැම් ක්ෂත්‍රියයෝ ද ඒවාහි යෙදෙමින් සිටිති. වාසෙට්ඨයෙනි, බ්‍රාහ්මණයෝ ද ... වෛශ්‍යයෝ ද ... ශුද්‍රයෝ ද, මෙලොව ඇතැම් ශුද්‍රයෙක් ප්‍රාණඝාතකයෙක් වේ. සොරකම් කරන්නෙක් වේ. කාමයෙහි වරදවා හැසිරෙන්නෙක් වේ. බොරු කියන්නෙක් වේ. කේලාම් කියන්නෙක් වේ. රළු වචන කියන්නෙක් වේ. හිස් වචන කියන්නෙක් වේ. අභිධ්‍යා ඇත්තෙක් වේ. ද්වේෂ සහගත සිතක් ඇත්තෙක් වේ. මිථ්‍යා දෘෂ්ටිකයෙක් වේ. වාසෙට්ඨයෙනි, අකුසල යයි සම්මත, අකුසල ගණයෙහිලා සැලකෙන ... කළු වූ, කළු විපාක ඇති, නුවණැත්තන් විසින් ගැරහිය යුතු යම් ධර්ම කෙනෙක් වෙත් ද, ඇතැම් ශුද්‍රයෝ ද ඒවාහි යෙදෙමින් සිටිති. වාසෙට්ඨයෙනි, මෙලොව ඇතැම් ක්ෂත්‍රියයෙක් ප්‍රාණඝාතයෙන් වැළකී සිටියි. සොරකමින් වැළකී සිටියි. කාමයෙහි වරදවා හැසිරීමෙන් වැළකී සිටියි. බොරු කීමෙන් වැළකී සිටියි. කේලාම් බසින් වැළකී සිටියි. රළු බසින් වැළකී සිටියි. හිස් බස් දෙඩීමෙන් වැළකී සිටියි. අන් සතු දෙයට නො ඇලෙයි. ද්වේෂ සහගත සිතක් නැත්තෙක් වේ. සම්මා දිට්ඨි ඇත්තෙක් වේ. වාසෙට්ඨයෙනි, කුසල යයි සම්මත, කුසල ගණයෙහිලා සැලකෙන, වරද රහිත යයි සම්මත, වරද රහිත ගණයෙහිලා සැලකෙන, ඇසුරු කළ යුතු යයි සම්මත, ඇසුරු කළ යුතු ගණයෙහිලා සැලකෙන, ආර්ය වූ යයි සම්මත, ආර්ය වූ ගණයෙහිලා සැලකෙන, සුදු වූ, සුදු විපාක ඇති, නුවණැත්තන් විසින් ප්‍රශංසා කළ යුතු යම් ධර්ම කෙනෙක් වෙත් ද, මෙලොව ඇතැම් ක්ෂත්‍රියයෝ ද ඒවාහි යෙදෙමින් සිටිති. වාසෙට්ඨයෙනි, බ්‍රාහ්මණයෝ ද ... වෛශ්‍යයෝ ද ... වාසෙට්ඨයෙනි, මෙලොව ඇතැම් ශුද්‍රයෙක් ප්‍රාණඝාතයෙන් වැළකී සිටියි ... අන් සතු දෙයට නො ඇලෙයි. ද්වේෂ සහගත සිතක් නැත්තෙක් වේ. සම්මා දිට්ඨි ඇත්තෙක් වේ. වාසෙට්ඨයෙනි, කුසල යයි සම්මත, කුසල ගණයෙහිලා සැලකෙන, වරද රහිත යයි සම්මත, වරද රහිත ගණයෙහිලා සැලකෙන, ඇසුරු කළ යුතු යයි සම්මත, ඇසුරු කළ යුතු ගණයෙහිලා සැලකෙන, ආර්ය වූ යයි සම්මත, ආර්ය වූ ගණයෙහිලා සැලකෙන, සුදු වූ, සුදු විපාක ඇති, නුවණැත්තන් විසින් ප්‍රශංසා කළ යුතු යම් ධර්ම කෙනෙක් වෙත් ද, ඇතැම් ශුද්‍රයෝ ද ඒවාහි යෙදෙමින් සිටිති.’’",
      "paliTitle": "Catuvaṇṇasuddhi",
      "englishTitle": "Purity of the Four Castes",
      "sinhalaTitle": "චතුවණ්ණසුද්ධිය"
    },
    {
      "number": 116,
      "pali": "‘‘Imesu kho, vāseṭṭha, catūsu vaṇṇesu evaṃ ubhayavokiṇṇesu vattamānesu kaṇhasukkesu dhammesu viññugarahitesu ceva viññuppasatthesu ca yadettha brāhmaṇā evamāhaṃsu – ‘brāhmaṇova seṭṭho vaṇṇo, hīnā aññe vaṇṇā; brāhmaṇova sukko vaṇṇo, kaṇhā aññe vaṇṇā; brāhmaṇāva sujjhanti, no abrāhmaṇā; brāhmaṇāva brahmuno puttā orasā mukhato jātā brahmajā brahmanimmitā brahmadāyādā’ti. Taṃ tesaṃ viññū nānujānanti. Taṃ kissa hetu? Imesañhi, vāseṭṭha, catunnaṃ vaṇṇānaṃ yo hoti bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto, so nesaṃ aggamakkhāyati dhammeneva, no adhammena. Dhammo hi, vāseṭṭha, seṭṭho janetasmiṃ, diṭṭhe ceva dhamme abhisamparāyañca.",
      "english": "\"Now, Vāseṭṭha, when these four classes are thus mixed, with their dark and bright qualities prevailing, with the qualities both despised and praised by the wise, the Brahmins claim: ‘Only Brahmins are the superior class; other classes are inferior. Only Brahmins are the fair class; other classes are dark. Only Brahmins are purified, not non-Brahmins. Brahmins are the legitimate sons of Brahmā, born from his mouth, born of Brahmā, created by Brahmā, heirs of Brahmā.’ This is not accepted by the wise. Why is that? Vāseṭṭha, of these four classes, whichever bhikkhu is an Arahant, with taints destroyed, who has lived the holy life, done what was to be done, laid down the burden, attained his own welfare, utterly destroyed the fetters of becoming, and is liberated by perfect knowledge, he is declared the foremost of them by virtue of the Dhamma, not by non-Dhamma. For, Vāseṭṭha, the Dhamma is the best thing in this world, both in this life and in the life to come.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, මේ සතර වර්ණයන්හි මෙසේ දෙපසටම පැතිරුණු, කළු සුදු දෙයාකාර වූ, නුවණැත්තන් විසින් ගැරහිය යුතු ද, නුවණැත්තන් විසින් ප්‍රශංසා කළ යුතු ද වන දහම් පවතිද්දී, යම් බ්‍රාහ්මණයෝ මෙසේ කියත් ද, ‘බ්‍රාහ්මණ වර්ණයම ශ්‍රේෂ්ඨය, අනෙක් වර්ණයෝ පහත්ය; බ්‍රාහ්මණ වර්ණයම සුදුය, අනෙක් වර්ණයෝ කළුය; බ්‍රාහ්මණයෝම පිරිසිදු වෙති, අබ්‍රාහ්මණයෝ පිරිසිදු නොවෙති; බ්‍රාහ්මණයෝම බ්‍රහ්මයාගේ පුත්‍රයෝය, ඔහුගේ මුවින් උපන්නෝය, බ්‍රහ්මයාගෙන් හටගත්තෝය, බ්‍රහ්මයා විසින් මවන ලද්දෝය, බ්‍රහ්මයාගේ දායාදයෝය’යි කියත් ද, එය නුවණැත්තෝ අනුමත නොකරති. ඒ කුමක් නිසා ද? වාසෙට්ඨයෙනි, මේ සතර වර්ණයන් අතුරෙන් යම් භික්ෂුවක් රහත් වේ ද, ක්ෂීණාශ්‍රව වේ ද, බඹසර වැස නිමවන ලද කටයුතු ඇත්තේ ද, බහා තැබූ භාර ඇත්තේ ද, ලැබිය යුතු උතුම් ඵලය ලැබූයේ ද, නැති කරන ලද භව සංයෝජන ඇත්තේ ද, මනා නුවණින් මිදුණේ ද, හෙතෙම ඒ වර්ණයන්ට ධර්මය අනුව ශ්‍රේෂ්ඨ වේ, අධර්මය අනුව නොවේ. වාසෙට්ඨයෙනි, ධර්මයම ජනයා අතර ශ්‍රේෂ්ඨය, මේ ජීවිතයේදීත් මතු ජීවිතයේදීත් යහපත පිණිස හේතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 117,
      "pali": "‘‘Tadamināpetaṃ, vāseṭṭha, pariyāyena veditabbaṃ, yathā dhammova seṭṭho janetasmiṃ, diṭṭhe ceva dhamme abhisamparāyañca. ‘‘Jānāti kho [kho pana (ka.)], vāseṭṭha, rājā pasenadi kosalo – ‘samaṇo gotamo anantarā [anuttaro (bahūsu)] sakyakulā pabbajito’ti. Sakyā kho pana, vāseṭṭha, rañño pasenadissa kosalassa anuyuttā [anantarā anuyantā (syā.), anantarā anuyuttā (ka.)] bhavanti. Karonti kho, vāseṭṭha, sakyā raññe pasenadimhi kosale nipaccakāraṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammaṃ. Iti kho, vāseṭṭha, yaṃ karonti sakyā raññe pasenadimhi kosale nipaccakāraṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammaṃ, karoti taṃ rājā pasenadi kosalo tathāgate nipaccakāraṃ abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammaṃ, na naṃ [nanu (bahūsu)] ‘sujāto samaṇo gotamo, dujjātohamasmi. Balavā samaṇo gotamo, dubbalohamasmi. Pāsādiko samaṇo gotamo, dubbaṇṇohamasmi. Mahesakkho samaṇo gotamo, appesakkhohamasmī’ti. Atha kho naṃ dhammaṃyeva sakkaronto dhammaṃ garuṃ karonto dhammaṃ mānento dhammaṃ pūjento dhammaṃ apacāyamāno evaṃ rājā pasenadi kosalo tathāgate nipaccakāraṃ karoti, abhivādanaṃ paccuṭṭhānaṃ añjalikammaṃ sāmīcikammaṃ. Imināpi kho etaṃ, vāseṭṭha, pariyāyena veditabbaṃ, yathā dhammova seṭṭho janetasmiṃ, diṭṭhe ceva dhamme abhisamparāyañca.",
      "english": "Therefore, Vāseṭṭha, this should be understood by this method too: that the Dhamma is the best thing for people, in this present life and in the life to come.\n\nKing Pasenadi of Kosala knows, Vāseṭṭha, that “the ascetic Gotama has gone forth from a noble Sakyan clan.” Now the Sakyans, Vāseṭṭha, are subject to King Pasenadi of Kosala. The Sakyans, Vāseṭṭha, offer King Pasenadi of Kosala homage, greetings, rising up in respect, reverential salutation, and proper service. So, Vāseṭṭha, whatever homage, greetings, rising up in respect, reverential salutation, and proper service the Sakyans offer to King Pasenadi of Kosala, King Pasenadi of Kosala offers that to the Tathāgata, thinking, “The ascetic Gotama is well-born, while I am not well-born. The ascetic Gotama is powerful, while I am weak. The ascetic Gotama is handsome, while I am ugly. The ascetic Gotama is influential, while I am of little influence.” It is simply by honoring the Dhamma, respecting the Dhamma, esteeming the Dhamma, revering the Dhamma, and venerating the Dhamma that King Pasenadi of Kosala offers homage, greetings, rising up in respect, reverential salutation, and proper service to the Tathāgata. By this method, too, Vāseṭṭha, this should be understood: that the Dhamma is the best thing for people, in this present life and in the life to come.",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, මේ කරුණින් එය දැනගත යුතුයි. එනම්, දෘෂ්ටියෙහිද, මතු භවයෙහිද ධර්මයම ජනයා අතර ශ්‍රේෂ්ඨ වන්නේය. වාසෙට්ඨයෙනි, පසේනදී කොසොල් රජ, ‘ගෞතම ශ්‍ර‍මණයා සක්‍ය කුලයෙන් පැවිදි වූ අයෙකැ’යි දන්නේමය. වාසෙට්ඨයෙනි, සක්‍යයෝ පසේනදී කොසොල් රජුට යටත්වැත්තෝ වෙති. වාසෙට්ඨයෙනි, සක්‍යයෝ පසේනදී කොසොල් රජුට නැමස්කාර කිරීම, නැගිටීම, අංජලිකර්මය, යුතුකම් කිරීම යන ඒවා කරති. වාසෙට්ඨයෙනි, සක්‍යයෝ පසේනදී කොසොල් රජුට යම් නැමස්කාර කිරීමක්, නැගිටීමක්, අංජලිකර්මයක්, යුතුකම් කිරීමක් කරත් නම්, පසේනදී කොසොල් රජ තථාගතයන් වහන්සේට නැමස්කාර කිරීම, නැගිටීම, අංජලිකර්මය, යුතුකම් කිරීම යන ඒවා කරන්නේ, ‘ගෞතම ශ්‍ර‍මණයා හොඳ කුලයක උපන් කෙනෙක, මම දුර්වල කුලයක උපන්නෙමි. ගෞතම ශ්‍ර‍මණයා බලවත්ය, මම දුර්වල වෙමි. ගෞතම ශ්‍ර‍මණයා ප්‍ර‍සාදජනකය, මම අවලස්සන වෙමි. ගෞතම ශ්‍ර‍මණයා මහේශාක්‍යය, මම අල්පේශාක්‍ය වෙමි’ යන අදහසින් නොවෙයි. එහෙත්, රජු ධර්මයට සත්කාර කරමින්, ධර්මයට ගරු කරමින්, ධර්මය මනාව පිළිගනිමින්, ධර්මයට පුදමින්, ධර්මයට ගරු බුහුමන් කරමින්, පසේනදී කොසොල් රජ තථාගතයන් වහන්සේට නැමස්කාර කරයි, නැගිටියි, අංජලිකර්ම කරයි, යුතුකම් කරයි. වාසෙට්ඨයෙනි, මේ කරුණින්ද මෙය දැනගත යුතුයි. එනම්, දෘෂ්ටියෙහිද, මතු භවයෙහිද ධර්මයම ජනයා අතර ශ්‍රේෂ්ඨ වන්නේය.’’",
      "paliTitle": ""
    },
    {
      "number": 118,
      "pali": "‘‘Tumhe khvattha, vāseṭṭha, nānājaccā nānānāmā nānāgottā nānākulā agārasmā anagāriyaṃ pabbajitā. ‘Ke tumhe’ti – puṭṭhā samānā ‘samaṇā sakyaputtiyāmhā’ti – paṭijānātha. Yassa kho panassa, vāseṭṭha, tathāgate saddhā niviṭṭhā mūlajātā patiṭṭhitā daḷhā asaṃhāriyā samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ, tassetaṃ kallaṃ vacanāya – ‘bhagavatomhi putto oraso mukhato jāto dhammajo dhammanimmito dhammadāyādo’ti. Taṃ kissa hetu? Tathāgatassa hetaṃ, vāseṭṭha, adhivacanaṃ ‘dhammakāyo’ itipi, ‘brahmakāyo’ itipi, ‘dhammabhūto’ itipi, ‘brahmabhūto’ itipi.",
      "english": "\"Indeed, Vāseṭṭha, you of diverse birth, diverse names, diverse lineages, and diverse families, have gone forth from the household life into homelessness. When asked, ‘Who are you?’ you declare, ‘We are ascetics, followers of the Sakyan.’ Whoever, Vāseṭṭha, has faith rooted, established, firm, and unshakeable in the Tathāgata—not shaken by any ascetic, brahmin, god, Māra, Brahmā, or anyone in the world—it is fitting for them to say: ‘I am a true child of the Blessed One, born of his mouth, born of the Dhamma, created by the Dhamma, an heir to the Dhamma.’ Why is that? This, Vāseṭṭha, is a designation for the Tathāgata: ‘embodiment of the Dhamma,’ ‘embodiment of Brahmā,’ ‘become Dhamma,’ ‘become Brahmā.’\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඔබලා මෙහි විවිධ ජාතීන්ට අයත්, විවිධ නම් ඇති, විවිධ ගෝත්‍ර ඇති, විවිධ කුලවලින් පැවිදි වූවෝ වෙති. ‘ඔබ කවුරුන්දැ’යි විමසන ලදුව ‘අපි ශාක්‍යපුත්‍ර ශ්‍රමණවරු වෙමු’යි පිළිගනිව්. වාසෙට්ඨයෙනි, යම් කෙනෙකුගේ තථාගතයන් කෙරෙහි ශ්‍රද්ධාව මුල් බැසගත්, ස්ථාවර වූ, පිහිටුවන ලද, දැඩි වූ, ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ දේවතාවෙකුට හෝ මාරයෙකුට හෝ බ්‍රහ්මයෙකුට හෝ ලෝකයේ කිසිවෙකුට හෝ වෙනස් කළ නොහැකි වේ නම්, ඔහුට ‘මම භාග්‍යවතුන් වහන්සේගේ පුත්‍රයෙක්මි, ඖරස පුත්‍රයෙක්මි, මුඛයෙන් උපන් ධර්මජයෙක්මි, ධර්මයෙන් නිර්මාණය වූවෙක්මි, ධර්මදායාදය ලද්දෙක්මි’ යි පැවසීම සුදුසුය. එය කවර හෙතුවකින් ද යත්, වාසෙට්ඨයෙනි, ‘ධම්මකාය’ යැයි ද, ‘බ්‍රහ්මකාය’ යැයි ද, ‘ධම්මභූත’ යැයි ද, ‘බ්‍රහ්මභූත’ යැයි ද තථාගතයන් වහන්සේට මෙය ව්‍යවහාර නාමයකි.",
      "paliTitle": ""
    },
    {
      "number": 119,
      "pali": "‘‘Hoti kho so, vāseṭṭha, samayo yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne loke yebhuyyena sattā ābhassarasaṃvattanikā honti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino ciraṃ dīghamaddhānaṃ tiṭṭhanti. ‘‘Hoti kho so, vāseṭṭha, samayo yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko vivaṭṭati. Vivaṭṭamāne loke yebhuyyena sattā ābhassarakāyā cavitvā itthattaṃ āgacchanti. Tedha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino ciraṃ dīghamaddhānaṃ tiṭṭhanti. ",
      "english": "\"There comes a time, Vāseṭṭha, sooner or later, after a long period, when this world contracts. As the world contracts, beings for the most part are reborn in the Ābhassara plane. There they exist, mind-made, feeding on delight, self-luminous, moving about in space, abiding in glory, and they continue thus for a long, long period.\n\n\"There comes a time, Vāseṭṭha, sooner or later, after a long period, when this world expands. As the world expands, beings for the most part pass away from the Ābhassara plane and come to this world. Here they exist, mind-made, feeding on delight, self-luminous, moving about in space, abiding in glory, and they continue thus for a long, long period.",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, යම් කලෙක දීර්ඝ කාලයක් ඇවෑමෙන් මේ ලෝකය සංවට්ටනය වන්නේ ද, එසමයෙක් වෙයි. ලෝකය සංවට්ටනය වන කල්හි බොහෝ සත්වයෝ ආභස්සර සංවර්තනිකයෝ වෙති. ඔවුහු එහි මනෝමය වූ, ප්‍රීතිය ආහාර කොට ඇති, තමන්ගෙන් ම බබළන්නා වූ, අහසෙහි හැසිරෙන්නා වූ, යහපත් වාසස්ථාන ඇතිව බොහෝ කල් දීර්ඝ කාලයක් සිටිති.\n\n‘‘වාසෙට්ඨයෙනි, යම් කලෙක දීර්ඝ කාලයක් ඇවෑමෙන් මේ ලෝකය විවට්ටනය වන්නේ ද, එසමයෙක් වෙයි. ලෝකය විවට්ටනය වන කල්හි බොහෝ සත්වයෝ ආභස්සර කායවලින් චුත ව මෙලොවට පැමිණෙති. ඔවුහු එහි මනෝමය වූ, ප්‍රීතිය ආහාර කොට ඇති, තමන්ගෙන් ම බබළන්නා වූ, අහසෙහි හැසිරෙන්නා වූ, යහපත් වාසස්ථාන ඇතිව බොහෝ කල් දීර්ඝ කාලයක් සිටිති.",
      "paliTitle": ""
    },
    {
      "number": 120,
      "pali": "‘‘Ekodakībhūtaṃ kho pana, vāseṭṭha, tena samayena hoti andhakāro andhakāratimisā. Na candimasūriyā paññāyanti, na nakkhattāni tārakarūpāni paññāyanti, na rattindivā paññāyanti, na māsaḍḍhamāsā paññāyanti, na utusaṃvaccharā paññāyanti, na itthipumā paññāyanti, sattā sattātveva saṅkhyaṃ gacchanti. Atha kho tesaṃ, vāseṭṭha, sattānaṃ kadāci karahaci dīghassa addhuno accayena rasapathavī udakasmiṃ samatani [samatāni (bahūsu)]; seyyathāpi nāma payaso tattassa [payatattassa (syā.)] nibbāyamānassa upari santānakaṃ hoti, evameva pāturahosi. Sā ahosi vaṇṇasampannā gandhasampannā rasasampannā, seyyathāpi nāma sampannaṃ vā sappi sampannaṃ vā navanītaṃ evaṃvaṇṇā ahosi. Seyyathāpi nāma khuddamadhuṃ [khuddaṃ madhuṃ (ka. sī.)] aneḷakaṃ [anelakaṃ (sī. pī.)], evamassādā ahosi. Atha kho, vāseṭṭha, aññataro satto lolajātiko – ‘ambho, kimevidaṃ bhavissatī’ti rasapathaviṃ aṅguliyā sāyi. Tassa rasapathaviṃ aṅguliyā sāyato acchādesi, taṇhā cassa okkami. Aññepi kho, vāseṭṭha, sattā tassa sattassa diṭṭhānugatiṃ āpajjamānā rasapathaviṃ aṅguliyā sāyiṃsu. Tesaṃ rasapathaviṃ aṅguliyā sāyataṃ acchādesi, taṇhā ca tesaṃ okkami. ",
      "english": "\"But, Vāseṭṭha, at that time there was a single mass of water, darkness, and blinding darkness. Neither the moon nor the sun appeared, neither the stars nor constellations appeared, neither night nor day appeared, neither months nor fortnights appeared, neither seasons nor years appeared, neither woman nor man appeared. Beings were reckoned just as beings. Then, Vāseṭṭha, after a long time, sooner or later, that savory earth arose on the water, spread out evenly. Just as a skin forms on the surface of hot milk as it cools, even so did it appear. It was endowed with color, endowed with fragrance, endowed with taste, just like pure butter or pure ghee; it was of such color. Just like virgin honey without defects, it was of such flavor. Then, Vāseṭṭha, one being, greedy by nature, thinking, ‘Oh, what could this be?’ tasted the savory earth with his finger. As he tasted the savory earth with his finger, he enjoyed it, and craving arose in him. Other beings too, Vāseṭṭha, following the example of that being, tasted the savory earth with their fingers. As they tasted the savory earth with their fingers, they enjoyed it, and craving arose in them.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඒ කාලයෙහි සත්වයන් සියල්ල එකම ජල ස්වභාවයකින් යුක්ත වූවෝ වෙති. එහි අන්ධකාරයක් හා අඳුරු මීදුමක් පවතී. සඳ හිරු නොපෙනෙයි. තරු, තාරකා රූපයන් නොපෙනෙයි. රාත්‍රිය හා දිවා නොපෙනෙයි. මාස හා අඩ මස නොපෙනෙයි. ඍතු හා වසර නොපෙනෙයි. ගැහැණු පිරිමි භේදයක් ද නොපෙනෙයි. සත්වයෝ සත්වයෝ වශයෙන් පමණක් ගණන් ගැනෙති. වාසෙට්ඨයෙනි, දීර්ඝ කාලයක් ඇවෑමෙන් ඒ සත්ත්වයන්ට කවර කලෙක හෝ රස පොළොව ජලයෙහි මතු වේ. යම් සේ උණු කිරි නිවුණු පසු මතුපිට පෙන පිඬු ඇති වන්නා සේ, එපරිද්දෙන්ම එය පහළ විය. එය වර්ණයෙන් සම්පූර්ණ වූවා ය, සුවඳින් සම්පූර්ණ වූවා ය, රසයෙන් සම්පූර්ණ වූවා ය. යම් සේ හොඳින් පැසුණු ගිතෙල් හෝ හොඳින් පැසුණු වෙඬරු හෝ වේ ද, එබඳු වර්ණ ඇත්තී විය. යම් සේ බඹර ලේන්ගතුව නැති කුඩා මී පැණි වේ ද, එබඳු රස ඇත්තී විය. වාසෙට්ඨයෙනි, එක සත්වයෙක් ලොල් බවට පැමිණ, ‘අහෝ, මේ කුමක් විය හැකි දැ’යි සිතා රස පොළොව ඇඟිල්ලෙන් ස්පර්ශ කර බැලීය. ඒ රස පොළොව ඇඟිල්ලෙන් ස්පර්ශ කළ සත්වයාගේ සිත එයට ඇලුම් කළේ ය. තණ්හාව ද ඔහු තුළට ඇතුළු විය. වාසෙට්ඨයෙනි, අන්‍ය සත්වයෝ ද ඒ සත්වයාගේ ක්‍රියාව අනුගමනය කරමින් රස පොළොව ඇඟිල්ලෙන් ස්පර්ශ කර බැලූහ. ඒ රස පොළොව ඇඟිල්ලෙන් ස්පර්ශ කළ සත්වයන්ගේ සිත එයට ඇලුම් කළේ ය. ඔවුන්ගේ තණ්හාව ද ඔවුන් තුළට ඇතුළු විය.",
      "paliTitle": "Rasapathavipātubhāvo",
      "englishTitle": "The Occurrence of Taste Derangement",
      "sinhalaTitle": "රසපථවිපාතුභාවය"
    },
    {
      "number": 121,
      "pali": "‘‘Atha kho te, vāseṭṭha, sattā rasapathaviṃ hatthehi āluppakārakaṃ upakkamiṃsu paribhuñjituṃ. Yato kho te [yato kho (sī. syā. pī.)], vāseṭṭha, sattā rasapathaviṃ hatthehi āluppakārakaṃ upakkamiṃsu paribhuñjituṃ. Atha tesaṃ sattānaṃ sayaṃpabhā antaradhāyi. Sayaṃpabhāya antarahitāya candimasūriyā pāturahesuṃ. Candimasūriyesu pātubhūtesu nakkhattāni tārakarūpāni pāturahesuṃ. Nakkhattesu tārakarūpesu pātubhūtesu rattindivā paññāyiṃsu. Rattindivesu paññāyamānesu māsaḍḍhamāsā paññāyiṃsu. Māsaḍḍhamāsesu paññāyamānesu utusaṃvaccharā paññāyiṃsu. Ettāvatā kho, vāseṭṭha, ayaṃ loko puna vivaṭṭo hoti.",
      "english": "Then those beings, Vāseṭṭha, began to partake of the savory earth, breaking off lumps of it with their hands. When those beings, Vāseṭṭha, began to partake of the savory earth, breaking off lumps of it with their hands, their self-illumination disappeared. With the disappearance of the self-illumination, the sun and moon appeared. With the appearance of the sun and moon, the stars and constellations appeared. With the appearance of the stars and constellations, night and day became distinguishable. With the recognition of night and day, fortnights and months became distinguishable. With the recognition of fortnights and months, seasons and years became distinguishable. Thus far, Vāseṭṭha, this world evolved again.",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ අතින් ගෙන කැබලි කරමින් රසපඨවිය පරිභෝජනය කිරීමට පටන් ගත්හ. වාසෙට්ඨයෙනි, යම් හෙයකින් ඒ සත්වයෝ අතින් ගෙන කැබලි කරමින් රසපඨවිය පරිභෝජනය කිරීමට පටන් ගත්තෝ ද, එකල්හි ඒ සත්වයන්ගේ තමන්ගෙන් හටගත් ආලෝකය අතුරුදහන් විය. තමන්ගෙන් හටගත් ආලෝකය අතුරුදහන් වූ කල්හි හඳ සහ හිරු පහළ විය. හඳ හිරු පහළ වූ කල්හි තරු සහ තාරකා රූපයන් පහළ විය. තරු සහ තාරකා රූපයන් පහළ වූ කල්හි රාත්‍රිය සහ දිවා ප්‍ර‍ඥප්ත විය. රාත්‍රිය සහ දිවා ප්‍ර‍ඥප්ත වූ කල්හි මාස සහ අඩමස ප්‍ර‍ඥප්ත විය. මාස සහ අඩමස ප්‍ර‍ඥප්ත වූ කල්හි සෘතු සහ වර්ෂයෝ ප්‍ර‍ඥප්ත විය. වාසෙට්ඨයෙනි, මෙපමණකින් මේ ලෝකය නැවත විවෘත වේ.",
      "paliTitle": "Candimasūriyādipātubhāvo",
      "englishTitle": "The Appearance of the Sun and Moon",
      "sinhalaTitle": "චන්‍ද්‍රසූරිය්‍යාදීපාතුභාවො"
    },
    {
      "number": 122,
      "pali": "‘‘Atha kho te, vāseṭṭha, sattā rasapathaviṃ paribhuñjantā taṃbhakkhā [tabbhakkhā (syā.)] tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhaṃsu. Yathā yathā kho te, vāseṭṭha, sattā rasapathaviṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhaṃsu, tathā tathā tesaṃ sattānaṃ (rasapathaviṃ paribhuñjantānaṃ) [( ) sī. syā. pī. potthakesu natthi] kharattañceva kāyasmiṃ okkami, vaṇṇavevaṇṇatā [vaṇṇavevajjatā (ṭīkā)] ca paññāyittha. Ekidaṃ sattā vaṇṇavanto honti, ekidaṃ sattā dubbaṇṇā. Tattha ye te sattā vaṇṇavanto, te dubbaṇṇe satte atimaññanti – ‘mayametehi vaṇṇavantatarā, amhehete dubbaṇṇatarā’ti. Tesaṃ vaṇṇātimānapaccayā mānātimānajātikānaṃ rasapathavī antaradhāyi. Rasāya pathaviyā antarahitāya sannipatiṃsu. Sannipatitvā anutthuniṃsu – ‘aho rasaṃ, aho rasa’nti! Tadetarahipi manussā kañcideva surasaṃ [sādhurasaṃ (sī. syā. pī.)] labhitvā evamāhaṃsu – ‘aho rasaṃ, aho rasa’nti! Tadeva porāṇaṃ aggaññaṃ akkharaṃ anusaranti, na tvevassa atthaṃ ājānanti. ",
      "english": "\"Then, Vāseṭṭha, those beings, enjoying the flavor of the earth, subsisting on it, nourished by it, remained for a long, long time. As those beings, Vāseṭṭha, continued to enjoy the flavor of the earth, subsisting on it, nourished by it, for a long, long time, their bodies became coarser, and differences in appearance became evident. Some beings became beautiful, others became ugly. Thereupon, those beings who were beautiful despised those beings who were ugly, saying, 'We are more beautiful than they are, they are uglier than we are.' Because of their conceit about their appearance, and because of their birth from excessive pride, the flavor of the earth disappeared. With the disappearance of the flavor of the earth, they gathered together. Gathering together, they lamented, 'O flavor, O flavor!' Even now, people, upon obtaining some delicious taste, say, 'O flavor, O flavor!' They follow that ancient, foremost expression, but they do not understand its meaning.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ රසපඨවිය පරිභෝග කරමින් එයම ආහාර කොට එයම ගොදුරු කොට බොහෝ කලක් දීර්ඝ කාලයක් පැවතුණාහ. වාසෙට්ඨයෙනි, යම් යම් පරිද්දකින් ඒ සත්වයෝ රසපඨවිය පරිභෝග කරමින් එයම ආහාර කොට එයම ගොදුරු කොට බොහෝ කලක් දීර්ඝ කාලයක් පැවතුණාහුද, එසේ එසේම ඒ සත්වයන්ගේ ශරීරයෙහි රළු බවක් පහළ විය. වර්ණ විෂමතාවයක් ද ප්‍රකට විය. ඇතැම් සත්වයෝ වර්ණවත් වූහ. ඇතැම් සත්වයෝ අවර්ණ වූහ. එහිලා යම් ඒ සත්වයෝ වර්ණවත් වූවෝද, ඔවුහු අවර්ණ වූ සතුන් හෙළා දුටුවෝය. ‘අපි මොවුන්ට වඩා වර්ණවත් වෙමු. මොවුහු අපට වඩා අවර්ණ වෙති’ යි කීහ. ඔවුන්ගේ වර්ණාධික මානය හේතුවෙන් මානාධික වූ ඔවුන්ට රසපඨවිය අතුරුදහන් විය. රසපඨවිය අතුරුදහන් වූ කල්හි රැස් වූහ. රැස්ව ‘අහෝ රසය, අහෝ රසය’ යි හඬන්නට වූහ. අදත් ඇතැම් මනුෂ්‍යයෝ යම්කිසි රසවත් දෙයක් ලැබ ‘අහෝ රසය, අහෝ රසය’ යි මෙසේ කියන්නාහ. ඔවුහු ඒ පෞරාණික අග්‍ර වූ නාමය අනුගමනය කරති. එහෙත් එහි අර්ථය නම් නොදන්නාහ.",
      "paliTitle": ""
    },
    {
      "number": 123,
      "pali": "‘‘Atha kho tesaṃ, vāseṭṭha, sattānaṃ rasāya pathaviyā antarahitāya bhūmipappaṭako pāturahosi. Seyyathāpi nāma ahicchattako, evameva pāturahosi. So ahosi vaṇṇasampanno gandhasampanno rasasampanno, seyyathāpi nāma sampannaṃ vā sappi sampannaṃ vā navanītaṃ evaṃvaṇṇo ahosi. Seyyathāpi nāma khuddamadhuṃ aneḷakaṃ, evamassādo ahosi. ‘‘Atha kho te, vāseṭṭha, sattā bhūmipappaṭakaṃ upakkamiṃsu paribhuñjituṃ. Te taṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhaṃsu. Yathā yathā kho te, vāseṭṭha, sattā bhūmipappaṭakaṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhaṃsu, tathā tathā tesaṃ sattānaṃ bhiyyoso mattāya kharattañceva kāyasmiṃ okkami, vaṇṇavevaṇṇatā ca paññāyittha. Ekidaṃ sattā vaṇṇavanto honti, ekidaṃ sattā dubbaṇṇā. Tattha ye te sattā vaṇṇavanto, te dubbaṇṇe satte atimaññanti – ‘mayametehi vaṇṇavantatarā, amhehete dubbaṇṇatarā’ti. Tesaṃ vaṇṇātimānapaccayā mānātimānajātikānaṃ bhūmipappaṭako antaradhāyi. ",
      "english": "Then, Vāseṭṭha, when that flavor of earth had disappeared for those beings, a mushroom-like growth appeared on the surface of the earth. It appeared just like a mushroom. It was complete with color, complete with fragrance, complete with flavor, just like clarified butter or fresh butter is complete with color. It had a taste just like pure, unadulterated honey.\n\nThen, Vāseṭṭha, those beings began to partake of that mushroom-like growth. As they partook of it, feeding on it, nourished by it, they remained for a very long time. As those beings, Vāseṭṭha, partook of that mushroom-like growth, feeding on it, nourished by it, they remained for a very long time, then roughness of form settled more and more into their bodies, and a diversity of appearance became evident. Some beings were beautiful in appearance, and some beings were ugly in appearance. There, those beings who were beautiful in appearance despised those beings who were ugly in appearance, saying, \"We are more beautiful than these, these are uglier than us.\" Because of pride in appearance, due to the birth of conceit and arrogance, the mushroom-like growth disappeared.",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්ත්වයන්ගේ පඨවි රසය අතුරුදහන් වූ කල්හි බිම් හතු ඵලයක් මෙන් බිම් මතුපිට පතුරු ආකාරයෙන් පහළ විය. එය වර්ණයෙන්ද, ගන්ධයෙන්ද, රසයෙන්ද යුක්ත විය. එය මනා වූ ගිතෙල් හෝ මනා වූ වෙඬරු වැනි වර්ණයකින් යුක්ත විය. එය කිසිම අපිරිසිදු බවක් නැති කුඩා මී පැණි මෙන් මිහිරි විය. වසෙට්ඨයෙනි, ඉක්බිති ඒ සත්ත්වයෝ බිම් පතුරු ආහාරයට ගැනීමට පටන් ගත්හ. ඔවුහු එය අනුභව කරමින් එයම ආහාර කොට ගෙන බොහෝ කලක්, දීර්ඝ කාලයක් ජීවත් වූහ. වසෙට්ඨයෙනි, යම් යම් ලෙසකින් ඒ සත්ත්වයෝ බිම් පතුරු අනුභව කරමින් එයම ආහාර කොට ගෙන බොහෝ කලක්, දීර්ඝ කාලයක් ජීවත් වූවාහුද, එලෙසින් එලෙසින් ඒ සත්ත්වයන්ගේ ශරීරයෙහි රළු බව වැඩි වැඩියෙන් ඇති විය. වර්ණයෙහි වෙනස් වීමද ප්‍රකට විය. ඇතැම් සත්ත්වයෝ වර්ණවත් වූහ. ඇතැම් සත්ත්වයෝ අවර්ණ වූහ. එහිලා යම් ඒ සත්ත්වයෝ වර්ණවත් වූවාහුද, ඔවුහු අවර්ණ වූ සත්ත්වයන් හෙළා දුටුවෝය. ‘අපි මොවුන්ට වඩා වර්ණවත් වෙමු. මොවුහු අපට වඩා අවර්ණවත් වෙති’ යැයි සිතූහ. ඔවුන්ගේ වර්ණ අතිමානය නිසා, මානය අධික වූ හෙයින්, බිම් පතුරු අතුරුදහන් විය.",
      "paliTitle": "Bhūmipappaṭakapātubhāvo",
      "englishTitle": "Appearance of Bhūmipappaṭaka",
      "sinhalaTitle": "භූමිපප්පටකපාතුභාවය"
    },
    {
      "number": 124,
      "pali": "‘‘Bhūmipappaṭake antarahite padālatā [saddālatā (sī.)] pāturahosi, seyyathāpi nāma kalambukā [kalambakā (syā.)], evameva pāturahosi. Sā ahosi vaṇṇasampannā gandhasampannā rasasampannā, seyyathāpi nāma sampannaṃ vā sappi sampannaṃ vā navanītaṃ evaṃvaṇṇā ahosi. Seyyathāpi nāma khuddamadhuṃ aneḷakaṃ, evamassādā ahosi. ‘‘Atha kho te, vāseṭṭha, sattā padālataṃ upakkamiṃsu paribhuñjituṃ. Te taṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhaṃsu. Yathā yathā kho te, vāseṭṭha, sattā padālataṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhaṃsu, tathā tathā tesaṃ sattānaṃ bhiyyosomattāya kharattañceva kāyasmiṃ okkami, vaṇṇavevaṇṇatā ca paññāyittha. Ekidaṃ sattā vaṇṇavanto honti, ekidaṃ sattā dubbaṇṇā. Tattha ye te sattā vaṇṇavanto, te dubbaṇṇe satte atimaññanti – ‘mayametehi vaṇṇavantatarā, amhehete dubbaṇṇatarā’ti. Tesaṃ vaṇṇātimānapaccayā mānātimānajātikānaṃ padālatā antaradhāyi. ‘‘Padālatāya antarahitāya sannipatiṃsu. Sannipatitvā anutthuniṃsu – ‘ahu vata no, ahāyi vata no padālatā’ti! Tadetarahipi manussā kenaci [kenacideva (sī. syā. pī.)] dukkhadhammena phuṭṭhā evamāhaṃsu – ‘ahu vata no, ahāyi vata no’ti! Tadeva porāṇaṃ aggaññaṃ akkharaṃ anusaranti, na tvevassa atthaṃ ājānanti. ",
      "english": "When the earth-scum disappeared, then a creeper sprung up, just as a mushroom might spring up. It appeared beautiful, fragrant, and delicious, just like pure ghee or fresh butter. It was as sweet as pure, natural honey. Then those beings, Vāseṭṭha, began to partake of that creeper. As they partook of it and lived on it, nourished by it, they continued for a long, long time. As those beings, Vāseṭṭha, continued to partake of that creeper and lived on it, nourished by it, their bodies gradually became coarser, and differences in their appearance became evident. Some beings were beautiful, and some were ugly. Then those beings who were beautiful despised those beings who were ugly, saying, \"We are more beautiful than they are, and they are uglier than we are.\" Because of their vanity about their appearance, and because of the arising of pride, the creeper disappeared. When the creeper had disappeared, they gathered together. Having gathered together, they lamented, \"Alas, it is no more for us; the creeper is gone for us!\" Even today, when people are touched by some sorrowful condition, they say, \"Alas, it is no more for us; it is gone for us!\" They are only following that ancient principle, but they do not understand its meaning.",
      "sinhala": "‘‘භූමිපප්පටකය අන්තරා වූ කල්හි කලඹුකා මෙන් හටගත් සද්දාලතා පහළ විය. එය වර්ණ සම්පන්න වූයේ ද, ගන්ධ සම්පන්න වූයේ ද, රස සම්පන්න වූයේ ද, මනා වූ නේ‍යි ද මනා වූ වෙඬරු ද යම් සේ වේ ද, එසේ වර්ණ ඇත්තේ විය. අමු මී පැණි යම් සේ ඇත්තේ ද, එබඳු රස ඇත්තේ විය. වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ සද්දාලතාව පරිභෝජනය කිරීමට පැමිණියහ. ඔවුහු එය පරිභෝජනය කරන්නෝ, එය ආහාර කොට ඇත්තෝ, එයින් යැපෙන්නෝ බොහෝ කල් දීර්ඝ කාලයක් පැවතුණාහ. වාසෙට්ඨයෙනි, යම් යම් පරිද්දකින් ඒ සත්වයෝ සද්දාලතාව පරිභෝජනය කරන්නෝ, එය ආහාර කොට ඇත්තෝ, එයින් යැපෙන්නෝ බොහෝ කල් දීර්ඝ කාලයක් පැවතුණාහු ද, එසේ එසේ ඒ සත්වයන්ගේ ශරීරයෙහි රළු බව අධික විය. වර්ණ වෙනස් වීම ද ප්‍රකට විය. ඇතැම් සත්වයෝ වර්ණවත් වූහ. ඇතැම් සත්වයෝ දුර්වර්ණ වූහ. එහිලා යම් ඒ සත්වයෝ වර්ණවත් වූවෝ ද, ඔහු දුර්වර්ණ සත්වයන් හෙළා දකිති. ‘අපි මොවුන්ට වඩා වර්ණවත් වන්නෙමු. මොවුහු අපට වඩා දුර්වර්ණ වෙති’ යි කියති. ඔවුන්ගේ වර්ණාධික මානය හේතු කොට ගෙන මානාධික වූ ඒ සත්වයන්ට සද්දාලතා අතුරුදහන් විය. සද්දාලතාව අතුරුදහන් වූ කල්හි රැස් වූහ. රැස්ව ‘අපට තිබුණේ නැති වූවා නොවේ ද, අපට නැති වූවා නොවේ දැ’යි හඬන්නට වූහ. අදත් ඇතැම් මනුෂ්‍යයෝ යම්කිසි දුක්ඛ ධර්මයකින් ස්පර්ශ කරණ ලද්දාහු ‘අපට තිබුණේ නැති වූවා නොවේ ද, අපට නැති වූවා නොවේ දැ’යි මෙසේ කියති. ඒ පෞරාණික අග්ගඤ්ඤ අක්ෂරය අනුව යති. එහෙත් එහි අර්ථය නොදන්නාහ.",
      "paliTitle": "Padālatāpātubhāvo",
      "englishTitle": "The Appearance of Foot Injuries",
      "sinhalaTitle": "පදාලතාපාතුභාවය"
    },
    {
      "number": 125,
      "pali": "‘‘Atha kho tesaṃ, vāseṭṭha, sattānaṃ padālatāya antarahitāya akaṭṭhapāko sāli pāturahosi akaṇo athuso suddho sugandho taṇḍulapphalo. Yaṃ taṃ sāyaṃ sāyamāsāya āharanti, pāto taṃ hoti pakkaṃ paṭivirūḷhaṃ. Yaṃ taṃ pāto pātarāsāya āharanti, sāyaṃ taṃ hoti pakkaṃ paṭivirūḷhaṃ; nāpadānaṃ paññāyati. Atha kho te, vāseṭṭha, sattā akaṭṭhapākaṃ sāliṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhaṃsu. ",
      "english": "Then, Vāseṭṭha, for those beings, with the disappearance of the foot-shaped mold, rice appeared, uncultivated, without husk or chaff, pure, fragrant, and bearing grains of rice. Whatever they gathered in the evening for the evening meal, in the morning it would be ripened and sprouted. Whatever they gathered in the morning for the morning meal, in the evening it would be ripened and sprouted; no cutting off was apparent. Then, Vāseṭṭha, those beings, consuming that uncultivated rice, living on it, nourished by it, persisted for a long, long time.",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්ත්වයන්ගේ පාද ලතාවන් අතුරුදහන් වූ කල්හි, සී සෑමෙන් තොරව හටගත්, ලෙලි රහිත, නිවුඩු රහිත, පිරිසිදු, සුවඳවත්, සහල් ඵල ඇති සාලි සහල් පහළ විය. ඔවුන් සවස් යාමයේ සවස ආහාරය සඳහා යම් සහලක් ගත්තාහු නම්, එය උදෑසන වන විට පැසී වැඩී තිබුණේය. උදෑසන උදෑසන ආහාරය සඳහා යම් සහලක් ගත්තාහු නම්, එය සවස් වන විට පැසී වැඩී තිබුණේය; නැවත වැපිරීමක් දක්නට නොලැබුණි. වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්ත්වයෝ සී සෑමෙන් තොරව හටගත් සාලි සහල් පරිභෝජනය කරමින්, එයම ආහාර කරමින් බොහෝ කලක් දීර්ඝ කාලයක් ජීවත් වූහ.",
      "paliTitle": "Akaṭṭhapākasālipātubhāvo",
      "englishTitle": "Appearance of Uncultivated Rice",
      "sinhalaTitle": "අකට්ඨපාකසාලිපාතුභාවය"
    },
    {
      "number": 126,
      "pali": "‘‘Yathā yathā kho te, vāseṭṭha, sattā akaṭṭhapākaṃ sāliṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhaṃsu, tathā tathā tesaṃ sattānaṃ bhiyyosomattāya kharattañceva kāyasmiṃ okkami, vaṇṇavevaṇṇatā ca paññāyittha, itthiyā ca itthiliṅgaṃ pāturahosi purisassa ca purisaliṅgaṃ. Itthī ca purisaṃ ativelaṃ upanijjhāyati puriso ca itthiṃ. Tesaṃ ativelaṃ aññamaññaṃ upanijjhāyataṃ sārāgo udapādi, pariḷāho kāyasmiṃ okkami. Te pariḷāhapaccayā methunaṃ dhammaṃ paṭiseviṃsu. ‘‘Ye kho pana te, vāseṭṭha, tena samayena sattā passanti methunaṃ dhammaṃ paṭisevante, aññe paṃsuṃ khipanti, aññe seṭṭhiṃ khipanti, aññe gomayaṃ khipanti – ‘nassa asuci [vasali (syā.), vasalī (ka.)], nassa asucī’ti. ‘Kathañhi nāma satto sattassa evarūpaṃ karissatī’ti! Tadetarahipi manussā ekaccesu janapadesu vadhuyā nibbuyhamānāya [nivayhamānāya, niggayhamānāya (ka.)] aññe paṃsuṃ khipanti, aññe seṭṭhiṃ khipanti, aññe gomayaṃ khipanti. Tadeva porāṇaṃ aggaññaṃ akkharaṃ anusaranti, na tvevassa atthaṃ ājānanti. ",
      "english": "\"In whatever way, Vāseṭṭha, those beings, consuming the self-grown rice without preparation, nourished by that food, subsisted for a long, long time, in that way did harshness increasingly descend into their bodies, and differences in appearance became evident; the characteristics of woman appeared in woman, and the characteristics of man appeared in man. Woman gazed excessively at man, and man at woman. As they gazed excessively at each other, passion arose, and burning desire descended into their bodies. Due to the burning desire, they engaged in sexual intercourse. Those beings, Vāseṭṭha, who at that time saw others engaging in sexual intercourse, threw dust, some threw ashes, some threw cow dung, saying, ‘Away with the impurity, away with the impurity! How could a being do such a thing to another being?’ Even today, when a bride is being led out in some districts, some people throw dust, some throw ashes, some throw cow dung. They follow that ancient tradition, that original term, but they do not understand its meaning.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, යම් යම් අයුරකින් ඒ සත්ත්වයෝ නො වපුළ සහලූ පරිභෝග කරමින් තෘණ භක්ෂණය කොට ඒ ආහාරයෙන් බොහෝ කල් දිගු කාලයක් සිටියාහු ද, එසේ එසේ ඒ සත්ත්වයන්ගේ ශරීරයෙහි දැඩිබව අධිකව පහළ විය. වර්ණය වෙනස් විය. ස්ත්‍රියගේ ස්ත්‍රී ලිංගය ද, පුරුෂයාගේ පුරුෂ ලිංගය ද, පහළ විය. ස්ත්‍රිය පුරුෂයා දෙස අධිකව බලන්නට වූවා ය. පුරුෂයා ස්ත්‍රිය දෙස අධිකව බලන්නට විය. ඔවුහු එකිනෙකා අධික ලෙස බැලූ බැවින් රාගය උපන. ශරීරයෙහි දැවිල්ලක් හට ගැනුණි. ඔවුහු දැවිල්ල හේතුවෙන් මෛථුනය නම් වූ ධර්මයෙහි හැසිරුණාහු ය. වසෙට්ඨයෙනි, යම් සත්ත්වයෝ මෛථුන ධර්මයෙහි හැසිරෙනු ඒ කාලයෙහි දුටුවාහු ද, ඇතැම්හු දූවිලි විසි කරන්නාහු ය. ඇතැම්හු කුණු විසි කරන්නාහු ය. ඇතැම්හු ගොම විසි කරන්නාහු ය. ‘මෙය අශුචියෙකි, මෙය අශුචියෙකි’ කියමින් ගැරහූහ. ‘කෙසේ නම් සත්වයෙක් සත්වයෙකුට මෙබඳු දෙයක් කරන්නේදැ’යි කීහ. අදත් ඇතැම් මිනිස්සු ඇතැම් ජනපදවල මනාලිය පිටත් කර යවන විට ඇතැම්හු දූවිලි විසි කරති. ඇතැම්හු කුණු විසි කරති. ඇතැම්හු ගොම විසි කරති. ඔවුහු ඒ පැරණි අග්ගඤ්ඤ අක්ෂරය අනුගමනය කරති. එහෙත් එහි අර්ථය නො දනිති.",
      "paliTitle": "Itthipurisaliṅgapātubhāvo",
      "englishTitle": "Manifestation of Male and Female Characteristics",
      "sinhalaTitle": "ස්ත්‍රී පුරුෂ ලිංග පාතුභාවය"
    },
    {
      "number": 127,
      "pali": "‘‘Adhammasammataṃ kho pana [adhammasammataṃ taṃ kho pana (syā.), adhammasammataṃ kho pana taṃ (?)], vāseṭṭha, tena samayena hoti, tadetarahi dhammasammataṃ. Ye kho pana, vāseṭṭha, tena samayena sattā methunaṃ dhammaṃ paṭisevanti, te māsampi dvemāsampi na labhanti gāmaṃ vā nigamaṃ vā pavisituṃ. Yato kho te, vāseṭṭha, sattā tasmiṃ asaddhamme ativelaṃ pātabyataṃ āpajjiṃsu. Atha agārāni upakkamiṃsu kātuṃ tasseva asaddhammassa paṭicchādanatthaṃ. Atha kho, vāseṭṭha, aññatarassa sattassa alasajātikassa etadahosi – ‘ambho, kimevāhaṃ vihaññāmi sāliṃ āharanto sāyaṃ sāyamāsāya pāto pātarāsāya! Yaṃnūnāhaṃ sāliṃ āhareyyaṃ sakiṃdeva [sakiṃdeva (ka.)] sāyapātarāsāyā’ti! ‘‘Atha kho so, vāseṭṭha, satto sāliṃ āhāsi sakiṃdeva sāyapātarāsāya. Atha kho, vāseṭṭha, aññataro satto yena so satto tenupasaṅkami; upasaṅkamitvā taṃ sattaṃ etadavoca – ‘ehi, bho satta, sālāhāraṃ gamissāmā’ti. ‘Alaṃ, bho satta, āhato [āhaṭo (syā.)] me sāli sakiṃdeva sāyapātarāsāyā’ti. Atha kho so, vāseṭṭha, satto tassa sattassa diṭṭhānugatiṃ āpajjamāno sāliṃ āhāsi sakiṃdeva dvīhāya. ‘Evampi kira, bho, sādhū’ti. ‘‘Atha kho, vāseṭṭha, aññataro satto yena so satto tenupasaṅkami; upasaṅkamitvā taṃ sattaṃ etadavoca – ‘ehi, bho satta, sālāhāraṃ gamissāmā’ti. ‘Alaṃ, bho satta, āhato me sāli sakiṃdeva dvīhāyā’ti. Atha kho so, vāseṭṭha, satto tassa sattassa diṭṭhānugatiṃ āpajjamāno sāliṃ āhāsi sakiṃdeva catūhāya, ‘evampi kira, bho, sādhū’ti. ‘‘Atha kho, vāseṭṭha, aññataro satto yena so satto tenupasaṅkami; upasaṅkamitvā taṃ sattaṃ etadavoca – ‘ehi, bho satta, sālāhāraṃ gamissāmā’ti. ‘Alaṃ, bho satta, āhato me sāli sakideva catūhāyā’ti. Atha kho so, vāseṭṭha, satto tassa sattassa diṭṭhānugatiṃ āpajjamāno sāliṃ āhāsi sakideva aṭṭhāhāya, ‘evampi kira, bho, sādhū’ti. ‘‘Yato kho te, vāseṭṭha, sattā sannidhikārakaṃ sāliṃ upakkamiṃsu paribhuñjituṃ. Atha kaṇopi taṇḍulaṃ pariyonandhi, thusopi taṇḍulaṃ pariyonandhi; lūnampi nappaṭivirūḷhaṃ, apadānaṃ paññāyittha, saṇḍasaṇḍā sālayo aṭṭhaṃsu. ",
      "english": "\"Furthermore, Vāseṭṭha, what was then considered immoral was at that time, considered moral. Those beings, Vāseṭṭha, who at that time engaged in sexual intercourse, could not obtain permission to enter a village or town for a month or two. But when those beings, Vāseṭṭha, excessively indulged in that unrighteous practice, they began to build houses to conceal that very unrighteousness. Then, Vāseṭṭha, it occurred to a certain lazy being: ‘Why should I trouble myself bringing rice evening after evening for the evening meal, morning after morning for breakfast? Suppose I were to bring rice just once for both the evening and morning meals!’\n\n\"Then, Vāseṭṭha, that being brought rice just once for the evening and morning meals. Then, Vāseṭṭha, another being approached that being and said to him: ‘Come, good being, let us go for our rice.’ ‘Enough, good being, I have brought rice just once for the evening and morning meals.’ Then, Vāseṭṭha, that being, following the example of that being, brought rice just once for two days, thinking: ‘This too is surely good!’\n\n\"Then, Vāseṭṭha, another being approached that being and said to him: ‘Come, good being, let us go for our rice.’ ‘Enough, good being, I have brought rice just once for two days.’ Then, Vāseṭṭha, that being, following the example of that being, brought rice just once for four days, thinking: ‘This too is surely good!’\n\n\"Then, Vāseṭṭha, another being approached that being and said to him: ‘Come, good being, let us go for our rice.’ ‘Enough, good being, I have brought rice just once for four days.’ Then, Vāseṭṭha, that being, following the example of that being, brought rice just once for eight days, thinking: ‘This too is surely good!’\n\n\"When those beings, Vāseṭṭha, began to consume stored-up rice, then the grain was enveloped by husk and bran, the cut stalk no longer grew again, the harvested part became apparent, and the rice stood in clumps.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, යම් කාලයක අධර්මය සත්‍ය වශයෙන් සම්මත වී තිබුණේද, දැන් ඒක ධර්ම වශයෙන් සම්මත වී ඇත. වාසෙට්ඨයෙනි, යම් සත්වයෝ ඒ කාලයෙහි මෛථුන ධර්මයෙහි හැසිරෙත්ද, ඔවුන්ට මාසයක් හෝ දෙමසක් ගමක් හෝ නියම් ගමක් හෝ ඇතුළට යෑමට නොලැබේ. වාසෙට්ඨයෙනි, යම් කලෙක ඒ සත්වයෝ ඒ අධර්මයෙහි ඉතා අධික ලෙස ඇලී ගත්තාහුද, එකල්හි ඒ අධර්මය වැසීම පිණිස ගෙවල් කිරීමට පටන් ගත්තාහුය. වාසෙට්ඨයෙනි, එකල්හි අලස ගතිය ඇති එක් සත්වයෙකුට මෙබඳු අදහසක් ඇතිවිය. ‘අහෝ! මම සවසට සවස ආහාරය පිණිසත්, උදේට උදේ ආහාරය පිණිසත් සහල් ගෙන එමින් කිමෙක් හෙම්බත් වෙම්ද? මම එක්වරක්ම සවස සහ උදේ ආහාරය පිණිස සහල් ගෙන ආවොත් මැනවැ’යි සිතුවේය.\n\n‘‘වාසෙට්ඨයෙනි, එකල්හි ඒ සත්ත්වයා එක්වරක්ම සවස සහ උදේ ආහාරය පිණිස සහල් ගෙන ආවේය. වාසෙට්ඨයෙනි, එකල්හි අනෙක් සත්ත්වයෙක් ඒ සත්ත්වයා වෙත පැමිණියේය. පැමිණ ඒ සත්ත්වයාට මෙසේ කීවේය. ‘එම්බල සත්ත්වය, සහල් ආහාරයට යමු’යි කීවේය. ‘එම්බල සත්ත්වය, මට එපා. සවස සහ උදේ ආහාරය සඳහා එක්වරක්ම සහල් ගෙනෙන ලදී’යි කීවේය. වාසෙට්ඨයෙනි, එකල්හි ඒ සත්ත්වයා ඒ සත්ත්වයාගේ දැකීම අනුව යමින් දින දෙකකට වරක් සහල් ගෙන ආවේය. ‘මෙයත් හොඳයි’ කියා සිතුවේය.\n\n‘‘වාසෙට්ඨයෙනි, එකල්හි අනෙක් සත්ත්වයෙක් ඒ සත්ත්වයා වෙත පැමිණියේය. පැමිණ ඒ සත්ත්වයාට මෙසේ කීවේය. ‘එම්බල සත්ත්වය, සහල් ආහාරයට යමු’යි කීවේය. ‘එම්බල සත්ත්වය, මට එපා. දින දෙකකට වරක් එක්වරක්ම සහල් ගෙනෙන ලදී’යි කීවේය. වාසෙට්ඨයෙනි, එකල්හි ඒ සත්ත්වයා ඒ සත්ත්වයාගේ දැකීම අනුව යමින් දින හතරකට වරක් සහල් ගෙන ආවේය. ‘මෙයත් හොඳයි’ කියා සිතුවේය.\n\n‘‘වාසෙට්ඨයෙනි, එකල්හි අනෙක් සත්ත්වයෙක් ඒ සත්ත්වයා වෙත පැමිණියේය. පැමිණ ඒ සත්ත්වයාට මෙසේ කීවේය. ‘එම්බල සත්ත්වය, සහල් ආහාරයට යමු’යි කීවේය. ‘එම්බල සත්ත්වය, මට එපා. දින හතරකට වරක් එක්වරක්ම සහල් ගෙනෙන ලදී’යි කීවේය. වාසෙට්ඨයෙනි, එකල්හි ඒ සත්ත්වයා ඒ සත්ත්වයාගේ දැකීම අනුව යමින් දින අටකට වරක් සහල් ගෙන ආවේය. ‘මෙයත් හොඳයි’ කියා සිතුවේය.\n\n‘‘වාසෙට්ඨයෙනි, යම් කලෙක ඒ සත්වයෝ ගොඩ ගසා තබාගෙන සහල් පරිභෝජනය කිරීමට පටන් ගත්තාහුද, එකල්හි ලෙල්ල සහල්වලින් වැසී ගියේය. පොත්ත සහල්වලින් වැසී ගියේය. කපන ලද්දාවූද නැවත නොවැඩෙන්නාවූද, හීන බව ප්‍රකට විය. ගොඩගොඩවල් ලෙස සහල් පැවතුණි.",
      "paliTitle": "Methunadhammasamācāro",
      "englishTitle": "Sexual Conduct",
      "sinhalaTitle": "මෛථුන ධර්ම සමාචාරය"
    },
    {
      "number": 128,
      "pali": "‘‘Atha kho te, vāseṭṭha, sattā sannipatiṃsu, sannipatitvā anutthuniṃsu – ‘pāpakā vata, bho, dhammā sattesu pātubhūtā. Mayañhi pubbe manomayā ahumhā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ aṭṭhamhā. Tesaṃ no amhākaṃ kadāci karahaci dīghassa addhuno accayena rasapathavī udakasmiṃ samatani. Sā ahosi vaṇṇasampannā gandhasampannā rasasampannā. Te mayaṃ rasapathaviṃ hatthehi āluppakārakaṃ upakkamimha paribhuñjituṃ, tesaṃ no rasapathaviṃ hatthehi āluppakārakaṃ upakkamataṃ paribhuñjituṃ sayaṃpabhā antaradhāyi. Sayaṃpabhāya antarahitāya candimasūriyā pāturahesuṃ, candimasūriyesu pātubhūtesu nakkhattāni tārakarūpāni pāturahesuṃ, nakkhattesu tārakarūpesu pātubhūtesu rattindivā paññāyiṃsu, rattindivesu paññāyamānesu māsaḍḍhamāsā paññāyiṃsu. Māsaḍḍhamāsesu paññāyamānesu utusaṃvaccharā paññāyiṃsu. Te mayaṃ rasapathaviṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhamhā. Tesaṃ no pāpakānaṃyeva akusalānaṃ dhammānaṃ pātubhāvā rasapathavī antaradhāyi. Rasapathaviyā antarahitāya bhūmipappaṭako pāturahosi. So ahosi vaṇṇasampanno gandhasampanno rasasampanno. Te mayaṃ bhūmipappaṭakaṃ upakkamimha paribhuñjituṃ. Te mayaṃ taṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhamhā. Tesaṃ no pāpakānaṃyeva akusalānaṃ dhammānaṃ pātubhāvā bhūmipappaṭako antaradhāyi. Bhūmipappaṭake antarahite padālatā pāturahosi. Sā ahosi vaṇṇasampannā gandhasampannā rasasampannā. Te mayaṃ padālataṃ upakkamimha paribhuñjituṃ. Te mayaṃ taṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhamhā. Tesaṃ no pāpakānaṃyeva akusalānaṃ dhammānaṃ pātubhāvā padālatā antaradhāyi. Padālatāya antarahitāya akaṭṭhapāko sāli pāturahosi akaṇo athuso suddho sugandho taṇḍulapphalo. Yaṃ taṃ sāyaṃ sāyamāsāya āharāma, pāto taṃ hoti pakkaṃ paṭivirūḷhaṃ. Yaṃ taṃ pāto pātarāsāya āharāma, sāyaṃ taṃ hoti pakkaṃ paṭivirūḷhaṃ. Nāpadānaṃ paññāyittha. Te mayaṃ akaṭṭhapākaṃ sāliṃ paribhuñjantā taṃbhakkhā tadāhārā ciraṃ dīghamaddhānaṃ aṭṭhamhā. Tesaṃ no pāpakānaṃyeva akusalānaṃ dhammānaṃ pātubhāvā kaṇopi taṇḍulaṃ pariyonandhi, thusopi taṇḍulaṃ pariyonandhi, lūnampi nappaṭivirūḷhaṃ, apadānaṃ paññāyittha, saṇḍasaṇḍā sālayo ṭhitā. Yaṃnūna mayaṃ sāliṃ vibhajeyyāma, mariyādaṃ ṭhapeyyāmā’ti! Atha kho te, vāseṭṭha, sattā sāliṃ vibhajiṃsu, mariyādaṃ ṭhapesuṃ.",
      "english": "Then, Vāseṭṭha, those beings came together, and having come together, they lamented: ‘Indeed, evil and unwholesome qualities have become manifest among beings. For formerly we were mind-made, feeding on delight, self-luminous, moving in the sky, abiding in glory, for a long, long time. Then, after a long time had passed, a savory earth appeared on the water for us. It was richly endowed with color, richly endowed with fragrance, richly endowed with taste. Then we began to partake of that savory earth with our hands, making it into lumps. As we began to partake of that savory earth with our hands, making it into lumps, our self-luminosity vanished. When our self-luminosity had vanished, the sun and moon appeared. When the sun and moon had appeared, the stars and constellations appeared. When the stars and constellations had appeared, night and day became distinct. As night and day became distinct, the fortnights and months became distinct. As the fortnights and months became distinct, the seasons and years became distinct. We partook of that savory earth, feeding on it, nourished by it, for a long, long time. Then, with the manifestation of evil and unwholesome qualities, the savory earth vanished. When the savory earth had vanished, an earth-pancake appeared. It was richly endowed with color, richly endowed with fragrance, richly endowed with taste. We began to partake of that earth-pancake. We partook of it, feeding on it, nourished by it, for a long, long time. Then, with the manifestation of evil and unwholesome qualities, the earth-pancake vanished. When the earth-pancake had vanished, a padālatā creeper appeared. It was richly endowed with color, richly endowed with fragrance, richly endowed with taste. We began to partake of that padālatā creeper. We partook of it, feeding on it, nourished by it, for a long, long time. Then, with the manifestation of evil and unwholesome qualities, the padālatā creeper vanished. When the padālatā creeper had vanished, self-ripening rice appeared, unhusked, without chaff, clean, fragrant, with grains of rice. What we would take in the evening for the evening meal, in the morning it would be ripe and grown again. What we would take in the morning for breakfast, in the evening it would be ripe and grown again. No cutting-off was evident. We partook of that self-ripening rice, feeding on it, nourished by it, for a long, long time. Then, with the manifestation of evil and unwholesome qualities, the grain became enclosed in husk, and the rice became enclosed in chaff. What was cut did not grow again, and cutting-off was evident, and rice plants stood in clumps. Suppose now we were to divide the rice and set boundaries.’ Then, Vāseṭṭha, those beings divided the rice and set boundaries.",
      "sinhala": "“වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ රැස් වූහ. රැස්ව එකිනෙකා තලා පෙළා හඬන්නට වූහ. ‘අහෝ, සත්වයන් කෙරෙහි පාපී ධර්ම පහළ වී ඇත. මත්තෙයම්හි අපි මනෝමය වූයෙමු. ප්‍රීතිය අපගේ ආහාරය විය. තනිවම බබළන්නෙමු. අහසෙහි හැසිරෙන්නෙමු. බොහෝ කලක් ඉතා සතුටින් විසුවෙමු. එබඳු වූ අපට බොහෝ දීර්ඝ කාලයක් ඉක්මීමෙන් පසු වරෙක ජලයෙහි රස පොළොව මතු විය. එය වර්ණයෙන් යුක්ත විය. ගඳින් යුක්ත විය. රසයෙන් යුක්ත විය. අපි ඒ රස පොළොව අතින් ගෙන කැබලි කර කමින් පරිභෝජනය කරන්නට වීමු. අපි රස පොළොව අතින් ගෙන කැබලි කර කමින් පරිභෝජනය කරන්නට වීමෙන් පසු තනිවම බැබළීම අතුරුදහන් විය. තනිවම බැබළීම අතුරුදහන් වූ පසු හිරු සඳු දෙදෙනා පහළ වූහ. හිරු සඳු දෙදෙනා පහළ වූ පසු තරු හා තාරකා රූප පහළ වූහ. තරු හා තාරකා රූප පහළ වූ පසු රාත්‍රිය හා දිවා ප්‍රකාශ විය. රාත්‍රිය හා දිවා ප්‍රකාශ වීමෙන් පසු මාස හා අඩමස ප්‍රකාශ විය. මාස හා අඩමස ප්‍රකාශ වීමෙන් පසු සෘතු හා වසර ප්‍රකාශ විය. අපි ඒ රස පොළොව පරිභෝජනය කරමින් එයම ආහාර කොට ගෙන බොහෝ දීර්ඝ කාලයක් විසුවෙමු. අප කෙරෙහි පාපී අකුසල ධර්ම පහළ වීමෙන් රස පොළොව අතුරුදහන් විය. රස පොළොව අතුරුදහන් වීමෙන් පසු බිම් හතු මතු විය. එය වර්ණයෙන් යුක්ත විය. ගඳින් යුක්ත විය. රසයෙන් යුක්ත විය. අපි ඒ බිම් හතු පරිභෝජනය කරන්නට වීමු. අපි එය පරිභෝජනය කරමින් එයම ආහාර කොට ගෙන බොහෝ දීර්ඝ කාලයක් විසුවෙමු. අප කෙරෙහි පාපී අකුසල ධර්ම පහළ වීමෙන් බිම් හතු අතුරුදහන් විය. බිම් හතු අතුරුදහන් වීමෙන් පසු වැල් හතු මතු විය. එය වර්ණයෙන් යුක්ත විය. ගඳින් යුක්ත විය. රසයෙන් යුක්ත විය. අපි ඒ වැල් හතු පරිභෝජනය කරන්නට වීමු. අපි එය පරිභෝජනය කරමින් එයම ආහාර කොට ගෙන බොහෝ දීර්ඝ කාලයක් විසුවෙමු. අප කෙරෙහි පාපී අකුසල ධර්ම පහළ වීමෙන් වැල් හතු අතුරුදහන් විය. වැල් හතු අතුරුදහන් වීමෙන් පසු වගා නොකරන ලද සහල් මතු විය. එය ලෙලි රහිත විය. කැන රහිත විය. පිරිසිදු විය. සුවඳවත් විය. බත් ඇටවලින් යුක්ත විය. අපි සවස් කාලයේ සවස ආහාරය සඳහා එය උදුරා ගනිමු. උදෑසන එය පිසින ලද්දේ නැවත වැඩුණු දෙයක් මෙන් විය. අපි උදෑසන උදෑසන ආහාරය සඳහා එය උදුරා ගනිමු. සවස් කාලයේ එය පිසින ලද්දේ නැවත වැඩුණු දෙයක් මෙන් විය. කැඩීමක් ප්‍රකාශ නොවීය. අපි වගා නොකරන ලද සහල් පරිභෝජනය කරමින් එයම ආහාර කොට ගෙන බොහෝ දීර්ඝ කාලයක් විසුවෙමු. අප කෙරෙහි පාපී අකුසල ධර්ම පහළ වීමෙන් සහල් ඇටයෙහි කැන හට ගත්තේය. සහල් ඇටයෙහි ලෙල්ල හට ගත්තේය. කපන ලද්දේ ද නැවත වැඩුණේ නැත. කැඩීමක් ප්‍රකාශ විය. සහල් ගොඩවල් වශයෙන් සිටින ලදී. ‘අපි මේ සහල් බෙදා ගනිමු. සීමා ඇති කරමු’යි කීහ. වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ සහල් බෙදා ගත්හ. සීමා ඇති කළහ.”",
      "paliTitle": "Sālivibhāgo",
      "englishTitle": "Division of Rice",
      "sinhalaTitle": "සාලි විභාගය"
    },
    {
      "number": 129,
      "pali": "‘‘Atha kho, vāseṭṭha, aññataro satto lolajātiko sakaṃ bhāgaṃ parirakkhanto aññataraṃ [aññassa (?)] bhāgaṃ adinnaṃ ādiyitvā paribhuñji. Tamenaṃ aggahesuṃ, gahetvā etadavocuṃ – ‘pāpakaṃ vata, bho satta, karosi, yatra hi nāma sakaṃ bhāgaṃ parirakkhanto aññataraṃ bhāgaṃ adinnaṃ ādiyitvā paribhuñjasi. Māssu, bho satta, punapi evarūpamakāsī’ti. ‘Evaṃ, bho’ti kho, vāseṭṭha, so satto tesaṃ sattānaṃ paccassosi. Dutiyampi kho, vāseṭṭha, so satto…pe… tatiyampi kho, vāseṭṭha, so satto sakaṃ bhāgaṃ parirakkhanto aññataraṃ bhāgaṃ adinnaṃ ādiyitvā paribhuñji. Tamenaṃ aggahesuṃ, gahetvā etadavocuṃ – ‘pāpakaṃ vata, bho satta, karosi, yatra hi nāma sakaṃ bhāgaṃ parirakkhanto aññataraṃ bhāgaṃ adinnaṃ ādiyitvā paribhuñjasi. Māssu, bho satta, punapi evarūpamakāsī’ti. Aññe pāṇinā pahariṃsu, aññe leḍḍunā pahariṃsu, aññe daṇḍena pahariṃsu. Tadagge kho, vāseṭṭha, adinnādānaṃ paññāyati, garahā paññāyati, musāvādo paññāyati, daṇḍādānaṃ paññāyati. ",
      "english": "Then, Vāseṭṭha, a certain being, being greedy, while guarding his own share, took another's share that was not given and consumed it. They seized him, and having seized him, said this to him, ‘Surely, good being, you are doing evil, in that, while guarding your own share, you take another's share that was not given and consume it. Good being, do not do such a thing again.’ ‘Yes, good sirs,’ Vāseṭṭha, that being replied to those beings. A second time, Vāseṭṭha, that being… A third time, Vāseṭṭha, that being, while guarding his own share, took another's share that was not given and consumed it. They seized him, and having seized him, said this to him, ‘Surely, good being, you are doing evil, in that, while guarding your own share, you take another's share that was not given and consume it. Good being, do not do such a thing again.’ Some struck him with their hands, some struck him with clods, some struck him with sticks. From that time, Vāseṭṭha, taking what is not given was recognized, blame was recognized, lying was recognized, and the taking up of a stick was recognized.",
      "sinhala": "‘‘එකල්හි වාසෙට්‌ඨයෙනි, ලොල් බව ඇති එක් සත්වයෙක් තම කොටස රක්ෂා කරමින් අනුන්ගේ කොටසක් දීමකින් තොරව ගෙන පරිභෝජනය කළේය. එවිට ඔවුන් ඔහු අල්ලා ගෙන මෙසේ කීහ: ‘අහෝ සත්වයා, ඔබ පාපී ක්‍රියාවක් කරයි, මන්ද යත් ඔබ ඔබේ කොටස රක්ෂා කරමින් අනුන්ගේ කොටසක් දීමකින් තොරව ගෙන පරිභෝජනය කරන්නෙහි නම්, අහෝ සත්වයා, නැවත මෙවැනි දෙයක් නොකරන්න.’ එවිට වාසෙට්‌ඨයෙනි, ඒ සත්වයා ‘එසේය’ කියා ඒ සත්ත්වයන්ට පිළිතුරු දුන්නේය. දෙවන වරටත් වාසෙට්‌ඨයෙනි, ඒ සත්වයා... තුන්වන වරටත් වාසෙට්‌ඨයෙනි, ඒ සත්වයා තම කොටස රක්ෂා කරමින් අනුන්ගේ කොටසක් දීමකින් තොරව ගෙන පරිභෝජනය කළේය. එවිට ඔවුන් ඔහු අල්ලා ගෙන මෙසේ කීහ: ‘අහෝ සත්වයා, ඔබ පාපී ක්‍රියාවක් කරයි, මන්ද යත් ඔබ ඔබේ කොටස රක්ෂා කරමින් අනුන්ගේ කොටසක් දීමකින් තොරව ගෙන පරිභෝජනය කරන්නෙහි නම්, අහෝ සත්වයා, නැවත මෙවැනි දෙයක් නොකරන්න.’ ඇතැමෙක් අතින් පහර දුන්හ, ඇතැමෙක් මැටි කැටවලින් පහර දුන්හ, ඇතැමෙක් දඬුවලින් පහර දුන්හ. වාසෙට්‌ඨයෙනි, එතැන් පටන් අන්සතුදේ ගැනීම ප්‍රකට විය, ගැරහීම ප්‍රකට විය, බොරු කීම ප්‍රකට විය, දඬුවම් දීම ප්‍රකට විය.",
      "paliTitle": ""
    },
    {
      "number": 130,
      "pali": "‘‘Atha kho te, vāseṭṭha, sattā sannipatiṃsu, sannipatitvā anutthuniṃsu – ‘pāpakā vata bho dhammā sattesu pātubhūtā, yatra hi nāma adinnādānaṃ paññāyissati, garahā paññāyissati, musāvādo paññāyissati, daṇḍādānaṃ paññāyissati. Yaṃnūna mayaṃ ekaṃ sattaṃ sammanneyyāma, yo no sammā khīyitabbaṃ khīyeyya, sammā garahitabbaṃ garaheyya, sammā pabbājetabbaṃ pabbājeyya. Mayaṃ panassa sālīnaṃ bhāgaṃ anuppadassāmā’ti. ‘‘Atha kho te, vāseṭṭha, sattā yo nesaṃ satto abhirūpataro ca dassanīyataro ca pāsādikataro ca mahesakkhataro ca taṃ sattaṃ upasaṅkamitvā etadavocuṃ – ‘ehi, bho satta, sammā khīyitabbaṃ khīya, sammā garahitabbaṃ garaha, sammā pabbājetabbaṃ pabbājehi. Mayaṃ pana te sālīnaṃ bhāgaṃ anuppadassāmā’ti. ‘Evaṃ, bho’ti kho, vāseṭṭha, so satto tesaṃ sattānaṃ paṭissuṇitvā sammā khīyitabbaṃ khīyi, sammā garahitabbaṃ garahi, sammā pabbājetabbaṃ pabbājesi. Te panassa sālīnaṃ bhāgaṃ anuppadaṃsu.",
      "english": "Then, Vāseṭṭha, those beings gathered together, and having gathered together, they lamented: ‘Indeed, evil things have appeared among beings, inasmuch as theft will be recognized, censure will be recognized, falsehood will be recognized, and punishment will be recognized. Suppose now that we were to choose a certain being who would rightly censure those who should be censured, rightly rebuke those who should be rebuked, and rightly banish those who should be banished. And we would provide him with a portion of rice.’\n\nThen, Vāseṭṭha, those beings approached that being who was more handsome, more beautiful, more pleasing, and more powerful than the rest, and said this to him: ‘Come, good being, rightly censure those who should be censured, rightly rebuke those who should be rebuked, and rightly banish those who should be banished. And we will provide you with a portion of rice.’ ‘So be it, good sirs,’ Vāseṭṭha, that being agreed to the beings' proposal and rightly censured those who should be censured, rightly rebuked those who should be rebuked, and rightly banished those who should be banished. And they provided him with a portion of rice.",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ රැස් වූහ. රැස්ව, ‘අහෝ, සත්වයන් කෙරෙහි පාපී ධර්ම පහළ වී ඇත. මන්ද යත්, සොරකම පෙනෙන්නේ ය, ගැරහීම පෙනෙන්නේ ය, බොරු කීම පෙනෙන්නේ ය, දඬුවම් දීම පෙනෙන්නේ ය. අපි ක්‍ෂමාව දිය යුත්තාට මැනවින් ක්‍ෂමා කරන්නා වූ, ගැරහිය යුත්තාට මැනවින් ගරහන්නා වූ, නෙරපිය යුත්තාට මැනවින් නෙරපන්නා වූ එක් සත්වයකු සම්මත කර ගනිමු. අපි ඔහුට සහල්වලින් කොටසක් දෙන්නෙමු’යි ඔවුහු කීහ.\n\n‘‘වාසෙට්ඨයෙනි, ඉක්බිති ඒ සත්වයෝ තමන් අතරින් යම් සත්වයෙක් ඉතා රූපවත් ද, දැකීමට ප්‍රිය ද, ප්‍රසාදජනක ද, මහත් බල ඇති ද, ඒ සත්ත්වයා වෙත එළඹ, ‘එම්බල සත්වයාණෙනි, ඔබ මැනවින් ක්‍ෂමාව දිය යුත්තාට ක්‍ෂමා කරන්න. මැනවින් ගැරහිය යුත්තාට ගරහන්න. මැනවින් නෙරපිය යුත්තාට නෙරපන්න. අපි ඔබට සහල්වලින් කොටසක් දෙන්නෙමු’යි කීහ.\n\n‘එසේ ය, ස්වාමීනි’යි වහන්ස, ඒ සත්ත්වයා ඒ සත්වයන්ට ප්‍රතිඥා දී, මැනවින් ක්‍ෂමාව දිය යුත්තාට ක්‍ෂමා කළේ ය. මැනවින් ගැරහිය යුත්තාට ගැරහුවේ ය. මැනවින් නෙරපිය යුත්තාට නෙරපුවේ ය. ඔවුහු ඔහුට සහල්වලින් කොටසක් දුන්හ.",
      "paliTitle": "Mahāsammatarājā",
      "englishTitle": "The Great Chosen King",
      "sinhalaTitle": "මහා සම්මත රජ"
    },
    {
      "number": 131,
      "pali": "‘‘Mahājanasammatoti kho, vāseṭṭha, ‘mahāsammato, mahāsammato’ tveva paṭhamaṃ akkharaṃ upanibbattaṃ. Khettānaṃ adhipatīti kho, vāseṭṭha, ‘khattiyo, khattiyo’ tveva dutiyaṃ akkharaṃ upanibbattaṃ. Dhammena pare rañjetīti kho, vāseṭṭha, ‘rājā, rājā’ tveva tatiyaṃ akkharaṃ upanibbattaṃ. Iti kho, vāseṭṭha, evametassa khattiyamaṇḍalassa porāṇena aggaññena akkharena abhinibbatti ahosi tesaṃyeva sattānaṃ, anaññesaṃ. Sadisānaṃyeva, no asadisānaṃ. Dhammeneva, no adhammena. Dhammo hi, vāseṭṭha, seṭṭho janetasmiṃ diṭṭhe ceva dhamme abhisamparāyañca. ",
      "english": "\"Because they were approved by the great assembly, Vāseṭṭha, the first designation arose: 'Mahāsammata,' 'Mahāsammata.' Because he was the lord of the fields, Vāseṭṭha, the second designation arose: 'Khattiya,' 'Khattiya.' Because he delights others with the Dhamma, Vāseṭṭha, the third designation arose: 'Rājā,' 'Rājā.' Thus, Vāseṭṭha, the arising of this noble lineage of warriors came about through this ancient, foremost designation, from those very beings, not from others; from those similar, not from those dissimilar; by means of the Dhamma, not by means of non-Dhamma. For, Vāseṭṭha, the Dhamma is the best thing for people in this very life, and for the life to come.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ‘මහාජන සම්මත’ යන හෙයින් ‘මහාසම්මත, මහාසම්මත’ යනුවෙන් පළමු අකුර උපනිපන්න විය. වාසෙට්ඨයෙනි, ක්ෂෙත්‍රයන්ට අධිපති වූ හෙයින් ‘ඛත්තිය, ඛත්තිය’ යනුවෙන් දෙවන අකුර උපනිපන්න විය. වාසෙට්ඨයෙනි, ධර්මයෙන් අනුන් රංජනය කෙරේ නම්, ‘රාජා, රාජා’ යනුවෙන් තුන්වන අකුර උපනිපන්න විය. වාසෙට්ඨයෙනි, මෙසේ මේ ක්ෂත්‍රිය මණ්ඩලයට ඒ සත්ත්වයන්ගේම, අන්‍යයන්ගේ නොවූ පැරණි අග්ගඤ්ඤ අකුරෙන් අභිනිර්වෘත්තියක් විය. සමානයන්ගේම විය, අසමානයන්ගේ නොවේ. ධර්මයෙන්ම විය, අධර්මයෙන් නොවේ. වාසෙට්ඨයෙනි, මේ දිට්ඨ ධර්මයෙහිද, මතු භවයෙහිද ධර්මය ජනයා අතර ශ්‍රේෂ්ඨ වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 132,
      "pali": "‘‘Atha kho tesaṃ, vāseṭṭha, sattānaṃyeva [tesaṃ yeva kho vāseṭṭha sattānaṃ (sī. pī.)] ekaccānaṃ etadahosi – ‘pāpakā vata, bho, dhammā sattesu pātubhūtā, yatra hi nāma adinnādānaṃ paññāyissati, garahā paññāyissati, musāvādo paññāyissati, daṇḍādānaṃ paññāyissati, pabbājanaṃ paññāyissati. Yaṃnūna mayaṃ pāpake akusale dhamme vāheyyāmā’ti. Te pāpake akusale dhamme vāhesuṃ. Pāpake akusale dhamme vāhentīti kho, vāseṭṭha, ‘brāhmaṇā, brāhmaṇā’ tveva paṭhamaṃ akkharaṃ upanibbattaṃ. Te araññāyatane paṇṇakuṭiyo karitvā paṇṇakuṭīsu jhāyanti vītaṅgārā vītadhūmā pannamusalā sāyaṃ sāyamāsāya pāto pātarāsāya gāmanigamarājadhāniyo osaranti ghāsamesamānā [ghāsamesanā (sī. syā. pī.)]. Te ghāsaṃ paṭilabhitvā punadeva araññāyatane paṇṇakuṭīsu jhāyanti. Tamenaṃ manussā disvā evamāhaṃsu – ‘ime kho, bho, sattā araññāyatane paṇṇakuṭiyo karitvā paṇṇakuṭīsu jhāyanti, vītaṅgārā vītadhūmā pannamusalā sāyaṃ sāyamāsāya pāto pātarāsāya gāmanigamarājadhāniyo osaranti ghāsamesamānā. Te ghāsaṃ paṭilabhitvā punadeva araññāyatane paṇṇakuṭīsu jhāyantī’ti, jhāyantīti kho [paṇṇakuṭīsu jhāyanti jhāyantīti kho (sī. pī.), paṇṇakuṭīsu jhāyantīti kho (ka.)], vāseṭṭha, ‘jhāyakā, jhāyakā’ tveva dutiyaṃ akkharaṃ upanibbattaṃ. Tesaṃyeva kho, vāseṭṭha, sattānaṃ ekacce sattā araññāyatane paṇṇakuṭīsu taṃ jhānaṃ anabhisambhuṇamānā [anabhisaṃbhūnamānā (katthaci)] gāmasāmantaṃ nigamasāmantaṃ osaritvā ganthe karontā acchanti. Tamenaṃ manussā disvā evamāhaṃsu – ‘ime kho, bho, sattā araññāyatane paṇṇakuṭīsu taṃ jhānaṃ anabhisambhuṇamānā gāmasāmantaṃ nigamasāmantaṃ osaritvā ganthe karontā acchanti, na dānime jhāyantī’ti. Na dānime [na dānime jhāyantī na dānime (sī. pī. ka.)] jhāyantīti kho, vāseṭṭha, ‘ajjhāyakā ajjhāyakā’ tveva tatiyaṃ akkharaṃ upanibbattaṃ. Hīnasammataṃ kho pana, vāseṭṭha, tena samayena hoti, tadetarahi seṭṭhasammataṃ. Iti kho, vāseṭṭha, evametassa brāhmaṇamaṇḍalassa porāṇena aggaññena akkharena abhinibbatti ahosi tesaṃyeva sattānaṃ, anaññesaṃ sadisānaṃyeva no asadisānaṃ dhammeneva, no adhammena. Dhammo hi, vāseṭṭha, seṭṭho janetasmiṃ diṭṭhe ceva dhamme abhisamparāyañca. ",
      "english": "Then, Vāseṭṭha, it occurred to some of those beings: ‘Truly, evil and unwholesome qualities have become manifest among beings, inasmuch as theft, censure, falsehood, the use of force, and banishment will be evident. Suppose now that we were to abandon evil and unwholesome qualities.’ They abandoned evil and unwholesome qualities. Because they abandoned evil and unwholesome qualities, Vāseṭṭha, the first designation ‘brāhmaṇas, brāhmaṇas’ came into being. They, making leaf huts in forest groves, meditated in the leaf huts, devoid of embers and smoke, with pestles laid aside; in the evening they went down to villages, towns, and royal capitals for their evening meal, and in the morning for their morning meal, seeking food. Having obtained food, they again meditated in leaf huts in forest groves. People seeing them said thus: ‘These good sirs, making leaf huts in forest groves, meditate in leaf huts, devoid of embers and smoke, with pestles laid aside; in the evening they go down to villages, towns, and royal capitals for their evening meal, and in the morning for their morning meal, seeking food. Having obtained food, they again meditate in leaf huts in forest groves.’ Because they meditated, Vāseṭṭha, the second designation ‘meditators, meditators’ came into being.\n\nThen, Vāseṭṭha, some beings of those very ones, not being able to fully accomplish that meditation in leaf huts in forest groves, went down to the outskirts of villages and towns and remained occupied with composing texts. People seeing them said thus: ‘These good sirs, not being able to fully accomplish that meditation in leaf huts in forest groves, have gone down to the outskirts of villages and towns and remain occupied with composing texts; now they do not meditate.’ Because they no longer meditated, Vāseṭṭha, the third designation ‘non-meditators, non-meditators’ came into being. But at that time, Vāseṭṭha, that was considered inferior, whereas now it is considered the best. Thus, Vāseṭṭha, the coming into being of this brahmin community through the ancient original designation happened in this way for those very beings, not for others, for those similar to them, not dissimilar, by means of the Dhamma, not by means of non-Dhamma. For the Dhamma, Vāseṭṭha, is the best thing in this world, both in this seen Dhamma and in the future.",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඒ සත්වයන් අතුරෙන් ඇතැම් සත්වයනට මෙබඳු අදහසක් ඇති විය. ‘අහෝ, සත්වයන් කෙරෙහි පාපී ධර්ම පහළ වී ඇත. මන්ද යත් සොරකම පෙනෙන්නේ ය, ගැරහීම පෙනෙන්නේ ය, බොරු කීම පෙනෙන්නේ ය, දඬුවම් දීම පෙනෙන්නේ ය, පිටුවහල් කිරීම පෙනෙන්නේ ය. අපි ඒ පාපී අකුසල ධර්ම දුරු කරමු’යි කියාය. ඔවුහු ඒ පාපී අකුසල ධර්ම දුරු කළහ. වාසෙට්ඨයෙනි, පාපී අකුසල ධර්ම දුරු කළ බැවින් ‘බ්‍රාහ්මණ, බ්‍රාහ්මණ’ යන පළමු අකුර උපනිපන්න විය. ඔවුහු අරණ්‍යවාසවල පත්‍රවලින් කුටි සාදාගෙන පත්‍ර කුටිවල කෝප රහිතව, දුම් රහිතව, අලු කෙළිමින් සවස් කාලයේ සවස ආහාරය සඳහා ද, උදෑසන උදෑසන ආහාරය සඳහා ද ගම් නියම්ගම් රාජධානිවලට බත් සොයමින් බසින්නාහ. ඔවුහු බත් ලබාගෙන නැවත අරණ්‍යවාසවල පත්‍ර කුටිවල ධ්‍යාන කරති. මිනිස්සු ඔවුන් දැක මෙසේ කීහ. ‘භවත්නි, මේ සත්වයෝ අරණ්‍යවාසවල පත්‍ර කුටි සාදාගෙන පත්‍ර කුටිවල කෝප රහිතව, දුම් රහිතව, අලු කෙළිමින් සවස් කාලයේ සවස ආහාරය සඳහා ද, උදෑසන උදෑසන ආහාරය සඳහා ද ගම් නියම්ගම් රාජධානිවලට බත් සොයමින් බසින්නාහ. ඔවුහු බත් ලබාගෙන නැවත අරණ්‍යවාසවල පත්‍ර කුටිවල ධ්‍යාන කරති’යි කීහ. වාසෙට්ඨයෙනි, ධ්‍යාන කරති, ධ්‍යාන කරති කී බැවින් ‘ධ්‍යායක, ධ්‍යායක’ යන දෙවන අකුර උපනිපන්න විය. වාසෙට්ඨයෙනි, ඒ සත්වයන් අතුරෙන් ඇතැම් සත්වයෝ අරණ්‍යවාසවල පත්‍ර කුටිවල ඒ ධ්‍යානය අවබෝධ කරගත නොහැකිව ගම් අසලට නියම්ගම් අසලට බැස පොත්පත් කරමින් වාසය කරති. මිනිස්සු ඔවුන් දැක මෙසේ කීහ. ‘භවත්නි, මේ සත්වයෝ අරණ්‍යවාසවල පත්‍ර කුටිවල ඒ ධ්‍යානය අවබෝධ කරගත නොහැකිව ගම් අසලට නියම්ගම් අසලට බැස පොත්පත් කරමින් වාසය කරති. දැන් මොවුහු ධ්‍යාන නොකරති’යි කීහ. වාසෙට්ඨයෙනි, දැන් ධ්‍යාන නොකරති කී බැවින් ‘අධ්‍යායක, අධ්‍යායක’ යන තුන්වන අකුර උපනිපන්න විය. වාසෙට්ඨයෙනි, ඒ කාලයෙහි එය පහත් යැයි සම්මත විය. දැන් එය උතුම් යැයි සම්මත වේ. වාසෙට්ඨයෙනි, මේ ආකාරයෙන් මේ බ්‍රාහ්මණ මණ්ඩලයේ පැරණි අග්ගඤ්ඤ අකුරෙන් උපත සිදුවූයේ ඒ සත්වයන්ගේම මිස අන්‍යයන්ගේ නොවේ. සමානයන්ගේම මිස අසමානයන්ගේ නොවේ. ධර්මයෙන්මය මිස අධර්මයෙන් නොවේ. වාසෙට්ඨයෙනි, මේ දිට්ඨ ධර්මයෙහිද, මතු භවයෙහිද ධර්මයම උතුම් වන්නේය.\"",
      "paliTitle": "Brāhmaṇamaṇḍalaṃ",
      "englishTitle": "The Brahmin Circle",
      "sinhalaTitle": "බ්‍රාහ්මණ මණ්ඩලය"
    },
    {
      "number": 133,
      "pali": "‘‘Tesaṃyeva kho, vāseṭṭha, sattānaṃ ekacce sattā methunaṃ dhammaṃ samādāya visukammante [vissutakammante (sī. pī.), vissukammante (ka. sī.), visuṃ kammante (syā. ka.)] payojesuṃ. Methunaṃ dhammaṃ samādāya visukammante payojentīti kho, vāseṭṭha, ‘vessā, vessā’ tveva akkharaṃ upanibbattaṃ. Iti kho, vāseṭṭha, evametassa vessamaṇḍalassa porāṇena aggaññena akkharena abhinibbatti ahosi tesaññeva sattānaṃ anaññesaṃ sadisānaṃyeva, no asadisānaṃ, dhammeneva no adhammena. Dhammo hi, vāseṭṭha, seṭṭho janetasmiṃ diṭṭhe ceva dhamme abhisamparāyañca. ",
      "english": "\"Indeed, Vāseṭṭha, some of those beings, engaging in the practice of sexual intercourse, applied themselves to diverse activities. Because they engaged in the practice of sexual intercourse and applied themselves to diverse activities, Vāseṭṭha, the term 'Vessa, Vessa' arose. Thus, Vāseṭṭha, this is how the designation of the Vessa group came into being through that ancient, original term, applicable to those very beings, similar ones and not dissimilar, by means of Dhamma and not by means of Adhamma. For, Vāseṭṭha, Dhamma is the best thing for people, both in this visible life and in the life to come.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඒ සත්ත්වයන් අතුරෙන් ඇතැම් සත්ත්වයෝ මෛථුන ධර්මයෙහි යෙදී විසූක කර්මාන්තයන්හි නිරත වූහ. වාසෙට්ඨයෙනි, මෛථුන ධර්මයෙහි යෙදී විසූක කර්මාන්තයන්හි නිරත වන බැවින් ‘වෙස්සා, වෙස්සා’ යන වචනය උපනින්දිත විය. වාසෙට්ඨයෙනි, මෙසේ ඒ වෛශ්‍ය මණ්ඩලයට ඒ පුරාණ අග්ගඤ්ඤ අක්ෂරයෙන් භවයක් විය, අන්‍යයන්ට නොව ඒ සදිසි සත්ත්වයන්ටම විය, අසදිසි සත්ත්වයන්ට නොව, ධර්මයෙන්ම මිස අධර්මයෙන් නොවේ. වාසෙට්ඨයෙනි, මෙලොවද පරලොවද ධර්මයම ජනිත කරන්නවුන් අතර ශ්‍රේෂ්ඨ වන්නේය.",
      "paliTitle": "Vessamaṇḍalaṃ",
      "englishTitle": "Vessavaṇa's Assembly",
      "sinhalaTitle": "වෙස්සවණ මණ්ඩලය"
    },
    {
      "number": 134,
      "pali": "‘‘Tesaññeva kho, vāseṭṭha, sattānaṃ ye te sattā avasesā te luddācārā khuddācārā ahesuṃ. Luddācārā khuddācārāti kho, vāseṭṭha, ‘suddā, suddā’ tveva akkharaṃ upanibbattaṃ. Iti kho, vāseṭṭha, evametassa suddamaṇḍalassa porāṇena aggaññena akkharena abhinibbatti ahosi tesaṃyeva sattānaṃ anaññesaṃ, sadisānaṃyeva no asadisānaṃ, dhammeneva, no adhammena. Dhammo hi, vāseṭṭha, seṭṭho janetasmiṃ diṭṭhe ceva dhamme abhisamparāyañca.",
      "english": "\"Indeed, Vāseṭṭha, those beings who were left, those beings became cruel in conduct and coarse in conduct. Because of cruel conduct and coarse conduct, Vāseṭṭha, the word ‘suddā, suddā’ simply arose. Thus, Vāseṭṭha, in this way, this designation of ‘sudda’ came into being through an ancient term of highest knowledge, referring to those very beings, not others, to similar beings, not dissimilar, through Dhamma, not through Adhamma. For, Vāseṭṭha, Dhamma is the best thing for people in this present life and in the life to come.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ඒ සත්ත්වයන් අතුරින් යම් සත්ත්ව කොට්ඨාසයක් ඉතිරි වූවාහු ද, ඒ සත්ත්වයෝ රළු හැසිරීම් ඇති, පහත් හැසිරීම් ඇති වූහ. වාසෙට්ඨයෙනි, රළු හැසිරීම් ඇති, පහත් හැසිරීම් ඇති යන අර්ථයෙන් ‘සුද්ද, සුද්ද’ යන වචනය උපනිර්මාණය විය. වාසෙට්ඨයෙනි, මෙසේ ඒ ශුද්‍ර මණ්ඩලයේ පැරණි අග්ගඤ්ඤ අක්‍ෂරයෙන් හටගැනීම වූයේ ඒ සත්ත්වයන්ගේ ම ය, අන්‍යයන්ගේ නො වේ. සමානයන්ගේ ම ය, අසමානයන්ගේ නො වේ. ධර්මය හේතුකොටගෙන ම ය, අධර්මය හේතුකොටගෙන නො වේ. වාසෙට්ඨයෙනි, ධර්මය මේ ජනනයෙහි ශ්‍රේෂ්ඨ ය, දෘෂ්ට වූ ධර්මයෙහි ද, මරණින් මතු භවයෙහි ද ශ්‍රේෂ්ඨ ය.’’",
      "paliTitle": "Suddamaṇḍalaṃ",
      "englishTitle": "The Pure Mandala",
      "sinhalaTitle": "සුද්‍ධ මණ්‍ඩලය"
    },
    {
      "number": 135,
      "pali": "‘‘Ahu kho so, vāseṭṭha, samayo, yaṃ khattiyopi sakaṃ dhammaṃ garahamāno agārasmā anagāriyaṃ pabbajati – ‘samaṇo bhavissāmī’ti. Brāhmaṇopi kho, vāseṭṭha…pe… vessopi kho, vāseṭṭha…pe… suddopi kho, vāseṭṭha, sakaṃ dhammaṃ garahamāno agārasmā anagāriyaṃ pabbajati – ‘samaṇo bhavissāmī’ti. Imehi kho, vāseṭṭha, catūhi maṇḍalehi samaṇamaṇḍalassa abhinibbatti ahosi, tesaṃyeva sattānaṃ anaññesaṃ, sadisānaṃyeva no asadisānaṃ, dhammeneva no adhammena. Dhammo hi, vāseṭṭha, seṭṭho janetasmiṃ diṭṭhe ceva dhamme abhisamparāyañca.",
      "english": "\"There was a time, Vāseṭṭha, when even a noble, criticizing his own duty, would go forth from the house to homelessness, thinking, ‘I will become a renunciant.’ Even a Brahmin, Vāseṭṭha… Even a merchant, Vāseṭṭha… Even a worker, Vāseṭṭha, criticizing his own duty, would go forth from the house to homelessness, thinking, ‘I will become a renunciant.’ From these four groups, Vāseṭṭha, there came about the formation of the group of renunciants, from those very beings and no others, from similar beings and not dissimilar, by means of the Dhamma and not by means of non-Dhamma. For the Dhamma, Vāseṭṭha, is the best thing for people in this visible life and in the life to come.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, යම් කලෙක ක්ෂත්‍රියයෙක් තමාගේ ධර්මය හෙළා ගෙයින් නික්ම අනගාරික ජීවිතයකට පැමිණ ‘මම ශ්‍රමණ වන්නෙමි’යි සිතුවේ ද, එ කලෙක් විය. වාසෙට්ඨයෙනි, බ්‍රාහ්මණයෙක් ද...වාසෙට්ඨයෙනි, වෛශ්‍යයෙක් ද...වාසෙට්ඨයෙනි, ශුද්‍රයෙක් ද තමාගේ ධර්මය හෙළා ගෙයින් නික්ම අනගාරික ජීවිතයකට පැමිණ ‘මම ශ්‍රමණ වන්නෙමි’යි සිතුවේ ද, එ කලෙක් විය. වාසෙට්ඨයෙනි, මේ සතර මණ්ඩලයන්ගෙන් ශ්‍රමණ මණ්ඩලය උපත ලැබුවේ ඔවුන්ගේ ම වූ සත්වයන්ගෙන් මිස අන්‍යයන්ගෙන් නොවේ. සමාන වූවන්ගෙන් මිස අසමාන වූවන්ගෙන් නොවේ. ධර්මයෙන් මිස අධර්මයෙන් නොවේ. වාසෙට්ඨයෙනි, මේ ජීවිතයේ දී මෙන්ම මරණින් මතු ජීවිතයේ දී ද ධර්මය උතුම් වන්නේ ය.’’",
      "paliTitle": ""
    },
    {
      "number": 136,
      "pali": "‘‘Khattiyopi kho, vāseṭṭha, kāyena duccaritaṃ caritvā vācāya duccaritaṃ caritvā manasā duccaritaṃ caritvā micchādiṭṭhiko micchādiṭṭhikammasamādāno [idaṃ padaṃ sī. ipotthakesu natthi] micchādiṭṭhikammasamādānahetu kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Brāhmaṇopi kho, vāseṭṭha…pe… vessopi kho, vāseṭṭha… suddopi kho, vāseṭṭha… samaṇopi kho, vāseṭṭha, kāyena duccaritaṃ caritvā vācāya duccaritaṃ caritvā manasā duccaritaṃ caritvā micchādiṭṭhiko micchādiṭṭhikammasamādāno micchādiṭṭhikammasamādānahetu kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Khattiyopi kho, vāseṭṭha, kāyena sucaritaṃ caritvā vācāya sucaritaṃ caritvā manasā sucaritaṃ caritvā sammādiṭṭhiko sammādiṭṭhikammasamādāno [idaṃ padaṃ sī. pī. potthakesu natthi] sammādiṭṭhikammasamādānahetu kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Brāhmaṇopi kho, vāseṭṭha…pe… vessopi kho, vāseṭṭha… suddopi kho, vāseṭṭha… samaṇopi kho, vāseṭṭha, kāyena sucaritaṃ caritvā vācāya sucaritaṃ caritvā manasā sucaritaṃ caritvā sammādiṭṭhiko sammādiṭṭhikammasamādāno sammādiṭṭhikammasamādānahetu kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati.",
      "english": "\"A noble, Vāseṭṭha, having conducted himself wrongly by body, having conducted himself wrongly by speech, having conducted himself wrongly by mind, holding wrong view, undertaking actions based on wrong view, because of undertaking actions based on wrong view, on the dissolution of the body, after death, is reborn in a state of misery, a bad destination, the lower realms, hell. A Brahmin, Vāseṭṭha… A merchant, Vāseṭṭha… A worker, Vāseṭṭha… An ascetic, Vāseṭṭha, having conducted himself wrongly by body, having conducted himself wrongly by speech, having conducted himself wrongly by mind, holding wrong view, undertaking actions based on wrong view, because of undertaking actions based on wrong view, on the dissolution of the body, after death, is reborn in a state of misery, a bad destination, the lower realms, hell.\n\n\"A noble, Vāseṭṭha, having conducted himself rightly by body, having conducted himself rightly by speech, having conducted himself rightly by mind, holding right view, undertaking actions based on right view, because of undertaking actions based on right view, on the dissolution of the body, after death, is reborn in a good destination, a heavenly world. A Brahmin, Vāseṭṭha… A merchant, Vāseṭṭha… A worker, Vāseṭṭha… An ascetic, Vāseṭṭha, having conducted himself rightly by body, having conducted himself rightly by speech, having conducted himself rightly by mind, holding right view, undertaking actions based on right view, because of undertaking actions based on right view, on the dissolution of the body, after death, is reborn in a good destination, a heavenly world.\"",
      "sinhala": "වාසෙට්‌ඨයෙනි, ක්ෂත්‍රියයෙක් වුවද කයින් දුශ්චරිතයෙහි හැසිර, වචනයෙන් දුශ්චරිතයෙහි හැසිර, සිතින් දුශ්චරිතයෙහි හැසිර, මිථ්‍යාදෘෂ්ටික වී, මිථ්‍යාදෘෂ්ටික කර්ම සමාදන්ව, මිථ්‍යාදෘෂ්ටික කර්ම සමාදානය හේතු කොට ගෙන කය බිඳීමෙන් මරණින් මතු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට පැමිණෙයි. වාසෙට්‌ඨයෙනි, බ්‍රාහ්මණයෙක් වුවද... වාසෙට්‌ඨයෙනි, වෛශ්‍යයෙක් වුවද... ශුද්‍රයෙක් වුවද... වාසෙට්‌ඨයෙනි, ශ්‍ර‍මණ‍යෙක් වුවද කයින් දුශ්චරිතයෙහි හැසිර, වචනයෙන් දුශ්චරිතයෙහි හැසිර, සිතින් දුශ්චරිතයෙහි හැසිර, මිථ්‍යාදෘෂ්ටික වී, මිථ්‍යාදෘෂ්ටික කර්ම සමාදන්ව, මිථ්‍යාදෘෂ්ටික කර්ම සමාදානය හේතු කොට ගෙන කය බිඳීමෙන් මරණින් මතු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට පැමිණෙයි.\n\nවාසෙට්‌ඨයෙනි, ක්ෂත්‍රියයෙක් වුවද කයින් සුචරිතයෙහි හැසිර, වචනයෙන් සුචරිතයෙහි හැසිර, සිතින් සුචරිතයෙහි හැසිර, සම්මාදෘෂ්ටික වී, සම්මාදෘෂ්ටික කර්ම සමාදන්ව, සම්මාදෘෂ්ටික කර්ම සමාදානය හේතු කොට ගෙන කය බිඳීමෙන් මරණින් මතු සුගතියට, ස්වර්ගයට, ලෝකයට පැමිණෙයි. වාසෙට්‌ඨයෙනි, බ්‍රාහ්මණයෙක් වුවද... වාසෙට්‌ඨයෙනි, වෛශ්‍යයෙක් වුවද... ශුද්‍රයෙක් වුවද... වාසෙට්‌ඨයෙනි, ශ්‍ර‍මණ‍යෙක් වුවද කයින් සුචරිතයෙහි හැසිර, වචනයෙන් සුචරිතයෙහි හැසිර, සිතින් සුචරිතයෙහි හැසිර, සම්මාදෘෂ්ටික වී, සම්මාදෘෂ්ටික කර්ම සමාදන්ව, සම්මාදෘෂ්ටික කර්ම සමාදානය හේතු කොට ගෙන කය බිඳීමෙන් මරණින් මතු සුගතියට, ස්වර්ගයට, ලෝකයට පැමිණෙයි.",
      "paliTitle": "Duccaritādikathā",
      "englishTitle": "Discourse on Misconduct, etc.",
      "sinhalaTitle": "දුච‍්චරිතාදි කථාව"
    },
    {
      "number": 137,
      "pali": "‘‘Khattiyopi kho, vāseṭṭha, kāyena dvayakārī, vācāya dvayakārī, manasā dvayakārī, vimissadiṭṭhiko vimissadiṭṭhikammasamādāno vimissadiṭṭhikammasamādānahetu [vimissadiṭṭhiko vimissakammasamādāno vimissakammasamādānahetu (syā.), vītimissadiṭṭhiko vītimissadiṭṭhikammasamādānahetu (sī. pī.)] kāyassa bhedā paraṃ maraṇā sukhadukkhappaṭisaṃvedī hoti. Brāhmaṇopi kho, vāseṭṭha …pe… vessopi kho, vāseṭṭha… suddopi kho, vāseṭṭha… samaṇopi kho, vāseṭṭha, kāyena dvayakārī, vācāya dvayakārī, manasā dvayakārī, vimissadiṭṭhiko vimissadiṭṭhikammasamādāno vimissadiṭṭhikammasamādānahetu kāyassa bhedā paraṃ maraṇā sukhadukkhappaṭisaṃvedī hoti. ",
      "english": "\"A noble, Vāseṭṭha, can be one who acts with duality in body, speech, and mind, one who holds mixed views, undertakes actions based on mixed views, and because of undertaking actions based on mixed views, upon the dissolution of the body after death, experiences both pleasure and pain. A Brahmin, Vāseṭṭha, likewise... A merchant, Vāseṭṭha, likewise... A worker, Vāseṭṭha, likewise... A renunciate, Vāseṭṭha, can be one who acts with duality in body, speech, and mind, one who holds mixed views, undertakes actions based on mixed views, and because of undertaking actions based on mixed views, upon the dissolution of the body after death, experiences both pleasure and pain.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ක්ෂත්‍රියයෙක් වුවද කයින් දෙයාකාර ක්‍රියා කරන්නෙක් වෙයි, වචනයෙන් දෙයාකාර ක්‍රියා කරන්නෙක් වෙයි, සිතින් දෙයාකාර ක්‍රියා කරන්නෙක් වෙයි, මිශ්‍ර දෘෂ්ටි ඇත්තේ මිශ්‍ර කර්ම සමාදානය ඇත්තේ මිශ්‍ර කර්ම සමාදානය හේතුකොට ගෙන කය බිඳීමෙන් මරණින් මතු සැප දුක් විඳින්නෙක් වෙයි. වාසෙට්ඨයෙනි, බ්‍රාහ්මණයෙක් වුවද ...පෙ.... වාසෙට්ඨයෙනි, වෛශ්‍යයෙක් වුවද... ශුද්‍රයෙක් වුවද... වාසෙට්ඨයෙනි, ශ්‍රමණයා වුවද කයින් දෙයාකාර ක්‍රියා කරන්නෙක් වෙයි, වචනයෙන් දෙයාකාර ක්‍රියා කරන්නෙක් වෙයි, සිතින් දෙයාකාර ක්‍රියා කරන්නෙක් වෙයි, මිශ්‍ර දෘෂ්ටි ඇත්තේ මිශ්‍ර කර්ම සමාදානය ඇත්තේ මිශ්‍ර කර්ම සමාදානය හේතුකොට ගෙන කය බිඳීමෙන් මරණින් මතු සැප දුක් විඳින්නෙක් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 138,
      "pali": "‘‘Khattiyopi kho, vāseṭṭha, kāyena saṃvuto vācāya saṃvuto manasā saṃvuto sattannaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanamanvāya diṭṭheva dhamme parinibbāyati [parinibbāti (ka.)]. Brāhmaṇopi kho, vāseṭṭha…pe… vessopi kho vāseṭṭha… suddopi kho, vāseṭṭha … samaṇopi kho, vāseṭṭha, kāyena saṃvuto vācāya saṃvuto manasā saṃvuto sattannaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanamanvāya diṭṭheva dhamme parinibbāyati.",
      "english": "\"Indeed, Vāseṭṭha, even a noble can attain final liberation in this very life by being restrained in body, restrained in speech, restrained in mind, and by practicing the development of the seven factors of enlightenment. Indeed, Vāseṭṭha, even a brahmin… Indeed, Vāseṭṭha, even a merchant… Indeed, Vāseṭṭha, even a worker… Indeed, Vāseṭṭha, even a renunciate can attain final liberation in this very life by being restrained in body, restrained in speech, restrained in mind, and by practicing the development of the seven factors of enlightenment.\"",
      "sinhala": "‘‘වාසෙට්ඨයෙනි, ක්ෂත්‍රියයෙක් වුව ද කයින් සංවර වී, වචනයෙන් සංවර වී, මනසින් සංවර වී, සප්ත බොධිපාක්ෂික ධර්මයන් වැඩීමෙහි යෙදී මේ ජීවිතයේ දී ම පිරිනිවන් පායි. වාසෙට්ඨයෙනි, බ්‍රාහ්මණයෙක් වුව ද… වාසෙට්ඨයෙනි, වෛශ්‍යයෙක් වුව ද… වාසෙට්ඨයෙනි, ශුද්‍රයෙක් වුව ද… වාසෙට්ඨයෙනි, ශ්‍රමණවයෙක් වුව ද කයින් සංවර වී, වචනයෙන් සංවර වී, මනසින් සංවර වී, සප්ත බොධිපාක්ෂික ධර්මයන් වැඩීමෙහි යෙදී මේ ජීවිතයේ දී ම පිරිනිවන් පායි.",
      "paliTitle": "Bodhipakkhiyabhāvanā",
      "englishTitle": "Cultivation of the Factors of Enlightenment",
      "sinhalaTitle": "බෝධිපක්ඛිය භාවනාව"
    },
    {
      "number": 139,
      "pali": "‘‘Imesañhi, vāseṭṭha, catunnaṃ vaṇṇānaṃ yo hoti bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto so nesaṃ aggamakkhāyati dhammeneva. No adhammena. Dhammo hi, vāseṭṭha, seṭṭho janetasmiṃ diṭṭhe ceva dhamme abhisamparāyañca.",
      "english": "\"For these four classes, Vāseṭṭha, the bhikkhu who is an Arahant, with taints destroyed, who has lived the life, done what was to be done, laid down the burden, attained his own welfare, completely destroyed the fetters of becoming, and is liberated by perfect knowledge, is declared the best of them by Dhamma, not by what is not-Dhamma. For the Dhamma, Vāseṭṭha, is the best in this world and in the world beyond.\"",
      "sinhala": "වාසෙට්ඨයෙනි, මේ සතර වර්ණයන් අතුරෙන් යම් භික්ෂුවක් අර්හත් වී ක්ෂීණාශ්‍රව වී, වාසය කළාවූ, කළයුතු කටයුතු කළාවූ, බහා තැබූ භාර ඇති, අනුප්‍රාප්ත ස්වකීය අර්ථ ඇති, ක්ෂය කළ භව සංයෝජන ඇති, මනා නුවණින් විමුක්ත වූයේ නම්, හේ ඔවුන්ට ධර්මය අනුව අග්‍ර වන්නේ ය. අධර්මයෙන් නො වේ. වාසෙට්ඨයෙනි, මේ දැක්ක ධර්මයෙහි ද මරණින් මතු භවයෙහි ද ධර්මය ශ්‍රේෂ්ඨ වන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 140,
      "pali": "‘‘Brahmunā pesā, vāseṭṭha, sanaṅkumārena gāthā bhāsitā – ‘Khattiyo seṭṭho janetasmiṃ, ye gottapaṭisārino; Vijjācaraṇasampanno, so seṭṭho devamānuse’ti. ‘‘Sā kho panesā, vāseṭṭha, brahmunā sanaṅkumārena gāthā sugītā, no duggītā. Subhāsitā, no dubbhāsitā. Atthasaṃhitā, no anatthasaṃhitā. Anumatā mayā. Ahampi, vāseṭṭha, evaṃ vadāmi – ‘Khattiyo seṭṭho janetasmiṃ, ye gottapaṭisārino; Vijjācaraṇasampanno, so seṭṭho devamānuse’ti. Idamavoca bhagavā. Attamanā vāseṭṭhabhāradvājā bhagavato bhāsitaṃ abhinandunti.",
      "english": "\"Vāseṭṭha, this verse was spoken by Sanankumāra in the Brahma world: 'Among people, the noble is best for those who cling to lineage; but he who is perfect in knowledge and conduct is best among gods and humans.'\n\n\"And indeed, Vāseṭṭha, that verse was well-sung by Sanankumāra in the Brahma world, not badly sung; well-spoken, not badly spoken; connected with the goal, not unconnected with the goal. It is approved by me. I too, Vāseṭṭha, say thus: 'Among people, the noble is best for those who cling to lineage; but he who is perfect in knowledge and conduct is best among gods and humans.' \"\n\nThis is what the Blessed One said. Vāseṭṭha and Bhāradvāja were pleased and delighted in the Blessed One's words.",
      "sinhala": "‘‘වාශෙට්ඨයෙනි, සනංකුමාර නම් බ්‍රහ්මයා විසින් ගාථාවක් මෙසේ පවසන ලදී – ‘යම් ගෝත්‍රයක් පිළිසරණ කොට ඇත්තෝ වෙත් ද, ඒ ජනයා අතරෙහි ක්ෂත්‍රිය වංශිකයා ශ්‍රේෂ්ඨ ය; විද්‍යාචරණයන්ගෙන් සම්පන්න වූ තැනැත්තේ දෙවියන් හා මිනිසුන් අතරෙහි ශ්‍රේෂ්ඨ වෙයි’ කියා ය.\n\nවාශෙට්ඨයෙනි, සනංකුමාර බ්‍රහ්මයා විසින් ගායනා කරන ලද ඒ ගාථාව මනාව ගායනා කරන ලද්දේ ය, නරක ලෙස ගායනා කරන ලද්දේ නො වේ. මනා වචනයෙන් යුක්ත ය, නරක වචනයෙන් යුක්ත නො වේ. අර්ථයෙන් යුක්ත ය, අනර්ථයෙන් යුක්ත නො වේ. එය මා විසින් අනුමත කරන ලදී. වාශෙට්ඨයෙනි, මම ද මෙසේ කියමි – ‘යම් ගෝත්‍රයක් පිළිසරණ කොට ඇත්තෝ වෙත් ද, ඒ ජනයා අතරෙහි ක්ෂත්‍රිය වංශිකයා ශ්‍රේෂ්ඨ ය; විද්‍යාචරණයන්ගෙන් සම්පන්න වූ තැනැත්තේ දෙවියන් හා මිනිසුන් අතරෙහි ශ්‍රේෂ්ඨ වෙයි’ කියා ය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති වාශෙට්ඨ සහ භාරද්වාජ යන දෙදෙනා භාග්‍යවතුන් වහන්සේගේ භාෂිතය සතුටින් පිළිගත්තාහු ය.’’",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Aggaññasuttaṃ niṭṭhitaṃ catutthaṃ",
    "english": "Aggañña Sutta Concluded, Fourth",
    "sinhala": "සිව්වන අග්ගඤ්ඤ සූත‍්‍රය නිමි."
  }
}