{
  "id": "dn5",
  "title": {
    "pali": "Sampasādanīyasuttaṃ",
    "english": "The Sampasādanīya Discourse",
    "sinhala": "සම්පසාදනීය සූත්‍රය"
  },
  "sections": [
    {
      "number": 141,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā nāḷandāyaṃ viharati pāvārikambavane. Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā sāriputto bhagavantaṃ etadavoca – ‘‘evaṃpasanno ahaṃ, bhante, bhagavati, na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṃ sambodhiya’’nti.",
      "english": "Thus have I heard: At one time the Blessed One was living at Nāḷandā in Pāvārika's mango grove. Then venerable Sāriputta approached the Blessed One; having approached and respectfully greeted the Blessed One, he sat down to one side. Seated to one side, venerable Sāriputta said this to the Blessed One: \"So confident am I, venerable sir, in the Blessed One, that I think there never has been, nor will there be, nor is there at present, any other ascetic or brahmin more deeply enlightened than the Blessed One with regard to perfect enlightenment.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී: එක් කලෙක භාග්‍යවතුන් වහන්සේ නාලන්දාවේ පාවාරික අඹ වනයේ වැඩ වාසය කරන සේක. එකල්හි ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පස්ව හුන්හ. එකත්පස්ව හුන් ආයුෂ්මත් සැරියුත් තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ කෙරෙහි මෙසේ පැහැදී සිටිමි. එනම්, සම්බෝධිය සම්බන්ධයෙන් භාග්‍යවතුන් වහන්සේට වඩා උසස් වූ වෙනත් ශ්‍රමණ හෝ බ්‍රාහ්මණ කෙනෙක් අතීතයේ සිටියේ නැත, අනාගතයේ සිටින්නේද නැත, වර්තමානයේ සිටින්නේද නැත” යි.",
      "paliTitle": "Sāriputtasīhanādo",
      "englishTitle": "Sāriputta's Lion's Roar",
      "sinhalaTitle": "සාරිපුත්ත සිංහනාදය"
    },
    {
      "number": 142,
      "pali": "‘‘Uḷārā kho te ayaṃ, sāriputta, āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati; na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṃ sambodhiya’nti. Kiṃ te [kiṃ nu (sī. pī.), kiṃ nu kho te (syā.)], sāriputta, ye te ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā – ‘evaṃsīlā te bhagavanto ahesuṃ itipi, evaṃdhammā te bhagavanto ahesuṃ itipi, evaṃpaññā te bhagavanto ahesuṃ itipi, evaṃvihārī te bhagavanto ahesuṃ itipi, evaṃvimuttā te bhagavanto ahesuṃ itipī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Kiṃ pana te [kiṃ pana (sī. pī.)], sāriputta, ye te bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto cetasā ceto paricca viditā, `evaṃsīlā te bhagavanto bhavissanti itipi, evaṃdhammā…pe… evaṃpaññā… evaṃvihārī… evaṃvimuttā te bhagavanto bhavissanti itipī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Kiṃ pana te [kiṃ pana (sī. pī.)], sāriputta, ahaṃ etarahi arahaṃ sammāsambuddho cetasā ceto paricca vidito – ‘evaṃsīlo bhagavā itipi, evaṃdhammo…pe… evaṃpañño … evaṃvihārī… evaṃvimutto bhagavā itipī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Ettha ca hi te, sāriputta, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ natthi. Atha kiṃ carahi te ayaṃ, sāriputta, uḷārā āsabhī vācā bhāsitā, ekaṃso gahito, sīhanādo nadito – ‘evaṃpasanno ahaṃ, bhante, bhagavati, na cāhu na ca bhavissati na cetarahi vijjati añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro yadidaṃ sambodhiya’’’nti?",
      "english": "\"Sāriputta, this is indeed a grand, authoritative statement that you have made, a definitive assertion, a lion's roar: ‘I am so confident in the Blessed One, that neither has there been, nor will there be, nor is there now any other ascetic or brahmin more accomplished in higher wisdom than the Blessed One.’ But Sāriputta, do you know with your own mind the minds of all those Blessed Ones, accomplished ones, fully enlightened ones who existed in the past, knowing: ‘Those Blessed Ones were of such virtue; those Blessed Ones were of such a nature; those Blessed Ones were of such wisdom; those Blessed Ones lived with such a dwelling; those Blessed Ones were liberated in such a way’?\" \"No, venerable sir.\" \"Then Sāriputta, do you know with your own mind the minds of all those Blessed Ones, accomplished ones, fully enlightened ones who will exist in the future, knowing: ‘Those Blessed Ones will be of such virtue; those Blessed Ones will be of such a nature… those Blessed Ones will be of such wisdom… those Blessed Ones will live with such a dwelling… those Blessed Ones will be liberated in such a way’?\" \"No, venerable sir.\" \"Then Sāriputta, do you know me, the accomplished one, the fully enlightened one, here and now, with your own mind, knowing: ‘The Blessed One is of such virtue; the Blessed One is of such a nature… the Blessed One is of such wisdom… the Blessed One lives with such a dwelling… the Blessed One is liberated in such a way’?\" \"No, venerable sir.\" \"But Sāriputta, you have no knowledge of the minds of the accomplished ones, fully enlightened ones, past, future, and present. So in what way, Sāriputta, is this grand, authoritative statement made by you, this definitive assertion, this lion's roar: ‘I am so confident in the Blessed One, that neither has there been, nor will there be, nor is there now any other ascetic or brahmin more accomplished in higher wisdom than the Blessed One’?\"",
      "sinhala": "‘‘සාරිපුත්තය, ඔබ විසින් කියන ලද මේ වචනය උත්කෘෂ්ටයි, ආසභීයයි, ඒකාංශයෙන් ගත්තා වූ සිංහනාදයකි. ‘ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ කෙරෙහි මෙසේ පැහැදී සිටිමි. සම්බෝධිය සම්බන්ධයෙන් භාග්‍යවතුන් වහන්සේට වඩා උසස් වූ වෙනත් ශ්‍රමණ බ්‍රාහ්මණයෙක් අතීතයේ සිටියේ ද නැත, අනාගතයේ සිටින්නේද නැත, දැන් සිටින්නේද නැත’ යනුවෙනි. සාරිපුත්තය, යම් අතීත කාලයක අර්හත් සම්මා සම්බුදුවරු සිටියා නම්, ඒ භාග්‍යවතුන් වහන්සේලා සියල්ලන්ගේම සිත් ඔබගේ සිතින් දැන ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් ශීලයන්ගෙන් යුක්ත වූහ, ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් ධර්මයන්ගෙන් යුක්ත වූහ, ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් ප්‍රඥාවන්ගෙන් යුක්ත වූහ, ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් විහරණයන්ගෙන් යුක්ත වූහ, ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් විමුක්තියෙන් යුක්ත වූහ’ යැයි ඔබ දන්නෙහිදැ’’යි විමසූ සේක. ‘‘එසේ නොවෙයි, ස්වාමීනි’’. ‘‘සාරිපුත්තය, යම් අනාගත කාලයක අර්හත් සම්මා සම්බුදුවරුන් වඩිනවා නම්, ඒ භාග්‍යවතුන් වහන්සේලා සියල්ලන්ගේම සිත් ඔබගේ සිතින් දැන ‘ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් ශීලයන්ගෙන් යුක්ත වන සේක්වා, ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් ධර්මයන්ගෙන් යුක්ත වන සේක්වා, ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් ප්‍රඥාවන්ගෙන් යුක්ත වන සේක්වා, ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් විහරණයන්ගෙන් යුක්ත වන සේක්වා, ඒ භාග්‍යවතුන් වහන්සේලා මෙවන් විමුක්තියෙන් යුක්ත වන සේක්වා’ යැයි ඔබ දන්නෙහිදැ’’යි විමසූ සේක. ‘‘එසේ නොවෙයි, ස්වාමීනි’’. ‘‘සාරිපුත්තය, මම දැන් අර්හත් සම්මා සම්බුද්ධ වෙමි. මාගේ සිත ඔබගේ සිතින් දැන ‘භාග්‍යවතුන් වහන්සේ මෙවන් ශීලයකින් යුක්තය, භාග්‍යවතුන් වහන්සේ මෙවන් ධර්මයකින් යුක්තය, භාග්‍යවතුන් වහන්සේ මෙවන් ප්‍රඥාවකින් යුක්තය, භාග්‍යවතුන් වහන්සේ මෙවන් විහරණයකින් යුක්තය, භාග්‍යවතුන් වහන්සේ මෙවන් විමුක්තියකින් යුක්තය’ යැයි ඔබ දන්නෙහිදැ’’යි විමසූ සේක. ‘‘එසේ නොවෙයි, ස්වාමීනි’’. ‘‘සාරිපුත්තය, මෙහිදී ඔබට අතීත, අනාගත, වර්තමාන අර්හත් සම්මා සම්බුදුවරුන් පිළිබඳව පරචිත්ත ඥානයක් නැත. එසේ නම්, සාරිපුත්තය, ‘ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේ කෙරෙහි මෙසේ පැහැදී සිටිමි. සම්බෝධිය සම්බන්ධයෙන් භාග්‍යවතුන් වහන්සේට වඩා උසස් වූ වෙනත් ශ්‍රමණ බ්‍රාහ්මණයෙක් අතීතයේ සිටියේ ද නැත, අනාගතයේ සිටින්නේද නැත, දැන් සිටින්නේද නැත’ යනුවෙන් ඔබ විසින් කියන ලද මේ උත්කෘෂ්ට වූ, ආසභීය වූ ඒකාංශයෙන් ගත්තා වූ සිංහනාදය කෙසේදැ’’යි විමසූ සේක.",
      "paliTitle": ""
    },
    {
      "number": 143,
      "pali": "‘‘Na kho me [na kho panetaṃ (syā. ka.)], bhante, atītānāgatapaccuppannesu arahantesu sammāsambuddhesu cetopariyañāṇaṃ atthi. Api ca, me [me bhante (sī. pī. ka.)] dhammanvayo vidito. Seyyathāpi, bhante, rañño paccantimaṃ nagaraṃ daḷhuddhāpaṃ [daḷhuddāpaṃ (sī. pī. ka.)] daḷhapākāratoraṇaṃ ekadvāraṃ. Tatrassa dovāriko paṇḍito byatto medhāvī aññātānaṃ nivāretā, ñātānaṃ pavesetā. So tassa nagarassa samantā anupariyāyapathaṃ anukkamamāno na passeyya pākārasandhiṃ vā pākāravivaraṃ vā antamaso biḷāranikkhamanamattampi. Tassa evamassa – ‘ye kho keci oḷārikā pāṇā imaṃ nagaraṃ pavisanti vā nikkhamanti vā, sabbe te imināva dvārena pavisanti vā nikkhamanti vā’ti. Evameva kho me, bhante, dhammanvayo vidito. Ye te, bhante, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambujjhiṃsu. Yepi te, bhante, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā, sabbe te bhagavanto pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambujjhissanti. Bhagavāpi, bhante, etarahi arahaṃ sammāsambuddho pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe catūsu satipaṭṭhānesu suppatiṭṭhitacitto satta sambojjhaṅge yathābhūtaṃ bhāvetvā anuttaraṃ sammāsambodhiṃ abhisambuddho.",
      "english": "\"Venerable sir, I do not have the knowledge of reading the minds of all arahants, fully awakened Buddhas, in the past, future, and present. However, venerable sir, the lineage of the Dhamma is known to me. Just as, venerable sir, there might be a royal frontier city, with strong foundations, strong walls, and towers, having one gate. There, a gatekeeper, wise, astute, and intelligent, would keep out those unknown and allow in those known. He, going completely around that city along its encircling path, would not see a crack in the wall or a gap in the wall, not even enough for a cat to slip through. He would think: ‘Whatever large creatures enter this city or leave it, all of them enter or leave through this gate.’ Just so, venerable sir, the lineage of the Dhamma is known to me. Those arahants, fully awakened Buddhas, who existed in the past, all those Blessed Ones, having abandoned the five hindrances, the defilements of the mind that weaken wisdom, with their minds well-established in the four foundations of mindfulness, having truly developed the seven factors of enlightenment, awakened to unsurpassed, complete self-awakening. Those arahants, fully awakened Buddhas, who will exist in the future, all those Blessed Ones, having abandoned the five hindrances, the defilements of the mind that weaken wisdom, with their minds well-established in the four foundations of mindfulness, having truly developed the seven factors of enlightenment, will awaken to unsurpassed, complete self-awakening. And the Blessed One, venerable sir, being now an arahant, a fully awakened Buddha, having abandoned the five hindrances, the defilements of the mind that weaken wisdom, with his mind well-established in the four foundations of mindfulness, having truly developed the seven factors of enlightenment, is awakened to unsurpassed, complete self-awakening.\"",
      "sinhala": "භාග්‍යවතුන් වහන්ස, අතීත, අනාගත හා වර්තමාන අරහත් සම්මා සම්බුදුවරුන් පිළිබඳව මට චිත්ත පරිඥාණයක් නැත. එහෙත්, භාග්‍යවතුන් වහන්ස, මට ධර්මානුගමනය වැටහී ඇත. භාග්‍යවතුන් වහන්ස, යම් සේ බලකොටු සහිත, ශක්තිමත් ප්‍රාකාර හා තොරණ සහිත, එකම ද්වාරයක් ඇති දේශ සීමාවේ පිහිටි රාජධානියක් වේ ද, එහි නුවණැති, දක්ෂ, බුද්ධිමත් දොරටුපාලකයෙක් සිටී. ඔහු නොදන්නා අය වළක්වයි, දන්නා අය ඇතුළු කරයි. ඔහු ඒ නගරය වටා සක්මන් මග අනුක්‍රමයෙන් ගමන් කරමින් ප්‍රාකාරයේ සන්ධියක් හෝ ප්‍රාකාරයේ හිඩැසක්, අවම වශයෙන් බළලෙකුට රිංගා යා හැකි තරම්වත් සිදුරක් නොදකියි. එවිට ඔහුට මෙවැනි අදහසක් ඇති වේ. “යම් තරම් වූ විශාල සත්වයෝ මේ නගරයට ඇතුළු වෙත් ද, පිට වෙත් ද, ඒ සියල්ලෝම මේ දොරටුවෙන්ම ඇතුළු වෙත් ද, පිට වෙත් ද” කියායි. භාග්‍යවතුන් වහන්ස, එලෙසම මට ධර්මානුගමනය වැටහී ඇත. භාග්‍යවතුන් වහන්ස, යම් ඒ අතීත කාලයෙහි වැඩ සිටි අරහත් සම්මා සම්බුදුවරුන් වූ භාග්‍යවතුන් වහන්සේලා, ඒ සියලු භාග්‍යවතුන් වහන්සේලා සිතේ උපක්ලේශයන් වන ප්‍රඥාව දුර්වල කරන පංච නීවරණ ධර්මයන් දුරු කොට, සිව් සතිපට්ඨානයන්හි මනාව පිහිට වූ සිතින් යුක්තව, සප්ත බොජ්ඣංගයන් යථාභූත ඥානයෙන් වැඩීමෙන් අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළහ. භාග්‍යවතුන් වහන්ස, යම් ඒ අනාගත කාලයෙහි පහළ වීමට සිටින අරහත් සම්මා සම්බුදුවරුන් වූ භාග්‍යවතුන් වහන්සේලා, ඒ සියලු භාග්‍යවතුන් වහන්සේලා සිතේ උපක්ලේශයන් වන ප්‍රඥාව දුර්වල කරන පංච නීවරණ ධර්මයන් දුරු කොට, සිව් සතිපට්ඨානයන්හි මනාව පිහිට වූ සිතින් යුක්තව, සප්ත බොජ්ඣංගයන් යථාභූත ඥානයෙන් වැඩීමෙන් අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කරනු ඇත. භාග්‍යවතුන් වහන්ස, මේ භාග්‍යවත් වූ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ ද සිතේ උපක්ලේශයන් වන ප්‍රඥාව දුර්වල කරන පංච නීවරණ ධර්මයන් දුරු කොට, සිව් සතිපට්ඨානයන්හි මනාව පිහිට වූ සිතින් යුක්තව, සප්ත බොජ්ඣංගයන් යථාභූත ඥානයෙන් වැඩීමෙන් අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 144,
      "pali": "‘‘Idhāhaṃ, bhante, yena bhagavā tenupasaṅkamiṃ dhammassavanāya. Tassa me, bhante, bhagavā dhammaṃ deseti uttaruttaraṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ. Yathā yathā me, bhante, bhagavā dhammaṃ desesi uttaruttaraṃ paṇītapaṇītaṃ kaṇhasukkasappaṭibhāgaṃ, tathā tathāhaṃ tasmiṃ dhamme abhiññā idhekaccaṃ dhammaṃ dhammesu niṭṭhamagamaṃ; satthari pasīdiṃ – ‘sammāsambuddho bhagavā, svākkhāto bhagavatā dhammo, suppaṭipanno sāvakasaṅgho’ti. ",
      "english": "\"Here, venerable sir, I approached the Blessed One to listen to the Dhamma. Then, venerable sir, the Blessed One taught me the Dhamma, leading step by step, higher and higher, with contrasting aspects of darkness and light. To the extent that the Blessed One, venerable sir, taught me the Dhamma, leading step by step, higher and higher, with contrasting aspects of darkness and light, to that extent, having directly known this particular Dhamma among these dhammas, I reached the culmination in the Dhamma; I gained confidence in the Teacher, thinking, 'The Blessed One is rightly self-awakened, the Dhamma is well-proclaimed by the Blessed One, the Sangha of disciples is practicing well.'\"",
      "sinhala": "‘‘එම්බා දේවයිනි, මම භාග්‍යවතුන් වහන්සේ වෙත ධර්මය ශ්‍රවණය කිරීම සඳහා ගියෙමි. එම්බා දේවයිනි, භාග්‍යවතුන් වහන්සේ මට ක්‍රමයෙන් උසස් වූ, ක්‍රමයෙන් ප්‍රණීත වූ, කෘෂ්ණ ශුක්ල ප්‍රතිභාග සහිත ධර්මය දේශනා කළ සේක. එම්බා දේවයිනි, භාග්‍යවතුන් වහන්සේ මට ක්‍රමයෙන් උසස් වූ, ක්‍රමයෙන් ප්‍රණීත වූ, කෘෂ්ණ ශුක්ල ප්‍රතිභාග සහිත යම් සේ ධර්මය දේශනා කළ සේක් ද, එලෙසින් එලෙසින් මම ඒ ධර්මයෙහි විශේෂඥානයෙන් යුක්තව මෙලොව ඇතැම් ධර්මයන් කෙරෙහි ධර්මයන්හි නිශ්ඨාවට පැමිණියෙමි. ‘භාග්‍යවතුන් වහන්සේ සම්මා සම්බුද්ධය, භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනාව දේශනා කරන ලද්දේ ය, ශ්‍රාවක සංඝයා මනාව පිළිපන්නාහු ය’යි ශාස්තෘන් වහන්සේ කෙරෙහි පැහැදුණෙමි.",
      "paliTitle": ""
    },
    {
      "number": 145,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti kusalesu dhammesu. Tatrime kusalā dhammā seyyathidaṃ, cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo. Idha, bhante, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Etadānuttariyaṃ, bhante, kusalesu dhammesu. Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa, yadidaṃ kusalesu dhammesu. ",
      "english": "\"Furthermore, venerable sir, this is the unsurpassed, that the Blessed One teaches the Dhamma concerning skillful qualities. Here are these skillful qualities, namely: the four foundations of mindfulness, the four right exertions, the four bases of power, the five faculties, the five strengths, the seven factors of enlightenment, and the Noble Eightfold Path. Here, venerable sir, a bhikkhu, through the destruction of the taints, having realized here and now with his own insight the taintless liberation of mind, liberation by wisdom, dwells having attained it. This, venerable sir, is the unsurpassed among skillful qualities. The Blessed One knows that completely, and there is nothing further to be known by the Blessed One who knows that completely, such that another ascetic or brahmin might be more knowledgeable than the Blessed One, with regard to these skillful qualities.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කුසල ධර්මයන්හි දේශනා කරන ධර්මය අනුත්තරීය වේ. එනම්, මේ කුසල ධර්මයන් වෙත්: සතර සතිපට්ඨානයන්, සතර සම්මප්පධාන වීර්යයන්, සතර ඉර්ධිපාදයන්, පඤ්ච ඉන්ද්‍රියන්, පඤ්ච බලයන්, සප්ත බොජ්ඣංගයන්, ආර්ය අෂ්ටාංගික මාර්ගය යනුයි.\n\nස්වාමීනි, මෙහි භික්ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චිත්ත විමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්ම භාවයෙහිම තමා විසින්ම විශේෂ දැනුමෙන් දැන සාක්ෂාත් කොට උපසම්පදා ලබා වාසය කරයි. ස්වාමීනි, කුසල ධර්මයන්හි මෙය අනුත්තරීය වේ. භාග්‍යවතුන් වහන්සේ එය සියල්ල දන්නා සේක. භාග්‍යවතුන් වහන්සේ එය සියල්ල දන්නා බැවින් එයට වඩා උසස්ව දත යුත්තක් නැත. කුසල ධර්මයන්හි යම් දැනීමක් භාග්‍යවතුන් වහන්සේට වඩා වෙනත් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට අධික ලෙස දැනගත හැකි වේ නම් එය එසේ නොවේ.",
      "paliTitle": "Kusaladhammadesanā",
      "englishTitle": "Discourse on Wholesome Dhamma",
      "sinhalaTitle": "කුසල ධ​ර්ම දේශනා"
    },
    {
      "number": 146,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti āyatanapaṇṇattīsu. Chayimāni, bhante, ajjhattikabāhirāni āyatanāni. Cakkhuñceva rūpā [rūpāni (ka.)] ca, sotañceva saddā ca, ghānañceva gandhā ca, jivhā ceva rasā ca, kāyo ceva phoṭṭhabbā ca, mano ceva dhammā ca. Etadānuttariyaṃ, bhante, āyatanapaṇṇattīsu. Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa yadidaṃ āyatanapaṇṇattīsu. ",
      "english": "\"Furthermore, venerable sir, this is unsurpassed, as the Blessed One teaches the exposition of the sense bases. These six internal and external sense bases exist. Namely, the eye and forms, the ear and sounds, the nose and odors, the tongue and tastes, the body and tactile objects, and the mind and mental objects. This, venerable sir, is unsurpassed in the exposition of the sense bases. The Blessed One knows it completely, and there is no further knowledge beyond that complete knowledge of the Blessed One, knowing which another ascetic or brahmin could be more knowledgeable than the Blessed One, namely in this exposition of the sense bases.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ ආයතන ප‍්‍රඥප්තීන්හි යම් ධර්මයක් දේශනා කරන සේක් නම්, එය අනූත්තරීය වේ. ස්වාමීනි, මේ අභ්‍යන්තර හා බාහිර ආයතන සයකි. එනම් ඇස හා රූපයෝද, කණ හා ශබ්දයෝද, නාසය හා ගන්ධයෝද, දිව හා රසයෝද, කය හා ස්පර්ශයෝද, මන හා ධර්මයෝද වෙති. ස්වාමීනි, ආයතන ප‍්‍රඥප්තීන්හි මෙය අනූත්තරීය වේ. භාග්‍යවතුන් වහන්සේ එය මුළුමනින්ම දන්නා සේක. භාග්‍යවතුන් වහන්සේ එය මුළුමනින්ම දන්නා බැවින්, ආයතන ප‍්‍රඥප්තීන්හි භාග්‍යවතුන් වහන්සේට වඩා යම් ශ‍්‍රමණෙකුට හෝ බ‍්‍රාහ්මණයෙකුට වැඩිපුර දැනගත හැකි දෙයක් නැත්තේය.",
      "paliTitle": "Āyatanapaṇṇattidesanā",
      "englishTitle": "Explanation of Sense-base Designations",
      "sinhalaTitle": "ආයතන පඤ්ඤත්ති දේශනා"
    },
    {
      "number": 147,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti gabbhāvakkantīsu. Catasso imā, bhante, gabbhāvakkantiyo. Idha, bhante, ekacco asampajāno mātukucchiṃ okkamati; asampajāno mātukucchismiṃ ṭhāti; asampajāno mātukucchimhā nikkhamati. Ayaṃ paṭhamā gabbhāvakkanti. ‘‘Puna caparaṃ, bhante, idhekacco sampajāno mātukucchiṃ okkamati; asampajāno mātukucchismiṃ ṭhāti; asampajāno mātukucchimhā nikkhamati. Ayaṃ dutiyā gabbhāvakkanti. ‘‘Puna caparaṃ, bhante, idhekacco sampajāno mātukucchiṃ okkamati; sampajāno mātukucchismiṃ ṭhāti; asampajāno mātukucchimhā nikkhamati. Ayaṃ tatiyā gabbhāvakkanti. ‘‘Puna caparaṃ, bhante, idhekacco sampajāno mātukucchiṃ okkamati; sampajāno mātukucchismiṃ ṭhāti; sampajāno mātukucchimhā nikkhamati. Ayaṃ catutthā gabbhāvakkanti. Etadānuttariyaṃ, bhante, gabbhāvakkantīsu. ",
      "english": "\"Furthermore, venerable sir, this is unsurpassed, as the Blessed One teaches the descents into the womb. These are the four descents into the womb, venerable sir. Here, venerable sir, some person descends into the mother's womb without awareness; remains in the mother's womb without awareness; emerges from the mother's womb without awareness. This is the first descent into the womb.\n\n\"Again, venerable sir, some person descends into the mother's womb with awareness; remains in the mother's womb without awareness; emerges from the mother's womb without awareness. This is the second descent into the womb.\n\n\"Again, venerable sir, some person descends into the mother's womb with awareness; remains in the mother's womb with awareness; emerges from the mother's womb without awareness. This is the third descent into the womb.\n\n\"Again, venerable sir, some person descends into the mother's womb with awareness; remains in the mother's womb with awareness; emerges from the mother's womb with awareness. This is the fourth descent into the womb. This is unsurpassed, venerable sir, among descents into the womb.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ ගර්භාෂයකට ඇතුළුවීම් ගැන දේශනා කරන ආකාරය අනුත්තරීය වේ. ස්වාමීනි, මේ ගර්භාෂයකට ඇතුළුවීම් සතරකි. ස්වාමීනි, මෙහි ඇතැමෙක් සිහියෙන් තොරව මවගේ කුසට ඇතුළු වෙයි; සිහියෙන් තොරව මවගේ කුසෙහි සිටියි; සිහියෙන් තොරව මවගේ කුසෙන් නික්මෙයි. මෙය පළමුවන ගර්භාෂයකට ඇතුළුවීමයි.\n\n‘‘නැවතද, ස්වාමීනි, මෙහි ඇතැමෙක් සිහියෙන් යුතුව මවගේ කුසට ඇතුළු වෙයි; සිහියෙන් තොරව මවගේ කුසෙහි සිටියි; සිහියෙන් තොරව මවගේ කුසෙන් නික්මෙයි. මෙය දෙවන ගර්භාෂයකට ඇතුළුවීමයි.\n\n‘‘නැවතද, ස්වාමීනි, මෙහි ඇතැමෙක් සිහියෙන් යුතුව මවගේ කුසට ඇතුළු වෙයි; සිහියෙන් යුතුව මවගේ කුසෙහි සිටියි; සිහියෙන් තොරව මවගේ කුසෙන් නික්මෙයි. මෙය තුන්වන ගර්භාෂයකට ඇතුළුවීමයි.\n\n‘‘නැවතද, ස්වාමීනි, මෙහි ඇතැමෙක් සිහියෙන් යුතුව මවගේ කුසට ඇතුළු වෙයි; සිහියෙන් යුතුව මවගේ කුසෙහි සිටියි; සිහියෙන් යුතුව මවගේ කුසෙන් නික්මෙයි. මෙය සතරවන ගර්භාෂයකට ඇතුළුවීමයි. ස්වාමීනි, ගර්භාෂයකට ඇතුළුවීම් අතර මෙය අනුත්තරීය වේ.",
      "paliTitle": "Gabbhāvakkantidesanā",
      "englishTitle": "Discourse on Conception",
      "sinhalaTitle": "ගර\\u200D්භාවක\\u200D්‍රාන\\u200D්ති දේශනා"
    },
    {
      "number": 148,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti ādesanavidhāsu. Catasso imā, bhante, ādesanavidhā. Idha, bhante, ekacco nimittena ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ paṭhamā ādesanavidhā. ‘‘Puna caparaṃ, bhante, idhekacco na heva kho nimittena ādisati. Api ca kho manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ dutiyā ādesanavidhā. ‘‘Puna caparaṃ, bhante, idhekacco na heva kho nimittena ādisati, nāpi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati. Api ca kho vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ tatiyā ādesanavidhā. ‘‘Puna caparaṃ, bhante, idhekacco na heva kho nimittena ādisati, nāpi manussānaṃ vā amanussānaṃ vā devatānaṃ vā saddaṃ sutvā ādisati, nāpi vitakkayato vicārayato vitakkavipphārasaddaṃ sutvā ādisati. Api ca kho avitakkaṃ avicāraṃ samādhiṃ samāpannassa [vitakkavicārasamādhisamāpannassa (syā. ka.) a. ni. 3.61 passitabbaṃ] cetasā ceto paricca pajānāti – ‘yathā imassa bhoto manosaṅkhārā paṇihitā. Tathā imassa cittassa anantarā imaṃ nāma vitakkaṃ vitakkessatī’ti. So bahuṃ cepi ādisati, tatheva taṃ hoti, no aññathā. Ayaṃ catutthā ādesanavidhā. Etadānuttariyaṃ, bhante, ādesanavidhāsu. ",
      "english": "\"Furthermore, venerable sir, this is unsurpassed, how the Blessed One teaches the Dhamma through methods of mind-reading. There are these four methods of mind-reading, venerable sir. Here, venerable sir, a certain person reads minds through signs, saying, 'Your mind is like this, your mind is such, your thought is in this way.' And however much he reads, it is just so, not otherwise. This is the first method of mind-reading.\n\n\"Again, venerable sir, here a certain person does not read minds through signs. However, having heard the sound of humans or non-humans or deities, he reads minds, saying, 'Your mind is like this, your mind is such, your thought is in this way.' And however much he reads, it is just so, not otherwise. This is the second method of mind-reading.\n\n\"Again, venerable sir, here a certain person does not read minds through signs, nor having heard the sound of humans or non-humans or deities. However, having heard the sound of the scattering of thoughts of one who is thinking and pondering, he reads minds, saying, 'Your mind is like this, your mind is such, your thought is in this way.' And however much he reads, it is just so, not otherwise. This is the third method of mind-reading.\n\n\"Again, venerable sir, here a certain person does not read minds through signs, nor having heard the sound of humans or non-humans or deities, nor having heard the sound of the scattering of thoughts of one who is thinking and pondering. But with his mind, encompassing the mind of one who has attained to thought-free, investigation-free concentration, he understands: 'As the mental formations of this worthy one are directed, so immediately after this, his mind will think such and such a thought.' And however much he reads, it is just so, not otherwise. This is the fourth method of mind-reading. This is unsurpassed, venerable sir, among the methods of mind-reading.\"",
      "sinhala": "‘‘තවද, ස්වාමීනී, භාග්‍යවතුන් වහන්සේ යම් සේ අනුශාසනා ක්‍රමයන්හි ධර්මය දේශනා කරන සේක්ද, එය අනුත්තර වේ. ස්වාමීනී, මේ අනුශාසනා ක්‍රම සතරකි. ස්වාමීනී, මෙහි ඇතැමෙක් ලකුණින් අනුශාසනා කරයි. ‘ඔබගේ සිත මෙසේය, ඔබගේ සිත මෙයාකාරය, ඔබගේ චිත්තය මෙබඳුය’ කියායි. ඔහු බොහෝ දේ අනුශාසනා කළත් එය එසේම වන්නේය, වෙනස් නොවන්නේය. මෙය පළමුවන අනුශාසනා ක්‍රමයයි. ‘‘තවද, ස්වාමීනී, මෙහි ඇතැමෙක් ලකුණින් අනුශාසනා නොකරයි. එහෙත් මනුෂ්‍යයන්ගේ හෝ අමනුෂ්‍යයන්ගේ හෝ දෙවියන්ගේ හෝ ශබ්දයක් අසා අනුශාසනා කරයි. ‘ඔබගේ සිත මෙසේය, ඔබගේ සිත මෙයාකාරය, ඔබගේ චිත්තය මෙබඳුය’ කියායි. ඔහු බොහෝ දේ අනුශාසනා කළත් එය එසේම වන්නේය, වෙනස් නොවන්නේය. මෙය දෙවන අනුශාසනා ක්‍රමයයි. ‘‘තවද, ස්වාමීනී, මෙහි ඇතැමෙක් ලකුණින් අනුශාසනා නොකරයි. මනුෂ්‍යයන්ගේ හෝ අමනුෂ්‍යයන්ගේ හෝ දෙවියන්ගේ හෝ ශබ්දයක් අසාද අනුශාසනා නොකරයි. එහෙත් විතර්ක කරන, විචාරණ කරන කල්හි විතර්කයන්ගේ වික්ෂෝභ ශබ්දයක් අසා අනුශාසනා කරයි. ‘ඔබගේ සිත මෙසේය, ඔබගේ සිත මෙයාකාරය, ඔබගේ චිත්තය මෙබඳුය’ කියායි. ඔහු බොහෝ දේ අනුශාසනා කළත් එය එසේම වන්නේය, වෙනස් නොවන්නේය. මෙය තෙවන අනුශාසනා ක්‍රමයයි. ‘‘තවද, ස්වාමීනී, මෙහි ඇතැමෙක් ලකුණින් අනුශාසනා නොකරයි. මනුෂ්‍යයන්ගේ හෝ අමනුෂ්‍යයන්ගේ හෝ දෙවියන්ගේ හෝ ශබ්දයක් අසාද අනුශාසනා නොකරයි. විතර්ක කරන, විචාරණ කරන කල්හි විතර්කයන්ගේ වික්ෂෝභ ශබ්දයක් අසාද අනුශාසනා නොකරයි. එහෙත් අවිතර්ක අවිචාර සමාධියට [විතර්ක විචාර සමාධියට (ස්‍යා. ක.) අ. නි. 3.61 බලන්න] පැමිණි අයගේ සිතින් සිත දැන ‘මේ භවත්හුගේ මනසංස්කාර යම්සේ පිහිටුවා තිබේද, මේ චිත්තයාගේ අනතුරුව මේ නමින් විතර්කය විතර්ක කරන්නේය’ යයි දනී. ඔහු බොහෝ දේ අනුශාසනා කළත් එය එසේම වන්නේය, වෙනස් නොවන්නේය. මෙය සතරවන අනුශාසනා ක්‍රමයයි. ස්වාමීනී, අනුශාසනා ක්‍රමයන් අතුරින් මෙය අනුත්තර වේ.",
      "paliTitle": "Ādesanavidhādesanā",
      "englishTitle": "Exposition of Modes of Exposition",
      "sinhalaTitle": "ආදේශනා විධි දේශනය"
    },
    {
      "number": 149,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti dassanasamāpattīsu. Catasso imā, bhante, dassanasamāpattiyo. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā nakhā dantā taco maṃsaṃ nhāru aṭṭhi aṭṭhimiñjaṃ vakkaṃ hadayaṃ yakanaṃ kilomakaṃ pihakaṃ papphāsaṃ antaṃ antaguṇaṃ udariyaṃ karīsaṃ pittaṃ semhaṃ pubbo lohitaṃ sedo medo assu vasā kheḷo siṅghānikā lasikā mutta’nti. Ayaṃ paṭhamā dassanasamāpatti. ‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā…pe… lasikā mutta’nti. Atikkamma ca purisassa chavimaṃsalohitaṃ aṭṭhiṃ paccavekkhati. Ayaṃ dutiyā dassanasamāpatti. ‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā…pe… lasikā mutta’nti. Atikkamma ca purisassa chavimaṃsalohitaṃ aṭṭhiṃ paccavekkhati. Purisassa ca viññāṇasotaṃ pajānāti, ubhayato abbocchinnaṃ idha loke patiṭṭhitañca paraloke patiṭṭhitañca. Ayaṃ tatiyā dassanasamāpatti. ‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānappakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā…pe… lasikā mutta’nti. Atikkamma ca purisassa chavimaṃsalohitaṃ aṭṭhiṃ paccavekkhati. Purisassa ca viññāṇasotaṃ pajānāti, ubhayato abbocchinnaṃ idha loke appatiṭṭhitañca paraloke appatiṭṭhitañca. Ayaṃ catutthā dassanasamāpatti. Etadānuttariyaṃ, bhante, dassanasamāpattīsu. ",
      "english": "\"Furthermore, venerable sir, this is the unsurpassed thing, how the Blessed One teaches the Dhamma in the attainments of vision. These are the four attainments of vision, venerable sir. Here, venerable sir, a certain ascetic or brahmin, by applying diligence, by applying exertion, by applying application, by applying heedfulness, by applying proper attention, attains such a concentration of mind that with the mind well-concentrated, he reviews this very body, from the soles of the feet upwards to the crown of the head, enclosed by skin, as full of various kinds of impurities, thus: ‘In this body there are hairs of the head, hairs of the body, nails, teeth, skin, flesh, sinews, bones, bone marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, intestinal mesentery, undigested food, feces, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, snot, synovial fluid, urine.’ This is the first attainment of vision.\n\n\"Again, venerable sir, here a certain ascetic or brahmin, by applying diligence… attains such a concentration of mind that with the mind well-concentrated, he reviews this very body, from the soles of the feet upwards to the crown of the head, enclosed by skin, as full of various kinds of impurities, thus: ‘In this body there are hairs of the head, hairs of the body… synovial fluid, urine.’ He transcends the skin, flesh, blood, and bones of a person and perceives the bones. This is the second attainment of vision.\n\n\"Again, venerable sir, here a certain ascetic or brahmin, by applying diligence… attains such a concentration of mind that with the mind well-concentrated, he reviews this very body, from the soles of the feet upwards to the crown of the head, enclosed by skin, as full of various kinds of impurities, thus: ‘In this body there are hairs of the head, hairs of the body… synovial fluid, urine.’ He transcends the skin, flesh, blood, and bones of a person and perceives the bones. And he understands the stream of consciousness of a person, uninterrupted on both sides, established in this world and established in the next world. This is the third attainment of vision.\n\n\"Again, venerable sir, here a certain ascetic or brahmin, by applying diligence… attains such a concentration of mind that with the mind well-concentrated, he reviews this very body, from the soles of the feet upwards to the crown of the head, enclosed by skin, as full of various kinds of impurities, thus: ‘In this body there are hairs of the head, hairs of the body… synovial fluid, urine.’ He transcends the skin, flesh, blood, and bones of a person and perceives the bones. And he understands the stream of consciousness of a person, uninterrupted on both sides, not established in this world and not established in the next world. This is the fourth attainment of vision. This, venerable sir, is the unsurpassed thing in the attainments of vision.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ දර්ශන සමාපත්ති ගැන දේශනා කරන ආකාරය අනුත්තර වේ. ස්වාමීනි, මේ දර්ශන සමාපත්ති සතරකි. ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ තැනැත්තෙක් වීර්යයෙහි යෙදී, උත්සාහයෙහි යෙදී, අනුයෝගීව, අප්‍රමාදීව, මනා ලෙස මෙනෙහි කිරීමෙහි යෙදී, යම්සේ ඒකාග්‍ර වූ සිතින් මේ ශරීරයම යටිපතුල්වලින් උඩට හිස කෙස්වලින් පහළට සමින් වට වූ නානාවිධ අපිරිසිදු දේවලින් පිරී ඇති බව නුවණින් විමසයි ද, ‘මේ ශරීරයෙහි කෙස් ද, ලොම් ද, නිය ද, දත් ද, සම ද, මස් ද, නහර ද, ඇට ද, ඇට මිදුළු ද, වකුගඩු ද, හෘදය වස්තුව ද, අක්මාව ද, පෙනහළු ද, ප්ලීහාව ද, පප්ඵාසය ද, බඩවැල් ද, බඩවැල්වල ගැට ද, අතුණු බහන් ද, අසූචි ද, පිත ද, සෙම ද, සැරව ද, ලේ ද, දහඩිය ද, මේදය ද, කඳුළු ද, වුරුණු තෙල් ද, කෙළ ද, සොටු ද, සෙල ද, මුත්‍රා ද ඇතැ’යි දකියි. මෙය පළමුවන දර්ශන සමාපත්තියයි.\n\n‘‘තවද, ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ තැනැත්තෙක් වීර්යයෙහි යෙදී... ඒකාග්‍ර වූ සිතින් මේ ශරීරයම යටිපතුල්වලින් උඩට හිස කෙස්වලින් පහළට සමින් වට වූ නානාවිධ අපිරිසිදු දේවලින් පිරී ඇති බව නුවණින් විමසයි – ‘මේ ශරීරයෙහි කෙස් ද, ලොම් ද... සෙල ද, මුත්‍රා ද ඇතැ’යි දකියි. තවද මිනිසෙකුගේ සම, මස්, ලේ ඉක්මවා ඇට දෙස බලයි. මෙය දෙවන දර්ශන සමාපත්තියයි.\n\n‘‘තවද, ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ තැනැත්තෙක් වීර්යයෙහි යෙදී... ඒකාග්‍ර වූ සිතින් මේ ශරීරයම යටිපතුල්වලින් උඩට හිස කෙස්වලින් පහළට සමින් වට වූ නානාවිධ අපිරිසිදු දේවලින් පිරී ඇති බව නුවණින් විමසයි – ‘මේ ශරීරයෙහි කෙස් ද, ලොම් ද... සෙල ද, මුත්‍රා ද ඇතැ’යි දකියි. තවද මිනිසෙකුගේ සම, මස්, ලේ ඉක්මවා ඇට දෙස බලයි. තවද මිනිසාගේ විඤ්ඤාණ ධාරාව දනී. එය දෙපසින් නොකැඩී පවත්නේය. මේ ලෝකයෙහි පිහිටා තිබෙන්නේය. පරලෝකයෙහි ද පිහිටා තිබෙන්නේය. මෙය තුන්වන දර්ශන සමාපත්තියයි.\n\n‘‘තවද, ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ තැනැත්තෙක් වීර්යයෙහි යෙදී... ඒකාග්‍ර වූ සිතින් මේ ශරීරයම යටිපතුල්වලින් උඩට හිස කෙස්වලින් පහළට සමින් වට වූ නානාවිධ අපිරිසිදු දේවලින් පිරී ඇති බව නුවණින් විමසයි – ‘මේ ශරීරයෙහි කෙස් ද, ලොම් ද... සෙල ද, මුත්‍රා ද ඇතැ’යි දකියි. තවද මිනිසෙකුගේ සම, මස්, ලේ ඉක්මවා ඇට දෙස බලයි. තවද මිනිසාගේ විඤ්ඤාණ ධාරාව දනී. එය දෙපසින් නොකැඩී පවත්නේය. මේ ලෝකයෙහි නොපිහිටා තිබෙන්නේය. පරලෝකයෙහි ද නොපිහිටා තිබෙන්නේය. මෙය සතරවන දර්ශන සමාපත්තියයි. ස්වාමීනි, දර්ශන සමාපත්ති අතර මෙය අනුත්තර වේ.",
      "paliTitle": "Dassanasamāpattidesanā",
      "englishTitle": "Teaching on Attaining Insight",
      "sinhalaTitle": "දර්ශන සමාපත්ති දේශනාව"
    },
    {
      "number": 150,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti puggalapaṇṇattīsu. Sattime, bhante, puggalā. Ubhatobhāgavimutto paññāvimutto kāyasakkhī diṭṭhippatto saddhāvimutto dhammānusārī saddhānusārī. Etadānuttariyaṃ, bhante, puggalapaṇṇattīsu. ",
      "english": "Furthermore, venerable sir, this is unsurpassed, how the Blessed One teaches the Dhamma in terms of designations of persons. These seven persons, venerable sir, are: one liberated in both ways, one liberated by wisdom, one who is a body-witness, one attained to right view, one liberated by faith, one who follows the Dhamma, and one who follows with faith. This, venerable sir, is unsurpassed in terms of designations of persons.",
      "sinhala": "\"තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ පුද්ගල ප්‍රඥප්තීන්හි දේශනා කරන ධර්මය අනුත්තර වන්නේය. ස්වාමීනි, මේ පුද්ගලයෝ සත් දෙනෙකි. උභතෝභාගවිමුක්ත, ප්‍රඥාවිමුක්ත, කායසාක්ෂී, දිට්ඨිප්‍රාප්ත, ශ්‍රද්ධා විමුක්ත, ධර්මානුසාරී, ශ්‍රද්ධානුසාරී යන මොවුහුය. ස්වාමීනි, පුද්ගල ප්‍රඥප්තීන්හි මෙය අනුත්තර වෙයි.\"",
      "paliTitle": "Puggalapaṇṇattidesanā",
      "englishTitle": "Discourse on the Designation of Individuals",
      "sinhalaTitle": "පුග්ගල පඤ්ඤත්ති දේශනාව"
    },
    {
      "number": 151,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti padhānesu. Sattime, bhante sambojjhaṅgā satisambojjhaṅgo dhammavicayasambojjhaṅgo vīriyasambojjhaṅgo pītisambojjhaṅgo passaddhisambojjhaṅgo samādhisambojjhaṅgo upekkhāsambojjhaṅgo. Etadānuttariyaṃ, bhante, padhānesu. ",
      "english": "\"Furthermore, venerable sir, this is unsurpassed with regard to striving, in that the Blessed One teaches the Dhamma on the bases for striving. These seven factors of enlightenment, venerable sir, are the mindfulness enlightenment factor, the investigation of phenomena enlightenment factor, the energy enlightenment factor, the rapture enlightenment factor, the tranquility enlightenment factor, the concentration enlightenment factor, and the equanimity enlightenment factor. This, venerable sir, is unsurpassed with regard to striving.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, මෙය උත්තරීතර වන්නේ භාග්‍යවතුන් වහන්සේ වීර්යයන්හි ධර්මය දේශනා කරන ආකාරයටයි. ස්වාමීනි, මේ සත් බොජ්ඣංගාවන් වෙත්: සති සම්බොජ්ඣංගය, ධම්මවිචය සම්බොජ්ඣංගය, වීර්ය සම්බොජ්ඣංගය, ප්‍රීති සම්බොජ්ඣංගය, ප්‍රශ්‍රබ්ධි සම්බොජ්ඣංගය, සමාධි සම්බොජ්ඣංගය, උපේක්ෂා සම්බොජ්ඣංගයයි. ස්වාමීනි, මෙය වීර්යයන්හි උත්තරීතර වෙයි.",
      "paliTitle": "Padhānadesanā",
      "englishTitle": "Discourse on Striving",
      "sinhalaTitle": "පධාන දේශනාව"
    },
    {
      "number": 152,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti paṭipadāsu. Catasso imā, bhante, paṭipadā dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññāti. Tatra, bhante, yāyaṃ paṭipadā dukkhā dandhābhiññā, ayaṃ, bhante, paṭipadā ubhayeneva hīnā akkhāyati dukkhattā ca dandhattā ca. Tatra, bhante, yāyaṃ paṭipadā dukkhā khippābhiññā, ayaṃ pana, bhante, paṭipadā dukkhattā hīnā akkhāyati. Tatra, bhante, yāyaṃ paṭipadā sukhā dandhābhiññā, ayaṃ pana, bhante, paṭipadā dandhattā hīnā akkhāyati. Tatra, bhante, yāyaṃ paṭipadā sukhā khippābhiññā, ayaṃ pana, bhante, paṭipadā ubhayeneva paṇītā akkhāyati sukhattā ca khippattā ca. Etadānuttariyaṃ, bhante, paṭipadāsu. ",
      "english": "\"Furthermore, venerable sir, this is the unsurpassed thing: that the Blessed One teaches the Dhamma concerning courses of practice. These, venerable sir, are the four courses of practice: the painful practice with slow understanding, the painful practice with quick understanding, the pleasant practice with slow understanding, and the pleasant practice with quick understanding.\n\n\"And, venerable sir, that course of practice that is painful with slow understanding, that course of practice is said to be inferior in both ways, due to its painfulness and its slowness.\n\n\"And, venerable sir, that course of practice that is painful with quick understanding, that course of practice is said to be inferior due to its painfulness.\n\n\"And, venerable sir, that course of practice that is pleasant with slow understanding, that course of practice is said to be inferior due to its slowness.\n\n\"And, venerable sir, that course of practice that is pleasant with quick understanding, that course of practice is said to be superior in both ways, due to its pleasantness and its quickness. This, venerable sir, is the unsurpassed thing concerning courses of practice.\"",
      "sinhala": "‘‘තවද, ස්වාමීනී, භාග්‍යවතුන් වහන්සේ ප්‍රතිපදාවන්හි දේශනා කරන මෙම අනුත්තරීය ධර්මය වෙයි. ස්වාමීනී, මේ ප්‍රතිපදා සතරෙකි. දුක්ඛ ප්‍රතිපදා දන්ද්‍රාභිඥා, දුක්ඛ ප්‍රතිපදා ක්ෂිප්‍රාභිඥා, සුඛ ප්‍රතිපදා දන්ද්‍රාභිඥා, සුඛ ප්‍රතිපදා ක්ෂිප්‍රාභිඥා යන ඒවායි.\n\nස්වාමීනී, ඒ ප්‍රතිපදාවන් අතුරෙන් යම් දුක්ඛ දන්ද්‍රාභිඥා ප්‍රතිපදාවක් වේද, ස්වාමීනී, මේ ප්‍රතිපදාව දුෂ්කර වීමෙනුත් ප්‍රමාද වීමෙනුත් යන දෙයාකාරයෙන්ම හීන යැයි කියනු ලැබේ. ස්වාමීනී, ඒ ප්‍රතිපදාවන් අතුරෙන් යම් දුක්ඛ ක්ෂිප්‍රාභිඥා ප්‍රතිපදාවක් වේද, ස්වාමීනී, මේ ප්‍රතිපදාව දුෂ්කර වීම හේතුවෙන් හීන යැයි කියනු ලැබේ. ස්වාමීනී, ඒ ප්‍රතිපදාවන් අතුරෙන් යම් සුඛ දන්ද්‍රාභිඥා ප්‍රතිපදාවක් වේද, ස්වාමීනී, මේ ප්‍රතිපදාව ප්‍රමාද වීම හේතුවෙන් හීන යැයි කියනු ලැබේ. ස්වාමීනී, ඒ ප්‍රතිපදාවන් අතුරෙන් යම් සුඛ ක්ෂිප්‍රාභිඥා ප්‍රතිපදාවක් වේද, ස්වාමීනී, මේ ප්‍රතිපදාව සැප වීමෙනුත් ඉක්මන් වීමෙනුත් යන දෙයාකාරයෙන්ම ප්‍රණීත යැයි කියනු ලැබේ. ස්වාමීනී, මෙය ප්‍රතිපදාවන්හි අනුත්තරීය වේ.’’",
      "paliTitle": "Paṭipadādesanā",
      "englishTitle": "Teaching on the Path",
      "sinhalaTitle": "ප්‍රතිපදා දේශනාව"
    },
    {
      "number": 153,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti bhassasamācāre. Idha, bhante, ekacco na ceva musāvādupasañhitaṃ vācaṃ bhāsati na ca vebhūtiyaṃ na ca pesuṇiyaṃ na ca sārambhajaṃ jayāpekkho; mantā mantā ca vācaṃ bhāsati nidhānavatiṃ kālena. Etadānuttariyaṃ, bhante, bhassasamācāre. ‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti purisasīlasamācāre. Idha, bhante, ekacco sacco cassa saddho ca, na ca kuhako, na ca lapako, na ca nemittiko, na ca nippesiko, na ca lābhena lābhaṃ nijigīsanako [jijigiṃsanako (syā.), nijigiṃsitā (sī. pī.)], indriyesu guttadvāro, bhojane mattaññū, samakārī, jāgariyānuyogamanuyutto, atandito, āraddhavīriyo, jhāyī, satimā, kalyāṇapaṭibhāno, gatimā, dhitimā, matimā, na ca kāmesu giddho, sato ca nipako ca. Etadānuttariyaṃ, bhante, purisasīlasamācāre. ",
      "english": "Furthermore, venerable sir, this is unsurpassed, how the Blessed One teaches the Dhamma regarding conduct in speech. Here, venerable sir, a certain person neither speaks speech associated with falsehood, nor divisive speech, nor malicious speech, nor speech that is aggressive and aimed at victory; he speaks speech that is measured, connected with a goal, and at the right time. This, venerable sir, is unsurpassed in conduct in speech.\n\nFurthermore, venerable sir, this is unsurpassed, how the Blessed One teaches the Dhamma regarding conduct in noble character. Here, venerable sir, a certain person is truthful and faithful, and he is not deceitful, nor talkative, nor a hint-giver, nor one who disparages, nor desirous of overcoming gain with gain, he is guarded in his sense faculties, moderate in eating, impartial, devoted to wakefulness, untiring, with aroused energy, meditative, mindful, with good presence of mind, wise in his ways, resolute, intelligent, and not greedy in sensual pleasures, mindful and discerning. This, venerable sir, is unsurpassed in conduct in noble character.",
      "sinhala": "“තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ භාෂා සමාචාරයෙහි ධර්මය දේශනා කරන ආකාරය අනුත්තරීය වේ. ස්වාමීනි, මෙහි ඇතැමෙක් බොරු කීමෙන් යුක්ත වචන නොකියයි, හිස් වචන නොකියයි, කේලාම් නොකියයි, ජය අපේක්ෂාවෙන් යුතුව ආරම්භක වචන නොකියයි; අර්ථවත් වචන මනාව සිතා කල් දැන කථා කරයි. ස්වාමීනි, භාෂා සමාචාරයෙහි මෙය අනුත්තරීය වේ. තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ පුරිස සීල සමාචාරයෙහි ධර්මය දේශනා කරන ආකාරය අනුත්තරීය වේ. ස්වාමීනි, මෙහි ඇතැමෙක් සත්‍යවාදී වේ, ශ්‍රද්ධාවන්ත වේ, කුහක නොවෙයි, දොඩමළු නොවෙයි, නිමිති කියන්නෙක් නොවෙයි, හිඟන්නෙක් නොවෙයි, ලාභයෙන් ලාභය ලබාගැනීමට උත්සාහ කරන්නෙක් නොවෙයි, ඉන්ද්‍රියන් කෙරෙහි දොරටු ආරක්ෂා කරගත් සිහි ඇති කෙනෙක් වෙයි, භෝජනයෙහි පමණ දනී, සමකාර්‍ය වෙයි, නිදිවැරීමෙහි නිරත වෙයි, අලස නොවෙයි, වීර්යය ආරම්භ කළ කෙනෙක් වෙයි, ධ්‍යාන වඩයි, සිහි ඇති වෙයි, යහපත් ප්‍රතිභානයක් ඇති වෙයි, ගති ඇති වෙයි, ධෛර්යය ඇති වෙයි, නුවණ ඇති වෙයි, කාමයන් කෙරෙහි ඇලුම් නොකරයි, සිහියෙන් යුක්තව නුවණින් කටයුතු කරයි. ස්වාමීනි, පුරිස සීල සමාචාරයෙහි මෙය අනුත්තරීය වේ.”",
      "paliTitle": "Bhassasamācārādidesanā",
      "englishTitle": "Discourse on Speech, Conduct, and the Like",
      "sinhalaTitle": "කථා සමාචාරාදි දේශනාව"
    },
    {
      "number": 154,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti anusāsanavidhāsu. Catasso imā bhante anusāsanavidhā – jānāti, bhante, bhagavā aparaṃ puggalaṃ paccattaṃ yonisomanasikārā ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno bhavissati avinipātadhammo niyato sambodhiparāyaṇo’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī bhavissati, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissatī’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko bhavissati tattha parinibbāyī anāvattidhammo tasmā lokā’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo yathānusiṭṭhaṃ tathā paṭipajjamāno āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissatī’ti. Etadānuttariyaṃ, bhante, anusāsanavidhāsu. ",
      "english": "\"Furthermore, venerable sir, this is the unsurpassed thing, that the Blessed One teaches the Dhamma in methods of instruction. These, venerable sir, are the four methods of instruction: The Blessed One knows another person individually, by careful attention: ‘This person, practicing according to the instruction, with the destruction of three fetters, will be a stream-enterer, not subject to falling into the states of woe, assured, destined for enlightenment.’ The Blessed One knows another person individually, by careful attention: ‘This person, practicing according to the instruction, with the destruction of three fetters and the weakening of lust, hate, and delusion, will be a once-returner, returning only once more to this world, will make an end of suffering.’ The Blessed One knows another person individually, by careful attention: ‘This person, practicing according to the instruction, with the destruction of the five lower fetters, will be reborn spontaneously, there to attain final Nibbāna, not subject to returning from that world.’ The Blessed One knows another person individually, by careful attention: ‘This person, practicing according to the instruction, with the destruction of the taints, will realize for himself with direct knowledge and attain to, in this very life, the taintless liberation of mind, liberation by wisdom, and abide therein.’ This, venerable sir, is the unsurpassed thing in methods of instruction.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, අනුශාසනා කිරීම්හි මෙය අනුත්තරීය වේ. ස්වාමීනි, මේ අනුශාසනා කිරීම් සතරෙකි. භාග්‍යවතුන් වහන්සේ යම් පුද්ගලයෙක් මනා ලෙස කල්පනා කිරීමෙන් ‘මේ පුද්ගලයා යම්සේ අනුශාසනා කරණ ලදද, එසේ පිළිපදිනුයේ සංයෝජන තුනක් ක්ෂය කිරීමෙන් සෝතාපන්න වන්නේය. ඔහු විනිපාත ධර්මතාවයෙන් මිදුණේය. නියත වශයෙන්ම සම්බෝධිය කරා යන ගමනෙහි යෙදෙන්නේය’ යි තමා විසින්ම දන්නා සේක.\n\nතවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ යම් පුද්ගලයෙක් මනා ලෙස කල්පනා කිරීමෙන් ‘මේ පුද්ගලයා යම්සේ අනුශාසනා කරණ ලදද, එසේ පිළිපදිනුයේ සංයෝජන තුනක් ක්ෂය කිරීමෙන් රාග, ද්වේෂ, මෝහ සිහින් වීමෙන් සකෘදාගාමී වන්නේය. ඔහු එක් වරක් පමණක් මේ ලෝකයට පැමිණ දුක් කෙළවර කරන්නේය’ යි තමා විසින්ම දන්නා සේක.\n\nතවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ යම් පුද්ගලයෙක් මනා ලෙස කල්පනා කිරීමෙන් ‘මේ පුද්ගලයා යම්සේ අනුශාසනා කරණ ලදද, එසේ පිළිපදිනුයේ පහළ සංයෝජන පහක් ක්ෂය කිරීමෙන් ඕපපාතික වන්නේය. එහිදීම පිරිනිවන් පාන්නේය. ඔහු ඒ ලෝකයෙන් නැවත නොඑන්නේය’ යි තමා විසින්ම දන්නා සේක.\n\nතවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ යම් පුද්ගලයෙක් මනා ලෙස කල්පනා කිරීමෙන් ‘මේ පුද්ගලයා යම්සේ අනුශාසනා කරණ ලදද, එසේ පිළිපදිනුයේ ආශ්‍රව ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චිත්ත විමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ජීවිතයේදීම තමා විසින්ම විශිෂ්ඨ ඥානයෙන් දැන ප්‍රත්‍යක්ෂ කොට උපසම්පදා කර වාසය කරන්නේය’ යි තමා විසින්ම දන්නා සේක. ස්වාමීනි, අනුශාසනා කිරීම්හි මෙය අනුත්තරීය වේ.\"",
      "paliTitle": "Anusāsanavidhādesanā",
      "englishTitle": "Discourse on Methods of Instruction",
      "sinhalaTitle": "අනුශාසනා විධි දේශනාව"
    },
    {
      "number": 155,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti parapuggalavimuttiñāṇe. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno bhavissati avinipātadhammo niyato sambodhiparāyaṇo’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī bhavissati, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karissatī’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko bhavissati tattha parinibbāyī anāvattidhammo tasmā lokā’ti. Jānāti, bhante, bhagavā paraṃ puggalaṃ paccattaṃ yonisomanasikārā – ‘ayaṃ puggalo āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissatī’ti. Etadānuttariyaṃ, bhante, parapuggalavimuttiñāṇe. ",
      "english": "\"Furthermore, venerable sir, this is unsurpassed, namely, that the Blessed One teaches the Dhamma with knowledge of the liberation of other individuals. For, venerable sir, the Blessed One knows another individual inwardly, by wise attention: ‘This individual, with the destruction of the three fetters, will be a stream-enterer, no longer subject to downfall, assured, destined for enlightenment.’ For, venerable sir, the Blessed One knows another individual inwardly, by wise attention: ‘This individual, with the destruction of the three fetters, and with the weakening of passion, hatred, and delusion, will be a once-returner, and after coming back to this world only once, will make an end of suffering.’ For, venerable sir, the Blessed One knows another individual inwardly, by wise attention: ‘This individual, with the destruction of the five lower fetters, will be reborn spontaneously, and there attain final Nibbāna, not liable to return from that world.’ For, venerable sir, the Blessed One knows another individual inwardly, by wise attention: ‘This individual, with the destruction of the taints, having realized it by himself with direct knowledge, will here and now enter and abide in the taintless liberation of mind, liberation by wisdom.’ This, venerable sir, is unsurpassed, namely, knowledge of the liberation of other individuals.\"",
      "sinhala": "“තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනුන්ගේ පුද්ගලයන්ගේ විමුක්තිය පිළිබඳ ඥානය දේශනා කිරීම අනුත්තරීයක වේ. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනුන්ගේ පුද්ගලයන් මනාව සලකා බලා මෙසේ දන්නා සේක: ‘මේ පුද්ගලයා සංයෝජන තුනක් ක්ෂය කිරීමෙන් සෝතාපන්න වන්නේය. ඔහු විනිපාත ධර්මයෙන් පහ වූ, නියත වූ, සම්බෝධියට පැමිණෙන්නෙකි.’ ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනුන්ගේ පුද්ගලයන් මනාව සලකා බලා මෙසේ දන්නා සේක: ‘මේ පුද්ගලයා සංයෝජන තුනක් ක්ෂය කිරීමෙන් රාග, ද්වේෂ, මෝහ සිහින් වීමෙන් සකෘදාගාමී වන්නේය. ඔහු මේ ලෝකයට එක් වරක් පමණක් පැමිණ දුකට කෙළවර කරන්නේය.’ ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනුන්ගේ පුද්ගලයන් මනාව සලකා බලා මෙසේ දන්නා සේක: ‘මේ පුද්ගලයා පහළ සංයෝජන පහක් ක්ෂය කිරීමෙන් ඕපපාතික වන්නේය. එහිදීම පිරිනිවන් පාන්නේය. ඒ ලෝකයෙන් නැවත නොඑන්නෙකි.’ ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනුන්ගේ පුද්ගලයන් මනාව සලකා බලා මෙසේ දන්නා සේක: ‘මේ පුද්ගලයා ආශ්‍රව ක්ෂය කිරීමෙන් ආශ්‍රව රහිත චිත්ත විමුක්තියත්, ප්‍රඥා විමුක්තියත් මේ ජීවිතයේදීම තමා විසින්ම විශිෂ්ඨ ඥානයෙන් අවබෝධ කරගෙන වාසය කරන්නේය.’ ස්වාමීනි, අනුන්ගේ පුද්ගලයන්ගේ විමුක්තිය පිළිබඳ ඥානය අනුත්තරීයක වන්නේ මෙයයි.”",
      "paliTitle": "Parapuggalavimuttiñāṇadesanā",
      "englishTitle": "Discourse on the Knowledge of Others' Liberation",
      "sinhalaTitle": "පරපුද‍්ගල විමුක‍්ති ඤාණ දේශනා"
    },
    {
      "number": 156,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti sassatavādesu. Tayome, bhante, sassatavādā. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi – saṃvaṭṭi vā loko vivaṭṭi vāti. Anāgataṃpāhaṃ addhānaṃ jānāmi – saṃvaṭṭissati vā loko vivaṭṭissati vāti. Sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ paṭhamo sassatavādo. ‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭi vā loko vivaṭṭi vāti. Anāgataṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭissati vā loko vivaṭṭissati vāti. Sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ dutiyo sassatavādo. ‘‘Puna caparaṃ, bhante, idhekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. So evamāha – ‘atītaṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭipi loko vivaṭṭipīti; anāgataṃpāhaṃ addhānaṃ jānāmi saṃvaṭṭissatipi loko vivaṭṭissatipīti. Sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito. Te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Ayaṃ tatiyo sassatavādo, etadānuttariyaṃ, bhante, sassatavādesu. ",
      "english": "\"Furthermore, venerable sir, this is the unsurpassed thing, how the Blessed One teaches the Dhamma among the eternalist views. There are these three eternalist views, venerable sir. Here, venerable sir, a certain ascetic or brahmin, through devoted effort… attains such a concentration of mind that, with his mind concentrated in this way, he recollects many past lives, that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many hundreds of births, many thousands of births, many hundreds of thousands of births, recalling, ‘There I was, with such a name, such a clan, such an appearance, such food, such experience of pleasure and pain, such a life span; and passing away from there, I was reborn elsewhere; and there too I was, with such a name, such a clan, such an appearance, such food, such experience of pleasure and pain, such a life span; and passing away from there, I have been reborn here.’ Thus he recollects many past lives in their modes and details. He says thus: ‘I know the past extending back – the world either contracts or expands. I know the future extending forward – the world will either contract or expand. The self and the world are eternal, barren, standing firm like a pillar, like a post planted firmly. And these beings transmigrate, wander on, pass away, and are reborn; they persist just as eternally.’ This is the first eternalist view.\n\n\"Again, venerable sir, here a certain ascetic or brahmin, through devoted effort… attains such a concentration of mind that, with his mind concentrated in this way, he recollects many past lives, that is to say, one period of contraction and expansion of the world, two periods of contraction and expansion of the world, three periods of contraction and expansion of the world, four periods of contraction and expansion of the world, five periods of contraction and expansion of the world, ten periods of contraction and expansion of the world, recalling, ‘There I was, with such a name, such a clan, such an appearance, such food, such experience of pleasure and pain, such a life span; and passing away from there, I was reborn elsewhere; and there too I was, with such a name, such a clan, such an appearance, such food, such experience of pleasure and pain, such a life span; and passing away from there, I have been reborn here.’ Thus he recollects many past lives in their modes and details. He says thus: ‘I know the past extending back – the world either contracts or expands. I know the future extending forward – the world will either contract or expand. The self and the world are eternal, barren, standing firm like a pillar, like a post planted firmly. And these beings transmigrate, wander on, pass away, and are reborn; they persist just as eternally.’ This is the second eternalist view.\n\n\"Again, venerable sir, here a certain ascetic or brahmin, through devoted effort… attains such a concentration of mind that, with his mind concentrated in this way, he recollects many past lives, that is to say, ten periods of contraction and expansion of the world, twenty periods of contraction and expansion of the world, thirty periods of contraction and expansion of the world, forty periods of contraction and expansion of the world, recalling, ‘There I was, with such a name, such a clan, such an appearance, such food, such experience of pleasure and pain, such a life span; and passing away from there, I was reborn elsewhere; and there too I was, with such a name, such a clan, such an appearance, such food, such experience of pleasure and pain, such a life span; and passing away from there, I have been reborn here.’ Thus he recollects many past lives in their modes and details. He says thus: ‘I know the past extending back – the world both contracted and expanded; I know the future extending forward – the world will both contract and expand. The self and the world are eternal, barren, standing firm like a pillar, like a post planted firmly. And these beings transmigrate, wander on, pass away, and are reborn; they persist just as eternally.’ This is the third eternalist view, and this is the unsurpassed thing, venerable sir, among the eternalist views.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ සස්සතවාදයන්හි ධර්මය දේශනා කරන ආකාරය මෙය අනුත්තර වෙයි. ස්වාමීනි, සස්සතවාද තුනක් ඇත. ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ හෝ තපසෙහි යෙදී…පෙ…. යම්සේ ඒකාකාර වූ චිත්ත සමාධියක් ස්පර්ශ කෙරේද, එසේ සමාධිගත වූ සිතින් අනේකාකාර වූ පූර්ව නිවාසය සිහි කරයි. එනම්, එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති හතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, අනේකාකාර වූ ජාති සිය ගණනක් ද, අනේකාකාර වූ ජාති දහස් ගණනක් ද, අනේකාකාර වූ ජාති ලක්ෂ ගණනක් ද, ‘මම අසුවල් තැන අසුවල් නමින්, අසුවල් ගෝත්‍රයෙන්, අසුවල් වර්ණයෙන්, අසුවල් ආහාරයෙන් යුක්තව, මෙබඳු සැප දුක් විඳිමින්, මෙපමණ ආයුෂ ඇතිව සිටියෙමි. මම එතැනින් චුතව අසුවල් තැන උපන්නෙමි. එහිදී ද අසුවල් නමින්, අසුවල් ගෝත්‍රයෙන්, අසුවල් වර්ණයෙන්, අසුවල් ආහාරයෙන් යුක්තව, මෙබඳු සැප දුක් විඳිමින්, මෙපමණ ආයුෂ ඇතිව සිටියෙමි. මම එතැනින් චුතව මෙහි උපන්නෙමි’ යැයි මෙසේ ආකාර සහිතව, නාම ගෝත්‍ර සහිතව, අනේකාකාර වූ පූර්ව නිවාසය සිහි කරයි. ඔහු මෙසේ කියයි. ‘මම අතීත කාලය දනිමි. ලෝකය සංවට්ට වූයේ ද, විවට්ට වූයේ ද යන්න දනිමි. මම අනාගත කාලය දනිමි. ලෝකය සංවට්ට වන්නේ ද, විවට්ට වන්නේ ද යන්න දනිමි. ආත්මය ද ලෝකය ද ශාස්වතය. වඳ නොවන ස්වභාව ඇත්තේය. කණු මෙන් ස්ථිරව පිහිටියේය. මේ සත්වයෝ සසරෙහි දිව යති. උපදිති, මිය යති, නැවත ඉපදෙති. මෙසේ සදාකල් පවතින්නේය’ යැයි කියයි. මෙය පළමුවන සස්සතවාදයයි.\n\n‘‘තවද, ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ හෝ තපසෙහි යෙදී…පෙ…. යම්සේ ඒකාකාර වූ චිත්ත සමාධියක් ස්පර්ශ කෙරේද, එසේ සමාධිගත වූ සිතින් අනේකාකාර වූ පූර්ව නිවාසය සිහි කරයි. එනම්, එක් සංවට්ට විවට්ටයක් ද, සංවට්ට විවට්ට දෙකක් ද, සංවට්ට විවට්ට තුනක් ද, සංවට්ට විවට්ට හතරක් ද, සංවට්ට විවට්ට පහක් ද, සංවට්ට විවට්ට දහයක් ද, ‘මම අසුවල් තැන අසුවල් නමින්, අසුවල් ගෝත්‍රයෙන්, අසුවල් වර්ණයෙන්, අසුවල් ආහාරයෙන් යුක්තව, මෙබඳු සැප දුක් විඳිමින්, මෙපමණ ආයුෂ ඇතිව සිටියෙමි. මම එතැනින් චුතව අසුවල් තැන උපන්නෙමි. එහිදී ද අසුවල් නමින්, අසුවල් ගෝත්‍රයෙන්, අසුවල් වර්ණයෙන්, අසුවල් ආහාරයෙන් යුක්තව, මෙබඳු සැප දුක් විඳිමින්, මෙපමණ ආයුෂ ඇතිව සිටියෙමි. මම එතැනින් චුතව මෙහි උපන්නෙමි’ යැයි මෙසේ ආකාර සහිතව, නාම ගෝත්‍ර සහිතව, අනේකාකාර වූ පූර්ව නිවාසය සිහි කරයි. ඔහු මෙසේ කියයි. ‘මම අතීත කාලය දනිමි. ලෝකය සංවට්ට වූයේ ද, විවට්ට වූයේ ද යන්න දනිමි. මම අනාගත කාලය දනිමි. ලෝකය සංවට්ට වන්නේ ද, විවට්ට වන්නේ ද යන්න දනිමි. ආත්මය ද ලෝකය ද ශාස්වතය. වඳ නොවන ස්වභාව ඇත්තේය. කණු මෙන් ස්ථිරව පිහිටියේය. මේ සත්වයෝ සසරෙහි දිව යති. උපදිති, මිය යති, නැවත ඉපදෙති. මෙසේ සදාකල් පවතින්නේය’ යැයි කියයි. මෙය දෙවන සස්සතවාදයයි.\n\n‘‘තවද, ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ හෝ තපසෙහි යෙදී…පෙ…. යම්සේ ඒකාකාර වූ චිත්ත සමාධියක් ස්පර්ශ කෙරේද, එසේ සමාධිගත වූ සිතින් අනේකාකාර වූ පූර්ව නිවාසය සිහි කරයි. එනම්, සංවට්ට විවට්ට දහයක් ද, සංවට්ට විවට්ට විස්සක් ද, සංවට්ට විවට්ට තිහක් ද, සංවට්ට විවට්ට හතළිහක් ද, ‘මම අසුවල් තැන අසුවල් නමින්, අසුවල් ගෝත්‍රයෙන්, අසුවල් වර්ණයෙන්, අසුවල් ආහාරයෙන් යුක්තව, මෙබඳු සැප දුක් විඳිමින්, මෙපමණ ආයුෂ ඇතිව සිටියෙමි. මම එතැනින් චුතව අසුවල් තැන උපන්නෙමි. එහිදී ද අසුවල් නමින්, අසුවල් ගෝත්‍රයෙන්, අසුවල් වර්ණයෙන්, අසුවල් ආහාරයෙන් යුක්තව, මෙබඳු සැප දුක් විඳිමින්, මෙපමණ ආයුෂ ඇතිව සිටියෙමි. මම එතැනින් චුතව මෙහි උපන්නෙමි’ යැයි මෙසේ ආකාර සහිතව, නාම ගෝත්‍ර සහිතව, අනේකාකාර වූ පූර්ව නිවාසය සිහි කරයි. ඔහු මෙසේ කියයි. ‘මම අතීත කාලය දනිමි. ලෝකය සංවට්ට වූයේ ද, විවට්ට වූයේ ද යන්න දනිමි. මම අනාගත කාලය දනිමි. ලෝකය සංවට්ට වන්නේ ද, විවට්ට වන්නේ ද යන්න දනිමි. ආත්මය ද ලෝකය ද ශාස්වතය. වඳ නොවන ස්වභාව ඇත්තේය. කණු මෙන් ස්ථිරව පිහිටියේය. මේ සත්වයෝ සසරෙහි දිව යති. උපදිති, මිය යති, නැවත ඉපදෙති. මෙසේ සදාකල් පවතින්නේය’ යැයි කියයි. ස්වාමීනි, මෙය තුන්වන සස්සතවාදයයි. සස්සතවාදයන් අතර මෙය අනුත්තර වෙයි.",
      "paliTitle": "Sassatavādadesanā",
      "englishTitle": "Teaching of Eternalism",
      "sinhalaTitle": "ශාශ්\\u200Dවතවාද දේශනාව"
    },
    {
      "number": 157,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti pubbenivāsānussatiñāṇe. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Santi, bhante, devā [sattā (syā.)], yesaṃ na sakkā gaṇanāya vā saṅkhānena vā āyu saṅkhātuṃ. Api ca, yasmiṃ yasmiṃ attabhāve abhinivuṭṭhapubbo [abhinivutthapubbo (sī. syā. pī.)] hoti yadi vā rūpīsu yadi vā arūpīsu yadi vā saññīsu yadi vā asaññīsu yadi vā nevasaññīnāsaññīsu. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Etadānuttariyaṃ, bhante, pubbenivāsānussatiñāṇe. ",
      "english": "\"Furthermore, venerable sir, this is the unsurpassed, how the Blessed One teaches the Dhamma regarding the knowledge of the recollection of past lives. Here, venerable sir, some ascetic or Brahmin, by striving… attains such concentration of mind that with the mind thus concentrated, he recollects many kinds of past lives, such as one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many cycles of contraction of the world, many cycles of expansion of the world, many cycles of contraction and expansion of the world. ‘There I was of such a name, such a clan, such an appearance, such was my food, such was my experience of pleasure and pain, such was the end of my life; passing away from there I was reborn there; there too I was of such a name, such a clan, such an appearance, such was my food, such was my experience of pleasure and pain, such was the end of my life; passing away from there I was reborn here.’ Thus he recollects many kinds of past lives with their aspects and details. There are, venerable sir, gods whose life-span it is not possible to reckon by counting or calculation. Moreover, he also recollects the experiences of his past existences, whether they were in the realms of form or the formless realms, or in the realms of perception, or the realms of non-perception, or in the realms of neither-perception-nor-non-perception. Thus he recollects many kinds of past lives with their aspects and details. This, venerable sir, is the unsurpassed, the knowledge of the recollection of past lives.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ පෙර විසූ ජීවිත සිහිපත් කිරීමේ ඤාණය ගැන දේශනා කරන ආකාරය අනුත්තර වේ. ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ ව්‍යක්ත වීර්යයෙන් යුතුව...පෙ...එවන් චිත්ත සමාධියක් ස්පර්ශ කරයි. ඒ සමාධිගත වූ චිත්තයෙන් බොහෝ ආකාර වූ පෙර විසූ ජීවිත සිහිපත් කරයි. එනම්, එක් ජාතියක්, ජාති දෙකක්, ජාති තුනක්, ජාති හතරක්, ජාති පහක්, ජාති දහයක්, ජාති විස්සක්, ජාති තිහක්, ජාති හතළිහක්, ජාති පනහක්, ජාති සියයක්, ජාති දහසක්, ජාති ලක්ෂයක්, බොහෝ සංවට්ට කල්පයන්, බොහෝ විවට්ට කල්පයන්, බොහෝ සංවට්ට විවට්ට කල්පයන් සිහිපත් කරමින්, ‘මම අහවල් තැනැත්තා නමින්, අහවල් ගෝත්‍රයෙන්, අහවල් වර්ණයෙන්, අහවල් ආහාරයෙන් යුක්තව, මෙවන් සැප දුක් විඳිමින්, මෙපමණ ආයු කාලයක් ජීවත් වීමි. මම එතැනින් චුත වී අහවල් තැනක උපන්නෙමි. එහිදීත් අහවල් නමින්, අහවල් ගෝත්‍රයෙන්, අහවල් වර්ණයෙන්, අහවල් ආහාරයෙන් යුක්තව, මෙවන් සැප දුක් විඳිමින්, මෙපමණ ආයු කාලයක් ජීවත් වීමි. මම එතැනින් චුත වී මෙහි උපන්නෙමි’යි යනුවෙන් ආකාර සහිතව, නාම ගෝත්‍ර ආදිය සහිතව බොහෝ ආකාර වූ පෙර විසූ ජීවිත සිහිපත් කරයි. ස්වාමීනි, යම් දෙවිවරු සිටිත් නම්, ඔවුන්ගේ ආයුෂ ගණනය කිරීමට හෝ සංඛ්‍යාවෙන් දැක්වීමට නොහැකිය. එසේ වුවද, යම් යම් ආත්මභාවයන්හි පෙර උපත ලබා ඇත්නම්, රූපී හෝ අරූපී හෝ සංඥ්ඥ ඇති හෝ සංඥ්ඥ නැති හෝ සංඥ්ඥාත් නැති, අසංඥ්ඥාත් නැති ආත්මභාවයන්හි උපත ලබා තිබේ නම් ඒ සියල්ල සිහිපත් කරයි. මෙසේ ආකාර සහිතව, නාම ගෝත්‍ර ආදිය සහිතව බොහෝ ආකාර වූ පෙර විසූ ජීවිත සිහිපත් කරයි. ස්වාමීනි, මෙය පෙර විසූ ජීවිත සිහිපත් කිරීමේ ඤාණයෙහි අනුත්තර බවයි.",
      "paliTitle": "Pubbenivāsānussatiñāṇadesanā",
      "englishTitle": "Teaching on the Knowledge of Recalling Past Lives",
      "sinhalaTitle": "පූර‍්ව භව අනුස්‍සති ඥාන දේශනාව"
    },
    {
      "number": 158,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti sattānaṃ cutūpapātañāṇe. Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate yathākammūpage satte pajānāti. Etadānuttariyaṃ, bhante, sattānaṃ cutūpapātañāṇe. ",
      "english": "\"Furthermore, venerable sir, this is unsurpassed, how the Blessed One teaches the Dhamma regarding the knowledge of the passing away and rebirth of beings. Here, venerable sir, some ascetic or brahmin, by striving... attains such a concentration of mind that with the mind concentrated in that way, with the divine eye, purified and surpassing the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and understands beings according to their deeds: ‘These worthy beings who were endowed with bodily misconduct, verbal misconduct, mental misconduct, revilers of noble ones, holding wrong view, and engaging in actions based on wrong view, upon the dissolution of the body, after death, have been reborn in the plane of misery, in a bad destination, in the lower realms, in hell. But these worthy beings who were endowed with bodily good conduct, verbal good conduct, mental good conduct, non-revilers of noble ones, holding right view, and engaging in actions based on right view, upon the dissolution of the body, after death, have been reborn in a good destination, in the heavenly world.’ Thus with the divine eye, purified and surpassing the human, he sees beings passing away and being reborn, inferior and superior, beautiful and ugly, fortunate and unfortunate, and understands beings according to their deeds. This, venerable sir, is unsurpassed, regarding the knowledge of the passing away and rebirth of beings.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ සත්වයන්ගේ චුතූපපාත ඥානය ගැන ධර්මය දේශනා කිරීම අනුත්තරීය වේ. ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ තැනැත්තෙක් වීර්යය වඩමින්…පෙ.… එබඳු චිත්ත සමාධියක් ස්පර්ශ කරයි. ඒ සමාහිත වූ චිත්තයෙන් යුක්තව දිවැසින් පිරිසිදුවූ ඉක්මවූ මනුෂ්‍ය ඇසින් චුතවෙන, උපදින සත්වයන් දකියි. හීන, ප්‍රණීත, වර්ණවත්, අවර්ණවත්, සුගතිගාමී, දුර්ගතිගාමී කර්මය අනුව උපදින සත්වයන් හඳුනයි. ‘මේ පින්වතුන් කාය දුශ්චරිතයෙන් සමන්විතව, වචී දුශ්චරිතයෙන් සමන්විතව, මනෝ දුශ්චරිතයෙන් සමන්විතව, ආර්යයන්ට උපවාද කරන්නන්ව, මිථ්‍යා දෘෂ්ටික වූවන්ව, මිථ්‍යා දෘෂ්ටි කර්ම සමාදානයන් ඇතිව සිටියාහුය. ඔවුහු කය බිඳී මරණින් මතු අපායට, දුගතියට, විනිපාතයට, නිරයට පැමිණියහ. නැතහොත් මේ පින්වතුන් කාය සුචරිතයෙන් සමන්විතව, වචී සුචරිතයෙන් සමන්විතව, මනෝ සුචරිතයෙන් සමන්විතව, ආර්යයන්ට අනූපවාද කරන්නන්ව, සම්මා දිට්ඨික වූවන්ව, සම්මා දිට්ඨි කර්ම සමාදානයන් ඇතිව සිටියාහුය. ඔවුහු කය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට පැමිණියහ’ යැයි දිවැසින් පිරිසිදුවූ ඉක්මවූ මනුෂ්‍ය ඇසින් චුතවෙන, උපදින සත්වයන් දකියි. හීන, ප්‍රණීත, වර්ණවත්, අවර්ණවත්, සුගතිගාමී, දුර්ගතිගාමී කර්මය අනුව උපදින සත්වයන් හඳුනයි. ස්වාමීනි, සත්වයන්ගේ චුතූපපාත ඥානයෙහි මෙය අනුත්තරීය වේ.",
      "paliTitle": "Cutūpapātañāṇadesanā",
      "englishTitle": "Knowledge of Decease and Rebirth Teaching",
      "sinhalaTitle": "චුතූපපාත ඥාණ දේශනාව"
    },
    {
      "number": 159,
      "pali": "‘‘Aparaṃ pana, bhante, etadānuttariyaṃ, yathā bhagavā dhammaṃ deseti iddhividhāsu. Dvemā, bhante, iddhividhāyo – atthi, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati. Atthi, bhante, iddhi anāsavā anupadhikā ‘ariyā’ti vuccati. ‘‘Katamā ca, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati? Idha, bhante, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya…pe… tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ iddhividhaṃ paccanubhoti. Ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāse. Pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake. Udakepi abhijjamāne gacchati, seyyathāpi pathaviyaṃ. Ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo. Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjati. Yāva brahmalokāpi kāyena vasaṃ vatteti. Ayaṃ, bhante, iddhi sāsavā saupadhikā, ‘no ariyā’ti vuccati. ‘‘Katamā pana, bhante, iddhi anāsavā anupadhikā, ‘ariyā’ti vuccati? Idha, bhante, bhikkhu sace ākaṅkhati – ‘paṭikūle appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘appaṭikūle paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca appaṭikūlasaññī vihareyya’nti, appaṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūle ca appaṭikūle ca paṭikūlasaññī vihareyya’nti, paṭikūlasaññī tattha viharati. Sace ākaṅkhati – ‘paṭikūlañca appaṭikūlañca tadubhayaṃ abhinivajjetvā upekkhako vihareyyaṃ sato sampajāno’ti, upekkhako tattha viharati sato sampajāno. Ayaṃ, bhante, iddhi anāsavā anupadhikā ‘ariyā’ti vuccati. Etadānuttariyaṃ, bhante, iddhividhāsu. Taṃ bhagavā asesamabhijānāti, taṃ bhagavato asesamabhijānato uttari abhiññeyyaṃ natthi, yadabhijānaṃ añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro assa yadidaṃ iddhividhāsu. ",
      "english": "\"Furthermore, venerable sir, this is the unsurpassed thing, how the Blessed One teaches the Dhamma concerning psychic powers. There are these two kinds of psychic powers, venerable sir. There is psychic power that is with taints, with acquisitions, called 'not noble.' There is psychic power that is without taints, without acquisitions, called 'noble.'\n\n\"And what, venerable sir, is psychic power that is with taints, with acquisitions, called 'not noble?' Here, venerable sir, some ascetic or brahmin, by striving…pe… attains such a concentration of mind that with the mind thus concentrated, he experiences various kinds of psychic power. Being one, he becomes many; being many, he becomes one. He appears and vanishes. He goes unimpeded through a wall, through an enclosure, through a mountain as if through space. He dives in and out of the earth as if in water. He walks on water without sinking as if on land. He travels in the sky cross-legged like a winged bird. He touches and strokes with his hand the moon and sun, so mighty and powerful. He wields bodily mastery even up to the Brahma world. This, venerable sir, is psychic power that is with taints, with acquisitions, called 'not noble.'\n\n\"But what, venerable sir, is psychic power that is without taints, without acquisitions, called 'noble?' Here, venerable sir, a bhikkhu, if he wishes, dwells perceiving what is repulsive as not repulsive, and he dwells perceiving what is not repulsive as repulsive. If he wishes, he dwells perceiving what is repulsive and not repulsive as not repulsive, and he dwells perceiving what is repulsive and not repulsive as repulsive. If he wishes, having abandoned both what is repulsive and not repulsive, he dwells equanimous, mindful and clearly comprehending. This, venerable sir, is psychic power that is without taints, without acquisitions, called 'noble.' This, venerable sir, is the unsurpassed thing concerning psychic powers. The Blessed One fully knows this, and there is nothing further to be known beyond what the Blessed One fully knows, concerning which another ascetic or brahmin would know more than the Blessed One in regard to psychic powers.\"",
      "sinhala": "‘‘තවද, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ සෘද්ධිවිධාවන්හි ධර්මය දේශනා කරන ආකාරය අනුත්තර වේ. ස්වාමීනි, මේ සෘද්ධිවිධ දෙකකි. ස්වාමීනි, ආශ්‍රව සහිත උපධි සහිත සෘද්ධියක් ඇත. එය ‘ආර්ය නොවේ’ යැයි කියනු ලැබේ. ස්වාමීනි, ආශ්‍රව රහිත උපධි රහිත ‘ආර්ය’ සෘද්ධියක් ඇත.’’\n\n‘‘ස්වාමීනි, ආශ්‍රව සහිත උපධි සහිත ‘ආර්ය නොවේ’ යැයි කියනු ලබන සෘද්ධිය කවරේද? ස්වාමීනි, මෙහි ඇතැම් ශ්‍රමණ හෝ බ්‍රාහ්මණ තැනැත්තෙක් වීර්යය කරමින්...පෙ.... යම් ආකාරයක චිත්ත සමාධියක් ස්පර්ශ කරයිද, එසේ සිත සමාහිත වූ කල්හි නොයෙක් ආකාර සෘද්ධිවිධ ප්‍රත්‍යක්ෂ කරන්නේය. එකෙක්ව සිට බොහෝ වෙයි. බොහෝ වෙලාත් එකෙක් වෙයි. වැසී සිටීමත්, මතුවීමත්, බිත්තිවලින් වැටවලින් හා පර්වතවලින් නොඇලී අහසෙහි මෙන් යයි. පොළොවෙහිද දියෙහි මෙන් කිමිදීමත් මතුවීමත් කරයි. දියෙහිද නොපැකිලී පොළොවෙහි මෙන් යයි. අහසෙහිද පක්ෂියෙක් මෙන් පලක් බැඳගෙන යයි. මෙබඳු මහත් ඍද්ධි ඇති, මෙබඳු මහත් ආනුභාව ඇති මේ හිරු සඳු දෙදෙනා පවා අතින් අතගා පිරිමදියි. බ්‍රහ්ම ලෝකය දක්වාද කයින් වසඟව පවත්වයි. ස්වාමීනි, මෙය ආශ්‍රව සහිත උපධි සහිත ‘ආර්ය නොවේ’ යැයි කියනු ලබන සෘද්ධියයි.’’\n\n‘‘ස්වාමීනි, ආශ්‍රව රහිත උපධි රහිත ‘ආර්ය’ යැයි කියනු ලබන සෘද්ධිය කවරේද? ස්වාමීනි, මෙහි භික්ෂුවක් කැමති නම් පිළිකුල් දෙයෙහි අප්‍රතිකුල සංඥා ඇතිව වාසය කරන්නේ නම්, එහි අප්‍රතිකුල සංඥා ඇතිව වාසය කරයි. අප්‍රතිකුල දෙයෙහි පිළිකුල් සංඥා ඇතිව වාසය කරන්නේ නම් එහි පිළිකුල් සංඥා ඇතිව වාසය කරයි. පිළිකුල් දෙයෙහිද අප්‍රතිකුල් දෙයෙහිද අප්‍රතිකුල සංඥා ඇතිව වාසය කරන්නේ නම් එහි අප්‍රතිකුල සංඥා ඇතිව වාසය කරයි. පිළිකුල් දෙයෙහිද අප්‍රතිකුල් දෙයෙහිද පිළිකුල් සංඥා ඇතිව වාසය කරන්නේ නම් එහි පිළිකුල් සංඥා ඇතිව වාසය කරයි. පිළිකුලද අප්‍රතිකුලද යන දෙකම දුරු කොට සිහි ඇතිව නුවණින් යුක්තව උපේක්ෂා සහගතව වාසය කරන්නේ නම් එහි සිහි ඇතිව නුවණින් යුක්තව උපේක්ෂා සහගතව වාසය කරයි. ස්වාමීනි, මෙය ආශ්‍රව රහිත උපධි රහිත ‘ආර්ය’ යැයි කියනු ලබන සෘද්ධියයි. ස්වාමීනි, මෙය සෘද්ධිවිධාවන්හි අනුත්තර වේ. එය භාග්‍යවතුන් වහන්සේ මුළුමනින්ම දන්නා සේක. එය භාග්‍යවතුන් වහන්සේ විසින් මුළුමනින්ම දන්නා දෙයට වඩා උසස් දැනගත යුතු දෙයක් නැත. එනම් යම් දැනීමකින් වෙනත් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේට වඩා වැඩි දැනුමක් ඇත්තෙක් වන්නේ නම්, එනම් සෘද්ධිවිධාවන්හිදීය.",
      "paliTitle": "Iddhividhadesanā",
      "englishTitle": "Discourse on Psychic Powers",
      "sinhalaTitle": "ඍද්ධිවිධ දේශනා"
    },
    {
      "number": 160,
      "pali": "‘‘Yaṃ taṃ, bhante, saddhena kulaputtena pattabbaṃ āraddhavīriyena thāmavatā purisathāmena purisavīriyena purisaparakkamena purisadhorayhena, anuppattaṃ taṃ bhagavatā. Na ca, bhante, bhagavā kāmesu kāmasukhallikānuyogamanuyutto hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ, na ca attakilamathānuyogamanuyutto dukkhaṃ anariyaṃ anatthasaṃhitaṃ. Catunnañca bhagavā jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī. ",
      "english": "\"Venerable sir, that which should be attained by a clansman who has faith, who is energetic, firm, strong, persevering, and unyielding, that has been attained by the Blessed One. And, venerable sir, the Blessed One is not addicted to sensual pleasure, which is low, coarse, worldly, ignoble, and unbeneficial, nor is he addicted to self-mortification, which is painful, ignoble, and unbeneficial. The Blessed One obtains at will, without trouble or difficulty, the four meditative absorptions, which are of the higher mind, which lead to pleasant abiding in this very life.\"",
      "sinhala": "‘‘ස්වාමීනි, යම් දෙයක් ශ්‍රද්ධාවන්ත කුලපුත්‍රයෙකු විසින් ලබාගත යුතු වන්නේ ද, වීර්යය ආරම්භ කළ, බලවත්, පුරුෂ ශක්තිය ඇති, පුරුෂ වීර්යය ඇති, පුරුෂ පරාක්‍රම ඇති, පුරුෂ ධෛර්යය ඇති අයෙකු විසින් ලබාගත යුතු වන්නේ ද, භාග්‍යවතුන් වහන්සේ විසින් එය ලබාගන්නා ලදී. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කාමයන්හි කාමසුඛල්ලිකානුයෝගයට යොමු වූයේ පහත් වූ, ග්‍රාම්‍ය වූ, පෘථග්ජන ස්වභාවයෙන් යුක්ත වූ, ආර්ය නොවන, අනර්ථ සහගත දෙයකට නොවේ. තවද ආත්ම ක්ලමථානුයෝගයට යොමු වූයේ දුක්ඛිත, ආර්ය නොවන, අනර්ථ සහගත දෙයකට ද නොවේ. භාග්‍යවතුන් වහන්සේ චිත්ත ඒකාග්‍රතාවයෙන් ලැබෙන, දිට්ඨධම්මසුඛවිහරණ වන සතර ධ්‍යානයන් කැමති පරිදි ලබන්නා වූ, අපහසුවකින් තොරව ලබන්නා වූ, වෙහෙසකින් තොරව ලබන්නා වූ කෙනෙකි.",
      "paliTitle": "Aññathāsatthuguṇadassanaṃ",
      "englishTitle": "Displaying the Teacher's Qualities Differently",
      "sinhalaTitle": "ශාස්‌තෘ ගුණ වෙනස් අයුරින් දැක්‌වීම"
    },
    {
      "number": 161,
      "pali": "‘‘Sace maṃ, bhante, evaṃ puccheyya – ‘kiṃ nu kho, āvuso sāriputta, ahesuṃ atītamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā bhiyyobhiññatarā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ. ‘Kiṃ panāvuso sāriputta, bhavissanti anāgatamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā bhiyyobhiññatarā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ. ‘Kiṃ panāvuso sāriputta, atthetarahi añño samaṇo vā brāhmaṇo vā bhagavatā bhiyyobhiññataro sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘no’ti vadeyyaṃ. ‘‘Sace pana maṃ, bhante, evaṃ puccheyya – ‘kiṃ nu kho, āvuso sāriputta, ahesuṃ atītamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘eva’nti vadeyyaṃ. ‘Kiṃ panāvuso sāriputta, bhavissanti anāgatamaddhānaṃ aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ, bhante, ‘‘eva’’nti vadeyyaṃ. ‘Kiṃ panāvuso sāriputta, atthetarahi aññe samaṇā vā brāhmaṇā vā bhagavatā samasamā sambodhiya’nti, evaṃ puṭṭho ahaṃ bhante ‘no’ti vadeyyaṃ. ‘‘Sace pana maṃ, bhante, evaṃ puccheyya – ‘kiṃ panāyasmā sāriputto ekaccaṃ abbhanujānāti, ekaccaṃ na abbhanujānātī’ti, evaṃ puṭṭho ahaṃ, bhante, evaṃ byākareyyaṃ – ‘sammukhā metaṃ, āvuso, bhagavato sutaṃ, sammukhā paṭiggahitaṃ – ‘‘ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā mayā samasamā sambodhiya’’nti. Sammukhā metaṃ, āvuso, bhagavato sutaṃ, sammukhā paṭiggahitaṃ – ‘‘bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā mayā samasamā sambodhiya’’nti. Sammukhā metaṃ, āvuso, bhagavato sutaṃ sammukhā paṭiggahitaṃ – ‘‘aṭṭhānametaṃ anavakāso yaṃ ekissā lokadhātuyā dve arahanto sammāsambuddhā apubbaṃ acarimaṃ uppajjeyyuṃ, netaṃ ṭhānaṃ vijjatī’’’ti. ‘‘Kaccāhaṃ, bhante, evaṃ puṭṭho evaṃ byākaramāno vuttavādī ceva bhagavato homi, na ca bhagavantaṃ abhūtena abbhācikkhāmi, dhammassa cānudhammaṃ byākaromi, na ca koci sahadhammiko vādānuvādo [vādānupāto (sī.)] gārayhaṃ ṭhānaṃ āgacchatī’’ti? ‘‘Taggha tvaṃ, sāriputta, evaṃ puṭṭho evaṃ byākaramāno vuttavādī ceva me hosi, na ca maṃ abhūtena abbhācikkhasi, dhammassa cānudhammaṃ byākarosi, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchatī’’ti. ",
      "english": "\"If, venerable sir, someone should ask me thus: ‘Friend Sāriputta, were there in the past any ascetics or brahmins who were more fully enlightened than the Blessed One?’ when asked thus, venerable sir, I would say ‘No.’ ‘Then, friend Sāriputta, will there be in the future any ascetics or brahmins who are more fully enlightened than the Blessed One?’ when asked thus, venerable sir, I would say ‘No.’ ‘Then, friend Sāriputta, is there now any ascetic or brahmin who is more fully enlightened than the Blessed One?’ when asked thus, venerable sir, I would say ‘No.’\n\n\"But if, venerable sir, someone should ask me thus: ‘Friend Sāriputta, were there in the past any ascetics or brahmins who were equal to the Blessed One in full enlightenment?’ when asked thus, venerable sir, I would say ‘Yes.’ ‘Then, friend Sāriputta, will there be in the future any ascetics or brahmins who are equal to the Blessed One in full enlightenment?’ when asked thus, venerable sir, I would say ‘Yes.’ ‘Then, friend Sāriputta, are there now any ascetics or brahmins who are equal to the Blessed One in full enlightenment?’ when asked thus, venerable sir, I would say ‘No.’\n\n\"But if, venerable sir, someone should ask me thus: ‘Then, venerable Sāriputta, do you acknowledge some and not acknowledge others?’ when asked thus, venerable sir, I would explain thus: ‘This I have heard and learned directly from the Blessed One: “In the past there were arahants, fully enlightened Buddhas, equal to me in full enlightenment.” This I have heard and learned directly from the Blessed One: “In the future there will be arahants, fully enlightened Buddhas, equal to me in full enlightenment.” This I have heard and learned directly from the Blessed One: “It is impossible, it cannot happen, that two arahants, fully enlightened Buddhas, should arise simultaneously in one world-system; such a thing is not possible.”’\n\n\"Thus, venerable sir, when asked thus and explaining thus, am I speaking in accordance with the Blessed One's words, not misrepresenting the Blessed One with an untruth, explaining in accordance with the Dhamma, so that no one who upholds the Dhamma could justly censure me?\"\n\n\"Surely, Sāriputta, when asked thus and explaining thus, you are speaking in accordance with my words, not misrepresenting me with an untruth, explaining in accordance with the Dhamma, so that no one who upholds the Dhamma could justly censure you.\"",
      "sinhala": "“ස්වාමීනී, යම්සේ මාගෙන් මෙසේ ඇසුවොත්, ‘සාරිපුත්ත ආයුෂ්මතුන්, අතීත කාලයෙහි භාග්‍යවතුන් වහන්සේට වඩා උතුම් වූ සම්බෝධියක් ඇති වෙනත් ශ්‍ර‍මණ බ්‍රාහ්මණයෝ සිටියෝදැ’යි මෙසේ ඇසූ කල්හි මම, ‘නැත’ යයි කියමි. ‘සාරිපුත්ත ආයුෂ්මතුන්, අනාගත කාලයෙහි භාග්‍යවතුන් වහන්සේට වඩා උතුම් වූ සම්බෝධියක් ඇති වෙනත් ශ්‍ර‍මණ බ්‍රාහ්මණයෝ වන්නාහුදැ’යි මෙසේ ඇසූ කල්හි මම, ‘නැත’ යයි කියමි. ‘සාරිපුත්ත ආයුෂ්මතුන්, දැන් භාග්‍යවතුන් වහන්සේට වඩා උතුම් වූ සම්බෝධියක් ඇති වෙනත් ශ්‍ර‍මණ බ්‍රාහ්මණයෙක් ඇත්තේදැ’යි මෙසේ ඇසූ කල්හි මම, ‘නැත’ යයි කියමි.”\n\n“ස්වාමීනී, යම්සේ මාගෙන් මෙසේ ඇසුවොත්, ‘සාරිපුත්ත ආයුෂ්මතුන්, අතීත කාලයෙහි භාග්‍යවතුන් වහන්සේ හා සමාන වූ සම්බෝධියක් ඇති වෙනත් ශ්‍ර‍මණ බ්‍රාහ්මණයෝ සිටියෝදැ’යි මෙසේ ඇසූ කල්හි මම, ‘එසේය’ යයි කියමි. ‘සාරිපුත්ත ආයුෂ්මතුන්, අනාගත කාලයෙහි භාග්‍යවතුන් වහන්සේ හා සමාන වූ සම්බෝධියක් ඇති වෙනත් ශ්‍ර‍මණ බ්‍රාහ්මණයෝ වන්නාහුදැ’යි මෙසේ ඇසූ කල්හි මම, ‘එසේය’ යයි කියමි. ‘සාරිපුත්ත ආයුෂ්මතුන්, දැන් භාග්‍යවතුන් වහන්සේ හා සමාන වූ සම්බෝධියක් ඇති වෙනත් ශ්‍ර‍මණ බ්‍රාහ්මණයෝ ඇත්තාහුදැ’යි මෙසේ ඇසූ කල්හි මම, ‘නැත’ යයි කියමි.”\n\n“ස්වාමීනී, යම්සේ මාගෙන් මෙසේ ඇසුවොත්, ‘සාරිපුත්ත ආයුෂ්මත්හු එකක් අනුමත කෙරෙත්, එකක් අනුමත නො කෙරෙත්දැ’යි මෙසේ ඇසූ කල්හි මම මෙසේ ප්‍ර‍කාශ කරමි. ‘ආයුෂ්මතුනි, මෙය මම භාග්‍යවතුන් වහන්සේගෙන් මුඛ්‍ය වශයෙන් ඇසීමි, මුඛ්‍ය වශයෙන් පිළිගතිමි. ‘මා හා සමාන වූ සම්බෝධිය ඇති අතීත කාලයෙහි අර්හත් සම්‍යක්සම්බුද්‍ධවරු වූහ’ යනුයි. ආයුෂ්මතුනි, මෙය මම භාග්‍යවතුන් වහන්සේගෙන් මුඛ්‍ය වශයෙන් ඇසීමි, මුඛ්‍ය වශයෙන් පිළිගතිමි. ‘මා හා සමාන වූ සම්බෝධිය ඇති අනාගත කාලයෙහි අර්හත් සම්‍යක්සම්බුද්‍ධවරු වන්නාහ’ යනුයි. ආයුෂ්මතුනි, මෙය මම භාග්‍යවතුන් වහන්සේගෙන් මුඛ්‍ය වශයෙන් ඇසීමි, මුඛ්‍ය වශයෙන් පිළිගතිමි. ‘එක ලෝක ධාතුවක පළමු නොවූ, අන්තිම නොවූ අර්හත් සම්‍යක්සම්බුද්‍ධවරු දෙදෙනෙක් උපදනාහු නම්, එය එසේ වීමට හේතුවක් නැත. එබඳු තැනක් නැත’ යනුයි.”\n\n“ස්වාමීනී, මෙසේ මා ඇසූ විට මෙසේ ප්‍ර‍කාශ කරන්නා වූ මම භාග්‍යවතුන් වහන්සේගේ සත්‍යවාදී වන්නෙම්ද? භාග්‍යවතුන් වහන්සේ බොරුවෙන් චෝදනා නොකරන්නෙම්ද? ධර්මයට අනුව ධර්මය ප්‍ර‍කාශ කරන්නෙම්ද? තවද කිසිම සහධර්මික වාදයක් නින්දිත තැනකට නොපැමිණේද?”\n\n“සාරිපුත්ත, තෙපි මෙසේ ඇසූ විට මෙසේ ප්‍ර‍කාශ කරන්නාහු මාගේ සත්‍යවාදී ම වන්නාහුය. තවද මට බොරුවෙන් චෝදනා නොකරන්නාහුය. ධර්මයට අනුව ධර්මය ප්‍ර‍කාශ කරන්නාහුය. තවද කිසිම සහධර්මික වාදයක් නින්දිත තැනකට නොපැමිණෙන්නේය.”",
      "paliTitle": "Anuyogadānappakāro",
      "englishTitle": "Method of Administering Examination",
      "sinhalaTitle": "අනුයෝග දීමේ ආකාරය"
    },
    {
      "number": 162,
      "pali": "Evaṃ vutte, āyasmā udāyī bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante, tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissati! Ekamekañcepi ito, bhante, dhammaṃ aññatitthiyā paribbājakā attani samanupasseyyuṃ, te tāvatakeneva paṭākaṃ parihareyyuṃ. Acchariyaṃ, bhante, abbhutaṃ, bhante, tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃ mahiddhiko evaṃmahānubhāvo. Atha ca pana nevattānaṃ pātukarissatī’’ti! ‘‘Passa kho tvaṃ, udāyi, ‘tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissati’! Ekamekañcepi ito, udāyi, dhammaṃ aññatitthiyā paribbājakā attani samanupasseyyuṃ, te tāvatakeneva paṭākaṃ parihareyyuṃ. Passa kho tvaṃ, udāyi, ‘tathāgatassa appicchatā santuṭṭhitā sallekhatā. Yatra hi nāma tathāgato evaṃmahiddhiko evaṃmahānubhāvo, atha ca pana nevattānaṃ pātukarissatī’’’ti!",
      "english": "When this was said, venerable Udāyī said this to the Blessed One: \"It is wonderful, venerable sir, it is amazing, venerable sir, how the Tathāgata is of few desires, content, and of a life of simplicity. For even though the Tathāgata is so mighty, so powerful, yet he does not show himself off! If other sectarians, wanderers, were to perceive even one single quality of this sort in themselves, they would carry a banner because of just that. It is wonderful, venerable sir, it is amazing, venerable sir, how the Tathāgata is of few desires, content, and of a life of simplicity. For even though the Tathāgata is so mighty, so powerful, yet he does not show himself off!\" \"Do you see, Udāyī, that the Tathāgata is of few desires, content, and of a life of simplicity? For even though the Tathāgata is so mighty, so powerful, yet he does not show himself off! If other sectarians, wanderers, were to perceive even one single quality of this sort in themselves, they would carry a banner because of just that. Do you see, Udāyī, that the Tathāgata is of few desires, content, and of a life of simplicity? For even though the Tathāgata is so mighty, so powerful, yet he does not show himself off?\"",
      "sinhala": "‘‘මෙසේ වදාළ කල්හි, ආයුෂ්මත් උදායී භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ. “ස්වාමීනී, තථාගතයන් වහන්සේගේ අල්පේච්ඡතාවය, සന്തുෂ්ඨිය, සල්ලේඛතාවය පුදුම සහගතය, අද්භූතය. මන්ද යත්, තථාගතයන් වහන්සේ මෙතරම් මහත් ඉර්ධි ඇත්තාහු ද, මෙතරම් මහත් ආනුභාව ඇත්තාහු ද වුව ද තමන් නොපෙන්වන සේක! ස්වාමීනී, මෙයින් එක ධර්මයක් හෝ අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ තමන් තුළින් දුටුවෝ නම්, ඔවුහු ඒ පමණකින් ම කොඩි ඔසවන්නාහ. ස්වාමීනී, තථාගතයන් වහන්සේගේ අල්පේච්ඡතාවය, සന്തുෂ්ඨිය, සල්ලේඛතාවය පුදුම සහගතය, අද්භූතය. මන්ද යත්, තථාගතයන් වහන්සේ මෙතරම් මහත් ඉර්ධි ඇත්තාහු ද, මෙතරම් මහත් ආනුභාව ඇත්තාහු ද වුව ද තමන් නොපෙන්වන සේක!” “උදායී, තථාගතයන් වහන්සේගේ අල්පේච්ඡතාවය, සന്തുෂ්ඨිය, සල්ලේඛතාවය ඔබ ද දකීව. මන්ද යත්, තථාගතයන් වහන්සේ මෙතරම් මහත් ඉර්ධි ඇත්තාහු ද, මෙතරම් මහත් ආනුභාව ඇත්තාහු ද වුව ද තමන් නොපෙන්වන සේක! උදායී, මෙයින් එක ධර්මයක් හෝ අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ තමන් තුළින් දුටුවෝ නම්, ඔවුහු ඒ පමණකින් ම කොඩි ඔසවන්නාහ. උදායී, තථාගතයන් වහන්සේගේ අල්පේච්ඡතාවය, සന്തുෂ්ඨිය, සල්ලේඛතාවය ඔබ ද දකීව. මන්ද යත්, තථාගතයන් වහන්සේ මෙතරම් මහත් ඉර්ධි ඇත්තාහු ද, මෙතරම් මහත් ආනුභාව ඇත්තාහු ද වුව ද තමන් නොපෙන්වන සේක!”’",
      "paliTitle": "Acchariyaabbhutaṃ",
      "englishTitle": "The Amazing and Wonderful",
      "sinhalaTitle": "ආශ්‍චර්‍ය අද්භූත"
    },
    {
      "number": 163,
      "pali": "Atha kho bhagavā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘tasmā tiha tvaṃ, sāriputta, imaṃ dhammapariyāyaṃ abhikkhaṇaṃ bhāseyyāsi bhikkhūnaṃ bhikkhunīnaṃ upāsakānaṃ upāsikānaṃ. Yesampi hi, sāriputta, moghapurisānaṃ bhavissati tathāgate kaṅkhā vā vimati vā, tesamimaṃ dhammapariyāyaṃ sutvā tathāgate kaṅkhā vā vimati vā, sā pahīyissatī’’ti. Iti hidaṃ āyasmā sāriputto bhagavato sammukhā sampasādaṃ pavedesi. Tasmā imassa veyyākaraṇassa sampasādanīyaṃ tveva adhivacananti. ",
      "english": "Then the Blessed One addressed the venerable Sariputta, \"Therefore, Sariputta, you should frequently expound this discourse on the Dhamma to monks, nuns, laymen, and laywomen. For those foolish people who may have doubt or uncertainty about the Tathagata, upon hearing this discourse on the Dhamma, that doubt or uncertainty about the Tathagata will be abandoned.\" Thus, the venerable Sariputta expressed his confidence in the presence of the Blessed One. Therefore, this exposition should be called \"Inspiring Confidence.\"",
      "sinhala": "එකල්හි භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් සාරිපුත්තයන් අමතා මෙසේ වදාළ සේක: “සාරිපුත්ත, එහෙයින් තෙමේ මේ ධර්ම පර්යාය නිතර නිතර භික්ෂූන්ටත්, භික්ෂුණීන්ටත්, උපාසකයන්ටත්, උපාසිකාවන්ටත් දේශනා කරව. සාරිපුත්ත, යම් මෝඝ පුරුෂයන්ට තථාගතයන් කෙරෙහි සැකයක් හෝ විමතියක් හෝ ඇද්ද, ඔවුන් මේ ධර්ම පර්යාය ශ්‍රවණය කිරීමෙන් තථාගතයන් කෙරෙහි ඇති සැකය හෝ විමතිය හෝ දුරු වන්නේය.” ආයුෂ්මත් සාරිපුත්තයන් භාග්‍යවතුන් වහන්සේ ඉදිරියේ මෙසේ සතුට ප්‍රකාශ කළේය. එහෙයින් මේ ව්‍යාකරණයට ‘සම්පසාදනීය’ යන නාමයම වේ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Sampasādanīyasuttaṃ niṭṭhitaṃ pañcamaṃ.",
    "english": "The Fifth Sampasādanīya Sutta Concluded",
    "sinhala": "පස්වැනි සම්පසාදනීය සූත්‍රය නිමයි."
  }
}