{
  "id": "dn6",
  "title": {
    "pali": "Pāsādikasuttaṃ",
    "english": "The Delightful Discourse",
    "sinhala": "පාසාදික සූත්‍රය"
  },
  "sections": [
    {
      "number": 164,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sakkesu viharati vedhaññā nāma sakyā, tesaṃ ambavane pāsāde. Tena kho pana samayena nigaṇṭho nāṭaputto [nāthaputto (sī. pī.)] pāvāyaṃ adhunākālaṅkato hoti. Tassa kālaṅkiriyāya bhinnā nigaṇṭhā dvedhikajātā bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti – ‘‘na tvaṃ imaṃ dhammavinayaṃ ājānāsi, ahaṃ imaṃ dhammavinayaṃ ājānāmi, kiṃ tvaṃ imaṃ dhammavinayaṃ ājānissasi? Micchāpaṭipanno tvamasi, ahamasmi sammāpaṭipanno. Sahitaṃ me, asahitaṃ te. Purevacanīyaṃ pacchā avaca, pacchāvacanīyaṃ pure avaca. Adhiciṇṇaṃ te viparāvattaṃ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosī’’ti. Vadhoyeva kho [vadhoyeveko (ka.)] maññe nigaṇṭhesu nāṭaputtiyesu vattati [anuvattati (syā. ka.)]. Yepi nigaṇṭhassa nāṭaputtassa sāvakā gihī odātavasanā, tepi [te tesu (ka.)] nigaṇṭhesu nāṭaputtiyesu nibbinnarūpā [nibbindarūpā (ka.)] virattarūpā paṭivānarūpā, yathā taṃ durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite bhinnathūpe appaṭisaraṇe.",
      "english": "Thus have I heard: At one time the Blessed One was living among the Sakyans at Vedhaññā, a town of the Sakyans, in their ambavana palace. At that time Nigaṇṭha Nāṭaputta had recently died in Pāvā. Because of his death, the Nigaṇṭhas were divided, split into two factions, quarrelsome, given to disputes, engaged in arguments, stabbing one another with verbal daggers, saying: \"You do not understand this teaching and discipline, I understand this teaching and discipline. How could you understand this teaching and discipline? You are practicing wrongly, I am practicing rightly. What I say is consistent, what you say is inconsistent. You said what should have been said earlier, later; you said what should have been said later, earlier. What you have long practiced is reversed. Your doctrine has been refuted. You are defeated. Go away to refute the doctrine, or disentangle yourself if you can.\" Indeed, it was as if slaughter was taking place among the Nigaṇṭhas, the followers of Nāṭaputta. And those lay followers of Nigaṇṭha Nāṭaputta, who were clad in white, were disgusted, averse, and repelled by those Nigaṇṭhas, the followers of Nāṭaputta, because of the Dhamma and discipline that was badly expounded, poorly taught, not leading out, not conducive to peace, proclaimed by one who is not a fully enlightened Buddha, with a broken stupa, and without refuge.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී: එක් කලෙක භාග්‍යවතුන් වහන්සේ ශාක්‍යයන්ගේ වේදඤ්ඤා නම් නියම් ගමෙහි, ඔවුන්ගේ අඹ වනයෙහි ප්‍රාසාදයක වැඩ වාසය කළහ. එකල්හි නාථපුත්‍ර වූ නිගණ්ඨයා පාවා නුවරදී මෑතකාලයේ මරණයට පත්විය. ඔහු මිය යාමෙන් පසු නිගණ්ඨයෝ භේද වූවෝ, දෙකට බෙදුණෝ, බහින්බස් වූවෝ, කලහ කෙරුවෝ, විවාදයට පැමිණියෝ, එකිනෙකා මුවින් මූණට අවලාද නගමින් වාසය කළහ. \"නුඹ මේ ධර්ම විනය නො දන්නෙහි. මම මේ ධර්ම විනය දනිමි. නුඹ කෙසේ මේ ධර්ම විනය දැන ගන්නෙහි ද? නුඹ වැරදි පිළිවෙතෙහි ඇත්තෙහිය. මම යහපත් පිළිවෙතෙහි ඇත්තෙමි. මාගේ වචන හොඳින් පිළිගන්න. නුඹේ වචන එසේ පිළිගත යුතු නොවේ. පළමුව කිය යුතු වචන පසුව කීවෙහිය. පසුව කිය යුතු වචන පළමුව කීවෙහිය. නුඹේ මතය හොඳින් සලකා වෙනස් කරන ලදී. නුඹේ වාදය බිඳ හෙළන ලදී. නුඹ පරාජය කරන ලදී. එබැවින් වාදයෙන් මිදීමට යන්න. හැකි නම් වාදය සමථයකට පත් කරව.\" යනුවෙනි. නාථපුත්‍ර වූ නිගණ්ඨයන් අතරෙහි නිතරම වාද විවාද පවතින බව මට හැඟේ. එසේම, නාථපුත්‍ර වූ නිගණ්ඨයාගේ ගිහි ශ්‍රාවකයෝ ද සුදු වස්ත්‍ර හැඳ, එම නිගණ්ඨයන් කෙරෙහි කලකිරුණු ස්වභාවයෙන්, විරක්ත වූ ස්වභාවයෙන්, පිළිකුල් වූ ස්වභාවයෙන් යුක්ත වූහ. මන්ද යත්, එම ධර්ම විනය දුර්වල ලෙස දේශනා කරන ලද්දේ ද, අවබෝධ කර ගැනීමට අපහසු වූයේ ද, නිවනට මඟක් නො වූයේ ද, සිත සන්සුන් කිරීමට හේතු නො වූයේ ද, සම්මා සම්බුදුන් විසින් දේශනා කරන ලද්දක් නො වූයේ ද, බිඳුණු ස්ථූපයක් මෙන් වූයේ ද, සරණක් නො වූයේ ද, එබැවිනි.",
      "paliTitle": "Nigaṇṭhanāṭaputtakālaṅkiriyā",
      "englishTitle": "The Death of Nigaṇṭha Nāṭaputta",
      "sinhalaTitle": "නිගණ්ඨ නාටපුත්ත කාලක්‍රියාව"
    },
    {
      "number": 165,
      "pali": "Atha kho cundo samaṇuddeso pāvāyaṃ vassaṃvuṭṭho [vassaṃvuttho (sī. syā. pī.)] yena sāmagāmo, yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho cundo samaṇuddeso āyasmantaṃ ānandaṃ etadavoca – ‘‘nigaṇṭho, bhante, nāṭaputto pāvāyaṃ adhunākālaṅkato. Tassa kālaṅkiriyāya bhinnā nigaṇṭhā dvedhikajātā…pe… bhinnathūpe appaṭisaraṇe’’ti. Evaṃ vutte, āyasmā ānando cundaṃ samaṇuddesaṃ etadavoca – ‘‘atthi kho idaṃ, āvuso cunda, kathāpābhataṃ bhagavantaṃ dassanāya. Āyāmāvuso cunda, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā etamatthaṃ bhagavato ārocessāmā’’ti [āroceyyāmāti (syā.)]. ‘‘Evaṃ, bhante’’ti kho cundo samaṇuddeso āyasmato ānandassa paccassosi. Atha kho āyasmā ca ānando cundo ca samaṇuddeso yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘ayaṃ, bhante, cundo samaṇuddeso evamāha, ‘nigaṇṭho, bhante, nāṭaputto pāvāyaṃ adhunākālaṅkato, tassa kālaṅkiriyāya bhinnā nigaṇṭhā…pe… bhinnathūpe appaṭisaraṇe’’’ti. ",
      "english": "Then the novice Cunda, having spent the rainy season in Pava, went to Samagama, to the venerable Ananda; having gone there, he greeted the venerable Ananda and sat down to one side. Sitting to one side, the novice Cunda said this to the venerable Ananda: \"Venerable sir, Nigantha Nataputta has recently passed away in Pava. With his passing away, the Niganthas have split into two factions… leading to… broken stupas, without refuge.\" When this was said, the venerable Ananda said this to the novice Cunda: \"There is indeed, friend Cunda, a suitable topic for seeing the Blessed One. Come, friend Cunda, let us go to the Blessed One; having gone there, we will report this matter to the Blessed One.\" \"Yes, venerable sir,\" the novice Cunda replied to the venerable Ananda. Then the venerable Ananda and the novice Cunda went to the Blessed One; having gone there, they greeted the Blessed One and sat down to one side. Sitting to one side, the venerable Ananda said this to the Blessed One: \"This, venerable sir, is what the novice Cunda says: 'Venerable sir, Nigantha Nataputta has recently passed away in Pava, with his passing away, the Niganthas have split… leading to… broken stupas, without refuge.'\"",
      "sinhala": "අථ ඛො චුන්දො සමණුද්දෙසො පාවායං වස්සංවුට්ඨො යෙන සාමගාමො, යෙනායස්මා ආනන්දො තෙනුපසඞ්කමි; උපසඞ්කමිත්වා ආයස්මන්තං ආනන්දං අභිවාදෙත්වා එකමන්තං නිසීදි. එකමන්තං නිසින්නො ඛො චුන්දො සමණුද්දෙසො ආයස්මන්තං ආනන්දං එතදවොච – ‘‘නිගණ්ඨො, භන්තෙ, නාටපුත්තො පාවායං අධුනාකාලඞ්කතො. තස්ස කාලඞ්කිරියාය භින්නා නිගණ්ඨා ද්වෙධිකජාතා…පෙ… භින්නථූපෙ අප්පටිසරණෙ’’ති. එවං වුත්තෙ, ආයස්මා ආනන්දො චුන්දං සමණුද්දෙසං එතදවොච – ‘‘අත්ථි ඛො ඉදං, ආවුසො චුන්ද, කථාපාභතං භගවන්තං දස්සනාය. ආයාමාවුසො චුන්ද, යෙන භගවා තෙනුපසඞ්කමිස්සාම; උපසඞ්කමිත්වා එතමත්‍ථං භගවතො ආරොචෙස්සාමා’’ති. ‘‘එවං, භන්තෙ’’ති ඛො චුන්දො සමණුද්දෙසො ආයස්මතො ආනන්දස්ස පච්චස්සොසි. අථ ඛො ආයස්මා ච ආනන්දො ච චුන්දො ච සමණුද්දෙසො යෙන භගවා තෙනුපසඞ්කමිංසු; උපසඞ්කමිත්වා භගවන්තං අභිවාදෙත්වා එකමන්තං නිසීදිංසු. එකමන්තං නිසින්නො ඛො ආයස්මා ආනන්දො භගවන්තං එතදවොච – ‘‘අයං, භන්තෙ, චුන්දො සමණුද්දෙසො එවමාහ, ‘නිගණ්ඨො, භන්තෙ, නාටපුත්තො පාවායං අධුනාකාලඞ්කතො, තස්ස කාලඞ්කිරියාය භින්නා නිගණ්ඨා…පෙ… භින්නථූපෙ අප්පටිසරණෙ’’’ති.",
      "paliTitle": ""
    },
    {
      "number": 166,
      "pali": "‘‘Evaṃ hetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite. Idha, cunda, satthā ca hoti asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito, sāvako ca tasmiṃ dhamme na dhammānudhammappaṭipanno viharati na sāmīcippaṭipanno na anudhammacārī, vokkamma ca tamhā dhammā vattati. So evamassa vacanīyo – ‘tassa te, āvuso, lābhā, tassa te suladdhaṃ, satthā ca te asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito. Tvañca tasmiṃ dhamme na dhammānudhammappaṭipanno viharasi, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattasī’ti. Iti kho, cunda, satthāpi tattha gārayho, dhammopi tattha gārayho, sāvako ca tattha evaṃ pāsaṃso. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘etāyasmā tathā paṭipajjatu, yathā te satthārā dhammo desito paññatto’ti. Yo ca samādapeti [samādāpeti (sī. ṭṭha.)], yañca samādapeti, yo ca samādapito [samādāpito (sī. ṭṭha.)] tathattāya paṭipajjati. Sabbe te bahuṃ apuññaṃ pasavanti. Taṃ kissa hetu? Evaṃ hetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite.",
      "english": "\"Thus it is, Cunda, in a doctrine and discipline that is poorly proclaimed, badly expounded, not leading out, not conducive to peace, and proclaimed by one who is not a fully enlightened Buddha. Here, Cunda, the teacher is not a fully enlightened Buddha, and the Dhamma is poorly proclaimed, badly expounded, not leading out, not conducive to peace, and proclaimed by one who is not a fully enlightened Buddha; and the disciple in that Dhamma does not live practicing according to the Dhamma, practicing properly, living in accordance with the Dhamma, and deviates from that Dhamma. One should say this to him: ‘It is a gain for you, friend, it is well gained for you, that your teacher is not a fully enlightened Buddha, and the Dhamma is poorly proclaimed, badly expounded, not leading out, not conducive to peace, and proclaimed by one who is not a fully enlightened Buddha; and you in that Dhamma do not live practicing according to the Dhamma, practicing properly, living in accordance with the Dhamma, and deviate from that Dhamma.’ Thus, Cunda, the teacher there is blameworthy, the Dhamma there is blameworthy, and the disciple there is praised in this way. Cunda, whoever should say this to a disciple of such a kind: ‘Let the venerable one practice in this way, just as the Dhamma has been taught and established by your teacher;’ and whoever encourages him, and whatever he encourages him with, and whoever, being encouraged, practices accordingly—all of them generate much demerit. Why is that? Thus it is, Cunda, in a doctrine and discipline that is poorly proclaimed, badly expounded, not leading out, not conducive to peace, and proclaimed by one who is not a fully enlightened Buddha.\"",
      "sinhala": "‘‘චුන්ද, දුර්‍වාක්‍ය වූ, මනාකොට නොපැවසූ, නිවනට නොපමුණුවන, උපසමයට නොපමුණුවන, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් නොපවසන ලද ධර්ම විනයෙහි මෙසේ වන්නේ ය. චුන්ද, මෙහි ශාස්තෘවරයා සම්මා සම්බුද්ධ නොවෙයි. ධර්මය ද දුර්‍වාක්‍ය වේ. මනාකොට නොපැවසූ, නිවනට නොපමුණුවන, උපසමයට නොපමුණුවන, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් නොපවසන ලද්දේ වෙයි. ශ්‍රාවකයා ද ඒ ධර්මයෙහි ධර්‍මානුධර්‍ම ප‍්‍රතිපදාවෙහි නොහැසිරෙයි. සාමීචි ප‍්‍රතිපදාවෙහි නොහැසිරෙයි. අනුධර්‍මචාරී ව නොහැසිරෙයි. ඒ ධර්‍මයෙන් බැහැර ව හැසිරෙයි. ඔහුට මෙසේ පැවසිය යුතු ය. ‘ඇවැත්නි, එය ඔබගේ ලාභයෙකි. එය ඔබ විසින් මනාව ලද්දෙකි. ඔබගේ ශාස්තෘවරයා සම්මා සම්බුදු නොවෙයි. ධර්මය ද දුර්‍වාක්‍ය ය. මනාකොට නොපැවසූ, නිවනට නොපමුණුවන, උපසමයට නොපමුණුවන, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් නොපවසන ලද්දේ වෙයි. ඔබ ද ඒ ධර්මයෙහි ධර්‍මානුධර්‍ම ප‍්‍රතිපදාවෙහි නොහැසිරෙහු ය. සාමීචි ප‍්‍රතිපදාවෙහි නොහැසිරෙහු ය. අනුධර්‍මචාරී ව නොහැසිරෙහු ය. ඒ ධර්‍මයෙන් බැහැර ව හැසිරෙහු’ යි. චුන්ද, මෙසේ ශාස්තෘවරයා ද එහි ගර්‍හා කළ යුතු වෙයි. ධර්මය ද එහි ගර්‍හා කළ යුතු වෙයි. ශ්‍රාවකයා ද එහි මෙසේ ප‍්‍රශංසා කළ යුතු වෙයි. චුන්ද, යමෙක් එබඳු ශ්‍රාවකයෙකුට ‘මේ ආයුෂ්මත් ඒකාන්තයෙන් ශාස්තෘවරයා විසින් යම් ධර්මයක් දේශනා කරන ලද්දේ ද, පණවන ලද්දේ ද, එසේ ප‍්‍රතිපදාවෙහි යෙදේවා’ යි කියන්නේ ද, යමෙක් සමාදන් කරවන්නේ ද, යමෙක් සමාදන් කරවන්නේ ද, යමෙක් සමාදන් කරවන ලද්දේ එබඳු බව පිණිස ප‍්‍රතිපදාවෙහි යෙදේ ද, ඒ සියල්ලෝ බොහෝ පව් රැස් කර ගනිති. එය කවර හෙයින් ද? චුන්ද, දුර්‍වාක්‍ය වූ, මනාකොට නොපැවසූ, නිවනට නොපමුණුවන, උපසමයට නොපමුණුවන, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් නොපවසන ලද ධර්ම විනයෙහි මෙසේ වන්නේ ය.",
      "paliTitle": "Asammāsambuddhappaveditadhammavinayo",
      "englishTitle": "The Doctrine and Discipline of the Perfectly Enlightened One",
      "sinhalaTitle": "අසම්මාසම්බුදුන් විසින් ප්‍ර‌කාශිත ධර්ම විනය"
    },
    {
      "number": 167,
      "pali": "‘‘Idha pana, cunda, satthā ca hoti asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito, sāvako ca tasmiṃ dhamme dhammānudhammappaṭipanno viharati sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattati. So evamassa vacanīyo – ‘tassa te, āvuso, alābhā, tassa te dulladdhaṃ, satthā ca te asammāsambuddho, dhammo ca durakkhāto duppavedito aniyyāniko anupasamasaṃvattaniko asammāsambuddhappavedito. Tvañca tasmiṃ dhamme dhammānudhammappaṭipanno viharasi sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattasī’ti. Iti kho, cunda, satthāpi tattha gārayho, dhammopi tattha gārayho, sāvakopi tattha evaṃ gārayho. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘addhāyasmā ñāyappaṭipanno ñāyamārādhessatī’ti. Yo ca pasaṃsati, yañca pasaṃsati, yo ca pasaṃsito bhiyyoso mattāya vīriyaṃ ārabhati. Sabbe te bahuṃ apuññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ, cunda, hoti durakkhāte dhammavinaye duppavedite aniyyānike anupasamasaṃvattanike asammāsambuddhappavedite. ",
      "english": "\"Here, Cunda, the teacher is not a fully enlightened Buddha, and the Dhamma is poorly expounded, badly taught, not leading out, not leading to peace, and expounded by one who is not a fully enlightened Buddha; and the disciple lives practicing the Dhamma in accordance with the Dhamma, practicing properly, living in accordance with the Dhamma, and adhering to that Dhamma. He should be addressed in this way: ‘It is a loss for you, friend, it is a misfortune for you, that your teacher is not a fully enlightened Buddha, and the Dhamma is poorly expounded, badly taught, not leading out, not leading to peace, and expounded by one who is not a fully enlightened Buddha. And you live practicing the Dhamma in accordance with the Dhamma, practicing properly, living in accordance with the Dhamma, and adhering to that Dhamma.’ Thus, Cunda, the teacher is blameworthy in that case, the Dhamma is blameworthy in that case, and the disciple is blameworthy in that way. Whoever, Cunda, should say to such a disciple, ‘Assuredly, the venerable one is practicing according to the way, he will perfect the way,’ and whoever praises him, and whatever he praises, and the one who is praised exerts even more effort, all of them generate much demerit. Why is that? Because, Cunda, it is like this in a Dhamma and Discipline that is poorly expounded, badly taught, not leading out, not leading to peace, and expounded by one who is not a fully enlightened Buddha.\"",
      "sinhala": "‘‘නමුත්, චුන්ද, මෙහි ශාස්තෘවරයා අසම්මා සම්බුද්ධ වෙයි. ධර්මය දුර්‍වල ලෙස දේශනා කරන ලද්දක්, අවබෝධ කරවීමට අපහසු, නිවනට මඟ නොවන, උපසමාධියට හේතු නොවන, අසම්මා සම්බුද්ධ විසින් දේශනා කරන ලද්දක් වෙයි. ශ්‍රාවකයා ද එම ධර්මයෙහි ධර්මානුධර්ම ප්‍රතිපදාවෙහි හැසිරෙමින්, යහපත් පිළිවෙතෙහි හැසිරෙමින්, ධර්මයට අනුකූලව හැසිරෙමින්, ඒ ධර්මය සමාදන්ව ප්‍රවෘත්ති වෙයි. ඔහුට මෙසේ පැවසිය යුතුයි. ‘ඇවැත්නි, එය ඔබට අලාභයකි. එය ඔබට දුර්ලභයකි. මන්ද ඔබේ ශාස්තෘවරයා අසම්මා සම්බුද්ධ වන අතර, ධර්මය දුර්‍වල ලෙස දේශනා කරන ලද්දක්, අවබෝධ කරවීමට අපහසු, නිවනට මඟ නොවන, උපසමාධියට හේතු නොවන, අසම්මා සම්බුද්ධ විසින් දේශනා කරන ලද්දක් වන බැවිනි. ඔබ ද එම ධර්මයෙහි ධර්මානුධර්ම ප්‍රතිපදාවෙහි හැසිරෙමින්, යහපත් පිළිවෙතෙහි හැසිරෙමින්, ධර්මයට අනුකූලව හැසිරෙමින්, ඒ ධර්මය සමාදන්ව ප්‍රවෘත්ති වන්නෙහිය.’ චුන්ද, මෙසේ ශාස්තෘවරයා ද ගැරහීමට ලක්විය යුත්තේය. ධර්මය ද ගැරහීමට ලක්විය යුත්තේය. ශ්‍රාවකයා ද එලෙසින්ම ගැරහීමට ලක්විය යුත්තේය. චුන්ද, යමෙක් එබඳු ශ්‍රාවකයෙකුට මෙසේ කියන්නේ නම්, ‘ආයුෂ්මතුන් නිවැරදි මාර්ගයේ ගමන් කරන්නේය, නිවැරදි මාර්ගය සාක්ෂාත් කර ගන්නේය’ කියා, සහ යමෙක් ප්‍රශංසා කරන්නේ ද, යමෙක් ප්‍රශංසාවට ලක් කරන්නේ ද, යමෙක් ප්‍රශංසාවට ලක් වූ තැනැත්තා ඉතා සතුටින් වීර්යය වඩන්නේ ද, ඒ සියල්ලෝම බොහෝ අකුසල් රැස් කර ගනිති. එය කවර හේතුවක් නිසාද? චුන්ද, දුර්වල ලෙස දේශනා කරන ලද, අවබෝධ කරවීමට අපහසු, නිවනට මඟ නොවන, උපසමාධියට හේතු නොවන, අසම්මා සම්බුද්ධ විසින් දේශනා කරන ලද ධර්ම විනයෙහි මෙසේම වන්නේය.\"",
      "paliTitle": ""
    },
    {
      "number": 168,
      "pali": "‘‘Idha pana, cunda, satthā ca hoti sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, sāvako ca tasmiṃ dhamme na dhammānudhammappaṭipanno viharati, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattati. So evamassa vacanīyo – ‘tassa te, āvuso, alābhā, tassa te dulladdhaṃ, satthā ca te sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Tvañca tasmiṃ dhamme na dhammānudhammappaṭipanno viharasi, na sāmīcippaṭipanno, na anudhammacārī, vokkamma ca tamhā dhammā vattasī’ti. Iti kho, cunda, satthāpi tattha pāsaṃso, dhammopi tattha pāsaṃso, sāvako ca tattha evaṃ gārayho. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘etāyasmā tathā paṭipajjatu yathā te satthārā dhammo desito paññatto’ti. Yo ca samādapeti, yañca samādapeti, yo ca samādapito tathattāya paṭipajjati. Sabbe te bahuṃ puññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ, cunda, hoti svākkhāte dhammavinaye suppavedite niyyānike upasamasaṃvattanike sammāsambuddhappavedite.",
      "english": "But here, Cunda, the Teacher is a fully enlightened Buddha, and the Dhamma is well-proclaimed, well-expounded, leading to liberation, conducive to peace, proclaimed by the fully enlightened Buddha, but the disciple does not live practicing the Dhamma in accordance with the Dhamma, nor does he live conscientiously, nor is he practicing according to the Dhamma, and he turns away from that Dhamma. He should be told thus: ‘It is a loss for you, friend, it is ill-gained for you, that your Teacher is a fully enlightened Buddha, and the Dhamma is well-proclaimed, well-expounded, leading to liberation, conducive to peace, proclaimed by the fully enlightened Buddha. But you do not live practicing the Dhamma in accordance with the Dhamma, nor do you live conscientiously, nor are you practicing according to the Dhamma, and you turn away from that Dhamma.’ Thus, Cunda, the Teacher is praiseworthy there, the Dhamma is praiseworthy there, and the disciple is blameworthy there. Whoever, Cunda, should say this to such a disciple: ‘May this venerable one practice in such a way as the Dhamma has been taught and established by your Teacher.’ And whoever encourages, and the thing he encourages, and whoever being encouraged practices accordingly. All of them generate much merit. Why is that? Because it is indeed like this, Cunda, in a Dhamma and Discipline that is well-proclaimed, well-expounded, leading to liberation, conducive to peace, proclaimed by the fully enlightened Buddha.",
      "sinhala": "‘‘චුන්ද, මෙහි ශාස්තෘවරයා සම්‍යක්සම්බුද්ධ වූයේ ද, ධර්මය ස්වාක්ඛ්‍යාත වූයේ ද, මැනවින් ප්‍රකාශිත වූයේ ද, නිර්ගමණය කරා ගෙන යන්නේ ද, උපසමයට හේතු වන්නේ ද, සම්‍යක්සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරණ ලද්දේ ද, ශ්‍රාවකයා ඒ ධර්මයෙහි ධර්මානුධර්ම ප්‍රතිපදාවෙහි නො හැසිරෙයි ද, සාමීචි ප්‍රතිපදාවෙහි නො හැසිරෙයි ද, අනුධර්මචාරී නො වෙයි ද, ඒ ධර්මයෙන් බැහැරව වර්තනය වේ නම්, ඔහුට මෙසේ පැවසිය යුතු ය: ‘ඇවැත්නි, එය ඔබට අලාභයෙකි, එය ඔබට දුර්ලභයෙකි, ශාස්තෘවරයා ද ඔබට සම්‍යක්සම්බුද්ධ ය, ධර්මය ද ස්වාක්ඛ්‍යාත ය, මැනවින් ප්‍රකාශිත ය, නිර්ගමණය කරා ගෙන යන්නේ ය, උපසමයට හේතු වන්නේ ය, සම්‍යක්සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරණ ලද්දේ ය. ඔබ ද ඒ ධර්මයෙහි ධර්මානුධර්ම ප්‍රතිපදාවෙහි නො හැසිරෙහු ය, සාමීචි ප්‍රතිපදාවෙහි නො හැසිරෙහු ය, අනුධර්මචාරී නො වෙහු ය, ඒ ධර්මයෙන් බැහැරව වර්තනය වන්නෙහි’ යි. චුන්ද, මෙසේ ශාස්තෘවරයා ද එහි ප්‍රශංසනීය වේ, ධර්මය ද එහි ප්‍රශංසනීය වේ, ශ්‍රාවකයා ද එහි මෙසේ ගර්හා කළ යුතු වේ. චුන්ද, යමෙක් එබඳු ශ්‍රාවකයකුට මෙසේ කියන්නේ නම්, ‘මේ ආයුෂ්මත් තෙමේ යම් පරිදි ශාස්තෘවරයා විසින් ධර්මය දේශනා කරන ලද්දේ ද, පණවන ලද්දේ ද, එපරිදි පිළිපදින්න’ යි. යමෙක් (එසේ) සමාදන් කරවන්නේ ද, යමෙක් යමක් සමාදන් කරවන්නේ ද, යමෙක් සමාදන් කරවන ලද්දේ එපරිද්දෙන්ම පිළිපදින්නේ ද, ඒ සියල්ලෝ ම බොහෝ පින් රැස් කර ගනිති. එය කවර හේතුවක් නිසා ද? චුන්ද, මෙසේ ම යහපත්වූ ධර්ම විනයෙහි, මැනවින් ප්‍රකාශිත වූ, නිර්ගමණය කරා ගෙන යන්නාවූ, උපසමයට හේතුවන්නාවූ, සම්‍යක්සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරන ලද්දේ (වූ බැවිනි).",
      "paliTitle": "Sammāsambuddhappaveditadhammavinayo",
      "englishTitle": "Dhamma and Vinaya Expounded by the Perfectly Awakened One",
      "sinhalaTitle": "සම්මා සෟමෟබුදුන් වදාළ දහම් විනය"
    },
    {
      "number": 169,
      "pali": "‘‘Idha pana, cunda, satthā ca hoti sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, sāvako ca tasmiṃ dhamme dhammānudhammappaṭipanno viharati sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattati. So evamassa vacanīyo – ‘tassa te, āvuso, lābhā, tassa te suladdhaṃ, satthā ca te [satthā ca te arahaṃ (syā.)] sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Tvañca tasmiṃ dhamme dhammānudhammappaṭipanno viharasi sāmīcippaṭipanno anudhammacārī, samādāya taṃ dhammaṃ vattasī’ti. Iti kho, cunda, satthāpi tattha pāsaṃso, dhammopi tattha pāsaṃso, sāvakopi tattha evaṃ pāsaṃso. Yo kho, cunda, evarūpaṃ sāvakaṃ evaṃ vadeyya – ‘addhāyasmā ñāyappaṭipanno ñāyamārādhessatī’ti. Yo ca pasaṃsati, yañca pasaṃsati, yo ca pasaṃsito [pasattho (syā.)] bhiyyoso mattāya vīriyaṃ ārabhati. Sabbe te bahuṃ puññaṃ pasavanti. Taṃ kissa hetu? Evañhetaṃ, cunda, hoti svākkhāte dhammavinaye suppavedite niyyānike upasamasaṃvattanike sammāsambuddhappavedite. ",
      "english": "\"Here, Cunda, the Teacher is a fully enlightened Buddha, and the Dhamma is well-proclaimed, clearly delivered, leading outwards, conducive to peace, proclaimed by the fully enlightened Buddha, and the disciple lives practicing the Dhamma in accordance with the Dhamma, practicing properly, behaving in accordance with the Dhamma, conducting himself in accordance with that Dhamma. One should say this to him: ‘It is gain for you, friend, it is well-gained for you, that the Teacher is a fully enlightened Buddha, and the Dhamma is well-proclaimed, clearly delivered, leading outwards, conducive to peace, proclaimed by the fully enlightened Buddha. And you live practicing the Dhamma in accordance with the Dhamma in that Dhamma, practicing properly, behaving in accordance with the Dhamma, conducting yourself in accordance with that Dhamma.’ In this way, Cunda, the Teacher is praised there, the Dhamma is praised there, and the disciple is praised there in that way. Whoever, Cunda, should say this to such a disciple: ‘Assuredly, the venerable one is practicing according to the way and will perfect the way,’ and whoever praises, and whomever he praises, and the one who is praised exerts even greater effort, all of them generate much merit. Why is that? It is because, Cunda, this is how it is in a well-proclaimed Dhamma and Discipline, clearly delivered, leading outwards, conducive to peace, proclaimed by the fully enlightened Buddha.\"",
      "sinhala": "‘‘චුන්ද, මෙහි ශාස්තෘවරයා සම්‍යක් සම්බුද්ධ වෙයි. ධර්මයද ස්වාක්ඛ්‍යාත, මැනවින් ප්‍රකාශිත, නිත්‍ය වශයෙන් නිවනට පමුණුවන්නක්, කෙලෙස් සංසිඳුවීමට හේතුවන්නක්, සම්‍යක් සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරණ ලද්දක් වෙයි. ශ්‍රාවකයාද එම ධර්මයෙහි ධර්මානුධර්ම ප්‍රතිපදාවෙහි යෙදී, මනා පිළිවෙතෙහි යෙදී, අනුධර්මචාරීව වාසය කරයි. එම ධර්මය මැනවින් ගෙන පිළිපදී. ඔහුට මෙසේ පැවසිය යුතුය. ‘ඇවැත්නි, ඔබට එය ලාභයකි. ඔබට එය මනා ලාභයකි. ඔබට ශාස්තෘවරයා සම්‍යක් සම්බුද්ධය. ධර්මයද ස්වාක්ඛ්‍යාත, මැනවින් ප්‍රකාශිත, නිත්‍ය වශයෙන් නිවනට පමුණුවන්නක්, කෙලෙස් සංසිඳුවීමට හේතුවන්නක්, සම්‍යක් සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරණ ලද්දක් වෙයි. ඔබද එම ධර්මයෙහි ධර්මානුධර්ම ප්‍රතිපදාවෙහි යෙදී, මනා පිළිවෙතෙහි යෙදී, අනුධර්මචාරීව වාසය කරයි. එම ධර්මය මැනවින් ගෙන පිළිපදින්නෙහිය.’ චුන්ද, මෙසේ ශාස්තෘවරයාද එහි ප්‍රශංසනීය වෙයි. ධර්මයද එහි ප්‍රශංසනීය වෙයි. ශ්‍රාවකයාද එහි මෙසේ ප්‍රශංසනීය වෙයි. චුන්ද, යමෙක් එබඳු ශ්‍රාවකයෙකුට මෙසේ කියන්නේද, ‘ආයුෂ්මත් තෙමේ නියම මාර්ගයේ ගමන් කරන්නේය. නියම මාර්ගය සාක්ෂාත් කරන්නේය’ කියායි. යමෙක් ප්‍රශංසා කරන්නේද, යමෙකු ප්‍රශංසා කරන්නේද, යමෙක් ප්‍රශංසිත වන්නේද, ඔවුහු තව තවත් වීර්යය වඩති. ඒ සියල්ලෝම බොහෝ පින් රැස් කර ගනිති. එය කිනම් හේතුවක් නිසාද? චුන්ද, මෙසේම මෙය වන්නේය. ස්වාක්ඛ්‍යාත ධර්ම විනයෙහි මැනවින් ප්‍රකාශිත, නිත්‍ය වශයෙන් නිවනට පමුණුවන්නක්, කෙලෙස් සංසිඳුවීමට හේතුවන්නක්, සම්‍යක් සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරණ ලද්දක් වෙයි.\"",
      "paliTitle": ""
    },
    {
      "number": 170,
      "pali": "‘‘Idha pana, cunda, satthā ca loke udapādi arahaṃ sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, aviññāpitatthā cassa honti sāvakā saddhamme, na ca tesaṃ kevalaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha nesaṃ satthuno antaradhānaṃ hoti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato anutappo hoti. Taṃ kissa hetu? Satthā ca no loke udapādi arahaṃ sammāsambuddho, dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito, aviññāpitatthā camha saddhamme, na ca no kevalaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha no satthuno antaradhānaṃ hotīti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato anutappo hoti. ",
      "english": "\"Here, Cunda, a Teacher has arisen in the world, an Arahant, a Fully Enlightened One, and the Dhamma is well-proclaimed, well-expounded, leading outwards, conducing to peace, proclaimed by the Fully Enlightened One. But his disciples are not well-versed in the Dhamma, and the complete and perfect holy life has not been made manifest, revealed, comprehensively articulated, and wondrously displayed, so well-proclaimed even to gods and humans. Then there comes the Teacher's passing away. A Teacher such as this, Cunda, when deceased, causes his disciples to grieve. Why is that? 'A Teacher arose for us in the world, an Arahant, a Fully Enlightened One, and the Dhamma was well-proclaimed, well-expounded, leading outwards, conducing to peace, proclaimed by the Fully Enlightened One. But we are not well-versed in the Dhamma, and the complete and perfect holy life has not been made manifest, revealed, comprehensively articulated, and wondrously displayed, so well-proclaimed even to gods and humans. And now there has come the Teacher's passing away.' A Teacher such as this, Cunda, when deceased, causes his disciples to grieve.\"",
      "sinhala": "‘‘චුන්ද, මෙහි ශාස්තෘවරයෙක් ලෝකයෙහි පහළ වෙයි. අරහත් වූ, සම්මා සම්බුද්ධ වූ (ශාස්තෘවරයෙක් පහළ වෙයි). ධර්මය ද ස්වාක්ඛාත ය, මැනවින් ප්‍රකාශිත ය, නික්මීමට හේතු වේ, උපසමයට හේතු වේ, සම්මා සම්බුදුන් විසින් දේශනා කරන ලද්දේ වෙයි. එම ශාස්තෘවරයාගේ ශ්‍රාවකයෝ සද්ධර්මයෙහි නොදත් කරුණු ඇතිව සිටිත් නම්, ඔවුන්ගේ බ්‍රහ්මචර්යාව සම්පූර්ණයෙන් විවෘත නොවේ නම්, මැනවින් එළිදරව් නොකළේ නම්, සියලු අංගයන්ගෙන් යුක්ත නොවේ නම්, ප්‍රාතිහාර්ය සහිත නොවේ නම්, දෙවියන් හා මිනිසුන් විසින් මැනවින් ප්‍රකාශිත නොවේ නම්, අනතුරුව ඔවුන්ගේ ශාස්තෘවරයාගේ අභාවය සිදු වේ. චුන්ද, එබඳු ශාස්තෘවරයෙක් ශ්‍රාවකයන්ට කාලයක් ඇවෑමෙන් පසු තැවීමට හේතු වේ.\n\nඑයට හේතුව කුමක් ද? ශාස්තෘවරයෙක් ලෝකයෙහි පහළ විය, අරහත් වූ, සම්මා සම්බුද්ධ වූ (ශාස්තෘවරයෙක් පහළ විය). ධර්මය ද ස්වාක්ඛාත ය, මැනවින් ප්‍රකාශිත ය, නික්මීමට හේතු වේ, උපසමයට හේතු වේ, සම්මා සම්බුදුන් විසින් දේශනා කරන ලද්දේ වෙයි. එසේ තිබියදීත්, අපි සද්ධර්මයෙහි නොදත් කරුණු ඇත්තෝ වීමු. අපගේ බ්‍රහ්මචර්යාව සම්පූර්ණයෙන් විවෘත වූයේ නැත. මැනවින් එළිදරව් කරන ලද්දේ ද නැත. සියලු අංගයන්ගෙන් යුක්ත වූයේ ද නැත. ප්‍රාතිහාර්ය සහිත වූයේ ද නැත. දෙවියන් හා මිනිසුන් විසින් මැනවින් ප්‍රකාශිත වූයේ ද නැත. අනතුරුව අපගේ ශාස්තෘවරයාගේ අභාවය සිදු විය’ යනුවෙනි. චුන්ද, එබඳු ශාස්තෘවරයෙක් ශ්‍රාවකයන්ට කාලයක් ඇවෑමෙන් පසු තැවීමට හේතු වේ.",
      "paliTitle": "Sāvakānutappasatthu",
      "englishTitle": "The Teacher's Joy in His Disciples",
      "sinhalaTitle": "ශාස්තෘන් වහන්සේගේ ශ්‍රාවක සංවේගය"
    },
    {
      "number": 171,
      "pali": "‘‘Idha pana, cunda, satthā ca loke udapādi arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā cassa honti sāvakā saddhamme, kevalañca tesaṃ paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha nesaṃ satthuno antaradhānaṃ hoti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato ananutappo hoti. Taṃ kissa hetu? Satthā ca no loke udapādi arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā camha saddhamme, kevalañca no paripūraṃ brahmacariyaṃ āvikataṃ hoti uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Atha no satthuno antaradhānaṃ hotīti. Evarūpo kho, cunda, satthā sāvakānaṃ kālaṅkato ananutappo hoti.",
      "english": "\"Here, Cunda, a Teacher has arisen in the world, an Arahant, a fully enlightened Buddha. And the Dhamma is well-proclaimed, well-expounded, leading outwards, conducive to peace, proclaimed by the fully enlightened Buddha. And his disciples are knowledgeable about the meaning in the true Dhamma, and their entire, complete holy life is made manifest, made open, made comprehensive, made wondrous, well-proclaimed even among gods and humans. Then the Teacher passes away. Such a Teacher, Cunda, is not a cause for regret to his disciples when he has passed away. Why is that? Because a Teacher arose for us in the world, an Arahant, a fully enlightened Buddha. And the Dhamma is well-proclaimed, well-expounded, leading outwards, conducive to peace, proclaimed by the fully enlightened Buddha. And we are knowledgeable about the meaning in the true Dhamma, and our entire, complete holy life is made manifest, made open, made comprehensive, made wondrous, well-proclaimed even among gods and humans. Then our Teacher has passed away. Such a Teacher, Cunda, is not a cause for regret to his disciples when he has passed away.\"",
      "sinhala": "‘‘චුන්ද, මෙහි ශාස්තෘවරයෙක් ලෝකයෙහි පහළ වූයේ අර්හත් වූ, සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ ය. එම ධර්මය ද ස්වයංඛ්‍යාත ය, මැනවින් දේශනා කරන ලද්දේ ය, නිවනට පමුණුවන්නකි, කෙලෙස් සංසිඳුවීමට හේතු වන්නකි, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරන ලද්දේ ය. එම ශාස්තෘවරයාගේ ශ්‍රාවකයෝ සද්ධර්මයෙහි අර්ථය දන්නෝ වෙති. ඔවුන්ගේ බ්‍රහ්මචර්යාව සම්පූර්ණ ය, විවෘත ය, ප්‍රකට ය, සියලු අංශයන්ගෙන් යුක්ත ය, ආශ්චර්යයන්ගෙන් යුක්ත ය, දෙවියන් හා මිනිසුන් විසින් මැනවින් ප්‍රකාශිත ය. ඉන්පසු ඒ ශාස්තෘවරයාගේ අභාවය සිදු වේ. චුන්ද, මෙබඳු ශාස්තෘවරයෙක් ශ්‍රාවකයන්ට කාලයාගේ ඇවෑමෙන් අනුතාපයට කාරණයක් නොවේ.\n\nඑයට හේතුව කුමක් ද? ශාස්තෘවරයෙක් ලෝකයෙහි පහළ වූයේ අර්හත් වූ, සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ ය. එම ධර්මය ද ස්වයංඛ්‍යාත ය, මැනවින් දේශනා කරන ලද්දේ ය, නිවනට පමුණුවන්නකි, කෙලෙස් සංසිඳුවීමට හේතු වන්නකි, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරන ලද්දේ ය. අපි සද්ධර්මයෙහි අර්ථය දන්නෝ වෙමු. අපගේ බ්‍රහ්මචර්යාව සම්පූර්ණ ය, විවෘත ය, ප්‍රකට ය, සියලු අංශයන්ගෙන් යුක්ත ය, ආශ්චර්යයන්ගෙන් යුක්ත ය, දෙවියන් හා මිනිසුන් විසින් මැනවින් ප්‍රකාශිත ය. ඉන්පසු අපගේ ශාස්තෘවරයාගේ අභාවය සිදු වේ යනුයි. චුන්ද, මෙබඳු ශාස්තෘවරයෙක් ශ්‍රාවකයන්ට කාලයාගේ ඇවෑමෙන් අනුතාපයට කාරණයක් නොවේ.",
      "paliTitle": "Sāvakānanutappasatthu",
      "englishTitle": "The Teacher's Consolation for Disciples",
      "sinhalaTitle": "ශාස්‍තෘන් වහන්‍සේ ශ්‍රා‍වකයන්ට සැනසීම"
    },
    {
      "number": 172,
      "pali": "‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, no ca kho satthā hoti thero rattaññū cirapabbajito addhagato vayoanuppatto. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena. ‘‘Yato ca kho, cunda, etehi ceva aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto. Evaṃ taṃ brahmacariyaṃ paripūraṃ hoti tenaṅgena.",
      "english": "\"Even if, Cunda, the spiritual life is endowed with these qualities, but there is no teacher who is an elder, long experienced, long gone forth, advanced in years, and come to old age, then that spiritual life is incomplete in that respect. But when, Cunda, the spiritual life is endowed with these qualities, and there is a teacher who is an elder, long experienced, long gone forth, advanced in years, and come to old age, then that spiritual life is complete in that respect.\"",
      "sinhala": "‘‘චුන්ද, මේ කරුණු වලින් යුක්ත වුවද, ශාස්තෘවරයාණන් වහන්සේ වැඩිමල් නොවන්නේ නම්, බොහෝ කලක් පැවිදි නොවූයේ නම්, වයසින් මුහුකුරා නොගියේ නම්, එවිට එම බ්‍රහ්මචර්යාව එම අංගයෙන් අසම්පූර්ණ වේ. චුන්ද, යම් විටක මේ කරුණු වලින් යුක්ත බ්‍රහ්මචර්යාවක් වේද, එමෙන්ම ශාස්තෘවරයාණන් වහන්සේ වැඩිමල් වේද, බොහෝ කලක් පැවිදි වූයේ වේද, වයසින් මුහුකුරා ගියේ වේද, එවිට එම බ්‍රහ්මචර්යාව එම අංගයෙන් සම්පූර්ණ වේ.",
      "paliTitle": "Brahmacariyaaparipūrādikathā",
      "englishTitle": "Discourse on the Incomplete Holy Life",
      "sinhalaTitle": "අපරිපූර්‍ණ බ්‍රහ්මචර්‍යාව ආදිකථාව"
    },
    {
      "number": 173,
      "pali": "‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, no ca khvassa therā bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena. ‘‘Yato ca kho, cunda, etehi ceva aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, therā cassa bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Evaṃ taṃ brahmacariyaṃ paripūraṃ hoti tenaṅgena.",
      "english": "\"Even if, Cunda, the spiritual life is complete with these factors, and the Teacher is elderly, aged, advanced in years, long gone forth, and has reached the final stage of life, but the elder monks who are his disciples are not skilled, disciplined, confident, and have attained security from the yoke, they are not able to explain the Good Dhamma, not able to refute arisen alien doctrines well by means of the Dhamma, and to teach the Dhamma with wonders. Thus that spiritual life is incomplete in that respect.\n\n\"And when, Cunda, the spiritual life is complete with these factors, and the Teacher is elderly, aged, advanced in years, long gone forth, and has reached the final stage of life, and the elder monks who are his disciples are skilled, disciplined, confident, and have attained security from the yoke, they are able to explain the Good Dhamma, able to refute arisen alien doctrines well by means of the Dhamma, and to teach the Dhamma with wonders. Thus that spiritual life is complete in that respect.\"",
      "sinhala": "“චුන්ද, මේ කරුණු වලින් යුක්ත වුවද බ්‍රහ්මචර්යාව පවතී නම්, ශාස්තෘවරයා වයෝවෘද්ධ, බොහෝ කලක් පැවිදි වූ, මග පෙන්වන, වයසින් මුහුකුරා ගිය තෙර නමක් වුවද, උන්වහන්සේගේ ශ්‍රාවක භික්ෂූන් වහන්සේලා බුද්ධිමත්, හික්මුණු, විශාරද, යෝගක්ෂේමයට පැමිණි අය නොවෙත් නම්, සද්ධර්මය මැනවින් ප්‍රකාශ කිරීමට හෝ අන්‍ය වාදයන් මැනවින් නිරුද්ධ කර දැමීමට හෝ ප්‍රාතිහාර්ය සහිතව ධර්මය දේශනා කිරීමට සමත් නොවෙත් නම්, එම බ්‍රහ්මචර්යාව එම අංගයෙන් අසම්පූර්ණ වේ.\n\n“චුන්ද, යම් විටක මේ කරුණු වලින් යුක්ත වූ බ්‍රහ්මචර්යාවක් පවතීද, ශාස්තෘවරයා වයෝවෘද්ධ, බොහෝ කලක් පැවිදි වූ, මග පෙන්වන, වයසින් මුහුකුරා ගිය තෙර නමක් වන අතර, උන්වහන්සේගේ ශ්‍රාවක භික්ෂූන් වහන්සේලා බුද්ධිමත්, හික්මුණු, විශාරද, යෝගක්ෂේමයට පැමිණි අය වෙත් නම්, සද්ධර්මය මැනවින් ප්‍රකාශ කිරීමට හෝ අන්‍ය වාදයන් මැනවින් නිරුද්ධ කර දැමීමට හෝ ප්‍රාතිහාර්ය සහිතව ධර්මය දේශනා කිරීමට සමත් වෙත් නම්, එවිට එම බ්‍රහ්මචර්යාව එම අංගයෙන් සම්පූර්ණ වේ.",
      "paliTitle": ""
    },
    {
      "number": 174,
      "pali": "‘‘Etehi cepi, cunda, aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, therā cassa bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. No ca khvassa majjhimā bhikkhū sāvakā honti…pe… majjhimā cassa bhikkhū sāvakā honti, no ca khvassa navā bhikkhū sāvakā honti…pe… navā cassa bhikkhū sāvakā honti, no ca khvassa therā bhikkhuniyo sāvikā honti…pe… therā cassa bhikkhuniyo sāvikā honti, no ca khvassa majjhimā bhikkhuniyo sāvikā honti…pe… majjhimā cassa bhikkhuniyo sāvikā honti, no ca khvassa navā bhikkhuniyo sāvikā honti…pe… navā cassa bhikkhuniyo sāvikā honti, no ca khvassa upāsakā sāvakā honti gihī odātavasanā brahmacārino…pe… upāsakā cassa sāvakā honti gihī odātavasanā brahmacārino, no ca khvassa upāsakā sāvakā honti gihī odātavasanā kāmabhogino…pe… upāsakā cassa sāvakā honti gihī odātavasanā kāmabhogino, no ca khvassa upāsikā sāvikā honti gihiniyo odātavasanā brahmacāriniyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā brahmacāriniyo, no ca khvassa upāsikā sāvikā honti gihiniyo odātavasanā kāmabhoginiyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā kāmabhoginiyo, no ca khvassa brahmacariyaṃ hoti iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ…pe… brahmacariyañcassa hoti iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ, no ca kho lābhaggayasaggappattaṃ. Evaṃ taṃ brahmacariyaṃ aparipūraṃ hoti tenaṅgena. ‘‘Yato ca kho, cunda, etehi ceva aṅgehi samannāgataṃ brahmacariyaṃ hoti, satthā ca hoti thero rattaññū cirapabbajito addhagato vayoanuppatto, therā cassa bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Majjhimā cassa bhikkhū sāvakā honti… pe… navā cassa bhikkhū sāvakā honti…pe… therā cassa bhikkhuniyo sāvikā honti…pe… majjhimā cassa bhikkhuniyo sāvikā honti…pe… navā cassa bhikkhuniyo sāvikā honti…pe… upāsakā cassa sāvakā honti…pe… gihī odātavasanā brahmacārino. Upāsakā cassa sāvakā honti gihī odātavasanā kāmabhogino…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā brahmacāriniyo…pe… upāsikā cassa sāvikā honti gihiniyo odātavasanā kāmabhoginiyo…pe… brahmacariyañcassa hoti iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ, lābhaggappattañca yasaggappattañca. Evaṃ taṃ brahmacariyaṃ paripūraṃ hoti tenaṅgena.",
      "english": "\"Even if, Cunda, the spiritual life is endowed with these qualities: that the Teacher is elderly, long ordained, advanced in years, aged, and far gone in life, and the elder monks who are his disciples are skilled, disciplined, confident, and have attained the security from bondage, and are capable of explaining the good Dhamma, and are capable of refuting an opposing doctrine that has arisen with well-reasoned arguments, and then teaching the Dhamma with convincing reasons, but the middle monks who are his disciples are not… and the middle monks who are his disciples are, but the new monks who are his disciples are not… and the new monks who are his disciples are, but the elder nuns who are his disciples are not… and the elder nuns who are his disciples are, but the middle nuns who are his disciples are not… and the middle nuns who are his disciples are, but the new nuns who are his disciples are not… and the new nuns who are his disciples are, but the lay male disciples clad in white who live the spiritual life are not… and the lay male disciples clad in white who live the spiritual life are, but the lay male disciples clad in white who enjoy sensual pleasures are not… and the lay male disciples clad in white who enjoy sensual pleasures are, but the lay female disciples clad in white who live the spiritual life are not… and the lay female disciples clad in white who live the spiritual life are, but the lay female disciples clad in white who enjoy sensual pleasures are not… and the lay female disciples clad in white who enjoy sensual pleasures are, but the spiritual life is not both prosperous and flourishing, widespread, well-known, far-reaching, and well proclaimed among gods and humans… and the spiritual life is both prosperous and flourishing, widespread, well-known, far-reaching, and well proclaimed among gods and humans, but it has not attained the height of gain and fame. In that way, the spiritual life is incomplete in that aspect.\n\n\"But when, Cunda, the spiritual life is endowed with these qualities: that the Teacher is elderly, long ordained, advanced in years, aged, and far gone in life, and the elder monks who are his disciples are skilled, disciplined, confident, and have attained the security from bondage, and are capable of explaining the good Dhamma, and are capable of refuting an opposing doctrine that has arisen with well-reasoned arguments, and then teaching the Dhamma with convincing reasons, and the middle monks who are his disciples are… and the new monks who are his disciples are… and the elder nuns who are his disciples are… and the middle nuns who are his disciples are… and the new nuns who are his disciples are… and the lay male disciples clad in white who live the spiritual life are… and the lay male disciples clad in white who enjoy sensual pleasures are… and the lay female disciples clad in white who live the spiritual life are… and the lay female disciples clad in white who enjoy sensual pleasures are… and the spiritual life is both prosperous and flourishing, widespread, well-known, far-reaching, and well proclaimed among gods and humans, and it has attained the height of gain and fame. In that way, the spiritual life is complete in that aspect.",
      "sinhala": "‘‘චුන්ද, යම් හෙයකින් මේ අංගයන්ගෙන් යුක්ත වූ බ්‍ර‍හ්මචර්‍යාවක් වේ නම්, ශාස්තෘවරයාද වයෝවෘද්ධ වූ, බොහෝ කල් පැවිදි වූ, මග පිරිසිඳ ගත්, වයසින් මුහුකුරා ගිය තෙර කෙනෙක් ද වන්නේය. එමෙන්ම විනීත වූ, විශාරද වූ, යෝගක්‍ෂේමයට පැමිණි භික්ෂූන් වහන්සේලාද ඔහුගේ ශ්‍ර‍ාවකයෝ වෙති. ඒකාන්තයෙන්ම ඒ ශාස්තෘවරයා සද්ධර්මය මැනවින් දේශනා කිරීමට සමත් වෙයි. හටගත් අන්‍ය වාද මැනවින් සංග්‍ර‍හ කොට, ප්‍ර‍තිහාර්‍ය සහිතව ධර්මය දේශනා කිරීමට සමත් වෙයි. එහෙත් ඔහුගේ මධ්‍යම භික්ෂූන් ශ්‍ර‍ාවකයෝ නොවෙති. ඔහුගේ මධ්‍යම භික්ෂූන් ශ්‍ර‍ාවකයෝ වෙති. එහෙත් ඔහුගේ නවක භික්ෂූන් ශ්‍ර‍ාවකයෝ නොවෙති. ඔහුගේ නවක භික්ෂූන් ශ්‍ර‍ාවකයෝ වෙති. එහෙත් ඔහුගේ වයෝවෘද්ධ භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ නොවෙති. ඔහුගේ වයෝවෘද්ධ භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ වෙති. එහෙත් ඔහුගේ මධ්‍යම භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ නොවෙති. ඔහුගේ මධ්‍යම භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ වෙති. එහෙත් ඔහුගේ නවක භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ නොවෙති. ඔහුගේ නවක භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ වෙති. එහෙත් ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, බ්‍ර‍හ්මචාරී උපාසකයෝ ශ්‍ර‍ාවකයෝ නොවෙති. ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, බ්‍ර‍හ්මචාරී උපාසකයෝ ශ්‍ර‍ාවකයෝ වෙති. එහෙත් ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, කාමභෝගී උපාසකයෝ ශ්‍ර‍ාවකයෝ නොවෙති. ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, කාමභෝගී උපාසකයෝ ශ්‍ර‍ාවකයෝ වෙති. එහෙත් ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, බ්‍ර‍හ්මචාරිනී උපාසිකාවෝ ශ්‍ර‍ාවිකාවෝ නොවෙති. ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, බ්‍ර‍හ්මචාරිනී උපාසිකාවෝ ශ්‍ර‍ාවිකාවෝ වෙති. එහෙත් ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, කාමභෝගිනී උපාසිකාවෝ ශ්‍ර‍ාවිකාවෝ නොවෙති. ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, කාමභෝගිනී උපාසිකාවෝ ශ්‍ර‍ාවිකාවෝ වෙති. එහෙත් ඔහුගේ බ්‍ර‍හ්මචර්‍යාව දියුණුවටත්, වර්ධනයටත්, විශාලත්වයටත්, බහුජනතාවටත්, දෙව් මිනිස් ලෝකයා අතර ප්‍ර‍සිද්ධ වීමටත් හේතු වන්නේ නැත. ඔහුගේ බ්‍ර‍හ්මචර්‍යාව දියුණුවටත්, වර්ධනයටත්, විශාලත්වයටත්, බහුජනතාවටත්, දෙව් මිනිස් ලෝකයා අතර ප්‍ර‍සිද්ධ වීමටත් හේතු වන්නේය. එහෙත් ලාභයෙන් අග්‍ර‍ත්වයට පත්වීමටත්, යසසින් අග්‍ර‍ත්වයට පත්වීමටත් හේතු වන්නේ නැත. චුන්ද, එහෙයින් ඒ බ්‍ර‍හ්මචර්‍යාව ඒ අංගයෙන් පිරිපුන් නොවේ.\n\nචුන්ද, යම් හෙයකින් මේ අංගයන්ගෙන් යුක්ත වූ බ්‍ර‍හ්මචර්‍යාවක් වේ නම්, ශාස්තෘවරයාද වයෝවෘද්ධ වූ, බොහෝ කල් පැවිදි වූ, මග පිරිසිඳ ගත්, වයසින් මුහුකුරා ගිය තෙර කෙනෙක් ද වන්නේය. එමෙන්ම විනීත වූ, විශාරද වූ, යෝගක්‍ෂේමයට පැමිණි භික්ෂූන් වහන්සේලාද ඔහුගේ ශ්‍ර‍ාවකයෝ වෙති. ඒකාන්තයෙන්ම ඒ ශාස්තෘවරයා සද්ධර්මය මැනවින් දේශනා කිරීමට සමත් වෙයි. හටගත් අන්‍ය වාද මැනවින් සංග්‍ර‍හ කොට, ප්‍ර‍තිහාර්‍ය සහිතව ධර්මය දේශනා කිරීමට සමත් වෙයි. ඔහුගේ මධ්‍යම භික්ෂූන් ශ්‍ර‍ාවකයෝ වෙති. ඔහුගේ නවක භික්ෂූන් ශ්‍ර‍ාවකයෝ වෙති. ඔහුගේ වයෝවෘද්ධ භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ වෙති. ඔහුගේ මධ්‍යම භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ වෙති. ඔහුගේ නවක භික්ෂුණීන් ශ්‍ර‍ාවිකාවෝ වෙති. ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, බ්‍ර‍හ්මචාරී උපාසකයෝ ශ්‍ර‍ාවකයෝ වෙති. ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, කාමභෝගී උපාසකයෝ ශ්‍ර‍ාවකයෝ වෙති. ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, බ්‍ර‍හ්මචාරිනී උපාසිකාවෝ ශ්‍ර‍ාවිකාවෝ වෙති. ඔහුගේ ගිහි වූ, සුදු වස්ත්‍ර‍ ඇඳි, කාමභෝගිනී උපාසිකාවෝ ශ්‍ර‍ාවිකාවෝ වෙති. ඔහුගේ බ්‍ර‍හ්මචර්‍යාව දියුණුවටත්, වර්ධනයටත්, විශාලත්වයටත්, බහුජනතාවටත්, දෙව් මිනිස් ලෝකයා අතර ප්‍ර‍සිද්ධ වීමටත් හේතු වන්නේය. එසේම ලාභයෙන් අග්‍ර‍ත්වයට පත්වීමටත්, යසසින් අග්‍ර‍ත්වයට පත්වීමටත් හේතු වන්නේය. චුන්ද, එහෙයින් ඒ බ්‍ර‍හ්මචර්‍යාව ඒ අංගයෙන් පිරිපුන් වන්නේය.’’",
      "paliTitle": ""
    },
    {
      "number": 175,
      "pali": "‘‘Ahaṃ kho pana, cunda, etarahi satthā loke uppanno arahaṃ sammāsambuddho. Dhammo ca svākkhāto suppavedito niyyāniko upasamasaṃvattaniko sammāsambuddhappavedito. Viññāpitatthā ca me sāvakā saddhamme, kevalañca tesaṃ paripūraṃ brahmacariyaṃ āvikataṃ uttānīkataṃ sabbasaṅgāhapadakataṃ sappāṭihīrakataṃ yāva devamanussehi suppakāsitaṃ. Ahaṃ kho pana, cunda, etarahi satthā thero rattaññū cirapabbajito addhagato vayoanuppatto. ‘‘Santi kho pana me, cunda, etarahi therā bhikkhū sāvakā honti viyattā vinītā visāradā pattayogakkhemā. Alaṃ samakkhātuṃ saddhammassa, alaṃ uppannaṃ parappavādaṃ sahadhammehi suniggahitaṃ niggahetvā sappāṭihāriyaṃ dhammaṃ desetuṃ. Santi kho pana me, cunda, etarahi majjhimā bhikkhū sāvakā…pe… santi kho pana me, cunda, etarahi navā bhikkhū sāvakā…pe… santi kho pana me, cunda, etarahi therā bhikkhuniyo sāvikā…pe… santi kho pana me, cunda, etarahi majjhimā bhikkhuniyo sāvikā…pe… santi kho pana me, cunda, etarahi navā bhikkhuniyo sāvikā…pe… santi kho pana me, cunda, etarahi upāsakā sāvakā gihī odātavasanā brahmacārino…pe… santi kho pana me, cunda, etarahi upāsakā sāvakā gihī odātavasanā kāmabhogino…pe… santi kho pana me, cunda, etarahi upāsikā sāvikā gihiniyo odātavasanā brahmacāriniyo…pe… santi kho pana me, cunda, etarahi upāsikā sāvikā gihiniyo odātavasanā kāmabhoginiyo…pe… etarahi kho pana me, cunda, brahmacariyaṃ iddhañceva phītañca vitthārikaṃ bāhujaññaṃ puthubhūtaṃ yāva devamanussehi suppakāsitaṃ.",
      "english": "\"But now, Cunda, I am a Teacher who has arisen in the world, an Arahant, a Fully Enlightened One. And the Dhamma is well-proclaimed, well-expounded, leading outwards, conducing to calm, proclaimed by the Fully Enlightened One. And my disciples are those who have understood the meaning of the true Dhamma, and their whole, complete holy life is manifest, open, comprehensive in all its aspects, miraculous, and well-proclaimed even among gods and humans. But now, Cunda, I am a Teacher who is old, aged, advanced in years, long gone in life's journey, and have reached the term of life.\n\n\"But now, Cunda, I have elder monks as disciples who are wise, disciplined, confident, and have attained the security from exertion. They are capable of teaching the true Dhamma, and capable of thoroughly refuting arisen opposing doctrines according to the Dhamma, and of teaching the Dhamma with miracles. But now, Cunda, I have middle monks as disciples... But now, Cunda, I have new monks as disciples... But now, Cunda, I have elder nuns as disciples... But now, Cunda, I have middle nuns as disciples... But now, Cunda, I have new nuns as disciples... But now, Cunda, I have laymen as disciples, householders wearing white clothes, practicing the holy life... But now, Cunda, I have laymen as disciples, householders wearing white clothes, enjoying sensual pleasures... But now, Cunda, I have laywomen as disciples, householders wearing white clothes, practicing the holy life... But now, Cunda, I have laywomen as disciples, householders wearing white clothes, enjoying sensual pleasures... But now, Cunda, the holy life is both successful and prosperous, widespread, well-attended, expanded, and well-proclaimed even among gods and humans.\"",
      "sinhala": "‘‘චුන්ද, දැන් මම ලෝකයෙහි පහළ වූ ශාස්තෘවරයෙක් වෙමි, අර්හත් වූ සම්මා සම්බුද්ධ වෙමි. මාගේ ධර්මය මනාව දේශනා කරන ලද්දේ ය, මනාව ප්‍රකාශිත ය, නිවනට පමුණුවන්නේ ය, කෙලෙස් සංසිඳුවීමට හේතු වන්නේ ය, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් දේශනා කරන ලද්දේ ය. මාගේ ශ්‍රාවකයෝ යහපත් ධර්මයෙහි නුවණැත්තෝ වෙති. ඔවුන්ගේ බ්‍රහ්මචරියාව සම්පූර්ණ ය, සියල්ලන් හට විවෘත ය, ප්‍රකට කරන ලද්දේ ය, සියලු අංගයන්ගෙන් යුක්ත ය, ආශ්චර්ය සහිත ය, දෙවියන් හා මිනිසුන් විසින් මනාව ප්‍රකාශ කරන ලද්දේ ය. චුන්ද, දැන් මම ශාස්තෘවරයෙක් වෙමි, වයෝවෘද්ධ වූ, බොහෝ කලක් පැවිදි වූ, මඟ ගෙවා ගිය, වයස ඉක්ම ගිය කෙනෙක් වෙමි.\n\n‘‘චුන්ද, දැන් මාගේ ශ්‍රාවකයන් වූ, ප්‍රඥාවන්ත වූ, හික්මුණු වූ, විශාරද වූ, යෝගක්ෂේමයට පැමිණි, ථෙර භික්ෂූන් සිටිති. ඔවුන්ට මේ යහපත් ධර්මය මනා ලෙස දේශනා කිරීමට හැකිය, තමන්ට විරුද්ධව මතයක් ආ විට එය මැනවින් තර්ක කර පරාජය කොට ආශ්චර්ය සහිතව ධර්මය දේශනා කිරීමට සමත් වෙති. චුන්ද, දැන් මාගේ මධ්‍යම භික්ෂූන් ශ්‍රාවකයෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ නවක භික්ෂූන් ශ්‍රාවකයෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ ථෙර භික්ෂුණීන් ශ්‍රාවිකාවෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ මධ්‍යම භික්ෂුණීන් ශ්‍රාවිකාවෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ නවක භික්ෂුණීන් ශ්‍රාවිකාවෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ ශ්‍රාවකයන් වූ, ගිහි වූ, සුදු වස්ත්‍ර හැඳි, බ්‍රහ්මචාරී උපාසකයෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ ශ්‍රාවකයන් වූ, ගිහි වූ, සුදු වස්ත්‍ර හැඳි, කාමභෝගී උපාසකයෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ ශ්‍රාවිකාවන් වූ, ගිහි වූ, සුදු වස්ත්‍ර හැඳි, බ්‍රහ්මචාරී උපාසිකාවෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ ශ්‍රාවිකාවන් වූ, ගිහි වූ, සුදු වස්ත්‍ර හැඳි, කාමභෝගී උපාසිකාවෝ වෙති…පෙ…. චුන්ද, දැන් මාගේ බ්‍රහ්මචරියාව සෘද්ධිමත් ය, වර්ධනය වී ඇත, විශාල වී ඇත, බොහෝ දෙනා අතර පතුරුවා හරින ලද්දේ ය, දෙවියන් හා මිනිසුන් විසින් මනාව ප්‍රකාශ කරන ලද්දේ ය.’’",
      "paliTitle": ""
    },
    {
      "number": 176,
      "pali": "‘‘Yāvatā kho, cunda, etarahi satthāro loke uppannā, nāhaṃ, cunda, aññaṃ ekasatthārampi samanupassāmi evaṃlābhaggayasaggappattaṃ yatharivāhaṃ. Yāvatā kho pana, cunda, etarahi saṅgho vā gaṇo vā loke uppanno; nāhaṃ, cunda, aññaṃ ekaṃ saṃghampi samanupassāmi evaṃlābhaggayasaggappattaṃ yatharivāyaṃ, cunda, bhikkhusaṅgho. Yaṃ kho taṃ, cunda, sammā vadamāno vadeyya – ‘sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsita’nti. Idameva taṃ sammā vadamāno vadeyya – ‘sabbākārasampannaṃ…pe… suppakāsita’nti. ‘‘Udako [uddako (sī. syā. pī.)] sudaṃ, cunda, rāmaputto evaṃ vācaṃ bhāsati – ‘passaṃ na passatī’ti. Kiñca passaṃ na passatīti? Khurassa sādhunisitassa talamassa passati, dhārañca khvassa na passati. Idaṃ vuccati – ‘passaṃ na passatī’ti. Yaṃ kho panetaṃ, cunda, udakena rāmaputtena bhāsitaṃ hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ khurameva sandhāya. Yañca taṃ [yañcetaṃ (syā. ka.)], cunda, sammā vadamāno vadeyya – ‘passaṃ na passatī’ti, idameva taṃ [idamevetaṃ (ka.)] sammā vadamāno vadeyya – ‘passaṃ na passatī’ti. Kiñca passaṃ na passatīti? Evaṃ sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsitanti, iti hetaṃ passati [suppakāsitaṃ, iti hetaṃ na passatīti (syā. ka.)]. Idamettha apakaḍḍheyya, evaṃ taṃ parisuddhataraṃ assāti, iti hetaṃ na passati [na passatīti (syā. ka.)]. Idamettha upakaḍḍheyya, evaṃ taṃ paripūraṃ [parisuddhataraṃ (syā. ka.), paripūrataraṃ (?)] assāti, iti hetaṃ na passati. Idaṃ vuccati cunda – ‘passaṃ na passatī’ti. Yaṃ kho taṃ, cunda, sammā vadamāno vadeyya – ‘sabbākārasampannaṃ…pe… brahmacariyaṃ suppakāsita’nti. Idameva taṃ sammā vadamāno vadeyya – ‘sabbākārasampannaṃ sabbākāraparipūraṃ anūnamanadhikaṃ svākkhātaṃ kevalaṃ paripūraṃ brahmacariyaṃ suppakāsita’nti. ",
      "english": "\"As many teachers as there are arisen in the world at this time, Cunda, I do not see even one other teacher who has attained such supreme gain, honor, and renown as I have. And as many assemblies or groups as there are arisen in the world at this time, Cunda, I do not see even one other assembly that has attained such supreme gain, honor, and renown as this community of monks, Cunda. If anyone, speaking rightly, were to say, ‘The holy life is well proclaimed, complete in every way, perfect in every aspect, lacking nothing, exceeding nothing, well expounded, wholly fulfilled,’ it is just this that one, speaking rightly, would say: ‘Complete in every way...well expounded.’\"\n\n\"It seems, Cunda, that Udaka Rāmaputta used to speak thus: ‘Seeing, one does not see.’ And what is it that seeing, one does not see? One sees the surface of a razor that is well sharpened, but one does not see its edge. This is called ‘Seeing, one does not see.’ But that, Cunda, which was spoken by Udaka Rāmaputta is low, vulgar, worldly, ignoble, and unconnected with the goal, relating only to a razor. But if anyone, speaking rightly, were to say, ‘Seeing, one does not see,’ it is just this that one, speaking rightly, would say: ‘Seeing, one does not see.’ And what is it that seeing, one does not see? One sees that the holy life is well proclaimed, complete in every way, perfect in every aspect, lacking nothing, exceeding nothing, well expounded, wholly fulfilled; thus one sees it. 'This should be removed from it, thus it will be even purer'—thus one does not see it. 'This should be added to it, thus it will be even more complete'—thus one does not see it. This, Cunda, is called ‘Seeing, one does not see.’ If anyone, speaking rightly, were to say, ‘Complete in every way...the holy life is well expounded,’ it is just this that one, speaking rightly, would say: ‘The holy life is well proclaimed, complete in every way, perfect in every aspect, lacking nothing, exceeding nothing, well expounded, wholly fulfilled.’\"",
      "sinhala": "චුන්ද, මේ වන විට ලෝකයේ පහළ වූ ශාස්තෘවරුන් අතරෙහි, මම මෙන් මෙවන් ලාභ, අග්‍ර ඵල, යසස් ලබා ඇති වෙනත් එකදු ශාස්තෘවරයෙකු වත් නොදකිමි.\n\nචුන්ද, එසේම මේ වන විට ලෝකයේ පහළ වූ සංඝයා හෝ ගණයන් අතරෙහි, මාගේ භික්ෂු සංඝයා මෙන් මෙවන් ලාභ, අග්‍ර ඵල, යසස් ලබා ඇති වෙනත් එකදු සංඝයක් වත් නොදකිමි.\n\nචුන්ද, යමෙක් මනාකොට කියන්නේ නම්, ‘සර්වාකාරයෙන් සම්පූර්ණ වූ, සර්වාකාරයෙන් පරිපූර්ණ වූ, අඩු නැති, වැඩි නැති, මනාකොට දේශනා කරන ලද, කෙළවර රහිත, පිරිපුන් බ්‍රහ්මචර්යාව මැනවින් ප්‍රකාශිතය’ යැයි කියන්නේ නම්, එය මැනවින් කියන්නෙක් විසින් එසේ කිව යුතුය. ‘සර්වාකාරයෙන් සම්පූර්ණ වූ... මැනවින් ප්‍රකාශිතය’ යැයි කියන්නේ නම් එය එසේය.\n\nචුන්ද, රාමපුත්‍ර වූ උද්දක මෙවැනි වචනයක් කීවේය. ‘දකිමින් නොදකී’ කියාය. කුමක් ද දකිමින් නොදකී කීම? මනා කොට මුවහත් කළ ක්ෂුරයක තලය දකී, එහි දාරය නොදකී. එය ‘දකිමින් නොදකී’ යැයි කියනු ලැබේ.\n\nචුන්ද, රාමපුත්‍ර උද්දක විසින් කියන ලද, පහත් වූ, ග්‍රාම්‍ය වූ, පෘථග්ජනයන්ට පොදු වූ, ආර්ය නොවන, අනර්ථයට හේතු වන එම කථාව ක්ෂුරය අරමුණු කරගෙනමය. චුන්ද, යමෙක් මනාකොට කියන්නේ නම්, ‘දකිමින් නොදකී’ යැයි කියන්නේ නම්, එයම මැනවින් කියන්නෙක් විසින් කිව යුත්තේ ‘දකිමින් නොදකී’ කියාය. කුමක් ද දකිමින් නොදකී කීම? මෙසේ සර්වාකාරයෙන් සම්පූර්ණ වූ, සර්වාකාරයෙන් පරිපූර්ණ වූ, අඩු නැති, වැඩි නැති, මනාකොට දේශනා කරන ලද, කෙළවර රහිත, පිරිපුන් බ්‍රහ්මචර්යාව මැනවින් ප්‍රකාශිතයයි දකී.\n\nමෙයින් යමක් ඉවත් කළ යුතු නම්, එයින් එය ඉතාම පිරිසිදු වේ යයි සිතා එය නොදකී. මෙයින් යමක් එකතු කළ යුතු නම්, එයින් එය පරිපූර්ණ වේ යයි සිතා එය නොදකී. චුන්ද, මෙය ‘දකිමින් නොදකී’ යැයි කියනු ලැබේ.\n\nචුන්ද, යමෙක් මනාකොට කියන්නේ නම්, ‘සර්වාකාරයෙන් සම්පූර්ණ වූ... බ්‍රහ්මචර්යාව මැනවින් ප්‍රකාශිතය’ යැයි කියන්නේ නම්, එයම මැනවින් කියන්නෙක් විසින් කිව යුත්තේ ‘සර්වාකාරයෙන් සම්පූර්ණ වූ, සර්වාකාරයෙන් පරිපූර්ණ වූ, අඩු නැති, වැඩි නැති, මනාකොට දේශනා කරන ලද, කෙළවර රහිත, පිරිපුන් බ්‍රහ්මචර්යාව මැනවින් ප්‍රකාශිතය’ කියාය.",
      "paliTitle": ""
    },
    {
      "number": 177,
      "pali": "Tasmātiha, cunda, ye vo mayā dhammā abhiññā desitā, tattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Katame ca te, cunda, dhammā mayā abhiññā desitā, yattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ? Seyyathidaṃ – cattāro satipaṭṭhānā, cattāro sammappadhānā, cattāro iddhipādā, pañcindriyāni, pañca balāni, satta bojjhaṅgā, ariyo aṭṭhaṅgiko maggo. Ime kho te, cunda, dhammā mayā abhiññā desitā. Yattha sabbeheva saṅgamma samāgamma atthena atthaṃ byañjanena byañjanaṃ saṅgāyitabbaṃ na vivaditabbaṃ, yathayidaṃ brahmacariyaṃ addhaniyaṃ assa ciraṭṭhitikaṃ, tadassa bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. ",
      "english": "Therefore, Cunda, those teachings that I have realized and taught, all of you should gather together, come together, and recite them in agreement, meaning with meaning, expression with expression, without dispute, so that this holy life may last long, be established for a long time, for the benefit of many, for the happiness of many, out of compassion for the world, for the good, benefit, and happiness of gods and humans.\n\nAnd which are those teachings, Cunda, that I have realized and taught, where all of you should gather together, come together, and recite them in agreement, meaning with meaning, expression with expression, without dispute, so that this holy life may last long, be established for a long time, for the benefit of many, for the happiness of many, out of compassion for the world, for the good, benefit, and happiness of gods and humans?\n\nThese are: the four foundations of mindfulness, the four right exertions, the four bases of power, the five faculties, the five powers, the seven factors of enlightenment, and the Noble Eightfold Path. These, Cunda, are the teachings that I have realized and taught, where all of you should gather together, come together, and recite them in agreement, meaning with meaning, expression with expression, without dispute, so that this holy life may last long, be established for a long time, for the benefit of many, for the happiness of many, out of compassion for the world, for the good, benefit, and happiness of gods and humans.",
      "sinhala": "එහෙයින්, චුන්ද, මා විසින් අවබෝධ කර දේශනා කරන ලද යම් ධර්ම කෙනෙක් වෙත් ද, එහි දී ඔබ සියල්ලන් ම එක්ව රැස්ව අර්ථයෙන් අර්ථය ද, ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය ද සංගායනා කළ යුතු ය. විවාද නො කළ යුතු ය. එසේ කිරීමෙන් මේ බ්‍ර‍හ්මචර්යාව බොහෝ කල් පවත්නේ වන්නේ ය. බොහෝ කලක් පවතින්නේ වන්නේ ය. එය බොහෝ ජනයාගේ හිත සුව පිණිස ද, ලෝකානුකම්පාව පිණිස ද, දෙව් මිනිසුන්ගේ අර්ථය පිණිස ද, හිත සුව පිණිස ද හේතු වන්නේ ය.\n\nචුන්ද, මා විසින් අවබෝධ කර දේශනා කරන ලද කවර ධර්ම කෙනෙක්හි ද ඔබ සියල්ලන් ම එක්ව රැස්ව අර්ථයෙන් අර්ථය ද, ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය ද සංගායනා කළ යුතු වන්නේ ද, විවාද නො කළ යුතු වන්නේ ද, එසේ කිරීමෙන් මේ බ්‍ර‍හ්මචර්යාව බොහෝ කල් පවත්නේ වන්නේ ද, බොහෝ කලක් පවතින්නේ වන්නේ ද, එය බොහෝ ජනයාගේ හිත සුව පිණිස ද, ලෝකානුකම්පාව පිණිස ද, දෙව් මිනිසුන්ගේ අර්ථය පිණිස ද, හිත සුව පිණිස ද හේතු වන්නේ ද? එනම් සතර සතිපට්ඨානයෝ ය, සතර සම්මප්පධානයෝ ය, සතර ඉද්ධිපාදයෝ ය, පඤ්ච ඉන්ද්‍රියයෝ ය, පඤ්ච බලයෝ ය, සප්ත බොජ්ඣංගයෝ ය, ආර්ය අෂ්ටාංගික මාර්ගය යි.\n\nචුන්ද, මා විසින් අවබෝධ කර දේශනා කරන ලද ඒ ධර්මයෝ යම් තැනක ඔබ සියල්ලන් ම එක්ව රැස්ව අර්ථයෙන් අර්ථය ද, ව්‍යඤ්ජනයෙන් ව්‍යඤ්ජනය ද සංගායනා කළ යුතු වන්නේ ද, විවාද නො කළ යුතු වන්නේ ද, එසේ කිරීමෙන් මේ බ්‍ර‍හ්මචර්යාව බොහෝ කල් පවත්නේ වන්නේ ද, බොහෝ කලක් පවතින්නේ වන්නේ ද, එය බොහෝ ජනයාගේ හිත සුව පිණිස ද, ලෝකානුකම්පාව පිණිස ද, දෙව් මිනිසුන්ගේ අර්ථය පිණිස ද, හිත සුව පිණිස ද හේතු වන්නේ ද, ඒ ධර්මයෝ මේ යයි වදාළ සේක.",
      "paliTitle": "Saṅgāyitabbadhammo",
      "englishTitle": "The Dhamma to be Recited",
      "sinhalaTitle": "සංගායනා කළ යුතු ධර්මය"
    },
    {
      "number": 178,
      "pali": "‘‘Tesañca vo, cunda, samaggānaṃ sammodamānānaṃ avivadamānānaṃ sikkhataṃ [sikkhitabbaṃ (bahūsu)] aññataro sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañceva micchā gaṇhāti, byañjanāni ca micchā ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ, anabhinanditvā appaṭikkositvā so evamassa vacanīyo – ‘imassa nu kho, āvuso, atthassa imāni vā byañjanāni etāni vā byañjanāni katamāni opāyikatarāni, imesañca [imesaṃ vā (syā. pī. ka.), imesaṃ (sī.)] byañjanānaṃ ayaṃ vā attho eso vā attho katamo opāyikataro’ti? So ce evaṃ vadeyya – ‘imassa kho, āvuso, atthassa imāneva byañjanāni opāyikatarāni, yā ceva [yañceva (sī. ka.), ṭīkā oloketabbā] etāni; imesañca [imedaṃ (sabbattha)] byañjanānaṃ ayameva attho opāyikataro, yā ceva [yañceva (sī. ka.), ṭīkā oloketabbā] eso’ti. So neva ussādetabbo na apasādetabbo, anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tassa ca atthassa tesañca byañjanānaṃ nisantiyā.",
      "english": "\"And for you, Cunda, when you are united, rejoicing together, not quarreling, and training, if one of your fellow monks should speak on the Dhamma in the Sangha, and it should occur to you, ‘This venerable one wrongly grasps both the meaning and wrongly sets forth the expressions,’ he should neither be welcomed nor rejected. Without welcoming him or rejecting him, he should be addressed thus: ‘Friend, regarding this meaning, which of these expressions, or which of those expressions, is more suitable; and regarding these expressions, which meaning, this meaning or that meaning, is more suitable?’ If he should say thus, ‘Friend, regarding this meaning, these very expressions are more suitable, that is to say, these ones; and regarding these expressions, this very meaning is more suitable, that is to say, this one,’ he should neither be exalted nor disparaged. Without exalting him or disparaging him, he should be thoroughly acquainted in his own mind with that meaning and with those expressions, as far as possible.\"",
      "sinhala": "‘‘චුන්දය, නුඹලා ඒකමතිකව, ප්‍රීතියෙන්, විවාද රහිතව, හික්මෙමින් සිටින කල්හි නුඹලාගේ සහෝදර බ්‍රහ්මචාරීන් අතුරින් කෙනෙක් සංඝ සභාවෙහි ධර්මය දේශනා කරන්නේ නම්, එහිදී නුඹලාට මෙබඳු හැඟීමක් ඇතිවිය හැකිය. ‘මේ ආයුෂ්මත් අර්ථයත් වැරදි ලෙස ගනියි. ව්‍යාංජනත් වැරදි ලෙස සකස් කරයි’ කියා. ඔහු සතුටු නොකළ යුතුයි, ප්‍රතික්ෂේප නොකළ යුතුයි. සතුටු නොකර ප්‍රතික්ෂේප නොකර ඔහුට මෙසේ කිව යුතුයි. ‘ඇවැත්නි, මේ අර්ථයට මේ ව්‍යාංජනවලින් කවර ව්‍යාංජන සමූහයක් වඩාත් උචිත වේ ද? මේ ව්‍යාංජන සමූහයට මේ අර්ථයන්ගෙන් කවර අර්ථයක් වඩාත් උචිත වේ ද?’ ඔහු මෙසේ කියන්නේ නම්, ‘ඇවැත්නි, මේ අර්ථයට මේ ව්‍යාංජන සමූහයම වඩාත් උචිත වේ. ඒ වගේම මේ ව්‍යාංජන සමූහයට මේ අර්ථයම වඩාත් උචිත වේ’ කියා. ඔහු උසස් නොකළ යුතුයි, පහත් නොකළ යුතුයි. උසස් නොකර පහත් නොකර ඔහුගේ අදහසත්, ව්‍යාංජනත් මැනවින් තහවුරු කරගත යුතුයි.\"",
      "paliTitle": "Saññāpetabbavidhi",
      "englishTitle": "Method of Instruction",
      "sinhalaTitle": "ඉගැන්වීමේ ක්‍රමය"
    },
    {
      "number": 179,
      "pali": "‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañhi kho micchā gaṇhāti byañjanāni sammā ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ, anabhinanditvā appaṭikkositvā so evamassa vacanīyo – ‘imesaṃ nu kho, āvuso, byañjanānaṃ ayaṃ vā attho eso vā attho katamo opāyikataro’ti? So ce evaṃ vadeyya – ‘imesaṃ kho, āvuso, byañjanānaṃ ayameva attho opāyikataro, yā ceva eso’ti. So neva ussādetabbo na apasādetabbo, anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tasseva atthassa nisantiyā.",
      "english": "\"And further, Cunda, if a fellow ব্রহ্মচারী were to speak on the Dhamma in the Saṅgha, and you should think, ‘This venerable one grasps the meaning wrongly, but arranges the phrases well,’ he should neither be welcomed nor rejected. Without welcoming or rejecting him, he should be addressed thus: ‘Among these phrases, friend, which is the more suitable meaning, this one or that one?’ If he should speak thus, ‘Among these phrases, friend, this meaning is more suitable, and so is that,’ he should neither be exalted nor degraded. Without exalting or degrading him, he should be carefully made to understand in his own view, and be settled in that meaning.",
      "sinhala": "‘‘තවද, චුන්ද, යම් සහබ්‍රഹ്මචාරී කෙනෙක් සංඝයෙහි ධර්මය දේශනා කරන්නේ නම්, එහිදී නුඹලාට මෙබඳු සිතක් ඇතිවිය හැකිය. ‘මේ ආයුෂ්මත් අර්ථය වරදවා ගන්නේය, ව්‍යාංජන සම්‍යක් ලෙස පිහිටුවන්නේය’ කියා. ඔහුට නො ඇලිය යුතුය, ප්‍රතික්ෂේප නොකළ යුතුය. නො ඇලී ප්‍රතික්ෂේප නොකර ඔහුට මෙසේ පැවසිය යුතුය. ‘ඇවැත්නි, මේ ව්‍යාංජනවලට මේ අර්ථයද, අර අර්ථයද, කවරක් උපායට හිතකර වන්නේද?’ කියායි. ඔහු මෙසේ කියන්නේ නම්, ‘ඇවැත්නි, මේ ව්‍යාංජනවලට මේ අර්ථයම උපායට හිතකර වන්නේය, යම් මේ අර්ථයක් වේද එයමය’ කියායි. ඔහු උසස් කොට නො සැලකිය යුතුය, පහත් කොට නො සැලකිය යුතුය. උසස් කොට නො සලකා, පහත් කොට නො සලකා, ඔහුගේම අර්ථයෙහි නිසන්ති වශයෙන් මැනවින් සතුටු කරවිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 180,
      "pali": "‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañhi kho sammā gaṇhāti byañjanāni micchā ropetī’ti. Tassa neva abhinanditabbaṃ na paṭikkositabbaṃ; anabhinanditvā appaṭikkositvā so evamassa vacanīyo – ‘imassa nu kho, āvuso, atthassa imāni vā byañjanāni etāni vā byañjanāni katamāni opāyikatarānī’ti? So ce evaṃ vadeyya – ‘imassa kho, āvuso, atthassa imāneva byañjanāni opayikatarāni, yāni ceva etānī’ti. So neva ussādetabbo na apasādetabbo; anussādetvā anapasādetvā sveva sādhukaṃ saññāpetabbo tesaññeva byañjanānaṃ nisantiyā.",
      "english": "\"And further, Cunda, if a fellow monastic were to speak on the Dhamma in the Sangha, and you were to think, 'This venerable one grasps the meaning well, but sets forth the expressions incorrectly,' one should neither approve nor reject it. Without approving or rejecting it, one should say to him, 'With regard to this meaning, friend, which of these expressions, or which of those expressions, are more suitable?' If he should say, 'With regard to this meaning, friend, these very expressions are more suitable, namely, these ones,' one should neither exalt him nor disparage him. Without exalting or disparaging him, one should carefully bring it to agreement in himself with regard to that very assembly of expressions.\"",
      "sinhala": "‘‘තවද, චුන්ද, යම් සහබ්‍රహ్මචාරියෙක් සංඝයා මැද ධර්මය දේශනා කරන්නේ නම්, එහිදී ඔබට මෙබඳු සිතක් ඇතිවිය හැකියි – ‘මේ ආයුෂ්මත් අර්ථය නම් මැනවින් ගන්නේය, ව්‍යඤ්ජන (පද) වැරදි ලෙස සකස් කරන්නේය’ කියා. ඔහුට ප්‍රශංසා කළ යුතුත් නැත, ප්‍රතික්ෂේප කළ යුතුත් නැත; ප්‍රශංසා නොකර ප්‍රතික්ෂේප නොකර ඔහුට මෙසේ පැවසිය යුතුය – ‘ඇවැත්නි, මේ අර්ථයට මේ ව්‍යඤ්ජන හෝ අර ව්‍යඤ්ජන හෝ කුමන ව්‍යඤ්ජන වඩාත් උපකාරී වේද?’ කියා විමසිය යුතුය. ඔහු එසේ කියන්නේ නම් – ‘ඇවැත්නි, මේ අර්ථයට මේ ව්‍යඤ්ජනම වඩාත් උපකාරී වේ, යම් ඒ ව්‍යඤ්ජන ඇත්නම් ඒවාම උපකාරී වේ’ කියා පැවසිය හැකිය. එවිට ඔහු උසස් කොට සැලකිය යුතුත් නැත, පහත් කොට සැලකිය යුතුත් නැත; උසස් කොට නොසලකා පහත් කොට නොසලකා ඒ ව්‍යඤ්ජනවලට එකඟව ඔහු මැනවින් සතුටු කළ යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 181,
      "pali": "‘‘Aparopi ce, cunda, sabrahmacārī saṅghe dhammaṃ bhāseyya. Tatra ce tumhākaṃ evamassa – ‘ayaṃ kho āyasmā atthañceva sammā gaṇhāti byañjanāni ca sammā ropetī’ti. Tassa ‘sādhū’ti bhāsitaṃ abhinanditabbaṃ anumoditabbaṃ; tassa ‘sādhū’ti bhāsitaṃ abhinanditvā anumoditvā so evamassa vacanīyo – ‘lābhā no āvuso, suladdhaṃ no āvuso, ye mayaṃ āyasmantaṃ tādisaṃ sabrahmacāriṃ passāma evaṃ atthupetaṃ byañjanupeta’nti. Paccayānuññātakāraṇaṃ",
      "english": "\"Furthermore, Cunda, if a fellow monastic were to speak on the Dhamma in the Sangha, and you were to think, 'This venerable one understands the meaning correctly and presents the phrasing correctly,' his words should be welcomed, rejoiced over, and approved. Having welcomed, rejoiced over, and approved his words, you should say to him, 'It is a gain for us, friend, a great gain for us, that we see such a fellow monastic who possesses both meaning and phrasing.'\" Concerning permission granted by reason.",
      "sinhala": "‘‘තවද, චුන්ද, යම් සහබ්‍රහ්මචාරියෙක් සංඝයා තුළ ධර්මය දේශනා කරන්නේ නම්, එහිදී ඔබට මෙවැනි හැඟීමක් ඇතිවිය හැකියි – ‘මේ ආයුෂ්මත් අර්ථයත් මනාව ග්‍රහණය කරගනී, ව්‍යංජනත් මනාව පිහිටුවයි’ කියා. ඔහුගේ ‘සාධු’ යන වචනය අනුමත කළ යුතුයි, සතුටු විය යුතුයි; ඔහුගේ ‘සාධු’ යන වචනය අනුමත කොට සතුටු වී මෙසේ ඔහුට පැවසිය යුතුයි – ‘ඇවැත්නි, අපට ලාභයක් වේවා, අපට මනා ලාභයක් වේවා, මන්ද යත් අපි ආයුෂ්මතුන් වැනි, අර්ථයෙන් හා ව්‍යංජනයෙන් යුක්ත වූ සහබ්‍රහ්මචාරියෙකු දකිමු’ කියායි. ප්‍රත්‍යය අනුදැන වදාරන කාරණය.",
      "paliTitle": ""
    },
    {
      "number": 182,
      "pali": "‘‘Na vo ahaṃ, cunda, diṭṭhadhammikānaṃyeva āsavānaṃ saṃvarāya dhammaṃ desemi. Na panāhaṃ, cunda, samparāyikānaṃyeva āsavānaṃ paṭighātāya dhammaṃ desemi. Diṭṭhadhammikānaṃ cevāhaṃ, cunda, āsavānaṃ saṃvarāya dhammaṃ desemi; samparāyikānañca āsavānaṃ paṭighātāya. Tasmātiha, cunda, yaṃ vo mayā cīvaraṃ anuññātaṃ, alaṃ vo taṃ – yāvadeva sītassa paṭighātāya, uṇhassa paṭighātāya, ḍaṃsamakasavātātapasarīsapa [siriṃsapa (syā.)] samphassānaṃ paṭighātāya, yāvadeva hirikopīnapaṭicchādanatthaṃ. Yo vo mayā piṇḍapāto anuññāto, alaṃ vo so yāvadeva imassa kāyassa ṭhitiyā yāpanāya vihiṃsūparatiyā brahmacariyānuggahāya, iti purāṇañca vedanaṃ paṭihaṅkhāmi, navañca vedanaṃ na uppādessāmi, yātrā ca me bhavissati anavajjatā ca phāsuvihāro ca [cāti (bahūsu)]. Yaṃ vo mayā senāsanaṃ anuññātaṃ, alaṃ vo taṃ yāvadeva sītassa paṭighātāya, uṇhassa paṭighātāya, ḍaṃsamakasavātātapasarīsapasamphassānaṃ paṭighātāya, yāvadeva utuparissayavinodana paṭisallānārāmatthaṃ. Yo vo mayā gilānapaccayabhesajja parikkhāro anuññāto, alaṃ vo so yāvadeva uppannānaṃ veyyābādhikānaṃ vedanānaṃ paṭighātāya abyāpajjaparamatāya [abyāpajjhaparamatāyāti (sī. syā. pī.), abyābajjhaparamatāya (?)]. ",
      "english": "\"Cunda, I do not teach the Dhamma only for the restraint of defilements related to the present life. Nor do I, Cunda, teach the Dhamma only for the warding off of defilements related to the future life. But I, Cunda, teach the Dhamma for the restraint of defilements related to the present life, and for the warding off of defilements related to the future life.\n\nTherefore, Cunda, the robe that I have allowed you is enough for you, only for the purpose of warding off cold, warding off heat, warding off the touch of flies, mosquitoes, wind, sun, and creeping things, only for the purpose of covering the private parts. The alms-food that I have allowed you is enough for you, only for the purpose of maintaining this body, for its continued existence, for the cessation of harm, for the support of the holy life, thinking, ‘Thus I shall ward off old feelings, and I shall not generate new feelings, and there will be sustenance for me, blamelessness, and a comfortable abiding.’ The lodging that I have allowed you is enough for you, only for the purpose of warding off cold, warding off heat, warding off the touch of flies, mosquitoes, wind, sun, and creeping things, only for the purpose of eliminating the dangers of the seasons, for the pleasure of seclusion. The medicine and provisions for the sick that I have allowed you are enough for you, only for the purpose of warding off painful feelings that have arisen, for the sake of the highest freedom from affliction.\"",
      "sinhala": "‘‘චුන්ද, මම ඔබට පෙනෙන දේවලට පමණක් ආශාවන්ගෙන් වැළකීම සඳහා ධර්මය දේශනා නොකරමි. චුන්ද, මම ඔබට මතු භවයට පමණක් ආශාවන්ගෙන් වැළකීම සඳහා ධර්මය දේශනා නොකරමි. චුන්ද, මම ඔබට පෙනෙන දේවලට ආශාවන්ගෙන් වැළකීම සඳහාත්, මතු භවයට ආශාවන්ගෙන් වැළකීම සඳහාත් ධර්මය දේශනා කරමි. එබැවින් චුන්ද, මා විසින් ඔබට අනුදැන වදාරන ලද සිවුර ඔබට ප්‍රමාණවත් වන්නේ, සීතලෙන් වැළකීම සඳහාත්, උණුසුමෙන් වැළකීම සඳහාත්, මදුරුවන්ගෙන්, මැස්සන්ගෙන්, සුළඟින්, අව්වෙන්, සර්පයන්ගෙන් හා අනෙකුත් උරගයන්ගෙන් ඇතිවන ස්පර්ශයන්ගෙන් වැළකීම සඳහාත්, යට ඇඳුමෙන් හා බාහිර ඇඳුමෙන් ශරීරය වසා ගැනීම සඳහාත් පමණි. මා විසින් ඔබට අනුදැන වදාරන ලද පිණ්ඩපාතය ඔබට ප්‍රමාණවත් වන්නේ, මෙම ශරීරයේ පැවැත්ම සඳහාත්, යැපීම සඳහාත්, විහිංසාවෙන් වැළකීම සඳහාත්, බ්‍ර‍හ්මචර්යාවට උපකාරයක් වීම සඳහාත් පමණි. මෙසේ මම පරණ වේදනාවන් දුරු කරමි, අලුත් වේදනාවන් හට නොගනිමි, මගේ ගමනද සිදුවන්නේ නිරවුල්වූද පහසුවූද විහරණයකින් යුක්තවය. මා විසින් ඔබට අනුදැන වදාරන ලද සෙනසුන ඔබට ප්‍රමාණවත් වන්නේ, සීතලෙන් වැළකීම සඳහාත්, උණුසුමෙන් වැළකීම සඳහාත්, මදුරුවන්ගෙන්, මැස්සන්ගෙන්, සුළඟින්, අව්වෙන්, සර්පයන්ගෙන් හා අනෙකුත් උරගයන්ගෙන් ඇතිවන ස්පර්ශයන්ගෙන් වැළකීම සඳහාත්, සෘතු විපර්යාසයන්ගෙන් වන කරදර දුරු කරගෙන හුදෙකලාව භාවනා කිරීම සඳහාත් පමණි. මා විසින් ඔබට අනුදැන වදාරන ලද ගිලන්පස බෙහෙත් පිරිකර ඔබට ප්‍රමාණවත් වන්නේ, හටගත් රෝගී වේදනාවන්ගෙන් වැළකීම සඳහාත්, නිරෝගී සුවය ලබා ගැනීම සඳහාත් පමණි.’’",
      "paliTitle": ""
    },
    {
      "number": 183,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘sukhallikānuyogamanuyuttā samaṇā sakyaputtiyā viharantī’ti. Evaṃvādino [vadamānā (syā.)], cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘katamo so, āvuso, sukhallikānuyogo? Sukhallikānuyogā hi bahū anekavihitā nānappakārakā’ti. ‘‘Cattārome, cunda, sukhallikānuyogā hīnā gammā pothujjanikā anariyā anatthasaṃhitā na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattanti. Katame cattāro? ‘‘Idha, cunda, ekacco bālo pāṇe vadhitvā vadhitvā attānaṃ sukheti pīṇeti. Ayaṃ paṭhamo sukhallikānuyogo. ‘‘Puna caparaṃ, cunda, idhekacco adinnaṃ ādiyitvā ādiyitvā attānaṃ sukheti pīṇeti. Ayaṃ dutiyo sukhallikānuyogo. ‘‘Puna caparaṃ, cunda, idhekacco musā bhaṇitvā bhaṇitvā attānaṃ sukheti pīṇeti. Ayaṃ tatiyo sukhallikānuyogo. ‘‘Puna caparaṃ, cunda, idhekacco pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti. Ayaṃ catuttho sukhallikānuyogo. ‘‘Ime kho, cunda, cattāro sukhallikānuyogā hīnā gammā pothujjanikā anariyā anatthasaṃhitā na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattanti. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘‘ime cattāro sukhallikānuyoge anuyuttā samaṇā sakyaputtiyā viharantī’ti. Te vo [te (sī. pī.)] ‘māhevaṃ’ tissu vacanīyā. Na te vo sammā vadamānā vadeyyuṃ, abbhācikkheyyuṃ asatā abhūtena.",
      "english": "\"Now, Cunda, it is possible that wanderers of other sects might speak thus: ‘The Sakyan monks live devoted to indulgence in pleasure.’\"\n\n\"If wanderers of other sects should speak thus, Cunda, they should be addressed thus: ‘But what, friends, is that indulgence in pleasure? For indulgences in pleasure are many, varied, of diverse kinds.’\"\n\n\"These four, Cunda, are indulgences in pleasure that are low, coarse, worldly, ignoble, not connected with the goal, not conducive to revulsion, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbana. Which four?\"\n\n\"Here, Cunda, some foolish person, by killing living beings, by killing, makes himself happy and pleased. This is the first indulgence in pleasure.\"\n\n\"Again, Cunda, here some person, by taking what is not given, by taking, makes himself happy and pleased. This is the second indulgence in pleasure.\"\n\n\"Again, Cunda, here some person, by speaking falsehood, by speaking, makes himself happy and pleased. This is the third indulgence in pleasure.\"\n\n\"Again, Cunda, here some person lives devoted to the five strands of sense pleasure, furnished with them, immersed in them. This is the fourth indulgence in pleasure.\"\n\n\"These, Cunda, are the four indulgences in pleasure that are low, coarse, worldly, ignoble, not connected with the goal, not conducive to revulsion, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbana.\"\n\n\"Now, Cunda, it is possible that wanderers of other sects might speak thus: ‘The Sakyan monks live devoted to these four indulgences in pleasure.’ They should be told, ‘Not so.’ They would not be speaking correctly, they would be accusing you with what is untrue, with what did not happen.\"",
      "sinhala": "‘‘චුන්ද, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ‘ශාක්‍යපුත්‍රීය ශ්‍ර‍මණහු සැප පහසුවෙහි ඇලී වාසය කරති’ යි මෙසේ කියන්නාහු නම්, එය එසේ විය හැකි ය. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ කිව යුතු ය: ‘ඇවැත්නි, ඒ සැප පහසුවෙහි ඇලීම කවරේ ද? මන්ද යත් සැප පහසුවෙහි ඇලීම් බොහෝ ය; නොයෙක් ආකාර ඇත්තේ ය; නානාප්‍ර‍කාර ඇත්තේ ය’ කියායි.\n\n‘‘චුන්ද, පහත් වූ, ග්‍රාම්‍ය වූ, පෘථග්ජනයන්ට පොදු වූ, ආර්ය නොවන, අනර්ථයට හේතු වන, කලකිරීම පිණිස නො වන, විරාගය පිණිස නො වන, නිරෝධය පිණිස නො වන, උපසමය පිණිස නො වන, අභිඥා පිණිස නො වන, සම්බෝධිය පිණිස නො වන, නිර්වාණය පිණිස නො වන සුව සෙවීම් සතරෙකි. ඒ සතර කවරේ ද?\n\n‘‘චුන්ද, මෙලොව ඇතැමෙක් අඥානයෙන් ප්‍රාණීන් මර මරා තමා සතුටු කරයි; සන්තර්පණය කරයි. මේ පළමු වන සුව සෙවීම යි.\n\n‘‘චුන්ද, තව ද මෙලොව ඇතැමෙක් නුදුන් දේ ගෙන ගෙන තමා සතුටු කරයි; සන්තර්පණය කරයි. මේ දෙවන සුව සෙවීම යි.\n\n‘‘චුන්ද, තව ද මෙලොව ඇතැමෙක් බොරු කියා කියා තමා සතුටු කරයි; සන්තර්පණය කරයි. මේ තුන් වන සුව සෙවීම යි.\n\n‘‘චුන්ද, තව ද මෙලොව ඇතැමෙක් පස් කම් ගුණයෙන් යුක්ත ව, සමෘද්ධ ව සේවනය කරයි. මේ සිව් වන සුව සෙවීම යි.\n\n‘‘චුන්ද, මේ සතර සුව සෙවීම් පහත් වූ, ග්‍රාම්‍ය වූ, පෘථග්ජනයන්ට පොදු වූ, ආර්ය නොවන, අනර්ථයට හේතු වන, කලකිරීම පිණිස නො වන, විරාගය පිණිස නො වන, නිරෝධය පිණිස නො වන, උපසමය පිණිස නො වන, අභිඥා පිණිස නො වන, සම්බෝධිය පිණිස නො වන, නිර්වාණය පිණිස නො වෙත්.\n\n‘‘චුන්ද, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ‘ශාක්‍යපුත්‍රීය ශ්‍ර‍මණහු මේ සතර සුව සෙවීම්වල ඇලී වාසය කරති’ යි මෙසේ කියන්නාහු නම්, එය එසේ විය හැකි ය. ‘එය එසේ නො වේ’ යයි තෙපි ඔවුන්ට කිව යුතු ය. ඔවුහු තොපට මනා ව කියන්නාහු නො වෙති. නැති, බොරු දෙයකින් චෝදනා කරති.",
      "paliTitle": "Sukhallikānuyogo",
      "englishTitle": "Pursuit of Sensual Pleasures",
      "sinhalaTitle": "සැප අනුයෝගය"
    },
    {
      "number": 184,
      "pali": "‘‘Cattārome, cunda, sukhallikānuyogā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. Katame cattāro? ‘‘Idha, cunda, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Ayaṃ paṭhamo sukhallikānuyogo. ‘‘Puna caparaṃ, cunda, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. Ayaṃ dutiyo sukhallikānuyogo. ‘‘Puna caparaṃ, cunda, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. Ayaṃ tatiyo sukhallikānuyogo. ‘‘Puna caparaṃ, cunda, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayaṃ catuttho sukhallikānuyogo. ‘‘Ime kho, cunda, cattāro sukhallikānuyogā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘‘ime cattāro sukhallikānuyoge anuyuttā samaṇā sakyaputtiyā viharantī’ti. Te vo ‘evaṃ’ tissu vacanīyā. Sammā te vo vadamānā vadeyyuṃ, na te vo abbhācikkheyyuṃ asatā abhūtena. ",
      "english": "\"These four pursuits of happiness, Cunda, lead to utter disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbāna. Which four? Here, Cunda, a bhikkhu, quite secluded from sense pleasures, secluded from unwholesome states, enters and abides in the first jhāna, which is accompanied by thought and examination, born of seclusion, filled with rapture and joy. This is the first pursuit of happiness. Further, Cunda, with the subsiding of thought and examination… the bhikkhu enters and abides in the second jhāna… This is the second pursuit of happiness. Further, Cunda, with the fading away of rapture… the bhikkhu enters and abides in the third jhāna… This is the third pursuit of happiness. Further, Cunda, with the abandoning of pleasure and pain… the bhikkhu enters and abides in the fourth jhāna… This is the fourth pursuit of happiness. These, Cunda, are the four pursuits of happiness that lead to utter disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbāna. Now, Cunda, it is possible that wanderers of other sects might speak thus: ‘The ascetics who are Sakya’s sons abide pursuing these four pursuits of happiness.’ If they should speak thus, you should say ‘Yes.’ Speaking thus, they would be speaking rightly; they would not be misrepresenting you with what is untrue and unfounded.\"",
      "sinhala": "‘‘චුන්ද, ඒකාන්ත වශයෙන් කලකිරීමට, ඇලීම දුරු කිරීමට, නිරෝධයට, සන්සිඳීමට, විශේෂ දැනුමට, සම්බෝධියට, නිර්වාණයට හේතුවන සුව අනුභූතිවල යෙදීම් සතරක් ඇත. කවර සතරක් ද යත්: ‘‘චුන්ද, මෙහි භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. මෙය පළමු සුව අනුභූතියෙහි යෙදීමයි. ‘‘තවද චුන්ද, භික්ෂුව විතර්ක විචාරයන්ගේ සංසිඳීමෙන්…පෙ.… දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. මෙය දෙවන සුව අනුභූතියෙහි යෙදීමයි. ‘‘තවද චුන්ද, භික්ෂුව ප්‍රීතිය කෙරෙහිද ඇල්ම දුරු කිරීමෙන්…පෙ.… තුන්වන ධ්‍යානයට පැමිණ වාසය කරයි. මෙය තුන්වන සුව අනුභූතියෙහි යෙදීමයි. ‘‘තවද චුන්ද, භික්ෂුව සැපයද දුරු කිරීමෙන්, දුකද දුරු කිරීමෙන්…පෙ.… සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. මෙය සිව්වන සුව අනුභූතියෙහි යෙදීමයි. ‘‘චුන්ද, මේ සුව අනුභූතිවල යෙදීම් සතර ඒකාන්ත වශයෙන් කලකිරීමට, ඇලීම දුරු කිරීමට, නිරෝධයට, සන්සිඳීමට, විශේෂ දැනුමට, සම්බෝධියට, නිර්වාණයට හේතු වෙයි. ‘‘චුන්ද, ශාක්‍යපුත්‍ර වූ ශ්‍රමණවරු මේ සුව අනුභූතිවල යෙදීම් සතරෙහි නිරතව වාසය කරති යැයි වෙනත් තීර්ථක පරිබ්‍රාජකයෝ යම් වචනයක් කියන්නට ඉඩ තිබේ. ඔවුන්ට ‘එසේය’යි ඔබ විසින් පැවසිය යුතුය. ඔවුන් එසේ කියන්නේ මැනවින් කියමනකි. ඔවුන් ඔබව නැති දෙයකින් බොරුවෙන් අපහාස නොකරයි.",
      "paliTitle": ""
    },
    {
      "number": 185,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘ime panāvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ kati phalāni katānisaṃsā pāṭikaṅkhā’ti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘ime kho, āvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ cattāri phalāni cattāro ānisaṃsā pāṭikaṅkhā. Katame cattāro? Idhāvuso, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. Idaṃ paṭhamaṃ phalaṃ, paṭhamo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. Idaṃ dutiyaṃ phalaṃ, dutiyo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti, tattha parinibbāyī anāvattidhammo tasmā lokā. Idaṃ tatiyaṃ phalaṃ, tatiyo ānisaṃso. Puna caparaṃ, āvuso, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Idaṃ catutthaṃ phalaṃ catuttho ānisaṃso. Ime kho, āvuso, cattāro sukhallikānuyoge anuyuttānaṃ viharataṃ imāni cattāri phalāni, cattāro ānisaṃsā pāṭikaṅkhā’’ti. ",
      "english": "\"This situation exists, Cunda, where other sectarians and wanderers might say this: 'But, friend, what fruits and benefits are to be expected from those who live devoted to these four indulgences in happiness?' When other sectarians and wanderers say this, Cunda, they should be told this: 'These four fruits and four benefits are to be expected from those who live devoted to these four indulgences in happiness. Which four? Here, friend, a bhikkhu, with the destruction of three fetters, is a stream-enterer, not subject to falling into states of woe, assured, destined for enlightenment. This is the first fruit, the first benefit. Further, friend, a bhikkhu, with the destruction of three fetters and with the weakening of greed, hatred, and delusion, is a once-returner, returning only once to this world, he makes an end of suffering. This is the second fruit, the second benefit. Further, friend, a bhikkhu, with the destruction of the five lower fetters, is reborn spontaneously, there he attains final Nibbana, not liable to return from that world. This is the third fruit, the third benefit. Further, friend, a bhikkhu, with the destruction of the taints, having realized it for himself with direct knowledge, here and now enters and abides in the taintless liberation of mind, liberation by wisdom. This is the fourth fruit, the fourth benefit. These, friend, are the four fruits and four benefits to be expected from those who live devoted to these four indulgences in happiness.'\"",
      "sinhala": "‘‘චුන්ද, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ කියන්නාහු නම්, ‘ඇවැත්නි, මේ සුවල්ලිකානුයෝගයෙහි යෙදුණුවන්ට කෙතෙක් ඵල කී දෙනෙක් විපාක අපේක්‍ෂා කළ හැකි දැ’යි යම් තැනෙක් ඇද්ද, එය වන්නේ ය. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ කිව යුතුයි. ‘ඇවැත්නි, සුවල්ලිකානුයෝගයෙහි යෙදුණුවන්ට ඵල හතරක් හා ආනිසංස හතරක් අපේක්‍ෂා කළ හැකි වෙයි. කවර සතරක් ද යත්: ඇවැත්නි, මෙහි භික්‍ෂුව සංයෝජන තුනක් ක්ෂය කිරීමෙන් සෝතාපන්න වන්නේ ය. ඔහු අපායට නො යන ස්වභාව ඇත්තේ ය. නියත වශයෙන් ම සම්බෝධියට පැමිණෙන්නේ ය. ඇවැත්නි, මෙය පළමු ඵලය යි, පළමු ආනිසංස යි. තවද ඇවැත්නි, භික්‍ෂුව සංයෝජන තුනක් ක්ෂය කිරීමෙන් රාග, ද්වේෂ, මෝහ සිහින් වීමෙන් සකෘදාගාමී වන්නේ ය. ඔහු එක් වරක් පමණක් මේ ලෝකයට පැමිණ දුකට කෙළවර කරයි. ඇවැත්නි, මෙය දෙවන ඵලය යි, දෙවන ආනිසංස යි. තවද ඇවැත්නි, භික්‍ෂුව ඕරම්භාගීය සංයෝජන පහක් ක්ෂය කිරීමෙන් ඕපපාතික වන්නේ ය. එහි දී පිරිනිවන් පාන්නේ ය. ඔහු ඒ ලෝකයෙන් නැවත නො එන්නේ ය. ඇවැත්නි, මෙය තෙවන ඵලය යි, තෙවන ආනිසංස යි. තවද ඇවැත්නි, භික්‍ෂුව ආශ්‍රවයන් ක්ෂය කිරීමෙන් නිර්‍ආශ්‍රව වූ චිත්ත විමුක්තිය හා ප්‍රඥා විමුක්තිය මෙලොවදීම තමා විසින් ම විශිෂ්ඨ ඥානයෙන් දැන අවබෝධ කොට ඊට පැමිණ වාසය කරයි. ඇවැත්නි, මෙය සිව්වන ඵලය යි, සිව්වන ආනිසංස යි. ඇවැත්නි, සුවල්ලිකානුයෝගයෙහි යෙදුණුවන්ට මේ ඵල හතර හා ආනිසංස හතර අපේක්‍ෂා කළ හැකි වෙයි’\"",
      "paliTitle": "Sukhallikānuyogānisaṃso",
      "englishTitle": "Benefits of Pursuing Sensual Pleasure",
      "sinhalaTitle": "සුව විහරණයේ ආනිසංසය"
    },
    {
      "number": 186,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘aṭṭhitadhammā samaṇā sakyaputtiyā viharantī’ti. Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘atthi kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena sāvakānaṃ dhammā desitā paññattā yāvajīvaṃ anatikkamanīyā. Seyyathāpi, āvuso, indakhīlo vā ayokhīlo vā gambhīranemo sunikhāto acalo asampavedhī. Evameva kho, āvuso, tena bhagavatā jānatā passatā arahatā sammāsambuddhena sāvakānaṃ dhammā desitā paññattā yāvajīvaṃ anatikkamanīyā. Yo so, āvuso, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, abhabbo so nava ṭhānāni ajjhācarituṃ. Abhabbo, āvuso, khīṇāsavo bhikkhu sañcicca pāṇaṃ jīvitā voropetuṃ; abhabbo khīṇāsavo bhikkhu adinnaṃ theyyasaṅkhātaṃ ādiyituṃ; abhabbo khīṇāsavo bhikkhu methunaṃ dhammaṃ paṭisevituṃ; abhabbo khīṇāsavo bhikkhu sampajānamusā bhāsituṃ; abhabbo khīṇāsavo bhikkhu sannidhikārakaṃ kāme paribhuñjituṃ seyyathāpi pubbe āgārikabhūto; abhabbo khīṇāsavo bhikkhu chandāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu dosāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu mohāgatiṃ gantuṃ; abhabbo khīṇāsavo bhikkhu bhayāgatiṃ gantuṃ. Yo so, āvuso, bhikkhu arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto, abhabbo so imāni nava ṭhānāni ajjhācaritu’’nti. ",
      "english": "\"Cunda, it is possible that other sectarians might say, 'The ascetics who are followers of the Sakyan live an unstable life.' Cunda, when other sectarians say this, they should be told, 'Friends, the Blessed One, the Knower, the Seer, the Worthy One, the Fully Enlightened One, has taught and laid down for his disciples principles that are not to be transgressed as long as life lasts. Just as, friends, an Indrakhila pillar or an iron pillar is deeply embedded, well-fixed, unshakeable, and unperturbed, so too, friends, the Blessed One, the Knower, the Seer, the Worthy One, the Fully Enlightened One, has taught and laid down for his disciples principles that are not to be transgressed as long as life lasts. That bhikkhu, friends, who is an Arahant, one who has destroyed the taints, who has lived the holy life, done what was to be done, laid down the burden, attained his own welfare, utterly destroyed the fetters of becoming, and is liberated through perfect knowledge, is incapable of committing these nine things. An Arahant, a bhikkhu who has destroyed the taints, is incapable, friends, of intentionally depriving a living being of life; an Arahant, a bhikkhu who has destroyed the taints, is incapable of taking what is not given, in what is regarded as theft; an Arahant, a bhikkhu who has destroyed the taints, is incapable of engaging in sexual intercourse; an Arahant, a bhikkhu who has destroyed the taints, is incapable of knowingly speaking a lie; an Arahant, a bhikkhu who has destroyed the taints, is incapable of enjoying sensual pleasures after hoarding, as he formerly did when a householder; an Arahant, a bhikkhu who has destroyed the taints, is incapable of going to a wrong destination through desire; an Arahant, a bhikkhu who has destroyed the taints, is incapable of going to a wrong destination through hatred; an Arahant, a bhikkhu who has destroyed the taints, is incapable of going to a wrong destination through delusion; an Arahant, a bhikkhu who has destroyed the taints, is incapable of going to a wrong destination through fear. That bhikkhu, friends, who is an Arahant, one who has destroyed the taints, who has lived the holy life, done what was to be done, laid down the burden, attained his own welfare, utterly destroyed the fetters of becoming, and is liberated through perfect knowledge, is incapable of committing these nine things.'\"",
      "sinhala": "‘‘චුන්ද, ශාක්‍යපුත්‍රීය ශ්‍ර‍මණහු ‘නො පිහිටි දැහැති ව වෙසෙත්’ යි යම් අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ කියන්නාහු නම්, එය එසේ විය හැකි කරුණෙකි. චුන්ද, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ කියන්නාහු ‘ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින් දන්නා දකින අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ විසින් ශ්‍රාවකයන්ට ජීවිතාන්තය දක්වා නො ඉක්මවිය යුතු ධර්ම දේශනා කොට පණවා ඇත. ඇවැත්නි, යම් සේ ගැඹුරු වළකින් යුක්ත ව මැනවින් සිටුවන ලද නො සෙල්වෙන නො සැලෙන ඉන්ද්‍රඛීලයක් හෝ යකඩ කණුවක් හෝ වේ ද, එපරිද්දෙන් ම ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ විසින් දන්නා දකින අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ විසින් ශ්‍රාවකයන්ට ජීවිතාන්තය දක්වා නො ඉක්මවිය යුතු ධර්ම දේශනා කොට පණවා ඇත. ඇවැත්නි, යම් ඒ භික්ෂුවක් අර්හත් වූ කෙලෙස් නසා වාසය කළ කටයුතු කරන ලද බර බහාලූ උතුම් අර්ථය ලැබූ භවසංයෝජන ක්ෂය කළ මනා දැනුමෙන් මිදුණේ වේ නම්, හෙතෙම නව ස්ථානයන්හි හැසිරීමට නුසුදුසු ය. ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් සිතා ම සතුන්ගේ ප්‍රාණය ජීවිතයෙන් පහ කිරීමට නුසුදුසු ය; ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් නුදුන් දෙය සොර සිතින් ගැනීමට නුසුදුසු ය; ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් මෛථුනයෙහි හැසිරීමට නුසුදුසු ය; ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් දැන දැන ම බොරු කීමට නුසුදුසු ය; ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් පෙර ගිහි ගෙයි විසූ පරිද්දෙන් පරිභෝගය සඳහා රැස්කරන ලද කාමයන් පරිභෝග කිරීමට නුසුදුසු ය; ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් ඡන්දයෙන් අගතියට යාමට නුසුදුසු ය; ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් ද්වේෂයෙන් අගතියට යාමට නුසුදුසු ය; ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් මෝහයෙන් අගතියට යාමට නුසුදුසු ය; ඇවැත්නි, ක්ෂීණාශ්‍රව භික්ෂුවක් භයින් අගතියට යාමට නුසුදුසු ය. ඇවැත්නි, යම් ඒ භික්ෂුවක් අර්හත් වූ කෙලෙස් නසා වාසය කළ කටයුතු කරන ලද බර බහාලූ උතුම් අර්ථය ලැබූ භවසංයෝජන ක්ෂය කළ මනා දැනුමෙන් මිදුණේ වේ නම්, හෙතෙම මේ නව ස්ථානයන්හි හැසිරීමට නුසුදුසු ය’ යි මෙසේ කිය යුතු ය.’’",
      "paliTitle": "Khīṇāsavaabhabbaṭhānaṃ",
      "englishTitle": "Impossibilities for an Arahant",
      "sinhalaTitle": "අරහත් කළ නොහැකි තැන්"
    },
    {
      "number": 187,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘atītaṃ kho addhānaṃ ārabbha samaṇo gotamo atīrakaṃ ñāṇadassanaṃ paññapeti, no ca kho anāgataṃ addhānaṃ ārabbha atīrakaṃ ñāṇadassanaṃ paññapeti, tayidaṃ kiṃsu tayidaṃ kathaṃsū’ti? Te ca aññatitthiyā paribbājakā aññavihitakena ñāṇadassanena aññavihitakaṃ ñāṇadassanaṃ paññapetabbaṃ maññanti yathariva bālā abyattā. Atītaṃ kho, cunda, addhānaṃ ārabbha tathāgatassa satānusāri ñāṇaṃ hoti; so yāvatakaṃ ākaṅkhati tāvatakaṃ anussarati. Anāgatañca kho addhānaṃ ārabbha tathāgatassa bodhijaṃ ñāṇaṃ uppajjati – ‘ayamantimā jāti, natthidāni punabbhavo’ti. ‘Atītaṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti. Atītaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ anatthasaṃhitaṃ, tampi tathāgato na byākaroti. Atītaṃ cepi cunda, hoti bhūtaṃ tacchaṃ atthasaṃhitaṃ, tatra kālaññū tathāgato hoti tassa pañhassa veyyākaraṇāya. Anāgataṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti…pe… tassa pañhassa veyyākaraṇāya. Paccuppannaṃ cepi, cunda, hoti abhūtaṃ atacchaṃ anatthasaṃhitaṃ, na taṃ tathāgato byākaroti. Paccuppannaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ anatthasaṃhitaṃ, tampi tathāgato na byākaroti. Paccuppannaṃ cepi, cunda, hoti bhūtaṃ tacchaṃ atthasaṃhitaṃ, tatra kālaññū tathāgato hoti tassa pañhassa veyyākaraṇāya.",
      "english": "\"Now, Cunda, it is possible that other sectarians, wanderers, might speak thus: ‘Concerning the past, the ascetic Gotama declares definite knowledge and vision, but concerning the future he does not declare definite knowledge and vision; what is this, how is this?’ Those other sectarians, wanderers, consider that definite knowledge and vision should be declared by knowledge and vision that is otherwise fashioned, like foolish, unskilled people. But, Cunda, concerning the past, the Tathāgata has a recollecting knowledge that follows upon memory; he remembers as much as he wants. And concerning the future, a knowledge born of awakening arises for the Tathāgata: ‘This is the last birth; now there is no further becoming.’ And even if, Cunda, concerning the past, something is untrue, factless, and unbeneficial, the Tathāgata does not declare that. And even if, Cunda, concerning the past, something is true, factual, but unbeneficial, the Tathāgata does not declare that either. And even if, Cunda, concerning the past, something is true, factual, and beneficial, the Tathāgata knows the right time for answering that question. And even if, Cunda, concerning the future, something is untrue, factless, and unbeneficial, the Tathāgata does not declare that… he knows the right time for answering that question. And even if, Cunda, concerning the present, something is untrue, factless, and unbeneficial, the Tathāgata does not declare that. And even if, Cunda, concerning the present, something is true, factual, but unbeneficial, the Tathāgata does not declare that either. And even if, Cunda, concerning the present, something is true, factual, and beneficial, the Tathāgata knows the right time for answering that question.\"",
      "sinhala": "‘‘චුන්ද, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ කියන්නට ඉඩ තිබෙන කරුණක් ඇත. ‘ශ්‍රමණ ගෞතමයන් අතීත කාලය අරභයා පූර්ණ ඥාන දර්ශනයක් ප්‍රකාශ කරයි. එහෙත් අනාගත කාලය අරභයා පූර්ණ ඥාන දර්ශනයක් ප්‍රකාශ නොකරයි. මෙය කෙසේද? මෙය කුමක් නිසාද?’ යනුවෙනි. ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ වෙනත් ආකාරයක ඥාන දර්ශනයකින් වෙනත් ආකාරයක ඥාන දර්ශනයක් ප්‍රකාශ කළ යුතු යැයි සිතති. එය හරියට බාලයන් මෙන්, අව්‍යක්තයන් මෙන් වෙයි. චුන්ද, අතීත කාලය අරභයා තථාගතයන් වහන්සේට සිහිය අනුව යන ඥානයක් වෙයි. උන්වහන්සේ කැමති පමණක් සිහිපත් කරති. චුන්ද, අනාගත කාලය අරභයා තථාගතයන් වහන්සේට ‘මේ අන්තිම ජාතියයි. දැන් නැවත ඉපදීමක් නැත’ යන බෝධිජ ඥානය උපදී.\n\nචුන්ද, යම් අතීතයක් අභූත, අතථ්‍ය, අනර්ථ සහිත වේ නම්, තථාගතයන් වහන්සේ එය ව්‍යාකරණය නොකරති. චුන්ද, යම් අතීතයක් භූත, තථ්‍ය, අනර්ථ සහිත වේ නම්, තථාගතයන් වහන්සේ එය ද ව්‍යාකරණය නොකරති. චුන්ද, යම් අතීතයක් භූත, තථ්‍ය, අර්ථ සහිත වේ නම්, තථාගතයන් වහන්සේ ඒ ප්‍රශ්නයට විසඳුම් දීමට කාලය දන්නා කෙනෙක් වෙති. චුන්ද, යම් අනාගතයක් අභූත, අතථ්‍ය, අනර්ථ සහිත වේ නම්, තථාගතයන් වහන්සේ එය ව්‍යාකරණය නොකරති. …පෙ… ඒ ප්‍රශ්නයට විසඳුම් දීමට කාලය දන්නා කෙනෙක් වෙති. චුන්ද, යම් වර්තමානයක් අභූත, අතථ්‍ය, අනර්ථ සහිත වේ නම්, තථාගතයන් වහන්සේ එය ව්‍යාකරණය නොකරති. චුන්ද, යම් වර්තමානයක් භූත, තථ්‍ය, අනර්ථ සහිත වේ නම්, තථාගතයන් වහන්සේ එය ද ව්‍යාකරණය නොකරති. චුන්ද, යම් වර්තමානයක් භූත, තථ්‍ය, අර්ථ සහිත වේ නම්, තථාගතයන් වහන්සේ ඒ ප්‍රශ්නයට විසඳුම් දීමට කාලය දන්නා කෙනෙක් වෙති.’’",
      "paliTitle": "Pañhābyākaraṇaṃ",
      "englishTitle": "Explanation of Questions",
      "sinhalaTitle": "ප්‍රශ්න විවරණය"
    },
    {
      "number": 188,
      "pali": "‘‘Iti kho, cunda, atītānāgatapaccuppannesu dhammesu tathāgato kālavādī [kālavādī saccavādī (syā.)] bhūtavādī atthavādī dhammavādī vinayavādī, tasmā ‘tathāgato’ti vuccati. Yañca kho, cunda, sadevakassa lokassa samārakassa sabrahmakassa sassamaṇabrāhmaṇiyā pajāya sadevamanussāya diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā, sabbaṃ tathāgatena abhisambuddhaṃ, tasmā ‘tathāgato’ti vuccati. Yañca, cunda, rattiṃ tathāgato anuttaraṃ sammāsambodhiṃ abhisambujjhati, yañca rattiṃ anupādisesāya nibbānadhātuyā parinibbāyati, yaṃ etasmiṃ antare bhāsati lapati niddisati. Sabbaṃ taṃ tatheva hoti no aññathā, tasmā ‘tathāgato’ti vuccati. Yathāvādī, cunda, tathāgato tathākārī, yathākārī tathāvādī. Iti yathāvādī tathākārī, yathākārī tathāvādī, tasmā ‘tathāgato’ti vuccati. Sadevake loke, cunda, samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya tathāgato abhibhū anabhibhūto aññadatthudaso vasavattī, tasmā ‘tathāgato’ti vuccati. ",
      "english": "\"Thus, Cunda, in regard to past, future, and present phenomena, the Tathāgata is a speaker of what is timely, a speaker of what is true, a speaker of what is factual, a speaker of what is meaningful, a speaker of what is in accordance with the Dhamma, a speaker of what is in accordance with the Discipline. Therefore, he is called 'Tathāgata.' Moreover, Cunda, whatever has been seen, heard, sensed, known, attained, sought after, and pondered over by the mind of the world with its devas, Māras, and Brahmās, its generation with ascetics and brahmins, its devas and humans, all this has been fully awakened to by the Tathāgata. Therefore, he is called 'Tathāgata.' Furthermore, Cunda, the night the Tathāgata awakens to unsurpassed perfect self-awakening, and the night he attains final liberation in the element of nibbāna without remainder, whatever he speaks, utters, or points out in between, all that is just so, not otherwise. Therefore, he is called 'Tathāgata.' As he speaks, Cunda, so the Tathāgata does; as he does, so he speaks. Thus, as he speaks, so he does; as he does, so he speaks. Therefore, he is called 'Tathāgata.' In the world with its devas, Cunda, with its Māras and Brahmās, its generation with ascetics and brahmins, its devas and humans, the Tathāgata is the conqueror, the unconquered, the all-seeing, the sovereign. Therefore, he is called 'Tathāgata.'\"",
      "sinhala": "‘‘චුන්ද, අතීත, අනාගත, වර්තමාන ධර්මයන්හි තථාගතයන් වහන්සේ කාලවාදී, භූතවාදී, අර්ථවාදී, ධර්මවාදී, විනයවාදී වෙති. එබැවින් ‘තථාගත’ යැයි කියනු ලැබේ. චුන්ද, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත ලෝකයාට, දෙවි මිනිසුන් සහිත ප්‍රජාවට යමක් දක්නා ලද ද, අසන ලද ද, දැනෙන ලද ද, විඤ්ඤාණයෙන් දන්නා ලද ද, පැමිණෙන ලද ද, සොයන ලද ද, මනසින් විමසන ලද ද, ඒ සියල්ල තථාගතයන් වහන්සේ විසින් අවබෝධ කරගෙන ඇත. එබැවින් ‘තථාගත’ යැයි කියනු ලැබේ. චුන්ද, යම් රාත්‍රියක තථාගතයන් වහන්සේ අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කරගන්නා සේක් ද, යම් රාත්‍රියක උපාධි රහිත නිර්වාණ ධාතුවෙන් පිරිනිවන් පානා සේක් ද, ඒ අතර කාලයේ යමක් භාෂා කරන සේක් ද, දේශනා කරන සේක් ද, පෙන්වා දෙන සේක් ද, ඒ සියල්ල එසේම වන්නේය. වෙනස් නොවන්නේය. එබැවින් ‘තථාගත’ යැයි කියනු ලැබේ. චුන්ද, තථාගතයන් වහන්සේ යම් වාක්‍යයක් පවසන සේක් නම්, එසේම කරන සේක. යම් ක්‍රියාවක් කරන සේක් නම්, එසේම වදාරන සේක. මෙසේ යම් වාක්‍යයක් පවසන සේක් නම්, එසේම කරන සේක. යම් ක්‍රියාවක් කරන සේක් නම්, එසේම වදාරන සේක. එබැවින් ‘තථාගත’ යැයි කියනු ලැබේ. චුන්ද, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත ලෝකයෙහි, දෙවි මිනිසුන් සහිත ප්‍රජාව කෙරෙහි තථාගතයන් වහන්සේ අභිභවනය කළ හැකි කිසිවෙකු නැති උතුම් වූ ද, අන්‍යයන්ට යහපත පෙන්වන සේක් වූ ද, සියල්ලෙහි ස්වාමීත්වය ඇත්තාහු ද වෙති. එබැවින් ‘තථාගත’ යැයි කියනු ලැබේ.’’",
      "paliTitle": ""
    },
    {
      "number": 189,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ nu kho, āvuso, hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘abyākataṃ kho, āvuso, bhagavatā – ‘‘hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘etampi kho, āvuso, bhagavatā abyākataṃ – ‘‘na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, hoti ca na ca hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘abyākataṃ kho etaṃ, āvuso, bhagavatā – ‘‘hoti ca na ca hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘etampi kho, āvuso, bhagavatā abyākataṃ – ‘‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kasmā panetaṃ, āvuso, samaṇena gotamena abyākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘na hetaṃ, āvuso, atthasaṃhitaṃ na dhammasaṃhitaṃ na ādibrahmacariyakaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati, tasmā taṃ bhagavatā abyākata’nti. ",
      "english": "\"Now, Cunda, it is possible that other sectarians and wanderers might say this: ‘What, indeed, good sir, happens to the Tathāgata after death? This alone is true; other views are worthless.’ Cunda, when other sectarians and wanderers speak thus, you should say this to them: ‘This, good sirs, has been declared undeclared by the Blessed One: “The Tathāgata exists after death. This alone is true; other views are worthless.”’\n\n\"Now, Cunda, it is possible that other sectarians and wanderers might say this: ‘What, indeed, good sir, does the Tathāgata not exist after death? This alone is true; other views are worthless.’ Cunda, when other sectarians and wanderers speak thus, you should say this to them: ‘This too, good sirs, has been declared undeclared by the Blessed One: “The Tathāgata does not exist after death. This alone is true; other views are worthless.”’\n\n\"Now, Cunda, it is possible that other sectarians and wanderers might say this: ‘What, indeed, good sir, does the Tathāgata both exist and not exist after death? This alone is true; other views are worthless.’ Cunda, when other sectarians and wanderers speak thus, you should say this to them: ‘This has been declared undeclared by the Blessed One: “The Tathāgata both exists and does not exist after death. This alone is true; other views are worthless.”’\n\n\"Now, Cunda, it is possible that other sectarians and wanderers might say this: ‘What, indeed, good sir, does the Tathāgata neither exist nor not exist after death? This alone is true; other views are worthless.’ Cunda, when other sectarians and wanderers speak thus, you should say this to them: ‘This too, good sirs, has been declared undeclared by the Blessed One: “The Tathāgata neither exists nor does not exist after death. This alone is true; other views are worthless.”’\n\n\"Now, Cunda, it is possible that other sectarians and wanderers might say this: ‘Why, indeed, good sir, has this not been declared by the ascetic Gotama?’ Cunda, when other sectarians and wanderers speak thus, you should say this to them: ‘This, good sirs, is not connected with the goal, not connected with the Dhamma, not the beginning of the holy life, does not lead to revulsion, to dispassion, to cessation, to tranquility, to direct knowledge, to enlightenment, to Nibbana; therefore, it has not been declared by the Blessed One.’\"",
      "sinhala": "චුන්ද, අන්‍ය තීර්ථක පරිව්‍රාජකයෝ මෙසේ කියන්නාහු නම්, ‘ඇවැත්නි, මරණින් මතු තථාගතයන් වහන්සේ වෙත් ද? මෙයම සත්‍යය, අන්‍යයෝ මුසාවාදීහු’ යැයි යම් තැනෙක් ඇද්ද, එය (සිදුවිය හැකි) කරුණකි. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිව්‍රාජකයන්ට මෙසේ කිව යුතුයි: ‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් ‘මරණින් මතු තථාගතයන් වහන්සේ වෙති, මෙයම සත්‍යය, අන්‍යයෝ මුසාවාදීහු’ යනු අව්‍යාකෘත කරන ලදී.’\n\nචුන්ද, අන්‍ය තීර්ථක පරිව්‍රාජකයෝ මෙසේ කියන්නාහු නම්, ‘ඇවැත්නි, මරණින් මතු තථාගතයන් වහන්සේ නොවෙත් ද? මෙයම සත්‍යය, අන්‍යයෝ මුසාවාදීහු’ යැයි යම් තැනෙක් ඇද්ද, එය (සිදුවිය හැකි) කරුණකි. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිව්‍රාජකයන්ට මෙසේ කිව යුතුයි: ‘ඇවැත්නි, ‘මරණින් මතු තථාගතයන් වහන්සේ නොවෙති, මෙයම සත්‍යය, අන්‍යයෝ මුසාවාදීහු’ යනු භාග්‍යවතුන් වහන්සේ විසින් අව්‍යාකෘත කරන ලදී.’\n\nචුන්ද, අන්‍ය තීර්ථක පරිව්‍රාජකයෝ මෙසේ කියන්නාහු නම්, ‘ඇවැත්නි, මරණින් මතු තථාගතයන් වහන්සේ වෙත් ද නොවෙත් ද? මෙයම සත්‍යය, අන්‍යයෝ මුසාවාදීහු’ යැයි යම් තැනෙක් ඇද්ද, එය (සිදුවිය හැකි) කරුණකි. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිව්‍රාජකයන්ට මෙසේ කිව යුතුයි: ‘ඇවැත්නි, ‘මරණින් මතු තථාගතයන් වහන්සේ වෙත් ද නොවෙත් ද, මෙයම සත්‍යය, අන්‍යයෝ මුසාවාදීහු’ යනු භාග්‍යවතුන් වහන්සේ විසින් අව්‍යාකෘත කරන ලදී.’\n\nචුන්ද, අන්‍ය තීර්ථක පරිව්‍රාජකයෝ මෙසේ කියන්නාහු නම්, ‘ඇවැත්නි, මරණින් මතු තථාගතයන් වහන්සේ නොවෙත් ද නොවන්නාහු ද? මෙයම සත්‍යය, අන්‍යයෝ මුසාවාදීහු’ යැයි යම් තැනෙක් ඇද්ද, එය (සිදුවිය හැකි) කරුණකි. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිව්‍රාජකයන්ට මෙසේ කිව යුතුයි: ‘ඇවැත්නි, ‘මරණින් මතු තථාගතයන් වහන්සේ නොවෙත් ද නොවන්නාහු ද, මෙයම සත්‍යය, අන්‍යයෝ මුසාවාදීහු’ යනු භාග්‍යවතුන් වහන්සේ විසින් අව්‍යාකෘත කරන ලදී.’\n\nචුන්ද, අන්‍ය තීර්ථක පරිව්‍රාජකයෝ මෙසේ කියන්නාහු නම්, ‘ඇවැත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ මෙය අව්‍යාකෘත කළේ මන්ද?’ යැයි යම් තැනෙක් ඇද්ද, එය (සිදුවිය හැකි) කරුණකි. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිව්‍රාජකයන්ට මෙසේ කිව යුතුයි: ‘ඇවැත්නි, මෙය අර්ථ සහිත නොවේ. ධර්මයට හිත නොවේ. ආදි බ්‍රහ්මචරියාවට හිත නොවේ. කලකිරීම පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, උපශමය පිණිස, අභිඥාව පිණිස, සම්බෝධිය පිණිස, නිර්වාණය පිණිස හේතු නොවෙයි. එහෙයින් භාග්‍යවතුන් වහන්සේ එය අව්‍යාකෘත කළහ.’",
      "paliTitle": "Abyākataṭṭhānaṃ",
      "englishTitle": "Indeterminate Matters",
      "sinhalaTitle": "අබ්‍යාකත ස්ථානය"
    },
    {
      "number": 190,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kiṃ panāvuso, samaṇena gotamena byākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘idaṃ dukkhanti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhasamudayoti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhanirodhoti kho, āvuso, bhagavatā byākataṃ, ayaṃ dukkhanirodhagāminī paṭipadāti kho, āvuso, bhagavatā byākata’nti. ‘‘Ṭhānaṃ kho panetaṃ, cunda, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘kasmā panetaṃ, āvuso, samaṇena gotamena byākata’nti? Evaṃvādino, cunda, aññatitthiyā paribbājakā evamassu vacanīyā – ‘etañhi, āvuso, atthasaṃhitaṃ, etaṃ dhammasaṃhitaṃ, etaṃ ādibrahmacariyakaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati. Tasmā taṃ bhagavatā byākata’nti. ",
      "english": "\"Now, Cunda, it is possible that wanderers of other sects might speak thus: 'What, indeed, has the ascetic Gotama declared?' Cunda, when wanderers of other sects speak thus, they should be told: 'The Blessed One has declared this is suffering, friends; the Blessed One has declared this is the origin of suffering, friends; the Blessed One has declared this is the cessation of suffering, friends; the Blessed One has declared this is the path leading to the cessation of suffering, friends.'\n\n\"Now, Cunda, it is possible that wanderers of other sects might speak thus: 'But why, friends, has the ascetic Gotama declared this?' Cunda, when wanderers of other sects speak thus, they should be told: 'Because this, friends, is connected with the goal, is connected with the Dhamma, is the beginning of the holy life, and leads solely to disenchantment, to dispassion, to cessation, to peace, to direct knowledge, to enlightenment, to Nibbana. Therefore, it was declared by the Blessed One.'\"",
      "sinhala": "‘‘චුන්ද, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ කියන්නට ඉඩ තිබේ. ‘පින්වත්නි, ශ්‍රමණ ගෞතමයන් විසින් ව්‍යක්ත කරන ලද්දේ කුමක්දැ’යි විමසිය හැකිය. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ කිව යුතුය. ‘පින්වත්නි, භාග්‍යවතුන් වහන්සේ විසින් මෙය දුක යැයි ව්‍යක්ත කරන ලදී. පින්වත්නි, මෙය දුක්ඛ සමුදය යැයි භාග්‍යවතුන් වහන්සේ විසින් ව්‍යක්ත කරන ලදී. පින්වත්නි, මෙය දුක්ඛ නිරෝධය යැයි භාග්‍යවතුන් වහන්සේ විසින් ව්‍යක්ත කරන ලදී. පින්වත්නි, මෙය දුක්ඛ නිරෝධයට පමුණුවන මාර්ගය යැයි භාග්‍යවතුන් වහන්සේ විසින් ව්‍යක්ත කරන ලදී.’\n\nචුන්ද, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ කියන්නට ඉඩ තිබේ. ‘පින්වත්නි, ශ්‍රමණ ගෞතමයන් විසින් මෙය කුමක් නිසා ව්‍යක්ත කරන ලද්දේදැ’යි විමසිය හැකිය. චුන්ද, මෙසේ කියන අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ කිව යුතුය. ‘පින්වත්නි, මෙය අර්ථයෙන් යුක්තය, මෙය ධර්මයෙන් යුක්තය, මෙය ආදි බ්‍රහ්මචරියාවකි, ඒකාන්තයෙන් කලකිරීම පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, උපසමය පිණිස, අභිඥාව පිණිස, සම්බෝධිය පිණිස, නිර්වාණය පිණිස පවතී. එම නිසා එය භාග්‍යවතුන් වහන්සේ විසින් ව්‍යක්ත කරන ලදී.’",
      "paliTitle": "Byākataṭṭhānaṃ",
      "englishTitle": "The Declared Topics",
      "sinhalaTitle": "ව්‍යාකරණ ස්ථානය"
    },
    {
      "number": 191,
      "pali": "‘‘Yepi te, cunda, pubbantasahagatā diṭṭhinissayā, tepi vo mayā byākatā, yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā [tattha (syā. ka.)] byākarissāmi? Yepi te, cunda, aparantasahagatā diṭṭhinissayā, tepi vo mayā byākatā, yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmi? Katame ca te, cunda, pubbantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā. (Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmi) [(yathā ca te na byākātabbā) sabbattha]? Santi kho, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘sassato attā ca loko ca, idameva saccaṃ moghamañña’nti. Santi pana, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘asassato attā ca loko ca…pe… sassato ca asassato ca attā ca loko ca… neva sassato nāsassato attā ca loko ca… sayaṃkato attā ca loko ca… paraṃkato attā ca loko ca… sayaṃkato ca paraṃkato ca attā ca loko ca… asayaṃkāro aparaṃkāro adhiccasamuppanno attā ca loko ca, idameva saccaṃ moghamañña’nti. Sassataṃ sukhadukkhaṃ… asassataṃ sukhadukkhaṃ… sassatañca asassatañca sukhadukkhaṃ… nevasassataṃ nāsassataṃ sukhadukkhaṃ… sayaṃkataṃ sukhadukkhaṃ… paraṃkataṃ sukhadukkhaṃ… sayaṃkatañca paraṃkatañca sukhadukkhaṃ… asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ, idameva saccaṃ moghamañña’nti.",
      "english": "\"And those, Cunda, viewpoints based on association with the past that I have explained to you, I have explained as they should be explained. And as they should not be explained, why should I explain them to you in that way? And those, Cunda, viewpoints based on association with the future that I have explained to you, I have explained as they should be explained. And as they should not be explained, why should I explain them to you in that way? And what are those, Cunda, viewpoints based on association with the past that I have explained to you, as they should be explained? (And as they should not be explained, why should I explain them to you in that way?) There are, Cunda, some ascetics and brahmins who are speakers thus, of such a view: ‘The self and the world are eternal; this alone is true, all else is vain.’ But there are, Cunda, some ascetics and brahmins who are speakers thus, of such a view: ‘The self and the world are not eternal… the self and the world are both eternal and not eternal… the self and the world are neither eternal nor not eternal… the self and the world are self-made… the self and the world are made by another… the self and the world are both self-made and made by another… the self and the world are neither self-made nor made by another, arising by chance; this alone is true, all else is vain.’ Happiness and suffering are eternal… happiness and suffering are not eternal… happiness and suffering are both eternal and not eternal… happiness and suffering are neither eternal nor not eternal… happiness and suffering are self-made… happiness and suffering are made by another… happiness and suffering are both self-made and made by another… happiness and suffering are neither self-made nor made by another, arising by chance; this alone is true, all else is vain.\"",
      "sinhala": "චුන්ද, යම් ඒ පූර්වාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයෝ වෙත් ද, ඒ දේවල් මා විසින් ඔබට දේශනා කරන ලදී, යම්සේ ඒවා දේශනා කළ යුතු ද එලෙසමය. යම්සේ ඒවා දේශනා නොකළ යුතු ද, මම ඒවා ඔබට ඒ අයුරින් දේශනා කරන්නේ කුමට ද? චුන්ද, යම් ඒ අපරාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයෝ වෙත් ද, ඒ දේවල් මා විසින් ඔබට දේශනා කරන ලදී, යම්සේ ඒවා දේශනා කළ යුතු ද එලෙසමය. යම්සේ ඒවා දේශනා නොකළ යුතු ද, මම ඒවා ඔබට ඒ අයුරින් දේශනා කරන්නේ කුමට ද? චුන්ද, යම් ඒ පූර්වාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයෝ වෙත් ද, යම් ඒවා මා විසින් ඔබට දේශනා කරන ලද ද, යම්සේ ඒවා දේශනා කළ යුතු ද, (යම්සේ ඒවා දේශනා නොකළ යුතු ද, මම ඒවා ඔබට ඒ අයුරින් දේශනා කරන්නේ කුමට ද?) චුන්ද, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ ‘ආත්මයත් ලෝකයත් සදාකාලිකය, මෙයම සත්‍යය, අන්‍ය වූයේ හිස් ය’ යැයි මෙසේ කියන්නෝ ද, මෙසේ දෘෂ්ටි ඇත්තෝ ද වෙති. චුන්ද, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ ‘ආත්මයත් ලෝකයත් සදාකාලික නොවේ…(පෙ)… ආත්මයත් ලෝකයත් සදාකාලික ද වේ, සදාකාලික නොවූ ද වේ… ආත්මයත් ලෝකයත් සදාකාලික ද නොවේ, සදාකාලික නොවූයේ ද නොවේ… ආත්මයත් ලෝකයත් තමා විසින් ම කරන ලද්දේ වේ… ආත්මයත් ලෝකයත් අනුන් විසින් කරන ලද්දේ වේ… ආත්මයත් ලෝකයත් තමා විසින් ද අනුන් විසින් ද කරන ලද්දේ වේ… ආත්මයත් ලෝකයත් තමා විසින් නොකරන ලද්දේ ද අනුන් විසින් නොකරන ලද්දේ ද අහේතුකව හටගත්තේද වේ, මෙයම සත්‍යය, අන්‍ය වූයේ හිස් ය’ යැයි මෙසේ කියන්නෝ ද, මෙසේ දෘෂ්ටි ඇත්තෝ ද වෙති. සැප දුක් සදාකාලික ය… සැප දුක් සදාකාලික නොවේ… සැප දුක් සදාකාලික ද වේ, සදාකාලික නොවූ ද වේ… සැප දුක් සදාකාලික ද නොවේ, සදාකාලික නොවූයේ ද නොවේ… සැප දුක් තමා විසින් ම කරන ලද්දේ වේ… සැප දුක් අනුන් විසින් කරන ලද්දේ වේ… සැප දුක් තමා විසින් ද අනුන් විසින් ද කරන ලද්දේ වේ… සැප දුක් තමා විසින් නොකරන ලද්දේ ද අනුන් විසින් නොකරන ලද්දේ ද අහේතුකව හටගත්තේද වේ, මෙයම සත්‍යය, අන්‍ය වූයේ හිස් ය.",
      "paliTitle": "Pubbantasahagatadiṭṭhinissayā",
      "englishTitle": "Bases for past-connected views",
      "sinhalaTitle": "පූර‍්වන්‍ත සහගත දෘෂ‍්ට‍ි නිස‍්සය"
    },
    {
      "number": 192,
      "pali": "‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘sassato attā ca loko ca, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘sassato attā ca loko cā’’ti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti.",
      "english": "\"Now, Cunda, those ascetics and brahmins who are proponents of such views, holding such doctrines – 'The self and the world are eternal; this alone is true, all else is vain' – I approach them and say this: 'Is there, friend, such a thing that is said – \"The self and the world are eternal\"?' And that which they say, 'This alone is true, all else is vain,' that I do not approve of in them. Why is that? Because here, Cunda, there are some beings with differing perceptions. Even with this designation, Cunda, I do not regard myself as equal, much less superior. But rather, I am superior in that which is the surpassing designation.\"",
      "sinhala": "‘‘චුන්ද, යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ‘ආත්මයත් ලෝකයත් සදාකාලිකය, මෙයම සත්‍යය, අන්‍ය වූ දේ හිස්ය’ යයි මෙසේ කියන්නෝ, මෙසේ දෘෂ්ටි ඇත්තෝ වෙත් ද, මම ඔවුන් වෙත එළඹ මෙසේ කියමි: ‘ඇවැත්නි, ආත්මයත් ලෝකයත් සදාකාලිකය’ යයි මෙසේ කියනු ලබන යමක් ඇත් ද? යම් දෙයක් ඔවුන් මෙසේ කීව ද, ‘මෙයම සත්‍යය, අන්‍ය වූ දේ හිස්ය’ යයි, එය මම ඔවුන්ට අනුමත නොකරමි. එය කවර හෙයින් ද? චුන්ද, මෙහි අන්‍ය ආකාර සංඥා ඇති සත්ත්වයෝ ද ඇත. චුන්ද, මේ ප්‍රඥප්තියෙන් ද මම තමා හා සමාන යයිවත් නොසලකමි, ඊට වඩා කොයින් ද? එහෙත් මම එහි අධිප්‍රඥාව යම් ඒ දෙයක් වේ නම් එයට වඩා වෙමි.",
      "paliTitle": ""
    },
    {
      "number": 193,
      "pali": "‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘asassato attā ca loko ca… pe… sassato ca asassato ca attā ca loko ca… nevasassato nāsassato attā ca loko ca… sayaṃkato attā ca loko ca… paraṃkato attā ca loko ca… sayaṃkato ca paraṃkato ca attā ca loko ca… asayaṃkāro aparaṃkāro adhiccasamuppanno attā ca loko ca… sassataṃ sukhadukkhaṃ… asassataṃ sukhadukkhaṃ… sassatañca asassatañca sukhadukkhaṃ… nevasassataṃ nāsassataṃ sukhadukkhaṃ… sayaṃkataṃ sukhadukkhaṃ… paraṃkataṃ sukhadukkhaṃ… sayaṃkatañca paraṃkatañca sukhadukkhaṃ… asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkhaṃ, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘asayaṃkāraṃ aparaṃkāraṃ adhiccasamuppannaṃ sukhadukkha’’’nti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti. Ime kho te, cunda, pubbantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmīti [byākarissāmīti (sī. ka.)]? ",
      "english": "\"Here, Cunda, those ascetics and brahmins who are of such a view and hold such opinions – 'The self and the world are eternal… The self and the world are both eternal and not eternal… The self and the world are neither eternal nor not eternal… The self and the world are self-made… The self and the world are made by another… The self and the world are both self-made and made by another… The self and the world are uncaused and unmade, arisen by chance… Happiness and suffering are eternal… Happiness and suffering are not eternal… Happiness and suffering are both eternal and not eternal… Happiness and suffering are neither eternal nor not eternal… Happiness and suffering are self-made… Happiness and suffering are made by another… Happiness and suffering are both self-made and made by another… Happiness and suffering are uncaused and unmade, arisen by chance, this alone is true, other views are worthless.' When I approach them, I say thus: 'Is there really something that is said to be \"Happiness and suffering are uncaused and unmade, arisen by chance?\"' But I do not approve of their saying, 'This alone is true, other views are worthless.' Why is that? Because, Cunda, there are beings here who have different perceptions. And Cunda, with this designation, I do not regard myself as the same, let alone greater. But indeed, I am greater in that, namely, higher wisdom. These, Cunda, are those foundations of views associated with the beginning, which have been explained by me as they should be explained. And since they should not be explained in a certain way, why would I explain them to you in that way?\"",
      "sinhala": "‘‘චුන්ද, යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ‘ආත්මයත් ලෝකයත් ශාස්වතය’ යන ආදී වශයෙන් හෝ ‘ආත්මයත් ලෝකයත් අශාස්වතය’ යන ආදී වශයෙන් හෝ ‘ආත්මයත් ලෝකයත් ශාස්වත ද අශාස්වත ද වේ’ යන ආදී වශයෙන් හෝ ‘ආත්මයත් ලෝකයත් ශාස්වත ද නොව අශාස්වත ද නොව වේ’ යන ආදී වශයෙන් හෝ ‘ආත්මයත් ලෝකයත් තමා විසින් ම කරණ ලද්දේ ය’ යන ආදී වශයෙන් හෝ ‘ආත්මයත් ලෝකයත් අනුන් විසින් කරණ ලද්දේ ය’ යන ආදී වශයෙන් හෝ ‘ආත්මයත් ලෝකයත් තමා විසින් ද අනුන් විසින් ද කරණ ලද්දේ ය’ යන ආදී වශයෙන් හෝ ‘ආත්මයත් ලෝකයත් තමා විසින් නො කරණ ලද්දේ ද අනුන් විසින් නො කරණ ලද්දේ ද අහේතුක ව හටගත්තාහු ද වේ’ යන ආදී වශයෙන් හෝ ‘සැප දුක් ශාස්වත ය’ යන ආදී වශයෙන් හෝ ‘සැප දුක් අශාස්වත ය’ යන ආදී වශයෙන් හෝ ‘සැප දුක් ශාස්වත ද අශාස්වත ද වේ’ යන ආදී වශයෙන් හෝ ‘සැප දුක් ශාස්වත ද නොව අශාස්වත ද නොව වේ’ යන ආදී වශයෙන් හෝ ‘සැප දුක් තමා විසින් ම කරණ ලද්දේ ය’ යන ආදී වශයෙන් හෝ ‘සැප දුක් අනුන් විසින් කරණ ලද්දේ ය’ යන ආදී වශයෙන් හෝ ‘සැප දුක් තමා විසින් ද අනුන් විසින් ද කරණ ලද්දේ ය’ යන ආදී වශයෙන් හෝ ‘සැප දුක් තමා විසින් නො කරණ ලද්දේ ද අනුන් විසින් නො කරණ ලද්දේ ද අහේතුක ව හටගත්තාහු ද වේ, මෙය ම සත්‍යය, අන්‍ය වූයේ හිස් ය’ යනුවෙන් වාද ඇත්තාහු ද දෘෂ්ටි ඇත්තාහු ද වෙත් නම්, මම ඔවුන් වෙත එළඹ ‘ඇවැත්නි, ‘සැප දුක් තමා විසින් නො කරණ ලද්දේ ද අනුන් විසින් නො කරණ ලද්දේ ද අහේතුක ව හටගත්තාහු ද වේ’ ය යි මෙ වැනි කථාවක් ඇත්තාහු ද?’ යි මෙසේ කියමි. යම් ඒ ඔවුන් විසින් ‘මෙය ම සත්‍යය, අන්‍ය වූයේ හිස් ය’ යි කියන ලද්දේ ද, එය මම ඔවුන්ට අනුමත නො කරමි. එය කවර හෙයින් ද? චුන්ද, මෙහි අන්‍ය ආකාර සඤ්ඤා ඇත්තා වූ ද සත්ත්වයෝ ඇත. චුන්ද, මම මේ ප්‍රඥප්තියෙන් ද තමන් හා සමානව සලකන්නේ වත් නැත, අධික ව සලකන්නේ කෙසේ ද? එහෙත් චුන්ද, මම එහි අධික වන්නෙමි. එනම්, අධිප්‍රඥප්තිය යි. චුන්ද, යම් ඒ පූර්වාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයෝ වෙත් ද, ඒ තොපට මා විසින් ප්‍රකාශ කරන ලද්දාහු ය. ඒවා යම් පරිදි ප්‍රකාශ කළ යුතු ද (ඒ පරිදි ප්‍රකාශ කරන ලද්දාහු ය). යම් පරිදි ඒවා ප්‍රකාශ නො කළ යුතු ද, මම තොපට ඒවා එසේ ප්‍රකාශ කරන්නේ කිම?",
      "paliTitle": ""
    },
    {
      "number": 194,
      "pali": "‘‘Katame ca te, cunda, aparantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā. (Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmī) [( ) etthantare pāṭho sabbatthapi paripuṇṇo dissati]? Santi, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘rūpī attā hoti arogo paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Santi pana, cunda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘arūpī attā hoti…pe… rūpī ca arūpī ca attā hoti… nevarūpī nārūpī attā hoti… saññī attā hoti… asaññī attā hoti… nevasaññīnāsaññī attā hoti… attā ucchijjati vinassati na hoti paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘rūpī attā hoti arogo paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘rūpī attā hoti arogo paraṃ maraṇā’’’ti? Yañca kho te evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti.",
      "english": "\"And what, Cunda, are those adherence to views connected with the extreme future that have been explained by me, as they should be explained? (And why shouldn't they be explained; why should I explain them that way?) There are, Cunda, some ascetics and brahmins who are proponents of such views, holding this opinion: ‘The self is material, healthy after death; this alone is true, other views are false.’ But there are, Cunda, some ascetics and brahmins who are proponents of such views, holding this opinion: ‘The self is immaterial… the self is both material and immaterial… the self is neither material nor immaterial… the self is percipient… the self is non-percipient… the self is neither percipient nor non-percipient… the self is annihilated, destroyed, and does not exist after death; this alone is true, other views are false.’ Now, Cunda, to those ascetics and brahmins who are proponents of such views, holding this opinion: ‘The self is material, healthy after death; this alone is true, other views are false,’ I approach and say this: ‘Is there such a thing, friends, as is said: “The self is material, healthy after death”?’ And whatever they say, that ‘this alone is true, other views are false,’ that I do not approve of. Why is that? Because, Cunda, there are some beings here who have a different perception. Even with this designation, Cunda, I do not see myself as equal to them, how much more superior? Rather, I am superior in that which is a higher designation.\"",
      "sinhala": "‘‘චුන්ද, මා විසින් ඔබට දේශනා කරන ලද, දේශනා කළ යුතු පරිදි වූ අවරන්තසහගත දෘෂ්ටි නිඃශ්‍රයෝ කවරේ ද? (යම් පරිදි ඒවා දේශනා නොකළ යුතු ද, මම ඔබට ඒවා එසේ දේශනා කරන්නේ කෙසේ ද?) චුන්ද, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ මෙසේ කියන්නෝ ද, මෙබඳු දැක්ම ඇත්තෝ ද වෙති. එනම්, ‘රූප ඇත්තා වූ ආත්මය මරණින් මතු නිරෝගී ව පවතී. මෙයම සත්‍යය, අන්‍ය වූ මතයෝ හිස් වෙති’ කියා ය. චුන්ද, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ මෙසේ කියන්නෝ ද, මෙබඳු දැක්ම ඇත්තෝ ද වෙති. එනම්, ‘අරූපී ආත්මය (මරණින් මතු නිරෝගී ව පවතී) … රූපී ද අරූපී ද ආත්මය (මරණින් මතු නිරෝගී ව පවතී) … රූපී ද නොවූ අරූපී ද නොවූ ආත්මය (මරණින් මතු නිරෝගී ව පවතී) … සංඥා ඇත්තා වූ ආත්මය (මරණින් මතු නිරෝගී ව පවතී) … අසංඥා ඇත්තා වූ ආත්මය (මරණින් මතු නිරෝගී ව පවතී) … සංඥා ඇත්තා ද නොවූ, සංඥා නැත්තා ද නොවූ ආත්මය (මරණින් මතු නිරෝගී ව පවතී) … ආත්මය මරණින් මතු සිඳී විනාශ වී නැති වන්නේ ය. මෙයම සත්‍යය, අන්‍ය වූ මතයෝ හිස් වෙති’ කියා ය. චුන්ද, එහිලා යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ‘රූපී ආත්මය මරණින් මතු නිරෝගී ව පවතී. මෙයම සත්‍යය, අන්‍ය වූ මතයෝ හිස් වෙති’ යි මෙසේ කියන්නෝ ද, මෙබඳු දැක්ම ඇත්තෝ ද වෙත් නම්, මම ඔවුන් වෙත එළඹ මෙසේ කියමි. ‘ඇවැත්නි, රූපී ආත්මය මරණින් මතු නිරෝගී ව පවතී යයි කියනු ලැබේ ද?’ යි විචාළෙමි. යම් ඒ ඔවුන් විසින් ‘මෙයම සත්‍යය, අන්‍ය වූ මතයෝ හිස් වෙති’ යි කියන ලද්දේ ද, එය මම ඔවුන්ට අනුමත නොකරමි. එය කුමක් හේතු කොටගෙන ද? චුන්ද, මෙහි අන්‍ය ආකාර සංඥා ඇති සත්වයෝ ද ඇත. චුන්ද, මම මේ ප්‍ර‍ඥප්තියෙන් තමා හා සමානවූවක් වත් නොසලකමි. ඊට වඩා වැඩි යමක් කෙසේ සලකම් ද? එහෙත් මම එහිලා ම විශේෂ වූ ප්‍ර‍ඥප්තියක් වශයෙන් සලකමි.",
      "paliTitle": "Aparantasahagatadiṭṭhinissayā",
      "englishTitle": "Bases of Future-Related Views",
      "sinhalaTitle": "අපරන්ත සහගත දෘශ‍්ටි නිස්සයෝ"
    },
    {
      "number": 195,
      "pali": "‘‘Tatra, cunda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘arūpī attā hoti…pe… rūpī ca arūpī ca attā hoti… nevarūpīnārūpī attā hoti… saññī attā hoti… asaññī attā hoti… nevasaññīnāsaññī attā hoti… attā ucchijjati vinassati na hoti paraṃ maraṇā, idameva saccaṃ moghamañña’nti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘atthi nu kho idaṃ, āvuso, vuccati – ‘‘attā ucchijjati vinassati na hoti paraṃ maraṇā’’’ti? Yañca kho te, cunda, evamāhaṃsu – ‘idameva saccaṃ moghamañña’nti. Taṃ tesaṃ nānujānāmi. Taṃ kissa hetu? Aññathāsaññinopi hettha, cunda, santeke sattā. Imāyapi kho ahaṃ, cunda, paññattiyā neva attanā samasamaṃ samanupassāmi, kuto bhiyyo. Atha kho ahameva tattha bhiyyo yadidaṃ adhipaññatti. Ime kho te, cunda, aparantasahagatā diṭṭhinissayā, ye vo mayā byākatā, yathā te byākātabbā. Yathā ca te na byākātabbā, kiṃ vo ahaṃ te tathā byākarissāmīti [byākarissāmīti (sī. ka.)]?",
      "english": "\"There, Cunda, those ascetics and brahmins who are proponents of such views, holding such opinions—'The self is formless... the self is both with form and formless... the self is neither with form nor formless... the self is percipient... the self is non-percipient... the self is neither percipient nor non-percipient... the self is annihilated, perishes, and does not exist after death; this alone is true, other views are vain.'—I approach them and say thus: 'Is there indeed this, friends, that is said—\"The self is annihilated, perishes, and does not exist after death\"?' And whatever they, Cunda, said thus—'This alone is true, other views are vain'—that I do not approve of. Why is that? For there are, Cunda, some beings here who are otherwise percipient. Even through this designation, Cunda, I do not regard myself as equal to them, how much more so superior. But indeed, I am superior to them in that which is the surpassing designation. These, Cunda, are those views adhering to the extreme end, which have been explained by me to you, as they should be explained. And since they should not be explained in that way, why should I explain them to you in that way?\"",
      "sinhala": "‘‘චුන්ද, යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ අරූපී ආත්මය ඇත... යනාදී වශයෙන්... රූපී ද අරූපී ද ආත්මය ඇත... නො රූපී නො අරූපී ආත්මය ඇත... සංඥා ඇත ආත්මය ඇත... සංඥා නැති ආත්මය ඇත... නො සංඥා ඇති නො සංඥා නැති ආත්මය ඇත... ආත්මය මරණින් මතු නැතිව විනාශව යයි, මෙයම සත්‍යය අන්‍ය වූයේ හිස් ය’යි මෙසේ කියන්නෝ මෙසේ දෘෂ්ටි ඇත්තෝ වෙත් ද, මම ඔවුන් වෙත එළඹ මෙසේ කියමි: ‘ඇවැත්නි, ආත්මය මරණින් මතු නැතිව විනාශව යයි’ යයි යමක් කියනු ඇත් ද, එය ඇත් ද?’ යනුයි. චුන්ද, යම් ඒ ඔවුන් ‘මෙයම සත්‍යය, අන්‍ය වූයේ හිස් ය’යි මෙසේ කියත් ද, එය මම ඔවුන්ට අනුමත නොකරමි. එය කිනම් හේතු නිසා ද? චුන්ද, මෙහි අන්‍ය ආකාර සංඥා ඇත්තාහු ද ඇතැම් සත්වයෝ වෙති. චුන්ද, මේ ප්‍රඥප්තියෙන් ද මම ආත්ම වශයෙන් සමාන වශයෙන් වත් නො දක්මි, ඊට වඩා කෙසේ ද? එහෙත් මම එහි අධිප්‍රඥප්තිය යම් ඒ ද එය මම දකිමි. චුන්ද, මේ යම් ඒ අපරාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයෝ වෙත් ද, ඒවා තොපට ම විසින් ව්‍යාඛ්‍යාත කළ යුතු පරිදි ව්‍යාඛ්‍යාත කරන ලදහ. තව ද ඒවා ව්‍යාඛ්‍යාත නො කළ යුතු පරිදි, මම තොපට ඒවා කෙසේ ව්‍යාඛ්‍යාත කරන්නෙම් ද?’’",
      "paliTitle": ""
    },
    {
      "number": 196,
      "pali": "‘‘Imesañca, cunda, pubbantasahagatānaṃ diṭṭhinissayānaṃ imesañca aparantasahagatānaṃ diṭṭhinissayānaṃ pahānāya samatikkamāya evaṃ mayā cattāro satipaṭṭhānā desitā paññattā. Katame cattāro? Idha, cunda, bhikkhu kāye kāyānupassī viharati ātāpī sampajāno satimā vineyya loke abhijjhādomanassaṃ. Vedanāsu vedanānupassī…pe… citte cittānupassī… dhammesu dhammānupassī viharati ātāpī sampajāno satimā, vineyya loke abhijjhādomanassaṃ. Imesañca cunda, pubbantasahagatānaṃ diṭṭhinissayānaṃ imesañca aparantasahagatānaṃ diṭṭhinissayānaṃ pahānāya samatikkamāya. Evaṃ mayā ime cattāro satipaṭṭhānā desitā paññattā’’ti.",
      "english": "\"And, Cunda, for the abandonment and overcoming of these viewpoints based on past existences and these viewpoints based on future existences, these four foundations of mindfulness have been taught and established by me. Which four? Here, Cunda, a bhikkhu dwells contemplating the body in the body, ardent, fully aware, mindful, having removed covetousness and displeasure in the world. He dwells contemplating feelings in feelings... He dwells contemplating mind in mind... He dwells contemplating phenomena in phenomena, ardent, fully aware, mindful, having removed covetousness and displeasure in the world. And, Cunda, for the abandonment and overcoming of these viewpoints based on past existences and these viewpoints based on future existences, these four foundations of mindfulness have been taught and established by me.\"",
      "sinhala": "‘‘චුන්ද, මේ පූර්වාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයන්ගේත්, මේ අපරාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයන්ගේත් ප්‍රහාණය පිණිස, සමතික්‍රමණය පිණිස මා විසින් සතර සතිපට්‌ඨානයෝ දේශනා කරන ලදහ, පණවන ලදහ. කවර සතර ද යත්: චුන්ද, මෙහි භික්ෂු කායෙහි කායානුපස්සීව, කෙලෙස් තවන වීර්ය ඇතිව, මනා නුවණ ඇතිව, සිහි ඇතිව, ලෝකයෙහි අභිධ්‍යා දෝමනස්සයන් දුරු කොට වාසය කරයි. වේදනාවන්හි වේදනානුපස්සීව... සිතෙහි චිත්තානුපස්සීව... ධර්මයන්හි ධම්මානුපස්සීව, කෙලෙස් තවන වීර්ය ඇතිව, මනා නුවණ ඇතිව, සිහි ඇතිව, ලෝකයෙහි අභිධ්‍යා දෝමනස්සයන් දුරු කොට වාසය කරයි. චුන්ද, මේ පූර්වාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයන්ගේත්, මේ අපරාන්ත සහගත දෘෂ්ටි නිඃශ්‍රයයන්ගේත් ප්‍රහාණය පිණිස, සමතික්‍රමණය පිණිස, මා විසින් මේ සතර සතිපට්‌ඨානයෝ දේශනා කරන ලදහ, පණවන ලදහ’’යි.",
      "paliTitle": ""
    },
    {
      "number": 197,
      "pali": "Tena kho pana samayena āyasmā upavāṇo bhagavato piṭṭhito ṭhito hoti bhagavantaṃ bījayamāno. Atha kho āyasmā upavāṇo bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante! Pāsādiko vatāyaṃ, bhante, dhammapariyāyo; supāsādiko vatāyaṃ bhante, dhammapariyāyo, ko nāmāyaṃ bhante dhammapariyāyo’’ti? ‘‘Tasmātiha tvaṃ, upavāṇa, imaṃ dhammapariyāyaṃ ‘pāsādiko’ tveva naṃ dhārehī’’ti. Idamavoca bhagavā. Attamano āyasmā upavāṇo bhagavato bhāsitaṃ abhinandīti. ",
      "english": "Now at that time the venerable Upavāṇa was standing behind the Blessed One, fanning him. Then the venerable Upavāṇa said this to the Blessed One: \"It is wonderful, venerable sir, it is amazing, venerable sir! Indeed, this exposition of the Dhamma is inspiring confidence; indeed, this exposition of the Dhamma is very inspiring confidence. What is the name of this exposition of the Dhamma, venerable sir?\" \"Therefore, Upavāṇa, you should remember this exposition of the Dhamma as ‘Inspiring Confidence.’\" This is what the Blessed One said. The venerable Upavāṇa, pleased, rejoiced in the Blessed One's words.",
      "sinhala": "එකල්හි ආයුෂ්මත් උපවාණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පවන් සලමින් උන්වහන්සේගේ පිටුපසින් සිටියහ. ඉක්බිති ආයුෂ්මත් උපවාණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය සැල කළහ: “ස්වාමීනි, මෙය පුදුම සහගතය, ස්වාමීනි, මෙය අද්භූතය! ස්වාමීනි, මේ ධර්ම පර්යාය ඉතා ප්‍රසාදජනකය; ස්වාමීනි, මේ ධර්ම පර්යාය මැනවින් ප්‍රසාදජනකය, ස්වාමීනි, මේ ධර්ම පර්යාය කුමන නමකින් හැඳින්වේද?” “එහෙයින්, උපවාණයෙනි, ඔබ මේ ධර්ම පර්යාය ‘ප්‍රසාදජනක’ යන නමින්ම දරව.” භාග්‍යවතුන් වහන්සේ මෙය වදාළහ. සතුටු සිත් ඇති ආයුෂ්මත් උපවාණ තෙරණුවෝ භාග්‍යවතුන් වහන්සේගේ දේශනාව අනුමෝදන් වූහ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Pāsādikasuttaṃ niṭṭhitaṃ chaṭṭhaṃ.",
    "english": "The Sixth Pāsādika Sutta",
    "sinhala": "හයවන පාසාදික සූත්‍රය නිමයි."
  }
}