{
  "id": "dn8",
  "title": {
    "pali": "Siṅgālasuttaṃ",
    "english": "The Discourse to Siṅgāla",
    "sinhala": "සිඟාලෝවාද සූත්‍රය"
  },
  "sections": [
    {
      "number": 242,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena siṅgālako [sigālako (sī.)] gahapatiputto kālasseva uṭṭhāya rājagahā nikkhamitvā allavattho allakeso pañjaliko puthudisā [puthuddisā (sī. syā. pī.)] namassati – puratthimaṃ disaṃ dakkhiṇaṃ disaṃ pacchimaṃ disaṃ uttaraṃ disaṃ heṭṭhimaṃ disaṃ uparimaṃ disaṃ.",
      "english": "Thus have I heard: At one time the Blessed One was living in Rajagaha, in the Bamboo Grove, the Squirrels' Sanctuary. At that time, the householder's son Singalaka, rising early and leaving Rajagaha, with wet clothes and wet hair, was reverently saluting the different directions—the eastern direction, the southern direction, the western direction, the northern direction, the lower direction, and the upper direction.",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ කලන්දක නිවාප නම් ස්ථානයෙහි වැඩ වාසය කරන සේක. එකල්හි සිඟාලක නම් ගෘහපති පුත්‍රයා ඉතා අලුයම නැඟිට රජගහ නුවරින් නික්ම තෙත්වූ වස්ත්‍ර ඇතිව, තෙත්වූ කෙස් ඇතිව, දොහොත් මුදුන් දී නොයෙක් දිශාවන්ට නමස්කාර කෙරේ. එනම්, නැගෙනහිර දිශාවට ද, දකුණු දිශාවට ද, බටහිර දිශාවට ද, උතුරු දිශාවට ද, යට දිශාවට ද, උඩ දිශාවට ද (වඳියි).",
      "paliTitle": ""
    },
    {
      "number": 243,
      "pali": "Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya rājagahaṃ piṇḍāya pāvisi. Addasā kho bhagavā siṅgālakaṃ gahapatiputtaṃ kālasseva vuṭṭhāya rājagahā nikkhamitvā allavatthaṃ allakesaṃ pañjalikaṃ puthudisā namassantaṃ – puratthimaṃ disaṃ dakkhiṇaṃ disaṃ pacchimaṃ disaṃ uttaraṃ disaṃ heṭṭhimaṃ disaṃ uparimaṃ disaṃ. Disvā siṅgālakaṃ gahapatiputtaṃ etadavoca – ‘‘kiṃ nu kho tvaṃ, gahapatiputta, kālasseva uṭṭhāya rājagahā nikkhamitvā allavattho allakeso pañjaliko puthudisā namassasi – puratthimaṃ disaṃ dakkhiṇaṃ disaṃ pacchimaṃ disaṃ uttaraṃ disaṃ heṭṭhimaṃ disaṃ uparimaṃ disa’’nti? ‘‘Pitā maṃ, bhante, kālaṃ karonto evaṃ avaca – ‘disā, tāta, namasseyyāsī’ti. So kho ahaṃ, bhante, pituvacanaṃ sakkaronto garuṃ karonto mānento pūjento kālasseva uṭṭhāya rājagahā nikkhamitvā allavattho allakeso pañjaliko puthudisā namassāmi – puratthimaṃ disaṃ dakkhiṇaṃ disaṃ pacchimaṃ disaṃ uttaraṃ disaṃ heṭṭhimaṃ disaṃ uparimaṃ disa’’nti. ",
      "english": "Then, in the morning, the Blessed One, having dressed, taking his bowl and robe, entered Rajagaha for alms. The Blessed One saw Sigalaka, the householder's son, rising early and leaving Rajagaha, with wet clothes and wet hair, raising his joined hands, venerating the different directions: the eastern direction, the southern direction, the western direction, the northern direction, the lower direction, and the upper direction. Seeing him, the Blessed One said to Sigalaka, the householder's son, \"Why, householder's son, do you, rising early and leaving Rajagaha, with wet clothes and wet hair, raising your joined hands, venerate the different directions: the eastern direction, the southern direction, the western direction, the northern direction, the lower direction, and the upper direction?\" \"When he was dying, Venerable Sir, my father told me, 'Dear son, you should venerate the directions.' So, Venerable Sir, respecting, honoring, esteeming, and venerating my father's word, I rise early and leave Rajagaha, with wet clothes and wet hair, raising my joined hands, I venerate the different directions: the eastern direction, the southern direction, the western direction, the northern direction, the lower direction, and the upper direction.\"",
      "sinhala": "ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරු කාලයෙහි සිවුරු හැඳ, පාත්‍රය හා සිවුර ගෙන රජගහ නුවරට පිණ්ඩපාතය සඳහා වැඩම කළ සේක. භාග්‍යවතුන් වහන්සේ සිඟාලක නම් ගෘහපති පුත්‍රයෙක් අලුයම නැගිට රජගහ නුවරින් පිටත්ව තෙත් වස්ත්‍ර ඇතිව, තෙත් කෙස් ඇතිව, දොහොත් මුදුන් දී ප්‍රත්‍යෙක දිශාවන්ට නමස්කාර කරමින් සිටිනු දුටු සේක. එනම්, නැගෙනහිර දිශාවට, දකුණු දිශාවට, බටහිර දිශාවට, උතුරු දිශාවට, යට දිශාවට, උඩ දිශාවටය. දැක සිඟාලක ගෘහපති පුත්‍රයාට මෙය වදාළ සේක. “ගෘහපති පුත්‍රය, ඔබ අලුයම නැගිට රජගහ නුවරින් පිටත්ව තෙත් වස්ත්‍ර ඇතිව, තෙත් කෙස් ඇතිව, දොහොත් මුදුන් දී ප්‍රත්‍යෙක දිශාවන්ට නමස්කාර කරන්නේ කුමක් නිසාද? එනම්, නැගෙනහිර දිශාවට, දකුණු දිශාවට, බටහිර දිශාවට, උතුරු දිශාවට, යට දිශාවට, උඩ දිශාවටය” කියා විමසූ සේක. “ස්වාමීනි, මාගේ පියා මරණයට පත්වෙමින් මෙසේ කීවේය. ‘පුත, දිශාවන්ට නමස්කාර කළ යුතුයි’ කියාය. ස්වාමීනි, මම ඒ පියාගේ වචනය සක්කරමින්, ගරු කරමින්, බුහුමන් කරමින්, පුදමින් අලුයම නැගිට රජගහ නුවරින් පිටත්ව තෙත් වස්ත්‍ර ඇතිව, තෙත් කෙස් ඇතිව, දොහොත් මුදුන් දී ප්‍රත්‍යෙක දිශාවන්ට නමස්කාර කරමි. එනම්, නැගෙනහිර දිශාවට, දකුණු දිශාවට, බටහිර දිශාවට, උතුරු දිශාවට, යට දිශාවට, උඩ දිශාවටය” යි පැවසීය.",
      "paliTitle": ""
    },
    {
      "number": 244,
      "pali": "‘‘Na kho, gahapatiputta, ariyassa vinaye evaṃ cha disā [chaddisā (sī. pī.)] namassitabbā’’ti. ‘‘Yathā kathaṃ pana, bhante, ariyassa vinaye cha disā [chaddisā (sī. pī.)] namassitabbā? Sādhu me, bhante, bhagavā tathā dhammaṃ desetu, yathā ariyassa vinaye cha disā [chaddisā (sī. pī.)] namassitabbā’’ti. ‘‘Tena hi, gahapatiputta suṇohi sādhukaṃ manasikarohi bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho siṅgālako gahapatiputto bhagavato paccassosi. Bhagavā etadavoca – ‘‘Yato kho, gahapatiputta, ariyasāvakassa cattāro kammakilesā pahīnā honti, catūhi ca ṭhānehi pāpakammaṃ na karoti, cha ca bhogānaṃ apāyamukhāni na sevati, so evaṃ cuddasa pāpakāpagato chaddisāpaṭicchādī [paṭicchādī hoti (syā.)] ubholokavijayāya paṭipanno hoti. Tassa ayañceva loko āraddho hoti paro ca loko. So kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. ",
      "english": "\"It is not in this way, householder's son, that the six directions should be venerated in the Noble One's Discipline.\" \"But in what way, venerable sir, should the six directions be venerated in the Noble One's Discipline? It would be good, venerable sir, if the Blessed One would teach me the Dharma in such a way that the six directions should be venerated in the Noble One's Discipline.\" \"Then, householder's son, listen and attend closely to what I shall say.\" \"Yes, venerable sir,\" Siṅgālaka, the householder's son, responded to the Blessed One. The Blessed One said this: \"When, householder's son, the four defilements of action are abandoned in a Noble Disciple, and he commits no evil through four causes, and he does not cultivate the six ways of dissipating wealth, then, being rid of these fourteen evil things, he is one who covers the six directions, and he is committed to victory in both worlds. For him, both this world and the next are won. On the dissolution of the body, after death, he is reborn in a good destination, a heavenly world.\"",
      "sinhala": "‘‘ගෘහපතියන්ගේ පුත්‍රය, ආර්ය විනයෙහි මෙසේ දිශාවන් හය [සදිශාවන්] වැඳිය යුතු නොවේ.’’ ‘‘ස්වාමීනි, ආර්ය විනයෙහි කෙසේ නම් දිශාවන් හය [සදිශාවන්] වැඳිය යුතු වන්නේ ද? ස්වාමීනි, ආර්ය විනයෙහි දිශාවන් හය [සදිශාවන්] වැඳිය යුතු වන ආකාරය යම් සේ ද, භාග්‍යවතුන් වහන්සේ මට ඒ ධර්මය දේශනා කරන සේක්වා.’’ ‘‘එසේ නම්, ගෘහපතියන්ගේ පුත්‍රය, අසන්න. මනාව මෙනෙහි කරන්න. කියන්නෙමි.’’ ‘‘එසේය, ස්වාමීනි,’’ යයි සිඟාලක ගෘහපති පුත්‍රයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේ ය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක – ‘‘ගෘහපතියන්ගේ පුත්‍රය, යම් කලෙක ආර්ය ශ්‍රාවකයාගේ කර්ම කිලිටි සතරක් පහව ගියේ ද, තවද කරුණු සතරකින් පාපකර්මයක් නොකරයි ද, තවද භෝගයන්ගේ අපාය මුඛ හය සේවනය නොකරයි ද, හෙතෙම මෙසේ දොළොස් ආකාර පාපයන්ගෙන් බැහැර වූයේ දිශාවන් හය වසාගෙන දෙලොව ජයගැනීම පිණිස පිළිපන්නේ වෙයි. ඔහුගේ මේ ලෝකය ද ආරම්භ කරන ලද්දේ වෙයි. පරලොව ද (ආරම්භ කරන ලද්දේ වෙයි). හෙතෙම කය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට පැමිණෙයි.",
      "paliTitle": "Cha disā",
      "englishTitle": "The Six Directions",
      "sinhalaTitle": "හය දිශා"
    },
    {
      "number": 245,
      "pali": "‘‘Katamassa cattāro kammakilesā pahīnā honti? Pāṇātipāto kho, gahapatiputta, kammakileso, adinnādānaṃ kammakileso, kāmesumicchācāro kammakileso, musāvādo kammakileso. Imassa cattāro kammakilesā pahīnā hontī’’ti. Idamavoca bhagavā, idaṃ vatvāna [idaṃ vatvā (sī. pī.) evamīdisesu ṭhānesu] sugato athāparaṃ etadavoca satthā – ‘‘Pāṇātipāto adinnādānaṃ, musāvādo ca vuccati; Paradāragamanañceva, nappasaṃsanti paṇḍitā’’ti. ",
      "english": "\"What four defilements of action are abandoned?\"\n\nKilling living beings, householder's son, is a defilement of action; taking what is not given is a defilement of action; misconduct in sexual pleasures is a defilement of action; false speech is a defilement of action. These four defilements of action are abandoned in him.\"\n\nThis the Blessed One said. Having said this, the Fortunate One, the Teacher, further said this: \"Killing living beings, taking what is not given, and false speech are spoken of; also, going to another's spouse is not praised by the wise.\"",
      "sinhala": "‘‘කුමන පුද්ගලයෙකුගේ කර්ම කිලෙස සතරක් දුරු වී තිබේද? ගෘහපති පුත්‍රය, ප්‍රාණඝාතය කර්ම කිලෙසයෙකි, අදත්තාදානය කර්ම කිලෙසයෙකි, කාමයේ වරදෙහි හැසිරීම කර්ම කිලෙසයෙකි, මුසාවාදය කර්ම කිලෙසයෙකි. මේ පුද්ගලයාගේ කර්ම කිලෙස සතර දුරු වී තිබේ’’ යැයි භාග්‍යවතුන් වහන්සේ වදාළහ. මෙය වදාළ භාග්‍යවතුන් වහන්සේ, මෙය පවසා සුගත තථාගතයන් වහන්සේ නැවත මෙසේ වදාළහ. ‘‘ප්‍රාණඝාතය, අදත්තාදානය, මුසාවාදය යැයි කියනු ලැබේ; එමෙන්ම අනුන්ගේ භාර්යාවන් හා ගමන් කිරීමද පණ්ඩිතයන් විසින් ප්‍රශංසා නොකරනු ලැබේ.’’",
      "paliTitle": "Cattārokammakilesā",
      "englishTitle": "The Four Karmic Defilements",
      "sinhalaTitle": "චතුර්‍ කම්ම ක්ලේශ"
    },
    {
      "number": 246,
      "pali": "‘‘Katamehi catūhi ṭhānehi pāpakammaṃ na karoti? Chandāgatiṃ gacchanto pāpakammaṃ karoti, dosāgatiṃ gacchanto pāpakammaṃ karoti, mohāgatiṃ gacchanto pāpakammaṃ karoti, bhayāgatiṃ gacchanto pāpakammaṃ karoti. Yato kho, gahapatiputta, ariyasāvako neva chandāgatiṃ gacchati, na dosāgatiṃ gacchati, na mohāgatiṃ gacchati, na bhayāgatiṃ gacchati; imehi catūhi ṭhānehi pāpakammaṃ na karotī’’ti. Idamavoca bhagavā, idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Chandā dosā bhayā mohā, yo dhammaṃ ativattati; Nihīyati yaso tassa [tassa yeso (bahūsu, vinayepi)], kāḷapakkheva candimā. ‘‘Chandā dosā bhayā mohā, yo dhammaṃ nātivattati; Āpūrati yaso tassa [tassa yeso (bahūsu, vinayepi)], sukkapakkheva [juṇhapakkheva (ka.)] candimā’’ti. ",
      "english": "\"Through which four reasons does one not commit evil deeds? By going to partiality through desire, one commits evil deeds. By going to partiality through aversion, one commits evil deeds. By going to partiality through delusion, one commits evil deeds. By going to partiality through fear, one commits evil deeds. But when, householder, a noble disciple does not go to partiality through desire, does not go to partiality through aversion, does not go to partiality through delusion, does not go to partiality through fear, through these four reasons, he does not commit evil deeds.\" The Blessed One said this. Having said this, the Fortunate One, the Teacher, then said further: \"Whoever transgresses the Dhamma through desire, aversion, fear, and delusion, his glory diminishes like the moon in the dark half of the month. Whoever does not transgress the Dhamma through desire, aversion, fear, and delusion, his glory fills up like the moon in the bright half of the month.\"",
      "sinhala": "‘‘කවර කරුණු සතරකින් පාපකර්මයක් නොකරන්නේද? ඡන්දයෙන් අගතියට යන්නේ පාපකර්මයක් කරයි. ද්වේෂයෙන් අගතියට යන්නේ පාපකර්මයක් කරයි. මෝහයෙන් අගතියට යන්නේ පාපකර්මයක් කරයි. භයයෙන් අගතියට යන්නේ පාපකර්මයක් කරයි. ගෘහපතියේ පුත්‍රය, යම් හෙයකින් ආර්‍ය්‍ය ශ්‍රාවකයා ඡන්දයෙන් අගතියට නොයන්නේද, ද්වේෂයෙන් අගතියට නොයන්නේද, මෝහයෙන් අගතියට නොයන්නේද, භයයෙන් අගතියට නොයන්නේද, මේ කරුණු සතරෙන් පාපකර්මයක් නොකරයි’’ කියා භාග්‍යවතුන් වදාළ සේක. මෙය වදාරා සුගතයන් වහන්සේ මෙය වදාරා ශාස්තෘන් වහන්සේ තවදුරටත් මෙසේ වදාළ සේක.\n\n‘‘යමෙක් ඡන්දය, ද්වේෂය, භය, මෝහය යන ධර්මයන් ඉක්මවා යන්නේද, ඔහුගේ යසස කළු පැහැ සඳ මෙන් පිරිහෙයි. යමෙක් ඡන්දය, ද්වේෂය, භය, මෝහය යන ධර්මයන් ඉක්මවා නොයන්නේද, ඔහුගේ යසස සුදු පැහැ සඳ මෙන් පිරෙයි.’’",
      "paliTitle": "Catuṭṭhānaṃ",
      "englishTitle": "The Tetrad",
      "sinhalaTitle": "චතුස්කය"
    },
    {
      "number": 247,
      "pali": "‘‘Katamāni cha bhogānaṃ apāyamukhāni na sevati? Surāmerayamajjappamādaṭṭhānānuyogo kho, gahapatiputta, bhogānaṃ apāyamukhaṃ, vikālavisikhācariyānuyogo bhogānaṃ apāyamukhaṃ, samajjābhicaraṇaṃ bhogānaṃ apāyamukhaṃ, jūtappamādaṭṭhānānuyogo bhogānaṃ apāyamukhaṃ, pāpamittānuyogo bhogānaṃ apāyamukhaṃ, ālasyānuyogo [ālasānuyogo (sī. syā. pī.)] bhogānaṃ apāyamukhaṃ. ",
      "english": "\"What are the six ways of dissipating wealth that he does not pursue? Addiction to intoxicants and sloth, householder, is a way of dissipating wealth; roaming the streets at unseemly hours is a way of dissipating wealth; frequenting fairs and festivals is a way of dissipating wealth; addiction to gambling and sloth is a way of dissipating wealth; association with evil companions is a way of dissipating wealth; and indulgence in laziness is a way of dissipating wealth.\"",
      "sinhala": "‘‘ගෘහපතිය, භෝගයන්ගේ අපාය මුඛ හය නම් මොනවාද යත්, සුරාමේරයමජ්ජප්පමාදට්ඨානානුයෝගය භෝගයන්ගේ අපාය මුඛයෙකි. විකාලවිසිඛාචරියානුයෝගය භෝගයන්ගේ අපාය මුඛයෙකි. සමාජ්ජාභිචරණය භෝගයන්ගේ අපාය මුඛයෙකි. ජූතප්පමාදට්ඨානානුයෝගය භෝගයන්ගේ අපාය මුඛයෙකි. පාපමිත්තානුයෝගය භෝගයන්ගේ අපාය මුඛයෙකි. ආලස්‍යානුයෝගය භෝගයන්ගේ අපාය මුඛයෙකි.",
      "paliTitle": "Cha apāyamukhāni",
      "englishTitle": "Six Causes of Downfall",
      "sinhalaTitle": "සය අපායමුඛ"
    },
    {
      "number": 248,
      "pali": "‘‘Cha khome, gahapatiputta, ādīnavā surāmerayamajjappamādaṭṭhānānuyoge. Sandiṭṭhikā dhanajāni [dhanañjāni (sī. pī.)], kalahappavaḍḍhanī, rogānaṃ āyatanaṃ, akittisañjananī, kopīnanidaṃsanī, paññāya dubbalikaraṇītveva chaṭṭhaṃ padaṃ bhavati. Ime kho, gahapatiputta, cha ādīnavā surāmerayamajjappamādaṭṭhānānuyoge. ",
      "english": "\"Householder's son, there are these six dangers in indulging in intoxicants that cause negligence. Firstly, it causes immediate loss of wealth; it increases quarrels; it is a source of diseases; it brings disgrace; it causes shameless exposure; and it weakens intelligence.\"\n\n\"These, householder's son, are the six dangers in indulging in intoxicants that cause negligence.\"",
      "sinhala": "‘‘ගෘහපතිය පුත්‍රය, සුරාමේරයමද්‍යප්‍රමාදස්ථානානුයෝගයෙහි ආදීනව හයක් ඇත. ක්ෂණිකව ධනය විනාශ කරන සුළුය, කලහ වර්ධනය කරයි, රෝගයන්ගේ උත්පත්තියට හේතු වෙයි, අයස ඇති කරයි, වස්ත්‍ර ඉවත් කර නිරුවත ප්‍රදර්ශනය කරයි, ප්‍රඥාව දුර්වල කරන්නේය යනු සයවැන්නයි. ගෘහපතිය පුත්‍රය, සුරාමේරයමද්‍යප්‍රමාදස්ථානානුයෝගයෙහි මෙම ආදීනව හය ඇත.’’",
      "paliTitle": "Surāmerayassa cha ādīnavā",
      "englishTitle": "Six Dangers of Intoxicants",
      "sinhalaTitle": "සුරාමේරයෙහි සය ආදීනව"
    },
    {
      "number": 249,
      "pali": "‘‘Cha khome, gahapatiputta, ādīnavā vikālavisikhācariyānuyoge. Attāpissa agutto arakkhito hoti, puttadāropissa agutto arakkhito hoti, sāpateyyaṃpissa aguttaṃ arakkhitaṃ hoti, saṅkiyo ca hoti pāpakesu ṭhānesu [tesu tesu ṭhānesu (syā.)], abhūtavacanañca tasmiṃ rūhati, bahūnañca dukkhadhammānaṃ purakkhato hoti. Ime kho, gahapatiputta, cha ādīnavā vikālavisikhācariyānuyoge. ",
      "english": "\"Householder's son, there are these six dangers in habitually frequenting untimely resorts. His own self is unguarded and unprotected; his children and wife are unguarded and unprotected; his property is unguarded and unprotected; he is suspected in evil places; false rumors increase for him; and he is the cause of many suffering things. These, householder's son, are the six dangers in habitually frequenting untimely resorts.\"",
      "sinhala": "“ගෘහපති පුත්‍රය, සවස නොකල්හි වීථිවල හැසිරීමෙහි ආදීනව හයක් මා විසින් කියනු ලැබේ. තමන් ආරක්ෂා රහිත වේ, භාර්යාව හා දරුවන් ආරක්ෂා රහිත වේ, තමන් සතු දේපළ ආරක්ෂා රහිත වේ, නරක තැන්වල සැරිසරන්නට සිදු වේ, බොරු කීමට පෙළඹේ, බොහෝ දුක් සහිත දේවලට මුහුණ දීමට සිදු වේ. ගෘහපති පුත්‍රය, සවස නොකල්හි වීථිවල හැසිරීමෙහි ඇති ආදීනව හය මෙය වේ.\"",
      "paliTitle": "Vikālacariyāya cha ādīnavā",
      "englishTitle": "Six Disadvantages of Untimely Conduct",
      "sinhalaTitle": "වි²කාල චරියාවේ සය ආදීනව"
    },
    {
      "number": 250,
      "pali": "‘‘Cha khome, gahapatiputta, ādīnavā samajjābhicaraṇe. Kva [kuvaṃ (ka. sī. pī.)] naccaṃ, kva gītaṃ, kva vāditaṃ, kva akkhānaṃ, kva pāṇissaraṃ, kva kumbhathunanti. Ime kho, gahapatiputta, cha ādīnavā samajjābhicaraṇe. ",
      "english": "\"Householder's son, there are these six drawbacks to attending festivals. What dancing, what singing, what music, what recitations, what hand-clapping, what pot-drumming! These, householder's son, are the six drawbacks to attending festivals.\"",
      "sinhala": "‘‘ගෘහපති පුත්‍රය, සූදු කෙළියෙහි ආදීනව හයක් මා විසින් කියන ලදී. නැටුම් කොහිද, ගීත කොහිද, වාදනය කොහිද, ආඛ්‍යාන කොහිද, අත්ලෙන් ශබ්ද කිරීම කොහිද, කුම්භතූන නම් වූ ක්‍රීඩා කොහිද යන මේවා සූදු කෙළියෙහි ඇලී ගැලී සිටීමෙහි ආදීනව වෙයි. ගෘහපති පුත්‍රය, සූදු කෙළියෙහි ඇලී ගැලී සිටීමෙහි මේ ආදීනව හය වෙයි.",
      "paliTitle": "Samajjābhicaraṇassa cha ādīnavā",
      "englishTitle": "Six Dangers of Frequenting Public Gatherings",
      "sinhalaTitle": "සමජ ඇසුරේ හය ආදීනව"
    },
    {
      "number": 251,
      "pali": "‘‘Cha khome, gahapatiputta, ādīnavā jūtappamādaṭṭhānānuyoge. Jayaṃ veraṃ pasavati, jino vittamanusocati, sandiṭṭhikā dhanajāni, sabhāgatassa [sabhāye tassa (ka.)] vacanaṃ na rūhati, mittāmaccānaṃ paribhūto hoti, āvāhavivāhakānaṃ apatthito hoti – ‘akkhadhutto ayaṃ purisapuggalo nālaṃ dārabharaṇāyā’ti. Ime kho, gahapatiputta, cha ādīnavā jūtappamādaṭṭhānānuyoge. ",
      "english": "\"These six dangers, householder, are in constantly engaging in the pursuit of gambling. The winner begets enmity, the loser grieves for the lost wealth, there is direct loss of wealth, one's word is not heeded in the assembly, one is despised by friends and associates, and one is not sought after for marriage, since people say, 'This person is a gambler and is not fit to support a wife.' These, householder, are the six dangers in constantly engaging in the pursuit of gambling.\"",
      "sinhala": "ගෘහපති පුත්‍රය, සූදුවෙහි ඇලී සිටීමෙහි ආදීනව හයක් ඇත. දිනු විට වෛරය උපදී, දිනූ වස්තුව ගැන පසුව තැවේ, ඇස් පනාපිටම ධනය විනාශ වේ, සභාවෙහි කී වචනය පිළිගැනීමට සුදුසු නොවේ, මිත්‍රයන් හා නෑයන් විසින් අවමන් කරනු ලැබේ, ‘මේ පුරුෂයා සූදුවට ලොල් වූවෙකි, භාර්යාව පෝෂණය කිරීමට නුසුදුසුය’ කියා විවාහ මංගල්‍යයන්ට ඔහු අවශ්‍ය නොවෙයි. ගෘහපති පුත්‍රය, සූදුවෙහි ඇලී සිටීමෙහි මෙම ආදීනව හය ඇත.",
      "paliTitle": "Jūtappamādassa cha ādīnavā",
      "englishTitle": "Six Dangers of Gambling Heedlessness",
      "sinhalaTitle": "සූදු ප්‍රමාදයේ සය ආදීනව"
    },
    {
      "number": 252,
      "pali": "‘‘Cha khome, gahapatiputta, ādīnavā pāpamittānuyoge. Ye dhuttā, ye soṇḍā, ye pipāsā, ye nekatikā, ye vañcanikā, ye sāhasikā. Tyāssa mittā honti te sahāyā. Ime kho, gahapatiputta, cha ādīnavā pāpamittānuyoge. ",
      "english": "\"Householder, there are these six dangers in associating with bad friends. They are gamblers, drunkards, those who are addicted to intoxicants, fraudsters, deceivers, and violent people. These are the friends and companions one has. These, householder, are the six dangers in associating with bad friends.\"",
      "sinhala": "ගෘහපති පුත්‍රය, පාප මිත්‍ර ඇසුරෙහි ආදීනව හයක් ඇත. සූදූ කෙළින්නෝ ද, බේබද්දෝ ද, බීමත් වන්නෝ ද, වංචනිකයෝ ද, බොරු කියන්නෝ ද, ප්‍රචණ්ඩකාරීහු ද වෙති. ඔවුහු ඔහුගේ මිතුරෝ ද, සහායකයෝ ද වෙති. ගෘහපති පුත්‍රය, පාප මිත්‍ර ඇසුරෙහි මෙම ආදීනව හය ඇත.",
      "paliTitle": "Pāpamittatāya cha ādīnavā",
      "englishTitle": "Six Disadvantages of Bad Friendship",
      "sinhalaTitle": "පාප මිත්‍රත්වයේ සය ආදීනව"
    },
    {
      "number": 253,
      "pali": "‘‘Cha khome, gahapatiputta, ādīnavā ālasyānuyoge. Atisītanti kammaṃ na karoti, atiuṇhanti kammaṃ na karoti, atisāyanti kammaṃ na karoti, atipātoti kammaṃ na karoti, atichātosmīti kammaṃ na karoti, atidhātosmīti kammaṃ na karoti. Tassa evaṃ kiccāpadesabahulassa viharato anuppannā ceva bhogā nuppajjanti, uppannā ca bhogā parikkhayaṃ gacchanti. Ime kho, gahapatiputta, cha ādīnavā ālasyānuyoge’’ti. Idamavoca bhagavā, idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Hoti pānasakhā nāma, Hoti sammiyasammiyo; Yo ca atthesu jātesu, Sahāyo hoti so sakhā. ‘‘Ussūraseyyā paradārasevanā, Verappasavo [verappasaṅgo (sī. syā. pī.)] ca anatthatā ca; Pāpā ca mittā sukadariyatā ca, Ete cha ṭhānā purisaṃ dhaṃsayanti. ‘‘Pāpamitto pāpasakho, Pāpaācāragocaro; Asmā lokā paramhā ca, Ubhayā dhaṃsate naro. ‘‘Akkhitthiyo vāruṇī naccagītaṃ, Divā soppaṃ pāricariyā akāle; Pāpā ca mittā sukadariyatā ca, Ete cha ṭhānā purisaṃ dhaṃsayanti. ‘‘Akkhehi dibbanti suraṃ pivanti, Yantitthiyo pāṇasamā paresaṃ; Nihīnasevī na ca vuddhasevī [vuddhisevī (syā.), buddhisevī (ka.)], Nihīyate kāḷapakkheva cando. ‘‘Yo vāruṇī addhano akiñcano, Pipāso pivaṃ papāgato [pipāsosi atthapāgato (syā.), pipāsopi samappapāgato (ka.)]; Udakamiva iṇaṃ vigāhati, Akulaṃ [ākulaṃ (syā. ka.)] kāhiti khippamattano. ‘‘Na divā soppasīlena, rattimuṭṭhānadessinā [rattinuṭṭhānadassinā (sī. pī.), rattinuṭṭhānasīlinā (?)]; Niccaṃ mattena soṇḍena, sakkā āvasituṃ gharaṃ. ‘‘Atisītaṃ atiuṇhaṃ, atisāyamidaṃ ahu; Iti vissaṭṭhakammante, atthā accenti māṇave. ‘‘Yodha sītañca uṇhañca, tiṇā bhiyyo na maññati; Karaṃ purisakiccāni, so sukhaṃ [sukhā (sabbattha) aṭṭhakathā oloketabbā] na vihāyatī’’ti. ",
      "english": "\"Householder, there are these six drawbacks in being given to laziness. It is too cold, and one does not work. It is too hot, and one does not work. It is too early, and one does not work. It is too late, and one does not work. I am too hungry, and one does not work. I am too full, and one does not work. For him, living with many excuses connected with work, gains that have not arisen do not arise, and gains that have arisen go to ruin. These, householder, are the six drawbacks in being given to laziness.\"\n\nThis is what the Blessed One said. Having said this, the Fortunate One, the Teacher, then said further: \"One is called a drinking companion; one is called a 'yes-man'; but he who is a friend in times of need, he is a true friend.\n\nIndolence, fondness for couches, association with others’ wives, cruelty and lack of substance, evil friends and stinginess, these six things ruin a man.\n\nA friend who is evil, a companion who is evil, one who is of evil conduct and resort, is ruined in both this world and the next.\n\nAddiction to women, alcohol, dancing, and singing, sleeping during the day, being on errands at unseemly hours, evil friends, and stinginess, these six things ruin a man.\n\nThey gamble with dice, they drink liquor, their wives are dearer than life to others, they associate with the base and not with the elders, they decline like the dark half of the moon.\n\nWhoever, penniless and destitute, drinks liquor at the tavern, even though thirsty, drinks only water, he quickly incurs debt and makes himself miserable.\n\nIt is not possible to live in the same house with one who sleeps during the day, is keen on rising at night, and is constantly drunk and addicted to strong drink.\n\n'It is too cold, it is too hot, it is too late in the day': thus, people neglect their work, and their prospects pass them by.\n\nBut he who does not consider cold or heat to be more than grass, doing the work of a man, does not fall away from happiness.\"",
      "sinhala": "“ගෘහපතිය, කම්මැළිකමෙහි ඇලී සිටීමෙහි ආදීනව හයක් ඇත. අධික ලෙස සීතලයි කියා කර්මාන්ත නොකරයි. අධික ලෙස උණුසුම්යි කියා කර්මාන්ත නොකරයි. සවස් වී ඇතැයි කියා කර්මාන්ත නොකරයි. වේලාසන වැඩියි කියා කර්මාන්ත නොකරයි. මම අධික ලෙස බඩගින්නෙන් පෙළෙන්නෙමියි කියා කර්මාන්ත නොකරයි. මම අධික ලෙස පිපාසයෙන් පෙළෙන්නෙමියි කියා කර්මාන්ත නොකරයි. මෙසේ කාරණා දක්වමින් කල් ගත කරන ඔහුට නූපන් භෝගයෝ නූපදිත්. උපන් භෝගයෝ ද පරිහානියට යත්. ගෘහපතිය, කම්මැළිකමෙහි ඇලී සිටීමෙහි මේ ආදීනව හයයි.” භාග්‍යවතුන් වහන්සේ මෙය වදාළහ. සුගතයන් වහන්සේ මෙය වදාරා අනතුරුව ශාස්තෘන් වහන්සේ මෙය වදාළහ.\n\n“පැන් බොන මිත්‍රයෙක් නම් වෙයි. හුදු ප්‍රිය වචන කියන මිත්‍රයෙක් ද වෙයි. යම් කෙනෙක් අර්ථ සිද්ධවීමේ දී සහායක වේ නම්, ඔහු සැබෑ මිත්‍රයෙකි. අධික උත්සාහය, අකල්හි නිද්‍රාව, අනුන්ගේ භාර්යාවන් සේවනය කිරීම, වෛරය වැඩිවන කාරණා, අසත්පුරුෂභාවය, පවිටු මිතුරන් ඇසුරු කිරීම හා කුසීත බව යන මේ කාරණා හය පුරුෂයා පිරිහෙළයි. පවිටු මිත්‍රයා, පවිටු සහායකයා, පවිටු ආචාර ඇති ගොචර ඇත්තා යන මොහු මේ ලෝකයෙන් ද, පරලෝකයෙන් ද යන දෙකින් ම පිරිහෙයි.\n\nඅක්‍ෂ ක්‍රීඩා කිරීම, මත්පැන් පානය කිරීම, නැටුම් ගැයුම්, දහවල් නින්ද, අකල්හි ගමන් බිමන් යාම, පවිටු මිතුරන් ඇසුරු කිරීම හා කුසීත බව යන මේ කාරණා හය පුරුෂයා පිරිහෙළයි. දූ කෙළියෙන් සූදුවෙහි ඇලෙයි. මත්පැන් බොයි. අනුන්ගේ භාර්යාවන් තමාගේ ප්‍රාණය මෙන් සලකයි. පහත් ඇසුරෙහි ඇලෙයි. වැඩිහිටියන් සේවනය නොකරයි. කළු පක්ෂයේ චන්ද්‍රයා මෙන් පිරිහෙයි.\n\nයමෙක් මත්පැන් බොන්නෙක් ද, ධනය නැත්තෙක් ද, කිසිවක් නැත්තෙක් ද, පිපාසයෙන් පෙළෙමින් ළිඳකට පැමිණියේ ද, ඔහු ජලය මෙන් ණයට බසී. තමා ඉක්මනින් අසරණ කර ගන්නේ ය. දහවල් නිදන්නා වූ පුරුෂයාගේ ගෙදර වෙසෙන්නට නොහැකිය. රාත්‍රියේ නැගිටීම නො දක්නාවූ, නිතර ම මත්වූ බේබද්දෙකුට ද ගෙයක වෙසෙන්නට නොහැකිය.\n\nඅධික ලෙස සීතලයි. අධික ලෙස උණුසුම්යි. සවස් වී ඇත. මෙය කරන ලද දෙයකි. මෙසේ කර්මාන්ත අත්හරින මිනිසාගේ අර්ථයෝ නැතිව යති. යමෙක් මෙහි සීතලත්, උණුසුමත් තණ මෙන් වත් නො සලකන්නේ ද, පුරුෂ කටයුතු කරන්නේ ද, ඔහු සැපයෙන් නො පිරිහෙන්නේ ය.”",
      "paliTitle": "Ālasyassa cha ādīnavā",
      "englishTitle": "Six Dangers of Laziness",
      "sinhalaTitle": "අලසකමේ සය ආදීනව"
    },
    {
      "number": 254,
      "pali": "‘‘Cattārome, gahapatiputta, amittā mittapatirūpakā veditabbā. Aññadatthuharo amitto mittapatirūpako veditabbo, vacīparamo amitto mittapatirūpako veditabbo, anuppiyabhāṇī amitto mittapatirūpako veditabbo, apāyasahāyo amitto mittapatirūpako veditabbo.",
      "english": "\"These four, householder, are to be known as enemies in the guise of friends. The one who appropriates things, householder, is an enemy in the guise of a friend. The one who talks much but does little, householder, is an enemy in the guise of a friend. The one who flatters, householder, is an enemy in the guise of a friend. The one who is a companion in ruinous pursuits, householder, is an enemy in the guise of a friend.\"",
      "sinhala": "“ගෘහපතියේ පුත්‍රය, සතුරන් වැනි හිතමිතුරන් සතර දෙනෙක් සිටිති. අන්‍යදත්ථුහර නම් වූ සතුරු මිත්‍ර ප්‍රතිරූපකයා හඳුනාගත යුතුය. වචීපරම නම් වූ සතුරු මිත්‍ර ප්‍රතිරූපකයා හඳුනාගත යුතුය. අනුප්පියභාණී නම් වූ සතුරු මිත්‍ර ප්‍රතිරූපකයා හඳුනාගත යුතුය. අපායසහාය නම් වූ සතුරු මිත්‍ර ප්‍රතිරූපකයා හඳුනාගත යුතුය.",
      "paliTitle": "Mittapatirūpakā",
      "englishTitle": "False Friends",
      "sinhalaTitle": "ව්‍යාජ මිත්‍රයෝ"
    },
    {
      "number": 255,
      "pali": "‘‘Catūhi kho, gahapatiputta, ṭhānehi aññadatthuharo amitto mittapatirūpako veditabbo. ‘‘Aññadatthuharo hoti, appena bahumicchati; Bhayassa kiccaṃ karoti, sevati atthakāraṇā. ‘‘Imehi kho, gahapatiputta, catūhi ṭhānehi aññadatthuharo amitto mittapatirūpako veditabbo.",
      "english": "\"In four ways, householder, a friend who appropriates things is to be regarded as a false friend. He appropriates things, he desires much from little; he does what should be done out of fear, he associates for the sake of gain. In these four ways, householder, a friend who appropriates things is to be regarded as a false friend.\"",
      "sinhala": "ගෘහපති පුත්‍රය, යම් කරුණු සතරකින් හිතවතෙකු මෙන් පෙනී සිටින, අන්‍ය කටයුතු වලට පමණක් උදව් කරන, සැබෑ මිතුරෙකු නොවූ ව්‍යාජ මිතුරා හඳුනාගත යුතුයි. හේ මෙබඳු අයෙක් වෙයි.\n\nඔහු අන්‍ය කටයුතු වලට පමණක් උදව් කරන අයෙක් වෙයි. තමා සතුව අල්ප වූ දෙයක් තිබියදී බොහෝ දේ ලබා ගැනීමට කැමති වෙයි. බිය ඇති වූ විට පමණක් කළ යුතු දේ කරයි. තමාගේ කටයුතු සිද්ධ කරගැනීමට පමණක් ඇසුරු කරයි.\n\nගෘහපති පුත්‍රය, මේ කරුණු සතරෙන් යුක්ත වූ හිතවතෙකු මෙන් පෙනී සිටින, අන්‍ය කටයුතු වලට පමණක් උදව් කරන, සැබෑ මිතුරෙකු නොවූ ව්‍යාජ මිතුරා හඳුනාගත යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 256,
      "pali": "‘‘Catūhi kho, gahapatiputta, ṭhānehi vacīparamo amitto mittapatirūpako veditabbo. Atītena paṭisantharati [paṭisandharati (ka.)], anāgatena paṭisantharati, niratthakena saṅgaṇhāti, paccuppannesu kiccesu byasanaṃ dasseti. Imehi kho, gahapatiputta, catūhi ṭhānehi vacīparamo amitto mittapatirūpako veditabbo.",
      "english": "\"In four ways, householder, a word-deep friend who is an enemy in the guise of a friend is to be understood. He ingratiates himself with regard to the past, he ingratiates himself with regard to the future, he tries to win you over with useless things, and he shows misfortune in present affairs. In these four ways, householder, a word-deep friend who is an enemy in the guise of a friend is to be understood.\"",
      "sinhala": "‘‘ගෘහපතියෙනි, වචනයෙන් පමණක් මිත්‍රයා ලෙස පෙනී සිටින සතුරෙකු ස්ථාන සතරකින් හඳුනාගත යුතුයි. ඔහු අතීතය ගැන කතා කරමින් සතුටු කරයි, අනාගතය ගැන කතා කරමින් සතුටු කරයි, නිෂ්ඵල දේවලින් සංග්‍රහ කරයි, වර්තමාන කටයුතුවලදී විපතක් පෙන්වයි. ගෘහපතියෙනි, වචනයෙන් පමණක් මිත්‍රයා ලෙස පෙනී සිටින සතුරෙකු මෙම ස්ථාන සතරෙන් හඳුනාගත යුතුයි.’’",
      "paliTitle": ""
    },
    {
      "number": 257,
      "pali": "‘‘Catūhi kho, gahapatiputta, ṭhānehi anuppiyabhāṇī amitto mittapatirūpako veditabbo. Pāpakaṃpissa [pāpakammaṃpissa (syā.)] anujānāti, kalyāṇaṃpissa anujānāti, sammukhāssa vaṇṇaṃ bhāsati, parammukhāssa avaṇṇaṃ bhāsati. Imehi kho, gahapatiputta, catūhi ṭhānehi anuppiyabhāṇī amitto mittapatirūpako veditabbo.",
      "english": "\"In four ways, householder, a pretended friend, an enemy in the guise of a friend, is to be recognized as one who speaks with agreement. He approves of his evil deeds, he approves of his good deeds, he speaks well of him to his face, and he speaks ill of him behind his back. In these four ways, householder, a pretended friend, an enemy in the guise of a friend, is to be recognized as one who speaks with agreement.\"",
      "sinhala": "‘‘ගෘහපති පුත්‍රය, කරුණු සතරකින් හිතමිතුරු වෙස්ගත් සතුරෙකු හඳුනාගත යුතුයි. ඔහු නරක දේ අනුමත කරයි, හොඳ දේ අනුමත කරයි, ඔහු ඉදිරියේ ප්‍රශංසා කරයි, පිටුපසින් නින්දා කරයි. ගෘහපති පුත්‍රය, මේ කරුණු සතරෙන් හිතමිතුරු වෙස්ගත් සතුරෙකු හඳුනාගත යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 258,
      "pali": "‘‘Catūhi kho, gahapatiputta, ṭhānehi apāyasahāyo amitto mittapatirūpako veditabbo. Surāmeraya majjappamādaṭṭhānānuyoge sahāyo hoti, vikāla visikhā cariyānuyoge sahāyo hoti, samajjābhicaraṇe sahāyo hoti, jūtappamādaṭṭhānānuyoge sahāyo hoti. Imehi kho, gahapatiputta, catūhi ṭhānehi apāyasahāyo amitto mittapatirūpako veditabbo’’ti.",
      "english": "\"In four ways, young householder, a pretended friend, an enemy in the guise of a friend, can be known as a companion in ruin. He is a companion in indulging in intoxicants, wines, and liquors that cause carelessness; he is a companion in wandering about at unseemly hours; he is a companion in frequenting festivals and gatherings; he is a companion in being devoted to gambling, which is a cause for negligence. In these four ways, young householder, a pretended friend, an enemy in the guise of a friend, can be known as a companion in ruin.\"",
      "sinhala": "‘‘ගෘහපති පුත්‍රය, යම් කරුණු සතරකින් හිතමිතුරු වෙස් ගත් සැබෑ මිතුරෙකු නොවන්නා වූ අපායට හිතවත් මිතුරෙකු හඳුනාගත යුතු වේ. සුරාමේර පානයෙහි ඇලී මත් බවෙහි නොසැලකිලිමත්වීමෙහි ඇසුරු කරයි. නොකල්හි වීථිවල හැසිරීමෙහි ඇසුරු කරයි. නාට්‍ය නැරඹීමෙහි ඇසුරු කරයි. සූදුවෙහි ඇලී ප්‍රමාද වීමේ ස්‌ථානයෙහි ඇසුරු කරයි. ගෘහපති පුත්‍රය, මේ කරුණු සතරෙන් යුක්ත වූ හිතමිතුරු වෙස් ගත් සැබෑ මිතුරෙකු නොවන්නා වූ අපායට හිතවත් මිතුරෙකු හඳුනාගත යුතුයි.’’",
      "paliTitle": ""
    },
    {
      "number": 259,
      "pali": "Idamavoca bhagavā, idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Aññadatthuharo mitto, yo ca mitto vacīparo [vacīparamo (syā.)]; Anuppiyañca yo āha, apāyesu ca yo sakhā. Ete amitte cattāro, iti viññāya paṇḍito; Ārakā parivajjeyya, maggaṃ paṭibhayaṃ yathā’’ti. ",
      "english": "Thus spoke the Blessed One. Having said this, the Fortunate One, the Teacher, then said further: \"The friend who takes away what is another's, and the friend whose words are his highest aim; He who speaks what is unendearing, and he who is a companion in ruinous courses. These are the four kinds of false friends; having understood this, the wise man should carefully avoid them, as he would a dangerous path.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගතයන් වහන්සේ මෙය පවසා අනතුරුව ශාස්තෘන් වහන්සේ මෙසේ වදාළ සේක. \"වෙනත් කෙනෙකුගේ යහපත නැති කරන්නා වූ මිත්‍රයාද, වචනයෙන් පමණක් මිත්‍රයා වන තැනැත්තාද, ප්‍රිය නොවූ දේ පවසන්නාද, අපායට යන මාර්ගයේදී මිත්‍රයා ලෙස සිටින්නාද යන මොහු සතර දෙනා සතුරෝ වෙති. මෙසේ දැනගත් නුවණැත්තා භයානක මාර්ගයක් මෙන් ඔවුන්ගෙන් දුරස් විය යුතුය.\"",
      "paliTitle": ""
    },
    {
      "number": 260,
      "pali": "‘‘Cattārome, gahapatiputta, mittā suhadā veditabbā. Upakāro [upakārako (syā.)] mitto suhado veditabbo, samānasukhadukkho mitto suhado veditabbo, atthakkhāyī mitto suhado veditabbo, anukampako mitto suhado veditabbo.",
      "english": "\"These four, householder, are friends who are to be recognized as true-hearted: the helper, the friend who shares joy and sorrow equally, the advisor, and the sympathetic friend.\"",
      "sinhala": "‘‘ගෘහපතිය, යහළුවෝ සුවද දෙන මිතුරෝ සතර දෙනෙක් වෙති. උපකාර කරන මිත්‍රයා සුවද දෙන මිතුරෙකු ලෙස දත යුතු ය, සමාන සැප දුක් ඇති මිත්‍රයා සුවද දෙන මිතුරෙකු ලෙස දත යුතු ය, අර්ථ දක්වන මිත්‍රයා සුවද දෙන මිතුරෙකු ලෙස දත යුතු ය, අනුකම්පා කරන මිත්‍රයා සුවද දෙන මිතුරෙකු ලෙස දත යුතු ය.",
      "paliTitle": "Suhadamitto",
      "englishTitle": "Good-hearted Friend",
      "sinhalaTitle": "සුහද මිතුරා"
    },
    {
      "number": 261,
      "pali": "‘‘Catūhi kho, gahapatiputta, ṭhānehi upakāro mitto suhado veditabbo. Pamattaṃ rakkhati, pamattassa sāpateyyaṃ rakkhati, bhītassa saraṇaṃ hoti, uppannesu kiccakaraṇīyesu taddiguṇaṃ bhogaṃ anuppadeti. Imehi kho, gahapatiputta, catūhi ṭhānehi upakāro mitto suhado veditabbo.",
      "english": "\"In four ways, householder's son, a helpful friend, a true friend, should be recognized. He protects one who is heedless, he guards the wealth of one who is heedless, he is a refuge to one who is afraid, and when needs arise, he provides assistance doubly. In these four ways, householder's son, a helpful friend, a true friend, should be recognized.\"",
      "sinhala": "ගෘහපති පුත්‍රය, කරුණු සතරකින් උපකාරී මිත්‍රයා හිතවතෙකු ලෙස දත යුතු වේ. ප්‍රමාද වූවන් ආරක්ෂා කරයි, ප්‍රමාද වූවන්ගේ සම්පත් ආරක්ෂා කරයි, බිය වූවන්ට පිහිට වේ, ඇති වූ කටයුතු වලදී දෙගුණයක් ධනය සපයයි. ගෘහපති පුත්‍රය, මේ කරුණු සතරෙන් උපකාරී මිත්‍රයා හිතවතෙකු ලෙස දත යුතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 262,
      "pali": "‘‘Catūhi kho, gahapatiputta, ṭhānehi samānasukhadukkho mitto suhado veditabbo. Guyhamassa ācikkhati, guyhamassa parigūhati, āpadāsu na vijahati, jīvitaṃpissa atthāya pariccattaṃ hoti. Imehi kho, gahapatiputta, catūhi ṭhānehi samānasukhadukkho mitto suhado veditabbo.",
      "english": "\"In four ways, householder's son, a friend who shares your joys and sorrows, a true-hearted friend, is to be recognized. He reveals his secrets to him, he keeps his secrets, he does not forsake him in adversity, and his life is given up for his benefit. In these four ways, householder's son, a friend who shares your joys and sorrows, a true-hearted friend, is to be recognized.\"",
      "sinhala": "ගෘහපති පුත්‍රය, කරුණු සතරකින් හිතවතෙකු සුවදුක්ඛ සමව බෙදාගන්නා මිතුරෙකු ලෙස හඳුනාගත යුතුය. ඔහුගේ රහස් හෙළි කරයි, ඔහුගේ රහස් ආරක්ෂා කරයි, විපත්තිවලදී අත් නොහරී, ඔහුගේ ජීවිතය පවා ඔහු වෙනුවෙන් පරිත්‍යාග කිරීමට සූදානම් වේ. ගෘහපති පුත්‍රය, මෙම කරුණු සතරෙන් සුවදුක්ඛ සමව බෙදාගන්නා මිතුරෙකු හඳුනාගත යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 263,
      "pali": "‘‘Catūhi kho, gahapatiputta, ṭhānehi atthakkhāyī mitto suhado veditabbo. Pāpā nivāreti, kalyāṇe niveseti, assutaṃ sāveti, saggassa maggaṃ ācikkhati. Imehi kho, gahapatiputta, catūhi ṭhānehi atthakkhāyī mitto suhado veditabbo.",
      "english": "\"In four ways, householder, a friend who reveals what is beneficial should be known as a true-hearted friend. He restrains you from evil, he encourages you in good, he makes you hear what you have not heard, he points out the path to heaven. In these four ways, householder, a friend who reveals what is beneficial should be known as a true-hearted friend.\"",
      "sinhala": "‘‘ගෘහපති පුත්‍රය, කරුණු හතරකින් අර්ථ දක්වන මිත්‍රයා හිතවතෙකු ලෙස දත යුතුයි. ඔහු පවින් වළක්වයි, යහපතෙහි පිහිටුවයි, අසන නොලද දේ අසන්නට සලස්වයි, ස්වර්ගයට යන මාර්ගය පෙන්වයි. ගෘහපති පුත්‍රය, මේ කරුණු හතරෙන් අර්ථ දක්වන මිත්‍රයා හිතවතෙකු ලෙස දත යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 264,
      "pali": "‘‘Catūhi kho, gahapatiputta, ṭhānehi anukampako mitto suhado veditabbo. Abhavenassa na nandati, bhavenassa nandati, avaṇṇaṃ bhaṇamānaṃ nivāreti, vaṇṇaṃ bhaṇamānaṃ pasaṃsati. Imehi kho, gahapatiputta, catūhi ṭhānehi anukampako mitto suhado veditabbo’’ti.",
      "english": "\"In four ways, householder, a sympathetic friend, a good-hearted friend, is to be recognized. He does not rejoice in what is disadvantageous, he rejoices in what is advantageous, he restrains one who speaks dispraise, he praises one who speaks praise. In these four ways, householder, a sympathetic friend, a good-hearted friend, is to be recognized.\"",
      "sinhala": "“ගෘහපතිය, කරුණු සතරකින් අනුකම්පා කරන්නාවූ මිත්‍රයා හිතවතා වශයෙන් දත යුතුයි. පිරිහීමට හේතුවන දෙයෙහි නොසතුටු වෙයි, වර්ධනයට හේතුවන දෙයෙහි සතුටු වෙයි, අවගුණ කියන්නාවූ අය වළක්වයි, ගුණ කියන්නාවූ අය වර්ණනා කරයි. ගෘහපතිය, මේ කරුණු සතරෙන් අනුකම්පා කරන්නාවූ මිත්‍රයා හිතවතා වශයෙන් දත යුතුයි.”",
      "paliTitle": ""
    },
    {
      "number": 265,
      "pali": "Idamavoca bhagavā, idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Upakāro ca yo mitto, sukhe dukkhe [sukhadukkho (syā. ka.)] ca yo sakhā [yo ca mitto sukhe dukkhe (sī. pī.)]; Atthakkhāyī ca yo mitto, yo ca mittānukampako. ‘‘Etepi mitte cattāro, iti viññāya paṇḍito; Sakkaccaṃ payirupāseyya, mātā puttaṃ va orasaṃ; Paṇḍito sīlasampanno, jalaṃ aggīva bhāsati. ‘‘Bhoge saṃharamānassa, bhamarasseva irīyato; Bhogā sannicayaṃ yanti, vammikovupacīyati. ‘‘Evaṃ bhoge samāhatvā [samāharitvā (syā.)], alamatto kule gihī; Catudhā vibhaje bhoge, sa ve mittāni ganthati. ‘‘Ekena bhoge bhuñjeyya, dvīhi kammaṃ payojaye; Catutthañca nidhāpeyya, āpadāsu bhavissatī’’ti. ",
      "english": "Thus spoke the Blessed One. Having said this, the Fortunate One, the Teacher, then said further: \"The friend who is a help, the companion in happiness and sorrow, the friend who points out what is beneficial, and the friend who is sympathetic.\n\n\"These four kinds of friends, having understood this, the wise person should attend to them carefully, as a mother to her only child; the wise person, accomplished in virtue, shines like a fire.\n\n\"For one who is accumulating wealth, exerting himself like a bee, wealth goes to accumulation, like an anthill that is built up.\n\n\"Having thus accumulated wealth, a householder of sufficient means in his family, should divide his wealth into four parts; he truly binds friends to himself.\n\n\"With one part he should enjoy his wealth, with two parts he should apply himself to his work; and the fourth he should set aside as a reserve for times of adversity.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගතයන් වහන්සේ මෙය වදාරා අනතුරුව ශාස්තෘන් වහන්සේ මෙසේ වදාළ සේක. \"යම් මිත්‍රයෙක් උපකාරී වේ ද, යම් ස‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍‍ඛයෙක් සැපෙ‍හි දුකෙහි (සමානව සිටී ද), යම් මිත්‍රයෙක් අර්ථය දක්වයි ද, යමෙක් මිත්‍රයන් කෙරෙහි අනුකම්පා කරයි ද,\n\nපණ්ඩිතයා විසින් 'මේ මිතුරෝ සතර දෙනෙකි' යි මෙසේ දැන මවක් තමන්ගේ එකම පුත්‍රයෙකු මෙන් ඔවුන් සක්කාර කොට උපස්ථාන කළ යුතු ය. පණ්ඩිතයා සිල්වත් ව ගින්න මෙන් බබළයි.\n\nභෝග සම්පත් රැස් කරන්නා වූ, බඹරෙකු මෙන් හැසිරෙන්නා වූ පුද්ගලයාගේ භෝග සම්පත් සමුච්චය වේ. වේයන් ගොඩක් මෙන් වැඩි වැඩියෙන් එක් රැස් වේ.\n\nමෙසේ භෝග සම්පත් රැස් කර, කුලයේ ගිහියා ප්‍රමාණවත් ව සිට භෝග සම්පත් සතර ආකාරයකට බෙදිය යුතු ය. ඒ ඔහු මිත්‍රයන් ඇති කර ගනී.\n\nඑක කොටසකින් භුක්ති විඳිය යුතු ය. කොටස් දෙකකින් කර්මාන්තයෙහි යෙදිය යුතු ය. සතරවෙනි කොටස විපත්තිවල දී ප්‍රයෝජනයට ගැනීම පිණිස තැන්පත් කළ යුතු ය.\"",
      "paliTitle": ""
    },
    {
      "number": 266,
      "pali": "‘‘Kathañca, gahapatiputta, ariyasāvako chaddisāpaṭicchādī hoti? Cha imā, gahapatiputta, disā veditabbā. Puratthimā disā mātāpitaro veditabbā, dakkhiṇā disā ācariyā veditabbā, pacchimā disā puttadārā veditabbā, uttarā disā mittāmaccā veditabbā, heṭṭhimā disā dāsakammakarā veditabbā, uparimā disā samaṇabrāhmaṇā veditabbā.",
      "english": "\"And how, householder's son, does a noble disciple cover the six directions? These six directions, householder's son, are to be understood. The eastern direction is to be understood as parents, the southern direction is to be understood as teachers, the western direction is to be understood as wife and children, the northern direction is to be understood as friends and colleagues, the lower direction is to be understood as servants and employees, the upper direction is to be understood as ascetics and brahmins.\"",
      "sinhala": "‘‘ගෘහපති පුත්‍රය, ආර්‍ය්‍ය ශ්‍රාවකයා කෙසේ නම් දිශාවන් සයට වැස්මක් වන්නේ ද? ගෘහපති පුත්‍රය, මේ දිශාවන් සය දැනගත යුතුයි. නැගෙනහිර දිශාව මව්පියන් වශයෙන් දැනගත යුතුයි. දකුණු දිශාව ආචාර්යවරුන් වශයෙන් දැනගත යුතුයි. බටහිර දිශාව පුත්‍ර භාර්යාවන් වශයෙන් දැනගත යුතුයි. උතුරු දිශාව මිත්‍රයන් හා ඥාතීන් වශයෙන් දැනගත යුතුයි. යට දිශාව දාසයන් හා කම්කරුවන් වශයෙන් දැනගත යුතුයි. උඩ දිශාව ශ්‍රමණ බ්‍රාහ්මණයන් වශයෙන් දැනගත යුතුයි.",
      "paliTitle": "Chaddisāpaṭicchādanakaṇḍaṃ",
      "englishTitle": "The Six-Direction Protection",
      "sinhalaTitle": "සය දිශා රැකවරණය"
    },
    {
      "number": 267,
      "pali": "‘‘Pañcahi kho, gahapatiputta, ṭhānehi puttena puratthimā disā mātāpitaro paccupaṭṭhātabbā – bhato ne [nesaṃ (bahūsu)] bharissāmi, kiccaṃ nesaṃ karissāmi, kulavaṃsaṃ ṭhapessāmi, dāyajjaṃ paṭipajjāmi, atha vā pana petānaṃ kālaṅkatānaṃ dakkhiṇaṃ anuppadassāmīti. Imehi kho, gahapatiputta, pañcahi ṭhānehi puttena puratthimā disā mātāpitaro paccupaṭṭhitā pañcahi ṭhānehi puttaṃ anukampanti. Pāpā nivārenti, kalyāṇe nivesenti, sippaṃ sikkhāpenti, patirūpena dārena saṃyojenti, samaye dāyajjaṃ niyyādenti [niyyātenti (ka. sī.)]. Imehi kho, gahapatiputta, pañcahi ṭhānehi puttena puratthimā disā mātāpitaro paccupaṭṭhitā imehi pañcahi ṭhānehi puttaṃ anukampanti. Evamassa esā puratthimā disā paṭicchannā hoti khemā appaṭibhayā.",
      "english": "\"In five ways, householder, a son should attend to his parents as the eastern direction: 'Having supported me, I will support them; I will do their duties; I will maintain the family lineage; I will be worthy of my inheritance; furthermore, I will offer alms on behalf of departed relatives.' In these five ways, householder, when parents are attended to by their son as the eastern direction, they show compassion to their son in five ways. They restrain him from evil, encourage him in good, teach him a skill, unite him with a suitable partner, and hand over the inheritance to him in due time. In these five ways, householder, when parents are attended to by their son as the eastern direction, they show compassion to their son in these five ways. Thus, this eastern direction is protected, secure, and free from fear.\"",
      "sinhala": "‘‘ගෘහපතිය පුත්‍රය, පුත්‍රයා විසින් කරුණු පහකින් පෙරදිග දිශාව වන මවුපියන් උපස්ථාන කළ යුතුයි. එනම්: මම ඔවුන් පෝෂණය කරන්නෙමි, ඔවුන්ගේ කටයුතු කරන්නෙමි, කුල පරම්පරාව පවත්වාගෙන යන්නෙමි, උරුමය ලබන්නෙමි, නැතහොත් මියගිය පසු ඔවුන් වෙනුවෙන් දක්ෂිණාවන් දෙන්නෙමියි යන කරුණු වලින් මවුපියන් උපස්ථාන කළ යුතුයි. ගෘහපතිය පුත්‍රය, මෙසේ කරුණු පහකින් පුත්‍රයා විසින් උපස්ථාන කරනු ලබන පෙරදිග දිශාව වන මවුපියෝ කරුණු පහකින් පුත්‍රයාට අනුකම්පා කරති. පාපයෙන් වළක්වති, යහපතෙහි පිහිටුවති, ශිල්ප උගන්වති, සුදුසු භාර්යාවක හා සම්බන්ධ කරති, නියම වෙලාවට උරුමය ලබා දෙති. ගෘහපතිය පුත්‍රය, මෙලෙස කරුණු පහකින් පුත්‍රයා විසින් උපස්ථාන කරනු ලැබූ පෙරදිග දිශාව වන මවුපියෝ, මේ කරුණු පහෙන් පුත්‍රයාට අනුකම්පා කරති. මෙසේ ඔහුට ඒ පෙරදිග දිශාව ආරක්ෂා සහිත වේ, ක්ෂේම භූමියක් වේ, කිසිම බියක් නැති තැනක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 268,
      "pali": "‘‘Pañcahi kho, gahapatiputta, ṭhānehi antevāsinā dakkhiṇā disā ācariyā paccupaṭṭhātabbā – uṭṭhānena upaṭṭhānena sussusāya pāricariyāya sakkaccaṃ sippapaṭiggahaṇena [sippaṃ paṭiggahaṇena (syā.), sippauggahaṇena (ka.)]. Imehi kho, gahapatiputta, pañcahi ṭhānehi antevāsinā dakkhiṇā disā ācariyā paccupaṭṭhitā pañcahi ṭhānehi antevāsiṃ anukampanti – suvinītaṃ vinenti, suggahitaṃ gāhāpenti, sabbasippassutaṃ samakkhāyino bhavanti, mittāmaccesu paṭiyādenti [paṭivedenti (syā.)], disāsu parittāṇaṃ karonti. Imehi kho, gahapatiputta, pañcahi ṭhānehi antevāsinā dakkhiṇā disā ācariyā paccupaṭṭhitā imehi pañcahi ṭhānehi antevāsiṃ anukampanti. Evamassa esā dakkhiṇā disā paṭicchannā hoti khemā appaṭibhayā.",
      "english": "\"In five ways, young householder, a student should attend to teachers as the southern direction: by rising, by attending, by obedience, by service, and by respectfully receiving instruction. In these five ways, young householder, when a student attends to teachers as the southern direction, the teachers, being attended to by the student in these five ways, show compassion to the student in five ways: they train him in what is well-trained, they cause him to grasp what is well-grasped, they fully impart all their knowledge, they commend him among their friends and companions, and they provide for his safety in every direction. In these five ways, young householder, a student should attend to teachers as the southern direction, and in these five ways, the teachers show compassion to the student. Thus, this southern direction is protected, secure, and free from fear.\"",
      "sinhala": "‘‘ගෘහපති පුත්‍රය, සිසුන් විසින් කරුණු පහකින් දකුණු දිශාව වන ආචාර්යවරුන් උපස්ථාන කළ යුතුයි. එනම්, නැගිටීමෙන්, උපස්ථාන කිරීමෙන්, ඇහුම්කන් දීමෙන්, පරිචර්යාවෙන් හා සැලකිල්ලෙන් ශිල්ප පිළිගැනීමෙනි. ගෘහපති පුත්‍රය, මෙකී කරුණු පහෙන් සිසුන් විසින් දකුණු දිශාව වන ආචාර්යවරුන් උපස්ථාන කළ විට, ආචාර්යවරුන් කරුණු පහකින් සිසුන්ට අනුකම්පා කරති. මනා ලෙස හික්මවති, හොඳින් ග්‍රහණය කරවති, සියලු ශිල්පයන් පිළිබඳ දැනුමක් ඇති අය බවට පත් කරති, මිතුරන් හා හිතවතුන් අතරෙහි ගෞරව කරති, දිශාවන්හි ආරක්ෂාව සලසති. ගෘහපති පුත්‍රය, මෙකී කරුණු පහෙන් සිසුන් විසින් දකුණු දිශාව වන ආචාර්යවරුන් උපස්ථාන කළ විට, ආචාර්යවරුන් මේ කරුණු පහෙන් සිසුන්ට අනුකම්පා කරති. මේ අයුරින් ඔහුට ඒ දකුණු දිශාව ආරක්ෂා සහිත, සුරක්ෂිත හා භය රහිත වේ.",
      "paliTitle": ""
    },
    {
      "number": 269,
      "pali": "‘‘Pañcahi kho, gahapatiputta, ṭhānehi sāmikena pacchimā disā bhariyā paccupaṭṭhātabbā – sammānanāya anavamānanāya [avimānanāya (syā. pī.)] anaticariyāya issariyavossaggena alaṅkārānuppadānena. Imehi kho, gahapatiputta, pañcahi ṭhānehi sāmikena pacchimā disā bhariyā paccupaṭṭhitā pañcahi ṭhānehi sāmikaṃ anukampati – susaṃvihitakammantā ca hoti, saṅgahitaparijanā [susaṅgahitaparijanā (sī. syā. pī.)] ca, anaticārinī ca, sambhatañca anurakkhati, dakkhā ca hoti analasā sabbakiccesu. Imehi kho, gahapatiputta, pañcahi ṭhānehi sāmikena pacchimā disā bhariyā paccupaṭṭhitā imehi pañcahi ṭhānehi sāmikaṃ anukampati. Evamassa esā pacchimā disā paṭicchannā hoti khemā appaṭibhayā.",
      "english": "\"In five ways, householder, a husband should attend to the western direction, which is his wife: by honoring her, by not disparaging her, by not being unfaithful to her, by granting her authority, and by providing adornments. In these five ways, householder, the western direction, the wife, being attended to by her husband, shows compassion to her husband in five ways: she is well-organized in her activities, she is kind to the household staff, she is not unfaithful, she protects what is brought in, and she is skillful and tireless in all her duties. In these five ways, householder, the western direction, the wife, being attended to by her husband, shows compassion to her husband in these five ways. Thus, this western direction is protected, secure, and free from fear.\"",
      "sinhala": "ගෘහපති පුත්‍රය, ස්වාමිපුරුෂයා විසින් කරුණු පහකින් භාර්යාව වූ බටහිර දිශාව උපස්ථාන කළ යුතුය. එනම්: සම්මානයෙන්, අවමානය නොකිරීමෙන්, අනාචාරයේ නොහැසිරීමෙන්, ඊශ්වරත්වය පැවරීමෙන් හා සැරසිලි පිළිගැන්වීමෙනි.\n\nගෘහපති පුත්‍රය, ස්වාමිපුරුෂයා විසින් මෙකී කරුණු පහෙන් භාර්යාව වූ බටහිර දිශාව උපස්ථාන කළ කල්හි භාර්යාව ද කරුණු පහකින් ස්වාමිපුරුෂයාට අනුකම්පා කරයි. එනම්: කටයුතු මනාව සංවිධානය කිරීමෙන්, යහපත් පරිවාර ජනයා ඇති කර ගැනීමෙන්, අනාචාරයේ නොහැසිරීමෙන්, රැස් කළ ධනය ආරක්ෂා කිරීමෙන්, සියලු කටයුතුවලදී දක්ෂ හා කම්මැලි නොවී කටයුතු කිරීමෙනි.\n\nගෘහපති පුත්‍රය, ස්වාමිපුරුෂයා විසින් මෙකී කරුණු පහෙන් භාර්යාව වූ බටහිර දිශාව උපස්ථාන කළ කල්හි භාර්යාව මෙකී කරුණු පහෙන් ස්වාමිපුරුෂයාට අනුකම්පා කරයි. මෙසේ ඒ බටහිර දිශාව ආරක්ෂා සහිත, ක්ෂේමදායක, භය රහිත වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 270,
      "pali": "‘‘Pañcahi kho, gahapatiputta, ṭhānehi kulaputtena uttarā disā mittāmaccā paccupaṭṭhātabbā – dānena peyyavajjena [viyavajjena (syā. ka.)] atthacariyāya samānattatāya avisaṃvādanatāya. Imehi kho, gahapatiputta, pañcahi ṭhānehi kulaputtena uttarā disā mittāmaccā paccupaṭṭhitā pañcahi ṭhānehi kulaputtaṃ anukampanti – pamattaṃ rakkhanti, pamattassa sāpateyyaṃ rakkhanti, bhītassa saraṇaṃ honti, āpadāsu na vijahanti, aparapajā cassa paṭipūjenti. Imehi kho, gahapatiputta, pañcahi ṭhānehi kulaputtena uttarā disā mittāmaccā paccupaṭṭhitā imehi pañcahi ṭhānehi kulaputtaṃ anukampanti. Evamassa esā uttarā disā paṭicchannā hoti khemā appaṭibhayā.",
      "english": "\"In five ways, householder, a clansman should attend to the north direction, that is, friends and companions: by giving, by kind speech, by beneficial help, by treating them as equals, and by not deceiving them. In these five ways, householder, when the north direction, that is, friends and companions, is attended to by a clansman, they show their compassion towards him in five ways: they protect him when he is negligent, they protect his property when he is negligent, they are a refuge for him when he is afraid, they do not abandon him in adversity, and his lineage is respected by others. In these five ways, householder, when the north direction, that is, friends and companions, is attended to by a clansman, they show their compassion towards him in these five ways. Thus, this north direction is protected, secure, and free from fear for him.\"",
      "sinhala": "‘‘ගෘහපතියේ පුත්‍රය, කුලපුත්‍රයා විසින් කරුණු පහකින් උතුරු දිශාව වන මිත්‍රයන් හා ඇමතියන් උපස්ථාන කළ යුතුයි. එනම් දීමෙන්, ප්‍රිය වචන කථා කිරීමෙන්, අර්ථවත් චර්යාවෙන්, සමාන ආත්ම භාවයෙන් හා අවිසංවාදනයෙනි. ගෘහපතියේ පුත්‍රය, කුලපුත්‍රයා විසින් මේ කරුණු පහෙන් උතුරු දිශාව වන මිත්‍රයන් හා ඇමතියන් උපස්ථාන කළ විට, ඔවුහු කරුණු පහකින් කුලපුත්‍රයාට අනුකම්පා කරති. එනම්, ප්‍රමාද වූ විට ආරක්ෂා කරති, ප්‍රමාද වූ අයගේ දේපළ ආරක්ෂා කරති, බියට පත් වූ විට සරණ වෙති, ආපදාවලදී අත් නොහරිති, ඔහුගේ මරණින් මතු පවා ඔහුට උපස්ථාන කරති. ගෘහපතියේ පුත්‍රය, කුලපුත්‍රයා විසින් මේ කරුණු පහෙන් උතුරු දිශාව වන මිත්‍රයන් හා ඇමතියන් උපස්ථාන කළ විට, ඔවුහු මේ කරුණු පහෙන් කුලපුත්‍රයාට අනුකම්පා කරති. මෙසේ ඔහුට ඒ උතුරු දිශාව ආරක්ෂා වූ, සැපවත් වූ, භය රහිත වූ තැනක් වෙයි.’’",
      "paliTitle": ""
    },
    {
      "number": 271,
      "pali": "‘‘Pañcahi kho, gahapatiputta, ṭhānehi ayyirakena [ayirakena (sī. syā. pī.)] heṭṭhimā disā dāsakammakarā paccupaṭṭhātabbā – yathābalaṃ kammantasaṃvidhānena bhattavetanānuppadānena gilānupaṭṭhānena acchariyānaṃ rasānaṃ saṃvibhāgena samaye vossaggena. Imehi kho, gahapatiputta, pañcahi ṭhānehi ayyirakena heṭṭhimā disā dāsakammakarā paccupaṭṭhitā pañcahi ṭhānehi ayyirakaṃ anukampanti – pubbuṭṭhāyino ca honti, pacchā nipātino ca, dinnādāyino ca, sukatakammakarā ca, kittivaṇṇaharā ca. Imehi kho, gahapatiputta, pañcahi ṭhānehi ayyirakena heṭṭhimā disā dāsakammakarā paccupaṭṭhitā imehi pañcahi ṭhānehi ayyirakaṃ anukampanti. Evamassa esā heṭṭhimā disā paṭicchannā hoti khemā appaṭibhayā.",
      "english": "\"In five ways, householder, the lower direction, namely, servants and employees, should be attended to by their master: by assigning work according to ability, by providing food and wages, by attending to them in sickness, by sharing delicacies with them, and by granting leave at times. In these five ways, householder, when the lower direction, namely, servants and employees, are attended to by their master, they show compassion to their master in five ways: they rise before him, retire after him, take only what is given, perform their work well, and spread his good name and fame. In these five ways, householder, when the lower direction, namely, servants and employees, are attended to by their master, they show compassion to their master in these five ways. Thus, this lower direction is protected, secure, and free from fear.\"",
      "sinhala": "“ගෘහපතියෙනි, පහත දිශාව වන දාස කම්කරුවන් ස්වාමිපුරුෂයා විසින් කරුණු පහකින් සංග්‍රහ කළ යුතුය. එනම්, ශක්තියට සරිලන සේ වැඩෙහි යෙදවීමෙන්ද, ආහාර හා වැටුප් නිසි ලෙස සැපයීමෙන්ද, රෝගී වූ විට උපස්ථාන කිරීමෙන්ද, අගනා දෙය බෙදා හදා ගැනීමෙන්ද, නියමිත වේලාවට නිවාඩු දීමෙන්ද සංග්‍රහ කළ යුතුය.\n\nගෘහපතියෙනි, මෙකී කරුණු පහෙන් පහත දිශාව වන දාස කම්කරුවන් ස්වාමිපුරුෂයා විසින් සංග්‍රහ කරනු ලැබූ විට ඔවුහු කරුණු පහකින් ස්වාමිපුරුෂයාට අනුකම්පා කරති. එනම්, පළමුව නැගිටින්නෝ වෙති, අගට නිදන්නෝ වෙති, දුන් දෙය ගන්නෝ වෙති, මනා කොට වැඩ කරන්නෝ වෙති, ස්වාමියාගේ ගුණ වර්ණනා කරන්නෝ වෙති.\n\nගෘහපතියෙනි, මෙකී කරුණු පහෙන් පහත දිශාව වන දාස කම්කරුවන් ස්වාමිපුරුෂයා විසින් සංග්‍රහ කරනු ලැබූ විට, ඔවුහු මෙකී කරුණු පහෙන් ස්වාමිපුරුෂයාට අනුකම්පා කරති. මෙසේ ඔහුගේ ඒ පහත දිශාව ආරක්ෂා සහිත වේ, සුවසේ පවතී, බිය රහිත වේ.”",
      "paliTitle": ""
    },
    {
      "number": 272,
      "pali": "‘‘Pañcahi kho, gahapatiputta, ṭhānehi kulaputtena uparimā disā samaṇabrāhmaṇā paccupaṭṭhātabbā – mettena kāyakammena mettena vacīkammena mettena manokammena anāvaṭadvāratāya āmisānuppadānena. Imehi kho, gahapatiputta, pañcahi ṭhānehi kulaputtena uparimā disā samaṇabrāhmaṇā paccupaṭṭhitā chahi ṭhānehi kulaputtaṃ anukampanti – pāpā nivārenti, kalyāṇe nivesenti, kalyāṇena manasā anukampanti, assutaṃ sāventi, sutaṃ pariyodāpenti, saggassa maggaṃ ācikkhanti. Imehi kho, gahapatiputta, pañcahi ṭhānehi kulaputtena uparimā disā samaṇabrāhmaṇā paccupaṭṭhitā imehi chahi ṭhānehi kulaputtaṃ anukampanti. Evamassa esā uparimā disā paṭicchannā hoti khemā appaṭibhayā’’ti.",
      "english": "\"In five ways, householder's son, a clansman should attend to the ascetics and brahmins as the upper direction: with loving physical action, with loving verbal action, with loving mental action, with open door, and by supplying them with material things. In these five ways, householder's son, the ascetics and brahmins, attended to by a clansman as the upper direction, show compassion to the clansman in six ways: they restrain him from evil, they encourage him in good, they cherish him with a kind heart, they make him hear what he has not heard, they clarify what he has heard, and they point out the path to heaven. In these five ways, householder's son, the ascetics and brahmins, attended to by a clansman as the upper direction, show compassion to the clansman in these six ways. Thus, this upper direction is protected, secure, and free from fear.\"",
      "sinhala": "‘‘ගෘහපති පුත්‍රය, කුලපුත්‍රයා විසින් කරුණු පහකින් උත්තර දිශාව වන ශ්‍රමණ බ්‍රාහ්මණයන් සත්කාර කළ යුතුය. එනම් මෛත්‍රී සහගත කායික කර්මයෙන්ද, මෛත්‍රී සහගත වාචසික කර්මයෙන්ද, මෛත්‍රී සහගත මානසික කර්මයෙන්ද, පිළිගැනීමට විවෘත දොර ඇති බවෙන්ද, ආහාර පානාදී අාමිස දානය සැපයීමෙන්ද වේ. ගෘහපති පුත්‍රය, කුලපුත්‍රයා විසින් කරුණු පහකින් උත්තර දිශාව වන ශ්‍රමණ බ්‍රාහ්මණයන් සත්කාර කරනු ලැබූ විට, ඔවුහු කරුණු හයකින් කුලපුත්‍රයාට අනුකම්පා කරති. එනම්, පවින් වළක්වති, යහපතෙහි පිහිටුවති, යහපත් සිතින් අනුකම්පා කරති, නො ඇසූ දේ අසන්නට සලස්වති, ඇසූ දේ පිරිසිදු කරති, ස්වර්ගයට යන මාර්ගය දක්වති. ගෘහපති පුත්‍රය, කුලපුත්‍රයා විසින් කරුණු පහකින් උත්තර දිශාව වන ශ්‍රමණ බ්‍රාහ්මණයන් සත්කාර කරනු ලැබූ විට, ඔවුහු මේ කරුණු හය නිසා කුලපුත්‍රයාට අනුකම්පා කරති. මෙසේ ඔහුගේ ඒ උත්තර දිශාව ආරක්ෂා සහිත වන්නේය, භය රහිත වන්නේය.’’",
      "paliTitle": ""
    },
    {
      "number": 273,
      "pali": "Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Mātāpitā disā pubbā, ācariyā dakkhiṇā disā; Puttadārā disā pacchā, mittāmaccā ca uttarā. ‘‘Dāsakammakarā heṭṭhā, uddhaṃ samaṇabrāhmaṇā; Etā disā namasseyya, alamatto kule gihī. ‘‘Paṇḍito sīlasampanno, saṇho ca paṭibhānavā; Nivātavutti atthaddho, tādiso labhate yasaṃ. ‘‘Uṭṭhānako analaso, āpadāsu na vedhati; Acchinnavutti medhāvī, tādiso labhate yasaṃ. ‘‘Saṅgāhako mittakaro, vadaññū vītamaccharo; Netā vinetā anunetā, tādiso labhate yasaṃ. ‘‘Dānañca peyyavajjañca, atthacariyā ca yā idha; Samānattatā ca dhammesu, tattha tattha yathārahaṃ; Ete kho saṅgahā loke, rathassāṇīva yāyato. ‘‘Ete ca saṅgahā nāssu, na mātā puttakāraṇā; Labhetha mānaṃ pūjaṃ vā, pitā vā puttakāraṇā. ‘‘Yasmā ca saṅgahā [saṅgahe (ka.) aṭṭhakathāyaṃ icchitapāṭho] ete, sammapekkhanti [samavekkhanti (sī. pī. ka.)] paṇḍitā; Tasmā mahattaṃ papponti, pāsaṃsā ca bhavanti te’’ti.",
      "english": "Thus spoke the Blessed One. Having said this, the Fortunate One, the Teacher, then said further: \"Mother and father are the eastern direction, teachers are the southern direction; children and spouse are the western direction, friends and colleagues are the northern direction.\n\n\"Servants and employees are the direction below, ascetics and Brahmins are the direction above; these directions should be venerated by a clansman living at home, being competent.\n\n\"The wise person, accomplished in virtue, gentle, and eloquent; with humble conduct, not obstinate, such a one obtains glory.\n\n\"Energetic and unlazy, not trembling in misfortunes; with blameless conduct, intelligent, such a one obtains glory.\n\n\"One who is hospitable, making friends, generous, free from stinginess; a leader, a trainer, and a follower, such a one obtains glory.\n\n\"Giving, kind speech, beneficial conduct, and impartiality in accordance with the occasion, in the various circumstances; these are the bonds of sympathy in the world, like the linchpin of a chariot.\n\n\"If these bonds of sympathy did not exist, a mother would not receive honor or respect because of her child, nor a father because of his child.\n\n\"Since these bonds of sympathy are well considered by the wise; therefore, they attain greatness, and they become praiseworthy.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගතයන් වහන්සේ මෙය වදාරා, ශාස්තෘන් වහන්සේ තවදුරටත් මෙසේ වදාළ සේක: \"මව්පියෝ පෙරදිග වෙති, ආචාර්යවරු දකුණු දිග වෙති; පුත්‍ර භාර්යාවෝ පසු දිග වෙති, මිත්‍රයන් හා නෑයන් උතුරු දිග වෙති. \"දාස කම්කරුවෝ යට දිග වෙති, ශ්‍රමණ බ්‍රාහ්මණයෝ උඩ දිග වෙති; ගෘහස්ථ කුලයෙහි හිතැත්තෙක් මේ දිශාවන්ට නමස්කාර කළ යුතුය. \"පණ්ඩිත වූ, සිල්වත් වූ, මෘදු වූ, ප්‍රතිභානවන්ත වූ, යටහත් පැවතුම් ඇති, අඩම්බර නැති, එබඳු තැනැත්තා යසස ලබයි. \"උත්සාහවත් වූ, කම්මැලි නැති වූ, ආපදාවන්හි නො සැලෙන වූ, නො සිඳුණු වෘත්තියක් ඇති, නුවණැති, එබඳු තැනැත්තා යසස ලබයි. \"සංග්‍රහ කරන්නා වූ, මිතුරන් ඇති කරන්නා වූ, පරිත්‍යාගශීලී වූ, මසුරු නැති වූ, නායකත්වය දෙන, හික්මවන, අනුග්‍රහ කරන, එබඳු තැනැත්තා යසස ලබයි. \"යම් දානයක් වේ ද, ප්‍රිය වචනයක් වේ ද, යම් අර්ථචර්යාවක් මෙහි වේ ද, ඒ ඒ ධර්මයන්හි යථා පරිදි සමාන වීමක් වේ ද, මේ සංග්‍රහ ලෝකයෙහි රථයකට අක්ෂයක් මෙන් වෙයි. \"මේ සංග්‍රහ නැති වූයේ නම්, මව පුත්‍රයා නිසා හෝ පියා පුත්‍රයා නිසා හෝ සැලකිල්ලක් හෝ පූජාවක් හෝ නො ලබන්නීය. \"යම් හෙයකින් මේ සංග්‍රහයන් නුවණැත්තෝ මැනවින් සලකත් ද, ඒ හේතුවෙන් ඔවුහු මහත් බවට පැමිණෙත්, ප්‍රශංසාවට ද පැමිණෙත්\" \".",
      "paliTitle": ""
    },
    {
      "number": 274,
      "pali": "Evaṃ vutte, siṅgālako gahapatiputto bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante! Abhikkantaṃ, bhante! Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti. Evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṃghañca. Upāsakaṃ maṃ bhagavā dhāretu, ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. ",
      "english": "When this was said, Siṅgālaka, the householder’s son, said this to the Blessed One: \"Excellent, venerable sir! Excellent, venerable sir! Just as, venerable sir, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who is lost, or hold up a lamp in the dark, so that those with eyes might see forms, even so has the Dhamma been set forth in many ways by the Blessed One. I go to the Blessed One for refuge, and to the Dhamma, and to the Saṅgha of bhikkhus. May the Blessed One accept me as a lay follower, one who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ කල්හි, සිඟාලක නම් ගෘහපති පුත්‍රයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය. “ස්වාමීනි, ඉතා විශිෂ්ටයි! ස්වාමීනි, ඉතා විශිෂ්ටයි! ස්වාමීනි, යම් සේ යටිකුරු කරන ලද්දක් උඩුකුරු කරන්නේ ද, වසා තබන ලද්දක් විවෘත කරන්නේ ද, මං මුළා වූවකුට මාර්ගය කියන්නේ ද, ‘ඇස් ඇත්තෝ රූප දකිත්’ යනුවෙන් අඳුරෙහි තෙල් පහනක් දරන්නේ ද, එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ විසින් බොහෝ ආකාරවලින් ධර්මය ප්‍රකාශ කරන ලදී. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේව ද ධර්මය ද භික්ෂු සංඝයා ද සරණ යමි. භාග්‍යවතුන් වහන්ස, අද පටන් දිවි ඇති තුරු සරණ ගිය උපාසකයෙකු වශයෙන් මා දරණ මැනව”යි කීවේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Siṅgālasuttaṃ [siṅgālovādasuttantaṃ (pī.)] niṭṭhitaṃ aṭṭhamaṃ.",
    "english": "The Eighth Sigala Sutta Concluded",
    "sinhala": "අටවෙනි සිඟාල සූත්‍U+200Dරය නිමයි"
  }
}