{
  "id": "sn.1.8",
  "title": {
    "pali": "Vaṅgīsasaṃyuttaṃ",
    "english": "The Connected Discourses with Vaṅgīsa",
    "sinhala": "වංගීස සංයුත්තය"
  },
  "sections": [
    {
      "number": 209,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā vaṅgīso āḷaviyaṃ viharati aggāḷave cetiye āyasmatā nigrodhakappena upajjhāyena saddhiṃ. Tena kho pana samayena āyasmā vaṅgīso navako hoti acirapabbajito ohiyyako vihārapālo. Atha kho sambahulā itthiyo samalaṅkaritvā yena aggāḷavako ārāmo tenupasaṅkamiṃsu vihārapekkhikāyo. Atha kho āyasmato vaṅgīsassa tā itthiyo disvā anabhirati uppajjati, rāgo cittaṃ anuddhaṃseti. Atha kho āyasmato vaṅgīsassa etadahosi – ‘‘alābhā vata me, na vata me lābhā; dulladdhaṃ vata me, na vata me suladdhaṃ; yassa me anabhirati uppannā, rāgo cittaṃ anuddhaṃseti, taṃ kutettha labbhā, yaṃ me paro anabhiratiṃ vinodetvā abhiratiṃ uppādeyya. Yaṃnūnāhaṃ attanāva attano anabhiratiṃ vinodetvā abhiratiṃ uppādeyya’’nti. Atha kho āyasmā vaṅgīso attanāva attano anabhiratiṃ vinodetvā abhiratiṃ uppādetvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Nikkhantaṃ vata maṃ santaṃ, agārasmānagāriyaṃ; Vitakkā upadhāvanti, pagabbhā kaṇhato ime. ‘‘Uggaputtā mahissāsā, sikkhitā daḷhadhammino; Samantā parikireyyuṃ, sahassaṃ apalāyinaṃ. ‘‘Sacepi etato [ettato (sī. pī. ka.), ettakā (syā. kaṃ.)] bhiyyo, āgamissanti itthiyo; Neva maṃ byādhayissanti [byāthayissanti (?)], dhamme samhi patiṭṭhitaṃ. ‘‘Sakkhī hi me sutaṃ etaṃ, buddhassādiccabandhuno; Nibbānagamanaṃ maggaṃ, tattha me nirato mano. ‘‘Evañce maṃ viharantaṃ, pāpima upagacchasi; Tathā maccu karissāmi, na me maggampi dakkhasī’’ti.",
      "english": "Thus have I heard: At one time, the Venerable Vaṅgīsa was dwelling in Āḷavī, at the Aggāḷava Shrine, together with his preceptor, the Venerable Nigrodhakappa. Now at that time, the Venerable Vaṅgīsa was a novice, recently ordained, and was the remaining monastery attendant. Then a good many women, having adorned themselves, approached the Aggāḷava pleasure garden wanting to see the monastery. Then, for the Venerable Vaṅgīsa, seeing those women, discontent arose, and passion assailed his mind. Then it occurred to the Venerable Vaṅgīsa: \"Alas, it is a loss for me, not a gain for me! Alas, it is ill-gained for me, not well-gained for me! For discontent has arisen for me, and passion assails my mind. How can it be that another would dispel my discontent and create delight for me? What if I myself were to dispel my own discontent and create delight for myself?\" Then the Venerable Vaṅgīsa, having himself dispelled his own discontent and created delight for himself, on that occasion spoke these verses:\n\n\"Alas, though I have gone forth, being homeless from home, these impudent, dark thoughts rush upon me.\nEven if formidable warrior-sons, great archers, well-trained and firm in their discipline, were to surround a thousand unwavering men on all sides—\nEven if more women than these were to come, they would not disturb me, for I am established in the Dhamma.\nIndeed, I have heard this from the Sakyan, the Buddha, kinsman of the sun—the path leading to Nibbāna; my mind is intent upon that.\nIf, while I dwell thus, you, Evil One, approach me, I will act in such a way, O Death, that you will not even see my path.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදි:\n\nඑක් සමයෙක ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ ආයුෂ්මත් නිග්‍රෝධකප්ප නම් වූ තම උපාධ්‍යායයන් වහන්සේ සමඟ අග්ගාළව චේතියෙහි ආළවියෙහි වාසය කරති. එහෙත් ඒ සමයෙහි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ අලුතින් පැවිදි වූ, පසුපසින් සිටින විහාරාරක්ෂක භික්ෂුවක් වූහ. ඉක්බිති බොහෝ ස්ත්‍රීහු මනාව සැරසී විහාරය දැකීමේ අදහසින් අග්ගාළව නම් ආරාමය කරා පැමිණියහ. ඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට ඒ ස්ත්‍රීන් දැකීමෙන් (පැවිදි ජීවිතය පිළිබඳ) අරති උපන්නාහ. රාගය සිත පෙළුවේය. ඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට මෙවැනි සිතිවිල්ලක් විය: \"අහෝ, මට අලාභයකි! මට ලාභයක් නොවේ. අහෝ, මට දුර්ලභ ලැබීමකි! මට සුලභ ලැබීමක් නොවේ. මට අරති උපන්නේය, රාගය සිත පෙළන්නේය. අන් කෙනෙකුට මාගේ අරතිය දුරුකොට අභිරතිය ඇති කළ හැක්කේ කොහින්ද? යම් හෙයකින් මම තමන් විසින්ම තමන්ගේ අරතිය දුරුකොට අභිරතිය ඇති කරගනිමි නම් හොඳය.\" ඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ තමන් විසින්ම තමන්ගේ අරතිය දුරුකොට අභිරතිය ඇති කරගෙන ඒ මොහොතෙහි මේ ගාථා වදාළහ:\n\n\"අහෝ, මා ගිහිගෙන් නික්ම අගිහි බවට පත්ව සිටියදී, මේ නිර්භීත (කාම) විතර්ක පව්කාරයාගෙන් (මාරයාගෙන්) පහර දෙති.\n\nඋග්‍ර රජ පුත්‍ර වූ, මහා දුනු ශිල්පී වූ, මනා පුහුණුවක් ඇති, දැඩි ගති ඇති, පලා නොයන දහස් ගණනක් (වූ සේනාවක්) සිව් දිගින් වටලන්නාක් මෙන් (මේ විතර්ක මට පහර දෙති).\n\nමෙයටත් වඩා වැඩි ස්ත්‍රීහු පැමිණෙත් නම්, මම ධර්‍මයෙහි පිහිටා සිටින හෙයින් ඔවුන් මාව කිසිසේත් පීඩාවට පත් නොකරනු ඇත.\n\nමම මේ ධර්‍මය ආදිච්චබන්දු බුදුරජාණන් වහන්සේගෙන් සාක්ෂිය සහිතවම ඇසීමි. (එය) නිවනට යන මාර්‍ගයයි. ඒ මාර්‍ගයෙහි මාගේ සිත ඇලී සිටියි.\n\nපව්කාරයා (මාරයා), මෙසේ වසන මා වෙත ඔබ පැමිණෙන්නෙහි නම්, මම ඔබට මරණයක් කරන්නෙමි. එවිට ඔබ මාගේ (නිවන්) මාර්‍ගයවත් නොදක්නා ඇතැයි.\"",
      "paliTitle": "Nikkhantasuttaṃ",
      "vagga": "",
      "englishTitle": "Gone Out Sutta",
      "sinhalaTitle": "නික්ඛන්ත සූත්‍රය"
    },
    {
      "number": 210,
      "pali": "Ekaṃ samayaṃ…pe… āyasmā vaṅgīso āḷaviyaṃ viharati aggāḷave cetiye āyasmatā nigrodhakappena upajjhāyena saddhiṃ. Tena kho pana samayena āyasmā nigrodhakappo pacchābhattaṃ piṇḍapātapaṭikkanto vihāraṃ pavisati, sāyaṃ vā nikkhamati aparajju vā kāle. Tena kho pana samayena āyasmato vaṅgīsassa anabhirati uppannā hoti, rāgo cittaṃ anuddhaṃseti. Atha kho āyasmato vaṅgīsassa etadahosi – ‘‘alābhā vata me, na vata me lābhā; dulladdhaṃ vata me, na vata me suladdhaṃ; yassa me anabhirati uppannā, rāgo cittaṃ anuddhaṃseti; taṃ kutettha labbhā, yaṃ me paro anabhiratiṃ vinodetvā abhiratiṃ uppādeyya. Yaṃnūnāhaṃ attanāva attano anabhiratiṃ vinodetvā abhiratiṃ uppādeyya’’nti. Atha kho āyasmā vaṅgīso attanāva attano anabhiratiṃ vinodetvā abhiratiṃ uppādetvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Aratiñca ratiñca pahāya, sabbaso gehasitañca vitakkaṃ; Vanathaṃ na kareyya kuhiñci, nibbanatho arato sa hi bhikkhu [sa bhikkhu (ka.)]. ‘‘Yamidha pathaviñca vehāsaṃ, rūpagatañca jagatogadhaṃ; Kiñci parijīyati sabbamaniccaṃ, evaṃ samecca caranti mutattā. ‘‘Upadhīsu janā gadhitāse [gathitāse (sī.)], diṭṭhasute paṭighe ca mute ca; Ettha vinodaya chandamanejo, yo ettha na limpati taṃ munimāhu. ‘‘Atha saṭṭhinissitā savitakkā, puthū janatāya adhammā niviṭṭhā; Na ca vaggagatassa kuhiñci, no pana duṭṭhullabhāṇī sa bhikkhu. ‘‘Dabbo cirarattasamāhito, akuhako nipako apihālu; Santaṃ padaṃ ajjhagamā muni paṭicca, parinibbuto kaṅkhati kāla’’ntntti.",
      "english": "At one time, the Venerable Vaṅgīsa was dwelling in Āḷavī, at the Aggāḷava Shrine, together with his preceptor, the Venerable Nigrodhakappa.\n\nNow at that time, the Venerable Nigrodhakappa, having returned from his alms round after the meal, would enter the dwelling, or go out in the evening, or at the opportune time the next day. Now at that time, discontent arose in the Venerable Vaṅgīsa, and sensual desire agitated his mind. Then it occurred to the Venerable Vaṅgīsa: “Indeed, I am unfortunate, I have no gain; indeed, I have obtained poorly, I have not obtained well; in whom discontent has arisen and sensual desire agitates the mind. How can it be that another might dispel my discontent and arouse delight? What if I myself were to dispel my own discontent and arouse delight?” Then, having himself dispelled his own discontent and aroused delight, the Venerable Vaṅgīsa uttered these verses on that occasion:\n\nHaving abandoned both discontent and delight, and completely all thoughts connected with household life, one should not create any craving anywhere. Such a monk, free from craving and delight, is indeed a true monk.\n\nWhatever here, on earth and in the sky, whatever is physical and encompassed by the world—all that decays, all is impermanent. Having understood this thus, the freed ones move about.\n\nPeople are entangled in attachments: in what is seen, heard, sensed, and in aversion. Here, dispel desire, being free from agitation. He who is not defiled by these, him they call a sage.\n\nFurthermore, based on numerous speculative views and their associated thoughts, which are unwholesome and ingrained in the common populace, that monk does not belong to any faction anywhere, nor is he a speaker of coarse words.\n\nCapable, concentrated for a long time, undeceptive, astute, not covetous—the sage has attained the state of peace, having comprehended dependent arising. Completely extinguished, he awaits his time.",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ ආයුෂ්මත් නිග්‍රෝධකප්ප ස්ථවිරයන් වහන්සේ උපධ්‍යායවරයාණන් වහන්සේ කොටගෙන, ආළවියේ අග්ගාළව නම් චෛත්‍යයෙහි වාසය කරමින් සිටියාහ. ඒ සමයෙහි ආයුෂ්මත් නිග්‍රෝධකප්ප ස්ථවිරයන් වහන්සේ දහවල් දන් වළඳා, පිණ්ඩපාතයෙන් ආපසු වැඩමවා විහාරයට පිවිසෙන සේක, හෝ සවස පිටතට වඩින සේක, හෝ පසුදින නිසි වේලාවට වඩින සේක. ඒ අවස්ථාවේදී ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට කලකිරීමක් ඇති වී තිබුණි. රාගය සිත මුළුමනින්ම ගසාගෙන යමින් තිබුණි. එවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"අහෝ මට අලාභයකි, මට ලාභයක් නොවේ; අහෝ මට නරක ලැබීමකි, මට හොඳ ලැබීමක් නොවේ; මට අරතියක් ඇති වී, රාගය සිත මුළුමනින්ම ගසාගෙන යමින් තිබෙන හෙයින්, අන් කෙනෙකුට මගේ මේ අරතිය දුරු කර අභිරතියක් ඇති කළ හැකි යැයි කෙසේ නම් බලාපොරොත්තු විය හැකිද? එසේ නම් මම ම විසින්ම මගේ මේ අරතිය දුරු කර අභිරතිය ඇති කරගන්නවා නම් හොඳයි\" කියායි. එවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ තමන් විසින්ම තමන්ගේ අරතිය දුරු කර, අභිරතිය ඇති කරගෙන, ඒ වේලෙහි මෙම ගාථා ප්‍රකාශ කළ සේක:\n\n\"අරතියත්, රතියත් සියලු ආකාරයෙන් අත්හැර, ගිහි ජීවිතය හා බැඳි තර්ක විතර්කයන් ද අත්හැර, කිසි තැනෙක තණ්හාව (වනය) ඇති නොකරන්නේය. තණ්හා වනයෙන් තොර වූ, රතියෙන් තොර වූ හෙතෙම සැබැවින්ම භික්ෂුවකි.\"\n\n\"මෙලොව පඨවි ධාතුවත්, අහසත්, රූප සහිත වූ, ලෝකයෙහි සත්වයාට ඇලී පවතින යම් දෙයක් වේද, ඒ සියල්ලම දිරාපත් වන, අනිත්‍ය ස්වභාවයෙන් යුක්තය. මෙලෙස අවබෝධ කොට, සිතින් නිදහස් වූවෝ (අරහත්හු) හැසිරෙති.\"\n\n\"ජනයෝ උපාධීන්හි බැඳී සිටිති; දැක්ක දේ, ඇසූ දේ, අරමුණට ගැටීමෙහි (පටිඝයෙහි) සහ දැනගත් දේ ද බැඳී සිටිති. මේ සියලු තැන්හිදී ආශාව දුරු කරන්න, නික්ලේශී වන්න. යමෙක් මේවායෙහි නොඇලේද, ඔහුව මුනිවරයෙකු ලෙස හඳුන්වති.\"\n\n\"තවද, බොහෝ වැරදි දැකීම් මත පදනම් වූ විතර්කයන් සහිත වූ, බොහෝ ජනයෝ අකුසල ධර්මයන්හි ගැලී සිටිති. කිසි කලෙක පිරිස්වාදයට නොයයි. සැබැවින්ම ඒ භික්ෂුව රළු වචන කථා නොකරයි.\"\n\n\"දක්ෂ වූ, දීර්ඝ කාලයක් සමාධියෙන් යුක්ත වූ, කුහක කම් නැති, ප්‍රඥාවන්ත වූ, කිසිවකට ආශා නොකරන ඒ මුනිවරයා නිර්වාණය වූ ශාන්ත පදයට (නිවනට) පැමිණියේය. සකල ක්ලේශයන්ගෙන් පිරිනිවී ගිය හෙතෙම (තමන්ගේ) අවසන් කාලය බලාපොරොත්තු වෙමින් සිටින්නේය.\"",
      "paliTitle": "Aratisuttaṃ",
      "vagga": "",
      "englishTitle": "Discontent Sutta",
      "sinhalaTitle": "අරති සූත්‍රය"
    },
    {
      "number": 211,
      "pali": "Ekaṃ samayaṃ āyasmā vaṅgīso āḷaviyaṃ viharati aggāḷave cetiye āyasmatā nigrodhakappena upajjhāyena saddhiṃ. Tena kho pana samayena āyasmā vaṅgīso attano paṭibhānena aññe pesale bhikkhū atimaññati. Atha kho āyasmato vaṅgīsassa etadahosi – ‘‘alābhā vata me, na vata me lābhā; dulladdhaṃ vata me, na vata me suladdhaṃ; yvāhaṃ attano paṭibhānena aññe pesale bhikkhū atimaññāmī’’ti. Atha kho āyasmā vaṅgīso attanāva attano vippaṭisāraṃ uppādetvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Mānaṃ pajahassu gotama, mānapathañca pajahassu; Asesaṃ mānapathasmiṃ, samucchito vippaṭisārīhuvā cirarattaṃ. ‘‘Makkhena makkhitā pajā, mānahatā nirayaṃ papatanti; Socanti janā cirarattaṃ, mānahatā nirayaṃ upapannā. ‘‘Na hi socati bhikkhu kadāci, maggajino sammāpaṭipanno; Kittiñca sukhañca anubhoti, dhammadasoti tamāhu pahitattaṃ. ‘‘Tasmā akhilodha padhānavā, nīvaraṇāni pahāya visuddho; Mānañca pahāya asesaṃ, vijjāyantakaro samitāvī’’ti.",
      "english": "At one time, the Venerable Vaṅgīsa was dwelling in Āḷavī at the Aggāḷava Shrine, together with his preceptor, the Venerable Nigrodhakappa. Now at that time, the Venerable Vaṅgīsa, due to his own inspired eloquence, was looking down upon other virtuous monks. Then it occurred to the Venerable Vaṅgīsa: \"Alas, it is a loss for me, not a gain for me; alas, it is ill-gotten for me, not well-gotten for me, that I, by my own inspired eloquence, look down upon other virtuous monks.\" Then the Venerable Vaṅgīsa, having generated remorse in himself by himself, at that time uttered these verses:\n\n\"Abandon conceit, Gotama, and abandon the path of conceit. One who is completely enmeshed in the path of conceit will long experience remorse.\n\nPeople smeared with contempt, struck down by conceit, fall into hell. People grieve for a long time, having been struck down by conceit and reborn in hell.\n\nA monk never grieves, one who is a conqueror of the path, rightly practicing. He experiences fame and happiness. Such a one, resolute in mind, they call 'one who sees the Dhamma'.\n\nTherefore, one who is free from obstruction, diligent, having abandoned the hindrances, pure, and having completely abandoned conceit, brings an end through true knowledge, and is tranquil.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ තම උපාධ්‍යායවරයාණන් වන ආයුෂ්මත් නිග\\u200D්‍රෝධකප්ප ස්ථවිරයන් වහන්සේ සමඟ ආළවියෙහි අග්ගාළව චේතියේ වැඩවසන සේක. ඒ අවස්ථාවෙහි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ තමන්ගේ ප\\u200D්‍රතිභාව නිසා අනෙකුත් ගුණවත් භික්ෂූන් වහන්සේලා අවමන් කළ සේක. ඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි – “අහෝ! මෙය මාගේ අලාභයකි, මා ලද ලාභයක් නොවේ. අහෝ! මෙය මාගේ අවාසනාවකි, සුලභ දෙයක් නොවේ. මක්නිසාද යත්, මම මාගේ ප\\u200D්‍රතිභාව නිසා අනෙකුත් ගුණවත් භික්ෂූන් වහන්සේලා අවමන් කළෙමි.” ඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ තමන් විසින්ම තමන් තුළ පසුතැවීමක් ඇති කරගෙන ඒ අවස්ථාවේදී මේ ගාථා ප\\u200D්‍රකාශ කළ සේක –\n\nපින්වත, මානය අත්හරින්න. මානයට යොමුවන මාර්ගයද අත්හරින්න. මානයේ මාර්ගයෙහි මුළුමනින්ම ඇලී ගැලී සිටියොත් බොහෝ කලක් පසුතැවිලි වන්නට සිදු වේ.\n\nමකුසින් කිලිටි වූ, මානයෙන් පෙළුණු ජනයා නිරයට වැටෙති. මානයට යටත් වී නිරයේ උපන් ජනයා දීර්ඝ කාලයක් ශෝක වෙති.\n\nමාර්ගය ජයගත්, මැනවින් පිළිපන් භික්ෂුව කිසි කලෙක ශෝක නොකරයි. ඔහු කීර්තිය හා සුවය අත්විඳියි. ධර\\u200D්මය දකින ඔහුට, (කෙලෙස් නසා) සිත යහමඟට යොමු කළ තැනැත්තා යැයි කියති.\n\nඑහෙයින්, කෙලෙස් කඩොල් නැති, වීර්යය ඇති, නීවරණ අත්හැර පිරිසිදු වූ, මානයද මුළුමනින්ම අත්හැර දැමූ, විද්‍යාව අවසන් කළ, සන්සුන් තැනැත්තා (උතුම් වේ).",
      "paliTitle": "Pesalasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Well-Behaved",
      "sinhalaTitle": "පේසල සූත්‍රය"
    },
    {
      "number": 212,
      "pali": "Ekaṃ samayaṃ āyasmā ānando sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi āyasmatā vaṅgīsena pacchāsamaṇena. Tena kho pana samayena āyasmato vaṅgīsassa anabhirati uppannā hoti, rāgo cittaṃ anuddhaṃseti. Atha kho āyasmā vaṅgīso āyasmantaṃ ānandaṃ gāthāya ajjhabhāsi – ‘‘Kāmarāgena ḍayhāmi, cittaṃ me pariḍayhati; Sādhu nibbāpanaṃ brūhi, anukampāya gotamā’’ti. ‘‘Saññāya vipariyesā, cittaṃ te pariḍayhati; Nimittaṃ parivajjehi, subhaṃ rāgūpasaṃhitaṃ. ‘‘Saṅkhāre parato passa, dukkhato mā ca attato; Nibbāpehi mahārāgaṃ, mā ḍayhittho punappunaṃ. ‘‘Asubhāya cittaṃ bhāvehi, ekaggaṃ susamāhitaṃ; Sati kāyagatā tyatthu, nibbidābahulo bha. ‘‘Animittañca bhāvehi, mānānusayamujjaha; Tato mānābhisamayā, upasanto carissasī’’ti.",
      "english": "At one time, the Venerable Ānanda was dwelling in Sāvatthī, in Jeta's Grove, at Anāthapiṇḍika's monastery. Then, in the morning, having dressed, the Venerable Ānanda took his bowl and robe and entered Sāvatthī for alms, accompanied by the Venerable Vaṅgīsa. Now at that time, discontent had arisen for the Venerable Vaṅgīsa, and sensual passion was assailing his mind. Then the Venerable Vaṅgīsa addressed the Venerable Ānanda with a verse: \"I am burning with sensual passion; my mind is utterly consumed. Please tell me the means of extinguishing this, out of compassion, O Gotama.\" \"Your mind is utterly consumed due to the perversion of perception. Avoid the sign that is perceived as beautiful and conducive to passion. See formations as alien, as suffering, and not as self. Extinguish the great passion; do not be consumed repeatedly. Cultivate your mind on the unlovely, making it one-pointed and well-concentrated. Let mindfulness of the body be present for you; become abundant in disenchantment. Cultivate the signless, abandon the latent tendency of conceit. Then, by the full understanding of conceit, you will wander about in peace.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයේ වැඩසිටියාහ. ඉන්පසු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන, ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ පසුපසින් වඩවාගෙන, පිඬු සිඟා වඩින පිණිස සැවැත් නුවරට පිවිසුණාහ.\n\nඒ කල්හි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට කළකිරීමක් ඇති විය. රාගය උන්වහන්සේගේ සිත දැඩි සේ පෙළන්නට විය. ඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට ගාථාවකින් මෙසේ පැවසූහ: ‘‘කාමරාගයෙන් මම දැවෙමි, මාගේ සිත සම්පූර්ණයෙන් දැවෙයි; කරුණාවෙන්, ගෞතමයන් වහන්ස, මේ දැවීම නිවාගන්නා අයුරු මට දේශනා කළ මැනව.’’\n\n‘‘සංඥාවේ විපර්යාසය නිසා, ඔබගේ සිත දැවෙයි; රාගය හා බැඳුණු සුබ නිමිත්ත දුරු කරන්න.\n\n‘‘සංස්කාරයන් අන් දෙයක් ලෙසත්, දුකක් ලෙසත් දකින්න; ආත්මයක් ලෙස නොදකින්න. මහත් වූ රාගය නිවා දමන්න; නැවත නැවතත් නොදැවෙන්න.\n\n‘‘අසුභ භාවනාවෙන් සිත වඩා දියුණු කරන්න, එය එකඟ කොට, මැනවින් සමාධිගත කරන්න. ඔබ හට කය පිළිබඳ සතිය ඇති වේවා; නිරන්තරයෙන්ම කලකිරීමෙන් (සැකැවින්) යුක්ත වන්න.\n\n‘‘අනිමිත්ත භාවනාව වඩන්න, මානානුසය (මානය පිළිබඳ වූ අනුශය) දුරු කරන්න; එතැන් පටන් මානය මුළුමනින්ම ප්‍රහීණ කිරීමෙන් ඔබ සන්සුන්ව, උපශාන්තව වාසය කරනු ඇත.’’",
      "paliTitle": "Ānandasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Ānanda",
      "sinhalaTitle": "ආනන්ද සූත්‍රය"
    },
    {
      "number": 213,
      "pali": "Sāvatthinidānaṃ. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Catūhi, bhikkhave, aṅgehi samannāgatā vācā subhāsitā hoti, no dubbhāsitā; anavajjā ca ananuvajjā ca viññūnaṃ. Katamehi catūhi? Idha, bhikkhave, bhikkhu subhāsitaṃyeva bhāsati no dubbhāsitaṃ, dhammaṃyeva bhāsati no adhammaṃ, piyaṃyeva bhāsati no appiyaṃ, saccaṃyeva bhāsati no alikaṃ. Imehi kho, bhikkhave, catūhi aṅgehi samannāgatā vācā subhāsitā hoti, no dubbhāsitā, anavajjā ca ananuvajjā ca viññūna’’nti. Idamavoca bhagavā, idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Subhāsitaṃ uttamamāhu santo, Dhammaṃ bhaṇe nādhammaṃ taṃ dutiyaṃ; Piyaṃ bhaṇe nāppiyaṃ taṃ tatiyaṃ, Saccaṃ bhaṇe nālikaṃ taṃ catuttha’’nti. Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘paṭibhāti maṃ bhagavā, paṭibhāti maṃ sugatā’’ti. ‘‘Paṭibhātu taṃ vaṅgīsā’’ti bhagavā avoca. Atha kho āyasmā vaṅgīso bhagavantaṃ sammukhā sāruppāhi gāthāhi abhitthavi – ‘‘Tameva vācaṃ bhāseyya, yāyattānaṃ na tāpaye; Pare ca na vihiṃseyya, sā ve vācā subhāsitā. ‘‘Piyavācaṃva bhāseyya, yā vācā paṭinanditā; Yaṃ anādāya pāpāni, paresaṃ bhāsate piyaṃ. ‘‘Saccaṃ ve amatā vācā, esa dhammo sanantano; Sacce atthe ca dhamme ca, āhu santo patiṭṭhitā. ‘‘Yaṃ buddho bhāsate vācaṃ, khemaṃ nibbānapattiyā; Dukkhassantakiriyāya, sā ve vācānamuttamā’’ti.",
      "english": "At Sāvatthī. There, indeed, the Blessed One addressed the monks, saying, “Monks!” And those monks replied to the Blessed One, “Venerable Sir.” The Blessed One said this: “Monks, speech endowed with four qualities is well-spoken, not ill-spoken; it is faultless and beyond reproach by the wise. Which four? Here, monks, a monk speaks only what is well-spoken, not ill-spoken; he speaks only what is the Dhamma, not what is not the Dhamma; he speaks only what is agreeable, not what is disagreeable; he speaks only what is true, not what is false. Monks, speech endowed with these four qualities is well-spoken, not ill-spoken; it is faultless and beyond reproach by the wise.” This is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further spoke this:\n\nThe wise declare well-spoken words to be supreme;\nOne should speak Dhamma, not non-Dhamma – that is the second;\nOne should speak what is agreeable, not what is disagreeable – that is the third;\nOne should speak what is true, not what is false – that is the fourth.\n\nThen, Venerable Vaṅgīsa rose from his seat, arranged his upper robe over one shoulder, and bowing with cupped hands towards the Blessed One, he said to the Blessed One, “It occurs to me, Blessed One! It occurs to me, Fortunate One!” The Blessed One said, “Let it occur to you, Vaṅgīsa!” Then Venerable Vaṅgīsa extolled the Blessed One in his presence with appropriate verses:\n\nOne should speak only those words by which one does not torment oneself,\nNor inflict harm upon others. Indeed, that is well-spoken speech.\n\nOne should speak only agreeable words, words that are welcomed,\nSpeaking agreeably to others, without incurring any fault.\n\nIndeed, truth is the immortal word; this is an ancient Dhamma.\nThe wise are said to be established in truth, in its meaning, and in the Dhamma.\n\nThe words that the Buddha speaks, leading to safety, to the attainment of Nibbāna,\nFor the ending of suffering – indeed, that speech is unsurpassed.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි” කියාය. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, කරුණු සතරකින් යුත් වචනය සුභාෂිතය, දුර්භාෂිත නොවේ; එය විඤ්ඤුන්ට (ප්‍රඥාවන්තයන්ට) දොස් පැවරිය නොහැකි, නින්දා කළ නොහැකි වචනයකි. කවර සතරකින්ද? මහණෙනි, මෙහිලා භික්ෂුව සුභාෂිතයක්ම කියයි, දුර්භාෂිතයක් නොකියයි. ධර්මයක්ම කියයි, අධර්මයක් නොකියයි. ප්‍රිය වචනයක්ම කියයි, අප්‍රිය වචනයක් නොකියයි. සත්‍යයක්ම කියයි, බොරුවක් නොකියයි. මහණෙනි, සැබවින්ම මේ කරුණු සතරකින් යුක්ත වූ වචනය සුභාෂිතය, දුර්භාෂිත නොවේ. එය විඤ්ඤුන්ට දොස් පැවරිය නොහැකි, නින්දා කළ නොහැකි වචනයකි.”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාළ සුගත වූ ශාස්තෘන් වහන්සේ ඉන්පසුව තවත් මෙය වදාළ සේක:\n\n“යහපත් වචනය උතුම් යැයි සත්පුරුෂයෝ කියති. දහම් වචන කතා කළ යුතුය, අධර්ම වචන නොවේ – එය දෙවැන්නයි. ප්‍රිය වචන කතා කළ යුතුය, අප්‍රිය වචන නොවේ – එය තෙවැන්නයි. සත්‍ය වචන කතා කළ යුතුය, බොරු වචන නොවේ – එය සිව්වැන්නයි.”\n\nඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ හුනස්නෙන් නැගිට, එක් උරහිසක් මත උතුරු සළුව තබාගෙන, භාග්‍යවතුන් වහන්සේ වැඩසිටි දෙසට දොහොත් මුදුන් දී, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “භාග්‍යවතුන් වහන්ස, මට වැටහේ! සුගතයන් වහන්ස, මට වැටහේ!” “වංගීසය, ඔබට වැටහේවා”යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\nඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ ඉදිරියේ සුදුසු ගාථාවලින් ප්‍රශංසා කළ සේක:\n\n“තමාට දුක් නොදෙන, අනුන්ට හිංසා නොකරන වචනම කතා කළ යුතුය. සැබවින්ම එය සුභාෂිත වචනයකි.”\n\n“අනුන් සතුටින් පිළිගන්නා වූ, පාපයක් ඇති නොකරන, අනුන්ට ප්‍රිය වූ වචනම කතා කළ යුතුය.”\n\n“සත්‍යය නම් අමෘත වාක්‍යයකි; මෙය සනාතන ධර්මයයි. සත්‍යයෙහිද, අර්ථයෙහිද, ධර්මයෙහිද සත්පුරුෂයෝ පිහිටා සිටිති යැයි කියනු ලැබේ.”\n\n“බුදුරදුන් විසින් දේශනා කරන ලද, නිර්වාණය පිණිසත්, දුක් කෙළවර කිරීම පිණිසත්, ක්ෂේමදායක වූ යම් වචනයක් වේද; සැබවින්ම එය වචන අතරින් අතිශ්‍රේෂ්ඨය.”",
      "paliTitle": "Subhāsitasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Well-spoken Words",
      "sinhalaTitle": "සුභාසිත සූත්‍රය"
    },
    {
      "number": 214,
      "pali": "Ekaṃ samayaṃ āyasmā sāriputto sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā sāriputto bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti poriyā vācāya vissaṭṭhāya anelagalāya [aneḷagalāya (sī. ka.), anelagaḷāya (syā. kaṃ. pī.)] atthassa viññāpaniyā. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Atha kho āyasmato vaṅgīsassa etadahosi – ‘‘ayaṃ kho āyasmā sāriputto bhikkhū dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti poriyā vācāya vissaṭṭhāya anelagalāya atthassa viññāpaniyā. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Yaṃnūnāhaṃ āyasmantaṃ sāriputtaṃ sammukhā sāruppāhi gāthāhi abhitthaveyya’’nti. Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yenāyasmā sāriputto tenañjaliṃ paṇāmetvā āyasmantaṃ sāriputtaṃ etadavoca – ‘‘paṭibhāti maṃ, āvuso sāriputta, paṭibhāti maṃ, āvuso sāriputtā’’ti. ‘‘Paṭibhātu taṃ, āvuso vaṅgīsā’’ti. Atha kho āyasmā vaṅgīso āyasmantaṃ sāriputtaṃ sammukhā sāruppāhi gāthāhi abhitthavi – ‘‘Gambhīrapañño medhāvī, maggāmaggassa kovido; Sāriputto mahāpañño, dhammaṃ deseti bhikkhunaṃ. ‘‘Saṃkhittenapi deseti, vitthārenapi bhāsati; Sāḷikāyiva nigghoso, paṭibhānaṃ udīrayi [udīriyi (syā. kaṃ.) udīriyati (sāmaññaphalasuttaṭīkānurūpaṃ)]. ‘‘Tassa taṃ desayantassa, suṇanti madhuraṃ giraṃ; Sarena rajanīyena, savanīyena vaggunā; Udaggacittā muditā, sotaṃ odhenti bhikkhavo’’ti.",
      "english": "On one occasion, Venerable Sāriputta was dwelling in Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s monastery. At that time, Venerable Sāriputta was instructing, urging, inspiring, and gladdening the bhikkhus with a Dhamma talk, using clear and articulate speech, free from stammering, and conveying the meaning effectively. And those bhikkhus, paying earnest attention, bearing it in mind, applying their whole mind, and lending an ear, listened to the Dhamma. Then it occurred to Venerable Vaṅgīsa: \"Venerable Sāriputta is indeed instructing, urging, inspiring, and gladdening the bhikkhus with a Dhamma talk, using clear and articulate speech, free from stammering, and conveying the meaning effectively. And those bhikkhus, paying earnest attention, bearing it in mind, applying their whole mind, and lending an ear, listen to the Dhamma. Why don't I praise Venerable Sāriputta directly with appropriate verses?\" Then Venerable Vaṅgīsa rose from his seat, arranged his upper robe over one shoulder, reverently saluted Venerable Sāriputta with clasped hands, and said to him: \"It inspires me, friend Sāriputta! It inspires me, friend Sāriputta!\" \"Be inspired, friend Vaṅgīsa!\" Then Venerable Vaṅgīsa praised Venerable Sāriputta directly with appropriate verses:\n\nOf deep wisdom, intelligent, skilled in the path and not-path;\nSāriputta, the greatly wise, teaches the Dhamma to the bhikkhus.\n\nHe teaches concisely, and speaks expansively as well;\nHis inspired utterance resounds like the voice of a mynah bird.\n\nAs he teaches thus, they listen to his sweet voice;\nWith a voice that enchants, is pleasing to hear, and beautiful;\nWith uplifted and joyful hearts, the bhikkhus lend their ear.",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. ඒ කල්හි ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලාට ධර්ම කථාවකින් කරුණු පැහැදිලි කරමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින්, අර්ථය මනාව ප්‍රකාශ කරන්නා වූ, පැහැදිලි, නොපැකිලෙන, පිරිසට ගැලපෙන වචනයෙන් කරුණු දැක්වූ සේක. ඒ භික්ෂූන් වහන්සේලා සිත් ස්ථිර කොට, මනාකොට මෙනෙහි කරමින්, සියලු චේතනාවෙන් සමන්විත වී, කන් යොමා ධර්මය ශ්‍රවණය කළහ.\n\nඑවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට මේ අදහස පහළ විය: ‘‘ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලාට ධර්ම කථාවකින් කරුණු පැහැදිලි කරමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින්, අර්ථය මනාව ප්‍රකාශ කරන්නා වූ, පැහැදිලි, නොපැකිලෙන, පිරිසට ගැලපෙන වචනයෙන් කරුණු දක්වන සේක. ඒ භික්ෂූන් වහන්සේලා සිත් ස්ථිර කොට, මනාකොට මෙනෙහි කරමින්, සියලු චේතනාවෙන් සමන්විත වී, කන් යොමා ධර්මය ශ්‍රවණය කරති. මම ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ මුහුණට මුහුණ ලා සුදුසු ගාථාවලින් ප්‍රශංසා කළොත් යෙහෙකැ’’යි. එවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ හුනස්නෙන් නැගිට, උතුරුසඟය එක අංශයෙහි කොට, ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ දෙසට ඇඳිලි බැඳ, ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ පැවසූ සේක: ‘‘ඇවැත් ශාරිපුත්ත, මට ස්වාභාවිකවම කවි කියන්නට සිත පහළ වේ, ඇවැත් ශාරිපුත්ත, මට කවි කියන්නට සිත පහළ වේ!’’ එවිට ශාරිපුත්ත ස්ථවිරයන් වහන්සේ ‘‘ඇවැත් වංගීස, ඔබට කවි කියන්නට සිත පහළ වේවා!’’යි පැවසූ සේක. එවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට මුහුණට මුහුණ ලා සුදුසු ගාථාවලින් ප්‍රශංසා කළ සේක –\n\n‘‘ගැඹුරු ප්‍රඥාවෙන් යුක්ත වූ, බුද්ධිමත් වූ, මාර්ගය සහ අමාර්ගය පිළිබඳ දක්ෂ වූ, මහා ප්‍රඥාවන්ත ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලාට ධර්මය දේශනා කරන සේක.\n\n‘‘උන්වහන්සේ සංක්ෂිප්තවද දේශනා කරන සේක, විස්තරාත්මකවද පවසන සේක; උන්වහන්සේගේ ප්‍රකාශය ඉතා පැහැදිලි, මිහිරි කුරුළු නාදයක් මෙන් (ශ්‍රවණයට ප්‍රිය) වේ.\n\n‘‘එසේ උන්වහන්සේ දේශනා කරන කල්හි, භික්ෂූන් වහන්සේලා උන්වහන්සේගේ මධුර වූ බස් අසති; සිත් වසඟ කරවන, ශ්‍රවණයට ප්‍රිය උපදවන, මනහර වූ ස්වරයකින් යුතු එම ධර්මය; ප්‍රීතිමත් වූ, උදාර සිත් ඇති භික්ෂූහු කන් යොමා ශ්‍රවණය කරති.’’",
      "paliTitle": "Sāriputtasuttaṃ",
      "vagga": "",
      "englishTitle": "Sāriputta Sutta",
      "sinhalaTitle": "සාරිපුත්ත සූත්‍රය"
    },
    {
      "number": 215,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi sabbeheva arahantehi. Tena kho pana samayena bhagavā tadahuposathe pannarase pavāraṇāya bhikkhusaṅghaparivuto abbhokāse nisinno hoti. Atha kho bhagavā tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā bhikkhū āmantesi – ‘‘handa dāni, bhikkhave, pavāremi vo. Na ca me kiñci garahatha kāyikaṃ vā vācasikaṃ vā’’ti. Evaṃ vutte, āyasmā sāriputto uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘na kho mayaṃ, bhante, bhagavato kiñci garahāma kāyikaṃ vā vācasikaṃ vā. Bhagavā hi, bhante, anuppannassa maggassa uppādetā, asañjātassa maggassa sañjanetā, anakkhātassa maggassa akkhātā, maggaññū maggavidū maggakovido. Maggānugā ca, bhante, etarahi sāvakā viharanti pacchā samannāgatā; ahañca kho, bhante, bhagavantaṃ pavāremi. Na ca me bhagavā kiñci garahati kāyikaṃ vā vācasikaṃ vā’’ti. ‘‘Na khvāhaṃ te, sāriputta, kiñci garahāmi kāyikaṃ vā vācasikaṃ vā. Paṇḍito tvaṃ, sāriputta, mahāpañño tvaṃ, sāriputta, puthupañño tvaṃ, sāriputta, hāsapañño tvaṃ, sāriputta, javanapañño tvaṃ, sāriputta, tikkhapañño tvaṃ, sāriputta, nibbedhikapañño tvaṃ, sāriputta. Seyyathāpi, sāriputta, rañño cakkavattissa jeṭṭhaputto pitarā pavattitaṃ cakkaṃ sammadeva anuppavatteti; evameva kho tvaṃ, sāriputta, mayā anuttaraṃ dhammacakkaṃ pavattitaṃ sammadeva anuppavattesī’’ti. ‘‘No ce kira me, bhante, bhagavā kiñci garahati kāyikaṃ vā vācasikaṃ vā. Imesaṃ pana, bhante, bhagavā pañcannaṃ bhikkhusatānaṃ na kiñci garahati kāyikaṃ vā vācasikaṃ vā’’ti. ‘‘Imesampi khvāhaṃ, sāriputta, pañcannaṃ bhikkhusatānaṃ na kiñci garahāmi kāyikaṃ vā vācasikaṃ vā. Imesañhi, sāriputta, pañcannaṃ bhikkhusatānaṃ saṭṭhi bhikkhū tevijjā, saṭṭhi bhikkhū chaḷabhiññā, saṭṭhi bhikkhū ubhatobhāgavimuttā, atha itare paññāvimuttā’’ti. Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘paṭibhāti maṃ bhagavā, paṭibhāti maṃ sugatā’’ti. ‘‘Paṭibhātu taṃ, vaṅgīsā’’ti bhagavā avoca. Atha kho āyasmā vaṅgīso bhagavantaṃ sammukhā sāruppāhi gāthāhi abhitthavi – ‘‘Ajja pannarase visuddhiyā, bhikkhū pañcasatā samāgatā; Saṃyojanabandhanacchidā, anīghā khīṇapunabbhavā isī. ‘‘Cakkavattī yathā rājā, amaccaparivārito; Samantā anupariyeti, sāgarantaṃ mahiṃ imaṃ. ‘‘Evaṃ vijitasaṅgāmaṃ, satthavāhaṃ anuttaraṃ; Sāvakā payirupāsanti, tevijjā maccuhāyino. ‘‘Sabbe bhagavato puttā, palāpettha na vijjati; Taṇhāsallassa hantāraṃ, vande ādiccabandhuna’’nti.",
      "english": "One time, the Blessed One was dwelling in Sāvatthī, at the Eastern Park, in Migāra's mother's palace, together with a great community of monks, consisting of some five hundred monks, all of whom were Arahants. Now, at that time, on the fifteenth day, the Uposatha day, the Blessed One was seated in the open air, surrounded by the community of monks, for the Pavāraṇā ceremony. Then the Blessed One, observing the silent community of monks, addressed the monks, saying: \"Come now, monks, I invite you all to speak. Do not find any fault with me, whether physical or verbal.\"\n\nWhen this was said, Venerable Sāriputta rose from his seat, arranged his upper robe over one shoulder, reverently saluted the Blessed One with joined palms, and said to him: \"Indeed, Venerable Sir, we find no fault with the Blessed One, whether physical or verbal. For the Blessed One, Venerable Sir, is the originator of the unarisen path, the producer of the unproduced path, the proclaimer of the unproclaimed path; he is the knower of the path, the discoverer of the path, the master of the path. And the disciples, Venerable Sir, are now dwelling as followers of the path, endowed with it afterwards. And I, Venerable Sir, invite the Blessed One to speak. And may the Blessed One find no fault with me, whether physical or verbal.\"\n\n\"Indeed, Sāriputta, I find no fault with you, whether physical or verbal. You are wise, Sāriputta; you are of great wisdom, Sāriputta; you are of abundant wisdom, Sāriputta; you are of joyful wisdom, Sāriputta; you are of swift wisdom, Sāriputta; you are of sharp wisdom, Sāriputta; you are of penetrative wisdom, Sāriputta. Just as, Sāriputta, the eldest son of a wheel-turning monarch rightly continues to turn the wheel set in motion by his father, even so, Sāriputta, you rightly continue to turn the unsurpassed Wheel of Dhamma set in motion by me.\"\n\n\"If, Venerable Sir, the Blessed One finds no fault with me, whether physical or verbal, then, Venerable Sir, does the Blessed One find no fault with these five hundred monks, whether physical or verbal?\"\n\n\"Indeed, Sāriputta, I find no fault with these five hundred monks, whether physical or verbal. For among these five hundred monks, Sāriputta, sixty monks are endowed with the three knowledges, sixty monks possess the six direct knowledges, sixty monks are liberated in both ways, and the remaining ones are liberated through wisdom.\"\n\nThen Venerable Vaṅgīsa rose from his seat, arranged his upper robe over one shoulder, reverently saluted the Blessed One with joined palms, and said to the Blessed One: \"It inspires me, O Blessed One! It inspires me, O Fortunate One!\" \"Let it inspire you, Vaṅgīsa,\" said the Blessed One. Then Venerable Vaṅgīsa praised the Blessed One face-to-face with fitting verses:\n\n\"Today, on the fifteenth day of purification, five hundred monks have assembled;\nThey are sages who have severed all fetters and bonds, free from distress, with rebirth exhausted.\n\nJust as a wheel-turning monarch, surrounded by his ministers,\nTravels everywhere around this earth, to the ocean's shore.\n\nEven so, the supreme leader, who has conquered all battles,\nIs attended upon by disciples who possess the three knowledges and have transcended death.\n\nAll are children of the Blessed One; here, there is no idle talk;\nI pay homage to the Kinsman of the Sun, the destroyer of the dart of craving.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර පූර්වාරාමයේ මිගාරමාතුප්‍රාසාදයෙහි පන්සියයක් පමණ වූ සියලුම රහතන් වහන්සේලාගෙන් සමන්විත මහත් භික්ෂුසංඝයා සමග වැඩසිටි සේක. ඒ කල්හි භාග්‍යවතුන් වහන්සේ ඒ උපෝසථ දිනයේ, පසළොස්වක පවාරණාවෙහිලා, භික්ෂුසංඝයා පිරිවරාගෙන එළිමහනේ වැඩසිටි සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දව සිටි භික්ෂුසංඝයා දෙස බලා භික්ෂූන් වහන්සේලා අමතා මෙසේ වදාළ සේක – ‘‘මහණෙනි, එසේ නම් දැන් මම ඔබ වහන්සේලාට පවාරණය කරමි. මාගේ කයින් හෝ වචනයෙන් හෝ කිසි වරදක් නොකියන්නැ’’යි. මෙසේ වදාළ කල්හි ආයුෂ්මත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ අසුනෙන් නැගිට උතුරු සළුව තනිපටක් කොට භාග්‍යවතුන් වහන්සේ වැඩසිටි දිශාවට ඇඳිලි බැඳ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක – ‘‘භාග්‍යවතුන් වහන්ස, අපි භාග්‍යවතුන් වහන්සේගේ කයින් හෝ වචනයෙන් හෝ කිසි වරදක් නොදක්නෙමු. භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ නොහටගත් මාර්ගය ඇතිකළ තැනැත්තාය, නූපන් මාර්ගය උපදවූ තැනැත්තාය, ප්‍රකාශ නොකළ මාර්ගය ප්‍රකාශ කළ තැනැත්තාය, මාර්ගය දන්නා තැනැත්තාය, මාර්ගය අවබෝධ කළ තැනැත්තාය, මාර්ගයෙහි දක්ෂ තැනැත්තාය. භාග්‍යවතුන් වහන්ස, මේ දිනවල අනුගාමී ශ්‍රාවකයෝ පසුපසින් (මාර්ගය) සමන්වාගතව වාසය කරති. භාග්‍යවතුන් වහන්ස, මම භාග්‍යවතුන් වහන්සේට පවාරණය කරමි. භාග්‍යවතුන් වහන්සේ මාගේ කයින් හෝ වචනයෙන් හෝ කිසි වරදක් නොදකීවා!’’යි. ‘‘ශාරිපුත්‍රය, මම තොපගේ කයින් හෝ වචනයෙන් හෝ කිසි වරදක් නොදක්නෙමි. ශාරිපුත්‍රය, තෙපි පණ්ඩිතයෙකි; ශාරිපුත්‍රය, තෙපි මහා ප්‍රඥා ඇත්තෙකි; ශාරිපුත්‍රය, තෙපි පුළුල් ප්‍රඥා ඇත්තෙකි; ශාරිපුත්‍රය, තෙපි ප්‍රීතිමත් ප්‍රඥා ඇත්තෙකි; ශාරිපුත්‍රය, තෙපි වේගවත් ප්‍රඥා ඇත්තෙකි; ශාරිපුත්‍රය, තෙපි තියුණු ප්‍රඥා ඇත්තෙකි; ශාරිපුත්‍රය, තෙපි විනිවිදින ප්‍රඥා ඇත්තෙකි. ශාරිපුත්‍රය, යම්සේ සක්විති රජුගේ ජ්‍යෙෂ්ඨ පුත්‍රයා පියා විසින් පවත්වන ලද චක්‍රය මැනවින් අනුව පවත්වයිද, එපරිද්දෙන්ම ශාරිපුත්‍රය, මා විසින් පවත්වන ලද අනුත්තර ධර්ම චක්‍රය තෙපි මැනවින් අනුව පවත්වන්නෙහි ය’’යි. ‘‘භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ මාගේ කයින් හෝ වචනයෙන් හෝ කිසි වරදක් නොදක්නේ නම්, භාග්‍යවතුන් වහන්ස, මේ පන්සියයක් භික්ෂූන් වහන්සේලාගේ කයින් හෝ වචනයෙන් හෝ කිසි වරදක් නොදකීද?’’යි. ‘‘ශාරිපුත්‍රය, මේ පන්සියයක් භික්ෂූන් වහන්සේලාගේද මම කයින් හෝ වචනයෙන් හෝ කිසි වරදක් නොදක්නෙමි. ශාරිපුත්‍රය, මේ පන්සියයක් භික්ෂූන් වහන්සේලා අතුරෙන් හැට නමක් ත්‍රිවිද්‍යා ඇත්තෝය, හැට නමක් ෂඩභිඥා ඇත්තෝය, හැට නමක් උභතෝභාග විමුක්තයෝය, ඉතිරි අය ප්‍රඥාවෙන් නිදහස් වූවෝය’’යි.\n\nඑවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ අසුනෙන් නැගිට උතුරු සළුව තනිපටක් කොට භාග්‍යවතුන් වහන්සේ වැඩසිටි දිශාවට ඇඳිලි බැඳ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක – ‘‘භාග්‍යවතුන් වහන්ස, මට වැටහේ (ගාථා කීමට); සුගතයන් වහන්ස, මට වැටහේ (ගාථා කීමට)’’යි. ‘‘වංගීසය, ඔබට වැටහේවා’’යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. ඉක්බිති ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ ඉදිරියේ සුදුසු ගාථාවලින් අභිවන්දනා කළ සේක:\n\n‘‘අද පසළොස්වක පිරිසිදු දින, පන්සියයක් භික්ෂූහු රැස්ව සිටිති.\nඔවුන් සංයෝජන නම් වූ බැඳීම් සිඳ දැමූ, කිසිදු පීඩාවක් නැති, යළි භවයක් නැති කළ ඍෂිවරු වෙති.\nයම්සේ සක්විති රජෙක් ඇමතිවරුන් පිරිවරාගෙන, සයුර කෙළවර වූ මේ පොළොව සිසාරා යයිද,\nඑසේම, සංග්‍රාමය ජයගත්, අනුත්තර වූ ශාස්තෘවරයා වන උන්වහන්සේ වටා, ත්‍රිවිද්‍යා ඇති, මාරයා දුරුකළ ශ්‍රාවකයෝ සිටිති.\nඔවුන් සියල්ලෝම භාග්‍යවතුන් වහන්සේගේ පුත්‍රයෝය, මෙහි එළවා දැමිය යුතු කිසිවෙක් නැත. තෘෂ්ණා නම් හීසලය සිඳ දැමූ, ආදිත්‍ය බන්ධු වූ (සූර්ය වංශයට නෑකම් කියන) උන්වහන්සේට මම වන්දනා කරමි!’’",
      "paliTitle": "Pavāraṇāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on the Invitation (Pavāraṇā)",
      "sinhalaTitle": "පවාරණා සූත්‍රය"
    },
    {
      "number": 216,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme mahatā bhikkhusaṅghena saddhiṃ aḍḍhatelasehi bhikkhusatehi. Tena kho pana samayena bhagavā bhikkhū nibbānapaṭisaṃyuttāya dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Atha kho āyasmato vaṅgīsassa etadahosi – ‘‘ayaṃ kho bhagavā bhikkhū nibbānapaṭisaṃyuttāya dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Yaṃnūnāhaṃ bhagavantaṃ sammukhā sāruppāhi gāthāhi abhitthaveyya’’nti. Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘paṭibhāti maṃ bhagavā, paṭibhāti maṃ sugatā’’ti. ‘‘Paṭibhātu taṃ, vaṅgīsā’’ti bhagavā avoca. Atha kho āyasmā vaṅgīso bhagavantaṃ sammukhā sāruppāhi gāthāhi abhitthavi – ‘‘Parosahassaṃ bhikkhūnaṃ, sugataṃ payirupāsati; Desentaṃ virajaṃ dhammaṃ, nibbānaṃ akutobhayaṃ. ‘‘Suṇanti dhammaṃ vimalaṃ, sammāsambuddhadesitaṃ; Sobhati vata sambuddho, bhikkhusaṅghapurakkhato. ‘‘Nāganāmosi bhagavā, isīnaṃ isisattamo; Mahāmeghova hutvāna, sāvake abhivassati. ‘‘Divāvihārā nikkhamma, satthudassanakamyatā [satthudassanakāmatā (sī. syā. kaṃ.)]; Sāvako te mahāvīra, pāde vandati vaṅgīso’’ti. ‘‘Kiṃ nu te, vaṅgīsa, imā gāthāyo pubbe parivitakkitā, udāhu ṭhānasova taṃ paṭibhantī’’ti? ‘Na kho me, bhante, imā gāthāyo pubbe parivitakkitā, atha kho ṭhānasova maṃ paṭibhantī’ti. ‘Tena hi taṃ, vaṅgīsa, bhiyyosomattāya pubbe aparivitakkitā gāthāyo paṭibhantū’ti. ‘Evaṃ, bhante’ti kho āyasmā vaṅgīso bhagavato paṭissutvā bhiyyosomattāya bhagavantaṃ pubbe aparivitakkitāhi gāthāhi abhitthavi – ‘‘Ummaggapathaṃ [ummaggasataṃ (syā. kaṃ. ka.)] mārassa abhibhuyya, carati pabhijja khilāni; Taṃ passatha bandhapamuñcakaraṃ, asitaṃ bhāgaso pavibhajaṃ. ‘‘Oghassa nittharaṇatthaṃ, anekavihitaṃ maggaṃ akkhāsi; Tasmiñce amate akkhāte, dhammaddasā ṭhitā asaṃhīrā. ‘‘Pajjotakaro ativijjha [ativijjha dhammaṃ (sī. syā. kaṃ.)], sabbaṭṭhitīnaṃ atikkamamaddasa; Ñatvā ca sacchikatvā ca, aggaṃ so desayi dasaddhānaṃ. ‘‘Evaṃ sudesite dhamme, Ko pamādo vijānataṃ dhammaṃ [ko pamādo vijānataṃ (sī. syā. kaṃ.)]; Tasmā hi tassa bhagavato sāsane; Appamatto sadā namassamanusikkhe’’ti.",
      "english": "At one time the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery, together with a large community of monks, with twelve hundred and fifty monks. Now at that time, the Blessed One was instructing, inspiring, encouraging, and gladdening the monks with a Dhamma talk connected with Nibbāna. And those monks were listening to the Dhamma with full attention, heeding it well, applying their entire mind, and lending an attentive ear.\n\nThen it occurred to Venerable Vaṅgīsa, \"Indeed, the Blessed One is instructing, inspiring, encouraging, and gladdening the monks with a Dhamma talk connected with Nibbāna. And those monks are listening to the Dhamma with full attention, heeding it well, applying their entire mind, and lending an attentive ear. What if I were to praise the Blessed One with fitting verses in his presence?\" Then Venerable Vaṅgīsa rose from his seat, arranged his upper robe over one shoulder, bowed to the Blessed One with his hands together in salutation, and said to the Blessed One, \"It occurs to me, Blessed One! It occurs to me, Fortunate One!\" \"May it occur to you, Vaṅgīsa,\" the Blessed One said. Then Venerable Vaṅgīsa, in the presence of the Blessed One, praised him with fitting verses:\n\nMore than a thousand monks are attending the Fortunate One, as he teaches the dust-free Dhamma, Nibbāna, which is free from all fear. They are listening to the stainless Dhamma, taught by the Fully Self-Awakened One. Truly, the Awakened One shines, surrounded by the community of monks. The Blessed One is a great being, the foremost sage among sages. Like a great rain cloud, he showers his disciples. Having emerged from his day-dwelling, with the desire to see the Teacher, your disciple, Great Hero, Vaṅgīsa, bows at your feet.\n\n\"Vaṅgīsa, were these verses thought out by you previously? Or did they just occur to you on the spot?\" \"Indeed, Venerable Sir, these verses were not thought out by me previously. Instead, they just occurred to me on the spot.\" \"In that case, Vaṅgīsa, for an even greater measure, may verses not thought out previously occur to you.\" \"Yes, Venerable Sir,\" Venerable Vaṅgīsa, having assented to the Blessed One, for an even greater measure, praised the Blessed One with verses not thought out previously:\n\nHaving conquered the path of Mara's deviation, he walks having broken through all hindrances. Behold him, the one who liberates from bonds, the untainted one, distinguishing things part by part. For the crossing over of the flood, he has proclaimed the manifold path. And in that Deathless thus proclaimed, those who discern the Dhamma stand unshakeable. The bringer of light, having thoroughly penetrated, saw the transcendence of all standings. Having known and realized it for himself, he taught the supreme Dhamma to all beings. In such a well-taught Dhamma, what heedlessness can there be for those who discern the Dhamma? Therefore, in the Dispensation of that Blessed One, one should always train diligently with reverence.",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවනාරාමයේ අනාථපිණ්ඩික සිටුතුමාගේ ආරාමයේ, දොළොස්සිය පනහක් වූ මහත් භික්‍ෂුසංඝයා සමඟ වැඩසිටිනා සේක. ඒ අවස්ථාවේ භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් වහන්සේලාට නිවනට සම්බන්ධ ධර්‍ම කථාවකින් කරුණු පෙන්වමින්, සමාදන් කරවමින්, උද්යෝගිමත් කරවමින්, සතුටු කරවමින් සිටි සේක. එම භික්‍ෂූහු සිත් අටියෙන් (හදවතින්ම) සිතෙහි ධාරණය කරගෙන, සියලු චේතනාවන් එකට ගොනුකොට, ඇහුම්කන් දීමට කැප වූ සිත් ඇතිව, ධර්‍මය ශ්‍රවණය කළහ.\n\nඑවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට මෙවැනි අදහසක් පහළ විය – ‘‘මේ භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් වහන්සේලාට නිවනට සම්බන්ධ ධර්‍ම කථාවකින් කරුණු පෙන්වමින්, සමාදන් කරවමින්, උද්යෝගිමත් කරවමින්, සතුටු කරවමින් සිටින සේක. එම භික්‍ෂූහු සිත් අටියෙන් සිතෙහි ධාරණය කරගෙන, සියලු චේතනාවන් එකට ගොනුකොට, ඇහුම්කන් දීමට කැප වූ සිත් ඇතිව, ධර්‍මය ශ්‍රවණය කරති. මම භාග්‍යවතුන් වහන්සේට මුහුණට මුහුණලා, උන්වහන්සේට සුදුසු ගාථාවලින් ප්‍රශංසා කළොත් හොඳයි නේද?’’\n\nඉන්පසු ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ ආසනයෙන් නැගිට, උතුරුසළුව එක අංසයකට (එක් උරහිසකට) කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටි දෙසට දොහොත් මුදුන් තබා, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක – ‘‘භාග්‍යවතුන් වහන්ස, මට (ගාථා කීමට) හැකියාව පහළ වෙයි, සුගතයන් වහන්ස, මට (ගාථා කීමට) හැකියාව පහළ වෙයි!’’\n\n‘‘වංගීසය, ඔබට හැකියාව පහළ වේවා!’’ යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\nඑවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මුහුණට මුහුණලා, උන්වහන්සේට සුදුසු ගාථාවලින් ප්‍රශංසා කළ සේක:\n“දහසකට වැඩි භික්‍ෂූහු, සුගතයන් වහන්සේ වටකරගෙන සිටිති;\nකෙලෙස් රහිත වූ, භය රහිත වූ නිර්‍වාණය නම් ධර්‍මය දේශනා කරන සේක.\n‘‘මනහර වූ, සම්මා සම්බුදුන් වහන්සේ විසින් දේශනා කරන ලද ධර්‍මය ශ්‍රවණය කරති;\nභික්‍ෂුසංඝයා පෙරටුකොට ගත් සම්බුදුන් වහන්සේ සැබවින්ම ශෝභමාන වන සේක.\n‘‘භාග්‍යවතුන් වහන්ස, ඔබවහන්සේ නාගයන්ගෙන් උතුම් වූ නාගයෙකි (ශ්‍රේෂ්ඨ පුරුෂයෙකි), ඍෂිවරුන් අතර සත්ත්වයන්ට හිතසුව පිණිස අතිශයින් උතුම් වූ ඍෂිවරයෙකි;\nමහා මේඝයක් මෙන්, ශ්‍රාවකයන් සිසිලසින් තෙමන සේක.\n‘‘මහා වීරයන් වහන්ස, ඔබවහන්සේගේ ශ්‍රාවකයෙකු වන වංගීස මම, දිවා විහරණයෙන් නික්ම, ශාස්තෘන් වහන්සේ දැකීමේ කැමැත්තෙන්, ඔබවහන්සේගේ දෙපා වඳිමි.”\n\n‘‘වංගීසය, මේ ගාථා පෙර ඔබ විසින් සිතා බලා සකස් කළ ඒවාද, නැතහොත් මේ මොහොතේදීම ඔබට පහළ වූ ඒවාද?’’\n\n‘ස්වාමීනි, මේ ගාථා පෙර මා විසින් සිතා බලා සකස් කළ ඒවා නොවේ, මේ මොහොතේදීම මට පහළ වූ ඒවාය’.\n\n‘එසේ නම් වංගීසය, පෙර සිතා බලා සකස් නොකළ ගාථා ඊටත් වඩා ඔබට පහළ වේවා!’\n\n‘එසේය, ස්වාමීනි’යි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට ප්‍රතිඥා දී, ඊටත් වඩා පෙර සිතා බලා සකස් නොකළ ගාථාවලින් භාග්‍යවතුන් වහන්සේට ප්‍රශංසා කළ සේක:\n\n‘‘මාරයාගේ වැරදි මාර්ගය යටපත් කොට, (සිතේ) කටු බිඳ දමා, (ඒ බුදුරජාණන් වහන්සේ) හැසිරෙන සේක;\nඒ බන්ධනවලින් මුදවන, ආශා රහිත වූ, (ධර්‍මය) කොටස් වශයෙන් බෙදා වදාළ උන්වහන්සේ දෙස බලන්න.\n‘‘(සංසාර) ඕඝයෙන් එතෙර වීම පිණිස, නොයෙක් ආකාර මාර්ගයන් දේශනා කළ සේක;\nඒ අමරණීය නිර්‍වාණය දේශනා කරන කල්හි, ධර්‍මය දැක්කවුන් නොසෙල්වී (ඒ මත) පිහිටා සිටිති.\n‘‘ආලෝකය පහළ කරමින්, සියලු (සංසාරික) ස්ථිතීන් අතික්‍රමණය කරනු දුටු සේක;\n(ඒ සත්‍යය) දැන, එය ප්‍රත්‍යක්‍ෂ කොට, උන්වහන්සේ දශදිශාවේ සිටින අයට අග්‍ර වූ ධර්‍මය දේශනා කළ සේක.\n‘‘මෙසේ මැනවින් දේශනා කරන ලද ධර්‍මයෙහි, ධර්‍මය දන්නා අයට කවර නම් ප්‍රමාදයක්ද?\nඑබැවින් භාග්‍යවතුන් වහන්සේගේ ඒ ශාසනයෙහි, අප්‍රමාදීව, නිතර නමස්කාර කරමින් පුරුදු විය යුතුයි.’’",
      "paliTitle": "Parosahassasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on More Than a Thousand",
      "sinhalaTitle": "පරෝසහස්ස සූත්‍රය"
    },
    {
      "number": 217,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho āyasmā aññāsikoṇḍañño [aññākoṇḍañño (sī. syā. kaṃ.)] sucirasseva yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato pādesu sirasā nipatitvā bhagavato pādāni mukhena ca paricumbati, pāṇīhi ca parisambāhati, nāmañca sāveti – ‘‘koṇḍaññohaṃ, bhagavā, koṇḍaññohaṃ, sugatā’’ti. Atha kho āyasmato vaṅgīsassa etadahosi – ‘‘ayaṃ kho āyasmā aññāsikoṇḍañño sucirasseva yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato pādesu sirasā nipatitvā bhagavato pādāni mukhena ca paricumbati, pāṇīhi ca parisambāhati, nāmañca sāveti – ‘koṇḍaññohaṃ, bhagavā, koṇḍaññohaṃ, sugatā’ti. Yaṃnūnāhaṃ āyasmantaṃ aññāsikoṇḍaññaṃ bhagavato sammukhā sāruppāhi gāthāhi abhitthaveyya’’nti. Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘paṭibhāti maṃ, bhagavā, paṭibhāti maṃ, sugatā’’ti. ‘‘Paṭibhātu taṃ, vaṅgīsā’’ti bhagavā avoca. Atha kho āyasmā vaṅgīso āyasmantaṃ aññāsikoṇḍaññaṃ bhagavato sammukhā sāruppāhi gāthāhi abhitthavi – ‘‘Buddhānubuddho so thero, koṇḍañño tibbanikkamo; Lābhī sukhavihārānaṃ, vivekānaṃ abhiṇhaso. ‘‘Yaṃ sāvakena pattabbaṃ, satthusāsanakārinā; Sabbassa taṃ anuppattaṃ, appamattassa sikkhato. ‘‘Mahānubhāvo tevijjo, cetopariyāyakovido; Koṇḍañño buddhadāyādo [buddhasāvako (pī.)], pāde vandati satthuno’’ti.",
      "english": "At one time, the Blessed One was staying at Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. Then, after a long time, the venerable Aññāsikoṇḍañña approached the Blessed One. Having approached, he prostrated with his head at the Blessed One's feet, kissed the Blessed One's feet with his mouth, stroked them with his hands, and announced his name, saying, \"I am Koṇḍañña, O Blessed One! I am Koṇḍañña, O Fortunate One!\"\n\nThen it occurred to the venerable Vaṅgīsa: \"This venerable Aññāsikoṇḍañña has, after a long time, approached the Blessed One. Having approached, he prostrated with his head at the Blessed One's feet, kissed the Blessed One's feet with his mouth, stroked them with his hands, and announced his name, saying, 'I am Koṇḍañña, O Blessed One! I am Koṇḍañña, O Fortunate One!' How would it be if I were to praise the venerable Aññāsikoṇḍañña with fitting verses in the presence of the Blessed One?\" Then the venerable Vaṅgīsa rose from his seat, arranged his upper robe over one shoulder, and, with clasped hands raised towards the Blessed One, spoke to the Blessed One thus: \"I am inspired, O Blessed One! I am inspired, O Fortunate One!\" \"May you be inspired, Vaṅgīsa,\" the Blessed One said. Then the venerable Vaṅgīsa praised the venerable Aññāsikoṇḍañña with fitting verses in the presence of the Blessed One:\n\n\"That elder, Koṇḍañña, the one who realized after the Buddha, is of keen exertion. He constantly gains the pleasant abidings of seclusion. Whatever should be attained by a disciple who acts in accordance with the Teacher's instruction, all that has been attained by him who trains diligently. Koṇḍañña, possessing great spiritual might, endowed with the three knowledges, skilled in penetrating the minds of others, an heir of the Buddha, bows at the Teacher's feet.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් කළඳක නිවාපයේ වැඩසිටින සේක. එවිට ආයුෂ්මත් අඤ්ඤාසිකොණ්ඩඤ්ඤ ස්ථවිරයන් වහන්සේ බොහෝ කලකට පසු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේගේ දෙපාමුල හිසින් වැටී, භාග්‍යවතුන් වහන්සේගේ දෙපා මුඛයෙන් සිඹ, දෑතින් පිරිමැද, ‘‘භාග්‍යවතුන් වහන්ස, මම කොණ්ඩඤ්ඤයි; සුගතයන් වහන්ස, මම කොණ්ඩඤ්ඤයි’’යි තමන්ගේ නම සැල කළහ.\n\nඑවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: ‘‘මෙම ආයුෂ්මත් අඤ්ඤාසිකොණ්ඩඤ්ඤ ස්ථවිරයන් වහන්සේ බොහෝ කලකට පසු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේගේ දෙපාමුල හිසින් වැටී, උන්වහන්සේගේ දෙපා මුඛයෙන් සිඹ, දෑතින් පිරිමැද, ‘‘භාග්‍යවතුන් වහන්ස, මම කොණ්ඩඤ්ඤයි; සුගතයන් වහන්ස, මම කොණ්ඩඤ්ඤයි’’යි තමන්ගේ නම සැල කළහ. මා භාග්‍යවතුන් වහන්සේ ඉදිරියේ ආයුෂ්මත් අඤ්ඤාසිකොණ්ඩඤ්ඤ ස්ථවිරයන් වහන්සේ සුදුසු ගාථාවලින් අභිත්ථවය කරන්නේ නම් ඉතා යෙහෙකැයි.\"\n\nඑවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ අසුනෙන් නැගිට, ඒකාංශ කොට උතුරුසළුව පොරවා, භාග්‍යවතුන් වහන්සේ දෙසට ඇඳිලි බැඳ, භාග්‍යවතුන් වහන්සේට මෙසේ සැළ කළහ: ‘‘භාග්‍යවතුන් වහන්ස, මට වැටහේ. සුගතයන් වහන්ස, මට වැටහේ’’යැයි. ‘‘වංගීසයෙනි, ඔබට වැටහේවා!’’යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\nඑවිට ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ ඉදිරියේ ආයුෂ්මත් අඤ්ඤාසිකොණ්ඩඤ්ඤ ස්ථවිරයන් වහන්සේ සුදුසු ගාථාවලින් අභිත්ථවය කළහ:\nඒ කොණ්ඩඤ්ඤ ස්ථවිරයන් වහන්සේ බුදුරදුන් අනු දැනගත් නුවණැත්තෙකි. තියුණු වීර්යය ඇත්තෙකි. නිතර විවේකයෙන් යුක්ත වූ සුඛවිහරණ ලාභී ය.\n\nශාස්තෘන් වහන්සේගේ අවවාද පිළිපදින්නා වූ, අප්‍රමාදව හික්මෙන්නා වූ ශ්‍රාවකයෙකු විසින් යමක් පැමිණිය යුතු ද, ඒ සියල්ල ඔහු විසින් අනුප්‍රාප්ත කරන ලද්දකි.\n\nමහත් ආනුභාව සම්පන්න, තේවිද්‍යා ලාභී, චේතෝපරිය ඤාණයෙහි දක්ෂ වූ ඒ කොණ්ඩඤ්ඤ ස්ථවිරයන් වහන්සේ බුදුරදුන්ගේ ධර්ම දායාද ඇත්තෙකි. ශාස්තෘන් වහන්සේගේ පාද වන්දනා කරන්නේ ය.",
      "paliTitle": "Koṇḍaññasuttaṃ",
      "vagga": "",
      "englishTitle": "To Koṇḍañña Sutta",
      "sinhalaTitle": "කොණ්ඩඤ්ඤ සූත්‍රය"
    },
    {
      "number": 218,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati isigilipasse kāḷasilāyaṃ mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi sabbeheva arahantehi. Tesaṃ sudaṃ āyasmā mahāmoggallāno cetasā cittaṃ samannesati [samanvesati (syā. aṭṭha.)] vippamuttaṃ nirupadhiṃ. Atha kho āyasmato vaṅgīsassa etadahosi – ‘‘ayaṃ kho bhagavā rājagahe viharati isigilipasse kāḷasilāyaṃ mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi sabbeheva arahantehi. Tesaṃ sudaṃ āyasmā mahāmoggallāno cetasā cittaṃ samannesati vippamuttaṃ nirupadhiṃ. Yaṃnūnāhaṃ āyasmantaṃ mahāmoggallānaṃ bhagavato sammukhā sāruppāhi gāthāhi abhitthaveyya’’nti. Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘paṭibhāti maṃ, bhagavā, paṭibhāti maṃ, sugatā’’ti. ‘‘Paṭibhātu taṃ, vaṅgīsā’’ti bhagavā avoca. Atha kho āyasmā vaṅgīso āyasmantaṃ mahāmoggallānaṃ bhagavato sammukhā sāruppāhi gāthāhi abhitthavi – ‘‘Nagassa passe āsīnaṃ, muniṃ dukkhassa pāraguṃ; Sāvakā payirupāsanti, tevijjā maccuhāyino. ‘‘Te cetasā anupariyeti [anupariyesati (sī. syā. kaṃ.)], moggallāno mahiddhiko; Cittaṃ nesaṃ samannesaṃ [samanvesaṃ (syā. aṭṭha.)], vippamuttaṃ nirūpadhiṃ. ‘‘Evaṃ sabbaṅgasampannaṃ, muniṃ dukkhassa pāraguṃ; Anekākārasampannaṃ, payirupāsanti gotama’’nti.",
      "english": "On one occasion, the Blessed One was dwelling in Rājagaha at Kāḷasila on Isigili Mountain, together with a large community of monastics, approximately five hundred monastics, all of whom were Arahants. And among them, the Venerable Mahāmoggallāna was discerning with his mind those minds that were completely liberated and free from any basis for future existence.\n\nThen it occurred to the Venerable Vaṅgīsa: \"Here, indeed, the Blessed One is dwelling in Rājagaha at Kāḷasila on Isigili Mountain, together with a large monastic community, approximately five hundred monastics, all of whom are Arahants. And among them, the Venerable Mahāmoggallāna is discerning with his mind those minds that are completely liberated and free from any basis for future existence. What if I were to praise the Venerable Mahāmoggallāna with fitting verses in the presence of the Blessed One?\" Then the Venerable Vaṅgīsa rose from his seat, arranged his upper robe over one shoulder, paid homage to the Blessed One with joined palms, and said to the Blessed One, \"It occurs to me, Blessed One! It occurs to me, Fortunate One!\" \"Let it occur to you, Vaṅgīsa!\" said the Blessed One.\n\nThen the Venerable Vaṅgīsa praised the Venerable Mahāmoggallāna with fitting verses in the presence of the Blessed One:\n\"Seated at the mountain's side is the Sage, who has gone beyond suffering.\nHis disciples attend upon him, possessing the three knowledges, having transcended death.\nMoggallāna, the greatly potent one, surveys them with his mind,\nDiscerning their minds, completely liberated, free from any basis for future existence.\nThus, they attend upon Gotama, the Sage who has gone beyond suffering,\nEndowed with all excellent qualities, endowed with many excellent attributes.\"",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ඉසිගිලි පර්වත පාමුල පිහිටි කාලශෛල නම් කළුගල් පර්වතයෙහි, පන්සියයක් පමණ රහතන් වහන්සේලා ඇතුළු මහත් වූ භික්ෂුසංඝයා වහන්සේලා සමඟ වැඩවසමින් සිටියාහ. ඒ භික්ෂුසංඝයා වහන්සේලාගේ විමුක්ත වූ, උපධි රහිත වූ සිත්, ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ සිතින් විමසමින් සිටියාහ. එකල්හි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට මෙබඳු අදහසක් පහළ විය: “භාග්‍යවතුන් වහන්සේ රජගහ නුවර ඉසිගිලි පර්වත පාමුල පිහිටි කාලශෛල නම් කළුගල් පර්වතයෙහි, පන්සියයක් පමණ රහතන් වහන්සේලා ඇතුළු මහත් වූ භික්ෂුසංඝයා වහන්සේලා සමඟ වැඩවසන සේක. ඒ භික්ෂුසංඝයා වහන්සේලාගේ විමුක්ත වූ, උපධි රහිත වූ සිත්, ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ සිතින් විමසමින් සිටින සේක. මම භාග්‍යවතුන් වහන්සේ ඉදිරියේ දී ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේට ගැලපෙන ගාථාවලින් ප්‍රශංසා කළොත් හොඳයි නේද?” එකල්හි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ හුනස්නෙන් නැගිට, උතුරුසළුව තනිපටක් කොට පොරවා, භාග්‍යවතුන් වහන්සේ වෙත දොහොත් මුදුන් තබා, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “භාග්‍යවතුන් වහන්ස, මට එය වැටහේ. සුගතයන් වහන්ස, මට එය වැටහේ.” “වංගීස, ඔබට එය වැටහේවා!” යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. එකල්හි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ, භාග්‍යවතුන් වහන්සේ ඉදිරියේ දී ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේට ගැලපෙන ගාථාවලින් ප්‍රශංසා කළ සේක.\n\nකන්දක් අසල වැඩසිටින, දුකෙන් එතෙර වූ ඒ මුනිවරයාණන් වහන්සේ වටකරගෙන, ත්‍රිවිද්‍යාවට පැමිණි, මරණය අත්හළ ශ්‍රාවකයෝ ඇසුරු කරති. මහා ඉර්ධිමත් මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ, (ඒ ශ්‍රාවකයන් වහන්සේලාගේ) විමුක්ත වූ, උපධි රහිත වූ සිත් විමසමින්, සිතින් ඔවුන් පසුපස යමින් (ඔවුන්ගේ සිත් පිරිසිඳ බලති). මෙසේ සියලු අංගයන්ගෙන් සම්පූර්ණ වූ, දුකෙන් එතෙර වූ, බොහෝ අයුරින් සම්පූර්ණ වූ ඒ මුනි ගෝතමයන් වහන්සේට ඔවුහු ඇසුරු කරති.",
      "paliTitle": "Moggallānasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Moggallāna",
      "sinhalaTitle": "මොග්ගල්ලාන සූත්‍රය"
    },
    {
      "number": 219,
      "pali": "Ekaṃ samayaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi sattahi ca upāsakasatehi sattahi ca upāsikāsatehi anekehi ca devatāsahassehi. Tyāssudaṃ bhagavā atirocati [ativirocati (ka.)] vaṇṇena ceva yasasā ca. Atha kho āyasmato vaṅgīsassa etadahosi – ‘‘ayaṃ kho bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi sattahi ca upāsakasatehi sattahi ca upāsikāsatehi anekehi ca devatāsahassehi. Tyāssudaṃ bhagavā atirocati vaṇṇena ceva yasasā ca. Yaṃnūnāhaṃ bhagavantaṃ sammukhā sāruppāya gāthāya abhitthaveyya’’nti. Atha kho āyasmā vaṅgīso uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘paṭibhāti maṃ, bhagavā, paṭibhāti maṃ, sugatā’’ti. ‘‘Paṭibhātu taṃ, vaṅgīsā’’ti bhagavā avoca. Atha kho āyasmā vaṅgīso bhagavantaṃ sammukhā sāruppāya gāthāya abhitthavi – ‘‘Cando yathā vigatavalāhake nabhe, Virocati vigatamalova bhāṇumā; Evampi aṅgīrasa tvaṃ mahāmuni, Atirocasi yasasā sabbaloka’’nti.",
      "english": "At one time, the Blessed One was dwelling in Campā, on the bank of the Gaggara Pond, together with a large community of monks, consisting of five hundred monks, and seven hundred male lay followers, and seven hundred female lay followers, and many thousands of devas. And among them, the Blessed One indeed outshone all others in both radiance and glory.\n\nThen indeed, it occurred to Venerable Vaṅgīsa: \"Here, the Blessed One is dwelling in Campā, on the bank of the Gaggara Pond, together with a large community of monks, consisting of five hundred monks, and seven hundred male lay followers, and seven hundred female lay followers, and many thousands of devas. And among them, the Blessed One indeed outshines all others in both radiance and glory. What if I were to eulogize the Blessed One in his presence with a suitable verse?\"\n\nThen Venerable Vaṅgīsa, rising from his seat, arranging his upper robe over one shoulder, and respectfully saluting the Blessed One with clasped hands, said this to the Blessed One: \"I am inspired, Blessed One! I am inspired, Well-Farer!\"\n\n\"Let it inspire you, Vaṅgīsa,\" said the Blessed One.\n\nThen Venerable Vaṅgīsa eulogized the Blessed One in his presence with a suitable verse:\n\"Just as the moon shines in a cloudless sky,\nAnd the radiant sun, free from all impurity;\nEven so, Angīrasa, you, the Great Sage,\nOutshine the entire world in glory.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ චම්පා නුවර ගග්ගරා පොකුණ අසල වැඩසිටින සේක, මහත් භික්ෂු සංඝයා පිරිවරාගෙන; පන්සියයක් පමණ භික්ෂූන් වහන්සේලා ද, හත්සියයක් පමණ උපාසකවරුන් ද, හත්සියයක් පමණ උපාසිකාවන් ද, බොහෝ දහස් ගණන් දෙවිවරුන් ද සමඟින්. එහිදී භාග්‍යවතුන් වහන්සේ වර්ණයෙන් ද, යසසින් ද යන දෙකින්ම අතිශයින් දීප්තිමත්ව බැබලූ සේක.\n\nඑවේලෙහි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේට මෙබඳු අදහසක් පහළ විය: “මේ භාග්‍යවතුන් වහන්සේ චම්පා නුවර ගග්ගරා පොකුණ අසල වැඩසිටින සේක, මහත් භික්ෂු සංඝයා පිරිවරාගෙන; පන්සියයක් පමණ භික්ෂූන් වහන්සේලා ද, හත්සියයක් පමණ උපාසකවරුන් ද, හත්සියයක් පමණ උපාසිකාවන් ද, බොහෝ දහස් ගණන් දෙවිවරුන් ද සමඟින්. එහිදී භාග්‍යවතුන් වහන්සේ වර්ණයෙන් ද, යසසින් ද යන දෙකින්ම අතිශයින් දීප්තිමත්ව බැබලූ සේක. මා විසින් භාග්‍යවතුන් වහන්සේට මුහුණට මුහුණ ලා සුදුසු ගාථාවකින් ප්‍රශංසා කළහොත් ඉතා යෙහෙකැයි.” එවේලෙහි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ ආසනයෙන් නැගිට, උතුරුසළුව එක අංසයක් මතට දමා, භාග්‍යවතුන් වහන්සේ වැඩසිටි දෙසට දොහොත් මුදුන් දී නමස්කාර කර, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක: “ස්වාමීනි භාග්‍යවතුන් වහන්ස, මට පහළ වේ. සුගතයන් වහන්ස, මට පහළ වේ.” “වංගීසය, ඔබට පහළ වේවා!”යි භාග්‍යවතුන් වහන්සේ වදාළ සේක. එවේලෙහි ආයුෂ්මත් වංගීස ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මුහුණට මුහුණ ලා සුදුසු ගාථාවකින් ප්‍රශංසා කළ සේක: “වලාකුළු පහව ගිය අහසෙහි සඳ මෙන්, කිසිඳු කිලිටකින් තොරව හිරු බබලන්නාක් මෙන්, අංගීරසයන් වහන්ස, එසේම ඔබ මහාමුනිවරයාණෝ යසසින් සමස්ත ලෝකයා අභිබවා බබලන සේක.”",
      "paliTitle": "Gaggarāsuttaṃ",
      "vagga": "",
      "englishTitle": "At Gaggara Sutta",
      "sinhalaTitle": "ගග්ගරා සූත්‍රය"
    },
    {
      "number": 220,
      "pali": "Ekaṃ samayaṃ āyasmā vaṅgīso sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā vaṅgīso aciraarahattappatto hutvā [hoti (sī. syā. kaṃ.)] vimuttisukhaṃ paṭisaṃvedī [vimuttisukhapaṭisaṃvedī (sī. pī.)] tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Kāveyyamattā vicarimha pubbe, gāmā gāmaṃ purā puraṃ; Athaddasāma sambuddhaṃ, saddhā no upapajjatha. ‘‘So me dhammamadesesi, khandhāyatanadhātuyo [khandhe āyatanāni dhātuyo (syā. kaṃ. pī. ka.)]; Tassāhaṃ dhammaṃ sutvāna, pabbajiṃ anagāriyaṃ. ‘‘Bahunnaṃ vata atthāya, bodhiṃ ajjhagamā muni; Bhikkhūnaṃ bhikkhunīnañca, ye niyāmagataddasā. ‘‘Svāgataṃ vata me āsi, mama buddhassa santike; Tisso vijjā anuppattā, kataṃ buddhassa sāsanaṃ. ‘‘Pubbenivāsaṃ jānāmi, dibbacakkhuṃ visodhitaṃ; Tevijjo iddhipattomhi, cetopariyāyakovido’’ti.",
      "english": "At one time, the Venerable Vaṅgīsa was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. And at that time, the Venerable Vaṅgīsa, having recently attained arahantship, was experiencing the bliss of liberation. At that moment, he uttered these verses:\n\nPreviously, intoxicated by poetry, we used to wander from village to village, from town to town. Then we saw the Fully Enlightened One, and faith arose in us.\n\nHe taught me the Dhamma concerning the aggregates, sense bases, and elements. Having heard his Dhamma, I went forth into homelessness.\n\nIndeed, for the welfare of many, the Sage attained awakening — for monks and for nuns, who have seen the path to liberation.\n\nIndeed, it was well-come for me in the presence of my Buddha. The three knowledges have been attained; the Buddha's teaching has been accomplished.\n\nI know my past existences; the divine eye has been purified. I am one who has attained the three knowledges and psychic powers, and I am skilled in knowing others' minds.",
      "sinhala": "එක් සමයෙක ආය<b>ෂ්ම</b>ත් වංගීස ස්ථවිරයන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසති. එකල්හි ආය<b>ෂ්ම</b>ත් වංගීස ස්ථවිරයන් වහන්සේ රහත්බවට පැමිණ වැඩි කලක් ගත නොවී, විමු<b>ක්ති</b> සුවය අනුභව කරමින්, ඒ අවස්ථාවෙහි මේ ගාථා ප්‍රකාශ කළ සේක.\n\n‘‘පෙර අපි කාව්‍ය ශාස්ත්‍රයෙහි මත් වූවෝ ගමෙන් ගමට, නගරයෙන් නගරයට හැසිරුණෙමු. ඉන්පසු අපි සම්බුදුරජාණන් වහන්සේ දැකගත්තෙමු; අපට ශ්‍ර<b>ද්ධා</b>ව ඇතිවිය.\n\n‘‘උන්වහන්සේ මට <b>ස්කන්ධ</b>, ආයතන සහ ධාතු පිළිබඳ ධර්මය දේශනා කළ සේක. මම ඒ ධර්මය අසා ගිහිගෙයින් නික්ම පැවිදි වීමි.\n\n‘‘ඒ මුනිවරයා බොහෝ දෙනාගේ යහපත පිණිස, භි<b>ක්ෂූ</b>න් වහන්සේලාටත්, භි<b>ක්ෂු</b>ණීන් වහන්සේලාටත්, නි<b>යත</b> මාර්ගය දුටු අයටත්, බුදුබවට පැමිණියේය.\n\n‘‘බුදුරජාණන් වහන්සේගේ සන්<b>නිධා</b>නයට මාගේ පැමිණීම ඉතා යහපත් විය. ත්‍රිවි<b>ද්‍යා</b>වෝ අනුප්‍රා<b>ප්ත</b>ය; බුදුරජාණන් වහන්සේගේ ශාසනයෙහි කටයුතු නිම කරන ලදී.\n\n‘‘පෙර විසූ කඳපිළිවෙළ දැනගනිමි; දි<b>ව්‍ය</b> ච<b>ක්ෂු</b>ස විශු<b>ද්ධ</b> කරන ලදී. මම ත්‍රිවි<b>ද්‍යා</b>ලාභී වෙමි, සෘ<b>ද්ධි</b> ප්‍රා<b>ප්ත</b> වෙමි, අන් සිත් දැනීමේ ඥානයෙන් ද<b>ක්ෂ</b> වෙමි.",
      "paliTitle": "Vaṅgīsasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Vaṅgīsa",
      "sinhalaTitle": "වංගීස සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Vaṅgīsasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Nikkhantaṃ arati ceva, pesalā atimaññanā; Ānandena subhāsitā, sāriputtapavāraṇā; Parosahassaṃ koṇḍañño, moggallānena gaggarā; Vaṅgīsena dvādasāti.",
    "english": "The Linked Discourses with Vaṅgīsa is complete. The summary of it: Gone Out, Aversion, Gentle, Conceit; with Ānanda, Well Spoken, Sāriputta's Invitation; More than a Thousand, Koṇḍañña, with Moggallāna, Gaggarā; with Vaṅgīsa they are twelve.",
    "sinhala": "වංගීස සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: නික්ඛන්ත, අරති, පේසලා, අතිමඤ්ඤනා, ආනන්ද, සුභාසිත, සාරිපුත්ත පවාරණා, පරෝසහස්ස, කොණ්ඩඤ්ඤ, මොග්ගල්ලාන, ගග්ගරා සහ වංගීස යන සූත්‍ර දොළසයි."
  }
}