{
  "id": "sn.1.10",
  "title": {
    "pali": "Yakkhasaṃyuttaṃ",
    "english": "The Connected Discourses with Yakkhas",
    "sinhala": "යක්‍ෂ සංයුත්තය"
  },
  "sections": [
    {
      "number": 235,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati indakūṭe pabbate, indakassa yakkhassa bhavane. Atha kho indako yakkho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Rūpaṃ na jīvanti vadanti buddhā, kathaṃ nvayaṃ vindatimaṃ sarīraṃ; Kutassa aṭṭhīyakapiṇḍameti, kathaṃ nvayaṃ sajjati gabbharasmi’’nti. ‘‘Paṭhamaṃ kalalaṃ hoti, kalalā hoti abbudaṃ; Abbudā jāyate pesi, pesi nibbattatī ghano; Ghanā pasākhā jāyanti, kesā lomā nakhāpi ca. ‘‘Yañcassa bhuñjatī mātā, annaṃ pānañca bhojanaṃ; Tena so tattha yāpeti, mātukucchigato naro’’ti.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Rājagaha, on Indakūṭa Mountain, in the abode of the yakkha Indaka. Thereupon, the yakkha Indaka approached the Blessed One. Having approached, he addressed the Blessed One in verse:\n\n“The Buddhas declare that form is not a living entity. How then does this being attain this body? From where do its mass of bones and flesh arise? How then does this one become bound in the womb?”\n\n“First, there is a jelly-like substance. From the jelly, an amoeba-like substance comes into being. From the amoeba-like substance, a solid lump of flesh develops. From the lump of flesh, a firmer mass is produced. From the firmer mass, the limbs emerge, as well as hair, body-hair, and nails.\n\nWhatever food, drink, and nourishment the mother consumes for its sake, by that, the being residing in the mother’s womb sustains itself there.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර, ඉන්දකූට පර්වතයෙහි පිහිටි ඉන්දක නම් යක්ෂයාගේ භවනෙහි වැඩවසන සේක.\n\nඑවිට ඉන්දක යක්ෂයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. එළඹ, භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවේය:\n‘බුදුවරුන් වහන්සේලා වදාළේ රූපය (තනිව) ජීවයක් නොවන බවයි. එසේ නම් මේ ශරීරය කෙසේ ජීවය ලබන්නේද? මෙය ඇටසැකිල්ලක් බවට පත්වන්නේ කෙසේද? මෙය මවගේ ගර්භාශය තුළ කෙසේ හටගන්නේද?’\n\n‘මුලින්ම කලාලය (සිවි ගෙඩියක් බඳු තත්ත්වයක්) හටගනියි. කලාලයෙන් අබ්බුදය (බුබුලක් වැනි, ඝන වූ තත්ත්වයක්) හටගනියි. අබ්බුදයෙන් පෙසිය (මාංශ ගැබ්බක් බඳු තත්ත්වයක්) හටගනියි. පෙසියෙන් ඝනය (ඝන වූ ශරීර අවයව පැහැදිලි වන තත්ත්වයක්) හටගනියි. ඝනයෙන් අත් පා ආදී අඟපසඟ හටගනියි. එසේම කෙස්, ලොම්, නියපොතු ද හටගනියි.\n\nමව යම් අන්න, පාන, භෝජන (ආදී) ආහාර පාන වර්ග අනුභව කරන්නීද, මවගේ කුසෙහි සිටින ඒ සත්වයා ඒවායින් එහි යැපෙයි.’",
      "paliTitle": "Indakasuttaṃ",
      "vagga": ""
    },
    {
      "number": 236,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho sakkanāmako yakkho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Sabbaganthappahīnassa, vippamuttassa te sato; Samaṇassa na taṃ sādhu, yadaññamanusāsasī’’ti [yadaññamanusāsatīti (sī. syā. kaṃ. pī.)]. ‘‘Yena kenaci vaṇṇena, saṃvāso sakka jāyati; Na taṃ arahati sappañño, manasā anukampituṃ. ‘‘Manasā ce pasannena, yadaññamanusāsati; Na tena hoti saṃyutto, yānukampā [sānukampā (sī. pī.)] anuddayā’’ti.",
      "english": "At one time the Blessed One was dwelling in Rājagaha, on Gijjhakūṭa Mountain. Then a yakkha named Sakka approached the Blessed One; having approached, he addressed the Blessed One with a stanza:\n\n\"It is not proper for you, an ascetic, who has abandoned all ties and is fully liberated, that you instruct others.\"\n\n\"Sakka, by whatever form association arises, a wise person should not mentally feel compassion for that.\"\n\n\"But if one instructs others with a mind that is serene, one is not bound by that, which is compassion and sympathy.\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජුකුළු පර්වතයෙහි වැඩවසන සේක. ඉන්පසු සක්ක නම් යක්ෂයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවේය:\n\n\"සියලු බැඳීම් (ග්‍රන්ථ) මුළුමනින්ම දුරු කළ, මනා කොට නිදහස් වූ ඔබට, ශ්‍රමණයෙකුට, අනුන් හට අනුශාසනා කිරීම සුදුසු නොවේ.\"\n\n\"(එවිට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:) සක්ක, යම්කිසි ආකාරයකින් හෝ ඇසුරක් (සංවාසයක්) ඇතිවේ නම්, නුවණැත්තා සිතින් එයට අනුකම්පා කරමින් බැඳී සිටීම සුදුසු නොවේ.\"\n\n\"යම් හෙයකින් පහන් වූ සිතකින් අන්‍යයන්ට අනුශාසනා කරන්නේ නම්, (එවන් ශ්‍රමණයෙකු) ඒ අනුකම්පාව හෝ මහා කරුණාව නිසා කිසිදු බැඳීමකට පත් නොවේ.\"",
      "paliTitle": "Sakkanāmasuttaṃ",
      "vagga": ""
    },
    {
      "number": 237,
      "pali": "Ekaṃ samayaṃ bhagavā gayāyaṃ viharati ṭaṅkitamañce sūcilomassa yakkhassa bhavane. Tena kho pana samayena kharo ca yakkho sūcilomo ca yakkho bhagavato avidūre atikkamanti. Atha kho kharo yakkho sūcilomaṃ yakkhaṃ etadavoca – ‘‘eso samaṇo’’ti! ‘‘Neso samaṇo, samaṇako eso’’. ‘‘Yāva jānāmi yadi vā so samaṇo yadi vā pana so samaṇako’’ti. Atha kho sūcilomo yakkho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato kāyaṃ upanāmesi. Atha kho bhagavā kāyaṃ apanāmesi. Atha kho sūcilomo yakkho bhagavantaṃ etadavoca – ‘‘bhāyasi maṃ samaṇā’’ti? ‘‘Na khvāhaṃ taṃ, āvuso, bhāyāmi; api ca te samphasso pāpako’’ti. ‘‘Pañhaṃ taṃ, samaṇa pucchissāmi. Sace me na byākarissasi, cittaṃ vā te khipissāmi, hadayaṃ vā te phālessāmi, pādesu vā gahetvā pāragaṅgāya [pāraṃ gaṅgāya (ka.)] khipissāmī’’ti. ‘‘Na khvāhaṃ taṃ, āvuso, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya, yo me cittaṃ vā khipeyya hadayaṃ vā phāleyya pādesu vā gahetvā pāragaṅgāya khipeyya; api ca tvaṃ, āvuso, puccha yadā kaṅkhasī’’ti. Atha kho sūcilomo yakkho bhagavantaṃ gāthāya ajjhabhāsi – ( ) [(atha kho sūcilomo yakkho bhagavantaṃ gāthāya ajjhabhāsi.) (sī.)] ‘‘Rāgo ca doso ca kutonidānā, Aratī ratī lomahaṃso kutojā; Kuto samuṭṭhāya manovitakkā, Kumārakā dhaṅkamivossajantī’’ti. ‘‘Rāgo ca doso ca itonidānā, Aratī ratī lomahaṃso itojā; Ito samuṭṭhāya manovitakkā, Kumārakā dhaṅkamivossajanti. ‘‘Snehajā attasambhūtā, nigrodhasseva khandhajā; Puthū visattā kāmesu, māluvāva vitatā [vitthatā (syā. kaṃ.)] vane. ‘‘Ye naṃ pajānanti yatonidānaṃ, Te naṃ vinodenti suṇohi yakkha; Te duttaraṃ oghamimaṃ taranti, Atiṇṇapubbaṃ apunabbhavāyā’’ti.",
      "english": "At one time, the Blessed One was dwelling in Gaya, at the Stone Couch, in the abode of the yakkha Sūciloma. Now at that time, the yakkha Khara and the yakkha Sūciloma were passing by not far from the Blessed One. Then the yakkha Khara said to the yakkha Sūciloma, \"That is an ascetic!\" \"He is not an ascetic; he is a mere shaveling.\" \"I shall find out whether he is an ascetic or a mere shaveling.\" Then the yakkha Sūciloma approached the Blessed One; having approached, he brought his body close to the Blessed One's body. Then the Blessed One moved His body away. Then the yakkha Sūciloma said to the Blessed One, \"Are you afraid of me, ascetic?\" \"No, friend, I am not afraid of you; but your touch is repulsive.\" \"Ascetic, I shall ask you a question. If you do not answer me, I shall scatter your mind, or burst your heart, or take you by the feet and throw you across the Ganges!\" \"No, friend, I do not see anyone in this world with its devas, Māras, and Brahmās, with its ascetics and brahmins, its gods and humans, who could scatter my mind, or burst my heart, or take me by the feet and throw me across the Ganges. However, friend, ask whatever you wish.\" Then the yakkha Sūciloma addressed the Blessed One with a verse:\n\n\"From where do lust and hatred originate? From where are discontent, contentment, and horripilation born? From where do mental thoughts arise, like boys idly throwing at crows?\"\n\n\"Lust and hatred originate from within; discontent, contentment, and horripilation are born from within; from within mental thoughts arise, like boys idly throwing at crows.\"\n\n\"Born from craving, self-originated, like shoots sprouting from the trunk of a banyan tree, they spread widely, clinging to sensual pleasures, like the māluvā creeper spreading throughout the forest.\"\n\n\"Those who understand their origin eliminate them, listen, yakkha. They cross this flood, difficult to cross, a crossing never made before, for the non-recurrence of becoming.\"",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ ගයා නුවර ටංකිත මඤ්ච නම් වූ සූචිලෝම යක්ෂයාගේ භවනෙහි වැඩසිටියාහ.\n\nඑවිට ඛර යක්ෂයා ද සූචිලෝම යක්ෂයා ද භාග්‍යවතුන් වහන්සේට නුදුරින් ගමන් කරමින් සිටියාහ. එකල්හි ඛර යක්ෂයා සූචිලෝම යක්ෂයාට මෙසේ කීවේය: \"මේ ශ්‍රමණයෙකි!\"\n\n\"නොවේ, මේ ශ්‍රමණයෙක් නොවේ, මොහු ශ්‍රමණකයෙකි.\"\n\n\"මොහු ශ්‍රමණයෙක් ද නැතහොත් ශ්‍රමණකයෙක් ද කියා මම දැනගනිමි.\"\n\nඑකල්හි සූචිලෝම යක්ෂයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේගේ ශරීරය අසලට එබුවේය. එකල්හි භාග්‍යවතුන් වහන්සේ ශරීරය ඉවත් කළ සේක. එකල්හි සූචිලෝම යක්ෂයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ශ්‍රමණය, ඔබ මට බියද?\"\n\n\"මිත්‍රය, මම ඔබට බිය නොවෙමි; නමුත් ඔබේ ස්පර්ශය අප්‍රසන්නය.\"\n\n\"ශ්‍රමණය, මම ඔබගෙන් ප්‍රශ්නයක් අසමි. යම් හෙයකින් ඔබ මට පිළිතුරු නොදෙන්නේ නම්, මම ඔබේ සිත අවුල් කරන්නෙමි, නැතහොත් ඔබේ හදවත පැළ කරන්නෙමි, නැතහොත් පාදවලින් අල්ලා ගඟෙන් එතෙරට දමන්නෙමි.\"\n\n\"මිත්‍රය, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූ, දෙවි මිනිසුන් සහිත වූ මේ ලෝකයේ මගේ සිත අවුල් කිරීමට, නැතහොත් මගේ හදවත පැළ කිරීමට, නැතහොත් පාදවලින් අල්ලා ගඟෙන් එතෙරට දැමීමට සමත් කිසිවෙක් මම නොදකිමි; එහෙත් මිත්‍රය, ඔබ කැමති නම් අසන්න.\"\n\nඑකල්හි සූචිලෝම යක්ෂයා භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසීය:\n\n\"රාගය ද ද්වේෂය ද ඇතිවන්නේ කුමකින්ද? අරතිය ද රතිය ද ලෝමහංසය ද උපදින්නේ කුමකින්ද? කුමකින් හටගෙන දරුවන් කපුටන් එලවන්නා සේ මනෝවිතර්කයන් මුදාහරින්නේද?\"\n\n\"රාගය ද ද්වේෂය ද මෙයින් ඇතිවේ. අරතිය ද රතිය ද ලෝමහංසය ද මෙයින් උපදී. මෙයින් හටගෙන දරුවන් කපුටන් එලවන්නා සේ මනෝවිතර්කයන් මුදාහරී.\"\n\n\"ස්නේහයෙන් හටගත්තා වූ, තමා තුළින්ම උපන්නා වූ, නුගරුකේ අංකුර මෙන් පැතිරී යන, කාමයන්හි විසුරුණා වූ, වනයෙහි මාලුලතා මෙන් පැතිරී ගියා වූ (මේවා ඇතිවේ).\"\n\n\"යක්ෂය, මේවා කුමකින් හටගනී දැයි යමෙක් දන්නේ ද, ඔහු ඒවා දුරු කරයි, අසන්න. ඒ (දත්) පුද්ගලයෝ අත්නොහළ දුකසේ තරණය කළ යුතු මේ සංසාර සාගරය, නැවත භවයට නොඒම පිණිස තරණය කරති.\"",
      "paliTitle": "Sūcilomasuttaṃ",
      "vagga": ""
    },
    {
      "number": 238,
      "pali": "Ekaṃ samayaṃ bhagavā magadhesu viharati maṇimālike cetiye maṇibhaddassa yakkhassa bhavane. Atha kho maṇibhaddo yakkho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Satīmato sadā bhaddaṃ, satimā sukhamedhati; Satīmato suve seyyo, verā ca parimuccatī’’ti. ‘‘Satīmato sadā bhaddaṃ, satimā sukhamedhati; Satīmato suve seyyo, verā na parimuccati. ‘‘Yassa sabbamahorattaṃ [rattiṃ (syā. kaṃ. ka.)], ahiṃsāya rato mano; Mettaṃ so sabbabhūtesu, veraṃ tassa na kenacī’’ti.",
      "english": "Once, the Blessed One was dwelling in Magadha, at the Maṇimālaka shrine, in the abode of the yakkha Maṇibhadda. Then indeed, the yakkha Maṇibhadda approached the Blessed One. Having approached, he spoke this verse in the presence of the Blessed One: “For the mindful, there is always welfare; the mindful one progresses to happiness. For the mindful, tomorrow is better, and he is liberated from animosity.”\n\n“For the mindful, there is always welfare; the mindful one progresses to happiness. For the mindful, tomorrow is better, but he is not liberated from animosity. The one whose mind, throughout day and night, delights in harmlessness, who radiates loving-kindness towards all beings – for him, there is no animosity with anyone.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ මගධයෙහි මණිමාලක චෛත්‍යයෙහි, මණිබද්ධ යක්ෂයාගේ භවනෙහි වැඩවසන සේක. ඉක්බිති මණිබද්ධ යක්ෂයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව ප්‍රකාශ කළේය – ‘‘සිහි ඇති තැනැත්තාට නිතර සුභයකි. සිහි ඇති තැනැත්තා සැප වඩයි. සිහි ඇති තැනැත්තාට හෙට දවස වඩා හොඳය. වෛරයෙන් ද මිදෙන්නේය’’ යි.\n\n‘‘සිහි ඇති තැනැත්තාට නිතර සුභයකි. සිහි ඇති තැනැත්තා සැප වඩයි. සිහි ඇති තැනැත්තාට හෙට දවස වඩා හොඳය. වෛරයෙන් නම් නොමිදෙයි.\n\nයමෙකුගේ සිත දිවා රෑ දෙකෙහිම අවිහිංසාවෙහි ඇලී ඇත්ද, ඔහු සියලු සත්වයන් කෙරෙහි මෛත්‍රිය වඩයි. ඔහුට කිසිවකු කෙරෙහි වෛරයක් නැත.’’ යි.",
      "paliTitle": "Maṇibhaddasuttaṃ",
      "vagga": ""
    },
    {
      "number": 239,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena aññatarissā upāsikāya sānu nāma putto yakkhena gahito hoti. Atha kho sā upāsikā paridevamānā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Cātuddasiṃ pañcadasiṃ, yā ca pakkhassa aṭṭhamī; Pāṭihāriyapakkhañca, aṭṭhaṅgasusamāgataṃ. ‘‘Uposathaṃ upavasanti, brahmacariyaṃ caranti ye; Na tehi yakkhā kīḷanti, iti me arahataṃ sutaṃ; Sā dāni ajja passāmi, yakkhā kīḷanti sānunā’’ti. ‘‘Cātuddasiṃ pañcadasiṃ, yā ca pakkhassa aṭṭhamī; Pāṭihāriyapakkhañca, aṭṭhaṅgasusamāgataṃ; Uposathaṃ upavasanti, brahmacariyaṃ caranti ye. ‘‘Na tehi yakkhā kīḷanti, sāhu te arahataṃ sutaṃ; Sānuṃ pabuddhaṃ vajjāsi, yakkhānaṃ vacanaṃ idaṃ; Mākāsi pāpakaṃ kammaṃ, āvi vā yadi vā raho. ‘‘Sace ca [saceva (syā. kaṃ. pī. ka.), yañceva (sī.)] pāpakaṃ kammaṃ, karissasi karosi vā; Na te dukkhā pamutyatthi, uppaccāpi palāyato’’ti. ‘‘Mataṃ vā amma rodanti, yo vā jīvaṃ na dissati; Jīvantaṃ amma passantī, kasmā maṃ amma rodasī’’ti. ‘‘Mataṃ vā putta rodanti, yo vā jīvaṃ na dissati; Yo ca kāme cajitvāna, punarāgacchate idha; Taṃ vāpi putta rodanti, puna jīvaṃ mato hi so. ‘‘Kukkuḷā ubbhato tāta, kukkuḷaṃ [kukkuḷe (sī.)] patitumicchasi; Narakā ubbhato tāta, narakaṃ patitumicchasi. ‘‘Abhidhāvatha bhaddante, kassa ujjhāpayāmase; Ādittā nīhataṃ [nibbhataṃ (syā. kaṃ. ka.), nibhataṃ (pī. ka.)] bhaṇḍaṃ, puna ḍayhitumicchasī’’ti.",
      "english": "At one time, the Blessed One was dwelling in Savatthi, in Jeta's Grove, Anathapindika's monastery. Now at that time, a certain female lay follower had a son named Sanu, who was seized by a yakkha. Then, that lay follower, lamenting at that time, uttered these verses:\n\n\"On the fourteenth and fifteenth days, and on the eighth day of the fortnight, and during the special observance fortnight, well endowed with the eight factors, those who observe the Uposatha and practice the holy life — with them yakkhas do not torment. This I have heard from the Arahants. But now today I see yakkhas tormenting Sanu.\"\n\n\"On the fourteenth and fifteenth days, and on the eighth day of the fortnight, and during the special observance fortnight, well endowed with the eight factors, those who observe the Uposatha and practice the holy life – with them yakkhas do not torment. Well indeed have you heard this from the Arahants. You should tell Sanu, who is now awake, this message from the yakkhas: 'Do not commit any evil action, whether openly or in secret. If indeed you will do or are doing an evil action, there is no escape for you from suffering, even if you try to fly up and escape.'\"\n\n\"Mother, people lament for the dead, or for one who is alive but not seen. Mother, seeing me alive, why do you lament for me?\"\n\n\"Son, people lament for the dead, or for one who is alive but not seen. And one who, having abandoned sensual pleasures, returns here—for him too, son, people lament, for though he is alive again, he is truly dead. My dear, you were lifted out of the hot ashes, yet you wish to fall back into the hot ashes. My dear, you were lifted out of hell, yet you wish to fall back into hell. Strive forward, good sir! To whom shall we complain? You wish to burn again the property that was taken out of a burning house.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවනයෙහි අනේපිඬු සිටුතුමාගේ ආරාමයෙහි වැඩසිටියහ. එවිට එක්තරා උපාසිකාවකගේ සානු නම් පුත්‍රයා යක්ෂයකු විසින් අල්වාගෙන සිටියේය. එවිට ඒ උපාසිකාව විලාප නගමින් ඒ වේලාවෙහි මේ ගාථාවන් පැවසුවාය – \"දහහතරවැනිදා, පහළොස්වැනිදා, යම් පක්ෂයක අටවැනිදා ද, ප්‍රාතිහාර්ය පක්ෂය ද අටඅංගයෙන් මැනවින් යුක්ත වූ, උපෝසථය සමාදන් වෙත් ද, යම් කෙනෙක් බ්‍රහ්මචර්යාව රකිත් ද, යක්ෂයෝ ඔවුනට හිංසා නොකරති, මේ අයුරින් අරහතුන් වහන්සේලාගෙන් මා අසා ඇත. එහෙත් මම අද දකිමි, යක්ෂයෝ සානු සමග ක්‍රීඩා කරති (සානුට හිංසා කරති)\"යි.\n\n\"දහහතරවැනිදා, පහළොස්වැනිදා, යම් පක්ෂයක අටවැනිදා ද, ප්‍රාතිහාර්ය පක්ෂය ද අටඅංගයෙන් මැනවින් යුක්ත වූ, උපෝසථය සමාදන් වෙත් ද, යම් කෙනෙක් බ්‍රහ්මචර්යාව රකිත් ද, යක්ෂයෝ ඔවුනට හිංසා නොකරති, අරහතුන් වහන්සේලාගෙන් ඔබ ඇසූ දේ යහපත් ය. සානු අවදි වූ පසු යක්ෂයන්ගේ මේ වචනය කියන්න: 'ප්‍රසිද්ධියේ හෝ රහසින් හෝ පව්කම් නොකරන්න. යම් හෙයකින් පව්කම් කරන්නෙහි නම් හෝ කරන්නට යන්නෙහි නම්, ඔබ පැනගියද, සැඟවී සිටියද, දුකින් මිදීමක් ඔබට නැතැ'යි.\n\n\"මළවුන් වෙනුවෙන් මව ශෝක කරති, යමෙක් ජීවත්ව සිටිනු නොපෙනේ ද, එහෙත් මව, ජීවත්ව සිටින මා දකිමින්, මා වෙනුවෙන් කුමට ශෝක කරන්නීද?\"යි.\n\n\"පුත්‍රය, මළවුන් වෙනුවෙන් ශෝක කරති, යමෙක් ජීවත්ව සිටිනු නොපෙනේ ද ඔහු වෙනුවෙන් ද ශෝක කරති. යමෙක් කාමයන් හැරදමා, නැවත මෙලොවට එන්නේ ද, පුත්‍රය, ඔහු වෙනුවෙන් ද ශෝක කරති. මක්නිසාද යත් ඔහු නැවත ජීවත් වුවද, ඔහු මළවුන් හා සමාන බැවිනි. පුත, අඟුරු ගොඩින් මුදවා ගන්නා ලදී, ඔබ අඟුරු ගොඩට වැටීමට කැමතිද? පුත, නිරයෙන් මුදවා ගන්නා ලදී, ඔබ නිරයට වැටීමට කැමතිද? පින්වත්නි, ඉක්මනින් දුව එන්න, අපි කාට ද පැමිණිලි කරමු ද? ගිනිගන්නා නිවසින් පිටතට ගත් භාණ්ඩ, ඔබ නැවත දැවී යාමට කැමතිද?\"යි.",
      "paliTitle": "Sānusuttaṃ",
      "vagga": ""
    },
    {
      "number": 240,
      "pali": "Ekaṃ samayaṃ āyasmā anuruddho sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā anuruddho rattiyā paccūsasamayaṃ paccuṭṭhāya dhammapadāni bhāsati. Atha kho piyaṅkaramātā yakkhinī puttakaṃ evaṃ tosesi – ‘‘Mā saddaṃ kari piyaṅkara, bhikkhu dhammapadāni bhāsati; Api [api (sī.)] ca dhammapadaṃ vijāniya, paṭipajjema hitāya no siyā. ‘‘Pāṇesu ca saṃyamāmase, sampajānamusā na bhaṇāmase; Sikkhema susīlyamattano [susīlamattano (sī. ka.)], api muccema pisācayoniyā’’ti.",
      "english": "On one occasion, the Venerable Anuruddha was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. Now at that time, Venerable Anuruddha, having arisen at dawn in the last watch of the night, was reciting verses of Dhamma. Then the ogress Piyaṅkaramātā consoled her little son thus: \"Do not make a sound, Piyaṅkara, the bhikkhu is reciting verses of Dhamma. Perhaps, by understanding the path of Dhamma, we might practice it for our own benefit.\"\n\n\"We shall restrain ourselves from harming living beings, and we shall not speak a deliberate lie. We shall train ourselves in our own excellent moral conduct, and perhaps we shall be freed from the state of an ogress.\"",
      "sinhala": "එක් සමයක ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ සැවැත් නුවර අනාථපිණ්ඩික සිටුහු විසින් කරවන ලද ජේතවනාරාමයෙහි වාසය කරන සේක. ඒ අවස්ථාවේදී ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ රාත්‍රියේ පෙරළි අලුයම් කාලයේදී නැගිට ධර්‍ම පදයන් දේශනා කරමින් සිටි සේක.\n\nඑවිට පියංකරගේ මව වූ යක්ෂණිය තම පුත්‍රයාට මෙසේ පැවසුවාය – ‘‘පියංකර, ශබ්ද නොකරන්න. භික්ෂුව ධර්‍ම පදයන් දේශනා කරයි. එසේම, අපි ඒ ධර්‍ම පද අවබෝධ කරගෙන පිළිපැද්දොත්, එය අපට යහපතක් වනු ඇත. සතුන් කෙරෙහි සංවර වෙමු. දැන දැන මුසාවාද නොකියමු. අපගේ යහපත් සීලය පුරුදු පුහුණු කරමු. එවිට සමහරවිට අපට මේ පිසාච යෝනියෙන් මිදෙන්නට හැකි වේවි.’’",
      "paliTitle": "Piyaṅkarasuttaṃ",
      "vagga": ""
    },
    {
      "number": 241,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena bhagavā bhikkhū nibbānapaṭisaṃyuttāya dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Atha kho punabbasumātā yakkhinī puttake evaṃ tosesi – ‘‘Tuṇhī uttarike hohi, tuṇhī hohi punabbasu; Yāvāhaṃ buddhaseṭṭhassa, dhammaṃ sossāmi satthuno. ‘‘Nibbānaṃ bhagavā āha, sabbaganthappamocanaṃ; Ativelā ca me hoti, asmiṃ dhamme piyāyanā. ‘‘Piyo loke sako putto, piyo loke sako pati; Tato piyatarā mayhaṃ, assa dhammassa magganā. ‘‘Na hi putto pati vāpi, piyo dukkhā pamocaye; Yathā saddhammassavanaṃ, dukkhā moceti pāṇinaṃ. ‘‘Loke dukkhaparetasmiṃ, jarāmaraṇasaṃyute; Jarāmaraṇamokkhāya, yaṃ dhammaṃ abhisambudhaṃ; Taṃ dhammaṃ sotumicchāmi, tuṇhī hohi punabbasū’’ti. ‘‘Ammā na byāharissāmi, tuṇhībhūtāyamuttarā; Dhammameva nisāmehi, saddhammassavanaṃ sukhaṃ; Saddhammassa anaññāya, ammā dukkhaṃ carāmase. ‘‘Esa devamanussānaṃ, sammūḷhānaṃ pabhaṅkaro; Buddho antimasārīro, dhammaṃ deseti cakkhumā’’ti. ‘‘Sādhu kho paṇḍito nāma, putto jāto uresayo; Putto me buddhaseṭṭhassa, dhammaṃ suddhaṃ piyāyati. ‘‘Punabbasu sukhī hohi, ajjāhamhi samuggatā; Diṭṭhāni ariyasaccāni, uttarāpi suṇātu me’’ti.",
      "english": "At one time, the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's park. At that time, the Blessed One instructed, urged, inspired, and gladdened the bhikkhus with a Dhamma talk connected with Nibbāna. And those bhikkhus, paying attention, applying their minds, directing their entire awareness, listened to the Dhamma with attentive ears.\n\nThen, Punabbasu's mother, a yakkhiṇī, admonished her children thus: \"Be silent, Uttarā! Be silent, Punabbasu! Until I listen to the Dhamma of the Supreme Buddha, the Teacher. The Blessed One declares Nibbāna, the release from all fetters. And I have an intense longing for this Dhamma. In the world, one's own child is dear; in the world, one's own husband is dear. But dearer to me than that is the search for this Dhamma. For neither a dear child nor a dear husband can liberate one from suffering, as listening to the True Dhamma liberates living beings from suffering. In a world overcome by suffering and bound by aging and death, I wish to hear that Dhamma which has been fully awakened to for the liberation from aging and death. Be silent, Punabbasu!\"\n\n\"Mother, I will not speak,\" [said Punabbasu.] \"And Uttarā is also silent. Just listen to the Dhamma, for listening to the True Dhamma is happiness. Mother, not understanding the True Dhamma, we live in suffering. This Buddha, who has his final body, the Seer, is the dispeller of delusion for gods and humans who are bewildered; he teaches the Dhamma.\"\n\n\"Indeed, my son, born from my breast, is wise!\" [exclaimed the mother.] \"My son cherishes the pure Dhamma of the Supreme Buddha. May you be happy, Punabbasu! Today I have been elevated. The Noble Truths have been seen. May Uttarā also listen to me!\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනාථපිණ්ඩික සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. ඒ අවස්ථාවෙහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට නිවනට සම්බන්ධ වූ ධර්ම කථාවකින් කරුණු පෙන්වා දෙමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, ප්‍රබෝධයට පත් කරවමින් දේශනා කළ සේක. ඒ භික්ෂූන් වහන්සේලා ද ධර්මය හදවතට ගෙන, මනසින් මෙනෙහි කරමින්, සියලු සිතින් එක්තැන් කොට, හොඳින් සවන් යොමු කොට ධර්මය ශ්‍රවණය කළහ.\n\nඑවිට පුනබ්බසුමාතා යක්ෂණිය තම දරුවන් මෙසේ සන්සුන් කළාය: \"උත්තරික, නිශ්ශබ්ද වන්න. පුනබ්බසු, නිශ්ශබ්ද වන්න. ලෝක ශ්‍රේෂ්ඨ ශාස්තෘ වූ බුදුරජාණන් වහන්සේගේ ධර්මය මා ශ්‍රවණය කරන තුරුය. භාග්‍යවතුන් වහන්සේ නිවන දේශනා කරති. එය සියලු බැඳීම් මුදවා හරින්නකි. මේ ධර්මය කෙරෙහි මට අතිශයින් ප්‍රිය බවක් ඇති වී ඇත. ලෝකයෙහි තමන්ගේ පුත්‍රයා ප්‍රියයි, ලෝකයෙහි තමන්ගේ ස්වාමියා ප්‍රියයි. එහෙත් මට නම් මේ ධර්මය සෙවීම ඊටත් වඩා ප්‍රියයි. ප්‍රිය වූ පුත්‍රයෙක් හෝ ස්වාමියෙක් දුකින් මුදවාලන්නේ නැත. යම් සේ සද්ධර්ම ශ්‍රවණය සත්වයා දුකින් මුදවාලන්නේද, (එසේ කිසිවකු නොවේ.) දුකෙන් වෙලී ගිය, ජරා මරණයෙන් බැඳුණු මේ ලෝකයෙහි, ජරා මරණයෙන් මිදීම පිණිස යම් ධර්මයක් (බුදුරජාණන් වහන්සේ) අවබෝධ කළ සේක්ද, ඒ ධර්මය ශ්‍රවණය කිරීමට මම කැමැත්තෙමි. පුනබ්බසු, නිශ්ශබ්ද වන්න!\" යැයි කීවාය.\n\n\"අම්මා, මම වචනයක්වත් නොකියමි. උත්තරා ද නිශ්ශබ්ද වූවාය. ධර්මයම අසා සිටින්න. සද්ධර්ම ශ්‍රවණය සැපයකි. අම්මා, සද්ධර්මය නොදන්නා අපි දුක් විඳිමු. දෙවි මිනිසුන්ගේ මුළාව දුරුකරන්නා වූ, අවසන් ශරීරය දරන, ප්‍රඥා ඇස ඇති බුදුරජාණන් වහන්සේ ධර්මය දේශනා කරති\" යැයි කීවේය.\n\n\"සැබවින්ම පණ්ඩිත වූ පුත්‍රයා නම්, (මවගේ) ළයෙහි හැදුණු දරුවාය. මාගේ පුත්‍රයා බුදුරජාණන් වහන්සේගේ පිරිසිදු ධර්මයට ප්‍රිය කරයි. පුනබ්බසු, ඔබ සුවපත් වන්න. අද මා සතුටට පත් වූවාය. (මා විසින්) ආර්ය සත්‍යයන් අවබෝධ කරගනු ලැබීය. උත්තරා ද මාගේ (මේ වචනය) අසත්වා\" යැයි කීවාය.",
      "paliTitle": "Punabbasusuttaṃ",
      "vagga": ""
    },
    {
      "number": 242,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati sītavane. Tena kho pana samayena anāthapiṇḍiko gahapati rājagahaṃ anuppatto hoti kenacideva karaṇīyena. Assosi kho anāthapiṇḍiko gahapati – ‘‘buddho kira loke uppanno’’ti. Tāvadeva ca pana bhagavantaṃ dassanāya upasaṅkamitukāmo hoti. Athassa anāthapiṇḍikassa gahapatissa etadahosi – ‘‘akālo kho ajja bhagavantaṃ dassanāya upasaṅkamituṃ. Sve dānāhaṃ kālena bhagavantaṃ dassanāya gamissāmī’’ti buddhagatāya satiyā nipajji. Rattiyā sudaṃ tikkhattuṃ vuṭṭhāsi pabhātanti maññamāno. Atha kho anāthapiṇḍiko gahapati yena sivathikadvāraṃ [sīvathikadvāraṃ (sī. syā. kaṃ. pī.)] tenupasaṅkami. Amanussā dvāraṃ vivariṃsu. Atha kho anāthapiṇḍikassa gahapatissa nagaramhā nikkhamantassa āloko antaradhāyi, andhakāro pāturahosi, bhayaṃ chambhitattaṃ lomahaṃso udapādi, tatova puna nivattitukāmo ahosi. Atha kho sivako [sīvako (sī. pī.)] yakkho antarahito saddamanussāvesi – ‘‘Sataṃ hatthī sataṃ assā, sataṃ assatarīrathā; Sataṃ kaññāsahassāni, āmukkamaṇikuṇḍalā; Ekassa padavītihārassa, kalaṃ nāgghanti soḷasiṃ. ‘‘Abhikkama gahapati, abhikkama gahapati; Abhikkamanaṃ te seyyo, no paṭikkamana’’nti. Atha kho anāthapiṇḍikassa gahapatissa andhakāro antaradhāyi, āloko pāturahosi, yaṃ ahosi bhayaṃ chambhitattaṃ lomahaṃso, so paṭippassambhi. Dutiyampi kho anāthapiṇḍikassa gahapatissa āloko antaradhāyi, andhakāro pāturahosi, bhayaṃ chambhitattaṃ lomahaṃso udapādi, tatova puna nivattitukāmo ahosi. Dutiyampi kho sivako yakkho antarahito saddamanussāvesi – ‘‘Sataṃ hatthī sataṃ assā…pe… Kalaṃ nāgghanti soḷasiṃ. ‘‘Abhikkama gahapati, abhikkama gahapati; Abhikkamanaṃ te seyyo, no paṭikkamana’’nti. Atha kho anāthapiṇḍikassa gahapatissa andhakāro antaradhāyi, āloko pāturahosi, yaṃ ahosi bhayaṃ chambhitattaṃ lomahaṃso, so paṭippassambhi. Tatiyampi kho anāthapiṇḍikassa gahapatissa āloko antaradhāyi, andhakāro pāturahosi, bhayaṃ chambhitattaṃ lomahaṃso udapādi, tatova puna nivattitukāmo ahosi. Tatiyampi kho sivako yakkho antarahito saddamanussāvesi – ‘‘Sataṃ hatthī sataṃ assā…pe… Kalaṃ nāgghanti soḷasiṃ. ‘‘Abhikkama gahapati, abhikkama gahapati; Abhikkamanaṃ te seyyo, no paṭikkamana’’nti. Atha kho anāthapiṇḍikassa gahapatissa andhakāro antaradhāyi, āloko pāturahosi, yaṃ ahosi bhayaṃ chambhitattaṃ lomahaṃso, so paṭippassambhi. Atha kho anāthapiṇḍiko gahapati yena sītavanaṃ yena bhagavā tenupasaṅkami. Tena kho pana samayena bhagavā rattiyā paccūsasamayaṃ paccuṭṭhāya abbhokāse caṅkamati. Addasā kho bhagavā anāthapiṇḍikaṃ gahapatiṃ dūratova āgacchantaṃ. Disvāna caṅkamā orohitvā paññatte āsane nisīdi. Nisajja kho bhagavā anāthapiṇḍikaṃ gahapatiṃ etadavoca – ‘‘ehi sudattā’’ti. Atha kho anāthapiṇḍiko gahapati, nāmena maṃ bhagavā ālapatīti, haṭṭho udaggo tattheva bhagavato pādesu sirasā nipatitvā bhagavantaṃ etadavoca – ‘‘kacci, bhante, bhagavā sukhamasayitthā’’ti? ‘‘Sabbadā ve sukhaṃ seti, brāhmaṇo parinibbuto; Yo na limpati kāmesu, sītibhūto nirūpadhi. ‘‘Sabbā āsattiyo chetvā, vineyya hadaye daraṃ; Upasanto sukhaṃ seti, santiṃ pappuyya cetasā’’ti [cetasoti (sī.)].",
      "english": "Once the Blessed One was staying in Rājagaha, in Sītavana. At that time, Anāthapiṇḍika the householder had arrived in Rājagaha for some business. Anāthapiṇḍika the householder heard: “Indeed, the Buddha has appeared in the world!” Immediately, he wished to go and see the Blessed One. Then it occurred to Anāthapiṇḍika the householder: “It is not the right time today to go and see the Blessed One. Tomorrow, I will go at the proper time to see the Blessed One.” And with his mind fixed on the Buddha, he lay down. During the night, he woke up three times, thinking it was dawn. Then Anāthapiṇḍika the householder approached the Sīvathika gate. Non-human beings opened the gate for him. Then, as Anāthapiṇḍika the householder was leaving the city, the light vanished, darkness appeared, fear, trepidation, and a creeping of the flesh arose, and he wished to turn back from there.\n\nThen Sīvaka the yakkha, having become invisible, made his voice heard: “A hundred elephants, a hundred horses, a hundred mule-drawn chariots, a hundred thousand maidens adorned with jeweled earrings, are not worth a sixteenth part of a single step forward. Come forward, householder, come forward, householder! For you, coming forward is better, not turning back.” Then the darkness vanished for Anāthapiṇḍika the householder, light appeared, and the fear, trepidation, and creeping of the flesh that had arisen subsided.\n\nA second time, the light vanished for Anāthapiṇḍika the householder, darkness appeared, fear, trepidation, and a creeping of the flesh arose, and he wished to turn back from there. A second time, Sīvaka the yakkha, having become invisible, made his voice heard: “A hundred elephants, a hundred horses, a hundred mule-drawn chariots, a hundred thousand maidens adorned with jeweled earrings, are not worth a sixteenth part of a single step forward. Come forward, householder, come forward, householder! For you, coming forward is better, not turning back.” Then the darkness vanished for Anāthapiṇḍika the householder, light appeared, and the fear, trepidation, and creeping of the flesh that had arisen subsided.\n\nA third time, the light vanished for Anāthapiṇḍika the householder, darkness appeared, fear, trepidation, and a creeping of the flesh arose, and he wished to turn back from there. A third time, Sīvaka the yakkha, having become invisible, made his voice heard: “A hundred elephants, a hundred horses, a hundred mule-drawn chariots, a hundred thousand maidens adorned with jeweled earrings, are not worth a sixteenth part of a single step forward. Come forward, householder, come forward, householder! For you, coming forward is better, not turning back.” Then the darkness vanished for Anāthapiṇḍika the householder, light appeared, and the fear, trepidation, and creeping of the flesh that had arisen subsided.\n\nThen Anāthapiṇḍika the householder approached Sītavana, where the Blessed One was. At that time, the Blessed One had arisen in the last watch of the night, at dawn, and was walking back and forth in the open air. The Blessed One saw Anāthapiṇḍika the householder approaching from afar. Seeing him, he descended from the walking path and sat down on the prepared seat. Having sat down, the Blessed One said to Anāthapiṇḍika the householder: “Come, Sudatta.” Then Anāthapiṇḍika the householder, realizing, “The Blessed One is addressing me by my given name!”, became overjoyed and thrilled. He prostrated his head at the Blessed One’s feet right there and said to the Blessed One: “I hope, Venerable Sir, that the Blessed One slept peacefully?”\n\n“Always indeed does the holy one, fully cool and utterly extinguished, sleep peacefully; one who is unsoiled by sensual pleasures, fully cool, without any basis for renewed existence. Having cut off all attachments, having dispelled the anguish in the heart, such a pacified one sleeps peacefully, having attained inner peace of mind.”",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර සීතවනයේ වැඩසිටියහ. එකල අනේපිඬු සිටුතුමා යම් කිසි කටයුත්තක් පිණිස රජගහ නුවරට පැමිණ සිටියේය. අනේපිඬු සිටුතුමා \"බුදුරජාණන් වහන්සේ ලොව පහළ වී සිටින සේකැයි\" අසා දැනගත්තේය. එසැණින්ම භාග්‍යවතුන් වහන්සේ දැකීම සඳහා උන්වහන්සේ වෙත පැමිණීමට කැමැත්තෙන් සිටියේය. එවිට අනේපිඬු සිටුතුමාට මෙසේ සිතුණි: \"අද භාග්‍යවතුන් වහන්සේ දැකීමට පැමිණීමට අකල්ය. මම හෙට කලට වේලාසනින් භාග්‍යවතුන් වහන්සේ දැකීමට යන්නෙමි\" යි බුදුරජාණන් වහන්සේ කෙරෙහි පිහිටි සිහියෙන් යුක්තව නිදාගත්තේය. රාත්‍රියෙහි තුන් වතාවක්ම පහන් වී යැයි සිතා පිබිද සිටියේය.\n\nඑවිට අනේපිඬු සිටුතුමා සීවථික දොරටුව වෙත ගියේය. අමනුෂ්‍යයෝ දොර විවෘත කළහ. එවිට නගරයෙන් පිටව යමින් සිටි අනේපිඬු සිටුතුමාට ආලෝකය අතුරුදහන් විය, අන්ධකාරය පහළ විය, භයක්ද, සන්ත්‍රාසයක්ද, ලොමුදැහැගැන්මක්ද උපදී, ඔහු ඒ මොහොතේම ආපසු හැරී යාමට සිතුවේය. එවිට සීවක යක්ෂයා අතුරුදහන්ව සිට \"සැට හස්තිහුද, සැට අශ්වයෝද, සැට අශ්වතර රථයෝද; මැණික් කරාබු පැළඳි කන්‍යා ස්ත්‍රීන් ලක්ෂයෝද; (ඔවුන්ගේ වටිනාකම) එක පියවරක් තැබීමේ (අනර්ඝත්වයෙන්) සොළොස්වෙන් කොටසකටත් නොපැමිණේ. සිටුතුමෙනි, ඉදිරියට යන්න, සිටුතුමෙනි, ඉදිරියට යන්න; ඉදිරියට යාම ඔබට වඩා යහපත්ය, ආපසු හැරී යාම නොවේ\" යැයි ශබ්දයක් නැගුවේය. එවිට අනේපිඬු සිටුතුමාට අන්ධකාරය අතුරුදහන් විය, ආලෝකය පහළ විය, යම් භයක්ද, සන්ත්‍රාසයක්ද, ලොමුදැහැගැන්මක්ද ඇතිවීද, ඒ සියල්ල සංසිඳී ගියේය.\n\nදෙවන වරටත් අනේපිඬු සිටුතුමාට ආලෝකය අතුරුදහන් විය, අන්ධකාරය පහළ විය, භයක්ද, සන්ත්‍රාසයක්ද, ලොමුදැහැගැන්මක්ද උපදී, ඔහු ඒ මොහොතේම ආපසු හැරී යාමට සිතුවේය. දෙවන වරටත් සීවක යක්ෂයා අතුරුදහන්ව සිට \"සැට හස්තිහුද, සැට අශ්වයෝද, සැට අශ්වතර රථයෝද; මැණික් කරාබු පැළඳි කන්‍යා ස්ත්‍රීන් ලක්ෂයෝද; (ඔවුන්ගේ වටිනාකම) එක පියවරක් තැබීමේ (අනර්ඝත්වයෙන්) සොළොස්වෙන් කොටසකටත් නොපැමිණේ. සිටුතුමෙනි, ඉදිරියට යන්න, සිටුතුමෙනි, ඉදිරියට යන්න; ඉදිරියට යාම ඔබට වඩා යහපත්ය, ආපසු හැරී යාම නොවේ\" යැයි ශබ්දයක් නැගුවේය. එවිට අනේපිඬු සිටුතුමාට අන්ධකාරය අතුරුදහන් විය, ආලෝකය පහළ විය, යම් භයක්ද, සන්ත්‍රාසයක්ද, ලොමුදැහැගැන්මක්ද ඇතිවීද, ඒ සියල්ල සංසිඳී ගියේය.\n\nතුන්වන වරටත් අනේපිඬු සිටුතුමාට ආලෝකය අතුරුදහන් විය, අන්ධකාරය පහළ විය, භයක්ද, සන්ත්‍රාසයක්ද, ලොමුදැහැගැන්මක්ද උපදී, ඔහු ඒ මොහොතේම ආපසු හැරී යාමට සිතුවේය. තුන්වන වරටත් සීවක යක්ෂයා අතුරුදහන්ව සිට \"සැට හස්තිහුද, සැට අශ්වයෝද, සැට අශ්වතර රථයෝද; මැණික් කරාබු පැළඳි කන්‍යා ස්ත්‍රීන් ලක්ෂයෝද; (ඔවුන්ගේ වටිනාකම) එක පියවරක් තැබීමේ (අනර්ඝත්වයෙන්) සොළොස්වෙන් කොටසකටත් නොපැමිණේ. සිටුතුමෙනි, ඉදිරියට යන්න, සිටුතුමෙනි, ඉදිරියට යන්න; ඉදිරියට යාම ඔබට වඩා යහපත්ය, ආපසු හැරී යාම නොවේ\" යැයි ශබ්දයක් නැගුවේය. එවිට අනේපිඬු සිටුතුමාට අන්ධකාරය අතුරුදහන් විය, ආලෝකය පහළ විය, යම් භයක්ද, සන්ත්‍රාසයක්ද, ලොමුදැහැගැන්මක්ද ඇතිවීද, ඒ සියල්ල සංසිඳී ගියේය.\n\nඑවිට අනේපිඬු සිටුතුමා සීතවනයටද, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනටද ගියේය. එකල භාග්‍යවතුන් වහන්සේ රාත්‍රියේ අලුයම අවදිව එළිමහනේ සක්මන් කරමින් සිටියහ. භාග්‍යවතුන් වහන්සේ දුරදීම අනේපිඬු සිටුතුමා එනු දුටුවේය. දැක, සක්මන් මළුවෙන් බැස, පනවන ලද අසුනක වැඩසිටියේය. වැඩහිඳ, භාග්‍යවතුන් වහන්සේ අනේපිඬු සිටුතුමාට මෙසේ වදාළහ: \"එන්න, සුදත්ත.\" එවිට අනේපිඬු සිටුතුමා \"භාග්‍යවතුන් වහන්සේ මාගේ නම කියා අමතන සේකැ\"යි සතුටු වී, ප්‍රීතියෙන් ඉපිලී, ඒ භාග්‍යවතුන් වහන්සේගේ දෙපාමුල හිසින් වැඳ, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ සැපසේ සැතපුණාද?\"\n\n\"පිරිනිවුණු බ්‍රාහ්මණයා සැමවිටම සැපසේ සැතපේ. යමෙක් කාමයන්හි නොඇලේද, සිහිල්ව, කිසිදු උපාධියකින් තොරව සිටින්නේද, සියලු බැඳීම් සිඳ දමා, සිතේ ඇති බිය දුරුකොට, උපශාන්ත වූ ඔහු සිතින් සාමය ලබා, සැපසේ සැතපේය.\"",
      "paliTitle": "Sudattasuttaṃ",
      "vagga": ""
    },
    {
      "number": 243,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena sukkā bhikkhunī mahatiyā parisāya parivutā dhammaṃ deseti. Atha kho sukkāya bhikkhuniyā abhippasanno yakkho rājagahe rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ upasaṅkamitvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Kiṃ me katā rājagahe manussā, madhupītāva seyare; Ye sukkaṃ na payirupāsanti, desentiṃ amataṃ padaṃ. ‘‘Tañca pana appaṭivānīyaṃ, asecanakamojavaṃ; Pivanti maññe sappaññā, valāhakamiva panthagū’’ti [valāhakamivaddhagūti (sī.)].",
      "english": "At one time, the Blessed One was dwelling at Rājagaha in the Bamboo Grove, the Squirrels' Feeding Ground. Now at that time, the nun Sukkā was teaching the Dhamma, surrounded by a large assembly. Then a yakkha, greatly devoted to the nun Sukkā, went from street to street and from crossroads to crossroads in Rājagaha, and at that time recited these verses:\n\n\"What is wrong with the people of Rājagaha? They lie as if drunk on honey, those who do not attend upon Sukkā while she teaches the deathless state.\n\n\"And yet that Dhamma is irresistible, having an unexcelled, pure essence. I think the wise drink it like travelers drinking from a cloud.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දකනිවාපයෙහි වැඩ වෙසෙන සේක. ඒ කල්හි සුක්කා නම් භික්ෂුණිය මහත් පිරිසක් පිරිවරා ධර්මය දේශනා කරමින් සිටියා ය. එකල්හි සුක්කා භික්ෂුණිය කෙරෙහි අතිශයින් පැහැදුණු යක්ෂයෙක් රජගහ නුවර වීථියෙන් වීථියටත්, සිව්මංසලෙන් සිව්මංසලටත් ගොස් ඒ වෙලාවේ දී මේ ගාථා පැවසී ය –\n\n‘‘රජගහ නුවර මිනිස්සු මට කුමක් කළෝද? අමත පදය දේශනා කරන සුක්කා භික්ෂුණියට උපස්ථාන නොකරන, මධුපානය කළවුන් මෙන් නිදා සිටින මේ මිනිස්සු? ප්‍රඥාවන්තයෝ නම්, ඒ ප්‍රතික්ෂේප කළ නොහැකි, ඉසීමකින් තොරව ලැබෙන සාරය, වලාකුලකින් ජලය පානය කරන්නාක් මෙන්, පානය කරනවා යැයි මම සිතමි.’’",
      "paliTitle": "Paṭhamasukkāsuttaṃ",
      "vagga": ""
    },
    {
      "number": 244,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena aññataro upāsako sukkāya bhikkhuniyā bhojanaṃ adāsi. Atha kho sukkāya bhikkhuniyā abhippasanno yakkho rājagahe rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ upasaṅkamitvā tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Puññaṃ vata pasavi bahuṃ, sappañño vatāyaṃ upāsako; Yo sukkāya adāsi bhojanaṃ, sabbaganthehi vippamuttiyā’’ti [vippamuttāyāti (syā. kaṃ.)].",
      "english": "At one time, the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. At that time, a certain lay follower gave food to the bhikkhuni Sukkā. Then, a yakkha, profoundly pleased with the bhikkhuni Sukkā, went from street to street and from crossroads to crossroads in Rājagaha, and at that very moment, spoke this verse: 'Truly, this wise lay follower generated much merit, who gave food to Sukkā for the ultimate freedom from all ties!'",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දක නිවාපයේ වැඩවසන සේක. එසමයෙහි එක්තරා උපාසකයෙක් සුක්කා නම් භික්ෂුණියට දානයක් දුන්නේය. ඉක්බිති සුක්කා භික්ෂුණිය කෙරෙහි අතිශයින් පැහැදුණු යක්ෂයෙක් රජගහ නුවර වීදියෙන් වීදියට, සිවුමංසලින් සිවුමංසලට යමින්, එකල්හි මේ ගාථාව ප්‍රකාශ කළේය – ‘‘බොහෝ පින් උපදවා ගත්තේය, සැබැවින්ම මේ උපාසකයා ප්‍රඥාවන්තයෙකි. යම් තැනැත්තෙක් සුක්කා භික්ෂුණියට සියලු කෙලෙස් බැඳීම්වලින් මුළුමනින්ම මිදීම පිණිස දානයක් දුන්නේද.’’",
      "paliTitle": "Dutiyasukkāsuttaṃ",
      "vagga": ""
    },
    {
      "number": 245,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena aññataro upāsako cīrāya [cirāya (ka.)] bhikkhuniyā cīvaraṃ adāsi. Atha kho cīrāya bhikkhuniyā abhippasanno yakkho rājagahe rathikāya rathikaṃ siṅghāṭakena siṅghāṭakaṃ upasaṅkamitvā tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Puññaṃ vata pasavi bahuṃ, sappañño vatāyaṃ upāsako; Yo cīrāya adāsi cīvaraṃ, sabbayogehi vippamuttiyā’’ti [vippamuttāyāti (syā. kaṃ.)].",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. Now at that time, a certain lay follower gave a robe to the bhikkhuni Cīrā. Then, a yakkha, deeply inspired by the bhikkhuni Cīrā, went through Rājagaha, from street to street, from crossroads to crossroads, and at that time recited this verse: \"Truly, great merit has this wise lay follower generated, who gave a robe to Cīrā, for the sake of complete liberation from all bonds.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදි – එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයෙහි කලන්දකනිවාප නම් තැන වැඩසිටින සේක. එකල්හි යම්කිසි උපාසකයෙක් චීරා නම් භික්ෂුණියට සිවුරක් පූජා කළේය. එවිට චීරා භික්ෂුණිය කෙරෙහි අතිශයින් පැහැදුණු යක්ෂයෙක් රජගහ නුවර වීදියෙන් වීදියටත්, සිංඝාටකයෙන් සිංඝාටකයටත් එළැඹ, එකල්හි මේ ගාථාව කීවේය –\n\nඅහෝ! (මේ) උපාසක තෙමේ මහත් පුණ්‍යයක් උපදවා ගත්තේය.\nමොහු සැබැවින්ම ප්‍රඥාවන්ත උපාසකයෙකි.\nයම් හෙයකින් මොහු චීරා භික්ෂුණියට සියලු යෝගයන්ගෙන් මුදනු පිණිස සිවුරක් පූජා කළේය.”",
      "paliTitle": "Cīrāsuttaṃ",
      "vagga": ""
    },
    {
      "number": 246,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā āḷaviyaṃ viharati āḷavakassa yakkhassa bhavane. Atha kho āḷavako yakkho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘nikkhama, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā nikkhami. ‘‘Pavisa, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā pāvisi. Dutiyampi kho āḷavako yakkho bhagavantaṃ etadavoca – ‘‘nikkhama, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā nikkhami. ‘‘Pavisa, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā pāvisi. Tatiyampi kho āḷavako yakkho bhagavantaṃ etadavoca – ‘‘nikkhama, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā nikkhami. ‘‘Pavisa, samaṇā’’ti. ‘‘Sādhāvuso’’ti bhagavā pāvisi. Catutthampi kho āḷavako yakkho bhagavantaṃ etadavoca – ‘‘nikkhama, samaṇā’’ti. ‘‘Na khvāhaṃ taṃ, āvuso, nikkhamissāmi. Yaṃ te karaṇīyaṃ taṃ karohī’’ti. ‘‘Pañhaṃ taṃ, samaṇa, pucchissāmi. Sace me na byākarissasi, cittaṃ vā te khipissāmi, hadayaṃ vā te phālessāmi, pādesu vā gahetvā pāragaṅgāya khipissāmī’’ti. ‘‘Na khvāhaṃ taṃ, āvuso, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya, ye me cittaṃ vā khipeyya hadayaṃ vā phāleyya, pādesu vā gahetvā pāragaṅgāya khipeyya. Api ca tvaṃ, āvuso, puccha yadā kaṅkhasī’’ti [(atha kho āḷavako yakkho bhagavantaṃ gāthāya ajjhabhāsi.) (sī.)]. ‘‘Kiṃsūdha vittaṃ purisassa seṭṭhaṃ, kiṃsu suciṇṇaṃ sukhamāvahāti; Kiṃsu have sādutaraṃ rasānaṃ, kathaṃjīviṃ jīvitamāhu seṭṭha’’nti. ‘‘Saddhīdha vittaṃ purissa seṭṭhaṃ, dhammo suciṇṇo sukhamāvahāti; Saccaṃ have sādutaraṃ rasānaṃ, paññājīviṃ jīvitamāhu seṭṭha’’nti. ‘‘Kathaṃsu tarati oghaṃ, kathaṃsu tarati aṇṇavaṃ; Kathaṃsu dukkhamacceti, kathaṃsu parisujjhatī’’ti. ‘‘Saddhāya tarati oghaṃ, appamādena aṇṇavaṃ; Vīriyena dukkhamacceti, paññāya parisujjhatī’’ti. ‘‘Kathaṃsu labhate paññaṃ, kathaṃsu vindate dhanaṃ; Kathaṃsu kittiṃ pappoti, kathaṃ mittāni ganthati; Asmā lokā paraṃ lokaṃ, kathaṃ pecca na socatī’’ti. ‘‘Saddahāno arahataṃ, dhammaṃ nibbānapattiyā; Sussūsaṃ [sussūsā (sī. pī.)] labhate paññaṃ, appamatto vicakkhaṇo. ‘‘Patirūpakārī dhuravā, uṭṭhātā vindate dhanaṃ; Saccena kittiṃ pappoti, dadaṃ mittāni ganthati; Asmā lokā paraṃ lokaṃ, evaṃ pecca na socati. ‘‘Yassete caturo dhammā, saddhassa gharamesino; Saccaṃ dammo dhiti cāgo, sa ve pecca na socati. ‘‘Iṅgha aññepi pucchassu, puthū samaṇabrāhmaṇe; Yadi saccā dammā cāgā, khantyā bhiyyodha vijjatī’’ti. ‘‘Kathaṃ nu dāni puccheyyaṃ, puthū samaṇabrāhmaṇe; Yohaṃ [sohaṃ (sī.), svāhaṃ (ka.)] ajja pajānāmi, yo attho samparāyiko. ‘‘Atthāya vata me buddho, vāsāyāḷavimāgamā [māgato (pī. ka.)]; Yohaṃ [sohaṃ (sī.)] ajja pajānāmi, yattha dinnaṃ mahapphalaṃ. ‘‘So ahaṃ vicarissāmi, gāmā gāmaṃ purā puraṃ; Namassamāno sambuddhaṃ, dhammassa ca sudhammata’’nti. ",
      "english": "Thus have I heard: At one time the Blessed One was dwelling in Alavi, at the abode of Alavaka the Yaksha.\n\nThen Alavaka the Yaksha approached the Blessed One. Having approached, he said to the Blessed One, \"Get out, recluse!\" \"Yes, friend,\" said the Blessed One, and got out. \"Come in, recluse!\" \"Yes, friend,\" said the Blessed One, and went in.\n\nA second time Alavaka the Yaksha said to the Blessed One, \"Get out, recluse!\" \"Yes, friend,\" said the Blessed One, and got out. \"Come in, recluse!\" \"Yes, friend,\" said the Blessed One, and went in.\n\nA third time Alavaka the Yaksha said to the Blessed One, \"Get out, recluse!\" \"Yes, friend,\" said the Blessed One, and got out. \"Come in, recluse!\" \"Yes, friend,\" said the Blessed One, and went in.\n\nA fourth time Alavaka the Yaksha said to the Blessed One, \"Get out, recluse!\" \"Indeed, friend,\" said the Blessed One, \"I will not go out now. Do what you must do.\"\n\n\"Recluse, I will ask you a question. If you do not answer me, I will shatter your mind, or burst your heart, or seize you by the feet and throw you across the Ganges.\"\n\n\"Indeed, friend, I do not see anyone in the world with its devas, Maras, Brahmas, with its recluses and brahmins, its gods and humans, who could shatter my mind, or burst my heart, or seize me by the feet and throw me across the Ganges. However, friend, ask what you wish.\"\n\n\"What is the best treasure for a person here? What, when well-practiced, brings happiness? What is truly sweeter than flavors? How lived, is a life called the best?\"\n\n\"Faith is the best treasure for a person here; the Dhamma, when well-practiced, brings happiness; Truth is truly sweeter than flavors; a life lived with wisdom is called the best.\"\n\n\"How does one cross the flood? How does one cross the ocean? How does one overcome suffering? How does one become purified?\"\n\n\"By faith, one crosses the flood; by diligence, the ocean; by energy, one overcomes suffering; by wisdom, one becomes purified.\"\n\n\"How does one obtain wisdom? How does one acquire wealth? How does one gain renown? How does one bind friends? How, having passed from this world to the next, does one not grieve?\"\n\n\"Having faith in the Dhamma of the Arahants for the attainment of Nibbana, being diligent and discerning, and listening attentively, one obtains wisdom. One who is suitable for work, persevering, and energetic acquires wealth. By truthfulness, one gains renown. By giving, one binds friends. He who possesses these four qualities—truthfulness, self-control, steadfastness, and generosity—as a faithful householder, indeed does not grieve after passing away.\"\n\n\"Go ahead and ask other recluses and brahmins, many of them, if anything more excellent than truthfulness, self-control, generosity, and patience can be found here.\"\n\n\"How now could I ask other recluses and brahmins, since I today understand what is truly beneficial for the future? Truly, it was for my benefit that the Buddha came to reside in Alavi, since I today understand where a gift yields great fruit. Therefore, I will wander from village to village, from town to town, paying homage to the Fully Awakened One and to the well-taught nature of the Dhamma.\"",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ ආළවියෙහි, ආළවක යක්ෂයාගේ භවනෙහි වැඩසිටියහ.\n\nඉක්බිති ආළවක යක්ෂයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, පැමිණ භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"ශ්‍රමණයෙනි, පිටතට යන්න!\"\n\n\"එසේය ඇවැත්නි\"යි භාග්‍යවතුන් වහන්සේ පිටතට වැඩියහ. \"ශ්‍රමණයෙනි, ඇතුළට වඩින්න!\" \"එසේය ඇවැත්නි\"යි භාග්‍යවතුන් වහන්සේ ඇතුළට වැඩියහ. දෙවන වරටත් ආළවක යක්ෂයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"ශ්‍රමණයෙනි, පිටතට යන්න!\" \"එසේය ඇවැත්නි\"යි භාග්‍යවතුන් වහන්සේ පිටතට වැඩියහ. \"ශ්‍රමණයෙනි, ඇතුළට වඩින්න!\" \"එසේය ඇවැත්නි\"යි භාග්‍යවතුන් වහන්සේ ඇතුළට වැඩියහ. තුන්වන වරටත් ආළවක යක්ෂයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"ශ්‍රමණයෙනි, පිටතට යන්න!\" \"එසේය ඇවැත්නි\"යි භාග්‍යවතුන් වහන්සේ පිටතට වැඩියහ. \"ශ්‍රමණයෙනි, ඇතුළට වඩින්න!\" \"එසේය ඇවැත්නි\"යි භාග්‍යවතුන් වහන්සේ ඇතුළට වැඩියහ.\n\nසතර වන වරටත් ආළවක යක්ෂයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"ශ්‍රමණයෙනි, පිටතට යන්න!\" \"ඇවැත්නි, මම දැන් පිටතට නොයන්නෙමි. යමක් ඔබට කළ යුතු නම්, එය කරගන්නැ\"යි (භාග්‍යවතුන් වහන්සේ වදාළ සේක).\n\n(එවිට ආළවක යක්ෂයා මෙසේ කීවේය:) \"ශ්‍රමණයෙනි, මම ඔබෙන් ප්‍රශ්නයක් අසන්නෙමි. යම් හෙයකින් මට පිළිතුරු නොදෙන්නෙහි නම්, ඔබගේ සිත වික්ෂිප්ත කරන්නෙමි, නැතහොත් හදවත පලන්නෙමි, නැතහොත් පාදවලින් අල්ලාගෙන ගංගාවෙන් එතෙරට දමන්නෙමි\"යි.\n\n(එවිට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:) \"ඇවැත්නි, දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත වූ ද, ශ්‍රමණයන් හා බ්‍රාහ්මණයන් සහිත වූ ද, දෙවියන් හා මිනිසුන් සහිත වූ ද මේ ලෝකයෙහි, යමෙක් මාගේ සිත වික්ෂිප්ත කරන්නේ ද, හදවත පලන්නේ ද, පාදවලින් අල්ලාගෙන ගංගාවෙන් එතෙරට දමන්නේ ද, එබඳු කෙනෙක් මම නොදකිමි. එහෙත් ඇවැත්නි, ඔබ කැමති නම් අසන්නැ\"යි.\n\n(එවිට ආළවක යක්ෂයා භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවේය:)\n\"මේ ලෝකයේ මිනිසාට ශ්‍රේෂ්ඨතම ධනය කුමක්ද? මනා කොට පිළිපැදීමෙන් සැප ගෙන දෙන්නේ කුමක්ද? රසවත් දේ අතර අතිශයින්ම රසවත් දෙය කුමක්ද? කුමන ජීවිතයක් ද ශ්‍රේෂ්ඨ ජීවිතය යැයි පවසන්නේ?\"\n\n(එවිට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:)\n\"මේ ලෝකයේ මිනිසාට ශ්‍රේෂ්ඨතම ධනය වන්නේ ශ්‍රද්ධාවයි. මනා කොට පිළිපදින ලද ධර්මය සැප ගෙන දෙයි. සත්‍යය යනු රසවත් දේ අතර අතිශයින්ම රසවත් දෙයයි. ප්‍රඥාවෙන් යුතුව ජීවත් වීම ශ්‍රේෂ්ඨ ජීවිතය යැයි පවසති.\"\n\n(එවිට ආළවක යක්ෂයා මෙසේ කීවේය:)\n\"කෙසේ නම් ඕඝය (සංසාර සාගරය) තරණය කරන්නේ ද? කෙසේ නම් අර්ණවය (දුක් සයුර) තරණය කරන්නේ ද? කෙසේ නම් දුක ඉක්මවා යන්නේ ද? කෙසේ නම් පිරිසිදු වන්නේ ද?\"\n\n(එවිට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:)\n\"ශ්‍රද්ධාවෙන් ඕඝය තරණය කරයි. අප්‍රමාදයෙන් අර්ණවය තරණය කරයි. වීර්යයෙන් දුක ඉක්මවා යයි. ප්‍රඥාවෙන් පිරිසිදු වෙයි.\"\n\n(එවිට ආළවක යක්ෂයා මෙසේ කීවේය:)\n\"කෙසේ නම් ප්‍රඥාව ලබන්නේ ද? කෙසේ නම් ධනය ලබන්නේ ද? කෙසේ නම් කීර්තිය ලබන්නේ ද? කෙසේ නම් මිත්‍රයන් ඇති කරගන්නේ ද? මේ ලෝකයෙන් පරලොවට ගොස් කෙසේ නම් ශෝක නොකරන්නේ ද?\"\n\n(එවිට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:)\n\"අරහතුන් වහන්සේලා කෙරෙහි ශ්‍රද්ධාවෙන් යුක්තව, නිර්වාණය අවබෝධ කර ගැනීම සඳහා වූ ධර්මය ශ්‍රවණය කිරීමට කැමැත්තෙන් යුතුව, අප්‍රමාදීව හා නුවණැතිව ක්‍රියා කරන්නේ නම් ප්‍රඥාව ලබයි.\n\nඋචිත කාර්යයන්හි යෙදෙමින්, දැඩි අධිෂ්ඨානයෙන් හා වීර්යයෙන් යුතුව ක්‍රියා කරන්නා ධනය ලබයි. සත්‍යවාදී බවෙන් කීර්තිය ලබයි. දන්දීමෙන් මිත්‍රයන් ඇති කරගනී. මේ ලෝකයෙන් පරලොවට ගොස් මෙලෙස ශෝක නොකරයි.\n\nශ්‍රද්ධාවන්ත ගිහියෙකුට සත්‍යය, දමනය, ධෛර්යය සහ ත්‍යාගශීලිත්වය යන මේ සතර ධර්මයන් තිබේ නම්, ඔහු සැබවින්ම පරලොව ගොස් ශෝක නොකරයි.\n\nඑසේ නම්, බොහෝ ශ්‍රමණයන් හා බ්‍රාහ්මණයන්ගෙන් අන් අයගෙනුත් අසන්න, සත්‍යය, දමනය, ත්‍යාගය සහ ඉවසීම යන මේවාට වඩා අන් කිසිවක් මේ ලෝකයේ තිබේදැ\"යි.\n\n(එවිට ආළවක යක්ෂයා මෙසේ කීවේය:)\n\"කෙසේ නම් දැන් බොහෝ ශ්‍රමණයන් හා බ්‍රාහ්මණයන්ගෙන් අසන්න ද? යම් හෙයකින් මම අද දින පරලොවට හිතකර අර්ථය කුමක්දැයි අවබෝධ කළෙමි.\n\nඅහෝ! බුදුරජාණන් වහන්සේ මාගේ යහපත පිණිස ආළවියට වැඩම කළ සේක. යම් හෙයකින් මම අද දින දීමෙන් මහත් ඵල ලැබෙන තැන කුමක්දැයි අවබෝධ කළෙමි.\n\nඑබැවින් මම ගමෙන් ගමට, නගරයෙන් නගරයට හැසිරෙන්නෙමි. සම්බුදුරජාණන් වහන්සේට නමස්කාර කරමින්, ධර්මයේ උතුම් ස්වභාවය ද ප්‍රකාශ කරමින්.\"",
      "paliTitle": "Āḷavakasuttaṃ",
      "vagga": ""
    }
  ],
  "footer": {
    "pali": "Yakkhasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Indako sakka sūci ca, maṇibhaddo ca sānu ca; Piyaṅkara punabbasu sudatto ca, dve sukkā cīraāḷavīti dvādasa.",
    "english": "",
    "sinhala": ""
  }
}