{
  "id": "sn.1.4",
  "title": {
    "pali": "Mārasaṃyuttaṃ",
    "english": "The Connected Discourses with Māra",
    "sinhala": "මාර සංයුත්තය"
  },
  "sections": [
    {
      "number": 137,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhamūle paṭhamābhisambuddho. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘mutto vatamhi tāya dukkarakārikāya. Sādhu mutto vatamhi tāya anatthasaṃhitāya dukkarakārikāya. Sādhu vatamhi mutto bodhiṃ samajjhaga’’nti [sādhu ṭhito sato bodhiṃ samajjheganti (sī. pī.), sādhu vatamhi satto bodhisamajjhagūti (syā. kaṃ.)]. Atha kho māro pāpimā bhagavato cetasā cetoparivitakkamaññāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Tapokammā apakkamma, yena na sujjhanti māṇavā; Asuddho maññasi suddho, suddhimaggā aparaddho’’ [suddhimaggamaparaddho (sī. syā. kaṃ. pī.)] ti. Atha kho bhagavā ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi ajjhabhāsi – ‘‘Anatthasaṃhitaṃ ñatvā, yaṃ kiñci amaraṃ tapaṃ [aparaṃ tapaṃ (ka.)]; Sabbaṃ natthāvahaṃ hoti, phiyārittaṃva dhammani [vammani (sī.), dhammaniṃ (pī.), jammaniṃ (ka.) etthāyaṃ dhammasaddo sakkate dhanvanaṃ-saddena sadiso maruvācakoti veditabbo, yathā daḷhadhammātipadaṃ]. ‘‘Sīlaṃ samādhi paññañca, maggaṃ bodhāya bhāvayaṃ; Pattosmi paramaṃ suddhiṃ, nihato tvamasi antakā’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti, dukkhī dummano tatthevantaradhāyīti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Uruvelā, on the bank of the Nerañjarā River, at the foot of the Ajapāla Banyan tree, having just attained full awakening.\n\nThen, while the Blessed One was in seclusion, a reflection arose in his mind: \"I am indeed freed from that severe asceticism. Happily, I am freed from that severe asceticism which was not conducive to welfare. Happily, I am freed and have attained awakening.\"\n\nThen Māra, the Evil One, knowing with his mind the reflection in the Blessed One’s mind, approached the Blessed One and addressed him with a stanza:\n\"You have deviated from ascetic practices by which mortals are not purified. Though impure, you imagine yourself pure; you have strayed from the path to purity.\"\n\nThen the Blessed One, knowing \"This is Māra, the Evil One,\" addressed Māra, the Evil One, with stanzas:\n\"Having understood that any form of self-mortification which is not conducive to well-being leads only to ruin, it is like a damaged reed caught in a trap. Developing morality, concentration, and wisdom—the path to awakening—I have attained supreme purity. You, the Destroyer, are vanquished!\"\n\nThen Māra, the Evil One, thinking \"The Blessed One knows me, the Fortunate One knows me,\" distressed and disheartened, disappeared right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ උරුවෙල් දනව්වෙහි, නේරංජරා නදී තීරයෙහි, අජපාල නුග රුක්මුල පළමුවෙන් සම්බුද්ධත්වයට පත් වූවාහු වැඩවසන සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ රහස් ස්ථානයට ගොස් පටිසංලීන (තනි වූ) සේක් කල්හි \"මම ඒ දුෂ්කර ක්‍රියාවෙන් මුදනා ලද්දෙමි. ඒ අනර්ථයට හිත වූ දුෂ්කර ක්‍රියාවෙන් මුදනා ලද්දේ ඉතා යහපත්ය. ඉතා යහපත්ය, මම මුදනා ලද්දේ බෝධිය අවබෝධ කළෙමි\" යනුවෙන් මෙබඳු චිත්ත විතර්කයක් පහළ විය.\n\nඉක්බිති පව්කම් ඇත්තා වූ මාරයා භාග්‍යවතුන් වහන්සේගේ සිතින් චිත්ත විතර්කය දැනගෙන භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසුවේය: \"මිනිස්සු යම් තපස් ක්‍රියා මාර්ගයකින් කිසිවිටක නොපිරිසිදු වෙත්ද, එබඳු තපස් ක්‍රියාවෙන් ඔබ බැහැර වී, අපිරිසිදු ව සිටියදීත් පිරිසිදු යැයි සිතන්නෙහිය. පාරිශුද්ධි මාර්ගයෙන් ඔබ බැහැර වී සිටින්නෙහිය.\"\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ \"මේ පව්කම් ඇත්තා වූ මාරයාය\" යැයි දැනගෙන පව්කම් ඇත්තා වූ මාරයාට ගාථාවලින් මෙසේ පැවසූ සේක: \"යම් කිසි අනර්ථයට හිත වූ, අමරණීයත්වයට නොපමුණුවන තපසක් වේද, ඒ සියල්ල විනාශයට පමුණුවන්නේය, දුන්නක් කැඩී ගිය කල අර්ථ විරහිත වන්නා සේම. සීලය, සමාධිය, ප්‍රඥාව යන බෝධිය සඳහා වූ මාර්ගය වඩමින් මම පරම පාරිශුද්ධියට පැමිණියෙමි. ඔබ මාරයා (මාරයා නමැති අන්තකයා), පරදවන ලද්දෙහිය.\"\n\nඉක්බිති පව්කම් ඇත්තා වූ මාරයා \"භාග්‍යවතුන් වහන්සේ මා හඳුනන සේක, සුගතයන් වහන්සේ මා හඳුනන සේක\" යනුවෙන් දුකෙන්, සිත් තැවුලෙන් යුක්තව එතැනම අතුරුදන් විය.",
      "paliTitle": "Tapokammasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 138,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhamūle paṭhamābhisambuddho. Tena kho pana samayena bhagavā rattandhakāratimisāyaṃ abbhokāse nisinno hoti, devo ca ekamekaṃ phusāyati. Atha kho māro pāpimā bhagavato bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo mahantaṃ hatthirājavaṇṇaṃ abhinimminitvā yena bhagavā tenupasaṅkami. Seyyathāpi nāma mahāariṭṭhako maṇi, evamassa sīsaṃ hoti. Seyyathāpi nāma suddhaṃ rūpiyaṃ, evamassa dantā honti. Seyyathāpi nāma mahatī naṅgalīsā [naṅgalasīsā (pī. ka.)], evamassa soṇḍo hoti. Atha kho bhagavā ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāya ajjhabhāsi – ‘‘Saṃsaraṃ dīghamaddhānaṃ, vaṇṇaṃ katvā subhāsubhaṃ; Alaṃ te tena pāpima, nihato tvamasi antakā’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "Thus have I heard – On one occasion, the Blessed One was dwelling in Uruvelā, on the bank of the Nerañjarā River, at the foot of the Ajapāla Banyan tree, having just newly attained full enlightenment. Now at that time, the Blessed One was sitting in the open air amidst the profound darkness of night, and rain was falling drop by drop. Then, Māra, the Evil One, desiring to arouse fear, trepidation, and horripilation in the Blessed One, conjured up the form of a great royal elephant and approached where the Blessed One was. Its head was like a great dark and precious gem. Its tusks were like pure silver. Its trunk was like a great plowshare. Then the Blessed One, perceiving, 'This is Māra, the Evil One,' addressed Māra, the Evil One, with a verse – \"Wandering on for a long journey, assuming forms, both beautiful and ugly; Enough for you of that, Evil One! You are vanquished by the Destroyer!\" Then Māra, the Evil One, thinking, 'The Blessed One knows me, the Fortunate One knows me!' — distressed and dejected, vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි, භාග්‍යවතුන් වහන්සේ අලුතින්ම සම්බුද්ධත්වයට පත්ව, උරුවේලායෙහි, නේරංජරා නදී තීරයෙහි, අජපාල නුගරුක මුලෙහි වාසය කරමින් සිටියහ.\n\nඒ අවධියෙහි, භාග්‍යවතුන් වහන්සේ රාත්‍රී අන්ධකාරයෙන් සහ තිමිරාවෙන් ගහන වූ එළිමහනේ වැඩසිටි සේක, වරින් වර වැසි පොදක් ද පතිත විය. ඉන්පසු, පව්කාර මාරයා භාග්‍යවතුන් වහන්සේට බියක්, තැතිගැනීමක් සහ ලොම් කෙළින් වීමක් ඇති කිරීමට කැමැත්තෙන්, මහා හස්තිරාජ වේශයක් මවාගෙන භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. ඔහුගේ හිස මහා අරිෂ්ටක මාණික්‍යයක් මෙන් විය. ඔහුගේ දත් පිරිසිදු රිදී මෙන් විය. ඔහුගේ සොඬය මහත් වූ නගුල් ඊසා දණ්ඩක් මෙන් විය. ඉන්පසු භාග්‍යවතුන් වහන්සේ, ‘‘මේ පව්කාර මාරයාය’’යි දැනගෙන, පව්කාර මාරයාට ගාථාවකින් මෙසේ වදාළ සේක:\n\n‘‘දීර්ඝ කාලයක් මුළුල්ලේ සංසාරයේ සැරිසරමින්, ශුභ වූද අශුභ වූද වේශයන් මවාගෙන, පව්කාරය, එයින් තොපට වැඩක් නැත. පව්කාරය, තොප මරණය විසින්ම පරාජය කරනු ලැබ ඇත!’’\n\nඉන්පසු පව්කාර මාරයා, ‘‘භාග්‍යවතුන් වහන්සේ මා හඳුනති, සුගතයන් වහන්සේ මා හඳුනති’’ යි සිතා, දුකට පත්ව, දොම්නසින් යුතුව, එහිම අතුරුදහන් විය.",
      "paliTitle": "Hatthirājavaṇṇasuttaṃ"
    },
    {
      "number": 139,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhamūle paṭhamābhisambuddho. Tena kho pana samayena bhagavā rattandhakāratimisāyaṃ abbhokāse nisinno hoti, devo ca ekamekaṃ phusāyati. Atha kho māro pāpimā, bhagavato bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo, yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato avidūre uccāvacā vaṇṇanibhā upadaṃseti, subhā ceva asubhā ca. Atha kho bhagavā ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi ajjhabhāsi – ‘‘Saṃsaraṃ dīghamaddhānaṃ, vaṇṇaṃ katvā subhāsubhaṃ; Alaṃ te tena pāpima, nihato tvamasi antaka. ‘‘Ye ca kāyena vācāya, manasā ca susaṃvutā; Na te māravasānugā, na te mārassa baddhagū’’ [baddhabhū (ka.), paccagū (sī. syā. kaṃ. pī.)] ti. Atha kho māro…pe… tatthevantaradhāyīti.",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling in Uruvelā, on the bank of the Nerañjarā River, at the foot of the Ajapāla Banyan tree, having just attained full enlightenment. Now at that time, the Blessed One was seated in the open air amidst the thick darkness of the night, and rain was falling sporadically. Then indeed, Māra, the Evil One, desiring to arouse fear, agitation, and goosebumps in the Blessed One, approached him. Having approached, he displayed various forms and appearances, both beautiful and ugly, not far from the Blessed One.\n\nThen the Blessed One, realizing, 'This is Māra, the Evil One,' addressed Māra, the Evil One, with verses: \"Wandering through existence for a long journey, creating forms both beautiful and ugly – that is enough for you, Evil One! You are vanquished, Ender. Those who are well-restrained in body, speech, and mind are not subservient to Māra's power; they are not bound by Māra.\"\n\nThen Māra, the Evil One, vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක, භාග්‍ZWJයවතුන් වහන්සේ ප්‍රZWJථමයෙන්ම සම්බුද්ධත්වයට පත් වූ අලුත උරුවෙල් දනව්වෙහි නේරංජරා නදී තීරයෙහි අජපාල නුග රුක්මුලෙහි වැඩසිටින සේක.\n\nඒ කල්හි භාග්‍ZWJයවතුන් වහන්සේ රාත්‍රි කාලයෙහි ඝන අන්ධකාරයෙහි එළිමහනෙහි වැඩහිඳින සේක; වරින් වර වැසි බිංදු පතිත වේ.\n\nඉන් පසු පාපී මාරයා, භාග්‍ZWJයවතුන් වහන්සේට බිය, තැතිගැනීම හා ලොමුදැහැගැන්ම ඇති කිරීමට කැමතිව, භාග්‍ZWJයවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, එළඹ, භාග්‍ZWJයවතුන් වහන්සේට නුදුරුව, සුබ වූද අසුබ වූද නොයෙකුත් වර්ණ ශෝභා මවා පෙන්වීය.\n\nඉන් පසු භාග්‍ZWJයවතුන් වහන්සේ \"මේ පාපී මාරයාය\" යි දැන, ඒ පාපී මාරයාට ගාථාවලින් වදාළ සේක:\n\n\"පාපී මාරය, දීර්ඝ කාලයක් සංසාරයෙහි සැරිසරමින්, සුබ අසුබ රූප මවා පෙන්වීමෙන් නුඹට පලක් නැත. අන්තකය, නුඹ පරාජය කරනු ලැබූවෙක් වේ.\n\nයම් කෙනෙක් කයින්, වචනයෙන් හා සිතින් මනා ලෙස සංවර වූවෝද, ඔවුහු මාරයාගේ වසඟයට නොයන්නාහ. ඔවුහු මාරයාට බැඳී සිටින්නෝ නොවෙති\" යි.\n\nඉන් පසු මාරයා එහිම අතුරුදහන් විය.",
      "paliTitle": "Subhasuttaṃ"
    },
    {
      "number": 140,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Mayhaṃ kho, bhikkhave, yoniso manasikārā yoniso sammappadhānā anuttarā vimutti anuppattā, anuttarā vimutti sacchikatā. Tumhepi, bhikkhave, yoniso manasikārā yoniso sammappadhānā anuttaraṃ vimuttiṃ anupāpuṇātha, anuttaraṃ vimuttiṃ sacchikarothā’’ti. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Baddhosi mārapāsena, ye dibbā ye ca mānusā; Mārabandhanabaddhosi, na me samaṇa mokkhasī’’ti. ‘‘Muttāhaṃ [muttohaṃ (sī. syā. kaṃ. pī.)] mārapāsena, ye dibbā ye ca mānusā; Mārabandhanamuttomhi, nihato tvamasi antakā’’ti. Atha kho māro pāpimā…pe… tatthevantaradhāyīti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Bārāṇasī, at Isipatana, in the Deer Park. There the Blessed One addressed the monks, saying, \"Monks.\" \"Venerable sir,\" those monks replied to the Blessed One. The Blessed One spoke thus: \"Monks, for me, by wise attention and wise right striving, supreme liberation has been attained; supreme liberation has been directly experienced. You too, monks, by wise attention and wise right striving, should attain supreme liberation; you should directly experience supreme liberation.\" Then Māra the Evil One approached the Blessed One; having approached, he addressed the Blessed One with a verse: \"You are bound by Māra's snares, both divine and human. You are bound by Māra's fetters; you will not escape me, ascetic.\" \"I am freed from Māra's snares, both divine and human. I am freed from Māra's fetters. You are defeated, O Destroyer.\" Then Māra the Evil One, knowing, \"The Blessed One knows me, the Fortunate One knows me,\" sad and disappointed, vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයෙක භාග්‍යවතුන් වහන්සේ බරණැස ඉසිපතන මිගදායෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා ‘‘මහණෙනි’’යි වදාළ සේක. ‘‘වහන්සැ’’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක – ‘‘මහණෙනි, මා හට නම් යෝනිසෝ මනසිකාරය කරණකොටගෙනද, යෝනිසෝ සම්මප්ප්‍රධානයන් කරණකොටගෙනද අනුත්තර විමුක්තිය අනුප්‍රාප්ත කරන ලදී, අනුත්තර විමුක්තිය සාක්ෂාත් කරන ලදී. මහණෙනි, නුඹලාද යෝනිසෝ මනසිකාරය කරණකොටගෙනද, යෝනිසෝ සම්මප්ප්‍රධානයන් කරණකොටගෙනද අනුත්තර විමුක්තිය අනුප්‍රාප්ත කරව්, අනුත්තර විමුක්තිය සාක්ෂාත් කරව්’’යි.\n\nඑකල්හි පාපී මාරයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවේය – ‘‘දිව්‍ය වූ ද මනුෂ්‍ය වූ ද යම් (රාගාදී කෙලෙස්) ඇද්ද, ඒ මාරපාශයෙන් ඔබ බැඳී සිටින්නෙහි ය. මාරබන්ධනයෙන් ඔබ බැඳී සිටින්නෙහි ය. මහණ, ඔබ මාගෙන් මිදෙන්නේ නැතැ’’යි.\n\n‘‘දිව්‍ය වූ ද මනුෂ්‍ය වූ ද යම් (රාගාදී කෙලෙස්) ඇද්ද, ඒ මාරපාශයෙන් මම මිදුණෙමි. මාරබන්ධනයෙන් මම මිදුණෙමි. මාරයා, නුඹ පරාජය කරන ලද්දෙකි’’යි. එකල්හි පාපී මාරයා... එතැනම අතුරුදන් විය.",
      "paliTitle": "Paṭhamamārapāsasuttaṃ"
    },
    {
      "number": 141,
      "pali": "Ekaṃ samayaṃ bhagavā bārāṇasiyaṃ viharati isipatane migadāye. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Muttāhaṃ, bhikkhave, sabbapāsehi ye dibbā ye ca mānusā. Tumhepi, bhikkhave, muttā sabbapāsehi ye dibbā ye ca mānusā. Caratha, bhikkhave, cārikaṃ bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Mā ekena dve agamittha. Desetha, bhikkhave, dhammaṃ ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāsetha. Santi sattā apparajakkhajātikā, assavanatā dhammassa parihāyanti. Bhavissanti dhammassa aññātāro. Ahampi, bhikkhave, yena uruvelā senānigamo tenupasaṅkamissāmi dhammadesanāyā’’ti. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Baddhosi sabbapāsehi, ye dibbā ye ca mānusā; Mahābandhanabaddhosi, na me samaṇa mokkhasī’’ti. ‘‘Muttāhaṃ sabbapāsehi, ye dibbā ye ca mānusā; Mahābandhanamuttomhi, nihato tvamasi antakā’’ti. Atha kho māro pāpimā…pe… tatthevantaradhāyīti.",
      "english": "At one time, the Blessed One was dwelling in Bārāṇasī, at Isipatana, in the Deer Park. There, the Blessed One addressed the monks, saying: \"Monks!\" And those monks replied to the Blessed One: \"Venerable Sir!\" The Blessed One then said this: \"I am freed, monks, from all entanglements, both divine and human. You too, monks, are freed from all entanglements, both divine and human. Go forth, monks, on your wandering for the welfare of the many, for the happiness of the many, out of compassion for the world, for the good, for the benefit, for the happiness of divine and human beings. Do not let two of you go by one road. Proclaim the Dhamma, monks, which is beautiful in its beginning, beautiful in its middle, and beautiful in its consummation; expound the holy life, complete in its meaning and its phrasing, utterly perfect and pure. There are beings with but little dust in their eyes, who are perishing due to not hearing the Dhamma. There will be those who understand the Dhamma. I too, monks, will go to the Senānigama of Uruvelā to teach the Dhamma.\"\n\nThen Māra, the Evil One, approached the Blessed One. Having approached, he addressed the Blessed One in verse: \"You are bound by all entanglements, both divine and human. You are bound by a great bond, O recluse; you will not escape me.\"\n\n\"I am freed from all entanglements, both divine and human. I am freed from the great bond. You, O Destroyer, are defeated!\"\n\nThen Māra, the Evil One, right there vanished.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ බරණැසෙහි ඉසිපතන මිගදායේ වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, යම් දිව්‍යමය වූද, යම් මනුෂ්‍යමය වූද, සියලු බැමිවලින් මම මුක්තව සිටිමි. මහණෙනි, ඔබලාද යම් දිව්‍යමය වූද, යම් මනුෂ්‍යමය වූද, සියලු බැමිවලින් මුක්තව සිටිහුය.\n\nමහණෙනි, බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සැපය පිණිස, ලෝකයාට අනුකම්පා පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සැපය පිණිස චාරිකාවේ හැසිරෙව්. එක මගකින් දෙදෙනෙක් නොයව්. මහණෙනි, මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යඤ්ජන සහිත වූ, ඒක අංගයෙන් පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරව්. ඇස්වළු අල්ප වූ සත්වයෝ සිටිත්. ධර්මය නොඇසීමෙන් ඔවුහු පිරිහී යති. ධර්මය අවබෝධ කරන්නෝද වන්නාහුය. මහණෙනි, මමද ධර්ම දේශනා කිරීම පිණිස ඌරුවෙලා සේනානිග්‍රාමය යම් තැනකද, ඒ තැනට උපසංක්‍රමණය කරන්නෙමි\" යි.\n\nඑකල්හි පවිටු මාරයා භාග්‍යවතුන් වහන්සේ යම් තැනකද, ඒ තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවේය: \"දිව්‍යමය වූද, මනුෂ්‍යමය වූද, සියලු බැමිවලින් ඔබ බැඳී සිටිහි. මහත් බැම්මකින් බැඳී සිටිහි. මහණ, මගෙන් නිදහස් නොවන්නෙහි\" යි.\n\n\"දිව්‍යමය වූද, මනුෂ්‍යමය වූද, සියලු බැමිවලින් මම මුක්තව සිටිමි. මහත් බැම්මෙන් ද මුක්තව සිටිමි. මරණයට පත් කරන්නා වූ නුඹ පරාජය කරනු ලැබුවෙහි\" යි. එකල්හි පවිටු මාරයා එතැනම අතුරුදන් විය.",
      "paliTitle": "Dutiyamārapāsasuttaṃ"
    },
    {
      "number": 142,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena bhagavā rattandhakāratimisāyaṃ abbhokāse nisinno hoti, devo ca ekamekaṃ phusāyati. Atha kho māro pāpimā bhagavato bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo mahantaṃ sapparājavaṇṇaṃ abhinimminitvā yena bhagavā tenupasaṅkami. Seyyathāpi nāma mahatī ekarukkhikā nāvā, evamassa kāyo hoti. Seyyathāpi nāma mahantaṃ soṇḍikākiḷañjaṃ, evamassa phaṇo hoti. Seyyathāpi nāma mahatī kosalikā kaṃsapāti, evamassa akkhīni bhavanti. Seyyathāpi nāma deve gaḷagaḷāyante vijjullatā niccharanti, evamassa mukhato jivhā niccharati. Seyyathāpi nāma kammāragaggariyā dhamamānāya saddo hoti, evamassa assāsapassāsānaṃ saddo hoti. Atha kho bhagavā ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi ajjhabhāsi – ‘‘Yo suññagehāni sevati, Seyyo so muni attasaññato; Vossajja careyya tattha so, Patirūpañhi tathāvidhassa taṃ. ‘‘Carakā bahū bheravā bahū, Atho ḍaṃsasarīsapā [ḍaṃsa siriṃsapā (sī. syā. kaṃ. pī.)] bahū; Lomampi na tattha iñjaye, Suññāgāragato mahāmuni. ‘‘Nabhaṃ phaleyya pathavī caleyya, Sabbepi pāṇā uda santaseyyuṃ; Sallampi ce urasi pakappayeyyuṃ, Upadhīsu tāṇaṃ na karonti buddhā’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling at Rājagaha, in the Bamboo Grove, the Squirrels' Feeding Ground.\n\nNow at that time the Blessed One was seated in the open air amidst the darkness of the night, and a fine drizzle was falling. Then Māra, the Evil One, desiring to arouse fear, trepidation, and a thrill of horror in the Blessed One, having created a monstrous image of a king cobra, approached the Blessed One. Just as a huge boat made from a single tree trunk, so was its body. Just as a huge brewer's mat, so was its hood. Just as a huge bronze bowl from Kosala, so were its eyes. Just as lightning flashes forth when the thunder rumbles, so did its tongue dart from its mouth. Just as the sound of a blacksmith's bellows being worked, so was the sound of its inhalations and exhalations.\n\nThen the Blessed One, having known \"This is Māra, the Evil One,\" addressed Māra, the Evil One, with these verses:\n\"Whoever resorts to empty dwellings, that sage, self-restrained, is excellent. He should let go and wander there, for that is fitting for one of his kind.\nMany are the wandering creatures, many are the terrifying beings, and many are the biting creatures and snakes. Let not even a hair of the great sage, gone to an empty dwelling, be disturbed there.\nShould the sky split open, should the earth quake, and all beings be terrified, even if they were to conceive of a dart in their heart, Buddhas find no refuge in attachments.\"\n\nThen Māra, the Evil One, thinking, \"The Blessed One knows me, the Fortunate One knows me,\" grieved and disheartened, vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන කලන්දකනිවාප නම් ස්ථානයේ වැඩසිටින සේක. ඒ වේලාවේ භාග්‍යවතුන් වහන්සේ රාත්‍රියේ ගනඳුරෙහි එළිමහනේ වැඩහුන් සේක. සීතල වැහි බිංදු එකින් එකට වැටෙමින් තිබිණි. එකල්හී පවිටු මාරයා භාග්‍යවතුන් වහන්සේට භය, තැතිගැන්ම, හා ලොමුදැහැගැන්ම ඇති කරවීමට කැමතිව, මහත් නාගරාජ වේශයක් මවාගෙන භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. ඒ විශාල නාගයාගේ ශරීරය එකම ගසකින් තැනූ මහත් නැවක් බඳු විය. ඔහුගේ පෙණය කුඹුරු පුරා අතුරන ලද මහත් පැදුරක් බඳු විය. ඔහුගේ ඇස් මහත් කහවණු පිරවූ කොසොල් පාත්‍රයක් බඳු විය. අහස ගිගුම් දෙන විට විදුලි වැල් නිකුත් වන්නා සේ, ඔහුගේ මුවින් දිව නිකුත් විය. කම්මල්කරුවාගේ බකළය (වාතය පිඹින උපකරණය) පිඹින විට හටගන්නා ශබ්දය මෙන්, ඔහුගේ ආශ්වාස ප්‍රශ්වාසයන්ගේ ශබ්දය විය. එකල්හී භාග්‍යවතුන් වහන්සේ \"මේ පවිටු මාරයා ය\" යි දැන, පවිටු මාරයාට ගාථාවලින් වදාළ සේක:\n\n\"යමෙක් ශූන්‍ය ගෘහයන් සේවනය කරන්නේද (හුදෙකලා ස්ථානවල වාසය කරන්නේද), ඔහු අතිශයින් ශ්‍රේෂ්ඨ මුනියෙකි, ආත්ම සංවර ඇති කෙනෙකි. ඔහු එහි සියල්ල (දස අකුසල්) අතහැර වාසය කළ යුතුය. මක්නිසාද, එය එබඳු අයට සුදුසු දෙයකි.\n\nශූන්‍යාගාරයට ගිය මහමුනීන් වහන්සේ බොහෝ ගමන්කරන්නන් (සත්වයන්), බොහෝ භයානක සත්වයන්, එසේම බොහෝ මැසි, මදුරු, සර්ප ආදීන් සිටියදීත්, එහිදී ලොමයක් පමණවත් කම්පා නොකරති.\n\nඅහස පැළී ගියද, පොළොව කම්පා වුවද, සියලු සත්වයෝ භයින් තැතිගත්ත ද, ඊතලයක් වුව ද පපුවේ රඳවනවා නම් (පපුවට විදිනවා වුව ද), බුදුවරු උපාධීන් (තණ්හාව සහිත ලෝකය) කෙරෙහි ආරක්ෂාවක් හෝ ඇල්මක් ඇති නොකරති.\"\n\nඑකල්හී පවිටු මාරයා \"භාග්‍යවතුන් වහන්සේ මා හඳුනන සේක, සුගතයන් වහන්සේ මා හඳුනන සේක\" යි (සිතා) දුකෙන් හා සිත් තැවුලෙන් යුක්තව එතැනම අතුරුදහන් විය.",
      "paliTitle": "Sappasuttaṃ"
    },
    {
      "number": 143,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho bhagavā bahudevarattiṃ abbhokāse caṅkamitvā rattiyā paccūsasamayaṃ pāde pakkhāletvā vihāraṃ pavisitvā dakkhiṇena passena sīhaseyyaṃ kappesi pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kiṃ soppasi kiṃ nu soppasi, Kimidaṃ soppasi dubbhago [dubbhato (syā. kaṃ.), dubbhayo (pī.)] viya; Suññamagāranti soppasi, Kimidaṃ soppasi sūriye uggate’’ti. ‘‘Yassa jālinī visattikā, Taṇhā natthi kuhiñci netave; Sabbūpadhiparikkhayā buddho, Soppati kiṃ tavettha mārā’’ti. Atha kho māro pāpimā…pe… tatthevantaradhāyīti.",
      "english": "At one time the Blessed One was dwelling in Rājagaha, in the Bamboo Grove at the Squirrels' Feeding Ground. Then, after having walked in the open air for much of the night, the Blessed One, in the early morning, having washed his feet and entered his dwelling, lay down on his right side in the lion's posture, placing one foot on the other, mindful and clearly comprehending, having kept in mind the perception of arising.\n\nThen Māra, the Evil One, approached the Blessed One. Having approached, he addressed the Blessed One with a verse: “Why do you sleep? Why indeed do you sleep? Why do you sleep like one so wretched? Do you sleep as if in an empty house? Why do you sleep when the sun has risen?”\n\n“For whom the entangling, clinging craving does not exist to lead him anywhere, the Awakened One, due to the complete destruction of all attachments, rests. What concern is that to you, Māra?”\n\nThen Māra, the Evil One, vanished right there.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් කලන්දක නිවාපයේ වැඩසිටින සේක. අනතුරුව භාග්‍යවතුන් වහන්සේ බොහෝ රැය එළිමහනේ සක්මන් කොට, රාත්‍රියේ අලුයම් කාලයේදී පා දෝවනය කරගෙන විහාරයට පිවිස, සිහි නුවණින් යුක්තව, නැගී සිටීමේ සංඥාව මෙනෙහි කරමින්, එක් පාදයක් මත අනෙක් පාදය තබා දකුණු පසින් සිංහ සෙය්‍යාවෙන් සැතපෙන සේක.\n\nඅනතුරුව පව්කාර මාරයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසුවේය: “සැතපෙන්නේ කිමද, සැතපෙන්නේ කිමද? අවාසනාවන්තයකු මෙන් කුමට මෙසේ සැතපෙන්නේද? හිස් වූ නිවසක මෙන් සැතපෙන්නේද? හිරු නැගී ඇති කල්හි කුමට මෙසේ සැතපෙන්නේද?”\n\n“ජාලයක් බඳු, දැඩි ඇලීමක් ඇති තෘෂ්ණාව කිසි තැනකට පමුණුවීමට නැත්තා වූ, සියලු උපාධීන්ගේ ක්ෂය වීමෙන් බුදු වූ තැනැත්තා සැතපේ. මාරය, මෙහි තට කුමක්ද?”\n\nඅනතුරුව පව්කාර මාරයා එතැනම අතුරුදහන් විය.",
      "paliTitle": "Supatisuttaṃ"
    },
    {
      "number": 144,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Nandati puttehi puttimā, gomā gobhi tatheva nandati; Upadhīhi narassa nandanā, na hi so nandati yo nirūpadhī’’ti. ‘‘Socati puttehi puttimā, gomā gobhi tatheva socati; Upadhīhi narassa socanā, na hi so socati yo nirūpadhī’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "Thus have I heard. At one time the Blessed One was dwelling in Sāvatthī, at Jetavana, in Anāthapiṇḍika’s monastery. Then Māra, the Evil One, approached the Blessed One. Having approached, he recited this verse in the presence of the Blessed One:\n\n“One who has children rejoices in children; one who has cattle likewise rejoices in cattle.\nThe rejoicing of a person comes from attachments; indeed, one who is without attachments does not rejoice.”\n\n“One who has children grieves over children; one who has cattle likewise grieves over cattle.\nThe sorrow of a person comes from attachments; indeed, one who is without attachments does not grieve.”\n\nThen Māra, the Evil One, thinking, “The Blessed One knows me! The Fortunate One knows me!” became dejected and sorrowful, and vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල්හි පාපී මාරයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි මේ ගාථාව කීවේය: \"පුත්‍රයන් ඇති තැනැත්තා පුත්‍රයන්ගෙන් සතුටු වෙයි. ගවයන් ඇති තැනැත්තා ගවයන්ගෙන්ද එලෙසින්ම සතුටු වෙයි. මිනිසාට සතුට උපදින්නේ උපධිවලිනි. උපධි රහිත තැනැත්තා කිසිසේත් සතුටු නොවෙයි.\" \"පුත්‍රයන් ඇති තැනැත්තා පුත්‍රයන්ගෙන් ශෝක වෙයි. ගවයන් ඇති තැනැත්තා ගවයන්ගෙන්ද එලෙසින්ම ශෝක වෙයි. මිනිසාට ශෝකය උපදින්නේ උපධිවලිනි. උපධි රහිත තැනැත්තා කිසිසේත් ශෝක නොවෙයි.\" එකල්හි පාපී මාරයා \"භාග්‍යවතුන් වහන්සේ මා හඳුනති, සුගතයන් වහන්සේ මා හඳුනති\" යි සිතා, දුකට පත් වී, මැලවී, එතැනම අතුරුදහන් විය.",
      "paliTitle": "Nandatisuttaṃ"
    },
    {
      "number": 145,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Appamidaṃ, bhikkhave, manussānaṃ āyu. Gamanīyo samparāyo, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ. Natthi jātassa amaraṇaṃ. Yo, bhikkhave, ciraṃ jīvati, so vassasataṃ appaṃ vā bhiyyo’’ti. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Dīghamāyu manussānaṃ, na naṃ hīḷe suporiso; Careyya khīramattova, natthi maccussa āgamo’’ti. ‘‘Appamāyu manussānaṃ, hīḷeyya naṃ suporiso; Careyyādittasīsova, natthi maccussa nāgamo’’ti. Atha kho māro…pe… tatthevantaradhāyīti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. There, the Blessed One addressed the bhikkhus, saying: 'Bhikkhus!' 'Venerable Sir,' those bhikkhus replied to the Blessed One. The Blessed One said this: 'Brief, bhikkhus, is the life of human beings. The journey to the beyond is imminent; wholesome action is to be done; the holy life is to be lived. There is no escape from death for one who is born. Whoever, bhikkhus, lives long, lives a hundred years or a little more than that.'\n\nThen Māra, the Evil One, approached the Blessed One. Having approached, he addressed the Blessed One with a verse:\n'Long is the life of human beings; a good person should not despise it.\nOne should act like a suckling calf, for there is no arrival of death.'\n(The Blessed One responded):\n'Brief is the life of human beings; a good person should despise it.\nOne should act as if one's head were on fire, for there is no non-arrival of death.'\nThen Māra, the Evil One, dejected and disheartened, thinking, 'The Blessed One knows me, the Fortunate One knows me,' vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දක නිවාපයේ වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා ‘‘මහණෙනි’’ යි වදාළ සේක. ඒ භික්ෂූහු ‘‘වහන්සැ’’ යි භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ‘‘මහණෙනි, මිනිසුන්ගේ ආයුෂ අල්පය. පරලොවට යාම නියතය, කුසල් කළ යුතුමය, බ්‍රහ්මචරියාව පිරිය යුතුමය. උපන් කෙනෙකුට නොමළ බවක් නැත. මහණෙනි, යමෙක් දීර්ඝ කාලයක් ජීවත් වේද, ඔහු වසර සියයක්, ඊට අඩු හෝ වැඩි කාලයක් ජීවත් වේ.’’\n\nඉක්බිති පාපී මාරයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසීය: ‘‘මිනිසුන්ගේ ආයුෂ දීර්ඝය, යහපත් පුරුෂයා එය හෙළා නොදැකිය යුතුය; කිරි බොන ළදරුවකු මෙන් හැසිරිය යුතුය, මරණය පැමිණීමක් නැතැ’’ යි.\n\n‘‘මිනිසුන්ගේ ආයුෂ අල්පය, යහපත් පුරුෂයා එය හෙළාදැකිය යුතුය; හිස ගිනි ගත්තකු මෙන් යුහුසුළු විය යුතුය, මරණය නොපැමිණීමක් නැතැ’’ යි.\n\nඉක්බිති මාරයා එතැනම අතුරුදහන් විය.",
      "paliTitle": "Paṭhamaāyusuttaṃ"
    },
    {
      "number": 146,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tatra kho bhagavā…pe… etadavoca – ‘‘Appamidaṃ, bhikkhave, manussānaṃ āyu. Gamanīyo samparāyo, kattabbaṃ kusalaṃ, caritabbaṃ brahmacariyaṃ. Natthi jātassa amaraṇaṃ. Yo, bhikkhave, ciraṃ jīvati, so vassasataṃ appaṃ vā bhiyyo’’ti. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Nāccayanti ahorattā, jīvitaṃ nūparujjhati; Āyu anupariyāyati, maccānaṃ nemīva rathakubbara’’nti. ‘‘Accayanti ahorattā, jīvitaṃ uparujjhati; Āyu khīyati maccānaṃ, kunnadīnaṃva odaka’’nti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti. Paṭhamo vaggo. Tassuddānaṃ – Tapokammañca nāgo ca, subhaṃ pāsena te duve; Sappo supati nandanaṃ, āyunā apare duveti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. There, indeed, the Blessed One said this:\n\n\"Monks, brief is the lifespan of humans. The destination is the next existence. Wholesome deeds must be done. The holy life must be lived. There is no deathlessness for one who is born. Whoever, monks, lives long, lives a hundred years or a little more than that.\"\n\nThen indeed Māra the Evil One approached the Blessed One, and having approached, addressed the Blessed One with a verse:\n\n\"Days and nights do not pass, life does not cease; the lifespan of mortals revolves continuously, like the rim of a chariot axle.\"\n\n\"Days and nights pass away, life ceases; the lifespan of mortals dwindles, like water in small rivers.\"\n\nThen indeed Māra the Evil One, thinking, \"The Blessed One knows me, the Fortunate One knows me,\" distressed and disheartened, vanished right there.\n\nFirst Chapter.\n\nIts summary is: Ascetic practice and the Nāga, and the auspicious with the snare, those two; the snake sleeps, Nandana, and the other two concerning lifespan.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දකනිවාප නම් ස්ථානයේ වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:\n\n“මහණෙනි, මිනිසුන්ගේ ආයුෂ අල්පයකි. පරලොවට යා යුත්තකි, කුසල් කළ යුත්තකි, බඹසර පැවැත්විය යුත්තකි. උපන් කිසිවකුට මරණයෙන් මිදීමක් නැත. මහණෙනි, යමෙක් දීර්ඝායුෂ වළඳයි නම්, හෙතෙම අවුරුදු සියයක් හෝ ඊට මඳක් වැඩියෙන් හෝ ජීවත් වේ.”\n\nඉන්පසු පාපී මාරයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, පැමිණ භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කථා කළේය:\n\n“දින අහෝරාත්‍රී ගෙවී යන්නේ නැත, ජීවිතය නිරුද්ධ වන්නේ ද නැත. මැරෙන සුලු සත්වයන්ගේ ආයුෂ, රථයක කුඹගස වටා රෝද සීමාව කැරකෙන්නාක් මෙන්, නොකඩවා පවතියි.”\n\n(භාග්‍යවතුන් වහන්සේ පිළිතුරු දුන් සේක): “දින අහෝරාත්‍රී ගෙවී යයි, ජීවිතය නිරුද්ධ වේ. මැරෙන සුලු සත්වයන්ගේ ආයුෂ, කුඩා ගංගාවල ජලය මෙන්, ක්ෂය වී යයි.”\n\nඉන්පසු පාපී මාරයා, ‘භාග්‍යවතුන් වහන්සේ මා හඳුනන සේක, සුගතයන් වහන්සේ මා හඳුනන සේකැ’යි (සිතා), දුක් වූයේ ද දොම්නස් වූයේ ද එහිම අතුරුදහන් විය.\n\nපළමු වග්ගයයි.\nඑහි උද්දානය (සාරාංශය) මෙයයි: තපෝකම්ම සූත්‍රය, නාග සූත්‍රය ද, සුභ සූත්‍රය, පාස සූත්‍රය යන සූත්‍ර දෙක ද, සප්ප සූත්‍රය, සුපති සූත්‍රය, නන්දන සූත්‍රය ද, ආයු සූත්‍රය, අපර සූත්‍රය යන සූත්‍ර දෙක යි.",
      "paliTitle": "Dutiyaāyusuttaṃ"
    },
    {
      "number": 147,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Tena kho pana samayena bhagavā rattandhakāratimisāyaṃ abbhokāse nisinno hoti, devo ca ekamekaṃ phusāyati. Atha kho māro pāpimā bhagavato bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato avidūre mahante pāsāṇe padālesi. Atha kho bhagavā ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāya ajjhabhāsi – ‘‘Sacepi kevalaṃ sabbaṃ, gijjhakūṭaṃ calessasi [gaḷeyyasi (syā. kaṃ.), caleyyāsi (ka.)]; Neva sammāvimuttānaṃ, buddhānaṃ atthi iñjita’’ntntti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "On one occasion, the Blessed One was dwelling in Rājagaha, on Vulture Peak Mountain. Now at that time, the Blessed One was sitting in the open air in the utter darkness of night, and a light rain was falling drop by drop. Then Māra, the Evil One, wishing to arouse fear, terror, and horripilation in the Blessed One, approached him. Having approached, he split apart a great rock not far from the Blessed One. Then the Blessed One, knowing, \"This is Māra, the Evil One,\" addressed Māra, the Evil One, with a verse: \"Even if you were to make all of Vulture Peak Mountain tremble entirely, there is no disturbance for those Buddhas who are rightly liberated.\" Then Māra, the Evil One, thinking, \"The Blessed One knows me, the Sugata knows me,\" distressed and dejected, vanished right there.",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ජකූට පර්වතයෙහි වැඩසිටින සේක. ඒ මොහොතෙහි භාග්‍යවතුන් වහන්සේ රාත්‍රියේ ඝන අන්ධකාරයෙහි එළිමහනෙහි වැඩසිටින සේක; වැස්ස ද එකින් එක බිංදු වශයෙන් වැටෙමින් තිබුණි. එවිට පාපී මාරයා භාග්‍යවතුන් වහන්සේට භය, තැතිගැනීම සහ ලොමුදැහැගැනීම ඇති කිරීමට කැමතිව, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට නුදුරෙහි මහත් ගල් පුපුරුවා හැරියේය. එවිට භාග්‍යවතුන් වහන්සේ \"මෙය පාපී මාරයාය\" යනුවෙන් දැනගෙන, ඒ පාපී මාරයාට ගාථාවකින් වදාළ සේක: \"යම් හෙයකින් ඔබ මුළු ගිජ්ජකූට පර්වතයම කම්පා කළත්, සම්‍යක් විමුක්තියෙන් මිදුණු බුදුවරුන්ට කිසිදු කම්පාවක්, චලනයක් හෝ තැතිගැනීමක් නොමවේ.\" එවිට පාපී මාරයා \"භාග්‍යවතුන් වහන්සේ මා හඳුනන සේක, සුගතයන් වහන්සේ මා හඳුනන සේක\" යනුවෙන් දුක් වූයේ, දොම්නස් වූයේ, එහිම අතුරුදහන් විය.",
      "paliTitle": "Pāsāṇasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 148,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena bhagavā mahatiyā parisāya parivuto dhammaṃ deseti. Atha kho mārassa pāpimato etadahosi – ‘‘ayaṃ kho samaṇo gotamo mahatiyā parisāya parivuto dhammaṃ deseti. Yaṃnūnāhaṃ yena samaṇo gotamo tenupasaṅkameyyaṃ vicakkhukammāyā’’ti. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kinnu sīhova nadasi, parisāyaṃ visārado; Paṭimallo hi te atthi, vijitāvī nu maññasī’’ti. ‘‘Nadanti ve mahāvīrā, parisāsu visāradā; Tathāgatā balappattā, tiṇṇā loke visattika’’nti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "At one time, the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. Now at that time, the Blessed One, surrounded by a large assembly, was teaching the Dhamma. Then it occurred to Māra the Evil One: \"This ascetic Gotama, surrounded by a large assembly, is teaching the Dhamma. How would it be if I were to approach the ascetic Gotama to cause him confusion?\" Then Māra the Evil One approached the Blessed One, and having approached, addressed the Blessed One with a verse: \"Why do you roar like a lion, fearless in the assembly? Indeed, you have an opponent! Do you think you are victorious?\" \"Indeed, the great heroes roar, fearless in assemblies. Tathāgatas, who have attained strength, have crossed over the entanglements of the world.\" Then Māra the Evil One, thinking, \"The Blessed One knows me, the Fortunate One knows me,\" distressed and dejected, vanished right there.",
      "sinhala": "එක් කලෙක භාග්‍ය​වතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයෙහි වැඩසිටින සේක. එසමයෙහි භාග්‍ය​වතුන් වහන්සේ මහත් පිරිසකින් පිරිවරා ධර්මය දේශනා කරන සේක. එවිට පාපී මාරයාට මේ සිත පහළ විය: \"මේ ශ්‍ර​මණ ගෞතමයන් වහන්සේ මහත් පිරිසකින් පිරිවරා ධර්මය දේශනා කරන සේක. මම ශ්‍ර​මණ ගෞතමයන් වහන්සේ වෙතට ගොස් උන්වහන්සේගේ ඇස් පෙනීම නැති කර දමන්නෙම් නම්?\" එවිට පාපී මාරයා භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍ය​වතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසීය: \"කිම ඔබ සිංහයෙකු මෙන් මේ පිරිස මැද නිර්භීතව හඬ නගන්නෙහිද? ඔබට සතුරෙක් සිටිනවා නේද? ඔබ ජයගත් තැනැත්තකු යැයි සිතන්නෙහිද?\" \"මහාවීරයන් වහන්සේලා පිරිස් මැද නිර්භීතව හඬ නගති. බලය ලබාගත් තථාගතයන් වහන්සේලා ලෝකයෙහි (සංසාරයෙහි) ඇති සියලු බැඳීම් තරණය කළ සේක.\" එවිට පාපී මාරයා \"භාග්‍ය​වතුන් වහන්සේ මා හඳුනති, සුගතයන් වහන්සේ මා හඳුනති\" යනුවෙන් සිතා, දුක්ඛිතව, දොම්නස්ව එතැනම අතුරුදහන් විය.",
      "paliTitle": "Kinnusīhasuttaṃ"
    },
    {
      "number": 149,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati maddakucchismiṃ migadāye. Tena kho pana samayena bhagavato pādo sakalikāya khato hoti, bhusā sudaṃ bhagavato vedanā vattanti sārīrikā dukkhā tibbā kharā kaṭukā asātā amanāpā. Tā sudaṃ bhagavā sato sampajāno adhivāseti avihaññamāno. Atha kho bhagavā catugguṇaṃ saṅghāṭiṃ paññapetvā dakkhiṇena passena sīhaseyyaṃ kappesi pāde pādaṃ accādhāya sato sampajāno. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Mandiyā nu kho sesi udāhu kāveyyamatto, Atthā nu te sampacurā na santi; Eko vivitte sayanāsanamhi, Niddāmukho kimidaṃ soppase vā’’ti. ‘‘Na mandiyā sayāmi nāpi kāveyyamatto, Atthaṃ sameccāhamapetasoko; Eko vivitte sayanāsanamhi, Sayāmahaṃ sabbabhūtānukampī. ‘‘Yesampi sallaṃ urasi paviṭṭhaṃ, Muhuṃ muhuṃ hadayaṃ vedhamānaṃ; Tepīdha soppaṃ labhare sasallā, Tasmā ahaṃ na supe vītasallo. ‘‘Jaggaṃ na saṅke napi bhemi sottuṃ, Rattindivā nānutapanti māmaṃ; Hāniṃ na passāmi kuhiñci loke, Tasmā supe sabbabhūtānukampī’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "Thus have I heard – At one time the Blessed One was dwelling in Rājagaha, in the Maddakucchi deer park. Now at that time, the Blessed One's foot was injured by a splinter, and severe, painful, sharp, agonizing, disagreeable, and unpleasant physical feelings arose for the Blessed One. The Blessed One, mindful and clearly comprehending, endured them without being overcome. Then the Blessed One, having folded his outer robe into four, lay down on his right side in the lion's posture, placing one foot on the other, mindful and clearly comprehending.\n\nThen Māra the Evil One approached the Blessed One; having approached, he addressed the Blessed One with a verse: \"Are you sleeping from dullness, or are you intoxicated by poetic thoughts? Do you have no abundant duties to attend to? Alone in this secluded resting place, drowsy-faced, what is this sleep you indulge in?\"\n\n\"I do not sleep from dullness, nor am I intoxicated by poetic thoughts. Having comprehended the true meaning, I am sorrowless. Alone in this secluded resting place, I sleep, compassionate to all beings. Even those in whom a dart has pierced their chest, piercing the heart again and again, even they here obtain sleep, though still with the dart. Therefore, being without the dart, I do not sleep in that way. I do not anticipate waking, nor do I fear slumber. Days and nights do not cause me distress. I see no loss anywhere in the world. Therefore, I sleep, compassionate to all beings.\"\n\nThen Māra the Evil One, thinking, \"The Blessed One knows me, the Fortunate One knows me,\" distressed and dejected, vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයෙක භාග්‍යවතුන් වහන්සේ රාජගහ නුවර මද්දකුච්චි නම් මිගදායෙහි වාසය කළහ. එකල භාග්‍යවතුන් වහන්සේගේ පාදය ගල්සැළැල්ලකින් තුවාල වී තිබිණි. භාග්‍යවතුන් වහන්සේට ඉතා දරුණු, දුක් සහිත, තීව්‍ර වූ, රළු වූ, කටුක වූ, අප්‍රිය වූ, අමනාප වූ කායික වේදනා ඇතිවිය. භාග්‍යවතුන් වහන්සේ සිහි නුවණින් යුතුව, කිසිසේත් නොපෙළෙමින් ඒ වේදනා ඉවසා වදාළ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ සිවුර සතර ගුණයට නවා එලාගෙන, එක් පාදයක් තවත් පාදයක් මත තබාගෙන, සිහි නුවණින් යුතුව දකුණු පසට හැරී සිංහ සෙයියාවෙන් සැතපුණ සේක.\n\nඉක්බිති මාර පාපියා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසුවේය –\n‘‘නින්දෙන් මත්වීමෙන් හෝ නිද්‍රාශීලී බවින්ද ඔබ නිදන්නේ, නැතහොත් (කවර හෝ) මත්වීමකින්ද? ඔබට කළ යුතු කාර්යයන් බොහෝ නැද්ද? තනිවූ විවේකී සෙනසුනක, නිදිමත මුහුණින් කුමකට මෙසේ නිදන්නේද?’’\n\n‘‘මම නිද්‍රාශීලීව හෝ මත්වීමකින් නිදාගන්නේ නැත. මම සියලු අර්ථයන් අවබෝධ කරගෙන, සියලු ශෝකයන්ගෙන් මිදී සිටිමි. තනිවූ විවේකී සෙනසුනක, මම සියලු සත්වයන් කෙරෙහි අනුකම්පාවෙන් නිදාගනිමි.\n\n‘‘යමෙකුගේ පපුවට විදින ලද හීයක් මොහොතින් මොහොත හදවත පීඩා කරන්නේද, හීයෙන් යුක්තව සිටින ඔවුන්ද මෙහිදී (සැබවින්ම) නින්ද ලබති. එහෙයින් මම, (දුක් නමැති) හීයෙන් තොර බැවින්, (සාමාන්‍ය ලෙස) නොනිදමි.\n\n‘‘මම (මගේ) අවදියෙන් සිටීම ගැන සැක නොකරමි, මට අපහාස කරනු ඇතැයිද බිය නොවෙමි. දින රෑ දෙකෙහි මට කිසිදු පසුතැවීමක් ඇති නොවේ. ලොවෙහි කිසි තැනක කිසිදු හානියක් මම නොදකිමි. එහෙයින් මම සියලු සත්වයන් කෙරෙහි අනුකම්පාවෙන් (සුවසේ) නිදාගනිමි.’’\n\nඉක්බිති මාර පාපියා ‘‘භාග්‍යවතුන් වහන්සේ මා හඳුනත්, සුගතයන් වහන්සේ මා හඳුනත්’’ යැයි (සිතා) දුක් වූයේ, මලානික වූයේ, එහිදීම අතුරුදහන් විය.",
      "paliTitle": "Sakalikasuttaṃ"
    },
    {
      "number": 150,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu viharati ekasālāyaṃ brāhmaṇagāme. Tena kho pana samayena bhagavā mahatiyā gihiparisāya parivuto dhammaṃ deseti. Atha kho mārassa pāpimato etadahosi – ‘‘ayaṃ kho samaṇo gotamo mahatiyā gihiparisāya parivuto dhammaṃ deseti. Yaṃnūnāhaṃ yena samaṇo gotamo tenupasaṅkameyyaṃ vicakkhukammāyā’’ti. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Netaṃ tava patirūpaṃ, yadaññamanusāsasi; Anurodhavirodhesu, mā sajjittho tadācara’’nti. ‘‘Hitānukampī sambuddho, yadaññamanusāsati; Anurodhavirodhehi, vippamutto tathāgato’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "At one time, the Blessed One was dwelling in the Kosala country, at Ekasālā, a brahman village. Now at that time, the Blessed One, surrounded by a large assembly of laypeople, was teaching the Dhamma. Then it occurred to Māra the Evil One: “Indeed, this recluse Gotama, surrounded by a large assembly of laypeople, is teaching the Dhamma. Why don’t I approach the recluse Gotama to make them blind to the truth?” Then Māra the Evil One approached the Blessed One, and having approached, he addressed him with a verse:\n\n“It is not fitting for you that you should instruct others. Do not become entangled in attractions and aversions; practice that instead!”\n“A Fully Enlightened One, out of compassion for others’ welfare, instructs others. The Tathāgata is completely liberated from attractions and aversions.”\nThen Māra the Evil One, thinking, “The Blessed One knows me, the Fortunate One knows me,” feeling distressed and disheartened, vanished right there.",
      "sinhala": "එක් සමයෙක්හි භාග්‍#ZWJ;යවතුන් වහන්සේ කෝසල ජනපදයේ ඒකසාලා නම් බ්‍රාහ්මණ ග්‍ර#ZWJ;ාමයේ වැඩසිටින සේක. එකල භාග්‍#ZWJ;යවතුන් වහන්සේ බොහෝ ගිහි පිරිසක් පිරිවරාගෙන ධර‍්#ZWJ;මය දේශනා කරමින් වැඩසිටින සේක.\n\nඑවිට පව්කාර මාරයාට මෙබඳු සිතක් පහළ විය: \"මෙම ශ්‍ර#ZWJ;මණ ගෞතමයන් වහන්සේ බොහෝ ගිහි පිරිසක් පිරිවරාගෙන ධර‍්#ZWJ;මය දේශනා කරති. මම ශ්‍ර#ZWJ;මණ ගෞතමයන් වහන්සේ වෙත ගොස් (උන්වහන්සේගේ ශ්‍ර#ZWJ;ාවකයන්ට යහපත) නොපෙනෙන පරිදි කර්මයක් (බාධාවක්) කරන්නෙමි.\" ඉක්බිති පව්කාර මාරයා භාග්‍#ZWJ;යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍#ZWJ;යවතුන් වහන්සේට ගාථාවකින් මෙසේ ඇමතීය:\n\"අන් අයට අනුශාසනා කිරීම ඔබට සුදුසු ප්‍ර#ZWJ;තිරූපයක් (ක්‍ර#ZWJ;ියාවක්) නොවේ. අනුරෝධයන්හි ද විරෝධයන්හි ද (ප්‍රිය හා අප්‍රිය දෙයෙහි) නොඇලී සිටිනු, ඒ අයුරින් ක්‍ර#ZWJ;ියා කරන්න.\"\n(එවිට) \"අනුන්ට හිතසුව පිණිස අනුකම්පාවෙන් යුතු වූ සම්‍#ZWJ;යග් සම්බුදුරජාණන් වහන්සේ යම් හෙයකින් අනුශාසනා කරන්නේ ද, තථාගතයන් වහන්සේ අනුරෝධයන්ගෙන් හා විරෝධයන්ගෙන් (ප්‍රිය හා අප්‍රිය දෙයින්) සම්පූර්ණයෙන් මුදනු ලැබූ සේක.\"\n\nඉක්බිති පව්කාර මාරයා \"භාග්‍#ZWJ;යවතුන් වහන්සේ මා හඳුනාගත්තා, සුගතයන් වහන්සේ මා හඳුනාගත්තා\" යැයි සිතා, දුකට පත් වූ, මනසින් කළකිරුණු (කෙනෙකු මෙන්) එහිදීම අතුරුදහන් විය.",
      "paliTitle": "Patirūpasuttaṃ"
    },
    {
      "number": 151,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Antalikkhacaro pāso, yvāyaṃ carati mānaso; Tena taṃ bādhayissāmi, na me samaṇa mokkhasī’’ti. ‘‘Rūpā saddā rasā gandhā, phoṭṭhabbā ca manoramā; Ettha me vigato chando, nihato tvamasi antakā’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "Thus have I heard: On one occasion the Blessed One was staying in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's Park. Then Māra, the Evil One, approached the Blessed One. Having approached, he addressed the Blessed One with a verse: \"This snare that roams the mind, a sky-ranging trap: with it I shall ensnare you. You will not escape me, ascetic!\" The Blessed One replied: \"Forms, sounds, tastes, odors, and delightful tangibles—my desire for these is gone. You are vanquished, Death!\" Then Māra, the Evil One, thinking: \"The Blessed One knows me, the Fortunate One knows me!\" — sad and dejected, vanished right there.",
      "sinhala": "මා විසින් මෙවැනි දේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවනයෙහි, අනේපිඬු සිටුතුමාගේ ආරාමයෙහි වැඩවසන සේක.\n\nඑක්බිති මාර පාපියා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; එසේ පැමිණ, භාග්‍යවතුන් වහන්සේට ගාථාවකින් කථා කළේය: ‘‘අහසෙහි හැසිරෙන, සිතට අසුවන මේ පාශයෙන් මම ඔබව බඳිමි; ශ්‍රමණය, ඔබ මගෙන් මිදෙන්නේ නැත.’’ ‘‘රූප, ශබ්ද, රස, ගඳ, පහස යන මනෝරම්‍ය වූ දේ කෙරෙහි මාගේ ඡන්දය (කැමැත්ත) පහව ගොස් ඇත. අන්තකය, ඔබ නසන ලද්දෙකි!’’ එක්බිති මාර පාපියා, ‘‘භාග්‍යවතුන් වහන්සේ මා හඳුනති, සුගතයන් වහන්සේ මා හඳුනති’’ යි සිතා, දුකින් හා මලානිකව එතැනම අතුරුදහන් විය.",
      "paliTitle": "Mānasasuttaṃ"
    },
    {
      "number": 152,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena bhagavā pañcannaṃ upādānakkhandhānaṃ upādāya bhikkhūnaṃ dhammiyā kathāya sandasseti samādapeti [samādāpeti (?)] samuttejeti sampahaṃseti. Te ca bhikkhū aṭṭhiṃ katvā [aṭṭhikatvā (sī. syā. kaṃ. pī.)] manasi katvā sabbacetasā [sabbacetaso (sī. syā. kaṃ. pī.), sabbaṃ cetasā (ka.)] samannāharitvā ohitasotā dhammaṃ suṇanti. Atha kho mārassa pāpimato etadahosi – ‘‘ayaṃ kho samaṇo gotamo pañcannaṃ upādānakkhandhānaṃ upādāya bhikkhūnaṃ dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Yaṃnūnāhaṃ yena samaṇo gotamo tenupasaṅkameyyaṃ vicakkhukammāyā’’ti. Tena kho pana samayena sambahulā pattā abbhokāse nikkhittā honti. Atha kho māro pāpimā balībaddavaṇṇaṃ abhinimminitvā yena te pattā tenupasaṅkami. Atha kho aññataro bhikkhu aññataraṃ bhikkhuṃ etadavoca – ‘‘bhikkhu, bhikkhu, eso balībaddo patte bhindeyyā’’ti. Evaṃ vutte bhagavā taṃ bhikkhuṃ etadavoca – ‘‘na so, bhikkhu, balībaddo. Māro eso pāpimā tumhākaṃ vicakkhukammāya āgato’’ti. Atha kho bhagavā ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāya ajjhabhāsi – ‘‘Rūpaṃ vedayitaṃ saññā, viññāṇaṃ yañca saṅkhataṃ; Nesohamasmi netaṃ me, evaṃ tattha virajjati. ‘‘Evaṃ virattaṃ khemattaṃ, sabbasaṃyojanātigaṃ; Anvesaṃ sabbaṭṭhānesu, mārasenāpi nājjhagā’’ti. Atha kho māro pāpimā…pe… tatthevantaradhāyīti.",
      "english": "At Sāvatthī, at that time, the Blessed One instructed, urged, roused, and gladdened the monks with a discourse on the Dhamma concerning the five aggregates of clinging. And those monks, taking it to heart, paying close attention, applying their whole mind, and listening with keen ears, were listening to the Dhamma.\n\nThen it occurred to Māra, the Evil One: \"This ascetic Gotama is instructing, urging, rousing, and gladdening the monks with a discourse on the Dhamma concerning the five aggregates of clinging. And those monks, taking it to heart, paying close attention, applying their whole mind, and listening with keen ears, are listening to the Dhamma. What if I were to approach where the ascetic Gotama is, in order to cause distraction?\"\n\nAt that time, many bowls were placed in the open air. Then Māra, the Evil One, having conjured up the form of an ox, approached where those bowls were. Then a certain monk said to another monk: \"Monk, monk, that ox might break the bowls!\"\n\nWhen this was said, the Blessed One said to that monk: \"That, monk, is not an ox. That is Māra, the Evil One, who has come to cause you distraction.\" Then the Blessed One, knowing, \"This is Māra, the Evil One,\" addressed Māra, the Evil One, with a verse:\n\n\"Form, feeling, perception, mental formations, and consciousness: I am not that, nor is that mine. In this way, one becomes dispassionate concerning them.\"\n\n\"One who is thus dispassionate and secure, having transcended all fetters—even if sought in all places, Māra's army cannot find such a one.\"\n\nThen Māra, the Evil One, realizing, \"The Blessed One knows me, the Fortunate One knows me,\" sad and dejected, vanished right there.",
      "sinhala": "සැවැත් නුවරදී.\n\nඒ මොහොතෙහි භාග්‍යවතුන් වහන්සේ පංච උපාදානස්කන්ධයන් අරඹයා භික්ෂූන්ට ධර්ම කථාවකින් ධර්මය ප්‍රකට කරවති, ධර්මයෙහි සමාදන් කරවති, ධර්මයට උද්දීපනය කරවති, ධර්මයෙන් සතුටු කරවති. ඒ භික්ෂූහු ධර්මය අත්‍යවශ්‍ය කොට සලකා, මනසෙහි ධාරණය කොට, සියලු චේතනාවෙන් එයට අවධානය යොමු කරමින්, මනා සේ සවන් යොමා ධර්මය ශ්‍රවණය කරති. එවිට පාපී මාරයාට මේ සිත පහළ විය: ‘‘මේ ශ්‍රමණ ගෞතමයන් වහන්සේ පංච උපාදානස්කන්ධයන් අරඹයා භික්ෂූන්ට ධර්ම කථාවකින් ධර්මය ප්‍රකට කරවති, ධර්මයෙහි සමාදන් කරවති, ධර්මයට උද්දීපනය කරවති, ධර්මයෙන් සතුටු කරවති. ඒ භික්ෂූහු ධර්මය අත්‍යවශ්‍ය කොට සලකා, මනසෙහි ධාරණය කොට, සියලු චේතනාවෙන් එයට අවධානය යොමු කරමින්, මනා සේ සවන් යොමා ධර්මය ශ්‍රවණය කරති. මා ශ්‍රමණ ගෞතමයන් වහන්සේ වෙතට ගොස් (භික්ෂූන්ගේ) ප්‍රඥා චක්ෂුස අන්ධ කිරීමේ ක්‍රියාවක් කළහොත් කෙසේද?''\n\nඒ මොහොතෙහි බොහෝ පාත්‍රයන් එළිමහනෙහි තබා තිබුණි. එවිට පාපී මාරයා ගොනෙකුගේ වේශයක් මවාගෙන ඒ පාත්‍ර තිබූ තැනට පැමිණියේය. එවිට එක් භික්ෂුවක් තවත් භික්ෂුවකට මෙසේ කීවේය: ‘‘ඇවැත්නි, ඇවැත්නි, මේ ගොනා පාත්‍රයන් බිඳිනු ඇත!'' මෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ ඒ භික්ෂුවට මෙසේ වදාළ සේක: ‘‘භික්ෂුව, ඒ ගොනෙක් නොවේ. ඒ පාපී මාරයා නුඹලාගේ ප්‍රඥා චක්ෂුස අන්ධ කිරීමේ කටයුත්ත පිණිස පැමිණ ඇත.''\n\nඑවිට භාග්‍යවතුන් වහන්සේ, ‘‘මේ පාපී මාරයා යි'' යනුවෙන් දැනගෙන, පාපී මාරයාට ගාථාවකින් මෙසේ වදාළ සේක:\n\n‘‘රූපයද, වේදනාවද, සංඥාවද, විඤ්ඤාණයද, යම් සංස්කාර ධර්මයක් ද, මේ මා නොවෙමි, මේ මගේ නොවේ යැයි (දැක), එසේ එහි නොඇලේ.\n\nමෙසේ (ලෝකයට) නොඇලුණු, ක්ෂේමයට (නිවනට) පත් වූ, සියලු සංයෝජනයන් ඉක්මවා ගිය තැනැත්තා, මාරයා කොතැනක සෙව්වත්, මාර සේනාවට පවා ඔහුව සොයාගත නොහැකි විය.''\n\nඑවිට පාපී මාරයා දුකට පත්ව, දොම්නසින් යුතුව, පසුබැස, එතැනම අතුරුදහන් විය.",
      "paliTitle": "Pattasuttaṃ"
    },
    {
      "number": 153,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena bhagavā channaṃ phassāyatanānaṃ upādāya bhikkhūnaṃ dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Atha kho mārassa pāpimato etadahosi – ‘‘ayaṃ kho samaṇo gotamo channaṃ phassāyatanānaṃ upādāya bhikkhūnaṃ dhammiyā kathāya sandasseti samādapeti samuttejeti sappahaṃseti. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Yaṃnūnāhaṃ yena samaṇo gotamo tenupasaṅkameyyaṃ vicakkhukammāyā’’ti. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato avidūre mahantaṃ bhayabheravaṃ saddamakāsi, apissudaṃ pathavī maññe undrīyati [udrīyati (sī. syā. kaṃ. pī) u + dara + ya + ti = udrīyati]. Atha kho aññataro bhikkhu aññataraṃ bhikkhuṃ etadavoca – ‘‘bhikkhu, bhikkhu, esā pathavī maññe undrīyatī’’ti. Evaṃ vutte, bhagavā taṃ bhikkhuṃ etadavoca – ‘‘nesā bhikkhu pathavī undrīyati. Māro eso pāpimā tumhākaṃ vicakkhukammāya āgato’’ti. Atha kho bhagavā ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāya ajjhabhāsi – ‘‘Rūpā saddā rasā gandhā, phassā dhammā ca kevalā; Etaṃ lokāmisaṃ ghoraṃ, ettha loko vimucchito. ‘‘Etañca samatikkamma, sato buddhassa sāvako; Māradheyyaṃ atikkamma, ādiccova virocatī’’ti. Atha kho māro pāpimā…pe… tatthevantaradhāyīti.",
      "english": "On one occasion, the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. Now at that time, the Blessed One was instructing, urging, rousing, and gladdening the bhikkhus with a Dhamma talk concerning the six sense bases. And those bhikkhus, making it their core concern, applying their minds, focusing their entire awareness, and lending an ear, were listening to the Dhamma.\n\nThen it occurred to Māra, the Evil One: \"This ascetic Gotama is instructing, urging, rousing, and gladdening the bhikkhus with a Dhamma talk concerning the six sense bases. And those bhikkhus, making it their core concern, applying their minds, focusing their entire awareness, and lending an ear, are listening to the Dhamma. Why don't I approach the ascetic Gotama to cause them confusion?\"\n\nThen Māra, the Evil One, approached the Blessed One. Having approached, not far from the Blessed One, he made a great, fearful, terrifying sound, as if the earth were rending. Then a certain bhikkhu said to another bhikkhu: \"Friend, friend, the earth seems to be rending!\"\n\nWhen this was said, the Blessed One said to that bhikkhu: \"Friend, the earth is not rending. That is Māra, the Evil One, who has come to cause you confusion.\"\n\nThen the Blessed One, knowing \"This is Māra, the Evil One,\" addressed Māra, the Evil One, with a verse:\n\n\"Forms, sounds, tastes, odors, tactile sensations, and mental phenomena—all of these;\nThis is the terrible bait of the world, by which the world is ensnared.\nHaving transcended these, a mindful disciple of the Buddha,\nHaving transcended the dominion of Māra, shines like the sun.\"\n\nThen Māra, the Evil One, knowing \"The Blessed One knows me,\" feeling dejected, vanished right there.",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි මහාවනයෙහි කූටාගාර ශාලාවේ වැඩවසන සේක. එසමයෙහි භාග්‍යවතුන් වහන්සේ ෂට් ස්පර්ශායතන අරමුණු කරගෙන භික්ෂූන්ට ධර්ම කථාවකින් කරුණු පැහැදිලි කරන සේක, (සම්මාදිට්ඨියෙහි) පිහිටුවන සේක, ධර්මයෙහි උනන්දු කරවන සේක, සතුටු කරවන සේක. ඒ භික්ෂූහු හොඳින් සිත පිහිටුවාගෙන, මෙනෙහි කරමින්, සියලු සිත් යොමු කරමින්, කන් යොමාගෙන ධර්මය ශ්‍රවණය කරමින් සිටියහ.\n\nඑවිට පවිටු මාරයාට මේ සිත පහළ විය: \"මේ ශ්‍රමණ ගෞතමයන් වහන්සේ ෂට් ස්පර්ශායතන අරමුණු කරගෙන භික්ෂූන්ට ධර්ම කථාවකින් කරුණු පැහැදිලි කරයි, පිහිටුවයි, ධර්මයෙහි උනන්දු කරවයි, සතුටු කරවයි. ඒ භික්ෂූහු හොඳින් සිත පිහිටුවාගෙන, මෙනෙහි කරමින්, සියලු සිත් යොමු කරමින්, කන් යොමාගෙන ධර්මය ශ්‍රවණය කරති. මා ශ්‍රමණ ගෞතමයන් වහන්සේ වෙතට ගොස් ඔවුන්ගේ නුවණ බිඳලන්නට කටයුතු කළොත් හොඳයි.\" එවිට පවිටු මාරයා භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට නුදුරු තැනකදී මහත් වූ බියකරු භයානක ශබ්දයක් කළේය. ඒ ශබ්දය නිසා පොළොව දෙදරවා පතුලින් ගිගුරුම් දෙමින් පිපිරී යනවා සේ හැඟුණි. එවිට එක්තරා භික්ෂුවක් තවත් භික්ෂුවකට මෙසේ කීවේය: \"ඇවැත්නි, ඇවැත්නි, මේ පොළොව දෙදරවා පිපිරී යනවා සේයැයි මට සිතේ.\" මෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ ඒ භික්ෂුවට මෙසේ වදාළ සේක: \"භික්ෂුව, ඒ පොළොව දෙදරවා පිපිරී යන්නේ නැත. ඒ පවිටු මාරයාය, ඔහු නුඹලාගේ නුවණ බිඳලන්නට පැමිණ ඇත.\" එවිට භාග්‍යවතුන් වහන්සේ \"මේ පවිටු මාරයායැ\"යි දැනගෙන පවිටු මාරයාට ගාථාවකින් මෙසේ වදාළ සේක:\n\n\"රූප, ශබ්ද, රස, ගඳ, ස්පර්ශ, සහ සිතේ හටගන්නා ධර්ම යන මේ සියල්ල ලෝකයේ ඇති බිහිසුණු ආමිසයෝය. මෙහි ලෝකයා මුළාවී බැඳී සිටිති.\nමේවා සමතික්‍රමණය කර, සිහි නුවණින් යුත් බුද්ධ ශ්‍රාවකයා මාරයාගේ ආධිපත්‍යය ඉක්මවා හිරු මෙන් බැබළේ.\"\n\nඑවිට පවිටු මාරයා එතනම අතුරුදහන් විය.",
      "paliTitle": "Chaphassāyatanasuttaṃ"
    },
    {
      "number": 154,
      "pali": "Ekaṃ samayaṃ bhagavā magadhesu viharati pañcasālāyaṃ brāhmaṇagāme. Tena kho pana samayena pañcasālāyaṃ brāhmaṇagāme kumārikānaṃ pāhunakāni bhavanti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya pañcasālaṃ brāhmaṇagāmaṃ piṇḍāya pāvisi. Tena kho pana samayena pañcasāleyyakā brāhmaṇagahapatikā mārena pāpimatā anvāviṭṭhā bhavanti – mā samaṇo gotamo piṇḍamalatthāti. Atha kho bhagavā yathādhotena pattena pañcasālaṃ brāhmaṇagāmaṃ piṇḍāya pāvisi tathādhotena [yathādhotena (?)] pattena paṭikkami. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘api tvaṃ, samaṇa, piṇḍamalatthā’’ti? ‘‘Tathā nu tvaṃ, pāpima, akāsi yathāhaṃ piṇḍaṃ na labheyya’’nti. ‘‘Tena hi, bhante, bhagavā dutiyampi pañcasālaṃ brāhmaṇagāmaṃ piṇḍāya pavisatu. Tathāhaṃ karissāmi yathā bhagavā piṇḍaṃ lacchatī’’ti. ‘‘Apuññaṃ pasavi māro, āsajja naṃ tathāgataṃ; Kiṃ nu maññasi pāpima, na me pāpaṃ vipaccati. ‘‘Susukhaṃ vata jīvāma, yesaṃ no natthi kiñcanaṃ; Pītibhakkhā bhavissāma, devā ābhassarā yathā’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "On one occasion, the Blessed One was dwelling in Magadha, in the brahmin village of Pañcasālā. Now at that time, festivities were taking place for the young women in the brahmin village of Pañcasālā.\n\nThen, in the forenoon, having donned his robes and taking his bowl, the Blessed One entered the brahmin village of Pañcasālā for alms. Now at that time, the brahmin householders of Pañcasālā were assailed by Māra the Evil One, thinking, \"May the recluse Gotama not receive any alms!\"\n\nThen the Blessed One entered the brahmin village of Pañcasālā for alms with his bowl just as it was cleansed, and returned with his bowl just as it was cleansed.\n\nThen Māra the Evil One approached the Blessed One, and having approached, he said to the Blessed One, \"Did you receive alms, recluse?\"\n\n\"Indeed you acted thus, Evil One, so that I would not receive alms.\"\n\n\"In that case, Venerable Sir, let the Blessed One enter the brahmin village of Pañcasālā for alms a second time. I shall act in such a way that the Blessed One will receive alms.\"\n\n\"Māra has generated demerit by assailing the Tathāgata.\nWhat do you think, Evil One, that this evil kamma will not ripen for me?\n\nIndeed, we live very happily, for whom there is nothing at all.\nWe shall feed on joy, just like the Ābhassara devas.\"\n\nThen Māra the Evil One, thinking, \"The Blessed One knows me, the Accomplished One knows me,\" distressed and dejected, vanished right there.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ මගධයෙහි පංචසාලා නම් බමුණු ගමෙහි වැඩසිටින සේක.\n\nඒ වේලෙහි පංචසාලා බමුණු ගමෙහි කුමාරිකාවන්ගේ ඥාති සංග්‍රහයෝ වූහ. එකල්හි භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු පොරවා, පාත්‍ර සිවුරු රැගෙන, පංචසාලා බමුණු ගම පිණිස පිණ්ඩපාතයෙහි පිවිසියේය. ඒ වේලෙහි පංචසාලාහි බමුණු ගෘහපතියෝ, ශ්‍රමණ ගෞතමයන් වහන්සේට පිණ්ඩපාතය නොලැබේවා යැයි, පව්කම් කරන්නා වූ මාරයා විසින් වැහී සිටියහ. එකල්හි භාග්‍යවතුන් වහන්සේ හිස් වූ පාත්‍රයෙන්ම පංචසාලා බමුණු ගමට පිණ්ඩපාතය පිණිස පිවිස, එලෙසම හිස් වූ පාත්‍රයෙන්ම ආපසු වඩින ලදී.\n\nඑකල්හි පව්කම් කරන්නා වූ මාරයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, පැමිණ භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ශ්‍රමණය, ඔබට පිණ්ඩපාතය ලැබුණේ දැ?\"යි.\n\"පව්කම් කරන්න, මා පිණ්ඩපාතය නොලබන ලෙස ඔබ ක්‍රියා කළේ නොවේද?\"යි.\n\"එසේ නම්, වහන්ස, භාග්‍යවතුන් වහන්සේ නැවත වරක් පංචසාලා බමුණු ගමට පිණ්ඩපාතය පිණිස වදින සේක්වා. භාග්‍යවතුන් වහන්සේට පිණ්ඩපාතය ලැබෙන පරිදි මම කටයුතු කරන්නෙමි\"යි.\n\n\"මාරයා තථාගතයන් වහන්සේට අවමන් කරමින් අකුසලයක් රැස් කළේය.\nපව්කම් කරන්න, මට පාපය විපාක නොදෙන්නේ යැයි ඔබ කුමක් සිතන්නෙහිද?\n\nඅහෝ, කිසිවක් නැත්තාවූ අපට ඉතා සුවසේ අපි ජීවත් වෙමු.\nඅපි ආභස්සර බ්‍රහ්මයන් මෙන් ප්‍රීතිය ආහාර කොට ඇත්තෝ වන්නෙමු\"යි.\n\nඑකල්හි පව්කම් කරන්නා වූ මාරයා \"භාග්‍යවතුන් වහන්සේ මා හඳුනයි, සුගතයන් වහන්සේ මා හඳුනයි\" යනුවෙන් දුක් සහිත වූයේ, සිත් තැවුල් සහිත වූයේ එතනම අතුරුදහන් විය.",
      "paliTitle": "Piṇḍasuttaṃ"
    },
    {
      "number": 155,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena bhagavā bhikkhūnaṃ nibbānapaṭisaṃyuttāya dhammiyā kathāya sandasseti samādapeti samuttejeti sampahaṃseti. Te ca bhikkhū aṭṭhiṃ katvā manasi katvā sabbacetasā samannāharitvā ohitasotā dhammaṃ suṇanti. Atha kho mārassa pāpimato etadahosi – ‘‘ayaṃ kho samaṇo gotamo bhikkhūnaṃ nibbānapaṭisaṃyuttāya dhammiyā kathāya…pe… yaṃnūnāhaṃ yena samaṇo gotamo tenupasaṅkameyyaṃ vicakkhukammāyā’’ti. Atha kho māro pāpimā kassakavaṇṇaṃ abhinimminitvā mahantaṃ naṅgalaṃ khandhe karitvā dīghapācanayaṭṭhiṃ gahetvā haṭahaṭakeso sāṇasāṭinivattho kaddamamakkhitehi pādehi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘api, samaṇa, balībadde addasā’’ti? ‘‘Kiṃ pana, pāpima, te balībaddehī’’ti? ‘‘Mameva, samaṇa, cakkhu, mama rūpā, mama cakkhusamphassaviññāṇāyatanaṃ. Kuhiṃ me, samaṇa, gantvā mokkhasi? Mameva, samaṇa, sotaṃ, mama saddā…pe… mameva, samaṇa, ghānaṃ, mama gandhā; mameva, samaṇa, jivhā, mama rasā; mameva, samaṇa, kāyo, mama phoṭṭhabbā; mameva, samaṇa, mano, mama dhammā, mama manosamphassaviññāṇāyatanaṃ. Kuhiṃ me, samaṇa, gantvā mokkhasī’’ti? ‘‘Taveva, pāpima, cakkhu, tava rūpā, tava cakkhusamphassaviññāṇāyatanaṃ. Yattha ca kho, pāpima, natthi cakkhu, natthi rūpā, natthi cakkhusamphassaviññāṇāyatanaṃ, agati tava tattha, pāpima. Taveva, pāpima, sotaṃ, tava saddā, tava sotasamphassaviññāṇāyatanaṃ. Yattha ca kho, pāpima, natthi sotaṃ, natthi saddā, natthi sotasamphassaviññāṇāyatanaṃ, agati tava tattha, pāpima. Taveva, pāpima, ghānaṃ, tava gandhā, tava ghānasamphassaviññāṇāyatanaṃ. Yattha ca kho, pāpima, natthi ghānaṃ, natthi gandhā, natthi ghānasamphassaviññāṇāyatanaṃ, agati tava tattha, pāpima. Taveva, pāpima, jivhā, tava rasā, tava jivhāsamphassaviññāṇāyatanaṃ…pe… taveva, pāpima, kāyo, tava phoṭṭhabbā, tava kāyasamphassaviññāṇāyatanaṃ…pe… taveva, pāpima, mano, tava dhammā, tava manosamphassaviññāṇāyatanaṃ. Yattha ca kho, pāpima, natthi mano, natthi dhammā, natthi manosamphassaviññāṇāyatanaṃ, agati tava tattha, pāpimā’’ti. ‘‘Yaṃ vadanti mama yidanti, ye vadanti mamanti ca; Ettha ce te mano atthi, na me samaṇa mokkhasī’’ti. ‘‘Yaṃ vadanti na taṃ mayhaṃ, ye vadanti na te ahaṃ; Evaṃ pāpima jānāhi, na me maggampi dakkhasī’’ti. Atha kho māro pāpimā…pe… tatthevantaradhāyīti.",
      "english": "At Sāvatthī. At that time, the Blessed One instructed, inspired, roused, and gladdened the bhikkhus with a Dhamma talk connected with Nibbāna. And those bhikkhus, paying close attention, fixing their minds, gathering all their thoughts, and listening with absorbed ears, were hearing the Dhamma.\n\nThen, to Māra the Evil One, this thought occurred: “Indeed, this ascetic Gotama is instructing, inspiring, rousing, and gladdening the bhikkhus with a Dhamma talk connected with Nibbāna. Why don't I approach the ascetic Gotama to make them lose their clarity of vision?” Then Māra the Evil One, having assumed the guise of a farmer, carrying a large plough on his shoulder, holding a long goad, with disheveled hair, dressed in a hempen garment, and with feet smeared in mud, approached the Blessed One. Having approached, he said to the Blessed One: “Ascetic, have you seen any oxen?” “But what concern are oxen to you, Evil One?” “Ascetic, my own is the eye, my own are forms, my own is the consciousness of eye-contact. Where will you go, Ascetic, to escape me? My own is the ear, my own are sounds, my own is the consciousness of ear-contact. My own is the nose, my own are odors, my own is the consciousness of nose-contact. My own is the tongue, my own are tastes, my own is the consciousness of tongue-contact. My own is the body, my own are tactile objects, my own is the consciousness of body-contact. My own is the mind, my own are mental phenomena, my own is the consciousness of mind-contact. Where will you go, Ascetic, to escape me?”\n\n“Evil One, your own is the eye, your own are forms, your own is the consciousness of eye-contact. But, Evil One, where there is no eye, no forms, no consciousness of eye-contact, there you have no access, Evil One. Your own is the ear, your own are sounds, your own is the consciousness of ear-contact. But, Evil One, where there is no ear, no sounds, no consciousness of ear-contact, there you have no access, Evil One. Your own is the nose, your own are odors, your own is the consciousness of nose-contact. But, Evil One, where there is no nose, no odors, no consciousness of nose-contact, there you have no access, Evil One. Your own is the tongue, your own are tastes, your own is the consciousness of tongue-contact. But, Evil One, where there is no tongue, no tastes, no consciousness of tongue-contact, there you have no access, Evil One. Your own is the body, your own are tactile objects, your own is the consciousness of body-contact. But, Evil One, where there is no body, no tactile objects, no consciousness of body-contact, there you have no access, Evil One. Your own is the mind, your own are mental phenomena, your own is the consciousness of mind-contact. But, Evil One, where there is no mind, no mental phenomena, no consciousness of mind-contact, there you have no access, Evil One.”\n\n“Whatever they call ‘mine,’ and those who utter ‘I am’ – if your mind is caught up in these, Ascetic, you will not escape me.” “What they call ‘mine’ is not mine, and those who say ‘I am’ are not I. Understand this, Evil One, and you will not even perceive my path.”\n\nThen Māra the Evil One, disappointed and sad, vanished right there.",
      "sinhala": "සා­වැ­ත්­ථි­යෙහි දී සිදු වූවකි.\n\nඑක් සමයක භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට නිර්වාණය හා බැඳුණු ධර්ම කථාවකින් කරුණු පහදා දෙමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් වැඩසිටියහ. ඒ භික්ෂූහු සිත් යොමු කරමින්, මෙනෙහි කරමින්, මුළු සිතින්ම අවධානය යොමු කරමින්, කන් යොමාගෙන ධර්මය ශ්‍රවණය කළහ. එවිට පාපී මාරයාට මෙසේ සිතුණි – ‘මෙම ශ්‍රමණ ගෞතමයා භික්ෂූන්ට නිර්වාණය හා බැඳුණු ධර්ම කථාවකින් කරුණු පහදා දෙමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින් වැඩසිටියි. මා ගොස් ශ්‍රමණ ගෞතමයා සිටින තැනට පැමිණ, (ඔවුන්ගේ) ඇස් වසා දමන ක්‍රියාවක් කළහොත් හොඳයි’ කියාය. එවිට පාපී මාරයා ගොවියෙකුගේ ස්වරූපයක් මවාගෙන, මහත් නඟුලක් කරමත තබාගෙන, දිගු ගව පොල්ලක්ද ගෙන, අවුල් වූ කෙස් ඇතිව, හණ සළුවක් හැඳගෙන, මඩ තැවරුණු පාද ඇතිව භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය – ‘ශ්‍රමණයන් වහන්ස, ඔබ වහන්සේ ගොනුන් දුටුවාද?’ ‘පාපිය, ඔබට ගොනුන්ගෙන් කුමක්ද?’ ‘ශ්‍රමණයන් වහන්ස, ඇස මාගේය, රූප මාගේය, ඇසෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනයද මාගේය. ශ්‍රමණයන් වහන්ස, ඔබ මගෙන් කොතැනට ගොස් නිදහස් වන්නද? ශ්‍රමණයන් වහන්ස, කණ මාගේය, ශබ්ද මාගේය; ශ්‍රමණයන් වහන්ස, නාසය මාගේය, ගඳ සුවඳ මාගේය; ශ්‍රමණයන් වහන්ස, දිව මාගේය, රස මාගේය; ශ්‍රමණයන් වහන්ස, කය මාගේය, ස්පර්ශ මාගේය; ශ්‍රමණයන් වහන්ස, මනස මාගේය, ධර්මාරම්මණ මාගේය, මනසෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනයද මාගේය. ශ්‍රමණයන් වහන්ස, ඔබ මගෙන් කොතැනට ගොස් නිදහස් වන්නද?’\n\n‘පාපිය, ඇස ඔබටම අයිතිය, රූප ඔබටම අයිතිය, ඇසෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනයද ඔබටම අයිතිය. නමුත්, පාපිය, යම් තැනක ඇස නැත්ද, රූප නැත්ද, ඇසෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනය නැත්ද, පාපිය, එහි ඔබට පිවිසිය නොහැක. පාපිය, කණ ඔබටම අයිතිය, ශබ්ද ඔබටම අයිතිය, කණෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනයද ඔබටම අයිතිය. නමුත්, පාපිය, යම් තැනක කණ නැත්ද, ශබ්ද නැත්ද, කණෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනය නැත්ද, පාපිය, එහි ඔබට පිවිසිය නොහැක. පාපිය, නාසය ඔබටම අයිතිය, ගඳ සුවඳ ඔබටම අයිතිය, නාසයෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනයද ඔබටම අයිතිය. නමුත්, පාපිය, යම් තැනක නාසය නැත්ද, ගඳ සුවඳ නැත්ද, නාසයෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනය නැත්ද, පාපිය, එහි ඔබට පිවිසිය නොහැක. පාපිය, දිව ඔබටම අයිතිය, රස ඔබටම අයිතිය, දිවෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනයද ඔබටම අයිතිය. නමුත්, පාපිය, යම් තැනක දිව නැත්ද, රස නැත්ද, දිවෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනය නැත්ද, පාපිය, එහි ඔබට පිවිසිය නොහැක. පාපිය, කය ඔබටම අයිතිය, ස්පර්ශ ඔබටම අයිතිය, කයෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනයද ඔබටම අයිතිය. නමුත්, පාපිය, යම් තැනක කය නැත්ද, ස්පර්ශ නැත්ද, කයෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනය නැත්ද, පාපිය, එහි ඔබට පිවිසිය නොහැක. පාපිය, මනස ඔබටම අයිතිය, ධර්මාරම්මණ ඔබටම අයිතිය, මනසෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනයද ඔබටම අයිතිය. නමුත්, පාපිය, යම් තැනක මනස නැත්ද, ධර්මාරම්මණ නැත්ද, මනසෙහි ස්පර්ශයෙන් හටගන්නා විඤ්ඤාණයෙන් යුත් ආයතනය නැත්ද, පාපිය, එහි ඔබට පිවිසිය නොහැක.’\n\n‘යමක් ‘මගේ’ යැයි කියත්ද, යම් අය ‘මගේය’ යැයි කියත්ද; ශ්‍රමණය, ඔබගේ සිත එහි ඇලී තිබේ නම්, ඔබට මාගෙන් නිදහස් විය නොහැක.’\n\n‘යමක් ‘මගේ’ යැයි කියත්ද, එය මාගේ නොවේ. යම් අය ‘මගේය’ යැයි කියත්ද, මම ඔවුනට අයිති නැත. පාපිය, මෙසේ දැනගන්න, ඔබට මගේ මාර්ගයවත් දැකගත නොහැක.’\n\nඑවිට පාපී මාරයා ‘භාග්‍යවතුන් වහන්සේ මා හඳුනයි, සුගතයන් වහන්සේ මා හඳුනයි’ යැයි දුක් වූයේ, නොසතුටු වූයේ, අධෛර්යයට පත් වූයේ, තමාගේ බල ප්‍රදේශයෙන් පහව ගොස් එතැනම අතුරුදහන් විය.",
      "paliTitle": "Kassakasuttaṃ"
    },
    {
      "number": 156,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu viharati himavantapadese [himavantapasse (sī.)] araññakuṭikāyaṃ. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘sakkā nu kho rajjaṃ kāretuṃ ahanaṃ aghātayaṃ ajinaṃ ajāpayaṃ asocaṃ asocāpayaṃ dhammenā’’ti? Atha kho māro pāpimā bhagavato cetasā cetoparivitakkamaññāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘‘kāretu, bhante, bhagavā rajjaṃ, kāretu, sugato, rajjaṃ ahanaṃ aghātayaṃ ajinaṃ ajāpayaṃ asocaṃ asocāpayaṃ dhammenā’’ti. ‘‘Kiṃ pana me tvaṃ, pāpima, passasi yaṃ maṃ tvaṃ evaṃ vadesi – ‘kāretu, bhante, bhagavā rajjaṃ, kāretu sugato, rajjaṃ ahanaṃ aghātayaṃ ajinaṃ ajāpayaṃ asocaṃ asocāpayaṃ dhammenā’’’ti? ‘‘Bhagavatā kho, bhante, cattāro iddhipādā bhāvitā bahulīkatā yānīkatā vatthukatā anuṭṭhitā paricitā susamāraddhā. Ākaṅkhamāno ca, bhante, bhagavā himavantaṃ pabbatarājaṃ suvaṇṇaṃ tveva adhimucceyya suvaṇṇañca panassā’’ti [suvaṇṇapabbatassāti (sī. syā. kaṃ.), suvaṇṇañca pabbatassāti (pī.)]. ‘‘Pabbatassa suvaṇṇassa, jātarūpassa kevalo; Dvittāva nālamekassa, iti vidvā samañcare. ‘‘Yo dukkhamaddakkhi yatonidānaṃ, Kāmesu so jantu kathaṃ nameyya; Upadhiṃ viditvā saṅgoti loke, Tasseva jantu vinayāya sikkhe’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ bhagavā, jānāti maṃ sugato’’ti dukkhī dummano tatthevantaradhāyīti. Dutiyo vaggo. Tassuddānaṃ – Pāsāṇo sīho sakalikaṃ [sakkhalikaṃ (ka.)], patirūpañca mānasaṃ; Pattaṃ āyatanaṃ piṇḍaṃ, kassakaṃ rajjena te dasāti.",
      "english": "At one time, the Blessed One was dwelling in the Kosalan country, in a forest hut in the Himālaya region. Then, as the Blessed One was alone in seclusion, such a thought arose in his mind: \"Is it truly possible to rule a kingdom righteously, without killing or causing to kill, without conquering or causing to conquer, without grieving or causing to grieve?\"\n\nThen Māra the Evil One, having known the thought in the Blessed One’s mind with his own mind, approached the Blessed One. Having approached, he said to the Blessed One: \"Venerable sir, let the Blessed One rule a kingdom! Let the Fortunate One rule a kingdom, without killing or causing to kill, without conquering or causing to conquer, without grieving or causing to grieve, righteously!\"\n\n\"What do you see in me, Evil One, that you speak to me thus: 'Venerable sir, let the Blessed One rule a kingdom! Let the Fortunate One rule a kingdom, without killing or causing to kill, without conquering or causing to conquer, without grieving or causing to grieve, righteously'?\"\n\n\"Venerable sir, the Blessed One has developed, made much of, used as a vehicle, made a basis, established, practiced, and properly brought to perfection the four bases of psychic power. And, Venerable sir, if the Blessed One were to wish, he could resolve for the king of mountains, the Himālaya, to be pure gold, and it would indeed become gold.\"\n\n\"A golden mountain, pure gold entirely,\nEven two such would not be enough for one person.\nKnowing this, one should fare.\n\nWhoever has seen suffering and its origin,\nHow could such a being incline towards sensual pleasures?\nHaving understood that clinging is an entanglement in the world,\nSuch a being should train for its removal.\"\n\nThen Māra the Evil One, thinking \"The Blessed One knows me, the Fortunate One knows me!\", distressed and dejected, vanished right there.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයෙහි හිමවත් ප්‍රදේශයෙහි අරණ්‍ය කුටියක වැඩසිටින සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ රහසට වැඩ, සිත එකඟ කරගෙන වැඩසිටින කල්හි මෙසේ සිතුවිල්ලක් පහළ විය: \"තමා නොමරා, අනුන් නොමරවා, තමාට පීඩා නොකර, අනුන්ට පීඩා නොකරවා, තමාට ශෝකයක් ඇති නොකර, අනුන්ට ශෝකයක් ඇති නොකරවා, ධර්මය අනුව රාජ්‍ය පාලනය කළ හැකි ද?\"\n\nඉක්බිති පව්කම්හි ඇලුණු මාරයා භාග්‍යවතුන් වහන්සේගේ සිතෙහි වූ එම චිත්ත විතර්කය දැනගෙන භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. එළඹ, භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"වහන්ස, භාග්‍යවතුන් වහන්සේ රාජ්‍ය පාලනය කරනු මැනව. සුගතයන් වහන්ස, සුගතයන් වහන්සේ රාජ්‍ය පාලනය කරනු මැනව. තමා නොමරා, අනුන් නොමරවා, තමාට පීඩා නොකර, අනුන්ට පීඩා නොකරවා, තමාට ශෝකයක් ඇති නොකර, අනුන්ට ශෝකයක් ඇති නොකරවා, ධර්මය අනුව.\"\n\n\"පව්කාරය, නුඹ මා කෙරෙහි කුමක් දැකගෙනද, 'වහන්ස, භාග්‍යවතුන් වහන්සේ රාජ්‍ය පාලනය කරනු මැනව. සුගතයන් වහන්ස, සුගතයන් වහන්සේ රාජ්‍ය පාලනය කරනු මැනව. තමා නොමරා, අනුන් නොමරවා, තමාට පීඩා නොකර, අනුන්ට පීඩා නොකරවා, තමාට ශෝකයක් ඇති නොකර, අනුන්ට ශෝකයක් ඇති නොකරවා, ධර්මය අනුව' යනුවෙන් මට මෙසේ කියන්නේ?\"\n\n\"වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් සතර ඉර්ධිපාද වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද, යානයක් සේ යොදාගත්, පදනමක් සේ පිහිටුවාගත්, නිරතුරුව පුහුණු කරන ලද, මැනවින් හුරුපුරුදු කරන ලද, හොඳින් ආරම්භ කරන ලද සේක. තවද, වහන්ස, භාග්‍යවතුන් වහන්සේ කැමති වුවහොත් හිමවත් පර්වත රාජයාම රන් බවට අධිෂ්ඨාන කළ හැකි ය. එය රන් වනු ඇත.\"\n\n\"රන්වූ පර්වතයක සම්පූර්ණ රන් සම්පතක් වූවද, එක් අයෙකුට පවා දෙගුණයක් වුවද ප්‍රමාණවත් නොවේ. මෙය දන්නා නුවණැත්තා නිවැරදිව හැසිරිය යුතු ය. යමෙක් දුක හා එහි හේතුව දුටුවේ නම්, එබඳු සත්වයෙක් කෙසේ නම් කාමයන් කෙරෙහි නැමේ ද? ලෝකයෙහි ඇලීමට හේතු වන දේ බැඳීමක් බව දැන, එම බැඳීම දුරුකිරීම පිණිසම පුහුණු විය යුතු ය.\"\n\nඉක්බිති පව්කම්හි ඇලුණු මාරයා \"භාග්‍යවතුන් වහන්සේ මා හඳුනයි. සුගතයන් වහන්සේ මා හඳුනයි\" යි දුක් වූයේ, සිත් තැවුල් ඇති වූයේ ඒ මොහොතෙහිම අතුරුදහන් විය.\n\nදෙවෙනි වර්ගයයි. එහි සූත්‍ර නාමාවලිය: පාෂාණ, සිංහ, සකලික, ප්‍රතිරූප, මානස, පත්ත, ආයතන, පිණ්ඩ, කස්සක, රාජ්‍ය යන සූත්‍ර දසයයි.",
      "paliTitle": "Rajjasuttaṃ"
    },
    {
      "number": 157,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sakkesu viharati silāvatiyaṃ. Tena kho pana samayena sambahulā bhikkhū bhagavato avidūre appamattā ātāpino pahitattā viharanti. Atha kho māro pāpimā brāhmaṇavaṇṇaṃ abhinimminitvā mahantena jaṭaṇḍuvena ajinakkhipanivattho jiṇṇo gopānasivaṅko ghurughurupassāsī udumbaradaṇḍaṃ gahetvā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘daharā bhavanto pabbajitā susū kāḷakesā bhadrena yobbanena samannāgatā paṭhamena vayasā anikkīḷitāvino kāmesu. Bhuñjantu bhavanto mānusake kāme. Mā sandiṭṭhikaṃ hitvā kālikaṃ anudhāvitthā’’ti. ‘‘Na kho mayaṃ, brāhmaṇa, sandiṭṭhikaṃ hitvā kālikaṃ anudhāvāma. Kālikañca kho mayaṃ, brāhmaṇa, hitvā sandiṭṭhikaṃ anudhāvāma. Kālikā hi, brāhmaṇa, kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Sandiṭṭhiko ayaṃ dhammo akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’’ti. Evaṃ vutte, māro pāpimā sīsaṃ okampetvā jivhaṃ nillāletvā tivisākhaṃ nalāṭe nalāṭikaṃ vuṭṭhāpetvā daṇḍamolubbha pakkāmi. Atha kho te bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha mayaṃ, bhante, bhagavato avidūre appamattā ātāpino pahitattā viharāma. Atha kho, bhante, aññataro brāhmaṇo mahantena jaṭaṇḍuvena ajinakkhipanivattho jiṇṇo gopānasivaṅko ghurughurupassāsī udumbaradaṇḍaṃ gahetvā yena mayaṃ tenupasaṅkami; upasaṅkamitvā amhe etadavoca – ‘daharā bhavanto pabbajitā susū kāḷakesā bhadrena yobbanena samannāgatā paṭhamena vayasā anikkīḷitāvino kāmesu. Bhuñjantu bhavanto mānusake kāme. Mā sandiṭṭhikaṃ hitvā kālikaṃ anudhāvitthā’ti. Evaṃ vutte, mayaṃ, bhante, taṃ brāhmaṇaṃ etadavocumha – ‘na kho mayaṃ, brāhmaṇa, sandiṭṭhikaṃ hitvā kālikaṃ anudhāvāma. Kālikañca kho mayaṃ, brāhmaṇa, hitvā sandiṭṭhikaṃ anudhāvāma. Kālikā hi, brāhmaṇa, kāmā vuttā bhagavatā bahudukkhā bahupāyāsā, ādīnavo ettha bhiyyo. Sandiṭṭhiko ayaṃ dhammo akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Evaṃ vutte, bhante, so brāhmaṇo sīsaṃ okampetvā jivhaṃ nillāletvā tivisākhaṃ nalāṭe nalāṭikaṃ vuṭṭhāpetvā daṇḍamolubbha pakkanto’’ti. ‘‘Neso, bhikkhave, brāhmaṇo. Māro eso pāpimā tumhākaṃ vicakkhukammāya āgato’’ti. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Yo dukkhamaddakkhi yatonidānaṃ, Kāmesu so jantu kathaṃ nameyya; Upadhiṃ viditvā saṅgoti loke, Tasseva jantu vinayāya sikkhe’’ti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling among the Sakyans in Sīlāvatī. Now at that time a good many bhikkhus were dwelling not far from the Blessed One, heedful, ardent, and resolute.\n\nThen Māra, the Evil One, having assumed the guise of a brahmin, with a large coil of matted hair, wearing a deerskin, old, with a bent frame like a roof-gable, breathing with a wheezing sound, holding a fig-wood staff, approached those bhikkhus. Having approached, he said to those bhikkhus: \"Venerables, you are young, newly ordained, with black hair, endowed with the fortune of youth, in the prime of life, and have not yet indulged in sensual pleasures. Enjoy human sensual pleasures, Venerables. Do not abandon the visible present to pursue the temporal future.\" \"No, brahmin, we do not abandon the visible present to pursue the temporal future. Instead, brahmin, we abandon the temporal to pursue the visible present. For, brahmin, sensual pleasures are declared by the Blessed One to be temporal, full of much suffering and much despair, with even greater peril in them. But this Dhamma is visible here and now, timeless, inviting one to come and see, leading inwards, to be personally experienced by the wise.\" When this was said, Māra, the Evil One, shook his head, stuck out his tongue, raised a three-pronged frown on his brow, leaned on his staff, and departed.\n\nThen those bhikkhus approached the Blessed One. Having approached, they bowed to the Blessed One and sat down to one side. Seated to one side, those bhikkhus said to the Blessed One: \"Venerable sir, here, not far from the Blessed One, we were dwelling heedful, ardent, and resolute. Then, Venerable sir, a certain brahmin, with a large coil of matted hair, wearing a deerskin, old, with a bent frame like a roof-gable, breathing with a wheezing sound, holding a fig-wood staff, approached us. Having approached, he said to us: 'Venerables, you are young, newly ordained, with black hair, endowed with the fortune of youth, in the prime of life, and have not yet indulged in sensual pleasures. Enjoy human sensual pleasures, Venerables. Do not abandon the visible present to pursue the temporal future.' When this was said, Venerable sir, we replied to that brahmin: 'No, brahmin, we do not abandon the visible present to pursue the temporal future. Instead, brahmin, we abandon the temporal to pursue the visible present. For, brahmin, sensual pleasures are declared by the Blessed One to be temporal, full of much suffering and much despair, with even greater peril in them. But this Dhamma is visible here and now, timeless, inviting one to come and see, leading inwards, to be personally experienced by the wise.' When this was said, Venerable sir, that brahmin shook his head, stuck out his tongue, raised a three-pronged frown on his brow, leaned on his staff, and departed.\"\n\n\"Bhikkhus, that was not a brahmin. That was Māra, the Evil One, who came to blind you.\" Then the Blessed One, understanding the meaning of this matter, on that occasion, uttered this verse:\n\nOne who has seen suffering and its origin,\nHow could such a being incline to sensual pleasures?\nHaving understood clinging to be a bond in the world,\nLet that being train for its removal.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ ශාක්‍ය දනපදයේ සිලාවතී නම් නියම්ගමෙහි වාසය කළ සේක. ඒ ඒකාන්තයෙන් එකල බොහෝ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට නුදුරුව අප්‍රමාදීව, කෙලෙස් තවන වීර්යයෙන් යුක්තව, සිත යොමාගෙන වාසය කළහ.\n\nඉක්බිති පව්කම්හි ඇලුණු මාරයා බ්‍රාහ්මණයෙකුගේ වේශයක් මවාගෙන, මහත් වූ ජටා මඬුලක් ඇතිව, චීනයක් (මුව සමක්) උතුරු සළුවක් කොට පොරවාගෙන, මහලු වූ, අඹුවක මෙන් ඇඹරී ගිය ශරීරයක් ඇතිව, හුස්ම ගැනීමේදී ඝොර ඝොර ශබ්ද නගමින්, දිඹුල් දණ්ඩක් ගෙන, යම් තැනක ඒ භික්ෂූන් වහන්සේලා වැඩසිටියාහු ද, එතැනට පැමිණියේය. පැමිණ ඒ භික්ෂූන් වහන්සේලාට මෙය කීවේය: “පින්වත්නි, ඔබලා තරුණය. පැවිදි වූවන්ය. කුඩාය. කළු කෙස් ඇති අයය. යහපත් වූ යෞවනයෙන් යුක්තය. පළමු වයසෙහි සිටින්නන්ය. කාමයන්හි කෙළි දෙලෙන් නොසිටියවුන්ය. පින්වත්නි, මිනිස් කාමයන් විඳින්න. මේ ආත්මභාවයේදී දැකිය හැකි ඵල ඇති (සන්දිට්ඨික) ධර්මය අත්හැර, මතු කාලයකදී ඵල දෙන (කාලික) ධර්මය පසුපස නොයන්න.”\n\n“බ්‍රාහ්මණ, අපි මේ ආත්මභාවයේදී දැකිය හැකි ඵල ඇති (සන්දිට්ඨික) ධර්මය අත්හැර, මතු කාලයකදී ඵල දෙන (කාලික) ධර්මය පසුපස යන්නෝ නොවෙමු. ඒකාන්තයෙන් බ්‍රාහ්මණ, අපි මතු කාලයකදී ඵල දෙන (කාලික) ධර්මය අත්හැර, මේ ආත්මභාවයේදී දැකිය හැකි ඵල ඇති (සන්දිට්ඨික) ධර්මය පසුපස යන්නෙමු. මක්නිසාද යත් බ්‍රාහ්මණ, කාමයන් භාග්‍යවතුන් වහන්සේ විසින් බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති බවට දේශනා කරන ලදී. මෙහි ආදීනවය අතිශයින් වැඩිය. මේ ධර්මය නම් මේ ආත්මභාවයේදීම දැකිය හැකි ඵල ඇති (සන්දිට්ඨික), කල් නොයන (අකාලික), ‘එව, බලව’ යි කිව හැකි (එහිපස්සික), නිවන කරා පමුණුවන (ඕපනයික), ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම අවබෝධ කළ යුතු (පච්චත්තං වේදිතබ්බ) ධර්මයකි.”\n\nමෙසේ කී කල්හි, පව්කම්හි ඇලුණු මාරයා හිස සොලවා, දිව පිටතට දික්කොට, නළලේ ත්‍රිවිශාඛ වූ නළලත නංවා, දණ්ඩට හේත්තු වී පිටත්ව ගියේය.\n\nඉක්බිති ඒ භික්ෂූන් වහන්සේලා යම් තැනක භාග්‍යවතුන් වහන්සේ වැඩසිටියාහු ද, එතැනට පැමිණියාහුය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහුන් ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට මෙය කීවාහුය: “වහන්ස, අපි මෙහි භාග්‍යවතුන් වහන්සේට නුදුරුව අප්‍රමාදීව, කෙලෙස් තවන වීර්යයෙන් යුක්තව, සිත යොමාගෙන වාසය කරන්නෙමු. වහන්ස, ඉක්බිති එක්තරා බ්‍රාහ්මණයෙක් මහත් වූ ජටා මඬුලක් ඇතිව, චීනයක් උතුරු සළුවක් කොට පොරවාගෙන, මහලු වූ, අඹුවක මෙන් ඇඹරී ගිය ශරීරයක් ඇතිව, හුස්ම ගැනීමේදී ඝොර ඝොර ශබ්ද නගමින්, දිඹුල් දණ්ඩක් ගෙන, යම් තැනක අපි සිටින්නෙමු ද, එතැනට පැමිණියේය. පැමිණ අපට මෙය කීවේය: ‘පින්වත්නි, ඔබලා තරුණය. පැවිදි වූවන්ය. කුඩාය. කළු කෙස් ඇති අයය. යහපත් වූ යෞවනයෙන් යුක්තය. පළමු වයසෙහි සිටින්නන්ය. කාමයන්හි කෙළි දෙලෙන් නොසිටියවුන්ය. පින්වත්නි, මිනිස් කාමයන් විඳින්න. මේ ආත්මභාවයේදී දැකිය හැකි ඵල ඇති ධර්මය අත්හැර, මතු කාලයකදී ඵල දෙන ධර්මය පසුපස නොයන්න.’ වහන්ස, මෙසේ කී කල්හි, අපි ඒ බ්‍රාහ්මණයාට මෙය කීමු: ‘බ්‍රාහ්මණ, අපි මේ ආත්මභාවයේදී දැකිය හැකි ඵල ඇති (සන්දිට්ඨික) ධර්මය අත්හැර, මතු කාලයකදී ඵල දෙන (කාලික) ධර්මය පසුපස යන්නෝ නොවෙමු. ඒකාන්තයෙන් බ්‍රාහ්මණ, අපි මතු කාලයකදී ඵල දෙන (කාලික) ධර්මය අත්හැර, මේ ආත්මභාවයේදී දැකිය හැකි ඵල ඇති (සන්දිට්ඨික) ධර්මය පසුපස යන්නෙමු. මක්නිසාද යත් බ්‍රාහ්මණ, කාමයන් භාග්‍යවතුන් වහන්සේ විසින් බොහෝ දුක් ඇති, බොහෝ වෙහෙස ඇති බවට දේශනා කරන ලදී. මෙහි ආදීනවය අතිශයින් වැඩිය. මේ ධර්මය නම් මේ ආත්මභාවයේදීම දැකිය හැකි ඵල ඇති (සන්දිට්ඨික), කල් නොයන (අකාලික), ‘එව, බලව’ යි කිව හැකි (එහිපස්සික), නිවන කරා පමුණුවන (ඕපනයික), ප්‍රඥාවන්තයන් විසින් තමන් තුළින්ම අවබෝධ කළ යුතු (පච්චත්තං වේදිතබ්බ) ධර්මයකි.’ වහන්ස, මෙසේ කී කල්හි, ඒ බ්‍රාහ්මණයා හිස සොලවා, දිව පිටතට දික්කොට, නළලේ ත්‍රිවිශාඛ වූ නළලත නංවා, දණ්ඩට හේත්තු වී පිටත්ව ගියේය.”\n\n“මහණෙනි, මේ බ්‍රාහ්මණයෙක් නොවේ. මේ පව්කම්හි ඇලුණු මාරයා ඔබලාගේ අඥානකම සඳහා පැමිණියේය.”\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ මේ කාරණය දැන, ඒ වේලෙහි මේ ගාථාව වදාළ සේක:\n“යමෙක් දුකත්, දුක ඇතිවීමට හේතුවත් අවබෝධ කළේ ද,\nඒ පුද්ගලයා කාමයන් කෙරෙහි කෙසේ නම් නැමෙන්නේ ද?\nලෝකයෙහි බැඳීමක් වන උපාධිය (පංච උපාදානස්කන්ධය) දැන,\nඒ උපාධිය නැතිකිරීම සඳහා ම ඒ පුද්ගලයා හික්මිය යුතුය.”",
      "paliTitle": "Sambahulasuttaṃ",
      "vagga": "Tatiyavaggo"
    },
    {
      "number": 158,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati silāvatiyaṃ. Tena kho pana samayena āyasmā samiddhi bhagavato avidūre appamatto ātāpī pahitatto viharati. Atha kho āyasmato samiddhissa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘lābhā vata me, suladdhaṃ vata me, yassa me satthā arahaṃ sammāsambuddho. Lābhā vata me, suladdhaṃ vata me, yvāhaṃ evaṃ svākkhāte dhammavinaye pabbajito. Lābhā vata me, suladdhaṃ vata me, yassa me sabrahmacārino sīlavanto kalyāṇadhammā’’ti. Atha kho māro pāpimā āyasmato samiddhissa cetasā cetoparivitakkamaññāya yenāyasmā samiddhi tenupasaṅkami; upasaṅkamitvā āyasmato samiddhissa avidūre mahantaṃ bhayabheravaṃ saddamakāsi, apissudaṃ pathavī maññe undrīyati. Atha kho āyasmā samiddhi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno āyasmā samiddhi bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, bhagavato avidūre appamatto ātāpī pahitatto viharāmi. Tassa mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘lābhā vata me, suladdhaṃ vata me, yassa me satthā arahaṃ sammāsambuddho. Lābhā vata me, suladdhaṃ vata me, yvāhaṃ evaṃ svākkhāte dhammavinaye pabbajito. Lābhā vata me, suladdhaṃ vata me, yassa me sabrahmacārino sīlavanto kalyāṇadhammā’ti. Tassa mayhaṃ, bhante, avidūre mahābhayabheravasaddo ahosi, apissudaṃ pathavī maññe undrīyatī’’ti. ‘‘Nesā, samiddhi, pathavī undrīyati. Māro eso pāpimā tuyhaṃ vicakkhukammāya āgato. Gaccha tvaṃ, samiddhi, tattheva appamatto ātāpī pahitatto viharāhī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā samiddhi bhagavato paṭissutvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Dutiyampi kho āyasmā samiddhi tattheva appamatto ātāpī pahitatto vihāsi. Dutiyampi kho āyasmato samiddhissa rahogatassa paṭisallīnassa…pe… dutiyampi kho māro pāpimā āyasmato samiddhissa cetasā cetoparivitakkamaññāya…pe… apissudaṃ pathavī maññe undrīyati. Atha kho āyasmā samiddhi māraṃ pāpimantaṃ gāthāya ajjhabhāsi – ‘‘Saddhāyāhaṃ pabbajito, agārasmā anagāriyaṃ; Sati paññā ca me buddhā, cittañca susamāhitaṃ; Kāmaṃ karassu rūpāni, neva maṃ byādhayissasī’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ samiddhi bhikkhū’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "At one time, the Blessed One was dwelling among the Sakyans, in Silāvatī. Now at that time, the venerable Samiddhi was dwelling not far from the Blessed One, heedful, ardent, and resolute. Then, while venerable Samiddhi was secluded and withdrawn, a thought arose in his mind thus: \"Indeed, I am fortunate, truly well-gained it is for me, that my Teacher is the Arahant, the Fully Self-Awakened One. Indeed, I am fortunate, truly well-gained it is for me, that I have gone forth into such a well-expounded Dhamma and Discipline. Indeed, I am fortunate, truly well-gained it is for me, that my spiritual companions are virtuous and of good character.\" Then Māra, the Evil One, knowing with his mind the thought that had arisen in venerable Samiddhi's mind, approached venerable Samiddhi. Having approached, he made a great, terrifying and dreadful noise not far from venerable Samiddhi, as if the earth were tearing apart.\n\nThen venerable Samiddhi approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, venerable Samiddhi said to the Blessed One: \"Here, venerable sir, I was dwelling not far from the Blessed One, heedful, ardent, and resolute. While I, venerable sir, was secluded and withdrawn, a thought arose in my mind thus: 'Indeed, I am fortunate, truly well-gained it is for me, that my Teacher is the Arahant, the Fully Self-Awakened One. Indeed, I am fortunate, truly well-gained it is for me, that I have gone forth into such a well-expounded Dhamma and Discipline. Indeed, I am fortunate, truly well-gained it is for me, that my spiritual companions are virtuous and of good character.' Then, venerable sir, not far from me, there was a great, terrifying and dreadful noise, as if the earth were tearing apart.\"\n\n\"Samiddhi, that is not the earth tearing apart. That is Māra, the Evil One, who has come to confuse you. Go, Samiddhi, and continue to dwell there, heedful, ardent, and resolute.\"\n\n\"Yes, venerable sir,\" replied venerable Samiddhi, and rising from his seat, he paid homage to the Blessed One, circumambulated him clockwise, and then departed.\n\nA second time, venerable Samiddhi dwelt there, heedful, ardent, and resolute. A second time, while venerable Samiddhi was secluded and withdrawn, a thought arose in his mind thus: \"Indeed, I am fortunate, truly well-gained it is for me, that my Teacher is the Arahant, the Fully Self-Awakened One. Indeed, I am fortunate, truly well-gained it is for me, that I have gone forth into such a well-expounded Dhamma and Discipline. Indeed, I am fortunate, truly well-gained it is for me, that my spiritual companions are virtuous and of good character.\" A second time, Māra, the Evil One, knowing with his mind the thought that had arisen in venerable Samiddhi's mind, approached venerable Samiddhi. Having approached, he made a great, terrifying and dreadful noise not far from venerable Samiddhi, as if the earth were tearing apart.\n\nThen venerable Samiddhi addressed Māra, the Evil One, with a verse:\n\"Through faith I have gone forth, from home to homelessness.\nMy mindfulness and wisdom are awakened, and my mind is well-composed.\nYou may make shapes as you wish, but you will not disturb me.\"\n\nThen Māra, the Evil One, realizing \"The monk Samiddhi knows me!\" was distressed and disheartened, and he vanished right there.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ ශාක්‍ය ජනපදයෙහි සිලාවතී නම් නුවර වැඩසිටියහ. ඒ කල්හි ආයුෂ්මත් සමිද්ධි තෙරණුවෝ භාග්‍යවතුන් වහන්සේට නුදුරුව අප්‍රමාදීව, වීර්යවත්ව, දැඩි අධිෂ්ඨානයෙන් යුක්තව වැඩසිටියහ. එවිට ආයුෂ්මත් සමිද්ධි තෙරුන්ට රහසට ගිය කල්හි, ප්‍රතිසල්ලීන වූ කල්හි මෙබඳු සිතුවිල්ලක් පහළ විය: \"මාගේ ශාස්තෘන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වන බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත. මම මෙබඳු ස්වාක්ඛ්‍යාත ධර්ම විනයෙහි පැවිදි වූ බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත. මාගේ සබ්‍රහ්මචාරීන් වහන්සේලා ශීලවන්තව, කල්‍යාණ ධර්මයන්ගෙන් යුක්ත වන බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත.\" එවිට පාපී මාරයා ආයුෂ්මත් සමිද්ධි තෙරුන්ගේ සිතෙහි වූ එම සිතුවිල්ල දැනගෙන, ආයුෂ්මත් සමිද්ධි තෙරුන් වැඩසිටි තැනට පැමිණියේය; පැමිණ, ආයුෂ්මත් සමිද්ධි තෙරුන්ට නුදුරුව මහත් භයානක ශබ්දයක් කළේය, පොළොව පෙරළී යන්නා සේය. එවිට ආයුෂ්මත් සමිද්ධි තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙකින් වැඩසිටියහ. එකත්පසෙකින් වැඩසිටි ආයුෂ්මත් සමිද්ධි තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය කීහ: \"ස්වාමීනි, මම මෙහි භාග්‍යවතුන් වහන්සේට නුදුරුව අප්‍රමාදීව, වීර්යවත්ව, දැඩි අධිෂ්ඨානයෙන් යුක්තව වැඩසිටිමි. ස්වාමීනි, රහසට ගිය කල්හි, ප්‍රතිසල්ලීන වූ කල්හි මට මෙබඳු සිතුවිල්ලක් පහළ විය: 'මාගේ ශාස්තෘන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වන බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත. මම මෙබඳු ස්වාක්ඛ්‍යාත ධර්ම විනයෙහි පැවිදි වූ බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත. මාගේ සබ්‍රහ්මචාරීන් වහන්සේලා ශීලවන්තව, කල්‍යාණ ධර්මයන්ගෙන් යුක්ත වන බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත.' ස්වාමීනි, මට නුදුරුව මහත් භයානක ශබ්දයක් ඇති විය, පොළොව පෙරළී යන්නා සේය.\" \"සමිද්ධි, ඒ පොළොව පෙරළී යන්නේ නොවේ. ඒ පාපී මාරයා නුඹගේ (සමාධිය) බිඳීමට පැමිණියේය. සමිද්ධි, නුඹ එතැනටම ගොස් අප්‍රමාදීව, වීර්යවත්ව, දැඩි අධිෂ්ඨානයෙන් යුක්තව වැඩහිඳින්නැ\"යි වදාළ සේක. \"එසේය, ස්වාමීනි\"යි ආයුෂ්මත් සමිද්ධි තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, ආසනයෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වැඳ, පැදකුණු කොට නික්ම ගියහ.\n\nදෙවැනි වරටත් ආයුෂ්මත් සමිද්ධි තෙරණුවෝ එතැනම අප්‍රමාදීව, වීර්යවත්ව, දැඩි අධිෂ්ඨානයෙන් යුක්තව වැඩසිටියහ. දෙවැනි වරටත් ආයුෂ්මත් සමිද්ධි තෙරුන්ට රහසට ගිය කල්හි, ප්‍රතිසල්ලීන වූ කල්හි මෙබඳු සිතුවිල්ලක් පහළ විය: 'මාගේ ශාස්තෘන් වහන්සේ අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ වන බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත. මම මෙබඳු ස්වාක්ඛ්‍යාත ධර්ම විනයෙහි පැවිදි වූ බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත. මාගේ සබ්‍රහ්මචාරීන් වහන්සේලා ශීලවන්තව, කල්‍යාණ ධර්මයන්ගෙන් යුක්ත වන බැවින්, මම වාසනාවන්තයෙක්මි, මට මනා ලාභයක් ලැබී ඇත.' දෙවැනි වරටත් පාපී මාරයා ආයුෂ්මත් සමිද්ධි තෙරුන්ගේ සිතෙහි වූ එම සිතුවිල්ල දැනගෙන, ආයුෂ්මත් සමිද්ධි තෙරුන් වැඩසිටි තැනට පැමිණියේය; පැමිණ, ආයුෂ්මත් සමිද්ධි තෙරුන්ට නුදුරුව මහත් භයානක ශබ්දයක් කළේය, පොළොව පෙරළී යන්නා සේය. එවිට ආයුෂ්මත් සමිද්ධි තෙරණුවෝ පාපී මාරයාට ගාථාවකින් මෙසේ කීහ: \"මම ශ්‍රද්ධාවෙන් ගිහිගෙන් නික්ම අනගාරිකව පැවිදි වීමි. මාගේ සිහිය හා ප්‍රඥාව අවබෝධ වී ඇත, සිත මැනවින් සමාධිමත් වී ඇත. නුඹ කැමති රූපයන් මවා පාන්න, මට නම් කිසිදු හිරිහැරයක් කළ නොහැක.\" එවිට පාපී මාරයා \"සමිද්ධි භික්ෂුව මා හඳුනා ගත්තා\" යැයි දුකින්, නොසතුටින් එතැනම අතුරුදහන් විය.",
      "paliTitle": "Samiddhisuttaṃ"
    },
    {
      "number": 159,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena āyasmā godhiko isigilipasse viharati kāḷasilāyaṃ. Atha kho āyasmā godhiko appamatto ātāpī pahitatto viharanto sāmayikaṃ cetovimuttiṃ phusi. Atha kho āyasmā godhiko tamhā sāmayikāya cetovimuttiyā parihāyi. Dutiyampi kho āyasmā godhiko appamatto ātāpī pahitatto viharanto sāmayikaṃ cetovimuttiṃ phusi. Dutiyampi kho āyasmā godhiko tamhā sāmayikāya cetovimuttiyā parihāyi. Tatiyampi kho āyasmā godhiko appamatto ātāpī pahitatto viharanto sāmayikaṃ cetovimuttiṃ phusi. Tatiyampi kho āyasmā godhiko tamhā…pe… parihāyi. Catutthampi kho āyasmā godhiko appamatto…pe… vimuttiṃ phusi. Catutthampi kho āyasmā godhiko tamhā…pe… parihāyi. Pañcamampi kho āyasmā godhiko…pe… cetovimuttiṃ phusi. Pañcamampi kho āyasmā…pe… vimuttiyā parihāyi. Chaṭṭhampi kho āyasmā godhiko appamatto ātāpī pahitatto viharanto sāmayikaṃ cetovimuttiṃ phusi. Chaṭṭhampi kho āyasmā godhiko tamhā sāmayikāya cetovimuttiyā parihāyi. Sattamampi kho āyasmā godhiko appamatto ātāpī pahitatto viharanto sāmayikaṃ cetovimuttiṃ phusi. Atha kho āyasmato godhikassa etadahosi – ‘‘yāva chaṭṭhaṃ khvāhaṃ sāmayikāya cetovimuttiyā parihīno. Yaṃnūnāhaṃ satthaṃ āhareyya’’nti. Atha kho māro pāpimā āyasmato godhikassa cetasā cetoparivitakkamaññāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāhi ajjhabhāsi – ‘‘Mahāvīra mahāpañña, iddhiyā yasasā jala; Sabbaverabhayātīta, pāde vandāmi cakkhuma. ‘‘Sāvako te mahāvīra, maraṇaṃ maraṇābhibhū; Ākaṅkhati cetayati, taṃ nisedha jutindhara. ‘‘Kathañhi bhagavā tuyhaṃ, sāvako sāsane rato; Appattamānaso sekkho, kālaṃ kayirā janesutā’’ti. Tena kho pana samayena āyasmato godhikena satthaṃ āharitaṃ hoti. Atha kho bhagavā ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāya ajjhabhāsi – ‘‘Evañhi dhīrā kubbanti, nāvakaṅkhanti jīvitaṃ; Samūlaṃ taṇhamabbuyha, godhiko parinibbuto’’ti. Atha kho bhagavā bhikkhū āmantesi – ‘‘āyāma, bhikkhave, yena isigilipassaṃ kāḷasilā tenupasaṅkamissāma yattha godhikena kulaputtena satthaṃ āharita’’nti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Atha kho bhagavā sambahulehi bhikkhūhi saddhiṃ yena isigilipassaṃ kāḷasilā tenupasaṅkami. Addasā kho bhagavā āyasmantaṃ godhikaṃ dūratova mañcake vivattakkhandhaṃ semānaṃ [seyyamānaṃ (syā. kaṃ.), soppamānaṃ (ka.)]. Tena kho pana samayena dhūmāyitattaṃ timirāyitattaṃ gacchateva purimaṃ disaṃ, gacchati pacchimaṃ disaṃ, gacchati uttaraṃ disaṃ, gacchati dakkhiṇaṃ disaṃ, gacchati uddhaṃ, gacchati adho, gacchati anudisaṃ. Atha kho bhagavā bhikkhū āmantesi – ‘‘passatha no tumhe, bhikkhave, etaṃ dhūmāyitattaṃ timirāyitattaṃ gacchateva purimaṃ disaṃ, gacchati pacchimaṃ disaṃ, gacchati uttaraṃ disaṃ, gacchati dakkhiṇaṃ disaṃ, gacchati uddhaṃ, gacchati adho, gacchati anudisa’’nti? ‘‘Evaṃ, bhante’’. ‘‘Eso kho, bhikkhave, māro pāpimā godhikassa kulaputtassa viññāṇaṃ samanvesati – ‘kattha godhikassa kulaputtassa viññāṇaṃ patiṭṭhita’nti? Appatiṭṭhitena ca, bhikkhave, viññāṇena godhiko kulaputto parinibbuto’’ti. Atha kho māro pāpimā beluvapaṇḍuvīṇaṃ ādāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Uddhaṃ adho ca tiriyaṃ, disā anudisā svahaṃ; Anvesaṃ nādhigacchāmi, godhiko so kuhiṃ gato’’ti. ‘‘Yo [so (sī. pī.)] dhīro dhitisampanno, jhāyī jhānarato sadā; Ahorattaṃ anuyuñjaṃ, jīvitaṃ anikāmayaṃ. ‘‘Jetvāna maccuno [bhetvā namucino (sī.)] senaṃ, anāgantvā punabbhavaṃ; Samūlaṃ taṇhamabbuyha, godhiko parinibbuto’’ti. ‘‘Tassa sokaparetassa, vīṇā kacchā abhassatha; Tato so dummano yakkho, tatthevantaradhāyathā’’ti [tatthevantaradhāyithāti (syā. kaṃ.), tattheva antaradhāyīti (ka.)].",
      "english": "Thus have I heard. At one time the Blessed One was staying in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. Now at that time, the Venerable Godhika was staying on the Black Rock on Isigili mountain.\n\nThen, dwelling diligently, ardently, and resolutely, the Venerable Godhika attained a temporary liberation of mind. Then the Venerable Godhika fell away from that temporary liberation of mind. A second time, the Venerable Godhika, dwelling diligently, ardently, and resolutely, attained a temporary liberation of mind. A second time, the Venerable Godhika fell away from that temporary liberation of mind. A third time, the Venerable Godhika, dwelling diligently, ardently, and resolutely, attained a temporary liberation of mind. A third time, the Venerable Godhika fell away from that temporary liberation of mind. A fourth time, the Venerable Godhika, dwelling diligently, ardently, and resolutely, attained a temporary liberation of mind. A fourth time, the Venerable Godhika fell away from that temporary liberation of mind. A fifth time, the Venerable Godhika, dwelling diligently, ardently, and resolutely, attained a temporary liberation of mind. A fifth time, the Venerable Godhika fell away from that temporary liberation of mind. A sixth time, the Venerable Godhika, dwelling diligently, ardently, and resolutely, attained a temporary liberation of mind. A sixth time, the Venerable Godhika fell away from that temporary liberation of mind. A seventh time, the Venerable Godhika, dwelling diligently, ardently, and resolutely, attained a temporary liberation of mind.\n\nThen it occurred to the Venerable Godhika: \"Six times I have fallen away from temporary liberation of mind. What if I were to take a knife?\" Then Māra, the Evil One, knowing with his mind the thought process in the Venerable Godhika's mind, approached the Blessed One. Having approached, he addressed the Blessed One with verses:\n\n\"Great Hero, greatly wise, blazing with power and fame! Transcending all enmity and fear, I venerate the feet of the Seer. Your disciple, Great Hero, desiring to overcome death by death, is intent on suicide. Prevent him, O Luminous One! How can it be, O Blessed One, that your disciple, delighting in your teaching, a trainee whose mind has not yet reached its goal, should put an end to his life for all to see?\"\n\nNow at that time, the Venerable Godhika had already taken the knife. Then the Blessed One, knowing \"This is Māra, the Evil One,\" addressed Māra, the Evil One, with a verse: \"Thus indeed do the wise act; they do not long for life. Having uprooted craving with its root, Godhika has attained final Nibbāna.\"\n\nThen the Blessed One addressed the monastics, \"Come, monastics, let us go to the Black Rock on Isigili mountain, where the noble son Godhika took the knife.\" \"Yes, Venerable Sir,\" replied those monastics to the Blessed One.\n\nThen the Blessed One, together with a number of monastics, approached the Black Rock on Isigili mountain. The Blessed One saw the Venerable Godhika from afar, lying on a couch with his shoulder turned. Now at that time, a smoky, hazy darkness was moving towards the eastern direction, moving towards the western direction, moving towards the northern direction, moving towards the southern direction, moving upwards, moving downwards, moving to the intermediate directions.\n\nThen the Blessed One addressed the monastics, \"Do you see, monastics, that smoky, hazy darkness moving towards the eastern direction, moving towards the western direction, moving towards the northern direction, moving towards the southern direction, moving upwards, moving downwards, moving to the intermediate directions?\" \"Yes, Venerable Sir.\" \"That, monastics, is Māra, the Evil One, searching for the consciousness of the noble son Godhika—'Where has the consciousness of the noble son Godhika established itself?' But, monastics, the noble son Godhika has attained final Nibbāna with unestablished consciousness.\"\n\nThen Māra, the Evil One, taking his yellowish-brown lute, approached the Blessed One. Having approached, he addressed the Blessed One with a verse: \"Upwards, downwards, sideways, in all directions and intermediate directions I search, but I do not find him. Where has that Godhika gone?\"\n\n\"That wise one, endowed with steadfast resolve, ever delighting in jhāna, constantly engaged day and night, not desiring life—having vanquished the army of Death, not returning to renewed existence, having uprooted craving with its root, Godhika has attained final Nibbāna.\"\n\nFor him, overwhelmed with sorrow, his lute slipped from under his arm. Then that dejected spirit vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දකනිවාපයේ වැඩසිටියහ.\n\nඑසමයෙහි ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ ඉසිගිලි පර්වත පාර්ශ්වයෙහි වූ කාළසිලා ගුහාවෙහි වාසය කළහ. එකල්හි ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ අප්‍රමාදීව, තීව්‍ර වීර්යයෙන් යුතුව, දැඩි අධිෂ්ඨානයෙන් යුතුව වාසය කරමින් තාවකාලික වූ චේතෝවිමුක්තියක් සාක්ෂාත් කළහ. එකල්හි ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ ඒ තාවකාලික චේතෝවිමුක්තියෙන් පිරිහී ගියහ. දෙවැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ අප්‍රමාදීව, තීව්‍ර වීර්යයෙන් යුතුව, දැඩි අධිෂ්ඨානයෙන් යුතුව වාසය කරමින් තාවකාලික වූ චේතෝවිමුක්තියක් සාක්ෂාත් කළහ. දෙවැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ ඒ තාවකාලික චේතෝවිමුක්තියෙන් පිරිහී ගියහ. තෙවැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ අප්‍රමාදීව, තීව්‍ර වීර්යයෙන් යුතුව, දැඩි අධිෂ්ඨානයෙන් යුතුව වාසය කරමින් තාවකාලික වූ චේතෝවිමුක්තියක් සාක්ෂාත් කළහ. තෙවැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ ඒ චේතෝවිමුක්තියෙන් පිරිහී ගියහ. සිව්වැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ අප්‍රමාදීව, තීව්‍ර වීර්යයෙන් යුතුව, දැඩි අධිෂ්ඨානයෙන් යුතුව වාසය කරමින් තාවකාලික වූ චේතෝවිමුක්තියක් සාක්ෂාත් කළහ. සිව්වැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ ඒ චේතෝවිමුක්තියෙන් පිරිහී ගියහ. පස්වැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ අප්‍රමාදීව, තීව්‍ර වීර්යයෙන් යුතුව, දැඩි අධිෂ්ඨානයෙන් යුතුව වාසය කරමින් තාවකාලික වූ චේතෝවිමුක්තියක් සාක්ෂාත් කළහ. පස්වැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ ඒ චේතෝවිමුක්තියෙන් පිරිහී ගියහ. සයවැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ අප්‍රමාදීව, තීව්‍ර වීර්යයෙන් යුතුව, දැඩි අධිෂ්ඨානයෙන් යුතුව වාසය කරමින් තාවකාලික වූ චේතෝවිමුක්තියක් සාක්ෂාත් කළහ. සයවැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ ඒ තාවකාලික චේතෝවිමුක්තියෙන් පිරිහී ගියහ. සත්වැනි වරටත් ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ අප්‍රමාදීව, තීව්‍ර වීර්යයෙන් යුතුව, දැඩි අධිෂ්ඨානයෙන් යුතුව වාසය කරමින් තාවකාලික වූ චේතෝවිමුක්තියක් සාක්ෂාත් කළහ. එකල්හි ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"මා සය වරක්ම තාවකාලික චේතෝවිමුක්තියෙන් පිරිහී සිටියෙමි. කුමක් නම් මා විසින් ආයුධයක් ගෙන (දිවි තොර කරගත යුතු ද)!\" එකල්හි පාපී මාරයා ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේගේ සිතෙහි වූ ඒ විතර්කය (කල්පනාව) තම සිතින්ම දැනගෙන භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ගාථාවලින් මෙසේ කීය:\n\"මහාවීර වූ මහා ප්‍රඥාවන්තයාණෙනි, ඉර්ධියෙන් හා යසසින් බැබළෙන්නා වූ, සියලු වෛරයන්ගෙන් හා භයයන්ගෙන් මිදුණා වූ, චක්ෂුස්මා වූ ඔබගේ පාදයන් වඳිමි.\nමහාවීරයන් වහන්ස, ඔබගේ ශ්‍රාවකයෙක් ඉතා අභීතව මරණයට මුහුණ දීමට අදහස් කරයි. දීප්තිමත්ව බැබළෙන්නාණෙනි, ඒ ක්‍රියාව නවතනු මැනවි.\nභාග්‍යවතුන් වහන්ස, කෙසේ නම් ඔබගේ ශ්‍රාවකයෙක් ශාසනයෙහි ඇලී, අරහත් ඵලයට නොපැමිණි ශික්ෂා ලාභියෙක් මනුෂ්‍යයන් අතර මරණයට පත් වන්නේද?\"\n\nඑසමයෙහි ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ විසින් ආයුධය ගෙන තිබිණි. එකල්හි භාග්‍යවතුන් වහන්සේ \"මේ පාපී මාරයා\" යැයි දැනගෙන පාපී මාරයාට ගාථාවකින් මෙසේ වදාළහ:\n\"ධීමත් වූවෝ මෙසේම කරති, ඔවුහු ජීවිතය අපේක්ෂා නොකරති. මුලින් උදුරා දැමූ තෘෂ්ණාව ඇතිව ගෝධික ස්ථවිරයන් වහන්සේ පිරිනිවන් පෑ සේක.\"\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළහ: \"එනු මැනවි, මහණෙනි, ඉසිගිලි පර්වත පාර්ශ්වයෙහි වූ කාළසිලාව වෙත අපි යමු, යම් තැනක ගෝධික කුලපුත්‍රයා විසින් ආයුධය ගනු ලැබුවේද, ඒ තැනට.\" \"එසේය, භාග්‍යවතුන් වහන්සැ\" යි කියා ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. එකල්හි භාග්‍යවතුන් වහන්සේ බොහෝ භික්ෂූන් සමඟ ඉසිගිලි පර්වත පාර්ශ්වයෙහි වූ කාළසිලාව වෙත වැඩි සේක. භාග්‍යවතුන් වහන්සේ දුරදීම ආයුෂ්මත් ගෝධික ස්ථවිරයන් වහන්සේ ඇඳක් මත ශරීරය පෙරළී වැටී සැතපී සිටිනු දුටු සේක. එසමයෙහි ධූමයක් මෙන්ද, අඳුරක් මෙන්ද නැගෙනහිර දිශාවට යමින්, බස්නාහිර දිශාවට යමින්, උතුරු දිශාවට යමින්, දකුණු දිශාවට යමින්, ඉහළට යමින්, පහළට යමින්, අනු දිශාවන්ට යමින් තිබුණි. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළහ: \"මහණෙනි, නුඹලා දකින්නහු ද, මේ ධූමයක් මෙන්ද, අඳුරක් මෙන්ද නැගෙනහිර දිශාවට යමින්, බස්නාහිර දිශාවට යමින්, උතුරු දිශාවට යමින්, දකුණු දිශාවට යමින්, ඉහළට යමින්, පහළට යමින්, අනු දිශාවන්ට යමින් තිබෙන දෙය?\" \"එසේය, භාග්‍යවතුන් වහන්ස.\" \"මහණෙනි, මේ පාපී මාරයා ය, ගෝධික කුලපුත්‍රයාගේ විඤ්ඤාණය සොයයි – 'ගෝධික කුලපුත්‍රයාගේ විඤ්ඤාණය කොතැනක පිහිටා තිබේදැ'යි කියා. එහෙත් මහණෙනි, විඤ්ඤාණය කිසි තැනක නොපිහිටාම (පුනර්භවයක් සඳහා පටිසන්ධියක් නොගෙනම) ගෝධික කුලපුත්‍රයා පිරිනිවන් පෑවේය.\"\n\nඑකල්හි පාපී මාරයා බෙළුව පඬු වීණාවක් රැගෙන භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීය:\n\"ඉහළ, පහළ සහ හරහට, දිශාවන්හිද, අනු දිශාවන්හිද මම සොයමින් සිටියද මා විසින් සොයාගැනීමට නොහැකි විය. ඒ ගෝධික කොහේ ගියේදැයි (නොදනිමි).\"\n\"යම් ධීමත් කෙනෙක් ධෛර්යයෙන් යුක්තව, නිරතුරුව ධ්‍යාන වඩමින්, ධ්‍යානවලට ඇලුම් කරමින්, දවස පුරා යෝගාවචරව සිටිමින්, ජීවිතය නොකැමතිව, මාරයාගේ සේනාව පරදවා, නැවත උපතක් නොලබමින්, මුලින්ම තෘෂ්ණාව උදුරා දමා, ගෝධික ස්ථවිරයන් වහන්සේ පිරිනිවන් පෑ සේක.\"\nඑසේ ශෝකයෙන් වෙළී සිටි ඔහුගේ (මාරයාගේ) කිහිල්ලෙහි වූ වීණාව බිම වැටුණේය. එවිට ඒ සිත් තැවුල් ඇති යක්ෂයා එතැනම අතුරුදන් විය.",
      "paliTitle": "Godhikasuttaṃ"
    },
    {
      "number": 160,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhe. Tena kho pana samayena māro pāpimā sattavassāni bhagavantaṃ anubandho hoti otārāpekkho otāraṃ alabhamāno. Atha kho māro pāpimā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Sokāvatiṇṇo nu vanamhi jhāyasi, Vittaṃ nu jīno uda patthayāno; Āguṃ nu gāmasmimakāsi kiñci, Kasmā janena na karosi sakkhiṃ; Sakkhī na sampajjati kenaci te’’ti. ‘‘Sokassa mūlaṃ palikhāya sabbaṃ, Anāgu jhāyāmi asocamāno; Chetvāna sabbaṃ bhavalobhajappaṃ, Anāsavo jhāyāmi pamattabandhū’’ti. ‘‘Yaṃ vadanti mama yidanti, ye vadanti mamanti ca; Ettha ce te mano atthi, na me samaṇa mokkhasī’’ti. ‘‘Yaṃ vadanti na taṃ mayhaṃ, ye vadanti na te ahaṃ; Evaṃ pāpima jānāhi, na me maggampi dakkhasī’’ti. ‘‘Sace maggaṃ anubuddhaṃ, khemaṃ amatagāminaṃ; Apehi gaccha tvameveko, kimaññamanusāsasī’’ti. ‘‘Amaccudheyyaṃ pucchanti, ye janā pāragāmino; Tesāhaṃ puṭṭho akkhāmi, yaṃ saccaṃ taṃ nirūpadhi’’nti. ‘‘Seyyathāpi, bhante, gāmassa vā nigamassa vā avidūre pokkharaṇī. Tatrassa kakkaṭako. Atha kho, bhante, sambahulā kumārakā vā kumārikāyo vā tamhā gāmā vā nigamā vā nikkhamitvā yena sā pokkharaṇī tenupasaṅkameyyuṃ; upasaṅkamitvā taṃ kakkaṭakaṃ udakā uddharitvā thale patiṭṭhapeyyuṃ. Yaṃ yadeva hi so, bhante, kakkaṭako aḷaṃ abhininnāmeyya taṃ tadeva te kumārakā vā kumārikāyo vā kaṭṭhena vā kathalāya vā sañchindeyyuṃ sambhañjeyyuṃ sampalibhañjeyyuṃ. Evañhi so, bhante, kakkaṭako sabbehi aḷehi sañchinnehi sambhaggehi sampalibhaggehi abhabbo taṃ pokkharaṇiṃ otarituṃ. Evameva kho, bhante, yāni kānici visūkāyikāni [yāni visukāyikāni (sī. pī. ka.)] visevitāni vipphanditāni, sabbāni tāni [kānici kānici sabbāni (sī. pī. ka.)] bhagavatā sañchinnāni sambhaggāni sampalibhaggāni. Abhabbo dānāhaṃ, bhante, puna bhagavantaṃ upasaṅkamituṃ yadidaṃ otārāpekkho’’ti. Atha kho māro pāpimā bhagavato santike imā nibbejanīyā gāthāyo abhāsi – ‘‘Medavaṇṇañca pāsāṇaṃ, vāyaso anupariyagā; Apettha muduṃ vindema, api assādanā siyā. ‘‘Aladdhā tattha assādaṃ, vāyasetto apakkame; Kākova selamāsajja, nibbijjāpema gotamā’’ti.",
      "english": "Thus have I heard. At one time the Blessed One was dwelling in Uruvelā, on the bank of the Nerañjarā River, at the Ajapāla Banyan Tree. Now at that time, Māra the Evil One had been following the Blessed One for seven years, seeking an opportunity to tempt him, but finding none. Then Māra the Evil One approached the Blessed One, and having approached, he addressed the Blessed One with a verse:\n\n\"Are you immersed in sorrow, meditating in the forest? Have you lost wealth, or are you longing for it? Have you committed any offense in the village? Why do you not make friends with people? You have no companions at all!\"\n\n\"Having uprooted all sources of sorrow, I meditate, free from remorse; Having severed all craving and longing for becoming, I meditate, free from defilements, O kinsman of the negligent.\"\n\n\"If your mind is attached to what they say is 'mine,' or to those who say 'I am,' then, ascetic, you will not escape from me.\"\n\n\"What they say is not mine, nor am I those who say 'I am.' Thus, Evil One, know that you will not even see my path.\"\n\n\"If you have awakened to the path, the secure path that leads to the Deathless, then go your way alone; why do you instruct others?\"\n\n\"Those people who have gone beyond, who ask about the realm beyond death, to them, when asked, I declare the truth that is free from substratum.\"\n\n\"Just as, Blessed One, not far from a village or town, there might be a pond. In it, there might be a crab. Then, Blessed One, a number of boys or girls might leave that village or town and approach that pond; having approached, they might pull that crab out of the water and place it on dry land. Whatever claw, Blessed One, that crab might extend, those boys or girls would break it off, crush it, or shatter it with a stick or a potsherd. In this way, Blessed One, with all its claws broken off, crushed, and shattered, that crab would be unable to enter the pond again. In the very same way, Blessed One, whatever distractions, entanglements, and struggles there were, all of them have been broken off, crushed, and shattered by the Blessed One. I am now unable, Blessed One, to approach the Blessed One again with the expectation of finding an opportunity to tempt him.\"\n\nThen Māra the Evil One recited these verses of disillusionment in the presence of the Blessed One:\n\n\"A crow flew around a fat-colored stone, thinking: 'Perhaps we'll find something soft here, perhaps there will be something to taste.'\nBut finding no taste there, the crow flew away. Just like that crow that pecked at a rock, we now depart from Gotama, disillusioned.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයක භාග්‍යවතුන් වහන්සේ නේරංජරා නදී තීරයෙහි අජපාල නුග රුක මුල, උරුවේලාවෙහි වැඩවසන සේක. එසමයෙහි පාපී මාරයා සත් වසක් මුළුල්ලේ භාග්‍යවතුන් වහන්සේ පසුපස එළවාගෙන, කිසියම් අවස්ථාවක්, දෝෂයක් හෝ දුර්වලතාවක් සොයමින් සිටිය ද, කිසිදු අවස්ථාවක් නොලැබී සිටියේය.\n\nඑකල්හි පාපී මාරයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසීය:\n“ඔබ ශෝකයෙන් පෙළී වනයෙහි ධ්‍යාන කරනවා ද? නැතහොත් ධනය නැති වී හෝ ධනයක් පතමින් සිටිනවා ද? ඔබ ගමෙහි කිසියම් වරදක් කර තිබෙනවා ද? මක්නිසාද ඔබ මිනිසුන් සමඟ සම්බන්ධතා නොපවත්වන්නේ? ඔබට කිසිවෙකු සමඟ සබඳකමක් නැද්ද?”\n\n“සියලු ශෝකයන්ගේ මූලය උදුරා දමා, වරදක් නැතිව, ශෝක නොකරමින් මම ධ්‍යාන කරමි. සියලු භවයන් කෙරෙහි ඇති තෘෂ්ණාව හා ව්‍යාකූල සිතිවිලි සිඳ බිඳ දමා, කිසිදු ආශ්‍රවයක් නැතිව, ප්‍රමාදයට හිතවත් මාරය, මම ධ්‍යාන කරමි.”\n\n“යම් දෙයක් 'මගේ' යැයි කියනු ලැබේ ද, යම් අය 'මාගේ' යැයි කියනු ලැබේ ද, ඒවා කෙරෙහි ඔබේ සිත බැඳී තිබේ නම්, ශ්‍රමණය, ඔබ මාගෙන් මිදෙන්නේ නැත.”\n\n“යම් දෙයක් 'මගේ' යැයි කියනු ලැබේ ද, එය මගේ නොවේ. යම් අය 'මාගේ' යැයි කියනු ලැබේ ද, ඒ මාගේ අය නොවෙති. පාපී මාරය, මෙසේ දැනගන්න. ඔබ මාගේ මාර්ගයවත් නොදකිනු ඇත.”\n\n“ඔබ අභය වූ, අමා මහා නිවනට යන මාර්ගය අවබෝධ කරගෙන ඇත්නම්, එසේනම්, ඔබ තනිවම ගොස් සිටින්න. අන් අයට කුමක් හෙයින් අනුශාසනා කරන්නේ ද?”\n\n“මාරයාගේ ආධිපත්‍යයෙන් මිදුණු තත්ත්වය ගැන විමසන, පරතෙරට ගිය යම් මිනිස්සු වෙත් ද, ඔවුන් විසින් විමසන ලද මම, උපධි රහිත වූ ඒ සත්‍යය දේශනා කරමි.”\n\n“ස්වාමීනි, යම් සේ ගමකට හෝ නියම්ගමකට නුදුරින් පොකුණක් තිබුණේ ද, එහි කකුළුවෙක් සිටියේ ද. එසමයෙහි ස්වාමීනි, බොහෝ කුමාරවරු හෝ කුමාරිකාවෝ හෝ ඒ ගමෙන් හෝ නියම්ගමෙන් පිටත්ව ඒ පොකුණ තිබූ තැනට පැමිණෙන්නාහු ය. පැමිණ, ඒ කකුළුවා දියෙන් ගොඩට ගෙන, බිම තබන්නාහු ය. ස්වාමීනි, යම් යම් විටක ඒ කකුළුවා තම ග්‍රහණාංගය (දඬු අඩුව) දික් කරන්නේ ද, එවිටම ඒ කුමාරවරු හෝ කුමාරිකාවෝ හෝ දණ්ඩකින් හෝ කැටිකැටුවලින් හෝ එය කපා බිඳ දමා, කුඩුපට්ටම් කරන්නාහු ය. මෙසේ ස්වාමීනි, ඒ කකුළුවාගේ සියලු ග්‍රහණාංග කපා, බිඳ දමා, කුඩුපට්ටම් කරන ලද කල, නැවත ඒ පොකුණට බැසීමට නොහැකි වන්නේ ය. එපරිද්දෙන්ම ස්වාමීනි, යම් යම් අරමුණු කෙරෙහි විකෘති වූ, විසිරුණු, නොසන්සුන් වූ සිතිවිලි (කකුළුවාගේ අඬු හා සමාන) පැවතුණේ ද, ඒ සියල්ල භාග්‍යවතුන් වහන්සේ විසින් සිඳ බිඳ දමා, කුඩුපට්ටම් කරන ලදී. එබැවින් ස්වාමීනි, දෝෂයක් සොයමින් නැවත භාග්‍යවතුන් වහන්සේ වෙත පැමිණීමට මට දැන් හැකියාවක් නැත.”\n\nඑකල්හි පාපී මාරයා භාග්‍යවතුන් වහන්සේ සමීපයෙහි දී, කලකිරීමට හේතු වූ මේ ගාථාවන් පැවසීය:\n“යම් සේ කපුටෙක් මේද වර්ණ පාෂාණයක් වටා පියාසර කළේ ද, 'මෙහි මෘදු යමක් සොයාගත හැකි වුවහොත්, රසවත් යමක් ලැබිය හැකි වේවා' යන බලාපොරොත්තුවෙන්. එහෙත් එහි කිසිදු රසයක් නොලැබ, ඒ කපුටා පියාඹා ගියේ ය. ගෞතමයන් වහන්ස, අප ද ඒ ගලට පහර දුන් කපුටා මෙන් කලකිරී යන්නෙමු.”",
      "paliTitle": "Sattavassānubandhasuttaṃ"
    },
    {
      "number": 161,
      "pali": "Atha kho māro pāpimā bhagavato santike imā nibbejanīyā gāthāyo abhāsitvā tamhā ṭhānā apakkamma bhagavato avidūre pathaviyaṃ pallaṅkena nisīdi tuṇhībhūto maṅkubhūto pattakkhandho adhomukho pajjhāyanto appaṭibhāno kaṭṭhena bhūmiṃ vilikhanto. Atha kho taṇhā ca arati ca ragā ca māradhītaro yena māro pāpimā tenupasaṅkamiṃsu; upasaṅkamitvā māraṃ pāpimantaṃ gāthāya ajjhabhāsiṃsu – ‘‘Kenāsi dummano tāta, purisaṃ kaṃ nu socasi; Mayaṃ taṃ rāgapāsena, āraññamiva kuñjaraṃ; Bandhitvā ānayissāma, vasago te bhavissatī’’ti. ‘‘Arahaṃ sugato loke, na rāgena suvānayo; Māradheyyaṃ atikkanto, tasmā socāmahaṃ bhusa’’nti. Atha kho taṇhā ca arati ca ragā ca māradhītaro yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ etadavocuṃ – ‘‘pāde te, samaṇa, paricāremā’’ti. Atha kho bhagavā na manasākāsi, yathā taṃ anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca arati ca ragā ca māradhītaro ekamantaṃ apakkamma evaṃ samacintesuṃ – ‘‘uccāvacā kho purisānaṃ adhippāyā. Yaṃnūna mayaṃ ekasataṃ ekasataṃ kumārivaṇṇasataṃ abhinimmineyyāmā’’ti. Atha kho taṇhā ca arati ca ragā ca māradhītaro ekasataṃ ekasataṃ kumārivaṇṇasataṃ abhinimminitvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ etadavocuṃ – ‘‘pāde te, samaṇa, paricāremā’’ti. Tampi bhagavā na manasākāsi, yathā taṃ anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca arati ca ragā ca māradhītaro ekamantaṃ apakkamma evaṃ samacintesuṃ – ‘‘uccāvacā kho purisānaṃ adhippāyā. Yaṃnūna mayaṃ ekasataṃ ekasataṃ avijātavaṇṇasataṃ abhinimmineyyāmā’’ti. Atha kho taṇhā ca arati ca ragā ca māradhītaro ekasataṃ ekasataṃ avijātavaṇṇasataṃ abhinimminitvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ etadavocuṃ – ‘‘pāde te, samaṇa, paricāremā’’ti. Tampi bhagavā na manasākāsi, yathā taṃ anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca…pe… yaṃnūna mayaṃ ekasataṃ ekasataṃ sakiṃ vijātavaṇṇasataṃ abhinimmineyyāmāti. Atha kho taṇhā ca…pe… sakiṃ vijātavaṇṇasataṃ abhinimminitvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ etadavocuṃ – ‘‘pāde te, samaṇa, paricāremā’’ti. Tampi bhagavā na manasākāsi, yathā taṃ anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca…pe… yaṃnūna mayaṃ ekasataṃ ekasataṃ duvijātavaṇṇasataṃ abhinimmineyyāmāti. Atha kho taṇhā ca…pe… duvijātavaṇṇasataṃ abhinimminitvā yena bhagavā… pe… yathā taṃ anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca…pe… majjhimitthivaṇṇasataṃ abhinimmineyyāmāti. Atha kho taṇhā ca…pe… majjhimitthivaṇṇasataṃ abhinimminitvā…pe… anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca…pe… mahitthivaṇṇasataṃ abhinimmineyyāmāti. Atha kho taṇhā ca…pe… mahitthivaṇṇasataṃ abhinimminitvā yena bhagavā…pe… anuttare upadhisaṅkhaye vimutto. Atha kho taṇhā ca arati ca ragā ca māradhītaro ekamantaṃ apakkamma etadavocuṃ – saccaṃ kira no pitā avoca – ‘‘Arahaṃ sugato loke, na rāgena suvānayo; Māradheyyaṃ atikkanto, tasmā socāmahaṃ bhusa’’nti. ‘‘Yañhi mayaṃ samaṇaṃ vā brāhmaṇaṃ vā avītarāgaṃ iminā upakkamena upakkameyyāma hadayaṃ vāssa phaleyya, uṇhaṃ lohitaṃ vā mukhato uggaccheyya, ummādaṃ vā pāpuṇeyya cittakkhepaṃ vā. Seyyathā vā pana naḷo harito luto ussussati visussati milāyati; evameva ussusseyya visusseyya milāyeyyā’’ti. Atha kho taṇhā ca arati ca ragā ca māradhītaro yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho taṇhā māradhītā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Sokāvatiṇṇo nu vanamhi jhāyasi, Vittaṃ nu jīno uda patthayāno; Āguṃ nu gāmasmimakāsi kiñci, Kasmā janena na karosi sakkhiṃ; Sakkhī na sampajjati kenaci te’’ti. ‘‘Atthassa pattiṃ hadayassa santiṃ, Jetvāna senaṃ piyasātarūpaṃ; Ekohaṃ [ekāhaṃ (syā. kaṃ. pī. ka.)] jhāyaṃ sukhamanubodhiṃ, Tasmā janena na karomi sakkhiṃ; Sakkhī na sampajjati kenaci me’’ti. Atha kho arati [arati ca (ka.)] māradhītā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kathaṃ vihārībahulodha bhikkhu, Pañcoghatiṇṇo atarīdha chaṭṭhaṃ; Kathaṃ jhāyiṃ [kathaṃ jhāyaṃ (syā. kaṃ. pī.), kathajjhāyaṃ (ka.)] bahulaṃ kāmasaññā, Paribāhirā honti aladdha yo ta’’nti. ‘‘Passaddhakāyo suvimuttacitto, Asaṅkharāno satimā anoko; Aññāya dhammaṃ avitakkajhāyī, Na kuppati na sarati na thino [na kuppatī nassaratī na thīno (sī.)]. ‘‘Evaṃvihārībahulodha bhikkhu, Pañcoghatiṇṇo atarīdha chaṭṭhaṃ; Evaṃ jhāyiṃ bahulaṃ kāmasaññā, Paribāhirā honti aladdha yo ta’’nti. Atha kho ragā [ragāca (ka.)] māradhītā bhagavato santike gāthāya ajjhabhāsi – ‘‘Acchejja taṇhaṃ gaṇasaṅghacārī, Addhā carissanti [tarissanti (sī.)] bahū ca saddhā; Bahuṃ vatāyaṃ janataṃ anoko, Acchejja nessati maccurājassa pāra’’nti. ‘‘Nayanti ve mahāvīrā, saddhammena tathāgatā; Dhammena nayamānānaṃ, kā usūyā vijānata’’nti. Atha kho taṇhā ca arati ca ragā ca māradhītaro yena māro pāpimā tenupasaṅkamiṃsu. Addasā kho māro pāpimā taṇhañca aratiñca ragañca māradhītaro dūratova āgacchantiyo. Disvāna gāthāhi ajjhabhāsi – ‘‘Bālā kumudanāḷehi, pabbataṃ abhimatthatha [abhimanthatha (sī.)]; Giriṃ nakhena khanatha, ayo dantehi khādatha. ‘‘Selaṃva sirasūhacca [sirasi ūhacca (sī.), sirasi ohacca (syā. kaṃ.)], pātāle gādhamesatha; Khāṇuṃva urasāsajja, nibbijjāpetha gotamā’’ti. ‘‘Daddallamānā āgañchuṃ, taṇhā ca aratī ragā; Tā tattha panudī satthā, tūlaṃ bhaṭṭhaṃva māluto’’ti. Tatiyo vaggo. Tassuddānaṃ – Sambahulā samiddhi ca, godhikaṃ sattavassāni; Dhītaraṃ desitaṃ buddha, seṭṭhena imaṃ mārapañcakanti. ",
      "english": "Then Mara, the Evil One, after reciting those verses of dejection in the presence of the Blessed One, departed from that spot and sat down near the Blessed One, cross-legged on the ground, silent, dejected, with shoulders drooping, face downcast, lost in thought, bereft of inspiration, scratching the earth with a stick.\n\nThen Craving, Aversion, and Lust—Mara’s daughters—approached Mara, the Evil One; having approached, they addressed Mara, the Evil One, with a verse: “Why are you so despondent, dear father? What man do you grieve for? We shall bind him with the snare of lust, like a wild elephant, and bring him; he will be subject to your will.”\n\n“He is an Arahant, a Well-gone One in the world, not easily led by lust; he has transcended Mara’s dominion. Therefore, I grieve intensely.”\n\nThen Craving, Aversion, and Lust—Mara’s daughters—approached the Blessed One; having approached, they said to the Blessed One: “Ascetic, we will attend to your feet.” But the Blessed One paid no attention, for he was utterly liberated through the complete destruction of all attachments.\n\nThen Craving, Aversion, and Lust—Mara’s daughters—withdrew to one side and considered thus: “Truly, men’s desires are varied. What if we were to manifest a hundred forms, each a hundredfold, as young maidens?” Then Craving, Aversion, and Lust—Mara’s daughters—having manifested a hundred different forms, each a hundredfold, as young maidens, approached the Blessed One; having approached, they said to the Blessed One: “Ascetic, we will attend to your feet.” But the Blessed One paid no attention even to that, for he was utterly liberated through the complete destruction of all attachments.\n\nThen Craving, Aversion, and Lust—Mara’s daughters—withdrew to one side and considered thus: “Truly, men’s desires are varied. What if we were to manifest a hundred forms, each a hundredfold, as women who have never given birth?” Then Craving, Aversion, and Lust—Mara’s daughters—having manifested a hundred different forms, each a hundredfold, as women who have never given birth, approached the Blessed One; having approached, they said to the Blessed One: “Ascetic, we will attend to your feet.” But the Blessed One paid no attention even to that, for he was utterly liberated through the complete destruction of all attachments.\n\nThen Craving, Aversion, and Lust—Mara’s daughters—withdrew to one side and considered thus: “Truly, men’s desires are varied. What if we were to manifest a hundred forms, each a hundredfold, as women who have given birth once?” Then Craving, Aversion, and Lust—Mara’s daughters—having manifested a hundred different forms, each a hundredfold, as women who have given birth once, approached the Blessed One; having approached, they said to the Blessed One: “Ascetic, we will attend to your feet.” But the Blessed One paid no attention even to that, for he was utterly liberated through the complete destruction of all attachments.\n\nThen Craving, Aversion, and Lust—Mara’s daughters—withdrew to one side and considered thus: “Truly, men’s desires are varied. What if we were to manifest a hundred forms, each a hundredfold, as women who have given birth twice?” Then Craving, Aversion, and Lust—Mara’s daughters—having manifested a hundred different forms, each a hundredfold, as women who have given birth twice, approached the Blessed One; having approached, they said to the Blessed One: “Ascetic, we will attend to your feet.” But the Blessed One paid no attention even to that, for he was utterly liberated through the complete destruction of all attachments.\n\nThen Craving, Aversion, and Lust—Mara’s daughters—withdrew to one side and considered thus: “Truly, men’s desires are varied. What if we were to manifest a hundred forms, each a hundredfold, as middle-aged women?” Then Craving, Aversion, and Lust—Mara’s daughters—having manifested a hundred different forms, each a hundredfold, as middle-aged women, approached the Blessed One; having approached, they said to the Blessed One: “Ascetic, we will attend to your feet.” But the Blessed One paid no attention even to that, for he was utterly liberated through the complete destruction of all attachments.\n\nThen Craving, Aversion, and Lust—Mara’s daughters—withdrew to one side and considered thus: “Truly, men’s desires are varied. What if we were to manifest a hundred forms, each a hundredfold, as elderly women?” Then Craving, Aversion, and Lust—Mara’s daughters—having manifested a hundred different forms, each a hundredfold, as elderly women, approached the Blessed One; having approached, they said to the Blessed One: “Ascetic, we will attend to your feet.” But the Blessed One paid no attention even to that, for he was utterly liberated through the complete destruction of all attachments.\n\nThen Craving, Aversion, and Lust—Mara’s daughters—withdrew to one side and said: “Indeed, our father spoke the truth when he said: ‘He is an Arahant, a Well-gone One in the world, not easily led by lust; he has transcended Mara’s dominion. Therefore, I grieve intensely.’ For if we were to try this stratagem on any ascetic or brahman who was not free from lust, either his heart would burst, or hot blood would gush from his mouth, or he would fall into madness, or become utterly deranged. Just as a freshly cut green reed withers, dries up, and decays; even so would he wither, dry up, and decay.”\n\nThen Craving, Aversion, and Lust—Mara’s daughters—approached the Blessed One; having approached, they stood to one side. Standing to one side, Craving, Mara’s daughter, addressed the Blessed One with a verse: “Are you sunk in sorrow, meditating in the forest? Or have you lost wealth, or are you seeking it? Have you committed any offense in the village? Why do you not associate with people? No companionship is found with you.”\n\n“Having attained the goal, the peace of heart, having conquered the army whose form is agreeable and pleasing, I meditate alone and have awakened to happiness. Therefore, I do not associate with people; no companionship is found with me.”\n\nThen Aversion, Mara’s daughter, addressed the Blessed One with a verse: “How does the monk often dwell here, having crossed the five floods and transcended the sixth? How does he, frequently absorbed in meditation, ensure that perceptions of sensual pleasure remain external, not having obtained him?”\n\nWith a tranquil body and a perfectly liberated mind, unconditioned, mindful, and without a fixed abode, having fully understood the Dhamma, one meditates without discursive thought, remaining unagitated, unattached, and free from sluggishness.\n\nA monk who frequently dwells in such a state here has crossed the five floods and has crossed the sixth. For one who meditates frequently in this manner, perceptions of sensuality remain external, finding no entry point to him.\n\nThen Ragā, a daughter of Māra, spoke this verse in the presence of the Blessed One: \"Having completely cut off craving, he walks among groups, and surely many faithful ones will cross over. Alas, this homeless one will, having completely cut off craving, lead many people to the far shore beyond the King of Death.\"\n\n\"Indeed, great heroes lead, and the Tathāgatas lead with the True Dhamma. For those who lead with the Dhamma, what envy can there be for those who understand?\"\n\nThen Taṇhā, Arati, and Ragā, Māra’s daughters, approached Māra the Evil One. Māra the Evil One saw Taṇhā, Arati, and Ragā, his daughters, coming from afar. Having seen them, he addressed them with verses: \"O fools, you try to churn a mountain with lotus stalks, to dig a mountain with your fingernails, and to eat iron with your teeth.\n\n\"As if you would lift a rock with your head and seek a foothold in the abyss, as if you would butt a tree stump with your chest, you are trying to wear out Gotama.\"\n\nTaṇhā, Arati, and Ragā came blazing forth, but the Teacher dispelled them there, just as the wind scatters cotton fluff.\n\nThe third chapter. Its summary mentions: Sambahulā, Samiddhi, Godhika, Seven Years, the Daughters, the teaching by the Buddha, the Supreme One, and this five-part Māra episode.",
      "sinhala": "ඉන්පසු පව්කාර මාරයා භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ කලකිරීමට හේතු වන ගාථා කියා, ඒ තැනින් ඉවත්ව, භාග්‍යවතුන් වහන්සේට නුදුරුව පොළොව මත පලක් බැඳගෙන, නිශ්ශබ්ද වී, ලැජ්ජාවට පත්වී, කර පියවාගෙන, යටිකුරු මුහුණින්, දුකින් කල්පනා කරමින්, කතා කිරීමට ශක්තියක් නැතිව, දණ්ඩකින් පොළොව අඳිමින් වාඩි විය.\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු පව්කාර මාරයා වෙත එළඹුණහ. එළඹ, පව්කාර මාරයාට ගාථාවකින් මෙසේ කීහ: ‘‘පියාණෙනි, කුමක් නිසා ඔබ සිත් තැවුලට පත් වී ද? කවර නම් පුරුෂයෙකු ගැන ඔබ ශෝක කරන්නේ ද? අපි ඔහු රාග පාශයෙන්, වන අලියෙකු මෙන් බැඳගෙන, ඔබ වෙත ගෙන එන්නෙමු. ඔහු ඔබට වසඟ වනු ඇත.’’ (එවිට මාරයා මෙසේ පැවසීය:) ‘‘ලෝකයෙහි රහත් වූ සුගතයාණෝ රාගයෙන් පහසුවෙන් මෙහෙයවිය නොහැකිය. උන්වහන්සේ මාරයාගේ අධිපතිත්වය ඉක්මවා ගිය සේක. එහෙයින් මම මහත් සේ ශෝක කරමි.’’\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ, භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: ‘‘ශ්‍රමණයන් වහන්ස, අපි ඔබගේ පාද සේවය කරන්නෙමු.’’ එවිට භාග්‍යවතුන් වහන්සේ එය සලකා නොබැලූහ. මක්නිසාද යත් උන්වහන්සේ අනුත්තර වූ උපධි ක්ෂය වීමෙන් මිදුණු සේක.\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු එක් පසකට වී මෙසේ සිතූහ: ‘‘පුරුෂයන්ගේ අදහස් උස් පහත් (විවිධ) වේ. එසේනම් අපි සියයකින් සියයකින් (සෑම වර්ගයකින්ම සියයක් බැගින්) කුමාරිකා වෙසින් (වෙසඟනන් දෙසියයක්) නිර්මාණය කරමු.’’\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු සියයකින් සියයකින් කුමාරිකා වෙසින් (වෙසඟනන් දෙසියයක්) නිර්මාණය කර, භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ, භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: ‘‘ශ්‍රමණයන් වහන්ස, අපි ඔබගේ පාද සේවය කරන්නෙමු.’’ භාග්‍යවතුන් වහන්සේ එයද සලකා නොබැලූහ. මක්නිසාද යත් උන්වහන්සේ අනුත්තර වූ උපධි ක්ෂය වීමෙන් මිදුණු සේක.\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු එක් පසකට වී මෙසේ සිතූහ: ‘‘පුරුෂයන්ගේ අදහස් උස් පහත් (විවිධ) වේ. එසේනම් අපි සියයකින් සියයකින් අවිජාත ස්ත්‍රී වෙසින් (දරු ප්‍රසූතියක් නොකළ ස්ත්‍රීන් දෙසියයක්) නිර්මාණය කරමු.’’\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු සියයකින් සියයකින් අවිජාත ස්ත්‍රී වෙසින් (දරු ප්‍රසූතියක් නොකළ ස්ත්‍රීන් දෙසියයක්) නිර්මාණය කර, භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ, භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: ‘‘ශ්‍රමණයන් වහන්ස, අපි ඔබගේ පාද සේවය කරන්නෙමු.’’ භාග්‍යවතුන් වහන්සේ එයද සලකා නොබැලූහ. මක්නිසාද යත් උන්වහන්සේ අනුත්තර වූ උපධි ක්ෂය වීමෙන් මිදුණු සේක.\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු එක් පසකට වී මෙසේ සිතූහ: ‘‘පුරුෂයන්ගේ අදහස් උස් පහත් (විවිධ) වේ. එසේනම් අපි සියයකින් සියයකින් වරක් දරුවන් වැදූ ස්ත්‍රීන් දෙසියයක් නිර්මාණය කරමු.’’ ඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු සියයකින් සියයකින් වරක් දරුවන් වැදූ ස්ත්‍රීන් දෙසියයක් නිර්මාණය කර, භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ, භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: ‘‘ශ්‍රමණයන් වහන්ස, අපි ඔබගේ පාද සේවය කරන්නෙමු.’’ භාග්‍යවතුන් වහන්සේ එයද සලකා නොබැලූහ. මක්නිසාද යත් උන්වහන්සේ අනුත්තර වූ උපධි ක්ෂය වීමෙන් මිදුණු සේක.\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු එක් පසකට වී මෙසේ සිතූහ: ‘‘පුරුෂයන්ගේ අදහස් උස් පහත් (විවිධ) වේ. එසේනම් අපි සියයකින් සියයකින් දෙවරක් දරුවන් වැදූ ස්ත්‍රීන් දෙසියයක් නිර්මාණය කරමු.’’ ඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු සියයකින් සියයකින් දෙවරක් දරුවන් වැදූ ස්ත්‍රීන් දෙසියයක් නිර්මාණය කර, භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ, භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: ‘‘ශ්‍රමණයන් වහන්ස, අපි ඔබගේ පාද සේවය කරන්නෙමු.’’ භාග්‍යවතුන් වහන්සේ එයද සලකා නොබැලූහ. මක්නිසාද යත් උන්වහන්සේ අනුත්තර වූ උපධි ක්ෂය වීමෙන් මිදුණු සේක.\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු එක් පසකට වී මෙසේ සිතූහ: ‘‘පුරුෂයන්ගේ අදහස් උස් පහත් (විවිධ) වේ. එසේනම් අපි සියයකින් සියයකින් මැදි වයසේ ස්ත්‍රීන් දෙසියයක් නිර්මාණය කරමු.’’ ඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු සියයකින් සියයකින් මැදි වයසේ ස්ත්‍රීන් දෙසියයක් නිර්මාණය කර, භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ, භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: ‘‘ශ්‍රමණයන් වහන්ස, අපි ඔබගේ පාද සේවය කරන්නෙමු.’’ භාග්‍යවතුන් වහන්සේ එයද සලකා නොබැලූහ. මක්නිසාද යත් උන්වහන්සේ අනුත්තර වූ උපධි ක්ෂය වීමෙන් මිදුණු සේක.\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු එක් පසකට වී මෙසේ සිතූහ: ‘‘පුරුෂයන්ගේ අදහස් උස් පහත් (විවිධ) වේ. එසේනම් අපි සියයකින් සියයකින් වයෝවෘද්ධ ස්ත්‍රීන් දෙසියයක් නිර්මාණය කරමු.’’ ඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු සියයකින් සියයකින් වයෝවෘද්ධ ස්ත්‍රීන් දෙසියයක් නිර්මාණය කර, භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ, භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: ‘‘ශ්‍රමණයන් වහන්ස, අපි ඔබගේ පාද සේවය කරන්නෙමු.’’ භාග්‍යවතුන් වහන්සේ එයද සලකා නොබැලූහ. මක්නිසාද යත් උන්වහන්සේ අනුත්තර වූ උපධි ක්ෂය වීමෙන් මිදුණු සේක.\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු එක් පසකට වී මෙසේ කීහ: ‘‘අපගේ පියාණන් වහන්සේ සැබැවින්ම මෙසේ පැවසූ සේක: ‘ලෝකයෙහි රහත් වූ සුගතයාණෝ රාගයෙන් පහසුවෙන් මෙහෙයවිය නොහැකිය. උන්වහන්සේ මාරයාගේ අධිපතිත්වය ඉක්මවා ගිය සේක. එහෙයින් මම මහත් සේ ශෝක කරමි.’ යම් හෙයකින් අපි රාගය දුරු නොකළ ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හෝ මේ උපක්‍රමයෙන් පෙළුවා නම්, ඔහුගේ හදවත පැළී යනු ඇත, නැතහොත් උණුසුම් වූ රුධිරය මුඛයෙන් පිට වනු ඇත, නැතහොත් උමතු බවට හෝ සිහි විකල් බවට හෝ පත් වනු ඇත. යම් සේ නම්, අමු ලෙස කපන ලද බට ගසක් වියළී, ක්ෂය වී, මැලවී යයි ද; එපරිද්දෙන්ම ඔහු වියළී, ක්ෂය වී, මැලවී යනු ඇත.’’\n\nඉන්පසු තෘෂ්ණා, අරති සහ රගා යන මාර දූවරු භාග්‍යවතුන් වහන්සේ වෙත එළඹුණහ. එළඹ, එක් පසෙක සිට ගත්හ. එක් පසෙක සිටි තෘෂ්ණා නම් මාර දියණිය භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවාය: ‘‘ශෝකයෙන් පෙළී වනයෙහි ධ්‍යාන වඩන සේක් ද? ධනය අහිමි වී ද, නැතහොත් ධනයක් පතන සේක් ද? ගමෙහි යම් වරදක් කළ සේක් ද? කුමක් හෙයින් මිනිසුන් සමග මිත්‍ර නොවන්නෙහි ද? ඔබට කිසිවෙකු සමග මිත්‍රත්වය නොපවතින්නේ ද?’’\n\n‘‘මා ප්‍රයෝජනයක් (අරමුණක්) සාක්ෂාත් කරගෙන, සිතෙහි සැනසීම ලබා, ප්‍රිය ස්වභාවයෙන් යුත් සේනාව (රාගාදී කෙලෙස්) ජයගෙන, තනිවම ධ්‍යාන වඩමින් (නිවන්) සැපය අවබෝධ කළෙමි. එහෙයින් මම මිනිසුන් සමග මිත්‍ර නොවෙමි. මට කිසිවෙකු සමග මිත්‍රත්වය නොපවතී.’’\n\nඉන්පසු අරති නම් මාර දියණිය භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවාය: ‘‘මෙලොව භික්ෂුව බොහෝ සේ වසන්නේ කෙසේද? පස් වැදෑරුම් ඕඝය තරණය කර, සය වැන්නද මෙහිදී තරණය කළේ කෙසේද? බොහෝ සේ ධ්‍යාන වඩන විට කාම සංඥා ඔහුට නොලැබී පිටතින්ම පවතින්නේ කෙසේද?’’\n\nප්‍රශ්‍රබ්ධ වූ කය ඇති, මැනවින් විමුක්ත වූ සිත් ඇති, කිසිදු සංස්කාරයක් නොකරන, සිහියෙන් යුක්ත වූ, නිවහනක් නැති, ධර්මය අවබෝධ කරගෙන විතර්ක රහිතව ධ්‍යාන වඩන තැනැත්තා කිලිටි නොවේ, (පසුගිය දෙයට) නොඇලේ, අලස නොවේ. මේ අයුරින් බහුල වශයෙන් වාසය කරන භික්ෂුව පස් වැදෑරුම් ඕඝයන්ද, සයවෙනි ඕඝයද එතෙර කළේය. මේ අයුරින් බහුල වශයෙන් ධ්‍යාන වඩන කල්හි, කාම සංඥාවෝ ඔහු අල්ලා ගැනීමට නොහැකිව බාහිරව පවතින්නාහ.\n\nඑවිට රාගා නම් මාර දුව භාග්‍යවතුන් වහන්සේ ඉදිරියේ ගාථාවකින් මෙසේ පැවසුවාය:\n\"තෘෂ්ණාව සිඳ දමා, ගණසංඝයා අතරෙහි හැසිරෙන මොහු නිසා නියත වශයෙන්ම බොහෝ ශ්‍රද්ධාවන්තයෝ (සසරින්) එතෙර වන්නාහුය. අහෝ! නිවහනක් නැති මොහු බොහෝ ජනයා තෘෂ්ණාව සිඳ දමා මර රජුගේ (සියලු බන්ධනයෙන්) එතෙර කරනු ඇත.\"\n\n\"තථාගතයන් වහන්සේලා නම් වූ මහාවීරයෝ සද්ධර්මය මගින් (සත්වයන්) මෙහෙයවති. ධර්මයෙන් මෙහෙයවන්නවුන් කෙරෙහි, (ධර්මය) දන්නා අයට කවර ඊර්ෂ්‍යාවක්ද?\"\n\nඑවිට තණ්හා, අරති, රාගා යන මාර දූවරු තිදෙන පාපී වූ මාරයා සිටින තැනට පැමිණියහ. පාපී වූ මාරයා, තණ්හා, අරති, රාගා යන තම දූවරුන් දුරදීම එනු දුටුවේය. ඔවුන් දැක ගාථාවලින් මෙසේ පැවසීය:\n\"බාලයෙනි, ඔබලා නෙළුම් දඬු වලින් පර්වතයක් කැලතීමට යත්න දරති. නියපොතුවලින් පර්වතයක් කණිති. දත්වලින් යකඩ කති. හිසින් පර්වතයක් ඔසවාගෙන මෙන් පාතාලයේ අඩියක් තබන්නට උත්සාහ කරති. පපුවෙන් කඳක් තල්ලු කරන්නාක් මෙන් ඔබලා ගෞතමයන් වහන්සේව වෙහෙසන්නට යත්න දරති.\"\n\nතණ්හා, අරති, රාගා යන (මාර දූවරු) දිලිසෙමින් පැමිණියහ. සුළඟින් ගසාගෙන යන කපු පුළුන් මෙන්, ශාස්තෘන් වහන්සේ ඔවුන් එහිදී දුරු කළ සේක.\n\nතෙවැනි වර්ගයයි. එහි උද්දානය නම්: සම්බහුලා, සමිද්ධි, ගෝධික, සත් වසර, දූවරු, උතුම් බුදුන් වහන්සේ විසින් දේශනා කරන ලද මේ මාර පංචකයයි.",
      "paliTitle": "Māradhītusuttaṃ"
    }
  ],
  "footer": {
    "pali": "Mārasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}