{
  "id": "sn.1.3",
  "title": {
    "pali": "Kosalasaṃyuttaṃ",
    "english": "The Connected Discourses with Kosala",
    "sinhala": "කෝසල සංයුත්තය"
  },
  "sections": [
    {
      "number": 112,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho rājā pasenadi kosalo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘bhavampi no gotamo anuttaraṃ sammāsambodhiṃ abhisambuddhoti paṭijānātī’’ti? ‘‘Yañhi taṃ, mahārāja, sammā vadamāno vadeyya ‘anuttaraṃ sammāsambodhiṃ abhisambuddho’ti, mameva [mamaṃ (sabbattha)] taṃ sammā vadamāno vadeyya. Ahañhi, mahārāja, anuttaraṃ sammāsambodhiṃ abhisambuddho’’ti. ‘‘Yepi te, bho gotama, samaṇabrāhmaṇā saṅghino gaṇino gaṇācariyā ñātā yasassino titthakarā sādhusammatā bahujanassa, seyyathidaṃ – pūraṇo kassapo, makkhali gosālo, nigaṇṭho nāṭaputto, sañcayo belaṭṭhaputto, pakudho kaccāyano, ajito kesakambalo; tepi mayā ‘anuttaraṃ sammāsambodhiṃ abhisambuddhoti paṭijānāthā’ti puṭṭhā samānā anuttaraṃ sammāsambodhiṃ abhisambuddhoti na paṭijānanti. Kiṃ pana bhavaṃ gotamo daharo ceva jātiyā navo ca pabbajjāyā’’ti? ‘‘Cattāro kho me, mahārāja, daharāti na uññātabbā, daharāti na paribhotabbā. Katame cattāro? Khattiyo kho, mahārāja, daharoti na uññātabbo, daharoti na paribhotabbo. Urago kho, mahārāja, daharoti na uññātabbo, daharoti na paribhotabbo. Aggi kho, mahārāja, daharoti na uññātabbo, daharoti na paribhotabbo. Bhikkhu, kho, mahārāja, daharoti na uññātabbo, daharoti na paribhotabbo. Ime kho, mahārāja, cattāro daharāti na uññātabbā, daharāti na paribhotabbā’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Khattiyaṃ jātisampannaṃ, abhijātaṃ yasassinaṃ; Daharoti nāvajāneyya, na naṃ paribhave naro. ‘‘Ṭhānañhi so manujindo, rajjaṃ laddhāna khattiyo; So kuddho rājadaṇḍena, tasmiṃ pakkamate bhusaṃ; Tasmā taṃ parivajjeyya, rakkhaṃ jīvitamattano. ‘‘Gāme vā yadi vā raññe, yattha passe bhujaṅgamaṃ; Daharoti nāvajāneyya, na naṃ paribhave naro. ‘‘Uccāvacehi vaṇṇehi, urago carati tejasī [tejasā (sī. ka.), tejasi (pī. ka.)]; So āsajja ḍaṃse bālaṃ, naraṃ nāriñca ekadā; Tasmā taṃ parivajjeyya, rakkhaṃ jīvitamattano. ‘‘Pahūtabhakkhaṃ jālinaṃ, pāvakaṃ kaṇhavattaniṃ; Daharoti nāvajāneyya, na naṃ paribhave naro. ‘‘Laddhā hi so upādānaṃ, mahā hutvāna pāvako; So āsajja ḍahe [dahe] bālaṃ, naraṃ nāriñca ekadā; Tasmā taṃ parivajjeyya, rakkhaṃ jīvitamattano. ‘‘Vanaṃ yadaggi ḍahati [dahati (ka.)], pāvako kaṇhavattanī; Jāyanti tattha pārohā, ahorattānamaccaye. ‘‘Yañca kho sīlasampanno, bhikkhu ḍahati tejasā; Na tassa puttā pasavo, dāyādā vindare dhanaṃ; Anapaccā adāyādā, tālāvatthū bhavanti te. ‘‘Tasmā hi paṇḍito poso, sampassaṃ atthamattano; Bhujaṅgamaṃ pāvakañca, khattiyañca yasassinaṃ; Bhikkhuñca sīlasampannaṃ, sammadeva samācare’’ti. Evaṃ vutte, rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante, abhikkantaṃ, bhante! Seyyathāpi bhante, nikkujjitaṃ [nikujjitaṃ (?)] vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Thus have I heard – at one time the Blessed One was staying near Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. Then King Pasenadi of Kosala approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging cordial and memorable greetings, he sat down to one side. Seated to one side, King Pasenadi of Kosala said to the Blessed One, \"Does Venerable Gotama also claim to have realized the perfect and supreme enlightenment?\"\n\n\"If, great king, one were to speak correctly and say, 'He has realized the perfect and supreme enlightenment,' then it is I whom one would be speaking of correctly. For I, great king, have realized the perfect and supreme enlightenment.\"\n\n\"Yet, Venerable Gotama, those other ascetics and brahmins who are leaders of communities, founders of sects, renowned and famous teachers, considered holy by many people—namely, Pūraṇa Kassapa, Makkhali Gosāla, Nigaṇṭha Nāṭaputta, Sañjaya Belaṭṭhaputta, Pakudha Kaccāyana, and Ajita Kesakambala—even they, when questioned by me whether they claim to have realized the perfect and supreme enlightenment, do not make such a claim. Why, Venerable Gotama, are you so young in age and new to the ascetic life?\"\n\n\"There are, great king, four things that should not be scorned as young or small, and should not be treated with contempt as young or small. Which four? A warrior, great king, though young or small, should not be scorned, should not be treated with contempt. A serpent, great king, though young or small, should not be scorned, should not be treated with contempt. Fire, great king, though young or small, should not be scorned, should not be treated with contempt. A monk, great king, though young or small, should not be scorned, should not be treated with contempt. These four, great king, though young or small, should not be scorned, should not be treated with contempt.\"\n\nThe Blessed One said this. Having said this, the Fortunate One, the Teacher, further spoke as follows:\n\nA person should not underestimate or treat with contempt a warrior, though young, who is nobly born, of high lineage, and renowned.\nFor that warrior, the lord of men, having obtained his position and kingship, being enraged, will inflict severe royal punishment upon him. Therefore, one should avoid him, protecting one's own life.\n\nWhether in a village or in the wilderness, wherever one sees a serpent, one should not underestimate or treat with contempt, though it may be young.\nThe serpent moves about with varied colors, possessing power. Having provoked it, it will bite the foolish person, man or woman, at once. Therefore, one should avoid it, protecting one's own life.\n\nOne should not underestimate or treat with contempt fire, though it may be small, with abundant fuel, blazing, and having a dark path.\nFor that fire, having obtained fuel, becoming great, will, having provoked it, burn the foolish person, man or woman, at once. Therefore, one should avoid it, protecting one's own life.\n\nWhen fire, with its dark path, burns a forest, new sprouts emerge there after the passage of days and nights.\nBut when a monk, endowed with virtue, burns defilements with his spiritual power, neither sons nor cattle, nor heirs find wealth from him. They become heirless, like a palm tree stump.\n\nTherefore, an intelligent person, seeing his own welfare, should deal properly with a serpent, fire, a renowned warrior, and a monk endowed with virtue.\n\nWhen this was said, King Pasenadi of Kosala said to the Blessed One, \"Excellent, Venerable Sir! Excellent, Venerable Sir! Just as, Venerable Sir, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms, even so has the Dhamma been made clear by the Blessed One in many ways. I, Venerable Sir, go for refuge to the Blessed One, to the Dhamma, and to the community of monks. May the Blessed One remember me as a lay follower who has gone for refuge from this day forth, as long as life lasts.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඑවිට කෝසල රජු වූ පසේනදී රජු භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථා බස් හුවමාරු කර ගෙන එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි කෝසල රජු වූ පසේනදී රජු භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ගෞතමයන් වහන්සේද අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ බවට ප්‍රතිඥා දෙන සේක්ද?” “මහරජ, යමෙක් ‘අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළේය’ යි නිවැරදිව කියන්නේ නම්, ඔහු නිවැරදිව මා ගැනම කියන්නේය. මහරජ, මම අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළේමි.” “භවත් ගෞතමයන් වහන්සේට වඩා වයසින් වැඩි, ගණනායක වූ, ගණාචාර්ය වූ, බොහෝ දෙනා අතර ප්‍රකට, කීර්තිමත්, තීර්ථකයන් වූ, බොහෝ දෙනා විසින් යහපත් යැයි සම්මත වූ, එනම් පූරණ කස්සප, මක්ඛලී ගෝසාල, නිගණ්ඨ නාටපුත්ත, සංජය බේලට්ඨපුත්ත, පකුධ කච්චායන, අජිත කේසකම්බල යන ශ්‍රමණ බ්‍රාහ්මණයෝද, මා විසින් ‘අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ බවට ප්‍රතිඥා දෙන්න’ යැයි විමසන ලදුව, අනුත්තර වූ සම්මා සම්බෝධිය අවබෝධ කළ බවට ප්‍රතිඥා නොදෙති. එසේ නම්, භවත් ගෞතමයන් වහන්සේ උපතින්ද තරුණ, පැවිද්දෙන්ද නවක වී සිටියදී කෙසේද එවැනි ප්‍රතිඥාවක් දෙන්නේ?” “මහරජ, මේ සතර දෙනා තරුණ යැයි අවමන් නොකළ යුතුයි, තරුණ යැයි හෙළා නොදැකිය යුතුයි. කවර සතර දෙනෙක්ද? මහරජ, තරුණ ක්ෂත්‍රියයාට අවමන් නොකළ යුතුයි, හෙළා නොදැකිය යුතුයි. මහරජ, තරුණ නාගයාට (සර්පයාට) අවමන් නොකළ යුතුයි, හෙළා නොදැකිය යුතුයි. මහරජ, තරුණ ගින්නට අවමන් නොකළ යුතුයි, හෙළා නොදැකිය යුතුයි. මහරජ, තරුණ භික්ෂුවට අවමන් නොකළ යුතුයි, හෙළා නොදැකිය යුතුයි. මහරජ, මේ සතර දෙනා තරුණ යැයි අවමන් නොකළ යුතුයි, තරුණ යැයි හෙළා නොදැකිය යුතුයි.”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාළ පසු නැවතත් මෙසේ වදාළ සේක:\n“උසස් ජාතියකින් පැවත එන, කීර්තිමත්, තරුණ ක්ෂත්‍රියයාට යමෙක් අවමන් නොකළ යුතුය, ඔහුව හෙළා නොදැකිය යුතුය. මන්ද යත්, ඒ මනුෂ්‍ය නායකයා වූ ක්ෂත්‍රියයා රජකම ලැබීමෙන්, උදහස් වූ විට රජ දඬුවමින් තදින් ක්‍රියා කරයි. එබැවින් තමාගේ ජීවිතය රක්නා පිණිස ඔහුව දුරලිය (පරෙස්සම් විය) යුතුය.\nගමෙහි හෝ රජරටෙහි හෝ යම් තැනක තරුණ සර්පයෙකු දුටුවත්, යමෙක් ඔහුට අවමන් නොකළ යුතුය, හෙළා නොදැකිය යුතුය. එම තේජස් ඇති සර්පයා විවිධ වර්ණවලින් හැසිරෙයි. ඔහු තරුණ වුවත් එකවරම අනුවණ පුද්ගලයෙකුට, පුරුෂයෙකුට හෝ ස්ත්‍රියකට දෂ්ට කරන්නේය. එබැවින් තමාගේ ජීවිතය රක්නා පිණිස ඔහුව දුරලිය (පරෙස්සම් විය) යුතුය.\nබොහෝ දෑ භක්ෂණය කරන, දැල් සහිත, කළු මාවත් ඇති ගින්නට යමෙක් තරුණ යැයි අවමන් නොකළ යුතුය, හෙළා නොදැකිය යුතුය. මන්ද යත්, ඔහුට දැවිල්ල (උපාදාන) ලැබීමෙන් ඒ ගින්න මහත් වී, තරුණ වුවත් එකවරම අනුවණ පුද්ගලයෙකු, පුරුෂයෙකු හෝ ස්ත්‍රියක දවාලන්නේය. එබැවින් තමාගේ ජීවිතය රක්නා පිණිස ඔහුව දුරලිය (පරෙස්සම් විය) යුතුය.\nඒ කළු මාවත් ඇති ගින්න වනයක් දවාලන විට, දවල් රාත්‍රී ඉක්මවූ පසු එහි නැවතත් අංකුර හටගනී.\nනමුත් සිල්වත් භික්ෂුවක් තේජසින් (ක්ලේශ) දවාලන විට, ඔහුට පුත්‍රයෝ හෝ පශු සම්පත් හෝ ධනයට හිමි දායාදකරුවෝ හෝ නොලැබෙත්. ඔවුහු තල් ගසක් මුලින් උදුරා දැමුවා සේ නිර්වංශීව, දායාද රහිතව නැවත ඇති නොවන්නාහ.\nඑබැවින් පණ්ඩිත වූ පුරුෂයා තමාගේ අර්ථය මැනවින් දකිමින්, සර්පයාටත්, ගින්නටත්, කීර්තිමත් ක්ෂත්‍රියයාටත්, සිල්වත් භික්ෂුවටත් මැනවින් ගරු කළ යුතුය.”\n\nමෙසේ වදාළ කල්හි කෝසල රජු වූ පසේනදී රජු භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “අතිශය යහපත්ය, ස්වාමීනි! අතිශය යහපත්ය, ස්වාමීනි! ස්වාමීනි, යම් සේ පෙරළා තිබූ දෙයක් කෙළින් කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මඟ මුළා වූවෙකුට මඟ පියා පෙන්වන්නේද, අඳුරෙහි ඇස් ඇති අයට රූප දැක්මට තෙල් පහනක් දල්වා තබන්නේද; එසේම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කරන ලදී. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. ස්වාමීනි, අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!”",
      "paliTitle": "Daharasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 113,
      "pali": "Sāvatthinidānaṃ. Atha kho rājā pasenadi kosalo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, purisassa dhammā ajjhattaṃ uppajjamānā uppajjanti ahitāya dukkhāya aphāsuvihārāyā’’ti? ‘‘Tayo kho, mahārāja, purisassa dhammā ajjhattaṃ uppajjamānā uppajjanti ahitāya dukkhāya aphāsuvihārāya. Katame tayo? Lobho kho, mahārāja, purisassa dhammo ajjhattaṃ uppajjamāno uppajjati ahitāya dukkhāya aphāsuvihārāya. Doso kho, mahārāja, purisassa dhammo ajjhattaṃ uppajjamāno uppajjati ahitāya dukkhāya aphāsuvihārāya. Moho kho, mahārāja, purisassa dhammo ajjhattaṃ uppajjamāno uppajjati ahitāya dukkhāya aphāsuvihārāya. Ime kho, mahārāja, tayo purisassa dhammā ajjhattaṃ uppajjamānā uppajjanti ahitāya dukkhāya aphāsuvihārāyā’’ti. Idamavoca…pe… ‘‘Lobho doso ca moho ca, purisaṃ pāpacetasaṃ; Hiṃsanti attasambhūtā, tacasāraṃva samphala’’nti [sapphalanti (syā. kaṃ.)].",
      "english": "At Sāvatthī.\n\nThen King Pasenadi of Kosala approached the Blessed One. Having approached and saluted the Blessed One, he sat down to one side. As he sat to one side, King Pasenadi of Kosala said to the Blessed One: \"Venerable Sir, how many qualities arise internally in a person that lead to disadvantage, suffering, and an uncomfortable existence?\" \"Great King, three qualities arise internally in a person that lead to disadvantage, suffering, and an uncomfortable existence. Which three? Great King, greed is a quality that arises internally in a person, leading to disadvantage, suffering, and an uncomfortable existence. Hatred is a quality that arises internally in a person, leading to disadvantage, suffering, and an uncomfortable existence. Delusion is a quality that arises internally in a person, leading to disadvantage, suffering, and an uncomfortable existence. These, Great King, are the three qualities that arise internally in a person, leading to disadvantage, suffering, and an uncomfortable existence.\"\n\nThus spoke the Blessed One:\n\"Greed, hatred, and delusion,\nBorn from within oneself,\nHarm a person of evil mind,\nJust as a fruit-laden tree\nIs harmed by its own fruit.\"",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n\nඉක්බිති කෝසල රජු වූ පසේනදි රජතුමා භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍ය​වතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි කෝසල රජු වූ පසේනදි රජතුමා භාග්‍ය​වතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘භාග්‍ය​වතුන් වහන්ස, පුරුෂයෙකු තුළ හටගන්නා අභ්‍යන්තර ධර්ම කීයක් ඔහුට අහිත පිණිස, දුක පිණිස, අපහසු විහරණය පිණිස හටගන්නේද?’’\n\n‘‘මහ රජ, පුරුෂයෙකු තුළ හටගන්නා අභ්‍යන්තර ධර්ම තුනක්ම ඔහුට අහිත පිණිස, දුක පිණිස, අපහසු විහරණය පිණිස හටගනී. ඒ තුන කවරේද? මහ රජ, ලෝභය නම් වූ පුරුෂයාගේ ධර්මය ඔහු තුළ හටගැනීමෙන් අහිත පිණිස, දුක පිණිස, අපහසු විහරණය පිණිස හටගනී. මහ රජ, ද්වේෂය නම් වූ පුරුෂයාගේ ධර්මය ඔහු තුළ හටගැනීමෙන් අහිත පිණිස, දුක පිණිස, අපහසු විහරණය පිණිස හටගනී. මහ රජ, මෝහය නම් වූ පුරුෂයාගේ ධර්මය ඔහු තුළ හටගැනීමෙන් අහිත පිණිස, දුක පිණිස, අපහසු විහරණය පිණිස හටගනී. මහ රජ, මේ ධර්ම තුන පුරුෂයෙකු තුළ හටගන්නා විට අහිත පිණිස, දුක පිණිස, අපහසු විහරණය පිණිසම හටගනී.’’ මේ කාරණය වදාළ සේක...\n\n‘‘ලෝභය, ද්වේෂය, මෝහය යන මේ ධර්ම තමාගෙන්ම හටගෙන, පාප සිත් ඇති පුරුෂයාව, තමාගේම පොත්තෙහි සාරය වනසන ඵල දරන ගසක් මෙන්, පෙළති.’’",
      "paliTitle": "Purisasuttaṃ"
    },
    {
      "number": 114,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘atthi nu kho, bhante, jātassa aññatra jarāmaraṇā’’ti? ‘‘Natthi kho, mahārāja, jātassa aññatra jarāmaraṇā. Yepi te, mahārāja, khattiyamahāsālā aḍḍhā mahaddhanā mahābhogā pahūtajātarūparajatā pahūtavittūpakaraṇā pahūtadhanadhaññā, tesampi jātānaṃ natthi aññatra jarāmaraṇā. Yepi te, mahārāja, brāhmaṇamahāsālā…pe… gahapatimahāsālā aḍḍhā mahaddhanā mahābhogā pahūtajātarūparajatā pahūtavittūpakaraṇā pahūtadhanadhaññā, tesampi jātānaṃ natthi aññatra jarāmaraṇā. Yepi te, mahārāja, bhikkhū arahanto khīṇāsavā vusitavanto katakaraṇīyā ohitabhārā anuppattasadatthā parikkhīṇabhavasaṃyojanā sammadaññāvimuttā, tesaṃ pāyaṃ kāyo bhedanadhammo nikkhepanadhammo’’ti. Idamavoca…pe… ‘‘Jīranti ve rājarathā sucittā, Atho sarīrampi jaraṃ upeti; Satañca dhammo na jaraṃ upeti, Santo have sabbhi pavedayantī’’ti.",
      "english": "At Sāvatthī.\nKing Pasenadi of Kosala, seated to one side, said this to the Blessed One: \"Is there, venerable sir, for one who is born, anything apart from aging and death?\"\n\n\"There is not, great king, for what is born, anything apart from aging and death. Even those great noble warriors, great king, who are rich, with great wealth and great possessions, abundant with gold and silver, abundant with goods and resources, abundant with wealth and grain—even for them, being born, there is no escape from aging and death. Even those great brahmins, great king... even those great householders who are rich, with great wealth and great possessions, abundant with gold and silver, abundant with goods and resources, abundant with wealth and grain—even for them, being born, there is no escape from aging and death.\"\n\n\"Even those monks, great king, who are Arahants—whose defilements are destroyed, who have lived the holy life, done what had to be done, laid down the burden, attained their own true goal, utterly ended the fetters of existence, and are completely liberated through perfect knowledge—even for them, this body is subject to breaking up and to being discarded.\"\n\nThe Blessed One spoke this, and further said:\n\nIndeed, brightly painted royal chariots wear out,\nSo too the body surely approaches old age;\nBut the Dhamma of the good does not age,\nFor the good reveal it to the good.",
      "sinhala": "සැවැත්නුවරදී.\n\nඑකත්පසෙක වැඩහුන් කොසොල් මහ රජතුමා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනී, ඉපදුණ කෙනෙකුට ජරාවෙන් හා මරණයෙන් තොරවීමක් ඇත්තේද?”\n\n“මහරජ, ඉපදුණ කෙනෙකුට ජරාවෙන් හා මරණයෙන් තොරවීමක් නැත්තේය. මහරජ, යම් ඒ ක්ෂත්‍රිය මහාසාලයෝ ධනවත් වෙද්ද, මහත් ධනයෙන් යුක්ත වෙද්ද, මහත් භෝග සම්පත් ඇත්තෝ වෙද්ද, බොහෝ රන් රිදී ඇත්තෝ වෙද්ද, බොහෝ වස්තු උපකරණ ඇත්තෝ වෙද්ද, බොහෝ ධන ධාන්‍ය ඇත්තෝ වෙද්ද, ඔවුන්ද ඉපදුණ නිසා ජරාවෙන් හා මරණයෙන් තොරවීමක් නැත්තේය.”\n\n“මහරජ, යම් ඒ බ්‍රාහ්මණ මහාසාලයෝ... යම් ඒ ගෘහපති මහාසාලයෝ ධනවත් වෙද්ද, මහත් ධනයෙන් යුක්ත වෙද්ද, මහත් භෝග සම්පත් ඇත්තෝ වෙද්ද, බොහෝ රන් රිදී ඇත්තෝ වෙද්ද, බොහෝ වස්තු උපකරණ ඇත්තෝ වෙද්ද, බොහෝ ධන ධාන්‍ය ඇත්තෝ වෙද්ද, ඔවුන්ද ඉපදුණ නිසා ජරාවෙන් හා මරණයෙන් තොරවීමක් නැත්තේය.”\n\n“මහරජ, යම් ඒ භික්ෂූහු අරහත් වෙද්ද, කෙලෙස් නැති කරගත්, බඹසර සම්පූර්ණ කළ, කළ යුතු දේ කළ, බර පහකළ, තමන්ගේ උසස් අරමුණට පැමිණි, භව බන්ධන ක්ෂය කළ, නියම ප්‍රඥාවෙන් මනාකොට විමුක්ත වූවෝ වෙද්ද, ඔවුන්ගේ පවා මේ ශරීරය බිඳී යන ස්වභාවයෙන් යුක්තය, අත්හැර දැමිය යුතු ස්වභාවයෙන් යුක්තය.”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\n“සිත්කලු රජ රථ පවා දිරා යයි,\nඑසේම ශරීරයද දිරාපත් වේ;\nඑහෙත් සත්පුරුෂ ධර්මය දිරාපත් නොවේ,\nසත්පුරුෂයෝ සත්පුරුෂයන්ට (මේ ධර්මය) ප්‍රකාශ කරති.”",
      "paliTitle": "Jarāmaraṇasuttaṃ"
    },
    {
      "number": 115,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘kesaṃ nu kho piyo attā, kesaṃ appiyo attā’ti? Tassa mayhaṃ, bhante, etadahosi – ‘ye ca kho keci kāyena duccaritaṃ caranti, vācāya duccaritaṃ caranti, manasā duccaritaṃ caranti; tesaṃ appiyo attā’. Kiñcāpi te evaṃ vadeyyuṃ – ‘piyo no attā’ti, atha kho tesaṃ appiyo attā. Taṃ kissa hetu? Yañhi appiyo appiyassa kareyya, taṃ te attanāva attano karonti; tasmā tesaṃ appiyo attā. Ye ca kho keci kāyena sucaritaṃ caranti, vācāya sucaritaṃ caranti, manasā sucaritaṃ caranti; tesaṃ piyo attā. Kiñcāpi te evaṃ vadeyyuṃ – ‘appiyo no attā’ti; atha kho tesaṃ piyo attā. Taṃ kissa hetu? Yañhi piyo piyassa kareyya, taṃ te attanāva attano karonti; tasmā tesaṃ piyo attā’’ti. ‘‘Evametaṃ, mahārāja, evametaṃ, mahārāja! Ye hi keci, mahārāja, kāyena duccaritaṃ caranti, vācāya duccaritaṃ caranti, manasā duccaritaṃ caranti; tesaṃ appiyo attā. Kiñcāpi te evaṃ vadeyyuṃ – ‘piyo no attā’ti, atha kho tesaṃ appiyo attā. Taṃ kissa hetu? Yañhi, mahārāja, appiyo appiyassa kareyya, taṃ te attanāva attano karonti; tasmā tesaṃ appiyo attā. Ye ca kho keci, mahārāja, kāyena sucaritaṃ caranti, vācāya sucaritaṃ caranti, manasā sucaritaṃ caranti; tesaṃ piyo attā. Kiñcāpi te evaṃ vadeyyuṃ – ‘appiyo no attā’ti; atha kho tesaṃ piyo attā. Taṃ kissa hetu? Yañhi mahārāja, piyo piyassa kareyya, taṃ te attanāva attano karonti; tasmā tesaṃ piyo attā’’ti. Idamavoca…pe… ‘‘Attānañce piyaṃ jaññā, na naṃ pāpena saṃyuje; Na hi taṃ sulabhaṃ hoti, sukhaṃ dukkaṭakārinā. ‘‘Antakenādhipannassa, jahato mānusaṃ bhavaṃ; Kiñhi tassa sakaṃ hoti, kiñca ādāya gacchati; Kiñcassa anugaṃ hoti, chāyāva anapāyinī [anupāyinī (syā. kaṃ. ka.)]. ‘‘Ubho puññañca pāpañca, yaṃ macco kurute idha; Tañhi tassa sakaṃ hoti, tañca [taṃva (?)] ādāya gacchati; Tañcassa [taṃvassa (?)] anugaṃ hoti, chāyāva anapāyinī. ‘‘Tasmā kareyya kalyāṇaṃ, nicayaṃ samparāyikaṃ; Puññāni paralokasmiṃ, patiṭṭhā honti pāṇina’’ntntti.",
      "english": "In Sāvatthī.\n\nSeated to one side, King Pasenadi of Kosala said this to the Blessed One: \"Venerable sir, here, while I was secluded and withdrawn, a thought arose in my mind thus: 'For whom is the self dear, and for whom is the self not dear?'\"\n\n\"Then, Venerable sir, it occurred to me: 'Whosoever engages in misconduct by body, speech, and mind; for them, the self is not dear. Even if they should say, \"Our self is dear,\" yet for them, the self is not dear. And why is that? For whatever an enemy would do to an enemy, that they do to themselves by themselves; therefore, for them, the self is not dear.'\"\n\n\"But whosoever engages in good conduct by body, speech, and mind; for them, the self is dear. Even if they should say, \"Our self is not dear,\" yet for them, the self is dear. And why is that? For whatever a dear one would do to a dear one, that they do to themselves by themselves; therefore, for them, the self is dear.\"\n\n\"It is so, great king, it is so, great king! For whosoever, great king, engages in misconduct by body, speech, and mind; for them, the self is not dear. Even if they should say, 'Our self is dear,' yet for them, the self is not dear. And why is that? For whatever an enemy would do to an enemy, that they do to themselves by themselves; therefore, for them, the self is not dear.\"\n\n\"But whosoever, great king, engages in good conduct by body, speech, and mind; for them, the self is dear. Even if they should say, 'Our self is not dear,' yet for them, the self is dear. And why is that? For whatever a dear one would do to a dear one, that they do to themselves by themselves; therefore, for them, the self is dear.\"\n\nThe Blessed One spoke this. Having spoken thus, the Well-gone One further said:\n\n\"If one knows the self to be dear, one should not connect it with evil deeds; for happiness is not easily attained by one who does evil.\n\nWhen assailed by the Destroyer, abandoning the human state; what indeed belongs to them, and what do they take with them? And what accompanies them, like an unfailing shadow?\n\nBoth merit and demerit, whatever a mortal does here in this world; that indeed belongs to them, and that they take with them; and that accompanies them, like an unfailing shadow.\n\nTherefore, one should do what is good, accumulating it for the future life; for merits are the support for living beings in the other world.\"",
      "sinhala": "සැවැත් නුවරදී යි.\n\nඑක් පසෙක වාඩි වී සිටි කොසොල් රජු වන පසේනදී භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – ‘‘වහන්ස, මෙහිලා මම තනිව වාසය කරද්දී, පලක් ගතකොට සිටිද්දී, මගේ සිතට මෙවැනි අදහසක් පහළ විය – ‘කවුරුන්ට නම් ආත්මය ප්‍රිය වේද, කවුරුන්ට නම් ආත්මය අප්‍රිය වේද?’ වහන්ස, එවිට මට මෙසේ සිතුණි – ‘යම් කිසිවෙක් කයින් දුශ්චරිතයෙහි හැසිරෙද්ද, වචනයෙන් දුශ්චරිතයෙහි හැසිරෙද්ද, සිතින් දුශ්චරිතයෙහි හැසිරෙද්ද; ඔවුන්ට ආත්මය අප්‍රිය වේ.’ ඔවුන් ‘අපට ආත්මය ප්‍රියය’ යැයි මෙසේ පැවසුවත්, ඇත්ත වශයෙන්ම ඔවුන්ට ආත්මය අප්‍රිය වේ. එයට හේතුව කුමක්ද? යම් දෙයක් අප්‍රිය පුද්ගලයෙක්, අප්‍රිය පුද්ගලයෙකුට කරන්නේද, එයම ඔවුහු තමන් විසින් තමන්ට කරගනිති. එබැවින් ඔවුන්ට ආත්මය අප්‍රිය වේ. යම් කිසිවෙක් කයින් සුචරිතයෙහි හැසිරෙද්ද, වචනයෙන් සුචරිතයෙහි හැසිරෙද්ද, සිතින් සුචරිතයෙහි හැසිරෙද්ද; ඔවුන්ට ආත්මය ප්‍රිය වේ. ඔවුන් ‘අපට ආත්මය අප්‍රියය’ යැයි මෙසේ පැවසුවත්, ඇත්ත වශයෙන්ම ඔවුන්ට ආත්මය ප්‍රිය වේ. එයට හේතුව කුමක්ද? යම් දෙයක් ප්‍රිය පුද්ගලයෙක්, ප්‍රිය පුද්ගලයෙකුට කරන්නේද, එයම ඔවුහු තමන් විසින් තමන්ට කරගනිති. එබැවින් ඔවුන්ට ආත්මය ප්‍රිය වේ’’, යනුවෙන්.\n\n‘‘මහරජ, එය එසේමය, මහරජ, එය එසේමය! මහරජ, යම් කිසිවෙක් කයින් දුශ්චරිතයෙහි හැසිරෙද්ද, වචනයෙන් දුශ්චරිතයෙහි හැසිරෙද්ද, සිතින් දුශ්චරිතයෙහි හැසිරෙද්ද; ඔවුන්ට ආත්මය අප්‍රිය වේ. ඔවුන් ‘අපට ආත්මය ප්‍රියය’ යැයි මෙසේ පැවසුවත්, ඇත්ත වශයෙන්ම ඔවුන්ට ආත්මය අප්‍රිය වේ. මහරජ, එයට හේතුව කුමක්ද? යම් දෙයක් අප්‍රිය පුද්ගලයෙක්, අප්‍රිය පුද්ගලයෙකුට කරන්නේද, එයම ඔවුහු තමන් විසින් තමන්ට කරගනිති. එබැවින් ඔවුන්ට ආත්මය අප්‍රිය වේ. මහරජ, යම් කිසිවෙක් කයින් සුචරිතයෙහි හැසිරෙද්ද, වචනයෙන් සුචරිතයෙහි හැසිරෙද්ද, සිතින් සුචරිතයෙහි හැසිරෙද්ද; ඔවුන්ට ආත්මය ප්‍රිය වේ. ඔවුන් ‘අපට ආත්මය අප්‍රියය’ යැයි මෙසේ පැවසුවත්, ඇත්ත වශයෙන්ම ඔවුන්ට ආත්මය ප්‍රිය වේ. මහරජ, එයට හේතුව කුමක්ද? යම් දෙයක් ප්‍රිය පුද්ගලයෙක්, ප්‍රිය පුද්ගලයෙකුට කරන්නේද, එයම ඔවුහු තමන් විසින් තමන්ට කරගනිති. එබැවින් ඔවුන්ට ආත්මය ප්‍රිය වේ’’, යනුවෙන්.\n\nමෙසේ භාග්‍යවතුන් වහන්සේ වදාළ සේක:\n\n‘‘යමෙක් තමාට ප්‍රිය බව දන්නේ නම්, ඒ තමා පවට නොයෙදිය යුතුයි. යම් හෙයකින් දුෂ්කර ක්‍රියා කරන්නාට සැප පහසුවෙන් නොලැබෙයි.\n\n‘‘මරුවා විසින් අභිභවනය කරනු ලැබූ, මනුෂ්‍ය භවය හැර යන පුද්ගලයාට, ඇත්ත වශයෙන්ම කුමක් තමන්ගේ වේද? කුමක් ගෙන යයිද? කුමක් සෙවණැල්ලක් මෙන් නොඅත්හැර පසුපස එන්නේද?\n\n‘‘මිනිසා මෙලොවදී කරන පින සහ පව යන දෙකම, ඇත්ත වශයෙන්ම ඔහුගේම වේ. ඔහු එයම රැගෙන යයි. එයම සෙවණැල්ලක් මෙන් නොඅත්හැර පසුපස එයි.\n\n‘‘එබැවින් පරලොව පිණිස යහපත් දේ රැස්කළ යුතුයි. පින පරලොවදී සත්ත්වයන්ට පිහිට වන්නේය.’’",
      "paliTitle": "Piyasuttaṃ"
    },
    {
      "number": 116,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘kesaṃ nu kho rakkhito attā, kesaṃ arakkhito attā’ti? Tassa mayhaṃ, bhante, etadahosi – ‘ye kho keci kāyena duccaritaṃ caranti, vācāya duccaritaṃ caranti, manasā duccaritaṃ caranti; tesaṃ arakkhito attā. Kiñcāpi te hatthikāyo vā rakkheyya, assakāyo vā rakkheyya, rathakāyo vā rakkheyya, pattikāyo vā rakkheyya; atha kho tesaṃ arakkhito attā. Taṃ kissa hetu? Bāhirā hesā rakkhā, nesā rakkhā ajjhattikā; tasmā tesaṃ arakkhito attā. Ye ca kho keci kāyena sucaritaṃ caranti, vācāya sucaritaṃ caranti, manasā sucaritaṃ caranti; tesaṃ rakkhito attā. Kiñcāpi te neva hatthikāyo rakkheyya, na assakāyo rakkheyya, na rathakāyo rakkheyya, na pattikāyo rakkheyya; atha kho tesaṃ rakkhito attā. Taṃ kissa hetu? Ajjhattikā hesā rakkhā, nesā rakkhā bāhirā; tasmā tesaṃ rakkhito attā’’’ti. ‘‘Evametaṃ, mahārāja, evametaṃ, mahārāja! Ye hi keci, mahārāja, kāyena duccaritaṃ caranti… pe… tesaṃ arakkhito attā. Taṃ kissa hetu? Bāhirā hesā, mahārāja, rakkhā, nesā rakkhā ajjhattikā; tasmā tesaṃ arakkhito attā. Ye ca kho keci, mahārāja, kāyena sucaritaṃ caranti, vācāya sucaritaṃ caranti, manasā sucaritaṃ caranti; tesaṃ rakkhito attā. Kiñcāpi te neva hatthikāyo rakkheyya, na assakāyo rakkheyya, na rathakāyo rakkheyya, na pattikāyo rakkheyya; atha kho tesaṃ rakkhito attā. Taṃ kissa hetu? Ajjhattikā hesā, mahārāja, rakkhā, nesā rakkhā bāhirā; tasmā tesaṃ rakkhito attā’’ti. Idamavoca… pe… ‘‘Kāyena saṃvaro sādhu, sādhu vācāya saṃvaro; Manasā saṃvaro sādhu, sādhu sabbattha saṃvaro; Sabbattha saṃvuto lajjī, rakkhitoti pavuccatī’’ti.",
      "english": "King Pasenadi of Kosala, seated to one side, said this to the Blessed One: \"Venerable Sir, while I was in seclusion and solitude, this thought arose in my mind: 'For whom, indeed, is the self protected? And for whom is the self unprotected?' Venerable Sir, it then occurred to me: 'Whoever commits misconduct by body, misconduct by speech, and misconduct by mind—for them, the self is unprotected. Even if they were protected by elephant troops, horse troops, chariot troops, or infantry troops, still for them, the self is unprotected. And why is that? Because this is external protection, not internal protection. Therefore, for them, the self is unprotected. But whoever commits good conduct by body, good conduct by speech, and good conduct by mind—for them, the self is protected. Even if they are not protected by elephant troops, nor horse troops, nor chariot troops, nor infantry troops, still for them, the self is protected. And why is that? Because this is internal protection, not external protection. Therefore, for them, the self is protected.'\"\n\n\"That is so, great king! That is so, great king! For whoever, great king, commits misconduct by body, misconduct by speech, and misconduct by mind—for them, the self is unprotected. And why is that? Because this, great king, is external protection, not internal protection. Therefore, for them, the self is unprotected. But whoever, great king, commits good conduct by body, good conduct by speech, and good conduct by mind—for them, the self is protected. Even if they are not protected by elephant troops, nor horse troops, nor chariot troops, nor infantry troops, still for them, the self is protected. And why is that? Because this, great king, is internal protection, not external protection. Therefore, for them, the self is protected.\"\n\nRestraint of body is good. Restraint of speech is good.\nRestraint of mind is good. Restraint everywhere is good.\nOne who is restrained everywhere, being conscientious, is said to be protected.",
      "sinhala": "පසේනදී කෝසල රජු එක් පසෙක අසුන්ගෙන භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “භාග්‍යවතුන් වහන්ස, මෙහි මා හුදෙකලාව, භාවනාවට සමවැදී සිටියදී මගේ සිතට මෙවන් විතර්කයක් පහළ විය – ‘කාගේ තමා ආරක්‍ෂා වී ඇත්තේද? කාගේ තමා ආරක්‍ෂා වී නැත්තේද?’ යනුවෙනි.”\n\n“භාග්‍යවතුන් වහන්ස, එවිට මට මෙසේ සිතුණේය – ‘යම් කෙනෙක් කයින් දුසිරිත්හි හැසිරෙද්ද, වචනයෙන් දුසිරිත්හි හැසිරෙද්ද, සිතින් දුසිරිත්හි හැසිරෙද්ද; ඔවුන්ගේ තමා ආරක්‍ෂිත නොවේ. ඇතෑයින් හෝ රකින්නට ඇතත්, අසුන් හෝ රකින්නට ඇතත්, රථ සේනාවක් හෝ රකින්නට ඇතත්, පාබල සේනාවක් හෝ රකින්නට ඇතත්; එසේ වුවද ඔවුන්ගේ තමා ආරක්‍ෂිත නොවේ. ඒ කුමන හේතුවක් නිසාද? මක්නිසාද යත්, මෙය බාහිර ආරක්‍ෂාවකි, මෙය ආධ්‍යාත්මික ආරක්‍ෂාවක් නොවේ; එබැවින් ඔවුන්ගේ තමා ආරක්‍ෂිත නොවේ. යම් කෙනෙක් කයින් සුසිරිත්හි හැසිරෙද්ද, වචනයෙන් සුසිරිත්හි හැසිරෙද්ද, සිතින් සුසිරිත්හි හැසිරෙද්ද; ඔවුන්ගේ තමා ආරක්‍ෂිත වේ. ඇතෑයින් හෝ රකින්නට නොහැකි වුවත්, අසුන් හෝ රකින්නට නොහැකි වුවත්, රථ සේනාවක් හෝ රකින්නට නොහැකි වුවත්, පාබල සේනාවක් හෝ රකින්නට නොහැකි වුවත්; එසේ වුවද ඔවුන්ගේ තමා ආරක්‍ෂිත වේ. ඒ කුමන හේතුවක් නිසාද? මක්නිසාද යත්, මෙය ආධ්‍යාත්මික ආරක්‍ෂාවකි, මෙය බාහිර ආරක්‍ෂාවක් නොවේ; එබැවින් ඔවුන්ගේ තමා ආරක්‍ෂිත වේ.’ යනුවෙනි.”\n\n“මහරජ, එය එසේමය, මහරජ, එය එසේමය! මක්නිසාද යත්, මහරජ, යම් කෙනෙක් කයින් දුසිරිත්හි හැසිරෙද්ද, වචනයෙන් දුසිරිත්හි හැසිරෙද්ද, සිතින් දුසිරිත්හි හැසිරෙද්ද; ඔවුන්ගේ තමා ආරක්‍ෂිත නොවේ. ඇතෑයින් හෝ රකින්නට ඇතත්, අසුන් හෝ රකින්නට ඇතත්, රථ සේනාවක් හෝ රකින්නට ඇතත්, පාබල සේනාවක් හෝ රකින්නට ඇතත්; එසේ වුවද ඔවුන්ගේ තමා ආරක්‍ෂිත නොවේ. ඒ කුමන හේතුවක් නිසාද? මක්නිසාද යත්, මහරජ, මෙය බාහිර ආරක්‍ෂාවකි, මෙය ආධ්‍යාත්මික ආරක්‍ෂාවක් නොවේ; එබැවින් ඔවුන්ගේ තමා ආරක්‍ෂිත නොවේ. යම් කෙනෙක් කයින් සුසිරිත්හි හැසිරෙද්ද, වචනයෙන් සුසිරිත්හි හැසිරෙද්ද, සිතින් සුසිරිත්හි හැසිරෙද්ද; ඔවුන්ගේ තමා ආරක්‍ෂිත වේ. ඇතෑයින් හෝ රකින්නට නොහැකි වුවත්, අසුන් හෝ රකින්නට නොහැකි වුවත්, රථ සේනාවක් හෝ රකින්නට නොහැකි වුවත්, පාබල සේනාවක් හෝ රකින්නට නොහැකි වුවත්; එසේ වුවද ඔවුන්ගේ තමා ආරක්‍ෂිත වේ. ඒ කුමන හේතුවක් නිසාද? මක්නිසාද යත්, මහරජ, මෙය ආධ්‍යාත්මික ආරක්‍ෂාවකි, මෙය බාහිර ආරක්‍ෂාවක් නොවේ; එබැවින් ඔවුන්ගේ තමා ආරක්‍ෂිත වේ.”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. තවද, භාග්‍යවතුන් වහන්සේ මෙසේද වදාළ සේක:\n‘කයෙහි සංවරය යහපත්ය, වචනයෙහි සංවරය යහපත්ය;\nසිතෙහි සංවරය යහපත්ය, සියල්ලෙහි සංවරය යහපත්ය;\nසියල්ලෙහි සංවර වූ, පවට ලැජ්ජා ඇත්තා ආරක්‍ෂිත යැයි කියනු ලැබේ.’",
      "paliTitle": "Attarakkhitasuttaṃ"
    },
    {
      "number": 117,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘appakā te sattā lokasmiṃ ye uḷāre uḷāre bhoge labhitvā na ceva majjanti, na ca pamajjanti, na ca kāmesu gedhaṃ āpajjanti, na ca sattesu vippaṭipajjanti. Atha kho eteva bahutarā sattā lokasmiṃ ye uḷāre uḷāre bhoge labhitvā majjanti ceva pamajjanti, ca kāmesu ca gedhaṃ āpajjanti, sattesu ca vippaṭipajjantī’’’ti. ‘‘Evametaṃ, mahārāja, evametaṃ, mahārāja! Appakā te, mahārāja, sattā lokasmiṃ, ye uḷāre uḷāre bhoge labhitvā na ceva majjanti, na ca pamajjanti, na ca kāmesu gedhaṃ āpajjanti, na ca sattesu vippaṭipajjanti. Atha kho eteva bahutarā sattā lokasmiṃ, ye uḷāre uḷāre bhoge labhitvā majjanti ceva pamajjanti ca kāmesu ca gedhaṃ āpajjanti, sattesu ca vippaṭipajjantī’’ti. Idamavoca…pe… ‘‘Sārattā kāmabhogesu, giddhā kāmesu mucchitā; Atisāraṃ na bujjhanti, migā kūṭaṃva oḍḍitaṃ; Pacchāsaṃ kaṭukaṃ hoti, vipāko hissa pāpako’’ti.",
      "english": "At Sāvatthī.\n\nKing Pasenadi of Kosala, seated to one side, said this to the Blessed One: \"Here, venerable sir, as I was alone in seclusion, this thought arose in my mind: 'Few are those beings in the world who, having obtained abundant wealth and possessions, do not become intoxicated, are not heedless, do not fall into craving for sensual pleasures, and do not act wrongly towards other beings. However, more numerous are those beings in the world who, having obtained abundant wealth and possessions, do become intoxicated, are heedless, fall into craving for sensual pleasures, and act wrongly towards other beings.'\"\n\n\"It is so, great king, it is so, great king! Few are those beings in the world, great king, who, having obtained abundant wealth and possessions, do not become intoxicated, are not heedless, do not fall into craving for sensual pleasures, and do not act wrongly towards other beings. However, more numerous are those beings in the world who, having obtained abundant wealth and possessions, do become intoxicated, are heedless, fall into craving for sensual pleasures, and act wrongly towards other beings.\"\n\nInfatuated with sensual pleasures and possessions, greedy and deluded by sensual pleasures;\nThey do not discern the excessive danger, like deer at a trap that has been laid;\nTheir future is bitter, and its karmic result is evil.",
      "sinhala": "සැවැත් නුවරදී.\n\nඑක් පසෙක අසුන් ගත් කොසොල් රජු වන පසේනදී භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – \"භාග්‍යවතුන් වහන්ස, මෙහිදී මට තනිව, एकाන්තයට වී සිටින විට සිතට මෙවැනි කල්පනාවක් පහළ විය – 'ලෝකයෙහි යම් සත්වයන් උසස් උසස් භෝග සම්පත් ලබාගෙන, ඒවායෙන් මත් නොවෙත් ද, ප්‍රමාද නොවෙත් ද, කාමයන් කෙරෙහි ගිජු නොවෙත් ද, සත්වයන් කෙරෙහි වරදවා නොපැවැත්වෙත් ද, ඒ සත්වයෝ ඉතා ස්වල්පයකි. එහෙත්, යම් සත්වයන් උසස් උසස් භෝග සම්පත් ලබාගෙන, ඒවායෙන් මත් වෙත් ද, ප්‍රමාද වෙත් ද, කාමයන් කෙරෙහි ගිජු වෙත් ද, සත්වයන් කෙරෙහි වරදවා පැවැත්වෙත් ද, ඒ සත්වයෝම බොහෝයයි.\"\n\n\"මහරජ, මෙය එසේමය, මහරජ, මෙය එසේමය! මහරජ, ලෝකයෙහි යම් සත්වයන් උසස් උසස් භෝග සම්පත් ලබාගෙන, ඒවායෙන් මත් නොවෙත් ද, ප්‍රමාද නොවෙත් ද, කාමයන් කෙරෙහි ගිජු නොවෙත් ද, සත්වයන් කෙරෙහි වරදවා නොපැවැත්වෙත් ද, ඒ සත්වයෝ ඉතා ස්වල්පයකි. එහෙත්, මහරජ, යම් සත්වයන් උසස් උසස් භෝග සම්පත් ලබාගෙන, ඒවායෙන් මත් වෙත් ද, ප්‍රමාද වෙත් ද, කාමයන් කෙරෙහි ගිජු වෙත් ද, සත්වයන් කෙරෙහි වරදවා පැවැත්වෙත් ද, ඒ සත්වයෝම බොහෝයයි.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා සුගත වූ ශාස්තෘවරයාණන් වහන්සේ තවදුරටත් මෙසේ වදාළ සේක: \"කාම භෝගයන් කෙරෙහි දැඩිව ඇලී, කාමයන් කෙරෙහි ගිජුව, මුසපත් වූවෝය. උගුලට අසුවන මුවෝ සේ, තමන්ට වන අනතුර නොදනිති. ඔවුන්ගේ පසුකාලීන තත්වය දුක්ඛදායක වන්නේය, එහි විපාකය පාපී වන්නේය.\"",
      "paliTitle": "Appakasuttaṃ"
    },
    {
      "number": 118,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, aḍḍakaraṇe [atthakaraṇe (sī. syā. kaṃ. pī.)] nisinno passāmi khattiyamahāsālepi brāhmaṇamahāsālepi gahapatimahāsālepi aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe kāmahetu kāmanidānaṃ kāmādhikaraṇaṃ sampajānamusā bhāsante. Tassa mayhaṃ, bhante, etadahosi – ‘alaṃ dāni me aḍḍakaraṇena, bhadramukho dāni aḍḍakaraṇena paññāyissatī’’’ti. ‘‘(Evametaṃ, mahārāja, evametaṃ mahārāja!) [( ) sī. pī. potthakesu natthi] Yepi te, mahārāja, khattiyamahāsālā brāhmaṇamahāsālā gahapatimahāsālā aḍḍhā mahaddhanā mahābhogā pahūtajātarūparajatā pahūtavittūpakaraṇā pahūtadhanadhaññā kāmahetu kāmanidānaṃ kāmādhikaraṇaṃ sampajānamusā bhāsanti; tesaṃ taṃ bhavissati dīgharattaṃ ahitāya dukkhāyā’’ti. Idamavoca…pe… ‘‘Sārattā kāmabhogesu, giddhā kāmesu mucchitā; Atisāraṃ na bujjhanti, macchā khippaṃva oḍḍitaṃ; Pacchāsaṃ kaṭukaṃ hoti, vipāko hissa pāpako’’ti.",
      "english": "At Sāvatthī. Seated to one side, King Pasenadi of Kosala said this to the Blessed One: \"Venerable sir, here, as I sit in the assembly for justice, I observe prominent khattiya families, prominent brahmin families, and prominent householder families – wealthy, of great riches, possessing great enjoyments, abundant in gold and silver, abundant in property and possessions, abundant in grain and crops – speaking deliberate falsehoods for the sake of sensual pleasures, on account of sensual pleasures, with sensual pleasures as the underlying basis. To me, venerable sir, it occurred: 'Enough now for me with this assembly for justice; let some other respectable person now preside over the assembly for justice.'\"\n\n\"Indeed, great king, those very prominent khattiya families, prominent brahmin families, and prominent householder families – wealthy, of great riches, possessing great enjoyments, abundant in gold and silver, abundant in property and possessions, abundant in grain and crops – who speak deliberate falsehoods for the sake of sensual pleasures, on account of sensual pleasures, with sensual pleasures as the underlying basis; for them, that will lead to harm and suffering for a long time.\" The Blessed One spoke this.\n\nDeeply attached to the enjoyment of sensual pleasures, greedy and infatuated with sensual pleasures;\nThey do not comprehend the danger, like fish swiftly caught in a net.\nLater, its aftermath is bitter, and its karmic result is unwholesome.",
      "sinhala": "සැවැත් නුවරදී සිදු වූවකි.\n\nඑකත්පස්ව වැඩ සිටි කොසොල් රජු වන පසේනදී භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – ‘‘වහන්ස, මෙහි මා මේ නඩු විභාග කරන ස්ථානයේ වාඩි වී සිටින විට, ක්‍ෂත්‍රිය මහාසාලවරු, බ්‍රාහ්මණ මහාසාලවරු, ගෘහපති මහාසාලවරු – එනම් ධනවත්, මහත් ධනයක් ඇති, මහත් භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ වස්තු උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති අය – කාමයන් නිසා, කාමයන් හේතු කොටගෙන, කාමයන් මුල් කරගෙන සිතාමතා බොරු කියනු මම දකිමි. වහන්ස, එවිට මට මෙසේ සිතුණි – ‘දැන් මේ නඩු විභාගයෙන් මට ඇති. යහපත් මිනිසෙක් දැන් නඩු විභාගයෙන්ම හඳුනාගනු ලැබීම වේවා!’”\n\n‘‘(මහරජ, එසේමය, මහරජ, එසේමය!) මහරජ, යම් ඒ ක්‍ෂත්‍රිය මහාසාලවරු, බ්‍රාහ්මණ මහාසාලවරු, ගෘහපති මහාසාලවරු – එනම් ධනවත්, මහත් ධනයක් ඇති, මහත් භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ වස්තු උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති අය – කාමයන් නිසා, කාමයන් හේතු කොටගෙන, කාමයන් මුල් කරගෙන සිතාමතා බොරු කියත්ද; එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත් දුක පිණිසත් වන්නේය.’’ මෙය වදාළ සේක.\n\n‘‘කාමභෝගයන්ට දැඩි ලෙස ඇලුණු, කාමයන් කෙරෙහි ගිජු වූ, මුළා වූ ඔවුහු, ඉක්මනින් දැලට හසුවූ මසුන් මෙන්, කාමයන්ගේ සීමාව ඉක්මවා යෑම නොදනිති. පසුව එය ඔවුනට දුක් ගෙන දෙන්නක් වන්නේය, එහි විපාකයද පාපී වන්නේය.’’",
      "paliTitle": "Aḍḍakaraṇasuttaṃ"
    },
    {
      "number": 119,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena rājā pasenadi kosalo mallikāya deviyā saddhiṃ uparipāsādavaragato hoti. Atha kho rājā pasenadi kosalo mallikaṃ deviṃ etadavoca – ‘‘atthi nu kho te, mallike, kocañño attanā piyataro’’ti? ‘‘Natthi kho me, mahārāja, kocañño attanā piyataro. Tuyhaṃ pana, mahārāja, atthañño koci attanā piyataro’’ti? ‘‘Mayhampi kho, mallike, natthañño koci attanā piyataro’’ti. Atha kho rājā pasenadi kosalo pāsādā orohitvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘idhāhaṃ, bhante, mallikāya deviyā saddhiṃ uparipāsādavaragato mallikaṃ deviṃ etadavocaṃ – ‘atthi nu kho te, mallike, kocañño attanā piyataro’ti? Evaṃ vutte, bhante, mallikā devī maṃ etadavoca – ‘natthi kho me, mahārāja, kocañño attanā piyataro. Tuyhaṃ pana, mahārāja, atthañño koci attanā piyataro’ti? Evaṃ vuttāhaṃ, bhante, mallikaṃ deviṃ etadavocaṃ – ‘mayhampi kho, mallike, natthañño koci attanā piyataro’’ti. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Sabbā disā anuparigamma cetasā, Nevajjhagā piyataramattanā kvaci; Evaṃ piyo puthu attā paresaṃ, Tasmā na hiṃse paramattakāmo’’ti.",
      "english": "At Sāvatthī. At that time, King Pasenadi of Kosala was on the highest floor of his palace with Queen Mallikā. Then King Pasenadi of Kosala said to Queen Mallikā, \"Mallikā, is there anyone else dearer to you than yourself?\" She replied, \"Great King, there is no one else dearer to me than myself. But Great King, is there anyone else dearer to you than yourself?\" King Pasenadi said, \"Mallikā, there is no one else dearer to me than myself either.\" Then King Pasenadi of Kosala descended from the palace and approached the Blessed One. Having approached and respectfully saluted the Blessed One, he sat down to one side. Seated to one side, King Pasenadi of Kosala said to the Blessed One, \"Venerable Sir, while I was on the highest floor of my palace with Queen Mallikā, I said to her: 'Mallikā, is there anyone else dearer to you than yourself?' When this was said, Venerable Sir, Queen Mallikā replied to me: 'Great King, there is no one else dearer to me than myself. But Great King, is there anyone else dearer to you than yourself?' When thus addressed, Venerable Sir, I said to Queen Mallikā: 'Mallikā, there is no one else dearer to me than myself either.'\"\n\nThen the Blessed One, having understood this matter, on that occasion spoke this verse:\n\"Having traversed all directions with the mind,\nOne nowhere found anything dearer than oneself.\nIn the same way, the self is dear to others, too.\nTherefore, one who loves oneself should not harm another.\"",
      "sinhala": "සැවැත්නුවරදී සිදු විය.\n\nඑකල කොසොල් රජු වූ පසේනදී භාර්යාව වන මල්ලිකා දේවිය සමඟ ප්‍රාසාදයේ උඩු මහලෙහි වැඩ සිටියේය. එකල්හි කොසොල් රජු වූ පසේනදී මල්ලිකා දේවියට මෙය කීවේය: \"මල්ලිකාවෙනි, ඔබට ඔබව වඩා ප්‍රිය අන් කිසිවෙක් ඇද්ද?\" \"මහරජ, මට මා හැර වෙන කිසිවෙක් ප්‍රිය නැත. එහෙත්, මහරජ, ඔබට ඔබව වඩා ප්‍රිය අන් කිසිවෙක් ඇද්ද?\" \"මල්ලිකාවෙනි, මටත් මා හැර වෙන කිසිවෙක් ප්‍රිය නැත.\" එකල්හි කොසොල් රජු වූ පසේනදී ප්‍රාසාදයෙන් බැස භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩ සිටි කොසොල් රජු වූ පසේනදී භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"ස්වාමීනි, මම මෙහිදී මල්ලිකා දේවිය සමඟ ප්‍රාසාදයේ උඩු මහලට නැඟී සිටි අතර මල්ලිකා දේවියට මෙසේ කීවෙමි: 'මල්ලිකාවෙනි, ඔබට ඔබව වඩා ප්‍රිය අන් කිසිවෙක් ඇද්ද?' ස්වාමීනි, මෙසේ කී කල්හි මල්ලිකා දේවිය මට මෙසේ කීවාය: 'මහරජ, මට මා හැර වෙන කිසිවෙක් ප්‍රිය නැත. එහෙත්, මහරජ, ඔබට ඔබව වඩා ප්‍රිය අන් කිසිවෙක් ඇද්ද?' ස්වාමීනි, මෙසේ කී කල්හි මම මල්ලිකා දේවියට මෙසේ කීවෙමි: 'මල්ලිකාවෙනි, මටත් මා හැර වෙන කිසිවෙක් ප්‍රිය නැත.'\"\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ මේ කාරණය දැන, ඒ වේලාවෙහි මෙම ගාථාව වදාළ සේක:\n\"සියලු දිශාවන් මනසින් විමසා බැලූ විට,\nකිසිවෙකු තමාට වඩා ප්‍රිය කෙනෙකු කොතැනකවත් නොදක්නේය.\nමෙලෙසින් තමා අන් අයටද ඉතා ප්‍රිය වෙයි.\nඑහෙයින්, තමාට කැමති වන තැනැත්තා අනුන්ට හිංසා නොකළ යුතුය.\"",
      "paliTitle": "Mallikāsuttaṃ"
    },
    {
      "number": 120,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena rañño pasenadissa kosalassa mahāyañño paccupaṭṭhito hoti, pañca ca usabhasatāni pañca ca vacchatarasatāni pañca ca vacchatarisatāni pañca ca ajasatāni pañca ca urabbhasatāni thūṇūpanītāni honti yaññatthāya. Yepissa te honti dāsāti vā pessāti vā kammakarāti vā, tepi daṇḍatajjitā bhayatajjitā assumukhā rudamānā parikammāni karonti. Atha kho sambahulā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisiṃsu. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, rañño pasenadissa kosalassa mahāyañño paccupaṭṭhito hoti, pañca ca usabhasatāni pañca ca vacchatarasatāni pañca ca vacchatarisatāni pañca ca ajasatāni pañca ca urabbhasatāni thūṇūpanītāni honti yaññatthāya. Yepissa te honti dāsāti vā pessāti vā kammakarāti vā, tepi daṇḍatajjitā bhayatajjitā assumukhā rudamānā parikammāni karontī’’ti. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Assamedhaṃ purisamedhaṃ, sammāpāsaṃ vājapeyyaṃ niraggaḷhaṃ; Mahāyaññā mahārambhā [vājapeyyuṃ; niraggaḷaṃ mahārambhā (ka.)], na te honti mahapphalā. ‘‘Ajeḷakā ca gāvo ca, vividhā yattha haññare; Na taṃ sammaggatā yaññaṃ, upayanti mahesino. ‘‘Ye ca yaññā nirārambhā, yajanti anukulaṃ sadā; Ajeḷakā ca gāvo ca, vividhā nettha haññare; Etaṃ sammaggatā yaññaṃ, upayanti mahesino. ‘‘Etaṃ yajetha medhāvī, eso yañño mahapphalo; Etañhi yajamānassa, seyyo hoti na pāpiyo; Yañño ca vipulo hoti, pasīdanti ca devatā’’ti.",
      "english": "This discourse originates in Sāvatthī. Now at that time, King Pasenadi of Kosala had a great sacrifice prepared, for which five hundred bulls, five hundred male calves, five hundred female calves, five hundred goats, and five hundred rams were brought to the sacrificial posts. Those who were his slaves, messengers, or workers, they too, threatened by sticks, threatened by fear, with tearful faces, weeping, performed the preparations.\n\nThen, in the forenoon, many monks, having dressed and taken their bowls and robes, entered Sāvatthī for alms. After wandering for alms in Sāvatthī and returning from their alms-round after their meal, they approached the Blessed One. Having approached and paid homage to the Blessed One, they sat down to one side. Sitting to one side, those monks said to the Blessed One, 'Here, Venerable Sir, King Pasenadi of Kosala has a great sacrifice prepared, for which five hundred bulls, five hundred male calves, five hundred female calves, five hundred goats, and five hundred rams are brought to the sacrificial posts. Those who are his slaves, messengers, or workers, they too, threatened by sticks, threatened by fear, with tearful faces, weeping, perform the preparations.'\n\nThen, understanding this matter, the Blessed One, on that occasion, uttered these verses:\nThe horse sacrifice, the human sacrifice, the 'peg-pulling' sacrifice, the 'drink of strength' offering, and the 'unobstructed' great sacrifices, though they entail great endeavors, are not of great fruit.\nWhere goats, sheep, and various cattle are slain, such a sacrifice is not approached by those of right conduct, by the great sages.\nBut those sacrifices that are free from violence, offered always in accordance with what is fitting, where goats, sheep, and various cattle are not slain—such a sacrifice is approached by those of right conduct, by the great sages.\nThe wise person should offer such a sacrifice; this is a great-fruit sacrifice. Indeed, for one who offers it, it becomes better, not worse. The sacrifice becomes abundant, and the deities are pleased.",
      "sinhala": "මේ කාරණය සැවැත්නුවරදී සිදුවිය. එසමයෙහි කෝසල රජු වූ පසේනදි රජුගේ මහා යාගයක් පැවැත්වීමට සූදානම් කර තිබුණි. ඒ යාගය සඳහා ගොනුන් පන්සියයක්ද, වැස්සන් පන්සියයක්ද, වැස්සියන් පන්සියයක්ද, එළුවන් පන්සියයක්ද, බැටළුවන් පන්සියයක්ද යන සතුන් පූජා කුළුණුවලට ගෙනවිත් බඳවා තිබුණි. තවද, ඔහුට දාසයෝ හෝ පේෂණකාරයෝ හෝ කම්කරුවෝ හෝ වශයෙන් සිටි යම් අයෙක් වෙත්ද, ඔවුහු ද දඬුමුගුරු වලින් තර්ජනය කරනු ලැබූවෝ, භයින් තර්ජනය කරනු ලැබූවෝ, කඳුළු පිරි මුහුණින් යුක්තව, හඬා වැලපෙමින්, යාගයේ කටයුතු සම්පූර්ණ කළහ.\n\nඉක්බිති බොහෝ භික්ෂූහු පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන, පිණ්ඩපාතය පිණිස සැවැත්නුවරට පිවිසියහ. සැවැත්නුවර පිණ්ඩපාතයේ හැසිර, දහවල් ආහාරයෙන් පසුව පිණ්ඩපාතයෙන් ආපසු වැඩමවා, භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩි වූහ. එකත්පසෙකින් වාඩි වී සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ කීහ – “වහන්ස, මෙහි කෝසල රජු වූ පසේනදි රජුගේ මහා යාගයක් පැවැත්වීමට සූදානම් කර තිබේ. ඒ යාගය සඳහා ගොනුන් පන්සියයක්ද, වැස්සන් පන්සියයක්ද, වැස්සියන් පන්සියයක්ද, එළුවන් පන්සියයක්ද, බැටළුවන් පන්සියයක්ද යන සතුන් පූජා කුළුණුවලට ගෙනවිත් බඳවා තිබේ. තවද, ඔහුට දාසයෝ හෝ පේෂණකාරයෝ හෝ කම්කරුවෝ හෝ වශයෙන් සිටි යම් අයෙක් වෙත්ද, ඔවුහු ද දඬුමුගුරු වලින් තර්ජනය කරනු ලැබූවෝ, භයින් තර්ජනය කරනු ලැබූවෝ, කඳුළු පිරි මුහුණින් යුක්තව, හඬා වැලපෙමින්, යාගයේ කටයුතු සම්පූර්ණ කරති.”\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ මේ කාරණය දැන, ඒ වේලෙහි මේ ගාථා වදාළහ –\n\nඅශ්වමේධය, පුරිෂමේධය, සම්මාපාසය, වාජපෙයියය, නිරර්ගල යන යම් මහා යාග විශාල සත්ව ඝාතනයකින් යුක්තව කරනු ලැබේ නම්, ඒවා මහාඵල නැත්තාහ.\n\nඑළු, බැටළු, විවිධ ගව ආදී සතුන් ඝාතනය කරනු ලබන යම් යාගයක් වේද, මනා කොට ගමන් කළ (රහත්) වූ ඒ මහඍෂිවරු ඒ යාගයට නොපැමිණෙති.\n\nයම් යාගයන් ආරම්භයෙන් තොරව (සත්ව හිංසාවෙන් තොරව) සැමවිටම සියලු දෙනාට අනුකූල වන පරිදි සිදු කෙරේ නම්, එහි එළු, බැටළු, විවිධ ගව ආදී සතුන් ඝාතනය කරනු නොලැබේ. මනා කොට ගමන් කළ (රහත්) වූ ඒ මහඍෂිවරු එවන් යාගයකට පැමිණෙති.\n\nනුවණැත්තා මෙවැනි යාගයක් කළ යුතුය. මේ යාගය මහාඵලදායකය. මේ යාගය කරන තැනැත්තාට යහපතම වන්නේය, අයහපතක් නොවේ. යාගයද පුළුල් (විශාල) වන්නේය, දෙවිවරුද ප්‍රසන්න වන්නාහ.",
      "paliTitle": "Yaññasuttaṃ"
    },
    {
      "number": 121,
      "pali": "Tena kho pana samayena raññā pasenadinā kosalena mahājanakāyo bandhāpito hoti, appekacce rajjūhi appekacce andūhi appekacce saṅkhalikāhi. Atha kho sambahulā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisiṃsu. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, raññā pasenadinā kosalena mahājanakāyo bandhāpito, appekacce rajjūhi appekacce andūhi appekacce saṅkhalikāhī’’ti. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Na taṃ daḷhaṃ bandhanamāhu dhīrā, Yadāyasaṃ dārujaṃ pabbajañca; Sārattarattā maṇikuṇḍalesu, Puttesu dāresu ca yā apekkhā. ‘‘Etaṃ daḷhaṃ bandhanamāhu dhīrā, Ohārinaṃ sithilaṃ duppamuñcaṃ; Etampi chetvāna paribbajanti, Anapekkhino kāmasukhaṃ pahāyā’’ti. Paṭhamo vaggo. Tassuddānaṃ – Daharo puriso jarā, piyaṃ attānarakkhito; Appakā aḍḍakaraṇaṃ, mallikā yaññabandhananti.",
      "english": "At that time, King Pasenadi of Kosala had a large number of people arrested, some with ropes, some with shackles, and some with chains. Then, in the morning, many bhikkhus, having dressed and taken their bowls and robes, entered Sāvatthī for alms. Having wandered for alms in Sāvatthī and returned from their alms round after their meal, they approached the Blessed One; having approached, they paid homage to the Blessed One and sat down to one side. As they sat to one side, those bhikkhus said this to the Blessed One: \"Here, venerable sir, King Pasenadi of Kosala has had a large number of people arrested, some with ropes, some with shackles, and some with chains.\" Then the Blessed One, having understood this matter, on that occasion spoke these verses:\n\n\"The wise do not call that a strong bond which is made of iron, wood, or plant fiber. It is rather the fervent longing and attachment for jewels and earrings, for children and spouses, that is the true bond.\n\nThis is what the wise call a strong bond – that which drags one down, is seemingly loose, yet hard to release. Having cut even this, they wander forth, without longing, having abandoned sensual pleasures.\"",
      "sinhala": "එකල කෝසල රජු වූ පසේනදී විසින් විශාල ජනකායක් බැඳ දමා තිබුණි. සමහරු කඹවලින්ද, සමහරු විලංගු වලින්ද, සමහරු දම්වැල් වලින්ද බැඳ තිබුණි. ඉක්බිති බොහෝ භික්ෂූන් වහන්සේලා පෙරවරුවේ සිවුරු හැඳ පොරවාගෙන, පාත්‍ර සිවුරු රැගෙන සැවැත් නුවරට පිඬු සිඟා ව වැඩියහ. සැවැත් නුවර පිඬු සිඟා වඩාරා, දන් වළඳා, පිඬු සිඟා වඩිනු අවසන් කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියහ. එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙකින් වාඩි වූහ. එකත්පසෙකින් වාඩි වී සිටි ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: ‘‘වහන්ස, මෙහි, කෝසල රජු වූ පසේනදී විසින් විශාල ජනකායක් බැඳ දමා ඇත. සමහරු කඹවලින්ද, සමහරු විලංගු වලින්ද, සමහරු දම්වැල් වලින්ද බැඳ දමා ඇතැයි.’’ ඉක්බිති භාග්‍යවතුන් වහන්සේ මේ කාරණය දැන, ඒ වෙලාවේ මේ ගාථා වදාළ සේක –\n\n‘‘යකඩින්, ලීයෙන් හෝ තණවලින් සාදන ලද යම් බැඳීමක් වේද, නුවණැත්තෝ එය ස්ථිර බැම්මක් යැයි නොකියති. මැණික් හා කරාබුවල දැඩි ලෙස ඇලී සිටින සිත් ඇත්තන්ගේ, පුත්‍රයන් කෙරෙහිද, භාර්යාවන් කෙරෙහිද යම් ඇල්මක් වේද, එයයි නුවණැත්තෝ ස්ථිර බැම්මක් යැයි කියති. (එය) පහතට ඇද දමන සුළුය, (පෙනුමෙන්) ලිහිල්ය, මුදා හැරීමට අපහසුය. කිසිදු ඇල්මක් නැත්තාහු, කාමයන්ගෙන් ලැබෙන සැපය අත්හැර, මෙයද සිඳ බිඳ දමා පැවිදි වෙති.’’\n\nපළමුවන වග්ගයයි. එහි උද්දානය – දහරෝ, පුරිසෝ, ජරා, පියං, අත්තානරක්ඛිතෝ; අප්පකා, අඩ්ඩකරණං, මල්ලිකා, යඤ්ඤබන්ධනං යන සූත්‍රයන්ය.",
      "paliTitle": "Bandhanasuttaṃ"
    },
    {
      "number": 122,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tena kho pana samayena bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito bahidvārakoṭṭhake nisinno hoti. Atha kho rājā pasenadi kosalo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Tena kho pana samayena satta ca jaṭilā satta ca nigaṇṭhā satta ca acelakā satta ca ekasāṭakā satta ca paribbājakā parūḷhakacchanakhalomā khārivividhamādāya [khārividhaṃ ādāya (pī.) dī. ni. 1.280 tadaṭṭhakathāpi oloketabbā] bhagavato avidūre atikkamanti. Atha kho rājā pasenadi kosalo uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā dakkhiṇajāṇumaṇḍalaṃ pathaviyaṃ nihantvā yena te satta ca jaṭilā satta ca nigaṇṭhā satta ca acelakā satta ca ekasāṭakā satta ca paribbājakā tenañjaliṃ paṇāmetvā tikkhattuṃ nāmaṃ sāvesi – ‘‘rājāhaṃ, bhante, pasenadi kosalo…pe… rājāhaṃ, bhante, pasenadi kosalo’’ti. Atha kho rājā pasenadi kosalo acirapakkantesu tesu sattasu ca jaṭilesu sattasu ca nigaṇṭhesu sattasu ca acelakesu sattasu ca ekasāṭakesu sattasu ca paribbājakesu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘ye te, bhante, loke arahanto vā arahattamaggaṃ vā samāpannā ete tesaṃ aññatarā’’ti. ‘‘Dujjānaṃ kho etaṃ, mahārāja, tayā gihinā kāmabhoginā puttasambādhasayanaṃ ajjhāvasantena kāsikacandanaṃ paccanubhontena mālāgandhavilepanaṃ dhārayantena jātarūparajataṃ sādiyantena – ‘ime vā arahanto, ime vā arahattamaggaṃ samāpannā’’’ti. ‘‘Saṃvāsena kho, mahārāja, sīlaṃ veditabbaṃ. Tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Saṃvohārena kho, mahārāja, soceyyaṃ veditabbaṃ. Tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Āpadāsu kho, mahārāja, thāmo veditabbo. So ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Sākacchāya, kho, mahārāja, paññā veditabbā. Sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’’ti. ‘‘Acchariyaṃ, bhante, abbhutaṃ bhante! Yāva subhāsitamidaṃ, bhante, bhagavatā – ‘dujjānaṃ kho etaṃ, mahārāja, tayā gihinā kāmabhoginā puttasambādhasayanaṃ ajjhāvasantena kāsikacandanaṃ paccanubhontena mālāgandhavilepanaṃ dhārayantena jātarūparajataṃ sādiyantena – ime vā arahanto, ime vā arahattamaggaṃ samāpannā’ti. Saṃvāsena kho, mahārāja, sīlaṃ veditabbaṃ. Tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Saṃvohārena kho mahārāja, soceyyaṃ veditabbaṃ. Tañca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Āpadāsu kho, mahārāja, thāmo veditabbo. So ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññena. Sākacchāya kho, mahārāja, paññā veditabbā. Sā ca kho dīghena addhunā, na ittaraṃ; manasikarotā, no amanasikarotā; paññavatā, no duppaññenā’’ti. ‘‘Ete, bhante, mama purisā carā ocarakā janapadaṃ ocaritvā āgacchanti. Tehi paṭhamaṃ ociṇṇaṃ ahaṃ pacchā osāpayissāmi [oyāyissāmi (sī.), ohayissāmi (syā. kaṃ.)]. Idāni te, bhante, taṃ rajojallaṃ pavāhetvā sunhātā suvilittā kappitakesamassū odātavatthā [odātavatthavasanā (sī.)] pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricāressantī’’ti. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Na vaṇṇarūpena naro sujāno, Na vissase ittaradassanena; Susaññatānañhi viyañjanena, Asaññatā lokamimaṃ caranti. ‘‘Patirūpako mattikākuṇḍalova, Lohaḍḍhamāsova suvaṇṇachanno; Caranti loke [eke (sī. pī.)] parivārachannā, Anto asuddhā bahi sobhamānā’’ti.",
      "english": "On one occasion, the Blessed One was dwelling in Sāvatthī, at the Eastern Park, in Migāra's mother's mansion. Now at that time, the Blessed One, having risen from meditative seclusion in the evening, was seated outside the gateway. Then King Pasenadi of Kosala approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side.\n\nNow at that time, seven ascetics with matted hair, seven Nigaṇṭhas, seven naked ascetics, seven ascetics wearing a single garment, and seven wandering ascetics, with overgrown armpit hair and nails, carrying their assorted paraphernalia, passed not far from the Blessed One. Then King Pasenadi of Kosala, rising from his seat, arranged his upper robe over one shoulder, knelt down on his right knee, and, facing those seven ascetics with matted hair, seven Nigaṇṭhas, seven naked ascetics, seven ascetics wearing a single garment, and seven wandering ascetics, extended his joined hands in salutation and three times announced his name: \"I am King Pasenadi of Kosala, venerable sirs... I am King Pasenadi of Kosala.\"\n\nThen King Pasenadi of Kosala, not long after those seven ascetics with matted hair, seven Nigaṇṭhas, seven naked ascetics, seven ascetics wearing a single garment, and seven wandering ascetics had departed, approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side.\n\nSeated to one side, King Pasenadi of Kosala said to the Blessed One: \"Venerable sir, these are some of those in the world who are Arahants or have entered the path to Arahantship.\"\n\n\"It is difficult for you to know this, great king, as a householder, one who enjoys sensual pleasures, who lives amidst the congestion of children, who uses Kāsī sandalwood, who wears garlands, perfumes, and ointments, who delights in gold and silver: 'These are Arahants, or these have entered the path to Arahantship.'\"\n\n\"By living together, great king, moral conduct is to be known. And that, indeed, is over a long period, not a short one; with careful attention, not without attention; by one who is wise, not by one who is foolish. By interaction, great king, purity is to be known. And that, indeed, is over a long period, not a short one; with careful attention, not without attention; by one who is wise, not by one who is foolish. In times of adversity, great king, fortitude is to be known. And that, indeed, is over a long period, not a short one; with careful attention, not without attention; by one who is wise, not by one who is foolish. By discussion, great king, wisdom is to be known. And that, indeed, is over a long period, not a short one; with careful attention, not without attention; by one who is wise, not by one who is foolish.\"\n\n\"Wonderful, venerable sir! Amazing, venerable sir! How well-spoken this is by the Blessed One, venerable sir: 'It is difficult for you to know this, great king, as a householder, one who enjoys sensual pleasures, who lives amidst the congestion of children, who uses Kāsī sandalwood, who wears garlands, perfumes, and ointments, who delights in gold and silver: \"These are Arahants, or these have entered the path to Arahantship.\" By living together, great king, moral conduct is to be known. And that, indeed, is over a long period, not a short one; with careful attention, not without attention; by one who is wise, not by one who is foolish. By interaction, great king, purity is to be known. And that, indeed, is over a long period, not a short one; with careful attention, not without attention; by one who is wise, not by one who is foolish. In times of adversity, great king, fortitude is to be known. And that, indeed, is over a long period, not a short one; with careful attention, not without attention; by one who is wise, not by one who is foolish. By discussion, great king, wisdom is to be known. And that, indeed, is over a long period, not a short one; with careful attention, not without attention; by one who is wise, not by one who is foolish.'\"\n\n\"Venerable sir, these men are my spies and scouts who have gone out to reconnoitre the countryside and have now returned. What they first gathered as intelligence, I shall later deal with. Now, venerable sir, having washed off that dirt and grime, having bathed well, anointed themselves, trimmed their hair and beards, and wearing clean white clothes, they will serve me, fully endowed and equipped with the five strands of sensual pleasure.\"\n\nThen the Blessed One, understanding this matter, on that occasion uttered these verses:\n\"One cannot truly know a person by their outward appearance,\nNor should one trust a fleeting glimpse.\nFor the unrestrained wander in this world,\nAdopting the guise of the well-restrained.\n\nLike an imitation clay earring,\nOr a half-penny coin plated with gold,\nSo do some wander in the world, shrouded by their outward appearance,\nImpure within, yet shining outwardly.\"",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර මිගාරමාතුප්‍රාසාද නම් පූර්වාරාමයේ වැඩසිටින සේක. ඒ වේලෙහි භාග්‍යවතුන් වහන්සේ සවස් වේලාවේ පටිසල්ලානයෙන් (තනිව සිටීමෙන්) නැගිට පිටත දොරටු මණ්ඩපයෙහි වැඩ සිටින සේක. එකල්හි කොසොල් රජු වන පසේනදී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙකින් වාඩිවිය. ඒ වේලෙහි සත් දෙනෙක් ජටිලවරුද, සත් දෙනෙක් නිගණ්ඨවරුද, සත් දෙනෙක් අචේලකවරුද, සත් දෙනෙක් එකසළු වතැත්තෝද, සත් දෙනෙක් පිරිවැජියෝද, වැවුණු කිහිලි ලොම් හා නිය ලොම් සහිතව, තම බඩු බාහිරාදිය ගෙන භාග්‍යවතුන් වහන්සේට වැඩි ඈතකින් නොවන තැනකින් ගමන් කරති. එකල්හි කොසොල් රජු වන පසේනදී ආසනයෙන් නැගිට, උතුරුසළුව එක අතකට කොට, දකුණු දණමඬල පොළොවෙහි තබා, ඒ සත් දෙනා වූ ජටිලවරුන්, සත් දෙනා වූ නිගණ්ඨවරුන්, සත් දෙනා වූ අචේලකවරුන්, සත් දෙනා වූ එකසළු වතැත්තන්, සත් දෙනා වූ පිරිවැජියන් සිටි දෙසට දොහොත් නමා, \"ස්වාමීනි, මම කොසොල් පසේනදී රජ වෙමි... ස්වාමීනි, මම කොසොල් පසේනදී රජ වෙමි\" යනුවෙන් තුන් වරක් තම නම දැන්වීය. එකල්හි කොසොල් රජු වන පසේනදී, ඒ සත් දෙනා වූ ජටිලවරුන්, සත් දෙනා වූ නිගණ්ඨවරුන්, සත් දෙනා වූ අචේලකවරුන්, සත් දෙනා වූ එකසළු වතැත්තන්, සත් දෙනා වූ පිරිවැජියන් වැඩි ඈතක් නොගොස් සිටියදී, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙකින් වාඩිවිය.\n\nඑකත්පසෙකින් වාඩි වී සිටි කොසොල් රජු වන පසේනදී භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"ස්වාමීනි, මේ ලෝකයේ යම් අරහත්වයට පත් වූවන් හෝ අරහත් මාර්ගයට පිවිස සිටින්නන් සිටී නම්, මේ අය ඔවුන් අතුරින් එක් කොටසකි.\" \"මහරජ, ගිහියෙකු ලෙස, කාමභෝගීව, දූ දරුවන් සමඟ තදබදව නිදමින්, කසී සුවඳ සඳුන් විඳිමින්, මල්, සුවඳ, විලවුන් දරමින්, රන් රිදී සතුටින් පරිහරණය කරන ඔබට, 'මේ අය රහත් වූවෝ හෝ රහත් මාර්ගයට පිවිස සිටින්නෝය' කියා දැනගැනීම අසීරු කරුණකි. මහරජ, ශීලය දැනගත යුත්තේ (එක් අයෙකු සමඟ) එකට වාසය කිරීමෙනි. එසේ දැනගත යුත්තේ ද දීර්ඝ කාලයක් මුළුල්ලේ මිස, කෙටි කාලයකින් නොවේ; මනාකොට සලකා බලන්නෙකු විසින් මිස, සලකා නොබලන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ. මහරජ, (ඔහුගේ) පාරිශුද්ධත්වය දැනගත යුත්තේ කතාබහ තුළිනි. එසේ දැනගත යුත්තේ ද දීර්ඝ කාලයක් මුළුල්ලේ මිස, කෙටි කාලයකින් නොවේ; මනාකොට සලකා බලන්නෙකු විසින් මිස, සලකා නොබලන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ. මහරජ, (ඔහුගේ) ධෛර්යය දැනගත යුත්තේ විපත්තිවලදීය. එසේ දැනගත යුත්තේ ද දීර්ඝ කාලයක් මුළුල්ලේ මිස, කෙටි කාලයකින් නොවේ; මනාකොට සලකා බලන්නෙකු විසින් මිස, සලකා නොබලන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ. මහරජ, (ඔහුගේ) ප්‍රඥාව දැනගත යුත්තේ සාකච්ඡා කිරීමෙනි. එසේ දැනගත යුත්තේ ද දීර්ඝ කාලයක් මුළුල්ලේ මිස, කෙටි කාලයකින් නොවේ; මනාකොට සලකා බලන්නෙකු විසින් මිස, සලකා නොබලන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ.\"\n\n\"ස්වාමීනි, පුදුමය! ස්වාමීනි, ආශ්චර්‍යයකි! ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් කොතරම් මනාව වදාරණ ලද්දක්ද! 'මහරජ, ගිහියෙකු ලෙස, කාමභෝගීව, දූ දරුවන් සමඟ තදබදව නිදමින්, කසී සුවඳ සඳුන් විඳිමින්, මල්, සුවඳ, විලවුන් දරමින්, රන් රිදී සතුටින් පරිහරණය කරන ඔබට, 'මේ අය රහත් වූවෝ හෝ රහත් මාර්ගයට පිවිස සිටින්නෝය' කියා දැනගැනීම අසීරු කරුණකි' යනුවෙන්. මහරජ, ශීලය දැනගත යුත්තේ (එක් අයෙකු සමඟ) එකට වාසය කිරීමෙනි. එසේ දැනගත යුත්තේ ද දීර්ඝ කාලයක් මුළුල්ලේ මිස, කෙටි කාලයකින් නොවේ; මනාකොට සලකා බලන්නෙකු විසින් මිස, සලකා නොබලන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ. මහරජ, (ඔහුගේ) පාරිශුද්ධත්වය දැනගත යුත්තේ කතාබහ තුළිනි. එසේ දැනගත යුත්තේ ද දීර්ඝ කාලයක් මුළුල්ලේ මිස, කෙටි කාලයකින් නොවේ; මනාකොට සලකා බලන්නෙකු විසින් මිස, සලකා නොබලන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ. මහරජ, (ඔහුගේ) ධෛර්යය දැනගත යුත්තේ විපත්තිවලදීය. එසේ දැනගත යුත්තේ ද දීර්ඝ කාලයක් මුළුල්ලේ මිස, කෙටි කාලයකින් නොවේ; මනාකොට සලකා බලන්නෙකු විසින් මිස, සලකා නොබලන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ. මහරජ, (ඔහුගේ) ප්‍රඥාව දැනගත යුත්තේ සාකච්ඡා කිරීමෙනි. එසේ දැනගත යුත්තේ ද දීර්ඝ කාලයක් මුළුල්ලේ මිස, කෙටි කාලයකින් නොවේ; මනාකොට සලකා බලන්නෙකු විසින් මිස, සලකා නොබලන්නෙකු විසින් නොවේ; ප්‍රඥාවන්තයෙකු විසින් මිස, දුෂ්ප්‍රඥයෙකු විසින් නොවේ.\" \"ස්වාමීනි, මේ අය නම් මාගේ ඔත්තුකරුවන් වන පුරුෂයෝය. ඔවුහු ජනපදයෙහි ඔත්තු බලා පැමිණෙති. ඔවුන් මුලින්ම ගෙන එන තොරතුරු මා පසුව විමසා බලමි. දැන් ස්වාමීනි, ඔවුහු ඒ දූවිලි හා මලකඩ සෝදා හැර, මනාකොට ස්නානය කොට, මනාකොට ආලේප ගල්වා, කෙස් රැවුල් කපා, පිරිසිදු වස්ත්‍ර ඇඳගෙන, පංචකාම සම්පත්තියෙන් සමන්විතව විනෝද වනු ඇත.\"\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ මේ අරුත දැන, ඒ වේලෙහි මේ ගාථා වදාළ සේක:\nමිනිසෙකු ඔහුගේ රූපයෙන් හෝ බාහිර ලක්ෂණවලින් පහසුවෙන් දැනගත නොහැකිය. කෙටි කලක් දැකීමෙන් විශ්වාස නොකළ යුතුය. මක්නිසාද යත්, මනාව සංවර වූවන්ගේ ලක්ෂණ සහිතව, අසංවර වූවෝද මේ ලෝකයෙහි හැසිරෙති.\n\nමැටියෙන් කළ කරාබුවක් හෝ රනින් ආවරණය කරන ලද තඹ කාසියක් වැනි වූ, ඇතුළතින් අපිරිසිදු වුවද, බාහිරින් බබළමින්, (ඔවුහු) වෙස් වලාගෙන ලෝකයෙහි හැසිරෙති.",
      "paliTitle": "Sattajaṭilasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 123,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena pañcannaṃ rājūnaṃ pasenadipamukhānaṃ pañcahi kāmaguṇehi samappitānaṃ samaṅgībhūtānaṃ paricārayamānānaṃ ayamantarākathā udapādi – ‘‘kiṃ nu kho kāmānaṃ agga’’nti? Tatrekacce [tatreke (sī. pī.)] evamāhaṃsu – ‘‘rūpā kāmānaṃ agga’’nti. Ekacce evamāhaṃsu – ‘‘saddā kāmānaṃ agga’’nti. Ekacce evamāhaṃsu – ‘‘gandhā kāmānaṃ agga’’nti. Ekacce evamāhaṃsu – ‘‘rasā kāmānaṃ agga’’nti. Ekacce evamāhaṃsu – ‘‘phoṭṭhabbā kāmānaṃ agga’’nti. Yato kho te rājāno nāsakkhiṃsu aññamaññaṃ saññāpetuṃ. Atha kho rājā pasenadi kosalo te rājāno etadavoca – ‘‘āyāma, mārisā, yena bhagavā tenupasaṅkamissāma; upasaṅkamitvā bhagavantaṃ etamatthaṃ paṭipucchissāma. Yathā no bhagavā byākarissati tathā naṃ dhāressāmā’’ti [dhāreyyāmāti (sī. syā. kaṃ. pī.)]. ‘‘Evaṃ, mārisā’’ti kho te rājāno rañño pasenadissa kosalassa paccassosuṃ. Atha kho te pañca rājāno pasenadipamukhā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘idha, bhante, amhākaṃ pañcannaṃ rājūnaṃ pañcahi kāmaguṇehi samappitānaṃ samaṅgībhūtānaṃ paricārayamānānaṃ ayamantarākathā udapādi – ‘kiṃ nu kho kāmānaṃ agga’nti? Ekacce evamāhaṃsu – ‘rūpā kāmānaṃ agga’nti. Ekacce evamāhaṃsu – ‘saddā kāmānaṃ agga’nti. Ekacce evamāhaṃsu – ‘gandhā kāmānaṃ agga’nti. Ekacce evamāhaṃsu – ‘rasā kāmānaṃ agga’nti. Ekacce evamāhaṃsu – ‘phoṭṭhabbā kāmānaṃ agga’nti. Kiṃ nu kho, bhante, kāmānaṃ agga’’nti? ‘‘Manāpapariyantaṃ khvāhaṃ, mahārāja, pañcasu kāmaguṇesu agganti vadāmi. Teva [te ca (sī. pī. ka.), ye ca (syā. kaṃ.)], mahārāja, rūpā ekaccassa manāpā honti, teva [te ca (sī. pī. ka.)] rūpā ekaccassa amanāpā honti. Yehi ca yo rūpehi attamano hoti paripuṇṇasaṅkappo, so tehi rūpehi aññaṃ rūpaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Te tassa rūpā paramā honti. Te tassa rūpā anuttarā honti. ‘‘Teva, mahārāja, saddā ekaccassa manāpā honti, teva saddā ekaccassa amanāpā honti. Yehi ca yo saddehi attamano hoti paripuṇṇasaṅkappo, so tehi saddehi aññaṃ saddaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Te tassa saddā paramā honti. Te tassa saddā anuttarā honti. ‘‘Teva, mahārāja, gandhā ekaccassa manāpā honti, teva gandhā ekaccassa amanāpā honti. Yehi ca yo gandhehi attamano hoti paripuṇṇasaṅkappo, so tehi gandhehi aññaṃ gandhaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Te tassa gandhā paramā honti. Te tassa gandhā anuttarā honti. ‘‘Teva, mahārāja, rasā ekaccassa manāpā honti, teva rasā ekaccassa amanāpā honti. Yehi ca yo rasehi attamano hoti paripuṇṇasaṅkappo, so tehi rasehi aññaṃ rasaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Te tassa rasā paramā honti. Te tassa rasā anuttarā honti. ‘‘Teva, mahārāja, phoṭṭhabbā ekaccassa manāpā honti, teva phoṭṭhabbā ekaccassa amanāpā honti. Yehi ca yo phoṭṭhabbehi attamano hoti paripuṇṇasaṅkappo, so tehi phoṭṭhabbehi aññaṃ phoṭṭhabbaṃ uttaritaraṃ vā paṇītataraṃ vā na pattheti. Te tassa phoṭṭhabbā paramā honti. Te tassa phoṭṭhabbā anuttarā hontī’’ti. Tena kho pana samayena candanaṅgaliko upāsako tassaṃ parisāyaṃ nisinno hoti. Atha kho candanaṅgaliko upāsako uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘paṭibhāti maṃ bhagavā, paṭibhāti maṃ sugatā’’ti. ‘‘Paṭibhātu taṃ candanaṅgalikā’’ti bhagavā avoca. Atha kho candanaṅgaliko upāsako bhagavato sammukhā tadanurūpāya gāthāya abhitthavi – ‘‘Padumaṃ yathā kokanadaṃ sugandhaṃ, Pāto siyā phullamavītagandhaṃ; Aṅgīrasaṃ passa virocamānaṃ, Tapantamādiccamivantalikkhe’’ti. Atha kho te pañca rājāno candanaṅgalikaṃ upāsakaṃ pañcahi uttarāsaṅgehi acchādesuṃ. Atha kho candanaṅgaliko upāsako tehi pañcahi uttarāsaṅgehi bhagavantaṃ acchādesīti.",
      "english": "Occasion at Sāvatthī. Now at that time, five kings, with Pasenadi at their head, who were indulging in enjoyment, fully furnished with the five strands of sensual pleasure, and in harmonious agreement, engaged in this discussion: \"Indeed, what is the best of sensual pleasures?\" Among them, some said, \"Forms are the best of sensual pleasures.\" Some said, \"Sounds are the best of sensual pleasures.\" Some said, \"Odours are the best of sensual pleasures.\" Some said, \"Tastes are the best of sensual pleasures.\" Some said, \"Tangibles are the best of sensual pleasures.\" Since these kings were unable to convince each other, then King Pasenadi of Kosala said to those kings, \"Come, sirs, let us approach the Blessed One; having approached, we shall ask the Blessed One about this matter. Whatever the Blessed One explains to us, that we shall remember.\" \"Yes, sirs,\" those kings replied to King Pasenadi of Kosala. Then those five kings, with Pasenadi at their head, approached the Blessed One; having approached and greeted the Blessed One, they sat down to one side. Seated to one side, King Pasenadi of Kosala said to the Blessed One, \"Here, Venerable Sir, while we five kings were enjoying ourselves, fully furnished with the five strands of sensual pleasure, and in harmonious agreement, this discussion arose among us: 'Indeed, what is the best of sensual pleasures?' Some said, 'Forms are the best of sensual pleasures.' Some said, 'Sounds are the best of sensual pleasures.' Some said, 'Odours are the best of sensual pleasures.' Some said, 'Tastes are the best of sensual pleasures.' Some said, 'Tangibles are the best of sensual pleasures.' Indeed, Venerable Sir, what is the best of sensual pleasures?\"\n\n\"Great King, I declare that the agreeable is the best among the five strands of sensual pleasure. Great King, the very same forms are agreeable to some, and those very same forms are disagreeable to others. With whichever forms one is content and whose aspiration is fulfilled, with those forms, one does not long for any other form that is superior or more exquisite. Those forms are supreme for that person. Those forms are unsurpassed for that person.\n\n\"Great King, the very same sounds are agreeable to some, and those very same sounds are disagreeable to others. With whichever sounds one is content and whose aspiration is fulfilled, with those sounds, one does not long for any other sound that is superior or more exquisite. Those sounds are supreme for that person. Those sounds are unsurpassed for that person.\n\n\"Great King, the very same odours are agreeable to some, and those very same odours are disagreeable to others. With whichever odours one is content and whose aspiration is fulfilled, with those odours, one does not long for any other odour that is superior or more exquisite. Those odours are supreme for that person. Those odours are unsurpassed for that person.\n\n\"Great King, the very same tastes are agreeable to some, and those very same tastes are disagreeable to others. With whichever tastes one is content and whose aspiration is fulfilled, with those tastes, one does not long for any other taste that is superior or more exquisite. Those tastes are supreme for that person. Those tastes are unsurpassed for that person.\n\n\"Great King, the very same tangibles are agreeable to some, and those very same tangibles are disagreeable to others. With whichever tangibles one is content and whose aspiration is fulfilled, with those tangibles, one does not long for any other tangible that is superior or more exquisite. Those tangibles are supreme for that person. Those tangibles are unsurpassed for that person.\"\n\nNow at that time, Candanaṅgalika, a lay follower, was seated in that assembly. Then the lay follower Candanaṅgalika rose from his seat, arranged his upper robe over one shoulder, and raising his joined hands towards the Blessed One, said to the Blessed One, \"I understand, Blessed One! I understand, Fortunate One!\" \"Understand, Candanaṅgalika,\" said the Blessed One. Then the lay follower Candanaṅgalika, in the presence of the Blessed One, praised him with a verse appropriate to the occasion: \"Just as a fragrant red lotus, fully bloomed at dawn, its fragrance undiminished, so behold the Radiant One shining forth, like the blazing sun in the sky.\"\n\nThen those five kings presented the lay follower Candanaṅgalika with five upper robes. Then the lay follower Candanaṅgalika presented those five upper robes to the Blessed One.",
      "sinhala": "සේවතථී විහාරය කේන්ද්‍ර කොට. එවිට එක් සමයෙක පසේනදී ප්‍රමුඛ රජවරුන් පස් දෙනෙකුට, පස්කම් ගුණයන්ගෙන් මනා ලෙස සන්තර්පණය වී, එකට එක් වී, ඒවා විඳිමින් සිටියදී මේ සාකච්ඡාව ඇතිවිය: \"කාමයන් අතරින් අග්‍රතම දේ කුමක්ද?\" යනුවෙනි. එහි ඇතැමෙක් \"රූප කාමයන් අතරින් අග්‍රය\" කියාය. ඇතැමෙක් \"ශබ්ද කාමයන් අතරින් අග්‍රය\" කියාය. ඇතැමෙක් \"ගන්ධ කාමයන් අතරින් අග්‍රය\" කියාය. ඇතැමෙක් \"රස කාමයන් අතරින් අග්‍රය\" කියාය. ඇතැමෙක් \"ස්පර්ශ කාමයන් අතරින් අග්‍රය\" කියාය. ඒ රජවරුන්ට එකිනෙකාට එකඟතාවයකට පැමිණීමට නොහැකි වූ කල්හි, එවිට කොසොල් පසේනදී මහරජු ඒ රජවරුන්ට මෙසේ පැවසීය: \"එම්බල පින්වත්නි, එන්න, අපි භාග්‍යවතුන් වහන්සේ වෙත එළඹෙමු; එළඹ, භාග්‍යවතුන් වහන්සේගෙන් මේ කාරණය විමසමු. භාග්‍යවතුන් වහන්සේ අපට කෙසේ විස්තර කරන්නේද, ඒ ආකාරයෙන් අපි එය පිළිගනිමු.\" \"එසේය, පින්වත්නි\" කියා ඒ රජවරු කොසොල් පසේනදී රජුට පිළිතුරු දුන්හ. එවිට පසේනදී ප්‍රමුඛ ඒ රජවරු පස් දෙනා භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට ආචාර කර, එකත්පස්ව වාඩි වූහ.\n\nඑකත්පස්ව වාඩි වී සිටි කොසොල් පසේනදී රජු භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භන්තේ, මෙහිදී අප පස් දෙනා වූ රජවරුන්ට, පස්කම් ගුණයන්ගෙන් මනා ලෙස සන්තර්පණය වී, එකට එක් වී, ඒවා විඳිමින් සිටියදී මේ සාකච්ඡාව ඇතිවිය: 'කාමයන් අතරින් අග්‍රතම දේ කුමක්ද?' යනුවෙනි. ඇතැමෙක් 'රූප කාමයන් අතරින් අග්‍රය' කියාය. ඇතැමෙක් 'ශබ්ද කාමයන් අතරින් අග්‍රය' කියාය. ඇතැමෙක් 'ගන්ධ කාමයන් අතරින් අග්‍රය' කියාය. ඇතැමෙක් 'රස කාමයන් අතරින් අග්‍රය' කියාය. ඇතැමෙක් 'ස්පර්ශ කාමයන් අතරින් අග්‍රය' කියාය. භන්තේ, කාමයන් අතරින් අග්‍රතම දේ කුමක්ද?\"\n\n\"මහරජ, පස්කම් ගුණයන් අතරින් මා අග්‍ර යැයි පවසන්නේ මනෝරම්‍ය භාවයෙහි අවසානයයි. මහරජ, ඇතැම් රූප සමහරුන්ට මනෝරම්‍ය වෙයි, එම රූපම තවත් සමහරුන්ට අමනෝරම්‍ය වෙයි. යමෙක් යම් රූපයන්ගෙන් සතුටු සිත් ඇතිව, සම්පූර්ණ අධිෂ්ඨානයෙන් යුක්තව සිටින්නේද, හෙතෙම ඒ රූපයන්ට වඩා උසස් හෝ ප්‍රණීත වෙනත් රූපයක් නොපතයි. ඒ රූප ඔහුට පරම වෙයි. ඒ රූප ඔහුට අනුත්තර වෙයි.\n\nමහරජ, ඇතැම් ශබ්ද සමහරුන්ට මනෝරම්‍ය වෙයි, එම ශබ්දම තවත් සමහරුන්ට අමනෝරම්‍ය වෙයි. යමෙක් යම් ශබ්දයන්ගෙන් සතුටු සිත් ඇතිව, සම්පූර්ණ අධිෂ්ඨානයෙන් යුක්තව සිටින්නේද, හෙතෙම ඒ ශබ්දයන්ට වඩා උසස් හෝ ප්‍රණීත වෙනත් ශබ්දයක් නොපතයි. ඒ ශබ්ද ඔහුට පරම වෙයි. ඒ ශබ්ද ඔහුට අනුත්තර වෙයි.\n\nමහරජ, ඇතැම් ගන්ධයන් සමහරුන්ට මනෝරම්‍ය වෙයි, එම ගන්ධයන්ම තවත් සමහරුන්ට අමනෝරම්‍ය වෙයි. යමෙක් යම් ගන්ධයන්ගෙන් සතුටු සිත් ඇතිව, සම්පූර්ණ අධිෂ්ඨානයෙන් යුක්තව සිටින්නේද, හෙතෙම ඒ ගන්ධයන්ට වඩා උසස් හෝ ප්‍රණීත වෙනත් ගන්ධයක් නොපතයි. ඒ ගන්ධයන් ඔහුට පරම වෙයි. ඒ ගන්ධයන් ඔහුට අනුත්තර වෙයි.\n\nමහරජ, ඇතැම් රසයන් සමහරුන්ට මනෝරම්‍ය වෙයි, එම රසයන්ම තවත් සමහරුන්ට අමනෝරම්‍ය වෙයි. යමෙක් යම් රසයන්ගෙන් සතුටු සිත් ඇතිව, සම්පූර්ණ අධිෂ්ඨානයෙන් යුක්තව සිටින්නේද, හෙතෙම ඒ රසයන්ට වඩා උසස් හෝ ප්‍රණීත වෙනත් රසයක් නොපතයි. ඒ රසයන් ඔහුට පරම වෙයි. ඒ රසයන් ඔහුට අනුත්තර වෙයි.\n\nමහරජ, ඇතැම් ස්පර්ශයන් සමහරුන්ට මනෝරම්‍ය වෙයි, එම ස්පර්ශයන්ම තවත් සමහරුන්ට අමනෝරම්‍ය වෙයි. යමෙක් යම් ස්පර්ශයන්ගෙන් සතුටු සිත් ඇතිව, සම්පූර්ණ අධිෂ්ඨානයෙන් යුක්තව සිටින්නේද, හෙතෙම ඒ ස්පර්ශයන්ට වඩා උසස් හෝ ප්‍රණීත වෙනත් ස්පර්ශයක් නොපතයි. ඒ ස්පර්ශයන් ඔහුට පරම වෙයි. ඒ ස්පර්ශයන් ඔහුට අනුත්තර වෙයි.\"\n\nඑවිට චන්දනාංගලික උපාසකයා ඒ පිරිස අතර වාඩි වී සිටියේය. එවිට චන්දනාංගලික උපාසකයා හුනස්නෙන් නැගිට, එක් උරහිසක් වැසෙන සේ උතුරුසළුව පොරවා, භාග්‍යවතුන් වහන්සේ දෙසට දොහොත් නමාගෙන, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භාග්‍යවතුන් වහන්ස, මට වැටහේ, සුගතයන් වහන්ස, මට වැටහේ.\" \"චන්දනාංගලිකය, ඔබට වැටහේවා!\" යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\nඑවිට චන්දනාංගලික උපාසකයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ ඒ හා සමාන ගාථාවකින් මෙසේ ප්‍රශංසා කළේය: \"සුවඳවත් රත් නෙළුමක් උදෑසන පිපී, එහි සුවඳ නොනැසී පවතින්නාක් මෙන්, අහසෙහි පායන තපස් ගුණ ඇති සූර්යයා මෙන්, අංගීරසයන් වහන්සේ විරාජමානව වැඩසිටින අයුරු බලන්න.\"\n\nඑවිට ඒ රජවරු පස් දෙනා චන්දනාංගලික උපාසකයාට පස් උතුරුසළු පූජා කළහ. එවිට චන්දනාංගලික උපාසකයා ඒ පස් උතුරුසළුවලින් භාග්‍යවතුන් වහන්සේට ආවරණය කළේය.",
      "paliTitle": "Pañcarājasuttaṃ"
    },
    {
      "number": 124,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena rājā pasenadi kosalo doṇapākakuraṃ [doṇapākasudaṃ (sī.), doṇapākaṃ sudaṃ (pī.)] bhuñjati. Atha kho rājā pasenadi kosalo bhuttāvī mahassāsī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Atha kho bhagavā rājānaṃ pasenadiṃ kosalaṃ bhuttāviṃ mahassāsiṃ viditvā tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Manujassa sadā satīmato, Mattaṃ jānato laddhabhojane; Tanukassa [tanu tassa (sī. pī.)] bhavanti vedanā, Saṇikaṃ jīrati āyupālaya’’nti. Tena kho pana samayena sudassano māṇavo rañño pasenadissa kosalassa piṭṭhito ṭhito hoti. Atha kho rājā pasenadi kosalo sudassanaṃ māṇavaṃ āmantesi – ‘‘ehi tvaṃ, tāta sudassana, bhagavato santike imaṃ gāthaṃ pariyāpuṇitvā mama bhattābhihāre (bhattābhihāre) [( ) sī. syā. kaṃ. pī. potthakesu natthi] bhāsa. Ahañca te devasikaṃ kahāpaṇasataṃ (kahāpaṇasataṃ) [( ) sī. syā. kaṃ. potthakesu natthi] niccaṃ bhikkhaṃ pavattayissāmī’’ti. ‘‘Evaṃ devā’’ti kho sudassano māṇavo rañño pasenadissa kosalassa paṭissutvā bhagavato santike imaṃ gāthaṃ pariyāpuṇitvā rañño pasenadissa kosalassa bhattābhihāre sudaṃ bhāsati – ‘‘Manujassa sadā satīmato, Mattaṃ jānato laddhabhojane; Tanukassa bhavanti vedanā, Saṇikaṃ jīrati āyupālaya’’nti. Atha kho rājā pasenadi kosalo anupubbena nāḷikodanaparamatāya [nāḷikodanamattāya (ka.)] saṇṭhāsi. Atha kho rājā pasenadi kosalo aparena samayena susallikhitagatto pāṇinā gattāni anumajjanto tāyaṃ velāyaṃ imaṃ udānaṃ udānesi – ‘‘ubhayena vata maṃ so bhagavā atthena anukampi – diṭṭhadhammikena ceva atthena samparāyikena cā’’ti.",
      "english": "At Sāvatthī. Now at that time, King Pasenadi of Kosala was eating a very large meal. Then King Pasenadi of Kosala, having eaten and still breathing heavily, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Then the Blessed One, knowing that King Pasenadi of Kosala had eaten and was breathing heavily, on that occasion recited this verse:\n\n“For a person always mindful, knowing moderation in the food he has received, the bodily feelings become slight, and he ages slowly, protecting his life.”\n\nNow at that time, Sudassana the young brahmin stood behind King Pasenadi of Kosala. Then King Pasenadi of Kosala addressed Sudassana the young brahmin: “Come, my dear Sudassana, learn this verse from the Blessed One, and recite it at my mealtime. And I will provide you with a daily alms-offering of a hundred *kahāpaṇas* continuously.” “Yes, your majesty,” Sudassana the young brahmin replied to King Pasenadi of Kosala. Having learned this verse from the Blessed One, he then recited it at King Pasenadi of Kosala’s mealtime: “For a person always mindful, knowing moderation in the food he has received, the bodily feelings become slight, and he ages slowly, protecting his life.”\n\nThen King Pasenadi of Kosala gradually became accustomed to taking only a *nāḷi* of rice. Then, at a later time, King Pasenadi of Kosala, with his body very much thinned down, stroked his limbs with his hands, and on that occasion he uttered this inspired utterance: “Indeed, the Blessed One has had compassion for me with a benefit in both ways: with a benefit relating to this present life, and with a benefit relating to future lives.”",
      "sinhala": "සැවැත් නුවරදී සිදු වූවකි. එසමයෙහි කෝසල රජු වූ පසේනදී මහරජතුමා, දෝණයක් බත් වළඳමින් සිටියේය. ඉක්බිති කෝසල රජු වූ පසේනදී මහරජතුමා, අනුභව කොට හමාර වූයේ, මහත් වූ හුස්ම ඉහළ පහළ හෙළමින්, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. එසේ පැමිණ, භාග්‍යවතුන් වහන්සේට ආදරයෙන් වැඳ, එකත්පසෙක වාඩි විය. එකල්හි භාග්‍යවතුන් වහන්සේ, කෝසල රජු වූ පසේනදී මහරජතුමා, අනුභව කොට හමාර වූයේ මහත් වූ හුස්ම ඉහළ පහළ හෙළමින් සිටින බව දැන, ඒ මොහොතෙහි මේ ගාථාව වදාළ සේක:\n\"යම් මිනිසෙක් නිරතුරු සිහි ඇත්තේ ද, ලැබූ භෝජනයෙහි මාත්‍රාව දන්නේ ද, (එබඳු) ඔහුට ශාරීරික වේදනා අඩුවේ. ආයුෂ රැකෙන අතර, එය සෙමින් පිරිහී යයි.\"\n\nඑසමයෙහි, සුදස්සන නම් මානවකයා, කෝසල රජු වූ පසේනදී මහරජතුමාගේ පිටුපස සිටගෙන සිටියේය. ඉක්බිති කෝසල රජු වූ පසේනදී මහරජතුමා, සුදස්සන මානවකයා අමතා මෙසේ කීවේය: \"දරුව, සුදස්සන, එන්න. ඔබ භාග්‍යවතුන් වහන්සේ සමීපයට ගොස්, මේ ගාථාව ඉගෙන ගෙන, මාගේ භෝජන වළඳන වේලාවන්හිදී මෙය කියන්න. මා ඔබට දිනපතාම ආහාර සඳහා කහවණු සියයක් නිරන්තරයෙන්ම ලබා දෙන්නෙමි.\" \"එසේය, දෙවිඳුනි!\" යි සුදස්සන මානවකයා කෝසල රජු වූ පසේනදී මහරජතුමාට පිළිතුරු දී, භාග්‍යවතුන් වහන්සේ සමීපයට ගොස්, මේ ගාථාව ඉගෙන ගෙන, කෝසල රජු වූ පසේනදී මහරජතුමාගේ භෝජන වළඳන වේලාවන්හිදී එය නිතර කීවේය: \"යම් මිනිසෙක් නිරතුරු සිහි ඇත්තේ ද, ලැබූ භෝජනයෙහි මාත්‍රාව දන්නේ ද, (එබඳු) ඔහුට ශාරීරික වේදනා අඩුවේ. ආයුෂ රැකෙන අතර, එය සෙමින් පිරිහී යයි.\"\n\nඉක්බිති කෝසල රජු වූ පසේනදී මහරජතුමා, ක්‍රමානුකූලව, නාළියක් බත් පමණක් වළඳන තරමට සීමා විය. ඉක්බිති කෝසල රජු වූ පසේනදී මහරජතුමා, පසු කලෙක, මනාව සනීප වූ ශරීර ඇත්තේ, අතින් සිය ශරීරය පිරිමදිමින්, ඒ මොහොතෙහි මේ උදානය ප්‍රකාශ කළේය: \"අහෝ! භාග්‍යවතුන් වහන්සේ මා කෙරෙහි දෙයාකාරයකින්ම අනුකම්පා කළ සේක – මේ ආත්මභාවයට අයත් අර්ථයෙන්ද, පරලොවට අයත් අර්ථයෙන්ද!\"",
      "paliTitle": "Doṇapākasuttaṃ"
    },
    {
      "number": 125,
      "pali": "Sāvatthinidānaṃ. Atha kho rājā māgadho ajātasattu vedehiputto caturaṅginiṃ senaṃ sannayhitvā rājānaṃ pasenadiṃ kosalaṃ abbhuyyāsi yena kāsi. Assosi kho rājā pasenadi kosalo – ‘‘rājā kira māgadho ajātasattu vedehiputto caturaṅginiṃ senaṃ sannayhitvā mamaṃ abbhuyyāto yena kāsī’’ti. Atha kho rājā pasenadi kosalo caturaṅginiṃ senaṃ sannayhitvā rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ paccuyyāsi yena kāsi. Atha kho rājā ca māgadho ajātasattu vedehiputto rājā ca pasenadi kosalo saṅgāmesuṃ. Tasmiṃ kho pana saṅgāme rājā māgadho ajātasattu vedehiputto rājānaṃ pasenadiṃ kosalaṃ parājesi. Parājito ca rājā pasenadi kosalo sakameva [saṅgāmā (ka.)] rājadhāniṃ sāvatthiṃ paccuyyāsi [pāyāsi (sī. pī.)]. Atha kho sambahulā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisiṃsu. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘Idha, bhante, rājā māgadho ajātasattu vedehiputto caturaṅginiṃ senaṃ sannayhitvā rājānaṃ pasenadiṃ kosalaṃ abbhuyyāsi yena kāsi. Assosi kho, bhante, rājā pasenadi kosalo – ‘rājā kira māgadho ajātasattu vedehiputto caturaṅginiṃ senaṃ sannayhitvā mamaṃ abbhuyyāto yena kāsī’ti. Atha kho, bhante, rājā pasenadi kosalo caturaṅginiṃ senaṃ sannayhitvā rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ paccuyyāsi yena kāsi. Atha kho, bhante, rājā ca māgadho ajātasattu vedehiputto rājā ca pasenadi kosalo saṅgāmesuṃ. Tasmiṃ kho pana, bhante, saṅgāme rājā māgadho ajātasattu vedehiputto rājānaṃ pasenadiṃ kosalaṃ parājesi. Parājito ca, bhante, rājā pasenadi kosalo sakameva rājadhāniṃ sāvatthiṃ paccuyyāsī’’ti. ‘‘Rājā, bhikkhave, māgadho ajātasattu vedehiputto pāpamitto pāpasahāyo pāpasampavaṅko; rājā ca kho, bhikkhave, pasenadi kosalo kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko. Ajjeva [ajjatañca (sī. pī.), ajjevaṃ (syā. kaṃ.)], bhikkhave, rājā pasenadi kosalo imaṃ rattiṃ dukkhaṃ seti parājito’’ti. Idamavoca…pe… ‘‘Jayaṃ veraṃ pasavati, dukkhaṃ seti parājito; Upasanto sukhaṃ seti, hitvā jayaparājaya’’nti.",
      "english": "At Sāvatthī. Then King Ajātasattu, son of Vaidehī, the Magadhan king, having mustered his fourfold army, advanced upon King Pasenadi of Kosala, towards Kāsī. King Pasenadi of Kosala heard, \"Indeed, King Ajātasattu, son of Vaidehī, the Magadhan king, having mustered his fourfold army, has advanced upon me towards Kāsī.\" Then King Pasenadi of Kosala, having mustered his fourfold army, went forth to meet King Ajātasattu, son of Vaidehī, the Magadhan king, towards Kāsī. Then King Ajātasattu, son of Vaidehī, the Magadhan king, and King Pasenadi of Kosala engaged in battle. In that battle, King Ajātasattu, son of Vaidehī, the Magadhan king, defeated King Pasenadi of Kosala. And King Pasenadi of Kosala, being defeated, retreated to his own royal capital, Sāvatthī.\n\nThen, in the morning, many bhikkhus, having dressed and taken their bowls and robes, entered Sāvatthī for alms. Having wandered for alms in Sāvatthī, after their meal, they returned from their alms round and approached the Blessed One; having approached and paid homage to the Blessed One, they sat down to one side. Seated to one side, those bhikkhus said to the Blessed One: \"Here, Venerable Sir, King Ajātasattu, son of Vaidehī, the Magadhan king, having mustered his fourfold army, advanced upon King Pasenadi of Kosala, towards Kāsī. And, Venerable Sir, King Pasenadi of Kosala heard, 'Indeed, King Ajātasattu, son of Vaidehī, the Magadhan king, having mustered his fourfold army, has advanced upon me towards Kāsī.' Then, Venerable Sir, King Pasenadi of Kosala, having mustered his fourfold army, went forth to meet King Ajātasattu, son of Vaidehī, the Magadhan king, towards Kāsī. Then, Venerable Sir, King Ajātasattu, son of Vaidehī, the Magadhan king, and King Pasenadi of Kosala engaged in battle. In that battle, Venerable Sir, King Ajātasattu, son of Vaidehī, the Magadhan king, defeated King Pasenadi of Kosala. And, Venerable Sir, King Pasenadi of Kosala, being defeated, retreated to his own royal capital, Sāvatthī.\"\n\n\"Monks, King Ajātasattu, son of Vaidehī, the Magadhan king, has evil friends, evil companions, and is inclined towards evil. But, monks, King Pasenadi of Kosala has good friends, good companions, and is inclined towards good. Today, monks, King Pasenadi of Kosala, being defeated, will sleep miserably this night.\"\n\nVictory gives rise to enmity; the defeated one sleeps in suffering. The peaceful one sleeps happily, having given up both victory and defeat.",
      "sinhala": "සැවැත්නුවරදී සිදු වූවකි.\n\nඑකල්හි වේදේහි පුත් මගධ අජාතසත්තු රජු සිව් රඟ සෙනඟ සූදානම් කරගෙන, කෝසල රජු වූ පසේනදි රජු වෙතට, කාසිය අරභයා යුද්ධයට පිටත් විය. කෝසල පසේනදි රජුට අසන්නට ලැබුණි: \"වේදේහි පුත් මගධ අජාතසත්තු රජු සිව් රඟ සෙනඟ සූදානම් කරගෙන, මා අරභයා කාසිය වෙතට යුද්ධයට පිටත්ව ඇතැයි.\" එකල්හි කෝසල පසේනදි රජු ද සිව් රඟ සෙනඟ සූදානම් කරගෙන, වේදේහි පුත් මගධ අජාතසත්තු රජු වෙතට, කාසිය අරභයා ප්‍රතිවිරුද්ධව යුද්ධයට පිටත් විය. එකල්හි වේදේහි පුත් මගධ අජාතසත්තු රජු ද, කෝසල පසේනදි රජු ද යුද වැදුණහ. ඒ යුද්ධයේදී වේදේහි පුත් මගධ අජාතසත්තු රජු, කෝසල පසේනදි රජු පරාජය කළේය. පරාජය වූ කෝසල පසේනදි රජු තමාගේම රාජධානිය වූ සැවැත්නුවර වෙත ආපසු ගියේය.\n\nඑකල්හි බොහෝ භික්ෂූහු පෙරවරුවෙහි සිවුරු පොරවා, පාත්‍ර සිවුරු ද ගෙන, සැවැත්නුවරට පිඬු සිඟා පිවිසියාහුය. සැවැත්නුවර පිඬු සිඟා වැඩ, දහවල් ආහාරයෙන් පසු පිණ්ඩපාතයෙන් ආපසු පැමිණ, භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹියාහුය; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙකින් වැඩහුන්හ. එකත්පසෙකින් වැඩහුන් ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ කීවාහුය: \"වහන්ස, මෙහිදී වේදේහි පුත් මගධ අජාතසත්තු රජු සිව් රඟ සෙනඟ සූදානම් කරගෙන, කෝසල පසේනදි රජු වෙතට, කාසිය අරභයා යුද්ධයට පිටත් විය. වහන්ස, කෝසල පසේනදි රජුට අසන්නට ලැබුණි: 'වේදේහි පුත් මගධ අජාතසත්තු රජු සිව් රඟ සෙනඟ සූදානම් කරගෙන, මා අරභයා කාසිය වෙතට යුද්ධයට පිටත්ව ඇතැයි.' වහන්ස, එකල්හි කෝසල පසේනදි රජු ද සිව් රඟ සෙනඟ සූදානම් කරගෙන, වේදේහි පුත් මගධ අජාතසත්තු රජු වෙතට, කාසිය අරභයා ප්‍රතිවිරුද්ධව යුද්ධයට පිටත් විය. වහන්ස, එකල්හි වේදේහි පුත් මගධ අජාතසත්තු රජු ද, කෝසල පසේනදි රජු ද යුද වැදුණහ. වහන්ස, ඒ යුද්ධයේදී වේදේහි පුත් මගධ අජාතසත්තු රජු, කෝසල පසේනදි රජු පරාජය කළේය. වහන්ස, පරාජය වූ කෝසල පසේනදි රජු තමාගේම රාජධානිය වූ සැවැත්නුවර වෙත ආපසු ගියේය.\"\n\n\"භික්ෂූනි, වේදේහි පුත් මගධ අජාතසත්තු රජු නපුරු මිතුරෙක්, නපුරු සහාය ඇත්තෙක්, නපුරු ඇසුර ඇත්තෙක්. භික්ෂූනි, කෝසල පසේනදි රජු යහපත් මිතුරෙක්, යහපත් සහාය ඇත්තෙක්, යහපත් ඇසුර ඇත්තෙක්. භික්ෂූනි, අදම කෝසල පසේනදි රජු පරාජය වූ බැවින් මේ රාත්‍රිය දුකින් නිදන බවය.\" මේ භාග්‍යවතුන් වහන්සේ වදාළ සේක. එය වදාළ සේක්වා වූ සුගත තථාගතයන් වහන්සේ නැවතත් මේ ගාථාව වදාළ සේක:\n\"ජයග්‍රහණය වෛරය උපදවයි, පරාජය වූ තැනැත්තා දුකින් නිදයි.\nසන්සිඳුණු තැනැත්තා, ජයග්‍රහණය හා පරාජය අත්හැර, සුවයෙන් නිදයි.\"",
      "paliTitle": "Paṭhamasaṅgāmasuttaṃ"
    },
    {
      "number": 126,
      "pali": "[ettha ‘‘atha kho rājā pasenadi kosalo caturaṅginiṃ senaṃ sannayhitvā rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ abbhuyyāsī’’ti ādinā pāṭhena bhavitabbaṃ. aṭṭhakathāyaṃ hi ‘‘abbhuyyāsīti parājaye garahappatto…pe… vuttajayakāraṇaṃ sutvā abhiuyyāsī’’ti vuttaṃ] Atha kho rājā māgadho ajātasattu vedehiputto caturaṅginiṃ senaṃ sannayhitvā rājānaṃ pasenadiṃ kosalaṃ abbhuyyāsi yena kāsi. Assosi kho rājā pasenadi kosalo – ‘‘rājā kira māgadho ajātasattu vedehiputto caturaṅginiṃ senaṃ sannayhitvā mamaṃ abbhuyyāto yena kāsī’’ti. Atha kho rājā pasenadi kosalo caturaṅginiṃ senaṃ sannayhitvā rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ paccuyyāsi yena kāsi. Atha kho rājā ca māgadho ajātasattu vedehiputto rājā ca pasenadi kosalo saṅgāmesuṃ. Tasmiṃ kho pana saṅgāme rājā pasenadi kosalo rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ parājesi, jīvaggāhañca naṃ aggahesi. Atha kho rañño pasenadissa kosalassa etadahosi – ‘‘kiñcāpi kho myāyaṃ rājā māgadho ajātasattu vedehiputto adubbhantassa dubbhati, atha ca pana me bhāgineyyo hoti. Yaṃnūnāhaṃ rañño māgadhassa ajātasattuno vedehiputtassa sabbaṃ hatthikāyaṃ pariyādiyitvā sabbaṃ assakāyaṃ pariyādiyitvā sabbaṃ rathakāyaṃ pariyādiyitvā sabbaṃ pattikāyaṃ pariyādiyitvā jīvantameva naṃ osajjeyya’’nti [ossajjeyyanti (sī. syā. kaṃ. pī.)]. Atha kho rājā pasenadi kosalo rañño māgadhassa ajātasattuno vedehiputtassa sabbaṃ hatthikāyaṃ pariyādiyitvā sabbaṃ assakāyaṃ pariyādiyitvā sabbaṃ rathakāyaṃ pariyādiyitvā sabbaṃ pattikāyaṃ pariyādiyitvā jīvantameva naṃ osajji [ossaji (sī.), ossajji (syā. kaṃ. pī.)]. Atha kho sambahulā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisiṃsu. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘Idha, bhante, rājā māgadho ajātasattu vedehiputto caturaṅginiṃ senaṃ sannayhitvā rājānaṃ pasenadiṃ kosalaṃ abbhuyyāsi yena kāsi. Assosi kho, bhante, rājā pasenadi kosalo – ‘rājā kira māgadho ajātasattu vedehiputto caturaṅginiṃ senaṃ sannayhitvā mamaṃ abbhuyyāto yena kāsī’ti. Atha kho, bhante, rājā pasenadi kosalo caturaṅginiṃ senaṃ sannayhitvā rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ paccuyyāsi yena kāsi. Atha kho, bhante, rājā ca māgadho ajātasattu vedehiputto rājā ca pasenadi kosalo saṅgāmesuṃ. Tasmiṃ kho pana, bhante, saṅgāme rājā pasenadi kosalo rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ parājesi, jīvaggāhañca naṃ aggahesi. Atha kho, bhante, rañño pasenadissa kosalassa etadahosi – ‘kiñcāpi kho myāyaṃ rājā māgadho ajātasattu vedehiputto adubbhantassa dubbhati, atha ca pana me bhāgineyyo hoti. Yaṃnūnāhaṃ rañño māgadhassa ajātasattuno vedehiputtassa sabbaṃ hatthikāyaṃ pariyādiyitvā sabbaṃ assakāyaṃ sabbaṃ rathakāyaṃ sabbaṃ pattikāyaṃ pariyādiyitvā jīvantameva naṃ osajjeyya’’’nti. ‘‘Atha kho, bhante, rājā pasenadi kosalo rañño māgadhassa ajātasattuno vedehiputtassa sabbaṃ hatthikāyaṃ pariyādiyitvā sabbaṃ assakāyaṃ pariyādiyitvā sabbaṃ rathakāyaṃ pariyādiyitvā sabbaṃ pattikāyaṃ pariyādiyitvā jīvantameva naṃ osajjī’’ti. Atha kho bhagavā etamatthaṃ viditvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Vilumpateva puriso, yāvassa upakappati; Yadā caññe vilumpanti, so vilutto viluppati [vilumpati (sī. pī. ka.)]. ‘‘Ṭhānañhi maññati bālo, yāva pāpaṃ na paccati; Yadā ca paccati pāpaṃ, atha dukkhaṃ nigacchati. ‘‘Hantā labhati [labhati hantā (sī. syā. kaṃ.)] hantāraṃ, jetāraṃ labhate jayaṃ; Akkosako ca akkosaṃ, rosetārañca rosako; Atha kammavivaṭṭena, so vilutto viluppatī’’ti.",
      "english": "Then indeed, King Ajātasattu, son of Videhi, of Magadha, having arrayed a four-fold army, attacked King Pasenadi of Kosala, towards Kasi. King Pasenadi of Kosala heard, “Indeed, King Ajātasattu, son of Videhi, of Magadha, having arrayed a four-fold army, has attacked me towards Kasi.” Then indeed, King Pasenadi of Kosala, having arrayed a four-fold army, counter-attacked King Ajātasattu, son of Videhi, of Magadha, towards Kasi. Then indeed, both King Ajātasattu, son of Videhi, of Magadha, and King Pasenadi of Kosala engaged in battle. And in that battle, King Pasenadi of Kosala defeated King Ajātasattu, son of Videhi, of Magadha, and captured him alive. Then indeed, the thought occurred to King Pasenadi of Kosala, “Although this King Ajātasattu, son of Videhi, of Magadha, acts hostilely towards me who am not hostile, he is nevertheless my nephew. What if I were to seize all his elephants, seize all his cavalry, seize all his chariots, seize all his infantry, and then release him alive?” Then indeed, King Pasenadi of Kosala, having seized all the elephants, all the cavalry, all the chariots, and all the infantry of King Ajātasattu, son of Videhi, of Magadha, released him alive.\n\nThen indeed, many monks, having dressed in the morning, took their bowls and robes, and entered Sāvatthī for alms. After wandering for alms in Sāvatthī and returning from their alms-round after their meal, they approached the Blessed One; having approached, they respectfully saluted the Blessed One and sat down to one side. Seated to one side, those monks said to the Blessed One, “Here, venerable sir, King Ajātasattu, son of Videhi, of Magadha, having arrayed a four-fold army, attacked King Pasenadi of Kosala, towards Kasi. Then, venerable sir, King Pasenadi of Kosala heard, ‘Indeed, King Ajātasattu, son of Videhi, of Magadha, having arrayed a four-fold army, has attacked me towards Kasi.’ Then, venerable sir, King Pasenadi of Kosala, having arrayed a four-fold army, counter-attacked King Ajātasattu, son of Videhi, of Magadha, towards Kasi. Then, venerable sir, both King Ajātasattu, son of Videhi, of Magadha, and King Pasenadi of Kosala engaged in battle. And in that battle, venerable sir, King Pasenadi of Kosala defeated King Ajātasattu, son of Videhi, of Magadha, and captured him alive. Then, venerable sir, the thought occurred to King Pasenadi of Kosala, ‘Although this King Ajātasattu, son of Videhi, of Magadha, acts hostilely towards me who am not hostile, he is nevertheless my nephew. What if I were to seize all his elephants, all his cavalry, all his chariots, and all his infantry, and then release him alive?’ Then, venerable sir, King Pasenadi of Kosala, having seized all the elephants, all the cavalry, all the chariots, and all the infantry of King Ajātasattu, son of Videhi, of Magadha, released him alive.”\n\nThen indeed, the Blessed One, understanding this matter, on that occasion uttered these verses:\n\nA person plunders others only as long as it benefits him. But when others plunder him, then he, plundered, is himself plundered.\n\nIndeed, the fool considers it a gain until his evil deed ripens. But when his evil deed ripens, then he experiences suffering.\n\nThe slayer finds a slayer, the conqueror finds a conqueror. The reviler finds reviling, and the angry person finds anger. And then, by the turning of kamma, he who plundered is himself plundered.",
      "sinhala": "ඉන්පසු මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු සිව්​රඟ සේනාව සූදානම් කොට කෝසල දේශය වෙත කෝසල රජු වූ පසේනදී රජුට පහර දීමට ගියේ ය. කෝසල රජු වූ පසේනදී රජුට අසන්නට ලැබුණේ ‘මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු සිව්​රඟ සේනාව සූදානම් කොට කෝසල දේශය වෙත මට පහර දීමට පැමිණ සිටින බව’ යනුවෙනි. ඉන්පසු කෝසල රජු වූ පසේනදී රජු සිව්​රඟ සේනාව සූදානම් කොට කෝසල දේශය වෙත මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජුට ප්‍රතිප්‍රහාර දීමට ගියේ ය. ඉන්පසු මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු ද කෝසල රජු වූ පසේනදී රජු ද සටන් කළහ. එම සටනෙහි දී කෝසල රජු වූ පසේනදී රජු මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු පරාජය කොට, ඔහු ව ජීවග්‍රාහයෙන් අල්ලාගත්තේ ය. ඉන්පසු කෝසල රජු වූ පසේනදී රජුට මේ අදහස ඇති විය: ‘මේ මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු මට කිසිදු අයහපතක් නොකළා වුව ද මට අයහපතක් කරයි. එසේ වුව ද, ඔහු මාගේ බෑණා වන්නේ ය. යමෙක් මාගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජුගේ සියලු ඇත්​සේනාව ද, සියලු අශ්ව​සේනාව ද, සියලු රථ​සේනාව ද, සියලු පාබල​සේනාව ද අත්පත් කරගෙන, ඔහු ව ජීවත්ව සිටිය දී ම නිදහස් කර හරින්නේ නම් හොඳ ය.’ ඉන්පසු කෝසල රජු වූ පසේනදී රජු මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජුගේ සියලු ඇත්​සේනාව ද, සියලු අශ්ව​සේනාව ද, සියලු රථ​සේනාව ද, සියලු පාබල​සේනාව ද අත්පත් කරගෙන, ඔහු ව ජීවත්ව සිටිය දී ම නිදහස් කර හැරියේ ය.\n\nඉන්පසු බොහෝ භික්ෂූහු පෙරවරු සමයෙහි සිවුරු පොරවාගෙන, පාත්‍ර සිවුරු ද ගෙන සැවැත් නුවරට පිණ්ඩපාතය පිණිස වැඩි සේක. සැවැත් නුවර පිණ්ඩපාතයෙහි හැසිර, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් ආපසු වැඩම කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණි සේක; පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙක වාඩි වූහ. එක් පසෙක වාඩි වී සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මේ කාරණය සැල කළහ: ‘‘ස්වාමීනි, මෙහි දී, මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු සිව්​රඟ සේනාව සූදානම් කොට කෝසල දේශය වෙත කෝසල රජු වූ පසේනදී රජුට පහර දීමට ගියේ ය. ස්වාමීනි, කෝසල රජු වූ පසේනදී රජුට අසන්නට ලැබුණේ ‘මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු සිව්​රඟ සේනාව සූදානම් කොට කෝසල දේශය වෙත මට පහර දීමට පැමිණ සිටින බව’ යනුවෙනි. ස්වාමීනි, ඉන්පසු කෝසල රජු වූ පසේනදී රජු සිව්​රඟ සේනාව සූදානම් කොට කෝසල දේශය වෙත මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජුට ප්‍රතිප්‍රහාර දීමට ගියේ ය. ස්වාමීනි, ඉන්පසු මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු ද කෝසල රජු වූ පසේනදී රජු ද සටන් කළහ. ස්වාමීනි, එම සටනෙහි දී කෝසල රජු වූ පසේනදී රජු මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු පරාජය කොට, ඔහු ව ජීවග්‍රාහයෙන් අල්ලාගත්තේ ය. ස්වාමීනි, ඉන්පසු කෝසල රජු වූ පසේනදී රජුට මේ අදහස ඇති විය: ‘මේ මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජු මට කිසිදු අයහපතක් නොකළා වුව ද මට අයහපතක් කරයි. එසේ වුව ද, ඔහු මාගේ බෑණා වන්නේ ය. යමෙක් මාගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජුගේ සියලු ඇත්​සේනාව ද, සියලු අශ්ව​සේනාව ද, සියලු රථ​සේනාව ද, සියලු පාබල​සේනාව ද අත්පත් කරගෙන, ඔහු ව ජීවත්ව සිටිය දී ම නිදහස් කර හරින්නේ නම් හොඳ ය.’’’යි. ‘‘ස්වාමීනි, ඉන්පසු කෝසල රජු වූ පසේනදී රජු මගධ රජු වූ, වේදේහී පුත්‍ර අජාතශත්‍රැ රජුගේ සියලු ඇත්​සේනාව ද, සියලු අශ්ව​සේනාව ද, සියලු රථ​සේනාව ද, සියලු පාබල​සේනාව ද අත්පත් කරගෙන, ඔහු ව ජීවත්ව සිටිය දී ම නිදහස් කර හැරියේ ය’’යි.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ මේ කාරණය දැනගෙන ඒ අවස්ථාවෙහි දී මේ ගාථා වදාළ සේක:\n‘‘පුද්ගලයා තමාට වාසි වන තාක් කල් (අන්‍යයන් සූරාකමින්) විනාශ කරයි. යම් කලෙක අන්‍යයෝ ඔහු ව සූරාකත් ද, එවිට ඔහු ද සූරාකෑමට ලක් වී විනාශයට පත් වේ.\nයම් තාක් කල් පාප කර්මය නොපැසෙන්නේ ද, ඒ තාක් කල් බාලයා තමාට සුබ තත්ත්වයක් ඇතැයි සිතයි. යම් කලෙක පාප කර්මය පැසේ ද, එවිට ඔහු දුකට පැමිණේ.\nඅනුන් මරන්නාට මරණය ලැබේ. අනුන් පරාජය කරන්නාට පරාජය ලැබේ. බණින්නාට බැනුම් ලැබේ. අනුන් කෝප ගන්වන්නාට කෝපය ලැබේ. මේ කර්ම විපාකයන් හේතුවෙන් ඔහු ද සූරාකෑමට ලක් වී විනාශයට පත් වේ’’ යයි.",
      "paliTitle": "Dutiyasaṅgāmasuttaṃ"
    },
    {
      "number": 127,
      "pali": "Sāvatthinidānaṃ. Atha kho rājā pasenadi kosalo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Atha kho aññataro puriso yena rājā pasenadi kosalo tenupasaṅkami; upasaṅkamitvā rañño pasenadissa kosalassa upakaṇṇake ārocesi – ‘‘mallikā, deva, devī dhītaraṃ vijātā’’ti. Evaṃ vutte, rājā pasenadi kosalo anattamano ahosi. Atha kho bhagavā rājānaṃ pasenadiṃ kosalaṃ anattamanataṃ viditvā tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Itthīpi hi ekacciyā, seyyā posa janādhipa; Medhāvinī sīlavatī, sassudevā patibbatā. ‘‘Tassā yo jāyati poso, sūro hoti disampati; Tādisā subhagiyā [subhariyāputto (ka.)] putto, rajjampi anusāsatī’’ti.",
      "english": "Occasioned at Sāvatthi. Then King Pasenadi of Kosala approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Then a certain man approached King Pasenadi of Kosala. Having approached, he whispered in King Pasenadi of Kosala's ear, \"Your Majesty, Queen Mallikā has given birth to a daughter.\" When this was said, King Pasenadi of Kosala became displeased.\n\nThen the Blessed One, knowing King Pasenadi of Kosala's displeasure, on that occasion uttered these verses:\n\"Indeed, O lord of men, some women are superior to men. She is intelligent, virtuous, devoted to her in-laws, and loyal to her husband. From such a woman is born a man who is a hero, a lord of the land. The son of such a blessed woman may even rule a kingdom.\"",
      "sinhala": "සැවැත් නුවරදී.\n\nඉන්පසු කෝසල රජු වූ පසේනදී භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍ය​වතුන් වහන්සේට ආචාර කොට, එකත්පසෙකින් වාඩිවිය. ඉන්පසු එක් පුරුෂයෙක් කෝසල රජු වූ පසේනදී සිටි තැනට පැමිණියේය. පැමිණ, කෝසල පසේනදී රජුගේ කනට කර, \"දේවයන් වහන්ස, මල්ලිකා දේවිය දියණියක ප්‍ර​සූත කළාය\" යැයි සැලකළේය. මෙසේ පැවසූ කල්හි, කෝසල රජු වූ පසේනදී නොසතුටු විය. ඉන්පසු භාග්‍ය​වතුන් වහන්සේ කෝසල පසේනදී රජුගේ නොසතුටු බව දැන, ඒ වෙලෙහි මේ ගාථා වදාළසේක:\n\n\"ජනාධිපති, යම්කිසි ස්ත්‍රියක් වුව ද, (පුරුෂයෙකුට වඩා) උසස් ය; ප්‍ර​ඥා​වන්තියක් නම්, සිල්වත් නම්, ස්වාමියාට දෙවියකු මෙන් සලකන්නියක් නම්, පතිව්‍රතාවියක් නම්. ඇගෙන් යම් පුත්‍ර​යෙක් උපදී ද, ඔහු වීරයෙක් වේ, දෙස් නායකයෙක් වේ. එබඳු වාසනාවන්තියකගේ පුත්‍ර​යා රාජ්‍ය​ය පවා පාලනය කරයි\" යනුවෙනි.",
      "paliTitle": "Mallikāsuttaṃ"
    },
    {
      "number": 128,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘atthi nu kho, bhante, eko dhammo yo ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ samparāyikañcā’’ti? ‘‘Atthi kho, mahārāja, eko dhammo yo ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ samparāyikañcā’’ti. ‘‘Katamo pana, bhante, eko dhammo, yo ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ samparāyikañcā’’ti? ‘‘Appamādo kho, mahārāja, eko dhammo, yo ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ samparāyikañcāti. Seyyathāpi, mahārāja, yāni kānici jaṅgalānaṃ [jaṅgamānaṃ (sī. pī.)] pāṇānaṃ padajātāni, sabbāni tāni hatthipade samodhānaṃ gacchanti, hatthipadaṃ tesaṃ aggamakkhāyati – yadidaṃ mahantattena; evameva kho, mahārāja, appamādo eko dhammo, yo ubho atthe samadhiggayha tiṭṭhati – diṭṭhadhammikañceva atthaṃ samparāyikañcā’’ti. Idamavoca… pe… ‘‘Āyuṃ arogiyaṃ vaṇṇaṃ, saggaṃ uccākulīnataṃ; Ratiyo patthayantena, uḷārā aparāparā. ‘‘Appamādaṃ pasaṃsanti, puññakiriyāsu paṇḍitā; Appamatto ubho atthe, adhiggaṇhāti paṇḍito. ‘‘Diṭṭhe dhamme ca yo attho, yo cattho samparāyiko; Atthābhisamayā dhīro, paṇḍitoti pavuccatī’’ti.",
      "english": "At Sāvatthī. Then King Pasenadi of Kosala, having sat down to one side, said this to the Blessed One: “Is there, Venerable Sir, a single quality that embraces both kinds of welfare – welfare in this present life and welfare in future lives?”\n\n“Indeed, great king, there is a single quality that embraces both kinds of welfare – welfare in this present life and welfare in future lives.”\n\n“But what, Venerable Sir, is that single quality that embraces both kinds of welfare – welfare in this present life and welfare in future lives?”\n\n“It is heedfulness, great king, that single quality which embraces both kinds of welfare – welfare in this present life and welfare in future lives. Just as, great king, all the footprints of living beings that roam about are encompassed within the footprint of an elephant, and the elephant’s footprint is declared to be the foremost among them by virtue of its great size; even so, great king, heedfulness is that single quality which embraces both kinds of welfare – welfare in this present life and welfare in future lives.”\n\nThis is what the Blessed One said. Having said this, the Sublime One, the Teacher, further spoke these verses:\n\nLong life, health, beauty,\nAnd a heavenly state, high birth;\nDesiring these sublime delights,\nOne after another, continually –\n\nThe wise praise heedfulness\nIn performing meritorious deeds.\nThe heedful, wise person achieves\nBoth kinds of welfare.\n\nThe welfare that belongs to this present life,\nAnd the welfare that belongs to future lives:\nThe discerning one, by comprehending these benefits,\nIs called a wise person.",
      "sinhala": "ශ්‍රා‍වස්තියෙහිදී වදාළ සූත්‍රයයි. එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි කොසොල් රජු වන පසේනදී භාග්‍ය‍වතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘වහන්ස, මේ ජීවිතයේ දියුණුවටත්, පරලොව දියුණුවටත් යන අර්ථ දෙකම සලසන එකම ධර්ම‍යක් ඇත්තේද?’’ ‘‘මහා‍රාජයෙනි, මේ ජීවිතයේ දියුණුවටත්, පරලොව දියුණුවටත් යන අර්ථ දෙකම සලසන එකම ධර්ම‍යක් ඇත්තේමය.’’ ‘‘වහන්ස, එසේනම් මේ ජීවිතයේ දියුණුවටත්, පරලොව දියුණුවටත් යන අර්ථ දෙකම සලසන ඒ එකම ධර්ම‍ය කවරේද?’’ ‘‘මහා‍රාජයෙනි, අප්පමාදය (ප්‍ර‍මාද නොවී සිහි නුවණින් කටයුතු කිරීම) නම් වූ එකම ධර්ම‍ය මේ ජීවිතයේ දියුණුවටත්, පරලොව දියුණුවටත් යන අර්ථ දෙකම සලසයි. මහා‍රාජයෙනි, යම් සේ චංචල සත්ත්වයන්ගේ පා‍ද සටහන් කීපයක් වේද, ඒ සියල්ල අත්‍ථිපාද සටහනේ (ඇත් පියවරේ) අඩංගු වෙයි. මේවා අතර අත්‍ථිපාද සටහන විශාල‍ත්වය නිසා අග්‍ර‍වෙතියි කියනු ලැබේ. එපරිද්දෙන්ම මහා‍රාජයෙනි, අප්පමාදය නම් වූ එකම ධර්ම‍ය මේ ජීවිතයේ දියුණුවටත්, පරලොව දියුණුවටත් යන අර්ථ දෙකම සලසයි.’’\n\nභාග්‍ය‍වතුන් වහන්සේ මෙය වදාළ සේක.\n‘‘ආයුෂය, නිරෝගීභාවය, ශරීර කාන්තිය, ස්වර්ග‍ය, උසස් කුලයක ඉපදීම,\nඑසේම උතුම් වූ නොයෙක් සතුටු ද, යමෙක් පතයි නම්,\nඥානවන්තයෝ පින්කම්වලදී අප්පමාදය ප්‍ර‍ශංසා කරති.\nඅප්‍ර‍මාදී වූ ඥානවන්තයා මේ අර්ථ දෙකම ලබා ගනී.\nමේ ජීවිතයට අදාළ යම් දියුණුවක් ඇත්ද, පරලොවට අදාළ යම් දියුණුවක් ඇත්ද,\nඑම අර්ථයන් අවබෝධ‍කරගත් ධීරයා පණ්ඩිතයෙකු (ඥානවන්තයෙකු) ලෙස හඳුන්වනු ලැබේ.’’",
      "paliTitle": "Appamādasuttaṃ"
    },
    {
      "number": 129,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘idha mayhaṃ, bhante, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘svākkhāto bhagavatā dhammo, so ca kho kalyāṇamittassa kalyāṇasahāyassa kalyāṇasampavaṅkassa, no pāpamittassa no pāpasahāyassa no pāpasampavaṅkassā’’’ti. ‘‘Evametaṃ, mahārāja, evametaṃ, mahārāja! Svākkhāto, mahārāja, mayā dhammo. So ca kho kalyāṇamittassa kalyāṇasahāyassa kalyāṇasampavaṅkassa, no pāpamittassa no pāpasahāyassa no pāpasampavaṅkassāti. ‘‘Ekamidāhaṃ, mahārāja, samayaṃ sakkesu viharāmi nagarakaṃ nāma sakyānaṃ nigamo. Atha kho, mahārāja, ānando bhikkhu yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho, mahārāja, ānando bhikkhu maṃ etadavoca – ‘upaḍḍhamidaṃ, bhante, brahmacariyassa – yadidaṃ kalyāṇamittatā kalyāṇasahāyatā kalyāṇasampavaṅkatā’’’ti. ‘‘Evaṃ vuttāhaṃ, mahārāja, ānandaṃ bhikkhuṃ etadavocaṃ – ‘mā hevaṃ, ānanda, mā hevaṃ, ānanda! Sakalameva hidaṃ, ānanda, brahmacariyaṃ – yadidaṃ kalyāṇamittatā kalyāṇasahāyatā kalyāṇasampavaṅkatā. Kalyāṇamittassetaṃ, ānanda, bhikkhuno pāṭikaṅkhaṃ kalyāṇasahāyassa kalyāṇasampavaṅkassa ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāvessati ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkarissati’’’. ‘‘Kathañca, ānanda, bhikkhu kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāveti, ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaroti? Idhānanda, bhikkhu sammādiṭṭhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ, sammāsaṅkappaṃ bhāveti…pe… sammāvācaṃ bhāveti…pe… sammākammantaṃ bhāveti…pe… sammāājīvaṃ bhāveti… pe… sammāvāyāmaṃ bhāveti…pe… sammāsatiṃ bhāveti…pe… sammāsamādhiṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vossaggapariṇāmiṃ. Evaṃ kho, ānanda, bhikkhu kalyāṇamitto kalyāṇasahāyo kalyāṇasampavaṅko ariyaṃ aṭṭhaṅgikaṃ maggaṃ bhāveti, ariyaṃ aṭṭhaṅgikaṃ maggaṃ bahulīkaroti. Tadamināpetaṃ, ānanda, pariyāyena veditabbaṃ yathā sakalamevidaṃ brahmacariyaṃ – yadidaṃ kalyāṇamittatā kalyāṇasahāyatā kalyāṇasampavaṅkatā’’ti. ‘‘Mamañhi, ānanda, kalyāṇamittaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, byādhidhammā sattā byādhito parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Iminā kho etaṃ, ānanda, pariyāyena veditabbaṃ yathā sakalamevidaṃ brahmacariyaṃ – yadidaṃ kalyāṇamittatā kalyāṇasahāyatā kalyāṇasampavaṅkatā’’ti. ‘‘Tasmātiha te, mahārāja, evaṃ sikkhitabbaṃ – ‘kalyāṇamitto bhavissāmi kalyāṇasahāyo kalyāṇasampavaṅko’ti. Evañhi te, mahārāja, sikkhitabbaṃ. ‘‘Kalyāṇamittassa te, mahārāja, kalyāṇasahāyassa kalyāṇasampavaṅkassa ayaṃ eko dhammo upanissāya vihātabbo – appamādo kusalesu dhammesu. ‘‘Appamattassa te, mahārāja, viharato appamādaṃ upanissāya, itthāgārassa anuyantassa evaṃ bhavissati – ‘rājā kho appamatto viharati, appamādaṃ upanissāya. Handa, mayampi appamattā viharāma, appamādaṃ upanissāyā’’’ti. ‘‘Appamattassa te, mahārāja, viharato appamādaṃ upanissāya, khattiyānampi anuyantānaṃ evaṃ bhavissati – ‘rājā kho appamatto viharati appamādaṃ upanissāya. Handa, mayampi appamattā viharāma, appamādaṃ upanissāyā’’’ti. ‘‘Appamattassa te, mahārāja, viharato appamādaṃ upanissāya, balakāyassapi evaṃ bhavissati – ‘rājā kho appamatto viharati appamādaṃ upanissāya. Handa, mayampi appamattā viharāma, appamādaṃ upanissāyā’’’ti. ‘‘Appamattassa te, mahārāja, viharato appamādaṃ upanissāya, negamajānapadassapi evaṃ bhavissati – ‘rājā kho appamatto viharati, appamādaṃ upanissāya. Handa, mayampi appamattā viharāma, appamādaṃ upanissāyā’’’ti? ‘‘Appamattassa te, mahārāja, viharato appamādaṃ upanissāya, attāpi gutto rakkhito bhavissati – itthāgārampi guttaṃ rakkhitaṃ bhavissati, kosakoṭṭhāgārampi guttaṃ rakkhitaṃ bhavissatī’’ti. Idamavoca…pe… ‘‘Bhoge patthayamānena, uḷāre aparāpare; Appamādaṃ pasaṃsanti, puññakiriyāsu paṇḍitā. ‘‘Appamatto ubho atthe, adhiggaṇhāti paṇḍito; Diṭṭhe dhamme ca yo attho, yo cattho samparāyiko; Atthābhisamayā dhīro, paṇḍitoti pavuccatī’’ti.",
      "english": "Then King Pasenadi of Kosala, sitting to one side, said to the Blessed One: \"Here, venerable sir, as I was secluded and in solitary retreat, such a thought arose in my mind: ‘Well-expounded by the Blessed One is the Dhamma, and it is for one who has admirable friends, admirable companions, admirable associates, not for one who has evil friends, evil companions, evil associates.’\"\n\n\"So it is, great king, so it is, great king! Well-expounded by me, great king, is the Dhamma, and it is for one who has admirable friends, admirable companions, admirable associates, not for one who has evil friends, evil companions, evil associates.\"\n\n\"On one occasion, great king, I was dwelling among the Sakyans, in a Sakyan town named Nagaraka. Then, great king, the monastic Ānanda approached me; having approached and paid homage to me, he sat down to one side. As he sat to one side, great king, the monastic Ānanda said to me: ‘This, venerable sir, is half of the holy life – that is, admirable friendship, admirable companionship, admirable association.’\"\n\n\"When this was said, great king, I said to the monastic Ānanda: ‘Do not say that, Ānanda! Do not say that, Ānanda! The entire holy life, Ānanda, is this: admirable friendship, admirable companionship, admirable association. It is to be expected of a monastic, Ānanda, who has admirable friends, admirable companions, admirable associates, that he will develop the Noble Eightfold Path, that he will cultivate the Noble Eightfold Path extensively.’\"\n\n\"‘And how, Ānanda, does a monastic who has admirable friends, admirable companions, admirable associates, develop the Noble Eightfold Path, cultivate the Noble Eightfold Path extensively? Here, Ānanda, a monastic develops right view, which is supported by seclusion, supported by dispassion, supported by cessation, and culminates in relinquishment. He develops right intention, which is supported by seclusion, supported by dispassion, supported by cessation, and culminates in relinquishment. He develops right speech, which is supported by seclusion, supported by dispassion, supported by cessation, and culminates in relinquishment. He develops right action, which is supported by seclusion, supported by dispassion, supported by cessation, and culminates in relinquishment. He develops right livelihood, which is supported by seclusion, supported by dispassion, supported by cessation, and culminates in relinquishment. He develops right effort, which is supported by seclusion, supported by dispassion, supported by cessation, and culminates in relinquishment. He develops right mindfulness, which is supported by seclusion, supported by dispassion, supported by cessation, and culminates in relinquishment. He develops right concentration, which is supported by seclusion, supported by dispassion, supported by cessation, and culminates in relinquishment. It is in this way, Ānanda, that a monastic who has admirable friends, admirable companions, admirable associates, develops the Noble Eightfold Path and cultivates the Noble Eightfold Path extensively. Therefore, Ānanda, by this reasoning too it should be understood how this entire holy life is admirable friendship, admirable companionship, admirable association.’\"\n\n\"‘Indeed, Ānanda, by relying on me as an admirable friend, beings subject to birth are liberated from birth; beings subject to aging are liberated from aging; beings subject to illness are liberated from illness; beings subject to death are liberated from death; beings subject to sorrow, lamentation, pain, displeasure, and despair are liberated from sorrow, lamentation, pain, displeasure, and despair. It is by this reasoning, Ānanda, that it should be understood how this entire holy life is admirable friendship, admirable companionship, admirable association.’\"\n\n\"‘Therefore, great king, you should train yourself in this way: ‘I will be one who has admirable friends, admirable companions, admirable associates.’ Indeed, great king, you should train yourself in this way. For you, great king, who have admirable friends, admirable companions, admirable associates, there is this one quality that should be relied upon for dwelling: diligence in wholesome states.\"\n\n\"As you dwell diligently, great king, relying on diligence, this is how it will be for your women of the inner palace, who follow your example: ‘The king dwells diligently, relying on diligence. Come, let us also dwell diligently, relying on diligence.’ As you dwell diligently, great king, relying on diligence, this is how it will be for the nobles who follow your example: ‘The king dwells diligently, relying on diligence. Come, let us also dwell diligently, relying on diligence.’ As you dwell diligently, great king, relying on diligence, this is how it will be for your armed forces: ‘The king dwells diligently, relying on diligence. Come, let us also dwell diligently, relying on diligence.’ As you dwell diligently, great king, relying on diligence, this is how it will be for your townsfolk and countryfolk: ‘The king dwells diligently, relying on diligence. Come, let us also dwell diligently, relying on diligence.’ As you dwell diligently, great king, relying on diligence, your own person will be guarded and protected, your inner palace will also be guarded and protected, and your treasury and storehouse will also be guarded and protected.\"\n\nThe Blessed One spoke this.\n\nThe wise praise diligence in performing meritorious deeds, by one desiring riches, great and continuously increasing.\n\nA wise person, being heedful, comprehends both kinds of welfare: whatever welfare there is in this present life, and whatever welfare there is for future lives. Through the direct realization of these kinds of welfare, a sagacious one is declared to be truly wise.",
      "sinhala": "එක් පසෙක වාඩි වී සිටි කොසොල් රජු පසේනදී භාග්‍යවතුන් වහන්සේට මෙය පැවසුවා: \"ස්වාමීනි, මෙහිදී මට තනිව වාසය කරන විට, භාවනා කරන විට, සිතේ මෙවැනි කල්පනාවක් ඇති වුණා – 'භාග්‍යවතුන් වහන්සේ විසින් ධර්මය මනාව දේශනා කර ඇත. එහෙත් එය කළ්‍යාණ මිත්‍රයන් ඇති, කළ්‍යාණ සහාය ඇති, කළ්‍යාණ ඇසුර ඇති අයට මිස, පාප මිත්‍රයන් ඇති, පාප සහාය ඇති, පාප ඇසුර ඇති අයට නොවේය' කියා.\"\n\n\"මහරජ, එසේමය, මහරජ, එසේමය! මහරජ, මා විසින් ධර්මය මනාව දේශනා කර ඇත. එහෙත් එය කළ්‍යාණ මිත්‍රයන් ඇති, කළ්‍යාණ සහාය ඇති, කළ්‍යාණ ඇසුර ඇති අයට මිස, පාප මිත්‍රයන් ඇති, පාප සහාය ඇති, පාප ඇසුර ඇති අයට නොවේය.\"\n\n\"මහරජ, එකල මම ශාක්‍ය ජනපදයේ, නගරක නම් වූ ශාක්‍යයන්ගේ ගම්මානයක වාසය කරමින් සිටියා. එවිට, මහරජ, ආනන්ද භික්ෂුව මා වෙත පැමිණියා; මා වෙත පැමිණ, මට ආචාර කොට, එක් පසෙක වාඩි වුණා. එක් පසෙක වාඩි වී සිටි, මහරජ, ආනන්ද භික්ෂුව මට මෙය පැවසුවා: 'ස්වාමීනි, කළ්‍යාණ මිත්‍රත්වය, කළ්‍යාණ සහාය, කළ්‍යාණ ඇසුර යනු මේ බ්‍රහ්මචර්යාවේ අඩකි' කියා.\"\n\n\"මහරජ, එසේ පැවසූ විට මම ආනන්ද භික්ෂුවට මෙය පැවසුවා: 'එසේ නොවේ ආනන්ද, එසේ නොවේ ආනන්ද! ආනන්ද, කළ්‍යාණ මිත්‍රත්වය, කළ්‍යාණ සහාය, කළ්‍යාණ ඇසුර යනු මේ බ්‍රහ්මචර්යාව මුළුල්ලමයි. ආනන්ද, කළ්‍යාණ මිත්‍රයෙකු, කළ්‍යාණ සහායකයෙකු, කළ්‍යාණ ඇසුරක් ඇති භික්ෂුවගෙන් මේ උතුම් අෂ්ටාංගික මාර්ගය වඩනු ඇතැයි, උතුම් අෂ්ටාංගික මාර්ගය බහුල කරනු ඇතැයි අපේක්ෂා කළ යුතුය.'\"\n\n\"ආනන්ද, කළ්‍යාණ මිත්‍රයෙකු, කළ්‍යාණ සහායකයෙකු, කළ්‍යාණ ඇසුරක් ඇති භික්ෂුවක් උතුම් අෂ්ටාංගික මාර්ගය වඩන්නේ, උතුම් අෂ්ටාංගික මාර්ගය බහුල කරන්නේ කෙසේද? ආනන්ද, මෙහිදී භික්ෂුව විවේකය (තණ්හාදියෙන් වෙන්වීම) අරමුණු කොටගත්, විරාගය (රාගයෙන් දුරුවීම) අරමුණු කොටගත්, නිරෝධය (සංසාර දුකින් මිදීම) අරමුණු කොටගත්, කෙලෙස් අත්හැරීමට නැඹුරු වූ සම්‍යක් දෘෂ්ටිය වඩයි. සම්‍යක් සංකල්පය වඩයි... යනාදී වශයෙන්... සම්‍යක් වචනය වඩයි... යනාදී වශයෙන්... සම්‍යක් කර්මාන්තය වඩයි... යනාදී වශයෙන්... සම්‍යක් ආජීවය වඩයි... යනාදී වශයෙන්... සම්‍යක් ව්‍යායාමය වඩයි... යනාදී වශයෙන්... සම්‍යක් ස්මෘතිය වඩයි... යනාදී වශයෙන්... විවේකය අරමුණු කොටගත්, විරාගය අරමුණු කොටගත්, නිරෝධය අරමුණු කොටගත්, කෙලෙස් අත්හැරීමට නැඹුරු වූ සම්‍යක් සමාධිය වඩයි. ආනන්ද, කළ්‍යාණ මිත්‍රයෙකු, කළ්‍යාණ සහායකයෙකු, කළ්‍යාණ ඇසුරක් ඇති භික්ෂුවක් උතුම් අෂ්ටාංගික මාර්ගය වඩන්නේ, උතුම් අෂ්ටාංගික මාර්ගය බහුල කරන්නේ මෙසේය. ආනන්ද, කළ්‍යාණ මිත්‍රත්වය, කළ්‍යාණ සහාය, කළ්‍යාණ ඇසුර යනු මේ බ්‍රහ්මචර්යාව මුළුල්ලම වන්නේ යැයි මේ කරුණෙන් දත යුතුය.\"\n\n\"ආනන්ද, මාගේ කළ්‍යාණ මිත්‍රත්වය හේතු කොටගෙන ජාති ස්වභාවය ඇති සත්වයෝ ජාතියෙන් මිදෙති, ජරා ස්වභාවය ඇති සත්වයෝ ජරාවෙන් මිදෙති, ව්‍යාධි ස්වභාවය ඇති සත්වයෝ ව්‍යාධියෙන් මිදෙති, මරණ ස්වභාවය ඇති සත්වයෝ මරණයෙන් මිදෙති, ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස යන ස්වභාවය ඇති සත්වයෝ ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාසයන්ගෙන් මිදෙති. ආනන්ද, කළ්‍යාණ මිත්‍රත්වය, කළ්‍යාණ සහාය, කළ්‍යාණ ඇසුර යනු මේ බ්‍රහ්මචර්යාව මුළුල්ලම වන්නේ යැයි මේ කරුණෙන් දත යුතුය.\"\n\n\"එබැවින් මහරජ, ඔබ මෙසේ හික්මිය යුතුය – 'මම කළ්‍යාණ මිත්‍රයෙක් වන්නෙමි, කළ්‍යාණ සහායකයෙක් වන්නෙමි, කළ්‍යාණ ඇසුරක් ඇත්තෙක් වන්නෙමි' කියා. මහරජ, ඔබ මෙසේම හික්මිය යුතුය. මහරජ, කළ්‍යාණ මිත්‍රයෙකු, කළ්‍යාණ සහායකයෙකු, කළ්‍යාණ ඇසුරක් ඇති ඔබට මේ එක් ධර්මයක් පදනම් කරගෙන වාසය කළ යුතුය – කුසල ධර්මයන්හි අප්‍රමාදී වීමයි.\"\n\n\"මහරජ, අප්‍රමාදීව වාසය කරන ඔබට, අප්‍රමාදය පදනම් කරගෙන වාසය කරන ඔබට, ඔබේ අන්තඃපුරයෙහි සිටින අයට මෙසේ සිතෙනු ඇත – 'රජු අප්‍රමාදීව වාසය කරයි, අප්‍රමාදය පදනම් කරගෙන. අපිත් අප්‍රමාදීව වාසය කරමු, අප්‍රමාදය පදනම් කරගෙන' කියා.\"\n\n\"මහරජ, අප්‍රමාදීව වාසය කරන ඔබට, අප්‍රමාදය පදනම් කරගෙන වාසය කරන ඔබට, ඔබව අනුගමනය කරන ක්ෂත්‍රියයන්ටද මෙසේ සිතෙනු ඇත – 'රජු අප්‍රමාදීව වාසය කරයි, අප්‍රමාදය පදනම් කරගෙන. අපිත් අප්‍රමාදීව වාසය කරමු, අප්‍රමාදය පදනම් කරගෙන' කියා.\"\n\n\"මහරජ, අප්‍රමාදීව වාසය කරන ඔබට, අප්‍රමාදය පදනම් කරගෙන වාසය කරන ඔබට, සේනාවටද මෙසේ සිතෙනු ඇත – 'රජු අප්‍රමාදීව වාසය කරයි, අප්‍රමාදය පදනම් කරගෙන. අපිත් අප්‍රමාදීව වාසය කරමු, අප්‍රමාදය පදනම් කරගෙන' කියා.\"\n\n\"මහරජ, අප්‍රමාදීව වාසය කරන ඔබට, අප්‍රමාදය පදනම් කරගෙන වාසය කරන ඔබට, නගර වැසියන්ට සහ ගම් වැසියන්ටද මෙසේ සිතෙනු ඇත – 'රජු අප්‍රමාදීව වාසය කරයි, අප්‍රමාදය පදනම් කරගෙන. අපිත් අප්‍රමාදීව වාසය කරමු, අප්‍රමාදය පදනම් කරගෙන' කියා.\"\n\n\"මහරජ, අප්‍රමාදීව වාසය කරන ඔබට, අප්‍රමාදය පදනම් කරගෙන වාසය කරන ඔබට, තමන්ද ආරක්ෂිත වනු ඇත – අන්තඃපුරයද ආරක්ෂිත වනු ඇත, රාජකීය භාණ්ඩාගාරයද ආරක්ෂිත වනු ඇත.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළසේක. මෙසේද වදාළ සේක:\n\"උතුම් වූ, නොයෙක් වර්ගයේ සම්පත් පතන තැනැත්තා විසින්,\nපින්කම් කිරීම්හිදී අප්‍රමාදය ප්‍රශංසා කරති පණ්ඩිතයෝ.\"\n\nඅප්‍රමාදී වූ පණ්ඩිත තැනැත්තා අරමුණු දෙකම අවබෝධ කරගනියි. එනම්, මේ ආත්මභාවයෙහිලා ලැබිය යුතු අර්ථය ද, පරලොවට අදාළ අර්ථය ද යි. එම අර්ථයන් මනාව අවබෝධ කරගැනීම නිසා ධීර පුද්ගලයා පණ්ඩිතයෙකු යැයි ප්‍රකාශ කරනු ලැබේ.",
      "paliTitle": "Kalyāṇamittasuttaṃ"
    },
    {
      "number": 130,
      "pali": "Sāvatthinidānaṃ. Atha kho rājā pasenadi kosalo divā divassa yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho rājānaṃ pasenadiṃ kosalaṃ bhagavā etadavoca – ‘‘handa, kuto nu tvaṃ, mahārāja, āgacchasi divā divassā’’ti? ‘‘Idha, bhante, sāvatthiyaṃ seṭṭhi gahapati kālaṅkato. Tamahaṃ aputtakaṃ sāpateyyaṃ rājantepuraṃ atiharitvā āgacchāmi. Asīti, bhante, satasahassāni hiraññasseva, ko pana vādo rūpiyassa! Tassa kho pana, bhante, seṭṭhissa gahapatissa evarūpo bhattabhogo ahosi – kaṇājakaṃ bhuñjati bilaṅgadutiyaṃ. Evarūpo vatthabhogo ahosi – sāṇaṃ dhāreti tipakkhavasanaṃ. Evarūpo yānabhogo ahosi – jajjararathakena yāti paṇṇachattakena dhāriyamānenā’’ti. ‘‘Evametaṃ, mahārāja, evametaṃ, mahārāja! Asappuriso kho, mahārāja, uḷāre bhoge labhitvā nevattānaṃ sukheti pīṇeti, na mātāpitaro sukheti pīṇeti, na puttadāraṃ sukheti pīṇeti, na dāsakammakaraporise sukheti pīṇeti, na mittāmacce sukheti pīṇeti, na samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpeti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Tassa te bhoge evaṃ sammā aparibhuñjiyamāne [aparibhuñjamāno (sabbattha)] rājāno vā haranti corā vā haranti aggi vā ḍahati udakaṃ vā vahati appiyā vā dāyādā haranti. Evaṃsa te [evaṃ sante (sī. pī.)], mahārāja, bhogā sammā aparibhuñjiyamānā parikkhayaṃ gacchanti, no paribhogaṃ. ‘‘Seyyathāpi, mahārāja, amanussaṭṭhāne pokkharaṇī acchodakā sītodakā sātodakā setodakā supatitthā ramaṇīyā. Taṃ jano neva hareyya na piveyya na nahāyeyya na yathāpaccayaṃ vā kareyya. Evañhi taṃ, mahārāja, udakaṃ sammā aparibhuñjiyamānaṃ [aparibhuñjamānaṃ (syā. kaṃ.)] parikkhayaṃ gaccheyya, no paribhogaṃ. Evameva kho, mahārāja, asappuriso uḷāre bhoge labhitvā nevattānaṃ sukheti pīṇeti, na mātāpitaro sukheti pīṇeti, na puttadāraṃ sukheti pīṇeti, na dāsakammakaraporise sukheti pīṇeti, na mittāmacce sukheti pīṇeti, na samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpeti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Tassa te bhoge evaṃ sammā aparibhuñjiyamāne rājāno vā haranti corā vā haranti aggi vā ḍahati udakaṃ vā vahati appiyā vā dāyādā haranti. Evaṃsa te [evaṃ sante (sī. pī.)], mahārāja, bhogā sammā aparibhuñjiyamānā parikkhayaṃ gacchanti, no paribhogaṃ. ‘‘Sappuriso ca kho, mahārāja, uḷāre bhoge labhitvā attānaṃ sukheti pīṇeti, mātāpitaro sukheti pīṇeti, puttadāraṃ sukheti pīṇeti, dāsakammakaraporise sukheti pīṇeti, mittāmacce sukheti pīṇeti, samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpeti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Tassa te bhoge evaṃ sammā paribhuñjiyamāne neva rājāno haranti, na corā haranti, na aggi ḍahati, na udakaṃ vahati, na appiyā dāyādā haranti. Evaṃsa te, mahārāja, bhogā sammā paribhuñjiyamānā paribhogaṃ gacchanti, no parikkhayaṃ. ‘‘Seyyathāpi, mahārāja, gāmassa vā nigamassa vā avidūre pokkharaṇī acchodakā sītodakā sātodakā setodakā supatitthā ramaṇīyā. Tañca udakaṃ jano hareyyapi piveyyapi nahāyeyyapi yathāpaccayampi kareyya. Evañhi taṃ, mahārāja, udakaṃ sammā paribhuñjiyamānaṃ paribhogaṃ gaccheyya, no parikkhayaṃ. Evameva kho, mahārāja, sappuriso uḷāre bhoge labhitvā attānaṃ sukheti pīṇeti, mātāpitaro sukheti pīṇeti, puttadāraṃ sukheti pīṇeti, dāsakammakaraporise sukheti pīṇeti, mittāmacce sukheti pīṇeti, samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhāpeti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Tassa te bhoge evaṃ sammā paribhuñjiyamāne neva rājāno haranti, na corā haranti, na aggi ḍahati, na udakaṃ vahati, na appiyā dāyādā haranti. Evaṃsa te, mahārāja, bhogā sammā paribhuñjiyamānā paribhogaṃ gacchanti, no parikkhaya’’nti. ‘‘Amanussaṭṭhāne udakaṃva sītaṃ, Tadapeyyamānaṃ parisosameti; Evaṃ dhanaṃ kāpuriso labhitvā, Nevattanā bhuñjati no dadāti. Dhīro ca viññū adhigamma bhoge, So bhuñjati kiccakaro ca hoti; So ñātisaṅghaṃ nisabho bharitvā, Anindito saggamupeti ṭhāna’’nti.",
      "english": "Then King Pasenadi of Kosala, in the middle of the day, approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side.\n\nAs King Pasenadi of Kosala was sitting to one side, the Blessed One said to him: \"Now, from where are you coming, great king, in the middle of the day?\"\n\n\"Here in Sāvatthī, venerable sir, a wealthy householder has passed away. I am returning after having brought his heirless property into the royal treasury. Eighty times one hundred thousand [coins] of gold alone, venerable sir, to say nothing of silver! Yet, venerable sir, that wealthy householder's enjoyment of food was such that he ate only sour gruel with pickled scraps. His enjoyment of clothing was such that he wore coarse hempen cloth, changed only once every three months. His enjoyment of conveyances was such that he traveled in a dilapidated cart, sheltered by a leaf-umbrella.\"\n\n\"It is so, great king, it is so! Truly, great king, an ignoble person, having acquired abundant wealth, neither makes himself happy and satisfied, nor does he make his mother and father happy and satisfied, nor his children and wife happy and satisfied, nor his slaves, workers, and servants happy and satisfied, nor his friends and associates happy and satisfied. Nor does he establish a sublime offering among ascetics and brahmins, one that leads to heavenly rebirth, yields happiness as its result, and is conducive to heaven. His wealth, thus improperly used, is carried off by kings or carried off by thieves, or burned by fire, or swept away by floods, or taken by unloved heirs. Thus, great king, his wealth, improperly used, goes to waste, not to enjoyment.\n\n\"Just as, great king, in an uninhabited place, there might be a pond with clear, cool, sweet, pure water, with good access, and delightful. People would neither draw from it, nor drink from it, nor bathe in it, nor use it for their needs. Thus, great king, that water, improperly used, would go to waste, not to enjoyment. In the same way, great king, an ignoble person, having acquired abundant wealth, neither makes himself happy and satisfied, nor does he make his mother and father happy and satisfied, nor his children and wife happy and satisfied, nor his slaves, workers, and servants happy and satisfied, nor his friends and associates happy and satisfied. Nor does he establish a sublime offering among ascetics and brahmins, one that leads to heavenly rebirth, yields happiness as its result, and is conducive to heaven. His wealth, thus improperly used, is carried off by kings or carried off by thieves, or burned by fire, or swept away by floods, or taken by unloved heirs. Thus, great king, his wealth, improperly used, goes to waste, not to enjoyment.\n\n\"But, great king, a noble person, having acquired abundant wealth, makes himself happy and satisfied, and he makes his mother and father happy and satisfied, and his children and wife happy and satisfied, and his slaves, workers, and servants happy and satisfied, and his friends and associates happy and satisfied. He also establishes a sublime offering among ascetics and brahmins, one that leads to heavenly rebirth, yields happiness as its result, and is conducive to heaven. His wealth, thus properly used, is neither carried off by kings, nor carried off by thieves, nor burned by fire, nor swept away by floods, nor taken by unloved heirs. Thus, great king, his wealth, properly used, goes to enjoyment, not to waste.\n\n\"Just as, great king, not far from a village or town, there might be a pond with clear, cool, sweet, pure water, with good access, and delightful. And people would draw from that water, and drink from it, and bathe in it, and use it for their needs. Thus, great king, that water, properly used, would go to enjoyment, not to waste. In the same way, great king, a noble person, having acquired abundant wealth, makes himself happy and satisfied, and he makes his mother and father happy and satisfied, and his children and wife happy and satisfied, and his slaves, workers, and servants happy and satisfied, and his friends and associates happy and satisfied. He also establishes a sublime offering among ascetics and brahmins, one that leads to heavenly rebirth, yields happiness as its result, and is conducive to heaven. His wealth, thus properly used, is neither carried off by kings, nor carried off by thieves, nor burned by fire, nor swept away by floods, nor taken by unloved heirs. Thus, great king, his wealth, properly used, goes to enjoyment, not to waste.\"\n\nLike cool water in an uninhabited place,\nIf not drunk, it dries up and perishes;\nSo too, an ignoble person, having gained wealth,\nNeither enjoys it himself nor gives it away.\n\nBut the wise and discerning one, having acquired wealth,\nBoth enjoys it and acts dutifully;\nThat leader, having supported his kin-group,\nBlameless, goes to a heavenly abode.",
      "sinhala": "ඉක්බිති කෝසල රජු වූ පසේනදී රජතුමා දහවල් කාලයේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩිවිය.\n\nඑකත්පසෙකින් වාඩි වී සිටි කෝසල රජු වූ පසේනදී රජතුමාට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “මහරජ, දැන් ඔබ මේ දහවල් කාලයේ කොහෙන්ද එන්නේ?”\n\n“පින්වහන්ස, මෙහි සැවැත් නුවර ධනවත් ගෘහපතියෙක් මිය ගියේය. ඔහුට දරුවන් නැති බැවින් ඒ සියලු වස්තුව මම රාජ භාණ්ඩාගාරයට ගෙනැවිත් ආපසු එමි. පින්වහන්ස, ඒ රන් අසිංසත කෝටියක් පමණ විය, රිදී ගැන කුමන කතාද! එහෙත් පින්වහන්ස, ඒ ධනවත් ගෘහපතියාගේ ආහාර භෝගය මෙබඳු විය – ඔහු බත් කෑමට ගත්තේ කැඳ තැම්බූ දිය සමගය. ඔහුගේ වස්ත්‍ර භෝගය මෙබඳු විය – ඔහු තුන් මාසයකට වරක් අලුත් කළ හණ වස්ත්‍රයක් ඇන්දේය. ඔහුගේ යාන වාහන භෝගය මෙබඳු විය – ඔහු ගමන් කළේ කඩතොලු වූ රථයකින්, වියළි පත්‍රවලින් සාදන ලද කුඩයක් හිස මත තබාගෙනය.”\n\n“මහරජ, එය එසේමය, මහරජ, එය එසේමය! මහරජ, අසත්පුරුෂ පුද්ගලයා මහත් ධනයක් ලැබ, තමාට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. මව්පියන්ට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. දූ දරුවන්ට හා භාර්යාවට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. දාසයන්ට, කම්කරුවන්ට හා මෙහෙකරුවන්ට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. මිත්‍ර අමාත්‍යවරුන්ට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. ශ්‍රමණ-බ්‍රාහ්මණයන් කෙරෙහි උසස් අරමුණු පිණිස වූ, සුගති සම්පත් දෙන, සුඛ විපාක ඇති, ස්වර්ගයට පමුණුවන දක්ෂිණාවක් පිහිටුවන්නේ නැත. ඔහු විසින් එසේ නිසි ලෙස පරිභෝග නොකරන ලද ඒ භෝග රජවරුන් විසින් පැහැර ගනු ලැබේ, හෝ සොරුන් විසින් පැහැර ගනු ලැබේ, හෝ ගින්නෙන් දැවී යයි, හෝ දිය පහරින් ගසාගෙන යයි, හෝ අප්‍රිය දායාදයන් විසින් පැහැර ගනු ලැබේ. මහරජ, එසේ වූ කල, ඒ භෝග නිසි ලෙස පරිභෝග නොකරන කල්හි, විනාශයට පත්වෙයි මිස, පරිභෝජනයට පත් නොවෙයි.\n\nමහරජ, යම්සේ මනුෂ්‍ය වාසයෙන් තොර ස්ථානයක, පැහැදිලි දිය ඇති, සිහිල් දිය ඇති, රසවත් දිය ඇති, සුදු පැහැති දිය ඇති, මනා තොටුපොළවල් ඇති, සිත්කලු පොකුණක් වෙයිද, මිනිසුන් එයින් දිය නොගනිත්ද, පානය නොකරත්ද, ස්නානය නොකරත්ද, අවශ්‍ය පරිදි පවත්වා නොගනිත්ද, මහරජ, එසේ නිසි ලෙස පරිභෝග නොකරන ලද ඒ ජලය විනාශයට පත් වෙයි මිස, පරිභෝජනයට පත් නොවෙයි. එසේම මහරජ, අසත්පුරුෂ පුද්ගලයා මහත් ධනයක් ලැබ, තමාට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. මව්පියන්ට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. දූ දරුවන්ට හා භාර්යාවට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. දාසයන්ට, කම්කරුවන්ට හා මෙහෙකරුවන්ට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. මිත්‍ර අමාත්‍යවරුන්ට සැපක්, පෝෂණයක් සලසා ගන්නේ නැත. ශ්‍රමණ-බ්‍රාහ්මණයන් කෙරෙහි උසස් අරමුණු පිණිස වූ, සුගති සම්පත් දෙන, සුඛ විපාක ඇති, ස්වර්ගයට පමුණුවන දක්ෂිණාවක් පිහිටුවන්නේ නැත. ඔහු විසින් එසේ නිසි ලෙස පරිභෝග නොකරන ලද ඒ භෝග රජවරුන් විසින් පැහැර ගනු ලැබේ, හෝ සොරුන් විසින් පැහැර ගනු ලැබේ, හෝ ගින්නෙන් දැවී යයි, හෝ දිය පහරින් ගසාගෙන යයි, හෝ අප්‍රිය දායාදයන් විසින් පැහැර ගනු ලැබේ. මහරජ, එසේ වූ කල, ඒ භෝග නිසි ලෙස පරිභෝග නොකරන කල්හි, විනාශයට පත්වෙයි මිස, පරිභෝජනයට පත් නොවෙයි.\n\nමහරජ, සත්පුරුෂ පුද්ගලයා මහත් ධනයක් ලැබ, තමාට සැපක්, පෝෂණයක් සලසා ගනී. මව්පියන්ට සැපක්, පෝෂණයක් සලසා ගනී. දූ දරුවන්ට හා භාර්යාවට සැපක්, පෝෂණයක් සලසා ගනී. දාසයන්ට, කම්කරුවන්ට හා මෙහෙකරුවන්ට සැපක්, පෝෂණයක් සලසා ගනී. මිත්‍ර අමාත්‍යවරුන්ට සැපක්, පෝෂණයක් සලසා ගනී. ශ්‍රමණ-බ්‍රාහ්මණයන් කෙරෙහි උසස් අරමුණු පිණිස වූ, සුගති සම්පත් දෙන, සුඛ විපාක ඇති, ස්වර්ගයට පමුණුවන දක්ෂිණාවක් පිහිටුවයි. ඔහු විසින් එසේ නිසි ලෙස පරිභෝග කරන ලද ඒ භෝග රජවරුන් විසින් පැහැර නොගනු ලැබේ, සොරුන් විසින් පැහැර නොගනු ලැබේ, ගින්නෙන් නොදැවේ, දිය පහරින් ගසාගෙන නොයයි, අප්‍රිය දායාදයන් විසින් පැහැර නොගනු ලැබේ. මහරජ, එසේ වූ කල, ඒ භෝග නිසි ලෙස පරිභෝග කරන කල්හි, පරිභෝජනයට පත් වෙයි මිස, විනාශයට පත් නොවෙයි.\n\nමහරජ, යම්සේ ගමකට හෝ නියම්ගමකට නුදුරින්, පැහැදිලි දිය ඇති, සිහිල් දිය ඇති, රසවත් දිය ඇති, සුදු පැහැති දිය ඇති, මනා තොටුපොළවල් ඇති, සිත්කලු පොකුණක් වෙයිද, මිනිසුන් එයින් දිය ගනිත්ද, පානය කරත්ද, ස්නානය කරත්ද, අවශ්‍ය පරිදි පවත්වා ගනිත්ද, මහරජ, එසේ නිසි ලෙස පරිභෝග කරන ලද ඒ ජලය පරිභෝජනයට පත් වෙයි මිස, විනාශයට පත් නොවෙයි. එසේම මහරජ, සත්පුරුෂ පුද්ගලයා මහත් ධනයක් ලැබ, තමාට සැපක්, පෝෂණයක් සලසා ගනී. මව්පියන්ට සැපක්, පෝෂණයක් සලසා ගනී. දූ දරුවන්ට හා භාර්යාවට සැපක්, පෝෂණයක් සලසා ගනී. දාසයන්ට, කම්කරුවන්ට හා මෙහෙකරුවන්ට සැපක්, පෝෂණයක් සලසා ගනී. මිත්‍ර අමාත්‍යවරුන්ට සැපක්, පෝෂණයක් සලසා ගනී. ශ්‍රමණ-බ්‍රාහ්මණයන් කෙරෙහි උසස් අරමුණු පිණිස වූ, සුගති සම්පත් දෙන, සුඛ විපාක ඇති, ස්වර්ගයට පමුණුවන දක්ෂිණාවක් පිහිටුවයි. ඔහු විසින් එසේ නිසි ලෙස පරිභෝග කරන ලද ඒ භෝග රජවරුන් විසින් පැහැර නොගනු ලැබේ, සොරුන් විසින් පැහැර නොගනු ලැබේ, ගින්නෙන් නොදැවේ, දිය පහරින් ගසාගෙන නොයයි, අප්‍රිය දායාදයන් විසින් පැහැර නොගනු ලැබේ. මහරජ, එසේ වූ කල, ඒ භෝග නිසි ලෙස පරිභෝග කරන කල්හි, පරිභෝජනයට පත් වෙයි මිස, විනාශයට පත් නොවෙයි.”\n\n“මනුෂ්‍ය වාසයෙන් තොර ස්ථානයක ඇති සිහිල් දිය, නොබී තිබෙන විට සිඳී යන්නා සේම, දුෂ්ට පුද්ගලයා ධනය ලබාගෙන තමා පරිභෝග නොකරයි, අනුන්ට දෙන්නේ ද නැත. ධීර වූ, නුවණැති පුද්ගලයා භෝග ලබාගෙන, ඒවා පරිභෝග කරයි, කළ යුතු කටයුතු ද ඉටු කරයි. ඔහු නෑදෑ සමූහයා පෝෂණය කරමින්, යහපත් නායකයෙකු සේ ක්‍රියා කර, කිසිවෙකුගේ නින්දාවට පත් නොවී, දෙව්ලොවට පැමිණෙන්නේය.”",
      "paliTitle": "Paṭhamaaputtakasuttaṃ"
    },
    {
      "number": 131,
      "pali": "Atha kho rājā pasenadi kosalo divā divassa yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ nisinnaṃ kho rājānaṃ pasenadiṃ kosalaṃ bhagavā etadavoca – ‘‘handa, kuto nu tvaṃ, mahārāja, āgacchasi divā divassā’’ti? ‘‘Idha, bhante, sāvatthiyaṃ seṭṭhi gahapati kālaṅkato. Tamahaṃ aputtakaṃ sāpateyyaṃ rājantepuraṃ atiharitvā āgacchāmi. Sataṃ, bhante, satasahassāni hiraññasseva, ko pana vādo rūpiyassa! Tassa kho pana, bhante, seṭṭhissa gahapatissa evarūpo bhattabhogo ahosi – kaṇājakaṃ bhuñjati bilaṅgadutiyaṃ. Evarūpo vatthabhogo ahosi – sāṇaṃ dhāreti tipakkhavasanaṃ. Evarūpo yānabhogo ahosi – jajjararathakena yāti paṇṇachattakena dhāriyamānenā’’ti. ‘‘Evametaṃ, mahārāja, evametaṃ, mahārāja! Bhūtapubbaṃ so, mahārāja, seṭṭhi gahapati taggarasikhiṃ nāma paccekasambuddhaṃ piṇḍapātena paṭipādesi. ‘Detha samaṇassa piṇḍa’nti vatvā uṭṭhāyāsanā pakkāmi. Datvā ca pana pacchā vippaṭisārī ahosi – ‘varametaṃ piṇḍapātaṃ dāsā vā kammakarā vā bhuñjeyyu’nti. Bhātu ca pana ekaputtakaṃ sāpateyyassa kāraṇā jīvitā voropesi. ‘‘Yaṃ kho so, mahārāja, seṭṭhi gahapati taggarasikhiṃ paccekasambuddhaṃ piṇḍapātena paṭipādesi, tassa kammassa vipākena sattakkhattuṃ sugatiṃ saggaṃ lokaṃ upapajji. Tasseva kammassa vipākāvasesena imissāyeva sāvatthiyā sattakkhattuṃ seṭṭhittaṃ kāresi. Yaṃ kho so, mahārāja, seṭṭhi gahapati datvā pacchā vippaṭisārī ahosi – ‘varametaṃ piṇḍapātaṃ dāsā vā kammakarā vā bhuñjeyyu’nti, tassa kammassa vipākena nāssuḷārāya bhattabhogāya cittaṃ namati, nāssuḷārāya vatthabhogāya cittaṃ namati, nāssuḷārāya yānabhogāya cittaṃ namati, nāssuḷārānaṃ pañcannaṃ kāmaguṇānaṃ bhogāya cittaṃ namati. Yaṃ kho so, mahārāja, seṭṭhi gahapati bhātu ca pana ekaputtakaṃ sāpateyyassa kāraṇā jīvitā voropesi, tassa kammassa vipākena bahūni vassāni bahūni vassasatāni bahūni vassasahassāni bahūni vassasatasahassāni niraye paccittha. Tasseva kammassa vipākāvasesena idaṃ sattamaṃ aputtakaṃ sāpateyyaṃ rājakosaṃ paveseti. Tassa kho, mahārāja, seṭṭhissa gahapatissa purāṇañca puññaṃ parikkhīṇaṃ, navañca puññaṃ anupacitaṃ. Ajja pana, mahārāja, seṭṭhi gahapati mahāroruve niraye paccatī’’ti. ‘‘Evaṃ, bhante, seṭṭhi gahapati mahāroruvaṃ nirayaṃ upapanno’’ti. ‘‘Evaṃ, mahārāja, seṭṭhi gahapati mahāroruvaṃ nirayaṃ upapanno’’ti. Idamavoca…pe…. ‘‘Dhaññaṃ dhanaṃ rajataṃ jātarūpaṃ, pariggahaṃ vāpi yadatthi kiñci; Dāsā kammakarā pessā, ye cassa anujīvino. ‘‘Sabbaṃ nādāya gantabbaṃ, sabbaṃ nikkhippagāminaṃ [nikkhīpagāminaṃ (syā. kaṃ. ka.)]; Yañca karoti kāyena, vācāya uda cetasā. ‘‘Tañhi tassa sakaṃ hoti, tañca ādāya gacchati; Tañcassa anugaṃ hoti, chāyāva anapāyinī. ‘‘Tasmā kareyya kalyāṇaṃ, nicayaṃ samparāyikaṃ; Puññāni paralokasmiṃ, patiṭṭhā honti pāṇina’’ntntti. Dutiyo vaggo. Tassuddānaṃ – Jaṭilā pañca rājāno, doṇapākakurena ca; Saṅgāmena dve vuttāni, mallikā [dhītarā (bahūsu)] dve appamādena ca; Aputtakena dve vuttā, vaggo tena pavuccatīti.",
      "english": "Then King Pasenadi of Kosala, during the daytime, approached the Blessed One. Having approached, the Blessed One addressed King Pasenadi of Kosala, who was sitting to one side, with these words: “Now, Great King, from where have you come at this time of day?”\n\n“Venerable Sir, here in Savatthi, a wealthy householder has passed away. I have come after confiscating his heirless property to the royal treasury. Venerable Sir, there were a hundred times a hundred thousand (ten million) in gold alone, to say nothing of silver! But Venerable Sir, that wealthy householder’s enjoyment of food was such that he ate broken rice with sour gruel as a side dish. His enjoyment of clothes was such that he wore a hemp cloth that was three half-months old. His enjoyment of vehicles was such that he traveled in a dilapidated cart, sheltered by a leaf-umbrella.”\n\n“So it is, Great King! So it is, Great King! In the past, Great King, that wealthy householder offered alms food to a Solitary Buddha named Taggarasikhī. He said, ‘Give alms to the ascetic,’ and then got up from his seat and left. After giving, he later regretted it, thinking, ‘It would be better if this alms food were eaten by my slaves or workers.’ Furthermore, he took the life of his brother’s only son for the sake of his inheritance.”\n\n“Great King, because that wealthy householder offered alms food to the Solitary Buddha Taggarasikhī, as a result of that kamma, he was reborn seven times in a good destination, a heavenly world. As a remaining consequence of that same kamma, he became a wealthy householder in this very Savatthi seven times. But because that wealthy householder, after giving, later regretted it, thinking, ‘It would be better if this alms food were eaten by my slaves or workers,’ as a result of that kamma, his mind was not inclined to enjoy exquisite food, nor was his mind inclined to enjoy exquisite clothes, nor was his mind inclined to enjoy exquisite vehicles, nor was his mind inclined to enjoy the five excellent strands of sense pleasure. And because that wealthy householder took the life of his brother’s only son for the sake of his inheritance, as a result of that kamma, he suffered in hell for many years, many hundreds of years, many thousands of years, many hundreds of thousands of years. As a remaining consequence of that same kamma, this seventh heirless property has now entered the royal treasury. Great King, the old merit of that wealthy householder is exhausted, and no new merit has been accumulated. Today, Great King, that wealthy householder is burning in the Mahāroruva hell.”\n\n“Is it so, Venerable Sir, that the wealthy householder has been reborn in the Mahāroruva hell?”\n\n“So it is, Great King, that the wealthy householder has been reborn in the Mahāroruva hell.”\n\nThus spoke the Blessed One.\n\n“Grain, wealth, silver, gold,\nor any possession whatsoever,\nslaves, laborers, attendants,\nand those who depend on him for a living.\nNone of it can be taken along;\none departs, leaving everything behind.\nWhatever one does by body,\nspeech, or mind,\nthat indeed is one’s own;\nthat one takes along.\nThat follows one, like an inseparable shadow.\nTherefore, one should do good,\naccumulating for the future.\nFor merits are a foundation\nfor living beings in the other world.”\n\nThe second chapter. Its summary:\nJaṭila, five kings, and with Doṇapāka and Kura;\nTwo discourses were spoken concerning battle, two concerning Mallikā and diligence;\nTwo were spoken concerning the heirless property; thus the chapter is declared.",
      "sinhala": "අථ කොසොල් රජු වූ පසේනදී රජතුමා දහවල් කාලයේ භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. එසේ පැමිණ, එක් පසෙක අසුන්ගෙන සිටි කොසොල් රජු වූ පසේනදී රජතුමාට භාග්‍ය​වතුන් වහන්සේ මෙසේ වදාළ සේක: “මහරජ, දහවල් කාලයේ ඔබ කොහේ සිටද පැමිණෙන්නේ?” “ස්වාමීනි, මෙහි සැවැත් නුවර සිටු ගෘහපතියෙක් මිය ගියේය. පුත්‍රයෙක් නැති ඔහුගේ දේපල රාජ අන්තඃපුරයට ගෙනැවිත් මම පැමිණෙමි. ස්වාමීනි, රන් කහවණු සිය දහස් ගණනකි. රිදී ගැන කුමන කථාද! ස්වාමීනි, ඒ සිටු ගෘහපතියාගේ ආහාර භෝගය මේ ආකාර විය – ඔහු කැඳ සමඟ කන්නේ කුඩා ධාන්‍ය කැබලි, බෙලිකා ඇඹුල සමඟ ය. ඔහුගේ වස්ත්‍ර භෝගය මේ ආකාර විය – ඔහු අඳින්නේ තුන් මසකට වරක් සෝදන හණ වස්ත්‍රයකි. ඔහුගේ යාන භෝගය මේ ආකාර විය – ඔහු යන්නේ ඉරිතලා ගිය කුඩා රථයකින්, කැඩී ගිය කොළ කුඩයක් අල්ලාගෙන ය.”\n\n“මහරජ, මෙය එසේමය, මහරජ, මෙය එසේමය! මහරජ, පෙර විසූ කාලයක ඒ සිටු ගෘහපතියා තග්ගරසිඛී නම් පසේ බුදුරජාණන් වහන්සේට පිණ්ඩපාතය පිළිගැන්වීය. ‘ශ්‍ර​මණයන් වහන්සේට පිණ්ඩපාතය දෙන්න’ යැයි කියා, අසුනින් නැගිට නික්ම ගියේය. දීවා පසුව ඔහු පසුතැවිලි විය – ‘මේ පිණ්ඩපාතය දාසයන් හෝ කම්කරුවන් හෝ අනුභව කළා නම් මැනවි’ කියාය. තවද, ඔහු සිය සොහොයුරාගේ එකම පුත්‍රයා දේපල හේතුවෙන් ජීවිතයෙන් තොර කළේය.”\n\n“මහරජ, ඒ සිටු ගෘහපතියා තග්ගරසිඛී පසේ බුදුරජාණන් වහන්සේට පිණ්ඩපාතය පිළිගැන්වූයේ යම් කර්මයකින්ද, ඒ කර්මයේ විපාකයෙන් ඔහු සත් වරක් සුගතියෙහි, දෙව්ලොව උපන්නේය. ඒ කර්මයේම විපාක අවශේෂයෙන් මේ සැවැත් නුවරම සත් වරක් සිටු පදවිය ලැබුවේය. මහරජ, ඒ සිටු ගෘහපතියා පිණ්ඩපාතය දී පසුව ‘මේ පිණ්ඩපාතය දාසයන් හෝ කම්කරුවන් හෝ අනුභව කළා නම් මැනවි’ කියා පසුතැවිලි වූයේ යම් කර්මයකින්ද, ඒ කර්මයේ විපාකයෙන් ඔහුට උසස් ආහාර භෝගයන්ට සිත නොනැමුණි, උසස් වස්ත්‍ර භෝගයන්ට සිත නොනැමුණි, උසස් යාන භෝගයන්ට සිත නොනැමුණි, උසස් පංචකාම භෝගයන්ට සිත නොනැමුණි. මහරජ, ඒ සිටු ගෘහපතියා සොහොයුරාගේ එකම පුත්‍රයා දේපල හේතුවෙන් ජීවිතයෙන් තොර කළේ යම් කර්මයකින්ද, ඒ කර්මයේ විපාකයෙන් බොහෝ වර්ෂ ගණන්, බොහෝ සිය දහස් ගණන් වර්ෂ, බොහෝ දහස් ගණන් වර්ෂ, බොහෝ ලක්ෂ ගණන් වර්ෂ නිරයේ පැසවීය. ඒ කර්මයේම විපාක අවශේෂයෙන් මෙය සත්වන වරටත් පුත්‍රයෙක් නැති දේපල රාජකෝෂයට ඇතුළු කරනු ලැබේ.”\n\n“මහරජ, ඒ සිටු ගෘහපතියාගේ පෙර පුණ්‍යකර්ම ක්ෂය වී ගොස් ඇත, අලුත් පුණ්‍යකර්ම උපචය වී නැත. එහෙත් මහරජ, අද ඒ සිටු ගෘහපතියා මහා රෞරව නිරයෙහි පැසවයි.” “එසේය, ස්වාමීනි, සිටු ගෘහපතියා මහා රෞරව නිරයට පැමිණියේය.” “එසේය, මහරජ, සිටු ගෘහපතියා මහා රෞරව නිරයට පැමිණියේය.” භාග්‍ය​වතුන් වහන්සේ මෙය වදාළ සේක. [පෙ…]\n\n“ධාන්‍යය, ධනය, රිදී, රන්, යම්කිසි පරිභෝග වස්තුවක් හෝ වේවා,\nදාසයෝ, කම්කරුවෝ, සේවකයෝ, යමෙක් ඔහුට යැපෙන්නාහුද,\nඒ සියල්ල රැගෙන යා නොහැකිය. සියල්ල අත්හැර යා යුතුය.\nයමක් කයින් හෝ වචනයෙන් හෝ සිතින් හෝ කරන්නේද,\nඑයම ඔහුට තමන්ගේ දෙය වන්නේය, එයම රැගෙන යන්නේය.\nඒ දෙයම ඔහු පසුපස එන්නේය, නොනැසෙන ඡායාවක් මෙනි.\nඑහෙයින් පරලොවට හිතකර වූ යහපත් දේ රැස්කළ යුතුය.\nපරලොවදී සත්ත්වයන්ට පිහිට වන්නේ පින්ම වන්නේය.”\n\nදෙවැනි වග්ගයයි. එහි සාරාංශය: ජටිල පස් දෙනෙක්, රජවරු, දෝණපාක කූර සමඟ; සංග්‍රාමයෙන් දෙකක් කියැවිණි, මල්ලිකා (දියණියෝ) දෙදෙනෙක් අප්‍රමාදය සමඟ; අපුත්තික කථා දෙකක් කියැවිණි, ඒ නිසා මෙය වග්ගය ලෙස කියනු ලැබේ.",
      "paliTitle": "Dutiyaaputtakasuttaṃ"
    },
    {
      "number": 132,
      "pali": "Sāvatthinidānaṃ. Atha kho rājā pasenadi kosalo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho rājānaṃ pasenadiṃ kosalaṃ bhagavā etadavoca – ‘‘cattārome, mahārāja, puggalā santo saṃvijjamānā lokasmiṃ. Katame cattāro? Tamotamaparāyano, tamojotiparāyano, jotitamaparāyano, jotijotiparāyano’’. ‘‘Kathañca, mahārāja puggalo tamotamaparāyano hoti? Idha, mahārāja, ekacco puggalo nīce kule paccājāto hoti, caṇḍālakule vā venakule [veṇakule (sī. syā. kaṃ. pī.)] vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca hoti dubbaṇṇo duddasiko okoṭimako bavhābādho [bahvābādho (ka.)] kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā vācāya duccaritaṃ caritvā manasā duccaritaṃ caritvā, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Seyyathāpi, mahārāja, puriso andhakārā vā andhakāraṃ gaccheyya, tamā vā tamaṃ gaccheyya, lohitamalā vā lohitamalaṃ gaccheyya. Tathūpamāhaṃ, mahārāja, imaṃ puggalaṃ vadāmi. Evaṃ kho, mahārāja, puggalo tamotamaparāyano hoti. ‘‘Kathañca, mahārāja, puggalo tamojotiparāyano hoti? Idha, mahārāja, ekacco puggalo nīce kule paccājāto hoti, caṇḍālakule vā venakule vā nesādakule vā rathakārakule vā pukkusakule vā dalidde appannapānabhojane kasiravuttike, yattha kasirena ghāsacchādo labbhati. So ca kho hoti dubbaṇṇo duddasiko okoṭimako bavhābādho, kāṇo vā kuṇī vā khañjo vā pakkhahato vā, na lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. So kāyena sucaritaṃ caritvā vācāya sucaritaṃ caritvā manasā sucaritaṃ caritvā, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. ‘‘Seyyathāpi, mahārāja, puriso pathaviyā vā pallaṅkaṃ āroheyya, pallaṅkā vā assapiṭṭhiṃ āroheyya, assapiṭṭhiyā vā hatthikkhandhaṃ āroheyya, hatthikkhandhā vā pāsādaṃ āroheyya. Tathūpamāhaṃ, mahārāja, imaṃ puggalaṃ vadāmi. Evaṃ kho, mahārāja, puggalo tamojotiparāyano hoti. ‘‘Kathañca, mahārāja, puggalo jotitamaparāyano hoti? Idha, mahārāja, ekacco puggalo ucce kule paccājāto hoti, khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā, aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe. So ca hoti abhirūpo dassanīyo pāsādiko, paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena duccaritaṃ carati, vācāya duccaritaṃ carati, manasā duccaritaṃ carati. So kāyena duccaritaṃ caritvā vācāya duccaritaṃ caritvā manasā duccaritaṃ caritvā, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. ‘‘Seyyathāpi, mahārāja, puriso pāsādā vā hatthikkhandhaṃ oroheyya, hatthikkhandhā vā assapiṭṭhiṃ oroheyya, assapiṭṭhiyā vā pallaṅkaṃ oroheyya, pallaṅkā vā pathaviṃ oroheyya, pathaviyā vā andhakāraṃ paviseyya. Tathūpamāhaṃ, mahārāja, imaṃ puggalaṃ vadāmi. Evaṃ kho, mahārāja, puggalo jotitamaparāyano hoti. ‘‘Kathañca, mahārāja, puggalo jotijotiparāyano hoti? Idha, mahārāja, ekacco puggalo ucce kule paccājāto hoti, khattiyamahāsālakule vā brāhmaṇamahāsālakule vā gahapatimahāsālakule vā, aḍḍhe mahaddhane mahābhoge pahūtajātarūparajate pahūtavittūpakaraṇe pahūtadhanadhaññe. So ca hoti abhirūpo dassanīyo pāsādiko, paramāya vaṇṇapokkharatāya samannāgato, lābhī annassa pānassa vatthassa yānassa mālāgandhavilepanassa seyyāvasathapadīpeyyassa. So kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. So kāyena sucaritaṃ caritvā vācāya sucaritaṃ caritvā manasā sucaritaṃ caritvā, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. ‘‘Seyyathāpi, mahārāja, puriso pallaṅkā vā pallaṅkaṃ saṅkameyya, assapiṭṭhiyā vā assapiṭṭhiṃ saṅkameyya, hatthikkhandhā vā hatthikkhandhaṃ saṅkameyya, pāsādā vā pāsādaṃ saṅkameyya. Tathūpamāhaṃ, mahārāja, imaṃ puggalaṃ vadāmi. Evaṃ kho, mahārāja, puggalo jotijotiparāyano hoti. Ime kho, mahārāja, cattāro puggalā santo saṃvijjamānā lokasmi’’nti. Idamavoca…pe… ‘‘Daliddo puriso rāja, assaddho hoti maccharī; Kadariyo pāpasaṅkappo, micchādiṭṭhi anādaro. ‘‘Samaṇe brāhmaṇe vāpi, aññe vāpi vanibbake; Akkosati paribhāsati, natthiko hoti rosako. ‘‘Dadamānaṃ nivāreti, yācamānāna bhojanaṃ; Tādiso puriso rāja, mīyamāno janādhipa; Upeti nirayaṃ ghoraṃ, tamotamaparāyano. ‘‘Daliddo puriso rāja, saddho hoti amaccharī; Dadāti seṭṭhasaṅkappo, abyaggamanaso naro. ‘‘Samaṇe brāhmaṇe vāpi, aññe vāpi vanibbake; Uṭṭhāya abhivādeti, samacariyāya sikkhati. ‘‘Dadamānaṃ na vāreti [na nivāreti (sī.)], yācamānāna bhojanaṃ; Tādiso puriso rāja, mīyamāno janādhipa; Upeti tidivaṃ ṭhānaṃ, tamojotiparāyano. ‘‘Aḍḍho ce [aḍḍho ve (pī. ka.)] puriso rāja, assaddho hoti maccharī; Kadariyo pāpasaṅkappo, micchādiṭṭhi anādaro. ‘‘Samaṇe brāhmaṇe vāpi, aññe vāpi vanibbake; Akkosati paribhāsati, natthiko hoti rosako. ‘‘Dadamānaṃ nivāreti, yācamānāna bhojanaṃ; Tādiso puriso rāja, mīyamāno janādhipa; Upeti nirayaṃ ghoraṃ, jotitamaparāyano. ‘‘Aḍḍho ce puriso rāja, saddho hoti amaccharī; Dadāti seṭṭhasaṅkappo, abyaggamanaso naro. ‘‘Samaṇe brāhmaṇe vāpi, aññe vāpi vanibbake; Uṭṭhāya abhivādeti, samacariyāya sikkhati. ‘‘Dadamānaṃ na vāreti, yācamānāna bhojanaṃ; Tādiso puriso rāja, mīyamāno janādhipa; Upeti tidivaṃ ṭhānaṃ, jotijotiparāyano’’ti.",
      "english": "At Sāvatthī. Then King Pasenadi of Kosala approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As King Pasenadi of Kosala sat to one side, the Blessed One said to him: \"Great King, there are these four types of individuals existing and found in the world.\" \"What are these four? One who goes from darkness to darkness, one who goes from darkness to light, one who goes from light to darkness, and one who goes from light to light.\"\n\n\"And how, Great King, is a person one who goes from darkness to darkness? Here, Great King, a certain person is reborn into a low family—a family of outcastes, a family of bamboo-workers, a family of hunters, a family of cartwrights, or a family of scavengers—poor, with meager food and drink, living a life of hardship, where sustenance is obtained with difficulty. Furthermore, they are ugly, ill-favored, deformed, and afflicted with many diseases—one-eyed, or crippled, or lame, or paralyzed. They do not obtain food, drink, clothing, vehicles, garlands, scents, ointments, bedding, lodging, or lights. They perform misconduct by body, misconduct by speech, and misconduct by mind. Having performed misconduct by body, misconduct by speech, and misconduct by mind, with the breaking up of the body, after death, they reappear in a state of deprivation, a bad destination, a lower realm, hell.\n\n\"Just as, Great King, a person might go from darkness to darkness, from gloom to gloom, from foulness to foulness. So too, Great King, I declare this individual to be. Thus, Great King, is a person one who goes from darkness to darkness.\"\n\n\"And how, Great King, is a person one who goes from darkness to light? Here, Great King, a certain person is reborn into a low family—a family of outcastes, a family of bamboo-workers, a family of hunters, a family of cartwrights, or a family of scavengers—poor, with meager food and drink, living a life of hardship, where sustenance is obtained with difficulty. Furthermore, they are ugly, ill-favored, deformed, and afflicted with many diseases—one-eyed, or crippled, or lame, or paralyzed. They do not obtain food, drink, clothing, vehicles, garlands, scents, ointments, bedding, lodging, or lights. They perform good conduct by body, good conduct by speech, and good conduct by mind. Having performed good conduct by body, good conduct by speech, and good conduct by mind, with the breaking up of the body, after death, they reappear in a good destination, a heavenly world.\n\n\"Just as, Great King, a person might ascend from the ground to a couch, or from a couch to a horse's back, or from a horse's back to an elephant's shoulder, or from an elephant's shoulder to a palace. So too, Great King, I declare this individual to be. Thus, Great King, is a person one who goes from darkness to light.\"\n\n\"And how, Great King, is a person one who goes from light to darkness? Here, Great King, a certain person is reborn into a high family—a wealthy Khattiya family, or a wealthy Brahmana family, or a wealthy householder family—rich, with great wealth and possessions, abundant gold and silver, abundant assets and property, abundant grain and provisions. Furthermore, they are beautiful, attractive, pleasing to the eye, endowed with supreme complexion and stature. They obtain food, drink, clothing, vehicles, garlands, scents, ointments, bedding, lodging, and lights. They perform misconduct by body, misconduct by speech, and misconduct by mind. Having performed misconduct by body, misconduct by speech, and misconduct by mind, with the breaking up of the body, after death, they reappear in a state of deprivation, a bad destination, a lower realm, hell.\n\n\"Just as, Great King, a person might descend from a palace to an elephant's shoulder, or from an elephant's shoulder to a horse's back, or from a horse's back to a couch, or from a couch to the ground, or from the ground enter into darkness. So too, Great King, I declare this individual to be. Thus, Great King, is a person one who goes from light to darkness.\"\n\n\"And how, Great King, is a person one who goes from light to light? Here, Great King, a certain person is reborn into a high family—a wealthy Khattiya family, or a wealthy Brahmana family, or a wealthy householder family—rich, with great wealth and possessions, abundant gold and silver, abundant assets and property, abundant grain and provisions. Furthermore, they are beautiful, attractive, pleasing to the eye, endowed with supreme complexion and stature. They obtain food, drink, clothing, vehicles, garlands, scents, ointments, bedding, lodging, and lights. They perform good conduct by body, good conduct by speech, and good conduct by mind. Having performed good conduct by body, good conduct by speech, and good conduct by mind, with the breaking up of the body, after death, they reappear in a good destination, a heavenly world.\n\nJust as, O great king, a man might move from one couch to another, or from the back of one horse to the back of another, or from the shoulder of one elephant to the shoulder of another, or from one palace to another palace. It is with such a simile, O great king, that I speak of this type of person. Indeed, O great king, such a person is one who proceeds from light to light. Indeed, O great king, these four types of persons exist and are found in the world.\n\nO king, a poor person who is faithless and miserly; stingy, with evil intentions, holding wrong view, and disrespectful.\n\nWhether they are ascetics or brahmins, or other mendicants; he reviles and slanders, is nihilistic, and hostile.\n\nHe hinders those who give, and withholds food from those who beg. Such a person, O great king, O lord of people, upon dying, goes to a fearsome hell, proceeding from darkness to utter darkness.\n\nO king, a poor person who is full of faith and not miserly; he gives with noble intentions, a person whose mind is unperturbed.\n\nWhether they are ascetics or brahmins, or other mendicants; he rises to greet them, and trains in virtuous conduct.\n\nHe does not hinder those who give, nor does he withhold food from those who beg. Such a person, O great king, O lord of people, upon dying, goes to a heavenly realm, proceeding from darkness to light.\n\nAnd, O king, a rich person who is faithless and miserly; stingy, with evil intentions, holding wrong view, and disrespectful.\n\nWhether they are ascetics or brahmins, or other mendicants; he reviles and slanders, is nihilistic, and hostile.\n\nHe hinders those who give, and withholds food from those who beg. Such a person, O great king, O lord of people, upon dying, goes to a fearsome hell, proceeding from light to darkness.\n\nAnd, O king, a rich person who is full of faith and not miserly; he gives with noble intentions, a person whose mind is unperturbed.\n\nWhether they are ascetics or brahmins, or other mendicants; he rises to greet them, and trains in virtuous conduct.\n\nHe does not hinder those who give, nor does he withhold food from those who beg. Such a person, O great king, O lord of people, upon dying, goes to a heavenly realm, proceeding from light to light.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑවිට කොසොල් මහ රජ පසේනදී භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට එළඹියේය; එළඹ, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර, එකත්පසෙකින් වාඩිවිය. එකත්පසෙකින් වාඩිවී සිටි කොසොල් මහ රජ පසේනදීට භාග්‍ය​වතුන් වහන්සේ මෙසේ වදාළසේක: “මහ රජ, මේ පුද්ගලයෝ සතර දෙනෙක් ලෝකයෙහි සැබවින්ම සිටිති, පෙනී සිටිති. කවරහුද ඒ සතර දෙනා? අන්ධකාරයෙන් අන්ධකාරයට යන තැනැත්තා, අන්ධකාරයෙන් ආලෝකයට යන තැනැත්තා, ආලෝකයෙන් අන්ධකාරයට යන තැනැත්තා, ආලෝකයෙන් ආලෝකයට යන තැනැත්තා යන මොවුන්ය.”\n\n‘‘මහ රජ, පුද්ගලයෙක් කෙසේ අන්ධකාරයෙන් අන්ධකාරයට යන්නේද? මහ රජ, මෙලොව ඇතැම් පුද්ගලයෙක් චණ්ඩාල කුලයක හෝ වේන කුලයක හෝ නෙසාද කුලයක හෝ රථකාර කුලයක හෝ පුක්කුස කුලයක හෝ දුප්පත්, අල්ප වූ ආහාර පාන ඇති, ජීවිකාව දුෂ්කර වූ, අතිශයින්ම දුකසේ ආහාර වස්ත්‍ර​ාදිය ලැබෙන තැනක වැනි පහත් කුලයක උපදී. ඔහු දුර්වර්ණවූයේ, දුටුවන් පිළිකුල් කරවන සුළු වූයේ, කෙට්ටු, බොහෝ ආබාධ ඇති අයෙක් වේ; කනෙක් හෝ, අංගවිකල අයෙක් හෝ, කොරෙක් හෝ, අංශභාග රෝගියෙක් හෝ වේ. ඔහු ආහාර පාන, වස්ත්‍ර​ාදිය, යාන වාහන, මල් ගන්ධ විලේපන, සයනාසන, ගෙවල් දොරවල්, පහන් ආදිය නොලබන අයෙක් වේ. ඔහු කයෙන් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. ඔහු කයෙන් දුසිරිත් කර, වචනයෙන් දුසිරිත් කර, සිතින් දුසිරිත් කර, ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුක් සහිත ස්ථානවල උපදී. ‘‘මහ රජ, යම්සේ පුරුෂයෙක් අන්ධකාරයෙන් අන්ධකාරයටම යන්නේද, අඳුරෙන් අඳුරටම යන්නේද, ලේ කිලිටි තැනකින් ලේ කිලිටි තැනකටම යන්නේද, මහ රජ, මම මේ පුද්ගලයා ඒ උපමාවට සමාන කොට කියමි. මහ රජ, මෙලෙසින් පුද්ගලයෙක් අන්ධකාරයෙන් අන්ධකාරයට යන තැනැත්තෙක් වේ.\n\n‘‘මහ රජ, පුද්ගලයෙක් කෙසේ අන්ධකාරයෙන් ආලෝකයට යන්නේද? මහ රජ, මෙලොව ඇතැම් පුද්ගලයෙක් චණ්ඩාල කුලයක හෝ වේන කුලයක හෝ නෙසාද කුලයක හෝ රථකාර කුලයක හෝ පුක්කුස කුලයක හෝ දුප්පත්, අල්ප වූ ආහාර පාන ඇති, ජීවිකාව දුෂ්කර වූ, අතිශයින්ම දුකසේ ආහාර වස්ත්‍ර​ාදිය ලැබෙන තැනක වැනි පහත් කුලයක උපදී. ඔහු දුර්වර්ණවූයේ, දුටුවන් පිළිකුල් කරවන සුළු වූයේ, කෙට්ටු, බොහෝ ආබාධ ඇති අයෙක් වේ; කනෙක් හෝ, අංගවිකල අයෙක් හෝ, කොරෙක් හෝ, අංශභාග රෝගියෙක් හෝ වේ. ඔහු ආහාර පාන, වස්ත්‍ර​ාදිය, යාන වාහන, මල් ගන්ධ විලේපන, සයනාසන, ගෙවල් දොරවල්, පහන් ආදිය නොලබන අයෙක් වේ. ඔහු කයෙන් සුසිරිත් කරයි, වචනයෙන් සුසිරිත් කරයි, සිතින් සුසිරිත් කරයි. ඔහු කයෙන් සුසිරිත් කර, වචනයෙන් සුසිරිත් කර, සිතින් සුසිරිත් කර, ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකවල උපදී. ‘‘මහ රජ, යම්සේ පුරුෂයෙක් පොළොවෙන් යහනකට නගින්නේද, යහනෙන් අස්පිටට නගින්නේද, අස්පිටින් ඇතාගේ කරට නගින්නේද, ඇතාගේ කරෙන් ප්‍ර​ාසාදයකට නගින්නේද, මහ රජ, මම මේ පුද්ගලයා ඒ උපමාවට සමාන කොට කියමි. මහ රජ, මෙලෙසින් පුද්ගලයෙක් අන්ධකාරයෙන් ආලෝකයට යන තැනැත්තෙක් වේ.\n\n‘‘මහ රජ, පුද්ගලයෙක් කෙසේ ආලෝකයෙන් අන්ධකාරයට යන්නේද? මහ රජ, මෙලොව ඇතැම් පුද්ගලයෙක් ක්ෂත්‍රිය මහසල් කුලයක හෝ බ්‍ර​ාහ්මණ මහසල් කුලයක හෝ ගහපති මහසල් කුලයක හෝ පොහොසත්, මහත් ධන සම්පත් ඇති, මහත් භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ වස්තු උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති උසස් කුලයක උපදී. ඔහු ඉතා රූප සම්පන්න වූ, දැකීමට ප්‍රිය උපදවන සුළු වූ, ප්‍ර​සන්න වූ, අග්‍ර වූ ශරීර වර්ණයකින් හා පිරිසිදු බවකින් යුක්ත වේ. ඔහු ආහාර පාන, වස්ත්‍ර​ාදිය, යාන වාහන, මල් ගන්ධ විලේපන, සයනාසන, ගෙවල් දොරවල්, පහන් ආදිය ලබන අයෙක් වේ. ඔහු කයෙන් දුසිරිත් කරයි, වචනයෙන් දුසිරිත් කරයි, සිතින් දුසිරිත් කරයි. ඔහු කයෙන් දුසිරිත් කර, වචනයෙන් දුසිරිත් කර, සිතින් දුසිරිත් කර, ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුක් සහිත ස්ථානවල උපදී. ‘‘මහ රජ, යම්සේ පුරුෂයෙක් ප්‍ර​ාසාදයකින් ඇතාගේ කරට බසින්නේද, ඇතාගේ කරෙන් අස්පිටට බසින්නේද, අස්පිටින් යහනකට බසින්නේද, යහනෙන් පොළොවට බසින්නේද, පොළොවෙන් අන්ධකාරයට පිවිසෙන්නේද, මහ රජ, මම මේ පුද්ගලයා ඒ උපමාවට සමාන කොට කියමි. මහ රජ, මෙලෙසින් පුද්ගලයෙක් ආලෝකයෙන් අන්ධකාරයට යන තැනැත්තෙක් වේ.\n\n‘‘මහ රජ, පුද්ගලයෙක් කෙසේ ආලෝකයෙන් ආලෝකයට යන්නේද? මහ රජ, මෙලොව ඇතැම් පුද්ගලයෙක් ක්ෂත්‍රිය මහසල් කුලයක හෝ බ්‍ර​ාහ්මණ මහසල් කුලයක හෝ ගහපති මහසල් කුලයක හෝ පොහොසත්, මහත් ධන සම්පත් ඇති, මහත් භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ වස්තු උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති උසස් කුලයක උපදී. ඔහු ඉතා රූප සම්පන්න වූ, දැකීමට ප්‍රිය උපදවන සුළු වූ, ප්‍ර​සන්න වූ, අග්‍ර වූ ශරීර වර්ණයකින් හා පිරිසිදු බවකින් යුක්ත වේ. ඔහු ආහාර පාන, වස්ත්‍ර​ාදිය, යාන වාහන, මල් ගන්ධ විලේපන, සයනාසන, ගෙවල් දොරවල්, පහන් ආදිය ලබන අයෙක් වේ. ඔහු කයෙන් සුසිරිත් කරයි, වචනයෙන් සුසිරිත් කරයි, සිතින් සුසිරිත් කරයි. ඔහු කයෙන් සුසිරිත් කර, වචනයෙන් සුසිරිත් කර, සිතින් සුසිරිත් කර, ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකවල උපදී.\n\nමහරාජ, යම්සේ පුරුෂයෙක් එක් යහනකින් තවත් යහනකට යන්නේද, අස්පිටකින් තවත් අස්පිටකට යන්නේද, ඇත්කඳකින් තවත් ඇත්කඳකට යන්නේද, ප්‍රාසාදයකින් තවත් ප්‍රාසාදයකට යන්නේද; මහරාජ, ඒ උපමාවෙන්ම මම මේ පුද්ගලයා ගැන කියමි. මහරාජ, මෙලෙසින් පුද්ගලයා ජෝතිජෝති පරායන වේ. මහරාජ, මේ පුද්ගලයන් සතර දෙනා ලෝකයෙහි සිටින්නාහ, විද්‍යමාන වන්නාහ.\n\nරජ, දුප්පත් පුරුෂයෙක් අශ්‍රද්ධාවන්තයෙක්, මසුරු කෙනෙක් වෙයි. කදරියයෙක්, පාපී සිතුවිලි ඇති, මිථ්‍යාදෘෂ්ටිකයෙක්, අනාදර ඇත්තෙක් වෙයි.\nඔහු ශ්‍රමණ බ්‍රාහ්මණයන්ට හෝ වෙනත් යාචකයන්ට හෝ අක්‍රෝෂ කරයි, පරිභව කරයි. නත්ථිකයෙක්, කිපෙනසුලු කෙනෙක් වෙයි.\nදෙනු ලබන දේ වළක්වයි, යදින්නන්ට භෝජනය ලබා නොදෙයි. ජනාධිපති, එබඳු පුරුෂයා මිය යන්නේ භයානක නිරයට යයි. තමෝතම පරායන වේ.\n\nරජ, දුප්පත් පුරුෂයෙක් ශ්‍රද්ධාවන්තයෙක්, මසුරු නොවන කෙනෙක් වෙයි. ශ්‍රේෂ්ඨ චේතනාවන් ඇති, නොකලබල සිතක් ඇති ඔහු දන් දෙයි.\nඔහු ශ්‍රමණ බ්‍රාහ්මණයන්ට හෝ වෙනත් යාචකයන්ට හෝ නැගී සිට ආචාර කරයි. ශාන්ත චර්යාව පුරුදු කරයි.\nදෙනු ලබන දේ වළක්වන්නේ නැත, යදින්නන්ට භෝජනය ලබා දෙයි. ජනාධිපති, එබඳු පුරුෂයා මිය යන්නේ දිව්‍යලෝක නම් තැනට යයි. තමෝජෝති පරායන වේ.\n\nරජ, ධනවත් පුරුෂයෙක් නම් අශ්‍රද්ධාවන්තයෙක්, මසුරු කෙනෙක් වෙයි. කදරියයෙක්, පාපී සිතුවිලි ඇති, මිථ්‍යාදෘෂ්ටිකයෙක්, අනාදර ඇත්තෙක් වෙයි.\nඔහු ශ්‍රමණ බ්‍රාහ්මණයන්ට හෝ වෙනත් යාචකයන්ට හෝ අක්‍රෝෂ කරයි, පරිභව කරයි. නත්ථිකයෙක්, කිපෙනසුලු කෙනෙක් වෙයි.\nදෙනු ලබන දේ වළක්වයි, යදින්නන්ට භෝජනය ලබා නොදෙයි. ජනාධිපති, එබඳු පුරුෂයා මිය යන්නේ භයානක නිරයට යයි. ජෝතිතම පරායන වේ.\n\nරජ, ධනවත් පුරුෂයෙක් නම් ශ්‍රද්ධාවන්තයෙක්, මසුරු නොවන කෙනෙක් වෙයි. ශ්‍රේෂ්ඨ චේතනාවන් ඇති, නොකලබල සිතක් ඇති ඔහු දන් දෙයි.\nඔහු ශ්‍රමණ බ්‍රාහ්මණයන්ට හෝ වෙනත් යාචකයන්ට හෝ නැගී සිට ආචාර කරයි. ශාන්ත චර්යාව පුරුදු කරයි.\nදෙනු ලබන දේ වළක්වන්නේ නැත, යදින්නන්ට භෝජනය ලබා දෙයි. ජනාධිපති, එබඳු පුරුෂයා මිය යන්නේ දිව්‍යලෝක නම් තැනට යයි. ජෝතිජෝති පරායන වේ.",
      "paliTitle": "Puggalasuttaṃ",
      "vagga": "Tatiyavaggo"
    },
    {
      "number": 133,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho rājānaṃ pasenadiṃ kosalaṃ bhagavā etadavoca – ‘‘handa, kuto nu tvaṃ, mahārāja, āgacchasi divādivassā’’ti? ‘‘Ayyikā me, bhante, kālaṅkatā jiṇṇā vuḍḍhā mahallikā addhagatā vayoanuppattā vīsavassasatikā jātiyā. Ayyikā kho pana me, bhante, piyā hoti manāpā. Hatthiratanena cepāhaṃ, bhante, labheyyaṃ ‘mā me ayyikā kālamakāsī’ti, hatthiratanampāhaṃ dadeyyaṃ – ‘mā me ayyikā kālamakāsī’ti. Assaratanena cepāhaṃ, bhante, labheyyaṃ ‘mā me ayyikā kālamakāsī’ti, assaratanampāhaṃ dadeyyaṃ – ‘mā me ayyikā kālamakāsī’ti. Gāmavarena cepāhaṃ bhante, labheyyaṃ ‘mā me ayyikā kālamakāsī’ti, gāmavarampāhaṃ dadeyyaṃ – ‘mā me ayyikā kālamakāsī’ti. Janapadapadesena [janapadena (sī. syā. pī.)] cepāhaṃ, bhante, labheyyaṃ ‘mā me ayyikā kālamakāsī’ti, janapadapadesampāhaṃ dadeyyaṃ – ‘mā me ayyikā kālamakāsī’ti. ‘Sabbe sattā, mahārāja, maraṇadhammā maraṇapariyosānā maraṇaṃ anatītā’ti. ‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāvasubhāsitamidaṃ, bhante, bhagavatā – sabbe sattā maraṇadhammā maraṇapariyosānā maraṇaṃ anatītā’’’ti. ‘‘Evametaṃ, mahārāja, evametaṃ, mahārāja! Sabbe sattā maraṇadhammā maraṇapariyosānā maraṇaṃ anatītā. Seyyathāpi, mahārāja, yāni kānici kumbhakārabhājanāni āmakāni ceva pakkāni ca sabbāni tāni bhedanadhammāni bhedanapariyosānāni bhedanaṃ anatītāni; evameva kho, mahārāja, sabbe sattā maraṇadhammā maraṇapariyosānā maraṇaṃ anatītā’’ti. Idamavoca…pe… ‘‘Sabbe sattā marissanti, maraṇantañhi jīvitaṃ; Yathākammaṃ gamissanti, puññapāpaphalūpagā; Nirayaṃ pāpakammantā, puññakammā ca suggatiṃ. ‘‘Tasmā kareyya kalyāṇaṃ, nicayaṃ samparāyikaṃ; Puññāni paralokasmiṃ, patiṭṭhā honti pāṇina’’nti.",
      "english": "The Blessed One said to King Pasenadi of Kosala, who was sitting to one side, “Well, great king, where have you come from so early in the day?”\n\n“My grandmother, venerable sir, has passed away. She was aged, grown old, advanced in years, having reached the end of her lifespan, a hundred and twenty years old by birth. My grandmother, venerable sir, was dear to me and delightful. If, venerable sir, I could obtain a wish by means of a precious elephant, that 'May my grandmother not die,' I would give a precious elephant for that wish, that 'May my grandmother not die.' If, venerable sir, I could obtain a wish by means of a precious horse, that 'May my grandmother not die,' I would give a precious horse for that wish, that 'May my grandmother not die.' If, venerable sir, I could obtain a wish by means of the best village, that 'May my grandmother not die,' I would give the best village for that wish, that 'May my grandmother not die.' If, venerable sir, I could obtain a wish by means of a district or region, that 'May my grandmother not die,' I would give a district or region for that wish, that 'May my grandmother not die.'”\n\n“All beings, great king, are subject to death, have death as their ultimate conclusion, and cannot escape death.”\n\n“It is amazing, venerable sir! It is astounding, venerable sir! How well spoken this has been by the Blessed One, venerable sir: 'All beings are subject to death, have death as their ultimate conclusion, and cannot escape death!'”\n\n“So it is, great king, so it is, great king! All beings are subject to death, have death as their ultimate conclusion, and cannot escape death. Just as, great king, whatever kinds of potter's vessels, both raw and fired, all of them are subject to breaking, have breaking as their ultimate conclusion, and cannot escape breaking; just so, great king, all beings are subject to death, have death as their ultimate conclusion, and cannot escape death.”\n\nAll beings will die, for life has death as its end;\nThey will go according to their actions, experiencing the results of wholesome and unwholesome deeds;\nThose who perform unwholesome deeds go to the lower realms, while those who perform wholesome deeds go to the happy destinations.\nTherefore, one should perform wholesome deeds, an accumulation for the future;\nFor wholesome deeds are a support for beings in the next world.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඑක් පසෙක වාඩි වී සිටි කෝසල රජු වූ පසේනදි රජුට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහරජ, දැන් ඔබ දහවල් කාලයේ කොහේ සිට පැමිණෙන්නේද?” “ස්වාමීනි, මාගේ මිත්තණිය කාලක්‍රියා කළාය. ඇය මහලු වූ, වයෝවෘද්ධ වූ, වයසට පැමිණි, අවුරුදු එකසිය විස්සක් වූ තැනැත්තියක් වූවාය. ස්වාමීනි, මාගේ මිත්තණිය මට ප්‍රිය වූ, මනාප වූ තැනැත්තියක් වූවාය. ස්වාමීනි, මාගේ මිත්තණිය මිය නොයාවා යි යන සිතින්, වටිනා ඇත්රුවනක් දීමෙන් මා හට ඒ (මිය නොයාමේ) අවස්ථාව ලැබුණේ නම්, මා ඒ වටිනා ඇත්රුවන දීමට සූදානම්ව සිටියෙමි. ස්වාමීනි, මාගේ මිත්තණිය මිය නොයාවා යි යන සිතින්, වටිනා අසරුවනක් දීමෙන් මා හට ඒ (මිය නොයාමේ) අවස්ථාව ලැබුණේ නම්, මා ඒ වටිනා අසරුවන දීමට සූදානම්ව සිටියෙමි. ස්වාමීනි, මාගේ මිත්තණිය මිය නොයාවා යි යන සිතින්, විශිෂ්ට ගම්වරයක් දීමෙන් මා හට ඒ (මිය නොයාමේ) අවස්ථාව ලැබුණේ නම්, මා ඒ විශිෂ්ට ගම්වරය දීමට සූදානම්ව සිටියෙමි. ස්වාමීනි, මාගේ මිත්තණිය මිය නොයාවා යි යන සිතින්, ජනපද ප්‍රදේශයක් දීමෙන් මා හට ඒ (මිය නොයාමේ) අවස්ථාව ලැබුණේ නම්, මා ඒ ජනපද ප්‍රදේශය දීමට සූදානම්ව සිටියෙමි.”\n\n“මහරජ, සියලු සත්ත්වයෝ මරණ ස්වභාවයෙන් යුක්තයෝය; මරණයෙන් කෙළවර වන්නෝය; මරණය ඉක්මවා නොයන්නෝය.” “ආශ්චර්යයකි, ස්වාමීනි, අද්භූතයකි, ස්වාමීනි! ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් මෙය ඉතා මැනවින් වදාරන ලද්දකි – ‘සියලු සත්ත්වයෝ මරණ ස්වභාවයෙන් යුක්තයෝය; මරණයෙන් කෙළවර වන්නෝය; මරණය ඉක්මවා නොයන්නෝය.’”\n\n“මහරජ, ඒ එසේමය, මහරජ, ඒ එසේමය! සියලු සත්ත්වයෝ මරණ ස්වභාවයෙන් යුක්තයෝය; මරණයෙන් කෙළවර වන්නෝය; මරණය ඉක්මවා නොයන්නෝය. මහරජ, යම් සේ කුඹල්කරුවෙකුගේ අමු වූ ද, ගින්නෙන් පිසූ (දැන්වූ) ද යම් බඳුන් වේද, ඒ සියල්ල බිඳී යන ස්වභාවයෙන් යුක්තය; බිඳී යාමෙන් කෙළවර වන්නේය; බිඳී යාම ඉක්මවා නොයන්නේය. මහරජ, ඒ අයුරින්ම සියලු සත්ත්වයෝ මරණ ස්වභාවයෙන් යුක්තයෝය; මරණයෙන් කෙළවර වන්නෝය; මරණය ඉක්මවා නොයන්නෝය.” භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\nසියලු සත්ත්වයෝ මිය යති; ජීවිතය මරණයෙන් කෙළවර වන්නේමය.\nතමන්ගේ කුසල් සහ අකුසල් ඵලයන්ට අනුව, කර්මයට ගැලපෙන සේ ඔව්හු යන්නාහ.\nපාපකර්ම කරන්නෝ නිරයටත්, පුණ්‍යකර්ම කරන්නෝ සුගතියටත් යන්නාහ.\nඑහෙයින්, පරලොව පිණිස යහපත රැස් කරගත යුතු ය.\nපරලොවදී සත්ත්වයන්ට පිහිට වන්නේ කුසල්මය.",
      "paliTitle": "Ayyikāsuttaṃ"
    },
    {
      "number": 134,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, lokassa dhammā uppajjamānā uppajjanti ahitāya dukkhāya aphāsuvihārāyā’’ti? ‘‘Tayo kho, mahārāja, lokassa dhammā uppajjamānā uppajjanti ahitāya dukkhāya aphāsuvihārāya. Katame tayo? Lobho kho, mahārāja, lokassa dhammo, uppajjamāno uppajjati ahitāya dukkhāya aphāsuvihārāya. Doso kho, mahārāja, lokassa dhammo, uppajjamāno uppajjati ahitāya dukkhāya aphāsuvihārāya. Moho kho, mahārāja, lokassa dhammo, uppajjamāno uppajjati ahitāya dukkhāya aphāsuvihārāya. Ime kho, mahārāja, tayo lokassa dhammā uppajjamānā uppajjanti ahitāya dukkhāya aphāsuvihārāyā’’ti. Idamavoca…pe… ‘‘Lobho doso ca moho ca, purisaṃ pāpacetasaṃ; Hiṃsanti attasambhūtā, tacasāraṃva samphala’’nti.",
      "english": "At Sāvatthī, King Pasenadi of Kosala, seated to one side, said this to the Blessed One: “How many phenomena in the world, venerable sir, when they arise, arise for misfortune, for suffering, and for an uncomfortable existence?”\n\n“Indeed, great king, three phenomena in the world, when they arise, arise for misfortune, for suffering, and for an uncomfortable existence. Which three are these? Greed, indeed, great king, is a phenomenon in the world which, when it arises, arises for misfortune, for suffering, and for an uncomfortable existence. Aversion, indeed, great king, is a phenomenon in the world which, when it arises, arises for misfortune, for suffering, and for an uncomfortable existence. Delusion, indeed, great king, is a phenomenon in the world which, when it arises, arises for misfortune, for suffering, and for an uncomfortable existence. These, indeed, great king, are the three phenomena in the world which, when they arise, arise for misfortune, for suffering, and for an uncomfortable existence.”\n\nThe Blessed One spoke this:\n“Greed, aversion, and delusion torment the person with an unwholesome mind, having arisen from within themselves, just as a pith-eater destroys its tree.”",
      "sinhala": "සැවැත්නුවරදී සිදුවූ දේශනාවකි.\n\nඑක් කලෙක කොසොල් රජු වන පසේනදී භාග්‍ය[ZWJ]වතුන් වහන්සේ වෙත පැමිණ, එකත්පස්ව වාඩි වී, භාග්‍ය[ZWJ]වතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, ලෝකයෙහි යම් ධර්මතා උපදින්නාහු නම්, ඒවා අහිත පිණිස, දුක් පිණිස, අසහනීය පැවැත්ම පිණිස කෙතරම් නම් පැනනගීද?”\n\n“මහ රජ, ලෝකයෙහි ධර්මතා තුනක් හටගනිමින් අහිත පිණිස, දුක් පිණිස, අසහනීය පැවැත්ම පිණිස පැනනගී. ඒ කවර තුනක්ද? මහ රජ, ලෝභය නම් වූ ධර්මය, හටගනිමින් පැනනැඟී අහිත පිණිස, දුක් පිණිස, අසහනීය පැවැත්ම පිණිස පවතී. මහ රජ, දෝෂය නම් වූ ධර්මය, හටගනිමින් පැනනැඟී අහිත පිණිස, දුක් පිණිස, අසහනීය පැවැත්ම පිණිස පවතී. මහ රජ, මෝහය නම් වූ ධර්මය, හටගනිමින් පැනනැඟී අහිත පිණිස, දුක් පිණිස, අසහනීය පැවැත්ම පිණිස පවතී. මහ රජ, මේ ධර්මතා තුනම හටගනිමින් පැනනැඟී අහිත පිණිස, දුක් පිණිස, අසහනීය පැවැත්ම පිණිස පවතී.”\n\nභාග්‍ය[ZWJ]වතුන් වහන්සේ මෙය වදාළ සේක. ඉන්පසු මෙසේද වදාළ සේක:\n“පව් සිත් ඇති පුරුෂයාට,\nතමාගෙන්ම හටගත් ලෝභය, දෝෂය සහ මෝහය යන මේවා,\nතමාගේම ගසේ පට්ටා සාරය නසන ඵලයක් මෙන්,\nඔහුව විනාශ කරයි.”",
      "paliTitle": "Lokasuttaṃ"
    },
    {
      "number": 135,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho rājā pasenadi kosalo bhagavantaṃ etadavoca – ‘‘kattha nu kho, bhante, dānaṃ dātabba’’nti? ‘‘Yattha kho, mahārāja, cittaṃ pasīdatī’’ti. ‘‘Kattha pana, bhante, dinnaṃ mahapphala’’nti? ‘‘Aññaṃ kho etaṃ, mahārāja, kattha dānaṃ dātabbaṃ, aññaṃ panetaṃ kattha dinnaṃ mahapphalanti? Sīlavato kho, mahārāja, dinnaṃ mahapphalaṃ, no tathā dussīle. Tena hi, mahārāja, taññevettha paṭipucchissāmi. Yathā, te khameyya, tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, mahārāja, idha tyassa yuddhaṃ paccupaṭṭhitaṃ saṅgāmo samupabyūḷho [samūpabbūḷho (sī.), samupabbuḷho (pī.)]. Atha āgaccheyya khattiyakumāro asikkhito akatahattho akatayoggo akatūpāsano bhīru chambhī utrāsī palāyī. Bhareyyāsi taṃ purisaṃ, attho ca te tādisena purisenā’’ti? ‘‘Nāhaṃ, bhante, bhareyyaṃ taṃ purisaṃ, na ca me attho tādisena purisenā’’ti. ‘‘Atha āgaccheyya brāhmaṇakumāro asikkhito…pe… atha āgaccheyya vessakumāro asikkhito…pe… atha āgaccheyya suddakumāro asikkhito…pe… na ca me attho tādisena purisenā’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, idha tyassa yuddhaṃ paccupaṭṭhitaṃ saṅgāmo samupabyūḷho. Atha āgaccheyya khattiyakumāro susikkhito katahattho katayoggo katūpāsano abhīru acchambhī anutrāsī apalāyī. Bhareyyāsi taṃ purisaṃ, attho ca te tādisena purisenā’’ti? ‘‘Bhareyyāhaṃ, bhante, taṃ purisaṃ, attho ca me tādisena purisenā’’ti. ‘‘Atha āgaccheyya brāhmaṇakumāro…pe… atha āgaccheyya vessakumāro…pe… atha āgaccheyya suddakumāro susikkhito katahattho katayoggo katūpāsano abhīru acchambhī anutrāsī apalāyī. Bhareyyāsi taṃ purisaṃ, attho ca te tādisena purisenā’’ti? ‘‘Bhareyyāhaṃ, bhante, taṃ purisaṃ, attho ca me tādisena purisenā’’ti. ‘‘Evameva kho, mahārāja, yasmā kasmā cepi [yasmā cepi (sī. syā. kaṃ. ka.)] kulā agārasmā anagāriyaṃ pabbajito hoti, so ca hoti pañcaṅgavippahīno pañcaṅgasamannāgato, tasmiṃ dinnaṃ mahapphalaṃ hoti. Katamāni pañcaṅgāni pahīnāni honti? Kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Imāni pañcaṅgāni pahīnāni honti. Katamehi pañcahaṅgehi samannāgato hoti? Asekkhena sīlakkhandhena samannāgato hoti, asekkhena samādhikkhandhena samannāgato hoti, asekkhena paññākkhandhena samannāgato hoti, asekkhena vimuttikkhandhena samannāgato hoti, asekkhena vimuttiñāṇadassanakkhandhena samannāgato hoti. Imehi pañcahaṅgehi samannāgato hoti. Iti pañcaṅgavippahīne pañcaṅgasamannāgate dinnaṃ mahapphala’’nti. Idamavoca bhagavā…pe… satthā – ‘‘Issattaṃ [issatthaṃ (sī. syā. kaṃ.)] balavīriyañca [balaviriyañca (sī. syā. kaṃ. pī.)], yasmiṃ vijjetha māṇave; Taṃ yuddhattho bhare rājā, nāsūraṃ jātipaccayā. ‘‘Tatheva khantisoraccaṃ, dhammā yasmiṃ patiṭṭhitā; Ariyavuttiṃ medhāviṃ, hīnajaccampi pūjaye. ‘‘Kāraye assame ramme, vāsayettha bahussute; Papañca vivane kayirā, dugge saṅkamanāni ca. ‘‘Annaṃ pānaṃ khādanīyaṃ, vatthasenāsanāni ca; Dadeyya ujubhūtesu, vippasannena cetasā. ‘‘Yathā hi megho thanayaṃ, vijjumālī satakkaku; Thalaṃ ninnañca pūreti, abhivassaṃ vasundharaṃ. ‘‘Tatheva saddho sutavā, abhisaṅkhacca bhojanaṃ; Vanibbake tappayati, annapānena paṇḍito. ‘‘Āmodamāno pakireti, detha dethāti bhāsati; Taṃ hissa gajjitaṃ hoti, devasseva pavassato; Sā puññadhārā vipulā, dātāraṃ abhivassatī’’ti.",
      "english": "At Savatthi. King Pasenadi of Kosala, sitting to one side, then said to the Blessed One, “Venerable Sir, where should a gift be given?”\n\n“Wherever, great king, the mind is gladdened,” said the Blessed One.\n\n“But where, Venerable Sir, is a gift given of great fruit?”\n\n“It is one thing, great king, where a gift should be given, and another thing where a gift given yields great fruit. Indeed, great king, a gift given to one who is virtuous is of great fruit, but not so to one who is immoral. Therefore, great king, I shall question you on this very matter. You should answer it as it seems fitting to you. What do you think, great king? Suppose here there was a battle at hand, a war arrayed. Then suppose there came a young kshatriya, untrained, unskillful with weapons, unpracticed, unfamiliar with combat, fearful, trembling, terrified, a deserter. Would you maintain that man? Would you have use for such a man?”\n\n“No, Venerable Sir, I would not maintain that man, nor would I have use for such a man.”\n\n“Then suppose there came a young brahmin, untrained, unskillful with weapons, unpracticed, unfamiliar with combat, fearful, trembling, terrified, a deserter. Then suppose there came a young vaishya, untrained, unskillful with weapons, unpracticed, unfamiliar with combat, fearful, trembling, terrified, a deserter. Then suppose there came a young shudra, untrained, unskillful with weapons, unpracticed, unfamiliar with combat, fearful, trembling, terrified, a deserter. Would you maintain that man? Would you have use for such a man?”\n\n“No, Venerable Sir, I would not maintain that man, nor would I have use for such a man.”\n\n“What do you think, great king? Suppose here there was a battle at hand, a war arrayed. Then suppose there came a young kshatriya, well-trained, skillful with weapons, practiced, familiar with combat, fearless, untrembling, unterrified, a non-deserter. Would you maintain that man? Would you have use for such a man?”\n\n“Yes, Venerable Sir, I would maintain that man, and I would have use for such a man.”\n\n“Then suppose there came a young brahmin, well-trained, skillful with weapons, practiced, familiar with combat, fearless, untrembling, unterrified, a non-deserter. Then suppose there came a young vaishya, well-trained, skillful with weapons, practiced, familiar with combat, fearless, untrembling, unterrified, a non-deserter. Then suppose there came a young shudra, well-trained, skillful with weapons, practiced, familiar with combat, fearless, untrembling, unterrified, a non-deserter. Would you maintain that man? Would you have use for such a man?”\n\n“Yes, Venerable Sir, I would maintain that man, and I would have use for such a man.”\n\n“Even so, great king, whoever from any family has gone forth from the home life into homelessness, and is endowed with the relinquishment of five factors and the possession of five factors, a gift given to such a one is of great fruit. Which are the five factors that are relinquished? Sensual desire is relinquished, ill-will is relinquished, sloth and torpor are relinquished, restlessness and remorse are relinquished, doubt is relinquished. These are the five factors that are relinquished. With which five factors is one endowed? One is endowed with the unconditioned aggregate of virtue, one is endowed with the unconditioned aggregate of concentration, one is endowed with the unconditioned aggregate of wisdom, one is endowed with the unconditioned aggregate of liberation, one is endowed with the unconditioned aggregate of the knowledge and vision of liberation. With these five factors is one endowed. Thus, a gift given to one who has relinquished five factors and is endowed with five factors is of great fruit.”\n\nThe Blessed One said this. The Teacher then spoke these verses:\n\nIn whatever youth archery, strength, and vigor are found,\nThat one the king, desiring battle, will maintain,\nNot one who is unskilled merely because of his birth.\n\nLikewise, patience and gentleness, and the Dhamma in which one is established—\nA wise person of noble conduct, even if of lowly birth, should be honored.\n\nOne should build pleasant monasteries,\nAnd house many learned ones there.\nOne should also make refuges in dense forests,\nAnd bridges over difficult paths.\n\nFood, drink, edibles, clothes, and lodging—\nThese one should give to those who are upright,\nWith a mind full of serene confidence.\n\nJust as a thunderous cloud, adorned with lightning and having a hundred peaks,\nFills the high ground and the low ground, showering rain upon the earth;\nJust so, the wise person, being faithful and learned,\nHaving prepared the meal, satisfies those who come seeking alms with food and drink.\n\nJoyfully he disperses, saying, 'Give! Give!'\nThat is his thunder, just like a raining god's;\nThat vast stream of merit showers upon the giver.",
      "sinhala": "සැවැත්නුවරදී සිදුවූ දේශනාවකි.\n\nඑක් පසෙක වාඩි වී සිටි කොසොල් රජු භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවා: \"ස්වාමීනි, දානය දිය යුත්තේ කොහේද?\"\n\"මහරජ, සිත පහදින තැනයි.\"\n\"නමුත් ස්වාමීනි, දුන් දානයෙන් මහත් ඵල ලැබෙන්නේ කොහේද?\"\n\"මහරජ, දානය දිය යුත්තේ කොහේද යන්න එක් කරුණකි; නමුත් දුන් දානයෙන් මහත් ඵල ලැබෙන්නේ කොහේද යන්න තවත් කරුණකි. මහරජ, සිල්වත් අයට දුන් දානය මහත් ඵලය. එහෙත් දුසිල් අයට එසේ නොවේ. එබැවින් මහරජ, මම ඔබගෙන්ම මේ පිළිබඳව විමසමි. ඔබට කැමති පරිදි එය විස්තර කරන්න.\"\n\"මහරජ, ඔබ මේ ගැන කුමක් සිතනවාද? ඔබට යුද්ධයක් පැමිණ, සටනක් සූදානම් කර ඇති විට, නොපුහුණු, අදක්ෂ, අභ්‍යාසයෙන් තොර, දුනු ශිල්පයේ නුපුරුදු, භයගුළු, බියපත්, තැතිගත්, පලායන ක්ෂත්‍රිය කුමාරයෙක් පැමිණියහොත්, ඔබ එම පුද්ගලයාට භාරකාරත්වය දෙන්නේද? ඔබට එවැනි පුද්ගලයෙකුගෙන් ප්‍රයෝජනයක් ඇත්ද?\"\n\"නැත ස්වාමීනි, මම එවැනි පුද්ගලයෙකුට භාරකාරත්වය නොදෙමි, එවැනි පුද්ගලයෙකුගෙන් මට ප්‍රයෝජනයක්ද නැත.\"\n\"එවිට නොපුහුණු, අදක්ෂ, අභ්‍යාසයෙන් තොර, දුනු ශිල්පයේ නුපුරුදු, භයගුළු, බියපත්, තැතිගත්, පලායන බ්‍රාහ්මණ කුමාරයෙක් පැමිණියහොත්... නොපුහුණු, අදක්ෂ, අභ්‍යාසයෙන් තොර, දුනු ශිල්පයේ නුපුරුදු, භයගුළු, බියපත්, තැතිගත්, පලායන වෛශ්‍ය කුමාරයෙක් පැමිණියහොත්... නොපුහුණු, අදක්ෂ, අභ්‍යාසයෙන් තොර, දුනු ශිල්පයේ නුපුරුදු, භයගුළු, බියපත්, තැතිගත්, පලායන ශුද්‍ර කුමාරයෙක් පැමිණියහොත්... එවැනි පුද්ගලයෙකුගෙන් මට ප්‍රයෝජනයක්ද නැතැයි ඔබ කියන්නේද?\"\n\"මහරජ, ඔබ මේ ගැන කුමක් සිතනවාද? ඔබට යුද්ධයක් පැමිණ, සටනක් සූදානම් කර ඇති විට, හොඳින් පුහුණු වූ, දක්ෂ, අභ්‍යාසලත්, දුනු ශිල්පයේ නිපුණ, නිර්භීත, නොසැලෙන, බිය නොවන, නොපලායන ක්ෂත්‍රිය කුමාරයෙක් පැමිණියහොත්, ඔබ එම පුද්ගලයාට භාරකාරත්වය දෙන්නේද? ඔබට එවැනි පුද්ගලයෙකුගෙන් ප්‍රයෝජනයක් ඇත්ද?\"\n\"එසේය ස්වාමීනි, මම එවැනි පුද්ගලයෙකුට භාරකාරත්වය දෙමි, එවැනි පුද්ගලයෙකුගෙන් මට ප්‍රයෝජනයක්ද ඇත.\"\n\"එවිට හොඳින් පුහුණු වූ, දක්ෂ, අභ්‍යාසලත්, දුනු ශිල්පයේ නිපුණ, නිර්භීත, නොසැලෙන, බිය නොවන, නොපලායන බ්‍රාහ්මණ කුමාරයෙක් පැමිණියහොත්... හොඳින් පුහුණු වූ, දක්ෂ, අභ්‍යාසලත්, දුනු ශිල්පයේ නිපුණ, නිර්භීත, නොසැලෙන, බිය නොවන, නොපලායන වෛශ්‍ය කුමාරයෙක් පැමිණියහොත්... හොඳින් පුහුණු වූ, දක්ෂ, අභ්‍යාසලත්, දුනු ශිල්පයේ නිපුණ, නිර්භීත, නොසැලෙන, බිය නොවන, නොපලායන ශුද්‍ර කුමාරයෙක් පැමිණියහොත්... ඔබට එවැනි පුද්ගලයෙකුගෙන් ප්‍රයෝජනයක් ඇත්ද?\"\n\"එසේය ස්වාමීනි, මම එවැනි පුද්ගලයෙකුට භාරකාරත්වය දෙමි, එවැනි පුද්ගලයෙකුගෙන් මට ප්‍රයෝජනයක්ද ඇත.\"\n\n\"මහරජ, එලෙසම, යම් කිසි කුලයකින් ගිහිගෙයින් නික්ම අනගාරිකත්වයෙහි පැවිදි වූවෙක්, පංචාංගයන් (පස් අංගයන්) ප්‍ර‌හීණ කළ, පංචාංගයකින් සමන්විත වූවෙක් වේ නම්, ඔහුට දුන් දානය මහත් ඵලය. ප්‍ර‌හීණ කළ පංචාංග මොනවාද? කාමච්ඡන්දය ප්‍ර‌හීණ කර ඇත, ව්‍යාපාදය ප්‍ර‌හීණ කර ඇත, ථීනමිද්ධය ප්‍ර‌හීණ කර ඇත, උද්ධච්චකුක්කුච්චය ප්‍ර‌හීණ කර ඇත, විචිකිච්ඡාව ප්‍ර‌හීණ කර ඇත. මේ පංචාංග ප්‍ර‌හීණ කර ඇත. කුමන පංචාංගයකින් සමන්විත වේද? අසෙක‍්ඛ සීලස්කන්ධයෙන් සමන්විත වේ, අසෙක‍්ඛ සමාධිස්කන්ධයෙන් සමන්විත වේ, අසෙක‍්ඛ ප්‍ර‌ඥාස්කන්ධයෙන් සමන්විත වේ, අසෙක‍්ඛ විමුක්තිස්කන්ධයෙන් සමන්විත වේ, අසෙක‍්ඛ විමුක්ති ඥා‌නදර්ශනස්කන්ධයෙන් සමන්විත වේ. මේ පංචාංගයෙන් ඔහු සමන්විත වේ. මෙසේ පංචාංගයන් ප්‍ර‌හීණ කළ, පංචාංගයකින් සමන්විත වූවෙකුට දුන් දානය මහත් ඵලය.\"\n\nභාග්‍යවතුන් වහන්සේ මේ දෙසුම පැවසුවා... (සහ) ශාස්තෘන් වහන්සේ මෙසේද වදාළා:\n\nයම් මානවයෙකු තුළ දුනු ශිල්පය, ශක්තිය සහ වීර්‍ය්‍යය පිහිටා ඇත්නම්, යුද්ධය අපේක්ෂා කරන රජු, ජාතිය නිසා පමණක් නොවී, ඔහුට භාරකාරත්වය දෙයි.\n\nඑලෙසම, යම් කෙනෙකු තුළ ක්ෂාන්තිය සහ සෝරච්චය (ඉන්ද්‍රිය සංවරය) යන ධර්මයන් පිහිටා ඇත්නම්, ප්‍ර‌ඥාවන්තයා, ඔහුගේ ආර්‍ය්‍ය වෘත්තිය (උතුම් පැවැත්ම) හේතුවෙන්, පහත් ජාතියක උපන්නෙකු වුවද, ඔහුට ගෞරව කළ යුතුය.\n\nරමණීය ආශ්‍රම කරවා, බොහෝ ඇසූ පිරූ තැන් ඇති අය එහි වාසය කරවයි. වනයෙහි දිය පොකුණුත්, දුර්ග මාර්ගවල පාලම් හා අගල් තරණයට මංපෙත් ද කරවයි.\n\nආහාර, පාන, කැවිලි, වස්ත්‍ර සහ සේනාසන (ඇඳ පුටු) යන මේවා අවංක අයට, ඉතා පැහැදුණු සිතකින් දිය යුතුය.\n\nනගිනා හඬින් යුත්, විදුලි කෙටි සහිත, සිය දිය දහරින් ගහන, පොළොව තෙත් කරමින් වසින වර්ෂා මේඝයක් උස්බිම් සහ මිටි බිම් පුරවන්නා සේම,\n\nඑලෙසම, ශ්‍ර‌ද්ධාවන්ත, ඇසූ පිරූ තැන් ඇති පණ්ඩිතයා, ආහාරපාන සූදානම් කර, යාචකයින්ට ආහාරපානයෙන් සන්තර්පණය කරයි.\n\nඔහු ප්‍ර‌ීතිමත් සිතින් බෙදා දෙමින්, 'දෙන්න, දෙන්න' යැයි කියයි. එය වසින වැහි වලාහකයාගේ ගිගුම් හඬ මෙන් වේ. එම මහත් පුණ්‍ය ධාරාව දායකයාට වැසි වස්සවයි.",
      "paliTitle": "Issattasuttaṃ"
    },
    {
      "number": 136,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho rājānaṃ pasenadiṃ kosalaṃ bhagavā etadavoca – ‘‘handa, kuto nu tvaṃ, mahārāja, āgacchasi divā divassā’’ti? ‘‘Yāni tāni, bhante, raññaṃ khattiyānaṃ muddhāvasittānaṃ issariyamadamattānaṃ kāmagedhapariyuṭṭhitānaṃ janapadatthāvariyappattānaṃ mahantaṃ pathavimaṇḍalaṃ abhivijiya ajjhāvasantānaṃ rājakaraṇīyāni bhavanti, tesu khvāhaṃ, etarahi ussukkamāpanno’’ti. ‘‘Taṃ kiṃ maññasi, mahārāja, idha te puriso āgaccheyya puratthimāya disāya saddhāyiko paccayiko. So taṃ upasaṅkamitvā evaṃ vadeyya – ‘yagghe, mahārāja, jāneyyāsi, ahaṃ āgacchāmi puratthimāya disāya. Tatthaddasaṃ mahantaṃ pabbataṃ abbhasamaṃ sabbe pāṇe nippothento āgacchati. Yaṃ te, mahārāja, karaṇīyaṃ, taṃ karohī’ti. Atha dutiyo puriso āgaccheyya pacchimāya disāya…pe… atha tatiyo puriso āgaccheyya uttarāya disāya…pe… atha catuttho puriso āgaccheyya dakkhiṇāya disāya saddhāyiko paccayiko. So taṃ upasaṅkamitvā evaṃ vadeyya – ‘yagghe mahārāja, jāneyyāsi, ahaṃ āgacchāmi dakkhiṇāya disāya. Tatthaddasaṃ mahantaṃ pabbataṃ abbhasamaṃ sabbe pāṇe nippothento āgacchati. Yaṃ te, mahārāja, karaṇīyaṃ taṃ karohī’ti. Evarūpe te, mahārāja, mahati mahabbhaye samuppanne dāruṇe manussakkhaye [manussakāye (ka.)] dullabhe manussatte kimassa karaṇīya’’nti? ‘‘Evarūpe me, bhante, mahati mahabbhaye samuppanne dāruṇe manussakkhaye dullabhe manussatte kimassa karaṇīyaṃ aññatra dhammacariyāya aññatra samacariyāya aññatra kusalakiriyāya aññatra puññakiriyāyā’’ti? ‘‘Ārocemi kho te, mahārāja, paṭivedemi kho te, mahārāja, adhivattati kho taṃ, mahārāja, jarāmaraṇaṃ. Adhivattamāne ce te, mahārāja, jarāmaraṇe kimassa karaṇīya’’nti? ‘‘Adhivattamāne ca me, bhante, jarāmaraṇe kimassa karaṇīyaṃ aññatra dhammacariyāya samacariyāya kusalakiriyāya puññakiriyāya? Yāni tāni, bhante, raññaṃ khattiyānaṃ muddhāvasittānaṃ issariyamadamattānaṃ kāmagedhapariyuṭṭhitānaṃ janapadatthāvariyappattānaṃ mahantaṃ pathavimaṇḍalaṃ abhivijiya ajjhāvasantānaṃ hatthiyuddhāni bhavanti; tesampi, bhante, hatthiyuddhānaṃ natthi gati natthi visayo adhivattamāne jarāmaraṇe. Yānipi tāni, bhante, raññaṃ khattiyānaṃ muddhāvasittānaṃ…pe… ajjhāvasantānaṃ assayuddhāni bhavanti…pe… rathayuddhāni bhavanti …pe… pattiyuddhāni bhavanti; tesampi, bhante, pattiyuddhānaṃ natthi gati natthi visayo adhivattamāne jarāmaraṇe. Santi kho pana, bhante, imasmiṃ rājakule mantino mahāmattā, ye pahonti [yesaṃ honti (ka.)] āgate paccatthike mantehi bhedayituṃ. Tesampi, bhante, mantayuddhānaṃ natthi gati natthi visayo adhivattamāne jarāmaraṇe. Saṃvijjati kho pana, bhante, imasmiṃ rājakule pahūtaṃ hiraññasuvaṇṇaṃ bhūmigatañceva vehāsaṭṭhañca, yena mayaṃ pahoma āgate paccatthike dhanena upalāpetuṃ. Tesampi, bhante, dhanayuddhānaṃ natthi gati natthi visayo adhivattamāne jarāmaraṇe. Adhivattamāne ca me, bhante, jarāmaraṇe kimassa karaṇīyaṃ aññatra dhammacariyāya samacariyāya kusalakiriyāya puññakiriyāyā’’ti? ‘‘Evametaṃ, mahārāja, evametaṃ, mahārāja! Adhivattamāne jarāmaraṇe kimassa karaṇīyaṃ aññatra dhammacariyāya samacariyāya kusalakiriyāya puññakiriyāyā’’ti? Idamavoca bhagavā…pe… satthā – ‘‘Yathāpi selā vipulā, nabhaṃ āhacca pabbatā; Samantānupariyāyeyyuṃ, nippothento catuddisā. ‘‘Evaṃ jarā ca maccu ca, adhivattanti pāṇine [pāṇino (sī. syā. kaṃ. pī.)]; Khattiye brāhmaṇe vesse, sudde caṇḍālapukkuse; Na kiñci [na kañci (?)] parivajjeti, sabbamevābhimaddati. ‘‘Na tattha hatthīnaṃ bhūmi, na rathānaṃ na pattiyā; Na cāpi mantayuddhena, sakkā jetuṃ dhanena vā. ‘‘Tasmā hi paṇḍito poso, sampassaṃ atthamattano; Buddhe dhamme ca saṅghe ca, dhīro saddhaṃ nivesaye. ‘‘Yo dhammaṃ cari [dhammacārī (sī. syā. kaṃ. pī.)] kāyena, vācāya uda cetasā; Idheva naṃ pasaṃsanti, pecca sagge pamodatī’’ti. Tatiyo vaggo. Tassuddānaṃ – Puggalo ayyikā loko, issattaṃ [issatthaṃ (sī. syā. kaṃ.)] pabbatūpamā; Desitaṃ buddhaseṭṭhena, imaṃ kosalapañcakanti. ",
      "english": "At Savatthi, the Blessed One said to King Pasenadi of Kosala, who was sitting to one side, “Well then, great king, from where are you coming at this time of day?”\n\n“Bhante, I am presently engaged in those royal duties which belong to anointed warrior-kings, who are intoxicated by the pride of sovereignty, overcome by the lust for sensual pleasures, who have attained stability in their realm, and who have conquered and dwell in a mighty region of the earth.”\n\n“What do you think, great king? Suppose a trustworthy and reliable man came to you from the eastern direction. He would approach you and say this: ‘Please know, great king, I have come from the eastern direction. There I saw a huge mountain, like a cloud, coming, crushing all living beings. Whatever you need to do, great king, do it.’ Then a second man would come from the western direction... then a third man would come from the northern direction... then a fourth trustworthy and reliable man would come from the southern direction. He would approach you and say this: ‘Please know, great king, I have come from the southern direction. There I saw a huge mountain, like a cloud, coming, crushing all living beings. Whatever you need to do, great king, do it.’ When such a great and terrible danger has arisen for you, great king, a dreadful destruction of humanity, in this rare human existence, what should be done?”\n\n“Bhante, when such a great and terrible danger has arisen for me, a dreadful destruction of humanity, in this rare human existence, what should be done other than practicing the Dhamma, other than practicing equanimity, other than performing wholesome deeds, other than performing meritorious deeds?”\n\n“I declare to you, great king, I make known to you, great king: aging and death are approaching you. When aging and death are approaching you, great king, what should be done?”\n\n“Bhante, when aging and death are approaching me, what should be done other than practicing the Dhamma, practicing equanimity, performing wholesome deeds, performing meritorious deeds? Bhante, even those elephant battles that belong to anointed warrior-kings—intoxicated by the pride of sovereignty, overcome by the lust for sensual pleasures, who have attained stability in their realm, and who have conquered and dwell in a mighty region of the earth—even for those, Bhante, there is no escape, no sphere of action, when aging and death are approaching.\n\nAnd Bhante, even those horse battles that belong to anointed warrior-kings—intoxicated by the pride of sovereignty, overcome by the lust for sensual pleasures, who have attained stability in their realm, and who have conquered and dwell in a mighty region of the earth—even for those, Bhante, there is no escape, no sphere of action, when aging and death are approaching.\n\nAnd Bhante, even those chariot battles that belong to anointed warrior-kings—intoxicated by the pride of sovereignty, overcome by the lust for sensual pleasures, who have attained stability in their realm, and who have conquered and dwell in a mighty region of the earth—even for those, Bhante, there is no escape, no sphere of action, when aging and death are approaching.\n\nAnd Bhante, even those infantry battles that belong to anointed warrior-kings—intoxicated by the pride of sovereignty, overcome by the lust for sensual pleasures, who have attained stability in their realm, and who have conquered and dwell in a mighty region of the earth—even for those infantry battles, Bhante, there is no escape, no sphere of action, when aging and death are approaching.\n\nFurthermore, Bhante, in this royal family, there are ministers and high officials who are able to break up approaching enemies with counsel. Even for these battles of counsel, Bhante, there is no escape, no sphere of action, when aging and death are approaching. And furthermore, Bhante, in this royal family, there is an abundance of gold and silver, both stored underground and kept above ground, with which we are able to appease approaching enemies with wealth. Even for these battles of wealth, Bhante, there is no escape, no sphere of action, when aging and death are approaching. Bhante, when aging and death are approaching me, what should be done other than practicing the Dhamma, practicing equanimity, performing wholesome deeds, performing meritorious deeds?”\n\n“So it is, great king, so it is, great king! When aging and death are approaching, what should be done other than practicing the Dhamma, practicing equanimity, performing wholesome deeds, performing meritorious deeds?”\n\nThe Blessed One, the Teacher, said this:\n\nJust as mighty rocks, mountains, reaching up to the sky, would roll all around, crushing from the four directions,\nSo too, aging and death approach all living beings—warriors, brahmins, merchants, laborers, outcasts, and scavengers. They spare no one, but crush everyone.\nThere, there is no place for elephants, nor for chariots, nor for infantry. Nor can one conquer by battles of counsel, or by wealth.\nTherefore, a wise person, seeing their own true benefit, should firmly establish their faith in the Buddha, the Dhamma, and the Saṅgha.\nWhoever lives righteously by body, speech, or mind, they are praised here and now, and after passing away, they rejoice in heaven.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ එක් පසෙක අසුන්ගෙන සිටි කොසොල් පසේනදී රජුට මෙය වදාළ සේක: “අහෝ මහරජ, දහවල් කාලයේ, මේ මොහොතේ ඔබ කොහේ සිට පැමිණෙන්නේද?”\n\n“ස්වාමීනි, රාජ්‍යයෙන් අභිෂේක ලත්, ඓශ්වර්යයෙන් මත් වූ, කාමයන් කෙරෙහි ගිජු වූ, ජනපද ස්ථිරත්වයට පත් වූ, මහත් පෘථිවි මණ්ඩලය ජයගෙන වාසය කරන ක්ෂත්‍රීය රජවරුන්ට යම් රාජ කටයුතු ඇත්තාහුද, ස්වාමීනි, මේ මොහොතේ මම ඒ කටයුතුවල නිරතව සිටියෙමි.”\n\n“මහරජ, ඔබ මේ කුමක් සිතන්නෙහිද? මෙහි ඔබට නැගෙනහිර දිසාවෙන් විශ්වාසවන්ත වූ, පිහිටන සුළු පුරුෂයෙක් පැමිණ, ඔබ වෙත එළඹ මෙසේ කියන්නේ ය: ‘අහෝ මහරජ, ඔබ දැනගන්න, මම නැගෙනහිර දිසාවෙන් පැමිණියෙමි. එහිදී මම මහත් වූ, වලාකුලක් මෙන් වූ, සියලු සතුන් පොඩි කරමින් එන පර්වතයක් දුටුවෙමි. මහරජ, ඔබට යමක් කළ යුත්තේ නම්, එය කරන්නැ’යි.’\n\nඑවිට දෙවෙනි පුරුෂයෙක් බස්නාහිර දිසාවෙන් විශ්වාසවන්ත වූ, පිහිටන සුළු ආකාරයෙන් පැමිණ, ඔබ වෙත එළඹ මෙසේ කියන්නේ ය: ‘අහෝ මහරජ, ඔබ දැනගන්න, මම බස්නාහිර දිසාවෙන් පැමිණියෙමි. එහිදී මම මහත් වූ, වලාකුලක් මෙන් වූ, සියලු සතුන් පොඩි කරමින් එන පර්වතයක් දුටුවෙමි. මහරජ, ඔබට යමක් කළ යුත්තේ නම්, එය කරන්නැ’යි.’ එවිට තෙවෙනි පුරුෂයෙක් උතුරු දිසාවෙන් විශ්වාසවන්ත වූ, පිහිටන සුළු ආකාරයෙන් පැමිණ, ඔබ වෙත එළඹ මෙසේ කියන්නේ ය: ‘අහෝ මහරජ, ඔබ දැනගන්න, මම උතුරු දිසාවෙන් පැමිණියෙමි. එහිදී මම මහත් වූ, වලාකුලක් මෙන් වූ, සියලු සතුන් පොඩි කරමින් එන පර්වතයක් දුටුවෙමි. මහරජ, ඔබට යමක් කළ යුත්තේ නම්, එය කරන්නැ’යි.’ එවිට සතරවෙනි පුරුෂයෙක් දකුණු දිසාවෙන් විශ්වාසවන්ත වූ, පිහිටන සුළු ආකාරයෙන් පැමිණ, ඔබ වෙත එළඹ මෙසේ කියන්නේ ය: ‘අහෝ මහරජ, ඔබ දැනගන්න, මම දකුණු දිසාවෙන් පැමිණියෙමි. එහිදී මම මහත් වූ, වලාකුලක් මෙන් වූ, සියලු සතුන් පොඩි කරමින් එන පර්වතයක් දුටුවෙමි. මහරජ, ඔබට යමක් කළ යුත්තේ නම්, එය කරන්නැ’යි.’ ”\n\n“මහරජ, මේ ආකාරයේ මහත් වූ, භයානක විපතක් හටගත් කල්හි, දරුණු මනුෂ්‍ය සංහාරයක් සහිත වූ, දුර්ලභ මනුෂ්‍යභාවයක් පවතින විට ඔබට කුමක් කළ යුතුද?”\n\n“ස්වාමීනි, මේ ආකාරයේ මහත් වූ, භයානක විපතක් හටගත් කල්හි, දරුණු මනුෂ්‍ය සංහාරයක් සහිත වූ, දුර්ලභ මනුෂ්‍යභාවයක් පවතින විට මට ධර්මයෙහි හැසිරීමෙන්, සම සේ හැසිරීමෙන්, කුසල් කිරීමෙන්, පින් රැස්කිරීමෙන් හැර වෙන කුමක් කළ හැකිද?”\n\n“මහරජ, මම ඔබට දන්වමි. මහරජ, මම ඔබට ප්‍රකාශ කරමි. මහරජ, ජරා මරණය ඔබ වෙත පැමිණෙන්නේය. මහරජ, ජරා මරණය ඔබ වෙත පැමිණෙද්දී ඔබට කුමක් කළ යුතුද?”\n\n“ස්වාමීනි, ජරා මරණය මට පැමිණෙද්දී ධර්මයෙහි හැසිරීමෙන්, සම සේ හැසිරීමෙන්, කුසල් කිරීමෙන්, පින් රැස්කිරීමෙන් හැර වෙන කුමක් කළ හැකිද? ස්වාමීනි, රාජ්‍යයෙන් අභිෂේක ලත්, ඓශ්වර්යයෙන් මත් වූ, කාමයන් කෙරෙහි ගිජු වූ, ජනපද ස්ථිරත්වයට පත් වූ, මහත් පෘථිවි මණ්ඩලය ජයගෙන වාසය කරන ක්ෂත්‍රීය රජවරුන්ට යම් ඇත් යුද්ධ ඇත්තාහුද, ස්වාමීනි, ජරා මරණය පැමිණෙද්දී ඒ ඇත් යුද්ධවලට පිළිසරණක් හෝ විෂයයක් නැත. ස්වාමීනි, රාජ්‍යයෙන් අභිෂේක ලත්, ඓශ්වර්යයෙන් මත් වූ, කාමයන් කෙරෙහි ගිජු වූ, ජනපද ස්ථිරත්වයට පත් වූ, මහත් පෘථිවි මණ්ඩලය ජයගෙන වාසය කරන ක්ෂත්‍රීය රජවරුන්ට යම් අශ්ව යුද්ධ ඇත්තාහුද, ස්වාමීනි, ජරා මරණය පැමිණෙද්දී ඒ අශ්ව යුද්ධවලට ද පිළිසරණක් හෝ විෂයයක් නැත. ස්වාමීනි, රාජ්‍යයෙන් අභිෂේක ලත්, ඓශ්වර්යයෙන් මත් වූ, කාමයන් කෙරෙහි ගිජු වූ, ජනපද ස්ථිරත්වයට පත් වූ, මහත් පෘථිවි මණ්ඩලය ජයගෙන වාසය කරන ක්ෂත්‍රීය රජවරුන්ට යම් රථ යුද්ධ ඇත්තාහුද, ස්වාමීනි, ජරා මරණය පැමිණෙද්දී ඒ රථ යුද්ධවලට ද පිළිසරණක් හෝ විෂයයක් නැත. ස්වාමීනි, රාජ්‍යයෙන් අභිෂේක ලත්, ඓශ්වර්යයෙන් මත් වූ, කාමයන් කෙරෙහි ගිජු වූ, ජනපද ස්ථිරත්වයට පත් වූ, මහත් පෘථිවි මණ්ඩලය ජයගෙන වාසය කරන ක්ෂත්‍රීය රජවරුන්ට යම් පාබල යුද්ධ ඇත්තාහුද, ස්වාමීනි, ජරා මරණය පැමිණෙද්දී ඒ පාබල යුද්ධවලට ද පිළිසරණක් හෝ විෂයයක් නැත. එසේම, ස්වාමීනි, මේ රාජකීය පවුලෙහි, පැමිණි සතුරන් උපදෙස් මගින් බිඳහෙළීමට සමත් වන උපදේශක මහාමාත්‍යවරු ද සිටිති. ස්වාමීනි, ජරා මරණය පැමිණෙද්දී ඒ මන්ත්‍ර යුද්ධවලට ද පිළිසරණක් හෝ විෂයයක් නැත. එසේම, ස්වාමීනි, මේ රාජකීය පවුලෙහි භූමියේ ගබඩා කර ඇති ද, ඉහළ ගබඩාවල තැන්පත් කර ඇති ද, පැමිණි සතුරන් ධනයෙන් පොළඹවා ගැනීමට හැකි තරම් වූ බොහෝ රන් රිදී ධනය පවතී. ස්වාමීනි, ජරා මරණය පැමිණෙද්දී ඒ ධන යුද්ධවලට ද පිළිසරණක් හෝ විෂයයක් නැත. ස්වාමීනි, ජරා මරණය මට පැමිණෙද්දී ධර්මයෙහි හැසිරීමෙන්, සම සේ හැසිරීමෙන්, කුසල් කිරීමෙන්, පින් රැස්කිරීමෙන් හැර වෙන කුමක් කළ හැකිද?”\n\n“මහරජ, එය එසේමය, මහරජ, එය එසේමය! ජරා මරණය පැමිණෙද්දී ධර්මයෙහි හැසිරීමෙන්, සම සේ හැසිරීමෙන්, කුසල් කිරීමෙන්, පින් රැස්කිරීමෙන් හැර වෙන කුමක් කළ හැකිද?”\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. ඉක්බිති ශාස්තෘන් වහන්සේ මෙසේ වදාළ සේක:\n\n“යම් සේ මහත් වූ පර්වත අහස හා ගැටෙමින්, සතර දිශාවෙන් ම පැමිණ, සියලු සතුන් පොඩි කරමින් පෙරළී ඒද,\nඑලෙසින් ම ජරාව ද මරණය ද ක්ෂත්‍රියයන්, බ්‍රාහ්මණයන්, වෛශ්‍යයන්, ශුද්‍රයන්, චණ්ඩාලයන්, පුක්කුසයන් යන මේ සියලු ප්‍රාණීන් අභිභවනය කරයි. කිසිවකුත් නොහැර, සියල්ලම මඩලයි.\nඑහි ඇතුන්ට, රථවලට හෝ පාබල සේනාවට පිහිටක් නැත. මන්ත්‍ර යුද්ධයෙන් ද, ධනයෙන් ද ජය ගැනීමට නොහැක.\nඑබැවින්, තමන්ගේ යහපත මැනවින් දකින නුවණැති පුද්ගලයා, බුදුන් කෙරෙහි ද, ධර්මය කෙරෙහි ද, සංඝයා කෙරෙහි ද ස්ථිර ශ්‍රද්ධාව පිහිටුවා ගත යුතුය.\nයමෙක් කයින්, වචනයෙන් හෝ සිතින් ධර්මයෙහි හැසිරේද, ඒ තැනැත්තාට මෙලොවදීම ප්‍රශංසා කරති, මිය පරලොව ගොස් දෙව්ලොවදී සතුටු වෙයි.”",
      "paliTitle": "Pabbatūpamasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Kosalasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}