{
  "id": "sn.1.9",
  "title": {
    "pali": "Vanasaṃyuttaṃ",
    "english": "The Forest Chapter",
    "sinhala": "වනසංයුත්තය"
  },
  "sections": [
    {
      "number": 221,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ aññataro bhikkhu kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena so bhikkhu divāvihāragato pāpake akusale vitakke vitakketi gehanissite. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā tassa bhikkhuno anukampikā atthakāmā taṃ bhikkhuṃ saṃvejetukāmā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ gāthāhi ajjhabhāsi – ‘‘Vivekakāmosi vanaṃ paviṭṭho, Atha te mano niccharatī bahiddhā; Jano janasmiṃ vinayassu chandaṃ, Tato sukhī hohisi vītarāgo. ‘‘Aratiṃ pajahāsi sato, bhavāsi sataṃ taṃ sārayāmase; Pātālarajo hi duttaro, mā taṃ kāmarajo avāhari. ‘‘Sakuṇo yathā paṃsukunthito [paṃsukuṇṭhito (ka.), paṃsukuṇḍito (sī. syā. kaṃ. pī.)], vidhunaṃ pātayati sitaṃ rajaṃ; Evaṃ bhikkhu padhānavā satimā, vidhunaṃ pātayati sitaṃ raja’’ntntti. Atha kho so bhikkhu tāya devatāya saṃvejito saṃvegamāpādīti.",
      "english": "Thus have I heard. On one occasion, a certain bhikkhu was dwelling among the Kosalans in a certain forest grove. Now at that time, having gone for his day's abiding, that bhikkhu was indulging in evil, unwholesome thoughts connected with the household life. Then, the deity who dwelled in that forest grove, being compassionate towards that bhikkhu and desiring his welfare, and wishing to stir him to spiritual urgency, approached that bhikkhu. Having approached, she addressed that bhikkhu with stanzas:\n\n\"You who desire seclusion have entered the forest, yet your mind strays outwards. Subdue your desire for worldly connections; then you will be happy, free from passion.\n\nBeing mindful, abandon discontent, may you be mindful – we remind you of that. Truly, the dust of the abyss is hard to cross; let not the dust of sensual desire sweep you away.\n\nJust as a bird, covered in dust, shakes off the clinging dirt, even so, a bhikkhu who is striving and mindful shakes off the clinging dust.\"\n\nThen, that bhikkhu, being stirred to spiritual urgency by that deity, experienced spiritual urgency.",
      "sinhala": "මෙසේ මා විසින් අසන ලදී – එක් සමයෙක්හි එක්තරා භික්‍ෂුවක් කෝසල ජනපදයෙහි එක්තරා වනසණ්ඩයක වාසය කරයි. එවිට ඒ භික්‍ෂුව දිවා විහරණයට ගොස් ගිහි ජීවිතය හා සම්බන්ධ වූ පව්කාර, අකුසල විතර්කයන් විතර්ක කරමින් සිටියේය.\n\nඉක්බිති ඒ වනසණ්ඩයෙහි අධිගෘහිත වූ යම් දෙවතාවක් සිටියාද, ඇය ඒ භික්‍ෂුව කෙරෙහි අනුකම්පා ඇතිව, ඔහුට යහපත කැමතිව, ඒ භික්‍ෂුව සංවේගයට පත් කරවීමට කැමති වූවාය. ඒ භික්‍ෂුව සිටි තැනට පැමිණ, ඒ භික්‍ෂුවට ගාථාවලින් මෙය කීවාය –\n\n‘‘ඔබ විවේකය කැමති කෙනෙකි. වනයට පිවිසියේය. එහෙත් ඔබගේ සිත පිටතට ගලා යයි. ජනතාව කෙරෙහි පවත්නා ආශාව දුරු කරන්න. එවිට ඔබ සුවපත් වනු ඇත, වීතරාගී වනු ඇත.\n\n‘‘සිහි ඇතිව අරතිය ප්‍ර‍හීණ කරන්න, සත්පුරුෂයෙක් වන්න. අපි ඔබට එය සිහිපත් කරවමු. පාතාල රජස නම් තරණය කිරීමට ඉතා දුෂ්කරය. කාම රජස ඔබව ඇදගෙන නොයත්වා.\n\n‘‘දූවිලි තැවරුණු කුරුල්ලෙක් තමාට ඇලී ඇති දූවිලි සොලවා හළන්නේ යම්සේද, එලෙසම, වීර්යය ඇති, සිහි ඇති භික්‍ෂුවක් තමාට ඇලී ඇති ක්ලේශ ධූලිය සොලවා හළන්නේය.’’\n\nඉක්බිති ඒ භික්‍ෂුව ඒ දෙවතාව විසින් සංවේගයට පත් කරනු ලැබූයේ, සංවේගයට පත් විය.",
      "paliTitle": "Vivekasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Seclusion",
      "sinhalaTitle": "විවේක සූත්‍රය"
    },
    {
      "number": 222,
      "pali": "Ekaṃ samayaṃ aññataro bhikkhu kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena so bhikkhu divāvihāragato supati. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā tassa bhikkhuno anukampikā atthakāmā taṃ bhikkhuṃ saṃvejetukāmā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ gāthāhi ajjhabhāsi – ‘‘Uṭṭhehi bhikkhu kiṃ sesi, ko attho supitena [supinena (sī.)] te; Āturassa hi kā niddā, sallaviddhassa ruppato. ‘‘Yāya saddhāya pabbajito [yāya saddhāpabbajito (sī. syā. kaṃ.)], agārasmānagāriyaṃ; Tameva saddhaṃ brūhehi, mā niddāya vasaṃ gamī’’ti. ‘‘Aniccā addhuvā kāmā, yesu mandova mucchito; Baddhesu [khandhesu (sī.)] muttaṃ asitaṃ, kasmā pabbajitaṃ tape. ‘‘Chandarāgassa vinayā, avijjāsamatikkamā; Taṃ ñāṇaṃ paramodānaṃ [pariyodātaṃ (sī. pī.), paramodātaṃ (syā. kaṃ.), paramavodānaṃ (sī. aṭṭha.)], kasmā pabbajitaṃ tape. ‘‘Chetvā [bhetvā (sī. syā. kaṃ. pī.)] avijjaṃ vijjāya, āsavānaṃ parikkhayā; Asokaṃ anupāyāsaṃ, kasmā pabbajitaṃ tape. ‘‘Āraddhavīriyaṃ pahitattaṃ, niccaṃ daḷhaparakkamaṃ; Nibbānaṃ abhikaṅkhantaṃ, kasmā pabbajitaṃ tape’’ti.",
      "english": "On one occasion, a certain bhikkhu was dwelling among the Kosalans in a certain forest grove. Now at that time, that bhikkhu, having gone for a day’s abiding, was sleeping. Then indeed, the deity dwelling in that forest grove, being compassionate towards that bhikkhu and desiring his welfare, and wishing to arouse him to spiritual urgency, approached that bhikkhu. Having approached, she addressed that bhikkhu with verses:\n\n“Arise, bhikkhu, why do you sleep? What is the purpose of your sleep? For one afflicted, what sleep can there be? For one pierced by the dart, suffering agony?”\n\n“The faith by which you went forth from home into homelessness – uphold that very faith! Do not fall under the sway of sleep!”\n\n[The bhikkhu responded:] “Sensual pleasures are impermanent, unstable, in which a foolish person is infatuated. The aggregates are like excrement and urine. Why, then, should one who has gone forth be tormented?”\n\n“Through the removal of lustful desire, through the overcoming of ignorance – that knowledge is supremely purified. Why should one who has gone forth be tormented?”\n\n“Having cut off ignorance with wisdom, through the utter destruction of the taints, one becomes sorrowless and without anguish. Why should one who has gone forth be tormented?”\n\n“One who has aroused energy, applied oneself, and is constantly firm in exertion, aspiring to Nibbana – why should such a one who has gone forth be tormented?”",
      "sinhala": "එක් සමයෙක එක්තරා භික්ෂුවක් කොසොල් ජනපදයේ එක්තරා වන ලැහැබක වාසය කළේය. එකල්හී ඒ භික්ෂුව දහවල් විවේකයට ගොස් නිදාගත්තේය. එකල්හී ඒ වන ලැහැබෙහි වාසය කළා වූ යම් දේවතාවක්හු ඒ භික්ෂුවට අනුකම්පා ඇතිව, යහපත කැමතිව, ඒ භික්ෂුව සංවේගයට පත් කිරීමට කැමතිව, ඒ භික්ෂුව සිටි තැනට පැමිණියාය; පැමිණ ඒ භික්ෂුවට ගාථාවලින් අමතා කීවාය:\n\n‘‘භික්ෂුව, නැගිටින්න, කුමටද නිදන්නේ? නිදාගැනීමෙන් ඔබට ඇති ඵලය කුමක්ද? හුලකින් විදින ලද, වේදනා විඳින ආතුරයෙකුට කවර නින්දක්ද? යම් ශ්‍රද්ධාවකින් ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේද, ඒ ශ්‍රද්ධාවම වඩන්න. නිද්‍රාවට වසඟ නොවන්න.’’\n\n‘‘කාමයන් අනිත්‍යය, අස්ථිරය; යම් කාමයන්හි අනුවණ පුද්ගලයා මුසපත් වී සිටීද, (ඒ) කඳන් තුළ මුත්‍ර සහ අසූචි ඇත. කුමටද ඔබ පැවිද්දා වෙහෙසන්නේ? ඡන්දරාගය දුරු කිරීමෙන්ද, අවිද්‍යාව ඉක්මවීමෙන්ද, ඒ පරම පාරිශුද්ධ ඥානය (ලැබේ). කුමටද ඔබ පැවිද්දා වෙහෙසන්නේ?\n\nවිද්‍යාවෙන් අවිද්‍යාව සිඳ බිඳ දමා, ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ශෝක රහිත වූද, උපද්‍රව රහිත වූද (තත්ත්වයට පැමිණේ). කුමටද ඔබ පැවිද්දා වෙහෙසන්නේ? ආරම්භ කළ වීර්‍යය ඇති, යොමු කළ සිත් ඇති, නිරන්තරයෙන් දැඩි වීර්‍යයෙන් යුක්ත වූ, නිර්වාණය පතන (මා වැනි) පැවිද්දා කුමටද ඔබ වෙහෙසන්නේ?’’",
      "paliTitle": "Upaṭṭhānasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Service",
      "sinhalaTitle": "උපට්ඨාන සූත්‍රය"
    },
    {
      "number": 223,
      "pali": "Ekaṃ samayaṃ āyasmā kassapagotto kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena āyasmā kassapagotto divāvihāragato aññataraṃ chetaṃ ovadati. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā āyasmantaṃ kassapagottaṃ saṃvejetukāmā yenāyasmā kassapagotto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ kassapagottaṃ gāthāhi ajjhabhāsi – ‘‘Giriduggacaraṃ chetaṃ, appapaññaṃ acetasaṃ; Akāle ovadaṃ bhikkhu, mandova paṭibhāti maṃ. ‘‘Suṇāti na vijānāti, āloketi na passati; Dhammasmiṃ bhaññamānasmiṃ, atthaṃ bālo na bujjhati. ‘‘Sacepi dasa pajjote, dhārayissasi kassapa; Neva dakkhati rūpāni, cakkhu hissa na vijjatī’’ti. Atha kho āyasmā kassapagotto tāya devatāya saṃvejito saṃvegamāpādīti.",
      "english": "At one time, the Venerable Kassapagotta was dwelling among the Kosalans, in a certain forest thicket. Now at that time, the Venerable Kassapagotta, having gone for his day-dwelling, was admonishing a certain deluded person. Then, the deity dwelling in that forest thicket, desiring to inspire a sense of spiritual urgency in the Venerable Kassapagotta, approached him; having approached, she addressed the Venerable Kassapagotta with these verses:\n\n\"Admonishing at an inappropriate time, O Bhikkhu, a fool who is difficult to penetrate, of little wisdom, and unmindful — you yourself appear foolish to me.\"\n\n\"He hears but does not understand; he looks but does not see. When the Dhamma is being proclaimed, the fool does not comprehend the meaning.\"\n\n\"Even if you were to hold ten lamps, Kassapa, he still would not see forms, for indeed, he possesses no eye.\"\n\nThen the Venerable Kassapagotta, being stirred by that deity, attained a profound sense of spiritual urgency.",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් කස්සපගොත්ත ස්ථවිරයන් වහන්සේ කෝසල ජනපදයේ එක්තරා වනාන්තරයක වාසය කළහ. එකල්හි ආයුෂ්මත් කස්සපගොත්ත ස්ථවිරයන් වහන්සේ දහවල් විහාරයට වැඩ සිටි අවස්ථාවේ එක්තරා මෝඩයෙකුට අවවාද කරමින් සිටියහ. ඉක්බිති ඒ වනාන්තරයෙහි වාසය කළ යම් දෙවියෙක් ආයුෂ්මත් කස්සපගොත්ත ස්ථවිරයන් වහන්සේ සංවේගයට පත් කරනු කැමතිව, උන්වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ, ආයුෂ්මත් කස්සපගොත්ත ස්ථවිරයන් වහන්සේට ගාථාවලින් මෙසේ කීය –\n\n\"ප්‍රඥාවෙන් හීන වූ, සිහි කල්පනාවෙන් තොර වූ, කෙලෙස් දුර්ගයන්හි හැසිරෙන ඒ මෝඩයාට අකාලයෙහි අවවාද කරන භික්ෂුව, මට නම් ඔබ ද මෝඩයකු සේ පෙනෙයි. ඔහු අසයි, එහෙත් නොදන්නේය; ඔහු බලයි, එහෙත් නොදෙකී. ධර්මය දේශනා කරනු ලබන විට ඒ මෝඩයා අර්ථය අවබෝධ නොකරයි. කස්සප, යම් හෙයකින් ඔබ පහන් දහයක් දල්වන්නට වුව ද, ඔහු රූප නොදකිනු ඇත, මන්ද ඔහුට (සත්‍ය දැකීමට) ඇසක් නැති බැවිනි.\"\n\nඉක්බිති ආයුෂ්මත් කස්සපගොත්ත ස්ථවිරයන් වහන්සේ ඒ දෙවියා විසින් සංවේගයට පත් කරනු ලැබ, සංවේගයට පැමිණියහ.",
      "paliTitle": "Kassapagottasuttaṃ",
      "vagga": "",
      "englishTitle": "To Kassapa Gotta Sutta",
      "sinhalaTitle": "කස්සපගොත්ත සූත්‍රය"
    },
    {
      "number": 224,
      "pali": "Ekaṃ samayaṃ sambahulā bhikkhū kosalesu viharanti aññatarasmiṃ vanasaṇḍe. Atha kho te bhikkhū vassaṃvuṭṭhā [vassaṃvutthā (sī. syā. kaṃ. pī.)] temāsaccayena cārikaṃ pakkamiṃsu. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā te bhikkhū apassantī paridevamānā tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Arati viya mejja khāyati, Bahuke disvāna vivitte āsane; Te cittakathā bahussutā, Kome gotamasāvakā gatā’’ti. Evaṃ vutte, aññatarā devatā taṃ devataṃ gāthāya paccabhāsi – ‘‘Māgadhaṃ gatā kosalaṃ gatā, ekacciyā pana vajjibhūmiyā; Magā viya asaṅgacārino, aniketā viharanti bhikkhavo’’ti.",
      "english": "On one occasion, numerous bhikkhus were dwelling in a certain forest thicket in Kosala. Then, having completed the Rains Retreat, those bhikkhus set out on a wandering tour after three months. Then, the deity dwelling in that forest thicket, not seeing those bhikkhus, lamented and at that time uttered this verse: \"It appears to me as disquiet, seeing many deserted, secluded seats. Where have those eloquent, highly learned disciples of Gotama gone?\"\n\nWhen this was said, another deity replied to that deity with a verse: \"Some have gone to Magadha, some to Kosala, and some indeed to the Vajjian land. Like deer, unattached in their wanderings, the bhikkhus dwell homelessly.\"",
      "sinhala": "එක් සමයෙක්හි බොහෝ භික්ෂූන් වහන්සේලා කොසොල් ජනපදයේ යම් කිසි වනයක වැඩ විසූහ. ඉක්බිති ඒ භික්ෂූන් වහන්සේලා වස් සමාදන්ව තෙමසක් ඇවෑමෙන් චාරිකාවේ වැඩියහ. ඉක්බිති ඒ වනයේ අධිගෘහිතව සිටි දෙවඟන, ඒ භික්ෂූන් වහන්සේලා නොදැක ශෝක කරමින් ඒ වේලාවෙහි මේ ගාථාව පැවසුවාය –\n\n“බොහෝ හිස් වූ වාසස්ථාන දැක මට අරතියක් මෙන් දැනේ. ධර‍්මය පිළිබඳ මනා කථා ඇති, බහුශ්‍රැත වූ ඒ ගෞතම ශ්‍රාවකයෝ කොහි ගියෝදැයි.”\n\nමෙසේ පැවසූ විට, තවත් දෙවඟනක් ඒ දෙවඟනට ගාථාවකින් මෙසේ පිළිතුරු දුන්නාය – “ඔවුන් මගධයට ගොස් ඇත, කොසොලට ගොස් ඇත, සමහරු වජ්ජි දේශයට ගොස් ඇත; මුවන් මෙන් කිසිවකට නොඇලී, නිවාස රහිතව භික්ෂූන් වහන්සේලා වැඩ වෙසෙති.”",
      "paliTitle": "Sambahulasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Many",
      "sinhalaTitle": "සම්බහුල සූත්‍රය"
    },
    {
      "number": 225,
      "pali": "Ekaṃ samayaṃ āyasmā ānando kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena āyasmā ānando ativelaṃ gihisaññattibahulo viharati. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā āyasmato ānandassa anukampikā atthakāmā āyasmantaṃ ānandaṃ saṃvejetukāmā yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ gāthāya ajjhabhāsi – ‘‘Rukkhamūlagahanaṃ pasakkiya, nibbānaṃ hadayasmiṃ opiya; Jhā gotama mā pamādo [mā ca pamādo (sī. pī.)], kiṃ te biḷibiḷikā karissatī’’ti. Atha kho āyasmā ānando tāya devatāya saṃvejito saṃvegamāpādīti.",
      "english": "At one time, the Venerable Ānanda was dwelling in a certain forest grove in the Kosalan country. Now, at that time, the Venerable Ānanda was dwelling, excessively occupied with communications concerning laypeople. Then, the deity dwelling in that forest grove, out of compassion and wishing for his welfare, desiring to stir the Venerable Ānanda to spiritual urgency, approached where the Venerable Ānanda was. Having approached, she addressed the Venerable Ānanda with a stanza:\n\n\"Having retreated into the deep seclusion of a tree's roots, with Nibbāna established in your heart, meditate, Gotama, do not be heedless! What will your idle chatter accomplish for you?\"\n\nThen, the Venerable Ānanda, stirred to spiritual urgency by that deity, experienced a profound sense of urgency.",
      "sinhala": "එක් සමයක ආයුෂ්මත් ආනන්ද කොසොල් ජනපදයෙහි එක්තරා වනයක වැඩවසන සේක.\n\nඒ අවස්ථාවේදී ආයුෂ්මත් ආනන්ද ගිහියන්ගේ කතාබහෙහි බොහෝ සේ යෙදී සිටියේය.\n\nඑකල්හී ඒ වනයෙහි අධිගෘහිතව සිටි දේවතාවා ආයුෂ්මත් ආනන්දයන් වහන්සේ කෙරෙහි අනුකම්පාවෙන් හා හිතසුව කැමතිව, උන්වහන්සේව සංවේගයට පත් කිරීමට කැමැත්තෙන් ආයුෂ්මත් ආනන්දයන් වහන්සේ වෙත පැමිණ, උන්වහන්සේට ගාථාවකින් මෙසේ පැවසුවාය:\n\n‘‘රුක්මුල් ගණ කැලයට පිවිස, නිර්වාණය සිතෙහි පිහිටුවාගෙන, ගෞතම, ධ්‍යාන වඩන්න, ප්‍ර‍මාද නොවන්න. ඔබට මේ නිෂ්ඵල කතාබහින් කුමක් ලැබේද?’’\n\nඑකල්හී ආයුෂ්මත් ආනන්ද ඒ දේවතාවා විසින් සංවේගයට පත් කරන ලදුව, සංවේගය ඇති කරගත්තේය.",
      "paliTitle": "Ānandasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Ānanda",
      "sinhalaTitle": "ආනන්ද සූත්‍රය"
    },
    {
      "number": 226,
      "pali": "Ekaṃ samayaṃ āyasmā anuruddho kosalesu viharati aññatarasmiṃ vanasaṇḍe. Atha kho aññatarā tāvatiṃsakāyikā devatā jālinī nāma āyasmato anuruddhassa purāṇadutiyikā yenāyasmā anuruddho tenupasaṅkami; upasaṅkamitvā āyasmantaṃ anuruddhaṃ gāthāya ajjhabhāsi – ‘‘Tattha cittaṃ paṇidhehi, yattha te vusitaṃ pure; Tāvatiṃsesu devesu, sabbakāmasamiddhisu; Purakkhato parivuto, devakaññāhi sobhasī’’ti. ‘‘Duggatā devakaññāyo, sakkāyasmiṃ patiṭṭhitā; Te cāpi duggatā sattā, devakaññāhi patthitā’’ti. ‘‘Na te sukhaṃ pajānanti, ye na passanti nandanaṃ; Āvāsaṃ naradevānaṃ, tidasānaṃ yasassina’’nti. ‘‘Na tvaṃ bāle vijānāsi, yathā arahataṃ vaco; Aniccā sabbasaṅkhārā, uppādavayadhammino; Uppajjitvā nirujjhanti, tesaṃ vūpasamo sukho. ‘‘Natthi dāni punāvāso, devakāyasmi jālini; Vikkhīṇo jātisaṃsāro, natthi dāni punabbhavo’’ti.",
      "english": "At one time, the Venerable Anuruddha was dwelling among the Kosalans in a certain forest thicket. Then, a certain deity of the Tāvatiṃsa realm named Jālinī, who had been the Venerable Anuruddha's former companion, approached where the Venerable Anuruddha was. Having approached, she addressed the Venerable Anuruddha with stanzas:\n\n\"Set your mind there, where you dwelt before, among the Tāvatiṃsa gods, where all desires are fulfilled. Honored and surrounded, you shone among the celestial maidens.\"\n\n\"Unfortunate are the celestial maidens, established in the view of self-identity. And those beings are also unfortunate who are longed for by celestial maidens.\"\n\n\"They do not know happiness, who do not see Nandana, the abode of the lordly gods, of the glorious Thirty-Three.\"\n\n\"You, foolish one, do not understand the words of the Arahants: 'All conditioned phenomena are impermanent, subject to arising and passing away. Having arisen, they cease. Their cessation is happiness.' There is no rebirth now in the divine realm, Jālinī. The cycle of births is exhausted; there is no further becoming now.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ කෝසල ජනපදයෙහි එක්තරා වනලැහැබක වැඩසිටින සේක. එසමයෙහි ජාලිනී නම් වූ, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේගේ පෙර භවයෙහි භාර්යාව වූ එක්තරා තාවතිංස භවයට අයත් දෙවඟනක්, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියාය; පැමිණ, ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට ගාථාවකින් මෙසේ කීවාය –\n\n‘‘ඔබ පෙර විසූ තැනට සිත යොමු කරන්න. සියලු සකම් සම්පත් ඇති තාවතිංස දෙවියන් අතර, ඔබ දෙවඟනන් විසින් පෙරටු කරනු ලැබ, පිරිවරාගෙන, ශ‍්‍රෝභමානව වැජඹුණේය.’’\n\n‘‘ඒ දෙවඟනෝ සක්කායදෘෂ්ටියෙහි පිහිටා සිටින හෙයින් දුගතියට පත්වූවෝය. ඒ දෙවඟනන් විසින් පතනු ලබන සත්වයෝ ද දුගතියට පත්වූවෝය.’’\n\n‘‘මිනිස් දෙවියන්ගේ වාසස්ථානය වූ, කීර්තිමත් තිදෙස් දෙවියන්ගේ නන්දන උයන නොදක්නා වූ යම් කෙනෙක් ඇත්තාහු ද, ඔවුහු සැබෑ සැප නොදනිති.’’\n\n‘‘නුවණක් නැති ඔබ රහතුන් වහන්සේලාගේ වචනය කුමක් දැයි නොදන්නෙහි. සියලු සංස්කාර අනිත්‍යය; හටගැනීම හා නැසීම ස්වභාව කොට ඇත්තාහ. හටගෙන නැසී යති; ඒවායේ සංසිඳීමම නිවන් සැපතකි.\n\n‘‘ජාලිනී, දැන් මට දෙව්ලොවෙහි නැවත වාසය කිරීමක් නැත. ජාති සංසාරය ක්‍ෂය වී ගොසිනි. දැන් නැවත භවයක් නැත.’’",
      "paliTitle": "Anuruddhasuttaṃ",
      "vagga": "",
      "englishTitle": "Anuruddha Sutta",
      "sinhalaTitle": "අනුරුද්ධ සූත්‍රය"
    },
    {
      "number": 227,
      "pali": "Ekaṃ samayaṃ āyasmā nāgadatto kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena āyasmā nāgadatto atikālena gāmaṃ pavisati, atidivā paṭikkamati. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā āyasmato nāgadattassa anukampikā atthakāmā āyasmantaṃ nāgadattaṃ saṃvejetukāmā yenāyasmā nāgadatto tenupasaṅkami; upasaṅkamitvā āyasmantaṃ nāgadattaṃ gāthāhi ajjhabhāsi – ‘‘Kāle pavisa nāgadatta, divā ca āgantvā ativelacārī; Saṃsaṭṭho gahaṭṭhehi, samānasukhadukkho. ‘‘Bhāyāmi nāgadattaṃ suppagabbhaṃ, kulesu vinibaddhaṃ; Mā heva maccurañño balavato, antakassa vasaṃ upesī’’ti [vasameyyāti (sī. pī.), vasamesīti (syā. kaṃ.)]. Atha kho āyasmā nāgadatto tāya devatāya saṃvejito saṃvegamāpādīti.",
      "english": "One time, the Venerable Nagadatta was dwelling among the Kosalans in a certain forest thicket. Now, at that time, the Venerable Nagadatta would enter the village at an inappropriate time and return at an inappropriate time. Then, the deity who resided in that forest thicket, out of compassion and wishing for the welfare of the Venerable Nagadatta, desiring to stir him to spiritual urgency, approached the Venerable Nagadatta. Having approached, she addressed the Venerable Nagadatta with these verses:\n\n\"Enter at the proper time, Nagadatta; and having arrived by day, you are one who acts at an improper time. You are entangled with householders, sharing their joys and sorrows.\n\nI fear for Nagadatta, who is very bold, bound to families. May he not indeed come under the sway of Death's powerful king, the Destroyer!\"\n\nThen, the Venerable Nagadatta, stirred to spiritual urgency by that deity, felt a profound sense of spiritual urgency.",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් නාගදත්ත ස්ථවිරයන් වහන්සේ කෝසල ජනපදයෙහි එක්තරා වනාන්තරයක වැඩසිටියහ. ඒ කලෙහි ආයුෂ්මත් නාගදත්ත ස්ථවිරයන් වහන්සේ ඉතා ප්‍රමාද වී ගමට පිවිසෙති, ඉතා ප්‍රමාද වී ආපසු වනයට වඩින සේක. ඉක්බිති, ඒ වනාන්තරයෙහි අධිගෘහිතව වාසය කළ යම් දෙවියෙක් ආයුෂ්මත් නාගදත්ත ස්ථවිරයන් වහන්සේ කෙරෙහි අනුකම්පාවෙන් හා හිතසුව කැමැත්තෙන් යුක්තව, උන්වහන්සේ සංවේගයට පත් කරනු කැමැත්තෙන්, ආයුෂ්මත් නාගදත්ත ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියාය. පැමිණ, ආයුෂ්මත් නාගදත්ත ස්ථවිරයන් වහන්සේට ගාථාවලින් මෙය පැවසුවාය:\n\n“නාගදත්ත, (පිණ්ඩපාතය සඳහා) සුදුසු කලට (ගමට) පිවිසෙන්න. දවාලෙහි ප්‍රමාද වී ආපසු වඩින ඔබ, නුසුදුසු වේලාවෙහි හැසිරෙන්නෙකි. ගිහියන් සමඟ මුසුව සිටින්නේය. එනිසා ඔවුන් හා සමානව සැප දුක් අත්විඳින්නෙකි.”\n\n“නාගදත්ත, ප්‍රමාදීව කුලයන් කෙරෙහි දැඩිව බැඳී සිටින ඔබ ගැන මම බිය වෙමි. බලවත් මරුවා නම් වූ, සියල්ල විනාශ කරන්නා වූ මාරයාගේ වසඟයට ඔබ පත් නොවේවා!”\n\nඉක්බිති ආයුෂ්මත් නාගදත්ත ස්ථවිරයන් වහන්සේ ඒ දෙවියන් විසින් සංවේගයට පත් කරනු ලැබ, සංවේගය ඇති කර ගත් සේක.",
      "paliTitle": "Nāgadattasuttaṃ",
      "vagga": "",
      "englishTitle": "To Nāgadatta Sutta",
      "sinhalaTitle": "නාගදත්ත සූත්‍රය"
    },
    {
      "number": 228,
      "pali": "Ekaṃ samayaṃ aññataro bhikkhu kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena so bhikkhu aññatarasmiṃ kule ativelaṃ ajjhogāḷhappatto viharati. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā tassa bhikkhuno anukampikā atthakāmā taṃ bhikkhuṃ saṃvejetukāmā yā tasmiṃ kule kulagharaṇī, tassā vaṇṇaṃ abhinimminitvā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ gāthāya ajjhabhāsi – ‘‘Nadītīresu saṇṭhāne, sabhāsu rathiyāsu ca; Janā saṅgamma mantenti, mañca tañca [tvañca (ka.)] kimantara’’nti. ‘‘Bahūhi saddā paccūhā, khamitabbā tapassinā; Na tena maṅku hotabbaṃ, na hi tena kilissati. ‘‘Yo ca saddaparittāsī, vane vātamigo yathā; Lahucittoti taṃ āhu, nāssa sampajjate vata’’nti.",
      "english": "At one time, a certain bhikkhu was dwelling in a certain forest thicket in Kosala. Now at that time, that bhikkhu was dwelling, having become excessively entangled with a certain family. Then, the deity dwelling in that forest thicket, out of compassion for that bhikkhu and desiring his welfare, wishing to stir him to spiritual urgency, created an image resembling the householder woman of that family, and approaching where that bhikkhu was, addressed him with a verse:\n\n“On riverbanks, in meeting places, in assembly halls, and on highways, people gather and discuss, 'What is the nature of the relationship between me and you?'”\n\n“Many sounds are obstacles; they are to be endured by an ascetic. One should not be upset by them, for one is not tormented by them. But whoever is terrified by sounds, like a wind-deer in the forest, they call him 'fickle-minded'; indeed, his spiritual endeavor does not succeed.”",
      "sinhala": "එක් කලෙක එක්තරා භික්‍ෂූවක් කෝසල රටෙහි එක්තරා වනයක වැඩ වෙසෙයි. ඒ අවස්ථාවේදී ඒ භික්‍ෂූව එක්තරා කුලයකට අතිශයින්ම ගැවසුණේ වැඩ විසීය. එවිට ඒ වනයේ වාසය කළ දේවතාවිය, ඒ භික්‍ෂූවට අනුකම්පා ඇතිව, යහපත කැමතිව, ඒ භික්‍ෂූව සංවේගයට පත් කිරීමට කැමතිව, ඒ කුලයේ ගෘහණියගේ රූපය මවාගෙන, ඒ භික්‍ෂූව සිටි තැනට පැමිණියාය. පැමිණ, ඒ භික්‍ෂූවට ගාථාවකින් මෙසේ කීවාය –\n\n‘‘ගංගා තීරයන්හි, රැස්වීම් තැන්වල, සභා මැද, වීදිවලද මිනිස්සු එකතු වී, ‘ඔබත් මේ ගෘහණියත් අතර ඇති වෙනස කුමක්ද?’ යි කතා කරති.’’\n\n‘‘තපස්වී විසින් බොහෝ ශබ්ද බාධකයන් ඉවසිය යුතුයි. එයින් නොසන්සුන් නොවිය යුතුයි. එයින් (සිත) කිලිටි වන්නේ නැත.’’\n\n‘‘යමෙක් නම් වනයෙහි සුළඟට තැතිගන්නා මුවෙක් මෙන් ශබ්දයෙන් තැති ගනීද, ඔහු ලාමක සිත් ඇති අයෙකු ලෙස කියනු ලැබේ. ඔහුගේ (අභිප්‍රාය) නම් සාර්ථක වන්නේ නැත.’’",
      "paliTitle": "Kulagharaṇīsuttaṃ",
      "vagga": "",
      "englishTitle": "The Family Housewife Sutta",
      "sinhalaTitle": "කුලඝරණී සූත්‍රය"
    },
    {
      "number": 229,
      "pali": "Ekaṃ samayaṃ aññataro vajjiputtako bhikkhu vesāliyaṃ viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena vesāliyaṃ vajjiputtako sabbaratticāro hoti. Atha kho so bhikkhu vesāliyā tūriya-tāḷita-vādita-nigghosasaddaṃ sutvā paridevamāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Ekakā mayaṃ araññe viharāma, Apaviddhaṃva [apaviṭṭhaṃva (syā. kaṃ.)] vanasmiṃ dārukaṃ; Etādisikāya rattiyā, Ko su nāmamhehi [nāma amhehi (sī. pī.)] pāpiyo’’ti. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā tassa bhikkhuno anukampikā atthakāmā taṃ bhikkhuṃ saṃvejetukāmā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ gāthāya ajjhabhāsi – ‘‘Ekakova tvaṃ araññe viharasi, apaviddhaṃva vanasmiṃ dārukaṃ; Tassa te bahukā pihayanti, nerayikā viya saggagāmina’’nti. Atha kho so bhikkhu tāya devatāya saṃvejito saṃvegamāpādīti.",
      "english": "On one occasion, a certain Vajjiputta monk was dwelling in a certain forest thicket in Vesālī. Now at that time, an all-night Vajjiputta festival was being celebrated in Vesālī.\n\nThen, hearing the loud clamor of musical instruments being struck and played from Vesālī, that monk, lamenting, uttered this verse at that time: \"We dwell alone in the wilderness, like a log cast aside in the forest. On a night like this, who indeed is more wretched than us?\"\n\nThen indeed, the deity dwelling in that forest thicket, out of compassion and wishing for that monk's welfare, and desiring to stir him to spiritual urgency, approached where that monk was; having approached, she addressed that monk with a verse: \"You indeed dwell alone in the wilderness, like a log cast aside in the forest. Many envy you for that, like those in hell envy those bound for heaven.\" Then indeed, that monk, stirred to spiritual urgency by that deity, attained a sense of spiritual urgency.",
      "sinhala": "එක් සමයෙක එක්තරා වජ්ජිපුත්තක භික්ෂුවක් වෙසාලියෙහි එක්තරා වනාන්තරයක වැඩවසමින් සිටියේය. එකල වෙසාලියෙහි වජ්ජීන්ගේ සවස සිට රැය පහන් වන තුරු පැවති උත්සවයක් විය. එකල්හි ඒ භික්ෂුව වෙසාලියෙන් නැගෙන වාදන භාණ්ඩවලින් නැගෙන තාලයට ගයන, වාදනය කරන ඝෝෂාකාරී හඬ අසා, ශෝක කරමින් ඒ වේලාවෙහි මේ ගාථාව පැවසීය:\n\n\"අපි වනයෙහි අත්හරින ලද දර කැබැල්ලක් මෙන්, තනිව වනාන්තරයෙහි වාසය කරමු. මෙබඳු රාත්‍රියක අපට වඩා අභාග්‍යසම්පන්න කෙනෙක් කවරෙක් ද?\"\n\nඑකල්හි ඒ වනාන්තරයෙහි අධිවාසීව සිටි දෙවඟන, ඒ භික්ෂුව කෙරෙහි අනුකම්පාවෙන් යුක්තව, ඔහුගේ යහපත කැමතිව, ඒ භික්ෂුව සංවේගයට පත් කරවීමට කැමතිව, ඒ භික්ෂුව සිටි තැනට පැමිණියාය; පැමිණ, ඒ භික්ෂුවට ගාථාවකින් මෙසේ පැවසුවාය:\n\n\"නුඹ වනයෙහි අත්හරින ලද දර කැබැල්ලක් මෙන්, තනිව වනාන්තරයෙහි වාසය කරන්නෙහි ය. නිරයේ සිටින අය ස්වර්ගයට යන අයට ඊර්ෂ්‍යා කරන්නාක් මෙන්, බොහෝ දෙනා නුඹට ඊර්ෂ්‍යා කරති.\"\n\nඑකල්හි ඒ භික්ෂුව ඒ දෙවඟන විසින් සංවේගයට පත් කරන ලදුව, සංවේගය ඇති විය.",
      "paliTitle": "Vajjiputtasuttaṃ",
      "vagga": "",
      "englishTitle": "Vajjiputta Sutta",
      "sinhalaTitle": "වජ්ජිපුත්ත සූත්‍රය"
    },
    {
      "number": 230,
      "pali": "Ekaṃ samayaṃ aññataro bhikkhu kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena so bhikkhu yaṃ sudaṃ pubbe ativelaṃ sajjhāyabahulo viharati so aparena samayena appossukko tuṇhībhūto saṅkasāyati. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā tassa bhikkhuno dhammaṃ asuṇantī yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ gāthāya ajjhabhāsi – ‘‘Kasmā tuvaṃ dhammapadāni bhikkhu, nādhīyasi bhikkhūhi saṃvasanto; Sutvāna dhammaṃ labhatippasādaṃ, diṭṭheva dhamme labhatippasaṃsa’’nti. ‘‘Ahu pure dhammapadesu chando, yāva virāgena samāgamimha; Yato virāgena samāgamimha, yaṃ kiñci diṭṭhaṃva sutaṃ mutaṃ vā; Aññāya nikkhepanamāhu santo’’ti.",
      "english": "At one time, a certain bhikkhu was dwelling in a certain forest thicket in Kosala. Now at that time, that bhikkhu, who previously used to dwell much engaged in recitation, later became unconcerned, silent, and was deeply reflective.\n\nThen indeed, the deity dwelling in that forest thicket, not hearing the Dhamma (recited) by that bhikkhu, approached him; and having approached, addressed that bhikkhu with a verse: \"Bhikkhu, why do you not recite the verses of the Dhamma, though living among bhikkhus? Having heard the Dhamma, one gains profound serene faith, and gains supreme praise in this very life.\"\n\n\"Formerly, there was a desire for the verses of Dhamma, until dispassion arose within us. Now that dispassion has arisen within us, whatever is seen, heard, or cognized, the Noble Ones declare that it is to be laid aside through direct knowledge.\"",
      "sinhala": "එක් සමයෙක එක්තරා භික්ෂුවක් කොසොල් ජනපදයේ එක්තරා වනාන්තරයක වැඩවසයි. ඒ අවස්ථාවේදී, පෙර බෙහෙවින් ධර්ම සජ්ඣායනා කරමින් වාසය කළ ඒ භික්ෂුව පසුව අල්පෝත්සුක වී, නිහඬව, කනස්සල්ලෙන් කල් ගෙවමින් සිටියේය. ඉක්බිති, ඒ වනාන්තරයෙහි වාසය කළ දෙවියෙක් ඒ භික්ෂුවගෙන් ධර්මය ශ්‍රවණය නොලැබීමෙන්, ඒ භික්ෂුව වෙත පැමිණියේය. පැමිණ ඒ භික්ෂුවට ගාථාවකින් කීවේය – “භික්ෂුව, භික්ෂූන් සමඟ වාසය කරමින්, ඔබ ධර්ම පද අධ්‍යයනය නොකරන්නේ මන්ද? ධර්මය ශ්‍රවණය කිරීමෙන් අතිශය ප්‍රසාදය ලබයි, මෙලොවදීම අතිශය ප්‍රශංසාවට පත් වේ.”\n\n“පෙර ධර්ම පද කෙරෙහි කැමැත්තක් තිබිණි, යම්තාක් විරාගය අවබෝධ වන තුරු. යම් හෙයකින් විරාගය අවබෝධ වූයේ ද, දුටු යම් කිසිවක් හෝ, ඇසූ යම් කිසිවක් හෝ, අන් ඉන්ද්‍රියන්ගෙන් දැනගත් යම් කිසිවක් හෝ අවබෝධ කොට බැහැර කිරීමක් ලෙස ශාන්ත වූවෝ පවසති.”",
      "paliTitle": "Sajjhāyasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Recitation",
      "sinhalaTitle": "සජ්ඣාය සූත්‍රය"
    },
    {
      "number": 231,
      "pali": "Ekaṃ samayaṃ aññataro bhikkhu kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena so bhikkhu divāvihāragato pāpake akusale vitakke vitakketi, seyyathidaṃ – kāmavitakkaṃ, byāpādavitakkaṃ, vihiṃsāvitakkaṃ. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā tassa bhikkhuno anukampikā atthakāmā taṃ bhikkhuṃ saṃvejetukāmā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ gāthāhi ajjhabhāsi – ‘‘Ayoniso manasikārā, so vitakkehi khajjasi; Ayoniso [ayoniṃ (pī. ka.)] paṭinissajja, yoniso anucintaya. ‘‘Satthāraṃ dhammamārabbha, saṅghaṃ sīlāni attano; Adhigacchasi pāmojjaṃ, pītisukhamasaṃsayaṃ; Tato pāmojjabahulo, dukkhassantaṃ karissasī’’ti. Atha kho so bhikkhu tāya devatāya saṃvejito saṃvegamāpādīti.",
      "english": "On one occasion, a certain bhikkhu was dwelling in the Kosala country, in a certain forest grove. Now at that time, that bhikkhu, during his daytime abiding, was entertaining evil, unwholesome thoughts, namely: thoughts of sensual desire, thoughts of ill-will, and thoughts of harm. Then indeed, the deity dwelling in that forest grove, out of compassion for that bhikkhu and desiring his welfare, wishing to stir him to spiritual urgency, approached that bhikkhu. Having approached, she addressed that bhikkhu with these verses:\n\n\"Through unwise attention, you are being consumed by these thoughts. Having abandoned unwise attention, reflect wisely. Concerning the Teacher, the Dhamma, the Saṅgha, and your own virtues, you will attain joy and, without doubt, rapture and happiness. Then, abounding in joy, you will make an end to suffering.\"\n\nThen indeed, that bhikkhu, having been stirred to spiritual urgency by that deity, developed a profound sense of spiritual urgency.",
      "sinhala": "එක් සමයෙක එක්තරා භික්ෂුවක් කොසොල් ජනපදයෙහි එක්තරා වනගහනයක වැඩ සිටියේය.\n\nඒ සමයෙහි ඒ භික්ෂුව දවල් විවේකයට ගොස් කාම විතර්කය, ව්‍යාපාද විතර්කය, විහිංසා විතර්කය යන පාපී අකුසල විතර්කයන් කල්පනා කරමින් සිටියේය. ඉක්බිති ඒ වනගහනයෙහි අධිවාසී වූ යම් දේවතාවක් ඒ භික්ෂුවට අනුකම්පා ඇතිව, ඔහුගේ යහපත කැමතිව, ඒ භික්ෂුව සංවේගයට පත් කිරීමට කැමතිව, ඒ භික්ෂුව සිටි තැනට පැමිණියාය. පැමිණ, ඒ භික්ෂුවට ගාථාවලින් අනුශාසනා කළාය:\n\n“නොමනාකොට මෙනෙහි කිරීම නිසා, ඔබ මේ විතර්කයන් විසින් පෙළනු ලබන්නෙහි ය.\nනොමනාකොට මෙනෙහි කිරීම අත්හැර, මනාකොට මෙනෙහි කරන්න.\n\nශාස්තෘන් වහන්සේ, ධර්මය, සංඝයා සහ තමාගේ සීලය අරභයා මෙනෙහි කරන්න.\nඑවිට ඔබ නිසැකවම ප්200Dරමෝදය, ප්200Dරීතිය හා සැපය ලබන්නෙහි ය.\nඉන් පසු ප්200Dරමෝදයෙන් බහුල වූ ඔබ, දුකෙහි අවසානය ඇති කරන්නෙහි ය.”\n\nඉක්බිති ඒ භික්ෂුව ඒ දේවතාවිය විසින් සංවේගයට පත් කරනු ලැබූයේ සංවේගයට පත් විය.",
      "paliTitle": "Akusalavitakkasuttaṃ",
      "vagga": "",
      "englishTitle": "Unwholesome Thoughts Sutta",
      "sinhalaTitle": "අකුසල විතක්ක සූත්‍රය"
    },
    {
      "number": 232,
      "pali": "Ekaṃ samayaṃ aññataro bhikkhu kosalesu viharati aññatarasmiṃ vanasaṇḍe. Atha kho tasmiṃ vanasaṇḍe adhivatthā devatā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā tassa bhikkhuno santike imaṃ gāthaṃ abhāsi – ‘‘Ṭhite majjhanhike kāle, sannisīvesu [sannisinnesu (syā. kaṃ. pī.)] pakkhisu; Saṇateva brahāraññaṃ, taṃ bhayaṃ paṭibhāti maṃ. ‘‘Ṭhite majjhanhike kāle, sannisīvesu pakkhisu; Saṇateva brahāraññaṃ, sā rati paṭibhāti ma’’nti.",
      "english": "At one time, a certain monk was dwelling in a certain forest thicket in the Kosala country. Then, the deity who dwelled in that forest thicket approached the monk. Having approached, she spoke this verse to him:\n\n\"When it is midday and the birds are settled, the great forest still resounds; that instills fear in me.\n\nWhen it is midday and the birds are settled, the great forest still resounds; that instills delight in me.\"",
      "sinhala": "එක් සමයෙක්හි එක්තරා භික්ෂුවක් කෝසල ජනපදයෙහි එක්තරා වනසණ්ඩයක වැඩ වාසය කළේය.\n\nඉන්පසු ඒ වනසණ්ඩයෙහි වාසය කරන දෙවියෙක් ඒ භික්ෂුව වෙත පැමිණ, ඒ භික්ෂුව අභිමුඛයෙහි මේ ගාථාව පැවසීය –\n\n\"දහවල් මැද වෙලාව පැමිණි කල්හි, පක්ෂීහු නිසලව සිටින විට, මහ වනය නාද කරයි; එය මට භයක් වශයෙන් පෙනේ.\n\nදහවල් මැද වෙලාව පැමිණි කල්හි, පක්ෂීහු නිසලව සිටින විට, මහ වනය නාද කරයි; එය මට ප්1්‍රීතියක් වශයෙන් පෙනේ.\"\n\n---\n1: For Sinhala script: ප්‍රීතියක් is formed using U+0D94 (ප්) + U+200D (Zero-Width Joiner) + U+0DBB (ර) + U+0DD5 (ී) + U+0DAD (ති) + U+0DBA (ය) + U+0DCA (ක්). This ensures the correct rendering of the 'pra' conjunct.",
      "paliTitle": "Majjhanhikasuttaṃ",
      "vagga": "",
      "englishTitle": "At Noon Sutta",
      "sinhalaTitle": "මජ්ඣන්හික සූත්‍රය"
    },
    {
      "number": 233,
      "pali": "Ekaṃ samayaṃ sambahulā bhikkhū kosalesu viharanti aññatarasmiṃ vanasaṇḍe uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatino asampajānā asamāhitā vibbhantacittā pākatindriyā. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā tesaṃ bhikkhūnaṃ anukampikā atthakāmā te bhikkhū saṃvejetukāmā yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū gāthāhi ajjhabhāsi – ‘‘Sukhajīvino pure āsuṃ, bhikkhū gotamasāvakā; Anicchā piṇḍamesanā, anicchā sayanāsanaṃ; Loke aniccataṃ ñatvā, dukkhassantaṃ akaṃsu te. ‘‘Dupposaṃ katvā attānaṃ, gāme gāmaṇikā viya; Bhutvā bhutvā nipajjanti, parāgāresu mucchitā. ‘‘Saṅghassa añjaliṃ katvā, idhekacce vadāmahaṃ; Apaviddhā [apaviṭṭhā (syā. kaṃ.)] anāthā te, yathā petā tatheva te. ‘‘Ye kho pamattā viharanti, te me sandhāya bhāsitaṃ; Ye appamattā viharanti, namo tesaṃ karomaha’’nti. Atha kho te bhikkhū tāya devatāya saṃvejitā saṃvegamāpādunti.",
      "english": "At one time, a great number of monks were dwelling in Kosala, in a certain forest thicket. They were arrogant, insolent, fickle, talkative, scattered in speech, unmindful, without clear comprehension, unconcentrated, with wandering minds, and with unrestrained sense faculties. Then, the deity dwelling in that forest thicket, out of compassion for those monks and desirous of their welfare, wishing to stir them to spiritual urgency, approached those monks. Having approached, she addressed those monks with verses:\n\n\"Formerly, the disciples of Gotama lived happily; they were without craving for alms-gathering, without craving for resting places. Having known the impermanence of the world, they made an end to suffering.\n\n\"Having made themselves difficult to satisfy, like village headmen in a village, they eat and eat, and then lie down, stupefied in others' houses.\n\n\"Having paid homage to the Saṅgha, I speak of some here: They are abandoned and without a protector; just like hungry ghosts are they.\n\n\"Indeed, those who dwell heedlessly, it is concerning them that I have spoken. Those who dwell diligently, I pay homage to them.\"\n\nThen indeed, those monks, having been stirred to spiritual urgency by that deity, experienced a profound sense of spiritual urgency.",
      "sinhala": "එක් කලෙක බොහෝ භික්ෂූහු කෝසල ජනපදයෙහි එක්තරා වනසණ්ඩයක උද්ධත වූ, අහංකාර වූ, චපල වූ, මුඛරී වූ, විසිරුණු වචන ඇති, සිහිමුළා වූ, සම්පජඤ්ඤයෙන් තොර වූ, අසමාහිත වූ, වික්ෂිප්ත සිත් ඇති, පාලනය නොවූ ඉන්ද්‍රියයන් ඇතිව වැඩසිටියහ. ඉන්පසු ඒ වනසණ්ඩයෙහි අධිගෘහිතව සිටි දෙවතාව, ඒ භික්ෂූන්ට අනුකම්පා ඇතිව, ඔවුන්ගේ යහපත කැමතිව, ඒ භික්ෂූන් සංවේගයට පත් කිරීමට කැමතිව, ඒ භික්ෂූන් වෙත එළඹුණේ ය; එළඹ, ඒ භික්ෂූන්ට ගාථාවලින් මෙසේ කී ය:\n\n‘‘ගෞතම ශ්‍රාවක භික්ෂූහු පෙර සුඛයෙන් ජීවත් වූහ. ඔවුහු පිණ්ඩපාතයෙහි ද සයන-ආසනවල ද නොඇලුණු සිත් ඇත්තෝ වූහ. ලෝකයේ අනිත්‍ය බව දැන, ඔවුහු දුක කෙළවර කළහ.\n\n‘‘තමන්ව පෝෂණය කිරීම දුෂ්කර කරගෙන, ගමෙහි ගැමියන් මෙන්, අනුන්ගේ ගෙවල්වල දී මුසපත් වූවාක් මෙන් කා බී වැතිර සිටිති.\n\n‘‘සංඝයාට ඇඳිලි බැඳ, මෙහි ඇතැම් අයට මම කියමි: ඔවුහු අසරණව අත්හළාක් මෙන් ය. ප්‍රේතයන් මෙන් ම ඔවුහු ය.\n\n‘‘යම් කෙනෙක් ප්‍රමාදව වාසය කරත් ද, මෙය මා කීවේ ඔවුන් අරමුණු කරගෙන ය. යම් කෙනෙක් අප්‍රමාදීව වාසය කරත් ද, මම ඔවුන්ට නමස්කාර කරමි’’යි.\n\nඉන්පසු ඒ භික්ෂූහු ඒ දෙවතාව විසින් සංවේගයට පත් කරනු ලැබූවෝ, සංවේගයට පැමිණියහ.",
      "paliTitle": "Pākatindriyasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Unrestrained Faculties",
      "sinhalaTitle": "පාකතින්ද්‍රිය සූත්‍රය"
    },
    {
      "number": 234,
      "pali": "Ekaṃ samayaṃ aññataro bhikkhu kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena so bhikkhu pacchābhattaṃ piṇḍapātapaṭikkanto pokkharaṇiṃ ogāhetvā padumaṃ upasiṅghati. Atha kho yā tasmiṃ vanasaṇḍe adhivatthā devatā tassa bhikkhuno anukampikā atthakāmā taṃ bhikkhuṃ saṃvejetukāmā yena so bhikkhu tenupasaṅkami; upasaṅkamitvā taṃ bhikkhuṃ gāthāya ajjhabhāsi – ‘‘Yametaṃ vārijaṃ pupphaṃ, adinnaṃ upasiṅghasi; Ekaṅgametaṃ theyyānaṃ, gandhatthenosi mārisā’’ti. ‘‘Na harāmi na bhañjāmi, ārā siṅghāmi vārijaṃ; Atha kena nu vaṇṇena, gandhatthenoti vuccati. ‘‘Yvāyaṃ bhisāni khanati, puṇḍarīkāni bhañjati; Evaṃ ākiṇṇakammanto, kasmā eso na vuccatī’’ti. ‘‘Ākiṇṇaluddo puriso, dhāticelaṃva makkhito; Tasmiṃ me vacanaṃ natthi, tvañcārahāmi vattave. ‘‘Anaṅgaṇassa posassa, niccaṃ sucigavesino; Vālaggamattaṃ pāpassa, abbhāmattaṃva khāyatī’’ti. ‘‘Addhā maṃ yakkha jānāsi, atho me anukampasi; Punapi yakkha vajjāsi, yadā passasi edisa’’nti. ‘‘Neva taṃ upajīvāma, napi te bhatakāmhase; Tvameva bhikkhu jāneyya, yena gaccheyya suggati’’nti. Atha kho so bhikkhu tāya devatāya saṃvejito saṃvegamāpādīti. ",
      "english": "On one occasion, a certain monk was dwelling in Kosala, in a certain forest thicket. Now at that time, after his meal and having returned from his alms round, that monk entered a pond and was sniffing a lotus. Then, the deity dwelling in that forest thicket, out of compassion for that monk and desiring his welfare, wishing to stir a sense of spiritual urgency in him, approached the monk. Having approached, she addressed the monk with a verse:\n\n\"This water-born flower that you sniff without it being given, this is one constituent of theft. You are a thief of scent, venerable sir.\"\n\n\"I do not steal it, nor do I break it. I sniff the water-born flower from a distance. So then, by what reason am I called a thief of scent?\"\n\n\"The one who digs up the lotus stalks and breaks the white lotuses, whose actions are so blatant, why is he not called a thief?\"\n\n\"A person whose actions are habitually cruel and defiled, is like a nurse's cloth, stained and smeared. In him, I have no words. But you are worthy for me to address.\"\n\n\"For a person free from defilements, who is constantly seeking purity, even a hair's breadth of evil appears like a vast cloud.\"\n\n\"Indeed, O Yakkha, you know me and you have compassion for me. Please speak to me again, O Yakkha, whenever you see such a thing.\"\n\n\"We do not live depending on you, nor are we your servants seeking wages. You yourself, O monk, should know the path by which you will reach a good destination.\"\n\nThen that monk, having been stirred by that deity, attained a profound sense of spiritual urgency.",
      "sinhala": "එක් සමයෙක එක්තරා භික්ෂුවක් කොසොල් ජනපදයෙහි එක්තරා වනසණ්ඩයක වැඩ වාසය කළේය. ඒ සමයෙහි ඒ භික්ෂුව දානය වැළඳීමෙන් පසු පිණ්ඩපාතයෙන් ආපසු පැමිණ පොකුණකට බැස පියුමක් සුවඳ බැලුවේය. එවිට ඒ වනසණ්ඩයෙහි අධිගෘහිත වූ, ඒ භික්ෂුවට අනුකම්පා ඇති, යහපත කැමති, ඒ භික්ෂුව සංවේගයට පත් කරනු කැමති වූ දේවතාවිය, ඒ භික්ෂුව සිටි තැනට පැමිණ, පැමිණ ඒ භික්ෂුවට ගාථාවකින් මෙසේ කීවාය – ‘‘යම් මේ දියෙහි උපන් මලක් නුදුන් දෙයක්ව තිබියදී ඔබ සුවඳ බලන්නෙහිද, පින්වත් භික්ෂ\\u200dුව, මෙය සොරකම් කිරීමේ එක් අංගයකි, ඔබ සුවඳ සොරා ගන්නෙකි.’’\n\n‘‘මම ගෙන නොයමි, නොකඩමි, ඈත සිට පියුම සුවඳ බලමි; එසේනම් කුමන අයුරකින්ද (මම) ‘සුවඳ හොරා’ යැයි කියනු ලබන්නේ? යමෙක් බිජු අල කපයිද, සුදු පියුම් බිඳ දමයිද; මෙසේ පාපී ක\\u200d්‍රියාවලින් ගහන වූ ඔහුට කවර හෙයින් (සුවඳ හොරා යැයි) නොකියනු ලැබේ?’’\n\n‘‘මහාපාපී වූ දරුණු මිනිසා, පිළිකුල් දේවලින් තැවරූ රෙදිකඩක් මෙනි; ඔහු සම්බන්ධයෙන් මට කිව යුතු දෙයක් නැත, ඔබටම නම් (එසේ කීමට) සුදුසුය. කෙලෙස්මලින් තොර වූ, නිරතුරුවම පාරිශ\\u200dුද්ධත්වය සොයන පුරුෂයාට; කෙස් අගක් තරම් වූ පාපයක් ද මහ මේඝයක් මෙන් පෙනේ.’’\n\n‘‘යක්ෂණිය, සැබැවින්ම ඔබ මා හඳුනන්නීය, තවද මට අනුකම්පා කරන්නීය; මෙබඳු දෙයක් දුටු විට යක්ෂණිය, යළිත් වරක්ද කියන්න.’’\n\n‘‘අපි ඔබ කෙරෙහි යැපෙන්නේ නැත, ඔබගේ සේවිකාවන් වීමට කැමැති ද නැත; භික්ෂ\\u200dුව, යම් ක\\u200d්‍රමයකින් සුගතියට යා හැකිද, එය ඔබම දැනගත යුතුය.’’\n\nඉක්බිති ඒ භික්ෂ\\u200dුව ඒ දේවතාවිය විසින් සංවේගයට පත් කරනු ලැබ සංවේගයට පත් විය.",
      "paliTitle": "Gandhatthenasuttaṃ",
      "vagga": "",
      "englishTitle": "The Scent Thief Sutta",
      "sinhalaTitle": "ගන්ධත්ථේන සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Vanasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Vivekaṃ upaṭṭhānañca, kassapagottena sambahulā; Ānando anuruddho ca, nāgadattañca kulagharaṇī. Vajjiputto ca vesālī, sajjhāyena ayoniso; Majjhanhikālamhi pākatindriya, padumapupphena cuddasa bhaveti.",
    "english": "The Linked Discourses on Forests is complete. The summary of it: Seclusion, Attending, Kassapagotta, Many; Ānanda, Anuruddha, Nāgadatta, and The Mistress of the House; The Vajjian Son, Vesālī, Recitation, Unwise; At Noon, With Senses Uncontrolled, and with the Lotus Flower they are fourteen.",
    "sinhala": "වන සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: විවේක, උපට්ඨාන, කස්සපගොත්ත, සම්බහුල, ආනන්ද, අනුරුද්ධ, නාගදත්ත, කුලඝරණී, වජ්ජිපුත්ත, වේසාලී, සජ්ඣාය, අයෝනිසෝ, මජ්ඣන්හිකාල, පාකතින්ද්‍රිය සහ පදුමපුප්ඵ යන සූත්‍ර දහහතරයි."
  }
}