{
  "id": "sn.1.2",
  "title": {
    "pali": "Devaputtasaṃyuttaṃ",
    "english": "The Connected Discourses with Devaputtas",
    "sinhala": "දෙව්පුත් සංයුත්තය"
  },
  "sections": [
    {
      "number": 82,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho kassapo devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho kassapo devaputto bhagavantaṃ etadavoca – ‘‘bhikkhuṃ bhagavā pakāsesi, no ca bhikkhuno anusāsa’’nti. ‘‘Tena hi kassapa, taññevettha paṭibhātū’’ti. ‘‘Subhāsitassa sikkhetha, samaṇūpāsanassa ca; Ekāsanassa ca raho, cittavūpasamassa cā’’ti. Idamavoca kassapo devaputto; samanuñño satthā ahosi. Atha kho kassapo devaputto ‘‘samanuñño me satthā’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyīti.",
      "english": "Thus have I heard: At one time the Blessed One was staying in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's Park.\n\nThen the deva Kassapa, when the night was far advanced and his resplendent beauty illuminated the entire Jeta's Grove, approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, the deva Kassapa said to the Blessed One: \"The Blessed One has declared what a monk is, but has not exhorted the monk.\"\n\n\"In that case, Kassapa, let that very point occur to you.\"\n\n\"One should train in well-spoken words, and in attending upon ascetics; and in solitary sitting in seclusion, and in the pacification of the mind.\"\n\nThis is what the deva Kassapa said; the Teacher approved. Then the deva Kassapa, thinking, \"The Teacher has approved of me,\" paid homage to the Blessed One, circumambulated him clockwise, and vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඉක්බිති කස්සප නම් දෙව්පුත්‍රයා, රාත්‍රිය පහන් වී ගෙන එනවිට, අතිශයින් දීප්තිමත් වූ වර්ණයෙන් යුක්තව, මුළු ජේතවනාරාමයම එළිය කරවා, භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පස්ව සිටියේය.\n\nඑකත්පස්ව සිටි කස්සප දෙව්පුත්‍රයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘භාග්‍යවතුන් වහන්සේ භික්ෂුව ප්‍රකාශ කරන සේක, එහෙත් භික්ෂුවට අනුශාසනා නොකරන සේකැයි.’’\n\n‘‘එසේ නම් කස්සප, නුඹටම එය වැටහේවා!’’\n\n‘‘මනා වචන භාවිතයෙහි ද, ශ්‍රමණයන් ඇසුරු කිරීමෙහි ද, රහසෙහි තනිව හිඳීමෙහි ද, සිතේ සංහිඳියාවෙහි ද හික්මෙන්නේය.’’\n\nමේ කාරණය කස්සප දෙව්පුත්‍රයා කීවේය; ශාස්තෘන් වහන්සේ ද එයට අනුමැති කළ සේක.\n\nඉක්බිති කස්සප දෙව්පුත්‍රයා ‘‘මාගේ ශාස්තෘන් වහන්සේ අනුමැති කළ සේකැයි’’ සිතා, භාග්‍යවතුන් වහන්සේට ආචාර කොට, පැදකුණු කොට, එහිම අතුරුදහන් විය.",
      "paliTitle": "Paṭhamakassapasuttaṃ",
      "vagga": "Paṭhamavaggo",
      "englishTitle": "The First Discourse to Kassapa",
      "sinhalaTitle": "පළමු කස්සප සූත්‍රය",
      "vaggaEnglish": "First Chapter",
      "vaggaSinhala": "පළමු වර්ගය"
    },
    {
      "number": 83,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ ṭhito kho kassapo devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Bhikkhu siyā jhāyī vimuttacitto, Ākaṅkhe ce hadayassānupattiṃ; Lokassa ñatvā udayabbayañca, Sucetaso anissito tadānisaṃso’’ti.",
      "english": "In Sāvatthi, standing to one side, the deity Kassapa then spoke this verse in the presence of the Blessed One:\n\n\"A monk should be meditative and possess a liberated mind, if he yearns for the realization of the heart's release. Having understood the arising and passing away of the world, then with a pure mind, unattached, he truly reaps the benefit.\"",
      "sinhala": "සැවැත් නුවරදී. එක් පසෙක සිටි කස්සප නම් දෙව්පුත්‍ර තෙමේ භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය –\n\nයම් මහණක්හු භාවනානුයෝගීව, කෙලෙස්වලින් මිදුණු සිත් ඇත්තෙක් වේ නම්, ඒ වගේම යම් හෙතෙම සිතෙහි පරම විමුක්තිය වන අරහත් ඵලයට පැමිණීමට කැමති වන්නේ නම්, ලෝකයාගේ (පංචස්කන්ධයාගේ) හටගැනීම හා නැතිවී යාම ද, (අනිටු ස්වභාවය ද) අවබෝධ කරගෙන, නිර්මල සිත් ඇත්තේ ද, කිසිවකට නොඇලී (උපාදානයෙන් තොරව) වාසය කරන්නේ ද, ඔහුට ඒ උතුම් අනුසස (ඵලය) ලැබේ.",
      "paliTitle": "Dutiyakassapasuttaṃ",
      "englishTitle": "Second Sutta with Kassapa",
      "sinhalaTitle": "දුතිය කස්සප සූත්‍රය"
    },
    {
      "number": 84,
      "pali": "Sāvatthinidānaṃ. Atha kho māgho devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho māgho devaputto bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kiṃsu chetvā sukhaṃ seti, kiṃsu chetvā na socati; Kissassu ekadhammassa, vadhaṃ rocesi gotamā’’ti. ‘‘Kodhaṃ chetvā sukhaṃ seti, kodhaṃ chetvā na socati; Kodhassa visamūlassa, madhuraggassa vatrabhū; Vadhaṃ ariyā pasaṃsanti, tañhi chetvā na socatī’’ti.",
      "english": "At Sāvatthī. Then, when the night was far advanced, the deity Māgha, with surpassing beauty, having illuminated the entire Jeta's Grove, approached the Blessed One. Having approached, he paid homage to the Blessed One and stood to one side.\n\nStanding to one side, the deity Māgha addressed the Blessed One with a verse:\n\"Having cut off what does one sleep happily? Having cut off what does one not grieve? Of the destruction of which single quality do you approve, Gotama?\"\n\"Having cut off anger, one sleeps happily. Having cut off anger, one does not grieve. The noble ones praise the destruction of anger, which has a poisonous root and a deceptively sweet allure; for having cut it off, one does not grieve.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඉක්බිති, රාත්‍රිය පහන් වී ගෙන එනවිට, අතිශයින් දීප්තිමත් වූ වර්ණයක් ඇති මාඝ නම් දෙව්පුත්‍රයා, මුළු ජේතවනාරාමයම ආලෝකවත් කරමින්, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පසෙක සිටියේය. එකත්පසෙක සිටි මාඝ දෙව්පුත්‍රයා, භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසීය: ‘‘කුමක් සිඳ බිඳ දැමීමෙන් පුද්ගලයා සැපසේ නිදන්නේද? කුමක් සිඳ බිඳ දැමීමෙන් ශෝක නොකරන්නේද? ගෞතමයන් වහන්ස, ඔබවහන්සේ කුමන එක ධර්මයක විනාශ කිරීම අගය කරන්නේද?’’\n\n‘‘ක්‍රෝධය සිඳ බිඳ දැමීමෙන් පුද්ගලයා සැපසේ නිදන්නේය. ක්‍රෝධය සිඳ බිඳ දැමීමෙන් ශෝක නොකරන්නේය. විෂමූලික වූද, මුලින් විෂක් බඳු වූද, අගින් මධුර වූද, විනාශයට පමුණුවන්නා වූද ඒ ක්‍රෝධයේ විනාශ කිරීම ආර්යයෝ ප්‍රශංසා කරති. එය සිඳ බිඳ දැමීමෙන් කිසිවිටෙක ශෝක නොකරන්නේය.’’",
      "paliTitle": "Māghasuttaṃ",
      "englishTitle": "To Māgha Sutta",
      "sinhalaTitle": "මාඝ සූත්‍රය"
    },
    {
      "number": 85,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ ṭhito kho māgadho devaputto bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kati lokasmiṃ pajjotā, yehi loko pakāsati; Bhavantaṃ puṭṭhumāgamma, kathaṃ jānemu taṃ maya’’nti. ‘‘Cattāro loke pajjotā, pañcamettha na vijjati; Divā tapati ādicco, rattimābhāti candimā. ‘‘Atha aggi divārattiṃ, tattha tattha pakāsati; Sambuddho tapataṃ seṭṭho, esā ābhā anuttarā’’ti.",
      "english": "At Sāvatthī. Standing to one side, the Māgadha devaputta addressed the Blessed One in verse:\n\"How many lights are there in the world by which the world is illuminated? Having approached to question Your Honour, how shall we know that?\"\n\n\"There are four lights in the world; a fifth is not found here. By day the sun shines brilliantly, by night the moon illuminates.\"\n\n\"Furthermore, fire illuminates here and there, by day and by night. The Perfectly Awakened One is the foremost among those who illuminate; this radiance is unsurpassed.\"",
      "sinhala": "සැවැත්නුවරදී සිදුවූ දෙයකි. එකත්පස්ව සිටගත් මාගධ නම් දෙව්පුත් භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසුවේය – ‘‘ලෝකයෙහි පහන් කීයක් තිබේද? යමක් හේතුවෙන් ලෝකය ප්‍රකාශ වන්නේද? භාග්‍යවතුන් වහන්සේගෙන් විමසනු පිණිස පැමිණි අපි එය කෙසේ දැනගනිමුද?’’\n\n‘‘ලෝකයෙහි පහන් සතරකි. පස්වැන්නක් මෙහි නොපවතියි. දවාලෙහි හිරු තපියි. රාත්‍රියෙහි සඳු බබළයි. එසේම ගින්න ද දිවා රෑ දෙක්හි තැනින් තැන ප්‍රකාශ වෙයි. සම්බුදුරජාණන් වහන්සේ තපිනා (පහන් වන) සියල්ලන් අතුරින් උතුම්ය. මේ ආලෝකය අනුත්තරය.’’",
      "paliTitle": "Māgadhasuttaṃ",
      "englishTitle": "At Māgadha Sutta",
      "sinhalaTitle": "මාගධ සූත්‍රය"
    },
    {
      "number": 86,
      "pali": "Sāvatthinidānaṃ. Atha kho dāmali devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho dāmali devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Karaṇīyametaṃ brāhmaṇena, padhānaṃ akilāsunā; Kāmānaṃ vippahānena, na tenāsīsate bhava’’nti. ‘‘Natthi kiccaṃ brāhmaṇassa (dāmalīti bhagavā), Katakicco hi brāhmaṇo. ‘‘Yāva na gādhaṃ labhati nadīsu, Āyūhati sabbagattebhi jantu; Gādhañca laddhāna thale ṭhito yo, Nāyūhatī pāragato hi sova [soti (sī. pī. ka.), hoti (syā. kaṃ.), so (?)]. ‘‘Esūpamā dāmali brāhmaṇassa, Khīṇāsavassa nipakassa jhāyino; Pappuyya jātimaraṇassa antaṃ, Nāyūhatī pāragato hi so’’ti [hotīti (syā. kaṃ.)].",
      "english": "The incident occurred at Sāvatthī. Then, when the night was far advanced, the divine being Dāmali, of surpassing radiance, illuminating the entirety of Jeta's Grove, approached the Blessed One. Having approached, he paid homage to the Blessed One and stood to one side.\n\nStanding to one side, the divine being Dāmali spoke this verse in the presence of the Blessed One:\n\"This indeed is a task for the true brāhmaṇa: through persistent and unwearying exertion, by the complete abandonment of sensual pleasures, he does not long for any future existence.\"\n\n\"There is no task remaining for the true brāhmaṇa, Dāmali,\" said the Blessed One. \"For the true brāhmaṇa has completed his task.\"\n\n\"As long as one has not found firm footing in the rivers, a being struggles with all its limbs. But one who has found firm footing and stands on dry land no longer struggles, for he has reached the other shore.\"\n\n\"This simile, Dāmali, is for the true brāhmaṇa, one whose defilements are eradicated, who is discerning and meditative. Having attained the end of birth and death, he no longer struggles, for he has reached the other shore.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී. එසමයෙහි, රාත්‍රිය ගෙවී ගිය කල්හි, මනහර වර්ණයෙන් යුක්ත දාමලී නම් දෙවියෙක් මුළු ජේතවනාරාමයම බබුළුවා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙක සිටියේය. එක් පසෙක සිටි දාමලී දෙව්පුත් භාග්‍යවතුන් වහන්සේ අභියස මෙසේ ගාථාවක් පැවසුවේය: ‘‘බ්‍රාහ්මණයා විසින් නොකම්මැලිව වීර්ය වැඩීම කළ යුතු කාර්යයකි. කාමයන් දුරු කිරීමෙන් ඔහු භවයක් ප්‍රාර්ථනා නොකරයි.’’\n\n‘‘දාමලී, බ්‍රාහ්මණයාට (තවදුරටත්) කළ යුතු කිසිවක් නැත’’ යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. ‘‘මක්නිසාද යත් බ්‍රාහ්මණයා යනු සියලු කටයුතු නිම කළ කෙනෙකි. ගඟක එතෙර වීමට නොහැකි තාක් කල්, සත්වයා සියලු අත්පා විහිදුවමින් වෙහෙසෙයි. එතෙර වීමට හැකි තැනක් ලබා ගොඩබිම සිටින්නා (සම්පූර්ණයෙන්) එතෙර වූවෙකි. ඔහුට තවදුරටත් වෙහෙසක් නැත. දාමලී, ආශ්‍රවයන් ක්ෂය කළ, ප්‍රඥාවන්ත භාවනානුයෝගී බ්‍රාහ්මණයාට මේ උපමාවයි. ඔහු ජාති-මරණ කෙළවරට පැමිණ, තවදුරටත් නොවෙහෙසෙයි. මක්නිසාද යත් ඔහු එතෙර වූවෙකි.’’",
      "paliTitle": "Dāmalisuttaṃ",
      "englishTitle": "Dāmali Sutta",
      "sinhalaTitle": "දාමලි සූත්‍රය"
    },
    {
      "number": 87,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ ṭhito kho kāmado devaputto bhagavantaṃ etadavoca – ‘‘dukkaraṃ bhagavā, sudukkaraṃ bhagavā’’ti. ‘‘Dukkaraṃ vāpi karonti (kāmadāti bhagavā), Sekhā sīlasamāhitā; Ṭhitattā anagāriyupetassa, Tuṭṭhi hoti sukhāvahā’’ti. ‘‘Dullabhā bhagavā yadidaṃ tuṭṭhī’’ti. ‘‘Dullabhaṃ vāpi labhantntti (kāmadāti bhagavā), Cittavūpasame ratā; Yesaṃ divā ca ratto ca, Bhāvanāya rato mano’’ti. ‘‘Dussamādahaṃ bhagavā yadidaṃ citta’’nti. ‘‘Dussamādahaṃ vāpi samādahantntti (kāmadāti bhagavā), Indriyūpasame ratā; Te chetvā maccuno jālaṃ, Ariyā gacchanti kāmadā’’ti. ‘‘Duggamo bhagavā visamo maggo’’ti. ‘‘Duggame visame vāpi, ariyā gacchanti kāmada; Anariyā visame magge, papatanti avaṃsirā; Ariyānaṃ samo maggo, ariyā hi visame samā’’ti.",
      "english": "The discourse originated at Sāvatthī.\n\nStanding to one side, the deva Kāmada said to the Blessed One: “It is difficult, Blessed One, it is extremely difficult, Blessed One!”\n\nThe Blessed One said, “Even what is difficult is accomplished by those learners who are established in virtue; for one who has gone forth into homelessness and is resolute, there arises contentment that brings happiness.”\n\n“That contentment, Blessed One, is hard to obtain!”\n\nThe Blessed One said, “Even what is hard to obtain is obtained by those who delight in the pacification of the mind; those whose minds delight in mental cultivation day and night.”\n\n“This mind, Blessed One, is hard to compose!”\n\nThe Blessed One said, “Even what is hard to compose is composed by those who delight in the pacification of the faculties; they, having cut the net of death, the Noble Ones, go forth, Kāmada.”\n\n“The path, Blessed One, is hard to traverse and uneven!”\n\nThe Blessed One said, “Even on a path that is hard to traverse and uneven, the Noble Ones go forth, Kāmada. The ignoble ones fall headlong on the uneven path. For the Noble Ones, the path is even; for the Noble Ones, even the uneven is even.”",
      "sinhala": "එක්පැත්තක සිටගත් කාමද නම් දෙව්පුත්‍රයා භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය. ‘‘භාග්‍යවතුන් වහන්ස, අපහසුයි. භාග්‍යවතුන් වහන්ස, ඉතා අපහසුයි.’’\n\n‘‘කාමද, සීලයෙන් සමාහිත වූ, ශික්ෂාකාමී (සේඛ) පුද්ගලයෝ අපහසු වුවද එය කරති. ගිහිගෙයින් නික්ම පැවිදි වී, ස්ථිර වූ සිතක් ඇති අයට සැප ගෙන දෙන තුටු පහටක් ඇති වේ.’’ භාග්‍යවතුන් වහන්සේ පැවසූ සේක.\n\n‘‘භාග්‍යවතුන් වහන්ස, මේ තුටු පහට දුර්ලභයි.’’\n\n‘‘කාමද, දුර්ලභ වුවද එය ලබන්නේ සිත සංසිඳුවීමෙහි ඇලී සිටින අයයි. දහවල් හා රාත්‍රී දෙක්හිම භාවනාවෙහි සිත ඇලී සිටින අය (එය ලබති).’’ භාග්‍යවතුන් වහන්සේ පැවසූ සේක.\n\n‘‘භාග්‍යවතුන් වහන්ස, මේ සිත සමාධිගත කිරීම අපහසුයි.’’\n\n‘‘කාමද, සමාධිගත කිරීම අපහසු වුවද ඉන්ද්‍රියයන් සංසිඳුවීමෙහි ඇලී සිටින අය එය සමාධිගත කරති. මරණයේ දැල සිඳ බිඳ දමා, ඒ ආර්යයෝ (නිවන් මඟට) යති, කාමද.’’ භාග්‍යවතුන් වහන්සේ පැවසූ සේක.\n\n‘‘භාග්‍යවතුන් වහන්ස, මේ මාර්ගය ගමන් කිරීමට අපහසුයි, විෂමයි.’’\n\n‘‘කාමද, දුර්ගම වූත්, විෂම වූත් (මාර්ගයෙහි) වුවද ආර්යයෝ යති. අනාර්‍යයෝ නම් විෂම මාර්ගයෙහි හිස පෙරළා වැටෙති. ආර්යයන්ට නම් මාර්ගය සමයි. ආර්යයෝ විෂම වූ තැනද සම වූවෝ වෙති.’’ භාග්‍යවතුන් වහන්සේ පැවසූ සේක.",
      "paliTitle": "Kāmadasuttaṃ",
      "englishTitle": "To Kāmada Sutta",
      "sinhalaTitle": "කාමද සූත්‍රය"
    },
    {
      "number": 88,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ ṭhito kho pañcālacaṇḍo devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Sambādhe vata okāsaṃ, avindi bhūrimedhaso; Yo jhānamabujjhi [jhānamabudhā (ka. sī.), jhānamabuddhi (syā. kaṃ. pī. ka.)] buddho, paṭilīnanisabho munī’’ti. ‘‘Sambādhe vāpi vindantntti (pañcālacaṇḍāti bhagavā), Dhammaṃ nibbānapattiyā; Ye satiṃ paccalatthaṃsu, Sammā te susamāhitā’’ti.",
      "english": "At Sāvatthī, standing to one side, the deity Pañcālacaṇḍa spoke this verse in the presence of the Blessed One:\n\n\"Truly, within constraint, a space was found by the one of vast wisdom –\nHe, the Awakened One, a sage, noble and withdrawn, who awoke to meditative absorption.\"\n\nThe Blessed One then replied:\n\"Even within constraint, they find the Dhamma for the attainment of Nibbāna;\nThose who have firmly established mindfulness, they are rightly well-composed.\"",
      "sinhala": "සැවැත් නුවරදී මේ සිද්ධිය සිදු විය.\n\nඑක් පසෙක සිටගෙන සිටි පඤ්චාලචණ්ඩ නම් දෙවියෙක් භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව පැවසීය:\n\"ඇත්තෙන්ම, කෙලෙස් දුක්ඛයෙන් ගහණ වූ මේ ලෝකයේ (මිදීමට) මඟක්, මහා ප්‍රඥාවන්ත තථාගතයන් වහන්සේ සොයා ගත්තා. යම් බුදුරදුන් (විශේෂයෙන්) ධ්‍යාන (ආර්ය ධ්‍යාන) අවබෝධ කළ සේක් ද, (උන්වහන්සේ) කෙලෙසුන්ගෙන් වෙන්වූ අති ශ්‍රේෂ්ඨ මුනිවරයෙකි.\"\n\n(භාග්‍යවතුන් වහන්සේ පඤ්චාලචණ්ඩට පැවසූ සේක:) \"පඤ්චාලචණ්ඩ, දුකින් පිරුණු (සම්බාධ වූ) මේ ලෝකයේදී පවා නිර්වාණය අවබෝධ කර ගැනීම පිණිස ධර්මය සොයා ගන්නේ, යම් අය මනා කොට සතිය පිහිටුවා ගත්තාහු ද, ඔවුන් ය. ඔවුහු මනා කොට සමාධිමත් වූවෝ වෙති.\"",
      "paliTitle": "Pañcālacaṇḍasuttaṃ",
      "englishTitle": "The Discourse to Pañcālacaṇḍa",
      "sinhalaTitle": "පඤ්චාලචණ්ඩ සූත්‍රය"
    },
    {
      "number": 89,
      "pali": "Sāvatthinidānaṃ. Atha kho tāyano devaputto purāṇatitthakaro abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho tāyano devaputto bhagavato santike imā gāthāyo abhāsi – ‘‘Chinda sotaṃ parakkamma, kāme panuda brāhmaṇa; Nappahāya munī kāme, nekattamupapajjati. ‘‘Kayirā ce kayirāthenaṃ, daḷhamenaṃ parakkame; Sithilo hi paribbājo, bhiyyo ākirate rajaṃ. ‘‘Akataṃ dukkaṭaṃ [dukkataṃ (sī. pī.)] seyyo, pacchā tapati dukkaṭaṃ; Katañca sukataṃ seyyo, yaṃ katvā nānutappati. ‘‘Kuso yathā duggahito, hatthamevānukantati; Sāmaññaṃ dupparāmaṭṭhaṃ, nirayāyūpakaḍḍhati. ‘‘Yaṃ kiñci sithilaṃ kammaṃ, saṃkiliṭṭhañca yaṃ vataṃ; Saṅkassaraṃ brahmacariyaṃ, na taṃ hoti mahapphala’’nti. Idamavoca tāyano devaputto; idaṃ vatvā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyīti. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ tāyano nāma devaputto purāṇatitthakaro abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho, bhikkhave, tāyano devaputto mama santike imā gāthāyo abhāsi – ‘‘Chinda sotaṃ parakkamma, kāme panuda brāhmaṇa; Nappahāya munī kāme, nekattamupapajjati. ‘‘Kayirā ce kayirāthenaṃ, daḷhamenaṃ parakkame; Sithilo hi paribbājo, bhiyyo ākirate rajaṃ. ‘‘Akataṃ dukkaṭaṃ seyyo, pacchā tapati dukkaṭaṃ; Katañca sukataṃ seyyo, yaṃ katvā nānutappati. ‘‘Kuso yathā duggahito, hatthamevānukantati; Sāmaññaṃ dupparāmaṭṭhaṃ, nirayāyūpakaḍḍhati. ‘‘Yaṃ kiñci sithilaṃ kammaṃ, saṃkiliṭṭhañca yaṃ vataṃ; Saṅkassaraṃ brahmacariyaṃ, na taṃ hoti mahapphala’’nti. ‘‘Idamavoca, bhikkhave, tāyano devaputto, idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Uggaṇhātha, bhikkhave, tāyanagāthā; pariyāpuṇātha, bhikkhave, tāyanagāthā; dhāretha, bhikkhave, tāyanagāthā. Atthasaṃhitā, bhikkhave, tāyanagāthā ādibrahmacariyikā’’ti.",
      "english": "At Sāvatthī, then, when the night was far advanced, the deva named Tāyano, a former leader of a religious sect, with his beautiful radiance illuminating the entire Jeta’s Grove, approached the Blessed One. Having approached, he paid homage to the Blessed One and stood to one side. Standing to one side, the deva Tāyano recited these verses in the presence of the Blessed One:\n\n“Cut off the stream of craving with utmost effort, O brahmin, cast away all sense desires. A sage who has not abandoned sense desires cannot attain the state of oneness.\n\nIf one is to do something, one should do it firmly; one should strive at it with firmness. For lax asceticism only stirs up more defilements.\n\nBetter is an evil deed left undone, for a done evil deed torments later. Better is a good deed done, which one does not regret after doing.\n\nJust as kusa grass poorly grasped cuts the hand itself, so too, the renunciant’s practice, if poorly handled, drags one down to hell.\n\nWhatever slack action, whatever vow is defiled, the holy life, practiced with wavering doubt, that does not bear great fruit.”\n\nThe deva Tāyano said this. Having said this, he paid homage to the Blessed One, circumambulated him respectfully, and vanished right there.\n\nThen, when that night had passed, the Blessed One addressed the bhikkhus, saying: “Bhikkhus, last night, the deva named Tāyano, a former leader of a religious sect, with his beautiful radiance illuminating the entire Jeta’s Grove during the advanced night, approached me. Having approached, he paid homage to me and stood to one side. Standing to one side, bhikkhus, the deva Tāyano recited these verses in my presence:\n\n“Cut off the stream of craving with utmost effort, O brahmin, cast away all sense desires. A sage who has not abandoned sense desires cannot attain the state of oneness.\n\nIf one is to do something, one should do it firmly; one should strive at it with firmness. For lax asceticism only stirs up more defilements.\n\nBetter is an evil deed left undone, for a done evil deed torments later. Better is a good deed done, which one does not regret after doing.\n\nJust as kusa grass poorly grasped cuts the hand itself, so too, the renunciant’s practice, if poorly handled, drags one down to hell.\n\nWhatever slack action, whatever vow is defiled, the holy life, practiced with wavering doubt, that does not bear great fruit.”\n\n“Bhikkhus, the deva Tāyano said this; having said this, he paid homage to me, circumambulated me respectfully, and vanished right there. Learn, bhikkhus, these verses of Tāyano; master, bhikkhus, these verses of Tāyano; remember, bhikkhus, these verses of Tāyano. Bhikkhus, these verses of Tāyano are connected with the goal, they are fundamental to the holy life.”",
      "sinhala": "සා­වැ­ත් නුවරදීය. ඉක්බිති පුරාණ තිත්ථකර නම් තායන දෙව්පුත්, රාත්‍රිය බොහෝ සෙයින් ගෙවී ගිය කල්හි, අතිශයින්ම පැහැපත් වර්ණයකින් යුක්තව, මුළු ජේතවනයම ආලෝකමත් කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙක සිටියේය. එක් පසෙක සිටි තායන දෙව්පුත් භාග්‍යවතුන් වහන්සේ අබියස මේ ගාථා පැවසුවේය –\n\n‘‘වීර්යයෙන් යුක්තව සසර ප්‍රවාහය සිඳ දමන්න. එම්බා බ්‍රාහ්මණය, කාමයන් දුරු කරන්න. කාමයන් අත්නොහළ මුනිරාහුට ඒකත්වය (නිවන) නොලැබේ.\n\nයමක් කළ යුතු නම්, එය නොපසුබට වීර්යයෙන්, ස්ථිරසාර ලෙස කළ යුතුය. ශිථිල වූ (දුබල) පැවිදි දිවිය තව තවත් කෙලෙස් රජස් ඉසිරවයි.\n\nනොකළ දුකක් (දුෂ්කර්මයක්) මැනවි; කළ දුකක් (දුෂ්කර්මයක්) පසුව තැවෙන්නට සලස්වයි. කළ සුකක් (සුකර්මයක්) මැනවි; එය කොට පසුව පසුතැවීමක් ඇති නොවේ.\n\nවැරදි ලෙස අල්ලාගත් කුස තණ අතම කපන්නා සේ, වැරදි ලෙස පිළිපදින ලද ශ්‍රමණ භාවය නිරයටම ඇද දමයි.\n\nයම්කිසි ශිථිල වූ කර්මයක් ද, කෙලෙසන ලද යම් ව්‍රතයක් ද, විශ්වාසයක් නැති බ්‍රහ්මචර්යාව ද, ඒවා මහත් ඵලයක් නොදේ.’’\n\nතායන දෙව්පුත් මෙය පැවසුවේය. මෙය පවසා භාග්‍යවතුන් වහන්සේට වන්දනා කොට ප්‍රදක්ෂිණා කර, එතනම අතුරුදහන් විය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ රාත්‍රිය ගෙවී ගිය කල්හි භික්ෂූන් අමතා වදාළ සේක – ‘‘මහණෙනි, මේ රාත්‍රියේ පුරාණ තිත්ථකර නම් තායන දෙව්පුත්, රාත්‍රිය බොහෝ සෙයින් ගෙවී ගිය කල්හි, අතිශයින්ම පැහැපත් වර්ණයකින් යුක්තව, මුළු ජේතවනයම ආලෝකමත් කොට, මා වැඩසිටි තැනට පැමිණියේය. පැමිණ මට වන්දනා කොට එක් පසෙක සිටියේය. මහණෙනි, එක් පසෙක සිටි තායන දෙව්පුත් මා අබියස මේ ගාථා පැවසුවේය –\n\n‘‘වීර්යයෙන් යුක්තව සසර ප්‍රවාහය සිඳ දමන්න. එම්බා බ්‍රාහ්මණය, කාමයන් දුරු කරන්න. කාමයන් අත්නොහළ මුනිරාහුට ඒකත්වය (නිවන) නොලැබේ.\n\nයමක් කළ යුතු නම්, එය නොපසුබට වීර්යයෙන්, ස්ථිරසාර ලෙස කළ යුතුය. ශිථිල වූ (දුබල) පැවිදි දිවිය තව තවත් කෙලෙස් රජස් ඉසිරවයි.\n\nනොකළ දුකක් (දුෂ්කර්මයක්) මැනවි; කළ දුකක් (දුෂ්කර්මයක්) පසුව තැවෙන්නට සලස්වයි. කළ සුකක් (සුකර්මයක්) මැනවි; එය කොට පසුව පසුතැවීමක් ඇති නොවේ.\n\nවැරදි ලෙස අල්ලාගත් කුස තණ අතම කපන්නා සේ, වැරදි ලෙස පිළිපදින ලද ශ්‍රමණ භාවය නිරයටම ඇද දමයි.\n\nයම්කිසි ශිථිල වූ කර්මයක් ද, කෙලෙසන ලද යම් ව්‍රතයක් ද, විශ්වාසයක් නැති බ්‍රහ්මචර්යාව ද, ඒවා මහත් ඵලයක් නොදේ.’’\n\n‘‘මහණෙනි, තායන දෙව්පුත් මෙය පැවසුවේය. මෙය පවසා මට වන්දනා කොට ප්‍රදක්ෂිණා කර, එතනම අතුරුදහන් විය. මහණෙනි, මේ තායන ගාථා ඉගෙන ගනිව්. මහණෙනි, මේ තායන ගාථා ප්‍රගුණ කරව්. මහණෙනි, මේ තායන ගාථා සිත්හි දරා ගනිව්. මහණෙනි, මේ තායන ගාථා අර්ථවත්ය, බ්‍රහ්මචර්යාවේ මූලික අංගයන්ට අදාළය.’’",
      "paliTitle": "Tāyanasuttaṃ",
      "englishTitle": "Discourse to Tāyana",
      "sinhalaTitle": "තායන සූත්‍රය"
    },
    {
      "number": 90,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena candimā devaputto rāhunā asurindena gahito hoti. Atha kho candimā devaputto bhagavantaṃ anussaramāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Namo te buddha vīratthu, vippamuttosi sabbadhi; Sambādhapaṭipannosmi, tassa me saraṇaṃ bhavā’’ti. Atha kho bhagavā candimaṃ devaputtaṃ ārabbha rāhuṃ asurindaṃ gāthāya ajjhabhāsi – ‘‘Tathāgataṃ arahantaṃ, candimā saraṇaṃ gato; Rāhu candaṃ pamuñcassu, buddhā lokānukampakā’’ti. Atha kho rāhu asurindo candimaṃ devaputtaṃ muñcitvā taramānarūpo yena vepacitti asurindo tenupasaṅkami; upasaṅkamitvā saṃviggo lomahaṭṭhajāto ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho rāhuṃ asurindaṃ vepacitti asurindo gāthāya ajjhabhāsi – ‘‘Kiṃ nu santaramānova, rāhu candaṃ pamuñcasi; Saṃviggarūpo āgamma, kiṃ nu bhītova tiṭṭhasī’’ti. ‘‘Sattadhā me phale muddhā, jīvanto na sukhaṃ labhe; Buddhagāthābhigītomhi, no ce muñceyya candima’’nti.",
      "english": "This discourse originated in Sāvatthī. At that time, the lunar deity Candimā was seized by Rāhu, the lord of asuras. Then, remembering the Blessed One, the lunar deity Candimā uttered this verse at that moment: \"Homage to you, O Buddha, O Hero, you are entirely liberated from all bonds; I am in distress, be my refuge!\" Then, concerning the lunar deity Candimā, the Blessed One addressed Rāhu, the lord of asuras, with this verse: \"Candimā has gone for refuge to the Tathāgata, the Arahant; therefore, Rāhu, release Candimā, for Buddhas are compassionate to the world.\" Then, Rāhu, the lord of asuras, released the lunar deity Candimā and, in great haste, approached Vepacitti, the lord of asuras; having approached, he stood to one side, agitated and with his hair standing on end. As Rāhu, the lord of asuras, stood to one side, Vepacitti, the lord of asuras, addressed him with this verse: \"Why, Rāhu, did you release Candimā in such haste? And having come here agitated, why do you stand as if terrified?\" \"My head would split into seven pieces, and I would not find happiness while alive, if I did not release Candimā after being admonished by the Buddha's verse.\"",
      "sinhala": "සැවැත්නුවරදී සිදු වූවකි. එකල චන්ද්‍රිමා දෙව්පුත්හු රාහු අසුරේන්ද්‍රයා විසින් අල්ලාගෙන සිටියේය. එවිට චන්ද්‍රිමා දෙව්පුත්හු භාග්‍යවතුන් වහන්සේ සිහිපත් කරමින්, ඒ වේලාවේදී මෙම ගාථාව ප්‍රකාශ කළේය – “වීර වූ බුදුන් වහන්ස, ඔබට නමස්කාර වේවා! ඔබ සියලු ආකාරයෙන්ම විමුක්ත වූවෙකි. මම දුක්ඛිත තත්ත්වයකට පත්ව සිටිමි, එහෙයින් මට පිහිට වුව මැනව!” එවිට භාග්‍යවතුන් වහන්සේ චන්ද්‍රිමා දෙව්පුතු අරබයා රාහු අසුරේන්ද්‍රයාට ගාථාවකින් මෙසේ පැවසූසේක – “චන්ද්‍රිමා තථාගත අරහතුන් වහන්සේ සරණ ගියේය. රාහු, සඳු මුදා හරිනු! බුදුරජාණන් වහන්සේලා ලෝකයාට අනුකම්පා ඇත්තෝය.” එවිට රාහු අසුරේන්ද්‍රයා චන්ද්‍රිමා දෙව්පුතු මුදා හැර, කඩිමුඩියේ ගොස් වේපචිත්ති අසුරේන්ද්‍රයා සිටින තැනට පැමිණියේය; එසේ පැමිණ, භයෙන් සැලී, ලොමුදැහැගන්වාගෙන එකත්පසෙක සිටියේය. එකත්පසෙක සිටි රාහු අසුරේන්ද්‍රයාට වේපචිත්ති අසුරේන්ද්‍රයා ගාථාවකින් මෙසේ පැවසීය – “රාහු, ඔබ මෙතරම් කඩිමුඩියේ සඳු මුදා හැරියේ ඇයි? බියෙන් සැලී, බියට පත් වූවකු මෙන් පැමිණ සිටින්නේ ඇයි?” “මාගේ හිස සත් කඩකට පැළී යනු ඇත, මම ජීවත් වුවද සැපයක් නොලබමි; මක්නිසාද යත්, මා බුදුරජාණන් වහන්සේගේ ගාථාවකින් අවවාද ලැබූ බැවිනි, එනම් මම චන්ද්‍රිමා මුදා නොහැරියේ නම්.”",
      "paliTitle": "Candimasuttaṃ",
      "englishTitle": "The Moon Sutta",
      "sinhalaTitle": "චන්දිම සූත්‍රය"
    },
    {
      "number": 91,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena sūriyo devaputto rāhunā asurindena gahito hoti. Atha kho sūriyo devaputto bhagavantaṃ anussaramāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Namo te buddha vīratthu, vippamuttosi sabbadhi; Sambādhapaṭipannosmi, tassa me saraṇaṃ bhavā’’ti. Atha kho bhagavā sūriyaṃ devaputtaṃ ārabbha rāhuṃ asurindaṃ gāthāhi ajjhabhāsi – ‘‘Tathāgataṃ arahantaṃ, sūriyo saraṇaṃ gato; Rāhu sūriyaṃ [suriyaṃ (sī. syā. kaṃ. pī.)] pamuñcassu, buddhā lokānukampakā. ‘‘Yo andhakāre tamasi pabhaṅkaro, Verocano maṇḍalī uggatejo; Mā rāhu gilī caramantalikkhe, Pajaṃ mamaṃ rāhu pamuñca sūriya’’nti. Atha kho rāhu asurindo sūriyaṃ devaputtaṃ muñcitvā taramānarūpo yena vepacitti asurindo tenupasaṅkami; upasaṅkamitvā saṃviggo lomahaṭṭhajāto ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho rāhuṃ asurindaṃ vepacitti asurindo gāthāya ajjhabhāsi – ‘‘Kiṃ nu santaramānova, rāhu sūriyaṃ pamuñcasi; Saṃviggarūpo āgamma, kiṃ nu bhītova tiṭṭhasī’’ti. ‘‘Sattadhā me phale muddhā, jīvanto na sukhaṃ labhe; Buddhagāthābhigītomhi, no ce muñceyya sūriya’’nti. Paṭhamo vaggo. Tassuddānaṃ – Dve kassapā ca māgho ca, māgadho dāmali kāmado; Pañcālacaṇḍo tāyano, candimasūriyena te dasāti.",
      "english": "The occasion was at Sāvatthī. Now at that time, Sūriya, the divine being, had been seized by Rāhu, the lord of asuras. Then Sūriya, the divine being, recollecting the Blessed One at that moment, uttered this verse: \"Homage to you, O Buddha, O Hero! You are utterly freed in all respects. I have fallen into distress; be a refuge for me in this situation.\"\n\nThen the Blessed One, addressing Sūriya, the divine being, spoke to Rāhu, the lord of asuras, with these verses: \"Sūriya has gone for refuge to the Tathāgata, the Arahant. Rāhu, release Sūriya! Buddhas are compassionate towards the world. He who brings light into the dark gloom, the brilliant, radiant one, a disc of immense power—O Rāhu, do not swallow him as he moves in the firmament! O Rāhu, release Sūriya, my creature!\"\n\nThen Rāhu, the lord of asuras, having released Sūriya, the divine being, quickly approached Vepacitti, the lord of asuras. Having approached, agitated and with his hair standing on end, he stood to one side. Vepacitti, the lord of asuras, addressed Rāhu, the lord of asuras, who was standing to one side, with a verse: \"Why indeed, O Rāhu, do you release Sūriya in such haste? Having arrived in such an agitated state, why do you stand as if afraid?\" Rāhu replied: \"My head would split into seven pieces, and living, I would find no happiness, if I were not to release Sūriya, for I have been admonished by the Buddha's verses.\"\n\nThe First Chapter. Its Summary: Two Kassapas, and Māgha, and Māgadha, Dāmali, Kāmada; Pañcālacaṇḍa, Tāyana, and with Candima and Sūriya, these are ten.",
      "sinhala": "සා​වැත්නුවරදී සිදු වූ කථාවයි.\n\nඑක් සමයෙක සූරිය දෙවිපුත්‍රයා රාහු අසුරේන්ද්‍රයා විසින් අල්ලාගෙන සිටියේය. එවිට සූරිය දෙවිපුත්‍රයා භාග්‍යවතුන් වහන්සේ සිහි කරමින් ඒ වෙලාවේ මෙම ගාථාව ප්‍රකාශ කළේය: \"බුදුරජාණන් වහන්සේට, වීරයන් වහන්සේට මගේ නමස්කාරය වේවා! ඔබ වහන්සේ සියලු ආකාරයෙන්ම විමුක්ත වූ සේක. මම දුකට පත් ව සිටිමි, ඔබ වහන්සේ මට පිහිට වුව මැනව!\"\n\nඑවිට භාග්‍යවතුන් වහන්සේ සූරිය දෙවිපුත්‍රයා අරභයා රාහු අසුරේන්ද්‍රයාට ගාථාවලින් වදාළ සේක: \"තථාගත අරහතුන් වහන්සේ සරණ කොට ගත් සූරිය දෙවිපුත්‍රයාව, රාහු, මුදා හරිව! බුදුවරු ලෝකයාට අනුකම්පා ඇත්තෝය. අන්ධකාරයෙහි, අඳුරෙහි ආලෝකය හටගන්වන්නා වූ, අතිශය තේජස් ඇති ඒ මණ්ඩලීය ප්‍රභාමත් දෙවිඳුන්, අහසෙහි ගමන් කරන ඔහු, රාහු, ගිල නොගනිව! රාහු, මාගේ අනුග්‍රහ ලබන්නා වූ සූරිය දෙවිපුත්‍රයාව මුදා හරිව!\"\n\nඑවිට රාහු අසුරේන්ද්‍රයා සූරිය දෙවිපුත්‍රයාව මුදා හැර, කඩිමුඩියේ වේපචිත්ති අසුරේන්ද්‍රයා වෙත පැමිණියේය. පැමිණ, තැතිගෙන, ලොමුදැහැ ගැන්වී, එක් පසෙක සිටියේය. එක් පසෙක සිටි රාහු අසුරේන්ද්‍රයාට වේපචිත්ති අසුරේන්ද්‍රයා ගාථාවකින් මෙසේ කීවේය: \"රාහු, කඩිමුඩියේ සූරිය දෙවිපුත්‍රයාව මුදා හැරියේ ඇයි? තැතිගත් ස්වභාවයෙන් පැමිණ, බියට පත් වූවකු මෙන් සිටින්නේ ඇයි?\" \"මාගේ හිස සත් කඩකට පැළී යනු ඇත, ජීවත් වන තුරා මට සැපයක් නොලැබෙනු ඇත, බුදුරජාණන් වහන්සේගේ ගාථාවලින් මා අවවාද ලැබූ නිසා මම සූරිය දෙවිපුත්‍රයාව මුදා නොහැරියේ නම්.\"\n\nපළමු වග්ගය.\n\nඑහි උද්දානය මෙසේය: කස්සප දෙදෙනාද, මාඝද, මාගධද, දාමලිද, කාමදද, පංචාලචණ්ඩද, තායනද, චන්දිම සහ සූරියද - ඔවුහු දස දෙනා වෙති.",
      "paliTitle": "Sūriyasuttaṃ",
      "englishTitle": "The Discourse on the Sun",
      "sinhalaTitle": "සූරිය සූත්‍රය"
    },
    {
      "number": 92,
      "pali": "Sāvatthinidānaṃ. Atha kho candimaso [candimāso (ka.)] devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho candimaso devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Te hi sotthiṃ gamissanti, kacche vāmakase magā; Jhānāni upasampajja, ekodi nipakā satā’’ti. ‘‘Te hi pāraṃ gamissanti, chetvā jālaṃva ambujo; Jhānāni upasampajja, appamattā raṇañjahā’’ti.",
      "english": "At Sāvatthī. Then, when the night was far advanced, the deva-son Candimā, of surpassing radiance, having illuminated the entire Jeta Grove, approached the Blessed One. Having approached, he paid homage to the Blessed One and stood to one side.\nStanding to one side, the deva-son Candimā recited this verse in the presence of the Blessed One:\n“Indeed, those who wander like deer in a marsh on the wrong side will attain safety, having entered the meditative absorptions, being one-pointed, discerning, and mindful.”\n“Indeed, they will reach the far shore, having cut through the net like a frog, having entered the meditative absorptions, being diligent and having abandoned defilements.”",
      "sinhala": "සැවැත්නුවරදී සිදුවූවකි.\n\nඉක්බිති, චන්දිමස් නම් දෙව්පුත් තෙමේ, රාත්‍රිය මනරම් වූ කල්හි, අතිශයින් පැහැපත් වෙසින්, මුළු ජේතවනාරාමයම ආලෝකමත් කරවමින්, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එක් පසෙක සිටියේය. එක් පසෙක සිටි චන්දිමස් දෙව්පුත් තෙමේ, භාග්‍යවතුන් වහන්සේ ඉදිරියේ, මේ ගාථාව කීවේය –\n\n‘‘ධ්‍යාන උපදවාගෙන, එකඟ සිතින්, නුවණැතිව, සිහියෙන් යුතුව සිටින්නාවූ ඔවුහු, කෙලෙස් නම් දුර්ග මාර්ගයේ පැටලුණු මුවන් සේ වුවද, ඒකාන්තයෙන් සැනසීම ලබන්නාහ.’’\n\n‘‘ඒකාන්තයෙන් ඔවුහු, දැලක් සිඳ දමා, ජලයෙන් මතුවී සිටින නෙළුමක් මෙන්, ධ්‍යාන උපදවාගෙන, අප්‍රමාදීව, කෙලෙස් දුරු කරමින්, සසරින් එතෙර වන්නාහ.’’",
      "paliTitle": "Candimasasuttaṃ",
      "vagga": "Anāthapiṇḍikavaggo",
      "englishTitle": "The Moon God Sutta",
      "sinhalaTitle": "චන්දිමස සූත්‍රය",
      "vaggaEnglish": "Chapter on Anāthapiṇḍika",
      "vaggaSinhala": "අනාථපිණ්ඩික වර්ගය"
    },
    {
      "number": 93,
      "pali": "Ekamantaṃ ṭhito kho veṇḍu [veṇhu (sī.)] devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Sukhitāva te [sukhitā vata te (sī. syā. kaṃ.)] manujā, sugataṃ payirupāsiya; Yuñjaṃ [yujja (sī.), yuñja (syā. kaṃ. pī.)] gotamasāsane, appamattā nu sikkhare’’ti. ‘‘Ye me pavutte siṭṭhipade [satthipade (sī. syā. kaṃ. pī.)] (veṇḍūti bhagavā), Anusikkhanti jhāyino; Kāle te appamajjantā, Na maccuvasagā siyu’’nti.",
      "english": "Standing to one side, the deva-son Veṇḍu spoke this verse in the presence of the Blessed One:\n\"Truly happy are those people who attend upon the Fortunate One; engaging in the teaching of Gotama, they surely train with diligence.\"\n\n\"Veṇḍu,\" the Blessed One said, \"those who, being meditative, train themselves in the principles I have proclaimed, being diligent at the opportune moment, will not fall under the sway of death.\"",
      "sinhala": "එක් පසෙක සිටි වේණ්ඩු නම් දෙවිපුත්‍රයා භාග්‍ය​වතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍ර​කාශ කළේය: “සුගතයන් වහන්සේ ඇසුරු කරමින්, ගෞතම ශාසනයෙහි අප්‍ර​මාදීව යෙදෙමින් හික්මෙන ඒ මනුෂ්‍යයෝ සැබවින්ම සුවපත් වෙති.”\n\n“වේණ්ඩු, මා විසින් දේශනා කරන ලද ධ​ර්ම මා​ර්ගයෙහි යෙදෙමින්, ධ්‍යාන වඩන සුළු වූ යම් අයෙක් සිටීද, ඔවුන් ධ​ර්මය ප්‍ර​ගුණ කිරීමට සුදුසු වූ මේ කාලයෙහි අප්‍ර​මාදීව කටයුතු කරන්නේ නම්, මරණයේ වසඟයට පත් නොවන්නේය.”",
      "paliTitle": "Veṇḍusuttaṃ",
      "englishTitle": "The Discourse to Veṇḍu",
      "sinhalaTitle": "වෙණ්ඩු සූත්‍රය"
    },
    {
      "number": 94,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho dīghalaṭṭhi devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ veḷuvanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho dīghalaṭṭhi devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Bhikkhu siyā jhāyī vimuttacitto, Ākaṅkhe ce hadayassānupattiṃ; Lokassa ñatvā udayabbayañca, Sucetaso anissito tadānisaṃso’’ti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. Then, when the night was far advanced, Dīghalaṭṭhi the deva, with his exquisite radiance illuminating the entire Bamboo Grove, approached the Blessed One. Having approached, he paid homage to the Blessed One and stood to one side. Standing to one side, Dīghalaṭṭhi the deva recited this verse in the presence of the Blessed One:\n\nA monk may be a meditator, with a liberated mind.\nIf he yearns for the attainment of the heart's liberation,\nand having understood the arising and passing away of the world,\nwith a pure mind, unattached, he enjoys its fruit.",
      "sinhala": "මෙසේ මා විසින් අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දක නිවාපයේ වැඩසිටින සේක. එකල්හී දීඝලට්ඨි නම් දෙව්පුත්‍රයා, රාත්‍රිය අතිශයින් ගෙවී ගිය කල්හි, අතිශයින් මනහර වර්ණ ඇත්තෙක් වී, මුළු වේළුවනම බබළවමින්, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව සිටියේය. එකත්පස්ව සිටි දීඝලට්ඨි දෙව්පුත්‍රයා භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව ප්‍රකාශ කළේය – ‘‘භික්ෂුව ධ්‍යාන වඩන්නෙක් වී, විමුක්ති සිත් ඇත්තෙක් විය යුතුය. යම් හෙයකින් හෘදයානුපත්තිය (අරහත්ඵලය) ප්‍රාර්ථනා කරන්නේ නම්, ලෝකයේ ඇතිවීම හා නැතිවීම දැන, යහපත් සිත් ඇත්තෙක්ව, ඇල්මෙන් තොරව, ඒකාන්තයෙන්ම ආනිසංස ඇත්තේය.’’",
      "paliTitle": "Dīghalaṭṭhisuttaṃ",
      "englishTitle": "Dīghalaṭṭhi Sutta",
      "sinhalaTitle": "දීඝලට්ඨි සූත්‍රය"
    },
    {
      "number": 95,
      "pali": "Ekamantaṃ ṭhito kho nandano devaputto bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Pucchāmi taṃ gotama bhūripañña, Anāvaṭaṃ bhagavato ñāṇadassanaṃ; Kathaṃvidhaṃ sīlavantaṃ vadanti, Kathaṃvidhaṃ paññavantaṃ vadanti; Kathaṃvidho dukkhamaticca iriyati, Kathaṃvidhaṃ devatā pūjayantī’’ti. ‘‘Yo sīlavā paññavā bhāvitatto, Samāhito jhānarato satīmā; Sabbassa sokā vigatā pahīnā, Khīṇāsavo antimadehadhārī. ‘‘Tathāvidhaṃ sīlavantaṃ vadanti, Tathāvidhaṃ paññavantaṃ vadanti; Tathāvidho dukkhamaticca iriyati, Tathāvidhaṃ devatā pūjayantī’’ti.",
      "english": "Standing to one side, the deva Nandanā addressed the Blessed One with a verse:\n\"I ask you, Gotama, profound in wisdom, whose vision and knowledge is unobstructed: What kind of person do they call virtuous? What kind of person do they call wise? What kind of person transcends suffering and lives freely? What kind of person do devas revere?\"\n\n\"The one who is virtuous, wise, and whose mind is fully cultivated, well-composed, delighting in meditation, and mindful—for whom all sorrows have vanished and been abandoned, whose defilements are destroyed, and who bears this final body. Such a one do they call virtuous; such a one do they call wise; such a one transcends suffering and lives freely; such a one do devas revere.\"",
      "sinhala": "නන්දන නම් දෙව්​පුත් එක්​පැත්තක සිටගෙන භාග්‍යවතුන් වහන්සේට ගාථාවකින් කියා සිටියේය –\n\n‘‘මහා​ප්‍රඥා ඇති ගෞතමයාණෙනි, අවරණය නොවූ ඤාණදර්ශනය ඇති භාග්‍යවතුන් වහන්ස, මම ඔබෙන් අසමි: කවර ආකාරයේ පුද්ගලයෙක්ව සිල්වත් යැයි හඳුන්වන්නේද? කවර ආකාරයේ පුද්ගලයෙක්ව ප්‍රඥාවන්ත යැයි හඳුන්වන්නේද? කවර ආකාරයේ පුද්ගලයෙක් දුක ඉක්මවා හැසිරෙන්නේද? කවර ආකාරයේ පුද්ගලයෙක්ව දෙවියෝ පුදන්නේද?’’\n\n‘‘යමෙක් සිල්වත් නම්, ප්‍රඥාවන්ත නම්, භාවනා​වෙන් දියුණු කළ සිත් ඇත්තෙක් නම්, සමාධිමත් නම්, ධ්‍යානයට ඇලුම් කරන්නෙක් නම්, සිහි ඇති අයෙක් නම්, ඔහුගේ සියලු ශෝකයන් පහව ගොස් නිරුද්ධ වී ඇත්නම්, ක්ෂීණාශ්‍රව නම්, අන්තිම ශරීරය දරා සිටින්නෙක් නම්, එවැනි පුද්ගලයෙක්ව සිල්වත් යැයි හඳුන්වති. එවැනි පුද්ගලයෙක්ව ප්‍රඥාවන්ත යැයි හඳුන්වති. එවැනි පුද්ගලයෙක් දුක ඉක්මවා හැසිරෙයි. එවැනි පුද්ගලයෙක්ව දෙවියෝ පුදති.’’",
      "paliTitle": "Nandanasuttaṃ",
      "englishTitle": "The Discourse on Delight (Nandana Grove)",
      "sinhalaTitle": "නන්දන සූත්‍රය"
    },
    {
      "number": 96,
      "pali": "Ekamantaṃ ṭhito kho candano devaputto bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kathaṃsu [kosudha (sī.)] tarati oghaṃ, rattindivamatandito; Appatiṭṭhe anālambe, ko gambhīre na sīdatī’’ti. ‘‘Sabbadā sīlasampanno, paññavā susamāhito; Āraddhavīriyo pahitatto, oghaṃ tarati duttaraṃ. ‘‘Virato kāmasaññāya, rūpasaṃyojanātigo; Nandīrāgaparikkhīṇo, so gambhīre na sīdatī’’ti.",
      "english": "Standing to one side, the devaputta Candana addressed the Blessed One with a verse: “How, indeed, does one cross the flood, tireless day and night? Who does not sink in the deep, without footing or support?”\n\n“One who is always endowed with virtue, possessing wisdom, and well-concentrated; one with energy aroused and a resolute mind crosses the flood, so difficult to cross.\n\n“One who has ceased from the perception of sensuality, one who has gone beyond the fetters of form; one whose delight and passion are completely exhausted — that one does not sink in the deep.”",
      "sinhala": "එක් පසෙක සිටි සඳුන් නම් දෙවියෝ භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසූහ:\n\"අලස නොවී රෑ දාවල් නොනවත්වා වීර්යය කරන කවරෙක් මේ ඕඝය (සංසාර සාගරය) තරණය කරන්නේද? පිහිටක් නැති, ආලම්බනයක් නැති (ඇලී සිටීමට තැනක් නැති) ගැඹුරු (සංසාර) සාගරයේ කවරෙක් නොගිලෙන්නේද?\"\n\n\"සෑම කල්හිම සීලයෙන් යුක්ත වූ, ප්‍ර​ඥාවන්ත වූ, මනාකොට සමාධිගත වූ; වීර්යය වඩන ලද, (අරමුණ කෙරෙහි) සිත යොමු කළ පුද්ගලයා දුරු කිරීමට දුෂ්කර වූ ඕඝය තරණය කරයි.\n\nකාමසංඥාවන්ගෙන් (කාමයන් කෙරෙහි වන හඳුනාගැනීම්වලින්) වෙන් වූ, රූපසංයෝජනයෙන් (රූප කෙරෙහි ඇලීමෙන් වන බැම්මෙන්) එතෙර වූ; නන්දි රාගය (කැමැත්ත සහ ඇලීම) ක්ෂය කළ ඒ පුද්ගලයා ගැඹුරු (සංසාර සාගරයේ) නොගිලෙන්නේය.\"",
      "paliTitle": "Candanasuttaṃ",
      "englishTitle": "The Discourse to Candana",
      "sinhalaTitle": "චන්දන සූත්‍රය"
    },
    {
      "number": 97,
      "pali": "Ekamantaṃ ṭhito kho vāsudatto devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Sattiyā viya omaṭṭho, ḍayhamānova [ḍayhamāneva (sabbattha)] matthake; Kāmarāgappahānāya, sato bhikkhu paribbaje’’ti. ‘‘Sattiyā viya omaṭṭho, ḍayhamānova matthake; Sakkāyadiṭṭhippahānāya, sato bhikkhu paribbaje’’ti.",
      "english": "Standing to one side, the deva-son Vāsudatta spoke this verse in the presence of the Blessed One:\n“As if pierced by a spear, or as if one’s head were ablaze, a mindful monk should lead the holy life for the abandoning of sensual passion.”\n“As if pierced by a spear, or as if one’s head were ablaze, a mindful monk should lead the holy life for the abandoning of identity view.”",
      "sinhala": "එක් පසෙක සිටගෙන සිටි වාසුදත්ත නම් දෙවිපුත් භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය.\n\"හෙල්ලකින් අනින ලද කෙනෙකු මෙන් ද, හිස ගිනිගෙන දැවෙන්නකු මෙන් ද, සිහියෙන් යුක්ත වූ භික්ෂුව කාමරාගය දුරු කිරීම සඳහා හැසිරිය යුතු යි.\"\n\"හෙල්ලකින් අනින ලද කෙනෙකු මෙන් ද, හිස ගිනිගෙන දැවෙන්නකු මෙන් ද, සිහියෙන් යුක්ත වූ භික්ෂුව සක්කායදිට්ඨිය දුරු කිරීම සඳහා හැසිරිය යුතු යි.\"",
      "paliTitle": "Vāsudattasuttaṃ",
      "englishTitle": "The Discourse to Vāsudatta",
      "sinhalaTitle": "වාසුදත්ත සූත්‍රය"
    },
    {
      "number": 98,
      "pali": "Ekamantaṃ ṭhito kho subrahmā devaputto bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Niccaṃ utrastamidaṃ cittaṃ, niccaṃ ubbiggamidaṃ [ubbiggidaṃ (mahāsatipaṭṭhānasuttavaṇṇanāyaṃ)] mano; Anuppannesu kicchesu [kiccesu (bahūsu)], atho uppatitesu ca; Sace atthi anutrastaṃ, taṃ me akkhāhi pucchito’’ti. ‘‘Nāññatra bojjhā tapasā [bojjhaṅgatapasā (sī. syā. kaṃ. pī.)], nāññatrindriyasaṃvarā; Nāññatra sabbanissaggā, sotthiṃ passāmi pāṇina’’nti. ‘‘Idamavoca…pe… tatthevantaradhāyī’’ti.",
      "english": "Standing to one side, the deity Subrahmā addressed the Blessed One with a verse:\n\n\"This mind is constantly agitated, this mind is constantly disturbed; concerning tasks and difficulties that have not yet arisen, and concerning those that have already arisen. If there is anything that is unagitated, please explain it to me when I ask.\"\n\n\"Not apart from awakening and spiritual discipline, not apart from the restraint of the senses, not apart from the relinquishment of all, do I see safety for living beings.\"\n\nThe Blessed One spoke this. Then the deity Subrahmā, delighted and joyful over the Blessed One’s words, vanished right there.",
      "sinhala": "එක්පසෙක සිටගත් සුබ්‍රහ්ම නම් දෙව්පුත් භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීය:\n\n\"මේ සිත නිරතුරුවම තැතිගන්නේය. මේ මනස නිරතුරුවම වික්ෂිප්ත වන්නේය. නූපන් වූ (විපත්ති) කාරණා ගැනත්, එසේම උපන් (විපත්ති) කාරණා ගැනත් (එය එසේය). කිසියම් බිය නැති දෙයක් ඇත්නම්, මගෙන් විමසූ විට එය මට කියනු මැනව.\"\n\n\"(බුදුරජාණන් වහන්සේ මෙසේ වදාළ සේක:) බෝධියෙන් හෙවත් බෝධි අංගයන්ගේ වර්ධනයෙන් හා වීර්යයෙන් (තපසින්) තොරවද, ඉන්ද්‍රිය සංවරයෙන් තොරවද, සියල්ල අත්හැරීමෙන් තොරවද, සත්වයන්ට කිසිදු ආරක්ෂාවක් හෝ සැපතක් මම නොදකිමි.\"\n\nභාග්‍යවතුන් වහන්සේ මේ ගාථාව වදාළ සේක. සුබ්‍රහ්ම නම් දෙව්පුත් භාග්‍යවතුන් වහන්සේගේ වචනයට සතුටු වී, එය අනුමෝදන්ව, එතැනම අතුරුදහන් විය.",
      "paliTitle": "Subrahmasuttaṃ",
      "englishTitle": "The Discourse to Subrahma",
      "sinhalaTitle": "සුබ්‍රහ්ම සූත්‍රය"
    },
    {
      "number": 99,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sākete viharati añjanavane migadāye. Atha kho kakudho devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ añjanavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho kakudho devaputto bhagavantaṃ etadavoca – ‘‘nandasi, samaṇā’’ti? ‘‘Kiṃ laddhā, āvuso’’ti? ‘‘Tena hi, samaṇa, socasī’’ti? ‘‘Kiṃ jīyittha, āvuso’’ti? ‘‘Tena hi, samaṇa, neva nandasi na ca [neva (sī. syā. kaṃ.)] socasī’’ti? ‘‘Evamāvuso’’ti. ‘‘Kacci tvaṃ anagho [anigho (sabbattha)] bhikkhu, kacci nandī [nandi (sī. syā. kaṃ.)] na vijjati; Kacci taṃ ekamāsīnaṃ, aratī nābhikīratī’’ti. ‘‘Anagho ve ahaṃ yakkha, atho nandī na vijjati; Atho maṃ ekamāsīnaṃ, aratī nābhikīratī’’ti. ‘‘Kathaṃ tvaṃ anagho bhikkhu, kathaṃ nandī na vijjati; Kathaṃ taṃ ekamāsīnaṃ, aratī nābhikīratī’’ti. ‘‘Aghajātassa ve nandī, nandījātassa ve aghaṃ; Anandī anagho bhikkhu, evaṃ jānāhi āvuso’’ti. ‘‘Cirassaṃ vata passāmi, brāhmaṇaṃ parinibbutaṃ; Anandiṃ anaghaṃ bhikkhuṃ, tiṇṇaṃ loke visattika’’ntntti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Saketa, in the Añjana Wood, at the Deer Park.\n\nThen, when the night was far advanced, the deva Kakudha, of surpassing beauty, having illuminated the entire Añjana Wood, approached where the Blessed One was; having approached, he paid homage to the Blessed One and stood to one side.\n\nStanding to one side, the deva Kakudha said this to the Blessed One: \"Do you delight, recluse?\"\n\n\"Having gained what, friend?\"\n\n\"Then, recluse, do you sorrow?\"\n\n\"Having lost what, friend?\"\n\n\"Then, recluse, you neither delight nor sorrow?\"\n\n\"Indeed, friend.\"\n\n\"Are you free from affliction, bhikkhu? Is there no delight for you? As you sit alone, does discontent not overwhelm you?\"\n\n\"Indeed, I am free from affliction, yakkha. And there is no delight for me. And as I sit alone, discontent does not overwhelm me.\"\n\n\"How are you free from affliction, bhikkhu? How is there no delight for you? How, as you sit alone, does discontent not overwhelm you?\"\n\n\"Indeed, for one afflicted, there arises delight; for one given to delight, there arises affliction. A bhikkhu free from delight is free from affliction. Know this, friend.\"\n\n\"Indeed, after a long time, I see a Brahmin who is fully extinguished, a bhikkhu free from delight, free from affliction, one who has crossed over the world's entanglements.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ සාකේත නුවර අංජන වනයේ පිහිටි මිගදායෙහි වාසය කළ සේක. ඉක්බිති කකුධ නම් දෙව්පුත්, රාත්‍රිය අතිශයින්ම ගෙවී ගිය කල්හි, අතිශයින්ම බබළන වර්ණයෙන් යුක්තව, මුළු අංජන වනයම ආලෝකමත් කරවමින්, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පසෙක සිටියේය. එකත්පසෙක සිටි කකුධ නම් දෙව්පුත් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ශ්‍රමණය, ඔබ සතුටු වෙනවාද?\" \"ආයුෂ්මත්මය, කුමක් ලබාගෙනද?\" \"එසේ නම්, ශ්‍රමණය, ඔබ ශෝක කරනවාද?\" \"ආයුෂ්මත්මය, කුමක් නැති වීද?\" \"එසේ නම්, ශ්‍රමණය, ඔබ සතුටු වන්නේත් නැද්ද, ශෝක කරන්නේත් නැද්ද?\" \"එසේය, ආයුෂ්මත්මය.\" \"භික්ෂුව, ඔබ කිසිදු ක්ලේශ දුකකින් තොරද? ඔබට කිසිදු ඇලීමක් නැද්ද? තනිව වැඩසිටින ඔබව අරතිය විසින් පීඩා කරනු නොලබන්නේද?\" \"දෙව්පුත්, ඇත්තෙන්ම මම ක්ලේශ දුකකින් තොරයෙමි. තවද මට කිසිදු ඇලීමක් නැත. තවද තනිව වැඩසිටින මා අරතිය විසින් පීඩා කරනු නොලබයි.\" \"භික්ෂුව, ඔබ කෙසේ නම් ක්ලේශ දුකකින් තොර වූයේද? ඔබට කෙසේ නම් ඇලීමක් නැත්තේ වේද? තනිව වැඩසිටින ඔබව අරතිය විසින් පීඩා කරනු නොලබන්නේ කෙසේද?\" \"ඇත්තෙන්ම, ක්ලේශ දුක් ඇති පුද්ගලයාට ඇලීම හටගනී. ඇලීම ඇති පුද්ගලයාට ක්ලේශ දුක් හටගනී. ඇලීමෙන් තොර වූ භික්ෂුව, ක්ලේශ දුකකින්ද තොර වේ. ආයුෂ්මත්මය, මෙසේ දැනගන්න.\" \"මා විසින් බොහෝ කලකට පසුව, පිරිනිවී ගිය, ලෝකයෙහි සියලු බැඳීම් ජයගත්, ඇලීම් රහිත වූ, ක්ලේශ දුක් රහිත වූ භික්ෂුවක් වූ බ්‍රාහ්මණයෙකු දක්නා ලදී.\"",
      "paliTitle": "Kakudhasuttaṃ",
      "englishTitle": "Kakudha Sutta",
      "sinhalaTitle": "කකුධ සූත්‍රය"
    },
    {
      "number": 100,
      "pali": "Rājagahanidānaṃ. Ekamantaṃ ṭhito kho uttaro devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Upanīyati jīvitamappamāyu, Jarūpanītassa na santi tāṇā; Etaṃ bhayaṃ maraṇe pekkhamāno, Puññāni kayirātha sukhāvahānī’’ti. ‘‘Upanīyati jīvitamappamāyu, Jarūpanītassa na santi tāṇā; Etaṃ bhayaṃ maraṇe pekkhamāno, Lokāmisaṃ pajahe santipekkho’’ti.",
      "english": "Standing to one side, the deva-son Uttara spoke this verse in the presence of the Blessed One:\n\"Life, of short duration, is constantly being led to its close. For one overcome by old age, there are no protectors. Perceiving this danger in death, one should perform wholesome deeds that bring happiness.\"\n\n\"Life, of short duration, is constantly being led to its close. For one overcome by old age, there are no protectors. Perceiving this danger in death, one should abandon worldly allurements, seeking ultimate peace.\"",
      "sinhala": "රාජගහ නුවර අරබයා. එකත්පසෙක සිටගෙන උත්තර නම් දෙවියන් භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය: ‘‘ආයුෂ කෙටිය. ජීවිතය මරණය කරා ගෙන යනු ලැබේ. ජරාව විසින් මරණය කරා ගෙන යනු ලැබූවෙකුට පිහිටක් නැත. මරණයෙහි ඇති මේ භය දකිමින්, සැප ගෙන දෙන්නා වූ පින් කළ යුතුය.’’\n\n‘‘ආයුෂ කෙටිය. ජීවිතය මරණය කරා ගෙන යනු ලැබේ. ජරාව විසින් මරණය කරා ගෙන යනු ලැබූවෙකුට පිහිටක් නැත. මරණයෙහි ඇති මේ භය දකිමින්, ශාන්තිය ප්‍රාර්ථනා කරන්නා වූ තැනැත්තා ලෝකාමිසය අත්හැරිය යුතුය.’’",
      "paliTitle": "Uttarasuttaṃ",
      "englishTitle": "The Discourse to Uttara",
      "sinhalaTitle": "උත්තර සූත්‍රය"
    },
    {
      "number": 101,
      "pali": "Ekamantaṃ ṭhito kho anāthapiṇḍiko devaputto bhagavato santike imā gāthāyo abhāsi – ‘‘Idañhi taṃ jetavanaṃ, isisaṅghanisevitaṃ; Āvutthaṃ dhammarājena, pītisañjananaṃ mama. ‘‘Kammaṃ vijjā ca dhammo ca, sīlaṃ jīvitamuttamaṃ; Etena maccā sujjhanti, na gottena dhanena vā. ‘‘Tasmā hi paṇḍito poso, sampassaṃ atthamattano; Yoniso vicine dhammaṃ, evaṃ tattha visujjhati. ‘‘Sāriputtova paññāya, sīlena upasamena ca; Yopi pāraṅgato bhikkhu, etāvaparamo siyā’’ti. Idamavoca anāthapiṇḍiko devaputto. Idaṃ vatvā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyīti. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ aññataro devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho, bhikkhave, so devaputto mama santike imā gāthāyo abhāsi – ‘‘Idañhi taṃ jetavanaṃ, isisaṅghanisevitaṃ; Āvutthaṃ dhammarājena, pītisañjananaṃ mama. ‘‘Kammaṃ vijjā ca dhammo ca, sīlaṃ jīvitamuttamaṃ; Etena maccā sujjhanti, na gottena dhanena vā. ‘‘Tasmā hi paṇḍito poso, sampassaṃ atthamattano; Yoniso vicine dhammaṃ, evaṃ tattha visujjhati. ‘‘Sāriputtova paññāya, sīlena upasamena ca; Yopi pāraṅgato bhikkhu, etāvaparamo siyā’’ti. ‘‘Idamavoca, bhikkhave, so devaputto. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. Evaṃ vutte, āyasmā ānando bhagavantaṃ etadavoca – ‘‘so hi nūna, bhante, anāthapiṇḍiko devaputto bhavissati. Anāthapiṇḍiko gahapati āyasmante sāriputte abhippasanno ahosī’’ti. ‘‘Sādhu sādhu, ānanda, yāvatakaṃ kho, ānanda, takkāya pattabbaṃ anuppattaṃ taṃ tayā. Anāthapiṇḍiko hi so, ānanda, devaputto’’ti. Anāthapiṇḍikavaggo dutiyo. Tassuddānaṃ – Candimaso [candimāso (pī. ka.)] ca veṇḍu [veṇhu (sī. ka.)] ca, dīghalaṭṭhi ca nandano; Candano vāsudatto ca, subrahmā kakudhena ca; Uttaro navamo vutto, dasamo anāthapiṇḍikoti.",
      "english": "Standing to one side, the devaputta Anāthapiṇḍika recited these verses in the presence of the Blessed One:\n\n\"This indeed is Jetavana, frequented by assemblies of sages, inhabited by the King of Dhamma, generating joy in me.\nWholesome action, liberating wisdom, and the Dhamma, moral virtue, and the supreme way of life—by these mortals are purified, not by lineage or by wealth.\nTherefore, a wise person, seeing their own true benefit, should meticulously investigate the Dhamma with wise attention, for in this way they become truly purified.\nEven a monk who has reached the far shore, in terms of wisdom, virtue, and inner peace, would have this as their ultimate attainment, just like Sāriputta.\"\n\nThe devaputta Anāthapiṇḍika spoke these words. Having spoken them, he paid homage to the Blessed One, circumambulated him respectfully, and then vanished right there.\n\nThen, when that night had passed, the Blessed One addressed the bhikkhus: \"Bhikkhus, during this past night, a certain devaputta, with resplendent beauty, illuminating the entire Jetavana as the night was far advanced, approached me. Having approached, he paid homage to me and stood to one side. Bhikkhus, standing to one side, that devaputta recited these verses in my presence:\n\n'This indeed is Jetavana, frequented by assemblies of sages, inhabited by the King of Dhamma, generating joy in me.\nWholesome action, liberating wisdom, and the Dhamma, moral virtue, and the supreme way of life—by these mortals are purified, not by lineage or by wealth.\nTherefore, a wise person, seeing their own true benefit, should meticulously investigate the Dhamma with wise attention, for in this way they become truly purified.\nEven a monk who has reached the far shore, in terms of wisdom, virtue, and inner peace, would have this as their ultimate attainment, just like Sāriputta.'\n\nBhikkhus, that devaputta spoke these words. Having spoken them, he paid homage to me, circumambulated me respectfully, and then vanished right there.\"\n\nWhen this was said, the Venerable Ānanda said to the Blessed One: \"Indeed, Venerable Sir, that must have been the devaputta Anāthapiṇḍika. The householder Anāthapiṇḍika had immense faith in the Venerable Sāriputta.\" \"Excellent, excellent, Ānanda! What could be reached by reasoning, you have indeed reached. That was indeed the devaputta Anāthapiṇḍika, Ānanda.\"",
      "sinhala": "එක්පසෙක සිටගත් අනාථපිණ්ඩික දෙව්පුත් භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථා පැවසුවේය –\n\"මෙය එසේම ජේතවනය යි, ඍෂිසංඝයා (රහතුන්) විසින් සේවනය කරන ලද්දකි; ධර්‍මරාජයා (බුදුරජාණන් වහන්සේ) විසින් වැඩසිටින ලද්දකි, මට ප්‍රීතිය උපදවන්නකි.\nකර්‍මය ද, විද්‍යාව ද, ධර්‍මය ද, සීලය ද උතුම් ජීවිතයයි. මේවායින් මනුෂ්‍යයෝ පිරිසිදු වෙති, ගෝත්‍රයෙන් හෝ ධනයෙන් නොවේ.\nඑබැවින් පණ්ඩිත පුරුෂයා තමාගේ (පරම) අර්ථය මැනවින් දකිමින්, යෝනිසෝමනසිකාරයෙන් ධර්‍මය විමසිය යුතු ය; මෙසේ එතැන දී පිරිසිදු වේ.\nප්‍රඥාවෙන් ද, ශීලයෙන් ද, උපශමයෙන් ද සාරිපුත්තයන් වහන්සේ වැනි වූ, පරතෙරට පත්වූ යම් භික්ෂුවක් වේද, ඔහුට ද මේ ගුණධර්‍මම උපරිම අගය වේවා.\"\n\nඅනාථපිණ්ඩික දෙව්පුත් මේ කාරණය පැවසීය. මෙය පවසා, භාග්‍යවතුන් වහන්සේට වන්දනා කර, පැදකුණු කර, එතැනම අතුරුදහන් විය.\n\nඑවිට භාග්‍යවතුන් වහන්සේ ඒ රාත්‍රිය අවසන් වීමෙන් පසු භික්ෂූන් අමතා වදාළ සේක – \"මහණෙනි, මේ රාත්‍රියේ ඉතා අලංකාර වූ වර්‍ණයක් ඇති එක්තරා දෙව්පුතෙක් මුළු ජේතවනයම බබළවමින් මා වෙත පැමිණියේය; පැමිණ මට වන්දනා කර එක්පසෙක සිටගත්තේය. මහණෙනි, එක්පසෙක සිටගත් ඒ දෙව්පුත් මා ඉදිරියේ මේ ගාථා පැවසුවේය –\n\"මෙය එසේම ජේතවනය යි, ඍෂිසංඝයා විසින් සේවනය කරන ලද්දකි; ධර්‍මරාජයා විසින් වැඩසිටින ලද්දකි, මට ප්‍රීතිය උපදවන්නකි.\nකර්‍මය ද, විද්‍යාව ද, ධර්‍මය ද, සීලය ද උතුම් ජීවිතයයි. මේවායින් මනුෂ්‍යයෝ පිරිසිදු වෙති, ගෝත්‍රයෙන් හෝ ධනයෙන් නොවේ.\nඑබැවින් පණ්ඩිත පුරුෂයා තමාගේ අර්ථය මැනවින් දකිමින්, යෝනිසෝමනසිකාරයෙන් ධර්‍මය විමසිය යුතු ය; මෙසේ එතැන දී පිරිසිදු වේ.\nප්‍රඥාවෙන් ද, ශීලයෙන් ද, උපශමයෙන් ද සාරිපුත්තයන් වහන්සේ වැනි වූ, පරතෙරට පත්වූ යම් භික්ෂුවක් වේද, ඔහුට ද මේ ගුණධර්‍මම උපරිම අගය වේවා.\"\nමහණෙනි, ඒ දෙව්පුත් මේ කාරණය පැවසීය. මෙය පවසා, මට වන්දනා කර, පැදකුණු කර, එතැනම අතුරුදහන් විය\" යි.\n\nමෙසේ වදාළ විට, ආයුෂ්මත් ආනන්ද භාග්‍යවතුන් වහන්සේට මෙය පැවසීය – \"භාග්‍යවතුන් වහන්ස, ඒ නම් අනාථපිණ්ඩික දෙව්පුත් ම විය යුතුය. අනාථපිණ්ඩික ගෘහපතියා ආයුෂ්මත් සාරිපුත්තයන් වහන්සේ කෙරෙහි ඉතා ප්‍රසන්නව සිටියේය\" යි.\n\n\"සාදු සාදු, ආනන්දය, ආනන්දය, තර්‍කයෙන් ළඟා විය යුතු තරම ඔබ විසින් ළඟා වී ඇත. ආනන්දය, ඒ නම් අනාථපිණ්ඩික දෙව්පුත් ම යි\" යි.\n\nඅනාථපිණ්ඩික වග්ගය දෙවැනි යි.\n\nඑහි උද්දානය –\nචන්දිමාස ද, වේණ්ඩු ද, දීඝලට්ඨි ද, නන්දන ද;\nචන්දන ද, වාසුදත්ත ද, සුබ්‍රහ්ම ද, කකුධ ද;\nනවවැනි උත්තර දසවැනි අනාථපිණ්ඩික ද කියන ලදී.",
      "paliTitle": "Anāthapiṇḍikasuttaṃ",
      "englishTitle": "Anāthapiṇḍika Sutta",
      "sinhalaTitle": "අනාථපිණ්ඩික සූත්‍රය"
    },
    {
      "number": 102,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho sivo devaputto abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho sivo devaputto bhagavato santike imā gāthāyo abhāsi – ‘‘Sabbhireva samāsetha, sabbhi kubbetha santhavaṃ; Sataṃ saddhammamaññāya, seyyo hoti na pāpiyo. ‘‘Sabbhireva samāsetha, sabbhi kubbetha santhavaṃ; Sataṃ saddhammamaññāya, paññā labbhati nāññato. ‘‘Sabbhireva samāsetha, sabbhi kubbetha santhavaṃ; Sataṃ saddhammamaññāya, sokamajjhe na socati. ‘‘Sabbhireva samāsetha, sabbhi kubbetha santhavaṃ; Sataṃ saddhammamaññāya, ñātimajjhe virocati. ‘‘Sabbhireva samāsetha, sabbhi kubbetha santhavaṃ; Sataṃ saddhammamaññāya, sattā gacchanti suggatiṃ. ‘‘Sabbhireva samāsetha, sabbhi kubbetha santhavaṃ; Sataṃ saddhammamaññāya, sattā tiṭṭhanti sātata’’nti. Atha kho bhagavā sivaṃ devaputtaṃ gāthāya paccabhāsi – ‘‘Sabbhireva samāsetha, sabbhi kubbetha santhavaṃ; Sataṃ saddhammamaññāya, sabbadukkhā pamuccatī’’ti.",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling in Sāvatthī, at Jetavana, Anāthapiṇḍika’s park. Then, when the night was far advanced, the deity Sivo, having illuminated the entire Jetavana with his surpassing radiance, approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, the deity Sivo recited these verses in the presence of the Blessed One:\n\nOne should associate only with the good, and form friendships with the good. By understanding the True Dhamma taught by the virtuous, one becomes better, not worse.\n\nOne should associate only with the good, and form friendships with the good. By understanding the True Dhamma taught by the virtuous, wisdom is obtained, not from any other source.\n\nOne should associate only with the good, and form friendships with the good. By understanding the True Dhamma taught by the virtuous, one does not grieve amidst sorrow.\n\nOne should associate only with the good, and form friendships with the good. By understanding the True Dhamma taught by the virtuous, one shines forth among one's relatives.\n\nOne should associate only with the good, and form friendships with the good. By understanding the True Dhamma taught by the virtuous, beings go to a fortunate destination.\n\nOne should associate only with the good, and form friendships with the good. By understanding the True Dhamma taught by the virtuous, beings remain steadfast.\n\nThen the Blessed One responded to the deity Sivo with this verse:\n\nOne should associate only with the good, and form friendships with the good. By understanding the True Dhamma taught by the virtuous, one is released from all suffering.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඉක්බිති සිව නම් දෙව්පුත් අලුයම් වේලෙහි, අතිශයින් දීප්තිමත් රූපශ්‍රීයකින් යුක්තව, මුළු ජේතවනාරාමයම ආලෝකවත් කරමින්, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එක් පසෙක සිටියේය.\n\nඑක් පසෙක සිටි සිව දෙව්පුත් භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථා පැවසීය:\n“සත්පුරුෂයන් සමඟම ඇසුරු කළ යුතුය. සත්පුරුෂයන් සමඟම මිත්‍රත්වය ඇති කරගත යුතුය. සත්පුරුෂයන්ගේ සද්ධර්මය අවබෝධ කර ගැනීමෙන් උසස් බවට පත්වෙයි, පහත් බවට පත්වන්නේ නැත.\n\nසත්පුරුෂයන් සමඟම ඇසුරු කළ යුතුය. සත්පුරුෂයන් සමඟම මිත්‍රත්වය ඇති කරගත යුතුය. සත්පුරුෂයන්ගේ සද්ධර්මය අවබෝධ කර ගැනීමෙන් ප්‍රඥාව ලැබෙයි, අන් අයගෙන් නොලැබෙයි.\n\nසත්පුරුෂයන් සමඟම ඇසුරු කළ යුතුය. සත්පුරුෂයන් සමඟම මිත්‍රත්වය ඇති කරගත යුතුය. සත්පුරුෂයන්ගේ සද්ධර්මය අවබෝධ කර ගැනීමෙන් ශෝකය මැදදී ශෝක නොකරයි.\n\nසත්පුරුෂයන් සමඟම ඇසුරු කළ යුතුය. සත්පුරුෂයන් සමඟම මිත්‍රත්වය ඇති කරගත යුතුය. සත්පුරුෂයන්ගේ සද්ධර්මය අවබෝධ කර ගැනීමෙන් ඥාතීන් අතර බැබලෙයි.\n\nසත්පුරුෂයන් සමඟම ඇසුරු කළ යුතුය. සත්පුරුෂයන් සමඟම මිත්‍රත්වය ඇති කරගත යුතුය. සත්පුරුෂයන්ගේ සද්ධර්මය අවබෝධ කර ගැනීමෙන් සත්වයෝ සුගතියට යෙති.\n\nසත්පුරුෂයන් සමඟම ඇසුරු කළ යුතුය. සත්පුරුෂයන් සමඟම මිත්‍රත්වය ඇති කරගත යුතුය. සත්පුරුෂයන්ගේ සද්ධර්මය අවබෝධ කර ගැනීමෙන් සත්වයෝ සැමවිටම යහපත්ව සිටිති.”\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ සිව දෙව්පුතුට මේ ගාථාවෙන් පිළිතුරු දුන් සේක:\n“සත්පුරුෂයන් සමඟම ඇසුරු කළ යුතුය. සත්පුරුෂයන් සමඟම මිත්‍රත්වය ඇති කරගත යුතුය. සත්පුරුෂයන්ගේ සද්ධර්මය අවබෝධ කර ගැනීමෙන් සියලු දුකින් මිදෙයි.”",
      "paliTitle": "Sivasuttaṃ",
      "vagga": "Nānātitthiyavaggo",
      "englishTitle": "The Discourse to Siva",
      "sinhalaTitle": "සිව සූත්‍රය",
      "vaggaEnglish": "Chapter on Various Sectarians",
      "vaggaSinhala": "නානාතිත්ථිය වර්ගය"
    },
    {
      "number": 103,
      "pali": "Ekamantaṃ ṭhito kho khemo devaputto bhagavato santike imā gāthāyo abhāsi – ‘‘Caranti bālā dummedhā, amitteneva attanā; Karontā pāpakaṃ kammaṃ, yaṃ hoti kaṭukapphalaṃ. ‘‘Na taṃ kammaṃ kataṃ sādhu, yaṃ katvā anutappati; Yassa assumukho rodaṃ, vipākaṃ paṭisevati. ‘‘Tañca kammaṃ kataṃ sādhu, yaṃ katvā nānutappati; Yassa patīto sumano, vipākaṃ paṭisevati. ‘‘Paṭikacceva [paṭigacceva (sī.)] taṃ kayirā, yaṃ jaññā hitamattano; Na sākaṭikacintāya, mantā dhīro parakkame. ‘‘Yathā sākaṭiko maṭṭhaṃ [panthaṃ (sī.), pasatthaṃ (syā. kaṃ.)], samaṃ hitvā mahāpathaṃ; Visamaṃ maggamāruyha, akkhacchinnova jhāyati. ‘‘Evaṃ dhammā apakkamma, adhammamanuvattiya; Mando maccumukhaṃ patto, akkhacchinnova jhāyatī’’ti.",
      "english": "Khemā the devaputta, standing to one side, recited these verses in the presence of the Blessed One:\n\nFools, those of dull wisdom, wander about as if their own enemies, performing evil deeds that yield bitter results.\n\nThat deed is not well done, having done which one repents; for which one consumes the result with a tearful face, weeping.\n\nBut that deed is well done, having done which one does not repent; for which one consumes the result joyful and delighted.\n\nOne should do that right away which one knows to be beneficial for oneself; a wise person should not strive with the thoughts of a carter.\n\nJust as a carter, having abandoned the smooth, level highway, and having taken to an uneven road, grieves as his axle breaks.\n\nIn the same way, having strayed from the Dhamma and followed what is not Dhamma, a fool, having reached the jaws of death, grieves as if his axle has broken.",
      "sinhala": "එක් පසෙක සිටි ඛේම නම් දෙවියන් භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාවන් කීවේය.\n\nබාල වූ, දුර්මති වූ පුද්ගලයෝ තමන්ටම සතුරෙකු මෙන් හැසිරෙති. ඔවුහු කටුක විපාක ඇති පාපකර්ම කරති.\n\nයමක් කර අනුතැවෙන්නේද, කඳුළු පිරි මුහුණින් හඬමින් විපාක විඳින්නේ ද, ඒ කර්මය යහපත් ලෙස නොකළේය.\n\nයමක් කර පසුතැවෙන්නේ නැත්ද, ප්‍රීතියෙන් හා සතුටු සිතින් විපාක විඳින්නේ ද, ඒ කර්මය නම් මැනවින් කරන ලද්දකි.\n\nතමන්ට හිතකර යමක් වේදැයි දැන එය කලින්ම කළ යුතුය. නුවණැත්තා කරත්තකාරයෙකු මෙන් සිතමින් පසුබට නොවී, ප්‍රඥාවෙන් යුතුව උත්සාහ කළ යුතුය.\n\nයම් සේ කරත්තකාරයෙකු සම වූ මහා මාර්ගය අත්හැර, දුර්ග මාර්ගයකට නැඟී, අක්‍ෂය බිඳී ගියාක් මෙන් දුක්වන්නේද,\n\nඑසේම මන්ද බුද්ධිකයා ධර්මයෙන් බැහැර වී, අධර්මයෙහි හැසිරී, මරණ මුවට පත්ව, අක්‍ෂය බිඳී ගියාක් මෙන් දුක්වෙයි.",
      "paliTitle": "Khemasuttaṃ",
      "englishTitle": "To Khema Sutta",
      "sinhalaTitle": "ඛේම සූත්‍රය"
    },
    {
      "number": 104,
      "pali": "Ekamantaṃ ṭhito kho serī devaputto bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Annamevābhinandanti, ubhaye devamānusā; Atha ko nāma so yakkho, yaṃ annaṃ nābhinandatī’’ti. ‘‘Ye naṃ dadanti saddhāya, vippasannena cetasā; Tameva annaṃ bhajati, asmiṃ loke paramhi ca. ‘‘Tasmā vineyya maccheraṃ, dajjā dānaṃ malābhibhū; Puññāni paralokasmiṃ, patiṭṭhā honti pāṇina’’nti. ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāvasubhāsitamidaṃ, bhante, bhagavatā – ‘‘Ye naṃ dadanti saddhāya, vippasannena cetasā; Tameva annaṃ bhajati, asmiṃ loke paramhi ca. ‘‘Tasmā vineyya maccheraṃ, dajjā dānaṃ malābhibhū; Puññāni paralokasmiṃ, patiṭṭhā honti pāṇina’’nti. ‘‘Bhūtapubbāhaṃ, bhante, sirī [serī (sī. syā. kaṃ. pī.)] nāma rājā ahosiṃ dāyako dānapati dānassa vaṇṇavādī. Tassa mayhaṃ, bhante, catūsu dvāresu dānaṃ dīyittha samaṇa-brāhmaṇa-kapaṇaddhika- vanibbakayācakānaṃ. Atha kho maṃ, bhante, itthāgāraṃ upasaṅkamitvā etadavoca [itthāgārā upasaṅkamitvā etadavocuṃ (ka.)] – ‘devassa kho [devasseva kho (ka. sī.)] dānaṃ dīyati; amhākaṃ dānaṃ na dīyati. Sādhu mayampi devaṃ nissāya dānāni dadeyyāma, puññāni kareyyāmā’ti. Tassa mayhaṃ, bhante, etadahosi – ‘ahaṃ khosmi dāyako dānapati dānassa vaṇṇavādī. Dānaṃ dassāmāti vadante kinti vadeyya’nti? So khvāhaṃ, bhante, paṭhamaṃ dvāraṃ itthāgārassa adāsiṃ. Tattha itthāgārassa dānaṃ dīyittha; mama dānaṃ paṭikkami. ‘‘Atha kho maṃ, bhante, khattiyā anuyantā upasaṅkamitvā etadavocuṃ – ‘devassa kho dānaṃ dīyati; itthāgārassa dānaṃ dīyati; amhākaṃ dānaṃ na dīyati. Sādhu mayampi devaṃ nissāya dānāni dadeyyāma, puññāni kareyyāmā’ti. Tassa mayhaṃ, bhante, etadahosi – ‘ahaṃ khosmi dāyako dānapati dānassa vaṇṇavādī. Dānaṃ dassāmāti vadante kinti vadeyya’nti? So khvāhaṃ, bhante, dutiyaṃ dvāraṃ khattiyānaṃ anuyantānaṃ adāsiṃ. Tattha khattiyānaṃ anuyantānaṃ dānaṃ dīyittha, mama dānaṃ paṭikkami. ‘‘Atha kho maṃ, bhante, balakāyo upasaṅkamitvā etadavoca – ‘devassa kho dānaṃ dīyati; itthāgārassa dānaṃ dīyati; khattiyānaṃ anuyantānaṃ dānaṃ dīyati; amhākaṃ dānaṃ na dīyati. Sādhu mayampi devaṃ nissāya dānāni dadeyyāma, puññāni kareyyāmā’ti. Tassa mayhaṃ, bhante, etadahosi – ‘ahaṃ khosmi dāyako dānapati dānassa vaṇṇavādī. Dānaṃ dassāmāti vadante kinti vadeyya’nti? So khvāhaṃ bhante, tatiyaṃ dvāraṃ balakāyassa adāsiṃ. Tattha balakāyassa dānaṃ dīyittha, mama dānaṃ paṭikkami. ‘‘Atha kho maṃ, bhante, brāhmaṇagahapatikā upasaṅkamitvā etadavocuṃ – ‘devassa kho dānaṃ dīyati; itthāgārassa dānaṃ dīyati; khattiyānaṃ anuyantānaṃ dānaṃ dīyati; balakāyassa dānaṃ dīyati; amhākaṃ dānaṃ na dīyati. Sādhu mayampi devaṃ nissāya dānāni dadeyyāma, puññāni kareyyāmā’ti. Tassa mayhaṃ, bhante, etadahosi – ‘ahaṃ khosmi dāyako dānapati dānassa vaṇṇavādī. Dānaṃ dassāmāti vadante kinti vadeyya’nti? So khvāhaṃ, bhante, catutthaṃ dvāraṃ brāhmaṇagahapatikānaṃ adāsiṃ. Tattha brāhmaṇagahapatikānaṃ dānaṃ dīyittha, mama dānaṃ paṭikkami. ‘‘Atha kho maṃ, bhante, purisā upasaṅkamitvā etadavocuṃ – ‘na kho dāni devassa koci dānaṃ dīyatī’ti. Evaṃ vuttāhaṃ, bhante, te purise etadavocaṃ – ‘tena hi, bhaṇe, yo bāhiresu janapadesu āyo sañjāyati tato upaḍḍhaṃ antepure pavesetha, upaḍḍhaṃ tattheva dānaṃ detha samaṇa-brāhmaṇa- kapaṇaddhika-vanibbaka-yācakāna’nti. So khvāhaṃ, bhante, evaṃ dīgharattaṃ katānaṃ puññānaṃ evaṃ dīgharattaṃ katānaṃ kusalānaṃ dhammānaṃ pariyantaṃ nādhigacchāmi – ettakaṃ puññanti vā ettako puññavipākoti vā ettakaṃ sagge ṭhātabbanti vāti. Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāvasubhāsitamidaṃ, bhante, bhagavatā – ‘‘Ye naṃ dadanti saddhāya, vippasannena cetasā; Tameva annaṃ bhajati, asmiṃ loke paramhi ca. ‘‘Tasmā vineyya maccheraṃ, dajjā dānaṃ malābhibhū; Puññāni paralokasmiṃ, patiṭṭhā honti pāṇina’’nti.",
      "english": "Standing to one side, the deva-son Serī addressed the Blessed One with a verse: \"Both devas and humans truly delight in food. Then who is that being who does not delight in food?\"\n\n\"Those who give it with faith and with a mind perfectly clear, that very food benefits them in this world and in the next. Therefore, having overcome stinginess, one should give a gift, having conquered the defilements; for merits are the foundation for beings in the next world.\"\n\n\"It is wonderful, Venerable Sir, it is amazing, Venerable Sir! How well-spoken this is, Venerable Sir, by the Blessed One: 'Those who give it with faith and with a mind perfectly clear, that very food benefits them in this world and in the next. Therefore, having overcome stinginess, one should give a gift, having conquered the defilements; for merits are the foundation for beings in the next world.'\"\n\n\"Formerly, Venerable Sir, I was a king named Serī, a generous giver, a lord of giving, one who praised giving. To me, Venerable Sir, gifts were given at four gates to ascetics, brahmins, the poor, the destitute, and beggars. Then, Venerable Sir, the women of the royal household approached me and said this: 'Gifts are indeed given by Your Majesty; our gifts are not given. It would be good if we too, relying on Your Majesty, could give gifts and make merit.' Then, Venerable Sir, it occurred to me: 'I am a generous giver, a lord of giving, one who praises giving. What should I say to those who say they want to give gifts?' So, Venerable Sir, I gave the first gate to the women of the royal household. There, gifts were given by the women of the royal household; my giving ceased.\"\n\n\"Then, Venerable Sir, the nobles who were my retainers approached me and said this: 'Gifts are indeed given by Your Majesty; gifts are given by the women of the royal household; our gifts are not given. It would be good if we too, relying on Your Majesty, could give gifts and make merit.' Then, Venerable Sir, it occurred to me: 'I am a generous giver, a lord of giving, one who praises giving. What should I say to those who say they want to give gifts?' So, Venerable Sir, I gave the second gate to the nobles who were my retainers. There, gifts were given by the nobles who were my retainers; my giving ceased.\"\n\n\"Then, Venerable Sir, the army approached me and said this: 'Gifts are indeed given by Your Majesty; gifts are given by the women of the royal household; gifts are given by the nobles who were your retainers; our gifts are not given. It would be good if we too, relying on Your Majesty, could give gifts and make merit.' Then, Venerable Sir, it occurred to me: 'I am a generous giver, a lord of giving, one who praises giving. What should I say to those who say they want to give gifts?' So, Venerable Sir, I gave the third gate to the army. There, gifts were given by the army; my giving ceased.\"\n\n\"Then, Venerable Sir, the brahmins and householders approached me and said this: 'Gifts are indeed given by Your Majesty; gifts are given by the women of the royal household; gifts are given by the nobles who were your retainers; gifts are given by the army; our gifts are not given. It would be good if we too, relying on Your Majesty, could give gifts and make merit.' Then, Venerable Sir, it occurred to me: 'I am a generous giver, a lord of giving, one who praises giving. What should I say to those who say they want to give gifts?' So, Venerable Sir, I gave the fourth gate to the brahmins and householders. There, gifts were given by the brahmins and householders; my giving ceased.\"\n\n\"Then, Venerable Sir, my men approached me and said this: 'Now, no one is giving gifts on behalf of Your Majesty.' When this was said, Venerable Sir, I told those men: 'Well then, my friends, whatever income arises in the outlying regions, bring half of it into the royal palace, and give half of it right there as gifts to ascetics, brahmins, the poor, the destitute, and beggars.' So, Venerable Sir, I do not find an end to the merits accumulated over such a long time, to the wholesome actions performed over such a long time – either saying, 'This is the amount of merit,' or 'This is the result of merit,' or 'This is how long one will reside in heaven.' It is wonderful, Venerable Sir, it is amazing, Venerable Sir! How well-spoken this is, Venerable Sir, by the Blessed One: 'Those who give it with faith and with a mind perfectly clear, that very food benefits them in this world and in the next. Therefore, having overcome stinginess, one should give a gift, having conquered the defilements; for merits are the foundation for beings in the next world.'\"",
      "sinhala": "එකත්පස්ව සිටි සේරී නම් දෙව්පුත්‍රයා භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසුවේය – ‘‘දෙවියෝද මනුෂ්‍යයෝද යන දෙපාර්ශ්වයම ආහාරයට ප්‍රිය කරති; එසේ නම් ආහාරයට ප්‍රිය නොකරන ඒ යක්ෂයා කවරෙක්ද?’’\n\n‘‘යම් කිසිවෙක් ශ්‍රද්ධාවෙන්, පහන් සිතින් ආහාර දන් දෙත්ද; ඒ ආහාරයම මේ ලෝකයේදීත් පරලෝකයේදීත් ඔවුන්ට ප්‍රයෝජනවත් වේ. එබැවින් මසුරුකම දුරු කර, කෙලෙස් මැඩගෙන දානය දිය යුතුය; පින පරලොව සත්ත්වයන්ට පිහිට වේ.’’\n\n‘‘ආශ්චර්යයකි භාග්‍යවතුන් වහන්ස, අද්භූතයකි භාග්‍යවතුන් වහන්ස! භාග්‍යවතුන් වහන්සේ විසින් මෙය ඉතා මැනවින් වදාළ සේක – ‘යම් කිසිවෙක් ශ්‍රද්ධාවෙන්, පහන් සිතින් ආහාර දන් දෙත්ද; ඒ ආහාරයම මේ ලෝකයේදීත් පරලෝකයේදීත් ඔවුන්ට ප්‍රයෝජනවත් වේ. එබැවින් මසුරුකම දුරු කර, කෙලෙස් මැඩගෙන දානය දිය යුතුය; පින පරලොව සත්ත්වයන්ට පිහිට වේ.’’’\n\n‘‘භාග්‍යවතුන් වහන්ස, අතීතයේදී මම සිරි (සේරී) නම් රජෙක්ව සිටියෙමි. මම දායකයෙක්, දානපතියෙක්, දානය වර්ණනා කරන්නෙක් වූයෙමි. භාග්‍යවතුන් වහන්ස, ඒ මම ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට, දුගීන්ට, අසරණයන්ට, යාචකයන්ට දොරටු හතරකින් දන් දුන්නෙමි. භාග්‍යවතුන් වහන්ස, එවිට අන්තඃපුර ස්ත්‍රීහු මා වෙත පැමිණ මෙසේ පැවසූහ – ‘දෙවියන් වහන්සේ විසින් දානය දෙනු ලැබේ; අපට දානය දීමට නොලැබේ. දෙවියන් වහන්සේ මුල් කරගෙන අපද දාන දී, පින් කළොත් යහපති.’ භාග්‍යවතුන් වහන්ස, එවිට මට මෙසේ සිතුණි – ‘මම දායකයෙක්, දානපතියෙක්, දානය වර්ණනා කරන්නෙක් වෙමි. ‘දානය දෙන්නෙමු’ යැයි පවසන්නන්ට මම කුමක් කියන්නද?’ භාග්‍යවතුන් වහන්ස, ඒ මම පළමු දොර අන්තඃපුර ස්ත්‍රීන්ට දුන්නෙමි. එහිදී අන්තඃපුර ස්ත්‍රීන් විසින් දානය දෙනු ලැබුණි; මගේ දානය අඩු විය.\n\n‘‘භාග්‍යවතුන් වහන්ස, එවිට රාජ්‍ය අනුග්‍රහය ලබන ක්ෂත්‍රියයෝ මා වෙත පැමිණ මෙසේ පැවසූහ – ‘දෙවියන් වහන්සේ විසින් දානය දෙනු ලැබේ; අන්තඃපුර ස්ත්‍රීන් විසින් දානය දෙනු ලැබේ; අපට දානය දීමට නොලැබේ. දෙවියන් වහන්සේ මුල් කරගෙන අපද දාන දී, පින් කළොත් යහපති.’ භාග්‍යවතුන් වහන්ස, එවිට මට මෙසේ සිතුණි – ‘මම දායකයෙක්, දානපතියෙක්, දානය වර්ණනා කරන්නෙක් වෙමි. ‘දානය දෙන්නෙමු’ යැයි පවසන්නන්ට මම කුමක් කියන්නද?’ භාග්‍යවතුන් වහන්ස, ඒ මම දෙවන දොර රාජ්‍ය අනුග්‍රහය ලබන ක්ෂත්‍රියයන්ට දුන්නෙමි. එහිදී රාජ්‍ය අනුග්‍රහය ලබන ක්ෂත්‍රියයන් විසින් දානය දෙනු ලැබුණි; මගේ දානය අඩු විය.\n\n‘‘භාග්‍යවතුන් වහන්ස, එවිට සේනාංගය (සේනාව) මා වෙත පැමිණ මෙසේ පැවසූහ – ‘දෙවියන් වහන්සේ විසින් දානය දෙනු ලැබේ; අන්තඃපුර ස්ත්‍රීන් විසින් දානය දෙනු ලැබේ; රාජ්‍ය අනුග්‍රහය ලබන ක්ෂත්‍රියයන් විසින් දානය දෙනු ලැබේ; අපට දානය දීමට නොලැබේ. දෙවියන් වහන්සේ මුල් කරගෙන අපද දාන දී, පින් කළොත් යහපති.’ භාග්‍යවතුන් වහන්ස, එවිට මට මෙසේ සිතුණි – ‘මම දායකයෙක්, දානපතියෙක්, දානය වර්ණනා කරන්නෙක් වෙමි. ‘දානය දෙන්නෙමු’ යැයි පවසන්නන්ට මම කුමක් කියන්නද?’ භාග්‍යවතුන් වහන්ස, ඒ මම තුන්වන දොර සේනාංගයට දුන්නෙමි. එහිදී සේනාංගය විසින් දානය දෙනු ලැබුණි; මගේ දානය අඩු විය.\n\n‘‘භාග්‍යවතුන් වහන්ස, එවිට බ්‍රාහ්මණයෝ සහ ගෘහපතියෝ මා වෙත පැමිණ මෙසේ පැවසූහ – ‘දෙවියන් වහන්සේ විසින් දානය දෙනු ලැබේ; අන්තඃපුර ස්ත්‍රීන් විසින් දානය දෙනු ලැබේ; රාජ්‍ය අනුග්‍රහය ලබන ක්ෂත්‍රියයන් විසින් දානය දෙනු ලැබේ; සේනාංගය විසින් දානය දෙනු ලැබේ; අපට දානය දීමට නොලැබේ. දෙවියන් වහන්සේ මුල් කරගෙන අපද දාන දී, පින් කළොත් යහපති.’ භාග්‍යවතුන් වහන්ස, එවිට මට මෙසේ සිතුණි – ‘මම දායකයෙක්, දානපතියෙක්, දානය වර්ණනා කරන්නෙක් වෙමි. ‘දානය දෙන්නෙමු’ යැයි පවසන්නන්ට මම කුමක් කියන්නද?’ භාග්‍යවතුන් වහන්ස, ඒ මම සතරවන දොර බ්‍රාහ්මණ ගෘහපතීන්ට දුන්නෙමි. එහිදී බ්‍රාහ්මණ ගෘහපතීන් විසින් දානය දෙනු ලැබුණි; මගේ දානය අඩු විය.\n\n‘‘භාග්‍යවතුන් වහන්ස, එවිට මිනිස්සු මා වෙත පැමිණ මෙසේ පැවසූහ – ‘දැන් දෙවියන් වහන්සේ වෙනුවෙන් කිසිවෙක් දානය නොදෙයි.’ භාග්‍යවතුන් වහන්ස, මෙසේ කියනු ලැබූ මම ඒ මිනිසුන්ට මෙසේ පැවසීමි – ‘එසේ නම්, පින්වත්නි, පිට පළාත්වලින් ලැබෙන ආදායමෙන් අඩක් අන්තඃපුරයට ගෙන එන්න, අඩක් ඒ ස්ථානයේම ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට, දුගීන්ට, අසරණයන්ට, යාචකයන්ට දානයක් වශයෙන් දෙන්න.’ භාග්‍යවතුන් වහන්ස, එසේ දීර්ඝ කාලයක් කරන ලද පින්වලට, එසේ දීර්ඝ කාලයක් කරන ලද කුසල් ධර්මයන්ට – ‘මේ තරම් පිනක්’ කියා හෝ, ‘මේ තරම් පින් විපාකයක්’ කියා හෝ, ‘මේ තරම් කලක් ස්වර්ගයේ සිටිය යුතුයි’ කියා හෝ මම අවසානයක් නොදකිමි. ආශ්චර්යයකි භාග්‍යවතුන් වහන්ස, අද්භූතයකි භාග්‍යවතුන් වහන්ස! භාග්‍යවතුන් වහන්සේ විසින් මෙය ඉතා මැනවින් වදාළ සේක – ‘යම් කිසිවෙක් ශ්‍රද්ධාවෙන්, පහන් සිතින් ආහාර දන් දෙත්ද; ඒ ආහාරයම මේ ලෝකයේදීත් පරලෝකයේදීත් ඔවුන්ට ප්‍රයෝජනවත් වේ. එබැවින් මසුරුකම දුරු කර, කෙලෙස් මැඩගෙන දානය දිය යුතුය; පින පරලොව සත්ත්වයන්ට පිහිට වේ.’’’",
      "paliTitle": "Serīsuttaṃ",
      "englishTitle": "The Discourse to Serī",
      "sinhalaTitle": "සේරී සූත්‍රය"
    },
    {
      "number": 105,
      "pali": "Ekamantaṃ ṭhito kho ghaṭīkāro devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Avihaṃ upapannāse, vimuttā satta bhikkhavo; Rāgadosaparikkhīṇā, tiṇṇā loke visattika’’nti. ‘‘Ke ca te ataruṃ paṅkaṃ, maccudheyyaṃ suduttaraṃ; Ke hitvā mānusaṃ dehaṃ, dibbayogaṃ upaccagu’’nti. ‘‘Upako palagaṇḍo [phalagaṇḍo (ka.)] ca, pukkusāti ca te tayo; Bhaddiyo khaṇḍadevo ca, bāhuraggi ca saṅgiyo [bāhudantī ca piṅgiyo (sī. syā.)]; Te hitvā mānusaṃ dehaṃ, dibbayogaṃ upaccagu’’nti. ‘‘Kusalī bhāsasī tesaṃ, mārapāsappahāyinaṃ; Kassa te dhammamaññāya, acchiduṃ bhavabandhana’’nti. ‘‘Na aññatra bhagavatā, nāññatra tava sāsanā; Yassa te dhammamaññāya, acchiduṃ bhavabandhanaṃ. ‘‘Yattha nāmañca rūpañca, asesaṃ uparujjhati; Taṃ te dhammaṃ idhaññāya, acchiduṃ bhavabandhana’’nti. ‘‘Gambhīraṃ bhāsasī vācaṃ, dubbijānaṃ sudubbudhaṃ; Kassa tvaṃ dhammamaññāya, vācaṃ bhāsasi īdisa’’nti. ‘‘Kumbhakāro pure āsiṃ, vekaḷiṅge ghaṭīkaro; Mātāpettibharo āsiṃ, kassapassa upāsako. ‘‘Virato methunā dhammā, brahmacārī nirāmiso; Ahuvā te sagāmeyyo, ahuvā te pure sakhā. ‘‘Sohamete pajānāmi, vimutte satta bhikkhavo; Rāgadosaparikkhīṇe, tiṇṇe loke visattika’’nti. ‘‘Evametaṃ tadā āsi, yathā bhāsasi bhaggava; Kumbhakāro pure āsi, vekaḷiṅge ghaṭīkaro. ‘‘Mātāpettibharo āsi, kassapassa upāsako; Virato methunā dhammā, brahmacārī nirāmiso; Ahuvā me sagāmeyyo, ahuvā me pure sakhā’’ti. ‘‘Evametaṃ purāṇānaṃ, sahāyānaṃ ahu saṅgamo; Ubhinnaṃ bhāvitattānaṃ, sarīrantimadhārina’’nti.",
      "english": "Standing to one side, the deity Ghaṭīkāra, in the presence of the Blessed One, spoke this verse: \"Seven bhikkhus have been reborn in Aviha, fully liberated; their lust and hatred completely destroyed, they have crossed over the entanglements of the world.\"\n\n\"And who are they who have crossed the mud, the realm of death so difficult to cross? Who, having abandoned the human body, have transcended to a divine connection?\"\n\n\"Upaka, Palagaṇḍa, and Pukkusāti—those three; Bhaddiya, Khaṇḍadeva, and Bāhuraggi and Saṅgiya. They, having abandoned the human body, have transcended to a divine connection.\"\n\n\"Skillfully do you speak of them, those who have abandoned the snares of Māra. By understanding whose Dhamma did they cut off the bonds of existence?\"\n\n\"Not apart from the Blessed One, not apart from your teaching; by understanding whose Dhamma they cut off the bonds of existence.\"\n\n\"Where name and form entirely cease; by understanding that Dhamma here, they cut off the bonds of existence.\"\n\n\"You speak profound words, difficult to know, very hard to comprehend. By understanding whose Dhamma do you speak such words?\"\n\n\"Formerly, I was a potter, Ghaṭīkāra, in Vekaliṅga. I supported my mother and father, and was a lay follower of Kassapa.\"\n\n\"I abstained from sexual conduct, leading a holy life, free from defilements. I was your fellow villager, I was your former friend.\"\n\n\"Therefore, I know these seven liberated bhikkhus, whose lust and hatred are utterly destroyed, who have crossed over the entanglements of the world.\"\n\n\"So it was then, just as you speak, Bhaggava. You were formerly a potter, Ghaṭīkāra, in Vekaliṅga.\"\n\n\"You supported your mother and father, and were a lay follower of Kassapa. You abstained from sexual conduct, leading a holy life, free from defilements. You were my fellow villager, you were my former friend.\"\n\n\"Such was the meeting of old friends, of two individuals whose minds were fully developed, both bearing their final bodies.\"",
      "sinhala": "එක් පසෙක සිටගෙන සිටි ඝටීකාර නම් දෙව්පුත් භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව පැවසීය: ‘‘සත් භික්ෂූහු අවිහා බ්‍රහ්ම ලෝකයෙහි උපන්නාහ. ඔවුහු රාගය හා ද්වේෂය ක්ෂය කළෝය. ලෝකයෙහි වූ විෂඝෝර බැඳීම් ද තරණය කළෝය. ඔවුහු විමුක්ත වූවෝය.’’\n\n‘‘කවරහු නම් ඒ මඩ ගොහොරු තරණය කළෝද? අතිශයින් දුෂ්කර වූ මාරයාගේ බල ප්‍රදේශයද තරණය කළෝද? කවරහු මිනිස් සිරුර අත්හැර, දිව්‍යමය බැඳීම් ද ඉක්මවා ගියෝද?’’\n\n‘‘උපක, පලගණ්ඩ, පුක්කුසාති යන ඒ තිදෙනාත්, භද්දිය, ඛණ්ඩදේව, බාහුරග්ගි, සංගිය යන සතර දෙනාත්, ඔවුහු මිනිස් සිරුර අත්හැර, දිව්‍යමය බැඳීම් ද ඉක්මවා ගියෝය.’’\n\n‘‘ඔවුන්, මාරයාගේ උගුල් බැහැර කළාවූ අය ගැන, නුඹ දක්ෂ ලෙස පවසන්නෙහි. කවරෙකුගේ ධර්මය අවබෝධ කරගෙනද ඔවුහු භව බන්ධනයන් සිඳ දැමුවෝද?’’\n\n‘‘භාග්‍යවතුන් වහන්සේ හැර වෙනත් කෙනෙකුගෙන් නොවේ. ඔබ වහන්සේගේ ශාසනය හැර වෙනත් තැනකින් නොවේ. ඔවුහු ඔබ වහන්සේගේ ධර්මය අවබෝධ කරගෙන භව බන්ධනයන් සිඳ දැමුවෝය.’’\n\n‘‘නාමයත් රූපයත් මුළුමනින්ම නිරුද්ධ වන්නේ කොතැනකද, ඔබ වහන්සේගේ ඒ ධර්මය මෙහිදී අවබෝධ කරගෙන, ඔවුහු භව බන්ධනයන් සිඳ දැමුවෝය.’’\n\n‘‘නුඹ ගැඹුරු වූ, තේරුම් ගැනීමට අපහසු වූ, අවබෝධ කර ගැනීමට ඉතා දුෂ්කර වූ වචන පවසන්නෙහි. කවරෙකුගේ ධර්මය අවබෝධ කරගෙනද නුඹ මෙබඳු වචන පවසන්නෙහි?’’\n\n‘‘පෙර මම වේකළිංග ගමෙහි ඝටීකාර නම් කුඹල්කරුවෙකු වීමි. මවටත් පියාටත් උපස්ථාන කරන්නෙකු වීමි. කාශ්‍යප බුදුන් වහන්සේගේ උපාසකයෙකු වීමි.’’\n\n‘‘මම මෛථුන ධර්මයෙන් වැළකුණු, නිර්ආමිස බ්‍රහ්මචාරියෙකු වීමි. ඔබ වහන්සේගේ ගමේම කෙනෙකු වීමි. පෙර ඔබ වහන්සේගේ මිතුරෙකු ද වීමි.’’\n\n‘‘එබැවින් රාගය හා ද්වේෂය ක්ෂය කොට, ලෝකයෙහි විෂඝෝර බැඳීම් තරණය කොට විමුක්ත වූ ඒ සත් භික්ෂූන් වහන්සේලා මම දනිමි.’’\n\n‘‘භග්ගවය, නුඹ පවසන ආකාරයට එවිට එය එසේම විය. වේකළිංග ගමෙහි ඝටීකාර නම් කුඹල්කරුවෙකු පෙර විය.’’\n\n‘‘ඔහු මවටත් පියාටත් උපස්ථාන කරන්නෙකු විය. කාශ්‍යප බුදුන් වහන්සේගේ උපාසකයෙකු විය. මෛථුන ධර්මයෙන් වැළකුණු, නිර්ආමිස බ්‍රහ්මචාරියෙකු විය. මාගේ ගමේම කෙනෙකු විය. මාගේ පෙර මිතුරෙකු ද විය.’’\n\n‘‘මෙසේ භාවනානුයෝගී සිත් දියුණු කළ, අවසන් ශරීරය දරන, පෙර සිටි මිතුරන් දෙදෙනාගේ හමුවක් විය.’’",
      "paliTitle": "Ghaṭīkārasuttaṃ",
      "englishTitle": "The Discourse to Ghaṭīkāra",
      "sinhalaTitle": "ඝටීකාර සූත්‍රය"
    },
    {
      "number": 106,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ sambahulā bhikkhū, kosalesu viharanti himavantapasse araññakuṭikāya uddhatā unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatino asampajānā asamāhitā vibbhantacittā pākatindriyā. Atha kho jantu devaputto tadahuposathe pannarase yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū gāthāhi ajjhabhāsi – ‘‘Sukhajīvino pure āsuṃ, bhikkhū gotamasāvakā; Anicchā piṇḍamesanā [piṇḍamesānā (?)], anicchā sayanāsanaṃ; Loke aniccataṃ ñatvā, dukkhassantaṃ akaṃsu te. ‘‘Dupposaṃ katvā attānaṃ, gāme gāmaṇikā viya; Bhutvā bhutvā nipajjanti, parāgāresu mucchitā. ‘‘Saṅghassa añjaliṃ katvā, idhekacce vadāmahaṃ [vandāmahaṃ (ka.)]; Apaviddhā anāthā te, yathā petā tatheva te [tatheva ca (sī.)]. ‘‘Ye kho pamattā viharanti, te me sandhāya bhāsitaṃ; Ye appamattā viharanti, namo tesaṃ karomaha’’nti.",
      "english": "Thus have I heard: On one occasion, many bhikkhus were dwelling in the Kosala country, on the slopes of the Himalayas, in a forest hut. They were conceited, boastful, frivolous, talkative, with scattered speech, lacking mindfulness, lacking full awareness, unfocused, with bewildered minds, and with unrestrained senses.\n\nThen, on that fifteenth-day Uposatha, the deva-son Jantu approached those bhikkhus. Having approached, he addressed those bhikkhus with these verses:\n\n\"In former times, the bhikkhus, disciples of Gotama, lived with ease, without craving for almsfood, without craving for lodging. Having fully comprehended the impermanence within the world, they brought an end to suffering.\"\n\n\"Making themselves difficult to support, like village headmen in a village, they eat abundantly and then lie down, clinging with infatuation in the homes of others.\"\n\n\"Having paid homage to the Saṅgha, I speak of some here who are cast away, helpless, just like hungry ghosts.\"\n\n\"This teaching of mine is directed towards those who dwell heedlessly. To those who dwell diligently, I pay homage.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක බොහෝ භික්ෂූන් වහන්සේලා කෝසල ජනපදයේ හිමාලය කඳු පාමුල අරණ්‍ය කුටියක වාසය කරති. ඔවුහු උද්ධත වූහ, උඩඟු වූහ, චපල වූහ, වාචාල වූහ, විසිරුණු කතා ඇති වූහ, සිහි මුළා වූහ, මනා ප්‍රඥාවෙන් යුක්ත නො වූහ, සමාධියෙන් තොර වූහ, වික්‍ෂිප්ත සිත් ඇති වූහ, ප්‍රකට වූ ඉන්ද්‍රියයන් ඇති වූහ.\n\nඉක්බිති ජන්තු නම් දෙව්පුත්‍රයා එදින වූ පසළොස්වක පොහොය දින ඒ භික්ෂූන් වහන්සේලා වැඩසිටි තැනට පැමිණියේය. පැමිණ ඒ භික්ෂූන් වහන්සේලාට ගාථාවලින් මෙය පැවසීය –\n\n‘‘පෙර භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක වූ භික්ෂූහු සුවසේ ජීවත් වූහ. පිණ්ඩපාතය කෙරෙහි ආශාවක් නොවීය. සේනාසන කෙරෙහි ආශාවක් නොවීය. ඔවුහු ලෝකයේ අනිත්‍ය ස්වභාවය අවබෝධ කරගෙන, දුක කෙළවර කළහ.\n\n‘‘තමන් පෝෂණය කිරීමට අපහසු අය බවට පත්කරගෙන, ගම්වල ප්‍රධානීන් මෙන්, අනුන්ගේ ගෙවල්වලට ඇලී ගැලී (මුසපත් වී) සිටිමින්, අනුභව කොට අනුභව කොට සැතපෙති.\n\n‘‘සංඝයා වහන්සේට නමස්කාර කොට, මෙහි ඇතැම් දෙනාට මම කියමි: ඔවුහු අසරණ වූහ, අනාථ වූහ, ප්‍රේතයන් මෙන් වෙති.\n\n‘‘යම් කෙනෙක් ප්‍රමාදව වාසය කරත්ද, මා විසින් මෙය කියන ලද්දේ ඔවුන් අරභයාය. යම් කෙනෙක් අප්‍රමාදව වාසය කරත්ද, මම ඔවුන්ට නමස්කාර කරමි’’ යි.",
      "paliTitle": "Jantusuttaṃ",
      "englishTitle": "Jantu Sutta",
      "sinhalaTitle": "ජන්තු සූත්‍රය"
    },
    {
      "number": 107,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ ṭhito kho rohitasso devaputto bhagavantaṃ etadavoca – ‘‘yattha nu kho, bhante, na jāyati na jīyati na mīyati [na jiyyati na miyyati (syā. kaṃ. ka.)] na cavati na upapajjati, sakkā nu kho so, bhante, gamanena lokassa anto ñātuṃ vā daṭṭhuṃ vā pāpuṇituṃ vā’’ti? ‘‘Yattha kho, āvuso, na jāyati na jīyati na mīyati na cavati na upapajjati, nāhaṃ taṃ gamanena lokassa antaṃ ñāteyyaṃ daṭṭheyyaṃ patteyyanti vadāmī’’ti. ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāvasubhāsitamidaṃ, bhante, bhagavatā – ‘yattha kho, āvuso, na jāyati na jīyati na mīyati na cavati na upapajjati, nāhaṃ taṃ gamanena lokassa antaṃ ñāteyyaṃ daṭṭheyyaṃ patteyyanti vadāmī’ti. ‘‘Bhūtapubbāhaṃ, bhante, rohitasso nāma isi ahosiṃ bhojaputto iddhimā vehāsaṅgamo. Tassa mayhaṃ, bhante, evarūpo javo ahosi; seyyathāpi nāma daḷhadhammā [daḷhadhammo (sabbattha) ṭīkā ca moggallānabyākaraṇaṃ ca oloketabbaṃ] dhanuggaho susikkhito katahattho katayoggo katūpāsano lahukena asanena appakasireneva tiriyaṃ tālacchāyaṃ atipāteyya. Tassa mayhaṃ, bhante, evarūpo padavītihāro ahosi; seyyathāpi nāma puratthimā samuddā pacchimo samuddo. Tassa mayhaṃ, bhante, evarūpaṃ icchāgataṃ uppajji – ‘ahaṃ gamanena lokassa antaṃ pāpuṇissāmī’ti. So khvāhaṃ, bhante, evarūpena javena samannāgato evarūpena ca padavītihārena aññatreva asita-pīta-khāyita-sāyitā aññatra uccāra-passāvakammā aññatra niddākilamathapaṭivinodanā vassasatāyuko vassasatajīvī vassasataṃ gantvā appatvāva lokassa antaṃ antarāva kālaṅkato. ‘‘Acchariyaṃ, bhante, abbhutaṃ, bhante! Yāvasubhāsitamidaṃ, bhante, bhagavatā – ‘yattha kho, āvuso, na jāyati na jīyati na mīyati na cavati na upapajjati, nāhaṃ taṃ gamanena lokassa antaṃ ñāteyyaṃ daṭṭheyyaṃ patteyyanti vadāmī’’’ti. ‘‘Na kho panāhaṃ, āvuso, appatvā lokassa antaṃ dukkhassa antakiriyaṃ vadāmi. Api ca khvāhaṃ, āvuso, imasmiṃyeva byāmamatte kaḷevare sasaññimhi samanake lokañca paññapemi lokasamudayañca lokanirodhañca lokanirodhagāminiñca paṭipadanti. ‘‘Gamanena na pattabbo, lokassanto kudācanaṃ; Na ca appatvā lokantaṃ, dukkhā atthi pamocanaṃ. ‘‘Tasmā have lokavidū sumedho, Lokantagū vusitabrahmacariyo; Lokassa antaṃ samitāvi ñatvā, Nāsīsati lokamimaṃ parañcā’’ti.",
      "english": "At Sāvatthī. Standing to one side, the celestial being Rohītassa said to the Blessed One: \"Venerable Sir, is it possible, by travelling, to know, to see, or to reach that end of the world where there is no birth, aging, death, passing away, or reappearance?\"\n\n\"Friend, I declare that it is not possible, by travelling, to know, to see, or to reach that end of the world where there is no birth, aging, death, passing away, or reappearance.\"\n\n\"Wonderful, Venerable Sir! Amazing, Venerable Sir! How well spoken this is by the Blessed One: ‘Friend, I declare that it is not possible, by travelling, to know, to see, or to reach that end of the world where there is no birth, aging, death, passing away, or reappearance.’ Venerable Sir, in the past I was a seer named Rohītassa, a son of Bhoja, powerful and able to travel through the air. Venerable Sir, I had such swiftness that, just as a strong archer, well-trained, practiced, and skilled, could shoot a light arrow across a palm-tree’s shadow with ease. Venerable Sir, I had such a stride that it was like from the eastern ocean to the western ocean. Venerable Sir, such a desire arose in me: ‘I shall reach the end of the world by travelling.’ So, Venerable Sir, endowed with such swiftness and such a stride, apart from eating, drinking, chewing, and tasting, apart from defecating and urinating, apart from sleeping and overcoming weariness, I, having a lifespan of a hundred years and living for a hundred years, travelled for a hundred years, yet without reaching the end of the world, I died along the way. Wonderful, Venerable Sir! Amazing, Venerable Sir! How well spoken this is by the Blessed One: ‘Friend, I declare that it is not possible, by travelling, to know, to see, or to reach that end of the world where there is no birth, aging, death, passing away, or reappearance.’\"\n\n\"However, friend, I do not declare that there is an end to suffering without having reached the end of the world. But it is precisely in this fathom-long body, with its perceptions and its mind, that I declare the world, the origin of the world, the cessation of the world, and the path leading to the cessation of the world.\"\n\nBy travelling, the end of the world is never reached;\nNor is there liberation from suffering without having reached the end of the world.\nTherefore, truly, the wise one who knows the world,\nHaving reached the end of the world, having completed the holy life,\nHaving known the end of the world, having become peaceful,\nDoes not aspire to this world or the next.",
      "sinhala": "සාවත්ථියෙහි සිදු වූවකි.\n\nඑකත්පසෙක සිටි රෝහිතස්ස දෙව්පුත් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"පින්වතුන් වහන්ස, යම් තැනක ඉපදීමක් නැද්ද, ජරාවක් නැද්ද, මරණයක් නැද්ද, චුත වීමක් නැද්ද, නැවත උපතක් නැද්ද; භාග්‍යවතුන් වහන්ස, ගමනින් ඒ ලෝකයේ කෙළවර දැනගැනීමට හෝ දැකීමට හෝ ළඟා වීමට හැකි වේද?\"\n\n\"ඇවැත්නි, යම් තැනක ඉපදීමක් නැද්ද, ජරාවක් නැද්ද, මරණයක් නැද්ද, චුත වීමක් නැද්ද, නැවත උපතක් නැද්ද, ගමනින් ඒ ලෝකයේ කෙළවර දැනගැනීමට හෝ දැකීමට හෝ ළඟා වීමට මා හැකි යැයි නොකියමි.\"\n\n\"භාග්‍යවතුන් වහන්ස, ආශ්චර්යයකි! භාග්‍යවතුන් වහන්ස, අද්භූතයකි! භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් කෙතරම් මැනවින් දේශනා කරන ලද්දක්ද, 'ඇවැත්නි, යම් තැනක ඉපදීමක් නැද්ද, ජරාවක් නැද්ද, මරණයක් නැද්ද, චුත වීමක් නැද්ද, නැවත උපතක් නැද්ද, ගමනින් ඒ ලෝකයේ කෙළවර දැනගැනීමට හෝ දැකීමට හෝ ළඟා වීමට මා හැකි යැයි නොකියමි' යනුවෙන්. භාග්‍යවතුන් වහන්ස, පෙර රෝහිතස්ස නම් ඍෂිවරයෙකු වූ භෝජපුත්‍රයෙක් සිටියේය. ඔහු මහත් ඍද්ධි ඇති, අහසින් ගමන් කළ හැකි අයෙකි. භාග්‍යවතුන් වහන්ස, ඔහුට මෙබඳු වේගයක් තිබිණි. යම්සේ පුහුණු වූ, හුරු පුරුදු, මනා ලෙස හුරුවූ, මනා ලෙස වෙඩි තැබීමට සමත්, දිරිය දුනුවායෙක් ඉතා පහසුවෙන්, මහත් වෙහෙසකින් තොරව, සැහැල්ලු ඊතලයකින් තල් ගසක සෙවණැල්ල තිරස්ව ඉක්මවා යන්නේද, එබඳු වේගයක්. භාග්‍යවතුන් වහන්ස, ඔහුගේ පියවරක් මේ අයුරු විය. යම්සේ නැගෙනහිර මුහුදේ සිට බටහිර මුහුද දක්වා දුරක් වේද, එබඳු පියවරක්. භාග්‍යවතුන් වහන්ස, ඔහුට මෙබඳු අදහසක් පහළ විය: 'මම ගමනින් ලෝකයේ කෙළවරට පැමිණෙමි' කියා. භාග්‍යවතුන් වහන්ස, ඔහු එබඳු වේගයකින් හා එබඳු පියවරකින් යුක්තව, අනුභව කිරීම, පානය කිරීම, සැපීම, රස බැලීම හැර, මළමුත්‍රා බැහැර කිරීම හැර, නිදාව හා වෙහෙස දුරු කිරීම හැර, අවුරුදු සියයක ආයුෂ ඇතිව, අවුරුදු සියයක් ජීවත් වෙමින්, අවුරුදු සියයක් ගමන් කර, ලෝකයේ කෙළවරට නොපැමිණම අතරමගදී මරණයට පත් විය.\"\n\n\"භාග්‍යවතුන් වහන්ස, ආශ්චර්යයකි! භාග්‍යවතුන් වහන්ස, අද්භූතයකි! භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් කෙතරම් මැනවින් දේශනා කරන ලද්දක්ද, 'ඇවැත්නි, යම් තැනක ඉපදීමක් නැද්ද, ජරාවක් නැද්ද, මරණයක් නැද්ද, චුත වීමක් නැද්ද, නැවත උපතක් නැද්ද, ගමනින් ඒ ලෝකයේ කෙළවර දැනගැනීමට හෝ දැකීමට හෝ ළඟා වීමට මා හැකි යැයි නොකියමි' යනුවෙන්.\"\n\n\"ඇවැත්නි, ලෝකයේ කෙළවරට නොපැමිණ දුක කෙළවර කිරීමක් මම නොකියමි. එහෙත් ඇවැත්නි, මේ බඹයක් පමණ වූ, සිතක් සහිත වූ, සංඥාවක් සහිත වූ මේ ශරීරය තුළම මම ලෝකයද, ලෝකයේ හටගැනීමද, ලෝකයේ නිරෝධයද, ලෝක නිරෝධයට ගමන් කරන ප්‍රතිපදාවද පනවමි.\"\n\nගමනින් ලෝකයේ කෙළවර කිසි කලෙක පැමිණිය නොහැක.\nලෝකයේ කෙළවරට නොපැමිණ දුකින් මිදීමක්ද නැත.\n\nඑහෙයින් ලෝකය දන්නා, මහා ප්‍රඥා ඇති තැනැත්තා,\nලෝකයේ කෙළවරට පැමිණි, බඹසර අවසන් කළ තැනැත්තා,\nලෝකයේ කෙළවර සංසිඳවූයේ (නිරෝධ කළේ) යයි දැන,\nමේ ලෝකය හෝ පරලෝකය හෝ නොපතයි.",
      "paliTitle": "Rohitassasuttaṃ",
      "englishTitle": "The Discourse to Rohitassa",
      "sinhalaTitle": "රෝහිතස්ස සූත්‍රය"
    },
    {
      "number": 108,
      "pali": "Ekamantaṃ ṭhito kho nando devaputto bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Accenti kālā tarayanti rattiyo, Vayoguṇā anupubbaṃ jahanti; Etaṃ bhayaṃ maraṇe pekkhamāno, Puññāni kayirātha sukhāvahānī’’ti. ‘‘Accenti kālā tarayanti rattiyo, Vayoguṇā anupubbaṃ jahanti; Etaṃ bhayaṃ maraṇe pekkhamāno, Lokāmisaṃ pajahe santipekkho’’ti.",
      "english": "Standing to one side, the deva-son Nanda indeed spoke this verse in the presence of the Blessed One: \"Times rush on, nights swiftly pass; the qualities of age gradually vanish. Seeing this danger in death, one should perform wholesome deeds that bring happiness.\" Times rush on, nights swiftly pass; the qualities of age gradually vanish. Seeing this danger in death, one should abandon worldly allurements, aspiring for peace.",
      "sinhala": "ඒක පසෙක සිටි නන්ද නම් දෙව්පුත්‍රයා භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව කීවේය: \"කාලයෝ ගෙවී යති, රාත්‍රීහු ගෙවා දමති. වයසෙහි ගුණ ක්‍රමයෙන් අත්හරී. මරණයෙහි ඇති මේ භය දකිමින්, සැප පිණිස පවතින පින්කම් කළ යුතුය.\"\n\n\"කාලයෝ ගෙවී යති, රාත්‍රීහු ගෙවා දමති. වයසෙහි ගුණ ක්‍රමයෙන් අත්හරී. මරණයෙහි ඇති මේ භය දකිමින්, ශාන්තිය අපේක්ෂා කරන්නා ලෝක ආමිසය අත්හැරිය යුතුය.\"",
      "paliTitle": "Nandasuttaṃ",
      "englishTitle": "The Discourse to Nanda",
      "sinhalaTitle": "නන්ද සූත්‍රය"
    },
    {
      "number": 109,
      "pali": "Ekamantaṃ ṭhito kho nandivisālo devaputto bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Catucakkaṃ navadvāraṃ, puṇṇaṃ lobhena saṃyutaṃ; Paṅkajātaṃ mahāvīra, kathaṃ yātrā bhavissatī’’ti. ‘‘Chetvā naddhiṃ varattañca, icchālobhañca pāpakaṃ; Samūlaṃ taṇhamabbuyha, evaṃ yātrā bhavissatī’’ti.",
      "english": "Standing to one side, the divine son Nandivisāla addressed the Blessed One in verse:\n“This four-wheeled, nine-doored body, replete with greed and bound by it, arisen from the mire, Great Hero, how can there be passage?”\n“Having cut off the bindings and the restraints, and unwholesome desire and greed; having uprooted craving together with its root, thus will there be passage.”",
      "sinhala": "එකත්පසෙක සිටි නන්දිවිසාල නම් දෙව්පුත්‍රයා වනාහී භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසුවේය: “සිව් සක් සහිත වූ, නව දොරටු සහිත වූ, ලෝභයෙන් පිරී, බැඳී පවත්නා, මඩෙහි හටගත් මේ කයෙහි, මහා වීරයාණන් වහන්ස, (එකී) ජීවිත ගමන කෙසේ සිදුවන්නේද?”\n\n“ක්‍රෝධය නමැති බැමි ද, රාගය නමැති වරට්ට පටි ද, නපුරු වූ කැමැත්ත හා ලෝභය ද සිඳ දමා, තණ්හාව මුලිනුපුටා දමා, මෙසේ (ඔබගේ) ජීවිත ගමන සිදුවනු ඇතැයි.”",
      "paliTitle": "Nandivisālasuttaṃ",
      "englishTitle": "To Nandivisāla Sutta",
      "sinhalaTitle": "නන්දිවිසාල සූත්‍රය"
    },
    {
      "number": 110,
      "pali": "Sāvatthinidānaṃ. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘tuyhampi no, ānanda, sāriputto ruccatī’’ti? ‘‘Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyya? Paṇḍito, bhante, āyasmā sāriputto. Mahāpañño, bhante, āyasmā sāriputto. Puthupañño, bhante, āyasmā sāriputto. Hāsapañño [hāsupañño (sī.)], bhante, āyasmā sāriputto. Javanapañño, bhante, āyasmā sāriputto. Tikkhapañño, bhante, āyasmā sāriputto. Nibbedhikapañño, bhante, āyasmā sāriputto. Appiccho, bhante, āyasmā sāriputto. Santuṭṭho, bhante, āyasmā sāriputto. Pavivitto, bhante, āyasmā sāriputto. Asaṃsaṭṭho, bhante, āyasmā sāriputto. Āraddhavīriyo, bhante, āyasmā sāriputto. Vattā, bhante, āyasmā sāriputto. Vacanakkhamo, bhante, āyasmā sāriputto. Codako, bhante, āyasmā sāriputto. Pāpagarahī, bhante, āyasmā sāriputto. Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyyā’’ti? ‘‘Evametaṃ, ānanda, evametaṃ, ānanda! Kassa hi nāma, ānanda, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa sāriputto na rucceyya? Paṇḍito, ānanda, sāriputto. Mahāpañño, ānanda, sāriputto. Puthupañño, ānanda, sāriputto. Hāsapañño, ānanda, sāriputto. Javanapañño, ānanda, sāriputto. Tikkhapañño, ānanda, sāriputto. Nibbedhikapañño, ānanda, sāriputto. Appiccho, ānanda, sāriputto. Santuṭṭho, ānanda, sāriputto. Pavivitto, ānanda, sāriputto. Asaṃsaṭṭho, ānanda, sāriputto. Āraddhavīriyo, ānanda, sāriputto. Vattā, ānanda, sāriputto. Vacanakkhamo, ānanda, sāriputto. Codako, ānanda, sāriputto. Pāpagarahī, ānanda, sāriputto. Kassa hi nāma, ānanda, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa sāriputto na rucceyyā’’ti? Atha kho susimo [susīmo (sī.)] devaputto āyasmato sāriputtassa vaṇṇe bhaññamāne mahatiyā devaputtaparisāya parivuto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho susimo devaputto bhagavantaṃ etadavoca – ‘‘Evametaṃ, bhagavā, evametaṃ, sugata. Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyya? Paṇḍito, bhante, āyasmā sāriputto. Mahāpañño, bhante, puthupañño, bhante, hāsapañño, bhante, javanapañño, bhante, tikkhapañño, bhante, nibbedhikapañño, bhante, appiccho, bhante, santuṭṭho, bhante, pavivitto, bhante, asaṃsaṭṭho, bhante, āraddhavīriyo, bhante, vattā, bhante, vacanakkhamo, bhante, codako, bhante, pāpagarahī, bhante, āyasmā sāriputto. Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyya? ‘‘Ahampi hi, bhante, yaññadeva devaputtaparisaṃ upasaṅkamiṃ, etadeva bahulaṃ saddaṃ suṇāmi – ‘paṇḍito āyasmā sāriputto; mahāpañño āyasmā, puthupañño āyasmā, hāsapañño āyasmā, javanapañño āyasmā, tikkhapañño āyasmā, nibbedhikapañño āyasmā, appiccho āyasmā, santuṭṭho āyasmā, pavivitto āyasmā, asaṃsaṭṭho āyasmā, āraddhavīriyo āyasmā, vattā āyasmā, vacanakkhamo āyasmā, codako āyasmā, pāpagarahī āyasmā sāriputto’ti. Kassa hi nāma, bhante, abālassa aduṭṭhassa amūḷhassa avipallatthacittassa āyasmā sāriputto na rucceyyā’’ti? Atha kho susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṃseti. ‘‘Seyyathāpi nāma maṇi veḷuriyo subho jātimā aṭṭhaṃso suparikammakato paṇḍukambale nikkhitto bhāsate ca tapate ca virocati ca; evamevaṃ susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṃseti. ‘‘Seyyathāpi nāma nikkhaṃ jambonadaṃ dakkhakammāraputtaukkāmukhasukusalasampahaṭṭhaṃ paṇḍukambale nikkhittaṃ bhāsate ca tapate ca virocati ca; evamevaṃ susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṃseti. ‘‘Seyyathāpi nāma saradasamaye viddhe vigatavalāhake deve rattiyā paccūsasamayaṃ osadhitārakā bhāsate ca tapate ca virocati ca; evamevaṃ susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṃseti. ‘‘Seyyathāpi nāma saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno [abbhussukkamāno (sī. syā. kaṃ. pī.), abbhuggamamāno (dī. ni. 2.258)] sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocati ca; evamevaṃ susimassa devaputtassa devaputtaparisā āyasmato sāriputtassa vaṇṇe bhaññamāne attamanā pamuditā pītisomanassajātā uccāvacā vaṇṇanibhā upadaṃseti. Atha kho susimo devaputto āyasmantaṃ sāriputtaṃ ārabbha bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Paṇḍitoti samaññāto, sāriputto akodhano; Appiccho sorato danto, satthuvaṇṇābhato isī’’ti. Atha kho bhagavā āyasmantaṃ sāriputtaṃ ārabbha susimaṃ devaputtaṃ gāthāya paccabhāsi – ‘‘Paṇḍitoti samaññāto, sāriputto akodhano; Appiccho sorato danto, kālaṃ kaṅkhati sudanto’’ [kālaṃ kaṅkhati bhatako sudanto (sī.), kālaṃ kaṅkhati bhāvito sudanto (syā. kaṃ.), kālaṃ kaṅkhati bhatiko sudanto (pī.)] ti.",
      "english": "Occasioned at Savatthi. Then the Venerable Ānanda approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As the Venerable Ānanda was sitting to one side, the Blessed One said to him, \"Do you also, Ānanda, appreciate Sāriputta?\"\n\n\"Indeed, venerable sir, to whom—who is not foolish, not malicious, not deluded, whose mind is not perverted—would the Venerable Sāriputta not be appreciated? Venerable Sāriputta is wise, venerable sir. He has great wisdom, venerable sir. He has extensive wisdom, venerable sir. He has ready wisdom, venerable sir. He has swift wisdom, venerable sir. He has sharp wisdom, venerable sir. He has penetrating wisdom, venerable sir. He is of few wishes, venerable sir. He is content, venerable sir. He is secluded, venerable sir. He is unentangled, venerable sir. He has aroused energy, venerable sir. He is an advisor, venerable sir. He is patient with instruction, venerable sir. He is an admonisher, venerable sir. He is one who censures evil, venerable sir. Indeed, venerable sir, to whom—who is not foolish, not malicious, not deluded, whose mind is not perverted—would the Venerable Sāriputta not be appreciated?\"\n\n\"It is so, Ānanda, it is so, Ānanda! Indeed, Ānanda, to whom—who is not foolish, not malicious, not deluded, whose mind is not perverted—would Sāriputta not be appreciated? Sāriputta is wise, Ānanda. He has great wisdom, Ānanda. He has extensive wisdom, Ānanda. He has ready wisdom, Ānanda. He has swift wisdom, Ānanda. He has sharp wisdom, Ānanda. He has penetrating wisdom, Ānanda. He is of few wishes, Ānanda. He is content, Ānanda. He is secluded, Ānanda. He is unentangled, Ānanda. He has aroused energy, Ānanda. He is an advisor, Ānanda. He is patient with instruction, Ānanda. He is an admonisher, Ānanda. He is one who censures evil, Ānanda. Indeed, Ānanda, to whom—who is not foolish, not malicious, not deluded, whose mind is not perverted—would Sāriputta not be appreciated?\"\n\nThen, while the praise of Venerable Sāriputta was being spoken, the deity Susima, surrounded by a great assembly of deities, approached the Blessed One. Having approached, he paid homage to the Blessed One and stood to one side. As the deity Susima stood to one side, he said to the Blessed One, \"It is so, Blessed One, it is so, Fortunate One! Indeed, venerable sir, to whom—who is not foolish, not malicious, not deluded, whose mind is not perverted—would the Venerable Sāriputta not be appreciated? Venerable Sāriputta is wise, venerable sir. He has great wisdom, venerable sir; he has extensive wisdom, venerable sir; he has ready wisdom, venerable sir; he has swift wisdom, venerable sir; he has sharp wisdom, venerable sir; he has penetrating wisdom, venerable sir; he is of few wishes, venerable sir; he is content, venerable sir; he is secluded, venerable sir; he is unentangled, venerable sir; he has aroused energy, venerable sir; he is an advisor, venerable sir; he is patient with instruction, venerable sir; he is an admonisher, venerable sir; he is one who censures evil, venerable sir. Indeed, venerable sir, to whom—who is not foolish, not malicious, not deluded, whose mind is not perverted—would the Venerable Sāriputta not be appreciated?\"\n\n\"For I too, venerable sir, in whatever assembly of deities I approach, hear this same abundant sound – 'Venerable Sāriputta is wise; Venerable Sāriputta has great wisdom, Venerable Sāriputta has extensive wisdom, Venerable Sāriputta has ready wisdom, Venerable Sāriputta has swift wisdom, Venerable Sāriputta has sharp wisdom, Venerable Sāriputta has penetrating wisdom, Venerable Sāriputta is of few wishes, Venerable Sāriputta is content, Venerable Sāriputta is secluded, Venerable Sāriputta is unentangled, Venerable Sāriputta has aroused energy, Venerable Sāriputta is an advisor, Venerable Sāriputta is patient with instruction, Venerable Sāriputta is an admonisher, Venerable Sāriputta is one who censures evil.' Indeed, venerable sir, to whom—who is not foolish, not malicious, not deluded, whose mind is not perverted—would the Venerable Sāriputta not be appreciated?\"\n\nThen, as the praise of Venerable Sāriputta was being spoken, the assembly of deities belonging to the deity Susima became delighted, joyful, filled with rapture and gladness, and displayed various resplendent hues. Just as a beryl gem, beautiful, of excellent origin, eight-faceted, well-polished, when placed upon a yellow woolen cloth, shines, blazes, and radiates; exactly so, as the praise of Venerable Sāriputta was being spoken, the assembly of deities belonging to the deity Susima became delighted, joyful, filled with rapture and gladness, and displayed various resplendent hues.\n\nJust as a finely-wrought Jambunada gold piece, expertly hammered and refined by a skilled goldsmith's son in a crucible, when placed upon a yellow woolen cloth, shines, blazes, and radiates; exactly so, as the praise of Venerable Sāriputta was being spoken, the assembly of deities belonging to the deity Susima became delighted, joyful, filled with rapture and gladness, and displayed various resplendent hues.\n\nJust as, in the autumn season when the sky is clear and free of clouds, the morning star shines, glows, and radiates in the early dawn; even so, when the praise of Venerable Sāriputta was being spoken, Susima the devaputta's assembly of devaputtas, delighted, joyful, and filled with rapture and gladness, displayed various splendid hues.\n\nJust as, in the autumn season when the sky is clear and free of clouds, the sun, rising in the sky, dispelling all darkness present in the sky, shines, glows, and radiates; even so, when the praise of Venerable Sāriputta was being spoken, Susima the devaputta's assembly of devaputtas, delighted, joyful, and filled with rapture and gladness, displayed various splendid hues.\n\nThen Susima the devaputta, referring to Venerable Sāriputta, spoke this verse in the presence of the Blessed One:\n“Renowned as a wise one, Sāriputta is free from anger;\nOf few wishes, gentle, and disciplined, a sage who bears the praise of the Teacher.”\n\nThen the Blessed One, referring to Venerable Sāriputta, replied to Susima the devaputta with a verse:\n“Renowned as a wise one, Sāriputta is free from anger;\nOf few wishes, gentle, and disciplined, the utterly disciplined one awaits the opportune moment.”",
      "sinhala": "නිදානය සැවැත්නුවරදීය. එකල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූහ. එක් පසෙකින් වැඩහුන් ආයුෂ්මත් ආනන්ද තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ආනන්ද, නුඹටත් ශාරීපුත්‍ර හිමියන් රුචි වෙත්දැ”යි? “භාග්‍යවතුන් වහන්ස, අඥාන නො වූ, ද්වේෂ නො වූ, මුළා නො වූ, විපරීත සිතක් නැති කාහට නම් ආයුෂ්මත් ශාරීපුත්‍ර හිමියන් රුචි නො වේද? භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ පණ්ඩිතයහ. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ මහා ප්‍රාඥයහ. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ ගැඹුරු ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ විහිදුණු ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ ඉක්මන් ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ තියුණු ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ විනිවිදින ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ අල්පේච්ඡයහ. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ සන්තුෂ්ටයහ. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ නිසල වූවෝය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ අසංසර්ගයහ. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ වීර්යය අරඹා වැඩ සිටින්නෝය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ අවවාද දෙන සුලුය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ අවවාද ඉවසන සුලුය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ චෝදනා කරන්නෝය. භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ පව් හෙළා දකින්නෝය. භාග්‍යවතුන් වහන්ස, අඥාන නො වූ, ද්වේෂ නො වූ, මුළා නො වූ, විපරීත සිතක් නැති කාහට නම් ආයුෂ්මත් ශාරීපුත්‍ර හිමියන් රුචි නො වේද?”\n\n“ආනන්ද, එය එසේමය, ආනන්ද, එය එසේමය! ආනන්ද, අඥාන නො වූ, ද්වේෂ නො වූ, මුළා නො වූ, විපරීත සිතක් නැති කාහට නම් ශාරීපුත්‍ර හිමියන් රුචි නො වේද? ආනන්ද, ශාරීපුත්‍ර හිමියෝ පණ්ඩිතයහ. ආනන්ද, ශාරීපුත්‍ර හිමියෝ මහා ප්‍රාඥයහ. ආනන්ද, ශාරීපුත්‍ර හිමියෝ ගැඹුරු ප්‍රඥා ඇත්තෝය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ විහිදුණු ප්‍රඥා ඇත්තෝය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ ඉක්මන් ප්‍රඥා ඇත්තෝය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ තියුණු ප්‍රඥා ඇත්තෝය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ විනිවිදින ප්‍රඥා ඇත්තෝය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ අල්පේච්ඡයහ. ආනන්ද, ශාරීපුත්‍ර හිමියෝ සන්තුෂ්ටයහ. ආනන්ද, ශාරීපුත්‍ර හිමියෝ නිසල වූවෝය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ අසංසර්ගයහ. ආනන්ද, ශාරීපුත්‍ර හිමියෝ වීර්යය අරඹා වැඩ සිටින්නෝය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ අවවාද දෙන සුලුය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ අවවාද ඉවසන සුලුය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ චෝදනා කරන්නෝය. ආනන්ද, ශාරීපුත්‍ර හිමියෝ පව් හෙළා දකින්නෝය. ආනන්ද, අඥාන නො වූ, ද්වේෂ නො වූ, මුළා නො වූ, විපරීත සිතක් නැති කාහට නම් ශාරීපුත්‍ර හිමියන් රුචි නො වේද?”\n\nඑකල්හි සුසිම නම් දෙව්පුත් තෙමේ, ආයුෂ්මත් ශාරීපුත්‍ර හිමියන්ගේ ගුණ කථාව කියන කල්හි, මහා දෙව්පුත් පිරිසක් පිරිවරා භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් සිටියේය. එක් පසෙකින් සිටි සුසිම දෙව්පුත් තෙමේ භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භාග්‍යවතුන් වහන්ස, එය එසේමය. සුගතයන් වහන්ස, එය එසේමය. භාග්‍යවතුන් වහන්ස, අඥාන නො වූ, ද්වේෂ නො වූ, මුළා නො වූ, විපරීත සිතක් නැති කාහට නම් ආයුෂ්මත් ශාරීපුත්‍ර හිමියන් රුචි නො වේද? භාග්‍යවතුන් වහන්ස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ පණ්ඩිතයහ. භාග්‍යවතුන් වහන්ස, මහා ප්‍රාඥයහ. භාග්‍යවතුන් වහන්ස, ගැඹුරු ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, විහිදුණු ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, ඉක්මන් ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, තියුණු ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, විනිවිදින ප්‍රඥා ඇත්තෝය. භාග්‍යවතුන් වහන්ස, අල්පේච්ඡයහ. භාග්‍යවතුන් වහන්ස, සන්තුෂ්ටයහ. භාග්‍යවතුන් වහන්ස, නිසල වූවෝය. භාග්‍යවතුන් වහන්ස, අසංසර්ගයහ. භාග්‍යවතුන් වහන්ස, වීර්යය අරඹා වැඩ සිටින්නෝය. භාග්‍යවතුන් වහන්ස, අවවාද දෙන සුලුය. භාග්‍යවතුන් වහන්ස, අවවාද ඉවසන සුලුය. භාග්‍යවතුන් වහන්ස, චෝදනා කරන්නෝය. භාග්‍යවතුන් වහන්ස, පව් හෙළා දකින්නෝය, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝය. භාග්‍යවතුන් වහන්ස, අඥාන නො වූ, ද්වේෂ නො වූ, මුළා නො වූ, විපරීත සිතක් නැති කාහට නම් ආයුෂ්මත් ශාරීපුත්‍ර හිමියන් රුචි නො වේද?\n\n“භාග්‍යවතුන් වහන්ස, යම් යම් දෙව්පුත් පිරිසකට මා එළඹෙන්නෙම්ද, ඒ ඒ තැන්හිදී මම මේ බහුල වූ ශබ්දය අසමි – ‘ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ පණ්ඩිතයහ; ආයුෂ්මත් හිමියෝ මහා ප්‍රාඥයහ, ආයුෂ්මත් හිමියෝ ගැඹුරු ප්‍රඥා ඇත්තෝය, ආයුෂ්මත් හිමියෝ විහිදුණු ප්‍රඥා ඇත්තෝය, ආයුෂ්මත් හිමියෝ ඉක්මන් ප්‍රඥා ඇත්තෝය, ආයුෂ්මත් හිමියෝ තියුණු ප්‍රඥා ඇත්තෝය, ආයුෂ්මත් හිමියෝ විනිවිදින ප්‍රඥා ඇත්තෝය, ආයුෂ්මත් හිමියෝ අල්පේච්ඡයහ, ආයුෂ්මත් හිමියෝ සන්තුෂ්ටයහ, ආයුෂ්මත් හිමියෝ නිසල වූවෝය, ආයුෂ්මත් හිමියෝ අසංසර්ගයහ, ආයුෂ්මත් හිමියෝ වීර්යය අරඹා වැඩ සිටින්නෝය, ආයුෂ්මත් හිමියෝ අවවාද දෙන සුලුය, ආයුෂ්මත් හිමියෝ අවවාද ඉවසන සුලුය, ආයුෂ්මත් හිමියෝ චෝදනා කරන්නෝය, ආයුෂ්මත් ශාරීපුත්‍ර හිමියෝ පව් හෙළා දකින්නෝය’ යනුවෙනි. භාග්‍යවතුන් වහන්ස, අඥාන නො වූ, ද්වේෂ නො වූ, මුළා නො වූ, විපරීත සිතක් නැති කාහට නම් ආයුෂ්මත් ශාරීපුත්‍ර හිමියන් රුචි නො වේද?”\n\nඑකල්හි සුසිම දෙව්පුතුගේ දෙව්පුත් පිරිස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියන්ගේ ගුණ කථාව කියන කල්හි, සතුටු වූවාහු, ප්‍රීතියට පත් වූවාහු, ප්‍රීති-සෝමනස්ස උපදවා ගත්තාහු, නොයෙක් විසිතුරු වූ වර්ණ නිභා දක්වන්නට වූහ.\n\nයම් සේ අටපට්ටම් කොට මැනවින් ඔප දමා, පිරිසිදු, ජාති මාණික්‍යයක් (වෛදූර්යය මාණික්‍යයක්) කහපාට කම්බලයක් මත තැබූ කල්හි බබළන්නේද, දිදුලන්නේද, ප්‍රකාශවත් වන්නේද; එසේම සුසිම දෙව්පුතුගේ දෙව්පුත් පිරිස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියන්ගේ ගුණ කථාව කියන කල්හි, සතුටු වූවාහු, ප්‍රීතියට පත් වූවාහු, ප්‍රීති-සෝමනස්ස උපදවා ගත්තාහු, නොයෙක් විසිතුරු වූ වර්ණ නිභා දක්වන්නට වූහ.\n\nයම් සේ දක්ෂ කර්මාන්ත ශිල්පියෙකුගේ පුත්‍රයෙකු විසින් උදුනක තබා මැනවින් මදින ලද, ජම්බුනම් ගංගා රනින් තැනූ, රන් ආභරණයක් කහපාට කම්බලයක් මත තැබූ කල්හි බබළන්නේද, දිදුලන්නේද, ප්‍රකාශවත් වන්නේද; එසේම සුසිම දෙව්පුතුගේ දෙව්පුත් පිරිස, ආයුෂ්මත් ශාරීපුත්‍ර හිමියන්ගේ ගුණ කථාව කියන කල්හි, සතුටු වූවාහු, ප්‍රීතියට පත් වූවාහු, ප්‍රීති-සෝමනස්ස උපදවා ගත්තාහු, නොයෙක් විසිතුරු වූ වර්ණ නිභා දක්වන්නට වූහ.\n\nයම්සේ සරත් සමයෙහි වලාකුළු නැති, අහස නිමල වූ කල්හි රාත්‍රී ප්‍රත්‍යූෂ සමයෙහි ඖෂධී තාරකාව බබළන්නේ ද, තපින්නේ ද, ප්‍රබෝධවත් වන්නේ ද; එපරිද්දෙන්ම සුසිම නම් දෙව්පුත්හට අයත් දෙව්පුත් පිරිස ආයුෂ්මත් ශාරිපුත්තයන් වහන්සේගේ ගුණ වර්ණනා කරන කල්හි සතුටු සිත් ඇත්තාහු, ප්‍රීතියට පත් වූවාහු, ප්‍රීති සෝමනස්සයෙන් යුක්ත වූවාහු උස් පහත් නොයෙක් වර්ණ විලාසයන් දක්වති.\n\nයම්සේ සරත් සමයෙහි වලාකුළු නැති, අහස නිමල වූ කල්හි සූර්යයා අහසට නැඟෙන්නේ අහස්ගත වූ සියලු අන්ධකාරය දුරු කොට බබළන්නේ ද, තපින්නේ ද, ප්‍රබෝධවත් වන්නේ ද; එපරිද්දෙන්ම සුසිම නම් දෙව්පුත්හට අයත් දෙව්පුත් පිරිස ආයුෂ්මත් ශාරිපුත්තයන් වහන්සේගේ ගුණ වර්ණනා කරන කල්හි සතුටු සිත් ඇත්තාහු, ප්‍රීතියට පත් වූවාහු, ප්‍රීති සෝමනස්සයෙන් යුක්ත වූවාහු උස් පහත් නොයෙක් වර්ණ විලාසයන් දක්වති.\n\nඉන්පසු සුසිම නම් දෙව්පුත් ආයුෂ්මත් ශාරිපුත්තයන් වහන්සේ අරභයා භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව ප්‍රකාශ කළේය:\n“පණ්ඩිත යැයි ප්‍රකට වූ, සාරිපුත්ත තෙම කිපීමක් නැත්තෙකි. අල්පේච්ඡය, යහපත් ගති ඇත්තෙක, දමනය වූවෙක, ශාස්තෘන් වහන්සේගේ ගුණ වර්ණනාව දරා සිටින ඍෂිවරයෙක.”\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් ශාරිපුත්තයන් වහන්සේ අරභයා සුසිම නම් දෙව්පුත්හට ගාථාවකින් පිළිවදන් දුන් සේක:\n“පණ්ඩිත යැයි ප්‍රකට වූ, සාරිපුත්ත තෙම කිපීමක් නැත්තෙකි. අල්පේච්ඡය, යහපත් ගති ඇත්තෙක, දමනය වූවෙක, මැනවින් දමනය වූ හෙතෙම, (සියලු සංස්කාරයන්හි අවසානය වූ) කාලය බලාපොරොත්තු වෙයි.”",
      "paliTitle": "Susimasuttaṃ",
      "englishTitle": "The Discourse to Susima",
      "sinhalaTitle": "සුසිම සූත්‍රය"
    },
    {
      "number": 111,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Atha kho sambahulā nānātitthiyasāvakā devaputtā asamo ca sahali [sahalī (sī. syā. kaṃ. pī.)] ca nīko [niṅko (sī. pī.), niko (syā. kaṃ.)] ca ākoṭako ca vegabbhari ca [veṭambarī ca (sī. syā. kaṃ. pī.)] māṇavagāmiyo ca abhikkantāya rattiyā abhikkantavaṇṇā kevalakappaṃ veḷuvanaṃ obhāsetvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhito kho asamo devaputto pūraṇaṃ kassapaṃ ārabbha bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Idha chinditamārite, hatajānīsu kassapo; Na pāpaṃ samanupassati, puññaṃ vā pana attano; Sa ve vissāsamācikkhi, satthā arahati mānana’’nti. Atha kho sahali devaputto makkhaliṃ gosālaṃ ārabbha bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Tapojigucchāya susaṃvutatto, Vācaṃ pahāya kalahaṃ janena; Samosavajjā virato saccavādī, Na hi nūna tādisaṃ karoti [na ha nuna tādī pakaroti (sī. syā. kaṃ.)] pāpa’’nti. Atha kho nīko devaputto nigaṇṭhaṃ nāṭaputtaṃ [nāthaputtaṃ (sī.)] ārabbha bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Jegucchī nipako bhikkhu, cātuyāmasusaṃvuto; Diṭṭhaṃ sutañca ācikkhaṃ, na hi nūna kibbisī siyā’’ti. Atha kho ākoṭako devaputto nānātitthiye ārabbha bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Pakudhako kātiyāno nigaṇṭho, Ye cāpime makkhalipūraṇāse; Gaṇassa satthāro sāmaññappattā, Na hi nūna te sappurisehi dūre’’ti. Atha kho vegabbhari devaputto ākoṭakaṃ devaputtaṃ gāthāya paccabhāsi – ‘‘Sahācaritena [sahāravenāpi (ka. sī.), sagāravenāpi (pī.)] chavo sigālo [siṅgālo (ka.)], Na kotthuko sīhasamo kadāci; Naggo musāvādī gaṇassa satthā, Saṅkassarācāro na sataṃ sarikkho’’ti. Atha kho māro pāpimā begabbhariṃ devaputtaṃ anvāvisitvā bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Tapojigucchāya āyuttā, pālayaṃ pavivekiyaṃ; Rūpe ca ye niviṭṭhāse, devalokābhinandino; Te ve sammānusāsanti, paralokāya mātiyā’’ti. Atha kho bhagavā, ‘māro ayaṃ pāpimā’ iti viditvā, māraṃ pāpimantaṃ gāthāya paccabhāsi – ‘‘Ye keci rūpā idha vā huraṃ vā, Ye cantalikkhasmiṃ pabhāsavaṇṇā; Sabbeva te te namucippasatthā, Āmisaṃva macchānaṃ vadhāya khittā’’ti. Atha kho māṇavagāmiyo devaputto bhagavantaṃ ārabbha bhagavato santike imā gāthāyo abhāsi – ‘‘Vipulo rājagahīyānaṃ, giriseṭṭho pavuccati; Seto himavataṃ seṭṭho, ādicco aghagāminaṃ. ‘‘Samuddo udadhinaṃ seṭṭho, nakkhattānañca candimā [nakkhattānaṃva candimā (ka.)]; Sadevakassa lokassa, buddho aggo pavuccatī’’ti. Nānātitthiyavaggo tatiyo. Tassuddānaṃ – Sivo khemo ca serī ca, ghaṭī jantu ca rohito; Nando nandivisālo ca, susimo nānātitthiyena te dasāti. ",
      "english": "Thus have I heard – on one occasion the Blessed One was dwelling in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. Then, when the night was far advanced, many deities who were disciples of various other teachers, namely Asama, Sahali, Nīko, Ākoṭako, Vegabbhari, and Māṇavagāmiyo, having illuminated the entire Bamboo Grove with their resplendent beauty, approached the Blessed One. Having approached, they respectfully saluted the Blessed One and stood to one side.\n\nStanding to one side, the deity Asama spoke this verse in the presence of the Blessed One, concerning Pūraṇa Kassapa: “Here, Pūraṇa Kassapa, concerning those who cut and kill, and those who cause harm, does not perceive any evil, nor any merit in himself. Indeed, he proclaimed with confidence that a teacher such as he deserves honor.”\n\nThen the deity Sahali spoke this verse in the presence of the Blessed One, concerning Makkhali Gosāla: “With a body well restrained through asceticism and self-mortification, having abandoned quarrels with people, refrained from all blame, and being a speaker of truth – such a one surely does no evil.”\n\nThen the deity Nīko spoke this verse in the presence of the Blessed One, concerning Nigaṇṭha Nāṭaputta: “A scrupulous, clever monk, well-restrained by the fourfold discipline, and proclaiming what he has seen and heard – surely such a one would not be an offender.”\n\nThen the deity Ākoṭako spoke this verse in the presence of the Blessed One, concerning the various other teachers: “Pakudha Kātyāyana, Nigaṇṭha Nāṭaputta, and also Makkhali Gosāla and Pūraṇa Kassapa – these teachers of their respective assemblies, who have attained reclusehood, are surely not far from the truly good ones.”\n\nThen the deity Vegabbhari retorted to the deity Ākoṭako with a verse: “A contemptible jackal, by companionship, is never equal to a lion. A naked liar, a teacher of an assembly, whose conduct is dubious, is not comparable to the good.”\n\nThen Māra, the Evil One, possessing the deity Vegabbhari, spoke this verse in the presence of the Blessed One: “Those who are diligent in asceticism and self-mortification, guarding solitude, and those who are devoted to forms, delighting in the divine realms – they truly teach correctly concerning the perception of the next world.”\n\nThen the Blessed One, understanding ‘This is Māra, the Evil One,’ retorted to Māra, the Evil One, with a verse: “Whatever forms there are, here or beyond, and those radiant forms in the sky – all of them are praised by you, Namuci, but they are thrown out like bait for the destruction of fish.”\n\nThen the deity Māṇavagāmiyo spoke these verses in the presence of the Blessed One, concerning the Blessed One: “Vipula is called the foremost of the Rājagahan mountains; Mount Seta is the foremost of the Himalayas; the sun is the foremost among those who traverse the sky. The ocean is the foremost of waters; the moon is the foremost of constellations. So too, the Buddha is proclaimed as the foremost of the world with its deities.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දක නිවාපයේ වැඩවසන සේක.\n\nඉන්පසු, සමහර නානාතිර්ථිකයන්ගේ ශ්‍රාවක වූ දෙවිවරුන් වන අසම, සහළි, නීක, ආකෝටක, වේගබ්භරි සහ මානවගාමිය යන දෙවිවරු බොහෝ දෙනෙක් රෑ අලුයම වන විට අතිශය මනහර පැහැයෙන් යුක්තව මුළු වේළුවනම ආලෝකමත් කරමින් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනාමාන කොට එකත්පස්ව සිටියහ.\n\nඑකත්පස්ව සිටි අසම නම් දෙවියා පූරණ කස්සප ගැන අරභයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය:\n“මෙලොව කැපීමෙහි ද, මැරීමෙහි ද, ජීවිත විනාශ කිරීමෙහි ද (යෙදෙන තැනැත්තාට) තමාගේ පාපයක් හෝ පුණ්‍යයක් හෝ ඇති වන බව පූරණ කස්සප නොදකියි. ඔහු විශ්වාසයෙන් ප්‍රකාශ කරයි. (එබඳු) ශාස්තෘවරයෙක් පිදිය යුතු වේ.”\n\nඉන්පසු සහළි නම් දෙවියා මක්ඛලි ගෝසාල ගැන අරභයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය:\n“තපස්වලින් ද, පව්කම් කෙරෙහි පිළිකුලෙන් ද මනාකොට සංවර වූ කය ඇත්තා වූ, මිනිසුන් සමඟ කතාවෙන් වන කලකෝලාහල අත්හැරියා වූ, සියලු වැරදිවලින් වෙන් වූ සත්‍යවාදී වූ එබඳු කෙනෙක් සැබවින්ම පවක් නොකරන්නේය.”\n\nඉන්පසු නීක නම් දෙවියා නිගණ්ඨනාතපුත්ත ගැන අරභයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය:\n“පව්කම් කෙරෙහි පිළිකුල ඇති, ප්‍රඥාවන්ත, සිව්වැදෑරුම් සංවරයෙන් (සීතල, උණුසුම, කුසගින්න, පිපාසය යන සතර දුරලීමෙන්) මනාකොට සංවර වූ භික්ෂුව, තමා දුටු දේ ද, ඇසූ දේ ද ප්‍රකාශ කරන්නේ නම් සැබවින්ම ඔහු පව් ඇත්තෙකු නොවන්නේය.”\n\nඉන්පසු ආකෝටක නම් දෙවියා නානාතිර්ථිකයන් ගැන අරභයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය:\n“පකුධ කාත්‍යායන ද, නිගණ්ඨනාතපුත්ත ද, මක්ඛලි ද, පූරණ කස්සප ද යන මොවුන් තමන්ගේ ගණයට (සමූහයට) ශාස්තෘවරුන් වී ශ්‍රමණභාවය ලබා සිටිති. සැබවින්ම ඔවුහු සත්පුරුෂයන්ගෙන් දුරස් නොවේ.”\n\nඉන්පසු වේගබ්භරි නම් දෙවියා ආකෝටක දෙවියාට ගාථාවකින් පිළිතුරු දුන්නේය:\n“එකට විසීමෙන්, කුණප අනුභව කරන්නා වූ හිවලා කිසි කලෙකත් සිංහයකු හා සමාන නොවන්නේය. එසේම නග්න වූ, බොරු කියන්නා වූ, ගණයක ශාස්තෘවරයෙක් වන, සැක සහිත හැසිරීම් ඇති කෙනෙක් සත්පුරුෂයන් හා සමාන නොවන්නේය.”\n\nඉන්පසු පාපී මාරයා වේගබ්භරි නම් දෙවියාට ආවිෂ්ට වී, භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය:\n“තපස්වලින් ද, පව්කම් කෙරෙහි පිළිකුලෙන් ද යුක්ත වූ, විවේකය ආරක්ෂා කරන්නා වූ යම් කෙනෙක් වේ ද, රූප (රූපාවචර ධ්‍යාන) කෙරෙහි ඇලී සිටින්නා වූ, දෙව්ලොවෙහි සතුටු වන්නා වූ, ඔවුහු සැබවින්ම පරලොව යහපත පිණිස මනාකොට අනුශාසනා කරති.”\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ, “මෙය පාපී මාරයාය” යි දැන, පාපී මාරයාට ගාථාවකින් මෙසේ පිළිතුරු දුන් සේක:\n“මේ ලෝකයේ හෝ පරලොවේ හෝ යම් කිසි රූපයක් (ද්‍රව්‍යමය දෙයක්) වේ ද, අහසේ බැබළෙන පැහැපත් යම් රූපයක් වේ ද, ඒ සියල්ල තෝ, නමුචි (මාරයා) විසින් ප්‍රශංසා කරන ලද්දාහුය. ඒවා මාළුන්ගේ විනාශය පිණිස දැමූ බිලී අගුලක් මෙනි.”\n\nඉන්පසු මානවගාමිය නම් දෙවියා භාග්‍යවතුන් වහන්සේ අරභයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථා ප්‍රකාශ කළේය:\n“රජගහ වැසියන්ට විපුල පර්වතය, පර්වතයන් අතර ශ්‍රේෂ්ඨ යැයි කියනු ලැබේ. හිමාලයට සේත පර්වතය ශ්‍රේෂ්ඨ ය. අහසේ ගමන් කරන්නන් අතර හිරු ශ්‍රේෂ්ඨ ය.\nසමුද්‍රය ජලධාරාවන් අතර ශ්‍රේෂ්ඨ ය. තාරකා අතර සඳ ශ්‍රේෂ්ඨ ය. දෙවියන් සහිත ලෝකයට බුදුරජාණන් වහන්සේ අග්‍ර යැයි කියනු ලැබේ.”\n\nනානාතිර්ථික වර්ගය තෙවැන්න යි.\nඑහි උද්දානය මෙසේ ය: සිව, ඛේම, සේරී, ඝටී, ජන්තු, රෝහිත, නන්ද, නන්දිවිසාල, සුසිම යන මේ සූත්‍ර නානාතිර්ථික සූත්‍රය සමඟ දහයකි.",
      "paliTitle": "Nānātitthiyasāvakasuttaṃ",
      "englishTitle": "Disciples of Various Sectarians Sutta",
      "sinhalaTitle": "නානාතිත්ථියසාවක සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Devaputtasaṃyuttaṃ samattaṃ.",
    "english": "The Linked Discourses with Sons of Devas is complete.",
    "sinhala": "දේවපුත්ත සංයුක්තය සමාප්තයි."
  }
}