{
  "id": "sn.1.5",
  "title": {
    "pali": "Bhikkhunīsaṃyuttaṃ",
    "english": "The Connected Discourses with the Nuns",
    "sinhala": "භික්ෂුණීසංයුත්තය"
  },
  "sections": [
    {
      "number": 162,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āḷavikā bhikkhunī pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena andhavanaṃ tenupasaṅkami vivekatthinī. Atha kho māro pāpimā āḷavikāya bhikkhuniyā bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo vivekamhā cāvetukāmo yena āḷavikā bhikkhunī tenupasaṅkami; upasaṅkamitvā āḷavikaṃ bhikkhuniṃ gāthāya ajjhabhāsi – ‘‘Natthi nissaraṇaṃ loke, kiṃ vivekena kāhasi; Bhuñjassu kāmaratiyo, māhu pacchānutāpinī’’ti. Atha kho āḷavikāya bhikkhuniyā etadahosi – ‘‘ko nu khvāyaṃ manusso vā amanusso vā gāthaṃ bhāsatī’’ti? Atha kho āḷavikāya bhikkhuniyā etadahosi – ‘‘māro kho ayaṃ pāpimā mama bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo vivekamhā cāvetukāmo gāthaṃ bhāsatī’’ti. Atha kho āḷavikā bhikkhunī ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi paccabhāsi – ‘‘Atthi nissaraṇaṃ loke, paññāya me suphussitaṃ [suphassitaṃ (sī. pī.)]; Pamattabandhu pāpima, na tvaṃ jānāsi taṃ padaṃ. ‘‘Sattisūlūpamā kāmā, khandhāsaṃ adhikuṭṭanā; Yaṃ tvaṃ kāmaratiṃ brūsi, arati mayha sā ahū’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ āḷavikā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. Then, in the early morning, the bhikkhunī Āḷavikā dressed, took her bowl and robe, and entered Sāvatthī for alms. Having wandered for alms in Sāvatthī, and after her meal, having returned from her alms round, she approached the Blind Grove, being one who yearned for solitude.\n\nThen Māra, the Evil One, wishing to arouse fear, terror, and hair-raising fright in the bhikkhunī Āḷavikā, wishing to dislodge her from her seclusion, approached the bhikkhunī Āḷavikā. Having approached, he addressed the bhikkhunī Āḷavikā with a verse: \"There is no liberation in the world; what will you achieve with seclusion? Enjoy sensual pleasures, lest you become regretful later.\"\n\nThen it occurred to the bhikkhunī Āḷavikā: \"Who indeed is this, a human or a non-human, reciting this verse?\" Then it occurred to the bhikkhunī Āḷavikā: \"This is Māra, the Evil One, who is reciting this verse, wishing to arouse fear, terror, and hair-raising fright in me, and wishing to dislodge me from my seclusion.\"\n\nThen the bhikkhunī Āḷavikā, having understood, \"This is Māra, the Evil One,\" replied to Māra, the Evil One, with verses: \"There is indeed liberation in the world; it has been well-experienced by me through wisdom. O Evil One, companion of the heedless, you do not know that state. Sensual pleasures are like a spear and a stake; and the aggregates are a crushing torment. What you call delight in sensuality—that was a source of displeasure for me.\"\n\nThen Māra, the Evil One, thinking, \"The bhikkhunī Āḷavikā knows me,\" unhappy and dejected, vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් ආරාමයෙහි අනේපිඬු සිටුහුගේ අරම්හි වැඩවසන සේක.\n\nඑකල්හි ආළවිකා භික්ෂුණිය පෙරවරුයෙහි හැඳ, පාත්‍ර සිවුරු ගෙන, සැවැත් නුවරට පිඬු සිඟා පිවිසියහ. සැවැත් නුවර පිඬු සිඟා හැසිර, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් ආපසු පැමිණ, විවේකය කැමැති වූවා අන්ධවනය තිබුණු තැනට පැමිණියාය. එකල්හි පාපී මාරයා ආළවිකා භික්ෂුණියට බිය, තැතිගැන්ම, ලොමුදැහැගැන්ම (ලොමුදහන්වීම) උපදවනු කැමතිව, විවේකයෙන් (මාර්ග ඵලයෙන්) ඉවත් කරනු කැමතිව, ආළවිකා භික්ෂුණිය සිටි තැනට පැමිණියේය. පැමිණ, ආළවිකා භික්ෂුණියට ගාථාවකින් මෙසේ කීය:\n\n“ලෝකයෙහි නිස්සරණයක් (මිදීමක්) නැත. විවේකයෙන් කුමක් කරන්නේද? කාමරති (කාමසංතුෂ්ටිය) විඳින්න. පසුව පසුතැවෙන්නියක් නොවන්න.”\n\nඑකල්හි ආළවිකා භික්ෂුණියට මෙසේ සිතුණි – “මිනිසෙක්ද, අමනුෂ්‍යයෙක්ද, කවරෙක් මේ ගාථාව කියන්නේ?” එකල්හි ආළවිකා භික්ෂුණියට මෙසේ සිතුණි – “මෙය පාපී මාරයාය. මට බිය, තැතිගැන්ම, ලොමුදහන්වීම උපදවනු කැමතිව, විවේකයෙන් (මාර්ගඵලයෙන්) ඉවත් කරනු කැමතිව මේ ගාථාව කියන්නේය.”\n\nඑකල්හි ආළවිකා භික්ෂුණිය, “මෙය පාපී මාරයා” යයි දැන, පාපී මාරයාට ගාථාවලින් මෙසේ පිළිවදන් දුන්නාය:\n\n“ලෝකයෙහි නිස්සරණයක් (මිදීමක්) ඇත. එය ම විසින් ප්‍රඥාවෙන් මනාව අවබෝධ කරන ලද්දකි. ප්‍රමාදීන්ගේ නෑයා වූ පාපී මාරය, නුඹ ඒ නිවන නාඳුනන්නෙහිය.\n\nකාමයෝ කඩු හෙල්ලයන් බඳුය. ස්කන්ධයෝ පීඩාවට පත්කරන්නෝය. යමක් නුඹ කාමරතිය යැයි කියන්නෙහිද, එය මට අරතියක් (අසතුටක්/විරතියක්) විය.”\n\nඑකල්හි පාපී මාරයා “ආළවිකා භික්ෂුණිය මා හඳුනන්නීය” යි දුකට පත්ව, දොම්නස්ව, එතනම අතුරුදන් විය.",
      "paliTitle": "Āḷavikāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to the Nun Āḷavikā",
      "sinhalaTitle": "ආළවිකා සූත්‍රය"
    },
    {
      "number": 163,
      "pali": "Sāvatthinidānaṃ. Atha kho somā bhikkhunī pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena andhavanaṃ tenupasaṅkami divāvihārāya. Andhavanaṃ ajjhogāhetvā aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho māro pāpimā somāya bhikkhuniyā bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo yena somā bhikkhunī tenupasaṅkami; upasaṅkamitvā somaṃ bhikkhuniṃ gāthāya ajjhabhāsi – ‘‘Yaṃ taṃ isīhi pattabbaṃ, ṭhānaṃ durabhisambhavaṃ; Na taṃ dvaṅgulapaññāya, sakkā pappotumitthiyā’’ti. Atha kho somāya bhikkhuniyā etadahosi – ‘‘ko nu khvāyaṃ manusso vā amanusso vā gāthaṃ bhāsatī’’ti? Atha kho somāya bhikkhuniyā etadahosi – ‘‘māro kho ayaṃ pāpimā mama bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo gāthaṃ bhāsatī’’ti. Atha kho somā bhikkhunī ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi paccabhāsi – ‘‘Itthibhāvo kiṃ kayirā, cittamhi susamāhite; Ñāṇamhi vattamānamhi, sammā dhammaṃ vipassato. ‘‘Yassa nūna siyā evaṃ, itthāhaṃ purisoti vā; Kiñci vā pana aññasmi [asmīti (syā. kaṃ. pī.)], taṃ māro vattumarahatī’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ somā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "The occasion at Sāvatthī.\n\nThen, in the forenoon, the bhikkhuni Somā, having dressed and taken her bowl and robes, entered Sāvatthī for alms. Having wandered for alms in Sāvatthī and returned from her alms round after her meal, she approached Andhavana to dwell there for the day. Having entered Andhavana, she sat down at the foot of a certain tree for her day's abiding.\n\nThen Māra the Evil One, wishing to produce fear, terror, and horripilation in the bhikkhuni Somā, and wishing to dislodge her from concentration, approached her. Having approached, he addressed the bhikkhuni Somā with this verse:\n\"That state, difficult to achieve, which is to be attained by seers, cannot be attained by a woman with her two-fingered wisdom.\"\n\nThen this thought occurred to the bhikkhuni Somā: \"Who indeed is this, human or non-human, who recites this verse?\" Then this thought occurred to the bhikkhuni Somā: \"This is indeed Māra the Evil One, wishing to produce fear, terror, and horripilation in me, and wishing to dislodge me from concentration, who recites this verse.\"\n\nThen the bhikkhuni Somā, knowing, \"This is Māra the Evil One,\" responded to Māra the Evil One with verses:\n\"What can the state of being a woman do when the mind is well-concentrated, and knowledge is present, while one rightly discerns the Dhamma?\nWhoever indeed would think, 'I am a woman' or 'I am a man,' or 'I am something else,' it is that one whom Māra is fit to address.\"\n\nThen Māra the Evil One, distressed and dejected, thinking, \"The bhikkhuni Somā knows me,\" vanished right there.",
      "sinhala": "සැවැත්නුවරදීය.\n\nඉක්බිති සෝමා භික්ෂුණිය පෙරවරුවෙහි සිවුරු පොරවා පාත්‍ර සිවුරු රැගෙන සැවැත්නුවරට පිඬු සිඟා පිවිසියහ. සැවැත්නුවර පිඬු සිඟා වළඳා, දහවල් විහරණය පිණිස අන්ධවන නම් වනය කරා එළඹියහ. අන්ධවන වනයට ඇතුළු වී, එක්තරා ගසක් මුල දහවල් විහරණය පිණිස වැඩ සිටියහ. ඉක්බිති පාපී මාරයා, සෝමා භික්ෂුණියට බිය, තැතිගැනීම සහ ලොමුදැහැගැන්වීම උපදවන්නටත්, සමාධියෙන් මුදවන්නටත් කැමතිව, සෝමා භික්ෂුණිය වැඩ සිටි තැනට එළඹියේය; එළඹ, සෝමා භික්ෂුණියට මේ ගාථාවෙන් කීවේය: \"යම් ඒ දුලබ, ඍෂීන් විසින් පැමිණිය යුතු නිවන, එය අඟල් දෙකක (වැනි සීමිත) ප්‍රඥාව ඇති ස්ත්‍රියකට ලබාගත නොහැක.\"\n\nඉක්බිති සෝමා භික්ෂුණියට මෙසේ සිතුණි: \"මේ කවරෙක්ද, මිනිසෙක්ද, අමනුෂ්‍යයෙක්ද, මේ ගාථාව කියන්නේ?\" ඉක්බිති සෝමා භික්ෂුණියට මෙසේ සිතුණි: \"මා තුළ බිය, තැතිගැනීම සහ ලොමුදැහැගැන්වීම උපදවන්නටත්, සමාධියෙන් මුදවන්නටත් කැමතිව, මේ පාපී මාරයාමයි ගාථාව කියන්නේ.\" ඉක්බිති සෝමා භික්ෂුණිය \"මේ පාපී මාරයායි\" යැයි දැනගෙන, පාපී මාරයාට ගාථා වලින් පිළිතුරු දුන්නාය: \"සිත් මැනවින් සමාධිගත වූ විට, ප්‍රඥාව ක්‍රියාත්මක වන විට, ධර්මය මැනවින් විදර්ශනා කරන කෙනෙකුට ස්ත්‍රී භාවය කුමක් කරන්නේද? යමෙකුට 'මම ස්ත්‍රියක්මි' හෝ 'මම පුරුෂයෙක්මි' යැයි හෝ වෙන යම් 'මම වෙමි' යන දෘෂ්ටියක් ඇත්නම්, ඔහුට මාරයාට කතා කළ හැකිය.\"\n\nඉක්බිති පාපී මාරයා, \"සෝමා භික්ෂුණිය මා හඳුනාගත්තායැ\"යි සිතා, දුකින් හා කලකිරුණු සිතින් යුතුව එතැනම අතුරුදහන් විය.",
      "paliTitle": "Somāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Somā",
      "sinhalaTitle": "සෝමා සූත්‍රය"
    },
    {
      "number": 164,
      "pali": "Sāvatthinidānaṃ. Atha kho kisāgotamī bhikkhunī pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena andhavanaṃ tenupasaṅkami, divāvihārāya. Andhavanaṃ ajjhogāhetvā aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho māro pāpimā kisāgotamiyā bhikkhuniyā bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo yena kisāgotamī bhikkhunī tenupasaṅkami; upasaṅkamitvā kisāgotamiṃ bhikkhuniṃ gāthāya ajjhabhāsi – ‘‘Kiṃ nu tvaṃ mataputtāva, ekamāsi rudammukhī; Vanamajjhagatā ekā, purisaṃ nu gavesasī’’ti. Atha kho kisāgotamiyā bhikkhuniyā etadahosi – ‘‘ko nu khvāyaṃ manusso vā amanusso vā gāthaṃ bhāsatī’’ti? Atha kho kisāgotamiyā bhikkhuniyā etadahosi – ‘‘māro kho ayaṃ pāpimā mama bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo gāthaṃ bhāsatī’’ti. Atha kho kisāgotamī bhikkhunī ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi paccabhāsi – ‘‘Accantaṃ mataputtāmhi, purisā etadantikā; Na socāmi na rodāmi, na taṃ bhāyāmi āvuso. ‘‘Sabbattha vihatā nandī, tamokkhandho padālito; Jetvāna maccuno [jetvā namucino (sī.)] senaṃ, viharāmi anāsavā’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ kisāgotamī bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "At Sāvatthī.\n\nThen, in the morning, the nun Kisāgotamī, having dressed and taken her bowl and robes, entered Sāvatthī for alms. Having wandered for alms in Sāvatthī, and after her meal, having returned from her alms round, she approached Andhavana for her day's abiding. Having entered deep into Andhavana, she sat down at the foot of a certain tree for her day's abiding.\n\nThen Māra, the Evil One, desiring to arouse fear, trepidation, and horripilation in the nun Kisāgotamī, desiring to dislodge her from her concentration, approached the nun Kisāgotamī; and having approached, addressed the nun Kisāgotamī with a verse:\n\n\"Why are you, like one whose child has died, alone with a tear-streaked face? Alone in the midst of the forest, are you perhaps looking for a man?\"\n\nThen the nun Kisāgotamī thought: \"Who indeed is this, a human or a non-human, speaking this verse?\"\n\nThen the nun Kisāgotamī thought: \"This is Māra, the Evil One, who desires to arouse fear, trepidation, and horripilation in me, who desires to dislodge me from my concentration, speaking this verse.\"\n\nThen the nun Kisāgotamī, having understood, 'This is Māra, the Evil One,' replied to Māra, the Evil One, with verses:\n\n\"I am truly one whose children have died; men are of that kind. I do not grieve, I do not weep, nor do I fear you, friend.\n\n\"Delight has been utterly destroyed everywhere; the mass of darkness has been shattered. Having conquered the army of Death, I abide free from all defilements.\"\n\nThen Māra, the Evil One, realizing 'The nun Kisāgotamī knows me,' distressed and dejected, vanished right there.",
      "sinhala": "සැවැත්නුවරදී.\n\nඉන්පසු කිසාගෝතමී භික්ෂුණිය පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුරු ගෙන, පිඬුසිඟා වැඩීම සඳහා සැවැත්නුවරට පිවිසියා ය. සැවැත්නුවර පිඬුසිඟා වැඩ, දහවල් ආහාරයෙන් පසු, පිණ්ඩපාතයෙන් ආපසු පැමිණ, දවල් විවේක ගැනීම පිණිස අන්ධවන වනය වෙත එළඹුණා ය. අන්ධවන වනයට ඇතුළු වී, යම්කිසි රුක්මුලක දවල් විවේක සුවයෙන් වැඩ සිටියා ය.\n\nඉන්පසු පවිටු මාරයා, කිසාගෝතමී භික්ෂුණිය තුළ භය, තැතිගැනීම සහ ලොමුදැහැගැන්ම උපදවාලීමටත්, ඇයව සමාධියෙන් පිරිහීමට පත් කිරීමටත් කැමතිව, කිසාගෝතමී භික්ෂුණිය වෙත එළඹුණේ ය; එළඹ, කිසාගෝතමී භික්ෂුණියට ගාථාවකින් මෙසේ පැවසුවේ ය: ‘‘කිමෙක් ද, තොප දරුවන් මළ මවක් මෙන් තනිව හිඳින්නෙහි ද, අඬන මුහුණින් යුතුව ද? වනය මැද තනිව සිටින්නෙහි, පුරුෂයකු සොයන්නෙහි ද?’’\n\nඉක්බිති කිසාගෝතමී භික්ෂුණියට මෙසේ සිතුණි: ‘‘මොහු මනුෂ්‍ය‍යෙක් ද, අමනුෂ්‍ය‍යෙක් ද, ගාථා කියන්නේ කවුරුන් ද?’’ ඉක්බිති කිසාගෝතමී භික්ෂුණියට මෙසේ සිතුණි: ‘‘මොහු පවිටු මාරයා යි. මගේ භය, තැතිගැනීම, ලොමුදැහැගැන්ම උපදවාලීමටත්, මා සමාධියෙන් පිරිහීමට පත් කිරීමටත් කැමතිව, මොහු මේ ගාථාව කියන්නේ ය.’’\n\nඉක්බිති කිසාගෝතමී භික්ෂුණිය, ‘‘මොහු පවිටු මාරයා යි’’ යනුවෙන් දැන, පවිටු මාරයාට ගාථාවලින් මෙසේ පිළිතුරු දුන්නා ය: ‘‘දරුවෙක් මළාය යන සීමාවෙන් ද, පුරුෂයෙක් ඇත යන සීමාවෙන් ද, මම මුළුමනින්ම මිදී සිටිමි. මම ශෝක නොකරමි, නොහඬමි, ඇවැත්නි, ඔබට බිය නොවෙමි. සෑම තැනකම නන්දිය (ඇලීම්) දුරු කරන ලදී. අන්ධකාරස්කන්ධය (අවිද්‍යා අන්ධකාරය) බිඳ දමන ලදී. මාරයාගේ සේනාව පරාජය කොට, මම ආශ‍්‍රව රහිතව වැඩ සිටිමි.’’\n\nඉක්බිති පවිටු මාරයා, ‘‘කිසාගෝතමී භික්ෂුණිය මා හඳුනයි’’ යනුවෙන් සිතා, දුකට පත් වී, මලානිකව, එතැනම අතුරුදහන් විය.",
      "paliTitle": "Kisāgotamīsuttaṃ",
      "vagga": "",
      "englishTitle": "To Kisāgotamī Sutta",
      "sinhalaTitle": "කිසාගෝතමී සූත්‍රය"
    },
    {
      "number": 165,
      "pali": "Sāvatthinidānaṃ. Atha kho vijayā bhikkhunī pubbaṇhasamayaṃ nivāsetvā…pe… aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho māro pāpimā vijayāya bhikkhuniyā bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo yena vijayā bhikkhunī tenupasaṅkami; upasaṅkamitvā vijayaṃ bhikkhuniṃ gāthāya ajjhabhāsi – ‘‘Daharā tvaṃ rūpavatī, ahañca daharo susu; Pañcaṅgikena turiyena, ehayyebhiramāmase’’ti [ehi ayye ramāmaseti (sī.)]. Atha kho vijayāya bhikkhuniyā etadahosi – ‘‘ko nu khvāyaṃ manusso vā amanusso vā gāthaṃ bhāsatī’’ti? Atha kho vijayāya bhikkhuniyā etadahosi – ‘‘māro kho ayaṃ pāpimā mama bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo gāthaṃ bhāsatī’’ti. Atha kho vijayā bhikkhunī ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi paccabhāsi – ‘‘Rūpā saddā rasā gandhā, phoṭṭhabbā ca manoramā; Niyyātayāmi tuyheva, māra nāhaṃ tenatthikā. ‘‘Iminā pūtikāyena, bhindanena pabhaṅgunā; Aṭṭīyāmi harāyāmi, kāmataṇhā samūhatā. ‘‘Ye ca rūpūpagā sattā, ye ca arūpaṭṭhāyino [āruppaṭṭhāyino (sī. pī.)]; Yā ca santā samāpatti, sabbattha vihato tamo’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ vijayā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "At Sāvatthī. Then, Bhikkhunī Vijayā, having dressed in the morning, sat down for her day’s abiding at the root of a certain tree. Then, Māra the Evil One, desiring to produce fear, terror, and horripilation in Bhikkhunī Vijayā, desiring to make her deviate from concentration, approached Bhikkhunī Vijayā; having approached, he addressed Bhikkhunī Vijayā with a verse:\n\n“You are young and beautiful, and I am also young and handsome. With music of five instruments, come, lady, let us enjoy ourselves!”\n\nThen this thought occurred to Bhikkhunī Vijayā: “Who, pray tell, is this, human or non-human, speaking this verse?” Then this thought occurred to Bhikkhunī Vijayā: “This is indeed Māra the Evil One, desiring to produce in me fear, terror, and horripilation, desiring to make me deviate from concentration, speaking this verse.” Then Bhikkhunī Vijayā, having recognized, “This is Māra the Evil One,” replied to Māra the Evil One with verses:\n\n“Forms, sounds, tastes, odors, and delightful tactile sensations — I return them to you, Māra, I have no need of them. I am disgusted, I am repulsed by this putrid body, which is subject to breaking up and falling apart. Craving for sensual pleasures has been eradicated.\n\nAnd those beings who have attained rebirth in the realm of form, and those who abide in the formless realms, and whatever peaceful attainments there are — in all of them, darkness has been dispelled.”\n\nThen Māra the Evil One, thinking, “Bhikkhunī Vijayā knows me,” distressed and dejected, vanished right there.",
      "sinhala": "සැවැත්නුවරදීය.\n\nඉන්පසු, විජයා භික්‍ෂුණිය පෙරවරුවේ සිවුරු හැඳ පොහෝනාදිය සම්පූර්ණ කොට දහවල් විවේකය සඳහා යම්කිසි ගසක් මුල වැඩ සිටියාය.\n\nඉක්බිති පව්කම් කරන මාරයා, විජයා භික්‍ෂුණියට බියක්, තැතිගැන්මක්, සිරුරු ලොමුදැහැගැන්මක් උපදවන්නට කැමතිව, ඇය සමාධියෙන් මුදවන්නට කැමතිව, විජයා භික්‍ෂුණිය වැඩසිටි තැනට පැමිණියේය; පැමිණ, විජයා භික්‍ෂුණියට ගාථාවකින් කථා කෙළේය –\n\n‘‘නුඹ තරුණ, රූමත් ය. මමත් තරුණ, ලස්සන කෙනෙකි. එන්න ආර්‍යාව, අපි පංචාංගික තූර්ය නාදයෙන් සතුටු වෙමු.’’ යැයි කීය.\n\nඉක්බිති විජයා භික්‍ෂුණියට මෙසේ සිතුණේය – ‘‘මේ කවරෙක්ද, මනුෂ්‍යයෙක්ද අමනුෂ්‍යයෙක්ද ගාථාවක් කියන්නේ?’’ යැයි.\n\nඉක්බිති විජයා භික්‍ෂුණියට මෙසේ සිතුණේය – ‘‘මේ පව්කම් කරන මාරයාය. මට බියක්, තැතිගැන්මක්, සිරුරු ලොමුදැහැගැන්මක් උපදවන්නට කැමතිව, මා සමාධියෙන් මුදවන්නට කැමතිව, මේ ගාථාව කියන්නේය’’ යැයි.\n\nඉක්බිති විජයා භික්‍ෂුණිය ‘‘මේ පව්කම් කරන මාරයාය’’ යැයි දැනගෙන, පව්කම් කරන මාරයාට ගාථාවලින් පිළිතුරු දුන්නාය –\n\n‘‘රූප, ශබ්ද, රස, ගන්ධ, මනරම් වූ ස්පර්ශයෝද, මේවා මම නුඹටම භාර කරමි මාරය, මට ඒවා අවශ්‍ය නැත.\n\n‘‘මෙම කුණු ශරීරයෙන්, බිඳී යන විනාශයට යන මෙම කයින්, මම කිලුටු වෙමි, පිළිකුල් කරමි. කාම තෘෂ්ණාව මුලිනුපුටා දමන ලද්දේය.\n\n‘‘රූප ලෝකවල උපදින යම් සත්ත්වයෝද, අරූප ලෝකවල වාසය කරන යම් සත්ත්වයෝද වෙත්ද, යම් ශාන්ත වූ සමාපත්තියක් ඇත්තේද, ඒ සියලු තැන්හි අන්ධකාරය දුරු කරන ලද්දේය.’’ යැයි.\n\nඉක්බිති පව්කම් කරන මාරයා ‘‘විජයා භික්‍ෂුණිය මා හඳුනයි’’ යැයි දුක් ඇතිව, සිත් තැවුල් ඇතිව, එතැනම අතුරුදහන් වූයේය.",
      "paliTitle": "Vijayāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Vijayā",
      "sinhalaTitle": "විජයා සූත්‍රය"
    },
    {
      "number": 166,
      "pali": "Sāvatthinidānaṃ. Atha kho uppalavaṇṇā bhikkhunī pubbaṇhasamayaṃ nivāsetvā…pe… aññatarasmiṃ supupphitasālarukkhamūle aṭṭhāsi. Atha kho māro pāpimā uppalavaṇṇāya bhikkhuniyā bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo yena uppalavaṇṇā bhikkhunī tenupasaṅkami; upasaṅkamitvā uppalavaṇṇaṃ bhikkhuniṃ gāthāya ajjhabhāsi – ‘‘Supupphitaggaṃ upagamma bhikkhuni, Ekā tuvaṃ tiṭṭhasi sālamūle; Na catthi te dutiyā vaṇṇadhātu, Bāle na tvaṃ bhāyasi dhuttakāna’’nti. Atha kho uppalavaṇṇāya bhikkhuniyā etadahosi – ‘‘ko nu khvāyaṃ manusso vā amanusso vā gāthaṃ bhāsatī’’ti? Atha kho uppalavaṇṇāya bhikkhuniyā etadahosi – ‘‘māro kho ayaṃ pāpimā mama bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo gāthaṃ bhāsatī’’ti. Atha kho uppalavaṇṇā bhikkhunī ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi paccabhāsi – ‘‘Sataṃ sahassānipi dhuttakānaṃ, Idhāgatā tādisakā bhaveyyuṃ; Lomaṃ na iñjāmi na santasāmi, Na māra bhāyāmi tamekikāpi. ‘‘Esā antaradhāyāmi, kucchiṃ vā pavisāmi te; Pakhumantarikāyampi, tiṭṭhantiṃ maṃ na dakkhasi. ‘‘Cittasmiṃ vasībhūtāmhi, iddhipādā subhāvitā; Sabbabandhanamuttāmhi, na taṃ bhāyāmi āvuso’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ uppalavaṇṇā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "At Sāvatthī. Then, in the forenoon, the bhikkhunī Uppalavaṇṇā, having dressed herself, went and stood at the foot of a certain well-flowered Sāla tree. Then Māra, the Evil One, desiring to arouse fear, trepidation, and horripilation in the bhikkhunī Uppalavaṇṇā, desiring to dislodge her from her meditative absorption, approached the bhikkhunī Uppalavaṇṇā; having approached, he addressed the bhikkhunī Uppalavaṇṇā with a verse:\n‘‘Bhikkhunī, having come to a place of beautifully flowering treetops, you stand alone at the foot of a Sāla tree. There is no other companion of your kind here. Foolish one, do you not fear rogues?’’\n\nThen it occurred to the bhikkhunī Uppalavaṇṇā: ‘‘Who could this be, a human or a non-human, speaking this verse?’’ Then it occurred to the bhikkhunī Uppalavaṇṇā: ‘‘This is Māra, the Evil One, speaking this verse, desiring to arouse fear, trepidation, and horripilation in me, desiring to dislodge me from my meditative absorption.’’ Then the bhikkhunī Uppalavaṇṇā, having realized, ‘‘This is Māra, the Evil One,’’ responded to Māra, the Evil One, with verses:\n‘‘Even if hundreds of thousands of rogues, such as these, were to come here, I would not stir a hair, I would not tremble. I do not fear you, Māra, even though I am alone.\nI can vanish right now, or I can enter your belly. Even if I stand between your eyelashes, you will not see me.\nI am master of my mind, my bases of power have been well-developed. I am freed from all bonds. I do not fear you, friend.’’\n\nThen Māra, the Evil One, realizing ‘‘The bhikkhunī Uppalavaṇṇā knows me,’’ became unhappy and disheartened, and vanished right then and there.",
      "sinhala": "සැවැත්නුවරදී සිදු වූවකි.\n\nඉක්බිති උපලවණ්ණා භික්‍ෂුණිය පෙරවරුවේ චීවරය පෙරවගෙන, පාත්‍ර සිවුරු රැගෙන පිණ්ඩපාතය සඳහා ගොස් අනතුරුව, අසවල් සුපුෂ්පිත සල්ගසක් මුල සිටියාය.\n\nඑවිට පාපී මාරයා උපලවණ්ණා භික්‍ෂුණියට බිය, තැතිගැනීම, සහ ලොමුදැහැගැනීම උපදවන්නටත්, සමාධියෙන් චුත කරන්නටත් සිතා, උපලවණ්ණා භික්‍ෂුණිය සිටි තැනට පැමිණියේය. පැමිණ උපලවණ්ණා භික්‍ෂුණියට ගාථාවකින් මෙසේ පැවසුවේය –\n\n“භික්‍ෂුණිය, මල් පිරුණු අග්‍රයක් (ගසක්) ළඟට පැමිණ, සල්ගසක් මුල ඔබ තනිවම සිටින්නීය. ඔබට දෙවෙනි රූපයක් (සහයක්) නැත්තේය. බාල ස්ත්‍රිය, ඔබ දුෂ්ටයන්ට බිය නොවන්නේද?”\n\nඑවිට උපලවණ්ණා භික්‍ෂුණියට මෙසේ සිතුණේය – “කවරෙක්ද මේ, මනුෂ්‍යයෙක්ද අමනුෂ්‍යයෙක්ද, ගාථාවක් කියන්නේ?”\n\nඉක්බිති උපලවණ්ණා භික්‍ෂුණියට මෙසේ සිතුණේය – “මේ පාපී මාරයා මාගේ බිය, තැතිගැනීම, සහ ලොමුදැහැගැනීම උපදවන්නටත්, සමාධියෙන් චුත කරන්නටත් සිතා ගාථාවක් කියයි.”\n\nඉක්බිති උපලවණ්ණා භික්‍ෂුණිය “මේ පාපී මාරයාය”යි දැන, පාපී මාරයාට ගාථා වලින් මෙසේ පිළිතුරු දුන්නාය –\n\n“මාරය, දහස් ලක්‍ෂයක් දුෂ්ටයෝ මෙහි පැමිණියත්, මා තනිව සිටියත් මම කිසිදු රෝමයක්වත් සෙලවන්නේ නැත, තැතිගන්නේ නැත. මාරය, මම ඔබට බිය නොවෙමි.\n\nමම අතුරුදහන් වන්නෙමි, නැතහොත් ඔබේ කුස තුළට ඇතුළු වන්නෙමි. ඔබේ ඇසිපිය අතරේ සිටියත් මාව ඔබට නොපෙනේවි.\n\nමා සිතෙහි වසඟ බවට පත්ව සිටිමි (චිත්ත වසී භාවයට පත්ව සිටිමි). ඍද්ධිපාද ධර්ම මැනවින් වඩන ලද්දේය. මම සියලු බැඳීම් වලින් මිදුණෙමි. එබැවින් ආයුෂ්මත්, මම ඔබට බිය නොවෙමි.”\n\nඉක්බිති පාපී මාරයා, “උපලවණ්ණා භික්‍ෂුණිය මා හඳුනයි”යි සිතා, දුකට පත්ව, සිත් තැවුලෙන් යුතුව එතැනම අතුරුදහන් විය.",
      "paliTitle": "Uppalavaṇṇāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Uppalavaṇṇā",
      "sinhalaTitle": "උප්පලවණ්ණා සූත්‍රය"
    },
    {
      "number": 167,
      "pali": "Sāvatthinidānaṃ. Atha kho cālā bhikkhunī pubbaṇhasamayaṃ nivāsetvā…pe… aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho māro pāpimā yena cālā bhikkhunī tenupasaṅkami; upasaṅkamitvā cālaṃ bhikkhuniṃ etadavoca – ‘‘kiṃ nu tvaṃ, bhikkhuni, na rocesī’’ti? ‘‘Jātiṃ khvāhaṃ, āvuso, na rocemī’’ti. ‘‘Kiṃ nu jātiṃ na rocesi, jāto kāmāni bhuñjati; Ko nu taṃ idamādapayi, jātiṃ mā roca [mā rocesi (sī. pī.)] bhikkhunī’’ti. ‘‘Jātassa maraṇaṃ hoti, jāto dukkhāni phussati [passati (sī. pī.)]; Bandhaṃ vadhaṃ pariklesaṃ, tasmā jātiṃ na rocaye. ‘‘Buddho dhammamadesesi, jātiyā samatikkamaṃ; Sabbadukkhappahānāya, so maṃ sacce nivesayi. ‘‘Ye ca rūpūpagā sattā, ye ca arūpaṭṭhāyino; Nirodhaṃ appajānantā, āgantāro punabbhava’’nti. Atha kho māro pāpimā ‘‘jānāti maṃ cālā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "In Sāvatthī. Then the bhikkhunī Cālā, having dressed in the morning and so forth, went to a certain tree root and sat down for her day's abiding. Then Māra, the Evil One, approached the bhikkhunī Cālā. Having approached, he said to the bhikkhunī Cālā, \"What is it, bhikkhunī, that you do not delight in?\"\n\n\"Indeed, friend, I do not delight in birth.\" \"Why do you not delight in birth? One who is born enjoys sensual pleasures. Who has prompted you in this, bhikkhunī, that you should not delight in birth?\" \"For one who is born, there is death. One who is born experiences sufferings: bondage, slaughter, and defilement. Therefore, one should not delight in birth. The Buddha taught the Dhamma, the transcendence of birth, for the abandonment of all suffering. He established me in that truth. And those beings who have attained the form realm, and those who abide in the formless realm – not understanding cessation, they are bound to come to renewed existence.\"\n\nThen Māra, the Evil One, thinking, \"The bhikkhunī Cālā recognizes me,\" distressed and disheartened, vanished right there.",
      "sinhala": "සැවැත්නුවරදී සිදු වූවකි.\n\nඑසමයෙහි චාලා භික්ෂුණිය පෙරවරුවෙහි සිවුරු පොරවා... එක්තරා ගසක් මුල දවල් විවේක සුවයෙන් වැඩ සිටියාය.\n\nඑසමයෙහි පාපී මාරයා චාලා භික්ෂුණිය වෙත පැමිණියේය. පැමිණ චාලා භික්ෂුණියට මෙසේ කීවේය: \"භික්ෂුණිය, ඔබ කුමක්ද අකැමැති වන්නේ?\"\n\n\"ඇවැත්නි, මම උපතට අකැමැති වෙමි.\"\n\n\"ඔබ කුමටද උපතට අකැමැති වන්නේ? උපත ලැබූවෝ කාම භෝග භුක්ති විඳිති. භික්ෂුණිය, 'උපතට අකැමැති වන්න'යි ඔබට කවුරුන් මේ උපදෙස් දුන්නේද?\"\n\n\"උපත ලැබූවන්ට මරණය ඇත; උපත ලැබූවෝ දුක් විඳිති; බැඳීම්, වධ හිංසා සහ කෙලෙස්ද අත්විඳිති. එබැවින් මම උපතට අකැමැති වෙමි. බුදුරජාණන් වහන්සේ උපත ඉක්මවා යාම නම් වූ ධර්මය දේශනා කළ සේක; සියලු දුක් ප්‍රහාණය පිණිසයි. උන්වහන්සේ මා ඒ සත්‍යයෙහි පිහිටුවූ සේක. රූප භවයන්හි උපදින සත්ත්වයෝද, අරූප භවයන්හි පිහිටා සිටින සත්ත්වයෝද, නිරෝධය නොදන්නා බැවින් නැවත භවයට පැමිණෙන්නෝය.\"\n\nඑවිට පාපී මාරයා, \"චාලා භික්ෂුණිය මා හඳුනාගත්තාය\" යනුවෙන් දුකට පත්ව, සිත් තැවුලට පත්ව, ඒ ස්ථානයේම අතුරුදහන් විය.",
      "paliTitle": "Cālāsuttaṃ",
      "vagga": "",
      "englishTitle": "Cālā Sutta",
      "sinhalaTitle": "චාලා සූත්‍රය"
    },
    {
      "number": 168,
      "pali": "Sāvatthinidānaṃ. Atha kho upacālā bhikkhunī pubbaṇhasamayaṃ nivāsetvā…pe… aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho māro pāpimā yena upacālā bhikkhunī tenupasaṅkami; upasaṅkamitvā upacālaṃ bhikkhuniṃ etadavoca – ‘‘kattha nu tvaṃ, bhikkhuni, uppajjitukāmā’’ti? ‘‘Na khvāhaṃ, āvuso, katthaci uppajjitukāmā’’ti. ‘‘Tāvatiṃsā ca yāmā ca, tusitā cāpi devatā; Nimmānaratino devā, ye devā vasavattino; Tattha cittaṃ paṇidhehi, ratiṃ paccanubhossasī’’ti. ‘‘Tāvatiṃsā ca yāmā ca, tusitā cāpi devatā; Nimmānaratino devā, ye devā vasavattino; Kāmabandhanabaddhā te, enti māravasaṃ puna. ‘‘Sabbo ādīpito [sabbova āditto (syā. kaṃ.)] loko, sabbo loko padhūpito; Sabbo pajjalito [pajjalito (sabbattha)] loko, sabbo loko pakampito. ‘‘Akampitaṃ apajjalitaṃ [acalitaṃ (sī. syā. kaṃ. pī.)], aputhujjanasevitaṃ; Agati yattha mārassa, tattha me nirato mano’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ upacālā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "In Sāvatthī. Then, in the forenoon, Bhikkhunī Upacālā, having dressed, took her bowl and robe and entered Sāvatthī for alms. Having walked for alms in Sāvatthī and returned from her alms round after the meal, she went to a certain tree root; having gone there, she sat down for her day's abiding under that tree.\n\nThen Māra the Evil One approached Bhikkhunī Upacālā. Having approached, he said to Bhikkhunī Upacālā, \"Where, Bhikkhunī, do you wish to be reborn?\"\n\n\"Friend, I do not wish to be reborn anywhere.\"\n\n\"The devas of Tāvatiṃsa, the devas of Yāmā, and also the devas of Tusita; the devas who delight in their own creations, and the devas who have power over the creations of others—direct your mind towards them, and you will experience delight.\"\n\n\"The devas of Tāvatiṃsa, the devas of Yāmā, and also the devas of Tusita; the devas who delight in their own creations, and the devas who have power over the creations of others—they are bound by the fetters of sensual desire and come again under Māra's sway.\n\n\"All the world is aflame, all the world is enveloped in smoke; all the world is blazing, all the world is trembling.\n\n\"Where there is no trembling, no blazing, where ordinary people do not resort, where Māra has no entry—there my mind delights.\"\n\nThen Māra the Evil One, distressed and dejected, thinking, \"Bhikkhunī Upacālā knows me,\" vanished right there.",
      "sinhala": "සැවැත්නුවරදී මේ සිදුවීම සිදු විය.\n\nඑවිට උපචාලා භික්ෂුණිය පෙරවරුවේ සිවුරු හැඳ පොරවාගෙන, පිඬු සිඟා වඩාරා, දානය වැළඳීමෙන් පසු, යම් ගසක් මුල දවල් විහරණය පිණිස වැඩ සිටියාය. එවිට පාපී මාරයා උපචාලා භික්ෂුණිය වෙත පැමිණ, ඇය අමතා මෙසේ කීවේය: \"භික්ෂුණිය, ඔබ කොහි උපදින්නට කැමතිද?\" \"ඇවැත්නි, මම කිසි තැනක උපදින්නට කැමති නොවෙමි\" යි. \"තව්තිසා වැසි දෙවියෝද, යාම වැසි දෙවියෝද, තෝසිත වැසි දෙවියෝද, නිර්මාණරති වැසි දෙවියෝද, වසවත්ති වැසි දෙවියෝද වෙති. එතැන්හි සිත පිහිටුවන්න, ඔබ සතුට අත්විඳිනු ඇතැ\" යි. \"තව්තිසා වැසි දෙවියෝද, යාම වැසි දෙවියෝද, තෝසිත වැසි දෙවියෝද, නිර්මාණරති වැසි දෙවියෝද, වසවත්ති වැසි දෙවියෝද, ඔවුන් සියල්ලෝම කාම බන්ධනවලින් බැඳී සිටින්නෝය. ඔවුහු නැවත නැවතත් මාරයාගේ වසඟයට පත්වෙති. සියලු ලෝකය දැල්වී ඇත, සියලු ලෝකය දුමෙන් වැසී ඇත. සියලු ලෝකය ඇවිලී ඇත, සියලු ලෝකය කම්පාවට පත්ව ඇත. කම්පා නොවන, නොදැල්වෙන තැනක් ඇත, එය පෘථග්ජනයන් විසින් සේවනය නොකරන ලද්දකි. මාරයාට පිවිසීමට නොහැකි ඒ තැනෙහි, මාගේ සිත නිරතව ඇතැ\" යි.\n\nඑවිට පාපී මාරයා, \"උපචාලා භික්ෂුණිය මා හඳුනාගත්තාය\" යි සිතා, දුකින් හා කලකිරීමෙන් යුතුව එතැනින්ම අතුරුදහන් විය.",
      "paliTitle": "Upacālāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Upacālā",
      "sinhalaTitle": "උපචාලා සූත්‍රය"
    },
    {
      "number": 169,
      "pali": "Sāvatthinidānaṃ. Atha kho sīsupacālā [sīsūpacālā (sī.)] bhikkhunī pubbaṇhasamayaṃ nivāsetvā …pe… aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho māro pāpimā yena sīsupacālā bhikkhunī tenupasaṅkami; upasaṅkamitvā sīsupacālaṃ bhikkhuniṃ etadavoca – ‘‘kassa nu tvaṃ, bhikkhuni, pāsaṇḍaṃ rocesī’’ti? ‘‘Na khvāhaṃ, āvuso, kassaci pāsaṇḍaṃ rocemī’’ti. ‘‘Kaṃ nu uddissa muṇḍāsi, samaṇī viya dissasi; Na ca rocesi pāsaṇḍaṃ, kimiva carasi momūhā’’ti. ‘‘Ito bahiddhā pāsaṇḍā, diṭṭhīsu pasīdanti te; Na tesaṃ dhammaṃ rocemi, te dhammassa akovidā. ‘‘Atthtththi sakyakule jāto, buddho appaṭipuggalo; Sabbābhibhū māranudo, sabbatthamaparājito. ‘‘Sabbattha mutto asito, sabbaṃ passati cakkhumā; Sabbakammakkhayaṃ patto, vimutto upadhisaṅkhaye; So mayhaṃ bhagavā satthā, tassa rocemi sāsana’’nti. Atha kho māro pāpimā ‘‘jānāti maṃ sīsupacālā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "The discourse originated in Sāvatthī. Then, in the forenoon, the nun Sīsupacālā, having dressed, took her bowl and outer robe and entered Sāvatthī for alms. After her meal, on her return from the alms round, she put away her bowl and robe, washed her feet, and sat down for her daytime abiding at the root of a certain tree.\n\nThen Māra, the Evil One, approached the nun Sīsupacālā. Having approached her, he said to the nun Sīsupacālā, \"Whose doctrine, O nun, do you approve of?\" \"Indeed, friend, I do not approve of anyone's doctrine.\" \"For whose sake have you shaved your head? You appear like an ascetic, yet you do not approve of any doctrine. How then do you wander, so bewildered?\"\n\n\"Those doctrines external to this teaching, they are satisfied with their various views. I do not approve of their teaching, for they are unskilled in the true Dhamma. There is one born in the Sakyan clan, the Awakened One, a peerless individual. He is all-conquering, the vanquisher of Māra, unconquered in all things. Liberated everywhere, unattached, the Visionary who sees everything; he has attained the destruction of all kamma, completely liberated with the cessation of all bases for rebirth. That Blessed One is my Teacher; I approve of his Dispensation.\"\n\nThen Māra, the Evil One, realizing \"The nun Sīsupacālā knows me,\" became distressed and dejected, and vanished right there.",
      "sinhala": "මෙය සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඉක්බිති සීසුපචාලා භික්ෂුණිය පෙරවරුවේ සිවුරු හැඳ... කිසියම් රුක්මුලක දහවල් විහරණය පිණිස වැඩ සිටියාය. ඉක්බිති පව්කම්හි ඇලුණු මාරයා සීසුපචාලා භික්ෂුණිය සිටින තැනට පැමිණියේය. එසේ පැමිණ, සීසුපචාලා භික්ෂුණියට මෙසේ කීවේය: “භික්ෂුණිය, ඔබ කවර ශාස්තෘවරයෙකුගේ හෝ ආගමික මතයක් අනුමත කරන්නෙහිද?”\n\n“ඇවැත්නි, මම කිසිදු ශාස්තෘවරයෙකුගේ හෝ ආගමික මතයක් අනුමත නොකරමි.” “කවරකු අරමුණු කොට හිස මුඩු කළෙහිද? ඔබ ශ්‍ර‍මණයක මෙන් පෙනෙන්නීය. කිසිදු ආගමික මතයක් අනුමත නොකරන්නී නම්, ඔබ මහා මුළාවට පත්වූවකු මෙන් හැසිරෙන්නේ කුමටද?”\n\n“මෙම ශාසනයෙන් බැහැර වූ ශාස්තෘවරුන්ගේ මතවාදයන් ඇත්තෝ, තම දෘෂ්ටීන් කෙරෙහිම සතුටු වෙති. මම ඔවුන්ගේ ධර්මය අනුමත නොකරමි. ඔවුහු ධර්මය පිළිබඳව අදක්ෂයෝ වෙති. සර්වඥ වූ, සියල්ල පරදවන, මාරයා දුරු කළ, සියලු තැන්හි අපරාජිත වූ, ශාක්‍ය‍ කුලයේ උපන් අසම සම බුදුරදුන් වැඩ සිටිති. සියල්ලෙන් මිදුණු, කිසිවකට ඇලීමක් නැති, සියල්ල දකින මහා ප්‍ර‍ඥා ඇත්තා වූ, සියලු කර්මයන්ගේ ක්ෂයභාවයට පත්වූ, උපධීන් ක්ෂය කිරීමෙන් විමුක්තිය ලැබූ උන්වහන්සේ, මාගේ භාග්‍ය‍වත් ශාස්තෘවරයායි. මම උන්වහන්සේගේ ශාසනය අනුමත කරමි.”\n\nඉක්බිති පව්කම්හි ඇලුණු මාරයා, “සීසුපචාලා භික්ෂුණිය මා හඳුනා ගත්තීය” යනුවෙන් සිතා, දුකට පත්ව, සිත් තැවුලෙන් යුතුව, එතැනම අතුරුදහන් විය.",
      "paliTitle": "Sīsupacālāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Sīsupacālā",
      "sinhalaTitle": "සීසූපචාලා සූත්‍රය"
    },
    {
      "number": 170,
      "pali": "Sāvatthinidānaṃ. Atha kho selā bhikkhunī pubbaṇhasamayaṃ nivāsetvā…pe… aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho māro pāpimā selāya bhikkhuniyā bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo…pe… selaṃ bhikkhuniṃ gāthāya ajjhabhāsi – ‘‘Kenidaṃ pakataṃ bimbaṃ, kvanu [kvannu (sī. pī.), kvaci (syā. kaṃ. ka.)] bimbassa kārako; Kvanu bimbaṃ samuppannaṃ, kvanu bimbaṃ nirujjhatī’’ti. Atha kho selāya bhikkhuniyā etadahosi – ‘‘ko nu khvāyaṃ manusso vā amanusso vā gāthaṃ bhāsatī’’ti? Atha kho selāya bhikkhuniyā etadahosi – ‘‘māro kho ayaṃ pāpimā mama bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo gāthaṃ bhāsatī’’ti. Atha kho selā bhikkhunī ‘‘māro ayaṃ pāpimā’’ iti viditvā māraṃ pāpimantaṃ gāthāhi paccabhāsi – ‘‘Nayidaṃ attakataṃ [nayidaṃ pakataṃ (syā. kaṃ.)] bimbaṃ, nayidaṃ parakataṃ [nayidaṃ pakataṃ (syā. kaṃ.)] aghaṃ; Hetuṃ paṭicca sambhūtaṃ, hetubhaṅgā nirujjhati. ‘‘Yathā aññataraṃ bījaṃ, khette vuttaṃ virūhati; Pathavīrasañcāgamma, sinehañca tadūbhayaṃ. ‘‘Evaṃ khandhā ca dhātuyo, cha ca āyatanā ime; Hetuṃ paṭicca sambhūtā, hetubhaṅgā nirujjhare’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ selā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti.",
      "english": "The narrative originates in Sāvatthī. Then, in the forenoon, the bhikkhunī Sela, having dressed, went to abide for the day at the root of a certain tree. Then Māra, the Evil One, desiring to arouse fear, terror, and horripilation in the bhikkhunī Sela, addressed her with a verse:\n\n“By whom was this body made? And where is the maker of this body? Where did this body arise? Where does this body cease?”\n\nThen it occurred to the bhikkhunī Sela, “Who indeed is this, a human or a non-human, who is reciting this verse?” Then it occurred to the bhikkhunī Sela, “Indeed, this is Māra, the Evil One, desiring to arouse fear, terror, and horripilation in me, desiring to dislodge me from concentration; he is reciting this verse.” Then the bhikkhunī Sela, knowing, “This is Māra, the Evil One,” replied to Māra, the Evil One, with verses:\n\n“This body is not made by oneself, nor is this suffering made by another. Having come into being due to a cause, it ceases when the cause ceases.\n\nJust as a certain seed, planted in a field, sprouts, depending on the essence of the earth and moisture, both of these.\n\nSimilarly, the aggregates and the elements, and these six sense bases, having come into being due to a cause, they cease when the cause ceases.”\n\nThen Māra, the Evil One, thinking, “The bhikkhunī Sela knows me,” distressed and dejected, right there he vanished.",
      "sinhala": "සැවැත් නුවරදීය.\n\nඉක්බිති සෙලා භික්ෂුණිය පෙරවරුවෙහි සිවුරු පොරවා, යම් ගසක් මුල දවල් විවේක සුවයෙන් වාඩි වූවාය.\n\nඉක්බිති පවිටු මාරයා සෙලා භික්ෂුණියට භය, තැතිගැනීම, සහ ලොමුදැහැගැනීම ඇති කිරීමට කැමැතිව, සෙලා භික්ෂුණියට ගාථාවකින් මෙසේ පැවසීය: ‘‘මේ කය කවරකු විසින් කරණ ලද්දේද? මේ කයේ නිර්මාතෘ කොහිද? මේ කය කොහි හටගත්තේද? මේ කය කොහි නිරුද්ධ වන්නේද?’’\n\nඉක්බිති සෙලා භික්ෂුණියට මෙසේ සිතුණි: ‘‘මේ කවරෙක්ද, මිනිසෙක්ද, නොමිනිසෙක්ද, මේ ගාථාව පවසන්නේ?’’\n\nඉක්බිති සෙලා භික්ෂුණියට මෙසේ සිතුණි: ‘‘මේ පවිටු මාරයා මාගේ සිතේ භය, තැතිගැනීම, සහ ලොමුදැහැගැනීම ඇති කිරීමටත්, මා සමාධියෙන් මුළා කිරීමටත් කැමැතිව මේ ගාථාව පවසන්නේය.’’\n\nඉක්බිති සෙලා භික්ෂුණිය ‘‘මේ පවිටු මාරයාය’’ යි දැනගෙන, පවිටු මාරයාට ගාථාවලින් පිළිතුරු දුන්නාය:\n\n‘‘මේ කය තමා විසින් කරණ ලද්දක් නොවේ. මේ දුක් සහිත කය අනුන් විසින් කරණ ලද්දක්ද නොවේ. එය හේතු ප්‍රත්‍යයන් නිසා හටගත්තේය, හේතු බිඳී යාමෙන් නිරුද්ධ වන්නේය.\n\n‘‘යම්සේ යම් බීජයක් කෙතක වපුරා, පොළොවේ සාරය සහ තෙතමනය යන දෙකම ඇසුරු කරගෙන පැළවී වැඩෙන්නේද,\n\n‘‘එසේම මේ ස්කන්ධයෝද, ධාතූහුද, සවැදෑරුම් ආයතනයෝද හේතු ප්‍රත්‍යයන් නිසා හටගත්හ, හේතු බිඳී යාමෙන් නිරුද්ධ වන්නාහ.’’\n\nඉක්බිති පවිටු මාරයා ‘‘සෙලා භික්ෂුණිය මා හඳුනයි’’ යි සිතා, දුකින් හා දොම්නසින් යුක්තව එතැනින්ම අතුරුදහන් වූයේය.",
      "paliTitle": "Selāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Selā",
      "sinhalaTitle": "සේලා සූත්‍රය"
    },
    {
      "number": 171,
      "pali": "Sāvatthinidānaṃ. Atha kho vajirā bhikkhunī pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena andhavanaṃ tenupasaṅkami divāvihārāya. Andhavanaṃ ajjhogāhetvā aññatarasmiṃ rukkhamūle divāvihāraṃ nisīdi. Atha kho māro pāpimā vajirāya bhikkhuniyā bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo yena vajirā bhikkhunī tenupasaṅkami; upasaṅkamitvā vajiraṃ bhikkhuniṃ gāthāya ajjhabhāsi – ‘‘Kenāyaṃ pakato satto, kuvaṃ sattassa kārako; Kuvaṃ satto samuppanno, kuvaṃ satto nirujjhatī’’ti. Atha kho vajirāya bhikkhuniyā etadahosi – ‘‘ko nu khvāyaṃ manusso vā amanusso vā gāthaṃ bhāsatī’’ti? Atha kho vajirāya bhikkhuniyā etadahosi – ‘‘māro kho ayaṃ pāpimā mama bhayaṃ chambhitattaṃ lomahaṃsaṃ uppādetukāmo samādhimhā cāvetukāmo gāthaṃ bhāsatī’’ti. Atha kho vajirā bhikkhunī ‘‘māro ayaṃ pāpimā’’ iti viditvā, māraṃ pāpimantaṃ gāthāhi paccabhāsi – ‘‘Kiṃ nu sattoti paccesi, māra diṭṭhigataṃ nu te; Suddhasaṅkhārapuñjoyaṃ, nayidha sattupalabbhati. ‘‘Yathā hi aṅgasambhārā, hoti saddo ratho iti; Evaṃ khandhesu santesu, hoti sattoti sammuti [sammati (syā. kaṃ.)]. ‘‘Dukkhameva hi sambhoti, dukkhaṃ tiṭṭhati veti ca; Nāññatra dukkhā sambhoti, nāññaṃ dukkhā nirujjhatī’’ti. Atha kho māro pāpimā ‘‘jānāti maṃ vajirā bhikkhunī’’ti dukkhī dummano tatthevantaradhāyīti. ",
      "english": "At Sāvatthī.\n\nThen, in the morning, the bhikkhunī Vajirā dressed, took her bowl and robe, and entered Sāvatthī for alms. After wandering for alms in Sāvatthī and having returned from her alms round after her meal, she approached the Andhavana for her daytime abiding. Having entered deep into the Andhavana, she sat down at the root of a certain tree for her daytime abiding.\n\nThen Māra, the Evil One, wishing to arouse fear, terror, and horripilation in bhikkhunī Vajirā, and wishing to dislodge her from concentration, approached bhikkhunī Vajirā. Having approached, he addressed bhikkhunī Vajirā with a verse:\n\n“By whom is this being crafted? Where is the creator of the being? Where does the being originate? Where does the being cease?”\n\nThen it occurred to bhikkhunī Vajirā: “Who is this, a human or a non-human, speaking this verse?” Then it occurred to bhikkhunī Vajirā: “This is Māra, the Evil One, wishing to arouse fear, terror, and horripilation in me, and wishing to dislodge me from concentration, speaking this verse.”\n\nThen bhikkhunī Vajirā, having recognized, “This is Māra, the Evil One,” replied to Māra, the Evil One, with verses:\n\n“Why, Māra, do you assume ‘a being’ exists? Is this your delusive view? This is merely a heap of pure mental formations; no ‘being’ is found herein.\n\nJust as when parts are assembled, the word ‘chariot’ is used, so too, when the aggregates exist, the word ‘being’ is conventionally designated.\n\nIndeed, only suffering arises, suffering persists and ceases. Nothing other than suffering arises, nothing other than suffering ceases.”\n\nThen Māra, the Evil One, thinking “Bhikkhunī Vajirā knows me,” became distressed and disappointed, and vanished right there.",
      "sinhala": "එක් සමයෙක්හි වජිරා භික්ෂුණිය පෙරවරුවේ සිවුරු හැඳ පොරවා පාත්‍රය හා සිවුර ගෙන සැවැත්නුවරට පිඬු සිඟා පිවිසියා ය. සැවැත්නුවර පිඬු සිඟා වැඩ හවස්වරුවේ පිණ්ඩපාතයෙන් ආපසු වැඩමවා දවල් විවේක ගැනීම සඳහා අන්ධවනයට පිවිසියා ය. අන්ධවනයට ඇතුළු වී එක්තරා ගස් මුලක දවල් විවේකයෙන් වැඩ සිටියා ය.\n\nඑවිට පාපී මාරයා වජිරා භික්ෂුණියට භය, තැතිගැන්ම, ලොමුදැහැගැන්ම ඇති කිරීමට කැමතිව, ඇයගේ සමාධියෙන් චලනය කිරීමට කැමතිව, වජිරා භික්ෂුණිය වෙත පැමිණියේ ය. පැමිණ වජිරා භික්ෂුණියට ගාථාවකින් මෙසේ පැවසී ය: “මේ සත්වයා කවුරුන් විසින් නිර්‍මාණය කරන ලද්දේ ද? සත්වයාගේ නිර්‍මාතෘවරයා කොහි ද? සත්වයා කොතැනක උපදී ද? සත්වයා කොතැනක නිරුද්ධ වේ ද?”\n\nඑවිට වජිරා භික්ෂුණියට මෙසේ සිතිණි: “මේ කවුරුන් විසින් ද, මිනිසකු විසින් ද, නොමිනිසකු විසින් ද මේ ගාථාව කියනු ලබන්නේ?” එවිට වජිරා භික්ෂුණියට මෙසේ සිතිණි: “මාගේ භය, තැතිගැන්ම, ලොමුදැහැගැන්ම ඇති කිරීමට කැමතිව, මාගේ සමාධියෙන් චලනය කිරීමට කැමතිව, පාපී මාරයා විසින් ම මේ ගාථාව කියනු ලබන්නේ ය.”\n\nඑවිට වජිරා භික්ෂුණිය, “මේ පාපී මාරයා ය” යි දැන, පාපී මාරයාට ගාථාවලින් මෙසේ පිළිතුරු දුන්නා ය: “මාරය, ඔබ සත්වයෙක් යැයි සිතන්නේ කුමක් ද? එය ඔබට මිථ්‍යා දෘෂ්ටියක් නොවේ ද? මෙය පිරිසිදු සංඛාර සමූහයක් පමණකි. මෙහි සත්වයෙක් උපලබ්ධ නොවේ. යම් සේ විවිධ අංග සමූහයක් එක්වීමෙන් ‘රථය’ යන වචනය ඇති වේ ද, එලෙසින් ම, ස්කන්ධයන් පවතින විට ‘සත්වයා’ යනුවෙන් ප්‍රඥප්තියක් ඇති වේ. දුක ම උපදී, දුක ම පවතී, දුක ම නැති වී යයි. දුකින් තොරව කිසිවක් උපදින්නේ ද නැත, දුකින් තොරව කිසිවක් නිරුද්ධ වන්නේ ද නැත.”\n\nඑවිට පාපී මාරයා, “වජිරා භික්ෂුණිය මා හඳුනයි” යි සිතා, දුකින් හා කලකිරුණු සිතින් යුතුව එතැනින් ම අතුරුදහන් විය.",
      "paliTitle": "Vajirāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse to Vajirā",
      "sinhalaTitle": "වජිරා සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Bhikkhunīsaṃyuttaṃ samattaṃ. Tassuddānaṃ – Āḷavikā ca somā ca, gotamī vijayā saha; Uppalavaṇṇā ca cālā, upacālā sīsupacālā ca; Selā vajirāya te dasāti.",
    "english": "The Linked Discourses with Nuns is complete. The summary of it: Āḷavikā, Somā, Gotamī, Vijayā, Uppalavaṇṇā, Cālā, Upacālā, Sīsupacālā, Selā, and Vajirā—these are ten.",
    "sinhala": "භික්ඛුනී සංයුක්තය සමාප්තයි. එහි උද්දානය නම්: ආළවිකා, සෝමා, ගෝතමී, විජයා, උප්පලවණ්ණා, චාලා, උපචාලා, සීසූපචාලා, සේලා සහ වජිරා යන සූත්‍ර දහයයි."
  }
}