{
  "id": "sn.1.6",
  "title": {
    "pali": "Brahmasaṃyuttaṃ",
    "english": "The Connected Discourses with Brahmās",
    "sinhala": "බ්‍ර​හ්ම සංයුත්තය"
  },
  "sections": [
    {
      "number": 172,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhamūle paṭhamābhisambuddho. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘adhigato kho myāyaṃ dhammo gambhīro duddaso duranubodho santo paṇīto atakkāvacaro nipuṇo paṇḍitavedanīyo. Ālayarāmā kho panāyaṃ pajā ālayaratā ālayasammuditā. Ālayarāmāya kho pana pajāya ālayaratāya ālayasammuditāya duddasaṃ idaṃ ṭhānaṃ yadidaṃ idappaccayatāpaṭiccasamuppādo. Idampi kho ṭhānaṃ duddasaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbānaṃ. Ahañceva kho pana dhammaṃ deseyyaṃ; pare ca me na ājāneyyuṃ; so mamassa kilamatho, sā mamassa vihesā’’ti. Apissu bhagavantaṃ imā anacchariyā gāthāyo paṭibhaṃsu pubbe assutapubbā – ‘‘Kicchena me adhigataṃ, halaṃ dāni pakāsituṃ; Rāgadosaparetehi, nāyaṃ dhammo susambudho. ‘‘Paṭisotagāmiṃ nipuṇaṃ, gambhīraṃ duddasaṃ aṇuṃ; Rāgarattā na dakkhanti, tamokhandhena āvuṭā’’ti [tamokkhandhena āvutāti (sī. syā. kaṃ. pī.)]. Itiha bhagavato paṭisañcikkhato appossukkatāya cittaṃ namati, no dhammadesanāya. Atha kho brahmuno sahampatissa bhagavato cetasā cetoparivitakkamaññāya etadahosi – ‘‘nassati vata bho loko, vinassati vata bho loko, yatra hi nāma tathāgatassa arahato sammāsambuddhassa appossukkatāya cittaṃ namati [namissati (?)], no dhammadesanāyā’’ti. Atha kho brahmā sahampati – seyyathāpi nāma balavā puriso samiñjitaṃ [sammiñjitaṃ (sī. syā. kaṃ. pī.)] vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṃsaṃ uttarāsaṅgaṃ karitvā dakkhiṇajāṇumaṇḍalaṃ pathaviyaṃ nihantvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘desetu, bhante, bhagavā dhammaṃ, desetu sugato dhammaṃ. Santi sattā apparajakkhajātikā, assavanatā dhammassa parihāyanti. Bhavissanti dhammassa aññātāro’’ti. Idamavoca brahmā sahampati, idaṃ vatvā athāparaṃ etadavoca – ‘‘Pāturahosi magadhesu pubbe, Dhammo asuddho samalehi cintito; Apāpuretaṃ [avāpuretaṃ (sī.)] amatassa dvāraṃ, Suṇantu dhammaṃ vimalenānubuddhaṃ. ‘‘Sele yathā pabbatamuddhaniṭṭhito, Yathāpi passe janataṃ samantato; Tathūpamaṃ dhammamayaṃ sumedha, Pāsādamāruyha samantacakkhu; Sokāvatiṇṇaṃ [sokāvakiṇṇaṃ (sī.)] janatamapetasoko, Avekkhassu jātijarābhibhūtaṃ. ‘‘Uṭṭhehi vīra vijitasaṅgāma, Satthavāha anaṇa [aṇaṇa (rūpasiddhiṭīkā)] vicara loke; Desassu [desetu (syā. kaṃ. pī. ka.)] bhagavā dhammaṃ, Aññātāro bhavissantī’’ti. Atha kho bhagavā brahmuno ca ajjhesanaṃ viditvā sattesu ca kāruññataṃ paṭicca buddhacakkhunā lokaṃ volokesi. Addasā kho bhagavā buddhacakkhunā lokaṃ volokento satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye, appekacce paralokavajjabhayadassāvine viharante, appekacce na paralokavajjabhayadassāvine [dassāvino (sī. syā. kaṃ. pī.)] viharante. Seyyathāpi nāma uppaliniyaṃ vā paduminiyaṃ vā puṇḍarīkiniyaṃ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakānuggatāni anto nimuggaposīni, appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni samodakaṃ ṭhitāni, appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakā accuggamma ṭhitāni [tiṭṭhanti (sī. syā. kaṃ. pī.)] anupalittāni udakena; evameva bhagavā buddhacakkhunā lokaṃ volokento addasa satte apparajakkhe mahārajakkhe tikkhindriye mudindriye svākāre dvākāre suviññāpaye duviññāpaye, appekacce paralokavajjabhayadassāvine viharante, appekacce na paralokavajjabhayadassāvine viharante. Disvāna brahmānaṃ sahampatiṃ gāthāya paccabhāsi – ‘‘Apārutā tesaṃ amatassa dvārā, Ye sotavanto pamuñcantu saddhaṃ; Vihiṃsasaññī paguṇaṃ na bhāsiṃ, Dhammaṃ paṇītaṃ manujesu brahme’’ti. Atha kho brahmā sahampati ‘‘katāvakāso khomhi bhagavatā dhammadesanāyā’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyīti.",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling in Uruvelā, on the bank of the Nerañjarā River, at the root of the Ajapāla Banyan tree, having just attained full enlightenment.\n\nThen, as the Blessed One was in seclusion, having retired for meditation, a thought arose in his mind: \"This Dhamma that I have attained is profound, difficult to see, difficult to comprehend, peaceful, excellent, beyond the sphere of logic, subtle, and to be experienced by the wise. This generation, however, delights in attachment, finds enjoyment in attachment, rejoices in attachment. For this generation, which delights in attachment, finds enjoyment in attachment, and rejoices in attachment, this state is difficult to see, namely, conditionality and dependent origination. Also difficult to see is this state, namely, the stilling of all formations, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna. If I were to teach this Dhamma, others would not understand me. That would be a weariness for me, that would be an annoyance for me.\"\n\nAnd then these unprompted verses, never heard before, occurred to the Blessed One:\n\"With difficulty I have gained this. Enough now with proclaiming it.\nThis Dhamma is not easily understood by those overcome with lust and hatred.\nGoing against the stream, subtle, profound, difficult to see, minute —\nThose deluded by passion will not see it, enveloped as they are in a mass of darkness.\"\n\nThus, as the Blessed One reflected, his mind inclined towards inaction, not towards teaching the Dhamma.\n\nThen Brahmā Sahampati, having understood the Blessed One's mental reflection with his own mind, thought: \"Alas, the world is perishing! Alas, the world is being utterly destroyed! For the mind of the Tathāgata, the Arahant, the Fully Self-Awakened One, inclines towards inaction, not towards teaching the Dhamma!\"\n\nThen Brahmā Sahampati, just as a strong man might extend his flexed arm or flex his extended arm, vanished from the Brahmā-world and reappeared before the Blessed One. Then Brahmā Sahampati, arranging his upper robe over one shoulder, knelt with his right knee on the ground, extended his joined hands in reverence towards the Blessed One, and addressed him: \"Venerable Master, may the Blessed One teach the Dhamma! May the Fortunate One teach the Dhamma! There are beings with little dust in their eyes who are perishing for not hearing the Dhamma. There will be those who will understand the Dhamma.\"\n\nBrahmā Sahampati said this, and having said it, he spoke further verses:\n\"In Magadha, formerly, an impure Dhamma arose, conceived by the defiled.\nOpen wide the door to the Deathless! Let them hear the Dhamma, awakened by the Stainless One!\nJust as one standing on a mountaintop might gaze down upon the people all around,\nSo too, O wise one, O All-Seeing One, ascend the palace of Dhamma.\nLook down upon this populace, overwhelmed by sorrow, freed from sorrow, upon those overcome by birth and aging.\nArise, O Hero, victor in battle! O Caravan Leader, unburdened, wander through the world!\nMay the Blessed One teach the Dhamma; there will be those who will understand!\"\n\nThen the Blessed One, understanding Brahmā's request and out of compassion for beings, surveyed the world with his Buddha-eye. As the Blessed One surveyed the world with his Buddha-eye, he saw beings with little dust in their eyes, with much dust in their eyes, with keen faculties, with dull faculties, with good dispositions, with bad dispositions, easy to instruct, difficult to instruct, some living perceiving the danger in deeds blameable in the next world, and some living not perceiving the danger in deeds blameable in the next world.\n\nJust as in a pond of blue lotuses, or red lotuses, or white lotuses, some blue lotuses, red lotuses, or white lotuses are born in the water, grow in the water, and remain submerged in the water, nourished beneath the surface; some blue lotuses, red lotuses, or white lotuses are born in the water, grow in the water, and stand level with the water's surface; and some blue lotuses, red lotuses, or white lotuses are born in the water, grow in the water, and stand emerging above the water, unadulterated by the water—even so, the Blessed One, surveying the world with his Buddha-eye, saw beings with little dust in their eyes, with much dust in their eyes, with keen faculties, with dull faculties, with good dispositions, with bad dispositions, easy to instruct, difficult to instruct, some living perceiving the danger in deeds blameable in the next world, and some living not perceiving the danger in deeds blameable in the next world.\n\nHaving seen this, he addressed Brahmā Sahampati with a verse:\n\"The doors to the Deathless are open for those who have ears to hear; let them release their faith.\nBrahmā, perceiving harm, I did not declare this sublime Dhamma among humans before.\"\n\nThen Brahmā Sahampati, thinking, \"I have been granted an opportunity by the Blessed One for the teaching of the Dhamma,\" paid homage to the Blessed One, circumambulated him respectfully, and then vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ ප්‍රථමාභිසම්බුද්ධව, නේරංජරා නදී තීරයෙහි වූ අජපාල නුගරුක මුල, උරුවේලාවෙහි වැඩසිටින සේක. එකල්හි භාග්‍යවතුන් වහන්සේට රහස් ස්ථානයකට වැඩ, භාවනානුයෝගීව සිටින කල්හි මෙබඳු සිතිවිල්ලක් පහළ විය: \"මා විසින් අවබෝධ කරන ලද මේ ධර්මය ගැඹුරුය, දැකීමට දුෂ්කරය, අවබෝධ කිරීමට අපහසුය, ශාන්තය, ප්‍රණීතය, තර්කයෙන් අවබෝධ කළ නොහැකිය, සියුම්ය, පණ්ඩිතයන් විසින් පමණක් අවබෝධ කළ යුත්තකි. මේ සත්ව සමූහයා තණ්හා ආලයෙහි ඇලුණෝය, තණ්හා ආලයෙහි සතුටු වූවෝය. තණ්හා ආලයෙහි ඇලී, තණ්හා ආලයෙහි සතුටු වන මේ සත්ව සමූහයාට 'මේ අද්දර ප්‍රත්‍යයතාවය සහිත වූ පටිච්චසමුප්පාදය' නම් වූ මේ තැන දැකීම දුෂ්කරය. 'සර්ව සංස්කාරයන්ගේ සංසිඳීම, සියලු උපාධීන් අත්හැරීම, තණ්හාව ක්ෂය කිරීම, විරාගය, නිරෝධය, නිර්වාණය' නම් වූ මේ තැනද දැකීම දුෂ්කරය. මම ධර්මය දේශනා කළහොත්, අන් අය එය නොදැන ගනිත් නම්, එය මට විඩාවක් වේ, එය මට පීඩාවක් වේ.\" තවද, භාග්‍යවතුන් වහන්සේට පෙර කිසිදා නොඇසූ, මේ පුදුම සහගත නොවන ගාථා පහළ විය: \"මා විසින් මේ ධර්මය අතිශය දුකකින් අවබෝධ කරන ලදී, දැන් එය ප්‍රකාශ කිරීමෙන් පලක් නැත. රාගයෙන් හා ද්වේෂයෙන් යුක්ත වූවන්ට මේ ධර්මය පහසුවෙන් අවබෝධ කළ නොහැක.\" \"ප්‍රතිසෝතගාමී වූ, සියුම් වූ, ගැඹුරු වූ, දැකීමට දුෂ්කර වූ, අතිශය සියුම් වූ මේ ධර්මය රාගයෙන් ඇලී සිටින්නෝ, අවිද්‍යා අන්ධකාරයෙන් වැසී සිටින්නෝ නොදකිති.\" මෙසේ භාග්‍යවතුන් වහන්සේ කල්පනා කරන කල්හි, උන්වහන්සේගේ සිත ධර්ම දේශනා කිරීමට නොව, අල්පෝත්සුක භාවයට (ක්‍රියාශීලී නොවීම) නැඹුරු විය.\n\nඑකල්හි, සහම්පති බ්‍රහ්මයාට භාග්‍යවතුන් වහන්සේගේ සිතෙහි වූ මේ සිතිවිල්ල දැන, මෙසේ සිතුණි: \"භවත්නි, ලෝකය නැසෙන්නේය, භවත්නි, ලෝකය විනාශ වන්නේය! අරහත් සම්මා සම්බුදු වූ තථාගතයන් වහන්සේගේ සිත ධර්ම දේශනා කිරීමට නොව, අල්පෝත්සුක භාවයට නැමෙන්නේ නම් (මෙය කොපමණ භයානකද)!\" එකල්හි සහම්පති බ්‍රහ්මයා, බලවත් පුරුෂයෙක් හැකිළුෑ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරි අතක් හකුළුවන්නාක් මෙන්, බ්‍රහ්ම ලෝකයෙන් අතුරුදහන් වී භාග්‍යවතුන් වහන්සේ ඉදිරියේ පහළ විය. එකල්හි සහම්පති බ්‍රහ්මයා තනි කර මත උත්තරාසංගය තබා, දකුණු දණ මණ්ඩලය පොළොවෙහි තබා, භාග්‍යවතුන් වහන්සේ වැඩසිටින දිශාවට ඇඳිලි බැඳ, භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ ධර්මය දේශනා කරන සේක්වා! සුගතයන් වහන්ස, ධර්මය දේශනා කරන සේක්වා! අල්ප වූ ක්ලේශ (දූවිලි) සහිත සත්වයෝ සිටිති. ඔවුහු ධර්මය නොඇසීමෙන් පිරිහෙති. ධර්මය අවබෝධ කරන්නෝද ඇතිවන්නාහ.\" සහම්පති බ්‍රහ්මයා මේ කාරණය කීවේය. මේ කාරණය කියා, තවත් මෙසේ කීවේය: \"පෙර මගධ දේශයෙහි, මල සහිත වූවන් විසින් කල්පනා කරන ලද, අශුද්ධ ධර්මයක් පහළ විය. අමෘතයෙහි දොරටුව විවෘත කරන සේක්වා! නිර්මල වූ තථාගතයන් වහන්සේ විසින් අවබෝධ කරන ලද ධර්මය අසත්වා! පර්වත මුදුනක සිටින්නෙකු, සෑම දිශාවකින්ම මිනිසුන් දකින්නාක් මෙන්, සමන්තචක්ඛු (සියල්ල දකින) වූ, මහා ප්‍රඥා ඇත්තා වූ ඔබ වහන්සේ, ධර්මය නම් වූ ප්‍රාසාදයට නැඟී, ශෝකයෙන් පෙළෙන, ඉපදීමෙන් හා ජරාවෙන් පීඩිත වූ, ශෝක රහිත වූ ඔබ වහන්සේ, ජනතාව වෙත බලන සේක්වා! සටන ජයගත් වීරයාණන් වහන්ස, නැගිටින සේක්වා! සත්ව සමූහයාට නායකයාණන් වහන්ස, ණය රහිත වූවාක් මෙන් ලෝකයෙහි හැසිරෙන සේක්වා! භාග්‍යවතුන් වහන්සේ ධර්මය දේශනා කරන සේක්වා! ධර්මය අවබෝධ කරන්නෝ සිටින්නෝය.\"\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ බ්‍රහ්මයාගේ ආරාධනාවද දැන, සත්වයන් කෙරෙහි කරුණාවද මුල් කරගෙන, බුදු ඇසින් ලෝකය නිරීක්ෂණය කළ සේක. බුදු ඇසින් ලෝකය නිරීක්ෂණය කරන භාග්‍යවතුන් වහන්සේ, අල්ප ක්ලේශ (දූවිලි) ඇති, මහ ක්ලේශ ඇති, තියුණු ඉන්ද්‍රියන් ඇති, මොළොක් ඉන්ද්‍රියන් ඇති, යහපත් ආකාර ඇති (යහපත් ගතිගුණ ඇති), අයහපත් ආකාර ඇති (අයහපත් ගතිගුණ ඇති), පහසුවෙන් අවබෝධ කරවිය හැකි, දුෂ්කරව අවබෝධ කරවිය හැකි, සමහරෙක් පරලොවෙහි වරදට බියවී වාසය කරන්නාවූ, සමහරෙක් පරලොවෙහි වරදට බිය නොවී වාසය කරන්නාවූ සත්වයන් දුටු සේක. යම්සේ නෙළුම් පොකුණක හෝ පියුම් පොකුණක හෝ පුන්ඩරීක පොකුණක හෝ සමහර නෙළුම් හෝ පියුම් හෝ පුන්ඩරීක, ජලයෙහි උපදින්නාහු, ජලයෙහි වැඩෙන්නාහු, ජලයෙන් මතු නොවී, ජලය තුළ ගිලී පෝෂණය වන්නාහුද, සමහර නෙළුම් හෝ පියුම් හෝ පුන්ඩරීක, ජලයෙහි උපදින්නාහු, ජලයෙහි වැඩෙන්නාහු, ජලය සමඟ සම මට්ටමින් පිහිටා ඇත්තාහුද, සමහර නෙළුම් හෝ පියුම් හෝ පුන්ඩරීක, ජලයෙහි උපදින්නාහු, ජලයෙහි වැඩෙන්නාහු, ජලයෙන් ඉහළට නැඟී, ජලයෙන් නොතැවරී පිහිටා ඇත්තාහුද, එලෙසින්ම භාග්‍යවතුන් වහන්සේ බුදු ඇසින් ලෝකය නිරීක්ෂණය කරන සේක්, අල්ප ක්ලේශ ඇති, මහ ක්ලේශ ඇති, තියුණු ඉන්ද්‍රියන් ඇති, මොළොක් ඉන්ද්‍රියන් ඇති, යහපත් ආකාර ඇති, අයහපත් ආකාර ඇති, පහසුවෙන් අවබෝධ කරවිය හැකි, දුෂ්කරව අවබෝධ කරවිය හැකි, සමහරෙක් පරලොවෙහි වරදට බියවී වාසය කරන්නාවූ, සමහරෙක් පරලොවෙහි වරදට බිය නොවී වාසය කරන්නාවූ සත්වයන් දුටු සේක. සහම්පති බ්‍රහ්මයා දැක, ගාථාවකින් මෙසේ පිළිතුරු දුන් සේක: \"බ්‍රහ්මය, අමෘතයෙහි දොරටු ඔවුනට විවෘත වී ඇත. කන් ඇති අය ශ්‍රද්ධාව මුදා හරිත්වා! මිනිසුන් අතර ප්‍රණීත ධර්මය ප්‍රකාශ නොකරමි යි හිංසා සහගත සිතකින් සිටියේය.\" එකල්හි සහම්පති බ්‍රහ්මයා \"භාග්‍යවතුන් වහන්සේ විසින් ධර්ම දේශනා කිරීම සඳහා මට අවස්ථාව සලසා දෙන ලදී\" යි කියා, භාග්‍යවතුන් වහන්සේට වැඳ, පැදකුණු කර, එතැනම අතුරුදහන් විය.",
      "paliTitle": "Brahmāyācanasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 173,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā uruvelāyaṃ viharati najjā nerañjarāya tīre ajapālanigrodhamūle paṭhamābhisambuddho. Atha kho bhagavato rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘‘dukkhaṃ kho agāravo viharati appatisso, kaṃ nu khvāhaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā [garukatvā (sī. syā. kaṃ. pī.)] upanissāya vihareyya’’nti? Atha kho bhagavato etadahosi – ‘‘aparipuṇṇassa kho sīlakkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya attanā sīlasampannataraṃ aññaṃ samaṇaṃ vā brāhmaṇaṃ vā, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyyaṃ. ‘‘Aparipuṇṇassa kho samādhikkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake loke…pe… attanā samādhisampannataraṃ aññaṃ samaṇaṃ vā brāhmaṇaṃ vā, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyyaṃ. ‘‘Aparipuṇṇassa paññākkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake…pe… attanā paññāsampannataraṃ aññaṃ samaṇaṃ vā brāhmaṇaṃ vā, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyyaṃ. ‘‘Aparipuṇṇassa kho vimuttikkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake…pe… attanā vimuttisampannataraṃ aññaṃ samaṇaṃ vā brāhmaṇaṃ vā, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyyaṃ. ‘‘Aparipuṇṇassa kho vimuttiñāṇadassanakkhandhassa pāripūriyā aññaṃ samaṇaṃ vā brāhmaṇaṃ vā sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Na kho panāhaṃ passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya attanā vimuttiñāṇadassanasampannataraṃ aññaṃ samaṇaṃ vā brāhmaṇaṃ vā, yamahaṃ sakkatvā garuṃ katvā upanissāya vihareyyaṃ. Yaṃnūnāhaṃ yvāyaṃ dhammo mayā abhisambuddho tameva dhammaṃ sakkatvā garuṃ katvā upanissāya vihareyya’’nti. Atha kho brahmā sahampati bhagavato cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya pasāritaṃ vā bāhaṃ samiñjeyya evameva – brahmaloke antarahito bhagavato purato pāturahosi. Atha kho brahmā sahampati ekaṃsaṃ uttarāsaṅgaṃ karitvā yena bhagavā tenañjaliṃ paṇāmetvā bhagavantaṃ etadavoca – ‘‘evametaṃ, bhagavā, evametaṃ, sugata! Yepi te, bhante, ahesuṃ atītamaddhānaṃ arahanto sammāsambuddhā, tepi bhagavanto dhammaññeva sakkatvā garuṃ katvā upanissāya vihariṃsu; yepi te, bhante, bhavissanti anāgatamaddhānaṃ arahanto sammāsambuddhā tepi bhagavanto dhammaññeva sakkatvā garuṃ katvā upanissāya viharissanti. Bhagavāpi, bhante, etarahi arahaṃ sammāsambuddho dhammaññeva sakkatvā garuṃ katvā upanissāya viharatū’’ti. Idamavoca brahmā sahampati, idaṃ vatvā athāparaṃ etadavoca – ‘‘Ye ca atītā sambuddhā, ye ca buddhā anāgatā; Yo cetarahi sambuddho, bahūnaṃ [bahunnaṃ (sī. syā. kaṃ. pī.)] sokanāsano. ‘‘Sabbe saddhammagaruno, vihaṃsu [vihariṃsu (sī. syā. kaṃ. pī.)] viharanti ca; Tathāpi viharissanti, esā buddhāna dhammatā. ‘‘Tasmā hi attakāmena [atthakāmena (sī. pī. ka.)], mahattamabhikaṅkhatā; Saddhammo garukātabbo, saraṃ buddhāna sāsana’’nti.",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling in Uruvelā, on the bank of the Nerañjarā River, at the foot of the Ajapāla Banyan tree, having newly become fully enlightened.\n\nThen, while the Blessed One was in seclusion, having entered into solitude, a thought arose in his mind: \"It is indeed difficult to live without reverence, without deference. Whom could I live in dependence upon, respecting and holding in high esteem, whether a monastic or a brahmin?\" Then it occurred to the Blessed One: \"If my aggregate of morality were incomplete, I would live in dependence upon another monastic or brahmin, respecting and holding them in high esteem, for the sake of its completion. However, I do not see any other monastic or brahmin in this world with its deities, Māras, and Brahmās, among the host of beings including monastics, brahmins, deities, and humans, who is more perfect in morality than I, whom I could live in dependence upon, respecting and holding in high esteem.\n\n\"If my aggregate of concentration were incomplete, I would live in dependence upon another monastic or brahmin, respecting and holding them in high esteem, for the sake of its completion. However, I do not see any other monastic or brahmin in this world with its deities, Māras, and Brahmās, among the host of beings including monastics, brahmins, deities, and humans, who is more perfect in concentration than I, whom I could live in dependence upon, respecting and holding in high esteem.\n\n\"If my aggregate of wisdom were incomplete, I would live in dependence upon another monastic or brahmin, respecting and holding them in high esteem, for the sake of its completion. However, I do not see any other monastic or brahmin in this world with its deities, Māras, and Brahmās, among the host of beings including monastics, brahmins, deities, and humans, who is more perfect in wisdom than I, whom I could live in dependence upon, respecting and holding in high esteem.\n\n\"If my aggregate of liberation were incomplete, I would live in dependence upon another monastic or brahmin, respecting and holding them in high esteem, for the sake of its completion. However, I do not see any other monastic or brahmin in this world with its deities, Māras, and Brahmās, among the host of beings including monastics, brahmins, deities, and humans, who is more perfect in liberation than I, whom I could live in dependence upon, respecting and holding in high esteem.\n\n\"If my aggregate of the knowledge and vision of liberation were incomplete, I would live in dependence upon another monastic or brahmin, respecting and holding them in high esteem, for the sake of its completion. However, I do not see any other monastic or brahmin in this world with its deities, Māras, and Brahmās, among the host of beings including monastics, brahmins, deities, and humans, who is more perfect in the knowledge and vision of liberation than I, whom I could live in dependence upon, respecting and holding in high esteem. What if I were to live in dependence upon, respecting and holding in high esteem, this very Dhamma which I have fully awakened to?\"\n\nThen Brahmā Sahampati, knowing with his mind the thought that had arisen in the Blessed One's mind—just as a strong man might extend his flexed arm or flex his extended arm—vanished from the Brahmā-world and appeared before the Blessed One. Then Brahmā Sahampati, arranging his upper robe over one shoulder, bowed to the Blessed One with his hands held in anjali, and said to him: \"So it is, Blessed One! So it is, Fortunate One! Indeed, all those Blessed Ones, Arahants, Perfectly Self-Awakened Ones, who appeared in the past, lived in dependence upon the Dhamma itself, respecting and holding it in high esteem. And all those Blessed Ones, Arahants, Perfectly Self-Awakened Ones, who will appear in the future, will live in dependence upon the Dhamma itself, respecting and holding it in high esteem. And may the Blessed One, the Arahant, the Perfectly Self-Awakened One, now also live in dependence upon the Dhamma itself, respecting and holding it in high esteem.\"\n\nThus spoke Brahmā Sahampati. Having said this, he further spoke:\n\"Those Buddhas who were in the past, and those Buddhas who will be in the future; and this Buddha who is now, the dispeller of sorrow for many—\nAll of them lived, live, and will live with deep respect for the true Dhamma. This is the nature of the Buddhas.\nTherefore, one who desires their own true welfare and aspires to greatness should revere the true Dhamma, remembering the Buddha's teaching.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ උරුවේලාවෙහි නේරංජරා නදී තීරයෙහි අජපාල නුග රුක්මුලෙහි, පළමුව සම්බුද්ධත්වයට පත් වූ සේක්, වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ රහස් තැනක හුදෙකලාව හා ප්‍රතිසංලීනව වැඩසිටින කල්හි සිතෙහි මේ විතර්කය පහළ විය: \"ගෞරවයක් නැතිව, ගෞරව කළ යුත්තෙකු නැතිව වාසය කිරීම දුකකි. මම කවර ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නෙම්ද?\"\n\nඑකල්හි භාග්‍යවතුන් වහන්සේට මෙසේ සිතුණි: \"සම්පූර්ණ නොවූ සීලස්කන්ධය සම්පූර්ණ කරගැනීම සඳහා නම්, මම අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නෙමි. එහෙත්, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණ-බ්‍රාහ්මණයන් සහිත වූ, දෙවි-මිනිසුන් සහිත වූ මේ ලෝකයෙහි, මා හට වඩා සීලයෙන් සම්පූර්ණ වූ, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කළ හැකි අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු මම නොදකිමි.\n\n\"සම්පූර්ණ නොවූ සමාධිස්කන්ධය සම්පූර්ණ කරගැනීම සඳහා නම්, මම අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නෙමි. එහෙත්, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණ-බ්‍රාහ්මණයන් සහිත වූ, දෙවි-මිනිසුන් සහිත වූ මේ ලෝකයෙහි, මා හට වඩා සමාධියෙන් සම්පූර්ණ වූ, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කළ හැකි අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු මම නොදකිමි.\n\n\"සම්පූර්ණ නොවූ ප්‍රඥාස්කන්ධය සම්පූර්ණ කරගැනීම සඳහා නම්, මම අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නෙමි. එහෙත්, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණ-බ්‍රාහ්මණයන් සහිත වූ, දෙවි-මිනිසුන් සහිත වූ මේ ලෝකයෙහි, මා හට වඩා ප්‍රඥාවෙන් සම්පූර්ණ වූ, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කළ හැකි අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු මම නොදකිමි.\n\n\"සම්පූර්ණ නොවූ විමුක්තිස්කන්ධය සම්පූර්ණ කරගැනීම සඳහා නම්, මම අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නෙමි. එහෙත්, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණ-බ්‍රාහ්මණයන් සහිත වූ, දෙවි-මිනිසුන් සහිත වූ මේ ලෝකයෙහි, මා හට වඩා විමුක්තියෙන් සම්පූර්ණ වූ, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කළ හැකි අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු මම නොදකිමි.\n\n\"සම්පූර්ණ නොවූ විමුක්තිඥානදර්ශනස්කන්ධය සම්පූර්ණ කරගැනීම සඳහා නම්, මම අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නෙමි. එහෙත්, දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණ-බ්‍රාහ්මණයන් සහිත වූ, දෙවි-මිනිසුන් සහිත වූ මේ ලෝකයෙහි, මා හට වඩා විමුක්තිඥානදර්ශනයෙන් සම්පූර්ණ වූ, මා විසින් සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කළ හැකි අන්‍ය ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු මම නොදකිමි.\"\n\n\"එසේ නම්, මා විසින්ම අවබෝධ කරගන්නා ලද මේ ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නෙමි.\"\n\nඑකල්හි සහම්පති බ්‍රහ්මයා භාග්‍යවතුන් වහන්සේගේ සිතෙහි වූ මේ විතර්කය තමාගේ සිතින්ම දැනගෙන, යම්සේ බලවත් පුද්ගලයෙක් හකුළුවන ලද අතක් දිග හරින්නේද, දිග හරින ලද අතක් හකුළුවන්නේද, එපරිද්දෙන්ම, බ්‍රහ්ම ලෝකයෙන් අතුරුදහන් වී භාග්‍යවතුන් වහන්සේ ඉදිරියෙහි ප්‍රකට විය.\n\nඑකල්හි සහම්පති බ්‍රහ්මයා උතුරු සළුව එක අංසයක් මත තබාගෙන, භාග්‍යවතුන් වහන්සේ වැඩසිටින දිසාවට ඇඳිලි බැඳ, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"භාග්‍යවතුන් වහන්ස, සුගතයන් වහන්ස, එය එසේමය! එය එසේමය! වහන්ස, අතීත කාලයෙහි යම් අරහත් සම්මා සම්බුදුවරුන් වැඩසිටියෝද, ඒ භාග්‍යවතුන් වහන්සේලා ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කළෝය. වහන්ස, අනාගත කාලයෙහි යම් අරහත් සම්මා සම්බුදුවරුන් පහළ වන්නෝද, ඒ භාග්‍යවතුන් වහන්සේලාද ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන්නාහ. වහන්ස, භාග්‍යවතුන් වහන්සේද මේ දැන් අරහත් සම්මා සම්බුදුවරයෙකු වන සේක්, ධර්මයම සත්කාර කොට, ගරු කොට, ඇසුරු කරමින් වාසය කරන සේක්වා!\"\n\nසහම්පති බ්‍රහ්මයා මේ කාරණය පැවසුවේය. මේ කාරණය පවසා නැවතත් මෙසේ පැවසුවේය:\n\"අතීතයෙහි පහළ වූ යම් සම්බුදුවරයෝද, අනාගතයෙහි පහළ වන්නා වූ යම් බුදුවරයෝද,\nබහුජනයාගේ ශෝකය නසන යම් සම්බුදුවරයෙක් මේ දැන් වැඩසිටින්නේද,\nඒ සියලු දෙනාම සද්ධර්මයට ගරු කරන්නෝ වූහ, වර්තමාන බුදුන් වහන්සේද සද්ධර්මයට ගරු කරන සේක.\nඑසේම අනාගත බුදුවරුද සද්ධර්මයට ගරු කරමින් වාසය කරන්නාහ. මෙය බුදුවරුන්ගේ ස්වභාවයයි.\nඑබැවින් තමන්ගේ යහපත කැමති, ශ්‍රේෂ්ඨත්වය පතන තැනැත්තා විසින්,\nබුදුරජාණන් වහන්සේලාගේ ශාසනය සිහි කරමින් සද්ධර්මයට ගරු කළ යුතුය.\"",
      "paliTitle": "Gāravasuttaṃ"
    },
    {
      "number": 174,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena aññatarissā brāhmaṇiyā brahmadevo nāma putto bhagavato santike agārasmā anagāriyaṃ pabbajito hoti. Atha kho āyasmā brahmadevo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā brahmadevo arahataṃ ahosi. Atha kho āyasmā brahmadevo pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ sapadānaṃ piṇḍāya caramāno yena sakamātu nivesanaṃ tenupasaṅkami. Tena kho pana samayena āyasmato brahmadevassa mātā brāhmaṇī brahmuno āhutiṃ niccaṃ paggaṇhāti. Atha kho brahmuno sahampatissa etadahosi – ‘‘ayaṃ kho āyasmato brahmadevassa mātā brāhmaṇī brahmuno āhutiṃ niccaṃ paggaṇhāti. Yaṃnūnāhaṃ taṃ upasaṅkamitvā saṃvejeyya’’nti. Atha kho brahmā sahampati – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – brahmaloke antarahito āyasmato brahmadevassa mātu nivesane pāturahosi. Atha kho brahmā sahampati vehāsaṃ ṭhito āyasmato brahmadevassa mātaraṃ brāhmaṇiṃ gāthāya ajjhabhāsi – ‘‘Dūre ito brāhmaṇi brahmaloko, Yassāhutiṃ paggaṇhāsi niccaṃ; Netādiso brāhmaṇi brahmabhakkho, Kiṃ jappasi brahmapathaṃ ajānaṃ [ajānantī (sī. pī. ka.)]. ‘‘Eso hi te brāhmaṇi brahmadevo, Nirūpadhiko atidevapatto; Akiñcano bhikkhu anaññaposī, Yo te so [te so (sī. pī.), yo te sa (?)] piṇḍāya gharaṃ paviṭṭho. ‘‘Āhuneyyo vedagu bhāvitatto, Narānaṃ devānañca dakkhiṇeyyo; Bāhitvā pāpāni anūpalitto, Ghāsesanaṃ iriyati sītibhūto. ‘‘Na tassa pacchā na puratthamatthi, Santo vidhūmo anigho nirāso; Nikkhittadaṇḍo tasathāvaresu, So tyāhutiṃ bhuñjatu aggapiṇḍaṃ. ‘‘Visenibhūto upasantacitto, Nāgova danto carati anejo; Bhikkhu susīlo suvimuttacitto, So tyāhutiṃ bhuñjatu aggapiṇḍaṃ. ‘‘Tasmiṃ pasannā avikampamānā, Patiṭṭhapehi dakkhiṇaṃ dakkhiṇeyye; Karohi puññaṃ sukhamāyatikaṃ, Disvā muniṃ brāhmaṇi oghatiṇṇa’’nti. ‘‘Tasmiṃ pasannā avikampamānā, Patiṭṭhapesi dakkhiṇaṃ dakkhiṇeyye; Akāsi puññaṃ sukhamāyatikaṃ, Disvā muniṃ brāhmaṇī oghatiṇṇa’’nti.",
      "english": "Thus have I heard – on one occasion the Blessed One was dwelling at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s Park. At that time, a son named Brahmadeva, belonging to a certain brahmin woman, had gone forth from the home life into homelessness in the presence of the Blessed One. Then, dwelling alone, secluded, diligent, ardent, and resolute, Venerable Brahmadeva, not long after, by his own direct knowledge, realized and attained in this very life the unsurpassed culmination of the holy life, for the sake of which noble sons rightly go forth from the home life into homelessness. He directly knew: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’ And Venerable Brahmadeva became one of the arahants.\n\nThen, in the forenoon, Venerable Brahmadeva dressed himself, took his bowl and robe, and entered Sāvatthī for alms. While walking for alms in Sāvatthī from house to house, he approached his own mother’s residence. At that time, Venerable Brahmadeva’s mother, the brahmin woman, regularly offered oblations to Brahmā.\n\nThen it occurred to Brahmā Sahampati: ‘This brahmin woman, Venerable Brahmadeva’s mother, regularly offers oblations to Brahmā. What if I were to approach her and stir her to spiritual urgency?’ Then Brahmā Sahampati, just as a strong man might extend his flexed arm or flex his extended arm, vanished from the Brahmā-world and reappeared in Venerable Brahmadeva’s mother’s residence. Then Brahmā Sahampati, standing in mid-air, addressed Venerable Brahmadeva’s mother, the brahmin woman, with stanzas:\n\n‘Far from here, brahmin woman, is the Brahmā-world,\nTo which you constantly offer oblations.\nNot of this sort, brahmin woman, is the one who partakes of Brahmā’s offerings.\nWhy do you mutter mantras, not knowing the path to Brahmā?\n\n‘This Brahmadeva, brahmin woman, is without any attachments,\nHe has attained beyond the devas.\nA mendicant with no possessions, who does not need to be supported by another,\nIt is he who has entered your house for alms.\n\n‘Worthy of offerings, a master of ultimate knowledge, with a mind developed,\nWorthy of gifts from humans and devas;\nHaving expelled evil deeds, unstained,\nHe goes on his alms round, cooled.\n\n‘For him there is neither past nor future;\nPeaceful, smokeless, without suffering, without longing;\nHaving laid down the rod towards all beings, trembling or still—\nLet him partake of your oblation, the finest food.\n\n‘Having shed all hostile forces, with a mind utterly peaceful,\nLike a tamed elephant, he wanders, unshaken.\nA mendicant of excellent virtue, with a perfectly liberated mind—\nLet him partake of your oblation, the finest food.\n\n‘Having confidence in him, brahmin woman, unwavering,\nEstablish your offering in this worthy recipient.\nCreate merit that will bring happiness in the future,\nHaving seen the sage who has crossed the flood.’\n\n‘Having confidence in him, unwavering,\nShe established her offering in that worthy recipient.\nShe created merit that will bring happiness in the future,\nHaving seen the sage who had crossed the flood.’",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එසමයෙහි එක්තරා බ්‍රාහ්මණියකගේ බ්‍රහ්මදේව නම් පුත්‍රයා භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට පැමිණ සිටියේය. ඉක්බිති ආයුෂ්මත් බ්‍රහ්මදේව තෙරණුවෝ තනිව, ඈත් වී, අප්‍රමාදීව, වීර්යය සහිතව, වීර්යය මුල්කරගෙන වසන කල්හි නොබෝ කලකින්ම – යම් අර්ථයක් පිණිස කුලපුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික ප්‍රව්‍රජ්‍යාවට පැමිණෙත්ද, ඒ අනුත්තර බ්‍රහ්මචරියාවේ කෙළවර වූ අරහත්වය මේ ආත්මභාවයෙහිම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කළහ. “ඉපදීම ක්ෂය විය, බ්‍රහ්මචර්යාව වැස නිමවන ලදී, කළ යුත්ත කරන ලදී, නැවත මේ තත්ත්වයට (භවයකට) පැමිණීමක් නැත” යි අවබෝධ කළහ. ආයුෂ්මත් බ්‍රහ්මදේව තෙරණුවෝ රහතන් වහන්සේලා අතරින් එක් නමක් වූහ.\n\nඉක්බිති ආයුෂ්මත් බ්‍රහ්මදේව තෙරණුවෝ පෙරවරු වේලෙහි සිවුරු පොරවා පාත්‍ර සිවුරු රැගෙන සැවැත් නුවරට පිඬු සිඟා වඩින්නට පිවිසියහ. සැවැත් නුවර පිඬු සිඟා වඩිනා අතර තම මෑණියන්ගේ නිවස වෙත පැමිණියහ. එසමයෙහි ආයුෂ්මත් බ්‍රහ්මදේව තෙරුන්ගේ මෑණියන් වූ බ්‍රාහ්මණිය බ්‍රහ්මයා උදෙසා නිරන්තරයෙන්ම පූජා පවත්වමින් සිටියාය.\n\nඉක්බිති සහම්පති බ්‍රහ්මයාට මේ අදහස ඇති විය – “මේ ආයුෂ්මත් බ්‍රහ්මදේව තෙරුන්ගේ මෑණියන් වන බ්‍රාහ්මණිය බ්‍රහ්මයාට නිරන්තරයෙන්ම පූජා පවත්වන්නීය. මම ඇය වෙත පැමිණ සංවේගයට පත් කළොත් මැනවි” යි. ඉක්බිති සහම්පති බ්‍රහ්මයා – යම්සේ බලවතෙක් හැකිලූ අතක් දිගහරින්නට හෝ දිගහැරී අතක් හකුළුවන්නට තරම් කෙටි කලකින් – බ්‍රහ්ම ලෝකයෙන් අතුරුදහන් වී ආයුෂ්මත් බ්‍රහ්මදේව තෙරුන්ගේ මෑණියන්ගේ නිවසෙහි පහළ විය. ඉක්බිති සහම්පති බ්‍රහ්මයා අහසෙහි සිටගෙන ආයුෂ්මත් බ්‍රහ්මදේව තෙරුන්ගේ මෑණියන් වූ බ්‍රාහ්මණියට ගාථාවකින් මෙසේ කීවේය –\n\n“බ්‍රාහ්මණිය, ඔබ නිරන්තරයෙන් යම් බ්‍රහ්ම ලෝකයක් පිණිස පූජා පවත්වන්නෙහිද, ඒ බ්‍රහ්ම ලෝකය මෙතැනින් බොහෝ ඈතයි. බ්‍රාහ්මණිය, බ්‍රහ්මයන්ට අනුභවය පිණිස යෝග්‍ය දේ මේවා නොවේ. බ්‍රහ්ම මාර්ගය නොදැන ඔබ කුමක්ද ජප කරන්නේ?”\n\n“බ්‍රාහ්මණිය, මෙහි ඔබගේ බ්‍රහ්මදේව නම් පුත්‍රයා ඇත. ඔහු උපධි රහිතයි, දෙවියන්ටත් වඩා උතුම් තත්ත්වයට පත් වී සිටියි. ඔහු කිසිවක් නැති (නිෂ්කිංචන) භික්ෂුවකි, අනුන් පෝෂණය කරන්නේ නොවේ. ඔහු ඔබගේ නිවසට පිඬු සිඟා පිවිසියේය.”\n\n“ඔහු පූජාවන්ට සුදුසුය, වේද (ත්‍රිවිද්‍යාව) අවබෝධ කළ කෙනෙකි, භාවනානුයෝගීව දියුණු කරගත් ආත්මභාවය ඇත්තෙකි. මිනිසුන්ටත් දෙවියන්ටත් දක්ෂිණාවට සුදුසුය. පව් දුරු කොට කෙලෙස් වලින් නොගැලී, සන්සිඳුණු සිත් ඇත්තෙක් වී පිඬු සිඟා යයි.”\n\n“ඔහුට අතීතය හෝ අනාගතය කියා දෙයක් නැත. ඔහු ශාන්තය, කෙලෙස් දුම්වලින් තොරය, කිසිදු දුකක් නැත්තෙකි, තෘෂ්ණාවන්ගෙන් තොරය. ඔහු තැතිගන්නා වූ සහ තැති නොගන්නා වූ (ත්‍රස්ත හා ස්ථාවර) සියලු සත්වයන් කෙරෙහි දඬු මුගුරු බහා තැබූ කෙනෙකි. ඔහු ඔබේ උතුම් පිණ්ඩපාතය අනුභව කරත්වා!”\n\n“ඔහු කෙලෙස් සතුරු සේනාවෙන් මිදුණේය, උපශාන්ත සිත් ඇත්තේය. හීලෑ කළ ඇතකු සේ කම්පන රහිතව හැසිරෙයි. ඔහු මනා සිල් ඇති, මනාකොට විමුක්ත වූ සිත් ඇති භික්ෂුවකි. ඔහු ඔබේ උතුම් පිණ්ඩපාතය අනුභව කරත්වා!”\n\n“ඔහු කෙරෙහි ප්‍රසන්නව, නොසැලී, දක්ෂිණාවට සුදුසු ඒ භික්ෂුවට ඔබගේ දක්ෂිණාව පිහිටුවන්න. බ්‍රාහ්මණිය, ඕඝයන් (සංසාර සාගරය) තරණය කළ ඒ මුනිවරයා දැක, අනාගතය සඳහා සැප දෙන පිනක් සිදු කරගන්න” යි.\n\n“ඇය ඔහු කෙරෙහි ප්‍රසන්නව, නොසැලී, දක්ෂිණාවට සුදුසු ඒ භික්ෂුවට තමන්ගේ දක්ෂිණාව පිහිටවූවාය. ඕඝයන් තරණය කළ ඒ මුනිවරයා දැක, අනාගතය සඳහා සැප දෙන පිනක් සිදු කරගත්තාය” යි.",
      "paliTitle": "Brahmadevasuttaṃ"
    },
    {
      "number": 175,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena bakassa brahmuno evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ hoti – ‘‘idaṃ niccaṃ, idaṃ dhuvaṃ, idaṃ sassataṃ, idaṃ kevalaṃ, idaṃ acavanadhammaṃ, idañhi na jāyati na jīyati na mīyati na cavati na upapajjati, ito ca panaññaṃ uttariṃ [uttariṃ (sī. syā. kaṃ. pī.)] nissaraṇaṃ natthī’’ti. Atha kho bhagavā bakassa brahmuno cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – jetavane antarahito tasmiṃ brahmaloke pāturahosi. Addasā kho bako brahmā bhagavantaṃ dūratova āgacchantaṃ. Disvāna bhagavantaṃ etadavoca – ‘‘ehi kho mārisa, svāgataṃ te, mārisa! Cirassaṃ kho mārisa! Imaṃ pariyāyamakāsi yadidaṃ idhāgamanāya. Idañhi, mārisa, niccaṃ, idaṃ dhuvaṃ, idaṃ sassataṃ, idaṃ kevalaṃ, idaṃ acavanadhammaṃ, idañhi na jāyati na jīyati na mīyati na cavati na upapajjati. Ito ca panaññaṃ uttari nissaraṇaṃ natthī’’ti. Evaṃ vutte, bhagavā bakaṃ brahmānaṃ etadavoca – ‘‘avijjāgato vata, bho, bako brahmā; avijjāgato vata, bho, bako brahmā. Yatra hi nāma aniccaṃyeva samānaṃ niccanti vakkhati, adhuvaṃyeva samānaṃ dhuvanti vakkhati, asassataṃyeva samānaṃ sassatanti vakkhati, akevalaṃyeva samānaṃ kevalanti vakkhati, cavanadhammaṃyeva samānaṃ acavanadhammanti vakkhati. Yattha ca pana jāyati ca jīyati ca mīyati ca cavati ca upapajjati ca, tañca tathā vakkhati – ‘idañhi na jāyati na jīyati na mīyati na cavati na upapajjati’. Santañca panaññaṃ uttari nissaraṇaṃ, ‘natthaññaṃ uttari nissaraṇa’nti vakkhatī’’ti. ‘‘Dvāsattati gotama puññakammā, Vasavattino jātijaraṃ atītā; Ayamantimā vedagū brahmupapatti, Asmābhijappanti janā anekā’’ti. ‘‘Appañhi etaṃ na hi dīghamāyu, Yaṃ tvaṃ baka maññasi dīghamāyuṃ; Sataṃ sahassānaṃ [sahassāna (syā. kaṃ.)] nirabbudānaṃ, Āyuṃ pajānāmi tavāhaṃ brahme’’ti. ‘‘Anantadassī bhagavāhamasmi, Jātijaraṃ sokamupātivatto; Kiṃ me purāṇaṃ vatasīlavattaṃ, Ācikkha me taṃ yamahaṃ vijaññā’’ti. ‘‘Yaṃ tvaṃ apāyesi bahū manusse, Pipāsite ghammani samparete; Taṃ te purāṇaṃ vatasīlavattaṃ, Suttappabuddhova anussarāmi. ‘‘Yaṃ eṇikūlasmiṃ janaṃ gahītaṃ, Amocayī gayhakaṃ nīyamānaṃ; Taṃ te purāṇaṃ vatasīlavattaṃ, Suttappabuddhova anussarāmi. ‘‘Gaṅgāya sotasmiṃ gahītanāvaṃ, Luddena nāgena manussakamyā; Pamocayittha balasā pasayha, Taṃ te purāṇaṃ vatasīlavattaṃ, Suttappabuddhova anussarāmi. ‘‘Kappo ca te baddhacaro ahosiṃ, Sambuddhimantaṃ [sambuddhivantaṃ (bahūsu)] vatinaṃ amaññi; Taṃ te purāṇaṃ vatasīlavattaṃ, Suttappabuddhova anussarāmī’’ti. ‘‘Addhā pajānāsi mametamāyuṃ, Aññepi [aññampi (sī. pī.)] jānāsi tathā hi buddho; Tathā hi tyāyaṃ jalitānubhāvo, Obhāsayaṃ tiṭṭhati brahmaloka’’nti.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's monastery. Now, on that occasion, this evil pernicious view had arisen in Brahmā Baka: ‘This is permanent, this is stable, this is eternal, this is whole and complete, this is not subject to change. Indeed, this neither is born nor ages nor dies nor passes away nor is reborn. Furthermore, there is no other liberation beyond this.’ Then, the Blessed One, knowing with his mind the mental thought of Brahmā Baka – just as a strong man might extend his flexed arm or flex his extended arm – vanished from Jeta's Grove and appeared in that Brahmā world. Brahmā Baka saw the Blessed One approaching from afar. Having seen him, he said to the Blessed One: ‘Come, good sir, welcome, good sir! It has been a long time, good sir, since you made this journey, namely, to come here. Indeed, good sir, this is permanent, this is stable, this is eternal, this is whole and complete, this is not subject to change. Indeed, this neither is born nor ages nor dies nor passes away nor is reborn. Furthermore, there is no other liberation beyond this.’ When this was said, the Blessed One said to Brahmā Baka: ‘Indeed, dear sir, Brahmā Baka is steeped in ignorance; indeed, dear sir, Brahmā Baka is steeped in ignorance. For he declares that which is impermanent to be permanent, that which is unstable to be stable, that which is non-eternal to be eternal, that which is incomplete to be whole and complete, and that which is subject to change to be not subject to change. And where there is indeed birth, aging, death, passing away, and rebirth, he declares thus: \"Indeed, this neither is born nor ages nor dies nor passes away nor is reborn.\" And although there is another higher liberation, he declares: \"There is no other higher liberation.\"’\n\n‘Seventy-two virtuous deeds, Gotama, I have performed, having mastery and transcending birth and aging. This, for the knower, is the final birth in the Brahmā world. Many people yearn for this.’\n\n‘That is indeed a short life, Baka, not a long life, what you consider to be a long life. I know your life-span, Brahmā, as a hundred thousand nirabbudas.’\n\n‘You, Blessed One, are the one with infinite vision, who has transcended birth, aging, and sorrow. What were my former vows, moral practices, and observances? Tell me that, so I may know.’\n\n‘That time you slaked the thirst of many people, afflicted by thirst and overcome by heat – that was one of your former vows, moral practices, and observances. I recall it as if awakened from sleep.’\n\n‘That time you released the people seized at the bend of the river, who were being led away by a captor – that was one of your former vows, moral practices, and observances. I recall it as if awakened from sleep.’\n\n‘That time you forcibly and powerfully released a boat seized in the current of the Ganges by a cruel nāga, who desired human beings – that was one of your former vows, moral practices, and observances. I recall it as if awakened from sleep.’\n\n‘And for an eon, I was your bound attendant, and you considered me one who possessed profound wisdom and observed the vows. That was one of your former vows, moral practices, and observances. I recall it as if awakened from sleep.’\n\n‘Indeed, you know my lifespan, and you know other things too, for you are truly the Buddha. Your radiant splendor indeed stands illumining this Brahmā world.’",
      "sinhala": "මා විසින් මෙසේ අසන ලදි.\n\nඑක් සමයක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර අනාථපිණ්ඩික සිටුතුමා විසින් කරවන ලද ජේතවනාරාමයෙහි වැඩ සිටි සේක. එකල්හී බක නම් බ්‍රහ්මයා හට මෙබඳු වූ නපුරු දෘෂ්ටිගතයක් හටගෙන තිබුණි: “මෙය නිරතුරුව පවතී. මෙය ස්ථීර ය. මෙය සදාකාලික ය. මෙය නිරපේක්ෂ ය. මෙය නොනැසෙන ස්වභාව ඇත්තකි. මෙය උපදින්නෙක් නොවේ, දිරන්නෙක් නොවේ, මියයන්නෙක් නොවේ, චුතවන්නෙක් නොවේ, නැවත ඉපදෙන්නෙක් නොවේ. මීට වඩා උසස් වූ වෙනත් නිදහස් වීමක් නැතැ” යි.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ බක බ්‍රහ්මයාගේ සිතින් ඔහුගේ සිතිවිලි දැනගෙන, ශක්තිමත් පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරූ අතක් හකුලුවන්නාක් මෙන් ම, ජේතවනයෙහි අතුරුදහන් වී ඒ බ්‍රහ්ම ලෝකයෙහි පහළ වූ සේක. බක බ්‍රහ්ම තෙමේ දුරදීම භාග්‍යවතුන් වහන්සේ වැඩ එනවා දුටුවේය. දැක භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “එන්න, ආයුෂ්මත්නි, ඔබට ආයුබෝවන්! ආයුෂ්මත්නි, බොහෝ කලකින් ය. මෙහි පැමිණීමට මේ අවස්ථාව සලසා ගත්තේ ය. ආයුෂ්මත්නි, මෙය නිරතුරුව පවතී. මෙය ස්ථීර ය. මෙය සදාකාලික ය. මෙය නිරපේක්ෂ ය. මෙය නොනැසෙන ස්වභාව ඇත්තකි. මෙය උපදින්නෙක් නොවේ, දිරන්නෙක් නොවේ, මියයන්නෙක් නොවේ, චුතවන්නෙක් නොවේ, නැවත ඉපදෙන්නෙක් නොවේ. මීට වඩා උසස් වූ වෙනත් නිදහස් වීමක් නැතැ” යි.\n\nමෙසේ කී කල්හි, භාග්‍යවතුන් වහන්සේ බක බ්‍රහ්මයාට මෙය වදාළ සේක: “භවත් බක බ්‍රහ්ම තෙමේ අවිද්‍යාවට පැමිණ සිටින්නෙක් වන්නේ ය. භවත් බක බ්‍රහ්ම තෙමේ අවිද්‍යාවට පැමිණ සිටින්නෙක් වන්නේ ය. යම් හෙයකින් අනිත්‍ය වූ දෙයක්ම ‘නිත්‍ය ය’ යි කියන්නේ නම්, අස්ථීර වූ දෙයක්ම ‘ස්ථීර ය’ යි කියන්නේ නම්, අසදාකාලික වූ දෙයක්ම ‘සදාකාලික ය’ යි කියන්නේ නම්, නිරපේක්ෂ නොවන දෙයක්ම ‘නිරපේක්ෂ ය’ යි කියන්නේ නම්, නොනැසෙන ස්වභාවයෙන් යුතු නොවන දෙයක්ම ‘නොනැසෙන ස්වභාවයෙන් යුක්ත ය’ යි කියන්නේ නම්. යමක් උපදින, දිරන, මියයන, චුතවන, නැවත ඉපදෙන ස්වභාවයෙන් යුක්ත ද, එයම ‘මෙය උපදින්නෙක් නොවේ, දිරන්නෙක් නොවේ, මියයන්නෙක් නොවේ, චුතවන්නෙක් නොවේ, නැවත ඉපදෙන්නෙක් නොවේ’ යි එසේ කියන්නේ නම්. වෙනත් උසස් වූ නිදහස් වීමක් තිබියදීත්, ‘වෙනත් උසස් නිදහස් වීමක් නැතැ’ යි කියන්නේ නම්.”\n\n“භවත් ගෞතමයන් වහන්ස, අපගේ හැත්තෑ දෙකක් වූ පින්කම් ඇත. අපි වසවර්තී (තමාට වසඟ වූ) වෙමු. ඉපදීම හා දිරායාම ඉක්මවා ඇත්තෝ වෙමු. මෙය (බ්‍රහ්ම ලෝකය) අවසාන බ්‍රහ්ම උපත ය. මෙය දැනගත් බොහෝ ජනයෝ (මේ බ්‍රහ්ම ලෝකය) ප්‍රාර්ථනා කරති” යි.\n\n“බක බ්‍රහ්මය, ඔබ දීර්ඝායුෂ යැයි සිතන මේ ආයුෂ ඉතා කෙටි ය. එය දීර්ඝායුෂයක් නොවේ. බ්‍රහ්මය, ඔබගේ ආයුෂ නිරබ්බුද ලක්ෂ ගණනක් වන බව මම දනිමි” යි.\n\n“භාග්‍යවතුන් වහන්ස, මම අනන්තදර්ශී (අසීමිත දැක්මක් ඇති) කෙනෙක් වෙමි. ජාති, ජරා, ශෝක ඉක්මවා සිටින්නෙක් වෙමි. මාගේ පෙර පිනැති සීල වෘතය කුමක්ද? මා දැනගත යුත්තේ කුමක්දැයි මට පවසනු මැනව” යි.\n\n“ග්‍රීෂ්මයෙන් පීඩාවට පත්, පිපාසිත බොහෝ මිනිසුන්ට ඔබ ජලය සැපයුවේ ය. එය ඔබගේ පෙර පිනැති සීල වෘතය යි. නින්දෙන් පිබිදියාක් මෙන් මම එය සිහි කරමි.\n\nඑණිකූල නම් ගඟේ ඉවුරෙහි සිරකරුවන් ලෙස අල්ලාගෙන ගෙන යමින් සිටි ජනයා ඔබ මුදවා ගත්තේ ය. එය ඔබගේ පෙර පිනැති සීල වෘතය යි. නින්දෙන් පිබිදියාක් මෙන් මම එය සිහි කරමි.\n\nගංගා නම් ගඟේ දිය පහරට හසු වූ, මිනිසුන් අනුභව කිරීමට ආශාවෙන් සිටි රුදුරු නාගයෙකු (මකරෙකු) විසින් අල්ලාගත් නැවක් ඔබ බලයෙන් මුදවා ගත්තේ ය. එය ඔබගේ පෙර පිනැති සීල වෘතය යි. නින්දෙන් පිබිදියාක් මෙන් මම එය සිහි කරමි.\n\nඑක් කල්පයකදී මම ඔබගේ බද්ධාචාරී (වහලෙකු වැනි) වූ කෙනෙක් වීමි. (ඒ කල්පයේදී) ඔබ මා සම්බුද්ධිමත් ව්‍රතයක් රකින්නෙක් ලෙස සැලකුවේය. එය ඔබගේ පෙර පිනැති සීල වෘතය යි. නින්දෙන් පිබිදියාක් මෙන් මම එය සිහි කරමි” යි.\n\n“ඇත්තෙන්ම ඔබ මාගේ මේ ආයුෂ දන්නේ ය. අන් දේ ද දන්නේ ය. එසේ වන්නේ ඔබ බුදුන් වහන්සේ කෙනෙකු වන බැවිනි. එසේම ඔබගේ මේ දැල්වෙන අනුභාවය බ්‍රහ්ම ලෝකය ආලෝකවත් කරමින් පිහිටා තිබේ” යි.",
      "paliTitle": "Bakabrahmasuttaṃ"
    },
    {
      "number": 176,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena aññatarassa brahmuno evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ hoti – ‘‘natthi so samaṇo vā brāhmaṇo vā yo idha āgaccheyyā’’ti. Atha kho bhagavā tassa brahmuno cetasā cetoparivitakkamaññāya – seyyathāpi nāma balavā puriso…pe… tasmiṃ brahmaloke pāturahosi. Atha kho bhagavā tassa brahmuno upari vehāsaṃ pallaṅkena nisīdi tejodhātuṃ samāpajjitvā. Atha kho āyasmato mahāmoggallānassa etadahosi – ‘‘kahaṃ nu kho bhagavā etarahi viharatī’’ti? Addasā kho āyasmā mahāmoggallāno [mahāmoggalāno (ka.)] bhagavantaṃ dibbena cakkhunā visuddhena atikkantamānusakena tassa brahmuno upari vehāsaṃ pallaṅkena nisinnaṃ tejodhātuṃ samāpannaṃ. Disvāna – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – jetavane antarahito tasmiṃ brahmaloke pāturahosi. Atha kho āyasmā mahāmoggallāno puratthimaṃ disaṃ nissāya [upanissāya (sī.)] tassa brahmuno upari vehāsaṃ pallaṅkena nisīdi tejodhātuṃ samāpajjitvā nīcataraṃ bhagavato. Atha kho āyasmato mahākassapassa etadahosi – ‘‘kahaṃ nu kho bhagavā etarahi viharatī’’ti? Addasā kho āyasmā mahākassapo bhagavantaṃ dibbena cakkhunā…pe… disvāna – seyyathāpi nāma balavā puriso…pe… evameva – jetavane antarahito tasmiṃ brahmaloke pāturahosi. Atha kho āyasmā mahākassapo dakkhiṇaṃ disaṃ nissāya tassa brahmuno upari vehāsaṃ pallaṅkena nisīdi tejodhātuṃ samāpajjitvā nīcataraṃ bhagavato. Atha kho āyasmato mahākappinassa etadahosi – ‘‘kahaṃ nu kho bhagavā etarahi viharatī’’ti? Addasā kho āyasmā mahākappino bhagavantaṃ dibbena cakkhunā…pe… tejodhātuṃ samāpannaṃ. Disvāna – seyyathāpi nāma balavā puriso…pe… evameva – jetavane antarahito tasmiṃ brahmaloke pāturahosi. Atha kho āyasmā mahākappino pacchimaṃ disaṃ nissāya tassa brahmuno upari vehāsaṃ pallaṅkena nisīdi tejodhātuṃ samāpajjitvā nīcataraṃ bhagavato. Atha kho āyasmato anuruddhassa etadahosi – ‘‘kahaṃ nu kho bhagavā etarahi viharatī’’ti? Addasā kho āyasmā anuruddho…pe… tejodhātuṃ samāpannaṃ. Disvāna – seyyathāpi nāma balavā puriso… pe… tasmiṃ brahmaloke pāturahosi. Atha kho āyasmā anuruddho uttaraṃ disaṃ nissāya tassa brahmuno upari vehāsaṃ pallaṅkena nisīdi tejodhātuṃ samāpajjitvā nīcataraṃ bhagavato. Atha kho āyasmā mahāmoggallāno taṃ brahmānaṃ gāthāya ajjhabhāsi – ‘‘Ajjāpi te āvuso sā diṭṭhi, yā te diṭṭhi pure ahu; Passasi vītivattantaṃ, brahmaloke pabhassara’’nti. ‘‘Na me mārisa sā diṭṭhi, yā me diṭṭhi pure ahu; Passāmi vītivattantaṃ, brahmaloke pabhassaraṃ; Svāhaṃ ajja kathaṃ vajjaṃ, ahaṃ niccomhi sassato’’ti. Atha kho bhagavā taṃ brahmānaṃ saṃvejetvā – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – tasmiṃ brahmaloke antarahito jetavane pāturahosi. Atha kho so brahmā aññataraṃ brahmapārisajjaṃ āmantesi – ‘‘ehi tvaṃ, mārisa, yenāyasmā mahāmoggallāno tenupasaṅkama; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ evaṃ vadehi – ‘atthi nu kho, mārisa moggallāna, aññepi tassa bhagavato sāvakā evaṃmahiddhikā evaṃmahānubhāvā; seyyathāpi bhavaṃ moggallāno kassapo kappino anuruddho’’’ti? ‘‘Evaṃ, mārisā’’ti kho so brahmapārisajjo tassa brahmuno paṭissutvā yenāyasmā mahāmoggallāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahāmoggallānaṃ etadavoca – ‘‘atthi nu kho, mārisa moggallāna, aññepi tassa bhagavato sāvakā evaṃmahiddhikā evaṃmahānubhāvā; seyyathāpi bhavaṃ moggallāno kassapo kappino anuruddho’’ti? Atha kho āyasmā mahāmoggallāno taṃ brahmapārisajjaṃ gāthāya ajjhabhāsi – ‘‘Tevijjā iddhipattā ca, cetopariyāyakovidā; Khīṇāsavā arahanto, bahū buddhassa sāvakā’’ti. Atha kho so brahmapārisajjo āyasmato mahāmoggallānassa bhāsitaṃ abhinanditvā anumoditvā yena so brahmā tenupasaṅkami; upasaṅkamitvā taṃ brahmānaṃ etadavoca – ‘‘āyasmā mārisa, mahāmoggallāno evamāha – ‘‘Tevijjā iddhipattā ca, cetopariyāyakovidā; Khīṇāsavā arahanto, bahū buddhassa sāvakā’’ti. Idamavoca so brahmapārisajjo. Attamano ca so brahmā tassa brahmapārisajjassa bhāsitaṃ abhinandīti.",
      "english": "Originating in Savatthi.\n\nAt that time, a certain Brahma had conceived such a pernicious view: \"There is no ascetic or brahmin who would ever come here.\" Then, the Blessed One, knowing the Brahma's thought processes with His own mind, just as a strong man might extend his flexed arm or flex his extended arm, even so, he appeared in that Brahma-realm. Then, the Blessed One, having entered the fire-element concentration, sat cross-legged in the air above that Brahma.\n\nThen, it occurred to Venerable Maha Moggallana: \"Where, indeed, is the Blessed One dwelling now?\" Venerable Maha Moggallana saw the Blessed One, with his purified divine eye surpassing that of humans, seated cross-legged in the air above that Brahma, having entered the fire-element concentration. Having seen this, just as a strong man might extend his flexed arm or flex his extended arm, even so, having vanished from Jeta's Grove, he appeared in that Brahma-realm. Then, Venerable Maha Moggallana, taking his stand in the eastern direction, sat cross-legged in the air above that Brahma, having entered the fire-element concentration, at a lower position than the Blessed One.\n\nThen, it occurred to Venerable Maha Kassapa: \"Where, indeed, is the Blessed One dwelling now?\" Venerable Maha Kassapa saw the Blessed One, with his purified divine eye surpassing that of humans, seated cross-legged in the air above that Brahma, having entered the fire-element concentration. Having seen this, just as a strong man might extend his flexed arm or flex his extended arm, even so, having vanished from Jeta's Grove, he appeared in that Brahma-realm. Then, Venerable Maha Kassapa, taking his stand in the southern direction, sat cross-legged in the air above that Brahma, having entered the fire-element concentration, at a lower position than the Blessed One.\n\nThen, it occurred to Venerable Maha Kappina: \"Where, indeed, is the Blessed One dwelling now?\" Venerable Maha Kappina saw the Blessed One, with his purified divine eye surpassing that of humans, seated cross-legged in the air above that Brahma, having entered the fire-element concentration. Having seen this, just as a strong man might extend his flexed arm or flex his extended arm, even so, having vanished from Jeta's Grove, he appeared in that Brahma-realm. Then, Venerable Maha Kappina, taking his stand in the western direction, sat cross-legged in the air above that Brahma, having entered the fire-element concentration, at a lower position than the Blessed One.\n\nThen, it occurred to Venerable Anuruddha: \"Where, indeed, is the Blessed One dwelling now?\" Venerable Anuruddha saw the Blessed One, with his purified divine eye surpassing that of humans, seated cross-legged in the air above that Brahma, having entered the fire-element concentration. Having seen this, just as a strong man might extend his flexed arm or flex his extended arm, even so, he appeared in that Brahma-realm. Then, Venerable Anuruddha, taking his stand in the northern direction, sat cross-legged in the air above that Brahma, having entered the fire-element concentration, at a lower position than the Blessed One.\n\nThen, Venerable Maha Moggallana addressed that Brahma in verse: \"Friend, do you still hold that view which you held before? Do you see the radiant ones surpassing you in the Brahma-realm?\" [The Brahma replied]: \"Venerable sir, I do not hold that view which I held before. I see the radiant ones surpassing me in the Brahma-realm. How then, today, could I say 'I am permanent, I am eternal'?\"\n\nThen, the Blessed One, having made that Brahma experience a sense of urgency, just as a strong man might extend his flexed arm or flex his extended arm, even so, having vanished from that Brahma-realm, he appeared in Jeta's Grove. Then that Brahma addressed a certain member of his retinue: \"Come, venerable sir, approach Venerable Maha Moggallana; having approached, say this to Venerable Maha Moggallana: 'Are there, venerable sir Moggallana, other disciples of that Blessed One who are likewise greatly powerful and greatly influential, just like Venerable Moggallana, Kassapa, Kappina, and Anuruddha?'\"\n\n\"Yes, venerable sir,\" replied that member of the Brahma's retinue to that Brahma, and having agreed, he approached Venerable Maha Moggallana; having approached, he said this to Venerable Maha Moggallana: \"Are there, venerable sir Moggallana, other disciples of that Blessed One who are likewise greatly powerful and greatly influential, just like Venerable Moggallana, Kassapa, Kappina, and Anuruddha?\" Then, Venerable Maha Moggallana addressed that member of the Brahma's retinue in verse: \"Many are the Buddha's disciples who possess the three knowledges, have attained psychic powers, are skilled in knowing the minds of others, are with defilements destroyed, and are Arahants.\"\n\nThen that member of the Brahma's retinue, having delighted in and approved of Venerable Maha Moggallana's statement, approached that Brahma; having approached, he said this to that Brahma: \"Venerable sir, Venerable Maha Moggallana said this: 'Many are the Buddha's disciples who possess the three knowledges, have attained psychic powers, are skilled in knowing the minds of others, are with defilements destroyed, and are Arahants.'\" Thus spoke that member of the Brahma's retinue. And that Brahma, pleased, delighted in the statement of that member of the Brahma's retinue.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑකල එක්තරා බ්‍ර‍හ්මයකුට \"මා වෙතට කිසිදු ශ්‍ර‍මණයෙකු හෝ බ්‍ර‍ාහ්මණයෙකු හෝ පැමිණිය නොහැක\" යන මෙබඳු වූ පාපී දෘෂ්ටියක් හටගෙන තිබුණි. ඉක්බිති භාග්‍යවතුන් වහන්සේ, ඒ බ්‍ර‍හ්මයාගේ සිතින් සිතිවිලි අවබෝධ කොට, මහ බලැති පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරී අතක් හැකිලූවාක් මෙන් වේගයෙන්, ඒ බ්‍ර‍හ්ම ලෝකයෙහි පහළ වූ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටි සේක.\n\nඉක්බිති ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"භාග්‍යවතුන් වහන්සේ මේ වන විට කොහි වැඩ සිටින සේක් දැයි?\" ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ, මිනිස් ඇස ඉක්මවා ගිය පිරිසිදු දිවැසින්, ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටින භාග්‍යවතුන් වහන්සේව දැකගත් සේක. එසේ දැක, මහ බලැති පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරී අතක් හැකිලූවාක් මෙන් වේගයෙන්, ජේතවනාරාමයෙහි අතුරුදහන් වී, ඒ බ්‍ර‍හ්ම ලෝකයෙහි පහළ වූ සේක. ඉක්බිති ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ, භාග්‍යවතුන් වහන්සේට මඳක් පහතින්, නැගෙනහිර දිසාව බලාගෙන, ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටි සේක.\n\nඉක්බිති ආයුෂ්මත් මහා කාශ්ශප ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"භාග්‍යවතුන් වහන්සේ මේ වන විට කොහි වැඩ සිටින සේක් දැයි?\" ආයුෂ්මත් මහා කාශ්ශප ස්ථවිරයන් වහන්සේ, මිනිස් ඇස ඉක්මවා ගිය පිරිසිදු දිවැසින්, ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටින භාග්‍යවතුන් වහන්සේව දැකගත් සේක. එසේ දැක, මහ බලැති පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරී අතක් හැකිලූවාක් මෙන් වේගයෙන්, ජේතවනාරාමයෙහි අතුරුදහන් වී, ඒ බ්‍ර‍හ්ම ලෝකයෙහි පහළ වූ සේක. ඉක්බිති ආයුෂ්මත් මහා කාශ්ශප ස්ථවිරයන් වහන්සේ, භාග්‍යවතුන් වහන්සේට මඳක් පහතින්, දකුණු දිසාව බලාගෙන, ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටි සේක.\n\nඉක්බිති ආයුෂ්මත් මහා කප්පින ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"භාග්‍යවතුන් වහන්සේ මේ වන විට කොහි වැඩ සිටින සේක් දැයි?\" ආයුෂ්මත් මහා කප්පින ස්ථවිරයන් වහන්සේ, මිනිස් ඇස ඉක්මවා ගිය පිරිසිදු දිවැසින්, ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටින භාග්‍යවතුන් වහන්සේව දැකගත් සේක. එසේ දැක, මහ බලැති පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරී අතක් හැකිලූවාක් මෙන් වේගයෙන්, ජේතවනාරාමයෙහි අතුරුදහන් වී, ඒ බ්‍ර‍හ්ම ලෝකයෙහි පහළ වූ සේක. ඉක්බිති ආයුෂ්මත් මහා කප්පින ස්ථවිරයන් වහන්සේ, භාග්‍යවතුන් වහන්සේට මඳක් පහතින්, බටහිර දිසාව බලාගෙන, ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටි සේක.\n\nඉක්බිති ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේට මෙසේ සිතුණි: \"භාග්‍යවතුන් වහන්සේ මේ වන විට කොහි වැඩ සිටින සේක් දැයි?\" ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ, මිනිස් ඇස ඉක්මවා ගිය පිරිසිදු දිවැසින්, ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටින භාග්‍යවතුන් වහන්සේව දැකගත් සේක. එසේ දැක, මහ බලැති පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරී අතක් හැකිලූවාක් මෙන් වේගයෙන්, ජේතවනාරාමයෙහි අතුරුදහන් වී, ඒ බ්‍ර‍හ්ම ලෝකයෙහි පහළ වූ සේක. ඉක්බිති ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ, භාග්‍යවතුන් වහන්සේට මඳක් පහතින්, උතුරු දිසාව බලාගෙන, ඒ බ්‍ර‍හ්මයාට ඉහළින් ආකාශයෙහි පලක් බැඳ, තේජෝධාතුවට සමවැද වැඩ සිටි සේක.\n\nඉක්බිති ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ ඒ බ්‍ර‍හ්මයාට ගාථාවකින් මෙසේ පැවසූ සේක: \"ඇවැත්නි, පෙර ඔබට තිබුණු ඒ දෘෂ්ටිය අදත් ඔබට තිබේද? මේ බ්‍ර‍හ්ම ලෝකයෙහි පවා බබළමින් විද්‍යාමාන වන (සෘද්ධිමත්) අය ඔබට නොපෙනේද?\" (එවිට බ්‍ර‍හ්මයා මෙසේ කීය:) \"පින්වත, පෙර මට තිබුණු ඒ දෘෂ්ටිය අද මට නැත. මේ බ්‍ර‍හ්ම ලෝකයෙහි පවා බබළමින් විද්‍යාමාන වන (සෘද්ධිමත්) අය මම දකිමි. එසේ නම්, 'මම නිත්‍යය, මම ශාශ්වතය' යැයි මා අද කෙසේ නම් කියම් දැයි?\"\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ බ්‍ර‍හ්මයා සංවේගයට පත් කොට, මහ බලැති පුරුෂයෙක් හැකිලූ අතක් දිග හරින්නාක් මෙන් හෝ දිග හැරී අතක් හැකිලූවාක් මෙන් වේගයෙන්, ඒ බ්‍ර‍හ්ම ලෝකයෙහි අතුරුදහන් වී, ජේතවනාරාමයෙහි පහළ වූ සේක.\n\nඉක්බිති ඒ බ්‍ර‍හ්මයා එක්තරා බ්‍ර‍හ්ම පිරිසකයන් අමතා මෙසේ කීය: \"පින්වත, ඔබ ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ සිටින තැනට යන්න. එතනට ගොස් ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේට මෙසේ කියන්න: 'පින්වත මොග්ගල්ලාන, භාග්‍යවතුන් වහන්සේට මහා මොග්ගල්ලාන, මහා කාශ්ශප, මහා කප්පින, අනුරුද්ධ ස්ථවිරයන් වහන්සේලා මෙන්, මෙබඳු මහා සෘද්ධි ඇති, මෙබඳු මහා ආනුභාව ඇති වෙනත් ශ්‍ර‍ාවකයෝත් සිටිත් ද?'\" \"එසේය පින්වත\" යැයි කියා, ඒ බ්‍ර‍හ්ම පිරිසකයා ඒ බ්‍ර‍හ්මයාට පිළිතුරු දී, ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ සිටින තැනට ගියේය. එතනට ගොස් ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේට මෙසේ කීය: \"පින්වත මොග්ගල්ලාන, භාග්‍යවතුන් වහන්සේට මහා මොග්ගල්ලාන, මහා කාශ්ශප, මහා කප්පින, අනුරුද්ධ ස්ථවිරයන් වහන්සේලා මෙන්, මෙබඳු මහා සෘද්ධි ඇති, මෙබඳු මහා ආනුභාව ඇති වෙනත් ශ්‍ර‍ාවකයෝත් සිටිත් ද?\"\n\nඉක්බිති ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ ඒ බ්‍ර‍හ්ම පිරිසකයාට ගාථාවකින් මෙසේ පැවසූ සේක: \"ත්‍රිවිද්‍යාවෙන් යුක්ත වූ, සෘද්ධි ලබා සිටින, අන් අයගේ සිත් දැනීමේ දක්‍ෂ වූ, ක්ෂීණාශ්‍ර‍ව වූ රහත් වූ, බොහෝ ශ්‍ර‍ාවකයෝ බුදුරදුන්ට සිටිත්.\"\n\nඉක්බිති ඒ බ්‍ර‍හ්ම පිරිසකයා ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේගේ වචනය අගය කොට, සතුටු වී, ඒ බ්‍ර‍හ්මයා සිටින තැනට ගියේය. එතනට ගොස් ඒ බ්‍ර‍හ්මයාට මෙසේ කීය: \"පින්වත, ආයුෂ්මත් මහා මොග්ගල්ලාන ස්ථවිරයන් වහන්සේ මෙසේ වදාළ සේක: 'ත්‍රිවිද්‍යාවෙන් යුක්ත වූ, සෘද්ධි ලබා සිටින, අන් අයගේ සිත් දැනීමේ දක්‍ෂ වූ, ක්ෂීණාශ්‍ර‍ව වූ රහත් වූ, බොහෝ ශ්‍ර‍ාවකයෝ බුදුරදුන්ට සිටිත්' යැයි.\" ඒ බ්‍ර‍හ්ම පිරිසකයා මේ බව පැවසීය. ඒ බ්‍ර‍හ්මයාද ඒ බ්‍ර‍හ්ම පිරිසකයාගේ කතාව අසා සතුටු විය.",
      "paliTitle": "Aññatarabrahmasuttaṃ"
    },
    {
      "number": 177,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena bhagavā divāvihāragato hoti paṭisallīno. Atha kho subrahmā ca paccekabrahmā suddhāvāso ca paccekabrahmā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā paccekaṃ dvārabāhaṃ [paccekadvārabāhaṃ (pī. ka.)] upanissāya aṭṭhaṃsu. Atha kho subrahmā paccekabrahmā suddhāvāsaṃ paccekabrahmānaṃ etadavoca – ‘‘akālo kho tāva, mārisa, bhagavantaṃ payirupāsituṃ; divāvihāragato bhagavā paṭisallīno ca. Asuko ca brahmaloko iddho ceva phīto ca, brahmā ca tatra pamādavihāraṃ viharati. Āyāma, mārisa, yena so brahmaloko tenupasaṅkamissāma; upasaṅkamitvā taṃ brahmānaṃ saṃvejeyyāmā’’ti. ‘‘Evaṃ, mārisā’’ti kho suddhāvāso paccekabrahmā subrahmuno paccekabrahmuno paccassosi. Atha kho subrahmā ca paccekabrahmā suddhāvāso ca paccekabrahmā – seyyathāpi nāma balavā puriso…pe… evameva – bhagavato purato antarahitā tasmiṃ brahmaloke pāturahesuṃ. Addasā kho so brahmā te brahmāno dūratova āgacchante. Disvāna te brahmāno etadavoca – ‘‘handa kuto nu tumhe, mārisā, āgacchathā’’ti? ‘‘Āgatā kho mayaṃ, mārisa, amha tassa bhagavato santikā arahato sammāsambuddhassa. Gaccheyyāsi pana tvaṃ, mārisa, tassa bhagavato upaṭṭhānaṃ arahato sammāsambuddhassā’’ti? Evaṃ vutto [evaṃ vutte (sī. syā. kaṃ.)] kho so brahmā taṃ vacanaṃ anadhivāsento sahassakkhattuṃ attānaṃ abhinimminitvā subrahmānaṃ paccekabrahmānaṃ etadavoca – ‘‘passasi me no tvaṃ, mārisa, evarūpaṃ iddhānubhāva’’nti? ‘‘Passāmi kho tyāhaṃ, mārisa, evarūpaṃ iddhānubhāva’’nti. ‘‘So khvāhaṃ, mārisa, evaṃmahiddhiko evaṃmahānubhāvo kassa aññassa samaṇassa vā brāhmaṇassa vā upaṭṭhānaṃ gamissāmī’’ti? Atha kho subrahmā paccekabrahmā dvisahassakkhattuṃ attānaṃ abhinimminitvā taṃ brahmānaṃ etadavoca – ‘‘passasi me no tvaṃ, mārisa, evarūpaṃ iddhānubhāva’’nti? ‘‘Passāmi kho tyāhaṃ, mārisa, evarūpaṃ iddhānubhāva’’nti. ‘‘Tayā ca kho, mārisa, mayā ca sveva bhagavā mahiddhikataro ceva mahānubhāvataro ca. Gaccheyyāsi tvaṃ, mārisa, tassa bhagavato upaṭṭhānaṃ arahato sammāsambuddhassā’’ti? Atha kho so brahmā subrahmānaṃ paccekabrahmānaṃ gāthāya ajjhabhāsi – ‘‘Tayo supaṇṇā caturo ca haṃsā, Byagghīnisā pañcasatā ca jhāyino; Tayidaṃ vimānaṃ jalate ca [jalateva (pī. ka.)] brahme, Obhāsayaṃ uttarassaṃ disāya’’nti. ‘‘Kiñcāpi te taṃ jalate vimānaṃ, Obhāsayaṃ uttarassaṃ disāyaṃ; Rūpe raṇaṃ disvā sadā pavedhitaṃ, Tasmā na rūpe ramatī sumedho’’ti. Atha kho subrahmā ca paccekabrahmā suddhāvāso ca paccekabrahmā taṃ brahmānaṃ saṃvejetvā tatthevantaradhāyiṃsu. Agamāsi ca kho so brahmā aparena samayena bhagavato upaṭṭhānaṃ arahato sammāsambuddhassāti.",
      "english": "Set in Sāvatthī. Now, at that time, the Blessed One had gone for a midday dwelling, secluded. Then Subrahmā, the Individual Brahmā, and Suddhāvāsa, the Individual Brahmā, approached the Blessed One; having approached, each stood leaning against a doorpost. Then Subrahmā, the Individual Brahmā, said to Suddhāvāsa, the Individual Brahmā: \"Indeed, reverend, it is not the right time now to approach the Blessed One; the Blessed One has gone for a midday dwelling and is secluded. And a certain Brahmā world is prosperous and thriving, and the Brahmā there dwells in a state of heedlessness. Come, reverend, let us approach that Brahmā world; having approached, let us arouse a sense of urgency in that Brahmā.\" \"Yes, reverend,\" Suddhāvāsa, the Individual Brahmā, replied to Subrahmā, the Individual Brahmā. Then Subrahmā, the Individual Brahmā, and Suddhāvāsa, the Individual Brahmā—just as a strong man would extend and contract his arm—disappeared from before the Blessed One and reappeared in that Brahmā world.\n\nThat Brahmā saw those Brahmās approaching from afar. Having seen them, he said to those Brahmās: \"Well now, reverends, from where do you come?\" \"We have come, reverend, from the presence of that Blessed One, the Arahant, the Perfectly Self-Awakened One. Should you not, reverend, go to wait upon that Blessed One, the Arahant, the Perfectly Self-Awakened One?\" When thus spoken to, that Brahmā, not assenting to that statement, created a thousand emanations of himself and said to Subrahmā, the Individual Brahmā: \"Do you not, reverend, see such mighty power and majesty of mine?\" \"Indeed, reverend, I see such mighty power and majesty of yours.\" \"Why should I, reverend, being so mighty in power and so majestic, go to wait upon any other ascetic or brahman?\"\n\nThen Subrahmā, the Individual Brahmā, creating two thousand emanations of himself, said to that Brahmā: \"Do you not, reverend, see such mighty power and majesty of mine?\" \"Indeed, reverend, I see such mighty power and majesty of yours.\" \"Indeed, reverend, both you and I are inferior to that Blessed One, who is mightier in power and more majestic. You should go, reverend, to wait upon that Blessed One, the Arahant, the Perfectly Self-Awakened One.\"\n\nThen that Brahmā addressed Subrahmā, the Individual Brahmā, with a verse:\n\"Three Supaṇṇas, four Haṃsas, tiger-eagles, and five hundred meditators;\nThis mansion, O Brahmā, shines brightly, illuminating the northern quarter.\"\n(Subrahmā replied): \"Although your mansion shines brightly, illuminating the northern quarter;\nSeeing the strife in forms, one is always troubled, therefore the wise one does not delight in forms.\"\n\nThen Subrahmā, the Individual Brahmā, and Suddhāvāsa, the Individual Brahmā, having aroused a sense of urgency in that Brahmā, vanished right there. And later, that Brahmā went to wait upon the Blessed One, the Arahant, the Perfectly Self-Awakened One.",
      "sinhala": "මෙසූත්‍රය සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ දහවල් විවේකයෙන්, භාවනායෝගීව වැඩසිටියාහ. එවිට සුබ්‍රහ්ම නම් පච්චේකබ්‍රහ්මයා ද, ශුද්ධාවාස නම් පච්චේකබ්‍රහ්මයා ද භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, ඒ ඒ දොරටු කණුව අසල පිහිටා සිටගත්හ.\n\nඑවිට සුබ්‍රහ්ම නම් පච්චේකබ්‍රහ්මයා ශුද්ධාවාස නම් පච්චේකබ්‍රහ්මයාට මෙසේ කීවේය: ‘ඇවැත්නි, දැනට භාග්‍යවතුන් වහන්සේට උපස්ථාන කිරීමට සුදුසු කාලය නොවේ. භාග්‍යවතුන් වහන්සේ දහවල් විවේකයෙන්, භාවනාවෙහි යෙදී වැඩසිටින සේක. අසුවල් බ්‍රහ්මලෝකය ඉතා සශ්‍රීක ය, සමෘද්ධිමත් ය. එහෙත් එහි බ්‍රහ්මයා ප්‍රමාදයෙන් වාසය කරයි. ඇවැත්නි, අපි ඒ බ්‍රහ්මලෝකයට යමු. එහි ගොස් ඒ බ්‍රහ්මයා සංවේගයට පත් කරමු.’ ‘ඇවැත්නි, එසේ වේවා’යි ශුද්ධාවාස නම් පච්චේකබ්‍රහ්මයා සුබ්‍රහ්ම නම් පච්චේකබ්‍රහ්මයාට පිළිතුරු දුන්නේය.\n\nඉක්බිති සුබ්‍රහ්ම නම් පච්චේකබ්‍රහ්මයා ද, ශුද්ධාවාස නම් පච්චේකබ්‍රහ්මයා ද – යම්සේ බලවත් පුරුෂයෙක් තම නවාගත් අතක් දිගහැරීමටත්, දිගහැරගත් අතක් නැවීමටත් ගතවන කෙටි මොහොතකින්, එලෙසම – භාග්‍යවතුන් වහන්සේ ඉදිරියෙන් අතුරුදන් වී ඒ බ්‍රහ්මලෝකයෙහි පහළ වූහ.\n\nඒ බ්‍රහ්මයා ඈතින් එන ඒ බ්‍රහ්මයන් දෙදෙනා දුටුවේය. දැක, ඒ බ්‍රහ්මයා ඔවුන්ට මෙසේ කීවේය: ‘ඇවැත්නි, නුඹලා පැමිණියේ කොහෙන්ද?’ ‘ඇවැත්නි, අපි ඒ අරහත් වූ සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේගේ සමීපයෙන් පැමිණියෙමු. ඇවැත්නි, ඔබත් ඒ අරහත් වූ සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේට උපස්ථාන කිරීමට යා යුතු ය.’\n\nමෙසේ කී කල්හි, ඒ බ්‍රහ්මයා ඒ වචනය පිළි නොගෙන, දහස් වාරයක් තමාම මවාගෙන, සුබ්‍රහ්ම නම් පච්චේකබ්‍රහ්මයාට මෙසේ කීවේය: ‘ඇවැත්නි, මාගේ මෙවැනි ඍද්ධි ආනුභාවය ඔබ දකින්නේ නැද්ද?’\n\n‘ඇවැත්නි, මම ඔබගේ මෙවැනි ඍද්ධි ආනුභාවය දකිමි’යි. ‘ඇවැත්නි, මෙසේ මහත් ඍද්ධි ඇති, මහත් ආනුභාව ඇති මම, වෙනත් කිසිම ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ උපස්ථාන කිරීමට යන්නේ කෙසේද?’\n\nඑවිට සුබ්‍රහ්ම නම් පච්චේකබ්‍රහ්මයා දෙදහස් වාරයක් තමාම මවාගෙන, ඒ බ්‍රහ්මයාට මෙසේ කීවේය: ‘ඇවැත්නි, මාගේ මෙවැනි ඍද්ධි ආනුභාවය ඔබ දකින්නේ නැද්ද?’ ‘ඇවැත්නි, මම ඔබගේ මෙවැනි ඍද්ධි ආනුභාවය දකිමි’යි. ‘ඇවැත්නි, ඔබටත් මටත් වඩා ඒ භාග්‍යවතුන් වහන්සේම මහත් ඍද්ධිමත් ය, මහත් ආනුභාව සම්පන්න ය. ඇවැත්නි, ඔබ ඒ අරහත් වූ සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේට උපස්ථාන කිරීමට යා යුතු ය.’\n\nඑවිට ඒ බ්‍රහ්මයා සුබ්‍රහ්ම නම් පච්චේකබ්‍රහ්මයාට ගාථාවකින් මෙසේ කීවේය: ‘පක්ෂීන් තුන්සිය දෙනෙක් ද, හංසයෝ සතර දෙනෙක් ද, ව්‍යාඝ්‍රීහු පන්සියයක් ද ධ්‍යාන වඩමින් සිටිති. බ්‍රහ්මයාණෙනි, මේ මාගේ විමානය උතුරු දිශාව බබළවමින් බබළයි.’\n\n‘ඔබගේ ඒ විමානය උතුරු දිශාව බබළවමින් බබළන්නක් වුවද, රූපයෙහි ඇති රාගය දැක, සෑම කල්හිම කම්පනයට පත් වූ, එහෙයින්, යහපත් නුවණැත්තා රූපයන්හි ඇලී නොසිටියි.’\n\nඑවිට සුබ්‍රහ්ම නම් පච්චේකබ්‍රහ්මයා ද, ශුද්ධාවාස නම් පච්චේකබ්‍රහ්මයා ද ඒ බ්‍රහ්මයා සංවේගයට පත් කරවා, එතැනින්ම අතුරුදන් වූහ. ඒ බ්‍රහ්මයා ද පසුව අරහත් වූ සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේට උපස්ථාන කිරීමට පැමිණියේය.",
      "paliTitle": "Brahmalokasuttaṃ"
    },
    {
      "number": 178,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena bhagavā divāvihāragato hoti paṭisallīno. Atha kho subrahmā ca paccekabrahmā suddhāvāso ca paccekabrahmā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā paccekaṃ dvārabāhaṃ nissāya aṭṭhaṃsu. Atha kho subrahmā paccekabrahmā kokālikaṃ bhikkhuṃ ārabbha bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Appameyyaṃ paminanto, kodha vidvā vikappaye; Appameyyaṃ pamāyinaṃ, nivutaṃ taṃ maññe puthujjana’’nti.",
      "english": "At Sāvatthī. Now at that time, the Blessed One had entered his daytime abiding, having secluded himself. Then Subrahmā, a solitary Brahmā, and Suddhāvāsa, a solitary Brahmā, approached the Blessed One; having approached, they each stood leaning against a doorpost.\n\nThen Subrahmā, the solitary Brahmā, spoke this verse in the presence of the Blessed One, concerning the monk Kokālika:\n\n“One who measures the immeasurable—where would a wise person make distinctions? I consider such a one, who measures the immeasurable, to be an ordinary person, shrouded in delusion.”",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි. ඒ දිනවල භාග්‍යවතුන් වහන්සේ දිවා විහරණය සඳහා වැඩමවා, පිළිසන්ව වැඩ සිටි සේක.\n\nඑවිට පච්චේක බ්‍රහ්ම සුබ්‍රහ්මද, පච්චේක බ්‍රහ්ම සුද්ධාවාසද භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට පැමිණියහ. එළඹ, එකිනෙකා දොරකඩෙහි දෙපසට හේත්තු වී සිටියහ.\n\nඑවිට පච්චේක බ්‍රහ්ම සුබ්‍රහ්ම කෝකාලික භික්ෂුව අරභයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප්‍රකාශ කළේය – “අප්‍රමාණ වූ තැනැත්තා මැනීමට උත්සාහ කරමින්, නුවණැත්තෙකු කෙසේ නම් විකල්ප කරන්නේද? අප්‍රමාණ වූ තැනැත්තා මැනීමට උත්සාහ කරන්නා වූ ඔහුව, ආවරණය වූ පෘථග්ජනයෙකු ලෙස මම සලකමි.”",
      "paliTitle": "Kokālikasuttaṃ"
    },
    {
      "number": 179,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena bhagavā divāvihāragato hoti paṭisallīno. Atha kho subrahmā ca paccekabrahmā suddhāvāso ca paccekabrahmā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā paccekaṃ dvārabāhaṃ nissāya aṭṭhaṃsu. Atha kho suddhāvāso paccekabrahmā katamodakatissakaṃ [katamorakatissakaṃ (sī. syā. kaṃ.)] bhikkhuṃ ārabbha bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Appameyyaṃ paminanto, kodha vidvā vikappaye; Appameyyaṃ pamāyinaṃ, nivutaṃ taṃ maññe akissava’’nti.",
      "english": "At Sāvatthī. At that time, the Blessed One had gone into seclusion for his day-residence. Then, the Brahmā Subrahmā and the Brahmā Suddhāvāsa approached where the Blessed One was. Having approached, they each stood leaning against a doorpost. Then, the Brahmā Suddhāvāsa, concerning the monk Katamodakatissaka, recited this verse in the presence of the Blessed One:\n“While trying to measure the Immeasurable, in what way would a wise person speculate?\nI consider one who attempts to measure the Immeasurable to be veiled and unwise.”",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑකල භාග්‍යවතුන් වහන්සේ දවාලෙහි විවේකයෙන් වැඩ සිටීමට ගොස් තනිව භාවනා කරමින් වැඩ සිටියහ. එවිට සුබ්‍රහ්ම නම් පච්චේක බ්‍රහ්මයා ද, ශුද්ධාවාස නම් පච්චේක බ්‍රහ්මයා ද භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට පැමිණියහ; එසේ පැමිණ, එකිනෙකා දොර උළුවස්සකට හේත්තු වී සිටියහ. එවිට ශුද්ධාවාස නම් පච්චේක බ්‍රහ්මයා කටමෝදකතිස්සක නම් භික්ෂුව අරබයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව ප‍්‍රකාශ කළේය –\n\n\"මැනිය නොහැකි ධර්මයක් හෝ උත්තම පුද්ගලයෙකු මනින්නට කවර නම් ප්‍රඥාවන්තයෙක් විතර්ක කරන්නේද? මැනිය නොහැකි ඒ ධර්මය හෝ උත්තම පුද්ගලයා මනින්නට උත්සාහ කරන්නා වූ තැනැත්තා ප්‍රඥාවෙන් තොරව, අවිද්‍යාවෙන් වැසී ගත්තෙකු ලෙස මම සලකමි.\"",
      "paliTitle": "Katamodakatissasuttaṃ"
    },
    {
      "number": 180,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena kokāliko bhikkhu ābādhiko hoti dukkhito bāḷhagilāno. Atha kho turū [tudu (sī. syā. kaṃ. pī.)] paccekabrahmā abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena kokāliko bhikkhu tenupasaṅkami; upasaṅkamitvā vehāsaṃ ṭhito kokālikaṃ bhikkhuṃ etadavoca – ‘‘pasādehi, kokālika, sāriputtamoggallānesu cittaṃ. Pesalā sāriputtamoggallānā’’ti. ‘‘Kosi tvaṃ, āvuso’’ti? ‘‘Ahaṃ turū paccekabrahmā’’ti. ‘‘Nanu tvaṃ, āvuso, bhagavatā anāgāmī byākato, atha kiñcarahi idhāgato? Passa, yāvañca te idaṃ aparaddha’’nti. ‘‘Purisassa hi jātassa, kuṭhārī [dudhārī (syā. kaṃ. ka.)] jāyate mukhe; Yāya chindati attānaṃ, bālo dubbhāsitaṃ bhaṇaṃ. ‘‘Yo nindiyaṃ pasaṃsati, Taṃ vā nindati yo pasaṃsiyo; Vicināti mukhena so kaliṃ, Kalinā tena sukhaṃ na vindati. ‘‘Appamattako ayaṃ kali, Yo akkhesu dhanaparājayo; Sabbassāpi sahāpi attanā, Ayameva mahantataro kali; Yo sugatesu manaṃ padosaye. ‘‘Sataṃ sahassānaṃ nirabbudānaṃ, Chattiṃsati pañca ca abbudāni; Yamariyagarahī [yamariye garahī (syā. kaṃ.), yamariyaṃ garahaṃ (ka.)] nirayaṃ upeti, Vācaṃ manañca paṇidhāya pāpaka’’nti.",
      "english": "At Sāvatthī.\n\nNow at that time, the monk Kokālika was afflicted, suffering, and gravely ill. Then, when the night was well advanced, the solitary Brahma Turū, of surpassing radiance, having illuminated the entire Jetavana, approached the monk Kokālika; having approached him and standing in the air, he said this to the monk Kokālika: \"Kokālika, purify your mind concerning Sāriputta and Moggallāna. Sāriputta and Moggallāna are estimable.\"\n\n\"Who are you, friend?\"\n\n\"I am the solitary Brahma Turū.\"\n\n\"Friend, were you not declared by the Blessed One to be a Non-returner? Then why have you come here? See what a grave transgression this is for you!\"\n\n\"Indeed, for a person born, an axe grows in his mouth, with which the fool, speaking ill speech, cuts himself.\n\nWhoever praises what is blameable, or blames what is praiseworthy—he gathers misfortune through his mouth. Through that misfortune, he finds no happiness.\n\nSlight is this misfortune, which is the loss of wealth in a game of dice—even the loss of all one owns along with one's very self. But this misfortune is far greater: when one corrupts one's mind towards the Noble Ones.\n\nHe who slanders the Noble Ones, having conceived wicked speech and mind, goes to hell for a hundred thousand Nirabbuda periods, and thirty-six and five Abbuda periods.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඑකල කොකාලික භික්ෂුව රෝගාතුරව, දුක්විඳිමින්, දැඩි ලෙස ගිලන්ව සිටියේය. එකල්හි, රාත්‍රිය බොහෝ සෙයින් ගෙවී ගිය කල්හි, මනහර වර්ණයෙන් යුක්ත වූ, මුළු ජේතවනයම එළිය කරමින්, තුරු නම් වූ පච්චේකබ්‍රහ්මයාණෝ කොකාලික භික්ෂුව වෙත පැමිණ, පැමිණ අහසේ සිටගෙන කොකාලික භික්ෂුවට මෙය පැවසූහ: “කොකාලිකය, ශාරිපුත්‍ර හා මොග්ගල්ලාන ස්වාමීන්වහන්සේලා කෙරෙහි සිත පහදවා ගන්න. ශාරිපුත්‍ර හා මොග්ගල්ලාන ස්වාමීන්වහන්සේලා ඉතා පේසල (ගුණවත්) ස්වාමීන්වහන්සේලාය.”\n\n“ඇවැත්නි, ඔබ කවරෙක්දැයි?” “මම තුරු නම් වූ පච්චේකබ්‍රහ්මයා වෙමි.” “ඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් ඔබ අනාගාමී වූවෙක් ලෙස ප්‍රකාශ කරන ලද්දේ නොවේද? එසේ නම් ඔබ මෙහි පැමිණියේ ඇයි? බලන්න, ඔබ කෙතරම් වරදක් කර ඇද්ද!”\n\n“යම් පුද්ගලයෙක් උපන්නේද, ඔහුට මුවෙහිම පොරොවක් උපදී. ඒ පොරොවෙන් අඥානයා දුර්භාෂිත වචන කියමින් තමන්ම කපා ගනී.\n\nයමෙක් නින්දා කළ යුත්තට ප්‍රශංසා කරන්නේද, නැතහොත් ප්‍රශංසා කළ යුත්තට නින්දා කරන්නේද, ඔහු තම මුවින් පාපය (කලිය) රැස්කර ගනී. ඒ පාපය නිසා ඔහුට සතුටක් නොලැබේ.\n\nදූදෙවළින් ධනය අහිමි වීමෙන් සිදුවන පාපය සුළුය. සියල්ල අහිමි වී තමන්ද සමග නැති වුවද, එය සුළු පාපයකි. නමුත්, සුගතයන් කෙරෙහි (අරහත් උතුමන් කෙරෙහි) යමෙක් සිත කිලිටි කරන්නේද, මේ පාපය ඊට වඩා මහත්ය.\n\nආර්යයන්ට නින්දා කරන තැනැත්තා පාපී වචන සහ සිත යොමු කරමින් නිරබුද නිරයෙහි කල්ප ලක්ෂ ගණනක් ද, තිස්හයක් සහ පසක් වූ අබුද නිරයන්හි (දුක් විඳීමට) යයි.”",
      "paliTitle": "Turūbrahmasuttaṃ"
    },
    {
      "number": 181,
      "pali": "Sāvatthinidānaṃ. Atha kho kokāliko bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho kokāliko bhikkhu bhagavantaṃ etadavoca – ‘‘pāpicchā, bhante, sāriputtamoggallānā pāpikānaṃ icchānaṃ vasaṃ gatā’’ti. Evaṃ vutte, bhagavā kokālikaṃ bhikkhuṃ etadavoca – ‘‘mā hevaṃ, kokālika, avaca; mā hevaṃ, kokālika, avaca. Pasādehi, kokālika, sāriputtamoggallānesu cittaṃ. Pesalā sāriputtamoggallānā’’ti. Dutiyampi kho kokāliko bhikkhu bhagavantaṃ etadavoca – ‘‘kiñcāpi me, bhante, bhagavā saddhāyiko paccayiko; atha kho pāpicchāva bhante, sāriputtamoggallānā pāpikānaṃ icchānaṃ vasaṃ gatā’’ti. Dutiyampi kho bhagavā kokālikaṃ bhikkhuṃ etadavoca – ‘‘mā hevaṃ, kokālika, avaca; mā hevaṃ, kokālika, avaca. Pasādehi, kokālika, sāriputtamoggallānesu cittaṃ. Pesalā sāriputtamoggallānā’’ti. Tatiyampi kho kokāliko bhikkhu bhagavantaṃ etadavoca – ‘‘kiñcāpi…pe… icchānaṃ vasaṃ gatā’’ti. Tatiyampi kho bhagavā kokālikaṃ bhikkhuṃ etadavoca – ‘‘mā hevaṃ…pe… pesalā sāriputtamoggallānā’’ti. Atha kho kokāliko bhikkhu uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Acirapakkantassa ca kokālikassa bhikkhuno sāsapamattīhi pīḷakāhi [piḷakāhi (sī. pī.)] sabbo kāyo phuṭo ahosi. Sāsapamattiyo hutvā muggamattiyo ahesuṃ, muggamattiyo hutvā kalāyamattiyo ahesuṃ, kalāyamattiyo hutvā kolaṭṭhimattiyo ahesuṃ, kolaṭṭhimattiyo hutvā kolamattiyo ahesuṃ, kolamattiyo hutvā āmalakamattiyo ahesuṃ, āmalakamattiyo hutvā beluvasalāṭukamattiyo ahesuṃ, beluvasalāṭukamattiyo hutvā billamattiyo ahesuṃ, billamattiyo hutvā pabhijjiṃsu. Pubbañca lohitañca pagghariṃsu. Atha kho kokāliko bhikkhu teneva ābādhena kālamakāsi. Kālaṅkato ca kokāliko bhikkhu padumaṃ nirayaṃ upapajji sāriputtamoggallānesu cittaṃ āghātetvā. Atha kho brahmā sahampati abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho brahmā sahampati bhagavantaṃ etadavoca – ‘‘kokāliko, bhante, bhikkhu kālaṅkato. Kālaṅkato ca, bhante, kokāliko bhikkhu padumaṃ nirayaṃ upapanno sāriputtamoggallānesu cittaṃ āghātetvā’’ti. Idamavoca brahmā sahampati, idaṃ vatvā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyīti. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ brahmā sahampati abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho, bhikkhave, brahmā sahampati maṃ etadavoca – ‘kokāliko, bhante, bhikkhu kālaṅkato. Kālaṅkato ca, bhante, kokāliko bhikkhu padumaṃ nirayaṃ upapanno sāriputtamoggallānesu cittaṃ āghātetvā’ti. Idamavoca, bhikkhave, brahmā sahampati, idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. Evaṃ vutte, aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘kīvadīghaṃ nu kho, bhante, padume niraye āyuppamāṇa’’nti? ‘‘Dīghaṃ kho, bhikkhu, padume niraye āyuppamāṇaṃ. Taṃ na sukaraṃ saṅkhātuṃ – ettakāni vassāni iti vā, ettakāni vassasatāni iti vā, ettakāni vassasahassāni iti vā, ettakāni vassasatasahassāni iti vā’’ti. ‘‘Sakkā pana, bhante, upamaṃ kātu’’nti? ‘‘Sakkā, bhikkhū’’ti bhagavā avoca – ‘‘Seyyathāpi, bhikkhu vīsatikhāriko kosalako tilavāho. Tato puriso vassasatassa vassasatassa accayena ekamekaṃ tilaṃ uddhareyya; khippataraṃ kho so, bhikkhu, vīsatikhāriko kosalako tilavāho iminā upakkamena parikkhayaṃ pariyādānaṃ gaccheyya, na tveva eko abbudo nirayo. Seyyathāpi, bhikkhu, vīsati abbudā nirayā, evameko nirabbudanirayo. Seyyathāpi, bhikkhu, vīsati nirabbudā nirayā, evameko ababo nirayo. Seyyathāpi, bhikkhu, vīsati ababā nirayā, evameko aṭaṭo nirayo. Seyyathāpi, bhikkhu, vīsati aṭaṭā nirayā, evameko ahaho nirayo. Seyyathāpi, bhikkhu, vīsati ahahā nirayā, evameko kumudo nirayo. Seyyathāpi, bhikkhu, vīsati kumudā nirayā, evameko sogandhiko nirayo. Seyyathāpi, bhikkhu, vīsati sogandhikā nirayā, evameko uppalanirayo. Seyyathāpi, bhikkhu, vīsati uppalā nirayā, evameko puṇḍariko nirayo. Seyyathāpi, bhikkhu, vīsati puṇḍarikā nirayā, evameko padumo nirayo. Padume pana, bhikkhu, niraye kokāliko bhikkhu upapanno sāriputtamoggallānesu cittaṃ āghātetvā’’ti. Idamavoca bhagavā, idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Purisassa hi jātassa, Kuṭhārī jāyate mukhe; Yāya chindati attānaṃ, Bālo dubbhāsitaṃ bhaṇaṃ. ‘‘Yo nindiyaṃ pasaṃsati, Taṃ vā nindati yo pasaṃsiyo; Vicināti mukhena so kaliṃ, Kalinā tena sukhaṃ na vindati. ‘‘Appamattako ayaṃ kali, Yo akkhesu dhanaparājayo; Sabbassāpi sahāpi attanā, Ayameva mahantaro kali; Yo sugatesu manaṃ padosaye. ‘‘Sataṃ sahassānaṃ nirabbudānaṃ, Chattiṃsati pañca ca abbudāni; Yamariyagarahī nirayaṃ upeti, Vācaṃ manañca paṇidhāya pāpaka’’nti. Paṭhamo vaggo. Tassuddānaṃ – Āyācanaṃ gāravo brahmadevo, Bako ca brahmā aparā ca diṭṭhi; Pamādakokālikatissako ca, Turū ca brahmā aparo ca kokālikoti.",
      "english": "At Sāvatthī. Then the monk Kokālika approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, the monk Kokālika said to the Blessed One, \"Venerable Sir, Sāriputta and Moggallāna have evil desires; they are subject to evil wishes.\" When this was said, the Blessed One said to the monk Kokālika, \"Do not speak thus, Kokālika; do not speak thus, Kokālika. Make your mind clear and bright towards Sāriputta and Moggallāna. Sāriputta and Moggallāna are virtuous.\" A second time, the monk Kokālika said to the Blessed One, \"Even though, Venerable Sir, the Blessed One is my trusted and reliable one, nevertheless, Venerable Sir, Sāriputta and Moggallāna certainly have evil desires; they are subject to evil wishes.\" A second time, the Blessed One said to the monk Kokālika, \"Do not speak thus, Kokālika; do not speak thus, Kokālika. Make your mind clear and bright towards Sāriputta and Moggallāna. Sāriputta and Moggallāna are virtuous.\" A third time, the monk Kokālika said to the Blessed One, \"Even though, Venerable Sir, the Blessed One is my trusted and reliable one, nevertheless, Venerable Sir, Sāriputta and Moggallāna certainly have evil desires; they are subject to evil wishes.\" A third time, the Blessed One said to the monk Kokālika, \"Do not speak thus, Kokālika; do not speak thus, Kokālika. Make your mind clear and bright towards Sāriputta and Moggallāna. Sāriputta and Moggallāna are virtuous.\"\n\nThen the monk Kokālika rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed. Not long after the monk Kokālika had departed, his entire body became covered with boils the size of mustard seeds. Having been the size of mustard seeds, they became the size of mung beans; having been the size of mung beans, they became the size of peas; having been the size of peas, they became the size of jujube seeds; having been the size of jujube seeds, they became the size of jujube fruits; having been the size of jujube fruits, they became the size of myrobalan fruits; having been the size of myrobalan fruits, they became the size of unripe wood apples; having been the size of unripe wood apples, they became the size of ripe wood apples; and having been the size of ripe wood apples, they burst open. Pus and blood flowed forth. Then the monk Kokālika passed away from that very affliction. Having passed away, the monk Kokālika was reborn in the Paduma hell, having harbored resentment in his mind towards Sāriputta and Moggallāna.\n\nThen, when the night was far advanced, Brahmā Sahampati, having illuminated the entire Jeta Grove with his surpassing radiance, approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, Brahmā Sahampati said to the Blessed One, \"Venerable Sir, the monk Kokālika has passed away. And having passed away, Venerable Sir, the monk Kokālika was reborn in the Paduma hell, having harbored resentment in his mind towards Sāriputta and Moggallāna.\" This is what Brahmā Sahampati said. Having said this, he paid homage to the Blessed One, circumambulated him clockwise, and then vanished right there.\n\nThen, when that night had passed, the Blessed One addressed the monks, saying, \"Monks, this very night, Brahmā Sahampati, when the night was far advanced, having illuminated the entire Jeta Grove with his surpassing radiance, approached me. Having approached and paid homage to me, he stood to one side. Standing to one side, monks, Brahmā Sahampati said to me, 'Venerable Sir, the monk Kokālika has passed away. And having passed away, Venerable Sir, the monk Kokālika was reborn in the Paduma hell, having harbored resentment in his mind towards Sāriputta and Moggallāna.' Monks, this is what Brahmā Sahampati said. Having said this, he paid homage to me, circumambulated me clockwise, and then vanished right there.\"\n\nWhen this was said, a certain monk said to the Blessed One, \"Venerable Sir, what is the lifespan in the Paduma hell?\" \"Long, monk, is the lifespan in the Paduma hell. It is not easy to calculate it thus: 'So many years,' or 'so many hundreds of years,' or 'so many thousands of years,' or 'so many hundreds of thousands of years.'\" \"But is it possible, Venerable Sir, to make a comparison?\" \"It is possible, monk,\" the Blessed One said, \"Suppose, monk, there was a Kosalan cartload of twenty *khārī* of sesame seeds. From that, a man would remove one sesame seed after every hundred years. That Kosalan cartload of twenty *khārī* of sesame seeds would be exhausted and completely finished more quickly by this method, monk, than a single Abbuda hell. Suppose, monk, there were twenty Abbuda hells; such is one Nirabbuda hell. Suppose, monk, there were twenty Nirabbuda hells; such is one Ababa hell. Suppose, monk, there were twenty Ababa hells; such is one Aṭaṭa hell. Suppose, monk, there were twenty Aṭaṭa hells; such is one Ahaha hell. Suppose, monk, there were twenty Ahaha hells; such is one Kumuda hell. Suppose, monk, there were twenty Kumuda hells; such is one Sogandhika hell. Suppose, monk, there were twenty Sogandhika hells; such is one Uppala hell.\"\n\nJust as, monks, there are twenty Uppala hells, so there is one Puṇḍarīka hell. Just as, monks, there are twenty Puṇḍarīka hells, so there is one Paduma hell. But in the Paduma hell, monks, the monk Kokālika was reborn, having harbored hatred in his mind towards Sāriputta and Moggallāna.\n\nThe Blessed One spoke this. Having said this, the Fortunate One, the Teacher, then spoke further:\n\nIndeed, for a person who is born, an axe is born in his mouth, with which the fool, uttering ill-spoken words, cuts himself.\n\nWhoever praises what is blameable, or blames what is praiseworthy, by his mouth, he accumulates misfortune, and by that misfortune, he finds no happiness.\n\nTrifling is this misfortune of losing wealth through dice, even losing all one has, along with oneself. But this misfortune is far greater: that of polluting one's mind towards the Fortunate Ones.\n\nFor a duration of one hundred thousand Nirabbudas and thirty-six and five Abbudas, the one who reviles the Noble Ones goes to hell, having formulated evil speech and mind.\n\nThe First Chapter.\n\nIts summary: Āyācana, Gārava, Brahmadeva, Baka Brahmā, Another View, Pamāda, Kokālika, Tissaka, Turu Brahmā, and Another Kokālika.",
      "sinhala": "සැවැත්නුවරදී සිදුවූ කාරණයකි.\n\nඑවිට ආයුෂ්මත් කෝකාලික භික්‍ෂුව භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙකින් වාඩිවිය.\n\nඑකත්පසෙකින් වාඩි වී සිටි ආයුෂ්මත් කෝකාලික භික්‍ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා දුෂ්ට අදහස් ඇති, පාපී අභිලාෂයන්ට වසඟ වූ පිරිසකි.”\n\nමෙසේ පැවසූ විට භාග්‍යවතුන් වහන්සේ කෝකාලික භික්‍ෂුවට මෙසේ වදාළ සේක: “කෝකාලික, එසේ නොකියව. කෝකාලික, එසේ නොකියව. කෝකාලික, සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා කෙරෙහි සිත පහන් කර ගනුව. සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා යහපත් ගතිගුණ ඇත්තාහ.”\n\nදෙවෙනි වතාවටත් කෝකාලික භික්‍ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මා හට විශ්වාස කටයුතු, ප්‍රත්‍ය කටයුතු (බරපතළ කාරණාවලදී පවා විශ්වාස කටයුතු) වුවත්, ස්වාමීනි, සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා දුෂ්ට අදහස් ඇති, පාපී අභිලාෂයන්ට වසඟ වූ පිරිසක්ම වේ.”\n\nදෙවෙනි වතාවටත් භාග්‍යවතුන් වහන්සේ කෝකාලික භික්‍ෂුවට මෙසේ වදාළ සේක: “කෝකාලික, එසේ නොකියව. කෝකාලික, එසේ නොකියව. කෝකාලික, සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා කෙරෙහි සිත පහන් කර ගනුව. සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා යහපත් ගතිගුණ ඇත්තාහ.”\n\nතුන්වෙනි වතාවටත් කෝකාලික භික්‍ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මා හට විශ්වාස කටයුතු, ප්‍රත්‍ය කටයුතු වුවත්, ස්වාමීනි, සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා දුෂ්ට අදහස් ඇති, පාපී අභිලාෂයන්ට වසඟ වූ පිරිසක්ම වේ.”\n\nතුන්වෙනි වතාවටත් භාග්‍යවතුන් වහන්සේ කෝකාලික භික්‍ෂුවට මෙසේ වදාළ සේක: “කෝකාලික, එසේ නොකියව. කෝකාලික, එසේ නොකියව. කෝකාලික, සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා කෙරෙහි සිත පහන් කර ගනුව. සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා යහපත් ගතිගුණ ඇත්තාහ.”\n\nඉන්පසු කෝකාලික භික්‍ෂුව හුනස්නෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කර, ප්‍රදක්‍ෂිණා කර පිටව ගියේය.\n\nකෝකාලික භික්‍ෂුව පිටව ගොස් වැඩි වේලාවක් ගතවීමට පෙර ඔහුගේ මුළු ශරීරයම අබ ඇට තරම් වූ බිබිලිවලින් වැසී ගියේය. අබ ඇට තරම් වූ බිබිලි මුං ඇට තරම් විය. මුං ඇට තරම් වූ බිබිලි කඩල ඇට තරම් විය. කඩල ඇට තරම් වූ බිබිලි කෝලට්ඨි ඇට තරම් විය. කෝලට්ඨි ඇට තරම් වූ බිබිලි දඹ ඇට තරම් විය. දඹ ඇට තරම් වූ බිබිලි නෙල්ලි ගෙඩි තරම් විය. නෙල්ලි ගෙඩි තරම් වූ බිබිලි අමු බෙලි ගෙඩි තරම් විය. අමු බෙලි ගෙඩි තරම් වූ බිබිලි ඉදුණු බෙලි ගෙඩි තරම් විය. ඉදුණු බෙලි ගෙඩි තරම් වූ බිබිලි පුපුරා ගියේය. සැරවද ලේ ද වෑස්සෙන්නට විය.\n\nඉන්පසු කෝකාලික භික්‍ෂුව ඒ ආබාධයෙන්ම කාලක්‍රියා කළේය. සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා කෙරෙහි චිත්ත ආඝාතය ඇතිකරගෙන කාලක්‍රියා කළ කෝකාලික භික්‍ෂුව පදුම නිරයෙහි උපන්නේය.\n\nඉන්පසු සහම්පති බ්‍රහ්මයා, රාත්‍රිය පහන් වී ගෙන එන විට, අතිශයින් දීප්තිමත් ශරීර වර්ණයෙන් මුළු ජේතවනාරාමයම ආලෝකවත් කරමින්, භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙකින් සිට ගත්තේය.\n\nඑකත්පසෙකින් සිටි සහම්පති බ්‍රහ්මයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, කෝකාලික භික්‍ෂුව කාලක්‍රියා කළේය. ස්වාමීනි, සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා කෙරෙහි චිත්ත ආඝාතය ඇතිකරගෙන කාලක්‍රියා කළ කෝකාලික භික්‍ෂුව පදුම නිරයෙහි උපන්නේය.”\n\nසහම්පති බ්‍රහ්මයා මෙය කීවේය. මෙය කියා භාග්‍යවතුන් වහන්සේට වන්දනා කර, ප්‍රදක්‍ෂිණා කර එතැනම අතුරුදහන් විය.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ ඒ රාත්‍රිය පහන් වූ කල්හි භික්‍ෂූන් වහන්සේලා අමතා වදාළ සේක: “මහණෙනි, මේ රාත්‍රියේ සහම්පති බ්‍රහ්මයා, රාත්‍රිය පහන් වී ගෙන එන විට, අතිශයින් දීප්තිමත් ශරීර වර්ණයෙන් මුළු ජේතවනාරාමයම ආලෝකවත් කරමින්, මා වෙත පැමිණියේය. පැමිණ, මට වන්දනා කර එකත්පසෙකින් සිට ගත්තේය. මහණෙනි, එකත්පසෙකින් සිටි සහම්පති බ්‍රහ්මයා මට මෙසේ කීවේය: ‘ස්වාමීනි, කෝකාලික භික්‍ෂුව කාලක්‍රියා කළේය. ස්වාමීනි, සාරිපුත්ත මොග්ගල්ලාන ස්ථවිරයන් වහන්සේලා කෙරෙහි චිත්ත ආඝාතය ඇතිකරගෙන කාලක්‍රියා කළ කෝකාලික භික්‍ෂුව පදුම නිරයෙහි උපන්නේය’යි. මහණෙනි, සහම්පති බ්‍රහ්මයා මෙය කීවේය. මෙය කියා මට වන්දනා කර, ප්‍රදක්‍ෂිණා කර එතැනම අතුරුදහන් විය.”\n\nමෙසේ වදාළ කල්හි එක්තරා භික්‍ෂුවක් භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, පදුම නිරයෙහි ආයුෂ ප්‍රමාණය කොපමණ දීර්ඝ දැයි?”\n\n“මහණ, පදුම නිරයෙහි ආයුෂ ප්‍රමාණය දීර්ඝය. එය මෙපමණ වසරක් යැයි හෝ, මෙපමණ සිය ගණන් වසරක් යැයි හෝ, මෙපමණ දහස් ගණන් වසරක් යැයි හෝ, මෙපමණ ලක්‍ෂ ගණන් වසරක් යැයි හෝ ගණන් කිරීම පහසු නැත.”\n\n“එහෙත් ස්වාමීනි, උපමාවක් කීමට හැකිදැයි?”\n\n“මහණ, හැකිය”යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n“මහණ, යම් සේ විසි ඛාරියක් [ඛාරි නම් මිනුම් ඒකකයකි] බර කොසොල් තල ගොඩක් ඇතැයි සිතමු. ඒ තල ගොඩෙන් මිනිසෙක් සෑම වසර සියයකට වරක් එක තල ඇටයක් බැගින් ඉවත් කරයි. මහණ, ඒ විසි ඛාරියක් බර කොසොල් තල ගොඩ මේ උපායෙන් ඉක්මනින්ම ක්‍ෂය වී, මුළුමනින්ම අවසන් ව යන්නේය. එහෙත් එක් අබ්බුද නිරයක් එසේ අවසන් වන්නේ නැත.\n\nමහණ, යම් සේ විසි අබ්බුද නිරයක් වේද, එසේ වන්නේ එක් නිරබ්බුද නිරයකි.\nමහණ, යම් සේ විසි නිරබ්බුද නිරයක් වේද, එසේ වන්නේ එක් අබබ නිරයකි.\nමහණ, යම් සේ විසි අබබ නිරයක් වේද, එසේ වන්නේ එක් අටට නිරයකි.\nමහණ, යම් සේ විසි අටට නිරයක් වේද, එසේ වන්නේ එක් අහහ නිරයකි.\nමහණ, යම් සේ විසි අහහ නිරයක් වේද, එසේ වන්නේ එක් කුමුද නිරයකි.\nමහණ, යම් සේ විසි කුමුද නිරයක් වේද, එසේ වන්නේ එක් සෝගන්ධික නිරයකි.\nමහණ, යම් සේ විසි සෝගන්ධික නිරයක් වේද, එසේ වන්නේ එක් උප්පල නිරයකි.\n\nමහණ, යම් සේ විසි උප්පල නිරයෝ වෙත්ද, එසේම එක් පුණ්ඩරික නිරයක් වේ. මහණ, යම් සේ විසි පුණ්ඩරික නිරයෝ වෙත්ද, එසේම එක් පද්ම නිරයක් වේ. මහණ, එහෙත් පද්ම නිරයෙහි කෝකාලික භික්ෂුව ශ්‍රී සාරිපුත්‍ර හා මහාමොග්ගල්ලාන ස්ථවිරයන් කෙරෙහි සිතෙහි වෛරයක් ඇති කරගෙන උපන්නාහුය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා සුගතයන් වහන්සේ තවදුරටත් ශාස්තෘන් වහන්සේ ලෙස මෙය වදාළ සේක:\n\n\"ඇත්තෙන්ම උපන් පුරුෂයාට මුවෙහි පොරොවක් හටගනී. බාලයා අයහපත් වචන කියමින් යම් පොරොවකින් තමාම කපාගනී.\n\nයමෙක් නින්දා කටයුත්තක් පසසන්නේද, නැතහොත් ප්‍රශංසා කටයුත්තකට නින්දා කරන්නේද, හේ තමාගේ වචනයෙන් පාපය (අවාසනාව) රැස්කරයි. ඒ පාපය (අවාසනාව) නිසා ඔහු සැපතක් නොලබයි.\n\nයම් සූදු ක්‍රීඩාවකින් ධනය නැතිවීමක් වේද, මේ පාපය (අවාසනාව) සුළුය. තමාගේ සියල්ලම නැති වී ගියත්, මේ පාපය මහා මහා පාපයකි; යමෙක් සුගතයන් වහන්සේලා කෙරෙහි සිත දූෂ්‍ය කරන්නේද, එයයි (මහා පාපය).\n\nලක්ෂයක් නිරබුද නිරය තරම් දීර්ඝ කාලයක්ද, තිස් හයකුත් පසක් අබුද නිරය තරම් දීර්ඝ කාලයක්ද, යම් ආර්යයන්ට ගරහන පුද්ගලයා, පාපී වචනයෙන්ද සිතින්ද (ඔවුන්ට) නින්දා කිරීමෙන්, නිරයට පැමිණෙයි.\"\n\nපළමුවන වග්ගයයි.\n\nඑහි උද්දානය මෙසේය: ආයාචන සූත්‍රය, ගාරව සූත්‍රය, බ්‍රහ්මදේව සූත්‍රය, බක බ්‍රහ්ම සූත්‍රය, අපරා දිට්ඨි සූත්‍රය, පමාද සූත්‍රය, කෝකාලික සූත්‍රය, තිස්ස සූත්‍රය, තුරු බ්‍රහ්ම සූත්‍රය, අපර කෝකාලික සූත්‍රයයි.",
      "paliTitle": "Kokālikasuttaṃ"
    },
    {
      "number": 182,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati sappinītīre. Atha kho brahmā sanaṅkumāro abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ sappinītīraṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho brahmā sanaṅkumāro bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Khattiyo seṭṭho janetasmiṃ, ye gottapaṭisārino; Vijjācaraṇasampanno, so seṭṭho devamānuse’’ti. Idamavoca brahmā sanaṅkumāro. Samanuñño satthā ahosi. Atha kho brahmā sanaṅkumāro ‘‘samanuñño me satthā’’ti bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyīti.",
      "english": "Thus have I heard. At one time the Blessed One was dwelling in Rājagaha, on the bank of the Sappinī river. Then, when the night was far advanced, Brahmā Sanaṅkumāra, whose resplendent beauty illuminated the entire bank of the Sappinī, approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, Brahmā Sanaṅkumāra recited this verse in the presence of the Blessed One: \"Among those born, the Khattiya is supreme for those who identify with their lineage. But one perfect in knowledge and conduct is supreme among gods and humans.\" Brahmā Sanaṅkumāra spoke this. The Teacher approved. Then, understanding that \"My Teacher approves,\" Brahmā Sanaṅkumāra paid homage to the Blessed One, circumambulated him respectfully, and then vanished right there.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර සප්පිනී ගං ඉවුරේ වැඩසිටින සේක.\n\nඉන්පසු, සනත්කුමාර බ්‍රහ්මයා රාත්‍රිය පහන් වන විට, අතිශයින් දීප්තිමත් වර්ණයෙන් යුක්තව, මුළු සප්පිනී ගං ඉවුරම ආලෝකවත් කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙක සිටියේය.\n\nඑක් පසෙක සිටි සනත්කුමාර බ්‍රහ්මයා භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව ප්‍රකාශ කළේය: \"යම් අයෙක් ගෝත්‍රය අනුව (උසස් යැයි) සලකත් ද, ඔවුන් අතරින් ක්‍ෂත්‍රියයා මිනිසුන් අතර ශ්‍රේෂ්ඨය. එහෙත්, විද්‍යාචරණ සම්පන්න වූ තැනැත්තා දෙවියන් අතරත්, මිනිසුන් අතරත් ශ්‍රේෂ්ඨය.\"\n\nසනත්කුමාර බ්‍රහ්මයා මෙය කීවේය. ශාස්තෘන් වහන්සේ ඊට එකඟ වූ සේක. ඉන්පසු සනත්කුමාර බ්‍රහ්මයා \"ශාස්තෘන් වහන්සේ මා හා එකඟ වූ සේකැ\"යි (සතුටට පත්ව), භාග්‍යවතුන් වහන්සේට වන්දනා කොට, ප්‍රදක්ෂිණා කොට එහිම අතුරුදහන් විය.",
      "paliTitle": "Sanaṅkumārasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 183,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate acirapakkante devadatte. Atha kho brahmā sahampati abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ gijjhakūṭaṃ pabbataṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho brahmā sahampati devadattaṃ ārabbha bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Phalaṃ ve kadaliṃ hanti, phalaṃ veḷuṃ phalaṃ naḷaṃ; Sakkāro kāpurisaṃ hanti, gabbho assatariṃ yathā’’ti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Rājagaha, on Vulture Peak Mountain, not long after Devadatta had departed. Then, when the night was far advanced, Brahmā Sahampati, resplendent in his beauty, illuminating the entire Vulture Peak Mountain, approached the Blessed One. Having approached and saluted the Blessed One, he stood to one side. Standing to one side, Brahmā Sahampati, concerning Devadatta, uttered this verse in the presence of the Blessed One:\n\n\"Indeed, fruit destroys the plantain, fruit destroys the bamboo, fruit destroys the reed;\nHonor destroys the evil person, just as a fetus destroys a she-mule.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජ්ජකූට පර්වතයේ වැඩසිටින සේක, දේවදත්ත තෙරණුවන් (එතැනින්) ගොස් වැඩි කල් නොගිය අවස්ථාවෙහි. එවිට සහම්පති බ්‍රහ්මයා රෑ පසු කොට, අතිශය දීප්තිමත් ශරීර වර්ණයකින් යුක්තව, මුළු ගිජ්ජකූට පර්වතයම ආලෝකවත් කොට, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එක් පසෙක සිටියේය. එක් පසෙක සිටි සහම්පති බ්‍රහ්මයා දේවදත්ත තෙරණුවන් අරභයා භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව කීවේය –\n''ඵලය කෙසෙල් ගස නසන්නා සේ, ඵලය උණ ගස නසන්නා සේ, ඵලය බට ගස නසන්නා සේ,\n(එමෙන්ම) ලාභ සත්කාර දුර්ජනයා නසයි, ගැබ අශ්වතෙරිය නසන්නාක් මෙනි.''",
      "paliTitle": "Devadattasuttaṃ"
    },
    {
      "number": 184,
      "pali": "Ekaṃ samayaṃ bhagavā māgadhesu viharati andhakavinde. Tena kho pana samayena bhagavā rattandhakāratimisāyaṃ abbhokāse nisinno hoti, devo ca ekamekaṃ phusāyati. Atha kho brahmā sahampati abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ andhakavindaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho brahmā sahampati bhagavato santike imā gāthāyo abhāsi – ‘‘Sevetha pantāni senāsanāni, Careyya saṃyojanavippamokkhā; Sace ratiṃ nādhigaccheyya tattha, Saṅghe vase rakkhitatto satīmā. ‘‘Kulākulaṃ piṇḍikāya caranto, Indriyagutto nipako satīmā; Sevetha pantāni senāsanāni, Bhayā pamutto abhaye vimutto. ‘‘Yattha bheravā sarīsapā [siriṃ sapā (sī. syā. kaṃ. pī.)], Vijju sañcarati thanayati devo; Andhakāratimisāya rattiyā, Nisīdi tattha bhikkhu vigatalomahaṃso. ‘‘Idañhi jātu me diṭṭhaṃ, nayidaṃ itihītihaṃ; Ekasmiṃ brahmacariyasmiṃ, sahassaṃ maccuhāyinaṃ. ‘‘Bhiyyo [bhīyo (sī. syā. kaṃ. pī.)] pañcasatā sekkhā, dasā ca dasadhā dasa; Sabbe sotasamāpannā, atiracchānagāmino. ‘‘Athāyaṃ [atthāyaṃ-itipi dī. ni. 2.290] itarā pajā, puññabhāgāti me mano; Saṅkhātuṃ nopi sakkomi, musāvādassa ottapa’’nti [ottapeti (sī. syā. kaṃ. pī.), ottappeti (ka.)].",
      "english": "One time, the Blessed One was dwelling among the Magadhans in Andhakavinda. Now, at that time, the Blessed One was seated in the open air during a night of pitch darkness, and the sky was drizzling intermittently. Then, when the night was far advanced, Brahmā Sahampati, having illuminated the entire Andhakavinda with his surpassing radiance, approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, Brahmā Sahampati recited these verses in the presence of the Blessed One:\n\n\"One should frequent secluded abodes, striving for liberation from all fetters. If one does not find delight there, one should dwell in the Sangha, well-guarded in oneself, mindful.\n\n\"Going from house to house for alms, with senses guarded, astute, and mindful; one should frequent secluded abodes, released from fear, liberated in the fearless state.\n\n\"Where dreadful creeping things abound, where lightning flashes and the sky thunders; in the pitch-darkness of the night, a monk sits there, with all goosebumps gone.\n\n\"Indeed, this have I seen for myself, it is not mere hearsay: in one single period of the holy life, a thousand have transcended death.\n\n\"And more than five hundred trainees, and ten groups of ten, all of them stream-enterers, who will not be reborn in lower realms.\n\n\"But as for the rest of these beings, my mind considers them to be partakers of merit. I am unable to count them, for I am averse to false speech.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍ය​වතුන් වහන්සේ මගධයෙහි අන්‍ධකවින්ද නම් ගමේ වැඩ​වසන සේක. ඒ අවස්ථාවෙහි භාග්‍ය​වතුන් වහන්සේ රාත්‍රියේ පැවති ඝන අන්‍ධකාරයෙහි එළිමහන් තැනක වැඩ​හුන් සේක, වැහි බිඳු ද විටින් විට වැටෙමින් තිබිණි. ඉක්බිති සහම්පති බ්‍ර​හ්මයා, රෑ පහන්වන මොහොතේ, අතිශයින් දීප්තිමත් වර්ණ​යෙන් යුක්තව, අන්‍ධකවින්ද ගම මුළුල්ල ආලෝකවත් කොට, භාග්‍ය​වතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ, භාග්‍ය​වතුන් වහන්සේට වන්‍දනා කොට, එකත්​පස්ව සිටියේය. එකත්​පස්ව සිටි සහම්පති බ්‍ර​හ්මයා භාග්‍ය​වතුන් වහන්සේ ඉදිරියේ මේ ගාථා කීවේය –\n\n‘‘හුදෙකලා වූ සේනාසන සේවනය කළ යුතුය. සං​යෝජනවලින් (සියලු බැඳීම්වලින්) මිදීම පිණිස හැසිරිය යුතුය. එහි ඇලීමක් ඇතිකරගත නොහැකි නම්, සිත රකිනසුලු වූ සිහි නුවණින් යුක්තව, සඟ මැද වාසය කළ යුතුය.\n\n‘‘ගෙපිළිවෙළින් පිඬු​සිඟා වඩමින්, ඉන්‍ද්‍රියයන්ට සංවර වූ, ප්‍ර​ඥාවන්ත වූ, සිහි නුවණින් යුක්ත වූ භික්ෂුව, හුදෙකලා සේනාසන සේවනය කළ යුතුය. බියෙන් සම්පූර්ණයෙන් මිදී, අභය තත්ත්වයෙහි (රහත් බවෙහි) නිදහස් වූයේ වේ.\n\n‘‘භයානක සර්පයන් සිටින තැන, විදුලිය කොටා ගොරවන අකුණු සහිත වැසි ඇති තැන, ඝන අන්‍ධකාරයෙන් යුක්ත වූ රාත්‍රියෙහි, කිසිදු ලොමු​දැහැගැන්මක් නැති භික්ෂුව එහි වැඩ​හුන්නේය.\n\n‘‘මෙය මා විසින් සැබැවින්ම දැකපු දෙයකි; මෙය කටකතාවකින් අසන්නට ලැබුණු දෙයක් නොවේ. එකම බ්‍ර​හ්මචාරී පිළිවෙතක් තුළ, මරණය ජයගත් දහස් ගණනක් (රහතුන්) සිටිති.\n\n‘‘ඊට වැඩි පන්සියයක් සේඛ භික්ෂූන් වහන්සේලා ද, දහස් දෙනෙක් ද සිටිති; ඔවුන් සියල්ලෝම සෝවාන් ඵලයට පැමිණි අය වෙති, නැවත තිරිසන් ලෝකයට නොයන්නෝ වෙති.\n\n‘‘අනික් සෙසු ජනයා (පෘථග්​ජනයා) පුණ්‍ය​වන්තයන්යැයි මා සිතමි. ඔවුන්ගේ සංඛ්‍යාව ගණන් කොට කියන්නට මට නොහැකිය, එසේ කීමට නොහැකි වීමට හේතුව නම්, බොරු කීමට ඇති ලජ්ජාවයි.’’",
      "paliTitle": "Andhakavindasuttaṃ"
    },
    {
      "number": 185,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati…pe… tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Bhūtapubbaṃ, bhikkhave, rājā ahosi aruṇavā nāma. Rañño kho pana, bhikkhave, aruṇavato aruṇavatī nāma rājadhānī ahosi. Aruṇavatiṃ kho pana, bhikkhave, rājadhāniṃ [aruṇavatiyaṃ kho pana bhikkhave rājadhāniyaṃ (pī. ka.)] sikhī bhagavā arahaṃ sammāsambuddho upanissāya vihāsi. Sikhissa kho pana, bhikkhave, bhagavato arahato sammāsambuddhassa abhibhūsambhavaṃ nāma sāvakayugaṃ ahosi aggaṃ bhaddayugaṃ. Atha kho, bhikkhave, sikhī bhagavā arahaṃ sammāsambuddho abhibhuṃ bhikkhuṃ āmantesi – ‘āyāma, brāhmaṇa, yena aññataro brahmaloko tenupasaṅkamissāma, yāva bhattassa kālo bhavissatī’ti. ‘Evaṃ, bhante’ti kho bhikkhave, abhibhū bhikkhu sikhissa bhagavato arahato sammāsambuddhassa paccassosi. Atha kho, bhikkhave, sikhī bhagavā arahaṃ sammāsambuddho abhibhū ca bhikkhu – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – aruṇavatiyā rājadhāniyā antarahitā tasmiṃ brahmaloke pāturahesuṃ. ‘‘Atha kho, bhikkhave, sikhī bhagavā arahaṃ sammāsambuddho abhibhuṃ bhikkhuṃ āmantesi – ‘paṭibhātu, brāhmaṇa, taṃ brahmuno ca brahmaparisāya ca brahmapārisajjānañca dhammī kathā’ti. ‘Evaṃ, bhante’ti kho, bhikkhave, abhibhū bhikkhu sikhissa bhagavato arahato sammāsambuddhassa paṭissutvā, brahmānañca brahmaparisañca brahmapārisajje ca dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Tatra sudaṃ, bhikkhave, brahmā ca brahmaparisā ca brahmapārisajjā ca ujjhāyanti khiyyanti [khīyanti (sī. syā. kaṃ. pī.)] vipācenti – ‘acchariyaṃ vata, bho, abbhutaṃ vata bho, kathañhi nāma satthari sammukhībhūte sāvako dhammaṃ desessatī’’’ti! ‘‘Atha kho, bhikkhave, sikhī bhagavā arahaṃ sammāsambuddho abhibhuṃ bhikkhuṃ āmantesi – ‘ujjhāyanti kho te, brāhmaṇa, brahmā ca brahmaparisā ca brahmapārisajjā ca – acchariyaṃ vata, bho, abbhutaṃ vata, bho, kathañhi nāma satthari sammukhībhūte sāvako dhammaṃ desessatīti! Tena hi tvaṃ brāhmaṇa, bhiyyosomattāya brahmānañca brahmaparisañca brahmapārisajje ca saṃvejehī’ti. ‘Evaṃ, bhante’ti kho, bhikkhave, abhibhū bhikkhu sikhissa bhagavato arahato sammāsambuddhassa paṭissutvā dissamānenapi kāyena dhammaṃ desesi, adissamānenapi kāyena dhammaṃ desesi, dissamānenapi heṭṭhimena upaḍḍhakāyena adissamānena uparimena upaḍḍhakāyena dhammaṃ desesi, dissamānenapi uparimena upaḍḍhakāyena adissamānena heṭṭhimena upaḍḍhakāyena dhammaṃ desesi. Tatra sudaṃ, bhikkhave, brahmā ca brahmaparisā ca brahmapārisajjā ca acchariyabbhutacittajātā ahesuṃ – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho, samaṇassa mahiddhikatā mahānubhāvatā’’’ti! ‘‘Atha kho abhibhū bhikkhu sikhiṃ bhagavantaṃ arahantaṃ sammāsambuddhaṃ etadavoca – ‘abhijānāmi khvāhaṃ, bhante, bhikkhusaṅghassa majjhe evarūpiṃ vācaṃ bhāsitā – pahomi khvāhaṃ āvuso, brahmaloke ṭhito sahassilokadhātuṃ [sahassīlokadhātuṃ (sī. syā. kaṃ. pī.)] sarena viññāpetu’nti. ‘Etassa, brāhmaṇa, kālo, etassa, brāhmaṇa, kālo; yaṃ tvaṃ, brāhmaṇa, brahmaloke ṭhito sahassilokadhātuṃ sarena viññāpeyyāsī’ti. ‘Evaṃ, bhante’ti kho, bhikkhave, abhibhū bhikkhu sikhissa bhagavato arahato sammāsambuddhassa paṭissutvā brahmaloke ṭhito imā gāthāyo abhāsi – ‘‘Ārambhatha [ārabbhatha (sabbattha)] nikkamatha [nikkhamatha (sī. pī.)], yuñjatha buddhasāsane; Dhunātha maccuno senaṃ, naḷāgāraṃva kuñjaro. ‘‘Yo imasmiṃ dhammavinaye, appamatto vihassati; Pahāya jātisaṃsāraṃ, dukkhassantaṃ karissatī’’ti. ‘‘Atha kho, bhikkhave, sikhī ca bhagavā arahaṃ sammāsambuddho abhibhū ca bhikkhu brahmānañca brahmaparisañca brahmapārisajje ca saṃvejetvā – seyyathāpi nāma…pe… tasmiṃ brahmaloke antarahitā aruṇavatiyā rājadhāniyā pāturahesuṃ. Atha kho, bhikkhave, sikhī bhagavā arahaṃ sammāsambuddho bhikkhū āmantesi – ‘assuttha no, tumhe, bhikkhave, abhibhussa bhikkhuno brahmaloke ṭhitassa gāthāyo bhāsamānassā’ti? ‘Assumha kho mayaṃ, bhante, abhibhussa bhikkhuno brahmaloke ṭhitassa gāthāyo bhāsamānassā’ti. ‘Yathā kathaṃ pana tumhe, bhikkhave, assuttha abhibhussa bhikkhuno brahmaloke ṭhitassa gāthāyo bhāsamānassā’’’ti? Evaṃ kho mayaṃ, bhante, assumha abhibhussa bhikkhuno brahmaloke ṭhitassa gāthāyo bhāsamānassa – ‘‘Ārambhatha nikkamatha, yuñjatha buddhasāsane; Dhunātha maccuno senaṃ, naḷāgāraṃva kuñjaro. ‘‘Yo imasmiṃ dhammavinaye, appamatto vihassati; Pahāya jātisaṃsāraṃ, dukkhassantaṃ karissatī’’ti. ‘‘‘Evaṃ kho mayaṃ, bhante, assumha abhibhussa bhikkhuno brahmaloke ṭhitassa gāthāyo bhāsamānassā’ti. ‘Sādhu sādhu, bhikkhave; sādhu kho tumhe, bhikkhave! Assuttha abhibhussa bhikkhuno brahmaloke ṭhitassa gāthāyo bhāsamānassā’’’ti. Idamavoca bhagavā, attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Sāvatthī... There the Blessed One addressed the bhikkhus, saying, \"Bhikkhus!\" \"Venerable Sir,\" replied those bhikkhus to the Blessed One.\n\nThe Blessed One said this: \"Formerly, bhikkhus, there was a king named Aruṇavā. And, bhikkhus, King Aruṇavā had a capital city named Aruṇavatī. And, bhikkhus, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī, dwelled relying on the capital city of Aruṇavatī. And, bhikkhus, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī, had a pre-eminent and excellent pair of disciples named Abhibhū and Sambhava.\n\nThen, bhikkhus, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī, addressed the bhikkhu Abhibhū, saying, 'Come, brahmin, let us approach a certain Brahma-world until it is time for the meal.' 'Yes, Venerable Sir,' replied the bhikkhu Abhibhū to the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī. Then, bhikkhus, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī, and the bhikkhu Abhibhū – just as a strong man might extend his flexed arm or flex his extended arm – disappeared from the capital city of Aruṇavatī and reappeared in that Brahma-world.\n\nThen, bhikkhus, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī, addressed the bhikkhu Abhibhū, saying, 'Brahmin, let a discourse on the Dhamma occur to you for Brahmā, the Brahma assembly, and its attendants.' 'Yes, Venerable Sir,' replied the bhikkhu Abhibhū to the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī. Having assented, he then instructed, urged, inspired, and delighted Brahmā, the Brahma assembly, and its attendants with a discourse on the Dhamma. There, bhikkhus, Brahmā, the Brahma assembly, and its attendants murmured, complained, and protested: 'It is wonderful, sirs, it is astonishing, sirs! How can it be that a disciple teaches the Dhamma in the presence of the Teacher himself!'\n\nThen, bhikkhus, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī, addressed the bhikkhu Abhibhū, saying, 'Brahmin, Brahmā, the Brahma assembly, and its attendants are indeed murmuring and complaining: \"It is wonderful, sirs, it is astonishing, sirs! How can it be that a disciple teaches the Dhamma in the presence of the Teacher himself!\" Therefore, brahmin, inspire Brahmā, the Brahma assembly, and its attendants with an even greater sense of urgency and awe.' 'Yes, Venerable Sir,' replied the bhikkhu Abhibhū to the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī. Having assented, he then taught the Dhamma with a visible body, he taught the Dhamma with an invisible body, he taught the Dhamma with the lower half of his body visible and the upper half invisible, he taught the Dhamma with the upper half of his body visible and the lower half invisible. There, bhikkhus, Brahmā, the Brahma assembly, and its attendants were filled with wonder and astonishment, exclaiming: 'It is wonderful, sirs, it is astonishing, sirs, the great power and great might of this recluse!'\n\nThen the bhikkhu Abhibhū said to the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī: 'Venerable Sir, I recall having spoken such words in the assembly of bhikkhus: \"Friends, I am capable of making a thousand-world system reverberate with my voice while standing in the Brahma-world.\"' 'Brahmin, now is the time for that, brahmin, now is the time for that; that you, brahmin, standing in the Brahma-world, should make a thousand-world system reverberate with your voice.' 'Yes, Venerable Sir,' replied the bhikkhu Abhibhū to the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī. Having assented, he then stood in the Brahma-world and recited these verses:\n\n\"Strive on, go forth, engage in the Buddha's teaching;\nShake off the army of Death, as an elephant a reed-hut.\nWhoever remains diligent in this Dhamma and Discipline,\nAbandoning the cycle of birth and death, will make an end to suffering.\"\n\nThen, bhikkhus, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī, and the bhikkhu Abhibhū, having inspired Brahmā, the Brahma assembly, and its attendants with urgency and awe – just as a strong man might extend his flexed arm or flex his extended arm – disappeared from that Brahma-world and reappeared in the capital city of Aruṇavatī. Then, bhikkhus, the Blessed One, the Arahant, the Perfectly Enlightened Buddha Sikhī, addressed the bhikkhus, saying, 'Bhikkhus, did you hear the verses recited by the bhikkhu Abhibhū while he was standing in the Brahma-world?' 'Yes, Venerable Sir, we heard the verses recited by the bhikkhu Abhibhū while he was standing in the Brahma-world.'\n\n“How then, monks, did you hear the bhikkhu Abhibhu, who was abiding in the Brahma realm, speaking verses?”\n\n“Indeed, venerable sir, we heard the bhikkhu Abhibhu, who was abiding in the Brahma realm, speaking these verses: ‘Rouse yourselves, strive forth, devote yourselves to the Buddha’s Teaching. Rout the army of Death, just as an elephant bursts through a reed-hut. Whoever in this Dhamma and Discipline lives with diligence, having abandoned the cycle of birth and becoming, will make an end of suffering.’”\n\n“‘Indeed, venerable sir, we heard the bhikkhu Abhibhu, who was abiding in the Brahma realm, speaking verses thus.’”\n\n“Excellent, excellent, monks; indeed, excellent are you, monks, that you heard the bhikkhu Abhibhu, who was abiding in the Brahma realm, speaking verses!”\n\nThe Fortunate One spoke this, and those monks, with joyful hearts, rejoiced in what the Fortunate One had said.",
      "sinhala": "මා හට අසන ලද්දේ මෙසේය. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර වැඩවාසය කරති. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි!\" කියා වදාළ සේක. \"ස්වාමීනි!\" යි එම භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, පෙර වූ කලෙක අරුණවා නම් රජෙක් විය. මහණෙනි, එම අරුණවා රජුට අරුණවතී නම් රාජධානියක් තිබිණි. මහණෙනි, ඒ අරුණවතී රාජධානිය අසල සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ වැඩවාසය කළ සේක. මහණෙනි, සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට අභිභූ සහ සම්භව නම් වූ අග්‍රවූ ශ්‍රේෂ්ඨ ශ්‍රාවක යුග්මයක් විය. මහණෙනි, ඉක්බිති සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ අභිභූ භික්ෂුව අමතා, 'බ්‍රාහ්මණය, එන්න, අපි යම් බ්‍රහ්මලෝකයකට ගොස් භෝජන වේලාව වනතුරු එහි වාසය කරමු' යැයි වදාළ සේක. 'එසේය, ස්වාමීනි!' යි මහණෙනි, අභිභූ භික්ෂුව සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට පිළිතුරු දුන්නේය. මහණෙනි, ඉක්බිති සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේත් අභිභූ භික්ෂුවත්, ශක්තිමත් පුරුෂයෙක් හැකිලූ බාහුව දිග හරින්නා සේ හෝ දිග හැරී බාහුව හකුළුවන්නා සේම, අරුණවතී රාජධානියෙන් අතුරුදහන් වී එම බ්‍රහ්මලෝකයේ පහළ වූහ.\n\nමහණෙනි, ඉක්බිති සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ අභිභූ භික්ෂුව අමතා, 'බ්‍රාහ්මණය, බ්‍රහ්මයාටත් බ්‍රහ්ම පිරිසටත් බ්‍රහ්ම පිරිවරටත් ධර්ම කථාවක් දේශනා කිරීමට ඔබට අවස්ථාව පැමිණියේය' යැයි වදාළ සේක. 'එසේය, ස්වාමීනි!' යි මහණෙනි, අභිභූ භික්ෂුව සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට පිළිතුරු දී, බ්‍රහ්මයාටත් බ්‍රහ්ම පිරිසටත් බ්‍රහ්ම පිරිවරටත් ධර්ම කථාවකින් ධර්මය ප්‍රකාශ කරවීය, සමාදන් කරවීය, උත්සාහවත් කරවීය, සතුටු කරවීය. මහණෙනි, එහිදී බ්‍රහ්මයාත් බ්‍රහ්ම පිරිසත් බ්‍රහ්ම පිරිවරත් නොසතුටට පත්ව, කෝප වී, අමනාපයෙන් කීහ: 'අහෝ පුදුමයකි, අහෝ ආශ්චර්යයකි, ගුරුන් වහන්සේ ඉදිරියේම ශ්‍රාවකයෙක් කෙසේ නම් ධර්මය දේශනා කරන්නේදැ' යි!\n\nමහණෙනි, ඉක්බිති සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ අභිභූ භික්ෂුව අමතා, 'බ්‍රාහ්මණය, බ්‍රහ්මයාත් බ්‍රහ්ම පිරිසත් බ්‍රහ්ම පිරිවරත් නොසතුටට පත්ව, 'අහෝ පුදුමයකි, අහෝ ආශ්චර්යයකි, ගුරුන් වහන්සේ ඉදිරියේම ශ්‍රාවකයෙක් කෙසේ නම් ධර්මය දේශනා කරන්නේදැ' යි! කියති. එසේ නම් බ්‍රාහ්මණය, ඔබ බ්‍රහ්මයාත් බ්‍රහ්ම පිරිසත් බ්‍රහ්ම පිරිවරත් තව තවත් සංවේගයට පත් කරව' යැයි වදාළ සේක. 'එසේය, ස්වාමීනි!' යි මහණෙනි, අභිභූ භික්ෂුව සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට පිළිතුරු දී, දෘශ්‍යමාන ශරීරයෙන්ද ධර්මය දේශනා කළේය, අදෘශ්‍යමාන ශරීරයෙන්ද ධර්මය දේශනා කළේය, දෘශ්‍යමාන වූ පහළ අර්ධ ශරීරයෙන්ද අදෘශ්‍යමාන වූ ඉහළ අර්ධ ශරීරයෙන්ද ධර්මය දේශනා කළේය, දෘශ්‍යමාන වූ ඉහළ අර්ධ ශරීරයෙන්ද අදෘශ්‍යමාන වූ පහළ අර්ධ ශරීරයෙන්ද ධර්මය දේශනා කළේය. මහණෙනි, එහිදී බ්‍රහ්මයාත් බ්‍රහ්ම පිරිසත් බ්‍රහ්ම පිරිවරත් පුදුමයටත් ආශ්චර්යයටත් පත් වූ සිත් ඇත්තෝ වූහ: 'අහෝ පුදුමයකි, අහෝ ආශ්චර්යයකි, මේ ශ්‍රමණයන් වහන්සේගේ මහා ඍද්ධි බලයත් මහා ආනුභාවයත්!' යැයි.\n\nමහණෙනි, ඉක්බිති අභිභූ භික්ෂුව සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට මෙසේ කීවේය: 'ස්වාමීනි, මම භික්ෂු සංඝයා මධ්‍යයේ මෙවැනි වචනයක් කී බව දනිමි: 'ඇවැත්නි, මම බ්‍රහ්මලෝකයේ සිට දහස් ගණන් ලෝකධාතූන් ශබ්දයෙන් දැනුවත් කිරීමට සමත් වෙමි' යැයි. 'බ්‍රාහ්මණය, එයට මෙය සුදුසුම කාලයයි, බ්‍රාහ්මණය, එයට මෙය සුදුසුම කාලයයි; යමක් නම් ඔබ බ්‍රහ්මලෝකයේ සිට දහස් ගණන් ලෝකධාතූන් ශබ්දයෙන් දැනුවත් කළ යුතු වන්නේ' යැයි වදාළ සේක. 'එසේය, ස්වාමීනි!' යි මහණෙනි, අභිභූ භික්ෂුව සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට පිළිතුරු දී, බ්‍රහ්මලෝකයේ සිටිමින් මේ ගාථා ප්‍රකාශ කළේය:\n\n\"(ධර්ම මාර්ගය) අරඹන්න, (ගිහි ජීවිතයෙන්) නික්මෙන්න, බුදු සසුනේ යෙදෙන්න; කෙළඹ නිවසක් අලියෙක් සෙලවන්නා සේ මාර සේනාව දුරු කරන්න.\nයමෙක් මේ ධර්ම විනයෙහි අප්‍රමාදව වාසය කරන්නේද; හෙතෙම ජාති සංසාරය දුරු කොට දුකෙහි කෙළවර කරන්නේය.\"\n\nමහණෙනි, ඉක්බිති සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේත් අභිභූ භික්ෂුවත් බ්‍රහ්මයාත් බ්‍රහ්ම පිරිසත් බ්‍රහ්ම පිරිවරත් සංවේගයට පත් කොට, ශක්තිමත් පුරුෂයෙක් හැකිලූ බාහුව දිග හරින්නා සේ හෝ දිග හැරී බාහුව හකුළුවන්නා සේම, එම බ්‍රහ්මලෝකයෙන් අතුරුදහන් වී අරුණවතී රාජධානියේ පහළ වූහ. මහණෙනි, ඉක්බිති සිඛී භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ භික්ෂූන් අමතා, 'මහණෙනි, බ්‍රහ්මලෝකයේ සිටිමින් ගාථා ප්‍රකාශ කළ අභිභූ භික්ෂුවගේ ගාථා ඔබට ඇසුණාද?' යැයි විමසූ සේක. 'ස්වාමීනි, බ්‍රහ්මලෝකයේ සිටිමින් ගාථා ප්‍රකාශ කළ අභිභූ භික්ෂුවගේ ගාථා අපට ඇසුණේය' යැයි භික්ෂූහු පිළිතුරු දුන්හ.\n\nභාග්‍යවතුන් වහන්සේ විමසන සේක: \"මහණෙනි, බ්‍රහ්මලෝකයේ වැඩ සිටි අභිභූ නම් භික්ෂුව විසින් කියන ලද ගාථා ඔබලාට ඇසුණේ කෙසේද?\" \"ස්වාමීනි, බ්‍රහ්මලෝකයේ වැඩ සිටි අභිභූ නම් භික්ෂුව විසින් කියන ලද ගාථා අපට ඇසුණේ මෙසේය –\n\n‘ආරම්භ කරන්න, නික්මෙන්න, බුදුසසුනෙහි යෙදෙන්න. උණ ගෙයක් හෙළන ඇත් රජෙකු මෙන් මරුවාගේ සේනාව දුරු කරන්න. මේ ධර්ම විනයෙහි යම් කෙනෙක් අප්‍රමාදව වාසය කරන්නේද, ඔහු ජාති සංසාරය දුරු කොට දුකේ කෙළවර කරන්නේය.’\n\n\"ස්වාමීනි, බ්‍රහ්මලෝකයේ වැඩ සිටි අභිභූ නම් භික්ෂුව විසින් කියන ලද ගාථා අපට ඇසුණේ මෙසේය.\" \"සාධු සාධු මහණෙනි! මහණෙනි, ඔබලා ඉතා මැනවින් බ්‍රහ්මලෝකයේ වැඩ සිටි අභිභූ නම් භික්ෂුව විසින් කියන ලද ගාථා ශ්‍රවණය කළා.\" භාග්‍යවතුන් වහන්සේ මේ කාරණය වදාළ සේක. එම භික්ෂූහු සතුටු සිත් ඇතිව භාග්‍යවතුන් වහන්සේගේ වචනය අභිනන්දනය කළහ.",
      "paliTitle": "Aruṇavatīsuttaṃ"
    },
    {
      "number": 186,
      "pali": "Ekaṃ samayaṃ bhagavā kusinārāyaṃ viharati upavattane mallānaṃ sālavane antarena yamakasālānaṃ parinibbānasamaye. Atha kho bhagavā bhikkhū āmantesi – ‘‘handa dāni, bhikkhave, āmantayāmi vo – ‘vayadhammā saṅkhārā, appamādena sampādethā’ti. Ayaṃ tathāgatassa pacchimā vācā’’. Atha kho bhagavā paṭhamaṃ jhānaṃ [paṭhamajjhānaṃ (syā. kaṃ.) evaṃ dutiyaṃ jhānaṃ iccādīsupi] samāpajji. Paṭhamā jhānā [paṭhamajjhānā (syā. kaṃ.) evaṃ dutiyā jhānā iccādīsupi] vuṭṭhahitvā dutiyaṃ jhānaṃ samāpajji. Dutiyā jhānā vuṭṭhahitvā tatiyaṃ jhānaṃ samāpajji. Tatiyā jhānā vuṭṭhahitvā catutthaṃ jhānaṃ samāpajji. Catutthā jhānā vuṭṭhahitvā ākāsānañcāyatanaṃ samāpajji. Ākāsānañcāyatanā vuṭṭhahitvā viññāṇañcāyatanaṃ samāpajji. Viññāṇañcāyatanā vuṭṭhahitvā ākiñcaññāyatanaṃ samāpajji. Ākiñcaññāyatanā vuṭṭhahitvā nevasaññānāsaññāyatanaṃ samāpajji. Nevasaññānāsaññāyatanā vuṭṭhahitvā saññāvedayitanirodhaṃ samāpajji. Saññāvedayitanirodhā vuṭṭhahitvā nevasaññānāsaññāyatanaṃ samāpajji. Nevasaññānāsaññāyatanā vuṭṭhahitvā ākiñcaññāyatanaṃ samāpajji. Ākiñcaññāyatanā vuṭṭhahitvā viññāṇañcāyatanaṃ samāpajji. Viññāṇañcāyatanā vuṭṭhahitvā ākāsānañcāyatanaṃ samāpajji. Ākāsānañcāyatanā vuṭṭhahitvā catutthaṃ jhānaṃ samāpajji. Catutthā jhānā vuṭṭhahitvā tatiyaṃ jhānaṃ samāpajji. Tatiyā jhānā vuṭṭhahitvā dutiyaṃ jhānaṃ samāpajji. Dutiyā jhānā vuṭṭhahitvā paṭhamaṃ jhānaṃ samāpajji. Paṭhamā jhānā vuṭṭhahitvā dutiyaṃ jhānaṃ samāpajji. Dutiyā jhānā vuṭṭhahitvā tatiyaṃ jhānaṃ samāpajji. Tatiyā jhānā vuṭṭhahitvā catutthaṃ jhānaṃ samāpajji. Catutthā jhānā vuṭṭhahitvā samanantaraṃ bhagavā parinibbāyi. Parinibbute bhagavati saha parinibbānā brahmā sahampati imaṃ gāthaṃ abhāsi – ‘‘Sabbeva nikkhipissanti, bhūtā loke samussayaṃ; Yattha etādiso satthā, loke appaṭipuggalo; Tathāgato balappatto, sambuddho parinibbuto’’ti. Parinibbute bhagavati saha parinibbānā sakko devānamindo imaṃ gāthaṃ abhāsi – ‘‘Aniccā vata saṅkhārā, uppādavayadhammino; Uppajjitvā nirujjhanti, tesaṃ vūpasamo sukho’’ti. Parinibbute bhagavati saha parinibbānā āyasmā ānando imaṃ gāthaṃ abhāsi – ‘‘Tadāsi yaṃ bhiṃsanakaṃ, tadāsi lomahaṃsanaṃ; Sabbākāravarūpete, sambuddhe parinibbute’’ti. Parinibbute bhagavati saha parinibbānā āyasmā anuruddho imā gāthāyo abhāsi – ‘‘Nāhu assāsapassāso, ṭhitacittassa tādino; Anejo santimārabbha, cakkhumā parinibbuto [yaṃ kālamakarī muni (mahāparinibbānasutte)]. ‘‘Asallīnena cittena, vedanaṃ ajjhavāsayi; Pajjotasseva nibbānaṃ, vimokkho cetaso ahū’’ti. Dutiyo vaggo. Tassuddānaṃ – Brahmāsanaṃ devadatto, andhakavindo aruṇavatī; Parinibbānena ca desitaṃ, idaṃ brahmapañcakanti. ",
      "english": "On one occasion, the Blessed One was dwelling in Kusinārā, in the Upavattana sāla-grove of the Mallas, between the twin sāla trees, at the time of his final passing away. Then the Blessed One addressed the bhikkhus, \"Now, bhikkhus, I exhort you: All conditioned phenomena are subject to dissolution. Strive with diligence.\" This was the Tathāgata's last utterance.\n\nThen the Blessed One entered the first jhāna. Having emerged from the first jhāna, he entered the second jhāna. Having emerged from the second jhāna, he entered the third jhāna. Having emerged from the third jhāna, he entered the fourth jhāna. Having emerged from the fourth jhāna, he entered the dimension of infinite space. Having emerged from the dimension of infinite space, he entered the dimension of infinite consciousness. Having emerged from the dimension of infinite consciousness, he entered the dimension of nothingness. Having emerged from the dimension of nothingness, he entered the dimension of neither perception nor non-perception. Having emerged from the dimension of neither perception nor non-perception, he entered the cessation of perception and feeling. Having emerged from the cessation of perception and feeling, he entered the dimension of neither perception nor non-perception. Having emerged from the dimension of neither perception nor non-perception, he entered the dimension of nothingness. Having emerged from the dimension of nothingness, he entered the dimension of infinite consciousness. Having emerged from the dimension of infinite consciousness, he entered the dimension of infinite space. Having emerged from the dimension of infinite space, he entered the fourth jhāna. Having emerged from the fourth jhāna, he entered the third jhāna. Having emerged from the third jhāna, he entered the second jhāna. Having emerged from the second jhāna, he entered the first jhāna. Having emerged from the first jhāna, he entered the second jhāna. Having emerged from the second jhāna, he entered the third jhāna. Having emerged from the third jhāna, he entered the fourth jhāna. Immediately upon emerging from the fourth jhāna, the Blessed One attained final Nibbāna.\n\nWhen the Blessed One had attained final Nibbāna, immediately upon his final passing, Brahmā Sahampati uttered this verse:\n\"All beings in the world will lay down their aggregates.\nEven a teacher such as this, an incomparable person in the world;\nThe Tathāgata, mighty and fully enlightened, has attained final Nibbāna.\"\n\nWhen the Blessed One had attained final Nibbāna, immediately upon his final passing, Sakka, the lord of devas, uttered this verse:\n\"Truly, all conditioned phenomena are impermanent, by nature arising and passing away.\nHaving arisen, they cease; their cessation is bliss.\"\n\nWhen the Blessed One had attained final Nibbāna, immediately upon his final passing, the Venerable Ānanda uttered this verse:\n\"Terrifying was that time, hair-raising was that time,\nWhen the Fully Enlightened One, endowed with all supreme qualities, attained final Nibbāna.\"\n\nWhen the Blessed One had attained final Nibbāna, immediately upon his final passing, the Venerable Anuruddha uttered these verses:\n\"There was no in-breathing or out-breathing for that steadfast one, whose mind was firm.\nWithout agitation, finding peace, the Visionary One attained final Nibbāna.\nWith unshrinking mind, he endured the feeling.\nLike the extinguishing of a lamp was the liberation of his mind.\"\n\nThe Second Chapter. Its summary: Brahmā's Seat, Devadatta, Andhakavinda, Aruṇavatī; also that spoken concerning the Final Nibbāna. This is the Brahma-Pañcaka (Group of Five concerning Brahmā).",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කුසිනාරා නුවර, මල්ලවරුන්ගේ උපවත්තන නම් සල් වනයේ, යමක සල් ගස් දෙකක් අතර පිරිනිවන් පෑමේ අවස්ථාවේ වැඩසිටින සේක. එකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"ඇවැත්නි, දැන් මම ඔබට අවවාද කරමි: ‘සකස් කරන ලද සියලු දේ (සංඛාර ධර්ම) ක්ෂය වීමේ ස්වභාවයෙන් යුක්තයි. අප්‍රමාදයෙන් කටයුතු සම්පූර්ණ කරගන්න’ යනුවෙන්. මෙය තථාගතයන් වහන්සේගේ අවසාන වචනයයි.\"\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ පළමු ධ්‍යානයට සමවැදුන සේක. පළමු ධ්‍යානයෙන් නැගිට දෙවෙනි ධ්‍යානයට සමවැදුන සේක. දෙවෙනි ධ්‍යානයෙන් නැගිට තුන්වෙනි ධ්‍යානයට සමවැදුන සේක. තුන්වෙනි ධ්‍යානයෙන් නැගිට හතරවෙනි ධ්‍යානයට සමවැදුන සේක. හතරවෙනි ධ්‍යානයෙන් නැගිට ආකාසානඤ්චායතනයට සමවැදුන සේක. ආකාසානඤ්චායතනයෙන් නැගිට විඤ්ඤාණඤ්චායතනයට සමවැදුන සේක. විඤ්ඤාණඤ්චායතනයෙන් නැගිට ආකිඤ්චඤ්ඤායතනයට සමවැදුන සේක. ආකිඤ්චඤ්ඤායතනයෙන් නැගිට නේවසඤ්ඤානාසඤ්ඤායතනයට සමවැදුන සේක. නේවසඤ්ඤානාසඤ්ඤායතනයෙන් නැගිට සඤ්ඤා වේදයිත නිරෝධයට සමවැදුන සේක. සඤ්ඤා වේදයිත නිරෝධයෙන් නැගිට නේවසඤ්ඤානාසඤ්ඤායතනයට සමවැදුන සේක. නේවසඤ්ඤානාසඤ්ඤායතනයෙන් නැගිට ආකිඤ්චඤ්ඤායතනයට සමවැදුන සේක. ආකිඤ්චඤ්ඤායතනයෙන් නැගිට විඤ්ඤාණඤ්චායතනයට සමවැදුන සේක. විඤ්ඤාණඤ්චායතනයෙන් නැගිට ආකාසානඤ්චායතනයට සමවැදුන සේක. ආකාසානඤ්චායතනයෙන් නැගිට හතරවෙනි ධ්‍යානයට සමවැදුන සේක. හතරවෙනි ධ්‍යානයෙන් නැගිට තුන්වෙනි ධ්‍යානයට සමවැදුන සේක. තුන්වෙනි ධ්‍යානයෙන් නැගිට දෙවෙනි ධ්‍යානයට සමවැදුන සේක. දෙවෙනි ධ්‍යානයෙන් නැගිට පළමු ධ්‍යානයට සමවැදුන සේක. පළමු ධ්‍යානයෙන් නැගිට දෙවෙනි ධ්‍යානයට සමවැදුන සේක. දෙවෙනි ධ්‍යානයෙන් නැගිට තුන්වෙනි ධ්‍යානයට සමවැදුන සේක. තුන්වෙනි ධ්‍යානයෙන් නැගිට හතරවෙනි ධ්‍යානයට සමවැදුන සේක. හතරවෙනි ධ්‍යානයෙන් නැගී සිටි විගස භාග්‍යවතුන් වහන්සේ පිරිනිවන් පෑ සේක.\n\nභාග්‍යවතුන් වහන්සේ පිරිනිවන් පෑ කල්හි, පිරිනිවීමත් සමඟම බ්‍රහ්ම සහම්පති මේ ගාථාව පැවසීය: \"ලෝකයේ ඇති වූ සියලු සත්ත්වයෝ, ශරීරය අත්හැර දමන්නාහ; මේ ලෝකයෙහි එබඳු අසම පුද්ගලයෙක් වූ ශාස්තෘන් වහන්සේ, බලයට පත් වූ සම්බුදු තථාගතයන් වහන්සේත් පිරිනිවන් පෑ සේක.\"\n\nභාග්‍යවතුන් වහන්සේ පිරිනිවන් පෑ කල්හි, පිරිනිවීමත් සමඟම දෙවියන්ගේ අධිපති වූ ශක්‍රයා මේ ගාථාව පැවසීය: \"අහෝ! සියලු සංස්කාර ධර්මෝ අනිත්‍යය. ඒවා හටගැනීම හා නැසීම ස්වභාවය කොට ඇත්තාහ; හටගෙන නැති වී යන්නාහ. ඒවායේ සන්හිඳීම (නිරෝධය) සුවයකි.\"\n\nභාග්‍යවතුන් වහන්සේ පිරිනිවන් පෑ කල්හි, පිරිනිවීමත් සමඟම ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මේ ගාථාව පැවසූ සේක: \"එය භයානක විය, එය ලොමු ඩැහැගන්වන සුළු විය; සියලු අයුරින් ශ්‍රේෂ්ඨ වූ, සම්බුදුරජාණන් වහන්සේ පිරිනිවන් පෑ කල්හි.\"\n\nභාග්‍යවතුන් වහන්සේ පිරිනිවන් පෑ කල්හි, පිරිනිවීමත් සමඟම ආයුෂ්මත් අනුරුද්ධ ස්ථවිරයන් වහන්සේ මේ ගාථාවන් පැවසූ සේක: \"ස්ථිර සිතැති, ඒ වැනි තැනැත්තෙකුට ආශ්වාස ප්‍රශ්වාස නොවිය; තෘෂ්ණා රහිත වූ, ශාන්තිය අරඹයා, චක්ෂුස් ඇති ඒ මුණිවරයා පිරිනිවන් පෑ සේක.\" \"නොඇලුණු සිතකින් වේදනාව ඉවසා වදාළ සේක; පහනක් නිවී යන්නා සේ සිතේ විමුක්තිය සිදු විය.\"\n\nදෙවෙනි වර්ගයයි. එහි උද්දානය නම්: බ්‍රහ්මාසනය, දේවදත්ත, අන්ධකවින්ද, අරුණවතී, පරිනිර්වාණය යන දේශනා ඇතුළු මේ බ්‍රහ්මපඤ්චක වර්ගයයි.",
      "paliTitle": "Parinibbānasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Brahmasaṃyuttaṃ samattaṃ. [ito paraṃ marammapotthakesu evampi dissati –§brahmāyācanaṃ agāravañca, brahmadevo bako ca brahmā.§aññataro ca brahmākokālikañca, tissakañca turū ca.§brahmā kokālikabhikkhu, sanaṅkumārena devadattaṃ.§andhakavindaṃ aruṇavati, parinibbānena pannarasāti.]",
    "english": "",
    "sinhala": ""
  }
}