{
  "id": "sn.1.11",
  "title": {
    "pali": "Sakkasaṃyuttaṃ",
    "english": "The Connected Discourses with Sakka",
    "sinhala": "සක්ක සංයුත්තය"
  },
  "sections": [
    {
      "number": 247,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Bhūtapubbaṃ, bhikkhave, asurā deve abhiyaṃsu. Atha kho, bhikkhave, sakko devānamindo suvīraṃ devaputtaṃ āmantesi – ‘ete, tāta suvīra, asurā deve abhiyanti. Gaccha, tāta suvīra, asure paccuyyāhī’ti. ‘Evaṃ bhaddantavā’ti kho, bhikkhave, suvīro devaputto sakkassa devānamindassa paṭissutvā pamādaṃ āpādesi [āharesi (katthaci) navaṅguttare sīhanādasuttepi]. Dutiyampi kho, bhikkhave, sakko devānamindo suvīraṃ devaputtaṃ āmantesi – ‘ete, tāta suvīra, asurā deve abhiyanti. Gaccha, tāta suvīra, asure paccuyyāhī’ti. ‘Evaṃ bhaddantavā’ti kho, bhikkhave, suvīro devaputto sakkassa devānamindassa paṭissutvā dutiyampi pamādaṃ āpādesi. Tatiyampi kho, bhikkhave, sakko devānamindo suvīraṃ devaputtaṃ āmantesi – ‘ete, tāta suvīra, asurā deve abhiyanti. Gaccha, tāta suvīra, asure paccuyyāhī’ti. ‘Evaṃ bhaddantavā’ti kho, bhikkhave, suvīro devaputto sakkassa devānamindassa paṭissutvā tatiyampi pamādaṃ āpādesi. Atha kho, bhikkhave, sakko devānamindo suvīraṃ devaputtaṃ gāthāya ajjhabhāsi – ‘‘Anuṭṭhahaṃ avāyāmaṃ, sukhaṃ yatrādhigacchati; Suvīra tattha gacchāhi, mañca tattheva pāpayā’’ti. ‘‘Alasvassa [alasa’ssa (sī. pī.), alasvāyaṃ (syā. kaṃ.)] anuṭṭhātā, na ca kiccāni kāraye; Sabbakāmasamiddhassa, taṃ me sakka varaṃ disā’’ti. ‘‘Yatthālaso anuṭṭhātā, accantaṃ sukhamedhati; Suvīra tattha gacchāhi, mañca tattheva pāpayā’’ti. ‘‘Akammunā [akammanā (sī. pī.)] devaseṭṭha, sakka vindemu yaṃ sukhaṃ; Asokaṃ anupāyāsaṃ, taṃ me sakka varaṃ disā’’ti. ‘‘Sace atthi akammena, koci kvaci na jīvati; Nibbānassa hi so maggo, suvīra tattha gacchāhi; Mañca tattheva pāpayā’’ti. ‘‘So hi nāma, bhikkhave, sakko devānamindo sakaṃ puññaphalaṃ upajīvamāno devānaṃ tāvatiṃsānaṃ issariyādhipaccaṃ rajjaṃ kārento uṭṭhānavīriyassa vaṇṇavādī bhavissati. Idha kho taṃ, bhikkhave, sobhetha, yaṃ tumhe evaṃ svākkhāte dhammavinaye pabbajitā samānā uṭṭhaheyyātha ghaṭeyyātha vāyameyyātha appattassa pattiyā anadhigatassa adhigamāya, asacchikatassa sacchikiriyāyā’’ti.",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's park. There, the Blessed One addressed the bhikkhus, saying, \"Bhikkhus!\" \"Venerable Sir,\" those bhikkhus replied to the Blessed One. The Blessed One said this:\n\n\"Formerly, bhikkhus, the Asuras attacked the Devas. Then, bhikkhus, Sakka, the lord of the Devas, addressed the deva-son Suvīra, saying, 'These Asuras, dear Suvīra, are attacking the Devas. Go, dear Suvīra, counterattack the Asuras!' 'Yes, Venerable Sir,' bhikkhus, the deva-son Suvīra replied to Sakka, the lord of the Devas, but then fell into heedlessness. A second time, bhikkhus, Sakka, the lord of the Devas, addressed the deva-son Suvīra, saying, 'These Asuras, dear Suvīra, are attacking the Devas. Go, dear Suvīra, counterattack the Asuras!' 'Yes, Venerable Sir,' bhikkhus, the deva-son Suvīra replied to Sakka, the lord of the Devas, but then fell into heedlessness a second time. A third time, bhikkhus, Sakka, the lord of the Devas, addressed the deva-son Suvīra, saying, 'These Asuras, dear Suvīra, are attacking the Devas. Go, dear Suvīra, counterattack the Asuras!' 'Yes, Venerable Sir,' bhikkhus, the deva-son Suvīra replied to Sakka, the lord of the Devas, but then fell into heedlessness a third time.\n\nThen, bhikkhus, Sakka, the lord of the Devas, addressed the deva-son Suvīra with a verse:\n\n'Where one achieves happiness without exerting oneself, without making an effort; Suvīra, go there, and bring me there as well!'\n\n'Where one is lazy, inactive, and does not perform one's duties; where all desires are fulfilled – Sakka, show me that excellent place!'\n\n'Where a lazy, inactive person attains ultimate happiness; Suvīra, go there, and bring me there as well!'\n\n'O best of devas, Sakka, the happiness we find without action; that sorrowless, anguish-free happiness – Sakka, show me that excellent place!'\n\n'If there is any place where one does not live by action; indeed, that is the path to Nibbāna. Suvīra, go there; and bring me there as well!'\n\nIndeed, bhikkhus, Sakka, the lord of the Devas, living off the fruits of his own wholesome deeds, exercising sovereignty and dominion over the Devas of Tāvatiṃsa, will thus praise energetic striving. Here, bhikkhus, it would be fitting for you, who have gone forth in such a well-proclaimed Dhamma and Discipline, to arise, to exert yourselves, to strive, for the attainment of what is not yet attained, for the realization of what is not yet realized, for the direct experience of what is not yet directly experienced.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී – එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩ සිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා, \"මහණෙනි\" යි වදාළ සේක. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක –\n\n\"මහණෙනි, පෙර වූවක් නම්, අසුරයෝ දෙවියන් හා සටන් කළහ. මහණෙනි, ඉක්බිති දෙවියන්ගේ අධිපති ශක්‍රයා සුවීර නම් දෙව්පුත් අමතා, 'සුවීර, සුජාතය, මේ අසුරයෝ දෙවියන් හා සටන් කරති. යව, සුවීර, සුජාතය, අසුරයන් පළවා හරින්න'යි කීය. 'යහපත, වහන්සැ'යි මහණෙනි, සුවීර දෙව්පුත් දෙවියන්ගේ අධිපති ශක්‍රයාට පිළිවදන් දී ප්‍රමාද විය. මහණෙනි, දෙවැනි වරටත් දෙවියන්ගේ අධිපති ශක්‍රයා සුවීර දෙව්පුත් අමතා, 'සුවීර, සුජාතය, මේ අසුරයෝ දෙවියන් හා සටන් කරති. යව, සුවීර, සුජාතය, අසුරයන් පළවා හරින්න'යි කීය. 'යහපත, වහන්සැ'යි මහණෙනි, සුවීර දෙව්පුත් දෙවියන්ගේ අධිපති ශක්‍රයාට පිළිවදන් දී දෙවැනි වරටත් ප්‍රමාද විය. මහණෙනි, තුන්වැනි වරටත් දෙවියන්ගේ අධිපති ශක්‍රයා සුවීර දෙව්පුත් අමතා, 'සුවීර, සුජාතය, මේ අසුරයෝ දෙවියන් හා සටන් කරති. යව, සුවීර, සුජාතය, අසුරයන් පළවා හරින්න'යි කීය. 'යහපත, වහන්සැ'යි මහණෙනි, සුවීර දෙව්පුත් දෙවියන්ගේ අධිපති ශක්‍රයාට පිළිවදන් දී තුන්වැනි වරටත් ප්‍රමාද විය. මහණෙනි, ඉක්බිති දෙවියන්ගේ අධිපති ශක්‍රයා සුවීර දෙව්පුත්ට ගාථාවකින් කීය –\n\n'උත්සාහ නොකර, වීර්යය නොකොට සැපය ලැබිය හැකි යම් තැනක් වේ ද, සුවීර, එහි යව. මාවත් එතැනටම පමුණුවව.'\n\n'කම්මැලි වූ, උත්සාහ රහිත වූ, කිසිදු කටයුත්තක් නොකරන, සියලු කාම සම්පත්වලින් සමෘද්ධ වූ ඒ තත්ත්වය ශක්‍රය, මට වරයක් ලෙස දෙන්න.'\n\n'කම්මැලි වූ, උත්සාහ රහිත වූ තැනැත්තා අතිශයින්ම සැපය ලබන යම් තැනක් වේ නම්, සුවීර, එහි යව. මාවත් එතැනටම පමුණුවව.'\n\n'දේව ශ්‍රේෂ්ඨ ශක්‍රය, කිසිදු ක්‍රියාවක් නොකරම අපට ලැබෙන යම් ශෝක රහිත, කම්කළු රහිත සැපයක් වේ නම්, ශක්‍රය, ඒ වරය මට දෙන්න.'\n\n'යම් හෙයකින් ක්‍රියාවක් නොකොට කිසිවෙක් කොතැනකවත් ජීවත් නොවේ නම්, සුවීර, එය නිවනට මඟ වන්නේ ය. එහි යව, මාවත් එතැනටම පමුණුවව.'\n\nමහණෙනි, එසේ නම්, තව්තිසා දෙවියන්ට අධිපතිත්වය ද රාජ්‍යය ද පාලනය කරමින්, තමන්ගේ පින්ඵල භුක්ති විඳින, දෙවියන්ගේ අධිපති ශක්‍රයා පවා උත්සාහය හා වීර්යයෙහි ගුණ වර්ණනා කරන්නෙක් වන්නේ ය. මහණෙනි, මෙසේ මනාව දේශනා කරන ලද මේ ධර්ම විනයෙහි පැවිදි වූ ඔබ, නොලද දේ ලැබීම සඳහා ද, අවබෝධ නොකළ දේ අවබෝධ කරගැනීම සඳහා ද, ප්‍රත්‍යක්ෂ නොකළ දේ ප්‍රත්‍යක්ෂ කරගැනීම සඳහා ද නැඟී සිටීම, වෙර වැඩීම හා උත්සාහ කිරීම ඔබට ශෝභමාන වන්නේ ය.\"",
      "paliTitle": "Suvīrasuttaṃ",
      "vagga": "Paṭhamavaggo",
      "englishTitle": "The Discourse to Suvīra",
      "sinhalaTitle": "සුවීර සූත්‍රය",
      "vaggaEnglish": "First Chapter",
      "vaggaSinhala": "පළමු වර්ගය"
    },
    {
      "number": 248,
      "pali": "Sāvatthiyaṃ. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Bhūtapubbaṃ, bhikkhave, asurā deve abhiyaṃsu. Atha kho, bhikkhave, sakko devānamindo susīmaṃ [susimaṃ (syā. kaṃ. ka.)] devaputtaṃ āmantesi – ‘ete, tāta susīma, asurā deve abhiyanti. Gaccha, tāta susīma, asure paccuyyāhī’ti. ‘Evaṃ bhaddantavā’ti kho, bhikkhave, susīmo devaputto sakkassa devānamindassa paṭissutvā pamādaṃ āpādesi. Dutiyampi kho, bhikkhave, sakko devānamindo susīmaṃ devaputtaṃ āmantesi…pe… dutiyampi pamādaṃ āpādesi. Tatiyampi kho, bhikkhave, sakko devānamindo susīmaṃ devaputtaṃ āmantesi…pe… tatiyampi pamādaṃ āpādesi. Atha kho, bhikkhave, sakko devānamindo susīmaṃ devaputtaṃ gāthāya ajjhabhāsi – ‘‘Anuṭṭhahaṃ avāyāmaṃ, sukhaṃ yatrādhigacchati; Susīma tattha gacchāhi, mañca tattheva pāpayā’’ti. ‘‘Alasvassa anuṭṭhātā, na ca kiccāni kāraye; Sabbakāmasamiddhassa, taṃ me sakka varaṃ disā’’ti. ‘‘Yatthālaso anuṭṭhātā, accantaṃ sukhamedhati; Susīma tattha gacchāhi, mañca tattheva pāpayā’’ti. ‘‘Akammunā devaseṭṭha, sakka vindemu yaṃ sukhaṃ; Asokaṃ anupāyāsaṃ, taṃ me sakka varaṃ disā’’ti. ‘‘Sace atthi akammena, koci kvaci na jīvati; Nibbānassa hi so maggo, susīma tattha gacchāhi; Mañca tattheva pāpayā’’ti. ‘‘So hi nāma, bhikkhave, sakko devānamindo sakaṃ puññaphalaṃ upajīvamāno devānaṃ tāvatiṃsānaṃ issariyādhipaccaṃ rajjaṃ kārento uṭṭhānavīriyassa vaṇṇavādī bhavissati. Idha kho taṃ, bhikkhave, sobhetha, yaṃ tumhe evaṃ svākkhāte dhammavinaye pabbajitā samānā uṭṭhaheyyātha ghaṭeyyātha vāyameyyātha appattassa pattiyā, anadhigatassa adhigamāya, asacchikatassa sacchikiriyāyā’’ti.",
      "english": "In Sāvatthī. There, indeed, the Blessed One addressed the monks, saying, \"Monks!\" \"Venerable Sir,\" those monks replied to the Blessed One. The Blessed One said this: \"Formerly, monks, the asuras attacked the devas. Then, monks, Sakka, ruler of the devas, addressed the deva-son Susīma: 'My dear Susīma, these asuras are attacking the devas. Go, my dear Susīma, counter-attack the asuras!' 'Yes, venerable sir,' indeed, monks, the deva-son Susīma, having assented to Sakka, ruler of the devas, fell into negligence. A second time, monks, Sakka, ruler of the devas, addressed the deva-son Susīma... and a second time he fell into negligence. A third time, monks, Sakka, ruler of the devas, addressed the deva-son Susīma... and a third time he fell into negligence.\n\nThen, monks, Sakka, ruler of the devas, addressed the deva-son Susīma with a verse:\n'Where one attains happiness without rising up, without striving, Susīma, go there, and bring me there too.'\n\n'Where one is idle, not rising up, and does not perform one's duties, where all wishes are fulfilled, Sakka, show me that excellent place.'\n\n'Where one who is idle, not rising up, experiences ultimate happiness, Susīma, go there, and bring me there too.'\n\n'O Sakka, chief of devas, if we could find happiness, sorrowless and free from vexation, through non-doing, show me that excellent place, Sakka.'\n\n'If there is anyone who lives without action, in any place, that indeed is the path to Nibbāna. Susīma, go there, and bring me there too.'\n\nIndeed, monks, Sakka, ruler of the devas, who lives by the fruit of his own merits, reigning with sovereignty and dominion over the Tāvatiṃsa devas, will be an advocate of rising up and energetic striving. Here, then, monks, it would be fitting for you, who have gone forth in such a well-proclaimed Dhamma-Vinaya, to rise up, to strive, to exert yourselves for the attainment of what has not yet been attained, for the realization of what has not yet been realized, for the direct experience of what has not yet been directly experienced.\"",
      "sinhala": "සැවැත්නුවරදී. එහිදී භාග්‍යවතුන් වහන්සේ භික්‍ෂූන් අමතා \"මහණෙනි\" යැයි වදාළ සේක. \"වහන්සැ\" යි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"මහණෙනි, පෙර කල අසුරයෝ දෙවියන් හා සටනට පිවිසියහ. මහණෙනි, එකල්හි දෙවියන්ට අධිපති වූ ශක්‍රයා සුසීම නම් දෙව්පුත්‍රයාට කතා කොට මෙසේ කීවේය: 'දරුව, සුසීම, මේ අසුරයෝ දෙවියන් හා සටනට පිවිසෙති. දරුව, සුසීම, ඔබ ගොස් අසුරයන්ට විරුද්ධව සටන් කරන්න.’ මහණෙනි, ‘එසේය, ස්වාමීනි’ යැයි සුසීම නම් දෙව්පුත්‍රයා දෙවියන්ට අධිපති වූ ශක්‍රයාට පිළිතුරු දී ප්‍‍රමාද විය. මහණෙනි, දෙවන වරටත් දෙවියන්ට අධිපති වූ ශක්‍රයා සුසීම නම් දෙව්පුත්‍රයාට කතා කොට… (පෙ) …දෙවන වරටත් ප්‍‍රමාද විය. මහණෙනි, තුන්වන වරටත් දෙවියන්ට අධිපති වූ ශක්‍රයා සුසීම නම් දෙව්පුත්‍රයාට කතා කොට… (පෙ) …තුන්වන වරටත් ප්‍‍රමාද විය. මහණෙනි, එකල්හි දෙවියන්ට අධිපති වූ ශක්‍රයා සුසීම නම් දෙව්පුත්‍රයාට ගාථාවකින් මෙසේ පැවසුවේය –\n\n\"නොනැඟී සිටින, උත්සාහ නොකරන කෙනෙකුට යම් තැනක සැපය ලැබේද, සුසීම, ඔබ එහි යන්න. මා ද එතැනට පමුණුවන්න.\"\n\n\"කම්මැලි වූ, නොනැඟී සිටින, යුතුකම් නොකරන කෙනෙකුට, සියලු ආශාවන් සම්පූර්ණ වන, ඒ වරය මට දෙන්න ශක්‍රයෙනි.\"\n\n\"යම් තැනක කම්මැලි, නොනැඟී සිටින කෙනෙකුට අතිශයින් සැපය ලැබේද, සුසීම, ඔබ එහි යන්න. මා ද එතැනට පමුණුවන්න.\"\n\n\"දෙව්ශ්‍‍රේෂ්ඨ ශක්‍රයෙනි, ක්‍රියා නොකොට අපට යම් සැපයක් ලැබේ නම්, ශෝක රහිත, වෙහෙස රහිත වූ ඒ වරය මට දෙන්න ශක්‍රයෙනි.\"\n\n\"ක්‍රියා නොකර කිසිවෙකු කොතැනකවත් ජීවත් නොවන්නේ නම්, ඒ නිවනට යන මාර්ගය වන්නේය. සුසීම, ඔබ එහි යන්න; මා ද එතැනට පමුණුවන්න.\"\n\n\"මහණෙනි, දෙතිස් දෙවිවරුන්ගේ අධිපති බව, රාජ්‍යය පාලනය කරමින්, තමන්ගේ පින්ඵල උපයෝගී කරගෙන ජීවත් වන ඒ ශක්‍ර දේවේන්ද්‍රයා පවා උත්සාහවත් බවේ ගුණ වර්ණනා කරන්නේය. මහණෙනි, එසේ හෙයින්, මනාව දේශනා කරන ලද මේ ධ‍ර්‍ම-විනයෙහි පැවිදි වූ ඔබ, නොලැබූ දේ ලැබීම පිණිස, අවබෝධ නොකළ දේ අවබෝධ කිරීම පිණිස, ප්‍‍රත්‍යක්ෂ නොකළ දේ ප්‍‍රත්‍යක්ෂ කිරීම පිණිස උත්සාහවත් වන්න, වෙර වඩන්න, වෑයම් කරන්න. එය ඔබට සුදුසු වන්නේය.\"",
      "paliTitle": "Susīmasuttaṃ",
      "englishTitle": "The Discourse to Susīma",
      "sinhalaTitle": "සුසීම සූත්‍රය"
    },
    {
      "number": 249,
      "pali": "Sāvatthiyaṃ. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Bhūtapubbaṃ, bhikkhave, devāsurasaṅgāmo samupabyūḷho ahosi. Atha kho, bhikkhave, sakko devānamindo deve tāvatiṃse āmantesi – ‘Sace, mārisā, devānaṃ saṅgāmagatānaṃ uppajjeyya bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, mameva tasmiṃ samaye dhajaggaṃ ullokeyyātha. Mamañhi vo dhajaggaṃ ullokayataṃ yaṃ bhavissati bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, so pahīyissati’. ‘No ce me dhajaggaṃ ullokeyyātha, atha pajāpatissa devarājassa dhajaggaṃ ullokeyyātha. Pajāpatissa hi vo devarājassa dhajaggaṃ ullokayataṃ yaṃ bhavissati bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, so pahīyissati’. ‘No ce pajāpatissa devarājassa dhajaggaṃ ullokeyyātha, atha varuṇassa devarājassa dhajaggaṃ ullokeyyātha. Varuṇassa hi vo devarājassa dhajaggaṃ ullokayataṃ yaṃ bhavissati bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, so pahīyissati’. ‘No ce varuṇassa devarājassa dhajaggaṃ ullokeyyātha, atha īsānassa devarājassa dhajaggaṃ ullokeyyātha. Īsānassa hi vo devarājassa dhajaggaṃ ullokayataṃ yaṃ bhavissati bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, so pahīyissatī’’’ti. ‘‘Taṃ kho pana, bhikkhave, sakkassa vā devānamindassa dhajaggaṃ ullokayataṃ, pajāpatissa vā devarājassa dhajaggaṃ ullokayataṃ, varuṇassa vā devarājassa dhajaggaṃ ullokayataṃ, īsānassa vā devarājassa dhajaggaṃ ullokayataṃ yaṃ bhavissati bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, so pahīyethāpi nopi pahīyetha [no pahīyetha (ka.)]. ‘‘Taṃ kissa hetu? Sakko hi, bhikkhave, devānamindo avītarāgo avītadoso avītamoho bhīru chambhī utrāsī palāyīti. ‘‘Ahañca kho, bhikkhave, evaṃ vadāmi – ‘sace tumhākaṃ, bhikkhave, araññagatānaṃ vā rukkhamūlagatānaṃ vā suññāgāragatānaṃ vā uppajjeyya bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, mameva tasmiṃ samaye anussareyyātha – itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Mamañhi vo, bhikkhave, anussarataṃ yaṃ bhavissati bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, so pahīyissati. ‘‘No ce maṃ anussareyyātha, atha dhammaṃ anussareyyātha – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti. Dhammañhi vo, bhikkhave, anussarataṃ yaṃ bhavissati bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, so pahīyissati. ‘‘No ce dhammaṃ anussareyyātha, atha saṅghaṃ anussareyyātha – ‘suppaṭipanno bhagavato sāvakasaṅgho ujuppaṭipanno bhagavato sāvakasaṅgho ñāyappaṭipanno bhagavato sāvakasaṅgho sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho, āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti. Saṅghañhi vo, bhikkhave, anussarataṃ yaṃ bhavissati bhayaṃ vā chambhitattaṃ vā lomahaṃso vā, so pahīyissati. ‘‘Taṃ kissa hetu? Tathāgato hi, bhikkhave, arahaṃ sammāsambuddho vītarāgo vītadoso vītamoho abhīru acchambhī anutrāsī apalāyī’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Araññe rukkhamūle vā, suññāgāreva bhikkhavo; Anussaretha [anussareyyātha (ka.) padasiddhi pana cintetabbā] sambuddhaṃ, bhayaṃ tumhāka no siyā. ‘‘No ce buddhaṃ sareyyātha, lokajeṭṭhaṃ narāsabhaṃ; Atha dhammaṃ sareyyātha, niyyānikaṃ sudesitaṃ. ‘‘No ce dhammaṃ sareyyātha, niyyānikaṃ sudesitaṃ; Atha saṅghaṃ sareyyātha, puññakkhettaṃ anuttaraṃ. ‘‘Evaṃ buddhaṃ sarantānaṃ, dhammaṃ saṅghañca bhikkhavo; Bhayaṃ vā chambhitattaṃ vā, lomahaṃso na hessatī’’ti.",
      "english": "At Sāvatthī. There, the Blessed One addressed the bhikkhus, saying, \"Bhikkhus.\" \"Venerable Sir,\" replied those bhikkhus to the Blessed One. The Blessed One spoke thus:\n\n\"Once upon a time, bhikkhus, a battle arose between devas and asuras. Then, bhikkhus, Sakka, the lord of devas, addressed the devas of Tāvatiṃsa, saying,\n\n'Friends, if, when you have gone into battle, fear, terror, or hair-raising dread should arise, then at that moment you should look at my banner top. For when you look at my banner top, whatever fear, terror, or hair-raising dread there may be will vanish.'\n\n'If you do not look at my banner top, then you should look at the banner top of Pajāpati, the deva king. For when you look at the banner top of Pajāpati, the deva king, whatever fear, terror, or hair-raising dread there may be will vanish.'\n\n'If you do not look at the banner top of Pajāpati, the deva king, then you should look at the banner top of Varuṇa, the deva king. For when you look at the banner top of Varuṇa, the deva king, whatever fear, terror, or hair-raising dread there may be will vanish.'\n\n'If you do not look at the banner top of Varuṇa, the deva king, then you should look at the banner top of Īsāna, the deva king. For when you look at the banner top of Īsāna, the deva king, whatever fear, terror, or hair-raising dread there may be will vanish.'\"\n\n\"However, bhikkhus, for those looking at the banner top of Sakka, the lord of devas, or looking at the banner top of Pajāpati, the deva king, or looking at the banner top of Varuṇa, the deva king, or looking at the banner top of Īsāna, the deva king, whatever fear, terror, or hair-raising dread there may be might vanish, or it might not vanish.\"\n\n\"And why is that? Because Sakka, bhikkhus, the lord of devas, is not free from lust, not free from hatred, not free from delusion; he is fearful, terror-stricken, easily alarmed, and prone to flight.\"\n\n\"But I, bhikkhus, say this: 'If, bhikkhus, when you have gone to the forest, or to the root of a tree, or to an empty dwelling, fear, terror, or hair-raising dread should arise, then at that moment you should recollect me: \"Indeed, the Blessed One is an Arahant, a Perfectly Enlightened One, accomplished in knowledge and conduct, a Fortunate One, knower of the world, an unsurpassed leader of persons to be tamed, a teacher of devas and humans, the Buddha, the Blessed One.\" For when you recollect me, bhikkhus, whatever fear, terror, or hair-raising dread there may be will vanish.'\"\n\n\"If you do not recollect me, then you should recollect the Dhamma: 'The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, relevant, to be personally experienced by the wise.' For when you recollect the Dhamma, bhikkhus, whatever fear, terror, or hair-raising dread there may be will vanish.\"\n\n\"If you do not recollect the Dhamma, then you should recollect the Saṅgha: 'The Saṅgha of the Blessed One's disciples is practicing well; the Saṅgha of the Blessed One's disciples is practicing directly; the Saṅgha of the Blessed One's disciples is practicing insightfully; the Saṅgha of the Blessed One's disciples is practicing properly; that is, the four pairs of persons, the eight types of individuals – this Saṅgha of the Blessed One's disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.' For when you recollect the Saṅgha, bhikkhus, whatever fear, terror, or hair-raising dread there may be will vanish.\"\n\n\"And why is that? Because the Tathāgata, bhikkhus, the Arahant, the Perfectly Enlightened One, is free from lust, free from hatred, free from delusion; he is fearless, not terror-stricken, not easily alarmed, and not prone to flight.\"\n\nThis is what the Blessed One said. Having said this, the Fortunate One, the Teacher, further said:\n\nBhikkhus, in the forest, at the root of a tree, or in an empty dwelling,\nYou should recollect the Fully Awakened One; then fear will not be yours.\n\nIf you do not recollect the Buddha, the foremost of the world, the bull among men;\nThen you should recollect the Dhamma, the liberating and well-expounded.\n\nIf you do not recollect the Dhamma, the liberating and well-expounded;\nThen you should recollect the Saṅgha, the unsurpassed field of merit.\n\nBhikkhus, for those recollecting the Buddha, the Dhamma, and the Saṅgha in this way,\nFear, terror, or hair-raising dread will not arise.",
      "sinhala": "සැවැත්නුවරදී. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි\" කියා. \"වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, පෙර දවස දෙවියන්ගේ සහ අසුරයන්ගේ යුද්ධයක් ඇති විය. මහණෙනි, එවිට ශක්‍ර දේවේන්ද්‍රයා තව්තිසා දෙවියන් අමතා මෙසේ කීවේය: 'මහණෙනි, දේවවරුනි, යුද්ධයට ගිය ඔබට බියක් හෝ තැතිගැනීමක් හෝ ලොමුදැහැගැනීමක් ඇති වුවහොත්, ඒ මොහොතේ මාගේ ධජයේ අග්‍රය බලව්. මාගේ ධජයේ අග්‍රය බලන ඔබට ඇති වන බිය හෝ තැතිගැනීම හෝ ලොමුදැහැගැනීම පහව යන්නේය.'\n\n'යම් හෙයකින් මාගේ ධජයේ අග්‍රය නොබලන්නේ නම්, එවිට ප්‍රජාපති නම් දේවරාජයාගේ ධජයේ අග්‍රය බලව්. ප්‍රජාපති නම් දේවරාජයාගේ ධජයේ අග්‍රය බලන ඔබට ඇති වන බිය හෝ තැතිගැනීම හෝ ලොමුදැහැගැනීම පහව යන්නේය.'\n\n'යම් හෙයකින් ප්‍රජාපති නම් දේවරාජයාගේ ධජයේ අග්‍රය නොබලන්නේ නම්, එවිට වරුණ නම් දේවරාජයාගේ ධජයේ අග්‍රය බලව්. වරුණ නම් දේවරාජයාගේ ධජයේ අග්‍රය බලන ඔබට ඇති වන බිය හෝ තැතිගැනීම හෝ ලොමුදැහැගැනීම පහව යන්නේය.'\n\n'යම් හෙයකින් වරුණ නම් දේවරාජයාගේ ධජයේ අග්‍රය නොබලන්නේ නම්, එවිට ඊසාන නම් දේවරාජයාගේ ධජයේ අග්‍රය බලව්. ඊසාන නම් දේවරාජයාගේ ධජයේ අග්‍රය බලන ඔබට ඇති වන බිය හෝ තැතිගැනීම හෝ ලොමුදැහැගැනීම පහව යන්නේය.'\n\n\"මහණෙනි, නමුත් ශක්‍ර දේවේන්ද්‍රයාගේ ධජයේ අග්‍රය බලන ඔබට හෝ, ප්‍රජාපති නම් දේවරාජයාගේ ධජයේ අග්‍රය බලන ඔබට හෝ, වරුණ නම් දේවරාජයාගේ ධජයේ අග්‍රය බලන ඔබට හෝ, ඊසාන නම් දේවරාජයාගේ ධජයේ අග්‍රය බලන ඔබට හෝ, ඇති වන බිය හෝ තැතිගැනීම හෝ ලොමුදැහැගැනීම, පහව යා හැකි වුවද, නොපහව යා හැකිද වේ.\n\n\"එයට හේතුව කුමක්ද? මහණෙනි, ශක්‍ර දේවේන්ද්‍රයා රාගය දුරු නොකළ, ද්වේෂය දුරු නොකළ, මෝහය දුරු නොකළ, බියපත් වූ, තැතිගත්, තිගැස්සුණු, පලායන ස්වභාව ඇත්තෙක් වන බැවිනි.\n\n\"මහණෙනි, මම මෙසේ කියමි: 'මහණෙනි, ඔබට වනගත වූ කල්හි හෝ, රුක්මුල්ගත වූ කල්හි හෝ, ශූන්‍යාගාරගත වූ කල්හි හෝ, බියක් හෝ තැතිගැනීමක් හෝ ලොමුදැහැගැනීමක් ඇති වුවහොත්, ඒ මොහොතේ මාවම සිහි කරව්. 'ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විජ්ජාචරණසම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථි, සත්ථා දේවමනුස්සානං, බුද්ධෝ, භගවා' යනුවෙන් සිහි කරව්. මා සිහි කරන ඔබට ඇති වන බිය හෝ තැතිගැනීම හෝ ලොමුදැහැගැනීම පහව යන්නේය.'\n\n\"යම් හෙයකින් මා සිහි නොකරන්නේ නම්, එවිට ධර්මය සිහි කරව්. 'භාග්‍යවතුන් වහන්සේ විසින් මැනවින් දේශනා කරන ලද ඒ ධර්මය ස්වභාවයෙන්ම දැකිය හැකි, කල් නොයවා විපාක දෙන, පැමිණ බලන්නට සුදුසු, තමා කරා පමුණුවා ගත යුතු, නුවණැත්තන් විසින් තමා තුළින්ම අවබෝධ කරගත යුතු ධර්මයකි' යනුවෙන් සිහි කරව්. ධර්මය සිහි කරන ඔබට ඇති වන බිය හෝ තැතිගැනීම හෝ ලොමුදැහැගැනීම පහව යන්නේය.\"\n\n\"යම් හෙයකින් ධර්මය සිහි නොකරන්නේ නම්, එවිට සංඝයා සිහි කරව්. 'භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකසංඝයා මැනවින් පිළිපන්නාහුය, ඍජුව පිළිපන්නාහුය, න්‍යාය ධර්මයේ පිහිටා පිළිපන්නාහුය, සාමීචි ප්‍රතිපදාවෙන් (හොඳින්) පිළිපන්නාහුය. එනම් සතර පුරුෂ යුගලය හෙවත් අට මහා පුරුෂ පුද්ගලයා භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවකසංඝයා වන්නේය. ආහුණෙය්‍ය (දූරයෙන් ගෙනවිත් දෙන දාන ලැබීමට සුදුසු), පාහුණෙය්‍ය (ආගන්තුක සත්කාර ලැබීමට සුදුසු), දක්ඛිණෙය්‍ය (පරලොව යහපත අපේක්ෂාවෙන් දෙන දාන ලැබීමට සුදුසු), අඤ්ජලිකරණීය (දෙඅත් එක්කොට වන්දනාමාන ලැබීමට සුදුසු), ලෝකයාට අනුත්තර වූ පින් කෙතක් වන්නේය' යනුවෙන් සිහි කරව්. සංඝයා සිහි කරන ඔබට ඇති වන බිය හෝ තැතිගැනීම හෝ ලොමුදැහැගැනීම පහව යන්නේය.\"\n\n\"එයට හේතුව කුමක්ද? මහණෙනි, තථාගත අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ රාගය දුරු කළ, ද්වේෂය දුරු කළ, මෝහය දුරු කළ, බිය නැති, තැතිගැනීමක් නැති, තිගැස්මක් නැති, පලා නොයන ස්වභාව ඇත්තෙක් වන බැවිනි.\" භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ශාස්තෘන් වහන්සේ මෙය වදාරා තවදුරටත් මෙසේ වදාළ සේක:\n\n\"මහණෙනි, වන අරණක හෝ, රුක් මුලක හෝ, ශූන්‍යාගාරයක හෝ සිටින කල්හි, සම්බුදුරජාණන් වහන්සේ සිහි කරව්, එවිට ඔබට බියක් ඇති නොවන්නේය.\n\n\"යම් හෙයකින් ලෝකයට ජ්‍යේෂ්ඨ වූ, නර ශ්‍රේෂ්ඨ වූ බුදුරජාණන් වහන්සේ සිහි නොකරන්නේ නම්, එවිට නිවනට පමුණුවන, මැනවින් දේශනා කරන ලද ධර්මය සිහි කරව්.\n\n\"යම් හෙයකින් නිවනට පමුණුවන, මැනවින් දේශනා කරන ලද ධර්මය සිහි නොකරන්නේ නම්, එවිට අනුත්තර වූ පින් කෙතක් බඳු වූ සංඝයා සිහි කරව්.\n\n\"මහණෙනි, මෙලෙස බුදුරජාණන් වහන්සේත්, ධර්මයත්, සංඝයාත් සිහි කරන ඔබට, බියක් හෝ තැතිගැනීමක් හෝ ලොමුදැහැගැනීමක් ඇති නොවන්නේය.\"",
      "paliTitle": "Dhajaggasuttaṃ",
      "englishTitle": "The Banner-top Sutta",
      "sinhalaTitle": "ධජග්ග සූත්‍රය"
    },
    {
      "number": 250,
      "pali": "Sāvatthinidānaṃ. ‘‘Bhūtapubbaṃ, bhikkhave, devāsurasaṅgāmo samupabyūḷho ahosi. Atha kho, bhikkhave, vepacitti asurindo asure āmantesi – ‘sace, mārisā, devānaṃ asurasaṅgāme samupabyūḷhe asurā jineyyuṃ devā parājineyyuṃ [parājeyyuṃ (sī. pī.)], yena naṃ sakkaṃ devānamindaṃ kaṇṭhapañcamehi bandhanehi bandhitvā mama santike āneyyātha asurapura’nti. Sakkopi kho, bhikkhave, devānamindo deve tāvatiṃse āmantesi – ‘sace, mārisā, devānaṃ asurasaṅgāme samupabyūḷhe devā jineyyuṃ asurā parājineyyuṃ, yena naṃ vepacittiṃ asurindaṃ kaṇṭhapañcamehi bandhanehi bandhitvā mama santike āneyyātha sudhammasabha’’’nti. Tasmiṃ kho pana, bhikkhave, saṅgāme devā jiniṃsu, asurā parājiniṃsu [parājiṃsu (sī. pī.)]. Atha kho, bhikkhave, devā tāvatiṃsā vepacittiṃ asurindaṃ kaṇṭhapañcamehi bandhanehi bandhitvā sakkassa devānamindassa santike ānesuṃ sudhammasabhaṃ. Tatra sudaṃ, bhikkhave, vepacitti asurindo kaṇṭhapañcamehi bandhanehi baddho sakkaṃ devānamindaṃ sudhammasabhaṃ pavisantañca nikkhamantañca asabbhāhi pharusāhi vācāhi akkosati paribhāsati. Atha kho, bhikkhave, mātali saṅgāhako sakkaṃ devānamindaṃ gāthāhi ajjhabhāsi – ‘‘Bhayā nu maghavā sakka, dubbalyā no titikkhasi; Suṇanto pharusaṃ vācaṃ, sammukhā vepacittino’’ti. ‘‘Nāhaṃ bhayā na dubbalyā, khamāmi vepacittino; Kathañhi mādiso viññū, bālena paṭisaṃyuje’’ti. ‘‘Bhiyyo bālā pabhijjeyyuṃ, no cassa paṭisedhako; Tasmā bhusena daṇḍena, dhīro bālaṃ nisedhaye’’ti. ‘‘Etadeva ahaṃ maññe, bālassa paṭisedhanaṃ; Paraṃ saṅkupitaṃ ñatvā, yo sato upasammatī’’ti. ‘‘Etadeva titikkhāya, vajjaṃ passāmi vāsava; Yadā naṃ maññati bālo, bhayā myāyaṃ titikkhati; Ajjhāruhati dummedho, gova bhiyyo palāyina’’nti. ‘‘Kāmaṃ maññatu vā mā vā, bhayā myāyaṃ titikkhati; Sadatthaparamā atthā, khantyā bhiyyo na vijjati. ‘‘Yo have balavā santo, dubbalassa titikkhati; Tamāhu paramaṃ khantiṃ, niccaṃ khamati dubbalo. ‘‘Abalaṃ taṃ balaṃ āhu, yassa bālabalaṃ balaṃ; Balassa dhammaguttassa, paṭivattā na vijjati. ‘‘Tasseva tena pāpiyo, yo kuddhaṃ paṭikujjhati; Kuddhaṃ appaṭikujjhanto, saṅgāmaṃ jeti dujjayaṃ. ‘‘Ubhinnamatthaṃ carati, attano ca parassa ca; Paraṃ saṅkupitaṃ ñatvā, yo sato upasammati. ‘‘Ubhinnaṃ tikicchantānaṃ, attano ca parassa ca; Janā maññanti bāloti, ye dhammassa akovidā’’ti. ‘‘So hi nāma, bhikkhave, sakko devānamindo sakaṃ puññaphalaṃ upajīvamāno devānaṃ tāvatiṃsānaṃ issariyādhipaccaṃ rajjaṃ kārento khantisoraccassa vaṇṇavādī bhavissati. Idha kho taṃ, bhikkhave, sobhetha yaṃ tumhe evaṃ svākkhāte dhammavinaye pabbajitā samānā khamā ca bhaveyyātha soratā cā’’ti.",
      "english": "Thus have I heard. Once upon a time, monks, a battle between gods and asuras was arrayed. Then, monks, Vepacitti, the lord of asuras, addressed the asuras, saying: ‘Friends, if in the battle arrayed between gods and asuras, the asuras should win and the gods should be defeated, then you should bind Sakka, the king of the gods, with five-fold neck fetters and bring him to me in the asura city.’ Sakka, the king of the gods, also, monks, addressed the Tāvatiṃsa gods, saying: ‘Friends, if in the battle arrayed between gods and asuras, the gods should win and the asuras should be defeated, then you should bind Vepacitti, the lord of asuras, with five-fold neck fetters and bring him to me in the Sudhammā Hall.’ Then, monks, in that battle, the gods won, and the asuras were defeated. Then, monks, the Tāvatiṃsa gods bound Vepacitti, the lord of asuras, with five-fold neck fetters and brought him to Sakka, the king of the gods, in the Sudhammā Hall. There, indeed, monks, Vepacitti, the lord of asuras, bound with five-fold neck fetters, reviled and insulted Sakka, the king of the gods, with unseemly and harsh words, both when he entered the Sudhammā Hall and when he departed.\n\nThen, monks, Mātali the charioteer addressed Sakka, the king of the gods, with verses: ‘Is it from fear, Maghavā Sakka, or from weakness, that you endure, hearing harsh words directly from Vepacitti?’\n\n‘I do not endure Vepacitti from fear nor from weakness; how could one as discerning as I associate with a fool?’\n\n‘Fools would only become more emboldened if there were no restraint; therefore, a wise person should restrain a fool with a strong hand.’\n\n‘This is what I consider to be the restraint of a fool: one who, knowing another to be greatly enraged, remains mindfully calm.’\n\n‘This very thing, Vāsava, I see as a fault in forbearance: when the fool thinks, “He endures me out of fear,” the ignorant one then escalates, like a cow pursuing a fleeing animal.’\n\n‘Let him think, or not think, “He endures me out of fear”; the highest good is one’s own welfare, and nothing surpasses patient endurance.’\n\n‘Indeed, whoever, being powerful, endures a weak person; that, they say, is the highest patience, for a weak person always endures.’\n\n‘They call that strength no strength, which is the strength of a fool; for one whose strength is protected by Dhamma, there is no adversary.’\n\n‘He who retaliates to one who is angry makes himself worse by that; not retaliating to one who is angry conquers a battle hard to conquer.’\n\n‘He acts for the welfare of both, himself and the other; one who, knowing another to be greatly enraged, remains mindfully calm.’\n\n‘Those who are not skilled in the Dhamma consider him a fool who seeks to heal both himself and the other.’\n\nSo it is, monks, that Sakka, the king of the gods, living off the fruit of his own merit, ruling over the sovereignty and dominion of the Tāvatiṃsa gods, is an advocate of patience and gentleness. It would indeed be fitting, monks, for you, having gone forth into such a well-expounded Dhamma and Vinaya, to be patient and gentle.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලදී.\n\nමහණෙනි, පෙර දවස දෙවියන් හා අසුරයන් අතර සටනක් ඇතිවිය. මහණෙනි, එසඳ වේපචිත්ති අසුරේන්ද්‍රයා අසුරයන් ඇමතුවේය: ‘මිත්‍රවරුනි, යම් හෙයකින් දෙවියන් හා අසුරයන් අතර ඇති වූ මේ සටනේදී අසුරයෝ ජය ගනිත් නම්, දෙවියෝ පරාජය වෙත් නම්, ඔබලා ශක්‍ර දේවේන්ද්‍රයා බෙල්ල පස්වෙනි කොට ඇති බන්ධනවලින් බැඳ, මා වෙත අසුර පුරයට ගෙන එනු’ යැයි කීය. මහණෙනි, ශක්‍ර දේවේන්ද්‍රයාද තව්තිසා දෙවියන් ඇමතුවේය: ‘මිත්‍රවරුනි, යම් හෙයකින් දෙවියන් හා අසුරයන් අතර ඇති වූ මේ සටනේදී දෙවියෝ ජය ගනිත් නම්, අසුරයෝ පරාජය වෙත් නම්, ඔබලා වේපචිත්ති අසුරේන්ද්‍රයා බෙල්ල පස්වෙනි කොට ඇති බන්ධනවලින් බැඳ, මා වෙත සුධම්මා සභාවට ගෙන එනු’ යැයි කීය. මහණෙනි, ඒ සටනේදී දෙවියෝ ජය ගත්හ, අසුරයෝ පරාජය වූහ. මහණෙනි, එසඳ තව්තිසා දෙවියෝ වේපචිත්ති අසුරේන්ද්‍රයා බෙල්ල පස්වෙනි කොට ඇති බන්ධනවලින් බැඳ, ශක්‍ර දේවේන්ද්‍රයා වෙත සුධම්මා සභාවට ගෙන ආහ. මහණෙනි, එහිදී වේපචිත්ති අසුරේන්ද්‍රයා බෙල්ල පස්වෙනි කොට ඇති බන්ධනවලින් බැඳ සිටියදී, සුධම්මා සභාවට පිවිසෙන සහ එයින් පිටවන ශක්‍ර දේවේන්ද්‍රයාට අසභ්‍ය වූ, පරුෂ වූ වචනවලින් බැණ වදින්නේය, පරිභව කරන්නේය.\n\nමහණෙනි, එසඳ මාතලී නම් සංග්‍රාහකයා ශක්‍ර දේවේන්ද්‍රයාට ගාථාවලින් මෙසේ කීවේය: ‘මඝවන් ශක්‍රය, ඔබ බිය නිසාද, දුබලකම නිසාද, වේපචිත්ති අසුරයාගේ මුහුණටම පරුෂ වචන අසමින් ඉවසන්නේ?’\n\n‘මම බිය නිසා හෝ දුබලකම නිසා හෝ වේපචිත්ති අසුරයාට නොඉවසමි. මා වැනි විචක්ෂණ පුද්ගලයෙක් බාලයකු සමඟ කෙසේ නම් ගැටෙන්නේද?’\n\n‘යම් හෙයකින් යමෙක් බාලයාට (නොඉවසා) පිළිතුරු නොදෙන්නේ නම්, බාලයෝ තව තවත් විනාශ වී යති. එබැවින් ධීර පුද්ගලයා තද දඬුවමකින් බාලයා සංවර කළ යුතුය.’\n\n‘අනුන් කෝපයට පත්ව සිටින බව දැන, සිහියෙන් යුතුව තමා සන්සුන් වීමම බාලයා සංවර කරවීමක් යැයි මම සිතමි.’\n\n‘වසු, මෙහිදී ඉවසීමට දොසක් මම දකිමි. යම් කලක බාලයා ‘මේ මා හට බිය වී ඉවසන්නේය’ යැයි සිතන්නේද, එවිට ඒ දුර්මති පුද්ගලයා, පලා යන ගවයා තව තවත් පස්සෙන් එලවා යන ගොපල්ලා මෙන්, (ඉවසන්නා කෙරෙහි) තව තවත් අක්‍රමණශීලී වෙයි.’\n\n‘ඔහු ‘මේ මා හට බිය වී ඉවසයි’ යැයි සිතුවත්, නොසිතුවත් කම් නැත. අර්ථාන්තර අතර උතුම් වූ අර්ථය ස්වකීය අර්ථයෙහි පවතී. ඉවසීමට වඩා උසස් දෙයක් නැත්තේය.’\n\n‘ඇත්ත වශයෙන්ම, බලවත් වූ තැනැත්තා දුබලයාට ඉවසන්නේ නම්, එයම පරම ක්ෂන්තිය (උතුම් ඉවසීම) යැයි කියනු ලැබේ. දුබල තැනැත්තා නම් හැම විටම ඉවසන්නේය.’\n\n‘බාලයාගේ බලය තම බලය කොට ඇත්තාගේ බලය දුබල බලයක් යැයි කියනු ලැබේ. ධර්මයෙන් ආරක්ෂා වූ බලවත් පුද්ගලයාට ප්‍රතිවිරුද්ධ වන්නෙක් නැත්තේය.’\n\n‘කෝප වූ තැනැත්තාට නැවත කෝපයෙන් පිළිතුරු දෙන්නා ඊටත් වඩා පවිටු වන්නේය. කෝප වූ තැනැත්තාට නැවත කෝපයෙන් නොපිළිතුරු දෙන්නා නම්, දිනීමට අපහසු වූ සටනක් ජය ගන්නේය.’\n\n‘අනුන් කෝපයට පත්ව සිටින බව දැන, සිහියෙන් යුතුව තමා සන්සුන් වන්නා තමාටත්, අනුන්ටත් යන දෙදෙනාගේම යහපත සාදන්නේය.’\n\n‘තමාටත්, අනුන්ටත් යන දෙදෙනාටම යහපත සලස්වන්නාව ධර්මය නොදත් ජනයා බාලයෙකු යැයි සිතති.’\n\nමහණෙනි, මෙසේ නම් ශක්‍ර දේවේන්ද්‍රයා තමාගේ පින්ඵල උපයෝගී කරගෙන, තව්තිසා දෙවියන්ට අධිපති රාජ්‍යය පාලනය කරමින්, ඉවසීම සහ සන්සුන්කම වර්ණනා කරන්නෙක් වන්නේය. මහණෙනි, එසේ හෙයින්, යම් හෙයකින් ඔබලා මෙසේ මනාව දේශනා කරන ලද ධර්ම විනයෙහි පැවිදි වූවන් වශයෙන් ඉවසිලිවන්ත හා සන්සුන් වූවන් වන්නේ නම්, එය ඔබට සුදුසු වන්නේය.",
      "paliTitle": "Vepacittisuttaṃ",
      "englishTitle": "The Discourse on Vepacitti",
      "sinhalaTitle": "වේපචිත්ති සූත්‍රය"
    },
    {
      "number": 251,
      "pali": "Sāvatthinidānaṃ. ‘‘Bhūtapubbaṃ, bhikkhave, devāsurasaṅgāmo samupabyūḷho ahosi. Atha kho, bhikkhave, vepacitti asurindo sakkaṃ devānamindaṃ etadavoca – ‘hotu, devānaminda, subhāsitena jayo’ti. ‘Hotu, vepacitti, subhāsitena jayo’ti. Atha kho, bhikkhave, devā ca asurā ca pārisajje ṭhapesuṃ – ‘ime no subhāsitadubbhāsitaṃ ājānissantī’ti. Atha kho, bhikkhave, vepacittiṃ asurindo sakkaṃ devānamindaṃ etadavoca – ‘bhaṇa, devānaminda, gātha’nti. Evaṃ vutte, bhikkhave, sakko devānamindo vepacitti asurindaṃ etadavoca – ‘tumhe khvettha, vepacitti, pubbadevā. Bhaṇa, vepacitti, gātha’nti. Evaṃ vutte, bhikkhave, vepacitti asurindo imaṃ gāthaṃ abhāsi – ‘‘Bhiyyo bālā pabhijjeyyuṃ, no cassa paṭisedhako; Tasmā bhusena daṇḍena, dhīro bālaṃ nisedhaye’’ti. ‘‘Bhāsitāya kho pana, bhikkhave, vepacittinā asurindena gāthāya asurā anumodiṃsu, devā tuṇhī ahesuṃ. Atha kho, bhikkhave, vepacitti asurindo sakkaṃ devānamindaṃ etadavoca – ‘bhaṇa, devānaminda, gātha’nti. Evaṃ vutte, bhikkhave, sakko devānamindo imaṃ gāthaṃ abhāsi – ‘‘Etadeva ahaṃ maññe, bālassa paṭisedhanaṃ; Paraṃ saṅkupitaṃ ñatvā, yo sato upasammatī’’ti. ‘‘Bhāsitāya kho pana, bhikkhave, sakkena devānamindena gāthāya, devā anumodiṃsu, asurā tuṇhī ahesuṃ. Atha kho, bhikkhave, sakko devānamindo vepacittiṃ asurindaṃ etadavoca – ‘bhaṇa, vepacitti, gātha’nti. Evaṃ vutte, bhikkhave, vepacitti asurindo imaṃ gāthaṃ abhāsi – ‘‘Etadeva titikkhāya, vajjaṃ passāmi vāsava; Yadā naṃ maññati bālo, bhayā myāyaṃ titikkhati; Ajjhāruhati dummedho, gova bhiyyo palāyina’’nti. ‘‘Bhāsitāya kho pana, bhikkhave, vepacittinā asurindena gāthāya asurā anumodiṃsu, devā tuṇhī ahesuṃ. Atha kho, bhikkhave, vepacitti asurindo sakkaṃ devānamindaṃ etadavoca – ‘bhaṇa, devānaminda, gātha’nti. Evaṃ vutte, bhikkhave, sakko devānamindo imā gāthāyo abhāsi – ‘‘Kāmaṃ maññatu vā mā vā, bhayā myāyaṃ titikkhati; Sadatthaparamā atthā, khantyā bhiyyo na vijjati. ‘‘Yo have balavā santo, dubbalassa titikkhati; Tamāhu paramaṃ khantiṃ, niccaṃ khamati dubbalo. ‘‘Abalaṃ taṃ balaṃ āhu, yassa bālabalaṃ balaṃ; Balassa dhammaguttassa, paṭivattā na vijjati. ‘‘Tasseva tena pāpiyo, yo kuddhaṃ paṭikujjhati; Kuddhaṃ appaṭikujjhanto, saṅgāmaṃ jeti dujjayaṃ. ‘‘Ubhinnamatthaṃ carati, attano ca parassa ca; Paraṃ saṅkupitaṃ ñatvā, yo sato upasammati. ‘‘Ubhinnaṃ tikicchantānaṃ, attano ca parassa ca; Janā maññanti bāloti, ye dhammassa akovidā’’ti. ‘‘Bhāsitāsu kho pana, bhikkhave, sakkena devānamindena gāthāsu, devā anumodiṃsu, asurā tuṇhī ahesuṃ. Atha kho, bhikkhave, devānañca asurānañca pārisajjā etadavocuṃ – ‘bhāsitā kho vepacittinā asurindena gāthāyo. Tā ca kho sadaṇḍāvacarā sasatthāvacarā, iti bhaṇḍanaṃ iti viggaho iti kalaho. Bhāsitā kho [bhāsitā kho pana (sī.)] sakkena devānamindena gāthāyo. Tā ca kho adaṇḍāvacarā asatthāvacarā, iti abhaṇḍanaṃ iti aviggaho iti akalaho. Sakkassa devānamindassa subhāsitena jayo’ti. Iti kho, bhikkhave sakkassa devānamindassa subhāsitena jayo ahosī’’ti.",
      "english": "At Sāvatthī.\n\nFormerly, bhikkhus, a battle between devas and asuras had been arranged. Then, bhikkhus, Vepacitti, the lord of asuras, said to Sakka, the lord of devas: ‘Let there be victory, lord of devas, through well-spoken words!’ Sakka replied: ‘Let there be victory, Vepacitti, through well-spoken words!’ Then, bhikkhus, the devas and asuras appointed an assembly of arbiters, thinking: ‘These will discern for us what is well-spoken and what is ill-spoken.’ Then, bhikkhus, Vepacitti, the lord of asuras, said to Sakka, the lord of devas: ‘Speak a verse, lord of devas!’ When this was said, bhikkhus, Sakka, the lord of devas, said to Vepacitti, the lord of asuras: ‘Indeed, Vepacitti, you were formerly devas. Speak a verse, Vepacitti!’ When this was said, bhikkhus, Vepacitti, the lord of asuras, spoke this verse:\n‘Fools would certainly proliferate if there were no restrainer; therefore, with a strong stick, the wise person should restrain the fool.’\nIndeed, bhikkhus, when Vepacitti, the lord of asuras, had spoken the verse, the asuras rejoiced, but the devas remained silent. Then, bhikkhus, Vepacitti, the lord of asuras, said to Sakka, the lord of devas: ‘Speak a verse, lord of devas!’ When this was said, bhikkhus, Sakka, the lord of devas, spoke this verse:\n‘This alone I consider the restraint of a fool: when one, being mindful, calms down after knowing that another is enraged.’\nIndeed, bhikkhus, when Sakka, the lord of devas, had spoken the verse, the devas rejoiced, but the asuras remained silent. Then, bhikkhus, Sakka, the lord of devas, said to Vepacitti, the lord of asuras: ‘Speak a verse, Vepacitti!’ When this was said, bhikkhus, Vepacitti, the lord of asuras, spoke this verse:\n‘This alone, Vasava, I see as a fault in patience: when the fool thinks, “This one endures out of fear for me.” The senseless one then rides high, like a cow pursuing a fleeing one, even more.’\nIndeed, bhikkhus, when Vepacitti, the lord of asuras, had spoken the verse, the asuras rejoiced, but the devas remained silent. Then, bhikkhus, Vepacitti, the lord of asuras, said to Sakka, the lord of devas: ‘Speak a verse, lord of devas!’ When this was said, bhikkhus, Sakka, the lord of devas, spoke these verses:\n\n‘Let him think as he wishes, or not think, “This one endures out of fear for me.” The highest good is one’s own welfare; nothing excels patience.\nWhoever, being powerful, endures with the weak; that they call supreme patience. The weak one always endures.\nThey call that strength no strength, whose strength is the strength of a fool. For one whose strength is guarded by Dhamma, there is no adversary.\nIndeed, he is worse off by that, who retaliates in anger against an angry one. Not retaliating in anger against an angry one, one conquers a battle hard to conquer.\nHe acts for the welfare of both, of himself and of the other, who, knowing another is enraged, becomes mindful and calms down.\nPeople who are unskilled in the Dhamma consider him a fool, one who treats the wounds of both himself and the other.’\n\nIndeed, bhikkhus, when Sakka, the lord of devas, had spoken these verses, the devas rejoiced, but the asuras remained silent. Then, bhikkhus, the arbiters of the devas and asuras said: ‘Indeed, the verses spoken by Vepacitti, the lord of asuras, involve clubs and involve weapons; they lead to quarrels, disputes, and strife. But the verses spoken by Sakka, the lord of devas, do not involve clubs and do not involve weapons; they lead to no quarrels, no disputes, and no strife. Victory belongs to Sakka, the lord of devas, by his well-spoken words!’ Thus, bhikkhus, victory belonged to Sakka, the lord of devas, by his well-spoken words.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nමහණෙනි, පෙර කාලයක දෙවිවරුන්ගේ හා අසුරයන්ගේ යුද්ධයක් ඇති විය. මහණෙනි, එකල්හි වේපචිත්ති නම් අසුරේන්ද්‍රයා ශක්‍ර දෙවියන්ට අධිපති දෙවියාට මෙසේ කීවේය: \"දෙවියන්ට අධිපතිනි, යහපත් වචනයෙන් ජය වේවා!\" \"වේපචිත්ති, යහපත් වචනයෙන් ජය වේවා!\" මහණෙනි, එකල්හි දෙවිවරු ද අසුරයෝ ද \"මොවුන් අපගේ සුභාෂිතය සහ දුර්භාෂිතය දැනගන්නා ඇත\" යි සභිකයන් පත් කළහ. මහණෙනි, එකල්හි වේපචිත්ති අසුරේන්ද්‍රයා ශක්‍ර දෙවියන්ට අධිපති දෙවියාට \"දෙවියන්ට අධිපතිනි, ගාථාවක් කියන්න\" යි කීවේය. මහණෙනි, මෙසේ කී කල්හි, ශක්‍ර දෙවියන්ට අධිපති දෙවියා වේපචිත්ති අසුරේන්ද්‍රයාට \"වේපචිත්ති, නුඹලා නම් පෙර දෙවිවරුය. වේපචිත්ති, ගාථාවක් කියන්න\" යි කීවේය. මහණෙනි, මෙසේ කී කල්හි, වේපචිත්ති අසුරේන්ද්‍රයා මේ ගාථාව කීවේය: \"යම් හෙයකින් මුලාවට පත් වූවන් තව තවත් භේද වේ නම්, ඔවුන් වළක්වන්නෙක් ද නැත්නම්; එහෙයින් ප්‍රඥාවන්තයා තද දඬුවමකින් මුලාවට පත් වූවන් වළක්වාලිය යුතුය.\"\n\nමහණෙනි, වේපචිත්ති අසුරේන්ද්‍රයා විසින් කියන ලද ඒ ගාථාවට අසුරයෝ අනුමෝදන් වූහ. දෙවිවරු නිහඬ වූහ. මහණෙනි, එකල්හි වේපචිත්ති අසුරේන්ද්‍රයා ශක්‍ර දෙවියන්ට අධිපති දෙවියාට \"දෙවියන්ට අධිපතිනි, ගාථාවක් කියන්න\" යි කීවේය. මහණෙනි, මෙසේ කී කල්හි, ශක්‍ර දෙවියන්ට අධිපති දෙවියා මේ ගාථාව කීවේය: \"වෙනත් අය කිපී සිටින බව දැන, සිහියෙන් යුතුව තමා සංසිඳී සිටීම මෝඩයන් (කිපුණු අය) සංසිඳුවීම යැයි මම සිතමි.\"\n\nමහණෙනි, ශක්‍ර දෙවියන්ට අධිපති දෙවියා විසින් කියන ලද ඒ ගාථාවට දෙවිවරු අනුමෝදන් වූහ. අසුරයෝ නිහඬ වූහ. මහණෙනි, එකල්හි ශක්‍ර දෙවියන්ට අධිපති දෙවියා වේපචිත්ති අසුරේන්ද්‍රයාට \"වේපචිත්ති, ගාථාවක් කියන්න\" යි කීවේය. මහණෙනි, මෙසේ කී කල්හි, වේපචිත්ති අසුරේන්ද්‍රයා මේ ගාථාව කීවේය: \"වාසව, ඉවසීමේ මේ දොස මම දකිමි: යම් කලක මෝඩයා මොහු භයින් ඉවසන්නේ යැයි සිතා, පලා යන ගවයා පිටට නැඟී අදිනවාක් මෙන්, දුර්මති තැනැත්තා තව තවත් අදින්නේය (පීඩා කරන්නේය).\"\n\nමහණෙනි, වේපචිත්ති අසුරේන්ද්‍රයා විසින් කියන ලද ඒ ගාථාවට අසුරයෝ අනුමෝදන් වූහ. දෙවිවරු නිහඬ වූහ. මහණෙනි, එකල්හි වේපචිත්ති අසුරේන්ද්‍රයා ශක්‍ර දෙවියන්ට අධිපති දෙවියාට \"දෙවියන්ට අධිපතිනි, ගාථාවක් කියන්න\" යි කීවේය. මහණෙනි, මෙසේ කී කල්හි, ශක්‍ර දෙවියන්ට අධිපති දෙවියා මේ ගාථා කීවේය: \"ඔහු භයින් ඉවසන්නේ යැයි සිතුවත් නොසිතුවත්, තම ආත්ම හිතකාමී අර්ථයන්ගෙන්, ඉවසීමට වඩා උතුම් දෙයක් නැත්තේය.\" \"යමෙක් ඇත්තෙන්ම බලවත් වී දුබලයාට ඉවසන්නේ නම්, එය උතුම්ම ඉවසීම යැයි කියනු ලැබේ. දුබලයා නිරතුරුවම ඉවසන්නේය.\" \"මෝඩයාගේ බලය තම බලය කරගත් තැනැත්තාගේ බලය, බලයක් නොවේ යැයි කියනු ලැබේ. ධර්මයෙන් ආරක්ෂා වූ බලවතාට විරුද්ධවන්නෙක් නැත්තේය.\" \"කෝප වූවෙකුට නැවත කෝප කරන්නා, ඒ කෝපයෙන් තව තවත් පව් කරන්නේය. කෝප වූවෙකුට නැවත කෝප නොකරන්නා, ජය ගැනීමට දුෂ්කර වූ සටන ජය ගන්නේය.\" \"වෙනත් අය කිපී සිටින බව දැන, සිහියෙන් යුතුව තමා සංසිඳී සිටින තැනැත්තා, තමාටත් අන් අයටත් යන දෙපිරිසටම වැඩ කරන්නේය.\" \"තමාටත් අන් අයටත් යන දෙපිරිසටම ප්‍රතිකර්ම කරන්නා (හිත සුව සලසන්නා) ධර්මයේ දක්ෂ නොවන ජනයා විසින් මෝඩයෙකු ලෙස සලකනු ලැබේ.\"\n\nමහණෙනි, ශක්‍ර දෙවියන්ට අධිපති දෙවියා විසින් කියන ලද ඒ ගාථාවලට දෙවිවරු අනුමෝදන් වූහ. අසුරයෝ නිහඬ වූහ. මහණෙනි, එකල්හි දෙවිවරුන්ගේ ද අසුරයන්ගේ ද සභිකයෝ මෙසේ කීහ: \"වේපචිත්ති අසුරේන්ද්‍රයා විසින් ගාථා කියන ලදී. ඒවා දඬුවම් සහිත, ශස්ත්‍ර (ආයුධ) සහිත, එනම්, ආරවුල්, විවාද, කලහ ඇති කරන්නකි. ශක්‍ර දෙවියන්ට අධිපති දෙවියා විසින් ගාථා කියන ලදී. ඒවා දඬුවම් රහිත, ශස්ත්‍ර රහිත, එනම්, ආරවුල් නැති, විවාද නැති, කලහ නැති කරන්නකි. ශක්‍ර දෙවියන්ට අධිපති දෙවියාගේ සුභාෂිතයෙන් ජය වේවා!\" මහණෙනි, මෙසේ ශක්‍ර දෙවියන්ට අධිපති දෙවියාගේ සුභාෂිතයෙන් ජය ලැබිණි.",
      "paliTitle": "Subhāsitajayasuttaṃ",
      "englishTitle": "The Discourse on Victory through Well-spoken Words",
      "sinhalaTitle": "සුභාසිතජය සූත්‍රය"
    },
    {
      "number": 252,
      "pali": "Sāvatthiyaṃ. ‘‘Bhūtapubbaṃ, bhikkhave, devāsurasaṅgāmo samupabyūḷho ahosi. Tasmiṃ kho pana, bhikkhave, saṅgāme asurā jiniṃsu, devā parājiniṃsu. Parājitā ca kho, bhikkhave, devā apāyaṃsveva uttarenamukhā, abhiyaṃsveva ne asurā. Atha kho, bhikkhave, sakko devānamindo mātali saṅgāhakaṃ gāthāya ajjhabhāsi – ‘‘Kulāvakā mātali simbalismiṃ, Īsāmukhena parivajjayassu; Kāmaṃ cajāma asuresu pāṇaṃ, Māyime dijā vikulāvakā [vikulāvā (syā. kaṃ. ka.)] ahesu’’nti. ‘‘‘Evaṃ bhaddantavā’ti kho, bhikkhave, mātali saṅgāhako sakkassa devānamindassa paṭissutvā sahassayuttaṃ ājaññarathaṃ paccudāvattesi. Atha kho, bhikkhave, asurānaṃ etadahosi – ‘paccudāvatto kho dāni sakkassa devānamindassa sahassayutto ājaññaratho. Dutiyampi kho devā asurehi saṅgāmessantīti bhītā asurapurameva pāvisiṃsu. Iti kho, bhikkhave, sakkassa devānamindassa dhammena jayo ahosī’’’ti.",
      "english": "In Sāvatthī. Formerly, monks, a battle between devas and asuras had arisen. And in that battle, monks, the asuras were victorious, and the devas were defeated. Defeated, monks, the devas retreated northward, with the asuras pursuing them. Then, monks, Sakka, the lord of the devas, addressed Mātali, the charioteer, with a verse: “Mātali, avoid the cotton trees where the birds have their nests, lest these birds become homeless. Let us rather give up our lives to the asuras.”\n\n“So be it, venerable one,” monks, Mātali the charioteer replied to Sakka, the lord of the devas, and turned the thousand-yoked royal chariot back around. Then, monks, the asuras thought: “Now Sakka, the lord of the devas, has turned his thousand-yoked royal chariot back around. The devas will surely fight the asuras a second time.” Frightened, they retreated into the city of the asuras. Thus, monks, Sakka, the lord of the devas, achieved victory righteously.",
      "sinhala": "සැවැත්නුවරදී. \"මහණෙනි, පෙර දවස දෙවියන් හා අසුරයන් අතර යුද්ධයක් ඇති විය. මහණෙනි, ඒ යුද්ධයේදී අසුරයෝ දිනූහ, දෙවියෝ පැරදුණහ. මහණෙනි, පරාජයට පත් වූ දෙවියෝ උතුරු දිශාවට පසුබැස ගියහ; අසුරයෝ ඔවුන් ලුහුබැඳ ගියහ. මහණෙනි, එවිට දෙවියන්ට අධිපති සක් දෙවිඳු මාතලී නම් සාරථියාට ගාථාවකින් මෙසේ පැවසුවේය: “මාතලී, එම ගල් බඹුරු ගසේ කුරුලු කූඩු ඇත. අක් ගස මුදුනෙන් (රියෙහි ඊසාදණ්ඩෙන්) එය වළක්වා ගනුව. අප කැමති නම් අසුරයන්ට අපේ ප්‍රාණය අත්හරිමු. එහෙත් මේ කුරුල්ලෝ නිවාස රහිත නොවෙත්වා!” \"මහණෙනි, ‘එසේය, ස්වාමීනි’ යැයි මාතලී සාරථි තෙමේ දෙවියන්ට අධිපති සක් දෙවිඳුට පිළිතුරු දී, දහසක් අසුන් යෙදූ උතුම් රථය හරවා ආපසු හැරවීය. මහණෙනි, එවිට අසුරයන්ට මෙසේ සිතුණි: ‘දැන් දෙවියන්ට අධිපති සක් දෙවිඳුගේ දහසක් අසුන් යෙදූ උතුම් රථය ආපසු හැරී ඇත. දෙවියෝ දෙවැනි වරටත් අසුරයන් සමඟ යුද්ධ කරනු ඇතැ’යි. බියට පත් වූ අසුරයෝ අසුර පුරයටම පිවිසියහ. මහණෙනි, මෙසේ දෙවියන්ට අධිපති සක් දෙවිඳුට ධර්මයෙන් ජය ලැබුණි.\"",
      "paliTitle": "Kulāvakasuttaṃ",
      "englishTitle": "The Nest-ling Sutta",
      "sinhalaTitle": "කුලාවක සූත්‍රය"
    },
    {
      "number": 253,
      "pali": "Sāvatthiyaṃ. ‘‘Bhūtapubbaṃ, bhikkhave, sakkassa devānamindassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘yopi me assa supaccatthiko tassapāhaṃ na dubbheyya’nti. Atha kho, bhikkhave, vepacitti asurindo sakkassa devānamindassa cetasā cetoparivitakkamaññāya yena sakko devānamindo tenupasaṅkami. Addasā kho, bhikkhave, sakko devānamindo vepacittiṃ asurindaṃ dūratova āgacchantaṃ. Disvāna vepacittiṃ asurindaṃ etadavoca – ‘tiṭṭha, vepacitti, gahitosī’’’ti. ‘‘Yadeva te, mārisa, pubbe cittaṃ, tadeva tvaṃ mā pajahāsī’’ti [tadeva tvaṃ mārisa pahāsīti (sī. syā. kaṃ.)]. ‘‘Sapassu ca me, vepacitti, adubbhāyā’’ti [adrubbhāya (ka.)]. ‘‘Yaṃ musā bhaṇato pāpaṃ, yaṃ pāpaṃ ariyūpavādino; Mittadduno ca yaṃ pāpaṃ, yaṃ pāpaṃ akataññuno; Tameva pāpaṃ phusatu [phusati (sī. pī.)], yo te dubbhe sujampatī’’ti.",
      "english": "In Sāvatthī.\nMonks, in the past, when Sakka, the ruler of devas, was in seclusion, having retreated, such a thought arose in his mind: 'Even if someone were my supreme enemy, I would not harbor ill-will towards him.' Then, monks, Vepacitti, the asura king, having known with his own mind the thought in Sakka, the ruler of devas', mind, approached Sakka, the ruler of devas. Monks, Sakka, the ruler of devas, saw Vepacitti, the asura king, approaching from afar. Having seen Vepacitti, the asura king, he said this: 'Stop, Vepacitti, you are caught!'\n\n[Vepacitti replied:] 'Venerable sir, do not abandon that very thought you had previously!'\n\n[Sakka replied:] 'And Vepacitti, swear to me that you will not harm me!'\n\n[Vepacitti made this oath:] 'Whatever evil befalls one who speaks falsehood, whatever evil befalls one who slanders the noble ones, and whatever evil befalls one who betrays a friend, whatever evil befalls one who is ungrateful – may that very same evil afflict whoever harbors ill-will towards you, Sakka!'",
      "sinhala": "සැවැත්නුවරදීය.\n\nමහණෙනි, පෙර කලෙක දෙවියන්ගේ අධිපති වූ ශක්‍රයා හුදෙකලා වී විවේක සුවයෙන් සිටින කල්හි මෙබඳු සිතුවිල්ලක් උපන්නේය: \"යම්කිසි මහා සතුරෙක් මට සිටියේ වී නමුත්, මම ඔහු කෙරෙහි වෛර නොකරන්නෙමි\" යනුයි. මහණෙනි, එකල්හී වේපචිත්ති අසුරෙන්ද්‍රයා, දෙවියන්ගේ අධිපති වූ ශක්‍රයාගේ සිතේ අදහස තම සිතින්ම දැනගෙන, දෙවියන්ගේ අධිපති වූ ශක්‍රයා සිටි තැනට පැමිණියේය. මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයා, වේපචිත්ති අසුරෙන්ද්‍රයා දුරින්ම එනු දැක්කේය. වේපචිත්ති අසුරෙන්ද්‍රයා දැක ඔහු මෙසේ කීවේය: \"වේපචිත්ති, නවතිනු! නුඹ අසුවූයේය!\" යනුයි. \"යහළුව, පෙර නුඹට යම් සිතක් තිබුණේද, එයම නුඹ අත් නොහරිනු මැනවි!\" \"වේපචිත්ති, වෛර නොකිරීමට මට දිවුරනු!\" \"යමෙක් බොරු කියන්නේද, යමෙක් ආර්යයන්ට අපහාස කරන්නේද, යමෙක් මිතුරන්ට ද්‍රෝහී වන්නේද, යමෙක් අකෘතඥ වන්නේද, ඔවුනට යම් පාපයක් අත්වන්නේද, ඒ පාපයම නුඹට වෛර කරන්නාට අත්වේවා!\"",
      "paliTitle": "Nadubbhiyasuttaṃ",
      "englishTitle": "Not Betraying Sutta",
      "sinhalaTitle": "නදුබ්භිය සූත්‍රය"
    },
    {
      "number": 254,
      "pali": "Sāvatthiyaṃ jetavane. Tena kho pana samayena bhagavā divāvihāragato hoti paṭisallīno. Atha kho sakko ca devānamindo verocano ca asurindo yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā paccekaṃ dvārabāhaṃ nissāya aṭṭhaṃsu. Atha kho verocano asurindo bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Vāyametheva puriso, yāva atthassa nipphadā; Nipphannasobhano [sobhino (sī.), sobhaṇo (pī. ka.)] attho [atthā (sī.)], verocanavaco ida’’nti. ‘‘Vāyametheva puriso, yāva atthassa nipphadā; Nipphannasobhano attho [nipphannasobhino atthā (sī. syā. kaṃ.)], khantyā bhiyyo na vijjatī’’ti. ‘‘Sabbe sattā atthajātā, tattha tattha yathārahaṃ; Saṃyogaparamā tveva, sambhogā sabbapāṇinaṃ; Nipphannasobhano attho, verocanavaco ida’’nti. ‘‘Sabbe sattā atthajātā, tattha tattha yathārahaṃ; Saṃyogaparamā tveva, sambhogā sabbapāṇinaṃ; Nipphannasobhano attho, khantyā bhiyyo na vijjatī’’ti.",
      "english": "In Sāvatthī, at the Jeta Grove. Now at that time, the Blessed One was abiding in seclusion for the day. Then Sakka, king of devas, and Verocana, king of asuras, approached the Blessed One. Having approached, they each stood leaning against a doorpost. Then Verocana, king of asuras, recited this verse in the presence of the Blessed One: “A person should indeed strive until his objective is accomplished; an accomplished objective is splendid – this is Verocana’s word.” “A person should indeed strive until his objective is accomplished; an accomplished objective is splendid, but nothing superior to patience exists.” “All beings, in their respective states, are intent on their aims; indeed, for all living beings, association is the ultimate pleasure; an accomplished objective is splendid – this is Verocana’s word.” “All beings, in their respective states, are intent on their aims; indeed, for all living beings, association is the ultimate pleasure; an accomplished objective is splendid, but nothing superior to patience exists.”",
      "sinhala": "සැවැත්නුවර ජේතවනාරාමයෙහි. එසමයෙහි භාග්‍යවතුන් වහන්සේ දහවල් විවේක සුවයෙන් වැඩසිටියාහ. එසඳ සක්දෙවිඳු හා වෙරෝචන නම් අසුරිඳු භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, පැමිණ, තනි තනිව දොරකොතකට හේත්තු වී සිටගත්හ. එසඳ වෙරෝචන අසුරිඳු භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාව ප්‍රකාශ කළේය: ‘‘පුද්ගලයා අරමුණෙහි සාර්ථකත්වය ලබන තෙක්ම වීර්ය කළ යුතුය. සාර්ථක වූ අරමුණ ඉතා ශෝභන වන්නේය. මෙය වෙරෝචනගේ වචනයයි.” ‘‘පුද්ගලයා අරමුණෙහි සාර්ථකත්වය ලබන තෙක්ම වීර්ය කළ යුතුය. සාර්ථක වූ අරමුණ ඉතා ශෝභන වන්නේය. නමුත් ඉවසීමට වඩා උතුම් දෙයක් නැත්තේය.” ‘‘සියලු සත්වයෝ ඒ ඒ තන්හි තමන්ට සුදුසු අයුරින් අරමුණු ඇතුව උපදින්නාහ. සියලු ප්‍රාණීන්ගේ භෝග සම්පත්, සංයෝගයන්ගෙන් උපදින ඉහළම සැපය වන්නේය. සාර්ථක වූ අරමුණ ඉතා ශෝභන වන්නේය. මෙය වෙරෝචනගේ වචනයයි.” ‘‘සියලු සත්වයෝ ඒ ඒ තන්හි තමන්ට සුදුසු අයුරින් අරමුණු ඇතුව උපදින්නාහ. සියලු ප්‍රාණීන්ගේ භෝග සම්පත්, සංයෝගයන්ගෙන් උපදින ඉහළම සැපය වන්නේය. සාර්ථක වූ අරමුණ ඉතා ශෝභන වන්නේය. නමුත් ඉවසීමට වඩා උතුම් දෙයක් නැත්තේය.”",
      "paliTitle": "Verocanaasurindasuttaṃ",
      "englishTitle": "The Discourse to Verocana, Lord of Asuras",
      "sinhalaTitle": "වේරෝචන අසුරින්ද සූත්‍රය"
    },
    {
      "number": 255,
      "pali": "Sāvatthiyaṃ. ‘‘Bhūtapubbaṃ, bhikkhave, sambahulā isayo sīlavanto kalyāṇadhammā araññāyatane paṇṇakuṭīsu sammanti. Atha kho, bhikkhave, sakko ca devānamindo vepacitti ca asurindo yena te isayo sīlavanto kalyāṇadhammā tenupasaṅkamiṃsu. Atha kho, bhikkhave, vepacitti asurindo paṭaliyo [aṭaliyo (sī. syā. kaṃ. pī.), āṭaliyo (ka.) ma. ni. 2.410] upāhanā ārohitvā khaggaṃ olaggetvā chattena dhāriyamānena aggadvārena assamaṃ pavisitvā te isayo sīlavante kalyāṇadhamme apabyāmato karitvā atikkami. Atha kho, bhikkhave, sakko devānamindo paṭaliyo upāhanā orohitvā khaggaṃ aññesaṃ datvā chattaṃ apanāmetvā dvāreneva assamaṃ pavisitvā te isayo sīlavante kalyāṇadhamme anuvātaṃ pañjaliko namassamāno aṭṭhāsi’’. Atha kho, bhikkhave, te isayo sīlavanto kalyāṇadhammā sakkaṃ devānamindaṃ gāthāya ajjhabhāsiṃsu – ‘‘Gandho isīnaṃ ciradikkhitānaṃ, Kāyā cuto gacchati mālutena; Ito paṭikkamma sahassanetta, Gandho isīnaṃ asuci devarājā’’ti. ‘‘Gandho isīnaṃ ciradikkhitānaṃ, Kāyā cuto gacchatu [gacchati (sī. syā. kaṃ.)] mālutena, Sucitrapupphaṃ sirasmiṃva mālaṃ; Gandhaṃ etaṃ paṭikaṅkhāma bhante, Na hettha devā paṭikūlasaññino’’ti.",
      "english": "In Sāvatthī.\n\n\"Once, bhikkhus, many sages, virtuous and of good conduct, dwelt in leaf-huts in a forest grove. Then, bhikkhus, Sakka, the ruler of devas, and Vepacitti, the ruler of asuras, approached those sages, virtuous and of good conduct. Then, bhikkhus, Vepacitti, the ruler of asuras, having put on wooden sandals, with sword hanging loose, and with an umbrella held over him, entered the hermitage through the main entrance and passed by those sages, virtuous and of good conduct, disregarding them. Then, bhikkhus, Sakka, the ruler of devas, having taken off his wooden sandals, having handed his sword to others, and having put aside his umbrella, entered the hermitage properly by the doorway and stood reverently downwind of those sages, virtuous and of good conduct, with palms joined in homage.\"\n\n\"Then, bhikkhus, those sages, virtuous and of good conduct, addressed Sakka, the ruler of devas, with a verse:\n\n'The scent of sages, long-practicing ones,\nEmanating from their bodies, goes with the wind.\nDepart from here, O Thousand-eyed one!\nThe scent of sages is impure, O king of devas!'\"\n\n\"The scent of sages, long-practicing ones,\nLet it go with the wind, emanating from their bodies,\nLike a garland of beautiful fragrant flowers on the head.\nThis scent, Venerables, we welcome,\nFor the devas here are not repelled by it.\"",
      "sinhala": "සැවැත් නුවරදී. මහණෙනි, පෙර කල බොහෝ ශීලවන්ත, කල්‍යාණධර්ම ඇති ඍෂිවරුන් වනයෙහි පන්සල්වල වාසය කළහ. එවිට මහණෙනි, ශක්‍ර දෙවෙන්ද්‍රයා සහ වේපචිත්ති අසුරෙන්ද්‍රයා, ඒ ශීලවන්ත කල්‍යාණධර්ම ඇති ඍෂිවරුන් වෙත පැමිණියහ. මහණෙනි, එකල්හි වේපචිත්ති අසුරෙන්ද්‍රයා පාවහන් පැළඳ, කඩුවක් එල්ලාගෙන, කුඩයක් ඉහළින් අල්වාගෙන සිටියදී, ආශ්‍රමයේ ප්‍රධාන දොරටුවෙන් ඇතුළු වී, ඒ ශීලවන්ත කල්‍යාණධර්ම ඇති ඍෂිවරුන්ට අවමන් කොට පසු කර ගියේය. මහණෙනි, එකල්හි ශක්‍ර දෙවෙන්ද්‍රයා පාවහන් ගලවා, කඩුව අන් අයට දී, කුඩය ඉවත් කොට, ආශ්‍රමයේ දොරටුවෙන් ඇතුළු වී, ඒ ශීලවන්ත කල්‍යාණධර්ම ඇති ඍෂිවරුන්ට වා දෙසින් දොහොත් මුදුන් දී නමස්කාර කරමින් සිටියේය.\n\nමහණෙනි, එවිට ඒ ශීලවන්ත කල්‍යාණධර්ම ඇති ඍෂිවරුන් ශක්‍ර දෙවෙන්ද්‍රයාට ගාථාවකින් මෙසේ පැවසූහ –\n‘‘දිගු කලක් තපස් රැකි ඍෂිවරුන්ගේ සිරුරින් හටගන්නා ගන්ධය සුළඟින් ගමන් කරයි. දහස් ඇස් ඇත්තාණෙනි, මෙතැනින් ඉවත් වුව මැනව. දේවරාජයාණෙනි, ඍෂිවරුන්ගේ ගන්ධය අපිරිසිදුය.’’\n\n‘‘දිගු කලක් තපස් රැකි ඍෂිවරුන්ගේ සිරුරින් හටගන්නා ගන්ධය සුළඟින් ගමන් කෙරේවා. ස්වාමීනි, හිසෙහි දරන ලද ඉතා අලංකාර මල් මාලාවක් මෙනි. අපි මේ ගන්ධය ප්‍රාර්ථනා කරන්නෙමු. දෙවියෝ මේ කෙරෙහි පිළිකුල් සහගත සිතක් ඇත්තෝ නොවෙති.’’",
      "paliTitle": "Araññāyatanaisisuttaṃ",
      "englishTitle": "The Sage in the Forest Dwelling Sutta",
      "sinhalaTitle": "අරඤ්ඤායතන ඉසි සූත්‍රය"
    },
    {
      "number": 256,
      "pali": "Sāvatthiyaṃ. ‘‘Bhūtapubbaṃ, bhikkhave, sambahulā isayo sīlavanto kalyāṇadhammā samuddatīre paṇṇakuṭīsu sammanti. Tena kho pana samayena devāsurasaṅgāmo samupabyūḷho ahosi. Atha kho, bhikkhave, tesaṃ isīnaṃ sīlavantānaṃ kalyāṇadhammānaṃ etadahosi – ‘dhammikā kho devā, adhammikā asurā. Siyāpi no asurato bhayaṃ. Yaṃnūna mayaṃ sambaraṃ asurindaṃ upasaṅkamitvā abhayadakkhiṇaṃ yāceyyāmā’’’ti. ‘‘Atha kho, bhikkhave, te isayo sīlavanto kalyāṇadhammā – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – samuddatīre paṇṇakuṭīsu antarahitā sambarassa asurindassa sammukhe pāturahesuṃ. Atha kho, bhikkhave, te isayo sīlavanto kalyāṇadhammā sambaraṃ asurindaṃ gāthāya ajjhabhāsiṃsu – ‘‘Isayo sambaraṃ pattā, yācanti abhayadakkhiṇaṃ; Kāmaṃkaro hi te dātuṃ, bhayassa abhayassa vā’’ti. ‘‘Isīnaṃ abhayaṃ natthi, duṭṭhānaṃ sakkasevinaṃ; Abhayaṃ yācamānānaṃ, bhayameva dadāmi vo’’ti. ‘‘Abhayaṃ yācamānānaṃ, bhayameva dadāsi no; Paṭiggaṇhāma te etaṃ, akkhayaṃ hotu te bhayaṃ. ‘‘Yādisaṃ vapate bījaṃ, tādisaṃ harate phalaṃ; Kalyāṇakārī kalyāṇaṃ, pāpakārī ca pāpakaṃ; Pavuttaṃ tāta te bījaṃ, phalaṃ paccanubhossasī’’ti. ‘‘Atha kho, bhikkhave, te isayo sīlavanto kalyāṇadhammā sambaraṃ asurindaṃ abhisapitvā – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva – sambarassa asurindassa sammukhe antarahitā samuddatīre paṇṇakuṭīsu pāturahesuṃ. Atha kho, bhikkhave, sambaro asurindo tehi isīhi sīlavantehi kalyāṇadhammehi abhisapito rattiyā sudaṃ tikkhattuṃ ubbijjī’’ti. Paṭhamo vaggo. Tassuddānaṃ – Suvīraṃ susīmañceva, dhajaggaṃ vepacittino; Subhāsitaṃ jayañceva, kulāvakaṃ nadubbhiyaṃ; Verocana asurindo, isayo araññakañceva; Isayo ca samuddakāti.",
      "english": "At Sāvatthī.\nFormerly, bhikkhus, numerous sages, virtuous and of excellent conduct, dwelled in leaf-huts on the seashore. Now, at that time, a battle between devas and asuras had been arrayed. Then, bhikkhus, it occurred to those sages, virtuous and of excellent conduct: 'The devas are righteous, and the asuras are unrighteous. Perhaps there will be danger for us from the asuras. Why don't we approach Sambara, the lord of asuras, and ask for a boon of safety?'\n\nThen, bhikkhus, those sages, virtuous and of excellent conduct – just as a strong man might extend his flexed arm or flex his extended arm – vanished from their leaf-huts on the seashore and appeared before Sambara, the lord of asuras.\n\nThen, bhikkhus, those sages, virtuous and of excellent conduct, addressed Sambara, the lord of asuras, with a verse: “The sages, having reached Sambara, ask for a boon of safety. It is in your power to grant either safety or fear.”\n\n[Sambara replied]: “There is no safety for sages who are wicked and serve Sakka. To those who ask for safety, I give only fear.”\n\n[The sages replied]: “You give us fear when we ask for safety. We accept this from you; may your fear be inexhaustible. Just as one sows a seed, so does one reap the fruit. A doer of good gets good, and a doer of evil gets evil. The seed you have sown, my friend, you shall surely experience its fruit.”\n\nThen, bhikkhus, those sages, virtuous and of excellent conduct, having pronounced a curse upon Sambara, the lord of asuras – just as a strong man might extend his flexed arm or flex his extended arm – vanished from before Sambara, the lord of asuras, and reappeared in their leaf-huts on the seashore.\n\nThen, bhikkhus, Sambara, the lord of asuras, having been cursed by those sages, virtuous and of excellent conduct, started up in fright three times during the night. This is the first chapter. Its summary: Suvīra, Susīma, Dhajagga, Vepacitti, Subhāsita, Jaya, Kulāvaka, Nadubbhiya, Verocana the lord of asuras, the sages of the forest, and the sages of the sea.",
      "sinhala": "සාවත්ථියෙහි.\n\nභික්ෂූනි, පෙර කාලයෙහි බොහෝ සෘෂිවරු, සීලවන්තවූ, යහපත් ගතිගුණ ඇතිවූ, මුහුදු තීරයෙහි පන්සල්හි වාසය කළහ. ඒ සමයෙහි දෙවාසුර සංග්‍රාමයක් ඇතිවී පැවතුණි. භික්ෂූනි, ඉක්බිති ඒ සීලවන්තවූ, යහපත් ගතිගුණ ඇතිවූ සෘෂිවරුන්ට මෙසේ සිතුණි: ‘දෙවියෝ ධර්මිෂ්ඨයෝය, අසුරයෝ අධර්මිෂ්ඨයෝය. අපට අසුරයන්ගෙන් භයක් ඇති විය හැක. අපි සම්බර නම් අසුරේන්ද්‍රයා වෙත ගොස් අභයදානයක් ඉල්ලමු නම් මැනවයි.’\n\nභික්ෂූනි, ඉක්බිති ඒ සීලවන්තවූ, යහපත් ගතිගුණ ඇතිවූ සෘෂිවරු - යම්සේ බලවත් පුරුෂයෙක් හැකිලූ බාහුවක් දිගහරින්නේද, දිගහැරී බාහුවක් හකුලුවා ගන්නේද, එපරිද්දෙන්ම - මුහුදු තීරයෙහි වූ පන්සල්හි අතුරුදහන්වී සම්බර අසුරේන්ද්‍රයා ඉදිරිපිට පෙනී සිටියහ. භික්ෂූනි, ඉක්බිති ඒ සීලවන්තවූ, යහපත් ගතිගුණ ඇතිවූ සෘෂිවරු සම්බර අසුරේන්ද්‍රයාට ගාථාවකින් මෙසේ කීහ: ‘‘සෘෂිවරු සම්බරයා වෙත පැමිණ අභයදානයක් ඉල්ලති. ඔබට භය හෝ අභය දෙකටම කැමති පරිදි දිය හැකියි.’’\n\n‘‘සක් දෙවියන්ට උපකාර කරන දුෂ්ට සෘෂීන්ට අභය නැත. අභය ඉල්ලන ඔබට භයම දෙන්නෙමි.’’\n\n‘‘අභය ඉල්ලන අපට ඔබ භයම දෙන්නෙහි. අපි එය පිළිගනිමු, ඔබට භය අක්ෂය (ක්ෂය නොවන) වේවා! යම් බීජයක් වපුරන්නේද, ඒ හා සමාන ඵලයක් නෙළාගනී. යහපත් කරන්නාට යහපතද, පාපී කරන්නාට පාපයද ලැබේ. පුත, ඔබ විසින් වපුරන ලද බීජයෙහි ඵලය විඳින්නට සිදුවනු ඇතැයි.’’\n\nභික්ෂූනි, ඉක්බිති ඒ සීලවන්තවූ, යහපත් ගතිගුණ ඇතිවූ සෘෂිවරු සම්බර අසුරේන්ද්‍රයාට ශාපකොට - යම්සේ බලවත් පුරුෂයෙක් හැකිලූ බාහුවක් දිගහරින්නේද, දිගහැරී බාහුවක් හකුලුවා ගන්නේද, එපරිද්දෙන්ම - සම්බර අසුරේන්ද්‍රයා ඉදිරිපිට අතුරුදහන්වී මුහුදු තීරයෙහි වූ පන්සල්හි පෙනී සිටියහ. භික්ෂූනි, ඉක්බිති ඒ සීලවන්තවූ, යහපත් ගතිගුණ ඇතිවූ සෘෂිවරුන් විසින් ශාප කරන ලද සම්බර අසුරේන්ද්‍රයා රාත්‍රියෙහි තුන් වරක් තැතිගත්තේය.\n\nපළමුවන වර්ගයයි. එහි සූත්‍ර නාමාවලිය: සුවීර, සුසීම, ධජග්ග, වේපචිත්ති, සුභාසිත, ජය, කුලාවක, නදුබ්භිය, වේරෝචන, අසුරේන්ද්‍ර, සෘෂි, අරඤ්ඤක, සෘෂි සහ සමුද්දක යන සූත්‍රයෝයි.",
      "paliTitle": "Samuddakasuttaṃ",
      "englishTitle": "The Discourse on the Ocean-Dweller",
      "sinhalaTitle": "සමුද්දක සූත්‍රය"
    },
    {
      "number": 257,
      "pali": "Sāvatthiyaṃ. ‘‘Sakkassa, bhikkhave, devānamindassa pubbe manussabhūtassa satta vatapadāni [vattapadāni (ka.)] samattāni samādinnāni ahesuṃ, yesaṃ samādinnattā sakko sakkattaṃ ajjhagā. Katamāni satta vatapadāni? Yāvajīvaṃ mātāpettibharo assaṃ, yāvajīvaṃ kule jeṭṭhāpacāyī assaṃ, yāvajīvaṃ saṇhavāco assaṃ, yāvajīvaṃ apisuṇavāco assaṃ, yāvajīvaṃ vigatamalamaccherena cetasā agāraṃ ajjhāvaseyyaṃ muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato, yāvajīvaṃ saccavāco assaṃ, yāvajīvaṃ akkodhano assaṃ – sacepi me kodho uppajjeyya, khippameva naṃ paṭivineyya’’nti. ‘‘Sakkassa, bhikkhave, devānamindassa pubbe manussabhūtassa imāni satta vatapadāni samattāni samādinnāni ahesuṃ, yesaṃ samādinnattā sakko sakkattaṃ ajjhagā’’ti. ‘‘Mātāpettibharaṃ jantuṃ, kule jeṭṭhāpacāyinaṃ; Saṇhaṃ sakhilasambhāsaṃ, pesuṇeyyappahāyinaṃ. ‘‘Maccheravinaye yuttaṃ, saccaṃ kodhābhibhuṃ naraṃ; Taṃ ve devā tāvatiṃsā, āhu sappuriso itī’’ti.",
      "english": "Bhikkhus, in the past, when Sakka, the lord of devas, was a human being, seven vows were fully undertaken and observed by him, and by undertaking and observing these, Sakka attained the state of Sakka. Which are these seven vows?\n“As long as I live, I shall support my parents. As long as I live, I shall revere the elders in my family. As long as I live, I shall use gentle speech. As long as I live, I shall not utter divisive speech. As long as I live, I shall dwell in my home with a mind free from the stain of stinginess, being open-handed, with clean hands, delighting in relinquishing, responsive to requests, delighting in the sharing of gifts. As long as I live, I shall speak the truth. As long as I live, I shall be free from anger – even if anger should arise in me, I shall quickly subdue it.”\n\nBhikkhus, it was these seven vows that were fully undertaken and observed by Sakka, the lord of devas, when he was a human being, and by undertaking and observing these, Sakka attained the state of Sakka.\n\nA being who supports their parents, who reveres the elders in their family, who speaks gently and kindly, who has abandoned divisive speech, who is engaged in overcoming stinginess, a person who conquers anger with truth – such a one, indeed, the Tāvatiṃsa devas declare to be a truly good person.",
      "sinhala": "මහණෙනි, දෙවියන්ට අධිපති වූ ශක්‍ර​යා පෙර මනුෂ්‍යයත්වයේ සිටියදී සම්පූර්ණයෙන් සමාදන් වූ ව්‍රතපද හතක් තිබුණි. ඒ ව්‍රතපද සමාදන් වූ හෙයින් ශක්‍ර​යා ශක්‍ර​ බවට පත්විය.\nඒ ව්‍රතපද හත කවරේද?\nජීවිතාන්තය දක්වා මව්පියන් පෝෂණය කරන්නෙක් වන්නෙමි.\nජීවිතාන්තය දක්වා කුලයේ වැඩිහිටියන්ට ගරු කරන්නෙක් වන්නෙමි.\nජීවිතාන්තය දක්වා මෘදු වචන කතා කරන්නෙක් වන්නෙමි.\nජීවිතාන්තය දක්වා කේළාම් නොකියන්නෙක් වන්නෙමි.\nජීවිතාන්තය දක්වා, කිළුටු වූ මසුරු සිත දුරු කොට, මුදාහැර දීම පුරුදු කළ, දීමට සූදානම් වූ දෑත් ඇති, දන් දීමෙහි ඇලුනු, ඉල්ලන්නන් හට සුදුසු, දන් බෙදා දීමෙහි ඇලුනු සිතින් නිවසේ වාසය කරන්නෙමි.\nජීවිතාන්තය දක්වා සත්‍යවාදී වන්නෙමි.\nජීවිතාන්තය දක්වා කිපීමෙන් තොර වන්නෙමි. යම් හෙයකින් මට කෝපයක් උපදී නම්, එය ක්ෂණිකවම දුරු කරන්නෙමි.\n\nමහණෙනි, දෙවියන්ට අධිපති වූ ශක්‍ර​යා පෙර මනුෂ්‍යයත්වයේ සිටියදී සම්පූර්ණයෙන් සමාදන් වූයේ මේ ව්‍රතපද හතයි. ඒ ව්‍රතපද සමාදන් වූ හෙයින් ශක්‍ර​යා ශක්‍ර​ බවට පත්විය.\n\nමව්පියන් පෝෂණය කරන, කුලයේ වැඩිහිටියන්ට ගරු කරන, මෘදු හා ප්‍රි​ය වචන කතා කරන, කේළාම් කීම අත්හල, මසුරුකම දුරු කිරීමෙහි යෙදී සිටින, සත්‍යවාදී වූ, කෝපය ජයගත් මිනිසාව සැබවින්ම තාවතිංසාවල දෙවියෝ සත්පුරුෂයෙකැයි කියති.",
      "paliTitle": "Vatapadasuttaṃ",
      "vagga": "Dutiyavaggo",
      "englishTitle": "The Discourse on the Bases of Vows",
      "sinhalaTitle": "වතපද සූත්‍රය",
      "vaggaEnglish": "Second Chapter",
      "vaggaSinhala": "දෙවන වර්ගය"
    },
    {
      "number": 258,
      "pali": "Sāvatthiyaṃ jetavane. Tatra kho bhagavā bhikkhū etadavoca – ‘‘sakko, bhikkhave, devānamindo pubbe manussabhūto samāno magho nāma māṇavo ahosi, tasmā maghavāti vuccati. ‘‘Sakko, bhikkhave, devānamindo pubbe manussabhūto samāno pure [pure pure (sī. pī.)] dānaṃ adāsi, tasmā purindadoti vuccati. ‘‘Sakko, bhikkhave, devānamindo pubbe manussabhūto samāno sakkaccaṃ dānaṃ adāsi, tasmā sakkoti vuccati. ‘‘Sakko, bhikkhave, devānamindo pubbe manussabhūto samāno āvasathaṃ adāsi, tasmā vāsavoti vuccati. ‘‘Sakko, bhikkhave, devānamindo sahassampi atthānaṃ muhuttena cinteti, tasmā sahassakkhoti vuccati. ‘‘Sakkassa, bhikkhave, devānamindassa sujā nāma asurakaññā pajāpati, tasmā sujampatīti vuccati. ‘‘Sakko, bhikkhave, devānamindo devānaṃ tāvatiṃsānaṃ issariyādhipaccaṃ rajjaṃ kāreti, tasmā devānamindoti vuccati. ‘‘Sakkassa, bhikkhave devānamindassa pubbe manussabhūtassa satta vatapadāni samattāni samādinnāni ahesuṃ, yesaṃ samādinnattā sakko sakkattaṃ ajjhagā. Katamāni satta vatapadāni? Yāvajīvaṃ mātāpettibharo assaṃ, yāvajīvaṃ kule jeṭṭhāpacāyī assaṃ, yāvajīvaṃ saṇhavāco assaṃ, yāvajīvaṃ apisuṇavāco assaṃ, yāvajīvaṃ vigatamalamaccherena cetasā agāraṃ ajjhāvaseyyaṃ muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato, yāvajīvaṃ saccavāco assaṃ, yāvajīvaṃ akkodhano assaṃ – sacepi me kodho uppajjeyya, khippameva naṃ paṭivineyya’’nti. ‘‘Sakkassa, bhikkhave, devānamindassa pubbe manussabhūtassa imāni satta vatapadāni samattāni samādinnāni ahesuṃ, yesaṃ samādinnattā sakko sakkattaṃ ajjhagā’’ti. ‘‘Mātāpettibharaṃ jantuṃ, kule jeṭṭhāpacāyinaṃ; Saṇhaṃ sakhilasambhāsaṃ, pesuṇeyyappahāyinaṃ. ‘‘Maccheravinaye yuttaṃ, saccaṃ kodhābhibhuṃ naraṃ; Taṃ ve devā tāvatiṃsā, āhu sappuriso itī’’ti.",
      "english": "At Sāvatthī, in the Jeta Grove. There, the Blessed One addressed the monks, saying: \"Monks, Sakka, the ruler of devas, when he was previously a human being, was a young man named Magha. Therefore, he is called Maghava. Monks, Sakka, the ruler of devas, when he was previously a human being, gave gifts previously. Therefore, he is called Purindada. Monks, Sakka, the ruler of devas, when he was previously a human being, gave gifts respectfully. Therefore, he is called Sakka. Monks, Sakka, the ruler of devas, when he was previously a human being, gave lodging. Therefore, he is called Vāsava. Monks, Sakka, the ruler of devas, considers a thousand matters in a moment. Therefore, he is called Sahassakkha. Monks, Sujā, an Asura maiden, is the wife of Sakka, the ruler of devas. Therefore, he is called Sujampati. Monks, Sakka, the ruler of devas, exercises sovereignty and lordship over the Tāvatiṃsa devas. Therefore, he is called Devānaminda.\"\n\n\"Monks, when Sakka, the ruler of devas, was previously a human being, he undertook and completed seven vows, by the undertaking of which Sakka attained the state of Sakka. What are these seven vows? 'As long as I live, may I be a supporter of my parents. As long as I live, may I revere the elders in my family. As long as I live, may I be soft-spoken. As long as I live, may I refrain from backbiting. As long as I live, may I dwell in my home with a mind free from the stain of stinginess, being open-handed, pure of hand, delighting in giving up, responsive to requests, and delighting in the distribution of gifts. As long as I live, may I be truthful in speech. As long as I live, may I be free from anger – and if anger should arise in me, may I quickly subdue it.' Monks, when Sakka, the ruler of devas, was previously a human being, these seven vows were undertaken and completed by him, by the undertaking of which Sakka attained the state of Sakka.\"\n\n\"A being who supports mother and father, who reveres the elders in the family; who is soft and gentle in speech, who has abandoned backbiting. A person engaged in restraining stinginess, who is truthful, who overcomes anger; such a one indeed the Tāvatiṃsa devas call a good person.\"",
      "sinhala": "සැවැත් නුවර ජේතවනාරාමයේදීය. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක:\n\n“මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයා පෙර මිනිස් භවයක ඉපිද සිටියදී මඝ නම් මානවකයෙක් විය. එබැවින් ඔහු 'මඝවා' යැයි කියනු ලැබේ. මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයා පෙර මිනිස් භවයක ඉපිද සිටියදී නිතර දන් දුන්නේය. එබැවින් ඔහු 'පුරින්දද' යැයි කියනු ලැබේ. මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයා පෙර මිනිස් භවයක ඉපිද සිටියදී සත්කාරයෙන් දන් දුන්නේය. එබැවින් ඔහු 'ශක්‍ර' යැයි කියනු ලැබේ. මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයා පෙර මිනිස් භවයක ඉපිද සිටියදී (අසරණ වූවන්ට) වාසස්ථාන දුන්නේය. එබැවින් ඔහු 'වාසව' යැයි කියනු ලැබේ. මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයා දහසක් වූ කරුණු ක්ෂණයකින් සිතයි. එබැවින් ඔහු 'සහස්සක්ඛ' යැයි කියනු ලැබේ. මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයාගේ සුජා නම් වූ අසුර කන්‍යාවක් භාර්යාව වෙයි. එබැවින් ඔහු 'සුජම්පති' යැයි කියනු ලැබේ. මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයා තව්තිසා දෙවියන් අතර අධිපතිභාවය හා රාජ්‍යය පාලනය කරයි. එබැවින් ඔහු 'දේවානම්ඉන්ද්‍ර' යැයි කියනු ලැබේ. මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයාට පෙර මිනිස් භවයක ඉපිද සිටියදී සම්පූර්ණ කරන ලද වතපද හතක් තිබුණි. ඒ වතපද සමාදන් කරගත් බැවින් ශක්‍රයා ශක්‍ර බවට පත් විය. කවරේද ඒ වතපද හත?\n\nමම ජීවිතාන්තය දක්වා මව්පියන් පෝෂණය කරන්නෙක් වෙම්වා. මම ජීවිතාන්තය දක්වා කුලයේ වැඩිහිටියන්ට ගරු කරන්නෙක් වෙම්වා. මම ජීවිතාන්තය දක්වා මෘදු වචන කතා කරන්නෙක් වෙම්වා. මම ජීවිතාන්තය දක්වා කේළාම් නොකියන්නෙක් වෙම්වා. මම ජීවිතාන්තය දක්වා මසුරුකම් නමැති කෙලෙස් දුරු කළ සිතින්, අත දිග හැර දන් දෙන, පිරිසිදු දෑත් ඇති, පරිත්‍යාගයට ඇලුම් කරන, ඉල්ලීමට සුදුසු, දානය බෙදා දීමට ඇලුම් කරන ගෘහ ජීවිතයක් ගත කරන්නෙක් වෙම්වා. මම ජීවිතාන්තය දක්වා සත්‍ය වචන කතා කරන්නෙක් වෙම්වා. මම ජීවිතාන්තය දක්වා ක්‍රෝධ නොකරන්නෙක් වෙම්වා – යම් හෙයකින් මට ක්‍රෝධයක් උපදී නම්, ක්ෂණයකින්ම එය දුරු කරම්වා.”\n\n“මහණෙනි, දෙවියන්ගේ අධිපති වූ ශක්‍රයාට පෙර මිනිස් භවයක සිටියදී මේ වතපද හත සම්පූර්ණ කර සමාදන් කරගෙන තිබුණි. ඒ වතපද සමාදන් කරගත් බැවින් ශක්‍රයා ශක්‍ර බවට පත් විය.”\n\n“මව්පියන් පෝෂණය කරන,\nකුලයේ වැඩිහිටියන්ට ගරු කරන,\nමෘදු හා මිහිරි වචන කතා කරන,\nකේළාම් කීම අත්හළ,\nමසුරුකම දුරු කිරීමෙහි යෙදී සිටින,\nසත්‍යවාදී වූ, ක්‍රෝධය ජයගත් පුද්ගලයකුට,\nනිසැකවම තව්තිසා දෙවියෝ 'සත්පුරුෂයෙකි' යැයි කියති.”",
      "paliTitle": "Sakkanāmasuttaṃ",
      "englishTitle": "The Discourse on the Names of Sakka",
      "sinhalaTitle": "සක්කනාම සූත්‍රය"
    },
    {
      "number": 259,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho mahāli licchavī yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahāli licchavī bhagavantaṃ etadavoca – ‘‘Diṭṭho kho, bhante, bhagavatā sakko devānamindo’’ti? ‘‘Diṭṭho kho me, mahāli, sakko devānamindo’’ti. ‘‘So hi nūna, bhante, sakkapatirūpako bhavissati. Duddaso hi, bhante, sakko devānamindo’’ti. ‘‘Sakkañca khvāhaṃ, mahāli, pajānāmi sakkakaraṇe ca dhamme, yesaṃ dhammānaṃ samādinnattā sakko sakkattaṃ ajjhagā, tañca pajānāmi. ‘‘Sakko, mahāli, devānamindo pubbe manussabhūto samāno magho nāma māṇavo ahosi, tasmā maghavāti vuccati. ‘‘Sakko, mahāli, devānamindo pubbe manussabhūto samāno sakkaccaṃ dānaṃ adāsi, tasmā sakkoti vuccati. ‘‘Sakko, mahāli, devānamindo pubbe manussabhūto samāno pure dānaṃ adāsi, tasmā purindadoti vuccati. ‘‘Sakko, mahāli, devānamindo pubbe manussabhūto samāno āvasathaṃ adāsi, tasmā vāsavoti vuccati. ‘‘Sakko, mahāli, devānamindo sahassampi atthānaṃ muhuttena cinteti, tasmā sahassakkhoti vuccati. ‘‘Sakkassa, mahāli, devānamindassa sujā nāma asurakaññā pajāpati, tasmā sujampatīti vuccati. ‘‘Sakko, mahāli, devānamindo devānaṃ tāvatiṃsānaṃ issariyādhipaccaṃ rajjaṃ kāreti, tasmā devānamindoti vuccati. ‘‘Sakkassa, mahāli, devānamindassa pubbe manussabhūtassa satta vatapadāni samattāni samādinnāni ahesuṃ, yesaṃ samādinnattā sakko sakkattaṃ ajjhagā. Katamāni satta vatapadāni? Yāvajīvaṃ mātāpettibharo assaṃ, yāvajīvaṃ kule jeṭṭhāpacāyī assaṃ, yāvajīvaṃ saṇhavāco assaṃ, yāvajīvaṃ apisuṇavāco assaṃ, yāvajīvaṃ vigatamalamaccherena cetasā agāraṃ ajjhāvaseyyaṃ muttacāgo payatapāṇi vossaggarato yācayogo dānasaṃvibhāgarato, yāvajīvaṃ saccavāco assaṃ, yāvajīvaṃ akkodhano assaṃ – sacepi me kodho uppajeyya, khippameva naṃ paṭivineyya’’nti. ‘‘Sakkassa, mahāli, devānamindassa pubbe manussabhūtassa imāni satta vatapadāni samattāni samādinnāni ahesuṃ, yesaṃ samādinnattā sakko sakkattaṃ ajjhagā’’ti. ‘‘Mātāpettibharaṃ jantuṃ, kule jeṭṭhāpacāyinaṃ; Saṇhaṃ sakhilasambhāsaṃ, pesuṇeyyappahāyinaṃ. ‘‘Maccheravinaye yuttaṃ, saccaṃ kodhābhibhuṃ naraṃ; Taṃ ve devā tāvatiṃsā, āhu sappuriso itī’’ti.",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling at Vesālī, in the Great Wood, at the Gabled Hall.\n\nThen Mahāli the Licchavī approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, Mahāli the Licchavī said this to the Blessed One: \"Venerable Sir, has the Blessed One seen Sakka, king of the devas?\"\n\n\"Indeed, Mahāli, I have seen Sakka, king of the devas.\"\n\n\"Venerable Sir, that must have been a mere likeness of Sakka. For Sakka, king of the devas, is difficult to see.\"\n\n\"Mahāli, I know Sakka, and I know the qualities that make one a Sakka, by the embracing of which qualities Sakka attained his Sakka-hood, and I know those as well.\n\n\"Mahāli, Sakka, king of the devas, was formerly a human being named Magha, a young man. Therefore, he is called Maghavā.\n\n\"Mahāli, Sakka, king of the devas, was formerly a human being. He gave gifts with respect and diligence. Therefore, he is called Sakka.\n\n\"Mahāli, Sakka, king of the devas, was formerly a human being. He gave gifts prior to being asked. Therefore, he is called Purindada.\n\n\"Mahāli, Sakka, king of the devas, was formerly a human being. He provided dwellings. Therefore, he is called Vāsava.\n\n\"Mahāli, Sakka, king of the devas, contemplates a thousand matters in a moment. Therefore, he is called Sahassakkha (the thousand-eyed).\n\n\"Mahāli, Sakka, king of the devas, has a consort named Sujā, an Asura maiden. Therefore, he is called Sujampati.\n\n\"Mahāli, Sakka, king of the devas, wields sovereign lordship and rule over the Tāvatiṃsa devas. Therefore, he is called Devānaminda (king of the devas).\n\n\"Mahāli, when Sakka, king of the devas, was formerly a human being, he undertook and perfectly fulfilled seven vows. By the embracing of these, Sakka attained his Sakka-hood. What were these seven vows?\n\n\"‘As long as I live, may I be a supporter of my mother and father. As long as I live, may I revere the elders in my family. As long as I live, may I be gentle in speech. As long as I live, may I not speak divisively. As long as I live, may I dwell in my home with a mind free from the stain of stinginess, being open-handed, clean-handed, delighting in giving, dedicated to charity, delighting in sharing gifts. As long as I live, may I speak the truth. As long as I live, may I be free from anger – and if anger should arise in me, may I quickly suppress it.’\n\n\"Mahāli, when Sakka, king of the devas, was formerly a human being, these were the seven vows he undertook and perfectly fulfilled. By the embracing of these, Sakka attained his Sakka-hood.\"\n\nA being who supports mother and father,\nWho reveres the elders in the family;\nWho is gentle and kindly in speech,\nWho abandons divisive speech;\nWho is engaged in overcoming stinginess,\nA truthful person who conquers anger –\nHim do the Tāvatiṃsa devas declare to be a truly good person.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ වෛශාලියෙහි මහා වනයෙහි කූටාගාර ශාලාවෙහි වැඩවසන සේක.\n\nඑකල්හි මහාලි ලිච්ඡවී තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි මහාලි ලිච්ඡවී තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවියන් දැක තිබේද?”\n\n“මහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවියන් මා විසින් දැක ඇත.”\n\n“වහන්ස, එසේනම් එය ශක්‍රයාගේ රූපයක් විය යුතුය. වහන්ස, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවියන් දැකීම දුෂ්කරය.”\n\n“මහාලි, මම ශක්‍රයා ද දනිමි, ශක්‍රත්වය ඇති කරන ධර්මයන් ද දනිමි, යම් ධර්මයන් සමාදන් වීම නිසා ශක්‍ර දෙවෙන්ද්‍රයා ශක්‍ර බවට පත් වූයේද, ඒ ධර්මයන් ද මම දනිමි.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා පෙර මිනිස් ලොව මහඝ නම් මාණවකයෙක්ව සිටියේය. එබැවින් ඔහු ‘මඝවා’ යැයි කියනු ලැබේ.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා පෙර මිනිස් ලොවදී, සක්කාච්චව හෙවත් ගෞරවයෙන් දන් දුන්නේය. එබැවින් ඔහු ‘ශක්‍ර’ යැයි කියනු ලැබේ.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා පෙර මිනිස් ලොවදී, පූර්වභාගයෙහිම දන් දුන්නේය. එබැවින් ඔහු ‘පුරින්දද’ යැයි කියනු ලැබේ.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා පෙර මිනිස් ලොවදී, ආවාස නැතහොත් නිවාස දුන්නේය. එබැවින් ඔහු ‘වාසව’ යැයි කියනු ලැබේ.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා දහසක් අරමුණු එක මොහොතකින් සිතයි. එබැවින් ඔහු ‘සහස්සක්ඛ’ යැයි කියනු ලැබේ.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයාට සුජා නම් අසුර කන්‍යාවක් භාර්යාව වූවාය. එබැවින් ඔහු ‘සුජම්පති’ යැයි කියනු ලැබේ.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා තව්තිසා දෙවියන් අතර ඊශ්වරත්වය හා ආධිපත්‍යය ඇතිව රාජ්‍යය පාලනය කරයි. එබැවින් ඔහු ‘දේවානම්ඉන්ද්‍ර’ යැයි කියනු ලැබේ.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා පෙර මිනිස් ලොව සිටින විට, සම්පූර්ණ කරන ලද වතපද හතක් සමාදන් වී සිටියේය. යම් වතපද සමාදන් වීම නිසා ශක්‍රයා ශක්‍රත්වය ලැබුවේද ඒ (වතපද මෙසේය).\n\nකවර නම් වතපද හතක්ද යත්:\nයම්තාක් කල් ජීවත් වනුයේද, ඒතාක් කල් මවටත් පියාටත් උපස්ථාන කරමි.\nයම්තාක් කල් ජීවත් වනුයේද, ඒතාක් කල් කුලදෙටුවන්ට ගෞරව කරමි.\nයම්තාක් කල් ජීවත් වනුයේද, ඒතාක් කල් මෘදු වචන ඇතිව කථා කරමි.\nයම්තාක් කල් ජීවත් වනුයේද, ඒතාක් කල් කේලාම් නොකියමි.\nයම්තාක් කල් ජීවත් වනුයේද, ඒතාක් කල් කිලිටු වූ මසුරු මල පහකළ සිතින් ගිහි ගෙදර වාසය කරමි. පරිත්‍යාගශීලීව, පිරිසිදු අත් ඇතිව, කැපකිරීමට ප්‍රියව, යාචකයන්ට පිහිට වී, දන් බෙදා දීමට ඇලුම් කරමි.\nයම්තාක් කල් ජීවත් වනුයේද, ඒතාක් කල් සත්‍යවාදී වෙමි.\nයම්තාක් කල් ජීවත් වනුයේද, ඒතාක් කල් ක්‍රෝධ නොකරමි. මා තුළ කිසියම් ක්‍රෝධයක් හටගත්තේ නම්, එය ඉක්මනින්ම දුරු කරමි.\n\nමහාලි, දෙවිවරුන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා පෙර මිනිස් ලොව සිටින විට, සම්පූර්ණ කරන ලද මේ වතපද හත සමාදන් වී සිටියේය. යම් වතපද සමාදන් වීම නිසා ශක්‍රයා ශක්‍රත්වය ලැබුවේද ඒ (වතපද මේවාය).\n\nමවුපියන්ට උපස්ථාන කරන සත්පුරුෂයාද, කුලදෙටුවන්ට ගරු කරන පුද්ගලයාද, මෘදු හා ප්‍රිය වචන කතා කරන්නාද, කේලාම් කීම අත්හල තැනැත්තාද,\n\nමසුරුකම දුරු කිරීමට යොමු වූ, සත්‍යවාදී වූ, ක්‍රෝධය යටපත් කරගත් මිනිසා, තව්තිසා දෙවියෝ සැබවින්ම ‘සත්පුරුෂයෙකි’ යැයි පවසති.",
      "paliTitle": "Mahālisuttaṃ",
      "englishTitle": "To Mahāli Sutta",
      "sinhalaTitle": "මහාලි සූත්‍රය"
    },
    {
      "number": 260,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Bhūtapubbaṃ, bhikkhave, aññataro puriso imasmiṃyeva rājagahe manussadaliddo [manussadaḷiddo (sī. syā. kaṃ.)] ahosi manussakapaṇo manussavarāko. So tathāgatappavedite dhammavinaye saddhaṃ samādiyi, sīlaṃ samādiyi, sutaṃ samādiyi, cāgaṃ samādiyi, paññaṃ samādiyi. So tathāgatappavedite dhammavinaye saddhaṃ samādiyitvā sīlaṃ samādiyitvā sutaṃ samādiyitvā cāgaṃ samādiyitvā paññaṃ samādiyitvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajji devānaṃ tāvatiṃsānaṃ sahabyataṃ. So aññe deve atirocati vaṇṇena ceva yasasā ca. Tatra sudaṃ, bhikkhave, devā tāvatiṃsā ujjhāyanti khiyyanti vipācenti – ‘acchariyaṃ vata bho, abbhutaṃ vata bho! Ayañhi devaputto pubbe manussabhūto samāno manussadaliddo ahosi manussakapaṇo manussavarāko; so kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapanno devānaṃ tāvatiṃsānaṃ sahabyataṃ. So aññe deve atirocati vaṇṇena ceva yasasā cā’’’ti. ‘‘Atha kho, bhikkhave, sakko devānamindo deve tāvatiṃse āmantesi – ‘mā kho tumhe, mārisā, etassa devaputtassa ujjhāyittha. Eso kho, mārisā, devaputto pubbe manussabhūto samāno tathāgatappavedite dhammavinaye saddhaṃ samādiyi, sīlaṃ samādiyi, sutaṃ samādiyi, cāgaṃ samādiyi, paññaṃ samādiyi. So tathāgatappavedite dhammavinaye saddhaṃ samādiyitvā sīlaṃ samādiyitvā sutaṃ samādiyitvā cāgaṃ samādiyitvā paññaṃ samādiyitvā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapanno devānaṃ tāvatiṃsānaṃ sahabyataṃ. So aññe deve atirocati vaṇṇena ceva yasasā cā’’’ti. Atha kho, bhikkhave, sakko devānamindo deve tāvatiṃse anunayamāno tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Yassa saddhā tathāgate, acalā suppatiṭṭhitā; Sīlañca yassa kalyāṇaṃ, ariyakantaṃ pasaṃsitaṃ. ‘‘Saṅghe pasādo yassatthi, ujubhūtañca dassanaṃ; Adaliddoti taṃ āhu, amoghaṃ tassa jīvitaṃ. ‘‘Tasmā saddhañca sīlañca, pasādaṃ dhammadassanaṃ; Anuyuñjetha medhāvī, saraṃ buddhāna sāsana’’nti.",
      "english": "At one time the Blessed One was staying in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. There the Blessed One addressed the bhikkhus, saying: \"Bhikkhus!\" \"Venerable sir,\" those bhikkhus replied to the Blessed One. The Blessed One spoke thus: \"Formerly, bhikkhus, a certain man in this very Rājagaha was poor among humans, wretched among humans, and miserable among humans. He undertook faith in the Dhamma-Vinaya proclaimed by the Tathāgata, he undertook morality, he undertook learning, he undertook generosity, he undertook wisdom. Having undertaken faith in the Dhamma-Vinaya proclaimed by the Tathāgata, having undertaken morality, having undertaken learning, having undertaken generosity, having undertaken wisdom, with the break-up of the body, after death, he reappeared in a good destination, a heavenly world, in companionship with the devas of Tāvatiṃsa. He outshone other devas in both beauty and renown. There, bhikkhus, the Tāvatiṃsa devas complained, grumbled, and protested: 'It is truly amazing, sirs, it is truly astounding! This deva’s son, formerly a human being, was poor among humans, wretched among humans, and miserable among humans; yet, with the break-up of the body, after death, he has reappeared in a good destination, a heavenly world, in companionship with the devas of Tāvatiṃsa. He outshines other devas in both beauty and renown!'\"\n\n\"Then, bhikkhus, Sakka, the lord of devas, addressed the Tāvatiṃsa devas, saying: 'Sirs, do not complain about this deva’s son. Sirs, this deva’s son, formerly a human being, undertook faith in the Dhamma-Vinaya proclaimed by the Tathāgata, he undertook morality, he undertook learning, he undertook generosity, he undertook wisdom. Having undertaken faith in the Dhamma-Vinaya proclaimed by the Tathāgata, having undertaken morality, having undertaken learning, having undertaken generosity, having undertaken wisdom, with the break-up of the body, after death, he has reappeared in a good destination, a heavenly world, in companionship with the devas of Tāvatiṃsa. He outshines other devas in both beauty and renown.'\"\n\nThen, bhikkhus, Sakka, the lord of devas, admonishing the Tāvatiṃsa devas, on that occasion uttered these verses:\n\n\"One whose faith in the Tathāgata is unshakeable and well-established; and whose morality is excellent, cherished by the noble ones and praised,\n\nAnd who has serene confidence in the Saṅgha, and whose vision is upright: they call him not poor, his life is not in vain.\n\nTherefore, the wise person, remembering the teaching of the Buddhas, should diligently cultivate faith, morality, serene confidence, and the vision of Dhamma.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ කලඳකනිවාප නම් ස්ථානයේ වැඩසිටියාහ. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා “මහණෙනි”යි වදාළ සේක. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, පෙර කලෙක මේ රජගහ නුවරම යම් කිසි පුරුෂයෙක් මනුෂ්‍යයන් අතර දිළිඳු විය. මනුෂ්‍යයන් අතර අසරණ විය. මනුෂ්‍යයන් අතර අභාග්‍ය සම්පන්න විය. ඔහු තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්‍ම විනයෙහි ශ්‍රද්ධාව සමාදන් විය. සීලය සමාදන් විය. ශ්‍රැතය සමාදන් විය. ත්‍යාගය සමාදන් විය. ප්‍රඥාව සමාදන් විය. ඔහු තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්‍ම විනයෙහි ශ්‍රද්ධාව සමාදන් වී, සීලය සමාදන් වී, ශ්‍රැතය සමාදන් වී, ත්‍යාගය සමාදන් වී, ප්‍රඥාව සමාදන් වී, කය බිඳී මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයෙහි තව්තිසා දෙවියන්ගේ සහභාගිත්වය පිණිස උපන්නේය. හෙතෙම වර්ණයෙන්ද, යසසින්ද අන් දෙවියන් අතිශයින් ඉක්මවා සිටී. මහණෙනි, එහිදී තව්තිසා දෙවියෝ ඒ දේවපුත්‍රයා පිළිබඳව කිපී, විරෝධය පළකර, නින්දා කරමින් මෙසේ කීහ: ‘අහෝ, පුදුම සහගතය! අහෝ, ආශ්චර්යය! මේ දේවපුත්‍රයා පෙර මනුෂ්‍යයෙක්ව සිටියදී මනුෂ්‍යයන් අතර දිළිඳු විය. මනුෂ්‍යයන් අතර අසරණ විය. මනුෂ්‍යයන් අතර අභාග්‍ය සම්පන්න විය. හෙතෙම කය බිඳී මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයෙහි තව්තිසා දෙවියන්ගේ සහභාගිත්වය පිණිස උපන්නේය. හෙතෙම වර්ණයෙන්ද, යසසින්ද අන් දෙවියන් අතිශයින් ඉක්මවා සිටී!’”\n\n“මහණෙනි, එකල්හි ශක්‍ර දේවේන්ද්‍රයා තව්තිසා දෙවියන් අමතා මෙසේ කීයේය: ‘පින්වතුනි, නුඹලා මේ දේවපුත්‍රයාට කිපී, විරෝධය පළකර, නින්දා නොකරවු. පින්වතුනි, මේ දේවපුත්‍රයා පෙර මනුෂ්‍යයෙක්ව සිටියදී තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්‍ම විනයෙහි ශ්‍රද්ධාව සමාදන් විය. සීලය සමාදන් විය. ශ්‍රැතය සමාදන් විය. ත්‍යාගය සමාදන් විය. ප්‍රඥාව සමාදන් විය. ඔහු තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්‍ම විනයෙහි ශ්‍රද්ධාව සමාදන් වී, සීලය සමාදන් වී, ශ්‍රැතය සමාදන් වී, ත්‍යාගය සමාදන් වී, ප්‍රඥාව සමාදන් වී, කය බිඳී මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයෙහි තව්තිසා දෙවියන්ගේ සහභාගිත්වය පිණිස උපන්නේය. හෙතෙම වර්ණයෙන්ද, යසසින්ද අන් දෙවියන් අතිශයින් ඉක්මවා සිටී!’”\n\nමහණෙනි, එකල්හි ශක්‍ර දේවේන්ද්‍රයා තව්තිසා දෙවියන් සනසමින් ඒ අවස්ථාවේදී මේ ගාථා පැවසුවේය:\n\nයමකුට තථාගතයන් වහන්සේ කෙරෙහි අචල වූ, මැනවින් පිහිටි ශ්‍රද්ධාවක් ඇත්ද,\nයමකුගේ සීලය යහපත් වූ, ආර්යයන් වහන්සේලා ප්‍රිය කරන, ප්‍රශංසනීය වූ සීලයක් වේද,\n\nයමකුට සංඝයා කෙරෙහි පැහැදීමක් ඇත්ද, ඔහුගේ දර්ශනය අවංක වූවක් වේද,\nඔහුව ‘දිළිඳු නොවේ’ යයි පණ්ඩිතයෝ කියති. ඔහුගේ ජීවිතය නිෂ්ඵල නොවූවක් වන්නේය.\n\nඑබැවින් ප්‍රඥාවන්තයා බුදුවරුන්ගේ ශාසනය සිහි කරමින්,\nශ්‍රද්ධාවද, සීලයද, (සංඝයා කෙරෙහි) පැහැදීමද, ධර්‍මය පිළිබඳ නිවැරදි දර්ශනයද නිතරම අනුයන්නේය.",
      "paliTitle": "Daliddasuttaṃ",
      "englishTitle": "The Discourse on the Poor",
      "sinhalaTitle": "දලිද්ද සූත්‍රය"
    },
    {
      "number": 261,
      "pali": "Sāvatthiyaṃ jetavane. Atha kho sakko devānamindo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho sakko devānamindo bhagavantaṃ etadavoca – ‘‘kiṃ nu kho, bhante, bhūmirāmaṇeyyaka’’nti? ‘‘Ārāmacetyā vanacetyā, pokkharañño sunimmitā; Manussarāmaṇeyyassa, kalaṃ nāgghanti soḷasiṃ. ‘‘Gāme vā yadi vāraññe, ninne vā yadi vā thale; Yattha arahanto viharanti, taṃ bhūmirāmaṇeyyaka’’nti.",
      "english": "In Jeta's Grove, at Savatthi. Then Sakka, king of the devas, approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, Sakka, king of the devas, said to the Blessed One: \"What indeed, venerable sir, is a delightful spot of land?\"\n\n\"Shrines in groves, shrines in forests, and well-constructed lotus ponds are not worth a sixteenth part of true human delight. Whether in a village or in a forest, in a low place or on high ground, wherever Arahants dwell, that is truly a delightful spot of land.\"",
      "sinhala": "සැවැත්නුවර ජේතවනාරාමයේදී. ඉන්පසු දෙවියන්ට අධිපති ශක්‍රයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර, එකත්පස්ව සිටගත්තේය. එකත්පස්ව සිටගෙන සිටි දෙවියන්ට අධිපති ශක්‍රයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය –\n\n‘‘ස්වාමීනි, රමණීය භූමියක් නම් කවරක්දැයි?’’\n\n‘‘ආරාම චෛත්‍යයන් ද, වනාන්තර චෛත්‍යයන් ද, මනාව සාදන ලද පොකුණු ද, මිනිසුන්ගේ රමණීය භූමියක සොළොස්වගින් එකක් තරම් වටින්නේ නැත. ගමක හෝ අරණ්‍යයක හෝ, පහත් බිමක හෝ උස් බිමක හෝ, යම් තැනක අරහතුන් වහන්සේලා වැඩසිටිත් ද, එයම රමණීය භූමියයි.’’",
      "paliTitle": "Rāmaṇeyyakasuttaṃ",
      "englishTitle": "The Discourse on Delightfulness",
      "sinhalaTitle": "රාමණෙය්‍යක සූත්‍රය"
    },
    {
      "number": 262,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati gijjhakūṭe pabbate. Atha kho sakko devānamindo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho sakko devānamindo bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Yajamānānaṃ manussānaṃ, puññapekkhāna pāṇinaṃ; Karotaṃ opadhikaṃ puññaṃ, kattha dinnaṃ mahapphala’’nti. ‘‘Cattāro ca paṭipannā, cattāro ca phale ṭhitā; Esa saṅgho ujubhūto, paññāsīlasamāhito. ‘‘Yajamānānaṃ manussānaṃ, puññapekkhāna pāṇinaṃ; Karotaṃ opadhikaṃ puññaṃ, saṅghe dinnaṃ mahapphala’’nti.",
      "english": "On one occasion, the Blessed One was dwelling in Rājagaha, on Vulture Peak Mountain. Then Sakka, ruler of the devas, approached the Blessed One; having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, Sakka, ruler of the devas, addressed the Blessed One with a verse:\n\n\"For humans who make offerings, for beings seeking merit, for those performing merit that leads to renewed existence, where is a gift bestowed most greatly fruitful?\"\n\n\"There are four who are on the path, and four who are established in the fruits. This Sangha is upright, endowed with wisdom and virtue. For humans who make offerings, for beings seeking merit, for those performing merit that leads to renewed existence, a gift bestowed upon the Sangha is greatly fruitful.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර ගිජුකුළු පව්වෙහි වැඩවසන සේක. එකල්හි දෙවියන්ගේ අධිපති වූ ශක්‍රයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙක සිටියේය. එකත්පසෙක සිටි දෙවියන්ගේ අධිපති වූ ශක්‍රයා භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසීය: ‘‘පින් අපේක්‍ෂා කරන්නා වූ, උපධි සහිත පින්කම් කරන්නා වූ, යැදුම් කරන මනුෂ්‍යයන්ට, කොතැනට දුන් දානය මහත් ඵල දාරක වේද?’’\n\n‘‘මාර්ගයට පිළිපන් සිව්දෙනෙක් ද, ඵලයට පැමිණ සිටි සිව්දෙනෙක් ද ඇත්තාහ. ඒ සංඝයා ඍජු ගති ඇත්තෙකි, ප්‍රඥාවෙන් හා සීලයෙන් සමන්විතය. පින් අපේක්‍ෂා කරන්නා වූ, උපධි සහිත පින්කම් කරන්නා වූ, යැදුම් කරන මනුෂ්‍යයන්ට, සංඝයාට දුන් දානය මහත් ඵල දාරක වේ.’’",
      "paliTitle": "Yajamānasuttaṃ",
      "englishTitle": "The Discourse on the Sacrificer",
      "sinhalaTitle": "යජමාන සූත්‍රය"
    },
    {
      "number": 263,
      "pali": "Sāvatthiyaṃ jetavane. Tena kho pana samayena bhagavā divāvihāragato hoti paṭisallīno. Atha kho sakko ca devānamindo brahmā ca sahampati yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā paccekaṃ dvārabāhaṃ nissāya aṭṭhaṃsu. Atha kho sakko devānamindo bhagavato santike imaṃ gāthaṃ abhāsi – ‘‘Uṭṭhehi vīra vijitasaṅgāma, Pannabhāra anaṇa vicara loke; Cittañca te suvimuttaṃ, Cando yathā pannarasāya ratti’’nti. ‘‘Na kho, devānaminda, tathāgatā evaṃ vanditabbā. Evañca kho, devānaminda, tathāgatā vanditabbā – ‘‘Uṭṭhehi vīra vijitasaṅgāma, Satthavāha anaṇa vicara loke; Desassu bhagavā dhammaṃ, Aññātāro bhavissantī’’ti.",
      "english": "In Jetavana at Savatthi. Now at that time, the Blessed One was abiding during the day in solitary retreat.\n\nThen Sakka, lord of devas, and Brahma Sahampati approached to where the Blessed One was. Having approached, each one stood leaning against a doorpost.\n\nThen Sakka, lord of devas, uttered this verse in the presence of the Blessed One:\n“Arise, O Hero, who has conquered the battle! Having laid down the burden, free from debt, wander in the world! Your mind is perfectly liberated, like the moon on the fifteenth night.”\n\n“Indeed, O lord of devas, Tathagatas should not be praised thus. But Tathagatas, O lord of devas, should be praised thus:\n“Arise, O Hero, who has conquered the battle! Leader of the caravan, free from debt, wander in the world! May the Blessed One teach the Dhamma, and there will be those who will understand!”",
      "sinhala": "සැවැත් නුවර ජේතවනාරාමයේදී. ඒ වන විට භාග්‍යවතුන් වහන්සේ දහවල් විහරණය සඳහා एकांतව වැඩ සිටියහ. ඉක්බිති දෙවියන්ගේ අධිපති වූ ශක්‍ර දෙවෙන්ද්‍රයා සහ සහම්පති බ්‍රහ්මා භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට පැමිණියහ; පැමිණ, ඔවුහු එක් එක් අය දොරකඩ අල්ලක් ගසාගෙන සිටගත්හ. ඉක්බිති ශක්‍ර දෙවෙන්ද්‍රයා භාග්‍යවතුන් වහන්සේට මෙහි ළඟදී මේ ගාථාව ප්‍රකාශ කළේය –\n\n‘‘වීරයාණෙනි, කෙලෙස් සටනින් ජයගත් තැනැත්තාණෙනි, නැඟී සිටුව! (සංසාර) බර බැහැර කර, (සංසාර) ණයෙන් මිදී ලෝකයෙහි හැසිරෙන්න! ඔබේ සිත ඉතා මැනවින් නිදහස් වී ඇත, පහළොස්වක පොහොය දා රාත්‍රියේ හඳ මෙන්.’’\n\n‘‘දෙවෙන්ද්‍රය, තථාගතයන් වහන්සේලා මෙලෙස වන්දනා නොකළ යුතුයි. දෙවෙන්ද්‍රය, තථාගතයන් වහන්සේලා මෙලෙස වන්දනා කළ යුතුයි –\n\n‘‘වීරයාණෙනි, කෙලෙස් සටනින් ජයගත් තැනැත්තාණෙනි, නැඟී සිටුව! (ධර්ම) සත්ථවාහයාණෙනි, (සංසාර) ණයෙන් මිදී ලෝකයෙහි හැසිරෙන්න! භාග්‍යවතුන් වහන්සේ ධර්මය දේශනා කරනු මැනව, අවබෝධ කරගන්නෝ සිටිති.’’",
      "paliTitle": "Buddhavandanāsuttaṃ",
      "englishTitle": "Homage to the Buddha Sutta",
      "sinhalaTitle": "බුද්ධ වන්දනා සූත්‍රය"
    },
    {
      "number": 264,
      "pali": "Sāvatthiyaṃ. Tatra…pe… etadavoca – ‘‘bhūtapubbaṃ, bhikkhave, sakko devānamindo mātaliṃ saṅgāhakaṃ āmantesi – ‘yojehi, samma mātali, sahassayuttaṃ ājaññarathaṃ. Uyyānabhūmiṃ gacchāma subhūmiṃ dassanāyā’ti. ‘Evaṃ bhaddantavā’ti kho, bhikkhave, mātali saṅgāhako sakkassa devānamindassa paṭissutvā sahassayuttaṃ ājaññarathaṃ yojetvā sakkassa devānamindassa paṭivedesi – ‘yutto kho te, mārisa, sahassayutto ājaññaratho. Yassa dāni kālaṃ maññasī’’’ti. Atha kho, bhikkhave, sakko devānamindo vejayantapāsādā orohanto añjaliṃ katvā [pañjaliko (pī.), pañjaliṃ katvā (ka.)] sudaṃ puthuddisā namassati. Atha kho, bhikkhave, mātali saṅgāhako sakkaṃ devānamindaṃ gāthāya ajjhabhāsi – ‘‘Taṃ namassanti tevijjā, sabbe bhummā ca khattiyā; Cattāro ca mahārājā, tidasā ca yasassino; Atha ko nāma so yakkho, yaṃ tvaṃ sakka namassasī’’ti. ‘‘Maṃ namassanti tevijjā, sabbe bhummā ca khattiyā; Cattāro ca mahārājā, tidasā ca yasassino. ‘‘Ahañca sīlasampanne, cirarattasamāhite; Sammāpabbajite vande, brahmacariyaparāyane. ‘‘Ye gahaṭṭhā puññakarā, sīlavanto upāsakā; Dhammena dāraṃ posenti, te namassāmi mātalī’’ti. ‘‘Seṭṭhā hi kira lokasmiṃ, ye tvaṃ sakka namassasi; Ahampi te namassāmi, ye namassasi vāsavā’’ti. ‘‘Idaṃ vatvāna maghavā, devarājā sujampati; Puthuddisā namassitvā, pamukho rathamāruhī’’ti.",
      "english": "Formerly, bhikkhus, Sakka, King of Devas, addressed Mātali the charioteer: ‘Harness, good Mātali, the thousand-yoked splendid chariot. Let us go to the pleasure grounds to see the delightful landscape.’\n\n‘Yes, venerable one,’ bhikkhus, Mātali the charioteer, having assented to Sakka, King of Devas, harnessed the thousand-yoked splendid chariot and reported to Sakka, King of Devas: ‘Your thousand-yoked splendid chariot is harnessed, sir. Now you may do as you deem fit.’\n\nThen, bhikkhus, Sakka, King of Devas, descending from the Vejayanta Palace, made an añjali (reverential gesture) and saluted in various directions.\n\nThen, bhikkhus, Mātali the charioteer addressed Sakka, King of Devas, with a verse: ‘You are worshipped by those with the three knowledges, by all earthly rulers, by the Four Great Kings, and by the glorious thirty-three devas. So who is this yakkha that you, Sakka, venerate?’\n\n‘I am worshipped by those with the three knowledges, by all earthly rulers, by the Four Great Kings, and by the glorious thirty-three devas.\n\n‘But I, however, venerate those who are accomplished in virtue, who have been steadfastly tranquil for a long time, who have rightly gone forth, and who are devoted to the holy life.\n\n‘And those householders who are merit-doers, virtuous lay followers, and who maintain their families righteously – them I venerate, Mātali.’\n\n‘Indeed, those whom you, Sakka, venerate are truly supreme in the world. I too will venerate those whom you venerate, O Vāsava.’\n\nHaving said this, Maghavā, the King of Devas, the Lord of Sujā, having saluted in various directions, then mounted the chariot.",
      "sinhala": "සැවැත්නුවරදී. එහිදී... ආදී වශයෙන්... මෙසේ වදාළ සේක:\n\n\"මහණෙනි, පෙර කලෙක සක් දෙවිඳු මාතලී සංග්‍රාහකයා අමතා මෙසේ කීය: ‘ඇවැත් මාතලී, දහසක් අසුන් යෙදූ ආජානීය රථය සූදානම් කරව. අපි සුන්දර භූමියක් දැකීමට උයනට යමු’\" ‘එසේය, ස්වාමීනි’යි කියා, මහණෙනි, මාතලී සංග්‍රාහකයා සක් දෙවිඳුට පිළිතුරු දී, දහසක් අසුන් යෙදූ ආජානීය රථය සූදානම් කර, සක් දෙවිඳුට මෙසේ දැන්වීය: ‘පින්වත්නි, ඔබගේ දහසක් අසුන් යෙදූ ආජානීය රථය සූදානම්ය. දැන් ඔබ සුදුසු යැයි සිතන කල්හී (ගමන් කරනු)’ එවිට, මහණෙනි, සක් දෙවිඳු වෛජයන්ත ප්‍රාසාදයෙන් බසිනා කල, දොහොත් මුදුන් තබා දස දිශාවට නමස්කාර කළේය. එවිට, මහණෙනි, මාතලී සංග්‍රාහකයා සක් දෙවිඳුට ගාථාවකින් මෙසේ කීය:\n\n‘‘ඔබට නම් ත්‍රිවේදීහු ද, පොළොවේ සිටින සියලුම ක්‍ෂත්‍රියයෝ ද,\nසතර වරම් මහ රජවරු ද, යසස් ඇත්තා වූ දෙතිස් දෙව්වරු ද වඳිති.\nඑසේ නම්, සක්දෙවිඳුනි, ඔබ යම් යක්ෂයෙකුට වඳින්නෙහි ද, ඔහු කවර නම් කෙනෙක් ද?’’\n\n‘‘මාහට ත්‍රිවේදීහු ද, පොළොවේ සිටින සියලුම ක්‍ෂත්‍රියයෝ ද,\nසතර වරම් මහ රජවරු ද, යසස් ඇත්තා වූ දෙතිස් දෙව්වරු ද වඳිති.\nඑහෙත් මම සිල්වත් වූ ද, දීර්ඝ කාලයක් සමාධියෙන් යුක්ත වූ ද, සම්‍යක් ප්‍රවෘජ්‍යාවෙන් යුක්ත වූ ද, බ්‍රහ්මචර්යාව පරමායනය කොට ඇත්තා වූ ද (උතුමන්ට) වඳිමි.\nයම් ගිහියෝ පින්කම් කරන්නෝ ද, සිල්වත් උපාසක උපාසිකාවෝ ද, ධාර්මිකව දූ දරුවන් පෝෂණය කරන්නෝ ද, මාතලී, මම ඔවුනට වඳිමි’’\n\n‘‘සක්දෙවිඳුනි, ඔබ යම් අයට වඳින්නෙහි ද, ඔවුහු සැබවින්ම ලෝකයේ ශ්‍රේෂ්ඨයෝ ය. වසව, ඔබ යම් අයට වඳින්නෙහි ද, මම ද ඔවුනට වඳිමි’’\n\nමේ කාරණය කියා, මඝවා නම් වූ, සුජාපති නම් වූ, දෙරජ තෙමේ, දස දිශාවට නමස්කාර කොට, පෙරමුණේ සිට රියට නැග්ගේය.",
      "paliTitle": "Gahaṭṭhavandanāsuttaṃ",
      "englishTitle": "The Layman's Homage Sutta",
      "sinhalaTitle": "ගහට්ඨවන්දනා සූත්‍රය"
    },
    {
      "number": 265,
      "pali": "Sāvatthiyaṃ jetavane. ‘‘Bhūtapubbaṃ, bhikkhave, sakko devānamindo mātaliṃ saṅgāhakaṃ āmantesi – ‘yojehi, samma mātali, sahassayuttaṃ ājaññarathaṃ, uyyānabhūmiṃ gacchāma subhūmiṃ dassanāyā’ti. ‘Evaṃ bhaddantavā’ti kho, bhikkhave, mātali saṅgāhako sakkassa devānamindassa paṭissutvā sahassayuttaṃ ājaññarathaṃ yojetvā sakkassa devānamindassa paṭivedesi – ‘yutto kho te, mārisa, sahassayutto ājaññaratho. Yassa dāni kālaṃ maññasī’’’ti. Atha kho, bhikkhave, sakko devānamindo vejayantapāsādā orohanto añjaliṃ katvā sudaṃ bhagavantaṃ namassati. Atha kho, bhikkhave, mātali saṅgāhako sakkaṃ devānamindaṃ gāthāya ajjhabhāsi – ‘‘Yañhi devā manussā ca, taṃ namassanti vāsava; Atha ko nāma so yakkho, yaṃ tvaṃ sakka namassasī’’ti. ‘‘Yo idha sammāsambuddho, asmiṃ loke sadevake; Anomanāmaṃ satthāraṃ, taṃ namassāmi mātali. ‘‘Yesaṃ rāgo ca doso ca, avijjā ca virājitā; Khīṇāsavā arahanto, te namassāmi mātali. ‘‘Ye rāgadosavinayā, avijjāsamatikkamā; Sekkhā apacayārāmā, appamattānusikkhare; Te namassāmi mātalī’’ti. ‘‘Seṭṭhā hi kira lokasmiṃ, ye tvaṃ sakka namassasi; Ahampi te namassāmi, ye namassasi vāsavā’’ti. ‘‘Idaṃ vatvāna maghavā, devarājā sujampati; Bhagavantaṃ namassitvā, pamukho rathamāruhī’’ti.",
      "english": "In Sāvatthī, at the Jeta Grove.\n“Formerly, monks, Sakka, the king of devas, addressed Mātali the charioteer: ‘Harness, dear Mātali, the thousand-yoked royal chariot. Let us go to a pleasure garden to see a beautiful spot.’ ‘So be it, good sir,’ monks, Mātali the charioteer, having assented to Sakka, the king of devas, and having harnessed the thousand-yoked royal chariot, reported to Sakka, the king of devas: ‘Your thousand-yoked royal chariot is now harnessed, dear sir. You may now do as you deem fit.’”\n\nThen, monks, Sakka, the king of devas, as he was descending from the Vejayanta Palace, respectfully paid homage to the Blessed One, having made a reverential gesture with his hands. Then, monks, Mātali the charioteer addressed Sakka, the king of devas, with a verse:\n\n“Indeed, O Vāsava, devas and humans alike pay homage to you. So who then is that being, O Sakka, to whom you pay homage?”\n\n“He who is the Perfectly Self-Awakened One here in this world, together with its devas; that Teacher of incomparable fame, Mātali, to him I pay homage.”\n\n“Those in whom lust, hatred, and ignorance have been eradicated; those with taints destroyed, the Arahants—to them, Mātali, I pay homage.”\n\n“Those who are training to subdue lust and hatred, who are transcending ignorance; the trainees who delight in the gradual reduction of defilements and diligently practice; to them, Mātali, I pay homage.”\n\n“Indeed, O Sakka, those to whom you pay homage are truly supreme in the world. I too pay homage to those to whom you, O Vāsava, pay homage.”\n\nHaving said this, Maghavā, the king of devas, the lord of Sujā, having paid homage to the Blessed One, then mounted the chariot and departed.",
      "sinhala": "සැවැත් නුවර ජේතවනාරාමයේදී.\n\n\"භූතපූර්වයෙහි, මහණෙනි, දෙවියන්ට අධිපති වූ ශක්‍රයා මාතලී නම් සාරථියා ඇමතුවේය – 'ඇවැත් මාතලිය, දහසක් අශ්වයන් බැඳි අශ්ව රථය යොදවනු මැනවි. සුන්දර බිමක් දැකීම පිණිස අපි උයනට යමු' කියායි. 'එසේය, ස්වාමීනි'යි කියා, මහණෙනි, මාතලී සාරථියා දෙවියන්ට අධිපති වූ ශක්‍රයාට පිළිතුරු දී, දහසක් අශ්වයන් බැඳි අශ්ව රථය යොදවා, දෙවියන්ට අධිපති වූ ශක්‍රයාට දැන්වීය – 'ස්වාමීනි, ඔබට දහසක් අශ්වයන් බැඳි අශ්ව රථය යොදවා තිබේ. දැන් යම් වේලාවක් යැයි ඔබ සිතන්නේද, එයට වේලාවයි' කියායි.\"\n\nඑවිට, මහණෙනි, දෙවියන්ට අධිපති වූ ශක්‍රයා වෛජයන්ත ප්‍රාසාදයෙන් බසින්නේ, දෙඅත් එක්කොට භාග්‍යවතුන් වහන්සේට වන්දනා කළේය.\n\nඑවිට, මහණෙනි, මාතලී සාරථියා දෙවියන්ට අධිපති වූ ශක්‍රයාට ගාථාවකින් මෙසේ කීය – \"යම් කෙනෙකුට දෙවියෝද, මනුෂ්‍යයෝද වඳින්නෝද, ඒ ඔබ වඳින්නේ කවර නම් යක්‍ෂයෙකුටද, වසව?\"\n\n\"මාතලිය, යම් කෙනෙක් මෙලොව දෙවියන් සහිත ලෝකයෙහි, මනාව අවබෝධ කළ, අනුපමේය වූ, අග්‍ර වූ ශාස්තෘවරයෙක් වේද, මම උන්වහන්සේට වඳිමි.\"\n\n\"මාතලිය, යම් කෙනෙකුන්ගේ රාගයද, ද්වේෂයද, අවිද්‍යාවද දුරු වී ඇත්තේද, කෙලෙස් ක්ෂය කළ රහතුන් වහන්සේලා වූ ඔවුන්ට මම වඳිමි.\"\n\n\"මාතලිය, යම් කෙනෙක් රාගය සහ ද්වේෂය දුරු කිරීමට පුරුදු වන්නාහුද, අවිද්‍යාව ඉක්මවා යෑම පිණිස යත්න දරන්නාහුද, එනම් ශික්ෂා මාර්ගයෙහි සිටිනාහුද, (කෙලෙස්) ක්ෂය කිරීමෙහි ඇලුනාහුද, අප්‍රමාදව (සිහි නුවණින්) පුහුණු වන්නාහුද, මම ඔවුන්ට වඳිමි.\"\n\n\"ශක්‍රය, ඇත්ත වශයෙන්ම යම් කෙනෙකුට ඔබ වඳින්නේද, ඔව්හු ලෝකයෙහි ශ්‍රේෂ්ඨයෝ වන්නාහ. වසව, ඔබ යම් කෙනෙකුට වඳින්නේද, මමද ඔවුන්ට වඳිමි\" කියායි.\n\nමේ බව කියා, දෙවි රජු වූ මඝවා ශක්‍රයා, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, රථයට නැගී පිටත් විය.",
      "paliTitle": "Satthāravandanāsuttaṃ",
      "englishTitle": "The Discourse on Homage to the Teacher",
      "sinhalaTitle": "සත්ථාරවන්දනා සූත්‍රය"
    },
    {
      "number": 266,
      "pali": "Sāvatthiyaṃ jetavane. Tatra kho…pe… etadavoca – ‘‘bhūtapubbaṃ, bhikkhave, sakko devānamindo mātaliṃ saṅgāhakaṃ āmantesi – ‘yojehi, samma mātali, sahassayuttaṃ ājaññarathaṃ, uyyānabhūmiṃ gacchāma subhūmiṃ dassanāyā’ti. ‘Evaṃ bhaddantavā’ti kho, bhikkhave, mātali saṅgāhako sakkassa devānamindassa paṭissutvā, sahassayuttaṃ ājaññarathaṃ yojetvā sakkassa devānamindassa paṭivedesi – ‘yutto kho te, mārisa, sahassayutto ājaññaratho, yassa dāni kālaṃ maññasī’’’ti. Atha kho, bhikkhave, sakko devānamindo vejayantapāsādā orohanto añjaliṃ katvā sudaṃ bhikkhusaṅghaṃ namassati. Atha kho, bhikkhave, mātali saṅgāhako sakkaṃ devānamindaṃ gāthāya ajjhabhāsi – ‘‘Tañhi ete namasseyyuṃ, pūtidehasayā narā; Nimuggā kuṇapamhete, khuppipāsasamappitā. ‘‘Kiṃ nu tesaṃ pihayasi, anāgārāna vāsava; Ācāraṃ isinaṃ brūhi, taṃ suṇoma vaco tavā’’ti. ‘‘Etaṃ tesaṃ pihayāmi, anāgārāna mātali; Yamhā gāmā pakkamanti, anapekkhā vajanti te. ‘‘Na tesaṃ koṭṭhe openti, na kumbhi [na kumbhā (syā. kaṃ. pī. ka.)] na kaḷopiyaṃ [khaḷopiyaṃ (sī.)]; Paraniṭṭhitamesānā [paraniṭṭhitamesanā (syā. kaṃ. ka.)], tena yāpenti subbatā. ‘‘Sumantamantino dhīrā, tuṇhībhūtā samañcarā; Devā viruddhā asurehi, puthu maccā ca mātali. ‘‘Aviruddhā viruddhesu, attadaṇḍesu nibbutā; Sādānesu anādānā, te namassāmi mātalī’’ti. ‘‘Seṭṭhā hi kira lokasmiṃ, ye tvaṃ sakka namassasi; Ahampi te namassāmi, ye namassasi vāsavā’’ti. ‘‘Idaṃ vatvāna maghavā, devarājā sujampati; Bhikkhusaṅghaṃ namassitvā, pamukho rathamāruhī’’ti. Dutiyo vaggo. Tassuddānaṃ – Devā pana [va tapadena (sī. syā. kaṃ.)] tayo vuttā, daliddañca rāmaṇeyyakaṃ; Yajamānañca vandanā, tayo sakkanamassanāti.",
      "english": "In Sāvatthī, at Jetavana. There, indeed, the Blessed One addressed the bhikkhus, saying:\n\n\"Formerly, bhikkhus, Sakka, lord of devas, addressed Mātali the charioteer, saying: 'Harness, dear Mātali, the thousand-yoked excellent chariot; let us go to the pleasure grounds to see a pleasant spot.'\n\n'Yes, revered sir,' indeed, bhikkhus, Mātali the charioteer, having assented to Sakka, lord of devas, and having harnessed the thousand-yoked excellent chariot, announced to Sakka, lord of devas: 'Your thousand-yoked excellent chariot is harnessed, sir; now you may do as you deem fit.'\n\nThen, indeed, bhikkhus, Sakka, lord of devas, as he was descending from the Vejayanta Palace, raised his hands in veneration and bowed to the community of bhikkhus.\n\nThen, indeed, bhikkhus, Mātali the charioteer addressed Sakka, lord of devas, with a verse:\n\n'Indeed, these people (you bow to) are mortals lying in a putrid body; they are sunk in this corpse, afflicted by hunger and thirst. What do you admire in them, Sakka, these homeless ones? Tell us the conduct of these sages; we will listen to your words.'\n\n'This is what I admire in them, Mātali, in these homeless ones: From whatever village they depart, they go on without attachment. They do not store grain in their granaries, nor in pots, nor in jars. They seek only what has been prepared by others; with that, these virtuous ones sustain themselves. They are wise and possess well-practiced minds, and they wander about in silence. Devas are at enmity with asuras, and many mortals too are at enmity, Mātali. But they are without enmity among those who are hostile; they are completely liberated among those who use violence; they are without grasping among those who grasp. I bow to them, Mātali.'\n\n'Indeed, they are the best in the world, those whom you, Sakka, venerate. I too venerate them, those whom you, Vāsava, venerate.'\n\nHaving said this, Maghavā, the King of Devas, husband of Sujā, having venerated the community of bhikkhus, rode forth on his chariot.\"",
      "sinhala": "ශ්‍රාවස්තියේ ජේතවනාරාමයෙහි (විසින් වැඩසිටින සමයෙහි)... එහිදී භාග්‍යවතුන් වහන්සේ මේ දේශනාව වදාළ සේක: \"මහණෙනි, පෙර කලෙක ශක්‍ර දේවේන්ද්‍රයා මාතලී නම් සාරථි අමතා, 'මාතලී, දහසක් අසුන් යෙදූ, ආජානීය අශ්වයන්ගෙන් යුත් රථය සූදානම් කරව. අපි සුන්දර භූමියක් දැකීමට උයන බිමකට යමු'යි කීවේය. මහණෙනි, 'එසේය, ස්වාමීනි'යි මාතලී සාරථි ශක්‍ර දේවේන්ද්‍රයාට පිළිතුරු දී, දහසක් අසුන් යෙදූ ආජානීය රථය සූදානම් කොට, ශක්‍ර දේවේන්ද්‍රයාට දැන්වූයේ, 'ස්වාමීනි, ඔබට දහසක් අසුන් යෙදූ ආජානීය රථය සූදානම් කර ඇත. ඔබ දැන් යාමට සුදුසු යැයි සිතන වෙලාව මෙයයි' කියාය.\"\n\nමහණෙනි, එකල්හි ශක්‍ර දේවේන්ද්‍රයා වෛජයන්ත ප්‍රාසාදයෙන් බසින්නේ, දෝත නගා භික්ෂුසංඝයාට නමස්කාර කළේය. මහණෙනි, එකල්හි මාතලී සාරථි ශක්‍ර දේවේන්ද්‍රයාට ගාථාවකින් මෙසේ කීවේය: \"දුගඳ හමන, දිරන ශරීර ඇති, මේ කුණුපයෙහි ගිලී, කුසගින්නෙන් හා පිපාසයෙන් පෙළෙන මේ මිනිසුන්ට ඔබ නමස්කාර කරන්නේ ද? වසු (ශක්‍ර), ඔබ මේ අනගාරිකයන්ට කුමක් නිසා නම් ප්‍රාර්ථනා කරන්නේ ද? ඒ ඍෂිවරුන්ගේ ආචාර ධර්ම අපට කියනු මැනව. අපි ඔබේ වචනය අසමු.\"\n\n\"මාතලී, මම මේ අනගාරිකයන්ට ප්‍රාර්ථනා කරන්නේ මේ කරුණයි. ඔවුහු යම් ගමකින් නික්ම යන්නේ ද, කිසිදු අපේක්ෂාවකින් තොරව ඔවුහු යති. ඔවුහු ගබඩාවල ආහාර ගබඩා නොකරති. කළවල හෝ බඳුන්වල ගබඩා නොකරති. අනුන් විසින් පිළියෙල කරන ලද දේ සොයාගෙන, එයිනිදු යැපෙමින්, ඔවුහු යහපත් ව්‍රතධාරීව දිවි ගෙවති. ඔවුහු මනා උපදෙස් ඇති, ධීමත් වූ, නිශ්ශබ්දව හැසිරෙන්නෝ වෙති. මාතලී, දෙවිවරු අසුරයන් සමඟ ද, නොයෙකුත් මනුෂ්‍යයෝ ද (එකිනෙකා සමඟ) විරුද්ධ වෙති. මාතලී, අරගල කරන්නන් අතරේ අරගල නොකරන, දඬුමුගුරු ගන්නන් (හිංසා කරන්නන්) අතරේ නිවී සැනසී සිටින, ඇලීම් ඇති අය අතරේ කිසිවකට නොඇලෙන ඒ අයට මම නමස්කාර කරමි.\"\n\n\"ශක්‍ර, ඔබ යමෙකුට නමස්කාර කරන්නේ ද, සැබැවින්ම ඔවුහු ලෝකයෙහි ශ්‍රේෂ්ඨයෝ ය. වසු, ඔබ යමෙකුට නමස්කාර කරන්නේ ද, මම ද ඒ අයට නමස්කාර කරමි.\"\n\n\"මේ කරුණු කියා, මඝවා, සුජාපති නම් වූ දේවරාජයා, භික්ෂුසංඝයාට නමස්කාර කොට, (රථයෙහි) පෙරමුණ ගෙන රථයට නැංගේය.\"\n\nදෙවෙනි වර්ගය. එහි උද්දානය නම්: දෙවිවරු තිදෙනෙක් කියන ලදී, දරිද්‍රයා සහ රමණීය දේ, යජමාන සහ වන්දනා යන කතා, ශක්‍ර නමස්කාර කිරීම් තුනක් ද වේ.",
      "paliTitle": "Saṅghavandanāsuttaṃ",
      "englishTitle": "The Discourse on Homage to the Saṅgha",
      "sinhalaTitle": "සංඝවන්දනා සූත්‍රය"
    },
    {
      "number": 267,
      "pali": "Sāvatthiyaṃ jetavane. Atha kho sakko devānamindo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho sakko devānamindo bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kiṃsu chetvā sukhaṃ seti, kiṃsu chetvā na socati; Kissassu ekadhammassa, vadhaṃ rocesi gotamā’’ti. ‘‘Kodhaṃ chetvā sukhaṃ seti, kodhaṃ chetvā na socati; Kodhassa visamūlassa, madhuraggassa vāsava; Vadhaṃ ariyā pasaṃsanti, tañhi chetvā na socatī’’ti.",
      "english": "At Sāvatthī, in the Jeta Grove. Then Sakka, the ruler of devas, approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. Standing to one side, Sakka, the ruler of devas, addressed the Blessed One with a verse: \"What, having cut off, does one sleep happily? What, having cut off, does one not sorrow? The destruction of what single quality do you commend, Gotama?\" \"Having cut off anger, one sleeps happily. Having cut off anger, one does not sorrow. The destruction of anger, whose root is poison and whose tip is sweet, Vāsava – this the noble ones praise. For having cut that off, one does not sorrow.\"",
      "sinhala": "සැවැත්නුවර ජේතවනාරාමයෙහිදී. එවිට සක් දෙවිඳුෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව සිට ගත්හ. එකත්පස්ව සිටි සක් දෙවිඳුෝ භාග්‍යවතුන් වහන්සේට මේ ගාථාවෙන් කතා කළහ – ‘‘කුමක් සිඳ සුවසේ නිදන්නෙහිද, කුමක් සිඳ නොශෝක කරන්නේද? ගෞතමයින් වහන්ස, කවර එකම ධර්මයෙහි නැසීම අගය කරන්නේද?’’\n\n‘‘ක්‍රෝධය සිඳ සුවසේ නිදයි, ක්‍රෝධය සිඳ නොශෝක කරයි; වසව, විෂ මූල ඇති, නමුත් අග්‍රයෙන් මිහිරි වූ ක්‍රෝධයෙහි විනාශය ආර්යයෝ අගය කරති. එය සිඳලීමෙන් ශෝක නොකරයි.’’",
      "paliTitle": "Chetvāsuttaṃ",
      "vagga": "Tatiyavaggo",
      "englishTitle": "The Discourse on Having Cut Off (Killing)",
      "sinhalaTitle": "ඡෙත්වා සූත්‍රය",
      "vaggaEnglish": "Third Chapter",
      "vaggaSinhala": "තතිය වර්ගය"
    },
    {
      "number": 268,
      "pali": "Sāvatthiyaṃ jetavane. Tatra kho…pe… etadavoca – ‘‘bhūtapubbaṃ, bhikkhave, aññataro yakkho dubbaṇṇo okoṭimako sakkassa devānamindassa āsane nisinno ahosi. Tatra sudaṃ, bhikkhave, devā tāvatiṃsā ujjhāyanti khiyyanti vipācenti – ‘acchariyaṃ vata bho, abbhutaṃ vata, bho! Ayaṃ yakkho dubbaṇṇo okoṭimako sakkassa devānamindassa āsane nisinno’’’ti! Yathā yathā kho, bhikkhave, devā tāvatiṃsā ujjhāyanti khiyyanti vipācenti, tathā tathā so yakkho abhirūpataro ceva hoti dassanīyataro ca pāsādikataro ca. ‘‘Atha kho, bhikkhave, devā tāvatiṃsā yena sakko devānamindo tenupasaṅkamiṃsu; upasaṅkamitvā sakkaṃ devānamindaṃ etadavocuṃ – ‘idha te, mārisa, aññataro yakkho dubbaṇṇo okoṭimako sakkassa devānamindassa āsane nisinno. Tatra sudaṃ, mārisa, devā tāvatiṃsā ujjhāyanti khiyyanti vipācenti – acchariyaṃ vata, bho, abbhutaṃ vata, bho! Ayaṃ yakkho dubbaṇṇo okoṭimako sakkassa devānamindassa āsane nisinnoti. Yathā yathā kho, mārisa, devā ujjhāyanti khiyyanti vipācenti, tathā tathā so yakkho abhirūpataro ceva hoti dassanīyataro ca pāsādikataro cāti. So hi nūna, mārisa, kodhabhakkho yakkho bhavissatī’’’ti. ‘‘Atha kho, bhikkhave, sakko devānamindo yena so kodhabhakkho yakkho tenupasaṅkami; upasaṅkamitvā ekaṃsaṃ uttarāsaṅgaṃ karitvā dakkhiṇajāṇumaṇḍalaṃ pathaviyaṃ nihantvā yena so kodhabhakkho yakkho tenañjaliṃ paṇāmetvā tikkhattuṃ nāmaṃ sāveti – ‘sakkohaṃ mārisa, devānamindo, sakkohaṃ, mārisa, devānamindo’ti. Yathā yathā kho, bhikkhave, sakko devānamindo nāmaṃ sāvesi, tathā tathā so yakkho dubbaṇṇataro ceva ahosi okoṭimakataro ca. Dubbaṇṇataro ceva hutvā okoṭimakataro ca tatthevantaradhāyī’’ti. Atha kho, bhikkhave, sakko devānamindo sake āsane nisīditvā deve tāvatiṃse anunayamāno tāyaṃ velāyaṃ imā gāthāyo abhāsi – ‘‘Na sūpahatacittomhi, nāvattena suvānayo; Na vo cirāhaṃ kujjhāmi, kodho mayi nāvatiṭṭhati. ‘‘Kuddhāhaṃ na pharusaṃ brūmi, na ca dhammāni kittaye; Sanniggaṇhāmi attānaṃ, sampassaṃ atthamattano’’ti.",
      "english": "At Sāvatthī, in Jetavana. There, indeed, he said this:\n\n“Formerly, monks, a certain yakkha, ugly and repulsive, was seated on the throne of Sakka, lord of the devas. There, indeed, monks, the Tāvatiṃsa devas were annoyed, vexed, and outraged, saying, ‘Oh, how astonishing! Oh, how wondrous! This yakkha, ugly and repulsive, is seated on the throne of Sakka, lord of the devas!’ Monks, as much as the Tāvatiṃsa devas were annoyed, vexed, and outraged, so much the more did that yakkha become handsome, pleasant to behold, and charming. Then, monks, the Tāvatiṃsa devas approached Sakka, lord of the devas. Having approached, they said to Sakka, lord of the devas, ‘Here, dear sir, a certain yakkha, ugly and repulsive, is seated on your throne, the throne of Sakka, lord of the devas. There, dear sir, the Tāvatiṃsa devas are annoyed, vexed, and outraged, saying, “Oh, how astonishing! Oh, how wondrous! This yakkha, ugly and repulsive, is seated on the throne of Sakka, lord of the devas!” And the more, dear sir, the devas are annoyed, vexed, and outraged, so much the more does that yakkha become handsome, pleasant to behold, and charming.’ ‘Surely, dear sir, he must be a yakkha who feeds on anger.’”\n\n“Then, monks, Sakka, lord of the devas, approached that yakkha who feeds on anger. Having approached, he arranged his upper robe over one shoulder, knelt on his right knee on the ground, and raising his hands in Añjali towards that yakkha who feeds on anger, he announced his name three times, saying, ‘I am Sakka, dear sir, lord of the devas! I am Sakka, dear sir, lord of the devas!’ Monks, as much as Sakka, lord of the devas, announced his name, so much the more did that yakkha become ugly and repulsive. And having become more ugly and repulsive, he vanished right there.”\n\nThen, monks, Sakka, lord of the devas, having seated himself on his own throne, and reassuring the Tāvatiṃsa devas, on that occasion uttered these verses:\n\n“My mind is not overcome; I am not easily led astray by anger.\nI do not stay angry with you for long; anger does not abide in me.\nWhen angry, I do not speak harsh words, nor do I proclaim doctrines of anger.\nI restrain myself, seeing my own welfare.”",
      "sinhala": "ශ්‍රාවස්තියේ ජේතවනාරාමයේදී එක් කලෙක භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක:\n\n“මහණෙනි, පෙර කලක එක්තරා යක්ෂයෙක් අතිශයින් දුර්වර්ණ වූ, කෘශ වූ, අවලක්ෂණ වූ ස්වභාවයකින් සක් දෙව් රජුගේ ආසනයේ හිඳගෙන සිටියේය. මහණෙනි, එහිදී තව්තිසා දෙවියෝ මහත් අප්‍රසාදයට පත්වෙමින්, විවේචනය කරමින්, දැඩිව දොස් පවරමින් මෙසේ කීහ: ‘පින්වත්නි, මෙය පුදුමයකි! පින්වත්නි, මෙය අද්භූතයකි! මේ අවලක්ෂණ, කෘශ වූ යක්ෂයා සක් දෙව් රජුගේ ආසනයේ හිඳගෙන සිටින්නේය!’ මහණෙනි, තව්තිසා දෙවියන් යම් යම් අයුරින් මහත් අප්‍රසාදයට පත්වෙමින්, විවේචනය කරමින්, දැඩිව දොස් පවරමින් සිටියාද, ඒ ඒ අයුරින් ඒ යක්ෂයා වඩාත් රූමත් විය, වඩාත් දැකුම්කළු විය, වඩාත් ප්‍රසන්න විය.\n\nමහණෙනි, එවිට තව්තිසා දෙවියෝ සක් දෙව් රජු සිටින තැනට ගියහ. එළඹ, සක් දෙව් රජුට මෙසේ කීහ: ‘පින්වත් ස්වාමීනි, මෙහි ඔබගේ ආසනයේ අතිශයින් දුර්වර්ණ වූ, කෘශ වූ, අවලක්ෂණ වූ එක්තරා යක්ෂයෙක් හිඳගෙන සිටී. පින්වත් ස්වාමීනි, එහිදී තව්තිසා දෙවියෝ මහත් අප්‍රසාදයට පත්වෙමින්, විවේචනය කරමින්, දැඩිව දොස් පවරමින් මෙසේ කියති: \"පින්වත්නි, මෙය පුදුමයකි! පින්වත්නි, මෙය අද්භූතයකි! මේ අවලක්ෂණ, කෘශ වූ යක්ෂයා සක් දෙව් රජුගේ ආසනයේ හිඳගෙන සිටින්නේය!\" පින්වත් ස්වාමීනි, දෙවියන් යම් යම් අයුරින් අප්‍රසාදයට පත් වෙමින්, විවේචනය කරමින්, දැඩිව දොස් පවරමින් සිටියාද, ඒ ඒ අයුරින් ඒ යක්ෂයා වඩාත් රූමත් විය, වඩාත් දැකුම්කළු විය, වඩාත් ප්‍රසන්න විය.’ ‘පින්වත් ස්වාමීනි, ඒ යක්ෂයා නම් කෝපයෙන් ජීවත්වන යක්ෂයෙක් විය යුතුයි.’\n\nමහණෙනි, එවිට සක් දෙව් රජු, කෝපයෙන් ජීවත්වන ඒ යක්ෂයා සිටින තැනට ගියේය. එළඹ, උතුරු සළුව එක උරහිසකට තබාගෙන, දකුණු දණහිස පොළොවෙහි තබා, කෝපයෙන් ජීවත්වන ඒ යක්ෂයා දෙසට ඇඳිලි බැඳ, තුන් වරක් තම නම ප්‍රකාශ කළේය: ‘පින්වත්නි, මම දෙවියන්ගේ අධිපති වූ සක් දෙව්මි. පින්වත්නි, මම දෙවියන්ගේ අධිපති වූ සක් දෙව්මි.’ මහණෙනි, සක් දෙව් රජු යම් යම් අයුරින් තම නම ප්‍රකාශ කළේද, ඒ ඒ අයුරින් ඒ යක්ෂයා වඩාත් දුර්වර්ණ විය, වඩාත් කෘශ විය, වඩාත් අවලක්ෂණ විය. වඩාත් දුර්වර්ණ වී, වඩාත් කෘශ වී, වඩාත් අවලක්ෂණ වී එතැනම අතුරුදහන් විය.\n\nමහණෙනි, එවිට සක් දෙව් රජු තම ආසනයේ හිඳගෙන, තව්තිසා දෙවියන් සනසමින්, ඒ වේලාවේදී මේ ගාථා පැවසීය:\n\nමාගේ සිත කෝපයෙන් අතිශයින් පෙලඹී නැත.\nකෝපයේ ආවේගයෙන් මා පහසුවෙන් පෙළඹෙන්නේ නැත.\nකල්පවතින කෝපයක් මා ඔබ කෙරෙහි ඇති කරගන්නේ නැත.\nකෝපය මා තුළ නොරැඳෙයි.\n\nමා කෝප වුවද, රළු වචන කතා නොකරමි.\nගුණ ධර්ම ගැන ප්‍රකාශ නොකරමි.\nමාගේ යහපත මැනවින් අවබෝධ කරගනිමින්,\nමම මා සංවර කරගනිමි.",
      "paliTitle": "Dubbaṇṇiyasuttaṃ",
      "englishTitle": "Ugliness Sutta",
      "sinhalaTitle": "දුබ්බණ්ණිය සූත්‍රය"
    },
    {
      "number": 269,
      "pali": "Sāvatthiyaṃ…pe… bhagavā etadavoca – ‘‘bhūtapubbaṃ, bhikkhave, vepacitti asurindo ābādhiko ahosi dukkhito bāḷhagilāno. Atha kho bhikkhave, sakko devānamindo yena vepacitti asurindo tenupasaṅkami gilānapucchako. Addasā kho, bhikkhave, vepacitti asurindo sakkaṃ devānamindaṃ dūratova āgacchantaṃ. Disvāna sakkaṃ devānamindaṃ etadavoca – ‘tikiccha maṃ devānamindā’ti. ‘Vācehi maṃ, vepacitti, sambarimāya’nti. ‘Na tāvāhaṃ vācemi, yāvāhaṃ, mārisa, asure paṭipucchāmī’’’ti. ‘‘Atha kho, bhikkhave, vepacitti asurindo asure paṭipucchi – ‘vācemahaṃ, mārisā, sakkaṃ devānamindaṃ sambarimāya’nti? ‘Mā kho tvaṃ, mārisa, vācesi sakkaṃ devānamindaṃ sambarimāya’’’nti. Atha kho, bhikkhave, vepacitti asurindo sakkaṃ devānamindaṃ gāthāya ajjhabhāsi – ‘‘Māyāvī maghavā sakka, devarāja sujampati; Upeti nirayaṃ ghoraṃ, sambarova sataṃ sama’’nti.",
      "english": "At Savatthi, the Blessed One said this:\n“Formerly, monks, Vepacitti, the lord of the asuras, was afflicted, suffering, and gravely ill. Then, monks, Sakka, the lord of devas, went to where Vepacitti, the lord of asuras, was, to inquire about his health. Indeed, monks, Vepacitti, the lord of asuras, saw Sakka, the lord of devas, approaching from afar. Having seen Sakka, the lord of devas, he said this: ‘Heal me, O lord of devas!’ ‘Recite for me, Vepacitti, the magic of Sambara!’ ‘I will not recite it just yet, until I have consulted the asuras, good sir.’ Then, monks, Vepacitti, the lord of asuras, consulted the asuras: ‘Should I recite the magic of Sambara to Sakka, the lord of devas, good sirs?’ ‘Do not, good sir, recite the magic of Sambara to Sakka, the lord of devas!’ Then, monks, Vepacitti, the lord of asuras, addressed Sakka, the lord of devas, with a verse:\n‘Sakka, the master of illusion, Maghava, king of devas, husband of Sujā, goes to a frightful hell, just like Sambara, a hundred times over.’”",
      "sinhala": "සැවැත්නුවරදී... භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\nමහණෙනි, පෙර කලෙක වේපචිත්ති අසුරෙන්ද්‍රයා රෝගාතුරව, දුකට පත්ව, මහත් සේ ගිලන්ව සිටියේය.\n\nඑකල්හි මහණෙනි, සක් දෙවිඳු වේපචිත්ති අසුරෙන්ද්‍රයා වෙත රෝගී තොරතුරු විමසීම සඳහා එළඹියේය.\n\nමහණෙනි, වේපචිත්ති අසුරෙන්ද්‍රයා සක් දෙවිඳු දුරදීම එන අයුරු දුටුවේය.\n\nසක් දෙවිඳු දැක ඔහු මේසේ කීවේය: ‘දෙවිඳුනි, මට ප්‍රතිකාර කරන්න.’\n\n‘වේපචිත්ති, සම්බරයාගේ මායාව මට කියන්න.’\n\n‘ආයුෂ්මත්, මම අසුරයන්ගෙන් විමසා නොබලන තාක් දැන්ම ඔබට කියන්නේ නැහැ.’\n\nඑකල්හි මහණෙනි, වේපචිත්ති අසුරෙන්ද්‍රයා අසුරයන්ගෙන් මෙසේ විමසා සිටියේය: ‘ආයුෂ්මත්වරුනි, මම සක් දෙවිඳුට සම්බරයාගේ මායාව කියන්නද?’\n\n‘ආයුෂ්මත්, ඔබ සක් දෙවිඳුට සම්බරයාගේ මායාව නොකියන්න.’\n\nඑකල්හි මහණෙනි, වේපචිත්ති අසුරෙන්ද්‍රයා සක් දෙවිඳුට ගාථාවකින් මෙසේ කීවේය:\n\nමායාකාරී මඝවා වූ සක් දෙව් රජ, සුජාගේ සැමියා, සම්බරයා සේම සිය වරක් භයානක නිරයකට යයි.",
      "paliTitle": "Sambarimāyāsuttaṃ",
      "englishTitle": "The Discourse on Sambari’s Magic",
      "sinhalaTitle": "සම්බරිමායා සූත්‍රය"
    },
    {
      "number": 270,
      "pali": "Sāvatthiyaṃ…pe… ārāme. Tena kho pana samayena dve bhikkhū sampayojesuṃ. Tatreko bhikkhu accasarā. Atha kho so bhikkhu tassa bhikkhuno santike accayaṃ accayato deseti; so bhikkhu nappaṭiggaṇhāti. Atha kho sambahulā bhikkhū yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, dve bhikkhū sampayojesuṃ, tatreko bhikkhu accasarā. Atha kho so, bhante, bhikkhu tassa bhikkhuno santike accayaṃ accayato deseti, so bhikkhu nappaṭiggaṇhātī’’ti. ‘‘Dveme, bhikkhave, bālā. Yo ca accayaṃ accayato na passati, yo ca accayaṃ desentassa yathādhammaṃ nappaṭiggaṇhā’’ti – ime kho, bhikkhave, dve bālā. ‘‘Dveme, bhikkhave, paṇḍitā. Yo ca accayaṃ accayato passati, yo ca accayaṃ desentassa yathādhammaṃ paṭiggaṇhā’’ti – ime kho, bhikkhave, dve paṇḍitā. ‘‘Bhūtapubbaṃ, bhikkhave, sakko devānamindo sudhammāyaṃ sabhāyaṃ deve tāvatiṃse anunayamāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Kodho vo vasamāyātu, mā ca mittehi vo jarā; Agarahiyaṃ mā garahittha, mā ca bhāsittha pesuṇaṃ; Atha pāpajanaṃ kodho, pabbatovābhimaddatī’’ti.",
      "english": "At Sāvatthī, in the monastery, at that time two bhikkhus were engaged in a dispute. Among them, one bhikkhu committed an offense. Then that bhikkhu confessed his offense as an offense to the other bhikkhu, but that bhikkhu did not accept it. Then many bhikkhus approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side. Seated to one side, those bhikkhus said this to the Blessed One: ‘Here, venerable sir, two bhikkhus were engaged in a dispute, and among them, one bhikkhu committed an offense. Then, venerable sir, that bhikkhu confessed his offense as an offense to the other bhikkhu, but that bhikkhu did not accept it.’\n\n‘Monks, these two are foolish: one who does not see an offense as an offense, and one who does not accept, in accordance with the Dhamma, the confession of an offense from someone confessing it. Monks, these two are foolish. Monks, these two are wise: one who sees an offense as an offense, and one who accepts, in accordance with the Dhamma, the confession of an offense from someone confessing it. Monks, these two are wise.’\n\n‘Monks, in the past, Sakka, lord of devas, admonishing the devas of Tāvatiṃsa in the Sudhammā assembly hall, on that occasion spoke this verse:\n“Let anger come under your control, and let no decay arise among your friends. Do not blame one who is blameless, and do not utter slander. For anger crushes the evil person, just as a mountain.”’",
      "sinhala": "සැවැත්නුවර එක්තරා ආරාමයක වැඩසිටින සමයෙහි, එකල භික්ෂූන් දෙදෙනෙක් යම් කටයුත්තක නියැලී සිටියහ. එහි එක් භික්ෂුවක් වරදක් කළේය. එවිට එම භික්ෂුව අනෙක් භික්ෂුව අසලට ගොස් තමා කළ වරද වරදක් ලෙස ප‍්‍රකාශ කළේය; නමුත් අනෙක් භික්ෂුව එය පිළිගත්තේ නැත. ඉන්පසු බොහෝ භික්ෂූහු භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: \"ස්වාමීනි, මෙහි භික්ෂූන් දෙදෙනෙක් යම් කටයුත්තක නියැලී සිටියහ, එහි එක් භික්ෂුවක් වරදක් කළේය. ස්වාමීනි, එවිට එම භික්ෂුව අනෙක් භික්ෂුව අසලට ගොස් තමා කළ වරද වරදක් ලෙස ප‍්‍රකාශ කළේය, නමුත් අනෙක් භික්ෂුව එය පිළිගත්තේ නැත.\"\n\n\"මහණෙනි, මේ දෙදෙනා බාලයෝ වෙති. යමෙක් වරද වරදක් ලෙස නොදකියිද, යමෙක් වරද ප‍්‍රකාශ කරන විට ධර්මානුකූලව එය පිළිනොගනියිද – මහණෙනි, මේ දෙදෙනා බාලයෝ වෙති.\"\n\n\"මහණෙනි, මේ දෙදෙනා පණ්ඩිතයෝ වෙති. යමෙක් වරද වරදක් ලෙස දකියිද, යමෙක් වරද ප‍්‍රකාශ කරන විට ධර්මානුකූලව එය පිළිගනියිද – මහණෙනි, මේ දෙදෙනා පණ්ඩිතයෝ වෙති.\"\n\n\"මහණෙනි, පෙර කල, දෙවියන්ගේ අධිපති වූ ශක‍්‍රයා තාවතිංස දෙවියන් සුධම්මා නම් දෙව්සබයෙහිදී අවවාද කරමින්, ඒ වේලෙහි මේ ගාථාව ප‍්‍රකාශ කළේය – \"ඔබේ ක‍්‍රෝධය ඔබට වසඟ වේවා, මිතුරන් සමඟ ඔබේ බැඳීම් පිරිහීමට ලක් නොවේවා; ගර්හනාවට නුසුදුසු දේට ගර්හා නොකරන්න, කේලාම් නොකියන්න; එසේම, පාපී පුද්ගලයාට ක‍්‍රෝධය කන්දක් මෙන් පෙරළී යටපත් කරයි.\"",
      "paliTitle": "Accayasuttaṃ",
      "englishTitle": "The Discourse on Transgression",
      "sinhalaTitle": "අච්චය සූත්‍රය"
    },
    {
      "number": 271,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū…pe… bhagavā etadavoca – ‘‘bhūtapubbaṃ, bhikkhave, sakko devānamindo sudhammāyaṃ sabhāyaṃ deve tāvatiṃse anunayamāno tāyaṃ velāyaṃ imaṃ gāthaṃ abhāsi – ‘‘Mā vo kodho ajjhabhavi, mā ca kujjhittha kujjhataṃ; Akkodho avihiṃsā ca, ariyesu ca paṭipadā [vasatī sadā (sī. syā. kaṃ. pī.)]; Atha pāpajanaṃ kodho, pabbatovābhimaddatī’’ti. Tatiyo vaggo. Tassuddānaṃ – Chetvā dubbaṇṇiyamāyā, accayena akodhano; Desitaṃ buddhaseṭṭhena, idañhi sakkapañcakanti. ",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Sāvatthī, at Jeta's Grove, Anāthapiṇḍika's Park. There, indeed, the Blessed One addressed the monks, saying:\n\n\"Formerly, monks, Sakka, the ruler of devas, admonishing the Tāvatiṃsa devas in the Sudhammā assembly hall, on that occasion uttered this verse:\n'Let not anger overpower you, and do not be angry with those who are angry. Non-anger and non-harming are the practice among the noble ones. But anger crushes the wicked person, just as a mountain does.'\"\n\nThe Third Chapter.\n\nIts summary: Having cut off ugliness and deceit, non-anger regarding offence, taught by the Supreme Buddha – this is indeed the Sakka Quintet.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග U+0D9C U+200D U+0DBA වතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩසිටින සේක.\n\nඑහිදී භාග U+0D9C U+200D U+0DBA වතුන් වහන්සේ භික්ෂූන්ට මෙය වදාළ සේක: “මහණෙනි, පෙර දවස දෙවියන්ට අධිපති වූ ශ U+0D9A U+200D U+0DBB දෙවෙන්ද්‍රයා සුධර්මා දිව්‍ය සභාවෙහි තව්තිසා දෙවියන්ට අනුශාසනා කරමින් ඒ වේලාවෙහි මේ ගාථාව පැවසීය.\n\n‘ක U+0D9A U+200D U+0DBB ෝධය ඔබ යටපත් කර නොගනීවා. ක U+0D9A U+200D U+0DBB ෝධ කරන්නවුන් කෙරෙහි තවද ක U+0D9A U+200D U+0DBB ෝධ නොකරන්න. ක U+0D9A U+200D U+0DBB ෝධ නොකිරීමද, හිංසා නොකිරීමද, ආර්යයන්ගේ පිළිවෙතයි. එහෙත් ක U+0D9A U+200D U+0DBB ෝධය පාපී පුද්ගලයා පර්වතයක් මෙන් තලා දමයි.’”\n\nතුන්වන වග්ගයයි.\n\nඑහි උද්දානය නම්: සිඳීම, දුර්වර්ණභාවය, මායාව, ඉක්මවීම සහ ක U+0D9A U+200D U+0DBB ෝධ රහිතභාවය යන මේ ධ U+0D8B U+0DCA U+200D U+0DBB ම ශ U+0D9A U+200D U+0DBB ේෂ්ඨ බුදුරජාණන් වහන්සේ විසින් දේශනා කරන ලදී. මෙය ශ U+0D9A U+200D U+0DBB දෙවෙන්ද්‍රයාගේ පස්වැනි සූත්‍රයයි.",
      "paliTitle": "Akkodhasuttaṃ",
      "englishTitle": "Non-Anger Sutta",
      "sinhalaTitle": "අක්කෝධ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Sakkasaṃyuttaṃ samattaṃ.",
    "english": "The Linked Discourses with Sakka is complete.",
    "sinhala": "සක්ක සංයුක්තය සමාප්තයි."
  }
}