{
  "id": "sn.1.7",
  "title": {
    "pali": "Brāhmaṇasaṃyuttaṃ",
    "english": "The Connected Discourses with Brahmins",
    "sinhala": "බ්‍රාහ්මණ සංයුත්තය"
  },
  "sections": [
    {
      "number": 187,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena aññatarassa bhāradvājagottassa brāhmaṇassa dhanañjānī [dhānañjānī (pī. sī. aṭṭha.)] nāma brāhmaṇī abhippasannā hoti buddhe ca dhamme ca saṅghe ca. Atha kho dhanañjānī brāhmaṇī bhāradvājagottassa brāhmaṇassa bhattaṃ upasaṃharantī upakkhalitvā tikkhattuṃ udānaṃ udānesi – ‘‘Namo tassa bhagavato arahato sammāsambuddhassa; Namo tassa bhagavato arahato sammāsambuddhassa; Namo tassa bhagavato arahato sammāsambuddhassā’’ti. Evaṃ vutte, bhāradvājagotto brāhmaṇo dhanañjāniṃ brāhmaṇiṃ etadavoca – ‘‘evamevaṃ panāyaṃ vasalī yasmiṃ vā tasmiṃ vā tassa muṇḍakassa samaṇassa vaṇṇaṃ bhāsati. Idāni tyāhaṃ, vasali, tassa satthuno vādaṃ āropessāmī’’ti. ‘‘Na khvāhaṃ taṃ, brāhmaṇa, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya, yo tassa bhagavato vādaṃ āropeyya arahato sammāsambuddhassa. Api ca tvaṃ, brāhmaṇa, gaccha, gantvā vijānissasī’’ti [gantvāpi jānissasīti (syā. kaṃ.)]. Atha kho bhāradvājagotto brāhmaṇo kupito anattamano yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhāradvājagotto brāhmaṇo bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kiṃsu chetvā sukhaṃ seti, kiṃsu chetvā na socati; Kissassu ekadhammassa, vadhaṃ rocesi gotamā’’ti. ‘‘Kodhaṃ chetvā sukhaṃ seti, kodhaṃ chetvā na socati; Kodhassa visamūlassa, madhuraggassa brāhmaṇa; Vadhaṃ ariyā pasaṃsanti, tañhi chetvā na socatī’’ti. Evaṃ vutte, bhāradvājagotto brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Labheyyāhaṃ bhoto gotamassa santike pabbajjaṃ, labheyyaṃ upasampada’’nti. Alattha kho bhāradvājagotto brāhmaṇo bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno kho panāyasmā bhāradvājo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā bhāradvājo arahataṃ ahosīti.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying at Rājagaha in Veḷuvana, the Squirrels’ Sanctuary. Now at that time, a certain brahmin of the Bhāradvāja clan had a brahmin wife named Dhanañjānī who was deeply devoted to the Buddha, the Dhamma, and the Saṅgha. Then, as the brahmin wife Dhanañjānī was bringing food to the brahmin of the Bhāradvāja clan, she stumbled and three times uttered an exclamation: \"Homage to the Blessed One, the Arahant, the Perfectly Self-Awakened One! Homage to the Blessed One, the Arahant, the Perfectly Self-Awakened One! Homage to the Blessed One, the Arahant, the Perfectly Self-Awakened One!\" When this was said, the brahmin of the Bhāradvāja clan said to the brahmin wife Dhanañjānī: \"Indeed, this wretched woman speaks praise of that shaven-headed ascetic at every turn. Now, you wretched woman, I shall refute that teacher!\" \"Brahmin, I do not see anyone in this world with its devas, Māras, and Brahmās, among this generation with its ascetics and brahmins, its devas and humans, who could refute that Blessed One, the Arahant, the Perfectly Self-Awakened One. But you, brahmin, go, and you will find out for yourself.\" Then the brahmin of the Bhāradvāja clan, angry and displeased, approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. When this courteous and memorable conversation was concluded, he sat down to one side. Seated to one side, the brahmin of the Bhāradvāja clan addressed the Blessed One with a verse: \"What, having cut off, does one sleep happily? What, having cut off, does one not sorrow? The destruction of what single thing do you commend, Gotama?\" \"Having cut off anger, one sleeps happily. Having cut off anger, one does not sorrow. The noble ones praise the destruction of anger, brahmin, whose root is poisonous and whose tip is sweet. For having cut that off, one does not sorrow.\"\n\nWhen this was said, the brahmin of the Bhāradvāja clan said to the Blessed One: \"Excellent, Venerable Gotama! Excellent, Venerable Gotama! It is as if, Venerable Gotama, one were to set upright what had been overturned, or reveal what had been hidden, or show the way to one who was lost, or carry a lamp in the darkness so that those with eyes could see forms. In the same way, the Dhamma has been made clear by the Venerable Gotama in many ways. I go for refuge to the Blessed One Gotama, to the Dhamma, and to the Bhikkhu Saṅgha. May I receive the going forth in the presence of the Venerable Gotama, may I receive the full ordination.\" The brahmin of the Bhāradvāja clan received the going forth in the presence of the Blessed One, and he received the full ordination. And Venerable Bhāradvāja, not long after his full ordination, dwelling alone, secluded, diligent, ardent, and resolute, in no long time realized for himself, with direct knowledge, here and now, that supreme culmination of the holy life for the sake of which noble sons rightly go forth from home into homelessness, and entering upon it, he dwelt therein. He directly knew: \"Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more any state of being for this world.\" And Venerable Bhāradvāja became one of the Arahants.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයෙහි කලන්දක නිවාප නම් ස්ථානයෙහි වැඩසිටින සේක.\n\nඑකල, භාරද්වාජ ගෝත්‍රයට අයත් එක්තරා බ්‍රාහ්මණයෙකුගේ ධනංජානී නම් බ්‍රාහ්මණිය බුදුන් වහන්සේ කෙරෙහිද, ධර්මය කෙරෙහිද, සංඝයා වහන්සේ කෙරෙහිද ඉතා පැහැදී සිටියාය. ඉක්බිති ධනංජානී බ්‍රාහ්මණිය භාරද්වාජ ගෝත්‍රයට අයත් බ්‍රාහ්මණයාට ආහාරය පිළිගන්වමින් සිටියදී ලිස්සා වැටී තුන්වරක් මෙසේ උදානයක් පැවසීය: ''ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා! ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා! ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා!'' මෙසේ පැවසූ කල්හි, භාරද්වාජ ගෝත්‍රයට අයත් බ්‍රාහ්මණයා ධනංජානී බ්‍රාහ්මණියට මෙසේ කීවේය: ''මේ වසලිය නම් නිතරම ඒ මුඩු මහණගේ ගුණ කියයි. දැන් මම, වසලිය, ඒ ශාස්තෘන් වහන්සේට චෝදනා කරන්නෙමි.'' ''බ්‍රාහ්මණය, දෙවියන් සහිත මරුන් සහිත බඹුන් සහිත ශ්‍රමණ බ්‍රාහ්මණයන් සහිත දෙවි මිනිසුන් සහිත මේ ලෝකයෙහි යමෙක් ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේට චෝදනා කළ හැකි වේ ද, මම එය නොදකිමි. එහෙත් බ්‍රාහ්මණය, ඔබ යන්න, ගොස් දැනගන්නවා ඇත.''\n\nඉක්බිති භාරද්වාජ ගෝත්‍රයට අයත් බ්‍රාහ්මණයා කෝප වී, නොසතුටු සිතින්, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමග ප්‍රීති සිතින් කථා කළේය. ප්‍රියමනාප වූද, සිහිකරවිය යුතු වූද කථාබස් නිමවා, එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි භාරද්වාජ ගෝත්‍රයට අයත් බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ ඇසීය: ''කුමක් සිඳ සුවසේ හිඳී ද, කුමක් සිඳ නොශෝක කෙරේ ද? ගෞතමයාණෙනි, කුමන එකම ධර්මයක විනාශය අගය කරන සේක් ද?'' ''ක්‍රෝධය සිඳ සුවසේ හිඳී, ක්‍රෝධය සිඳ නොශෝක කෙරේ. බ්‍රාහ්මණය, විෂ මුල් ඇති, මිහිරි අග්‍රය ඇති ක්‍රෝධයේ විනාශය ආර්යයෝ ප්‍රශංසා කරති, එය සිඳින විට නොශෝක කෙරේ.''\n\nමෙසේ පැවසූ කල්හි, භාරද්වාජ ගෝත්‍රයට අයත් බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ''භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, යම්සේ යමෙක් යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වැසුණු දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මග පෙන්වන්නේ ද, අඳුරෙහි තෙල් පහනක් දල්වන්නේ ද - ඇස් ඇත්තෝ රූප දකිත්වායි; එලෙසින්ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. ස්වාමීනි, මම දැන් භාග්‍යවත් ගෞතමයන් වහන්සේ ද, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමි. භවත් ගෞතමයන් වහන්සේ සමීපයෙහි පැවිද්ද ලබන්නෙමි, උපසම්පදාව ලබන්නෙමි.''\n\nභාරද්වාජ ගෝත්‍රයට අයත් බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ සමීපයෙහි පැවිද්ද ද, උපසම්පදාව ද ලැබීය. අයුෂ්මත් භාරද්වාජ තෙරණුවෝ උපසම්පදා වී වැඩි කලක් නොගොස්, තනිව, අනුන්ගෙන් වෙන්ව අප්‍රමාදීව, දැඩි වීර්යයෙන් යුතුව, වීර්යය යොදවා වැඩසිටිමින් වැඩි කලක් නොගොසින්ම – කුලපුත්‍රයෝ යම් අර්ථයක් පිණිස මැනවින් ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වෙත් ද, ඒ අනුත්තර වූ බ්‍රහ්මචර්යාවේ කෙළවර මේ අත්බැව්හිම තමන් විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කළ සේක. ''ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව වසන ලදී, කළ යුතු දේ කරන ලදී, මේ අත්බැව් සඳහා තවත් කිසිවක් කළ යුතු නැතැ''යි තමන්ම දැනගත් සේක. අයුෂ්මත් භාරද්වාජ තෙරණුවෝ ද රහතුන් වහන්සේ නමක් වූ සේක.",
      "paliTitle": "Dhanañjānīsuttaṃ",
      "vagga": "Arahantavaggo"
    },
    {
      "number": 188,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Assosi kho akkosakabhāradvājo brāhmaṇo – ‘‘bhāradvājagotto kira brāhmaṇo samaṇassa gotamassa santike agārasmā anagāriyaṃ pabbajito’’ti kupito anattamano yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ asabbhāhi pharusāhi vācāhi akkosati paribhāsati. Evaṃ vutte, bhagavā akkosakabhāradvājaṃ brāhmaṇaṃ etadavoca – ‘‘taṃ kiṃ maññasi, brāhmaṇa, api nu kho te āgacchanti mittāmaccā ñātisālohitā atithiyo [atithayo (?)]’’ti? ‘‘Appekadā me, bho gotama, āgacchanti mittāmaccā ñātisālohitā atithiyo’’ti. ‘‘‘Taṃ kiṃ maññasi, brāhmaṇa, api nu tesaṃ anuppadesi khādanīyaṃ vā bhojanīyaṃ vā sāyanīyaṃ vā’’’ti? ‘‘‘Appekadā nesāhaṃ, bho gotama, anuppademi khādanīyaṃ vā bhojanīyaṃ vā sāyanīyaṃ vā’’’ti. ‘‘‘Sace kho pana te, brāhmaṇa, nappaṭiggaṇhanti, kassa taṃ hotī’’’ti? ‘‘‘Sace te, bho gotama, nappaṭiggaṇhanti, amhākameva taṃ hotī’’’ti. ‘‘Evameva kho, brāhmaṇa, yaṃ tvaṃ amhe anakkosante akkosasi, arosente rosesi, abhaṇḍante bhaṇḍasi, taṃ te mayaṃ nappaṭiggaṇhāma. Tavevetaṃ, brāhmaṇa, hoti; tavevetaṃ, brāhmaṇa, hoti’’. ‘‘Yo kho, brāhmaṇa, akkosantaṃ paccakkosati, rosentaṃ paṭiroseti, bhaṇḍantaṃ paṭibhaṇḍati, ayaṃ vuccati, brāhmaṇa, sambhuñjati vītiharatīti. Te mayaṃ tayā neva sambhuñjāma na vītiharāma. Tavevetaṃ, brāhmaṇa, hoti; tavevetaṃ, brāhmaṇa, hotī’’ti. ‘‘Bhavantaṃ kho gotamaṃ sarājikā parisā evaṃ jānāti – ‘arahaṃ samaṇo gotamo’ti. Atha ca pana bhavaṃ gotamo kujjhatī’’ti. ‘‘Akkodhassa kuto kodho, dantassa samajīvino; Sammadaññā vimuttassa, upasantassa tādino. ‘‘Tasseva tena pāpiyo, yo kuddhaṃ paṭikujjhati; Kuddhaṃ appaṭikujjhanto, saṅgāmaṃ jeti dujjayaṃ. ‘‘Ubhinnamatthaṃ carati, attano ca parassa ca; Paraṃ saṅkupitaṃ ñatvā, yo sato upasammati. ‘‘Ubhinnaṃ tikicchantānaṃ, attano ca parassa ca; Janā maññanti bāloti, ye dhammassa akovidā’’ti. Evaṃ vutte, akkosakabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Labheyyāhaṃ, bhante, bhoto gotamassa santike pabbajjaṃ, labheyyaṃ upasampada’’nti. Alattha kho akkosakabhāradvājo brāhmaṇo bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno kho panāyasmā akkosakabhāradvājo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā bhāradvājo arahataṃ ahosīti.",
      "english": "At one time, the Blessed One was dwelling at Rājagaha, in the Veḷuvana, the Squirrels’ Sanctuary. Now, the brahman Akkosakabhāradvāja heard, \"It is said that a brahman of the Bhāradvāja clan has gone forth from the home life into homelessness in the presence of the recluse Gotama.\" Angered and displeased, he approached the Blessed One. Having approached, he reviled and insulted the Blessed One with rude and harsh words.\n\nWhen this was said, the Blessed One addressed the brahman Akkosakabhāradvāja thus: \"What do you think, brahman? Do your friends, acquaintances, relatives, kinsfolk, and guests sometimes come to you?\" \"Sometimes, Venerable Gotama, my friends, acquaintances, relatives, kinsfolk, and guests come to me.\" \"What do you think, brahman? Do you sometimes offer them food, drinks, or refreshments?\" \"Sometimes, Venerable Gotama, I do offer them food, drinks, or refreshments.\" \"If, however, brahman, they do not accept it, to whom does that belong?\" \"If, Venerable Gotama, they do not accept it, it belongs to us alone.\" \"Even so, brahman, when you revile us who do not revile, when you abuse us who do not abuse, when you insult us who do not insult, we do not accept that from you. It belongs to you alone, brahman; it belongs to you alone, brahman.\" \"Indeed, brahman, whoever reviles one who reviles, abuses one who abuses, insults one who insults – this, brahman, is said to be engaging in and reciprocating the act. We do not engage with you, nor do we reciprocate. It belongs to you alone, brahman; it belongs to you alone, brahman.\"\n\n\"The assembly, including the king, knows Venerable Gotama thus: 'The recluse Gotama is an Arahant.' Yet Venerable Gotama becomes angry!\"\n\"From where would anger arise for one who is without anger, who is self-controlled, who lives righteously, who is perfectly liberated through right knowledge, who is peaceful, who is unwavering?\nHis evil is greater who retaliates against an angry person. One who does not retaliate against an angry person wins a battle hard to win.\nHe works for the good of both, his own and the other's, who, knowing another to be angry, remains mindful and calms himself.\nThose who are unversed in the Dhamma consider such a one foolish, even though he heals both himself and others.\"\n\nWhen this was said, the brahman Akkosakabhāradvāja said to the Blessed One: \"Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms – in the same way has Venerable Gotama made the Dhamma clear in various ways. I go for refuge to Venerable Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. May I receive the going forth from Venerable Gotama, venerable sir, and may I receive the full ordination.\" The brahman Akkosakabhāradvāja received the going forth from the Blessed One, and he received the full ordination. Not long after his full ordination, venerable Akkosakabhāradvāja, dwelling alone, secluded, diligent, ardent, and resolute, in no long time realized for himself, with direct knowledge, here and now, that supreme goal of the holy life for the sake of which noble sons rightly go forth from the home life into homelessness, and entering upon it, he dwelled therein. He directly knew: \"Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.\" And venerable Bhāradvāja became one of the Arahants.",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයෙහි කලන්දක නිවාප නම් ස්ථානයෙහි වැඩසිටියහ. එකල අක්කෝසක භාරද්වාජ බ්‍රාහ්මණයාට ආරංචි විය: \"භාරද්වාජ ගෝත්‍රයට අයත් යම්කිසි බ්‍රාහ්මණයෙක් ශ්‍රමණ ගෞතමයන් වහන්සේ වෙත පැවිදි වී ඇත\" යනුවෙනි. ඔහු උරණ වී, නොසතුටු සිත් ඇතිව භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට අසභ්‍ය වූ ද රළු වූ ද වචනවලින් බැණ වදිමින්, පරිභව කරමින් සිටියේය.\n\nමෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ අක්කෝසක භාරද්වාජ බ්‍රාහ්මණයාට මෙසේ වදාළ සේක: \"බ්‍රාහ්මණය, ඔබ මේ කුමක් සිතන්නෙහි ද? ඔබට නෑදෑයෝ, මිත්‍රයෝ, අමාත්‍යයෝ, ඥාති ලේ ඇති අය, අමුත්තෝ පැමිණෙත් ද?\" \"භවත් ගෞතමයන් වහන්ස, සමහර විට මට නෑදෑයෝ, මිත්‍රයෝ, අමාත්‍යයෝ, ඥාති ලේ ඇති අය, අමුත්තෝ පැමිණෙති.\" \"බ්‍රාහ්මණය, ඔබ ඒ අමුත්තන්ට කැවියක් හෝ බොජුනක් හෝ සාදවියක් (ලෙව කා බීමට සුදුසු දෙයක්) හෝ දෙන්නෙහි ද?\" \"භවත් ගෞතමයන් වහන්ස, සමහර විට මම ඒ අමුත්තන්ට කැවියක් හෝ බොජුනක් හෝ සාදවියක් හෝ දෙමි.\" \"බ්‍රාහ්මණය, එසේ නම්, යම් හෙයකින් ඔවුන් ඒවා පිළි නොගනී නම්, ඒවා කාට අයිති වේ ද?\" \"භවත් ගෞතමයන් වහන්ස, යම් හෙයකින් ඔවුන් ඒවා පිළි නොගනී නම්, ඒවා අපටම අයිති වේ.\" \"බ්‍රාහ්මණය, එලෙසින්ම ඔබ අපට බැණ නොවදින විට බැණ වදින්නෙහි ද, අපට කිපී නොසිටින විට කිපෙන්නෙහි ද, අපට බණින්නෙහි නොවන විට බණින්නෙහි ද, ඒවා අප විසින් පිළිගනු නොලැබේ. බ්‍රාහ්මණය, එය ඔබටම අයිති වේ; බ්‍රාහ්මණය, එය ඔබටම අයිති වේ.\"\n\n\"බ්‍රාහ්මණය, යමෙක් බැණ වදින්නෙකුට පෙරළා බැණ වදින්නේ ද, කිපෙන්නෙකුට පෙරළා කිපෙන්නේ ද, බණින්නෙකුට පෙරළා බණින්නේ ද, බ්‍රාහ්මණය, මොහු 'එය පිළිගෙන, ඒ සමඟ ගනුදෙනු කරයි' යැයි කියනු ලැබේ. අපි ඔබ සමඟ එය පිළිගෙන ගනුදෙනු නොකරමු. බ්‍රාහ්මණය, එය ඔබටම අයිති වේ; බ්‍රාහ්මණය, එය ඔබටම අයිති වේ.\"\n\n\"භවත් ගෞතමයන් වහන්සේව රජු සහිත පිරිස මෙසේ දනී – 'ශ්‍රමණ ගෞතමයන් වහන්සේ අරහත් වන සේක' කියා. එසේ නම් භවත් ගෞතමයන් වහන්සේ කෝප වෙත් ද?\"\n\nක්‍රෝධ නොකරන, දමනය වූ, සම සිතින් ජීවත් වන, සම්‍යක් ප්‍රඥාවෙන් විමුක්ත වූ, උපශාන්ත වූ, තත්ත්වයට පත් වූ පුද්ගලයාට කෝපය කොයින් ද?\nකෝප වූ කෙනෙකුට පෙරළා කෝප වන්නා, ඒ කෝපයෙන් වඩාත් පාපී වේ. කෝප වූ කෙනෙකුට පෙරළා කෝප නොවන තැනැත්තා, ජය ගැනීමට දුෂ්කර වූ යුද්ධයක් ජය ගනී.\nඅනුන් අතිශයින් කිපුණු බව දැන, සිහියෙන් යුතුව තමා සංසිඳුවා ගන්නා තැනැත්තා, තමාට ද අනුන්ට ද යන දෙදෙනාටම අර්ථය පිණිස හැසිරෙයි.\nතමාට ද, අනුන්ට ද යන දෙදෙනාටම සලකන (සුවපත් කරන) පුද්ගලයන්, ධර්මය නොදන්නා ජනයා 'මෝඩයෝ' යැයි සිතති.\n\nමෙසේ කී කල්හි අක්කෝසක භාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"ඉතා මැනවි, භවත් ගෞතමයන් වහන්ස... (මෙසේ කී ඔහු) මම භවත් ගෞතමයන් වහන්සේ ද ධර්මය ද භික්ෂු සංඝයා ද සරණ යමි. භාග්‍යවතුන් වහන්ස, භවත් ගෞතමයන් වහන්සේ වෙත පැවිද්ද ද උපසම්පදාව ද ලබන්නට කැමැත්තෙමි.\" එවිට අක්කෝසක භාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වෙතින් පැවිද්ද ද උපසම්පදාව ද ලැබුවේය.\n\nඅළුතෙන් උපසම්පදා වූ ආයුෂ්මත් අක්කෝසක භාරද්වාජ ස්ථවිරයන් වහන්සේ තනිවම, හුදෙකලාව, අප්‍රමාදීව, වීර්යවත්ව, අරමුණෙහි පිහිට වූ සිත් ඇතිව වැඩසිටිමින්, වැඩි කලක් යන්නට මත්තෙන්, කුලපුත්‍රයන් යම් උත්තරීතර බ්‍රහ්මචර්යාවේ අවසානය පිණිස මනාකොට ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වෙත් ද, එය මේ ආත්මභාවයේ දී ම තමන් විසින් අභිඥා ඥානයෙන් අවබෝධ කොට, සාක්ෂාත් කරගෙන, එයට පැමිණ වැඩසිටි සේක. \"උපත ක්ෂය විය, බ්‍රහ්මචර්යාව (ශ්‍රේෂ්ඨ ජීවිතය) සම්පූර්ණ කරන ලදී, කළ යුතු දේ සිදු කරන ලදී, මේ භවය පිණිස තව කළ යුතු කිසිවක් නැතැ\"යි තමන් විසින් අවබෝධ කරගත් සේක. තව ද, ආයුෂ්මත් භාරද්වාජ ස්ථවිරයන් වහන්සේ රහතුන් වහන්සේලා අතුරෙන් එක් නමක වූ සේක.",
      "paliTitle": "Akkosasuttaṃ"
    },
    {
      "number": 189,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Assosi kho asurindakabhāradvājo brāhmaṇo – ‘‘bhāradvājagotto brāhmaṇo kira samaṇassa gotamassa santike agārasmā anagāriyaṃ pabbajito’’ti kupito anattamano yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ asabbhāhi pharusāhi vācāhi akkosati paribhāsati. Evaṃ vutte, bhagavā tuṇhī ahosi. Atha kho asurindakabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘jitosi, samaṇa, jitosi, samaṇā’’ti. ‘‘Jayaṃ ve maññati bālo, vācāya pharusaṃ bhaṇaṃ; Jayañcevassa taṃ hoti, yā titikkhā vijānato. ‘‘Tasseva tena pāpiyo, yo kuddhaṃ paṭikujjhati; Kuddhaṃ appaṭikujjhanto, saṅgāmaṃ jeti dujjayaṃ. ‘‘Ubhinnamatthaṃ carati, attano ca parassa ca; Paraṃ saṅkupitaṃ ñatvā, yo sato upasammati. ‘‘Ubhinnaṃ tikicchantānaṃ, attano ca parassa ca; Janā maññanti bāloti, ye dhammassa akovidā’’ti. Evaṃ vutte, asurindakabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… abbhaññāsi. Aññataro ca panāyasmā bhāradvājo arahataṃ ahosī’’ti.",
      "english": "At one time, the Blessed One was staying in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Place. Then Asurindaka-Bhāradvāja the brahmin heard that \"a brahmin of the Bhāradvāja clan has gone forth from the home life into homelessness in the presence of the recluse Gotama.\" Angered and displeased, he approached the Blessed One. Having approached, he reviled and abused the Blessed One with rude and harsh words.\n\nWhen this was said, the Blessed One remained silent. Then Asurindaka-Bhāradvāja the brahmin said to the Blessed One, \"You are conquered, recluse! You are conquered, recluse!\"\n\n\"Indeed, a fool thinks he has won by speaking harsh words; but for the discerning one, patience is the true victory. One who retorts to an angry person thereby becomes worse himself. By not retorting to an angry person, one wins a battle hard to win. He acts for the good of both himself and others, who, knowing another is enraged, remains mindfully calm. People who do not understand the Dhamma consider him a fool, even though he is healing both himself and others.\"\n\nWhen this was said, Asurindaka-Bhāradvāja the brahmin said to the Blessed One, \"Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as if one were to turn upright what had been overthrown, or to reveal what had been hidden, or to point out the way to one who was lost, or to light a lamp in the darkness so that those with eyesight might see forms, even so has the Venerable Gotama expounded the Dhamma in various ways. I go for refuge to the Venerable Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. May the Venerable Gotama accept me as a lay follower who has taken refuge from this day forth as long as life lasts.\" Having made this declaration, he then fully understood the teaching. And thereupon, Venerable Bhāradvāja became one of the Arahants.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් කළන්දකනිවාපයේ වැඩ වෙසෙන සේක. අසුරින්දකභාරද්වාජ බ්‍රාහ්මණයාට මේ ආරංචිය අසන්නට ලැබුණි – “භාරද්වාජ ගෝත්‍රයට අයත් බ්‍රාහ්මණයෙක් ශ්‍රමණ ගෞතමයන් වහන්සේ සමීපයෙහි ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වූයේය” යැයි. කෝපවූයේ අසතුටු සිතින්, හෙතෙම භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට අසභ්‍ය වූ ද රළු වූ ද වචන වලින් බැන වදිමින් නින්දා කළේය. මෙසේ පැවසූ විට භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දව වැඩසිටියේය. ඉක්බිති අසුරින්දකභාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ඔබ පැරදුණා ශ්‍රමණය, ඔබ පැරදුණා ශ්‍රමණය!”\n\n“රළු වචන කියමින් තමා ජයග්‍රහණය කළ බව මෝඩයා සිතයි. එහෙත් නියම ජයග්‍රහණය නම්, ප්‍රඥාවන්තයාගේ යම් ඉවසීමක් වේ ද එයයි.”\n\n“කෝප වූවෙකුට යමෙක් නැවත කෝප වේ ද, එයින් තමාටම පාපයක්, නපුරක් සිදු වේ. කෝප වූවෙකුට නැවත කෝප නොවන තැනැත්තා, ජයගැනීමට දුෂ්කර වූ සටනක් ජය ගනී.”\n\n“අනුන් කෝප වී සිටින බව දැන, යමෙක් සිහි නුවණින් යුක්තව සන්සුන් වේ ද, ඔහු තමාටත්, අනුන්ටත් යන දෙදෙනාටම යහපත සලසයි.”\n\n“තමාටත්, අනුන්ටත් යහපත සලසන්නා වූ (එවැනි) දෙදෙනාම ධර්මයෙහි අදක්ෂ වූ ජනයා මෝඩයෝ යැයි සිතති.”\n\nමෙසේ පැවසූ විට අසුරින්දකභාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “අතිශයින් මැනවි, ගෞතමයන් වහන්ස!...පෙ... ධර්මය අවබෝධ කරගත්තේය.” ඉක්බිති ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතන් වහන්සේ නමක් බවට පත් වූ සේක.",
      "paliTitle": "Asurindakasuttaṃ"
    },
    {
      "number": 190,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Assosi kho bilaṅgikabhāradvājo brāhmaṇo – ‘‘bhāradvājagotto kira brāhmaṇo samaṇassa gotamassa santike agārasmā anagāriyaṃ pabbajito’’ti kupito anattamano yena bhagavā tenupasaṅkami; upasaṅkamitvā tuṇhībhūto ekamantaṃ aṭṭhāsi. Atha kho bhagavā bilaṅgikassa bhāradvājassa brāhmaṇassa cetasā cetoparivitakkamaññāya bilaṅgikaṃ bhāradvājaṃ brāhmaṇaṃ gāthāya ajjhabhāsi – ‘‘Yo appaduṭṭhassa narassa dussati, Suddhassa posassa anaṅgaṇassa; Tameva bālaṃ pacceti pāpaṃ, Sukhumo rajo paṭivātaṃva khitto’’ti. Evaṃ vutte, vilaṅgikabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… abbhaññāsi. Aññataro ca panāyasmā bhāradvājo arahataṃ ahosī’’ti.",
      "english": "At one time the Blessed One was staying in Rājagaha, in the Bamboo Grove, at the Squirrels' Feeding Ground. Then Bilaṅgikabhāradvāja the Brahmin heard: \"Indeed, a Brahmin of the Bhāradvāja clan has gone forth from the home life into homelessness in the presence of the Ascetic Gotama!\" Enraged and displeased, he went to where the Blessed One was. Having approached, he stood silently to one side.\n\nThen the Blessed One, understanding with his own mind the reflection of Bilaṅgikabhāradvāja the Brahmin's mind, addressed Bilaṅgikabhāradvāja the Brahmin with a verse:\n\"Whoever wrongs a person who is harmless,\nPure and undefiled;\nThat very evil recoils upon the fool,\nLike fine dust thrown against the wind.\"\n\nWhen this was said, Bilaṅgikabhāradvāja the Brahmin said to the Blessed One: \"Excellent, Master Gotama! Excellent! Just as if someone were to set upright what had been overturned, or to reveal what was hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms—in the same way has Master Gotama made the Dhamma clear in many ways. I go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. May I receive the going forth under the Blessed One, may I receive full ordination.\" He understood, and then Venerable Bhāradvāja became one of the Arahants.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ කලඳක නිවාප නම් ස්ථානයේ වැඩවසන සේක. බිලංගිකභාරද්වාජ බ්‍රාහ්මණයාට මේ ආරංචිය අසන්නට ලැබිණි: ‘භාරද්වාජගෝත්‍රික බ්‍රාහ්මණයෙක් ශ්‍රමණ ගෞතමයන් වහන්සේගේ සමීපයෙහි ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වී ඇතැයි.’ ඔහු කෝපයට පත්ව, නොසතුටට පත්වී භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. එළඹ, නිහඬව එකත්පසෙක සිටියේය. එවිට භාග්‍යවතුන් වහන්සේ බිලංගිකභාරද්වාජ බ්‍රාහ්මණයාගේ සිතින් ඔහුගේ අදහස් මනසින් දැන, බිලංගිකභාරද්වාජ බ්‍රාහ්මණයාට ගාථාවකින් මෙසේ වදාළ සේක: ‘යමෙක් කිසිවකුටත් දොස් නොකරන, පිරිසිදු, කිලිටි නැති, අංගනයකින් තොර පුද්ගලයකුට දොස් නගන්නේද, එම පව, (පව් කළ) ඒ අඥාන තැනැත්තා වෙතටම ආපසු පැමිණේ, සියුම් දූවිල්ලක් සුළං රොදට විරුද්ධව විසි කළ විට මෙන්.’ මෙසේ වදාළ කල්හි, බිලංගිකභාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: ‘භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! යටිකුරු කළ දෙයක් උඩුකුරු කරන්නාක් මෙන්ද, වසා තිබූ දෙයක් විවෘත කරන්නාක් මෙන්ද, මංමුළා වූවෙකුට මග පෙන්වන්නාක් මෙන්ද, අන්ධකාරයේ තෙල් පහනක් දල්වන්නාක් මෙන්ද, භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය දේශනා කරන ලදී. එහෙයින් මම භාග්‍යවතුන් වහන්සේද, ධර්මයද, සංඝයාද සරණ යමි. භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලැබීමටත්, උපසම්පදාව ලැබීමටත් කැමැත්තෙමි.’ ඔහු එසේ පැවිදි වී උපසම්පදා වී කෙටි කලකින්ම, භාග්‍යවතුන් වහන්සේ දෙසූ ධර්මය අවබෝධ කරගත්තේය. තවද, ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් වහන්සේලා අතරට පත්වූ සේක.",
      "paliTitle": "Bilaṅgikasuttaṃ"
    },
    {
      "number": 191,
      "pali": "Sāvatthinidānaṃ. Atha kho ahiṃsakabhāradvājo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho ahiṃsakabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘ahiṃsakāhaṃ, bho gotama, ahiṃsakāhaṃ, bho gotamā’’ti. ‘‘Yathā nāmaṃ tathā cassa, siyā kho tvaṃ ahiṃsako; Yo ca kāyena vācāya, manasā ca na hiṃsati; Sa ve ahiṃsako hoti, yo paraṃ na vihiṃsatī’’ti. Evaṃ vutte, ahiṃsakabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… abbhaññāsi. Aññataro ca panāyasmā ahiṃsakabhāradvājo arahataṃ ahosī’’ti.",
      "english": "At Sāvatthī.\n\nThen the brahmin Ahiṃsakabhāradvāja approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the polite and cordial talk, he sat down to one side. As he sat to one side, the brahmin Ahiṃsakabhāradvāja said to the Blessed One, \"I am Ahiṃsaka, Venerable Gotama, I am Ahiṃsaka, Venerable Gotama.\"\n\n\"May you be as your name implies, may you indeed be non-harming. For whoever does not harm with body, speech, or mind – he is truly one who does not harm, one who does not torment others.\"\n\nWhen this was said, the brahmin Ahiṃsakabhāradvāja said to the Blessed One, \"Excellent, Venerable Gotama! Excellent! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so those with eyes could see forms, in the same way has the Venerable Gotama made the Dhamma clear in various ways. I go for refuge to the Venerable Gotama, and to the Dhamma, and to the Saṅgha of bhikkhus. May I receive the going forth in the presence of the Venerable Gotama! May I receive full ordination!\" By saying this, he fully comprehended the teaching. And then, the Venerable Ahiṃsakabhāradvāja became an Arahant.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඑසමයෙහි අහිංසකභාරද්වාජ බ්‍රාහ්මණයාණෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. එසේ සතුටු විය යුතු, සිහිපත් කළ යුතු කථාව අවසන් කොට, එකත්පසෙකින් වාඩි විය.\n\nඑකත්පසෙකින් වාඩි වී සිටි අහිංසකභාරද්වාජ බ්‍රාහ්මණයාණෝ භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: “භවත් ගෞතමයෙනි, මම අහිංසකයෙමි, භවත් ගෞතමයෙනි, මම අහිංසකයෙමි.”\n\n“ඔබගේ නම පරිද්දෙන්ම ඔබ අහිංසක වේවා! යමෙක් කයින්, වචනයෙන්, සිතින් අනුන්ට හිංසා නොකරන්නේද, යමෙක් අනුන්ට හිංසා නොකරන්නේද, හේ සැබවින්ම අහිංසක වන්නේය.”\n\nමෙසේ කී කල්හි, අහිංසකභාරද්වාජ බ්‍රාහ්මණයාණෝ භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: “භවත් ගෞතමයෙනි, ඉතා ශෝභනයි! භවත් ගෞතමයෙනි, ඉතා ශෝභනයි! යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මග වැරද ගිය කෙනෙකුට මග පෙන්වන්නේද, අඳුරේ තෙල් පහනක් දල්වන්නේද ‘ඇස් ඇත්තෝ රූප දකිත්වා’යි – එලෙසින්ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය පැහැදිලි කරන ලදී. ඒ මම භවත් ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. භාග්‍යවතුන් වහන්සේ වෙත පැවිද්දත්, උපසම්පදාවත් ලැබීමට අවසර ලැබේවා!” ඉක්බිති ඔහු ධර්මය අවබෝධ කරගත්තේය.\n\nඒ ආයුෂ්මත් අහිංසකභාරද්වාජ තෙරණුවෝ රහතන් වහන්සේ නමක් බවට පත් වූහ.",
      "paliTitle": "Ahiṃsakasuttaṃ"
    },
    {
      "number": 192,
      "pali": "Sāvatthinidānaṃ. Atha kho jaṭābhāradvājo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jaṭābhāradvājo brāhmaṇo bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Antojaṭā bahijaṭā, jaṭāya jaṭitā pajā; Taṃ taṃ gotama pucchāmi, ko imaṃ vijaṭaye jaṭa’’nti. ‘‘Sīle patiṭṭhāya naro sapañño, cittaṃ paññañca bhāvayaṃ; Ātāpī nipako bhikkhu, so imaṃ vijaṭaye jaṭaṃ. ‘‘Yesaṃ rāgo ca doso ca, avijjā ca virājitā; Khīṇāsavā arahanto, tesaṃ vijaṭitā jaṭā. ‘‘Yattha nāmañca rūpañca, asesaṃ uparujjhati; Paṭighaṃ rūpasaññā ca, etthesā chijjate jaṭā’’ti. Evaṃ vutte, jaṭābhāradvājo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… aññataro ca panāyasmā bhāradvājo arahataṃ ahosī’’ti.",
      "english": "In Savatthi.\n\nThen the brahmin Jatabharadvaja approached the Blessed One. Having approached, he exchanged cordial greetings with the Blessed One. When they had concluded their pleasant and memorable talk, he sat down to one side.\n\nAs he sat to one side, the brahmin Jatabharadvaja addressed the Blessed One with a verse:\n\"Within is tangled, without is tangled;\nPeople are enmeshed in this tangle.\nI ask you, Gotama, concerning this:\nWho can disentangle this tangle?\"\n\n\"A wise person, established in virtue,\nDeveloping concentration and wisdom—\nAn ardent, discerning bhikkhu:\nHe can disentangle this tangle.\"\n\n\"For those in whom lust, hatred, and ignorance\nHave completely faded away—\nThe Arahants, whose taints are destroyed:\nFor them the tangle is disentangled.\"\n\n\"Where name and form completely cease without remainder,\nAnd sensory impingement along with the perception of form—\nThere, indeed, this tangle is cut off.\"\n\nWhen this was said, Jatabharadvaja said to the Blessed One: \"Excellent, venerable Gotama! Excellent! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms—in the same way has the venerable Gotama made the Dhamma clear in various ways. I go for refuge to the venerable Gotama, to the Dhamma, and to the Sangha of bhikkhus. May I receive the going forth (pabbajjā) in the venerable Gotama’s presence, and may I receive the full ordination (upasampadā).\"\n\nAnd Venerable Bharadvaja became one of the Arahants.",
      "sinhala": "සැවැත්නුවරදීය.\n\nඑවිට ජටාභාරද්වාජ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමඟ සමීප සතුටු සාමිචි කථා පැවැත්වීය. එම ප්‍රියමනාප, සිහිපත් කළ යුතු කථා බස් නිමවා, එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි ජටාභාරද්වාජ බ්‍රාහ්මණ තෙමේ ගාථාවකින් භාග්‍යවතුන් වහන්සේ අමතා මෙසේ කීවේය: ''ඇතුළතත් බැඳීම්ය, පිටතත් බැඳීම්ය. සත්වයෝ බැඳීම්වලින් බැඳී සිටිති. ගෞතමයින් වහන්ස, ඒ ඔබ වහන්සේගෙන් මම අසමි, කවරෙක් මේ බැඳීම ලිහන්නේද?''\n\n''සිල් හි පිහිටා සිටින නුවණැති මිනිසෙක්, සිත ද ප්‍රඥාව ද දියුණු කරමින්, කෙලෙස් තවන වීර්යයෙන් යුක්තව, නිපුණව වාසය කරන භික්ෂුව, හෙතෙමේ මේ බැඳීම ලිහන්නේය.''\n\n''රාගය ද, ද්වේෂය ද, අවිද්‍යාව ද මුළුමනින්ම පහ වී ගිය, ක්ෂීණාශ්‍රව අරහත්හු, ඔවුන්ගේ බැඳීම් ලිහිණී ඇත.''\n\n''නාමය ද, රූපය ද, කිසිදු ඉතිරිවීමක් නොමැතිව නිරුද්ධ වන්නේ කොතැනකද, (එසේම) ප්‍රතිඝය ද, රූප සංඥාව ද නැති වන්නේ කොතැනකද, එතැනදී මේ බැඳීම සිඳී යයි.''\n\nමෙසේ පැවසූ විට, ජටාභාරද්වාජ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ''භවත් ගෞතමයන් වහන්ස, අතිශයින් මනහරය! භවත් ගෞතමයන් වහන්ස, අතිශයින් මනහරය! භවත් ගෞතමයන් වහන්ස, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූවක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේද, අඳුරෙහි තෙල් පහනක් දල්වා ඇස් ඇති අයට රූප දැක්වීමට සලස්වන්නේද, එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කර ඇත. භවත් ගෞතමයන් වහන්ස, මම භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමි. භාග්‍යවතුන් වහන්සේ වෙත පැවිද්ද ලබන්නටත්, උපසම්පදාව ලබන්නටත් කැමැත්තෙමි.'' පසුව ආයුෂ්මත් භාරද්වාජ තෙමේ අරහතුන් අතුරෙන් එක් අයෙක් විය.",
      "paliTitle": "Jaṭāsuttaṃ"
    },
    {
      "number": 193,
      "pali": "Sāvatthinidānaṃ. Atha kho suddhikabhāradvājo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho suddhikabhāradvājo brāhmaṇo bhagavato santike imaṃ gāthaṃ ajjhabhāsi – ‘‘Na brāhmaṇo [nābrāhmaṇo (?)] sujjhati koci, loke sīlavāpi tapokaraṃ; Vijjācaraṇasampanno, so sujjhati na aññā itarā pajā’’ti. ‘‘Bahumpi palapaṃ jappaṃ, na jaccā hoti brāhmaṇo; Antokasambu saṅkiliṭṭho, kuhanaṃ upanissito. ‘‘Khattiyo brāhmaṇo vesso, suddo caṇḍālapukkuso; Āraddhavīriyo pahitatto, niccaṃ daḷhaparakkamo; Pappoti paramaṃ suddhiṃ, evaṃ jānāhi brāhmaṇā’’ti. Evaṃ vutte, suddhikabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… aññataro ca panāyasmā bhāradvājo arahataṃ ahosī’’ti.",
      "english": "Thus I heard: At Sāvatthī.\n\nThen the brahmin Suddhika Bhāradvāja approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the courteous and memorable conversation, he sat down to one side. Seated to one side, the brahmin Suddhika Bhāradvāja recited this verse in the presence of the Blessed One: “No one is purified merely by being a brahmin, nor anyone in the world merely by being moral or performing austerities. It is the one accomplished in true knowledge and noble conduct who is purified, not any other person.”\n\n“Even by much idle babbling, one does not become a brahmin by birth. Such a person, internally defiled like an empty husk, relies on deceit and hypocrisy. Whether one is a warrior, a brahmin, a merchant, a worker, an outcast, or a scavenger, if one has aroused energy, is resolute, and ever firm in diligent effort, they attain the ultimate purity. Know this, brahmin!”\n\nWhen this was said, the brahmin Suddhika Bhāradvāja said to the Blessed One: \"Excellent, venerable Gotama! Excellent! Just as if one were to set upright what was overturned, or to reveal what was hidden, or to show the way to one who was lost, or to hold up a lamp in the dark so that those with eyes might see forms, even so has the Blessed One expounded the Dhamma in various ways. I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha. May the Blessed One accept me as a lay follower who has taken refuge from this day forth, for as long as life lasts.\" Then, in due course, venerable Bhāradvāja became an Arahant.",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදී.\n\nඉක්බිති සුද්ධිකභාරද්වාජ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. ආදරණීය, සිත්ගන්නා සුළු කතා බහ නිමා කොට එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි සුද්ධිකභාරද්වාජ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ ඉදිරියේ මේ ගාථාව කීවේය: ‘‘කිසිදු බ්‍රාහ්මණයෙක් පිරිසිදු නොවෙයි, ලෝකයෙහි සිල්වත් වූවකු හෝ තපස් කරන්නකු වුව ද පිරිසිදු නොවෙයි. විද්‍යාචරණ සම්පන්න වූ තැනැත්තා පමණක් පිරිසිදු වෙයි, අන්‍ය සාමාන්‍ය ජනයා පිරිසිදු නොවෙති.’’\n\n(භාග්‍යවතුන් වහන්සේ පිළිතුරු දුන් සේක:) ‘‘බොහෝ නිසරු වදන් ජප කළ පමණින් උපතින් බ්‍රාහ්මණ නොවේ. ඇතුළතින් කෙලෙස්වලින් කිලිටි වූ, වංචාවට හුරුවූ, කපටියෙක් වන ඔහු බ්‍රාහ්මණ නොවේ. ක්ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශුද්‍ර, චණ්ඩාල, පුක්කුස යන කුල භේදයක් නැත; වීර්යය ආරම්භ කළ, සිත යොමු කළ, නිරතුරුව දැඩි උත්සාහයෙන් යුත් තැනැත්තා උතුම් වූ පාරිශුද්ධියට පැමිණේ. බ්‍රාහ්මණය, මෙසේ දන්නේය.’’\n\nමෙසේ වදාළ විට සුද්ධිකභාරද්වාජ බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘අභික්කන්තං, භෝ ගෝතම! අභික්කන්තං, භෝ ගෝතම! යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වැසුණු දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මග පෙන්වන්නේ ද, අඳුරේ තෙල් පහනක් දල්වන්නා සේ ද, එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාරයෙන් ධර්මය පැහැදිලි කළ සේක. එබැවින් මම භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, සංඝයා ද සරණ යමි. භාග්‍යවතුන් වහන්සේගේ සමීපයෙහි පැවිද්ද ද උපසම්පදාව ද ලබන්නට කැමැත්තෙමි.’’ අන්‍ය වූ ආයුෂ්මත් භාරද්වාජ ද රහතන් වහන්සේ නමක් බවට පත් විය.",
      "paliTitle": "Suddhikasuttaṃ"
    },
    {
      "number": 194,
      "pali": "Ekaṃ samayaṃ bhagavā rājagahe viharati veḷuvane kalandakanivāpe. Tena kho pana samayena aggikabhāradvājassa brāhmaṇassa sappinā pāyaso sannihito hoti – ‘‘aggiṃ juhissāmi, aggihuttaṃ paricarissāmī’’ti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya rājagahaṃ piṇḍāya pāvisi. Rājagahe sapadānaṃ piṇḍāya caramāno yena aggikabhāradvājassa brāhmaṇassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā ekamantaṃ aṭṭhāsi. Addasā kho aggikabhāradvājo brāhmaṇo bhagavantaṃ piṇḍāya ṭhitaṃ. Disvāna bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Tīhi vijjāhi sampanno, jātimā sutavā bahū; Vijjācaraṇasampanno, somaṃ bhuñjeyya pāyasa’’nti. ‘‘Bahumpi palapaṃ jappaṃ, na jaccā hoti brāhmaṇo; Antokasambu saṃkiliṭṭho, kuhanāparivārito. ‘‘Pubbenivāsaṃ yo vedī, saggāpāyañca passati; Atho jātikkhayaṃ patto, abhiññāvosito muni. ‘‘Etāhi tīhi vijjāhi, tevijjo hoti brāhmaṇo; Vijjācaraṇasampanno, somaṃ bhuñjeyya pāyasa’’nti. ‘‘Bhuñjatu bhavaṃ gotamo. Brāhmaṇo bhava’’nti. ‘‘Gāthābhigītaṃ me abhojaneyyaṃ, Sampassataṃ brāhmaṇa nesa dhammo; Gāthābhigītaṃ panudanti buddhā, Dhamme sati brāhmaṇa vuttiresā. ‘‘Aññena ca kevalinaṃ mahesiṃ, Khīṇāsavaṃ kukkuccavūpasantaṃ; Annena pānena upaṭṭhahassu, Khettañhi taṃ puññapekkhassa hotī’’ti. Evaṃ vutte, aggikabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama… pe… aññataro ca panāyasmā aggikabhāradvājo arahataṃ ahosī’’ti.",
      "english": "At one time, the Blessed One was dwelling in Rājagaha, in the Veḷuvana, the Squirrels' Feeding Ground. Now, at that time, the brahmin Aggikabhāradvāja had prepared a milk-rice porridge with ghee, intending: \"I shall make an offering to the fire; I shall attend to the fire sacrifice.\" Then, in the morning, the Blessed One dressed, took his bowl and robe, and entered Rājagaha for alms. Walking for alms in Rājagaha, going from house to house in order, he approached the dwelling of the brahmin Aggikabhāradvāja; having approached, he stood to one side. The brahmin Aggikabhāradvāja saw the Blessed One standing for alms. Having seen the Blessed One, he addressed him with a verse: \"One who is endowed with the three Vedas, of noble birth, learned in much lore; one who is endowed with knowledge and conduct, such a one should eat this milk-rice porridge.\"\n\n\"Even much babbling and chanting does not make one a brahmin by birth; internally stained, enclosed by deception.\"\n\n\"One who knows their past existences, and sees both heavenly and woeful destinations; furthermore, having attained the destruction of birth, such a sage is perfected in supernormal knowledges.\"\n\n\"It is with these three knowledges that one becomes a true brahmin, a 'three-knowledge master'; one endowed with knowledge and conduct, such a one should eat this milk-rice porridge.\"\n\nThen (Aggikabhāradvāja said): \"May Master Gotama partake. Master is indeed a brahmin.\"\n\n(The Blessed One replied): \"Food that is sung for with verses is not fit for me to eat; this is not the custom for brahmins who truly see, O brahmin. Buddhas reject food obtained by chanted verses; when the Dhamma is present, O brahmin, this is the rule.\"\n\n\"Rather, with other food and drink, you should sustain the perfected great sage, who is free from defilements, tranquil and peaceful. For such a one is indeed a field of merit for those seeking merit.\"\n\nWhen this was said, the brahmin Aggikabhāradvāja said to the Blessed One: \"Excellent, Master Gotama!...\" And the Venerable Aggikabhāradvāja became one of the Arahants.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ රජගහ නුවර වේළුවන නම් වූ කලන්දකනිවාපයේ වැඩසිටි සේක. එසමයෙහි අග්ගිකභාරද්වාජ නම් බමුණාට ගිතෙලින් පිළියෙල කරන ලද කිරිබතක් පිළියෙල කර තිබුණේය – ‘‘මම අග්නියට පුදමි, අග්නිහෝත්‍රය කරන්නෙමි’’යි සිතාගෙන.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන රජගහ නුවරට පිඬු සිඟා වැඩි සේක. රජගහ නුවර පිළිවෙළින් පිඬු සිඟා වඩිනා සේක්, යම් තැනෙක අග්ගිකභාරද්වාජ බමුණාගේ නිවෙසද, එතැනට වැඩි සේක; එතැනට පැමිණ එක් පසෙක සිටි සේක.\n\nඅග්ගිකභාරද්වාජ බමුණා භාග්‍යවතුන් වහන්සේ පිඬු සිඟා වැඩ සිටිනවා දුටුවේය. දැක, භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවේය – ‘‘ත්‍රිවිද්‍යාවෙන් සම්පූර්ණ වූ, උසස් ජාතියක් ඇති, බහුශ්‍රැත වූ, විද්‍යාචරණයෙන් යුක්ත වූ පුද්ගලයා මේ කිරිබත අනුභව කළ යුතුය.’’\n\n‘‘බොහෝ නිෂ්ඵල වචන දෙඩවීමෙන්, උපන් පමණින් බ්‍රාහ්මණයෙක් නොවේ. ඇතුළත කුණුපයෙන් කිලිටි වූ, කුහකත්වයෙන් වට වූ තැනැත්තා බමුණෙක් නොවේ. යමෙක් පෙර විසූ කඳපිළිවෙළ දනීද, දිව්‍ය ලෝක සහ අපායද දකීද, එසේම ජාතික්ෂය ලැබූ, අභිඥාවන්ගෙන් පරතෙරට පැමිණි මුනිවරයා (බ්‍රාහ්මණයෙක් වන්නේය). මේ ත්‍රිවිද්‍යාවන්ගෙන් යුක්ත වූ තැනැත්තා ත්‍රිවිද්‍යා බ්‍රාහ්මණයෙක් වන්නේය. විද්‍යාචරණයෙන් සම්පූර්ණ වූ ඔහු මේ කිරිබත අනුභව කළ යුතුය.’’\n\n‘‘ගෝතම පින්වතා අනුභව කරනු මැනව. පින්වතා බ්‍රාහ්මණයෙකි.’’\n\n‘‘බ්‍රාහ්මණය, ගාථාවකින් ප්‍රශංසා කොට දෙන ලද දේ මා විසින් අනුභව නොකළ යුතුය. බ්‍රාහ්මණය, (සත්‍යය) මැනවින් දකින අයට මෙය ධර්මයක් නොවේ. බුදුවරු ගාථාවලින් දෙන ලද දේ ප්‍රතික්ෂේප කරති. බ්‍රාහ්මණය, ධර්මය පවතින කල්හි මේ සම්ප්‍රදායයි.\n\n‘‘අන් අහරකින් (දන් දීමෙන්) සියල්ල අවබෝධ කළ, මහා සෘෂිවරයාට, ක්ෂීණාශ්‍රව වූ, සියලු පසුතැවීම් සංසිඳුණු තැනැත්තාට, අන්නපානයෙන් උපස්ථාන කරනු මැනව. එය පින අපේක්ෂා කරන අයට පුණ්‍ය ක්ෂේත්‍රයක් වන්නේය.’’\n\nමෙසේ කී කල්හි, අග්ගිකභාරද්වාජ බමුණා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය – ‘‘භවත් ගෝතමයන් වහන්ස, ඉතා මනහරය...’’ (මෙසේ කියා සරණ ගොස් පැවිදි වූයේය)... අනතුරුව ආයුෂ්මත් අග්ගිකභාරද්වාජ එක් රහතන් වහන්සේ නමක් බවට පත් විය.",
      "paliTitle": "Aggikasuttaṃ"
    },
    {
      "number": 195,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu viharati sundarikāya nadiyā tīre. Tena kho pana samayena sundarikabhāradvājo brāhmaṇo sundarikāya nadiyā tīre aggiṃ juhati, aggihuttaṃ paricarati. Atha kho sundarikabhāradvājo brāhmaṇo aggiṃ juhitvā aggihuttaṃ paricaritvā uṭṭhāyāsanā samantā catuddisā anuvilokesi – ‘‘ko nu kho imaṃ habyasesaṃ bhuñjeyyā’’ti? Addasā kho sundarikabhāradvājo brāhmaṇo bhagavantaṃ aññatarasmiṃ rukkhamūle sasīsaṃ pārutaṃ nisinnaṃ. Disvāna vāmena hatthena habyasesaṃ gahetvā dakkhiṇena hatthena kamaṇḍaluṃ gahetvā yena bhagavā tenupasaṅkami. Atha kho bhagavā sundarikabhāradvājassa brāhmaṇassa padasaddena sīsaṃ vivari. Atha kho sundarikabhāradvājo brāhmaṇo ‘muṇḍo ayaṃ bhavaṃ, muṇḍako ayaṃ bhava’nti tatova puna nivattitukāmo ahosi. Atha kho sundarikabhāradvājassa brāhmaṇassa etadahosi – ‘muṇḍāpi hi idhekacce brāhmaṇā bhavanti; yaṃnūnāhaṃ taṃ upasaṅkamitvā jātiṃ puccheyya’nti. Atha kho sundarikabhāradvājo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ etadavoca – ‘kiṃjacco bhava’nti? ‘‘Mā jātiṃ puccha caraṇañca puccha, Kaṭṭhā have jāyati jātavedo; Nīcākulīnopi muni dhitimā, Ājānīyo hoti hirīnisedho. ‘‘Saccena danto damasā upeto, Vedantagū vusitabrahmacariyo; Yaññopanīto tamupavhayetha, Kālena so juhati dakkhiṇeyye’’ti. ‘‘Addhā suyiṭṭhaṃ suhutaṃ mama yidaṃ, Yaṃ tādisaṃ vedagumaddasāmi; Tumhādisānañhi adassanena, Añño jano bhuñjati habyasesa’’nti. ‘‘Bhuñjatu bhavaṃ gotamo. Brāhmaṇo bhava’’nti. ‘‘Gāthābhigītaṃ me abhojaneyyaṃ, Sampassataṃ brāhmaṇa nesa dhammo; Gāthābhigītaṃ panudanti buddhā, Dhamme sati brāhmaṇa vuttiresā. ‘‘Aññena ca kevalinaṃ mahesiṃ, Khīṇāsavaṃ kukkuccavūpasantaṃ; Annena pānena upaṭṭhahassu, Khettañhi taṃ puññapekkhassa hotī’’ti. ‘‘Atha kassa cāhaṃ, bho gotama, imaṃ habyasesaṃ dammī’’ti? ‘‘Na khvāhaṃ, brāhmaṇa, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yasseso habyaseso bhutto sammā pariṇāmaṃ gaccheyya aññatra, brāhmaṇa, tathāgatassa vā tathāgatasāvakassa vā. Tena hi tvaṃ, brāhmaṇa, taṃ habyasesaṃ appaharite vā chaḍḍehi appāṇake vā udake opilāpehī’’ti. Atha kho sundarikabhāradvājo brāhmaṇo taṃ habyasesaṃ appāṇake udake opilāpesi. Atha kho so habyaseso udake pakkhitto cicciṭāyati ciṭiciṭāyati sandhūpāyati sampadhūpāyati. Seyyathāpi nāma phālo [loho (ka.)] divasaṃsantatto [divasasantatto (sī. syā. kaṃ. pī.)] udake pakkhitto cicciṭāyati ciṭiciṭāyati sandhūpāyati sampadhūpāyati; evameva so habyaseso udake pakkhitto cicciṭāyati ciṭiciṭāyati sandhūpāyati sampadhūpāyati. Atha kho sundarikabhāradvājo brāhmaṇo saṃviggo lomahaṭṭhajāto yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhitaṃ kho sundarikabhāradvājaṃ brāhmaṇaṃ bhagavā gāthāhi ajjhabhāsi – ‘‘Mā brāhmaṇa dāru samādahāno, Suddhiṃ amaññi bahiddhā hi etaṃ; Na hi tena suddhiṃ kusalā vadanti, Yo bāhirena parisuddhimicche. ‘‘Hitvā ahaṃ brāhmaṇa dārudāhaṃ Ajjhattamevujjalayāmi [ajjhattameva jalayāmi (sī. syā. kaṃ. pī.)] jotiṃ; Niccagginī niccasamāhitatto, Arahaṃ ahaṃ brahmacariyaṃ carāmi. ‘‘Māno hi te brāhmaṇa khāribhāro, Kodho dhumo bhasmani mosavajjaṃ; Jivhā sujā hadayaṃ jotiṭhānaṃ, Attā sudanto purisassa joti. ‘‘Dhammo rahado brāhmaṇa sīlatittho, Anāvilo sabbhi sataṃ pasattho; Yattha have vedaguno sinātā, Anallagattāva [anallīnagattāva (sī. pī. ka.)] taranti pāraṃ. ‘‘Saccaṃ dhammo saṃyamo brahmacariyaṃ, Majjhe sitā brāhmaṇa brahmapatti; Sa tujjubhūtesu namo karohi, Tamahaṃ naraṃ dhammasārīti brūmī’’ti. Evaṃ vutte, sundarikabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… aññataro ca panāyasmā bhāradvājo arahataṃ ahosī’’ti.",
      "english": "One time, the Blessed One was dwelling in Kosala, on the bank of the Sundarikā River. Now, at that time, the brahmin Sundarikabhāradvāja was offering oblations into the fire and tending the fire sacrifice on the bank of the Sundarikā River. Then, having offered oblations into the fire and tended the fire sacrifice, the brahmin Sundarikabhāradvāja rose from his seat and looked around in all four directions, thinking: \"Who now might partake of this remnant of my offering?\" The brahmin Sundarikabhāradvāja saw the Blessed One seated at the root of a certain tree, with his head covered. Having seen him, he took the remnant of the offering in his left hand and a water pot in his right hand, and approached the Blessed One. Then the Blessed One uncovered his head at the sound of the brahmin Sundarikabhāradvāja's footsteps. Then the brahmin Sundarikabhāradvāja thought, \"This good sir is shaven-headed, this good sir is a shaveling,\" and immediately desired to turn back. But then this thought occurred to the brahmin Sundarikabhāradvāja: \"Indeed, some brahmins are also shaven-headed. What if I were to approach him and ask about his birth?\" Then the brahmin Sundarikabhāradvāja approached the Blessed One and, having approached, said to the Blessed One: \"Of what birth is the good sir?\"\n\n\"Do not ask about birth, ask about conduct. From wood, indeed, is fire produced. Even a resolute sage from a low family, one who is restrained by moral shame, can become a thoroughbred of a person.\n\n\"One who is tamed by truth, endowed with self-mastery, one who has reached the end of knowledge, one who has completed the holy life – invite such a one to your sacrifice. In due course, such a one performs offerings to those worthy of veneration.\"\n\n\"Indeed, well-offered and well-sacrificed is this of mine, that I have seen such a master of wisdom as you. For, without seeing people like you, other folk partake of the remnant of my offering.\"\n\n\"Let the good sir Gotama partake. The good sir is a brahmin.\"\n\n\"That which is chanted as a poem is not fit for me to eat, brahmin. This is not the practice for those who rightly see. Buddhas reject that which is chanted as a poem, brahmin; this is the conduct when the Dhamma prevails.\n\n\"But with other food and drink, serve the perfect sage, the great seer, one whose taints are destroyed, one who is entirely calmed of remorse. For such a one is indeed a field for one who seeks merit.\"\n\n\"Then to whom, good sir Gotama, shall I give this remnant of the offering?\"\n\n\"Brahmin, I do not see anyone in this world with its devas, Māras, and Brahmās, among this generation with its ascetics and brahmins, its devas and humans, for whom this remnant of the offering, if eaten, would be properly digested and truly beneficial, apart from the Tathāgata or a disciple of the Tathāgata. Therefore, brahmin, you should either discard that remnant of the offering in a place without green grass, or cast it into water where there are no living creatures.\"\n\nThen the brahmin Sundarikabhāradvāja cast that remnant of the offering into water where there were no living creatures. Then, when that remnant of the offering was cast into the water, it sizzled and hissed, it smoked and fumed. Just as a ploughshare, heated all day long, when thrown into water sizzles and hisses, smokes and fumed; even so, that remnant of the offering, when cast into the water, sizzled and hissed, smoked and fumed. Then the brahmin Sundarikabhāradvāja, deeply stirred and with his hair standing on end, approached the Blessed One, and having approached, stood to one side. As the brahmin Sundarikabhāradvāja stood to one side, the Blessed One addressed him with verses:\n\n\"Brahmin, do not think that purity comes from piling up wood for sacrifice, for this is external. Indeed, those skilled in the teaching do not declare purity by that through which one seeks purification externally.\n\n\"Brahmin, having abandoned the burning of wood, I myself ignite an inner fire. Constantly burning this fire, ever with a composed mind, I live the holy life as an Arahant.\n\n\"Brahmin, your pride is indeed a burden of caustic ashes, your anger is smoke, your falsehood is the ashes. Your tongue is the ladle, your heart is the fire-place; a well-tamed self is the true light for a person.\n\n\"Brahmin, the Dhamma is a lake with the ford of virtue, undisturbed, praised by the good and the true. It is there, indeed, that those masters of wisdom bathe and cross to the other shore without clinging to their bodies.\n\n\"Truth, Dhamma, self-restraint, and the holy life – established amidst these, brahmin, is the attainment of the highest state. Pay homage to such a one who is truly upright. That is the person I call 'one who goes by the Dhamma.'\"\n\nWhen this was said, the brahmin Sundarikabhāradvāja said to the Blessed One: \"Excellent, good sir Gotama! Excellent, good sir Gotama! Just as if one were to set upright what had been overturned, or to disclose what had been hidden, or to point out the path to one who was lost, or to bring a lamp into the darkness so that those with eyes might see forms—even so has the good sir Gotama made the Dhamma clear in various ways. I go for refuge to the good sir Gotama, to the Dhamma, and to the Sangha of bhikkhus. May I receive the going forth in the presence of the good sir Gotama, and receive full ordination.\" And indeed, the Venerable Bhāradvāja became an Arahant.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයෙහි සුන්දරිකා නදිය අසල වැඩවාසය කළ සේක. ඒ සමයෙහි සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයා සුන්දරිකා නදිය අසල ගිනි පුදමින්, අග්නිහෝත්‍රය පවත්වමින් සිටියේය. ඉන්පසු සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයා ගිනි පිදීම සහ අග්නිහෝත්‍රය පැවැත්වීම අවසන් කොට අසුනෙන් නැගිට සිව්දිග බලමින්, “කවරෙක් නම් මේ හබ්‍ය ශේෂය අනුභව කරන්නේදැ”යි කල්පනා කළේය.\n\nසුන්දරිකභාරද්වාජ බ්‍රාහ්මණයා හිස වසාගෙන යම්කිසි රුක් මුලක වැඩ සිටින භාග්‍යවතුන් වහන්සේ දුටුවේය. උන්වහන්සේ දැක, වම් අතින් හබ්‍ය ශේෂය ගෙන, දකුණු අතින් කමණ්ඩලුව ගෙන භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. එවිට භාග්‍යවතුන් වහන්සේ සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයාගේ පියවර ශබ්දයෙන් හිස වැසුම ඉවත් කළ සේක. ඉන්පසු සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයා ‘මේ මහණ තෙමේ මුඩුය, මේ මහණ තෙමේ මුඩුය’ යැයි සිතා එතැනින්ම ආපසු හැරී යාමට සිතුවේය. එවිට සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයාට මෙබඳු අදහසක් ඇතිවිය: ‘සමහර බ්‍රාහ්මණයෝද හිස මුඩු කරගනිති; එසේනම් මම ඔහු වෙත ගොස් ජාතිය අසන්නෙම් නම් හොඳයැ’යි. ඉන්පසු සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, උන්වහන්සේ වෙත එළඹ මෙසේ කීවේය: ‘ගෞතමයන් වහන්ස, ඔබ කවර ජාතියකට අයත්දැ’යි.\n\n‘‘ජාතිය අසන්න එපා, චරණය අසන්න. දරවලින් ගිනි උපදින්නා සේම, පහත් කුලයක උපන්නද, ධෛර්යවත් වූ, පවට ලජ්ජා වූ, අශ්වයා සේ ආජානීය වූ මුනිවරයෙක් වේ. සත්‍යයෙන් දමනය වී, ඉන්ද්‍රිය දමනයෙන් යුක්තව, ප්‍රඥාව අවබෝධ කර, බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කළ ඔහුට යමෙක් යමක් පිදීම පිණිස ආරාධනා කරන්නේද, ඒ දක්ෂිණාර්හයාට නියම කලට පිදීම සුදුසුයැ’’යි.\n\n‘‘මා විසින් මෙවැනි සත්‍යය අවබෝධ කළ කෙනෙකු දුටුවීම, මෙය නියත වශයෙන්ම මාගේ මැනවින් පිදීමක් හා මැනවින් පුදාගත් දෙයකි. ඔබ වැනි අය නොදැකීමෙන්, අන්‍ය ජනයා හබ්‍ය ශේෂය අනුභව කරති’’ යි. ‘‘ගෞතමයන් වහන්ස, මේ දානය වළඳන සේක්වා. ඔබ බ්‍රාහ්මණයෙක්ම වේ’’ යි.\n\n‘‘බ්‍රාහ්මණය, ගාථාවලින් වර්ණනා කරන ලද දානය මට අභෝජනීයය. මෙය දැක වළඳන අයට එය ධර්මයක් නොවේ. බුදුවරු ගාථාවලින් වර්ණනා කරන ලද දේ පිළිකුල් කරති. බ්‍රාහ්මණය, ධර්මයෙහි පිහිටි අයට මෙයයි කළ යුතු වන්නේ. අන්‍ය වූ කෙලෙස් රහිත වූ, මහේශාඛ්‍ය වූ, ක්‍ෂීණාශ්‍රව වූ, කුකුසින් සංසිඳුණු අයට අන්නපානයෙන් උපස්ථාන කරන්න. සැබවින්ම එය පිණි කැමති වූවන් හට පුණ්‍ය ක්ෂේත්‍රයක් වේ’’ යි.\n\n‘‘එසේනම්, ගෞතමයන් වහන්ස, මම මේ හබ්‍ය ශේෂය කා හට දෙම්දැ’’ යි. ‘‘බ්‍රාහ්මණය, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත ලෝකයෙහි, ශ්‍රමණ බ්‍රාහ්මණ ප්‍රජාව සහිත, දෙව් මිනිසුන් සහිත ලෝකයෙහි, තථාගතයන් වහන්සේ හැර හෝ තථාගත ශ්‍රාවකයෙක් හැර, අනුභව කළ මේ හබ්‍ය ශේෂය මැනවින් පිරිණාමයට පත්වන කිසිවෙක් මම නොදකිමි. එසේ හෙයින්, බ්‍රාහ්මණය, ඔබ මේ හබ්‍ය ශේෂය තණ කොළ නැති තැනක හෝ ප්‍රාණීන් නැති දියෙහි හෝ පා කර හරින්නැ’’ යි.\n\nඉන්පසු සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයා ඒ හබ්‍ය ශේෂය ප්‍රාණීන් නැති දියෙහි පා කර හැරියේය. දියෙහි දමන ලද ඒ හබ්‍ය ශේෂය චිච්චිටායනය කරමින්, චිටිචිටායනය කරමින්, හොඳින් දුම් දමමින්, දැඩිව දුම් දමමින් පැවතුණේය. එනම්, යම්සේ දවස පුරා රත් වූ නගුල් තලයක් දියෙහි දැමූ විට චිච්චිටායනය කරමින්, චිටිචිටායනය කරමින්, හොඳින් දුම් දමමින්, දැඩිව දුම් දමමින් පවතින්නේද; එලෙසම ඒ හබ්‍ය ශේෂය දියෙහි දැමූ විට චිච්චිටායනය කරමින්, චිටිචිටායනය කරමින්, හොඳින් දුම් දමමින්, දැඩිව දුම් දමමින් පැවතුණේය.\n\nඉන්පසු සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයා සංවේගයට පත්ව, ලොමුදැහැගැන්වුණේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, එක් පසෙකින් සිට ගත්තේය. එක් පසෙකින් සිටි සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයාට භාග්‍යවතුන් වහන්සේ ගාථාවලින් මෙසේ වදාළ සේක:\n\n‘‘බ්‍රාහ්මණය, දර දමමින් තමා පිරිසිදු යැයි නොසිතන්න. එය බාහිර දෙයකි. යමෙක් බාහිර දේවලින් පිරිසිදු වීමට කැමති වේද, එයින් පිරිසිදු වීමක් ඇතැයි දක්ෂයෝ නොකියති.\n\n‘‘බ්‍රාහ්මණය, මම දර පිදීම අත්හැර, මාගේ අභ්‍යන්තරයෙහිම ජෝතිය (ප්‍රඥා ගින්න) දල්වමි. මම නිරතුරුවම ගින්නක් ඇති (තපස් ඇති) වෙමි, නිරතුරුවම සමහිත සිත් ඇත්තෙක් වෙමි. මම අර්හත් වූ බ්‍රහ්මචරියාවෙහි හැසිරෙමි.\n\n‘‘බ්‍රාහ්මණය, මානය නම් ඔබේ කර මත ඇති බර ය, ක්‍රෝධය නම් දුමය, බොරු කීම නම් අළුය. දිව නම් පිදීමට සුදුසු හැන්දය, හදවත නම් ගිනි තබන තැනය, මනාව දමනය කරගත් ආත්මය (තමාගේ සිත) නම් පුරුෂයාගේ ජෝතිය (ආලෝකය/ප්‍රඥාව) යි.\n\n‘‘බ්‍රාහ්මණය, ධර්මය නම් දහම් විලකි, ශීලය නම් එහි තොටය, එය කිසිදු කිලිටකින් තොරය, සත්පුරුෂයන් විසින් එය ප්‍රශංසා කරනු ලැබේ. සැබවින්ම, ධර්මය අවබෝධ කළ අය එහි ස්නානය කොට, කිසිදු කෙලෙස් ඇල්මකින් තොරව පරතෙරට පත්වෙති.\n\n‘‘බ්‍රාහ්මණය, සත්‍යය, ධර්මය, සංයමය, බ්‍රහ්මචරියාව යනු බ්‍රහ්මාවබෝධය පිණිස ඇති මාර්ගයයි. ඔබ සෘජු වූ අයට නමස්කාර කරන්න. මම ඒ පුද්ගලයා ධර්මය අනුගමනය කරන්නා යැයි කියමි’’ යි.\n\nමෙසේ වදාළ කල්හි සුන්දරිකභාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘භවත් ගෞතමයන් වහන්ස, ඉතා අලංකාරය… (මෙයින් අතිශයින් සතුටට පත්වීම සහ සරණ යාම ආදිය අදහස් වේ)… (අනතුරුව) ආයුෂ්මත් භාරද්වාජ තෙමේ රහතන් වහන්සේ නමක් බවට පත් විය.’’",
      "paliTitle": "Sundarikasuttaṃ"
    },
    {
      "number": 196,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena aññatarassa bhāradvājagottassa brāhmaṇassa catuddasa balībaddā naṭṭhā honti. Atha kho bhāradvājagotto brāhmaṇo te balībadde gavesanto yena so vanasaṇḍo tenupasaṅkami; upasaṅkamitvā addasa bhagavantaṃ tasmiṃ vanasaṇḍe nisinnaṃ pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. Disvāna yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavato santike imā gāthāyo abhāsi – ‘‘Na hi nūnimassa [nahanūnimassa (sī. syā. kaṃ.)] samaṇassa, balībaddā catuddasa; Ajjasaṭṭhiṃ na dissanti, tenāyaṃ samaṇo sukhī. ‘‘Na hi nūnimassa samaṇassa, tilākhettasmi pāpakā; Ekapaṇṇā dupaṇṇā [dvipaṇṇā (sī. pī.)] ca, tenāyaṃ samaṇo sukhī. ‘‘Na hi nūnimassa samaṇassa, tucchakoṭṭhasmi mūsikā; Ussoḷhikāya naccanti, tenāyaṃ samaṇo sukhī. ‘‘Na hi nūnimassa samaṇassa, santhāro sattamāsiko; Uppāṭakehi sañchanno, tenāyaṃ samaṇo sukhī. ‘‘Na hi nūnimassa samaṇassa, vidhavā satta dhītaro; Ekaputtā duputtā [dviputtā (sī. pī.)] ca, tenāyaṃ samaṇo sukhī. ‘‘Na hi nūnimassa samaṇassa, piṅgalā tilakāhatā; Sottaṃ pādena bodheti, tenāyaṃ samaṇo sukhī. ‘‘Na hi nūnimassa samaṇassa, paccūsamhi iṇāyikā; Detha dethāti codenti, tenāyaṃ samaṇo sukhī’’ti. ‘‘Na hi mayhaṃ brāhmaṇa, balībaddā catuddasa; Ajjasaṭṭhiṃ na dissanti, tenāhaṃ brāhmaṇā sukhī. ‘‘Na hi mayhaṃ brāhmaṇa, tilākhettasmi pāpakā; Ekapaṇṇā dupaṇṇā ca, tenāhaṃ brāhmaṇā sukhī. ‘‘Na hi mayhaṃ brāhmaṇa, tucchakoṭṭhasmi mūsikā; Ussoḷhikāya naccanti, tenāhaṃ brāhmaṇā sukhī. ‘‘Na hi mayhaṃ brāhmaṇa, santhāro sattamāsiko; Uppāṭakehi sañchanno, tenāhaṃ brāhmaṇā sukhī. ‘‘Na hi mayhaṃ brāhmaṇa, vidhavā satta dhītaro; Ekaputtā duputtā ca, tenāhaṃ brāhmaṇā sukhī. ‘‘Na hi mayhaṃ brāhmaṇa, piṅgalā tilakāhatā; Sottaṃ pādena bodheti, tenāhaṃ brāhmaṇā sukhī. ‘‘Na hi mayhaṃ brāhmaṇa, paccūsamhi iṇāyikā; Detha dethāti codenti, tenāhaṃ brāhmaṇā sukhī’’ti. Evaṃ vutte, bhāradvājagotto brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti; evameva bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Labheyyāhaṃ bhoto gotamassa santike pabbajjaṃ, labheyyaṃ upasampada’’nti. Alattha kho bhāradvājagotto brāhmaṇo bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno panāyasmā bhāradvājo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’’ti abbhaññāsi. Aññataro ca panāyasmā bhāradvājo arahataṃ ahosīti. Arahantavaggo paṭhamo. Tassuddānaṃ – Dhanañjānī ca akkosaṃ, asurindaṃ bilaṅgikaṃ; Ahiṃsakaṃ jaṭā ceva, suddhikañceva aggikā; Sundarikaṃ bahudhītarena ca te dasāti.",
      "english": "At one time, the Blessed One was dwelling among the Kosalans, in a certain forest thicket.\n\nNow at that time, a certain brahmin of the Bhāradvāja clan had lost fourteen oxen. Then that brahmin of the Bhāradvāja clan, searching for those oxen, approached that forest thicket; having approached, he saw the Blessed One seated in that forest thicket, with his legs crossed, his body erect, and mindfulness established in front of him. Having seen him, he approached the Blessed One; having approached, he spoke these verses in the presence of the Blessed One:\n\n\"Surely this ascetic has no fourteen oxen, which are not seen today, therefore this ascetic is happy.\nSurely this ascetic has no weeds, one-leaved or two-leaved, in his sesame field, therefore this ascetic is happy.\nSurely this ascetic has no mice dancing riotously in an empty granary, therefore this ascetic is happy.\nSurely this ascetic has no seven-month-old straw mat, covered with bugs, therefore this ascetic is happy.\nSurely this ascetic has no seven widowed daughters, with one or two children each, therefore this ascetic is happy.\nSurely this ascetic has no yellowish dog, struck by a tick, scratching its ear with its paw, therefore this ascetic is happy.\nSurely this ascetic has no creditors urging him 'Give, give!' at dawn, therefore this ascetic is happy.\"\n\n\"Indeed, brahmin, I have no fourteen oxen, which are not seen today, therefore I am happy.\nIndeed, brahmin, I have no weeds, one-leaved or two-leaved, in my sesame field, therefore I am happy.\nIndeed, brahmin, I have no mice dancing riotously in an empty granary, therefore I am happy.\nIndeed, brahmin, I have no seven-month-old straw mat, covered with bugs, therefore I am happy.\nIndeed, brahmin, I have no seven widowed daughters, with one or two children each, therefore I am happy.\nIndeed, brahmin, I have no yellowish dog, struck by a tick, scratching its ear with its paw, therefore I am happy.\nIndeed, brahmin, I have no creditors urging me 'Give, give!' at dawn, therefore I am happy.\"\n\nWhen this was said, the brahmin of the Bhāradvāja clan said to the Blessed One: \"Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as, Venerable Gotama, one might set upright what was overturned, reveal what was hidden, show the way to one who was lost, or carry an oil lamp into the darkness so that those with eyes might see forms; in the same way, the Dhamma has been made clear by Venerable Gotama in many ways. I go for refuge to Venerable Gotama, and to the Dhamma, and to the Community of Monastics. May I receive the going forth in the presence of Venerable Gotama, may I receive the full ordination.\"\n\nThen the brahmin of the Bhāradvāja clan received the going forth in the presence of the Blessed One, and he received the full ordination. Not long after his full ordination, Venerable Bhāradvāja, dwelling alone, secluded, diligent, ardent, and resolute, before long realized and abode in that unsurpassed culmination of the spiritual life, for the sake of which noble sons rightly go forth from home to homelessness, having personally known and seen it with direct knowledge in this very life. He understood: \"Birth is destroyed, the spiritual life has been lived, what was to be done has been done, there is no more for this state of being.\" And Venerable Bhāradvāja became one of the Arahants.\n\nThe first chapter on Arahants. Its summary: Dhanañjānī and Accosana, Asurinda, Bilaṅgika, Ahiṃsaka and Jaṭā, Suddhika and Aggika, Sundarika and Bahudhītara – these are the ten.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කොසොල් ජනපදයෙහි එක්තරා වනයක වැඩසිටින සේක. එකල්හි භාරද්වාජ ගෝත්‍රයට අයත් එක්තරා බ්‍රාහ්මණයෙකුගේ ගොන් දහහතර දෙනෙක් අතුරුදහන් වී සිටියහ. එකල්හි භාරද්වාජ ගෝත්‍රික බ්‍රාහ්මණයා ඒ ගොනුන් සොයමින් ඒ වනය වෙත පැමිණියේය; එහි පැමිණ, පර්යංකයෙන් වැඩසිට, සෘජු කයින් යුතුව, ඉදිරියට සිහිය පිහිටුවාගෙන, ඒ වනයෙහි වැඩසිටින භාග්‍යවතුන් වහන්සේ දුටුවේය. භාග්‍යවතුන් වහන්සේ දැක, උන්වහන්සේ වෙත පැමිණියේය; පැමිණ, භාග්‍යවතුන් වහන්සේ සමීපයෙහි මේ ගාථාවන් කීවේය –\n“මේ ශ්‍රමණයහට අද දවසේදී ගොන් දහහතර දෙනෙක් අතුරුදහන් වී නැත; එහෙයින් මේ ශ්‍රමණයෝ සුවපත් වෙති.\nමේ ශ්‍රමණයහට තල කෙතෙහි එක් පත්‍රයක්, දෙපත්‍රයක් සහිත වූ හානිකර වල් පැලෑටි නැත; එහෙයින් මේ ශ්‍රමණයෝ සුවපත් වෙති.\nමේ ශ්‍රමණයහට හිස් ගබඩාවෙහි මීයන් ඝෝෂාකාරීව පැන පැන සිටින්නේ නැත; එහෙයින් මේ ශ්‍රමණයෝ සුවපත් වෙති.\nමේ ශ්‍රමණයහට මාස හතක් පැරණි, ගැලවී ගිය දෑ වලින් වැසුණු සෙවිලි වහලක් නැත; එහෙයින් මේ ශ්‍රමණයෝ සුවපත් වෙති.\nමේ ශ්‍රමණයහට එක් පුතෙක් ඇති, දෙපුතුන් ඇති වැන්දඹු දියණියන් සත් දෙනෙක් නැත; එහෙයින් මේ ශ්‍රමණයෝ සුවපත් වෙති.\nමේ ශ්‍රමණයහට තල කෙතට වැදී පහර කෑ, කහ පැහැති, කන පයින් විදමින් සිටින ගව දෙනක් නැත; එහෙයින් මේ ශ්‍රමණයෝ සුවපත් වෙති.\nමේ ශ්‍රමණයහට අලුයම ‘දෙන්න, දෙන්නැ’යි කියා ඉක්මන් කරවන ණය ගැතියෝ නැත; එහෙයින් මේ ශ්‍රමණයෝ සුවපත් වෙති.”\n\n“බ්‍රාහ්මණය, මට අද දවසේදී ගොන් දහහතර දෙනෙක් අතුරුදහන් වී නැත; එහෙයින් බ්‍රාහ්මණය, මම සුවපත් වෙමි.\nබ්‍රාහ්මණය, මට තල කෙතෙහි එක් පත්‍රයක්, දෙපත්‍රයක් සහිත වූ හානිකර වල් පැලෑටි නැත; එහෙයින් බ්‍රාහ්මණය, මම සුවපත් වෙමි.\nබ්‍රාහ්මණය, මට හිස් ගබඩාවෙහි මීයන් ඝෝෂාකාරීව පැන පැන සිටින්නේ නැත; එහෙයින් බ්‍රාහ්මණය, මම සුවපත් වෙමි.\nබ්‍රාහ්මණය, මට මාස හතක් පැරණි, ගැලවී ගිය දෑ වලින් වැසුණු සෙවිලි වහලක් නැත; එහෙයින් බ්‍රාහ්මණය, මම සුවපත් වෙමි.\nබ්‍රාහ්මණය, මට එක් පුතෙක් ඇති, දෙපුතුන් ඇති වැන්දඹු දියණියන් සත් දෙනෙක් නැත; එහෙයින් බ්‍රාහ්මණය, මම සුවපත් වෙමි.\nබ්‍රාහ්මණය, මට තල කෙතට වැදී පහර කෑ, කහ පැහැති, කන පයින් විදමින් සිටින ගව දෙනක් නැත; එහෙයින් බ්‍රාහ්මණය, මම සුවපත් වෙමි.\nබ්‍රාහ්මණය, මට අලුයම ‘දෙන්න, දෙන්නැ’යි කියා ඉක්මන් කරවන ණය ගැතියෝ නැත; එහෙයින් බ්‍රාහ්මණය, මම සුවපත් වෙමි.”\n\nමෙසේ පැවසූ කල්හි, භාරද්වාජ ගෝත්‍රික බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි, භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසන ලද දෙයක් විවෘත කරන්නේද, මග හැරී ගිය කෙනෙකුට මග පෙන්වන්නේද, නැතහොත් අඳුරෙහි තෙල් පහනක් දල්වන්නේද – ඇස් ඇති අය රූප දකිත්වායි; භවත් ගෞතමයන් වහන්සේ විසින්ද නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරනු ලැබුවේය. මම ඒ භවත් ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂූන් වහන්සේලාගේ සංඝයාද සරණ යමි. මම භවත් ගෞතමයන් වහන්සේ සමීපයෙහි පැවිද්ද ලබන්නෙම් නම්, උපසම්පදාව ලබන්නෙම් නම් යෙහෙකි.”\n\nභාරද්වාජ ගෝත්‍රික බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ සමීපයෙහි පැවිද්ද ලැබුවේය, උපසම්පදාවද ලැබුවේය. එවිට ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ වැඩි කලක් නොගොස් උපසම්පදා වූ නමුත්, තනිවම හුදෙකලාව, අප්‍රමාදීව, වීර්යවත්ව, යොමු කළ සිතින් යුතුව වැඩ වාසය කරමින්, වැඩි කලක් නොගොසින්ම – යම් අර්ථයක් පිණිස කුල පුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරිකභාවයට පැවිදි වෙත්ද, ඒ අනුත්තර වූ – බ්‍රහ්මචර්යාවේ කෙළවර (වූ අරහත්වය) මේ අත්බැව්හිදීම තමාගේම උසස් ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කළේය. “ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුත්ත කරන ලදී, මේ සඳහා තවත් කිසිවක් නැතැ”යි අවබෝධ කළේය. එසේම ආයුෂ්මත් භාරද්වාජ තෙරණුවෝ රහතුන් වහන්සේලා අතුරෙන් එක් නමක වූ සේක.\n\nඅරහන්ත වග්ගය පළමුවැන්නයි. එහි උද්දානය – ධනඤ්ජානී, අක්කෝස, අසුරින්ද, බිලංගික, අහිංසක, ජටා, සුද්ධික, අග්ගික, සුන්දරික සහ බහුධීතර යන මේ සූත්‍ර දහයයි.",
      "paliTitle": "Bahudhītarasuttaṃ"
    },
    {
      "number": 197,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā magadhesu viharati dakkhiṇāgirismiṃ ekanāḷāyaṃ brāhmaṇagāme. Tena kho pana samayena kasibhāradvājassa [kasikabhāradvājassa (ka.)] brāhmaṇassa pañcamattāni naṅgalasatāni payuttāni honti vappakāle. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena kasibhāradvājassa brāhmaṇassa kammanto tenupasaṅkami. Tena kho pana samayena kasibhāradvājassa brāhmaṇassa parivesanā vattati. Atha kho bhagavā yena parivesanā tenupasaṅkami; upasaṅkamitvā ekamantaṃ aṭṭhāsi. Addasā kho kasibhāradvājo brāhmaṇo bhagavantaṃ piṇḍāya ṭhitaṃ. Disvā bhagavantaṃ etadavoca – ‘‘ahaṃ kho, samaṇa, kasāmi ca vapāmi ca, kasitvā ca vapitvā ca bhuñjāmi. Tvampi, samaṇa, kasassu ca vapassu ca, kasitvā ca vapitvā ca bhuñjassū’’ti. ‘‘Ahampi kho, brāhmaṇa, kasāmi ca vapāmi ca, kasitvā ca vapitvā ca bhuñjāmī’’ti. Na kho mayaṃ passāma bhoto gotamassa yugaṃ vā naṅgalaṃ vā phālaṃ vā pācanaṃ vā balībadde vā, atha ca pana bhavaṃ gotamo evamāha – ‘‘ahampi kho, brāhmaṇa, kasāmi ca vapāmi ca, kasitvā ca vapitvā ca bhuñjāmī’’ti. Atha kho kasibhāradvājo brāhmaṇo bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kassako paṭijānāsi, na ca passāmi te kasiṃ; Kassako pucchito brūhi, kathaṃ jānemu taṃ kasi’’nti. ‘‘Saddhā bījaṃ tapo vuṭṭhi, paññā me yuganaṅgalaṃ; Hirī īsā mano yottaṃ, sati me phālapācanaṃ. ‘‘Kāyagutto vacīgutto, āhāre udare yato; Saccaṃ karomi niddānaṃ, soraccaṃ me pamocanaṃ. ‘‘Vīriyaṃ me dhuradhorayhaṃ, yogakkhemādhivāhanaṃ; Gacchati anivattantaṃ, yattha gantvā na socati. ‘‘Evamesā kasī kaṭṭhā, sā hoti amatapphalā; Etaṃ kasiṃ kasitvāna, sabbadukkhā pamuccatī’’ti. ‘‘Bhuñjatu bhavaṃ gotamo. Kassako bhavaṃ. Yañhi bhavaṃ gotamo amatapphalampi kasiṃ kasatī’’ti [bhāsatīti (ka.)]. ‘‘Gāthābhigītaṃ me abhojaneyyaṃ, Sampassataṃ brāhmaṇa nesa dhammo; Gāthābhigītaṃ panudanti buddhā, Dhamme sati brāhmaṇa vuttiresā. ‘‘Aññena ca kevalinaṃ mahesiṃ, Khīṇāsavaṃ kukkuccavūpasantaṃ; Annena pānena upaṭṭhahassu, Khettañhi taṃ puññapekkhassa hotī’’ti. Evaṃ vutte, kasibhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama… pe… ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Thus have I heard. At one time the Blessed One was dwelling in Magadha, in the brahmin village of Ekanāḷā on Dakkhiṇāgiri. Now at that time, over five hundred plows were yoked for the brahmin Kasibhāradvāja during the sowing season. Then, in the morning, the Blessed One dressed, and taking his bowl and robe, went to where the brahmin Kasibhāradvāja's work was taking place. Now at that time, food was being distributed for the brahmin Kasibhāradvāja. Then the Blessed One went to where the food was being distributed; having gone there, he stood to one side. The brahmin Kasibhāradvāja saw the Blessed One standing for alms. Seeing him, he said to the Blessed One: \"I, ascetic, plow and sow, and having plowed and sown, I eat. You too, ascetic, should plow and sow, and having plowed and sown, you should eat.\" The Blessed One replied: \"I too, brahmin, plow and sow, and having plowed and sown, I eat.\" \"But we do not see Master Gotama's yoke, or plow, or plowshare, or goad, or oxen; yet Master Gotama says, 'I too, brahmin, plow and sow, and having plowed and sown, I eat.'\"\n\nThen the brahmin Kasibhāradvāja addressed the Blessed One with a verse:\n\"You claim to be a farmer, but I see no farming of yours. When asked, farmer, tell us, how are we to know your farming?\"\n\nThe Blessed One replied:\n\"Faith is my seed, austerity is the rain, wisdom is my yoke and plow. Conscience is the pole, the mind is the yoke-strap, mindfulness is my plowshare and goad.\nProtected in body, protected in speech, restrained in eating; I make truth my weed-clearing, and gentleness is my release.\nEnergy is my burden-bearing draft-ox, carrying me to the security from bondage. It goes on, never turning back, to where one, having gone, grieves no more.\nThus is this farming cultivated, and it bears the fruit of the Deathless. Having cultivated this farming, one is freed from all suffering.\"\n\nThe brahmin Kasibhāradvāja said: \"May Master Gotama eat. Master, you are indeed a farmer, for Master Gotama cultivates a farming that yields the fruit of the Deathless!\"\n\nThe Blessed One replied: \"That which is obtained by singing verses is not to be eaten by me, brahmin; it is not the practice of those who rightly see. The Buddhas reject that which is obtained by singing verses. When the Dhamma is present, brahmin, this is the rule. Serve with food and drink one who is a perfected one, a great sage, whose taints are destroyed, who is tranquil and free from agitation. Indeed, such a one is a field of merit for those seeking merit.\"\n\nWhen this was said, the brahmin Kasibhāradvāja said to the Blessed One: \"Excellent, Master Gotama! Excellent! Just as if someone were to set upright what had been overturned, or reveal what was hidden, or point out the way to one who was lost, or carry a lamp in the dark so those with eyes could see forms, in the same way has Master Gotama made the Dhamma clear in many ways. I go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha. May Master Gotama remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍යවතුන් වහන්සේ මගධ දේශයේ දක්ෂිණාගිරි ජනපදයේ ඒකනාළා නම් බ්‍රාහ්මණ ගමෙහි වැඩසිටින සේක. එකල කසිභාරද්වාජ බමුණාගේ පන්සියයක් පමණ නගුල් වැපිරීමේ කාලයේදී යොදවා තිබුණි. එකල්හි භාග්‍යවතුන් වහන්සේ පෙරවරු සමයෙහි හැඳ, පාත්‍රය හා සිවුර ගෙන කසිභාරද්වාජ බමුණාගේ කෙත වෙත වැඩම කළ සේක. එකල කසිභාරද්වාජ බමුණාගේ භෝජන සංග්‍රහයක් පැවැත්වෙමින් තිබුණි. එකල්හි භාග්‍යවතුන් වහන්සේ භෝජන සංග්‍රහය පැවැත්වෙන තැනට වැඩම කළ සේක. එහි වැඩම කොට එක් පසෙක සිටි සේක.\n\nකසිභාරද්වාජ බමුණා පිඬුසිඟා වඩින භාග්‍යවතුන් වහන්සේව දුටුවේය. භාග්‍යවතුන් වහන්සේ දැක මෙසේ කීවේය – \"ශ්‍රමණය, මම සීසාමි, වපුරමි, සීසා වපුරා අනුභව කරමි. ශ්‍රමණය, ඔබත් සීසන්න, වපුරන්න, සීසා වපුරා අනුභව කරන්නැ\"යි. \"බමුණ, මමත් සීසාමි, වපුරමි, සීසා වපුරා අනුභව කරමි\"යි (භාග්‍යවතුන් වහන්සේ) වදාළ සේක. \"අපි භවත් ගෞතමයන් වහන්සේගේ වියගහක් හෝ නගුලක් හෝ සීසනයක් හෝ කමුවක් හෝ ගොනුන් හෝ නොදකිමු. එසේ තිබියදීත් භවත් ගෞතමයන් වහන්සේ මෙසේ කියනු ලබයි – \"බමුණ, මමත් සීසාමි, වපුරමි, සීසා වපුරා අනුභව කරමි\"යි. එකල්හි කසිභාරද්වාජ බමුණා භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසුවේය – \"ඔබ ගොවියෙකැයි ප්‍රකාශ කරන්නෙහි, එහෙත් අපි ඔබගේ ගොවිතැනක් නොදකිමු. ගොවියෙකු ලෙස ඔබෙන් අසනු ලැබූ කල්හි, එම ගොවිතැන අප දැනගන්නේ කෙසේදැයි කියන්නැ\"යි.\n\n\"ශ්‍රද්ධාව නම් බීජයයි, තපස නම් වැස්සයි, ප්‍රඥාව මාගේ වියගහ සහ නගුලයි. හිරිය නම් නගුල් දණ්ඩයි, මනස නම් වියත් ලණුවයි, සිහිය මාගේ සීසනය හා කමුවයි. කයින් (පාපයෙන්) වැළකී සිටින්නෙමි, වචනයෙන් (පාපයෙන්) වැළකී සිටින්නෙමි, ආහාරයෙහි සංයමයෙන් යුක්තව වළඳන්නෙමි. සත්‍යය නම් මාගේ බිජුවට බැඳීමයි, සන්සුන්කම මාගේ (වල් පැළ) උදුරා දැමීමයි. වීර්යය නම් බර දරන මාගේ ගොනායි, එය යෝගක්ෂේමය කරා පමුණුවන වාහනයයි. එය නොනැවතී ගමන් කරයි, යම් තැනකට ගොස් දුකට පත් නොවේද, ඒ නිවන කරා ගමන් කරයි. මෙසේ මේ ගොවිතැන් කටයුත්ත කරනු ලබයි, එය අමා මහ නිවන් ඵල ලබා දෙයි. මේ ගොවිතැන කොට සියලු දුකින් මිදෙන්නේය\"යි (භාග්‍යවතුන් වහන්සේ වදාළ සේක).\n\n\"භවත් ගෞතමයන් වහන්සේ වළඳන සේක්වා. භවත් ඔබ (සැබෑ) ගොවියෙකි. මක්නිසාද යත්, භවත් ගෞතමයන් වහන්සේ අමා නිවන් ඵල දෙන ගොවිතැනක්ම වගා කරන සේකැ\"යි (බමුණා කීවේය). \"බමුණ, ගාථා වලින් වර්ණනා කර ලබාදුන් ආහාරය මට අනුභව කිරීමට නුසුදුසුය. දැක සිටින බමුණන්ට මෙය ධර්මයක් නොවේ. බුදුවරු ගාථා වලින් (ප්‍රශංසා කොට) ලැබෙන දේ ප්‍රතික්ෂේප කරති. බමුණ, මේ ධර්මය ඇති කල්හි (බුද්ධ ශාසනයෙහි) මෙයම චාරිත්‍රයයි. යම් කෙලෙස් රහිත වූ මහර්ෂිවරයෙක්, ක්ෂීණාශ්‍රව වූ, කුකුස් සන්සිඳවූ (කෙනෙක් වේ නම්) ඔහුට ආහාර පානයෙන් උපස්ථාන කරන්න. මක්නිසාද යත්, පින් කැමති කෙනෙකුට (එය) ඒ (අරහත් පුද්ගලයා) පින් කෙතක් වන්නේය\"යි (භාග්‍යවතුන් වහන්සේ වදාළ සේක).\n\nමෙසේ වදාළ කල්හි කසිභාරද්වාජ බමුණා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය – \"භවත් ගෞතමයන් වහන්සේ ඉතා යහපත් සේක! භවත් ගෞතමයන් වහන්සේ ඉතා යහපත් සේක! යම් සේ යමෙක් යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වැසී තිබූ දෙයක් එළිපෙහෙළි කරන්නේද, මංමුළා වූවෙකුට මග පෙන්වන්නේද, ඇස් ඇති අයට රූප දැකීමට හැකි වන සේ අන්ධකාරයෙහි තෙල් පහනක් දල්වන්නේද, එසේම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. එබැවින් මම භවත් ගෞතමයන් වහන්සේද, ධර්මයද, සංඝයාද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු වශයෙන් මා පිළිගන්නා සේක්වා\" යි.",
      "paliTitle": "Kasibhāradvājasuttaṃ",
      "vagga": "Upāsakavaggo"
    },
    {
      "number": 198,
      "pali": "Sāvatthinidānaṃ. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena udayassa brāhmaṇassa nivesanaṃ tenupasaṅkami. Atha kho udayo brāhmaṇo bhagavato pattaṃ odanena pūresi. Dutiyampi kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena udayassa brāhmaṇassa nivesanaṃ tenupasaṅkami…pe… tatiyampi kho udayo brāhmaṇo bhagavato pattaṃ odanena pūretvā bhagavantaṃ etadavoca – ‘‘pakaṭṭhakoyaṃ samaṇo gotamo punappunaṃ āgacchatī’’ti. ‘‘Punappunañceva vapanti bījaṃ, punappunaṃ vassati devarājā; Punappunaṃ khettaṃ kasanti kassakā, punappunaṃ dhaññamupeti raṭṭhaṃ. ‘‘Punappunaṃ yācakā yācayanti, punappunaṃ dānapatī dadanti; Punappunaṃ dānapatī daditvā, punappunaṃ saggamupenti ṭhānaṃ. ‘‘Punappunaṃ khīranikā duhanti, punappunaṃ vaccho upeti mātaraṃ; Punappunaṃ kilamati phandati ca, punappunaṃ gabbhamupeti mando. ‘‘Punappunaṃ jāyati mīyati ca, punappunaṃ sivathikaṃ [sīvathikaṃ (sī. syā. kaṃ. pī.)] haranti; Maggañca laddhā apunabbhavāya, na punappunaṃ jāyati bhūripañño’’ti [punappunaṃ jāyati bhūripaññoti (syā. kaṃ. ka.)]. Evaṃ vutte, udayo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Origin at Savatthi.\n\nThen the Blessed One, having dressed in the morning, taking his bowl and robe, went to the dwelling of Udaya the brahmin. Then Udaya the brahmin filled the Blessed One's bowl with rice. For a second time, the Blessed One, having dressed in the morning, taking his bowl and robe, went to the dwelling of Udaya the brahmin. And for a third time, Udaya the brahmin, having filled the Blessed One's bowl with rice, said to the Blessed One: \"This ascetic Gotama is persistent in coming again and again!\"\n\n\"Again and again they sow seeds; again and again the king of devas rains. Again and again farmers plough the fields; again and again grain comes to the kingdom.\n\nAgain and again supplicants beg; again and again donors give. Again and again, having given, donors go to a heavenly abode.\n\nAgain and again milkers milk; again and again the calf goes to its mother. Again and again the deluded one suffers and trembles; again and again he enters the womb.\n\nAgain and again he is born and dies; again and again they carry him to the charnel ground. But having found the path to non-recurrence of becoming, the profoundly wise one is not born again and again.\"\n\nWhen this was said, Udaya the brahmin said to the Blessed One: \"Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as one might set upright what was overturned, or disclose what was hidden, or point out the way to one who was lost, or bring a lamp into the darkness so that those with eyes can see forms—in the same way has the Venerable Gotama made the Dhamma clear in various ways. I go to the Venerable Gotama for refuge, to the Dhamma, and to the Saṅgha. May Venerable Gotama accept me as a lay follower who has gone for refuge from this day forth as long as life lasts.\"",
      "sinhala": "සැවැත්නුවරදීය.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ පොරවා පාත්‍රය හා සිවුරු රැගෙන උදය බමුණාගේ නිවස වෙත වැඩියේය. එකල්හි උදය බමුණා භාග්‍යවතුන් වහන්සේගේ පාත්‍රය බතින් පිරවීය. දෙවන වරටත් භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ පොරවා පාත්‍රය හා සිවුරු රැගෙන උදය බමුණාගේ නිවස වෙත වැඩියේය... තුන්වන වරටත් උදය බමුණා භාග්‍යවතුන් වහන්සේගේ පාත්‍රය බතින් පුරවා, භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"මේ ගෝතම ශ්‍රමණයා නිතරම පැමිණෙන්නෙකි, නැවත නැවතත් එන්නේය.\"\n\n\"නැවත නැවතත් බීජ වපුරති, නැවත නැවතත් දෙව් රජු වසිති; නැවත නැවතත් ගොවීහු කෙත් කොටති, නැවත නැවතත් රටට ධාන්‍ය ලැබේ.\n\nනැවත නැවතත් යාචකයෝ යාච්ඤා කරති, නැවත නැවතත් දානපතිහු දෙති; නැවත නැවතත් දානපතිහු දී, නැවත නැවතත් ස්වර්ගීය තලයට පැමිණෙති.\n\nනැවත නැවතත් කිරි දොවන්නෝ කිරි දොවති, නැවත නැවතත් වස්සා මව වෙත එයි; නැවත නැවතත් අඥානයා වෙහෙසට පත්ව දඟලයි, නැවත නැවතත් ගර්භාෂයකට ඇතුළු වේ.\n\nනැවත නැවතත් උපදී මිය යයි, නැවත නැවතත් සොහොනට ගෙන යති; නමුත් නැවත භවයට නොපැමිණීමේ මාර්ගය ලැබීමෙන්, මහා ප්‍රාඥයා නැවත නැවතත් උපදින්නේ නැත.\"\n\nමෙසේ පැවසූ විට උදය බමුණා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භවත් ගෝතමයන් වහන්ස, ඉතා අලංකාරය... අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා භවත් ගෝතමයන් වහන්සේ පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Udayasuttaṃ"
    },
    {
      "number": 199,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena bhagavā vātehābādhiko hoti; āyasmā ca upavāṇo bhagavato upaṭṭhāko hoti. Atha kho bhagavā āyasmantaṃ upavāṇaṃ āmantesi – ‘‘iṅgha me tvaṃ, upavāṇa, uṇhodakaṃ jānāhī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā upavāṇo bhagavato paṭissutvā nivāsetvā pattacīvaramādāya yena devahitassa brāhmaṇassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā tuṇhībhūto ekamantaṃ aṭṭhāsi. Addasā kho devahito brāhmaṇo āyasmantaṃ upavāṇaṃ tuṇhībhūtaṃ ekamantaṃ ṭhitaṃ. Disvāna āyasmantaṃ upavāṇaṃ gāthāya ajjhabhāsi – ‘‘Tuṇhībhūto bhavaṃ tiṭṭhaṃ, muṇḍo saṅghāṭipāruto; Kiṃ patthayāno kiṃ esaṃ, kiṃ nu yācitumāgato’’ti. ‘‘Arahaṃ sugato loke, vātehābādhiko muni; Sace uṇhodakaṃ atthi, munino dehi brāhmaṇa. ‘‘Pūjito pūjaneyyānaṃ, sakkareyyāna sakkato; Apacito apaceyyānaṃ [apacineyyānaṃ (sī. syā. kaṃ.) ṭīkā oloketabbā], tassa icchāmi hātave’’ti. Atha kho devahito brāhmaṇo uṇhodakassa kājaṃ purisena gāhāpetvā phāṇitassa ca puṭaṃ āyasmato upavāṇassa pādāsi. Atha kho āyasmā upavāṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ uṇhodakena nhāpetvā [nahāpetvā (sī. pī.)] uṇhodakena phāṇitaṃ āloletvā bhagavato pādāsi. Atha kho bhagavato ābādho paṭippassambhi. Atha kho devahito brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho devahito brāhmaṇo bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kattha dajjā deyyadhammaṃ, kattha dinnaṃ mahapphalaṃ; Kathañhi yajamānassa, kathaṃ ijjhati dakkhiṇā’’ti. ‘‘Pubbenivāsaṃ yo vedī, saggāpāyañca passati; Atho jātikkhayaṃ patto, abhiññāvosito muni. ‘‘Ettha dajjā deyyadhammaṃ, ettha dinnaṃ mahapphalaṃ; Evañhi yajamānassa, evaṃ ijjhati dakkhiṇā’’ti. Evaṃ vutte, devahito brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "At Sāvatthī. Now at that time the Blessed One was afflicted by a wind disorder, and Venerable Upavāṇa was the Blessed One's attendant. Then the Blessed One addressed Venerable Upavāṇa: \"Upavāṇa, please go find some warm water for me.\" \"Yes, venerable sir,\" Venerable Upavāṇa replied to the Blessed One, then adjusted his lower robe, took his bowl and outer robe, and approached the dwelling of the brahmin Devahita. Having approached, he stood silently to one side. The brahmin Devahita saw Venerable Upavāṇa standing silently to one side. Seeing Venerable Upavāṇa, he addressed him in verse: \"You stand silently, venerable sir, shaven and wrapped in your outer robe. What do you wish for, what do you seek, what have you come here to request?\"\n\n\"The Arahant, the Fortunate One in the world, the sage, is afflicted by a wind disorder. If there is warm water, brahmin, please give it to the sage. He is honored by those worthy of honor, respected by those worthy of respect, revered by those worthy of reverence. I desire to give it to him.\"\n\nThen the brahmin Devahita had a man carry a load of warm water and gave a pouch of molasses to Venerable Upavāṇa. Then Venerable Upavāṇa approached the Blessed One. Having approached, he bathed the Blessed One with the warm water, then dissolved the molasses in warm water and gave it to the Blessed One. Then the Blessed One's ailment subsided.\n\nThen the brahmin Devahita approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging courteous and memorable talk, he sat down to one side. As he sat to one side, the brahmin Devahita addressed the Blessed One in verse: \"Where should one give a donation? Where does a gift yield great fruit? How does the offering of one making a sacrifice prosper?\"\n\n\"He who knows his past lives, and sees the heavens and the lower realms, and moreover has attained the destruction of rebirth, the sage who has perfected his supernormal knowledges—it is here that one should give a donation, it is here that a gift yields great fruit. In this way, the offering of one making a sacrifice prospers.\"\n\nWhen this was said, the brahmin Devahita said to the Blessed One: \"Excellent, Venerable Gotama! ... From this day forth, may Venerable Gotama remember me as a lay follower who has gone for refuge for life.\"",
      "sinhala": "සාවත්ථි නිදානය. එකල භාග්‍යවතුන් වහන්සේ වාත රෝගයකින් පෙළෙමින් සිටි සේක. ආයුෂ්මත් උපවාණ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේගේ උපස්ථායකයා වූ සේක. එවිට භාග්‍යවතුන් වහන්සේ ආයුෂ්මත් උපවාණ ස්ථවිරයන් වහන්සේ අමතා, “එම්බා උපවාණ, මට උණු පැන් සොයාගෙන එන්න”යි වදාළ සේක. “එසේය, භාග්‍යවතුන් වහන්ස”යි ආයුෂ්මත් උපවාණ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, සිවුරු පොරවාගෙන, පාත්‍ර සිවුරු ද රැගෙන, දෙවහිත නම් බ්‍රාහ්මණයාගේ නිවස වෙත එළඹුණ සේක. එහි එළඹ නිහඬව එකත්පසෙකින් සිටගෙන සිටි සේක. දෙවහිත බ්‍රාහ්මණයා නිහඬව එකත්පසෙකින් සිටගෙන සිටින ආයුෂ්මත් උපවාණ ස්ථවිරයන් වහන්සේ දුටුවේය. දුටු විගස ඔහු ආයුෂ්මත් උපවාණ ස්ථවිරයන් වහන්සේට ගාථාවකින් මෙසේ කීවේය – “නිහඬව සිටගෙන ඉන්නා ඔබ, හිස මුඩු කරගත්, සංඝාටියෙන් වැසුණු ශ්‍රමණයෙකි. කුමක් පතමින්, කුමක් සොයමින්, කුමක් අයදිනු පිණිස ආවෙහි දැයි?” “ලෝකයෙහි වැඩ සිටින අරහත් වූ, සුගත වූ මුනිවරයාණෝ වාත රෝගයකින් පෙළෙමින් සිටිති. බ්‍රාහ්මණ, ඔබට උණු පැන් ඇත්නම්, ඒ මුනිවරයාණන්ට දෙන්න. පූජනීය පුද්ගලයන් විසින් පුදන ලද, සත්කාර ලැබීමට සුදුසු පුද්ගලයන් විසින් සත්කාර කරන ලද, අපචායනීය පුද්ගලයන් විසින් අපචායන කරන ලද උන්වහන්සේට (එය) ලබා ගැනීමට මම කැමැත්තෙමි.” එවිට දෙවහිත බ්‍රාහ්මණයා උණු පැන් කාවුවක් පුරුෂයෙකු ලවා ගෙන්වා, පැණි පොට්ටනියක් සමඟ ආයුෂ්මත් උපවාණ ස්ථවිරයන් වහන්සේට දුන්නේය. එවිට ආයුෂ්මත් උපවාණ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට එළඹ, උන්වහන්සේට උණු පැන් ස්නානය කරවා, උණු පැන්වලින් පැණි දියකර, භාග්‍යවතුන් වහන්සේට දුන් සේක. එවිට භාග්‍යවතුන් වහන්සේගේ ආබාධය සන්සිඳුණේය.\n\nඑවිට දෙවහිත බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩ සිටි තැනට එළඹ, එහි එළඹ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු කථා බස් හුවමාරු කරගෙන එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි දෙවහිත බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීවේය – “දැහැමි දානය කොතැනට දිය යුතුද? කොතැන දුන් දානය මහත්ඵල වේද? යජමාන පුද්ගලයාට දක්ෂිණාව කෙසේ සඵල වේද?” “යමෙක් පෙර විසූ කඳන් සමූහය දනීද, සුගති දුගති දකියිද, යමෙක් ජාතික්ෂයයට පැමිණියේද, අභිඥා ඥානයෙන් කෙළවරට පැමිණි මුනිවරයෙක් වේද, මෙවැනි තැනැත්තෙකුට දැහැමි දානය දිය යුතුය. මෙතැන දුන් දානය මහත්ඵල වේ. මෙලෙසින්ම යජමාන පුද්ගලයාට දක්ෂිණාව සඵල වේ.” මෙසේ වදාළ විට, දෙවහිත බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය – “භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි… (පෙ)… භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයකු ලෙස මා පිළිගන්නා සේක්වා!”",
      "paliTitle": "Devahitasuttaṃ"
    },
    {
      "number": 200,
      "pali": "Sāvatthinidānaṃ. Atha kho aññataro brāhmaṇamahāsālo lūkho lūkhapāvuraṇo [lūkhapāpuraṇo (sī. syā. kaṃ. pī.)] yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho taṃ brāhmaṇamahāsālaṃ bhagavā etadavoca – ‘‘kinnu tvaṃ, brāhmaṇa, lūkho lūkhapāvuraṇo’’ti? ‘‘Idha me, bho gotama, cattāro puttā. Te maṃ dārehi saṃpuccha gharā nikkhāmentī’’ti. ‘‘Tena hi tvaṃ, brāhmaṇa, imā gāthāyo pariyāpuṇitvā sabhāyaṃ mahājanakāye sannipatite puttesu ca sannisinnesu bhāsassu – ‘‘Yehi jātehi nandissaṃ, yesañca bhavamicchisaṃ; Te maṃ dārehi saṃpuccha, sāva vārenti sūkaraṃ. ‘‘Asantā kira maṃ jammā, tāta tātāti bhāsare; Rakkhasā puttarūpena, te jahanti vayogataṃ. ‘‘Assova jiṇṇo nibbhogo, khādanā apanīyati; Bālakānaṃ pitā thero, parāgāresu bhikkhati. ‘‘Daṇḍova kira me seyyo, yañce puttā anassavā; Caṇḍampi goṇaṃ vāreti, atho caṇḍampi kukkuraṃ. ‘‘Andhakāre pure hoti, gambhīre gādhamedhati; Daṇḍassa ānubhāvena, khalitvā patitiṭṭhatī’’ti. Atha kho so brāhmaṇamahāsālo bhagavato santike imā gāthāyo pariyāpuṇitvā sabhāyaṃ mahājanakāye sannipatite puttesu ca sannisinnesu abhāsi – ‘‘Yehi jātehi nandissaṃ, yesañca bhavamicchisaṃ; Te maṃ dārehi saṃpuccha, sāva vārenti sūkaraṃ. ‘‘Asantā kira maṃ jammā, tāta tātāti bhāsare; Rakkhasā puttarūpena, te jahanti vayogataṃ. ‘‘Assova jiṇṇo nibbhogo, khādanā apanīyati; Bālakānaṃ pitā thero, parāgāresu bhikkhati. ‘‘Daṇḍova kira me seyyo, yañce puttā anassavā; Caṇḍampi goṇaṃ vāreti, atho caṇḍampi kukkuraṃ. ‘‘Andhakāre pure hoti, gambhīre gādhamedhati; Daṇḍassa ānubhāvena, khalitvā patitiṭṭhatī’’ti. Atha kho naṃ brāhmaṇamahāsālaṃ puttā gharaṃ netvā nhāpetvā paccekaṃ dussayugena acchādesuṃ. Atha kho so brāhmaṇamahāsālo ekaṃ dussayugaṃ ādāya yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho brāhmaṇamahāsālo bhagavantaṃ etadavoca – ‘‘mayaṃ, bho gotama, brāhmaṇā nāma ācariyassa ācariyadhanaṃ pariyesāma. Paṭiggaṇhatu me bhavaṃ gotamo ācariyadhana’’nti. Paṭiggahesi bhagavā anukampaṃ upādāya. Atha kho so brāhmaṇamahāsālo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "At Sāvatthi. Then a certain wealthy brahmin, unkempt and wearing rough garments, approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging courteous and memorable remarks, he sat down to one side. To that wealthy brahmin, seated to one side, the Blessed One said this: \"Brahmin, why are you unkempt and wearing rough garments?\"\n\n\"Here, Venerable Gotama, I have four sons. They, after consulting with their wives, have driven me out of the house.\"\n\n\"In that case, Brahmin, learn these verses and recite them in the assembly when a large crowd has gathered and your sons are also present.\"\n\n\"Those for whose birth I rejoiced, and for whose welfare I wished;\nThey, after consulting with their wives, drive me away as if from a pig sty.\n\nThese wretched ones, though they say 'Father, father' to me;\nAre demons in the guise of sons, abandoning me in my old age.\n\nJust as an old, useless horse is removed from the feeding trough;\nSo the aged father of children now begs in others' houses.\n\nIndeed, a staff would be better for me than these disobedient sons;\nFor it wards off even a fierce bull, and also a fierce dog.\n\nWhen it is dark in front, it helps one find solid ground in deep places;\nBy the power of the staff, one recovers if one stumbling and stands firm again.\"\n\nThen that wealthy brahmin, having learned these verses from the Blessed One, recited them in the assembly when a large crowd had gathered and his sons were also present:\n\n\"Those for whose birth I rejoiced, and for whose welfare I wished;\nThey, after consulting with their wives, drive me away as if from a pig sty.\n\nThese wretched ones, though they say 'Father, father' to me;\nAre demons in the guise of sons, abandoning me in my old age.\n\nJust as an old, useless horse is removed from the feeding trough;\nSo the aged father of children now begs in others' houses.\n\nIndeed, a staff would be better for me than these disobedient sons;\nFor it wards off even a fierce bull, and also a fierce dog.\n\nWhen it is dark in front, it helps one find solid ground in deep places;\nBy the power of the staff, one recovers if one stumbles and stands firm again.\"\n\nThen his sons took the wealthy brahmin home, bathed him, and individually presented him with a pair of garments. Then that wealthy brahmin, taking one pair of garments, approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging courteous and memorable remarks, he sat down to one side. Seated to one side, the wealthy brahmin said this to the Blessed One: \"Venerable Gotama, we brahmins are accustomed to seeking a teacher's fee for our teacher. May Venerable Gotama accept this teacher's fee from me.\" The Blessed One accepted it out of compassion. Then that wealthy brahmin said to the Blessed One: \"Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to carry a lamp into the darkness so those with eyes could see forms, even so has Venerable Gotama made the Dhamma clear in many ways. I go for refuge to Venerable Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. May Venerable Gotama accept me as a lay follower who has taken refuge from this day forth as long as life lasts.\"",
      "sinhala": "සැවැත් නුවරදීය.\n\nඉන්පසු එක්තරා ගොරෝසු ඇඳුම් ඇඳගත්, දුක්ඛිත මහබමුණෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා බහ නිමවා එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ඒ මහබමුණාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ‘‘බමුණ, කුමක් හෙයින් නුඹ මෙලෙස ගොරෝසු ඇඳුම් ඇඳගෙන, දුක්ඛිතව සිටින්නෙහිද?’’යි. ‘‘භවත් ගෞතමයන් වහන්ස, මට මෙහි පුතුන් සතර දෙනෙක් සිටිති. ඔවුහු මා ඔවුන්ගේ භාර්යාවන් සමඟ සාකච්ඡා කර, ගෙදරින් පිටමං කරති’’යි. ‘‘එසේ නම් බමුණ, නුඹ මේ ගාථාවන් ඉගෙනගෙන, සභාවට මහජනයා රැස්ව සිටින විටත්, පුතුන් වාඩි වී සිටින විටත් කියවන්න –\n\n‘‘ඉපිදීමෙන් මා සතුටු වූ, යහපත ප්‍රාර්ථනා කළ ඒ පුතුන්, තම භාර්යාවන් සමඟ සාකච්ඡා කර, ඌරෙකු මෙන් මා පලවා හරිති.\n‘‘කුලකත මා, ‘තාත්තේ, තාත්තේ’ යැයි අමතනවා යැයි කියන්නේ ගුණ නැති අයයි; එසේම පුතුන්ගේ වේශයෙන් සිටිනා රකුසන් සේ ඔවුන් වයස්ගත වූ මා අත්හරිති.\n‘‘භාවිතයට ගත නොහැකි වයසට ගිය අශ්වයෙකු ආහාරයෙන් ඉවත් කරන්නා සේ; දරුවන්ගේ වයස්ගත පියා අනුන්ගේ නිවෙස්වල හිඟා කයි.\n‘‘අකීකරු පුතුන් සිටිනවාට වඩා, මට සැරයටියක්ම උතුම්ය; එය දරුණු ගොනෙකු වුවත්, දරුණු බල්ලෙකු වුවත් පලවා හරියි.\n‘‘අන්ධකාරයෙහිදී ඉදිරියෙන් වූ ගැඹුරු මඩෙහි අඩිය තැබීමට උපකාරී වන්නේද; සැරයටියේ ආනුභාවයෙන් පැකිලී ගියද නැවත නැගී සිටීමට හැකිවේ’’යි.\n\nඉන්පසු ඒ මහබමුණා භාග්‍යවතුන් වහන්සේ සමීපයෙහිදී මේ ගාථාවන් ඉගෙනගෙන, සභාවට මහජනයා රැස්ව සිටින විටත්, පුතුන් වාඩි වී සිටින විටත් ඒවා කීවේය –\n\n‘‘ඉපිදීමෙන් මා සතුටු වූ, යහපත ප්‍රාර්ථනා කළ ඒ පුතුන්, තම භාර්යාවන් සමඟ සාකච්ඡා කර, ඌරෙකු මෙන් මා පලවා හරිති.\n‘‘කුලකත මා, ‘තාත්තේ, තාත්තේ’ යැයි අමතනවා යැයි කියන්නේ ගුණ නැති අයයි; එසේම පුතුන්ගේ වේශයෙන් සිටිනා රකුසන් සේ ඔවුන් වයස්ගත වූ මා අත්හරිති.\n‘‘භාවිතයට ගත නොහැකි වයසට ගිය අශ්වයෙකු ආහාරයෙන් ඉවත් කරන්නා සේ; දරුවන්ගේ වයස්ගත පියා අනුන්ගේ නිවෙස්වල හිඟා කයි.\n‘‘අකීකරු පුතුන් සිටිනවාට වඩා, මට සැරයටියක්ම උතුම්ය; එය දරුණු ගොනෙකු වුවත්, දරුණු බල්ලෙකු වුවත් පලවා හරියි.\n‘‘අන්ධකාරයෙහිදී ඉදිරියෙන් වූ ගැඹුරු මඩෙහි අඩිය තැබීමට උපකාරී වන්නේද; සැරයටියේ ආනුභාවයෙන් පැකිලී ගියද නැවත නැගී සිටීමට හැකිවේ’’යි.\n\nඉන්පසු පුතුන් ඒ මහබමුණා ගෙදර ගෙන ගොස්, නහවා, වස්ත්‍ර යුගලකින් සැරසූහ. ඉන්පසු ඒ මහබමුණා වස්ත්‍ර යුගලක් ගෙන, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා බහ නිමවා එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි ඒ මහබමුණා භාග්‍යවතුන් වහන්සේට මෙය කීවේය – ‘‘භවත් ගෞතමයන් වහන්ස, අපි බමුණෝ නම් ආචාර්යවරයාට ආචාර්ය ධනය සොයන්නෙමු. මගේ මේ ආචාර්ය ධනය භවත් ගෞතමයන් වහන්සේ පිළිගන්නා සේක්වා!’’යි. භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් එය පිළිගත් සේක. ඉන්පසු ඒ මහබමුණා භාග්‍යවතුන් වහන්සේට මෙය කීවේය – ‘‘භවත් ගෞතමයන් වහන්ස, අතිශයින් ශ්‍රේෂ්ඨයි... අද පටන් දිවි හිමියෙන් තිසරණ සරණ ගිය උපාසකයෙක් ලෙස භවත් ගෞතමයන් වහන්සේ මා සිහි කරන සේක්වා!’’යි.",
      "paliTitle": "Mahāsālasuttaṃ"
    },
    {
      "number": 201,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena mānatthaddho nāma brāhmaṇo sāvatthiyaṃ paṭivasati. So neva mātaraṃ abhivādeti, na pitaraṃ abhivādeti, na ācariyaṃ abhivādeti, na jeṭṭhabhātaraṃ abhivādeti. Tena kho pana samayena bhagavā mahatiyā parisāya parivuto dhammaṃ deseti. Atha kho mānatthaddhassa brāhmaṇassa etadahosi – ‘‘ayaṃ kho samaṇo gotamo mahatiyā parisāya parivuto dhammaṃ deseti. Yaṃnūnāhaṃ yena samaṇo gotamo tenupasaṅkameyyaṃ. Sace maṃ samaṇo gotamo ālapissati, ahampi taṃ ālapissāmi. No ce maṃ samaṇo gotamo ālapissati, ahampi nālapissāmī’’ti. Atha kho mānatthaddho brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā tuṇhībhūto ekamantaṃ aṭṭhāsi. Atha kho bhagavā taṃ nālapi. Atha kho mānatthaddho brāhmaṇo – ‘nāyaṃ samaṇo gotamo kiñci jānātī’ti tatova puna nivattitukāmo ahosi. Atha kho bhagavā mānatthaddhassa brāhmaṇassa cetasā cetoparivitakkamaññāya mānatthaddhaṃ brāhmaṇaṃ gāthāya ajjhabhāsi – ‘‘Na mānaṃ brāhmaṇa sādhu, atthikassīdha brāhmaṇa; Yena atthena āgacchi, tamevamanubrūhaye’’ti. Atha kho mānatthaddho brāhmaṇo – ‘‘cittaṃ me samaṇo gotamo jānātī’’ti tattheva bhagavato pādesu sirasā nipatitvā bhagavato pādāni mukhena ca paricumbati pāṇīhi ca parisambāhati, nāmañca sāveti – ‘‘mānatthaddhāhaṃ, bho gotama, mānatthaddhāhaṃ, bho gotamā’’ti. Atha kho sā parisā abbhutacittajātā [abbhutacittajātā (sī. syā. kaṃ. pī.), acchariyabbhutacittajātā (ka.)] ahosi – ‘acchariyaṃ vata bho, abbhutaṃ vata bho! Ayañhi mānatthaddho brāhmaṇo neva mātaraṃ abhivādeti, na pitaraṃ abhivādeti, na ācariyaṃ abhivādeti, na jeṭṭhabhātaraṃ abhivādeti; atha ca pana samaṇe gotame evarūpaṃ paramanipaccakāraṃ karotī’ti. Atha kho bhagavā mānatthaddhaṃ brāhmaṇaṃ etadavoca – ‘‘alaṃ, brāhmaṇa, uṭṭhehi, sake āsane nisīda. Yato te mayi cittaṃ pasanna’’nti. Atha kho mānatthaddho brāhmaṇo sake āsane nisīditvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Kesu na mānaṃ kayirātha, kesu cassa sagāravo; Kyassa apacitā assu, kyassu sādhu supūjitā’’ti. ‘‘Mātari pitari cāpi, atho jeṭṭhamhi bhātari; Ācariye catutthamhi, Tesu na mānaṃ kayirātha; Tesu assa sagāravo, Tyassa apacitā assu; Tyassu sādhu supūjitā. ‘‘Arahante sītībhūte, katakicce anāsave; Nihacca mānaṃ athaddho, te namasse anuttare’’ti. Evaṃ vutte, mānatthaddho brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "At Sāvatthī. At that time, a brahmin named Mānatthaddho lived in Sāvatthī. He would neither pay homage to his mother, nor pay homage to his father, nor pay homage to his teacher, nor pay homage to his elder brother. At that time, the Blessed One, surrounded by a large assembly, was teaching the Dhamma. Then it occurred to the brahmin Mānatthaddho: \"This recluse Gotama, surrounded by a large assembly, is teaching the Dhamma. What if I were to approach the recluse Gotama? If the recluse Gotama addresses me, I too will address him. But if the recluse Gotama does not address me, I too will not address him.\" Then the brahmin Mānatthaddho approached the Blessed One; having approached, he stood silently to one side. Then the Blessed One did not address him. Then the brahmin Mānatthaddho, thinking, \"This recluse Gotama knows nothing,\" was about to turn back from that very spot. Then the Blessed One, knowing with his own mind the mental deliberation of the brahmin Mānatthaddho, addressed the brahmin Mānatthaddho with a verse: \"It is not good, brahmin, to have conceit, for one who has a purpose here, brahmin. That very purpose for which you have come, you should develop it accordingly.\" Then the brahmin Mānatthaddho, thinking, \"The recluse Gotama knows my mind,\" right there prostrated himself with his head at the Blessed One's feet, kissed the Blessed One's feet with his mouth, and massaged them with his hands, while announcing his name: \"I am Mānatthaddho, good Gotama, I am Mānatthaddho, good Gotama!\" Then that assembly became filled with wonder: \"Indeed, it is amazing, indeed, it is astonishing! This brahmin Mānatthaddho would neither pay homage to his mother, nor pay homage to his father, nor pay homage to his teacher, nor pay homage to his elder brother; yet he performs such supreme reverence for the recluse Gotama!\" Then the Blessed One said to the brahmin Mānatthaddho: \"Enough, brahmin, rise, sit in your own seat, since your mind has become clear towards me.\" Then the brahmin Mānatthaddho, having sat in his own seat, addressed the Blessed One with a verse: \"Towards whom should one not be conceited, and towards whom should one be respectful? Who should be honored by him, and who should be well-worshipped by him?\" \"Towards mother and father, and also towards an elder brother, and fourthly towards a teacher—towards these one should not be conceited; towards these one should be respectful; these should be honored by him; these should be well-worshipped by him. And the Arahants, who are cool, who have completed their task, who are free from defilements—humbly, without conceit, one should pay homage to those unsurpassed ones.\" When this was said, the brahmin Mānatthaddho said to the Blessed One: \"Excellent, good Gotama! Excellent, good Gotama! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms—in the same way has the good Gotama made the Dhamma clear in many ways. I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha of monks. From today onwards, may the good Gotama remember me as a lay follower who has gone for refuge for life.\"",
      "sinhala": "සැවැත්නුවරදී සිදු වූවකි. එකල්හි මානත්ථද්ධ නම් බ්‍රාහ්මණයෙක් සැවැත්නුවර වාසය කළේය. හෙතෙම මවට ද වඳින්නේ නැත, පියාට ද වඳින්නේ නැත, ආචාර්යවරයාට ද වඳින්නේ නැත, වැඩිමහල් සොහොයුරාට ද වඳින්නේ නැත. එකල්හි භාග්‍යවතුන් වහන්සේ මහත් පිරිසකින් පිරිවරාගෙන ධර්මය දේශනා කරමින් සිටියහ. එකල්හි මානත්ථද්ධ බ්‍රාහ්මණයාට මෙබඳු අදහසක් ඇති විය – ‘‘මේ ශ්‍රවණ ගෞතමයන් වහන්සේ මහත් පිරිසකින් පිරිවරාගෙන ධර්මය දේශනා කරති. මම ශ්‍රවණ ගෞතමයන් වහන්සේ වෙතට පැමිණියහොත් හොඳය. යම් හෙයකින් ශ්‍රවණ ගෞතමයන් වහන්සේ මට කථා කරන්නේ නම්, මම ද උන්වහන්සේට කථා කරන්නෙමි. යම් හෙයකින් ශ්‍රවණ ගෞතමයන් වහන්සේ මට කථා නොකරන්නේ නම්, මම ද උන්වහන්සේට කථා නොකරන්නෙමි’’යි. එකල්හි මානත්ථද්ධ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, පැමිණ නිශ්ශබ්දව එකත්පසෙක සිටියේය. එකල්හි භාග්‍යවතුන් වහන්සේ ඔහුට කථා නොකළහ. එකල්හි මානත්ථද්ධ බ්‍රාහ්මණයා – ‘මේ ශ්‍රවණ ගෞතමයන් වහන්සේ කිසිවක් නොදන්නා සේකැ’යි සිතා, එතැනින්ම ආපසු හැරී යාමට සූදානම් විය. එකල්හි භාග්‍යවතුන් වහන්සේ මානත්ථද්ධ බ්‍රාහ්මණයාගේ සිතින් සිතේ විතර්කයන් දැන, මානත්ථද්ධ බ්‍රාහ්මණයාට ගාථාවකින් මෙසේ වදාළහ – ‘‘බ්‍රාහ්මණය, මෙහි අර්ථයක් ඇති කෙනෙකුට මානය සුදුසු නැත. බ්‍රාහ්මණය, කුමන අර්ථයකින් ඔබ පැමිණියේද, එයම වඩන්නැ’’යි. එකල්හි මානත්ථද්ධ බ්‍රාහ්මණයා – ‘‘ශ්‍රවණ ගෞතමයන් වහන්සේ මාගේ සිත දන්නා සේකැ’’යි සිතා, එතැනම භාග්‍යවතුන් වහන්සේගේ දෙපාමුල හිසින් වැඳ, භාග්‍යවතුන් වහන්සේගේ දෙපා මුවින් සිඹ, දෑතින් පිරිමැද, ‘‘භවත් ගෞතමයන් වහන්ස, මම මානත්ථද්ධ වෙමි, භවත් ගෞතමයන් වහන්ස, මම මානත්ථද්ධ වෙමි’’යි තමාගේ නම කීය. එකල්හි ඒ පිරිසට පුදුමයක් ඇති විය – ‘භවත්නි, මෙය පුදුමයකි, භවත්නි, මෙය අත්භූතයකි! යමෙක් වූ කලී මේ මානත්ථද්ධ බ්‍රාහ්මණයා මවට ද වඳින්නේ නැත, පියාට ද වඳින්නේ නැත, ආචාර්යවරයාට ද වඳින්නේ නැත, වැඩිමහල් සොහොයුරාට ද වඳින්නේ නැත; එසේ තිබියදී ශ්‍රවණ ගෞතමයන් වහන්සේ කෙරෙහි මෙබඳු උතුම් නමස්කාරයක් කරන්නේයැ’යි. එකල්හි භාග්‍යවතුන් වහන්සේ මානත්ථද්ධ බ්‍රාහ්මණයාට මෙසේ වදාළහ – ‘‘බ්‍රාහ්මණය, ඇති, නැගිටින්න, ඔබේම ආසනයේ වාඩි වන්න. මක්නිසාද යත්, ඔබගේ සිත මා කෙරෙහි පැහැදුණේය’’යි. එකල්හි මානත්ථද්ධ බ්‍රාහ්මණයා තමාගේ ආසනයේ වාඩි වී භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කීය – ‘‘කවර අය කෙරෙහි නම් මානය නොකළ යුතුද? කවර අය කෙරෙහි නම් ගෞරවයෙන් යුක්ත විය යුතුද? කවර අය නම් වන්දනාමානයට සුදුසු වන්නාහුද? කවර අය නම් මනාව පිදිය යුතු වන්නාහුදැ’’යි. ‘‘මව කෙරෙහි ද, පියා කෙරෙහි ද, එසේම වැඩිමහල් සොහොයුරා කෙරෙහි ද, සිව්වැනියා වූ ආචාර්යවරයා කෙරෙහි ද, මොවුන් කෙරෙහි මානය නොකළ යුතුය. මොවුන් කෙරෙහි ගෞරවයෙන් යුක්ත විය යුතුය. මොවුන් වන්දනාමානයට සුදුසු විය යුතුය. මොවුන් මනාව පිදිය යුතුය. සිසිල් වූ (රාගාදියෙන් තොර වූ), කළ යුතු කටයුතු (අර්හත්වය) සිදු කළ, ආශ්‍රව රහිත වූ අරහතුන් වහන්සේලාට, මානය නැති කොට, උඩඟුකමෙන් තොරව, ඒ අනුත්තර වූ (අසමසම වූ) උතුමන්ට නමස්කාර කළ යුතුය’’යි. මෙසේ වදාළ කල්හි මානත්ථද්ධ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීය – ‘‘භවත් ගෞතමයන් වහන්ස, ඉතා අලංකාරය, භවත් ගෞතමයන් වහන්ස, ඉතා අලංකාරය. යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේද, ඇස් ඇති අයට රූප දැකීමට හැකි වන ලෙස අඳුරෙහි තෙල් පහනක් දල්වන්නේද, එපරිද්දෙන්ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කර ඇත. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා භවත් ගෞතමයන් වහන්සේ සිහි තබා ගන්නා සේක්වා’’යි.",
      "paliTitle": "Mānatthaddhasuttaṃ"
    },
    {
      "number": 202,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena paccanīkasāto nāma brāhmaṇo sāvatthiyaṃ paṭivasati. Atha kho paccanīkasātassa brāhmaṇassa etadahosi – ‘‘yaṃnūnāhaṃ yena samaṇo gotamo tenupasaṅkameyyaṃ. Yaṃ yadeva samaṇo gotamo bhāsissati taṃ tadevassāhaṃ [tadeva sāhaṃ (ka.)] paccanīkāssa’’nti [paccanīkassanti (pī.), paccanīkasātanti (ka.)]. Tena kho pana samayena bhagavā abbhokāse caṅkamati. Atha kho paccanīkasāto brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ caṅkamantaṃ etadavoca – ‘bhaṇa samaṇadhamma’nti. ‘‘Na paccanīkasātena, suvijānaṃ subhāsitaṃ; Upakkiliṭṭhacittena, sārambhabahulena ca. ‘‘Yo ca vineyya sārambhaṃ, appasādañca cetaso; Āghātaṃ paṭinissajja, sa ve [sace (syā. kaṃ. ka.)] jaññā subhāsita’’nti. Evaṃ vutte, paccanīkasāto brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "At Sāvatthī. At that time, a brahmin named Paccanīkasāta was dwelling in Sāvatthī. Then it occurred to the brahmin Paccanīkasāta, \"What if I were to approach the ascetic Gotama? Whatever the ascetic Gotama speaks, I will oppose that very thing.\"\n\nAt that time, the Blessed One was walking in the open air. Then the brahmin Paccanīkasāta approached the Blessed One. Having approached, he said to the Blessed One as he was walking, \"Speak, O ascetic, of the Dhamma!\"\n\n[The Blessed One responded:]\n\"By one like Paccanīkasāta, with a mind defiled and full of contention,\nIt is not easy to understand what is well-spoken.\nBut whoever removes contention and the disquiet of mind,\nAnd relinquishes ill-will, such a one indeed would understand what is well-spoken.\"\n\nWhen this was said, the brahmin Paccanīkasāta said to the Blessed One, \"Magnificent, Master Gotama! Magnificent, Master Gotama! Just as if someone were to set upright what had been overturned, or to reveal what was hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms, in the same way has Master Gotama made the Dhamma clear in many ways. May Master Gotama remember me as a lay follower who has taken refuge from this day forth for as long as life lasts.\"",
      "sinhala": "මෙය සැවැත්නුවරදී සිදු විය. එසමයෙහි පැසැණීකසාත නම් බමුණෙක් සැවැත්නුවර වාසය කළේය. එකල්හි පැසැණීකසාත බමුණාට මෙබඳු සිතක් පහළ විය: ‘‘මම ශ්‍රමණ ගෞතමයන් වහන්සේ වෙතට ගියොත් හොඳයි. ශ්‍රමණ ගෞතමයන් වහන්සේ යමක් දේශනා කරන්නේද, ඒ හැම දෙයකටම මම විරුද්ධ වෙමි.’’ ඒ වන විට භාග්‍යවතුන් වහන්සේ එළිමහනේ සක්මන් කරමින් සිටි සේක. ඉක්බිති පැසැණීකසාත බමුණා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, සක්මන් කරමින් වැඩසිටි භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘ශ්‍රමණය, ධර්මය කියන්න!’’\n\n‘‘විරුද්ධ වීමටම ප්‍රිය කරන, කිලිටි වූ සිතක් ඇති, කලහකාරී බවින් බහුල වූ පුද්ගලයාට මනාව දේශනා කරන ලද්දක් පහසුවෙන් අවබෝධ කළ නොහැකිය. යම් පුද්ගලයෙක්, කලහකාරී බවත්, සිතේ නොපැහැදිලි බවත් දුරු කර, වෛරය අත්හැර දමා, ඒකාන්තයෙන් ඔහු මනාව දේශනා කරන ලද්ද අවබෝධ කරන්නේය.’’\n\nමෙසේ පැවසූ කල්හි, පැසැණීකසාත බමුණා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘භවත් ගෞතමයන් වහන්ස, ඉතා අලංකාරයි! භවත් ගෞතමයන් වහන්ස, ඉතා අලංකාරයි! යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මග පෙන්වන්නේද, අන්ධකාරයේ තෙල් පහනක් දල්වන්නේද ඇස් ඇති අය රූප දකින්නා සේ, එලෙසම භවත් ගෞතමයන් වහන්සේ විසින් ධර්මය නොයෙක් අයුරින් දේශනා කරන ලදී. මම භවත් ගෞතමයන් වහන්සේ ද, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමි. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Paccanīkasuttaṃ"
    },
    {
      "number": 203,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena navakammikabhāradvājo brāhmaṇo tasmiṃ vanasaṇḍe kammantaṃ kārāpeti. Addasā kho navakammikabhāradvājo brāhmaṇo bhagavantaṃ aññatarasmiṃ sālarukkhamūle nisinnaṃ pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. Disvānassa etadahosi – ‘‘ahaṃ kho imasmiṃ vanasaṇḍe kammantaṃ kārāpento ramāmi. Ayaṃ samaṇo gotamo kiṃ kārāpento ramatī’’ti? Atha kho navakammikabhāradvājo brāhmaṇo yena bhagavā tenupasaṅkami. Upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Ke nu kammantā karīyanti, bhikkhu sālavane tava; Yadekako araññasmiṃ, ratiṃ vindati gotamo’’ti. ‘‘Na me vanasmiṃ karaṇīyamatthi, Ucchinnamūlaṃ me vanaṃ visūkaṃ; Svāhaṃ vane nibbanatho visallo, Eko rame aratiṃ vippahāyā’’ti. Evaṃ vutte, navakammikabhāradvājo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "At one time, the Blessed One was dwelling in the Kosala country, in a certain forest thicket. Now at that time, the brahman Bhāradvāja, a supervisor of new construction, was having work done in that forest thicket. The brahman Bhāradvāja, the supervisor of new construction, saw the Blessed One sitting at the root of a certain sal tree, with legs folded crosswise, body held upright, and mindfulness established intently. Having seen him, it occurred to him: \"I, indeed, find delight in this forest thicket while having work done. What is this ascetic Gotama doing that he finds delight?\" Then the brahman Bhāradvāja, the supervisor of new construction, approached the Blessed One. Having approached, he addressed the Blessed One with a verse:\n\"What works, O bhikkhu, are being done in your sal forest,\nThat you, Gotama, alone in the wilderness, find such delight?\"\n\n\"For me, there is no task to be done in this forest. My 'forest' of craving, with its roots severed, is free from entanglement. Therefore, in this very forest, I am without craving, without the dart of suffering, and alone I delight, having completely abandoned discontent.\"\n\nWhen this was said, the brahman Bhāradvāja, the supervisor of new construction, said to the Blessed One: \"Excellent, venerable Gotama! Excellent, venerable Gotama! Just as if one were to set upright what had been overturned, or to reveal what was hidden, or to show the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms, even so has the venerable Gotama expounded the Dhamma in various ways. Let the venerable Gotama remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කොසොල් ජනපදයෙහි එක්තරා වනාන්තරයක වැඩසිටින සේක. ඒ දවසෙහි නවකම්මික භාරද්වාජ නම් බ්‍රාහ්මණයා ඒ වනාන්තරයෙහි කර්මාන්තයක් කරවමින් සිටියේය. නවකම්මික භාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ එක්තරා සල් රුකක් මුල පලක් බැඳ, කය ඍජු කොට, සිහිය මනාකොට පිහිටුවාගෙන වැඩහිඳින සේක්ව දුටුවේය. උන්වහන්සේ දැක ඔහුට මෙසේ සිතුණි: \"මම මේ වනාන්තරයෙහි කර්මාන්තයක් කරවමින් සතුටු වෙමි. මේ ශ්‍රමණ ගෞතමයන් වහන්සේ කුමක් කරවමින් සතුටු වන සේක්දැයි?\" ඉක්බිති නවකම්මික භාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ කථා කළේය: \"භික්ෂුව, ඔබගේ සල් වනයෙහි කරවනු ලබන කර්මාන්ත මොනවාද? යම් හෙයකින් ගෞතමයන් වහන්සේ වනගතව තනිවම සතුටු වන සේක්ද?\"\n\n\"මට මේ වනයෙහි කිසිදු කටයුත්තක් නැත. මාගේ තෘෂ්ණා වනය මුලිනුපුටා දමා ඇත, එය කිසිදු බාධාවකින් තොරය. එහෙයින් මම තෘෂ්ණා වනයෙන් නික්මුණෙමි, කෙලෙස් හීයෙන් තොර වූයෙමි. අරතිය දුරු කර, තනිවම සතුටු වෙමි.\"\n\nමෙසේ කී කල්හි, නවකම්මික භාරද්වාජ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"ඉතා මැනවි, භවත් ගෞතමයන් වහන්ස! භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය මැනවින් දේශනා කරන ලද්දේය. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයකු ලෙස මා භවත් ගෞතමයන් වහන්සේ පිළිගන්නා සේක්වා!\"",
      "paliTitle": "Navakammikasuttaṃ"
    },
    {
      "number": 204,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu viharati aññatarasmiṃ vanasaṇḍe. Tena kho pana samayena aññatarassa bhāradvājagottassa brāhmaṇassa sambahulā antevāsikā kaṭṭhahārakā māṇavakā yena vanasaṇḍo tenupasaṅkamiṃsu; upasaṅkamitvā addasaṃsu bhagavantaṃ tasmiṃ vanasaṇḍe nisinnaṃ pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. Disvāna yena bhāradvājagotto brāhmaṇo tenupasaṅkamiṃsu; upasaṅkamitvā bhāradvājagottaṃ brāhmaṇaṃ etadavocuṃ – ‘‘yagghe, bhavaṃ jāneyyāsi! Asukasmiṃ vanasaṇḍe samaṇo nisinno pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā’’. Atha kho bhāradvājagotto brāhmaṇo tehi māṇavakehi saddhiṃ yena so vanasaṇḍo tenupasaṅkami. Addasā kho bhagavantaṃ tasmiṃ vanasaṇḍe nisinnaṃ pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. Disvāna yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ gāthāya ajjhabhāsi – ‘‘Gambhīrarūpe bahubherave vane, Suññaṃ araññaṃ vijanaṃ vigāhiya; Aniñjamānena ṭhitena vaggunā, Sucārurūpaṃ vata bhikkhu jhāyasi. ‘‘Na yattha gītaṃ napi yattha vāditaṃ, Eko araññe vanavassito muni; Accherarūpaṃ paṭibhāti maṃ idaṃ, Yadekako pītimano vane vase. ‘‘Maññāmahaṃ lokādhipatisahabyataṃ, Ākaṅkhamāno tidivaṃ anuttaraṃ; Kasmā bhavaṃ vijanamaraññamassito, Tapo idha kubbasi brahmapattiyā’’ti. ‘‘Yā kāci kaṅkhā abhinandanā vā, Anekadhātūsu puthū sadāsitā; Aññāṇamūlappabhavā pajappitā, Sabbā mayā byantikatā samūlikā. ‘‘Svāhaṃ akaṅkho asito anūpayo, Sabbesu dhammesu visuddhadassano; Pappuyya sambodhimanuttaraṃ sivaṃ, Jhāyāmahaṃ brahma raho visārado’’ti. Evaṃ vutte, bhāradvājagotto brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama abhikkantaṃ, bho gotama…pe… ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "At one time, the Blessed One was dwelling among the Kosalans in a certain forest thicket. Now at that time, many young students of a certain brahmin of the Bhāradvāja clan, who were wood-gatherers, approached that forest thicket. Having approached, they saw the Blessed One sitting in that forest thicket, having folded his legs crosswise, straightened his body, and established mindfulness in front of him. Having seen him, they approached the brahmin of the Bhāradvāja clan. Having approached, they said to the brahmin of the Bhāradvāja clan: ‘Good sir, you should know this! In a certain forest thicket, a recluse is sitting, having folded his legs crosswise, straightened his body, and established mindfulness in front of him.’ Then the brahmin of the Bhāradvāja clan, together with those young students, approached that forest thicket. Indeed, he saw the Blessed One sitting in that forest thicket, having folded his legs crosswise, straightened his body, and established mindfulness in front of him. Having seen him, he approached the Blessed One; having approached, he addressed the Blessed One with a verse:\n\n“Entering into this deep, greatly fearsome, empty, deserted forest, you, O monk, meditate in a truly beautiful form, unwavering, steady, and lovely.\n\n“Where there is no song, no music, a sage dwells alone in the forest, dwelling in the wilderness. It appears wonderful to me that one lives alone in the forest, filled with joy.\n\n“I suppose you desire companionship with the Lord of the World, longing for the unsurpassed heavenly realm. Why have you resorted to this deserted forest? You practice asceticism here for the attainment of Brahmā.”\n\n“Whatever doubts or cravings, varied and widely based on many elements, arising from the root of ignorance, propagated by proliferation – all of them have been eradicated by me, root and all.\n\n“Thus, I, free from doubt, unattached, without clinging, with purified vision regarding all phenomena, having attained the unsurpassed, peaceful perfect enlightenment, meditate, O brahmin, secluded and self-assured.”\n\nWhen this was said, the brahmin of the Bhāradvāja clan said to the Blessed One: ‘Excellent, venerable Gotama! Excellent, venerable Gotama! Just as if one were to set upright what was overturned, or to reveal what was hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so that those with eyes could see forms—in the same way has the venerable Gotama made the Dhamma clear in many ways. I go for refuge to the venerable Gotama, to the Dhamma, and to the Sangha of monks. May the venerable Gotama remember me as a lay follower who has gone for refuge from this day forth as long as life lasts.’",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයෙහි එක්තරා වනාන්තරයක වැඩසිටියහ. එකල්හි එක්තරා භාරද්වාජගෝත්‍රික බ්‍රාහ්මණයෙකුගේ බොහෝ ශිෂ්‍යයන් වූ දර කඩන්නා වූ මානවකයෝ ඒ වනාන්තරය කරා පැමිණියහ. ඔවුහු පැමිණ ඒ වනාන්තරයෙහි පලක් බැඳ, ඍජු කයින් යුක්තව, සිහිය මුහුණට එළවා වැඩසිටින භාග්‍යවතුන් වහන්සේ දුටහ. දුටු ඔවුහු භාරද්වාජගෝත්‍රික බ්‍රාහ්මණයා වෙත පැමිණියහ. පැමිණ භාරද්වාජගෝත්‍රික බ්‍රාහ්මණයාට මෙසේ කීහ: ‘‘පින්වත් ඔබ දන්නේ නම් හොඳයි! අසුවල් වනාන්තරයෙහි ශ්‍රමණයෙක් පලක් බැඳ, ඍජු කයින් යුක්තව, සිහිය මුහුණට එළවා වැඩසිටිනවා’’. එවිට භාරද්වාජගෝත්‍රික බ්‍රාහ්මණ තෙමේ ඒ මානවකයන් සමඟ ඒ වනාන්තරය කරා පැමිණියේය. ඒ වනාන්තරයෙහි පලක් බැඳ, ඍජු කයින් යුක්තව, සිහිය මුහුණට එළවා වැඩසිටින භාග්‍යවතුන් වහන්සේ ඔහු දුටුවේය. දුටු ඔහු භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, පැමිණ භාග්‍යවතුන් වහන්සේට ගාථාවකින් මෙසේ පැවසීය:\n\n‘‘ගැඹුරු වූ ද, බොහෝ භයංකර වූ ද වනයක,\nශුන්‍ය වූ, ජනශූන්‍ය වූ අරණට පිවිස;\nනොසැලී, මනා සේ පිහිටා, ශෝභමාන ලෙස,\nආශ්චර්යයකි, භික්ෂුව, ඔබ ඉතා මනහර ලෙස ධ්‍යාන වඩන සේක.\n\n‘‘කිසිදු ගීතයක් හෝ වාදනයක් නැති තැනක,\nඑකලාව වනගතව වසන මුනිඳුනි;\nයම් හෙයකින් තනිව ප්‍රීතිමත් සිතින් වනයෙහි වෙසෙන්නේද,\nඑය මට ආශ්චර්යයක් ලෙස පෙනේ.\n\n‘‘මා සිතන්නේ ඔබ ලෝකාධිපති දෙවියන්ගේ සහාය බලාපොරොත්තුවෙන්,\nඅනුත්තර දිව්‍ය ලෝකයක් අපේක්ෂා කරමින් සිටිනවා කියායි;\nකුමකටද ඔබ මේ ජනශූන්‍ය අරණට පැමිණ,\nබ්‍රහ්මත්වය ලබාගැනීම පිණිස මෙහි තපස් රකින්නේ?’’\n\n‘‘යම් කිසි සැකයක් හෝ තෘෂ්ණා සහගත කැමැත්තක් වේද,\nඒවා නා නා ධාතූන් කෙරෙහි නිරතුරුවම පැන නැගුණි;\nඅවිද්‍යාව මුල් කොට ඇතිව, නා නා ප්‍රකාරයෙන් ව්‍යාප්ත වූ ඒවා,\nඒ සියල්ල මා විසින් මුලින්ම උදුරා දමා අවසන් කරන ලදී.\n\n‘‘එහෙයින් මම සැක රහිත වූ, අනාශ්‍රිත වූ, බැඳීම් රහිත වූ,\nසියලු ධර්මයන්හි පිරිසිදු දැක්මක් ඇතිව;\nඅනුත්තර වූ ශාන්ත සම්බෝධියට පැමිණ,\nබ්‍රාහ්මණ, බියෙන් තොරව, තනිව ධ්‍යාන වඩමි.’’\n\nමෙසේ පැවසූ කල්හි භාරද්වාජගෝත්‍රික බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘පින්වත් ගෞතමයන් වහන්සේ අතිශයින් ශ්‍රේෂ්ඨයි! පින්වත් ගෞතමයන් වහන්සේ අතිශයින් ශ්‍රේෂ්ඨයි! භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, සංඝයා ද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙක් ලෙස මා සලකනු මැන.’’",
      "paliTitle": "Kaṭṭhahārasuttaṃ"
    },
    {
      "number": 205,
      "pali": "Sāvatthinidānaṃ. Atha kho mātuposako brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mātuposako brāhmaṇo bhagavantaṃ etadavoca – ‘‘ahañhi, bho gotama, dhammena bhikkhaṃ pariyesāmi, dhammena bhikkhaṃ pariyesitvā mātāpitaro posemi. Kaccāhaṃ, bho gotama, evaṃkārī kiccakārī homī’’ti? ‘‘Taggha tvaṃ, brāhmaṇa, evaṃkārī kiccakārī hosi. Yo kho, brāhmaṇa, dhammena bhikkhaṃ pariyesati, dhammena bhikkhaṃ pariyesitvā mātāpitaro poseti, bahuṃ so puññaṃ pasavatī’’ti. ‘‘Yo mātaraṃ pitaraṃ vā, macco dhammena posati; Tāya naṃ pāricariyāya, mātāpitūsu paṇḍitā; Idheva naṃ pasaṃsanti, pecca sagge pamodatī’’ti. Evaṃ vutte, mātuposako brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Then, the brahmin who supported his mother approached the Blessed One. Having approached, he exchanged cordial greetings with the Blessed One. Having concluded the polite and memorable conversation, he sat down to one side.\n\nSeated to one side, the brahmin who supported his mother said this to the Blessed One: \"Truly, venerable Gotama, I righteously earn my living, and having righteously earned my living, I support my mother and father. Am I, venerable Gotama, one who acts correctly, one who fulfills his duties?\"\n\n\"Indeed, brahmin, you are one who acts correctly, one who fulfills his duties. Whoever, brahmin, righteously earns his living, and having righteously earned his living, supports his mother and father, he generates much merit.\"\n\n\"Whatever mortal righteously supports his mother and father, because of that filial service to mother and father, the wise praise him right here in this world; and after death, he rejoices in heaven.\"\n\nWhen this was said, the brahmin who supported his mother said to the Blessed One: \"Excellent, venerable Gotama! Excellent, venerable Gotama! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms — in the same way has the venerable Gotama made the Dhamma clear in various ways. I go for refuge to the venerable Gotama, and to the Dhamma, and to the Saṅgha. May the venerable Gotama remember me as a lay follower who has gone for refuge from this day forward as long as life lasts.\"",
      "sinhala": "සැවැත්නුවරදීය.\n\nඉන්පසු මාතුපෝසක බ්‍ර​ාහ්ම​ණයා භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍ය​වතුන් වහන්සේ සමඟ සතුටු සාමිචි කථා පැවැත්වීය. සතුටු විය යුතු සිහියට නැඟිය යුතු කථාබහ නිම කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි මාතුපෝසක බ්‍ර​ාහ්ම​ණයා භාග්‍ය​වතුන් වහන්සේට මෙය පැවසුවේය: ‘‘ගෞතමයන් වහන්ස, මම ධර්ම​යෙන් ජීවිකාව සොයමි, ධර්ම​යෙන් ජීවිකාව සොයා මව්පියන් පෝෂණය කරමි. ගෞතමයන් වහන්ස, මෙසේ ක්‍රි​යා කිරීමෙන් මම යුතුකම ඉටු කරන්නෙක් වෙම් ද?’’ ‘‘බ්‍ර​ාහ්ම​ණය, සැබැවින්ම නුඹ එසේ කරන්නෙක්, යුතුකම ඉටු කරන්නෙක් වන්නෙහි. බ්‍ර​ාහ්ම​ණය, යමෙක් ධර්ම​යෙන් ජීවිකාව සොයයිද, ධර්ම​යෙන් ජීවිකාව සොයා මව්පියන් පෝෂණය කරයිද, ඔහු බොහෝ පින් රැස් කරයි.’’ ‘‘යම් මනුෂ්‍යයෙක් මව හෝ පියා ධර්ම​යෙන් පෝෂණය කරයිද, මව්පියන්ට කළ ඒ උපස්ථානය නිසා නුවණැත්තෝ මෙලොවදීම ඔහුට ප්‍ර​ශංසා කරති, පරලොවදී ස්වර්ගයෙහි සතුටු වෙයි.’’\n\nමෙසේ පැවසූ විට මාතුපෝසක බ්‍ර​ාහ්ම​ණයා භාග්‍ය​වතුන් වහන්සේට මෙය පැවසුවේය: ‘‘අතිශයින් මැනවි ගෞතමයන් වහන්ස, අතිශයින් මැනවි ගෞතමයන් වහන්ස, ගෞතමයන් වහන්ස, මා අද පටන් ජීවිතය ඇති තාක් සරණ ගිය උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා!’’",
      "paliTitle": "Mātuposakasuttaṃ"
    },
    {
      "number": 206,
      "pali": "Sāvatthinidānaṃ. Atha kho bhikkhako brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho bhikkhako brāhmaṇo bhagavantaṃ etadavoca – ‘‘ahampi kho, bho gotama, bhikkhako, bhavampi bhikkhako, idha no kiṃ nānākaraṇa’’nti? ‘‘Na tena bhikkhako hoti, yāvatā bhikkhate pare; Vissaṃ dhammaṃ samādāya, bhikkhu hoti na tāvatā. ‘‘Yodha puññañca pāpañca, bāhitvā brahmacariyaṃ; Saṅkhāya loke carati, sa ve bhikkhūti vuccatī’’ti. Evaṃ vutte, bhikkhako brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Then a certain mendicant brahmin approached the Blessed One. Having approached, he exchanged courteous greetings with the Blessed One. After concluding the customary and memorable talk, he sat down to one side.\n\nSitting to one side, the mendicant brahmin said to the Blessed One, \"Indeed, good Gotama, I am a mendicant, and you too are a mendicant. What then is the difference between us?\"\n\n\"One is not a mere mendicant simply by begging from others; one does not become a monastic merely by grasping at all things.\nBut whoever here has put aside both merit and demerit, having lived the holy life, and moves through the world with discernment, he, indeed, is called a monastic.\"\n\nWhen this was said, the mendicant brahmin said to the Blessed One, \"Excellent, good Gotama! Excellent, good Gotama! It is as if someone were to set upright what had been overturned, or to reveal what had been hidden, or to show the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms. In the same way, good Gotama, the Dhamma has been made clear in many ways. I go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha. May Master Gotama accept me as a lay follower, from this day forth, for as long as life lasts, one who has gone for refuge.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඉක්බිති මහණ බමුණෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු සාමිචි කථා කළේය. සුවචන කතා බස් නිමා කර, හෙතෙම එකත්පසෙකින් වාඩිවිය. එකත්පසෙකින් වාඩි වී සිටි ඒ මහණ බමුණා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: “භවත් ගෞතමය, මාත් මහණෙක්මි. භවත් ගෞතමයත් මහණෙක්ය. මෙහි අප දෙදෙනා අතර ඇති වෙනස කුමක්ද?”\n\n“අනුන්ගෙන් යැපෙන පමණින් මහණෙක් (භික්ෂුවක්) නොවෙයි. විවිධ ධර්මයන් (හෝ දෘෂ්ටීන්) පිළිගත් පමණින් ද භික්ෂුවක් නොවෙයි. යමෙක් මෙලොව පින සහ පව යන දෙකම දුරු කොට, බ්‍රහ්මචාරීව, නුවණින් යුතුව ලෝකයෙහි හැසිරෙයි ද, ඔහුම සැබෑ භික්ෂුව යැයි කියනු ලැබේ.”\n\nමෙම වචන ඇසූ විට, ඒ මහණ බමුණා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: “ඉතා අලංකාරයි, භවත් ගෞතමය, ඉතා අලංකාරයි, භවත් ගෞතමය! යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මග මුළා වූවෙකුට මග පෙන්වන්නේද, අන්ධකාරයේ තෙල් පහනක් දල්වන්නේද, ඇස් ඇති අයට රූප පෙනෙනු පිණිසද, එපරිද්දෙන්ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කරන ලදී. එබැවින් මම භවත් ගෞතමයන් වහන්සේ ද, ධර්මය ද, සංඝයා ද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයකු ලෙස භවත් ගෞතමයන් වහන්සේ මා පිළිගන්නා සේක්වා.”",
      "paliTitle": "Bhikkhakasuttaṃ"
    },
    {
      "number": 207,
      "pali": "Sāvatthinidānaṃ. Tena kho pana samayena saṅgāravo nāma brāhmaṇo sāvatthiyaṃ paṭivasati udakasuddhiko, udakena parisuddhiṃ pacceti, sāyaṃ pātaṃ udakorohanānuyogamanuyutto viharati. Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi. Sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘idha, bhante, saṅgāravo nāma brāhmaṇo sāvatthiyaṃ paṭivasati udakasuddhiko, udakena suddhiṃ pacceti, sāyaṃ pātaṃ udakorohanānuyogamanuyutto viharati. Sādhu, bhante, bhagavā yena saṅgāravassa brāhmaṇassa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena saṅgāravassa brāhmaṇassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho saṅgāravo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho saṅgāravaṃ brāhmaṇaṃ bhagavā etadavoca – ‘‘saccaṃ kira tvaṃ, brāhmaṇa, udakasuddhiko, udakena suddhiṃ paccesi, sāyaṃ pātaṃ udakorohanānuyogamanuyutto viharasī’’ti? ‘‘Evaṃ, bho gotama’’. ‘‘Kiṃ pana tvaṃ, brāhmaṇa, atthavasaṃ sampassamāno udakasuddhiko, udakasuddhiṃ paccesi, sāyaṃ pātaṃ udakorohanānuyogamanuyutto viharasī’’ti? ‘‘Idha me, bho gotama [idha me bho gotama ahaṃ (pī. ka.)], yaṃ divā pāpakammaṃ kataṃ hoti, taṃ sāyaṃ nhānena [nahānena (sī. syā. kaṃ. pī.)] pavāhemi, yaṃ rattiṃ pāpakammaṃ kataṃ hoti taṃ pātaṃ nhānena pavāhemi. Imaṃ khvāhaṃ, bho gotama, atthavasaṃ sampassamāno udakasuddhiko, udakena suddhiṃ paccemi, sāyaṃ pātaṃ udakorohanānuyogamanuyutto viharāmī’’ti. ‘‘Dhammo rahado brāhmaṇa sīlatittho, Anāvilo sabbhi sataṃ pasattho; Yattha have vedaguno sinātā, Anallagattāva [anallīnagattāva (ka.)] taranti pāra’’nti. Evaṃ vutte, saṅgāravo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "The discourse began at Sāvatthī. Now at that time, a brahmin named Saṅgārava was living in Sāvatthī. He was an advocate of water purification, believing that purity was attained through water, and he dwelled, habitually engaged in the practice of ritual bathing morning and evening.\n\nThen, in the morning, the Venerable Ānanda, having dressed and taken his bowl and robe, entered Sāvatthī for alms. After wandering for alms in Sāvatthī and having eaten his meal, he put away his alms-bowl and approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, the Venerable Ānanda said to the Blessed One, \"Venerable sir, a brahmin named Saṅgārava is living here in Sāvatthī. He is an advocate of water purification, believing that purity is attained through water, and he dwells, habitually engaged in the practice of ritual bathing morning and evening. It would be good, venerable sir, if the Blessed One would approach the dwelling of the brahmin Saṅgārava out of compassion.\"\n\nThe Blessed One consented by remaining silent.\n\nThen, in the morning, the Blessed One, having dressed and taken his bowl and robe, approached the dwelling of the brahmin Saṅgārava. Having approached, he sat down on the appointed seat.\n\nThen the brahmin Saṅgārava approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the customary friendly and courteous talk, he sat down to one side.\n\nThe Blessed One then said to the brahmin Saṅgārava, who was sitting to one side, \"Is it true, brahmin, that you are an advocate of water purification, that you believe purity is attained through water, and that you dwell, habitually engaged in the practice of ritual bathing morning and evening?\"\n\n\"Yes, Venerable Gotama.\"\n\n\"What advantage, brahmin, do you perceive in being an advocate of water purification, believing that purity is attained through water, and dwelling, habitually engaged in the practice of ritual bathing morning and evening?\"\n\n\"Here, Venerable Gotama, whatever evil deed I have done during the day, I wash it away with bathing in the evening. And whatever evil deed I have done during the night, I wash it away with bathing in the morning. It is this advantage, Venerable Gotama, that I perceive, in being an advocate of water purification, believing that purity is attained through water, and dwelling, habitually engaged in the practice of ritual bathing morning and evening.\"\n\n\"The Dhamma is a lake, brahmin, with virtue as its sacred bathing place, undisturbed and praised by the good and noble ones. In it, those truly accomplished in wisdom can indeed bathe and cross to the far shore, unsoiled by defilements.\"\n\nWhen this was said, the brahmin Saṅgārava said to the Blessed One, \"Excellent, Venerable Gotama! Excellent, Venerable Gotama! It is as if one were to set upright what had been overturned, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms. In the same way, Venerable Gotama has made the Dhamma clear in various ways. Let Venerable Gotama accept me as a lay follower, who has taken refuge from this day forward for as long as life lasts.\"",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n\nඒ සමයෙහි, සංගාරව නම් බ්‍රාහ්මණයෙක් සැවැත් නුවර වාසය කරයි. ඔහු දියෙන් පිරිසිදු වන ස්වභාව ඇත්තෙකි. ජලයෙන් පිරිසිදුකම ලබන්නේයයි පිළිගනී. සවස් කලත්, උදෑසනත් දියට බැස ස්නානය කිරීමේ අභ්‍යාසයෙහි නිරතව වාසය කරයි. ඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ පෙරවරුවෙහි සිවුරු හැඳ පොරවාගෙන, පාත්‍රය හා සිවුරු ගෙන සැවැත් නුවරට පිඬු සිඟා වැඩි සේක. සැවැත් නුවර පිඬු සිඟා වඩාරා, දානය වැළඳීමෙන් පසු භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණි සේක. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වැඩ සිටි සේක. එකත්පසෙක වැඩසිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය සැළ කළ සේක: \"වහන්ස, මෙහි සංගාරව නම් බ්‍රාහ්මණයෙක් සැවැත් නුවර වාසය කරයි. ඔහු ජලයෙන් පිරිසිදු වන ස්වභාව ඇත්තෙකි. ජලයෙන් පිරිසිදුකම ලබන්නේයයි පිළිගනී. සවස් කලත්, උදෑසනත් දියට බැස ස්නානය කිරීමේ අභ්‍යාසයෙහි නිරතව වාසය කරයි. වහන්ස, යහපති, භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් යුතුව සංගාරව බ්‍රාහ්මණයාගේ නිවසට වැඩම කළ මැනව.\" භාග්‍යවතුන් වහන්සේ නිශ්ශබ්දව එය ඉවසූ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ පෙරවරුවෙහි සිවුරු හැඳ පොරවාගෙන, පාත්‍රය හා සිවුරු ගෙන සංගාරව බ්‍රාහ්මණයාගේ නිවසට වැඩම කළ සේක. වැඩම කොට, පනවන ලද අසුනක වැඩ සිටි සේක. ඉක්බිති සංගාරව බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ කුළුපග කතා බස් කළේය. ප්‍රීති ප්‍රමෝදයට කරුණුවන, සිහිපත් කළ යුතු කතා බස් කොට, එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩිවී සිටි සංගාරව බ්‍රාහ්මණයාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"බ්‍රාහ්මණය, ඇත්තෙන්ම ඔබ ජලයෙන් පිරිසිදුකම අපේක්ෂා කරන්නෙක් ද, ජලයෙන් පිරිසිදු බව ලබන්නේයයි පිළිගන්නෙක් ද, සවස් කලත්, උදෑසනත් දියට බැස ස්නානය කිරීමේ අභ්‍යාසයෙහි නිරතව වාසය කරන්නෙක් ද?\" \"ගෞතමයන් වහන්ස, එසේය.\" \"බ්‍රාහ්මණය, ඔබ කවර කරුණක් දකිමින් ද, ජලයෙන් පිරිසිදුකම අපේක්ෂා කරන්නෙක් ද, ජලයෙන් පිරිසිදු බව ලබන්නේයයි පිළිගන්නෙක් ද, සවස් කලත්, උදෑසනත් දියට බැස ස්නානය කිරීමේ අභ්‍යාසයෙහි නිරතව වාසය කරන්නෙක් ද?\" \"ගෞතමයන් වහන්ස, මෙහිලා මා විසින් දවාලෙහි යම් පාප කර්මයක් කරනු ලැබේ ද, එය සවස් කල ස්නානය කිරීමෙන් පහකරමි. යම් පාප කර්මයක් රාත්‍රියෙහි කරනු ලැබේ ද, එය උදෑසන ස්නානය කිරීමෙන් පහකරමි. ගෞතමයන් වහන්ස, මම මේ කාරණය දකිමින් ජලයෙන් පිරිසිදුකම අපේක්ෂා කරමි, ජලයෙන් පිරිසිදු බව ලබන්නේයයි පිළිගනිමි, සවස් කලත්, උදෑසනත් දියට බැස ස්නානය කිරීමේ අභ්‍යාසයෙහි නිරතව වාසය කරමි.\"\n\n\"බ්‍රාහ්මණය, අහේතුක දෝෂ රහිත වූ, සත්පුරුෂයන් විසින් ප්‍රශංසා කරන ලද, ධර්මය නම් වූ සිල් තොටක් ඇත. යම් සිල් තොටක, පරම දැනුමෙහි කෙළවරට පැමිණි උතුමන් ස්නානය කරත් ද, රාගයෙන් නොඇලුණාහුම නිවන් නම් වූ පරතෙරට පත්වෙති.\"\n\nමෙසේ වදාළ කල්හි සංගාරව බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය සැළ කළේය: \"ගෞතමයන් වහන්ස, ඉතා මනහරය! ගෞතමයන් වහන්ස, ඉතා මනහරය! ... භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය මා උපාසකයෙකු ලෙස සලකන සේක්වා!\"",
      "paliTitle": "Saṅgāravasuttaṃ"
    },
    {
      "number": 208,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sakkesu viharati khomadussaṃ nāmaṃ sakyānaṃ nigamo. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya khomadussaṃ nigamaṃ piṇḍāya pāvisi. Tena kho pana samayena khomadussakā brāhmaṇagahapatikā sabhāyaṃ sannipatitā honti kenacideva karaṇīyena, devo ca ekamekaṃ phusāyati. Atha kho bhagavā yena sā sabhā tenupasaṅkami. Addasaṃsu khomadussakā brāhmaṇagahapatikā bhagavantaṃ dūratova āgacchantaṃ. Disvāna etadavocuṃ – ‘‘ke ca muṇḍakā samaṇakā, ke ca sabhādhammaṃ jānissantī’’ti? Atha kho bhagavā khomadussake brāhmaṇagahapatike gāthāya ajjhabhāsi – ‘‘Nesā sabhā yattha na santi santo, Santo na te ye na vadanti dhammaṃ; Rāgañca dosañca pahāya mohaṃ, Dhammaṃ vadantā ca bhavanti santo’’ti. Evaṃ vutte, khomadussakā brāhmaṇagahapatikā bhagavantaṃ etadavocuṃ – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama; seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – cakkhumanto rūpāni dakkhantīti, evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāma dhammañca bhikkhusaṅghañca. Upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete saraṇaṃ gate’’ti. ",
      "english": "Thus have I heard – at one time the Blessed One was dwelling among the Sakyans, in a Sakyan town called Khomadussa. Then, in the forenoon, the Blessed One dressed, and taking his bowl and outer robe, entered the town of Khomadussa for alms. Now at that time, the Brahmins and householders of Khomadussa were assembled in the assembly hall on account of some business, and it was sprinkling a little rain. Then the Blessed One approached that assembly hall. The Brahmins and householders of Khomadussa saw the Blessed One coming from afar. Having seen him, they said, “Who are these shaven-headed ascetics, and who would understand the proper conduct of an assembly hall?” Then the Blessed One addressed the Brahmins and householders of Khomadussa with a verse: “That is not an assembly where there are no noble ones. And those are not noble ones who do not speak the Dhamma. Having abandoned craving, aversion, and delusion, those who speak the Dhamma – they indeed are the noble ones.”\n\nWhen this was said, the Brahmins and householders of Khomadussa said to the Blessed One, “Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as, Venerable Gotama, one might set upright what was overturned, or reveal what was hidden, or show the way to one who was lost, or hold up an oil lamp in the darkness so that those with eyes might see forms – in the same way, the Dhamma has been made clear by the Venerable Gotama in many ways. We hereby go for refuge to the Venerable Gotama, and to the Dhamma, and to the community of monks. May the Venerable Gotama accept us as lay followers, having gone for refuge from this day forth for as long as life lasts.”",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයක භාග්‍ය‌වතුන් වහන්සේ සක්වරුන්ගේ ඛොමදුස්ස නම් නියම්ගමෙහි වැඩ වාසය කළ සේක. ඉක්බිති භාග්‍ය‌වතුන් වහන්සේ පෙරවරුවේ චීවරය හැඳ, පාත්‍ර සිවුරු ගෙන, ඛොමදුස්ස නියම්ගම පිඬු පිණිස වැඩිය සේක. එකල ඛොමදුස්ස වැසි බ්‍රාහ්මණ ගෘහපතියෝ කිසියම් කටයුත්තක් පිණිස සභා ශාලාවක රැස්ව සිටියහ. තවද, පොද වැස්සක් ද එක් එක් අය වෙත වැටෙමින් තිබුණි. ඉක්බිති භාග්‍ය‌වතුන් වහන්සේ ඒ සභා ශාලාව වෙත වැඩිය සේක. ඛොමදුස්ස වැසි බ්‍රාහ්මණ ගෘහපතියෝ භාග්‍ය‌වතුන් වහන්සේ දුරින් වඩිනු දුටුවෝය. දුටු විගස ඔවුන් මෙසේ කීහ: \"මේ තක්කඩි මුඩුමහණවරු කවරහුද? සභාධර්මය දන්නෝ කවරහුද?\"\n\nඉක්බිති භාග්‍ය‌වතුන් වහන්සේ ඛොමදුස්ස වැසි බ්‍රාහ්මණ ගෘහපතීන්ට ගාථාවකින් මෙසේ වදාළ සේක: \"යම් තැනෙක සත්පුරුෂයෝ නැත්ද, එය සභාවක් නොවේ. යම් අයෙක් ධර්ම‌ය නොකියත්ද, ඔවුහු සත්පුරුෂයෝ නොවෙති. රාගයත්, ද්වේෂයත්, මෝහයත් ප්‍‌රහාණය කොට ධර්ම‌ය කියන්නෝම සත්පුරුෂයෝ වෙති.\" මෙසේ වදාළ කල්හි, ඛොමදුස්ස වැසි බ්‍රාහ්මණ ගෘහපතියෝ භාග්‍ය‌වතුන් වහන්සේට මෙසේ කීහ: \"ඉතා අලංකාරයි භවත් ගෞතමයන් වහන්ස, ඉතා අලංකාරයි භවත් ගෞතමයන් වහන්ස! භවත් ගෞතමයන් වහන්ස, යම්සේ පහළට හරවා තිබූ දෙයක් උඩුකුරු කරන්නේද, වැසී තිබූ දෙයක් විවෘත කරන්නේද, මග වැරදියාට මග කියන්නේද, ඇස් ඇත්තෝ රූප දක්නා පිණිස අන්ධකාරයෙහි තෙල් පහනක් දරන්නේද, එපරිද්දෙන්ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්ම‌ය ප්‍‌රකාශ කරන ලදී. අපි ඒ භවත් ගෞතමයන් වහන්සේ ද, ධර්ම‌ය ද, භික්ෂු සංඝයා ද සරණ යමු. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකවරුන් ලෙස අප පිළිගන්නා සේක්වා.\"",
      "paliTitle": "Khomadussasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Upāsakavaggo dutiyo. Tassuddānaṃ – Kasi udayo devahito, aññataramahāsālaṃ; Mānathaddhaṃ paccanīkaṃ, navakammikakaṭṭhahāraṃ; Mātuposakaṃ bhikkhako, saṅgāravo ca khomadussena dvādasāti. Brāhmaṇasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}