{
  "id": "pv.55",
  "title": {
    "pali": "Saṭṭhikūṭapetavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 16,
      "pali": "Saṭṭhikūṭapetavatthu",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 806,
      "pali": "‘‘Kiṃ nu ummattarūpova, migo bhantova dhāvasi; Nissaṃsayaṃ pāpakammanto [pāpakammaṃ (syā. pī.)], kiṃ nu saddāyase tuva’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 807,
      "pali": "‘‘Ahaṃ bhadante petomhi, duggato yamalokiko; Pāpakammaṃ karitvāna, petalokaṃ ito gato.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 808,
      "pali": "‘‘Saṭṭhi kūṭasahassāni, paripuṇṇāni sabbaso; Sīse mayhaṃ nipatanti, te bhindanti ca matthaka’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 809,
      "pali": "‘‘Kiṃ nu kāyena vācāya, manasā dukkaṭaṃ kataṃ; Kissa kammavipākena, idaṃ dukkhaṃ nigacchasi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 810,
      "pali": "‘‘Saṭṭhi kūṭasahassāni, paripuṇṇāni sabbaso; Sīse tuyhaṃ nipatanti, te bhindanti ca matthaka’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 811,
      "pali": "‘‘Athaddasāsiṃ sambuddhaṃ, sunettaṃ bhāvitindriyaṃ; Nisinnaṃ rukkhamūlasmiṃ, jhāyantaṃ akutobhayaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 812,
      "pali": "‘‘Sālittakappahārena, bhindissaṃ tassa matthakaṃ; Tassa kammavipākena, idaṃ dukkhaṃ nigacchisaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 813,
      "pali": "‘‘Saṭṭhi kūṭasahassāni, paripuṇṇāni sabbaso; Sīse mayhaṃ nipatanti, te bhindanti ca [nipatanti, vo bhindanteva (sī. dhammapadaṭṭhakathā)] matthaka’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 814,
      "pali": "‘‘Dhammena te kāpurisa, saṭṭhikūṭasahassāni, paripuṇṇāni sabbaso; Sīse tuyhaṃ nipatanti, te bhindanti ca matthaka’’nti. Saṭṭhikūṭapetavatthu soḷasamaṃ. Mahāvaggo catuttho niṭṭhito. Tassuddānaṃ – Ambasakkaro serīsako, piṅgalo revati ucchu; Dve kumārā duve gūthā, gaṇapāṭaliambavanaṃ. Akkharukkhabhogasaṃharā, seṭṭhiputtasaṭṭhikūṭā; Iti soḷasavatthūni, vaggo tena pavuccati. Atha vagguddānaṃ – Urago uparivaggo, cūḷamahāti catudhā; Vatthūni ekapaññāsaṃ, catudhā bhāṇavārato. Petavatthupāḷi niṭṭhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}