{
  "id": "an10.16",
  "title": {
    "pali": "Puggalavaggo",
    "english": "The Chapter on Individuals",
    "sinhala": "පුද්ගල වග්ගය"
  },
  "sections": [
    {
      "number": 155,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato puggalo na sevitabbo. Katamehi dasahi? Micchādiṭṭhiko hoti, micchāsaṅkappo hoti, micchāvāco hoti, micchākammanto hoti, micchāājīvo hoti, micchāvāyāmo hoti, micchāsati hoti, micchāsamādhi hoti, micchāñāṇī hoti, micchāvimutti hoti – imehi kho, bhikkhave, dasahi dhammehi samannāgato puggalo na sevitabbo. ‘‘Dasahi, bhikkhave, dhammehi samannāgato puggalo sevitabbo. Katamehi dasahi? Sammādiṭṭhiko hoti, sammāsaṅkappo hoti, sammāvāco hoti, sammākammanto hoti, sammāājīvo hoti, sammāvāyāmo hoti, sammāsati hoti, sammāsamādhi hoti, sammāñāṇī hoti, sammāvimutti hoti – imehi kho, bhikkhave, dasahi dhammehi samannāgato puggalo sevitabbo’’ti.",
      "english": "Monks, an individual endowed with ten qualities should not be associated with. Which ten? They hold wrong view, they have wrong intention, they engage in wrong speech, they commit wrong action, they maintain a wrong livelihood, they exert wrong effort, they practice wrong mindfulness, they achieve wrong concentration, they possess wrong knowledge, and they attain wrong liberation. Monks, an individual endowed with these ten qualities should not be associated with.\n\nMonks, an individual endowed with ten qualities should be associated with. Which ten? They hold right view, they have right intention, they engage in right speech, they commit right action, they maintain a right livelihood, they exert right effort, they practice right mindfulness, they achieve right concentration, they possess right knowledge, and they attain right liberation. Monks, an individual endowed with these ten qualities should be associated with.",
      "sinhala": "භික්ෂූන් වහන්ස, දස ධර්මයන්ගෙන් යුක්ත පුද්ගලයා සේවනය නොකළ යුතුයි. ඒ දස ධර්ම මොනවාද? ඔහු මිථ්‍යාදෘෂ්ටිකයෙක් වෙයි; මිථ්‍යාසංකල්පනා ඇත්තෙක් වෙයි; මිථ්‍යාවාචාව ඇත්තෙක් වෙයි; මිථ්‍යාකම්මන්තය ඇත්තෙක් වෙයි; මිථ්‍යාආජීවය ඇත්තෙක් වෙයි; මිථ්‍යාව‍්‍යායාමය ඇත්තෙක් වෙයි; මිථ්‍යාසතිය ඇත්තෙක් වෙයි; මිථ්‍යාසමාධිය ඇත්තෙක් වෙයි; මිථ්‍යාඥාණය ඇත්තෙක් වෙයි; මිථ්‍යාවිමුක්තිය ඇත්තෙක් වෙයි. භික්ෂූන් වහන්ස, මේ දස ධර්මයන්ගෙන් යුක්ත පුද්ගලයා සේවනය නොකළ යුතුයි.\n\nභික්ෂූන් වහන්ස, දස ධර්මයන්ගෙන් යුක්ත පුද්ගලයා සේවනය කළ යුතුයි. ඒ දස ධර්ම මොනවාද? ඔහු සම්මාදෘෂ්ටිකයෙක් වෙයි; සම්මාසංකල්පනා ඇත්තෙක් වෙයි; සම්මාවාචාව ඇත්තෙක් වෙයි; සම්මාකම්මන්තය ඇත්තෙක් වෙයි; සම්මාආජීවය ඇත්තෙක් වෙයි; සම්මාව‍්‍යායාමය ඇත්තෙක් වෙයි; සම්මාසතිය ඇත්තෙක් වෙයි; සම්මාසමාධිය ඇත්තෙක් වෙයි; සම්මාඥාණය ඇත්තෙක් වෙයි; සම්මාවිමුක්තිය ඇත්තෙක් වෙයි. භික්ෂූන් වහන්ස, මේ දස ධර්මයන්ගෙන් යුක්ත පුද්ගලයා සේවනය කළ යුතුයි.",
      "paliTitle": "Sevitabbasuttaṃ"
    },
    {
      "number": 156,
      "numberRange": "156-169",
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato puggalo na bhajitabbo…pe… bhajitabbo… pe… na payirupāsitabbo… payirupāsitabbo…pe… na pujjo hoti… pujjo hoti…pe… na pāsaṃso hoti… pāsaṃso hoti…pe… agāravo hoti… sagāravo hoti…pe… appatisso hoti… sappatisso hoti…pe… na ārādhako hoti … ārādhako hoti…pe… na visujjhati… visujjhati…pe… mānaṃ nādhibhoti… mānaṃ adhibhoti…pe. … paññāya na vaḍḍhati… paññāya vaḍḍhati…pe…. ‘‘Bahuṃ apuññaṃ pasavati… bahuṃ puññaṃ pasavati. Katamehi dasahi? Sammādiṭṭhiko hoti, sammāsaṅkappo hoti, sammāvāco hoti, sammākammanto hoti, sammāājīvo hoti, sammāvāyāmo hoti, sammāsati hoti, sammāsamādhi hoti, sammāñāṇī hoti, sammāvimutti hoti – imehi kho, bhikkhave, dasahi dhammehi samannāgato puggalo bahuṃ puññaṃ pasavatī’’ti. ",
      "english": "Monks, a person endowed with ten qualities is not to be associated with, is not to be waited upon, is not worthy of veneration, is not worthy of praise, is disrespectful, is irreverent, does not achieve the goal, is not purified, does not overcome conceit, and does not grow in wisdom. Such a person accumulates much demerit.\n\nMonks, a person endowed with ten qualities is to be associated with, is to be waited upon, is worthy of veneration, is worthy of praise, is respectful, is reverent, achieves the goal, becomes purified, overcomes conceit, and grows in wisdom. Such a person accumulates much merit.\n\nWhich ten? They are: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, and Right Liberation. Monks, a person endowed with these ten qualities accumulates much merit.",
      "sinhala": "මහණෙනි, දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා ඇසුරු නොකළ යුතු ය; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා ඇසුරු කළ යුතු ය. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයාට උවටැන් නොකළ යුතු ය; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයාට උවටැන් කළ යුතු ය. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා පූජාර්හ නොවේ; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා පූජාර්හ වේ. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා ප්‍ර‍ශංසනීය නොවේ; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා ප්‍ර‍ශංසනීය වේ. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා ගෞරව රහිත වේ; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා ගෞරව සහිත වේ. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා ප්‍ර‍ත්‍යගෞරව රහිත වේ; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා ප්‍ර‍ත්‍යගෞරව සහිත වේ. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා අරමුණ සම්පූර්ණ කර නොගනියි; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා අරමුණ සම්පූර්ණ කර ගනියි. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා පිරිසිදු නොවේ; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා පිරිසිදු වේ. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා මානයෙන් ජය නොගනියි; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා මානයෙන් ජය ගනියි. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා ප්‍ර‍ඥාවෙන් වර්ධනය නොවේ; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා ප්‍ර‍ඥාවෙන් වර්ධනය වේ. දස ධර්‍මයකින් සමන්විත නොවූ පුද්ගලයා බොහෝ අකුසල් රැස් කරයි; එහෙත් දස ධර්‍මයකින් සමන්විත පුද්ගලයා බොහෝ කුසල් රැස් කරයි.\n\nඒ දස ධර්‍මයෝ කවරහු ද? සම්මාදිට්ඨිය වේ, සම්මාසංකප්ප වේ, සම්මාවාචා වේ, සම්මාකම්මන්ත වේ, සම්මාආජීව වේ, සම්මාවායාම වේ, සම්මාසති වේ, සම්මාසමාධි වේ, සම්මාඤාණ වේ, සම්මාවිමුක්ති වේ. මහණෙනි, මේ දස ධර්‍මයන්ගෙන් සමන්විත පුද්ගලයා බොහෝ කුසල් රැස් කරයි.",
      "paliTitle": "Bhajitabbādisuttāni"
    }
  ],
  "footer": {
    "pali": "Puggalavaggo paṭhamo.",
    "english": "",
    "sinhala": ""
  }
}