{
  "id": "an10.17",
  "title": {
    "pali": "Jāṇussoṇivaggo",
    "english": "The Janussoni Division",
    "sinhala": "ජාණුස්සෝණි වග්ගය"
  },
  "sections": [
    {
      "number": 167,
      "pali": "Tena kho pana samayena jāṇussoṇi brāhmaṇo tadahuposathe sīsaṃnhāto navaṃ khomayugaṃ nivattho allakusamuṭṭhiṃ ādāya bhagavato avidūre ekamantaṃ ṭhito hoti. Addasā kho bhagavā jāṇussoṇiṃ brāhmaṇaṃ tadahuposathe sīsaṃnhātaṃ navaṃ khomayugaṃ nivatthaṃ allakusamuṭṭhiṃ ādāya ekamantaṃ ṭhitaṃ. Disvāna jāṇussoṇiṃ brāhmaṇaṃ etadavoca – ‘‘kiṃ nu tvaṃ, brāhmaṇa, tadahuposathe sīsaṃnhāto navaṃ khomayugaṃ nivattho allakusamuṭṭhiṃ ādāya ekamantaṃ ṭhito? Kiṃ nvajja brāhmaṇakulassā’’ti? ‘‘Paccorohaṇī, bho gotama, ajja brāhmaṇakulassā’’ti. ‘‘Yathā kathaṃ pana, brāhmaṇa, brāhmaṇānaṃ paccorohaṇī hotī’’ti? ‘‘Idha, bho gotama, brāhmaṇā tadahuposathe sīsaṃnhātā navaṃ khomayugaṃ nivatthā allena gomayena pathaviṃ opuñjitvā haritehi kusehi pattharitvā antarā ca velaṃ antarā ca agyāgāraṃ seyyaṃ kappenti. Te taṃ rattiṃ tikkhattuṃ paccuṭṭhāya pañjalikā aggiṃ namassanti – ‘paccorohāma bhavantaṃ, paccorohāma bhavanta’nti. Bahukena ca sappitelanavanītena aggiṃ santappenti. Tassā ca rattiyā accayena paṇītena khādanīyena bhojanīyena brāhmaṇe santappenti. Evaṃ, bho gotama, brāhmaṇānaṃ paccorohaṇī hotī’’ti. ‘‘Aññathā kho, brāhmaṇa, brāhmaṇānaṃ paccorohaṇī hoti, aññathā ca pana ariyassa vinaye paccorohaṇī hotī’’ti. ‘‘Yathā kathaṃ pana, bho gotama, ariyassa vinaye paccorohaṇī hoti? Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathā ariyassa vinaye paccorohaṇī hotī’’ti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho jāṇussoṇi brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idha, brāhmaṇa, ariyasāvako iti paṭisañcikkhati – ‘pāṇātipātassa kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañcā’ ti. So iti paṭisaṅkhāya pāṇātipātaṃ pajahati; pāṇātipātā paccorohati. …Adinnādānassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya adinnādānaṃ pajahati; adinnādānā paccorohati. …Kāmesumicchācārassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya kāmesumicchācāraṃ pajahati; kāmesumicchācārā paccorohati. …Musāvādassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya musāvādaṃ pajahati; musāvādā paccorohati. …Pisuṇāya vācāya kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya pisuṇaṃ vācaṃ pajahati; pisuṇāya vācāya paccorohati. …Pharusāya vācāya kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya pharusaṃ vācaṃ pajahati; pharusāya vācāya paccorohati. …Samphappalāpassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya samphappalāpaṃ pajahati; samphappalāpā paccorohati. …Abhijjhāya kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya abhijjhaṃ pajahati; abhijjhāya paccorohati. …Byāpādassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya byāpādaṃ pajahati; byāpādā paccorohati. …Micchādiṭṭhiyā kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchādiṭṭhiṃ pajahati; micchādiṭṭhiyā paccorohati. Evaṃ kho, brāhmaṇa, ariyassa vinaye paccorohaṇī hotī’’ti. ‘‘Aññathā kho, bho gotama, brāhmaṇānaṃ paccorohaṇī hoti, aññathā ca pana ariyassa vinaye paccorohaṇī hoti. Imissā, bho gotama, ariyassa vinaye paccorohaṇiyā brāhmaṇānaṃ paccorohaṇī kalaṃ nāgghati soḷasiṃ. Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Paṭhamaṃ.",
      "english": "At that time, the brahman Jāṇussoṇi, on that Uposatha day, having bathed his head, wearing a new pair of linen clothes, and holding a handful of fresh kusa grass, was standing to one side, not far from the Blessed One. The Blessed One saw the brahman Jāṇussoṇi standing to one side on that Uposatha day, having bathed his head, wearing a new pair of linen clothes, and holding a handful of fresh kusa grass. Having seen the brahman Jāṇussoṇi, he said this: \"Why are you, brahman, on this Uposatha day, having bathed your head, wearing a new pair of linen clothes, and holding a handful of fresh kusa grass, standing to one side? What is the custom for the brahman family today?\"\n\n\"Today is the day of ritual descent, good Gotama, for the brahman family.\"\n\"And how, brahman, do brahmans perform this ritual descent?\"\n\"Here, good Gotama, brahmans, on this Uposatha day, having bathed their heads and wearing new pairs of linen clothes, having plastered the ground with fresh cow dung and spread green kusa grass, make their bed between the altar and the fire sanctuary. During that night, they rise three times and venerate the fire with clasped hands, saying, 'We descend to you, master; we descend to you, master!' And they satisfy the fire with much ghee, oil, and butter. And after the passing of that night, they satisfy brahmans with exquisite solid food and soft food. Thus, good Gotama, is the brahmans' ritual descent.\"\n\n\"Indeed, brahman, the brahmans' ritual descent is one thing, but in the Noble Discipline, the purification is quite another.\"\n\"And how, good Gotama, is the purification in the Noble Discipline? It would be good if Master Gotama would teach me the Dhamma in such a way that the purification in the Noble Discipline is explained.\"\n\"In that case, brahman, listen and pay close attention; I shall speak.\"\n\"Yes, good sir,\" replied the brahman Jāṇussoṇi to the Blessed One.\n\nThe Blessed One said this: \"Here, brahman, a noble disciple reflects thus: 'Indeed, the unwholesome result of killing living beings is evil in this present life and in the life to come.' Having thus reflected, he abandons the killing of living beings; he refrains from the killing of living beings.\n... 'Indeed, the unwholesome result of taking what is not given is evil in this present life and in the life to come.' Having thus reflected, he abandons taking what is not given; he refrains from taking what is not given.\n... 'Indeed, the unwholesome result of sexual misconduct is evil in this present life and in the life to come.' Having thus reflected, he abandons sexual misconduct; he refrains from sexual misconduct.\n... 'Indeed, the unwholesome result of false speech is evil in this present life and in the life to come.' Having thus reflected, he abandons false speech; he refrains from false speech.\n... 'Indeed, the unwholesome result of slanderous speech is evil in this present life and in the life to come.' Having thus reflected, he abandons slanderous speech; he refrains from slanderous speech.\n... 'Indeed, the unwholesome result of harsh speech is evil in this present life and in the life to come.' Having thus reflected, he abandons harsh speech; he refrains from harsh speech.\n... 'Indeed, the unwholesome result of frivolous speech is evil in this present life and in the life to come.' Having thus reflected, he abandons frivolous speech; he refrains from frivolous speech.\n... 'Indeed, the unwholesome result of covetousness is evil in this present life and in the life to come.' Having thus reflected, he abandons covetousness; he refrains from covetousness.\n... 'Indeed, the unwholesome result of ill-will is evil in this present life and in the life to come.' Having thus reflected, he abandons ill-will; he refrains from ill-will.\n... 'Indeed, the unwholesome result of wrong view is evil in this present life and in the life to come.' Having thus reflected, he abandons wrong view; he refrains from wrong view.\nThus, brahman, is the purification in the Noble Discipline.\"\n\n\"Indeed, good Gotama, the brahmans' ritual descent is one thing, and the purification in the Noble Discipline is quite another. Compared to this purification in the Noble Discipline, good Gotama, the brahmans' ritual descent is not worth a sixteenth part. Excellent, good Gotama! Excellent, good Gotama! Just as if one were to set upright what had been overturned, or to reveal what had been hidden, or to show the way to one who was lost, or to carry a lamp into the darkness so that those with eyes could see forms, in the same way has the Dhamma been made clear by Master Gotama in many ways. May Master Gotama accept me as a lay follower who has gone for refuge from this day forth as long as life lasts.\"",
      "sinhala": "එකල, ජාණුස්සෝණි බමුණා එදින උපෝසථ දිනයේ හිස සෝදා නා, අලුත් කසී සළු යුගලක් හැඳ, තෙත් දහවල් අතැතිව, භාග්‍යවතුන් වහන්සේට නුදුරින්, එකත්පසෙක සිටියේය. භාග්‍යවතුන් වහන්සේ එදින උපෝසථ දිනයේ හිස සෝදා නා, අලුත් කසී සළු යුගලක් හැඳ, තෙත් දහවල් අතැතිව, එකත්පසෙක සිටින ජාණුස්සෝණි බමුණා දුටුසේක. ජාණුස්සෝණි බමුණා දැක, මෙසේ වදාළසේක: “බමුණ, ඔබ එදින උපෝසථ දිනයේ හිස සෝදා නා, අලුත් කසී සළු යුගලක් හැඳ, තෙත් දහවල් අතැතිව එකත්පසෙක සිටින්නේ කුමක් නිසාද? අද බමුණු කුලයේ කුමක්ද?” “භවත් ගෞතමයන් වහන්ස, අද බමුණු කුලයේ පච්චෝරෝහණී දිනයයි.” “බමුණ, බමුණන්ගේ පච්චෝරෝහණී ක්‍රියාව වන්නේ කෙසේද?” “භවත් ගෞතමයන් වහන්ස, මෙහිලා බමුණෝ එදින උපෝසථ දිනයේ හිස සෝදා නා, අලුත් කසී සළු යුගලක් හැඳ, තෙත් ගොමෙන් බිම ගා, කොළ පැහැති තණකොළ අතුරා, වේදිකාවත්, ගින්දර තබන ශාලාවත් අතර නිදාගනිති. ඔවුහු ඒ රාත්‍රියේ තුන් වරක් පිබිද, දොහොත් මුදුන් දී ගින්නට නමස්කාර කරමින් ‘භවත් තැන, අප බැස යමු, භවත් තැන, අප බැස යමු’ යැයි කියති. බොහෝ ඝෘත, තෙල්, සහ වෙඬරු වලින් ගින්න සතුටු කරති. ඒ රාත්‍රිය පහන් වීමෙන් පසු, ප්‍රණීත කෑම වර්ග සහ බීම වර්ග වලින් බමුණන් සතුටු කරති. භවත් ගෞතමයන් වහන්ස, බමුණන්ගේ පච්චෝරෝහණී ක්‍රියාව වන්නේ මෙසේය.”\n\n“බමුණ, බමුණන්ගේ පච්චෝරෝහණී ක්‍රියාව එක ආකාරයකි. ආර්ය විනයෙහි පච්චෝරෝහණී ක්‍රියාව තවත් ආකාරයකි.” “භවත් ගෞතමයන් වහන්ස, ආර්ය විනයෙහි පච්චෝරෝහණී ක්‍රියාව වන්නේ කෙසේද? ආර්ය විනයෙහි පච්චෝරෝහණී ක්‍රියාව වන ආකාරය භවත් ගෞතමයන් වහන්සේ මට ධර්මය දේශනා කරන්නේ නම් මැනවි.” “එසේනම්, බමුණ, සවන් දෙන්න, හොඳින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.” “එසේය, භාග්‍යවතුන් වහන්ස” යි ජාණුස්සෝණි බමුණා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළසේක: “බමුණ, මෙහිලා ආර්ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි – ‘ප්‍රාණඝාතයට නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය’ කියා. ඔහු මෙසේ නුවණින් විමසා ප්‍රාණඝාතය අත්හරියි; ප්‍රාණඝාතයෙන් වැළකෙයි. අදත්තාදානයට නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා අදත්තාදානය අත්හරියි; අදත්තාදානයෙන් වැළකෙයි. කාමයන්හි මිස්‍යාචාරයට නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා කාමයන්හි මිස්‍යාචාරය අත්හරියි; කාමයන්හි මිස්‍යාචාරයෙන් වැළකෙයි. මුසාවාදයට නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා මුසාවාදය අත්හරියි; මුසාවාදයෙන් වැළකෙයි. පිසුනු වචනයට (කේළාම් කීමට) නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා පිසුනු වචනය අත්හරියි; පිසුනු වචනයෙන් වැළකෙයි. ඵරුෂ වචනයට (කර්කශ වචනයට) නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා ඵරුෂ වචනය අත්හරියි; ඵරුෂ වචනයෙන් වැළකෙයි. සම්ප්‍රප්පලාපයට (නිෂ්ඵල ප්‍රලාපයට) නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා සම්ප්‍රප්පලාපය අත්හරියි; සම්ප්‍රප්පලාපයෙන් වැළකෙයි. අභිධ්‍යාවට (අනුන් සතු දේට ආශා කිරීමට) නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා අභිධ්‍යාව අත්හරියි; අභිධ්‍යාවෙන් වැළකෙයි. ව්‍යාපාදයට (ද්වේෂයට) නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා ව්‍යාපාදය අත්හරියි; ව්‍යාපාදයෙන් වැළකෙයි. මිස්‍යාදෘෂ්ටියට නම් මේ ආත්මයෙහිද, පරලොවදීද පව් විපාක ලැබෙන්නේය. ඔහු මෙසේ නුවණින් විමසා මිස්‍යාදෘෂ්ටිය අත්හරියි; මිස්‍යාදෘෂ්ටියෙන් වැළකෙයි. බමුණ, ආර්ය විනයෙහි පච්චෝරෝහණී ක්‍රියාව වන්නේ මෙසේය.”\n\n“භවත් ගෞතමයන් වහන්ස, බමුණන්ගේ පච්චෝරෝහණී ක්‍රියාව එක ආකාරයකි. ආර්ය විනයෙහි පච්චෝරෝහණී ක්‍රියාව තවත් ආකාරයකි. භවත් ගෞතමයන් වහන්ස, මේ ආර්ය විනයෙහි පච්චෝරෝහණී ක්‍රියාවට බමුණන්ගේ පච්චෝරෝහණී ක්‍රියාව දහසයයෙන් කොටසක්වත් නොපැමිණෙයි. භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි... අද පටන් දිවි හිමියෙන් තෙරුවන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා!”",
      "paliTitle": "Brāhmaṇapaccorohaṇīsuttaṃ",
      "englishTitle": "The Brahmin's Descent Discourse",
      "sinhalaTitle": "බ්‍රාහ්මණපච්චෝරෝහණී සූත්‍රය"
    },
    {
      "number": 168,
      "pali": "‘‘Ariyaṃ vo, bhikkhave, paccorohaṇiṃ desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamā ca, bhikkhave, ariyā paccorohaṇī? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘pāṇātipātassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya pāṇātipātaṃ pajahati; pāṇātipātā paccorohati. … ‘Adinnādānassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya adinnādānaṃ pajahati; adinnādānā paccorohati. … ‘Kāmesumicchācārassa kho pāpako vipāko…pe… kāmesumicchācārā paccorohati. … ‘Musāvādassa kho pāpako vipāko…pe… musāvādā paccorohati. … ‘Pisuṇāya vācāya kho pāpako vipāko…pe… pisuṇāya vācāya paccorohati. … ‘Pharusāya vācāya kho pāpako vipāko…pe… pharusāya vācāya paccorohati. … ‘Samphappalāpassa kho pāpako vipāko…pe… samphappalāpā paccorohati. … ‘Abhijjhāya kho pāpako vipāko…pe… abhijjhāya paccorohati. … ‘Byāpādassa kho pāpako vipāko…pe… byāpādā paccorohati. ‘‘Katamā ca, bhikkhave, ariyā paccorohaṇī? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘micchādiṭṭhiyā kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchādiṭṭhiṃ pajahati; micchādiṭṭhiyā paccorohati. Ayaṃ vuccati, bhikkhave, ariyā paccorohaṇī’’ti. Dutiyaṃ.",
      "english": "“Monks, I will teach you the noble relinquishment. Listen to it, attend carefully; I will speak.”\n\n“Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One said this:\n\n“And what, monks, is the noble relinquishment? Here, monks, a noble disciple reflects thus: ‘Killing living beings truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons killing living beings; he relinquishes killing living beings.\n\n‘Taking what is not given truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons taking what is not given; he relinquishes taking what is not given.\n\n‘Sexual misconduct truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons sexual misconduct; he relinquishes sexual misconduct.\n\n‘False speech truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons false speech; he relinquishes false speech.\n\n‘Slanderous speech truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons slanderous speech; he relinquishes slanderous speech.\n\n‘Harsh speech truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons harsh speech; he relinquishes harsh speech.\n\n‘Frivolous talk truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons frivolous talk; he relinquishes frivolous talk.\n\n‘Covetousness truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons covetousness; he relinquishes covetousness.\n\n‘Ill-will truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons ill-will; he relinquishes ill-will.\n\n“And what, monks, is the noble relinquishment? Here, monks, a noble disciple reflects thus: ‘Wrong view truly has an unwholesome consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons wrong view; he relinquishes wrong view. This, monks, is called the noble relinquishment.”",
      "sinhala": "‘‘මහණෙනි, මම ඔබට ආර්ය පච්චෝරෝහණය දේශනා කරන්නෙමි. එය අසන්න, මනාකොට මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි’’යි. ‘‘එසේය, ස්වාමීනි’’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n‘‘මහණෙනි, ආර්ය පච්චෝරෝහණය යනු කවරේද? මහණෙනි, මෙහිලා ආර්ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘ප්‍රාණඝාතයට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා ප්‍රාණඝාතය අත්හරියි; ප්‍රාණඝාතයෙන් පච්චෝරෝහණය වෙයි.\n\n‘අදත්තාදානයට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා අදත්තාදානය අත්හරියි; අදත්තාදානයෙන් පච්චෝරෝහණය වෙයි.\n\n‘කාමමිථ්‍යාචාරයට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා කාමමිථ්‍යාචාරය අත්හරියි; කාමමිථ්‍යාචාරයෙන් පච්චෝරෝහණය වෙයි.\n\n‘මුසාවාදයට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා මුසාවාදය අත්හරියි; මුසාවාදයෙන් පච්චෝරෝහණය වෙයි.\n\n‘පිසුණු වචනයට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා පිසුණු වචනය අත්හරියි; පිසුණු වචනයෙන් පච්චෝරෝහණය වෙයි.\n\n‘ඵරුෂ වචනයට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා ඵරුෂ වචනය අත්හරියි; ඵරුෂ වචනයෙන් පච්චෝරෝහණය වෙයි.\n\n‘සම්ඵප්පලාපයට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා සම්ඵප්පලාපය අත්හරියි; සම්ඵප්පලාපයෙන් පච්චෝරෝහණය වෙයි.\n\n‘අභිධ්‍යාවට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා අභිධ්‍යාව අත්හරියි; අභිධ්‍යාවෙන් පච්චෝරෝහණය වෙයි.\n\n‘ව්‍යාපාදයට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා ව්‍යාපාදය අත්හරියි; ව්‍යාපාදයෙන් පච්චෝරෝහණය වෙයි.\n\n‘‘මහණෙනි, ආර්ය පච්චෝරෝහණය යනු කවරේද? මහණෙනි, මෙහිලා ආර්ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘මිථ්‍යාදෘෂ්ටියට මේ ආත්මභාවයේදීම මෙන්ම පරලොවදීද පාපී විපාකයක් ඇත්තෙන්ම ඇතැ’යි. ඔහු මෙසේ නුවණින් සලකා මිථ්‍යාදෘෂ්ටිය අත්හරියි; මිථ්‍යාදෘෂ්ටියෙන් පච්චෝරෝහණය වෙයි. මහණෙනි, මේ ආර්ය පච්චෝරෝහණය යැයි කියනු ලැබේ.’’\n\nදෙවැනි සූත්‍රයයි.",
      "paliTitle": "Ariyapaccorohaṇīsuttaṃ",
      "englishTitle": "The Noble Re-descent Discourse",
      "sinhalaTitle": "ආර්ය පච්චෝරෝහණ සූත්‍රය"
    },
    {
      "number": 169,
      "pali": "[a. ni. 10.117] Atha kho saṅgāravo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho saṅgāravo brāhmaṇo bhagavantaṃ etadavoca – ‘‘Kiṃ nu kho, bho gotama, orimaṃ tīraṃ, kiṃ pārimaṃ tīra’’nti? ‘‘Pāṇātipāto kho, brāhmaṇa, orimaṃ tīraṃ, pāṇātipātā veramaṇī pārimaṃ tīraṃ. Adinnādānaṃ kho, brāhmaṇa, orimaṃ tīraṃ, adinnādānā veramaṇī pārimaṃ tīraṃ. Kāmesumicchācāro orimaṃ tīraṃ, kāmesumicchācārā veramaṇī pārimaṃ tīraṃ. Musāvādo orimaṃ tīraṃ, musāvādā veramaṇī pārimaṃ tīraṃ. Pisuṇā vācā orimaṃ tīraṃ, pisuṇāya vācāya veramaṇī pārimaṃ tīraṃ. Pharusā vācā orimaṃ tīraṃ, pharusāya vācāya veramaṇī pārimaṃ tīraṃ. Samphappalāpo orimaṃ tīraṃ, samphappalāpā veramaṇī pārimaṃ tīraṃ. Abhijjhā orimaṃ tīraṃ, anabhijjhā pārimaṃ tīraṃ. Byāpādo orimaṃ tīraṃ, abyāpādo pārimaṃ tīraṃ. Micchādiṭṭhi orimaṃ tīraṃ, sammādiṭṭhi pārimaṃ tīraṃ. Idaṃ kho, brāhmaṇa, orimaṃ tīraṃ, idaṃ pārimaṃ tīranti. ‘‘Appakā te manussesu, ye janā pāragāmino; Athāyaṃ itarā pajā, tīramevānudhāvati. ‘‘Ye ca kho sammadakkhāte, dhamme dhammānuvattino; Te janā pāramessanti, maccudheyyaṃ suduttaraṃ. ‘‘Kaṇhaṃ dhammaṃ vippahāya, sukkaṃ bhāvetha paṇḍito; Okā anokamāgamma, viveke yattha dūramaṃ. ‘‘Tatrābhiratimiccheyya, hitvā kāme akiñcano; Pariyodapeyya attānaṃ, cittaklesehi paṇḍito. ‘‘Yesaṃ sambodhiyaṅgesu, sammā cittaṃ subhāvitaṃ; Ādānapaṭinissagge, anupādāya ye ratā; Khīṇāsavā jutimanto, te loke parinibbutā’’ti. tatiyaṃ;",
      "english": "Then the brahmin Saṅgārava approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the cordial and memorable conversation, he sat down to one side. Seated to one side, the brahmin Saṅgārava said to the Blessed One, \"What, venerable Gotama, is this near shore, and what is that far shore?\"\n\n\"Indeed, brahmin, the taking of life is the near shore; abstinence from taking life is the far shore. Taking what is not given is the near shore; abstinence from taking what is not given is the far shore. Sexual misconduct is the near shore; abstinence from sexual misconduct is the far shore. False speech is the near shore; abstinence from false speech is the far shore. Slanderous speech is the near shore; abstinence from slanderous speech is the far shore. Harsh speech is the near shore; abstinence from harsh speech is the far shore. Frivolous talk is the near shore; abstinence from frivolous talk is the far shore. Covetousness is the near shore; non-covetousness is the far shore. Ill will is the near shore; absence of ill will is the far shore. Wrong view is the near shore; right view is the far shore. This, brahmin, is the near shore, and that is the far shore.\"\n\nFew among humans are those who reach the far shore; the rest of humanity merely runs along the near shore.\n\nBut those who practice in accordance with the Dhamma, which has been well-proclaimed, those people will reach the far shore, transcending the realm of death which is so difficult to cross.\n\nA wise person should abandon the dark Dhamma and cultivate the bright Dhamma. Having left home for homelessness, they should delight in solitude, where delight is hard to find.\n\nThere they should seek delight, having abandoned sensual pleasures, being without possessions. A wise person should purify themselves of mental defilements.\n\nThose whose minds are well-developed in the factors of awakening, who find delight in relinquishing all attachment, in not clinging—those noble ones, with defilements destroyed, radiant, are truly unbound in this world.",
      "sinhala": "එවිට සංගාරව බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු කථා බස් හුවමාරු කරගෙන, එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩහුන් සංගාරව බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – \"භවත් ගෞතමයන් වහන්ස, මේ මෙතෙර කුමක්ද? එතෙර කුමක්ද?\" \"බ්‍රාහ්මණය, ප්‍රාණඝාතය මෙතෙරය, ප්‍රාණඝාතයෙන් වැළකීම එතෙරය. අදත්තාදානය මෙතෙරය, අදත්තාදානයෙන් වැළකීම එතෙරය. කාමයන්හි මිථ්‍යාචාරය මෙතෙරය, කාමයන්හි මිථ්‍යාචාරයෙන් වැළකීම එතෙරය. මුසාවාදය මෙතෙරය, මුසාවාදයෙන් වැළකීම එතෙරය. පිසුනු වචනය මෙතෙරය, පිසුනු වචනයෙන් වැළකීම එතෙරය. ඵරුෂ වචනය මෙතෙරය, ඵරුෂ වචනයෙන් වැළකීම එතෙරය. සම්ප්‍රප්පලාපය මෙතෙරය, සම්ප්‍රප්පලාපයෙන් වැළකීම එතෙරය. අභිධ්‍යාව මෙතෙරය, අනාභිධ්‍යාව එතෙරය. ව්‍යාපාදය මෙතෙරය, අව්‍යාපාදය එතෙරය. මිථ්‍යාදෘෂ්ටිය මෙතෙරය, සම්මාදෘෂ්ටිය එතෙරය. බ්‍රාහ්මණය, මේ මෙතෙරය, මේ එතෙරය.\"\n\nමිනිසුන් අතර, එතෙරට යන ජනයා ස්වල්ප දෙනෙකි;\nමේ සෙසු පිරිස නම්, මෙතෙරම හඹා යයි.\n\nයම් කෙනෙක් නම් මැනවින් දේශනා කරන ලද ධර්මයෙහි, ධර්මානුකූලව හැසිරෙත්ද;\nඒ ජනයා, මරණයේ අධිපතිත්වය වූ, අතිශයින් දුෂ්කර වූ (සංසාරය) තරණය කර, එතෙරට යති.\n\nපණ්ඩිත තෙමේ කළු දහම් (අකුසල්) ප්‍රහාණය කොට, සුදු දහම් (කුසල්) වඩන්නේය.\nගිහිගෙය හැරදමා, අනාගාරික බවට පැමිණ, සුවසේ ඇලීමට දුෂ්කර වූ විවේක ස්ථානයකදී,\n\nකිසිදු ඇල්මක් නැතිව, කාමයන් අත්හැර, එතැන (ඒ විවේක ස්ථානයෙහි) සතුටු වීමට කැමති විය යුතුය.\nපණ්ඩිත තෙමේ සිතේ කෙලෙස් වලින් තමාව පිරිසිදු කරගත යුතුය.\n\nයම් අයගේ සිත සම්‍යක් සම්බෝධි අංගයන්හි මැනවින් වඩන ලද්දේද;\nඇලීම්-ගැනීම් අත්හැරීමෙහිදී, උපදනයන්ගෙන් තොරව යම් අය සතුටු වෙද්ද;\nආශ්‍රවයන් ක්ෂය කළ, බැබලීමෙන් යුක්ත වූ ඒ අය ලෝකයෙහි පිරිනිවන් පෑවෝය.",
      "paliTitle": "Saṅgāravasuttaṃ",
      "englishTitle": "The Saṅgārava Sutta",
      "sinhalaTitle": "සංගාරව සූත‍්‍රය"
    },
    {
      "number": 170,
      "pali": "‘‘Orimañca, bhikkhave, tīraṃ desessāmi pārimañca tīraṃ. Taṃ suṇātha…pe… katamañca, bhikkhave, orimaṃ tīraṃ, katamañca pārimaṃ tīraṃ? Pāṇātipāto, bhikkhave, orimaṃ tīraṃ, pāṇātipātā veramaṇī pārimaṃ tīraṃ. Adinnādānaṃ orimaṃ tīraṃ, adinnādānā veramaṇī pārimaṃ tīraṃ. Kāmesumicchācāro orimaṃ tīraṃ, kāmesumicchācārā veramaṇī pārimaṃ tīraṃ. Musāvādo orimaṃ tīraṃ, musāvādā veramaṇī pārimaṃ tīraṃ. Pisuṇā vācā orimaṃ tīraṃ, pisuṇāya vācāya veramaṇī pārimaṃ tīraṃ. Pharusā vācā orimaṃ tīraṃ, pharusāya vācāya veramaṇī pārimaṃ tīraṃ. Samphappalāpo orimaṃ tīraṃ, samphappalāpā veramaṇī pārimaṃ tīraṃ. Abhijjhā orimaṃ tīraṃ, anabhijjhā pārimaṃ tīraṃ. Byāpādo orimaṃ tīraṃ, abyāpādo pārimaṃ tīraṃ. Micchādiṭṭhi orimaṃ tīraṃ, sammādiṭṭhi pārimaṃ tīraṃ. Idaṃ kho, bhikkhave, orimaṃ tīraṃ, idaṃ pārimaṃ tīranti. ‘‘Appakā te manussesu, ye janā pāragāmino; Athāyaṃ itarā pajā, tīramevānudhāvati. ‘‘Ye ca kho sammadakkhāte, dhamme dhammānuvattino; Te janā pāramessanti, maccudheyyaṃ suduttaraṃ. ‘‘Kaṇhaṃ dhammaṃ vippahāya, sukkaṃ bhāvetha paṇḍito; Okā anokamāgamma, viveke yattha dūramaṃ. ‘‘Tatrābhiratimiccheyya, hitvā kāme akiñcano; Pariyodapeyya attānaṃ, cittaklesehi paṇḍito. ‘‘Yesaṃ sambodhiyaṅgesu, sammā cittaṃ subhāvitaṃ; Ādānapaṭinissagge, anupādāya ye ratā; Khīṇāsavā jutimanto, te loke parinibbutā’’ti. catutthaṃ;",
      "english": "Monks, I shall teach you the near shore and the far shore. Listen to that and pay close attention; I will speak. And what, monks, is the near shore, and what is the far shore? The destruction of life, monks, is the near shore; abstaining from the destruction of life is the far shore. Taking what is not given is the near shore; abstaining from taking what is not given is the far shore. Sexual misconduct is the near shore; abstaining from sexual misconduct is the far shore. False speech is the near shore; abstaining from false speech is the far shore. Slanderous speech is the near shore; abstaining from slanderous speech is the far shore. Harsh speech is the near shore; abstaining from harsh speech is the far shore. Frivolous talk is the near shore; abstaining from frivolous talk is the far shore. Covetousness is the near shore; non-covetousness is the far shore. Ill will is the near shore; non-ill will is the far shore. Wrong view is the near shore; right view is the far shore. This, monks, is the near shore, and this is the far shore.\n\nFew among humankind are those who cross over to the far shore; while the rest of this populace merely runs along this shore.\n\nBut those who rightly practice the Dhamma, which has been well-proclaimed, those individuals will reach the far shore, overcoming the realm of death, so difficult to cross.\n\nHaving abandoned the dark state, let the wise one cultivate the bright state. Having come from the household life to the state of homelessness, let them dwell in solitude, where delight is hard to find.\n\nTherein let them seek delight, having abandoned sensual pleasures, without possessions. Let the wise one purify themselves from mental defilements.\n\nThose whose minds are well-developed in the factors of awakening, who delight in relinquishing all attachments, free from clinging—those, with their taints destroyed and shining brightly, are fully liberated in the world.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ මෙතෙර සහ එතෙර මම දේශනා කරන්නෙමි. එයට සවන් දෙන්න, මනසිකාරය යොමු කරන්න. භික්ෂූන් වහන්ස, මෙතෙර යනු කවරේද, එතෙර යනු කවරේද? භික්ෂූන් වහන්ස, ප්‍රාණඝාතය මෙතෙරයි. ප්‍රාණඝාතයෙන් වැළකීම එතෙරයි. අදින්නාදානය මෙතෙරයි. අදින්නාදානයෙන් වැළකීම එතෙරයි. කාමයන්හි වරදවා හැසිරීම මෙතෙරයි. කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම එතෙරයි. මුසාවාදය මෙතෙරයි. මුසාවාදයෙන් වැළකීම එතෙරයි. පිසුණා වචනය මෙතෙරයි. පිසුණා වචනයෙන් වැළකීම එතෙරයි. ඵරුෂා වචනය මෙතෙරයි. ඵරුෂා වචනයෙන් වැළකීම එතෙරයි. සම්ඵප්පලාපය මෙතෙරයි. සම්ඵප්පලාපයෙන් වැළකීම එතෙරයි. අභිජ්ඣාව මෙතෙරයි. අනභිජ්ඣාව එතෙරයි. ව්‍යාපාදය මෙතෙරයි. අව්‍යාපාදය එතෙරයි. මිත්‍යාදෘෂ්ටිය මෙතෙරයි. සම්මාදිට්ඨිය එතෙරයි. භික්ෂූන් වහන්ස, මෙය මෙතෙරයි, මෙය එතෙරයි.\n\nමිනිසුන් අතරින් එතෙරට යන ජනයා ස්වල්පයකි. මේ අනෙක් පිරිස මෙතෙරම හඹා යයි.\n\nයම් යම් පුද්ගලයෝ මැනවින් දේශනා කරන ලද ධර්මය අනුව හැසිරෙත්ද, ඒ ජනයා ඉතා දුරිතර වූ මාර රාජ්‍යය ඉක්මවා එතෙරට යන්නාහ.\n\nනුවණැත්තා අකුසල ධර්ම දුරු කොට, කුසල ධර්ම වඩන්නේය. ගිහි ආලයන් අත්හැර, කිසිවක් කෙරෙහි ඇලීමක් නැති බවට පැමිණ, යම් තැනක (නිර්වාණයේ) හුදෙකලා බවම ඉතා ප්‍රීතිමත් වේද,\n\nකිසිවක් කෙලෙස් වශයෙන් තමා සතු නැත්තෙක් වී, කාමයන් අත්හැර, එහි ඇල්ම උපදවන්නේය. නුවණැත්තා තමාගේ සිත, චිත්තක්ලේශයන්ගෙන් පිරිසිදු කරන්නේය.\n\nයම් පුද්ගලයන්ගේ සිත සප්ත බොජ්ඣංගයන්හි මැනවින් වඩන ලදද, යම් අය උපාදාන රහිතව අල්ලා ගැනීම අත්හැරීමෙහි සතුටු වෙත්ද, ක්ෂීණාශ්‍රව වූ, තේජවන්ත වූ ඒ අය, මේ ලෝකයෙහි පිරිනිවන් පෑවෝය.",
      "paliTitle": "Orimasuttaṃ",
      "englishTitle": "The Near Shore Discourse",
      "sinhalaTitle": "මෙපිට සූත්‍රය"
    },
    {
      "number": 171,
      "pali": "[a. ni. 10.113] ‘‘Adhammo ca, bhikkhave, veditabbo anattho ca; dhammo ca veditabbo attho ca. Adhammañca viditvā anatthañca, dhammañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabbaṃ. ‘‘Katamo ca, bhikkhave, adhammo ca anattho ca? Pāṇātipāto, adinnādānaṃ, kāmesumicchācāro, musāvādo, pisuṇā vācā, pharusā vācā, samphappalāpo, abhijjhā, byāpādo, micchādiṭṭhi – ayaṃ vuccati, bhikkhave, adhammo ca anattho ca. ‘‘Katamo ca, bhikkhave, dhammo ca attho ca? Pāṇātipātā veramaṇī, adinnādānā veramaṇī, kāmesumicchācārā veramaṇī, musāvādā veramaṇī, pisuṇāya vācāya veramaṇī, pharusāya vācāya veramaṇī, samphappalāpā veramaṇī, anabhijjhā, abyāpādo, sammādiṭṭhi – ayaṃ vuccati, bhikkhave, dhammo ca attho ca. ‘‘‘Adhammo ca, bhikkhave, veditabbo anattho ca; dhammo ca veditabbo attho ca. Adhammañca viditvā anatthañca, dhammañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Pañcamaṃ.",
      "english": "Monks, unwholesome conduct is to be understood as being without spiritual benefit, and wholesome conduct is to be understood as being spiritually beneficial. Having understood unwholesome conduct as being without spiritual benefit and wholesome conduct as being spiritually beneficial, one should practice in accordance with wholesome conduct and what is spiritually beneficial.\n\nAnd what, monks, is unwholesome conduct and without spiritual benefit? It is the taking of life, taking what is not given, sexual misconduct, false speech, divisive speech, harsh speech, idle chatter, covetousness, ill-will, and wrong view. This, monks, is called unwholesome conduct and that which is without spiritual benefit.\n\nAnd what, monks, is wholesome conduct and spiritually beneficial? It is abstention from taking life, abstention from taking what is not given, abstention from sexual misconduct, abstention from false speech, abstention from divisive speech, abstention from harsh speech, abstention from idle chatter, non-covetousness, non-ill-will, and right view. This, monks, is called wholesome conduct and that which is spiritually beneficial.\n\nWhen it was said: ‘Monks, unwholesome conduct is to be understood as being without spiritual benefit, and wholesome conduct is to be understood as being spiritually beneficial. Having understood unwholesome conduct as being without spiritual benefit and wholesome conduct as being spiritually beneficial, one should practice in accordance with wholesome conduct and what is spiritually beneficial’ – it was said with reference to this.",
      "sinhala": "මහණෙනි, අධර්මයද අහිතද දැනගත යුතුය. ධර්මයද අර්ථයද දැනගත යුතුය. අධර්මය හා අහිත දැන, ධර්මය හා අර්ථය දැන, ධර්මානුකූලව, අර්ථය අනුකූලව එලෙසම පිළිපැදිය යුතුය.\n\nමහණෙනි, අධර්මය හා අහිත යනු කවරේද? ප්‍රාණඝාතය, අදත්තාදානය, කාමයන්හි මිථ්‍යාචාරය, මුසාවාදය, පිසුණු වචනය, ඵරුෂ වචනය, සම්ඵප්ප්‍රලාපය, අභිධ්‍යාව, ව්‍යාපාදය, මිථ්‍යාදෘෂ්ටිය – මහණෙනි, මේ අධර්මය හා අහිත යැයි කියනු ලැබේ.\n\nමහණෙනි, ධර්මය හා අර්ථය යනු කවරේද? ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමයන්හි මිථ්‍යාචාරයෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, පිසුණු වචනයෙන් වැළකීම, ඵරුෂ වචනයෙන් වැළකීම, සම්ඵප්ප්‍රලාපයෙන් වැළකීම, අනභිධ්‍යාව, අව්‍යාපාදය, සම්මාදිට්ඨිය – මහණෙනි, මේ ධර්මය හා අර්ථය යැයි කියනු ලැබේ.\n\n‘මහණෙනි, අධර්මයද අහිතද දැනගත යුතුය. ධර්මයද අර්ථයද දැනගත යුතුය. අධර්මය හා අහිත දැන, ධර්මය හා අර්ථය දැන, ධර්මානුකූලව, අර්ථය අනුකූලව එලෙසම පිළිපැදිය යුතුය.’ යම් මේ කරුණක් කියන ලද්දේද, එය මෙපමණකට අරභයා කියන ලද්දකි.",
      "paliTitle": "Paṭhamaadhammasuttaṃ",
      "englishTitle": "First Discourse on Unwholesome Matters",
      "sinhalaTitle": "පළමු අධර්‍ම සූත්‍රය"
    },
    {
      "number": 172,
      "pali": "‘‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi. Atha kho tesaṃ bhikkhūnaṃ acirapakkantassa bhagavato etadahosi – ‘‘idaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti. Ko nu kho imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajeyyā’’ti? Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ kho āyasmā mahākaccāno satthu ceva saṃvaṇṇito, sambhāvito ca viññūnaṃ sabrahmacārīnaṃ. Pahoti cāyasmā mahākaccāno imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajituṃ. Yaṃnūna mayaṃ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṃ mahākaccānaṃ etamatthaṃ puccheyyāma. Yathā no āyasmā mahākaccāno byākarissati tathā naṃ dhāressāmā’’ti. Atha kho te bhikkhū yenāyasmā mahākaccāno tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā mahākaccānena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū āyasmantaṃ mahākaccānaṃ etadavocuṃ – ‘‘Idaṃ kho no, āvuso kaccāna, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti. ‘‘Tesaṃ no, āvuso, amhākaṃ acirapakkantassa bhagavato etadahosi – ‘idaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – adhammo ca, bhikkhave…pe… tathā paṭipajjitabbanti. Ko nu kho imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajeyyā’ti? ‘‘Tesaṃ no, āvuso, amhākaṃ etadahosi – ‘ayaṃ kho āyasmā mahākaccāno satthu ceva saṃvaṇṇito, sambhāvito ca viññūnaṃ sabrahmacārīnaṃ. Pahoti cāyasmā mahākaccāno imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajituṃ. Yaṃnūna mayaṃ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṃ mahākaccānaṃ etamatthaṃ paṭipuccheyyāma. Yathā no āyasmā mahākaccāno byākarissati tathā naṃ dhāressāmā’ti. Vibhajatu āyasmā mahākaccāno’’ti. ‘‘Seyyathāpi, āvuso, puriso sāratthiko sāraṃ gavesī sārapariyesanaṃ caramāno mahato rukkhassa tiṭṭhato sāravato atikkammeva mūlaṃ atikkamma khandhaṃ sākhāpalāse sāraṃ pariyesitabbaṃ maññeyya. Evaṃsampadamidaṃ āyasmantānaṃ satthari sammukhībhūte taṃ bhagavantaṃ atisitvā amhe etamatthaṃ paṭipucchitabbaṃ maññatha [maññetha (sī.), maññeyyātha (ka.)]. So hāvuso, bhagavā jānaṃ jānāti passaṃ passati cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. So ceva panetassa kālo ahosi yaṃ tumhe bhagavantaṃyeva upasaṅkamitvā etamatthaṃ paṭipuccheyyātha. Yathā vo bhagavā byākareyya tathā naṃ dhāreyyāthā’’ti. ‘‘Addhā, āvuso kaccāna, bhagavā jānaṃ jānāti passaṃ passati cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. So ceva panetassa kālo ahosi yaṃ mayaṃ bhagavantaṃyeva upasaṅkamitvā etamatthaṃ paṭipuccheyyāma. Yathā no bhagavā byākareyya tathā naṃ dhāreyyāma. Api cāyasmā mahākaccāno satthu ceva saṃvaṇṇito, sambhāvito ca viññūnaṃ sabrahmacārīnaṃ. Pahoti cāyasmā mahākaccāno imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajituṃ. Vibhajatāyasmā mahākaccāno agaruṃ karitvā’’ti. ‘‘Tena hāvuso, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, āvuso’’ti kho te bhikkhū āyasmato mahākaccānassa paccassosuṃ. Athāyasmā mahākaccāno etadavoca – ‘‘Yaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo…pe… tathā paṭipajjitabba’nti. ‘‘Katamo, cāvuso, adhammo; katamo ca dhammo? Katamo ca anattho, katamo ca attho? ‘‘Pāṇātipāto, āvuso, adhammo; pāṇātipātā veramaṇī dhammo; ye ca pāṇātipātapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; pāṇātipātā veramaṇipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Adinnādānaṃ, āvuso, adhammo; adinnādānā veramaṇī dhammo; ye ca adinnādānapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; adinnādānā veramaṇipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Kāmesumicchācāro, āvuso, adhammo; kāmesumicchācārā veramaṇī dhammo; ye ca kāmesumicchācārapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; kāmesumicchācārā veramaṇipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Musāvādo, āvuso, adhammo; musāvādā veramaṇī dhammo; ye ca musāvādapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; musāvādā veramaṇipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Pisuṇā vācā, āvuso, adhammo; pisuṇāya vācāya veramaṇī dhammo; ye ca pisuṇāvācāpaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; pisuṇāya vācāya veramaṇipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Pharusā vācā, āvuso, adhammo; pharusāya vācāya veramaṇī dhammo; ye ca pharusāvācāpaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; pharusāya vācāya veramaṇipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Samphappalāpo, āvuso, adhammo; samphappalāpā veramaṇī dhammo; ye ca samphappalāpapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; samphappalāpā veramaṇipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Abhijjhā, āvuso, adhammo; anabhijjhā dhammo; ye ca abhijjhāpaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; anabhijjhāpaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Byāpādo, āvuso, adhammo; abyāpādo dhammo; ye ca byāpādapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; abyāpādapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchādiṭṭhi, āvuso, adhammo; sammādiṭṭhi dhammo; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘‘Yaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – adhammo ca, bhikkhave, veditabbo…pe… tathā paṭipajjitabba’nti. Imassa kho ahaṃ, āvuso, bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa evaṃ vitthārena atthaṃ ājānāmi. Ākaṅkhamānā ca pana tumhe, āvuso, bhagavantaṃyeva upasaṅkamitvā etamatthaṃ paṭipuccheyyātha. Yathā no bhagavā byākaroti tathā naṃ dhāreyyāthā’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū āyasmato mahākaccānassa bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘Yaṃ kho no, bhante, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo…pe… tathā paṭipajjitabba’nti. ‘‘Tesaṃ no, bhante, amhākaṃ acirapakkantassa bhagavato etadahosi – ‘idaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo…pe… tathā paṭipajjitabba’nti. Ko nu kho imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajeyyā’ti? ‘‘Tesaṃ no, bhante, amhākaṃ etadahosi – ‘ayaṃ kho āyasmā mahākaccāno satthu ceva saṃvaṇṇito, sambhāvito ca viññūnaṃ sabrahmacārīnaṃ. Pahoti cāyasmā mahākaccāno imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajituṃ. Yaṃnūna mayaṃ yenāyasmā mahākaccāno tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṃ mahākaccānaṃ etamatthaṃ paṭipuccheyyāma. Yathā no āyasmā mahākaccāno byākarissati tathā naṃ dhāressāmā’ti. ‘‘Atha kho mayaṃ, bhante, yenāyasmā mahākaccāno tenupasaṅkamimhā; upasaṅkamitvā āyasmantaṃ mahākaccānaṃ etamatthaṃ apucchimhā. Tesaṃ no, bhante, āyasmatā mahākaccānena imehi akkharehi imehi padehi imehi byañjanehi attho suvibhatto’’ti. ‘‘Sādhu sādhu, bhikkhave! Paṇḍito, bhikkhave, mahākaccāno. Mahāpañño, bhikkhave, mahākaccāno. Maṃ cepi tumhe, bhikkhave, upasaṅkamitvā etamatthaṃ paṭipuccheyyātha, ahampi cetaṃ evamevaṃ byākareyyaṃ yathā taṃ mahākaccānena byākataṃ. Eso ceva tassa attho. Evañca naṃ dhāreyyāthā’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, what is unwholesome and what is wholesome should be understood; what is not beneficial and what is beneficial should be understood. Having understood the unwholesome and the wholesome, and having understood what is not beneficial and what is beneficial, one should practice accordingly, in harmony with the wholesome and the beneficial.” The Blessed One said this. Having said this, the Fortunate One rose from his seat and entered the monastery.\n\nThen, shortly after the Blessed One had departed, this thought arose in those monks: “Friends, the Blessed One has given us this brief statement without elaborating on its meaning, and has risen from his seat and entered the monastery: ‘Monks, what is unwholesome and what is wholesome should be understood; what is not beneficial and what is beneficial should be understood. Having understood the unwholesome and the wholesome, and having understood what is not beneficial and what is beneficial, one should practice accordingly, in harmony with the wholesome and the beneficial.’ Now, who might elaborate on the meaning of this brief statement given by the Blessed One, the meaning of which has not been expounded upon?”\n\nThen this thought occurred to those monks: “Indeed, the venerable Mahākaccāna is praised by the Teacher and held in high regard by discerning fellow practitioners. The venerable Mahākaccāna is capable of elaborating on the meaning of this brief statement given by the Blessed One, the meaning of which has not been expounded upon. What if we were to go to the venerable Mahākaccāna, and having approached him, ask him about this matter? We will remember it just as the venerable Mahākaccāna explains it to us.”\n\nThen those monks approached the venerable Mahākaccāna. Having approached, they exchanged friendly greetings with the venerable Mahākaccāna. After exchanging courteous and memorable talk, they sat down to one side. Seated to one side, those monks said to the venerable Mahākaccāna: “Friends Kaccāna, the Blessed One gave us this brief statement without elaborating on its meaning, and has risen from his seat and entered the monastery: ‘Monks, what is unwholesome and what is wholesome should be understood; what is not beneficial and what is beneficial should be understood. Having understood the unwholesome and the wholesome, and having understood what is not beneficial and what is beneficial, one should practice accordingly, in harmony with the wholesome and the beneficial.’\n\n“Then, friends, shortly after the Blessed One had departed, this thought arose in us: ‘Friends, the Blessed One has given us this brief statement without elaborating on its meaning, and has risen from his seat and entered the monastery: \"Monks, what is unwholesome...\" up to \"...one should practice accordingly.\" Now, who might elaborate on the meaning of this brief statement given by the Blessed One, the meaning of which has not been expounded upon?’\n\n“Then, friends, this thought occurred to us: ‘Indeed, the venerable Mahākaccāna is praised by the Teacher and held in high regard by discerning fellow practitioners. The venerable Mahākaccāna is capable of elaborating on the meaning of this brief statement given by the Blessed One, the meaning of which has not been expounded upon. What if we were to go to the venerable Mahākaccāna, and having approached him, ask him about this matter? We will remember it just as the venerable Mahākaccāna explains it to us.’ May the venerable Mahākaccāna elaborate for us.”\n\n“Friends, it is as if a man in need of heartwood, seeking heartwood, searching for heartwood, were to overlook the root of a great standing tree containing heartwood, and overlook its trunk, yet think that the heartwood is to be sought among its branches and leaves. Just so, you venerable ones, having overlooked the Blessed One, who is right before you as the Teacher, think that you should ask us about this matter. Friends, the Blessed One knows what he knows and sees what he sees; he is the eye, the knowledge, the Dharma, the Brahma, the proclaimer, the expounder, the bringer of meaning, the bestower of the deathless, the master of the Dharma, the Tathāgata. It was indeed the proper time for you to approach the Blessed One himself and ask him about this matter. You would have remembered it just as the Blessed One explained it to you.”\n\n“Indeed, friends Kaccāna, the Blessed One knows what he knows and sees what he sees; he is the eye, the knowledge, the Dharma, the Brahma, the proclaimer, the expounder, the bringer of meaning, the bestower of the deathless, the master of the Dharma, the Tathāgata. It was indeed the proper time for us to approach the Blessed One himself and ask him about this matter. We would have remembered it just as the Blessed One explained it to us. Nevertheless, the venerable Mahākaccāna is praised by the Teacher and held in high regard by discerning fellow practitioners. The venerable Mahākaccāna is capable of elaborating on the meaning of this brief statement given by the Blessed One, the meaning of which has not been expounded upon. May the venerable Mahākaccāna elaborate without reluctance.”\n\n“Therefore, friends, listen and pay close attention; I will speak.”\n\n\"Yes, friend,\" those bhikkhus replied to Venerable Mahākaccāna.\n\nThen Venerable Mahākaccāna said this: \"Friends, the Blessed One gave a summary instruction without elaborating on its meaning, then rose from his seat and entered the dwelling, saying: 'Monks, what is unwholesome must be understood, and what is wholesome must be understood; what is detrimental must be understood, and what is beneficial must be understood; the abandoning of the unwholesome must be understood, and the cultivation of the wholesome must be understood; the abandoning of the detrimental must be understood, and the practice of the beneficial must be understood. The unwholesome should be abandoned, the wholesome should be cultivated; the detrimental should be abandoned, the beneficial should be practiced.'\n\n\"Friends, what is unwholesome, and what is wholesome? What is detrimental, and what is beneficial?\n\n\"Friends, taking life is unwholesome; abstaining from taking life is wholesome. And the many evil, unwholesome states that arise conditioned by taking life – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by abstaining from taking life – this is beneficial.\n\n\"Friends, taking what is not given is unwholesome; abstaining from taking what is not given is wholesome. And the many evil, unwholesome states that arise conditioned by taking what is not given – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by abstaining from taking what is not given – this is beneficial.\n\n\"Friends, sexual misconduct is unwholesome; abstaining from sexual misconduct is wholesome. And the many evil, unwholesome states that arise conditioned by sexual misconduct – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by abstaining from sexual misconduct – this is beneficial.\n\n\"Friends, false speech is unwholesome; abstaining from false speech is wholesome. And the many evil, unwholesome states that arise conditioned by false speech – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by abstaining from false speech – this is beneficial.\n\n\"Friends, slanderous speech is unwholesome; abstaining from slanderous speech is wholesome. And the many evil, unwholesome states that arise conditioned by slanderous speech – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by abstaining from slanderous speech – this is beneficial.\n\n\"Friends, harsh speech is unwholesome; abstaining from harsh speech is wholesome. And the many evil, unwholesome states that arise conditioned by harsh speech – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by abstaining from harsh speech – this is beneficial.\n\n\"Friends, frivolous speech is unwholesome; abstaining from frivolous speech is wholesome. And the many evil, unwholesome states that arise conditioned by frivolous speech – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by abstaining from frivolous speech – this is beneficial.\n\n\"Friends, covetousness is unwholesome; non-covetousness is wholesome. And the many evil, unwholesome states that arise conditioned by covetousness – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by non-covetousness – this is beneficial.\n\n\"Friends, ill will is unwholesome; non-ill will is wholesome. And the many evil, unwholesome states that arise conditioned by ill will – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by non-ill will – this is beneficial.\n\n\"Friends, wrong view is unwholesome; right view is wholesome. And the many evil, unwholesome states that arise conditioned by wrong view – this is detrimental. And the many wholesome states that come to full development through cultivation, conditioned by right view – this is beneficial.\n\n\"Friends, concerning what the Blessed One gave a summary instruction without elaborating on its meaning, then rose from his seat and entered the dwelling, saying: 'Monks, what is unwholesome must be understood, and what is wholesome must be understood; what is detrimental must be understood, and what is beneficial must be understood; the abandoning of the unwholesome must be understood, and the cultivation of the wholesome must be understood; the abandoning of the detrimental must be understood, and the practice of the beneficial must be understood. The unwholesome should be abandoned, the wholesome should be cultivated; the detrimental should be abandoned, the beneficial should be practiced.' This is how I understand in detail the meaning of this summary instruction given by the Blessed One, which was not elaborated upon by him. However, friends, if you wish, you may approach the Blessed One himself and question him about this matter. Whatever the Blessed One explains to you, you should bear it in mind accordingly.\"\n\n\"Yes, friend,\" those bhikkhus, having approved and rejoiced in Venerable Mahākaccāna's words, rose from their seats and approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side. Sitting to one side, those bhikkhus said this to the Blessed One: \"Venerable Sir, concerning what the Blessed One gave a summary instruction without elaborating on its meaning, then rose from his seat and entered the dwelling, saying: 'Monks, what is unwholesome must be understood, and what is wholesome must be understood; what is detrimental must be understood, and what is beneficial must be understood; the abandoning of the unwholesome must be understood, and the cultivation of the wholesome must be understood; the abandoning of the detrimental must be understood, and the practice of the beneficial must be understood. The unwholesome should be abandoned, the wholesome should be cultivated; the detrimental should be abandoned, the beneficial should be practiced.'\n\n\"Venerable Sir, after the Blessed One had departed not long ago, it occurred to us: 'The Blessed One gave a summary instruction without elaborating on its meaning, then rose from his seat and entered the dwelling, saying: \"Monks, what is unwholesome must be understood, and what is wholesome must be understood; what is detrimental must be understood, and what is beneficial must be understood; the abandoning of the unwholesome must be understood, and the cultivation of the wholesome must be understood; the abandoning of the detrimental must be understood, and the practice of the beneficial must be understood. The unwholesome should be abandoned, the wholesome should be cultivated; the detrimental should be abandoned, the beneficial should be practiced.\" Who, then, could elaborate in detail on the meaning of this summary instruction given by the Blessed One, which was not elaborated upon by him?'\n\n“Venerable sir, it occurred to us: ‘Indeed, this Venerable Mahākaccāna has been praised by the Teacher himself, and is esteemed by discerning spiritual companions. And Venerable Mahākaccāna is capable of expounding in detail the meaning of this brief statement given by the Blessed One, of analyzing in detail the meaning of what has not been explicitly differentiated. Why don’t we approach Venerable Mahākaccāna? Having approached him, we could ask Venerable Mahākaccāna about this matter. As Venerable Mahākaccāna explains it to us, so shall we remember it.’\n\n“Then, venerable sir, we approached Venerable Mahākaccāna; having approached him, we asked Venerable Mahākaccāna about this matter. To us, venerable sir, Venerable Mahākaccāna thoroughly expounded the meaning with these very letters, with these very words, with these very expressions.” “Excellent, excellent, bhikkhus! Bhikkhus, Mahākaccāna is wise. Bhikkhus, Mahākaccāna has great wisdom. Even if you, bhikkhus, were to approach me and ask about this matter, I too would explain it in exactly the same way as it was explained by Mahākaccāna. That is indeed its meaning. And in this way, you should bear it in mind.”",
      "sinhala": "‘‘මහණෙනි, අධර්මයත් දැනගත යුතුය, ධර්මයත් දැනගත යුතුය. අනර්ථයත් දැනගත යුතුය, අර්ථයත් දැනගත යුතුය. අධර්මය සහ ධර්මයත්, අනර්ථය සහ අර්ථයත් මෙසේ දැනගෙන, ධර්මයට අනුවත් අර්ථයට අනුවත් පිළිපැදිය යුතුය’’ යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. මේ වචන වදාරා, සුගතයන් වහන්සේ හුන් අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක.\n\nඑවිට භාග්‍යවතුන් වහන්සේ වැඩම කළ පසු වැඩි කලක් ගත නොවනතාක්, ඒ භික්ෂූන්ට මෙසේ සිතුණේය – ‘‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ සංක්ෂිප්තයෙන් කරුණක් දේශනා කොට, විස්තර වශයෙන් එහි අර්ථය නොවිග්‍රහ කොට, හුන් අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක. ‘මහණෙනි, අධර්මයත් දැනගත යුතුය, ධර්මයත් දැනගත යුතුය; අනර්ථයත් දැනගත යුතුය, අර්ථයත් දැනගත යුතුය. අධර්මය සහ ධර්මයත්, අනර්ථය සහ අර්ථයත් මෙසේ දැනගෙන, ධර්මයට අනුවත් අර්ථයට අනුවත් පිළිපැදිය යුතුය’ යනු ඒ දේශනාවයි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තර වශයෙන් අර්ථය නොවිග්‍රහ කරන ලද මේ දේශනාවේ අර්ථය විස්තර වශයෙන් කවුරුන් විග්‍රහ කරන්නේද?’’\n\nඑවිට ඒ භික්ෂූන්ට මෙසේ සිතුණේය – ‘‘මේ ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ ශාස්තෘන් වහන්සේ විසින් වර්ණනා කරන ලද්දකි. විඥානවන්ත බ්‍රහ්මචාරීන් අතරද ගරු කටයුත්තකි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තර වශයෙන් අර්ථය නොවිග්‍රහ කරන ලද මේ දේශනාවේ අර්ථය විස්තර වශයෙන් විග්‍රහ කිරීමට ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේට හැකියාවක් ඇත. අපි යම් හෙයකින් ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ වෙතට උපසංක්‍රමණය කරන්නේ නම්, උපසංක්‍රමණය කොට ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේගෙන් මේ කරුණ විමසන්නේ නම්, ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ අපට යම් අයුරකින් විස්තර කරන්නේද, ඒ අයුරින් එය ධාරණය කරගනිමු.’’\n\nඑවිට ඒ භික්ෂූහු යම් තැනක ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ වැඩසිටියේද, ඒ තැනට උපසංක්‍රමණය කළහ. උපසංක්‍රමණය කොට ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ සමඟ ප්‍රිය සම්භාෂණය කළහ. සතුටු විය යුතු, සිහි කටයුතු කථා බහ නිමවා, එකත්පසෙක වාඩි වූහ. එකත්පසෙක වාඩි වී සිටි ඒ භික්ෂූහු ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේට මෙසේ කීහ – ‘‘ඇවැත් කච්චාන, භාග්‍යවතුන් වහන්සේ අපට සංක්ෂිප්තයෙන් කරුණක් දේශනා කොට, විස්තර වශයෙන් එහි අර්ථය නොවිග්‍රහ කොට, හුන් අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක. ‘මහණෙනි, අධර්මයත් දැනගත යුතුය, ධර්මයත් දැනගත යුතුය; අනර්ථයත් දැනගත යුතුය, අර්ථයත් දැනගත යුතුය. අධර්මය සහ ධර්මයත්, අනර්ථය සහ අර්ථයත් මෙසේ දැනගෙන, ධර්මයට අනුවත් අර්ථයට අනුවත් පිළිපැදිය යුතුය’ යනු ඒ දේශනාවයි.\n\n‘‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ වැඩි කලක් ගත නොවනතාක් වැඩම කළ පසු, අපට මෙසේ සිතුණේය – ‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ සංක්ෂිප්තයෙන් කරුණක් දේශනා කොට, විස්තර වශයෙන් එහි අර්ථය නොවිග්‍රහ කොට, හුන් අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක. ‘මහණෙනි, අධර්මයත් දැනගත යුතුය, ධර්මයත් දැනගත යුතුය; අනර්ථයත් දැනගත යුතුය, අර්ථයත් දැනගත යුතුය. අධර්මය සහ ධර්මයත්, අනර්ථය සහ අර්ථයත් මෙසේ දැනගෙන, ධර්මයට අනුවත් අර්ථයට අනුවත් පිළිපැදිය යුතුය’ යනු ඒ දේශනාවයි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තර වශයෙන් අර්ථය නොවිග්‍රහ කරන ලද මේ දේශනාවේ අර්ථය විස්තර වශයෙන් කවුරුන් විග්‍රහ කරන්නේද?’ යනුයි.\n\n‘‘ඇවැත්නි, අපට මෙසේ සිතුණේය – ‘මේ ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ ශාස්තෘන් වහන්සේ විසින් වර්ණනා කරන ලද්දකි. විඥානවන්ත බ්‍රහ්මචාරීන් අතරද ගරු කටයුත්තකි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තර වශයෙන් අර්ථය නොවිග්‍රහ කරන ලද මේ දේශනාවේ අර්ථය විස්තර වශයෙන් විග්‍රහ කිරීමට ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේට හැකියාවක් ඇත. අපි යම් හෙයකින් ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ වෙතට උපසංක්‍රමණය කරන්නේ නම්, උපසංක්‍රමණය කොට ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේගෙන් මේ කරුණ විමසන්නේ නම්, ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ අපට යම් අයුරකින් විස්තර කරන්නේද, ඒ අයුරින් එය ධාරණය කරගනිමු’ යනුයි. ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ කරුණාකර විග්‍රහ කරන සේක්වා!’’\n\n‘‘ඇවැත්නි, යම් සේ නම්, සාරය සොයන, සාරය අපේක්ෂා කරන, සාරය ගවේෂණය කරමින් යන පුරුෂයෙක් සාරවත් මහ රුකක මුලද අත්හැර, කඳද අත්හැර, අතුපතර හා පත්‍ර අතර සාරය සොයාගත යුතුයැයි සිතන්නේද; ඒ හා සමාන මේ කාරණයයි, ඔබ වහන්සේලා ශාස්තෘන් වහන්සේ සමීපයේ වැඩසිටියදී, ඒ භාග්‍යවතුන් වහන්සේ අත්හැර, අපගෙන් මේ කරුණ විමසිය යුතුයැයි සිතති. ඇවැත්නි, ඒ භාග්‍යවතුන් වහන්සේ නම්, දන්නා දෙයම දනිති, දකින දෙයම දකිති. උන්වහන්සේ චක්ෂු භූත වූ සේක, ඥාන භූත වූ සේක, ධර්ම භූත වූ සේක, බ්‍රහ්ම භූත වූ සේක. උන්වහන්සේ ධර්මය වදාරන්නාහ, පවත්වාගෙන යන්නාහ, අර්ථය ඉදිරිපත් කරන්නාහ, අමෘතය දානය කරන්නාහ, ධර්මයේ ස්වාමියා වන තථාගතයන් වහන්සේය. තවද, ඔබ වහන්සේලා භාග්‍යවතුන් වහන්සේ වෙතටම උපසංක්‍රමණය කොට මේ කරුණ විමසිය යුතු කාලය එය විය. භාග්‍යවතුන් වහන්සේ ඔබ වහන්සේලාට යම් අයුරකින් විස්තර කරන්නේද, ඒ අයුරින් එය ධාරණය කරගන්නවා ඇත.’’\n\n‘‘නියත වශයෙන්ම, ඇවැත් කච්චාන, භාග්‍යවතුන් වහන්සේ නම්, දන්නා දෙයම දනිති, දකින දෙයම දකිති. උන්වහන්සේ චක්ෂු භූත වූ සේක, ඥාන භූත වූ සේක, ධර්ම භූත වූ සේක, බ්‍රහ්ම භූත වූ සේක. උන්වහන්සේ ධර්මය වදාරන්නාහ, පවත්වාගෙන යන්නාහ, අර්ථය ඉදිරිපත් කරන්නාහ, අමෘතය දානය කරන්නාහ, ධර්මයේ ස්වාමියා වන තථාගතයන් වහන්සේය. තවද, භාග්‍යවතුන් වහන්සේ වෙතටම උපසංක්‍රමණය කොට මේ කරුණ විමසිය යුතු කාලය එය විය. භාග්‍යවතුන් වහන්සේ අපට යම් අයුරකින් විස්තර කරන්නේද, ඒ අයුරින් එය ධාරණය කරගනිමු. එසේ වුවද, ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ ශාස්තෘන් වහන්සේ විසින් වර්ණනා කරන ලද්දකි. විඥානවන්ත බ්‍රහ්මචාරීන් අතරද ගරු කටයුත්තකි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තර වශයෙන් අර්ථය නොවිග්‍රහ කරන ලද මේ දේශනාවේ අර්ථය විස්තර වශයෙන් විග්‍රහ කිරීමට ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේට හැකියාවක් ඇත. එබැවින්, ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ අපහසුවක් නොසලකා විග්‍රහ කරන සේක්වා!’’\n\n‘‘එසේ නම්, ඇවැත්නි, අසන්න, මනාව මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි’’යි.\n\n\"ආයුෂ්මත්නි, එසේයැ\"යි එම භික්ෂූහු ආයුෂ්මත් මහාකච්චාන තෙරුන්ට පිළිතුරු දුන්හ. එවිට ආයුෂ්මත් මහාකච්චාන තෙරණුවෝ මෙසේ පැවසූහ: \"ආයුෂ්මත්නි, භාග්‍යවතුන් වහන්සේ 'මහණෙනි, අධර්මයද දැනගත යුතුයි... එසේම පිළිපැදිය යුතුයි' යනුවෙන් සංක්ෂිප්තයෙන් දේශනාවක් දේශනා කොට, විස්තර වශයෙන් අර්ථය විග්‍රහ නොකොට, අසුනෙන් නැගී විහාරයට වැඩම කළ සේක.\n\n\"ආයුෂ්මත්නි, අධර්මය නම් කුමක්ද? ධර්මය නම් කුමක්ද? අනර්ථය නම් කුමක්ද? අර්ථය නම් කුමක්ද?\n\n\"ආයුෂ්මත්නි, ප්‍රාණඝාතය අධර්මයයි. ප්‍රාණඝාතයෙන් වැළකීම ධර්මයයි. ප්‍රාණඝාතය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. ප්‍රාණඝාතයෙන් වැළකීම හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, අදත්තාදානය අධර්මයයි. අදත්තාදානයෙන් වැළකීම ධර්මයයි. අදත්තාදානය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. අදත්තාදානයෙන් වැළකීම හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, කාමයන්හි මිථ්‍යාචාරය අධර්මයයි. කාමයන්හි මිථ්‍යාචාරයෙන් වැළකීම ධර්මයයි. කාමයන්හි මිථ්‍යාචාරය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. කාමයන්හි මිථ්‍යාචාරයෙන් වැළකීම හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, මුසාවාදය අධර්මයයි. මුසාවාදයෙන් වැළකීම ධර්මයයි. මුසාවාදය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. මුසාවාදයෙන් වැළකීම හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, පිසුනු වචනය අධර්මයයි. පිසුනු වචනයෙන් වැළකීම ධර්මයයි. පිසුනු වචනය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. පිසුනු වචනයෙන් වැළකීම හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, ඵරුෂ වචනය අධර්මයයි. ඵරුෂ වචනයෙන් වැළකීම ධර්මයයි. ඵරුෂ වචනය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. ඵරුෂ වචනයෙන් වැළකීම හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, සම්ඵප්පලාපය අධර්මයයි. සම්ඵප්පලාපයෙන් වැළකීම ධර්මයයි. සම්ඵප්පලාපය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. සම්ඵප්පලාපයෙන් වැළකීම හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, අභිධ්‍යාව (අනුන්ගේ දේට ආශා කිරීම) අධර්මයයි. අනාභිධ්‍යාව (අනුන්ගේ දේට ආශා නොකිරීම) ධර්මයයි. අභිධ්‍යාව හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. අනාභිධ්‍යාව හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, ව්‍යාපාදය (ද්වේෂය) අධර්මයයි. අව්‍යාපාදය (ද්වේෂ නොකිරීම) ධර්මයයි. ව්‍යාපාදය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. අව්‍යාපාදය හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, මිථ්‍යාදෘෂ්ටිය අධර්මයයි. සම්මාදිට්ඨිය ධර්මයයි. මිථ්‍යාදෘෂ්ටිය හේතුකොටගෙන යම් බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථයයි. සම්මාදිට්ඨිය හේතුකොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනාවේ පාරිපූරණත්වය කරා එළඹේද, මෙය අර්ථයයි.\n\n\"ආයුෂ්මත්නි, භාග්‍යවතුන් වහන්සේ 'මහණෙනි, අධර්මයද දැනගත යුතුයි... එසේම පිළිපැදිය යුතුයි' යනුවෙන් සංක්ෂිප්තයෙන් දේශනාවක් දේශනා කොට, විස්තර වශයෙන් අර්ථය විග්‍රහ නොකොට, අසුනෙන් නැගී විහාරයට වැඩම කළ සේක. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තර වශයෙන් නොදැක්වූ මේ අර්ථය මම මෙසේ විස්තර වශයෙන් දනිමි. ආයුෂ්මත්නි, ඔබලා කැමතිනම් භාග්‍යවතුන් වහන්සේ වෙතම ගොස් මේ අර්ථය විමසන්න. භාග්‍යවතුන් වහන්සේ යම් ආකාරයකින් විග්‍රහ කරන සේක්ද, එම ආකාරයෙන් එය ධාරණය කරගන්නැ\"යි (මහාකච්චාන තෙරණුවෝ පැවසූහ).\n\n\"ආයුෂ්මත්නි, එසේයැ\"යි එම භික්ෂූහු ආයුෂ්මත් මහාකච්චාන තෙරුන්ගේ වචනය අභිනන්දනය කොට, අනුමෝදන් වී, අසුනෙන් නැගී, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙකින් වාඩි වූහ. එකත්පසෙකින් වාඩි වී සිටි එම භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: \"වහන්ස, භාග්‍යවතුන් වහන්සේ 'මහණෙනි, අධර්මයද දැනගත යුතුයි... එසේම පිළිපැදිය යුතුයි' යනුවෙන් සංක්ෂිප්තයෙන් දේශනාවක් දේශනා කොට, විස්තර වශයෙන් අර්ථය විග්‍රහ නොකොට, අසුනෙන් නැගී විහාරයට වැඩම කළ සේක.\n\n\"වහන්ස, භාග්‍යවතුන් වහන්සේ වැඩමකොට වැඩි වෙලාවක් නොගොස් අපට මෙබඳු සිතක් පහළ විය: 'ආයුෂ්මත්නි, භාග්‍යවතුන් වහන්සේ 'මහණෙනි, අධර්මයද දැනගත යුතුයි... එසේම පිළිපැදිය යුතුයි' යනුවෙන් සංක්ෂිප්තයෙන් දේශනාවක් දේශනා කොට, විස්තර වශයෙන් අර්ථය විග්‍රහ නොකොට, අසුනෙන් නැගී විහාරයට වැඩම කළ සේක. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තර වශයෙන් නොදැක්වූ මේ අර්ථය කවරෙක් නම් විස්තර වශයෙන් විග්‍රහ කරන්නේදැ'යි.\"\n\nභාග්‍යවතුන් වහන්ස, අපට මෙසේ සිතුණි: ‘මේ ආයුෂ්ම​ත් මහාකච්චායන තෙරුන් වහන්සේ ශාස්තෲන් වහන්සේ විසින් ප්‍රශංසා කරන ලද, ප්‍රඥාවන්ත සබ්‍රහ්මචාරීන් විසින් ගෞරවයෙන් පිළිගන්නා ලද කෙනෙකි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ උපදේශයේ නොබෙදූ අර්ථය විස්තර වශයෙන් බෙදා වෙන් කිරීමට ආයුෂ්ම​ත් මහාකච්චායන තෙරුන් වහන්සේට හැකියාව ඇත. එසේනම් අපි ආයුෂ්ම​ත් මහාකච්චායන තෙරුන් වහන්සේ වෙතටම යමු; එතුමන් වෙත ගොස් මේ කාරණය විමසමු. ආයුෂ්ම​ත් මහාකච්චායන තෙරුන් වහන්සේ අපට කෙසේ විස්තර කරන්නේද, එලෙසින්ම අපි එය සිත්හි දරාගන්නෙමු’යි.\n\nභාග්‍යවතුන් වහන්ස, ඉන්පසු අපි ආයුෂ්ම​ත් මහාකච්චායන තෙරුන් වහන්සේ වෙතට ගියෙමු; එතුමන් වෙත ගොස් මේ කාරණය විමසුවෙමු. භාග්‍යවතුන් වහන්ස, ආයුෂ්ම​ත් මහාකච්චායන තෙරුන් වහන්සේ විසින් අපට මේ අකුරුවලින්, මේ පදවලින්, මේ ව්‍යංජනවලින් අර්ථය මැනවින් විභාග කොට දක්වන ලදී.\n\nමහණෙනි, ඉතා මැනවි, ඉතා මැනවි! මහණෙනි, මහාකච්චායන තෙරුන් වහන්සේ පණ්ඩිතයෙකි. මහණෙනි, මහාකච්චායන තෙරුන් වහන්සේ මහා ප්‍රඥාවන්තයෙකි. මහණෙනි, නුඹලා මා වෙත පැමිණ මේ කාරණය විමසුවා නම්, මහාකච්චායන තෙරුන් වහන්සේ විසින් විස්තර කරන ලද ආකාරයටම මමද එය විස්තර කරන්නෙමි. එහි අර්ථය එයමයි. එලෙසින්ම ඔබලා එය සිත්හි දරාගත යුතුයි.",
      "paliTitle": "Dutiyaadhammasuttaṃ",
      "englishTitle": "Second Sutta on Unrighteousness",
      "sinhalaTitle": "දෙවන අධ‍ර්ම සූත‍්‍රය"
    },
    {
      "number": 173,
      "pali": "‘‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabbaṃ. ‘‘Katamo ca, bhikkhave, adhammo, katamo ca dhammo; katamo ca anattho, katamo ca attho? Pāṇātipāto, bhikkhave, adhammo; pāṇātipātā veramaṇī dhammo; ye ca pāṇātipātapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; pāṇātipātā veramaṇipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Adinnādānaṃ, bhikkhave, adhammo; adinnādānā veramaṇī dhammo… kāmesumicchācāro, bhikkhave, adhammo; kāmesumicchācārā veramaṇī dhammo… musāvādo, bhikkhave, adhammo; musāvādā veramaṇī dhammo… pisuṇā vācā, bhikkhave, adhammo; pisuṇāya vācāya veramaṇī dhammo… pharusā vācā, bhikkhave, adhammo; pharusāya vācāya veramaṇī dhammo… samphappalāpo, bhikkhave, adhammo; samphappalāpā veramaṇī dhammo… abhijjhā, bhikkhave, adhammo; anabhijjhā dhammo… byāpādo, bhikkhave, adhammo; abyāpādo dhammo…. ‘‘Micchādiṭṭhi, bhikkhave, adhammo; sammādiṭṭhi dhammo; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Sattamaṃ.",
      "english": "Monastics, the unwholesome Dhamma is to be understood, and the wholesome Dhamma is to be understood; the disadvantage is to be understood, and the advantage is to be understood. Having understood the unwholesome Dhamma and the wholesome Dhamma, and having understood the disadvantage and the advantage, one should practice in accordance with the Dhamma and in accordance with what is beneficial.\n\nAnd what, monastics, is the unwholesome Dhamma, what is the wholesome Dhamma; what is the disadvantage, what is the advantage? Killing living beings, monastics, is the unwholesome Dhamma; abstinence from killing living beings is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by killing living beings—this is the disadvantage. And those many skillful states that, conditioned by abstinence from killing living beings, lead to the full development of cultivation—this is the advantage.\n\nTaking what is not given, monastics, is the unwholesome Dhamma; abstinence from taking what is not given is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by taking what is not given—this is the disadvantage. And those many skillful states that, conditioned by abstinence from taking what is not given, lead to the full development of cultivation—this is the advantage. Sexual misconduct, monastics, is the unwholesome Dhamma; abstinence from sexual misconduct is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by sexual misconduct—this is the disadvantage. And those many skillful states that, conditioned by abstinence from sexual misconduct, lead to the full development of cultivation—this is the advantage. False speech, monastics, is the unwholesome Dhamma; abstinence from false speech is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by false speech—this is the disadvantage. And those many skillful states that, conditioned by abstinence from false speech, lead to the full development of cultivation—this is the advantage. Slanderous speech, monastics, is the unwholesome Dhamma; abstinence from slanderous speech is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by slanderous speech—this is the disadvantage. And those many skillful states that, conditioned by abstinence from slanderous speech, lead to the full development of cultivation—this is the advantage. Harsh speech, monastics, is the unwholesome Dhamma; abstinence from harsh speech is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by harsh speech—this is the disadvantage. And those many skillful states that, conditioned by abstinence from harsh speech, lead to the full development of cultivation—this is the advantage. Frivolous talk, monastics, is the unwholesome Dhamma; abstinence from frivolous talk is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by frivolous talk—this is the disadvantage. And those many skillful states that, conditioned by abstinence from frivolous talk, lead to the full development of cultivation—this is the advantage. Covetousness, monastics, is the unwholesome Dhamma; non-covetousness is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by covetousness—this is the disadvantage. And those many skillful states that, conditioned by non-covetousness, lead to the full development of cultivation—this is the advantage. Ill-will, monastics, is the unwholesome Dhamma; non-ill-will is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by ill-will—this is the disadvantage. And those many skillful states that, conditioned by non-ill-will, lead to the full development of cultivation—this is the advantage.\n\nWrong view, monastics, is the unwholesome Dhamma; right view is the wholesome Dhamma. And those many evil, unskillful states that arise conditioned by wrong view—this is the disadvantage. And those many skillful states that, conditioned by right view, lead to the full development of cultivation—this is the advantage.\n\n'Monastics, the unwholesome Dhamma is to be understood, and the wholesome Dhamma is to be understood; the disadvantage is to be understood, and the advantage is to be understood. Having understood the unwholesome Dhamma and the wholesome Dhamma, and having understood the disadvantage and the advantage, one should practice in accordance with the Dhamma and in accordance with what is beneficial.' That which was said, was said with reference to this.",
      "sinhala": "මහණෙනි, අධර්මයත්, ධර්මයත් දැනගත යුතු ය. අනර්ථයත්, අර්ථයත් දැනගත යුතු ය. අධර්මයත්, ධර්මයත් දැනගෙන, අනර්ථයත්, අර්ථයත් දැනගෙන, ධර්මයට අනුවත්, අර්ථයට අනුවත් පිළිපැදිය යුතු ය.\n\nමහණෙනි, අධර්මය කවරේ ද? ධර්මය කවරේ ද? අනර්ථය කවරේ ද? අර්ථය කවරේ ද?\n\nමහණෙනි, ප්‍රාණඝාතය අධර්මය යි. ප්‍රාණඝාතයෙන් වැළකීම ධර්මය යි. යම් මේ ප්‍රාණඝාතය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. ප්‍රාණඝාතයෙන් වැළකීම හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, අදත්තාදානය අධර්මය යි. අදත්තාදානයෙන් වැළකීම ධර්මය යි. යම් මේ අදත්තාදානය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. අදත්තාදානයෙන් වැළකීම හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි. මහණෙනි, කාමයන්හි වරදවා හැසිරීම අධර්මය යි. කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම ධර්මය යි. යම් මේ කාමයන්හි වරදවා හැසිරීම හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි. මහණෙනි, මුසාවාදය අධර්මය යි. මුසාවාදයෙන් වැළකීම ධර්මය යි. යම් මේ මුසාවාදය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. මුසාවාදයෙන් වැළකීම හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි. මහණෙනි, පිසුනු වචනය අධර්මය යි. පිසුනු වචනයෙන් වැළකීම ධර්මය යි. යම් මේ පිසුනු වචනය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. පිසුනු වචනයෙන් වැළකීම හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි. මහණෙනි, ඵරුෂ වචනය අධර්මය යි. ඵරුෂ වචනයෙන් වැළකීම ධර්මය යි. යම් මේ ඵරුෂ වචනය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. ඵරුෂ වචනයෙන් වැළකීම හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි. මහණෙනි, සම්ඵප්පලාපය අධර්මය යි. සම්ඵප්පලාපයෙන් වැළකීම ධර්මය යි. යම් මේ සම්ඵප්පලාපය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. සම්ඵප්පලාපයෙන් වැළකීම හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි. මහණෙනි, අභිධ්‍යාව අධර්මය යි. අනභිධ්‍යාව ධර්මය යි. යම් මේ අභිධ්‍යාව හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. අනභිධ්‍යාව හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි. මහණෙනි, ව්‍යාපාදය අධර්මය යි. අව්‍යාපාදය ධර්මය යි. යම් මේ ව්‍යාපාදය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. අව්‍යාපාදය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිත්‍යාදෘෂ්ටිය අධර්මය යි. සම්මාදිට්ඨිය ධර්මය යි. යම් මේ මිත්‍යාදෘෂ්ටිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හට ගනී ද, මෙය අනර්ථය යි. සම්මාදිට්ඨිය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\n‘මහණෙනි, අධර්මයත්, ධර්මයත් දැනගත යුතු ය. අනර්ථයත්, අර්ථයත් දැනගත යුතු ය. අධර්මයත්, ධර්මයත් දැනගෙන, අනර්ථයත්, අර්ථයත් දැනගෙන, ධර්මයට අනුවත්, අර්ථයට අනුවත් පිළිපැදිය යුතු ය.’ යන යමක් කීවේ ද, ඒ කීවේ මේ කරුණ මුල් කරගෙන යි.",
      "paliTitle": "Tatiyaadhammasuttaṃ",
      "englishTitle": "The Third Dhamma Discourse",
      "sinhalaTitle": "තතිය ධර්‍ම සූත්‍රය"
    },
    {
      "number": 174,
      "pali": "‘‘Pāṇātipātampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Adinnādānampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Kāmesumicchācārampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Musāvādampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Pisuṇavācampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Pharusavācampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Samphappalāpampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Abhijjhampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Byāpādampāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. ‘‘Micchādiṭṭhimpāhaṃ, bhikkhave, tividhaṃ vadāmi – lobhahetukampi, dosahetukampi, mohahetukampi. Iti kho, bhikkhave, lobho kammanidānasambhavo, doso kammanidānasambhavo, moho kammanidānasambhavo. Lobhakkhayā kammanidānasaṅkhayo, dosakkhayā kammanidānasaṅkhayo, mohakkhayā kammanidānasaṅkhayo’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I declare the taking of life to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare the taking of what is not given to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare sexual misconduct to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare false speech to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare slanderous speech to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare harsh speech to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare frivolous speech to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare covetousness to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare ill will to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Monks, I declare wrong view to be of three kinds: rooted in greed, rooted in hatred, and rooted in delusion. Thus, monks, greed is the source of the origination of action, hatred is the source of the origination of action, and delusion is the source of the origination of action. With the cessation of greed is the cessation of the origination of action; with the cessation of hatred is the cessation of the origination of action; with the cessation of delusion is the cessation of the origination of action.",
      "sinhala": "මහණෙනි, මම ප්‍රාණඝාතය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම අදත්තාදානය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම කාමමිථ්‍යාචාරය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම මුසාවාදය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම පිසුණු වචනය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම ඵරුෂ වචනය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම සම්ඵප්පලාපය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම අභිධ්‍යාව තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම ව්‍යාපාදය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මම මිථ්‍යාදෘෂ්ටිය තෙවැදෑරුම් කොට කියමි – එය ලෝභය හේතුකොටගෙනද හටගනී, ද්වේෂය හේතුකොටගෙනද හටගනී, මෝහය හේතුකොටගෙනද හටගනී. මහණෙනි, මෙසේ ලෝභය කර්ම හේතුකොටගෙන හටගනී, ද්වේෂය කර්ම හේතුකොටගෙන හටගනී, මෝහය කර්ම හේතුකොටගෙන හටගනී. ලෝභය ක්‍ෂය වීමෙන් කර්ම හේතූන්ගේ ක්‍ෂය වීම සිදු වේ, ද්වේෂය ක්‍ෂය වීමෙන් කර්ම හේතූන්ගේ ක්‍ෂය වීම සිදු වේ, මෝහය ක්‍ෂය වීමෙන් කර්ම හේතූන්ගේ ක්‍ෂය වීම සිදු වේ.",
      "paliTitle": "Kammanidānasuttaṃ",
      "englishTitle": "Discourse on the Cause of Kamma",
      "sinhalaTitle": "කම‍්මනිදාන සූත‍්‍රය"
    },
    {
      "number": 175,
      "pali": "‘‘Saparikkamano ayaṃ, bhikkhave, dhammo, nāyaṃ dhammo aparikkamano. Kathañca, bhikkhave, saparikkamano ayaṃ dhammo, nāyaṃ dhammo aparikkamano? Pāṇātipātissa, bhikkhave, pāṇātipātā veramaṇī parikkamanaṃ hoti. Adinnādāyissa, bhikkhave, adinnādānā veramaṇī parikkamanaṃ hoti. Kāmesumicchācārissa, bhikkhave, kāmesumicchācārā veramaṇī parikkamanaṃ hoti. Musāvādissa, bhikkhave, musāvādā veramaṇī parikkamanaṃ hoti. Pisuṇavācassa, bhikkhave, pisuṇāya vācāya veramaṇī parikkamanaṃ hoti. Pharusavācassa, bhikkhave, pharusāya vācāya veramaṇī parikkamanaṃ hoti. Samphappalāpissa, bhikkhave, samphappalāpā veramaṇī parikkamanaṃ hoti. Abhijjhālussa, bhikkhave, anabhijjhā parikkamanaṃ hoti. Byāpannacittassa [byāpādassa (sī. pī. ka.), byāpannassa (syā.)], bhikkhave, abyāpādo parikkamanaṃ hoti. Micchādiṭṭhissa, bhikkhave, sammādiṭṭhi parikkamanaṃ hoti. Evaṃ kho, bhikkhave, saparikkamano ayaṃ dhammo, nāyaṃ dhammo aparikkamano’’ti. Navamaṃ.",
      "english": "This Dhamma, monks, has its means of rectification; it is not a Dhamma that is without means of rectification. How, monks, does this Dhamma have its means of rectification, and how is it not a Dhamma that is without means of rectification?\n\nFor one who kills living beings, monks, abstention from killing is the rectification. For one who takes what is not given, monks, abstention from taking what is not given is the rectification. For one who engages in sexual misconduct, monks, abstention from sexual misconduct is the rectification. For one who speaks falsehoods, monks, abstention from false speech is the rectification. For one who speaks divisive speech, monks, abstention from divisive speech is the rectification. For one who speaks harsh speech, monks, abstention from harsh speech is the rectification. For one who engages in idle chatter, monks, abstention from idle chatter is the rectification. For one who is covetous, monks, non-covetousness is the rectification. For one whose mind is afflicted by ill will, monks, goodwill is the rectification. For one with wrong view, monks, right view is the rectification. It is in this way, monks, that this Dhamma has its means of rectification, and is not a Dhamma that is without means of rectification.",
      "sinhala": "භික්ෂූණි, මේ ධර්මය නම්, පුහුණු කළ යුතු යමක් සහිත වූවකි. මේ ධර්මය පුහුණු කළ යුතු යමක් නැති වූවක් නොවේ. භික්ෂූණි, මේ ධර්මය පුහුණු කළ යුතු යමක් සහිත වූවක් වන්නේත්, පුහුණු කළ යුතු යමක් නැති වූවක් නොවේ වන්නේත් කෙසේද? භික්ෂූණි, ප්‍රාණඝාතයෙහි යෙදෙන පුද්ගලයාට ප්‍රාණඝාතයෙන් වැළකීම යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, අදත්තාදානයෙහි යෙදෙන පුද්ගලයාට අදත්තාදානයෙන් වැළකීම යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, කාමයන්හි වරදවා හැසිරීමෙහි යෙදෙන පුද්ගලයාට කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, මුසාවාදයෙහි යෙදෙන පුද්ගලයාට මුසාවාදයෙන් වැළකීම යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, පිසුනු බස් කීමෙහි යෙදෙන පුද්ගලයාට පිසුනු බස් කීමෙන් වැළකීම යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, ඵරුෂ බස් කීමෙහි යෙදෙන පුද්ගලයාට ඵරුෂ බස් කීමෙන් වැළකීම යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, සම්ඵප්පලාපයෙහි යෙදෙන පුද්ගලයාට සම්ඵප්පලාපයෙන් වැළකීම යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, අභිධ්‍යා සහිත පුද්ගලයාට අනාභිධ්‍යාව යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, ව්‍යාපාද චිත්තය සහිත පුද්ගලයාට අව්‍යාපාදය යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, මිථ්‍යාදෘෂ්ටිය සහිත පුද්ගලයාට සම්මාදිට්ඨිය යනු පුහුණු කළ යුතු කටයුත්තකි. භික්ෂූණි, මේ ආකාරයටයි, මේ ධර්මය පුහුණු කළ යුතු යමක් සහිත වූවක් වන්නේත්, පුහුණු කළ යුතු යමක් නැති වූවක් නොවේ වන්නේත්.",
      "paliTitle": "Parikkamanasuttaṃ",
      "englishTitle": "The Discourse on the Course",
      "sinhalaTitle": "පරි‍ක්‍රමණ සූත‍්‍රය"
    },
    {
      "number": 176,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā pāvāyaṃ [campāyaṃ (ka. sī.) dī. ni. 2.189 passitabbaṃ] viharati cundassa kammāraputtassa ambavane. Atha kho cundo kammāraputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho cundaṃ kammāraputtaṃ bhagavā etadavoca – ‘‘kassa no tvaṃ, cunda, soceyyāni rocesī’’ti? ‘‘Brāhmaṇā, bhante, pacchābhūmakā kamaṇḍalukā sevālamālikā [sevālamālakā (sī. syā. pī.)] aggiparicārikā udakorohakā soceyyāni paññapenti; tesāhaṃ soceyyāni rocemī’’ti. ‘‘Yathā kathaṃ pana, cunda, brāhmaṇā pacchābhūmakā kamaṇḍalukā sevālamālikā aggiparicārikā udakorohakā soceyyāni paññapentī’’ti? ‘‘Idha, bhante, brāhmaṇā pacchābhūmakā kamaṇḍalukā sevālamālikā aggiparicārikā udakorohakā. Te sāvakaṃ [sāvake (syā. ka.)] evaṃ samādapenti – ‘ehi tvaṃ, ambho purisa, kālasseva [sakālasseva (syā.)] uṭṭhahantova [uṭṭhahanto (syā.), vuṭṭhahantova (pī. ka.)] sayanamhā pathaviṃ āmaseyyāsi; no ce pathaviṃ āmaseyyāsi, allāni gomayāni āmaseyyāsi; no ce allāni gomayāni āmaseyyāsi, haritāni tiṇāni āmaseyyāsi; no ce haritāni tiṇāni āmaseyyāsi, aggiṃ paricareyyāsi; no ce aggiṃ paricareyyāsi, pañjaliko ādiccaṃ namasseyyāsi; no ce pañjaliko ādiccaṃ namasseyyāsi, sāyatatiyakaṃ udakaṃ oroheyyāsī’ti. Evaṃ kho, bhante, brāhmaṇā pacchābhūmakā kamaṇḍalukā sevālamālikā aggiparicārikā udakorohakā soceyyāni paññapenti; tesāhaṃ soceyyāni rocemī’’ti. ‘‘Aññathā kho, cunda, brāhmaṇā pacchābhūmakā kamaṇḍalukā sevālamālikā aggiparicārikā udakorohakā soceyyāni paññapenti, aññathā ca pana ariyassa vinaye soceyyaṃ hotī’’ti. ‘‘Yathā kathaṃ pana, bhante, ariyassa vinaye soceyyaṃ hoti? Sādhu me, bhante, bhagavā tathā dhammaṃ desetu yathā ariyassa vinaye soceyyaṃ hotī’’ti. ‘‘Tena hi, cunda, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho cundo kammāraputto bhagavato paccassosi. Bhagavā etadavoca – ‘‘Tividhaṃ kho, cunda, kāyena asoceyyaṃ hoti; catubbidhaṃ vācāya asoceyyaṃ hoti; tividhaṃ manasā asoceyyaṃ hoti. ‘‘Kathañca, cunda, tividhaṃ kāyena asoceyyaṃ hoti? ‘‘Idha, cunda, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu [pāṇabhūtesu (ka.)]. ‘‘Adinnādāyī hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti. ‘‘Kāmesumicchācārī hoti. Yā tā māturakkhitā piturakkhitā mātāpiturakkhitā [natthi sī. syā. pī. potthakesu] bhāturakkhitā bhaginirakkhitā ñātirakkhitā gottarakkhitā [natthi sī. syā. pī. potthakesu] dhammarakkhitā sasāmikā saparidaṇḍā antamaso mālāguḷaparikkhittāpi, tathārūpāsu cārittaṃ āpajjitā hoti. Evaṃ kho, cunda, tividhaṃ kāyena asoceyyaṃ hoti. ‘‘Kathañca, cunda, catubbidhaṃ vācāya asoceyyaṃ hoti? Idha, cunda, ekacco musāvādī hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti [so ajānaṃ vā ahaṃ jānāmīti, jānaṃ vā ahaṃ na jānāmīti, apassaṃ vā ahaṃ passāmīti, passaṃ vā ahaṃ na passāmīti (pī. ka.) evamuparipi], so ajānaṃ vā āha ‘jānāmī’ti, jānaṃ vā āha ‘na jānāmī’ti; apassaṃ vā āha ‘passāmī’ti, passaṃ vā āha ‘na passāmī’ti [so ajānaṃ vā ahaṃ jānāmīti, jānaṃ vā ahaṃ na jānāmīti, apassaṃ vā ahaṃ passāmīti, passaṃ vā ahaṃ na passāmīti (pī. ka.) evamuparipi]. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti. ‘‘Pisuṇavāco hoti. Ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā [bhedātā (ka.)], bhinnānaṃ vā anuppadātā, vaggārāmo vaggarato vagganandī vaggakaraṇiṃ vācaṃ bhāsitā hoti. ‘‘Pharusavāco hoti. Yā sā vācā aṇḍakā kakkasā parakaṭukā parābhisajjanī kodhasāmantā asamādhisaṃvattanikā, tathārūpiṃ vācaṃ bhāsitā hoti. ‘‘Samphappalāpī hoti akālavādī abhūtavādī anatthavādī adhammavādī avinayavādī; anidhānavatiṃ vācaṃ bhāsitā hoti akālena anapadesaṃ apariyantavatiṃ anatthasaṃhitaṃ. Evaṃ kho, cunda, catubbidhaṃ vācāya asoceyyaṃ hoti. ‘‘Kathañca, cunda, tividhaṃ manasā asoceyyaṃ hoti? Idha, cunda, ekacco abhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ abhijjhātā [abhijjhitā (ka.) ma. ni. 1.440 passitabbaṃ] hoti – ‘aho vata yaṃ parassa taṃ mamassā’ti. ‘‘Byāpannacitto hoti paduṭṭhamanasaṅkappo – ‘ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesu’nti [mā vā ahesuṃ iti vā ti (sī. pī. ka.)]. ‘‘Micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukaṭadukkaṭānaṃ [natthettha pāṭhabhedo] kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, cunda, manasā tividhaṃ asoceyyaṃ hoti. ‘‘Ime kho, cunda, dasa akusalakammapathā [akusalā kammapathā (?)]. Imehi kho, cunda, dasahi akusalehi kammapathehi samannāgato kālasseva uṭṭhahantova sayanamhā pathaviṃ cepi āmasati, asuciyeva hoti; no cepi pathaviṃ āmasati, asuciyeva hoti. ‘‘Allāni cepi gomayāni āmasati, asuciyeva hoti; no cepi allāni gomayāni āmasati, asuciyeva hoti. ‘‘Haritāni cepi tiṇāni āmasati, asuciyeva hoti; no cepi haritāni tiṇāni āmasati, asuciyeva hoti. ‘‘Aggiṃ cepi paricarati, asuciyeva hoti, no cepi aggiṃ paricarati, asuciyeva hoti. ‘‘Pañjaliko cepi ādiccaṃ namassati, asuciyeva hoti; no cepi pañjaliko ādiccaṃ namassati, asuciyeva hoti. ‘‘Sāyatatiyakaṃ cepi udakaṃ orohati, asuciyeva hoti; no cepi sāyatatiyakaṃ udakaṃ orohati, asuciyeva hoti. Taṃ kissa hetu? Ime, cunda, dasa akusalakammapathā asucīyeva [asucicceva (syā.)] honti asucikaraṇā ca. ‘‘Imesaṃ pana, cunda, dasannaṃ akusalānaṃ kammapathānaṃ samannāgamanahetu nirayo paññāyati, tiracchānayoni paññāyati, pettivisayo paññāyati, yā vā [yā ca (ka.)] panaññāpi kāci duggatiyo [duggati hoti (syā. ka.)]. ‘‘Tividhaṃ kho, cunda, kāyena soceyyaṃ hoti; catubbidhaṃ vācāya soceyyaṃ hoti; tividhaṃ manasā soceyyaṃ hoti. ‘‘Kathaṃ, cunda, tividhaṃ kāyena soceyyaṃ hoti? Idha, cunda, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho, lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati. ‘‘Adinnādānaṃ pahāya, adinnādānā paṭivirato hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, na taṃ adinnaṃ [taṃ nādinnaṃ (ka. sī., ma. ni. 1.441)] theyyasaṅkhātaṃ ādātā hoti. ‘‘Kāmesumicchācāraṃ pahāya, kāmesumicchācārā paṭivirato hoti yā tā māturakkhitā piturakkhitā mātāpiturakkhitā bhāturakkhitā bhaginirakkhitā ñātirakkhitā gottarakkhitā dhammarakkhitā sasāmikā saparidaṇḍā antamaso mālāguḷaparikkhittāpi, tathārūpāsu na cārittaṃ āpajjitā hoti. Evaṃ kho, cunda, tividhaṃ kāyena soceyyaṃ hoti. ‘‘Kathañca, cunda, catubbidhaṃ vācāya soceyyaṃ hoti? Idha, cunda, ekacco musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti. ‘‘Pisuṇaṃ vācaṃ pahāya, pisuṇāya vācāya paṭivirato hoti – na ito sutvā amutra akkhātā imesaṃ bhedāya, na amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti. ‘‘Pharusaṃ vācaṃ pahāya, pharusāya vācāya paṭivirato hoti. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā, tathārūpiṃ vācaṃ bhāsitā hoti. ‘‘Samphappalāpaṃ pahāya, samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī; nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Evaṃ kho, cunda, catubbidhaṃ vācāya soceyyaṃ hoti. ‘‘Kathañca, cunda, tividhaṃ manasā soceyyaṃ hoti? Idha, cunda, ekacco anabhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ anabhijjhitā hoti – ‘aho vata yaṃ parassa taṃ mamassā’ti. ‘‘Abyāpannacitto hoti appaduṭṭhamanasaṅkappo – ‘ime sattā averā hontu [idaṃ padaṃ sī. syā. pī. potthakesu natthi, tathā ma. ni. 1.441] abyāpajjā, anīghā sukhī attānaṃ pariharantū’ti. ‘‘Sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukaṭadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, cunda, tividhaṃ manasā soceyyaṃ hoti. ‘‘Ime kho, cunda, dasa kusalakammapathā. Imehi kho, cunda, dasahi kusalehi kammapathehi samannāgato kālasseva uṭṭhahantova sayanamhā pathaviṃ cepi āmasati, suciyeva hoti; no cepi pathaviṃ āmasati, suciyeva hoti. ‘‘Allāni cepi gomayāni āmasati, suciyeva hoti; no cepi allāni gomayāni āmasati, suciyeva hoti. ‘‘Haritāni cepi tiṇāni āmasati, suciyeva hoti; no cepi haritāni tiṇāni āmasati, suciyeva hoti. ‘‘Aggiṃ cepi paricarati, suciyeva hoti; no cepi aggiṃ paricarati, suciyeva hoti. ‘‘Pañjaliko cepi ādiccaṃ namassati, suciyeva hoti; no cepi pañjaliko ādiccaṃ namassati, suciyeva hoti. ‘‘Sāyatatiyakaṃ cepi udakaṃ orohati, suciyeva hoti; no cepi sāyatatiyakaṃ udakaṃ orohati, suciyeva hoti. Taṃ kissa hetu? Ime, cunda, dasa kusalakammapathā sucīyeva honti sucikaraṇā ca. ‘‘Imesaṃ pana, cunda, dasannaṃ kusalānaṃ kammapathānaṃ samannāgamanahetu devā paññāyanti, manussā paññāyanti, yā vā panaññāpi kāci sugatiyo’’ti [sugati hotīti (syā.), sugati hoti (ka.)]. Evaṃ vutte cundo kammāraputto bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante…pe… upāsakaṃ maṃ, bhante, bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ.",
      "english": "Thus have I heard: On one occasion, the Blessed One was dwelling in Pāvā, in the mango grove of Cunda, the smith's son. Then Cunda, the smith's son, approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. As Cunda, the smith's son, was sitting to one side, the Blessed One said to him: \"Whose purifications, Cunda, do you approve of?\"\n\n\"Venerable Sir, the Brahmins from the western lands, who carry water pots, who wear garlands of water plants, who worship fire, and who descend into water for purification—they prescribe purifications. I approve of their purifications.\"\n\n\"And how, Cunda, do these Brahmins from the western lands, who carry water pots, who wear garlands of water plants, who worship fire, and who descend into water for purification—how do they prescribe purifications?\"\n\n\"Here, Venerable Sir, the Brahmins from the western lands, who carry water pots, who wear garlands of water plants, who worship fire, and who descend into water for purification, instruct their disciples thus: ‘Come, good man, having risen early from your bed, you should touch the earth. If you do not touch the earth, you should touch fresh cow dung. If you do not touch fresh cow dung, you should touch green grass. If you do not touch green grass, you should worship fire. If you do not worship fire, you should salute the sun with clasped hands. If you do not salute the sun with clasped hands, you should descend into water three times in the evening.’ This is how, Venerable Sir, these Brahmins from the western lands, who carry water pots, who wear garlands of water plants, who worship fire, and who descend into water for purification, prescribe purifications. I approve of their purifications.\"\n\n\"Indeed, Cunda, the purifications prescribed by these Brahmins from the western lands, who carry water pots, who wear garlands of water plants, who worship fire, and who descend into water for purification, are one thing; but purification in the Noble Discipline is quite another.\"\n\n\"How then, Venerable Sir, is there purification in the Noble Discipline? It would be good, Venerable Sir, if the Blessed One would teach me the Dhamma in such a way that there may be purification in the Noble Discipline.\"\n\n\"In that case, Cunda, listen and pay close attention; I shall speak.\" \"Yes, Venerable Sir,\" Cunda, the smith's son, replied to the Blessed One. The Blessed One then spoke thus:\n\n\"There are, Cunda, three kinds of bodily impurity; four kinds of verbal impurity; and three kinds of mental impurity.\"\n\n\"And how, Cunda, are there three kinds of bodily impurity? Here, Cunda, some individual takes life; he is fierce, with blood-stained hands, intent on striking and killing, and without compassion for any living being.\n\nHe takes what is not given. That which is another's property or possessions, whether in a village or in the wilderness, he takes as not given, in the manner of a thief.\n\nHe engages in sexual misconduct. He has relations with those who are protected by their mother, protected by their father, protected by both mother and father, protected by their brother, protected by their sister, protected by their relatives, protected by their Dhamma, who have a husband, who are subject to penalties, or even those garlanded for marriage. He engages in misconduct with such women. This, Cunda, is how there are three kinds of bodily impurity.\n\n\"And how, Cunda, are there four kinds of verbal impurity? Here, Cunda, some individual is a speaker of falsehoods. Having gone to a public assembly, a company, a gathering of relatives, a guild, or a royal court, when called upon as a witness and asked, ‘Come, good man, speak what you know,’ he might say ‘I know’ when he does not know, or ‘I do not know’ when he does know; he might say ‘I see’ when he does not see, or ‘I do not see’ when he does see. Thus, for his own sake, or for the sake of another, or for the sake of some paltry material gain, he knowingly speaks a lie.\n\nHe is a slanderer. What he hears here, he reports there to cause division among these people. Or what he hears there, he reports here to cause division among those people. Thus he is a breaker of harmony among those who are united, and an encourager of division among those who are disunited. He delights in division, rejoices in division, is glad about division, and speaks words that create division.\n\nHe is a speaker of harsh speech. That speech which is coarse, rough, hurtful to others, abusive to others, bordering on anger, and conducive to disharmony, he speaks such speech.\n\nHe is a speaker of idle chatter; he speaks at the wrong time, speaks what is not factual, speaks what is unbeneficial, speaks contrary to the Dhamma, speaks contrary to the Discipline. He speaks words that are without restraint, at the wrong time, without clear reasons, without limit, and not conducive to benefit. This, Cunda, is how there are four kinds of verbal impurity.\n\n\"And how, Cunda, are there three kinds of mental impurity?\n\nHere, Cunda, some person is covetous. Whatever wealth or property belongs to another, they covet it, thinking, 'Oh, if only what belongs to another were mine!'\n\nThey have a mind full of ill-will; their mental resolve is corrupted, thinking, 'May these beings be slaughtered, or bound, or annihilated, or destroyed, or may they not exist at all!'\n\nThey hold wrong view, having a distorted vision, thinking: 'There is no gift, no offering, no sacrifice. There is no fruit or result of good or bad deeds. There is no present world, no world beyond. There is no mother, no father. There are no spontaneously born beings. There are no recluses or brahmins in the world who are rightly gone, who have practiced rightly, who, having directly known and realized this world and the world beyond for themselves, declare it.' Thus, Cunda, there are these three kinds of mental impurity.\n\nThese, Cunda, are the ten unwholesome courses of action. One who is endowed with these ten unwholesome courses of action, even if they rise early from their bed and touch the earth, they are still impure; and even if they do not touch the earth, they are still impure.\n\nEven if they touch fresh cow-dung, they are still impure; and even if they do not touch fresh cow-dung, they are still impure.\n\nEven if they touch fresh grass, they are still impure; and even if they do not touch fresh grass, they are still impure.\n\nEven if they attend to the sacrificial fire, they are still impure; and even if they do not attend to the sacrificial fire, they are still impure.\n\nEven if they bow to the sun with cupped hands, they are still impure; and even if they do not bow to the sun with cupped hands, they are still impure.\n\nEven if they descend into the water three times a day, they are still impure; and even if they do not descend into the water three times a day, they are still impure. Why is that? These ten unwholesome courses of action, Cunda, are themselves impure and make one impure.\n\nAnd because of being endowed with these ten unwholesome courses of action, Cunda, hell is manifested, the animal realm is manifested, the realm of hungry ghosts is manifested, or any other unfortunate destination.\n\nThere are, Cunda, three kinds of bodily purity. There are four kinds of verbal purity. There are three kinds of mental purity.\n\nAnd how, Cunda, are there three kinds of bodily purity? Here, Cunda, some person, abandoning the taking of life, abstains from the taking of life. They have laid aside the rod and the weapon. They are conscientious and merciful. They dwell with compassion for the welfare of all living beings.\n\nAbandoning taking what is not given, they abstain from taking what is not given. Whatever wealth or property of another, whether in the village or in the wilderness, they do not take it as something not given, amounting to theft.\n\nAbandoning misconduct in sensual pleasures, they abstain from misconduct in sensual pleasures. They do not engage in sexual misconduct with those protected by their mother, protected by their father, protected by both mother and father, protected by their brother, protected by their sister, protected by their relatives, protected by their clan, protected by their Dhamma, with those who have a husband, with those liable to punishment, or even with those garlanded in marriage. They do not engage in such conduct. Thus, Cunda, there are these three kinds of bodily purity.\n\nAnd how, Cunda, are there four kinds of verbal purity? Here, Cunda, some person, abandoning false speech, abstains from false speech. Gone to an assembly, or a gathering, or among relatives, or among a guild, or into the royal court, and presented as a witness and asked, 'Come, good sir, say what you know!', if they do not know, they say, 'I do not know'; if they know, they say, 'I know'; if they have not seen, they say, 'I have not seen'; if they have seen, they say, 'I have seen.' Thus, for their own sake, or for the sake of another, or for the sake of some paltry material gain, they do not speak a deliberate falsehood.\n\nAbandoning divisive speech, they abstain from divisive speech. They do not repeat there what they hear here to cause division among these people, nor do they repeat here what they hear there to cause division among those people. Thus, they are one who reconciles those who are divided and encourages those who are united. They rejoice in unity, delight in unity, find joy in unity, and speak words that promote unity.\n\nAbandoning harsh speech, they abstain from harsh speech. Whatever speech is gentle, pleasing to the ear, affectionate, heart-warming, courteous, appealing to many, and agreeable to many, they speak such words.\n\nAbandoning idle chatter, they abstain from idle chatter. They speak at the right time, speak what is true, speak what is beneficial, speak about the Dhamma, and speak about the Vinaya. They speak words that are worthy of being treasured, timely, reasoned, well-defined, and connected with purpose. Thus, Cunda, there are these four kinds of verbal purity.\n\nAnd how, Cunda, are there three kinds of mental purity? Here, Cunda, some person is not covetous. Whatever wealth or property belongs to another, they do not covet it, thinking, 'Oh, if only what belongs to another were mine!'\n\nHe has a mind free from ill-will and thoughts untainted by malevolence. He thinks: 'May these beings be free from enmity, free from affliction, free from trouble, and may they sustain themselves in happiness.' He has right view and an undistorted understanding. He understands: 'There is what is given, there is what is offered in sacrifice, there is what is offered as an oblation; there is fruit and result of good and bad actions. There is this world, there is the next world. There is mother, there is father. There are spontaneously arisen beings. There are in the world ascetics and brahmins who have gone the right way and practice rightly, who, having directly known and realized this world and the next world for themselves, proclaim it.' Thus, Cunda, there are these three kinds of purification through mental action.\n\nThese, Cunda, are the ten courses of wholesome action. One endowed with these ten courses of wholesome action, even if he rises early from his bed and touches the earth, he is pure; and even if he does not touch the earth, he is pure. Even if he touches wet cow dung, he is pure; and even if he does not touch wet cow dung, he is pure. Even if he touches green grass, he is pure; and even if he does not touch green grass, he is pure. Even if he tends the fire, he is pure; and even if he does not tend the fire, he is pure. Even if he salutes the sun with clasped hands, he is pure; and even if he does not salute the sun with clasped hands, he is pure. Even if he descends into the water three times a day, he is pure; and even if he does not descend into the water three times a day, he is pure. What is the reason for that? These ten courses of wholesome action, Cunda, are themselves pure and are purifiers. Moreover, Cunda, due to being endowed with these ten courses of wholesome action, gods are manifested, human beings are manifested, or any other happy destinations are manifested.\n\nWhen this was said, Cunda the smith's son said to the Blessed One: \"Excellent, venerable sir! May the Blessed One accept me as a lay follower, who has taken refuge from this day forth for as long as life lasts.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී.\n\nඑක් සමයෙක භාග්‍යවතුන් වහන්සේ පාවා නුවර, චුන්ද කම්මාරපුත්‍රයාගේ අඹ වනයෙහි වැඩසිටින සේක. එකල්හි චුන්ද කම්මාරපුත්‍රයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පැත්තක වාඩි විය. එක් පැත්තක වාඩි වී සිටි චුන්ද කම්මාරපුත්‍රයාට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “චුන්ද, ඔබ කාගේ පාරිශුද්ධි ක්‍රම අගය කරන්නේද?” “ස්වාමීනි, පැළපදියම් වුණු, කලහඬු දරන, සේවාල (දිය සෙවෙල්) මල්මාලා පැළඳි, ගිනි පිදීමෙහි යෙදෙන, ජලයට බසින බ්‍රාහ්මණයෝ පාරිශුද්ධි ක්‍රම පනවති; මම ඔවුන්ගේ ඒ පාරිශුද්ධි ක්‍රම අගය කරමි.” “චුන්ද, පැළපදියම් වුණු, කලහඬු දරන, සේවාල මල්මාලා පැළඳි, ගිනි පිදීමෙහි යෙදෙන, ජලයට බසින බ්‍රාහ්මණයෝ කෙසේ නම් පාරිශුද්ධි ක්‍රම පනවන්නේද?” “ස්වාමීනි, මෙහිලා පැළපදියම් වුණු, කලහඬු දරන, සේවාල මල්මාලා පැළඳි, ගිනි පිදීමෙහි යෙදෙන, ජලයට බසින බ්‍රාහ්මණයෝ සිටිති. ඔවුහු සිය ශ්‍රාවකයන් මෙසේ අවවාද කරති: ‘පින්වත් පුරුෂය, එන්න, ඔබ උදෑසනම, ඇඳෙන් නැගිට පොළොව ස්පර්ශ කළ යුතුයි. යම් හෙයකින් පොළොව ස්පර්ශ නොකරන්නේ නම්, තෙත් ගොම ස්පර්ශ කළ යුතුයි. යම් හෙයකින් තෙත් ගොම ස්පර්ශ නොකරන්නේ නම්, කොළ පැහැති තණකොළ ස්පර්ශ කළ යුතුයි. යම් හෙයකින් කොළ පැහැති තණකොළ ස්පර්ශ නොකරන්නේ නම්, ගින්නට උපස්ථාන කළ යුතුයි. යම් හෙයකින් ගින්නට උපස්ථාන නොකරන්නේ නම්, දොහොත් මුදුන් තබා හිරුට නමස්කාර කළ යුතුයි. යම් හෙයකින් දොහොත් මුදුන් තබා හිරුට නමස්කාර නොකරන්නේ නම්, සැන්දෑවේ තුන්වරක් ජලයට බැස ජලයෙන් ස්නානය කළ යුතුයි.’ ස්වාමීනි, පැළපදියම් වුණු, කලහඬු දරන, සේවාල මල්මාලා පැළඳි, ගිනි පිදීමෙහි යෙදෙන, ජලයට බසින බ්‍රාහ්මණයෝ මෙසේ පාරිශුද්ධි ක්‍රම පනවති; මම ඔවුන්ගේ ඒ පාරිශුද්ධි ක්‍රම අගය කරමි.”\n\n“චුන්ද, පැළපදියම් වුණු, කලහඬු දරන, සේවාල මල්මාලා පැළඳි, ගිනි පිදීමෙහි යෙදෙන, ජලයට බසින බ්‍රාහ්මණයෝ පාරිශුද්ධි ක්‍රම පනවන්නේ එක් ආකාරයකටයි. ආර්ය විනයෙහි පාරිශුද්ධි ක්‍රමය වන්නේ වෙනත් ආකාරයකටයි.” “ස්වාමීනි, ආර්ය විනයෙහි පාරිශුද්ධි ක්‍රමය කෙසේ නම් වේද? ස්වාමීනි, ආර්ය විනයෙහි පාරිශුද්ධි ක්‍රමය කෙසේ වේදැයි භාග්‍යවතුන් වහන්සේ මට ඒ ධර්මය දේශනා කරත්වා!” “එසේ නම් චුන්ද, අසන්න, මනාව මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.” “එසේය, ස්වාමීනි” යි කියා චුන්ද කම්මාරපුත්‍රයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “චුන්ද, කයින් අශුද්ධ භාවය තෙවැදෑරුම් වේ. වචනයෙන් අශුද්ධ භාවය සිව්වැදෑරුම් වේ. මනසින් අශුද්ධ භාවය තෙවැදෑරුම් වේ.\n\n“චුන්ද, කයින් අශුද්ධ භාවය තෙවැදෑරුම් වන්නේ කෙසේද?\n\n“චුන්ද, මෙහිලා ඇතැමෙක් ප්‍රාණඝාතක වන අතර, දරුණු ගති ඇති, ලෙහෙ තැවරුණු අත් ඇති, මරා තැළීමෙහි ඇලුණු, සියලු ප්‍රාණ භූතයන් කෙරෙහි දයාව රහිත වේ.\n\nපැහැරගන්නා සුළු (අදින්නාදායී) වේ. අනුන්ගේ, අනුන් සතු වූ, ගමකට අයත් වූ හෝ ආරණ්‍යයකට අයත් වූ හෝ, අන්සතු දේ, සොරකමක් ලෙස සලකා, අයිතිකරුවකුගෙන් නොදී ගන්නාසුලු (සොරකම් කරන්නා වූ) පුද්ගලයෙක් වේ.\n\nකාමයන්හි වරදවා හැසිරෙන්නේය. එනම්, මව විසින් රකින ලද, පියා විසින් රකින ලද, මව සහ පියා විසින් රකින ලද, සහෝදරයා විසින් රකින ලද, සහෝදරිය විසින් රකින ලද, ඥාතීන් විසින් රකින ලද, ගෝත්‍රය විසින් රකින ලද, ධර්මය විසින් රකින ලද, ස්වාමියකු ඇති, දඬුවමක් ඇති, එපමණකින් නොනැවතී මල්මාලාවකින් හෝ වටකර ආරක්ෂා කරන ලද තැනැත්තියන් කෙරෙහි, එබඳු අයට අයුතු ලෙස හැසිරෙන්නේය. චුන්ද, මෙසේ කයින් අශුද්ධ භාවය තෙවැදෑරුම් වේ.\n\n“චුන්ද, වචනයෙන් අශුද්ධ භාවය සිව්වැදෑරුම් වන්නේ කෙසේද? චුන්ද, මෙහිලා ඇතැමෙක් මුසාවාදී (බොරු කියන) අයෙක් වේ.\n\nසභාවක් වෙත ගිය විට හෝ, පිරිසක් වෙත ගිය විට හෝ, ඥාතීන් මැදට ගිය විට හෝ, සමූහයක් මැදට ගිය විට හෝ, රජුගේ පිරිස මැදට ගිය විට හෝ, සාක්ෂියක් සඳහා කැඳවා විමසන ලද විට, ‘පින්වත් පුරුෂය, ඔබ දන්නා දේ කියන්න’ යැයි අසන ලද විට, ඔහු නොදන්නා දෙයක් ‘මම දනිමි’ යැයි කියයි, හෝ දන්නා දෙයක් ‘මම නොදනිමි’ යැයි කියයි; නොදැකපු දෙයක් ‘මම දුටුවෙමි’ යැයි කියයි, හෝ දැකපු දෙයක් ‘මම නොදුටුවෙමි’ යැයි කියයි. මෙසේ තමන්ගේ වැඩක් නිසා හෝ, අනුන්ගේ වැඩක් නිසා හෝ, සුළු ආමිස ලාභයක් නිසා හෝ දැන දැන බොරු කියනු ලැබේ.\n\nපේසුණ්‍ය වචන කීමෙහි යෙදෙයි. මෙතනින් අසා අර අය භේද කිරීම පිණිස අර අයට කියයි, හෝ අරතනින් අසා මේ අය භේද කිරීම පිණිස මේ අයට කියයි. මෙසේ සමගි වූවන් භේද කරන්නෙක් වේ, හෝ භේද වූවන් තවදුරටත් භේද කරන්නෙක් වේ. භේද කිරීමෙහි ඇලුම් ඇත්තෙක්, භේද කිරීමෙහි සතුටු ඇත්තෙක්, භේද කිරීමෙහි ප්‍රීති ඇත්තෙක් වේ. භේද කරවන වචන කීමෙහි යෙදෙයි.\n\nකඨෝර වචන කීමෙහි යෙදෙයි. එනම්, යම් වචනයක් රළුද, කටුකද, අනුන්ට පීඩාකාරීද, අනුන්ට අපහාස කරනසුළුද, ක්‍රෝධයෙන් පිරුණේද, සමාධියට විරුද්ධද, එබඳු වචන කීමෙහි යෙදෙයි.\n\nසම්ප්‍රප්පලාපී (නිෂ්ඵල කතා කියන) අයෙක් වේ. අකල්හි කියන්නෙක්, අසත්‍යය කියන්නෙක්, අනර්ථය කියන්නෙක්, අධර්මය කියන්නෙක්, අවිනීත දේ කියන්නෙක් වේ. පදනමක් නැති, අකාලයේ, අරමුණක් නැති, සීමාවක් නැති, අනර්ථයෙන් යුක්ත වචන කීමෙහි යෙදෙයි. චුන්ද, මෙසේ වචනයෙන් අශුද්ධ භාවය සිව්වැදෑරුම් වේ.\n\n“චුන්ද, මනසින් අශුද්ධ භාවය තෙවැදෑරුම් වන්නේ කෙසේද?\n\nමෙහිදී, චුන්ද, යම්කිසි පුද්ගලයෙක් අභිධ්‍යා සහිත වේ. අන් සතු වූ යම් වස්තුවක් හෝ උපකරණයක් වේද, එයට ඔහු දැඩිව ආශා කරයි. ‘අහෝ! අන් සතු වූ මේ දේ මට අයිති වේ නම් ඉතා යහපත්ය’යි සිතයි.\n\nඔහු ව්‍යාපාද සිත් ඇත්තෙක් වේ. ද්වේෂයෙන් දූෂිත වූ සිතුවිලි ඇත්තෙක් වේ. ‘මේ සත්ත්වයෝ මැරෙත්වා, බැඳගෙනයනු ලබත්වා, විනාශ වෙත්වා, නැති වෙත්වා, කිසිසේත් නොසිටිත්වා!’යි සිතයි.\n\nඔහු මිත්‍යාදෘෂ්ටිකයෙක් වේ. සත්‍යයට විරුද්ධ දර්ශනයක් ඇත්තෙක් වේ. ‘දෙන ලද දෙයක විපාකයක් නැත, පූජා කළ දෙයක විපාකයක් නැත, දේව පූජාවල විපාකයක් නැත, යහපත් හා අයහපත් කර්මවල ඵලයක් හෝ විපාකයක් නැත. මේ ලෝකයක් නැත, පරලොවක් නැත. මවක් නැත, පියෙක් නැත, ඕපපාතික සත්ත්වයෝ නැත. ලෝකයේ මේ ලෝකයත්, පරලොවක් තමාගේ උසස් ඤාණයෙන් අවබෝධ කරගෙන ප්‍රකාශ කරන, සම්පූර්ණ මාර්ගයට පැමිණි, මනාව පිළිපන් ශ්‍රමණ-බ්‍රාහ්මණයෝ නැත’යි සිතයි. චුන්දය, මෙලෙස සිතින් තෙවැදෑරුම් අශුචි බවක් සිදු වේ.\n\nචුන්දය, මේ දස අකුසල කර්මපථයෝ වෙත්. චුන්දය, මේ දස අකුසල කර්මපථයන්ගෙන් යුක්ත වූ පුද්ගලයා, උදෑසනින්ම නින්දෙන් පිබිද බිම ස්පර්ශ කළත් අපිරිසිදුම වේ, බිම ස්පර්ශ නොකළත් අපිරිසිදුම වේ.\n\nතෙත් ගොම ස්පර්ශ කළත් අපිරිසිදුම වේ, තෙත් ගොම ස්පර්ශ නොකළත් අපිරිසිදුම වේ.\n\nකොළ පැහැති තණකොළ ස්පර්ශ කළත් අපිරිසිදුම වේ, කොළ පැහැති තණකොළ ස්පර්ශ නොකළත් අපිරිසිදුම වේ.\n\nගින්නට වන්දනාමාන කළත් අපිරිසිදුම වේ, ගින්නට වන්දනාමාන නොකළත් අපිරිසිදුම වේ.\n\nදොහොත් මුදුන් තබා හිරුට නමස්කාර කළත් අපිරිසිදුම වේ, දොහොත් මුදුන් තබා හිරුට නමස්කාර නොකළත් අපිරිසිදුම වේ.\n\nසවස් වරුවේ තුන් වරක් වතුරට බැස්සත් අපිරිසිදුම වේ, සවස් වරුවේ තුන් වරක් වතුරට නොබැස්සත් අපිරිසිදුම වේ. එයට හේතුව කුමක්ද? චුන්දය, මේ දස අකුසල කර්මපථයෝ අපිරිසිදුම වෙති. තවද, අපිරිසිදු කරන සුළු ද වෙති.\n\nචුන්දය, මේ දස අකුසල කර්මපථයන්ගෙන් යුක්ත වීම හේතුවෙන්, නිරය ලෝකය පහළ වේ, තිරිසන් යෝනිය පහළ වේ, ප්‍රේත විෂය පහළ වේ, එසේම අන් යම් දුගතියක් වේද, එයද පහළ වේ.\n\nචුන්දය, සිරුරින් තෙවැදෑරුම් පිරිසිදු බවක් වේ. වචනයෙන් සිව්වැදෑරුම් පිරිසිදු බවක් වේ. සිතින් තෙවැදෑරුම් පිරිසිදු බවක් වේ.\n\nචුන්දය, සිරුරින් තෙවැදෑරුම් පිරිසිදු බවක් ඇති වන්නේ කෙසේද? චුන්දය, මෙහිදී යම් පුද්ගලයෙක් ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකී සිටී. ඔහු දඬු මුගුරු බහා තබා, අවි ආයුධ බහා තබා, ලජ්ජාශීලීව, දයාවන්තව, සියලු සත්ත්වයන්ට, සියලු ප්‍රාණීන්ට හිත පිණිස අනුකම්පාවෙන් යුතුව වාසය කරයි.\n\nඅදත්තාදානය අත්හැර, අදත්තාදානයෙන් වැළකී සිටී. ගමක හෝ අරණ්‍යයක හෝ අන්සතු යම් වස්තුවක් හෝ උපකරණයක් වේද, එය නුදුන් දෙයක් වශයෙන්, සොරකම් කිරීමක් වශයෙන් නොගනී.\n\nකාමයන්හි වරදවා හැසිරීම අත්හැර, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටී. මව විසින් රකින ලද, පියා විසින් රකින ලද, මව සහ පියා විසින් රකින ලද, සහෝදරයා විසින් රකින ලද, සහෝදරිය විසින් රකින ලද, ඥාතීන් විසින් රකින ලද, ගෝත්‍රය විසින් රකින ලද, ධර්මයෙන් රකින ලද, ස්වාමියා සහිත වූ, දඬුවම් නියම වූ, යම් ස්ත්‍රීන් වේද, අවසානයේ මල් මාලාවකින් වට කරන ලද ස්ත්‍රීන් වේද, එවැනි ස්ත්‍රීන් කෙරෙහි වරදවා නොහැසිරෙයි. චුන්දය, මෙලෙස සිරුරින් තෙවැදෑරුම් පිරිසිදු බවක් සිදු වේ.\n\nචුන්දය, වචනයෙන් සිව්වැදෑරුම් පිරිසිදු බවක් ඇති වන්නේ කෙසේද? චුන්දය, මෙහිදී යම් පුද්ගලයෙක් මුසාවාදය අත්හැර, මුසාවාදයෙන් වැළකී සිටී. සභාවකට ගියත්, පිරිසකට ගියත්, ඥාතීන් අතරට ගියත්, ගම්මුන් අතරට ගියත්, රාජ කුලයකට ගියත්, සාක්ෂිකරුවෙකු ලෙස කැඳවා, ‘පින්වත් පුරුෂය, ඔබ දන්නා දේ කියන්න’යි විමසන විට, ඔහු නොදන්නා දේ ‘මම නොදනිමි’ යයි පවසයි, දන්නා දේ ‘මම දනිමි’ යයි පවසයි, නොදුටු දේ ‘මම නොදුටුවෙමි’ යයි පවසයි, දුටු දේ ‘මම දුටුවෙමි’ යයි පවසයි. මෙලෙස තමාගේ වාසිය පිණිස හෝ අන්‍යයන්ගේ වාසිය පිණිස හෝ යම්කිසි සුළු ආමිසයක් (ලාභයක්) පිණිස හෝ දැන දැන මුසාවාදයක් නොකියයි.\n\nපිසුණු වචනය අත්හැර, පිසුණු වචනයෙන් වැළකී සිටී. මෙහිදී අසා, මේ අය බිඳවීම පිණිස අන් අය අතර නොකියයි. එසේම අන් තැනකදී අසා, අන් අය බිඳවීම පිණිස මේ අය අතර නොකියයි. මෙලෙස බිඳී ගිය අය සමගි කරවන්නෙක් වේ. සමගි වූවන් තවදුරටත් සමගි කරවන්නෙක් වේ. සමගියෙහි ඇලුණු, සමගියෙහි රුචි වූ, සමගියෙහි සතුටු වන, සමගිය ඇති කරන වචන කතා කරයි.\n\nඵරුෂ වචනය අත්හැර, ඵරුෂ වචනයෙන් වැළකී සිටී. යම් වචනයක් මෘදු, කනට මිහිරි, ප්‍රිය උපදවන, හදවතට පිවිසෙන, නාගරිකයන්ට මෙන් යහපත්, බොහෝ දෙනාට ප්‍රිය මනාප වේද, එවැනි වචන කතා කරයි.\n\nසම්ඵප්ප්‍රලාපය අත්හැර, සම්ඵප්ප්‍රලාපයෙන් වැළකී සිටී. කාලයට අනුව කතා කරන්නෙක්, සත්‍යය කතා කරන්නෙක්, අර්ථය සහිතව කතා කරන්නෙක්, ධර්මය කතා කරන්නෙක්, විනය කතා කරන්නෙක් වේ. නිධානවත් වූ, කාලයට අදාළ වූ, උපදේශ සහිත වූ, සීමා සහිත වූ, අර්ථයෙන් යුක්ත වූ වචන කතා කරයි. චුන්දය, මෙලෙස වචනයෙන් සිව්වැදෑරුම් පිරිසිදු බවක් සිදු වේ.\n\nචුන්දය, සිතින් තෙවැදෑරුම් පිරිසිදු බවක් ඇති වන්නේ කෙසේද? චුන්දය, මෙහිදී යම් පුද්ගලයෙක් අභිධ්‍යාවෙන් තොර වේ. අන් සතු වූ යම් වස්තුවක් හෝ උපකරණයක් වේද, එයට ඔහු දැඩිව ආශා නොකරයි. ‘අහෝ! අන් සතු වූ මේ දේ මට අයිති වේ නම් ඉතා යහපත්ය’යි නොසිතයි.\n\nඅව්‍යාපන්න සිත් ඇත්තෙක්, අප‍්‍රදූෂිත මනෝසංකල්ප ඇත්තෙක් වන්නේ ය. ‘මේ සත්ත්වයෝ වෛර නැත්තෝ, පීඩා නැත්තෝ, දුක් නැත්තෝ, සුවසේ තමන් පවත්වා ගත්තෝ වෙත්වා’ යි. සම්මාදිට්ඨිකයෙක් වන්නේ ය, අවිපරීත දර්ශනයෙන් යුක්ත වන්නේ ය. ‘දීමක් ඇත, පිදීමක් ඇත, හෝමයක් ඇත, හොඳින් කරන ලද නරකිනුත් කරන ලද කර්මයන්ගේ ඵලවිපාක ඇත, මේ ලෝකය ඇත, පරලෝකය ඇත, මව ඇත, පියා ඇත, ඕපපාතික සත්ත්වයෝ ඇත, මේ ලෝකයේ, මේ ලෝකයත් පරලෝකයත් තමන් විසින් ම විශේෂයෙන් දැන ප්‍රත්‍යක්ෂ කොට පවසන, මනාකොට ගිය, මනාකොට පිළිපන් ශ‍්‍රමණ බ්‍රාහ්මණයෝ ඇත’ යි. චුන්දය, මෙසේ ත‍්‍රිවිධ මනෝසූචියක් වේ.\n\nචුන්දය, මේ දස කුසල කර්මපථයෝ වෙත්. චුන්දය, මේ දස කුසල කර්මපථයන්ගෙන් යුක්ත වූ පුද්ගලයා වේලාසනින් ම ඇඳෙන් නැගිටිනවාම පොළොව ස්පර්ශ කළත් පිරිසිදු ම වන්නේ ය; පොළොව ස්පර්ශ නොකළත් පිරිසිදු ම වන්නේ ය.\n\nතෙත් වූ ගොම ස්පර්ශ කළත් පිරිසිදු ම වන්නේ ය; තෙත් වූ ගොම ස්පර්ශ නොකළත් පිරිසිදු ම වන්නේ ය.\n\nකොළ පැහැති තණකොළ ස්පර්ශ කළත් පිරිසිදු ම වන්නේ ය; කොළ පැහැති තණකොළ ස්පර්ශ නොකළත් පිරිසිදු ම වන්නේ ය.\n\nගින්නට උපස්ථාන කළත් පිරිසිදු ම වන්නේ ය; ගින්නට උපස්ථාන නොකළත් පිරිසිදු ම වන්නේ ය.\n\nදෙඅත් එක්කොට හිරුට නමස්කාර කළත් පිරිසිදු ම වන්නේ ය; දෙඅත් එක්කොට හිරුට නමස්කාර නොකළත් පිරිසිදු ම වන්නේ ය.\n\nදිනකට තුන්වරක් ජලයට බැස්සත් පිරිසිදු ම වන්නේ ය; දිනකට තුන්වරක් ජලයට නොබැස්සත් පිරිසිදු ම වන්නේ ය. එයට හේතුව කුමක් ද? චුන්දය, මේ දස කුසල කර්මපථයෝ පිරිසිදු ම වෙති, පිරිසිදු කරන සුලු ද වෙති.\n\nඑසේ ම චුන්දය, මේ දස කුසල කර්මපථයන්ගෙන් යුක්ත වීම හේතුවෙන් දෙවියෝ ප‍්‍රකට වෙති, මිනිස්සු ප‍්‍රකට වෙති, යම් වෙනත් සුගතියක් වේ නම්, එය ද ප‍්‍රකට වන්නේ ය.\n\nමෙසේ පැවසූ කල්හි චුන්ද කම්මාරපුත්‍ර තෙමේ භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේ ය: ‘අතිශයින් ම මැනවි, භන්තය!...පෙ!... භන්තය, අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයකු ලෙස මා භාග්‍යවතුන් වහන්සේ සලකන සේක්වා’ යි.",
      "paliTitle": "Cundasuttaṃ",
      "englishTitle": "Cunda Sutta",
      "sinhalaTitle": "චුන්‍ද සූත්‍‍රය"
    },
    {
      "number": 177,
      "pali": "Atha kho jāṇussoṇi brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘Mayamassu, bho gotama, brāhmaṇā nāma. Dānāni dema, saddhāni karoma – ‘idaṃ dānaṃ petānaṃ ñātisālohitānaṃ upakappatu, idaṃ dānaṃ petā ñātisālohitā paribhuñjantū’ti. Kacci taṃ, bho gotama, dānaṃ petānaṃ ñātisālohitānaṃ upakappati; kacci te petā ñātisālohitā taṃ dānaṃ paribhuñjantī’’ti? ‘‘Ṭhāne kho, brāhmaṇa, upakappati, no aṭṭhāne’’ti. ‘‘Katamaṃ pana, bho [katamañca pana bho (sī. pī.) katamaṃ (syā.)] gotama, ṭhānaṃ, katamaṃ aṭṭhāna’’nti? ‘‘Idha, brāhmaṇa, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti, abhijjhālu hoti, byāpannacitto hoti, micchādiṭṭhiko hoti. So kāyassa bhedā paraṃ maraṇā nirayaṃ upapajjati. Yo nerayikānaṃ sattānaṃ āhāro, tena so tattha yāpeti, tena so tattha tiṭṭhati. Idampi [idaṃ (syā.)] kho, brāhmaṇa, aṭṭhānaṃ yattha ṭhitassa taṃ dānaṃ na upakappati. ‘‘Idha pana, brāhmaṇa, ekacco pāṇātipātī…pe… micchādiṭṭhiko hoti. So kāyassa bhedā paraṃ maraṇā tiracchānayoniṃ upapajjati. Yo tiracchānayonikānaṃ sattānaṃ āhāro, tena so tattha yāpeti, tena so tattha tiṭṭhati. Idampi kho, brāhmaṇa, aṭṭhānaṃ yattha ṭhitassa taṃ dānaṃ na upakappati. ‘‘Idha pana, brāhmaṇa, ekacco pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhiko hoti. So kāyassa bhedā paraṃ maraṇā manussānaṃ sahabyataṃ upapajjati. Yo manussānaṃ āhāro, tena so tattha yāpeti, tena so tattha tiṭṭhati. Idampi kho, brāhmaṇa, aṭṭhānaṃ yattha ṭhitassa taṃ dānaṃ na upakappati. ‘‘Idha pana, brāhmaṇa, ekacco pāṇātipātā paṭivirato hoti…pe… sammādiṭṭhiko hoti. So kāyassa bhedā paraṃ maraṇā devānaṃ sahabyataṃ upapajjati. Yo devānaṃ āhāro, tena so tattha yāpeti, tena so tattha tiṭṭhati. Idampi, brāhmaṇa, aṭṭhānaṃ yattha ṭhitassa taṃ dānaṃ upakappati. ‘‘Idha pana, brāhmaṇa, ekacco pāṇātipātī hoti…pe… micchādiṭṭhiko hoti. So kāyassa bhedā paraṃ maraṇā pettivisayaṃ upapajjati. Yo pettivesayikānaṃ sattānaṃ āhāro, tena so tattha yāpeti, tena so tattha tiṭṭhati, yaṃ vā panassa ito anuppavecchanti mittāmaccā vā ñātisālohitā vā [mittā vā amaccā vā ñātī vā sālohitā vā (sī. pī.)], tena so tattha yāpeti, tena so tattha tiṭṭhati. Idaṃ kho, brāhmaṇa, ṭhānaṃ yattha ṭhitassa taṃ dānaṃ upakappatī’’ti. ‘‘Sace pana, bho gotama, so peto ñātisālohito taṃ ṭhānaṃ anupapanno hoti, ko taṃ dānaṃ paribhuñjatī’’ti? ‘‘Aññepissa, brāhmaṇa, petā ñātisālohitā taṃ ṭhānaṃ upapannā honti, te taṃ dānaṃ paribhuñjantī’’ti. ‘‘Sace pana, bho gotama, so ceva peto ñātisālohito taṃ ṭhānaṃ anupapanno hoti aññepissa ñātisālohitā petā taṃ ṭhānaṃ anupapannā honti, ko taṃ dānaṃ paribhuñjatī’’ti? ‘‘Aṭṭhānaṃ kho etaṃ, brāhmaṇa, anavakāso yaṃ taṃ ṭhānaṃ vivittaṃ assa iminā dīghena addhunā yadidaṃ petehi ñātisālohitehi. Api ca, brāhmaṇa, dāyakopi anipphalo’’ti. ‘‘Aṭṭhānepi bhavaṃ gotamo parikappaṃ vadatī’’ti? ‘‘Aṭṭhānepi kho ahaṃ, brāhmaṇa, parikappaṃ vadāmi. Idha, brāhmaṇa, ekacco pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti, abhijjhālu hoti, byāpannacitto hoti, micchādiṭṭhiko hoti; so dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So kāyassa bhedā paraṃ maraṇā hatthīnaṃ sahabyataṃ upapajjati. So tattha lābhī hoti annassa pānassa mālānānālaṅkārassa [mālāgandhavilepanassa nānālaṅkārassa (ka.)]. ‘‘Yaṃ kho, brāhmaṇa, idha pāṇātipātī adinnādāyī kāmesumicchācārī musāvādī pisuṇavāco pharusavāco samphappalāpī abhijjhālu byāpannacitto micchādiṭṭhiko, tena so kāyassa bhedā paraṃ maraṇā hatthīnaṃ sahabyataṃ upapajjati. Yañca kho so dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ, tena so tattha lābhī hoti annassa pānassa mālānānālaṅkārassa. ‘‘Idha pana, brāhmaṇa, ekacco pāṇātipātī hoti…pe… micchādiṭṭhiko hoti. So dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So kāyassa bhedā paraṃ maraṇā assānaṃ sahabyataṃ upapajjati…pe… gunnaṃ sahabyataṃ upapajjati… pe… kukkurānaṃ sahabyataṃ upapajjati [‘‘kukkurānaṃ sahabyataṃ upapajjatī’’ti ayaṃ vāro kesuci sīhaḷapotthakesu na dissatīti iṅgalisapotthake adholipi. taṃ dasavāragaṇanāya sameti]. So tattha lābhī hoti annassa pānassa mālānānālaṅkārassa. ‘‘Yaṃ kho, brāhmaṇa, idha pāṇātipātī…pe. … micchādiṭṭhiko, tena so kāyassa bhedā paraṃ maraṇā kukkurānaṃ sahabyataṃ upapajjati. Yañca kho so dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ, tena so tattha lābhī hoti annassa pānassa mālānānālaṅkārassa. ‘‘Idha pana, brāhmaṇa, ekacco pāṇātipātā paṭivirato hoti…pe… sammādiṭṭhiko hoti. So dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So kāyassa bhedā paraṃ maraṇā manussānaṃ sahabyataṃ upapajjati. So tattha lābhī hoti mānusakānaṃ pañcannaṃ kāmaguṇānaṃ. ‘‘Yaṃ kho, brāhmaṇa, idha pāṇātipātā paṭivirato hoti…pe… sammādiṭṭhiko, tena so kāyassa bhedā paraṃ maraṇā manussānaṃ sahabyataṃ upapajjati. Yañca kho so dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ, tena so tattha lābhī hoti mānusakānaṃ pañcannaṃ kāmaguṇānaṃ. ‘‘Idha pana, brāhmaṇa, ekacco pāṇātipātā paṭivirato hoti…pe… sammādiṭṭhiko hoti. So dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. So kāyassa bhedā paraṃ maraṇā devānaṃ sahabyataṃ upapajjati. So tattha lābhī hoti dibbānaṃ pañcannaṃ kāmaguṇānaṃ. ‘‘Yaṃ kho, brāhmaṇa, idha pāṇātipātā paṭivirato hoti…pe… sammādiṭṭhiko, tena so kāyassa bhedā paraṃ maraṇā devānaṃ sahabyataṃ upapajjati. Yañca kho so dātā hoti samaṇassa vā brāhmaṇassa vā annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ, tena so tattha lābhī hoti dibbānaṃ pañcannaṃ kāmaguṇānaṃ. Api ca, brāhmaṇa, dāyakopi anipphalo’’ti. ‘‘Acchariyaṃ, bho gotama, abbhutaṃ, bho gotama! Yāvañcidaṃ, bho gotama, alameva dānāni dātuṃ, alaṃ saddhāni kātuṃ, yatra hi nāma dāyakopi anipphalo’’ti. ‘‘Evametaṃ, brāhmaṇa [evametaṃ brāhmaṇa evametaṃ brāhmaṇa (sī. syā.)], dāyakopi hi, brāhmaṇa, anipphalo’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Ekādasamaṃ.",
      "english": "Then the brahmin Jāṇussoṇi approached the Blessed One. Having approached, he exchanged cordial greetings with the Blessed One. After exchanging customary and polite conversation, he sat down to one side.\n\nSitting to one side, the brahmin Jāṇussoṇi said to the Blessed One: 'We, good Gotama, are brahmins by name. We give gifts and perform acts of faith, thinking: \"May this gift benefit our departed relatives and kin; may our departed relatives and kin partake of this gift.\" Good Gotama, does that gift truly benefit the departed relatives and kin? Do those departed relatives and kin partake of that gift?'\n\n'Brahmin, it benefits where there is a fitting condition, not where there is no fitting condition.'\n\n'But good Gotama, what is a fitting condition, and what is not a fitting condition?'\n\n'Here, brahmin, a certain person is a killer of living beings, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, engages in idle chatter, is covetous, has ill will, and holds wrong views. With the break-up of the body, after death, he reappears in hell. He sustains himself there with the food of hell-beings, he subsists there by that. This, brahmin, is not a fitting condition; being in such a state, the gift does not benefit him.\n\n'Furthermore, brahmin, a certain person is a killer of living beings... and holds wrong views. With the break-up of the body, after death, he reappears in the animal realm. He sustains himself there with the food of beings in the animal realm, he subsists there by that. This, brahmin, is not a fitting condition; being in such a state, the gift does not benefit him.\n\n'Furthermore, brahmin, a certain person refrains from killing living beings, refrains from taking what is not given, refrains from sexual misconduct, refrains from false speech, refrains from divisive speech, refrains from harsh speech, refrains from idle chatter, is not covetous, has no ill will, and holds right views. With the break-up of the body, after death, he reappears in companionship with humans. He sustains himself there with the food of humans, he subsists there by that. This, brahmin, is not a fitting condition; being in such a state, the gift does not benefit him.\n\n'Furthermore, brahmin, a certain person refrains from killing living beings... and holds right views. With the break-up of the body, after death, he reappears in companionship with devas. He sustains himself there with the food of devas, he subsists there by that. This too, brahmin, is not a fitting condition, yet for one established in it, that gift does benefit him.\n\n'But here, brahmin, a certain person is a killer of living beings... and holds wrong views. With the break-up of the body, after death, he reappears in the realm of hungry ghosts. He sustains himself there with the food of beings in the realm of hungry ghosts, he subsists there by that, or he sustains himself there with whatever his friends, associates, relatives, or kin here on earth provide for him, he subsists there by that. This, brahmin, is a fitting condition; being in such a state, the gift does benefit him.'\n\n'But good Gotama, if that departed relative or kin has not reappeared in that state, who then partakes of that gift?'\n\n'Brahmin, other departed relatives or kin of his who have reappeared in that state partake of that gift.'\n\n'But good Gotama, if neither that specific departed relative nor any other departed relatives or kin of his have reappeared in that state, who then partakes of that gift?'\n\n'Brahmin, it is impossible, there is no opportunity, for that realm to be entirely empty of departed relatives or kin throughout this long course of time. Moreover, brahmin, the giver is not without fruit.'\n\n'Does the good Gotama also propose a possibility concerning a condition that is not fitting?'\n\n'Brahmin, even concerning a condition that is not fitting, I do propose a possibility. Here, brahmin, a certain person is a killer of living beings, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, engages in idle chatter, is covetous, has ill will, and holds wrong views; yet he is a giver of food, drink, clothing, vehicles, garlands, perfumes, ointments, beds, dwellings, and lights to ascetics or brahmins. With the break-up of the body, after death, he reappears in companionship with elephants. He receives food, drink, garlands, and various adornments there.\n\n'Brahmin, that he here is a killer of living beings, takes what is not given, engages in sexual misconduct, speaks falsely, speaks divisively, speaks harshly, engages in idle chatter, is covetous, has ill will, and holds wrong views—due to that, with the break-up of the body, after death, he reappears in companionship with elephants.'\n\nWhatever one gives—food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps—to recluses or brahmins, by that deed one obtains food, drink, garlands, and various ornaments in that realm.\n\nBut here, brahmin, some individual is a killer of living beings, a thief, sexually misconducting, a liar, a slanderer, one who speaks harshly, an idle chatterer, covetous, malicious, and holds wrong view. That person is a giver of food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps to recluses or brahmins. Upon the dissolution of the body, after death, that person is reborn in the company of horses, or in the company of cattle, or in the company of dogs. Even there, that person obtains food, drink, garlands, and various ornaments.\n\nIndeed, brahmin, because one here is a killer of living beings, a thief, sexually misconducting, a liar, a slanderer, one who speaks harshly, an idle chatterer, covetous, malicious, and holds wrong view, by that deed one is reborn, upon the dissolution of the body, after death, in the company of dogs. And whatever one gives—food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps—to recluses or brahmins, by that one obtains food, drink, garlands, and various ornaments in that realm.\n\nBut here, brahmin, some individual abstains from killing living beings, from stealing, from sexual misconduct, from lying, from slander, from harsh speech, from idle chatter, is not covetous, is not malicious, and holds right view. That person is a giver of food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps to recluses or brahmins. Upon the dissolution of the body, after death, that person is reborn in the company of humans. There, that person obtains the five human sense pleasures.\n\nIndeed, brahmin, because one here abstains from killing living beings, from stealing, from sexual misconduct, from lying, from slander, from harsh speech, from idle chatter, is not covetous, is not malicious, and holds right view, by that deed one is reborn, upon the dissolution of the body, after death, in the company of humans. And whatever one gives—food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps—to recluses or brahmins, by that one obtains the five human sense pleasures in that realm.\n\nBut here, brahmin, some individual abstains from killing living beings, from stealing, from sexual misconduct, from lying, from slander, from harsh speech, from idle chatter, is not covetous, is not malicious, and holds right view. That person is a giver of food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps to recluses or brahmins. Upon the dissolution of the body, after death, that person is reborn in the company of devas. There, that person obtains the five divine sense pleasures.\n\nIndeed, brahmin, because one here abstains from killing living beings, from stealing, from sexual misconduct, from lying, from slander, from harsh speech, from idle chatter, is not covetous, is not malicious, and holds right view, by that deed one is reborn, upon the dissolution of the body, after death, in the company of devas. And whatever one gives—food, drink, clothing, vehicles, garlands, perfumes, unguents, beds, dwellings, and lamps—to recluses or brahmins, by that one obtains the five divine sense pleasures in that realm. Moreover, brahmin, the giver is certainly not without fruit.\n\n“Wonderful, Venerable Gotama! Marvelous, Venerable Gotama! To such an extent, Venerable Gotama, it is indeed fitting to give gifts, fitting to perform acts of faith, since the giver is certainly not without fruit!”\n\n“So it is, brahmin. For indeed, brahmin, the giver is not without fruit.”\n\n“Excellent, Venerable Gotama! Excellent, Venerable Gotama! Just as if one were to set upright what was overturned, or to reveal what was hidden, or to show the way to one who was lost, or to hold up a lamp in the darkness so that those with eyes might see forms—in the same way has the Venerable Gotama made the Dhamma clear in various ways. I go for refuge to the Venerable Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. Let the Venerable Gotama accept me as a lay follower who has gone for refuge from this day forth as long as life lasts.”",
      "sinhala": "එවිට ජාණුස්සෝණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු, සිහි කටයුතු කථා බස් හුවමාරු කරගෙන, එකත්පස්ව වාඩි විය. එකත්පස්ව හුන් ජාණුස්සෝණි බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"භවත් ගෞතමයින් වහන්ස, අපි බ්‍රාහ්මණවරු වෙමු. දන් දෙන්නෙමු, ශ්‍රද්ධා කටයුතු කරන්නෙමු – ‘මේ දානය පේතයන්ට, ඥාති-ලේ ඥාතීන්ට උපකාර වේවා, මේ දානය පේත වූ ඥාති-ලේ ඥාතීන් පරිභෝග කරත්වා’ යනුවෙනි. භවත් ගෞතමයින් වහන්ස, ඒ දානය පේත වූ ඥාති-ලේ ඥාතීන්ට උපකාර වේද? ඒ පේත වූ ඥාති-ලේ ඥාතීන් ඒ දානය පරිභෝග කරත්ද?\" \"බ්‍රාහ්මණය, සුදුසු තැනකදී උපකාර වේ, නුසුදුසු තැනකදී නොවේ.\" \"භවත් ගෞතමයින් වහන්ස, කවරක්ද ඒ සුදුසු තැන, කවරක්ද ඒ නුසුදුසු තැන?\"\n\n\"බ්‍රාහ්මණය, මෙහිලා යම් කෙනෙක් ප්‍රාණඝාතක වන අතර, අදත්තාදායී වන අතර, කාමයන්හි වරදවා හැසිරෙන්නෙක් වන අතර, මුසාවාදී වන අතර, පිසුණාවාචී වන අතර, ඵරුසාවාචී වන අතර, සම්ඵප්පලාපී වන අතර, අභිජ්ඣා ඇතිවූවෙක් වන අතර, ව්‍යාපාද සිත් ඇතිවූවෙක් වන අතර, මිත්‍යාදෘෂ්ටික වන අතර, හෙතෙම කය බිඳීමෙන් මරණින් මතු නිරයට උපදී. නිරයේ සිටින සත්වයන්ගේ ආහාරය කවරක්ද, හෙතෙම එයින් එහි යැපේ, එයින් එහි පවතී. බ්‍රාහ්මණය, මෙයද නුසුදුසු තැනකි, එහි සිටින තැනැත්තාට ඒ දානය උපකාර නොවේ.\"\n\n\"බ්‍රාහ්මණය, මෙහිලා යම් කෙනෙක් ප්‍රාණඝාතක වන අතර... මිත්‍යාදෘෂ්ටික වන අතර, හෙතෙම කය බිඳීමෙන් මරණින් මතු තිරිසන් යෝනියට උපදී. තිරිසන් යෝනියේ සිටින සත්වයන්ගේ ආහාරය කවරක්ද, හෙතෙම එයින් එහි යැපේ, එයින් එහි පවතී. බ්‍රාහ්මණය, මෙයද නුසුදුසු තැනකි, එහි සිටින තැනැත්තාට ඒ දානය උපකාර නොවේ.\"\n\n\"බ්‍රාහ්මණය, මෙහිලා යම් කෙනෙක් ප්‍රාණඝාතයෙන් වැළකුණේ වේද, අදත්තාදානයෙන් වැළකුණේ වේද, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණේ වේද, මුසාවාදයෙන් වැළකුණේ වේද, පිසුණාවාචාවෙන් වැළකුණේ වේද, ඵරුසාවාචාවෙන් වැළකුණේ වේද, සම්ඵප්පලාපයෙන් වැළකුණේ වේද, අභිජ්ඣා රහිත වූයේ වේද, ව්‍යාපාද සිත් රහිත වූයේ වේද, සම්මාදිට්ඨික වූයේ වේද, හෙතෙම කය බිඳීමෙන් මරණින් මතු මිනිසුන්ගේ සහයෝගයට උපදී. මිනිසුන්ගේ ආහාරය කවරක්ද, හෙතෙම එයින් එහි යැපේ, එයින් එහි පවතී. බ්‍රාහ්මණය, මෙයද නුසුදුසු තැනකි, එහි සිටින තැනැත්තාට ඒ දානය උපකාර නොවේ.\"\n\n\"බ්‍රාහ්මණය, මෙහිලා යම් කෙනෙක් ප්‍රාණඝාතයෙන් වැළකුණේ වේද... සම්මාදිට්ඨික වූයේ වේද, හෙතෙම කය බිඳීමෙන් මරණින් මතු දෙවියන්ගේ සහයෝගයට උපදී. දෙවියන්ගේ ආහාරය කවරක්ද, හෙතෙම එයින් එහි යැපේ, එයින් එහි පවතී. බ්‍රාහ්මණය, මෙයද නුසුදුසු තැනකි, එහි සිටින තැනැත්තාට ඒ දානය උපකාර වේ.\"\n\n\"බ්‍රාහ්මණය, මෙහිලා යම් කෙනෙක් ප්‍රාණඝාතක වන අතර... මිත්‍යාදෘෂ්ටික වන අතර, හෙතෙම කය බිඳීමෙන් මරණින් මතු පේත ලෝකයට උපදී. පේත ලෝකයේ සිටින සත්වයන්ගේ ආහාරය කවරක්ද, හෙතෙම එයින් එහි යැපේ, එයින් එහි පවතී. එසේ නැත්නම්, මෙලොවින් යම් දෙයක් මිත්‍රයෝ හෝ අමාත්‍යයෝ හෝ ඥාති-ලේ ඥාතියෝ හෝ පරලොවට පමුණුවත්ද, හෙතෙම එයින් එහි යැපේ, එයින් එහි පවතී. බ්‍රාහ්මණය, මෙය සුදුසු තැනකි, එහි සිටින තැනැත්තාට ඒ දානය උපකාර වේ.\"\n\n\"භවත් ගෞතමයින් වහන්ස, යම් හෙයකින් ඒ පේත වූ ඥාති-ලේ ඥාතියා ඒ තැනට නොපැමිණියේ නම්, කවරෙක් ඒ දානය පරිභෝග කරත්ද?\" \"බ්‍රාහ්මණය, අන්‍ය වූද පේත ඥාති-ලේ ඥාතීන් ඒ තැනට පැමිණ සිටී නම්, ඔවුහු ඒ දානය පරිභෝග කරත්.\"\n\n\"භවත් ගෞතමයින් වහන්ස, යම් හෙයකින් ඒ පේත වූ ඥාති-ලේ ඥාතියාද ඒ තැනට නොපැමිණියේ නම්, අන්‍ය වූද පේත ඥාති-ලේ ඥාතීන් ඒ තැනට නොපැමිණියේ නම්, කවරෙක් ඒ දානය පරිභෝග කරත්ද?\" \"බ්‍රාහ්මණය, ඒ තැන මේ දීර්ඝ කාලය පුරාවට, යම්සේ පේත වූ ඥාති-ලේ ඥාතීන්ගෙන් හිස්ව තිබීම නොවිය හැකි තැනකි, එබඳු අවස්ථාවක් නැත. එසේ වුවද, බ්‍රාහ්මණය, දායකයාද අනිෂ්ඵල නොවේ.\"\n\n\"භවත් ගෞතමයින් වහන්ස, නුසුදුසු තැනකදී වුවද (දානයෙන්) ප්‍රතිඵල ඇති බවට කරුණු ඔබ වදාරන්නෙහිද?\" \"බ්‍රාහ්මණය, නුසුදුසු තැනකදී වුවද මම ප්‍රතිඵල ඇති බවට කරුණු වදාළෙමි. මෙහිලා යම් කෙනෙක් ප්‍රාණඝාතක වන අතර, අදත්තාදායී වන අතර, කාමයන්හි වරදවා හැසිරෙන්නෙක් වන අතර, මුසාවාදී වන අතර, පිසුණාවාචී වන අතර, ඵරුසාවාචී වන අතර, සම්ඵප්පලාපී වන අතර, අභිජ්ඣා ඇතිවූවෙක් වන අතර, ව්‍යාපාද සිත් ඇතිවූවෙක් වන අතර, මිත්‍යාදෘෂ්ටික වන අතර; හෙතෙම ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ අන්න-පාන, වස්ත්‍ර, යාන, මාලා-ගන්ධ-විලේපන, සයනාසන, ප්‍රදීප ආදිය දෙන දායකයෙක් වේ. හෙතෙම කය බිඳීමෙන් මරණින් මතු හස්තීන්ගේ සහයෝගයට උපදී. හෙතෙම එහිදී අන්න-පාන, මාලා-නානා-ආභරණ ලබන්නෙක් වේ.\"\n\n\"බ්‍රාහ්මණය, මෙලොව යම් කෙනෙක් ප්‍රාණඝාතක වන, අදත්තාදායී වන, කාමයන්හි වරදවා හැසිරෙන්නෙක් වන, මුසාවාදී වන, පිසුණාවාචී වන, ඵරුසාවාචී වන, සම්ඵප්පලාපී වන, අභිජ්ඣා ඇතිවූවෙක් වන, ව්‍යාපාද සිත් ඇතිවූවෙක් වන, මිත්‍යාදෘෂ්ටික වන කර්ම කරන්නේද, ඒ හේතුවෙන් හෙතෙම කය බිඳීමෙන් මරණින් මතු හස්තීන්ගේ සහයෝගයට උපදී.\"\n\nයම් දායකයෙක් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට අන්නපාන, වස්ත්‍ර, යානවාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය පූජා කරයි ද, ඒ හේතුවෙන් හෙතෙම එහිදී අන්නපාන, මල් සහ නානාවිධ ආභරණ ලබන්නෙක් වෙයි.\n\nබ්‍රාහ්මණයාණෙනි, මේ ලෝකයෙහි ඇතැම් පුද්ගලයෙක් සත්ත්ව ඝාතනයෙහි යෙදෙයි... මිත්‍යාදෘෂ්ටියෙන් යුක්ත වෙයි. හෙතෙම ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට අන්නපාන, වස්ත්‍ර, යානවාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය පූජා කරයි. හෙතෙම ශරීරය බිඳී මරණින් මතු අශ්වයන්ගේ සහවාසයට උපදී... ගවයන්ගේ සහවාසයට උපදී... බල්ලන්ගේ සහවාසයට උපදී. හෙතෙම එහිදී අන්නපාන, මල් සහ නානාවිධ ආභරණ ලබන්නෙක් වෙයි.\n\nබ්‍රාහ්මණයාණෙනි, යම් කෙනෙක් මෙලොවදී සත්ත්ව ඝාතනයෙහි යෙදෙයි... මිත්‍යාදෘෂ්ටියෙන් යුක්ත වෙයි ද, ඒ හේතුවෙන් හෙතෙම ශරීරය බිඳී මරණින් මතු බල්ලන්ගේ සහවාසයට උපදී. යම් දායකයෙක් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට අන්නපාන, වස්ත්‍ර, යානවාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය පූජා කරයි ද, ඒ හේතුවෙන් හෙතෙම එහිදී අන්නපාන, මල් සහ නානාවිධ ආභරණ ලබන්නෙක් වෙයි.\n\nබ්‍රාහ්මණයාණෙනි, මේ ලෝකයෙහි ඇතැම් පුද්ගලයෙක් සත්ත්ව ඝාතනයෙන් වැළකී... සම්මාදිට්ඨියෙන් යුක්ත වෙයි. හෙතෙම ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට අන්නපාන, වස්ත්‍ර, යානවාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය පූජා කරයි. හෙතෙම ශරීරය බිඳී මරණින් මතු මිනිසුන්ගේ සහවාසයට උපදී. හෙතෙම එහිදී මනුෂ්‍ය පඤ්ච කාමගුණ ලබන්නෙක් වෙයි.\n\nබ්‍රාහ්මණයාණෙනි, යම් කෙනෙක් මෙලොවදී සත්ත්ව ඝාතනයෙන් වැළකී... සම්මාදිට්ඨියෙන් යුක්ත වෙයි ද, ඒ හේතුවෙන් හෙතෙම ශරීරය බිඳී මරණින් මතු මිනිසුන්ගේ සහවාසයට උපදී. යම් දායකයෙක් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට අන්නපාන, වස්ත්‍ර, යානවාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය පූජා කරයි ද, ඒ හේතුවෙන් හෙතෙම එහිදී මනුෂ්‍ය පඤ්ච කාමගුණ ලබන්නෙක් වෙයි.\n\nබ්‍රාහ්මණයාණෙනි, මේ ලෝකයෙහි ඇතැම් පුද්ගලයෙක් සත්ත්ව ඝාතනයෙන් වැළකී... සම්මාදිට්ඨියෙන් යුක්ත වෙයි. හෙතෙම ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට අන්නපාන, වස්ත්‍ර, යානවාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය පූජා කරයි. හෙතෙම ශරීරය බිඳී මරණින් මතු දෙවියන්ගේ සහවාසයට උපදී. හෙතෙම එහිදී දිව්‍ය පඤ්ච කාමගුණ ලබන්නෙක් වෙයි.\n\nබ්‍රාහ්මණයාණෙනි, යම් කෙනෙක් මෙලොවදී සත්ත්ව ඝාතනයෙන් වැළකී... සම්මාදිට්ඨියෙන් යුක්ත වෙයි ද, ඒ හේතුවෙන් හෙතෙම ශරීරය බිඳී මරණින් මතු දෙවියන්ගේ සහවාසයට උපදී. යම් දායකයෙක් ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට අන්නපාන, වස්ත්‍ර, යානවාහන, මල්, සුවඳ විලවුන්, සයනාසන, වාසස්ථාන, පහන් ආදිය පූජා කරයි ද, ඒ හේතුවෙන් හෙතෙම එහිදී දිව්‍ය පඤ්ච කාමගුණ ලබන්නෙක් වෙයි.\n\nතවද, බ්‍රාහ්මණයාණෙනි, දායකයාගේ ද දානය නිෂ්ඵල නොවේ. ‘‘ආශ්චර්යයයි භවත් ගෞතමයින් වහන්ස, පුදුම සහගතයි භවත් ගෞතමයින් වහන්ස! භවත් ගෞතමයින් වහන්ස, දායකයා ද නිෂ්ඵල නොවන හෙයින් දන් දීමටත්, ශ්‍රද්ධාව ඇති කර ගැනීමටත් මේ දානය ම ප්‍රමාණවත් වේ!” ‘‘බ්‍රාහ්මණයාණෙනි, එසේය. බ්‍රාහ්මණයාණෙනි, දායකයා ද නිෂ්ඵල නොවේ.” ‘‘ඉතා ශ්‍රේෂ්ඨයි භවත් ගෞතමයින් වහන්ස, ඉතා ශ්‍රේෂ්ඨයි භවත් ගෞතමයින් වහන්ස! ... අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස භවත් ගෞතමයින් වහන්සේ මා පිළිගන්නා සේක්වා!” එකොළොස්වැන්නයි.",
      "paliTitle": "Jāṇussoṇisuttaṃ",
      "englishTitle": "Jāṇussoṇi Sutta",
      "sinhalaTitle": "ජාණුස්සෝණි සූත්‍රය"
    }
  ],
  "footer": {
    "pali": " Jāṇussoṇivaggo [yamakavaggo (ka.)] dutiyo.",
    "english": "The Second Jāṇussoṇī Chapter",
    "sinhala": "ජාණුස‍්සෝණි වග‍්ගය, දෙවැනි"
  }
}