{
  "id": "an10.1",
  "title": {
    "pali": "Ānisaṃsavaggo",
    "english": "The Chapter on Benefits",
    "sinhala": "ආනිසංස වග්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Kimatthiyāni, bhante, kusalāni sīlāni kimānisaṃsānī’’ti? ‘‘Avippaṭisāratthāni kho, ānanda, kusalāni sīlāni avippaṭisārānisaṃsānī’’ti. ‘‘Avippaṭisāro pana, bhante, kimatthiyo kimānisaṃso’’ti? ‘‘Avippaṭisāro kho, ānanda, pāmojjattho pāmojjānisaṃso’’ti [pāmujjattho pāmujjānisaṃsoti (sī. syā. pī.) a. ni. 11.1]. ‘‘Pāmojjaṃ pana, bhante, kimatthiyaṃ kimānisaṃsa’’nti? ‘‘Pāmojjaṃ kho, ānanda, pītatthaṃ pītānisaṃsa’’nti. ‘‘Pīti pana, bhante, kimatthiyā kimānisaṃsā’’ti? ‘‘Pīti kho, ānanda, passaddhatthā passaddhānisaṃsā’’ti. ‘‘Passaddhi pana, bhante, kimatthiyā kimānisaṃsā’’ti? ‘‘Passaddhi kho, ānanda, sukhatthā sukhānisaṃsā’’ti. ‘‘Sukhaṃ pana, bhante, kimatthiyaṃ kimānisaṃsa’’nti? ‘‘Sukhaṃ kho, ānanda, samādhatthaṃ samādhānisaṃsa’’nti. ‘‘Samādhi pana, bhante, kimatthiyo kimānisaṃso’’ti? ‘‘Samādhi kho, ānanda, yathābhūtañāṇadassanattho yathābhūtañāṇadassanānisaṃso’’ti. ‘‘Yathābhūtañāṇadassanaṃ pana, bhante, kimatthiyaṃ kimānisaṃsa’’nti? ‘‘Yathābhūtañāṇadassanaṃ kho, ānanda, nibbidāvirāgatthaṃ nibbidāvirāgānisaṃsa’’nti. ‘‘Nibbidāvirāgo pana, bhante kimatthiyo kimānisaṃso’’ti? ‘‘Nibbidāvirāgo kho, ānanda, vimuttiñāṇadassanattho vimuttiñāṇadassanānisaṃso [… nisaṃsoti (sī. ka.)]. ‘‘Iti kho, ānanda, kusalāni sīlāni avippaṭisāratthāni avippaṭisārānisaṃsāni; avippaṭisāro pāmojjattho pāmojjānisaṃso; pāmojjaṃ pītatthaṃ pītānisaṃsaṃ; pīti passaddhatthā passaddhānisaṃsā; passaddhi sukhatthā sukhānisaṃsā; sukhaṃ samādhatthaṃ samādhānisaṃsaṃ; samādhi yathābhūtañāṇadassanattho yathābhūtañāṇadassanānisaṃso; yathābhūtañāṇadassanaṃ nibbidāvirāgatthaṃ nibbidāvirāgānisaṃsaṃ; nibbidāvirāgo vimuttiñāṇadassanattho vimuttiñāṇadassanānisaṃso. Iti kho, ānanda, kusalāni sīlāni anupubbena aggāya parentī’’ti [arahattāya pūrentīti (syā.)]. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Savatthi at Jeta's Grove, Anathapindika's park. Then the Venerable Ananda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the Venerable Ananda said to the Blessed One: \"For what purpose, Venerable Sir, are skillful conduct, and what are their benefits?\" \"Skillful conduct, Ananda, has the purpose of non-regret and non-regret as its benefit.\" \"And what, Venerable Sir, is the purpose and benefit of non-regret?\" \"Non-regret, Ananda, has the purpose of joy and joy as its benefit.\" \"And what, Venerable Sir, is the purpose and benefit of joy?\" \"Joy, Ananda, has the purpose of rapture and rapture as its benefit.\" \"And what, Venerable Sir, is the purpose and benefit of rapture?\" \"Rapture, Ananda, has the purpose of tranquility and tranquility as its benefit.\" \"And what, Venerable Sir, is the purpose and benefit of tranquility?\" \"Tranquility, Ananda, has the purpose of happiness and happiness as its benefit.\" \"And what, Venerable Sir, is the purpose and benefit of happiness?\" \"Happiness, Ananda, has the purpose of concentration and concentration as its benefit.\" \"And what, Venerable Sir, is the purpose and benefit of concentration?\" \"Concentration, Ananda, has the purpose of knowledge and vision of things as they truly are, and knowledge and vision of things as they truly are as its benefit.\" \"And what, Venerable Sir, is the purpose and benefit of knowledge and vision of things as they truly are?\" \"Knowledge and vision of things as they truly are, Ananda, has the purpose of dispassion and detachment, and dispassion and detachment as its benefit.\" \"And what, Venerable Sir, is the purpose and benefit of dispassion and detachment?\" \"Dispassion and detachment, Ananda, has the purpose of knowledge and vision of liberation, and knowledge and vision of liberation as its benefit.\" Thus, Ananda, skillful conduct has the purpose of non-regret and non-regret as its benefit; non-regret has the purpose of joy and joy as its benefit; joy has the purpose of rapture and rapture as its benefit; rapture has the purpose of tranquility and tranquility as its benefit; tranquility has the purpose of happiness and happiness as its benefit; happiness has the purpose of concentration and concentration as its benefit; concentration has the purpose of knowledge and vision of things as they truly are and knowledge and vision of things as they truly are as its benefit; knowledge and vision of things as they truly are has the purpose of dispassion and detachment and dispassion and detachment as its benefit; dispassion and detachment has the purpose of knowledge and vision of liberation and knowledge and vision of liberation as its benefit. In this way, Ananda, skillful conduct gradually leads to the highest goal.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹියහ; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව හුන්හ.\n\nඑකත්පස්ව හුන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසුවාහුය: \"භන්තෙ, කුසල සිල්වල අරමුණ කුමක්ද? කුසල සිල්වල ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, කුසල සිල් අවිප්පටිසාරය (පසුතැවීමක් නැතිකම) අරමුණු කොට ඇත්තේය; අවිප්පටිසාරය එහි ආනිසංසය වේ.\" \"භන්තෙ, අවිප්පටිසාරයෙහි අරමුණ කුමක්ද? එහි ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, අවිප්පටිසාරය ප්‍රමෝදය (ප්‍රීතිය, සතුට) අරමුණු කොට ඇත්තේය; ප්‍රමෝදය එහි ආනිසංසය වේ.\" \"භන්තෙ, ප්‍රමෝදයෙහි අරමුණ කුමක්ද? එහි ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, ප්‍රමෝදය ප්‍රීතිය (ආධ්‍යාත්මික ප්‍රීතිය) අරමුණු කොට ඇත්තේය; ප්‍රීතිය එහි ආනිසංසය වේ.\" \"භන්තෙ, ප්‍රීතියෙහි අරමුණ කුමක්ද? එහි ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, ප්‍රීතිය පස්සද්ධිය (කයේ හා සිතේ සන්සිඳීම) අරමුණු කොට ඇත්තේය; පස්සද්ධිය එහි ආනිසංසය වේ.\" \"භන්තෙ, පස්සද්ධියෙහි අරමුණ කුමක්ද? එහි ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, පස්සද්ධිය සැපය අරමුණු කොට ඇත්තේය; සැපය එහි ආනිසංසය වේ.\" \"භන්තෙ, සැපයෙහි අරමුණ කුමක්ද? එහි ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, සැපය සමාධිය (එකඟ වූ සිත) අරමුණු කොට ඇත්තේය; සමාධිය එහි ආනිසංසය වේ.\" \"භන්තෙ, සමාධියෙහි අරමුණ කුමක්ද? එහි ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, සමාධිය යථාභූත ඤාණ දර්ශනය (ඇති සැටියෙන් දත හැකි ප්‍රඥාව) අරමුණු කොට ඇත්තේය; යථාභූත ඤාණ දර්ශනය එහි ආනිසංසය වේ.\" \"භන්තෙ, යථාභූත ඤාණ දර්ශනයෙහි අරමුණ කුමක්ද? එහි ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, යථාභූත ඤාණ දර්ශනය නිබ්බිදාවට හා විරාගයට (ලෝක ස්වභාවය පිළිබඳ කලකිරීමට හා නොඇලීමට) අරමුණු කොට ඇත්තේය; නිබ්බිදාව හා විරාගය එහි ආනිසංසය වේ.\" \"භන්තෙ, නිබ්බිදාව හා විරාගයෙහි අරමුණ කුමක්ද? එහි ආනිසංසය කුමක්ද?\" \"ආනන්දයෙනි, නිබ්බිදාව හා විරාගය විමුක්ති ඤාණ දර්ශනයට (අරහත් මාර්ග ඵල ඤාණයට) අරමුණු කොට ඇත්තේය; විමුක්ති ඤාණ දර්ශනය එහි ආනිසංසය වේ.\"\n\n\"ආනන්දයෙනි, මෙසේ කුසල සිල් අවිප්පටිසාරය අරමුණු කොට ඇත්තේය, අවිප්පටිසාරය එහි ආනිසංසය වේ; අවිප්පටිසාරය ප්‍රමෝදය අරමුණු කොට ඇත්තේය, ප්‍රමෝදය එහි ආනිසංසය වේ; ප්‍රමෝදය ප්‍රීතිය අරමුණු කොට ඇත්තේය, ප්‍රීතිය එහි ආනිසංසය වේ; ප්‍රීතිය පස්සද්ධිය අරමුණු කොට ඇත්තේය, පස්සද්ධිය එහි ආනිසංසය වේ; පස්සද්ධිය සැපය අරමුණු කොට ඇත්තේය, සැපය එහි ආනිසංසය වේ; සැපය සමාධිය අරමුණු කොට ඇත්තේය, සමාධිය එහි ආනිසංසය වේ; සමාධිය යථාභූත ඤාණ දර්ශනය අරමුණු කොට ඇත්තේය, යථාභූත ඤාණ දර්ශනය එහි ආනිසංසය වේ; යථාභූත ඤාණ දර්ශනය නිබ්බිදාව හා විරාගය අරමුණු කොට ඇත්තේය, නිබ්බිදාව හා විරාගය එහි ආනිසංසය වේ; නිබ්බිදාව හා විරාගය විමුක්ති ඤාණ දර්ශනය අරමුණු කොට ඇත්තේය, විමුක්ති ඤාණ දර්ශනය එහි ආනිසංසය වේ. ආනන්දයෙනි, මෙසේ කුසල සිල් අනුපිළිවෙළින් උසස්ම අරමුණ (රහත්ඵලය) කරා පමුණුවන්නේය.\"",
      "paliTitle": "Kimatthiyasuttaṃ",
      "englishTitle": "The Discourse on What Purpose",
      "sinhalaTitle": "කිමත්‍ථිය සූත්‍රය"
    },
    {
      "number": 2,
      "pali": "[a. ni. 11.2] ‘‘Sīlavato, bhikkhave, sīlasampannassa na cetanāya karaṇīyaṃ – ‘avippaṭisāro me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṃ sīlavato sīlasampannassa avippaṭisāro uppajjati. Avippaṭisārissa, bhikkhave, na cetanāya karaṇīyaṃ – ‘pāmojjaṃ me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṃ avippaṭisārissa pāmojjaṃ jāyati. Pamuditassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘pīti me uppajjatū’ti. Dhammatā esā, bhikkhave, yaṃ pamuditassa pīti uppajjati. Pītimanassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘kāyo me passambhatū’ti. Dhammatā esā, bhikkhave, yaṃ pītimanassa kāyo passambhati. Passaddhakāyassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘sukhaṃ vediyāmī’ti. Dhammatā esā, bhikkhave, yaṃ passaddhakāyo sukhaṃ vediyati. Sukhino, bhikkhave, na cetanāya karaṇīyaṃ – ‘cittaṃ me samādhiyatū’ti. Dhammatā esā, bhikkhave, yaṃ sukhino cittaṃ samādhiyati. Samāhitassa, bhikkhave, na cetanāya karaṇīyaṃ – ‘yathābhūtaṃ jānāmi passāmī’ti. Dhammatā esā, bhikkhave, yaṃ samāhito yathābhūtaṃ jānāti passati. Yathābhūtaṃ, bhikkhave, jānato passato na cetanāya karaṇīyaṃ – ‘nibbindāmi virajjāmī’ti. Dhammatā esā, bhikkhave, yaṃ yathābhūtaṃ jānaṃ passaṃ nibbindati virajjati. Nibbinnassa [nibbindassa (sī. ka.)], bhikkhave, virattassa na cetanāya karaṇīyaṃ – ‘vimuttiñāṇadassanaṃ sacchikaromī’ti. Dhammatā esā, bhikkhave, yaṃ nibbinno [nibbindo (sī. ka.)] viratto vimuttiñāṇadassanaṃ sacchikaroti. ‘‘Iti kho, bhikkhave, nibbidāvirāgo vimuttiñāṇadassanattho vimuttiñāṇadassanānisaṃso; yathābhūtañāṇadassanaṃ nibbidāvirāgatthaṃ nibbidāvirāgānisaṃsaṃ; samādhi yathābhūtañāṇadassanattho yathābhūtañāṇadassanānisaṃso; sukhaṃ samādhatthaṃ samādhānisaṃsaṃ; passaddhi sukhatthā sukhānisaṃsā; pīti passaddhatthā passaddhānisaṃsā; pāmojjaṃ pītatthaṃ pītānisaṃsaṃ; avippaṭisāro pāmojjattho pāmojjānisaṃso; kusalāni sīlāni avippaṭisāratthāni avippaṭisārānisaṃsāni. Iti kho, bhikkhave, dhammā dhamme abhisandenti, dhammā dhamme paripūrenti apārā pāraṃ gamanāyā’’ti. Dutiyaṃ.",
      "english": "Monks, for a virtuous person, one accomplished in virtue, there is no need to intend, ‘May freedom from remorse arise in me.’ It is a natural law, Monks, that for a virtuous person, one accomplished in virtue, freedom from remorse arises. Monks, for one free from remorse, there is no need to intend, ‘May joy arise in me.’ It is a natural law, Monks, that for one free from remorse, joy is born. Monks, for one who is joyful, there is no need to intend, ‘May rapture arise in me.’ It is a natural law, Monks, that for one who is joyful, rapture arises. Monks, for one whose mind is filled with rapture, there is no need to intend, ‘May my body become tranquil.’ It is a natural law, Monks, that for one whose mind is filled with rapture, the body becomes tranquil. Monks, for one whose body is tranquil, there is no need to intend, ‘May I experience happiness.’ It is a natural law, Monks, that one whose body is tranquil experiences happiness. Monks, for one who is happy, there is no need to intend, ‘May my mind become concentrated.’ It is a natural law, Monks, that for one who is happy, the mind becomes concentrated. Monks, for one whose mind is concentrated, there is no need to intend, ‘May I know and see things as they really are.’ It is a natural law, Monks, that one whose mind is concentrated knows and sees things as they really are. Monks, for one who knows and sees things as they really are, there is no need to intend, ‘May I experience disenchantment and dispassion.’ It is a natural law, Monks, that one who knows and sees things as they really are becomes disenchanted and dispassionate. Monks, for one who is disenchanted and dispassionate, there is no need to intend, ‘May I realize the knowledge and vision of liberation.’ It is a natural law, Monks, that one who is disenchanted and dispassionate realizes the knowledge and vision of liberation.\n\nThus, Monks, disenchantment and dispassion have the knowledge and vision of liberation as their purpose and as their benefit; the knowledge and vision of things as they really are have disenchantment and dispassion as their purpose and as their benefit; concentration has the knowledge and vision of things as they really are as its purpose and as its benefit; happiness has concentration as its purpose and as its benefit; tranquility has happiness as its purpose and as its benefit; rapture has tranquility as its purpose and as its benefit; joy has rapture as its purpose and as its benefit; freedom from remorse has joy as its purpose and as its benefit; and wholesome virtues have freedom from remorse as their purpose and as their benefit. Thus, Monks, one state flows into another state, and one state fulfills another state, for the purpose of going from the near shore to the far shore.",
      "sinhala": "භික්‍ෂූණි, සීලවත් වූ, සීල සම්පූර්ණ පුද්ගලයාට 'මා තුළ විපිළිසර බවක් ඇති වේවා' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, සීලවත් වූ, සීල සම්පූර්ණ පුද්ගලයාට විපිළිසර බවක් ඇති නොවීම ඇතිවීම ස්වභාවික ධර්මතාවකි. භික්‍ෂූණි, විපිළිසර බවක් නැති පුද්ගලයාට 'මා තුළ ප\\u200d්‍රමෝදය ඇති වේවා' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, විපිළිසර බවක් නැති පුද්ගලයාට ප\\u200d්‍රමෝදය හටගැනීම ස්වභාවික ධර්මතාවකි. භික්‍ෂූණි, ප\\u200d්‍රමුදිත වූ පුද්ගලයාට 'මා තුළ ප\\u200d්‍රීතිය ඇති වේවා' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, ප\\u200d්‍රමුදිත වූ පුද්ගලයාට ප\\u200d්‍රීතිය ඇතිවීම ස්වභාවික ධර්මතාවකි. භික්‍ෂූණි, ප\\u200d්‍රීතිමත් වූ පුද්ගලයාට 'මාගේ කය සංසිඳේවා' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, ප\\u200d්‍රීතිමත් වූ පුද්ගලයාගේ කය සංසිඳීම ස්වභාවික ධර්මතාවකි. භික්‍ෂූණි, සංසිඳුණු කයක් ඇති පුද්ගලයාට 'මම සැපයක් විඳිමි' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, සංසිඳුණු කයක් ඇති පුද්ගලයා සැපයක් විඳීම ස්වභාවික ධර්මතාවකි. භික්‍ෂූණි, සැපයෙන් යුක්ත වූ පුද්ගලයාට 'මාගේ සිත සමාධිමත් වේවා' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, සැපයෙන් යුක්ත වූ පුද්ගලයාගේ සිත සමාධිමත් වීම ස්වභාවික ධර්මතාවකි. භික්‍ෂූණි, සමාධිමත් වූ පුද්ගලයාට 'මම යථාභූත ඥානයෙන් දනිමි, දකිමි' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, සමාධිමත් වූ පුද්ගලයා යථාභූත ඥානයෙන් දැනීම හා දැකීම ස්වභාවික ධර්මතාවකි. භික්‍ෂූණි, යථාභූත ඥානයෙන් දන්නා, දකින පුද්ගලයාට 'මම කළකිරීමට පත් වෙමි, නොඇලීමට පත් වෙමි' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, යථාභූත ඥානයෙන් දන්නා, දකින පුද්ගලයා කළකිරීමට පත්වීම හා නොඇලීමට පත්වීම ස්වභාවික ධර්මතාවකි. භික්‍ෂූණි, කළකිරුණු, නොඇලුනු පුද්ගලයාට 'මම විමුක්ති ඥාන දර්ශනය සාක්‍ෂාත් කරමි' යනුවෙන් චේතනාවෙන් කළ යුතු දෙයක් නැත. භික්‍ෂූණි, කළකිරුණු, නොඇලුනු පුද්ගලයා විමුක්ති ඥාන දර්ශනය සාක්‍ෂාත් කිරීම ස්වභාවික ධර්මතාවකි.\n\nභික්‍ෂූණි, මේ අයුරින් කළකිරීම හා නොඇලීම විමුක්ති ඥාන දර්ශනය පිණිස පවතී, විමුක්ති ඥාන දර්ශනයේ ආනිශංසය වෙයි. යථාභූත ඥාන දර්ශනය කළකිරීම හා නොඇලීම පිණිස පවතී, කළකිරීමේ හා නොඇලීමේ ආනිශංසය වෙයි. සමාධිය යථාභූත ඥාන දර්ශනය පිණිස පවතී, යථාභූත ඥාන දර්ශනයේ ආනිශංසය වෙයි. සැපය සමාධිය පිණිස පවතී, සමාධියේ ආනිශංසය වෙයි. ප\\u200d්‍රශ\\u200d්‍රබ්ධිය සැපය පිණිස පවතී, සැපයේ ආනිශංසය වෙයි. ප\\u200d්‍රීතිය ප\\u200d්‍රශ\\u200d්‍රබ්ධිය පිණිස පවතී, ප\\u200d්‍රශ\\u200d්‍රබ්ධියේ ආනිශංසය වෙයි. ප\\u200d්‍රමෝදය ප\\u200d්‍රීතිය පිණිස පවතී, ප\\u200d්‍රීතියේ ආනිශංසය වෙයි. විපිළිසර නොවීම ප\\u200d්‍රමෝදය පිණිස පවතී, ප\\u200d්‍රමෝදයේ ආනිශංසය වෙයි. කුසල සීලය විපිළිසර නොවීම පිණිස පවතී, විපිළිසර නොවීමෙහි ආනිශංසය වෙයි. භික්‍ෂූණි, මේ අයුරින් ධර්මයන් ධර්මයන් හා සම්බන්ධ වී, (සංසාරයේ) මෙතෙරින් එතෙරට යාම පිණිස, ධර්මයන් ධර්මයන් සම්පූර්ණ කරයි.",
      "paliTitle": "Cetanākaraṇīyasuttaṃ",
      "englishTitle": "Discourse on Volitional Duties",
      "sinhalaTitle": "චේතනා කළයුතු සූත්‍රය"
    },
    {
      "number": 3,
      "pali": "[a. ni. 5.24; 11.3] ‘‘Dussīlassa, bhikkhave, sīlavipannassa hatūpaniso hoti avippaṭisāro; avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti pāmojjaṃ; pāmojje asati pāmojjavipannassa hatūpanisā hoti pīti; pītiyā asati pītivipannassa hatūpanisā hoti passaddhi; passaddhiyā asati passaddhivipannassa hatūpanisaṃ hoti sukhaṃ; sukhe asati sukhavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, dussīlassa sīlavipannassa hatūpaniso hoti avippaṭisāro; avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti…pe… vimuttiñāṇadassanaṃ. ‘‘Sīlavato, bhikkhave, sīlasampannassa upanisasampanno hoti avippaṭisāro; avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti pāmojjaṃ; pāmojje sati pāmojjasampannassa upanisasampannā hoti pīti; pītiyā sati pītisampannassa upanisasampannā hoti passaddhi; passaddhiyā sati passaddhisampannassa upanisasampannaṃ hoti sukhaṃ; sukhe sati sukhasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, bhikkhave, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, bhikkhave, sīlavato sīlasampannassa upanisasampanno hoti avippaṭisāro; avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti…pe… vimuttiñāṇadassana’’nti. Tatiyaṃ.",
      "english": "Monks, for one who is unvirtuous, deficient in virtue, there is no foundation for non-remorse. When non-remorse is absent, for one deficient in non-remorse, there is no foundation for joy. When joy is absent, for one deficient in joy, there is no foundation for rapture. When rapture is absent, for one deficient in rapture, there is no foundation for tranquility. When tranquility is absent, for one deficient in tranquility, there is no foundation for happiness. When happiness is absent, for one deficient in happiness, there is no foundation for right concentration. When right concentration is absent, for one deficient in right concentration, there is no foundation for knowledge and vision of things as they truly are. When knowledge and vision of things as they truly are is absent, for one deficient in knowledge and vision of things as they truly are, there is no foundation for disenchantment and dispassion. When disenchantment and dispassion is absent, for one deficient in disenchantment and dispassion, there is no foundation for knowledge and vision of liberation.\n\nJust as, monks, a tree devoid of branches and leaves: its outer bark does not come to full development, nor does its inner bark, nor its sapwood, nor its heartwood come to full development. In the same way, monks, for one who is unvirtuous, deficient in virtue, there is no foundation for non-remorse. When non-remorse is absent, for one deficient in non-remorse, there is no foundation for joy. When joy is absent, for one deficient in joy, there is no foundation for rapture. When rapture is absent, for one deficient in rapture, there is no foundation for tranquility. When tranquility is absent, for one deficient in tranquility, there is no foundation for happiness. When happiness is absent, for one deficient in happiness, there is no foundation for right concentration. When right concentration is absent, for one deficient in right concentration, there is no foundation for knowledge and vision of things as they truly are. When knowledge and vision of things as they truly are is absent, for one deficient in knowledge and vision of things as they truly are, there is no foundation for disenchantment and dispassion. When disenchantment and dispassion is absent, for one deficient in disenchantment and dispassion, there is no foundation for knowledge and vision of liberation.\n\nMonks, for one who is virtuous, accomplished in virtue, there is a perfected foundation for non-remorse. When non-remorse is present, for one accomplished in non-remorse, there is a perfected foundation for joy. When joy is present, for one accomplished in joy, there is a perfected foundation for rapture. When rapture is present, for one accomplished in rapture, there is a perfected foundation for tranquility. When tranquility is present, for one accomplished in tranquility, there is a perfected foundation for happiness. When happiness is present, for one accomplished in happiness, there is a perfected foundation for right concentration. When right concentration is present, for one accomplished in right concentration, there is a perfected foundation for knowledge and vision of things as they truly are. When knowledge and vision of things as they truly are is present, for one accomplished in knowledge and vision of things as they truly are, there is a perfected foundation for disenchantment and dispassion. When disenchantment and dispassion is present, for one accomplished in disenchantment and dispassion, there is a perfected foundation for knowledge and vision of liberation.\n\nJust as, monks, a tree endowed with branches and leaves: its outer bark comes to full development, and its inner bark, and its sapwood, and its heartwood come to full development. In the same way, monks, for one who is virtuous, accomplished in virtue, there is a perfected foundation for non-remorse. When non-remorse is present, for one accomplished in non-remorse, there is a perfected foundation for joy. When joy is present, for one accomplished in joy, there is a perfected foundation for rapture. When rapture is present, for one accomplished in rapture, there is a perfected foundation for tranquility. When tranquility is present, for one accomplished in tranquility, there is a perfected foundation for happiness. When happiness is present, for one accomplished in happiness, there is a perfected foundation for right concentration. When right concentration is present, for one accomplished in right concentration, there is a perfected foundation for knowledge and vision of things as they truly are. When knowledge and vision of things as they truly are is present, for one accomplished in knowledge and vision of things as they truly are, there is a perfected foundation for disenchantment and dispassion. When disenchantment and dispassion is present, for one accomplished in disenchantment and dispassion, there is a perfected foundation for knowledge and vision of liberation.",
      "sinhala": "භික්ෂූණි, දුශ්ශීල වූ, සීලයෙන් පිරිහී ගිය පුද්ගලයාට අවිප්‍රතිසාරය සඳහා වූ උපනිශ්‍රය නැති වී යයි. අවිප්‍රතිසාරය නැති කල්හි, අවිප්‍රතිසාරයෙන් පිරිහී ගිය පුද්ගලයාට ප්‍රමෝදය සඳහා වූ උපනිශ්‍රය නැති වී යයි. ප්‍රමෝදය නැති කල්හි, ප්‍රමෝදයෙන් පිරිහී ගිය පුද්ගලයාට ප්‍රීතිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. ප්‍රීතිය නැති කල්හි, ප්‍රීතියෙන් පිරිහී ගිය පුද්ගලයාට පස්සද්ධිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. පස්සද්ධිය නැති කල්හි, පස්සද්ධියෙන් පිරිහී ගිය පුද්ගලයාට සුවය සඳහා වූ උපනිශ්‍රය නැති වී යයි. සුවය නැති කල්හි, සුවයෙන් පිරිහී ගිය පුද්ගලයාට සම්‍යක් සමාධිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. සම්‍යක් සමාධිය නැති කල්හි, සම්‍යක් සමාධියෙන් පිරිහී ගිය පුද්ගලයාට යථාභූත ඤාණ දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි. යථාභූත ඤාණ දර්ශනය නැති කල්හි, යථාභූත ඤාණ දර්ශනයෙන් පිරිහී ගිය පුද්ගලයාට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය නැති වී යයි. නිබ්බිදා විරාගය නැති කල්හි, නිබ්බිදා විරාගයෙන් පිරිහී ගිය පුද්ගලයාට විමුක්ති ඤාණ දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි.\n\nභික්ෂූණි, යම් සේ අතු පත්‍ර නැති වූ ගසක පිට පොත්තද, ඇතුල් පොත්තද, පොත්ත අරටුවද, අරටුවද සම්පූර්ණ නොවේද, ඒ ආකාරයෙන්ම භික්ෂූණි, දුශ්ශීල වූ, සීලයෙන් පිරිහී ගිය පුද්ගලයාට අවිප්‍රතිසාරය සඳහා වූ උපනිශ්‍රය නැති වී යයි. අවිප්‍රතිසාරය නැති කල්හි, අවිප්‍රතිසාරයෙන් පිරිහී ගිය පුද්ගලයාට ප්‍රමෝදය සඳහා වූ උපනිශ්‍රය නැති වී යයි. ප්‍රමෝදය නැති කල්හි, ප්‍රමෝදයෙන් පිරිහී ගිය පුද්ගලයාට ප්‍රීතිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. ප්‍රීතිය නැති කල්හි, ප්‍රීතියෙන් පිරිහී ගිය පුද්ගලයාට පස්සද්ධිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. පස්සද්ධිය නැති කල්හි, පස්සද්ධියෙන් පිරිහී ගිය පුද්ගලයාට සුවය සඳහා වූ උපනිශ්‍රය නැති වී යයි. සුවය නැති කල්හි, සුවයෙන් පිරිහී ගිය පුද්ගලයාට සම්‍යක් සමාධිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. සම්‍යක් සමාධිය නැති කල්හි, සම්‍යක් සමාධියෙන් පිරිහී ගිය පුද්ගලයාට යථාභූත ඤාණ දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි. යථාභූත ඤාණ දර්ශනය නැති කල්හි, යථාභූත ඤාණ දර්ශනයෙන් පිරිහී ගිය පුද්ගලයාට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය නැති වී යයි. නිබ්බිදා විරාගය නැති කල්හි, නිබ්බිදා විරාගයෙන් පිරිහී ගිය පුද්ගලයාට විමුක්ති ඤාණ දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි.\n\nභික්ෂූණි, සීලවන්ත වූ, සීලයෙන් යුක්ත වූ පුද්ගලයාට අවිප්‍රතිසාරය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. අවිප්‍රතිසාරය ඇති කල්හි, අවිප්‍රතිසාරයෙන් යුක්ත වූ පුද්ගලයාට ප්‍රමෝදය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. ප්‍රමෝදය ඇති කල්හි, ප්‍රමෝදයෙන් යුක්ත වූ පුද්ගලයාට ප්‍රීතිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. ප්‍රීතිය ඇති කල්හි, ප්‍රීතියෙන් යුක්ත වූ පුද්ගලයාට පස්සද්ධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. පස්සද්ධිය ඇති කල්හි, පස්සද්ධියෙන් යුක්ත වූ පුද්ගලයාට සුවය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. සුවය ඇති කල්හි, සුවයෙන් යුක්ත වූ පුද්ගලයාට සම්‍යක් සමාධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. සම්‍යක් සමාධිය ඇති කල්හි, සම්‍යක් සමාධියෙන් යුක්ත වූ පුද්ගලයාට යථාභූත ඤාණ දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. යථාභූත ඤාණ දර්ශනය ඇති කල්හි, යථාභූත ඤාණ දර්ශනයෙන් යුක්ත වූ පුද්ගලයාට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගයෙන් යුක්ත වූ පුද්ගලයාට විමුක්ති ඤාණ දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ.\n\nභික්ෂූණි, යම් සේ අතු පත්‍රවලින් යුක්ත වූ ගසක පිට පොත්තද, ඇතුල් පොත්තද, පොත්ත අරටුවද, අරටුවද සම්පූර්ණ වේද, ඒ ආකාරයෙන්ම භික්ෂූණි, සීලවන්ත වූ, සීලයෙන් යුක්ත වූ පුද්ගලයාට අවිප්‍රතිසාරය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. අවිප්‍රතිසාරය ඇති කල්හි, අවිප්‍රතිසාරයෙන් යුක්ත වූ පුද්ගලයාට ප්‍රමෝදය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. ප්‍රමෝදය ඇති කල්හි, ප්‍රමෝදයෙන් යුක්ත වූ පුද්ගලයාට ප්‍රීතිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. ප්‍රීතිය ඇති කල්හි, ප්‍රීතියෙන් යුක්ත වූ පුද්ගලයාට පස්සද්ධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. පස්සද්ධිය ඇති කල්හි, පස්සද්ධියෙන් යුක්ත වූ පුද්ගලයාට සුවය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. සුවය ඇති කල්හි, සුවයෙන් යුක්ත වූ පුද්ගලයාට සම්‍යක් සමාධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. සම්‍යක් සමාධිය ඇති කල්හි, සම්‍යක් සමාධියෙන් යුක්ත වූ පුද්ගලයාට යථාභූත ඤාණ දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. යථාභූත ඤාණ දර්ශනය ඇති කල්හි, යථාභූත ඤාණ දර්ශනයෙන් යුක්ත වූ පුද්ගලයාට නිබ්බිදා විරාගය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ. නිබ්බිදා විරාගය ඇති කල්හි, නිබ්බිදා විරාගයෙන් යුක්ත වූ පුද්ගලයාට විමුක්ති ඤාණ දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වේ.",
      "paliTitle": "Paṭhamaupanisasuttaṃ",
      "englishTitle": "The First Requisite Discourse",
      "sinhalaTitle": "පඨම උපනිසා සූත්‍රය"
    },
    {
      "number": 4,
      "pali": "[a. ni. 11.4] Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘dussīlassa, āvuso, sīlavipannassa hatūpaniso hoti avippaṭisāro; avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti…pe… vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, āvuso, dussīlassa sīlavipannassa hatūpaniso hoti avippaṭisāro; avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti…pe… vimuttiñāṇadassanaṃ. ‘‘Sīlavato, āvuso, sīlasampannassa upanisasampanno hoti avippaṭisāro; avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti…pe. … vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, āvuso, sīlavato sīlasampannassa upanisasampanno hoti avippaṭisāro; avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti…pe… vimuttiñāṇadassana’’nti. Catutthaṃ.",
      "english": "There, Venerable Sāriputta addressed the monks, saying, ‘Friends, for one who is immoral, deficient in virtue, the foundation for freedom from regret is destroyed. When there is no freedom from regret, for one deficient in freedom from regret, the foundation for joy is destroyed; when there is no joy, for one deficient in joy, the foundation for rapture is destroyed; when there is no rapture, for one deficient in rapture, the foundation for tranquility is destroyed; when there is no tranquility, for one deficient in tranquility, the foundation for happiness is destroyed; when there is no happiness, for one deficient in happiness, the foundation for concentration is destroyed; when there is no concentration, for one deficient in concentration, the foundation for knowledge and vision of things as they really are is destroyed; when there is no knowledge and vision of things as they really are, for one deficient in knowledge and vision of things as they really are, the foundation for dispassion is destroyed; when there is no dispassion, for one deficient in dispassion, the foundation for fading away is destroyed; when there is no fading away, for one deficient in fading away, the foundation for liberation is destroyed; when there is no liberation, for one deficient in liberation, the foundation for knowledge and vision of liberation is destroyed. Just as, friends, a tree deficient in branches and foliage cannot bring its outer bark to completion, nor its inner bark, nor its sapwood, nor its heartwood to completion. In the same way, friends, for one who is immoral, deficient in virtue, the foundation for freedom from regret is destroyed; when there is no freedom from regret, for one deficient in freedom from regret, the foundation for joy is destroyed; when there is no joy, for one deficient in joy, the foundation for rapture is destroyed; when there is no rapture, for one deficient in rapture, the foundation for tranquility is destroyed; when there is no tranquility, for one deficient in tranquility, the foundation for happiness is destroyed; when there is no happiness, for one deficient in happiness, the foundation for concentration is destroyed; when there is no concentration, for one deficient in concentration, the foundation for knowledge and vision of things as they really are is destroyed; when there is no knowledge and vision of things as they really are, for one deficient in knowledge and vision of things as they really are, the foundation for dispassion is destroyed; when there is no dispassion, for one deficient in dispassion, the foundation for fading away is destroyed; when there is no fading away, for one deficient in fading away, the foundation for liberation is destroyed; when there is no liberation, for one deficient in liberation, the foundation for knowledge and vision of liberation is destroyed.’\n\n‘Friends, for one who is virtuous, endowed with virtue, the foundation for freedom from regret is complete; when there is freedom from regret, for one endowed with freedom from regret, the foundation for joy is complete; when there is joy, for one endowed with joy, the foundation for rapture is complete; when there is rapture, for one endowed with rapture, the foundation for tranquility is complete; when there is tranquility, for one endowed with tranquility, the foundation for happiness is complete; when there is happiness, for one endowed with happiness, the foundation for concentration is complete; when there is concentration, for one endowed with concentration, the foundation for knowledge and vision of things as they really are is complete; when there is knowledge and vision of things as they really are, for one endowed with knowledge and vision of things as they really are, the foundation for dispassion is complete; when there is dispassion, for one endowed with dispassion, the foundation for fading away is complete; when there is fading away, for one endowed with fading away, the foundation for liberation is complete; when there is liberation, for one endowed with liberation, the foundation for knowledge and vision of liberation is complete. Just as, friends, a tree endowed with branches and foliage brings its outer bark to completion, and its inner bark, and its sapwood, and its heartwood to completion. In the same way, friends, for one who is virtuous, endowed with virtue, the foundation for freedom from regret is complete; when there is freedom from regret, for one endowed with freedom from regret, the foundation for joy is complete; when there is joy, for one endowed with joy, the foundation for rapture is complete; when there is rapture, for one endowed with rapture, the foundation for tranquility is complete; when there is tranquility, for one endowed with tranquility, the foundation for happiness is complete; when there is happiness, for one endowed with happiness, the foundation for concentration is complete; when there is concentration, for one endowed with concentration, the foundation for knowledge and vision of things as they really are is complete; when there is knowledge and vision of things as they really are, for one endowed with knowledge and vision of things as they really are, the foundation for dispassion is complete; when there is dispassion, for one endowed with dispassion, the foundation for fading away is complete; when there is fading away, for one endowed with fading away, the foundation for liberation is complete; when there is liberation, for one endowed with liberation, the foundation for knowledge and vision of liberation is complete.’",
      "sinhala": "එහිදී පින්වත් ශාරීපුත්ත ස්ථවිරයන් වහන්සේ භික්‍ෂූන් අමතා මෙසේ වදාළ සේක: \"ඇවැත්නි, දුශ්‍ශීල වූ, සීලයෙන් පිරිහී ගිය පුද්ගලයාට පසුතැවිලි නොවීම (අවිප්පටිසාරය) සඳහා වූ උපනිශ්‍රය නැති වී යයි. පසුතැවිලි නොවීම නැති වූ කල්හි, පසුතැවිලි නොවීමෙන් පිරිහී ගිය තැනැත්තාට ප්‍රමෝදය (සතුට) සඳහා වූ උපනිශ්‍රය නැති වී යයි. ප්‍රමෝදය නැති වූ කල්හි, ප්‍රමෝදයෙන් පිරිහී ගිය තැනැත්තාට ප්‍රීතිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. ප්‍රීතිය නැති වූ කල්හි, ප්‍රීතියෙන් පිරිහී ගිය තැනැත්තාට පස්සද්‍ධිය (සන්සුන්බව) සඳහා වූ උපනිශ්‍රය නැති වී යයි. පස්සද්‍ධිය නැති වූ කල්හි, පස්සද්‍ධියෙන් පිරිහී ගිය තැනැත්තාට සැපය සඳහා වූ උපනිශ්‍රය නැති වී යයි. සැපය නැති වූ කල්හි, සැපයෙන් පිරිහී ගිය තැනැත්තාට සමාධිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. සමාධිය නැති වූ කල්හි, සමාධියෙන් පිරිහී ගිය තැනැත්තාට යථාභූත ඥාන දර්ශනය (ඇති සැටියෙන් දකින නුවණ) සඳහා වූ උපනිශ්‍රය නැති වී යයි. යථාභූත ඥාන දර්ශනය නැති වූ කල්හි, යථාභූත ඥාන දර්ශනයෙන් පිරිහී ගිය තැනැත්තාට නිබ්බිදාව (කෙලෙස් කලකිරීම) සඳහා වූ උපනිශ්‍රය නැති වී යයි. නිබ්බිදාව නැති වූ කල්හි, නිබ්බිදාවෙන් පිරිහී ගිය තැනැත්තාට විරාගය (කෙලෙස් නොඇලීම) සඳහා වූ උපනිශ්‍රය නැති වී යයි. විරාගය නැති වූ කල්හි, විරාගයෙන් පිරිහී ගිය තැනැත්තාට විමුක්තිය (මිදීම) සඳහා වූ උපනිශ්‍රය නැති වී යයි. විමුක්තිය නැති වූ කල්හි, විමුක්තියෙන් පිරිහී ගිය තැනැත්තාට විමුක්ති ඥාන දර්ශනය (මිදීම පිළිබඳ නුවණ) සඳහා වූ උපනිශ්‍රය නැති වී යයි.\"\n\n\"ඇවැත්නි, අතුපතරින් හා කොළ අතුවලින් හීන වූ ගසක් යම්සේද, එහි පිට පොත්ත වර්ධනයට නොපැමිණේ. ඇතුළු පොත්තද, මොලොක් දැවද, දැව සාරයද වර්ධනයට නොපැමිණේ. ඇවැත්නි, එපරිද්දෙන්ම දුශ්ශීල වූ, සීලයෙන් පිරිහී ගිය පුද්ගලයාට පසුතැවිලි නොවීම සඳහා වූ උපනිශ්‍රය නැති වී යයි. පසුතැවිලි නොවීම නැති වූ කල්හි, පසුතැවිලි නොවීමෙන් පිරිහී ගිය තැනැත්තාට ප්‍රමෝදය සඳහා වූ උපනිශ්‍රය නැති වී යයි. ප්‍රමෝදය නැති වූ කල්හි, ප්‍රමෝදයෙන් පිරිහී ගිය තැනැත්තාට ප්‍රීතිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. ප්‍රීතිය නැති වූ කල්හි, ප්‍රීතියෙන් පිරිහී ගිය තැනැත්තාට පස්සද්‍ධිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. පස්සද්‍ධිය නැති වූ කල්හි, පස්සද්‍ධියෙන් පිරිහී ගිය තැනැත්තාට සැපය සඳහා වූ උපනිශ්‍රය නැති වී යයි. සැපය නැති වූ කල්හි, සැපයෙන් පිරිහී ගිය තැනැත්තාට සමාධිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. සමාධිය නැති වූ කල්හි, සමාධියෙන් පිරිහී ගිය තැනැත්තාට යථාභූත ඥාන දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි. යථාභූත ඥාන දර්ශනය නැති වූ කල්හි, යථාභූත ඥාන දර්ශනයෙන් පිරිහී ගිය තැනැත්තාට නිබ්බිදාව සඳහා වූ උපනිශ්‍රය නැති වී යයි. නිබ්බිදාව නැති වූ කල්හි, නිබ්බිදාවෙන් පිරිහී ගිය තැනැත්තාට විරාගය සඳහා වූ උපනිශ්‍රය නැති වී යයි. විරාගය නැති වූ කල්හි, විරාගයෙන් පිරිහී ගිය තැනැත්තාට විමුක්තිය සඳහා වූ උපනිශ්‍රය නැති වී යයි. විමුක්තිය නැති වූ කල්හි, විමුක්තියෙන් පිරිහී ගිය තැනැත්තාට විමුක්ති ඥාන දර්ශනය සඳහා වූ උපනිශ්‍රය නැති වී යයි.\"\n\n\"ඇවැත්නි, සිල්වත් වූ, සීලයෙන් යුක්ත වූ පුද්ගලයාට පසුතැවිලි නොවීම සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. පසුතැවිලි නොවීම තිබෙන කල්හි, පසුතැවිලි නොවීමෙන් යුක්ත තැනැත්තාට ප්‍රමෝදය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. ප්‍රමෝදය තිබෙන කල්හි, ප්‍රමෝදයෙන් යුක්ත තැනැත්තාට ප්‍රීතිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. ප්‍රීතිය තිබෙන කල්හි, ප්‍රීතියෙන් යුක්ත තැනැත්තාට පස්සද්‍ධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. පස්සද්‍ධිය තිබෙන කල්හි, පස්සද්‍ධියෙන් යුක්ත තැනැත්තාට සැපය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. සැපය තිබෙන කල්හි, සැපයෙන් යුක්ත තැනැත්තාට සමාධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. සමාධිය තිබෙන කල්හි, සමාධියෙන් යුක්ත තැනැත්තාට යථාභූත ඥාන දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. යථාභූත ඥාන දර්ශනය තිබෙන කල්හි, යථාභූත ඥාන දර්ශනයෙන් යුක්ත තැනැත්තාට නිබ්බිදාව සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. නිබ්බිදාව තිබෙන කල්හි, නිබ්බිදාවෙන් යුක්ත තැනැත්තාට විරාගය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. විරාගය තිබෙන කල්හි, විරාගයෙන් යුක්ත තැනැත්තාට විමුක්තිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. විමුක්තිය තිබෙන කල්හි, විමුක්තියෙන් යුක්ත තැනැත්තාට විමුක්ති ඥාන දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ.\"\n\n\"ඇවැත්නි, අතුපතරින් හා කොළ අතුවලින් යුක්ත වූ ගසක් යම්සේද, එහි පිට පොත්තද වර්ධනයට පැමිණේ. ඇතුළු පොත්තද, මොලොක් දැවද, දැව සාරයද වර්ධනයට පැමිණේ. ඇවැත්නි, එපරිද්දෙන්ම සිල්වත් වූ, සීලයෙන් යුක්ත වූ පුද්ගලයාට පසුතැවිලි නොවීම සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. පසුතැවිලි නොවීම තිබෙන කල්හි, පසුතැවිලි නොවීමෙන් යුක්ත තැනැත්තාට ප්‍රමෝදය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. ප්‍රමෝදය තිබෙන කල්හි, ප්‍රමෝදයෙන් යුක්ත තැනැත්තාට ප්‍රීතිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. ප්‍රීතිය තිබෙන කල්හි, ප්‍රීතියෙන් යුක්ත තැනැත්තාට පස්සද්‍ධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. පස්සද්‍ධිය තිබෙන කල්හි, පස්සද්‍ධියෙන් යුක්ත තැනැත්තාට සැපය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. සැපය තිබෙන කල්හි, සැපයෙන් යුක්ත තැනැත්තාට සමාධිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. සමාධිය තිබෙන කල්හි, සමාධියෙන් යුක්ත තැනැත්තාට යථාභූත ඥාන දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. යථාභූත ඥාන දර්ශනය තිබෙන කල්හි, යථාභූත ඥාන දර්ශනයෙන් යුක්ත තැනැත්තාට නිබ්බිදාව සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. නිබ්බිදාව තිබෙන කල්හි, නිබ්බිදාවෙන් යුක්ත තැනැත්තාට විරාගය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. විරාගය තිබෙන කල්හි, විරාගයෙන් යුක්ත තැනැත්තාට විමුක්තිය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ. විමුක්තිය තිබෙන කල්හි, විමුක්තියෙන් යුක්ත තැනැත්තාට විමුක්ති ඥාන දර්ශනය සඳහා වූ උපනිශ්‍රය සම්පූර්ණ වී තිබේ.\"\n\nසිව්වන සූත්‍රයයි.",
      "paliTitle": "Dutiyaupanisasuttaṃ",
      "englishTitle": "The Second Upanisa Sutta",
      "sinhalaTitle": "දෙවන උපනිස සූත‍්‍රය"
    },
    {
      "number": 5,
      "pali": "[a. ni. 11.5] Tatra kho āyasmā ānando bhikkhū āmantesi – ‘‘dussīlassa, āvuso, sīlavipannassa hatūpaniso hoti avippaṭisāro; avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti pāmojjaṃ; pāmojje asati pāmojjavipannassa hatūpanisā hoti pīti; pītiyā asati pītivipannassa hatūpanisā hoti passaddhi; passaddhiyā asati passaddhivipannassa hatūpanisaṃ hoti sukhaṃ; sukhe asati sukhavipannassa hatūpaniso hoti sammāsamādhi; sammāsamādhimhi asati sammāsamādhivipannassa hatūpanisaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane asati yathābhūtañāṇadassanavipannassa hatūpaniso hoti nibbidāvirāgo; nibbidāvirāge asati nibbidāvirāgavipannassa hatūpanisaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho sākhāpalāsavipanno. Tassa papaṭikāpi na pāripūriṃ gacchati, tacopi… pheggupi… sāropi na pāripūriṃ gacchati. Evamevaṃ kho, āvuso, dussīlassa sīlavipannassa hatūpaniso hoti avippaṭisāro; avippaṭisāre asati avippaṭisāravipannassa hatūpanisaṃ hoti…pe… vimuttiñāṇadassanaṃ. ‘‘Sīlavato, āvuso, sīlasampannassa upanisasampanno hoti avippaṭisāro; avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti pāmojjaṃ; pāmojje sati pāmojjasampannassa upanisasampannā hoti pīti; pītiyā sati pītisampannassa upanisasampannā hoti passaddhi; passaddhiyā sati passaddhisampannassa upanisasampannaṃ hoti sukhaṃ; sukhe sati sukhasampannassa upanisasampanno hoti sammāsamādhi; sammāsamādhimhi sati sammāsamādhisampannassa upanisasampannaṃ hoti yathābhūtañāṇadassanaṃ; yathābhūtañāṇadassane sati yathābhūtañāṇadassanasampannassa upanisasampanno hoti nibbidāvirāgo; nibbidāvirāge sati nibbidāvirāgasampannassa upanisasampannaṃ hoti vimuttiñāṇadassanaṃ. Seyyathāpi, āvuso, rukkho sākhāpalāsasampanno. Tassa papaṭikāpi pāripūriṃ gacchati, tacopi… pheggupi… sāropi pāripūriṃ gacchati. Evamevaṃ kho, āvuso, sīlavato sīlasampannassa upanisasampanno hoti avippaṭisāro; avippaṭisāre sati avippaṭisārasampannassa upanisasampannaṃ hoti…pe… vimuttiñāṇadassana’’nti. Pañcamaṃ.",
      "english": "There, indeed, the venerable Ananda addressed the monks: \"Friends, for one who is immoral, who is deficient in virtue, the condition for freedom from remorse is destroyed. When freedom from remorse is absent, for one deficient in freedom from remorse, the condition for joy is destroyed. When joy is absent, for one deficient in joy, the condition for rapture is destroyed. When rapture is absent, for one deficient in rapture, the condition for tranquility is destroyed. When tranquility is absent, for one deficient in tranquility, the condition for happiness is destroyed. When happiness is absent, for one deficient in happiness, the condition for right concentration is destroyed. When right concentration is absent, for one deficient in right concentration, the condition for knowledge and vision of things as they truly are is destroyed. When knowledge and vision of things as they truly are is absent, for one deficient in knowledge and vision of things as they truly are, the condition for dispassion and detachment is destroyed. When dispassion and detachment are absent, for one deficient in dispassion and detachment, the condition for knowledge and vision of liberation is destroyed. Just as, friends, a tree that is deficient in branches and leaves: its outer bark does not mature, nor does its inner bark, nor its sapwood, nor its heartwood. In the same way, friends, for one who is immoral, who is deficient in virtue, the condition for freedom from remorse is destroyed; when freedom from remorse is absent, for one deficient in freedom from remorse, the condition for joy is destroyed; when joy is absent, for one deficient in joy, the condition for rapture is destroyed; when rapture is absent, for one deficient in rapture, the condition for tranquility is destroyed; when tranquility is absent, for one deficient in tranquility, the condition for happiness is destroyed; when happiness is absent, for one deficient in happiness, the condition for right concentration is destroyed; when right concentration is absent, for one deficient in right concentration, the condition for knowledge and vision of things as they truly are is destroyed; when knowledge and vision of things as they truly are is absent, for one deficient in knowledge and vision of things as they truly are, the condition for dispassion and detachment is destroyed; when dispassion and detachment are absent, for one deficient in dispassion and detachment, the condition for knowledge and vision of liberation is destroyed.\"\n\n\"For one who is virtuous, friends, who is complete in virtue, the condition for freedom from remorse is perfected. When freedom from remorse is present, for one complete in freedom from remorse, the condition for joy is perfected. When joy is present, for one complete in joy, the condition for rapture is perfected. When rapture is present, for one complete in rapture, the condition for tranquility is perfected. When tranquility is present, for one complete in tranquility, the condition for happiness is perfected. When happiness is present, for one complete in happiness, the condition for right concentration is perfected. When right concentration is present, for one complete in right concentration, the condition for knowledge and vision of things as they truly are is perfected. When knowledge and vision of things as they truly are is present, for one complete in knowledge and vision of things as they truly are, the condition for dispassion and detachment is perfected. When dispassion and detachment are present, for one complete in dispassion and detachment, the condition for knowledge and vision of liberation is perfected. Just as, friends, a tree that is complete in branches and leaves: its outer bark matures, and its inner bark, and its sapwood, and its heartwood mature. In the same way, friends, for one who is virtuous, who is complete in virtue, the condition for freedom from remorse is perfected; when freedom from remorse is present, for one complete in freedom from remorse, the condition for joy is perfected; when joy is present, for one complete in joy, the condition for rapture is perfected; when rapture is present, for one complete in rapture, the condition for tranquility is perfected; when tranquility is present, for one complete in tranquility, the condition for happiness is perfected; when happiness is present, for one complete in happiness, the condition for right concentration is perfected; when right concentration is present, for one complete in right concentration, the condition for knowledge and vision of things as they truly are is perfected; when knowledge and vision of things as they truly are is present, for one complete in knowledge and vision of things as they truly are, the condition for dispassion and detachment is perfected; when dispassion and detachment are present, for one complete in dispassion and detachment, the condition for knowledge and vision of liberation is perfected.\"",
      "sinhala": "එහිදී ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භික්ෂූන් වහන්සේලා ඇමතූ සේක: \"ඇවැත්නි, දුස්සීල වූ, සීලයෙන් පිරිහුණු පුද්ගලයාට අවිප්‍ර‍තිසාරය (පසුතැවීමෙන් තොරවීම) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. අවිප්‍ර‍තිසාරය නැති කල්හි, අවිප්‍ර‍තිසාරයෙන් පිරිහුණු පුද්ගලයාට ප්‍ර‍මෝදය (සතුට) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. ප්‍ර‍මෝදය නැති කල්හි, ප්‍ර‍මෝදයෙන් පිරිහුණු පුද්ගලයාට ප්‍ර‍ීතිය (ප්‍ර‍හර්ෂය) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. ප්‍ර‍ීතිය නැති කල්හි, ප්‍ර‍ීතියෙන් පිරිහුණු පුද්ගලයාට පස්සද්ධිය (කයේ හා සිතේ සංසිඳීම) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. පස්සද්ධිය නැති කල්හි, පස්සද්ධියෙන් පිරිහුණු පුද්ගලයාට සැපය (කයෙහි හා සිතෙහි සුවය) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. සැපය නැති කල්හි, සැපයෙන් පිරිහුණු පුද්ගලයාට සම්මාසමාධිය (යහපත් සමාධිය) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. සම්මාසමාධිය නැති කල්හි, සම්මාසමාධියෙන් පිරිහුණු පුද්ගලයාට යථාභූත ඥානදර්ශනය (ලෝකයේ යථා ස්වභාවය පිළිබඳ නුවණ හා දැක්ම) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. යථාභූත ඥානදර්ශනය නැති කල්හි, යථාභූත ඥානදර්ශනයෙන් පිරිහුණු පුද්ගලයාට නිර්වේදය හා විරාගය (ලෝකයෙන් කලකිරීම හා ඇලීමෙන් තොරවීම) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. නිර්වේදය හා විරාගය නැති කල්හි, නිර්වේදයෙන් හා විරාගයෙන් පිරිහුණු පුද්ගලයාට විමුක්ති ඥානදර්ශනය (විමුක්තිය පිළිබඳ නුවණ හා දැක්ම) ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි.\"\n\n\"ඇවැත්නි, යම් සේ අතුපතර හා පත්‍ර නැති ගසක් වේද, එහි පොත්තද මනාව පෝෂණය නොවෙයි. ලෙල්ලද, දළුද, හරයද මනාව පෝෂණය නොවෙයි. ඇවැත්නි, එලෙසම දුස්සීල වූ, සීලයෙන් පිරිහුණු පුද්ගලයාට අවිප්‍ර‍තිසාරය ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. අවිප්‍ර‍තිසාරය නැති කල්හි, අවිප්‍ර‍තිසාරයෙන් පිරිහුණු පුද්ගලයාට ප්‍ර‍මෝදය ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. ප්‍ර‍මෝදය නැති කල්හි, ප්‍ර‍මෝදයෙන් පිරිහුණු පුද්ගලයාට ප්‍ර‍ීතිය ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. ප්‍ර‍ීතිය නැති කල්හි, ප්‍ර‍ීතියෙන් පිරිහුණු පුද්ගලයාට පස්සද්ධිය ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. පස්සද්ධිය නැති කල්හි, පස්සද්ධියෙන් පිරිහුණු පුද්ගලයාට සැපය ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. සැපය නැති කල්හි, සැපයෙන් පිරිහුණු පුද්ගලයාට සම්මාසමාධිය ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. සම්මාසමාධිය නැති කල්හි, සම්මාසමාධියෙන් පිරිහුණු පුද්ගලයාට යථාභූත ඥානදර්ශනය ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. යථාභූත ඥානදර්ශනය නැති කල්හි, යථාභූත ඥානදර්ශනයෙන් පිරිහුණු පුද්ගලයාට නිර්වේදය හා විරාගය ඇතිවීමට ඇති උපනිශ්‍ර‍ය විනාශ වී යයි. නිර්වේදය හා විරාගය නැති කල්හි, නිර්වේදයෙන් හා විරාගයෙන් පිරිහුණු පුද්ගලයාට විමුක්ති ඥානදර්ශනය ඇතිවීමට ඇති උපනිශ්‍ර‍යද විනාශ වී යයි.\"\n\n\"ඇවැත්නි, සීලවන්ත වූ, සීලයෙන් සම්පූර්ණ වූ පුද්ගලයාට අවිප්‍ර‍තිසාරය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. අවිප්‍ර‍තිසාරය ඇති කල්හි, අවිප්‍ර‍තිසාරයෙන් සම්පූර්ණ වූ පුද්ගලයාට ප්‍ර‍මෝදය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. ප්‍ර‍මෝදය ඇති කල්හි, ප්‍ර‍මෝදයෙන් සම්පූර්ණ වූ පුද්ගලයාට ප්‍ර‍ීතිය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. ප්‍ර‍ීතිය ඇති කල්හි, ප්‍ර‍ීතියෙන් සම්පූර්ණ වූ පුද්ගලයාට පස්සද්ධිය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. පස්සද්ධිය ඇති කල්හි, පස්සද්ධියෙන් සම්පූර්ණ වූ පුද්ගලයාට සැපය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. සැපය ඇති කල්හි, සැපයෙන් සම්පූර්ණ වූ පුද්ගලයාට සම්මාසමාධිය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. සම්මාසමාධිය ඇති කල්හි, සම්මාසමාධියෙන් සම්පූර්ණ වූ පුද්ගලයාට යථාභූත ඥානදර්ශනය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. යථාභූත ඥානදර්ශනය ඇති කල්හි, යථාභූත ඥානදර්ශනයෙන් සම්පූර්ණ වූ පුද්ගලයාට නිර්වේදය හා විරාගය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. නිර්වේදය හා විරාගය ඇති කල්හි, නිර්වේදයෙන් හා විරාගයෙන් සම්පූර්ණ වූ පුද්ගලයාට විමුක්ති ඥානදර්ශනය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ.\"\n\n\"ඇවැත්නි, යම් සේ අතුපතර හා පත්‍රවලින් යුක්ත ගසක් වේද, එහි පොත්තද මනාව පෝෂණය වෙයි. ලෙල්ලද, දළුද, හරයද මනාව පෝෂණය වෙයි. ඇවැත්නි, එලෙසම සීලවන්ත වූ, සීලයෙන් සම්පූර්ණ වූ පුද්ගලයාට අවිප්‍ර‍තිසාරය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. අවිප්‍ර‍තිසාරය ඇති කල්හි, අවිප්‍ර‍තිසාරයෙන් සම්පූර්ණ වූ පුද්ගලයාට ප්‍ර‍මෝදය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. ප්‍ර‍මෝදය ඇති කල්හි, ප්‍ර‍මෝදයෙන් සම්පූර්ණ වූ පුද්ගලයාට ප්‍ර‍ීතිය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. ප්‍ර‍ීතිය ඇති කල්හි, ප්‍ර‍ීතියෙන් සම්පූර්ණ වූ පුද්ගලයාට පස්සද්ධිය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. පස්සද්ධිය ඇති කල්හි, පස්සද්ධියෙන් සම්පූර්ණ වූ පුද්ගලයාට සැපය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. සැපය ඇති කල්හි, සැපයෙන් සම්පූර්ණ වූ පුද්ගලයාට සම්මාසමාධිය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. සම්මාසමාධිය ඇති කල්හි, සම්මාසමාධියෙන් සම්පූර්ණ වූ පුද්ගලයාට යථාභූත ඥානදර්ශනය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. යථාභූත ඥානදර්ශනය ඇති කල්හි, යථාභූත ඥානදර්ශනයෙන් සම්පූර්ණ වූ පුද්ගලයාට නිර්වේදය හා විරාගය ඇතිවීමට උපනිශ්‍ර‍ය සම්පූර්ණ වී තිබේ. නිර්වේදය හා විරාගය ඇති කල්හි, නිර්වේදයෙන් හා විරාගයෙන් සම්පූර්ණ වූ පුද්ගලයාට විමුක්ති ඥානදර්ශනය ඇතිවීමට උපනිශ්‍ර‍යද සම්පූර්ණ වී තිබේ.\"",
      "paliTitle": "Tatiyaupanisasuttaṃ",
      "englishTitle": "The Third Discourse on Condition",
      "sinhalaTitle": "තෙවැනි උපනිසා සූත්‍රය"
    },
    {
      "number": 6,
      "pali": "[a. ni. 11.18] Atha kho āyasmā ānando yena bhagavā tenupasaṅkami…pe… ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘siyā nu kho, bhante, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī [paṭhavisaññī (sī.), paṭhavīsaññī (syā.)] assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa; saññī ca pana assā’’ti? ‘‘Siyā, ānanda, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa; saññī ca pana assā’’ti. ‘‘Yathā kathaṃ pana, bhante, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyattane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa; saññī ca pana assā’’ti? ‘‘Idhānanda, bhikkhu evaṃsaññī hoti – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhipaṭinissaggo taṇhākkhayo virāgo nirodho nibbāna’nti. Evaṃ kho, ānanda, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa; saññī ca pana assā’’ti. Chaṭṭhaṃ.",
      "english": "Then the Venerable Ānanda approached the Blessed One, and having approached, he sat down to one side. Sitting to one side, the Venerable Ānanda said to the Blessed One: \"Is it possible, Venerable Sir, for a bhikkhu to attain such a state of meditative absorption that he does not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind; nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception; nor this world as this world, nor the other world as the other world; yet still possesses perception?\"\n\n\"Yes, Ānanda, it is possible for a bhikkhu to attain such a state of meditative absorption that he does not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind; nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception; nor this world as this world, nor the other world as the other world; yet still possesses perception.\"\n\n\"But how, Venerable Sir, is it possible for a bhikkhu to attain such a state of meditative absorption that he does not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind; nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception; nor this world as this world, nor the other world as the other world; yet still possesses perception?\"\n\n\"Here, Ānanda, a bhikkhu perceives thus: 'This is peaceful, this is sublime, namely, the stilling of all formations, the relinquishment of all acquisitions, the destruction of craving, dispassion, cessation, Nibbāna.' It is in this way, Ānanda, that a bhikkhu may attain such a state of meditative absorption that he does not perceive earth as earth, nor water as water, nor fire as fire, nor wind as wind; nor the dimension of infinite space as the dimension of infinite space, nor the dimension of infinite consciousness as the dimension of infinite consciousness, nor the dimension of nothingness as the dimension of nothingness, nor the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception; nor this world as this world, nor the other world as the other world; yet still possesses perception.\"",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ආනන්දයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹුණු සේක. එකත්පස්ව අසුන් ගත් ආයුෂ්මත් ආනන්දයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ සැල කළ සේක: “ස්වාමීනි, භික්ෂුවකට එවැනි සමාධි ප්‍රතිලාභයක් ඇතිවිය හැකි ද, යමකින් ඔහුට පඨවියෙහි පඨවි සංඥාවක් ඇති නොවන්නේ ද, ආපෝයෙහි ආපෝ සංඥාවක් ඇති නොවන්නේ ද, තේජෝයෙහි තේජෝ සංඥාවක් ඇති නොවන්නේ ද, වායෝයෙහි වායෝ සංඥාවක් ඇති නොවන්නේ ද, ආකාසානඤ්චායතනයෙහි ආකාසානඤ්චායතන සංඥාවක් ඇති නොවන්නේ ද, විඤ්ඤාණඤ්චායතනයෙහි විඤ්ඤාණඤ්චායතන සංඥාවක් ඇති නොවන්නේ ද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවක් ඇති නොවන්නේ ද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවක් ඇති නොවන්නේ ද, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් ඇති නොවන්නේ ද, පරලෝකයෙහි පරලෝක සංඥාවක් ඇති නොවන්නේ ද, එහෙත් සංඥාවෙන් යුක්තව සිටින්නේ ද?”\n\n“ආනන්දය, භික්ෂුවකට එවැනි සමාධි ප්‍රතිලාභයක් ඇතිවිය හැකිය, යමකින් ඔහුට පඨවියෙහි පඨවි සංඥාවක් ඇති නොවන්නේ ද, ආපෝයෙහි ආපෝ සංඥාවක් ඇති නොවන්නේ ද, තේජෝයෙහි තේජෝ සංඥාවක් ඇති නොවන්නේ ද, වායෝයෙහි වායෝ සංඥාවක් ඇති නොවන්නේ ද, ආකාසානඤ්චායතනයෙහි ආකාසානඤ්චායතන සංඥාවක් ඇති නොවන්නේ ද, විඤ්ඤාණඤ්චායතනයෙහි විඤ්ඤාණඤ්චායතන සංඥාවක් ඇති නොවන්නේ ද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවක් ඇති නොවන්නේ ද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවක් ඇති නොවන්නේ ද, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් ඇති නොවන්නේ ද, පරලෝකයෙහි පරලෝක සංඥාවක් ඇති නොවන්නේ ද, එහෙත් සංඥාවෙන් යුක්තව සිටින්නේ ය.”\n\n“ස්වාමීනි, එසේ නම් භික්ෂුවකට එවැනි සමාධි ප්‍රතිලාභයක් ඇතිවිය හැක්කේ කෙසේ ද, යමකින් ඔහුට පඨවියෙහි පඨවි සංඥාවක් ඇති නොවන්නේ ද, ආපෝයෙහි ආපෝ සංඥාවක් ඇති නොවන්නේ ද, තේජෝයෙහි තේජෝ සංඥාවක් ඇති නොවන්නේ ද, වායෝයෙහි වායෝ සංඥාවක් ඇති නොවන්නේ ද, ආකාසානඤ්චායතනයෙහි ආකාසානඤ්චායතන සංඥාවක් ඇති නොවන්නේ ද, විඤ්ඤාණඤ්චායතනයෙහි විඤ්ඤාණඤ්චායතන සංඥාවක් ඇති නොවන්නේ ද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවක් ඇති නොවන්නේ ද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවක් ඇති නොවන්නේ ද, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් ඇති නොවන්නේ ද, පරලෝකයෙහි පරලෝක සංඥාවක් ඇති නොවන්නේ ද, එහෙත් සංඥාවෙන් යුක්තව සිටින්නේ ද?”\n\n“ආනන්දය, මෙහිලා භික්ෂුව මෙසේ සංඥාවක් ඇතිකර ගනී: ‘මෙය ශාන්ත ය, මෙය ප්‍රණීත ය. එනම් සියලු සංස්කාරයන්ගේ සංසිඳීම ය, සියලු උපධීන් අත්හැරීම ය, තණ්හාව ක්ෂය කිරීම ය, විරාගය ය, නිරෝධය ය, නිවන ය.’ ආනන්දය, භික්ෂුවකට එවැනි සමාධි ප්‍රතිලාභයක් ඇතිවිය හැක්කේ මේ ආකාරයට ය, යමකින් ඔහුට පඨවියෙහි පඨවි සංඥාවක් ඇති නොවන්නේ ද, ආපෝයෙහි ආපෝ සංඥාවක් ඇති නොවන්නේ ද, තේජෝයෙහි තේජෝ සංඥාවක් ඇති නොවන්නේ ද, වායෝයෙහි වායෝ සංඥාවක් ඇති නොවන්නේ ද, ආකාසානඤ්චායතනයෙහි ආකාසානඤ්චායතන සංඥාවක් ඇති නොවන්නේ ද, විඤ්ඤාණඤ්චායතනයෙහි විඤ්ඤාණඤ්චායතන සංඥාවක් ඇති නොවන්නේ ද, ආකිඤ්චඤ්ඤායතනයෙහි ආකිඤ්චඤ්ඤායතන සංඥාවක් ඇති නොවන්නේ ද, නේවසඤ්ඤානාසඤ්ඤායතනයෙහි නේවසඤ්ඤානාසඤ්ඤායතන සංඥාවක් ඇති නොවන්නේ ද, මේ ලෝකයෙහි මේ ලෝක සංඥාවක් ඇති නොවන්නේ ද, පරලෝකයෙහි පරලෝක සංඥාවක් ඇති නොවන්නේ ද, එහෙත් සංඥාවෙන් යුක්තව සිටින්නේ ය.”",
      "paliTitle": "Samādhisuttaṃ",
      "englishTitle": "Concentration Discourse",
      "sinhalaTitle": "සමාධි සූත‍්‍රය"
    },
    {
      "number": 7,
      "pali": "Atha kho āyasmā ānando yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Siyā nu kho, āvuso sāriputta, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa, na āpasmiṃ āposaññī assa, na tejasmiṃ tejosaññī assa, na vāyasmiṃ vāyosaññī assa, na ākāsānañcāyatane ākāsānañcāyatanasaññī assa, na viññāṇañcāyatane viññāṇañcāyatanasaññī assa, na ākiñcaññāyatane ākiñcaññāyatanasaññī assa, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī assa, na idhaloke idhalokasaññī assa, na paraloke paralokasaññī assa; saññī ca pana assā’’ti? ‘‘Siyā, āvuso ānanda, bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… na paraloke paralokasaññī assa; saññī ca pana assā’’ti. ‘‘Yathā kathaṃ pana, āvuso sāriputta, siyā bhikkhuno tathārūpo samādhipaṭilābho yathā neva pathaviyaṃ pathavisaññī assa…pe… saññī ca pana assā’’ti? ‘‘Ekamidāhaṃ, āvuso ānanda, samayaṃ idheva sāvatthiyaṃ viharāmi andhavanasmiṃ. Tatthāhaṃ [athāhaṃ (ka.)] tathārūpaṃ samādhiṃ samāpajjiṃ [paṭilabhāmi (ka.)] yathā neva pathaviyaṃ pathavisaññī ahosiṃ, na āpasmiṃ āposaññī ahosiṃ, na tejasmiṃ tejosaññī ahosiṃ, na vāyasmiṃ vāyosaññī ahosiṃ, na ākāsānañcāyatane ākāsānañcāyatanasaññī ahosiṃ, na viññāṇañcāyatane viññāṇañcāyatanasaññī ahosiṃ, na ākiñcaññāyatane ākiñcaññāyatanasaññī ahosiṃ, na nevasaññānāsaññāyatane nevasaññānāsaññāyatanasaññī ahosiṃ, na idhaloke idhalokasaññī ahosiṃ, na paraloke paralokasaññī ahosiṃ; saññī ca pana ahosi’’nti. ‘‘Kiṃsaññī panāyasmā sāriputto [kiṃ saññī panāvuso sāriputta (ka.)] tasmiṃ samaye ahosī’’ti? ‘‘Bhavanirodho nibbānaṃ bhavanirodho nibbāna’’nti kho me, āvuso, aññāva saññā uppajjati aññāva saññā nirujjhati. Seyyathāpi, āvuso, sakalikaggissa jhāyamānassa aññāva acci uppajjati aññāva acci nirujjhati; evamevaṃ kho, āvuso, ‘bhavanirodho nibbānaṃ bhavanirodho nibbāna’nti aññāva saññā uppajjati aññāva saññā nirujjhati. ‘Bhavanirodho nibbāna’nti [nibbānaṃ (sī. ka.)] saññī ca panāhaṃ, āvuso, tasmiṃ samaye ahosi’’nti. Sattamaṃ.",
      "english": "Then the Venerable Ananda approached the Venerable Sariputta. Having approached, he exchanged courteous and friendly greetings with the Venerable Sariputta. After exchanging such amiable and memorable words, he sat down to one side.\n\nAs he sat to one side, the Venerable Ananda said this to the Venerable Sariputta: \"Is it possible, friend Sariputta, for a bhikkhu to attain such a state of concentration in which he would not be conscious of earth as earth, nor of water as water, nor of fire as fire, nor of air as air, nor conscious of the dimension of infinite space as the dimension of infinite space, nor conscious of the dimension of infinite consciousness as the dimension of infinite consciousness, nor conscious of the dimension of nothingness as the dimension of nothingness, nor conscious of the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor conscious of this world as this world, nor of the other world as the other world; yet he would still be conscious?\"\n\n\"It is possible, friend Ananda, for a bhikkhu to attain such a state of concentration in which he would not be conscious of earth as earth, nor of water as water, nor of fire as fire, nor of air as air, nor conscious of the dimension of infinite space as the dimension of infinite space, nor conscious of the dimension of infinite consciousness as the dimension of infinite consciousness, nor conscious of the dimension of nothingness as the dimension of nothingness, nor conscious of the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor conscious of this world as this world, nor of the other world as the other world; yet he would still be conscious.\"\n\n\"But how, friend Sariputta, is it possible for a bhikkhu to attain such a state of concentration in which he would not be conscious of earth as earth, nor of water as water, nor of fire as fire, nor of air as air, nor conscious of the dimension of infinite space as the dimension of infinite space, nor conscious of the dimension of infinite consciousness as the dimension of infinite consciousness, nor conscious of the dimension of nothingness as the dimension of nothingness, nor conscious of the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor conscious of this world as this world, nor of the other world as the other world; yet he would still be conscious?\"\n\n\"Once, friend Ananda, I was dwelling right here in Savatthi, in the Andhavana. There I entered upon such a state of concentration in which I was not conscious of earth as earth, nor of water as water, nor of fire as fire, nor of air as air, nor conscious of the dimension of infinite space as the dimension of infinite space, nor conscious of the dimension of infinite consciousness as the dimension of infinite consciousness, nor conscious of the dimension of nothingness as the dimension of nothingness, nor conscious of the dimension of neither perception nor non-perception as the dimension of neither perception nor non-perception, nor conscious of this world as this world, nor of the other world as the other world; yet I was still conscious.\"\n\n\"Of what, then, was the Venerable Sariputta conscious at that time?\"\n\n\"Of 'The cessation of becoming is Nibbana, the cessation of becoming is Nibbana'—this perception, friend, arose in me, and then another perception ceased. Just as, friend, when a small fire is burning, one flame arises and another flame ceases; in the same way, friend, of 'The cessation of becoming is Nibbana, the cessation of becoming is Nibbana'—one perception arose in me and another perception ceased. And it was of 'The cessation of becoming is Nibbana' that I was conscious at that time, friend.\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ වෙත එළඹුණි. එළඹ, ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ සමඟ පිළිසඳර කතා පැවැත්වූහ. සතුටු විය යුතු, සිහි කටයුතු වූ පිළිසඳර කතා නිමා කොට, උන්වහන්සේ එක්පසෙක වාඩි වූහ.\n\nඑක්පසෙක වාඩි වී සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙය පැවසූහ: “ඇවැත් සාරිපුත්ත, භික්ෂුවකට මෙබඳු සමාධි ප්‍රතිලාභයක් ලැබිය හැකි ද, යම් සමාධියකින් ඔහු පඨවිය පඨවිය වශයෙන් සංඥා නොකරයිද, අපෝධාතුව අපෝධාතුව වශයෙන් සංඥා නොකරයිද, තේජෝධාතුව තේජෝධාතුව වශයෙන් සංඥා නොකරයිද, වායෝධාතුව වායෝධාතුව වශයෙන් සංඥා නොකරයිද, ආකාසානඤ්චායතනය ආකාසානඤ්චායතනය වශයෙන් සංඥා නොකරයිද, විඤ්ඤාණඤ්චායතනය විඤ්ඤාණඤ්චායතනය වශයෙන් සංඥා නොකරයිද, ආකිඤ්චඤ්ඤායතනය ආකිඤ්චඤ්ඤායතනය වශයෙන් සංඥා නොකරයිද, නේවසඤ්ඤානාසඤ්ඤායතනය නේවසඤ්ඤානාසඤ්ඤායතනය වශයෙන් සංඥා නොකරයිද, මෙලොව මෙලොව වශයෙන් සංඥා නොකරයිද, පරලොව පරලොව වශයෙන් සංඥා නොකරයිද, එහෙත් සංඥාවෙන් යුක්තව සිටී ද?”\n\n“ඇවැත් ආනන්ද, භික්ෂුවකට මෙබඳු සමාධි ප්‍රතිලාභයක් ලැබිය හැකියි. යම් සමාධියකින් ඔහු පඨවිය පඨවිය වශයෙන් සංඥා නොකරයිද, අපෝධාතුව අපෝධාතුව වශයෙන් සංඥා නොකරයිද, තේජෝධාතුව තේජෝධාතුව වශයෙන් සංඥා නොකරයිද, වායෝධාතුව වායෝධාතුව වශයෙන් සංඥා නොකරයිද, ආකාසානඤ්චායතනය ආකාසානඤ්චායතනය වශයෙන් සංඥා නොකරයිද, විඤ්ඤාණඤ්චායතනය විඤ්ඤාණඤ්චායතනය වශයෙන් සංඥා නොකරයිද, ආකිඤ්චඤ්ඤායතනය ආකිඤ්චඤ්ඤායතනය වශයෙන් සංඥා නොකරයිද, නේවසඤ්ඤානාසඤ්ඤායතනය නේවසඤ්ඤානාසඤ්ඤායතනය වශයෙන් සංඥා නොකරයිද, මෙලොව මෙලොව වශයෙන් සංඥා නොකරයිද, පරලොව පරලොව වශයෙන් සංඥා නොකරයිද, එහෙත් සංඥාවෙන් යුක්තව සිටියි.”\n\n“ඇවැත් සාරිපුත්ත, එහෙත් කෙසේ නම් භික්ෂුවකට මෙබඳු සමාධි ප්‍රතිලාභයක් ලැබිය හැකි ද, යම් සමාධියකින් ඔහු පඨවිය පඨවිය වශයෙන් සංඥා නොකරයිද, අපෝධාතුව අපෝධාතුව වශයෙන් සංඥා නොකරයිද, තේජෝධාතුව තේජෝධාතුව වශයෙන් සංඥා නොකරයිද, වායෝධාතුව වායෝධාතුව වශයෙන් සංඥා නොකරයිද, ආකාසානඤ්චායතනය ආකාසානඤ්චායතනය වශයෙන් සංඥා නොකරයිද, විඤ්ඤාණඤ්චායතනය විඤ්ඤාණඤ්චායතනය වශයෙන් සංඥා නොකරයිද, ආකිඤ්චඤ්ඤායතනය ආකිඤ්චඤ්ඤායතනය වශයෙන් සංඥා නොකරයිද, නේවසඤ්ඤානාසඤ්ඤායතනය නේවසඤ්ඤානාසඤ්ඤායතනය වශයෙන් සංඥා නොකරයිද, මෙලොව මෙලොව වශයෙන් සංඥා නොකරයිද, පරලොව පරලොව වශයෙන් සංඥා නොකරයිද, එහෙත් සංඥාවෙන් යුක්තව සිටී ද?”\n\n“ඇවැත් ආනන්ද, එක් සමයක මම සැවැත් නුවර අන්ධවනයෙහි වාසය කළෙමි. එහිදී මම මෙබඳු සමාධියකට සමවැසුනෙමි. යම් සමාධියකින් මම පඨවිය පඨවිය වශයෙන් සංඥා නොකළෙමි, අපෝධාතුව අපෝධාතුව වශයෙන් සංඥා නොකළෙමි, තේජෝධාතුව තේජෝධාතුව වශයෙන් සංඥා නොකළෙමි, වායෝධාතුව වායෝධාතුව වශයෙන් සංඥා නොකළෙමි, ආකාසානඤ්චායතනය ආකාසානඤ්චායතනය වශයෙන් සංඥා නොකළෙමි, විඤ්ඤාණඤ්චායතනය විඤ්ඤාණඤ්චායතනය වශයෙන් සංඥා නොකළෙමි, ආකිඤ්චඤ්ඤායතනය ආකිඤ්චඤ්ඤායතනය වශයෙන් සංඥා නොකළෙමි, නේවසඤ්ඤානාසඤ්ඤායතනය නේවසඤ්ඤානාසඤ්ඤායතනය වශයෙන් සංඥා නොකළෙමි, මෙලොව මෙලොව වශයෙන් සංඥා නොකළෙමි, පරලොව පරලොව වශයෙන් සංඥා නොකළෙමි, එහෙත් සංඥාවෙන් යුක්තව සිටියෙමි.”\n\n“එහෙත් ඇවැත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ ඒ සමයෙහි කුමක් වශයෙන් සංඥා කළ සේක්ද?”\n\n“‘භව නිරෝධය නිවන යි, භව නිරෝධය නිවන යි’ යනුවෙන් ඇවැත්නි, මට එක සංඥාවක් උපදී, තවත් සංඥාවක් නිරුද්ධ වෙයි. ඇවැත්නි, යම් සේ දර කොටයකින් දැල්වූ ගින්නක එක දැල්ලක් උපදී, තවත් දැල්ලක් නිරුද්ධ වෙයිද, එලෙසින්ම, ඇවැත්නි, ‘භව නිරෝධය නිවන යි, භව නිරෝධය නිවන යි’ යනුවෙන් එක සංඥාවක් උපදී, තවත් සංඥාවක් නිරුද්ධ වෙයි. එහෙත් ඇවැත්නි, ඒ සමයෙහි මම ‘භව නිරෝධය නිවන යි’ යන සංඥාවෙන් යුක්තව සිටියෙමි.”",
      "paliTitle": "Sāriputtasuttaṃ",
      "englishTitle": "Sāriputta Sutta",
      "sinhalaTitle": "සාරිපුත්ත සූත‍්‍රය"
    },
    {
      "number": 8,
      "pali": "‘‘Saddho ca [imasmiṃ vākye ayaṃ ca kāro natthi syāmapotthake], bhikkhave, bhikkhu hoti, no ca [no (syā.) evamuparipi. a. ni. 8.71] sīlavā; evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ, sīlavā cā’ti! Yato ca kho, bhikkhave, bhikkhu saddho ca hoti sīlavā ca, evaṃ so tenaṅgena paripūro hoti. ‘‘Saddho ca, bhikkhave, bhikkhu hoti sīlavā ca, no ca bahussuto…pe… bahussuto ca, no ca dhammakathiko… dhammakathiko ca, no ca parisāvacaro… parisāvacaro ca, no ca visārado parisāya dhammaṃ deseti… visārado ca parisāya dhammaṃ deseti, no ca vinayadharo… vinayadharo ca, no ca āraññiko [āraññako (ka.)] pantasenāsano… āraññiko ca pantasenāsano, no ca catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī… catunnañca jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, no ca āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseyyaṃ, vinayadharo ca, āraññiko ca pantasenāsano, catunnañca jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī assaṃ akicchalābhī akasiralābhī, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti. ‘‘Yato ca kho, bhikkhave, bhikkhu saddho ca hoti, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseti, vinayadharo ca, āraññiko ca pantasenāsano, catunnañca jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati; evaṃ so tenaṅgena paripūro hoti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato bhikkhu samantapāsādiko ca hoti sabbākāraparipūro cā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, if a monk is endowed with faith but not with virtue, then he is incomplete in that aspect. That aspect should be fulfilled by him, thinking: ‘How can I be both endowed with faith and with virtue?’ When, monks, a monk is endowed with both faith and virtue, then he is complete in that aspect.\n\nFurthermore, monks, if a monk is endowed with faith and virtue, but not learned; or if he is endowed with faith, virtue, and is learned, but not a speaker of Dhamma; or if he is endowed with faith, virtue, is learned, and a speaker of Dhamma, but does not frequent assemblies; or if he is endowed with faith, virtue, is learned, a speaker of Dhamma, and frequents assemblies, but does not teach Dhamma confidently in assemblies; or if he is endowed with faith, virtue, is learned, a speaker of Dhamma, frequents assemblies, and teaches Dhamma confidently in assemblies, but is not a bearer of the Vinaya; or if he is endowed with faith, virtue, is learned, a speaker of Dhamma, frequents assemblies, teaches Dhamma confidently in assemblies, and is a bearer of the Vinaya, but is not a forest dweller using remote lodgings; or if he is endowed with faith, virtue, is learned, a speaker of Dhamma, frequents assemblies, teaches Dhamma confidently in assemblies, is a bearer of the Vinaya, and is a forest dweller using remote lodgings, but does not gain at will, without difficulty or trouble, the four jhanas, which are of the higher mind, providing a pleasant abiding in this very life; or if he gains at will, without difficulty or trouble, the four jhanas, which are of the higher mind, providing a pleasant abiding in this very life, but he does not dwell having realized for himself with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, through the destruction of the taints, then he is incomplete in that aspect. That aspect should be fulfilled by him, thinking: ‘How can I be endowed with faith, and with virtue, and learned, and a speaker of Dhamma, and frequent assemblies, and teach Dhamma confidently in assemblies, and be a bearer of the Vinaya, and be a forest dweller using remote lodgings, and gain at will, without difficulty or trouble, the four jhanas, which are of the higher mind, providing a pleasant abiding in this very life, and dwell having realized for myself with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, through the destruction of the taints?’\n\nWhen, monks, a monk is endowed with faith, and with virtue, and learned, and a speaker of Dhamma, and frequents assemblies, and teaches Dhamma confidently in assemblies, and is a bearer of the Vinaya, and is a forest dweller using remote lodgings, and gains at will, without difficulty or trouble, the four jhanas, which are of the higher mind, providing a pleasant abiding in this very life, and dwells having realized for himself with direct knowledge in this very life the taintless liberation of mind and liberation by wisdom, through the destruction of the taints, then he is complete in that aspect. A monk, monks, endowed with these ten qualities is entirely admirable and fully accomplished in all respects.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් විශ්වාසයෙන් යුක්ත වේද, නමුත් සිල්වත් නොවේද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එහෙයින් ඒ අංගය සම්පූර්ණ කළ යුතුයි – ‘කෙසේ නම් මම විශ්වාසයෙන් යුක්ත වූවෙක් ද, සිල්වත් වූවෙක් ද වන්නෙම්ද’ යනුවෙනි. මහණෙනි, යම් කලක භික්ෂුව විශ්වාසයෙන් ද යුක්ත වේද, සිල්වත් ද වේද; එවිට ඔහු ඒ අංගයෙන් සම්පූර්ණ වේ.\n\nමහණෙනි, යම් භික්ෂුවක් විශ්වාසයෙන් ද යුක්ත වේද, සිල්වත් ද වේද, නමුත් බහුශ්‍රැත නොවේද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. යම් භික්ෂුවක් බහුශ්‍රැත ද වේද, නමුත් ධර්ම කථික නොවේද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. යම් භික්ෂුවක් ධර්ම කථික ද වේද, නමුත් පිරිස් අතර හැසිරීමට දක්ෂ නොවේද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. යම් භික්ෂුවක් පිරිස් අතර හැසිරීමට දක්ෂ ද වේද, නමුත් පිරිසක් මැද නිර්භීතව ධර්මය දේශනා නොකරයිද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. යම් භික්ෂුවක් පිරිසක් මැද නිර්භීතව ධර්මය දේශනා කරයිද, නමුත් විනයධර නොවේද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. යම් භික්ෂුවක් විනයධර ද වේද, නමුත් ආරණ්‍යක නොවී හුදෙකලා සේනාසනයන්හි වාසය නොකරයිද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. යම් භික්ෂුවක් ආරණ්‍යක ද වේද, හුදෙකලා සේනාසනයන්හි වාසය ද කරයිද, නමුත් ආභිචෛතසික වූ, දැක්වූ ධර්මයෙහිම සැප විහරණ පිණිස පවත්නා වූ සිව් ධ්‍යානයන් කැමති පරිදි, අපහසුවකින් තොරව, දුෂ්කරතාවයකින් තොරව ලබන්නේ නොවේද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. යම් භික්ෂුවක් ආභිචෛතසික වූ, දැක්වූ ධර්මයෙහිම සැප විහරණ පිණිස පවත්නා වූ සිව් ධ්‍යානයන් කැමති පරිදි, අපහසුවකින් තොරව, දුෂ්කරතාවයකින් තොරව ලබන්නේ ද, නමුත් ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥා ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය නොකරයිද; එවිට ඔහු ඒ අංගයෙන් අසම්පූර්ණ වේ. එහෙයින් ඒ අංගය සම්පූර්ණ කළ යුතුයි – ‘කෙසේ නම් මම විශ්වාසයෙන් ද යුක්ත වූවෙක් ද, සිල්වත් වූවෙක් ද, බහුශ්‍රැත වූවෙක් ද, ධර්ම කථික වූවෙක් ද, පිරිස් අතර හැසිරීමට දක්ෂ වූවෙක් ද, පිරිසක් මැද නිර්භීතව ධර්මය දේශනා කරන්නෙක් ද, විනයධර වූවෙක් ද, ආරණ්‍යක වූවෙක් ද, හුදෙකලා සේනාසනයන්හි වාසය කරන්නෙක් ද, ආභිචෛතසික වූ, දැක්වූ ධර්මයෙහිම සැප විහරණ පිණිස පවත්නා වූ සිව් ධ්‍යානයන් කැමති පරිදි, අපහසුවකින් තොරව, දුෂ්කරතාවයකින් තොරව ලබන්නෙක් ද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥා ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය කරන්නෙක් ද වන්නෙම්ද’ යනුවෙනි.\n\nමහණෙනි, යම් කලක භික්ෂුව විශ්වාසයෙන් ද යුක්ත වේද, සිල්වත් ද වේද, බහුශ්‍රැත ද වේද, ධර්ම කථික ද වේද, පිරිස් අතර හැසිරීමට දක්ෂ ද වේද, පිරිසක් මැද නිර්භීතව ධර්මය දේශනා ද කරයිද, විනයධර ද වේද, ආරණ්‍යක ද වේද, හුදෙකලා සේනාසනයන්හි වාසය ද කරයිද, ආභිචෛතසික වූ, දැක්වූ ධර්මයෙහිම සැප විහරණ පිණිස පවත්නා වූ සිව් ධ්‍යානයන් කැමති පරිදි, අපහසුවකින් තොරව, දුෂ්කරතාවයකින් තොරව ලබන්නේ ද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥා ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, උපසම්පදා වී වාසය ද කරයිද; එවිට ඔහු ඒ අංගයෙන් සම්පූර්ණ වේ. මහණෙනි, මේ දස ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව සර්වප්‍රකාරයෙන් ප්‍රසන්න ද වේ, සියලු ආකාරයෙන් සම්පූර්ණ ද වේ.",
      "paliTitle": "Jhānasuttaṃ",
      "englishTitle": "The Jhāna Discourse",
      "sinhalaTitle": "ධ්‍යාන සූත්‍රය"
    },
    {
      "number": 9,
      "pali": "‘‘Saddho ca, bhikkhave, bhikkhu hoti, no ca sīlavā…pe… sīlavā ca, no ca bahussuto… bahussuto ca, no ca dhammakathiko… dhammakathiko ca, no ca parisāvacaro… parisāvacaro ca, no ca visārado parisāya dhammaṃ deseti… visārado ca parisāya dhammaṃ deseti, no ca vinayadharo… vinayadharo ca, no ca āraññiko pantasenāsano… āraññiko ca pantasenāsano, no ca ye te santā vimokkhā atikkamma rūpe āruppā te kāyena phusitvā viharati… ye te santā vimokkhā atikkamma rūpe āruppā te ca kāyena phusitvā viharati, no ca āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseyyaṃ, vinayadharo ca, āraññiko ca pantasenāsano, ye te santā vimokkhā atikkamma rūpe āruppā te ca kāyena phusitvā vihareyyaṃ, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti. ‘‘Yato ca kho, bhikkhave, bhikkhu saddho ca hoti, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseti, vinayadharo ca, āraññiko ca pantasenāsano, ye te santā vimokkhā atikkamma rūpe āruppā te ca kāyena phusitvā viharati, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati; evaṃ so tenaṅgena paripūro hoti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato bhikkhu samantapāsādiko ca hoti sabbākāraparipūro cā’’ti. Navamaṃ.",
      "english": "Monks, a bhikkhu may be endowed with faith, but not with moral conduct.\nHe may be endowed with moral conduct, but not widely learned.\nHe may be widely learned, but not a speaker of the Dhamma.\nHe may be a speaker of the Dhamma, but not one who frequents assemblies.\nHe may be one who frequents assemblies, but does not teach the Dhamma to an assembly with confidence.\nHe may teach the Dhamma to an assembly with confidence, but not be a master of the Vinaya.\nHe may be a master of the Vinaya, but not a forest-dweller in a remote abode.\nHe may be a forest-dweller in a remote abode, but not one who dwells having experienced with the body those peaceful liberations that transcend forms, the formless attainments.\nHe may dwell having experienced with the body those peaceful liberations that transcend forms, the formless attainments, but not one who dwells having directly known and realized for oneself in this very life, through the destruction of the taints, the taint-free liberation of mind and liberation by wisdom.\nIn this way, he is incomplete in that particular quality. That quality should be perfected by him, with the thought: ‘How can I be endowed with faith, and with moral conduct, and widely learned, and a speaker of the Dhamma, and one who frequents assemblies, and one who teaches the Dhamma to an assembly with confidence, and a master of the Vinaya, and a forest-dweller in a remote abode, and one who dwells having experienced with the body those peaceful liberations that transcend forms, the formless attainments, and one who dwells having directly known and realized for oneself in this very life, through the destruction of the taints, the taint-free liberation of mind and liberation by wisdom?’\n\nBut when, Monks, a bhikkhu is endowed with faith, and with moral conduct, and widely learned, and a speaker of the Dhamma, and one who frequents assemblies, and one who teaches the Dhamma to an assembly with confidence, and a master of the Vinaya, and a forest-dweller in a remote abode, and one who dwells having experienced with the body those peaceful liberations that transcend forms, the formless attainments, and one who dwells having directly known and realized for oneself in this very life, through the destruction of the taints, the taint-free liberation of mind and liberation by wisdom—\nin this way, he is complete in that particular quality. Monks, a bhikkhu endowed with these ten qualities is inspiring in every way and complete in all respects.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවන්ත වේ නම්, එහෙත් සිල්වත් නොවේ නම්; සිල්වත් වේ නම්, එහෙත් බහුශ්‍රැත නොවේ නම්; බහුශ්‍රැත වේ නම්, එහෙත් ධර්ම කථික නොවේ නම්; ධර්ම කථික වේ නම්, එහෙත් පිරිස් ඇසුරට හුරු නොවේ නම්; පිරිස් ඇසුරට හුරු වේ නම්, එහෙත් පිරිස තුළ නිර්භයව ධර්මය දේශනා නොකරයි නම්; පිරිස තුළ නිර්භයව ධර්මය දේශනා කරයි නම්, එහෙත් විනයධර නොවේ නම්; විනයධර වේ නම්, එහෙත් ආරණ්‍යකව, හුදෙකලා සෙනසුන්හි වාසය කරන්නෙක් නොවේ නම්; ආරණ්‍යකව, හුදෙකලා සෙනසුන්හි වාසය කරන්නෙක් වේ නම්, එහෙත් රූපයන් ඉක්මවා පවතින යම් ඒ ශාන්ත අරූප විමෝක්ෂයෝ ඇද්ද, ඒවා කාය සාක්ෂාත් කරගෙන වාසය නොකරයි නම්; යම් ඒ ශාන්ත අරූප විමෝක්ෂයෝ ඇද්ද, ඒවා කාය සාක්ෂාත් කරගෙන වාසය කරයි නම්, එහෙත් ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට උපසම්පදා වී වාසය නොකරයි නම්. ඒ අනුව ඔහු ඒ අංගයෙන් අපරිපූර්ණ වේ. එබැවින් ඔහු විසින් ඒ අංගය සම්පූර්ණ කරගත යුතුය – ‘කෙසේ නම් මම ශ්‍රද්ධාවන්ත වෙම් ද, සිල්වත් වෙම් ද, බහුශ්‍රැත වෙම් ද, ධර්ම කථික වෙම් ද, පිරිස් ඇසුරට හුරු වෙම් ද, පිරිස තුළ නිර්භයව ධර්මය දේශනා කරම් ද, විනයධර වෙම් ද, ආරණ්‍යකව, හුදෙකලා සෙනසුන්හි වාසය කරන්නෙක් වෙම් ද, රූපයන් ඉක්මවා පවතින යම් ඒ ශාන්ත අරූප විමෝක්ෂයෝ ඇද්ද, ඒවා කාය සාක්ෂාත් කරගෙන වාසය කරම් ද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට උපසම්පදා වී වාසය කරම් ද’ යනුවෙනි.\n\nමහණෙනි, යම් කලෙක භික්ෂුවක් ශ්‍රද්ධාවන්ත වේ ද, සිල්වත් වේ ද, බහුශ්‍රැත වේ ද, ධර්ම කථික වේ ද, පිරිස් ඇසුරට හුරු වේ ද, පිරිස තුළ නිර්භයව ධර්මය දේශනා කරයි ද, විනයධර වේ ද, ආරණ්‍යකව, හුදෙකලා සෙනසුන්හි වාසය කරන්නෙක් වේ ද, රූපයන් ඉක්මවා පවතින යම් ඒ ශාන්ත අරූප විමෝක්ෂයෝ ඇද්ද, ඒවා කාය සාක්ෂාත් කරගෙන වාසය කරයි ද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට උපසම්පදා වී වාසය කරයි ද; ඒ අනුව ඔහු ඒ අංගයෙන් පිරිපූර්ණ වේ. මහණෙනි, මේ දස ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුව සියලු අයුරින් ප්‍රසන්න ද වේ, සියලු ආකාරයෙන් පිරිපූර්ණ ද වේ.",
      "paliTitle": "Santavimokkhasuttaṃ",
      "englishTitle": "Discourse on Calm Liberation",
      "sinhalaTitle": "ශාන්ත විමුක්ති සූත්‍රය"
    },
    {
      "number": 10,
      "pali": "‘‘Saddho ca, bhikkhave, bhikkhu hoti, no ca sīlavā. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ sīlavā cā’ti. Yato ca kho, bhikkhave, bhikkhu saddho ca hoti, sīlavā ca, evaṃ so tenaṅgena paripūro hoti. ‘‘Saddho ca, bhikkhave, bhikkhu hoti sīlavā ca, no ca bahussuto bahussuto ca, no ca dhammakathiko dhammakathiko ca, no ca parisāvacaro parisāvacaro ca, no ca visārado parisāya dhammaṃ deseti visārado ca parisāya dhammaṃ deseti, no ca vinayadharo vinayadharo ca, no ca anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Anekavihitañca…pe… pubbenivāsaṃ anussarati, no ca dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti dibbena ca cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, no ca āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Evaṃ so tenaṅgena aparipūro hoti. Tena taṃ aṅgaṃ paripūretabbaṃ – ‘kintāhaṃ saddho ca assaṃ, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseyyaṃ, vinayadharo ca, anekavihitañca pubbenivāsaṃ anussareyyaṃ, seyyathidaṃ, ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussareyyaṃ, dibbena ca cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajāneyyaṃ, āsavānañca khayā…pe… sacchikatvā upasampajja vihareyya’nti. ‘‘Yato ca kho, bhikkhave, bhikkhu saddho ca hoti, sīlavā ca, bahussuto ca, dhammakathiko ca, parisāvacaro ca, visārado ca parisāya dhammaṃ deseti, vinayadharo ca, anekavihitañca pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati, dibbena ca cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ so tenaṅgena paripūro hoti. Imehi, kho, bhikkhave, dasahi dhammehi samannāgato bhikkhu samantapāsādiko ca hoti sabbākāraparipūro cā’’ti. Dasamaṃ. ",
      "english": "“Monks, if a bhikkhu is endowed with faith, but not with morality, then he is incomplete in that respect. Therefore, he should complete that factor, thinking: ‘How might I be both endowed with faith and with morality?’ And when, monks, a bhikkhu is both endowed with faith and morality, then he is complete in that respect.\n\n“Monks, if a bhikkhu is endowed with faith and morality, but not learned; if learned, but not a Dhamma speaker; if a Dhamma speaker, but not accustomed to assemblies; if accustomed to assemblies, but not confident in teaching the Dhamma to an assembly; if confident in teaching the Dhamma to an assembly, but not a master of the Vinaya; if a master of the Vinaya, but does not recollect his manifold past lives, that is to say, one birth, two births, up to many eons, with all their modes and details; if he recollects manifold past lives, but does not perceive beings passing away and reappearing according to their kamma with the divine eye, purified and surpassing that of humans; if he perceives beings passing away and reappearing according to their kamma with the divine eye, purified and surpassing that of humans, but does not, with the destruction of the taints, enter and dwell in the taint-free liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life. Thus, he is incomplete in that respect. Therefore, he should complete that factor, thinking: ‘How might I be endowed with faith, and with morality, and learned, and a Dhamma speaker, and accustomed to assemblies, and confident in teaching the Dhamma to an assembly, and a master of the Vinaya, and recollect manifold past lives, that is to say, one birth, two births, up to many eons, with all their modes and details; and perceive beings passing away and reappearing according to their kamma with the divine eye, purified and surpassing that of humans; and, with the destruction of the taints, enter and dwell in the taint-free liberation of mind and liberation by wisdom, having realized it for myself with direct knowledge in this very life?’\n\n“And when, monks, a bhikkhu is endowed with faith, and with morality, and learned, and a Dhamma speaker, and accustomed to assemblies, and confident in teaching the Dhamma to an assembly, and a master of the Vinaya; and he recollects his manifold past lives, that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of world-dissolution, many eons of world-evolution, many eons of world-dissolution and world-evolution, recollecting ‘there I was of such a name, such a clan, such an appearance, such was my food, such my experience of pleasure and pain, such my lifespan; thence I passed away and reappeared elsewhere; there too I was of such a name, such a clan, such an appearance, such was my food, such my experience of pleasure and pain, such my lifespan; and thence I passed away and reappeared here.’ Thus he recollects his manifold past lives, with all their modes and details. And he perceives with the divine eye, purified and surpassing that of humans, beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their kamma. ‘Indeed, these venerable beings, who were ill-conducted in body, speech, and mind, revilers of noble ones, holding wrong views and acting according to wrong views, with the breakup of the body, after death, have reappeared in a state of deprivation, in an unhappy destination, in perdition, in hell. But these venerable beings, who were well-conducted in body, speech, and mind, not revilers of noble ones, holding right views and acting according to right views, with the breakup of the body, after death, have reappeared in a happy destination, in the heavenly world.’ Thus he perceives with the divine eye, purified and surpassing that of humans, beings passing away and reappearing, and he understands how beings fare according to their kamma. And, with the destruction of the taints, he enters and dwells in the taint-free liberation of mind and liberation by wisdom, having realized it for himself with direct knowledge in this very life. Thus, he is complete in that respect. Endowed with these ten qualities, monks, a bhikkhu is admirable in all respects and complete in every way.",
      "sinhala": "මහණෙනි, යම් භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක් වෙයි, එහෙත් සිල්වත් නොවෙයි. මෙසේ ඔහු ඒ අංගයෙන් අසම්පූර්ණ වෙයි. ‘කෙසේ නම් මම ශ්‍රද්ධාවන්තයෙක්ද, සිල්වතෙක්ද වන්නෙම්දැ’යි සිතා ඒ අංගය සම්පූර්ණ කළ යුතුයි. මහණෙනි, යම් කලක භික්ෂුව ශ්‍රද්ධාවන්තයෙක්ද වෙයි, සිල්වතෙක්ද වෙයි, මෙසේ ඔහු ඒ අංගයෙන් සම්පූර්ණ වෙයි.\n\nමහණෙනි, භික්ෂුවක් ශ්‍රද්ධාවන්තයෙක්ද වෙයි, සිල්වතෙක්ද වෙයි, එහෙත් බහුශ්‍රැත නොවෙයි. බහුශ්‍රැතයෙක්ද වෙයි, එහෙත් ධර්ම කථිකයෙක් නොවෙයි. ධර්ම කථිකයෙක්ද වෙයි, එහෙත් පිරිසට සමීප අයෙක් නොවෙයි. පිරිසට සමීප අයෙක්ද වෙයි, එහෙත් පිරිස තුළ නිර්භීතව ධර්මය දේශනා නොකරයි. පිරිස තුළ නිර්භීතව ධර්මය දේශනා කරන්නෙක්ද වෙයි, එහෙත් විනයධරයෙක් නොවෙයි. විනයධරයෙක්ද වෙයි, එහෙත් නොයෙකුත් පූර්වනිවාසයන් (පෙර ආත්මභාවයන්) සිහි නොකරයි. ඒ කෙසේද යත්: එක් ජාතියක්, දෙකක්, තුනක්, සතරක්, පහක්, දසයක්, විස්සක්, තිහක්, සතළිහක්, පනහක්, සියයක්, දහසක්, ලක්ෂයක්, නොයෙක් සංවට්ට කල්ප, නොයෙක් විවට්ට කල්ප, නොයෙක් සංවට්ට-විවට්ට කල්ප සිහි කරන්නේ ‘එතන මම මෙබඳු නමක් ඇතිව, මෙබඳු ගෝත්‍රයක් ඇතිව, මෙබඳු වර්ණයක් ඇතිව, මෙබඳු ආහාර ඇතිව, මෙබඳු සැපදුක් විඳිමින්, මෙබඳු දීර්ඝායුෂ ඇතියෙක්ව සිටියෙමි. එතැනින් චුතව මෙතැන උපන්නෙමි’යි මෙසේ ආකාර සහිතව, විස්තර සහිතව නොයෙකුත් පූර්වනිවාසයන් සිහි නොකරයි. නොයෙකුත් පූර්වනිවාසයන් සිහි කරයි, එහෙත් පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය දිවැසින් කර්මයට අනුව උපදින සත්වයන් නොදකී. පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය දිවැසින් කර්මයට අනුව උපදින සත්වයන් දකී, එහෙත් ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය නොකරයි. මෙසේ ඔහු ඒ අංගයෙන් අසම්පූර්ණ වෙයි. ‘කෙසේ නම් මම ශ්‍රද්ධාවන්තයෙක්ද, සිල්වතෙක්ද, බහුශ්‍රැතයෙක්ද, ධර්ම කථිකයෙක්ද, පිරිසට සමීප අයෙක්ද, පිරිස තුළ නිර්භීතව ධර්මය දේශනා කරන්නෙක්ද, විනයධරයෙක්ද, නොයෙකුත් පූර්වනිවාසයන් සිහි කරන්නෙක්ද වන්නෙම්ද - ඒ කෙසේද යත්: එක් ජාතියක් හෝ දෙකක් හෝ... මෙසේ ආකාර සහිතව, විස්තර සහිතව නොයෙකුත් පූර්වනිවාසයන් සිහි කරන්නෙක්ද වන්නෙම්ද, පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය දිවැසින් කර්මයට අනුව උපදින සත්වයන් දකින්නෙක්ද වන්නෙම්ද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරන්නෙක්ද වන්නෙම්දැ’යි සිතා ඒ අංගය සම්පූර්ණ කළ යුතුයි.\n\nමහණෙනි, යම් කලක භික්ෂුව ශ්‍රද්ධාවන්තයෙක්ද වෙයි, සිල්වතෙක්ද වෙයි, බහුශ්‍රැතයෙක්ද වෙයි, ධර්ම කථිකයෙක්ද වෙයි, පිරිසට සමීප අයෙක්ද වෙයි, පිරිස තුළ නිර්භීතව ධර්මය දේශනා කරන්නෙක්ද වෙයි, විනයධරයෙක්ද වෙයි, නොයෙකුත් පූර්වනිවාසයන් සිහි කරන්නෙක්ද වෙයි - ඒ කෙසේද යත්: එක් ජාතියක් හෝ දෙකක් හෝ... මෙසේ ආකාර සහිතව, විස්තර සහිතව නොයෙකුත් පූර්වනිවාසයන් සිහි කරයි, පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය දිවැසින් කර්මයට අනුව උපදින සත්වයන් දකී, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට සාක්ෂාත් කරගෙන වාසය කරයි. මෙසේ ඔහු ඒ අංගයෙන් සම්පූර්ණ වෙයි. මහණෙනි, මේ දස ධර්මයන්ගෙන් සමන්විත වූ භික්ෂුව සර්වාකාරයෙන් ප්‍රසාද ජනකද වෙයි, සියලු ආකාරයෙන් සම්පූර්ණද වෙයි.",
      "paliTitle": "Vijjāsuttaṃ",
      "englishTitle": "The Discourse on Knowledge",
      "sinhalaTitle": "විජ්ජා සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Ānisaṃsavaggo paṭhamo. Tassuddānaṃ – Kimatthiyaṃ cetanā ca, tayo upanisāpi ca; Samādhi sāriputto ca, jhānaṃ santena vijjayāti.",
    "english": "The First Chapter on Benefits",
    "sinhala": "පළමු ආනිසංස වග‍්ගය"
  }
}