{
  "id": "an10.12",
  "title": {
    "pali": "Paccorohaṇivaggo",
    "english": "The Chapter on Descending",
    "sinhala": "පිරිහීමේ වර්ගය"
  },
  "sections": [
    {
      "number": 113,
      "pali": "[a. ni. 10.171] ‘‘Adhammo ca, bhikkhave, veditabbo anattho ca; dhammo ca veditabbo attho ca. Adhammañca viditvā anatthañca, dhammañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabbaṃ. ‘‘Katamo ca, bhikkhave, adhammo ca anattho ca? Micchādiṭṭhi, micchāsaṅkappo, micchāvācā, micchākammanto, micchāājīvo, micchāvāyāmo, micchāsati, micchāsamādhi, micchāñāṇaṃ, micchāvimutti – ayaṃ vuccati, bhikkhave, adhammo ca anattho ca. ‘‘Katamo ca, bhikkhave, dhammo ca attho ca? Sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi, sammāñāṇaṃ, sammāvimutti – ayaṃ vuccati, bhikkhave, dhammo ca attho ca. ‘‘‘Adhammo ca, bhikkhave, veditabbo anattho ca; dhammo ca veditabbo attho ca. Adhammañca viditvā anatthañca, dhammañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Paṭhamaṃ.",
      "english": "Monks, the unwholesome and the disadvantageous are to be understood; the wholesome and the advantageous are also to be understood. Having understood the unwholesome and the disadvantageous, and having understood the wholesome and the advantageous, one should practice in accordance with the wholesome and the beneficial.\n\nAnd what, monks, is the unwholesome and the disadvantageous? Wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation – this, monks, is called the unwholesome and the disadvantageous.\n\nAnd what, monks, is the wholesome and the advantageous? Right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation – this, monks, is called the wholesome and the advantageous.\n\nWhen it was said, “Monks, the unwholesome and the disadvantageous are to be understood; the wholesome and the advantageous are also to be understood. Having understood the unwholesome and the disadvantageous, and having understood the wholesome and the advantageous, one should practice in accordance with the wholesome and the beneficial,” it was said with reference to this.",
      "sinhala": "මහණෙනි, අධර්මය ද අර්ථය නොවන ද (අහිතකර වූ ද) දැනගත යුතුය; ධර්මය ද අර්ථය ද (හිතකර වූ ද) දැනගත යුතුය. අධර්මය ද අර්ථය නොවන ද දැනගෙන, ධර්මය ද අර්ථය ද දැනගෙන, ධර්මයට අනුකූලව ද අර්ථයට අනුකූලව ද ඒ ආකාරයෙන් පිළිපැදිය යුතුය.\n\nමහණෙනි, අධර්මය ද අර්ථය නොවන ද යනු කවරේද? මිථ්‍යාදෘෂ්ටිය, මිථ්‍යාසංකල්පය, මිථ්‍යාවාචාව, මිථ්‍යාකර්මාන්තය, මිථ්‍යාආජීවය, මිථ්‍යාවායාමය, මිථ්‍යාසතිය, මිථ්‍යාසමාධිය, මිථ්‍යාඥානය, මිථ්‍යාවිමුක්තිය – මහණෙනි, මෙය අධර්මය ද අර්ථය නොවන ද යැයි කියනු ලැබේ.\n\nමහණෙනි, ධර්මය ද අර්ථය ද යනු කවරේද? සම්මාදිට්ඨිය, සම්මාසංකල්පය, සම්මාවාචාව, සම්මාකර්මාන්තය, සම්මාආජීවය, සම්මාවායාමය, සම්මාසතිය, සම්මාසමාධිය, සම්මාඥානය, සම්මාවිමුක්තිය – මහණෙනි, මෙය ධර්මය ද අර්ථය ද යැයි කියනු ලැබේ.\n\n‘මහණෙනි, අධර්මය ද අර්ථය නොවන ද දැනගත යුතුය; ධර්මය ද අර්ථය ද දැනගත යුතුය. අධර්මය ද අර්ථය නොවන ද දැනගෙන, ධර්මය ද අර්ථය ද දැනගෙන, ධර්මයට අනුකූලව ද අර්ථයට අනුකූලව ද ඒ ආකාරයෙන් පිළිපැදිය යුතුය’ යනු යම් හෙයකින් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දකි.",
      "paliTitle": "Paṭhamaadhammasuttaṃ"
    },
    {
      "number": 114,
      "pali": "‘‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabbaṃ. ‘‘Katamo ca, bhikkhave, adhammo, katamo ca dhammo, katamo ca anattho, katamo ca attho? ‘‘Micchādiṭṭhi, bhikkhave, adhammo; sammādiṭṭhi dhammo; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāsaṅkappo, bhikkhave, adhammo; sammāsaṅkappo dhammo; ye ca micchāsaṅkappapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāsaṅkappapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāvācā, bhikkhave, adhammo; sammāvācā dhammo; ye ca micchāvācāpaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāvācāpaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchākammanto, bhikkhave, adhammo; sammākammanto dhammo; ye ca micchākammantapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammākammantapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāājīvo, bhikkhave, adhammo; sammāājīvo dhammo; ye ca micchāājīvapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāājīvapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāvāyāmo, bhikkhave, adhammo; sammāvāyāmo dhammo; ye ca micchāvāyāmapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāvāyāmapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāsati, bhikkhave, adhammo; sammāsati dhammo; ye ca micchāsatipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāsatipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāsamādhi, bhikkhave, adhammo; sammāsamādhi dhammo; ye ca micchāsamādhipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāsamādhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāñāṇaṃ, bhikkhave, adhammo; sammāñāṇaṃ dhammo; ye ca micchāñāṇapaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāñāṇapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāvimutti, bhikkhave, adhammo; sammāvimutti dhammo; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Dutiyaṃ.",
      "english": "Monks, what is not Dhamma should be known, and what is Dhamma should be known; what is not beneficial should be known, and what is beneficial should be known. Having known what is not Dhamma and what is Dhamma, and having known what is not beneficial and what is beneficial, one should practice accordingly, in line with Dhamma and in line with what is beneficial.\n\nAnd what, monks, is not Dhamma, what is Dhamma, what is not beneficial, what is beneficial?\n\nWrong View, monks, is not Dhamma; Right View is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong View—this is what is not beneficial. And those many wholesome states that, conditioned by Right View, come to fulfillment through development—this is what is beneficial.\n\nWrong Intention, monks, is not Dhamma; Right Intention is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Intention—this is what is not beneficial. And those many wholesome states that, conditioned by Right Intention, come to fulfillment through development—this is what is beneficial.\n\nWrong Speech, monks, is not Dhamma; Right Speech is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Speech—this is what is not beneficial. And those many wholesome states that, conditioned by Right Speech, come to fulfillment through development—this is what is beneficial.\n\nWrong Action, monks, is not Dhamma; Right Action is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Action—this is what is not beneficial. And those many wholesome states that, conditioned by Right Action, come to fulfillment through development—this is what is beneficial.\n\nWrong Livelihood, monks, is not Dhamma; Right Livelihood is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Livelihood—this is what is not beneficial. And those many wholesome states that, conditioned by Right Livelihood, come to fulfillment through development—this is what is beneficial.\n\nWrong Effort, monks, is not Dhamma; Right Effort is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Effort—this is what is not beneficial. And those many wholesome states that, conditioned by Right Effort, come to fulfillment through development—this is what is beneficial.\n\nWrong Mindfulness, monks, is not Dhamma; Right Mindfulness is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Mindfulness—this is what is not beneficial. And those many wholesome states that, conditioned by Right Mindfulness, come to fulfillment through development—this is what is beneficial.\n\nWrong Concentration, monks, is not Dhamma; Right Concentration is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Concentration—this is what is not beneficial. And those many wholesome states that, conditioned by Right Concentration, come to fulfillment through development—this is what is beneficial.\n\nWrong Knowledge, monks, is not Dhamma; Right Knowledge is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Knowledge—this is what is not beneficial. And those many wholesome states that, conditioned by Right Knowledge, come to fulfillment through development—this is what is beneficial.\n\nWrong Liberation, monks, is not Dhamma; Right Liberation is Dhamma. And those many evil, unwholesome states that arise conditioned by Wrong Liberation—this is what is not beneficial. And those many wholesome states that, conditioned by Right Liberation, come to fulfillment through development—this is what is beneficial.\n\n‘Monks, what is not Dhamma should be known, and what is Dhamma should be known; what is not beneficial should be known, and what is beneficial should be known. Having known what is not Dhamma and what is Dhamma, and having known what is not beneficial and what is beneficial, one should practice accordingly, in line with Dhamma and in line with what is beneficial.’ This is why that was stated.",
      "sinhala": "මහණෙනි, අධර්මය ද දැනගත යුතු ය, ධර්මය ද දැනගත යුතු ය. අනර්ථය ද දැනගත යුතු ය, අර්ථය ද දැනගත යුතු ය. අධර්මය ද ධර්මය ද දැනගෙන, අනර්ථය ද අර්ථය ද දැනගෙන, ධර්මය අනුව ද අර්ථය අනුව ද පිළිපැදිය යුතු ය.\n\nමහණෙනි, අධර්මය කවරේ ද, ධර්මය කවරේ ද? අනර්ථය කවරේ ද, අර්ථය කවරේ ද?\n\nමහණෙනි, මිථ්‍යාදෘෂ්ටිය අධර්මය යි; සම්මාදිට්ඨිය ධර්මය යි. මිථ්‍යාදෘෂ්ටිය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාදිට්ඨිය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාසංකල්පය අධර්මය යි; සම්මාසංකල්පය ධර්මය යි. මිථ්‍යාසංකල්පය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාසංකල්පය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාවාචාව අධර්මය යි; සම්මාවාචාව ධර්මය යි. මිථ්‍යාවාචාව හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාවාචාව හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාකර්මාන්තය අධර්මය යි; සම්මාකර්මාන්තය ධර්මය යි. මිථ්‍යාකර්මාන්තය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාකර්මාන්තය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාආජීවය අධර්මය යි; සම්මාආජීවය ධර්මය යි. මිථ්‍යාආජීවය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාආජීවය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාවායාමය අධර්මය යි; සම්මාවායාමය ධර්මය යි. මිථ්‍යාවායාමය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාවායාමය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාසතිය අධර්මය යි; සම්මාසතිය ධර්මය යි. මිථ්‍යාසතිය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාසතිය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාසමාධිය අධර්මය යි; සම්මාසමාධිය ධර්මය යි. මිථ්‍යාසමාධිය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාසමාධිය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාඥානය අධර්මය යි; සම්මාඥානය ධර්මය යි. මිථ්‍යාඥානය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාඥානය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\nමහණෙනි, මිථ්‍යාවිමුක්තිය අධර්මය යි; සම්මාවිමුක්තිය ධර්මය යි. මිථ්‍යාවිමුක්තිය හේතු කොටගෙන යම් බොහෝ පව්කම් සහිත අකුසල ධර්මයන් හටගනී ද, මෙය අනර්ථය යි. සම්මාවිමුක්තිය හේතු කොටගෙන යම් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පැමිණේ ද, මෙය අර්ථය යි.\n\n\"මහණෙනි, අධර්මය ද ධර්මය ද දැනගත යුතු ය; අනර්ථය ද අර්ථය ද දැනගත යුතු ය. අධර්මය ද ධර්මය ද දැනගෙන, අනර්ථය ද අර්ථය ද දැනගෙන, ධර්මය අනුව ද අර්ථය අනුව ද පිළිපැදිය යුතු ය\" යනුවෙන්, යමක් කියන ලද්දේ ද, එය මේ කරුණ අරබයා කියන ලද්දේ ය.\nදෙවැනි යි.",
      "paliTitle": "Dutiyaadhammasuttaṃ"
    },
    {
      "number": 115,
      "pali": "‘‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’’nti. Idamavoca bhagavā. Idaṃ vatvāna sugato uṭṭhāyāsanā vihāraṃ pāvisi. Atha kho tesaṃ bhikkhūnaṃ acirapakkantassa bhagavato etadahosi – ‘‘idaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti. Ko nu kho imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajeyyā’’ti? Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ kho āyasmā ānando satthu ceva saṃvaṇṇito sambhāvito ca viññūnaṃ sabrahmacārīnaṃ. Pahoti cāyasmā ānando imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajituṃ. Yaṃnūna mayaṃ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṃ ānandaṃ etamatthaṃ paṭipuccheyyāma [puccheyyāma (sī. syā. pī.) ma. ni. 1.202 passitabbaṃ]. Yathā no āyasmā ānando byākarissati tathā naṃ dhāressāmā’’ti. Atha kho te bhikkhū yenāyasmā ānando tenupasaṅkamiṃsu; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū āyasmantaṃ ānandaṃ etadavocuṃ – ‘‘Idaṃ kho no, āvuso ānanda, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca…pe… tathā paṭipajjitabba’nti. ‘‘Tesaṃ no, āvuso, amhākaṃ acirapakkantassa bhagavato etadahosi – ‘idaṃ kho no, āvuso, bhagavatā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – adhammo ca…pe… tathā paṭipajjitabbanti. Ko nu kho imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajeyyā’ti? ‘‘Tesaṃ no, āvuso, amhākaṃ etadahosi – ‘ayaṃ kho āyasmā ānando satthu ceva saṃvaṇṇito sambhāvito ca viññūnaṃ sabrahmacārīnaṃ. Pahoti cāyasmā ānando imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajituṃ. Yaṃnūna mayaṃ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṃ ānandaṃ etamatthaṃ paṭipuccheyyāma. Yathā no āyasmā ānando byākarissati tathā naṃ dhāressāmā’ti. Vibhajatu āyasmā ānando’’ti. ‘‘Seyyathāpi, āvuso, puriso sāratthiko sāragavesī sārapariyesanaṃ caramāno mahato rukkhassa tiṭṭhato sāravato atikkammeva mūlaṃ atikkamma khandhaṃ sākhāpalāse sāraṃ pariyesitabbaṃ maññeyya; evaṃsampadamidaṃ āyasmantānaṃ satthari sammukhībhūte taṃ bhagavantaṃ atisitvā amhe etamatthaṃ paṭipucchitabbaṃ maññatha. So hāvuso, bhagavā jānaṃ jānāti passaṃ passati, cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. So ceva panetassa kālo ahosi yaṃ tumhe bhagavantaṃyeva upasaṅkamitvā etamatthaṃ paṭipuccheyyātha. Yathā vo bhagavā byākareyya tathā naṃ dhāreyyāthā’’ti. ‘‘Addhāvuso ānanda, bhagavā jānaṃ jānāti passaṃ passati cakkhubhūto ñāṇabhūto dhammabhūto brahmabhūto vattā pavattā atthassa ninnetā amatassa dātā dhammassāmī tathāgato. So ceva panetassa kālo ahosi yaṃ mayaṃ bhagavantaṃyeva upasaṅkamitvā etamatthaṃ paṭipuccheyyāma, yathā no bhagavā byākareyya tathā naṃ dhāreyyāma. Api cāyasmā ānando satthu ceva saṃvaṇṇito sambhāvito ca viññūnaṃ sabrahmacārīnaṃ. Pahoti cāyasmā ānando imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajituṃ. Vibhajatāyasmā ānando agaruṃ katvā’’ti. ‘‘Tenahāvuso, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū āyasmato ānandassa paccassosuṃ. Athāyasmā ānando etadavoca – ‘‘Yaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti. Katamo cāvuso, adhammo, katamo ca dhammo, katamo ca anattho, katamo ca attho? ‘‘Micchādiṭṭhi, āvuso, adhammo; sammādiṭṭhi dhammo; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāsaṅkappo, āvuso, adhammo; sammāsaṅkappo dhammo… micchāvācā, āvuso, adhammo; sammāvācā dhammo … micchākammanto, āvuso, adhammo; sammākammanto dhammo… micchāājīvo, āvuso, adhammo; sammāājīvo dhammo… micchāvāyāmo, āvuso, adhammo; sammāvāyāmo dhammo… micchāsati, āvuso, adhammo; sammāsati dhammo… micchāsamādhi, āvuso, adhammo; sammāsamādhi dhammo… micchāñāṇaṃ, āvuso, adhammo; sammāñāṇaṃ dhammo…. Micchāvimutti, āvuso, adhammo; sammāvimutti dhammo; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Ayaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo dhammo ca…pe… tathā paṭipajjitabba’nti, imassa kho ahaṃ, āvuso, bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa evaṃ vitthārena atthaṃ ājānāmi. Ākaṅkhamānā ca pana tumhe, āvuso, bhagavantaṃyeva upasaṅkamitvā etamatthaṃ paṭipuccheyyātha. Yathā vo bhagavā byākaroti [byākareyya (syā.)] tathā naṃ dhāreyyāthā’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū āyasmato ānandassa bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘Yaṃ kho no bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – ‘adhammo ca, bhikkhave, veditabbo…pe… tathā paṭijjitabba’nti. ‘‘Tesaṃ no, bhante, amhākaṃ acirapakkantassa bhagavato etadahosi – ‘idaṃ kho no, āvuso, bhagavā saṃkhittena uddesaṃ uddisitvā vitthārena atthaṃ avibhajitvā uṭṭhāyāsanā vihāraṃ paviṭṭho – adhammo ca, bhikkhave, veditabbo…pe… tathā paṭipajjitabbanti. Ko nu kho imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajeyyā’ti? ‘‘Tesaṃ no, bhante, amhākaṃ etadahosi – ‘ayaṃ kho āyasmā ānando satthu ceva saṃvaṇṇito sambhāvito ca viññūnaṃ sabrahmacārīnaṃ. Pahoti cāyasmā ānando imassa bhagavatā saṃkhittena uddesassa uddiṭṭhassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ vibhajituṃ. Yaṃnūna mayaṃ yenāyasmā ānando tenupasaṅkameyyāma; upasaṅkamitvā āyasmantaṃ ānandaṃ etamatthaṃ paṭipuccheyyāma. Yathā no āyasmā ānando byākarissati tathā naṃ dhāressāmā’ti. ‘‘Atha kho mayaṃ, bhante, yenāyasmā ānando tenupasaṅkamimhā; upasaṅkamitvā āyasmantaṃ ānandaṃ etamatthaṃ apucchimhā. Tesaṃ no, bhante, āyasmatā ānandena imehi ākārehi imehi padehi imehi byañjanehi attho suvibhatto’’ti [vibhattoti (?) evameva hi aññesu īdisasuttesu dissati]. ‘‘Sādhu sādhu, bhikkhave! Paṇḍito, bhikkhave, ānando. Mahāpañño, bhikkhave, ānando. Maṃ cepi tumhe, bhikkhave, upasaṅkamitvā etamatthaṃ paṭipuccheyyātha, ahampi cetaṃ evamevaṃ [ahampi taṃ evamevaṃ (ma. ni. 1.205)] byākareyyaṃ yathā taṃ ānandena byākataṃ. Eso ceva tassa [eso cevetassa (ma. ni. 1.205)] attho evañca naṃ dhāreyyāthā’’ti. Tatiyaṃ.",
      "english": "Monastics, what is unwholesome must be known, and what is wholesome must be known. What is unbeneficial must be known, and what is beneficial must be known. Having known what is unwholesome and what is wholesome, having known what is unbeneficial and what is beneficial, one should practice in accordance with the wholesome and the beneficial. This is what the Blessed One said. Having said this, the Fortunate One rose from his seat and entered the monastery.\n\nThen, not long after the Blessed One had departed, this thought occurred to those monastics: \"Friends, the Blessed One has given us a brief discourse, without elaborating on its meaning, and has risen from his seat and entered the monastery, saying: ‘Monastics, what is unwholesome must be known, and what is wholesome must be known. What is unbeneficial must be known, and what is beneficial must be known. Having known what is unwholesome and what is wholesome, having known what is unbeneficial and what is beneficial, one should practice in accordance with the wholesome and the beneficial.’ Who then might expound in detail the meaning of this brief discourse given by the Blessed One, whose meaning was not expounded in detail?\"\n\nThen this thought occurred to those monastics: \"Indeed, Venerable Ananda has been praised by the Teacher himself and is esteemed by discerning fellow practitioners. Venerable Ananda is capable of expounding in detail the meaning of this brief discourse given by the Blessed One, whose meaning was not expounded in detail. What if we were to go to where Venerable Ananda is, and having approached him, ask Venerable Ananda about this matter? As Venerable Ananda explains it to us, so shall we remember it.\"\n\nThen those monastics went to where Venerable Ananda was, and having approached him, they exchanged friendly greetings with Venerable Ananda. Having concluded their courteous and memorable talk, they sat down to one side. Seated to one side, those monastics then said this to Venerable Ananda: \"Indeed, friend Ananda, the Blessed One gave us a brief discourse, without elaborating on its meaning, and rose from his seat and entered the monastery, saying: ‘Monastics, what is unwholesome must be known, and what is wholesome must be known. What is unbeneficial must be known, and what is beneficial must be known. Having known what is unwholesome and what is wholesome, having known what is unbeneficial and what is beneficial, one should practice in accordance with the wholesome and the beneficial.’\"\n\n\"Then, friend, not long after the Blessed One had departed, this thought occurred to us: ‘Indeed, friends, the Blessed One has given us a brief discourse, without elaborating on its meaning, and has risen from his seat and entered the monastery, saying: “Monastics, what is unwholesome must be known, and what is wholesome must be known. What is unbeneficial must be known, and what is beneficial must be known. Having known what is unwholesome and what is wholesome, having known what is unbeneficial and what is beneficial, one should practice in accordance with the wholesome and the beneficial.” Who then might expound in detail the meaning of this brief discourse given by the Blessed One, whose meaning was not expounded in detail?’\"\n\n\"Then, friend, this thought occurred to us: ‘Indeed, Venerable Ananda has been praised by the Teacher himself and is esteemed by discerning fellow practitioners. Venerable Ananda is capable of expounding in detail the meaning of this brief discourse given by the Blessed One, whose meaning was not expounded in detail. What if we were to go to where Venerable Ananda is, and having approached him, ask Venerable Ananda about this matter? As Venerable Ananda explains it to us, so shall we remember it.’ May Venerable Ananda expound on this matter!\"\n\n\"Friends, just as a man in need of heartwood, seeking heartwood, searching for heartwood, might, for a large, standing tree with heartwood, bypass the root and bypass the trunk, and imagine the heartwood is to be sought in the branches and leaves; so too, it is a similar case that while the Teacher was directly present, you Venerables, having bypassed the Blessed One, imagine that this matter should be asked of us. For that Blessed One, friends, knows what is to be known, sees what is to be seen. He has become the eye, has become knowledge, has become the Dhamma, has become Brahma. He is the speaker, the proclaimer, the guide to welfare, the giver of the Deathless, the master of the Dhamma, the Tathāgata. And indeed, it was the proper time for you to approach the Blessed One himself and ask him about this matter. As the Blessed One would explain it to you, so would you remember it.\"\n\n\"Truly, friend Ananda, the Blessed One knows what is to be known, sees what is to be seen. He has become the eye, has become knowledge, has become the Dhamma, has become Brahma. He is the speaker, the proclaimer, the guide to welfare, the giver of the Deathless, the master of the Dhamma, the Tathāgata. And indeed, it was the proper time for us to approach the Blessed One himself and ask him about this matter. As the Blessed One would explain it to us, so would we remember it. But Venerable Ananda has also been praised by the Teacher himself and is esteemed by discerning fellow practitioners. Venerable Ananda is capable of expounding in detail the meaning of this brief discourse given by the Blessed One, whose meaning was not expounded in detail. May Venerable Ananda expound on this matter, without reluctance!\"\n\n\"In that case, friends, listen, and pay close attention; I shall speak.\" \"Yes, friend,\" those monastics replied to Venerable Ananda.\n\nThen Venerable Ānanda said this: “Friends, the Blessed One gave us a brief teaching, and then rose from his seat and entered his dwelling without elaborating on its meaning: ‘Monks, what is unwholesome should be known, and what is wholesome should be known; what is detrimental should be known, and what is beneficial should be known. Having understood the unwholesome and the wholesome, the detrimental and the beneficial, one should practice accordingly, in line with the wholesome and the beneficial.’ But friends, what is unwholesome, what is wholesome, what is detrimental, and what is beneficial?”\n\n“Friends, wrong view is unwholesome; right view is wholesome. The many evil, unwholesome phenomena that arise conditioned by wrong view are detrimental; and the many wholesome phenomena that lead to the fulfillment of development, conditioned by right view, are beneficial.\n\n“Friends, wrong intention is unwholesome; right intention is wholesome… Wrong speech is unwholesome; right speech is wholesome… Wrong action is unwholesome; right action is wholesome… Wrong livelihood is unwholesome; right livelihood is wholesome… Wrong effort is unwholesome; right effort is wholesome… Wrong mindfulness is unwholesome; right mindfulness is wholesome… Wrong concentration is unwholesome; right concentration is wholesome… Wrong knowledge is unwholesome; right knowledge is wholesome… Wrong liberation is unwholesome; right liberation is wholesome. The many evil, unwholesome phenomena that arise conditioned by wrong liberation are detrimental; and the many wholesome phenomena that lead to the fulfillment of development, conditioned by right liberation, are beneficial.\n\n“Friends, this is how I understand in detail the meaning of the brief teaching given by the Blessed One, who rose from his seat and entered his dwelling without elaborating on its meaning: ‘Monks, what is unwholesome should be known, and what is wholesome should be known… one should practice accordingly, in line with the wholesome and the beneficial.’ If you wish, friends, you may approach the Blessed One himself and question him about this matter. You should remember it just as the Blessed One explains it to you.”\n\n“So be it, friend,” those monks replied. Having approved of and appreciated Venerable Ānanda’s words, they rose from their seats and approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side. Having sat to one side, those monks said to the Blessed One: “Venerable sir, the Blessed One gave us a brief teaching, and then rose from his seat and entered his dwelling without elaborating on its meaning: ‘Monks, what is unwholesome should be known… one should practice accordingly, in line with the wholesome and the beneficial.’\n\n“Venerable sir, after the Blessed One had recently departed, it occurred to us: ‘The Blessed One gave us this brief teaching, but rose from his seat and entered his dwelling without elaborating on its meaning: “Monks, what is unwholesome should be known… one should practice accordingly, in line with the wholesome and the beneficial.” Now, who could elaborate in detail on the meaning of this brief teaching given by the Blessed One, which was not elaborated upon?’\n\n“Then, Venerable sir, it occurred to us: ‘Indeed, Venerable Ānanda has been praised by the Teacher and is esteemed by discerning fellow practitioners. Venerable Ānanda is capable of elaborating in detail on the meaning of this brief teaching given by the Blessed One, which was not elaborated upon. What if we were to approach Venerable Ānanda and question him about this matter? We will remember it just as Venerable Ānanda explains it to us.’\n\n“So then, Venerable sir, we approached Venerable Ānanda, and we questioned Venerable Ānanda about this matter. And Venerable Ānanda explained the meaning to us with these modes, with these terms, and with these phrases.”\n\n“Excellent, monks! Excellent! Ānanda, monks, is wise. Ānanda, monks, has great wisdom. Even if you had approached me and questioned me about this matter, I would have explained it in exactly the same way as Ānanda has explained it. This is indeed its meaning, and you should remember it in this way.”",
      "sinhala": "භික්ෂූණි, අධර්මය ද, ධර්මය ද දැනගත යුතු ය; අනර්ථය ද, අර්ථය ද දැනගත යුතු ය. අධර්මය සහ ධර්මය ද, අනර්ථය සහ අර්ථය ද දැනගෙන, ධර්මයට අනුව ද, අර්ථයට අනුව ද පිළිපැදිය යුතු ය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාරා, සුගතයන් වහන්සේ හුනස්නෙන් නැගිට විහාරයට වැඩම කළ සේක.\n\nඑවිට, භාග්‍යවතුන් වහන්සේ වැඩම කර නොබෝ වේලාවකින් එම භික්ෂූන්ට මෙසේ සිතිණි: ‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ මේ දේශනාව සංක්ෂිප්තයෙන් ප්‍රකාශ කර, විස්තරාත්මකව අර්ථය නොබෙදා හුනස්නෙන් නැගිට විහාරයට වැඩම කළ සේක: ‘භික්ෂූණි, අධර්මය ද, ධර්මය ද දැනගත යුතු ය; අනර්ථය ද, අර්ථය ද දැනගත යුතු ය. අධර්මය සහ ධර්මය ද, අනර්ථය සහ අර්ථය ද දැනගෙන, ධර්මයට අනුව ද, අර්ථයට අනුව ද පිළිපැදිය යුතු ය’ යනුවෙන්. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තරාත්මකව අර්ථය නොබෙදන ලද මේ දේශනාවේ අර්ථය කවරෙක් නම් විස්තරාත්මකව විභාග කරන්නේ ද?’\n\nඑවිට, එම භික්ෂූන්ට මෙසේ සිතිණි: ‘ඇවැත් ආනන්ද හිමියන් ශාස්තෘන් වහන්සේ විසින් ප්‍රශංසා කරන ලද, නුවණැති සබ්‍රහ්මචාරීන් විසින් ගරු කරන ලද කෙනෙකි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තරාත්මකව අර්ථය නොබෙදන ලද මේ දේශනාවේ අර්ථය විස්තරාත්මකව විභාග කිරීමට ඇවැත් ආනන්ද හිමියන්ට පුළුවන. කෙසේ හෝ අපි ඇවැත් ආනන්ද හිමියන් වෙතට යමු; එළඹ, ඇවැත් ආනන්ද හිමියන්ගෙන් මේ කාරණය විමසමු. ඇවැත් ආනන්ද හිමියන් අපට කෙසේ විස්තර කරන්නේ ද, ඒ අයුරින් අපි එය සිහි තබාගනිමු.’\n\nඑවිට, එම භික්ෂූහු ඇවැත් ආනන්ද හිමියන් වෙතට එළඹියහ; එළඹ, ඇවැත් ආනන්ද හිමියන් සමඟ සතුටු වූහ. සතුටු විය යුතු, සිහි කටයුතු කතා බස් නිමා කර, එක් පැත්තකින් වාඩි වූහ. එක් පැත්තකින් වාඩි වී සිටි එම භික්ෂූහු ඇවැත් ආනන්ද හිමියන්ට මෙසේ කීහ: ‘ඇවැත් ආනන්ද, භාග්‍යවතුන් වහන්සේ මේ දේශනාව සංක්ෂිප්තයෙන් ප්‍රකාශ කර, විස්තරාත්මකව අර්ථය නොබෙදා හුනස්නෙන් නැගිට විහාරයට වැඩම කළ සේක – ‘අධර්මය ද... (යන ආදී වශයෙන්)... පිළිපැදිය යුතු ය’ යනුවෙන්.\n\n‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ වැඩම කර නොබෝ වේලාවකින් අපට මෙසේ සිතිණි: ‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ මේ දේශනාව සංක්ෂිප්තයෙන් ප්‍රකාශ කර, විස්තරාත්මකව අර්ථය නොබෙදා හුනස්නෙන් නැගිට විහාරයට වැඩම කළ සේක – අධර්මය ද... (යන ආදී වශයෙන්)... පිළිපැදිය යුතු ය’ යනුවෙන්. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තරාත්මකව අර්ථය නොබෙදන ලද මේ දේශනාවේ අර්ථය කවරෙක් නම් විස්තරාත්මකව විභාග කරන්නේ ද?’\n\n‘ඇවැත්නි, අපට මෙසේ සිතිණි: ‘ඇවැත් ආනන්ද හිමියන් ශාස්තෘන් වහන්සේ විසින් ප්‍රශංසා කරන ලද, නුවණැති සබ්‍රහ්මචාරීන් විසින් ගරු කරන ලද කෙනෙකි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තරාත්මකව අර්ථය නොබෙදන ලද මේ දේශනාවේ අර්ථය විස්තරාත්මකව විභාග කිරීමට ඇවැත් ආනන්ද හිමියන්ට පුළුවන. කෙසේ හෝ අපි ඇවැත් ආනන්ද හිමියන් වෙතට යමු; එළඹ, ඇවැත් ආනන්ද හිමියන්ගෙන් මේ කාරණය විමසමු. ඇවැත් ආනන්ද හිමියන් අපට කෙසේ විස්තර කරන්නේ ද, ඒ අයුරින් අපි එය සිහි තබාගනිමු’ යනුවෙන්. ඇවැත් ආනන්ද හිමියන් විභාග කර දෙනු මැනැවැ’යි.\n\n‘ඇවැත්නි, යම් සේ සාරය සොයන්නෙක්, සාරය පතන්නෙක්, සාරය ගවේෂණය කරන්නෙක්, සාරවත් වූ මහත් වෘක්ෂයක් තිබියදී, මුල ද අත්හැර, කඳ ද අත්හැර, අතු පත්‍රවල සාරය සෙවිය යුතු යැයි සිතන්නේ ද; එපරිද්දෙන්ම ඔබ වහන්සේලා ශාස්තෘන් වහන්සේ ඉදිරියේ වැඩ සිටියදී, භාග්‍යවතුන් වහන්සේ අත්හැර, මේ කාරණය අපෙන් විමසිය යුතු යැයි සිතන්නාක් මෙන් මෙය ද වේ. ඇවැත්නි, භාග්‍යවතුන් වහන්සේ නම් දන්නා දෙය ම දනිති, දකින දෙය ම දකිති. උන්වහන්සේ චක්ෂුස් භූත වූ සේක, ඥාන භූත වූ සේක, ධර්ම භූත වූ සේක, බ්‍රහ්ම භූත වූ සේක, දේශනා කරන්නා වූ සේක, ප්‍රවර්තකයා වූ සේක, අර්ථය මෙහෙයවන්නා වූ සේක, අමෘතය දානය කරන්නා වූ සේක, ධර්මයට අධිපති වූ සේක, තථාගතයන් වහන්සේ ය. එවන් වූ උන්වහන්සේ වෙතටම එළඹ, මේ කාරණය විමසිය යුතු වූ කාලය එය විය. භාග්‍යවතුන් වහන්සේ ඔබලාට කෙසේ විස්තර කරන්නේ ද, ඒ අයුරින් ඔබලා එය සිහි තබාගත යුතු ය’යි.\n\n‘ඇවැත් ආනන්ද, සැබැවින්ම භාග්‍යවතුන් වහන්සේ නම් දන්නා දෙය ම දනිති, දකින දෙය ම දකිති, චක්ෂුස් භූත වූ සේක, ඥාන භූත වූ සේක, ධර්ම භූත වූ සේක, බ්‍රහ්ම භූත වූ සේක, දේශනා කරන්නා වූ සේක, ප්‍රවර්තකයා වූ සේක, අර්ථය මෙහෙයවන්නා වූ සේක, අමෘතය දානය කරන්නා වූ සේක, ධර්මයට අධිපති වූ සේක, තථාගතයන් වහන්සේ ය. එවන් වූ උන්වහන්සේ වෙතටම එළඹ, මේ කාරණය විමසිය යුතු වූ කාලය එය විය; භාග්‍යවතුන් වහන්සේ අපට කෙසේ විස්තර කරන්නේ ද, ඒ අයුරින් අපි එය සිහි තබාගත යුතු ය. එසේ වුව ද, ඇවැත් ආනන්ද හිමියන් ශාස්තෘන් වහන්සේ විසින් ප්‍රශංසා කරන ලද, නුවණැති සබ්‍රහ්මචාරීන් විසින් ගරු කරන ලද කෙනෙකි. භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, විස්තරාත්මකව අර්ථය නොබෙදන ලද මේ දේශනාවේ අර්ථය විස්තරාත්මකව විභාග කිරීමට ඇවැත් ආනන්ද හිමියන්ට පුළුවන. ඇවැත් ආනන්ද හිමියන් බරක් නොගෙන (කරුණාවෙන්) විභාග කර දෙනු මැනැවැ’යි.\n\n‘එසේ නම් ඇවැත්නි, අසන්න, මැනැවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි’යි. ‘එසේය, ඇවැත්නි’යි කියා එම භික්ෂූහු ඇවැත් ආනන්ද හිමියන්ට ප්‍රතිවචන දුන්හ.\n\nඑවිට ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ මෙය පැවසූහ: “ඇවැත්නි, භාග්‍යවතුන් වහන්සේ අපට කෙටියෙන් අදහසක් දේශනා කොට, අර්ථය විස්තර වශයෙන් නොබෙදා, අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක්ද, එනම්: ‘මහණෙනි, අධර්මයද දැනගත යුතු ය, ධර්මයද දැනගත යුතු ය; අනර්ථයද දැනගත යුතු ය, අර්ථයද දැනගත යුතු ය. අධර්මයද දැනගෙන, ධර්මයද දැනගෙන, අනර්ථයද දැනගෙන, අර්ථයද දැනගෙන, ධර්මයට අනුවද, අර්ථයට අනුවද එසේම පිළිපැදිය යුතු ය’ කියා. ඇවැත්නි, අධර්මය කවරේද? ධර්මය කවරේද? අනර්ථය කවරේද? අර්ථය කවරේද?”\n\n“ඇවැත්නි, මිථ්‍යාදෘෂ්ටිය අධර්මය යි; සම්මාදිට්ඨිය ධර්මය යි. යම් හෙයකින් මිථ්‍යාදෘෂ්ටිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථය යි. සම්මාදිට්ඨිය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරියට පැමිණේද, මෙය අර්ථය යි.\n\n“ඇවැත්නි, මිථ්‍යාසංකප්පය අධර්මය යි; සම්මාසංකප්පය ධර්මය යි. ඇවැත්නි, මිථ්‍යාවාචාව අධර්මය යි; සම්මාවාචාව ධර්මය යි. ඇවැත්නි, මිථ්‍යාකම්මන්තය අධර්මය යි; සම්මාකම්මන්තය ධර්මය යි. ඇවැත්නි, මිථ්‍යාආජීවය අධර්මය යි; සම්මාආජීවය ධර්මය යි. ඇවැත්නි, මිථ්‍යාවායාමය අධර්මය යි; සම්මාවායාමය ධර්මය යි. ඇවැත්නි, මිථ්‍යාසතිය අධර්මය යි; සම්මාසතිය ධර්මය යි. ඇවැත්නි, මිථ්‍යාසමාධිය අධර්මය යි; සම්මාසමාධිය ධර්මය යි. ඇවැත්නි, මිථ්‍යාඤාණය අධර්මය යි; සම්මාඤාණය ධර්මය යි. ඇවැත්නි, මිථ්‍යාවිමුක්තිය අධර්මය යි; සම්මාවිමුක්තිය ධර්මය යි. යම් හෙයකින් මිථ්‍යාවිමුක්තිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනීද, මෙය අනර්ථය යි. සම්මාවිමුක්තිය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරියට පැමිණේද, මෙය අර්ථය යි.\n\n“ඇවැත්නි, භාග්‍යවතුන් වහන්සේ අපට කෙටියෙන් අදහසක් දේශනා කොට, අර්ථය විස්තර වශයෙන් නොබෙදා, අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක්ද, එනම්: ‘මහණෙනි, අධර්මයද දැනගත යුතු ය, ධර්මයද දැනගත යුතු ය... එසේම පිළිපැදිය යුතු ය’ කියා, භාග්‍යවතුන් වහන්සේ විසින් කෙටියෙන් දේශනා කරන ලද, විස්තර වශයෙන් අර්ථය නොබෙදන ලද මේ අදහසෙහි අර්ථය මම මෙසේ විස්තර වශයෙන් දනිමි. නමුත් ඇවැත්නි, ඔබලා කැමති නම්, භාග්‍යවතුන් වහන්සේ වෙතම එළඹ මේ අර්ථය විමසිය හැකි ය. භාග්‍යවතුන් වහන්සේ ඔබට කෙසේ විසඳා දෙන සේක්ද, එසේ එය සිත්හි ධාරණය කරගන්නැ”යි කී සේක.\n\n“ඇවැත්නි, එසේයැ”යි කියා ඒ භික්ෂූහු ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේගේ වචනය අගය කොට, අනුමෝදන් වී, අසුනෙන් නැගිට භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹුණාහු ය. එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, යම් හෙයකින් භාග්‍යවතුන් වහන්සේ අපට කෙටියෙන් අදහසක් දේශනා කොට, අර්ථය විස්තර වශයෙන් නොබෙදා, අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක්ද, එනම්: ‘මහණෙනි, අධර්මයද දැනගත යුතු ය... එසේම පිළිපැදිය යුතු ය’ කියා.\n\n“ස්වාමීනි, භාග්‍යවතුන් වහන්සේ වැඩමකොට වැඩි කලක් නොගොස් අපට මෙබඳු සිතක් පහළ විය: ‘ඇවැත්නි, භාග්‍යවතුන් වහන්සේ අපට කෙටියෙන් අදහසක් දේශනා කොට, අර්ථය විස්තර වශයෙන් නොබෙදා, අසුනෙන් නැගිට විහාරයට වැඩම කළ සේක්ද, එනම්: ‘මහණෙනි, අධර්මයද දැනගත යුතු ය... එසේම පිළිපැදිය යුතු ය’ කියා. භාග්‍යවතුන් වහන්සේ විසින් කෙටියෙන් දේශනා කරන ලද, විස්තර වශයෙන් අර්ථය නොබෙදන ලද මේ අදහසෙහි අර්ථය කවරෙක් නම් විස්තර වශයෙන් විභාග කරන්නේදැ’යි කියා.\n\n“ස්වාමීනි, අපට මෙබඳු සිතක් පහළ විය: ‘ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ ශාස්තෘන් වහන්සේ විසින් අගය කරන ලද, නුවණැති සබ්‍රහ්මචාරීන් විසින් ගෞරව කරන ලද තෙරනමක් වන සේක. භාග්‍යවතුන් වහන්සේ විසින් කෙටියෙන් දේශනා කරන ලද, විස්තර වශයෙන් අර්ථය නොබෙදන ලද මේ අදහසෙහි අර්ථය විස්තර වශයෙන් විභාග කිරීමට ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ සමර්ථ වන සේක. අපි යම් හෙයකින් ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ වැඩසිටින තැනට එළඹෙමු නම් ඉතා යහපති. එළඹ, ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේගෙන් මේ අර්ථය විමසමු. ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ අපට කෙසේ විසඳා දෙන සේක්ද, එසේ එය සිත්හි ධාරණය කරගනිමු’යි කියා.\n\n“ස්වාමීනි, එවිට අපි ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ වැඩසිටින තැනට එළඹුණෙමු. එළඹ, ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේගෙන් මේ අර්ථය විමසුවෙමු. ස්වාමීනි, ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ විසින් අපට මේ ආකාරයෙන්, මේ පදවලින්, මේ අක්ෂරවලින් අර්ථය මැනවින් විභාග කර දෙන ලදී.”\n\n“සාධු! සාධු, මහණෙනි! මහණෙනි, ආනන්ද පණ්ඩිත ය. මහණෙනි, ආනන්ද මහා ප්‍රාඥ ය. මහණෙනි, ඔබලා මා වෙතට එළඹ මේ අර්ථය විමසන්නට වුවත්, ආනන්ද විසින් විසඳා දුන් අයුරින්ම මම ද එය විසඳා දෙන්නෙමි. මේ ඒ අර්ථයම යි, එසේම ඔබලා එය සිත්හි ධාරණය කරගන්නැ”යි වදාළ සේක. (මෙය) තෙවන (දේශනාවයි).",
      "paliTitle": "Tatiyaadhammasuttaṃ"
    },
    {
      "number": 116,
      "pali": "Atha kho ajito paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho ajito paribbājako bhagavantaṃ etadavoca – ‘‘Amhākaṃ, bho gotama, paṇḍito nāma sabrahmacārī. Tena pañcamattāni cittaṭṭhānasatāni cintitāni, yehi aññatitthiyā upāraddhāva jānanti [upāraddhā pajānanti (sī.)] upāraddhasmā’’ti [upāraddhamhāti (sī. pī.)]. Atha kho bhagavā bhikkhū āmantesi – ‘‘dhāretha no tumhe, bhikkhave, paṇḍitavatthūnī’’ti? ‘‘Etassa, bhagavā, kālo etassa, sugata, kālo yaṃ bhagavā bhāseyya, bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Idha, bhikkhave, ekacco adhammikena vādena adhammikaṃ vādaṃ abhiniggaṇhāti abhinippīḷeti, tena ca adhammikaṃ parisaṃ rañjeti. Tena sā adhammikā parisā uccāsaddamahāsaddā hoti – ‘paṇḍito vata, bho, paṇḍito vata, bho’ti. ‘‘Idha pana, bhikkhave, ekacco adhammikena vādena dhammikaṃ vādaṃ abhiniggaṇhāti abhinippīḷeti, tena ca adhammikaṃ parisaṃ rañjeti. Tena sā adhammikā parisā uccāsaddamahāsaddā hoti – ‘paṇḍito vata, bho, paṇḍito vata, bho’ti. ‘‘Idha pana, bhikkhave, ekacco adhammikena vādena dhammikañca vādaṃ adhammikañca vādaṃ abhiniggaṇhāti abhinippīḷeti, tena ca adhammikaṃ parisaṃ rañjeti. Tena sā adhammikā parisā uccāsaddamahāsaddā hoti – ‘paṇḍito vata, bho, paṇḍito vata, bho’ti. ‘‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabbaṃ. ‘‘Katamo ca, bhikkhave, adhammo, katamo ca dhammo, katamo ca anattho, katamo ca attho? Micchādiṭṭhi, bhikkhave, adhammo; sammādiṭṭhi dhammo; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘Micchāsaṅkappo, bhikkhave, adhammo; sammāsaṅkappo dhammo… micchāvācā, bhikkhave, adhammo; sammāvācā dhammo… micchākammanto, bhikkhave, adhammo; sammākammanto dhammo… micchāājīvo, bhikkhave, adhammo; sammāājīvo dhammo … micchāvāyāmo, bhikkhave, adhammo; sammāvāyāmo dhammo… micchāsati, bhikkhave, adhammo; sammāsati dhammo… micchāsamādhi, bhikkhave adhammo; sammāsamādhi dhammo… micchāñāṇaṃ, bhikkhave, adhammo; sammāñāṇaṃ dhammo. ‘‘Micchāvimutti, bhikkhave, adhammo; sammāvimutti dhammo; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti, ayaṃ anattho; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti, ayaṃ attho. ‘‘‘Adhammo ca, bhikkhave, veditabbo dhammo ca; anattho ca veditabbo attho ca. Adhammañca viditvā dhammañca, anatthañca viditvā atthañca yathā dhammo yathā attho tathā paṭipajjitabba’nti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Catutthaṃ.",
      "english": "Then the wandering ascetic Ajita approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. After exchanging cordial and memorable talk, he sat down to one side. Seated to one side, the wandering ascetic Ajita said to the Blessed One: \"Our fellow ascetic, Master Gotama, named Paṇḍita, has conceived more than five hundred lines of thought by which adherents of other sects recognize him as defeated, and are themselves defeated.\"\n\nThen the Blessed One addressed the bhikkhus: \"Bhikkhus, do you remember the points of doctrine taught by Paṇḍita?\"\n\n\"It is time, Blessed One, it is time, Fortunate One, for the Blessed One to speak. Having heard from the Blessed One, the bhikkhus will remember.\"\n\n\"In that case, bhikkhus, listen, pay careful attention; I will speak.\"\n\n\"Yes, venerable sir,\" those bhikkhus replied to the Blessed One.\n\nThe Blessed One said: \"Here, bhikkhus, some individual, by means of an unrighteous argument, defeats and overwhelms an unrighteous argument, and thereby delights an unrighteous assembly. Because of this, that unrighteous assembly becomes noisy and boisterous, exclaiming, 'Oh, how wise! Oh, how wise!'\"\n\n\"But here, bhikkhus, some individual, by means of an unrighteous argument, defeats and overwhelms a righteous argument, and thereby delights an unrighteous assembly. Because of this, that unrighteous assembly becomes noisy and boisterous, exclaiming, 'Oh, how wise! Oh, how wise!'\"\n\n\"But here, bhikkhus, some individual, by means of an unrighteous argument, defeats and overwhelms both a righteous argument and an unrighteous argument, and thereby delights an unrighteous assembly. Because of this, that unrighteous assembly becomes noisy and boisterous, exclaiming, 'Oh, how wise! Oh, how wise!'\"\n\n\"Bhikkhus, the unrighteous must be known, and the righteous must be known. The unbeneficial must be known, and the beneficial must be known. Having understood the unrighteous and the righteous, having understood the unbeneficial and the beneficial, one should practice in accordance with the righteous and the beneficial.\"\n\n\"And what, bhikkhus, is the unrighteous, what is the righteous, what is the unbeneficial, and what is the beneficial? Wrong view, bhikkhus, is the unrighteous; right view is the righteous. And the many evil, unwholesome states that arise conditioned by wrong view—this is the unbeneficial. And the many wholesome states that reach the culmination of development conditioned by right view—this is the beneficial.\"\n\n\"Wrong intention, bhikkhus, is the unrighteous; right intention is the righteous... Wrong speech, bhikkhus, is the unrighteous; right speech is the righteous... Wrong action, bhikkhus, is the unrighteous; right action is the righteous... Wrong livelihood, bhikkhus, is the unrighteous; right livelihood is the righteous... Wrong effort, bhikkhus, is the unrighteous; right effort is the righteous... Wrong mindfulness, bhikkhus, is the unrighteous; right mindfulness is the righteous... Wrong concentration, bhikkhus, is the unrighteous; right concentration is the righteous... Wrong knowledge, bhikkhus, is the unrighteous; right knowledge is the righteous.\"\n\n\"Wrong liberation, bhikkhus, is the unrighteous; right liberation is the righteous. And the many evil, unwholesome states that arise conditioned by wrong liberation—this is the unbeneficial. And the many wholesome states that reach the culmination of development conditioned by right liberation—this is the beneficial.\"\n\n\"'Bhikkhus, the unrighteous must be known, and the righteous must be known. The unbeneficial must be known, and the beneficial must be known. Having understood the unrighteous and the righteous, having understood the unbeneficial and the beneficial, one should practice in accordance with the righteous and the beneficial'—what was said thus, was said with reference to this.\"",
      "sinhala": "එවිට අජිත නම් ප\\u200Dරිබ\\u200D්‍රාජක තෙම භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. එලෙස පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කථා බස් හුවමාරු කරගෙන එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩ සිටි අජිත ප\\u200Dරිබ\\u200D්‍රාජක තෙම භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භවත් ගෞතමයෙනි, අපට පණ්ඩිත නම් වූ සබ\\u200D්‍රහ්මචාරියෙක් ඇත. ඔහු විසින් විවිධ වාද විෂයන් පන්සියයකට අධික සංඛ්‍යාවක් සකසා ඇත. ඒවා මගින් අන්‍ය තීර්ථකයෝ පරාජයට පත්වී ඇති බවත්, (එලෙස පරාජය වූ බව) ප\\u200D්‍රකට වන බවත් දනිති.\"\n\nඑවිට භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළේ, \"මහණෙනි, ඔබලා පණ්ඩිතයන්ගේ කරුණු දරනවාද?\" (භික්ෂූහු පිළිතුරු දෙමින්) \"භාග්‍යවතුන් වහන්ස, මේ මේ කාලයයි, සුගතයන් වහන්ස, මේ මේ කාලයයි භාග්‍යවතුන් වහන්සේ දේශනා කිරීමට. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය ධාරණය කරගන්නවා ඇත.\" (භාග්‍යවතුන් වහන්සේ) \"එසේ නම් මහණෙනි, අසන්න, මනාව මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.\" \"එසේය, ස්වාමීනී\" යැයි එම භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"මහණෙනි, මෙහිලා ඇතැම් කෙනෙක් අධර්මවාදයකින්, අධර්මවාදයක් මුළුමනින්ම යටපත් කොට, තලා පෙළා දමයි. ඒ මගින් අධර්මවාදී පිරිස සතුටු කරයි. එවිට එම අධර්මවාදී පිරිස, 'අහෝ! මොහු නම් පණ්ඩිතයෙකි! අහෝ! මොහු නම් පණ්ඩිතයෙකි!' යැයි මහත් වූ ශබ්දයෙන් ඔල්වරසන් දෙති.\"\n\n\"නැවතත් මහණෙනි, මෙහිලා ඇතැම් කෙනෙක් අධර්මවාදයකින්, ධර්මවාදයක් මුළුමනින්ම යටපත් කොට, තලා පෙළා දමයි. ඒ මගින් අධර්මවාදී පිරිස සතුටු කරයි. එවිට එම අධර්මවාදී පිරිස, 'අහෝ! මොහු නම් පණ්ඩිතයෙකි! අහෝ! මොහු නම් පණ්ඩිතයෙකි!' යැයි මහත් වූ ශබ්දයෙන් ඔල්වරසන් දෙති.\"\n\n\"නැවතත් මහණෙනි, මෙහිලා ඇතැම් කෙනෙක් අධර්මවාදයකින්, ධර්මවාදයක්ද අධර්මවාදයක්ද මුළුමනින්ම යටපත් කොට, තලා පෙළා දමයි. ඒ මගින් අධර්මවාදී පිරිස සතුටු කරයි. එවිට එම අධර්මවාදී පිරිස, 'අහෝ! මොහු නම් පණ්ඩිතයෙකි! අහෝ! මොහු නම් පණ්ඩිතයෙකි!' යැයි මහත් වූ ශබ්දයෙන් ඔල්වරසන් දෙති.\"\n\n\"මහණෙනි, අධර්මයද දැනගත යුතුයි, ධර්මයද දැනගත යුතුයි; අනර්ථයද දැනගත යුතුයි, අර්ථයද දැනගත යුතුයි. අධර්මයද දැනගෙන ධර්මයද දැනගෙන, අනර්ථයද දැනගෙන අර්ථයද දැනගෙන, ධර්මයට අනුවද, අර්ථයට අනුවද පිළිපැදිය යුතුයි.\"\n\n\"මහණෙනි, අධර්මය කවරේද, ධර්මය කවරේද, අනර්ථය කවරේද, අර්ථය කවරේද? මහණෙනි, මිත්‍යාදෘෂ්ටිය අධර්මයයි; සම්මාදෘෂ්ටිය ධර්මයයි. යම් ඒ මිත්‍යාදෘෂ්ටිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්\\u200Dමයන් හටගනීද, මෙය අනර්ථයයි. සම්මාදෘෂ්ටිය හේතු කොටගෙන බොහෝ කුසල ධර්\\u200Dමයන් සම්පූර්ණත්වයට පත් වේද, මෙය අර්ථයයි.\"\n\n\"මහණෙනි, මිත්‍යාසංකප්පය අධර්මයයි; සම්මාසංකප්පය ධර්මයයි. මිත්‍යාවාචාව අධර්මයයි; සම්මාවාචාව ධර්මයයි. මිත්‍යාකම්මන්තය අධර්මයයි; සම්මාකම්මන්තය ධර්මයයි. මිත්‍යාආජීවය අධර්මයයි; සම්මාආජීවය ධර්මයයි. මිත්‍යාවායාමය අධර්මයයි; සම්මාවායාමය ධර්මයයි. මිත්‍යාසතිය අධර්මයයි; සම්මාසතිය ධර්මයයි. මිත්‍යාසමාධිය අධර්මයයි; සම්මාසමාධිය ධර්මයයි. මිත්‍යාඤාණය අධර්මයයි; සම්මාඤාණය ධර්මයයි.\"\n\n\"මහණෙනි, මිත්‍යාවිමුක්තිය අධර්මයයි; සම්මාවිමුක්තිය ධර්මයයි. යම් ඒ මිත්‍යාවිමුක්තිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්\\u200Dමයන් හටගනීද, මෙය අනර්ථයයි. සම්මාවිමුක්තිය හේතු කොටගෙන බොහෝ කුසල ධර්\\u200Dමයන් සම්පූර්ණත්වයට පත් වේද, මෙය අර්ථයයි.\"\n\n\"මහණෙනි, අධර්මයද දැනගත යුතුයි, ධර්මයද දැනගත යුතුයි; අනර්ථයද දැනගත යුතුයි, අර්ථයද දැනගත යුතුයි. අධර්මයද දැනගෙන ධර්මයද දැනගෙන, අනර්ථයද දැනගෙන අර්ථයද දැනගෙන, ධර්මයට අනුවද, අර්ථයට අනුවද පිළිපැදිය යුතුයි යැයි යමක් වදාළේද, එය මේ කරුණ අරභයා වදාළ දෙයකි.\"",
      "paliTitle": "Ajitasuttaṃ"
    },
    {
      "number": 117,
      "pali": "[a. ni. 10.169] Atha kho saṅgāravo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho saṅgāravo brāhmaṇo bhagavantaṃ etadavoca – ‘‘kiṃ nu kho, bho gotama, orimaṃ tīraṃ, kiṃ pārimaṃ tīra’’nti? ‘‘Micchādiṭṭhi kho, brāhmaṇa, orimaṃ tīraṃ, sammādiṭṭhi pārimaṃ tīraṃ; micchāsaṅkappo orimaṃ tīraṃ, sammāsaṅkappo pārimaṃ tīraṃ; micchāvācā orimaṃ tīraṃ, sammāvācā pārimaṃ tīraṃ; micchākammanto orimaṃ tīraṃ, sammākammanto pārimaṃ tīraṃ; micchāājīvo orimaṃ tīraṃ, sammāājīvo pārimaṃ tīraṃ; micchāvāyāmo orimaṃ tīraṃ, sammāvāyāmo pārimaṃ tīraṃ; micchāsati orimaṃ tīraṃ, sammāsati pārimaṃ tīraṃ; micchāsamādhi orimaṃ tīraṃ, sammāsamādhi pārimaṃ tīraṃ; micchāñāṇaṃ orimaṃ tīraṃ, sammāñāṇaṃ pārimaṃ tīraṃ; micchāvimutti orimaṃ tīraṃ, sammāvimutti pārimaṃ tīranti. Idaṃ kho, brāhmaṇa, orimaṃ tīraṃ, idaṃ pārimaṃ tīranti. ‘‘Appakā te manussesu, ye janā pāragāmino; Athāyaṃ itarā pajā, tīramevānudhāvati. ‘‘Ye ca kho sammadakkhāte, dhamme dhammānuvattino; Te janā pāramessanti, maccudheyyaṃ suduttaraṃ. ‘‘Kaṇhaṃ dhammaṃ vippahāya, sukkaṃ bhāvetha paṇḍito; Okā anokamāgamma, viveke yattha dūramaṃ. ‘‘Tatrābhiratimiccheyya, hitvā kāme akiñcano; Pariyodapeyya attānaṃ, cittaklesehi paṇḍito. ‘‘Yesaṃ sambodhiyaṅgesu, sammā cittaṃ subhāvitaṃ; Ādānapaṭinissagge, anupādāya ye ratā; Khīṇāsavā jutimanto [jutīmanto (sī.)], te loke parinibbutā’’ti. pañcamaṃ;",
      "english": "Then the brahmin Saṅgārava approached the Blessed One. Having approached, he exchanged friendly greetings with the Blessed One. After exchanging courteous and memorable conversation, he sat down to one side. As he sat to one side, the brahmin Saṅgārava said to the Blessed One, \"Indeed, Master Gotama, what is this near shore, and what is the far shore?\"\n\n\"Wrong view, brahmin, is the near shore; Right View is the far shore. Wrong intention is the near shore; Right Intention is the far shore. Wrong speech is the near shore; Right Speech is the far shore. Wrong action is the near shore; Right Action is the far shore. Wrong livelihood is the near shore; Right Livelihood is the far shore. Wrong effort is the near shore; Right Effort is the far shore. Wrong mindfulness is the near shore; Right Mindfulness is the far shore. Wrong concentration is the near shore; Right Concentration is the far shore. Wrong knowledge is the near shore; Right Knowledge is the far shore. Wrong liberation is the near shore; Right Liberation is the far shore. This, brahmin, is the near shore, and this is the far shore.\"\n\nFew among humans are those who cross over to the other shore;\nWhile the rest of humankind merely runs along this shore.\n\nBut those who rightly practice the Dhamma, which is well-proclaimed,\nThose people will reach the far shore, surmounting the realm of Death, which is so difficult to cross.\n\nHaving abandoned the dark state, the wise one should cultivate the bright state.\nHaving gone from home to homelessness, one should find delight in solitude, which is so hard to enjoy.\n\nTherein, having relinquished sensual pleasures and being free from possessions, one should seek delight.\nThe wise one should purify themselves from mental defilements.\n\nThose whose minds are well-developed in the factors of awakening,\nWho, relinquishing all clinging, delight in non-attachment—\nThose, with defilements exhausted and radiant, are fully liberated in the world.",
      "sinhala": "ඉන්පසු සංගාරව බ්‍රාහ්මණයා භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍ය​වතුන් වහන්සේ සමග සතුටු විය. විනෝදජනක වූ ද, සිහිකරවිය යුතු වූ ද කතාව කතාබස් කොට එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි සංගාරව බ්‍රාහ්මණයා භාග්‍ය​වතුන් වහන්සේට මෙය කීවේය: \"භවත් ගෞතමයින් වහන්ස, මෙපරය කවරේද, එපරය කවරේද?\"\n\n\"බ්‍රාහ්මණය, මිත්‍යාදෘෂ්ටිය මෙපරයයි, සම්මාදිට්ඨිය එපරයයි. මිත්‍යාසංකල්පය මෙපරයයි, සම්මාසංකල්පය එපරයයි. මිත්‍යාවාචාව මෙපරයයි, සම්මාවාචාව එපරයයි. මිත්‍යාකර්මාන්තය මෙපරයයි, සම්මාකර්මාන්තය එපරයයි. මිත්‍යාආජීවය මෙපරයයි, සම්මාආජීවය එපරයයි. මිත්‍යාවායාමය මෙපරයයි, සම්මාවායාමය එපරයයි. මිත්‍යාසතිය මෙපරයයි, සම්මාසතිය එපරයයි. මිත්‍යාසමාධිය මෙපරයයි, සම්මාසමාධිය එපරයයි. මිත්‍යාඥානය මෙපරයයි, සම්මාඥානය එපරයයි. මිත්‍යාවිමුක්තිය මෙපරයයි, සම්මාවිමුක්තිය එපරයයි. බ්‍රාහ්මණය, මෙයයි මෙපරය, මෙයයි එපරය.\"\n\n\"මිනිසුන් අතරින් එතෙර වන්නෝ ඉතා ස්වල්ප දෙනෙකි. නමුත් මේ සෙසු ජනතාව මෙපරය වටාම දුවති.\"\n\n\"යම් කෙනෙක් මැනවින් දේශනා කරන ලද ධර්මයෙහි ධර්මානුකූලව හැසිරෙත්ද, ඒ ජනයා අතිශයින් තරණය කිරීමට දුෂ්කර වූ මාරයාගේ භූමියෙන් එතෙර වන්නාහ.\"\n\n\"නුවණැත්තා කළු දහම් (අකුසල ධර්මයන්) අත්හැර, සුදු දහම් (කුසල ධර්මයන්) වඩයි. ඇලීම් සහිත තැනින් ඇලීම් රහිත තැනට පැමිණ, ලෞකික සැප දුරස්ථ වූ, විවේකී බවට පැමිණ.\"\n\n\"කිසිවක් නැත්තෙක් වී, කාමයන් අත්හැර, එහි (ඒ විවේකයෙහි) ඇලීමට කැමති විය යුතුය. නුවණැත්තා තම සිත, ක්ලේශයන්ගෙන් පිරිසිදු කරගත යුතුය.\"\n\n\"යම් අයගේ සිත සප්ත බොජ්ඣංගයන්හි මැනවින් වැඩී ඇත්ද, ගැනීම අත්හැරීමෙහි, උපාදානයන්ගෙන් තොරව, යම් කෙනෙක් ඇලී සිටිත්ද, ඒ ක්ෂීණාශ්‍ර​ව වූ, දීප්තිමත් වූ පුද්ගලයෝ ලෝකයෙහි පිරිනිවන් පෑවෝ වෙති.\"",
      "paliTitle": "Saṅgāravasuttaṃ"
    },
    {
      "number": 118,
      "pali": "‘‘Orimañca, bhikkhave, tīraṃ desessāmi pārimañca tīraṃ. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamañca, bhikkhave, orimaṃ tīraṃ, katamañca pārimaṃ tīraṃ? Micchādiṭṭhi orimaṃ tīraṃ, sammādiṭṭhi pārimaṃ tīraṃ…pe… micchāvimutti orimaṃ tīraṃ, sammāvimutti pārimaṃ tīraṃ. Idaṃ kho, bhikkhave, orimaṃ tīraṃ, idaṃ pārimaṃ tīranti. ‘‘Appakā te manussesu, ye janā pāragāmino; Athāyaṃ itarā pajā, tīramevānudhāvati. ‘‘Ye ca kho sammadakkhāte, dhamme dhammānuvattino; Te janā pāramessanti, maccudheyyaṃ suduttaraṃ. ‘‘Kaṇhaṃ dhammaṃ vippahāya, sukkaṃ bhāvetha paṇḍito; Okā anoka māgamma, viveke yattha dūramaṃ. ‘‘Tatrābhiratimiccheyya, hitvā kāme akiñcano; Pariyodapeyya attānaṃ, cittaklesehi paṇḍito. ‘‘Yesaṃ sambodhiyaṅgesu, sammā cittaṃ subhāvitaṃ; Ādānapaṭinissagge, anupādāya ye ratā; Khīṇāsavā jutimanto, te loke parinibbutā’’ti. chaṭṭhaṃ;",
      "english": "“Monks, I will teach about this shore and the far shore. Listen to that, pay careful attention; I will speak.”\n\n“Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One spoke thus:\n\n“And what, monks, is this shore, and what is the far shore? Wrong view is this shore, right view is the far shore… Wrong liberation is this shore, right liberation is the far shore. Indeed, monks, this is this shore, and this is the far shore.”\n\nFew among humans are those who reach the far shore; the rest of the populace just scurries along this shore.\n\nBut those who practice in accordance with the well-expounded Dhamma, those people will reach the far shore, crossing the realm of death that is so difficult to traverse.\n\nHaving abandoned dark states, the wise one should cultivate bright states. Having come from the home of attachment to the state of non-attachment, find profound delight in seclusion.\n\nThere, without possessions, having abandoned sensual pleasures, one should seek delight. The wise one should cleanse oneself from mental defilements.\n\nThose whose minds are well-developed in the factors of awakening, who delight in the relinquishing of all clinging through non-attachment—those whose taints are destroyed, those radiant ones, are fully liberated in this world.",
      "sinhala": "භික්ෂූණි, මම ඔබට මෙතෙර ද එතෙර ද දේශනා කරන්නෙමි. එය අසන්න, මැනවින් සිතට ගන්න; මම දේශනා කරන්නෙමි.\n\n\"එසේය, භාග්‍යවතුන් වහන්සැ\"යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"භික්ෂූණි, මෙතෙර යනු කවරේද, එතෙර යනු කවරේද? මිථ්‍යාදෘෂ්ටිය මෙතෙරයි, සම්මාදිට්ඨිය එතෙරයි... (පෙ)... මිථ්‍යාවිමුක්තිය මෙතෙරයි, සම්මාවිමුක්තිය එතෙරයි. භික්ෂූණි, මේ මෙතෙරයි, මේ එතෙරයි.\n\nමිනිසුන් අතරින් එතෙරට ගියෝ ස්වල්ප දෙනෙකි; අනිත් මේ සත්ත්ව සමූහය නම් මෙතෙරම හඹා යයි.\n\nනමුත් මැනවින් දේශනා කරන ලද ධර්මයෙහි, ධර්මානුකූලව හැසිරෙන්නා වූ ඒ ජනතාව, මරණ පාශය ඉක්මවා, ඉතා දුෂ්කර වූ සසරින් එතෙර වනු ඇත.\n\nපණ්ඩිතයා කළු (අකුසල) දහම් දුරු කොට, සුදු (කුසල) දහම් වඩන්නේය; ගැටීම සහිත ලෝකය අත්හැර, කිසිදු ගැටීමක් නැති නිවනට පැමිණ, (සිත් දමනය නොකළ අයට) රිසි වීමට අපහසු වූ විවේකයෙහි (නිවනෙහි) රමණය කරන්නේය.\n\n(එතෙර වූ තැනැත්තා) කාමයන් අත්හැර, කිසිදු බැඳීමක් නැත්තෙක් බවට පත් වී, එහි (නිවනෙහි) ඇලීමට කැමති විය යුතුය; පණ්ඩිතයා තම සිත කෙලෙස්වලින් පිරිසිදු කර ගත යුතුය.\n\nයමෙකුගේ සිත සම්බෝධ්‍යංගයන්හි මැනවින් වඩන ලද්දේද, ඇලීම් අත්හැරීමෙහි, කිසිවක් නොගෙන සිටීමෙහි යම් කෙනෙක් ඇලී සිටින්නේද, ඔවුහු ක්ෂීණාශ්‍රව වූ, බැබළෙන්නා වූ සත්ත්වවයෝය. ඔවුහු ලෝකයෙහි පිරිනිවන් පෑවෝය.",
      "paliTitle": "Orimatīrasuttaṃ"
    },
    {
      "number": 119,
      "pali": "Tena kho pana samayena jāṇussoṇi [jānussoni (ka. sī.), jānussoṇi (ka. sī.), jāṇusoṇi (ka.)] brāhmaṇo tadahuposathe sīsaṃnhāto [sīsaṃnahāto (sī. pī.), sīsanhāto (syā.)] navaṃ khomayugaṃ nivattho allakusamuṭṭhiṃ ādāya bhagavato avidūre ekamantaṃ ṭhito hoti. Addasā kho bhagavā jāṇussoṇiṃ brāhmaṇaṃ tadahuposathe sīsaṃnhātaṃ navaṃ khomayugaṃ nivatthaṃ allakusamuṭṭhiṃ ādāya ekamantaṃ ṭhitaṃ. Disvāna jāṇussoṇiṃ brāhmaṇaṃ etadavoca – ‘‘kiṃ nu tvaṃ, brāhmaṇa, tadahuposathe sīsaṃnhāto navaṃ khomayugaṃ nivattho allakusamuṭṭhiṃ ādāya ekamantaṃ ṭhito? Kiṃ nvajja [kiṃ nu ajja (syā.), kiṃ nu kho ajja (pī.), kiṃ nu khvajja (ka.)] brāhmaṇakulassā’’ti [brāhmaṇa brahmakusalassāti (ka.)]? ‘‘Paccorohaṇī, bho gotama, ajja brāhmaṇakulassā’’ti [brahmakusalassāti (ka.)]. ‘‘Yathā kathaṃ pana, brāhmaṇa, brāhmaṇānaṃ paccorohaṇī hotī’’ti? ‘‘Idha, bho gotama, brāhmaṇā tadahuposathe sīsaṃnhātā navaṃ khomayugaṃ nivatthā allena gomayena pathaviṃ opuñjitvā haritehi kusehi pattharitvā [pavitthāretvā (ka.)] antarā ca velaṃ antarā ca agyāgāraṃ seyyaṃ kappenti. Te taṃ rattiṃ tikkhattuṃ paccuṭṭhāya pañjalikā aggiṃ namassanti – ‘paccorohāma bhavantaṃ, paccorohāma bhavanta’nti. Bahukena ca sappitelanavanītena aggiṃ santappenti. Tassā ca rattiyā accayena paṇītena khādanīyena bhojanīyena brāhmaṇe santappenti. Evaṃ, bho gotama, brāhmaṇānaṃ paccorohaṇī hotī’’ti. ‘‘Aññathā kho, brāhmaṇa, brāhmaṇānaṃ paccorohaṇī hoti, aññathā ca pana ariyassa vinaye paccorohaṇī hotī’’ti. ‘‘Yathā kathaṃ pana, bho gotama, ariyassa vinaye paccorohaṇī hoti? Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathā ariyassa vinaye paccorohaṇī hotī’’ti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho jāṇussoṇi brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idha, brāhmaṇa, ariyasāvako iti paṭisañcikkhati – ‘micchādiṭṭhiyā kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañcā’ ti. So iti paṭisaṅkhāya micchādiṭṭhiṃ pajahati; micchādiṭṭhiyā paccorohati. … Micchāsaṅkappassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchāsaṅkappaṃ pajahati; micchāsaṅkappā paccorohati. … Micchāvācāya kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchāvācaṃ pajahati; micchāvācāya paccorohati. …Micchākammantassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchākammantaṃ pajahati; micchākammantā paccorohati. …Micchāājīvassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchāājīvaṃ pajahati; micchāājīvā paccorohati. …Micchāvāyāmassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchāvāyāmaṃ pajahati; micchāvāyāmā paccorohati. …Micchāsatiyā kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchāsatiṃ pajahati; micchāsatiyā paccorohati. …Micchāsamādhissa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchāsamādhiṃ pajahati; micchāsamādhimhā paccorohati. …Micchāñāṇassa kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchāñāṇaṃ pajahati; micchāñāṇamhā paccorohati. ‘Micchāvimuttiyā kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchāvimuttiṃ pajahati; micchāvimuttiyā paccorohati. Evaṃ kho, brāhmaṇa, ariyassa vinaye paccorohaṇī hotī’’ti. ‘‘Aññathā, bho gotama, brāhmaṇānaṃ paccorohaṇī, aññathā ca pana ariyassa vinaye paccorohaṇī hoti. Imissā ca, bho gotama, ariyassa vinaye paccorohaṇiyā brāhmaṇānaṃ paccorohaṇī kalaṃ nāgghati soḷasiṃ. Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Sattamaṃ.",
      "english": "At that time, the brahmin Jāṇussoṇi, having bathed his head on that very Uposatha day, dressed in a new pair of linen garments, and holding a handful of wet kusa grass, was standing to one side, not far from the Blessed One. The Blessed One saw the brahmin Jāṇussoṇi, who on that very Uposatha day had bathed his head, was dressed in a new pair of linen garments, and was standing to one side, holding a handful of wet kusa grass. Upon seeing the brahmin Jāṇussoṇi, he said this: \"Why, brahmin, on this Uposatha day, have you bathed your head, dressed in a new pair of linen garments, and are standing to one side, holding a handful of wet kusa grass? What is the special observance today for the brahmin family?\"\n\n\"Reverend Gotama, today is the 'descending' ritual (paccorohaṇī) for the brahmin family.\"\n\n\"But brahmin, how does this 'descending' ritual take place for brahmins?\"\n\n\"Reverend Gotama, on this Uposatha day, brahmins, having bathed their heads, dressed in new linen garments, having smeared the ground with fresh cow dung and spread green kusa grass, make their resting place between the altar and the fire sanctuary. During that night, they rise three times and, with joined palms, prostrate themselves before the fire, saying: 'We descend to you, Sir! We descend to you, Sir!' They also gratify the fire with plenty of ghee, oil, and fresh butter. After that night passes, they gratify brahmins with excellent hard and soft foods. This is how, Reverend Gotama, the 'descending' ritual takes place for brahmins.\"\n\n\"Indeed, brahmin, the 'descending' ritual of brahmins is one thing, but the 'descending' ritual in the Discipline of the Noble Ones is quite another.\"\n\n\"But Reverend Gotama, how does the 'descending' ritual take place in the Discipline of the Noble Ones? It would be good if Reverend Gotama would teach me the Dhamma in such a way that I may understand how the 'descending' ritual takes place in the Discipline of the Noble Ones.\"\n\n\"Then, brahmin, listen, pay close attention; I shall speak.\"\n\n\"Yes, Reverend,\" replied the brahmin Jāṇussoṇi to the Blessed One.\n\nThe Blessed One said this: \"Here, brahmin, a noble disciple reflects thus: 'Wrong view indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong view; he 'descends from' wrong view. 'Wrong intention indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong intention; he 'descends from' wrong intention. 'Wrong speech indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong speech; he 'descends from' wrong speech. 'Wrong action indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong action; he 'descends from' wrong action. 'Wrong livelihood indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong livelihood; he 'descends from' wrong livelihood. 'Wrong effort indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong effort; he 'descends from' wrong effort. 'Wrong mindfulness indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong mindfulness; he 'descends from' wrong mindfulness. 'Wrong concentration indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong concentration; he 'descends from' wrong concentration. 'Wrong knowledge indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong knowledge; he 'descends from' wrong knowledge. 'Wrong liberation indeed has a detrimental outcome both in this present life and in the life to come.' Having reflected in this way, he abandons wrong liberation; he 'descends from' wrong liberation. This is how, brahmin, the 'descending' ritual takes place in the Discipline of the Noble Ones.\"\n\n\"Reverend Gotama, the 'descending' ritual of brahmins is one thing, and the 'descending' ritual in the Discipline of the Noble Ones is quite another. And Reverend Gotama, compared to this 'descending' ritual in the Discipline of the Noble Ones, the 'descending' ritual of brahmins is not worth a sixteenth part. Excellent, Reverend Gotama! Excellent! Just as if one were to set upright what had been overthrown, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring an oil lamp into the darkness so that those with eyes could see forms—in the same way, the Dhamma has been made clear in many ways by Reverend Gotama. I go for refuge to Reverend Gotama, and to the Dhamma, and to the Saṅgha. May Reverend Gotama accept me as a lay follower, who has gone for refuge from this day forth for as long as life lasts.\"",
      "sinhala": "එකල, ජාණුස්සෝණි බ්‍රාහ්මණයා එදින උපෝසථ දිනයේදී හිස සෝදා, අලුත් ක්‍ෂෞම වස්ත්‍ර යුගලයක් ඇඳගෙන, තෙත කුස තණ මිටියක් ගෙන භාග්‍යවතුන් වහන්සේට නුදුරින් එක්පසෙක සිටගෙන සිටියේය. භාග්‍යවතුන් වහන්සේ, ජාණුස්සෝණි බ්‍රාහ්මණයා එදින උපෝසථ දිනයේදී හිස සෝදා, අලුත් ක්‍ෂෞම වස්ත්‍ර යුගලයක් ඇඳගෙන, තෙත කුස තණ මිටියක් ගෙන එක්පසෙක සිටගෙන සිටිනු දුටු සේක. ජාණුස්සෝණි බ්‍රාහ්මණයා දැක මේසේ වදාළ සේක: \"බ්‍රාහ්මණය, ඔබ අද උපෝසථ දිනයේදී හිස සෝදා, අලුත් ක්‍ෂෞම වස්ත්‍ර යුගලයක් ඇඳගෙන, තෙත කුස තණ මිටියක් ගෙන එක්පසෙක සිටගෙන සිටින්නේ කුමක් නිසාද? අද බ්‍රාහ්මණ කුලයට කුමක්ද?\" \"භවත් ගෞතමයන් වහන්ස, අද බ්‍රාහ්මණ කුලයේ පච්චෝරෝහණී දිනයයි.\" \"බ්‍රාහ්මණය, එසේනම් බ්‍රාහ්මණවරුන්ගේ පච්චෝරෝහණී කෙසේ සිදුවේද?\"\n\n\"භවත් ගෞතමයන් වහන්ස, මෙහිලා, බ්‍රාහ්මණවරු එදින උපෝසථ දිනයේදී හිස සෝදා, අලුත් ක්‍ෂෞම වස්ත්‍ර යුගලයක් ඇඳගෙන, තෙත් ගොම වලින් පොළොව අතුරා පිරිසිදු කොට, නැවුම් කුස තණ අතුරා, යූපස්තම්භය සහ ගින්දර පූජා කරන ස්ථානය අතර සයනය කරති. ඔවුහු ඒ රාත්‍රියේ තුන් වතාවක් නැගිට, දොහොත් මුදුන් තබාගෙන ගින්නට නමස්කාර කරති – ‘භවත් ගිනි දෙවියනි, අපි ඔබවහන්සේ වෙතට පහතට බසිමු, භවත් ගිනි දෙවියනි, අපි ඔබවහන්සේ වෙතට පහතට බසිමු’ යැයි. බොහෝ ගිතෙල්, තෙල් සහ බටර් වලින් ගින්න සතුටු කරති. ඒ රාත්‍රිය අවසන් වූ පසු, ප්‍රණීත කැවිලි හා භෝජන වලින් බ්‍රාහ්මණවරුන් සතුටු කරති. භවත් ගෞතමයන් වහන්ස, මෙලෙසින් බ්‍රාහ්මණවරුන්ගේ පච්චෝරෝහණී සිදුවේ.\"\n\n\"නමුත් බ්‍රාහ්මණය, බ්‍රාහ්මණවරුන්ගේ පච්චෝරෝහණී වෙන ආකාරයකටය, ආර්ය විනයෙහි පච්චෝරෝහණී සිදුවන්නේ තවත් ආකාරයකටය.\" \"එසේනම් භවත් ගෞතමයන් වහන්ස, ආර්ය විනයෙහි පච්චෝරෝහණී කෙසේ සිදුවේද? ආර්ය විනයෙහි පච්චෝරෝහණී සිදුවන ආකාරය භවත් ගෞතමයන් වහන්සේ මට මනාව දේශනා කළ මැනව.\" \"එසේනම් බ්‍රාහ්මණය, ශ්‍රවණය කරන්න, මනාව සිත යොදවන්න; මම දේශනා කරන්නෙමි.\" \"එසේය, භාග්‍යවතුන් වහන්සැ\" යි ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය.\n\nභාග්‍යවතුන් වහන්සේ මේසේ වදාළ සේක: \"බ්‍රාහ්මණය, මෙහිලා, ආර්ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි – ‘මිථ්‍යාදෘෂ්ටියට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යාදෘෂ්ටිය අත්හරියි; මිථ්‍යාදෘෂ්ටියෙන් පහතට බසියි. ‘මිථ්‍යා සංකල්පයට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා සංකල්පය අත්හරියි; මිථ්‍යා සංකල්පයෙන් පහතට බසියි. ‘මිථ්‍යා වචනයට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා වචනය අත්හරියි; මිථ්‍යා වචනයෙන් පහතට බසියි. ‘මිථ්‍යා කර්මාන්තයට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා කර්මාන්තය අත්හරියි; මිථ්‍යා කර්මාන්තයෙන් පහතට බසියි. ‘මිථ්‍යා ආජීවයට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා ආජීවය අත්හරියි; මිථ්‍යා ආජීවයෙන් පහතට බසියි. ‘මිථ්‍යා ව්‍යායාමයට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා ව්‍යායාමය අත්හරියි; මිථ්‍යා ව්‍යායාමයෙන් පහතට බසියි. ‘මිථ්‍යා සතියට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා සතිය අත්හරියි; මිථ්‍යා සතියෙන් පහතට බසියි. ‘මිථ්‍යා සමාධියට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා සමාධිය අත්හරියි; මිථ්‍යා සමාධියෙන් පහතට බසියි. ‘මිථ්‍යා ඥානයට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා ඥානය අත්හරියි; මිථ්‍යා ඥානයෙන් පහතට බසියි. ‘මිථ්‍යා විමුක්තියට මෙලොවද පරලොවද නපුරු විපාක ඇත’ යි. හෙතෙම මෙසේ නුවණින් විමසා මිථ්‍යා විමුක්තිය අත්හරියි; මිථ්‍යා විමුක්තියෙන් පහතට බසියි. බ්‍රාහ්මණය, ආර්ය විනයෙහි පච්චෝරෝහණී සිදුවන්නේ මෙලෙසින්ය.\"\n\n\"භවත් ගෞතමයන් වහන්ස, බ්‍රාහ්මණවරුන්ගේ පච්චෝරෝහණී වෙන ආකාරයකටය, ආර්ය විනයෙහි පච්චෝරෝහණී තවත් ආකාරයකටය. භවත් ගෞතමයන් වහන්ස, මේ ආර්ය විනයෙහි පච්චෝරෝහණී බ්‍රාහ්මණවරුන්ගේ පච්චෝරෝහණීහි සොළොස් කලාවකටවත් වටින්නේ නැත. අතිශය ශෝභමානය, භවත් ගෞතමයන් වහන්ස, අතිශය ශෝභමානය, සුගතයන් වහන්ස! යමෙක් පෙරළා දැමූ දෙයක් කෙලින් කරන්නා සේ හෝ, වැසූ දෙයක් විවෘත කරන්නා සේ හෝ, මංමුළා වූවෙකුට මග පෙන්වන්නා සේ හෝ, ඇස් ඇති අයට රූප දකින පිණිස අඳුරේ තෙල් පහනක් දල්වන්නා සේ හෝ, නොයෙක් අයුරින් ධර්මය දේශනා කළ සේක. මම ඒ භාග්‍යවතුන් වහන්සේ සරණ යමි. ධර්මය සරණ යමි. සංඝයා සරණ යමි. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් තෙරුවන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා.\"",
      "paliTitle": "Paṭhamapaccorohaṇīsuttaṃ"
    },
    {
      "number": 120,
      "pali": "‘‘Ariyaṃ vo, bhikkhave, paccorohaṇiṃ desessāmi. Taṃ suṇātha… katamā ca, bhikkhave, ariyā paccorohaṇī? Idha, bhikkhave, ariyasāvako iti paṭisañcikkhati – ‘micchādiṭṭhiyā kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya micchādiṭṭhiṃ pajahati; micchādiṭṭhiyā paccorohati. Micchāsaṅkappassa kho pāpako vipāko… micchāvācāya kho… micchākammantassa kho… micchāājīvassa kho… micchāvāyāmassa kho… micchāsatiyā kho… micchāsamādhissa kho… micchāñāṇassa kho… micchāvimuttiyā kho pāpako vipāko – diṭṭhe ceva dhamme abhisamparāyañcāti. So iti paṭisaṅkhāya micchāvimuttiṃ pajahati; micchāvimuttiyā paccorohati. Ayaṃ vuccati, bhikkhave, ariyā paccorohaṇī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I will teach you the noble turning away. Listen to it. And what, monks, is that noble turning away? Here, monks, a noble disciple reflects thus: ‘Indeed, wrong view has an evil consequence, both in this very life and in the life to come.’ Having reflected thus, he abandons wrong view; he turns away from wrong view. Indeed, wrong intention has an evil consequence, both in this very life and in the life to come. So too does wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, and wrong knowledge. And wrong liberation also has an evil consequence, both in this very life and in the life to come. Having reflected thus, he abandons wrong liberation; he turns away from wrong liberation. This, monks, is called the noble turning away.",
      "sinhala": "මහණෙනි, මම ඔබට ආර්ය ප්‍රත්‍යවරෝහණය දෙසා වදාළා. එය අසව්. මහණෙනි, ආර්ය ප්‍රත්‍යවරෝහණය යනු කුමක්ද? මහණෙනි, මෙහිලා ආර්ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘මිත්‍යාදෘෂ්ටියට මේ ආත්මභාවයේදීත් පරලොවදීත් නරක විපාක ඇත’යි. හෙතෙම මෙසේ සලකා මිත්‍යාදෘෂ්ටිය අත්හරියි; මිත්‍යාදෘෂ්ටියෙන් ප්‍රත්‍යවරෝහණය කරයි. මිත්‍යාසංකල්පයට, මිත්‍යාවාචාවට, මිත්‍යාකර්මාන්තයට, මිත්‍යාආජීවයට, මිත්‍යාවායාමයට, මිත්‍යාස්මෘතියට, මිත්‍යාසමාධියට, මිත්‍යාඥානයට, සහ මිත්‍යාවිමුක්තියට මේ ආත්මභාවයේදීත් පරලොවදීත් නරක විපාක ඇත. හෙතෙම මෙසේ සලකා මිත්‍යාවිමුක්තිය අත්හරියි; මිත්‍යාවිමුක්තියෙන් ප්‍රත්‍යවරෝහණය කරයි. මහණෙනි, මෙය ආර්ය ප්‍රත්‍යවරෝහණය යැයි කියනු ලැබේ.",
      "paliTitle": "Dutiyapaccorohaṇīsuttaṃ"
    },
    {
      "number": 121,
      "pali": "‘‘Sūriyassa, bhikkhave, udayato etaṃ pubbaṅgamaṃ etaṃ pubbanimittaṃ, yadidaṃ – aruṇuggaṃ. Evamevaṃ kho, bhikkhave, kusalānaṃ dhammānaṃ etaṃ pubbaṅgamaṃ etaṃ pubbanimittaṃ, yadidaṃ – sammādiṭṭhi. Sammādiṭṭhikassa, bhikkhave, sammāsaṅkappo pahoti, sammāsaṅkappassa sammāvācā pahoti, sammākammanto pahoti, sammākammantassa sammāājīvo pahoti, sammāājīvassa sammāvāyāmo pahoti, sammāvāyāmassa sammāsati pahoti, sammāsatissa sammāsamādhi pahoti, sammāsamādhissa sammāñāṇaṃ pahoti, sammāñāṇissa sammāvimutti pahotī’’ti. Navamaṃ.",
      "english": "Monks, just as the appearance of dawn is the forerunner, the prior sign, for the rising of the sun; even so, monks, Right View is the forerunner, the prior sign, for wholesome states. For one with Right View, monks, Right Intention arises; from Right Intention, Right Speech arises; from Right Speech, Right Action arises; from Right Action, Right Livelihood arises; from Right Livelihood, Right Effort arises; from Right Effort, Right Mindfulness arises; from Right Mindfulness, Right Concentration arises; from Right Concentration, Right Knowledge arises; from Right Knowledge, Right Liberation arises.",
      "sinhala": "භික්ෂූණි, සූර්යයාගේ උදාවට පෙර ගමන් කරන්නා වූ, පෙර නිමිත්ත වන්නේ අරුණෝදයයි. භික්ෂූණි, එලෙසින්ම කුසල ධර්‍මයන්ට පෙර ගමන් කරන්නා වූ, පෙර නිමිත්ත වන්නේ සම්මා දිට්ඨියයි. භික්ෂූණි, සම්මා දිට්ඨි ඇත්තාහට සම්මා සඞ්කප්පය පහළ වෙයි. සම්මා සඞ්කප්පයෙන් සම්මා වාචාව පහළ වෙයි. එවිට සම්මා කම්මන්තය පහළ වෙයි. සම්මා කම්මන්තයෙන් සම්මා ආජීවය පහළ වෙයි. සම්මා ආජීවයෙන් සම්මා වායාමය පහළ වෙයි. සම්මා වායාමයෙන් සම්මා සතිය පහළ වෙයි. සම්මා සතියෙන් සම්මා සමාධිය පහළ වෙයි. සම්මා සමාධියෙන් සම්මා ඤාණය පහළ වෙයි. සම්මා ඤාණයෙන් සම්මා විමුක්තිය පහළ වෙයි.",
      "paliTitle": "Pubbaṅgamasuttaṃ"
    },
    {
      "number": 122,
      "pali": "‘‘Dasayime, bhikkhave, dhammā bhāvitā bahulīkatā āsavānaṃ khayāya saṃvattanti. Katame dasa? Sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi, sammāñāṇaṃ, sammāvimutti – ime kho, bhikkhave, dasa dhammā bhāvitā bahulīkatā āsavānaṃ khayāya saṃvattantī’’ti. Dasamaṃ. ",
      "english": "“Monks, these ten qualities, when developed and extensively practiced, lead to the destruction of the influxes. Which ten? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, Right Liberation. These ten qualities, monks, when developed and extensively practiced, lead to the destruction of the influxes.”",
      "sinhala": "මහණෙනි, වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි මේ ධර්ම දශය ආශ්‍රවයන්ගේ ක්ෂය වීම පිණිස පවතී. කවර දශයක්ද? සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි, සම්මා ඤාණ, සම්මා විමුක්ති. මහණෙනි, ඒකාන්තයෙන්ම මේ ධර්ම දශය වැඩූ කල්හි, බහුල වශයෙන් පුරුදු කළ කල්හි ආශ්‍රවයන්ගේ ක්ෂය වීම පිණිසම පවතී.",
      "paliTitle": "Āsavakkhayasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Paccorohaṇivaggo dutiyo. Tassuddānaṃ – Tayo adhammā ajito, saṅgāravo ca orimaṃ; Dve ceva paccorohaṇī, pubbaṅgamaṃ āsavakkhayoti.",
    "english": "",
    "sinhala": ""
  }
}