{
  "id": "an10.13",
  "title": {
    "pali": "Parisuddhavaggo",
    "english": "The Chapter of Perfect Purity",
    "sinhala": "පරිශුද්ධ වග්ගය"
  },
  "sections": [
    {
      "number": 123,
      "pali": "‘‘Dasayime, bhikkhave, dhammā parisuddhā pariyodātā, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi, sammāñāṇaṃ, sammāvimutti – ime kho, bhikkhave, dasa dhammā parisuddhā pariyodātā, nāññatra sugatavinayā’’ti. Paṭhamaṃ.",
      "english": "Monks, these ten qualities are perfectly pure and thoroughly cleansed, exclusively within the discipline of the Fortunate One. Which are these ten? Right Understanding, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, and Right Liberation. Indeed, Monks, these ten qualities are perfectly pure and thoroughly cleansed, exclusively within the discipline of the Fortunate One.",
      "sinhala": "භික්ෂූණි, සුගතයන් වහන්සේගේ ශාසනයෙන් පිටත දක්නට නොලැබෙන, සම්පූර්ණයෙන් පිරිසිදු වූ, අතිශයින් විශුද්ධ වූ මේ දස ධර්‍මයෝ වෙති.\n\nඒ දස ධර්‍මයෝ කවරහුද?\n\nඑනම්: සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචාව, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධිය, සම්මා ඥාණය, සම්මා විමුක්තිය යි.\n\nභික්ෂූණි, සුගතයන් වහන්සේගේ ශාසනයෙන් පිටත දක්නට නොලැබෙන, සම්පූර්ණයෙන් පිරිසිදු වූ, අතිශයින් විශුද්ධ වූ මේ දස ධර්‍මයෝම වෙති.",
      "paliTitle": "Paṭhamasuttaṃ",
      "englishTitle": "First Sutta",
      "sinhalaTitle": "පළමු සූත්‍රය"
    },
    {
      "number": 124,
      "pali": "‘‘Dasayime, bhikkhave, dhammā anuppannā uppajjanti, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi …pe… sammāvimutti – ime kho, bhikkhave, dasa dhammā anuppannā uppajjanti, nāññatra sugatavinayā’’ti. Dutiyaṃ.",
      "english": "Monks, these ten qualities, previously unarisen, come to arise, and do so nowhere else but in the discipline of the Fortunate One. Which ten? Right View, and so forth, up to Right Deliverance. Indeed, monks, these ten qualities, previously unarisen, come to arise, and do so nowhere else but in the discipline of the Fortunate One.",
      "sinhala": "භික්ෂූණි, නොහටගත් දේ ලෙස හටගන්නා මේ දස ධර්මයන්, සුගතයන් වහන්සේගේ විනයෙහි ඇර, වෙනතක නොහටගනී. ඒ දසය කවරේද? සම්මාදිට්ඨිය ආදී කොට ඇති සම්මාවිමුක්තිය දක්වා වූ මේ දස ධර්මයන්, භික්ෂූණි, නොහටගත් දේ ලෙස හටගන්නේ සුගතයන් වහන්සේගේ විනයෙහි ඇර, වෙනතක නොවේ.",
      "paliTitle": "Dutiyasuttaṃ",
      "englishTitle": "The Second Discourse",
      "sinhalaTitle": "දෙවැනි සූත්‍රය"
    },
    {
      "number": 125,
      "pali": "‘‘Dasayime, bhikkhave, dhammā mahapphalā mahānisaṃsā, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi…pe… sammāvimutti – ime kho, bhikkhave, dasa dhammā mahapphalā mahānisaṃsā, nāññatra sugatavinayā’’ti. Tatiyaṃ.",
      "english": "Monks, these ten qualities are of great fruit and great benefit, and nowhere else but in the discipline of the Fortunate One. Which ten? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, Right Liberation. These indeed, monks, are the ten qualities of great fruit and great benefit, and nowhere else but in the discipline of the Fortunate One.",
      "sinhala": "භික්ෂූනි, මේ දස ධර්මයෝ මහාඵල ඇත්තාහ, මහානිසංස ඇත්තාහ; සුගතයන් වහන්සේගේ විනයෙන් තොරව නොලැබේ. ඒ දස ධර්මයෝ කවරහුද? සම්මාදිට්ඨියෙහි සිට සම්මාවිමුක්තිය දක්වා වූ ධර්මයෝයි. භික්ෂූනි, සැබවින්ම මේ දස ධර්මයෝ මහාඵල ඇත්තාහ, මහානිසංස ඇත්තාහ; සුගතයන් වහන්සේගේ විනයෙන් තොරව නොලැබේ.",
      "paliTitle": "Tatiyasuttaṃ",
      "englishTitle": "The Third Discourse",
      "sinhalaTitle": "තුන්වන සූත්‍රය"
    },
    {
      "number": 126,
      "pali": "‘‘Dasayime, bhikkhave, dhammā rāgavinayapariyosānā honti dosavinayapariyosānā honti mohavinayapariyosānā honti, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi…pe… sammāvimutti – ime kho, bhikkhave, dasa dhammā rāgavinayapariyosānā honti dosavinayapariyosānā honti mohavinayapariyosānā honti, nāññatra sugatavinayā’’ti. Catutthaṃ.",
      "english": "Monks, these ten qualities culminate in the removal of passion, culminate in the removal of hatred, and culminate in the removal of delusion, and not otherwise than through the discipline of the Fortunate One.\n\nWhat are these ten? Right View... and so on... up to Right Liberation. Indeed, Monks, these ten qualities culminate in the removal of passion, culminate in the removal of hatred, and culminate in the removal of delusion, and not otherwise than through the discipline of the Fortunate One.",
      "sinhala": "මහණෙනි, මේ දස ධර්මයෝ රාගය දුරු කිරීමෙන් කෙළවර වෙති, ද්වේෂය දුරු කිරීමෙන් කෙළවර වෙති, මෝහය දුරු කිරීමෙන් කෙළවර වෙති. ඒ සුගතයන් වහන්සේගේ විනයෙන් තොරව නොවේ.\n\nකවර දස ධර්මයක්ද?\n\nඒවා නම් සම්මාදිට්ඨිය... (ආදී වශයෙන්)... සම්මාවිමුක්තිය යන මේ දස ධර්මයෝය. මහණෙනි, මේ දස ධර්මයෝ රාගය දුරු කිරීමෙන් කෙළවර වෙති, ද්වේෂය දුරු කිරීමෙන් කෙළවර වෙති, මෝහය දුරු කිරීමෙන් කෙළවර වෙති. ඒ සුගතයන් වහන්සේගේ විනයෙන් තොරව නොවේ.",
      "paliTitle": "Catutthasuttaṃ",
      "englishTitle": "The Fourth Sutta",
      "sinhalaTitle": "සිව්වන සූ‍ත්‍රය"
    },
    {
      "number": 127,
      "pali": "‘‘Dasayime, bhikkhave, dhammā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi…pe… sammāvimutti – ime kho, bhikkhave, dasa dhammā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti, nāññatra sugatavinayā’’ti. Pañcamaṃ.",
      "english": "These ten qualities, monks, lead to utter disenchantment, to dispassion, to cessation, to tranquility, to direct knowledge, to full enlightenment, to Nibbāna; and not apart from the discipline of the Fortunate One. Which ten? Right View... and so on... Right Liberation – these ten qualities, monks, indeed lead to utter disenchantment, to dispassion, to cessation, to tranquility, to direct knowledge, to full enlightenment, to Nibbāna; and not apart from the discipline of the Fortunate One.",
      "sinhala": "මහණෙනි, සුගතයන් වහන්සේගේ විනය හැර අන් කිසිවකින් නොව, මේ ධර්ම දහය එකාන්තයෙන් කලකිරීම පිණිසත්, නොඇල්ම පිණිසත්, නිරෝධය පිණිසත්, උපශාන්තය පිණිසත්, අභිඥාව පිණිසත්, සම්බෝධිය පිණිසත්, නිවන පිණිසත් පවතී.\n\nඒ දහය කවරේද? සම්මාදිට්ඨිය… ආදී වශයෙන්… සම්මා විමුක්තිය දක්වා වූ ධර්මයන් ය. මහණෙනි, සුගතයන් වහන්සේගේ විනය හැර අන් කිසිවකින් නොව, මේ ධර්ම දහයම එකාන්තයෙන් කලකිරීම පිණිසත්, නොඇල්ම පිණිසත්, නිරෝධය පිණිසත්, උපශාන්තය පිණිසත්, අභිඥාව පිණිසත්, සම්බෝධිය පිණිසත්, නිවන පිණිසත් පවතී.",
      "paliTitle": "Pañcamasuttaṃ",
      "englishTitle": "The Fifth Discourse",
      "sinhalaTitle": "පස්වන සූත‍්‍රය"
    },
    {
      "number": 128,
      "pali": "‘‘Dasayime, bhikkhave, dhammā bhāvitā bahulīkatā anuppannā uppajjanti, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi …pe… sammāvimutti – ime kho, bhikkhave, dasa dhammā bhāvitā bahulīkatā anuppannā uppajjanti, nāññatra sugatavinayā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these ten qualities, when developed and repeatedly cultivated, arise if they have not yet arisen, and not elsewhere, except within the discipline of the Fortunate One. Which ten? Right understanding, right thought, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation. These ten qualities, monks, when developed and repeatedly cultivated, arise if they have not yet arisen, and not elsewhere, except within the discipline of the Fortunate One.",
      "sinhala": "මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ ධර්ම දහය, නූපන් දෑ ලෙස උපදී. සුගතයන් වහන්සේගේ විනයෙහි හැර අන් තැනක එය සිදු නොවේ.\n\nඒ දහය කවරේද?\n\nඑනම්: සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි, සම්මා ඤාණ, සම්මා විමුක්ති යන මේ ධර්ම දහයයි. මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ ධර්ම දහය, නූපන් දෑ ලෙස උපදී. සුගතයන් වහන්සේගේ විනයෙහි හැර අන් තැනක එය සිදු නොවේ.",
      "paliTitle": "Chaṭṭhasuttaṃ",
      "englishTitle": "The Sixth Discourse",
      "sinhalaTitle": "හයවන සූත්‍රය"
    },
    {
      "number": 129,
      "pali": "‘‘Dasayime, bhikkhave, dhammā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi…pe… sammāvimutti – ime kho, bhikkhave, dasa dhammā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā, nāññatra sugatavinayā’’ti. Sattamaṃ.",
      "english": "“Monks, these ten factors, when developed and extensively cultivated, lead to great fruit and great benefit, not outside the discipline of the Fortunate One. Which ten? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, Right Liberation — these ten factors, monks, when developed and extensively cultivated, lead to great fruit and great benefit, not outside the discipline of the Fortunate One.”",
      "sinhala": "භික්ෂූනි, වර්ධනය කරන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ ධ‍ර්‍ම දහය මහත් ඵල ඇති, මහත් ආනිශංස ඇති වන්නේ සුගතයන් වහන්සේගේ ශාසනයෙන් තොරව අන් කිසි තැනක නොවේ.\n\nඒ දස ධ‍ර්‍මයන් කවරේද?\n\nසම්මාදිට්ඨිය, සම්මාසංකප්පය, සම්මාවාචාය, සම්මාකම්මන්තය, සම්මාආජීවය, සම්මාවායාමය, සම්මාසතිය, සම්මාසමාධිය, සම්මාඥාණය, සම්මාවිමුක්තිය යන ධ‍ර්‍ම දහයයි.\n\nභික්ෂූනි, වර්ධනය කරන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ ධ‍ර්‍ම දහය මහත් ඵල ඇති, මහත් ආනිශංස ඇති වන්නේ සුගතයන් වහන්සේගේ ශාසනයෙන් තොරව අන් කිසි තැනක නොවේ.",
      "paliTitle": "Sattamasuttaṃ",
      "englishTitle": "The Seventh Discourse",
      "sinhalaTitle": "සත්වන සූත්‍රය"
    },
    {
      "number": 130,
      "pali": "‘‘Dasayime, bhikkhave, dhammā bhāvitā bahulīkatā rāgavinayapariyosānā honti dosavinayapariyosānā honti mohavinayapariyosānā honti, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi…pe… sammāvimutti – ime kho, bhikkhave, dasa dhammā bhāvitā bahulīkatā rāgavinayapariyosānā honti dosavinayapariyosānā honti mohavinayapariyosānā honti, nāññatra sugatavinayā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these ten qualities, when developed and repeatedly cultivated, culminate in the complete elimination of craving, in the complete elimination of hatred, and in the complete elimination of delusion; and not otherwise than through the discipline of the Fortunate One. Which ten? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, Right Liberation. Indeed, monks, these ten qualities, when developed and repeatedly cultivated, culminate in the complete elimination of craving, in the complete elimination of hatred, and in the complete elimination of delusion; and not otherwise than through the discipline of the Fortunate One.",
      "sinhala": "මහණෙනි, වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ දස ධර්‍මයන් රාගය දුරු කිරීම අවසානය කොට ඇත්තාහු වෙති; ද්වේෂය දුරු කිරීම අවසානය කොට ඇත්තාහු වෙති; මෝහය දුරු කිරීම අවසානය කොට ඇත්තාහු වෙති. ඒ සුගතයන් වහන්සේගේ ශාසනයෙන් අන් තැනක නොවේ.\n\nකවර දසයක් ද?\n\nඒවා නම්: සම්‍යක්දෘෂ්ටිය...ආදී කොට ඇති සම්‍යක්විමුක්තියයි. මහණෙනි, සැබවින්ම වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද මේ දස ධර්‍මයන් රාගය දුරු කිරීම අවසානය කොට ඇත්තාහු වෙති; ද්වේෂය දුරු කිරීම අවසානය කොට ඇත්තාහු වෙති; මෝහය දුරු කිරීම අවසානය කොට ඇත්තාහු වෙති. ඒ සුගතයන් වහන්සේගේ ශාසනයෙන් අන් තැනක නොවේ.",
      "paliTitle": "Aṭṭhamasuttaṃ",
      "englishTitle": "The Eighth Sutta",
      "sinhalaTitle": "අටවන සූත්‍රය"
    },
    {
      "number": 131,
      "pali": "‘‘Dasayime, bhikkhave, dhammā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti, nāññatra sugatavinayā. Katame dasa? Sammādiṭṭhi…pe… sammāvimutti – ime kho, bhikkhave, dasa dhammā bhāvitā bahulīkatā ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti, nāññatra sugatavinayā’’ti. Navamaṃ.",
      "english": "Monks, these ten qualities, when developed and frequently practiced, lead to utter disenchantment, to dispassion, to cessation, to pacification, to direct knowledge, to full awakening, and to Nibbāna, and not apart from the discipline of the Fortunate One. Which ten? Right View... up to Right Liberation. These, monks, are the ten qualities which, when developed and frequently practiced, lead to utter disenchantment, to dispassion, to cessation, to pacification, to direct knowledge, to full awakening, and to Nibbāna, and not apart from the discipline of the Fortunate One.",
      "sinhala": "භික්ෂූණි, මේ දස ධර්මයෝ වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ඒකාන්ත නිර්වේදය පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, උපශමය පිණිස, අභිඥාව පිණිස, සම්බෝධිය පිණිස, නිර්වාණය පිණිස පවතී. සුගතයන් වහන්සේගේ විනය හැර අන් තැනක නොවේ.\n\nකවර දස ධර්මයක් ද? සම්‍යක්දෘෂ්ටිය... සම්‍යක්විමුක්තිය (දක්වා වූ ධර්මයෝය). භික්ෂූණි, මේ දස ධර්මයෝ වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, ඒකාන්ත නිර්වේදය පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, උපශමය පිණිස, අභිඥාව පිණිස, සම්බෝධිය පිණිස, නිර්වාණය පිණිස පවතී. සුගතයන් වහන්සේගේ විනය හැර අන් තැනක නොවේ.",
      "paliTitle": "Navamasuttaṃ",
      "englishTitle": "The Ninth Sutta",
      "sinhalaTitle": "නව වන සූත‍්‍රය"
    },
    {
      "number": 132,
      "pali": "‘‘Dasayime, bhikkhave, micchattā. Katame dasa? Micchādiṭṭhi, micchāsaṅkappo, micchāvācā, micchākammanto, micchāājīvo, micchāvāyāmo, micchāsati, micchāsamādhi, micchāñāṇaṃ, micchāvimutti – ime kho, bhikkhave, dasa micchattā’’ti. Dasamaṃ.",
      "english": "Monks, these are ten wrongnesses. Which ten? Wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation – these, monks, are indeed the ten wrongnesses.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ දස මිථ්‍යාත්වෝ ය. කවර දසයක්ද? මිථ්‍යාදෘෂ්ටිය, මිථ්‍යාසංකල්පය, මිථ්‍යාවචනය, මිථ්‍යාකර්මාන්තය, මිථ්‍යාආජීවය, මිථ්‍යාව්‍යායාමය, මිථ්‍යාස්මෘතිය, මිථ්‍යාසමාධිය, මිථ්‍යාඥානය, මිථ්‍යාවිමුක්තිය යන මේවා ය. භික්ෂූන් වහන්ස, මේ දස මිථ්‍යාත්වෝ ය.",
      "paliTitle": "Dasamasuttaṃ",
      "englishTitle": "The Tenth Discourse",
      "sinhalaTitle": "දසවන සූත්‍රය"
    },
    {
      "number": 133,
      "pali": "‘‘Dasayime, bhikkhave, sammattā. Katame dasa? Sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi, sammāñāṇaṃ, sammāvimutti – ime kho, bhikkhave, dasa sammattā’’ti. Ekādasamaṃ. ",
      "english": "Monks, these are the ten rightnesses. Which ten? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, and Right Liberation – these, monks, are the ten rightnesses.",
      "sinhala": "මහණෙනි, මේ දස සම්යග් ධර්මයෝ වෙති. ඒ දසය කවරහුද? සම්යග් දෘෂ්ටිය, සම්යග් සංකල්පය, සම්යග් වචනය, සම්යග් කර්මාන්තය, සම්යග් ආජීවය, සම්යග් ව්‍යායාමය, සම්යග් ස්මෘතිය, සම්යග් සමාධිය, සම්යග් ඥානය, සම්යග් විමුක්තිය යන මේවාය. මහණෙනි, මේ දස සම්යග් ධර්මයෝ වෙති.",
      "paliTitle": "Ekādasamasuttaṃ",
      "englishTitle": "The Eleventh Discourse",
      "sinhalaTitle": "එකොළොස්වන සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Parisuddhavaggo tatiyo.",
    "english": "The Third Chapter on Purity",
    "sinhala": "තෙවැනි පාරිශුද්U+0DCAU+200Dධ වග්U+0DCAU+200Dගය"
  }
}