{
  "id": "an10.19",
  "title": {
    "pali": "Ariyamaggavaggo",
    "english": "The Chapter on the Noble Path",
    "sinhala": "ආර්‍ය මාර්‍ග වග්ගය"
  },
  "sections": [
    {
      "number": 189,
      "pali": "‘‘Ariyamaggañca vo, bhikkhave, desessāmi anariyamaggañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, anariyo maggo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, anariyo maggo. ‘‘Katamo ca, bhikkhave, ariyo maggo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, ariyo maggo’’ti. Paṭhamaṃ.",
      "english": "Monks, I will teach you the Noble Path and the ignoble path. Listen to it carefully. And what, monks, is the ignoble path? It is the taking of life, taking what is not given, sexual misconduct, false speech, divisive speech, harsh speech, idle chatter, covetousness, ill-will, and wrong view. This, monks, is called the ignoble path.\n\nAnd what, monks, is the Noble Path? It is abstaining from taking life, abstaining from taking what is not given, abstaining from sexual misconduct, abstaining from false speech, abstaining from divisive speech, abstaining from harsh speech, abstaining from idle chatter, non-covetousness, goodwill, and right view. This, monks, is called the Noble Path.",
      "sinhala": "මහණෙනි, මම නුඹලාට ආර්ය මාර්ගයද, අනාර්ය මාර්ගයද දේශනා කරන්නෙමි. ඒ අසන්න. මහණෙනි, අනාර්ය මාර්ගය යනු කවරේද? ප්‍රාණඝාතය, අදත්තාදානය, කාමයන්හි මිථ්‍යාචාරය, මුසාවාදය, පිසුණු වචන, ඵරුෂ වචන, සම්ඵප්පලාපය, අභිධ්‍යාව, ව්‍යාපාදය, මිථ්‍යාදෘෂ්ටිය – මහණෙනි, මෙය අනාර්ය මාර්ගය යැයි කියනු ලැබේ. මහණෙනි, ආර්ය මාර්ගය යනු කවරේද? ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමයන්හි මිථ්‍යාචාරයෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, පිසුණු වචනවලින් වැළකීම, ඵරුෂ වචනවලින් වැළකීම, සම්ඵප්පලාපයෙන් වැළකීම, අනභිධ්‍යාව, අව්‍යාපාදය, සම්මාදිට්ඨිය – මහණෙනි, මෙය ආර්ය මාර්ගය යැයි කියනු ලැබේ.",
      "paliTitle": "Ariyamaggasuttaṃ",
      "englishTitle": "The Noble Path Discourse",
      "sinhalaTitle": "ආර්‍යමාර්‍ග සූත්‍‍රය"
    },
    {
      "number": 190,
      "pali": "‘‘Kaṇhamaggañca vo, bhikkhave, desessāmi sukkamaggañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, kaṇho maggo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, kaṇho maggo. ‘‘Katamo ca, bhikkhave, sukko maggo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, sukko maggo’’ti. Dutiyaṃ.",
      "english": "Monastics, I shall teach you the dark path and the bright path. Listen to that. And what, monastics, is the dark path? It is the taking of life, stealing, sexual misconduct, false speech, slanderous speech, harsh speech, idle chatter, covetousness, ill will, and wrong view. This, monastics, is called the dark path.\n\nAnd what, monastics, is the bright path? It is abstinence from the taking of life, abstinence from stealing, abstinence from sexual misconduct, abstinence from false speech, abstinence from slanderous speech, abstinence from harsh speech, abstinence from idle chatter, non-covetousness, goodwill, and right view. This, monastics, is called the bright path.",
      "sinhala": "භික්ෂූනි, ඔබට කළු මාර්ගය ද, සුදු මාර්ගය ද දේශනා කරන්නෙමි. එය අසන්න.\n\nභික්ෂූනි, කළු මාර්ගය කවරේද? ප්‍රාණඝාතය... මිථ්‍යාදෘෂ්ටියයි – භික්ෂූනි, මෙය කළු මාර්ගයැයි කියනු ලැබේ.\n\nභික්ෂූනි, සුදු මාර්ගය කවරේද? ප්‍රාණඝාතයෙන් වැළකීම... සම්මාදිට්ඨියයි – භික්ෂූනි, මෙය සුදු මාර්ගයැයි කියනු ලැබේ.\n\nදෙවැනි සූත්‍රයයි.",
      "paliTitle": "Kaṇhamaggasuttaṃ",
      "englishTitle": "Discourse on the Dark Path",
      "sinhalaTitle": "කළු මාර්‍ග සූත්‍\\u200dරය"
    },
    {
      "number": 191,
      "pali": "‘‘Saddhammañca vo, bhikkhave, desessāmi asaddhammañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, asaddhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, asaddhammo. ‘‘Katamo ca, bhikkhave, saddhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, saddhammo’’ti. Tatiyaṃ.",
      "english": "Monks, I will teach you both the wholesome Dhamma and the unwholesome Dhamma. Listen to it.\n\nAnd what, monks, is the unwholesome Dhamma? Taking life, stealing, sexual misconduct, false speech, malicious speech, harsh speech, frivolous talk, covetousness, ill-will, and wrong view – this, monks, is called the unwholesome Dhamma.\n\nAnd what, monks, is the wholesome Dhamma? Abstaining from taking life, abstaining from stealing, abstaining from sexual misconduct, abstaining from false speech, abstaining from malicious speech, abstaining from harsh speech, abstaining from frivolous talk, non-covetousness, non-ill-will, and right view – this, monks, is called the wholesome Dhamma.",
      "sinhala": "මහණෙනි, මම ඔබට සද්ධර්‍මය ද අසද්ධර්‍මය ද දේශනා කරමි. එයට සවන් දෙන්න. මහණෙනි, අසද්ධර්‍මය කවරේද? ප්‍රාණඝාතය, අදත්තාදානය, කාමේසුමිච්ඡාචාරය, මුසාවාදය, පිසුණාවාචාව, ඵරුෂාවාචාව, සම්ප්‍රප්පලාපය, අභිධ්‍යාව, ව්‍යාපාදය සහ මිත්‍යාදෘෂ්ටිය යන මේවා මහණෙනි, අසද්ධර්‍මය යයි කියනු ලැබේ.\n\nමහණෙනි, සද්ධර්‍මය කවරේද? ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමේසුමිච්ඡාචාරයෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, පිසුණාවාචාවෙන් වැළකීම, ඵරුෂාවාචාවෙන් වැළකීම, සම්ප්‍රප්පලාපයෙන් වැළකීම, අනභිධ්‍යාව, අව්‍යාපාදය සහ සම්මාදිට්ඨිය යන මේවා මහණෙනි, සද්ධර්‍මය යයි කියනු ලැබේ.",
      "paliTitle": "Saddhammasuttaṃ",
      "englishTitle": "Discourse on True Dhamma",
      "sinhalaTitle": "සද‌්ධර‌්ම සූත්‍රය"
    },
    {
      "number": 192,
      "pali": "‘‘Sappurisadhammañca vo, bhikkhave, desessāmi asappurisadhammañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, asappurisadhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, asappurisadhammo. ‘‘Katamo ca, bhikkhave, sappurisadhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, sappurisadhammo’’ti. Catutthaṃ.",
      "english": "Monks, I shall teach you the qualities of a virtuous person and the qualities of an ignoble person. Listen to that. And what, monks, are the qualities of an ignoble person? Taking life... up to wrong view – this, monks, is called the qualities of an ignoble person. And what, monks, are the qualities of a virtuous person? Abstention from taking life... up to right view – this, monks, is called the qualities of a virtuous person.",
      "sinhala": "භික්‍ෂූණි, මම ඔබට සත්පුරුෂ ධර්මයත්, අසත්පුරුෂ ධර්මයත් දේශනා කරන්නෙමි. එය අසන්න. භික්‍ෂූණි, අසත්පුරුෂ ධර්මය කවරේද? ප්‍රාණඝාතය... මිථ්‍යාදෘෂ්ටියයි – භික්‍ෂූණි, මෙය අසත්පුරුෂ ධර්මය යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, සත්පුරුෂ ධර්මය කවරේද? ප්‍රාණඝාතයෙන් වැළකීම... සම්මාදෘෂ්ටියයි – භික්‍ෂූණි, මෙය සත්පුරුෂ ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Sappurisadhammasuttaṃ",
      "englishTitle": "Discourse on Virtuous Qualities",
      "sinhalaTitle": "සප්පුරිස ධර්‍ම සූත්‍රය"
    },
    {
      "number": 193,
      "pali": "‘‘Uppādetabbañca vo, bhikkhave, dhammaṃ desessāmi na uppādetabbañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, na uppādetabbo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, na uppādetabbo dhammo. ‘‘Katamo ca, bhikkhave, uppādetabbo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, uppādetabbo dhammo’’ti. Pañcamaṃ.",
      "english": "Monks, I will teach you the Dhamma that should be developed and the Dhamma that should not be developed. Listen to it. And what, monks, is the Dhamma that should not be developed? The taking of life, taking what is not given, sexual misconduct, false speech, divisive speech, harsh speech, idle chatter, covetousness, ill will, and wrong view – this, monks, is called the Dhamma that should not be developed. And what, monks, is the Dhamma that should be developed? Abstention from taking life, abstention from taking what is not given, abstention from sexual misconduct, abstention from false speech, abstention from divisive speech, abstention from harsh speech, abstention from idle chatter, non-covetousness, non-ill will, and right view – this, monks, is called the Dhamma that should be developed.",
      "sinhala": "මහණෙනි, වඩන ලද යුතු ධ​ර්ම​ය​ත්, වඩන ලද යුතු නොවන ධ​ර්ම​ය​ත් මම ඔබට දේශනා කරන්නෙමි. එය ශ්‍ර​ව​ණ​ය කරන්න.\n\nමහණෙනි, වඩන ලද යුතු නොවන ධ​ර්ම​ය කවරේද? ප්‍රාණඝාතය, අදත්තාදානය, කාමයන්හි වරදවා හැසිරීම, මුසාවාදය, පිසුණු වචනය, ඵරුෂ වචනය, සම්ප්‍ර​ප්ප​ලා​ප​ය, අභිධ්‍යාව, ව්‍යාපාදය, මිථ්‍යාදෘෂ්ටිය – මහණෙනි, මෙය වඩන ලද යුතු නොවන ධ​ර්ම​ය යැයි කියනු ලැබේ.\n\nමහණෙනි, වඩන ලද යුතු ධ​ර්ම​ය කවරේද? ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, පිසුණු වචනයෙන් වැළකීම, ඵරුෂ වචනයෙන් වැළකීම, සම්ප්‍ර​ප්ප​ලා​ප​යෙන් වැළකීම, අනභිධ්‍යාව, අව්‍යාපාදය, සම්මාදිට්ඨිය – මහණෙනි, මෙය වඩන ලද යුතු ධ​ර්ම​ය යැයි කියනු ලැබේ.",
      "paliTitle": "Uppādetabbadhammasuttaṃ",
      "englishTitle": "Discourse on Qualities to be Developed",
      "sinhalaTitle": "වැඩිය යුතු ධර්‍ම සූත්‍රය"
    },
    {
      "number": 194,
      "pali": "‘‘Āsevitabbañca vo, bhikkhave, dhammaṃ desessāmi nāsevitabbañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, nāsevitabbo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, nāsevitabbo dhammo. ‘‘Katamo ca, bhikkhave, āsevitabbo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, āsevitabbo dhammo’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, I will teach you the teaching that should be practiced and the teaching that should not be practiced. Listen to it. And what, monks, is the teaching that should not be practiced? Killing living beings, taking what is not given, sexual misconduct, false speech, divisive speech, harsh speech, idle chatter, covetousness, ill-will, and wrong view – this, monks, is called the teaching that should not be practiced. And what, monks, is the teaching that should be practiced? Abstaining from killing living beings, abstaining from taking what is not given, abstaining from sexual misconduct, abstaining from false speech, abstaining from divisive speech, abstaining from harsh speech, abstaining from idle chatter, non-covetousness, non-ill-will, and right view – this, monks, is called the teaching that should be practiced.”",
      "sinhala": "මහණෙනි, ඔබලාට සේවනය කළ යුතු සහ සේවනය නොකළ යුතු ධර්මය මම දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, සේවනය නොකළ යුතු ධර්මය කවරේද? ප්‍රාණඝාතය... මිත්‍යා දෘෂ්ටිය යනු මහණෙනි, සේවනය නොකළ යුතු ධර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, සේවනය කළ යුතු ධර්මය කවරේද? ප්‍රාණඝාතයෙන් වැළකීම... සම්මා දිට්ඨිය යනු මහණෙනි, සේවනය කළ යුතු ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Āsevitabbadhammasuttaṃ",
      "englishTitle": "The Discourse on Qualities to be Cultivated",
      "sinhalaTitle": "වැඩිය යුතු ධ​ර්ම සූත්‍රය"
    },
    {
      "number": 195,
      "pali": "‘‘Bhāvetabbañca vo, bhikkhave, dhammaṃ desessāmi na bhāvetabbañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, na bhāvetabbo dhammo? Pāṇātipāto …pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, na bhāvetabbo dhammo. ‘‘Katamo ca, bhikkhave, bhāvetabbo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, bhāvetabbo dhammo’’ti. Sattamaṃ.",
      "english": "Monks, I will teach you the Dhamma that is to be cultivated and the Dhamma that is not to be cultivated. Listen to it, attend carefully. And what, monks, is the Dhamma not to be cultivated? The killing of living beings, taking what is not given, sexual misconduct, false speech, slanderous speech, harsh speech, frivolous talk, covetousness, ill-will, and wrong view – this, monks, is called the Dhamma not to be cultivated. And what, monks, is the Dhamma to be cultivated? Abstinence from killing living beings, abstinence from taking what is not given, abstinence from sexual misconduct, abstinence from false speech, abstinence from slanderous speech, abstinence from harsh speech, abstinence from frivolous talk, non-covetousness, goodwill, and right view – this, monks, is called the Dhamma to be cultivated.",
      "sinhala": "මහණෙනි, වැඩිය යුතු දහමද, නොවැඩිය යුතු දහමද මම ඔබට දේශනා කරන්නෙමි. එය අසව්. මහණෙනි, නොවැඩිය යුතු දහම කවරේද? ප‍්‍රාණඝාතය... මිථ්‍යාදෘෂ්ටිය – මහණෙනි, මෙය නොවැඩිය යුතු දහම යැයි කියනු ලැබේ. මහණෙනි, වැඩිය යුතු දහම කවරේද? ප‍්‍රාණඝාතයෙන් වැළකීම... සම්මාදිට්ඨිය – මහණෙනි, මෙය වැඩිය යුතු දහම යැයි කියනු ලැබේ.",
      "paliTitle": "Bhāvetabbadhammasuttaṃ",
      "englishTitle": "Discourse on Qualities to be Developed",
      "sinhalaTitle": "වැඩිය යුතු ධර්ම සූත්‍රය"
    },
    {
      "number": 196,
      "pali": "‘‘Bahulīkātabbañca vo, bhikkhave, dhammaṃ desessāmi na bahulīkātabbañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, na bahulīkātabbo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, na bahulīkātabbo dhammo. ‘‘Katamo ca, bhikkhave, bahulīkātabbo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, bahulīkātabbo dhammo’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, I shall teach you the teaching that is to be cultivated and the teaching that is not to be cultivated. Listen to it. And what, monks, is the teaching that is not to be cultivated? Killing living beings, and so forth, up to wrong view – this, monks, is called the teaching that is not to be cultivated. And what, monks, is the teaching that is to be cultivated? Abstinence from killing living beings, and so forth, up to right view – this, monks, is called the teaching that is to be cultivated.”",
      "sinhala": "භික්ෂූණි, වඩන ලද යුතු ධර්මයත්, නොවැඩිය යුතු ධර්මයත් මම ඔබට දේශනා කරන්නෙමි. එයට සවන් දෙන්න. භික්ෂූණි, නොවැඩිය යුතු ධර්මය නම් කවරේද? ප්‍රාණඝාතය, අදින්නාදානය, කාමයන්හි වරදවා හැසිරීම, මුසාවාදය, පිසුණා වචනය, ඵරුෂ වචනය, සම්ඵප්පලාපය, අභිධ්‍යාව, ව්‍යාපාදය, මිථ්‍යාදෘෂ්ටිය – භික්ෂූණි, මෙය නොවැඩිය යුතු ධර්මයයි. භික්ෂූණි, වැඩිය යුතු ධර්මය නම් කවරේද? ප්‍රාණඝාතයෙන් වැළකීම, අදින්නාදානයෙන් වැළකීම, කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, පිසුණා වචනයෙන් වැළකීම, ඵරුෂ වචනයෙන් වැළකීම, සම්ඵප්පලාපයෙන් වැළකීම, අභිධ්‍යාවෙන් තොරවීම, ව්‍යාපාදයෙන් තොරවීම, සම්මාදිට්ඨිය – භික්ෂූණි, මෙය වැඩිය යුතු ධර්මයයි.",
      "paliTitle": "Bahulīkātabbasuttaṃ",
      "englishTitle": "The Cultivation Discourse",
      "sinhalaTitle": "වැඩිය යුතු සූත්‍රය"
    },
    {
      "number": 197,
      "pali": "‘‘Anussaritabbañca vo, bhikkhave, dhammaṃ desessāmi nānussaritabbañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, nānussaritabbo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, nānussaritabbo dhammo. ‘‘Katamo ca, bhikkhave, anussaritabbo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, anussaritabbo dhammo’’ti. Navamaṃ.",
      "english": "Monks, I will teach you the teaching that should be dwelt upon and the teaching that should not be dwelt upon. Listen to it. And what, monks, is the teaching that should not be dwelt upon? The taking of life, and so forth, up to wrong view – this, monks, is called the teaching that should not be dwelt upon. And what, monks, is the teaching that should be dwelt upon? Abstaining from the taking of life, and so forth, up to right view – this, monks, is called the teaching that should be dwelt upon.",
      "sinhala": "භික්‍ෂූණි, මෙනෙහි කළ යුතු ධර්මය ද, මෙනෙහි නොකළ යුතු ධර්මය ද මම ඔබට දේශනා කරමි. එය හොඳින් අසන්න.\n\nභික්‍ෂූණි, මෙනෙහි නොකළ යුතු ධර්මය කවරේද? ප්‍රාණඝාතය ආදියෙන් යුක්ත වූ මිත්‍යාදෘෂ්ටිය දක්වා වූ යම් ධර්මයක් වේද, භික්‍ෂූණි, මෙය මෙනෙහි නොකළ යුතු ධර්මය යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, මෙනෙහි කළ යුතු ධර්මය කවරේද? ප්‍රාණඝාතයෙන් වැළකීම ආදියෙන් යුක්ත වූ සම්‍යක්දෘෂ්ටිය දක්වා වූ යම් ධර්මයක් වේද, භික්‍ෂූණි, මෙය මෙනෙහි කළ යුතු ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Anussaritabbasuttaṃ",
      "englishTitle": "Discourse on Things to be Remembered",
      "sinhalaTitle": "අනුස්‍මරණීය සූත්‍රය"
    },
    {
      "number": 198,
      "pali": "‘‘Sacchikātabbañca vo, bhikkhave, dhammaṃ desessāmi na sacchikātabbañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, na sacchikātabbo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, na sacchikātabbo dhammo. ‘‘Katamo ca, bhikkhave, sacchikātabbo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, sacchikātabbo dhammo’’ti. Dasamaṃ. ",
      "english": "Monks, I will teach you both the phenomena that are to be realized and those that are not to be realized. Listen carefully.\n\nAnd what, Monks, is the phenomenon that is not to be realized? Taking life, and so forth, up to wrong view – this, Monks, is called the phenomenon that is not to be realized.\n\nAnd what, Monks, is the phenomenon that is to be realized? Abstinence from taking life, and so forth, up to right view – this, Monks, is called the phenomenon that is to be realized.\n\nThe Tenth.",
      "sinhala": "භික්ෂූන් වහන්ස, සච්ඡිකා කළ යුතු (අත්දැකිය යුතු) ධර්මයත්, සච්ඡිකා කළ යුතු නැති (අත්දැකිය යුතු නැති) ධර්මයත් මම ඔබට දේශනා කරන්නෙමි. එය අසන්න.\n\nභික්ෂූන් වහන්ස, සච්ඡිකා කළ යුතු නැති ධර්මය කවරේද? ප්‍රාණඝාතය ආදී වශයෙන් මිථ්‍යාදෘෂ්ටිය දක්වා ඇති මේවා භික්ෂූන් වහන්ස, සච්ඡිකා කළ යුතු නැති ධර්මයෝ යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, සච්ඡිකා කළ යුතු ධර්මය කවරේද? ප්‍රාණඝාතයෙන් වැළකීම ආදී වශයෙන් සම්මාදෘෂ්ටිය දක්වා ඇති මේවා භික්ෂූන් වහන්ස, සච්ඡිකා කළ යුතු ධර්මයෝ යැයි කියනු ලැබේ.",
      "paliTitle": "Sacchikātabbasuttaṃ",
      "englishTitle": "Discourse on Direct Realization",
      "sinhalaTitle": "සාක‍්ෂාත් කළ යුතු සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Ariyamaggavaggo catuttho.",
    "english": "Chapter Four: The Noble Path",
    "sinhala": "සිව්වැනි ආර්‍ය මාර්‍ග වග්ගය"
  }
}