{
  "id": "an10.8",
  "title": {
    "pali": "Ākaṅkhavaggo",
    "english": "The Section on Aspirations",
    "sinhala": "අභිලාෂ වග්ගය"
  },
  "sections": [
    {
      "number": 71,
      "pali": "[a. ni. 4.12; itivu. 111] Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Sampannasīlā, bhikkhave, viharatha sampannapātimokkhā, pātimokkhasaṃvarasaṃvutā viharatha ācāragocarasampannā aṇumattesu vajjesu bhayadassāvino, samādāya sikkhatha sikkhāpadesu. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘sabrahmacārīnaṃ piyo cassaṃ manāpo ca garu ca bhāvanīyo cā’ti, sīlesvevassa paripūrakārī ajjhattaṃ cetosamathamanuyutto anirākatajjhāno vipassanāya samannāgato brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘lābhī assaṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’nti, sīlesvevassa paripūrakārī ajjhattaṃ cetosamathamanuyutto anirākatajjhāno vipassanāya samannāgato brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘yesāhaṃ paribhuñjāmi cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ tesaṃ te kārā mahapphalā assu mahānisaṃsā’ti, sīlesvevassa…pe… brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘ye me [ye maṃ (ma. ni. 1.65)] petā ñātī sālohitā kālaṅkatā [kālakatā (sī. syā. kaṃ. pī.)] pasannacittā anussaranti tesaṃ taṃ mahapphalaṃ assa mahānisaṃsa’nti, sīlesvevassa…pe… brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘santuṭṭho assaṃ itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārenā’ti, sīlesvevassa…pe… brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘khamo assaṃ sītassa uṇhassa jighacchāya pipāsāya ḍaṃsamakasavātātapasarīsapasamphassānaṃ, duruttānaṃ durāgatānaṃ vacanapathānaṃ uppannānaṃ sārīrikānaṃ vedanānaṃ dukkhānaṃ tibbānaṃ [tippānaṃ (sī. syā. kaṃ. pī.)] kharānaṃ kaṭukānaṃ asātānaṃ amanāpānaṃ pāṇaharānaṃ adhivāsakajātiko assa’nti, sīlesvevassa…pe… brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘aratiratisaho assaṃ, na ca maṃ aratirati saheyya, uppannaṃ aratiratiṃ abhibhuyya abhibhuyya vihareyya’nti, sīlesvevassa…pe… brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘bhayabheravasaho assaṃ, na ca maṃ bhayabheravo saheyya, uppannaṃ bhayabheravaṃ abhibhuyya abhibhuyya vihareyya’nti, sīlesvevassa…pe… brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī assaṃ akicchalābhī akasiralābhī’ti, sīlesvevassa…pe… brūhetā suññāgārānaṃ. ‘‘Ākaṅkheyya ce, bhikkhave, bhikkhu ‘āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya’nti, sīlesvevassa paripūrakārī ajjhattaṃ cetosamathamanuyutto anirākatajjhāno vipassanāya samannāgato brūhetā suññāgārānaṃ. ‘‘‘Sampannasīlā, bhikkhave, viharatha sampannapātimokkhā, pātimokkhasaṃvarasaṃvutā viharatha ācāragocarasampannā aṇumattesu vajjesu bhayadassāvino, samādāya sikkhatha sikkhāpadesū’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Paṭhamaṃ.",
      "english": "At one time the Blessed One was dwelling in Sāvatthī, at Jeta's Grove, in Anāthapiṇḍika's Park. There, the Blessed One addressed the bhikkhus, saying: \"Bhikkhus.\" \"Venerable sir,\" the bhikkhus replied to the Blessed One. The Blessed One said this: \"Bhikkhus, dwell perfected in virtue, perfected in the Pātimokkha. Dwell restrained by the restraint of the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, undertaking and training in the training rules.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May I be dear to my fellow monastics, pleasing, respected, and esteemed by them,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May I be a recipient of robes, alms food, lodging, and medicinal requisites for the sick,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May those offerings of robes, alms food, lodging, and medicinal requisites for the sick that I use bring great fruit and great benefit to those who provide them,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May my departed relatives and kinsfolk who remember me with clear hearts gain great fruit and great benefit from this,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May I be content with any kind of robes, alms food, lodging, and medicinal requisites for the sick,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May I be one who is patient with cold, heat, hunger, thirst, the touch of gnats and mosquitoes, wind and sun, and crawling creatures; with ill-spoken, ill-addressed words; and may I be one who endures arisen bodily feelings that are painful, sharp, severe, harsh, bitter, disagreeable, unwelcome, and life-threatening,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May I be one who overcomes discontent and contentment; may discontent and contentment not overcome me; may I dwell having overcome and kept overcoming arisen discontent and contentment,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May I be one who overcomes fear and dread; may fear and dread not overcome me; may I dwell having overcome and kept overcoming arisen fear and dread,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May I be one who obtains at will, without difficulty or trouble, the four jhānas — the mental attainments bringing a pleasant abiding in this very life,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"Bhikkhus, if a bhikkhu should wish: 'May I, by the destruction of the taints, here and now, realize for myself with direct knowledge the taint-free liberation of mind and liberation by wisdom, and having entered upon it, dwell therein,' he should be a fulfiller of the precepts, devoted to internal mental tranquility, not neglecting absorption, endowed with insight, and a cultivator of seclusion.\"\n\n\"'Bhikkhus, dwell perfected in virtue, perfected in the Pātimokkha. Dwell restrained by the restraint of the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, undertaking and training in the training rules' – this is what was said with reference to this.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර, ජේතවන නම් වූ අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩසිටින සේක.\n\nඑසමයෙහි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: ‘‘මහණෙනි.’’ ‘‘වහන්සැ’’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n‘‘මහණෙනි, සීලසම්පන්නව, ප්‍රාතිමෝක්ෂයෙන් යුක්තව වාසය කරව්. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූවහු, ආචාර ගෝචර සම්පන්න වූවහු, අණු මාත්‍ර වූ වරදෙහි ද භය දක්නට ලැබෙන්නාහු, ශික්ෂා පදයන් සමාදන්ව හික්මෙව්.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘මම සබ්‍රහ්මචාරීන් හට ප්‍රිය ද වෙම්වා, මන වඩන්නෙක් ද වෙම්වා, ගරු කටයුත්තෙක් ද වෙම්වා, භාවනීය වූවෙක් ද වෙම්වා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ලබන්නෙක් වෙම්වා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘මා විසින් පරිභෝජනය කරනු ලබන යම් සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ඇත් ද, එම පිරිකර දායකයන්ට මහාඵල, මහානිසංස වේවා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘මා කෙරෙහි පැහැදුණු සිත් ඇතිව සිහිපත් කරන යම් මළගිය ඥාති ලේ නෑයෝ ඇත් ද, ඔවුනට එය මහාඵල, මහානිසංස වේවා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘යම් තත්ත්වයේ සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර ඇත් ද, එයිනුදු සතුටු වන්නෙක් වෙම්වා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘සීතල, උෂ්ණය, බඩගින්න, පිපාසාව, ඩැහැමි මැසි වාතප අව් තිරශ්චීන සත්ත්ව ස්පර්ශයන්ට ද, දොස් පවරා නපුරු ලෙස කථා කරන ලද වචනවලට ද, ශරීරයෙහි උපදින තද වූ, දැඩි වූ, කටුක වූ, අප්‍රිය වූ, අමනාප වූ, ප්‍රාණය නසන සුළු වූ දුක් සහිත වේදනාවන්ට ද ඉවසන්නෙක් වෙම්වා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘අරති රතිය ඉවසන්නෙක් වෙම්වා, අරති රතිය මා නොඉවසාවා, උපන් අරති රතිය මැඩ මැඩ වාසය කරම්වා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘භය භේරවයන් ඉවසන්නෙක් වෙම්වා, භය භේරවයෝ මා නොඉවසාවා, උපන් භය භේරවයන් මැඩ මැඩ වාසය කරම්වා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘අභිචෛතසික වූ, මේ ආත්මභාවයෙහි සැප විහරණයක් වූ සිව් ධ්‍යාන කැමති සේ, අපහසුවෙන් තොරව, වෙහෙසකින් තොරව ලබන්නෙක් වෙම්වා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘මහණෙනි, යම් හෙයකින් භික්ෂුවක් ‘ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය ද ප්‍රඥා විමුක්තිය ද මේ ආත්මභාවයෙහි ම තමා විසින් ම අවබෝධයෙන් ප්‍රත්‍යක්ෂ කොට ලබා වාසය කරම්වා’ යි පතන්නේ නම්, හෙතෙම සීලයෙහි ම පරිපූර්ණව කටයුතු කරන්නෙක් විය යුතු ය; ඇතුළත සිතේ සමථයෙහි යෙදුණේ ද විය යුතු ය; ධ්‍යාන අත්නොහළේ ද විය යුතු ය; විදර්ශනාවෙන් යුක්ත වූයේ ද විය යුතු ය; ශූන්‍යාගාර වඩන්නෙක් ද විය යුතු ය.\n\n‘‘‘මහණෙනි, සීලසම්පන්නව, ප්‍රාතිමෝක්ෂයෙන් යුක්තව වාසය කරව්. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූවහු, ආචාර ගෝචර සම්පන්න වූවහු, අණු මාත්‍ර වූ වරදෙහි ද භය දක්නට ලැබෙන්නාහු, ශික්ෂා පදයන් සමාදන්ව හික්මෙව්’ යැයි යම් ඒ වචනයක් මා විසින් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දක් වෙයි.’’\n\nපළමුවෙනි සූත්‍රයයි.",
      "paliTitle": "Ākaṅkhasuttaṃ",
      "englishTitle": "The Discourse on Aspiration",
      "sinhalaTitle": "ආකංඛා සූත්‍රය"
    },
    {
      "number": 72,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ sambahulehi abhiññātehi abhiññātehi therehi sāvakehi saddhiṃ – āyasmatā ca cālena [pālena (syā.)], āyasmatā ca upacālena [uppālena (syā.)], āyasmatā ca kukkuṭena [kakkaṭena (sī. syā.)], āyasmatā ca kaḷimbhena [kavimbhena (sī.)], āyasmatā ca nikaṭena [kaṭena (sī.)], āyasmatā ca kaṭissahena; aññehi ca abhiññātehi abhiññātehi therehi sāvakehi saddhiṃ. Tena kho pana samayena sambahulā abhiññātā abhiññātā licchavī bhadrehi bhadrehi yānehi parapurāya [paraṃpurāya (syā. aṭṭha.)] uccāsaddā mahāsaddā mahāvanaṃ ajjhogāhanti bhagavantaṃ dassanāya. Atha kho tesaṃ āyasmantānaṃ etadahosi – ‘‘ime kho sambahulā abhiññātā abhiññātā licchavī bhadrehi bhadrehi yānehi parapurāya uccāsaddā mahāsaddā mahāvanaṃ ajjhogāhanti bhagavantaṃ dassanāya. ‘Saddakaṇṭakā kho pana jhānā’ vuttā bhagavatā. Yaṃnūna mayaṃ yena gosiṅgasālavanadāyo tenupasaṅkameyyāma. Tattha mayaṃ appasaddā appākiṇṇā phāsuṃ [phāsu (syā. ka.)] vihareyyāmā’’ti. Atha kho te āyasmanto yena gosiṅgasālavanadāyo tenupasaṅkamiṃsu; tattha te āyasmanto appasaddā appākiṇṇā phāsuṃ viharanti. Atha kho bhagavā bhikkhū āmantesi – ‘‘kahaṃ nu kho, bhikkhave, cālo, kahaṃ upacālo, kahaṃ kukkuṭo, kahaṃ kaḷimbho, kahaṃ nikaṭo, kahaṃ kaṭissaho; kahaṃ nu kho te, bhikkhave, therā sāvakā gatā’’ti? ‘‘Idha, bhante, tesaṃ āyasmantānaṃ etadahosi – ‘ime kho sambahulā abhiññātā abhiññātā licchavī bhadrehi bhadrehi yānehi parapurāya uccāsaddā mahāsaddā mahāvanaṃ ajjhogāhanti bhagavantaṃ dassanāya ‘saddakaṇṭakā kho pana jhānāvuttā bhagavatā yaṃnūna mayaṃ yena gosiṅgasālavanadāyo tenupasaṅkameyyāma tattha mayaṃ appasaddā appākiṇṇā phāsuṃ vihareyyāmā’ti. Atha kho te, bhante, āyasmanto yena gosiṅgasālavanadāyo tenupasaṅkamiṃsu. Tattha te āyasmanto appasaddā appākiṇṇā phāsuṃ viharantī’’ti. ‘‘Sādhu sādhu, bhikkhave, yathā te mahāsāvakā sammā byākaramānā byākareyyuṃ, ‘saddakaṇṭakā hi, bhikkhave, jhānā’ vuttā mayā. ‘‘Dasayime, bhikkhave, kaṇṭakā. Katame dasa? Pavivekārāmassa saṅgaṇikārāmatā kaṇṭako, asubhanimittānuyogaṃ anuyuttassa subhanimittānuyogo kaṇṭako, indriyesu guttadvārassa visūkadassanaṃ kaṇṭako, brahmacariyassa mātugāmūpacāro [mātugāmopavicāro (sī.), mātugāmūpavicaro (ka.)] kaṇṭako, [kathā. 333] paṭhamassa jhānassa saddo kaṇṭako, dutiyassa jhānassa vitakkavicārā kaṇṭakā, tatiyassa jhānassa pīti kaṇṭako, catutthassa jhānassa assāsapassāso kaṇṭako, saññāvedayitanirodhasamāpattiyā saññā ca vedanā ca kaṇṭako rāgo kaṇṭako doso kaṇṭako moho kaṇṭako. ‘‘Akaṇṭakā, bhikkhave, viharatha. Nikkaṇṭakā, bhikkhave, viharatha. Akaṇṭakanikkaṇṭakā, bhikkhave, viharatha. Akaṇṭakā, bhikkhave, arahanto; nikkaṇṭakā, bhikkhave, arahanto; akaṇṭakanikkaṇṭakā, bhikkhave, arahanto’’ti. Dutiyaṃ.",
      "english": "At one time the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall, together with many well-known senior disciples—namely, with the Venerable Cāla, the Venerable Upacāla, the Venerable Kukkuṭa, the Venerable Kaḷimbha, the Venerable Nikaṭa, and the Venerable Kaṭissaha; and with other well-known senior disciples.\n\nNow at that time, many well-known Licchavī princes, in fine vehicles, one after another, making loud noises and great commotion, were entering the Great Wood to see the Blessed One. Then it occurred to those venerable ones: ‘Indeed, these many well-known Licchavī princes, in fine vehicles, one after another, making loud noises and great commotion, are entering the Great Wood to see the Blessed One. The Blessed One has declared that “noise is indeed an impediment to meditative absorption.” What if we were to go to the Gosiṅga Sāla-tree Forest? There we could dwell quietly and secluded, at ease.’ So those venerable ones went to the Gosiṅga Sāla-tree Forest; there those venerable ones dwelled quietly and secluded, at ease.\n\nThen the Blessed One addressed the monks: ‘Where, monks, are Cāla, Upacāla, Kukkuṭa, Kaḷimbha, Nikaṭa, and Kaṭissaha? Where, monks, have those senior disciples gone?’\n\n‘Here, Venerable Sir, it occurred to those venerable ones: “Indeed, these many well-known Licchavī princes, in fine vehicles, one after another, making loud noises and great commotion, are entering the Great Wood to see the Blessed One. The Blessed One has declared that ‘noise is indeed an impediment to meditative absorption.’ What if we were to go to the Gosiṅga Sāla-tree Forest? There we could dwell quietly and secluded, at ease.” Then, Venerable Sir, those venerable ones went to the Gosiṅga Sāla-tree Forest. There those venerable ones are dwelling quietly and secluded, at ease.’\n\n‘Good, good, monks! What those great disciples have stated, they have stated correctly. Indeed, monks, I have declared that “noise is an impediment to meditative absorption.”\n\n‘There are these ten impediments, monks. Which ten? For one who delights in seclusion, delight in company is an impediment. For one committed to the practice of the sign of impurity, the sign of beauty is an impediment. For one with guarded sense doors, seeing distracting sights is an impediment. For the holy life, proximity to women is an impediment. For the first meditative absorption, noise is an impediment. For the second meditative absorption, applied thought and sustained thought are impediments. For the third meditative absorption, rapture is an impediment. For the fourth meditative absorption, in-breathing and out-breathing are impediments. For the attainment of the cessation of perception and feeling, perception and feeling are impediments. Greed is an impediment. Hatred is an impediment. Delusion is an impediment.\n\n‘Dwell without impediments, monks. Dwell free from impediments, monks. Dwell without and free from impediments, monks. The Arahants are without impediments, monks; the Arahants are free from impediments, monks; the Arahants are without and free from impediments.’",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ වෙසාලියෙහි, මහවනයෙහි වූ කූටාගාර ශාලාවෙහි, බොහෝ වූ ප්‍රසිද්ධ ප්‍රසිද්ධ ථේර ශ්‍රාවකයන් වහන්සේලා සමඟ වැඩවසන සේක. එනම්, ආයුෂ්මත් චාල ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් උපචාල ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් කුක්කුට ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් කලිම්භ ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් නිකට ස්ථවිරයන් වහන්සේ, ආයුෂ්මත් කටිස්සහ ස්ථවිරයන් වහන්සේ යන මේ ස්ථවිරයන් වහන්සේලා සහ තවද, අන්‍ය වූ ප්‍රසිද්ධ ප්‍රසිද්ධ ථේර ශ්‍රාවකයන් වහන්සේලා සමඟ වැඩවසන සේක.\n\nඑකල්හි බොහෝ වූ ප්‍රසිද්ධ ප්‍රසිද්ධ ලිච්ඡවී කුමාරවරු අලංකාර වූ යානාවලින් පේළියට, මහත් හඬින්, මහත් ඝෝෂාවෙන් යුක්තව භාග්‍යවතුන් වහන්සේ දැකීම සඳහා මහවනයට පිවිසෙමින් සිටියහ. එකල්හි ඒ ආයුෂ්මත් ස්ථවිරයන් වහන්සේලාට මෙබඳු අදහසක් ඇතිවිය: \"මේ බොහෝ වූ ප්‍රසිද්ධ ප්‍රසිද්ධ ලිච්ඡවී කුමාරවරු අලංකාර වූ යානාවලින් පේළියට, මහත් හඬින්, මහත් ඝෝෂාවෙන් යුක්තව භාග්‍යවතුන් වහන්සේ දැකීම සඳහා මහවනයට පිවිසෙමින් සිටිති. 'නාදය යනු ධ්‍යානයට කටුවකි' යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලදී. එසේ නම් අපි ගෝසිංගසාලවනදාය නම් ස්ථානයට යමු. එහි අපි අඩු ශබ්දයකින්, (මිනිසුන්) අඩු තැනක, සැපසේ වාසය කරමු.\" එකල්හි ඒ ආයුෂ්මත් ස්ථවිරයන් වහන්සේලා ගෝසිංගසාලවනදාය නම් ස්ථානයට වැඩිසේක. එහි ඒ ආයුෂ්මත් ස්ථවිරයන් වහන්සේලා අඩු ශබ්දයකින්, (මිනිසුන්) අඩු තැනක, සැපසේ වාසය කරති.\n\nඑකල්හි භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළසේක: \"මහණෙනි, චාල කොහිද? උපචාල කොහිද? කුක්කුට කොහිද? කලිම්භ කොහිද? නිකට කොහිද? කටිස්සහ කොහිද? මහණෙනි, ඒ ථේර ශ්‍රාවකයෝ කොහි ගියෝද?\"\n\"ස්වාමීනි, මෙහිදී ඒ ආයුෂ්මත් ස්ථවිරයන් වහන්සේලාට මෙබඳු අදහසක් ඇතිවිය: 'මේ බොහෝ වූ ප්‍රසිද්ධ ප්‍රසිද්ධ ලිච්ඡවී කුමාරවරු අලංකාර වූ යානාවලින් පේළියට, මහත් හඬින්, මහත් ඝෝෂාවෙන් යුක්තව භාග්‍යවතුන් වහන්සේ දැකීම සඳහා මහවනයට පිවිසෙමින් සිටිති. 'නාදය යනු ධ්‍යානයට කටුවකි' යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලදී. එසේ නම් අපි ගෝසිංගසාලවනදාය නම් ස්ථානයට යමු. එහි අපි අඩු ශබ්දයකින්, (මිනිසුන්) අඩු තැනක, සැපසේ වාසය කරමු.' ස්වාමීනි, එකල්හි ඒ ආයුෂ්මත් ස්ථවිරයන් වහන්සේලා ගෝසිංගසාලවනදාය නම් ස්ථානයට වැඩිසේක. එහි ඒ ආයුෂ්මත් ස්ථවිරයන් වහන්සේලා අඩු ශබ්දයකින්, (මිනිසුන්) අඩු තැනක, සැපසේ වාසය කරති.\"\n\n\"සාධු සාධු, මහණෙනි! ඒ මහා ශ්‍රාවකයෝ මැනවින් විස්තර කරන්නාක් මෙන් විස්තර කරති. මහණෙනි, 'නාදය යනු ධ්‍යානයට කටුවකි' යැයි මා විසින්ම වදාරණ ලදී.\nමහණෙනි, මේ කටු දසයක් වෙති. ඒ කවර දසයක්ද? විවේකයට ප්‍රිය කරන යෝගාවචරයාට පිරිසට ප්‍රිය කිරීම කටුවකි. අසුභ නිමිත්ත අනුයෝග කරන යෝගාවචරයාට ශුභ නිමිත්ත අනුයෝග කිරීම කටුවකි. ඉන්ද්‍රියයන්හි සංවර වූ දොරටු ඇති යෝගාවචරයාට විවිධ විහිළු, විකාර දැකීම කටුවකි. බ්‍රහ්මචාරී යෝගාවචරයාට මාතුගාමයන් ඇසුරු කිරීම කටුවකි. ප්‍රථම ධ්‍යානයට ශබ්දය කටුවකි. ද්විතීය ධ්‍යානයට විතර්ක විචාරයෝ කටු වෙති. තෘතීය ධ්‍යානයට ප්‍රීතිය කටුවකි. චතුර්ථ ධ්‍යානයට ආශ්වාස ප්‍රශ්වාසය කටුවකි. සංඥා වේදයිත නිරෝධ සමාපත්තියට සංඥාව සහ වේදනාව කටුවකි. රාගය කටුවකි. ද්වේෂය කටුවකි. මෝහය කටුවකි.\"\n\n\"මහණෙනි, කටු රහිතව වාසය කරව්. මහණෙනි, (කටුවලින්) මුළුමනින්ම තොරව වාසය කරව්. මහණෙනි, කටු රහිත හා (කටුවලින්) මුළුමනින්ම තොරව වාසය කරව්. මහණෙනි, රහතන් වහන්සේලා කටු රහිතයෝ වෙති. මහණෙනි, රහතන් වහන්සේලා (කටුවලින්) මුළුමනින්ම තොරයෝ වෙති. මහණෙනි, රහතන් වහන්සේලා කටු රහිත හා (කටුවලින්) මුළුමනින්ම තොරයෝ වෙති.\"",
      "paliTitle": "Kaṇṭakasuttaṃ",
      "englishTitle": "The Thorn Discourse",
      "sinhalaTitle": "කණ්ටක සූත්‍රය"
    },
    {
      "number": 73,
      "pali": "‘‘Dasayime, bhikkhave, dhammā iṭṭhā kantā manāpā dullabhā lokasmiṃ. Katame dasa? Bhogā iṭṭhā kantā manāpā dullabhā lokasmiṃ; vaṇṇo iṭṭho kanto manāpo dullabho lokasmiṃ; ārogyaṃ iṭṭhaṃ kantaṃ manāpaṃ dullabhaṃ lokasmiṃ; sīlaṃ iṭṭhaṃ kantaṃ manāpaṃ dullabhaṃ lokasmiṃ; brahmacariyaṃ iṭṭhaṃ kantaṃ manāpaṃ dullabhaṃ lokasmiṃ; mittā iṭṭhā kantā manāpā dullabhā lokasmiṃ; bāhusaccaṃ iṭṭhaṃ kantaṃ manāpaṃ dullabhaṃ lokasmiṃ; paññā iṭṭhā kantā manāpā dullabhā lokasmiṃ; dhammā iṭṭhā kantā manāpā dullabhā lokasmiṃ; saggā iṭṭhā kantā manāpā dullabhā lokasmiṃ. ‘‘Imesaṃ kho, bhikkhave, dasannaṃ dhammānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ dullabhānaṃ lokasmiṃ dasa dhammā paripanthā [paribandhā (ka.)] – ālasyaṃ anuṭṭhānaṃ bhogānaṃ paripantho, amaṇḍanā avibhūsanā vaṇṇassa paripantho, asappāyakiriyā ārogyassa paripantho, pāpamittatā sīlānaṃ paripantho, indriyaasaṃvaro brahmacariyassa paripantho, visaṃvādanā mittānaṃ paripantho, asajjhāyakiriyā bāhusaccassa paripantho, asussūsā aparipucchā paññāya paripantho, ananuyogo apaccavekkhaṇā dhammānaṃ paripantho, micchāpaṭipatti saggānaṃ paripantho. Imesaṃ kho, bhikkhave, dasannaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ dullabhānaṃ lokasmiṃ ime dasa dhammā paripanthā. ‘‘Imesaṃ kho, bhikkhave, dasannaṃ dhammānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ dullabhānaṃ lokasmiṃ dasa dhammā āhārā – uṭṭhānaṃ anālasyaṃ bhogānaṃ āhāro, maṇḍanā vibhūsanā vaṇṇassa āhāro, sappāyakiriyā ārogyassa āhāro, kalyāṇamittatā sīlānaṃ āhāro, indriyasaṃvaro brahmacariyassa āhāro, avisaṃvādanā mittānaṃ āhāro, sajjhāyakiriyā bāhusaccassa āhāro, sussūsā paripucchā paññāya āhāro, anuyogo paccavekkhaṇā dhammānaṃ āhāro, sammāpaṭipatti saggānaṃ āhāro. Imesaṃ kho, bhikkhave, dasannaṃ dhammānaṃ iṭṭhānaṃ kantānaṃ manāpānaṃ dullabhānaṃ lokasmiṃ ime dasa dhammā āhārā’’ti. Tatiyaṃ.",
      "english": "Monks, these ten things are desirable, pleasing, agreeable, and hard to obtain in the world. Which ten? Possessions are desirable, pleasing, agreeable, and hard to obtain in the world; beauty is desirable, pleasing, agreeable, and hard to obtain in the world; health is desirable, pleasing, agreeable, and hard to obtain in the world; morality is desirable, pleasing, agreeable, and hard to obtain in the world; the holy life is desirable, pleasing, agreeable, and hard to obtain in the world; friends are desirable, pleasing, agreeable, and hard to obtain in the world; extensive learning is desirable, pleasing, agreeable, and hard to obtain in the world; wisdom is desirable, pleasing, agreeable, and hard to obtain in the world; the Dhamma is desirable, pleasing, agreeable, and hard to obtain in the world; heavenly realms are desirable, pleasing, agreeable, and hard to obtain in the world.\n\nMonks, for these ten things that are desirable, pleasing, agreeable, and hard to obtain in the world, there are ten obstacles. Laziness and inactivity are obstacles to possessions; not adorning oneself and not beautifying oneself are obstacles to beauty; engaging in unwholesome practices is an obstacle to health; bad companionship is an obstacle to morality; lack of sense restraint is an obstacle to the holy life; deception is an obstacle to friends; not reviewing one's studies is an obstacle to extensive learning; not listening attentively and not asking questions are obstacles to wisdom; not applying oneself and not reflecting are obstacles to the Dhamma; wrong practice is an obstacle to heavenly realms. Monks, for these ten things that are desirable, pleasing, agreeable, and hard to obtain in the world, these ten things are obstacles.\n\nMonks, for these ten things that are desirable, pleasing, agreeable, and hard to obtain in the world, there are ten sustaining conditions. Diligence and industriousness are sustaining conditions for possessions; adorning oneself and beautifying oneself are sustaining conditions for beauty; engaging in wholesome practices is a sustaining condition for health; good companionship is a sustaining condition for morality; sense restraint is a sustaining condition for the holy life; trustworthiness is a sustaining condition for friends; reviewing one's studies is a sustaining condition for extensive learning; listening attentively and asking questions are sustaining conditions for wisdom; applying oneself and reflecting are sustaining conditions for the Dhamma; right practice is a sustaining condition for heavenly realms. Monks, for these ten things that are desirable, pleasing, agreeable, and hard to obtain in the world, these ten things are sustaining conditions.",
      "sinhala": "මහණෙනි, ලෝකයෙහි ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වූ මේ දස ධ​ර්මයෝ වෙති. කවර දසයක්ද? ලෝකයෙහි භෝගයෝ ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙති. වර්ණය ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙයි. නිරෝගීභාවය ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙයි. සීලය ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙයි. බ්‍රහ්මච​ර්යාව ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙයි. මිත්‍රයෝ ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙති. බාහුසත්‍යය (පිරිපුන් ධ​ර්ම ඥානය) ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙයි. ප්‍රඥාව ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙයි. ධ​ර්මය (ධ​ර්මාවබෝධය) ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙයි. ස්ව​ර්ගයෝ ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වෙති.\n\nමහණෙනි, ලෝකයෙහි ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වූ මේ දස ධ​ර්මයන්ට බාධා පමුණුවන දස ධ​ර්මයෝ වෙති. එනම්: අලස බව හා උත්සාහ නොකිරීම භෝගයන්ට බාධාවකි. ශරීරය නොසැරසීම හා අලංකාර නොකිරීම වර්ණයට බාධාවකි. අසප්පාය දේ කිරීම නිරෝගීභාවයට බාධාවකි. පාපමිත්‍ර සේවනය සීලයන්ට බාධාවකි. ඉන්ද්‍රිය අසංවරය බ්‍රහ්මච​ර්යාවට බාධාවකි. (මිත්‍රයන්ට) වංචා කිරීම මිත්‍රයන්ට බාධාවකි. (ධ​ර්මය) නොසජ්ඣායනා කිරීම බාහුසත්‍යයට බාධාවකි. (ධ​ර්මය) නොඇසීම හා විමසා නොඇසීම ප්‍රඥාවට බාධාවකි. (ධ​ර්මය) නොඅනුයෝගය හා නොපච්චවේක්ඛණාව ධ​ර්මාවබෝධයට බාධාවකි. මිත්‍යා ප්‍රතිපත්තිය ස්ව​ර්ගයන්ට බාධාවකි. මහණෙනි, ලෝකයෙහි ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වූ මේ දස ධ​ර්මයන්ට මේ දස ධ​ර්මයෝම බාධා පමුණුවන කරුණු වෙති.\n\nමහණෙනි, ලෝකයෙහි ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වූ මේ දස ධ​ර්මයන්ට හේතු වන (ලබා දෙන) දස ධ​ර්මයෝ වෙති. එනම්: උත්සාහය හා අලස නොවීම භෝගයන්ට හේතුවකි. ශරීරය සැරසීම හා අලංකාර කිරීම වර්ණයට හේතුවකි. සප්පාය දේ කිරීම නිරෝගීභාවයට හේතුවකි. කල්‍යාණමිත්‍ර සේවනය සීලයන්ට හේතුවකි. ඉන්ද්‍රිය සංවරය බ්‍රහ්මච​ර්යාවට හේතුවකි. (මිත්‍රයන්ට) බොරු නොකීම (හෝ වංචා නොකිරීම) මිත්‍රයන්ට හේතුවකි. (ධ​ර්මය) සජ්ඣායනා කිරීම බාහුසත්‍යයට හේතුවකි. (ධ​ර්මය) ඇසීම හා විමසා ඇසීම ප්‍රඥාවට හේතුවකි. (ධ​ර්මය) අනුයෝගය හා පච්චවේක්ඛණාව ධ​ර්මාවබෝධයට හේතුවකි. සම්මා ප්‍රතිපත්තිය ස්ව​ර්ගයන්ට හේතුවකි. මහණෙනි, ලෝකයෙහි ඉෂ්ට වූ, කමනීය වූ, මනංකල්ප වූ, දුර්ලභ වූ මේ දස ධ​ර්මයන්ට මේ දස ධ​ර්මයෝම හේතු වන කරුණු වෙති.",
      "paliTitle": "Iṭṭhadhammasuttaṃ",
      "englishTitle": "Discourse on Desirable Things",
      "sinhalaTitle": "ඉෂ්ටධර්ම සූත්‍රය"
    },
    {
      "number": 74,
      "pali": "‘‘Dasahi, bhikkhave, vaḍḍhīhi vaḍḍhamāno ariyasāvako ariyāya vaḍḍhiyā vaḍḍhati, sārādāyī ca hoti varādāyī kāyassa. Katamehi dasahi? Khettavatthūhi vaḍḍhati, dhanadhaññena vaḍḍhati, puttadārehi vaḍḍhati, dāsakammakaraporisehi vaḍḍhati, catuppadehi vaḍḍhati, saddhāya vaḍḍhati, sīlena vaḍḍhati, sutena vaḍḍhati, cāgena vaḍḍhati, paññāya vaḍḍhati – imehi kho, bhikkhave, dasahi vaḍḍhīhi vaḍḍhamāno ariyasāvako ariyāya vaḍḍhiyā vaḍḍhati, sārādāyī ca hoti varādāyī kāyassāti. ‘‘Dhanena dhaññena ca yodha vaḍḍhati, Puttehi dārehi catuppadehi ca; Sa bhogavā hoti yasassi pūjito, Ñātīhi mittehi athopi rājubhi. ‘‘Saddhāya sīlena ca yodha vaḍḍhati, Paññāya cāgena sutena cūbhayaṃ; So tādiso sappuriso vicakkhaṇo, Diṭṭheva dhamme ubhayena vaḍḍhatī’’ti. catutthaṃ;",
      "english": "Monks, a noble disciple, by growing with ten kinds of growth, grows with noble growth and becomes one who takes the essence and takes the best from this existence. Which ten? He grows in fields and land, he grows in wealth and grain, he grows in children and spouse, he grows in servants, workers, and attendants, he grows in livestock; he grows in faith, he grows in virtue, he grows in learning, he grows in generosity, he grows in wisdom – Monks, a noble disciple, by growing with these ten kinds of growth, grows with noble growth and becomes one who takes the essence and takes the best from this existence.\n\nOne who here grows in wealth and grain,\nIn children, spouse, and also in livestock;\nSuch a one becomes wealthy, renowned, and honored,\nBy relatives, by friends, and even by kings.\n\nOne who here grows in faith and also in virtue,\nIn wisdom, generosity, and learning both;\nSuch a good person, discerning and wise,\nIn this very life, truly grows in both ways.",
      "sinhala": "භික්ෂූනි, මේ දසවැදෑරුම් වෘද්ධීන්ගෙන් වර්ධනය වන්නා වූ ආර්ය ශ්‍රාවකයා ආර්ය වෘද්ධියෙන් වර්ධනය වෙයි. ඔහු (මේ ශරීරය ලැබීමේ) සාරය ගත්තෙක් ද, උතුම් සාරය ගත්තෙක් ද වෙයි. ඒ දසවැදෑරුම් වෘද්ධීහු කවරහු ද? කෙත්බිම්, ගෙවතු වලින් වර්ධනය වෙයි. ධන ධාන්‍යයෙන් වර්ධනය වෙයි. දූ දරුවන්ගෙන්, භාර්යාවගෙන් වර්ධනය වෙයි. දාසයන්, කම්කරුවන්, සේවකයන්ගෙන් වර්ධනය වෙයි. සිව්පාවන්ගෙන් වර්ධනය වෙයි. ශ්‍රද්ධාවෙන් වර්ධනය වෙයි. සීලයෙන් වර්ධනය වෙයි. ශ්‍රැතයෙන් වර්ධනය වෙයි. ත්‍යාගයෙන් වර්ධනය වෙයි. ප්‍රඥාවෙන් වර්ධනය වෙයි – භික්ෂූනි, මේ දසවැදෑරුම් වෘද්ධීන්ගෙන් වර්ධනය වන්නා වූ ආර්ය ශ්‍රාවකයා ආර්ය වෘද්ධියෙන් වර්ධනය වෙයි. ඔහු (මේ ශරීරය ලැබීමේ) සාරය ගත්තෙක් ද, උතුම් සාරය ගත්තෙක් ද වෙයි.\n\nයම් පුද්ගලයෙක් මෙලොව ධනයෙන් ද, ධාන්‍යයෙන් ද වර්ධනය වේ ද, පුත්‍රයන්ගෙන් ද, භාර්යාවන්ගෙන් ද, සිව්පාවන්ගෙන් ද (වර්ධනය වේ ද), හෙතෙම භෝග සම්පත්තියෙන් යුක්ත වෙයි, කීර්තිමත් වෙයි, පිදුම් ලැබූවෙක් ද වෙයි. ඥාතීන්ගෙන් ද, මිත්‍රයන්ගෙන් ද, එසේම රජවරුන් විසින් ද (හෙතෙම පිදුම් ලබයි).\n\nයම් පුද්ගලයෙක් මෙලොව ශ්‍රද්ධාවෙන් ද, සීලයෙන් ද වර්ධනය වේ ද, ප්‍රඥාවෙන් ද, ත්‍යාගයෙන් ද, ශ්‍රැතයෙන් ද වර්ධනය වේ ද, එබඳු වූ ඒ සත්පුරුෂ තෙමේ, විචක්ෂණ වූ හෙවත් නුවණැති තෙමේ, මේ දැක්ක ම ධර්මයෙහිම (මේ ආත්මභාවයෙහිම) ලෞකිකව හා ආධ්‍යාත්මිකව යන දෙයාකාරයෙන්ම වර්ධනය වෙයි.",
      "paliTitle": "Vaḍḍhisuttaṃ",
      "englishTitle": "The Growth Sutta",
      "sinhalaTitle": "වර්ධන සූත්‍රය"
    },
    {
      "number": 75,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho āyasmā ānando pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena migasālāya upāsikāya nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho migasālā upāsikā yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmantaṃ ānandaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho migasālā upāsikā āyasmantaṃ ānandaṃ etadavoca – ‘‘Kathaṃ kathaṃ nāmāyaṃ, bhante ānanda, bhagavatā dhammo desito aññeyyo, yatra hi nāma brahmacārī ca abrahmacārī ca ubho samasamagatikā bhavissanti abhisamparāyaṃ. Pitā me, bhante, purāṇo brahmacārī hoti ārācārī [anācārī (ka.)] virato methunā gāmadhammā. So kālaṅkato bhagavatā byākato – ‘sakadāgāmī satto [sakadāgāmisatto (sī. syā. pī.)] tusitaṃ kāyaṃ upapanno’ti. Pitāmaho me [pettāpi yo me (sī.), pita piyo me (syā.) a. ni. 6.44], bhante, isidatto abrahmacārī ahosi sadārasantuṭṭho. Sopi kālaṅkato bhagavatā byākato – ‘sakadāgāmī satto tusitaṃ kāyaṃ upapanno’ti. ‘‘Kathaṃ kathaṃ nāmāyaṃ, bhante ānanda, bhagavatā dhammo desito aññeyyo, yatra hi nāma brahmacārī ca abrahmacārī ca ubho samasamagatikā bhavissanti abhisamparāya’’nti? ‘‘Evaṃ kho panetaṃ, bhagini, bhagavatā byākata’’nti. Atha kho āyasmā ānando migasālāya upāsikāya nivesane piṇḍapātaṃ gahetvā uṭṭhāyāsanā pakkāmi. Atha kho āyasmā ānando pacchābhattaṃ piṇḍapātapaṭikkanto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Idhāhaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya yena migasālāya upāsikāya nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdiṃ. Atha kho, bhante, migasālā upāsikā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho, bhante, migasālā upāsikā maṃ etadavoca – ‘Kathaṃ kathaṃ nāmāyaṃ, bhante ānanda, bhagavatā dhammo desito aññeyyo, yatra hi nāma brahmacārī ca abrahmacārī ca ubho samasamagatikā bhavissanti abhisamparāyaṃ. Pitā me, bhante, purāṇo brahmacārī ahosi ārācārī virato methunā gāmadhammā. So kālaṅkato bhagavatā byākato sakadāgāmī satto tusitaṃ kāyaṃ upapannoti. Pitāmaho me, bhante, isidatto abrahmacārī ahosi sadārasantuṭṭho. Sopi kālaṅkato bhagavatā byākato – sakadāgāmī satto tusitaṃ kāyaṃ upapannoti. Kathaṃ kathaṃ nāmāyaṃ, bhante ānanda, bhagavatā dhammo desito aññeyyo, yatra hi nāma brahmacārī ca abrahmacārī ca ubho samasamagatikā bhavissanti abhisamparāya’nti? Evaṃ vutte ahaṃ, bhante, migasālaṃ upāsikaṃ etadavocaṃ – ‘evaṃ kho panetaṃ, bhagini, bhagavatā byākata’’’nti. ‘‘Kā cānanda, migasālā upāsikā bālā abyattā ammakā ammakapaññā [ambakā ambakapaññā (sī. pī.), andhakā andhakapaññā (syā.)], ke ca purisapuggalaparopariye ñāṇe? ‘‘Dasayime, ānanda, puggalā santo saṃvijjamānā lokasmiṃ. Katame dasa? Idhānanda, ekacco puggalo dussīlo hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti, yatthassa taṃ dussīlyaṃ aparisesaṃ nirujjhati. Tassa savanenapi akataṃ hoti, bāhusaccenapi akataṃ hoti, diṭṭhiyāpi appaṭividdhaṃ hoti, sāmāyikampi vimuttiṃ na labhati. So kāyassa bhedā paraṃ maraṇā hānāya pareti, no visesāya; hānagāmīyeva hoti, no visesagāmī. ‘‘Idha panānanda, ekacco puggalo dussīlo hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ pajānāti yatthassa taṃ dussīlyaṃ aparisesaṃ nirujjhati. Tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ [suppaṭividdhaṃ (syā.)] hoti, sāmāyikampi vimuttiṃ labhati. So kāyassa bhedā paraṃ maraṇā visesāya pareti, no hānāya; visesagāmīyeva hoti, no hānagāmī. ‘‘Tatrānanda, pamāṇikā pamiṇanti – ‘imassapi teva dhammā, aparassapi teva dhammā. Kasmā nesaṃ eko hīno eko paṇīto’ti? Tañhi tesaṃ, ānanda, hoti dīgharattaṃ ahitāya dukkhāya. ‘‘Tatrānanda, yvāyaṃ puggalo dussīlo hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ pajānāti yatthassa taṃ dussīlyaṃ aparisesaṃ nirujjhati. Tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. Ayaṃ, ānanda, puggalo amunā purimena puggalena abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imaṃ hānanda, puggalaṃ dhammasoto nibbahati. Tadantaraṃ ko jāneyya, aññatra tathāgatena! Tasmātihānanda, mā puggalesu pamāṇikā ahuvattha, mā puggalesu pamāṇaṃ gaṇhittha. Khaññati hānanda, puggalesu pamāṇaṃ gaṇhanto. Ahaṃ vā, ānanda [ahañcānanda (sī. syā. ka.) a. ni. 6.44 passitabbaṃ], puggalesu pamāṇaṃ gaṇheyyaṃ yo vā panassa mādiso. ‘‘Idha panānanda, ekacco puggalo sīlavā hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa taṃ sīlaṃ aparisesaṃ nirujjhati. Tassa savanenapi akataṃ hoti, bāhusaccenapi akataṃ hoti, diṭṭhiyāpi appaṭividdhaṃ hoti, sāmāyikampi vimuttiṃ na labhati. So kāyassa bhedā paraṃ maraṇā hānāya pareti, no visesāya; hānagāmīyeva hoti, no visesagāmī. ‘‘Idha panānanda, ekacco puggalo sīlavā hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ pajānāti yatthassa taṃ sīlaṃ aparisesaṃ nirujjhati. Tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. So kāyassa bhedā paraṃ maraṇā visesāya pareti, no hānāya; visesagāmīyeva hoti, no hānagāmī. ‘‘Tatrānanda, pamāṇikā pamiṇanti…pe… ahaṃ vā, ānanda, puggalesu pamāṇaṃ gaṇheyyaṃ yo vā panassa mādiso. ‘‘Idha panānanda, ekacco puggalo tibbarāgo hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa so rāgo apariseso nirujjhati. Tassa savanenapi akataṃ hoti, bāhusaccenapi akataṃ hoti, diṭṭhiyāpi appaṭividdhaṃ hoti, sāmāyikampi vimuttiṃ na labhati. So kāyassa bhedā paraṃ maraṇā hānāya pareti, no visesāya; hānagāmīyeva hoti, no visesagāmī. ‘‘Idha panānanda, ekacco puggalo tibbarāgo hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ pajānāti yatthassa so rāgo apariseso nirujjhati. Tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. So kāyassa bhedā paraṃ maraṇā visesāya pareti, no hānāya; visesagāmīyeva hoti, no hānagāmī. ‘‘Tatrānanda, pamāṇikā pamiṇanti…pe… ahaṃ vā, ānanda, puggalesu pamāṇaṃ gaṇheyyaṃ yo vā panassa mādiso. ‘‘Idha panānanda, ekacco puggalo kodhano hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa so kodho apariseso nirujjhati. Tassa savanenapi akataṃ hoti, bāhusaccenapi akataṃ hoti, diṭṭhiyāpi appaṭividdhaṃ hoti, sāmāyikampi vimuttiṃ na labhati. So kāyassa bhedā paraṃ maraṇā hānāya pareti, no visesāya; hānagāmīyeva hoti, no visesagāmī. ‘‘Idha panānanda, ekacco puggalo kodhano hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ pajānāti yatthassa so kodho apariseso nirujjhati. Tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. So kāyassa bhedā paraṃ maraṇā visesāya pareti, no hānāya; visesagāmīyeva hoti, no hānagāmī. ‘‘Tatrānanda, pamāṇikā pamiṇanti…pe… ahaṃ vā, ānanda, puggalesu pamāṇaṃ gaṇheyyaṃ yo vā panassa mādiso. ‘‘Idha panānanda, ekacco puggalo uddhato hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ nappajānāti yatthassa taṃ uddhaccaṃ aparisesaṃ nirujjhati. Tassa savanenapi akataṃ hoti, bāhusaccenapi akataṃ hoti, diṭṭhiyāpi appaṭividdhaṃ hoti, sāmāyikampi vimuttiṃ na labhati. So kāyassa bhedā paraṃ maraṇā hānāya pareti, no visesāya; hānagāmīyeva hoti, no visesagāmī. ‘‘Idha panānanda, ekacco puggalo uddhato hoti. Tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ pajānāti yatthassa taṃ uddhaccaṃ aparisesaṃ nirujjhati. Tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. So kāyassa bhedā paraṃ maraṇā visesāya pareti, no hānāya; visesagāmīyeva hoti, no hānagāmī. ‘‘Tatrānanda, pamāṇikā pamiṇanti – ‘imassapi teva dhammā, aparassapi teva dhammā. Kasmā nesaṃ eko hīno eko paṇīto’ti? Tañhi tesaṃ, ānanda, hoti dīgharattaṃ ahitāya dukkhāya. ‘‘Tatrānanda, yvāyaṃ puggalo uddhato hoti tañca cetovimuttiṃ paññāvimuttiṃ yathābhūtaṃ pajānāti yatthassa taṃ uddhaccaṃ aparisesaṃ nirujjhati, tassa savanenapi kataṃ hoti, bāhusaccenapi kataṃ hoti, diṭṭhiyāpi paṭividdhaṃ hoti, sāmāyikampi vimuttiṃ labhati. Ayaṃ, ānanda, puggalo amunā purimena puggalena abhikkantataro ca paṇītataro ca. Taṃ kissa hetu? Imaṃ hānanda, puggalaṃ dhammasoto nibbahati. Tadantaraṃ ko jāneyya aññatra tathāgatena! Tasmātihānanda, mā puggalesu pamāṇikā ahuvattha; mā puggalesu pamāṇaṃ gaṇhittha. Khaññati hānanda, puggalesu pamāṇaṃ gaṇhanto. Ahaṃ vā, ānanda, puggalesu pamāṇaṃ gaṇheyyaṃ yo vā panassa mādiso. ‘‘Kā cānanda, migasālā upāsikā bālā abyattā ammakā ammakapaññā, ke ca purisapuggalaparopariye ñāṇe! Ime kho, ānanda, dasa puggalā santo saṃvijjamānā lokasmiṃ. ‘‘Yathārūpena, ānanda, sīlena purāṇo samannāgato ahosi tathārūpena sīlena isidatto samannāgato abhavissa, nayidha purāṇo isidattassa gatimpi aññassa. Yathārūpāya cānanda, paññāya isidatto samannāgato ahosi tathārūpāya paññāya purāṇo samannāgato abhavissa, nayidha isidatto purāṇassa gatimpi aññassa. Iti kho, ānanda, ime puggalā ubho ekaṅgahīnā’’ti. Pañcamaṃ.",
      "english": "At one time the Blessed One was staying at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. Then, in the morning, the Venerable Ānanda dressed, and taking his bowl and robe, went to the residence of the lay follower Migasālā; having gone there, he sat down on the prepared seat. Then the lay follower Migasālā approached the Venerable Ānanda; having approached and paid homage to the Venerable Ānanda, she sat down to one side. As she sat to one side, the lay follower Migasālā said to the Venerable Ānanda: \"How, indeed, Venerable Ānanda, is the Dhamma taught by the Blessed One to be understood, when it is the case that both one who observes celibacy and one who does not observe celibacy will attain the same destination in the future? My father, Venerable Sir, was formerly one who observed celibacy, diligent in conduct, abstaining from sexual intercourse, the village custom. When he passed away, the Blessed One declared him to be a once-returner, reborn in the Tusita realm. My grandfather, Venerable Sir, Isidatta, was one who did not observe celibacy, content with his own wife. When he also passed away, the Blessed One declared him to be a once-returner, reborn in the Tusita realm. How, indeed, Venerable Ānanda, is the Dhamma taught by the Blessed One to be understood, when it is the case that both one who observes celibacy and one who does not observe celibacy will attain the same destination in the future?\" \"Sister, indeed, it has been declared thus by the Blessed One.\"\n\nThen, the Venerable Ānanda, having received alms food at the residence of the lay follower Migasālā, rose from his seat and departed. Then, after his meal, having returned from his alms round, the Venerable Ānanda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the Venerable Ānanda said to the Blessed One: \"Venerable Sir, here, in the morning, I dressed, and taking my bowl and robe, went to the residence of the lay follower Migasālā; having gone there, I sat down on the prepared seat. Then, Venerable Sir, the lay follower Migasālā approached me; having approached and paid homage to me, she sat down to one side. As she sat to one side, Venerable Sir, the lay follower Migasālā said to me: ‘How, indeed, Venerable Ānanda, is the Dhamma taught by the Blessed One to be understood, when it is the case that both one who observes celibacy and one who does not observe celibacy will attain the same destination in the future? My father, Venerable Sir, was formerly one who observed celibacy, diligent in conduct, abstaining from sexual intercourse, the village custom. When he passed away, the Blessed One declared him to be a once-returner, reborn in the Tusita realm. My grandfather, Venerable Sir, Isidatta, was one who did not observe celibacy, content with his own wife. When he also passed away, the Blessed One declared him to be a once-returner, reborn in the Tusita realm. How, indeed, Venerable Ānanda, is the Dhamma taught by the Blessed One to be understood, when it is the case that both one who observes celibacy and one who does not observe celibacy will attain the same destination in the future?’ When this was said, Venerable Sir, I said to the lay follower Migasālā: ‘Sister, indeed, it has been declared thus by the Blessed One.’\"\n\n\"What, Ānanda, is the lay follower Migasālā? She is foolish, unintelligent, a simpleton with simpleton's wisdom. How could she know about the differentiation of persons? There are, Ānanda, these ten types of individuals existing in the world. Which ten? Here, Ānanda, a certain individual is immoral. He does not understand as it actually is the liberation of mind and liberation by wisdom, by which his immorality would completely cease without remainder. For him, there is no accomplishment through listening, no accomplishment through extensive learning, no penetration by right view, and he does not obtain temporary liberation. Upon the breaking up of the body, after death, he proceeds to decline, not to distinction; he is one who goes to decline, not one who goes to distinction.\"\n\n\"But here, Ānanda, a certain individual is immoral. But he understands as it actually is the liberation of mind and liberation by wisdom, by which his immorality would completely cease without remainder. For him, there is accomplishment through listening, accomplishment through extensive learning, penetration by right view, and he obtains temporary liberation. Upon the breaking up of the body, after death, he proceeds to distinction, not to decline; he is one who goes to distinction, not one who goes to decline.\"\n\n\"Concerning this, Ānanda, those who judge by measure might judge thus: ‘This one also has those same qualities, and the other one also has those same qualities. Why is one of them inferior, and the other superior?’ Indeed, Ānanda, that [judgment] will lead to their harm and suffering for a long time.\"\n\n\"Concerning this, Ānanda, as for the individual who is immoral, but who understands as it actually is the liberation of mind and liberation by wisdom, by which his immorality would completely cease without remainder. For him, there is accomplishment through listening, accomplishment through extensive learning, penetration by right view, and he obtains temporary liberation.\"\n\n“This person, Ananda, is more advanced and more excellent than that previous person. And why is that? Because, Ananda, the current of the Dhamma carries this person forward to liberation. Who but a Tathagata could know the inner state of such a one? Therefore, Ananda, do not be one who measures people; do not take measure of people. For, Ananda, one who measures people is hindered. Only I, Ananda, or one like me, could truly take measure of people.\n\n“Here, Ananda, some person is virtuous. But they do not understand, as it actually is, that liberation of mind and liberation through wisdom where their virtue ceases without remainder. For them, even by hearing, it is not accomplished; even by extensive learning, it is not accomplished; even by view, it is not penetrated; and they do not attain a temporary liberation. Upon the breaking up of the body, after death, such a one fares to decline, not to distinction; they are one who fares to decline, not one who fares to distinction.\n\n“Here, Ananda, some person is virtuous. And they understand, as it actually is, that liberation of mind and liberation through wisdom where their virtue ceases without remainder. For them, even by hearing, it is accomplished; even by extensive learning, it is accomplished; even by view, it is penetrated; and they attain a temporary liberation. Upon the breaking up of the body, after death, such a one fares to distinction, not to decline; they are one who fares to distinction, not one who fares to decline.\n\n“There, Ananda, those who measure, measure; therefore, Ananda, do not be one who measures people; do not take measure of people. For, Ananda, one who measures people is hindered. Only I, Ananda, or one like me, could truly take measure of people.\n\n“Here, Ananda, some person has strong passion. But they do not understand, as it actually is, that liberation of mind and liberation through wisdom where that passion ceases without remainder. For them, even by hearing, it is not accomplished; even by extensive learning, it is not accomplished; even by view, it is not penetrated; and they do not attain a temporary liberation. Upon the breaking up of the body, after death, such a one fares to decline, not to distinction; they are one who fares to decline, not one who fares to distinction.\n\n“Here, Ananda, some person has strong passion. And they understand, as it actually is, that liberation of mind and liberation through wisdom where that passion ceases without remainder. For them, even by hearing, it is accomplished; even by extensive learning, it is accomplished; even by view, it is penetrated; and they attain a temporary liberation. Upon the breaking up of the body, after death, such a one fares to distinction, not to decline; they are one who fares to distinction, not one who fares to decline.\n\n“There, Ananda, those who measure, measure; therefore, Ananda, do not be one who measures people; do not take measure of people. For, Ananda, one who measures people is hindered. Only I, Ananda, or one like me, could truly take measure of people.\n\n“Here, Ananda, some person is irritable. But they do not understand, as it actually is, that liberation of mind and liberation through wisdom where that irritability ceases without remainder. For them, even by hearing, it is not accomplished; even by extensive learning, it is not accomplished; even by view, it is not penetrated; and they do not attain a temporary liberation. Upon the breaking up of the body, after death, such a one fares to decline, not to distinction; they are one who fares to decline, not one who fares to distinction.\n\n“Here, Ananda, some person is irritable. And they understand, as it actually is, that liberation of mind and liberation through wisdom where that irritability ceases without remainder. For them, even by hearing, it is accomplished; even by extensive learning, it is accomplished; even by view, it is penetrated; and they attain a temporary liberation. Upon the breaking up of the body, after death, such a one fares to distinction, not to decline; they are one who fares to distinction, not one who fares to decline.\n\n“There, Ananda, those who measure, measure; therefore, Ananda, do not be one who measures people; do not take measure of people. For, Ananda, one who measures people is hindered. Only I, Ananda, or one like me, could truly take measure of people.\n\n“Here, Ananda, some person is conceited and restless. But they do not understand, as it actually is, that liberation of mind and liberation through wisdom where that conceit and restlessness ceases without remainder. For them, even by hearing, it is not accomplished; even by extensive learning, it is not accomplished; even by view, it is not penetrated; and they do not attain a temporary liberation. Upon the breaking up of the body, after death, such a one fares to decline, not to distinction; they are one who fares to decline, not one who fares to distinction.\n\n“Here, Ananda, some person is conceited and restless. And they understand, as it actually is, that liberation of mind and liberation through wisdom where that conceit and restlessness ceases without remainder. For them, even by hearing, it is accomplished; even by extensive learning, it is accomplished; even by view, it is penetrated; and they attain a temporary liberation. Upon the breaking up of the body, after death, such a one fares to distinction, not to decline; they are one who fares to distinction, not one who fares to decline.\n\n“There, Ananda, those who measure, measure—thinking: ‘For this person, these very same qualities exist, and for that other person, these very same qualities exist. Why is one of them inferior and the other excellent?’ Indeed, Ananda, that will lead to their harm and suffering for a long time.\n\nTherein, Ananda, that person who is agitated and arrogant, and who truly understands that liberation of mind and liberation by wisdom where his agitation completely ceases without remainder—for him, listening has been done, much learning has been done, penetration by right view has been achieved, and he attains occasional liberation.\n\nThis person, Ananda, is more advanced and more excellent than that previous person. What is the reason for that? Because, Ananda, the current of Dhamma carries this person forth. Who could know the difference between them, except the Tathāgata?\n\nTherefore, Ananda, do not be one who measures persons; do not take measure of persons. Indeed, Ananda, one who judges persons becomes impaired. Either I, Ananda, might measure persons, or one who is like me.\n\nWhat, Ananda, is the female lay follower Migasālā? She is foolish, inexperienced, immature, and of immature wisdom. And what is knowledge concerning the superiority and inferiority of male persons?\n\nThese, Ananda, are the ten types of persons who exist and are found in the world.\n\nIf, Ananda, Purāṇa had been endowed with the same kind of virtue as Isidatta was endowed with, Purāṇa would still not have known Isidatta’s destination. And if, Ananda, Isidatta had been endowed with the same kind of wisdom as Purāṇa was endowed with, Isidatta would still not have known Purāṇa’s destination. Thus, Ananda, both these persons are deficient in one aspect.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එසමයෙහි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ පෙරවරුවෙහි සිවුරු පොරවා, පාත්‍ර සිවුරු ද රැගෙන, මිගසාලා උපාසිකාවගේ නිවස කරා වැඩි සේක; වැඩම කොට පනවන ලද අසුනක වැඩහුන් සේක. එකල්හි මිගසාලා උපාසිකාව ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ වෙත පැමිණ, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට වන්දනා කොට, එකත්පසෙකින් වාඩි වූවාය. එකත්පසෙකින් වාඩි වී සිටි මිගසාලා උපාසිකාව ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ පැවසුවාය – “භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්මය කෙසේ නම් දත යුතුද, භන්තේ ආනන්ද, යම් හෙයකින් බඹසර රකින අයත්, බඹසර නොරැක වෙසෙන අයත් යන දෙදෙනාම පරලොව එකම ගතියකට පත් වන්නාහුද? මාගේ පියාණන් වහන්සේ, භන්තේ, පෙර දිනවල බඹසර රකින්නෙකු ලෙස, ග්‍රාම්‍ය ස්ත්‍රී පුරුෂ සේවනයෙන් වැළකී (පිරිසිදු) දිවි පෙවෙතක් ගත කළ සේක. උන්වහන්සේ කලක් ගතව මිය ගිය පසු, භාග්‍යවතුන් වහන්සේ විසින් ‘උන්වහන්සේ සකදාගාමී සත්වයෙකි, තුසිත දෙව්ලොව උපන්නේය’ යි වදාළ සේක. මාගේ පියාගේ පියාණෝ (පියාමහ), භන්තේ, ඉසිදත්ත නම් වූ අතර, බඹසර නොරැක, තම බිරිඳ සමඟ සතුටින් විසූ අයෙක් වූහ. උන්වහන්සේ ද කලක් ගතව මිය ගිය පසු, භාග්‍යවතුන් වහන්සේ විසින් ‘උන්වහන්සේ සකදාගාමී සත්වයෙකි, තුසිත දෙව්ලොව උපන්නේය’ යි වදාළ සේක. භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්මය කෙසේ නම් දත යුතුද, භන්තේ ආනන්ද, යම් හෙයකින් බඹසර රකින අයත්, බඹසර නොරැක වෙසෙන අයත් යන දෙදෙනාම පරලොව එකම ගතියකට පත් වන්නාහුද?” “නංගියනි, භාග්‍යවතුන් වහන්සේ විසින් මෙය එලෙසින්ම වදාළ සේක.”\n\nඑකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මිගසාලා උපාසිකාවගේ නිවසෙහි පිණ්ඩපාතය ගෙන, අසුනෙන් නැගිට පිටත් වූ සේක. එකල්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ දන් වළඳා අවසන් කොට (පිණ්ඩපාතය ප්‍රතික්ෂේප කොට), භාග්‍යවතුන් වහන්සේ වෙත වැඩි සේක; වැඩම කොට භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙකින් වැඩහුන් සේක. එකත්පසෙකින් වැඩ සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක – “භන්තේ, මෙහිදී මම පෙරවරුවෙහි සිවුරු පොරවා, පාත්‍ර සිවුරු ද රැගෙන, මිගසාලා උපාසිකාවගේ නිවස කරා වැඩිමි; වැඩම කොට පනවන ලද අසුනක වැඩහුනිමි. භන්තේ, එකල්හි මිගසාලා උපාසිකාව මා වෙත පැමිණ, මට වන්දනා කොට, එකත්පසෙකින් වාඩි වූවාය. භන්තේ, එකත්පසෙකින් වාඩි වී සිටි මිගසාලා උපාසිකාව මට මෙසේ පැවසුවාය – ‘භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්මය කෙසේ නම් දත යුතුද, භන්තේ ආනන්ද, යම් හෙයකින් බඹසර රකින අයත්, බඹසර නොරැක වෙසෙන අයත් යන දෙදෙනාම පරලොව එකම ගතියකට පත් වන්නාහුද? මාගේ පියාණන් වහන්සේ, භන්තේ, පෙර දිනවල බඹසර රකින්නෙකු ලෙස, ග්‍රාම්‍ය ස්ත්‍රී පුරුෂ සේවනයෙන් වැළකී (පිරිසිදු) දිවි පෙවෙතක් ගත කළ සේක. උන්වහන්සේ කලක් ගතව මිය ගිය පසු, භාග්‍යවතුන් වහන්සේ විසින් ‘උන්වහන්සේ සකදාගාමී සත්වයෙකි, තුසිත දෙව්ලොව උපන්නේය’ යි වදාළ සේක. මාගේ පියාගේ පියාණෝ (පියාමහ), භන්තේ, ඉසිදත්ත නම් වූ අතර, බඹසර නොරැක, තම බිරිඳ සමඟ සතුටින් විසූ අයෙක් වූහ. උන්වහන්සේ ද කලක් ගතව මිය ගිය පසු, භාග්‍යවතුන් වහන්සේ විසින් ‘උන්වහන්සේ සකදාගාමී සත්වයෙකි, තුසිත දෙව්ලොව උපන්නේය’ යි වදාළ සේක. භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්මය කෙසේ නම් දත යුතුද, භන්තේ ආනන්ද, යම් හෙයකින් බඹසර රකින අයත්, බඹසර නොරැක වෙසෙන අයත් යන දෙදෙනාම පරලොව එකම ගතියකට පත් වන්නාහුද?’ භන්තේ, මෙසේ කී විට මම මිගසාලා උපාසිකාවට මෙසේ කීවෙමි – ‘නංගියනි, භාග්‍යවතුන් වහන්සේ විසින් මෙය එලෙසින්ම වදාළ සේක.’”\n\n“ආනන්දය, මිගසාලා උපාසිකාව බාලය, අවිනීතය, මෝඩය, මෝඩ ප්‍රඥා ඇත්තියකි. පුරිසපුද්ගල පරෝපරිය ඥානයක් ඇයට කොයින්ද? ආනන්දය, ලෝකයෙහි සිටින, සම්පූර්ණයෙන් පවතින පුද්ගලයෝ දස දෙනෙක් වෙති. ඒ කවර දස දෙනෙක්ද? ආනන්දය, මෙහිදී ඇතැම් පුද්ගලයෙක් දුසිල්වත් වේ. ඔහුගේ ඒ දුශ්ශීලභාවය අවශේෂ නැතිව නිරුද්ධ වන චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය ඔහු යථාභූත ලෙස නොදනියි. ඔහුට (ධර්මය) ශ්‍රවණය කිරීමෙන් ද කිසිවක් සිදු වී නැත, බහුශ්‍රැතභාවයෙන් ද කිසිවක් සිදු වී නැත, (ධර්මය) දෘෂ්ටියෙන් ද (ප්‍රඥාවෙන්) විදහා දැක නැත, තාවකාලික විමුක්තියක් වත් නොලබයි. හේ කය බිඳී මරණින් මතු හානියට පත් වේ, දියුණුවට නොවේ; හානියටම පත් වන සුළුය, දියුණුවට පත් වන සුළු නොවේ. එහෙත්, ආනන්දය, මෙහිදී ඇතැම් පුද්ගලයෙක් දුසිල්වත් වේ. ඔහුගේ ඒ දුශ්ශීලභාවය අවශේෂ නැතිව නිරුද්ධ වන චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය ඔහු යථාභූත ලෙස දනියි. ඔහුට (ධර්මය) ශ්‍රවණය කිරීමෙන් ද ප්‍රයෝජන වී ඇත, බහුශ්‍රැතභාවයෙන් ද ප්‍රයෝජන වී ඇත, (ධර්මය) දෘෂ්ටියෙන් ද (ප්‍රඥාවෙන්) විදහා දැක ඇත, තාවකාලික විමුක්තියක් ද ලබයි. හේ කය බිඳී මරණින් මතු දියුණුවට පත් වේ, හානියට නොවේ; දියුණුවටම පත් වන සුළුය, හානියට පත් වන සුළු නොවේ. ආනන්දය, එහිදී මිනුම් ගන්නා (මිනුම් බලන) ඇතැමුන් ‘මේ පුද්ගලයාගේත් ඒ ධර්මයන්මය, අනිත් පුද්ගලයාගේත් ඒ ධර්මයන්මය. එසේ නම් මොවුන්ගෙන් කවරෙක් පහත්ද, කවරෙක් උසස්ද?’ යැයි මනියි. ආනන්දය, එය නම් ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත්, දුක පිණිසත් පවතින්නකි. ආනන්දය, එහිදී යම් පුද්ගලයෙක් දුසිල්වත් වේද, නමුත් ඔහුගේ ඒ දුශ්ශීලභාවය අවශේෂ නැතිව නිරුද්ධ වන චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය ඔහු යථාභූත ලෙස දනියි. ඔහුට (ධර්මය) ශ්‍රවණය කිරීමෙන් ද ප්‍රයෝජන වී ඇත, බහුශ්‍රැතභාවයෙන් ද ප්‍රයෝජන වී ඇත, (ධර්මය) දෘෂ්ටියෙන් ද (ප්‍රඥාවෙන්) විදහා දැක ඇත, තාවකාලික විමුක්තියක් ද ලබයි.\n\nආනන්දයෙනි, මේ පුද්ගලයා පෙර සිටි පුද්ගලයාට වඩා උතුම්ය, ප‍්‍ර‍්‍රණීතය. ඒ කුමක් හෙයින්ද? ආනන්දයෙනි, ධර‍්‍රම ප‍්‍ර‍්‍රවාහය (ධර‍්‍රමයේ ගලා ඒම) මේ පුද්ගලයා නිරතුරුවම (නිවන කරා) ගෙන යයි. තථාගතයන් වහන්සේ හැර ඒ අභ්‍යන්තර වෙනස කවුරු නම් දන්නේද! එමනිසා, ආනන්දයෙනි, පුද්ගලයන් පිළිබඳව මිනුම් ගන්නන් නොවිය යුතුය, පුද්ගලයන් පිළිබඳව මිනුම් නොගත යුතුය. ආනන්දයෙනි, පුද්ගලයන් පිළිබඳව මිනුම් ගන්නා තැනැත්තාට බාධා පැමිණේ. ආනන්දයෙනි, මා වැනි කෙනෙකුට හෝ මා වැනි කෙනෙකු සිටී නම් ඔහුට හෝ පුද්ගලයන් පිළිබඳව මිනුම් ගැනීමට හැකියාව ඇත.\n\nආනන්දයෙනි, මෙහි ඇතැම් පුද්ගලයෙක් සිල්වත් වේ. ඔහුට යම් තැනක ඔහුගේ ඒ සීලය නිරවශේෂවම නිරුද්ධ වේද, ඒ චේතෝවිමුක්තිය හා ප‍්‍ර‍්‍රඥා විමුක්තිය යථාභූතව නොදන්නේය. ඔහුට ශ‍්‍ර‍්‍රවණයෙන්ද එය නොකළ තත්ත්වයක් වේ. බහුශ‍්‍ර‍්‍රැතභාවයෙන්ද එය නොකළ තත්ත්වයක් වේ. දෘෂ්ටියෙන්ද විනිවිද නොදුටු තත්ත්වයක් වේ. එසේම මොහොතකට හෝ විමුක්තියක් නොලබයි. ඒ පුද්ගලයා කය බිඳී මරණින් මතු හානිය පිණිස පවතී, දියුණුව පිණිස නොවේ; හානි මාර්ගයේ ගමන් කරන්නෙක්ම වේ, දියුණුවේ මාර්ගයේ ගමන් කරන්නෙක් නොවේ.\n\nආනන්දයෙනි, මෙහි ඇතැම් පුද්ගලයෙක් සිල්වත් වේ. ඔහුට යම් තැනක ඔහුගේ ඒ සීලය නිරවශේෂවම නිරුද්ධ වේද, ඒ චේතෝවිමුක්තිය හා ප‍්‍ර‍්‍රඥා විමුක්තිය යථාභූතව දන්නේය. ඔහුට ශ‍්‍ර‍්‍රවණයෙන්ද එය කළ තත්ත්වයක් වේ. බහුශ‍්‍ර‍්‍රැතභාවයෙන්ද එය කළ තත්ත්වයක් වේ. දෘෂ්ටියෙන්ද විනිවිද දුටු තත්ත්වයක් වේ. එසේම මොහොතකට හෝ විමුක්තියක් ලබයි. ඒ පුද්ගලයා කය බිඳී මරණින් මතු දියුණුව පිණිස පවතී, හානිය පිණිස නොවේ; දියුණුවේ මාර්ගයේ ගමන් කරන්නෙක්ම වේ, හානි මාර්ගයේ ගමන් කරන්නෙක් නොවේ.\n\nආනන්දයෙනි, එහිදී මිනුම් ගන්නා පුද්ගලයන් මිනුම් ගනිති. ආනන්දයෙනි, පුද්ගලයන් පිළිබඳව මිනුම් ගන්නා තැනැත්තාට බාධා පැමිණේ. ආනන්දයෙනි, මා වැනි කෙනෙකුට හෝ මා වැනි කෙනෙකු සිටී නම් ඔහුට හෝ පුද්ගලයන් පිළිබඳව මිනුම් ගැනීමට හැකියාව ඇත.\n\nආනන්දයෙනි, මෙහි ඇතැම් පුද්ගලයෙක් දැඩි රාගයෙන් යුක්ත වේ. ඔහුට යම් තැනක ඔහුගේ ඒ රාගය නිරවශේෂවම නිරුද්ධ වේද, ඒ චේතෝවිමුක්තිය හා ප‍්‍ර‍්‍රඥා විමුක්තිය යථාභූතව නොදන්නේය. ඔහුට ශ‍්‍ර‍්‍රවණයෙන්ද එය නොකළ තත්ත්වයක් වේ. බහුශ‍්‍ර‍්‍රැතභාවයෙන්ද එය නොකළ තත්ත්වයක් වේ. දෘෂ්ටියෙන්ද විනිවිද නොදුටු තත්ත්වයක් වේ. එසේම මොහොතකට හෝ විමුක්තියක් නොලබයි. ඒ පුද්ගලයා කය බිඳී මරණින් මතු හානිය පිණිස පවතී, දියුණුව පිණිස නොවේ; හානි මාර්ගයේ ගමන් කරන්නෙක්ම වේ, දියුණුවේ මාර්ගයේ ගමන් කරන්නෙක් නොවේ.\n\nආනන්දයෙනි, මෙහි ඇතැම් පුද්ගලයෙක් දැඩි රාගයෙන් යුක්ත වේ. ඔහුට යම් තැනක ඔහුගේ ඒ රාගය නිරවශේෂවම නිරුද්ධ වේද, ඒ චේතෝවිමුක්තිය හා ප‍්‍ර‍්‍රඥා විමුක්තිය යථාභූතව දන්නේය. ඔහුට ශ‍්‍ර‍්‍රවණයෙන්ද එය කළ තත්ත්වයක් වේ. බහුශ‍්‍ර‍්‍රැතභාවයෙන්ද එය කළ තත්ත්වයක් වේ. දෘෂ්ටියෙන්ද විනිවිද දුටු තත්ත්වයක් වේ. එසේම මොහොතකට හෝ විමුක්තියක් ලබයි. ඒ පුද්ගලයා කය බිඳී මරණින් මතු දියුණුව පිණිස පවතී, හානිය පිණිස නොවේ; දියුණුවේ මාර්ගයේ ගමන් කරන්නෙක්ම වේ, හානි මාර්ගයේ ගමන් කරන්නෙක් නොවේ.\n\nආනන්දයෙනි, එහිදී මිනුම් ගන්නා පුද්ගලයන් මිනුම් ගනිති. ආනන්දයෙනි, පුද්ගලයන් පිළිබඳව මිනුම් ගන්නා තැනැත්තාට බාධා පැමිණේ. ආනන්දයෙනි, මා වැනි කෙනෙකුට හෝ මා වැනි කෙනෙකු සිටී නම් ඔහුට හෝ පුද්ගලයන් පිළිබඳව මිනුම් ගැනීමට හැකියාව ඇත.\n\nආනන්දයෙනි, මෙහි ඇතැම් පුද්ගලයෙක් කෝප ස්වභාවයෙන් යුක්ත වේ. ඔහුට යම් තැනක ඔහුගේ ඒ කෝපය නිරවශේෂවම නිරුද්ධ වේද, ඒ චේතෝවිමුක්තිය හා ප‍්‍ර‍්‍රඥා විමුක්තිය යථාභූතව නොදන්නේය. ඔහුට ශ‍්‍ර‍්‍රවණයෙන්ද එය නොකළ තත්ත්වයක් වේ. බහුශ‍්‍ර‍්‍රැතභාවයෙන්ද එය නොකළ තත්ත්වයක් වේ. දෘෂ්ටියෙන්ද විනිවිද නොදුටු තත්ත්වයක් වේ. එසේම මොහොතකට හෝ විමුක්තියක් නොලබයි. ඒ පුද්ගලයා කය බිඳී මරණින් මතු හානිය පිණිස පවතී, දියුණුව පිණිස නොවේ; හානි මාර්ගයේ ගමන් කරන්නෙක්ම වේ, දියුණුවේ මාර්ගයේ ගමන් කරන්නෙක් නොවේ.\n\nආනන්දයෙනි, මෙහි ඇතැම් පුද්ගලයෙක් කෝප ස්වභාවයෙන් යුක්ත වේ. ඔහුට යම් තැනක ඔහුගේ ඒ කෝපය නිරවශේෂවම නිරුද්ධ වේද, ඒ චේතෝවිමුක්තිය හා ප‍්‍ර‍්‍රඥා විමුක්තිය යථාභූතව දන්නේය. ඔහුට ශ‍්‍ර‍්‍රවණයෙන්ද එය කළ තත්ත්වයක් වේ. බහුශ‍්‍ර‍්‍රැතභාවයෙන්ද එය කළ තත්ත්වයක් වේ. දෘෂ්ටියෙන්ද විනිවිද දුටු තත්ත්වයක් වේ. එසේම මොහොතකට හෝ විමුක්තියක් ලබයි. ඒ පුද්ගලයා කය බිඳී මරණින් මතු දියුණුව පිණිස පවතී, හානිය පිණිස නොවේ; දියුණුවේ මාර්ගයේ ගමන් කරන්නෙක්ම වේ, හානි මාර්ගයේ ගමන් කරන්නෙක් නොවේ.\n\nආනන්දයෙනි, එහිදී මිනුම් ගන්නා පුද්ගලයන් මිනුම් ගනිති. ආනන්දයෙනි, පුද්ගලයන් පිළිබඳව මිනුම් ගන්නා තැනැත්තාට බාධා පැමිණේ. ආනන්දයෙනි, මා වැනි කෙනෙකුට හෝ මා වැනි කෙනෙකු සිටී නම් ඔහුට හෝ පුද්ගලයන් පිළිබඳව මිනුම් ගැනීමට හැකියාව ඇත.\n\nආනන්දයෙනි, මෙහි ඇතැම් පුද්ගලයෙක් උද්දච්ච ස්වභාවයෙන් යුක්ත වේ. ඔහුට යම් තැනක ඔහුගේ ඒ උද්දච්චය නිරවශේෂවම නිරුද්ධ වේද, ඒ චේතෝවිමුක්තිය හා ප‍්‍ර‍්‍රඥා විමුක්තිය යථාභූතව නොදන්නේය. ඔහුට ශ‍්‍ර‍්‍රවණයෙන්ද එය නොකළ තත්ත්වයක් වේ. බහුශ‍්‍ර‍්‍රැතභාවයෙන්ද එය නොකළ තත්ත්වයක් වේ. දෘෂ්ටියෙන්ද විනිවිද නොදුටු තත්ත්වයක් වේ. එසේම මොහොතකට හෝ විමුක්තියක් නොලබයි. ඒ පුද්ගලයා කය බිඳී මරණින් මතු හානිය පිණිස පවතී, දියුණුව පිණිස නොවේ; හානි මාර්ගයේ ගමන් කරන්නෙක්ම වේ, දියුණුවේ මාර්ගයේ ගමන් කරන්නෙක් නොවේ.\n\nආනන්දයෙනි, මෙහි ඇතැම් පුද්ගලයෙක් උද්දච්ච ස්වභාවයෙන් යුක්ත වේ. ඔහුට යම් තැනක ඔහුගේ ඒ උද්දච්චය නිරවශේෂවම නිරුද්ධ වේද, ඒ චේතෝවිමුක්තිය හා ප‍්‍ර‍්‍රඥා විමුක්තිය යථාභූතව දන්නේය. ඔහුට ශ‍්‍ර‍්‍රවණයෙන්ද එය කළ තත්ත්වයක් වේ. බහුශ‍්‍ර‍්‍රැතභාවයෙන්ද එය කළ තත්ත්වයක් වේ. දෘෂ්ටියෙන්ද විනිවිද දුටු තත්ත්වයක් වේ. එසේම මොහොතකට හෝ විමුක්තියක් ලබයි. ඒ පුද්ගලයා කය බිඳී මරණින් මතු දියුණුව පිණිස පවතී, හානිය පිණිස නොවේ; දියුණුවේ මාර්ගයේ ගමන් කරන්නෙක්ම වේ, හානි මාර්ගයේ ගමන් කරන්නෙක් නොවේ.\n\nආනන්දයෙනි, එහිදී මිනුම් ගන්නා පුද්ගලයන් මෙසේ මිනුම් ගනිති: 'මේ පුද්ගලයාටද ඒ ධර‍්‍රමයන්ම (ගුණධර‍්‍රම) ඇත, අනිත් පුද්ගලයාටද ඒ ධර‍්‍රමයන්ම ඇත. එසේ නම්, ඔවුන්ගෙන් එක් අයෙක් පහත් වන්නේත් එක් අයෙක් උසස් වන්නේත් කවර හෙයින්ද?' ආනන්දයෙනි, සැබවින්ම එය ඔවුන්ට දීර්ඝ කාලයක් අහිත පිණිසත් දුක් පිණිසත් පවතී.\n\nආනන්දයෙනි, එහි යම් පුද්ගලයෙක් උද්ධතව සිටීද, ඔහු ඒ චේතෝවිමුක්තිය හා ප්‍රඥා(ප්‍රඥා)විමුක්තිය යථාභූත ලෙස දනී, යම් තැනක ඔහුගේ ඒ උද්ධච්චය ශේෂ(ශේෂ) රහිතව නිරුද්ධ වේද; ඔහුගේ ශ්‍රවණයද(ශ්‍රවණයද) සිදුකර ඇත, බහුශ්‍රැත බවද(බහුශ්‍රැත බවද) සිදුකර ඇත, දෘෂ්ටියෙන්ද(දෘෂ්ටියෙන්ද) විනිවිද ඇත, කාලීන විමුක්තියද(කාලීන විමුක්තියද) ලබයි. ආනන්දයෙනි, මේ පුද්ගලයා ඒ පෙර සිටි පුද්ගලයාට වඩා උසස්ය, ප්‍රණීතය. ඊට හේතුව කුමක්ද? ආනන්දයෙනි, මේ පුද්ගලයා ධර්ම ප්‍රවාහය විසින් ගොඩගනී. එහි අභ්‍යන්තරය තථාගතයන් වහන්සේ හැර වෙන කවුද දන්නේ! එබැවින් ආනන්දයෙනි, පුද්ගලයන් පිළිබඳව මිනුම් ගන්නන් නොවන්න; පුද්ගලයන් පිළිබඳව මිනුම් නොගන්න. ආනන්දයෙනි, පුද්ගලයන් පිළිබඳව මිනුම් ගන්නා තැනැත්තා පිරිහෙයි. ආනන්දයෙනි, මා හෝ පුද්ගලයන් පිළිබඳව මිනුම් ගත යුතුයි, මා වැනි අන්‍ය කෙනෙක් හෝ.\n\nආනන්දයෙනි, මිගසාලා උපාසිකාව යනු කවරියක්ද, ඇය බාල, අවිඥාත, නොමේරූ නුවණක් ඇත්තියක් මිස, පුරුෂ පුද්ගලයන්ගේ උසස් පහත් බව දන්නා ඥානයක් ඇත්තියක්ද? ආනන්දයෙනි, මේ දස පුද්ගලයෝ ලෝකයෙහි සත්‍ය වශයෙන්ම පවතිති, සිටිති.\n\nආනන්දයෙනි, යම් ආකාරයක සීලයකින් පුරාණ නම් පුද්ගලයා යුක්තව සිටියේද, එවැනිම සීලයකින් ඉසිදත්ත නම් පුද්ගලයා යුක්ත වූයේ නම්, මෙහිදී පුරාණ ඉසිදත්තගේ ගතියවත් නොදනී. ආනන්දයෙනි, යම් ආකාරයක ප්‍රඥා(ප්‍රඥා)වකින් ඉසිදත්ත නම් පුද්ගලයා යුක්තව සිටියේද, එවැනිම ප්‍රඥා(ප්‍රඥා)වකින් පුරාණ නම් පුද්ගලයා යුක්ත වූයේ නම්, මෙහිදී ඉසිදත්ත පුරාණගේ ගතියවත් නොදනී. ආනන්දයෙනි, මෙසේ මේ පුද්ගලයන් දෙදෙනාම එක් අංගයකින් අඩු වූවන්ය.",
      "paliTitle": "Migasālāsuttaṃ",
      "englishTitle": "Discourse on Migasālā",
      "sinhalaTitle": "මිගසාලා සූත්‍රය"
    },
    {
      "number": 76,
      "pali": "‘‘Tayome, bhikkhave, dhammā loke na saṃvijjeyyuṃ, na tathāgato loke uppajjeyya arahaṃ sammāsambuddho, na tathāgatappavedito dhammavinayo loke dibbeyya. Katame tayo? Jāti ca, jarā ca, maraṇañca – ime kho, bhikkhave, tayo dhammā loke na saṃvijjeyyuṃ, na tathāgato loke uppajjeyya arahaṃ sammāsambuddho, na tathāgatappavedito dhammavinayo loke dibbeyya. Yasmā ca kho, bhikkhave, ime tayo dhammā loke saṃvijjanti tasmā tathāgato loke uppajjati arahaṃ sammāsambuddho, tasmā tathāgatappavedito dhammavinayo loke dibbati. ‘‘Tayome, bhikkhave, dhamme appahāya abhabbo jātiṃ pahātuṃ jaraṃ pahātuṃ maraṇaṃ pahātuṃ. Katame tayo? Rāgaṃ appahāya, dosaṃ appahāya, mohaṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo jātiṃ pahātuṃ jaraṃ pahātuṃ maraṇaṃ pahātuṃ. ‘‘Tayome bhikkhave, dhamme appahāya abhabbo rāgaṃ pahātuṃ dosaṃ pahātuṃ mohaṃ pahātuṃ. Katame tayo? Sakkāyadiṭṭhiṃ appahāya, vicikicchaṃ appahāya, sīlabbataparāmāsaṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo rāgaṃ pahātuṃ dosaṃ pahātuṃ mohaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme appahāya abhabbo sakkāyadiṭṭhiṃ pahātuṃ vicikicchaṃ pahātuṃ sīlabbataparāmāsaṃ pahātuṃ. Katame tayo? Ayonisomanasikāraṃ appahāya, kummaggasevanaṃ appahāya, cetaso līnattaṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo sakkāyadiṭṭhiṃ pahātuṃ vicikicchaṃ pahātuṃ sīlabbataparāmāsaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme appahāya abhabbo ayoniso manasikāraṃ pahātuṃ kummaggasevanaṃ pahātuṃ cetaso līnattaṃ pahātuṃ. Katame tayo? Muṭṭhasaccaṃ appahāya, asampajaññaṃ appahāya, cetaso vikkhepaṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo ayonisomanasikāraṃ pahātuṃ kummaggasevanaṃ pahātuṃ cetaso līnattaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme appahāya abhabbo muṭṭhasaccaṃ pahātuṃ asampajaññaṃ pahātuṃ cetaso vikkhepaṃ pahātuṃ. Katame tayo? Ariyānaṃ adassanakamyataṃ appahāya, ariyadhammassa [ariyadhammaṃ (syā.)] asotukamyataṃ appahāya, upārambhacittataṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo muṭṭhasaccaṃ pahātuṃ asampajaññaṃ pahātuṃ cetaso vikkhepaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme appahāya abhabbo ariyānaṃ adassanakamyataṃ pahātuṃ ariyadhammassa asotukamyataṃ pahātuṃ upārambhacittataṃ pahātuṃ. Katame tayo? Uddhaccaṃ appahāya, asaṃvaraṃ appahāya, dussīlyaṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo ariyānaṃ adassanakamyataṃ pahātuṃ ariyadhammassa asotukamyataṃ pahātuṃ upārambhacittataṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme appahāya abhabbo uddhaccaṃ pahātuṃ asaṃvaraṃ pahātuṃ dussīlyaṃ pahātuṃ. Katame tayo? Assaddhiyaṃ appahāya, avadaññutaṃ appahāya, kosajjaṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo uddhaccaṃ pahātuṃ asaṃvaraṃ pahātuṃ dussīlyaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme appahāya abhabbo assaddhiyaṃ pahātuṃ avadaññutaṃ pahātuṃ kosajjaṃ pahātuṃ. Katame tayo? Anādariyaṃ appahāya, dovacassataṃ appahāya, pāpamittataṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo assaddhiyaṃ pahātuṃ avadaññutaṃ pahātuṃ kosajjaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme appahāya abhabbo anādariyaṃ pahātuṃ dovacassataṃ pahātuṃ pāpamittataṃ pahātuṃ. Katame tayo? Ahirikaṃ appahāya, anottappaṃ appahāya, pamādaṃ appahāya – ime kho, bhikkhave, tayo dhamme appahāya abhabbo anādariyaṃ pahātuṃ dovacassataṃ pahātuṃ pāpamittataṃ pahātuṃ. ‘‘Ahirikoyaṃ, bhikkhave, anottāpī pamatto hoti. So pamatto samāno abhabbo anādariyaṃ pahātuṃ dovacassataṃ pahātuṃ pāpamittataṃ pahātuṃ. So pāpamitto samāno abhabbo assaddhiyaṃ pahātuṃ avadaññutaṃ pahātuṃ kosajjaṃ pahātuṃ. So kusīto samāno abhabbo uddhaccaṃ pahātuṃ asaṃvaraṃ pahātuṃ dussīlyaṃ pahātuṃ. So dussīlo samāno abhabbo ariyānaṃ adassanakamyataṃ pahātuṃ ariyadhammassa asotukamyataṃ pahātuṃ upārambhacittataṃ pahātuṃ. So upārambhacitto samāno abhabbo muṭṭhasaccaṃ pahātuṃ asampajaññaṃ pahātuṃ cetaso vikkhepaṃ pahātuṃ. So vikkhittacitto samāno abhabbo ayonisomanasikāraṃ pahātuṃ kummaggasevanaṃ pahātuṃ cetaso līnattaṃ pahātuṃ. So līnacitto samāno abhabbo sakkāyadiṭṭhiṃ pahātuṃ vicikicchaṃ pahātuṃ sīlabbataparāmāsaṃ pahātuṃ. So vicikiccho samāno abhabbo rāgaṃ pahātuṃ dosaṃ pahātuṃ mohaṃ pahātuṃ. So rāgaṃ appahāya dosaṃ appahāya mohaṃ appahāya abhabbo jātiṃ pahātuṃ jaraṃ pahātuṃ maraṇaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo jātiṃ pahātuṃ jaraṃ pahātuṃ maraṇaṃ pahātuṃ. Katame tayo? Rāgaṃ pahāya, dosaṃ pahāya, mohaṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo jātiṃ pahātuṃ jaraṃ pahātuṃ maraṇaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo rāgaṃ pahātuṃ dosaṃ pahātuṃ mohaṃ pahātuṃ. Katame tayo? Sakkāyadiṭṭhiṃ pahāya, vicikicchaṃ pahāya, sīlabbataparāmāsaṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo rāgaṃ pahātuṃ dosaṃ pahātuṃ mohaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo sakkāyadiṭṭhiṃ pahātuṃ vicikicchaṃ pahātuṃ sīlabbataparāmāsaṃ pahātuṃ. Katame tayo? Ayonisomanasikāraṃ pahāya, kummaggasevanaṃ pahāya, cetaso līnattaṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo sakkāyadiṭṭhiṃ pahātuṃ vicikicchaṃ pahātuṃ sīlabbataparāmāsaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo ayonisomanasikāraṃ pahātuṃ kummaggasevanaṃ pahātuṃ cetaso līnattaṃ pahātuṃ. Katame tayo? Muṭṭhasaccaṃ pahāya, asampajaññaṃ pahāya, cetaso vikkhepaṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo ayonisomanasikāraṃ pahātuṃ kummaggasevanaṃ pahātuṃ cetaso līnattaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo muṭṭhasaccaṃ pahātuṃ asampajaññaṃ pahātuṃ cetaso vikkhepaṃ pahātuṃ. Katame tayo? Ariyānaṃ adassanakamyataṃ pahāya, ariyadhammassa asotukamyataṃ pahāya, upārambhacittataṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo muṭṭhassaccaṃ pahātuṃ asampajaññaṃ pahātuṃ cetaso vikkhepaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo ariyānaṃ adassanakamyataṃ pahātuṃ ariyadhammassa asotukamyataṃ pahātuṃ upārambhacittataṃ pahātuṃ. Katame tayo? Uddhaccaṃ pahāya, asaṃvaraṃ pahāya, dussīlyaṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo ariyānaṃ adassanakamyataṃ pahātuṃ ariyadhammassa asotukamyataṃ pahātuṃ upārambhacittataṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo uddhaccaṃ pahātuṃ asaṃvaraṃ pahātuṃ dussīlyaṃ pahātuṃ. Katame tayo? Assaddhiyaṃ pahāya, avadaññutaṃ pahāya, kosajjaṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo uddhaccaṃ pahātuṃ asaṃvaraṃ pahātuṃ dussīlyaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo assaddhiyaṃ pahātuṃ avadaññutaṃ pahātuṃ kosajjaṃ pahātuṃ. Katame tayo? Anādariyaṃ pahāya, dovacassataṃ pahāya, pāpamittataṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo assaddhiyaṃ pahātuṃ avadaññutaṃ pahātuṃ kosajjaṃ pahātuṃ. ‘‘Tayome, bhikkhave, dhamme pahāya bhabbo anādariyaṃ pahātuṃ dovacassataṃ pahātuṃ pāpamittataṃ pahātuṃ. Katame tayo? Ahirikaṃ pahāya, anottappaṃ pahāya, pamādaṃ pahāya – ime kho, bhikkhave, tayo dhamme pahāya bhabbo anādariyaṃ pahātuṃ dovacassataṃ pahātuṃ pāpamittataṃ pahātuṃ. ‘‘Hirīmāyaṃ, bhikkhave, ottāpī appamatto hoti. So appamatto samāno bhabbo anādariyaṃ pahātuṃ dovacassataṃ pahātuṃ pāpamittataṃ pahātuṃ. So kalyāṇamitto samāno bhabbo assaddhiyaṃ pahātuṃ avadaññutaṃ pahātuṃ kosajjaṃ pahātuṃ. So āraddhavīriyo samāno bhabbo uddhaccaṃ pahātuṃ asaṃvaraṃ pahātuṃ dussīlyaṃ pahātuṃ. So sīlavā samāno bhabbo ariyānaṃ adassanakamyataṃ pahātuṃ ariyadhammassa asotukamyataṃ pahātuṃ upārambhacittataṃ pahātuṃ. So anupārambhacitto samāno bhabbo muṭṭhassaccaṃ pahātuṃ asampajaññaṃ pahātuṃ cetaso vikkhepaṃ pahātuṃ. So avikkhittacitto samāno bhabbo ayonisomanasikāraṃ pahātuṃ kummaggasevanaṃ pahātuṃ cetaso līnattaṃ pahātuṃ. So alīnacitto samāno bhabbo sakkāyadiṭṭhiṃ pahātuṃ vicikicchaṃ pahātuṃ sīlabbataparāmāsaṃ pahātuṃ. So avicikiccho samāno bhabbo rāgaṃ pahātuṃ dosaṃ pahātuṃ mohaṃ pahātuṃ. So rāgaṃ pahāya dosaṃ pahāya mohaṃ pahāya bhabbo jātiṃ pahātuṃ jaraṃ pahātuṃ maraṇaṃ pahātu’’nti. Chaṭṭhaṃ.",
      "english": "“Monastics, these three phenomena would not exist in the world, a Tathāgata, an Arahant, a Fully Self-Enlightened One, would not arise in the world, nor would the Dhamma and Discipline proclaimed by the Tathāgata shine forth in the world. Which three? Birth, aging, and death. Indeed, monastics, if these three phenomena did not exist in the world, a Tathāgata, an Arahant, a Fully Self-Enlightened One, would not arise in the world, nor would the Dhamma and Discipline proclaimed by the Tathāgata shine forth in the world. And since, monastics, these three phenomena do exist in the world, therefore a Tathāgata, an Arahant, a Fully Self-Enlightened One, arises in the world, and therefore the Dhamma and Discipline proclaimed by the Tathāgata shines forth in the world.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning birth, abandoning aging, and abandoning death. Which three? Without abandoning lust, without abandoning hatred, and without abandoning delusion. Indeed, monastics, without abandoning these three things, one is incapable of abandoning birth, abandoning aging, and abandoning death.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning lust, abandoning hatred, and abandoning delusion. Which three? Without abandoning identity view, without abandoning doubt, and without abandoning adherence to rites and rituals. Indeed, monastics, without abandoning these three things, one is incapable of abandoning lust, abandoning hatred, and abandoning delusion.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning identity view, abandoning doubt, and abandoning adherence to rites and rituals. Which three? Without abandoning unwise attention, without abandoning association with a wrong path, and without abandoning mental sluggishness. Indeed, monastics, without abandoning these three things, one is incapable of abandoning identity view, abandoning doubt, and abandoning adherence to rites and rituals.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning unwise attention, abandoning association with a wrong path, and abandoning mental sluggishness. Which three? Without abandoning forgetfulness, without abandoning lack of clear comprehension, and without abandoning mental distraction. Indeed, monastics, without abandoning these three things, one is incapable of abandoning unwise attention, abandoning association with a wrong path, and abandoning mental sluggishness.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning forgetfulness, abandoning lack of clear comprehension, and abandoning mental distraction. Which three? Without abandoning the desire not to see noble ones, without abandoning the desire not to hear the noble Dhamma, and without abandoning a fault-finding mind. Indeed, monastics, without abandoning these three things, one is incapable of abandoning forgetfulness, abandoning lack of clear comprehension, and abandoning mental distraction.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning the desire not to see noble ones, abandoning the desire not to hear the noble Dhamma, and abandoning a fault-finding mind. Which three? Without abandoning restlessness, without abandoning lack of restraint, and without abandoning immorality. Indeed, monastics, without abandoning these three things, one is incapable of abandoning the desire not to see noble ones, abandoning the desire not to hear the noble Dhamma, and abandoning a fault-finding mind.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning restlessness, abandoning lack of restraint, and abandoning immorality. Which three? Without abandoning lack of faith, without abandoning ingratitude, and without abandoning laziness. Indeed, monastics, without abandoning these three things, one is incapable of abandoning restlessness, abandoning lack of restraint, and abandoning immorality.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning lack of faith, abandoning ingratitude, and abandoning laziness. Which three? Without abandoning disrespect, without abandoning unruliness, and without abandoning evil companionship. Indeed, monastics, without abandoning these three things, one is incapable of abandoning lack of faith, abandoning ingratitude, and abandoning laziness.\n\n“Monastics, without abandoning these three things, one is incapable of abandoning disrespect, abandoning unruliness, and abandoning evil companionship. Which three? Without abandoning shamelessness, without abandoning fearlessness of wrongdoing, and without abandoning heedlessness. Indeed, monastics, without abandoning these three things, one is incapable of abandoning disrespect, abandoning unruliness, and abandoning evil companionship.\n\n“Monastics, one who is shameless and fearless of wrongdoing is heedless. Being heedless, such a person is incapable of abandoning disrespect, abandoning unruliness, and abandoning evil companionship. Being one with evil companionship, such a person is incapable of abandoning lack of faith, abandoning ingratitude, and abandoning laziness. Being lazy, such a person is incapable of abandoning restlessness, abandoning lack of restraint, and abandoning immorality. Being immoral, such a person is incapable of abandoning the desire not to see noble ones, abandoning the desire not to hear the noble Dhamma, and abandoning a fault-finding mind. Being fault-finding, such a person is incapable of abandoning forgetfulness, abandoning lack of clear comprehension, and abandoning mental distraction. Being mentally distracted, such a person is incapable of abandoning unwise attention, abandoning association with a wrong path, and abandoning mental sluggishness.\n\nWhen one is dispirited, one is unable to abandon identity view, to abandon doubtful wavering, or to abandon clinging to rites and rituals. When one is doubtfully wavering, one is unable to abandon lust, to abandon aversion, or to abandon delusion. Without abandoning lust, without abandoning aversion, and without abandoning delusion, one is unable to abandon birth, to abandon aging, or to abandon death.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning birth, aging, and death. Which three? By abandoning lust, by abandoning aversion, by abandoning delusion – by abandoning these three qualities, monks, one is capable of abandoning birth, aging, and death.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning lust, aversion, and delusion. Which three? By abandoning identity view, by abandoning doubtful wavering, by abandoning clinging to rites and rituals – by abandoning these three qualities, monks, one is capable of abandoning lust, aversion, and delusion.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning identity view, doubtful wavering, and clinging to rites and rituals. Which three? By abandoning unwise attention, by abandoning resorting to a wrong path, by abandoning mental sluggishness – by abandoning these three qualities, monks, one is capable of abandoning identity view, doubtful wavering, and clinging to rites and rituals.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning unwise attention, resorting to a wrong path, and mental sluggishness. Which three? By abandoning forgotten mindfulness, by abandoning lack of clear comprehension, by abandoning mental distraction – by abandoning these three qualities, monks, one is capable of abandoning unwise attention, resorting to a wrong path, and mental sluggishness.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning forgotten mindfulness, lack of clear comprehension, and mental distraction. Which three? By abandoning the desire not to see noble ones, by abandoning the desire not to hear the Dhamma of the noble ones, by abandoning a fault-finding mind – by abandoning these three qualities, monks, one is capable of abandoning forgotten mindfulness, lack of clear comprehension, and mental distraction.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning the desire not to see noble ones, the desire not to hear the Dhamma of the noble ones, and a fault-finding mind. Which three? By abandoning restlessness, by abandoning lack of restraint, by abandoning immorality – by abandoning these three qualities, monks, one is capable of abandoning the desire not to see noble ones, the desire not to hear the Dhamma of the noble ones, and a fault-finding mind.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning restlessness, lack of restraint, and immorality. Which three? By abandoning lack of faith, by abandoning unwillingness to listen to advice, by abandoning laziness – by abandoning these three qualities, monks, one is capable of abandoning restlessness, lack of restraint, and immorality.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning lack of faith, unwillingness to listen to advice, and laziness. Which three? By abandoning disrespect, by abandoning stubbornness, by abandoning bad companionship – by abandoning these three qualities, monks, one is capable of abandoning lack of faith, unwillingness to listen to advice, and laziness.\n\n“Monks, by abandoning these three qualities, one is capable of abandoning disrespect, stubbornness, and bad companionship. Which three? By abandoning shamelessness, by abandoning fearlessness of wrongdoing, by abandoning heedlessness – by abandoning these three qualities, monks, one is capable of abandoning disrespect, stubbornness, and bad companionship.\n\n“Monks, one who possesses moral shame and moral dread is diligent. Being diligent, one is capable of abandoning disrespect, stubbornness, and bad companionship. Being a good friend, one is capable of abandoning lack of faith, unwillingness to listen to advice, and laziness. Being energetic, one is capable of abandoning restlessness, lack of restraint, and immorality. Being virtuous, one is capable of abandoning the desire not to see noble ones, the desire not to hear the Dhamma of the noble ones, and a fault-finding mind. Being free from a fault-finding mind, one is capable of abandoning forgotten mindfulness, lack of clear comprehension, and mental distraction. Being undistracted in mind, one is capable of abandoning unwise attention, resorting to a wrong path, and mental sluggishness. Being undepressed in mind, one is capable of abandoning identity view, doubtful wavering, and clinging to rites and rituals. Being free from doubtful wavering, one is capable of abandoning lust, aversion, and delusion. Having abandoned lust, having abandoned aversion, and having abandoned delusion, one is capable of abandoning birth, aging, and death.”",
      "sinhala": "මහණෙනි, මේ ධර්ම තුන ලෝකයේ නොවන්නේ නම්, රහත් වූ සම්මාසම්බුදු තථාගතයන් වහන්සේ නමක් ලොව පහළ නොවන්නේය, තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය​විනය ලෝකයේ බැබළෙන්නේ ද නැත. ඒ තුන කවරේද? ජාතිය ද, ජරාව ද, මරණය ද යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ලෝකයේ නොවන්නේ නම්, රහත් වූ සම්මාසම්බුදු තථාගතයන් වහන්සේ නමක් ලොව පහළ නොවන්නේය, තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය​විනය ලෝකයේ බැබළෙන්නේ ද නැත. මහණෙනි, යම් හෙයකින් මේ ධර්ම තුන ලෝකයේ පවතීද, එහෙයින් රහත් වූ සම්මාසම්බුදු තථාගතයන් වහන්සේ නමක් ලොව පහළ වෙති, එහෙයින් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්මය​විනය ලෝකයේ බැබළෙයි.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, ජාතිය ප් U+0DCA U+200D රහීණ කිරීමට ද, ජරාව ප් U+0DCA U+200D රහීණ කිරීමට ද, මරණය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? රාගය ප් U+0DCA U+200D රහීණ නොකර, ද්වේෂය ප් U+0DCA U+200D රහීණ නොකර, මෝහය ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, ජාතිය ප් U+0DCA U+200D රහීණ කිරීමට ද, ජරාව ප් U+0DCA U+200D රහීණ කිරීමට ද, මරණය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, රාගය ප් U+0DCA U+200D රහීණ කිරීමට ද, ද්වේෂය ප් U+0DCA U+200D රහීණ කිරීමට ද, මෝහය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? සක්කායදිට්ඨිය ප් U+0DCA U+200D රහීණ නොකර, විචිකිච්ඡාව ප් U+0DCA U+200D රහීණ නොකර, සීලබ්බතපරාමාසය ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, රාගය ප් U+0DCA U+200D රහීණ කිරීමට ද, ද්වේෂය ප් U+0DCA U+200D රහීණ කිරීමට ද, මෝහය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, සක්කායදිට්ඨිය ප් U+0DCA U+200D රහීණ කිරීමට ද, විචිකිච්ඡාව ප් U+0DCA U+200D රහීණ කිරීමට ද, සීලබ්බතපරාමාසය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? අයෝනිසෝමනසිකාරය ප් U+0DCA U+200D රහීණ නොකර, කුම්මග්ගසේවනය ප් U+0DCA U+200D රහීණ නොකර, සිතේ ලීනත්වය ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, සක්කායදිට්ඨිය ප් U+0DCA U+200D රහීණ කිරීමට ද, විචිකිච්ඡාව ප් U+0DCA U+200D රහීණ කිරීමට ද, සීලබ්බතපරාමාසය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, අයෝනිසෝමනසිකාරය ප් U+0DCA U+200D රහීණ කිරීමට ද, කුම්මග්ගසේවනය ප් U+0DCA U+200D රහීණ කිරීමට ද, සිතේ ලීනත්වය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? මුට්ඨසච්චය ප් U+0DCA U+200D රහීණ නොකර, අසම්පජඤ්ඤය ප් U+0DCA U+200D රහීණ නොකර, සිතේ වික් U+0DCA U+200D ෂේපය ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, අයෝනිසෝමනසිකාරය ප් U+0DCA U+200D රහීණ කිරීමට ද, කුම්මග්ගසේවනය ප් U+0DCA U+200D රහීණ කිරීමට ද, සිතේ ලීනත්වය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, මුට්ඨසච්චය ප් U+0DCA U+200D රහීණ කිරීමට ද, අසම්පජඤ්ඤය ප් U+0DCA U+200D රහීණ කිරීමට ද, සිතේ වික් U+0DCA U+200D ෂේපය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? ආර් U+0DCA U+200D යයන් වහන්සේලා නොදැකීමට කැමති බව ප් U+0DCA U+200D රහීණ නොකර, ආර්ය ධර්මය නොඇසීමට කැමති බව ප් U+0DCA U+200D රහීණ නොකර, උපාරම්භචිත්ත බව ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, මුට්ඨසච්චය ප් U+0DCA U+200D රහීණ කිරීමට ද, අසම්පජඤ්ඤය ප් U+0DCA U+200D රහීණ කිරීමට ද, සිතේ වික් U+0DCA U+200D ෂේපය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, ආර් U+0DCA U+200D යයන් වහන්සේලා නොදැකීමට කැමති බව ප් U+0DCA U+200D රහීණ කිරීමට ද, ආර්ය ධර්මය නොඇසීමට කැමති බව ප් U+0DCA U+200D රහීණ කිරීමට ද, උපාරම්භචිත්ත බව ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? උද්ධච්චය ප් U+0DCA U+200D රහීණ නොකර, අසංවරය ප් U+0DCA U+200D රහීණ නොකර, දුස්සීලය ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, ආර් U+0DCA U+200D යයන් වහන්සේලා නොදැකීමට කැමති බව ප් U+0DCA U+200D රහීණ කිරීමට ද, ආර්ය ධර්මය නොඇසීමට කැමති බව ප් U+0DCA U+200D රහීණ කිරීමට ද, උපාරම්භචිත්ත බව ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, උද්ධච්චය ප් U+0DCA U+200D රහීණ කිරීමට ද, අසංවරය ප් U+0DCA U+200D රහීණ කිරීමට ද, දුස්සීලය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? අශ් U+0DCA U+200D රද්ධාව ප් U+0DCA U+200D රහීණ නොකර, අවදඤ්ඤුතාව ප් U+0DCA U+200D රහීණ නොකර, කෝසජ්ජය ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, උද්ධච්චය ප් U+0DCA U+200D රහීණ කිරීමට ද, අසංවරය ප් U+0DCA U+200D රහීණ කිරීමට ද, දුස්සීලය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, අශ් U+0DCA U+200D රද්ධාව ප් U+0DCA U+200D රහීණ කිරීමට ද, අවදඤ්ඤුතාව ප් U+0DCA U+200D රහීණ කිරීමට ද, කෝසජ්ජය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? අනාදරය ප් U+0DCA U+200D රහීණ නොකර, දෝවචස්සතාව ප් U+0DCA U+200D රහීණ නොකර, පාපමිත් U+0DCA U+200D රතාව ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, අශ් U+0DCA U+200D රද්ධාව ප් U+0DCA U+200D රහීණ කිරීමට ද, අවදඤ්ඤුතාව ප් U+0DCA U+200D රහීණ කිරීමට ද, කෝසජ්ජය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, අනාදරය ප් U+0DCA U+200D රහීණ කිරීමට ද, දෝවචස්සතාව ප් U+0DCA U+200D රහීණ කිරීමට ද, පාපමිත් U+0DCA U+200D රතාව ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ තුන කවරේද? අහිරිකය ප් U+0DCA U+200D රහීණ නොකර, අනොත්තප්පය ප් U+0DCA U+200D රහීණ නොකර, ප් U+0DCA U+200D රමාදය ප් U+0DCA U+200D රහීණ නොකර යන මේ ධර්ම තුනයි. මහණෙනි, මේ ධර්ම තුන ප් U+0DCA U+200D රහීණ නොකරන්නේ නම්, අනාදරය ප් U+0DCA U+200D රහීණ කිරීමට ද, දෝවචස්සතාව ප් U+0DCA U+200D රහීණ කිරීමට ද, පාපමිත් U+0DCA U+200D රතාව ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nමහණෙනි, ලජ්ජා නැති, පවට බිය නැති, ප් U+0DCA U+200D රමාදවූවෙක් වෙයි. ඒ ප් U+0DCA U+200D රමාදවූවෙක් වන හෙයින් අනාදරය ප් U+0DCA U+200D රහීණ කිරීමට ද, දෝවචස්සතාව ප් U+0DCA U+200D රහීණ කිරීමට ද, පාපමිත් U+0DCA U+200D රතාව ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ පාපමිත්‍රයෙක් වන හෙයින් අශ් U+0DCA U+200D රද්ධාව ප් U+0DCA U+200D රහීණ කිරීමට ද, අවදඤ්ඤුතාව ප් U+0DCA U+200D රහීණ කිරීමට ද, කෝසජ්ජය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ කුසීතයෙක් වන හෙයින් උද්ධච්චය ප් U+0DCA U+200D රහීණ කිරීමට ද, අසංවරය ප් U+0DCA U+200D රහීණ කිරීමට ද, දුස්සීලය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ දුස්සීලයෙක් වන හෙයින් ආර් U+0DCA U+200D යයන් වහන්සේලා නොදැකීමට කැමති බව ප් U+0DCA U+200D රහීණ කිරීමට ද, ආර්ය ධර්මය නොඇසීමට කැමති බව ප් U+0DCA U+200D රහීණ කිරීමට ද, උපාරම්භචිත්ත බව ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ උපාරම්භචිත්ත ඇති කෙනෙක් වන හෙයින් මුට්ඨසච්චය ප් U+0DCA U+200D රහීණ කිරීමට ද, අසම්පජඤ්ඤය ප් U+0DCA U+200D රහීණ කිරීමට ද, සිතේ වික් U+0DCA U+200D ෂේපය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය. ඒ වික් U+0DCA U+200D ෂිප්ත සිත් ඇති කෙනෙක් වන හෙයින් අයෝනිසෝමනසිකාරය ප් U+0DCA U+200D රහීණ කිරීමට ද, කුම්මග්ගසේවනය ප් U+0DCA U+200D රහීණ කිරීමට ද, සිතේ ලීනත්වය ප් U+0DCA U+200D රහීණ කිරීමට ද අභව් U+0DCA U+200D යය, නොහැකිය.\n\nලීනචිත්ත වූ ඔහුට සක්කායදිට්ඨිය ප්‍රහාණය කිරීමටත්, විචිකිච්ඡාව ප්‍රහාණය කිරීමටත්, සීලබ්බතපරාමාසය ප්‍රහාණය කිරීමටත් නොහැක්කේය. විචිකිච්ඡා ඇති ඔහුට රාගය ප්‍රහාණය කිරීමටත්, ද්වේෂය ප්‍රහාණය කිරීමටත්, මෝහය ප්‍රහාණය කිරීමටත් නොහැක්කේය. රාගය ප්‍රහාණය නොකර, ද්වේෂය ප්‍රහාණය නොකර, මෝහය ප්‍රහාණය නොකර ඔහුට ජාතිය ප්‍රහාණය කිරීමටත්, ජරාව ප්‍රහාණය කිරීමටත්, මරණය ප්‍රහාණය කිරීමටත් නොහැක්කේය.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් ජාතිය ප්‍රහාණය කිරීමටත්, ජරාව ප්‍රහාණය කිරීමටත්, මරණය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? රාගය ප්‍රහාණය කිරීමෙන්, ද්වේෂය ප්‍රහාණය කිරීමෙන්, මෝහය ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් ජාතිය ප්‍රහාණය කිරීමටත්, ජරාව ප්‍රහාණය කිරීමටත්, මරණය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් රාගය ප්‍රහාණය කිරීමටත්, ද්වේෂය ප්‍රහාණය කිරීමටත්, මෝහය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? සක්කායදිට්ඨිය ප්‍රහාණය කිරීමෙන්, විචිකිච්ඡාව ප්‍රහාණය කිරීමෙන්, සීලබ්බතපරාමාසය ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් රාගය ප්‍රහාණය කිරීමටත්, ද්වේෂය ප්‍රහාණය කිරීමටත්, මෝහය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් සක්කායදිට්ඨිය ප්‍රහාණය කිරීමටත්, විචිකිච්ඡාව ප්‍රහාණය කිරීමටත්, සීලබ්බතපරාමාසය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? අයෝනිසෝමනසිකාරය ප්‍රහාණය කිරීමෙන්, කුම්මග්ගසේවනය ප්‍රහාණය කිරීමෙන්, චේතසෝ ලීනත්වය ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් සක්කායදිට්ඨිය ප්‍රහාණය කිරීමටත්, විචිකිච්ඡාව ප්‍රහාණය කිරීමටත්, සීලබ්බතපරාමාසය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් අයෝනිසෝමනසිකාරය ප්‍රහාණය කිරීමටත්, කුම්මග්ගසේවනය ප්‍රහාණය කිරීමටත්, චේතසෝ ලීනත්වය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? මුට්ඨසතිය ප්‍රහාණය කිරීමෙන්, අසම්පජඤ්ඤය ප්‍රහාණය කිරීමෙන්, චේතසෝ වික්ඛේපය ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් අයෝනිසෝමනසිකාරය ප්‍රහාණය කිරීමටත්, කුම්මග්ගසේවනය ප්‍රහාණය කිරීමටත්, චේතසෝ ලීනත්වය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් මුට්ඨසතිය ප්‍රහාණය කිරීමටත්, අසම්පජඤ්ඤය ප්‍රහාණය කිරීමටත්, චේතසෝ වික්ඛේපය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? ආර්යයන් නොදැකීමට කැමති බව ප්‍රහාණය කිරීමෙන්, ආර්යධර්මය නොඇසීමට කැමති බව ප්‍රහාණය කිරීමෙන්, උපාරම්භචිත්ත බව ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් මුට්ඨසතිය ප්‍රහාණය කිරීමටත්, අසම්පජඤ්ඤය ප්‍රහාණය කිරීමටත්, චේතසෝ වික්ඛේපය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් ආර්යයන් නොදැකීමට කැමති බව ප්‍රහාණය කිරීමටත්, ආර්යධර්මය නොඇසීමට කැමති බව ප්‍රහාණය කිරීමටත්, උපාරම්භචිත්ත බව ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? උද්ධච්චය ප්‍රහාණය කිරීමෙන්, අසංවරය ප්‍රහාණය කිරීමෙන්, දුස්සීල්‍යය ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් ආර්යයන් නොදැකීමට කැමති බව ප්‍රහාණය කිරීමටත්, ආර්යධර්මය නොඇසීමට කැමති බව ප්‍රහාණය කිරීමටත්, උපාරම්භචිත්ත බව ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් උද්ධච්චය ප්‍රහාණය කිරීමටත්, අසංවරය ප්‍රහාණය කිරීමටත්, දුස්සීල්‍යය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? අසද්ධිය ප්‍රහාණය කිරීමෙන්, අවවාද නොපිළිගන්නා බව ප්‍රහාණය කිරීමෙන්, කෝසජ්ජය ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් උද්ධච්චය ප්‍රහාණය කිරීමටත්, අසංවරය ප්‍රහාණය කිරීමටත්, දුස්සීල්‍යය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් අසද්ධිය ප්‍රහාණය කිරීමටත්, අවවාද නොපිළිගන්නා බව ප්‍රහාණය කිරීමටත්, කෝසජ්ජය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? අනාදරය ප්‍රහාණය කිරීමෙන්, අවවාදයට අකීකරු බව ප්‍රහාණය කිරීමෙන්, පාපමිත්‍රතාව ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් අසද්ධිය ප්‍රහාණය කිරීමටත්, අවවාද නොපිළිගන්නා බව ප්‍රහාණය කිරීමටත්, කෝසජ්ජය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් අනාදරය ප්‍රහාණය කිරීමටත්, අවවාදයට අකීකරු බව ප්‍රහාණය කිරීමටත්, පාපමිත්‍රතාව ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කවරවාද ඒ තුන? අහිරිකය ප්‍රහාණය කිරීමෙන්, අනොත්තප්පය ප්‍රහාණය කිරීමෙන්, ප්‍රමාදය ප්‍රහාණය කිරීමෙන් – මහණෙනි, මේ ධර්ම තුන ප්‍රහාණය කිරීමෙන් අනාදරය ප්‍රහාණය කිරීමටත්, අවවාදයට අකීකරු බව ප්‍රහාණය කිරීමටත්, පාපමිත්‍රතාව ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\n\n\"මහණෙනි, හිරි ඇති, ඔතප් ඇති තැනැත්තා අප්‍රමාදී වෙයි. අප්‍රමාදී වූ ඔහුට අනාදරය ප්‍රහාණය කිරීමටත්, අවවාදයට අකීකරු බව ප්‍රහාණය කිරීමටත්, පාපමිත්‍රතාව ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. කල්‍යාණමිත්‍ර වූ ඔහුට අසද්ධිය ප්‍රහාණය කිරීමටත්, අවවාද නොපිළිගන්නා බව ප්‍රහාණය කිරීමටත්, කෝසජ්ජය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. ආරද්ධවීර්ය වූ ඔහුට උද්ධච්චය ප්‍රහාණය කිරීමටත්, අසංවරය ප්‍රහාණය කිරීමටත්, දුස්සීල්‍යය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. සිල්වත් වූ ඔහුට ආර්යයන් නොදැකීමට කැමති බව ප්‍රහාණය කිරීමටත්, ආර්යධර්මය නොඇසීමට කැමති බව ප්‍රහාණය කිරීමටත්, උපාරම්භචිත්ත බව ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. අනුපාරම්භචිත්ත වූ ඔහුට මුට්ඨසතිය ප්‍රහාණය කිරීමටත්, අසම්පජඤ්ඤය ප්‍රහාණය කිරීමටත්, චේතසෝ වික්ඛේපය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. අවික්ඛිප්තචිත්ත වූ ඔහුට අයෝනිසෝමනසිකාරය ප්‍රහාණය කිරීමටත්, කුම්මග්ගසේවනය ප්‍රහාණය කිරීමටත්, චේතසෝ ලීනත්වය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. අලීනචිත්ත වූ ඔහුට සක්කායදිට්ඨිය ප්‍රහාණය කිරීමටත්, විචිකිච්ඡාව ප්‍රහාණය කිරීමටත්, සීලබ්බතපරාමාසය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. අවිචිකිච්ඡා ඇති ඔහුට රාගය ප්‍රහාණය කිරීමටත්, ද්වේෂය ප්‍රහාණය කිරීමටත්, මෝහය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි. රාගය ප්‍රහාණය කිරීමෙන්, ද්වේෂය ප්‍රහාණය කිරීමෙන්, මෝහය ප්‍රහාණය කිරීමෙන් ජාතිය ප්‍රහාණය කිරීමටත්, ජරාව ප්‍රහාණය කිරීමටත්, මරණය ප්‍රහාණය කිරීමටත් සමර්ථ වෙයි.\"",
      "paliTitle": "Tayodhammasuttaṃ",
      "englishTitle": "The Discourse on Three Principles",
      "sinhalaTitle": "ත්‍රිධර්ම සූත්‍රය"
    },
    {
      "number": 77,
      "pali": "‘‘Dasahi, bhikkhave, asaddhammehi samannāgato kāko. Katamehi dasahi? Dhaṃsī ca, pagabbho ca, tintiṇo [nillajjo (ka.) tintiṇoti tintiṇaṃ vuccati taṇhā… (sī. syā. aṭṭha.) abhidhamme khuddakavatthuvibhaṅge tintiṇapadaniddese passitabbaṃ] ca, mahagghaso ca, luddo ca, akāruṇiko ca, dubbalo ca, oravitā ca, muṭṭhassati ca, necayiko [nerasiko (sī.) tadaṭṭhakathāyaṃ pana ‘‘necayiko’’ tveva dissati] ca – imehi kho, bhikkhave, dasahi asaddhammehi samannāgato kāko. Evamevaṃ kho, bhikkhave, dasahi asaddhammehi samannāgato pāpabhikkhu. Katamehi dasahi? Dhaṃsī ca, pagabbho ca, tintiṇo ca, mahagghaso ca, luddo ca, akāruṇiko ca, dubbalo ca, oravitā ca, muṭṭhassati ca, necayiko ca – imehi kho, bhikkhave, dasahi asaddhammehi samannāgato pāpabhikkhū’’ti. Sattamaṃ.",
      "english": "Monks, a crow is endowed with ten unwholesome qualities. Which ten? They are destructive, presumptuous, insatiably greedy, voracious, cruel, pitiless, morally weak, clamorous, heedless, and hoarding. Monks, a crow is endowed with these ten unwholesome qualities.\n\nSimilarly, monks, a wicked monk is endowed with these ten unwholesome qualities. Which ten? They are destructive, presumptuous, insatiably greedy, voracious, cruel, pitiless, morally weak, clamorous, heedless, and hoarding. Monks, a wicked monk is endowed with these ten unwholesome qualities.",
      "sinhala": "මහණෙනි, කපුටා දස අසද්ධර්‍මයන්ගෙන් යුක්ත වෙයි. කවර දසයකින් ද?\nවිනාශකාරී වීම, දඩබ්බර වීම, තෘෂ්ණාධික වීම, මහා කෑදර වීම, කුරිරු වීම, අකරුණාවන්ත වීම, දුර්වල වීම, ඝෝෂාකාරී වීම, සිහි මුළා වූවකු වීම, රැස් කිරීමට ගිජු වීම යන මේ දස අසද්ධර්‍මයන්ගෙන් කපුටා යුක්ත වෙයි.\n\nඑලෙසින් ම මහණෙනි, පාපී භික්ෂුව ද දස අසද්ධර්‍මයන්ගෙන් යුක්ත වෙයි. කවර දසයකින් ද?\nවිනාශකාරී වීම, දඩබ්බර වීම, තෘෂ්ණාධික වීම, මහා කෑදර වීම, කුරිරු වීම, අකරුණාවන්ත වීම, දුර්වල වීම, ඝෝෂාකාරී වීම, සිහි මුළා වූවකු වීම, රැස් කිරීමට ගිජු වීම යන මේ දස අසද්ධර්‍මයන්ගෙන් පාපී භික්ෂුව යුක්ත වෙයි.",
      "paliTitle": "Kākasuttaṃ",
      "englishTitle": "The Crow Sutta",
      "sinhalaTitle": "කාකසූත්‍රය"
    },
    {
      "number": 78,
      "pali": "‘‘Dasahi, bhikkhave, asaddhammehi samannāgatā nigaṇṭhā. Katamehi dasahi? Assaddhā, bhikkhave, nigaṇṭhā; dussīlā, bhikkhave, nigaṇṭhā; ahirikā, bhikkhave, nigaṇṭhā; anottappino, bhikkhave, nigaṇṭhā; asappurisasambhattino, bhikkhave, nigaṇṭhā; attukkaṃsakaparavambhakā, bhikkhave, nigaṇṭhā; sandiṭṭhiparāmāsā ādhānaggāhī duppaṭinissaggino, bhikkhave, nigaṇṭhā; kuhakā, bhikkhave, nigaṇṭhā; pāpicchā, bhikkhave, nigaṇṭhā; pāpamittā, bhikkhave, nigaṇṭhā – imehi kho, bhikkhave, dasahi asaddhammehi samannāgatā nigaṇṭhā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, the Jain ascetics are endowed with ten ignoble qualities. Which ten?\n\nMonks, the Jain ascetics are faithless; monks, the Jain ascetics are unvirtuous; monks, the Jain ascetics are shameless; monks, the Jain ascetics are fearless of wrongdoing; monks, the Jain ascetics associate with ignoble persons; monks, the Jain ascetics exalt themselves and disparage others; monks, the Jain ascetics cling to their own views, holding them stubbornly and being unwilling to relinquish them; monks, the Jain ascetics are deceptive; monks, the Jain ascetics have evil wishes; monks, the Jain ascetics have bad companions. Indeed, monks, the Jain ascetics are endowed with these ten ignoble qualities.",
      "sinhala": "භික්ෂූනි, නිගණ්ඨයෝ මේ දස අසද්ධර්මයන්ගෙන් යුක්ත වෙති. ඒ කවර දසයෙක්ද? භික්ෂූනි, නිගණ්ඨයෝ ශ‍්‍රද්ධා විරහිතයෝ වෙති; භික්ෂූනි, නිගණ්ඨයෝ දුශ්ශීලයෝ වෙති; භික්ෂූනි, නිගණ්ඨයෝ හිරි නැත්තෝ වෙති; භික්ෂූනි, නිගණ්ඨයෝ ඔතප් නැත්තෝ වෙති; භික්ෂූනි, නිගණ්ඨයෝ අසත්පුරුෂයන් ඇසුරු කරන්නෝ වෙති; භික්ෂූනි, නිගණ්ඨයෝ තමන් වර්ණනා කරන්නෝද, අනුන් හෙළා දකින්නෝද වෙති; භික්ෂූනි, නිගණ්ඨයෝ තමන්ගේ දෘෂ්ටිය දැඩිව අල්ලා ගන්නා, අත්නොහරින්නා වූ, දුරුකිරීමට අපහසු දෘෂ්ටි ඇත්තෝ වෙති; භික්ෂූනි, නිගණ්ඨයෝ කුහකයෝ වෙති; භික්ෂූනි, නිගණ්ඨයෝ පාපී අභිලාෂයන් ඇත්තෝ වෙති; භික්ෂූනි, නිගණ්ඨයෝ පාපමිත්‍රයෝ වෙති – භික්ෂූනි, නිගණ්ඨයෝ මේ දස අසද්ධර්මයන්ගෙන් යුක්තයෝ වෙති.",
      "paliTitle": "Nigaṇṭhasuttaṃ",
      "englishTitle": "The Nigaṇṭha Sutta",
      "sinhalaTitle": "නිගණ‍්ඨ සූත්‍රය"
    },
    {
      "number": 79,
      "pali": "[a. ni. 9.29] ‘‘Dasayimāni, bhikkhave, āghātavatthūni. Katamāni dasa? ‘Anatthaṃ me acarī’ti āghātaṃ bandhati; ‘anatthaṃ me caratī’ti āghātaṃ bandhati; ‘anatthaṃ me carissatī’ti āghātaṃ bandhati; ‘piyassa me manāpassa anatthaṃ acarī’ti…pe… ‘anatthaṃ caratī’ti…pe… ‘anatthaṃ carissatī’ti āghātaṃ bandhati, ‘appiyassa me amanāpassa atthaṃ acarī’ti…pe… ‘atthaṃ caratī’ti…pe… ‘atthaṃ carissatī’ti āghātaṃ bandhati; aṭṭhāne ca kuppati – imāni kho, bhikkhave, dasa āghātavatthūnī’’ti. Navamaṃ.",
      "english": "Monks, there are these ten grounds for ill-will. Which ten? One develops ill-will, thinking, \"He acted to my harm.\" One develops ill-will, thinking, \"He is acting to my harm.\" One develops ill-will, thinking, \"He will act to my harm.\" One develops ill-will, thinking, \"He acted to the harm of someone dear and pleasing to me.\" One develops ill-will, thinking, \"He is acting to the harm of someone dear and pleasing to me.\" One develops ill-will, thinking, \"He will act to the harm of someone dear and pleasing to me.\" One develops ill-will, thinking, \"He acted to the benefit of someone not dear and not pleasing to me.\" One develops ill-will, thinking, \"He is acting to the benefit of someone not dear and not pleasing to me.\" One develops ill-will, thinking, \"He will act to the benefit of someone not dear and not pleasing to me.\" And one gets angry without due cause. These, monks, are the ten grounds for ill-will.",
      "sinhala": "මහණෙනි, ද්වේෂය හටගන්නා කරුණු දසයක් වෙති. ඒ දසය කවරේද?\n\n‘මොහු මට අහිතක් කළේය’ යි ද්වේෂය බැඳගනී. ‘මොහු මට අහිතක් කරන්නේය’ යි ද්වේෂය බැඳගනී. ‘මොහු මට අහිතක් කරනු ඇත’ යි ද්වේෂය බැඳගනී. ‘මාගේ ප්‍රිය මනාප පුද්ගලයාට මොහු අහිතක් කළේය’ යි ද්වේෂය බැඳගනී. ‘මාගේ ප්‍රිය මනාප පුද්ගලයාට මොහු අහිතක් කරන්නේය’ යි ද්වේෂය බැඳගනී. ‘මාගේ ප්‍රිය මනාප පුද්ගලයාට මොහු අහිතක් කරනු ඇත’ යි ද්වේෂය බැඳගනී. ‘මාගේ අප්‍රිය අමනාප පුද්ගලයාට මොහු හිතක් කළේය’ යි ද්වේෂය බැඳගනී. ‘මාගේ අප්‍රිය අමනාප පුද්ගලයාට මොහු හිතක් කරන්නේය’ යි ද්වේෂය බැඳගනී. ‘මාගේ අප්‍රිය අමනාප පුද්ගලයාට මොහු හිතක් කරනු ඇත’ යි ද්වේෂය බැඳගනී. නුසුදුසු තැනකදීද කෝපයට පත්වේ. මහණෙනි, මේ දසය ද්වේෂය හටගන්නා කරුණු වෙති.",
      "paliTitle": "Āghātavatthusuttaṃ",
      "englishTitle": "Discourse on the Grounds for Resentment",
      "sinhalaTitle": "ආඝාත වස්තු සූත්‍රය"
    },
    {
      "number": 80,
      "pali": "‘‘Dasayime, bhikkhave, āghātapaṭivinayā. Katame dasa? ‘Anatthaṃ me acari, taṃ kutettha labbhā’ti āghātaṃ paṭivineti, ‘anatthaṃ me carati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti, ‘anatthaṃ me carissati, taṃ kutettha labbhā’ti āghātaṃ paṭivineti, piyassa me manāpassa anatthaṃ acari…pe… carati…pe… carissati, taṃ kutettha labbhāti āghātaṃ paṭivineti, appiyassa me amanāpassa atthaṃ acari…pe… atthaṃ carati…pe… atthaṃ carissati, taṃ kutettha labbhāti āghātaṃ paṭivineti, aṭṭhāne ca na kuppati – ime kho, bhikkhave, dasa āghātapaṭivinayā’’ti. Dasamaṃ. ",
      "english": "Monks, there are these ten ways of subduing resentment. Which ten? One subdues resentment with the thought: ‘He acted to my detriment; how can that be prevented?’ One subdues resentment with the thought: ‘He is acting to my detriment; how can that be prevented?’ One subdues resentment with the thought: ‘He will act to my detriment; how can that be prevented?’ One subdues resentment with the thought: ‘He acted to the detriment of my dear and agreeable one; how can that be prevented?’ One subdues resentment with the thought: ‘He is acting to the detriment of my dear and agreeable one; how can that be prevented?’ One subdues resentment with the thought: ‘He will act to the detriment of my dear and agreeable one; how can that be prevented?’ One subdues resentment with the thought: ‘He acted to the benefit of my unloved and disagreeable one; how can that be prevented?’ One subdues resentment with the thought: ‘He is acting to the benefit of my unloved and disagreeable one; how can that be prevented?’ One subdues resentment with the thought: ‘He will act to the benefit of my unloved and disagreeable one; how can that be prevented?’ And one does not become angry without sufficient cause. These, monks, are the ten ways of subduing resentment.",
      "sinhala": "මහණෙනි, ආඝාතය දුරු කිරීමේ ක‍්‍රම දසයකි. ඒ දසය කවරේද?\n\n‘මොහු මට අහිතක් කළේය, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n‘මොහු මට අහිතක් කරයි, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n‘මොහු මට අහිතක් කරනු ඇත, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n\n‘මාගේ ප්‍රිය මනාප කෙනෙකුට මොහු අහිතක් කළේය, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n‘මාගේ ප්‍රිය මනාප කෙනෙකුට මොහු අහිතක් කරයි, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n‘මාගේ ප්‍රිය මනාප කෙනෙකුට මොහු අහිතක් කරනු ඇත, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n\n‘මාගේ අප්‍රිය අමනාප කෙනෙකුට මොහු හිතක් කළේය, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n‘මාගේ අප්‍රිය අමනාප කෙනෙකුට මොහු හිතක් කරයි, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n‘මාගේ අප්‍රිය අමනාප කෙනෙකුට මොහු හිතක් කරනු ඇත, එය වෙනස් කළ හැකිද?’ යනුවෙන් ආඝාතය දුරු කරයි.\n\nතවද, නුසුදුසු කරුණක් නිසා නොකිපේ.\n\nමහණෙනි, ආඝාතය දුරු කිරීමේ ක‍්‍රම දසය මේවාය.",
      "paliTitle": "Āghātapaṭivinayasuttaṃ",
      "englishTitle": "Discourse on the Removal of Ill-will",
      "sinhalaTitle": "ආඝාත ප‍්‍රතික‍ර්ම සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Ākaṅkhavaggo tatiyo. Tassuddānaṃ – Ākaṅkho kaṇṭako iṭṭhā, vaḍḍhi ca migasālāya; Tayo dhammā ca kāko ca, nigaṇṭhā dve ca āghātāti.",
    "english": "The Third Chapter on Aspirations",
    "sinhala": "තෙවැනි ආකංඛ වග්‍ගය"
  }
}