{
  "id": "an10.5",
  "title": {
    "pali": "Akkosavaggo",
    "english": "Chapter on Abuse",
    "sinhala": "අක්‍රෝශ වග්ගය"
  },
  "sections": [
    {
      "number": 41,
      "pali": "Atha kho āyasmā upāli yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo, yena saṅghe bhaṇḍanakalahaviggahavivādā uppajjanti, bhikkhū ca na phāsu [phāsuṃ (?)] viharantī’’ti? ‘‘Idhupāli, bhikkhū adhammaṃ dhammoti dīpenti, dhammaṃ adhammoti dīpenti, avinayaṃ vinayoti dīpenti, vinayaṃ avinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti. Ayaṃ kho, upāli, hetu ayaṃ paccayo, yena saṅghe bhaṇḍanakalahaviggahavivādā uppajjanti, bhikkhū ca na phāsu viharantī’’ti. Paṭhamaṃ.",
      "english": "Then indeed, Venerable Upāli approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Seated to one side, Venerable Upāli said this to the Blessed One: \"Venerable sir, what is the cause, what is the condition, by which disputes, quarrels, conflicts, and contentions arise in the Saṅgha, and the bhikkhus do not dwell at ease?\"\n\n\"Here, Upāli, bhikkhus declare what is not Dhamma to be Dhamma, and what is Dhamma to be not Dhamma. They declare what is not Vinaya to be Vinaya, and what is Vinaya to be not Vinaya. They declare what was not spoken or uttered by the Tathāgata to have been spoken or uttered by the Tathāgata, and what was spoken or uttered by the Tathāgata to have been not spoken or not uttered by the Tathāgata. They declare what was not practiced by the Tathāgata to have been practiced by the Tathāgata, and what was practiced by the Tathāgata to have been not practiced by the Tathāgata. They declare what was not laid down by the Tathāgata to have been laid down by the Tathāgata, and what was laid down by the Tathāgata to have been not laid down by the Tathāgata. This indeed, Upāli, is the cause, this is the condition, by which disputes, quarrels, conflicts, and contentions arise in the Saṅgha, and the bhikkhus do not dwell at ease.\"",
      "sinhala": "ඉන්පසු ආයුෂ්මත් උපාලි භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ වැඳ එක් පසෙක වාඩිවිය. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් උපාලි භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"ස්වාමීනි, සංඝයා තුළ භේද, කලහ, විරෝධතා, වාද විවාද ඇතිවීමටත්, භික්ෂූන් වහන්සේලාට සැපසේ වාසය කිරීමට නොහැකිවීමටත් හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?\"\n\n\"උපාලි, මෙහිදී භික්ෂූන් වහන්සේලා අධර්මය ධර්මය යැයි දේශනා කරති. ධර්මය අධර්මය යැයි දේශනා කරති. අවිනය විනය යැයි දේශනා කරති. විනය අවිනය යැයි දේශනා කරති. තථාගතයන් වහන්සේ විසින් නොදෙසූ, නොකී දේ තථාගතයන් වහන්සේ විසින් දෙසූ, කී දේ යැයි දේශනා කරති. තථාගතයන් වහන්සේ විසින් දෙසූ, කී දේ තථාගතයන් වහන්සේ විසින් නොදෙසූ, නොකී දේ යැයි දේශනා කරති. තථාගතයන් වහන්සේ විසින් නොපැවති (නොඅනුගමනය කළ) දේ තථාගතයන් වහන්සේ විසින් පැවති (අනුගමනය කළ) දේ යැයි දේශනා කරති. තථාගතයන් වහන්සේ විසින් පැවති දේ තථාගතයන් වහන්සේ විසින් නොපැවති දේ යැයි දේශනා කරති. තථාගතයන් වහන්සේ විසින් නොපැනවූ දේ තථාගතයන් වහන්සේ විසින් පැනවූ දේ යැයි දේශනා කරති. තථාගතයන් වහන්සේ විසින් පැනවූ දේ තථාගතයන් වහන්සේ විසින් නොපැනවූ දේ යැයි දේශනා කරති. උපාලි, සංඝයා තුළ භේද, කලහ, විරෝධතා, වාද විවාද ඇතිවීමටත්, භික්ෂූන් වහන්සේලාට සැපසේ වාසය කිරීමට නොහැකිවීමටත් මෙයයි හේතුව, මෙයයි ප්‍රත්‍යය.\"",
      "paliTitle": "Vivādasuttaṃ"
    },
    {
      "number": 42,
      "pali": "‘‘Kati nu kho, bhante, vivādamūlānī’’ti? ‘‘Dasa kho, upāli, vivādamūlāni. Katamāni dasa? Idhupāli, bhikkhū adhammaṃ dhammoti dīpenti, dhammaṃ adhammoti dīpenti, avinayaṃ vinayoti dīpenti, vinayaṃ avinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti. Imāni kho, upāli, dasa vivādamūlānī’’ti. Dutiyaṃ.",
      "english": "“Venerable Sir, how many roots of contention are there?” “Upāli, there are indeed ten roots of contention. Which ten? Here, Upāli, monks declare non-Dhamma to be Dhamma, and declare Dhamma to be non-Dhamma; they declare non-Vinaya to be Vinaya, and declare Vinaya to be non-Vinaya; they declare what was not spoken or uttered by the Tathāgata to be spoken or uttered by the Tathāgata, and declare what was spoken or uttered by the Tathāgata to be not spoken or uttered by the Tathāgata; they declare what was not practiced by the Tathāgata to be practiced by the Tathāgata, and declare what was practiced by the Tathāgata to be not practiced by the Tathāgata; they declare what was not laid down by the Tathāgata to be laid down by the Tathāgata, and declare what was laid down by the Tathāgata to be not laid down by the Tathāgata. These, Upāli, are indeed the ten roots of contention.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, විවාද මූලයන් කීයක්‌ තිබේදැයි? උපාලි, විවාද මූලයන් දහයක්‌ ඇත. ඒ දහය කවරේද? උපාලි, මෙහි ඇතැම් භික්ෂූහු අධර්මය ධර්මය යැයි ප්‍රකාශ කරති. ධර්මය අධර්මය යැයි ප්‍රකාශ කරති. අවිනය විනය යැයි ප්‍රකාශ කරති. විනය අවිනය යැයි ප්‍රකාශ කරති. තථාගතයන් වහන්සේ විසින් නොදෙසූ, නොපැවසූ දේ තථාගතයන් වහන්සේ විසින් දෙසන ලද්දක්, පවසන ලද්දක් යැයි ප්‍රකාශ කරති. තථාගතයන් වහන්සේ විසින් දෙසන ලද, පවසන ලද දේ තථාගතයන් වහන්සේ විසින් නොදෙසූ, නොපැවසූ දේ යැයි ප්‍රකාශ කරති. තථාගතයන් වහන්සේ විසින් නොපිළිපදින ලද දේ තථාගතයන් වහන්සේ විසින් පිළිපදින ලද දේ යැයි ප්‍රකාශ කරති. තථාගතයන් වහන්සේ විසින් පිළිපදින ලද දේ තථාගතයන් වහන්සේ විසින් නොපිළිපදින ලද දේ යැයි ප්‍රකාශ කරති. තථාගතයන් වහන්සේ විසින් නොපනවන ලද දේ තථාගතයන් වහන්සේ විසින් පනවන ලද දේ යැයි ප්‍රකාශ කරති. තථාගතයන් වහන්සේ විසින් පනවන ලද දේ තථාගතයන් වහන්සේ විසින් නොපනවන ලද දේ යැයි ප්‍රකාශ කරති. උපාලි, මේවා විවාද මූලයන් දහය වේ.",
      "paliTitle": "Paṭhamavivādamūlasuttaṃ"
    },
    {
      "number": 43,
      "pali": "‘‘Kati nu kho, bhante, vivādamūlānī’’ti? ‘‘Dasa kho, upāli, vivādamūlāni. Katamāni dasa? Idhupāli, bhikkhū anāpattiṃ āpattīti dīpenti, āpattiṃ anāpattīti dīpenti, lahukaṃ āpattiṃ garukāpattīti dīpenti, garukaṃ āpattiṃ lahukāpattīti dīpenti, duṭṭhullaṃ āpattiṃ aduṭṭhullāpattīti dīpenti, aduṭṭhullaṃ āpattiṃ duṭṭhullāpattīti dīpenti, sāvasesaṃ āpattiṃ anavasesāpattīti dīpenti, anavasesaṃ āpattiṃ sāvasesāpattīti dīpenti, sappaṭikammaṃ āpattiṃ appaṭikammāpattīti dīpenti, appaṭikammaṃ āpattiṃ sappaṭikammāpattīti dīpenti. Imāni kho, upāli, dasa vivādamūlānī’’ti. Tatiyaṃ.",
      "english": "“How many roots of contention are there, venerable sir?”\n“Upāli, there are ten roots of contention. Which are these ten?\nHere, Upāli, monks declare a non-offence to be an offence, and an offence to be a non-offence;\nthey declare a light offence to be a grave offence, and a grave offence to be a light offence;\nthey declare a gross offence to be a non-gross offence, and a non-gross offence to be a gross offence;\nthey declare an offence with remainder to be an offence without remainder, and an offence without remainder to be an offence with remainder;\nthey declare an offence amenable to rectification to be an offence not amenable to rectification, and an offence not amenable to rectification to be an offence amenable to rectification.\nThese, Upāli, are the ten roots of contention.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, විවාද මූලයන් කීයක්‌ තිබේද? උපාලි, විවාද මූලයන් දසයක්‌ තිබේ. ඒ දසය කුමක්ද? උපාලි, මෙහි භික්ෂූන් අනාපත්තියක් ආපත්තියක් ලෙස පෙන්වා දෙති, ආපත්තියක් අනාපත්තියක් ලෙස පෙන්වා දෙති, ලඝු ආපත්තියක් ගරුක ආපත්තියක් ලෙස පෙන්වා දෙති, ගරුක ආපත්තියක් ලඝු ආපත්තියක් ලෙස පෙන්වා දෙති, දූෂ්‍ය ආපත්තියක් අදූෂ්‍ය ආපත්තියක් ලෙස පෙන්වා දෙති, අදූෂ්‍ය ආපත්තියක් දූෂ්‍ය ආපත්තියක් ලෙස පෙන්වා දෙති, සා‌වශේෂ ආපත්තියක් අනවශේෂ ආපත්තියක් ලෙස පෙන්වා දෙති, අනවශේෂ ආපත්තියක් සා‌වශේෂ ආපත්තියක් ලෙස පෙන්වා දෙති, සාප්‍රතිකර්ම ආපත්තියක් අප්‍රතිකර්ම ආපත්තියක් ලෙස පෙන්වා දෙති, අප්‍රතිකර්ම ආපත්තියක් සාප්‍රතිකර්ම ආපත්තියක් ලෙස පෙන්වා දෙති. උපාලි, මේවා විවාද මූලයන් දසය වේ.",
      "paliTitle": "Dutiyavivādamūlasuttaṃ"
    },
    {
      "number": 44,
      "pali": "Ekaṃ samayaṃ bhagavā kusinārāyaṃ viharati baliharaṇe vanasaṇḍe. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – [cūḷava. 399; pari. 436] ‘‘Codakena, bhikkhave, bhikkhunā paraṃ codetukāmena pañca dhamme ajjhattaṃ paccavekkhitvā pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo. Katame pañca dhammā ajjhattaṃ paccavekkhitabbā? Codakena, bhikkhave, bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘parisuddhakāyasamācāro nu khomhi, parisuddhenamhi kāyasamācārena samannāgato acchiddena appaṭimaṃsena. Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhu parisuddhakāyasamācāro hoti parisuddhena kāyasamācārena samannāgato acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā kāyikaṃ sikkhassū’ti, itissa bhavanti vattāro. ‘‘Puna caparaṃ, bhikkhave, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘parisuddhavacīsamācāro nu khomhi, parisuddhenamhi vacīsamācārena samannāgato acchiddena appaṭimaṃsena. Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhu parisuddhavacīsamācāro hoti parisuddhena vacīsamācārena samannāgato acchiddena appaṭimaṃsena, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā vācasikaṃ sikkhassū’ti, itissa bhavanti vattāro. ‘‘Puna caparaṃ, bhikkhave, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘mettaṃ nu kho me cittaṃ paccupaṭṭhitaṃ sabrahmacārīsu anāghātaṃ. Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhuno mettaṃ cittaṃ paccupaṭṭhitaṃ hoti sabrahmacārīsu anāghātaṃ, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā sabrahmacārīsu mettaṃ cittaṃ upaṭṭhāpehī’ti, itissa bhavanti vattāro. ‘‘Puna caparaṃ, bhikkhave, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘bahussuto nu khomhi sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpā me dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhu bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā, tassa bhavanti vattāro – ‘iṅgha tāva āyasmā āgamaṃ pariyāpuṇassū’ti, itissa bhavanti vattāro. ‘‘Puna caparaṃ, bhikkhave, codakena bhikkhunā paraṃ codetukāmena evaṃ paccavekkhitabbaṃ – ‘ubhayāni kho pana me pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso. Saṃvijjati nu kho me eso dhammo udāhu no’ti? No ce, bhikkhave, bhikkhuno ubhayāni pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, ‘idaṃ panāyasmā, kattha vuttaṃ bhagavatā’ti, iti puṭṭho na sampāyissati. Tassa bhavanti vattāro – ‘iṅgha tāva āyasmā vinayaṃ sikkhassū’ti, itissa bhavanti vattāro. Ime pañca dhammā ajjhattaṃ paccavekkhitabbā. ‘‘Katame pañca dhammā ajjhattaṃ upaṭṭhāpetabbā? ‘Kālena vakkhāmi, no akālena; bhūtena vakkhāmi, no abhūtena; saṇhena vakkhāmi, no pharusena; atthasaṃhitena vakkhāmi, no anatthasaṃhitena; mettacitto vakkhāmi, no dosantaro’ti – ime pañca dhammā ajjhattaṃ upaṭṭhāpetabbā. Codakena, bhikkhave, bhikkhunā paraṃ codetukāmena ime pañca dhamme ajjhattaṃ paccavekkhitvā ime pañca dhamme ajjhattaṃ upaṭṭhāpetvā paro codetabbo’’ti. Catutthaṃ.",
      "english": "At one time the Blessed One was dwelling in Kusinārā, in the Baliharaṇa woodland. There, indeed, the Blessed One addressed the bhikkhus, saying, “Bhikkhus.” “Venerable Sir,” those bhikkhus replied to the Blessed One. The Blessed One said this: “A bhikkhu who is a reprover, bhikkhus, who desires to reprove another, should first reflect upon five qualities within himself and establish five qualities within himself before he reproves another. Which five qualities are to be reflected upon within oneself? A bhikkhu who is a reprover, bhikkhus, who desires to reprove another, should reflect thus: ‘Am I one whose bodily conduct is pure? Am I endowed with bodily conduct that is pure, flawless, and beyond reproach? Is this quality found in me or not?’ If, bhikkhus, a bhikkhu is not one whose bodily conduct is pure, not endowed with bodily conduct that is pure, flawless, and beyond reproach, then there will be those who say to him: ‘Come now, venerable sir, you should first train in bodily conduct!’ Such will be what they say to him.\n\n“Furthermore, bhikkhus, a bhikkhu who is a reprover, who desires to reprove another, should reflect thus: ‘Am I one whose verbal conduct is pure? Am I endowed with verbal conduct that is pure, flawless, and beyond reproach? Is this quality found in me or not?’ If, bhikkhus, a bhikkhu is not one whose verbal conduct is pure, not endowed with verbal conduct that is pure, flawless, and beyond reproach, then there will be those who say to him: ‘Come now, venerable sir, you should first train in verbal conduct!’ Such will be what they say to him.\n\n“Furthermore, bhikkhus, a bhikkhu who is a reprover, who desires to reprove another, should reflect thus: ‘Is loving-kindness present in my mind towards my fellow practitioners, free from ill will? Is this quality found in me or not?’ If, bhikkhus, loving-kindness is not present in a bhikkhu’s mind towards his fellow practitioners, free from ill will, then there will be those who say to him: ‘Come now, venerable sir, you should first establish loving-kindness in your mind towards your fellow practitioners!’ Such will be what they say to him.\n\n“Furthermore, bhikkhus, a bhikkhu who is a reprover, who desires to reprove another, should reflect thus: ‘Am I learned, a retainer of what is heard, an accumulator of what is heard—those teachings which are good in the beginning, good in the middle, and good in the end, proclaiming the spiritual life in its entirety, perfectly complete and pure, both in meaning and in letter? Have such teachings been extensively heard by me, retained, familiarized verbally, examined mentally, and well penetrated by understanding? Is this quality found in me or not?’ If, bhikkhus, a bhikkhu is not learned, a retainer of what is heard, an accumulator of what is heard, concerning those teachings which are good in the beginning, good in the middle, and good in the end, proclaiming the spiritual life in its entirety, perfectly complete and pure, both in meaning and in letter, and such teachings have not been extensively heard by him, retained, familiarized verbally, examined mentally, and well penetrated by understanding, then there will be those who say to him: ‘Come now, venerable sir, you should first master the teachings!’ Such will be what they say to him.\n\n“Furthermore, bhikkhus, a bhikkhu who is a reprover, who desires to reprove another, should reflect thus: ‘Have both Pātimokkhas been thoroughly learned by me in detail, well-analyzed, well-practiced, and well-determined with regard to their rules and their specific applications? Is this quality found in me or not?’ If, bhikkhus, both Pātimokkhas have not been thoroughly learned by a bhikkhu in detail, well-analyzed, well-practiced, and well-determined with regard to their rules and their specific applications, and if, when asked, ‘Venerable sir, where was this said by the Blessed One?’ he cannot reply appropriately, then there will be those who say to him: ‘Come now, venerable sir, you should first train in the Discipline!’ Such will be what they say to him. These are the five qualities to be reflected upon within oneself.\n\n“Which five qualities are to be established within oneself? ‘I will speak at the proper time, not at an improper time. I will speak what is factual, not what is unfactual. I will speak gently, not harshly. I will speak what is beneficial, not what is unbeneficial. I will speak with a mind of loving-kindness, not with inner ill will.’ These are the five qualities to be established within oneself. A bhikkhu who is a reprover, bhikkhus, who desires to reprove another, should reflect upon these five qualities within himself and establish these five qualities within himself before he reproves another.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කුසිනාරා නුවර බලිහරණ නම් වූ වනයෙහි වැඩසිටින සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා \"මහණෙනි\" යි වදාළ සේක. \"පින්වහන්සැ\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\nමහණෙනි, අනුන් අවවාද කිරීමට කැමති වූ අවවාද කරන්නා වූ භික්ෂුව තමා තුළ පස් ආකාර ධර්මයන් මෙනෙහි කොට, පස් ආකාර ධර්මයන් පිහිටුවාගෙන අනුන්ට අවවාද කළ යුතුයි. තමා තුළ මෙනෙහි කළ යුතු ඒ පස් ආකාර ධර්මයෝ කවරහුද?\n\nමහණෙනි, අනුන් අවවාද කිරීමට කැමති වූ අවවාද කරන්නා වූ භික්ෂුව මෙසේ මෙනෙහි කළ යුතුයි: 'මම පිරිසුදු කය හැසිරීම් ඇත්තෙක්ද? නිර්දෝෂ වූ, කිසිවෙකුට දොස් පැවරීමට නොහැකි පිරිසුදු කය හැසිරීමකින් මම යුක්තද? මේ ධර්මය මා තුළ ඇත්තේද නැද්ද?' මහණෙනි, යම් හෙයකින් භික්ෂුව නිර්දෝෂ වූ, කිසිවෙකුට දොස් පැවරීමට නොහැකි පිරිසුදු කය හැසිරීමකින් යුක්ත නොවන්නේ නම්, අනුන් ඔහුට මෙසේ කියන්නාහුය: 'ඇවැත්නි, පළමුව ඔබ කායික ශික්ෂාව පුහුණු කරන්න' යි ඔහුට කියන්නෝ වෙති.\n\nතවද මහණෙනි, අනුන් අවවාද කිරීමට කැමති වූ අවවාද කරන්නා වූ භික්ෂුව මෙසේ මෙනෙහි කළ යුතුයි: 'මම පිරිසුදු වචී හැසිරීම් ඇත්තෙක්ද? නිර්දෝෂ වූ, කිසිවෙකුට දොස් පැවරීමට නොහැකි පිරිසුදු වචී හැසිරීමකින් මම යුක්තද? මේ ධර්මය මා තුළ ඇත්තේද නැද්ද?' මහණෙනි, යම් හෙයකින් භික්ෂුව නිර්දෝෂ වූ, කිසිවෙකුට දොස් පැවරීමට නොහැකි පිරිසුදු වචී හැසිරීමකින් යුක්ත නොවන්නේ නම්, අනුන් ඔහුට මෙසේ කියන්නාහුය: 'ඇවැත්නි, පළමුව ඔබ වාචසික ශික්ෂාව පුහුණු කරන්න' යි ඔහුට කියන්නෝ වෙති.\n\nතවද මහණෙනි, අනුන් අවවාද කිරීමට කැමති වූ අවවාද කරන්නා වූ භික්ෂුව මෙසේ මෙනෙහි කළ යුතුයි: 'මාගේ සිත බ්‍රහ්මචාරී සගයන් කෙරෙහි ද්වේෂ රහිතව මෛත්‍රියෙන් පිහිටුවා ඇත්තේද? මේ ධර්මය මා තුළ ඇත්තේද නැද්ද?' මහණෙනි, යම් හෙයකින් භික්ෂුවගේ සිත බ්‍රහ්මචාරී සගයන් කෙරෙහි ද්වේෂ රහිතව මෛත්‍රියෙන් පිහිටුවා නැතිනම්, අනුන් ඔහුට මෙසේ කියන්නාහුය: 'ඇවැත්නි, පළමුව ඔබ බ්‍රහ්මචාරී සගයන් කෙරෙහි මෛත්‍රී සිත පිහිටුවා ගන්න' යි ඔහුට කියන්නෝ වෙති.\n\nතවද මහණෙනි, අනුන් අවවාද කිරීමට කැමති වූ අවවාද කරන්නා වූ භික්ෂුව මෙසේ මෙනෙහි කළ යුතුයි: 'මම බහුශ්‍රැතද? ධර්මය දරා සිටින්නෙක්ද? ධර්මය රැස්කරගෙන ඇත්තෙක්ද? යම් ධර්මයෝ ආදිකල්‍යාණ, මධ්‍යකල්‍යාණ, පරියෝසානකල්‍යාණ (ආදියෙන්, මැදින්, කෙළවරින් මනාවූ) අර්ථ සහිතව, ව්‍යංජන සහිතව, සම්පූර්ණ වූ, පිරිසුදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නාහුද, ඒ ධර්මයෝ මට බහුශ්‍රැතව, ධාරණය කරනු ලැබ, වචනයෙන් හුරු පුරුදු කර, සිතින් විමසා බලා, දෘෂ්ටියෙන් මනාව අවබෝධ කරගෙන ඇත්තාහුද? මේ ධර්මය මා තුළ ඇත්තේද නැද්ද?' මහණෙනි, යම් හෙයකින් භික්ෂුව බහුශ්‍රැත නොවන්නේ නම්, ධර්මය දරා සිටින්නෙක් නොවන්නේ නම්, ධර්මය රැස්කරගෙන ඇත්තෙක් නොවන්නේ නම්, යම් ධර්මයෝ ආදිකල්‍යාණ, මධ්‍යකල්‍යාණ, පරියෝසානකල්‍යාණ අර්ථ සහිතව, ව්‍යංජන සහිතව, සම්පූර්ණ වූ, පිරිසුදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නාහුද, ඒ ධර්මයෝ ඔහුට බහුශ්‍රැතව, ධාරණය කරනු ලැබ, වචනයෙන් හුරු පුරුදු කර, සිතින් විමසා බලා, දෘෂ්ටියෙන් මනාව අවබෝධ කරගෙන නැත්නම්, අනුන් ඔහුට මෙසේ කියන්නාහුය: 'ඇවැත්නි, පළමුව ඔබ ආගම ඉගෙන ගන්න' යි ඔහුට කියන්නෝ වෙති.\n\nතවද මහණෙනි, අනුන් අවවාද කිරීමට කැමති වූ අවවාද කරන්නා වූ භික්ෂුව මෙසේ මෙනෙහි කළ යුතුයි: 'මම උභය පාතිමෝක්ෂය විස්තර වශයෙන් මනාව ඉගෙනගෙන ඇත්තෙක්ද? මනාව විභාග කර, මනාව ප්‍රවර්තනය කර, මනාව විනිශ්චය කර, සූත්‍ර ක්‍රමයෙන්ද, අනු-ව්‍යංජන ක්‍රමයෙන්ද දන්නා අයෙක්ද? මේ ධර්මය මා තුළ ඇත්තේද නැද්ද?' මහණෙනි, යම් හෙයකින් භික්ෂුව උභය පාතිමෝක්ෂය විස්තර වශයෙන් මනාව ඉගෙනගෙන, මනාව විභාග කර, මනාව ප්‍රවර්තනය කර, මනාව විනිශ්චය කර, සූත්‍ර ක්‍රමයෙන්ද, අනු-ව්‍යංජන ක්‍රමයෙන්ද දන්නා අයෙක් නොවන්නේ නම්, 'ඇවැත්නි, මේ භාග්‍යවතුන් වහන්සේ කොතැනකදී වදාළ දෙයක්ද?' යි විමසූ විට පිළිතුරු දීමට සමත් නොවන්නේය. අනුන් ඔහුට මෙසේ කියන්නාහුය: 'ඇවැත්නි, පළමුව ඔබ විනය ඉගෙන ගන්න' යි ඔහුට කියන්නෝ වෙති. මේ ධර්ම පහ තමා තුළ මෙනෙහි කළ යුතුයි.\n\nතමා තුළ පිහිටුවා ගත යුතු ඒ පස් ආකාර ධර්මයෝ කවරහුද? 'මම නියම වේලාවට කථා කරන්නෙමි, නියම නොවන වේලාවට නොවේ. ඇත්ත කථා කරන්නෙමි, නැති දේ නොවේ. මෘදු වචන කථා කරන්නෙමි, රළු වචන නොවේ. අර්ථවත් දේ කථා කරන්නෙමි, අර්ථයක් නැති දේ නොවේ. මෛත්‍රී සිතින් යුතුව කථා කරන්නෙමි, ද්වේෂයෙන් යුතුව නොවේ.' මේ ධර්ම පහ තමා තුළ පිහිටුවා ගත යුතුයි. මහණෙනි, අනුන් අවවාද කිරීමට කැමති වූ අවවාද කරන්නා වූ භික්ෂුව මේ ධර්ම පහ තමා තුළ මෙනෙහි කොට, මේ ධර්ම පහ තමා තුළ පිහිටුවාගෙන අනුන්ට අවවාද කළ යුතුයි.",
      "paliTitle": "Kusinārasuttaṃ"
    },
    {
      "number": 45,
      "pali": "[pāci. 497] ‘‘Dasayime, bhikkhave, ādīnavā rājantepurappavesane. Katame dasa? Idha, bhikkhave, rājā mahesiyā saddhiṃ nisinno hoti. Tatra bhikkhu pavisati. Mahesī vā bhikkhuṃ disvā sitaṃ pātukaroti, bhikkhu vā mahesiṃ disvā sitaṃ pātukaroti. Tattha rañño evaṃ hoti – ‘addhā imesaṃ kataṃ vā karissanti vā’ti! Ayaṃ, bhikkhave, paṭhamo ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rājā bahukicco bahukaraṇīyo aññataraṃ itthiṃ gantvā na sarati – ‘sā tena gabbhaṃ gaṇhāti’. Tattha rañño evaṃ hoti – ‘na kho idha añño koci pavisati, aññatra pabbajitena. Siyā nu kho pabbajitassa kamma’nti. Ayaṃ, bhikkhave, dutiyo ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rañño antepure aññataraṃ ratanaṃ nassati. Tattha rañño evaṃ hoti – ‘na kho idha añño koci pavisati, aññatra pabbajitena. Siyā nu kho pabbajitassa kamma’nti. Ayaṃ, bhikkhave, tatiyo ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rañño antepure abbhantarā guyhamantā bahiddhā sambhedaṃ gacchanti. Tattha rañño evaṃ hoti – ‘na kho idha añño koci pavisati, aññatra pabbajitena. Siyā nu kho pabbajitassa kamma’nti. Ayaṃ, bhikkhave, catuttho ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rañño antepure pitā vā puttaṃ pattheti putto vā pitaraṃ pattheti. Tesaṃ evaṃ hoti – ‘na kho idha añño koci pavisati, aññatra pabbajitena. Siyā nu kho pabbajitassa kamma’nti. Ayaṃ, bhikkhave, pañcamo ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rājā nīcaṭṭhāniyaṃ ucce ṭhāne ṭhapeti. Yesaṃ taṃ amanāpaṃ tesaṃ evaṃ hoti – ‘rājā kho pabbajitena saṃsaṭṭho. Siyā nu kho pabbajitassa kamma’nti. Ayaṃ, bhikkhave, chaṭṭho ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rājā uccaṭṭhāniyaṃ nīce ṭhāne ṭhapeti. Yesaṃ taṃ amanāpaṃ tesaṃ evaṃ hoti – ‘rājā kho pabbajitena saṃsaṭṭho. Siyā nu kho pabbajitassa kamma’nti. Ayaṃ, bhikkhave, sattamo ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rājā akāle senaṃ uyyojeti. Yesaṃ taṃ amanāpaṃ tesaṃ evaṃ hoti – ‘rājā kho pabbajitena saṃsaṭṭho. Siyā nu kho pabbajitassa kamma’nti. Ayaṃ, bhikkhave, aṭṭhamo ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rājā kāle senaṃ uyyojetvā antarāmaggato nivattāpeti. Yesaṃ taṃ amanāpaṃ tesaṃ evaṃ hoti – ‘rājā kho pabbajitena saṃsaṭṭho. Siyā nu kho pabbajitassa kamma’nti. Ayaṃ, bhikkhave, navamo ādīnavo rājantepurappavesane. ‘‘Puna caparaṃ, bhikkhave, rañño antepuraṃ hatthisammaddaṃ assasammaddaṃ rathasammaddaṃ rajanīyāni rūpasaddagandharasaphoṭṭhabbāni, yāni na pabbajitassa sāruppāni. Ayaṃ, bhikkhave, dasamo ādīnavo rājantepurappavesane. Ime kho, bhikkhave, dasa ādīnavā rājantepurappavesane’’ti. Pañcamaṃ.",
      "english": "These ten drawbacks, bhikkhus, are associated with entering a royal inner chamber. Which ten? Here, bhikkhus, a king is seated with his chief queen. Then a bhikkhu enters. Either the chief queen, seeing the bhikkhu, reveals a smile, or the bhikkhu, seeing the chief queen, reveals a smile. Thereupon, the king thinks, ‘Surely, they have already done something, or they are about to do something!’ This, bhikkhus, is the first drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, a king, having many duties and many tasks, visits a certain woman and forgets her. Then she conceives a child. Thereupon, the king thinks, ‘Indeed, no one else enters here except the recluse. Might this not be the recluse’s doing?’ This, bhikkhus, is the second drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, a certain jewel goes missing from the king’s inner chamber. Thereupon, the king thinks, ‘Indeed, no one else enters here except the recluse. Might this not be the recluse’s doing?’ This, bhikkhus, is the third drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, secret internal deliberations from the king’s inner chamber become known outside. Thereupon, the king thinks, ‘Indeed, no one else enters here except the recluse. Might this not be the recluse’s doing?’ This, bhikkhus, is the fourth drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, in the king’s inner chamber, either a father desires his son, or a son desires his father. The king thinks, ‘Indeed, no one else enters here except the recluse. Might this not be the recluse’s doing?’ This, bhikkhus, is the fifth drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, the king places someone of low position in a high position. Those to whom this is displeasing think, ‘The king is indeed associated with the recluse. Might this not be the recluse’s doing?’ This, bhikkhus, is the sixth drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, the king places someone of high position in a low position. Those to whom this is displeasing think, ‘The king is indeed associated with the recluse. Might this not be the recluse’s doing?’ This, bhikkhus, is the seventh drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, the king dispatches his army at an unsuitable time. Those to whom this is displeasing think, ‘The king is indeed associated with the recluse. Might this not be the recluse’s doing?’ This, bhikkhus, is the eighth drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, the king, having dispatched his army at an appropriate time, turns it back from midway. Those to whom this is displeasing think, ‘The king is indeed associated with the recluse. Might this not be the recluse’s doing?’ This, bhikkhus, is the ninth drawback associated with entering a royal inner chamber.\n\nFurthermore, bhikkhus, the king’s inner chamber is filled with the crush of elephants, the crush of horses, the crush of chariots, and with enticing forms, sounds, odors, flavors, and tactile sensations, which are not fitting for a recluse. This, bhikkhus, is the tenth drawback associated with entering a royal inner chamber. These, bhikkhus, are the ten drawbacks associated with entering a royal inner chamber.",
      "sinhala": "භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ ආදීනව දසයකි. ඒ දසය කවරේද?\n\nභික්ෂූනි, මෙහිලා රජු මහේෂිකාව සමඟ හිඳගෙන සිටී. එහිදී භික්ෂුවක් ඇතුළු වේ. මහේෂිකාව භික්ෂුව දැක සිනහවක් පායි, හෝ භික්ෂුව මහේෂිකාව දැක සිනහවක් පායි. එහිදී රජුට මෙසේ සිතේ: ‘නිසැකව ම මොවුන් යමක් කළා හෝ කරනු ඇතැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ පළමුවන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජුට බොහෝ කටයුතු, බොහෝ කළයුතු දේ ඇත. ඔහු එක්තරා ස්ත්‍රියක හා එක්ව, ඇය තමා නිසා ගැබ් ගන්නා බව අමතක කර දමයි. එවිට මෙසේ සිතේ: ‘මෙතැනට පැවිද්දා හැර වෙන කිසිවෙක් ඇතුළු නොවේ. සමහර විට මේ පැවිද්දාගේ ක්‍රියාවක් විය හැකිදැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ දෙවන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජුගේ අන්තඃපුරයේ එක්තරා වටිනා වස්තුවක් නැති වී යයි. එහිදී රජුට මෙසේ සිතේ: ‘මෙතැනට පැවිද්දා හැර වෙන කිසිවෙක් ඇතුළු නොවේ. සමහර විට මේ පැවිද්දාගේ ක්‍රියාවක් විය හැකිදැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ තෙවන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජුගේ අන්තඃපුරයේ අභ්‍යන්තර රහස්‍ය මන්ත්‍රණ පිටතට පැතිර යයි. එහිදී රජුට මෙසේ සිතේ: ‘මෙතැනට පැවිද්දා හැර වෙන කිසිවෙක් ඇතුළු නොවේ. සමහර විට මේ පැවිද්දාගේ ක්‍රියාවක් විය හැකිදැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ සිව්වන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජුගේ අන්තඃපුරයේ පියා පුතාට අනුචිත ලෙස ආශා කරයි, හෝ පුතා පියාට අනුචිත ලෙස ආශා කරයි. එවිට මෙසේ සිතේ: ‘මෙතැනට පැවිද්දා හැර වෙන කිසිවෙක් ඇතුළු නොවේ. සමහර විට මේ පැවිද්දාගේ ක්‍රියාවක් විය හැකිදැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ පස්වන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජු පහත් තනතුරක සිටින අයෙකු උසස් තනතුරක තබයි. යම් අයට එය අප්‍රසන්න ද, ඔවුනට මෙසේ සිතේ: ‘රජු පැවිද්දා සමඟ සමීප ඇසුරක් පවත්වයි. සමහර විට මෙය පැවිද්දාගේ ක්‍රියාවක් විය හැකිදැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ සයවන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජු උසස් තනතුරක සිටින අයෙකු පහත් තනතුරක තබයි. යම් අයට එය අප්‍රසන්න ද, ඔවුනට මෙසේ සිතේ: ‘රජු පැවිද්දා සමඟ සමීප ඇසුරක් පවත්වයි. සමහර විට මෙය පැවිද්දාගේ ක්‍රියාවක් විය හැකිදැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ සත්වන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජු නුසුදුසු අවස්ථාවක සේනාව පිටත් කර හරියි. යම් අයට එය අප්‍රසන්න ද, ඔවුනට මෙසේ සිතේ: ‘රජු පැවිද්දා සමඟ සමීප ඇසුරක් පවත්වයි. සමහර විට මෙය පැවිද්දාගේ ක්‍රියාවක් විය හැකිදැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ අටවන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජු සුදුසු අවස්ථාවක සේනාව පිටත් කර හැර, අතරමගදී ඔවුන් ආපසු කැඳවයි. යම් අයට එය අප්‍රසන්න ද, ඔවුනට මෙසේ සිතේ: ‘රජු පැවිද්දා සමඟ සමීප ඇසුරක් පවත්වයි. සමහර විට මෙය පැවිද්දාගේ ක්‍රියාවක් විය හැකිදැයි!’ භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ නවවන ආදීනවයයි.\n\nභික්ෂූනි, නැවතත් රජුගේ අන්තඃපුරය ඇතුන්ගේ තෙරපීමෙන්, අශ්වයන්ගේ තෙරපීමෙන්, රථයන්ගේ තෙරපීමෙන් යුක්තය. තවද, රාගය ඇති කරවන රූප, ශබ්ද, ගන්ධ, රස, ස්පර්ශ යන අරමුණු වලින් යුක්තය. ඒවා පැවිද්දාට සුදුසු නොවේ. භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ දසවන ආදීනවයයි. භික්ෂූනි, රාජ අන්තඃපුරයට ඇතුළු වීමෙහි මේ ආදීනව දසය මෙයයි.",
      "paliTitle": "Rājantepurappavesanasuttaṃ"
    },
    {
      "number": 46,
      "pali": "Ekaṃ samayaṃ bhagavā sakkesu viharati kapilavatthusmiṃ nigrodhārāme. Atha kho sambahulā sakkā upāsakā tadahuposathe yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho sakke upāsake bhagavā etadavoca – ‘‘api nu tumhe, sakkā, aṭṭhaṅgasamannāgataṃ uposathaṃ upavasathā’’ti? ‘‘Appekadā mayaṃ, bhante, aṭṭhaṅgasamannāgataṃ uposathaṃ upavasāma, appekadā na upavasāmā’’ti. ‘‘Tesaṃ vo, sakkā, alābhā tesaṃ dulladdhaṃ, ye tumhe evaṃ sokasabhaye jīvite maraṇasabhaye jīvite appekadā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasatha, appekadā na upavasatha. ‘‘Taṃ kiṃ maññatha, sakkā, idha puriso yena kenaci kammaṭṭhānena anāpajja akusalaṃ divasaṃ aḍḍhakahāpaṇaṃ nibbiseyya. Dakkho puriso uṭṭhānasampannoti alaṃ vacanāyā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sakkā, idha puriso yena kenaci kammaṭṭhānena anāpajja akusalaṃ divasaṃ kahāpaṇaṃ nibbiseyya. Dakkho puriso uṭṭhānasampannoti alaṃ vacanāyā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ, maññatha, sakkā, idha puriso yena kenaci kammaṭṭhānena anāpajja akusalaṃ divasaṃ dve kahāpaṇe nibbiseyya … tayo kahāpaṇe nibbiseyya… cattāro kahāpaṇe nibbiseyya… pañca kahāpaṇe nibbiseyya… cha kahāpaṇe nibbiseyya… satta kahāpaṇe nibbiseyya… aṭṭha kahāpaṇe nibbiseyya… nava kahāpaṇe nibbiseyya… dasa kahāpaṇe nibbiseyya… vīsa kahāpaṇe nibbiseyya… tiṃsa kahāpaṇe nibbiseyya… cattārīsaṃ kahāpaṇe nibbiseyya… paññāsaṃ kahāpaṇe nibbiseyya… kahāpaṇasataṃ nibbiseyya. Dakkho puriso uṭṭhānasampannoti alaṃ vacanāyā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sakkā, api nu so puriso divase divase kahāpaṇasataṃ kahāpaṇasahassaṃ nibbisamāno laddhaṃ laddhaṃ nikkhipanto vassasatāyuko vassasatajīvī mahantaṃ bhogakkhandhaṃ adhigaccheyyā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Taṃ kiṃ maññatha, sakkā, api nu so puriso bhogahetu bhoganidānaṃ bhogādhikaraṇaṃ ekaṃ vā rattiṃ ekaṃ vā divasaṃ upaḍḍhaṃ vā rattiṃ upaḍḍhaṃ vā divasaṃ ekantasukhappaṭisaṃvedī vihareyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Taṃ kissa hetu’’? ‘‘Kāmā hi, bhante, aniccā tucchā musā mosadhammā’’ti. ‘‘Idha pana vo, sakkā, mama sāvako dasa vassāni appamatto ātāpī pahitatto viharanto yathā mayānusiṭṭhaṃ tathā paṭipajjamāno satampi vassāni satampi vassasatāni satampi vassasahassāni ekantasukhappaṭisaṃvedī vihareyya. So ca khvassa sakadāgāmī vā anāgāmī vā apaṇṇakaṃ vā sotāpanno. Tiṭṭhantu, sakkā, dasa vassāni. Idha mama sāvako nava vassāni… aṭṭha vassāni… satta vassāni… cha vassāni… pañca vassāni cattāri vassāni… tīṇi vassāni… dve vassāni… ekaṃ vassaṃ appamatto ātāpī pahitatto viharanto yathā mayānusiṭṭhaṃ tathā paṭipajjamāno satampi vassāni satampi vassasatāni satampi vassasahassāni ekantasukhappaṭisaṃvedī vihareyya, so ca khvassa sakadāgāmī vā anāgāmī vā apaṇṇakaṃ vā sotāpanno. Tiṭṭhatu, sakkā, ekaṃ vassaṃ. Idha mama sāvako dasa māse appamatto ātāpī pahitatto viharanto yathā mayānusiṭṭhaṃ tathā paṭipajjamāno satampi vassāni satampi vassasatāni satampi vassasahassāni ekantasukhappaṭisaṃvedī vihareyya, so ca khvassa sakadāgāmī vā anāgāmī vā apaṇṇakaṃ vā sotāpanno. Tiṭṭhantu, sakkā, dasa māsā. Idha mama sāvako nava māse… aṭṭha māse… satta māse… cha māse… pañca māse… cattāro māse… tayo māse… dve māse… ekaṃ māsaṃ… aḍḍhamāsaṃ appamatto ātāpī pahitatto viharanto yathā mayānusiṭṭhaṃ tathā paṭipajjamāno satampi vassāni satampi vassasatāni satampi vassasahassāni ekantasukhappaṭisaṃvedī vihareyya, so ca khvassa sakadāgāmī vā anāgāmī vā apaṇṇakaṃ vā sotāpanno. Tiṭṭhatu, sakkā, aḍḍhamāso. Idha mama sāvako dasa rattindive [rattidive (ka.)] appamatto ātāpī pahitatto viharanto yathā mayānusiṭṭhaṃ tathā paṭipajjamāno satampi vassāni satampi vassasatāni satampi vassasahassāni ekantasukhappaṭisaṃvedī vihareyya, so ca khvassa sakadāgāmī vā anāgāmī vā apaṇṇakaṃ vā sotāpanno. Tiṭṭhantu, sakkā, dasa rattindivā. Idha mama sāvako nava rattindive… aṭṭha rattindive… satta rattindive… cha rattindive… pañca rattindive… cattāro rattindive… tayo rattindive… dve rattindive… ekaṃ rattindivaṃ appamatto ātāpī pahitatto viharanto yathā mayānusiṭṭhaṃ tathā paṭipajjamāno satampi vassāni satampi vassasatāni satampi vassasahassāni ekantasukhappaṭisaṃvedī vihareyya, so ca khvassa sakadāgāmī vā anāgāmī vā apaṇṇakaṃ vā sotāpanno. Tesaṃ vo, sakkā, alābhā tesaṃ dulladdhaṃ, ye tumhe evaṃ sokasabhaye jīvite maraṇasabhaye jīvite appekadā aṭṭhaṅgasamannāgataṃ uposathaṃ upavasatha, appekadā na upavasathā’’ti. ‘‘Ete mayaṃ, bhante, ajjatagge aṭṭhaṅgasamannāgataṃ uposathaṃ upavasissāmā’’ti. Chaṭṭhaṃ.",
      "english": "At one time the Blessed One was dwelling among the Sakyans in Kapilavatthu, at Nigrodha’s Park. Then, on that Uposatha day, many Sakyan lay followers approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side.\n\nAs they sat to one side, the Blessed One spoke to the Sakyan lay followers, saying: “Sakyan kinsmen, do you observe the Uposatha endowed with eight factors?”\n\nThey replied: “Venerable Sir, sometimes we observe the Uposatha endowed with eight factors, and sometimes we do not.”\n\n“For you, Sakyan kinsmen, that is a loss, that is an ill-gained opportunity, that living in a life accompanied by sorrow, a life accompanied by fear of death, you sometimes observe the Uposatha endowed with eight factors, and sometimes you do not.\n\n“What do you think, Sakyan kinsmen? Suppose here a person, through some work, without incurring any unwholesome deed, were to earn half a kahāpaṇa a day. Could it be said that such a person is skilled and accomplished in effort?”\n\n“Yes, Venerable Sir.”\n\n“What do you think, Sakyan kinsmen? Suppose here a person, through some work, without incurring any unwholesome deed, were to earn one kahāpaṇa a day. Could it be said that such a person is skilled and accomplished in effort?”\n\n“Yes, Venerable Sir.”\n\n“What do you think, Sakyan kinsmen? Suppose here a person, through some work, without incurring any unwholesome deed, were to earn two kahāpaṇas a day... three kahāpaṇas... four kahāpaṇas... five kahāpaṇas... six kahāpaṇas... seven kahāpaṇas... eight kahāpaṇas... nine kahāpaṇas... ten kahāpaṇas... twenty kahāpaṇas... thirty kahāpaṇas... forty kahāpaṇas... fifty kahāpaṇas... one hundred kahāpaṇas a day. Could it be said that such a person is skilled and accomplished in effort?”\n\n“Yes, Venerable Sir.”\n\n“What do you think, Sakyan kinsmen? If that person were to earn a hundred or a thousand kahāpaṇas day by day, and were to put aside whatever they earned, living for a hundred years, having a life span of a hundred years, would they acquire a great mass of wealth?”\n\n“Yes, Venerable Sir.”\n\n“What do you think, Sakyan kinsmen? Would that person, because of wealth, on account of wealth, for the sake of wealth, dwell experiencing unalloyed happiness for one night, or one day, or half a night, or half a day?”\n\n“No, Venerable Sir.”\n\n“For what reason?”\n\n“Because, Venerable Sir, sense pleasures are impermanent, hollow, deceptive, and of a delusive nature.”\n\n“However, Sakyan kinsmen, here a disciple of mine, dwelling for ten years diligently, ardently, with a resolute mind, practicing in accordance with what I have instructed, could experience unalloyed happiness for a hundred years, a hundred centuries, or a hundred millennia. And that disciple would be either a Once-returner, or a Non-returner, or an assured Stream-enterer.\n\n“Let alone ten years, Sakyan kinsmen. Here a disciple of mine, dwelling for nine years... eight years... seven years... six years... five years... four years... three years... two years... one year diligently, ardently, with a resolute mind, practicing in accordance with what I have instructed, could experience unalloyed happiness for a hundred years, a hundred centuries, or a hundred millennia. And that disciple would be either a Once-returner, or a Non-returner, or an assured Stream-enterer.\n\n“Let alone one year, Sakyan kinsmen. Here a disciple of mine, dwelling for ten months diligently, ardently, with a resolute mind, practicing in accordance with what I have instructed, could experience unalloyed happiness for a hundred years, a hundred centuries, or a hundred millennia. And that disciple would be either a Once-returner, or a Non-returner, or an assured Stream-enterer.\n\n“Let alone ten months, Sakyan kinsmen. Here a disciple of mine, dwelling for nine months... eight months... seven months... six months... five months... four months... three months... two months... one month... half a month diligently, ardently, with a resolute mind, practicing in accordance with what I have instructed, could experience unalloyed happiness for a hundred years, a hundred centuries, or a hundred millennia. And that disciple would be either a Once-returner, or a Non-returner, or an assured Stream-enterer. Let alone half a month, Sakyan kinsmen.\n\n“Here a disciple of mine, dwelling for ten days and nights diligently, ardently, with a resolute mind, practicing in accordance with what I have instructed, could experience unalloyed happiness for a hundred years, a hundred centuries, or a hundred millennia. And that disciple would be either a Once-returner, or a Non-returner, or an assured Stream-enterer. Let alone ten days and nights, Sakyan kinsmen.”\n\nHere, my disciple, for nine days and nights, or for eight days and nights, or for seven days and nights, or for six days and nights, or for five days and nights, or for four days and nights, or for three days and nights, or for two days and nights, or even for one day and night, dwelling heedful, ardent, and resolute, practicing in accordance with what I have taught, might experience unalloyed happiness for a hundred years, or for a hundred hundreds of years, or for a hundred thousands of years. And such a one would be a Once-returner, or a Non-returner, or certainly a Stream-enterer.\n\nSakyans, it is a loss for you, a great misfortune for those among you who, living in such a life fraught with sorrow and fear, a life fraught with fear of death, sometimes observe the Uposatha endowed with eight factors, and sometimes do not observe it.\n\n‘Venerable Sir, from this day forward, we shall observe the Uposatha endowed with eight factors.’",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ ශාක්‍යයන් අතර කපිලවස්තු නුවර නිග්‍රෝධාරාමයෙහි වාසය කළ සේක. එකල්හි බොහෝ ශාක්‍ය උපාසකවරු එදින උපෝසථයෙහි භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එක් පසෙකින් වාඩි වූහ. එක් පසෙකින් වාඩි වී සිටි ශාක්‍ය උපාසකවරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ශාක්‍යයෙනි, ඔබ අෂ්ටාංග සමන්නාගත උපෝසථය සමාදන්වී සිටින්නේද?” “ස්වාමීනි, සමහර විට අපි අෂ්ටාංග සමන්නාගත උපෝසථය සමාදන් වෙමු, සමහර විට සමාදන් නොවෙමු.”\n\n“ශාක්‍යයෙනි, ශෝකයෙන් භය ඇති, මරණයෙන් භය ඇති මෙබඳු ජීවිතයක සිටින ඔබ සමහර විට අෂ්ටාංග සමන්නාගත උපෝසථය සමාදන් වී, සමහර විට නොසමාදන් වීම ඔබට අලාභයකි, එය අවාසනාවකි.\n\n“ශාක්‍යයෙනි, ඔබ මේ කුමක් සිතන්නෙහිද? මෙලොව යම් පුරුෂයෙක් කිසියම් අකුසල කර්මයකට නොවැටී දිනකට අර්ධ කහවණුවක් උපයන්නේය. ‘මේ පුරුෂයා දක්ෂයෙකි, උත්සාහසම්පන්නයෙකි’ යැයි පැවසීමට සුදුසු නොවේද?” “එසේය, ස්වාමීනි.”\n\n“ශාක්‍යයෙනි, ඔබ මේ කුමක් සිතන්නෙහිද? මෙලොව යම් පුරුෂයෙක් කිසියම් අකුසල කර්මයකට නොවැටී දිනකට කහවණුවක් උපයන්නේය. ‘මේ පුරුෂයා දක්ෂයෙකි, උත්සාහසම්පන්නයෙකි’ යැයි පැවසීමට සුදුසු නොවේද?” “එසේය, ස්වාමීනි.”\n\n“ශාක්‍යයෙනි, ඔබ මේ කුමක් සිතන්නෙහිද? මෙලොව යම් පුරුෂයෙක් කිසියම් අකුසල කර්මයකට නොවැටී දිනකට කහවණු දෙකක් උපයන්නේය... කහවණු තුනක් උපයන්නේය... කහවණු හතරක් උපයන්නේය... කහවණු පහක් උපයන්නේය... කහවණු හයක් උපයන්නේය... කහවණු හතක් උපයන්නේය... කහවණු අටක් උපයන්නේය... කහවණු නවයක් උපයන්නේය... කහවණු දහයක් උපයන්නේය... කහවණු විස්සක් උපයන්නේය... කහවණු තිහක් උපයන්නේය... කහවණු හතළිහක් උපයන්නේය... කහවණු පනහක් උපයන්නේය... කහවණු සියයක් උපයන්නේය. ‘මේ පුරුෂයා දක්ෂයෙකි, උත්සාහසම්පන්නයෙකි’ යැයි පැවසීමට සුදුසු නොවේද?” “එසේය, ස්වාමීනි.”\n\n“ශාක්‍යයෙනි, ඔබ මේ කුමක් සිතන්නෙහිද? දිනෙන් දින කහවණු සියයක් හෝ කහවණු දහසක් උපයමින්, ලැබෙන ලැබෙන දේ තැන්පත් කරමින්, අවුරුදු සියයක් ආයුෂ ඇතිව, අවුරුදු සියයක් ජීවත් වන ඒ පුරුෂයා මහත් ධන සම්භාරයක් අත්කර ගන්නේ නොවේද?” “එසේය, ස්වාමීනි.”\n\n“ශාක්‍යයෙනි, ඔබ මේ කුමක් සිතන්නෙහිද? ඒ පුරුෂයා ධනය නිසා, ධනය හේතුකොටගෙන, ධනය අරභයා එක රැයක් හෝ එක දවසක්, අර්ධ රාත්‍රියක් හෝ අර්ධ දවසක් ඒකාන්තයෙන්ම සැපය අත්විඳිමින් වාසය කරන්නේද?” “එසේ නොවේ ස්වාමීනි.”\n\n“ඒ කිමෙක් නිසාද?” “ස්වාමීනි, කාමයන් අනිත්‍ය වූ, හිස් වූ, බොරු වූ, රැවටිලි ස්වභාව ඇති දේය.”\n\n“ශාක්‍යයෙනි, මෙහි මාගේ ශ්‍රාවකයෙක් දස වර්ෂයක් අප්‍රමාදීව, දැඩි උත්සාහයෙන් යුතුව, වීර්යය ඇතිව වාසය කරමින්, මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදිමින්, අවුරුදු සියයක් හෝ දහස් ගණනක් අවුරුදු සියදහස් ගණනක් ඒකාන්තයෙන්ම සැපය අත්විඳිමින් වාසය කරන්නේය. ඔහු සකදාගාමී වේවා, අනාගාමී වේවා, නැතහොත් නිසැකවම සෝතාපන්න වේවා. ශාක්‍යයෙනි, දස වර්ෂයක් පසෙක තබමු. මෙහි මාගේ ශ්‍රාවකයෙක් නව වර්ෂයක්... අට වර්ෂයක්... සත් වර්ෂයක්... සය වර්ෂයක්... පස් වර්ෂයක්... සිව් වර්ෂයක්... තුන් වර්ෂයක්... දෙ වර්ෂයක්... එක් වර්ෂයක් අප්‍රමාදීව, දැඩි උත්සාහයෙන් යුතුව, වීර්යය ඇතිව වාසය කරමින්, මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදිමින්, අවුරුදු සියයක් හෝ දහස් ගණනක් අවුරුදු සියදහස් ගණනක් ඒකාන්තයෙන්ම සැපය අත්විඳිමින් වාසය කරන්නේය. ඔහු සකදාගාමී වේවා, අනාගාමී වේවා, නැතහොත් නිසැකවම සෝතාපන්න වේවා. ශාක්‍යයෙනි, එක් වර්ෂයක් පසෙක තබමු. මෙහි මාගේ ශ්‍රාවකයෙක් දස මාසයක් අප්‍රමාදීව, දැඩි උත්සාහයෙන් යුතුව, වීර්යය ඇතිව වාසය කරමින්, මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදිමින්, අවුරුදු සියයක් හෝ දහස් ගණනක් අවුරුදු සියදහස් ගණනක් ඒකාන්තයෙන්ම සැපය අත්විඳිමින් වාසය කරන්නේය. ඔහු සකදාගාමී වේවා, අනාගාමී වේවා, නැතහොත් නිසැකවම සෝතාපන්න වේවා. ශාක්‍යයෙනි, දස මාසයක් පසෙක තබමු. මෙහි මාගේ ශ්‍රාවකයෙක් නව මාසයක්... අට මාසයක්... සත් මාසයක්... සය මාසයක්... පස් මාසයක්... සිව් මාසයක්... තුන් මාසයක්... දෙ මාසයක්... එක් මාසයක්... අඩ මාසයක් අප්‍රමාදීව, දැඩි උත්සාහයෙන් යුතුව, වීර්යය ඇතිව වාසය කරමින්, මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදිමින්, අවුරුදු සියයක් හෝ දහස් ගණනක් අවුරුදු සියදහස් ගණනක් ඒකාන්තයෙන්ම සැපය අත්විඳිමින් වාසය කරන්නේය. ඔහු සකදාගාමී වේවා, අනාගාමී වේවා, නැතහොත් නිසැකවම සෝතාපන්න වේවා. ශාක්‍යයෙනි, අඩ මාසයක් පසෙක තබමු. මෙහි මාගේ ශ්‍රාවකයෙක් දස දිනක් අප්‍රමාදීව, දැඩි උත්සාහයෙන් යුතුව, වීර්යය ඇතිව වාසය කරමින්, මා විසින් අනුශාසනා කරන ලද පරිදි පිළිපදිමින්, අවුරුදු සියයක් හෝ දහස් ගණනක් අවුරුදු සියදහස් ගණනක් ඒකාන්තයෙන්ම සැපය අත්විඳිමින් වාසය කරන්නේය. ඔහු සකදාගාමී වේවා, අනාගාමී වේවා, නැතහොත් නිසැකවම සෝතාපන්න වේවා. ශාක්‍යයෙනි, දස දිනක් පසෙක තබමු.\n\nමෙහි මාගේ ශ්‍රාවකයෙක් දින නවයක්, දින අටක්, දින හතක්, දින හයක්, දින පහක්, දින හතරක්, දින තුනක්, දින දෙකක් හෝ එක් දිනක් අප්‍රමාදීව, වීර්යයෙන් යුක්තව, කෙලෙස් දුරුකිරීම පිණිස අත් පමුණුවන ලද සිතින් වාසය කරමින්, මා විසින් අනුශාසනා කරන ලද ආකාරයට පිළිපදිමින්, අවුරුදු සියයක් වුවත්, අවුරුදු සිය ගණනක් වුවත්, අවුරුදු දහස් ගණනක් වුවත් ඒකාන්තයෙන් සැපය අත්විඳිමින් වාසය කරන්නේ නම්, හෙතෙම සකදාගාමී වේවා, අනාගාමී වේවා, නොවරදිනසුලු සෝතාපන්න කෙනෙක් වේවා. ශක්‍රයෙනි, යම් ඒ ඔබලා මෙලෙස ශෝක බියෙන් යුක්ත වූ මේ ජීවිතයෙහිද, මරණ බියෙන් යුක්ත වූ මේ ජීවිතයෙහිද, ඇතැම් විට අෂ්ටාංග සමන්විත උපෝසථය සමාදන් වෙමින්, ඇතැම් විට සමාදන් නොවෙමින් සිටින්නේ, එය ඔවුන්ට මහත් අලාභයක් වූයේය, ඔවුන්ගේ දුර්ලබ්ධයක් වූයේය.\n\n''භාග්‍යවතුන් වහන්ස, අපි අද පටන් අෂ්ටාංග සමන්විත උපෝසථය සමාදන් වන්නෙමු''යි (ඔවුහු පැවසූහ).\n\nසයවන සූත්‍රයයි.",
      "paliTitle": "Sakkasuttaṃ"
    },
    {
      "number": 47,
      "pali": "Ekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Atha kho mahāli licchavi yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho mahāli licchavi bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante hetu, ko paccayo pāpassa kammassa kiriyāya pāpassa kammassa pavattiyā’’ti? ‘‘Lobho kho, mahāli, hetu, lobho paccayo pāpassa kammassa kiriyāya pāpassa kammassa pavattiyā. Doso kho, mahāli, hetu, doso paccayo pāpassa kammassa kiriyāya pāpassa kammassa pavattiyā. Moho kho, mahāli, hetu, moho paccayo pāpassa kammassa kiriyāya pāpassa kammassa pavattiyā. Ayoniso manasikāro kho, mahāli, hetu, ayoniso manasikāro paccayo pāpassa kammassa kiriyāya pāpassa kammassa pavattiyā. Micchāpaṇihitaṃ kho, mahāli, cittaṃ hetu, micchāpaṇihitaṃ cittaṃ paccayo pāpassa kammassa kiriyāya pāpassa kammassa pavattiyāti. Ayaṃ kho, mahāli, hetu, ayaṃ paccayo pāpassa kammassa kiriyāya pāpassa kammassa pavattiyā’’ti. ‘‘Ko pana, bhante, hetu ko paccayo kalyāṇassa kammassa kiriyāya kalyāṇassa kammassa pavattiyā’’ti? ‘‘Alobho kho, mahāli, hetu, alobho paccayo kalyāṇassa kammassa kiriyāya kalyāṇassa kammassa pavattiyā. Adoso kho, mahāli, hetu, adoso paccayo kalyāṇassa kammassa kiriyāya kalyāṇassa kammassa pavattiyā. Amoho kho, mahāli, hetu, amoho paccayo kalyāṇassa kammassa kiriyāya kalyāṇassa kammassa pavattiyā. Yoniso manasikāro kho, mahāli, hetu, yoniso manasikāro paccayo kalyāṇassa kammassa kiriyāya kalyāṇassa kammassa pavattiyā. Sammāpaṇihitaṃ kho, mahāli, cittaṃ hetu, sammāpaṇihitaṃ cittaṃ paccayo kalyāṇassa kammassa kiriyāya kalyāṇassa kammassa pavattiyā. Ayaṃ kho, mahāli, hetu, ayaṃ paccayo kalyāṇassa kammassa kiriyāya kalyāṇassa kammassa pavattiyā. Ime ca, mahāli, dasa dhammā loke na saṃvijjeyyuṃ, nayidha paññāyetha adhammacariyāvisamacariyāti vā dhammacariyāsamacariyāti vā. Yasmā ca kho, mahāli, ime dasa dhammā loke saṃvijjanti, tasmā paññāyati adhammacariyāvisamacariyāti vā dhammacariyāsamacariyāti vā’’ti. Sattamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Vesālī, at the Great Wood, in the Gabled Hall. Then Mahāli the Licchavi approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, Mahāli the Licchavi said this to the Blessed One: “Venerable sir, what is the primary cause, what is the contributing condition, for the performance of unwholesome actions and for the arising and continuation of unwholesome actions?” “Greed, Mahāli, is the primary cause and the contributing condition for the performance of unwholesome actions and for the arising and continuation of unwholesome actions. Hatred, Mahāli, is the primary cause and the contributing condition for the performance of unwholesome actions and for the arising and continuation of unwholesome actions. Delusion, Mahāli, is the primary cause and the contributing condition for the performance of unwholesome actions and for the arising and continuation of unwholesome actions. Unwise attention, Mahāli, is the primary cause and the contributing condition for the performance of unwholesome actions and for the arising and continuation of unwholesome actions. A wrongly directed mind, Mahāli, is the primary cause and the contributing condition for the performance of unwholesome actions and for the arising and continuation of unwholesome actions. These, Mahāli, are the primary causes and contributing conditions for the performance of unwholesome actions and for the arising and continuation of unwholesome actions.”\n\n“And venerable sir, what is the primary cause, what is the contributing condition, for the performance of wholesome actions and for the arising and continuation of wholesome actions?” “Non-greed, Mahāli, is the primary cause and the contributing condition for the performance of wholesome actions and for the arising and continuation of wholesome actions. Non-hatred, Mahāli, is the primary cause and the contributing condition for the performance of wholesome actions and for the arising and continuation of wholesome actions. Non-delusion, Mahāli, is the primary cause and the contributing condition for the performance of wholesome actions and for the arising and continuation of wholesome actions. Wise attention, Mahāli, is the primary cause and the contributing condition for the performance of wholesome actions and for the arising and continuation of wholesome actions. A rightly directed mind, Mahāli, is the primary cause and the contributing condition for the performance of wholesome actions and for the arising and continuation of wholesome actions. These, Mahāli, are the primary causes and contributing conditions for the performance of wholesome actions and for the arising and continuation of wholesome actions. And if these ten factors, Mahāli, were not to exist in the world, then here there would be no discernment of unrighteous, uneven conduct or of righteous, even conduct. But since, Mahāli, these ten factors do exist in the world, therefore there is discernment of unrighteous, uneven conduct or of righteous, even conduct.”",
      "sinhala": "එක් සමයක භාග්‍යවතුන් වහන්සේ වෙසාලියේ මහා වනයේ කූටාගාර ශාලාවේ වැඩසිටින සේක. ඉක්බිති මහාලී ලිච්ඡවී භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය; එළඹ භාග්‍යවතුන් වහන්සේට ආචාර කොට එක් පසෙක වාඩිවිය. එක් පසෙක වාඩිවී සිටි මහාලී ලිච්ඡවී භාග්‍යවතුන් වහන්සේට මෙය කීවේය – \"ස්වාමීනි, අකුසල කර්මයක් කිරීම සඳහාත්, අකුසල කර්මයක් පැවැත්ම සඳහාත් හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?\" \"මහාලී, ලෝභයම හේතුවයි, ලෝභයම ප්‍රත්‍යයයි අකුසල කර්මයක් කිරීම සඳහාත්, අකුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, ද්වේෂයම හේතුවයි, ද්වේෂයම ප්‍රත්‍යයයි අකුසල කර්මයක් කිරීම සඳහාත්, අකුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, මෝහයම හේතුවයි, මෝහයම ප්‍රත්‍යයයි අකුසල කර්මයක් කිරීම සඳහාත්, අකුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, අයෝනිසෝ මනසිකාරයම හේතුවයි, අයෝනිසෝ මනසිකාරයම ප්‍රත්‍යයයි අකුසල කර්මයක් කිරීම සඳහාත්, අකුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, මිත්‍යා ප්‍රණිහිත සිතම හේතුවයි, මිත්‍යා ප්‍රණිහිත සිතම ප්‍රත්‍යයයි අකුසල කර්මයක් කිරීම සඳහාත්, අකුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, අකුසල කර්මයක් කිරීම සඳහාත්, අකුසල කර්මයක් පැවැත්ම සඳහාත් හේතුව මේවාය, ප්‍රත්‍යය මේවාය.\"\n\n\"ස්වාමීනි, කුසල කර්මයක් කිරීම සඳහාත්, කුසල කර්මයක් පැවැත්ම සඳහාත් හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?\" \"මහාලී, අලෝභයම හේතුවයි, අලෝභයම ප්‍රත්‍යයයි කුසල කර්මයක් කිරීම සඳහාත්, කුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, අද්වේෂයම හේතුවයි, අද්වේෂයම ප්‍රත්‍යයයි කුසල කර්මයක් කිරීම සඳහාත්, කුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, අමෝහයම හේතුවයි, අමෝහයම ප්‍රත්‍යයයි කුසල කර්මයක් කිරීම සඳහාත්, කුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, යෝනිසෝ මනසිකාරයම හේතුවයි, යෝනිසෝ මනසිකාරයම ප්‍රත්‍යයයි කුසල කර්මයක් කිරීම සඳහාත්, කුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, සම්මා ප්‍රණිහිත සිතම හේතුවයි, සම්මා ප්‍රණිහිත සිතම ප්‍රත්‍යයයි කුසල කර්මයක් කිරීම සඳහාත්, කුසල කර්මයක් පැවැත්ම සඳහාත්. මහාලී, කුසල කර්මයක් කිරීම සඳහාත්, කුසල කර්මයක් පැවැත්ම සඳහාත් හේතුව මේවාය, ප්‍රත්‍යය මේවාය. මහාලී, මේ දස ධර්මයන් ලෝකයේ නොපවතින්නේ නම්, අධම්මචරියාව හෝ විෂමචරියාව යනු කුමක්ද, ධම්මචරියාව හෝ සමචරියාව යනු කුමක්දැයි මෙහි නොපෙනෙන්නේය. මහාලී, යම් හෙයකින් මේ දස ධර්මයන් ලෝකයේ පවතින්නේද, එබැවින් අධම්මචරියාව හෝ විෂමචරියාව යනු කුමක්ද, ධම්මචරියාව හෝ සමචරියාව යනු කුමක්දැයි පෙනේ.\"",
      "paliTitle": "Mahālisuttaṃ"
    },
    {
      "number": 48,
      "pali": "‘‘Dasayime, bhikkhave, dhammā pabbajitena abhiṇhaṃ paccavekkhitabbā. Katame dasa? ‘Vevaṇṇiyamhi ajjhupagato’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘parapaṭibaddhā me jīvikā’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘añño me ākappo karaṇīyo’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘kacci nu kho me attā sīlato na upavadatī’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘kacci nu kho maṃ anuvicca viññū sabrahmacārī sīlato na upavadantī’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘sabbehi me piyehi manāpehi nānābhāvo vinābhāvo’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘kammassakomhi kammadāyādo kammayoni kammabandhu kammapaṭisaraṇo, yaṃ kammaṃ karissāmi kalyāṇaṃ vā pāpakaṃ vā tassa dāyādo bhavissāmī’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘kathaṃbhūtassa me rattindivā vītivattantī’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘kacci nu kho ahaṃ suññāgāre abhiramāmī’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ; ‘atthi nu kho me uttari manussadhammo alamariyañāṇadassanaviseso adhigato, yenāhaṃ [yohaṃ (sī. pī. ka.), sohaṃ (syā.)] pacchime kāle sabrahmacārīhi puṭṭho na maṅku bhavissāmī’ti pabbajitena abhiṇhaṃ paccavekkhitabbaṃ. Ime kho, bhikkhave, dasa dhammā pabbajitena abhiṇhaṃ paccavekkhitabbā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, these ten things should be constantly reflected upon by one who has gone forth. Which ten?\n\n‘I have taken on a different status in life’ — this should be constantly reflected upon by one who has gone forth.\n‘My livelihood is dependent on others’ — this should be constantly reflected upon by one who has gone forth.\n‘A different comportment is to be practiced by me’ — this should be constantly reflected upon by one who has gone forth.\n‘Does my own conscience not reproach me concerning my moral conduct?’ — this should be constantly reflected upon by one who has gone forth.\n‘Do my wise fellow monastics, having investigated, not reproach me concerning my moral conduct?’ — this should be constantly reflected upon by one who has gone forth.\n‘There is separation and severance from all that is dear and pleasing to me’ — this should be constantly reflected upon by one who has gone forth.\n‘I am the owner of my actions, the heir of my actions, born of my actions, related through my actions, and have my actions as my refuge. Whatever action I shall do, whether good or evil, of that I shall be the heir’ — this should be constantly reflected upon by one who has gone forth.\n‘How are my nights and days passing?’ — this should be constantly reflected upon by one who has gone forth.\n‘Do I truly delight in secluded dwellings?’ — this should be constantly reflected upon by one who has gone forth.\n‘Is there in me any superhuman quality, a truly noble knowledge and vision of distinction attained, by which, if I am questioned by my fellow monastics at a later time, I would not be embarrassed?’ — this should be constantly reflected upon by one who has gone forth.\n\nThese, monks, are the ten things that should be constantly reflected upon by one who has gone forth.",
      "sinhala": "මහණෙනි, පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතු ධර්ම කරුණු දහයක් ඇත. ඒ දහය කවරේද? ‘මම වෙනස් වූ ස්වභාවයකට එළඹියෙමි’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘මගේ ජීවිතය අනුන් මත රඳා පවතී’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘මා විසින් කළ යුතු පැවතුම් (ආකල්පය) වෙනස්ය’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘සිල්වතකු ලෙස මගේ සිත මට චෝදනා නොකරන්නේදැයි’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘මා හොඳින් පරීක්ෂා කර බලා බුද්ධිමත් සබ්‍රහ්මචාරීන් සිල්වතකු ලෙස මට චෝදනා නොකරන්නේදැයි’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘මා ප්‍රිය කරන සියලු දේ, මනාව සතුටු කරන සියලු දේ සමඟ විවිධත්වය, වෙන්වීම ඇත’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘මම කර්මයට අයිති වෙමි, කර්මයේ උරුමකරු වෙමි, කර්මයෙන් උපන් තැනැත්තෙක් වෙමි, කර්මය ඥාතියා කොට ඇත්තෙක් වෙමි, කර්මය සරණ කොට ඇත්තෙක් වෙමි, යම් යහපත් හෝ අයහපත් කර්මයක් කරම්ද, එහි ඵල උරුම කරගන්නෙමි’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘මා කෙසේ සිටිද්දී දිවා රෑ ගෙවී යන්නේදැයි’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘මම හුදෙකලා ස්ථානවල ඇලී වාසය කරන්නේදැයි’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. ‘මට අති මානුෂික ධර්මයක්, ආර්ය ඥාන දර්ශනයෙහි සුවිශේෂත්වයක් (විශේෂ දැනුමක් හා දැක්මක්) ලැබී තිබේදැයි, යමක් නිසා අවසාන කාලයේදී සබ්‍රහ්මචාරීන් විසින් විමසන කල, මම ලජ්ජාවට පත් නොවෙම්දැයි’ යැයි පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි. මහණෙනි, මේ ධර්ම කරුණු දහය පැවිද්දා විසින් නිරතුරු මෙනෙහි කළ යුතුයි.",
      "paliTitle": "Pabbajitaabhiṇhasuttaṃ"
    },
    {
      "number": 49,
      "pali": "‘‘Dasayime, bhikkhave, dhammā sarīraṭṭhā. Katame dasa? Sītaṃ, uṇhaṃ, jighacchā, pipāsā, uccāro, passāvo, kāyasaṃvaro, vacīsaṃvaro, ājīvasaṃvaro, ponobhaviko [ponobbhaviko (ka.)] bhavasaṅkhāro – ime kho, bhikkhave, dasa dhammā sarīraṭṭhā’’ti. Navamaṃ.",
      "english": "Monks, these ten qualities are rooted in the body. Which ten? Cold, heat, hunger, thirst, defecation, urination, restraint of bodily action, restraint of speech, restraint of livelihood, and volitional formations leading to renewed existence—these, monks, are the ten qualities rooted in the body.",
      "sinhala": "භික්‍ෂූණි, මේ දස ධර්‍මයෝ ශරීරයෙහි පවත්නාහූය. ඒ දසය කවරේද? සීතය, උෂ්ණය, සාය, පිපාසා, මල පහකිරීම, මුත්‍ර පහකිරීම, කාය සංවරය, වචී සංවරය, ආජීව සංවරය, පුණර්භවයට හේතු වන භව සංස්කාරය යන මේ දස ධර්‍මයෝ ශරීරයෙහි පවත්නාහූය.",
      "paliTitle": "Sarīraṭṭhadhammasuttaṃ"
    },
    {
      "number": 50,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena sambahulā bhikkhū pacchābhattaṃ piṇḍapātapaṭikkantā upaṭṭhānasālāyaṃ sannisinnā sannipatitā bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā sannipatitā, kā ca pana vo antarākathā vippakatā’’ti? ‘‘Idha mayaṃ, bhante, pacchābhattaṃ piṇḍapātapaṭikkantā upaṭṭhānasālāyaṃ sannisinnā sannipatitā bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharāmā’’ti. ‘‘Na kho panetaṃ, bhikkhave, tumhākaṃ patirūpaṃ kulaputtānaṃ saddhāya agārasmā anagāriyaṃ pabbajitānaṃ, yaṃ tumhe bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā vihareyyātha. ‘‘Dasayime, bhikkhave, dhammā sāraṇīyā piyakaraṇā garukaraṇā [piyakarāṇā garukarāṇā (?)] saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattanti. Katame dasa? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Yampi, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Yampi, bhikkhave, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. Yampi, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato khamo padakkhiṇaggāhī anusāsaniṃ. Yampi, bhikkhave, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato khamo padakkhiṇaggāhī anusāsaniṃ, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni – tattha dakkho hoti analaso, tatrūpāyāya vīmaṃsāya samannāgato alaṃ kātuṃ alaṃ saṃvidhātuṃ. Yampi, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni – tattha dakkho hoti analaso tatrūpāyāya vīmaṃsāya samannāgato alaṃ kātuṃ alaṃ saṃvidhātuṃ, ayampi dhammo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo. Yampi, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yampi, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu, ayampi dhammo sāraṇīyo piyakaraṇo garukaraṇo saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. Yampi, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena, ayampi dhammo sāraṇīyo…pe… saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu satimā hoti, paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. Yampi, bhikkhave, bhikkhu satimā hoti, paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā, ayampi dhammo sāraṇīyo…pe… saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Yampi, bhikkhave, bhikkhu paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā, ayampi dhammo sāraṇīyo…pe… saṃvattati. Ime kho, bhikkhave, dasa dhammā sāraṇīyā piyakaraṇā garukaraṇā saṅgahāya avivādāya sāmaggiyā ekībhāvāya saṃvattantī’’ti. Dasamaṃ.",
      "english": "Once the Blessed One was staying at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. At that time, a number of monks, having returned from their alms-round after their meal, were sitting together in the service hall, having gathered there, engaged in quarreling, brawling, and disputing, assailing one another with verbal spears. Then, in the evening, the Blessed One arose from his seclusion and went to the service hall. Having approached, he sat down on the appointed seat. Having sat down, the Blessed One addressed the monks: \"Monks, what kind of talk are you engaged in now, as you sit assembled here? And what was the discussion that remained unfinished among you?\"\n\n\"Venerable sir, here, having returned from our alms-round after our meal, we were sitting together in the service hall, having gathered there, engaged in quarreling, brawling, and disputing, assailing one another with verbal spears.\" \"Monks, it is not fitting for you, sons of good families, who have gone forth from the home life into homelessness out of faith, that you should be engaged in quarreling, brawling, and disputing, assailing one another with verbal spears.\"\n\n\"Monks, these ten things are conducive to remembrance, to affection, to reverence, to fellowship, to non-dispute, to concord, to unity. Which ten?\"\n\n\"Here, monks, a monk is virtuous; he dwells restrained by the Pātimokkha restraint, perfect in conduct and domain, seeing danger in the slightest faults, undertaking and training in the training rules. That a monk is virtuous; he dwells restrained by the Pātimokkha restraint, perfect in conduct and domain, seeing danger in the slightest faults, undertaking and training in the training rules—this too is a thing conducive to remembrance, to affection, to reverence, to fellowship, to non-dispute, to concord, to unity.\"\n\n\"Furthermore, monks, a monk is learned, a preserver of what has been heard, a collector of what has been heard. Those teachings that are good in the beginning, good in the middle, and good in the end, with their meaning and their letter, proclaiming the entirely complete and purified holy life—such teachings are much heard by him, borne in mind, recited aloud, contemplated mentally, and well penetrated by understanding. That a monk is learned, a preserver of what has been heard, a collector of what has been heard, those teachings that are good in the beginning, good in the middle, and good in the end, with their meaning and their letter, proclaiming the entirely complete and purified holy life—such teachings are much heard by him, borne in mind, recited aloud, contemplated mentally, and well penetrated by understanding—this too is a thing conducive to remembrance, to affection, to reverence, to fellowship, to non-dispute, to concord, to unity.\"\n\n\"Furthermore, monks, a monk is a good friend, a good companion, and a good associate. That a monk is a good friend, a good companion, and a good associate—this too is a thing conducive to remembrance, to affection, to reverence, to fellowship, to non-dispute, to concord, to unity.\"\n\n\"Furthermore, monks, a monk is amenable to admonition; he possesses qualities that make him easy to admonish, is patient, and readily accepts instruction. That a monk is amenable to admonition; he possesses qualities that make him easy to admonish, is patient, and readily accepts instruction—this too is a thing conducive to remembrance, to affection, to reverence, to fellowship, to non-dispute, to concord, to unity.\"\n\n\"Furthermore, monks, a monk is skilled and energetic concerning the various duties of his fellow practitioners; he is endowed with appropriate discernment to be able to accomplish and arrange them. That a monk is skilled and energetic concerning the various duties of his fellow practitioners; he is endowed with appropriate discernment to be able to accomplish and arrange them—this too is a thing conducive to affection, to reverence, to fellowship, to non-dispute, to concord, to unity.\"\n\n\"Furthermore, monks, a monk is one who delights in the Dhamma, a pleasant speaker, greatly joyful in the Abhidhamma and Abhivinaya. That a monk delights in the Dhamma, a pleasant speaker, greatly joyful in the Abhidhamma and Abhivinaya—this too is a thing conducive to remembrance, to affection, to reverence, to fellowship, to non-dispute, to concord, to unity.\"\n\n\"Furthermore, monks, a monk dwells with aroused energy for the abandoning of unwholesome states and the acquisition of wholesome states; he is steadfast, firm in effort, and does not lay down the burden in regard to wholesome states. That a monk dwells with aroused energy for the abandoning of unwholesome states and the acquisition of wholesome states; he is steadfast, firm in effort, and does not lay down the burden in regard to wholesome states—this too is a thing conducive to remembrance, to affection, to reverence, to fellowship, to non-dispute, to concord, to unity.\"\n\n\"Furthermore, monks, a monk is content with whatever robes, alms-food, lodging, and medicinal requisites for the sick he receives. That a monk is content with whatever robes, alms-food, lodging, and medicinal requisites for the sick he receives—this too is a thing conducive to remembrance, to affection, to reverence, to fellowship, to non-dispute, to concord, to unity.\"\n\nFurthermore, monks, a monk is mindful, endowed with supreme mindfulness and circumspection, remembering and recollecting even what was done long ago and spoken long ago. Whatever a monk is mindful, endowed with supreme mindfulness and circumspection, remembering and recollecting even what was done long ago and spoken long ago – this quality also leads to amiability, endearment, respect, harmony, non-dispute, unity, and accord.\n\nFurthermore, monks, a monk is wise, endowed with wisdom that discerns rise and fall, noble, penetrative, and leads to the complete destruction of suffering. Whatever a monk is wise, endowed with wisdom that discerns rise and fall, noble, penetrative, and leads to the complete destruction of suffering – this quality also leads to amiability, endearment, respect, harmony, non-dispute, unity, and accord.\n\nThese ten qualities, monks, lead to amiability, endearment, respect, harmony, non-dispute, unity, and accord.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල බොහෝ භික්ෂූහු දහවල් දානය වළඳා, පිණ්ඩපාතයෙන් ආපසු වැඩ, උපස්ථාන ශාලාවෙහි රැස්ව, වාද භේද ඇතිකර ගනිමින්, කලහයට පැමිණ, විවාදයට වැටී, එකිනෙකාට වචන රළුසීවලින් විදින්නාහු වාසය කළහ. ඉක්බිති භාග්‍යවතුන් වහන්සේ සවස් කාලයෙහි භාවනා සුවයෙන් නැගිට, යම් තැනෙක උපස්ථාන ශාලාව තිබුණේද, එතැනට වැඩිසේක; වැඩ, පණවන ලද අසුනෙහි වැඩහුන් සේක. වැඩහිඳ භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළසේක: “මහණෙනි, දැන් නුඹලා කුමන කථාවකින් එක්ව වාඩි වී සිටින්නහුද? නුඹලාගේ අතරමැද ඇතිව තිබූ කථාව කුමක්ද?” “ස්වාමීනි, මෙහි අපි දහවල් දානය වළඳා, පිණ්ඩපාතයෙන් ආපසු වැඩ, උපස්ථාන ශාලාවෙහි රැස්ව, වාද භේද ඇතිකර ගනිමින්, කලහයට පැමිණ, විවාදයට වැටී, එකිනෙකාට වචන රළුසීවලින් විදින්නාහු වාසය කළෙමු.” “මහණෙනි, ශ්‍රද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරිකභාවයෙහි පැවිදි වූ කුලපුත්‍රයන් වන නුඹලාට, මෙසේ වාද භේද ඇතිකරගෙන, කලහයට පැමිණ, විවාදයට වැටී, එකිනෙකාට වචන රළුසීවලින් විදින්නාහු වාසය කිරීම සුදුසු නොවේ.\n\n“මහණෙනි, මේ ධර්ම දහය සිහිකළ යුත්තාහ; ප්‍රිය භාවයට හේතු වන්නාහ; ගරු කළ යුත්තාහ; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නාහ. ඒ දස ධර්මයෝ කවරහුද? මහණෙනි, මෙහි භික්ෂුව සීලවන්ත වෙයි. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, හොඳ ආචාර පැවතුම් ඇති, සුදුසු ගෝචර ඇති, අල්පමාත්‍ර වූ වරදවල් වල පවා භය දකින සුළු වූයේ, ශික්ෂාපද සමාදන්ව හික්මෙයි. මහණෙනි, යම් හෙයකින් භික්ෂුව සීලවන්ත වෙයි, ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, හොඳ ආචාර පැවතුම් ඇති, සුදුසු ගෝචර ඇති, අල්පමාත්‍ර වූ වරදවල් වල පවා භය දකින සුළු වූයේ, ශික්ෂාපද සමාදන්ව හික්මෙයි, මේ ධර්මයද සිහිකළ යුත්තකි; ප්‍රිය භාවයට හේතු වන්නකි; ගරු කළ යුත්තකි; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නකි.\n\n“නැවතද මහණෙනි, භික්ෂුව බහුශ්‍රැත වෙයි. ඇසූ දේ දරාගන්නා සුළුය, ඇසූ දේ ගබඩා කරගන්නා සුළුය. යම් ඒ ධර්මයන් මුල යහපත්ව, මැද යහපත්ව, අග යහපත්ව, අර්ථ සහිතව, ව්‍යංජන (වචන) සහිතව, සියල්ලෙන් පිරිපුන්, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේද, එවැනි ධර්මයන් ඔහුට බහුශ්‍රැත වෙති. ඒවා කටපාඩම් කර ඇත; කටින් පුරුදු කර ඇත; මනසින් විමසා බලා ඇත; දැක්මෙන් (නුවණින්) මැනවින් විනිවිද දරාගෙන ඇත. මහණෙනි, යම් හෙයකින් භික්ෂුව බහුශ්‍රැත වෙයි, ඇසූ දේ දරාගන්නා සුළුය, ඇසූ දේ ගබඩා කරගන්නා සුළුය. යම් ඒ ධර්මයන් මුල යහපත්ව, මැද යහපත්ව, අග යහපත්ව, අර්ථ සහිතව, ව්‍යංජන (වචන) සහිතව, සියල්ලෙන් පිරිපුන්, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේද, එවැනි ධර්මයන් ඔහුට බහුශ්‍රැත වෙති. ඒවා කටපාඩම් කර ඇත; කටින් පුරුදු කර ඇත; මනසින් විමසා බලා ඇත; දැක්මෙන් (නුවණින්) මැනවින් විනිවිද දරාගෙන ඇත, මේ ධර්මයද සිහිකළ යුත්තකි; ප්‍රිය භාවයට හේතු වන්නකි; ගරු කළ යුත්තකි; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නකි.\n\n“නැවතද මහණෙනි, භික්ෂුව කල්‍යාණ මිත්‍රයෙක් වෙයි, කල්‍යාණ සහායෙක් වෙයි, කල්‍යාණ සම්පවංක (යහපත් ආශ්‍රය ඇති) කෙනෙක් වෙයි. මහණෙනි, යම් හෙයකින් භික්ෂුව කල්‍යාණ මිත්‍රයෙක් වෙයි, කල්‍යාණ සහායෙක් වෙයි, කල්‍යාණ සම්පවංක කෙනෙක් වෙයි, මේ ධර්මයද සිහිකළ යුත්තකි; ප්‍රිය භාවයට හේතු වන්නකි; ගරු කළ යුත්තකි; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නකි.\n\n“නැවතද මහණෙනි, භික්ෂුව සුපේෂල වෙයි (කීකරු වෙයි); කීකරු බවට හේතු වන ධර්මයන්ගෙන් යුක්ත වෙයි; ඉවසීමෙන් යුක්ත වෙයි; අනුශාසනාව පිළිගන්නා සුළු වෙයි. මහණෙනි, යම් හෙයකින් භික්ෂුව සුපේෂල වෙයි; කීකරු බවට හේතු වන ධර්මයන්ගෙන් යුක්ත වෙයි; ඉවසීමෙන් යුක්ත වෙයි; අනුශාසනාව පිළිගන්නා සුළු වෙයි, මේ ධර්මයද සිහිකළ යුත්තකි; ප්‍රිය භාවයට හේතු වන්නකි; ගරු කළ යුත්තකි; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නකි.\n\n“නැවතද මහණෙනි, භික්ෂුව යම් ඒ උස් පහත් (විවිධ) කිසිවක් කළ යුතු දේවල් (සේවාවන්) භික්ෂූන්ට ඇත්නම්, එහි දක්ෂ වෙයි; අලස නොවේ; ඒ සඳහා සුදුසු විමසීමකින් යුක්ත වෙයි; ඒවා කිරීමටත්, ඒවා සංවිධානය කිරීමටත් සමත් වෙයි. මහණෙනි, යම් හෙයකින් භික්ෂුව යම් ඒ උස් පහත් කිසිවක් කළ යුතු දේවල් භික්ෂූන්ට ඇත්නම්, එහි දක්ෂ වෙයි; අලස නොවේ; ඒ සඳහා සුදුසු විමසීමකින් යුක්ත වෙයි; ඒවා කිරීමටත්, ඒවා සංවිධානය කිරීමටත් සමත් වෙයි, මේ ධර්මයද ප්‍රිය භාවයට හේතු වන්නකි; ගරු කළ යුත්තකි; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නකි.\n\n“නැවතද මහණෙනි, භික්ෂුව ධර්මයට කැමති වෙයි; ප්‍රිය කථා ඇති වෙයි; අභිධර්මයෙහිද, අභිවිනයෙහිද මහත් ප්‍රීතියෙන් යුක්ත වෙයි. මහණෙනි, යම් හෙයකින් භික්ෂුව ධර්මයට කැමති වෙයි; ප්‍රිය කථා ඇති වෙයි; අභිධර්මයෙහිද, අභිවිනයෙහිද මහත් ප්‍රීතියෙන් යුක්ත වෙයි, මේ ධර්මයද සිහිකළ යුත්තකි; ප්‍රිය භාවයට හේතු වන්නකි; ගරු කළ යුත්තකි; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නකි.\n\n“නැවතද මහණෙනි, භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, ආරම්භ කරන ලද වීර්යයෙන් යුක්තව වාසය කරයි; ස්ථිර ශක්තියෙන් යුක්තය; දැඩි උත්සාහයෙන් යුක්තය; කුසල ධර්මයන්හි නොපසුබස්නා වීරිය ඇත්තේය. මහණෙනි, යම් හෙයකින් භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් උපදවා ගැනීම පිණිසත්, ආරම්භ කරන ලද වීර්යයෙන් යුක්තව වාසය කරයි; ස්ථිර ශක්තියෙන් යුක්තය; දැඩි උත්සාහයෙන් යුක්තය; කුසල ධර්මයන්හි නොපසුබස්නා වීරිය ඇත්තේය, මේ ධර්මයද සිහිකළ යුත්තකි; ප්‍රිය භාවයට හේතු වන්නකි; ගරු කළ යුත්තකි; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නකි.\n\n“නැවතද මහණෙනි, භික්ෂුව පහසුවෙන් ලැබෙන යම් චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර වේද, එයින් සතුටු වෙයි. මහණෙනි, යම් හෙයකින් භික්ෂුව පහසුවෙන් ලැබෙන යම් චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකර වේද, එයින් සතුටු වෙයි, මේ ධර්මයද සිහිකළ යුත්තකි; ප්‍රිය භාවයට හේතු වන්නකි; ගරු කළ යුත්තකි; සංග්‍රහය පිණිසත්, අවිවාදය පිණිසත්, සමගිය පිණිසත්, එකමුතුකම පිණිසත් පවතින්නකි.\n\nතවද, මහණෙනි, භික්ෂුව සිහි ඇතියේ වෙයි. උතුම් සිහි නුවණින් යුක්තව බොහෝ කලකට පෙර කරන ලද හෝ කියන ලද දේ පවා සිහි කරන්නේද, නැවත නැවත සිහිපත් කරන්නේද වෙයි. මහණෙනි, යම් හෙයකින් භික්ෂුව සිහි ඇතියේ වෙයි, උතුම් සිහි නුවණින් යුක්තව බොහෝ කලකට පෙර කරන ලද හෝ කියන ලද දේ පවා සිහි කරන්නේද, නැවත නැවත සිහිපත් කරන්නේද වෙයිද, මේ ධර්‍මයද සාරණීය වූ, ප්‍රිය උපදවන, ගරු කටයුතු වූ, සං​ග්‍රහය පිණිස, අවිවාදය පිණිස, සමඟිය පිණිස, එකමුතුකම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව ප්‍රඥාවන්ත වෙයි. හටගැනීම හා නැතිවීම දකින, ආර්ය වූ, සත්‍යය විනිවිද දකින, මනාව දුක් ක්ෂය කිරීම කරා යන ප්‍රඥාවෙන් යුක්ත වෙයි. මහණෙනි, යම් හෙයකින් භික්ෂුව ප්‍රඥාවන්ත වෙයි, හටගැනීම හා නැතිවීම දකින, ආර්ය වූ, සත්‍යය විනිවිද දකින, මනාව දුක් ක්ෂය කිරීම කරා යන ප්‍රඥාවෙන් යුක්ත වෙයිද, මේ ධර්‍මයද සාරණීය වූ, ප්‍රිය උපදවන, ගරු කටයුතු වූ, සං​ග්‍රහය පිණිස, අවිවාදය පිණිස, සමඟිය පිණිස, එකමුතුකම පිණිස පවතී.\n\nමහණෙනි, මේ දස ධර්‍මයන් සාරණීය වූ, ප්‍රිය උපදවන, ගරු කටයුතු වූ, සං​ග්‍රහය පිණිස, අවිවාදය පිණිස, සමඟිය පිණිස, එකමුතුකම පිණිස පවතින්නේය.",
      "paliTitle": "Bhaṇḍanasuttaṃ"
    },
    {
      "number": 2,
      "pali": "Dutiyapaṇṇāsakaṃ",
      "english": "The Second Fifty",
      "sinhala": "දෙවෙනි පණ්ණාසකය",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": " Akkosavaggo pañcamo. Tassuddānaṃ – Vivādā dve ca mūlāni, kusinārapavesane; Sakko mahāli abhiṇhaṃ, sarīraṭṭhā ca bhaṇḍanāti. Paṭhamapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}