{
  "id": "an10.10",
  "title": {
    "pali": "Upālivaggo",
    "english": "The Chapter on Upāli",
    "sinhala": "උපාළි වග්ගය"
  },
  "sections": [
    {
      "number": 91,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Dasayime, gahapati, kāmabhogī santo saṃvijjamānā lokasmiṃ. Katame dasa? Idha, gahapati, ekacco kāmabhogī adhammena bhoge pariyesati sāhasena; adhammena bhoge pariyesitvā sāhasena na attānaṃ sukheti na pīṇeti [na attānaṃ sukheti pīṇeti (sī. syā. pī.) evamuparipi] na saṃvibhajati na puññāni karoti. ‘‘Idha pana, gahapati, ekacco kāmabhogī adhammena bhoge pariyesati sāhasena; adhammena bhoge pariyesitvā sāhasena attānaṃ sukheti pīṇeti, na saṃvibhajati na puññāni karoti. ‘‘Idha pana, gahapati, ekacco kāmabhogī adhammena bhoge pariyesati sāhasena; adhammena bhoge pariyesitvā sāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. ‘‘Idha pana, gahapati, ekacco kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi; dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi na attānaṃ sukheti na pīṇeti na saṃvibhajati na puññāni karoti. ‘‘Idha pana, gahapati, ekacco kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi; dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi attānaṃ sukheti pīṇeti, na saṃvibhajati na puññāni karoti. ‘‘Idha pana, gahapati, ekacco kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi; dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. ‘‘Idha pana, gahapati, ekacco kāmabhogī dhammena bhoge pariyesati asāhasena; dhammena bhoge pariyesitvā asāhasena na attānaṃ sukheti na pīṇeti na saṃvibhajati na puññāni karoti. ‘‘Idha pana, gahapati, ekacco kāmabhogī dhammena bhoge pariyesati asāhasena; dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti, na saṃvibhajati na puññāni karoti. ‘‘Idha pana, gahapati, ekacco kāmabhogī dhammena bhoge pariyesati asāhasena; dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. Te ca bhoge gathito [gadhito (ka.) a. ni. 3.124 passitabbaṃ] mucchito ajjhosanno [ajjhāpanno (sabbattha) a. ni. 3.124 suttavaṇṇanā ṭīkā oloketabbā] anādīnavadassāvī anissaraṇapañño paribhuñjati. ‘‘Idha pana, gahapati, ekacco kāmabhogī dhammena bhoge pariyesati asāhasena; dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti. Te ca bhoge agathito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī adhammena bhoge pariyesati sāhasena, adhammena bhoge pariyesitvā sāhasena na attānaṃ sukheti na pīṇeti na saṃvibhajati na puññāni karoti, ayaṃ, gahapati, kāmabhogī tīhi ṭhānehi gārayho. ‘Adhammena bhoge pariyesati sāhasenā’ti, iminā paṭhamena ṭhānena gārayho. ‘Na attānaṃ sukheti na pīṇetī’ti, iminā dutiyena ṭhānena gārayho. ‘Na saṃvibhajati na puññāni karotī’ti, iminā tatiyena ṭhānena gārayho. Ayaṃ, gahapati, kāmabhogī imehi tīhi ṭhānehi gārayho. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī adhammena bhoge pariyesati sāhasena, adhammena bhoge pariyesitvā sāhasena attānaṃ sukheti pīṇeti na saṃvibhajati na puññāni karoti, ayaṃ, gahapati, kāmabhogī dvīhi ṭhānehi gārayho ekena ṭhānena pāsaṃso. ‘Adhammena bhoge pariyesati sāhasenā’ti, iminā paṭhamena ṭhānena gārayho. ‘Attānaṃ sukheti pīṇetī’ti, iminā ekena ṭhānena pāsaṃso. ‘Na saṃvibhajati na puññāni karotī’ti iminā dutiyena ṭhānena gārayho. Ayaṃ, gahapati, kāmabhogī imehi dvīhi ṭhānehi gārayho iminā ekena ṭhānena pāsaṃso. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī adhammena bhoge pariyesati sāhasena, adhammena bhoge pariyesitvā sāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti, ayaṃ, gahapati, kāmabhogī ekena ṭhānena gārayho dvīhi ṭhānehi pāsaṃso. ‘Adhammena bhoge pariyesati sāhasenā’ti, iminā ekena ṭhānena gārayho. ‘Attānaṃ sukheti pīṇetī’ti, iminā paṭhamena ṭhānena pāsaṃso. ‘Saṃvibhajati puññāni karotī’ti, iminā dutiyena ṭhānena pāsaṃso. Ayaṃ, gahapati, kāmabhogī iminā ekena ṭhānena gārayho, imehi dvīhi ṭhānehi pāsaṃso. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi, dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi na attānaṃ sukheti na pīṇeti na saṃvibhajati na puññāni karoti, ayaṃ, gahapati, kāmabhogī ekena ṭhānena pāsaṃso tīhi ṭhānehi gārayho. ‘Dhammena bhoge pariyesati asāhasenā’ti, iminā ekena ṭhānena pāsaṃso. ‘Adhammena bhoge pariyesati sāhasenā’ti, iminā paṭhamena ṭhānena gārayho. ‘Na attānaṃ sukheti na pīṇetī’ti, iminā dutiyena ṭhānena gārayho. ‘Na saṃvibhajati na puññāni karotī’ti, iminā tatiyena ṭhānena gārayho. Ayaṃ, gahapati, kāmabhogī iminā ekena ṭhānena pāsaṃso imehi tīhi ṭhānehi gārayho. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi, dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi attānaṃ sukheti pīṇeti na saṃvibhajati na puññāni karoti, ayaṃ, gahapati, kāmabhogī dvīhi ṭhānehi pāsaṃso dvīhi ṭhānehi gārayho. ‘Dhammena bhoge pariyesati asāhasenā’ti, iminā paṭhamena ṭhānena pāsaṃso. ‘Adhammena bhoge pariyesati sāhasenā’ti, iminā paṭhamena ṭhānena gārayho. ‘Attānaṃ sukheti pīṇetī’ti, iminā dutiyena ṭhānena pāsaṃso. ‘Na saṃvibhajati na puññāni karotī’ti, iminā dutiyena ṭhānena gārayho. Ayaṃ, gahapati, kāmabhogī imehi dvīhi ṭhānehi pāsaṃso imehi dvīhi ṭhānehi gārayho. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī dhammādhammena bhoge pariyesati sāhasenapi asāhasenapi, dhammādhammena bhoge pariyesitvā sāhasenapi asāhasenapi attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti, ayaṃ, gahapati, kāmabhogī tīhi ṭhānehi pāsaṃso ekena ṭhānena gārayho. ‘Dhammena bhoge pariyesati asāhasenā’ti, iminā paṭhamena ṭhānena pāsaṃso. ‘Adhammena bhoge pariyesati sāhasenā’ti, iminā ekena ṭhānena gārayho. ‘Attānaṃ sukheti pīṇetī’ti, iminā dutiyena ṭhānena pāsaṃso. ‘Saṃvibhajati puññāni karotī’ti, iminā tatiyena ṭhānena pāsaṃso. Ayaṃ, gahapati, kāmabhogī imehi tīhi ṭhānehi pāsaṃso iminā ekena ṭhānena gārayho. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena na attānaṃ sukheti na pīṇeti na saṃvibhajati na puññāni karoti, ayaṃ, gahapati, kāmabhogī ekena ṭhānena pāsaṃso dvīhi ṭhānehi gārayho. Dhammena bhoge pariyesati asāhasenā’ti, iminā ekena ṭhānena pāsaṃso. ‘Na attānaṃ sukheti na pīṇetī’ti, iminā paṭhamena ṭhānena gārayho. ‘Na saṃvibhajati na puññāni karotī’ti, iminā dutiyena ṭhānena gārayho. Ayaṃ, gahapati, kāmabhogī iminā ekena ṭhānena pāsaṃso imehi dvīhi ṭhānehi gārayho. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti na saṃvibhajati na puññāni karoti, ayaṃ, gahapati, kāmabhogī dvīhi ṭhānehi pāsaṃso ekena ṭhānena gārayho. ‘Dhammena bhoge pariyesati asāhasenā’ti, iminā paṭhamena ṭhānena pāsaṃso. ‘Attānaṃ sukheti pīṇetī’ti, iminā dutiyena ṭhānena pāsaṃso. ‘Na saṃvibhajati na puññāni karotī’ti iminā ekena ṭhānena gārayho. Ayaṃ, gahapati, kāmabhogī imehi dvīhi ṭhānehi pāsaṃso iminā ekena ṭhānena gārayho. ‘‘Tatra, gahapati yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti, te ca bhoge gathito mucchito ajjhosanno anādīnavadassāvī anissaraṇapañño paribhuñjati, ayaṃ, gahapati, kāmabhogī tīhi ṭhānehi pāsaṃso ekena ṭhānena gārayho. ‘Dhammena bhoge pariyesati asāhasenā’ti, iminā paṭhamena ṭhānena pāsaṃso. ‘Attānaṃ sukheti pīṇetī’ti, iminā dutiyena ṭhānena pāsaṃso. ‘Saṃvibhajati puññāni karotī’ti, iminā tatiyena ṭhānena pāsaṃso. ‘Te ca bhoge gathito mucchito ajjhosanno anādīnavadassāvī anissaraṇapañño paribhuñjatī’ti, iminā ekena ṭhānena gārayho. Ayaṃ, gahapati, kāmabhogī imehi tīhi ṭhānehi pāsaṃso iminā ekena ṭhānena gārayho. ‘‘Tatra, gahapati, yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti, te ca bhoge agathito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati, ayaṃ, gahapati, kāmabhogī catūhi ṭhānehi pāsaṃso. ‘Dhammena bhoge pariyesati asāhasenā’ti, iminā paṭhamena ṭhānena pāsaṃso. ‘Attānaṃ sukheti pīṇetī’ti, iminā dutiyena ṭhānena pāsaṃso. ‘Saṃvibhajati puññāni karotī’ti, iminā tatiyena ṭhānena pāsaṃso. ‘Te ca bhoge agathito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjatī’ti, iminā catutthena ṭhānena pāsaṃso. Ayaṃ, gahapati, kāmabhogī imehi catūhi ṭhānehi pāsaṃso. ‘‘Ime kho, gahapati, dasa kāmabhogī santo saṃvijjamānā lokasmiṃ. Imesaṃ kho, gahapati, dasannaṃ kāmabhogīnaṃ yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti, te ca bhoge agathito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati, ayaṃ imesaṃ dasannaṃ kāmabhogīnaṃ aggo ca seṭṭho ca pāmokkho [mokkho (ka. sī.) a. ni. 4.95; 5.181; saṃ. ni. 3.662] ca uttamo ca pavaro ca. Seyyathāpi, gahapati, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo. Sappimaṇḍo tattha aggamakkhāyati. Evamevaṃ kho, gahapati, imesaṃ dasannaṃ kāmabhogīnaṃ yvāyaṃ kāmabhogī dhammena bhoge pariyesati asāhasena, dhammena bhoge pariyesitvā asāhasena attānaṃ sukheti pīṇeti saṃvibhajati puññāni karoti, te ca bhoge agathito amucchito anajjhosanno ādīnavadassāvī nissaraṇapañño paribhuñjati, ayaṃ imesaṃ dasannaṃ kāmabhogīnaṃ aggo ca seṭṭho ca pāmokkho [mokkho (ka. sī.) a. ni. 5.181] ca uttamo ca pavaro cā’’ti. Paṭhamaṃ.",
      "english": "Once, the Blessed One was dwelling in Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s monastery. Then the householder Anāthapiṇḍika approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side. As the householder Anāthapiṇḍika sat to one side, the Blessed One said this to him: “Householder, these ten types of individuals who indulge in sense pleasures are found existing in the world. Which are these ten?\n\nHere, householder, a certain individual who indulges in sense pleasures seeks wealth unrighteously, through force. Having sought wealth unrighteously, through force, he neither makes himself happy nor nourishes himself, nor does he share with others, nor does he perform meritorious deeds.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth unrighteously, through force. Having sought wealth unrighteously, through force, he makes himself happy and nourishes himself, but he neither shares with others nor performs meritorious deeds.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth unrighteously, through force. Having sought wealth unrighteously, through force, he makes himself happy and nourishes himself, shares with others, and performs meritorious deeds.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth partly righteously and partly unrighteously, partly through force and partly without force. Having sought wealth partly righteously and partly unrighteously, partly through force and partly without force, he neither makes himself happy nor nourishes himself, nor does he share with others, nor does he perform meritorious deeds.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth partly righteously and partly unrighteously, partly through force and partly without force. Having sought wealth partly righteously and partly unrighteously, partly through force and partly without force, he makes himself happy and nourishes himself, but he neither shares with others nor performs meritorious deeds.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth partly righteously and partly unrighteously, partly through force and partly without force. Having sought wealth partly righteously and partly unrighteously, partly through force and partly without force, he makes himself happy and nourishes himself, shares with others, and performs meritorious deeds.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth righteously, without force. Having sought wealth righteously, without force, he neither makes himself happy nor nourishes himself, nor does he share with others, nor does he perform meritorious deeds.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth righteously, without force. Having sought wealth righteously, without force, he makes himself happy and nourishes himself, but he neither shares with others nor performs meritorious deeds.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth righteously, without force. Having sought wealth righteously, without force, he makes himself happy and nourishes himself, shares with others, and performs meritorious deeds. He consumes these possessions, bound to them, infatuated with them, and engrossed in them, not seeing their danger, and without the wisdom for liberation.\n\nBut here, householder, a certain individual who indulges in sense pleasures seeks wealth righteously, without force. Having sought wealth righteously, without force, he makes himself happy and nourishes himself, shares with others, and performs meritorious deeds. He consumes these possessions, not bound to them, not infatuated with them, and not engrossed in them, seeing their danger, and with the wisdom for liberation.\n\nAmong these, householder, the individual who indulges in sense pleasures who seeks wealth unrighteously, through force, and having sought wealth unrighteously, through force, neither makes himself happy nor nourishes himself, nor shares with others, nor performs meritorious deeds – this individual, householder, is censurable in three respects. ‘He seeks wealth unrighteously, through force’ – by this first respect he is censurable. ‘He neither makes himself happy nor nourishes himself’ – by this second respect he is censurable. ‘He neither shares with others nor performs meritorious deeds’ – by this third respect he is censurable. This individual who indulges in sense pleasures, householder, is censurable in these three respects.\n\nAmong these, householder, the individual who indulges in sense pleasures who seeks wealth unrighteously, through force, and having sought wealth unrighteously, through force, makes himself happy and nourishes himself, but neither shares with others nor performs meritorious deeds – this individual, householder, is censurable in two respects and praiseworthy in one respect. ‘He seeks wealth unrighteously, through force’ – by this first respect he is censurable. ‘He makes himself happy and nourishes himself’ – by this one respect he is praiseworthy. ‘He neither shares with others nor performs meritorious deeds’ – by this second respect he is censurable. This individual who indulges in sense pleasures, householder, is censurable in these two respects and praiseworthy in this one respect.\n\nAmong these, householder, the individual who indulges in sense pleasures who seeks wealth unrighteously, through force, and having sought wealth unrighteously, through force, makes himself happy and nourishes himself, shares with others, and performs meritorious deeds – this individual, householder, is censurable in one respect and praiseworthy in two respects. ‘He seeks wealth unrighteously, through force’ – by this one respect he is censurable. ‘He makes himself happy and nourishes himself’ – by this first respect he is praiseworthy. ‘He shares with others and performs meritorious deeds’ – by this second respect he is praiseworthy.\n\nHere, householder, this sensualist is blameworthy in one respect and commendable in two respects.\n\nNow, householder, as for the sensualist who acquires wealth by both righteous and unrighteous means, by force and without force—having acquired wealth by both righteous and unrighteous means, by force and without force, does not make themselves happy, does not nourish themselves, does not share it, and does not perform meritorious deeds. This sensualist, householder, is commendable in one respect and blameworthy in three respects. That they acquire wealth righteously and without force — in this one respect, they are commendable. That they acquire wealth unrighteously and by force — in this first respect, they are blameworthy. That they do not make themselves happy or nourish themselves — in this second respect, they are blameworthy. That they do not share it or perform meritorious deeds — in this third respect, they are blameworthy. This sensualist, householder, is commendable in this one respect and blameworthy in these three respects.\n\nNow, householder, as for the sensualist who acquires wealth by both righteous and unrighteous means, by force and without force—having acquired wealth by both righteous and unrighteous means, by force and without force, makes themselves happy, nourishes themselves, but does not share it or perform meritorious deeds. This sensualist, householder, is commendable in two respects and blameworthy in two respects. That they acquire wealth righteously and without force — in this first respect, they are commendable. That they acquire wealth unrighteously and by force — in this first respect, they are blameworthy. That they make themselves happy and nourish themselves — in this second respect, they are commendable. That they do not share it or perform meritorious deeds — in this second respect, they are blameworthy. This sensualist, householder, is commendable in these two respects and blameworthy in these two respects.\n\nNow, householder, as for the sensualist who acquires wealth by both righteous and unrighteous means, by force and without force—having acquired wealth by both righteous and unrighteous means, by force and without force, makes themselves happy, nourishes themselves, shares it, and performs meritorious deeds. This sensualist, householder, is commendable in three respects and blameworthy in one respect. That they acquire wealth righteously and without force — in this first respect, they are commendable. That they acquire wealth unrighteously and by force — in this one respect, they are blameworthy. That they make themselves happy and nourish themselves — in this second respect, they are commendable. That they share it and perform meritorious deeds — in this third respect, they are commendable. This sensualist, householder, is commendable in these three respects and blameworthy in this one respect.\n\nNow, householder, as for the sensualist who acquires wealth righteously and without force—having acquired wealth righteously and without force, does not make themselves happy, does not nourish themselves, does not share it, and does not perform meritorious deeds. This sensualist, householder, is commendable in one respect and blameworthy in two respects. That they acquire wealth righteously and without force — in this one respect, they are commendable. That they do not make themselves happy or nourish themselves — in this first respect, they are blameworthy. That they do not share it or perform meritorious deeds — in this second respect, they are blameworthy. This sensualist, householder, is commendable in this one respect and blameworthy in these two respects.\n\nNow, householder, as for the sensualist who acquires wealth righteously and without force—having acquired wealth righteously and without force, makes themselves happy, nourishes themselves, but does not share it or perform meritorious deeds. This sensualist, householder, is commendable in two respects and blameworthy in one respect. That they acquire wealth righteously and without force — in this first respect, they are commendable. That they make themselves happy and nourish themselves — in this second respect, they are commendable. That they do not share it or perform meritorious deeds — in this one respect, they are blameworthy. This sensualist, householder, is commendable in these two respects and blameworthy in this one respect.\n\nNow, householder, as for the sensualist who acquires wealth righteously and without force—having acquired wealth righteously and without force, makes themselves happy, nourishes themselves, shares it, and performs meritorious deeds, but consumes those enjoyments fettered, infatuated, absorbed, without seeing their danger, and without wisdom for escape. This sensualist, householder, is commendable in three respects and blameworthy in one respect. That they acquire wealth righteously and without force — in this first respect, they are commendable. That they make themselves happy and nourish themselves — in this second respect, they are commendable. That they share it and perform meritorious deeds — in this third respect, they are commendable. That they consume those enjoyments fettered, infatuated, absorbed, without seeing their danger, and without wisdom for escape — in this one respect, they are blameworthy. This sensualist, householder, is commendable in these three respects and blameworthy in this one respect.\n\nHouseholder, among those who enjoy sensual pleasures, the one who seeks possessions righteously, without violence, and having sought possessions righteously, without violence, makes himself happy and satisfied, shares them, and performs meritorious deeds, and consumes those possessions without greed, without being infatuated, without being deeply attached, seeing the danger in them, and possessing wisdom that leads to release from them — this householder, who enjoys sensual pleasures, is praiseworthy in four respects. ‘He seeks possessions righteously, without violence’ — by this first respect, he is praiseworthy. ‘He makes himself happy and satisfied’ — by this second respect, he is praiseworthy. ‘He shares and performs meritorious deeds’ — by this third respect, he is praiseworthy. ‘He consumes those possessions without greed, without being infatuated, without being deeply attached, seeing the danger in them, and possessing wisdom that leads to release from them’ — by this fourth respect, he is praiseworthy. This householder, who enjoys sensual pleasures, is praiseworthy in these four respects.\n\nHouseholder, these ten types of individuals who enjoy sensual pleasures exist in the world. Among these ten types of individuals who enjoy sensual pleasures, Householder, the one who seeks possessions righteously, without violence, and having sought possessions righteously, without violence, makes himself happy and satisfied, shares them, and performs meritorious deeds, and consumes those possessions without greed, without being infatuated, without being deeply attached, seeing the danger in them, and possessing wisdom that leads to release from them — this one is the foremost, the excellent, the chief, the supreme, and the pre-eminent among these ten types of individuals who enjoy sensual pleasures. Just as, Householder, from a cow comes milk, from milk comes curd, from curd comes fresh butter, from fresh butter comes ghee, and from ghee comes the cream of ghee. The cream of ghee is said to be the foremost there. Even so, Householder, among these ten types of individuals who enjoy sensual pleasures, the one who seeks possessions righteously, without violence, and having sought possessions righteously, without violence, makes himself happy and satisfied, shares them, and performs meritorious deeds, and consumes those possessions without greed, without being infatuated, without being deeply attached, seeing the danger in them, and possessing wisdom that leads to release from them — this one is the foremost, the excellent, the chief, the supreme, and the pre-eminent among these ten types of individuals who enjoy sensual pleasures.",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩ වාසය කළ සේක. එකල්හි අනේපිඬු සිටුතුමා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි අනේපිඬු සිටුතුමාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ගෘහපතිය, ලෝකයෙහි කම්සැප විඳින්නෝ දස දෙනෙක් වෙති. කවරහුද ඒ දස දෙනා?\n\nගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයා තමා සතුටු නොකරයි, පෝෂණය නොකරයි, අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි. එහෙත් අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි, අනුන්ට බෙදා දෙයි, පින්කම් කරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් මෙන්ම බලහත්කාරයකින් තොරවද සම්පත් සොයයි. ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් මෙන්ම බලහත්කාරයකින් තොරවද සම්පත් සොයා තමා සතුටු නොකරයි, පෝෂණය නොකරයි, අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් මෙන්ම බලහත්කාරයකින් තොරවද සම්පත් සොයයි. ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් මෙන්ම බලහත්කාරයකින් තොරවද සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි. එහෙත් අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් මෙන්ම බලහත්කාරයකින් තොරවද සම්පත් සොයයි. ධර්මයෙන් සහ අධර්මයෙන්, බලහත්කාරයෙන් මෙන්ම බලහත්කාරයකින් තොරවද සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි, අනුන්ට බෙදා දෙයි, පින්කම් කරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් ධර්මයෙන්, බලහත්කාරයකින් තොරව සම්පත් සොයයි. ධර්මයෙන්, බලහත්කාරයකින් තොරව සම්පත් සොයා තමා සතුටු නොකරයි, පෝෂණය නොකරයි, අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් ධර්මයෙන්, බලහත්කාරයකින් තොරව සම්පත් සොයයි. ධර්මයෙන්, බලහත්කාරයකින් තොරව සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි. එහෙත් අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් ධර්මයෙන්, බලහත්කාරයකින් තොරව සම්පත් සොයයි. ධර්මයෙන්, බලහත්කාරයකින් තොරව සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි, අනුන්ට බෙදා දෙයි, පින්කම් කරයි. ඔහු ඒ සම්පත්හි ඇලී ගැලී, මුසපත් වී, තදින් බැඳී, එහි ආදීනව නොදක්නාසුලූ, මිදීමේ ප්‍රඥාව නැතිව පරිභෝග කරයි.\n\nනැවතද ගෘහපතිය, මෙහිලා යම් කිසි කම්සැප විඳින්නෙක් ධර්මයෙන්, බලහත්කාරයකින් තොරව සම්පත් සොයයි. ධර්මයෙන්, බලහත්කාරයකින් තොරව සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි, අනුන්ට බෙදා දෙයි, පින්කම් කරයි. ඔහු ඒ සම්පත්හි නොඇලී, මුසපත් නොවී, තදින් නොබැඳී, එහි ආදීනව දක්නාසුලූ, මිදීමේ ප්‍රඥාව ඇතිව පරිභෝග කරයි.\n\nගෘහපතිය, එහිලා යම් ඒ කම්සැප විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයා තමා සතුටු නොකරයි, පෝෂණය නොකරයි, අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයිද, ගෘහපතිය, මේ කම්සැප විඳින්නා කරුණු තුනකින් දොස් කටයුත්තෙකි. ‘අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි’ යන මේ පළමු කරුණෙන් දොස් කටයුත්තෙකි. ‘තමා සතුටු නොකරයි, පෝෂණය නොකරයි’ යන මේ දෙවැනි කරුණෙන් දොස් කටයුත්තෙකි. ‘අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි’ යන මේ තෙවැනි කරුණෙන් දොස් කටයුත්තෙකි. ගෘහපතිය, මේ කම්සැප විඳින්නා මේ කරුණු තුනෙන් දොස් කටයුත්තෙකි.\n\nගෘහපතිය, එහිලා යම් ඒ කම්සැප විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි. එහෙත් අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයිද, ගෘහපතිය, මේ කම්සැප විඳින්නා කරුණු දෙකකින් දොස් කටයුත්තෙකි. එක් කරුණකින් ප්‍රශංසා කටයුත්තෙකි. ‘අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි’ යන මේ පළමු කරුණෙන් දොස් කටයුත්තෙකි. ‘තමා සතුටු කරයි, පෝෂණය කරයි’ යන මේ එක් කරුණකින් ප්‍රශංසා කටයුත්තෙකි. ‘අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි’ යන මේ දෙවැනි කරුණෙන් දොස් කටයුත්තෙකි. ගෘහපතිය, මේ කම්සැප විඳින්නා මේ කරුණු දෙකෙන් දොස් කටයුත්තෙකි. මේ එක් කරුණකින් ප්‍රශංසා කටයුත්තෙකි.\n\nගෘහපතිය, එහිලා යම් ඒ කම්සැප විඳින්නෙක් අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි. අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයා තමා සතුටු කරයි, පෝෂණය කරයි, අනුන්ට බෙදා දෙයි, පින්කම් කරයිද, ගෘහපතිය, මේ කම්සැප විඳින්නා එක් කරුණකින් දොස් කටයුත්තෙකි. කරුණු දෙකකින් ප්‍රශංසා කටයුත්තෙකි. ‘අධර්මයෙන්, බලහත්කාරයෙන් සම්පත් සොයයි’ යන මේ එක් කරුණකින් දොස් කටයුත්තෙකි. ‘තමා සතුටු කරයි, පෝෂණය කරයි’ යන මේ පළමු කරුණෙන් ප්‍රශංසා කටයුත්තෙකි. ‘අනුන්ට බෙදා දෙයි, පින්කම් කරයි’ යන මේ දෙවැනි කරුණෙන් ප්‍රශංසා කටයුත්තෙකි.\n\nගෘහපතිය, මේ කාමභෝගී පුද්ගලයා එක් කරුණකින් ගර්භාය, කරුණු දෙකකින් ප්‍රශංසනීයයි. ගෘහපතිය, යම් කාමභෝගී පුද්ගලයෙක් ධර්මයෙන් සහ අධර්මයෙන්, සැහැසිකම් සහිතව ද සැහැසිකම් රහිතව ද භෝගයන් උපයයි ද, ධර්මයෙන් සහ අධර්මයෙන්, සැහැසිකම් සහිතව ද සැහැසිකම් රහිතව ද භෝගයන් උපයාගෙන තමා සුවපත් නොකරයි ද, තෘප්තිමත් නොකරයි ද, අනුන්ට බෙදා නොදෙයි ද, පින්කම් නොකරයි ද, ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා එක් කරුණකින් ප්‍රශංසනීයයි, කරුණු තුනකින් ගර්භාය. ‘ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි’ යන මේ එක් කරුණකින් ප්‍රශංසනීයයි. ‘අධර්මයෙන් සහ සැහැසිකම් සහිතව භෝගයන් උපයයි’ යන මේ පළමු කරුණෙන් ගර්භාය. ‘තමා සුවපත් නොකරයි, තෘප්තිමත් නොකරයි’ යන මේ දෙවන කරුණෙන් ගර්භාය. ‘අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි’ යන මේ තුන්වන කරුණෙන් ගර්භාය. ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා මේ එක් කරුණකින් ප්‍රශංසනීයයි, මේ කරුණු තුනෙන් ගර්භාය.\n\nගෘහපතිය, යම් කාමභෝගී පුද්ගලයෙක් ධර්මයෙන් සහ අධර්මයෙන්, සැහැසිකම් සහිතව ද සැහැසිකම් රහිතව ද භෝගයන් උපයයි ද, ධර්මයෙන් සහ අධර්මයෙන්, සැහැසිකම් සහිතව ද සැහැසිකම් රහිතව ද භෝගයන් උපයාගෙන තමා සුවපත් කරයි ද, තෘප්තිමත් කරයි ද, එහෙත් අනුන්ට බෙදා නොදෙයි ද, පින්කම් නොකරයි ද, ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා කරුණු දෙකකින් ප්‍රශංසනීයයි, කරුණු දෙකකින් ගර්භාය. ‘ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි’ යන මේ පළමු කරුණෙන් ප්‍රශංසනීයයි. ‘අධර්මයෙන් සහ සැහැසිකම් සහිතව භෝගයන් උපයයි’ යන මේ පළමු කරුණෙන් ගර්භාය. ‘තමා සුවපත් කරයි, තෘප්තිමත් කරයි’ යන මේ දෙවන කරුණෙන් ප්‍රශංසනීයයි. ‘අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි’ යන මේ දෙවන කරුණෙන් ගර්භාය. ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා මේ කරුණු දෙකෙන් ප්‍රශංසනීයයි, මේ කරුණු දෙකෙන් ගර්භාය.\n\nගෘහපතිය, යම් කාමභෝගී පුද්ගලයෙක් ධර්මයෙන් සහ අධර්මයෙන්, සැහැසිකම් සහිතව ද සැහැසිකම් රහිතව ද භෝගයන් උපයයි ද, ධර්මයෙන් සහ අධර්මයෙන්, සැහැසිකම් සහිතව ද සැහැසිකම් රහිතව ද භෝගයන් උපයාගෙන තමා සුවපත් කරයි ද, තෘප්තිමත් කරයි ද, අනුන්ට බෙදා දෙයි ද, පින්කම් කරයි ද, ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා කරුණු තුනකින් ප්‍රශංසනීයයි, එක් කරුණකින් ගර්භාය. ‘ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි’ යන මේ පළමු කරුණෙන් ප්‍රශංසනීයයි. ‘අධර්මයෙන් සහ සැහැසිකම් සහිතව භෝගයන් උපයයි’ යන මේ එක් කරුණෙන් ගර්භාය. ‘තමා සුවපත් කරයි, තෘප්තිමත් කරයි’ යන මේ දෙවන කරුණෙන් ප්‍රශංසනීයයි. ‘අනුන්ට බෙදා දෙයි, පින්කම් කරයි’ යන මේ තුන්වන කරුණෙන් ප්‍රශංසනීයයි. ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා මේ කරුණු තුනෙන් ප්‍රශංසනීයයි, මේ එක් කරුණෙන් ගර්භාය.\n\nගෘහපතිය, යම් කාමභෝගී පුද්ගලයෙක් ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි ද, ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයාගෙන තමා සුවපත් නොකරයි ද, තෘප්තිමත් නොකරයි ද, අනුන්ට බෙදා නොදෙයි ද, පින්කම් නොකරයි ද, ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා එක් කරුණකින් ප්‍රශංසනීයයි, කරුණු දෙකකින් ගර්භාය. ‘ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි’ යන මේ එක් කරුණකින් ප්‍රශංසනීයයි. ‘තමා සුවපත් නොකරයි, තෘප්තිමත් නොකරයි’ යන මේ පළමු කරුණෙන් ගර්භාය. ‘අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි’ යන මේ දෙවන කරුණෙන් ගර්භාය. ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා මේ එක් කරුණකින් ප්‍රශංසනීයයි, මේ කරුණු දෙකෙන් ගර්භාය.\n\nගෘහපතිය, යම් කාමභෝගී පුද්ගලයෙක් ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි ද, ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයාගෙන තමා සුවපත් කරයි ද, තෘප්තිමත් කරයි ද, එහෙත් අනුන්ට බෙදා නොදෙයි ද, පින්කම් නොකරයි ද, ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා කරුණු දෙකකින් ප්‍රශංසනීයයි, එක් කරුණකින් ගර්භාය. ‘ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි’ යන මේ පළමු කරුණෙන් ප්‍රශංසනීයයි. ‘තමා සුවපත් කරයි, තෘප්තිමත් කරයි’ යන මේ දෙවන කරුණෙන් ප්‍රශංසනීයයි. ‘අනුන්ට බෙදා නොදෙයි, පින්කම් නොකරයි’ යන මේ එක් කරුණෙන් ගර්භාය. ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා මේ කරුණු දෙකෙන් ප්‍රශංසනීයයි, මේ එක් කරුණෙන් ගර්භාය.\n\nගෘහපතිය, යම් කාමභෝගී පුද්ගලයෙක් ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි ද, ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයාගෙන තමා සුවපත් කරයි ද, තෘප්තිමත් කරයි ද, අනුන්ට බෙදා දෙයි ද, පින්කම් කරයි ද, එහෙත් ඔහු ඒ භෝගයන් කෙරෙහි බැඳී, මුසපත් වී, ඇලී, ආදීනව නොදක්නා සුළු ව, නිසරණ ප්‍රඥාව නැති ව පරිභෝග කරයි ද, ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා කරුණු තුනකින් ප්‍රශංසනීයයි, එක් කරුණකින් ගර්භාය. ‘ධර්මයෙන් සහ සැහැසිකම් රහිතව භෝගයන් උපයයි’ යන මේ පළමු කරුණෙන් ප්‍රශංසනීයයි. ‘තමා සුවපත් කරයි, තෘප්තිමත් කරයි’ යන මේ දෙවන කරුණෙන් ප්‍රශංසනීයයි. ‘අනුන්ට බෙදා දෙයි, පින්කම් කරයි’ යන මේ තුන්වන කරුණෙන් ප්‍රශංසනීයයි. ‘ඔහු ඒ භෝගයන් කෙරෙහි බැඳී, මුසපත් වී, ඇලී, ආදීනව නොදක්නා සුළු ව, නිසරණ ප්‍රඥාව නැති ව පරිභෝග කරයි’ යන මේ එක් කරුණෙන් ගර්භාය. ගෘහපතිය, මේ කාමභෝගී පුද්ගලයා මේ කරුණු තුනෙන් ප්‍රශංසනීයයි, මේ එක් කරුණෙන් ගර්භාය.\n\nගෘහපති, එහිදී යම් කාමභෝගියෙක් ධර්මානුකූලව, අයුක්ති සහගත නොවී භෝග සම්පත් සොයන්නේද, ධර්මානුකූලව, අයුක්ති සහගත නොවී භෝග සම්පත් සොයාගෙන තමා සුවපත් කර ගන්නේද, පෝෂණය කරන්නේද, (ඒවා අන් අය සමඟ) බෙදා දෙන්නේද, පින්කම් කරන්නේද, එම භෝග සම්බන්ධයෙන් දැඩි ලෙස නොඇලී, මුළා නොවී, ගිජු නොවී, එහි ආදීනව දකින, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරන්නේද, ගෘහපති, මේ කාමභෝගියා කරුණු සතරකින් ප්‍රශංසාවට ලක්වේ. ‘ධර්මානුකූලව අයුක්ති සහගත නොවී භෝග සම්පත් සොයයි’ යන මේ පළමු කරුණ නිසා ප්‍රශංසාවට ලක්වේ. ‘තමා සුවපත් කරයි, පෝෂණය කරයි’ යන මේ දෙවන කරුණ නිසා ප්‍රශංසාවට ලක්වේ. ‘(භෝග) බෙදා දෙයි, පින්කම් කරයි’ යන මේ තුන්වන කරුණ නිසා ප්‍රශංසාවට ලක්වේ. ‘එම භෝග දැඩි ලෙස නොඇලී, මුළා නොවී, ගිජු නොවී, ආදීනව දකින, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරයි’ යන මේ සිව්වන කරුණ නිසා ප්‍රශංසාවට ලක්වේ. ගෘහපති, මේ කාමභෝගියා මේ කරුණු සතරින් ප්‍රශංසාවට ලක්වේ.\n\nගෘහපති, මෙබඳු කාමභෝගී පුද්ගලයන් දස දෙනෙක් ලෝකයේ සිටිති, ජීවත්ව සිටිති. ගෘහපති, මේ දස දෙනා වූ කාමභෝගීන් අතුරින් යම් කාමභෝගියෙක් ධර්මානුකූලව, අයුක්ති සහගත නොවී භෝග සම්පත් සොයන්නේද, ධර්මානුකූලව, අයුක්ති සහගත නොවී භෝග සම්පත් සොයාගෙන තමා සුවපත් කර ගන්නේද, පෝෂණය කරන්නේද, (ඒ භෝග) බෙදා දෙන්නේද, පින්කම් කරන්නේද, එම භෝග සම්බන්ධයෙන් දැඩි ලෙස නොඇලී, මුළා නොවී, ගිජු නොවී, එහි ආදීනව දකින, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරන්නේද, මේ පුද්ගලයා ඒ දස දෙනා වූ කාමභෝගීන් අතුරින් අග්‍ර වන්නේය, ශ්‍රේෂ්ඨ වන්නේය, ප්‍රමුඛ වන්නේය, උතුම් වන්නේය, ප්‍රවර වන්නේය. ගෘහපති, යම්සේ ගවයාගෙන් කිරිද, කිරෙන් දදියද, දදියෙන් බටර්ද, බටර්වලින් ගිතෙල්ද, ගිතෙලෙන් ගිතෙල් මඬද ඇතිවේද, එහි ගිතෙල් මඬ අග්‍ර යැයි කියනු ලැබේ. එලෙසම, ගෘහපති, මේ දස දෙනා වූ කාමභෝගීන් අතුරින් යම් කාමභෝගියෙක් ධර්මානුකූලව, අයුක්ති සහගත නොවී භෝග සම්පත් සොයන්නේද, ධර්මානුකූලව, අයුක්ති සහගත නොවී භෝග සම්පත් සොයාගෙන තමා සුවපත් කර ගන්නේද, පෝෂණය කරන්නේද, (ඒ භෝග) බෙදා දෙන්නේද, පින්කම් කරන්නේද, එම භෝග සම්බන්ධයෙන් දැඩි ලෙස නොඇලී, මුළා නොවී, ගිජු නොවී, එහි ආදීනව දකින, නිස්සරණ ප්‍රඥාව ඇතිව පරිභෝග කරන්නේද, මේ පුද්ගලයා ඒ දස දෙනා වූ කාමභෝගීන් අතුරින් අග්‍ර වන්නේය, ශ්‍රේෂ්ඨ වන්නේය, ප්‍රමුඛ වන්නේය, උතුම් වන්නේය, ප්‍රවර වන්නේය.",
      "paliTitle": "Kāmabhogīsuttaṃ"
    },
    {
      "number": 92,
      "pali": "[a. ni. 9.27; saṃ. ni. 5.1024] Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ bhagavā etadavoca – ‘‘Yato, kho, gahapati, ariyasāvakassa pañca bhayāni verāni vūpasantāni honti, catūhi ca sotāpattiyaṅgehi samannāgato hoti, ariyo cassa ñāyo paññāya sudiṭṭho hoti suppaṭividdho, so ākaṅkhamāno attanāva attānaṃ byākareyya – ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto. Sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’ti. ‘‘Katamāni pañca bhayāni verāni vūpasantāni honti? Yaṃ, gahapati, pāṇātipātī pāṇātipātapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati samparāyikampi bhayaṃ veraṃ pasavati cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti, pāṇātipātā paṭivirato neva diṭṭhadhammikampi [neva diṭṭhadhammikaṃ] bhayaṃ veraṃ pasavati na samparāyikampi [na samparāyikaṃ] bhayaṃ veraṃ pasavati na cetasikampi [na cetasikaṃ (sī. syā. pī.)] dukkhaṃ domanassaṃ paṭisaṃvedeti. Pāṇātipātā paṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hoti. ‘‘Yaṃ, gahapati, adinnādāyī…pe… kāmesumicchācārī… musāvādī… surāmerayamajjapamādaṭṭhāyī surāmerayamajjapamādaṭṭhānapaccayā diṭṭhadhammikampi bhayaṃ veraṃ pasavati samparāyikampi bhayaṃ veraṃ pasavati cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti, surāmerayamajjapamādaṭṭhānā paṭivirato neva diṭṭhadhammikampi bhayaṃ veraṃ pasavati na samparāyikampi bhayaṃ veraṃ pasavati na cetasikampi dukkhaṃ domanassaṃ paṭisaṃvedeti. Surāmerayamajjapamādaṭṭhānā paṭiviratassa evaṃ taṃ bhayaṃ veraṃ vūpasantaṃ hoti. Imāni pañca bhayāni verāni vūpasantāni honti. ‘‘Katamehi catūhi sotāpattiyaṅgehi samannāgato hoti? Idha, gahapati, ariyasāvako buddhe aveccappasādena samannāgato hoti – ‘itipi so bhagavā…pe… buddho bhagavā’ti; dhamme aveccappasādena samannāgato hoti – ‘svākkhāto bhagavatā dhammo sandiṭṭhiko akāliko ehipassiko opaneyyiko paccattaṃ veditabbo viññūhī’ti; saṅghe aveccappasādena samannāgato hoti – ‘suppaṭipanno bhagavato sāvakasaṅgho, ujuppaṭipanno bhagavato sāvakasaṅgho, ñāyappaṭipanno bhagavato sāvakasaṅgho, sāmīcippaṭipanno bhagavato sāvakasaṅgho, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā, esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’ti; ariyakantehi sīlehi samannāgato hoti ‘akhaṇḍehi acchiddehi asabalehi akammāsehi bhujissehi viññuppasatthehi aparāmaṭṭhehi samādhisaṃvattanikehi’. Imehi catūhi sotāpattiyaṅgehi samannāgato hoti. ‘‘Katamo cassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho? Idha, gahapati, ariyasāvako iti paṭisañcikkhati – ‘iti imasmiṃ sati idaṃ hoti; imassuppādā idaṃ uppajjati; imasmiṃ asati idaṃ na hoti; imassa nirodhā idaṃ nirujjhati, yadidaṃ – avijjāpaccayā saṅkhārā, saṅkhārapaccayā viññāṇaṃ, viññāṇapaccayā nāmarūpaṃ, nāmarūpapaccayā saḷāyatanaṃ, saḷāyatanapaccayā phasso, phassapaccayā vedanā, vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṃ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā sambhavanti, evametassa kevalassa dukkhakkhandhassa samudayo hoti; avijjāya tveva asesavirāganirodhā saṅkhāranirodho…pe… evametassa kevalassa dukkhakkhandhassa nirodho hotī’ti. Ayañcassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho. ‘‘Yato kho, gahapati, ariyasāvakassa imāni pañca bhayāni verāni vūpasantāni honti, imehi ca catūhi sotāpattiyaṅgehi samannāgato hoti, ayañcassa ariyo ñāyo paññāya sudiṭṭho hoti suppaṭividdho, so ākaṅkhamāno attanāva attānaṃ byākareyya – ‘khīṇanirayomhi khīṇatiracchānayoni khīṇapettivisayo khīṇāpāyaduggativinipāto; sotāpannohamasmi avinipātadhammo niyato sambodhiparāyaṇo’’ti. Dutiyaṃ.",
      "english": "Then, the householder Anāthapiṇḍika approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As the householder Anāthapiṇḍika sat to one side, the Blessed One said this to him: “Householder, when for a noble disciple five fears and enmities have subsided, and he is endowed with the four factors of Stream-Entry, and the noble method is well seen and well penetrated by wisdom, then if he wishes, he may declare about himself: ‘I am one whose hellish realms are destroyed, whose animal wombs are destroyed, whose ghost realms are destroyed, whose states of woe, bad destinations, and lower realms are destroyed. I am a Stream-Enterer, no longer subject to falling into states of woe, certain of enlightenment as my destination.’”\n\n“Which are these five fears and enmities that have subsided? Householder, in the case of one who takes life, by reason of taking life, he generates fear and enmity in this present life, he generates fear and enmity in future lives, and he experiences mental suffering and dejection. But one who abstains from taking life generates neither fear and enmity in this present life, nor fear and enmity in future lives, nor does he experience mental suffering and dejection. For one who abstains from taking life, this fear and enmity has thus subsided.”\n\n“Householder, in the case of one who takes what is not given, who engages in sexual misconduct, who speaks falsely, who indulges in intoxicants that lead to heedlessness, by reason of taking what is not given, by reason of engaging in sexual misconduct, by reason of speaking falsely, by reason of indulging in intoxicants that lead to heedlessness, he generates fear and enmity in this present life, he generates fear and enmity in future lives, and he experiences mental suffering and dejection. But one who abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from intoxicants that lead to heedlessness, generates neither fear and enmity in this present life, nor fear and enmity in future lives, nor does he experience mental suffering and dejection. For one who abstains from intoxicants that lead to heedlessness, this fear and enmity has thus subsided. These are the five fears and enmities that have subsided.”\n\n“With which four factors of Stream-Entry is he endowed? Here, householder, a noble disciple is endowed with unwavering confidence in the Buddha, thinking: ‘Indeed, the Blessed One is Arahant, Perfectly Awakened, accomplished in true knowledge and conduct, sublime, knower of worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.’ He is endowed with unwavering confidence in the Dhamma, thinking: ‘The Dhamma is well-expounded by the Blessed One, directly visible, immediate, inviting one to come and see, relevant, to be personally experienced by the wise.’ He is endowed with unwavering confidence in the Saṅgha, thinking: ‘The Saṅgha of the Blessed One’s disciples is practicing well, practicing straightforwardly, practicing insightfully, practicing respectfully; that is, the four pairs of persons, the eight types of individuals – this Saṅgha of the Blessed One’s disciples is worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverential salutation, an unsurpassed field of merit for the world.’ He is endowed with noble virtues, virtues that are unbroken, untorn, unblemished, unblotched, freeing, praised by the wise, ungrasped, conducive to concentration. With these four factors of Stream-Entry is he endowed.”\n\n“And what is the noble method that is well seen and well penetrated by his wisdom? Here, householder, a noble disciple reflects thus: ‘When this exists, that comes to be; with the arising of this, that arises. When this does not exist, that does not come to be; with the cessation of this, that ceases.’ That is: ‘With ignorance as condition, volitional formations come to be; with volitional formations as condition, consciousness; with consciousness as condition, name-and-form; with name-and-form as condition, the six sense bases; with the six sense bases as condition, contact; with contact as condition, feeling; with feeling as condition, craving; with craving as condition, clinging; with clinging as condition, existence; with existence as condition, birth; with birth as condition, aging and death, sorrow, lamentation, pain, dejection, and despair come to be. Thus, arises this entire mass of suffering.’ And with the utter dispassion and cessation of ignorance, volitional formations cease; with the cessation of volitional formations, consciousness ceases; with the cessation of consciousness, name-and-form ceases; with the cessation of name-and-form, the six sense bases cease; with the cessation of the six sense bases, contact ceases; with the cessation of contact, feeling ceases; with the cessation of feeling, craving ceases; with the cessation of craving, clinging ceases; with the cessation of clinging, existence ceases; with the cessation of existence, birth ceases; with the cessation of birth, aging and death, sorrow, lamentation, pain, dejection, and despair cease. Thus, ceases this entire mass of suffering. This is the noble method that is well seen and well penetrated by his wisdom.”\n\n“Householder, when for a noble disciple these five fears and enmities have subsided, and he is endowed with these four factors of Stream-Entry, and this noble method is well seen and well penetrated by wisdom, then if he wishes, he may declare about himself: ‘I am one whose hellish realms are destroyed, whose animal wombs are destroyed, whose ghost realms are destroyed, whose states of woe, bad destinations, and lower realms are destroyed. I am a Stream-Enterer, no longer subject to falling into states of woe, certain of enlightenment as my destination.’”",
      "sinhala": "එවිට අනේපිඬු සිටුතුමා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි අනේපිඬු සිටුතුමාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ගෘහපතිය, යම් හෙයකින් ආර්ය ශ්‍රාවකයාගේ පස් වැදෑරුම් භය සහ වෛරයන් සන්සිඳී ඇද්ද, සිව් වැදෑරුම් සෝවාන් අංගයන්ගෙන් සමන්වාගත වී ඇද්ද, ශ්‍රේෂ්ඨ ඤාය ධර්මය ප්‍රඥාවෙන් මනාව දැක, මනාව අවබෝධ කොට ඇද්ද, හෙතෙම කැමති නම් තමා විසින්ම තමාව මෙසේ ප්‍රකාශ කරන්නේය: ‘මම නිරය විනාශ කළේ වෙමි, තිරිසන් යෝනිය විනාශ කළේ වෙමි, ප්‍රේත විෂය විනාශ කළේ වෙමි, අපාය දුර්ගති විනිපාතය විනාශ කළේ වෙමි. මම සෝවාන් වූවෙක්මි, විනාශයට නොපත්වන ස්වභාව ඇත්තෙක්මි, නියත වශයෙන්ම සම්බෝධිය පරමායනය කොට ඇත්තෙක්මි’ යනුවෙනි.\n\n“ඒ පස් වැදෑරුම් භය සහ වෛරයන් කවරේද, යමකින් සන්සිඳී ඇද්ද? ගෘහපතිය, යම් පුද්ගලයෙක් ප්‍රාණඝාතය කරන්නේ නම්, ප්‍රාණඝාතය හේතුකොටගෙන මේ ආත්මභාවයේදීද භය සහ වෛරය උපදවයි, පරලොවදීද භය සහ වෛරය උපදවයි, මානසික දුක් දොම්නස් විඳියි. ප්‍රාණඝාතයෙන් වැළකුණු පුද්ගලයා නම් මේ ආත්මභාවයේදීද භය හෝ වෛරය උපදවන්නේ නැත, පරලොවදීද භය හෝ වෛරය උපදවන්නේ නැත, මානසික දුක් දොම්නස් විඳින්නේද නැත. ප්‍රාණඝාතයෙන් වැළකුණු පුද්ගලයාට එසේ ඒ භය සහ වෛරය සන්සිඳී යන්නේය.\n\nගෘහපතිය, යම් පුද්ගලයෙක් අදත්තාදානය කරන්නේ නම්, අදත්තාදානය හේතුකොටගෙන මේ ආත්මභාවයේදීද භය සහ වෛරය උපදවයි, පරලොවදීද භය සහ වෛරය උපදවයි, මානසික දුක් දොම්නස් විඳියි. අදත්තාදානයෙන් වැළකුණු පුද්ගලයා නම් මේ ආත්මභාවයේදීද භය හෝ වෛරය උපදවන්නේ නැත, පරලොවදීද භය හෝ වෛරය උපදවන්නේ නැත, මානසික දුක් දොම්නස් විඳින්නේද නැත. අදත්තාදානයෙන් වැළකුණු පුද්ගලයාට එසේ ඒ භය සහ වෛරය සන්සිඳී යන්නේය.\n\nගෘහපතිය, යම් පුද්ගලයෙක් කාමයන්හි වරදවා හැසිරෙන්නේ නම්, කාමයන්හි වරදවා හැසිරීම හේතුකොටගෙන මේ ආත්මභාවයේදීද භය සහ වෛරය උපදවයි, පරලොවදීද භය සහ වෛරය උපදවයි, මානසික දුක් දොම්නස් විඳියි. කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණු පුද්ගලයා නම් මේ ආත්මභාවයේදීද භය හෝ වෛරය උපදවන්නේ නැත, පරලොවදීද භය හෝ වෛරය උපදවන්නේ නැත, මානසික දුක් දොම්නස් විඳින්නේද නැත. කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණු පුද්ගලයාට එසේ ඒ භය සහ වෛරය සන්සිඳී යන්නේය.\n\nගෘහපතිය, යම් පුද්ගලයෙක් මුසාවාදය කරන්නේ නම්, මුසාවාදය හේතුකොටගෙන මේ ආත්මභාවයේදීද භය සහ වෛරය උපදවයි, පරලොවදීද භය සහ වෛරය උපදවයි, මානසික දුක් දොම්නස් විඳියි. මුසාවාදයෙන් වැළකුණු පුද්ගලයා නම් මේ ආත්මභාවයේදීද භය හෝ වෛරය උපදවන්නේ නැත, පරලොවදීද භය හෝ වෛරය උපදවන්නේ නැත, මානසික දුක් දොම්නස් විඳින්නේද නැත. මුසාවාදයෙන් වැළකුණු පුද්ගලයාට එසේ ඒ භය සහ වෛරය සන්සිඳී යන්නේය.\n\nගෘහපතිය, යම් පුද්ගලයෙක් සුරාමේරය මත්පැන් පානය කරන්නේ නම්, සුරාමේරය මත්පැන් පානය හේතුකොටගෙන මේ ආත්මභාවයේදීද භය සහ වෛරය උපදවයි, පරලොවදීද භය සහ වෛරය උපදවයි, මානසික දුක් දොම්නස් විඳියි. සුරාමේරය මත්පැන් පානයෙන් වැළකුණු පුද්ගලයා නම් මේ ආත්මභාවයේදීද භය හෝ වෛරය උපදවන්නේ නැත, පරලොවදීද භය හෝ වෛරය උපදවන්නේ නැත, මානසික දුක් දොම්නස් විඳින්නේද නැත. සුරාමේරය මත්පැන් පානයෙන් වැළකුණු පුද්ගලයාට එසේ ඒ භය සහ වෛරය සන්සිඳී යන්නේය. මේවා එම පස් වැදෑරුම් භය සහ වෛරයන්ය, යමකින් සන්සිඳී ඇද්ද.\n\n“කුමන සිව් වැදෑරුම් සෝවාන් අංගයන්ගෙන් හෙතෙම සමන්වාගත වේද? ගෘහපතිය, මෙහිලා ආර්ය ශ්‍රාවකයා බුදුරජාණන් වහන්සේ කෙරෙහි නොසෙල්වෙන පැහැදීමෙන් යුක්ත වේ. එනම්: ‘ඒ භාග්‍යවත් අරහත් සම්මා සම්බුදුරජාණන් වහන්සේ... බුද්ධ නම් වන සේක, භාග්‍යවත් නම් වන සේක’ යනුවෙනි. ධර්මය කෙරෙහි නොසෙල්වෙන පැහැදීමෙන් යුක්ත වේ. එනම්: ‘භාග්‍යවතුන් වහන්සේ විසින් ස්වාක්ඛ්‍යාත වූ ධර්මය, ස්වයංව දැක්ක යුතු, කල් නොයවා විපාක දෙන, ‘ඇවිත් බලන්නැයි’ ආරාධනා කළ හැකි, නිවනට පමුණුවන, ප්‍රඥාවන්තයින් විසින් තම තමා තුළින්ම අවබෝධ කළ යුතු ධර්මයකි’ යනුවෙනි. සංඝයා කෙරෙහි නොසෙල්වෙන පැහැදීමෙන් යුක්ත වේ. එනම්: ‘භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා යහපත් ප්‍රතිපදාවෙන් යුක්තය, සෘජු ප්‍රතිපදාවෙන් යුක්තය, ඤාය ධර්මයට අනුව ප්‍රතිපදාවෙන් යුක්තය, සුදුසු ප්‍රතිපදාවෙන් යුක්තය. ඒ කියනුයේ සිව් යුගල අට මහ පුරුෂ පුද්ගලයාය. ඒ භාග්‍යවතුන් වහන්සේගේ ශ්‍රාවක සංඝයා ආහුණෙය්‍ය (දුර සිට ගෙනා දන් දීමට සුදුසු), පාහුණෙය්‍ය (ළඟ පැමිණි අමුත්තන්ට දන් දීමට සුදුසු), දක්ඛිණෙය්‍ය (දක්ෂිණාවට සුදුසු), අඤ්ජලිකරණීය (ඇඳිලි බැඳ වන්දනා කිරීමට සුදුසු) ලෝකයාට අනුත්තර වූ පුණ්‍යක්ෂේත්‍රයක් වන්නේය’ යනුවෙනි. ආර්යයන්ට ප්‍රිය වූ ශීලයකින් යුක්ත වේ. එනම්: ‘කැඩීම් බිඳීම් නැති, හිල් නැති, කැලැල් නැති, කිළිටි නැති, නිදහස් වූ, ප්‍රඥාවන්තයින් විසින් ප්‍රශංසා කරන ලද, තෘෂ්ණා දෘෂ්ටි දෙකින් නොගැටුණු, සමාධියට උපකාරී වන ශීලයයි.’ මේ සිව් වැදෑරුම් සෝවාන් අංගයන්ගෙන් හෙතෙම සමන්වාගත වේ.\n\n“කුමන ශ්‍රේෂ්ඨ ඤාය ධර්මයක් ප්‍රඥාවෙන් මනාව දැක, මනාව අවබෝධ කොට ඇද්ද? ගෘහපතිය, මෙහිලා ආර්ය ශ්‍රාවකයා මෙසේ මෙනෙහි කරයි: ‘මේ දෙය ඇති කල්හි මෙය වන්නේය; මෙය ඇතිවීමෙන් මෙය හටගන්නේය; මේ දෙය නැති කල්හි මෙය නොවන්නේය; මෙය නැතිවීමෙන් මෙය නිරුද්ධ වන්නේය. එනම්: අවිද්‍යාව නිසා සංස්කාර හටගනී, සංස්කාර නිසා විඤ්ඤාණය හටගනී, විඤ්ඤාණය නිසා නාමරූපය හටගනී, නාමරූපය නිසා සළායතනය හටගනී, සළායතනය නිසා ස්පර්ශය හටගනී, ස්පර්ශය නිසා වේදනාව හටගනී, වේදනාව නිසා තණ්හාව හටගනී, තණ්හාව නිසා උපාදානය හටගනී, උපාදානය නිසා භවය හටගනී, භවය නිසා ජාතිය හටගනී, ජාතිය නිසා ජරාව, මරණය, ශෝකය, වැළපීම, දුක, දොම්නස, උපායාසයෝ හටගනිත්. මෙසේ මේ සියලු දුක්ඛස්කන්ධයේ හටගැනීම සිදු වේ; නොහොත් අවිද්‍යාව මුළුමනින්ම නොඇලී නිරුද්ධ වීමෙන් සංස්කාර නිරුද්ධ වේ... මෙසේ මේ සියලු දුක්ඛස්කන්ධයේ නිරුද්ධ වීම සිදු වේ’ යනුවෙනි. මේ ශ්‍රේෂ්ඨ ඤාය ධර්මය ප්‍රඥාවෙන් ඔහු විසින් මනාව දැක ඇත, මනාව අවබෝධ කොට ඇත.\n\n“ගෘහපතිය, යම් හෙයකින් ආර්ය ශ්‍රාවකයාගේ මේ පස් වැදෑරුම් භය සහ වෛරයන් සන්සිඳී ඇද්ද, මේ සිව් වැදෑරුම් සෝවාන් අංගයන්ගෙන් සමන්වාගත වී ඇද්ද, මේ ශ්‍රේෂ්ඨ ඤාය ධර්මය ප්‍රඥාවෙන් ඔහු විසින් මනාව දැක, මනාව අවබෝධ කොට ඇද්ද, හෙතෙම කැමති නම් තමා විසින්ම තමාව මෙසේ ප්‍රකාශ කරන්නේය: ‘මම නිරය විනාශ කළේ වෙමි, තිරිසන් යෝනිය විනාශ කළේ වෙමි, ප්‍රේත විෂය විනාශ කළේ වෙමි, අපාය දුර්ගති විනිපාතය විනාශ කළේ වෙමි. මම සෝවාන් වූවෙක්මි, විනාශයට නොපත්වන ස්වභාව ඇත්තෙක්මි, නියත වශයෙන්ම සම්බෝධිය පරමායනය කොට ඇත්තෙක්මි’ යනුවෙනි.",
      "paliTitle": "Bhayasuttaṃ"
    },
    {
      "number": 93,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho anāthapiṇḍiko gahapati divā divassa sāvatthiyā nikkhami bhagavantaṃ dassanāya. Atha kho anāthapiṇḍikassa gahapatissa etadahosi – ‘‘akālo kho tāva bhagavantaṃ dassanāya. Paṭisallīno bhagavā. Manobhāvanīyānampi bhikkhūnaṃ akālo dassanāya. Paṭisallīnā manobhāvanīyā bhikkhū. Yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’’nti. Atha kho anāthapiṇḍiko gahapati yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkami. Tena kho pana samayena aññatitthiyā paribbājakā saṅgamma samāgamma unnādino uccāsaddamahāsaddā anekavihitaṃ tiracchānakathaṃ kathentā nisinnā honti. Addasaṃsu kho te aññatitthiyā paribbājakā anāthapiṇḍikaṃ gahapatiṃ dūratova āgacchantaṃ. Disvāna aññamaññaṃ saṇṭhāpesuṃ – ‘‘appasaddā bhonto hontu, mā bhonto saddamakattha. Ayaṃ anāthapiṇḍiko gahapati ārāmaṃ āgacchati samaṇassa gotamassa sāvako. Yāvatā kho pana samaṇassa gotamassa sāvakā gihī odātavasanā sāvatthiyaṃ paṭivasanti, ayaṃ tesaṃ aññataro anāthapiṇḍiko gahapati. Appasaddakāmā kho pana te āyasmanto appasaddavinītā appasaddassa vaṇṇavādino. Appeva nāma appasaddaṃ parisaṃ viditvā upasaṅkamitabbaṃ maññeyyā’’ti. Atha kho te aññatitthiyā paribbājakā tuṇhī ahesuṃ. Atha kho anāthapiṇḍiko gahapati yena te aññatitthiyā paribbājakā tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho anāthapiṇḍikaṃ gahapatiṃ te aññatitthiyā paribbājakā etadavocuṃ – ‘‘vadehi, gahapati, kiṃdiṭṭhiko samaṇo gotamo’’ti? ‘‘Na kho ahaṃ, bhante, bhagavato sabbaṃ diṭṭhiṃ jānāmī’’ti. ‘‘Iti kira tvaṃ, gahapati, na samaṇassa gotamassa sabbaṃ diṭṭhiṃ jānāsi; vadehi, gahapati, kiṃdiṭṭhikā bhikkhū’’ti? ‘‘Bhikkhūnampi kho ahaṃ, bhante, na sabbaṃ diṭṭhiṃ jānāmī’’ti. ‘‘Iti kira tvaṃ, gahapati, na samaṇassa gotamassa sabbaṃ diṭṭhiṃ jānāsi napi bhikkhūnaṃ sabbaṃ diṭṭhiṃ jānāsi; vadehi, gahapati, kiṃdiṭṭhikosi tuva’’nti? ‘‘Etaṃ kho, bhante, amhehi na dukkaraṃ byākātuṃ yaṃdiṭṭhikā mayaṃ. Iṅgha tāva āyasmanto yathāsakāni diṭṭhigatāni byākarontu, pacchāpetaṃ amhehi na dukkaraṃ bhavissati byākātuṃ yaṃdiṭṭhikā maya’’nti. Evaṃ vutte aññataro paribbājako anāthapiṇḍikaṃ gahapatiṃ etadavoca – ‘‘sassato loko, idameva saccaṃ moghamaññanti – evaṃdiṭṭhiko ahaṃ, gahapatī’’ti. Aññataropi kho paribbājako anāthapiṇḍikaṃ gahapatiṃ etadavoca – ‘‘asassato loko, idameva saccaṃ moghamaññanti – evaṃdiṭṭhiko ahaṃ, gahapatī’’ti. Aññataropi kho paribbājako anāthapiṇḍikaṃ gahapatiṃ etadavoca – ‘‘antavā loko…pe… anantavā loko… taṃ jīvaṃ taṃ sarīraṃ… aññaṃ jīvaṃ aññaṃ sarīraṃ… hoti tathāgato paraṃ maraṇā… na hoti tathāgato paraṃ maraṇā… hoti ca na ca hoti tathāgato paraṃ maraṇā… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamaññanti – evaṃdiṭṭhiko ahaṃ, gahapatī’’ti. Evaṃ vutte anāthapiṇḍiko gahapati te paribbājake etadavoca – ‘‘yvāyaṃ, bhante, āyasmā evamāha – ‘sassato loko, idameva saccaṃ moghamaññanti – evaṃdiṭṭhiko ahaṃ, gahapatī’ti, imassa ayamāyasmato diṭṭhi attano vā ayonisomanasikārahetu uppannā paratoghosapaccayā vā. Sā kho panesā diṭṭhi bhūtā saṅkhatā cetayitā paṭiccasamuppannā. Yaṃ kho pana kiñci bhūtaṃ saṅkhataṃ cetayitaṃ paṭiccasamuppannaṃ tadaniccaṃ. Yadaniccaṃ taṃ dukkhaṃ. Yaṃ dukkhaṃ tadeveso āyasmā allīno, tadeveso āyasmā ajjhupagato. ‘‘Yopāyaṃ, bhante, āyasmā evamāha – ‘asassato loko, idameva saccaṃ moghamaññanti – evaṃdiṭṭhiko ahaṃ, gahapatī’ti, imassāpi ayamāyasmato diṭṭhi attano vā ayonisomanasikārahetu uppannā paratoghosapaccayā vā. Sā kho panesā diṭṭhi bhūtā saṅkhatā cetayitā paṭiccasamuppannā. Yaṃ kho pana kiñci bhūtaṃ saṅkhataṃ cetayitaṃ paṭiccasamuppannaṃ tadaniccaṃ. Yadaniccaṃ taṃ dukkhaṃ. Yaṃ dukkhaṃ tadeveso āyasmā allīno, tadeveso āyasmā ajjhupagato. ‘‘Yopāyaṃ, bhante, āyasmā evamāha – ‘antavā loko …pe… anantavā loko… taṃ jīvaṃ taṃ sarīraṃ… aññaṃ jīvaṃ aññaṃ sarīraṃ… hoti tathāgato paraṃ maraṇā… na hoti tathāgato paraṃ maraṇā… hoti ca na ca hoti tathāgato paraṃ maraṇā… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamaññanti – evaṃdiṭṭhiko ahaṃ, gahapatī’ti, imassāpi ayamāyasmato diṭṭhi attano vā ayonisomanasikārahetu uppannā paratoghosapaccayā vā. Sā kho panesā diṭṭhi bhūtā saṅkhatā cetayitā paṭiccasamuppannā. Yaṃ kho pana kiñci bhūtaṃ saṅkhataṃ cetayitaṃ paṭiccasamuppannaṃ tadaniccaṃ. Yadaniccaṃ taṃ dukkhaṃ. Yaṃ dukkhaṃ tadeveso āyasmā allīno, tadeveso āyasmā ajjhupagato’’ti. Evaṃ vutte te paribbājakā anāthapiṇḍikaṃ gahapatiṃ etadavocuṃ – ‘‘byākatāni kho, gahapati, amhehi sabbeheva yathāsakāni diṭṭhigatāni. Vadehi, gahapati, kiṃdiṭṭhikosi tuva’’nti? ‘‘Yaṃ kho, bhante, kiñci bhūtaṃ saṅkhataṃ cetayitaṃ paṭiccasamuppannaṃ tadaniccaṃ. Yadaniccaṃ taṃ dukkhaṃ. ‘Yaṃ dukkhaṃ taṃ netaṃ mama, nesohamasmi, na meso attā’ti – evaṃdiṭṭhiko ahaṃ, bhante’’ti. ‘‘Yaṃ kho, gahapati, kiñci bhūtaṃ saṅkhataṃ cetayitaṃ paṭiccasamuppannaṃ tadaniccaṃ. Yadaniccaṃ taṃ dukkhaṃ. Yaṃ dukkhaṃ tadeva tvaṃ, gahapati, allīno, tadeva tvaṃ, gahapati, ajjhupagato’’ti. ‘‘Yaṃ kho, bhante, kiñci bhūtaṃ saṅkhataṃ cetayitaṃ paṭiccasamuppannaṃ tadaniccaṃ. Yadaniccaṃ taṃ dukkhaṃ. ‘Yaṃ dukkhaṃ taṃ netaṃ mama, nesohamasmi, nameso attā’ti – evametaṃ yathābhūtaṃ sammappaññāya sudiṭṭhaṃ. Tassa ca uttari nissaraṇaṃ yathābhūtaṃ pajānāmī’’ti. Evaṃ vutte te paribbājakā tuṇhībhūtā maṅkubhūtā pattakkhandhā adhomukhā pajjhāyantā appaṭibhānā nisīdiṃsu. Atha kho anāthapiṇḍiko gahapati te paribbājake tuṇhībhūte maṅkubhūte pattakkhandhe adhomukhe pajjhāyante appaṭibhāne viditvā uṭṭhāyāsanā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho anāthapiṇḍiko gahapati yāvatako ahosi tehi aññatitthiyehi paribbājakehi saddhiṃ kathāsallāpo taṃ sabbaṃ bhagavato ārocesi. ‘‘Sādhu sādhu, gahapati! Evaṃ kho te, gahapati, moghapurisā kālena kālaṃ sahadhammena suniggahitaṃ niggahetabbā’’ti. Atha kho bhagavā anāthapiṇḍikaṃ gahapatiṃ dhammiyā kathāya sandassesi samādapesi samuttejesi sampahaṃsesi. Atha kho anāthapiṇḍiko gahapati bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā acirapakkante anāthapiṇḍike gahapatimhi bhikkhū āmantesi – ‘‘yopi so, bhikkhave, bhikkhu vassasatupasampanno [bhikkhu dīgharattaṃ avedhi dhammo (syā.)] imasmiṃ dhammavinaye, sopi evamevaṃ aññatitthiye paribbājake sahadhammena suniggahitaṃ niggaṇheyya yathā taṃ anāthapiṇḍikena gahapatinā niggahitā’’ti. Tatiyaṃ.",
      "english": "At one time the Blessed One was dwelling in Savatthi, in Jeta's Grove, Anāthapiṇḍika's monastery. Then, in the middle of the day, Householder Anāthapiṇḍika set out from Savatthi to see the Blessed One. Then it occurred to Householder Anāthapiṇḍika: \"Indeed, it is not the right time to see the Blessed One. The Blessed One is in seclusion. It is also not the right time to see the monks who are cultivated in mind. The monks who are cultivated in mind are in seclusion. What if I were to approach the park of the wandering ascetics of other sects?\"\n\nThen Householder Anāthapiṇḍika approached the park where the wandering ascetics of other sects were. At that time, the wandering ascetics of other sects were sitting there, gathered together, noisy, uttering loud, boisterous speech, engaging in various kinds of mundane talk. They saw Householder Anāthapiṇḍika coming from afar. Seeing him, they quieted each other down, saying, \"Sirs, be quiet, sirs, do not make noise. This Householder Anāthapiṇḍika is approaching the park, a disciple of the ascetic Gotama. Among all the ascetic Gotama's disciples, householders clad in white, who dwell in Savatthi, this Householder Anāthapiṇḍika is one of them. Indeed, these venerable ones are fond of quietude, trained in quietude, and speak in praise of quietude. Perhaps, knowing the assembly to be quiet, he might consider it worthwhile to approach.\" Then those wandering ascetics of other sects became silent.\n\nThen Householder Anāthapiṇḍika approached those wandering ascetics of other sects; having approached, he exchanged greetings with them. After exchanging polite and cordial greetings, he sat down to one side. As Householder Anāthapiṇḍika was sitting to one side, those wandering ascetics of other sects said to him, \"Tell us, householder, what view does the ascetic Gotama hold?\" \"Indeed, sirs, I do not know all of the Blessed One's views.\" \"So then, householder, you do not know all of the ascetic Gotama's views, nor do you know all of the monks' views; tell us, householder, what view do *you* hold?\" \"Indeed, sirs, it is not difficult for us to declare what view we hold. Please, venerable sirs, first declare your respective views. Afterwards, it will not be difficult for us to declare what view we hold.\"\n\nWhen this was said, a certain wandering ascetic said to Householder Anāthapiṇḍika, \"The world is eternal; only this is true, anything else is delusive – this is the view I hold, householder.\" Another wandering ascetic also said to Householder Anāthapiṇḍika, \"The world is not eternal; only this is true, anything else is delusive – this is the view I hold, householder.\" Another wandering ascetic also said to Householder Anāthapiṇḍika, \"The world is finite; the world is infinite; the world is both finite and infinite; the world is neither finite nor infinite. The soul is the same as the body; the soul is different from the body. A Tathagata exists after death; a Tathagata does not exist after death; a Tathagata both exists and does not exist after death; a Tathagata neither exists nor does not exist after death; only this is true, anything else is delusive – this is the view I hold, householder.\"\n\nWhen this was said, Householder Anāthapiṇḍika said to those wandering ascetics, \"Venerable sirs, this venerable one who says, 'The world is eternal; only this is true, anything else is delusive – this is the view I hold, householder,' this view of this venerable one has arisen either through his own unskillful attention or through the influence of others' voices. Indeed, this view is formed, conditioned, intentionally constructed, and dependently originated. Whatever is formed, conditioned, intentionally constructed, and dependently originated is impermanent. Whatever is impermanent is suffering. Whatever is suffering, to that this venerable one is attached; to that this venerable one has committed himself.\n\n\"And venerable sirs, this venerable one who says, 'The world is not eternal; only this is true, anything else is delusive – this is the view I hold, householder,' this view of this venerable one has also arisen either through his own unskillful attention or through the influence of others' voices. Indeed, this view is formed, conditioned, intentionally constructed, and dependently originated. Whatever is formed, conditioned, intentionally constructed, and dependently originated is impermanent. Whatever is impermanent is suffering. Whatever is suffering, to that this venerable one is attached; to that this venerable one has committed himself.\n\nThis Venerable Sir, who speaks thus – ‘The world is finite… The world is infinite… The soul and the body are the same… The soul is one thing, the body another… The Tathāgata exists after death… The Tathāgata does not exist after death… The Tathāgata both exists and does not exist after death… The Tathāgata neither exists nor does not exist after death. This alone is true, anything else is foolishness’ – ‘This is my view, householder.’ Even this Venerable One’s view has arisen either from his own unwise attention or from the influence of others’ teachings. This view, in fact, is something that has come into being, is conditioned, is volitionally produced, and is dependently originated. Whatever has come into being, is conditioned, is volitionally produced, and is dependently originated, that is impermanent. What is impermanent is suffering. To that which is suffering, this Venerable One is attached; to that very thing, this Venerable One has resorted.\n\nWhen this was said, those wanderers said to Anāthapiṇḍika the householder, “Householder, all of us have declared our respective views. Now, householder, declare what your view is.”\n\n“Indeed, Venerable Sirs, whatever has come into being, is conditioned, is volitionally produced, and is dependently originated, that is impermanent. What is impermanent is suffering. My view, Venerable Sirs, is: ‘That which is suffering is not mine, I am not that, this is not my self.’”\n\n“Indeed, householder, whatever has come into being, is conditioned, is volitionally produced, and is dependently originated, that is impermanent. What is impermanent is suffering. Householder, you are attached to that very suffering; householder, you have resorted to that very thing.”\n\n“Indeed, Venerable Sirs, whatever has come into being, is conditioned, is volitionally produced, and is dependently originated, that is impermanent. What is impermanent is suffering. And that which is suffering – ‘This is not mine, I am not this, this is not my self’ – this has been clearly seen with right wisdom as it actually is. And I understand, as it actually is, the escape beyond this.”\n\nWhen this was said, those wanderers became silent, disheartened, with slumped shoulders, downcast, pondering, and sat speechless. Then Anāthapiṇḍika the householder, knowing that those wanderers were silent, disheartened, with slumped shoulders, downcast, pondering, and speechless, rose from his seat and approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side.\n\nSeated to one side, Anāthapiṇḍika the householder reported to the Blessed One all the conversation he had had with those wanderers of other sects.\n\n“Excellent, excellent, householder! It is indeed in this way, householder, that those foolish men should be thoroughly refuted with the Dhamma from time to time.”\n\nThen the Blessed One instructed, encouraged, inspired, and gladdened Anāthapiṇḍika the householder with a talk on the Dhamma.\n\nThen Anāthapiṇḍika the householder, having been instructed, encouraged, inspired, and gladdened by the Blessed One with a talk on the Dhamma, rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed.\n\nThen, not long after Anāthapiṇḍika the householder had departed, the Blessed One addressed the monastics, saying, “Even a monastic who has been fully ordained for a hundred years in this Dhamma and Discipline, monastics, should thoroughly refute renunciants of other sects with the Dhamma in the same way as they were refuted by Anāthapiṇḍika the householder.” This is the third.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයේ වැඩසිටින සේක. එවිට අනේපිඬු ගෘහපති දහවල් කාලයේ භාග්‍යවතුන් වහන්සේ දැකීමට සැවැත් නුවරින් පිටත් විය. එවිට අනේපිඬු ගෘහපතිට මෙසේ සිතුණි – ‘‘භාග්‍යවතුන් වහන්සේ දැකීමට දැන් අකල් වේලාවකි. භාග්‍යවතුන් වහන්සේ පටිසල්ලානයෙහි යෙදී සිටින සේක. භාවනාවට සුදුසු භික්ෂූන් වහන්සේලා දැකීමටද අකල් වේලාවකි. භාවනාවට සුදුසු භික්ෂූන් වහන්සේලාද පටිසල්ලානයෙහි යෙදී සිටිති. මම අන්‍ය තීර්ථක පිරිවැජියන්ගේ ආරාමය දෙසට යන්නෙම් නම් හොඳය’’ කියා. එවිට අනේපිඬු ගෘහපති අන්‍ය තීර්ථක පිරිවැජියන්ගේ ආරාමය දෙසට ගියේය. ඒ වන විට අන්‍ය තීර්ථක පිරිවැජියෝ රැස්වී, එක්රැස්වී, මහත් ඝෝෂා කරමින්, මහත් ශබ්ද නගමින්, නොයෙක් ආකාර තිරශ්චීන කතා කියමින් සිටියහ. ඒ අන්‍ය තීර්ථක පිරිවැජියෝ අනේපිඬු ගෘහපති දුරදීම එනු දුටහ. දැක එකිනෙකාට සංඥා කළහ – ‘‘පින්වත්නි, නිශ්ශබ්දව සිටින්න, පින්වත්නි, ශබ්ද නොකරන්න. මේ අනේපිඬු ගෘහපති ආරාමයට එන්නේ ශ්‍රමණ ගෞතමයන්ගේ ශ්‍රාවකයෙකි. සැවැත් නුවර වාසය කරන ධවල වස්ත්‍රධාරී ගිහි ශ්‍රමණ ගෞතමයන්ගේ ශ්‍රාවකයන් අතරින් මේ අනේපිඬු ගෘහපති එක් අයෙකි. ඒ ආයුෂ්මතුන් නිශ්ශබ්දතාවට කැමති, නිශ්ශබ්දතාවට පුරුදු වූ, නිශ්ශබ්දතාව ප්‍රශංසා කරන අය වෙති. ඇතැම් විට නිශ්ශබ්ද පිරිසක් දැක මෙහි පැමිණිය යුතු යැයි ඔහුට සිතෙන්නට පුළුවන’’ කියා. එවිට ඒ අන්‍ය තීර්ථක පිරිවැජියෝ නිශ්ශබ්ද වූහ. එවිට අනේපිඬු ගෘහපති ඒ අන්‍ය තීර්ථක පිරිවැජියන් සිටි තැනට ගියේය; එසේ ගොස් ඒ අන්‍ය තීර්ථක පිරිවැජියන් සමඟ සතුටු විය. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා බහ නිමවා, එක් පසෙකින් වාඩි විය.\n\nඑක් පසෙකින් වාඩි වී සිටින අනේපිඬු ගෘහපතිට ඒ අන්‍ය තීර්ථක පිරිවැජියෝ මෙසේ කීහ – ‘‘ගෘහපතිය, කියන්න, ශ්‍රමණ ගෞතමයන් වහන්සේ කවර දෘෂ්ටියක් ඇත්තෙක්ද?’’ කියා. ‘‘පින්වත්නි, මම භාග්‍යවතුන් වහන්සේගේ සියලු දෘෂ්ටිය නොදනිමි’’ යි. ‘‘එසේ නම් ගෘහපතිය, ඔබ ශ්‍රමණ ගෞතමයන් වහන්සේගේ සියලු දෘෂ්ටිය නොදන්නෙහිද; ගෘහපතිය, කියන්න, භික්ෂූන් වහන්සේලා කවර දෘෂ්ටියක් ඇත්තෝද?’’ කියා. ‘‘පින්වත්නි, මම භික්ෂූන් වහන්සේලාගේද සියලු දෘෂ්ටිය නොදනිමි’’ යි. ‘‘එසේ නම් ගෘහපතිය, ඔබ ශ්‍රමණ ගෞතමයන් වහන්සේගේ සියලු දෘෂ්ටිය නොදන්නෙහිද, භික්ෂූන් වහන්සේලාගේද සියලු දෘෂ්ටිය නොදන්නෙහිද; ගෘහපතිය, කියන්න, ඔබ කවර දෘෂ්ටියක් ඇත්තෙක්ද?’’ කියා. ‘‘පින්වත්නි, අපි කවර දෘෂ්ටියක් ඇත්තෝදැයි ප්‍රකාශ කිරීම අපට අපහසු නොවේ. පින්වත්නි, පළමුව ඔබගේ දෘෂ්ටි ප්‍රකාශ කරන්න. පසුව අප කවර දෘෂ්ටියක් ඇත්තෝදැයි ප්‍රකාශ කිරීම අපට අපහසු නොවනු ඇත’’ යි.\n\nමෙසේ පැවසූ විට එක් පිරිවැජියෙක් අනේපිඬු ගෘහපතිට මෙසේ කීවේය – ‘‘ගෘහපතිය, ලෝකය ශාශ්වතය, මෙයම සත්‍යයයි, අන් සියල්ල මිත්‍යාවයි යන මේ දෘෂ්ටිය ඇත්තෙක් මම වෙමි’’ යි. තවත් පිරිවැජියෙක්ද අනේපිඬු ගෘහපතිට මෙසේ කීවේය – ‘‘ගෘහපතිය, ලෝකය අශාශ්වතය, මෙයම සත්‍යයයි, අන් සියල්ල මිත්‍යාවයි යන මේ දෘෂ්ටිය ඇත්තෙක් මම වෙමි’’ යි. තවත් පිරිවැජියෙක්ද අනේපිඬු ගෘහපතිට මෙසේ කීවේය – ‘‘ගෘහපතිය, ලෝකය අන්තයක් ඇත; ලෝකය අන්තයක් නැත; ඒ ජීවයම ඒ ශරීරයයි; ජීවය වෙනස්, ශරීරය වෙනස්; මරණින් පසු තථාගතයන් වහන්සේ සිටී; මරණින් පසු තථාගතයන් වහන්සේ නොසිටී; මරණින් පසු තථාගතයන් වහන්සේ සිටීද නැතීද; මරණින් පසු තථාගතයන් වහන්සේ සිටීද නැතීද යනුවෙන් පැවසිය නොහැක – මෙයම සත්‍යයයි, අන් සියල්ල මිත්‍යාවයි යන මේ දෘෂ්ටිය ඇත්තෙක් මම වෙමි’’ යි.\n\nමෙසේ පැවසූ විට අනේපිඬු ගෘහපති ඒ පිරිවැජියන්ට මෙසේ කීවේය – ‘‘පින්වත්නි, යම් ආයුෂ්මතෙක් ‘ගෘහපතිය, ලෝකය ශාශ්වතය, මෙයම සත්‍යයයි, අන් සියල්ල මිත්‍යාවයි යන මේ දෘෂ්ටිය ඇත්තෙක් මම වෙමි’ යි මෙසේ කියන්නේද, මේ ආයුෂ්මතාගේ මේ දෘෂ්ටිය තමාගේ අයෝනිසෝමනසිකාරය (නුසුදුසු ආකාරයට මෙනෙහි කිරීම) හේතුවෙන් හෝ අනුන්ගේ කීම (පරතෝඝෝෂය) හේතුවෙන් හෝ හටගත්තකි. ඒ දෘෂ්ටිය නම්, හටගත්, හේතු ප්‍රත්‍යයන්ගෙන් සෑදුණු (සංඛත), සිතන ලද (චේතයිත) සහ පටිච්චසමුප්පන්න (හේතු ප්‍රත්‍යයන්ට අනුව හටගත්) වූවකි. යම් යම් දෙයක් හටගත්, හේතු ප්‍රත්‍යයන්ගෙන් සෑදුණු, සිතන ලද සහ පටිච්චසමුප්පන්න නම්, ඒ සියල්ල අනිත්‍යයි. යමක් අනිත්‍යද, එය දුක්ය. යමක් දුක්ද, ඒ දුකටම මේ ආයුෂ්මත් ඇලී, ඒ දුකටම මේ ආයුෂ්මත් ගැලී සිටී.\n\n‘‘පින්වත්නි, යම් ආයුෂ්මතෙක් ‘ගෘහපතිය, ලෝකය අශාශ්වතය, මෙයම සත්‍යයයි, අන් සියල්ල මිත්‍යාවයි යන මේ දෘෂ්ටිය ඇත්තෙක් මම වෙමි’ යි මෙසේ කියන්නේද, මේ ආයුෂ්මතාගේද මේ දෘෂ්ටිය තමාගේ අයෝනිසෝමනසිකාරය හේතුවෙන් හෝ අනුන්ගේ කීම හේතුවෙන් හෝ හටගත්තකි. ඒ දෘෂ්ටිය නම්, හටගත්, හේතු ප්‍රත්‍යයන්ගෙන් සෑදුණු, සිතන ලද සහ පටිච්චසමුප්පන්න වූවකි. යම් යම් දෙයක් හටගත්, හේතු ප්‍රත්‍යයන්ගෙන් සෑදුණු, සිතන ලද සහ පටිච්චසමුප්පන්න නම්, ඒ සියල්ල අනිත්‍යයි. යමක් අනිත්‍යද, එය දුක්ය. යමක් දුක්ද, ඒ දුකටම මේ ආයුෂ්මත් ඇලී, ඒ දුකටම මේ ආයුෂ්මත් ගැලී සිටී.\n\nභාග්‍යවතුන් වහන්ස, යම් ආයුෂ්මත් කෙනෙක් මෙසේ කියන්නේ නම්: ‘ලෝකය සීමා සහිතයි… ලෝකය අසීමා සහිතයි… ජීවයත් ශරීරයත් එකයි… ජීවයත් ශරීරයත් දෙකයි… තථාගතයන් වහන්සේ මරණින් පසු සිටින සේක… තථාගතයන් වහන්සේ මරණින් පසු නොසිටින සේක… තථාගතයන් වහන්සේ මරණින් පසු සිටින සේකද, නොසිටින සේකද… තථාගතයන් වහන්සේ මරණින් පසු නොසිටින සේකද, නොනොසිටින සේකද… මේවායින් මේ පමණක් සත්‍යයි, අන්‍යය හිස් යැ’යි කියන; ‘ගෘහපති, මම මේ වැනි දෘෂ්ටියක් ඇත්තෙක්මි’ යැයි කියන මේ ආයුෂ්මතාගේ දෘෂ්ටිය තමාගේ අයෝනිසෝමනසිකාරය හේතුවෙන් හෝ අනුන්ගේ ශ්‍රවණය හේතුවෙන් හෝ ඇතිවූවකි. ඒ දෘෂ්ටිය නම් හටගත් දෙයකි, සංස්කරණය කරන ලද්දකි, සිතීමෙන් උපදවා ගන්නා ලද්දකි, ප්‍ර‍තීත්‍යසමුප්පන්නව හටගත් දෙයකි. යම්කිසි දෙයක් හටගත් දෙයක් වේද, සංස්කරණය කරන ලද්දක් වේද, සිතීමෙන් උපදවා ගන්නා ලද්දක් වේද, ප්‍ර‍තීත්‍යසමුප්පන්නව හටගත් දෙයක් වේද, ඒ සියල්ල අනිත්‍ය වේ. යම් දෙයක් අනිත්‍ය වේද, ඒ සියල්ල දුක් වේ. යම් දෙයක් දුක් වේද, ඒ දුක් ස්වභාවයෙහිම මේ ආයුෂ්මත් තැනැත්තා ඇලී සිටියි, ඒ දුක් ස්වභාවයම ඔහු දැඩි කොට අල්ලාගෙන සිටියි.\n\nමෙසේ පැවසූ විට ඒ පරිබ්‍රාජකයෝ අනාථපිණ්ඩික ගෘහපතිතුමාට මෙසේ කීහ: ‘ගෘහපති, අප සියලු දෙනා විසින්ම අපේ දෘෂ්ටිවාදයන් ප්‍රකාශ කරන ලදී. ගෘහපති, ඔබ කවර දෘෂ්ටියක් ඇත්තෙක්දැයි කියන්නැ’යි.\n\n“පින්වතුනි, යම්කිසි දෙයක් හටගත් දෙයක් වේද, සංස්කරණය කරන ලද්දක් වේද, සිතීමෙන් උපදවා ගන්නා ලද්දක් වේද, ප්‍ර‍තීත්‍යසමුප්පන්නව හටගත් දෙයක් වේද, ඒ සියල්ල අනිත්‍ය වේ. යම් දෙයක් අනිත්‍ය වේද, ඒ සියල්ල දුක් වේ. ‘යම් දෙයක් දුක් වේද, ඒ දුක් ස්වභාවය මාගේ නොවේ, මම එය නොවෙමි, එය මගේ ආත්මය නොවේ’ – පින්වතුනි, මම මේ වැනි දෘෂ්ටියක් ඇත්තෙක්මි.”\n\n“ගෘහපති, යම්කිසි දෙයක් හටගත් දෙයක් වේද, සංස්කරණය කරන ලද්දක් වේද, සිතීමෙන් උපදවා ගන්නා ලද්දක් වේද, ප්‍ර‍තීත්‍යසමුප්පන්නව හටගත් දෙයක් වේද, ඒ සියල්ල අනිත්‍ය වේ. යම් දෙයක් අනිත්‍ය වේද, ඒ සියල්ල දුක් වේ. යම් දෙයක් දුක් වේද, ගෘහපති, ඔබ ඒ දුක් ස්වභාවයෙහිම ඇලී සිටින්නෙහි, ගෘහපති, ඔබ ඒ දුක් ස්වභාවයම දැඩි කොට අල්ලාගෙන සිටින්නෙහි.”\n\n“පින්වතුනි, යම්කිසි දෙයක් හටගත් දෙයක් වේද, සංස්කරණය කරන ලද්දක් වේද, සිතීමෙන් උපදවා ගන්නා ලද්දක් වේද, ප්‍ර‍තීත්‍යසමුප්පන්නව හටගත් දෙයක් වේද, ඒ සියල්ල අනිත්‍ය වේ. යම් දෙයක් අනිත්‍ය වේද, ඒ සියල්ල දුක් වේ. ‘යම් දෙයක් දුක් වේද, ඒ දුක් ස්වභාවය මාගේ නොවේ, මම එය නොවෙමි, එය මගේ ආත්මය නොවේ’ – මේ ආකාරයෙන් එය යථාභූතව සම්‍යක් ප්‍ර‍ඥාවෙන් මනාව දැක ඇත. තවද එහි ඇති උත්තරීතර නිස්සරණයද මම යථාභූතවම ප්‍ර‍ඥාවෙන් දනිමි.”\n\nමෙසේ පැවසූ විට ඒ පරිබ්‍රාජකයෝ නිහඬ වූහ, තැතිගත්හ, උරහිස් එල්ලා ගත්හ, මුහුණු පහතට හෙළා ගත්හ, කල්පනා කරන්නට වූහ, පිළිතුරු දීමට නොහැකිව වාඩි වී සිටියහ. ඉක්බිති අනාථපිණ්ඩික ගෘහපතිතුමා ඒ පරිබ්‍රාජකයෝ නිහඬව, තැතිගෙන, උරහිස් එල්ලාගෙන, මුහුණු පහතට හෙළාගෙන, කල්පනා කරමින්, පිළිතුරු දීමට නොහැකිව සිටින බව දැන, අසුනෙන් නැගිට භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි අනාථපිණ්ඩික ගෘහපතිතුමා, අන්‍ය තීර්ථක පරිබ්‍රාජකයන් සමඟ තමාට ඇති වූ සියලු කතාබහ භාග්‍යවතුන් වහන්සේට දැන්වීය. “සාදු සාදු, ගෘහපති! ගෘහපති, මේ ආකාරයෙන්ම ඒ මොඝ පුරුෂයන් කලින් කලට ධර්මානුකූලව මනාව හික්මවිය යුතුය (දැඩි ලෙස සංවර කළ යුතුය)” යි.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ අනාථපිණ්ඩික ගෘහපතිතුමාට ධර්ම කථාවකින් කරුණු පැහැදිලි කළ සේක, සමාදන් කරවූ සේක, ධෛර්යවත් කළ සේක, සතුටු කළ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ විසින් ධර්ම කථාවකින් කරුණු පැහැදිලි කරනු ලැබූ, සමාදන් කරවනු ලැබූ, ධෛර්යවත් කරනු ලැබූ, සතුටු කරනු ලැබූ අනාථපිණ්ඩික ගෘහපතිතුමා අසුනෙන් නැගිට භාග්‍යවතුන් වහන්සේට වන්දනා කොට ප්‍රදක්ෂිණා කර පිටත්ව ගියේය.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ, අනාථපිණ්ඩික ගෘහපතිතුමා පිටත්ව ගොස් වැඩි වේලාවක් ගතවීමට පෙර භික්ෂූන් අමතා මෙසේ වදාළ සේක: ‘මහණෙනි, යම් භික්ෂුවක් මේ ධර්ම විනයෙහි වස් සියයක් උපසම්පදා වී සිටියත්, ඔහු අන්‍ය තීර්ථක පරිබ්‍රාජකයන් අනාථපිණ්ඩික ගෘහපතිතුමා විසින් හික්මවනු ලැබූ (සංවර කරනු ලැබූ) ආකාරයෙන්ම ධර්මානුකූලව මනාව හික්මවිය යුතුය (දැඩි ලෙස සංවර කළ යුතුය)’ යි.",
      "paliTitle": "Kiṃdiṭṭhikasuttaṃ"
    },
    {
      "number": 94,
      "pali": "Ekaṃ samayaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Atha kho vajjiyamāhito gahapati divā divassa campāya nikkhami bhagavantaṃ dassanāya. Atha kho vajjiyamāhitassa gahapatissa etadahosi – ‘‘akālo kho tāva bhagavantaṃ dassanāya. Paṭisallīno bhagavā. Manobhāvanīyānampi bhikkhūnaṃ akālo dassanāya. Paṭisallīnā manobhāvanīyāpi bhikkhū. Yaṃnūnāhaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyya’’nti. Atha kho vajjiyamāhito gahapati yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkami. Tena kho pana samayena te aññatitthiyā paribbājakā saṅgamma samāgamma unnādino uccāsaddamahāsaddā anekavihitaṃ tiracchānakathaṃ kathentā nisinnā honti. Addasaṃsu kho te aññatitthiyā paribbājakā vajjiyamāhitaṃ gahapatiṃ dūratova āgacchantaṃ. Disvāna aññamaññaṃ saṇṭhāpesuṃ – ‘‘appasaddā bhonto hontu. Mā bhonto saddamakattha. Ayaṃ vajjiyamāhito gahapati āgacchati samaṇassa gotamassa sāvako. Yāvatā kho pana samaṇassa gotamassa sāvakā gihī odātavasanā campāyaṃ paṭivasanti, ayaṃ tesaṃ aññataro vajjiyamāhito gahapati. Appasaddakāmā kho pana te āyasmanto appasaddavinītā appasaddassa vaṇṇavādino. Appeva nāma appasaddaṃ parisaṃ viditvā upasaṅkamitabbaṃ maññeyyā’’ti. Atha kho te aññatitthiyā paribbājakā tuṇhī ahesuṃ. Atha kho vajjiyamāhito gahapati yena te aññatitthiyā paribbājakā tenupasaṅkami; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho vajjiyamāhitaṃ gahapatiṃ te aññatitthiyā paribbājakā etadavocuṃ – ‘‘saccaṃ kira, gahapati, samaṇo gotamo sabbaṃ tapaṃ garahati, sabbaṃ tapassiṃ lūkhājīviṃ ekaṃsena upakkosati upavadatī’’ti? ‘‘Na kho, bhante, bhagavā sabbaṃ tapaṃ garahati napi sabbaṃ tapassiṃ lūkhājīviṃ ekaṃsena upakkosati upavadati. Gārayhaṃ kho, bhante, bhagavā garahati, pasaṃsitabbaṃ pasaṃsati. Gārayhaṃ kho pana, bhante, bhagavā garahanto pasaṃsitabbaṃ pasaṃsanto vibhajjavādo bhagavā. Na so bhagavā ettha ekaṃsavādo’’ti. Evaṃ vutte aññataro paribbājako vajjiyamāhitaṃ gahapatiṃ etadavoca – ‘‘āgamehi tvaṃ, gahapati, yassa tvaṃ samaṇassa gotamassa vaṇṇaṃ bhāsati, samaṇo gotamo venayiko appaññattiko’’ti? ‘‘Etthapāhaṃ, bhante, āyasmante vakkhāmi sahadhammena – ‘idaṃ kusala’nti, bhante, bhagavatā paññattaṃ; ‘idaṃ akusala’nti, bhante, bhagavatā paññattaṃ. Iti kusalākusalaṃ bhagavā paññāpayamāno sapaññattiko bhagavā; na so bhagavā venayiko appaññattiko’’ti. Evaṃ vutte te paribbājakā tuṇhībhūtā maṅkubhūtā pattakkhandhā adhomukhā pajjhāyantā appaṭibhānā nisīdiṃsu. Atha kho vajjiyamāhito gahapati te paribbājake tuṇhībhūte maṅkubhūte pattakkhandhe adhomukhe pajjhāyante appaṭibhāne viditvā uṭṭhāyāsanā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vajjiyamāhito gahapati yāvatako ahosi tehi aññatitthiyehi paribbājakehi saddhiṃ kathāsallāpo taṃ sabbaṃ bhagavato ārocesi. ‘‘Sādhu sādhu, gahapati! Evaṃ kho te, gahapati, moghapurisā kālena kālaṃ sahadhammena suniggahitaṃ niggahetabbā. Nāhaṃ, gahapati, sabbaṃ tapaṃ tapitabbanti vadāmi; na ca panāhaṃ, gahapati, sabbaṃ tapaṃ na tapitabbanti vadāmi; nāhaṃ, gahapati, sabbaṃ samādānaṃ samāditabbanti vadāmi; na panāhaṃ, gahapati, sabbaṃ samādānaṃ na samāditabbanti vadāmi; nāhaṃ, gahapati, sabbaṃ padhānaṃ padahitabbanti vadāmi; na panāhaṃ, gahapati, sabbaṃ padhānaṃ na padahitabbanti vadāmi; nāhaṃ, gahapati, sabbo paṭinissaggo paṭinissajjitabboti vadāmi. Na panāhaṃ, gahapati, sabbo paṭinissaggo na paṭinissajjitabboti vadāmi; nāhaṃ, gahapati, sabbā vimutti vimuccitabbāti vadāmi; na panāhaṃ, gahapati, sabbā vimutti na vimuccitabbāti vadāmi. ‘‘Yañhi, gahapati, tapaṃ tapato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ tapaṃ na tapitabbanti vadāmi. Yañca khvassa gahapati, tapaṃ tapato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṃ tapaṃ tapitabbanti vadāmi. ‘‘Yañhi, gahapati, samādānaṃ samādiyato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ samādānaṃ na samāditabbanti vadāmi. Yañca khvassa, gahapati, samādānaṃ samādiyato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpaṃ samādānaṃ samāditabbanti vadāmi. ‘‘Yañhi, gahapati, padhānaṃ padahato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpaṃ padhānaṃ na padahitabbanti vadāmi. Yañca khvassa, gahapati, padhānaṃ padahato akusalā dhammā parihāyanti kusalā dhammā abhivaḍḍhanti, evarūpaṃ padhānaṃ padahitabbanti vadāmi. ‘‘Yañhi, gahapati, paṭinissaggaṃ paṭinissajjato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpo paṭinissaggo na paṭinissajjitabboti vadāmi. Yañca khvassa, gahapati, paṭinissaggaṃ paṭinissajjato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpo paṭinissaggo paṭinissajjitabboti vadāmi. ‘‘Yañhi, gahapati, vimuttiṃ vimuccato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyanti, evarūpā vimutti na vimuccitabbāti vadāmi. Yañca khvassa, gahapati, vimuttiṃ vimuccato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhanti, evarūpā vimutti vimuccitabbāti vadāmī’’ti. Atha kho vajjiyamāhito gahapati bhagavatā dhammiyā kathāya sandassito samādapito samuttejito sampahaṃsito uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho bhagavā acirapakkante vajjiyamāhite gahapatimhi bhikkhū āmantesi – ‘‘yopi so, bhikkhave, bhikkhu dīgharattaṃ apparajakkho imasmiṃ dhammavinaye, sopi evamevaṃ aññatitthiye paribbājake sahadhammena suniggahitaṃ niggaṇheyya yathā taṃ vajjiyamāhitena gahapatinā niggahitā’’ti. Catutthaṃ.",
      "english": "At one time, the Blessed One was staying in Campā, on the bank of Gaggara’s lotus pond. Then the householder Vajjiyamāhita, in the middle of the day, set out from Campā to see the Blessed One. Then it occurred to the householder Vajjiyamāhita: “Indeed, it is not the right time now to see the Blessed One. The Blessed One is in retreat. It is also not the right time to see the bhikkhus who are cultivating their minds. The bhikkhus who are cultivating their minds are in retreat. Why don’t I go to the park of the other sect ascetics?” So, the householder Vajjiyamāhita went to the park of the other sect ascetics. Now, at that time, those other sect ascetics were sitting together, having assembled, making a great clamor and loud noise, engaged in various kinds of mundane talk. Those other sect ascetics saw the householder Vajjiyamāhita approaching from afar. Having seen him, they admonished each other: “Sirs, be quiet. Do not make any noise. This householder Vajjiyamāhita is approaching, a disciple of the recluse Gotama. Among the lay disciples of the recluse Gotama who dwell in Campā, dressed in white, this householder Vajjiyamāhita is one of them. Indeed, those venerable ones love quietude, are trained in quietude, and praise quietude. Perhaps, having known that the assembly is quiet, he will deem it fit to approach.” Then those other sect ascetics became silent. Then the householder Vajjiyamāhita approached those other sect ascetics; having approached, he exchanged greetings with them. Having concluded the courteous and memorable talk, he sat down to one side. To the householder Vajjiyamāhita, who was sitting to one side, those other sect ascetics said this: “Is it true, householder, that the recluse Gotama criticizes all asceticism, and entirely disparages and condemns all ascetics who live austerely?” “No, venerable sirs, the Blessed One does not criticize all asceticism, nor does he entirely disparage and condemn all ascetics who live austerely. Indeed, venerable sirs, the Blessed One criticizes what should be criticized, and praises what should be praised. Indeed, venerable sirs, when the Blessed One criticizes what should be criticized and praises what should be praised, he is a discerning speaker. The Blessed One is not one to make categorical statements on this matter.” When this was said, a certain ascetic said to the householder Vajjiyamāhita: “Wait, householder, you are praising the recluse Gotama, but the recluse Gotama is a destroyer, one who makes no designations!” “Even on this point, venerable sirs, I shall explain to you in accordance with the Dhamma: ‘This is wholesome,’ venerable sirs, has been designated by the Blessed One; ‘This is unwholesome,’ venerable sirs, has been designated by the Blessed One. Thus, by designating the wholesome and the unwholesome, the Blessed One is one who makes designations; he is not a destroyer who makes no designations.” When this was said, those ascetics became silent, disconcerted, with slumped shoulders, gazing downwards, disheartened, and unable to respond, they sat there. Then the householder Vajjiyamāhita, knowing that those ascetics were silent, disconcerted, with slumped shoulders, gazing downwards, disheartened, and unable to respond, rose from his seat and went to the Blessed One; having approached, he respectfully saluted the Blessed One and sat down to one side. Sitting to one side, the householder Vajjiyamāhita reported to the Blessed One all the conversation he had had with those other sect ascetics. “Excellent, excellent, householder! Indeed, householder, those deluded men should be thoroughly put down in accordance with the Dhamma from time to time. I do not say, householder, that all ascetic practices should be undertaken; nor do I say, householder, that all ascetic practices should not be undertaken. I do not say, householder, that all commitments should be committed to; nor do I say, householder, that all commitments should not be committed to. I do not say, householder, that all striving should be striven for; nor do I say, householder, that all striving should not be striven for. I do not say, householder, that all relinquishment should be relinquished; nor do I say, householder, that all relinquishment should not be relinquished. I do not say, householder, that all liberation should be liberated; nor do I say, householder, that all liberation should not be liberated.\n\n“Indeed, householder, if when undertaking an ascetic practice, unwholesome states increase and wholesome states decline, I say that such an ascetic practice should not be undertaken. But, householder, if when undertaking an ascetic practice, unwholesome states decline and wholesome states increase, I say that such an ascetic practice should be undertaken.\n\n“Indeed, householder, if when committing to a commitment, unwholesome states increase and wholesome states decline, I say that such a commitment should not be committed to.\n\nAnd also, householder, I declare that such an undertaking as that through which, when one undertakes it, unwholesome states decline and wholesome states increase, should be undertaken. Indeed, householder, I declare that such effort as that through which, when one exerts it, unwholesome states increase and wholesome states decline, should not be exerted. And also, householder, I declare that such effort as that through which, when one exerts it, unwholesome states decline and wholesome states increase, should be exerted. Indeed, householder, I declare that such a relinquishment as that through which, when one makes it, unwholesome states increase and wholesome states decline, should not be made. And also, householder, I declare that such a relinquishment as that through which, when one makes it, unwholesome states decline and wholesome states increase, should be made. Indeed, householder, I declare that such a liberation as that through which, when one experiences it, unwholesome states increase and wholesome states decline, should not be experienced. And also, householder, I declare that such a liberation as that through which, when one experiences it, unwholesome states decline and wholesome states increase, should be experienced.\n\nThen, householder Vajjiyamāhita, having been instructed, encouraged, roused, and gladdened by the Blessed One with a Dhamma talk, rose from his seat, paid homage to the Blessed One, circumambulated him respectfully, and departed.\n\nThen, when householder Vajjiyamāhita had not long departed, the Blessed One addressed the bhikkhus: \"Monks, even that bhikkhu who has long been one with little defilement in this Dhamma and Discipline could similarly and thoroughly refute renunciants of other sects with the Dhamma, just as this householder Vajjiyamāhita was convinced.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ චම්පා නුවර ගග්ගරා පොකුණ අසබඩ වැඩසිටි සේක. එකල්හි වජ්ජියමාහිත ගෘහපති දහවල් කාලයේ භාග්‍යවතුන් වහන්සේ දැකීම පිණිස චම්පා නුවරින් පිටත් විය. එකල්හි වජ්ජියමාහිත ගෘහපතිට මේ අදහස ඇති විය: \"භාග්‍යවතුන් වහන්සේ දැකීමට තවම කලාවක් නොවේ. භාග්‍යවතුන් වහන්සේ एकाන්තව වැඩ සිටිති. මනෝභාවනීය භික්ෂූන් වහන්සේලා දැකීමට ද කලාවක් නොවේ. මනෝභාවනීය භික්ෂූන් වහන්සේලා ද एकाන්තව වැඩ සිටිති. මම අන්‍ය තීර්ථක පිරිවැජියන්ගේ ආරාමයට යන්නේ නම් හොඳයි.\" එකල්හි වජ්ජියමාහිත ගෘහපති අන්‍ය තීර්ථක පිරිවැජියන්ගේ ආරාමය වෙත පැමිණියේය. එසමයෙහි ඒ අන්‍ය තීර්ථක පිරිවැජියෝ එක්ව රැස්වී, ඝෝෂාකාරීව, මහත් ශබ්ද නගමින්, නොයෙක් ආකාර වූ තිරශ්චීන කථා කියමින් වාඩි වී සිටියහ. ඒ අන්‍ය තීර්ථක පිරිවැජියෝ දුරදීම වජ්ජියමාහිත ගෘහපති එන අයුරු දුටුවෝය. දැක එකිනෙකාට කියා සිටියහ: \"පින්වත්නි, නිශ්ශබ්ද වව්. පින්වත්නි, ශබ්ද නොකරව්. මේ ශ්‍රමණ ගෞතමයන් වහන්සේගේ ශ්‍රාවකයෙකු වන වජ්ජියමාහිත ගෘහපති පැමිණෙයි. චම්පා නුවර වසන ශ්‍රමණ ගෞතමයන් වහන්සේගේ ගිහි, ධවල වස්ත්‍රධාරී ශ්‍රාවකයන් අතුරින්, මේ වජ්ජියමාහිත ගෘහපති එක් අයෙකි. ඒ පින්වතුන් නිශ්ශබ්දතාවයට කැමැත්තෝය, නිශ්ශබ්දතාවයෙන් හික්මුණෝය, නිශ්ශබ්දතාවය වර්ණනා කරන්නෝය. සමහරවිට නිශ්ශබ්ද පිරිසක් දැක මෙහි පැමිණීමට සුදුසු යැයි ඔහු සිතනු ඇතැයි.\" එකල්හි ඒ අන්‍ය තීර්ථක පිරිවැජියෝ නිශ්ශබ්ද වූහ. එකල්හි වජ්ජියමාහිත ගෘහපති ඒ අන්‍ය තීර්ථක පිරිවැජියන් වෙත පැමිණියේය; පැමිණ ඒ අන්‍ය තීර්ථක පිරිවැජියන් සමග පිළිසඳර කතා පැවැත්වීය. ප්‍රියමනාප, සිහිපත් කළ යුතු කතා බහ නිමවා එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි වජ්ජියමාහිත ගෘහපතිට ඒ අන්‍ය තීර්ථක පිරිවැජියෝ මෙසේ පැවසූහ: \"ගෘහපති, ශ්‍රමණ ගෞතමයන් වහන්සේ සියලු තපස් දොස් නගන සේක, සියලු තපස්වී දුෂ්කර ජීවිකා ඇත්තවුන් ඒකපාර්ශවිකව නින්දා කරති, හෙළා දකිති යනු ඇත්තක් ද?\" \"පින්වත්නි, භාග්‍යවතුන් වහන්සේ සියලු තපස් දොස් නගන සේක් ද නොවේ, සියලු තපස්වී දුෂ්කර ජීවිකා ඇත්තවුන් ඒකපාර්ශවිකව නින්දා කරති, හෙළා දකිති ද නොවේ. පින්වත්නි, භාග්‍යවතුන් වහන්සේ ගර්හාවට සුදුසු දෑ ගරහන සේක, ප්‍රශංසා කිරීමට සුදුසු දෑ ප්‍රශංසා කරන සේක. පින්වත්නි, ගර්හාවට සුදුසු දෑ ගරහමින්, ප්‍රශංසා කිරීමට සුදුසු දෑ ප්‍රශංසා කරමින්, භාග්‍යවතුන් වහන්සේ විභජ්ජවාදී (විමසා, වර්ගීකරණය කොට දේශනා කරන) සේක. භාග්‍යවතුන් වහන්සේ මෙහිදී ඒකපාර්ශවිකව (නොවිමසා) දේශනා කරන කෙනෙක් නොවේ.\"\n\nමෙසේ පැවසූ කල්හි එක්තරා පිරිවැජියෙක් වජ්ජියමාහිත ගෘහපතිට මෙසේ කීවේය: \"ගෘහපති, ඔබ යම් ශ්‍රමණ ගෞතමයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේද, ඒ ශ්‍රමණ ගෞතමයන් වහන්සේ විනයෙහි හික්මවන සුළුය, එහෙත් පැනවීම් නැත්තෙක් යැයි (සලකනු ලැබේ)?\" \"පින්වත්නි, මේ සම්බන්ධයෙන් මම පින්වතුන්ට ධර්මානුකූලව කියමි: 'මෙය කුසල යැ'යි පින්වත් භාග්‍යවතුන් වහන්සේ විසින් පනවනු ලැබ ඇත; 'මෙය අකුසල යැ'යි පින්වත් භාග්‍යවතුන් වහන්සේ විසින් පනවනු ලැබ ඇත. මේ අයුරින් භාග්‍යවතුන් වහන්සේ කුසල-අකුසල පනවමින්, පැනවීම් සහිත (සපඤ්ඤත්තික) කෙනෙක් සේක; එතුමන් විනයෙහි හික්මවන සුළු වන නමුත් පැනවීම් නැත්තෙක් (අප්පඤ්ඤත්තික) නොවේ.\" මෙසේ කී කල්හි ඒ පිරිවැජියෝ නිශ්ශබ්ද වූවාහු, ලජ්ජාවට පත් වූවාහු, කරවටක් හකුළා ගත්තාහු, අධෝමුඛ වූවාහු, කල්පනා කරන්නාහු, පිළිතුරු දීමට නොහැකි වූවාහු වාඩි වී සිටියහ.\n\nඑකල්හි වජ්ජියමාහිත ගෘහපති ඒ පිරිවැජියන් නිශ්ශබ්ද වූවාහු, ලජ්ජාවට පත් වූවාහු, කරවටක් හකුළා ගත්තාහු, අධෝමුඛ වූවාහු, කල්පනා කරන්නාහු, පිළිතුරු දීමට නොහැකි වූවාහු ලෙස දැන, අසුනින් නැගිට භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි වජ්ජියමාහිත ගෘහපති අන්‍ය තීර්ථක පිරිවැජියන් සමග තමාට ඇති වූ සියලු කතාබහ භාග්‍යවතුන් වහන්සේට සැලකළේය.\n\n\"සාධු සාධු, ගෘහපති! ගෘහපති, ඒ හිස් පුරුෂයන් ධර්මානුකූලව කලින් කල හොඳින් මෙසේ නීග්‍රහ කළ යුත්තෝය. ගෘහපති, මම සියලු තපස් වතාවන් කළ යුතු යැයි නොකියමි; ගෘහපති, මම සියලු තපස් වතාවන් නොකළ යුතු යැයි ද නොකියමි; ගෘහපති, මම සියලු සමාදාන (පිළිගැනීම්) සමාදන් විය යුතු යැයි නොකියමි; ගෘහපති, මම සියලු සමාදාන සමාදන් නොවිය යුතු යැයි ද නොකියමි; ගෘහපති, මම සියලු ප්‍රධාන (වීර්යයන්) කළ යුතු යැයි නොකියමි; ගෘහපති, මම සියලු ප්‍රධාන නොකළ යුතු යැයි ද නොකියමි; ගෘහපති, මම සියලු ප්‍රතිනිස්සර්ග (අත්හැරීම්) අත්හැරිය යුතු යැයි නොකියමි; ගෘහපති, මම සියලු ප්‍රතිනිස්සර්ග නොඅත්හැරිය යුතු යැයි ද නොකියමි; ගෘහපති, මම සියලු විමුක්තීන් (මිදීම්) මිදිය යුතු යැයි නොකියමි; ගෘහපති, මම සියලු විමුක්තීන් නොමිදිය යුතු යැයි ද නොකියමි.\"\n\n\"ගෘහපති, යම් තපසක් කිරීමෙන් අකුසල ධර්මයන් වර්ධනය වේද, කුසල ධර්මයන් පිරිහී යේද, එබඳු තපසක් නොකළ යුතු යැයි මම කියමි. ගෘහපති, යම් තපසක් කිරීමෙන් අකුසල ධර්මයන් පිරිහී යේද, කුසල ධර්මයන් වර්ධනය වේද, එබඳු තපසක් කළ යුතු යැයි මම කියමි. ගෘහපති, යම් සමාදානයක් සමාදන් වීමෙන් අකුසල ධර්මයන් වර්ධනය වේද, කුසල ධර්මයන් පිරිහී යේද, එබඳු සමාදානයක් සමාදන් නොවිය යුතු යැයි මම කියමි.\"\n\nගෘහපතිය, යම්කිසි සමාදන් වීමක් සමාදන් වන විට අකුසල ධර්මයන් පිරිහෙයි ද, කුසල ධර්මයන් වැඩෙයි ද, එබඳු සමාදන් වීමක් සමාදන් විය යුතු යැයි මම කියමි. ගෘහපතිය, යම්කිසි ප්‍රධානයක් වීර්ය කරන විට අකුසල ධර්මයන් වැඩෙයි ද, කුසල ධර්මයන් පිරිහෙයි ද, එබඳු ප්‍රධානයක් නොකළ යුතු යැයි මම කියමි. ගෘහපතිය, යම්කිසි ප්‍රධානයක් වීර්ය කරන විට අකුසල ධර්මයන් පිරිහෙයි ද, කුසල ධර්මයන් වැඩෙයි ද, එබඳු ප්‍රධානයක් කළ යුතු යැයි මම කියමි. ගෘහපතිය, යම්කිසි ප්‍රතිනිස්සර්ගයක් අත්හරින විට අකුසල ධර්මයන් වැඩෙයි ද, කුසල ධර්මයන් පිරිහෙයි ද, එබඳු ප්‍රතිනිස්සර්ගයක් අත් නොහැරිය යුතු යැයි මම කියමි. ගෘහපතිය, යම්කිසි ප්‍රතිනිස්සර්ගයක් අත්හරින විට අකුසල ධර්මයන් පිරිහෙයි ද, කුසල ධර්මයන් වැඩෙයි ද, එබඳු ප්‍රතිනිස්සර්ගයක් අත්හැරිය යුතු යැයි මම කියමි. ගෘහපතිය, යම්කිසි විමුක්තියකින් මිදෙන විට අකුසල ධර්මයන් වැඩෙයි ද, කුසල ධර්මයන් පිරිහෙයි ද, එබඳු විමුක්තියකින් මිදිය යුතු නොවේ යැයි මම කියමි. ගෘහපතිය, යම්කිසි විමුක්තියකින් මිදෙන විට අකුසල ධර්මයන් පිරිහෙයි ද, කුසල ධර්මයන් වැඩෙයි ද, එබඳු විමුක්තියකින් මිදිය යුතු යැයි මම කියමි.\n\nඉන්පසු වජ්ජියමාහිත ගෘහපති භාග්‍යවතුන් වහන්සේ විසින් ධර්ම කථාවකින් පෙන්වා දෙන ලදුව, සමාදන් කරවන ලදුව, උනන්දු කරවන ලදුව, සතුටු කරවන ලදුව, හුනසුනෙන් නැගිට භාග්‍යවතුන් වහන්සේට වන්දනා කර, පැදකුණු කර පිටත්ව ගියේය. ඉන්පසු භාග්‍යවතුන් වහන්සේ වජ්ජියමාහිත ගෘහපති පිටත්ව ගොස් වැඩි වේලාවක් ගතවීමට පෙර භික්ෂූන් අමතා වදාළේය: ‘‘මහණෙනි, යම්කිසි භික්ෂුවක් දීර්ඝ කාලයක් මේ ධර්ම විනයෙහි රජස් ස්වල්පයකින් යුක්තව සිටියේ නම්, ඔහු ද වජ්ජියමාහිත ගෘහපති මෙන් ම අන්‍ය තීර්ථක පරිබ්‍රාජකයන් ධර්මයට අනුව මැනවින් නිග්‍රහ කරනු ඇත.’’\n\nසිවුවන සූත්‍රයයි.",
      "paliTitle": "Vajjiyamāhitasuttaṃ"
    },
    {
      "number": 95,
      "pali": "Atha kho uttiyo paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho uttiyo paribbājako bhagavantaṃ etadavoca – ‘‘kiṃ nu kho, bho gotama, sassato loko, idameva saccaṃ moghamañña’’nti? ‘‘Abyākataṃ kho etaṃ, uttiya, mayā – ‘sassato loko, idameva saccaṃ moghamañña’’’nti. ‘‘Kiṃ pana, bho gotama, asassato loko, idameva saccaṃ moghamañña’’nti? ‘‘Etampi kho, uttiya, abyākataṃ mayā – ‘asassato loko, idameva saccaṃ moghamañña’’’nti. ‘‘Kiṃ nu kho, bho gotama, antavā loko…pe… anantavā loko… taṃ jīvaṃ taṃ sarīraṃ… aññaṃ jīvaṃ aññaṃ sarīraṃ… hoti tathāgato paraṃ maraṇā … na hoti tathāgato paraṃ maraṇā… hoti ca na ca hoti tathāgato paraṃ maraṇā… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’nti? ‘‘Etampi kho, uttiya, abyākataṃ mayā – ‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti. ‘‘‘Kiṃ nu kho, bho gotama, sassato loko, idameva saccaṃ moghamañña’nti, iti puṭṭho samāno ‘abyākataṃ kho etaṃ, uttiya, mayā – sassato loko, idameva saccaṃ moghamañña’nti vadesi. ‘‘‘Kiṃ pana, bho gotama, asassato loko, idameva saccaṃ moghamañña’nti, iti puṭṭho samāno – ‘etampi kho, uttiya, abyākataṃ mayā asassato loko, idameva saccaṃ moghamañña’nti vadesi. ‘‘‘Kiṃ nu kho, bho gotama, antavā loko…pe… anantavā loko… taṃ jīvaṃ taṃ sarīraṃ… aññaṃ jīvaṃ aññaṃ sarīraṃ… hoti tathāgato paraṃ maraṇā… na hoti tathāgato paraṃ maraṇā… hoti ca na ca hoti tathāgato paraṃ maraṇā… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamaññanti, iti puṭṭho samāno – ‘etampi kho, uttiya, abyākataṃ mayā – ‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti vadesi. Atha kiñcarahi bhotā gotamena byākata’’nti? ‘‘Abhiññāya kho ahaṃ, uttiya, sāvakānaṃ dhammaṃ desemi sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāyā’’ti. ‘‘Yaṃ panetaṃ bhavaṃ gotamo abhiññāya sāvakānaṃ dhammaṃ desesi sattānaṃ visuddhiyā sokaparidevānaṃ samatikkamāya dukkhadomanassānaṃ atthaṅgamāya ñāyassa adhigamāya nibbānassa sacchikiriyāya, sabbo vā [sabbo ca (ka.)] tena loko nīyati [nīyissati (sī.), niyyāssati (syā.), niyyaṃssati (pī.)] upaḍḍho vā tibhāgo vā’’ti [tibhāgo vāti padehi (ka.)]? Evaṃ vutte bhagavā tuṇhī ahosi. Atha kho āyasmato ānandassa etadahosi – ‘‘mā hevaṃ kho uttiyo paribbājako pāpakaṃ diṭṭhigataṃ paṭilabhi – ‘sabbasāmukkaṃsikaṃ vata me samaṇo gotamo pañhaṃ puṭṭho saṃsādeti, no vissajjeti, na nūna visahatī’ti. Tadassa uttiyassa paribbājakassa dīgharattaṃ ahitāya dukkhāyā’’ti. Atha kho āyasmā ānando uttiyaṃ paribbājakaṃ etadavoca – ‘‘tenahāvuso uttiya, upamaṃ te karissāmi. Upamāya midhekacce viññū purisā bhāsitassa atthaṃ ājānanti. Seyyathāpi, āvuso uttiya, rañño paccantimaṃ nagaraṃ daḷhuddhāpaṃ [daḷhuddāpaṃ (sī. pī.)] daḷhapākāratoraṇaṃ ekadvāraṃ. Tatrassa dovāriko paṇḍito byatto medhāvī aññātānaṃ nivāretā ñātānaṃ pavesetā. So tassa nagarassa samantā anupariyāyapathaṃ anukkamati. Anupariyāyapathaṃ anukkamamāno na passeyya pākārasandhiṃ vā pākāravivaraṃ vā, antamaso biḷāranikkhamanamattampi. No ca khvassa evaṃ ñāṇaṃ hoti – ‘ettakā pāṇā imaṃ nagaraṃ pavisanti vā nikkhamanti vā’ti. Atha khvassa evamettha hoti – ‘ye kho keci oḷārikā pāṇā imaṃ nagaraṃ pavisanti vā nikkhamanti vā, sabbe te iminā dvārena pavisanti vā nikkhamanti vā’ti. ‘‘Evamevaṃ kho, āvuso uttiya, na tathāgatassa evaṃ ussukkaṃ hoti – ‘sabbo vā tena loko nīyati, upaḍḍho vā, tibhāgo vā’ti. Atha kho evamettha tathāgatassa hoti – ‘ye kho keci lokamhā nīyiṃsu vā nīyanti vā nīyissanti vā, sabbe te pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, catūsu satipaṭṭhānesu suppatiṭṭhitacittā, satta bojjhaṅge yathābhūtaṃ bhāvetvā. Evamete [evametena (ka.)] lokamhā nīyiṃsu vā nīyanti vā nīyissanti vā’ti. Yadeva kho tvaṃ [yadeva khvettha (ka.)], āvuso uttiya, bhagavantaṃ pañhaṃ [imaṃ pañhaṃ (syā. ka.)] apucchi tadevetaṃ pañhaṃ bhagavantaṃ aññena pariyāyena apucchi. Tasmā te taṃ bhagavā na byākāsī’’ti. Pañcamaṃ.",
      "english": "Then Uttiya the wanderer approached the Blessed One. Having approached, he exchanged courteous greetings with the Blessed One. When this polite and memorable conversation was concluded, he sat down to one side. As he sat to one side, Uttiya the wanderer said to the Blessed One: \"Is the world eternal, Venerable Gotama, and only this is true, all other views are false?\" \"Uttiya, this has been undetermined by me: 'The world is eternal, and only this is true, all other views are false.'\" \"Then is the world not eternal, Venerable Gotama, and only this is true, all other views are false?\" \"Uttiya, this too has been undetermined by me: 'The world is not eternal, and only this is true, all other views are false.'\" \"Is the world finite, Venerable Gotama, and only this is true, all other views are false? Is the world infinite, and only this is true, all other views are false? Is the soul the same as the body, and only this is true, all other views are false? Is the soul one thing and the body another, and only this is true, all other views are false? Does the Tathāgata exist after death, and only this is true, all other views are false? Does the Tathāgata not exist after death, and only this is true, all other views are false? Does the Tathāgata both exist and not exist after death, and only this is true, all other views are false? Does the Tathāgata neither exist nor not exist after death, and only this is true, all other views are false?\" \"Uttiya, this too has been undetermined by me: 'The Tathāgata neither exists nor not exists after death, and only this is true, all other views are false.'\"\n\n\"When asked, 'Is the world eternal, Venerable Gotama, and only this is true, all other views are false?', you declare, 'Uttiya, this has been undetermined by me: The world is eternal, and only this is true, all other views are false.' When asked, 'Then is the world not eternal, Venerable Gotama, and only this is true, all other views are false?', you declare, 'Uttiya, this too has been undetermined by me: The world is not eternal, and only this is true, all other views are false.' When asked, 'Is the world finite, Venerable Gotama, and only this is true, all other views are false? Is the world infinite, and only this is true, all other views are false? Is the soul the same as the body, and only this is true, all other views are false? Is the soul one thing and the body another, and only this is true, all other views are false? Does the Tathāgata exist after death, and only this is true, all other views are false? Does the Tathāgata not exist after death, and only this is true, all other views are false? Does the Tathāgata both exist and not exist after death, and only this is true, all other views are false? Does the Tathāgata neither exist nor not exist after death, and only this is true, all other views are false?', you declare, 'Uttiya, this too has been undetermined by me: The Tathāgata neither exists nor not exists after death, and only this is true, all other views are false.' So what, then, has been declared by Master Gotama?\"\n\n\"Uttiya, having directly known it, I teach the Dhamma to my disciples for the purification of beings, for the overcoming of sorrow and lamentation, for the disappearance of pain and distress, for the attainment of the true method, for the realization of Nibbana.\"\n\n\"Regarding this Dhamma that Master Gotama, having directly known it, teaches to his disciples for the purification of beings, for the overcoming of sorrow and lamentation, for the disappearance of pain and distress, for the attainment of the true method, for the realization of Nibbana—is the entire world led to liberation by it, or half of it, or a third?\"\n\nWhen this was said, the Blessed One remained silent.\n\nThen it occurred to venerable Ānanda: \"Lest Uttiya the wanderer acquire a harmful wrong view, thinking: 'Truly, when I asked a fundamental and all-encompassing question, the recluse Gotama evaded it, did not clarify it, indeed he must not be capable of it.' That would be for Uttiya the wanderer's harm and suffering for a long time.\"\n\nThen venerable Ānanda addressed Uttiya the wanderer: \"Well then, friend Uttiya, I shall give you a simile. By means of a simile, some intelligent people understand the meaning of what is said. Just as, friend Uttiya, a king's border city with strong foundations, strong walls and gateways, and only one gate. There would be a gatekeeper, wise, experienced, intelligent, who keeps out strangers and lets in friends. He would patrol the path around that city. Patrolling that path, he would not see any breach in the wall or opening in the wall, not even an opening for a cat to get out. But he would not have this knowledge: 'This many beings enter or exit this city.' However, he would have this knowledge: 'Whatever large beings enter or exit this city, all of them enter or exit through this gate.'\"\n\n\"In the same way, friend Uttiya, the Tathāgata does not bother about this: 'Is the entire world led to liberation by this, or half of it, or a third?' However, the Tathāgata does have this knowledge: 'All those who have been led from the world, are being led, or will be led, all of them, having abandoned the five hindrances—the defilements of the mind that weaken wisdom—having firmly established their minds in the four establishments of mindfulness, and having developed the seven factors of awakening as they truly are, it is in this way that they have been led from the world, are being led, or will be led.' The very question, friend Uttiya, that you asked the Blessed One, you asked that same question of the Blessed One by a different approach.\"\n\nTherefore, the Blessed One did not declare that to him.",
      "sinhala": "එවිට උත්තිය නම් පිරිවැජියා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහි කටයුතු කතාබහක් පවත්වා, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි උත්තිය පිරිවැජියා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “භවත් ගෞතමයන් වහන්ස, ලෝකය සදාකාලික ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද?” “උත්තිය, මෙය මා විසින් ප්‍රකාශ නොකරන ලද්දකි – ‘ලෝකය සදාකාලිකය, මෙයම සත්‍යය, අන් සියල්ල බොරුය’ කියා.” “එසේනම්, භවත් ගෞතමයන් වහන්ස, ලෝකය අසදාකාලික ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද?” “උත්තිය, මෙයත් මා විසින් ප්‍රකාශ නොකරන ලද්දකි – ‘ලෝකය අසදාකාලිකය, මෙයම සත්‍යය, අන් සියල්ල බොරුය’ කියා.” “භවත් ගෞතමයන් වහන්ස, ලෝකය සීමා සහිත ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, ලෝකය අසීමා සහිත ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, ජීවයත් ශරීරයත් එකක් ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, ජීවයත් ශරීරයත් වෙනස් ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, මරණින් පසු තථාගතයන් වහන්සේ සිටිනවා ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, මරණින් පසු තථාගතයන් වහන්සේ නොසිටිනවා ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, මරණින් පසු තථාගතයන් වහන්සේ සිටිනවාත් නොසිටිනවාත් යන දෙකම ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, මරණින් පසු තථාගතයන් වහන්සේ සිටිනවාත් නොසිටිනවාත් යන දෙකම නොවේ ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද?” “උත්තිය, මෙයත් මා විසින් ප්‍රකාශ නොකරන ලද්දකි – ‘මරණින් පසු තථාගතයන් වහන්සේ සිටිනවාත් නොසිටිනවාත් යන දෙකම නොවේ, මෙයම සත්‍යය, අන් සියල්ල බොරුය’ කියා.” “‘භවත් ගෞතමයන් වහන්ස, ලෝකය සදාකාලික ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද?’ යැයි ඇසූ විට ‘උත්තිය, මෙය මා විසින් ප්‍රකාශ නොකරන ලද්දකි – ලෝකය සදාකාලිකය, මෙයම සත්‍යය, අන් සියල්ල බොරුය’ යැයි ඔබ වහන්සේ වදාරන සේක. ‘එසේනම්, භවත් ගෞතමයන් වහන්ස, ලෝකය අසදාකාලික ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද?’ යැයි ඇසූ විට ‘උත්තිය, මෙයත් මා විසින් ප්‍රකාශ නොකරන ලද්දකි – ලෝකය අසදාකාලිකය, මෙයම සත්‍යය, අන් සියල්ල බොරුය’ යැයි ඔබ වහන්සේ වදාරන සේක. ‘භවත් ගෞතමයන් වහන්ස, ලෝකය සීමා සහිත ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, ලෝකය අසීමා සහිත ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, ජීවයත් ශරීරයත් එකක් ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, ජීවයත් ශරීරයත් වෙනස් ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, මරණින් පසු තථාගතයන් වහන්සේ සිටිනවා ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, මරණින් පසු තථාගතයන් වහන්සේ නොසිටිනවා ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, මරණින් පසු තථාගතයන් වහන්සේ සිටිනවාත් නොසිටිනවාත් යන දෙකම ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද? භවත් ගෞතමයන් වහන්ස, මරණින් පසු තථාගතයන් වහන්සේ සිටිනවාත් නොසිටිනවාත් යන දෙකම නොවේ ද? මෙයම සත්‍යය, අන් සියල්ල බොරු ද?’ යැයි ඇසූ විට ‘උත්තිය, මෙයත් මා විසින් ප්‍රකාශ නොකරන ලද්දකි – ‘මරණින් පසු තථාගතයන් වහන්සේ සිටිනවාත් නොසිටිනවාත් යන දෙකම නොවේ, මෙයම සත්‍යය, අන් සියල්ල බොරුය’ කියා’ යැයි ඔබ වහන්සේ වදාරන සේක. එසේනම්, භවත් ගෞතමයන් වහන්සේ විසින් කුමක් නම් ප්‍රකාශ කරන ලද්දේ ද?” “උත්තිය, මා විසින් ශ්‍රාවකයන්ට ධර්මය දේශනා කරනු ලබන්නේ සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක වැළපීම් ඉක්මවා යාම පිණිස, දුක් දොම්නස් නැති කිරීම පිණිස, ඥානය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය සාක්ෂාත් කිරීම පිණිසය.”\n\n“භවත් ගෞතමයන් වහන්සේ අවබෝධයෙන් ශ්‍රාවකයන්ට ධර්මය දේශනා කරන්නේ සත්වයන්ගේ විශුද්ධිය පිණිස, ශෝක වැළපීම් ඉක්මවා යාම පිණිස, දුක් දොම්නස් නැති කිරීම පිණිස, ඥානය අවබෝධ කර ගැනීම පිණිස, නිර්වාණය සාක්ෂාත් කිරීම පිණිස නම්, ඒ ධර්මයෙන් මුළු ලෝකයම නිවනට යොමු වේ ද? නැතිනම් අඩක් ද? නැතිනම් තුනෙන් එකක් ද?” මෙසේ කී කල්හි භාග්‍යවතුන් වහන්සේ නිහඬව වැඩසිටියේය. එවිට ආයුෂ්මත් ආනන්ද හිමියන්ට මෙබඳු අදහසක් ඇති විය: “උත්තිය පිරිවැජියා ‘ශ්‍රමණ ගෞතමයන් වහන්සේ මා විසින් අසන ලද සියලු අතිශය උතුම් ප්‍රශ්නයක් මගහරිනවා මිස විසඳන්නේ නැත, එය නොවිසඳීමට හැකියාවක් නැතිවා විය යුතුය’ යනුවෙන් මේ පාපී දෘෂ්ටිය නොගනීවා! එය උත්තිය පිරිවැජියාට බොහෝ කලක් අහිත පිණිසත්, දුක පිණිසත් වන්නේය.” එවිට ආයුෂ්මත් ආනන්ද හිමියෝ උත්තිය පිරිවැජියාට මෙසේ කීහ: “එසේනම්, ආයුෂ්මත් උත්තිය, මම ඔබට උපමාවක් ගෙන දෙන්නෙමි. උපමාවකින් මෙහි ඇතැම් ප්‍රඥාවන්ත පුරුෂයෝ කියන ලද දෙයෙහි අර්ථය තේරුම් ගනිති.”\n\n“ආයුෂ්මත් උත්තිය, යම්සේ රජුගේ දේශසීමාවේ පිහිටි නගරයක් වේ ද, එය ශක්තිමත් උලූගුප්පු හා ශක්තිමත් පවුරු දොරටු සහිත, එක් දොරටුවක් පමණක් ඇති එකක් වේ. එහි පණ්ඩිත, ප්‍රසිද්ධ, ඥානවන්ත දොරටුපාලයෙක් සිටී. ඔහු නාඳුනන අය වළක්වන්නෙක් ද, හඳුනන අය ඇතුල් කරන්නෙක් ද වේ. ඔහු ඒ නගරයේ වටා ඇති බිත්තිය වටා ගමන් කරයි. එසේ වටා ගමන් කරන විට, බළලෙකුටවත් යා හැකි තරම් කුඩා සිදුරක් වත්, පවුරෙහි සන්ධියක් හෝ පවුරෙහි සිදුරක් හෝ නොදකී. ‘මේ නගරයට මෙපමණ සත්ව කොට්ඨාශ ඇතුල් වේ ද, පිටතට යයි ද’ කියා ඔහුට ඥානයක් නැත. නමුත් ඔහුට මෙබඳු අදහසක් ඇති වේ: ‘මේ නගරයට ඇතුල් වන හෝ පිටතට යන යම් කිසි මහත් සත්ව කොට්ඨාශයක් වේ නම්, ඒ සියල්ලෝම මේ එකම දොරටුවෙන් ඇතුල් වෙති, පිටතට යති’ කියා.”\n\n“ආයුෂ්මත් උත්තිය, එසේම, ‘ඒ ධර්මයෙන් මුළු ලෝකයම නිවනට යොමු වේ ද? නැතිනම් අඩක් ද? නැතිනම් තුනෙන් එකක් ද?’ කියා තථාගතයන් වහන්සේට මෙබඳු උත්සාහයක් නැත. නමුත් මෙහිදී තථාගතයන් වහන්සේට මෙබඳු අදහසක් ඇති වේ: ‘ලෝකයෙන් නිදහස් වූවාහු ද, නිදහස් වෙන්නාහු ද, නිදහස් වන්නට සිටින්නාහු ද යම් කිසි සත්ව කොට්ඨාශයක් වේ නම්, ඒ සියල්ලෝම පංච නීවරණ ප්‍රහීණ කොට, ප්‍රඥාව දුර්වල කරන සිත්හි කෙලෙස් දුරු කොට, සතර සතිපට්ඨාන භාවනාවෙහි සිත් මනාව පිහිටුවා, සප්ත බොජ්ඣංග ධර්මයන් යථාභූත ලෙස වඩවා නිදහස් වූවාහු ද, නිදහස් වෙන්නාහු ද, නිදහස් වන්නට සිටින්නාහු ද’ කියා. ආයුෂ්මත් උත්තිය, ඔබ භාග්‍යවතුන් වහන්සේගෙන් යම් ප්‍රශ්නයක් ඇසුවේ ද, එයම වෙනත් ආකාරයකින් භාග්‍යවතුන් වහන්සේගෙන් අසන ලද්දකි.”\n\nඑබැවින් භාග්‍යවතුන් වහන්සේ ඔවුන්ට එය ප්‍රකාශ නොකළ සේක.\nපස්වැනි.",
      "paliTitle": "Uttiyasuttaṃ"
    },
    {
      "number": 96,
      "pali": "‘‘Ekaṃ samayaṃ āyasmā ānando rājagahe viharati tapodārāme. Atha kho āyasmā ānando rattiyā paccūsasamayaṃ paccuṭṭhāya yena tapodā tenupasaṅkami gattāni parisiñcituṃ. Tapodāya [tapode (ka.)] gattāni parisiñcitvā paccuttaritvā ekacīvaro aṭṭhāsi gattāni pubbāpayamāno. Kokanudopi kho paribbājako rattiyā paccūsasamayaṃ paccuṭṭhāya yena tapodā tenupasaṅkami gattāni parisiñcituṃ. Addasā kho kokanudo paribbājako āyasmantaṃ ānandaṃ dūratova āgacchantaṃ. Disvāna āyasmantaṃ ānandaṃ etadavoca – ‘‘kvettha [ko tettha (sī.), kvattha (pī. ka.)], āvuso’’ti? ‘‘Ahamāvuso, bhikkhū’’ti. ‘‘Katamesaṃ, āvuso, bhikkhūna’’nti? ‘‘Samaṇānaṃ, āvuso, sakyaputtiyāna’’nti. ‘‘Puccheyyāma mayaṃ āyasmantaṃ kiñcideva desaṃ, sace āyasmā okāsaṃ karoti pañhassa veyyākaraṇāyā’’ti. ‘‘Pucchāvuso, sutvā vedissāmā’’ti. ‘‘Kiṃ nu kho, bho, ‘sassato loko, idameva saccaṃ moghamañña’nti – evaṃdiṭṭhi [evaṃdiṭṭhiko (syā.)] bhava’’nti? ‘‘Na kho ahaṃ, āvuso, evaṃdiṭṭhi – ‘sassato loko, idameva saccaṃ moghamañña’’’nti. ‘‘Kiṃ pana, bho, ‘asassato loko, idameva saccaṃ moghamañña’nti – evaṃdiṭṭhi bhava’’nti? ‘‘Na kho ahaṃ, āvuso, evaṃdiṭṭhi – ‘asassato loko, idameva saccaṃ moghamañña’’’nti. ‘‘Kiṃ nu kho, bho, antavā loko…pe… anantavā loko… taṃ jīvaṃ taṃ sarīraṃ… aññaṃ jīvaṃ aññaṃ sarīraṃ… hoti tathāgato paraṃ maraṇā… na hoti tathāgato paraṃ maraṇā… hoti ca na ca hoti tathāgato paraṃ maraṇā… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamaññanti – evaṃdiṭṭhi bhava’’nti? ‘‘Na kho ahaṃ, āvuso, evaṃdiṭṭhi – ‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti. ‘‘Tena hi bhavaṃ na jānāti, na passatī’’ti? ‘‘Na kho ahaṃ, āvuso, na jānāmi na passāmi. Jānāmahaṃ, āvuso, passāmī’’ti. ‘‘‘Kiṃ nu kho, bho, sassato loko, idameva saccaṃ moghamaññanti – evaṃdiṭṭhi bhava’nti, iti puṭṭho samāno – ‘na kho ahaṃ, āvuso, evaṃdiṭṭhi – sassato loko, idameva saccaṃ moghamañña’nti vadesi. ‘‘‘Kiṃ pana, bho, asassato loko, idameva saccaṃ moghamaññanti – evaṃdiṭṭhi bhava’nti, iti puṭṭho samāno – ‘na kho ahaṃ, āvuso, evaṃdiṭṭhi – asassato loko, idameva saccaṃ moghamañña’nti vadesi. ‘‘Kiṃ nu kho, bho, antavā loko…pe… anantavā loko… taṃ jīvaṃ taṃ sarīraṃ… aññaṃ jīvaṃ aññaṃ sarīraṃ… hoti tathāgato paraṃ maraṇā… na hoti tathāgato paraṃ maraṇā… hoti ca na ca hoti tathāgato paraṃ maraṇā… neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamaññanti – evaṃdiṭṭhi bhavanti, iti puṭṭho samāno – ‘na kho ahaṃ, āvuso, evaṃdiṭṭhi – neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti vadesi. ‘‘‘Tena hi bhavaṃ na jānāti na passatī’ti, iti puṭṭho samāno – ‘na kho ahaṃ, āvuso, na jānāmi na passāmi. Jānāmahaṃ, āvuso, passāmī’ti vadesi. Yathā kathaṃ panāvuso, imassa bhāsitassa attho daṭṭhabbo’’ti? ‘‘‘Sassato loko, idameva saccaṃ moghamañña’nti kho, āvuso, diṭṭhigatametaṃ. ‘Asassato loko, idameva saccaṃ moghamañña’nti kho, āvuso, diṭṭhigatametaṃ. Antavā loko…pe… anantavā loko… taṃ jīvaṃ taṃ sarīraṃ… aññaṃ jīvaṃ aññaṃ sarīraṃ… hoti tathāgato paraṃ maraṇā… na hoti tathāgato paraṃ maraṇā… hoti ca na ca hoti tathāgato paraṃ maraṇā… ‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’nti kho, āvuso, diṭṭhigatametaṃ. ‘‘Yāvatā, āvuso, diṭṭhi [diṭṭhigatā (sabbattha)] yāvatā diṭṭhiṭṭhānaṃ diṭṭhiadhiṭṭhānaṃ diṭṭhipariyuṭṭhānaṃ diṭṭhisamuṭṭhānaṃ diṭṭhisamugghāto [yāvatā diṭṭhiṭṭhāna adhiṭṭhāna pariyuṭṭhāna samuṭṭhāna samugghāto (sī. pī.)], tamahaṃ jānāmi tamahaṃ passāmi. Tamahaṃ jānanto tamahaṃ passanto kyāhaṃ vakkhāmi – ‘na jānāmi na passāmī’ti? Jānāmahaṃ, āvuso, passāmī’’ti. ‘‘Ko nāmo āyasmā, kathañca panāyasmantaṃ sabrahmacārī jānantī’’ti? ‘‘‘Ānando’ti kho me, āvuso, nāmaṃ. ‘Ānando’ti ca pana maṃ sabrahmacārī jānantī’’ti. ‘‘Mahācariyena vata kira, bho, saddhiṃ mantayamānā na jānimha – ‘āyasmā ānando’ti. Sace hi mayaṃ jāneyyāma – ‘ayaṃ āyasmā ānando’ti, ettakampi no nappaṭibhāyeyya [nappaṭibhāseyyāma (ka.) nappaṭibhāseyya (bahūsu) ma. ni. 3.216 passitabbaṃ]. Khamatu ca me āyasmā ānando’’ti. Chaṭṭhaṃ.",
      "english": "Once, the Venerable Ānanda was staying in Rājagaha, at the Hot Springs Park. Then, having risen in the latter part of the night, the Venerable Ānanda went to the hot springs to bathe his limbs. After bathing his limbs at the hot springs and coming out, he stood with a single robe, allowing his limbs to dry. And the wanderer Kokanuda also, having risen in the latter part of the night, went to the hot springs to bathe his limbs. The wanderer Kokanuda saw the Venerable Ānanda approaching from afar. Having seen the Venerable Ānanda, he said to him, “Who are you, friend?” “I am a bhikkhu, friend.” “Of which bhikkhus, friend?” “Of the Sakyan ascetics, friend.” “We would like to ask you something, Venerable Sir, if you would grant us the opportunity to answer a question.” “Ask, friend, and having heard, I shall know.” “Is it indeed, sir, that you hold the view: ‘The world is eternal; only this is true, anything else is deluded’?” “No, friend, I do not hold the view: ‘The world is eternal; only this is true, anything else is deluded’.” “But then, sir, do you hold the view: ‘The world is not eternal; only this is true, anything else is deluded’?” “No, friend, I do not hold the view: ‘The world is not eternal; only this is true, anything else is deluded’.” “Is it indeed, sir, that you hold the view: ‘The world is finite; only this is true, anything else is deluded’... or ‘the world is infinite; only this is true, anything else is deluded’... or ‘the soul and the body are the same; only this is true, anything else is deluded’... or ‘the soul is one thing, the body is another; only this is true, anything else is deluded’... or ‘the Tathāgata exists after death; only this is true, anything else is deluded’... or ‘the Tathāgata does not exist after death; only this is true, anything else is deluded’... or ‘the Tathāgata both exists and does not exist after death; only this is true, anything else is deluded’... or ‘the Tathāgata neither exists nor does not exist after death; only this is true, anything else is deluded’?” “No, friend, I do not hold the view: ‘The Tathāgata neither exists nor does not exist after death; only this is true, anything else is deluded’.” “In that case, sir, you do not know, you do not see?” “No, friend, it is not that I do not know or do not see. I do know, friend, I do see.”\n\n“When asked, ‘Is it indeed, sir, that you hold the view: \"The world is eternal; only this is true, anything else is deluded\"?’ – you say, ‘No, friend, I do not hold the view: \"The world is eternal; only this is true, anything else is deluded.\"’ When asked, ‘But then, sir, do you hold the view: \"The world is not eternal; only this is true, anything else is deluded\"?’ – you say, ‘No, friend, I do not hold the view: \"The world is not eternal; only this is true, anything else is deluded.\"’ When asked, ‘Is it indeed, sir, that you hold the view: \"The world is finite; only this is true, anything else is deluded\"’... or ‘\"the world is infinite; only this is true, anything else is deluded\"’... or ‘\"the soul and the body are the same; only this is true, anything else is deluded\"’... or ‘\"the soul is one thing, the body is another; only this is true, anything else is deluded\"’... or ‘\"the Tathāgata exists after death; only this is true, anything else is deluded\"’... or ‘\"the Tathāgata does not exist after death; only this is true, anything else is deluded\"’... or ‘\"the Tathāgata both exists and does not exist after death; only this is deluded\"’... or ‘\"the Tathāgata neither exists nor does not exist after death; only this is deluded\"?’ – you say, ‘No, friend, I do not hold the view: \"The Tathāgata neither exists nor does not exist after death; only this is true, anything else is deluded.\"’ When asked, ‘In that case, sir, you do not know, you do not see?’ – you say, ‘No, friend, it is not that I do not know or do not see. I do know, friend, I do see.’ How then, friend, is the meaning of this statement to be understood?”\n\n“‘The world is eternal; only this is true, anything else is deluded’ – this, friend, is a thicket of views. ‘The world is not eternal; only this is true, anything else is deluded’ – this, friend, is a thicket of views. ‘The world is finite; only this is true, anything else is deluded’... or ‘the world is infinite; only this is true, anything else is deluded’... or ‘the soul and the body are the same; only this is true, anything else is deluded’... or ‘the soul is one thing, the body is another; only this is true, anything else is deluded’... or ‘the Tathāgata exists after death; only this is true, anything else is deluded’... or ‘the Tathāgata does not exist after death; only this is true, anything else is deluded’... or ‘the Tathāgata both exists and does not exist after death; only this is true, anything else is deluded’... or ‘the Tathāgata neither exists nor does not exist after death; only this is true, anything else is deluded’ – these, friend, are thickets of views. Whatever views there are, friend, whatever the grounds of views, whatever the tenacious adherence to views, whatever the obsession with views, whatever the origin of views, whatever the uprooting of views – all that I know, all that I see. Knowing that, seeing that, how could I say, ‘I do not know, I do not see’? I do know, friend, I do see.”\n\n“What is your name, Venerable Sir, and how do your fellow practitioners know you?” “‘Ānanda’ is my name, friend. And my fellow practitioners know me as ‘Ānanda’.” “Indeed, sir, we have been conversing with the great teacher and did not realize it was the Venerable Ānanda. If we had known that this was the Venerable Ānanda, we would not have presumed to speak so much. May the Venerable Ānanda forgive me.”",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ රජගහ නුවර තපෝදාරාමයේ වැඩසිටියහ. ඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ රාත්‍රියේ අලුයම අවදිව තපෝදාවට (උණු දිය පොකුණට) ශරීරය සෝදා ගැනීමට වැඩියහ. තපෝදාවේ ශරීරය සෝදා, ආපසු පැමිණ, තනි සිවුරකින් යුතුව, ශරීරය වියළා ගනිමින් සිටියහ. කොකනුද නම් පරිබ්‍රාජකයා ද රාත්‍රියේ අලුයම අවදිව තපෝදාවට ශරීරය සෝදා ගැනීමට පැමිණියේය. කොකනුද පරිබ්‍රාජකයා දුරදීම ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ එනවා දුටුවේය. දුටු ඔහු ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: \"ආයුෂ්මත්වරයාණෙනි, ඔබ කවුද?\" \"ආයුෂ්මත්වරයාණෙනි, මම භික්ෂුවක්මි.\" \"ආයුෂ්මත්වරයාණෙනි, කවර භික්ෂූන්ගෙන්ද?\" \"ආයුෂ්මත්වරයාණෙනි, ශාක්‍යපුත්‍ර ශ්‍රමණයන්ගෙන්ය.\"\n\n\"ප්‍රශ්නයකට පිළිතුරු දීමට ආයුෂ්මත්වරයාණන් වහන්සේ අවකාශ සලසා දෙන්නේ නම්, අපි ආයුෂ්මත්වරයාණන් වහන්සේගෙන් යම් කරුණක් විමසමු.\" \"ආයුෂ්මත්වරයාණෙනි, විමසන්න. අසා අපි දැනගන්නෙමු.\"\n\n\"පින්වත, 'ලෝකය සදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් ඔබ දරන්නේද?\" \"නැත, ආයුෂ්මත්වරයාණෙනි, 'ලෝකය සදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් මම නොදරමි.\" \"එසේනම්, පින්වත, 'ලෝකය අසදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් ඔබ දරන්නේද?\" \"නැත, ආයුෂ්මත්වරයාණෙනි, 'ලෝකය අසදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් මම නොදරමි.\" \"එසේනම්, පින්වත, 'ලෝකය කෙළවරක් ඇත්තේය, ලෝකය කෙළවරක් නැත්තේය, ඒ ජීවයම ශරීරය වේ, ජීවය එකකි, ශරීරය තව එකකි, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්, තථාගතයන් වහන්සේ මරණින් පසුව නොසිටිත්, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්ද නොසිටිත්ද, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්යයි කිව නොහැක්කේද, නොසිටිත්යයි කිව නොහැක්කේද, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් ඔබ දරන්නේද?\" \"නැත, ආයුෂ්මත්වරයාණෙනි, 'තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්යයි කිව නොහැක්කේද, නොසිටිත්යයි කිව නොහැක්කේද, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් මම නොදරමි.\"\n\n\"එසේ නම්, පින්වත් ඔබ නොදන්නේය, නොදකින්නේය?\" \"නැත, ආයුෂ්මත්වරයාණෙනි, මම නොදන්නෙමි යයි, නොදකින්නෙමි යයි කිව නොහැක. ආයුෂ්මත්වරයාණෙනි, මම දනිමි, මම දකිමි.\"\n\n\"පින්වත, 'ලෝකය සදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් ඔබ දරන්නේදැයි විමසූ විට, 'නැත, ආයුෂ්මත්වරයාණෙනි, 'ලෝකය සදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් මම නොදරමි' යැයි ඔබ කියන්නෙහි. පින්වත, 'ලෝකය අසදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් ඔබ දරන්නේදැයි විමසූ විට, 'නැත, ආයුෂ්මත්වරයාණෙනි, 'ලෝකය අසදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යන මෙවැනි දෘෂ්ටියක් මම නොදරමි' යැයි ඔබ කියන්නෙහි. පින්වත, 'ලෝකය කෙළවරක් ඇත්තේය, ලෝකය කෙළවරක් නැත්තේය, ඒ ජීවයම ශරීරය වේ, ජීවය එකකි, ශරීරය තව එකකි, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්, තථාගතයන් වහන්සේ මරණින් පසුව නොසිටිත්, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්ද නොසිටිත්ද, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්යයි කිව නොහැක්කේද, නොසිටිත්යයි කිව නොහැක්කේද, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යනුවෙන් විමසූ විට, 'නැත, ආයුෂ්මත්වරයාණෙනි, 'තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්යයි කිව නොහැක්කේද, නොසිටිත්යයි කිව නොහැක්කේද, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යනුවෙන්' ඔබ කියන්නෙහි. පින්වත් ඔබ නොදන්නේය, නොදකින්නේයැයි විමසූ විට, 'නැත, ආයුෂ්මත්වරයාණෙනි, මම නොදන්නෙමි යයි, නොදකින්නෙමි යයි කිව නොහැක. ආයුෂ්මත්වරයාණෙනි, මම දනිමි, මම දකිමි' යැයි ඔබ කියන්නෙහි. ආයුෂ්මත්වරයාණෙනි, එසේනම් මේ කියන ලද දෙයෙහි තේරුම කෙසේ තේරුම් ගත යුතුද?\"\n\n\"ආයුෂ්මත්වරයාණෙනි, 'ලෝකය සදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යනු දෘෂ්ටියකි. 'ලෝකය අසදාකාලිකය, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යනු ද දෘෂ්ටියකි. 'ලෝකය කෙළවරක් ඇත්තේය, ලෝකය කෙළවරක් නැත්තේය, ඒ ජීවයම ශරීරය වේ, ජීවය එකකි, ශරීරය තව එකකි, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්, තථාගතයන් වහන්සේ මරණින් පසුව නොසිටිත්, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්ද නොසිටිත්ද, තථාගතයන් වහන්සේ මරණින් පසුව සිටිත්යයි කිව නොහැක්කේද, නොසිටිත්යයි කිව නොහැක්කේද, මෙයම සත්‍යයයි, අන් සියල්ල බොරුය' යනු ද දෘෂ්ටියකි.\"\n\n\"ආයුෂ්මත්වරයාණෙනි, යම්තාක් දෘෂ්ටි තිබේද, යම්තාක් දෘෂ්ටි පිහිටි ස්ථාන තිබේද, යම්තාක් දෘෂ්ටි අධිෂ්ඨාන තිබේද, යම්තාක් දෘෂ්ටි වලින් සිත වෙළා ගැනීම් (පරියුට්ඨාන) තිබේද, යම්තාක් දෘෂ්ටි ඇතිවීම් (සමුට්ඨාන) තිබේද, යම්තාක් දෘෂ්ටි ප්‍රහාණය කිරීම් (සමුග්ඝාත) තිබේද, ඒ සියල්ල මම දනිමි, ඒ සියල්ල මම දකිමි. ඒ සියල්ල දන්නා, ඒ සියල්ල දකින මම 'මම නොදන්නෙමි, නොදකින්නෙමි' යැයි කියන්නේ කෙසේද? ආයුෂ්මත්වරයාණෙනි, මම දනිමි, මම දකිමි.\"\n\n\"ආයුෂ්මත්වරයාණන් වහන්සේගේ නම කුමක්ද? බ්‍රහ්මචාරී සහෝදරයන් ආයුෂ්මත්වරයාණන් වහන්සේ හඳුනන්නේ කෙසේද?\" \"ආයුෂ්මත්වරයාණෙනි, මගේ නම 'ආනන්ද' යි. මාගේ බ්‍රහ්මචාරී සහෝදරයෝ ද මා 'ආනන්ද' යැයි හඳුනති.\"\n\n\"අහෝ පින්වත, මහා ආචාර්යවරයකු (බුදුරජාණන් වහන්සේගේ සමීපතමයකු) සමඟ කතා කරමින් සිටියදීත්, 'මේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේය' යැයි අපි නොදැන සිටියෙමු. ඇත්තෙන්ම, අපි 'මේ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේය' යැයි දැන සිටියේ නම්, මෙතරම් ප්‍රශ්න කිරීමට අපට නොහැකි වන්නට තිබුණි. ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ මා හට කමා කරන සේක්වා.\"",
      "paliTitle": "Kokanudasuttaṃ"
    },
    {
      "number": 97,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. ‘‘Katamehi dasahi? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. ‘‘Bahussuto hoti sutadharo sutasannicayo. Ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. ‘‘Kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. ‘‘Sammādiṭṭhiko hoti sammādassanena samannāgato. ‘‘Anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti; bahudhāpi hutvā eko hoti; āvibhāvaṃ, tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati, seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake; udakepi abhijjamāne gacchati, seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamati, seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati [parimasati (sī.)] parimajjati, yāva brahmalokāpi kāyena vasaṃ vatteti. ‘‘Dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. ‘‘Parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti. Sarāgaṃ vā cittaṃ ‘sarāgaṃ citta’nti pajānāti; vītarāgaṃ vā cittaṃ ‘vītarāgaṃ citta’nti pajānāti; sadosaṃ vā cittaṃ… vītadosaṃ vā cittaṃ… samohaṃ vā cittaṃ… vītamohaṃ vā cittaṃ… saṃkhittaṃ vā cittaṃ… vikkhittaṃ vā cittaṃ… mahaggataṃ vā cittaṃ… amahaggataṃ vā cittaṃ… sauttaraṃ vā cittaṃ… anuttaraṃ vā cittaṃ… samāhitaṃ vā cittaṃ… asamāhitaṃ vā cittaṃ… vimuttaṃ vā cittaṃ… avimuttaṃ vā cittaṃ ‘avimuttaṃ citta’nti pajānāti. ‘‘Anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhapaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhapaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘Dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata kho bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. ‘‘Āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, dasahi dhammehi samannāgato bhikkhu āhuneyyo hoti pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassā’’ti. Sattamaṃ.",
      "english": "Monks, a monk endowed with ten qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world. Which ten?\n\nHere, monks, a monk is virtuous, he dwells restrained by the Pātimokkha restraint, perfect in conduct and resort, seeing danger in the slightest faults, and undertaking the training in the training rules.\n\nHe is learned, a preserver of what he has heard, a collector of what he has heard. Those teachings that are good in the beginning, good in the middle, and good in the end, that declare the holy life in its entirety, perfectly complete and pure, both in spirit and in letter—such teachings he has heard much of, he has retained them, recited them by heart, contemplated them mentally, and penetrated them well through understanding.\n\nHe has noble friends, noble companions, noble associates.\n\nHe is of right view, endowed with right vision.\n\nHe experiences various kinds of supernormal powers: being one, he becomes many; being many, he becomes one; he appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through space; he dives in and out of the earth as if in water; he walks on water without sinking as if on land; he travels through the air cross-legged like a winged bird; he touches and strokes with his hand the moon and sun, which are so mighty and powerful; and he exercises bodily mastery even as far as the Brahma-world.\n\nWith the divine ear element, purified and surpassing that of humans, he hears both kinds of sounds, divine and human, those that are far as well as those that are near.\n\nHe understands the minds of other beings, other individuals, by comprehending them with his own mind. He understands a mind with lust as ‘a mind with lust’; he understands a mind without lust as ‘a mind without lust’; he understands a mind with hatred as ‘a mind with hatred’; he understands a mind without hatred as ‘a mind without hatred’; he understands a mind with delusion as ‘a mind with delusion’; he understands a mind without delusion as ‘a mind without delusion’; he understands a constricted mind as ‘a constricted mind’; he understands a distracted mind as ‘a distracted mind’; he understands a developed mind as ‘a developed mind’; he understands an undeveloped mind as ‘an undeveloped mind’; he understands a surpassable mind as ‘a surpassable mind’; he understands an unsurpassed mind as ‘an unsurpassed mind’; he understands a concentrated mind as ‘a concentrated mind’; he understands an unconcentrated mind as ‘an unconcentrated mind’; he understands a liberated mind as ‘a liberated mind’; he understands an unliberated mind as ‘an unliberated mind’.\n\nHe recollects his manifold past abodes, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births, many eons of world-contraction, many eons of world-expansion, many eons of world-contraction and expansion. He recollects: ‘There I was such a name, of such a clan, of such a complexion, nourished by such food, experiencing such pleasant and painful feelings, with such a lifespan. Having passed away from there, I reappeared yonder. There too I was such a name, of such a clan, of such a complexion, nourished by such food, experiencing such pleasant and painful feelings, with such a lifespan. Having passed away from there, I reappeared here.’ Thus, he recollects his manifold past abodes with their details and features.\n\nWith the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their actions. ‘Indeed, these good sirs, beings were endowed with misconduct in body, speech, and mind; they slandered the noble ones; they held wrong views and undertook actions based on wrong views. With the breakup of the body, after death, they reappeared in a state of deprivation, a bad destination, a lower realm, hell. But these good sirs, beings were endowed with good conduct in body, speech, and mind; they did not slander the noble ones; they held right views and undertook actions based on right views. With the breakup of the body, after death, they reappeared in a good destination, a heavenly world.’ Thus, with the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their actions.\n\nWith the destruction of the taints, he realizes for himself with direct knowledge, in this very life, the taintless liberation of mind and liberation through wisdom, and he dwells having attained it. Monks, a monk endowed with these ten qualities is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, කරුණු දහයකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය ද, පාහුණෙය්‍ය ද, දක්ඛිණෙය්‍ය ද, ඇඳිලි පිදීමට සුදුසු ද වේ. එසේම ඔහු ලෝකයාට අනුත්තර වූ පින් කෙතක් ද වේ.\n\nකවර දශයකින් ද? මහණෙනි, මෙහිලා භික්ෂුව සිල්වත් වේ. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාර ගෝචර සම්පන්න වේ. අනුමාත්‍ර වරදෙහි ද භය දකී. ශික්ෂා පදයන් සමාදන්ව හික්මෙයි.\n\nබහුශ්‍රැත වේ. අසා ඇති දේ දරන්නේය. අසා ඇති දේ රැස් කරගත්තේය. යම් ඒ ධර්මයන් ආදි කල්‍යාණ, මධ්‍ය කල්‍යාණ, පරියෝසාන කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේ ද, එවැනි ධර්මයන් ඔහුට බහුශ්‍රැත වේ. ඒවා වචනයෙන් හුරු පුරුදු කරගත්, සිතින් විමසා බැලූ, දෘෂ්ටියෙන් මනාව විනිවිද දකින ලද ධර්මයන් වේ.\n\nකල්‍යාණ මිත්‍ර වේ. කල්‍යාණ සහාය වේ. කල්‍යාණ සම්පවංක වේ.\n\nසම්මා දිට්ඨික වේ. සම්මා දර්ශනයෙන් යුක්ත වේ.\n\nනොයෙක් ප්‍රකාර ඉර්ධි ප්‍රාතිහාර්යයන් අත්දකී. එකෙක්ව සිටිය දී බහු ප්‍රකාර වේ. බහු ප්‍රකාරව සිටිය දී එකෙක් වේ. ප්‍රකට වීම, නොපෙනී යෑම සිදු කරයි. පවුරු, ප්‍රාකාර, පර්වත හරහා අහසෙහි මෙන් බාධාවකින් තොරව ගමන් කරයි. පොළොවෙහි ද ජලයෙහි මෙන් මතු වීම, කිඳා බසීම කරයි. ජලයෙහි ද පොළොවෙහි මෙන් නොබිඳී ගමන් කරයි. අහසෙහි ද පක්ෂියෙකු සේ පලඟින් ගමන් කරයි. මේ ශ්‍රේෂ්ඨ ඉර්ධි ඇති, ශ්‍රේෂ්ඨ අනුභාව ඇති හිරු සඳු ද අතින් ස්පර්ශ කරයි, පිරිමදියි. බ්‍රහ්ම ලෝකය දක්වා ද කයින් වසඟ කොට පවත්වයි.\n\nපිරිසිදු වූ, මිනිස් කන් ඉක්මවූ, දිව්‍ය ශ්‍රෝත්‍ර ධාතුවෙන් දිව්‍ය වූ ද, මනුෂ්‍ය වූ ද, දුර හෝ ළඟ හෝ යන දෙආකාර ශබ්දයන් අසයි.\n\nඅන් සත්වයන්ගේ, අන් පුද්ගලයන්ගේ සිත්, තමාගේ සිතින් පිරිසිඳ දනියි. රාග සහිත සිත 'රාග සහිත සිත' යි ද, රාග රහිත සිත 'රාග රහිත සිත' යි ද දනියි. ද්වේෂ සහිත සිත 'ද්වේෂ සහිත සිත' යි ද, ද්වේෂ රහිත සිත 'ද්වේෂ රහිත සිත' යි ද දනියි. මෝහ සහිත සිත 'මෝහ සහිත සිත' යි ද, මෝහ රහිත සිත 'මෝහ රහිත සිත' යි ද දනියි. සංක්ෂිප්ත සිත 'සංක්ෂිප්ත සිත' යි ද, වික්ෂිප්ත සිත 'වික්ෂිප්ත සිත' යි ද දනියි. මහග්ගත සිත 'මහග්ගත සිත' යි ද, අමහග්ගත සිත 'අමහග්ගත සිත' යි ද දනියි. සඋත්තර සිත 'සඋත්තර සිත' යි ද, අනුත්තර සිත 'අනුත්තර සිත' යි ද දනියි. සමාහිත සිත 'සමාහිත සිත' යි ද, අසමාහිත සිත 'අසමාහිත සිත' යි ද දනියි. විමුක්ත සිත 'විමුක්ත සිත' යි ද, අවිමුක්ත සිත 'අවිමුක්ත සිත' යි ද දනියි.\n\nනොයෙක් ප්‍රකාර පූර්වනිවාස (පෙර විසූ කඳපිළිවෙල) සිහි කරයි. එනම්: එක් ජාතියක් ද, දෙජාතියක් ද, තුන් ජාතියක් ද, සිව් ජාතියක් ද, පස් ජාතියක් ද, දස ජාතියක් ද, විසි ජාතියක් ද, තිස් ජාතියක් ද, සතළිස් ජාතියක් ද, පනස් ජාතියක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, බොහෝ සංවට්ට කල්පයන් ද, බොහෝ විවට්ට කල්පයන් ද, බොහෝ සංවට්ට-විවට්ට කල්පයන් ද සිහි කරයි. 'මම අසවල් තැන අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍ර ඇත්තෙක් වීමි, අසවල් වර්ණ ඇත්තෙක් වීමි, අසවල් ආකාරයේ ආහාර ඇත්තෙක් වීමි, අසවල් ආකාරයේ සැප දුක් විඳින්නෙක් වීමි, අසවල් ආයුෂ ප්‍රමාණය ඇත්තෙක් වීමි. මම එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එහි ද මම අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍ර ඇත්තෙක් වීමි, අසවල් වර්ණ ඇත්තෙක් වීමි, අසවල් ආකාරයේ ආහාර ඇත්තෙක් වීමි, අසවල් ආකාරයේ සැප දුක් විඳින්නෙක් වීමි, අසවල් ආයුෂ ප්‍රමාණය ඇත්තෙක් වීමි. එතැනින් චුත වී මෙහි උපන්නෙමි' යි මෙසේ ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ප්‍රකාර පූර්වනිවාසය සිහි කරයි.\n\nපිරිසිදු වූ, මිනිස් ඇස ඉක්මවූ දිව්‍ය චක්ෂුසින් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති දුර්ගතිවල උපදින, කර්මානුරූපී වූ සත්වයන් දකී. 'මේ භවත් සත්වයෝ කාය දුශ්චරිතයෙන් යුක්ත වූහ, වචී දුශ්චරිතයෙන් යුක්ත වූහ, මනෝ දුශ්චරිතයෙන් යුක්ත වූහ, ආර්යයන්ට අපහාස කරන්නෝ වූහ, මිත්‍යා දෘෂ්ටික වූහ, මිත්‍යා දෘෂ්ටික කර්ම සමාදන් වූහ. ඔවුහු කය බිඳීමෙන් මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරයෙහි උපන්නාහ' යි ද දකී. 'නැතහොත් මේ භවත් සත්වයෝ කාය සුචරිතයෙන් යුක්ත වූහ, වචී සුචරිතයෙන් යුක්ත වූහ, මනෝ සුචරිතයෙන් යුක්ත වූහ, ආර්යයන්ට අපහාස නොකරන්නෝ වූහ, සම්මා දෘෂ්ටික වූහ, සම්මා දෘෂ්ටික කර්ම සමාදන් වූහ. ඔවුහු කය බිඳීමෙන් මරණින් මතු සුගති, ස්වර්ග ලෝකයන්හි උපන්නාහ' යි ද දකී. මෙසේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවූ දිව්‍ය චක්ෂුසින් චුත වන, උපදින, හීන වූ, ප්‍රණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති දුර්ගතිවල උපදින, කර්මානුරූපී වූ සත්වයන් දකී.\n\nආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය ද, ප්‍රඥාවිමුක්තිය ද මේ ආත්මභාවයෙහි ම තමා විසින් ම අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, ලබාගෙන වාසය කරයි. මහණෙනි, මෙවැනි කරුණු දහයකින් යුක්ත වූ භික්ෂුව ආහුණෙය්‍ය ද, පාහුණෙය්‍ය ද, දක්ඛිණෙය්‍ය ද, ඇඳිලි පිදීමට සුදුසු ද වේ. එසේම ඔහු ලෝකයාට අනුත්තර වූ පින් කෙතක් ද වේ.",
      "paliTitle": "Āhuneyyasuttaṃ"
    },
    {
      "number": 98,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato thero bhikkhu yassaṃ yassaṃ disāyaṃ viharati, phāsuyeva viharati. Katamehi dasahi? Thero hoti rattaññū cirapabbajito, sīlavā hoti …pe… samādāya sikkhati sikkhāpadesu, bahussuto hoti…pe… diṭṭhiyā suppaṭividdho, ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso, adhikaraṇasamuppādavūpasamakusalo hoti, dhammakāmo hoti piyasamudāhāro abhidhamme abhivinaye uḷārapāmojjo, santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārena, pāsādiko hoti abhikkantapaṭikkante [abhikkantapaṭikkanto (ka.)] susaṃvuto antaraghare nisajjāya, catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī hoti akicchalābhī akasiralābhī, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Imehi kho, bhikkhave, dasahi dhammehi samannāgato thero bhikkhu yassaṃ yassaṃ disāyaṃ viharati, phāsuyeva viharatī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, an elder monk endowed with these ten qualities dwells at ease, wherever he may be. Which ten? He is an elder, experienced, having been ordained for a long time; he is virtuous, he dwells restrained by the Pātimokkha rules, perfect in conduct and domain, seeing danger in the slightest faults, and trains himself by undertaking the training rules; he is learned, one who remembers what he has heard, retains what he has heard, and accumulates what he has heard; those teachings that are good in the beginning, good in the middle, and good in the end, with their correct meaning and phrasing, he makes known the utterly perfect and pure holy life; such teachings are extensively heard by him, retained, familiar, examined with wisdom, and well-penetrated by right view; moreover, both aspects of his Pātimokkha are well-mastered by him in detail, well-analyzed, well-applied, well-discerned, according to the suttas and according to their detailed explanations; he is skilled in the arising and resolution of legal issues; he is fond of the Dhamma, delighting in pleasant discourse, experiencing sublime joy in the Abhidhamma and Abhivinaya; he is content with whatever robes, almsfood, lodging, and medicinal requisites for the sick; he is inspiring, well-restrained in his going forth and returning, and in his sitting within dwellings; he is one who obtains at will, without difficulty or trouble, the four jhānas — the exalted mental states that are pleasant abidings in this very life; and through the destruction of the taints, having realized and actualized by himself through direct knowledge the taintless liberation of mind and liberation by wisdom, he abides in this very life having attained it. Monks, an elder monk endowed with these ten qualities dwells at ease, wherever he may be.",
      "sinhala": "මහණෙනි, කරුණු දහයකින් යුක්ත වූ මහළු භික්ෂුවක් යම් යම් දිශාවක වාසය කරයි ද, ඔහු සුවසේම වාසය කරයි. කවර දහයකින් ද?\n\nමහණෙනි, ඔහු මහළු වෙයි, දීර්ඝකාලීනව පැවිදි වූ, ධර්මයෙහි රතඤ්ඤූ වූ කෙනෙක් වෙයි. ඔහු සිල්වත් වෙයි, හික්මෙන්නට සිල්පදයන් සමාදන්ව හික්මෙයි. ඔහු බහුශ්‍රැත වෙයි, දෘෂ්ටියෙන් (නුවණින්) හොඳින් අවබෝධ කළ කෙනෙක් වෙයි. භික්ෂු ප්‍රාතිමෝක්ෂය ද, භික්ෂුණී ප්‍රාතිමෝක්ෂය ද යන දෙකම ඔහුට විස්තර සහිතව හොඳින් ප්‍රගුණ කළ, හොඳින් විභාග කළ, හොඳින් පිළිපදින ලද, සූත්‍ර ක්‍රමයෙන් ද, අනුබ්‍යඤ්ජන ක්‍රමයෙන් ද හොඳින් විනිශ්චය කළ ඒවා වෙයි. ඔහු අධිකරණ ඇතිවීම් සහ ඒවා සංසිඳවීමෙහි දක්ෂ වෙයි. ඔහු ධර්මයට කැමති වෙයි, ප්‍රිය වචන කථා කරන්නෙක් වෙයි, අභිධර්මයෙහි ද අභිවිනයෙහි ද මහත් ප්‍රමෝදයෙන් යුක්ත වෙයි. ඔහු ලැබෙන ඕනෑම සිවුරකින්, පිණ්ඩපාතයෙන්, සේනාසනයෙන්, ගිලන්පස බෙහෙත් පරිස්කාරයෙන් සතුටු වෙයි. ඔහු ප්‍රසාදජනක වෙයි, ඉදිරියට යෑමෙහි ද ආපසු ඒමෙහි ද, ගෙවල් තුළ හිඳීමෙහි ද හොඳින් සංවර වූයේ වෙයි. අභිචෛතසික වූ, දැක්කා වූ මේ ආත්මභාවයේම සැප විහරණ වූ සතර ධ්‍යාන කැමති සේ ලබන්නෙක් වෙයි, අපහසුවකින් තොරව ලබන්නෙක් වෙයි, කිසිදු උත්සාහයකින් තොරව ලබන්නෙක් වෙයි. ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් අනාශ්‍රව වූ චේතෝවිමුක්තිය ද ප්‍රඥාවිමුක්තිය ද මේ දැක්කා වූ ධර්මයෙහිම තමා විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට, ප්‍රත්‍යක්ෂ කොට, එයට පැමිණ වාසය කරයි.\n\nමහණෙනි, මේ දස කරුණින් යුක්ත වූ මහළු භික්ෂුවක් යම් යම් දිශාවක වාසය කරයි ද, ඔහු සුවසේම වාසය කරයි.",
      "paliTitle": "Therasuttaṃ"
    },
    {
      "number": 99,
      "pali": "Atha kho āyasmā upāli yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘icchāmahaṃ, bhante, araññavanapatthāni pantāni senāsanāni paṭisevitu’’nti. ‘‘Durabhisambhavāni hi kho [durabhisambhavāni kho (sī. pī.)], upāli, araññavanapatthāni pantāni senāsanāni. Dukkaraṃ pavivekaṃ durabhiramaṃ. Ekatte haranti maññe mano vanāni samādhiṃ alabhamānassa bhikkhuno. Yo kho, upāli, evaṃ vadeyya – ‘ahaṃ samādhiṃ alabhamāno araññavanapatthāni pantāni senāsanāni paṭisevissāmī’ti, tassetaṃ pāṭikaṅkhaṃ – ‘saṃsīdissati vā uplavissati vā’ti [uppilavissati vā (sī. syā. pī.)]. ‘‘Seyyathāpi, upāli, mahāudakarahado. Atha āgaccheyya hatthināgo sattaratano vā aḍḍhaṭṭharatano [aṭṭharatano (sī. pī.)] vā. Tassa evamassa – ‘yaṃnūnāhaṃ imaṃ udakarahadaṃ ogāhetvā kaṇṇasaṃdhovikampi khiḍḍaṃ kīḷeyyaṃ piṭṭhisaṃdhovikampi khiḍḍaṃ kīḷeyyaṃ. Kaṇṇasaṃdhovikampi khiḍḍaṃ kīḷitvā piṭṭhisaṃdhovikampi khiḍḍaṃ kīḷitvā nhatvā [nahātvā (sī. pī.), nhātvā (syā.)] ca pivitvā ca paccuttaritvā yena kāmaṃ pakkameyya’nti. So taṃ udakarahadaṃ ogāhetvā kaṇṇasaṃdhovikampi khiḍḍaṃ kīḷeyya piṭṭhisaṃdhovikampi khiḍḍaṃ kīḷeyya; kaṇṇasaṃdhovikampi khiḍḍaṃ kīḷitvā piṭṭhisaṃdhovikampi khiḍḍaṃ kīḷitvā nhatvā ca pivitvā ca paccuttaritvā yena kāmaṃ pakkameyya. Taṃ kissa hetu? Mahā, upāli [mahā hupāli (sī. pī.)], attabhāvo gambhīre gādhaṃ vindati. ‘‘Atha āgaccheyya saso vā biḷāro vā. Tassa evamassa – ‘ko cāhaṃ, ko ca hatthināgo! Yaṃnūnāhaṃ imaṃ udakarahadaṃ ogāhetvā kaṇṇasaṃdhovikampi khiḍḍaṃ kīḷeyyaṃ piṭṭhisaṃdhovikampi khiḍḍaṃ kīḷeyyaṃ; kaṇṇasaṃdhovikampi khiḍḍaṃ kīḷitvā piṭṭhisaṃdhovikampi khiḍḍaṃ kīḷitvā nhatvā ca pivitvā ca paccuttaritvā yena kāmaṃ pakkameyya’nti. So taṃ udakarahadaṃ sahasā appaṭisaṅkhā pakkhandeyya. Tassetaṃ pāṭikaṅkhaṃ – ‘saṃsīdissati vā uplavissati vā’ti. Taṃ kissa hetu? Paritto, upāli, attabhāvo gambhīre gādhaṃ na vindati. Evamevaṃ kho, upāli, yo evaṃ vadeyya – ‘ahaṃ samādhiṃ alabhamāno araññavanapatthāni pantāni senāsanāni paṭisevissāmī’ti, tassetaṃ pāṭikaṅkhaṃ – ‘saṃsīdissati vā uplavissati vā’ti. ‘‘Seyyathāpi, upāli, daharo kumāro mando uttānaseyyako sakena muttakarīsena kīḷati. Taṃ kiṃ maññasi, upāli, nanvāyaṃ kevalā paripūrā bālakhiḍḍā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Sa kho so, upāli, kumāro aparena samayena vuddhimanvāya indriyānaṃ paripākamanvāya yāni kānici kumārakānaṃ kīḷāpanakāni bhavanti, seyyathidaṃ – vaṅkakaṃ [vaṅkaṃ (sī. pī.)] ghaṭikaṃ mokkhacikaṃ ciṅgulakaṃ [piṅgulikaṃ (syā.), ciṅkulakaṃ (ka.)] pattāḷhakaṃ rathakaṃ dhanukaṃ, tehi kīḷati. Taṃ kiṃ maññasi, upāli, nanvāyaṃ khiḍḍā purimāya khiḍḍāya abhikkantatarā ca paṇītatarā cā’’ti? ‘‘Evaṃ, bhante’’. ‘‘Sa kho so, upāli, kumāro aparena samayena vuddhimanvāya indriyānaṃ paripākamanvāya pañcahi kāmaguṇehi samappito samaṅgibhūto paricāreti cakkhuviññeyyehi rūpehi iṭṭhehi kantehi manāpehi piyarūpehi kāmūpasaṃhitehi rajanīyehi, sotaviññeyyehi saddehi… ghānaviññeyyehi gandhehi… jivhāviññeyyehi rasehi… kāyaviññeyyehi phoṭṭhabbehi iṭṭhehi kantehi manāpehi piyarūpehi kāmūpasaṃhitehi rajanīyehi. Taṃ kiṃ maññasi, upāli, nanvāyaṃ khiḍḍā purimāhi khiḍḍāhi abhikkantatarā ca paṇītatarā cā’’ti? ‘‘Evaṃ, bhante’’. [dī. ni. 1.190; ma. ni. 2.233] ‘‘Idha kho pana vo [voti nipātamattaṃ (aṭṭha.)], upāli, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. ‘‘Taṃ dhammaṃ suṇāti gahapati vā gahapatiputto vā aññatarasmiṃ vā kule paccājāto. So taṃ dhammaṃ sutvā tathāgate saddhaṃ paṭilabhati. So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati – ‘sambādho gharāvāso rajāpatho, abbhokāso pabbajjā. Nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. ‘‘So aparena samayena appaṃ vā bhogakkhandhaṃ pahāya mahantaṃ vā bhogakkhandhaṃ pahāya appaṃ vā ñātiparivaṭṭaṃ pahāya mahantaṃ vā ñātiparivaṭṭaṃ pahāya kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati. ‘‘So evaṃ pabbajito samāno bhikkhūnaṃ sikkhāsājīvasamāpanno pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. ‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī; athenena sucibhūtena attanā viharati. ‘‘Abrahmacariyaṃ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā. ‘‘Musāvādaṃ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. ‘‘Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti, ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī; samaggakaraṇiṃ vācaṃ bhāsitā hoti. ‘‘Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā, tathārūpiṃ vācaṃ bhāsitā hoti. ‘‘Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. ‘‘So bījagāmabhūtagāmasamārambhā paṭivirato hoti. Ekabhattiko hoti rattūparato, virato vikālabhojanā. Naccagītavāditavisūkadassanā paṭivirato hoti, mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti, uccāsayanamahāsayanā paṭivirato hoti, jātarūparajatapaṭiggahaṇā paṭivirato hoti, āmakadhaññapaṭiggahaṇā paṭivirato hoti, āmakamaṃsapaṭiggahaṇā paṭivirato hoti, itthikumārikapaṭiggahaṇā paṭivirato hoti, dāsidāsapaṭiggahaṇā paṭivirato hoti, ajeḷakapaṭiggahaṇā paṭivirato hoti, kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti, hatthigavassavaḷavapaṭiggahaṇā paṭivirato hoti, khettavatthupaṭiggahaṇā paṭivirato hoti, dūteyyapahiṇagamanānuyogā paṭivirato hoti, kayavikkayā paṭivirato hoti, tulākūṭakaṃsakūṭamānakūṭā paṭivirato hoti, ukkoṭanavañcananikatisāciyogā paṭivirato hoti, chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti. ‘‘So santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. Yena yeneva pakkamati samādāyeva pakkamati, seyyathāpi nāma pakkhī sakuṇo yena yeneva ḍeti sapattabhārova ḍeti. Evamevaṃ bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. Yena yeneva pakkamati samādāyeva pakkamati. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṃ anavajjasukhaṃ paṭisaṃvedeti. ‘‘So cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati; rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. So iminā ariyena indriyasaṃvarena samannāgato ajjhattaṃ abyāsekasukhaṃ paṭisaṃvedeti. ‘‘So abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. ‘‘So iminā ca ariyena sīlakkhandhena samannāgato, iminā ca ariyena indriyasaṃvarena samannāgato, iminā ca ariyena satisampajaññe samannāgato vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. So araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. ‘‘So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti. Byāpādapadosaṃ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṃ parisodheti. Thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ vūpasantacitto, uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti. ‘‘So ime pañca nīvaraṇe pahāya cetaso upakkilese paññāya dubbalīkaraṇe, vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Taṃ kiṃ maññasi, upāli, ‘nanvāyaṃ vihāro purimehi vihārehi abhikkantataro ca paṇītataro cā’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Imampi kho, upāli, mama sāvakā attani dhammaṃ sampassamānā araññavanapatthāni pantāni senāsanāni paṭisevanti, no ca kho tāva anuppattasadatthā viharanti. ‘‘Puna caparaṃ, upāli, bhikkhu vitakkavicārānaṃ vūpasamā…pe… dutiyaṃ jhānaṃ upasampajja viharati. Taṃ kiṃ maññasi, upāli, ‘nanvāyaṃ vihāro purimehi vihārehi abhikkantataro ca paṇītataro cā’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Imampi kho, upāli, mama sāvakā attani dhammaṃ sampassamānā araññavanapatthāni pantāni senāsanāni paṭisevanti, no ca kho tāva anuppattasadatthā viharanti. ‘‘Puna caparaṃ, upāli, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. Taṃ kiṃ maññasi, upāli, ‘nanvāyaṃ vihāro purimehi vihārehi abhikkantataro ca paṇītataro cā’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Imampi kho, upāli, mama sāvakā attani dhammaṃ sampassamānā araññavanapatthāni pantāni senāsanāni paṭisevanti, no ca kho tāva anuppattasadatthā viharanti. ‘‘Puna caparaṃ, upāli, bhikkhu sukhassa ca pahānā…pe… catutthaṃ jhānaṃ…pe…. Puna caparaṃ, upāli, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Taṃ kiṃ maññasi, upāli, ‘nanvāyaṃ vihāro purimehi vihārehi abhikkantataro ca paṇītataro cā’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Imampi kho, upāli, mama sāvakā attani dhammaṃ sampassamānā araññavanapatthāni pantāni senāsanāni paṭisevanti, no ca kho tāva anuppattasadatthā viharanti. ‘‘Puna caparaṃ, upāli, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati…pe…. ‘‘Sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati…pe…. ‘‘Sabbaso ākiñcaññāyatanaṃ samatikkamma ‘santametaṃ paṇītameta’nti nevasaññānāsaññāyatanaṃ upasampajja viharati. Taṃ kiṃ maññasi, upāli, ‘nanvāyaṃ vihāro purimehi vihārehi abhikkantataro ca paṇītataro cā’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Imampi kho, upāli, mama sāvakā attani dhammaṃ sampassamānā araññavanapatthāni pantāni senāsanāni paṭisevanti, no ca kho tāva anuppattasadatthā viharanti. ‘‘Puna caparaṃ, upāli, bhikkhu sabbaso nevasaññānāsaññāyatanaṃ samatikkamma saññāvedayitanirodhaṃ upasampajja viharati; paññāya cassa disvā āsavā parikkhīṇā honti. Taṃ kiṃ maññasi, upāli, ‘nanvāyaṃ vihāro purimehi vihārehi abhikkantataro ca paṇītataro cā’’’ti? ‘‘Evaṃ, bhante’’. ‘‘Imampi kho, upāli, mama sāvakā attani dhammaṃ sampassamānā araññavanapatthāni pantāni senāsanāni paṭisevanti, anuppattasadatthā ca viharanti. Iṅgha tvaṃ, upāli, saṅghe viharāhi. Saṅghe te viharato phāsu bhavissatī’’ti. Navamaṃ.",
      "english": "Then, the Venerable Upāli approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the Venerable Upāli said to the Blessed One, \"Venerable Sir, I wish to resort to secluded abodes in forests and wilderness areas.\"\n\n\"Indeed, Upāli, secluded abodes in forests and wilderness areas are difficult to attain and sustain. Seclusion is difficult to practice, and difficult to take delight in. I believe that for a bhikkhu who has not attained concentration, the forests draw his mind to distraction. Indeed, Upāli, if anyone were to say, 'I will resort to secluded abodes in forests and wilderness areas without having attained concentration,' it is to be expected of him that he will either sink or float away.\"\n\n\"Just as, Upāli, there might be a great lake of water. Then, a lordly elephant, seven or seven-and-a-half cubits tall, might approach. It might think, 'Let me enter this lake and play, splashing water over my ears and over my back.' Having played, splashing water over its ears and over its back, having bathed and drunk, it might emerge and go wherever it wishes. So it would enter that lake and play, splashing water over its ears and over its back; having played, splashing water over its ears and over its back, having bathed and drunk, it would emerge and go wherever it wishes. Why is that? Because, Upāli, its large body finds firm footing in the deep.\"\n\n\"Then, a hare or a cat might approach. It might think, 'Who am I, and who is that lordly elephant! Let me enter this lake and play, splashing water over my ears and over my back; having played, splashing water over my ears and over my back, having bathed and drunk, I might emerge and go wherever I wish.' So it would rashly plunge into that lake without proper consideration. It is to be expected of it that it will either sink or float away. Why is that? Because, Upāli, its small body does not find firm footing in the deep. In the same way, Upāli, if anyone were to say, 'I will resort to secluded abodes in forests and wilderness areas without having attained concentration,' it is to be expected of him that he will either sink or float away.\"\n\n\"Just as, Upāli, a young, weak, infant lying on its back plays with its own urine and feces. What do you think, Upāli, is this not a complete and full childish game?\" \"Yes, Venerable Sir.\" \"Then, Upāli, that very child, later growing up and with his faculties maturing, plays with whatever toys children typically have, such as a toy plough, a spinning top, a toy measure, a toy windmill, a toy basket-sieve, a toy cart, a toy bow. What do you think, Upāli, is this game not more excellent and refined than the previous game?\" \"Yes, Venerable Sir.\" \"Then, Upāli, that very child, later growing up and with his faculties maturing, being endowed and integrated with the five strands of sensual pleasure, enjoys forms cognizable by the eye—desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; sounds cognizable by the ear—desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; odors cognizable by the nose—desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; tastes cognizable by the tongue—desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing; tactile objects cognizable by the body—desirable, agreeable, pleasing, lovely, connected with sensual desire, and enticing. What do you think, Upāli, is this game not more excellent and refined than the previous games?\" \"Yes, Venerable Sir.\"\n\n\"However, Upāli, in this world, a Tathāgata arises—an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, a Fortunate One, knower of the world, an unsurpassed leader of persons to be tamed, a teacher of devas and humans, the Awakened One, the Blessed One. He, having directly known and realized this world with its devas, Māras, and Brahmās, with its ascetics and brahmins, its rulers and people, proclaims it. He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, with its meaning and its letter, and he proclaims the utterly complete and purified holy life.\"\n\n\"A householder or a householder's son, or one born into some other family, hears that Dhamma. Having heard that Dhamma, he gains faith in the Tathāgata. Endowed with that gained faith, he reflects thus: 'The household life is confining, a path for dust and defilements; renunciation is open, unhindered space.'\"\n\nIt is not easy for one living in a household to lead a completely perfect, utterly pure, thoroughly polished holy life. How would it be if I were to shave off my hair and beard, put on saffron robes, and go forth from the household life into homelessness?\n\nSo, at a later time, having given up a small or large fortune, having given up a small or large circle of relatives, he shaves off his hair and beard, puts on saffron robes, and goes forth from the household life into homelessness.\n\nHaving thus gone forth, he abides by the training rules and way of life of monastics. Having abandoned the taking of life, he abstains from it. He lays aside rod and weapon. Conscientious and compassionate, he dwells with concern for the welfare of all living beings.\n\nHaving abandoned taking what is not given, he abstains from it. He takes only what is given, expecting what is given. He dwells with a self purified by honesty, without thievery.\n\nHaving abandoned unchaste conduct, he lives a chaste life. He dwells far off, abstaining from sexual intercourse, which is a worldly practice.\n\nHaving abandoned false speech, he abstains from it. He speaks truth, is truthful, trustworthy, reliable, and does not deceive the world.\n\nHaving abandoned divisive speech, he abstains from it. He does not repeat elsewhere what he has heard here to cause division among these people, nor does he repeat to these people what he has heard elsewhere to cause division among those people. Thus, he is a reconciler of those who are divided and an encourager of those who are united. He delights in concord, rejoices in concord, and finds joy in concord. He speaks words that promote harmony.\n\nHaving abandoned harsh speech, he abstains from it. He speaks words that are gentle, pleasing to the ear, affectionate, reaching the heart, courteous, cherished by many, and agreeable to many.\n\nHaving abandoned idle chatter, he abstains from it. He speaks at the proper time, speaks what is factual, speaks about the goal, speaks about the Dhamma, speaks about the Discipline. He speaks words that are profound, timely, accompanied by reasons, measured, and connected with the goal.\n\nHe abstains from harming seeds and plants. He eats only once a day, abstaining from food at night and from eating at improper times. He abstains from watching spectacles of dancing, singing, and music. He abstains from garlands, perfumes, and unguents; from adornments and beautification. He abstains from high and luxurious beds. He abstains from accepting gold and silver. He abstains from accepting raw grain. He abstains from accepting raw meat. He abstains from accepting women and girls. He abstains from accepting male and female slaves. He abstains from accepting goats and sheep. He abstains from accepting chickens and pigs. He abstains from accepting elephants, cattle, horses, and mares. He abstains from accepting fields and lands. He abstains from acting as a messenger or going on errands. He abstains from buying and selling. He abstains from cheating with scales, weights, and measures. He abstains from bribery, deception, and fraud. He abstains from mutilating, killing, binding, highway robbery, plunder, and violence.\n\nHe is content with robes to protect his body and almsfood to sustain his stomach. Wherever he goes, he goes taking only these with him, just as a bird, wherever it flies, flies with only its wings as its burden. In the same way, the bhikkhu is content with robes to protect his body and almsfood to sustain his stomach. Wherever he goes, he goes taking only these with him. Endowed with this noble aggregate of virtue, he experiences an inner blameless happiness.\n\nSeeing a form with the eye, he does not grasp at its general appearance or its specific details. Because covetousness and distress, evil unwholesome states, would flow in upon him if he were to dwell with the eye faculty unguarded, he practices for its restraint; he guards the eye faculty, he undertakes the restraint of the eye faculty. Hearing a sound with the ear... smelling an odor with the nose... tasting a flavor with the tongue... touching a tangible object with the body... cognizing a mental phenomenon with the mind, he does not grasp at its general appearance or its specific details. Because covetousness and distress, evil unwholesome states, would flow in upon him if he were to dwell with the mind faculty unguarded, he practices for its restraint; he guards the mind faculty, he undertakes the restraint of the mind faculty. Endowed with this noble restraint of the faculties, he experiences an inner untroubled happiness.\n\nHe acts with clear comprehension when going forward and returning. He acts with clear comprehension when looking ahead and looking around. He acts with clear comprehension when bending and stretching. He acts with clear comprehension when carrying his outer robe, bowl, and inner robe. He acts with clear comprehension when eating, drinking, chewing, and tasting. He acts with clear comprehension when defecating and urinating. He acts with clear comprehension when walking, standing, sitting, sleeping, waking, speaking, and remaining silent.\n\nEndowed with this noble aggregate of virtue, endowed with this noble restraint of the faculties, endowed with this noble mindfulness and clear comprehension, he resorts to a secluded dwelling: a wilderness, the root of a tree, a mountain, a ravine, a mountain cave, a charnel ground, a forest grove, the open air, a heap of straw. Having gone to a wilderness, or to the root of a tree, or to an empty hut, he sits down, folding his legs crosswise, setting his body erect, and establishing mindfulness in front of him.\n\nHe, having abandoned covetousness for the world, dwells with a mind free from covetousness; he purifies his mind from covetousness. Having abandoned ill-will and malice, he dwells with a mind free from ill-will, compassionate for the welfare of all living beings; he purifies his mind from ill-will and malice. Having abandoned sloth and torpor, he dwells free from sloth and torpor, perceiving light, mindful and clearly comprehending; he purifies his mind from sloth and torpor. Having abandoned restlessness and remorse, he dwells unagitated, with his mind inwardly peaceful; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having overcome doubt, without perplexity regarding wholesome states; he purifies his mind from doubt.\n\nHaving abandoned these five hindrances—defilements of the mind that weaken wisdom—quite secluded from sensual pleasures, secluded from unwholesome states, with directed thought and evaluation, born of seclusion, and filled with rapture and happiness, he enters and dwells in the first meditative absorption. “What do you think, Upāli, is not this dwelling more excellent and sublime than the previous dwellings?” “Indeed, venerable sir.” “But even this, Upāli, my disciples, observing the Dhamma within themselves, resort to remote forest dwellings, yet do not abide having attained their true goal.\n\nFurthermore, Upāli, with the stilling of directed thought and evaluation, with internal assurance and unification of mind, without directed thought and evaluation, born of concentration, and filled with rapture and happiness, a monk enters and dwells in the second meditative absorption. “What do you think, Upāli, is not this dwelling more excellent and sublime than the previous dwellings?” “Indeed, venerable sir.” “But even this, Upāli, my disciples, observing the Dhamma within themselves, resort to remote forest dwellings, yet do not abide having attained their true goal.\n\nFurthermore, Upāli, with the fading away of rapture, a monk dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body; he enters and dwells in the third meditative absorption, of which the Noble Ones declare: 'He dwells happily with equanimity and mindfulness.' “What do you think, Upāli, is not this dwelling more excellent and sublime than the previous dwellings?” “Indeed, venerable sir.” “But even this, Upāli, my disciples, observing the Dhamma within themselves, resort to remote forest dwellings, yet do not abide having attained their true goal.\n\nFurthermore, Upāli, with the abandonment of pleasure and pain, and with the previous disappearance of joy and sorrow, a monk enters and dwells in the fourth meditative absorption, which is neither painful nor pleasant and includes purification of mindfulness by equanimity. Furthermore, Upāli, with the complete transcendence of perceptions of form, with the disappearance of perceptions of sensory impingement, with non-attention to perceptions of diversity, perceiving that 'Space is infinite,' a monk enters and dwells in the sphere of infinite space. “What do you think, Upāli, is not this dwelling more excellent and sublime than the previous dwellings?” “Indeed, venerable sir.” “But even this, Upāli, my disciples, observing the Dhamma within themselves, resort to remote forest dwellings, yet do not abide having attained their true goal.\n\nFurthermore, Upāli, having completely transcended the sphere of infinite space, perceiving that 'Consciousness is infinite,' a monk enters and dwells in the sphere of infinite consciousness. Having completely transcended the sphere of infinite consciousness, perceiving that 'There is nothing,' he enters and dwells in the sphere of nothingness.\n\nHaving completely transcended the sphere of nothingness, perceiving that 'This is peaceful, this is sublime,' he enters and dwells in the sphere of neither perception nor non-perception. “What do you think, Upāli, is not this dwelling more excellent and sublime than the previous dwellings?” “Indeed, venerable sir.” “But even this, Upāli, my disciples, observing the Dhamma within themselves, resort to remote forest dwellings, yet do not abide having attained their true goal.\n\nFurthermore, Upāli, having completely transcended the sphere of neither perception nor non-perception, a monk enters and dwells in the cessation of perception and feeling; and having seen it with wisdom, his defilements are utterly destroyed. “What do you think, Upāli, is not this dwelling more excellent and sublime than the previous dwellings?” “Indeed, venerable sir.” “But even this, Upāli, my disciples, observing the Dhamma within themselves, resort to remote forest dwellings, and they abide having attained their true goal. Come, Upāli, you should live in the Sangha. Living in the Sangha will be comfortable for you.”",
      "sinhala": "එවිට පූජ්‍ය උපාළි භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි පූජ්‍ය උපාළි භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: ''භන්තේ, මම වනාන්තර හා කැලෑබද දුරස්ථ සේනාසන පරිහරණය කිරීමට කැමැත්තෙමි.''\n\n''උපාළි, වනාන්තර හා කැලෑබද දුරස්ථ සේනාසන සාර්ථකව පවත්වාගෙන යාම දුෂ්කරය. පවිවේකය දුෂ්කරය, එහි ඇලී සිටීමද දුෂ්කරය. සමාධිය නොලද භික්ෂුවකගේ සිත වනාන්තරයන් විසින් වෙනත් දේ වෙත ගෙන යනවා යැයි මම සිතමි. උපාළි, යමෙක් මෙසේ කියන්නේ නම්, ‘මම සමාධියක් නොලබාම වනාන්තර හා කැලෑබද දුරස්ථ සේනාසන පරිහරණය කරන්නෙමි’ කියා, ඔහුගෙන් මෙය අපේක්ෂා කළ හැකියි: ‘ඔහු ගිලී යන්නේය නැතහොත් (තෘෂ්ණාවෙන්) උඩට පාවී යන්නේය’ කියාය.''\n\n''උපාළි, යම් සේ මහත් වූ ජලාශයක් වේද; එවිට සත් රියන් හෝ අට රියන් උසැති හස්තිරාජයෙක් පැමිණෙන්නේය. ‘මම මේ ජලාශයට බැස කන් සෝදමින්ද, පිට සෝදමින්ද ක්‍රීඩා කරන්නෙමි. කන් සෝදමින් ක්‍රීඩා කොට, පිට සෝදමින් ක්‍රීඩා කොට, ස්නානය කොට, පානය කොට ආපසු ගොඩට පැමිණ කැමති තැනකට යන්නෙමි’යි ඌට සිතුණේය. ඌ ඒ ජලාශයට බැස කන් සෝදමින්ද, පිට සෝදමින්ද ක්‍රීඩා කරන්නේය; කන් සෝදමින් ක්‍රීඩා කොට, පිට සෝදමින් ක්‍රීඩා කොට, ස්නානය කොට, පානය කොට ආපසු ගොඩට පැමිණ කැමති තැනකට යන්නේය. ඊට හේතුව කුමක්ද? උපාළි, මහත් වූ ආත්මභාවයක් (ශරීරයක්) ඇති ඌට ගැඹුරෙහිදී පාදඩම් (තදින් සිටීමට තැනක්) හමු වේ.''\n\n''එවිට හාවෙක් හෝ බළලෙක් පැමිණෙන්නේය. ‘මම කවරෙක්ද, හස්තිරාජයා කවරෙක්ද! මම මේ ජලාශයට බැස කන් සෝදමින්ද, පිට සෝදමින්ද ක්‍රීඩා කරන්නෙමි. කන් සෝදමින් ක්‍රීඩා කොට, පිට සෝදමින් ක්‍රීඩා කොට, ස්නානය කොට, පානය කොට ආපසු ගොඩට පැමිණ කැමති තැනකට යන්නෙමි’යි ඊට සිතුණේය. එය ඒ ජලාශයට හදිසියේම, විමසා නොබලා පනින්නේය. එයින් මෙය අපේක්ෂා කළ හැකියි: ‘එය ගිලී යන්නේය නැතහොත් (වතුර මත්තේ) උඩට පාවී යන්නේය’ කියාය. ඊට හේතුව කුමක්ද? උපාළි, කුඩා වූ ආත්මභාවයක් ඇති ඊට ගැඹුරෙහිදී පාදඩම් නොහමු වේ. උපාළි, එමෙන්ම යමෙක් මෙසේ කියන්නේ නම්, ‘මම සමාධියක් නොලබාම වනාන්තර හා කැලෑබද දුරස්ථ සේනාසන පරිහරණය කරන්නෙමි’ කියා, ඔහුගෙන් මෙය අපේක්ෂා කළ හැකියි: ‘ඔහු ගිලී යන්නේය නැතහොත් උඩට පාවී යන්නේය’ කියාය.''\n\n''උපාළි, යම් සේ කුඩා වූ, දුර්වල වූ, නොපිට පෙරළී නිදා සිටින දරුවෙක් තමන්ගේ මූත්‍ර සහ පුරීෂයෙන් ක්‍රීඩා කරන්නේද? උපාළි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද, මේ සම්පූර්ණයෙන්ම ළදරු ක්‍රීඩාවක් නොවේද?'' ''එසේය, භන්තේ.'' ''උපාළි, ඒ දරුවා තවත් කලකට පසු වැඩී, ඉන්ද්‍රියයන්ගේ පරිපාකයට පැමිණ, කුඩා දරුවන්ගේ යම් සෙල්ලම් බඩු ඇත්ද, එනම්: වන්කකම්, ඝටිකම්, මොක්ඛචිකම්, චිංගුලකම්, පත්තාළ්හකම්, රථකම්, ධනුකම් වැනි සෙල්ලම් බඩු වලින් ක්‍රීඩා කරන්නේය. උපාළි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද, මේ ක්‍රීඩාව පෙර ක්‍රීඩාවට වඩා උසස් හා ප්‍රණීත නොවේද?'' ''එසේය, භන්තේ.'' ''උපාළි, ඒ දරුවා තවත් කලකට පසු වැඩී, ඉන්ද්‍රියයන්ගේ පරිපාකයට පැමිණ, ප්‍රිය, මනාප, කාමයට සම්බන්ධ වූ, රාගය උපදවන, ඇසින් දත හැකි රූප, කනින් දත හැකි ශබ්ද, නාසයෙන් දත හැකි ගන්ධ, දිවෙන් දත හැකි රස, කයෙන් දත හැකි ප්‍රිය, මනාප, කාමයට සම්බන්ධ වූ, රාගය උපදවන ස්පර්ශ යන පස්කම් ගුණයන්ගෙන් සමන්විතව හා යුක්තව ඒවා පරිහරණය කරයි. උපාළි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද, මේ ක්‍රීඩාව පෙර ක්‍රීඩාවන්ට වඩා උසස් හා ප්‍රණීත නොවේද?'' ''එසේය, භන්තේ.''\n\n''උපාළි, මෙහි තථාගතයන් වහන්සේ ලෝකයේ පහළ වන්නේය. උන්වහන්සේ අරහත් සම්මාසම්බුදු වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තරෝ පුරිසදම්මසාරථී වන සේක, සත්ථා දේවමනුස්සානං වන සේක, බුද්ධෝ භාග්‍යවතුන් වහන්සේ වන සේක. උන්වහන්සේ දෙවියන් සහිත වූ, මරුන් සහිත වූ, බ්‍රහ්මයන් සහිත වූ මේ ලෝකයද, ශ්‍රමණ-බ්‍රාහ්මණ ප්‍රජාව සහිත වූ, දෙව්-මිනිසුන් සහිත වූ ජනතාවද තෙමේම අභිඥා ඥානයෙන් සාක්ෂාත් කර ප්‍රකාශ කරයි. උන්වහන්සේ මුල මනෝහර වූ, මැද මනෝහර වූ, කෙළවර මනෝහර වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ ධර්මය දේශනා කරන සේක. තවද, උන්වහන්සේ පිරිපුන් වූ, පාරිශුද්ධ වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන සේක.''\n\n''ඒ ධර්මය ගෘහපතියෙක් හෝ ගෘහපති පුත්‍රයෙක් හෝ යම්කිසි කුලයක උපන් අයෙක් ශ්‍රවණය කරයි. ඔහු ඒ ධර්මය ශ්‍රවණය කිරීමෙන් තථාගතයන් වහන්සේ කෙරෙහි ශ්‍රද්ධාව ලබයි. ඔහු ඒ ශ්‍රද්ධා ලාභයෙන් යුක්තව මෙසේ මෙනෙහි කරයි: ‘ගෘහවාසය සම්බාධයකි, දුහුවිලි සහිත මාර්ගයකි; පැවිද්ද විවෘත අවකාශයකි.\n\nගිහි ජීවිතයක් ගතකරමින් නිරතුරුවම පරිපූර්ණ වූ, නිරතුරුවම පිරිසිදු වූ, ශංඛයක් මෙන් නොබිඳුණු බ්‍රහ්මචර්යාව පැවැත්වීම පහසු දෙයක් නොවේ. එසේ නම් මම කෙස් රැවුල් කපා, කහ සිවුරු හැඳ, ගිහි ගෙයින් නික්ම අගාරික බවට පැවිදි වුවහොත් ඉතා යෙහෙකැයි (ඔහු සිතයි).\n\nඔහු පසුව ස්වල්ප වූ හෝ බොහෝ වූ භෝග සම්පත් අත්හැර, ස්වල්ප වූ හෝ බොහෝ වූ ඥාති පිරිවර අත්හැර, කෙස් රැවුල් කපා, කහ සිවුරු හැඳ, ගිහි ගෙයින් නික්ම, අගාරික බවට පැවිදි වෙයි.\n\nමෙසේ පැවිදි වූ හෙතෙම භික්ෂූන්ගේ ශික්ෂානුකූල ජීවන වෘත්තියට එළඹී, ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වෙන් වූවෙක් වෙයි. ඔහු දඬු මුගුරු බහා තබා, ආයුධ බහා තබා, ලැජ්ජාශීලී වූවෙක්, කරුණාවෙන් යුක්ත වූවෙක් ලෙස සියලු ප්‍රාණීන්ගේ සහ සත්වයන්ගේ යහපතට අනුකම්පාවෙන් වාසය කරයි.\n\nඅදින්නාදානය අත්හැර, අදින්නාදානයෙන් වෙන් වූවෙක් වෙයි. දුන් දෙය පමණක් ගන්නේ, දුන් දෙයක් බලාපොරොත්තුවෙන් සිටින්නේ, සොරකම් නොකරන ලද, පිරිසිදු වූ සිතකින් යුක්තව ඔහු වාසය කරයි.\n\nඅබ්‍රහ්මචර්යාව අත්හැර, බ්‍රහ්මචාරී වෙයි. ඉතා ඈතින් හැසිරෙන්නේ, ග්‍රාම්‍ය ස්වභාවයක් වූ මෛථුන සේවනයෙන් වෙන් වූවෙක් වෙයි.\n\nමුසාවාදය අත්හැර, මුසාවාදයෙන් වෙන් වූවෙක් වෙයි. සත්‍යවාදී වෙයි, සත්‍යයට බැඳී සිටින්නේ වෙයි, ස්ථීර වෙයි, විශ්වාස කටයුතු වෙයි, ලෝකයා රවටන්නේ නොවේ.\n\nපිසුනු වචනය අත්හැර, පිසුනු වචනයෙන් වෙන් වූවෙක් වෙයි. මෙතනින් අසා මේ අය බිඳීම සඳහා අන් අයට නොකියයි, අන් තැනින් අසා මේ අය බිඳීම සඳහා මේ අයට නොකියයි. මෙසේ බිඳුණු අය සමගි කරවන්නෙක් වෙයි, සමගි වූවන් තවදුරටත් එකමුතු කරවන්නෙක් වෙයි. සමගියෙහි ඇලුණේ වෙයි, සමගියෙහි සතුටු වෙයි, සමගියෙන් ප්‍රීති වෙයි. සමගිය ඇති කරන වචන කථා කරන්නෙක් වෙයි.\n\nඵරුෂ වචනය අත්හැර, ඵරුෂ වචනයෙන් වෙන් වූවෙක් වෙයි. යම් වචනයක් මෘදුද, කනට සුවයක්ද, ප්‍රිය මනාපද, හදවතට පිවිසෙන්නේද, ශිෂ්ටද, බොහෝ දෙනාට ප්‍රියද, බොහෝ දෙනාට සිත් ගන්නා සුළුද, එවැනි වචන කථා කරන්නෙක් වෙයි.\n\nසම්ඵප්පලාපය අත්හැර, සම්ඵප්පලාපයෙන් වෙන් වූවෙක් වෙයි. කළට කියන්නේ වෙයි, සත්‍යයට අනුකූලව කියන්නේ වෙයි, අර්ථයෙන් යුක්තව කියන්නේ වෙයි, ධර්මයට අනුකූලව කියන්නේ වෙයි, විනයට අනුකූලව කියන්නේ වෙයි. කළට අනුව, නිදසුන් සහිතව, සීමා සහිතව, අර්ථයෙන් යුක්තව නිධානයක් බඳු වචන කථා කරන්නෙක් වෙයි.\n\nඔහු බීජග්‍රාම සහ භූතග්‍රාම විනාශ කිරීමෙන් වැළකී සිටින්නේ වෙයි. එක වේලක් වළඳන්නේ වෙයි, රාත්‍රියෙහි වැළකුණේ වෙයි, විකාල භෝජනයෙන් වෙන් වූවෙක් වෙයි. නැටුම්, ගීත, වාදන සහ විෂම දර්ශන නැරඹීමෙන් වෙන් වූවෙක් වෙයි. මල් මාලා, සුවඳ විලවුන්, ආලේපන, පැළඳීම්, සැරසීම් සහ විසිතුරු කිරීම්වලින් වෙන් වූවෙක් වෙයි. උසස් අසුන් සහ මහා අසුන් පරිහරණයෙන් වෙන් වූවෙක් වෙයි. රන් රිදී පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. අමු ධාන්‍ය පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. අමු මස් පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. ස්ත්‍රීන් හා කුමරියන් පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. දාසි දාසයන් පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. එළුවන් සහ බැටළුවන් පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. කුකුළන් සහ ඌරන් පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. අලි, ගවයන්, අශ්වයන් සහ අශ්ව ධේනූන් පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. කෙත් සහ වතු පිළිගැනීමෙන් වෙන් වූවෙක් වෙයි. දූත කර්මාන්තයෙහි යෙදීමෙන් සහ ගමන් බිමන්වල යෙදීමෙන් වෙන් වූවෙක් වෙයි. මිල දී ගැනීම් හා විකිණීම්වලින් වෙන් වූවෙක් වෙයි. තරාදි වංචාවලින්, ලෝහ භාණ්ඩ වංචාවලින්, මැනීමේ වංචාවලින් වෙන් වූවෙක් වෙයි. අල්ලස් ගැනීම්, වංචා කිරීම්, ව්‍යාජ කටයුතුවලින් සහ කපටිකම්වලින් වෙන් වූවෙක් වෙයි. කැපීම්, මැරීම්, බැඳීම්, මංකොල්ලකෑම්, මහා මාර්ග කොල්ලකෑම් සහ බලහත්කාරකම්වලින් වෙන් වූවෙක් වෙයි.\n\nඔහු ශරීරය රැකගැනීමට ප්‍රමාණවත් සිවුරෙන්ද, කුස පිරවීමට ප්‍රමාණවත් පිණ්ඩපාතයෙන්ද සතුටු වෙයි. ඔහු යම් යම් තැනකට යන්නේද, ඒ ඒ තැනට තමන්ගේ දෙය පමණක් ගෙනම යයි. ඒ හරියට පියාපත් ඇති පක්ෂියෙක්, යම් යම් තැනකට පියාසර කරන්නේද, ඒ ඒ තැනට තමන්ගේ පියාපත් බර පමණක් ගෙනම පියාසර කරන්නාක් මෙනි. එලෙසම භික්ෂුව ශරීරය රැකගැනීමට ප්‍රමාණවත් සිවුරෙන්ද, කුස පිරවීමට ප්‍රමාණවත් පිණ්ඩපාතයෙන්ද සතුටු වෙයි. යම් යම් තැනකට යන්නේද, ඒ ඒ තැනට තමන්ගේ දෙය පමණක් ගෙනම යයි. ඔහු මේ ආර්ය ශීලස්කන්ධයෙන් යුක්තව, තමා තුළ කිසිවකට දොස් නොකිය හැකි සතුටක් අත්විඳියි.\n\nඔහු ඇසින් රූපයක් දැක, නිමිති නොගන්නේ වෙයි, අනුබ්‍යංජන නොගන්නේ වෙයි. යම් කාරණයක් නිසා ඔහුගේ ඇස අසංවරව වාසය කරන්නේ නම්, ලෝභය, ද්වේෂය වැනි පව්කාර අකුසල ධර්මයන් ඔහුට ඇතුල් වීමට ඉඩ තිබේ. ඒ නිසා ඔහු ඒ සංවරය පිණිස පිළිපදී; ඇස ආරක්ෂා කරයි, ඇසෙහි සංවරය ඇති කර ගනී. කනින් ශබ්දයක් අසා, නිමිති නොගන්නේ වෙයි, අනුබ්‍යංජන නොගන්නේ වෙයි. යම් කාරණයක් නිසා ඔහුගේ කන අසංවරව වාසය කරන්නේ නම්, ලෝභය, ද්වේෂය වැනි පව්කාර අකුසල ධර්මයන් ඔහුට ඇතුල් වීමට ඉඩ තිබේ. ඒ නිසා ඔහු ඒ සංවරය පිණිස පිළිපදී; කන ආරක්ෂා කරයි, කනෙහි සංවරය ඇති කර ගනී. නාසයෙන් ගඳ සුවඳක් ආඝ්‍රාණය කොට, නිමිති නොගන්නේ වෙයි, අනුබ්‍යංජන නොගන්නේ වෙයි. යම් කාරණයක් නිසා ඔහුගේ නාසය අසංවරව වාසය කරන්නේ නම්, ලෝභය, ද්වේෂය වැනි පව්කාර අකුසල ධර්මයන් ඔහුට ඇතුල් වීමට ඉඩ තිබේ. ඒ නිසා ඔහු ඒ සංවරය පිණිස පිළිපදී; නාසය ආරක්ෂා කරයි, නාසයෙහි සංවරය ඇති කර ගනී. දිවෙන් රසයක් විඳ, නිමිති නොගන්නේ වෙයි, අනුබ්‍යංජන නොගන්නේ වෙයි. යම් කාරණයක් නිසා ඔහුගේ දිව අසංවරව වාසය කරන්නේ නම්, ලෝභය, ද්වේෂය වැනි පව්කාර අකුසල ධර්මයන් ඔහුට ඇතුල් වීමට ඉඩ තිබේ. ඒ නිසා ඔහු ඒ සංවරය පිණිස පිළිපදී; දිව ආරක්ෂා කරයි, දිවෙහි සංවරය ඇති කර ගනී. කයින් ස්පර්ශයක් ස්පර්ශ කොට, නිමිති නොගන්නේ වෙයි, අනුබ්‍යංජන නොගන්නේ වෙයි. යම් කාරණයක් නිසා ඔහුගේ කය අසංවරව වාසය කරන්නේ නම්, ලෝභය, ද්වේෂය වැනි පව්කාර අකුසල ධර්මයන් ඔහුට ඇතුල් වීමට ඉඩ තිබේ. ඒ නිසා ඔහු ඒ සංවරය පිණිස පිළිපදී; කය ආරක්ෂා කරයි, කයෙහි සංවරය ඇති කර ගනී. මනසින් ධර්මයක් (සිතට අරමුණක්) දැනගෙන, නිමිති නොගන්නේ වෙයි, අනුබ්‍යංජන නොගන්නේ වෙයි. යම් කාරණයක් නිසා ඔහුගේ මනස අසංවරව වාසය කරන්නේ නම්, ලෝභය, ද්වේෂය වැනි පව්කාර අකුසල ධර්මයන් ඔහුට ඇතුල් වීමට ඉඩ තිබේ. ඒ නිසා ඔහු ඒ සංවරය පිණිස පිළිපදී; මනස ආරක්ෂා කරයි, මනසෙහි සංවරය ඇති කර ගනී. ඔහු මේ ආර්ය ඉන්ද්‍රිය සංවරයෙන් යුක්තව, තමා තුළ කිසිදු පීඩාවක් නොමැති සතුටක් අත්විඳියි.\n\nඔහු ඉදිරියට යනවිටත්, ආපසු එනවිටත්, සිහි නුවණින් යුක්තව කටයුතු කරන්නෙක් වෙයි. ඉදිරිය බලනවිටත්, වටපිට බලනවිටත්, සිහි නුවණින් යුක්තව කටයුතු කරන්නෙක් වෙයි. (අත පය) හැකිලීමේදීත්, දිගහැරීමේදීත්, සිහි නුවණින් යුක්තව කටයුතු කරන්නෙක් වෙයි. සඟළ සිවුර, පාත්‍රය සහ අනිත් සිවුරු දැරීමේදීත්, සිහි නුවණින් යුක්තව කටයුතු කරන්නෙක් වෙයි. අනුභව කිරීමේදීත්, පානය කිරීමේදීත්, සැපීමේදීත්, රස විඳීමේදීත්, සිහි නුවණින් යුක්තව කටයුතු කරන්නෙක් වෙයි. මහා මල පහකිරීමේදීත්, මුත්‍ර පහකිරීමේදීත්, සිහි නුවණින් යුක්තව කටයුතු කරන්නෙක් වෙයි. යන විටත්, සිටින විටත්, හිඳින විටත්, නිදන විටත්, පිබිදී සිටින විටත්, කථා කරන විටත්, නිශ්ශබ්දව සිටින විටත්, සිහි නුවණින් යුක්තව කටයුතු කරන්නෙක් වෙයි.\n\nඒ භික්ෂුව මේ ආර්ය ශීලස්කන්ධයෙන් යුක්තව, මේ ආර්ය ඉන්ද්‍රිය සංවරයෙන් යුක්තව, මේ ආර්ය සති සම්පජඤ්ඤයෙන් යුක්තව, වනගත ස්ථාන, රුක්මුල්, පර්වත, කඳුකර, ගිරිගුහා, සුසාන, වනාන්තර, එළිමහන් තැන්, පිදුරු ගොඩවල් වැනි විවේකී සේනාසනවලට පැමිණේ. ඔහු වනගතව හෝ රුක්මුලක හෝ ශූන්‍යාගාරයකට ගොස් පලක් බැඳ, කය ඍජුව තබා, සිහිය මනාකොට පිහිටුවා වැඩ සිටී.\n\nඔහු ලෝකයේ ඇති අභිධ්‍යාව (තණ්හාව) ප්‍රහාණය කර, අභිධ්‍යාවෙන් තොර සිතින් වාසය කරයි. අභිධ්‍යාවෙන් තම සිත පිරිසිදු කරයි. ව්‍යාපාද දෝෂය (ක්‍රෝධය) ප්‍රහාණය කර, ව්‍යාපාදයෙන් තොර සිතින්, සියලු සත්ත්වයන්ගේ හිතසුව පතමින් වාසය කරයි. ව්‍යාපාද දෝෂයෙන් තම සිත පිරිසිදු කරයි. ථීනමිද්ධය (අලසකම හා නින්ද) ප්‍රහාණය කර, ථීනමිද්ධයෙන් තොරව, ආලෝක සංඥාවෙන් යුක්තව, සිහි නුවණින් යුක්තව වාසය කරයි. ථීනමිද්ධයෙන් තම සිත පිරිසිදු කරයි. උද්ධච්ච කුක්කුච්චය (උද්දච්චකම හා පසුතැවීම) ප්‍රහාණය කර, උද්දච්ච නොවී, අභ්‍යන්තරයෙන් සන්සුන් වූ සිතින් වාසය කරයි. උද්ධච්ච කුක්කුච්චයෙන් තම සිත පිරිසිදු කරයි. විචිකිච්ඡාව (සැකය) ප්‍රහාණය කර, සැකයෙන් එතෙර වී, කුසල ධර්මයන් පිළිබඳව අවිචිකිච්ඡාවෙන් යුක්තව වාසය කරයි. විචිකිච්ඡාවෙන් තම සිත පිරිසිදු කරයි.\n\nඒ භික්ෂුව ප්‍රඥාව දුර්වල කරන, සිතේ කෙලෙස් වන මේ පංච නීවරණ සම්පූර්ණයෙන්ම ප්‍රහාණය කර, කාමයන්ගෙන් ඉතා වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිත, විචාර සහිත, විවේකයෙන් හටගත් ප්‍රීති සුඛය ඇති ප්‍රථම ධ්‍යානයට පැමිණ වාසය කරයි. උපාලි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මේ විහරණය පෙර විහරණවලට වඩා උසස් නොවේද, ප්‍රණීත නොවේද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “උපාලි, මාගේ ශ්‍රාවකයෝ තමන් තුළ ධර්මය මනාව දකිමින්, වනාන්තරවලට, දුෂ්කර සේනාසනවලට පැමිණ වාසය කරති. එහෙත් ඔවුන් තවම සැබෑ අරමුණට පැමිණ නැත.\n\nපසුවද උපාලි, භික්ෂුව විතර්ක විචාරයන්ගේ සංසිඳීමෙන්, තමා තුළ පැහැදීම ඇති, සිතේ එකඟ බව ඇති, විතර්ක රහිත, විචාර රහිත, සමාධියෙන් හටගත් ප්‍රීති සුඛය ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. උපාලි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මේ විහරණය පෙර විහරණවලට වඩා උසස් නොවේද, ප්‍රණීත නොවේද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “උපාලි, මාගේ ශ්‍රාවකයෝ තමන් තුළ ධර්මය මනාව දකිමින්, වනාන්තරවලට, දුෂ්කර සේනාසනවලට පැමිණ වාසය කරති. එහෙත් ඔවුන් තවම සැබෑ අරමුණට පැමිණ නැත.\n\nපසුවද උපාලි, භික්ෂුව ප්‍රීතිය ද විරාග කිරීමෙන්, උපේක්ෂාවෙන් යුක්තව, සිහි නුවණින් යුක්තව, කායික සැප විඳිමින්, ‘උපේක්ෂාවෙන් යුක්තව සිහි ඇතිව සැප විහරණයෙන් වාසය කරයි’ යැයි ආර්යයන් විසින් ප්‍රකාශ කරනු ලබන තුන්වෙනි ධ්‍යානයට පැමිණ වාසය කරයි. උපාලි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මේ විහරණය පෙර විහරණවලට වඩා උසස් නොවේද, ප්‍රණීත නොවේද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “උපාලි, මාගේ ශ්‍රාවකයෝ තමන් තුළ ධර්මය මනාව දකිමින්, වනාන්තරවලට, දුෂ්කර සේනාසනවලට පැමිණ වාසය කරති. එහෙත් ඔවුන් තවම සැබෑ අරමුණට පැමිණ නැත.\n\nපසුවද උපාලි, භික්ෂුව සැපය ද ප්‍රහාණය කිරීමෙන්, දුක ද ප්‍රහාණය කිරීමෙන්, පෙර පැවැති සෝමනස්ස දෝමනස්සයන්ගේ අතුරුදහන් වීමෙන්, දුක් රහිත, සැප රහිත, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වෙනි ධ්‍යානයට පැමිණ වාසය කරයි. පසුවද උපාලි, භික්ෂුව සියලු රූප සංඥාවන් සම්පූර්ණයෙන්ම අතික්‍රමණය කිරීමෙන්, ප්‍රතිඝ සංඥාවන් අතුරුදහන් වීමෙන්, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, ‘ආකාශය අනන්තය’ යනුවෙන් ආකාශානන්ත්‍යායතනයට පැමිණ වාසය කරයි. උපාලි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මේ විහරණය පෙර විහරණවලට වඩා උසස් නොවේද, ප්‍රණීත නොවේද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “උපාලි, මාගේ ශ්‍රාවකයෝ තමන් තුළ ධර්මය මනාව දකිමින්, වනාන්තරවලට, දුෂ්කර සේනාසනවලට පැමිණ වාසය කරති. එහෙත් ඔවුන් තවම සැබෑ අරමුණට පැමිණ නැත.\n\nපසුවද උපාලි, භික්ෂුව සියලු ආකාශානන්ත්‍යායතනය සම්පූර්ණයෙන්ම අතික්‍රමණය කර, ‘විඤ්ඤාණය අනන්තය’ යනුවෙන් විඥාණානන්ත්‍යායතනයට පැමිණ වාසය කරයි.\n\nපසුවද උපාලි, භික්ෂුව සියලු විඥාණානන්ත්‍යායතනය සම්පූර්ණයෙන්ම අතික්‍රමණය කර, ‘කිසිවක් නැතැයි’ යනුවෙන් ආකිංචන්‍යායතනයට පැමිණ වාසය කරයි.\n\nපසුවද උපාලි, භික්ෂුව සියලු ආකිංචන්‍යායතනය සම්පූර්ණයෙන්ම අතික්‍රමණය කර, ‘මෙය ශාන්තය, මෙය ප්‍රණීතය’ යනුවෙන් නේවසංඥානාසංඥායතනයට පැමිණ වාසය කරයි. උපාලි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මේ විහරණය පෙර විහරණවලට වඩා උසස් නොවේද, ප්‍රණීත නොවේද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “උපාලි, මාගේ ශ්‍රාවකයෝ තමන් තුළ ධර්මය මනාව දකිමින්, වනාන්තරවලට, දුෂ්කර සේනාසනවලට පැමිණ වාසය කරති. එහෙත් ඔවුන් තවම සැබෑ අරමුණට පැමිණ නැත.\n\nපසුවද උපාලි, භික්ෂුව සියලු නේවසංඥානාසංඥායතනය සම්පූර්ණයෙන්ම අතික්‍රමණය කර, සංඥා වේදයිත නිරෝධයට පැමිණ වාසය කරයි. ප්‍රඥාවෙන් දුටු ඔහුගේ ආශ්‍රවයෝ ක්ෂය වී යති. උපාලි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මේ විහරණය පෙර විහරණවලට වඩා උසස් නොවේද, ප්‍රණීත නොවේද?” “එසේය, භාග්‍යවතුන් වහන්ස.” “උපාලි, මාගේ ශ්‍රාවකයෝ තමන් තුළ ධර්මය මනාව දකිමින්, වනාන්තරවලට, දුෂ්කර සේනාසනවලට පැමිණ වාසය කරති. ඔවුහු සැබෑ අරමුණට පැමිණ වාසය කරති. එබැවින් උපාලි, ඔබ සංඝයා සමඟ වාසය කරන්න. සංඝයා සමඟ වාසය කිරීම ඔබට පහසුවක් වනු ඇත.”",
      "paliTitle": "Upālisuttaṃ"
    },
    {
      "number": 100,
      "pali": "‘‘Dasayime, bhikkhave, dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. Katame dasa? Rāgaṃ, dosaṃ, mohaṃ, kodhaṃ, upanāhaṃ, makkhaṃ, paḷāsaṃ, issaṃ, macchariyaṃ, mānaṃ – ime kho bhikkhave, dasa dhamme appahāya abhabbo arahattaṃ sacchikātuṃ. ‘‘Dasayime, bhikkhave, dhamme pahāya bhabbo arahattaṃ sacchikātuṃ. Katame dasa? Rāgaṃ, dosaṃ, mohaṃ, kodhaṃ, upanāhaṃ, makkhaṃ, paḷāsaṃ, issaṃ, macchariyaṃ, mānaṃ – ime kho, bhikkhave, dasa dhamme pahāya bhabbo arahattaṃ sacchikātu’’nti. Dasamaṃ. ",
      "english": "Monks, not having abandoned these ten qualities, one is incapable of realizing arahantship. Which ten? Greed, hatred, delusion, anger, resentment, disparagement, malicious rivalry, envy, avarice, and conceit – indeed, monks, not having abandoned these ten qualities, one is incapable of realizing arahantship.\n\nMonks, having abandoned these ten qualities, one is capable of realizing arahantship. Which ten? Greed, hatred, delusion, anger, resentment, disparagement, malicious rivalry, envy, avarice, and conceit – indeed, monks, having abandoned these ten qualities, one is capable of realizing arahantship.",
      "sinhala": "භික්‍ෂූනි, මේ දස ධර්මයන් අත්නොහැර අරහත්වය සාක්‍ෂාත් කිරීමට නොහැකිය. කවර දසයක්ද? රාගය, ද්වේෂය, මෝහය, ක‍්‍රෝධය, උපනාහය, මක්ඛය, පලාසය, ඉස්සා, මච්ඡරිය, මානය යන මේවාය. භික්‍ෂූනි, මේ දස ධර්මයන් අත්නොහැර අරහත්වය සාක්‍ෂාත් කිරීමට නොහැකිය.\n\nභික්‍ෂූනි, මේ දස ධර්මයන් අත්හැර අරහත්වය සාක්‍ෂාත් කිරීමට හැකිය. කවර දසයක්ද? රාගය, ද්වේෂය, මෝහය, ක‍්‍රෝධය, උපනාහය, මක්ඛය, පලාසය, ඉස්සා, මච්ඡරිය, මානය යන මේවාය. භික්‍ෂූනි, මේ දස ධර්මයන් අත්හැර අරහත්වය සාක්‍ෂාත් කිරීමට හැකිය. මේ දසවෙනි සූත්‍රයයි.",
      "paliTitle": "Abhabbasuttaṃ"
    },
    {
      "number": 3,
      "pali": "Tatiyapaṇṇāsakaṃ",
      "english": "The Third Fifties",
      "sinhala": "තුන්වැනි පණ්ණාසකය",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Upālivaggo pañcamo. Tassuddānaṃ – Kāmabhogī bhayaṃ diṭṭhi, vajjiyamāhituttiyā; Kokanudo āhuneyyo, thero upāli abhabboti. Dutiyapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}