{
  "id": "an10.21",
  "title": {
    "pali": "Karajakāyavaggo",
    "english": "The Chapter on the Karma-Born Body",
    "sinhala": "කර්මජකාය වග්ගය"
  },
  "sections": [
    {
      "number": 211,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu [natthettha pāṭhabhedo]. ‘‘Adinnādāyī hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti. ‘‘Kāmesu micchācārī hoti. Yā tā māturakkhitā piturakkhitā mātāpiturakkhitā bhāturakkhitā bhaginirakkhitā ñātirakkhitā gottarakkhitā dhammarakkhitā sasāmikā saparidaṇḍā antamaso mālāguḷaparikkhittāpi, tathārūpāsu cārittaṃ āpajjitā hoti. ‘‘Musāvādī hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘jānāmī’ti, jānaṃ vā āha ‘na jānāmī’ti, apassaṃ vā āha ‘passāmī’ti, passaṃ vā āha ‘na passāmī’ti. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti. ‘‘Pisuṇavāco hoti – ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā bhinnānaṃ vā anuppadātā vaggārāmo vaggarato vagganandī, vaggakaraṇiṃ vācaṃ bhāsitā hoti. ‘‘Pharusavāco hoti – yā sā vācā aṇḍakā kakkasā parakaṭukā parābhisajjanī kodhasāmantā asamādhisaṃvattanikā, tathārūpiṃ vācaṃ bhāsitā hoti. ‘‘Samphappalāpī hoti akālavādī abhūtavādī anatthavādī adhammavādī avinayavādī, anidhānavatiṃ vācaṃ bhāsitā hoti akālena anapadesaṃ apariyantavatiṃ anatthasaṃhitaṃ. ‘‘Abhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ abhijjhātā hoti – ‘aho vata yaṃ parassa taṃ mama assā’ti. ‘‘Byāpannacitto hoti paduṭṭhamanasaṅkappo – ‘ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesu’nti. ‘‘Micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati. ‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, na taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti. ‘‘Kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti. Yā tā māturakkhitā…pe… antamaso mālāguḷaparikkhittāpi, tathārūpāsu na cārittaṃ āpajjitā hoti. ‘‘Musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho – ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti. Iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti. ‘‘Pisuṇavācaṃ pahāya pisuṇāya vācāya paṭivirato hoti – na ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandī, samaggakaraṇiṃ vācaṃ bhāsitā hoti. ‘‘Pharusavācaṃ pahāya pharusāya vācāya paṭivirato hoti. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā, tathārūpiṃ vācaṃ bhāsitā hoti. ‘‘Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī, atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. ‘‘Anabhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ anabhijjhātā hoti – ‘aho vata yaṃ parassa taṃ mama assā’ti. ‘‘Abyāpannacitto hoti appaduṭṭhamanasaṅkappo – ‘ime sattā averā hontu abyāpajjā anīghā, sukhī attānaṃ pariharantū’ti. ‘‘Sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ, atthi hutaṃ, atthi sukaṭadukkaṭānaṃ kammānaṃ phalaṃ vipāko, atthi ayaṃ loko, atthi paro loko, atthi mātā, atthi pitā, atthi sattā opapātikā, atthi loke samaṇabrāhmaṇā sammaggatā sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Paṭhamaṃ.",
      "english": "Bhikkhus, one endowed with these ten qualities is deposited in hell just as if carried there. Which ten?\n\nHere, bhikkhus, a certain person is a killer of living beings, fierce, with bloody hands, intent on striking and harming, without compassion for any living creature.\n\nHe is one who takes what is not given. Whatever property or belongings of another, whether in the village or in the forest, he takes that which is not given, in the manner of a thief.\n\nHe engages in sexual misconduct. With those who are protected by their mother, protected by their father, protected by both mother and father, protected by a brother, protected by a sister, protected by relatives, protected by their clan, protected by the Dhamma, those who have a husband, those punishable by law, and even those garlanded for marriage, he engages in sexual activity.\n\nHe is a speaker of falsehoods. Having gone to an assembly, to a council, to a gathering of relatives, to a guild, or to a royal court, and being summoned as a witness and asked, ‘Come, good sir, tell what you know,’ he says ‘I know’ when he does not know, or says ‘I do not know’ when he knows, or says ‘I see’ when he does not see, or says ‘I do not see’ when he sees. Thus, for his own sake, or for the sake of another, or for the sake of some paltry material gain, he intentionally speaks a lie.\n\nHe is a slanderer. Having heard something here, he reports it there to cause a rift among these people; or having heard something there, he reports it here to cause a rift among those people. Thus he is a splitter of those who are united, or an encourager of those who are already divided; he delights in discord, enjoys discord, rejoices in discord, and speaks words that create discord.\n\nHe is a speaker of harsh words. Such speech is rough, harsh, hurtful to others, an insult to others, bordering on anger, and not conducive to concentration. He speaks such words.\n\nHe is a speaker of idle chatter. He speaks out of season, speaks what is not factual, speaks what is not beneficial, speaks against the Dhamma, speaks against the Vinaya. He speaks words that are without substance, at the wrong time, without good reason, without limit, and unbeneficial.\n\nHe is covetous. He covets the property and belongings of another, thinking, ‘Oh, if only what belongs to another were mine!’\n\nHe is malevolent in mind, with a corrupt intention, thinking, ‘May these beings be slaughtered, or bound, or destroyed, or perish, or may they not exist at all!’\n\nHe holds wrong view, a perverted outlook, thinking, ‘There is no giving, no offering, no sacrifice; there is no fruit or result of good and bad actions; there is no this world, no other world; there is no mother, no father; there are no spontaneously arisen beings; there are no recluses and brahmins in the world who are rightly gone, rightly practiced, and who, having realized this world and the other world for themselves through direct knowledge, proclaim it.’ Bhikkhus, one endowed with these ten qualities is deposited in hell just as if carried there.\n\nBhikkhus, one endowed with these ten qualities is deposited in heaven just as if carried there. Which ten?\n\nHere, bhikkhus, a certain person, having abandoned the taking of life, abstains from it. He has laid down the rod and the weapon, is conscientious, compassionate, and dwells with sympathy for the welfare of all living creatures.\n\nHaving abandoned the taking of what is not given, he abstains from it. Whatever property or belongings of another, whether in the village or in the forest, he does not take that which is not given, in the manner of a thief.\n\nHaving abandoned sexual misconduct, he abstains from it. With those who are protected by their mother, protected by their father, protected by both mother and father, protected by a brother, protected by a sister, protected by relatives, protected by their clan, protected by the Dhamma, those who have a husband, those punishable by law, and even those garlanded for marriage, he does not engage in sexual activity.\n\nHaving abandoned falsehood, he abstains from it. Having gone to an assembly, to a council, to a gathering of relatives, to a guild, or to a royal court, and being summoned as a witness and asked, ‘Come, good sir, tell what you know,’ he says ‘I do not know’ when he does not know, or says ‘I know’ when he knows, or says ‘I do not see’ when he does not see, or says ‘I see’ when he sees. Thus, for his own sake, or for the sake of another, or for the sake of some paltry material gain, he does not intentionally speak a lie.\n\nHaving abandoned slander, he abstains from divisive speech. Having heard something here, he does not report it there to cause a rift among these people; nor having heard something there, does he report it here to cause a rift among those people. Thus he is a reuniter of those who are divided, or an encourager of those who are united; he delights in harmony, enjoys harmony, rejoices in harmony, and speaks words that create harmony.\n\nHaving abandoned harsh speech, he abstains from it. Such speech is gentle, pleasing to the ear, affectionate, goes to the heart, is cultured, agreeable to many, and pleasing to many. He speaks such words.\n\nHaving abandoned idle chatter, he abstains from it. He speaks at the right time, speaks what is factual, speaks what is beneficial, speaks about the Dhamma, speaks about the Vinaya. He speaks words that are substantial, at the right time, with good reason, with limits, and beneficial.\n\nHe is not covetous. He does not covet the property and belongings of another, thinking, ‘Oh, if only what belongs to another were mine!’\n\nHe is benevolent in mind, with an uncorrupted intention, thinking, ‘May these beings be free from animosity, free from affliction, free from trouble, and may they live happily!’\n\nHe holds right view, an unperverted outlook, thinking, ‘There is giving, there is offering, there is sacrifice; there is fruit and result of good and bad actions; there is this world, there is another world; there is mother, there is father; there are spontaneously arisen beings; there are recluses and brahmins in the world who are rightly gone, rightly practiced, and who, having realized this world and the other world for themselves through direct knowledge, proclaim it.’ Bhikkhus, one endowed with these ten qualities is deposited in heaven just as if carried there.\n\nHe possesses right view, his vision is undistorted – he understands that there is what is given, there is what is offered, there is what is sacrificed; there is fruit and ripening of wholesome and unwholesome actions; there is this world, there is a world beyond; there is mother, there is father; there are spontaneously arisen beings; and there are renunciants and brahmins in the world who have gone on the right path and practiced rightly, who, having themselves directly known and realized this world and the world beyond, make them known to others. Monks, whoever is endowed with these ten qualities is, as if conveyed there, deposited directly into a heavenly realm.",
      "sinhala": "භික්ෂූනි, දස ධර්මයන්ගෙන් යුක්ත වූ පුද්ගලයා, හරියට ගෙනැවිත් දමන්නාක් මෙන්, නිරයට වැටෙයි. ඒ දස ධර්මයෝ කවරහුද? භික්ෂූනි, මේ ලෝකයේ සමහරෙක් ප්‍රාණඝාතක වෙයි, කුරිරු වෙයි, ලෙයින් අත් තවරා ගත් තැනැත්තෙක් වෙයි, පහර දීම්වල නියැලී සිටින්නෙක් වෙයි, සියලු සත්ත්වයන් කෙරෙහි දයාවෙන් තොර වෙයි.\n\nසොරකම් කරන තැනැත්තෙක් වෙයි. අනුන්ගේ යම් දෙයක් වේද, අනුන්ගේ යම් වස්තුවක් හෝ උපකරණයක් වේද, එය ගමක තිබුණත්, කැලයක තිබුණත්, අනුන් විසින් නොදෙන ලද දෙයක්, සොරකමක් ලෙස ගන්නේ වෙයි.\n\nකාමයන්හි වරදවා හැසිරෙන්නේ වෙයි. එනම්, මව විසින් රකින ලද, පියා විසින් රකින ලද, මව්පියන් විසින් රකින ලද, සහෝදරයා විසින් රකින ලද, සහෝදරිය විසින් රකින ලද, ඥාතීන් විසින් රකින ලද, ගෝත්‍රය විසින් රකින ලද, ධර්මය විසින් රකින ලද, ස්වාමිපුරුෂයකු සිටින, දඬුවම් ලැබිය හැකි, අවසානයේ මල්මාලාවකින් හෝ වට කරන ලද (විවාහයට නියමිත) යම් ස්ත්‍රීන් වේද, එබඳු ස්ත්‍රීන් සමඟ වැරදි හැසිරීම්වල යෙදෙන්නේ වෙයි.\n\nබොරු කියන තැනැත්තෙක් වෙයි. එනම්, සභාවකට ගියත්, පිරිසක් මැදට ගියත්, ඥාතීන් මැදට ගියත්, ගම්වැසියන් මැදට ගියත්, රාජකීයයන් මැදට ගියත්, සාක්ෂි විමසීමක් සඳහා ඉදිරිපත් කළ විට - ‘එම්බා පුරුෂය, නුඹ යමක් දන්නෙහිද, එය කියන්නැ’යි ඇසූ විට, නොදන්නා දෙය ‘මම දනිමි’යි කියයි, දන්නා දෙය ‘මම නොදනිමි’යි කියයි, නොදුටු දෙය ‘මම දකිමි’යි කියයි, දුටු දෙය ‘මම නොදකිමි’යි කියයි. මෙසේ තමන් වෙනුවෙන් හෝ අනුන් වෙනුවෙන් හෝ යම් සුළු ආමිසයක් (ලාභයක්) වෙනුවෙන් හෝ සිතාමතා බොරු කියන්නේ වෙයි.\n\nකේළාම් කියන තැනැත්තෙක් වෙයි. මෙතැනින් අසා අන් තැනක කියයි, මොවුන් බිඳවීම පිණිස; අන් තැනකින් අසා මෙතැනක කියයි, ඔවුන් බිඳවීම පිණිස. මෙසේ සමගි වූවන් බිඳවන්නේ, භේද වූවන් තව තවත් භේද කරන්නේ, කණ්ඩායම් වලට ඇලුම් කරන්නේ, කණ්ඩායම් වලට ප්‍රිය කරන්නේ, කණ්ඩායම් වලට සතුටු වන්නේ, කණ්ඩායම් බිඳවන වචන කතා කරන්නේ වෙයි.\n\nපරුෂ වචන කියන තැනැත්තෙක් වෙයි. එනම්, රළු වූ, කටුක වූ, අනුන්ට දුක් දෙන්නා වූ, අනුන් පෙළන්නා වූ, ක්‍රෝධයට සමීප වූ, සිතේ සමාධිය බිඳවන්නා වූ යම් වචන වේද, එබඳු වචන කතා කරන්නේ වෙයි.\n\nහිස් වචන කියන තැනැත්තෙක් වෙයි. නුසුදුසු වේලාවට කියන්නේ, අසත්‍යය කියන්නේ, අර්ථයක් නැති දේ කියන්නේ, ධර්මයට පටහැනි දේ කියන්නේ, විනයට පටහැනි දේ කියන්නේ වෙයි. නිධාන රහිත වූ, නුසුදුසු වේලාවට, නොගැලපෙන, සීමා රහිත වූ, අර්ථයක් නැති දේවලට සම්බන්ධ වචන කතා කරන්නේ වෙයි.\n\nඅනුන්ගේ දේට ආශා කරන තැනැත්තෙක් (අභිජ්ඣා සහගත) වෙයි. එනම්, අනුන්ගේ යම් වස්තුවක් හෝ උපකරණයක් වේද, එයට මෙසේ ආශා කරන්නේ වෙයි - ‘අනේ, අනුන්ගේ යමක් වේද, එය මට හිමි වේ නම්!’.\n\nද්වේෂ සහගත සිතක් ඇති, දුෂ්ට සිතුවිලි ඇති තැනැත්තෙක් වෙයි. ‘මේ සත්වයෝ මැරෙත්වා, බැඳිලා ඉඳිත්වා, විනාශ වෙත්වා, නැති වෙත්වා, නොසිටිත්වා’ යනුවෙන් සිතන්නේ වෙයි.\n\nවැරදි දැක්මක් ඇති, විපරීත දර්ශනයක් ඇති තැනැත්තෙක් වෙයි. එනම්: ‘දීමෙන් පලක් නැත, පූජා කිරීමෙන් පලක් නැත, පිදීමෙන් පලක් නැත, හොඳ නරක කර්මවල විපාකයක් නැත, මේ ලෝකය නැත, පරලෝකය නැත, මව නැත, පියා නැත, ඕපපාතික සත්වයෝ නැත, ලෝකයේ මේ ලෝකයත් පරලෝකයත් තමන්ගේම ඥානයෙන් අවබෝධ කරගෙන ප්‍රකාශ කරන යම් ශ්‍රමණ-බ්‍රාහ්මණයෝ වේද, ඔවුන් නැත’ යනුවෙන් දකින්නේ වෙයි. භික්ෂූනි, මේ දස ධර්මයන්ගෙන් යුක්ත වූ පුද්ගලයා හරියට ගෙනැවිත් දමන්නාක් මෙන්, නිරයට වැටෙයි.\n\nභික්ෂූනි, දස ධර්මයන්ගෙන් යුක්ත වූ පුද්ගලයා, හරියට ගෙනැවිත් දමන්නාක් මෙන්, ස්වර්ගයට වැටෙයි. ඒ දස ධර්මයෝ කවරහුද? භික්ෂූනි, මේ ලෝකයේ සමහරෙක් ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකී සිටින්නේ වෙයි. දඬුමුගුරු බහා තබා, ආයුධ බහා තබා, ලජ්ජාශීලී වී, දයාවෙන් යුතුව, සියලු සත්ත්වයන්ට හිතසුව පතමින්, අනුකම්පාවෙන් යුතුව වාසය කරන්නේ වෙයි.\n\nසොරකම අත්හැර, සොරකමෙන් වැළකී සිටින්නේ වෙයි. අනුන්ගේ යම් දෙයක් වේද, අනුන්ගේ යම් වස්තුවක් හෝ උපකරණයක් වේද, එය ගමක තිබුණත්, කැලයක තිබුණත්, අනුන් විසින් නොදෙන ලද දෙයක්, සොරකමක් ලෙස නොගන්නේ වෙයි.\n\nකාමයන්හි වරදවා හැසිරීම අත්හැර, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටින්නේ වෙයි. එනම්, මව විසින් රකින ලද, පියා විසින් රකින ලද, මව්පියන් විසින් රකින ලද, සහෝදරයා විසින් රකින ලද, සහෝදරිය විසින් රකින ලද, ඥාතීන් විසින් රකින ලද, ගෝත්‍රය විසින් රකින ලද, ධර්මය විසින් රකින ලද, ස්වාමිපුරුෂයකු සිටින, දඬුවම් ලැබිය හැකි, අවසානයේ මල්මාලාවකින් හෝ වට කරන ලද (විවාහයට නියමිත) යම් ස්ත්‍රීන් වේද, එබඳු ස්ත්‍රීන් සමඟ වැරදි හැසිරීම්වල නොයෙදෙන්නේ වෙයි.\n\nබොරු කීම අත්හැර, බොරු කීමෙන් වැළකී සිටින්නේ වෙයි. එනම්, සභාවකට ගියත්, පිරිසක් මැදට ගියත්, ඥාතීන් මැදට ගියත්, ගම්වැසියන් මැදට ගියත්, රාජකීයයන් මැදට ගියත්, සාක්ෂි විමසීමක් සඳහා ඉදිරිපත් කළ විට - ‘එම්බා පුරුෂය, නුඹ යමක් දන්නෙහිද, එය කියන්නැ’යි ඇසූ විට, නොදන්නා දෙය ‘මම නොදනිමි’යි කියයි, දන්නා දෙය ‘මම දනිමි’යි කියයි, නොදුටු දෙය ‘මම නොදකිමි’යි කියයි, දුටු දෙය ‘මම දකිමි’යි කියයි. මෙසේ තමන් වෙනුවෙන් හෝ අනුන් වෙනුවෙන් හෝ යම් සුළු ආමිසයක් (ලාභයක්) වෙනුවෙන් හෝ සිතාමතා බොරු නොකියන්නේ වෙයි.\n\nකේළාම් කීම අත්හැර, කේළාම් කීමෙන් වැළකී සිටින්නේ වෙයි. මෙතැනින් අසා අන් තැනක නොකියයි, මොවුන් බිඳවීම පිණිස; අන් තැනකින් අසා මෙතැනක නොකියයි, ඔවුන් බිඳවීම පිණිස. මෙසේ භේද වූවන් එකතු කරන්නේ, සමගි වූවන් තව තවත් සමගි කරන්නේ, සමගියට ඇලුම් කරන්නේ, සමගියට ප්‍රිය කරන්නේ, සමගියට සතුටු වන්නේ, සමගිය ඇති කරන වචන කතා කරන්නේ වෙයි.\n\nපරුෂ වචන කීම අත්හැර, පරුෂ වචන කීමෙන් වැළකී සිටින්නේ වෙයි. එනම්, මිහිරි වූ, කනට ප්‍රිය වූ, ප්‍රේමණීය වූ, සිත් ඇදගන්නා වූ, ගුණවන්ත වූ, බොහෝ දෙනාට ප්‍රිය වූ, බොහෝ දෙනාගේ සිත් ගන්නා වූ යම් වචන වේද, එබඳු වචන කතා කරන්නේ වෙයි.\n\nහිස් වචන කීම අත්හැර, හිස් වචන කීමෙන් වැළකී සිටින්නේ වෙයි. සුදුසු වේලාවට කියන්නේ, සත්‍යය කියන්නේ, අර්ථවත් දේ කියන්නේ, ධර්මය අනුව කියන්නේ, විනය අනුව කියන්නේ වෙයි. නිධාන සහිත වූ, සුදුසු වේලාවට, ගැලපෙන, සීමා සහිත වූ, අර්ථවත් දේවලට සම්බන්ධ වචන කතා කරන්නේ වෙයි.\n\nඅනුන්ගේ දේට ආශා නොකරන තැනැත්තෙක් (අනභිජ්ඣා සහගත) වෙයි. එනම්, අනුන්ගේ යම් වස්තුවක් හෝ උපකරණයක් වේද, එයට මෙසේ ආශා නොකරන්නේ වෙයි - ‘අනේ, අනුන්ගේ යමක් වේද, එය මට හිමි වේ නම්!’.\n\nද්වේෂ රහිත සිතක් ඇති, දුෂ්ට සිතුවිලි රහිත තැනැත්තෙක් වෙයි. ‘මේ සත්වයෝ වෛර රහිත වෙත්වා, පීඩා රහිත වෙත්වා, දුක් රහිත වෙත්වා, සැපසේ තමන් රැකගනිත්වා’ යනුවෙන් සිතන්නේ වෙයි.\n\nඔහු නිවැරදි දැක්මක් ඇත්තේ වේ, නොපෙරළෙන දැක්මක් ඇත්තේ වේ. එනම්: දීමෙන් ඵලයක් ඇත, පූජාවන්ගෙන් ඵලයක් ඇත, පිදීම්වලින් ඵලයක් ඇත, යහපත් වූද අයහපත් වූද කර්මයන්ට විපාක ඵලයක් ඇත, මේ ලෝකය ඇත, පරලොවක් ඇත, මවක් සිටී, පියෙක් සිටී, ඕපපාතික සත්වයන් සිටිති, ලෝකයෙහි මේ ලෝකයද පරලොවද තමන් විසින්ම විශේ‍ෂ ඥානයෙන් ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරන, නිවැරදි මඟට ගමන් කළ, නිවැරදි ප්‍රතිපදාවෙහි පිහිටි ශ්‍රමණ බ්‍රාහ්මණයෝ සිටිති යන දැක්මයි. මහණෙනි, මේ දස ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා, (යම්සේ) ගෙනැවිත් තැබුවාක් මෙන්, ස්වර්ගයට පැමිණෙන්නේය.",
      "paliTitle": "Paṭhamanirayasaggasuttaṃ"
    },
    {
      "number": 212,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu. ‘‘Adinnādāyī hoti… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti … samphappalāpī hoti… abhijjhālu hoti… byāpannacitto hoti… micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe… sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi dasahi? Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati. ‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato hoti… kāmesumicchācāraṃ pahāya kāmesumicchācārā paṭivirato hoti… musāvādaṃ pahāya musāvādā paṭivirato hoti… pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti… pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti… samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti… anabhijjhālu hoti… abyāpannacitto hoti… sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, endowed with ten qualities, one is similarly consigned to hell as if carried there and deposited. With which ten? Here, bhikkhus, someone is a slayer of living beings, fierce, with hands stained with blood, devoted to striking and killing, without compassion for any living being. He takes what is not given; engages in sexual misconduct; speaks falsely; speaks divisively; speaks harshly; engages in idle chatter; is covetous; is ill-willed; holds wrong view and has a perverted outlook, thinking: ‘There is no merit in giving, no merit in offering, no merit in gifts; there is no fruit or result of good and bad deeds; there is no this world, no other world; there is no mother, no father; there are no spontaneously arisen beings; there are no recluses and brahmins in the world who, having directly known and realized for themselves, proclaim this world and the other world.’ Bhikkhus, endowed with these ten qualities, one is similarly consigned to hell as if carried there and deposited.\n\nBhikkhus, endowed with ten qualities, one is similarly consigned to heaven as if carried there and deposited. With which ten? Here, bhikkhus, someone, having abandoned the destruction of life, refrains from the destruction of life; he lays aside rod and weapon, is conscientious, compassionate, and dwells with concern for the welfare of all living beings. Having abandoned taking what is not given, he refrains from taking what is not given; having abandoned sexual misconduct, he refrains from sexual misconduct; having abandoned false speech, he refrains from false speech; having abandoned divisive speech, he refrains from divisive speech; having abandoned harsh speech, he refrains from harsh speech; having abandoned idle chatter, he refrains from idle chatter; he is not covetous; he is not ill-willed; he holds right view and has an unperverted outlook, thinking: ‘There is merit in giving, there is merit in offering, there is merit in gifts; there is fruit and result of good and bad deeds; there is this world, there is another world; there is mother, there is father; there are spontaneously arisen beings; there are recluses and brahmins in the world who, having themselves directly known and realized, declare this world and the other world.’ Bhikkhus, endowed with these ten qualities, one is similarly consigned to heaven as if carried there and deposited.",
      "sinhala": "භික්ෂූනි, දස ධර්මයකින් යුක්ත වූ තැනැත්තා (තමා කළ ක්‍රියාවට අනුව) ගෙනැවිත් දමන ලද්දෙකු මෙන් නිරයට පත්වේ. ඒ කවර දස ධර්මයකින් ද? භික්ෂූනි, මෙහි ඇතැම් කෙනෙක් ප්‍රාණඝාතක වෙයි, කුරිරු වෙයි, ලේ තැවරුණු අත් ඇති වෙයි, පහර දීමෙහි හා හිංසා කිරීමෙහි යෙදී සිටියි, සියලු ප්‍රාණීන් කෙරෙහි දයාවෙන් තොර වෙයි. නොදුන් දෙය ගනී. කාමයන්හි වරදවා හැසිරෙයි. මුසාවාදී වෙයි. පිසුනු වචන කියයි. පරුෂ වචන කියයි. සම්ප‍්‍රලාප කියයි. අනුන්ගේ දේට ආසා කරයි. වෛරී සිත් ඇති වෙයි. 'දීමක් නැත, පුද පූජා නැත, කරන ලද යහපත් හෝ අයහපත් ක්‍රියාවල විපාක නැත, මේ ලෝකයක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ක්ෂණික උපතක් නැත, මේ ලෝකයත් පරලොවත් තමන් විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට ප්‍රකාශ කරන්නාවූ ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ ලෝකයෙහි නැත'යි මිත්‍යාදෘෂ්ටික වෙයි, විපරීත දර්ශනයෙන් යුක්ත වෙයි. භික්ෂූනි, මේ දස ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා (තමා කළ ක්‍රියාවට අනුව) ගෙනැවිත් දමන ලද්දෙකු මෙන් නිරයට පත්වේ.\n\nභික්ෂූනි, දස ධර්මයකින් යුක්ත වූ තැනැත්තා (තමා කළ ක්‍රියාවට අනුව) ගෙනැවිත් දමන ලද්දෙකු මෙන් ස්වර්ගයට පත්වේ. ඒ කවර දස ධර්මයකින් ද? භික්ෂූනි, මෙහි ඇතැම් කෙනෙක් ප්‍රාණඝාතය අතහැර ප්‍රාණඝාතයෙන් වැළකී සිටියි, දඬුමුගුරු බහා තැබූ, අවි ආයුධ බහා තැබූ, පව්කිරීමට ලජ්ජා ඇති, දයාවෙන් යුක්ත වූ, සියලු ප්‍රාණීන්ගේ හිත පිණිස අනුකම්පාවෙන් යුක්තව වාසය කරයි. අදත්තාදානය අතහැර අදත්තාදානයෙන් වැළකී සිටියි. කාමයන්හි මිත්‍යාචාරය අතහැර කාමයන්හි මිත්‍යාචාරයෙන් වැළකී සිටියි. මුසාවාදය අතහැර මුසාවාදයෙන් වැළකී සිටියි. පිසුනු වචන අතහැර පිසුනු වචනයෙන් වැළකී සිටියි. පරුෂ වචන අතහැර පරුෂ වචනයෙන් වැළකී සිටියි. සම්ප‍්‍රලාපය අතහැර සම්ප‍්‍රලාපයෙන් වැළකී සිටියි. අනුන්ගේ දේට ආසා නොකරයි. වෛරී සිත් නැති වෙයි. 'දීමක් ඇත, පුද පූජා ඇත, කරන ලද යහපත් හෝ අයහපත් ක්‍රියාවල විපාක ඇත, මේ ලෝකයක් ඇත, පරලොවක් ඇත, මවක් ඇත, පියෙක් ඇත, ක්ෂණික උපතක් ඇත, යම් ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ මේ ලෝකයද පරලෝකයද තමන් විසින්ම අභිඥාවෙන් සාක්ෂාත් කොට ප්‍රකාශ කෙරෙත්ද (එබඳු ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ වෙත්)'යි සම්මාදෘෂ්ටික වෙයි, විපරීත නොවන දර්ශනයෙන් යුක්ත වෙයි. භික්ෂූනි, මේ දස ධර්මයන්ගෙන් යුක්ත වූ තැනැත්තා (තමා කළ ක්‍රියාවට අනුව) ගෙනැවිත් දමන ලද්දෙකු මෙන් ස්වර්ගයට පත්වේ.",
      "paliTitle": "Dutiyanirayasaggasuttaṃ"
    },
    {
      "number": 213,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Pāṇātipātī hoti…pe… adinnādāyī hoti… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti… samphappalāpī hoti… abhijjhālu hoti… byāpannacitto hoti… micchādiṭṭhiko hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ niraye. ‘‘Dasahi, bhikkhave, dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ sagge. Katamehi dasahi? Pāṇātipātā paṭivirato hoti…pe… adinnādānā paṭivirato hoti… kāmesumicchācārā paṭivirato hoti… musāvādā paṭivirato hoti… pisuṇāya vācāya paṭivirato hoti… pharusāya vācāya paṭivirato hoti… samphappalāpā paṭivirato hoti… anabhijjhālu hoti… abyāpannacitto hoti… sammādiṭṭhiko hoti… imehi kho, bhikkhave, dasahi dhammehi samannāgato mātugāmo yathābhataṃ nikkhitto evaṃ sagge’’ti. Tatiyaṃ.",
      "english": "Monks, a woman endowed with these ten qualities is deposited into hell just as she is brought. Which ten? She kills living beings; she takes what is not given; she engages in sexual misconduct; she speaks falsely; she speaks divisively; she speaks harshly; she engages in idle chatter; she is covetous; she has a mind of ill-will; she has wrong view. Monks, a woman endowed with these ten qualities is deposited into hell just as she is brought.\n\nMonks, a woman endowed with these ten qualities is deposited into heaven just as she is brought. Which ten? She abstains from killing living beings; she abstains from taking what is not given; she abstains from sexual misconduct; she abstains from false speech; she abstains from divisive speech; she abstains from harsh speech; she abstains from idle chatter; she is not covetous; she has a mind free from ill-will; she has right view. Monks, a woman endowed with these ten qualities is deposited into heaven just as she is brought.",
      "sinhala": "මහණෙනි, දස ධර්මයකින් යුක්ත වූ ස්ත්‍රියක් ගෙන ගොස් දැමූවක් මෙන් නිරයට පත්වේ. කවර දසයකින්ද? ප්‍රාණඝාතක වේ, අදත්තාදායී වේ, කාමයන්හි වරදවා හැසිරෙයි, මුසාවාදී වේ, පිසුණු බස් දොඩයි, ඵරුෂ බස් දොඩයි, සම්ඵප්පලාපී වේ, අභිධ්‍යා බහුල වේ, ව්‍යාපාද සිත් ඇති වේ, මිථ්‍යාදෘෂ්ටික වේ. මහණෙනි, මේ දස ධර්මයකින් යුක්ත වූ ස්ත්‍රියක් ගෙන ගොස් දැමූවක් මෙන් නිරයට පත්වේ.\n\nමහණෙනි, දස ධර්මයකින් යුක්ත වූ ස්ත්‍රියක් ගෙන ගොස් දැමූවක් මෙන් ස්වර්ගයට පත්වේ. කවර දසයකින්ද? ප්‍රාණඝාතයෙන් වැළකී සිටියි, අදත්තාදානයෙන් වැළකී සිටියි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි, මුසාවාදයෙන් වැළකී සිටියි, පිසුණු වචනයෙන් වැළකී සිටියි, ඵරුෂ වචනයෙන් වැළකී සිටියි, සම්ඵප්පලාපයෙන් වැළකී සිටියි, අභිධ්‍යා රහිත වේ, ව්‍යාපාද රහිත සිත් ඇති වේ, සම්මාදෘෂ්ටික වේ. මහණෙනි, මේ දස ධර්මයකින් යුක්ත වූ ස්ත්‍රියක් ගෙන ගොස් දැමූවක් මෙන් ස්වර්ගයට පත්වේ.",
      "paliTitle": "Mātugāmasuttaṃ"
    },
    {
      "number": 214,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ niraye. Katamehi dasahi? Pāṇātipātinī hoti…pe… micchādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ niraye. ‘‘Dasahi, bhikkhave, dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ sagge. Katamehi dasahi? Pāṇātipātā paṭiviratā hoti…pe… sammādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā yathābhataṃ nikkhittā evaṃ sagge’’. Catutthaṃ.",
      "english": "Monks, a female lay follower endowed with ten qualities is deposited in hell, just as if she were brought and placed there. Which ten? She is one who takes life... she holds wrong view. Monks, a female lay follower endowed with these ten qualities is deposited in hell, just as if she were brought and placed there.\n\nMonks, a female lay follower endowed with ten qualities is deposited in heaven, just as if she were brought and placed there. Which ten? She abstains from taking life... she holds right view. Monks, a female lay follower endowed with these ten qualities is deposited in heaven, just as if she were brought and placed there.",
      "sinhala": "මහණෙනි, ධර්මයන් දසයකින් සමන්විත වූ උපාසිකාවක් යම් සේ ගෙන ගොස් බහා තැබුවාක් මෙන් නිරයට පැමිණෙයි. කවර දසයකින්ද? ප්‍රාණඝාතය කරන්නියක් වීම ආදී වශයෙන් මිත්‍යාදෘෂ්ටිකයෙක් වීම දක්වා වූ දස ධර්මයන්ගෙන් යුක්ත වීමෙනි. මහණෙනි, මේ දස ධර්මයන්ගෙන් සමන්විත වූ උපාසිකාවක් යම් සේ ගෙන ගොස් බහා තැබුවාක් මෙන් නිරයට පැමිණෙයි.\n\nමහණෙනි, ධර්මයන් දසයකින් සමන්විත වූ උපාසිකාවක් යම් සේ ගෙන ගොස් බහා තැබුවාක් මෙන් ස්වර්ගයට පැමිණෙයි. කවර දසයකින්ද? ප්‍රාණඝාතයෙන් වැළකුණියක් වීම ආදී වශයෙන් සම්මාදිට්ඨිකයෙක් වීම දක්වා වූ දස ධර්මයන්ගෙන් යුක්ත වීමෙනි. මහණෙනි, මේ දස ධර්මයන්ගෙන් සමන්විත වූ උපාසිකාවක් යම් සේ ගෙන ගොස් බහා තැබුවාක් මෙන් ස්වර්ගයට පැමිණෙයි.",
      "paliTitle": "Upāsikāsuttaṃ"
    },
    {
      "number": 215,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgatā upāsikā avisāradā agāraṃ ajjhāvasati. Katamehi dasahi? Pāṇātipātinī hoti… adinnādāyinī hoti… kāmesumicchācārinī hoti… musāvādinī hoti… pisuṇāvācā hoti… pharusavācā hoti… samphappalāpinī hoti… abhijjhālunī hoti… byāpannacittā hoti… micchādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā avisāradā agāraṃ ajjhāvasati. ‘‘Dasahi, bhikkhave, dhammehi samannāgatā upāsikā visāradā agāraṃ ajjhāvasati. Katamehi dasahi? Pāṇātipātā paṭiviratā hoti… adinnādānā paṭiviratā hoti… kāmesumicchācārā paṭiviratā hoti… musāvādā paṭiviratā hoti… pisuṇāya vācāya paṭiviratā hoti… pharusāya vācāya paṭiviratā hoti… samphappalāpā paṭiviratā hoti… anabhijjhālunī hoti… abyāpannacittā hoti… sammādiṭṭhikā hoti…. Imehi kho, bhikkhave, dasahi dhammehi samannāgatā upāsikā visāradā agāraṃ ajjhāvasatī’’ti. Pañcamaṃ.",
      "english": "Monks, a female lay follower endowed with ten qualities lives the household life without confidence. Which ten? She kills living beings, she takes what is not given, she engages in sexual misconduct, she speaks falsehoods, she speaks divisive speech, she speaks harsh speech, she speaks idle chatter, she is covetous, her mind is ill-willed, and she has wrong view. Monks, a female lay follower endowed with these ten qualities lives the household life without confidence.\n\nMonks, a female lay follower endowed with ten qualities lives the household life with confidence. Which ten? She abstains from killing living beings, she abstains from taking what is not given, she abstains from sexual misconduct, she abstains from false speech, she abstains from divisive speech, she abstains from harsh speech, she abstains from idle chatter, she is not covetous, her mind is not ill-willed, and she has right view. Monks, a female lay follower endowed with these ten qualities lives the household life with confidence.",
      "sinhala": "මහණෙනි, දස ධර්‍මයකින් සමන්විත වූ උපාසිකාවක් නිර්භීත නොවන ලෙස ගිහි ගෙයි වාසය කරයි. කවර දසයකින්ද? ප්‍රාණඝාතය කරන්නියක් වේ; අදත්තාදානය කරන්නියක් වේ; කාමයන්හි වරදවා හැසිරෙන්නියක් වේ; මුසාවාද කියන්නියක් වේ; පිසුණාවාචා ඇති තැනැත්තියක් වේ; ඵරුෂාවාචා ඇති තැනැත්තියක් වේ; සම්ඵප්ප්‍රලාප කියන්නියක් වේ; අභිජ්ඣාවෙන් යුක්ත තැනැත්තියක් වේ; ව්‍යාපාද සිත් ඇති තැනැත්තියක් වේ; මිථ්‍යාදෘෂ්ටික තැනැත්තියක් වේ. මහණෙනි, මේ දස ධර්‍මයන්ගෙන් සමන්විත වූ උපාසිකාවක් නිර්භීත නොවන ලෙස ගිහි ගෙයි වාසය කරයි.\n\nමහණෙනි, දස ධර්‍මයකින් සමන්විත වූ උපාසිකාවක් නිර්භීතව ගිහි ගෙයි වාසය කරයි. කවර දසයකින්ද? ප්‍රාණඝාතයෙන් වැළකුණියක් වේ; අදත්තාදානයෙන් වැළකුණියක් වේ; කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණියක් වේ; මුසාවාදයෙන් වැළකුණියක් වේ; පිසුණාවාචාවෙන් වැළකුණියක් වේ; ඵරුෂාවාචාවෙන් වැළකුණියක් වේ; සම්ඵප්ප්‍රලාපයෙන් වැළකුණියක් වේ; අභිජ්ඣාවෙන් තොර තැනැත්තියක් වේ; ව්‍යාපාද සිත් නැති තැනැත්තියක් වේ; සම්මාදිට්ඨික තැනැත්තියක් වේ. මහණෙනි, මේ දස ධර්‍මයන්ගෙන් සමන්විත වූ උපාසිකාවක් නිර්භීතව ගිහි ගෙයි වාසය කරයි.",
      "paliTitle": "Visāradasuttaṃ"
    },
    {
      "number": 216,
      "pali": "‘‘Saṃsappanīyapariyāyaṃ vo, bhikkhave, dhammapariyāyaṃ desessāmi. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamo ca, bhikkhave, saṃsappanīyapariyāyo dhammapariyāyo? Kammassakā, bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṃ kammaṃ karonti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavanti. ‘‘Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho, adayāpanno sabbapāṇabhūtesu. So saṃsappati kāyena, saṃsappati vācāya, saṃsappati manasā. Tassa jimhaṃ kāyakammaṃ hoti, jimhaṃ vacīkammaṃ, jimhaṃ manokammaṃ, jimhā gati, jimhupapatti. ‘‘Jimhagatikassa kho panāhaṃ, bhikkhave, jimhupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantadukkhā nirayā yā vā saṃsappajātikā tiracchānayoni. Katamā ca sā, bhikkhave, saṃsappajātikā tiracchānayoni? Ahi vicchikā satapadī nakulā biḷārā mūsikā ulūkā, ye vā panaññepi keci tiracchānayonikā sattā manusse disvā saṃsappanti. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi. ‘‘Idha pana, bhikkhave, ekacco adinnādāyī hoti…pe… kāmesumicchācārī hoti… musāvādī hoti… pisuṇavāco hoti… pharusavāco hoti… samphappalāpī hoti… abhijjhālu hoti… byāpannacitto hoti… micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe… sayaṃ abhiññā sacchikatvā pavedentī’ti. So saṃsappati kāyena, saṃsappati vācāya, saṃsappati manasā. Tassa jimhaṃ kāyakammaṃ hoti, jimhaṃ vacīkammaṃ, jimhaṃ manokammaṃ, jimhā gati, jimhupapatti. ‘‘Jimhagatikassa kho panāhaṃ, bhikkhave, jimhupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantadukkhā nirayā yā vā saṃsappajātikā tiracchānayoni. Katamā ca sā, bhikkhave, saṃsappajātikā tiracchānayoni? Ahi vicchikā satapadī nakulā biḷārā mūsikā ulūkā, ye vā panaññepi keci tiracchānayonikā sattā manusse disvā saṃsappanti. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti, yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi. Kammassakā, bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṃ kammaṃ karonti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavanti. ‘‘Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho, lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. So na saṃsappati kāyena, na saṃsappati vācāya, na saṃsappati manasā. Tassa uju kāyakammaṃ hoti, uju vacīkammaṃ, uju manokammaṃ, uju gati, ujupapatti. ‘‘Ujugatikassa kho panāhaṃ, bhikkhave, ujupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantasukhā saggā yāni vā pana tāni uccākulāni khattiyamahāsālakulāni vā brāhmaṇamahāsālakulāni vā gahapatimahāsālakulāni vā aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi. ‘‘Idha pana, bhikkhave, ekacco adinnādānaṃ pahāya adinnādānā paṭivirato hoti…pe… kāmesumicchācārā paṭivirato hoti… musāvādaṃ pahāya musāvādā paṭivirato hoti… pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti… pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti… samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti… anabhijjhālu hoti… abyāpannacitto hoti… sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. So na saṃsappati kāyena, na saṃsappati vācāya, na saṃsappati manasā. Tassa uju kāyakammaṃ hoti, uju vacīkammaṃ, uju manokammaṃ, uju gati, ujupapatti. ‘‘Ujugatikassa kho pana ahaṃ, bhikkhave, ujupapattikassa dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – ye vā ekantasukhā saggā yāni vā pana tāni uccākulāni khattiyamahāsālakulāni vā brāhmaṇamahāsālakulāni vā gahapatimahāsālakulāni vā aḍḍhāni mahaddhanāni mahābhogāni pahūtajātarūparajatāni pahūtavittūpakaraṇāni pahūtadhanadhaññāni. Iti kho, bhikkhave, bhūtā bhūtassa upapatti hoti. Yaṃ karoti tena upapajjati. Upapannamenaṃ phassā phusanti. Evamahaṃ, bhikkhave, ‘kammadāyādā sattā’ti vadāmi. ‘‘Kammassakā, bhikkhave, sattā kammadāyādā kammayonī kammabandhū kammapaṭisaraṇā, yaṃ kammaṃ karonti – kalyāṇaṃ vā pāpakaṃ vā – tassa dāyādā bhavanti. Ayaṃ kho so, bhikkhave, saṃsappanīyapariyāyo dhammapariyāyo’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, I will teach you the discourse on crooked ways. Listen to it, attend carefully; I will speak.”\n\n“Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One spoke thus:\n\n“And what, monks, is this discourse on crooked ways? Monks, beings are owners of their actions, heirs of their actions, born of their actions, related by their actions, and have their actions as their refuge. Whatever actions they perform—whether good or bad—of those they will be the heirs.\n\n“Here, monks, some individual is a killer of living beings, fierce, with blood-stained hands, intent on striking and harming, without compassion for all living beings. He acts crookedly with body, acts crookedly with speech, acts crookedly with mind. His bodily action is crooked, his verbal action is crooked, his mental action is crooked, his destination is crooked, his rebirth is crooked.\n\n“For one with a crooked destination and crooked rebirth, monks, I declare one of two destinations: either the entirely miserable hells, or the realm of 'creeping' animals. And what, monks, is that realm of 'creeping' animals? Snakes, scorpions, centipedes, mongooses, cats, mice, owls, or any other beings of the animal realm who, seeing humans, behave timidly or evasively. Thus, monks, there is a rebirth that corresponds to what one has done. What one does, by that one is reborn. Once reborn, it experiences contacts. Thus, monks, I say that beings are heirs of their actions.\n\n“Here again, monks, some individual is one who takes what is not given... engages in sexual misconduct... speaks falsely... speaks divisively... speaks harshly... engages in idle chatter... is covetous... has ill will... and holds wrong views, perceiving things wrongly, saying: ‘There is no value in giving... nor are there ascetics and brahmins who, having realized this world and the other for themselves through direct knowledge, declare it.’ He acts crookedly with body, acts crookedly with speech, acts crookedly with mind. His bodily action is crooked, his verbal action is crooked, his mental action is crooked, his destination is crooked, his rebirth is crooked.\n\n“For one with a crooked destination and crooked rebirth, monks, I declare one of two destinations: either the entirely miserable hells, or the realm of 'creeping' animals. And what, monks, is that realm of 'creeping' animals? Snakes, scorpions, centipedes, mongooses, cats, mice, owls, or any other beings of the animal realm who, seeing humans, behave timidly or evasively. Thus, monks, there is a rebirth that corresponds to what one has done; what one does, by that one is reborn. Once reborn, it experiences contacts. Thus, monks, I say that beings are heirs of their actions. Monks, beings are owners of their actions, heirs of their actions, born of their actions, related by their actions, and have their actions as their refuge. Whatever actions they perform—whether good or bad—of those they will be the heirs.\n\n“Here, monks, some individual, abandoning the taking of life, abstains from the taking of life; he has laid aside his rod and his weapon, is conscientious, full of compassion, and dwells with sympathy for the welfare of all living beings. He does not act crookedly with body, does not act crookedly with speech, does not act crookedly with mind. His bodily action is straight, his verbal action is straight, his mental action is straight, his destination is straight, his rebirth is straight.\n\n“For one with a straight destination and straight rebirth, monks, I declare one of two destinations: either the entirely blissful heavenly realms, or those high-status families—noble warrior families, brahmin wealthy families, or householder wealthy families—that are rich, with great wealth, with great possessions, with abundant gold and silver, with abundant resources and tools, with abundant grain and produce. Thus, monks, there is a rebirth that corresponds to what one has done. What one does, by that one is reborn. Once reborn, it experiences contacts. Thus, monks, I say that beings are heirs of their actions.\n\n“Here again, monks, some individual, abandoning the taking of what is not given, abstains from taking what is not given... abstains from sexual misconduct... abandoning false speech, abstains from false speech... abandoning divisive speech, abstains from divisive speech... abandoning harsh speech, abstains from harsh speech... abandoning idle chatter, abstains from idle chatter... is non-covetous... has no ill will... and holds right views, perceiving things rightly, saying: ‘There is value in giving... and there are ascetics and brahmins who, having realized this world and the other for themselves through direct knowledge, declare it.’ He does not act crookedly with body, does not act crookedly with speech, does not act crookedly with mind. His bodily action is straight, his verbal action is straight, his mental action is straight, his destination is straight, his rebirth is straight.\n\nMonks, for one whose path is straight and whose destiny is straight, I declare one of two destinations: either the heavens of unalloyed happiness, or those high noble families – the families of wealthy Khattiyas, or wealthy Brahmins, or wealthy householders – who are rich, with great wealth, with great possessions, with abundant gold and silver, with abundant resources and equipment, and with abundant grain and crops. Thus, monks, for that which has come to be, there is an arising of what has come to be. Whatever one does, by that one comes into being. Having come into being, contacts touch that one. Thus, monks, I declare: ‘Beings are heirs to their actions (kamma).’\n\nMonks, beings are owners of their actions, heirs to their actions, born of their actions, related by their actions, and supported by their actions. Whatever action they perform – whether good or bad – of that they will be the heirs. This, monks, is the discourse concerning the gradual unfolding, this is the discourse on the Dhamma.",
      "sinhala": "මහණෙනි, පිරිහෙන ස්වභාවය හෙවත් වංක ගමන පිළිබඳ ධර්ම පර්යායක් මම ඔබට දේශනා කරන්නෙමි. එය අසන්න, මනාකොට සිතට ගන්න; මම දේශනා කරන්නෙමි. “එසේය, භාග්‍යවතුන් වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක: “මහණෙනි, පිරිහෙන ස්වභාවය හෙවත් වංක ගමන පිළිබඳ ධර්ම පර්යාය කුමක්ද? මහණෙනි, සත්වයෝ කර්මය තමන්ගේම කොට ඇත්තෝය, කර්මයේ විපාකවලට උරුමකම් කියන්නෝය, කර්මයම උපන් ස්ථානය කොට ඇත්තෝය, කර්මයම නෑදෑයන් කොට ඇත්තෝය, කර්මයම පිහිට කොට ඇත්තෝය. යම් කර්මයක් කරත්ද – යහපත් හෝ අයහපත් හෝ – එහි විපාකවලට උරුමකම් කියන්නෝ වෙති.\n\nමහණෙනි, මෙහි ඇතැම් කෙනෙක් සතුන් මැරීමට පුරුදු වූ, දරුණු වූ, ලෙයින් තැවරුණු අත් ඇති, පහර දී මැරීමෙහි යෙදුණු, සියලු සත්වයන් කෙරෙහි දයාවක් නැත්තෙක් වෙයි. ඔහු ශරීරයෙන් වංකව හැසිරෙයි, වචනයෙන් වංකව හැසිරෙයි, සිතින් වංකව හැසිරෙයි. ඔහුට වංක වූ කායික කර්මයක් ඇත, වංක වූ වාචසික කර්මයක් ඇත, වංක වූ මානසික කර්මයක් ඇත, වංක වූ ගතියක් ඇත, වංක වූ උපපත්තියක් (භවයක්) ඇත.\n\nමහණෙනි, වංක ගතියක් ඇති, වංක උපපත්තියක් ඇති තැනැත්තාට ගති දෙකෙන් එක ගතියක් මම කියමි. ඒවා නම්, එක්කාන්තයෙන්ම දුක් සහිත වූ නිරය ලෝකයන් හෝ, කුදුගැසී හැසිරෙන ස්වභාවය ඇති තිරිසන් යෝනියයි. මහණෙනි, කුදුගැසී හැසිරෙන ස්වභාවය ඇති තිරිසන් යෝනිය යනු කවරේද? සර්පයෝ, වෘශ්චිකයෝ (ගෝනුස්සෝ), සතපාදියෝ (කන්නාහිරියෝ), මුගටියෝ, බළල්ලු, මීයෝ, බකමූණෝ යන මොවුහු හෝ, මිනිසුන් දැක කුදුගැසී සැරිසරන වෙනත් යම් තිරිසන් යෝනියකට අයත් සත්වයෝ හෝ වෙති. මහණෙනි, මේ ආකාරයෙන් යථා ස්වභාවයෙන් යුක්ත කර්මයට යථා ස්වභාවයෙන් යුක්ත උපපත්තියක් වෙයි. යම් කර්මයක් කෙරේද, එයින් උපතක් ලබයි. උපන්නාවූ ඔහුට ස්පර්ශයෝ ස්පර්ශ කරත්. මහණෙනි, මේ ආකාරයෙන් මම ‘සත්වයෝ කර්මයට උරුමකම් කියන්නෝය’යි කියමි.\n\nමහණෙනි, මෙහි ඇතැම් කෙනෙක් නොදුන් දෙය ගන්නේ වෙයි... කාමයන්හි වරදවා හැසිරෙන්නේ වෙයි... බොරු කියන්නේ වෙයි... කේලම් කියන්නේ වෙයි... පරුෂ වචන කියන්නේ වෙයි... නිෂ්ඵල දේ දොඩවන්නේ වෙයි... අනුන්ගේ දේට ආශා කරන්නේ වෙයි... ව්‍යාපාද සිත් ඇත්තේ වෙයි... ‘දීමක් නැත, පිදුම් නැත, පුද පූජා නැත, කරන ලද හොඳ නරක කර්මයන්ට ඵල විපාක නැත, මේ ලොවක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත, මේ ලොව හා පරලොව තමන් විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන ප්‍රකාශ කරන්නාවූ කිසිදු ශ්‍රමණ බ්‍රාහ්මණයෙක් මේ ලෝකයේ නැත’යි යන විපරීත දර්ශනයෙන් යුක්තව මිත්‍යාදෘෂ්ඨික වෙයි. ඔහු ශරීරයෙන් වංකව හැසිරෙයි, වචනයෙන් වංකව හැසිරෙයි, සිතින් වංකව හැසිරෙයි. ඔහුට වංක වූ කායික කර්මයක් ඇත, වංක වූ වාචසික කර්මයක් ඇත, වංක වූ මානසික කර්මයක් ඇත, වංක වූ ගතියක් ඇත, වංක වූ උපපත්තියක් (භවයක්) ඇත.\n\nමහණෙනි, වංක ගතියක් ඇති, වංක උපපත්තියක් ඇති තැනැත්තාට ගති දෙකෙන් එක ගතියක් මම කියමි. ඒවා නම්, එක්කාන්තයෙන්ම දුක් සහිත වූ නිරය ලෝකයන් හෝ, කුදුගැසී හැසිරෙන ස්වභාවය ඇති තිරිසන් යෝනියයි. මහණෙනි, කුදුගැසී හැසිරෙන ස්වභාවය ඇති තිරිසන් යෝනිය යනු කවරේද? සර්පයෝ, වෘශ්චිකයෝ (ගෝනුස්සෝ), සතපාදියෝ (කන්නාහිරියෝ), මුගටියෝ, බළල්ලු, මීයෝ, බකමූණෝ යන මොවුහු හෝ, මිනිසුන් දැක කුදුගැසී සැරිසරන වෙනත් යම් තිරිසන් යෝනියකට අයත් සත්වයෝ හෝ වෙති. මහණෙනි, මේ ආකාරයෙන් යථා ස්වභාවයෙන් යුක්ත කර්මයට යථා ස්වභාවයෙන් යුක්ත උපපත්තියක් වෙයි. යම් කර්මයක් කෙරේද, එයින් උපතක් ලබයි. උපන්නාවූ ඔහුට ස්පර්ශයෝ ස්පර්ශ කරත්. මහණෙනි, මේ ආකාරයෙන් මම ‘සත්වයෝ කර්මයට උරුමකම් කියන්නෝය’යි කියමි. මහණෙනි, සත්වයෝ කර්මය තමන්ගේම කොට ඇත්තෝය, කර්මයේ විපාකවලට උරුමකම් කියන්නෝය, කර්මයම උපන් ස්ථානය කොට ඇත්තෝය, කර්මයම නෑදෑයන් කොට ඇත්තෝය, කර්මයම පිහිට කොට ඇත්තෝය. යම් කර්මයක් කරත්ද – යහපත් හෝ අයහපත් හෝ – එහි විපාකවලට උරුමකම් කියන්නෝ වෙති.\n\nමහණෙනි, මෙහි ඇතැම් කෙනෙක් සතුන් මැරීම අත්හැර, සතුන් මැරීමෙන් වැළකුණේ වෙයි, දඬු මුගුරු බහා තැබූ, ආයුධ බහා තැබූ, ලැජ්ජාශීලී වූ, දයාවෙන් යුක්ත වූ, සියලු සත්වයන්ගේ හිත සුව කැමතිව වාසය කරයි. ඔහු ශරීරයෙන් වංකව හැසිරෙන්නේ නැත, වචනයෙන් වංකව හැසිරෙන්නේ නැත, සිතින් වංකව හැසිරෙන්නේ නැත. ඔහුට කෙළින් වූ කායික කර්මයක් ඇත, කෙළින් වූ වාචසික කර්මයක් ඇත, කෙළින් වූ මානසික කර්මයක් ඇත, කෙළින් වූ ගතියක් ඇත, කෙළින් වූ උපපත්තියක් (භවයක්) ඇත.\n\nමහණෙනි, කෙළින් වූ ගතියක් ඇති, කෙළින් වූ උපපත්තියක් ඇති තැනැත්තාට ගති දෙකෙන් එක ගතියක් මම කියමි. ඒවා නම්, එක්කාන්තයෙන්ම සැප සහිත වූ ස්වර්ග ලෝකයන් හෝ, නැතිනම් උසස් ක්ෂත්‍රිය මහසල් කුලයන් හෝ, බ්‍රාහ්මණ මහසල් කුලයන් හෝ, ගෘහපති මහසල් කුලයන් හෝ වෙති. ඒවා ධනවත් වූ, මහත් ධනයක් ඇති, මහත් භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ වස්තු උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති කුලයන්ය. මහණෙනි, මේ ආකාරයෙන් යථා ස්වභාවයෙන් යුක්ත කර්මයට යථා ස්වභාවයෙන් යුක්ත උපපත්තියක් වෙයි. යම් කර්මයක් කෙරේද, එයින් උපතක් ලබයි. උපන්නාවූ ඔහුට ස්පර්ශයෝ ස්පර්ශ කරත්. මහණෙනි, මේ ආකාරයෙන් මම ‘සත්වයෝ කර්මයට උරුමකම් කියන්නෝය’යි කියමි.\n\nමහණෙනි, මෙහි ඇතැම් කෙනෙක් නොදුන් දෙය ගැනීම අත්හැර, නොදුන් දෙය ගැනීමෙන් වැළකී සිටියි... කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි... බොරු කීම අත්හැර, බොරු කීමෙන් වැළකී සිටියි... කේලම් කීම අත්හැර, කේලම් කීමෙන් වැළකී සිටියි... පරුෂ වචන කීම අත්හැර, පරුෂ වචන කීමෙන් වැළකී සිටියි... නිෂ්ඵල දේ දොඩවීම අත්හැර, නිෂ්ඵල දේ දොඩවීමෙන් වැළකී සිටියි... අනුන්ගේ දේට ආශා නොකරන්නේ වෙයි... ව්‍යාපාද සිත් රහිත වෙයි... ‘දීමක් ඇත, පිදීමක් ඇත, පුද පූජා ඇත, කරන ලද හොඳ නරක කර්මයන්ට ඵල විපාක ඇත, මේ ලොවක් ඇත, පරලොවක් ඇත, මවක් ඇත, පියෙක් ඇත, ඕපපාතික සත්වයෝ ඇත, මේ ලොව හා පරලොව තමන් විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන ප්‍රකාශ කරන්නාවූ ශ්‍රමණ බ්‍රාහ්මණයෝ මේ ලෝකයේ සිටිත්’යි යන විපරීත නොවන දර්ශනයෙන් යුක්තව සම්මාදිට්ඨික වෙයි. ඔහු ශරීරයෙන් වංකව හැසිරෙන්නේ නැත, වචනයෙන් වංකව හැසිරෙන්නේ නැත, සිතින් වංකව හැසිරෙන්නේ නැත. ඔහුට කෙළින් වූ කායික කර්මයක් ඇත, කෙළින් වූ වාචසික කර්මයක් ඇත, කෙළින් වූ මානසික කර්මයක් ඇත, කෙළින් වූ ගතියක් ඇත, කෙළින් වූ උපපත්තියක් (භවයක්) ඇත.\n\nමහණෙනි, යමෙකුගේ ගමන් මාර්ගය ඍජු ද, යමෙකුගේ උපත ද ඍජු ද, එබඳු පුද්ගලයාට ඇති ගති දෙකින් එකක් මම දේශනා කරමි – එනම්, ඒකාන්තයෙන් සුඛිත වූ ස්වර්ග ලෝකයන්ට යාම හෝ, නැතහොත් උසස් කුලයන්ට – එනම්, මහත් ධනය ඇති, මහත් භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති උසස් ක්ෂත්‍රිය මහාසාර කුලයන්ට හෝ, බ්‍රාහ්මණ මහාසාර කුලයන්ට හෝ, ගෘහපති මහාසාර කුලයන්ට හෝ උපත ලැබීමයි. මහණෙනි, මෙසේ යම් දෙයක් සිදුවූයේ ද (යම් කර්මයක් කළේ ද), ඒ සිදුවූ දෙයට අනුරූපව උපතක් (විපාකයක්) සිදු වේ. යමක් කරයි ද, එයින් උපත ලබයි. උපත ලැබූ කල්හි ඔහුට ස්පර්ශයෝ ස්පර්ශ කරති. මහණෙනි, මෙලෙසින් මම 'සත්වයෝ කර්මයට දායාද වෙති'යි දේශනා කරමි.\n\nමහණෙනි, සත්වයෝ කර්මය තමන් සතු කොට ඇත්තෝ වෙති, කර්මයට දායාද වූවෝ වෙති, කර්මයෙන් හටගත්තෝ වෙති, කර්මයම නෑයෝ කොට ඇත්තෝ වෙති, කර්මයම පිහිට කොට ඇත්තෝ වෙති. යම් කර්මයක් කරත් ද – එය යහපත් වේවා, අයහපත් වේවා – එහි දායාද වූවෝ වෙති. මහණෙනි, මෙය කර්මයට අනුරූපව නිරන්තරයෙන් සැරිසැරීම පිළිබඳ ධර්ම පර්යායයි.",
      "paliTitle": "Saṃsappanīyasuttaṃ"
    },
    {
      "number": 217,
      "pali": "‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā [appaṭisaṃviditvā (sī. syā. pī.)] byantībhāvaṃ vadāmi. Tañca kho diṭṭheva dhamme upapajje vā [upapajjaṃ vā (ka.) a. ni. 6.63 passitabbaṃ, upapajja vā (ma. ni. 3.303)] apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi. ‘‘Tatra, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā [akusalaṃ sañcetanikaṃ dukkhudrayaṃ dukkhavipākaṃ (ka.)] hoti; catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti; tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti. ‘‘Kathañca, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti? Idha, bhikkhave, ekacco pāṇātipātī hoti luddo lohitapāṇi hatapahate niviṭṭho adayāpanno sabbapāṇabhūtesu. ‘‘Adinnādāyī hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti. ‘‘Kāmesumicchācārī hoti. Yā tā māturakkhitā…pe… antamaso mālāguḷaparikkhittāpi, tathārūpāsu cārittaṃ āpajjitā hoti. Evaṃ kho, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti. ‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti? Idha, bhikkhave, ekacco musāvādī hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘jānāmī’ti, jānaṃ vā āha ‘na jānāmī’ti, apassaṃ vā āha ‘passāmī’ti, passaṃ vā āha ‘na passāmī’ti, iti attahetu vā parahetu vā āmisakiñcikkhahetu vā sampajānamusā bhāsitā hoti. ‘‘Pisuṇavāco hoti. Ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā imesaṃ akkhātā amūsaṃ bhedāya. Iti samaggānaṃ vā bhettā bhinnānaṃ vā anuppadātā vaggārāmo vaggarato vagganandī, vaggakaraṇiṃ vācaṃ bhāsitā hoti. ‘‘Pharusavāco hoti. Yā sā vācā aṇḍakā kakkasā parakaṭukā parābhisajjanī kodhasāmantā. Asamādhisaṃvattanikā, tathārūpiṃ vācaṃ bhāsitā hoti. ‘‘Samphappalāpī hoti akālavādī abhūtavādī anatthavādī adhammavādī avinayavādī, anidhānavatiṃ vācaṃ bhāsitā hoti akālena anapadesaṃ apariyantavatiṃ anatthasaṃhitaṃ. Evaṃ kho, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti. ‘‘Kathañca, bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti? Idha, bhikkhave, ekacco abhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ, taṃ abhijjhātā hoti – ‘aho vata, yaṃ parassa taṃ mama assā’ti. ‘‘Byāpannacitto hoti paduṭṭhamanasaṅkappo – ‘ime sattā haññantu vā bajjhantu vā ucchijjantu vā vinassantu vā mā vā ahesu’nti. Micchādiṭṭhiko hoti viparītadassano – ‘natthi dinnaṃ…pe. … ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti. ‘‘Tividha kāyakammantasandosabyāpatti akusalasañcetanikāhetu [… sañcetanikahetu (ka.)] vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; catubbidhavacīkammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. ‘‘Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃkhitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, tividhakāyakammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; catubbidhavacīkammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti; tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantīti. ‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi. ‘‘Tatra, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti. ‘‘Kathañca, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti? Idha, bhikkhave, ekacco pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati…pe…. ‘‘Adinnādānaṃ pahāya, adinnādānā paṭivirato hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ gāmagataṃ vā araññagataṃ vā, na taṃ adinnaṃ theyyasaṅkhātaṃ ādātā hoti. ‘‘Kāmesumicchācāraṃ pahāya, kāmesumicchācārā paṭivirato hoti. Yā tā māturakkhitā …pe… antamaso mālāguḷaparikkhittāpi, tathārūpāsu na cārittaṃ āpajjitā hoti. Evaṃ kho, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti. ‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti? Idha, bhikkhave, ekacco musāvādaṃ pahāya musāvādā paṭivirato hoti. Sabhaggato vā parisaggato vā ñātimajjhagato vā pūgamajjhagato vā rājakulamajjhagato vā abhinīto sakkhipuṭṭho ‘ehambho purisa, yaṃ jānāsi taṃ vadehī’ti, so ajānaṃ vā āha ‘na jānāmī’ti, jānaṃ vā āha ‘jānāmī’ti, apassaṃ vā āha ‘na passāmī’ti, passaṃ vā āha ‘passāmī’ti, iti attahetu vā parahetu vā āmisakiñcikkhahetu vā na sampajānamusā bhāsitā hoti. ‘‘Pisuṇaṃ vācaṃ pahāya, pisuṇāya vācāya paṭivirato hoti – na ito sutvā amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandiṃ, samaggakaraṇiṃ vācaṃ bhāsitā hoti. ‘‘Pharusaṃ vācaṃ pahāya, pharusāya vācāya paṭivirato hoti. Yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā, tathārūpiṃ vācaṃ bhāsitā hoti. ‘‘Samphappalāpaṃ pahāya, samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Evaṃ kho, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti. ‘‘Kathañca, bhikkhave, tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti? Idha, bhikkhave, ekacco anabhijjhālu hoti. Yaṃ taṃ parassa paravittūpakaraṇaṃ taṃ anabhijjhātā hoti – ‘aho vata, yaṃ parassa taṃ mamassā’ti. ‘‘Abyāpannacitto hoti appaduṭṭhamanasaṅkappo – ‘ime sattā averā hontu abyāpajjā anīghā, sukhī attānaṃ pariharantū’ti. ‘‘Sammādiṭṭhiko hoti aviparītadassano – ‘atthi dinnaṃ, atthi yiṭṭhaṃ…pe… ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedentī’ti. Evaṃ kho, bhikkhave, tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti. ‘‘Tividhakāyakammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; catubbidhavacīkammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; tividhamanokammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. ‘‘Seyyathāpi, bhikkhave, apaṇṇako maṇi uddhaṃkhitto yena yeneva patiṭṭhāti suppatiṭṭhitaṃyeva patiṭṭhāti; evamevaṃ kho, bhikkhave, tividhakāyakammantasampattikusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; catubbidhavacīkammantasampattikusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; tividhamanokammantasampattikusalasañcetanikāhetu vā sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti. Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi. Tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmī’’ti. Sattamaṃ. [aṭṭhakathāyaṃ pana aṭṭhamasuttampi ettheva pariyāpannaṃ viya saṃvaṇṇanā dissati]",
      "english": "I do not declare, monks, the cessation of intentional actions, once they have been done and accumulated, without experiencing their results. And that experiencing may occur in this very life or at some other time. But neither do I declare, monks, the making an end of suffering without experiencing the results of intentional actions, once they have been done and accumulated.\n\nIn this regard, monks, there are three types of transgression of misconduct in bodily action, rooted in unwholesome intention, having suffering as their origin and suffering as their result; there are four types of transgression of misconduct in speech, rooted in unwholesome intention, having suffering as their origin and suffering as their result; there are three types of transgression of misconduct in mind, rooted in unwholesome intention, having suffering as their origin and suffering as their result.\n\nAnd how, monks, is there a threefold transgression of misconduct in bodily action, rooted in unwholesome intention, having suffering as its origin and suffering as its result? Here, monks, some individual is a killer of living beings, fierce, with blood on his hands, intent on striking and slaying, without compassion for all living beings.\n\nHe is one who takes what is not given. Whatever property or possessions of others, whether in the village or in the forest, he takes that which is not given, regarding it as theft.\n\nHe commits sexual misconduct. He has intercourse with women who are protected by a mother, by a father, by parents, by a brother, by a sister, by relatives, by kin, or by the Dhamma; or those who have a husband; or those guarded by law, or even those garlanded for marriage. Thus, monks, there is a threefold transgression of misconduct in bodily action, rooted in unwholesome intention, having suffering as its origin and suffering as its result.\n\nAnd how, monks, is there a fourfold transgression of misconduct in speech, rooted in unwholesome intention, having suffering as its origin and suffering as its result? Here, monks, some individual is a speaker of falsehoods. When he has gone to an assembly, or a gathering, or among relatives, or a guild, or the royal court, and is brought forth and questioned as a witness, \"Come, good man, tell what you know,\" he, not knowing, says, \"I know\"; or knowing, says, \"I don't know\"; or not seeing, says, \"I see\"; or seeing, says, \"I don't see.\" Thus, for his own sake, or for another's sake, or for some trifling material gain, he intentionally speaks a falsehood.\n\nHe is a slanderer. Having heard something here, he tells it there to divide these people, or having heard something there, he tells it here to divide those people. Thus he is a divider of those who are united or an encourager of those who are divided. Delighting in factions, enjoying factions, rejoicing in factions, he speaks words that create factions.\n\nHe is a harsh speaker. He speaks words that are rough, coarse, painful to others, causing vexation to others, accompanied by anger, and not conducive to concentration.\n\nHe is a frivolous talker. He speaks at the wrong time, speaks what is not true, speaks what is not beneficial, speaks contrary to the Dhamma, speaks contrary to the Vinaya. He speaks words that have no value, out of season, without reason, prolix, and not connected with benefit. Thus, monks, there is a fourfold transgression of misconduct in speech, rooted in unwholesome intention, having suffering as its origin and suffering as its result.\n\nAnd how, monks, is there a threefold transgression of misconduct in mind, rooted in unwholesome intention, having suffering as its origin and suffering as its result? Here, monks, some individual is covetous. Whatever property or possessions belong to others, he covets them, thinking, \"Oh, if only what belongs to another were mine!\"\n\nHe has a mind of ill will, with corrupt mental resolves, thinking, \"May these beings be slain, or bound, or annihilated, or perish, or not exist at all!\"\n\nHe has wrong view, with distorted perception, thinking, \"There is no merit in giving, no offering, no sacrifice; there is no fruit or result of good and bad deeds; there is no this world, no other world; there is no mother, no father; there are no spontaneously arisen beings; there are no recluses and brahmins in the world who, having themselves realized through direct knowledge, proclaim this world and the other world.\" Thus, monks, there is a threefold transgression of misconduct in mind, rooted in unwholesome intention, having suffering as its origin and suffering as its result.\n\nDue to the threefold transgression of misconduct in bodily action rooted in unwholesome intention, monks, beings, with the breaking up of the body, after death, are reborn in a state of deprivation, a bad destination, a lower realm, in hell; due to the fourfold transgression of misconduct in speech rooted in unwholesome intention, monks, beings, with the breaking up of the body, after death, are reborn in a state of deprivation, a bad destination, a lower realm, in hell; due to the threefold transgression of misconduct in mind rooted in unwholesome intention, monks, beings, with the breaking up of the body, after death, are reborn in a state of deprivation, a bad destination, a lower realm, in hell.\n\nJust as, monks, a faultless gem thrown upwards lands firmly wherever it lands; in the same way, monks, due to the three kinds of misconduct in bodily action, based on unwholesome volitions, beings, upon the body's dissolution, after death, are reborn in a state of deprivation, a bad destination, a state of ruin, in hell; due to the four kinds of misconduct in verbal action, based on unwholesome volitions, beings, upon the body's dissolution, after death, are reborn in a state of deprivation, a bad destination, a state of ruin, in hell; and due to the three kinds of misconduct in mental action, based on unwholesome volitions, beings, upon the body's dissolution, after death, are reborn in a state of deprivation, a bad destination, a state of ruin, in hell.\n\nMonks, I do not say that volitional actions, when done and accumulated, will vanish without experiencing their results. This will occur either in this very life or in some other future existence. Nevertheless, monks, I do not say that an end of suffering can be made without experiencing the results of volitional actions, when done and accumulated.\n\nTherein, monks, the three kinds of wholesome bodily action, based on wholesome volitions, lead to happiness and have a happy result; the four kinds of wholesome verbal action, based on wholesome volitions, lead to happiness and have a happy result; and the three kinds of wholesome mental action, based on wholesome volitions, lead to happiness and have a happy result.\n\nAnd how, monks, are the three kinds of wholesome bodily action based on wholesome volitions, leading to happiness and having a happy result? Here, monks, someone, having abandoned the taking of life, abstains from taking life. He lays aside cudgel and weapon, is conscientious, full of kindness, and dwells compassionate for the welfare of all living beings. Having abandoned taking what is not given, he abstains from taking what is not given. Whatever property or belongings of others, whether in a village or in the wilderness, he does not take it as something not given, as something amounting to theft. Having abandoned sexual misconduct, he abstains from sexual misconduct. He does not engage in misconduct with women who are protected by their mother, by their father, by both mother and father, by their brother, by their sister, by their relatives, by their clan, by their Dhamma, who have a husband, who are protected by law, or even those protected merely by a garland. In this way, monks, are the three kinds of wholesome bodily action based on wholesome volitions, leading to happiness and having a happy result.\n\nAnd how, monks, are the four kinds of wholesome verbal action based on wholesome volitions, leading to happiness and having a happy result? Here, monks, someone, having abandoned false speech, abstains from false speech. If he has gone to an assembly, or to a gathering, or to a gathering of relatives, or to a guild, or to the royal court, and is brought forward as a witness and questioned: ‘Come, good sir, speak what you know!’—then, not knowing, he says, ‘I do not know,’ or knowing, he says, ‘I know’; not seeing, he says, ‘I do not see,’ or seeing, he says, ‘I see.’ Thus, for his own sake, or for the sake of another, or for the sake of some trifling material gain, he does not knowingly speak a lie. Having abandoned divisive speech, he abstains from divisive speech. He does not repeat elsewhere what he has heard here in order to cause division among these people, nor does he repeat here what he has heard elsewhere in order to cause division among those people. Thus, he is a reconciler of those who are divided, and an encourager of those who are united; he rejoices in unity, delights in unity, loves unity, and speaks words that promote unity. Having abandoned harsh speech, he abstains from harsh speech. He speaks words that are gentle, pleasing to the ear, affectionate, reaching the heart, courteous, cherished by many, and agreeable to many. Having abandoned idle chatter, he abstains from idle chatter. He speaks at the right time, speaks what is factual, speaks what is beneficial, speaks of the Dhamma, speaks of the Vinaya. He speaks words that are worthy of being treasured, timely, logical, defined, and connected with purpose. In this way, monks, are the four kinds of wholesome verbal action based on wholesome volitions, leading to happiness and having a happy result.\n\nAnd how, monks, are the three kinds of wholesome mental action based on wholesome volitions, leading to happiness and having a happy result? Here, monks, someone is not covetous. He does not covet the property or belongings of others, thinking: ‘Oh, if only what belongs to another were mine!’ He is without ill will, with an undefiled intention, thinking: ‘May these beings be free from enmity, free from affliction, free from trouble, and may they live happily!’ He has right view, an unperverted vision, thinking: ‘There is what is given, there is what is offered, there is what is sacrificed, there is fruit and result of good and bad actions; there is this world, there is the other world; there is mother, there is father; there are spontaneously reborn beings; there are in the world ascetics and brahmins who are rightly gone and rightly practicing, who, having themselves realized by direct knowledge, declare this world and the other world.’ In this way, monks, are the three kinds of wholesome mental action based on wholesome volitions, leading to happiness and having a happy result.\n\nDue to the three kinds of wholesome bodily action, based on wholesome volitions, monks, beings, upon the body's dissolution, after death, are reborn in a good destination, in the heavenly world; due to the four kinds of wholesome verbal action, based on wholesome volitions, monks, beings, upon the body's dissolution, after death, are reborn in a good destination, in the heavenly world; and due to the three kinds of wholesome mental action, based on wholesome volitions, monks, beings, upon the body's dissolution, after death, are reborn in a good destination, in the heavenly world.\n\nJust as, monks, a genuine gem thrown upwards, wherever it lands, it lands firmly and well-established. In the same way, monks, due to wholesome volitional intentions concerning the accomplishment of threefold bodily action, beings, with the breaking up of the body, after death, are reborn in a good destination, a heavenly world; or due to wholesome volitional intentions concerning the accomplishment of fourfold verbal action, beings, with the breaking up of the body, after death, are reborn in a good destination, a heavenly world; or due to wholesome volitional intentions concerning the accomplishment of threefold mental action, beings, with the breaking up of the body, after death, are reborn in a good destination, a heavenly world. I do not declare, monks, that volitional actions, once performed and accumulated, will come to an end without their results being experienced. And indeed, this may ripen in this very life or in a subsequent existence. Yet, monks, I do not declare the making of an end to suffering without experiencing the results of volitional actions that have been performed and accumulated.",
      "sinhala": "මහණෙනි, සංචේතනික වූ, කරන ලද, රැස් කරන ලද කර්මයන්ගේ විපාක නොවිඳ අවසන් වීමක් මම නොකියමි. ඒ කර්ම විපාකය නම් මේ දිට්ඨධම්මයේදීම (මේ ආත්මභාවයේදීම) හෝ වෙනත් අවස්ථාවකදී (පරලොවදී) හෝ ඇතිවන්නකි. මහණෙනි, එසේම, සංචේතනික වූ, කරන ලද, රැස් කරන ලද කර්මයන්ගේ විපාක නොවිඳ දුකේ කෙළවර කිරීමක් මම නොකියමි.\n\nමහණෙනි, එහිලා තෙවැදෑරුම් කාය කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය (ශරීරයෙන් සිදු කරන දුෂ්චරිතය), අකුසල සංචේතනිකව (අකුසල චේතනාවෙන් යුතුව) සිදු කරන ලද, දුකට හේතුවන, දුක් විපාක දෙන එකක් වේ; සිව්වැදෑරුම් වචී කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය (වචනයෙන් සිදු කරන දුෂ්චරිතය), අකුසල සංචේතනිකව සිදු කරන ලද, දුකට හේතුවන, දුක් විපාක දෙන එකක් වේ; තෙවැදෑරුම් මනෝ කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය (මනසින් සිදු කරන දුෂ්චරිතය), අකුසල සංචේතනිකව සිදු කරන ලද, දුකට හේතුවන, දුක් විපාක දෙන එකක් වේ.\n\nමහණෙනි, තෙවැදෑරුම් කාය කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව දුකට හේතුවන, දුක් විපාක දෙන එකක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා ඇතැමෙක් පරපණ නසන්නෙක් වේ. ඔහු ඉතා දරුණුය, ලේ තැවරුණු අත් ඇත්තෙකි, මැරීමට හා හිංසා කිරීමට ඇලුම් කරන්නෙකි, සියලු සත්වයන් කෙරෙහි දයාවෙන් තොරය.\n\nඅදින්නාදානය කරන්නෙක් (නුදුන් දේ ගන්නෙක්) වේ. අනුන්ගේ යම්කිසි වස්තුවක් හෝ අනුන් පරිහරණය කරන උපකරණයක් ගමක තිබුණත්, ආරණ්‍යයක තිබුණත්, අයිතිකරුවා නොදැනුවත්ව හොරකම් ලෙසින් ගන්නේය.\n\nකාමයන්හි වරදවා හැසිරෙන්නෙක් (කාමමිථ්‍යාචාරී) වේ. යම් ස්ත්‍රියක් මව විසින් ආරක්ෂා කරන ලද, පියා විසින් ආරක්ෂා කරන ලද, මව්පියන් විසින් ආරක්ෂා කරන ලද, සොහොයුරා විසින් ආරක්ෂා කරන ලද, සොහොයුරිය විසින් ආරක්ෂා කරන ලද, ඥාතීන් විසින් ආරක්ෂා කරන ලද, කුලගෝත්‍රය විසින් ආරක්ෂා කරන ලද, ධර්මය විසින් ආරක්ෂා කරන ලද, ස්වාමිපුරුෂයෙකු සිටින, දඬුවකින් හෝ මල්ගුලකින් (මල් මාලාවකින්) හෝ සලකුණු කොට ආරක්ෂා කරන ලද ස්ත්‍රීන් සමඟ වරදවා හැසිරෙයි. මහණෙනි, මෙසේ තෙවැදෑරුම් කාය කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව දුකට හේතුවන, දුක් විපාක දෙන එකක් වේ.\n\nමහණෙනි, සිව්වැදෑරුම් වචී කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව දුකට හේතුවන, දුක් විපාක දෙන එකක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා ඇතැමෙක් මුසාවාදී (බොරු කියන්නෙක්) වේ. ඔහු සභාවට ගියත්, පිරිසට ගියත්, ඥාතීන් මැදට ගියත්, පූගය මැදට (සමූහයක් මැදට) ගියත්, රජ පවුල මැදට ගියත්, (විශේෂයෙන්) සාක්ෂියක් ලෙස කැඳවන ලද්දේ, 'එම්බල පුරුෂය, යමක් දන්නෙහිද එය කියන්නැ'යි ඇසූ විට, නොදන්නා දෙයක් 'මම දනිමි' යැයි කියයි, දන්නා දෙයක් 'මම නොදනිමි' යැයි කියයි, නොදුටු දෙයක් 'මම දිටිමි' යැයි කියයි, දුටු දෙයක් 'මම නොදුටුයෙමි' යැයි කියයි. මෙසේ තමන්ගේ යම්කිසි අරමුණක් හේතුකොටගෙන හෝ අනුන්ගේ අරමුණක් හේතුකොටගෙන හෝ සුළු ආමිස ලාභයක් හේතුකොටගෙන හෝ දැන දැනම බොරු කියයි.\n\nපිසුණාවාචා (කේලම් වචන) කියන්නෙක් වේ. මෙතනින් අසා අනුන් බිඳවීමට එතන කියයි, එතනින් අසා මේ අය බිඳවීමට මෙතන කියයි. මෙසේ එකමුතු අය බිඳවයි, බිඳුණු අය තවදුරටත් බිඳවයි. භේදයට කැමැත්තෙන්, භේදයට ඇලුම් කරමින්, භේදයෙන් සතුටු වෙමින්, භේදය ඇති කරන වචන කතා කරයි.\n\nඵරුෂාවාචා (රළු වචන) කියන්නෙක් වේ. ඒ යම් වචනයක් හිංසාකාරී වේද, කටුක වේද, අනුන්ට පීඩාකාරී වේද, අනුන්ට නින්දා කරන සුළු වේද, ක්‍රෝධයෙන් යුක්ත වේද, සමාධියට උපකාරී නොවේද, එබඳු වචන කතා කරයි.\n\nසම්ඵප්පලාපී (නිෂ්ඵල කතා කරන්නෙක්) වේ. අකල්හි කියයි, අසත්‍යය කියයි, අනර්ථකාරී දේ කියයි, ධර්මයට පටහැනි දේ කියයි, විනයට පටහැනි දේ කියයි. අර්ථයක් නොමැති, කාලයට නොගැළපෙන, අසාධාරණ, කෙළවරක් නැති, අනර්ථයෙන් යුත් වචන කතා කරයි. මහණෙනි, මෙසේ සිව්වැදෑරුම් වචී කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව දුකට හේතුවන, දුක් විපාක දෙන එකක් වේ.\n\nමහණෙනි, තෙවැදෑරුම් මනෝ කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව දුකට හේතුවන, දුක් විපාක දෙන එකක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා ඇතැමෙක් අභිජ්ඣා සහගත (අනුන්ගේ දේට ආසා කරන) වේ. අනුන්ගේ යම්කිසි වස්තුවක් හෝ උපකරණයක් වේද, එයට ආසා කරයි – 'අහෝ, අනුන්ගේ මේ දේ මට අයිති වේ නම්!' යැයි සිතයි.\n\nඔහු ව්‍යාපාද චිත්තය ඇති (ද්වේෂ සහගත) වේ, දුෂ්ට මනෝ සංකල්ප ඇත්තේය – 'මේ සත්ව‌යෝ මැරී යත්වා, බැඳී යත්වා, විනාශ වී යත්වා, නැති වී යත්වා, නැවත ඇති නොවත්වා' යැයි සිතයි.\n\nඔහු මිථ්‍යාදෘෂ්ටික (වැරදි දැක්මක් ඇති) වේ, විපරීත දර්ශනය ඇත්තේය – 'දුන් දේවල විපාකයක් නැත, පූජා කිරීමේ විපාකයක් නැත, දේව පූජාවල විපාකයක් නැත, හොඳ නරක කර්මවල විපාකයක් නැත, මේ ලොවක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්ව‌යෝ නැත. මේ ලෝකයද පරලෝකයද තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට ප්‍රකාශ කරන්නාවූ කිසිදු ශ්‍රමණ බ්‍රාහ්මණයෙක් නැත' යැයි සිතයි. මහණෙනි, මෙසේ තෙවැදෑරුම් මනෝ කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව දුකට හේතුවන, දුක් විපාක දෙන එකක් වේ.\n\nමහණෙනි, තෙවැදෑරුම් කාය කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව සිදු කිරීමේ හේතුවෙන්, සත්ව‌යන් ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුක්ඛිත තත්ත්වයන්ට උපදින්නේය; මහණෙනි, සිව්වැදෑරුම් වචී කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව සිදු කිරීමේ හේතුවෙන්, සත්ව‌යන් ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුක්ඛිත තත්ත්වයන්ට උපදින්නේය; මහණෙනි, තෙවැදෑරුම් මනෝ කර්මාන්ත සංදෝෂ ව්‍යාපත්තිය අකුසල සංචේතනිකව සිදු කිරීමේ හේතුවෙන්, සත්ව‌යන් ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන දුක්ඛිත තත්ත්වයන්ට උපදින්නේය.\n\nභික්ෂූනි, යම් සේ, කිසිදා වරදින්නේ නැති, ස්වභාවයෙන්ම හොඳින් පිහිටන මැණිකක් ඉහළට විසි කළ විට, එය කොතැන වැටුණත් හොඳින්ම පිහිටන්නේද; එලෙසම භික්ෂූනි, අකුසල් සහගත චේතනාවන් හේතුවෙන් තුන් ආකාරයකින් සිදුවන කාය කර්මාන්ත දූෂ්‍යවීම් හේතුවෙන් සත්වයෝ ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන අතිශය දුක්ඛිත තත්ත්වයන්හි උපදිති; සතර ආකාරයකින් සිදුවන වචී කර්මාන්ත දූෂ්‍යවීම් හේතුවෙන් ද සත්වයෝ ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන අතිශය දුක්ඛිත තත්ත්වයන්හි උපදිති; තුන් ආකාරයකින් සිදුවන මනෝ කර්මාන්ත දූෂ්‍යවීම් හේතුවෙන් ද සත්වයෝ ශරීරය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන අතිශය දුක්ඛිත තත්ත්වයන්හි උපදිති.\n\nභික්ෂූනි, හිතාමතා කරන ලද, රැස්කරන ලද කර්මයන්හි විපාක නොවිඳ, ඒවා ක්ෂය වී යන බවක් මම නොපවසමි, එනම්, ඒ විපාක මේ ආත්මභාවයේදීම විපාක දිය හැකියි, නැතහොත් වෙනත් ආත්මභාවයකදී විපාක දිය හැකියි. භික්ෂූනි, එසේම හිතාමතා කරන ලද, රැස්කරන ලද කර්මයන්හි විපාක නොවිඳ, දුක අවසන් කිරීමක් මම නොපවසමි.\n\nභික්ෂූනි, එහිදී, කුසල් සහගත චේතනාවන් හේතුවෙන් තුන් ආකාරයකින් සිදුවන කාය කර්මාන්ත සම්පත්තිය සැප පිණිස පවතී, එහි විපාකය සැපය. සතර ආකාරයකින් සිදුවන වචී කර්මාන්ත සම්පත්තිය කුසල් සහගත චේතනාවන් හේතුවෙන් සැප පිණිස පවතී, එහි විපාකය සැපය. තුන් ආකාරයකින් සිදුවන මනෝ කර්මාන්ත සම්පත්තිය කුසල් සහගත චේතනාවන් හේතුවෙන් සැප පිණිස පවතී, එහි විපාකය සැපය.\n\nභික්ෂූනි, කුසල් සහගත චේතනාවන් හේතුවෙන් තුන් ආකාරයකින් සිදුවන කාය කර්මාන්ත සම්පත්තිය සැප පිණිස පවතී, එහි විපාකය සැපය කීවේ කෙසේද? භික්ෂූනි, මෙහිදී ඇතැම් පුද්ගලයෙක් ප‍්‍රාණඝාතය අත්හැර, ප‍්‍රාණඝාතයෙන් වැළකී සිටියි. දඬු මුගුරු බහා තබා, ආයුධ බහා තබා, ලජ්ජාශීලීව, කරුණාවෙන් යුතුව, සියලු සත්වයන්ට හිතසුව කැමති වෙමින් වාසය කරයි. අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වැළකී සිටියි. අනුන්ගේ යම් බඩු මුට්ටු හෝ ධන සම්පත් ගම් තුළ හෝ වනයෙහි ඇතිනම්, අනුන් විසින් නොදෙන ලද, සොරකමක් වශයෙන් සැලකෙන ඒවා ඔහු නොගනී. කාමයේ වරදවා හැසිරීම අත්හැර, කාමයේ වරදවා හැසිරීමෙන් වැළකී සිටියි. එනම්, මව විසින්, පියා විසින්, සහෝදරයා විසින්, සහෝදරිය විසින්, ඥාතීන් විසින්, ධර්මයෙන් ආරක්ෂිත වූ හෝ සැමියෙක් සිටින හෝ, අන්තිම වශයෙන් මල්මාලා වලින් වට කරන ලද (විවාහයට සූදානම්) අය සමඟ හෝ ඔහු වරදවා හැසිරීමකට නොපැමිණෙයි. භික්ෂූනි, මෙලෙසින්, කුසල් සහගත චේතනාවන් හේතුවෙන් තුන් ආකාරයකින් සිදුවන කාය කර්මාන්ත සම්පත්තිය සැප පිණිස පවතී, එහි විපාකය සැපය.\n\nභික්ෂූනි, කුසල් සහගත චේතනාවන් හේතුවෙන් සතර ආකාරයකින් සිදුවන වචී කර්මාන්ත සම්පත්තිය සැප පිණිස පවතී, එහි විපාකය සැපය කීවේ කෙසේද? භික්ෂූනි, මෙහිදී ඇතැම් පුද්ගලයෙක් මුසාවාදය අත්හැර, මුසාවාදයෙන් වැළකී සිටියි. එනම්, සභාවක් වෙත හෝ පිරිසක් වෙත හෝ ඥාතීන් අතරට හෝ සමාජයක් වෙත හෝ රාජ සභාවකට හෝ ගොස් සාක්ෂිකරුවෙකු ලෙස ඉදිරිපත් කර, ‘පින්වත් පුරුෂය, ඔබ දන්නා දේ කියන්නැයි’ විමසූ විට, ඔහු නොදන්නේ නම් ‘මම නොදනිමි’ යැයි පවසයි, දන්නේ නම් ‘මම දනිමි’ යැයි පවසයි, නොදකින්නේ නම් ‘මම නොදකිමි’ යැයි පවසයි, දකින්නේ නම් ‘මම දකිමි’ යැයි පවසයි. මෙලෙසින් තමාගේ අරමුණක් වෙනුවෙන් හෝ අනුන්ගේ අරමුණක් වෙනුවෙන් හෝ සුළු ලාභයක් වෙනුවෙන් හෝ හිතාමතා බොරු නොකියයි. කේලාම් කීම අත්හැර, කේලාම් කීමෙන් වැළකී සිටියි. එනම්, මෙහිදී අසා එතැනට ගොස් මොවුන් බිඳවීමට නොකියයි, එතැනදී අසා මෙතැනට ගොස් ඔවුන් බිඳවීමට නොකියයි. මෙලෙසින්, බිඳී ගිය අය සමගි කරවන්නෙක් වෙයි, සමගි වූවන් තව තවත් දිරිමත් කරන්නෙක් වෙයි, සමගියෙන් ප‍්‍රීති වන්නේය, සමගියෙන් සතුටු වන්නේය, සමගියට ඇලී ගැලී සිටින්නේය, සමගිය ඇති කරන වචනම කියන්නේය. පරොස් වචනය අත්හැර, පරොස් වචනයෙන් වැළකී සිටියි. එනම්, මොළොක් වූ, කනට ප‍්‍රිය වූ, ආදරණීය වූ, හදවතට ගෝචර වන, නාගරික (සංස්කෘතික) වූ, බොහෝ දෙනාට ප‍්‍රිය මනාප වූ, බොහෝ දෙනාගේ සිත් ගන්නා වූ වචනම කියන්නේය. සම්ඵප්පලාපය අත්හැර, සම්ඵප්පලාපයෙන් වැළකී සිටියි. එනම්, කාලයට අනුව කථා කරන්නෙක් වෙයි, සත්‍ය වශයෙන්ම පවතින දේ කථා කරන්නෙක් වෙයි, වැඩදායක දේ කථා කරන්නෙක් වෙයි, ධර්මය ගැන කථා කරන්නෙක් වෙයි, විනය ගැන කථා කරන්නෙක් වෙයි, නිධානයක් බඳු වූ වචනම කියන්නේය, නියම කලට, හේතු සහිතව, සීමා සහිතව, අර්ථය හා සම්බන්ධ වන වචනම කියන්නේය. භික්ෂූනි, මෙලෙසින්, කුසල් සහගත චේතනාවන් හේතුවෙන් සතර ආකාරයකින් සිදුවන වචී කර්මාන්ත සම්පත්තිය සැප පිණිස පවතී, එහි විපාකය සැපය.\n\nභික්ෂූනි, කුසල් සහගත චේතනාවන් හේතුවෙන් තුන් ආකාරයකින් සිදුවන මනෝ කර්මාන්ත සම්පත්තිය සැප පිණිස පවතී, එහි විපාකය සැපය කීවේ කෙසේද? භික්ෂූනි, මෙහිදී ඇතැම් පුද්ගලයෙක් අනුන්ගේ දේපළ කෙරෙහි ආශා නොකරයි. එනම්, ‘අහෝ, අනුන්ගේ දෙය මට අයිති වුවොත්!’ යැයි සිතා අනුන්ගේ ධන සම්පත් කෙරෙහි තණ්හා නොකරයි. ද්වේෂයෙන් තොර සිතින් යුක්ත වෙයි, ව්‍යාපාද රහිත සිතිවිලි ඇත්තෙක් වෙයි. එනම්, ‘මේ සත්වයෝ වෛර රහිත වෙත්වා, ව්‍යාපාද රහිත වෙත්වා, දුක් රහිත වෙත්වා, සතුටින් තමන් රැකවරණය කර ගනිත්වා!’ යැයි සිතයි. සම්මා දිට්ඨික වෙයි, විපරීත දර්ශනයෙන් තොර වෙයි. එනම්, ‘දීමෙහි විපාක ඇත, පූජා කිරීමෙහි විපාක ඇත, හොඳ නරක කර්මයන්හි ඵල විපාක ඇත, මේ ලෝකය ඇත, පරලොව ඇත, මව ඇත, පියා ඇත, ඕපපාතික සත්වයෝ ඇත, මේ ලෝකයේ මනාකොට ගිය, මනාකොට පිළිපන්, යම් ශ‍්‍රමණ බ‍්‍රාහ්මණයෝ මේ ලෝකය හා පරලොව තමන් විසින්ම විශේෂයෙන් දැන ප‍්‍රත්‍යක්ෂ කොට පවසත්ද, ඔවුහු ඇත’ යන නිවැරදි දැක්ම ඇත්තෙක් වෙයි. භික්ෂූනි, මෙලෙසින්, කුසල් සහගත චේතනාවන් හේතුවෙන් තුන් ආකාරයකින් සිදුවන මනෝ කර්මාන්ත සම්පත්තිය සැප පිණිස පවතී, එහි විපාකය සැපය.\n\nභික්ෂූනි, කුසල් සහගත චේතනාවන් හේතුවෙන් තුන් ආකාරයකින් සිදුවන කාය කර්මාන්ත සම්පත්තිය හේතුවෙන් සත්වයෝ ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයන්හි උපදිති; කුසල් සහගත චේතනාවන් හේතුවෙන් සතර ආකාරයකින් සිදුවන වචී කර්මාන්ත සම්පත්තිය හේතුවෙන් ද සත්වයෝ ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයන්හි උපදිති; කුසල් සහගත චේතනාවන් හේතුවෙන් තුන් ආකාරයකින් සිදුවන මනෝ කර්මාන්ත සම්පත්තිය හේතුවෙන් ද සත්වයෝ ශරීරය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයන්හි උපදිති.\n\nමහණෙනි, යම්සේ කැපූ මුදුන් ඇති මැණිකක් උඩට දමා ගැසූ විට එය කවර ආකාරයකින් පිහිටියා හෝ මනාකොටම පිහිටයිද; එසෙයින්ම, මහණෙනි, ත්‍රිවිධ කාය කර්මාන්ත සම්පත්තිය (යහපත් කායික ක්‍රියා තුන) හේතු කොටගෙන, කුසල චේතනාවන් නිසා සත්ත්වයෝ ශරීරය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිති. සතර ආකාර වූ වචී කර්මාන්ත සම්පත්තිය (යහපත් වාචසික ක්‍රියා සතර) හේතු කොටගෙන, කුසල චේතනාවන් නිසා සත්ත්වයෝ ශරීරය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිති. ත්‍රිවිධ මනෝ කර්මාන්ත සම්පත්තිය (යහපත් මානසික ක්‍රියා තුන) හේතු කොටගෙන, කුසල චේතනාවන් නිසා සත්ත්වයෝ ශරීරය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිති.\n\nමහණෙනි, චේතනා සහිතව කරන ලද, රැස් කරන ලද කර්මයන්හි විපාක නොවිඳ කෙළවරවීමක් මම පවසන්නේ නැත. ඒ විපාකය නම් මේ ආත්මභාවයේදීම ලැබිය හැක, නැතහොත් වෙනත් ආත්මභාවයකදී ලැබිය හැක. එහෙත්, මහණෙනි, චේතනා සහිතව කරන ලද, රැස් කරන ලද කර්මයන්හි විපාක නොවිඳ දුකෙහි කෙළවර කිරීමක් මම පවසන්නේ නැත.",
      "paliTitle": "Paṭhamasañcetanikasuttaṃ"
    },
    {
      "number": 218,
      "pali": "‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi. ‘‘Tatra, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti; catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti; tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti. ‘‘Kathañca, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti…pe… evaṃ kho, bhikkhave, tividhā kāyakammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti. ‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti…pe… evaṃ kho, bhikkhave, catubbidhā vacīkammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti. ‘‘Kathañca, bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti…pe… evaṃ kho, bhikkhave, tividhā manokammantasandosabyāpatti akusalasañcetanikā dukkhudrayā dukkhavipākā hoti. ‘‘Tividha kāyakammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti, catubbidhavacīkammanta…pe… tividhamanokammantasandosabyāpatti akusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. ‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi. ‘‘Tatra kho, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti; tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti. ‘‘Kathañca, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti…pe… evaṃ kho, bhikkhave, tividhā kāyakammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti. ‘‘Kathañca, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti…pe… evaṃ kho, bhikkhave, catubbidhā vacīkammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti. ‘‘Kathañca, bhikkhave, tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti…pe… evaṃ kho, bhikkhave, tividhā manokammantasampatti kusalasañcetanikā sukhudrayā sukhavipākā hoti. ‘‘Tividhakāyakammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti; catubbidhavacīkammantasampatti…pe… tividhamanokammantasampattikusalasañcetanikāhetu vā, bhikkhave, sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjanti…pe…. [upapajjanti. (syā. ka.) tathā sati ‘‘nāhaṃ bhikkhave sañcetanikāna’’ miccādinā vuccamānavacanena saha ekasuttanti gahetabbaṃ. peyyālena pana purimasutte viya nigamanaṃ dassitaṃ] Aṭṭhamaṃ.",
      "english": "Monks, I do not declare the cessation of volitional actions that have been done and accumulated without experiencing their results, and this experience of results may occur in this very life or in some other future existence. However, monks, I do not declare the making an end of suffering without experiencing the results of volitional actions that have been done and accumulated.\n\nHerein, monks, there are three kinds of bodily misconduct rooted in unwholesome volition, which lead to suffering and result in suffering; four kinds of verbal misconduct rooted in unwholesome volition, which lead to suffering and result in suffering; three kinds of mental misconduct rooted in unwholesome volition, which lead to suffering and result in suffering.\n\nAnd how, monks, are there three kinds of bodily misconduct rooted in unwholesome volition, leading to suffering and resulting in suffering? ... In this way, monks, are there three kinds of bodily misconduct rooted in unwholesome volition, leading to suffering and resulting in suffering.\n\nAnd how, monks, are there four kinds of verbal misconduct rooted in unwholesome volition, leading to suffering and resulting in suffering? ... In this way, monks, are there four kinds of verbal misconduct rooted in unwholesome volition, leading to suffering and resulting in suffering.\n\nAnd how, monks, are there three kinds of mental misconduct rooted in unwholesome volition, leading to suffering and resulting in suffering? ... In this way, monks, are there three kinds of mental misconduct rooted in unwholesome volition, leading to suffering and resulting in suffering.\n\nMonks, due to three kinds of bodily misconduct rooted in unwholesome volition, beings, with the breaking up of the body, after death, reappear in a state of deprivation, a bad destination, a lower realm, in hell; due to four kinds of verbal misconduct... and due to three kinds of mental misconduct rooted in unwholesome volition, monks, beings, with the breaking up of the body, after death, reappear in a state of deprivation, a bad destination, a lower realm, in hell.\n\nMonks, I do not declare the cessation of volitional actions that have been done and accumulated without experiencing their results, and this experience of results may occur in this very life or in some other future existence. However, monks, I do not declare the making an end of suffering without experiencing the results of volitional actions that have been done and accumulated.\n\nHerein, monks, there are three kinds of bodily good conduct rooted in wholesome volition, which lead to happiness and result in happiness; four kinds of verbal good conduct rooted in wholesome volition, which lead to happiness and result in happiness; three kinds of mental good conduct rooted in wholesome volition, which lead to happiness and result in happiness.\n\nAnd how, monks, are there three kinds of bodily good conduct rooted in wholesome volition, leading to happiness and resulting in happiness? ... In this way, monks, are there three kinds of bodily good conduct rooted in wholesome volition, leading to happiness and resulting in happiness.\n\nAnd how, monks, are there four kinds of verbal good conduct rooted in wholesome volition, leading to happiness and resulting in happiness? ... In this way, monks, are there four kinds of verbal good conduct rooted in wholesome volition, leading to happiness and resulting in happiness.\n\nAnd how, monks, are there three kinds of mental good conduct rooted in wholesome volition, leading to happiness and resulting in happiness? ... In this way, monks, are there three kinds of mental good conduct rooted in wholesome volition, leading to happiness and resulting in happiness.\n\nMonks, due to three kinds of bodily good conduct rooted in wholesome volition, beings, with the breaking up of the body, after death, reappear in a happy destination, a heavenly world; due to four kinds of verbal good conduct... and due to three kinds of mental good conduct rooted in wholesome volition, monks, beings, with the breaking up of the body, after death, reappear in a happy destination, a heavenly world...",
      "sinhala": "භික්ෂූනි, චේතනාවෙන් කරන ලද, රැස්කරන ලද කර්මයන්ගේ විපාක නොවිඳ ක්ෂයවීමක් ඇතැයි මම නොකියමි. එය මේ ආත්මභාවයේදී හෝ වෙනත් ආත්මභාවයකදී විපාක දිය හැකිය. එහෙත් භික්ෂූනි, චේතනාවෙන් කරන ලද, රැස්කරන ලද කර්මයන්ගේ විපාක නොවිඳ දුක කෙළවර කිරීමක් ඇතැයි මම නොකියමි.\n\nභික්ෂූනි, එහිදී තුන් ආකාරයකින් වන කාය කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වෙයි; සතර ආකාරයකින් වන වචී කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වෙයි; තුන් ආකාරයකින් වන මනෝ කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වෙයි.\n\nභික්ෂූනි, තුන් ආකාරයකින් වන කාය කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වන්නේ කෙසේද? (එහි විස්තරය)... භික්ෂූනි, මෙසේයි තුන් ආකාරයකින් වන කාය කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වන්නේ.\n\nභික්ෂූනි, සතර ආකාරයකින් වන වචී කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වන්නේ කෙසේද? (එහි විස්තරය)... භික්ෂූනි, මෙසේයි සතර ආකාරයකින් වන වචී කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වන්නේ.\n\nභික්ෂූනි, තුන් ආකාරයකින් වන මනෝ කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වන්නේ කෙසේද? (එහි විස්තරය)... භික්ෂූනි, මෙසේයි තුන් ආකාරයකින් වන මනෝ කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තව දුක් ඇති කරන්නක්, දුක් විපාක දෙන්නක් වන්නේ.\n\nභික්ෂූනි, තුන් ආකාරයකින් වන කාය කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තවීම හේතුකොටගෙන හෝ, සතර ආකාරයකින් වන වචී කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තවීම හේතුකොටගෙන හෝ, තුන් ආකාරයකින් වන මනෝ කර්මාන්ත දූෂ්‍යවීම අකුසල චේතනාවෙන් යුක්තවීම හේතුකොටගෙන හෝ, සත්වයෝ කය බිඳී, මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදිති.\n\nභික්ෂූනි, චේතනාවෙන් කරන ලද, රැස්කරන ලද කර්මයන්ගේ විපාක නොවිඳ ක්ෂයවීමක් ඇතැයි මම නොකියමි. එය මේ ආත්මභාවයේදී හෝ වෙනත් ආත්මභාවයකදී විපාක දිය හැකිය. එහෙත් භික්ෂූනි, චේතනාවෙන් කරන ලද, රැස්කරන ලද කර්මයන්ගේ විපාක නොවිඳ දුක කෙළවර කිරීමක් ඇතැයි මම නොකියමි.\n\nභික්ෂූනි, එහිදී තුන් ආකාරයකින් වන කාය කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වෙයි; සතර ආකාරයකින් වන වචී කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වෙයි; තුන් ආකාරයකින් වන මනෝ කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වෙයි.\n\nභික්ෂූනි, තුන් ආකාරයකින් වන කාය කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වන්නේ කෙසේද? (එහි විස්තරය)... භික්ෂූනි, මෙසේයි තුන් ආකාරයකින් වන කාය කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වන්නේ.\n\nභික්ෂූනි, සතර ආකාරයකින් වන වචී කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වන්නේ කෙසේද? (එහි විස්තරය)... භික්ෂූනි, මෙසේයි සතර ආකාරයකින් වන වචී කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වන්නේ.\n\nභික්ෂූනි, තුන් ආකාරයකින් වන මනෝ කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වන්නේ කෙසේද? (එහි විස්තරය)... භික්ෂූනි, මෙසේයි තුන් ආකාරයකින් වන මනෝ කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තව සැප ඇති කරන්නක්, සැප විපාක දෙන්නක් වන්නේ.\n\nභික්ෂූනි, තුන් ආකාරයකින් වන කාය කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තවීම හේතුකොටගෙන හෝ, සතර ආකාරයකින් වන වචී කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තවීම හේතුකොටගෙන හෝ, තුන් ආකාරයකින් වන මනෝ කර්මාන්ත සම්පත්තිය කුසල චේතනාවෙන් යුක්තවීම හේතුකොටගෙන හෝ, සත්වයෝ කය බිඳී, මරණයෙන් පසුව සුගති, ස්වර්ග ලෝකයන්හි උපදිති.",
      "paliTitle": "Dutiyasañcetanikasuttaṃ"
    },
    {
      "number": 219,
      "pali": "‘‘Nāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā byantībhāvaṃ vadāmi, tañca kho diṭṭheva dhamme upapajje vā apare vā pariyāye. Na tvevāhaṃ, bhikkhave, sañcetanikānaṃ kammānaṃ katānaṃ upacitānaṃ appaṭisaṃveditvā dukkhassantakiriyaṃ vadāmi. ‘‘Sa kho so, bhikkhave, ariyasāvako evaṃ vigatābhijjho vigatabyāpādo asammūḷho sampajāno paṭissato mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ [catutthiṃ (?)]. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. ‘‘So evaṃ pajānāti – ‘pubbe kho me idaṃ cittaṃ parittaṃ ahosi abhāvitaṃ, etarahi pana me idaṃ cittaṃ appamāṇaṃ subhāvitaṃ. Yaṃ kho pana kiñci pamāṇakataṃ kammaṃ, na taṃ tatrāvasissati na taṃ tatrāvatiṭṭhatī’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, daharatagge ce so ayaṃ [ce ayaṃ (syā.)] kumāro mettaṃ cetovimuttiṃ bhāveyya, api nu kho [api nu so (?)] pāpakammaṃ kareyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Akarontaṃ kho pana pāpakammaṃ api nu kho dukkhaṃ phuseyyā’’ti? ‘‘No hetaṃ, bhante. Akarontañhi, bhante, pāpakammaṃ kuto dukkhaṃ phusissatī’’ti! ‘‘Bhāvetabbā kho panāyaṃ, bhikkhave, mettācetovimutti itthiyā vā purisena vā. Itthiyā vā, bhikkhave, purisassa vā nāyaṃ kāyo ādāya gamanīyo. Cittantaro ayaṃ, bhikkhave, macco. So evaṃ pajānāti – ‘yaṃ kho me idaṃ kiñci pubbe iminā karajakāyena pāpakammaṃ kataṃ, sabbaṃ taṃ idha vedanīyaṃ; na taṃ anugaṃ bhavissatī’ti. Evaṃ bhāvitā kho, bhikkhave, mettā cetovimutti anāgāmitāya saṃvattati, idha paññassa bhikkhuno uttari [uttariṃ (sī. syā. pī.)] vimuttiṃ appaṭivijjhato. ‘‘Karuṇāsahagatena cetasā… muditāsahagatena cetasā… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati tathā dutiyaṃ tathā tatiyaṃ tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. ‘‘So evaṃ pajānāti – ‘pubbe kho me idaṃ cittaṃ parittaṃ ahosi abhāvitaṃ, etarahi pana me idaṃ cittaṃ appamāṇaṃ subhāvitaṃ. Yaṃ kho pana kiñci pamāṇakataṃ kammaṃ, na taṃ tatrāvasissati na taṃ tatrāvatiṭṭhatī’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, daharatagge ce so ayaṃ kumāro upekkhaṃ cetovimuttiṃ bhāveyya, api nu kho pāpakammaṃ kareyyā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Akarontaṃ kho pana pāpakammaṃ api nu kho dukkhaṃ phuseyyā’’ti? ‘‘No hetaṃ, bhante. Akarontañhi, bhante, pāpakammaṃ kuto dukkhaṃ phusissatī’’ti! ‘‘Bhāvetabbā kho panāyaṃ, bhikkhave, upekkhā cetovimutti itthiyā vā purisena vā. Itthiyā vā, bhikkhave, purisassa vā nāyaṃ kāyo ādāya gamanīyo. Cittantaro ayaṃ, bhikkhave, macco. So evaṃ pajānāti – ‘yaṃ kho me idaṃ kiñci pubbe iminā karajakāyena pāpakammaṃ kataṃ, sabbaṃ taṃ idha vedanīyaṃ; na taṃ anugaṃ bhavissatī’ti. Evaṃ bhāvitā kho, bhikkhave, upekkhā cetovimutti anāgāmitāya saṃvattati, idha paññassa bhikkhuno uttari vimuttiṃ appaṭivijjhato’’ti. Navamaṃ.",
      "english": "“Bhikkhus, I do not declare the cessation of volitional actions that have been done and accumulated without experiencing their results, and that experience of results occurs either in this very life or in some other future existence. However, bhikkhus, I do not declare the making an end of suffering without experiencing the results of volitional actions that have been done and accumulated.\n\nThat noble disciple, bhikkhus, having thus abandoned covetousness, abandoned ill-will, unconfused, clearly comprehending, and mindful, dwells pervading one direction with a mind imbued with loving-kindness, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in every respect, the entire world, he dwells pervading with a mind imbued with loving-kindness, abundant, exalted, immeasurable, without hostility, without ill-will.\n\nHe understands thus: ‘Previously, this mind of mine was limited and undeveloped; but now this mind of mine is immeasurable and well-developed. Whatever action was limited, that does not remain there, it does not stand there.’\n\nWhat do you think, bhikkhus? If this young boy were to develop the liberation of mind through loving-kindness, would he commit evil actions?” “No, Venerable Sir.” “And if he were not to commit evil actions, would he experience suffering?” “No, Venerable Sir. For if he were not to commit evil actions, how could he experience suffering?”\n\n“Bhikkhus, this liberation of mind through loving-kindness should be developed by a woman or by a man. Bhikkhus, this body of a woman or a man is not to be taken along. Bhikkhus, this mortal being has the mind as his inner core. He understands thus: ‘Whatever evil action I have done previously with this body born of kamma, all that will be experienced right here; it will not follow me.’ Bhikkhus, such a well-developed liberation of mind through loving-kindness conduces to non-return, even for a wise bhikkhu who has not penetrated to a higher liberation in this very life.\n\nSimilarly, he dwells pervading with a mind imbued with compassion, likewise with appreciative joy, and likewise with a mind imbued with equanimity, pervading one direction, likewise the second, likewise the third, likewise the fourth. Thus, above, below, across, everywhere, in every respect, the entire world, he dwells pervading with a mind imbued with equanimity, abundant, exalted, immeasurable, without hostility, without ill-will.\n\nHe understands thus: ‘Previously, this mind of mine was limited and undeveloped; but now this mind of mine is immeasurable and well-developed. Whatever action was limited, that does not remain there, it does not stand there.’\n\nWhat do you think, bhikkhus? If this young boy were to develop the liberation of mind through equanimity, would he commit evil actions?” “No, Venerable Sir.” “And if he were not to commit evil actions, would he experience suffering?” “No, Venerable Sir. For if he were not to commit evil actions, how could he experience suffering?”\n\n“Bhikkhus, this liberation of mind through equanimity should be developed by a woman or by a man. Bhikkhus, this body of a woman or a man is not to be taken along. Bhikkhus, this mortal being has the mind as his inner core. He understands thus: ‘Whatever evil action I have done previously with this body born of kamma, all that will be experienced right here; it will not follow me.’ Bhikkhus, such a well-developed liberation of mind through equanimity conduces to non-return, even for a wise bhikkhu who has not penetrated to a higher liberation in this very life.”",
      "sinhala": "මහණෙනි, මම චේතනාවෙන් කරන ලද, රැස් කරන ලද කර්මයන්හි විපාක නොවිඳ අවසන් වන බවක් නොකියමි. එහෙත් ඒ විපාක විඳීම මේ ආත්ම භාවයේදී හෝ වෙනත් භවයකදී සිදුවිය හැකිය. එහෙත් මහණෙනි, චේතනාවෙන් කරන ලද, රැස් කරන ලද කර්මයන්හි විපාක නොවිඳ දුකෙහි කෙළවරක් වන බවක් මම නොකියමි.\n\nමහණෙනි, යම් ආර්ය ශ්‍රාවකයෙක් මෙසේ ලෝභයෙන් තොරව, ව්‍යාපාදයෙන් තොරව, මුළා නොවී, සිහි නුවණින් යුක්තව, සිහි කල්පනාවෙන් යුතුව, මෙත්තා සහගත සිතින් එක් දිශාවක් පැතිරී වාසය කරයි. එසේම දෙවැනි දිශාව, එසේම තෙවැනි දිශාව, එසේම සතරවැනි දිශාවද පැතිරී වාසය කරයි. මෙසේ ඉහළට, පහළට, හරහට, සෑම තැනම, සර්ව ආත්මභාවයකටම, මුළු ලෝකයම වෛරයෙන් තොරව, ව්‍යාපාදයෙන් තොරව, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, මෙත්තා සහගත සිතින් පැතිරී වාසය කරයි.\n\nඔහු මෙසේ අවබෝධ කරයි: 'ඉදින් පෙර මාගේ සිත කුඩා, නොවිකසිත එකක් විය. එහෙත් දැන් මාගේ සිත අප්‍රමාණ වූ, මැනවින් වඩන ලද්දකි. යම්කිසි සීමා සහිත කර්මයක් කරන ලද්දක් ඇත්නම්, එය දැන් එහි ඉතිරි නොවෙයි, එහි පිහිටා නොසිටියි.'\n\nමහණෙනි, ඔබලා මේ කුමක් සිතන්නහුද? යම් හෙයකින් මේ කුඩා දරුවෙක් මෙත්තා චේතෝවිමුක්තිය වඩන්නේ නම්, ඔහු පාප කර්මයක් කරයිද? නැත, භාග්‍යවතුන් වහන්ස. එසේ නම් පාප කර්මයක් නොකරන්නේ නම්, ඔහු දුකක් ස්පර්ශ කරයිද? නැත, භාග්‍යවතුන් වහන්ස. භාග්‍යවතුන් වහන්ස, පාප කර්මයක් නොකරන්නේ නම්, කොයින් නම් දුකක් ස්පර්ශ කරන්නේද!\n\nමහණෙනි, ස්ත්‍රියක් විසින් හෝ පුරුෂයෙක් විසින් හෝ මේ මෙත්තා චේතෝවිමුක්තිය භාවනා කළ යුත්තකි. මහණෙනි, ස්ත්‍රියකට හෝ පුරුෂයෙකුට හෝ මේ කය රැගෙන යාමට හැකියාවක් නැත. මහණෙනි, මේ මනුෂ්‍යයා සිත ප්‍රධාන කොට ඇත්තෙකි. ඔහු මෙසේ අවබෝධ කරයි: 'ඉදින් පෙර මා විසින් මේ කරජ කයින් යම්කිසි පාප කර්මයක් කරන ලද්දක් ඇත්නම්, ඒ සියල්ල මෙහිදී විඳ දමන්නට සිදුවන්නේය; එය මා පසුපස නොඑන්නේය.' මහණෙනි, මෙසේ වඩන ලද මෙත්තා චේතෝවිමුක්තිය, මේ ආත්ම භාවයේදී මීට වඩා උසස් විමුක්තියක් අවබෝධ නොකරන නුවණැති භික්ෂුවකට අනාගාමී භාවය පිණිස පවතින්නේය.\n\nකරුණා සහගත සිතින්... මුදිතා සහගත සිතින්... උපේක්ඛා සහගත සිතින් එක් දිශාවක් පැතිරී වාසය කරයි. එසේම දෙවැනි දිශාව, එසේම තෙවැනි දිශාව, එසේම සතරවැනි දිශාවද පැතිරී වාසය කරයි. මෙසේ ඉහළට, පහළට, හරහට, සෑම තැනම, සර්ව ආත්මභාවයකටම, මුළු ලෝකයම වෛරයෙන් තොරව, ව්‍යාපාදයෙන් තොරව, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ, උපේක්ඛා සහගත සිතින් පැතිරී වාසය කරයි.\n\nඔහු මෙසේ අවබෝධ කරයි: 'ඉදින් පෙර මාගේ සිත කුඩා, නොවිකසිත එකක් විය. එහෙත් දැන් මාගේ සිත අප්‍රමාණ වූ, මැනවින් වඩන ලද්දකි. යම්කිසි සීමා සහිත කර්මයක් කරන ලද්දක් ඇත්නම්, එය දැන් එහි ඉතිරි නොවෙයි, එහි පිහිටා නොසිටියි.'\n\nමහණෙනි, ඔබලා මේ කුමක් සිතන්නහුද? යම් හෙයකින් මේ කුඩා දරුවෙක් උපේක්ඛා චේතෝවිමුක්තිය වඩන්නේ නම්, ඔහු පාප කර්මයක් කරයිද? නැත, භාග්‍යවතුන් වහන්ස. එසේ නම් පාප කර්මයක් නොකරන්නේ නම්, ඔහු දුකක් ස්පර්ශ කරයිද? නැත, භාග්‍යවතුන් වහන්ස. භාග්‍යවතුන් වහන්ස, පාප කර්මයක් නොකරන්නේ නම්, කොයින් නම් දුකක් ස්පර්ශ කරන්නේද!\n\nමහණෙනි, ස්ත්‍රියක් විසින් හෝ පුරුෂයෙක් විසින් හෝ මේ උපේක්ඛා චේතෝවිමුක්තිය භාවනා කළ යුත්තකි. මහණෙනි, ස්ත්‍රියකට හෝ පුරුෂයෙකුට හෝ මේ කය රැගෙන යාමට හැකියාවක් නැත. මහණෙනි, මේ මනුෂ්‍යයා සිත ප්‍රධාන කොට ඇත්තෙකි. ඔහු මෙසේ අවබෝධ කරයි: 'ඉදින් පෙර මා විසින් මේ කරජ කයින් යම්කිසි පාප කර්මයක් කරන ලද්දක් ඇත්නම්, ඒ සියල්ල මෙහිදී විඳ දමන්නට සිදුවන්නේය; එය මා පසුපස නොඑන්නේය.' මහණෙනි, මෙසේ වඩන ලද උපේක්ඛා චේතෝවිමුක්තිය, මේ ආත්ම භාවයේදී මීට වඩා උසස් විමුක්තියක් අවබෝධ නොකරන නුවණැති භික්ෂුවකට අනාගාමී භාවය පිණිස පවතින්නේය.",
      "paliTitle": "Karajakāyasuttaṃ"
    },
    {
      "number": 220,
      "pali": "[a. ni. 2.16] Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu ko paccayo yenamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti? ‘‘Adhammacariyāvisamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti. ‘‘Ko pana, bho gotama, hetu ko paccayo yenamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti? ‘‘Dhammacariyāsamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti. ‘‘Na kho ahaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa vitthārena atthaṃ ājānāmi. Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathāhaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa vitthārena atthaṃ ājāneyya’’nti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho so brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Tividhā kho, brāhmaṇa, kāyena adhammacariyāvisamacariyā hoti; catubbidhā vācāya adhammacariyāvisamacariyā hoti; tividhā manasā adhammacariyāvisamacariyā hoti. ‘‘Kathañca, brāhmaṇa, tividhā kāyena adhammacariyāvisamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā kāyena adhammacariyā visamacariyā hoti. ‘‘Kathañca, brāhmaṇa, catubbidhā vācāya adhammacariyāvisamacariyā hoti…pe… evaṃ kho, brāhmaṇa, catubbidhā vācāya adhammacariyā visamacariyā hoti. ‘‘Kathañca, brāhmaṇa, tividhā manasā adhammacariyāvisamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā manasā adhammacariyāvisamacariyā hoti. Evaṃ adhammacariyāvisamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. ‘‘Tividhā brāhmaṇa, kāyena dhammacariyāsamacariyā hoti; catubbidhā vācāya dhammacariyāsamacariyā hoti; tividhā manasā dhammacariyāsamacariyā hoti. ‘‘Kathañca, brāhmaṇa, tividhā kāyena dhammacariyāsamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā kāyena dhammacariyāsamacariyā hoti. ‘‘Kathañca, brāhmaṇa, catubbidhā vācāya dhammacariyāsamacariyā hoti…pe… evaṃ kho, brāhmaṇa, catubbidhā vācāya dhammacariyāsamacariyā hoti. ‘‘Kathañca, brāhmaṇa, tividhā manasā dhammacariyāsamacariyā hoti…pe… evaṃ kho, brāhmaṇa, tividhā manasā dhammacariyāsamacariyā hoti. Evaṃ dhammacariyāsamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti. ‘‘Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. Dasamaṃ. ",
      "english": "Then a certain brahmin approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. When the courteous and memorable talk was concluded, he sat down to one side. As he sat to one side, that brahmin said to the Blessed One: \"What, Venerable Gotama, is the cause, what is the reason, by which some beings, upon the breakup of the body, after death, are reborn into a state of deprivation, a bad destination, a state of woe, into hell?\"\n\n\"It is due to unrighteous conduct and uneven conduct, brahmin, that some beings, upon the breakup of the body, after death, are reborn into a state of deprivation, a bad destination, a state of woe, into hell.\"\n\n\"And what, Venerable Gotama, is the cause, what is the reason, by which some beings, upon the breakup of the body, after death, are reborn into a good destination, a heavenly world?\"\n\n\"It is due to righteous conduct and even conduct, brahmin, that some beings, upon the breakup of the body, after death, are reborn into a good destination, a heavenly world.\"\n\n\"I do not understand the detailed meaning of this statement, Venerable Gotama, spoken in brief. It would be good if Venerable Gotama would teach me the Dhamma in such a way that I might understand the detailed meaning of this statement, spoken in brief, by Venerable Gotama.\"\n\n\"Then, brahmin, listen, pay close attention; I will speak,\" said the Blessed One. \"Yes, Venerable Sir,\" replied that brahmin to the Blessed One.\n\nThe Blessed One said: \"There are, brahmin, three kinds of unrighteous conduct and uneven conduct by body; four kinds of unrighteous conduct and uneven conduct by speech; and three kinds of unrighteous conduct and uneven conduct by mind. And how, brahmin, are there three kinds of unrighteous conduct and uneven conduct by body? ... Thus, brahmin, there are three kinds of unrighteous conduct and uneven conduct by body. And how, brahmin, are there four kinds of unrighteous conduct and uneven conduct by speech? ... Thus, brahmin, there are four kinds of unrighteous conduct and uneven conduct by speech. And how, brahmin, are there three kinds of unrighteous conduct and uneven conduct by mind? ... Thus, brahmin, there are three kinds of unrighteous conduct and uneven conduct by mind. It is in this way, brahmin, due to unrighteous conduct and uneven conduct, that some beings, upon the breakup of the body, after death, are reborn into a state of deprivation, a bad destination, a state of woe, into hell.\n\n\"There are, brahmin, three kinds of righteous conduct and even conduct by body; four kinds of righteous conduct and even conduct by speech; and three kinds of righteous conduct and even conduct by mind. And how, brahmin, are there three kinds of righteous conduct and even conduct by body? ... Thus, brahmin, there are three kinds of righteous conduct and even conduct by body. And how, brahmin, are there four kinds of righteous conduct and even conduct by speech? ... Thus, brahmin, there are four kinds of righteous conduct and even conduct by speech. And how, brahmin, are there three kinds of righteous conduct and even conduct by mind? ... Thus, brahmin, there are three kinds of righteous conduct and even conduct by mind. It is in this way, brahmin, due to righteous conduct and even conduct, that some beings, upon the breakup of the body, after death, are reborn into a good destination, a heavenly world.\"\n\n\"Excellent, Venerable Gotama! Excellent, Venerable Gotama! ... May Venerable Gotama accept me as a lay follower, who has gone for refuge from this day forth for as long as life lasts.\"",
      "sinhala": "එවිට එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහිපත් කළ යුතු කථා පවත්වා එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි ඒ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “භවත් ගෞතමයන් වහන්ස, මෙහි ඇතැම් සත්වයෝ ශරීරය බිඳී, මරණයෙන් පසු, අපාය, දුගති, විනිපාත නම් වූ නිරයෙහි උපදින්නාට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?”\n\n“බ්‍රාහ්මණය, අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම නිසාම මෙහි ඇතැම් සත්වයෝ ශරීරය බිඳී, මරණයෙන් පසු, අපාය, දුගති, විනිපාත නම් වූ නිරයෙහි උපදිත්.”\n\n“භවත් ගෞතමයන් වහන්ස, එසේනම් මෙහි ඇතැම් සත්වයෝ ශරීරය බිඳී, මරණයෙන් පසු, සුගති නම් වූ ස්වර්ග ලෝකයන්හි උපදින්නාට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?”\n\n“බ්‍රාහ්මණය, ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම නිසාම මෙහි ඇතැම් සත්වයෝ ශරීරය බිඳී, මරණයෙන් පසු, සුගති නම් වූ ස්වර්ග ලෝකයන්හි උපදිත්.”\n\n“භවත් ගෞතමයන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ අර්ථය විස්තර වශයෙන් මම නොදනිමි. භවත් ගෞතමයන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ අර්ථය විස්තර වශයෙන් මට අවබෝධ වන පරිදි ධර්මය දේශනා කරන්නේ නම් යහපත්ය.”\n\n“එසේ නම්, බ්‍රාහ්මණය, ශ්‍රවණය කරන්න. මනාව සිතට ගන්න. මම දේශනා කරන්නෙමි.” “එසේය, භවත් වහන්ස,” යැයි ඒ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය.\n\nභාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: “බ්‍රාහ්මණය, කයින් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වේ. වචනයෙන් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම සිව්වැදෑරුම් වේ. මනසින් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වේ.”\n\n“බ්‍රාහ්මණය, කයින් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වන්නේ කෙසේද? මෙසේ බ්‍රාහ්මණය, කයින් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වේ. බ්‍රාහ්මණය, වචනයෙන් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම සිව්වැදෑරුම් වන්නේ කෙසේද? මෙසේ බ්‍රාහ්මණය, වචනයෙන් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම සිව්වැදෑරුම් වේ. බ්‍රාහ්මණය, මනසින් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වන්නේ කෙසේද? මෙසේ බ්‍රාහ්මණය, මනසින් අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වේ. මෙසේ අධර්මය අනුව ක්‍රියා කිරීම හා විෂම වූ ක්‍රියා කිරීම නිසාම බ්‍රාහ්මණය, මෙහි ඇතැම් සත්වයෝ ශරීරය බිඳී, මරණයෙන් පසු, අපාය, දුගති, විනිපාත නම් වූ නිරයෙහි උපදිත්.”\n\n“බ්‍රාහ්මණය, කයින් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වේ. වචනයෙන් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම සිව්වැදෑරුම් වේ. මනසින් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වේ.”\n\n“බ්‍රාහ්මණය, කයින් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වන්නේ කෙසේද? මෙසේ බ්‍රාහ්මණය, කයින් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වේ. බ්‍රාහ්මණය, වචනයෙන් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම සිව්වැදෑරුම් වන්නේ කෙසේද? මෙසේ බ්‍රාහ්මණය, වචනයෙන් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම සිව්වැදෑරුම් වේ. බ්‍රාහ්මණය, මනසින් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වන්නේ කෙසේද? මෙසේ බ්‍රාහ්මණය, මනසින් ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම තෙවැදෑරුම් වේ. මෙසේ ධර්මය අනුව ක්‍රියා කිරීම හා සම වූ ක්‍රියා කිරීම නිසාම බ්‍රාහ්මණය, මෙහි ඇතැම් සත්වයෝ ශරීරය බිඳී, මරණයෙන් පසු, සුගති නම් වූ ස්වර්ග ලෝකයන්හි උපදිත්.”\n\n“භවත් ගෞතමයන් වහන්ස, ඉතා යහපත්ය! භවත් ගෞතමයන් වහන්ස, ඉතා යහපත්ය! භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් තෙරුවන් සරණ ගිය උපාසකයකු ලෙස මා පිළිගන්නා සේක්වා.”",
      "paliTitle": "Adhammacariyāsuttaṃ"
    }
  ],
  "footer": {
    "pali": "Karajakāyavaggo paṭhamo.",
    "english": "",
    "sinhala": ""
  }
}