{
  "id": "an10.7",
  "title": {
    "pali": "Yamakavaggo",
    "english": "The Twin Verses",
    "sinhala": "යමක වග්ගය"
  },
  "sections": [
    {
      "number": 61,
      "pali": "‘‘Purimā, bhikkhave, koṭi na paññāyati avijjāya – ‘ito pubbe avijjā nāhosi, atha pacchā samabhavī’ti. Evañcetaṃ, bhikkhave, vuccati, atha ca pana paññāyati – ‘idappaccayā avijjā’ti. ‘‘Avijjampāhaṃ [avijjampahaṃ (sī. syā.)], bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro avijjāya? ‘Pañca nīvaraṇā’tissa vacanīyaṃ. Pañcapāhaṃ, bhikkhave, nīvaraṇe sāhāre vadāmi, no anāhāre. Ko cāhāro pañcannaṃ nīvaraṇānaṃ? ‘Tīṇi duccaritānī’tissa vacanīyaṃ. Tīṇipāhaṃ, bhikkhave, duccaritāni sāhārāni vadāmi, no anāhārāni. Ko cāhāro tiṇṇaṃ duccaritānaṃ? ‘Indriyaasaṃvaro’tissa vacanīyaṃ. Indriyaasaṃvarampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro indriyaasaṃvarassa? ‘Asatāsampajañña’ntissa vacanīyaṃ. Asatāsampajaññampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro asatāsampajaññassa? ‘Ayonisomanasikāro’tissa vacanīyaṃ. Ayonisomanasikārampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro ayonisomanasikārassa? ‘Assaddhiya’ntissa vacanīyaṃ. Assaddhiyampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro assaddhiyassa? ‘Asaddhammassavana’ntissa vacanīyaṃ. Asaddhammassavanampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro asaddhammassavanassa? ‘Asappurisasaṃsevo’tissa vacanīyaṃ. ‘‘Iti kho, bhikkhave, asappurisasaṃsevo paripūro asaddhammassavanaṃ paripūreti, asaddhammassavanaṃ paripūraṃ assaddhiyaṃ paripūreti, assaddhiyaṃ paripūraṃ ayonisomanasikāraṃ paripūreti, ayonisomanasikāro paripūro asatāsampajaññaṃ paripūreti, asatāsampajaññaṃ paripūraṃ indriyaasaṃvaraṃ paripūreti, indriyaasaṃvaro paripūro tīṇi duccaritāni paripūreti, tīṇi duccaritāni paripūrāni pañca nīvaraṇe paripūrenti, pañca nīvaraṇā paripūrā avijjaṃ paripūrenti. Evametissā avijjāya āhāro hoti, evañca pāripūri. ‘‘Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante ( ) [(galagalāyante) (sī.), (gaḷagaḷāyante) (syā.)] taṃ udakaṃ yathāninnaṃ pavattamānaṃ pabbatakandarapadarasākhā paripūreti, pabbatakandarapadarasākhā paripūrā kusobbhe [kussubbhe (sī.), kusubbhe (syā.), kusombhe (ka.) a. ni. 3.96] paripūrenti. Kusobbhā paripūrā mahāsobbhe [mahāsombhe (ka.)] paripūrenti, mahāsobbhā paripūrā kunnadiyo paripūrenti, kunnadiyo paripūrā mahānadiyo paripūrenti, mahānadiyo paripūrā mahāsamuddaṃ sāgaraṃ paripūrenti; evametassa mahāsamuddassa sāgarassa āhāro hoti, evañca pāripūri. ‘‘Evamevaṃ kho, bhikkhave, asappurisasaṃsevo paripūro asaddhammassavanaṃ paripūreti, asaddhammassavanaṃ paripūraṃ assaddhiyaṃ paripūreti, assaddhiyaṃ paripūraṃ ayonisomanasikāraṃ paripūreti, ayonisomanasikāro paripūro asatāsampajaññaṃ paripūreti, asatāsampajaññaṃ paripūraṃ indriyaasaṃvaraṃ paripūreti, indriyaasaṃvaro paripūro tīṇi duccaritāni paripūreti, tīṇi duccaritāni paripūrāni pañca nīvaraṇe paripūrenti, pañca nīvaraṇā paripūrā avijjaṃ paripūrenti; evametissā avijjāya āhāro hoti, evañca pāripūri. ‘‘Vijjāvimuttimpāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro vijjāvimuttiyā? ‘Satta bojjhaṅgā’tissa vacanīyaṃ. Sattapāhaṃ, bhikkhave, bojjhaṅge sāhāre vadāmi, no anāhāre. Ko cāhāro sattannaṃ bojjhaṅgānaṃ? ‘Cattāro satipaṭṭhānā’tissa vacanīyaṃ. Cattāropāhaṃ, bhikkhave, satipaṭṭhāne sāhāre vadāmi, no anāhāre. Ko cāhāro catunnaṃ satipaṭṭhānānaṃ? ‘Tīṇi sucaritānī’tissa vacanīyaṃ. Tīṇipāhaṃ, bhikkhave, sucaritāni sāhārāni vadāmi, no anāhārāni. Ko cāhāro tiṇṇaṃ sucaritānaṃ? ‘Indriyasaṃvaro’tissa vacanīyaṃ. Indriyasaṃvarampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro indriyasaṃvarassa? ‘Satisampajañña’ntissa vacanīyaṃ. Satisampajaññampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro satisampajaññassa? ‘Yonisomanasikāro’tissa vacanīyaṃ. Yonisomanasikārampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro yonisomanasikārassa? ‘Saddhā’tissa vacanīyaṃ. Saddhampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro saddhāya? ‘Saddhammassavana’ntissa vacanīyaṃ. Saddhammassavanampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro saddhammassavanassa? ‘Sappurisasaṃsevo’tissa vacanīyaṃ. ‘‘Iti kho, bhikkhave, sappurisasaṃsevo paripūro saddhammassavanaṃ paripūreti, saddhammassavanaṃ paripūraṃ saddhaṃ paripūreti, saddhā paripūrā yonisomanasikāraṃ paripūreti, yonisomanasikāro paripūro satisampajaññaṃ paripūreti, satisampajaññaṃ paripūraṃ indriyasaṃvaraṃ paripūreti, indriyasaṃvaro paripūro tīṇi sucaritāni paripūreti, tīṇi sucaritāni paripūrāni cattāro satipaṭṭhāne paripūrenti, cattāro satipaṭṭhānā paripūrā satta bojjhaṅge paripūrenti, satta bojjhaṅgā paripūrā vijjāvimuttiṃ paripūrenti; evametissā vijjāvimuttiyā āhāro hoti, evañca pāripūri. ‘‘Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante taṃ udakaṃ yathāninnaṃ pavattamānaṃ pabbatakandarapadarasākhā paripūreti, pabbatakandarapadarasākhā paripūrā kusobbhe paripūrenti, kusobbhā paripūrā mahāsobbhe paripūrenti, mahāsobbhā paripūrā kunnadiyo paripūrenti, kunnadiyo paripūrā mahānadiyo paripūrenti, mahānadiyo paripūrā mahāsamuddaṃ sāgaraṃ paripūrenti; evametassa mahāsamuddassa sāgarassa āhāro hoti, evañca pāripūri. ‘‘Evamevaṃ kho, bhikkhave, sappurisasaṃsevo paripūro saddhammassavanaṃ paripūreti, saddhammassavanaṃ paripūraṃ saddhaṃ paripūreti, saddhā paripūrā yonisomanasikāraṃ paripūreti, yonisomanasikāro paripūro satisampajaññaṃ paripūreti, satisampajaññaṃ paripūraṃ indriyasaṃvaraṃ paripūreti, indriyasaṃvaro paripūro tīṇi sucaritāni paripūreti, tīṇi sucaritāni paripūrāni cattāro satipaṭṭhāne paripūrenti, cattāro satipaṭṭhānā paripūrā satta bojjhaṅge paripūrenti, satta bojjhaṅgā paripūrā vijjāvimuttiṃ paripūrenti; evametissā vijjāvimuttiyā āhāro hoti, evañca pāripūrī’’ti. Paṭhamaṃ.",
      "english": "Monks, the prior limit of ignorance is not to be discerned – that ‘before this, ignorance did not exist, and then it later came into being.’ Although this is said, monks, it is still discernible that ‘ignorance has a supporting condition.’ I say, monks, that ignorance has a nutriment, not that it is without nutriment. And what is the nutriment for ignorance? It should be said: ‘The five hindrances.’ I say, monks, that the five hindrances have a nutriment, not that they are without nutriment. And what is the nutriment for the five hindrances? It should be said: ‘The three bad deeds.’ I say, monks, that the three bad deeds have a nutriment, not that they are without nutriment. And what is the nutriment for the three bad deeds? It should be said: ‘Lack of restraint of the senses.’ I say, monks, that lack of restraint of the senses has a nutriment, not that it is without nutriment. And what is the nutriment for lack of restraint of the senses? It should be said: ‘Lack of mindfulness and clear comprehension.’ I say, monks, that lack of mindfulness and clear comprehension has a nutriment, not that it is without nutriment. And what is the nutriment for lack of mindfulness and clear comprehension? It should be said: ‘Unwise attention.’ I say, monks, that unwise attention has a nutriment, not that it is without nutriment. And what is the nutriment for unwise attention? It should be said: ‘Lack of faith.’ I say, monks, that lack of faith has a nutriment, not that it is without nutriment. And what is the nutriment for lack of faith? It should be said: ‘Not listening to the True Dhamma.’ I say, monks, that not listening to the True Dhamma has a nutriment, not that it is without nutriment. And what is the nutriment for not listening to the True Dhamma? It should be said: ‘Association with ignoble people.’\n\nThus, monks, when association with ignoble people is complete, it completes not listening to the True Dhamma; when not listening to the True Dhamma is complete, it completes lack of faith; when lack of faith is complete, it completes unwise attention; when unwise attention is complete, it completes lack of mindfulness and clear comprehension; when lack of mindfulness and clear comprehension is complete, it completes lack of restraint of the senses; when lack of restraint of the senses is complete, it completes the three bad deeds; when the three bad deeds are complete, they complete the five hindrances; when the five hindrances are complete, they complete ignorance. This is how ignorance has its nutriment, and this is how it comes to completion.\n\nJust as, monks, when heavy raindrops fall on the top of a mountain, that water, flowing down according to the slope, fills up the mountain caves, fissures, and gullies; when the mountain caves, fissures, and gullies are full, they fill up the small pools; when the small pools are full, they fill up the large pools; when the large pools are full, they fill up the small rivers; when the small rivers are full, they fill up the great rivers; when the great rivers are full, they fill up the great ocean; this is how the great ocean has its nutriment, and this is how it comes to completion.\n\nIn the same way, monks, when association with ignoble people is complete, it completes not listening to the True Dhamma; when not listening to the True Dhamma is complete, it completes lack of faith; when lack of faith is complete, it completes unwise attention; when unwise attention is complete, it completes lack of mindfulness and clear comprehension; when lack of mindfulness and clear comprehension is complete, it completes lack of restraint of the senses; when lack of restraint of the senses is complete, it completes the three bad deeds; when the three bad deeds are complete, they complete the five hindrances; when the five hindrances are complete, they complete ignorance. This is how ignorance has its nutriment, and this is how it comes to completion.\n\nI say, monks, that liberation through true knowledge has a nutriment, not that it is without nutriment. And what is the nutriment for liberation through true knowledge? It should be said: ‘The seven factors of awakening.’ I say, monks, that the seven factors of awakening have a nutriment, not that they are without nutriment. And what is the nutriment for the seven factors of awakening? It should be said: ‘The four establishments of mindfulness.’ I say, monks, that the four establishments of mindfulness have a nutriment, not that they are without nutriment. And what is the nutriment for the four establishments of mindfulness? It should be said: ‘The three good deeds.’ I say, monks, that the three good deeds have a nutriment, not that they are without nutriment. And what is the nutriment for the three good deeds? It should be said: ‘Restraint of the senses.’ I say, monks, that restraint of the senses has a nutriment, not that it is without nutriment. And what is the nutriment for restraint of the senses? It should be said: ‘Mindfulness and clear comprehension.’ I say, monks, that mindfulness and clear comprehension has a nutriment, not that it is without nutriment. And what is the nutriment for mindfulness and clear comprehension? It should be said: ‘Wise attention.’ I say, monks, that wise attention has a nutriment, not that it is without nutriment. And what is the nutriment for wise attention? It should be said: ‘Faith.’ I say, monks, that faith has a nutriment, not that it is without nutriment. And what is the nutriment for faith? It should be said: ‘Listening to the True Dhamma.’ I say, monks, that listening to the True Dhamma has a nutriment, not that it is without nutriment. And what is the nutriment for listening to the True Dhamma? It should be said: ‘Association with noble people.’\n\nThus, monks, the association with noble people, when brought to full completion, brings to full completion the listening to the true Dhamma. The listening to the true Dhamma, when brought to full completion, brings to full completion faith. Faith, when brought to full completion, brings to full completion wise attention. Wise attention, when brought to full completion, brings to full completion mindfulness and clear comprehension. Mindfulness and clear comprehension, when brought to full completion, brings to full completion the restraint of the senses. The restraint of the senses, when brought to full completion, brings to full completion the threefold good conduct. The threefold good conduct, when brought to full completion, brings to full completion the four foundations of mindfulness. The four foundations of mindfulness, when brought to full completion, bring to full completion the seven factors of awakening. The seven factors of awakening, when brought to full completion, bring to full completion true knowledge and liberation. Thus, this is the nourishment for true knowledge and liberation, and this is its full completion.\n\nJust as, monks, when thick clouds rain heavily on the mountaintop, that water, flowing down according to the slope, fills the mountain clefts, crevices, and ravines. The mountain clefts, crevices, and ravines, when full, fill the small pools. The small pools, when full, fill the large pools. The large pools, when full, fill the small rivers. The small rivers, when full, fill the great rivers. The great rivers, when full, fill the mighty ocean. Thus, this is the nourishment for the mighty ocean, and this is its full completion.\n\nEven so, monks, the association with noble people, when brought to full completion, brings to full completion the listening to the true Dhamma. The listening to the true Dhamma, when brought to full completion, brings to full completion faith. Faith, when brought to full completion, brings to full completion wise attention. Wise attention, when brought to full completion, brings to full completion mindfulness and clear comprehension. Mindfulness and clear comprehension, when brought to full completion, brings to full completion the restraint of the senses. The restraint of the senses, when brought to full completion, brings to full completion the threefold good conduct. The threefold good conduct, when brought to full completion, brings to full completion the four foundations of mindfulness. The four foundations of mindfulness, when brought to full completion, bring to full completion the seven factors of awakening. The seven factors of awakening, when brought to full completion, bring to full completion true knowledge and liberation. Thus, this is the nourishment for true knowledge and liberation, and this is its full completion.",
      "sinhala": "භික්ෂූනි, අවිද්‍යාවේ පූර්ව කෙළවර නොපැනේ. ‘මෙයට පෙර අවිද්‍යාව නොවීය, පසුව හටගත්තේය’ කියා. භික්ෂූනි, මෙසේ කියනු ලැබුවද, ‘මේ ප්‍රත්‍යයෙන් අවිද්‍යාව ඇතිවෙයි’ කියා පැනේ.\n\nභික්ෂූනි, මම අවිද්‍යාවද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. අවිද්‍යාවේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘පංච නීවරණ’ යැයි කිවයුතුය. භික්ෂූනි, මම පංච නීවරණද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. පංච නීවරණවල ආහාරය (ප්‍රත්‍යය) කවරේද? ‘දුශ්චරිත තුන’ යැයි කිවයුතුය. භික්ෂූනි, මම දුශ්චරිත තුනද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. දුශ්චරිත තුනේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘ඉන්ද්‍රිය අසංවරය’ යැයි කිවයුතුය. භික්ෂූනි, මම ඉන්ද්‍රිය අසංවරයද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. ඉන්ද්‍රිය අසංවරයේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘අසති අසම්පජඤ්ඤය’ යැයි කිවයුතුය. භික්ෂූනි, මම අසති අසම්පජඤ්ඤයද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. අසති අසම්පජඤ්ඤයේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘අයෝනිසෝ මනසිකාරය’ යැයි කිවයුතුය. භික්ෂූනි, මම අයෝනිසෝ මනසිකාරයද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. අයෝනිසෝ මනසිකාරයේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘අශ්‍රද්ධාව’ යැයි කිවයුතුය. භික්ෂූනි, මම අශ්‍රද්ධාවද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. අශ්‍රද්ධාවේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘අසද්ධර්ම ශ්‍රවණය’ යැයි කිවයුතුය. භික්ෂූනි, මම අසද්ධර්ම ශ්‍රවණයද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. අසද්ධර්ම ශ්‍රවණයේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘අසත්පුරුෂ සේවනය’ යැයි කිවයුතුය.\n\nභික්ෂූනි, මෙසේ අසත්පුරුෂ සේවනය පිරී අසද්ධර්ම ශ්‍රවණය සම්පූර්ණ කරයි. අසද්ධර්ම ශ්‍රවණය සම්පූර්ණව අශ්‍රද්ධාව සම්පූර්ණ කරයි. අශ්‍රද්ධාව සම්පූර්ණව අයෝනිසෝ මනසිකාරය සම්පූර්ණ කරයි. අයෝනිසෝ මනසිකාරය සම්පූර්ණව අසති අසම්පජඤ්ඤය සම්පූර්ණ කරයි. අසති අසම්පජඤ්ඤය සම්පූර්ණව ඉන්ද්‍රිය අසංවරය සම්පූර්ණ කරයි. ඉන්ද්‍රිය අසංවරය සම්පූර්ණව දුශ්චරිත තුන සම්පූර්ණ කරයි. දුශ්චරිත තුන සම්පූර්ණව පංච නීවරණ සම්පූර්ණ කරයි. පංච නීවරණ සම්පූර්ණව අවිද්‍යාව සම්පූර්ණ කරයි. මෙසේ මේ අවිද්‍යාවට ආහාරය (ප්‍රත්‍යය) වන්නේය, මෙසේ සම්පූර්ණවීමද වන්නේය.\n\nභික්ෂූනි, යම්සේ පර්වතයක් මත අධිකව වැසි වසින කල්හි, ඒ ජලය පහළ බිමට ගලා යමින් පර්වත කුහර, භේදය වූ ස්ථාන සහ අතු ගංගා සම්පූර්ණ කරයි. පර්වත කුහර, භේදය වූ ස්ථාන සහ අතු ගංගා සම්පූර්ණව කුඩා දිය කඩිති සම්පූර්ණ කරයි. කුඩා දිය කඩිති සම්පූර්ණව මහ දිය කඩිති සම්පූර්ණ කරයි. මහ දිය කඩිති සම්පූර්ණව කුඩා ගංගා සම්පූර්ණ කරයි. කුඩා ගංගා සම්පූර්ණව මහ ගංගා සම්පූර්ණ කරයි. මහ ගංගා සම්පූර්ණව මහා සාගරය, මුහුද සම්පූර්ණ කරයි. මෙසේ මේ මහා සාගරයට, මුහුදට ආහාරය (ප්‍රත්‍යය) වන්නේය, මෙසේ සම්පූර්ණවීමද වන්නේය.\n\nභික්ෂූනි, එසේම අසත්පුරුෂ සේවනය පිරී අසද්ධර්ම ශ්‍රවණය සම්පූර්ණ කරයි. අසද්ධර්ම ශ්‍රවණය සම්පූර්ණව අශ්‍රද්ධාව සම්පූර්ණ කරයි. අශ්‍රද්ධාව සම්පූර්ණව අයෝනිසෝ මනසිකාරය සම්පූර්ණ කරයි. අයෝනිසෝ මනසිකාරය සම්පූර්ණව අසති අසම්පජඤ්ඤය සම්පූර්ණ කරයි. අසති අසම්පජඤ්ඤය සම්පූර්ණව ඉන්ද්‍රිය අසංවරය සම්පූර්ණ කරයි. ඉන්ද්‍රිය අසංවරය සම්පූර්ණව දුශ්චරිත තුන සම්පූර්ණ කරයි. දුශ්චරිත තුන සම්පූර්ණව පංච නීවරණ සම්පූර්ණ කරයි. පංච නීවරණ සම්පූර්ණව අවිද්‍යාව සම්පූර්ණ කරයි. මෙසේ මේ අවිද්‍යාවට ආහාරය (ප්‍රත්‍යය) වන්නේය, මෙසේ සම්පූර්ණවීමද වන්නේය.\n\nභික්ෂූනි, මම විද්‍යා විමුක්තියද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. විද්‍යා විමුක්තියේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘සප්ත බොජ්ඣංග’ යැයි කිවයුතුය. භික්ෂූනි, මම සප්ත බොජ්ඣංගද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. සප්ත බොජ්ඣංගවල ආහාරය (ප්‍රත්‍යය) කවරේද? ‘සතර සතිපට්ඨාන’ යැයි කිවයුතුය. භික්ෂූනි, මම සතර සතිපට්ඨානද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. සතර සතිපට්ඨානවල ආහාරය (ප්‍රත්‍යය) කවරේද? ‘සුචරිත තුන’ යැයි කිවයුතුය. භික්ෂූනි, මම සුචරිත තුනද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. සුචරිත තුනේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘ඉන්ද්‍රිය සංවරය’ යැයි කිවයුතුය. භික්ෂූනි, මම ඉන්ද්‍රිය සංවරයද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. ඉන්ද්‍රිය සංවරයේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘සති සම්පජඤ්ඤය’ යැයි කිවයුතුය. භික්ෂූනි, මම සති සම්පජඤ්ඤයද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. සති සම්පජඤ්ඤයේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘යෝනිසෝ මනසිකාරය’ යැයි කිවයුතුය. භික්ෂූනි, මම යෝනිසෝ මනසිකාරයද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. යෝනිසෝ මනසිකාරයේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘ශ්‍රද්ධාව’ යැයි කිවයුතුය. භික්ෂූනි, මම ශ්‍රද්ධාවද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. ශ්‍රද්ධාවේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘සද්ධර්ම ශ්‍රවණය’ යැයි කිවයුතුය. භික්ෂූනි, මම සද්ධර්ම ශ්‍රවණයද ආසහිත කොට පවසමි, ආහාර රහිතව නොපවසමි. සද්ධර්ම ශ්‍රවණයේ ආහාරය (ප්‍රත්‍යය) කවරේද? ‘සත්පුරුෂ සේවනය’ යැයි කිවයුතුය.\n\n‘‘මහණෙනි, මෙසේ සත්පුරුෂ සේවනය සම්පූර්ණ වීමෙන් සද්ධර්ම ශ්‍රවණය සම්පූර්ණ වේ. සද්ධර්ම ශ්‍රවණය සම්පූර්ණ වීමෙන් ශ්‍රද්ධාව සම්පූර්ණ වේ. ශ්‍රද්ධාව සම්පූර්ණ වීමෙන් යෝනිසෝමනසිකාරය සම්පූර්ණ වේ. යෝනිසෝමනසිකාරය සම්පූර්ණ වීමෙන් සතිසම්පජඤ්ඤය සම්පූර්ණ වේ. සතිසම්පජඤ්ඤය සම්පූර්ණ වීමෙන් ඉන්ද්‍රිය සංවරය සම්පූර්ණ වේ. ඉන්ද්‍රිය සංවරය සම්පූර්ණ වීමෙන් තිදොරින් සිදුකරන සුචරිතය සම්පූර්ණ වේ. තිදොරින් සිදුකරන සුචරිතය සම්පූර්ණ වීමෙන් සිව් සතිපට්ඨානයන් සම්පූර්ණ වේ. සිව් සතිපට්ඨානයන් සම්පූර්ණ වීමෙන් සප්ත බෝජ්ඣංගයන් සම්පූර්ණ වේ. සප්ත බෝජ්ඣංගයන් සම්පූර්ණ වීමෙන් විජ්ජා විමුක්තිය සම්පූර්ණ වේ. මෙසේ මේ විජ්ජා විමුක්තියට ආහාරය වේ, මෙසේ සම්පූර්ණ වේ.\n\n‘‘මහණෙනි, යම්සේ පර්වත මුදුනෙහි මහ වැසි වසින කල්හි ඒ ජලය පහත් තැන් කරා ගලා බසිමින් පර්වත කුහර, පැලුම් හා ගල්පතුරු පිරවීමට හේතු වේ. පර්වත කුහර, පැලුම් හා ගල්පතුරු පිරුණ කල කුඩා දිය කඩිති පිරවීමට හේතු වේ. කුඩා දිය කඩිති පිරුණ කල මහ දිය කඩිති පිරවීමට හේතු වේ. මහ දිය කඩිති පිරුණ කල කුඩා ගංගා පිරවීමට හේතු වේ. කුඩා ගංගා පිරුණ කල මහ ගංගා පිරවීමට හේතු වේ. මහ ගංගා පිරුණ කල මහ සාගරය පිරවීමට හේතු වේ. මෙසේ මේ මහ සාගරයට ආහාරය වේ, මෙසේ සම්පූර්ණ වේ.\n\n‘‘මහණෙනි, එපරිද්දෙන්ම සත්පුරුෂ සේවනය සම්පූර්ණ වීමෙන් සද්ධර්ම ශ්‍රවණය සම්පූර්ණ වේ. සද්ධර්ම ශ්‍රවණය සම්පූර්ණ වීමෙන් ශ්‍රද්ධාව සම්පූර්ණ වේ. ශ්‍රද්ධාව සම්පූර්ණ වීමෙන් යෝනිසෝමනසිකාරය සම්පූර්ණ වේ. යෝනිසෝමනසිකාරය සම්පූර්ණ වීමෙන් සතිසම්පජඤ්ඤය සම්පූර්ණ වේ. සතිසම්පජඤ්ඤය සම්පූර්ණ වීමෙන් ඉන්ද්‍රිය සංවරය සම්පූර්ණ වේ. ඉන්ද්‍රිය සංවරය සම්පූර්ණ වීමෙන් තිදොරින් සිදුකරන සුචරිතය සම්පූර්ණ වේ. තිදොරින් සිදුකරන සුචරිතය සම්පූර්ණ වීමෙන් සිව් සතිපට්ඨානයන් සම්පූර්ණ වේ. සිව් සතිපට්ඨානයන් සම්පූර්ණ වීමෙන් සප්ත බෝජ්ඣංගයන් සම්පූර්ණ වේ. සප්ත බෝජ්ඣංගයන් සම්පූර්ණ වීමෙන් විජ්ජා විමුක්තිය සම්පූර්ණ වේ. මෙසේ මේ විජ්ජා විමුක්තියට ආහාරය වේ, මෙසේ සම්පූර්ණ වේ.",
      "paliTitle": "Avijjāsuttaṃ",
      "englishTitle": "Discourse on Ignorance",
      "sinhalaTitle": "අවිජ්ජා සූත්‍රය"
    },
    {
      "number": 62,
      "pali": "‘‘Purimā, bhikkhave, koṭi na paññāyati bhavataṇhāya – ‘ito pubbe bhavataṇhā nāhosi, atha pacchā samabhavī’ti. Evañcetaṃ, bhikkhave, vuccati, atha ca pana paññāyati – ‘idappaccayā bhavataṇhā’ti. ‘‘Bhavataṇhāmpāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro bhavataṇhāya? ‘Avijjā’tissa vacanīyaṃ. Avijjampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro avijjāya? ‘Pañca nīvaraṇā’tissa vacanīyaṃ. Pañca nīvaraṇepāhaṃ, bhikkhave, sāhāre vadāmi, no anāhāre. Ko cāhāro pañcannaṃ nīvaraṇānaṃ? ‘Tīṇi duccaritānī’tissa vacanīyaṃ. Tīṇipāhaṃ, bhikkhave, duccaritāni sāhārāni vadāmi, no anāhārāni. Ko cāhāro tiṇṇannaṃ duccaritānaṃ? ‘Indriyaasaṃvaro’tissa vacanīyaṃ. Indriyaasaṃvarampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro indriyaasaṃvarassa? ‘Asatāsampajañña’ntissa vacanīyaṃ. Asatāsampajaññampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro asatā sampajaññassa? ‘Ayonisomanasikāro’tissa vacanīyaṃ. Ayonisomanasikārampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro ayonisomanasikārassa? ‘Assaddhiya’ntissa vacanīyaṃ. Assaddhiyampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro assaddhiyassa? ‘Assaddhammassavana’ntissa vacanīyaṃ. Assaddhammassavanampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro assaddhammassavanassa? ‘Asappurisasaṃsevo’tissa vacanīyaṃ. ‘‘Iti kho, bhikkhave, asappurisasaṃsevo paripūro assaddhammassavanaṃ paripūreti, assaddhammassavanaṃ paripūraṃ assaddhiyaṃ paripūreti, assaddhiyaṃ paripūraṃ ayonisomanasikāraṃ paripūreti, ayonisomanasikāro paripūro asatāsampajaññaṃ paripūreti, asatāsampajaññaṃ paripūraṃ indriyaasaṃvaraṃ paripūreti, indriyaasaṃvaro paripūro tīṇi duccaritāni paripūreti, tīṇi duccaritāni paripūrāni pañca nīvaraṇe paripūrenti, pañca nīvaraṇā paripūrā avijjaṃ paripūrenti, avijjā paripūrā bhavataṇhaṃ paripūreti; evametissā bhavataṇhāya āhāro hoti, evañca pāripūri. ‘‘Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante taṃ udakaṃ yathāninnaṃ pavattamānaṃ pabbatakandarapadarasākhā paripūreti, pabbatakandarapadarasākhā paripūrā kusobbhe paripūrenti, kusobbhā paripūrā mahāsobbhe paripūrenti, mahāsobbhā paripūrā kunnadiyo paripūrenti, kunnadiyo paripūrā mahānadiyo paripūrenti, mahānadiyo paripūrā mahāsamuddaṃ sāgaraṃ paripūrenti; evametassa mahāsamuddassa sāgarassa āhāro hoti, evañca pāripūri. ‘‘Evamevaṃ kho, bhikkhave, asappurisasaṃsevo paripūro assaddhammassavanaṃ paripūreti, assaddhammassavanaṃ paripūraṃ assaddhiyaṃ paripūreti, assaddhiyaṃ paripūraṃ ayonisomanasikāraṃ paripūreti, ayonisomanasikāro paripūro asatāsampajaññaṃ paripūreti, asatāsampajaññaṃ paripūraṃ indriyaasaṃvaraṃ paripūreti, indriyaasaṃvaro paripūro tīṇi duccaritāni paripūreti, tīṇi duccaritāni paripūrāni pañca nīvaraṇe paripūrenti, pañca nīvaraṇā paripūrā avijjaṃ paripūrenti, avijjā paripūrā bhavataṇhaṃ paripūreti; evametissā bhavataṇhāya āhāro hoti, evañca pāripūri. ‘‘Vijjāvimuttimpāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro vijjāvimuttiyā? ‘Satta bojjhaṅgā’tissa vacanīyaṃ. Sattapāhaṃ, bhikkhave, bojjhaṅge sāhāre vadāmi, no anāhāre. Ko cāhāro sattannaṃ bojjhaṅgānaṃ? ‘Cattāro satipaṭṭhānā’tissa vacanīyaṃ. Cattāropāhaṃ, bhikkhave, satipaṭṭhāne sāhāre vadāmi, no anāhāre. Ko cāhāro catunnaṃ satipaṭṭhānānaṃ? ‘Tīṇi sucaritānī’tissa vacanīyaṃ. Tīṇipāhaṃ, bhikkhave, sucaritāni sāhārāni vadāmi, no anāhārāni. Ko cāhāro tiṇṇannaṃ sucaritānaṃ? ‘Indriyasaṃvaro’tissa vacanīyaṃ. Indriyasaṃvarampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro indriyasaṃvarassa? ‘Satisampajañña’ntissa vacanīyaṃ. Satisampajaññampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro satisampajaññassa? ‘Yonisomanasikāro’tissa vacanīyaṃ. Yonisomanasikārampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro yonisomanasikārassa? ‘Saddhā’tissa vacanīyaṃ. Saddhampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro saddhāya? ‘Saddhammassavana’ntissa vacanīyaṃ. Saddhammassavanampāhaṃ, bhikkhave, sāhāraṃ vadāmi, no anāhāraṃ. Ko cāhāro saddhammassavanassa? ‘Sappurisasaṃsevo’tissa vacanīyaṃ. ‘‘Iti kho, bhikkhave, sappurisasaṃsevo paripūro saddhammassavanaṃ paripūreti, saddhammassavanaṃ paripūraṃ saddhaṃ paripūreti, saddhā paripūrā yonisomanasikāraṃ paripūreti, yonisomanasikāro paripūro satisampajaññaṃ paripūreti, satisampajaññaṃ paripūraṃ indriyasaṃvaraṃ paripūreti, indriyasaṃvaro paripūro tīṇi sucaritāni paripūreti, tīṇi sucaritāni paripūrāni cattāro satipaṭṭhāne paripūrenti, cattāro satipaṭṭhānā paripūrā satta bojjhaṅge paripūrenti, satta bojjhaṅgā paripūrā vijjāvimuttiṃ paripūrenti; evametissā vijjāvimuttiyā āhāro hoti, evañca pāripūri. ‘‘Seyyathāpi, bhikkhave, uparipabbate thullaphusitake deve vassante taṃ udakaṃ yathāninnaṃ pavattamānaṃ…pe… evametassa mahāsamuddassa sāgarassa āhāro hoti, evañca pāripūri. Evamevaṃ kho, bhikkhave, sappurisasaṃsevo paripūro saddhammassavanaṃ paripūreti…pe… evametissā vijjāvimuttiyā āhāro hoti, evañca pāripūrī’’ti. Dutiyaṃ.",
      "english": "Monks, the prior limit of the craving for existence is not discernible—‘Before this, the craving for existence did not exist, and then later it arose.’ Thus it is said, monks, yet it is discernible: ‘The craving for existence is conditioned by this.’\nI declare, monks, that the craving for existence has a nutriment, not that it is without nutriment. What is the nutriment for the craving for existence? It should be said: Ignorance.\nI declare, monks, that ignorance has a nutriment, not that it is without nutriment. What is the nutriment for ignorance? It should be said: The five hindrances.\nI declare, monks, that the five hindrances have a nutriment, not that they are without nutriment. What is the nutriment for the five hindrances? It should be said: The three kinds of misconduct.\nI declare, monks, that the three kinds of misconduct have a nutriment, not that they are without nutriment. What is the nutriment for the three kinds of misconduct? It should be said: Non-restraint of the sense faculties.\nI declare, monks, that non-restraint of the sense faculties has a nutriment, not that it is without nutriment. What is the nutriment for non-restraint of the sense faculties? It should be said: Lack of mindfulness and clear comprehension.\nI declare, monks, that lack of mindfulness and clear comprehension has a nutriment, not that it is without nutriment. What is the nutriment for lack of mindfulness and clear comprehension? It should be said: Unwise attention.\nI declare, monks, that unwise attention has a nutriment, not that it is without nutriment. What is the nutriment for unwise attention? It should be said: Lack of conviction.\nI declare, monks, that lack of conviction has a nutriment, not that it is without nutriment. What is the nutriment for lack of conviction? It should be said: Listening to ignoble teachings.\nI declare, monks, that listening to ignoble teachings has a nutriment, not that it is without nutriment. What is the nutriment for listening to ignoble teachings? It should be said: Associating with ignoble persons.\n\nThus, monks, when associating with ignoble persons is fully developed, it brings the full development of listening to ignoble teachings. When listening to ignoble teachings is fully developed, it brings the full development of lack of conviction. When lack of conviction is fully developed, it brings the full development of unwise attention. When unwise attention is fully developed, it brings the full development of lack of mindfulness and clear comprehension. When lack of mindfulness and clear comprehension is fully developed, it brings the full development of non-restraint of the sense faculties. When non-restraint of the sense faculties is fully developed, it brings the full development of the three kinds of misconduct. When the three kinds of misconduct are fully developed, they bring the full development of the five hindrances. When the five hindrances are fully developed, they bring the full development of ignorance. When ignorance is fully developed, it brings the full development of the craving for existence. In this way, this is the nutriment for the craving for existence, and this is how it comes to full completion.\n\nJust as, monks, when heavy rain falls on top of a mountain, that water, flowing according to the slope, fills the mountain caves, clefts, and ravines. When the mountain caves, clefts, and ravines are full, they fill the small ponds. When the small ponds are full, they fill the large ponds. When the large ponds are full, they fill the small rivers. When the small rivers are full, they fill the great rivers. When the great rivers are full, they fill the great ocean. In this way, this is the nutriment for the great ocean, and this is how it comes to full completion.\n\nEven so, monks, when associating with ignoble persons is fully developed, it brings the full development of listening to ignoble teachings. When listening to ignoble teachings is fully developed, it brings the full development of lack of conviction. When lack of conviction is fully developed, it brings the full development of unwise attention. When unwise attention is fully developed, it brings the full development of lack of mindfulness and clear comprehension. When lack of mindfulness and clear comprehension is fully developed, it brings the full development of non-restraint of the sense faculties. When non-restraint of the sense faculties is fully developed, it brings the full development of the three kinds of misconduct. When the three kinds of misconduct are fully developed, they bring the full development of the five hindrances. When the five hindrances are fully developed, they bring the full development of ignorance. When ignorance is fully developed, it brings the full development of the craving for existence. In this way, this is the nutriment for the craving for existence, and this is how it comes to full completion.\n\nI declare, monks, that knowledge and liberation also has a nutriment, not that it is without nutriment. What is the nutriment for knowledge and liberation? It should be said: The seven factors of enlightenment.\nI declare, monks, that the seven factors of enlightenment have a nutriment, not that they are without nutriment. What is the nutriment for the seven factors of enlightenment? It should be said: The four foundations of mindfulness.\nI declare, monks, that the four foundations of mindfulness have a nutriment, not that they are without nutriment. What is the nutriment for the four foundations of mindfulness? It should be said: The three kinds of good conduct.\nI declare, monks, that the three kinds of good conduct have a nutriment, not that they are without nutriment. What is the nutriment for the three kinds of good conduct? It should be said: Restraint of the sense faculties.\nI declare, monks, that restraint of the sense faculties has a nutriment, not that it is without nutriment. What is the nutriment for restraint of the sense faculties? It should be said: Mindfulness and clear comprehension.\nI declare, monks, that mindfulness and clear comprehension has a nutriment, not that it is without nutriment. What is the nutriment for mindfulness and clear comprehension? It should be said: Wise attention.\nI declare, monks, that wise attention has a nutriment, not that it is without nutriment. What is the nutriment for wise attention? It should be said: Conviction.\nI declare, monks, that conviction has a nutriment, not that it is without nutriment. What is the nutriment for conviction? It should be said: Listening to true Dhamma.\nI declare, monks, that listening to true Dhamma has a nutriment, not that it is without nutriment. What is the nutriment for listening to true Dhamma? It should be said: Associating with noble persons.\n\nThus, bhikkhus, association with admirable people, when complete, completes the hearing of the true Dhamma. The hearing of the true Dhamma, when complete, completes faith. Faith, when complete, completes wise attention. Wise attention, when complete, completes mindfulness and clear comprehension. Mindfulness and clear comprehension, when complete, completes restraint of the sense faculties. Restraint of the sense faculties, when complete, completes the three good conducts. The three good conducts, when complete, complete the four foundations of mindfulness. The four foundations of mindfulness, when complete, complete the seven factors of awakening. The seven factors of awakening, when complete, complete knowledge and liberation. Thus, this is the sustenance for knowledge and liberation, and this is its completion.\n\nJust as, bhikkhus, when rain falls in heavy drops on a mountaintop, that water, flowing down the slope, fills the mountain clefts; filling the mountain clefts it fills the rivulets; filling the rivulets it fills the great rivers; filling the great rivers it flows into the great ocean, the sea. Thus, it is the sustenance for the great ocean, the sea, and thus its completion.\n\nIn the same way, bhikkhus, association with admirable people, when complete, completes the hearing of the true Dhamma; the hearing of the true Dhamma, when complete, completes faith; faith, when complete, completes wise attention; wise attention, when complete, completes mindfulness and clear comprehension; mindfulness and clear comprehension, when complete, completes restraint of the sense faculties; restraint of the sense faculties, when complete, completes the three good conducts; the three good conducts, when complete, complete the four foundations of mindfulness; the four foundations of mindfulness, when complete, complete the seven factors of awakening; the seven factors of awakening, when complete, complete knowledge and liberation. Thus, this is the sustenance for knowledge and liberation, and thus its completion.",
      "sinhala": "භික්ෂූණි, භව තණ්හාවේ පෙර කෙළවර නොපෙනේ – ‘මීට පෙර භව තණ්හාව නොතිබුණි, පසුව ඇතිවිය’ කියා. භික්ෂූණි, එසේ කියනු ලැබේ නම්, භව තණ්හාවට හේතුවක් ඇති බව පෙනේ.\n\nභික්ෂූණි, මම භව තණ්හාවට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. භව තණ්හාවට ආහාරය කුමක්ද? ‘අවිද්‍යාව’ යැයි කිව යුතුයි. භික්ෂූණි, මම අවිද්‍යාවට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. අවිද්‍යාවට ආහාරය කුමක්ද? ‘පංච නීවරණ’ යැයි කිව යුතුයි. භික්ෂූණි, මම පංච නීවරණවලට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. පංච නීවරණවලට ආහාරය කුමක්ද? ‘තී‍්‍ර දුශ්චරිතයෝ’ යැයි කිව යුතුයි. භික්ෂූණි, මම තී‍්‍ර දුශ්චරිතයන්ට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. තී‍්‍ර දුශ්චරිතයන්ට ආහාරය කුමක්ද? ‘ඉන්ද්‍රිය අසංවරය’ යැයි කිව යුතුයි. භික්ෂූණි, මම ඉන්ද්‍රිය අසංවරයට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. ඉන්ද්‍රිය අසංවරයට ආහාරය කුමක්ද? ‘අසතිය හා අසම්පජඤ්ඤය’ යැයි කිව යුතුයි. භික්ෂූණි, මම අසතිය හා අසම්පජඤ්ඤයට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. අසතිය හා අසම්පජඤ්ඤයට ආහාරය කුමක්ද? ‘අයෝනිසෝ මනසිකාරය’ යැයි කිව යුතුයි. භික්ෂූණි, මම අයෝනිසෝ මනසිකාරයට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. අයෝනිසෝ මනසිකාරයට ආහාරය කුමක්ද? ‘අශ්‍රද්ධාව’ යැයි කිව යුතුයි. භික්ෂූණි, මම අශ්‍රද්ධාවට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. අශ්‍රද්ධාවට ආහාරය කුමක්ද? ‘අසද්ධර්මය ශ්‍රවණය කිරීම’ යැයි කිව යුතුයි. භික්ෂූණි, මම අසද්ධර්මය ශ්‍රවණය කිරීමට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. අසද්ධර්මය ශ්‍රවණය කිරීමට ආහාරය කුමක්ද? ‘අසත්පුරුෂ සේවනය’ යැයි කිව යුතුයි.\n\nභික්ෂූණි, මෙසේ අසත්පුරුෂ සේවනය සම්පූර්ණ වූ කල්හි අසද්ධර්මය ශ්‍රවණය කිරීම සම්පූර්ණ කරයි. අසද්ධර්මය ශ්‍රවණය කිරීම සම්පූර්ණ වූ කල්හි අශ්‍රද්ධාව සම්පූර්ණ කරයි. අශ්‍රද්ධාව සම්පූර්ණ වූ කල්හි අයෝනිසෝ මනසිකාරය සම්පූර්ණ කරයි. අයෝනිසෝ මනසිකාරය සම්පූර්ණ වූ කල්හි අසතිය හා අසම්පජඤ්ඤය සම්පූර්ණ කරයි. අසතිය හා අසම්පජඤ්ඤය සම්පූර්ණ වූ කල්හි ඉන්ද්‍රිය අසංවරය සම්පූර්ණ කරයි. ඉන්ද්‍රිය අසංවරය සම්පූර්ණ වූ කල්හි තී‍්‍ර දුශ්චරිතයන් සම්පූර්ණ කරයි. තී‍්‍ර දුශ්චරිතයන් සම්පූර්ණ වූ කල්හි පංච නීවරණ සම්පූර්ණ කරයි. පංච නීවරණ සම්පූර්ණ වූ කල්හි අවිද්‍යාව සම්පූර්ණ කරයි. අවිද්‍යාව සම්පූර්ණ වූ කල්හි භව තණ්හාව සම්පූර්ණ කරයි. භව තණ්හාවට ආහාරය වන්නේ මෙසේය, මෙසේ එය සම්පූර්ණ වේ.\n\nභික්ෂූණි, යම් සේ කඳු මුදුනක මහ වැසි වසින විට, ඒ ජලය බෑවුම දිගේ ගලා යමින් කඳු හෙල්, බෑවුම් හා උඩුගං බලා යන මාර්ග සම්පූර්ණ කරයි. කඳු හෙල්, බෑවුම් හා උඩුගං බලා යන මාර්ග සම්පූර්ණ වූ කල්හි කුඩා පොකුණු සම්පූර්ණ කරයි. කුඩා පොකුණු සම්පූර්ණ වූ කල්හි මහ පොකුණු සම්පූර්ණ කරයි. මහ පොකුණු සම්පූර්ණ වූ කල්හි කුඩා ගංගා සම්පූර්ණ කරයි. කුඩා ගංගා සම්පූර්ණ වූ කල්හි මහා ගංගා සම්පූර්ණ කරයි. මහා ගංගා සම්පූර්ණ වූ කල්හි මහා සාගරය සම්පූර්ණ කරයි. මෙසේ මහා සාගරයට ආහාරය වන්නේද, මෙසේ එය සම්පූර්ණ වේ.\n\nභික්ෂූණි, එලෙසින්ම අසත්පුරුෂ සේවනය සම්පූර්ණ වූ කල්හි අසද්ධර්මය ශ්‍රවණය කිරීම සම්පූර්ණ කරයි. අසද්ධර්මය ශ්‍රවණය කිරීම සම්පූර්ණ වූ කල්හි අශ්‍රද්ධාව සම්පූර්ණ කරයි. අශ්‍රද්ධාව සම්පූර්ණ වූ කල්හි අයෝනිසෝ මනසිකාරය සම්පූර්ණ කරයි. අයෝනිසෝ මනසිකාරය සම්පූර්ණ වූ කල්හි අසතිය හා අසම්පජඤ්ඤය සම්පූර්ණ කරයි. අසතිය හා අසම්පජඤ්ඤය සම්පූර්ණ වූ කල්හි ඉන්ද්‍රිය අසංවරය සම්පූර්ණ කරයි. ඉන්ද්‍රිය අසංවරය සම්පූර්ණ වූ කල්හි තී‍්‍ර දුශ්චරිතයන් සම්පූර්ණ කරයි. තී‍්‍ර දුශ්චරිතයන් සම්පූර්ණ වූ කල්හි පංච නීවරණ සම්පූර්ණ කරයි. පංච නීවරණ සම්පූර්ණ වූ කල්හි අවිද්‍යාව සම්පූර්ණ කරයි. අවිද්‍යාව සම්පූර්ණ වූ කල්හි භව තණ්හාව සම්පූර්ණ කරයි. භව තණ්හාවට ආහාරය වන්නේ මෙසේය, මෙසේ එය සම්පූර්ණ වේ.\n\nභික්ෂූණි, මම විද්‍යා විමුක්තියට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. විද්‍යා විමුක්තියට ආහාරය කුමක්ද? ‘සප්ත බෝජ්ඣංගයෝ’ යැයි කිව යුතුයි. භික්ෂූණි, මම සප්ත බෝජ්ඣංගයන්ට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. සප්ත බෝජ්ඣංගයන්ට ආහාරය කුමක්ද? ‘සතර සතිපට්ඨාන’ යැයි කිව යුතුයි. භික්ෂූණි, මම සතර සතිපට්ඨානයන්ට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. සතර සතිපට්ඨානයන්ට ආහාරය කුමක්ද? ‘තී‍්‍ර සුචරිතයෝ’ යැයි කිව යුතුයි. භික්ෂූණි, මම තී‍්‍ර සුචරිතයන්ට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. තී‍්‍ර සුචරිතයන්ට ආහාරය කුමක්ද? ‘ඉන්ද්‍රිය සංවරය’ යැයි කිව යුතුයි. භික්ෂූණි, මම ඉන්ද්‍රිය සංවරයට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. ඉන්ද්‍රිය සංවරයට ආහාරය කුමක්ද? ‘සතිය හා සම්පජඤ්ඤය’ යැයි කිව යුතුයි. භික්ෂූණි, මම සතිය හා සම්පජඤ්ඤයට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. සතිය හා සම්පජඤ්ඤයට ආහාරය කුමක්ද? ‘යෝනිසෝ මනසිකාරය’ යැයි කිව යුතුයි. භික්ෂූණි, මම යෝනිසෝ මනසිකාරයට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. යෝනිසෝ මනසිකාරයට ආහාරය කුමක්ද? ‘ශ්‍රද්ධාව’ යැයි කිව යුතුයි. භික්ෂූණි, මම ශ්‍රද්ධාවට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. ශ්‍රද්ධාවට ආහාරය කුමක්ද? ‘සද්ධර්මය ශ්‍රවණය කිරීම’ යැයි කිව යුතුයි. භික්ෂූණි, මම සද්ධර්මය ශ්‍රවණය කිරීමට ආහාරයක් ඇති බව කියමි, ආහාරයක් නැති බව නොකියමි. සද්ධර්මය ශ්‍රවණය කිරීමට ආහාරය කුමක්ද? ‘සත්පුරුෂ සේවනය’ යැයි කිව යුතුයි.\n\nඉතින්, මහණෙනි, සත්පුරුෂ සේවනය සම්පූර්ණ වීම සද්ධ`U+200D`ර්ම ශ්‍ර`U+200D`වණය සම්පූර්ණ කරයි. සද්ධ`U+200D`ර්ම ශ්‍ර`U+200D`වණය සම්පූර්ණ වීම ශ්‍ර`U+200D`ද්ධාව සම්පූර්ණ කරයි. ශ්‍ර`U+200D`ද්ධාව සම්පූර්ණ වීම යෝනිසෝමනසිකාරය සම්පූර්ණ කරයි. යෝනිසෝමනසිකාරය සම්පූර්ණ වීම සතිසම්පජඤ්ඤය සම්පූර්ණ කරයි. සතිසම්පජඤ්ඤය සම්පූර්ණ වීම ඉන්ද්‍රිය සංවරය සම්පූර්ණ කරයි. ඉන්ද්‍රිය සංවරය සම්පූර්ණ වීම ත`U+200D`්‍රිවිධ සුචරිතය සම්පූර්ණ කරයි. ත`U+200D`්‍රිවිධ සුචරිතය සම්පූර්ණ වීම සතර සතිපට්ඨානය සම්පූර්ණ කරයි. සතර සතිපට්ඨානය සම්පූර්ණ වීම සප්ත බොජ්ඣංගය සම්පූර්ණ කරයි. සප්ත බොජ්ඣංගය සම්පූර්ණ වීම විද්‍යාව හා විමුක්තිය සම්පූර්ණ කරයි. මෙලෙසින්, මේ විද්‍යාව හා විමුක්තියට ආහාරය වන්නේය, මෙසේ එය සම්පූර්ණ වන්නේය.\n\nමහණෙනි, යම් සේ නම්, පර්වතයක් මුදුනෙහි මහ වැසි වැසීමෙන් ඒ ජලය පහත් බිම දෙසට ගලා බසින්නේ, ඒ මහ සාගරයට ආහාරය වන්නේද, මෙසේ එය සම්පූර්ණ වන්නේද;\n\nඑසේම මහණෙනි, සත්පුරුෂ සේවනය සම්පූර්ණ වීම සද්ධ`U+200D`ර්ම ශ්‍ර`U+200D`වණය සම්පූර්ණ කරයි. සද්ධ`U+200D`ර්ම ශ්‍ර`U+200D`වණය සම්පූර්ණ වීම ශ්‍ර`U+200D`ද්ධාව සම්පූර්ණ කරයි. ශ්‍ර`U+200D`ද්ධාව සම්පූර්ණ වීම යෝනිසෝමනසිකාරය සම්පූර්ණ කරයි. යෝනිසෝමනසිකාරය සම්පූර්ණ වීම සතිසම්පජඤ්ඤය සම්පූර්ණ කරයි. සතිසම්පජඤ්ඤය සම්පූර්ණ වීම ඉන්ද්‍රිය සංවරය සම්පූර්ණ කරයි. ඉන්ද්‍රිය සංවරය සම්පූර්ණ වීම ත`U+200D`්‍රිවිධ සුචරිතය සම්පූර්ණ කරයි. ත`U+200D`්‍රිවිධ සුචරිතය සම්පූර්ණ වීම සතර සතිපට්ඨානය සම්පූර්ණ කරයි. සතර සතිපට්ඨානය සම්පූර්ණ වීම සප්ත බොජ්ඣංගය සම්පූර්ණ කරයි. සප්ත බොජ්ඣංගය සම්පූර්ණ වීම විද්‍යාව හා විමුක්තිය සම්පූර්ණ කරයි. මෙලෙසින්, මේ විද්‍යාව හා විමුක්තියට ආහාරය වන්නේය, මෙසේ එය සම්පූර්ණ වන්නේය.",
      "paliTitle": "Ḍtaṇhāsuttaṃ",
      "englishTitle": "The Discourse on Craving",
      "sinhalaTitle": "තණ්හා සූත‍්‍රය"
    },
    {
      "number": 63,
      "pali": "‘‘Ye keci, bhikkhave, mayi niṭṭhaṃ gatā sabbe te diṭṭhisampannā. Tesaṃ diṭṭhisampannānaṃ pañcannaṃ idha niṭṭhā, pañcannaṃ idha vihāya niṭṭhā. Katamesaṃ pañcannaṃ idha niṭṭhā? Sattakkhattuparamassa, kolaṃkolassa, ekabījissa, sakadāgāmissa, yo ca diṭṭheva dhamme arahā – imesaṃ pañcannaṃ idha niṭṭhā. Katamesaṃ pañcannaṃ idha vihāya niṭṭhā? Antarāparinibbāyissa, upahaccaparinibbāyissa, asaṅkhāraparinibbāyissa, sasaṅkhāraparinibbāyissa, uddhaṃsotassa akaniṭṭhagāmino – imesaṃ pañcannaṃ idha vihāya niṭṭhā. Ye keci, bhikkhave, mayi niṭṭhaṃ gatā, sabbe te diṭṭhisampannā. Tesaṃ diṭṭhisampannānaṃ imesaṃ pañcannaṃ idha niṭṭhā, imesaṃ pañcannaṃ idha vihāya niṭṭhā’’ti. Tatiyaṃ.",
      "english": "Monks, whoever has arrived at completion in me, all of them are endowed with perfect right view. Among those endowed with perfect right view, five attain completion in this very existence, and five attain completion having departed from this existence. Which five attain completion in this very existence? The one who will be reborn at most seven more times, the one who goes from family to family, the one who has one more birth, the once-returner, and one who is an Arahant in this very life. These five attain completion in this very existence. Which five attain completion having departed from this existence? The one who attains final Nibbana in the intermediate stage, the one who attains final Nibbana upon landing, the one who attains final Nibbana without exertion, the one who attains final Nibbana with exertion, and the one who goes upstream to the Akaniṭṭha realm. These five attain completion having departed from this existence. Monks, whoever has arrived at completion in me, all of them are endowed with perfect right view. Among those endowed with perfect right view, these five attain completion in this very existence, and these five attain completion having departed from this existence.",
      "sinhala": "යම්කිසි භික්‍ෂූණි, මා කෙරෙහි අවබෝධයකට පැමිණි ඒ සියල්ලෝම දෘෂ්ටි සම්පන්නයෝ වෙති. ඒ දෘෂ්ටි සම්පන්න වූවන් අතරින් පස්දෙනෙකුට මේ ජීවිතයේදීම අවසානය (අරහත්වය) සිදු වේ. තවත් පස්දෙනෙකුට මේ ජීවිතයෙන් වෙන්ව (පරලොවදී) අවසානය (අරහත්වය) සිදු වේ.\n\nකවර පස්දෙනෙකුටද මේ ජීවිතයේදීම අවසානය සිදු වන්නේ? සත්තක්ඛත්තුපරම වූ පුද්ගලයාට, කෝලංකෝල පුද්ගලයාට, ඒකබීජී පුද්ගලයාට, සකදාගාමී පුද්ගලයාට, යමෙක් මේ ආත්ම භාවයේදීම අරහත් බවට පත් වන්නේද, ඒ පුද්ගලයාට – මේ පස්දෙනාට මේ ජීවිතයේදීම අවසානය සිදු වේ.\n\nකවර පස්දෙනෙකුටද මේ ජීවිතයෙන් වෙන්ව අවසානය සිදු වන්නේ? අන්තරාපරිනිර්වායී පුද්ගලයාට, උපහච්චපරිනිර්වායී පුද්ගලයාට, අසංඛාරපරිනිර්වායී පුද්ගලයාට, සසංඛාරපරිනිර්වායී පුද්ගලයාට, ඌර්ධ්වශ‍්‍රෝතස්වී වූ අකනිට්ඨගාමී පුද්ගලයාට – මේ පස්දෙනාට මේ ජීවිතයෙන් වෙන්ව (පරලොවදී) අවසානය (අරහත්වය) සිදු වේ.\n\nයම්කිසි භික්‍ෂූණි, මා කෙරෙහි අවබෝධයකට පැමිණි ඒ සියල්ලෝම දෘෂ්ටි සම්පන්නයෝ වෙති. ඒ දෘෂ්ටි සම්පන්න වූවන් අතරින් මේ පස්දෙනාට මේ ජීවිතයේදීම අවසානය සිදු වේ, මේ පස්දෙනාට මේ ජීවිතයෙන් වෙන්ව අවසානය සිදු වේ.",
      "paliTitle": "Niṭṭhaṅgatasuttaṃ",
      "englishTitle": "Discourse on Consummation",
      "sinhalaTitle": "නිෂ්ඨාගත සූත්‍රය"
    },
    {
      "number": 64,
      "pali": "‘‘Ye keci, bhikkhave, mayi aveccappasannā, sabbe te sotāpannā. Tesaṃ sotāpannānaṃ pañcannaṃ idha niṭṭhā, pañcannaṃ idha vihāya niṭṭhā. Katamesaṃ pañcannaṃ idha niṭṭhā? Sattakkhattuparamassa, kolaṃkolassa, ekabījissa, sakadāgāmissa, yo ca diṭṭheva dhamme arahā – imesaṃ pañcannaṃ idha niṭṭhā. Katamesaṃ pañcannaṃ idha vihāya niṭṭhā? Antarāparinibbāyissa, upahaccaparinibbāyissa, asaṅkhāraparinibbāyissa, sasaṅkhāraparinibbāyissa, uddhaṃsotassa akaniṭṭhagāmino – imesaṃ pañcannaṃ idha vihāya niṭṭhā. Ye keci, bhikkhave, mayi aveccappasannā sabbe te sotāpannā. Tesaṃ sotāpannānaṃ imesaṃ pañcannaṃ idha niṭṭhā, imesaṃ pañcannaṃ idha vihāya niṭṭhā’’ti. Catutthaṃ.",
      "english": "Whatever monastics, are unshakably confident in me, all of them are stream-entrants. Among these stream-entrants, five attain their ultimate goal in this very world, and five attain their ultimate goal after departing from this world.\n\nWhich five attain their ultimate goal in this very world? The one who will be reborn at most seven more times, the one who passes from clan to clan, the one who has only one more rebirth, the once-returner, and the one who is an Arahant in this very life – these five attain their ultimate goal in this very world.\n\nWhich five attain their ultimate goal after departing from this world? The one who attains Nibbana in the intermediate state, the one who attains Nibbana upon landing, the one who attains Nibbana without exertion, the one who attains Nibbana with exertion, and the one whose stream of existence flows upwards, bound for the Akaniṭṭha realm – these five attain their ultimate goal after departing from this world.\n\nWhatever monastics, are unshakably confident in me, all of them are stream-entrants. Among these stream-entrants, these five attain their ultimate goal in this very world, and these five attain their ultimate goal after departing from this world.",
      "sinhala": "මහණෙනි, යම්කිසි අයෙක් මා කෙරෙහි නොසැලෙන, නොබිඳෙන ශ්‍රද්ධාවෙන් යුක්ත වන්නාහු ද, ඒ සියල්ලෝම සෝවාන් වූවෝ වෙති.\n\nඒ සෝවාන් වූවන් අතුරින් පස් දෙනෙකුට මේ ආත්මභාවය තුළදීම හෝ කාම ලෝකය තුළදීම නිවන අවබෝධ වේ; පස් දෙනෙකුට මේ ආත්මභාවය හැර දමා (බ්‍රහ්ම ලෝකවලදී) නිවන අවබෝධ වේ.\n\nකවර නම් පස් දෙනෙකුට ද මේ ආත්මභාවය තුළදීම හෝ කාම ලෝකය තුළදීම නිවන අවබෝධ වන්නේ? සත්තක්ඛත්තුපරම, කෝලංකෝල, ඒකබීජී වූ සෝවාන් පුද්ගලයා, සකදාගාමී පුද්ගලයා, සහ යම් කෙනෙක් මේ ආත්මභාවයේදීම රහත් වෙත් ද – මේ පස් දෙනාට මේ ආත්මභාවය තුළදීම හෝ කාම ලෝකය තුළදීම නිවන අවබෝධ වේ.\n\nකවර නම් පස් දෙනෙකුට ද මේ ආත්මභාවය හැර දමා (බ්‍රහ්ම ලෝකවලදී) නිවන අවබෝධ වන්නේ? අන්තරාපරිනිබ්බායි, උපහච්චපරිනිබ්බායි, අසංඛාරපරිනිබ්බායි, සසංඛාරපරිනිබ්බායි, සහ ඌර්ධ්වංසෝත වූ අකනිට්ඨගාමී වූ අනාගාමී පුද්ගලයා – මේ පස් දෙනාට මේ ආත්මභාවය හැර දමා (බ්‍රහ්ම ලෝකවලදී) නිවන අවබෝධ වේ.\n\nමහණෙනි, යම්කිසි අයෙක් මා කෙරෙහි නොසැලෙන, නොබිඳෙන ශ්‍රද්ධාවෙන් යුක්ත වන්නාහු ද, ඒ සියල්ලෝම සෝවාන් වූවෝ වෙති. ඒ සෝවාන් වූවන් අතුරින් මේ පස් දෙනෙකුට මේ ආත්මභාවය තුළදීම හෝ කාම ලෝකය තුළදීම නිවන අවබෝධ වේ, මේ පස් දෙනෙකුට මේ ආත්මභාවය හැර දමා (බ්‍රහ්ම ලෝකවලදී) නිවන අවබෝධ වේ.",
      "paliTitle": "Aveccappasannasuttaṃ",
      "englishTitle": "Discourse on Unwavering Conviction",
      "sinhalaTitle": "නොසැලෙන පැහැදීමේ සූත්‍රය"
    },
    {
      "number": 65,
      "pali": "Ekaṃ samayaṃ āyasmā sāriputto magadhesu viharati nālakagāmake. Atha kho sāmaṇḍakāni paribbājako yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sāmaṇḍakāni paribbājako āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Kiṃ nu kho, āvuso sāriputta, sukhaṃ, kiṃ dukkha’’nti? ‘‘Abhinibbatti kho, āvuso, dukkhā, anabhinibbatti sukhā. Abhinibbattiyā, āvuso, sati idaṃ dukkhaṃ pāṭikaṅkhaṃ – sītaṃ uṇhaṃ jighacchā pipāsā uccāro passāvo aggisamphasso daṇḍasamphasso satthasamphasso ñātīpi mittāpi saṅgamma samāgamma rosenti. Abhinibbattiyā, āvuso, sati idaṃ dukkhaṃ pāṭikaṅkhaṃ. Anabhinibbattiyā, āvuso, sati idaṃ sukhaṃ pāṭikaṅkhaṃ – na sītaṃ na uṇhaṃ na jighacchā na pipāsā na uccāro na passāvo na aggisamphasso na daṇḍasamphasso na satthasamphasso ñātīpi mittāpi saṅgamma samāgamma na rosenti. Anabhinibbattiyā, āvuso, sati idaṃ sukhaṃ pāṭikaṅkha’’nti. Pañcamaṃ.",
      "english": "At one time, the venerable Sāriputta was dwelling in Magadha, in the village of Nālakagāmaka. Then the wanderer Sāmaṇḍakāni approached the venerable Sāriputta. Having approached, he exchanged greetings with the venerable Sāriputta. Having concluded their courteous and amiable talk, he sat down to one side. Sitting to one side, the wanderer Sāmaṇḍakāni said this to the venerable Sāriputta: \"Friend Sāriputta, what indeed is happiness, and what is suffering?\" \"Indeed, friend, renewed existence is suffering; non-renewed existence is happiness. When there is renewed existence, friend, this suffering is to be expected: cold, heat, hunger, thirst, defecation, urination, contact with fire, contact with a stick, contact with a weapon; also, relatives and friends, gathering together, show hostility. When there is renewed existence, friend, this suffering is to be expected. When there is non-renewed existence, friend, this happiness is to be expected: no cold, no heat, no hunger, no thirst, no defecation, no urination, no contact with fire, no contact with a stick, no contact with a weapon; also, relatives and friends, gathering together, do not show hostility. When there is non-renewed existence, friend, this happiness is to be expected.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් ශ්‍රී​සාරිපුත්ත ස්ථවිරයන් වහන්සේ මගධ දේශයේ නාලකගාම නම් ගම්මානයෙහි වැඩසිටින සේක. ඉක්බිති සාමණ්ඩකානි නම් පරිබ්‍රාජකයා ආයුෂ්මත් ශ්‍රී​සාරිපුත්ත ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, ආයුෂ්මත් ශ්‍රී​සාරිපුත්ත ස්ථවිරයන් වහන්සේ සමඟ සතුටු විය. මනාප වූත්, සිහි කටයුතු වූත් කථාබහක් පවත්වා එකත්පසෙක වාඩි විය. එකත්පසෙක වාඩි වී සිටි සාමණ්ඩකානි පරිබ්‍රාජකයා ආයුෂ්මත් ශ්‍රී​සාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ කීවේය: ‘‘ඇවැත් සාරිපුත්තයෙනි, කුමක් නම් සැපයක්ද, කුමක් නම් දුකක්ද?’’ ‘‘ඇවැත්නි, (සංසාර) භවයක නැවත නැවත ඇතිවීම දුකකි. (සංසාර) භවයක නැවත ඇති නොවීම සැපයකි. ඇවැත්නි, (සංසාර) භවයක නැවත නැවත ඇතිවීමක් තිබෙන කල්හි, සීතල, උණුසුම, බඩගින්න, පිපාසය, මළපහ කිරීම, මුත්‍රා කිරීම, ගිනි ස්පර්ශය, දඬු පහර, ආයුධ පහර යන මේ දුකත්, ඥාතීහු ද මිත්‍රයෝ ද එකතු වී, රැස්වී තරවටු කිරීමත් අපේක්ෂා කළ හැකිය. ඇවැත්නි, (සංසාර) භවයක නැවත නැවත ඇතිවීමක් තිබෙන කල්හි මේ දුක අපේක්ෂා කළ හැකිය. ඇවැත්නි, (සංසාර) භවයක නැවත ඇති නොවීමක් තිබෙන කල්හි, සීතල නැත, උණුසුම නැත, බඩගින්න නැත, පිපාසය නැත, මළපහ කිරීම නැත, මුත්‍රා කිරීම නැත, ගිනි ස්පර්ශය නැත, දඬු පහර නැත, ආයුධ පහර නැත යන මේ සැපයත්, ඥාතීහු ද මිත්‍රයෝ ද එකතු වී, රැස්වී තරවටු නොකිරීමත් අපේක්ෂා කළ හැකිය. ඇවැත්නි, (සංසාර) භවයක නැවත ඇති නොවීමක් තිබෙන කල්හි මේ සැපය අපේක්ෂා කළ හැකියි.’’",
      "paliTitle": "Paṭhamasukhasuttaṃ",
      "englishTitle": "The First Discourse on Happiness",
      "sinhalaTitle": "ප්‍රථම සුඛ සූත්‍රය"
    },
    {
      "number": 66,
      "pali": "Ekaṃ samayaṃ āyasmā sāriputto magadhesu viharati nālakagāmake. Atha kho sāmaṇḍakāni paribbājako yenāyasmā sāriputto tenupasaṅkami; upasaṅkamitvā āyasmatā sāriputtena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho sāmaṇḍakāni paribbājako āyasmantaṃ sāriputtaṃ etadavoca – ‘‘Kiṃ nu kho, āvuso, sāriputta, imasmiṃ dhammavinaye sukhaṃ, kiṃ dukkha’’nti? ‘‘Anabhirati kho, āvuso, imasmiṃ dhammavinaye dukkhā, abhirati sukhā. Anabhiratiyā, āvuso, sati idaṃ dukkhaṃ pāṭikaṅkhaṃ – gacchantopi sukhaṃ sātaṃ nādhigacchati, ṭhitopi… nisinnopi… sayānopi… gāmagatopi… araññagatopi… rukkhamūlagatopi… suññāgāragatopi… abbhokāsagatopi… bhikkhumajjhagatopi sukhaṃ sātaṃ nādhigacchati. Anabhiratiyā, āvuso, sati idaṃ dukkhaṃ pāṭikaṅkhaṃ. ‘‘Abhiratiyā, āvuso, sati idaṃ sukhaṃ pāṭikaṅkhaṃ – gacchantopi sukhaṃ sātaṃ adhigacchati, ṭhitopi… nisinnopi… sayānopi… gāmagatopi… araññagatopi… rukkhamūlagatopi… suññāgāragatopi… abbhokāsagatopi… bhikkhumajjhagatopi sukhaṃ sātaṃ adhigacchati. Abhiratiyā, āvuso, sati idaṃ sukhaṃ pāṭikaṅkha’’nti. Chaṭṭhaṃ.",
      "english": "At one time, the Venerable Sāriputta was dwelling in Magadha, in the village of Nālakā. Then the wanderer Sāmaṇḍakāni approached the Venerable Sāriputta; having approached, he exchanged greetings with the Venerable Sāriputta. After exchanging cordial greetings and pleasantries, he sat down to one side. As he sat to one side, the wanderer Sāmaṇḍakāni said to the Venerable Sāriputta: “What, friend Sāriputta, is happiness in this Dhamma and Discipline, and what is suffering?”\n\n“Discontent, friend, in this Dhamma and Discipline is suffering; contentment is happiness. When there is discontent, friend, this suffering can be expected: whether walking, one does not find ease and comfort; whether standing, one does not find ease and comfort; whether sitting, one does not find ease and comfort; whether lying down, one does not find ease and comfort; whether gone to a village, one does not find ease and comfort; whether gone to the wilderness, one does not find ease and comfort; whether gone to the root of a tree, one does not find ease and comfort; whether gone to an empty dwelling, one does not find ease and comfort; whether gone to the open air, one does not find ease and comfort; whether gone among bhikkhus, one does not find ease and comfort. When there is discontent, friend, this suffering can be expected.\n\n“When there is contentment, friend, this happiness can be expected: whether walking, one finds ease and comfort; whether standing, one finds ease and comfort; whether sitting, one finds ease and comfort; whether lying down, one finds ease and comfort; whether gone to a village, one finds ease and comfort; whether gone to the wilderness, one finds ease and comfort; whether gone to the root of a tree, one finds ease and comfort; whether gone to an empty dwelling, one finds ease and comfort; whether gone to the open air, one finds ease and comfort; whether gone among bhikkhus, one finds ease and comfort. When there is contentment, friend, this happiness can be expected.”",
      "sinhala": "එක් කලෙක ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ මගධ දේශයේ නාලකගාම නම් ගමෙහි වැඩසිටියාහ.\n\nඉන්පසු සාමණ්ඩකානි පිරිවැජියා ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු, සිහිපත් කළ යුතු කතා බහ නිමවා ඔහු එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි සාමණ්ඩකානි පිරිවැජියා ආයුෂ්මත් ශාරීපුත්‍ර ස්ථවිරයන් වහන්සේට මෙය කීවේය: \"ඇවැත් ශාරීපුත්‍රයෙනි, මේ ධර්ම විනයෙහි කුමක් නම් සැපද, කුමක් දුකද?\"\n\n\"ඇවැත්නි, මේ ධර්ම විනයෙහි අරතිය (අප්‍රිය බව) දුකකි. රතිය (ප්‍රිය බව) සැපයකි.\"\n\n\"ඇවැත්නි, අරතිය (අප්‍රිය බව) ඇති කල්හි මේ දුක අපේක්ෂා කළ හැකිය: යන්නාද සැපයක්, සැනසීමක් නොලබයි; සිටින්නාද සැපයක්, සැනසීමක් නොලබයි; හිඳින්නාද සැපයක්, සැනසීමක් නොලබයි; සයනය කරන්නාද සැපයක්, සැනසීමක් නොලබයි; ගමට ගියද සැපයක්, සැනසීමක් නොලබයි; අරණ්‍යයට ගියද සැපයක්, සැනසීමක් නොලබයි; රුක්මුලට ගියද සැපයක්, සැනසීමක් නොලබයි; ශූන්‍යාගාරයකට ගියද සැපයක්, සැනසීමක් නොලබයි; එළිමහනට ගියද සැපයක්, සැනසීමක් නොලබයි; භික්ෂූන් වහන්සේලා මැද සිටියද සැපයක්, සැනසීමක් නොලබයි. ඇවැත්නි, අරතිය (අප්‍රිය බව) ඇති කල්හි මේ දුක අපේක්ෂා කළ හැකිය.\"\n\n\"ඇවැත්නි, රතිය (ප්‍රිය බව) ඇති කල්හි මේ සැප අපේක්ෂා කළ හැකිය: යන්නාද සැපයක්, සැනසීමක් ලබයි; සිටින්නාද සැපයක්, සැනසීමක් ලබයි; හිඳින්නාද සැපයක්, සැනසීමක් ලබයි; සයනය කරන්නාද සැපයක්, සැනසීමක් ලබයි; ගමට ගියද සැපයක්, සැනසීමක් ලබයි; අරණ්‍යයට ගියද සැපයක්, සැනසීමක් ලබයි; රුක්මුලට ගියද සැපයක්, සැනසීමක් ලබයි; ශූන්‍යාගාරයකට ගියද සැපයක්, සැනසීමක් ලබයි; එළිමහනට ගියද සැපයක්, සැනසීමක් ලබයි; භික්ෂූන් වහන්සේලා මැද සිටියද සැපයක්, සැනසීමක් ලබයි. ඇවැත්නි, රතිය (ප්‍රිය බව) ඇති කල්හි මේ සැප අපේක්ෂා කළ හැකිය.\"",
      "paliTitle": "Dutiyasukhasuttaṃ",
      "englishTitle": "The Second Discourse on Happiness",
      "sinhalaTitle": "දෙවන සුඛ සූත්‍රය"
    },
    {
      "number": 67,
      "pali": "Ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ yena naḷakapānaṃ nāma kosalānaṃ nigamo tadavasari. Tatra sudaṃ bhagavā naḷakapāne viharati palāsavane. Tena kho pana samayena bhagavā tadahuposathe bhikkhusaṅghaparivuto nisinno hoti. Atha kho bhagavā bahudeva rattiṃ bhikkhūnaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā tuṇhībhūtaṃ tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘Vigatathinamiddho [vigatathīnamiddho (sī. syā. kaṃ. pī.)] kho, sāriputta, bhikkhusaṅgho. Paṭibhātu taṃ, sāriputta, bhikkhūnaṃ dhammī kathā. Piṭṭhi me āgilāyati; tamahaṃ āyamissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā sāriputto bhagavato paccassosi. Atha kho bhagavā catugguṇaṃ saṅghāṭiṃ paññāpetvā dakkhiṇena passena sīhaseyyaṃ kappesi pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Yassa kassaci, āvuso, saddhā natthi kusalesu dhammesu, hirī [hiri (sī. syā. kaṃ. pī.)] natthi… ottappaṃ natthi … vīriyaṃ [viriyaṃ (sī. syā. kaṃ. pī.)] natthi… paññā natthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. Seyyathāpi, āvuso, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena hāyati maṇḍalena hāyati ābhāya hāyati ārohapariṇāhena; evamevaṃ kho, āvuso, yassa kassaci saddhā natthi kusalesu dhammesu, hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. ‘‘Assaddho purisapuggalo’ti, āvuso, parihānametaṃ; ‘ahiriko purisapuggalo’ti, āvuso, parihānametaṃ; ‘anottappī purisapuggalo’ti, āvuso, parihānametaṃ; ‘kusīto purisapuggalo’ti, āvuso, parihānametaṃ; ‘duppañño purisapuggalo’ti, āvuso, parihānametaṃ; ‘kodhano purisapuggalo’ti, āvuso, parihānametaṃ; ‘upanāhī purisapuggalo’ti, āvuso, parihānametaṃ; ‘pāpiccho purisapuggalo’ti, āvuso, parihānametaṃ; ‘pāpamitto purisapuggalo’ti, āvuso, parihānametaṃ; ‘micchādiṭṭhiko purisapuggalo’ti, āvuso, parihānametaṃ. ‘‘Yassa kassaci, āvuso, saddhā atthi kusalesu dhammesu, hirī atthi… ottappaṃ atthi… paññā atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni. Seyyathāpi, āvuso, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena vaḍḍhati maṇḍalena vaḍḍhati ābhāya vaḍḍhati ārohapariṇāhena; evamevaṃ kho, āvuso, yassa kassaci saddhā atthi kusalesu dhammesu, hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni. ‘‘‘Saddho purisapuggalo’ti, āvuso, aparihānametaṃ; ‘hirīmā purisapuggalo’ti, āvuso, aparihānametaṃ; ‘ottappī purisapuggalo’ti, āvuso, aparihānametaṃ; ‘āraddhavīriyo purisapuggalo’ti, āvuso, aparihānametaṃ; ‘paññavā purisapuggalo’ti, āvuso, aparihānametaṃ; ‘akkodhano purisapuggalo’ti, āvuso, aparihānametaṃ; ‘anupanāhī purisapuggalo’ti, āvuso, aparihānametaṃ; ‘appiccho purisapuggalo’ti, āvuso, aparihānametaṃ; ‘kalyāṇamitto purisapuggalo’ti, āvuso, aparihānametaṃ; ‘sammādiṭṭhiko purisapuggalo’ti, āvuso, aparihānameta’’nti. Atha kho bhagavā paccuṭṭhāya āyasmantaṃ sāriputtaṃ āmantesi – ‘‘sādhu sādhu, sāriputta! Yassa kassaci, sāriputta, saddhā natthi kusalesu dhammesu, hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. Seyyathāpi, sāriputta, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena hāyati maṇḍalena hāyati ābhāya hāyati ārohapariṇāhena; evamevaṃ kho, sāriputta, yassa kassaci saddhā natthi kusalesu dhammesu…pe… paññā natthi kusalesu dhammesu, tassa yā ratti vā divaso vā …pe… no vuddhi. ‘‘‘Assaddho purisapuggalo’ti, sāriputta, parihānametaṃ; ahiriko… anottappī… kusīto… duppañño… kodhano… upanāhī… pāpiccho… pāpamitto… ‘micchādiṭṭhiko purisapuggalo’ti, sāriputta, parihānametaṃ. ‘‘Yassa kassaci, sāriputta, saddhā atthi kusalesu dhammesu, hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni. Seyyathāpi, sāriputta, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena vaḍḍhati maṇḍalena vaḍḍhati ābhāya vaḍḍhati ārohapariṇāhena; evamevaṃ kho, sāriputta, yassa kassaci saddhā atthi kusalesu dhammesu, hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni. ‘‘‘Saddho purisapuggalo’ti, sāriputta, aparihānametaṃ; hirīmā… ottappī… āraddhavīriyo… paññavā… akkodhano… anupanāhī… appiccho… kalyāṇamitto… ‘sammādiṭṭhiko purisapuggalo’ti, sāriputta, aparihānameta’’nti. Sattamaṃ.",
      "english": "Once the Blessed One, while on a tour among the Kosalans with a large community of bhikkhus, arrived at a Kosalan town called Naḷakapāna. There, at Naḷakapāna, the Blessed One stayed in the Palāsa Grove. Now, on that Uposatha day, the Blessed One was seated surrounded by the community of bhikkhus. Then, after instructing, rousing, encouraging, and gladdening the bhikkhus with a Dhamma talk for most of the night, the Blessed One looked over the silently attentive community of bhikkhus and addressed the Venerable Sāriputta: “Sāriputta, the community of bhikkhus is free from sloth and torpor. Let a Dhamma talk for the bhikkhus occur to you, Sāriputta. My back aches; I will stretch it out.” “Yes, Venerable Sir,” replied the Venerable Sāriputta to the Blessed One. Then the Blessed One, having folded his outer robe into four, lay down on his right side in the lion’s posture, placing one foot on the other, mindful and clearly comprehending, having fixed in mind the perception of rising up.\n\nThere the Venerable Sāriputta addressed the bhikkhus, “Friends, bhikkhus!” “Friend!” replied those bhikkhus to the Venerable Sāriputta. The Venerable Sāriputta said this: “Friends, for anyone who has no faith in wholesome qualities, no moral shame, no moral dread, no energy, no wisdom in wholesome qualities, as each night or day comes, decline in wholesome qualities is to be expected, not growth. Just as, friends, in the dark fortnight, as each night or day comes, the moon wanes in splendor, wanes in its orb, wanes in its radiance, wanes in its size and fullness; in the same way, friends, for anyone who has no faith in wholesome qualities, no moral shame, no moral dread, no energy, no wisdom in wholesome qualities, as each night or day comes, decline in wholesome qualities is to be expected, not growth.\n\n“Friends, ‘a person without faith’ – this is a decline. ‘A person without moral shame’ – this is a decline. ‘A person without moral dread’ – this is a decline. ‘A lazy person’ – this is a decline. ‘A foolish person’ – this is a decline. ‘A person prone to anger’ – this is a decline. ‘A resentful person’ – this is a decline. ‘A person of ignoble wishes’ – this is a decline. ‘A person with evil friends’ – this is a decline. ‘A person holding wrong view’ – this is a decline.\n\n“Friends, for anyone who has faith in wholesome qualities, moral shame, moral dread, energy, and wisdom in wholesome qualities, as each night or day comes, growth in wholesome qualities is to be expected, not decline. Just as, friends, in the bright fortnight, as each night or day comes, the moon waxes in splendor, waxes in its orb, waxes in its radiance, waxes in its size and fullness; in the same way, friends, for anyone who has faith in wholesome qualities, moral shame, moral dread, energy, and wisdom in wholesome qualities, as each night or day comes, growth in wholesome qualities is to be expected, not decline.\n\n“Friends, ‘a person with faith’ – this is non-decline. ‘A person with moral shame’ – this is non-decline. ‘A person with moral dread’ – this is non-decline. ‘A person with aroused energy’ – this is non-decline. ‘A wise person’ – this is non-decline. ‘A person not prone to anger’ – this is non-decline. ‘A non-resentful person’ – this is non-decline. ‘A person of few desires’ – this is non-decline. ‘A person with admirable friends’ – this is non-decline. ‘A person holding right view’ – this is non-decline.”\n\nThen the Blessed One, rising, addressed the Venerable Sāriputta: “Good, good, Sāriputta! For anyone who has no faith in wholesome qualities, no moral shame, no moral dread, no energy, no wisdom in wholesome qualities, as each night or day comes, decline in wholesome qualities is to be expected, not growth. Just as, Sāriputta, in the dark fortnight, as each night or day comes, the moon wanes in splendor, wanes in its orb, wanes in its radiance, wanes in its size and fullness; in the same way, Sāriputta, for anyone who has no faith in wholesome qualities, no moral shame, no moral dread, no energy, no wisdom in wholesome qualities, as each night or day comes, decline in wholesome qualities is to be expected, not growth.\n\n“‘A person who is without faith (in wholesome principles),’ Sāriputta, is a decline; lacking a sense of moral shame, lacking a sense of moral dread, lazy, unwise, prone to anger, bearing resentment, having evil wishes, having bad companions — ‘a person holding wrong view,’ Sāriputta, is a decline.”\n\n“However, Sāriputta, for whoever has faith in wholesome principles, has a sense of moral shame, has a sense of moral dread, has persistent energy, and has wisdom concerning wholesome principles, for that one, with each passing night or day, only growth in wholesome principles is to be expected, not decline. Just as, Sāriputta, for the moon in the bright fortnight, with each passing night or day, it grows in luster, it grows in its orb, it grows in its radiance, and it grows in its rising and fullness. In the same way, Sāriputta, for whoever has faith in wholesome principles, has a sense of moral shame, has a sense of moral dread, has persistent energy, and has wisdom concerning wholesome principles, for that one, with each passing night or day, only growth in wholesome principles is to be expected, not decline.”\n\n“‘A person who is endowed with faith,’ Sāriputta, is not a decline; one endowed with a sense of moral shame, one endowed with a sense of moral dread, one who has aroused persistent energy, one who is wise, one who is not prone to anger, one who does not bear resentment, one who has few wishes, one who has good companions — ‘a person holding right view,’ Sāriputta, is not a decline.”",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ කෝසල ජනපදයෙහි චාරිකාවේ වඩමින් මහත් වූ භික්ෂු සංඝයා පිරිවරාගෙන නාලකපාන නම් වූ කෝසල ජනපදයේ නියම්ගම තිබූ තැනට වැඩම කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ නාලකපානයෙහි පලාස වනයෙහි වැඩසිටි සේක. ඒ මොහොතෙහි භාග්‍යවතුන් වහන්සේ එදින පෝය දින භික්ෂු සංඝයා පිරිවරාගෙන වැඩසිටි සේක. ඉන්පසු භාග්‍යවතුන් වහන්සේ බොහෝ වේලාවක් රාත්‍රියේදී භික්ෂූන්ට ධර්ම කථාවෙන් කරුණු පැහැදිලි කොට, සමාදන් කරවා, උනන්දු කරවා, සතුටු කරවා, නිහඬව සිටින භික්ෂු සංඝයා වහන්සේලා දෙස බලා, ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේට මෙසේ ඇමතූ සේක: “සාරිපුත්තය, මේ භික්ෂු සංඝයා තීනමිද්ධයෙන් (සිතිවිලි අලස බවින් හා නිදිමතෙන්) තොරව සිටිති. සාරිපුත්තය, භික්ෂූන්ට ධර්ම කථාවක් දේශනා කිරීමට ඔබට දැන් සුදුසු කාලයයි. මගේ පිට රිදේ. මම මොහොතකට සැතපෙන්නෙමි.” “එසේය, භාග්‍යවතුන් වහන්ස” යැයි ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන් සේක. ඉන්පසු භාග්‍යවතුන් වහන්සේ සිව් ගුණයක් හකුළාගත් සඟල සිවුරක් අතුරුවාගෙන, එක් පයක් මත එක් පයක් තබා, සිහි නුවණින් යුක්තව, නැගී සිටීමේ සිත පිහිටුවාගෙන, දකුණු ඇලයෙන් සිංහ සෙයියාවෙන් සැතපීමට ආරම්භ කළ සේක.\n\nඑහිදී ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක: “ඇවැත්නි භික්ෂූනි!” “ඇවැත්නි” යි ඒ භික්ෂූහු ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ මෙසේ වදාළ සේක: “ඇවැත්නි, යම් කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාව නැත්නම්, හිරිය නැත්නම්, ඔත්තප්පය නැත්නම්, වීර්යය නැත්නම්, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව නැත්නම්, ඔහුට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, කුසල ධර්මයන්ගේ පිරිහීමම අපේක්ෂා කළ යුත්තේය; දියුණුවක් නොවේ. ඇවැත්නි, යම්සේ අව පක්ෂයේ සඳට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, වර්ණයෙන් අඩු වෙයි, මණ්ඩලයෙන් අඩු වෙයි, ආලෝකයෙන් අඩු වෙයි, උසින් හා වටප්‍රමාණයෙන් අඩු වෙයිද; එසෙවම ඇවැත්නි, යම් කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාව නැත්නම්, හිරිය නැත්නම්, ඔත්තප්පය නැත්නම්, වීර්යය නැත්නම්, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව නැත්නම්, ඔහුට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, කුසල ධර්මයන්ගේ පිරිහීමම අපේක්ෂා කළ යුත්තේය; දියුණුවක් නොවේ.\n\n“ඇවැත්නි, ‘අශ්‍රද්ධාවන්ත පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘හිරිය නැති පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘ඔත්තප්පය නැති පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘කම්මැලි පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘දුෂ්ප්‍රාඥ පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘ක්‍රෝධ කරන පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘වෛර බඳින පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘නපුරු ආශාවන් ඇති පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘පවිටු මිතුරන් ඇති පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි. ඇවැත්නි, ‘මිථ්‍යාදෘෂ්ටික පුරුෂ පුද්ගලයා’ යනු පිරිහීමකි.\n\nඇවැත්නි, යම් කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාව ඇත්නම්, හිරිය ඇත්නම්, ඔත්තප්පය ඇත්නම්, වීර්යය ඇත්නම්, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව ඇත්නම්, ඔහුට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, කුසල ධර්මයන්ගේ දියුණුවම අපේක්ෂා කළ යුත්තේය; පිරිහීමක් නොවේ. ඇවැත්නි, යම්සේ පුර පක්ෂයේ සඳට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, වර්ණයෙන් වර්ධනය වෙයි, මණ්ඩලයෙන් වර්ධනය වෙයි, ආලෝකයෙන් වර්ධනය වෙයි, උසින් හා වටප්‍රමාණයෙන් වර්ධනය වෙයිද; එසෙවම ඇවැත්නි, යම් කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාව ඇත්නම්, හිරිය ඇත්නම්, ඔත්තප්පය ඇත්නම්, වීර්යය ඇත්නම්, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව ඇත්නම්, ඔහුට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, කුසල ධර්මයන්ගේ දියුණුවම අපේක්ෂා කළ යුත්තේය; පිරිහීමක් නොවේ.\n\n“ඇවැත්නි, ‘ශ්‍රද්ධාවන්ත පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘හිරිය ඇති පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘ඔත්තප්පය ඇති පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘වීර්යය වඩාගත් පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘ප්‍රඥාවන්ත පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘ක්‍රෝධ නොකරන පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘වෛර නොබඳින පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘අල්පේච්ඡ පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘කල්‍යාණ මිත්‍රයෙක් ඇති පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ. ඇවැත්නි, ‘සම්මාදිට්ඨික පුරුෂ පුද්ගලයා’ යනු පිරිහීමක් නොවේ.”\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ නැගිට ආයුෂ්මත් සාරිපුත්ත ස්ථවිරයන් වහන්සේ අමතා මෙසේ වදාළ සේක: “සාධු සාධු, සාරිපුත්තය! සාරිපුත්තය, යම් කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාව නැත්නම්, හිරිය නැත්නම්, ඔත්තප්පය නැත්නම්, වීර්යය නැත්නම්, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව නැත්නම්, ඔහුට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, කුසල ධර්මයන්ගේ පිරිහීමම අපේක්ෂා කළ යුත්තේය; දියුණුවක් නොවේ. සාරිපුත්තය, යම්සේ අව පක්ෂයේ සඳට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, වර්ණයෙන් අඩු වෙයි, මණ්ඩලයෙන් අඩු වෙයි, ආලෝකයෙන් අඩු වෙයි, උසින් හා වටප්‍රමාණයෙන් අඩු වෙයිද; එසෙවම සාරිපුත්තය, යම් කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාව නැත්නම්, හිරිය නැත්නම්, ඔත්තප්පය නැත්නම්, වීර්යය නැත්නම්, කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව නැත්නම්, ඔහුට රාත්‍රියක් හෝ දවාලක් උදා වන කල්හි, කුසල ධර්මයන්ගේ පිරිහීමම අපේක්ෂා කළ යුත්තේය; දියුණුවක් නොවේ.\n\nසා​රිපුත්තය, ‘ශ්‍රද්ධාවෙන් තොර පුද්ගලයා’ යනු පිරිහීමකි. නිර්ලජ්ජී… අනුත්​තප්පී… අලස… ප්‍රඥා විරහිත… ක්‍රෝධ​ය ඇති… වෛර බැඳගන්නා… නපුරු අදහස් ඇති… නපුරු මිත්‍රයන් ඇති… ‘මිත්‍යාදෘෂ්ටික පුද්ගලයා’ යනු සා​රිපුත්තය, පිරිහීමකි.\n\nසා​රිපුත්තය, යම් කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාව ඇත්ද, හිරි ඇත්ද… ඔතප් ඇත්ද… වීර්යය ඇත්ද… කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව ඇත්ද, ඔහුට දිවා රෑ දෙකෙන් කුමක් පැමිණියත්, කුසල ධර්මයන්හි වර්ධනයක්ම මිස පිරිහීමක් අපේක්ෂා කළ යුත්තකි. සා​රිපුත්තය, එය මෙසේය: පුර පක්ෂයේ සඳුට දිවා රෑ දෙකෙන් කුමක් පැමිණියත්, වර්ණයෙන් වර්ධනය වේ, මණ්ඩලයෙන් වර්ධනය වේ, ආලෝකයෙන් වර්ධනය වේ, උසින් හා ප්‍රමාණයෙන් වර්ධනය වේ. සා​රිපුත්තය, එපරිද්දෙන්ම යම් කිසිවකුට කුසල ධර්මයන් කෙරෙහි ශ්‍රද්ධාව ඇත්ද, හිරි ඇත්ද… ඔතප් ඇත්ද… වීර්යය ඇත්ද… කුසල ධර්මයන් කෙරෙහි ප්‍රඥාව ඇත්ද, ඔහුට දිවා රෑ දෙකෙන් කුමක් පැමිණියත්, කුසල ධර්මයන්හි වර්ධනයක්ම මිස පිරිහීමක් අපේක්ෂා කළ යුත්තකි.\n\nසා​රිපුත්තය, ‘ශ්‍රද්ධාව ඇති පුද්ගලයා’ යනු නොපිරිහීමකි. හිරි ඇති… ඔතප් ඇති… වීර්යය අරඹන ලද… ප්‍රඥාව ඇති… ක්‍රෝධ​ය නැති… වෛර නොබැඳගන්නා… අල්​පේච්ඡ… කල්‍යාණ මිත්‍රයන් ඇති… ‘සම්මාදිට්ඨික පුද්ගලයා’ යනු සා​රිපුත්තය, නොපිරිහීමකි.",
      "paliTitle": "Paṭhamanaḷakapānasuttaṃ",
      "englishTitle": "The First Naḷakapāna Discourse",
      "sinhalaTitle": "පළමු නළකපාන සූත්‍රය"
    },
    {
      "number": 68,
      "pali": "Ekaṃ samayaṃ bhagavā naḷakapāne viharati palāsavane. Tena kho pana samayena bhagavā tadahuposathe bhikkhusaṅghaparivuto nisinno hoti. Atha kho bhagavā bahudeva rattiṃ bhikkhūnaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā tuṇhībhūtaṃ tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā āyasmantaṃ sāriputtaṃ āmantesi – ‘‘Vigatathinamiddho kho, sāriputta, bhikkhusaṅgho. Paṭibhātu taṃ, sāriputta, bhikkhūnaṃ dhammī kathā. Piṭṭhi me āgilāyati; tamahaṃ āyamissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā sāriputto bhagavato paccassosi. Atha kho bhagavā catugguṇaṃ saṅghāṭiṃ paññāpetvā dakkhiṇena passena sīhaseyyaṃ kappesi pāde pādaṃ accādhāya sato sampajāno uṭṭhānasaññaṃ manasi karitvā. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso, bhikkhave’’ti! ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Yassa kassaci, āvuso, saddhā natthi kusalesu dhammesu, hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi… sotāvadhānaṃ natthi… dhammadhāraṇā natthi… atthūpaparikkhā natthi… dhammānudhammappaṭipatti natthi… appamādo natthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. Seyyathāpi, āvuso, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena hāyati maṇḍalena hāyati ābhāya hāyati ārohapariṇāhena; evamevaṃ kho, āvuso, yassa kassaci saddhā natthi kusalesu dhammesu, hirī natthi… ottappaṃ natthi… vīriyaṃ natthi… paññā natthi… sotāvadhānaṃ natthi… dhammadhāraṇā natthi… atthūpaparikkhā natthi… dhammānudhammappaṭipatti natthi… appamādo natthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. ‘‘Yassa kassaci, āvuso, saddhā atthi kusalesu dhammesu, hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi… sotāvadhānaṃ atthi… dhammadhāraṇā atthi… atthūpaparikkhā atthi… dhammānudhammappaṭipatti atthi… appamādo atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni. Seyyathāpi, āvuso, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena vaḍḍhati maṇḍalena vaḍḍhati ābhāya vaḍḍhati ārohapariṇāhena; evamevaṃ kho, āvuso, yassa kassaci saddhā atthi kusalesu dhammesu…pe… appamādo atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihānī’’ti. Atha kho bhagavā paccuṭṭhāya āyasmantaṃ sāriputtaṃ āmantesi – ‘‘sādhu sādhu, sāriputta! Yassa kassaci, sāriputta, saddhā natthi kusalesu dhammesu hirī natthi… ottappaṃ natthi… paññā natthi… vīriyaṃ natthi… sotāvadhānaṃ natthi… dhammadhāraṇā natthi… atthūpaparikkhā natthi… dhammānudhammappaṭipatti natthi… appamādo natthi kusalesu dhammesu tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. Seyyathāpi, sāriputta, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena hāyati maṇḍalena hāyati ābhāya hāyati ārohapariṇāhena; evamevaṃ kho, sāriputta, yassa kassaci saddhā natthi kusalesu dhammesu…pe… appamādo natthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. ‘‘Yassa kassaci, sāriputta, saddhā atthi kusalesu dhammesu hirī atthi… ottappaṃ atthi… vīriyaṃ atthi… paññā atthi… sotāvadhānaṃ atthi… dhammadhāraṇā atthi… atthūpaparikkhā atthi… dhammānudhammappaṭipatti atthi… appamādo atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni. Seyyathāpi, sāriputta, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena vaḍḍhati maṇḍalena vaḍḍhati ābhāya vaḍḍhati ārohapariṇāhena; evamevaṃ kho, sāriputta, yassa kassaci saddhā atthi kusalesu dhammesu… pe… appamādo atthi kusalesu dhammesu, tassa yā ratti vā divaso vā āgacchati, vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihānī’’ti. Aṭṭhamaṃ.",
      "english": "At one time the Blessed One was staying at Naḷakapāna, in the Palāsa forest. On that occasion, on the Uposatha day, the Blessed One was seated surrounded by the assembly of bhikkhus. Then the Blessed One, having instructed, inspired, gladdened, and roused the bhikkhus with a Dhamma talk for most of the night, surveyed the silent assembly of bhikkhus, and addressed the Venerable Sāriputta: \"Sāriputta, this assembly of bhikkhus is free from sloth and torpor. Let a Dhamma talk occur to you, Sāriputta, for the bhikkhus. My back is aching; I shall stretch it.\" \"Yes, venerable sir,\" replied the Venerable Sāriputta to the Blessed One. Then the Blessed One, having folded his outer robe into four, lay down on his right side in the lion's posture, placing one foot on the other, mindful and clearly comprehending, having set his mind on rising up.\n\nThereupon, the Venerable Sāriputta addressed the bhikkhus, \"Friends, bhikkhus!\" \"Friend,\" replied those bhikkhus to the Venerable Sāriputta. The Venerable Sāriputta spoke thus: \"Friends, in whosoever there is no faith in wholesome qualities, no sense of shame, no dread of wrongdoing, no energy, no wisdom, no attentive listening, no retention of the Dhamma, no critical examination of meanings, no practice in accordance with the Dhamma, and no heedfulness in wholesome qualities, for such a person, whatever night or day comes, only decline is to be expected in wholesome qualities, not growth. Just as, friends, for the moon during the dark half of the month, whatever night or day comes, it wanes in color, it wanes in orb, it wanes in splendor, it wanes in magnitude and fullness; even so, friends, in whosoever there is no faith in wholesome qualities, no sense of shame, no dread of wrongdoing, no energy, no wisdom, no attentive listening, no retention of the Dhamma, no critical examination of meanings, no practice in accordance with the Dhamma, and no heedfulness in wholesome qualities, for such a person, whatever night or day comes, only decline is to be expected in wholesome qualities, not growth.\"\n\n\"Friends, in whosoever there is faith in wholesome qualities, a sense of shame, a dread of wrongdoing, energy, wisdom, attentive listening, retention of the Dhamma, critical examination of meanings, practice in accordance with the Dhamma, and heedfulness in wholesome qualities, for such a person, whatever night or day comes, only growth is to be expected in wholesome qualities, not decline. Just as, friends, for the moon during the bright half of the month, whatever night or day comes, it waxes in color, it waxes in orb, it waxes in splendor, it waxes in magnitude and fullness; even so, friends, in whosoever there is faith in wholesome qualities... and heedfulness in wholesome qualities, for such a person, whatever night or day comes, only growth is to be expected in wholesome qualities, not decline.\"\n\nThen the Blessed One, having risen, addressed the Venerable Sāriputta: \"Excellent, excellent, Sāriputta! Sāriputta, in whosoever there is no faith in wholesome qualities, no sense of shame, no dread of wrongdoing, no wisdom, no energy, no attentive listening, no retention of the Dhamma, no critical examination of meanings, no practice in accordance with the Dhamma, and no heedfulness in wholesome qualities, for such a person, whatever night or day comes, only decline is to be expected in wholesome qualities, not growth. Just as, Sāriputta, for the moon during the dark half of the month, whatever night or day comes, it wanes in color, it wanes in orb, it wanes in splendor, it wanes in magnitude and fullness; even so, Sāriputta, in whosoever there is no faith in wholesome qualities... and no heedfulness in wholesome qualities, for such a person, whatever night or day comes, only decline is to be expected in wholesome qualities, not growth.\"\n\n\"Sāriputta, in whosoever there is faith in wholesome qualities, a sense of shame, a dread of wrongdoing, energy, wisdom, attentive listening, retention of the Dhamma, critical examination of meanings, practice in accordance with the Dhamma, and heedfulness in wholesome qualities, for such a person, whatever night or day comes, only growth is to be expected in wholesome qualities, not decline. Just as, Sāriputta, for the moon during the bright half of the month, whatever night or day comes, it waxes in color, it waxes in orb, it waxes in splendor, it waxes in magnitude and fullness; even so, Sāriputta, in whosoever there is faith in wholesome qualities... and heedfulness in wholesome qualities, for such a person, whatever night or day comes, only growth is to be expected in wholesome qualities, not decline.\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ නළකපාන නම් පලාස වනයෙහි වැඩවසන සේක. එකල්හි භාග්‍යවතුන් වහන්සේ එදින පෝය දිනෙහි භික්ෂුසංඝයා පිරිවරා වැඩසිටින සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ බොහෝ රාත්‍රියක් භික්ෂූන්ට ධර්‍ම කථාවෙන් දේශනා කරමින්, සමාදන් කරවමින්, උනන්දු කරවමින්, සතුටු කරවමින්, නිහඬව සිටි භික්ෂුසංඝයා නැවත නැවතත් බලා, ආයුෂ්මත් සාරිපුත්ත තෙරුන්ට ආමන්ත්‍රණය කොට වදාළ සේක: ‘‘සාරිපුත්තය, මේ භික්ෂුසංඝයා තීනමිද්ධයෙන් තොර වී සිටිති. සාරිපුත්තය, භික්ෂූන්ට ධර්‍ම කථාවක් දේශනා කිරීමට ඔබට දැන් සුදුසු කාලයයි. මාගේ පිට රුදාවෙන් පෙළෙයි; මම දැන් විවේක ගන්නෙමි.’’ ‘‘එසේය, භාග්‍යවතුන් වහන්සැ’’යි ආයුෂ්මත් සාරිපුත්ත තෙරණුවෝ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. ඉක්බිති භාග්‍යවතුන් වහන්සේ සිවුරු සතරකට නමා අතුරුවා, සිහියෙන් යුක්තව, මනා අවබෝධයෙන් යුක්තව, නැඟී සිටීමේ සිත මෙනෙහි කරමින්, දකුණු පසට හැරී, එක් පාදයක් මත තවත් පාදයක් තබා, සිංහ සෙය්‍යාවෙන් සැතපුණු සේක.\n\nඑහිදී ආයුෂ්මත් සාරිපුත්ත තෙරණුවෝ භික්ෂූන්ට ආමන්ත්‍රණය කළහ – ‘‘ඇවැත්නි භික්ෂූනි!’’ ‘‘ඇවැත්නි’’ යැයි එම භික්ෂූහු ආයුෂ්මත් සාරිපුත්ත තෙරුන්ට පිළිතුරු දුන්හ. ආයුෂ්මත් සාරිපුත්ත තෙරණුවෝ මෙය වදාළහ: ‘‘ඇවැත්නි, යම් කිසිවකුට කුසල ධර්‍මයන් කෙරෙහි ශ්‍ර‍ද්ධා‍වක් නැත්ද, හිරියක් නැත්ද, ඔත්තප්පයක් නැත්ද, වීර්යයක් නැත්ද, ප්‍ර‍ඥා‍වක් නැත්ද, ධර්‍ම ශ්‍ර‍වණයට අවධානයක් නැත්ද, ධර්‍මය ධාරණය කර ගැනීමක් නැත්ද, අර්ථය විමසීමක් නැත්ද, ධර්‍මානුධර්‍ම ප්‍ර‍තිපත්ති‍යක් නැත්ද, කුසල ධර්‍මයන් කෙරෙහි අප්‍ර‍මාද‍යක් නැත්ද, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, කුසල ධර්‍මයන්හි හානියම මිස දියුණුවක් බලාපොරොත්තු විය යුතු නැත. ඇවැත්නි, යම්සේ අඳුරු පක්ෂයෙහි චන්ද්‍රයාට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, වර්ණයෙන් ක්ෂය වන්නේද, මණ්ඩලයෙන් ක්ෂය වන්නේද, ආලෝකයෙන් ක්ෂය වන්නේද, උසින් හා පරිමාවෙන් ක්ෂය වන්නේද, එසේම, ඇවැත්නි, යම් කිසිවකුට කුසල ධර්‍මයන් කෙරෙහි ශ්‍ර‍ද්ධා‍වක් නැත්ද, හිරියක් නැත්ද, ඔත්තප්පයක් නැත්ද, වීර්යයක් නැත්ද, ප්‍ර‍ඥා‍වක් නැත්ද, ධර්‍ම ශ්‍ර‍වණයට අවධානයක් නැත්ද, ධර්‍මය ධාරණය කර ගැනීමක් නැත්ද, අර්ථය විමසීමක් නැත්ද, ධර්‍මානුධර්‍ම ප්‍ර‍තිපත්ති‍යක් නැත්ද, කුසල ධර්‍මයන් කෙරෙහි අප්‍ර‍මාද‍යක් නැත්ද, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, කුසල ධර්‍මයන්හි හානියම මිස දියුණුවක් බලාපොරොත්තු විය යුතු නැත. ඇවැත්නි, යම් කිසිවකුට කුසල ධර්‍මයන් කෙරෙහි ශ්‍ර‍ද්ධා‍වක් ඇත්ද, හිරියක් ඇත්ද, ඔත්තප්පයක් ඇත්ද, වීර්යයක් ඇත්ද, ප්‍ර‍ඥා‍වක් ඇත්ද, ධර්‍ම ශ්‍ර‍වණයට අවධානයක් ඇත්ද, ධර්‍මය ධාරණය කර ගැනීමක් ඇත්ද, අර්ථය විමසීමක් ඇත්ද, ධර්‍මානුධර්‍ම ප්‍ර‍තිපත්ති‍යක් ඇත්ද, කුසල ධර්‍මයන් කෙරෙහි අප්‍ර‍මාද‍යක් ඇත්ද, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, කුසල ධර්‍මයන්හි දියුණුවම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු නැත. ඇවැත්නි, යම්සේ සඳෙහි පෑලවිය පක්ෂයෙහි චන්ද්‍රයාට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, වර්ණයෙන් වැඩෙන්නේද, මණ්ඩලයෙන් වැඩෙන්නේද, ආලෝකයෙන් වැඩෙන්නේද, උසින් හා පරිමාවෙන් වැඩෙන්නේද, එසේම, ඇවැත්නි, යම් කිසිවකුට කුසල ධර්‍මයන් කෙරෙහි ශ්‍ර‍ද්ධා‍වක් ඇත්ද, හිරියක් ඇත්ද, ඔත්තප්පයක් ඇත්ද, වීර්යයක් ඇත්ද, ප්‍ර‍ඥා‍වක් ඇත්ද, ධර්‍ම ශ්‍ර‍වණයට අවධානයක් ඇත්ද, ධර්‍මය ධාරණය කර ගැනීමක් ඇත්ද, අර්ථය විමසීමක් ඇත්ද, ධර්‍මානුධර්‍ම ප්‍ර‍තිපත්ති‍යක් ඇත්ද, කුසල ධර්‍මයන් කෙරෙහි අප්‍ර‍මාද‍යක් ඇත්ද, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, කුසල ධර්‍මයන්හි දියුණුවම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු නැත.’’\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ නැඟී සිට, ආයුෂ්මත් සාරිපුත්ත තෙරුන්ට ආමන්ත්‍රණය කොට වදාළ සේක: ‘‘සාදු සාදු, සාරිපුත්තය! සාරිපුත්තය, යම් කිසිවකුට කුසල ධර්‍මයන් කෙරෙහි ශ්‍ර‍ද්ධා‍වක් නැත්ද, හිරියක් නැත්ද, ඔත්තප්පයක් නැත්ද, ප්‍ර‍ඥා‍වක් නැත්ද, වීර්යයක් නැත්ද, ධර්‍ම ශ්‍ර‍වණයට අවධානයක් නැත්ද, ධර්‍මය ධාරණය කර ගැනීමක් නැත්ද, අර්ථය විමසීමක් නැත්ද, ධර්‍මානුධර්‍ම ප්‍ර‍තිපත්ති‍යක් නැත්ද, කුසල ධර්‍මයන් කෙරෙහි අප්‍ර‍මාද‍යක් නැත්ද, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, කුසල ධර්‍මයන්හි හානියම මිස දියුණුවක් බලාපොරොත්තු විය යුතු නැත. සාරිපුත්තය, යම්සේ අඳුරු පක්ෂයෙහි චන්ද්‍රයාට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, වර්ණයෙන් ක්ෂය වන්නේද, මණ්ඩලයෙන් ක්ෂය වන්නේද, ආලෝකයෙන් ක්ෂය වන්නේද, උසින් හා පරිමාවෙන් ක්ෂය වන්නේද, එසේම, සාරිපුත්තය, යම් කිසිවකුට කුසල ධර්‍මයන් කෙරෙහි ශ්‍ර‍ද්ධා‍වක් නැත්ද, හිරියක් නැත්ද, ඔත්තප්පයක් නැත්ද, ප්‍ර‍ඥා‍වක් නැත්ද, වීර්යයක් නැත්ද, ධර්‍ම ශ්‍ර‍වණයට අවධානයක් නැත්ද, ධර්‍මය ධාරණය කර ගැනීමක් නැත්ද, අර්ථය විමසීමක් නැත්ද, ධර්‍මානුධර්‍ම ප්‍ර‍තිපත්ති‍යක් නැත්ද, කුසල ධර්‍මයන් කෙරෙහි අප්‍ර‍මාද‍යක් නැත්ද, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, කුසල ධර්‍මයන්හි හානියම මිස දියුණුවක් බලාපොරොත්තු විය යුතු නැත. සාරිපුත්තය, යම් කිසිවකුට කුසල ධර්‍මයන් කෙරෙහි ශ්‍ර‍ද්ධා‍වක් ඇත්ද, හිරියක් ඇත්ද, ඔත්තප්පයක් ඇත්ද, වීර්යයක් ඇත්ද, ප්‍ර‍ඥා‍වක් ඇත්ද, ධර්‍ම ශ්‍ර‍වණයට අවධානයක් ඇත්ද, ධර්‍මය ධාරණය කර ගැනීමක් ඇත්ද, අර්ථය විමසීමක් ඇත්ද, ධර්‍මානුධර්‍ම ප්‍ර‍තිපත්ති‍යක් ඇත්ද, කුසල ධර්‍මයන් කෙරෙහි අප්‍ර‍මාද‍යක් ඇත්ද, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, කුසල ධර්‍මයන්හි දියුණුවම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු නැත. සාරිපුත්තය, යම්සේ සඳෙහි පෑලවිය පක්ෂයෙහි චන්ද්‍රයාට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, වර්ණයෙන් වැඩෙන්නේද, මණ්ඩලයෙන් වැඩෙන්නේද, ආලෝකයෙන් වැඩෙන්නේද, උසින් හා පරිමාවෙන් වැඩෙන්නේද, එසේම, සාරිපුත්තය, යම් කිසිවකුට කුසල ධර්‍මයන් කෙරෙහි ශ්‍ර‍ද්ධා‍වක් ඇත්ද, හිරියක් ඇත්ද, ඔත්තප්පයක් ඇත්ද, වීර්යයක් ඇත්ද, ප්‍ර‍ඥා‍වක් ඇත්ද, ධර්‍ම ශ්‍ර‍වණයට අවධානයක් ඇත්ද, ධර්‍මය ධාරණය කර ගැනීමක් ඇත්ද, අර්ථය විමසීමක් ඇත්ද, ධර්‍මානුධර්‍ම ප්‍ර‍තිපත්ති‍යක් ඇත්ද, කුසල ධර්‍මයන් කෙරෙහි අප්‍ර‍මාද‍යක් ඇත්ද, ඔහුට යම් රාත්‍රියක් හෝ දවසක් පැමිණෙන්නේද, කුසල ධර්‍මයන්හි දියුණුවම මිස පිරිහීමක් බලාපොරොත්තු විය යුතු නැත.’’",
      "paliTitle": "Dutiyanaḷakapānasuttaṃ",
      "englishTitle": "The Second Naḷakapāna Sutta",
      "sinhalaTitle": "දෙවන නළකපාන සූත‍්‍රය"
    },
    {
      "number": 69,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena sambahulā bhikkhū pacchābhattaṃ piṇḍapātapaṭikkantā upaṭṭhānasālāyaṃ sannisinnā sannipatitā anekavihitaṃ tiracchānakathaṃ anuyuttā viharanti, seyyathidaṃ – [dī. ni. 1.17; ma. ni. 2.223; saṃ. ni. 5.1080; pāci. 508] rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ yānakathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ [itthikathaṃ purisakathaṃ (ka.) ma. ni. aṭṭha. 2.223 passitabbaṃ] sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ itibhavābhavakathaṃ iti vāti. Atha kho bhagavā sāyanhasamayaṃ paṭisallānā vuṭṭhito yena upaṭṭhānasālā tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘kāya nuttha, bhikkhave, etarahi kathāya sannisinnā sannipatitā, kā ca pana vo antarākathā vippakatā’’ti? ‘‘Idha mayaṃ, bhante, pacchābhattaṃ piṇḍapātapaṭikkantā upaṭṭhānasālāyaṃ sannisinnā sannipatitā anekavihitaṃ tiracchānakathaṃ anuyuttā viharāma, seyyathidaṃ – rājakathaṃ corakathaṃ… pe… itibhavābhavakathaṃ iti vā’’ti. ‘‘Na kho panetaṃ, bhikkhave, tumhākaṃ patirūpaṃ kulaputtānaṃ saddhāya agārasmā anagāriyaṃ pabbajitānaṃ, yaṃ tumhe anekavihitaṃ tiracchānakathaṃ anuyuttā vihareyyātha, seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ yānakathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ itibhavābhavakathaṃ iti vāti. ‘‘Dasayimāni, bhikkhave, kathāvatthūni. Katamāni dasa? Appicchakathā, santuṭṭhikathā, pavivekakathā, asaṃsaggakathā, vīriyārambhakathā, sīlakathā, samādhikathā, paññākathā, vimuttikathā, vimuttiñāṇadassanakathāti – imāni kho, bhikkhave, dasa kathāvatthūni. ‘‘Imesaṃ ce tumhe, bhikkhave, dasannaṃ kathāvatthūnaṃ upādāyupādāya kathaṃ katheyyātha, imesampi candimasūriyānaṃ evaṃmahiddhikānaṃ evaṃmahānubhāvānaṃ tejasā tejaṃ pariyādiyeyyātha, ko pana vādo aññatitthiyānaṃ paribbājakāna’’nti! Navamaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Sāvatthī, at Jeta’s Grove, in Anāthapiṇḍika’s monastery. Now at that time, many monks, having returned from their alms round after their meal, were sitting together in the service hall, engaged in various kinds of trivial talk, namely – talk of kings, talk of bandits, talk of ministers, talk of armies, talk of dangers, talk of wars, talk of food, talk of drink, talk of clothes, talk of beds, talk of garlands, talk of perfumes, talk of relatives, talk of vehicles, talk of villages, talk of market towns, talk of cities, talk of countries, talk of women, talk of heroes, talk of streets, talk of watering places, talk of departed relatives, talk of various other topics, talk of the world, talk of the sea, and talk of existence and non-existence. Then the Blessed One, having risen from seclusion in the evening, approached the service hall; having approached, he sat down on the appointed seat.\n\nHaving sat down, the Blessed One addressed the monks: \"Monks, what sort of talk are you engaged in now, as you sit assembled here? And what was the intervening talk that was left unfinished?\"\n\n\"Here, venerable sir, we, having returned from our alms round after our meal, are sitting together in the service hall, engaged in various kinds of trivial talk, namely – talk of kings, talk of bandits… and talk of existence and non-existence.\"\n\n\"Monks, this is not proper for you, for noble sons who have gone forth from home to homelessness out of faith, that you should be engaged in various kinds of trivial talk, namely – talk of kings, talk of bandits, talk of ministers, talk of armies, talk of dangers, talk of wars, talk of food, talk of drink, talk of clothes, talk of beds, talk of garlands, talk of perfumes, talk of relatives, talk of vehicles, talk of villages, talk of market towns, talk of cities, talk of countries, talk of women, talk of heroes, talk of streets, talk of watering places, talk of departed relatives, talk of various other topics, talk of the world, talk of the sea, and talk of existence and non-existence.\"\n\n\"Monks, there are these ten topics of discussion. Which ten? Talk on fewness of wishes, talk on contentment, talk on seclusion, talk on non-entanglement, talk on the arousal of energy, talk on virtue, talk on concentration, talk on wisdom, talk on liberation, and talk on the knowledge and vision of liberation – these, monks, are the ten topics of discussion.\"\n\n\"If you, monks, were to engage in talk focusing on these ten topics of discussion, you would outshine even the moon and sun, which are of such great power and might, with your own brilliance. What need is there to speak of other sectarians and wandering ascetics!\"",
      "sinhala": "එක් සමයෙක භාග්‍ය‍වතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුතුමාගේ ජේතවනාරාමයෙහි වැඩවසන සේක. එකල්හි බොහෝ භික්ෂූහු දහවල් දානය වළඳා පිණ්ඩපාතයෙන් ආපසු වැඩමකොට උපස්ථාන ශාලාවෙහි රැස්ව සිට, රජුන් පිළිබඳ කතා, සොරුන් පිළිබඳ කතා, අමාත්‍යවරුන් පිළිබඳ කතා, සේනා පිළිබඳ කතා, භය පිළිබඳ කතා, යුද්ධ පිළිබඳ කතා, ආහාර පිළිබඳ කතා, පාන වර්ග පිළිබඳ කතා, වස්ත්‍ර පිළිබඳ කතා, සයන පිළිබඳ කතා, මල් පිළිබඳ කතා, සුවඳ වර්ග පිළිබඳ කතා, ඥාතීන් පිළිබඳ කතා, යාන වාහන පිළිබඳ කතා, ගම් පිළිබඳ කතා, නියම්ගම් පිළිබඳ කතා, නගර පිළිබඳ කතා, ජනපද පිළිබඳ කතා, ස්ත්‍රීන් පිළිබඳ කතා, වීර පුරුෂයන් පිළිබඳ කතා, වීථි පිළිබඳ කතා, මඟුල් තොටුපළවල් පිළිබඳ කතා, පෙරේතයන් පිළිබඳ කතා, නොයෙක් ආකාර වූ කතා, ලෝකය පිළිබඳ කතා, සාගරය පිළිබඳ කතා, මෙලොව පරලොව පිළිබඳ කතා යනාදී නොයෙක් ආකාර තිරශ්චීන කතාවල යෙදී සිටියහ.\n\nඑවිට භාග්‍ය‍වතුන් වහන්සේ සවස් කාලයෙහි භාවනාවෙන් නැගී සිට, උපස්ථාන ශාලාව වෙත වැඩම කළ සේක; වැඩම කොට පනවන ලද අසුනෙහි වැඩහුන් සේක. වැඩහිඳ භාග්‍ය‍වතුන් වහන්සේ භික්ෂූන්ට ආමන්ත්‍රණය කළ සේක: ‘‘මහණෙනි, නුඹලා දැන් රැස්ව සිට කිනම් කතාවක යෙදී සිටින්නෙහිද? නුඹලාගේ මැද නවත්වා දමා ඇති කතාව කුමක්දැයි?”\n\n‘‘වහන්ස, අපි දහවල් දානය වළඳා පිණ්ඩපාතයෙන් ආපසු වැඩමකොට උපස්ථාන ශාලාවෙහි රැස්ව සිට, රජුන් පිළිබඳ කතා, සොරුන් පිළිබඳ කතා… යනාදී, මෙලොව පරලොව පිළිබඳ කතා දක්වා වූ නොයෙක් ආකාර තිරශ්චීන කතාවල යෙදී සිටිමු.’’\n\n‘‘මහණෙනි, ශ්‍ර‍ද්ධාවෙන් ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට පැමිණි ඔබට මෙය සුදුසු නොවේ. එනම්, නුඹලා රජුන් පිළිබඳ කතා, සොරුන් පිළිබඳ කතා, අමාත්‍යවරුන් පිළිබඳ කතා, සේනා පිළිබඳ කතා, භය පිළිබඳ කතා, යුද්ධ පිළිබඳ කතා, ආහාර පිළිබඳ කතා, පාන වර්ග පිළිබඳ කතා, වස්ත්‍ර පිළිබඳ කතා, සයන පිළිබඳ කතා, මල් පිළිබඳ කතා, සුවඳ වර්ග පිළිබඳ කතා, ඥාතීන් පිළිබඳ කතා, යාන වාහන පිළිබඳ කතා, ගම් පිළිබඳ කතා, නියම්ගම් පිළිබඳ කතා, නගර පිළිබඳ කතා, ජනපද පිළිබඳ කතා, ස්ත්‍රීන් පිළිබඳ කතා, වීර පුරුෂයන් පිළිබඳ කතා, වීථි පිළිබඳ කතා, මඟුල් තොටුපළවල් පිළිබඳ කතා, පෙරේතයන් පිළිබඳ කතා, නොයෙක් ආකාර වූ කතා, ලෝකය පිළිබඳ කතා, සාගරය පිළිබඳ කතා, මෙලොව පරලොව පිළිබඳ කතා යනාදී නොයෙක් ආකාර තිරශ්චීන කතාවල යෙදී වාසය කිරීම සුදුසු නොවේ.\n\n‘‘මහණෙනි, මේ කතා වස්තූන් දසයකි. කවරේද ඒ දසය? අල්පේච්ඡතා කතාව, සන්තුෂ්ටිකතා කතාව, ප්‍ර‍විවේක කතාව, අසංසර්ග කතාව, වීර්යාරම්භ කතාව, සීල කතාව, සමාධි කතාව, ප්‍ර‍ඥා කතාව, විමුක්ති කතාව, විමුක්තිඥාන දර්ශන කතාව යන මේවායි. මහණෙනි, මේවා කතා වස්තූන් දසයයි.\n\n‘‘මහණෙනි, නුඹලා මේ කතා වස්තූන් දසය අරමුණු කරමින් කතා කරන්නේ නම්, මෙතරම් මහත් ඍද්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති චන්ද්‍රයාගේ සහ සූර්යයාගේ තේජස පවා ඉක්මවා සිටීමට නුඹලාට පුළුවන. අන්‍ය තීර්ථක පරිබ්‍රාජකයන් ගැන කවර කතාද?”",
      "paliTitle": "Paṭhamakathāvatthusuttaṃ",
      "englishTitle": "First Discourse on Points of Controversy",
      "sinhalaTitle": "පළමු කථාවස්තු සූත්‍රය"
    },
    {
      "number": 70,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena sambahulā bhikkhū pacchābhattaṃ piṇḍapātapaṭikkantā upaṭṭhānasālāyaṃ sannisinnā sannipatitā anekavihitaṃ tiracchānakathaṃ anuyuttā viharanti, seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ…pe… itibhavābhavakathaṃ iti vāti. ‘‘Dasayimāni, bhikkhave, pāsaṃsāni ṭhānāni. Katamāni dasa? Idha, bhikkhave, bhikkhu attanā ca appiccho hoti, appicchakathañca bhikkhūnaṃ kattā hoti. ‘Appiccho bhikkhu appicchakathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca santuṭṭho hoti, santuṭṭhikathañca bhikkhūnaṃ kattā hoti. ‘Santuṭṭho bhikkhu santuṭṭhikathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca pavivitto hoti, pavivekakathañca bhikkhūnaṃ kattā hoti. ‘Pavivitto bhikkhu pavivekakathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca asaṃsaṭṭho hoti, asaṃsaṭṭhakathañca bhikkhūnaṃ kattā hoti. ‘Asaṃsaṭṭho bhikkhu asaṃsaṭṭhakathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca āraddhavīriyo hoti, vīriyārambhakathañca bhikkhūnaṃ kattā hoti. ‘Āraddhavīriyo bhikkhu vīriyārambhakathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca sīlasampanno hoti, sīlasampadākathañca bhikkhūnaṃ kattā hoti. ‘Sīlasampanno bhikkhu sīlasampadākathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca samādhisampanno hoti, samādhisampadākathañca bhikkhūnaṃ kattā hoti. ‘Samādhisampanno bhikkhu samādhisampadākathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca paññāsampanno hoti, paññāsampadākathañca bhikkhūnaṃ kattā hoti. ‘Paññāsampanno bhikkhu paññāsampadākathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca vimuttisampanno hoti, vimuttisampadākathañca bhikkhūnaṃ kattā hoti. ‘Vimuttisampanno bhikkhu vimuttisampadākathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. ‘‘Attanā ca vimuttiñāṇadassanasampanno hoti, vimuttiñāṇadassanasampadākathañca bhikkhūnaṃ kattā hoti. ‘Vimuttiñāṇadassanasampanno bhikkhu vimuttiñāṇadassanasampadākathañca bhikkhūnaṃ kattā’ti pāsaṃsametaṃ ṭhānaṃ. Imāni kho, bhikkhave, dasa pāsaṃsāni ṭhānānī’’ti. Dasamaṃ. ",
      "english": "At one time, the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery. Now at that time, a considerable number of bhikkhus, having returned from their alms-round after their meal, were sitting assembled in the service hall, engaged in various kinds of mundane talk, such as talk of kings, talk of bandits, talk of ministers… and so on… talk of existence in this world and the next.\n\n“Bhikkhus, there are these ten praiseworthy qualities. Which ten? Here, bhikkhus, a bhikkhu is content with little himself, and he is one who speaks to bhikkhus about being content with little. ‘A bhikkhu who is content with little himself, and is one who speaks to bhikkhus about being content with little’ — this quality is praiseworthy. He is content himself, and he is one who speaks to bhikkhus about contentment. ‘A bhikkhu who is content himself, and is one who speaks to bhikkhus about contentment’ — this quality is praiseworthy. He is secluded himself, and he is one who speaks to bhikkhus about seclusion. ‘A bhikkhu who is secluded himself, and is one who speaks to bhikkhus about seclusion’ — this quality is praiseworthy. He is unentangled himself, and he is one who speaks to bhikkhus about being unentangled. ‘A bhikkhu who is unentangled himself, and is one who speaks to bhikkhus about being unentangled’ — this quality is praiseworthy. He has aroused energy himself, and he is one who speaks to bhikkhus about arousing energy. ‘A bhikkhu who has aroused energy himself, and is one who speaks to bhikkhus about arousing energy’ — this quality is praiseworthy. He is accomplished in virtue himself, and he is one who speaks to bhikkhus about accomplishment in virtue. ‘A bhikkhu who is accomplished in virtue himself, and is one who speaks to bhikkhus about accomplishment in virtue’ — this quality is praiseworthy. He is accomplished in concentration himself, and he is one who speaks to bhikkhus about accomplishment in concentration. ‘A bhikkhu who is accomplished in concentration himself, and is one who speaks to bhikkhus about accomplishment in concentration’ — this quality is praiseworthy. He is accomplished in wisdom himself, and he is one who speaks to bhikkhus about accomplishment in wisdom. ‘A bhikkhu who is accomplished in wisdom himself, and is one who speaks to bhikkhus about accomplishment in wisdom’ — this quality is praiseworthy. He is accomplished in liberation himself, and he is one who speaks to bhikkhus about accomplishment in liberation. ‘A bhikkhu who is accomplished in liberation himself, and is one who speaks to bhikkhus about accomplishment in liberation’ — this quality is praiseworthy. He is accomplished in the knowledge and vision of liberation himself, and he is one who speaks to bhikkhus about accomplishment in the knowledge and vision of liberation. ‘A bhikkhu who is accomplished in the knowledge and vision of liberation himself, and is one who speaks to bhikkhus about accomplishment in the knowledge and vision of liberation’ — this quality is praiseworthy. Bhikkhus, these are the ten praiseworthy qualities.”",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක.\n\nඒ කල්හි බොහෝ භික්ෂූහු භෝජනයෙන් පසු පිණ්ඩපාතයෙන් වැළකුණාහු උපස්ථානශාලාවෙහි එක්රැස්ව වැඩහිඳ, රාජකථා, චෝරකථා, මහාමාත්‍යකථා යනාදී වශයෙන් මෙලොව පරලොව කථා දක්වා නොයෙක් අයුරු වූ තිරශ්චීන කථාවෙහි යෙදී වාසය කරති.\n\n“මහණෙනි, මේ දස ධර්ම කාරණා ප්‍රශංසාවට සුදුසු ය. ඒ දසය කුමක්ද?\n\n“මහණෙනි, මෙහිලා භික්ෂුව තමන් විසින්ම අල්පේච්ඡ වෙයි. අල්පේච්ඡ බව ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව අල්පේච්ඡ වෙයි, අල්පේච්ඡ බව ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම සතුටු වෙයි. සතුටු වීම ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව සතුටු වෙයි, සතුටු වීම ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම විවේකයෙන් යුක්ත වෙයි. විවේකය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව විවේකයෙන් යුක්ත වෙයි, විවේකය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම නොගැටුණු (අසංසර්ගී) වෙයි. නොගැටීම ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව නොගැටුණු වෙයි, නොගැටීම ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම පටන්ගත් වීර්යයෙන් යුක්ත වෙයි. වීර්යය ආරම්භ කිරීම ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව පටන්ගත් වීර්යයෙන් යුක්ත වෙයි, වීර්යය ආරම්භ කිරීම ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම සීල සම්පන්න වෙයි. සීල සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව සීල සම්පන්න වෙයි, සීල සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම සමාධි සම්පන්න වෙයි. සමාධි සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව සමාධි සම්පන්න වෙයි, සමාධි සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම ප්‍රඥා සම්පන්න වෙයි. ප්‍රඥා සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව ප්‍රඥා සම්පන්න වෙයි, ප්‍රඥා සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම විමුක්ති සම්පන්න වෙයි. විමුක්ති සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව විමුක්ති සම්පන්න වෙයි, විමුක්ති සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\nතමන් විසින්ම විමුක්ති ඥාන දර්ශන සම්පන්න වෙයි. විමුක්ති ඥාන දර්ශන සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි. ‘භික්ෂුව විමුක්ති ඥාන දර්ශන සම්පන්න වෙයි, විමුක්ති ඥාන දර්ශන සම්පත්තිය ගැන කථාව භික්ෂූන්ට ද කරන්නෙක් වෙයි’ යනු ප්‍රශංසනීය කාරණාවකි.\n\n“මහණෙනි, මේ දස ධර්ම කාරණා ප්‍රශංසාවට සුදුසු ය”යි වදාළ සේක. දසවෙනි සූත්‍රයයි.",
      "paliTitle": "Dutiyakathāvatthusuttaṃ",
      "englishTitle": "Second Discourse on the Topic",
      "sinhalaTitle": "දෙවැනි කථාවස්තු සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Yamakavaggo dutiyo. Tassuddānaṃ – Avijjā taṇhā niṭṭhā ca, avecca dve sukhāni ca; Naḷakapāne dve vuttā, kathāvatthūpare duveti.",
    "english": "Second Chapter on Pairs",
    "sinhala": "දෙවැනි යමක වග්ගය"
  }
}