{
  "id": "an10.20",
  "title": {
    "pali": "Aparapuggalavaggo",
    "english": "The Section on Other Individuals",
    "sinhala": "අන්‍ය පුද්ගල වර්ගය"
  },
  "sections": [
    {
      "number": 199,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato puggalo na sevitabbo. Katamehi dasahi? Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti, abhijjhālu hoti, byāpannacitto hoti, micchādiṭṭhiko hoti – imehi kho, bhikkhave, dasahi dhammehi samannāgato puggalo na sevitabbo. ‘‘Dasahi, bhikkhave, dhammehi samannāgato puggalo sevitabbo. Katamehi dasahi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhiko hoti – imehi kho, bhikkhave, dasahi dhammehi samannāgato puggalo sevitabbo’’.",
      "english": "Monks, a person endowed with ten qualities should not be associated with. Which ten? He is one who takes life, one who takes what is not given, one who engages in sexual misconduct, one who speaks falsehoods, one who speaks divisive speech, one who speaks harsh speech, one who engages in idle chatter, one who is covetous, one who harbors ill will, and one who holds wrong view. Monks, a person endowed with these ten qualities should not be associated with.\n\nMonks, a person endowed with ten qualities should be associated with. Which ten? He is one who refrains from taking life, one who refrains from taking what is not given, one who refrains from sexual misconduct, one who refrains from speaking falsehoods, one who refrains from divisive speech, one who refrains from harsh speech, one who refrains from idle chatter, one who is not covetous, one who harbors no ill will, and one who holds right view. Monks, a person endowed with these ten qualities should be associated with.",
      "sinhala": "මහණෙනි, කරුණු දහයකින් යුක්ත පුද්ගලයෙක් සේවනය නොකළ යුත්තේය. කවර දහයකින්ද? පණ තළන්නෙක් වෙයි, අනුන් සතු දේ හොරෙන් ගන්නෙක් වෙයි, කාමයන්හි වරදවා හැසිරෙන්නෙක් වෙයි, බොරු කියන්නෙක් වෙයි, පිසුණු බස් කියන්නෙක් වෙයි, පරොස් බස් කියන්නෙක් වෙයි, සම්ප්‍ර‍ප්ලාපී වචන කියන්නෙක් වෙයි, අභිධ්‍යාව සහිත වෙයි, ව්‍යාපාද චිත්තයකින් යුක්ත වෙයි, මිත්‍යා දෘෂ්ටිකයෙක් වෙයි. මහණෙනි, මේ කරුණු දහයකින් යුක්ත පුද්ගලයෙක් සේවනය නොකළ යුත්තේය.\n\nමහණෙනි, කරුණු දහයකින් යුක්ත පුද්ගලයෙක් සේවනය කළ යුත්තේය. කවර දහයකින්ද? පණ තළා ගැනීමෙන් වැළකුණෙක් වෙයි, අනුන් සතු දේ හොරෙන් ගැනීමෙන් වැළකුණෙක් වෙයි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණෙක් වෙයි, බොරු කීමෙන් වැළකුණෙක් වෙයි, පිසුණු බස් කීමෙන් වැළකුණෙක් වෙයි, පරොස් බස් කීමෙන් වැළකුණෙක් වෙයි, සම්ප්‍ර‍ප්ලාපී වචන කීමෙන් වැළකුණෙක් වෙයි, අභිධ්‍යාවෙන් තොර වෙයි, ව්‍යාපාද චිත්තයෙන් තොර වෙයි, සම්මා දෘෂ්ටිකයෙක් වෙයි. මහණෙනි, මේ කරුණු දහයකින් යුක්ත පුද්ගලයෙක් සේවනය කළ යුත්තේය.",
      "paliTitle": "Nasevitabbādisuttāni",
      "englishTitle": "Discourses on What Not to Cultivate",
      "sinhalaTitle": "නොසේවිය යුතු ආදී සූත්‍\\u200Dර"
    },
    {
      "number": 200,
      "numberRange": "200-209",
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato puggalo na bhajitabbo…pe… bhajitabbo… na payirupāsitabbo… payirupāsitabbo… na pujjo hoti… pujjo hoti… na pāsaṃso hoti… pāsaṃso hoti… agāravo hoti… gāravo hoti… appatisso hoti… sappatisso hoti… na ārādhako hoti… ārādhako hoti… na visujjhati… visujjhati… mānaṃ nādhibhoti [nābhibhoti (sī.) a. ni. 10.156-166] … mānaṃ adhibhoti… paññāya na vaḍḍhati… paññāya vaḍḍhati…pe….",
      "english": "Monks, a person endowed with ten qualities should not be associated with, should not be attended upon, is not venerable, is not praiseworthy, is disrespectful, is not heedful, is not a successful practitioner, does not become purified, does not overcome conceit, and does not grow in wisdom. A person endowed with ten qualities should be associated with, should be attended upon, is venerable, is praiseworthy, is respectful, is heedful, is a successful practitioner, becomes purified, overcomes conceit, and grows in wisdom.",
      "sinhala": "භික්ෂූණි, දස ධර්මයන්ගෙන් සමන්වාගත වූ පුද්ගලයෙක් ඇසුරු නොකළ යුතු ය, නැතහොත් ඇසුරු කළ යුතු ය; උපස්ථාන නොකළ යුතු ය, නැතහොත් උපස්ථාන කළ යුතු ය; පිදිය යුතු නොවේ, නැතහොත් පිදිය යුතු ය; ප්‍රශංසා නොකළ යුතු ය, නැතහොත් ප්‍රශංසා කළ යුතු ය; ගරු නොකරන කෙනෙක් වේ, නැතහොත් ගරු කරන කෙනෙක් වේ; ගෞරවයෙන් නොසලකන කෙනෙක් වේ, නැතහොත් ගෞරවයෙන් සලකන කෙනෙක් වේ; සාර්ථක නොවන කෙනෙක් වේ, නැතහොත් සාර්ථක කෙනෙක් වේ; පිරිසිදු නොවේ, නැතහොත් පිරිසිදු වේ; මානය ජය නොගනී, නැතහොත් මානය ජය ගනී; ප්‍රඥාවෙන් වර්ධනය නොවේ, නැතහොත් ප්‍රඥාවෙන් වර්ධනය වේ.",
      "paliTitle": ""
    },
    {
      "number": 210,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato puggalo bahuṃ apuññaṃ pasavati… bahuṃ puññaṃ pasavati. Katamehi dasahi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhiko hoti – imehi kho, bhikkhave, dasahi dhammehi samannāgato puggalo bahuṃ puññaṃ pasavatī’’ti. ",
      "english": "Bhikkhus, a person endowed with ten qualities generates much merit. Which ten?\nOne abstains from taking life, abstains from taking what is not given, abstains from sexual misconduct, abstains from false speech, abstains from divisive speech, abstains from harsh speech, abstains from idle chatter, is not covetous, has a mind free from ill-will, and has right view. Indeed, Bhikkhus, a person endowed with these ten qualities generates much merit.",
      "sinhala": "භික්‍ෂූනි, දස ධර්මයන්ගෙන් සමන්වාගත පුද්ගලයෙක් බොහෝ අකුසල් රැස් කරගනී... බොහෝ පින් රැස් කරගනී. ඒ දසය කුමක්ද?\n\nසතුන් මැරීමෙන් වැළකී සිටින්නේය, අනුන් සතු දේ සොරකම් කිරීමෙන් වැළකී සිටින්නේය, කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටින්නේය, මුසාවාදයෙන් වැළකී සිටින්නේය, කේළාම් කීමෙන් වැළකී සිටින්නේය, රළු වචන කීමෙන් වැළකී සිටින්නේය, නිෂ්ඵල කතාවෙන් වැළකී සිටින්නේය, අනුන් සතු දේට ආශා නොකරන්නෙක් වන්නේය, ද්වේෂයෙන් තොර සිතක් ඇත්තේය, සම්මා දිට්ඨියෙන් යුක්ත වන්නේය – භික්‍ෂූනි, මේ දස ධර්මයන්ගෙන් සමන්වාගත පුද්ගලයෙක් බොහෝ පින් රැස් කරගනී.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Aparapuggalavaggo pañcamo. Catutthapaṇṇāsakaṃ samattaṃ.",
    "english": "Fifth Chapter: Other Persons; Fourth Fifty Concluded.",
    "sinhala": "පස්වන අපරපුග්ගල වර්ගය. සිව්වන පණ්ණාසකය නිමයි."
  }
}