{
  "id": "an10.22",
  "title": {
    "pali": "Sāmaññavaggo",
    "english": "The Chapter on Recluseship",
    "sinhala": "සාමණ්‍ය වර්‍ගය"
  },
  "sections": [
    {
      "number": 221,
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi dasahi? Pāṇātipātī hoti, adinnādāyī hoti, kāmesumicchācārī hoti, musāvādī hoti, pisuṇavāco hoti, pharusavāco hoti, samphappalāpī hoti, abhijjhālu hoti, byāpannacitto hoti, micchādiṭṭhiko hoti – imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Dasahi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi dasahi? Pāṇātipātā paṭivirato hoti, adinnādānā paṭivirato hoti, kāmesumicchācārā paṭivirato hoti, musāvādā paṭivirato hoti, pisuṇāya vācāya paṭivirato hoti, pharusāya vācāya paṭivirato hoti, samphappalāpā paṭivirato hoti, anabhijjhālu hoti, abyāpannacitto hoti, sammādiṭṭhiko hoti – imehi kho, bhikkhave, dasahi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti.",
      "english": "Monks, one endowed with ten qualities is, as it were, taken up and deposited directly into hell. Which ten? One is a killer of living beings; one takes what is not given; one engages in sexual misconduct; one speaks falsely; one speaks divisively; one speaks harshly; one engages in idle chatter; one is covetous; one has ill-will; one holds wrong view. Indeed, monks, one endowed with these ten qualities is, as it were, taken up and deposited directly into hell.\n\nMonks, one endowed with ten qualities is, as it were, taken up and deposited directly into heaven. Which ten? One abstains from taking life; one abstains from taking what is not given; one abstains from sexual misconduct; one abstains from false speech; one abstains from divisive speech; one abstains from harsh speech; one abstains from idle chatter; one is not covetous; one has a mind free from ill-will; one holds right view. Indeed, monks, one endowed with these ten qualities is, as it were, taken up and deposited directly into heaven.",
      "sinhala": "භික්ෂූනි, කරුණු දසයකින් සමන්විත වූ තැනැත්තා ගෙනගොස් දැමුවාක් මෙන් නිරයට වැටේ. කවර දසයකින් ද? ප්‍රාණඝාතය කරන්නෙක් වේ, අදත්තාදානය කරන්නෙක් වේ, කාමයන්හි වරදවා හැසිරෙන්නෙක් වේ, මුසාවාද කියන්නෙක් වේ, පිසුණු වචන කියන්නෙක් වේ, ඵරුෂ වචන කියන්නෙක් වේ, සම්ඵප්පලාප කියන්නෙක් වේ, අභිධ්‍යා සහිත වෙයි, ව්‍යාපාද සිත් ඇත්තෙක් වෙයි, මිථ්‍යාදෘෂ්ටික වෙයි – භික්ෂූනි, මෙන්න මේ දස වැදෑරුම් කරුණු වලින් සමන්විත වූ තැනැත්තා ගෙනගොස් දැමුවාක් මෙන් නිරයට වැටේ.\n\nභික්ෂූනි, කරුණු දසයකින් සමන්විත වූ තැනැත්තා ගෙනගොස් දැමුවාක් මෙන් ස්‍වර්ගයට වැටේ. කවර දසයකින් ද? ප්‍රාණඝාතයෙන් වැළකුණෙක් වේ, අදත්තාදානයෙන් වැළකුණෙක් වේ, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණෙක් වේ, මුසාවාදයෙන් වැළකුණෙක් වේ, පිසුණු වචනයෙන් වැළකුණෙක් වේ, ඵරුෂ වචනයෙන් වැළකුණෙක් වේ, සම්ඵප්පලාපයෙන් වැළකුණෙක් වේ, අභිධ්‍යා රහිත වෙයි, ව්‍යාපාද සිත් රහිත වෙයි, සම්මාදිට්ඨික වෙයි – භික්ෂූනි, මෙන්න මේ දස වැදෑරුම් කරුණු වලින් සමන්විත වූ තැනැත්තා ගෙනගොස් දැමුවාක් මෙන් ස්‍වර්ගයට වැටේ.",
      "paliTitle": ""
    },
    {
      "number": 222,
      "pali": "‘‘Vīsatiyā, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi vīsatiyā? Attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti; attanā ca adinnādāyī hoti, parañca adinnādāne samādapeti; attanā ca kāmesumicchācārī hoti, parañca kāmesumicchācāre samādapeti; attanā ca musāvādī hoti, parañca musāvāde samādapeti; attanā ca pisuṇavāco hoti, parañca pisuṇāya vācāya samādapeti; attanā ca pharusavāco hoti, parañca pharusāya vācāya samādapeti; attanā ca samphappalāpī hoti, parañca samphappalāpe samādapeti; attanā ca abhijjhālu hoti, parañca abhijjhāya samādapeti; attanā ca byāpannacitto hoti, parañca byāpāde samādapeti; attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti – imehi kho, bhikkhave, vīsatiyā dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Vīsatiyā, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi vīsatiyā? Attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti; attanā ca adinnādānā paṭivirato hoti, parañca adinnādānā veramaṇiyā samādapeti; attanā ca kāmesumicchācārā paṭivirato hoti, parañca kāmesumicchācārā veramaṇiyā samādapeti; attanā ca musāvādā paṭivirato hoti, parañca musāvādā veramaṇiyā samādapeti; attanā ca pisuṇāya vācāya paṭivirato hoti, parañca pisuṇāya vācāya veramaṇiyā samādapeti; attanā ca pharusāya vācāya paṭivirato hoti, parañca pharusāya vācāya veramaṇiyā samādapeti; attanā ca samphappalāpā paṭivirato hoti, parañca samphappalāpā veramaṇiyā samādapeti; attanā ca anabhijjhālu hoti, parañca anabhijjhāya samādapeti; attanā ca abyāpannacitto hoti, parañca abyāpāde samādapeti; attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti – imehi kho, bhikkhave, vīsatiyā dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti.",
      "english": "Monks, one endowed with twenty qualities is deposited in hell just as if he were carried there. Which twenty? He himself is a killer of living beings, and he incites others to kill living beings; he himself is one who takes what is not given, and he incites others to take what is not given; he himself is one who engages in sexual misconduct, and he incites others to engage in sexual misconduct; he himself is a speaker of falsehoods, and he incites others to speak falsehoods; he himself is a speaker of divisive speech, and he incites others to speak divisive speech; he himself is a speaker of harsh speech, and he incites others to speak harsh speech; he himself is a speaker of idle chatter, and he incites others to speak idle chatter; he himself is covetous, and he incites others to covetousness; he himself has ill will, and he incites others to ill will; he himself holds wrong view, and he incites others to hold wrong view. Monks, one endowed with these twenty qualities is deposited in hell just as if he were carried there.\n\nMonks, one endowed with twenty qualities is deposited in heaven just as if he were carried there. Which twenty? He himself abstains from killing living beings, and he incites others to abstinence from killing living beings; he himself abstains from taking what is not given, and he incites others to abstinence from taking what is not given; he himself abstains from sexual misconduct, and he incites others to abstinence from sexual misconduct; he himself abstains from false speech, and he incites others to abstinence from false speech; he himself abstains from divisive speech, and he incites others to abstinence from divisive speech; he himself abstains from harsh speech, and he incites others to abstinence from harsh speech; he himself abstains from idle chatter, and he incites others to abstinence from idle chatter; he himself is not covetous, and he incites others to non-covetousness; he himself has a mind free from ill will, and he incites others to non-ill will; he himself holds right view, and he incites others to hold right view. Monks, one endowed with these twenty qualities is deposited in heaven just as if he were carried there.",
      "sinhala": "භික්ෂූණි, විසි ධර්‍මයකින් සමන්විත වූ පුද්ගලයා යම්සේ ගෙනවිත් දැමුවාක් මෙන් නිරයේ උපදියි. ඒ විසි ධර්‍මයෝ කවරහුද? තමා ද ප්‍ර‍ාණඝාතයෙහි යෙදෙයි, අනුන් ද ප්‍ර‍ාණඝාතයෙහි සමාදන් කරවයි; තමා ද අදින්නාදානයෙහි යෙදෙයි, අනුන් ද අදින්නාදානයෙහි සමාදන් කරවයි; තමා ද කාමයන්හි වරදවා හැසිරෙයි, අනුන් ද කාමයන්හි වරදවා හැසිරීමෙහි සමාදන් කරවයි; තමා ද මුසාවාදයෙහි යෙදෙයි, අනුන් ද මුසාවාදයෙහි සමාදන් කරවයි; තමා ද පිසුණු වචන කියයි, අනුන් ද පිසුණු වචන කීමෙහි සමාදන් කරවයි; තමා ද ඵරුෂ වචන කියයි, අනුන් ද ඵරුෂ වචන කීමෙහි සමාදන් කරවයි; තමා ද සම්ඵප්පලාප කියයි, අනුන් ද සම්ඵප්පලාප කීමෙහි සමාදන් කරවයි; තමා ද අභිජ්ඣා සහගත වෙයි, අනුන් ද අභිජ්ඣාවෙහි සමාදන් කරවයි; තමා ද ව්‍ය‍ාපාද චිත්තයෙන් යුක්ත වෙයි, අනුන් ද ව්‍ය‍ාපාදයෙහි සමාදන් කරවයි; තමා ද මිත්‍ය‍ාදෘෂ්ටික වෙයි, අනුන් ද මිත්‍ය‍ාදෘෂ්ටියෙහි සමාදන් කරවයි – භික්ෂූණි, මේ විසි ධර්‍මයකින් සමන්විත වූ පුද්ගලයා යම්සේ ගෙනවිත් දැමුවාක් මෙන් නිරයේ උපදියි.\n\nභික්ෂූණි, විසි ධර්‍මයකින් සමන්විත වූ පුද්ගලයා යම්සේ ගෙනවිත් දැමුවාක් මෙන් ස්වර්ගයේ උපදියි. ඒ විසි ධර්‍මයෝ කවරහුද? තමා ද ප්‍ර‍ාණඝාතයෙන් වැළකී සිටියි, අනුන් ද ප්‍ර‍ාණඝාතයෙන් වැළකීමෙහි සමාදන් කරවයි; තමා ද අදින්නාදානයෙන් වැළකී සිටියි, අනුන් ද අදින්නාදානයෙන් වැළකීමෙහි සමාදන් කරවයි; තමා ද කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි, අනුන් ද කාමයන්හි වරදවා හැසිරීමෙන් වැළකීමෙහි සමාදන් කරවයි; තමා ද මුසාවාදයෙන් වැළකී සිටියි, අනුන් ද මුසාවාදයෙන් වැළකීමෙහි සමාදන් කරවයි; තමා ද පිසුණු වචන කීමෙන් වැළකී සිටියි, අනුන් ද පිසුණු වචන කීමෙන් වැළකීමෙහි සමාදන් කරවයි; තමා ද ඵරුෂ වචන කීමෙන් වැළකී සිටියි, අනුන් ද ඵරුෂ වචන කීමෙන් වැළකීමෙහි සමාදන් කරවයි; තමා ද සම්ඵප්පලාප කීමෙන් වැළකී සිටියි, අනුන් ද සම්ඵප්පලාප කීමෙන් වැළකීමෙහි සමාදන් කරවයි; තමා ද අභිජ්ඣා රහිත වෙයි, අනුන් ද අභිජ්ඣා රහිත වීමෙහි සමාදන් කරවයි; තමා ද ව්‍ය‍ාපාද රහිත චිත්තයෙන් යුක්ත වෙයි, අනුන් ද ව්‍ය‍ාපාද රහිත වීමෙහි සමාදන් කරවයි; තමා ද සම්මාදෘෂ්ටික වෙයි, අනුන් ද සම්මාදෘෂ්ටියෙහි සමාදන් කරවයි – භික්ෂූණි, මේ විසි ධර්‍මයකින් සමන්විත වූ පුද්ගලයා යම්සේ ගෙනවිත් දැමුවාක් මෙන් ස්වර්ගයේ උපදියි.",
      "paliTitle": ""
    },
    {
      "number": 223,
      "pali": "‘‘Tiṃsāya, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi tiṃsāya? Attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti, pāṇātipāte ca samanuñño hoti; attanā ca adinnādāyī hoti, parañca adinnādāne samādapeti, adinnādāne ca samanuñño hoti; attanā ca kāmesumicchācārī hoti, parañca kāmesumicchācāre samādapeti, kāmesumicchācāre ca samanuñño hoti; attanā ca musāvādī hoti, parañca musāvāde samādapeti, musāvāde ca samanuñño hoti; attanā ca pisuṇavāco hoti, parañca pisuṇāya vācāya samādapeti, pisuṇāya vācāya ca samanuñño hoti; attanā ca pharusavāco hoti, parañca pharusāya vācāya samādapeti, pharusāya vācāya ca samanuñño hoti; attanā ca samphappalāpī hoti, parañca samphappalāpe samādapeti, samphappalāpe ca samanuñño hoti; attanā ca abhijjhālu hoti, parañca abhijjhāya samādapeti, abhijjhāya ca samanuñño hoti; attanā ca byāpannacitto hoti, parañca byāpāde samādapeti, byāpāde ca samanuñño hoti; attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti, micchādiṭṭhiyā ca samanuñño hoti – imehi kho, bhikkhave, tiṃsāya dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Tiṃsāya, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi tiṃsāya? Attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti, pāṇātipātā veramaṇiyā ca samanuñño hoti; attanā ca adinnādānā paṭivirato hoti, parañca adinnādānā veramaṇiyā samādapeti, adinnādānā veramaṇiyā ca samanuñño hoti; attanā ca kāmesumicchācārā paṭivirato hoti, parañca kāmesumicchācārā veramaṇiyā samādapeti, kāmesumicchācārā veramaṇiyā ca samanuñño hoti; attanā ca musāvādā paṭivirato hoti, parañca musāvādā veramaṇiyā samādapeti, musāvādā veramaṇiyā ca samanuñño hoti; attanā ca pisuṇāya vācāya paṭivirato hoti, parañca pisuṇāya vācāya veramaṇiyā samādapeti, pisuṇāya vācāya veramaṇiyā ca samanuñño hoti; attanā ca pharusāya vācāya paṭivirato hoti, parañca pharusāya vācāya veramaṇiyā samādapeti, pharusāya vācāya veramaṇiyā ca samanuñño hoti; attanā ca samphappalāpā paṭivirato hoti, parañca samphappalāpā veramaṇiyā samādapeti, samphappalāpā veramaṇiyā ca samanuñño hoti; attanā ca anabhijjhālu hoti, parañca anabhijjhāya samādapeti, anabhijjhāya ca samanuñño hoti; attanā ca abyāpannacitto hoti, parañca abyāpāde samādapeti, abyāpāde ca samanuñño hoti; attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti, sammādiṭṭhiyā ca samanuñño hoti – imehi kho, bhikkhave, tiṃsāya dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti.",
      "english": "Monks, one endowed with thirty qualities is cast into hell just as if brought and placed there. Which thirty? Here, one himself takes life, encourages others to take life, and approves of the taking of life; one himself takes what is not given, encourages others to take what is not given, and approves of the taking of what is not given; one himself engages in sexual misconduct, encourages others to engage in sexual misconduct, and approves of sexual misconduct; one himself speaks falsely, encourages others to speak falsely, and approves of false speech; one himself speaks divisively, encourages others to speak divisively, and approves of divisive speech; one himself speaks harshly, encourages others to speak harshly, and approves of harsh speech; one himself engages in idle chatter, encourages others to engage in idle chatter, and approves of idle chatter; one himself is covetous, encourages others in covetousness, and approves of covetousness; one himself has ill will, encourages others in ill will, and approves of ill will; one himself holds wrong view, encourages others in wrong view, and approves of wrong view. Indeed, monks, one endowed with these thirty qualities is cast into hell just as if brought and placed there.\n\nMonks, one endowed with thirty qualities is cast into heaven just as if brought and placed there. Which thirty? Here, one himself abstains from taking life, encourages others to abstain from taking life, and approves of the abstention from taking life; one himself abstains from taking what is not given, encourages others to abstain from taking what is not given, and approves of the abstention from taking what is not given; one himself abstains from sexual misconduct, encourages others to abstain from sexual misconduct, and approves of the abstention from sexual misconduct; one himself abstains from false speech, encourages others to abstain from false speech, and approves of the abstention from false speech; one himself abstains from divisive speech, encourages others to abstain from divisive speech, and approves of the abstention from divisive speech; one himself abstains from harsh speech, encourages others to abstain from harsh speech, and approves of the abstention from harsh speech; one himself abstains from idle chatter, encourages others to abstain from idle chatter, and approves of the abstention from idle chatter; one himself is non-covetous, encourages others in non-covetousness, and approves of non-covetousness; one himself has a benevolent mind, encourages others in benevolence, and approves of benevolence; one himself holds right view, encourages others in right view, and approves of right view. Indeed, monks, one endowed with these thirty qualities is cast into heaven just as if brought and placed there.",
      "sinhala": "භික්ෂූනි, මේ තිස් ආකාරයක ධර්මයන්ගෙන් සමන්විත වූ පුද්ගලයා තමන් විසින්ම ගෙන ගොස් තැන්පත් කළාක් මෙන් නිරයට වැටෙයි. කුමන තිස් ආකාරයකින් ද? තමා විසින් ද ප්‍රාණඝාතයෙහි යෙදෙයි, අනුන් ද ප්‍රාණඝාතයෙහි සමාදන් කරවයි, ප්‍රාණඝාතය අනුමත කරයි; තමා විසින් ද අදත්තාදානයෙහි (නොදුන් දෙය ගැනීමෙහි) යෙදෙයි, අනුන් ද අදත්තාදානයෙහි සමාදන් කරවයි, අදත්තාදානය අනුමත කරයි; තමා විසින් ද කාමයන්හි වරදවා හැසිරෙයි (කාමමිථ්‍යාචාරයෙහි යෙදෙයි), අනුන් ද කාමමිථ්‍යාචාරයෙහි සමාදන් කරවයි, කාමමිථ්‍යාචාරය අනුමත කරයි; තමා විසින් ද මුසාවාදයෙහි (බොරු කීමෙහි) යෙදෙයි, අනුන් ද මුසාවාදයෙහි සමාදන් කරවයි, මුසාවාදය අනුමත කරයි; තමා විසින් ද පිසුණා වචන (කේළාම් කීමෙහි) යෙදෙයි, අනුන් ද පිසුණා වචන කීමෙහි සමාදන් කරවයි, පිසුණා වචන කීම අනුමත කරයි; තමා විසින් ද ඵරුෂ වචන (බරපතළ වචන කීමෙහි) යෙදෙයි, අනුන් ද ඵරුෂ වචන කීමෙහි සමාදන් කරවයි, ඵරුෂ වචන කීම අනුමත කරයි; තමා විසින් ද සම්ඵප්පලාපයෙහි (හිස් වචන කීමෙහි) යෙදෙයි, අනුන් ද සම්ඵප්පලාපයෙහි සමාදන් කරවයි, සම්ඵප්පලාපය අනුමත කරයි; තමා විසින් ද අභිජ්ඣාවෙන් (අනුන්ගේ දේට ආශා කිරීමෙන්) යුක්ත වෙයි, අනුන් ද අභිජ්ඣාවෙහි සමාදන් කරවයි, අභිජ්ඣාව අනුමත කරයි; තමා විසින් ද ව්‍යාපාද චිත්තයෙන් (ක්‍රෝධ සිතින්) යුක්ත වෙයි, අනුන් ද ව්‍යාපාදයෙහි සමාදන් කරවයි, ව්‍යාපාදය අනුමත කරයි; තමා විසින් ද මිථ්‍යාදෘෂ්ටිකයෙකු වෙයි, අනුන් ද මිථ්‍යාදෘෂ්ටියෙහි සමාදන් කරවයි, මිථ්‍යාදෘෂ්ටිය අනුමත කරයි – භික්ෂූනි, මේ තිස් ආකාරයක ධර්මයන්ගෙන් සමන්විත වූ පුද්ගලයා තමන් විසින්ම ගෙන ගොස් තැන්පත් කළාක් මෙන් නිරයට වැටෙයි.\n\nභික්ෂූනි, මේ තිස් ආකාරයක ධර්මයන්ගෙන් සමන්විත වූ පුද්ගලයා තමන් විසින්ම ගෙන ගොස් තැන්පත් කළාක් මෙන් ස්වර්ගයට වැටෙයි. කුමන තිස් ආකාරයකින් ද? තමා විසින් ද ප්‍රාණඝාතයෙන් වැළකී සිටියි, අනුන් ද ප්‍රාණඝාතයෙන් වැළකීමෙහි සමාදන් කරවයි, ප්‍රාණඝාතයෙන් වැළකීම අනුමත කරයි; තමා විසින් ද අදත්තාදානයෙන් වැළකී සිටියි, අනුන් ද අදත්තාදානයෙන් වැළකීමෙහි සමාදන් කරවයි, අදත්තාදානයෙන් වැළකීම අනුමත කරයි; තමා විසින් ද කාමමිථ්‍යාචාරයෙන් වැළකී සිටියි, අනුන් ද කාමමිථ්‍යාචාරයෙන් වැළකීමෙහි සමාදන් කරවයි, කාමමිථ්‍යාචාරයෙන් වැළකීම අනුමත කරයි; තමා විසින් ද මුසාවාදයෙන් වැළකී සිටියි, අනුන් ද මුසාවාදයෙන් වැළකීමෙහි සමාදන් කරවයි, මුසාවාදයෙන් වැළකීම අනුමත කරයි; තමා විසින් ද පිසුණා වචන කීමෙන් වැළකී සිටියි, අනුන් ද පිසුණා වචන කීමෙන් වැළකීමෙහි සමාදන් කරවයි, පිසුණා වචන කීමෙන් වැළකීම අනුමත කරයි; තමා විසින් ද ඵරුෂ වචන කීමෙන් වැළකී සිටියි, අනුන් ද ඵරුෂ වචන කීමෙන් වැළකීමෙහි සමාදන් කරවයි, ඵරුෂ වචන කීමෙන් වැළකීම අනුමත කරයි; තමා විසින් ද සම්ඵප්පලාපයෙන් වැළකී සිටියි, අනුන් ද සම්ඵප්පලාපයෙන් වැළකීමෙහි සමාදන් කරවයි, සම්ඵප්පලාපයෙන් වැළකීම අනුමත කරයි; තමා විසින් ද අභිජ්ඣාවෙන් තොර වෙයි, අනුන් ද අභිජ්ඣාවෙන් තොරවීමට සමාදන් කරවයි, අභිජ්ඣාවෙන් තොරවීම අනුමත කරයි; තමා විසින් ද ව්‍යාපාද චිත්තයෙන් තොර වෙයි, අනුන් ද ව්‍යාපාදයෙන් තොරවීමට සමාදන් කරවයි, ව්‍යාපාදයෙන් තොරවීම අනුමත කරයි; තමා විසින් ද සම්මාදිට්ඨියෙන් (නිවැරදි දැක්මෙන්) යුක්ත වෙයි, අනුන් ද සම්මාදිට්ඨියෙහි සමාදන් කරවයි, සම්මාදිට්ඨිය අනුමත කරයි – භික්ෂූනි, මේ තිස් ආකාරයක ධර්මයන්ගෙන් සමන්විත වූ පුද්ගලයා තමන් විසින්ම ගෙන ගොස් තැන්පත් කළාක් මෙන් ස්වර්ගයට වැටෙයි.",
      "paliTitle": ""
    },
    {
      "number": 224,
      "pali": "‘‘Cattārīsāya, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi cattārīsāya? Attanā ca pāṇātipātī hoti, parañca pāṇātipāte samādapeti, pāṇātipāte ca samanuñño hoti, pāṇātipātassa ca vaṇṇaṃ bhāsati; attanā ca adinnādāyī hoti, parañca adinnādāne samādapeti, adinnādāne ca samanuñño hoti, adinnādānassa ca vaṇṇaṃ bhāsati; attanā ca kāmesumicchācārī hoti, parañca kāmesumicchācāre samādapeti, kāmesumicchācāre ca samanuñño hoti, kāmesumicchācārassa ca vaṇṇaṃ bhāsati; attanā ca musāvādī hoti, parañca musāvāde samādapeti, musāvāde ca samanuñño hoti, musāvādassa ca vaṇṇaṃ bhāsati; attanā ca pisuṇavāco hoti, parañca pisuṇāya vācāya samādapeti, pisuṇāya vācāya ca samanuñño hoti, pisuṇāya vācāya ca vaṇṇaṃ bhāsati; attanā ca pharusavāco hoti, parañca pharusāya vācāya samādapeti, pharusāya vācāya ca samanuñño hoti, pharusāya vācāya ca vaṇṇaṃ bhāsati; attanā ca samphappalāpī hoti, parañca samphappalāpe samādapeti, samphappalāpe ca samanuñño hoti, samphappalāpassa ca vaṇṇaṃ bhāsati; attanā ca abhijjhālu hoti, parañca abhijjhāya samādapeti, abhijjhāya ca samanuñño hoti, abhijjhāya ca vaṇṇaṃ bhāsati; attanā ca byāpannacitto hoti, parañca byāpāde samādapeti, byāpāde ca samanuñño hoti, byāpādassa ca vaṇṇaṃ bhāsati; attanā ca micchādiṭṭhiko hoti, parañca micchādiṭṭhiyā samādapeti, micchādiṭṭhiyā ca samanuñño hoti, micchādiṭṭhiyā ca vaṇṇaṃ bhāsati – imehi kho, bhikkhave, cattārīsāya dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. ‘‘Cattārīsāya, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi cattārīsāya? Attanā ca pāṇātipātā paṭivirato hoti, parañca pāṇātipātā veramaṇiyā samādapeti, pāṇātipātā veramaṇiyā ca samanuñño hoti, pāṇātipātā veramaṇiyā ca vaṇṇaṃ bhāsati; attanā ca adinnādānā paṭivirato hoti, parañca adinnādānā veramaṇiyā samādapeti, adinnādānā veramaṇiyā ca samanuñño hoti, adinnādānā veramaṇiyā ca vaṇṇaṃ bhāsati; attanā ca kāmesumicchācārā paṭivirato hoti, parañca kāmesumicchācārā veramaṇiyā samādapeti, kāmesumicchācārā veramaṇiyā ca samanuñño hoti, kāmesumicchācārā veramaṇiyā ca vaṇṇaṃ bhāsati; attanā ca musāvādā paṭivirato hoti, parañca musāvādā veramaṇiyā samādapeti, musāvādā veramaṇiyā ca samanuñño hoti, musāvādā veramaṇiyā ca vaṇṇaṃ bhāsati; attanā ca pisuṇāya vācāya paṭivirato hoti, parañca pisuṇāya vācāya veramaṇiyā samādapeti, pisuṇāya vācāya veramaṇiyā ca samanuñño hoti, pisuṇāya vācāya veramaṇiyā ca vaṇṇaṃ bhāsati; attanā ca pharusāya vācāya paṭivirato hoti, parañca pharusāya vācāya veramaṇiyā ca samādapeti, pharusāya vācāya veramaṇiyā ca samanuñño hoti, pharusāya vācāya veramaṇiyā ca vaṇṇaṃ bhāsati; attanā ca samphappalāpā paṭivirato hoti, parañca samphappalāpā veramaṇiyā samādapeti, samphappalāpā veramaṇiyā ca samanuñño hoti, samphappalāpā veramaṇiyā ca vaṇṇaṃ bhāsati; attanā ca anabhijjhālu hoti, parañca anabhijjhāya samādapeti, anabhijjhāya ca samanuñño hoti, anabhijjhāya ca vaṇṇaṃ bhāsati; attanā ca abyāpannacitto hoti, parañca abyāpāde samādapeti, abyāpāde ca samanuñño hoti, abyāpādassa ca vaṇṇaṃ bhāsati; attanā ca sammādiṭṭhiko hoti, parañca sammādiṭṭhiyā samādapeti, sammādiṭṭhiyā ca samanuñño hoti, sammādiṭṭhiyā ca vaṇṇaṃ bhāsati – imehi kho, bhikkhave, cattārīsāya dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’ti.",
      "english": "Monks, one endowed with forty qualities is consigned to hell, just as he has been brought there and laid down. Which forty? One oneself takes the life of living beings, and encourages others to take the life of living beings, and approves of the taking of life, and speaks in praise of the taking of life; one oneself takes what is not given, and encourages others to take what is not given, and approves of taking what is not given, and speaks in praise of taking what is not given; one oneself engages in sexual misconduct, and encourages others to engage in sexual misconduct, and approves of sexual misconduct, and speaks in praise of sexual misconduct; one oneself engages in false speech, and encourages others to engage in false speech, and approves of false speech, and speaks in praise of false speech; one oneself engages in slanderous speech, and encourages others to engage in slanderous speech, and approves of slanderous speech, and speaks in praise of slanderous speech; one oneself engages in harsh speech, and encourages others to engage in harsh speech, and approves of harsh speech, and speaks in praise of harsh speech; one oneself engages in frivolous speech, and encourages others to engage in frivolous speech, and approves of frivolous speech, and speaks in praise of frivolous speech; one oneself is covetous, and encourages others towards covetousness, and approves of covetousness, and speaks in praise of covetousness; one oneself has ill-will, and encourages others towards ill-will, and approves of ill-will, and speaks in praise of ill-will; one oneself holds wrong view, and encourages others to hold wrong view, and approves of wrong view, and speaks in praise of wrong view – Monks, one endowed with these forty qualities is consigned to hell, just as he has been brought there and laid down.\n\nMonks, one endowed with forty qualities is consigned to heaven, just as he has been brought there and laid down. Which forty? One oneself abstains from taking the life of living beings, and encourages others to abstain from taking the life of living beings, and approves of abstaining from taking life, and speaks in praise of abstaining from taking life; one oneself abstains from taking what is not given, and encourages others to abstain from taking what is not given, and approves of abstaining from taking what is not given, and speaks in praise of abstaining from taking what is not given; one oneself abstains from sexual misconduct, and encourages others to abstain from sexual misconduct, and approves of abstaining from sexual misconduct, and speaks in praise of abstaining from sexual misconduct; one oneself abstains from false speech, and encourages others to abstain from false speech, and approves of abstaining from false speech, and speaks in praise of abstaining from false speech; one oneself abstains from slanderous speech, and encourages others to abstain from slanderous speech, and approves of abstaining from slanderous speech, and speaks in praise of abstaining from slanderous speech; one oneself abstains from harsh speech, and encourages others to abstain from harsh speech, and approves of abstaining from harsh speech, and speaks in praise of abstaining from harsh speech; one oneself abstains from frivolous speech, and encourages others to abstain from frivolous speech, and approves of abstaining from frivolous speech, and speaks in praise of abstaining from frivolous speech; one oneself is free from covetousness, and encourages others towards non-covetousness, and approves of non-covetousness, and speaks in praise of non-covetousness; one oneself is free from ill-will, and encourages others towards non-ill-will, and approves of non-ill-will, and speaks in praise of non-ill-will; one oneself holds right view, and encourages others to hold right view, and approves of right view, and speaks in praise of right view – Monks, one endowed with these forty qualities is consigned to heaven, just as he has been brought there and laid down.",
      "sinhala": "මහණෙනි, කරුණු සතළිසකින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැන්පත් කරන ලද්දකු මෙන් නිරයට පත්වේ.\n\nඒ කවර සතළිසකින්ද? තමන් විසින්ම ප්‍රාණඝාතය කරයි, අනුන්වද ප්‍රාණඝාතයට පොළඹවයි, ප්‍රාණඝාතය අනුමත කරයි, ප්‍රාණඝාතය වර්ණනා කරයි; තමන් විසින්ම අදත්තාදානය කරයි, අනුන්වද අදත්තාදානයට පොළඹවයි, අදත්තාදානය අනුමත කරයි, අදත්තාදානය වර්ණනා කරයි; තමන් විසින්ම කාමයන්හි වරදවා හැසිරෙයි, අනුන්වද කාමයන්හි වරදවා හැසිරීමට පොළඹවයි, කාමයන්හි වරදවා හැසිරීම අනුමත කරයි, කාමයන්හි වරදවා හැසිරීම වර්ණනා කරයි; තමන් විසින්ම මුසාවාදයේ යෙදෙයි, අනුන්වද මුසාවාදයට පොළඹවයි, මුසාවාදය අනුමත කරයි, මුසාවාදය වර්ණනා කරයි; තමන් විසින්ම කේලාම් කියයි, අනුන්වද කේලාම් කීමට පොළඹවයි, කේලාම් කීම අනුමත කරයි, කේලාම් කීම වර්ණනා කරයි; තමන් විසින්ම රළු වචන කියයි, අනුන්වද රළු වචන කීමට පොළඹවයි, රළු වචන කීම අනුමත කරයි, රළු වචන කීම වර්ණනා කරයි; තමන් විසින්ම සම්ඵප්පලාපයේ යෙදෙයි, අනුන්වද සම්ඵප්පලාපයට පොළඹවයි, සම්ඵප්පලාපය අනුමත කරයි, සම්ඵප්පලාපය වර්ණනා කරයි; තමන් විසින්ම අභිධ්‍යාවෙන් යුක්ත වෙයි, අනුන්වද අභිධ්‍යාවට පොළඹවයි, අභිධ්‍යාව අනුමත කරයි, අභිධ්‍යාව වර්ණනා කරයි; තමන් විසින්ම ව්‍යාපාද චේතනාවෙන් යුක්ත වෙයි, අනුන්වද ව්‍යාපාදයට පොළඹවයි, ව්‍යාපාදය අනුමත කරයි, ව්‍යාපාදය වර්ණනා කරයි; තමන් විසින්ම මිත්‍යාදෘෂ්ටික වෙයි, අනුන්වද මිත්‍යාදෘෂ්ටියට පොළඹවයි, මිත්‍යාදෘෂ්ටිය අනුමත කරයි, මිත්‍යාදෘෂ්ටිය වර්ණනා කරයි. මහණෙනි, මේ සතළිස් කරුණින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැන්පත් කරන ලද්දකු මෙන් නිරයට පත්වේ.\n\nමහණෙනි, කරුණු සතළිසකින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැන්පත් කරන ලද්දකු මෙන් දෙව්ලොවට පත්වේ. ඒ කවර සතළිසකින්ද? තමන් විසින්ම ප්‍රාණඝාතයෙන් වැළකී සිටියි, අනුන්වද ප්‍රාණඝාතයෙන් වැළකීමට පොළඹවයි, ප්‍රාණඝාතයෙන් වැළකීම අනුමත කරයි, ප්‍රාණඝාතයෙන් වැළකීම වර්ණනා කරයි; තමන් විසින්ම අදත්තාදානයෙන් වැළකී සිටියි, අනුන්වද අදත්තාදානයෙන් වැළකීමට පොළඹවයි, අදත්තාදානයෙන් වැළකීම අනුමත කරයි, අදත්තාදානයෙන් වැළකීම වර්ණනා කරයි; තමන් විසින්ම කාමයන්හි වරදවා හැසිරීමෙන් වැළකී සිටියි, අනුන්වද කාමයන්හි වරදවා හැසිරීමෙන් වැළකීමට පොළඹවයි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම අනුමත කරයි, කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම වර්ණනා කරයි; තමන් විසින්ම මුසාවාදයෙන් වැළකී සිටියි, අනුන්වද මුසාවාදයෙන් වැළකීමට පොළඹවයි, මුසාවාදයෙන් වැළකීම අනුමත කරයි, මුසාවාදයෙන් වැළකීම වර්ණනා කරයි; තමන් විසින්ම කේලාම් කීමෙන් වැළකී සිටියි, අනුන්වද කේලාම් කීමෙන් වැළකීමට පොළඹවයි, කේලාම් කීමෙන් වැළකීම අනුමත කරයි, කේලාම් කීමෙන් වැළකීම වර්ණනා කරයි; තමන් විසින්ම රළු වචන කීමෙන් වැළකී සිටියි, අනුන්වද රළු වචන කීමෙන් වැළකීමට පොළඹවයි, රළු වචන කීමෙන් වැළකීම අනුමත කරයි, රළු වචන කීමෙන් වැළකීම වර්ණනා කරයි; තමන් විසින්ම සම්ඵප්පලාපයෙන් වැළකී සිටියි, අනුන්වද සම්ඵප්පලාපයෙන් වැළකීමට පොළඹවයි, සම්ඵප්පලාපයෙන් වැළකීම අනුමත කරයි, සම්ඵප්පලාපයෙන් වැළකීම වර්ණනා කරයි; තමන් විසින්ම අභිධ්‍යාවෙන් තොර වෙයි, අනුන්වද අභිධ්‍යාවෙන් තොර වීමට පොළඹවයි, අභිධ්‍යාවෙන් තොර වීම අනුමත කරයි, අභිධ්‍යාවෙන් තොර වීම වර්ණනා කරයි; තමන් විසින්ම ව්‍යාපාදයෙන් තොර වූ සිත් ඇත්තෙක් වෙයි, අනුන්වද ව්‍යාපාදයෙන් තොර වීමට පොළඹවයි, ව්‍යාපාදයෙන් තොර වීම අනුමත කරයි, ව්‍යාපාදයෙන් තොර වීම වර්ණනා කරයි; තමන් විසින්ම සම්මාදිට්ඨියෙන් යුක්ත වෙයි, අනුන්වද සම්මාදිට්ඨියට පොළඹවයි, සම්මාදිට්ඨිය අනුමත කරයි, සම්මාදිට්ඨිය වර්ණනා කරයි. මහණෙනි, මේ සතළිස් කරුණින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැන්පත් කරන ලද්දකු මෙන් දෙව්ලොවට පත්වේ.",
      "paliTitle": ""
    },
    {
      "number": 225,
      "numberRange": "225-228",
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato khataṃ upahataṃ attānaṃ pariharati…pe… akkhataṃ anupahataṃ attānaṃ pariharati…pe… vīsatiyā, bhikkhave…pe… tiṃsāya, bhikkhave…pe… cattārīsāya, bhikkhave, dhammehi samannāgato khataṃ upahataṃ attānaṃ pariharati…pe….",
      "english": "Monks, endowed with ten qualities, one lives an injured, harmed life. Endowed with ten qualities, one lives an uninjured, unharmed life. Monks, endowed with twenty qualities, one lives an injured, harmed life. Endowed with twenty qualities, one lives an uninjured, unharmed life. Monks, endowed with thirty qualities, one lives an injured, harmed life. Endowed with thirty qualities, one lives an uninjured, unharmed life. Monks, endowed with forty qualities, one lives an injured, harmed life. Endowed with forty qualities, one lives an uninjured, unharmed life.",
      "sinhala": "භික්ෂූනි, දස ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා තමාට හානි කරගනිමින්, තමා විනාශ කරගනිමින් කල් ගෙවයි. භික්ෂූනි, (වෙනත්) දස ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා තමාට හානි කර නොගනිමින්, තමා විනාශ කර නොගනිමින් කල් ගෙවයි. භික්ෂූනි, විසි ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා තමාට හානි කරගනිමින්, තමා විනාශ කරගනිමින් කල් ගෙවයි. භික්ෂූනි, (වෙනත්) විසි ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා තමාට හානි කර නොගනිමින්, තමා විනාශ කර නොගනිමින් කල් ගෙවයි. භික්ෂූනි, තිස් ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා තමාට හානි කරගනිමින්, තමා විනාශ කරගනිමින් කල් ගෙවයි. භික්ෂූනි, (වෙනත්) තිස් ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා තමාට හානි කර නොගනිමින්, තමා විනාශ කර නොගනිමින් කල් ගෙවයි. භික්ෂූනි, සතළිස් ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා තමාට හානි කරගනිමින්, තමා විනාශ කරගනිමින් කල් ගෙවයි. භික්ෂූනි, (වෙනත්) සතළිස් ධර්මයන්ගෙන් සමන්වාගත වූ තැනැත්තා තමාට හානි කර නොගනිමින්, තමා විනාශ කර නොගනිමින් කල් ගෙවයි.",
      "paliTitle": ""
    },
    {
      "number": 229,
      "numberRange": "229-232",
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato idhekacco kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati…pe… idhekacco kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Vīsatiyā, bhikkhave…pe… tiṃsāya, bhikkhave,…pe… cattārīsāya, bhikkhave, dhammehi samannāgato idhekacco kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati…pe… idhekacco kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati’’.",
      "english": "Monks, endowed with ten qualities, some individual, upon the dissolution of the body, after death, is reborn into a state of deprivation, a bad destination, a state of ruin, the hell realms; and some individual, upon the dissolution of the body, after death, is reborn into a good destination, a heavenly world. Monks, endowed with twenty qualities, some individual, upon the dissolution of the body, after death, is reborn into a state of deprivation, a bad destination, a state of ruin, the hell realms; and some individual, upon the dissolution of the body, after death, is reborn into a good destination, a heavenly world. Monks, endowed with thirty qualities, some individual, upon the dissolution of the body, after death, is reborn into a state of deprivation, a bad destination, a state of ruin, the hell realms; and some individual, upon the dissolution of the body, after death, is reborn into a good destination, a heavenly world. Monks, endowed with forty qualities, some individual, upon the dissolution of the body, after death, is reborn into a state of deprivation, a bad destination, a state of ruin, the hell realms; and some individual, upon the dissolution of the body, after death, is reborn into a good destination, a heavenly world.",
      "sinhala": "භික්ෂූණි, මෙලොව ඇතැම් පුද්ගලයෙක් දස ධර්මයන්ගෙන් සමන්විතව ශරීරය බිඳී මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරයෙහි උපදී. භික්ෂූණි, මෙලොව ඇතැම් පුද්ගලයෙක් දස ධර්මයන්ගෙන් සමන්විතව ශරීරය බිඳී මරණයෙන් පසුව සුගති, ස්වර්ග ලෝකයෙහි උපදී. භික්ෂූණි, මෙලොව ඇතැම් පුද්ගලයෙක් විසි ධර්මයන්ගෙන් සමන්විතව ශරීරය බිඳී මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරයෙහි උපදී. භික්ෂූණි, මෙලොව ඇතැම් පුද්ගලයෙක් විසි ධර්මයන්ගෙන් සමන්විතව ශරීරය බිඳී මරණයෙන් පසුව සුගති, ස්වර්ග ලෝකයෙහි උපදී. භික්ෂූණි, මෙලොව ඇතැම් පුද්ගලයෙක් තිස් ධර්මයන්ගෙන් සමන්විතව ශරීරය බිඳී මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරයෙහි උපදී. භික්ෂූණි, මෙලොව ඇතැම් පුද්ගලයෙක් තිස් ධර්මයන්ගෙන් සමන්විතව ශරීරය බිඳී මරණයෙන් පසුව සුගති, ස්වර්ග ලෝකයෙහි උපදී. භික්ෂූණි, මෙලොව ඇතැම් පුද්ගලයෙක් සතළිස් ධර්මයන්ගෙන් සමන්විතව ශරීරය බිඳී මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරයෙහි උපදී. භික්ෂූණි, මෙලොව ඇතැම් පුද්ගලයෙක් සතළිස් ධර්මයන්ගෙන් සමන්විතව ශරීරය බිඳී මරණයෙන් පසුව සුගති, ස්වර්ග ලෝකයෙහි උපදී.",
      "paliTitle": ""
    },
    {
      "number": 233,
      "numberRange": "233-236",
      "pali": "‘‘Dasahi, bhikkhave, dhammehi samannāgato bālo veditabbo…pe… paṇḍito veditabbo… pe… vīsatiyā, bhikkhave…pe… tiṃsāya, bhikkhave…pe… cattārīsāya, bhikkhave, dhammehi samannāgato bālo veditabbo…pe… paṇḍito veditabbo …pe… imehi kho, bhikkhave, cattārīsāya dhammehi samannāgato paṇḍito veditabbo’’ti. ",
      "english": "Mendicants, a fool is to be recognized as endowed with ten qualities, and a wise person is to be recognized as endowed with ten qualities.\nMendicants, a fool is to be recognized as endowed with twenty qualities, and a wise person is to be recognized as endowed with twenty qualities.\nMendicants, a fool is to be recognized as endowed with thirty qualities, and a wise person is to be recognized as endowed with thirty qualities.\nMendicants, a fool is to be recognized as endowed with forty qualities, and a wise person is to be recognized as endowed with forty qualities.\nIndeed, mendicants, a wise person is to be recognized as endowed with these forty qualities.",
      "sinhala": "මහණෙනි, දස ධර්මයන්ගෙන් සමන්විත වූ බාලයා දතයුත්තේය. දස ධර්මයන්ගෙන් සමන්විත වූ පණ්ඩිතයාද දතයුත්තේය.\n\nමහණෙනි, විසි ධර්මයන්ගෙන් සමන්විත වූ බාලයා දතයුත්තේය. විසි ධර්මයන්ගෙන් සමන්විත වූ පණ්ඩිතයාද දතයුත්තේය.\n\nමහණෙනි, තිස් ධර්මයන්ගෙන් සමන්විත වූ බාලයා දතයුත්තේය. තිස් ධර්මයන්ගෙන් සමන්විත වූ පණ්ඩිතයාද දතයුත්තේය.\n\nමහණෙනි, සතළිස් ධර්මයන්ගෙන් සමන්විත වූ බාලයා දතයුත්තේය. සතළිස් ධර්මයන්ගෙන් සමන්විත වූ පණ්ඩිතයාද දතයුත්තේය.\n\nමහණෙනි, සැබවින්ම මේ සතළිස් ධර්මයන්ගෙන් සමන්විත වූ පණ්ඩිතයා දතයුත්තේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Sāmaññavaggo dutiyo.",
    "english": "",
    "sinhala": ""
  }
}