{
  "id": "an10.9",
  "title": {
    "pali": "Theravaggo",
    "english": "The Chapter of the Elders",
    "sinhala": "තෙරවග්ගය"
  },
  "sections": [
    {
      "number": 81,
      "pali": "Ekaṃ samayaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Atha kho āyasmā vāhano yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā vāhano bhagavantaṃ etadavoca – ‘‘katihi nu kho, bhante, dhammehi tathāgato nissaṭo visaṃyutto vippamutto vimariyādīkatena cetasā viharatī’’ti? ‘‘Dasahi kho, vāhana, dhammehi tathāgato nissaṭo visaṃyutto vippamutto vimariyādīkatena cetasā viharati. Katamehi dasahi? Rūpena kho, vāhana, tathāgato nissaṭo visaṃyutto vippamutto vimariyādīkatena cetasā viharati, vedanāya kho, vāhana…pe… saññāya kho, vāhana… saṅkhārehi kho, vāhana… viññāṇena kho, vāhana… jātiyā kho, vāhana… jarāya kho, vāhana… maraṇena kho, vāhana… dukkhehi kho, vāhana… kilesehi kho, vāhana, tathāgato nissaṭo visaṃyutto vippamutto vimariyādīkatena cetasā viharati. Seyyathāpi, vāhana, uppalaṃ vā padumaṃ vā puṇḍarīkaṃ vā udake jātaṃ udake saṃvaḍḍhaṃ udakā paccuggamma ṭhitaṃ anupalittaṃ udakena; evamevaṃ kho, vāhana, imehi dasahi dhammehi tathāgato nissaṭo visaṃyutto vippamutto vimariyādīkatena cetasā viharatī’’ti. Paṭhamaṃ.",
      "english": "One time, the Blessed One was dwelling in Campā, on the bank of the Gaggara lotus pond.\n\nThen, the Venerable Vāhana approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side.\n\nAs he sat to one side, the Venerable Vāhana said to the Blessed One, \"Venerable sir, by how many qualities does the Tathāgata dwell disengaged, disjoined, fully liberated, with a mind unconfined?\"\n\n\"Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined, by ten qualities. Which ten? Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by form. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by feeling. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by perception. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by mental formations. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by consciousness. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by birth. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by aging. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by death. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by suffering. Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined by defilements.\"\n\nJust as, Vāhana, a blue lotus, or a red lotus, or a white lotus, born in water, grown in water, stands emerging from the water untouched by the water; in the same way, Vāhana, the Tathāgata dwells disengaged, disjoined, fully liberated, with a mind unconfined, by these ten qualities.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ චම්පා නුවර ගග්ගරා පොකුණේ තීරයෙහි වැඩසිටින සේක. එකල්හි ආයුෂ්මත් වාහන ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වාඩිවූහ. එකත්පසෙක වාඩි වී සිටි ආයුෂ්මත් වාහන ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: \"භාග්‍යවතුන් වහන්ස, තථාගතයන් වහන්සේ කවර නම් ධර්ම කීපයකින් බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක් ද?\" \"වාහනය, තථාගතයන් වහන්සේ දස ධර්මයකින් බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. ඒ දස ධර්මයෝ කවරහු ද? වාහනය, තථාගතයන් වහන්සේ රූපයෙන් බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, වේදනාවෙන් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, සංඥාවෙන් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, සංඛාරයන්ගෙන් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, විඤ්ඤාණයෙන් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, ජාතියෙන් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, ජරාවෙන් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, මරණයෙන් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, දුක්වලින් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, ක්ලේශයන්ගෙන් ද තථාගතයන් වහන්සේ බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක. වාහනය, යම් සේ උපුල්, පියුම් හෝ නෙළුම් දියෙහි උපත ලබා, දියෙහි වැඩී, දියෙන් මතුව සිට, දියෙන් කිලිටි නොවී පවතින්නාක් මෙන්, එසෙයින්ම, වාහනය, තථාගතයන් වහන්සේ මේ දස ධර්මයන්ගෙන් බැහැර වී, විසංයුක්ත වී, මනාව මුදවා හරින ලද, සීමා රහිත සිතකින් යුක්තව වැඩ වසන සේක.\"\n\nමෙය පළමුවැන්නයි.",
      "paliTitle": "Vāhanasuttaṃ",
      "englishTitle": "The Vehicle Sutta",
      "sinhalaTitle": "වාහන සූත්‍රය"
    },
    {
      "number": 82,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘So vatānanda, bhikkhu ‘assaddho samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘dussīlo samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘appassuto samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘dubbaco samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘pāpamitto samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘kusīto samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘muṭṭhassati samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘asantuṭṭho samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘pāpiccho samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘micchādiṭṭhiko samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘imehi dasahi dhammehi samannāgato imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘saddho samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘sīlavā samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘bahussuto sutadharo samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘suvaco samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘kalyāṇamitto samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘āraddhavīriyo samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘upaṭṭhitassati samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘santuṭṭho samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘appiccho samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘sammādiṭṭhiko samāno imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjati. ‘‘So vatānanda, bhikkhu ‘imehi dasahi dhammehi samannāgato imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjatī’’ti. Dutiyaṃ.",
      "english": "Then the Venerable Ananda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As the Venerable Ananda sat to one side, the Blessed One said to him:\n\n“It is not possible, Ananda, that a monk, being without conviction, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, being immoral, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, being of little learning, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, being difficult to admonish, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, having bad companions, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, being indolent, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, being unmindful, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, being discontent, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, having ignoble desires, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, holding wrong view, will attain growth, progress, and abundance in this Dhamma and Discipline. It is not possible, Ananda, that a monk, endowed with these ten qualities, will attain growth, progress, and abundance in this Dhamma and Discipline.\n\n“It is possible, Ananda, that a monk, being endowed with conviction, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, being virtuous, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, being extensively learned and a preserver of what he has heard, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, being amenable to admonition, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, having admirable companions, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, being energetic, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, being established in mindfulness, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, being content, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, having few desires, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, holding right view, will attain growth, progress, and abundance in this Dhamma and Discipline. It is possible, Ananda, that a monk, endowed with these ten qualities, will attain growth, progress, and abundance in this Dhamma and Discipline.”",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූහ. එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් ආනන්ද තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ආනන්දය, මේ ධර්ම විනයෙහි අශ්‍රද්ධාවෙන් යුක්ත වූ භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි දුශ්ශීල වූ භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි අල්පශ්‍රැත වූ (අඩු වශයෙන් අසා දැනගත්) භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි දුර්වච වූ (අනුශාසනා කිරීමට අපහසු) භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි පාපමිත්‍ර වූ (නරක මිතුරන් ඇත්තා වූ) භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි කුසීත වූ (කම්මැලි) භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි මුට්ඨස්සති (සිහි නැති) වූ භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි අසන්තුට්ඨ (අසතුටු) වූ භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි පාපිච්ඡ (දුර්වල ආශාවන් ඇති) වූ භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මේ ධර්ම විනයෙහි මිථ්‍යාදෘෂ්ටික වූ (වැරදි දැක්මක් ඇති) භික්ෂුවක් දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, මෙබඳු වූ දස ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් නොපවතී. ආනන්දය, ශ්‍රද්ධාවෙන් යුක්ත වූ භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, සීලවන්ත වූ භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, බහුශ්‍රැත වූ (බොහෝ අසා දැනගත්), ධර්මය දරාගත් භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, සුවච වූ (අනුශාසනා කිරීමට පහසු) භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, කල්‍යාණමිත්‍ර වූ (යහපත් මිතුරන් ඇත්තා වූ) භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, ආරද්ධවීරිය (වීර්යය වඩාගත්) භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, උපට්ඨිතස්සති (මනා සිහි නුවණින් යුක්ත) භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, සන්තුට්ඨ (සතුටු) වූ භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, අල්පේච්ඡ (අඩු ආශාවන් ඇති) භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, සම්මාදිට්ඨික (නිවැරදි දැක්මක් ඇති) භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී. ආනන්දය, මෙබඳු වූ දස ධර්මයන්ගෙන් යුක්ත වූ භික්ෂුවක් මේ ධර්ම විනයෙහි දියුණුවට, වර්ධනයට, විශාලත්වයට පත්වන්නේ යැයි කියනු ලබන කරුණක් පවතී.”",
      "paliTitle": "Ānandasuttaṃ",
      "englishTitle": "Ānanda Sutta",
      "sinhalaTitle": "ආනන්ද සූත‍්‍රය"
    },
    {
      "number": 83,
      "pali": "Atha kho āyasmā puṇṇiyo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā puṇṇiyo bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu ko paccayo yena appekadā tathāgataṃ dhammadesanā paṭibhāti appekadā nappaṭibhātī’’ti? ‘‘Saddho ca, puṇṇiya, bhikkhu hoti, no ca upasaṅkamitā; neva tāva tathāgataṃ dhammadesanā paṭibhāti. Yato ca kho, puṇṇiya, bhikkhu saddho ca hoti upasaṅkamitā ca, evaṃ tathāgataṃ dhammadesanā paṭibhāti. ‘‘Saddho ca, puṇṇiya, bhikkhu hoti upasaṅkamitā ca, no ca payirupāsitā…pe… payirupāsitā ca, no ca paripucchitā… paripucchitā ca, no ca ohitasoto dhammaṃ suṇāti… ohitasoto ca dhammaṃ suṇāti, no ca sutvā dhammaṃ dhāreti… sutvā ca dhammaṃ dhāreti, no ca dhātānaṃ dhammānaṃ atthaṃ upaparikkhati… dhātānañca dhammānaṃ atthaṃ upaparikkhati no ca atthamaññāya dhammamaññāya dhammānudhammappaṭipanno hoti… atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti, no ca kalyāṇavāco hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā… kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā, no ca sandassako hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ, neva tāva tathāgataṃ dhammadesanā paṭibhāti. ‘‘Yato ca kho, puṇṇiya, bhikkhu saddho ca hoti, upasaṅkamitā ca, payirupāsitā ca, paripucchitā ca, ohitasoto ca dhammaṃ suṇāti, sutvā ca dhammaṃ dhāreti, dhātānañca dhammānaṃ atthaṃ upaparikkhati, atthamaññāya dhammamaññāya dhammānudhammappaṭipanno ca hoti, kalyāṇavāco ca hoti kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagaḷāya atthassa viññāpaniyā, sandassako ca hoti samādapako samuttejako sampahaṃsako sabrahmacārīnaṃ – evaṃ tathāgataṃ dhammadesanā paṭibhāti. Imehi kho, puṇṇiya, dasahi dhammehi samannāgatā [samannāgato (ka.)] [ekantaṃ tathāgataṃ dhammadesanā paṭibhātīti (syā.)] ekantapaṭibhānā [ekantapaṭibhānaṃ (sī.)] tathāgataṃ dhammadesanā hotī’’ti [ekantaṃ tathāgataṃ dhammadesanā paṭibhātīti (syā.)]. Tatiyaṃ.",
      "english": "Then the Venerable Puṇṇiya approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, the Venerable Puṇṇiya said to the Blessed One: \"Venerable Sir, what, pray, is the cause, what is the condition, whereby sometimes a teaching of the Dhamma is clear to the Tathāgata, and sometimes it is not clear?\"\n\n\"When, Puṇṇiya, a bhikkhu is faithful, but does not approach, then a teaching of the Dhamma is not yet clear to the Tathāgata. But when, Puṇṇiya, a bhikkhu is faithful and also approaches, then a teaching of the Dhamma becomes clear to the Tathāgata. When, Puṇṇiya, a bhikkhu is faithful and approaches, but does not attend closely; or when he attends closely but does not question; or when he questions but does not listen to the Dhamma with an attentive ear; or when he listens with an attentive ear but does not retain the Dhamma; or when he retains the Dhamma but does not examine the meaning of the Dhamma he has retained; or when he examines the meaning but, having understood the meaning and the Dhamma, does not practice in accordance with the Dhamma; or when he practices in accordance with the Dhamma but does not have good speech and good articulation, endowed with refined, clear, fluent, and meaningful speech capable of conveying the sense; or when he has good speech and good articulation, endowed with refined, clear, fluent, and meaningful speech capable of conveying the sense, but is not an expositor, an encourager, an inspirer, and an uplifter to his fellow practitioners — then a teaching of the Dhamma is not yet clear to the Tathāgata.\n\nBut when, Puṇṇiya, a bhikkhu is faithful, and approaches, and attends closely, and questions, and listens to the Dhamma with an attentive ear, and retains the Dhamma after hearing it, and examines the meaning of the Dhamma he has retained, and having understood the meaning and the Dhamma, practices in accordance with the Dhamma, and has good speech and good articulation, endowed with refined, clear, fluent, and meaningful speech capable of conveying the sense, and is an expositor, an encourager, an inspirer, and an uplifter to his fellow practitioners – then a teaching of the Dhamma becomes clear to the Tathāgata. Indeed, Puṇṇiya, endowed with these ten qualities, the teaching of the Dhamma to the Tathāgata is perfectly clear.\"",
      "sinhala": "එසමයෙහි ආයුෂ්මත් පුණ්ණිය තෙමේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩහුන් ආයුෂ්මත් පුණ්ණිය තෙමේ භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: “භාග්‍යවතුන් වහන්ස, කුමක් නම් හේතුව ද? කුමක් නම් ප්‍රත්‍යය ද? යම් කරුණකින් ඇතැම් විට තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ වන්නේ ද, ඇතැම් විට පහළ නො වන්නේ ද?”\n\n“පුණ්ණිය, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් යුක්ත වුව ද, (භාග්‍යවතුන් වහන්සේ වෙත) එළඹෙන්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ. පුණ්ණිය, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් යුක්ත වන්නේ ද, එළඹෙන්නේ ද, එවිට තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ වේ. පුණ්ණිය, යම් භික්ෂුවක් ශ්‍රද්ධාවෙන් යුක්ත වන්නේ ද, (භාග්‍යවතුන් වහන්සේ වෙත) එළඹෙන්නේ ද, නමුත් (ධර්මාවබෝධය පිණිස) ඇසුරු කරන්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ. යම් භික්ෂුවක් (ඒ අයුරින්) ඇසුරු කරන්නේ ද, නමුත් (ධර්ම කරුණු) විමසන්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ. යම් භික්ෂුවක් (ඒ අයුරින් ධර්ම කරුණු) විමසන්නේ ද, නමුත් අවධානය යොමු කොට ධර්මය ශ්‍රවණය කරන්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ. යම් භික්ෂුවක් (ඒ අයුරින්) අවධානය යොමු කොට ධර්මය ශ්‍රවණය කරන්නේ ද, නමුත් ශ්‍රවණය කොට ධර්මය ධාරණය කර ගන්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ. යම් භික්ෂුවක් (ඒ අයුරින්) ශ්‍රවණය කොට ධර්මය ධාරණය කර ගන්නේ ද, නමුත් ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ. යම් භික්ෂුවක් (ඒ අයුරින්) ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නේ ද, නමුත් අර්ථය ද, ධර්මය ද අවබෝධ කොට ධර්මයට අනුකූලව පිළිපදින්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ. යම් භික්ෂුවක් (ඒ අයුරින්) අර්ථය ද, ධර්මය ද අවබෝධ කොට ධර්මයට අනුකූලව පිළිපදින්නේ ද, නමුත් යහපත් කථාවක් ඇත්තෙක්, යහපත් කථා කිරීමක් ඇත්තෙක්, නගර වැසියන්ගේ භාෂාවෙන් යුක්ත වූ, පැහැදිලි වූ, නොපැටලෙන, අර්ථය පහසුවෙන් අවබෝධ කරවිය හැකි වචනයෙන් යුක්ත වන්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ. යම් භික්ෂුවක් (ඒ අයුරින්) යහපත් කථාවක් ඇත්තෙක්, යහපත් කථා කිරීමක් ඇත්තෙක්, නගර වැසියන්ගේ භාෂාවෙන් යුක්ත වූ, පැහැදිලි වූ, නොපැටලෙන, අර්ථය පහසුවෙන් අවබෝධ කරවිය හැකි වචනයෙන් යුක්ත වන්නේ ද, නමුත් බඹසර පිළිවෙත පුරන අන්‍යයන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උනන්දු කරවන්නෙක්, සතුටු කරවන්නෙක් වන්නේ නැත් ද, එතෙක් තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ නො වේ.\n\nපුණ්ණිය, යම් කලෙක භික්ෂුව ශ්‍රද්ධාවෙන් යුක්ත වන්නේ ද, එළඹෙන්නේ ද, (ධර්මාවබෝධය පිණිස) ඇසුරු කරන්නේ ද, (ධර්ම කරුණු) විමසන්නේ ද, අවධානය යොමු කොට ධර්මය ශ්‍රවණය කරන්නේ ද, ශ්‍රවණය කොට ධර්මය ධාරණය කර ගන්නේ ද, ධාරණය කරගත් ධර්මයන්ගේ අර්ථය විමසා බලන්නේ ද, අර්ථය ද, ධර්මය ද අවබෝධ කොට ධර්මයට අනුකූලව පිළිපදින්නේ ද, යහපත් කථාවක් ඇත්තෙක්, යහපත් කථා කිරීමක් ඇත්තෙක්, නගර වැසියන්ගේ භාෂාවෙන් යුක්ත වූ, පැහැදිලි වූ, නොපැටලෙන, අර්ථය පහසුවෙන් අවබෝධ කරවිය හැකි වචනයෙන් යුක්ත වන්නේ ද, බඹසර පිළිවෙත පුරන අන්‍යයන්ට ධර්මය පෙන්වා දෙන්නෙක්, සමාදන් කරවන්නෙක්, උනන්දු කරවන්නෙක්, සතුටු කරවන්නෙක් වන්නේ ද, එවිට තථාගතයන් වහන්සේට ධර්ම දේශනාවක් පහළ වේ. පුණ්ණිය, මේ දස ධර්මයන්ගෙන් යුක්ත වූ කල්හි තථාගතයන් වහන්සේට ධර්ම දේශනාවක් නියත වශයෙන්ම පහළ වේ.”",
      "paliTitle": "Puṇṇiyasuttaṃ",
      "englishTitle": "Puṇṇiya Sutta",
      "sinhalaTitle": "පුණ්ණිය සූත්‍රය"
    },
    {
      "number": 84,
      "pali": "Tatra kho āyasmā mahāmoggallāno bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahāmoggallānassa paccassosuṃ. Āyasmā mahāmoggallāno etadavoca – ‘‘Idhāvuso, bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo samanuyuñjati samanuggāhati samanubhāsati. So tathāgatena vā tathāgatasāvakena vā jhāyinā samāpattikusalena paracittakusalena paracittapariyāyakusalena samanuyuñjiyamāno samanuggāhiyamāno samanubhāsiyamāno irīṇaṃ āpajjati vicinaṃ [visinaṃ (sī. aṭṭha.)] āpajjati anayaṃ āpajjati byasanaṃ āpajjati anayabyasanaṃ āpajjati. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca manasi karoti – ‘kiṃ nu kho ayamāyasmā aññaṃ byākaroti – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti? ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca pajānāti – ‘Kodhano kho ayamāyasmā; kodhapariyuṭṭhitena cetasā bahulaṃ viharati. Kodhapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Upanāhī kho pana ayamāyasmā; upanāhapariyuṭṭhitena cetasā bahulaṃ viharati. Upanāhapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Makkhī kho pana ayamāyasmā; makkhapariyuṭṭhitena cetasā bahulaṃ viharati. Makkhapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Paḷāsī kho pana ayamāyasmā; paḷāsapariyuṭṭhitena cetasā bahulaṃ viharati. Paḷāsapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Issukī kho pana ayamāyasmā; issāpariyuṭṭhitena cetasā bahulaṃ viharati. Issāpariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Maccharī kho pana ayamāyasmā; maccherapariyuṭṭhitena cetasā bahulaṃ viharati. Maccherapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Saṭho kho pana ayamāyasmā; sāṭheyyapariyuṭṭhitena cetasā bahulaṃ viharati. Sāṭheyyapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Māyāvī kho pana ayamāyasmā; māyāpariyuṭṭhitena cetasā bahulaṃ viharati. Māyāpariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Pāpiccho kho pana ayamāyasmā; icchāpariyuṭṭhitena cetasā bahulaṃ viharati. Icchāpariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Sati [muṭṭhassati (sī. syā.)] kho pana ayamāyasmā uttari karaṇīye oramattakena visesādhigamena antarā vosānaṃ āpanno. Antarā vosānagamanaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ’. ‘‘So vatāvuso, bhikkhu ‘ime dasa dhamme appahāya imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. So vatāvuso, bhikkhu ‘ime dasa dhamme pahāya imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjatī’’ti. Catutthaṃ.",
      "english": "There, indeed, the Venerable Mahāmoggallāna addressed the bhikkhus, saying, \"Friends, bhikkhus!\" And those bhikkhus replied to the Venerable Mahāmoggallāna, \"Friend!\" The Venerable Mahāmoggallāna spoke thus: \"Here, friends, a bhikkhu declares final knowledge, saying, 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being, I know this.' Then, a Tathāgata or a disciple of a Tathāgata, who is an expert in jhāna, accomplished in meditative attainments, skilled in understanding the minds of others, and adept in discerning the mental dispositions of others, cross-examines, presses, and discusses with that bhikkhu. Being cross-examined, pressed, and discussed with by a Tathāgata or a Tathāgata's disciple who is an expert in jhāna, accomplished in meditative attainments, skilled in understanding the minds of others, and adept in discerning the mental dispositions of others, that bhikkhu falls into barrenness, falls into desolation, falls into ruin, falls into misfortune, falls into ruin and misfortune.\n\n\"Then, a Tathāgata or a Tathāgata's disciple, who is an expert in jhāna, accomplished in meditative attainments, skilled in understanding the minds of others, and adept in discerning the mental dispositions of others, comprehends that bhikkhu's mind with his own mind and considers: 'Why does this venerable one declare final knowledge, saying, \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being, I know this\"?' Then, a Tathāgata or a Tathāgata's disciple, who is an expert in jhāna, accomplished in meditative attainments, skilled in understanding the minds of others, and adept in discerning the mental dispositions of others, comprehends that bhikkhu's mind with his own mind and knows: 'This venerable one is indeed prone to anger; he frequently dwells with a mind overcome by anger. To be overcome by anger is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is indeed resentful; he frequently dwells with a mind overcome by resentment. To be overcome by resentment is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is indeed disparaging; he frequently dwells with a mind overcome by disparagement. To be overcome by disparagement is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is indeed spiteful; he frequently dwells with a mind overcome by spite. To be overcome by spite is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is indeed jealous; he frequently dwells with a mind overcome by jealousy. To be overcome by jealousy is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is indeed stingy; he frequently dwells with a mind overcome by stinginess. To be overcome by stinginess is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is indeed deceitful; he frequently dwells with a mind overcome by deceit. To be overcome by deceit is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is indeed hypocritical; he frequently dwells with a mind overcome by hypocrisy. To be overcome by hypocrisy is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is indeed of evil wishes; he frequently dwells with a mind overcome by evil wishes. To be overcome by evil wishes is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.' 'This venerable one is unmindful regarding the higher task to be accomplished, having halted midway with only a trifling special attainment. To halt midway is indeed a decline in the Dhamma and Discipline proclaimed by the Tathāgata.'\n\n\"It is not possible, friends, for that bhikkhu to attain growth, increase, and fullness in this Dhamma and Discipline without abandoning these ten qualities. It is indeed possible, friends, for that bhikkhu to attain growth, increase, and fullness in this Dhamma and Discipline by abandoning these ten qualities.\"",
      "sinhala": "ඒ වේලෙහි ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා \"ඇවැත්නි භික්ෂූනි\" යැයි පැවසූහ. \"ඇවැත්නි\" යැයි ඒ භික්ෂූහු ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් මහාමොග්ගල්ලාන ස්ථවිරයන් වහන්සේ මෙසේ වදාළහ: \"ඇවැත්නි, මෙහිලා යම් භික්ෂුවක් 'ජාතිය ක්ෂය වී ඇත, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදි, කළ යුතු දේ අවසන් ය, නැවත මේ තත්ත්වයට ඒමක් නැති බව මම දනිමි' යැයි අර්හත්ඵලය ප්‍රකාශ කරයි. එවිට ඒ භික්ෂුව, තථාගතයන් වහන්සේ හෝ ධ්‍යානලාභී, සමාපත්තිවලට දක්ෂ, අනුන්ගේ සිත් දැනගැනීමට දක්ෂ, අනුන්ගේ සිත්වල ගමන් මග දැනගැනීමට දක්ෂ තථාගත ශ්‍රාවකයෙක් විසින් ප්‍රශ්න කරනු ලැබේ, විමසනු ලැබේ, සාකච්ඡා කරනු ලැබේ. ඒ භික්ෂුව තථාගතයන් වහන්සේ හෝ ධ්‍යානලාභී, සමාපත්තිවලට දක්ෂ, අනුන්ගේ සිත් දැනගැනීමට දක්ෂ, අනුන්ගේ සිත්වල ගමන් මග දැනගැනීමට දක්ෂ තථාගත ශ්‍රාවකයෙක් විසින් ප්‍රශ්න කරනු ලබන විට, විමසනු ලබන විට, සාකච්ඡා කරනු ලබන විට වියළී යයි, ව්‍යාකූලත්වයට පත් වේ, විනාශයට පත් වේ, විපත්ති වලට පත් වේ, විනාශයට හා විපත්ති වලට පත් වේ.\n\nඑවිට තථාගතයන් වහන්සේ හෝ ධ්‍යානලාභී, සමාපත්තිවලට දක්ෂ, අනුන්ගේ සිත් දැනගැනීමට දක්ෂ, අනුන්ගේ සිත්වල ගමන් මග දැනගැනීමට දක්ෂ තථාගත ශ්‍රාවකයා, 'මේ ආයුෂ්මත් තැනැත්තා 'ජාතිය ක්ෂය වී ඇත, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදි, කළ යුතු දේ අවසන් ය, නැවත මේ තත්ත්වයට ඒමක් නැති බව මම දනිමි' යැයි අර්හත්ඵලය ප්‍රකාශ කරන්නේ ඇයි?' යනුවෙන් ඒ භික්ෂුවගේ සිත තම සිතින් අවබෝධ කරගෙන මෙනෙහි කරයි.\n\nඑවිට තථාගතයන් වහන්සේ හෝ ධ්‍යානලාභී, සමාපත්තිවලට දක්ෂ, අනුන්ගේ සිත් දැනගැනීමට දක්ෂ, අනුන්ගේ සිත්වල ගමන් මග දැනගැනීමට දක්ෂ තථාගත ශ්‍රාවකයා, ඒ භික්ෂුවගේ සිත තම සිතින් අවබෝධ කරගෙන මෙසේ දැනගනී: 'මේ ආයුෂ්මත් තැනැත්තා ක්‍රෝධ ඇත්තෙකි; බොහෝ විට ක්‍රෝධයෙන් වෙළීගත් සිතකින් වාසය කරයි. ක්‍රෝධයෙන් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා වෛර බැඳීම් ඇත්තෙකි; බොහෝ විට වෛර බැඳීම්වලින් වෙළීගත් සිතකින් වාසය කරයි. වෛර බැඳීම්වලින් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා ගුණමකුයෙකි; බොහෝ විට ගුණ මැකීමෙන් වෙළීගත් සිතකින් වාසය කරයි. ගුණ මැකීමෙන් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා කුහකයෙකි; බොහෝ විට කුහකකමෙන් වෙළීගත් සිතකින් වාසය කරයි. කුහකකමෙන් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා ඊර්ෂ්‍යා ඇත්තෙකි; බොහෝ විට ඊර්ෂ්‍යාවෙන් වෙළීගත් සිතකින් වාසය කරයි. ඊර්ෂ්‍යාවෙන් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා මසුරෙකි; බොහෝ විට මසුරුකමෙන් වෙළීගත් සිතකින් වාසය කරයි. මසුරුකමෙන් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා කපටියෙකි; බොහෝ විට කපටිකමෙන් වෙළීගත් සිතකින් වාසය කරයි. කපටිකමෙන් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා මායාකාරයෙකි; බොහෝ විට වංචාවෙන් වෙළීගත් සිතකින් වාසය කරයි. වංචාවෙන් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා නපුරු ආශාවන් ඇත්තෙකි; බොහෝ විට නපුරු ආශාවන්ගෙන් වෙළීගත් සිතකින් වාසය කරයි. නපුරු ආශාවන්ගෙන් වෙළී සිටීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය. මේ ආයුෂ්මත් තැනැත්තා, කළ යුතු ඉහළ කටයුතු තව තිබියදී, යම් සුළු විශේෂාධිගමයක් ලැබීමෙන් අතරමඟ නතර වූයේය. අතරමඟ නැවතීම තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම-විනයෙහි පිරිහීමක් වන්නේය.'\n\nඇවැත්නි, ඒ භික්ෂුව 'මේ දස වැදෑරුම් ධර්මයන් අත්නොහැර මේ ධර්ම-විනයෙහි දියුණුව, වැඩීම, පිරී ඉතිරී යාම ලබන්නේය' යන්න කිසිසේත් සිදුවිය නොහැක්කකි. ඇවැත්නි, ඒ භික්ෂුව 'මේ දස වැදෑරුම් ධර්මයන් අත්හැර මේ ධර්ම-විනයෙහි දියුණුව, වැඩීම, පිරී ඉතිරී යාම ලබන්නේය' යන්න සිදුවිය හැක්කකි.\"",
      "paliTitle": "Byākaraṇasuttaṃ",
      "englishTitle": "The Exposition Discourse",
      "sinhalaTitle": "විවරණ සූත‍්‍රය"
    },
    {
      "number": 85,
      "pali": "Ekaṃ samayaṃ āyasmā mahācundo cetīsu viharati sahajātiyaṃ. Tatra kho āyasmā mahācundo bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahācundassa paccassosuṃ. Āyasmā mahācundo etadavoca – ‘‘Idhāvuso, bhikkhu katthī hoti vikatthī adhigamesu – ‘ahaṃ paṭhamaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ dutiyaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ tatiyaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ catutthaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ ākāsānañcāyatanaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ viññāṇañcāyatanaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ ākiñcaññāyatanaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ nevasaññānāsaññāyatanaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ saññāvedayitanirodhaṃ samāpajjāmipi vuṭṭhahāmipī’ti. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo samanuyuñjati samanuggāhati samanubhāsati. So tathāgatena vā tathāgatasāvakena vā jhāyinā samāpattikusalena paracittakusalena paracittapariyāyakusalena samanuyuñjiyamāno samanuggāhiyamāno samanubhāsiyamāno irīṇaṃ āpajjati vicinaṃ āpajjati anayaṃ āpajjati byasanaṃ āpajjati anayabyasanaṃ āpajjati. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca manasi karoti – ‘kiṃ nu kho ayamāyasmā katthī hoti vikatthī adhigamesu – ahaṃ paṭhamaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi…pe… ahaṃ saññāvedayitanirodhaṃ samāpajjāmipi vuṭṭhahāmipī’ti. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca pajānāti – ‘Dīgharattaṃ kho ayamāyasmā khaṇḍakārī chiddakārī sabalakārī kammāsakārī na santatakārī na santatavutti sīlesu. Dussīlo kho ayamāyasmā. Dussilyaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Assaddho kho pana ayamāyasmā; assaddhiyaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Appassuto kho pana ayamāyasmā anācāro; appasaccaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Dubbaco kho pana ayamāyasmā; dovacassatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Pāpamitto kho pana ayamāyasmā; pāpamittatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Kusīto kho pana ayamāyasmā; kosajjaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Muṭṭhassati kho pana ayamāyasmā; muṭṭhassaccaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Kuhako kho pana ayamāyasmā; kohaññaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Dubbharo kho pana ayamāyasmā; dubbharatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Duppañño kho pana ayamāyasmā; duppaññatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ’. ‘‘Seyyathāpi, āvuso, sahāyako sahāyakaṃ evaṃ vadeyya – ‘yadā te, samma, dhanena [bandho (ka.)] dhanakaraṇīyaṃ assa, yāceyyāsi maṃ [yācissasi maṃ (sī.), pavedeyyāsi maṃ (syā.), parājeyyāpi maṃ (ka.)] dhanaṃ. Dassāmi te dhana’nti. So kiñcideva dhanakaraṇīye samuppanne sahāyako sahāyakaṃ evaṃ vadeyya – ‘attho me, samma, dhanena. Dehi me dhana’nti. So evaṃ vadeyya – ‘tena hi, samma, idha khanāhī’ti. So tatra khananto nādhigaccheyya. So evaṃ vadeyya – ‘alikaṃ maṃ, samma, avaca; tucchakaṃ maṃ, samma, avaca – idha khanāhī’ti. So evaṃ vadeyya – ‘nāhaṃ taṃ, samma, alikaṃ avacaṃ, tucchakaṃ avacaṃ. Tena hi, samma, idha khanāhī’ti. So tatrapi khananto nādhigaccheyya. So evaṃ vadeyya – ‘alikaṃ maṃ, samma, avaca, tucchakaṃ maṃ, samma, avaca – idha khanāhī’ti. So evaṃ vadeyya – ‘nāhaṃ taṃ, samma, alikaṃ avacaṃ, tucchakaṃ avacaṃ. Tena hi, samma, idha khanāhī’ti. So tatrapi khananto nādhigaccheyya. So evaṃ vadeyya – ‘alikaṃ maṃ, samma, avaca, tucchakaṃ maṃ, samma, avaca – idha khanāhī’ti. So evaṃ vadeyya – ‘nāhaṃ taṃ, samma, alikaṃ avacaṃ, tucchakaṃ avacaṃ. Api ca ahameva ummādaṃ pāpuṇiṃ cetaso vipariyāya’nti. ‘‘Evamevaṃ kho, āvuso, bhikkhu katthī hoti vikatthī adhigamesu – ‘ahaṃ paṭhamaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ dutiyaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ tatiyaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ catutthaṃ jhānaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ ākāsānañcāyatanaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ viññāṇañcāyatanaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ ākiñcaññāyatanaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ nevasaññānāsaññāyatanaṃ samāpajjāmipi vuṭṭhahāmipi, ahaṃ saññāvedayitanirodhaṃ samāpajjāmipi vuṭṭhahāmipī’ti. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo samanuyuñjati samanuggāhati samanubhāsati. So tathāgatena vā tathāgatasāvakena vā jhāyinā samāpattikusalena paracittakusalena paracittapariyāyakusalena samanuyuñjiyamāno samanuggāhiyamāno samanubhāsiyamāno irīṇaṃ āpajjati vicinaṃ āpajjati anayaṃ āpajjati byasanaṃ āpajjati anayabyasanaṃ āpajjati. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca manasi karoti – ‘kiṃ nu kho ayamāyasmā katthī hoti vikatthī adhigamesu – ahaṃ paṭhamaṃ jhānaṃ samāpajjāmipi…pe… ahaṃ saññāvedayitanirodhaṃ samāpajjāmipi vuṭṭhahāmipī’ti. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittapariyāyakusalo cetasā ceto paricca pajānāti – ‘Dīgharattaṃ kho ayamāyasmā khaṇḍakārī chiddakārī sabalakārī kammāsakārī, na santatakārī na santatavutti sīlesu. Dussīlo kho ayamāyasmā; dussilyaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Assaddho kho pana ayamāyasmā; assaddhiyaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Appassuto kho pana ayamāyasmā anācāro; appasaccaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Dubbaco kho pana ayamāyasmā; dovacassatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Pāpamitto kho pana ayamāyasmā; pāpamittatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Kusīto kho pana ayamāyasmā; kosajjaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Muṭṭhassati kho pana ayamāyasmā; muṭṭhassaccaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Kuhako kho pana ayamāyasmā; kohaññaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Dubbharo kho pana ayamāyasmā; dubbharatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Duppañño kho pana ayamāyasmā; duppaññatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ’. ‘‘So vatāvuso, bhikkhu ‘ime dasa dhamme appahāya imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. So vatāvuso, bhikkhu ‘ime dasa dhamme pahāya imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjatī’’ti. Pañcamaṃ.",
      "english": "At one time, the venerable Mahācunda was dwelling among the Cetis, in Sahajāti. Thereupon, the venerable Mahācunda addressed the monks, \"Friends, monks!\" \"Friend!\" those monks replied to the venerable Mahācunda. The venerable Mahācunda said this:\n\n\"Here, friends, a monk might be boastful and arrogant about his attainments, saying: 'I enter and emerge from the first jhāna, I enter and emerge from the second jhāna, I enter and emerge from the third jhāna, I enter and emerge from the fourth jhāna, I enter and emerge from the sphere of infinite space, I enter and emerge from the sphere of infinite consciousness, I enter and emerge from the sphere of nothingness, I enter and emerge from the sphere of neither perception nor non-perception, I enter and emerge from the cessation of perception and feeling.'\n\n\"Then such a one would be questioned, examined, and cross-examined by a Tathāgata or a disciple of a Tathāgata who is skilled in meditation and attainments, skilled in the minds of others and in the dispositions of others' minds. Being questioned, examined, and cross-examined by a Tathāgata or a Tathāgata's disciple who is skilled in meditation, attainments, and in the minds and dispositions of others, he would fall into barrenness, fall into desolation, fall into ruin, fall into misfortune, fall into utter ruin and misfortune.\n\n\"Then such a one—a Tathāgata or a disciple of a Tathāgata, skilled in meditation, attainments, and in the minds and dispositions of others—would comprehend the mind of that person with his own mind thus: 'Why does this venerable one boast and show arrogance about his attainments – \"I enter and emerge from the first jhāna, I enter and emerge from the second jhāna, I enter and emerge from the third jhāna, I enter and emerge from the fourth jhāna, I enter and emerge from the sphere of infinite space, I enter and emerge from the sphere of infinite consciousness, I enter and emerge from the sphere of nothingness, I enter and emerge from the sphere of neither perception nor non-perception, I enter and emerge from the cessation of perception and feeling\"?'\n\n\"Then such a one—a Tathāgata or a disciple of a Tathāgata, skilled in meditation, attainments, and in the minds and dispositions of others—would comprehend the mind of that person with his own mind thus: 'For a long time, this venerable one has been one who breaks, pierces, stains, and blemishes, not one who maintains continuous and unbroken conduct in precepts. This venerable one is immoral. Indeed, immorality in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one is faithless; indeed, faithlessness in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one has little learning and lacks proper conduct; indeed, little learning and lack of proper conduct in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one is difficult to admonish; indeed, being difficult to admonish in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one has evil companions; indeed, having evil companions in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one is lazy; indeed, laziness in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one is unmindful; indeed, unmindfulness in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one is deceitful; indeed, deceitfulness in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one is difficult to support; indeed, being difficult to support in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline. Indeed, this venerable one is unwise; indeed, unwisdom in the Dhamma and Discipline proclaimed by the Tathāgata is a cause for decline.'\n\n\"Just as, friends, a friend might say to another friend thus: 'When, friend, you have a need for money, you should ask me for money. I will give you money.' When some need for money arises, that friend would say to the other friend: 'Friend, I have a need for money. Give me money.' That one would say: 'Very well, friend, dig here.' He, digging there, would find nothing. He would say: 'Friend, you spoke falsely to me; you spoke emptily to me – \"Dig here!\"' That one would say: 'Friend, I did not speak falsely to you, I did not speak emptily. Very well then, friend, dig here.' He, digging there too, would find nothing. He would say: 'Friend, you spoke falsely to me, you spoke emptily to me – \"Dig here!\"' That one would say: 'Friend, I did not speak falsely to you, I did not speak emptily. Very well then, friend, dig here.' He, digging there too, would find nothing. He would say: 'Friend, you spoke falsely to me, you spoke emptily to me – \"Dig here!\"' That one would say: 'Friend, I did not speak falsely to you, I did not speak emptily. But perhaps I myself have gone mad, my mind deranged.'\n\nThus, indeed, friends, a monk boasts and brags about his attainments: 'I enter the first jhana and emerge from it; I enter the second jhana and emerge from it; I enter the third jhana and emerge from it; I enter the fourth jhana and emerge from it; I enter the dimension of infinite space and emerge from it; I enter the dimension of infinite consciousness and emerge from it; I enter the dimension of nothingness and emerge from it; I enter the dimension of neither perception nor non-perception and emerge from it; I enter the cessation of perception and feeling and emerge from it.'\n\nHim, a Tathagata or a disciple of a Tathagata, who is meditative, skilled in attainments, skilled in discerning the minds of others, and skilled in the ways of others' minds, questions, presses, and examines. Being thus questioned, pressed, and examined by such a Tathagata or a disciple of a Tathagata, who is meditative, skilled in attainments, skilled in discerning the minds of others, and skilled in the ways of others' minds, he falls into desolation, into confusion, into ruin, into misfortune, into utter ruin and misfortune.\n\nHim, a Tathagata or a disciple of a Tathagata, who is meditative, skilled in attainments, skilled in discerning the minds of others, and skilled in the ways of others' minds, mentally encompasses his mind with his own mind and reflects: 'Why does this venerable one boast and brag about his attainments: 'I enter the first jhana... and so forth... I enter the cessation of perception and feeling and emerge from it'?'\n\nHim, a Tathagata or a disciple of a Tathagata, who is meditative, skilled in attainments, and skilled in the ways of others' minds, mentally encompasses his mind with his own mind and discerns: 'For a long time, this venerable one has been one who breaks, pierces, stains, and blemishes his morality, not one who practices it continuously or lives continuously in it. This venerable one is immoral; and immorality is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one is without faith; and lack of faith is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one has little learning and lacks proper conduct; and having little learning is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one is difficult to admonish; and being difficult to admonish is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one has evil companions; and having evil companions is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one is lazy; and laziness is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one is forgetful; and forgetfulness is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one is deceitful; and deceit is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one is difficult to support; and being difficult to support is a decline in the Dhamma and Discipline proclaimed by the Tathagata. This venerable one is of poor wisdom; and poor wisdom is a decline in the Dhamma and Discipline proclaimed by the Tathagata.'\n\n'It is impossible, friends, that this monk, without abandoning these ten qualities, will achieve growth, increase, and fullness in this Dhamma and Discipline. But it is possible, friends, that this monk, having abandoned these ten qualities, will achieve growth, increase, and fullness in this Dhamma and Discipline.'",
      "sinhala": "එක් සමයෙක ආයෂ්මත්වත් මහාචුන්ද ස්ථවිරයන් වහන්සේ චේතීන් අතර සහජාතිය නම් ස්ථානයේ වැඩසිටියහ. එහිදී ආයෂ්මත්වත් මහාචුන්ද ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: \"ඇවැත්නි භික්ෂූනි,\" \"ඇවැත්නි\" යි ඒ භික්ෂූහු ආයෂ්මත්වත් මහාචුන්ද ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයෂ්මත්වත් මහාචුන්ද ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක:\n\n\"ඇවැත්නි, මෙහිලා ඇතැම් භික්ෂුවක් තමාගේ අධිගමයන් ගැන උඩඟු කතා කියයි, බාහිරව පසසයි, මෙසේ කියමින්: 'මම පළමු ධ්‍යානයට සමවැදීමි, ඉන් නැගිටීමි. මම දෙවෙනි ධ්‍යානයට සමවැදීමි, ඉන් නැගිටීමි. මම තෙවෙනි ධ්‍යානයට සමවැදීමි, ඉන් නැගිටීමි. මම සිව්වෙනි ධ්‍යානයට සමවැදීමි, ඉන් නැගිටීමි. මම ආකාසානඤ්චායතනයට සමවැදීමි, ඉන් නැගිටීමි. මම විඤ්ඤාණඤ්චායතනයට සමවැදීමි, ඉන් නැගිටීමි. මම ආකිඤ්චඤ්ඤායතනයට සමවැදීමි, ඉන් නැගිටීමි. මම නේවසඤ්ඤානාසඤ්ඤායතනයට සමවැදීමි, ඉන් නැගිටීමි. මම සඤ්ඤා වේදයිත නිරෝධයට සමවැදීමි, ඉන් නැගිටීමි' යි.\"\n\n\"එවිට ධ්‍යානලාභී, සමාපත්තිවල දක්ෂ, අනුන්ගේ සිත් දන්නා, අනුන්ගේ සිතේ ගමන්මඟ දන්නා තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙක් ඔහුව ප්‍රශ්න කරයි, විමසයි, පරීක්ෂා කරයි. ඒ තථාගතයන් වහන්සේ හෝ ධ්‍යානලාභී, සමාපත්තිවල දක්ෂ, අනුන්ගේ සිත් දන්නා, අනුන්ගේ සිතේ ගමන්මඟ දන්නා තථාගත ශ්‍රාවකයා විසින් ප්‍රශ්න කරනු ලබන විට, විමසනු ලබන විට, පරීක්ෂා කරනු ලබන විට, ඔහු හිස් තැනකට පැමිණේ, විනාශයට පැමිණේ, දුකට පැමිණේ, විපතට පැමිණේ, දුකට හා විපතට පැමිණේ.\"\n\n\"එවිට ඒ ධ්‍යානලාභී, සමාපත්තිවල දක්ෂ, අනුන්ගේ සිත් දන්නා, අනුන්ගේ සිතේ ගමන්මඟ දන්නා තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයා මෙසේ සිතින් සිත විමසා මෙනෙහි කරයි: 'මේ ආයෂ්මත්වත් තැනැත්තා 'මම පළමු ධ්‍යානයට සමවැදීමි, ඉන් නැගිටීමි... (ආදි වශයෙන්)... මම සඤ්ඤා වේදයිත නිරෝධයට සමවැදීමි, ඉන් නැගිටීමි' යි තමාගේ අධිගමයන් ගැන උඩඟු කතා කියන්නේ, බාහිරව පසසන්නේ සැබෑ ලෙසින්මද?'\"\n\n\"එවිට ඒ ධ්‍යානලාභී, සමාපත්තිවල දක්ෂ, අනුන්ගේ සිත් දන්නා, අනුන්ගේ සිතේ ගමන්මඟ දන්නා තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයා මෙසේ සිතින් සිත විමසා දැන ගනී: 'මේ ආයෂ්මත්වත් තැනැත්තා දිගු කලක් තිස්සේ සිල් බිඳ දැමීම, සිල් සිදුරු කිරීම, සිල් සෙලවීම, සිල් කඩ කිරීම කර ඇති, නිරන්තරයෙන් සිල් රැක නොගත්තේය, සීලයේ ස්ථිර පැවැත්මක් නැත්තේය. මේ ආයෂ්මත්වත් තැනැත්තා දුශ්ශීල ය. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි දුශ්ශීල භාවය පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා අශ්‍රද්ධාවන්තයෙකි; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි අශ්‍රද්ධාව පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා අල්පශ්‍රැතයෙකි, අනාචාරී ය; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි අල්පශ්‍රැත භාවය පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා කීකරු නොවන, අකීකරු ය; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි අකීකරු භාවය පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා පාපමිත්‍රයෙකි; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පාපමිත්‍ර භාවය පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා කුසීතයෙකි; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි කුසීත භාවය පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා සිහිමුළා වූවෙකි; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි සිහිමුළා භාවය පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා කුහකයෙකි; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි කුහක භාවය පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා දැරීමට අපහසු අයෙකි; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි දුර්භර භාවය පරිහානියකි. මේ ආයෂ්මත්වත් තැනැත්තා දුෂ්ප්‍රාඥයෙකි; තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි දුෂ්ප්‍රඥා භාවය පරිහානියකි.' \"\n\n\"ඇවැත්නි, යම් සේ මිතුරෙක් තවත් මිතුරෙකුට මෙසේ කියයි: 'මිත්‍රය, ඔබට යම් කලක ධනයෙන් කළ යුතු කටයුත්තක් ඇත්නම්, මාගෙන් ධනය ඉල්ලන්න. මම ඔබට ධනය දෙන්නෙමි' කියා. යම්කිසි ධන කටයුත්තක් පැමිණි විට ඒ මිතුරා තවත් මිතුරෙකුට මෙසේ කියයි: 'මිත්‍රය, මට ධනය අවශ්‍යයි. මට ධනය දෙන්න' කියා. ඔහු මෙසේ කියයි: 'එසේනම් මිත්‍රය, මෙහි හාරන්න' කියා. ඔහු එහි හාරමින් සිටියත් සොයා නොගනී. ඔහු මෙසේ කියයි: 'මිත්‍රය, ඔබ මට බොරු කීවා; මිත්‍රය, ඔබ මට හිස් දෙයක් කීවා - මෙහි හාරන්න කියා' යි. ඔහු මෙසේ කියයි: 'මිත්‍රය, මම ඔබට බොරු කීවේ නැහැ, හිස් දෙයක් කීවේ නැහැ. එසේනම් මිත්‍රය, මෙහි හාරන්න' කියා. ඔහු එහිද හාරමින් සිටියත් සොයා නොගනී. ඔහු මෙසේ කියයි: 'මිත්‍රය, ඔබ මට බොරු කීවා, හිස් දෙයක් කීවා - මෙහි හාරන්න කියා' යි. ඔහු මෙසේ කියයි: 'මිත්‍රය, මම ඔබට බොරු කීවේ නැහැ, හිස් දෙයක් කීවේ නැහැ. එසේනම් මිත්‍රය, මෙහි හාරන්න' කියා. ඔහු එහිද හාරමින් සිටියත් සොයා නොගනී. ඔහු මෙසේ කියයි: 'මිත්‍රය, ඔබ මට බොරු කීවා, හිස් දෙයක් කීවා - මෙහි හාරන්න කියා' යි. ඔහු මෙසේ කියයි: 'මිත්‍රය, මම ඔබට බොරු කීවේ නැහැ, හිස් දෙයක් කීවේ නැහැ. නමුත් සිතේ විපරීත බව නිසා මමම උමතුවට පත්වී ඇත්තෙමි' යි.\"\n\nඑලෙසින්ම, ආයුෂ්මත්නි, භික්ෂුවක් තමන් ලැබූ අධිගමයන් ගැන අනුන්ට ප්‍රශංසා කරයි, ආඩම්බර වේ. ‘මම පළමු ධ්‍යානයට සමවදිමිද, එයින් නැගිටිමිද, මම දෙවෙනි ධ්‍යානයට සමවදිමිද, එයින් නැගිටිමිද, මම තුන්වෙනි ධ්‍යානයට සමවදිමිද, එයින් නැගිටිමිද, මම සිව්වෙනි ධ්‍යානයට සමවදිමිද, එයින් නැගිටිමිද, මම ආකාසානඤ්චායතනයට සමවදිමිද, එයින් නැගිටිමිද, මම විඤ්ඤාණඤ්චායතනයට සමවදිමිද, එයින් නැගිටිමිද, මම ආකිඤ්චඤ්ඤායතනයට සමවදිමිද, එයින් නැගිටිමිද, මම නේවසඤ්ඤානාසඤ්ඤායතනයට සමවදිමිද, එයින් නැගිටිමිද, මම සඤ්ඤා-වේදයිත-නිරෝධයට සමවදිමිද, එයින් නැගිටිමිද’යි (කියමින්).\n\nඑවිට ඒ භික්ෂුව තථාගතයන් වහන්සේ හෝ ධ්‍යානලාභී වූ, සමවත්හි දක්ෂ වූ, අන්‍ය සිත දැනීමේ දක්ෂ වූ, අන්‍ය සිත්වල විවිධ ආකාරයන් දැනීමේ දක්ෂ වූ තථාගත ශ්‍රාවකයෙක් හෝ ඔහුගෙන් ප්‍රශ්න කරයි, විමර්ශනය කරයි, විස්තර කරවයි. ඒ භික්ෂුව තථාගතයන් වහන්සේ විසින් හෝ ධ්‍යානලාභී වූ, සමවත්හි දක්ෂ වූ, අන්‍ය සිත දැනීමේ දක්ෂ වූ, අන්‍ය සිත්වල විවිධ ආකාරයන් දැනීමේ දක්ෂ වූ තථාගත ශ්‍රාවකයෙක් විසින් හෝ ප්‍රශ්න කරනු ලබන විට, විමර්ශනය කරනු ලබන විට, විස්තර කරවනු ලබන විට ඔහු ගොළු වේ, තැති ගනී, විනාශයට පත්වේ, විපතට පත්වේ, විනාශය හා විපත යන දෙකටම පත්වේ.\n\nඑවිට ඒ භික්ෂුව ගැන තථාගතයන් වහන්සේ හෝ ධ්‍යානලාභී වූ, සමවත්හි දක්ෂ වූ, අන්‍ය සිත දැනීමේ දක්ෂ වූ, අන්‍ය සිත්වල විවිධ ආකාරයන් දැනීමේ දක්ෂ වූ තථාගත ශ්‍රාවකයෙක් හෝ මේ අයුරින් සිතින් සිත විමසා මෙනෙහි කරයි: ‘මේ ආයුෂ්මත් කෙසේ නම්ද තමන් ලැබූ අධිගමයන් ගැන ප්‍රශංසා කරන්නේත්, ආඩම්බර වන්නේත්? ‘මම පළමු ධ්‍යානයට සමවදිමිද, එයින් නැගිටිමිද, මම දෙවෙනි ධ්‍යානයට සමවදිමිද, එයින් නැගිටිමිද, මම තුන්වෙනි ධ්‍යානයට සමවදිමිද, එයින් නැගිටිමිද, මම සිව්වෙනි ධ්‍යානයට සමවදිමිද, එයින් නැගිටිමිද, මම ආකාසානඤ්චායතනයට සමවදිමිද, එයින් නැගිටිමිද, මම විඤ්ඤාණඤ්චායතනයට සමවදිමිද, එයින් නැගිටිමිද, මම ආකිඤ්චඤ්ඤායතනයට සමවදිමිද, එයින් නැගිටිමිද, මම නේවසඤ්ඤානාසඤ්ඤායතනයට සමවදිමිද, එයින් නැගිටිමිද, මම සඤ්ඤා-වේදයිත-නිරෝධයට සමවදිමිද, එයින් නැගිටිමිද’යි.\n\nඑවිට ඒ භික්ෂුව ගැන තථාගතයන් වහන්සේ හෝ ධ්‍යානලාභී වූ, සමවත්හි දක්ෂ වූ, අන්‍ය සිත දැනීමේ දක්ෂ වූ, අන්‍ය සිත්වල විවිධ ආකාරයන් දැනීමේ දක්ෂ වූ තථාගත ශ්‍රාවකයෙක් හෝ සිතින් සිත විමසා මෙසේ දනියි: ‘මේ ආයුෂ්මත් බොහෝ කලක් සිල් කැඩූ, සිල් සිදුරු කළ, සිල් පැල්ලම් කළ, සිල් කිලිටි කළ පුද්ගලයෙකි. සිල්වල නොකැඩී, නොසිදුරු වී, නොපැල්ලම් වී, නොකිලිටි වී නිරන්තරයෙන් හැසිරුණේ නැත. මේ ආයුෂ්මත් දුස්සීලයෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි දුස්සීලභාවය පරිහානියකි. මේ ආයුෂ්මත් අශ්‍රද්ධාවන්තයෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි අශ්‍රද්ධාවන්තභාවය පරිහානියකි. මේ ආයුෂ්මත් අල්පශ්‍රැතයෙකි, අනාචාරශීලීය. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි අල්පශ්‍රැතභාවය පරිහානියකි. මේ ආයුෂ්මත් දුර්වචයෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි දුර්වචභාවය පරිහානියකි. මේ ආයුෂ්මත් පාපමිත්‍රයෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි පාපමිත්‍රභාවය පරිහානියකි. මේ ආයුෂ්මත් කුසීතයෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි කුසීතභාවය පරිහානියකි. මේ ආයුෂ්මත් මුට්ඨස්සතියෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි මුට්ඨස්සතිභාවය පරිහානියකි. මේ ආයුෂ්මත් කුහකයෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි කුහකභාවය පරිහානියකි. මේ ආයුෂ්මත් දුබ්බරයෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි දුබ්බරභාවය පරිහානියකි. මේ ආයුෂ්මත් දුෂ්ප්‍රාඥයෙකි. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද මේ ධර්ම විනයෙහි දුෂ්ප්‍රාඥභාවය පරිහානියකි.’\n\nආයුෂ්මත්නි, ඒ භික්ෂුව ‘මේ දස ධර්මයන් අත්නොහැර මේ ධර්ම විනයෙහි වැඩීමට, දියුණුවට, මහත්ඵල බවට පත්වෙන්නේය’ යැයි කීම සිදුවිය නොහැක්කකි. ආයුෂ්මත්නි, ඒ භික්ෂුව ‘මේ දස ධර්මයන් අත්හැර මේ ධර්ම විනයෙහි වැඩීමට, දියුණුවට, මහත්ඵල බවට පත්වෙන්නේය’ යැයි කීම සිදුවිය හැක්කකි.",
      "paliTitle": "Katthīsuttaṃ",
      "englishTitle": "Katthī Discourse",
      "sinhalaTitle": "කත්‍ථී සූත්‍රය"
    },
    {
      "number": 86,
      "pali": "Ekaṃ samayaṃ āyasmā mahākassapo rājagahe viharati veḷuvane kalandakanivāpe. Tatra kho āyasmā mahākassapo bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahākassapassa paccassosuṃ. Āyasmā mahākassapo etadavoca – ‘‘Idhāvuso, bhikkhu aññaṃ byākaroti – ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo samanuyuñjati samanuggāhati samanubhāsati. So tathāgatena vā tathāgatasāvakena vā jhāyinā samāpattikusalena paracittakusalena paracittapariyāyakusalena samanuyuñjiyamāno samanuggāhiyamāno samanubhāsiyamāno irīṇaṃ āpajjati vicinaṃ āpajjati anayaṃ āpajjati byasanaṃ āpajjati anayabyasanaṃ āpajjati. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca manasi karoti – ‘kiṃ nu kho ayamāyasmā aññaṃ byākaroti – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca pajānāti – ‘Adhimāniko kho ayamāyasmā adhimānasacco, appatte pattasaññī, akate katasaññī, anadhigate adhigatasaññī. Adhimānena aññaṃ byākaroti – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca manasi karoti – ‘kiṃ nu kho ayamāyasmā nissāya adhimāniko adhimānasacco, appatte pattasaññī, akate katasaññī, anadhigate adhigatasaññī. Adhimānena aññaṃ byākaroti – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca pajānāti – ‘Bahussuto kho pana ayamāyasmā sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Tasmā ayamāyasmā adhimāniko adhimānasacco, appatte pattasaññī, akate katasaññī, anadhigate adhigatasaññī. Adhimānena aññaṃ byākaroti – khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyāti pajānāmī’ti. ‘‘Tamenaṃ tathāgato vā tathāgatasāvako vā jhāyī samāpattikusalo paracittakusalo paracittapariyāyakusalo evaṃ cetasā ceto paricca pajānāti – ‘Abhijjhālu kho pana ayamāyasmā; abhijjhāpariyuṭṭhitena cetasā bahulaṃ viharati. Abhijjhāpariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Byāpanno kho pana ayamāyasmā; byāpādapariyuṭṭhitena cetasā bahulaṃ viharati. Byāpādapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Thinamiddho kho pana ayamāyasmā; thinamiddhapariyuṭṭhitena cetasā bahulaṃ viharati. Thinamiddhapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Uddhato kho pana ayamāyasmā; uddhaccapariyuṭṭhitena cetasā bahulaṃ viharati. Uddhaccapariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Vicikiccho kho pana ayamāyasmā; vicikicchāpariyuṭṭhitena cetasā bahulaṃ viharati. Vicikicchāpariyuṭṭhānaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Kammārāmo kho pana ayamāyasmā kammarato kammārāmataṃ anuyutto. Kammārāmatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Bhassārāmo kho pana ayamāyasmā bhassarato bhassārāmataṃ anuyutto. Bhassārāmatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Niddārāmo kho pana ayamāyasmā niddārato niddārāmataṃ anuyutto. Niddārāmatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Saṅgaṇikārāmo kho pana ayamāyasmā saṅgaṇikarato saṅgaṇikārāmataṃ anuyutto. Saṅgaṇikārāmatā kho pana tathāgatappavedite dhammavinaye parihānametaṃ. ‘Sati kho pana ayamāyasmā uttari karaṇīye oramattakena visesādhigamena antarā vosānaṃ āpanno. Antarā vosānagamanaṃ kho pana tathāgatappavedite dhammavinaye parihānametaṃ’. ‘‘So vatāvuso, bhikkhu ‘ime dasa dhamme appahāya imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti netaṃ ṭhānaṃ vijjati. So vatāvuso, bhikkhu ‘ime dasa dhamme pahāya imasmiṃ dhammavinaye vuddhiṃ virūḷhiṃ vepullaṃ āpajjissatī’ti ṭhānametaṃ vijjatī’’ti. Chaṭṭhaṃ.",
      "english": "At one time, the Venerable Mahākassapa was staying in Rājagaha, in the Bamboo Grove, at the Squirrels’ Feeding Ground. There, the Venerable Mahākassapa addressed the monks, saying, \"Friends, monks!\" And those monks replied to the Venerable Mahākassapa, \"Friend!\" The Venerable Mahākassapa then said this:\n\n\"Here, friends, a monk declares final knowledge: 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for this, I understand.' Then a Tathāgata or a disciple of a Tathāgata – one who is a meditator, skilled in attainments, skilled in knowing the minds of others, skilled in understanding the dispositions of others' minds – questions him, presses him, and discusses with him. Being questioned, pressed, and discussed with by a Tathāgata or a disciple of a Tathāgata – one who is a meditator, skilled in attainments, skilled in knowing the minds of others, skilled in understanding the dispositions of others' minds – he falls into error, falls into confusion, falls into misfortune, falls into disaster, falls into misfortune and disaster.\n\n\"Then a Tathāgata or a disciple of a Tathāgata – one who is a meditator, skilled in attainments, skilled in knowing the minds of others, skilled in understanding the dispositions of others' minds – encompasses his mind with his own mind and reflects: 'How is it that this venerable one declares final knowledge: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for this, I understand\"?'\n\n\"Then a Tathāgata or a disciple of a Tathāgata – one who is a meditator, skilled in attainments, skilled in knowing the minds of others, skilled in understanding the dispositions of others' minds – encompasses his mind with his own mind and understands: 'This venerable one is one who over-estimates, truthfully holding an over-estimation; perceiving as attained what is not attained, perceiving as done what is not done, perceiving as realized what is not realized. Due to over-estimation, he declares final knowledge: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for this, I understand.\" '\n\n\"Then a Tathāgata or a disciple of a Tathāgata – one who is a meditator, skilled in attainments, skilled in knowing the minds of others, skilled in understanding the dispositions of others' minds – encompasses his mind with his own mind and reflects: 'What is it that this venerable one relies upon to be one who over-estimates, truthfully holding an over-estimation; perceiving as attained what is not attained, perceiving as done what is not done, perceiving as realized what is not realized? Due to over-estimation, he declares final knowledge: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for this, I understand\"?'\n\n\"Then a Tathāgata or a disciple of a Tathāgata – one who is a meditator, skilled in attainments, skilled in knowing the minds of others, skilled in understanding the dispositions of others' minds – encompasses his mind with his own mind and understands: 'This venerable one is indeed very learned, a preserver of what he has heard, a compiler of what he has heard. Those teachings that are good in the beginning, good in the middle, and good in the end, proclaiming the holy life in its entirety, perfectly complete and purified, in meaning and in letter – such teachings are for him extensively heard, memorized, recited verbally, contemplated mentally, and well penetrated by understanding. Therefore, this venerable one is one who over-estimates, truthfully holding an over-estimation; perceiving as attained what is not attained, perceiving as done what is not done, perceiving as realized what is not realized. Due to over-estimation, he declares final knowledge: \"Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for this, I understand.\" '\n\n\"Then a Tathāgata or a disciple of a Tathāgata – one who is a meditator, skilled in attainments, skilled in knowing the minds of others, skilled in understanding the dispositions of others' minds – encompasses his mind with his own mind and understands: 'Moreover, this venerable one is covetous; he dwells largely with a mind dominated by covetousness. And being dominated by covetousness is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata. Moreover, this venerable one is malicious; he dwells largely with a mind dominated by malice. And being dominated by malice is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata. Moreover, this venerable one is slothful and torpid; he dwells largely with a mind dominated by sloth and torpor. And being dominated by sloth and torpor is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata. Moreover, this venerable one is restless; he dwells largely with a mind dominated by restlessness. And being dominated by restlessness is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata. Moreover, this venerable one is doubtful; he dwells largely with a mind dominated by doubt. And being dominated by doubt is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata. Moreover, this venerable one delights in activity; he is fond of activity, devoted to delighting in activity. And delighting in activity is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata. Moreover, this venerable one delights in talk; he is fond of talk, devoted to delighting in talk. And delighting in talk is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata. Moreover, this venerable one delights in sleep; he is fond of sleep, devoted to delighting in sleep. And delighting in sleep is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata. Moreover, this venerable one delights in company; he is fond of company, devoted to delighting in company. And delighting in company is a falling away in the Dhamma and Discipline proclaimed by the Tathāgata.\"\n\nIndeed, this venerable one has come to a premature cessation in the higher tasks, having gained only a limited distinction. And truly, such a premature cessation is a decline in the Dhamma and Discipline proclaimed by the Tathāgata.\n\nIt is not possible, friend, that a monastic, without abandoning these ten qualities, will achieve growth, increase, and fullness in this Dhamma and Discipline. But it is indeed possible, friend, that a monastic, having abandoned these ten qualities, will achieve growth, increase, and fullness in this Dhamma and Discipline.",
      "sinhala": "එක් කලෙක ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ රජගහ නුවර වේළුවනාරාමයේ කලන්දකනිවාප නම් තැන වැඩසිටින සේක. එහිදී ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා \"ඇවැත්නි භික්ෂූනි!\" යැයි වදාළ සේක. \"ඇවැත්නි!\" යැයි ඒ භික්ෂූහු ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් මහාකාශ්‍යප ස්ථවිරයන් වහන්සේ මෙසේ වදාළ සේක: \"ඇවැත්නි, මෙහිලා එක් භික්ෂුවක්, 'ඉපදීම ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ සිදුකරන ලදී, මේ භවයට (නැවත) පැමිණීමක් නැතැයි දනිමි' යැයි අර්හත්වය ප්‍රකාශ කරයි. ඒ භික්ෂුව ධ්‍යානලාභී වූ, සමාපත්ති කෙරෙහි දක්ෂ වූ, අනුන්ගේ සිත් දැනීමට දක්ෂ වූ, අනුන්ගේ සිත්වල ගමන් මග දැනීමට දක්ෂ වූ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙක් හෝ ප්‍රශ්න අසමින්, කරුණු විමසමින්, අවවාද කරමින් විමර්ශනය කරයි. ධ්‍යානලාභී වූ, සමාපත්ති කෙරෙහි දක්ෂ වූ, අනුන්ගේ සිත් දැනීමට දක්ෂ වූ, අනුන්ගේ සිත්වල ගමන් මග දැනීමට දක්ෂ වූ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙක් හෝ විසින් ප්‍රශ්න අසනු ලබන විට, කරුණු විමසනු ලබන විට, අවවාද කරනු ලබන විට, ඒ භික්ෂුව අසරණ භාවයට පත්වෙයි, විචලතාවයට පත්වෙයි, අන්ධකාරයට පත්වෙයි, විපත්තියට පත්වෙයි, අන්ධකාරයට හා විපත්තියටම පත්වෙයි.\n\nධ්‍යානලාභී වූ, සමාපත්ති කෙරෙහි දක්ෂ වූ, අනුන්ගේ සිත් දැනීමට දක්ෂ වූ, අනුන්ගේ සිත්වල ගමන් මග දැනීමට දක්ෂ වූ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙක් හෝ ඒ භික්ෂුව සම්බන්ධයෙන් මෙසේ සිතින් සිත මනාව විමසා මෙනෙහි කරයි: 'මේ ආයුෂ්මත් භික්ෂුව \"ඉපදීම ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ සිදුකරන ලදී, මේ භවයට (නැවත) පැමිණීමක් නැතැයි දනිමි\" යැයි අර්හත්වය ප්‍රකාශ කරන්නේ කුමක් නිසාදැයි (සිතයි).'\n\nධ්‍යානලාභී වූ, සමාපත්ති කෙරෙහි දක්ෂ වූ, අනුන්ගේ සිත් දැනීමට දක්ෂ වූ, අනුන්ගේ සිත්වල ගමන් මග දැනීමට දක්ෂ වූ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙක් හෝ ඒ භික්ෂුව සම්බන්ධයෙන් මෙසේ සිතින් සිත මනාව විමසා අවබෝධ කරයි: 'මේ ආයුෂ්මත් භික්ෂුව අධිමානයෙන් යුක්තය, අධිමානය සත්‍ය කොට ඇත්තෙකි, නොලැබූ අර්හත්වයට පැමිණ ඇතැයි සංඥා ඇත්තෙකි, නොකළ දේ කළායයි සංඥා ඇත්තෙකි, නොලැබූ දේ ලැබුවායයි සංඥා ඇත්තෙකි. අධිමානය නිසාම \"ඉපදීම ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ සිදුකරන ලදී, මේ භවයට (නැවත) පැමිණීමක් නැතැයි දනිමි\" යැයි අර්හත්වය ප්‍රකාශ කරයි.'\n\nධ්‍යානලාභී වූ, සමාපත්ති කෙරෙහි දක්ෂ වූ, අනුන්ගේ සිත් දැනීමට දක්ෂ වූ, අනුන්ගේ සිත්වල ගමන් මග දැනීමට දක්ෂ වූ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙක් හෝ ඒ භික්ෂුව සම්බන්ධයෙන් මෙසේ සිතින් සිත මනාව විමසා මෙනෙහි කරයි: 'මේ ආයුෂ්මත් භික්ෂුව කවර කරුණක් නිස්ස කොටගෙනද අධිමානයෙන් යුක්ත වී, අධිමානය සත්‍ය කොටගෙන, නොලැබූ අර්හත්වයට පැමිණ ඇතැයි සංඥා ඇත්තෙක් වී, නොකළ දේ කළායයි සංඥා ඇත්තෙක් වී, නොලැබූ දේ ලැබුවායයි සංඥා ඇත්තෙක් වී, අධිමානය නිසාම \"ඉපදීම ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ සිදුකරන ලදී, මේ භවයට (නැවත) පැමිණීමක් නැතැයි දනිමි\" යැයි අර්හත්වය ප්‍රකාශ කරන්නේ?'\n\nධ්‍යානලාභී වූ, සමාපත්ති කෙරෙහි දක්ෂ වූ, අනුන්ගේ සිත් දැනීමට දක්ෂ වූ, අනුන්ගේ සිත්වල ගමන් මග දැනීමට දක්ෂ වූ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙක් හෝ ඒ භික්ෂුව සම්බන්ධයෙන් මෙසේ සිතින් සිත මනාව විමසා අවබෝධ කරයි: 'මේ ආයුෂ්මත් භික්ෂුව බහුශ්‍රැතයෙකි, (ධර්මය) ධාරණය කරගත්, (ධර්මය) රැස්කරගත් අයෙකි. මුල මනාවූ, මැද මනාවූ, කෙළවර මනාවූ, අර්ථ සහිත, ව්‍යංජන සහිත, සම්පූර්ණයෙන්ම පිරිපුන්, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන යම් ධර්ම කාරණා වේද, එවැනි ධර්ම මොහුට බහුශ්‍රැත වී ඇත, ඒවා මනාව ධාරණය කරගෙන, වචනයෙන් හුරු පුරුදු කරගෙන, මනසින් මෙනෙහි කර, දෘෂ්ටියෙන් මනාව අවබෝධ කරගෙන ඇත. එහෙයින් මේ ආයුෂ්මත් භික්ෂුව අධිමානයෙන් යුක්තය, අධිමානය සත්‍ය කොට ඇත්තෙකි, නොලැබූ අර්හත්වයට පැමිණ ඇතැයි සංඥා ඇත්තෙකි, නොකළ දේ කළායයි සංඥා ඇත්තෙකි, නොලැබූ දේ ලැබුවායයි සංඥා ඇත්තෙකි. අධිමානය නිසාම \"ඉපදීම ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ සිදුකරන ලදී, මේ භවයට (නැවත) පැමිණීමක් නැතැයි දනිමි\" යැයි අර්හත්වය ප්‍රකාශ කරයි.'\n\nධ්‍යානලාභී වූ, සමාපත්ති කෙරෙහි දක්ෂ වූ, අනුන්ගේ සිත් දැනීමට දක්ෂ වූ, අනුන්ගේ සිත්වල ගමන් මග දැනීමට දක්ෂ වූ තථාගතයන් වහන්සේ හෝ තථාගත ශ්‍රාවකයෙක් හෝ ඒ භික්ෂුව සම්බන්ධයෙන් මෙසේ සිතින් සිත මනාව විමසා අවබෝධ කරයි: 'මේ ආයුෂ්මත් භික්ෂුව අභිධ්‍යාව (තණ්හාව) ඇත්තෙකි; අභිධ්‍යාවෙන් වැසීගත් සිතකින් බහුල වශයෙන් වාසය කරයි. අභිධ්‍යාවෙන් වැසීගැනීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි. මේ ආයුෂ්මත් භික්ෂුව ව්‍යාපාදයෙන් (ද්වේශයෙන්) යුක්තය; ව්‍යාපාදයෙන් වැසීගත් සිතකින් බහුල වශයෙන් වාසය කරයි. ව්‍යාපාදයෙන් වැසීගැනීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි. මේ ආයුෂ්මත් භික්ෂුව ථීනමිද්ධයෙන් (අලසකමින් හා මෝහයෙන්) යුක්තය; ථීනමිද්ධයෙන් වැසීගත් සිතකින් බහුල වශයෙන් වාසය කරයි. ථීනමිද්ධයෙන් වැසීගැනීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි. මේ ආයුෂ්මත් භික්ෂුව උද්ධච්චයෙන් (සිත වික්ෂිප්ත වීමෙන්) යුක්තය; උද්ධච්චයෙන් වැසීගත් සිතකින් බහුල වශයෙන් වාසය කරයි. උද්ධච්චයෙන් වැසීගැනීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි. මේ ආයුෂ්මත් භික්ෂුව විචිකිච්ඡාවෙන් (සැකයෙන්) යුක්තය; විචිකිච්ඡාවෙන් වැසීගත් සිතකින් බහුල වශයෙන් වාසය කරයි. විචිකිච්ඡාවෙන් වැසීගැනීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි. මේ ආයුෂ්මත් භික්ෂුව කර්මාන්ත කෙරෙහි ඇලී සිටින්නෙකි, කර්මාන්තයෙහි ඇලී, කර්මාන්තයෙහි ඇලීම අනුගමනය කරන්නෙකි. කර්මාන්තයෙහි ඇලීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි. මේ ආයුෂ්මත් භික්ෂුව කතා බස් කෙරෙහි ඇලී සිටින්නෙකි, කතා බස්හි ඇලී, කතා බස්හි ඇලීම අනුගමනය කරන්නෙකි. කතා බස්හි ඇලීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි. මේ ආයුෂ්මත් භික්ෂුව නිදීමට ඇලී සිටින්නෙකි, නිදීමෙහි ඇලී, නිදීමෙහි ඇලීම අනුගමනය කරන්නෙකි. නිදීමෙහි ඇලීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි. මේ ආයුෂ්මත් භික්ෂුව සමූහයන් සමඟ ඇසුරට ඇලී සිටින්නෙකි, සමූහයන් සමඟ ඇසුරෙහි ඇලී, සමූහයන් සමඟ ඇසුරට ඇලීම අනුගමනය කරන්නෙකි. සමූහයන් සමඟ ඇසුරට ඇලීම නම් තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනයෙහි පිරිහීමකි.'\n\nසැබැවින්ම මේ ආයුෂ්මත්, කළ යුතු උත්තරීතර කටයුතු තිබියදීත්, සීමිත විශේෂ අවබෝධයක් පමණක් ලබාගෙන අතරමග නැවතී ඇත. තථාගතයන් වහන්සේ විසින් ප්‍රකාශ කරන ලද ධර්ම විනයෙහි මෙසේ අතරමග නැවතී සිටීම නම් පරිහානියකි.\n\nආවූසෝ, යම් භික්ෂුවක් මේ දස ධර්මයන් අත්නොහැර, මේ ධර්ම විනයෙහි වර්ධනය, වැඩි දියුණුව හා පූර්ණත්වය ලබන්නේ යැයි කියන්නේ නම්, එය විය හැක්කක් නොවේ. එහෙත්, ආවූසෝ, මේ දස ධර්මයන් අත්හැර යම් භික්ෂුවක් මේ ධර්ම විනයෙහි වර්ධනය, වැඩි දියුණුව හා පූර්ණත්වය ලබන්නේ යැයි කියන්නේ නම්, එය විය හැක්කක් වන්නේ ය.",
      "paliTitle": "Adhimānasuttaṃ",
      "englishTitle": "Discourse on Presumption",
      "sinhalaTitle": "අතිමාන සූත්‍රය"
    },
    {
      "number": 87,
      "pali": "Tatra kho bhagavā kālaṅkataṃ bhikkhuṃ [kalandakaṃ bhikkhuṃ (sī.), kāḷakabhikkhuṃ (syā.)] ārabbha bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Idha, bhikkhave, bhikkhu adhikaraṇiko hoti, adhikaraṇasamathassa na vaṇṇavādī. Yampi, bhikkhave, bhikkhu adhikaraṇiko hoti adhikaraṇasamathassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu na sikkhākāmo hoti, sikkhāsamādānassa [sikkhākāmassa (ka.)] na vaṇṇavādī. Yampi, bhikkhave, bhikkhu na sikkhākāmo hoti sikkhāsamādānassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu pāpiccho hoti, icchāvinayassa na vaṇṇavādī. Yampi, bhikkhave, bhikkhu pāpiccho hoti icchāvinayassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu kodhano hoti, kodhavinayassa na vaṇṇavādī. Yampi, bhikkhave, bhikkhu kodhano hoti kodhavinayassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu makkhī hoti, makkhavinayassa na vaṇṇavādī. Yampi, bhikkhave, bhikkhu makkhī hoti makkhavinayassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu saṭho hoti, sāṭheyyavinayassa na vaṇṇavādī. Yampi, bhikkhave, bhikkhu saṭho hoti sāṭheyyavinayassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu māyāvī hoti, māyāvinayassa na vaṇṇavādī. Yampi, bhikkhave, bhikkhu māyāvī hoti māyāvinayassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammānaṃ na nisāmakajātiko hoti, dhammanisantiyā na vaṇṇavādī. Yampi, bhikkhave, bhikkhu dhammānaṃ na nisāmakajātiko hoti dhammanisantiyā na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu na paṭisallīno hoti, paṭisallānassa na vaṇṇavādī. Yampi, bhikkhave, bhikkhu na paṭisallīno hoti paṭisallānassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu sabrahmacārīnaṃ na paṭisanthārako [paṭisandhārako (ka.)] hoti, paṭisanthārakassa na vaṇṇavādī. Yampi, bhikkhave, bhikkhu sabrahmacārīnaṃ na paṭisanthārako hoti paṭisanthārakassa na vaṇṇavādī, ayampi dhammo na piyatāya na garutāya na bhāvanāya na sāmaññāya na ekībhāvāya saṃvattati. ‘‘Evarūpassa, bhikkhave, bhikkhuno kiñcāpi evaṃ icchā uppajjeyya – ‘aho vata maṃ sabrahmacārī sakkareyyuṃ garuṃ kareyyuṃ [garukareyyuṃ (sī. syā.)] māneyyuṃ pūjeyyu’nti, atha kho naṃ sabrahmacārī na ceva sakkaronti na garuṃ karonti [garukaronti (sī. syā.)] na mānenti na pūjenti. Taṃ kissa hetu? Tathāhissa, bhikkhave, viññū sabrahmacārī te pāpake akusale dhamme appahīne samanupassanti. ‘‘Seyyathāpi, bhikkhave, assakhaḷuṅkassa kiñcāpi evaṃ icchā uppajjeyya – ‘aho vata maṃ manussā ājānīyaṭṭhāne ṭhapeyyuṃ, ājānīyabhojanañca bhojeyyuṃ, ājānīyaparimajjanañca parimajjeyyu’nti, atha kho naṃ manussā na ceva ājānīyaṭṭhāne ṭhapenti na ca ājānīyabhojanaṃ bhojenti na ca ājānīyaparimajjanaṃ parimajjanti. Taṃ kissa hetu? Tathāhissa, bhikkhave, viññū manussā tāni sāṭheyyāni kūṭeyyāni jimheyyāni vaṅkeyyāni appahīnāni samanupassanti. Evamevaṃ kho, bhikkhave, evarūpassa bhikkhuno kiñcāpi evaṃ icchā uppajjeyya – ‘aho vata maṃ sabrahmacārī sakkareyyuṃ garuṃ kareyyuṃ māneyyuṃ pūjeyyu’nti, atha kho naṃ sabrahmacārī na ceva sakkaronti na garuṃ karonti na mānenti na pūjenti. Taṃ kissa hetu? Tathāhissa, bhikkhave, viññū sabrahmacārī te pāpake akusale dhamme appahīne samanupassanti. ‘‘Idha pana, bhikkhave, bhikkhu na adhikaraṇiko hoti, adhikaraṇasamathassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu na adhikaraṇiko hoti adhikaraṇasamathassa vaṇṇavādī, ayampi dhammo piyatāya garutāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu sikkhākāmo hoti, sikkhāsamādānassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu sikkhākāmo hoti sikkhāsamādānassa vaṇṇavādī, ayampi dhammo piyatāya garutāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu appiccho hoti, icchāvinayassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu appiccho hoti icchāvinayassa vaṇṇavādī, ayampi dhammo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu akkodhano hoti, kodhavinayassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu akkodhano hoti kodhavinayassa vaṇṇavādī, ayampi dhammo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu amakkhī hoti, makkhavinayassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu amakkhī hoti makkhavinayassa vaṇṇavādī, ayampi dhammo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu asaṭho hoti, sāṭheyyavinayassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu asaṭho hoti sāṭheyyavinayassa vaṇṇavādī, ayampi dhammo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu amāyāvī hoti, māyāvinayassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu amāyāvī hoti māyāvinayassa vaṇṇavādī, ayampi dhammo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammānaṃ nisāmakajātiko hoti, dhammanisantiyā vaṇṇavādī. Yampi, bhikkhave, bhikkhu dhammānaṃ nisāmakajātiko hoti dhammanisantiyā vaṇṇavādī, ayampi dhammo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu paṭisallīno hoti, paṭisallānassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu paṭisallīno hoti paṭisallānassa vaṇṇavādī, ayampi dhammo…pe… ekībhāvāya saṃvattati. ‘‘Puna caparaṃ, bhikkhave, bhikkhu sabrahmacārīnaṃ paṭisanthārako hoti, paṭisanthārakassa vaṇṇavādī. Yampi, bhikkhave, bhikkhu sabrahmacārīnaṃ paṭisanthārako hoti paṭisanthārakassa vaṇṇavādī, ayampi dhammo piyatāya garutāya bhāvanāya sāmaññāya ekībhāvāya saṃvattati. ‘‘Evarūpassa, bhikkhave, bhikkhuno kiñcāpi na evaṃ icchā uppajjeyya – ‘aho vata maṃ sabrahmacārī sakkareyyuṃ garuṃ kareyyuṃ māneyyuṃ pūjeyyu’nti, atha kho naṃ sabrahmacārī sakkaronti garuṃ karonti mānenti pūjenti. Taṃ kissa hetu? Tathāhissa, bhikkhave, viññū sabrahmacārī te pāpake akusale dhamme pahīne samanupassanti. ‘‘Seyyathāpi, bhikkhave, bhaddassa assājānīyassa kiñcāpi na evaṃ icchā uppajjeyya – ‘aho vata maṃ manussā ājānīyaṭṭhāne ṭhapeyyuṃ, ājānīyabhojanañca bhojeyyuṃ, ājānīyaparimajjanañca parimajjeyyu’nti, atha kho naṃ manussā ājānīyaṭṭhāne ca ṭhapenti ājānīyabhojanañca bhojenti ājānīyaparimajjanañca parimajjanti. Taṃ kissa hetu? Tathāhissa, bhikkhave, viññū manussā tāni sāṭheyyāni kūṭeyyāni jimheyyāni vaṅkeyyāni pahīnāni samanupassanti. ‘‘Evamevaṃ kho, bhikkhave, evarūpassa bhikkhuno kiñcāpi na evaṃ icchā uppajjeyya – ‘aho vata maṃ sabrahmacārī sakkareyyuṃ garuṃ kareyyuṃ māneyyuṃ pūjeyyu’nti, atha kho naṃ sabrahmacārī sakkaronti garuṃ karonti mānenti pūjenti. Taṃ kissa hetu? Tathāhissa, bhikkhave, viññū sabrahmacārī te pāpake akusale dhamme pahīne samanupassantī’’ti. Sattamaṃ.",
      "english": "There, the Blessed One, referring to a monk who had passed away, addressed the monks, saying, “Monks!” “Venerable Sir,” those monks replied to the Blessed One. The Blessed One spoke thus:\n\n“Here, monks, a monk is prone to disputes and does not advocate for the settlement of disputes. And indeed, monks, when a monk is prone to disputes and does not advocate for the settlement of disputes, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk is not desirous of training and does not advocate for the undertaking of training. And indeed, monks, when a monk is not desirous of training and does not advocate for the undertaking of training, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk has wicked desires and does not advocate for the suppression of desires. And indeed, monks, when a monk has wicked desires and does not advocate for the suppression of desires, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk is prone to anger and does not advocate for the suppression of anger. And indeed, monks, when a monk is prone to anger and does not advocate for the suppression of anger, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk is given to disparaging others and does not advocate for the suppression of disparaging. And indeed, monks, when a monk is given to disparaging others and does not advocate for the suppression of disparaging, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk is deceitful and does not advocate for the suppression of deceit. And indeed, monks, when a monk is deceitful and does not advocate for the suppression of deceit, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk is hypocritical and does not advocate for the suppression of hypocrisy. And indeed, monks, when a monk is hypocritical and does not advocate for the suppression of hypocrisy, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk is not of a nature to listen carefully to the teachings and does not advocate for the understanding of the teachings. And indeed, monks, when a monk is not of a nature to listen carefully to the teachings and does not advocate for the understanding of the teachings, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk is not secluded and does not advocate for seclusion. And indeed, monks, when a monk is not secluded and does not advocate for seclusion, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Furthermore, monks, a monk is not cordial towards his fellow practitioners in the holy life and does not advocate for cordiality. And indeed, monks, when a monk is not cordial towards his fellow practitioners in the holy life and does not advocate for cordiality, this practice does not conduce to affection, to respect, to development, to harmony, or to unity.\n\n“Monks, even if such a wish should arise for a monk of such a nature – ‘Oh, if only my fellow practitioners in the holy life would honor me, respect me, revere me, and venerate me!’ – yet his fellow practitioners in the holy life do not honor him, do not respect him, do not revere him, and do not venerate him. What is the reason for that? It is because, monks, his wise fellow practitioners in the holy life perceive those evil, unwholesome qualities in him as not having been abandoned.\n\n“Just as, monks, even if such a wish should arise for a worthless horse – ‘Oh, if only people would treat me as a thoroughbred, and feed me with food fit for a thoroughbred, and groom me with grooming fit for a thoroughbred!’ – yet people do not treat it as a thoroughbred, nor do they feed it with food fit for a thoroughbred, nor do they groom it with grooming fit for a thoroughbred. What is the reason for that? It is because, monks, wise people perceive its deceit, its trickery, its crookedness, and its deviousness as not having been abandoned.\n\n“In the same way, monks, even if such a wish should arise for a monk of such a nature – ‘Oh, if only my fellow practitioners in the holy life would honor me, respect me, revere me, and venerate me!’ – yet his fellow practitioners in the holy life do not honor him, do not respect him, do not revere him, and do not venerate him. What is the reason for that? It is because, monks, his wise fellow practitioners in the holy life perceive those evil, unwholesome qualities in him as not having been abandoned.”\n\nHere, monks, a monk is not prone to disputes and praises the settlement of disputes. And that, monks, a monk is not prone to disputes and praises the settlement of disputes – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk is keen on training and praises the undertaking of training. And that, monks, a monk is keen on training and praises the undertaking of training – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk has few desires and praises the removal of desires. And that, monks, a monk has few desires and praises the removal of desires – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk is not prone to anger and praises the removal of anger. And that, monks, a monk is not prone to anger and praises the removal of anger – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk is not contemptuous and praises the removal of contempt. And that, monks, a monk is not contemptuous and praises the removal of contempt – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk is not deceitful and praises the removal of deceit. And that, monks, a monk is not deceitful and praises the removal of deceit – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk is not fraudulent and praises the removal of fraud. And that, monks, a monk is not fraudulent and praises the removal of fraud – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk is discerning of phenomena and praises the discernment of phenomena. And that, monks, a monk is discerning of phenomena and praises the discernment of phenomena – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk is secluded and praises seclusion. And that, monks, a monk is secluded and praises seclusion – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nFurthermore, monks, a monk is cordial to his fellow monastics and praises cordiality. And that, monks, a monk is cordial to his fellow monastics and praises cordiality – this quality too conduces to endearment, respect, spiritual development, harmony, and unity.\n\nMonks, even if such a monk does not have the wish, ‘Oh, if only my fellow monastics would honor me, respect me, revere me, venerate me,’ yet his fellow monastics do honor him, respect him, revere him, venerate him. For what reason? Because, monks, his discerning fellow monastics see those evil, unwholesome qualities as abandoned in him.\n\nJust as, monks, for a noble thoroughbred horse, even if it does not have the wish, ‘Oh, if only people would place me in the position of a thoroughbred, feed me thoroughbred’s food, and groom me with a thoroughbred’s grooming,’ yet people do place him in the position of a thoroughbred, feed him thoroughbred’s food, and groom him with a thoroughbred’s grooming. For what reason? Because, monks, discerning people see those deceits, frauds, crookednesses, and deviances as abandoned in him.\n\nEven so, monks, even if such a monk does not have the wish, ‘Oh, if only my fellow monastics would honor me, respect me, revere me, venerate me,’ yet his fellow monastics do honor him, respect him, revere him, venerate him. For what reason? Because, monks, his discerning fellow monastics see those evil, unwholesome qualities as abandoned in him.",
      "sinhala": "එහිදී භාග්‍යවතුන් වහන්සේ කාලක්‍රියා කළ භික්ෂුවක් අරභයා භික්ෂූන් වහන්සේලාට ආමන්ත්‍රණය කොට, ‘‘මහණෙනි’’යි වදාළ සේක. ‘‘ස්වාමීනී’’යි ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට ප්‍රතිචාර දැක්වූහ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ‘‘මහණෙනි, මේ ශාසනයෙහි භික්ෂුවක් අධිකරණ ඇතිකර ගන්නා සුළු වේ, අධිකරණ සමථයට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් අධිකරණ ඇතිකර ගන්නා සුළු වේද, අධිකරණ සමථයට ප්‍රශංසා නොකරයිද, මේ ධර්මය ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් ශික්ෂා කැමැත්තෙක් නොවේ, ශික්ෂා සමාදන්වීමට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් ශික්ෂා කැමැත්තෙක් නොවේද, ශික්ෂා සමාදන්වීමට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් නපුරු ආශාවන් ඇත්තෙක් වේ, ආශාවන් දුරුකිරීමට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් නපුරු ආශාවන් ඇත්තෙක් වේද, ආශාවන් දුරුකිරීමට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් කෝප ඇත්තෙක් වේ, කෝපය දුරුකිරීමට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් කෝප ඇත්තෙක් වේද, කෝපය දුරුකිරීමට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් මසුරු ස්වභාව ඇත්තෙක් වේ, මසුරු ස්වභාවය දුරුකිරීමට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් මසුරු ස්වභාව ඇත්තෙක් වේද, මසුරු ස්වභාවය දුරුකිරීමට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් වංචාකාරී වේ, වංචාව දුරුකිරීමට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් වංචාකාරී වේද, වංචාව දුරුකිරීමට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් මවා පෙන්වන ස්වභාවය ඇත්තෙක් වේ, මවා පෙන්වන ස්වභාවය දුරුකිරීමට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් මවා පෙන්වන ස්වභාවය ඇත්තෙක් වේද, මවා පෙන්වන ස්වභාවය දුරුකිරීමට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් ධර්ම කරුණුවලට හොඳින් සවන් දෙන ස්වභාවය ඇත්තෙක් නොවේ, ධර්මය විචාරයෙන් විමසා බැලීමට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් ධර්ම කරුණුවලට හොඳින් සවන් දෙන ස්වභාවය ඇත්තෙක් නොවේද, ධර්මය විචාරයෙන් විමසා බැලීමට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් එකලා වූයේ නොවේ, හුදකලා භාවයට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් එකලා වූයේ නොවේද, හුදකලා භාවයට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘තවද, මහණෙනි, භික්ෂුවක් සබ්‍රහ්මචාරීන්ට පිළිසඳර කරන්නෙක් නොවේ, පිළිසඳරට ප්‍රශංසා නොකරයි. මහණෙනි, යම් භික්ෂුවක් සබ්‍රහ්මචාරීන්ට පිළිසඳර කරන්නෙක් නොවේද, පිළිසඳරට ප්‍රශංසා නොකරයිද, මේ ධර්මයත් ප්‍රිය භාවයට, ගරු භාවයට, වර්ධනයට, සාමග්‍රියට, එකමුතු භාවයට හේතු නොවේ.\n\n‘‘මහණෙනි, මෙබඳු භික්ෂුවකට යම් හෙයකින් මෙවන් ආශාවක් උපදී නම් – ‘අහෝ! මා සබ්‍රහ්මචාරීන් සත්කාර කෙරෙත්වා, ගරු කෙරෙත්වා, මානය කෙරෙත්වා, පූජා කෙරෙත්වා’ යැයි, එහෙත් සබ්‍රහ්මචාරීන් ඔහුව සත්කාර නොකරති, ගරු නොකරති, මානය නොකරති, පූජා නොකරති. ඒ කුමක් හෙයින්ද? මහණෙනි, නුවණැති සබ්‍රහ්මචාරීන් ඒ පාපී අකුසල ධර්මයන් (ඔහු තුළ) ප්‍රහීණ නොවූ බව දකිති.\n\n‘‘මහණෙනි, යම්සේ පුහුණු නැති අශ්වයෙකුට යම් හෙයකින් මෙවන් ආශාවක් උපදී නම් – ‘අහෝ! මිනිස්සු මා ආජානීය අශ්වයන් තබන තැන තබත්වා, ආජානීය අශ්වයන්ට දෙන ආහාර දෙත්වා, ආජානීය අශ්වයන් පිරිමදින පරිද්දෙන් මා පිරිමදිත්වා’ යැයි, එහෙත් මිනිස්සු ඔහුව ආජානීය අශ්වයන් තබන තැන නොතබති, ආජානීය අශ්වයන්ට දෙන ආහාර නොදෙති, ආජානීය අශ්වයන් පිරිමදින පරිද්දෙන් නොපිරිමදිති. ඒ කුමක් හෙයින්ද? මහණෙනි, නුවණැති මිනිස්සු ඒ (ඔහු තුළ ඇති) වංචාවන්, කූට උපක්‍රමයන්, වක්‍ර ස්වභාවයන්, කුටිල ස්වභාවයන් ප්‍රහීණ නොවූ බව දකිති. මහණෙනි, එපරිද්දෙන්ම, මෙබඳු භික්ෂුවකට යම් හෙයකින් මෙවන් ආශාවක් උපදී නම් – ‘අහෝ! මා සබ්‍රහ්මචාරීන් සත්කාර කෙරෙත්වා, ගරු කෙරෙත්වා, මානය කෙරෙත්වා, පූජා කෙරෙත්වා’ යැයි, එහෙත් සබ්‍රහ්මචාරීන් ඔහුව සත්කාර නොකරති, ගරු නොකරති, මානය නොකරති, පූජා නොකරති. ඒ කුමක් හෙයින්ද? මහණෙනි, නුවණැති සබ්‍රහ්මචාරීන් ඒ පාපී අකුසල ධර්මයන් (ඔහු තුළ) ප්‍රහීණ නොවූ බව දකිති.\n\nමහණෙනි, මෙහිලා භික්ෂුව කලහකාරී නොවේ; අධිකරණ සමනය කිරීමේ ගුණය වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් කලහකාරී නොවේද, අධිකරණ සමනය කිරීමේ ගුණය වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව ශික්ෂාකාමී වෙයි; ශික්ෂාව සමාදන් වීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් ශික්ෂාකාමී වේද, ශික්ෂාව සමාදන් වීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව අල්පේච්ඡ වෙයි; ආශා දුරු කිරීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් අල්පේච්ඡ වේද, ආශා දුරු කිරීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව ක‍්‍රෝධ රහිත වෙයි; ක‍්‍රෝධය දුරු කිරීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් ක‍්‍රෝධ රහිත වේද, ක‍්‍රෝධය දුරු කිරීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව ගුණමකු නොවේ; ගුණමකු බව දුරු කිරීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් ගුණමකු නොවේද, ගුණමකු බව දුරු කිරීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව කුහක නොවේ; කුහකකම දුරු කිරීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් කුහක නොවේද, කුහකකම දුරු කිරීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව මායාකාරී නොවේ; මායාව දුරු කිරීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් මායාකාරී නොවේද, මායාව දුරු කිරීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව ධර්මයන් විමසා බලන ස්වභාව ඇත්තෙක් වෙයි; ධර්මයන් විමසා බැලීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් ධර්මයන් විමසා බලන ස්වභාව ඇත්තෙක් වේද, ධර්මයන් විමසා බැලීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව පිළිසන්ව වාසය කරන්නෙක් වෙයි; පිළිසන්ව වාසය කිරීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් පිළිසන්ව වාසය කරන්නෙක් වේද, පිළිසන්ව වාසය කිරීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nතවද, මහණෙනි, භික්ෂුව සබ‍්‍රහ්මචාරීන්ට පිළිසඳර කරන්නෙක් වෙයි; පිළිසඳර කිරීම වර්ණනා කරන්නෙක් වෙයි. මහණෙනි, යම් භික්ෂුවක් සබ‍්‍රහ්මචාරීන්ට පිළිසඳර කරන්නෙක් වේද, පිළිසඳර කිරීම වර්ණනා කරන්නෙක් වේද, මේ ධර්මය ප‍්‍රිය භාවයට, ගෞරව භාවයට, වර්ධනයට, සමගියට, ඒකී භාවයට පත්වීම පිණිස පවතී.\n\nමහණෙනි, මෙබඳු භික්ෂුවකට ‘අහෝ, මාගේ සබ‍්‍රහ්මචාරීහු මා සත්කාර කරත්වා, ගෞරව කරත්වා, මානය කරත්වා, පූජා කරත්වා’ යනුවෙන් ආශාවක් නොඋපදීද වුවත්, එහෙත්, ඔහුගේ සබ‍්‍රහ්මචාරීහු ඔහුට සත්කාර කරති, ගෞරව කරති, මානය කරති, පූජා කරති. ඒ කවර හෙයින්ද? මහණෙනි, මක්නිසාද යත්, ඔහුගේ නුවණැති සබ‍්‍රහ්මචාරීහු ඒ පව්කම් සහිත අකුසල ධර්මයන් ප‍්‍රහීණ වූ බව දකිති.\n\nමහණෙනි, යම්සේ, භද්‍ර අශ්වජානියෙකුට ‘අහෝ, මිනිස්සු මා අශ්වජානියෙකු ලෙස තබත්වා, අශ්වජානී ආහාරයෙන් මා පෝෂණය කරත්වා, අශ්වජානී සාත්තු සප්පායම් වලින් මා පිරිමදිත්වා’ යනුවෙන් ආශාවක් නොඋපදීද වුවත්, එහෙත්, මිනිස්සු ඔහු අශ්වජානියෙකු ලෙස තබති, අශ්වජානී ආහාරයෙන් පෝෂණය කරති, අශ්වජානී සාත්තු සප්පායම් වලින් පිරිමදිති. ඒ කවර හෙයින්ද? මහණෙනි, මක්නිසාද යත්, නුවණැති මිනිස්සු ඔහුගේ වංකකම්, කූටකම්, වංචාකම්, නීචකම් ප‍්‍රහීණ වූ බව දකිති.\n\nමහණෙනි, එපරිද්දෙන්ම, මෙබඳු භික්ෂුවකට ‘අහෝ, මාගේ සබ‍්‍රහ්මචාරීහු මා සත්කාර කරත්වා, ගෞරව කරත්වා, මානය කරත්වා, පූජා කරත්වා’ යනුවෙන් ආශාවක් නොඋපදීද වුවත්, එහෙත්, ඔහුගේ සබ‍්‍රහ්මචාරීහු ඔහුට සත්කාර කරති, ගෞරව කරති, මානය කරති, පූජා කරති. ඒ කවර හෙයින්ද? මහණෙනි, මක්නිසාද යත්, ඔහුගේ නුවණැති සබ‍්‍රහ්මචාරීහු ඒ පව්කම් සහිත අකුසල ධර්මයන් ප‍්‍රහීණ වූ බව දකිති.",
      "paliTitle": "Nappiyasuttaṃ",
      "englishTitle": "Nappiya's Discourse",
      "sinhalaTitle": "නප්පිය සූත‍්‍රය"
    },
    {
      "number": 88,
      "pali": "‘‘Yo so, bhikkhave, bhikkhu akkosakaparibhāsako ariyūpavādī sabrahmacārīnaṃ ṭhānametaṃ avakāso [aṭṭhānametaṃ anavakāso (sī. syā. pī.)] yaṃ so dasannaṃ byasanānaṃ aññataraṃ byasanaṃ nigaccheyya [na nigaccheyya (sī. syā. pī.)]. Katamesaṃ dasannaṃ? Anadhigataṃ nādhigacchati, adhigatā parihāyati, saddhammassa na vodāyanti, saddhammesu vā adhimāniko hoti anabhirato vā brahmacariyaṃ carati, aññataraṃ vā saṃkiliṭṭhaṃ āpattiṃ āpajjati, gāḷhaṃ vā rogātaṅkaṃ phusati, ummādaṃ vā pāpuṇāti cittakkhepaṃ, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Yo so, bhikkhave, bhikkhu akkosakaparibhāsako ariyūpavādī sabrahmacārīnaṃ, ṭhānametaṃ avakāso yaṃ so imesaṃ dasannaṃ byasanānaṃ aññataraṃ byasanaṃ nigaccheyyā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, as for that monk who abuses and reviles, and slanders Noble Ones among his fellow practitioners of the holy life, it is a possible occasion that he will fall into one of ten misfortunes. Which ten? He does not attain what has not been attained; he declines from what has been attained; his mind is not purified in the Good Dhamma; or he becomes conceited about the Good Dhamma; or he practices the holy life without delight; or he incurs some defiling offense; or he experiences a severe illness; or he falls into madness, mental derangement; he dies bewildered; and with the breaking up of the body, after death, he reappears in a state of deprivation, a bad destination, a downfall, in hell. Monks, as for that monk who abuses and reviles, and slanders Noble Ones among his fellow practitioners of the holy life, it is a possible occasion that he will fall into one of these ten misfortunes.",
      "sinhala": "භික්ෂූන් වහන්සේලා, යම්කිසි භික්ෂුවක් තම සමබ්‍රහ්මචාරීන්ට අපහාස කරන, දොස් පවරන, ආර්යයන්ට නින්දා කරන අයෙක් වේද, ඔහු දස අනර්ථයන්ගෙන් එකක් විඳීමට ඉඩකඩ ඇත.\n\nඒ දස අනර්ථයන් කවරේද?\n\nලබා නොගත් දෙයක් ලබා නොගනී, ලබාගත් දෙයින් පිරිහී යයි, සද්ධර්මය පිළිබඳ ඔහුගේ අවබෝධය පිරිසිදු නොවේ, නැතිනම් ඔහු සද්ධර්මය ගැන අධිමානී වේ, නැතිනම් අකමැත්තෙන් බ්‍රහ්මචාරීව වාසය කරයි, නැතිනම් සංකිලිට්ඨ ආපත්තියකට පත් වේ, නැතිනම් දැඩි රෝගාබාධයකින් පෙළේ, නැතිනම් උමතුවට හෝ සිහි විකල් බවට පත් වේ, මුළා වූ සිහියෙන් මිය යයි, ශරීරය බිඳී, මරණින් මතු දුගතිගාමී අපාය, දුර්ගති, විනිපාත, නිරය යන තැන්වල උපදී.\n\nභික්ෂූන් වහන්සේලා, යම්කිසි භික්ෂුවක් තම සමබ්‍රහ්මචාරීන්ට අපහාස කරන, දොස් පවරන, ආර්යයන්ට නින්දා කරන අයෙක් වේද, ඔහු මේ දස අනර්ථයන්ගෙන් එකක් විඳීමට ඉඩකඩ ඇත.",
      "paliTitle": "Akkosakasuttaṃ",
      "englishTitle": "The Abuser Sutta",
      "sinhalaTitle": "අක්කෝසක සූත්‍රය"
    },
    {
      "number": 89,
      "pali": "[saṃ. ni. 1.181; su. ni. kokālikasutta] Atha kho kokāliko bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho kokāliko bhikkhu bhagavantaṃ etadavoca – ‘‘pāpicchā, bhante, sāriputtamoggallānā, pāpikānaṃ icchānaṃ vasaṃ gatā’’ti. ‘‘Mā hevaṃ, kokālika, mā hevaṃ, kokālika! Pasādehi, kokālika, sāriputtamoggallānesu cittaṃ. Pesalā sāriputtamoggallānā’’ti. Dutiyampi kho kokāliko bhikkhu bhagavantaṃ etadavoca – ‘‘kiñcāpi me, bhante, bhagavā saddhāyiko paccayiko, atha kho pāpicchāva sāriputtamoggallānā, pāpikānaṃ icchānaṃ vasaṃ gatā’’ti. ‘‘Mā hevaṃ, kokālika, mā hevaṃ, kokālika! Pasādehi, kokālika, sāriputtamoggallānesu cittaṃ. Pesalā sāriputtamoggallānā’’ti. Tatiyampi kho kokāliko bhikkhu bhagavantaṃ etadavoca – ‘‘kiñcāpi me, bhante, bhagavā saddhāyiko paccayiko, atha kho pāpicchāva sāriputtamoggallānā, pāpikānaṃ icchānaṃ vasaṃ gatā’’ti. ‘‘Mā hevaṃ, kokālika, mā hevaṃ, kokālika! Pasādehi, kokālika, sāriputtamoggallānesu cittaṃ. Pesalā sāriputtamoggallānā’’ti. Atha kho kokāliko bhikkhu uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Acirapakkantassa ca kokālikassa bhikkhuno sāsapamattīhi pīḷakāhi sabbo kāyo phuṭo ahosi. Sāsapamattiyo hutvā muggamattiyo ahesuṃ, muggamattiyo hutvā kalāyamattiyo ahesuṃ, kalāyamattiyo hutvā kolaṭṭhimattiyo ahesuṃ, kolaṭṭhimattiyo hutvā kolamattiyo ahesuṃ, kolamattiyo hutvā āmalakamattiyo ahesuṃ, āmalakamattiyo hutvā (tiṇḍukamattiyo ahesuṃ, tiṇḍukamattiyo hutvā,) [saṃ. ni. 1.181; su. ni. kokālikasutta natthi] beḷuvasalāṭukamattiyo ahesuṃ, beḷuvasalāṭukamattiyo hutvā billamattiyo ahesuṃ, billamattiyo hutvā pabhijjiṃsu, pubbañca lohitañca pagghariṃsu. So sudaṃ kadalipattesu seti macchova visagilito. Atha kho turū paccekabrahmā [tuduppaccekabrahmā (sī. pī.), tudi paccekabrahmā (syā.), turi paccekabrahmā (ka.) saṃ. ni. 1.180] yena kokāliko bhikkhu tenupasaṅkami; upasaṅkamitvā vehāse ṭhatvā kokālikaṃ bhikkhuṃ etadavoca – ‘‘pasādehi, kokālika, sāriputtamoggallānesu cittaṃ. Pesalā sāriputtamoggallānā’’ti. ‘‘Kosi tvaṃ, āvuso’’ti? ‘‘Ahaṃ turū paccekabrahmā’’ti. ‘‘Nanu tvaṃ, āvuso, bhagavatā anāgāmī byākato, atha kiñcarahi idhāgato? Passa yāvañca te idaṃ aparaddha’’nti. Atha kho turū paccekabrahmā kokālikaṃ bhikkhuṃ gāthāhi ajjhabhāsi – ‘‘Purisassa hi jātassa, kuṭhārī jāyate mukhe; Yāya chindati attānaṃ, bālo dubbhāsitaṃ bhaṇaṃ. ‘‘Yo nindiyaṃ pasaṃsati, taṃ vā nindati yo pasaṃsiyo; Vicināti mukhena so kaliṃ, kalinā tena sukhaṃ na vindati. ‘‘Appamattako ayaṃ kali, yo akkhesu dhanaparājayo; Sabbassāpi sahāpi attanā, ayameva mahattaro kali; Yo sugatesu manaṃ padūsaye. ‘‘Sataṃ sahassānaṃ nirabbudānaṃ, chattiṃsati pañca ca abbudāni; Yamariyagarahī nirayaṃ upeti, vācaṃ manañca paṇidhāya pāpaka’’nti. Atha kho kokāliko bhikkhu teneva ābādhena kālamakāsi. Kālaṅkato ca kokāliko bhikkhu padumaṃ nirayaṃ upapajjati sāriputtamoggallānesu cittaṃ āghātetvā. Atha kho brahmā sahampati abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho brahmā sahampati bhagavantaṃ etadavoca – ‘‘kokāliko, bhante, bhikkhu kālaṅkato. Kālaṅkato ca, bhante, kokāliko bhikkhu padumaṃ nirayaṃ upapanno sāriputtamoggallānesu cittaṃ āghātetvā’’ti. Idamavoca brahmā sahampati. Idaṃ vatvā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyi. Atha kho bhagavā tassā rattiyā accayena bhikkhū āmantesi – ‘‘imaṃ, bhikkhave, rattiṃ brahmā sahampati abhikkantāya rattiyā abhikkantavaṇṇo kevalakappaṃ jetavanaṃ obhāsetvā yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho, bhikkhave, brahmā sahampati maṃ etadavoca – ‘kokāliko, bhante, bhikkhu kālaṅkato; kālaṅkato ca, bhante, kokāliko bhikkhu padumaṃ nirayaṃ upapanno sāriputtamoggallānesu cittaṃ āghātetvā’ti. Idamavoca, bhikkhave, brahmā sahampati. Idaṃ vatvā maṃ abhivādetvā padakkhiṇaṃ katvā tatthevantaradhāyī’’ti. Evaṃ vutte aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘kīva dīghaṃ nu kho, bhante, padume niraye āyuppamāṇa’’nti? ‘‘Dīghaṃ kho, bhikkhu, padume niraye āyuppamāṇaṃ. Na taṃ sukaraṃ saṅkhātuṃ – ‘ettakāni vassānīti vā ettakāni vassasatānīti vā ettakāni vassasahassānīti vā ettakāni vassasatasahassānīti vā’’’ti. ‘‘Sakkā pana, bhante, upamaṃ kātu’’nti? ‘‘Sakkā, bhikkhū,’’ti bhagavā avoca – ‘‘seyyathāpi, bhikkhu, vīsatikhāriko kosalako tilavāho tato puriso vassasatassa vassasatassa accayena ekamekaṃ tilaṃ uddhareyya. Khippataraṃ kho so, bhikkhu, vīsatikhāriko kosalako tilavāho iminā upakkamena parikkhayaṃ pariyādānaṃ gaccheyya, na tveva eko abbudo nirayo. Seyyathāpi, bhikkhu, vīsati abbudā nirayā, evameko nirabbudo nirayo. Seyyathāpi, bhikkhu, vīsati nirabbudā nirayā, evameko ababo nirayo. Seyyathāpi, bhikkhu, vīsati ababā nirayā, evameko aṭaṭo nirayo. Seyyathāpi, bhikkhu, vīsati aṭaṭā nirayā, evameko ahaho nirayo. Seyyathāpi, bhikkhu, vīsati ahahā nirayā, evameko kumudo nirayo. Seyyathāpi, bhikkhu, vīsati kumudā nirayā, evameko sogandhiko nirayo. Seyyathāpi, bhikkhu, vīsati sogandhikā nirayā, evameko uppalako nirayo. Seyyathāpi, bhikkhu, vīsati uppalakā nirayā, evameko puṇḍarīko nirayo. Seyyathāpi, bhikkhu, vīsati puṇḍarīkā nirayā, evameko padumo nirayo. Padumaṃ kho pana, bhikkhu, nirayaṃ kokāliko bhikkhu upapanno sāriputtamoggallānesu cittaṃ āghātetvā’’ti. Idamavoca bhagavā. Idaṃ vatvāna sugato athāparaṃ etadavoca satthā – ‘‘Purisassa hi jātassa, kuṭhārī jāyate mukhe; Yāya chindati attānaṃ, bālo dubbhāsitaṃ bhaṇaṃ. ‘‘Yo nindiyaṃ pasaṃsati, taṃ vā nindati yo pasaṃsiyo; Vicināti mukhena so kaliṃ, kalinā tena sukhaṃ na vindati. ‘‘Appamattako ayaṃ kali, yo akkhesu dhanaparājayo; Sabbassāpi sahāpi attanā, ayameva mahattaro kali; Yo sugatesu manaṃ padūsaye. ‘‘Sataṃ sahassānaṃ nirabbudānaṃ, chattiṃsati pañca ca abbudāni; Yamariyagarahī nirayaṃ upeti, vācaṃ manañca paṇidhāya pāpaka’’nti. navamaṃ;",
      "english": "Then the monk Kokālika approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the monk Kokālika said to the Blessed One, \"Venerable sir, Sāriputta and Moggallāna are of evil desires, they are under the sway of evil desires.\" \"Do not speak thus, Kokālika! Do not speak thus, Kokālika! Clear your mind, Kokālika, regarding Sāriputta and Moggallāna. Sāriputta and Moggallāna are of good conduct and endearing.\" A second time, the monk Kokālika said to the Blessed One, \"Even though you, Venerable sir, are trustworthy and reliable to me, Sāriputta and Moggallāna are indeed of evil desires, they are under the sway of evil desires.\" \"Do not speak thus, Kokālika! Do not speak thus, Kokālika! Clear your mind, Kokālika, regarding Sāriputta and Moggallāna. Sāriputta and Moggallāna are of good conduct and endearing.\" A third time, the monk Kokālika said to the Blessed One, \"Even though you, Venerable sir, are trustworthy and reliable to me, Sāriputta and Moggallāna are indeed of evil desires, they are under the sway of evil desires.\" \"Do not speak thus, Kokālika! Do not speak thus, Kokālika! Clear your mind, Kokālika, regarding Sāriputta and Moggallāna. Sāriputta and Moggallāna are of good conduct and endearing.\" Then the monk Kokālika rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed.\n\nNot long after the monk Kokālika had departed, his entire body became covered with boils the size of mustard seeds. Having been the size of mustard seeds, they became the size of mung beans; having been the size of mung beans, they became the size of peas; having been the size of peas, they became the size of jujube seeds; having been the size of jujube seeds, they became the size of kola fruit; having been the size of kola fruit, they became the size of āmalaka fruit; having been the size of āmalaka fruit, they became the size of unripe bael fruit; having been the size of unripe bael fruit, they became the size of ripe bael fruit. Having become the size of ripe bael fruit, they burst open, and pus and blood flowed forth. He lay there on banana leaves, like a fish that had swallowed poison.\n\nThen the solitary Brahmā Turū approached the monk Kokālika. Having approached and stood in the air, he said to the monk Kokālika, \"Clear your mind, Kokālika, regarding Sāriputta and Moggallāna. Sāriputta and Moggallāna are of good conduct and endearing.\" \"Who are you, friend?\" \"I am the solitary Brahmā Turū.\" \"Friend, weren't you declared by the Blessed One to be a Non-returner? Then why have you come here? See how greatly you have erred!\" Then the solitary Brahmā Turū addressed the monk Kokālika with verses:\n\"Indeed, an axe is born in the mouth of a man, with which the fool, speaking ill, cuts himself down.\nHe who praises what is blameworthy, or blames what is praiseworthy, gathers misfortune with his mouth; through that misfortune, he finds no happiness.\nThis misfortune is slight, which is a loss of wealth in gambling, even of one's entire self; but this misfortune is much greater: to pollute one's mind against the well-gone ones.\nOne hundred thousand *nirabbudas*, and thirty-six *abbudas*, are the hells to which one goes who reviles the noble ones, having set forth evil speech and mind.\"\n\nThen the monk Kokālika passed away from that very affliction. And having passed away, the monk Kokālika was reborn in the Paduma hell, having harbored hatred in his mind towards Sāriputta and Moggallāna.\n\nThen, when the night was far advanced, with resplendent beauty illuminating the entire Jeta Grove, Brahmā Sahampati approached the Blessed One. Having approached and paid homage to the Blessed One, he stood to one side. As he stood to one side, Brahmā Sahampati said to the Blessed One, \"Venerable sir, the monk Kokālika has passed away. And having passed away, Venerable sir, the monk Kokālika has been reborn in the Paduma hell, having harbored hatred in his mind towards Sāriputta and Moggallāna.\" Thus spoke Brahmā Sahampati. Having said this, he paid homage to the Blessed One, circumambulated him clockwise, and vanished right there.\n\nThen, when that night had passed, the Blessed One addressed the monastics: \"Monastics, this night, Brahmā Sahampati, with resplendent beauty illuminating the entire Jeta Grove when the night was far advanced, approached me. Having approached and paid homage to me, he stood to one side. As he stood to one side, monastics, Brahmā Sahampati said to me, 'Venerable sir, the monk Kokālika has passed away. And having passed away, Venerable sir, the monk Kokālika has been reborn in the Paduma hell, having harbored hatred in his mind towards Sāriputta and Moggallāna.' Thus spoke Brahmā Sahampati, monastics. Having said this, he paid homage to me, circumambulated me clockwise, and vanished right there.\"\n\nWhen this was said, a certain monk said to the Blessed One, “Venerable Sir, what is the length of life in the Paduma hell?”\n\n“Long, monk, is the length of life in the Paduma hell. It is not easy to calculate it as ‘so many years, or so many hundreds of years, or so many thousands of years, or so many hundreds of thousands of years.’”\n\n“But, Venerable Sir, is it possible to give an analogy?” “It is possible, monk,” the Blessed One said. “Suppose, monk, there was a twenty-*khāri* measure load of Kosalan sesame seeds, and from that, a man were to remove one single sesame seed at the end of every hundred years. Sooner, monk, would that twenty-*khāri* measure load of Kosalan sesame seeds come to an end, to utter exhaustion, by this method, than would one Abbuda hell. Just as, monk, twenty Abbuda hells make one Nirabbuda hell. Just as, monk, twenty Nirabbuda hells make one Ababo hell. Just as, monk, twenty Ababo hells make one Aṭaṭo hell. Just as, monk, twenty Aṭaṭo hells make one Ahaho hell. Just as, monk, twenty Ahaho hells make one Kumudo hell. Just as, monk, twenty Kumudo hells make one Sogandhiko hell. Just as, monk, twenty Sogandhiko hells make one Uppalako hell. Just as, monk, twenty Uppalako hells make one Puṇḍarīko hell. Just as, monk, twenty Puṇḍarīko hells make one Padumo hell. And indeed, monk, Kokālika the monk was reborn into the Paduma hell, having harbored ill-will towards Sāriputta and Moggallāna.”\n\nThe Blessed One spoke this. Having said this, the Fortunate One, the Teacher, further said this:\n\n“For a person who is born, an axe is born in their mouth; by which the fool, speaking ill words, cuts themselves.\n\nWhoever praises that which is blameworthy, or blames that which is praiseworthy, gathers misfortune through their mouth; by that misfortune, they find no happiness.\n\nSlight is this misfortune, which is the loss of wealth in gambling, even the loss of everything including oneself; but this is a far greater misfortune: to defile one’s mind towards the Fortunate Ones.\n\nOne who slanders the Noble Ones goes to a hell with a lifespan of a hundred thousand Nirabbudas and a hundred and eighty Abbuda hells, having committed evil speech and mind.”",
      "sinhala": "එසමයෙහි කෝකාලික භික්ෂුව භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි විය. එක් පසෙකින් වාඩි වී සිටි කෝකාලික භික්ෂුව භාග්‍ය​වතුන් වහන්සේට මෙසේ කීවේය – \"ස්වාමීනි, සාරිපුත්ත මොග්ගල්ලාන දෙනම පාපී ආශාවන් ඇති අය වෙති, ඔවුහු පාපී වූ ආශාවන්ට වසඟ වී සිටිති.\" \"කෝකාලික, එසේ නොකියන්න, කෝකාලික, එසේ නොකියන්න! කෝකාලික, සාරිපුත්ත මොග්ගල්ලාන දෙනම කෙරෙහි සිත පහදවා ගන්න. සාරිපුත්ත මොග්ගල්ලාන දෙනම ශ්‍ර​ේෂ්ඨ ගුණධර්මයන්ගෙන් යුත් උතුමන්ය.\" දෙවන වරටත් කෝකාලික භික්ෂුව භාග්‍ය​වතුන් වහන්සේට මෙසේ කීවේය – \"ස්වාමීනි, භාග්‍ය​වතුන් වහන්සේ මට විශ්වාස කටයුතු වූ, ගෞරවාර්හ වූ උතුමෙකි වුවත්, සාරිපුත්ත මොග්ගල්ලාන දෙනම පාපී ආශාවන් ඇති අය වෙති, ඔවුහු පාපී වූ ආශාවන්ට වසඟ වී සිටිති.\" \"කෝකාලික, එසේ නොකියන්න, කෝකාලික, එසේ නොකියන්න! කෝකාලික, සාරිපුත්ත මොග්ගල්ලාන දෙනම කෙරෙහි සිත පහදවා ගන්න. සාරිපුත්ත මොග්ගල්ලාන දෙනම ශ්‍ර​ේෂ්ඨ ගුණධර්මයන්ගෙන් යුත් උතුමන්ය.\" තුන්වන වරටත් කෝකාලික භික්ෂුව භාග්‍ය​වතුන් වහන්සේට මෙසේ කීවේය – \"ස්වාමීනි, භාග්‍ය​වතුන් වහන්සේ මට විශ්වාස කටයුතු වූ, ගෞරවාර්හ වූ උතුමෙකි වුවත්, සාරිපුත්ත මොග්ගල්ලාන දෙනම පාපී ආශාවන් ඇති අය වෙති, ඔවුහු පාපී වූ ආශාවන්ට වසඟ වී සිටිති.\" \"කෝකාලික, එසේ නොකියන්න, කෝකාලික, එසේ නොකියන්න! කෝකාලික, සාරිපුත්ත මොග්ගල්ලාන දෙනම කෙරෙහි සිත පහදවා ගන්න. සාරිපුත්ත මොග්ගල්ලාන දෙනම ශ්‍ර​ේෂ්ඨ ගුණධර්මයන්ගෙන් යුත් උතුමන්ය.\"\n\nඉන්පසු කෝකාලික භික්ෂුව අසුනෙන් නැගිට, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර, පැදකුණු කොට පිටත්ව ගියේය. කෝකාලික භික්ෂුව පිටත්ව ගොස් වැඩි වේලාවක් ගතවීමට පෙර, මුළු ශරීරයම අබ ඇට ප්‍ර​මාණයේ බිබිළි වලින් වැසී ගියේය. අබ ඇට ප්‍ර​මාණයේ බිබිළි මෑ ඇට ප්‍ර​මාණයටද, මෑ ඇට ප්‍ර​මාණයේ ඒවා කඩල ඇට ප්‍ර​මාණයටද, කඩල ඇට ප්‍ර​මාණයේ ඒවා කොලැටි ඇට ප්‍ර​මාණයටද, කොලැටි ඇට ප්‍ර​මාණයේ ඒවා සියඹලා ගෙඩි ප්‍ර​මාණයටද, සියඹලා ගෙඩි ප්‍ර​මාණයේ ඒවා නෙල්ලි ගෙඩි ප්‍ර​මාණයටද, නෙල්ලි ගෙඩි ප්‍ර​මාණයේ ඒවා බෙලි සලාටු ප්‍ර​මාණයටද, බෙලි සලාටු ප්‍ර​මාණයේ ඒවා බෙලි ගෙඩි ප්‍ර​මාණයටද පත්ව, පැලී ගොස් සැරව හා ලේ ගලා යන්නට විය. විෂ ගිලගත් මාලුවෙකු මෙන්, හෙතෙම කෙසෙල් කොළ මත වැතිරී සිටියේය.\n\nඉන්පසු, තුරූ නම් පච්චේක බ්‍රහ්මයා කෝකාලික භික්ෂුව වෙත පැමිණ, අහසේ සිටගෙන කෝකාලික භික්ෂුවට මෙසේ කීවේය – \"කෝකාලික, සාරිපුත්ත මොග්ගල්ලාන දෙනම කෙරෙහි සිත පහදවා ගන්න. සාරිපුත්ත මොග්ගල්ලාන දෙනම ශ්‍ර​ේෂ්ඨ ගුණධර්මයන්ගෙන් යුත් උතුමන්ය.\" \"ඇවැත්නි, ඔබ කවුද?\" \"මම තුරූ නම් පච්චේක බ්‍රහ්මයා වෙමි.\" \"ඇවැත්නි, ඔබ භාග්‍ය​වතුන් වහන්සේ විසින් අනාගාමී තත්ත්වයට පත්වූවෙකු ලෙස ප්‍ර​කාශ කර තිබුණා නේද? එසේ නම් ඔබ කුමකටද මෙහි පැමිණියේ? බලන්න, ඔබට කෙතරම් වැරදීමක් සිදුවී ඇත්දැයි!\" එවිට තුරූ පච්චේක බ්‍රහ්මයා කෝකාලික භික්ෂුවට ගාථාවලින් මෙසේ පැවසීය – \"උපන් පුද්ගලයාගේ මුඛයෙහි පොරොවක් උපදී. ඒ පොරොවෙන් අඥානයා දුර්වචන කියමින් තමාම කපා ගනියි. යමෙක් නිදිය යුතු අයෙකු ප්‍ර​ශංසා කරන්නේද, නැතහොත් ප්‍ර​ශංසා කළ යුතු අයෙකුට නින්දා කරන්නේද, ඔහු තම මුඛයෙන් පාප කර්මයක් රැස් කර ගනී. ඒ පාප කර්මය නිසා ඔහුට කිසිදු සැපතක් නොලැබේ. දූ කෙළියේදී වස්තුව අහිමි වීමෙන් සිදුවන පාප කර්මය ඉතා සුළුය. එසේම සියලු ධනය, තමාද සමග අහිමි වීමෙන් සිදුවන පාප කර්මයට වඩා, සුගතයන් කෙරෙහි සිත දූෂ්‍ය කිරීම මහත් වූ පාප කර්මයකි. යමෙක් ආර්යයන්ට (සාරිපුත්ත මොග්ගල්ලාන වැනි උතුමන්ට) නින්දා කරන්නේද, පාපී වූ වචනයෙන් හා සිතින් ක්‍රියා​ කරමින්, ඔහු නිරබුද නිරයෙහි කල්ප ලක්ෂයකටත්, අබ්බුද නිරයෙහි කල්ප තිස් හයකටත්, තවද අබ්බුද කල්ප පහකටත් සමාන වූ කාලයක් නිරයට යන්නේය.\"\n\nඉන්පසු කෝකාලික භික්ෂුව එම ආබාධයෙන්ම මරණයට පත් විය. සාරිපුත්ත මොග්ගල්ලාන දෙනම කෙරෙහි වෛරී සිතක් ඇති කරගෙන මරණයට පත් වූ කෝකාලික භික්ෂුව පදුම නිරයෙහි උපන්නේය. එසමයෙහි සහම්පති බ්‍රහ්මයා, රාත්‍රිය බොහෝ සෙයින් ගෙවී ගිය පසු, ඉතාමත් දීප්තිමත් ශරීර වර්ණයකින් මුළු ජේතවනාරාමයම ආලෝකමත් කරමින්, භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍ය​වතුන් වහන්සේට වන්දනා කර එක් පසෙකින් සිට ගත්තේය. එක් පසෙකින් සිට ගත් සහම්පති බ්‍රහ්මයා භාග්‍ය​වතුන් වහන්සේට මෙසේ කීවේය – \"ස්වාමීනි, කෝකාලික භික්ෂුව මරණයට පත් විය. ස්වාමීනි, සාරිපුත්ත මොග්ගල්ලාන දෙනම කෙරෙහි වෛරී සිතක් ඇති කරගෙන මරණයට පත් වූ කෝකාලික භික්ෂුව පදුම නිරයෙහි උපන්නේය.\" සහම්පති බ්‍රහ්මයා මෙය කීවේය. මෙය පවසා භාග්‍ය​වතුන් වහන්සේට වන්දනා කර, පැදකුණු කොට එතැනම අතුරුදහන් විය.\n\nඉක්බිති භාග්‍ය​වතුන් වහන්සේ ඒ රාත්‍රිය අවසන් වූ පසු භික්ෂූන්ට මෙසේ ඇමතූ සේක – \"මහණෙනි, මේ රාත්‍රියේ සහම්පති බ්‍රහ්මයා, රාත්‍රිය බොහෝ සෙයින් ගෙවී ගිය පසු, ඉතාමත් දීප්තිමත් ශරීර වර්ණයකින් මුළු ජේතවනාරාමයම ආලෝකමත් කරමින්, මා වැඩසිටි තැනට පැමිණියේය. පැමිණ මට වන්දනා කර එක් පසෙකින් සිට ගත්තේය. මහණෙනි, එක් පසෙකින් සිට ගත් සහම්පති බ්‍රහ්මයා මට මෙසේ කීවේය – 'ස්වාමීනි, කෝකාලික භික්ෂුව මරණයට පත් විය. ස්වාමීනි, සාරිපුත්ත මොග්ගල්ලාන දෙනම කෙරෙහි වෛරී සිතක් ඇති කරගෙන මරණයට පත් වූ කෝකාලික භික්ෂුව පදුම නිරයෙහි උපන්නේය.' මහණෙනි, සහම්පති බ්‍රහ්මයා මෙය කීවේය. මෙය පවසා මට වන්දනා කර, පැදකුණු කොට එතැනම අතුරුදහන් විය.\"\n\nමෙසේ කී කල්හි එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවා: \"භාග්‍යවතුන් වහන්ස, පදුම නිරයේ ආයුෂ ප්‍රමාණය කොපමණ දීර්ඝද?\"\n\"මහණ, පදුම නිරයේ ආයුෂ ප්‍රමාණය දීර්ඝයි. ‘මෙපමණ වසරයි’ කියා හෝ ‘මෙපමණ වසර සියයයි’ කියා හෝ ‘මෙපමණ වසර දහසයි’ කියා හෝ ‘මෙපමණ වසර ලක්ෂයයි’ කියා හෝ එය ගණන් බැලීම පහසු නැහැ.\"\n\"එහෙත් භාග්‍යවතුන් වහන්ස, උපමාවක් ගෙනහැර දැක්විය හැකිද?\"\n\"මහණ, හැකි යි,\" භාග්‍යවතුන් වහන්සේ පැවසුවා. \"මහණ, යම්සේ විසිකුරුණක් (විසි පමුණක්) ඇති කොසොල් තල ගොඩක් තිබුණා යැයි සිතමු. එයින් එක් පුරුෂයෙක් වසර සියයක්, වසර සියයක් ගතවන විට එක් එක් තල ඇටයක් ඉවත් කරන්නේ නම්, මහණ, ඒ විසිකුරුණක් ඇති කොසොල් තල ගොඩ මේ උපාය මාර්ගයෙන් ඉක්මනින්ම ක්ෂය වී, අවසන් වී යාවි. එහෙත් එක අබ්බුද නිරයක් එසේ අවසන් වන්නේ නැහැ.\"\n\"මහණ, යම්සේ විසි අබ්බුද නිරයක් වේද, එලෙසින් එක නිරබ්බුද නිරයක් වේ.\"\n\"මහණ, යම්සේ විසි නිරබ්බුද නිරයක් වේද, එලෙසින් එක අබබ නිරයක් වේ.\"\n\"මහණ, යම්සේ විසි අබබ නිරයක් වේද, එලෙසින් එක අටට නිරයක් වේ.\"\n\"මහණ, යම්සේ විසි අටට නිරයක් වේද, එලෙසින් එක අහහ නිරයක් වේ.\"\n\"මහණ, යම්සේ විසි අහහ නිරයක් වේද, එලෙසින් එක කුමුද නිරයක් වේ.\"\n\"මහණ, යම්සේ විසි කුමුද නිරයක් වේද, එලෙසින් එක සෝගන්ධික නිරයක් වේ.\"\n\"මහණ, යම්සේ විසි සෝගන්ධික නිරයක් වේද, එලෙසින් එක උප්පලක නිරයක් වේ.\"\n\"මහණ, යම්සේ විසි උප්පලක නිරයක් වේද, එලෙසින් එක පුණ්ඩරීක නිරයක් වේ.\"\n\"මහණ, යම්සේ විසි පුණ්ඩරීක නිරයක් වේද, එලෙසින් එක පදුම නිරයක් වේ.\"\n\"මහණ, කෝකාලික භික්ෂුව ශාරීපුත්‍ර මෝග්ගල්ලාන ස්වාමීන් වහන්සේලා කෙරෙහි සිත ද්වේෂයෙන් දූෂණය කර, පදුම නම් වූ නිරයෙහි උපන්නා.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. මෙය වදාළ සුගත වූ ශාස්තෘන් වහන්සේ තව දුරටත් මෙසේ වදාළ සේක:\n\"උපන් පුරුෂයාගේ මුඛයෙහි පොරොවක් උපදී. බාලයා නපුරු වචන කියමින්, තමාම කපා ගන්නේ ඒ පොරොවෙනි.\"\n\"යමෙක් නින්දාවට සුදුසු දේට ප්‍රශංසා කරන්නේද, හෝ ප්‍රශංසාවට සුදුසු දේට නින්දා කරන්නේද, ඔහු තම මුඛයෙන් කලහයට හේතු සොයා ගනී. ඒ කලහය නිසා ඔහුට සැපතක් නොලැබේ.\"\n\"දූ කෙළියෙන් ධනය අහිමි වීම නිසා ඇති වන කලහය සුළු දෙයකි. සියල්ලම නැති වී, තමාද සමග විනාශ වූවත්, යමෙක් සුගතයන් වහන්සේලා කෙරෙහි සිත දූෂණය කරන්නේද, මේ කලහයම ඊට වඩා මහත් ය.\"\n\"නපුරු වචන හා සිත මෙහෙයවා, ආර්යයන්ට ගරහන තැනැත්තා ලක්ෂයක් නිරබ්බුද නිරයන්ටත්, තිස්හයක් සහ පසක් අබ්බුද නිරයන්ටත් සමාන වූ ආයුෂ ප්‍රමාණයක් ඇති නිරයට පැමිණේ.\"",
      "paliTitle": "Kokālikasuttaṃ",
      "englishTitle": "The Kokālika Discourse",
      "sinhalaTitle": "කෝකාලික සූත‍්‍රය"
    },
    {
      "number": 90,
      "pali": "Atha kho āyasmā sāriputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca – ‘‘kati nu kho, sāriputta, khīṇāsavassa bhikkhuno balāni, yehi balehi samannāgato khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti? ‘‘Dasa, bhante, khīṇāsavassa bhikkhuno balāni, yehi balehi samannāgato khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’ti. Katamāni dasa? [a. ni. 8.28; paṭi. ma. 2.44] Idha, bhante, khīṇāsavassa bhikkhuno aniccato sabbe saṅkhārā yathābhūtaṃ sammappaññāya sudiṭṭhā honti. Yampi, bhante, khīṇāsavassa bhikkhuno aniccato sabbe saṅkhārā yathābhūtaṃ sammappaññāya sudiṭṭhā honti, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’ti. ‘‘Puna caparaṃ, bhante, khīṇāsavassa bhikkhuno aṅgārakāsūpamā kāmā yathābhūtaṃ sammappaññāya sudiṭṭhā honti. Yampi, bhante, khīṇāsavassa bhikkhuno aṅgārakāsūpamā kāmā yathābhūtaṃ sammappaññāya sudiṭṭhā honti, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’ti. ‘‘Puna caparaṃ, bhante, khīṇāsavassa bhikkhuno vivekaninnaṃ cittaṃ hoti vivekapoṇaṃ vivekapabbhāraṃ vivekaṭṭhaṃ nekkhammābhirataṃ byantībhūtaṃ sabbaso āsavaṭṭhāniyehi dhammehi. Yampi, bhante, khīṇāsavassa bhikkhuno vivekaninnaṃ cittaṃ hoti vivekapoṇaṃ vivekapabbhāraṃ vivekaṭṭhaṃ nekkhammābhirataṃ byantībhūtaṃ sabbaso āsavaṭṭhāniyehi dhammehi, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’ti. ‘‘Puna caparaṃ, bhante, khīṇāsavassa bhikkhuno cattāro satipaṭṭhānā bhāvitā honti subhāvitā. Yampi, bhante, khīṇāsavassa bhikkhuno cattāro satipaṭṭhānā bhāvitā honti subhāvitā, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’ti. ‘‘Puna caparaṃ, bhante, khīṇāsavassa bhikkhuno cattāro sammappadhānā bhāvitā honti subhāvitā…pe… cattāro iddhipādā bhāvitā honti subhāvitā …pe… pañcindriyāni… pañca balāni bhāvitāni honti subhāvitāni… satta bojjhaṅgā bhāvitā honti subhāvitā… ariyo aṭṭhaṅgiko maggo bhāvito hoti subhāvito. Yampi, bhante, khīṇāsavassa bhikkhuno ariyo aṭṭhaṅgiko maggo bhāvito hoti subhāvito, idampi, bhante, khīṇāsavassa bhikkhuno balaṃ hoti, yaṃ balaṃ āgamma khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’ti. ‘‘Imāni kho, bhante, dasa khīṇāsavassa bhikkhuno balāni, yehi balehi samannāgato khīṇāsavo bhikkhu āsavānaṃ khayaṃ paṭijānāti – ‘khīṇā me āsavā’’’ti. Dasamaṃ. ",
      "english": "Then, the venerable Sāriputta approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side.\n\nAs the venerable Sāriputta was sitting to one side, the Blessed One spoke to him: \"How many strengths, Sāriputta, does an arahant monk possess, by which strengths endowed, the arahant monk declares the destruction of his taints, saying, 'My taints are destroyed'?\"\n\n\"Venerable sir, there are ten strengths that an arahant monk possesses, by which strengths endowed, the arahant monk declares the destruction of his taints, saying, 'My taints are destroyed.' Which are these ten? Here, venerable sir, all conditioned phenomena are well seen by an arahant monk as impermanent, in accordance with reality, with right wisdom. That, venerable sir, all conditioned phenomena are well seen by an arahant monk as impermanent, in accordance with reality, with right wisdom—this, too, venerable sir, is a strength for the arahant monk, by relying on which strength the arahant monk declares the destruction of his taints, saying, 'My taints are destroyed.'\"\n\n\"Furthermore, venerable sir, sense pleasures are well seen by an arahant monk as like a pit of glowing embers, in accordance with reality, with right wisdom. That, venerable sir, sense pleasures are well seen by an arahant monk as like a pit of glowing embers, in accordance with reality, with right wisdom—this, too, venerable sir, is a strength for the arahant monk, by relying on which strength the arahant monk declares the destruction of his taints, saying, 'My taints are destroyed.'\"\n\n\"Furthermore, venerable sir, an arahant monk's mind is inclined towards seclusion, tending towards seclusion, leaning towards seclusion, established in seclusion, delighting in renunciation, and has utterly dispelled all states that give rise to taints. That, venerable sir, an arahant monk's mind is inclined towards seclusion, tending towards seclusion, leaning towards seclusion, established in seclusion, delighting in renunciation, and has utterly dispelled all states that give rise to taints—this, too, venerable sir, is a strength for the arahant monk, by relying on which strength the arahant monk declares the destruction of his taints, saying, 'My taints are destroyed.'\"\n\n\"Furthermore, venerable sir, the four foundations of mindfulness are developed and well-developed by an arahant monk. The four right exertions are developed and well-developed. The four bases of spiritual power are developed and well-developed. The five spiritual faculties are developed and well-developed. The five strengths are developed and well-developed. The seven factors of awakening are developed and well-developed. The Noble Eightfold Path is developed and well-developed. That, venerable sir, the Noble Eightfold Path is developed and well-developed by an arahant monk—this, too, venerable sir, is a strength for the arahant monk, by relying on which strength the arahant monk declares the destruction of his taints, saying, 'My taints are destroyed.'\"\n\n\"These, venerable sir, are the ten strengths that an arahant monk possesses, by which strengths endowed, the arahant monk declares the destruction of his taints, saying, 'My taints are destroyed.'\"",
      "sinhala": "එසඳ, ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹුණ සේක. එළඹ, භාග්‍යවතුන් වහන්සේට ආදරයෙන් වන්දනා කොට එක්පසෙක වැඩහුන් සේක.\n\nඑක්පසෙක වැඩහුන් ආයුෂ්මත් ශාරිපුත්ත ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ශාරිපුත්තය, යම් බලයන්ගෙන් යුක්ත වූ ක්ෂීණාශ්‍රව භික්ෂුවක් ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද, ක්ෂීණාශ්‍රව භික්ෂුවට ඇති බලයන් කීයක්ද?”\n\n“ස්වාමීනි, යම් බලයන්ගෙන් යුක්ත වූ ක්ෂීණාශ්‍රව භික්ෂුවක් ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද, ක්ෂීණාශ්‍රව භික්ෂුවට බලයන් දසයකි. ඒ දසය කවරේද?\n\nස්වාමීනි, මේ ශාසනයෙහි ක්ෂීණාශ්‍රව භික්ෂුවට සියලු සංස්කාර ධර්ම අනිත්‍ය වශයෙන් යථාභූතවූ (ඇති සැටියෙන්) සම්මා ප්‍රඥාවෙන් මනාව දැක්කේ වෙති. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට සියලු සංස්කාර ධර්ම අනිත්‍ය වශයෙන් යථාභූතවූ සම්මා ප්‍රඥාවෙන් මනාව දැක්කේ වෙත්ද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට කම් සැප අඟුරු වලකට උපමා කොට යථාභූතවූ සම්මා ප්‍රඥාවෙන් මනාව දැක්කේ වෙති. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට කම් සැප අඟුරු වලකට උපමා කොට යථාභූතවූ සම්මා ප්‍රඥාවෙන් මනාව දැක්කේ වෙත්ද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට වෙන්වීමට නැඹුරු වූ, වෙන්වීමට බර වූ, වෙන්වීමට යොමු වූ, වෙන්වීමෙහි පිහිටි සිතක් ඇත. එය නික්ලේශී භාවයට (නෛෂ්ක්‍රම්‍යයට) ඇලුනේය. සියලු ආශ්‍රවයන්ට හේතුවන ධර්මයන්ගෙන් (ආශ්‍රවස්ථානීය ධර්මයන්ගෙන්) මුළුමනින්ම දුරුවූයේය. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට වෙන්වීමට නැඹුරු වූ, වෙන්වීමට බර වූ, වෙන්වීමට යොමු වූ, වෙන්වීමෙහි පිහිටි සිතක් වේද, එය නික්ලේශී භාවයට ඇලුනේය, සියලු ආශ්‍රවයන්ට හේතුවන ධර්මයන්ගෙන් මුළුමනින්ම දුරුවූයේය; ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට සිව් සතිපට්ඨානයන් වඩන ලද, මනාව වඩන ලද වෙත්. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට සිව් සතිපට්ඨානයන් වඩන ලද, මනාව වඩන ලද වෙත්ද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට සිව් සම්‍යක් ප්‍රධන් වඩන ලද, මනාව වඩන ලද වෙත්. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට සිව් සම්‍යක් ප්‍රධන් වඩන ලද, මනාව වඩන ලද වෙත්ද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට සිව් ඉර්ධිපාදයන් වඩන ලද, මනාව වඩන ලද වෙත්. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට සිව් ඉර්ධිපාදයන් වඩන ලද, මනාව වඩන ලද වෙත්ද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට පංච ඉන්ද්‍රියයන් (ශ්‍රද්ධා, වීර්ය, සති, සමාධි, ප්‍රඥා) වඩන ලද, මනාව වඩන ලද වෙත්. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට පංච ඉන්ද්‍රියයන් වඩන ලද, මනාව වඩන ලද වෙත්ද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට පංච බලයන් (ශ්‍රද්ධා, වීර්ය, සති, සමාධි, ප්‍රඥා) වඩන ලද, මනාව වඩන ලද වෙත්. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට පංච බලයන් වඩන ලද, මනාව වඩන ලද වෙත්ද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට සත් බෝධ්‍යංගයන් වඩන ලද, මනාව වඩන ලද වෙත්. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට සත් බෝධ්‍යංගයන් වඩන ලද, මනාව වඩන ලද වෙත්ද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\nතවද, ස්වාමීනි, ක්ෂීණාශ්‍රව භික්ෂුවට ආර්ය අෂ්ටාංගික මාර්ගය වඩන ලද, මනාව වඩන ලද වේ. ස්වාමීනි, යම් හෙයකින් ක්ෂීණාශ්‍රව භික්ෂුවට ආර්ය අෂ්ටාංගික මාර්ගය වඩන ලද, මනාව වඩන ලද වේද, ස්වාමීනි, මේද ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයක් වේ. යම් බලයක් නිසා ක්ෂීණාශ්‍රව භික්ෂුව ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද.\n\n“ස්වාමීනි, යම් බලයන්ගෙන් යුක්ත වූ ක්ෂීණාශ්‍රව භික්ෂුවක් ‘මගේ ආශ්‍රවයෝ ක්ෂය වූහ’ යි ආශ්‍රව ක්ෂය වූ බවට ප්‍රතිඥා කරන්නේද, මේ දසය ක්ෂීණාශ්‍රව භික්ෂුවගේ බලයන් වේ.”",
      "paliTitle": "Khīṇāsavabalasuttaṃ",
      "englishTitle": "The Discourse on Arahant's Powers",
      "sinhalaTitle": "ක‍්ෂීණාශ‍්‍රවබල සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Theravaggo catuttho. Tassuddānaṃ – Vāhanānando puṇṇiyo, byākaraṃ katthimāniko; Napiyakkosakokāli, khīṇāsavabalena cāti.",
    "english": "The Fourth Section on Elders",
    "sinhala": "සිවුවන ථෙරවග්‍ගය: එහි උද්‍දානය"
  }
}