{
  "id": "an10.11",
  "title": {
    "pali": "Samaṇasaññāvaggo",
    "english": "The Chapter on the Perception of an Ascetic",
    "sinhala": "සමණ සංඥා වග්ගය"
  },
  "sections": [
    {
      "number": 101,
      "pali": "‘‘Tisso imā, bhikkhave, samaṇasaññā bhāvitā bahulīkatā satta dhamme paripūrenti. Katamā tisso? Vevaṇṇiyamhi ajjhupagato, parapaṭibaddhā me jīvikā, añño me ākappo karaṇīyoti – imā kho, bhikkhave, tisso samaṇasaññā bhāvitā bahulīkatā satta dhamme paripūrenti. ‘‘Katame satta? Santatakārī [satatakārī (syā. pī. ka.)] hoti santatavutti [satatavutti (syā. pī.)] sīlesu, anabhijjhālu hoti, abyāpajjo hoti, anatimānī hoti, sikkhākāmo hoti, idamatthaṃtissa hoti jīvitaparikkhāresu, āraddhavīriyo ca [āraddhaviriyo ca (sī. pī.), āraddhaviriyo (syā.)] viharati. Imā kho, bhikkhave, tisso samaṇasaññā bhāvitā bahulīkatā ime satta dhamme paripūrentī’’ti. Paṭhamaṃ.",
      "english": "Bhikkhus, these three perceptions of a recluse, when developed and frequently practiced, perfect seven qualities. Which three? “I have entered a different way of life; my livelihood is dependent on others; a different demeanor is required of me” – these, bhikkhus, are the three perceptions of a recluse, which when developed and frequently practiced, perfect seven qualities. Which seven? One is constantly active and constantly conducts oneself in accordance with the precepts; one is not covetous; one is not malicious; one is not conceited; one is eager for training; one understands the purpose of the requisites for life; and one dwells with aroused energy. These, bhikkhus, are the three perceptions of a recluse, which when developed and frequently practiced, perfect these seven qualities.",
      "sinhala": "මහණෙනි, මේ ශ්‍රමණ සංඥාවන් තුනක් වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද කල්හි ධර්මයන් සතක් සම්පූර්ණ කරති. කවරක්ද ඒ තුන? \"මා වෙනස් වූ ස්වභාවයකට පැමිණ ඇතැයි,\" \"මාගේ ජීවිකාව අනුන් මත රඳා පවතී යැයි,\" \"මා විසින් කළ යුතු වෙනස් වූ පැවැත්මක් ඇතැයි\" – මහණෙනි, මේ ශ්‍රමණ සංඥාවන් තුන වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද කල්හි ධර්මයන් සතක් සම්පූර්ණ කරති. කවරක්ද ඒ සත? සීලයන්හි නිරතුරුව ක්‍රියා කරන්නෙක්ද වෙයි, නිරතුරුව හැසිරෙන්නෙක්ද වෙයි, අභිධ්‍යා නැත්තෙක්ද වෙයි, ව්‍යාපාද රහිතවූවෙක්ද වෙයි, අතිමානයෙන් තොරවූවෙක්ද වෙයි, සික්ඛාකාමීවූවෙක්ද වෙයි, ජීවිත පරිෂ්කාරයන්හිදී මෙයම අර්ථය කොට ඇත්තෙක්ද වෙයි, වීර්යය වඩා වාසය කරන්නෙක්ද වෙයි. මහණෙනි, මේ ශ්‍රමණ සංඥාවන් තුන වඩන ලද, බහුල වශයෙන් පුරුදු කරන ලද කල්හි මේ ධර්මයන් සත සම්පූර්ණ කෙරෙති.",
      "paliTitle": "Samaṇasaññāsuttaṃ"
    },
    {
      "number": 102,
      "pali": "‘‘Sattime, bhikkhave, bojjhaṅgā bhāvitā bahulīkatā tisso vijjā paripūrenti. Katame satta? Satisambojjhaṅgo, dhammavicayasambojjhaṅgo, vīriyasambojjhaṅgo, pītisambojjhaṅgo, passaddhisambojjhaṅgo, samādhisambojjhaṅgo, upekkhāsambojjhaṅgo – ime kho, bhikkhave, satta bojjhaṅgā bhāvitā bahulīkatā tisso vijjā paripūrenti. Katamā tisso? Idha, bhikkhave, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti. Āsavānaṃ khayā…pe… sacchikatvā upasampajja viharati. Ime kho, bhikkhave, satta bojjhaṅgā bhāvitā bahulīkatā imā tisso vijjā paripūrentī’’ti. Dutiyaṃ.",
      "english": "Monastics, these seven factors of awakening, when developed and frequently practiced, bring to fulfillment the three knowledges. Which seven? Mindfulness as a factor of awakening, investigation of phenomena as a factor of awakening, energy as a factor of awakening, rapture as a factor of awakening, tranquility as a factor of awakening, concentration as a factor of awakening, and equanimity as a factor of awakening. Indeed, monastics, these seven factors of awakening, when developed and frequently practiced, bring to fulfillment the three knowledges.\n\nWhich three? Here, monastics, a monastic recalls his manifold past existences, such as one birth, two births, three births, up to a hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, and many eons of cosmic contraction and expansion. Thus, he recalls his manifold past existences in their details and circumstances.\n\nWith the divine eye, purified and surpassing that of humans, he discerns beings passing away and reappearing—inferior and superior, beautiful and ugly, fortunate and unfortunate—and he understands how beings fare in accordance with their kamma.\n\nThrough the destruction of the taints, he realizes for himself, directly experiences, and abides in the taintless liberation of mind and liberation through wisdom, knowing: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\n\nIndeed, monastics, these seven factors of awakening, when developed and frequently practiced, bring to fulfillment these three knowledges.",
      "sinhala": "භික්ෂූනි, මේ සත් බොජ්ඣංගයෝ වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, තිදක් විද්‍යාවන් සම්පූර්ණ කෙරෙති. කවරහුද ඒ සත් දෙනා? සති සම්බොජ්ඣංගය, ධම්මවිචය සම්බොජ්ඣංගය, විරිය සම්බොජ්ඣංගය, පීති සම්බොජ්ඣංගය, පස්සද්ධි සම්බොජ්ඣංගය, සමාධි සම්බොජ්ඣංගය, උපේක්ඛා සම්බොජ්ඣංගය යන මේ සත් බොජ්ඣංගයෝ වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, තිදක් විද්‍යාවන් සම්පූර්ණ කෙරෙති.\n\nකවරහුද ඒ තිදෙනා? භික්ෂූනි, මෙහිලා භික්ෂුවක් බොහෝ අයුරින් පෙර විසූ කඳ පිළිවෙළ සිහි කෙරෙයි. එනම් – එක් ජාතියක්, දෙජාතියක්, තුන් ජාතියක්... මෙසේ ආකාර සහිතව, අරමුණු සහිතව බොහෝ අයුරින් පෙර විසූ කඳ පිළිවෙළ සිහි කෙරෙයි. පිරිසිදු වූ, මිනිස් ඇස ඉක්ම වූ දිවැසින්... කම්වූ පරිදි සත්වයින් හඳුනා ගනියි. ආශ්‍රවයන් ක්ෂය කිරීමෙන්... ප්‍රත්‍යක්ෂ කොට, දැන වසයි. භික්ෂූනි, මේ සත් බොජ්ඣංගයෝ වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව, මේ තිදක් විද්‍යාවන් සම්පූර්ණ කෙරෙති.",
      "paliTitle": "Bojjhaṅgasuttaṃ"
    },
    {
      "number": 103,
      "pali": "‘‘Micchattaṃ, bhikkhave, āgamma virādhanā hoti, no ārādhanā. Kathañca, bhikkhave, micchattaṃ āgamma virādhanā hoti, no ārādhanā? Micchādiṭṭhikassa, bhikkhave, micchāsaṅkappo pahoti, micchāsaṅkappassa micchāvācā pahoti, micchāvācassa micchākammanto pahoti, micchākammantassa micchāājīvo pahoti, micchāājīvassa micchāvāyāmo pahoti, micchāvāyāmassa micchāsati pahoti, micchāsatissa micchāsamādhi pahoti, micchāsamādhissa micchāñāṇaṃ pahoti, micchāñāṇissa [micchāñāṇassa (pī. ka.)] micchāvimutti pahoti. Evaṃ kho, bhikkhave, micchattaṃ āgamma virādhanā hoti, no ārādhanā. ‘‘Sammattaṃ, bhikkhave, āgamma ārādhanā hoti, no virādhanā. Kathañca, bhikkhave, sammattaṃ āgamma ārādhanā hoti, no virādhanā? Sammādiṭṭhikassa, bhikkhave, sammāsaṅkappo pahoti, sammāsaṅkappassa sammāvācā pahoti, sammāvācassa sammākammanto pahoti, sammākammantassa sammāājīvo pahoti, sammāājīvassa sammāvāyāmo pahoti, sammāvāyāmassa sammāsati pahoti, sammāsatissa sammāsamādhi pahoti, sammāsamādhissa sammāñāṇaṃ pahoti, sammāñāṇissa [sammāñāṇassa (pī. ka.)] sammāvimutti pahoti. Evaṃ kho, bhikkhave, sammattaṃ āgamma ārādhanā hoti, no virādhanā’’ti. Tatiyaṃ.",
      "english": "Monks, rooted in wrongness, there is a falling away from the goal, not its attainment. And how, monks, rooted in wrongness, is there a falling away from the goal, not its attainment? For one with wrong view, monks, wrong intention arises; from wrong intention, wrong speech arises; from wrong speech, wrong action arises; from wrong action, wrong livelihood arises; from wrong livelihood, wrong effort arises; from wrong effort, wrong mindfulness arises; from wrong mindfulness, wrong concentration arises; from wrong concentration, wrong knowledge arises; and from wrong knowledge, wrong liberation arises. Thus, monks, rooted in wrongness, there is a falling away from the goal, not its attainment.\n\nMonks, rooted in rightness, there is an attainment of the goal, not a falling away. And how, monks, rooted in rightness, is there an attainment of the goal, not a falling away? For one with right view, monks, right intention arises; from right intention, right speech arises; from right speech, right action arises; from right action, right livelihood arises; from right livelihood, right effort arises; from right effort, right mindfulness arises; from right mindfulness, right concentration arises; from right concentration, right knowledge arises; and from right knowledge, right liberation arises. Thus, monks, rooted in rightness, there is an attainment of the goal, not a falling away.",
      "sinhala": "භික්ෂූණි, වැරදි මාර්ගය (මිච්ඡත්තය) අරභයා, අසාර්ථක වීමක්ම වේ; සාර්ථක වීමක් නොවේ. භික්ෂූණි, වැරදි මාර්ගය අරභයා, අසාර්ථක වීමක්ම වන්නේත්, සාර්ථක වීමක් නොමවන්නේත් කෙසේද? භික්ෂූණි, වැරදි දැක්මක් ඇති පුද්ගලයාට වැරදි කල්පනාව (මිච්ඡාසංකප්පය) උපදී. වැරදි කල්පනාවෙන් වැරදි වචනය (මිච්ඡාවාචාව) උපදී. වැරදි වචනයෙන් වැරදි ක‍්‍රියාව (මිච්ඡාකම්මන්තය) උපදී. වැරදි ක‍්‍රියාවෙන් වැරදි ජීවනෝපාය (මිච්ඡාආජීවය) උපදී. වැරදි ජීවනෝපායෙන් වැරදි උත්සාහය (මිච්ඡාවායාමය) උපදී. වැරදි උත්සාහයෙන් වැරදි සිහිය (මිච්ඡාසතිය) උපදී. වැරදි සිහියෙන් වැරදි සමාධිය (මිච්ඡාසමාධිය) උපදී. වැරදි සමාධියෙන් වැරදි ඥානය (මිච්ඡාඤාණය) උපදී. වැරදි ඥානයෙන් වැරදි විමුක්තිය (මිච්ඡාවිමුක්තිය) උපදී. භික්ෂූණි, මෙසේ වැරදි මාර්ගය අරභයා, අසාර්ථක වීමක්ම වේ; සාර්ථක වීමක් නොවේ.\n\nභික්ෂූණි, නිවැරදි මාර්ගය (සම්මත්තය) අරභයා, සාර්ථක වීමක්ම වේ; අසාර්ථක වීමක් නොවේ. භික්ෂූණි, නිවැරදි මාර්ගය අරභයා, සාර්ථක වීමක්ම වන්නේත්, අසාර්ථක වීමක් නොමවන්නේත් කෙසේද? භික්ෂූණි, නිවැරදි දැක්මක් ඇති පුද්ගලයාට නිවැරදි කල්පනාව (සම්මාසංකප්පය) උපදී. නිවැරදි කල්පනාවෙන් නිවැරදි වචනය (සම්මාවාචාව) උපදී. නිවැරදි වචනයෙන් නිවැරදි ක‍්‍රියාව (සම්මාකම්මන්තය) උපදී. නිවැරදි ක‍්‍රියාවෙන් නිවැරදි ජීවනෝපාය (සම්මාආජීවය) උපදී. නිවැරදි ජීවනෝපායෙන් නිවැරදි උත්සාහය (සම්මාවායාමය) උපදී. නිවැරදි උත්සාහයෙන් නිවැරදි සිහිය (සම්මාසතිය) උපදී. නිවැරදි සිහියෙන් නිවැරදි සමාධිය (සම්මාසමාධිය) උපදී. නිවැරදි සමාධියෙන් නිවැරදි ඥානය (සම්මාඤාණය) උපදී. නිවැරදි ඥානයෙන් නිවැරදි විමුක්තිය (සම්මාවිමුක්තිය) උපදී. භික්ෂූණි, මෙසේ නිවැරදි මාර්ගය අරභයා, සාර්ථක වීමක්ම වේ; අසාර්ථක වීමක් නොවේ.",
      "paliTitle": "Micchattasuttaṃ"
    },
    {
      "number": 104,
      "pali": "[a. ni. 1.306; kathā. 708] ‘‘Micchādiṭṭhikassa, bhikkhave, purisapuggalassa micchāsaṅkappassa micchāvācassa micchākammantassa micchāājīvassa micchāvāyāmassa micchāsatissa micchāsamādhissa micchāñāṇissa micchāvimuttissa yañca kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ [samādiṇṇaṃ (pī. ka.)] yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā aniṭṭhāya akantāya amanāpāya ahitāya dukkhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa [diṭṭhi hi (sī. syā. pī.)], bhikkhave, pāpikā. ‘‘Seyyathāpi, bhikkhave, nimbabījaṃ vā kosātakibījaṃ vā tittakālābubījaṃ vā allāya pathaviyā nikkhittaṃ yañceva pathavirasaṃ upādiyati yañca āporasaṃ upādiyati, sabbaṃ taṃ tittakattāya kaṭukattāya asātattāya saṃvattati. Taṃ kissa hetu? Bījañhi, bhikkhave, pāpakaṃ. Evamevaṃ kho, bhikkhave, micchādiṭṭhikassa purisapuggalassa micchāsaṅkappassa micchāvācassa micchākammantassa micchāājīvassa micchāvāyāmassa micchāsatissa micchāsamādhissa micchāñāṇissa micchāvimuttissa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā aniṭṭhāya akantāya amanāpāya ahitāya dukkhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, pāpikā. ‘‘Sammādiṭṭhikassa, bhikkhave, purisapuggalassa sammāsaṅkappassa sammāvācassa sammākammantassa sammāājīvassa sammāvāyāmassa sammāsatissa sammāsamādhissa sammāñāṇissa sammāvimuttissa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, bhaddikā. ‘‘Seyyathāpi, bhikkhave, ucchubījaṃ vā sālibījaṃ vā muddikābījaṃ vā allāya pathaviyā nikkhittaṃ yañca pathavirasaṃ upādiyati yañca āporasaṃ upādiyati sabbaṃ taṃ sātattāya madhurattāya asecanakattāya saṃvattati. Taṃ kissa hetu? Bījañhi bhikkhave, bhaddakaṃ. Evamevaṃ kho, bhikkhave, sammādiṭṭhikassa…pe. … sammāvimuttissa yañceva kāyakammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yañca vacīkammaṃ… yañca manokammaṃ yathādiṭṭhi samattaṃ samādinnaṃ yā ca cetanā yā ca patthanā yo ca paṇidhi ye ca saṅkhārā, sabbe te dhammā iṭṭhāya kantāya manāpāya hitāya sukhāya saṃvattanti. Taṃ kissa hetu? Diṭṭhi hissa, bhikkhave, bhaddikā’’ti. Catutthaṃ.",
      "english": "Bhikkhus, for an individual with wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation—whatever bodily action is fully undertaken and completed in accordance with that view, whatever verbal action is fully undertaken and completed in accordance with that view, whatever mental action is fully undertaken and completed in accordance with that view, whatever volition, whatever aspiration, whatever determination, and whatever mental fabrications there may be—all these phenomena lead to the undesirable, the unpleasing, the disagreeable, to harm, and to suffering. For what reason? Because, bhikkhus, his view is evil.\n\nJust as, bhikkhus, a neem seed, or a bitter gourd seed, or a bitter calabash seed, when placed in moist soil, absorbs whatever essence of the earth and whatever essence of water, and all of that conduces to bitterness, acridity, and unpleasantness. For what reason? Because, bhikkhus, the seed is bad. Exactly in the same way, bhikkhus, for an individual with wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation—whatever bodily action is fully undertaken and completed in accordance with that view, whatever verbal action is fully undertaken and completed in accordance with that view, whatever mental action is fully undertaken and completed in accordance with that view, whatever volition, whatever aspiration, whatever determination, and whatever mental fabrications there may be—all these phenomena lead to the undesirable, the unpleasing, the disagreeable, to harm, and to suffering. For what reason? Because, bhikkhus, his view is evil.\n\nBhikkhus, for an individual with right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation—whatever bodily action is fully undertaken and completed in accordance with that view, whatever verbal action is fully undertaken and completed in accordance with that view, whatever mental action is fully undertaken and completed in accordance with that view, whatever volition, whatever aspiration, whatever determination, and whatever mental fabrications there may be—all these phenomena lead to the desirable, the pleasing, the agreeable, to benefit, and to happiness. For what reason? Because, bhikkhus, his view is excellent.\n\nJust as, bhikkhus, a sugarcane seed, or a rice seed, or a grape seed, when placed in moist soil, absorbs whatever essence of the earth and whatever essence of water, and all of that conduces to pleasantness, sweetness, and deliciousness. For what reason? Because, bhikkhus, the seed is good. Exactly in the same way, bhikkhus, for an individual with right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation—whatever bodily action is fully undertaken and completed in accordance with that view, whatever verbal action is fully undertaken and completed in accordance with that view, whatever mental action is fully undertaken and completed in accordance with that view, whatever volition, whatever aspiration, whatever determination, and whatever mental fabrications there may be—all these phenomena lead to the desirable, the pleasing, the agreeable, to benefit, and to happiness. For what reason? Because, bhikkhus, his view is excellent.",
      "sinhala": "මහණෙනි, මිත්‍ථ්‍යාදෘෂ්ටියෙන් යුත් පුරිසපුද්ගලයාගේ මිත්‍ථ්‍යාසංකල්පය, මිත්‍ථ්‍යාවාචාව, මිත්‍ථ්‍යාකර්මාන්තය, මිත්‍ථ්‍යාආජීවය, මිත්‍ථ්‍යාව්‍යායාමය, මිත්‍ථ්‍යාසතිය, මිත්‍ථ්‍යාසමාධිය, මිත්‍ථ්‍යාඥාණය, මිත්‍ථ්‍යාවිමුක්තිය යන මේවා ද, ඔහුගේ දෘෂ්ටියට අනුකූලව මනාව සම්පූර්ණ කර ගත්, මනාව පිළිගත් යම් කාය කර්මයක් වේ ද, යම් වචී කර්මයක් වේ ද, යම් මනෝ කර්මයක් වේ ද, යම් චේතනාවක් වේ ද, යම් ප්‍රාර්ථනාවක් වේ ද, යම් ප්‍රණිධියක් වේ ද, යම් සංස්කාර සමූහයක් වේ ද, ඒ සියලු ධර්මයන් අනිෂ්ටයට, අප්‍රියයට, අමනාපයට, අහිතට, දුකට හේතු වෙයි. එයට හේතුව කුමක්ද? මහණෙනි, ඔහුගේ දෘෂ්ටිය පාපී වූ බැවිනි.\n\nමහණෙනි, යම් සේ වේ නම්, කහට බීජයක් හෝ කොසටක බීජයක් හෝ තිත්ත ලබු බීජයක් හෝ තෙත් පසෙහි රෝපණය කළ විට, යම් පසෙහි රසයක් උරා ගනී ද, යම් ජලයේ රසයක් උරා ගනී ද, ඒ සියල්ල තිත්ත බවට, කටුක බවට, අසාත බවට පත් වෙයි. එයට හේතුව කුමක්ද? මහණෙනි, බීජය පාපී වූ බැවිනි. එපරිද්දෙන්ම මහණෙනි, මිත්‍ථ්‍යාදෘෂ්ටියෙන් යුත් පුරිසපුද්ගලයාගේ මිත්‍ථ්‍යාසංකල්පය, මිත්‍ථ්‍යාවාචාව, මිත්‍ථ්‍යාකර්මාන්තය, මිත්‍ථ්‍යාආජීවය, මිත්‍ථ්‍යාව්‍යායාමය, මිත්‍ථ්‍යාසතිය, මිත්‍ථ්‍යාසමාධිය, මිත්‍ථ්‍යාඥාණය, මිත්‍ථ්‍යාවිමුක්තිය යන මේවා ද, ඔහුගේ දෘෂ්ටියට අනුකූලව මනාව සම්පූර්ණ කර ගත්, මනාව පිළිගත් යම් කාය කර්මයක් වේ ද, යම් වචී කර්මයක් වේ ද, යම් මනෝ කර්මයක් වේ ද, යම් චේතනාවක් වේ ද, යම් ප්‍රාර්ථනාවක් වේ ද, යම් ප්‍රණිධියක් වේ ද, යම් සංස්කාර සමූහයක් වේ ද, ඒ සියලු ධර්මයන් අනිෂ්ටයට, අප්‍රියයට, අමනාපයට, අහිතට, දුකට හේතු වෙයි. එයට හේතුව කුමක්ද? මහණෙනි, ඔහුගේ දෘෂ්ටිය පාපී වූ බැවිනි.\n\nමහණෙනි, සම්මාදෘෂ්ටියෙන් යුත් පුරිසපුද්ගලයාගේ සම්මාසංකල්පය, සම්මාවාචාව, සම්මාකර්මාන්තය, සම්මාආජීවය, සම්මාව්‍යායාමය, සම්මාසතිය, සම්මාසමාධිය, සම්මාඥාණය, සම්මාවිමුක්තිය යන මේවා ද, ඔහුගේ දෘෂ්ටියට අනුකූලව මනාව සම්පූර්ණ කර ගත්, මනාව පිළිගත් යම් කාය කර්මයක් වේ ද, යම් වචී කර්මයක් වේ ද, යම් මනෝ කර්මයක් වේ ද, යම් චේතනාවක් වේ ද, යම් ප්‍රාර්ථනාවක් වේ ද, යම් ප්‍රණිධියක් වේ ද, යම් සංස්කාර සමූහයක් වේ ද, ඒ සියලු ධර්මයන් ඉෂ්ටයට, ප්‍රියයට, මනාපයට, හිතට, සුවයට හේතු වෙයි. එයට හේතුව කුමක්ද? මහණෙනි, ඔහුගේ දෘෂ්ටිය භද්‍ර වූ බැවිනි.\n\nමහණෙනි, යම් සේ වේ නම්, උක් බීජයක් හෝ සාලි වී බීජයක් හෝ මුද්දිකා බීජයක් හෝ තෙත් පසෙහි රෝපණය කළ විට, යම් පසෙහි රසයක් උරා ගනී ද, යම් ජලයේ රසයක් උරා ගනී ද, ඒ සියල්ල සාත බවට, මධුර බවට, අනෙක් කිසිවක් නොයොදාම රසවත් බවට පත් වෙයි. එයට හේතුව කුමක්ද? මහණෙනි, බීජය භද්‍ර වූ බැවිනි. එපරිද්දෙන්ම මහණෙනි, සම්මාදෘෂ්ටියෙන් යුත් පුරිසපුද්ගලයාගේ සම්මාසංකල්පය, සම්මාවාචාව, සම්මාකර්මාන්තය, සම්මාආජීවය, සම්මාව්‍යායාමය, සම්මාසතිය, සම්මාසමාධිය, සම්මාඥාණය, සම්මාවිමුක්තිය යන මේවා ද, ඔහුගේ දෘෂ්ටියට අනුකූලව මනාව සම්පූර්ණ කර ගත්, මනාව පිළිගත් යම් කාය කර්මයක් වේ ද, යම් වචී කර්මයක් වේ ද, යම් මනෝ කර්මයක් වේ ද, යම් චේතනාවක් වේ ද, යම් ප්‍රාර්ථනාවක් වේ ද, යම් ප්‍රණිධියක් වේ ද, යම් සංස්කාර සමූහයක් වේ ද, ඒ සියලු ධර්මයන් ඉෂ්ටයට, ප්‍රියයට, මනාපයට, හිතට, සුවයට හේතු වෙයි. එයට හේතුව කුමක්ද? මහණෙනි, ඔහුගේ දෘෂ්ටිය භද්‍ර වූ බැවිනි.",
      "paliTitle": "Bījasuttaṃ"
    },
    {
      "number": 105,
      "pali": "‘‘Avijjā, bhikkhave, pubbaṅgamā akusalānaṃ dhammānaṃ samāpattiyā, anvadeva ahirikaṃ anottappaṃ. Avijjāgatassa, bhikkhave, aviddasuno micchādiṭṭhi pahoti, micchādiṭṭhikassa micchāsaṅkappo pahoti, micchāsaṅkappassa micchāvācā pahoti, micchāvācassa micchākammanto pahoti, micchākammantassa micchāājīvo pahoti, micchāājīvassa micchāvāyāmo pahoti, micchāvāyāmassa micchāsati pahoti, micchāsatissa micchāsamādhi pahoti, micchāsamādhissa micchāñāṇaṃ pahoti, micchāñāṇissa micchāvimutti pahoti. ‘‘Vijjā, bhikkhave, pubbaṅgamā kusalānaṃ dhammānaṃ samāpattiyā, anvadeva hirottappaṃ. Vijjāgatassa, bhikkhave, viddasuno sammādiṭṭhi pahoti, sammādiṭṭhikassa sammāsaṅkappo pahoti, sammāsaṅkappassa sammāvācā pahoti, sammāvācassa sammākammanto pahoti, sammākammantassa sammāājīvo pahoti, sammāājīvassa sammāvāyāmo pahoti, sammāvāyāmassa sammāsati pahoti, sammāsatissa sammāsamādhi pahoti, sammāsamādhissa sammāñāṇaṃ pahoti, sammāñāṇissa sammāvimutti pahotī’’ti. Pañcamaṃ.",
      "english": "Ignorance, monks, is the forerunner for the acquisition of unwholesome states, immediately followed by shamelessness and lack of moral dread. For one immersed in ignorance, monks, for one who lacks understanding, wrong view arises. For one with wrong view, wrong intention arises. For one with wrong intention, wrong speech arises. For one with wrong speech, wrong conduct arises. For one with wrong conduct, wrong livelihood arises. For one with wrong livelihood, wrong effort arises. For one with wrong effort, wrong mindfulness arises. For one with wrong mindfulness, wrong concentration arises. For one with wrong concentration, wrong knowledge arises. For one with wrong knowledge, wrong liberation arises.\n\nTrue knowledge, monks, is the forerunner for the acquisition of wholesome states, immediately followed by shame and moral dread. For one immersed in true knowledge, monks, for one who understands, right view arises. For one with right view, right intention arises. For one with right intention, right speech arises. For one with right speech, right conduct arises. For one with right conduct, right livelihood arises. For one with right livelihood, right effort arises. For one with right effort, right mindfulness arises. For one with right mindfulness, right concentration arises. For one with right concentration, right knowledge arises. For one with right knowledge, right liberation arises.",
      "sinhala": "භික්‍ෂූනි, අකුසල ධර්මයන් ඇතිවීමට අවිද්‍යාව ප්‍රමුඛ කොට ගත්තක් වේ. පව්කිරීමට නොලැජ්ජාව සහ පව්කිරීමට බිය නොවීම එයට අනුවම ඇතිවේ. භික්‍ෂූනි, අවිද්‍යාවට ගොදුරු වූ, නුවණක් නැති පුද්ගලයාට මිථ්‍යාදෘෂ්ටිය හටගනී. මිථ්‍යාදෘෂ්ටිය ඇති පුද්ගලයාට මිථ්‍යාසංකල්පය හටගනී. මිථ්‍යාසංකල්පය ඇති පුද්ගලයාට මිථ්‍යාවාචාව හටගනී. මිථ්‍යාවාචාව ඇති පුද්ගලයාට මිථ්‍යාකර්මාන්තය හටගනී. මිථ්‍යාකර්මාන්තය ඇති පුද්ගලයාට මිථ්‍යාආජීවය හටගනී. මිථ්‍යාආජීවය ඇති පුද්ගලයාට මිථ්‍යාවායාමය හටගනී. මිථ්‍යාවායාමය ඇති පුද්ගලයාට මිථ්‍යාසතිය හටගනී. මිථ්‍යාසතිය ඇති පුද්ගලයාට මිථ්‍යාසමාධිය හටගනී. මිථ්‍යාසමාධිය ඇති පුද්ගලයාට මිථ්‍යාඥානය හටගනී. මිථ්‍යාඥානය ඇති පුද්ගලයාට මිථ්‍යාවිමුක්තිය හටගනී.\n\nභික්‍ෂූනි, කුසල ධර්මයන් ඇතිවීමට විද්‍යාව ප්‍රමුඛ කොට ගත්තක් වේ. පව්කිරීමට ලැජ්ජාව සහ පව්කිරීමට බියවීම එයට අනුවම ඇතිවේ. භික්‍ෂූනි, විද්‍යාවට ගොදුරු වූ, නුවණැති පුද්ගලයාට සම්මාදෘෂ්ටිය හටගනී. සම්මාදෘෂ්ටිය ඇති පුද්ගලයාට සම්මාසංකල්පය හටගනී. සම්මාසංකල්පය ඇති පුද්ගලයාට සම්මාවාචාව හටගනී. සම්මාවාචාව ඇති පුද්ගලයාට සම්මාකර්මාන්තය හටගනී. සම්මාකර්මාන්තය ඇති පුද්ගලයාට සම්මාආජීවය හටගනී. සම්මාආජීවය ඇති පුද්ගලයාට සම්මාවායාමය හටගනී. සම්මාවායාමය ඇති පුද්ගලයාට සම්මාසතිය හටගනී. සම්මාසතිය ඇති පුද්ගලයාට සම්මාසමාධිය හටගනී. සම්මාසමාධිය ඇති පුද්ගලයාට සම්මාඥානය හටගනී. සම්මාඥානය ඇති පුද්ගලයාට සම්මාවිමුක්තිය හටගනී.",
      "paliTitle": "Vijjāsuttaṃ"
    },
    {
      "number": 106,
      "pali": "[dī. ni. 3.360] ‘‘Dasayimāni, bhikkhave, nijjaravatthūni. Katamāni dasa? Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi nijjiṇṇā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo nijjiṇṇo hoti; ye ca micchāsaṅkappapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāsaṅkappapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāvācassa, bhikkhave, micchāvācā nijjiṇṇā hoti; ye ca micchāvācāpaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāvācāpaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammākammantassa, bhikkhave, micchākammanto nijjiṇṇo hoti; ye ca micchākammantapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammākammantapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāājīvassa, bhikkhave, micchāājīvo nijjiṇṇo hoti; ye ca micchāājīvapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāājīvapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāvāyāmassa, bhikkhave, micchāvāyāmo nijjiṇṇo hoti; ye ca micchāvāyāmapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāvāyāmapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāsatissa, bhikkhave, micchāsati nijjiṇṇā hoti; ye ca micchāsatipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāsatipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāsamādhissa, bhikkhave, micchāsamādhi nijjiṇṇo hoti; ye ca micchāsamādhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāsamādhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāñāṇissa, bhikkhave, micchāñāṇaṃ nijjiṇṇaṃ hoti; ye ca micchāñāṇapaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāñāṇapaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāvimuttissa, bhikkhave, micchāvimutti nijjiṇṇā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa nijjiṇṇā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Imāni kho, bhikkhave, dasa nijjaravatthūnī’’ti. Chaṭṭhaṃ.",
      "english": "Bhikkhus, there are these ten factors for eradication. Which ten?\n\nFor one possessing Right View, bhikkhus, Wrong View is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong View are also eradicated for him. And numerous wholesome states, conditioned by Right View, reach the culmination of their development.\n\nFor one possessing Right Intention, bhikkhus, Wrong Intention is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Intention are also eradicated for him. And numerous wholesome states, conditioned by Right Intention, reach the culmination of their development.\n\nFor one possessing Right Speech, bhikkhus, Wrong Speech is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Speech are also eradicated for him. And numerous wholesome states, conditioned by Right Speech, reach the culmination of their development.\n\nFor one possessing Right Action, bhikkhus, Wrong Action is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Action are also eradicated for him. And numerous wholesome states, conditioned by Right Action, reach the culmination of their development.\n\nFor one possessing Right Livelihood, bhikkhus, Wrong Livelihood is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Livelihood are also eradicated for him. And numerous wholesome states, conditioned by Right Livelihood, reach the culmination of their development.\n\nFor one possessing Right Effort, bhikkhus, Wrong Effort is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Effort are also eradicated for him. And numerous wholesome states, conditioned by Right Effort, reach the culmination of their development.\n\nFor one possessing Right Mindfulness, bhikkhus, Wrong Mindfulness is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Mindfulness are also eradicated for him. And numerous wholesome states, conditioned by Right Mindfulness, reach the culmination of their development.\n\nFor one possessing Right Concentration, bhikkhus, Wrong Concentration is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Concentration are also eradicated for him. And numerous wholesome states, conditioned by Right Concentration, reach the culmination of their development.\n\nFor one possessing Right Knowledge, bhikkhus, Wrong Knowledge is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Knowledge are also eradicated for him. And numerous wholesome states, conditioned by Right Knowledge, reach the culmination of their development.\n\nFor one possessing Right Liberation, bhikkhus, Wrong Liberation is eradicated. And those numerous evil, unwholesome states that arise conditioned by Wrong Liberation are also eradicated for him. And numerous wholesome states, conditioned by Right Liberation, reach the culmination of their development.\n\nThese, bhikkhus, are the ten factors for eradication.",
      "sinhala": "භික්ෂූණි, මේ දස නිජ්ජරාවස්තූන් ය. ඒ කවර දසයෙක් ද?\n\nභික්ෂූණි, යමෙකුට සම්මාදිට්ඨි ඇත්තේ ද, ඔහුට මිච්ඡාදිට්ඨිය ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාදිට්ඨිය හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාදිට්ඨිය හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාසංකල්ප ඇත්තේ ද, ඔහුට මිච්ඡාසංකල්පය ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාසංකල්පය හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාසංකල්පය හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාවාචා ඇත්තේ ද, ඔහුට මිච්ඡාවාචා ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාවාචා හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාවාචා හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාකම්මන්ත ඇත්තේ ද, ඔහුට මිච්ඡාකම්මන්ත ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාකම්මන්තය හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාකම්මන්තය හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාආජීව ඇත්තේ ද, ඔහුට මිච්ඡාආජීව ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාආජීව හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාආජීව හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාවායාම ඇත්තේ ද, ඔහුට මිච්ඡාවායාම ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාවායාම හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාවායාම හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාසති ඇත්තේ ද, ඔහුට මිච්ඡාසති ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාසති හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාසති හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාසමාධි ඇත්තේ ද, ඔහුට මිච්ඡාසමාධි ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාසමාධි හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාසමාධි හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාඤාණ ඇත්තේ ද, ඔහුට මිච්ඡාඤාණ ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාඤාණ හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාඤාණ හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, යමෙකුට සම්මාවිමුක්ති ඇත්තේ ද, ඔහුට මිච්ඡාවිමුක්ති ප්‍රහීණ වේ. යම් පාපී අකුසල ධර්මයන් මිච්ඡාවිමුක්ති හේතුවෙන් හටගනිත් ද, ඒවා ද ඔහුට ප්‍රහීණ වේ. සම්මාවිමුක්ති හේතුවෙන් ද බොහෝ කුසල ධර්මයෝ භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, මේ දස නිජ්ජරාවස්තූන් ය.",
      "paliTitle": "Nijjarasuttaṃ"
    },
    {
      "number": 107,
      "pali": "‘‘Atthi, bhikkhave, dakkhiṇesu janapadesu dhovanaṃ nāma. Tattha hoti annampi pānampi khajjampi bhojjampi leyyampi peyyampi naccampi gītampi vāditampi. Atthetaṃ, bhikkhave, dhovanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, dhovanaṃ hīnaṃ gammaṃ pothujjanikaṃ anariyaṃ anatthasaṃhitaṃ na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati. ‘‘Ahañca kho, bhikkhave, ariyaṃ dhovanaṃ desessāmi, yaṃ dhovanaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamañca taṃ, bhikkhave, ariyaṃ dhovanaṃ, (yaṃ dhovanaṃ) [( ) natthi syāmapotthake] ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti? ‘‘Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi niddhotā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhotā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo niddhoto hoti…pe… sammāvācassa, bhikkhave, micchāvācā niddhotā hoti… sammākammantassa, bhikkhave, micchākammanto niddhoto hoti… sammāājīvassa, bhikkhave, micchāājīvo niddhoto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo niddhoto hoti… sammāsatissa, bhikkhave, micchāsati niddhotā hoti… sammāsamādhissa, bhikkhave, micchāsamādhi niddhoto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ niddhotaṃ hoti…pe…. ‘‘Sammāvimuttissa, bhikkhave, micchāvimutti niddhotā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhotā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Idaṃ kho taṃ, bhikkhave, ariyaṃ dhovanaṃ ekantanibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati, yaṃ dhovanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccantī’’ti. Sattamaṃ.",
      "english": "Monks, in the southern lands, there is something called a washing. There, there is food, drink, hard food, soft food, licked food, drunk food, dancing, singing, and instrumental music. Indeed, monks, there is such a washing; I do not say it does not exist. But this washing, monks, is inferior, vulgar, belonging to the common folk, ignoble, not conducive to benefit, not leading to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, or Nibbāna.\n\nBut I, monks, will teach the noble washing, which leads exclusively to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, and Nibbāna; by relying on which beings subject to birth are freed from birth; beings subject to old age are freed from old age; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, dejection, and despair are freed from sorrow, lamentation, pain, dejection, and despair. Listen to it, pay close attention; I will speak. “Yes, venerable sir,” those monks replied to the Blessed One. The Blessed One then said this:\n\nAnd what, monks, is that noble washing which leads exclusively to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, and Nibbāna; by relying on which beings subject to birth are freed from birth; beings subject to old age are freed from old age; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, dejection, and despair are freed from sorrow, lamentation, pain, dejection, and despair?\n\nFor one with Right View, monks, Wrong View is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong View are also washed away for him; and many wholesome qualities, conditioned by Right View, come to fulfillment through development.\n\nFor one with Right Intention, monks, Wrong Intention is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Intention are also washed away for him; and many wholesome qualities, conditioned by Right Intention, come to fulfillment through development. For one with Right Speech, monks, Wrong Speech is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Speech are also washed away for him; and many wholesome qualities, conditioned by Right Speech, come to fulfillment through development. For one with Right Action, monks, Wrong Action is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Action are also washed away for him; and many wholesome qualities, conditioned by Right Action, come to fulfillment through development. For one with Right Livelihood, monks, Wrong Livelihood is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Livelihood are also washed away for him; and many wholesome qualities, conditioned by Right Livelihood, come to fulfillment through development. For one with Right Effort, monks, Wrong Effort is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Effort are also washed away for him; and many wholesome qualities, conditioned by Right Effort, come to fulfillment through development. For one with Right Mindfulness, monks, Wrong Mindfulness is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Mindfulness are also washed away for him; and many wholesome qualities, conditioned by Right Mindfulness, come to fulfillment through development. For one with Right Concentration, monks, Wrong Concentration is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Concentration are also washed away for him; and many wholesome qualities, conditioned by Right Concentration, come to fulfillment through development. For one with Right Knowledge, monks, Wrong Knowledge is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Knowledge are also washed away for him; and many wholesome qualities, conditioned by Right Knowledge, come to fulfillment through development.\n\nFor one with Right Liberation, monks, Wrong Liberation is washed away; and the many evil, unwholesome qualities that arise conditioned by Wrong Liberation are also washed away for him; and many wholesome qualities, conditioned by Right Liberation, come to fulfillment through development. This, monks, is that noble washing which leads exclusively to disenchantment, dispassion, cessation, tranquility, direct knowledge, full awakening, and Nibbāna; by relying on which beings subject to birth are freed from birth; beings subject to old age are freed from old age; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, dejection, and despair are freed from sorrow, lamentation, pain, dejection, and despair.",
      "sinhala": "භික්ෂූණි, දකුණු ජනපදවල ‘දෝවනය’ කියා දෙයක් ඇත. එහි අනුභව කළ හැකි දේත්, පානය කළ හැකි දේත්, කෑමට ගත හැකි දේත්, භෝජනයට ගත හැකි දේත්, ලෙව කෑමට ගත හැකි දේත්, පානය කළ හැකි දේත්, නැටුම්ද, ගැයුම්ද, වැයුම්ද වෙයි. භික්ෂූණි, ඒ දෝවනය ඇත. ‘ඒ නැතැ’යි මම නොකියමි. එහෙත්, භික්ෂූණි, ඒ දෝවනය හීනයි, ග්‍රාම්‍යයි, පෘථග්ජනයන්ට සුදුසුයි, අනාර්යයි, අනර්ථ පිණිස පවතින්නකි. එය කලකිරීමට (නිබ්බිදාවට), නොඇලීමට (විරාගයට), නිරෝධයට (සංසිඳීමට), උපශාන්තියට (උපසමය), විශේෂ ඥානයට (අභිඥාවට), සම්බෝධියට (පූර්ණ අවබෝධයට) හෝ නිවනට (නිර්වාණයට) හේතු නොවෙයි. භික්ෂූණි, එහෙත් මම, ඒකාන්තයෙන් කලකිරීමට (නිබ්බිදාවට), නොඇලීමට (විරාගයට), නිරෝධයට (සංසිඳීමට), උපශාන්තියට (උපසමය), විශේෂ ඥානයට (අභිඥාවට), සම්බෝධියට (පූර්ණ අවබෝධයට) සහ නිවනට (නිර්වාණයට) හේතු වන ආර්ය දෝවනය දේශනා කරන්නෙමි. යම් දෝවනයක් කරණකොට ගෙන ජාති ස්වභාවය ඇති සත්වයෝ ජාතියෙන් මිදෙත්ද, ජරා ස්වභාවය ඇති සත්වයෝ ජරාවෙන් මිදෙත්ද, මරණ ස්වභාවය ඇති සත්වයෝ මරණයෙන් මිදෙත්ද, ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස ස්වභාවය ඇති සත්වයෝ ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාසයන්ගෙන් මිදෙත්ද. එය අසව්, හොඳින් මෙනෙහි කරව්. මම එය දේශනා කරන්නෙමි.\n\n“එසේය, භාග්‍යවතුන් වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“භික්ෂූණි, ඒ කුමක්ද ආර්ය දෝවනය, යම් දෝවනයක් ඒකාන්තයෙන් කලකිරීමට (නිබ්බිදාවට), නොඇලීමට (විරාගයට), නිරෝධයට (සංසිඳීමට), උපශාන්තියට (උපසමය), විශේෂ ඥානයට (අභිඥාවට), සම්බෝධියට (පූර්ණ අවබෝධයට) සහ නිවනට (නිර්වාණයට) හේතු වෙයිද, යම් දෝවනයක් කරණකොට ගෙන ජාති ස්වභාවය ඇති සත්වයෝ ජාතියෙන් මිදෙත්ද, ජරා ස්වභාවය ඇති සත්වයෝ ජරාවෙන් මිදෙත්ද, මරණ ස්වභාවය ඇති සත්වයෝ මරණයෙන් මිදෙත්ද, ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස ස්වභාවය ඇති සත්වයෝ ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාසයන්ගෙන් මිදෙත්ද?\n\n“භික්ෂූණි, සම්මා දිට්ඨිය ඇති පුද්ගලයාගේ මිථ්‍යා දෘෂ්ටිය සෝදා හැරී ඇත. යම් මිථ්‍යා දෘෂ්ටිය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා දිට්ඨිය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා සංකල්පය ඇති පුද්ගලයාගේ මිථ්‍යා සංකල්පය සෝදා හැරී ඇත. යම් මිථ්‍යා සංකල්පය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා සංකල්පය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා වාචාව ඇති පුද්ගලයාගේ මිථ්‍යා වාචාව සෝදා හැරී ඇත. යම් මිථ්‍යා වාචාව හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා වාචාව හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා කර්මාන්තය ඇති පුද්ගලයාගේ මිථ්‍යා කර්මාන්තය සෝදා හැරී ඇත. යම් මිථ්‍යා කර්මාන්තය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා කර්මාන්තය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා ආජීවය ඇති පුද්ගලයාගේ මිථ්‍යා ආජීවය සෝදා හැරී ඇත. යම් මිථ්‍යා ආජීවය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා ආජීවය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා ව්‍යායාමය ඇති පුද්ගලයාගේ මිථ්‍යා ව්‍යායාමය සෝදා හැරී ඇත. යම් මිථ්‍යා ව්‍යායාමය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා ව්‍යායාමය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා සතිය ඇති පුද්ගලයාගේ මිථ්‍යා සතිය සෝදා හැරී ඇත. යම් මිථ්‍යා සතිය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා සතිය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා සමාධිය ඇති පුද්ගලයාගේ මිථ්‍යා සමාධිය සෝදා හැරී ඇත. යම් මිථ්‍යා සමාධිය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා සමාධිය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා ඥානය ඇති පුද්ගලයාගේ මිථ්‍යා ඥානය සෝදා හැරී ඇත. යම් මිථ්‍යා ඥානය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා ඥානය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, සම්මා විමුක්තිය ඇති පුද්ගලයාගේ මිථ්‍යා විමුක්තිය සෝදා හැරී ඇත. යම් මිථ්‍යා විමුක්තිය හේතුවෙන් බොහෝ පව්කාර අකුසල ධර්මයන් හටගනීද, ඒවාද ඔහු කෙරෙන් සෝදා හැරී ඇත. සම්මා විමුක්තිය හේතුවෙන් බොහෝ කුසල ධර්මයන් භාවනා පාරිපූරණයට පත්වෙයි. භික්ෂූණි, ඒකාන්තයෙන් කලකිරීමට (නිබ්බිදාවට), නොඇලීමට (විරාගයට), නිරෝධයට (සංසිඳීමට), උපශාන්තියට (උපසමය), විශේෂ ඥානයට (අභිඥාවට), සම්බෝධියට (පූර්ණ අවබෝධයට) සහ නිවනට (නිර්වාණයට) හේතු වන, යම් දෝවනයක් කරණකොට ගෙන ජාති ස්වභාවය ඇති සත්වයෝ ජාතියෙන් මිදෙත්ද, ජරා ස්වභාවය ඇති සත්වයෝ ජරාවෙන් මිදෙත්ද, මරණ ස්වභාවය ඇති සත්වයෝ මරණයෙන් මිදෙත්ද, ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාස ස්වභාවය ඇති සත්වයෝ ශෝක, පරිදේව, දුක්, දොම්නස්, උපායාසයන්ගෙන් මිදෙත්ද, ඒ ආර්ය දෝවනය මෙයයි.",
      "paliTitle": "Dhovanasuttaṃ"
    },
    {
      "number": 108,
      "pali": "‘‘Tikicchakā, bhikkhave, virecanaṃ denti pittasamuṭṭhānānampi ābādhānaṃ paṭighātāya, semhasamuṭṭhānānampi ābādhānaṃ paṭighātāya, vātasamuṭṭhānānampi ābādhānaṃ paṭighātāya. Atthetaṃ, bhikkhave, virecanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, virecanaṃ sampajjatipi vipajjatipi. ‘‘Ahañca kho, bhikkhave, ariyaṃ virecanaṃ desessāmi, yaṃ virecanaṃ sampajjatiyeva no vipajjati, yaṃ virecanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamañca taṃ, bhikkhave, ariyaṃ virecanaṃ, yaṃ virecanaṃ sampajjatiyeva no vipajjati, yaṃ virecanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti? ‘‘Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi virittā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa virittā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo viritto hoti…pe… sammāvācassa, bhikkhave, micchāvācā virittā hoti… sammākammantassa, bhikkhave, micchākammanto viritto hoti… sammāājīvassa, bhikkhave, micchāājīvo viritto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo viritto hoti… sammāsatissa, bhikkhave, micchāsati virittā hoti… sammāsamādhissa, bhikkhave, micchāsamādhi viritto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ virittaṃ hoti…pe…. ‘‘Sammāvimuttissa, bhikkhave, micchāvimutti virittā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa virittā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Idaṃ kho taṃ, bhikkhave, ariyaṃ virecanaṃ yaṃ virecanaṃ sampajjatiyeva no vipajjati, yaṃ virecanaṃ āgamma jātidhammā sattā jātiyā parimuccanti…pe… sokaparidevadukkhadomanassupāyāsehi parimuccantī’’ti. Aṭṭhamaṃ.",
      "english": "Monks, physicians administer purgatives to counteract diseases arising from bile, to counteract diseases arising from phlegm, and to counteract diseases arising from wind. Monks, such a purgative exists; I do not say it does not exist. However, Monks, such a purgative sometimes succeeds and sometimes fails.\n\nBut Monks, I will teach the noble purgative, which always succeeds and never fails, by resorting to which, beings subject to birth are liberated from birth, beings subject to aging are liberated from aging, beings subject to death are liberated from death, and beings subject to sorrow, lamentation, pain, distress, and despair are liberated from sorrow, lamentation, pain, distress, and despair. Listen to that, attend carefully; I will speak.\n\n\"Yes, venerable sir,\" those monks replied to the Blessed One. The Blessed One said this: \"And what, Monks, is that noble purgative which always succeeds and never fails, by resorting to which, beings subject to birth are liberated from birth, beings subject to aging are liberated from aging, beings subject to death are liberated from death, and beings subject to sorrow, lamentation, pain, distress, and despair are liberated from sorrow, lamentation, pain, distress, and despair?\n\nFor one with Right View, Monks, Wrong View is purged; and those many evil, unwholesome states that arise conditioned by Wrong View are also purged for him; and many wholesome states conditioned by Right View reach full development through cultivation.\n\nFor one with Right Intention, Monks, Wrong Intention is purged; and those many evil, unwholesome states that arise conditioned by Wrong Intention are also purged for him; and many wholesome states conditioned by Right Intention reach full development through cultivation. For one with Right Speech, Monks, Wrong Speech is purged; and those many evil, unwholesome states that arise conditioned by Wrong Speech are also purged for him; and many wholesome states conditioned by Right Speech reach full development through cultivation. For one with Right Action, Monks, Wrong Action is purged; and those many evil, unwholesome states that arise conditioned by Wrong Action are also purged for him; and many wholesome states conditioned by Right Action reach full development through cultivation. For one with Right Livelihood, Monks, Wrong Livelihood is purged; and those many evil, unwholesome states that arise conditioned by Wrong Livelihood are also purged for him; and many wholesome states conditioned by Right Livelihood reach full development through cultivation. For one with Right Effort, Monks, Wrong Effort is purged; and those many evil, unwholesome states that arise conditioned by Wrong Effort are also purged for him; and many wholesome states conditioned by Right Effort reach full development through cultivation. For one with Right Mindfulness, Monks, Wrong Mindfulness is purged; and those many evil, unwholesome states that arise conditioned by Wrong Mindfulness are also purged for him; and many wholesome states conditioned by Right Mindfulness reach full development through cultivation. For one with Right Concentration, Monks, Wrong Concentration is purged; and those many evil, unwholesome states that arise conditioned by Wrong Concentration are also purged for him; and many wholesome states conditioned by Right Concentration reach full development through cultivation. For one with Right Knowledge, Monks, Wrong Knowledge is purged; and those many evil, unwholesome states that arise conditioned by Wrong Knowledge are also purged for him; and many wholesome states conditioned by Right Knowledge reach full development through cultivation.\n\nFor one with Right Liberation, Monks, Wrong Liberation is purged; and those many evil, unwholesome states that arise conditioned by Wrong Liberation are also purged for him; and many wholesome states conditioned by Right Liberation reach full development through cultivation. This, Monks, is that noble purgative which always succeeds and never fails, by resorting to which, beings subject to birth are liberated from birth, beings subject to aging are liberated from aging, beings subject to death are liberated from death, and beings subject to sorrow, lamentation, pain, distress, and despair are liberated from sorrow, lamentation, pain, distress, and despair.",
      "sinhala": "මහණෙනි, වෛද්‍යවරු පිත් සමු‍ට්ඨාන වූ ආබාධයන් නැති කිරීමටත්, සෙම් සමු‍ට්ඨාන වූ ආබාධයන් නැති කිරීමටත්, වාත සමු‍ට්ඨාන වූ ආබාධයන් නැති කිරීමටත් විරේක ඖෂධ දෙති. මහණෙනි, එබඳු විරේක ඖෂධයක් ඇත; එය නැතැයි මම නොකියමි. එහෙත් මහණෙනි, ඒ විරේක ඖෂධය ඇතැම් විට සාර්ථක වෙයි, ඇතැම් විට අසාර්ථක වෙයි.\n\nමහණෙනි, මම ආර්ය විරේකයක් දේශනා කරන්නෙමි. යම් විරේකයක් සාර්ථකම වන්නේ මිස අසාර්ථක නොවන්නේද, යම් විරේකයක් නිසා ජාති ස්වභාවය ඇති සත්වයෝ ජාතියෙන් මුදෙත්ද, ජරා ස්වභාවය ඇති සත්වයෝ ජරාවෙන් මුදෙත්ද, මරණ ස්වභාවය ඇති සත්වයෝ මරණයෙන් මුදෙත්ද, ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස ස්වභාවය ඇති සත්වයෝ ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාසයන්ගෙන් මුදෙත්ද, එය අසන්න, මැනවින් මෙනෙහි කරව්, මම දේශනා කරන්නෙමි. \"එසේය, භාග්‍යවතුන් වහන්ස\" යැයි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළසේක –\n\nමහණෙනි, සාර්ථකම වන්නේ මිස අසාර්ථක නොවන, යම් විරේකයක් නිසා ජාති ස්වභාවය ඇති සත්වයෝ ජාතියෙන් මුදෙත්ද, ජරා ස්වභාවය ඇති සත්වයෝ ජරාවෙන් මුදෙත්ද, මරණ ස්වභාවය ඇති සත්වයෝ මරණයෙන් මුදෙත්ද, ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස ස්වභාවය ඇති සත්වයෝ ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාසයන්ගෙන් මුදෙත්ද, ඒ ආර්ය විරේකය කවරේද?\n\nමහණෙනි, සම්මා දිට්ඨිකයාහට මිත්‍යා දෘෂ්ටිය විරේචනය වී ඇත. යම් මිත්‍යා දෘෂ්ටිය හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා දෘෂ්ටිය හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා සංකල්ප ඇත්තාහට මිත්‍යා සංකල්ප විරේචනය වී ඇත. යම් මිත්‍යා සංකල්ප හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා සංකල්ප හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා වාචා ඇත්තාහට මිත්‍යා වාචා විරේචනය වී ඇත. යම් මිත්‍යා වාචා හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා වාචා හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා කම්මන්ත ඇත්තාහට මිත්‍යා කම්මන්ත විරේචනය වී ඇත. යම් මිත්‍යා කම්මන්ත හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා කම්මන්ත හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා ආජීව ඇත්තාහට මිත්‍යා ආජීව විරේචනය වී ඇත. යම් මිත්‍යා ආජීව හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා ආජීව හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා වායාම ඇත්තාහට මිත්‍යා වායාම විරේචනය වී ඇත. යම් මිත්‍යා වායාම හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා වායාම හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා සති ඇත්තාහට මිත්‍යා සති විරේචනය වී ඇත. යම් මිත්‍යා සති හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා සති හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා සමාධි ඇත්තාහට මිත්‍යා සමාධි විරේචනය වී ඇත. යම් මිත්‍යා සමාධි හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා සමාධි හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා ඥාන ඇත්තාහට මිත්‍යා ඥාන විරේචනය වී ඇත. යම් මිත්‍යා ඥාන හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා ඥාන හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සම්මා විමුක්ති ඇත්තාහට මිත්‍යා විමුක්ති විරේචනය වී ඇත. යම් මිත්‍යා විමුක්ති හේතු කොට ගෙන බොහෝ පාපී අකුසල ධර්ම හටගන්නේද, ඒවාද ඔහුට විරේචනය වී ඇත. සම්මා විමුක්ති හේතු කොට ගෙන බොහෝ කුසල ධර්ම භාවනා පාරිපූරියට පැමිණෙත්.\n\nමහණෙනි, සාර්ථකම වන්නේ මිස අසාර්ථක නොවන, යම් විරේකයක් නිසා ජාති ස්වභාවය ඇති සත්වයෝ ජාතියෙන් මුදෙත්ද, ජරා ස්වභාවය ඇති සත්වයෝ ජරාවෙන් මුදෙත්ද, මරණ ස්වභාවය ඇති සත්වයෝ මරණයෙන් මුදෙත්ද, ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස ස්වභාවය ඇති සත්වයෝ ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාසයන්ගෙන් මුදෙත්ද, ඒ ආර්ය විරේකය මෙයයි.",
      "paliTitle": "Tikicchakasuttaṃ"
    },
    {
      "number": 109,
      "pali": "‘‘Tikicchakā, bhikkhave, vamanaṃ denti pittasamuṭṭhānānampi ābādhānaṃ paṭighātāya, semhasamuṭṭhānānampi ābādhānaṃ paṭighātāya, vātasamuṭṭhānānampi ābādhānaṃ paṭighātāya. Atthetaṃ, bhikkhave, vamanaṃ; ‘netaṃ natthī’ti vadāmi. Tañca kho etaṃ, bhikkhave, vamanaṃ sampajjatipi vipajjatipi. ‘‘Ahañca kho, bhikkhave, ariyaṃ vamanaṃ desessāmi, yaṃ vamanaṃ sampajjatiyeva no vipajjati, yaṃ vamanaṃ āgamma jātidhammā sattā jātiyā parimuccanti, jarādhammā sattā jarāya parimuccanti, maraṇadhammā sattā maraṇena parimuccanti, sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti. Taṃ suṇātha…pe…. ‘‘Katamañca taṃ, bhikkhave, ariyaṃ vamanaṃ, yaṃ vamanaṃ sampajjatiyeva no vipajjati, yaṃ vamanaṃ āgamma jātidhammā sattā jātiyā parimuccanti…pe… sokaparidevadukkhadomanassupāyāsadhammā sattā sokaparidevadukkhadomanassupāyāsehi parimuccanti? ‘‘Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi vantā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa vantā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo vanto hoti…pe… sammāvācassa, bhikkhave, micchāvācā vantā hoti… sammākammantassa, bhikkhave, micchākammanto vanto hoti… sammāājīvassa bhikkhave, micchāājīvo vanto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo vanto hoti… sammāsatissa, bhikkhave, micchāsati vantā hoti… sammāsamādhissa, bhikkhave, micchāsamādhi vanto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ vantaṃ hoti …pe…. ‘‘Sammāvimuttissa, bhikkhave, micchāvimutti vantā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa vantā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Idaṃ kho taṃ, bhikkhave, ariyaṃ vamanaṃ yaṃ vamanaṃ sampajjatiyeva no vipajjati, yaṃ vamanaṃ āgamma jātidhammā sattā jātiyā parimuccanti…pe… sokaparidevadukkhadomanassupāyāsehi parimuccantī’’ti. Navamaṃ.",
      "english": "Monks, physicians give emetics to counteract ailments arising from bile, to counteract ailments arising from phlegm, and to counteract ailments arising from wind. That emetic, Monks, exists; I say that it is not non-existent. However, Monks, that emetic sometimes succeeds and sometimes fails.\n\nBut I, Monks, shall teach a noble expulsion, an expulsion that always succeeds and never fails. By virtue of this expulsion, beings subject to birth are freed from birth; beings subject to aging are freed from aging; beings subject to death are freed from death; beings subject to sorrow, lamentation, pain, displeasure, and despair are freed from sorrow, lamentation, pain, displeasure, and despair. Listen to that.\n\nAnd what, Monks, is that noble expulsion, an expulsion that always succeeds and never fails? By virtue of this expulsion, beings subject to birth are freed from birth; beings subject to aging are freed from aging; beings subject to death are freed from death; and beings subject to sorrow, lamentation, pain, displeasure, and despair are freed from sorrow, lamentation, pain, displeasure, and despair?\n\nFor one possessing Right View, Monks, wrong view is cast out. And the many evil, unwholesome states that arise conditioned by wrong view are also cast out for him. And many wholesome states, conditioned by Right View, reach the culmination of development.\n\nFor one possessing Right Intention, Monks, wrong intention is cast out. And the many evil, unwholesome states that arise conditioned by wrong intention are also cast out for him. And many wholesome states, conditioned by Right Intention, reach the culmination of development.\n\nFor one possessing Right Speech, Monks, wrong speech is cast out. And the many evil, unwholesome states that arise conditioned by wrong speech are also cast out for him. And many wholesome states, conditioned by Right Speech, reach the culmination of development.\n\nFor one possessing Right Action, Monks, wrong action is cast out. And the many evil, unwholesome states that arise conditioned by wrong action are also cast out for him. And many wholesome states, conditioned by Right Action, reach the culmination of development.\n\nFor one possessing Right Livelihood, Monks, wrong livelihood is cast out. And the many evil, unwholesome states that arise conditioned by wrong livelihood are also cast out for him. And many wholesome states, conditioned by Right Livelihood, reach the culmination of development.\n\nFor one possessing Right Effort, Monks, wrong effort is cast out. And the many evil, unwholesome states that arise conditioned by wrong effort are also cast out for him. And many wholesome states, conditioned by Right Effort, reach the culmination of development.\n\nFor one possessing Right Mindfulness, Monks, wrong mindfulness is cast out. And the many evil, unwholesome states that arise conditioned by wrong mindfulness are also cast out for him. And many wholesome states, conditioned by Right Mindfulness, reach the culmination of development.\n\nFor one possessing Right Concentration, Monks, wrong concentration is cast out. And the many evil, unwholesome states that arise conditioned by wrong concentration are also cast out for him. And many wholesome states, conditioned by Right Concentration, reach the culmination of development.\n\nFor one possessing Right Knowledge, Monks, wrong knowledge is cast out. And the many evil, unwholesome states that arise conditioned by wrong knowledge are also cast out for him. And many wholesome states, conditioned by Right Knowledge, reach the culmination of development.\n\nFor one possessing Right Liberation, Monks, wrong liberation is cast out. And the many evil, unwholesome states that arise conditioned by wrong liberation are also cast out for him. And many wholesome states, conditioned by Right Liberation, reach the culmination of development.\n\nThis, Monks, is that noble expulsion, an expulsion that always succeeds and never fails. By virtue of this expulsion, beings subject to birth are freed from birth; beings subject to aging are freed from aging; beings subject to death are freed from death; and beings subject to sorrow, lamentation, pain, displeasure, and despair are freed from sorrow, lamentation, pain, displeasure, and despair.",
      "sinhala": "භික්ෂූණි, වෛද්‍යවරු පිත් අගුලුවලින් හටගන්නා ආබාධයන් නසන පිණිසත්, සෙම් අගුලුවලින් හටගන්නා ආබාධයන් නසන පිණිසත්, වා අගුලුවලින් හටගන්නා ආබාධයන් නසන පිණිසත් වමනය දෙති. භික්ෂූණි, මේ වමනය ඇත්තේමය; ‘මේ වමනය නැතැයි’ මම නොකියමි. එහෙත් භික්ෂූණි, මේ වමනය ඇතැම් විට සාර්ථක වේ, ඇතැම් විට අසාර්ථක වේ.\n\nඑහෙත් භික්ෂූණි, මම ආර්ය වමනයක් දේශනා කරන්නෙමි. ඒ වමනය සාර්ථක වන්නේමය, අසාර්ථක නොවන්නේමය. ඒ වමනය හේතුකොටගෙන ඉපදීමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ ඉපදීමෙන් මිදෙත්. දිරායාමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ දිරායාමෙන් මිදෙත්. මැරීමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ මරණයෙන් මිදෙත්. ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස යන ස්වභාවය ඇති සත්#zwj;ත්වයෝ ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස යන ධර්මයන්ගෙන් මිදෙත්. ඒ ධර්මය අසවු.\n\nභික්ෂූණි, සාර්ථක වන්නේමය, අසාර්ථක නොවන්නේමය වූ ඒ ආර්ය වමනය කුමක්ද? ඒ වමනය හේතුකොටගෙන ඉපදීමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ ඉපදීමෙන් මිදෙත් ද, දිරායාමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ දිරායාමෙන් මිදෙත් ද, මැරීමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ මරණයෙන් මිදෙත් ද, ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස යන ස්වභාවය ඇති සත්#zwj;ත්වයෝ ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස යන ධර්මයන්ගෙන් මිදෙත් ද?\n\nභික්ෂූණි, සම්මා දිට්#zwj;ඨිය ඇති අයට මිත්‍#zwj;යා දිට්#zwj;ඨිය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා දිට්#zwj;ඨිය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා දිට්#zwj;ඨිය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා සංකල්පය ඇති අයට මිත්‍#zwj;යා සංකල්පය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා සංකල්පය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා සංකල්පය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා වාචාව ඇති අයට මිත්‍#zwj;යා වාචාව වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා වාචාව මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා වාචාව මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා කම්මන්තය ඇති අයට මිත්‍#zwj;යා කම්මන්තය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා කම්මන්තය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා කම්මන්තය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා ආජීවය ඇති අයට මිත්‍#zwj;යා ආජීවය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා ආජීවය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා ආජීවය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා වායාමය ඇති අයට මිත්‍#zwj;යා වායාමය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා වායාමය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා වායාමය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා සතිය ඇති අයට මිත්‍#zwj;යා සතිය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා සතිය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා සතිය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා සමාධිය ඇති අයට මිත්‍#zwj;යා සමාධිය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා සමාධිය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා සමාධිය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා ඤාණය ඇති අයට මිත්‍#zwj;යා ඤාණය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා ඤාණය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා ඤාණය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්.\n\nභික්ෂූණි, සම්මා විමුක්#zwj;තිය ඇති අයට මිත්‍#zwj;යා විමුක්#zwj;තිය වමනය කර දමා ඇත. යම් මිත්‍#zwj;යා විමුක්#zwj;තිය මුල් කරගෙන බොහෝ අකුසල ධර්ම හටගනී ද, ඒවා ද ඔහු විසින් වමනය කර දමා ඇත. සම්මා විමුක්#zwj;තිය මුල් කරගෙන බොහෝ කුසල ධර්ම භාවනාවෙන් පිරිපුන් බවට පැමිණෙත්. භික්ෂූණි, සාර්ථක වන්නේමය, අසාර්ථක නොවන්නේමය වූ ඒ ආර්ය වමනය මෙයයි. ඒ වමනය හේතුකොටගෙන ඉපදීමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ ඉපදීමෙන් මිදෙත්; දිරායාමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ දිරායාමෙන් මිදෙත්; මැරීමේ ස්වභාවය ඇති සත්#zwj;ත්වයෝ මරණයෙන් මිදෙත්; ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස යන ස්වභාවය ඇති සත්#zwj;ත්වයෝ ශෝක, වැළපීම්, දුක්, දොම්නස්, උපායාස යන ධර්මයන්ගෙන් මිදෙත්.",
      "paliTitle": "Vamanasuttaṃ"
    },
    {
      "number": 110,
      "pali": "‘‘Dasayime, bhikkhave, niddhamanīyā dhammā. Katame dasa? Sammādiṭṭhikassa, bhikkhave, micchādiṭṭhi niddhantā hoti; ye ca micchādiṭṭhipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhantā honti; sammādiṭṭhipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. ‘‘Sammāsaṅkappassa, bhikkhave, micchāsaṅkappo niddhanto hoti…pe… sammāvācassa bhikkhave, micchāvācā niddhantā hoti… sammākammantassa, bhikkhave, micchākammanto niddhanto hoti… sammāājīvassa, bhikkhave, micchāājīvo niddhanto hoti… sammāvāyāmassa, bhikkhave, micchāvāyāmo niddhanto hoti… sammāsatissa, bhikkhave, micchāsati niddhantā hoti… sammāsamādhissa, bhikkhave, micchāsamādhi niddhanto hoti… sammāñāṇissa, bhikkhave, micchāñāṇaṃ niddhantaṃ hoti…. ‘‘Sammāvimuttissa, bhikkhave, micchāvimutti niddhantā hoti; ye ca micchāvimuttipaccayā aneke pāpakā akusalā dhammā sambhavanti te cassa niddhantā honti; sammāvimuttipaccayā ca aneke kusalā dhammā bhāvanāpāripūriṃ gacchanti. Ime kho, bhikkhave, dasa niddhamanīyā dhammā’’ti. Dasamaṃ.",
      "english": "Monks, these are the ten states to be banished. Which ten?\n\nFor one with Right View, monks, Wrong View is banished; and numerous evil, unwholesome states that arise conditioned by Wrong View are also banished for him; and numerous wholesome states conditioned by Right View reach the full completion of development. For one with Right Intention, monks, Wrong Intention is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Intention are also banished for him; and numerous wholesome states conditioned by Right Intention reach the full completion of development. For one with Right Speech, monks, Wrong Speech is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Speech are also banished for him; and numerous wholesome states conditioned by Right Speech reach the full completion of development. For one with Right Action, monks, Wrong Action is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Action are also banished for him; and numerous wholesome states conditioned by Right Action reach the full completion of development. For one with Right Livelihood, monks, Wrong Livelihood is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Livelihood are also banished for him; and numerous wholesome states conditioned by Right Livelihood reach the full completion of development. For one with Right Effort, monks, Wrong Effort is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Effort are also banished for him; and numerous wholesome states conditioned by Right Effort reach the full completion of development. For one with Right Mindfulness, monks, Wrong Mindfulness is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Mindfulness are also banished for him; and numerous wholesome states conditioned by Right Mindfulness reach the full completion of development. For one with Right Concentration, monks, Wrong Concentration is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Concentration are also banished for him; and numerous wholesome states conditioned by Right Concentration reach the full completion of development. For one with Right Knowledge, monks, Wrong Knowledge is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Knowledge are also banished for him; and numerous wholesome states conditioned by Right Knowledge reach the full completion of development. For one with Right Liberation, monks, Wrong Liberation is banished; and numerous evil, unwholesome states that arise conditioned by Wrong Liberation are also banished for him; and numerous wholesome states conditioned by Right Liberation reach the full completion of development.\n\nThese, monks, are the ten states to be banished.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ දුරුකළ යුතු ධර්ම දහයයි. ඒ දහය කවරේද?\n\nභික්ෂූන් වහන්ස, සම්මාදිට්ඨිය ඇති අයට මිච්ඡාදිට්ඨිය දුරු වී යයි. යම් ඒ මිච්ඡාදිට්ඨිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාදිට්ඨිය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාසංකප්පය ඇති අයට මිච්ඡාසංකප්පය දුරු වී යයි. යම් ඒ මිච්ඡාසංකප්පය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාසංකප්පය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාවාචාව ඇති අයට මිච්ඡාවාචාව දුරු වී යයි. යම් ඒ මිච්ඡාවාචාව හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාවාචාව හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාකම්මන්තය ඇති අයට මිච්ඡාකම්මන්තය දුරු වී යයි. යම් ඒ මිච්ඡාකම්මන්තය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාකම්මන්තය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාආජීවය ඇති අයට මිච්ඡාආජීවය දුරු වී යයි. යම් ඒ මිච්ඡාආජීවය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාආජීවය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාවායාමය ඇති අයට මිච්ඡාවායාමය දුරු වී යයි. යම් ඒ මිච්ඡාවායාමය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාවායාමය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාසතිය ඇති අයට මිච්ඡාසතිය දුරු වී යයි. යම් ඒ මිච්ඡාසතිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාසතිය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාසමාධිය ඇති අයට මිච්ඡාසමාධිය දුරු වී යයි. යම් ඒ මිච්ඡාසමාධිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාසමාධිය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාඥානය ඇති අයට මිච්ඡාඥානය දුරු වී යයි. යම් ඒ මිච්ඡාඥානය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාඥානය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, සම්මාවිමුක්තිය ඇති අයට මිච්ඡාවිමුක්තිය දුරු වී යයි. යම් ඒ මිච්ඡාවිමුක්තිය හේතු කොටගෙන බොහෝ පාපී අකුසල ධර්මයන් හටගනී ද, ඒ ධර්මයන් ද ඔහුගෙන් දුරු වී යයි. සම්මාවිමුක්තිය හේතු කොටගෙන බොහෝ කුසල ධර්මයන් වඩනු ලැබ සම්පූර්ණත්වයට පත්වේ.\n\nභික්ෂූන් වහන්ස, මේ දුරුකළ යුතු ධර්ම දහයයි.",
      "paliTitle": "Niddhamanīyasuttaṃ"
    },
    {
      "number": 111,
      "pali": "Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘‘Asekho asekho’ti, bhante, vuccati. Kittāvatā bhante, bhikkhu asekho hotī’’ti? ‘‘Idha, bhikkhu, bhikkhu asekhāya sammādiṭṭhiyā samannāgato hoti, asekhena sammāsaṅkappena samannāgato hoti, asekhāya sammāvācāya samannāgato hoti, asekhena sammākammantena samannāgato hoti, asekhena sammāājīvena samannāgato hoti, asekhena sammāvāyāmena samannāgato hoti, asekhāya sammāsatiyā samannāgato hoti, asekhena sammāsamādhinā samannāgato hoti, asekhena sammāñāṇena samannāgato hoti, asekhāya sammāvimuttiyā samannāgato hoti. Evaṃ kho, bhikkhu, bhikkhu asekho hotī’’ti. Ekādasamaṃ.",
      "english": "Then a certain bhikkhu approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Sitting to one side, that bhikkhu said to the Blessed One, “It is said, Venerable Sir, ‘one beyond training, one beyond training.’ To what extent, Venerable Sir, is a bhikkhu one beyond training?”\n\n“Here, bhikkhu, a bhikkhu is endowed with consummate right view, with consummate right intention, with consummate right speech, with consummate right action, with consummate right livelihood, with consummate right effort, with consummate right mindfulness, with consummate right concentration, with consummate right knowledge, and with consummate right liberation. It is in this way, bhikkhu, that a bhikkhu is one beyond training.”",
      "sinhala": "එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීන් වහන්ස, 'අසේඛ, අසේඛ' යැයි කියනු ලැබේ. ස්වාමීන් වහන්ස, කවර කරුණකින් භික්ෂුවක් අසේඛ නම් වේද?\"\n\"මෙහි, භික්ෂුව, භික්ෂුව අසේඛ සම්‍යක් දෘෂ්ටියෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් සංකල්පයෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් වචනයෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් කර්මාන්තයෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් ආජීවයෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් ව්‍යායාමයෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් ස්මෘතියෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් සමාධියෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් ඤාණයෙන් සමන්වාගතව සිටී. අසේඛ සම්‍යක් විමුත්තියෙන් සමන්වාගතව සිටී. භික්ෂුව, මෙලෙස භික්ෂුව අසේඛ වේ.\"",
      "paliTitle": "Paṭhamaasekhasuttaṃ"
    },
    {
      "number": 112,
      "pali": "‘‘Dasayime, bhikkhave, asekhiyā dhammā. Katame dasa? Asekhā sammādiṭṭhi, asekho sammāsaṅkappo, asekhā sammāvācā, asekho sammākammanto, asekho sammāājīvo, asekho sammāvāyāmo, asekhā sammāsati, asekho sammāsamādhi, asekhaṃ sammāñāṇaṃ, asekhā sammāvimutti – ime kho, bhikkhave, dasa asekhiyā dhammā’’ti. Dvādasamaṃ. ",
      "english": "Monks, these are the ten unexcelled qualities. Which ten? Unexcelled Right View, unexcelled Right Intention, unexcelled Right Speech, unexcelled Right Action, unexcelled Right Livelihood, unexcelled Right Effort, unexcelled Right Mindfulness, unexcelled Right Concentration, unexcelled Right Knowledge, unexcelled Right Liberation — these, monks, are the ten unexcelled qualities.",
      "sinhala": "මහණෙනි, මේ අසේඛ්‍‍ය ධර්ම දහයයි. කවරේද ඒ දසය? අසේඛ්‍‍ය සම්මාදිට්ඨි, අසේඛ්‍‍ය සම්මාසංකප්ප, අසේඛ්‍‍ය සම්මාවාචා, අසේඛ්‍‍ය සම්මාකම්මන්ත, අසේඛ්‍‍ය සම්මාආජීව, අසේඛ්‍‍ය සම්මාවායාම, අසේඛ්‍‍ය සම්මාසති, අසේඛ්‍‍ය සම්මාසමාධි, අසේඛ්‍‍ය සම්මාඤාණ, අසේඛ්‍‍ය සම්මාවිමුක්ති – මහණෙනි, මේවා අසේඛ්‍‍ය ධර්ම දහයයි.",
      "paliTitle": "Dutiyaasekhasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Samaṇasaññāvaggo paṭhamo. Tassuddānaṃ – Saññā bojjhaṅgā micchattaṃ, bījaṃ vijjāya nijjaraṃ; Dhovanaṃ tikicchā vamanaṃ niddhamanaṃ dve asekhāti.",
    "english": "",
    "sinhala": ""
  }
}