{
  "id": "an10.18",
  "title": {
    "pali": "Sādhuvaggo",
    "english": "The Chapter on the Virtuous",
    "sinhala": "උතුම් වර්ගය"
  },
  "sections": [
    {
      "number": 178,
      "pali": "[a. ni. 10.134] ‘‘Sādhuñca vo, bhikkhave, desessāmi asādhuñca. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamañca, bhikkhave, asādhu? Pāṇātipāto, adinnādānaṃ, kāmesumicchācāro, musāvādo, pisuṇā vācā, pharusā vācā, samphappalāpo, abhijjhā, byāpādo, micchādiṭṭhi – idaṃ vuccati, bhikkhave, asādhu. ‘‘Katamañca, bhikkhave, sādhu? Pāṇātipātā veramaṇī, adinnādānā veramaṇī, kāmesumicchācārā veramaṇī, musāvādā veramaṇī, pisuṇāya vācāya veramaṇī, pharusāya vācāya veramaṇī, samphappalāpā veramaṇī, anabhijjhā, abyāpādo, sammādiṭṭhi – idaṃ vuccati, bhikkhave, sādhū’’ti. Paṭhamaṃ.",
      "english": "“Monks, I will teach you the wholesome and the unwholesome. Listen to it, pay close attention; I will speak.”\n\n“Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One said this:\n\n“And what, monks, is the unwholesome? Killing living beings, taking what is not given, sexual misconduct, false speech, divisive speech, harsh speech, idle chatter, covetousness, ill will, wrong view – this, monks, is called the unwholesome.\n\n“And what, monks, is the wholesome? Abstention from killing living beings, abstention from taking what is not given, abstention from sexual misconduct, abstention from false speech, abstention from divisive speech, abstention from harsh speech, abstention from idle chatter, non-covetousness, non-ill will, right view – this, monks, is called the wholesome.”",
      "sinhala": "භික්‍ෂූනි, මම ඔබට යහපත් දේ ද, අයහපත් දේ ද දේශනා කරන්නෙමි. එය අසන්න, මනාකොට මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි. එසේය, භාග්‍යවතුන් වහන්ස, යැයි ඒ භික්‍ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\nභික්‍ෂූනි, අයහපත් දේ නම් කවරේද? ප්‍රාණඝාතය, අදත්තාදානය, කාමයන්හි වරදවා හැසිරීම, මුසාවාදය, පිසුනා වාචාව, ඵරුෂා වාචාව, සම්ඵප්පලාපය, අභිධ්‍යාව, ව්‍යාපාදය, මිථ්‍යාදෘෂ්ටියයි. භික්‍ෂූනි, මෙය අයහපත් යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, යහපත් දේ නම් කවරේද? ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමයන්හි වරදවා හැසිරීමෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, පිසුනා වාචාවෙන් වැළකීම, ඵරුෂා වාචාවෙන් වැළකීම, සම්ඵප්පලාපයෙන් වැළකීම, අනභිධ්‍යාව, අව්‍යාපාදය, සම්මාදිට්ඨියයි. භික්‍ෂූනි, මෙය යහපත් යැයි කියනු ලැබේ.",
      "paliTitle": "Sādhusuttaṃ"
    },
    {
      "number": 179,
      "pali": "‘‘Ariyadhammañca vo, bhikkhave, desessāmi anariyadhammañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, anariyo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, anariyo dhammo. ‘‘Katamo ca, bhikkhave, ariyo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, ariyo dhammo’’ti. Dutiyaṃ.",
      "english": "“Monks, I will teach you the noble Dhamma and the ignoble Dhamma. Listen to it well. And what, monks, is the ignoble Dhamma? It is the taking of life, and so forth, up to wrong view. This, monks, is called the ignoble Dhamma.\n\nAnd what, monks, is the noble Dhamma? It is abstaining from the taking of life, and so forth, up to right view. This, monks, is called the noble Dhamma.”",
      "sinhala": "මහණෙනි, මම ඔබට ආර්ය ධර්මයද, අනාර්ය ධර්මයද දේශනා කරන්නෙමි. එය ශ්‍රවණය කරන්න. මහණෙනි, අනාර්ය ධර්මය නම් කවරේද? ප්‍රාණඝාතය... මිථ්‍යාදෘෂ්ටිය – මහණෙනි, මෙය අනාර්ය ධර්මය යැයි කියනු ලැබේ. මහණෙනි, ආර්ය ධර්මය නම් කවරේද? ප්‍රාණඝාතයෙන් වැළකීම... සම්මාදිට්ඨිය – මහණෙනි, මෙය ආර්ය ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Ariyadhammasuttaṃ"
    },
    {
      "number": 180,
      "pali": "‘‘Kusalañca vo, bhikkhave, desessāmi akusalañca. Taṃ suṇātha…pe… katamañca, bhikkhave, akusalaṃ? Pāṇātipāto…pe… micchādiṭṭhi – idaṃ vuccati, bhikkhave, akusalaṃ. ‘‘Katamañca, bhikkhave, kusalaṃ? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – idaṃ vuccati, bhikkhave, kusala’’nti. Tatiyaṃ.",
      "english": "“Monks, I will teach you the wholesome and the unwholesome. Listen to that. And what, monks, is the unwholesome? Killing living beings, and so on, up to wrong view – this, monks, is called the unwholesome. And what, monks, is the wholesome? Abstaining from killing living beings, and so on, up to right view – this, monks, is called the wholesome.”",
      "sinhala": "මහණෙනි, මම ඔබට කුසලයද අකුසලයද දේශනා කරන්නෙමි. එය කල්පනාවෙන් අසන්න. මහණෙනි, අකුසලය කුමක්ද? ප්‍රාණඝාතයෙහි සිට මිථ්‍යාදෘෂ්ටිය දක්වා ඇති මේවා මහණෙනි, අකුසලයයි කියනු ලැබේ. මහණෙනි, කුසලය කුමක්ද? ප්‍රාණඝාතයෙන් වැළකීමෙහි සිට සම්මාදෘෂ්ටිය දක්වා ඇති මේවා මහණෙනි, කුසලයයි කියනු ලැබේ.\n\nතෙවැනි සූත්‍රයයි.",
      "paliTitle": "Kusalasuttaṃ"
    },
    {
      "number": 181,
      "pali": "‘‘Atthañca vo, bhikkhave, desessāmi anatthañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, anattho? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, anattho. ‘‘Katamo ca, bhikkhave, attho? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, attho’’ti. Catutthaṃ.",
      "english": "Monks, I will teach you what is beneficial and what is detrimental. Listen to that. And what, monks, is detrimental? It is the destruction of life, and so on, up to wrong view. This, monks, is called detrimental. And what, monks, is beneficial? It is abstaining from the destruction of life, and so on, up to right view. This, monks, is called beneficial.",
      "sinhala": "මහණෙනි, මම ඔබට අර්ථයත්, අනර්ථයත් දේශනා කරන්නෙමි. ඊට සවන් දෙව්. මහණෙනි, අනර්ථය යනු කුමක්ද? ප්‍රාණඝාතය, අදත්තාදානය, කාමයන්හි මිත්‍යාචාරය, මුසාවාදය, පිසුණු වචනය, ඵරුෂ වචනය, සම්ප්‍රප්පලාපය, අභිධ්‍යාව, ව්‍යාපාදය, මිත්‍යා දෘෂ්ටිය – මහණෙනි, මෙය අනර්ථය යැයි කියනු ලැබේ. මහණෙනි, අර්ථය යනු කුමක්ද? ප්‍රාණඝාතයෙන් වැළකීම, අදත්තාදානයෙන් වැළකීම, කාමයන්හි මිත්‍යාචාරයෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, පිසුණු වචනයෙන් වැළකීම, ඵරුෂ වචනයෙන් වැළකීම, සම්ප්‍රප්පලාපයෙන් වැළකීම, අනභිධ්‍යාව, අව්‍යාපාදය, සම්මා දෘෂ්ටිය – මහණෙනි, මෙය අර්ථය යැයි කියනු ලැබේ.",
      "paliTitle": "Atthasuttaṃ"
    },
    {
      "number": 182,
      "pali": "‘‘Dhammañca vo, bhikkhave, desessāmi adhammañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, adhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, adhammo. ‘‘Katamo ca, bhikkhave, dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, dhammo’’ti. Pañcamaṃ.",
      "english": "Monks, I shall teach you the Dhamma and the Adhamma. Listen to that. And what, monks, is Adhamma? Taking life, up to wrong view – this, monks, is called Adhamma. And what, monks, is Dhamma? Abstaining from taking life, up to right view – this, monks, is called Dhamma.",
      "sinhala": "මහණෙනි, මම ඔබට ධර්මයත් අධර්මයත් දේශනා කරන්නෙමි. එය හොඳින් අසන්න.\n\nමහණෙනි, අධර්මය කවරේද? ප්‍රාණඝාතයේ පටන් මිථ්‍යාදෘෂ්ටිය දක්වා ඇති දෑය. මහණෙනි, මේ අධර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, ධර්මය කවරේද? ප්‍රාණඝාතයෙන් වැළකීමේ පටන් සම්මාදෘෂ්ටිය දක්වා ඇති දෑය. මහණෙනි, මේ ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Dhammasuttaṃ"
    },
    {
      "number": 183,
      "pali": "‘‘Sāsavañca vo, bhikkhave, dhammaṃ desessāmi anāsavañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, sāsavo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, sāsavo dhammo. ‘‘Katamo ca, bhikkhave, anāsavo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, anāsavo dhammo’’ti. Chaṭṭhaṃ.",
      "english": "Monastics, I will teach you the states with effluents and the states without effluents. Listen to that.\n\nAnd what, monastics, are the states with effluents? From taking life up to wrong view—these, monastics, are called the states with effluents.\n\nAnd what, monastics, are the states without effluents? From abstaining from taking life up to right view—these, monastics, are called the states without effluents.",
      "sinhala": "මහණෙනි, මම ඔබට ආශ්‍රව සහිත ධර්මයත්, ආශ්‍රව රහිත ධර්මයත් දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, ආශ්‍රව සහිත ධර්මය කුමක්ද? සතුන් මැරීම ආදියෙහි පටන්, වැරදි දැක්ම දක්වා වූ යම් දෑ වේද, මහණෙනි, මේවා ආශ්‍රව සහිත ධර්මයයි කියා කියනු ලැබේ.\n\nමහණෙනි, ආශ්‍රව රහිත ධර්මය කුමක්ද? සතුන් මැරීමෙන් වැළකීම ආදියෙහි පටන්, නිවැරදි දැක්ම දක්වා වූ යම් දෑ වේද, මහණෙනි, මේවා ආශ්‍රව රහිත ධර්මයයි කියා කියනු ලැබේ.",
      "paliTitle": "Āsavasuttaṃ"
    },
    {
      "number": 184,
      "pali": "‘‘Sāvajjañca vo, bhikkhave, dhammaṃ desessāmi anavajjañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, sāvajjo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, sāvajjo dhammo. ‘‘Katamo ca, bhikkhave, anavajjo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, anavajjo dhammo’’ti. Sattamaṃ.",
      "english": "Monks, I will teach you the blameworthy qualities and the blameless qualities. Listen to them carefully. And what, monks, is the blameworthy quality? Killing living beings... and wrong view – this, monks, is called the blameworthy quality. And what, monks, is the blameless quality? Abstinence from killing living beings... and right view – this, monks, is called the blameless quality.",
      "sinhala": "මහණෙනි, මම ඔබට සාවද්‍ය වූද, අනවද්‍ය වූද ධර්මය දේශනා කරන්නෙමි. එය අසන්න.\n\nමහණෙනි, සාවද්‍ය ධර්මය නම් කවරේද? ප්‍රාණඝාතය... මිථ්‍යාදෘෂ්ටියයි – මහණෙනි, මෙය සාවද්‍ය ධර්මයයි කියනු ලැබේ.\n\nමහණෙනි, අනවද්‍ය ධර්මය නම් කවරේද? ප්‍රාණඝාතයෙන් වැළකීම... සම්මාදිට්ඨියයි – මහණෙනි, මෙය අනවද්‍ය ධර්මයයි කියනු ලැබේ.",
      "paliTitle": "Vajjasuttaṃ"
    },
    {
      "number": 185,
      "pali": "‘‘Tapanīyañca vo, bhikkhave, dhammaṃ desessāmi atapanīyañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, tapanīyo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, tapanīyo dhammo. ‘‘Katamo ca, bhikkhave, atapanīyo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, atapanīyo dhammo’’ti. Aṭṭhamaṃ.",
      "english": "“Monks, I will teach you the principles that lead to torment and the principles that do not lead to torment. Listen to that.\n\nAnd what, monks, are the principles that lead to torment? The taking of life, the taking of what is not given, sexual misconduct, false speech, divisive speech, harsh speech, idle chatter, covetousness, ill-will, and wrong view – these, monks, are called the principles that lead to torment.\n\nAnd what, monks, are the principles that do not lead to torment? Abstinence from taking life, abstinence from taking what is not given, abstinence from sexual misconduct, abstinence from false speech, abstinence from divisive speech, abstinence from harsh speech, abstinence from idle chatter, non-covetousness, non-ill-will, and right view – these, monks, are called the principles that do not lead to torment.”",
      "sinhala": "මහණෙනි, මම නුඹලාට තැවීමට ලක් කරන ධර්මයත්, තැවීමට ලක් නොකරන ධර්මයත් දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, තැවීමට ලක් කරන ධර්මය කුමක්ද? ප්‍රාණඝාතය ආදී වූ මිථ්‍යාදෘෂ්ටිය දක්වා ඇති සියල්ල— මහණෙනි, මෙය තැවීමට ලක් කරන ධර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, තැවීමට ලක් නොකරන ධර්මය කුමක්ද? ප්‍රාණඝාතයෙන් වැළකීම ආදී වූ සම්මාදිට්ඨිය දක්වා ඇති සියල්ල— මහණෙනි, මෙය තැවීමට ලක් නොකරන ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Tapanīyasuttaṃ"
    },
    {
      "number": 186,
      "pali": "‘‘Ācayagāmiñca vo, bhikkhave, dhammaṃ desessāmi apacayagāmiñca. Taṃ suṇātha…pe… katamo ca, bhikkhave, ācayagāmī dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, ācayagāmī dhammo. ‘‘Katamo ca, bhikkhave, apacayagāmī dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, apacayagāmī dhammo’’ti. Navamaṃ.",
      "english": "Monks, I shall teach you the teaching that leads to accumulation and the teaching that leads to diminution. Listen to that.\n\nAnd what, monks, is the teaching that leads to accumulation? Taking life, taking what is not given, sexual misconduct, false speech, malicious speech, harsh speech, frivolous talk, covetousness, ill will, and wrong view – this, monks, is called the teaching that leads to accumulation.\n\nAnd what, monks, is the teaching that leads to diminution? Abstinence from taking life, abstinence from taking what is not given, abstinence from sexual misconduct, abstinence from false speech, abstinence from malicious speech, abstinence from harsh speech, abstinence from frivolous talk, non-covetousness, good will, and right view – this, monks, is called the teaching that leads to diminution.",
      "sinhala": "මහණෙනි, මම ඔබට වර්ධනයට හේතුවන දහමද, පිරිහීමට හේතුවන දහමද දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, වර්ධනයට හේතුවන දහම කවරේද? ප්‍රාණඝාතය ආදී වූ, මිථ්‍යාදෘෂ්ටිය දක්වා වූ කරුණු යනුයි. මහණෙනි, මෙය වර්ධනයට හේතුවන දහම ලෙස කියනු ලැබේ. මහණෙනි, පිරිහීමට හේතුවන දහම කවරේද? ප්‍රාණඝාතයෙන් වැළකීම ආදී වූ, සම්මාදෘෂ්ටිය දක්වා වූ කරුණු යනුයි. මහණෙනි, මෙය පිරිහීමට හේතුවන දහම ලෙස කියනු ලැබේ.",
      "paliTitle": "Ācayagāmisuttaṃ"
    },
    {
      "number": 187,
      "pali": "‘‘Dukkhudrayañca vo, bhikkhave, dhammaṃ desessāmi sukhudrayañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, dukkhudrayo dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, dukkhudrayo dhammo. ‘‘Katamo ca, bhikkhave, sukhudrayo dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, sukhudrayo dhammo’’ti. Dasamaṃ.",
      "english": "Monks, I shall teach you the phenomena that lead to suffering and the phenomena that lead to happiness. Listen to it carefully.\n\nAnd what, monks, are the phenomena that lead to suffering? They are: the taking of life, the taking of what is not given, sexual misconduct, false speech, slanderous speech, harsh speech, frivolous talk, covetousness, ill-will, and wrong view. This, monks, is called the phenomenon that leads to suffering.\n\nAnd what, monks, are the phenomena that lead to happiness? They are: abstinence from taking life, abstinence from taking what is not given, abstinence from sexual misconduct, abstinence from false speech, abstinence from slanderous speech, abstinence from harsh speech, abstinence from frivolous talk, non-covetousness, non-ill-will, and right view. This, monks, is called the phenomenon that leads to happiness.",
      "sinhala": "භික්ෂූන් වහන්සේලා, මම ඔබට දුක්ඛුද්‍රය වූ ධර්මයද, සුඛුද්‍රය වූ ධර්මයද දේශනා කරමි. එය ශ්‍රවණය කරන්න.\n\nභික්ෂූන් වහන්සේලා, දුක්ඛුද්‍රය වූ ධර්මය කවරේද? ප්‍රාණඝාතයේ පටන් මිත්‍යාදෘෂ්ටිය දක්වා ඇති මේ ධර්මය, භික්ෂූන් වහන්සේලා, දුක්ඛුද්‍රය වූ ධර්මය යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්සේලා, සුඛුද්‍රය වූ ධර්මය කවරේද? ප්‍රාණඝාතයෙන් වැළකීමේ පටන් සම්මාදිට්ඨිය දක්වා ඇති මේ ධර්මය, භික්ෂූන් වහන්සේලා, සුඛුද්‍රය වූ ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Dukkhudrayasuttaṃ"
    },
    {
      "number": 188,
      "pali": "‘‘Dukkhavipākañca vo, bhikkhave, dhammaṃ desessāmi sukhavipākañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, dukkhavipāko dhammo? Pāṇātipāto…pe… micchādiṭṭhi – ayaṃ vuccati, bhikkhave, dukkhavipāko dhammo. ‘‘Katamo ca, bhikkhave, sukhavipāko dhammo? Pāṇātipātā veramaṇī…pe… sammādiṭṭhi – ayaṃ vuccati, bhikkhave, sukhavipāko dhammo’’ti. Ekādasamaṃ.",
      "english": "O monks, I shall teach you the Dhamma that brings painful results and the Dhamma that brings pleasant results. Listen to it. And what, O monks, is the Dhamma that brings painful results? Taking life, and so forth, up to wrong view – this, O monks, is called the Dhamma that brings painful results.\n\nAnd what, O monks, is the Dhamma that brings pleasant results? Abstaining from taking life, and so forth, up to right view – this, O monks, is called the Dhamma that brings pleasant results.",
      "sinhala": "භික්ෂූනි, දුක් විපාක ඇති ධර්‍මයද, සැප විපාක ඇති ධර්‍මයද මම ඔබට දේශනා කරන්නෙමි. එය අසන්න. භික්ෂූනි, දුක් විපාක ඇති ධර්‍මය කවරේද? ප්‍රාණඝාතයෙහි සිට මිථ්‍යාදෘෂ්ටිය දක්වා ඇති මේ ධර්‍මය, භික්ෂූනි, දුක් විපාක ඇති ධර්‍මය ලෙස කියනු ලැබේ. භික්ෂූනි, සැප විපාක ඇති ධර්‍මය කවරේද? ප්‍රාණඝාතයෙන් වැළකීමෙහි සිට සම්මාදිට්ඨිය දක්වා ඇති මේ ධර්‍මය, භික්ෂූනි, සැප විපාක ඇති ධර්‍මය ලෙස කියනු ලැබේ.",
      "paliTitle": "Vipākasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Sādhuvaggo tatiyo.",
    "english": "",
    "sinhala": ""
  }
}