{
  "id": "an10.2",
  "title": {
    "pali": "Nāthavaggo",
    "english": "The Protector Chapter",
    "sinhala": "පිහිට වග්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "‘‘Pañcaṅgasamannāgato, bhikkhave, bhikkhu pañcaṅgasamannāgataṃ senāsanaṃ sevamāno bhajamāno nacirasseva āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihareyya. ‘‘Kathañca, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti? Idha, bhikkhave, bhikkhu saddho hoti; saddahati tathāgatassa bodhiṃ – ‘itipi so bhagavā…pe… bhagavā’ti; appābādho hoti appātaṅko, samavepākiniyā gahaṇiyā samannāgato nātisītāya nāccuṇhāya majjhimāya padhānakkhamāya; asaṭho hoti amāyāvī, yathābhūtaṃ attānaṃ āvikattā satthari vā viññūsu vā sabrahmacārīsu; āraddhavīriyo viharati, akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya; thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu; paññavā hoti, udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti. ‘‘Kathañca, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hoti? Idha, bhikkhave, senāsanaṃ nātidūraṃ hoti nāccāsannaṃ gamanāgamanasampannaṃ divā appākiṇṇaṃ rattiṃ appasaddaṃ appanigghosaṃ appaḍaṃsamakasavātātapasarīsapasamphassaṃ [appaḍaṃsa… siriṃsapasamphassaṃ (sī. syā. pī.)]; tasmiṃ kho pana senāsane viharantassa appakasirena uppajjanti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārā; tasmiṃ kho pana senāsane therā bhikkhū viharanti bahussutā āgatāgamā dhammadharā vinayadharā mātikādharā; te kālena kālaṃ upasaṅkamitvā paripucchati paripañhati – ‘idaṃ, bhante, kathaṃ, imassa ko attho’ti; tassa te āyasmanto avivaṭañceva vivaranti anuttānīkatañca uttāniṃ karonti anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Evaṃ kho, bhikkhave, senāsanaṃ pañcaṅgasamannāgataṃ hoti. Pañcaṅgasamannāgato kho, bhikkhave, bhikkhu pañcaṅgasamannāgataṃ senāsanaṃ sevamāno bhajamāno nacirasseva āsavānaṃ khayā…pe… sacchikatvā upasampajja vihareyyā’’ti. Paṭhamaṃ.",
      "english": "Monks, a monk endowed with five qualities, frequenting and resorting to a dwelling place endowed with five qualities, will not long hence, by the destruction of the taints, attain and dwell in the taint-free liberation of mind and liberation by wisdom, having realized it for himself through direct knowledge in this very life.\n\nAnd how, monks, is a monk endowed with five qualities? Here, monks, a monk is endowed with faith; he has faith in the Tathāgata’s enlightenment, believing: ‘Indeed, the Blessed One is accomplished, perfectly enlightened, endowed with knowledge and conduct, sublime, knower of worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.’ He is of few ailments and few afflictions, endowed with a digestive power that processes food evenly, neither too cold nor too hot, but moderate and conducive to striving. He is not deceitful nor fraudulent, but reveals himself as he truly is to the Teacher or to his discerning fellow practitioners. He dwells with aroused energy for the abandoning of unwholesome states and for the acquisition of wholesome states; he is possessed of strength, firm in his endeavor, and unburdening himself from the yoke in wholesome states. He is endowed with wisdom, possessed of the noble and penetrative wisdom that discerns rise and fall, leading to the right destruction of suffering. It is in this way, monks, that a monk is endowed with five qualities.\n\nAnd how, monks, is a dwelling place endowed with five qualities? Here, monks, a dwelling place is neither too far nor too close, well-equipped for coming and going, not crowded by day, not noisy by night, without loud sounds, and free from the touch of gadflies, mosquitoes, wind, sun, and creeping things. Furthermore, for one dwelling in that dwelling place, the requisites of robes, almsfood, lodging, and medicine for the sick are easily obtained without difficulty. Furthermore, in that dwelling place, elder monks reside who are well-versed in the teachings, preservers of the tradition, masters of the Dhamma, masters of the Vinaya, and masters of the summaries. Approaching them from time to time, he questions and inquires: ‘Venerable sirs, how is this? What is the meaning of this?’ To him, those venerable ones reveal what is unrevealed, make clear what is unclear, and dispel his doubt regarding various doubtful points concerning the teachings. It is in this way, monks, that a dwelling place is endowed with five qualities.\n\nMonks, a monk endowed with five qualities, frequenting and resorting to a dwelling place endowed with five qualities, will not long hence, by the destruction of the taints, attain and dwell in the taint-free liberation of mind and liberation by wisdom, having realized it for himself through direct knowledge in this very life.",
      "sinhala": "මහණෙනි, පස් අංගයකින් යුක්ත භික්ෂුවක්, පස් අංගයකින් යුක්ත සේනාසනයක් සේවනය කරමින්, භජනය කරමින් නොබෝ කලකින්ම ආසවයන් ක්ෂය කිරීමෙන් කෙලෙස් රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරයි.\n\nමහණෙනි, භික්ෂුවක් පස් අංගයකින් යුක්ත වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව ශ්‍රද්ධාවෙන් යුක්ත වෙයි; 'ඒ භාග්‍යවතුන් වහන්සේ අරහං... (ආදී ගුණ සමුදායෙන් යුක්ත වූ) භාග්‍යවතුන් වහන්සේය' යැයි තථාගතයන් වහන්සේගේ බෝධිය (අවබෝධය) විශ්වාස කරයි. ස්වල්ප ආබාධ ඇත්තෙක් වෙයි, ස්වල්ප රෝග ඇත්තෙක් වෙයි; අධික ශීතල හෝ අධික උණුසුම් නොවූ, මධ්‍යස්ථ වූ, වීර්යය කිරීමට සුදුසු සමව පැසවන ග්‍රහණී ශක්තියෙන් යුක්ත වෙයි. වංචා රහිත වෙයි, මායා රහිත වෙයි; ශාස්තෘන් වහන්සේ ඉදිරියේ හෝ ප්‍රඥාවන්ත බ්‍රහ්මචාරීවරුන් ඉදිරියේ හෝ තමා සැබෑ ලෙසින්ම ප්‍රකට කරන්නෙක් වෙයි. අකුසල ධර්මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්මයන් සම්පූර්ණ කරගැනීම පිණිසත් වීර්යය අරඹා වාසය කරයි; ශක්තිමත් වූ, දැඩි වීර්යය ඇත්තෙක් වූ, කුසල ධර්මයන් සම්බන්ධයෙන් බර නොහළ තැනැත්තෙක් වෙයි. ප්‍රඥාවන්ත වෙයි; උදයාස්තය (ඇතිවීම හා නැතිවීම) දකින ප්‍රඥාවෙන් යුක්ත වෙයි; ආර්ය වූ, විනිවිද යන සුළු වූ, මනාව දුක්ඛ ක්ෂයට පමුණුවන ප්‍රඥාවෙන් යුක්ත වෙයි. මහණෙනි, භික්ෂුවක් පස් අංගයකින් යුක්ත වන්නේ මෙසේය.\n\nමහණෙනි, සේනාසනයක් පස් අංගයකින් යුක්ත වන්නේ කෙසේද? මහණෙනි, මෙහිලා සේනාසනයක් අධික ඈතක නොවෙයි, අධික ළඟකද නොවෙයි; ගමනාගමනයට පහසු වෙයි; දහවල් කාලයේ ජනාකීර්ණ නොවෙයි; රාත්‍රී කාලයේ ශබ්ද රහිත වෙයි, ඝෝෂා රහිත වෙයි; මැසි, මදුරු, සුළං, අව්ව, සර්පයන් යන ඒවාගේ ස්පර්ශයන්ගෙන් තොර වෙයි. එම සේනාසනයේ වාසය කරන භික්ෂුවට සිව්රු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර නොපමාව පහසුවෙන් ඇතිවෙයි. එම සේනාසනයේ ථේර භික්ෂූහු වාසය කරති; ඔවුන් බහුශ්‍රැත වෙති, ආගමනය කරන ලද (ග්‍රන්ථධර) වෙති, ධර්මධර වෙති, විනයධර වෙති, මාතිකාධර වෙති. ඔහු කලින් කලට ඔවුන් කරා එළඹ විමසයි, ප්‍රශ්න කරයි – 'ස්වාමීනි, මේ කුමක්ද? මෙහි තේරුම කුමක්ද?' යැයි. ඒ ආයුෂ්මත්හු ඔහුට නොපැහැදිලි දේ පැහැදිලි කරති; නොපැහැදිලි දේ පැහැදිලි කරති; නොයෙක් ආකාර වූ සැක සහිත ධර්මයන් පිළිබඳව ඇති සැකය දුරු කරති. මහණෙනි, සේනාසනයක් පස් අංගයකින් යුක්ත වන්නේ මෙසේය.\n\nමහණෙනි, පස් අංගයකින් යුක්ත භික්ෂුවක්, පස් අංගයකින් යුක්ත සේනාසනයක් සේවනය කරමින්, භජනය කරමින් නොබෝ කලකින්ම ආසවයන් ක්ෂය කිරීමෙන් කෙලෙස් රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරන්නේය.\n\nපළමුවැන්නයි.",
      "paliTitle": "Senāsanasuttaṃ",
      "englishTitle": "Discourse on Lodgings",
      "sinhalaTitle": "සේනාසන සූත්‍රය"
    },
    {
      "number": 12,
      "pali": "‘‘Pañcaṅgavippahīno, bhikkhave, bhikkhu pañcaṅgasamannāgato imasmiṃ dhammavinaye ‘kevalī vusitavā uttamapuriso’ti vuccati. Kathañca, bhikkhave, bhikkhu pañcaṅgavippahīno hoti? Idha, bhikkhave, bhikkhuno kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ [thīnamiddhaṃ (sī. syā. pī.)] pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgavippahīno hoti. ‘‘Kathañca, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti? Idha, bhikkhave, bhikkhu asekhena sīlakkhandhena samannāgato hoti, asekhena samādhikkhandhena samannāgato hoti, asekhena paññākkhandhena samannāgato hoti, asekhena vimuttikkhandhena samannāgato hoti, asekhena vimuttiñāṇadassanakkhandhena samannāgato hoti. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgasamannāgato hoti. ‘‘Pañcaṅgavippahīno kho, bhikkhave, bhikkhu pañcaṅgasamannāgato imasmiṃ dhammavinaye ‘kevalī vusitavā uttamapuriso’ti vuccati. ‘‘Kāmacchando ca byāpādo, thinamiddhañca bhikkhuno; Uddhaccaṃ vicikicchā ca, sabbasova na vijjati. ‘‘Asekhena ca sīlena, asekhena samādhinā; Vimuttiyā ca sampanno, ñāṇena ca tathāvidho. ‘‘Sa ve pañcaṅgasampanno, pañca aṅge [pañcaṅgāni (syā.)] vivajjayaṃ [vivajjiya (ka.)]; Imasmiṃ dhammavinaye, kevalī iti vuccatī’’ti. dutiyaṃ;",
      "english": "‘‘Monks, a monk who has abandoned five qualities and is endowed with five qualities is called 'perfect, one who has lived the holy life, a supreme person' in this Dhamma and Discipline. And how, monks, is a monk one who has abandoned five qualities? Here, monks, for a monk, sensual desire is abandoned, ill-will is abandoned, sloth and torpor are abandoned, restlessness and remorse are abandoned, and doubt is abandoned. It is in this way, monks, that a monk is one who has abandoned five qualities.\n\n‘‘And how, monks, is a monk endowed with five qualities? Here, monks, a monk is endowed with the aggregate of unshakeable virtue, endowed with the aggregate of unshakeable concentration, endowed with the aggregate of unshakeable wisdom, endowed with the aggregate of unshakeable liberation, and endowed with the aggregate of unshakeable knowledge and vision of liberation. It is in this way, monks, that a monk is endowed with five qualities.\n\n‘‘Monks, a monk who has abandoned five qualities and is endowed with five qualities is called 'perfect, one who has lived the holy life, a supreme person' in this Dhamma and Discipline.\n\nSensual desire and ill-will,\nAlong with sloth and torpor, for a monk;\nRestlessness and doubt,\nAre entirely not found in him.\n\nEndowed with unshakeable virtue,\nAnd unshakeable concentration;\nEndowed with liberation,\nAnd similarly with knowledge.\n\nHe, indeed, endowed with five qualities,\nHaving abandoned the five qualities;\nIs called 'perfect' in this Dhamma and Discipline.",
      "sinhala": "මහණෙනි, පඤ්චාංගයන් ප්‍රහාණය කළ, පඤ්චාංගයන්ගෙන් යුක්ත වූ භික්‍ෂුවක් මේ ධර්ම විනයෙහි 'කේවලී වූ, වාසය අවසන් කළ, උත්තම පුරුෂයා' යැයි කියනු ලැබේ. මහණෙනි, භික්‍ෂුවක් කෙසේ නම් පඤ්චාංගයන් ප්‍රහාණය කළ කෙනෙක් වේද? මහණෙනි, මෙහිලා භික්‍ෂුවකට කාමච්ඡන්දය ප්‍රහීණ වී ඇත, ව්‍යාපාදය ප්‍රහීණ වී ඇත, ථීනමිද්ධය ප්‍රහීණ වී ඇත, උද්ධච්ච කුක්කුච්චය ප්‍රහීණ වී ඇත, විචිකිච්ඡාව ප්‍රහීණ වී ඇත. මහණෙනි, භික්‍ෂුවක් මෙසේ පඤ්චාංගයන් ප්‍රහාණය කළ කෙනෙක් වේ.\n\nමහණෙනි, භික්‍ෂුවක් කෙසේ නම් පඤ්චාංගයන්ගෙන් යුක්ත කෙනෙක් වේද? මහණෙනි, මෙහිලා භික්‍ෂුවක් අශෛක්‍ෂ්‍ය ශීලස්කන්ධයෙන් යුක්ත වේ, අශෛක්‍ෂ්‍ය සමාධිස්කන්ධයෙන් යුක්ත වේ, අශෛක්‍ෂ්‍ය ප්‍රඥාස්කන්ධයෙන් යුක්ත වේ, අශෛක්‍ෂ්‍ය විමුක්තිස්කන්ධයෙන් යුක්ත වේ, අශෛක්‍ෂ්‍ය විමුක්ති ඥානදර්ශනස්කන්ධයෙන් යුක්ත වේ. මහණෙනි, භික්‍ෂුවක් මෙසේ පඤ්චාංගයන්ගෙන් යුක්ත කෙනෙක් වේ.\n\nමහණෙනි, පඤ්චාංගයන් ප්‍රහාණය කළ, පඤ්චාංගයන්ගෙන් යුක්ත වූ භික්‍ෂුවක් මේ ධර්ම විනයෙහි 'කේවලී වූ, වාසය අවසන් කළ, උත්තම පුරුෂයා' යැයි කියනු ලැබේ.\n\nකාමච්ඡන්දය ද, ව්‍යාපාදය ද, භික්‍ෂුවකට ථීනමිද්ධය ද, උද්ධච්චය ද, විචිකිච්ඡාව ද, සියල්ලෙන් ම නොමැත්තේය.\n\nඅශෛක්‍ෂ්‍ය ශීලයෙන් ද, අශෛක්‍ෂ්‍ය සමාධියෙන් ද, විමුක්තියෙන් ද, ඥානයෙන් ද යුක්ත වූ හෙතෙම එබඳු වෙයි.\n\nපඤ්චාංගයන්ගෙන් යුක්ත වූ, පඤ්චාංගයන් දුරු කළ ඒ තැනැත්තා මේ ධර්ම විනයෙහි 'කේවලී' යැයි කියනු ලැබේ.",
      "paliTitle": "Pañcaṅgasuttaṃ",
      "englishTitle": "The Discourse on Five Factors",
      "sinhalaTitle": "පඤ්චාංග සූත්‍රය"
    },
    {
      "number": 13,
      "pali": "‘‘Dasayimāni, bhikkhave, saṃyojanāni. Katamāni dasa? Pañcorambhāgiyāni saṃyojanāni, pañcuddhambhāgiyāni saṃyojanāni. Katamāni pañcorambhāgiyāni saṃyojanāni? Sakkāyadiṭṭhi, vicikicchā, sīlabbataparāmāso, kāmacchando, byāpādo – imāni pañcorambhāgiyāni saṃyojanāni. ‘‘Katamāni pañcuddhambhāgiyāni saṃyojanāni? Rūparāgo, arūparāgo, māno, uddhaccaṃ, avijjā – imāni pañcuddhambhāgiyāni saṃyojanāni. Imāni kho, bhikkhave, dasa saṃyojanānī’’ti. Tatiyaṃ.",
      "english": "Monks, these are the ten fetters. Which ten? Five are the lower fetters, and five are the higher fetters. Which are the five lower fetters? Identity view, doubt, adherence to rites and rituals, sensual desire, and ill will – these are the five lower fetters. Which are the five higher fetters? Attachment to form realms, attachment to formless realms, conceit, restlessness, and ignorance – these are the five higher fetters. Indeed, Monks, these are the ten fetters.",
      "sinhala": "මහණෙනි, මේවා දස සංයෝජන වෙති. ඒ දසය කවරේද? පංච ඕරම්භාගීය සංයෝජන, පංච උද්ධම්භාගීය සංයෝජන යි. පංච ඕරම්භාගීය සංයෝජන කවරේද? සක්කායදිට්ඨි, විචිකිච්ඡා, සීලබ්බතපරාමාස, කාමච්ඡන්දය, ව්‍යාපාදය යනුයි – මේවා පංච ඕරම්භාගීය සංයෝජන වෙති. පංච උද්ධම්භාගීය සංයෝජන කවරේද? රූපරාගය, අරූපරාගය, මානය, උද්ධච්චය, අවිජ්ජාව යනුයි – මේවා පංච උද්ධම්භාගීය සංයෝජන වෙති. මහණෙනි, මේවාම දස සංයෝජන වෙති.",
      "paliTitle": "Saṃyojanasuttaṃ",
      "englishTitle": "Discourse on Fetters",
      "sinhalaTitle": "සංයෝජන සූත්‍රය"
    },
    {
      "number": 14,
      "pali": "‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā pañca cetokhilā appahīnā pañca cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. ‘‘Katamassa pañca cetokhilā appahīnā honti? Idha, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati. Yo so, bhikkhave, bhikkhu satthari kaṅkhati vicikicchati nādhimuccati na sampasīdati, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetokhilo appahīno hoti. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhamme kaṅkhati…pe… saṅghe kaṅkhati… sikkhāya kaṅkhati… sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto. Yo so, bhikkhave, bhikkhu sabrahmacārīsu kupito hoti anattamano āhatacitto khilajāto, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetokhilo appahīno hoti. Imassa pañca cetokhilā appahīnā honti. ‘‘Katamassa pañca cetasovinibandhā asamucchinnā honti? Idha, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho. Yo so, bhikkhave, bhikkhu kāmesu avītarāgo hoti avigatacchando avigatapemo avigatapipāso avigatapariḷāho avigatataṇho, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetasovinibandho asamucchinno hoti. ‘‘Puna caparaṃ, bhikkhave, bhikkhu kāye avītarāgo hoti…pe… rūpe avītarāgo hoti…pe… yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati… aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, bhikkhave, bhikkhu aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti, tassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ na namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetasovinibandho asamucchinno hoti. Imassa pañca cetasovinibandhā asamucchinnā honti. ‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā appahīnā ime pañca cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. ‘‘Seyyathāpi, bhikkhave, kāḷapakkhe candassa yā ratti vā divaso vā āgacchati, hāyateva vaṇṇena hāyati maṇḍalena hāyati ābhāya hāyati ārohapariṇāhena; evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā appahīnā ime pañca cetasovinibandhā asamucchinnā, tassa yā ratti vā divaso vā āgacchati hāniyeva pāṭikaṅkhā kusalesu dhammesu no vuddhi. ‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā pañca cetokhilā pahīnā pañca cetasovinibandhā susamucchinnā, tassa yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni. ‘‘Katamassa pañca cetokhilā pahīnā honti? Idha, bhikkhave, bhikkhu satthari na kaṅkhati na vicikicchati, adhimuccati sampasīdati. Yo so, bhikkhave, bhikkhu satthari na kaṅkhati na vicikicchati adhimuccati sampasīdati, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetokhilo pahīno hoti. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhamme na kaṅkhati…pe… saṅghe na kaṅkhati… sikkhāya na kaṅkhati … sabrahmacārīsu na kupito hoti attamano na āhatacitto na khilajāto. Yo so, bhikkhave, bhikkhu sabrahmacārīsu na kupito hoti attamano na āhatacitto na khilajāto, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetokhilo pahīno hoti. Imassa pañca cetokhilā pahīnā honti. ‘‘Katamassa pañca cetasovinibandhā susamucchinnā honti? Idha, bhikkhave, bhikkhu kāmesu vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho. Yo so, bhikkhave, bhikkhu kāmesu vītarāgo hoti vigatacchando vigatapemo vigatapipāso vigatapariḷāho vigatataṇho, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ paṭhamo cetasovinibandho susamucchinno hoti. ‘‘Puna caparaṃ, bhikkhave, bhikkhu kāye vītarāgo hoti…pe… rūpe vītarāgo hoti …pe… na yāvadatthaṃ udarāvadehakaṃ bhuñjitvā seyyasukhaṃ passasukhaṃ middhasukhaṃ anuyutto viharati, na aññataraṃ devanikāyaṃ paṇidhāya brahmacariyaṃ carati – ‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā devo vā bhavissāmi devaññataro vā’ti. Yo so, bhikkhave, bhikkhu na aññataraṃ devanikāyaṃ paṇidhāya…pe… devaññataro vāti, tassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya. Yassa cittaṃ namati ātappāya anuyogāya sātaccāya padhānāya, evamassāyaṃ pañcamo cetasovinibandho susamucchinno hoti. Imassa pañca cetasovinibandhā susamucchinnā honti. ‘‘Yassa kassaci, bhikkhave, bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā pahīnā ime pañca cetasovinibandhā susamucchinnā, tassa yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihāni. ‘‘Seyyathāpi, bhikkhave, juṇhapakkhe candassa yā ratti vā divaso vā āgacchati, vaḍḍhateva vaṇṇena vaḍḍhati maṇḍalena vaḍḍhati ābhāya vaḍḍhati ārohapariṇāhena; evamevaṃ kho, bhikkhave, yassa kassaci bhikkhussa vā bhikkhuniyā vā ime pañca cetokhilā pahīnā ime pañca cetasovinibandhā susamucchinnā, tassa yā ratti vā divaso vā āgacchati vuddhiyeva pāṭikaṅkhā kusalesu dhammesu no parihānī’’ti. Catutthaṃ.",
      "english": "Monks, for whosoever, whether a monk or a nun, the five mental wildernesses remain unabandoned and the five mental fetters remain uneradicated, for them, whatever night or day comes, only decline is to be expected in wholesome states, not growth.\n\nWhat are the five mental wildernesses that remain unabandoned? Here, monks, a monk is doubtful and indecisive about the Teacher, does not resolve with conviction, and is not confident. For that monk who is doubtful and indecisive about the Teacher, does not resolve with conviction, and is not confident, their mind does not incline towards ardent effort, persistent application, continuous practice, and exertion. For one whose mind does not incline towards ardent effort, persistent application, continuous practice, and exertion, this is the first mental wilderness that remains unabandoned for them.\n\nFurthermore, monks, a monk is doubtful about the Dhamma... doubtful about the Sangha... doubtful about the training... and is angry, discontent, with a mind struck and hostile towards his fellow practitioners. For that monk who is angry, discontent, with a mind struck and hostile towards his fellow practitioners, their mind does not incline towards ardent effort, persistent application, continuous practice, and exertion. For one whose mind does not incline towards ardent effort, persistent application, continuous practice, and exertion, this is the fifth mental wilderness that remains unabandoned for them. These are the five mental wildernesses that remain unabandoned for them.\n\nWhat are the five mental fetters that remain uneradicated? Here, monks, a monk is not free from lust for sensual pleasures, not free from desire, not free from affection, not free from thirst, not free from feverish longing, not free from craving. For that monk who is not free from lust for sensual pleasures, not free from desire, not free from affection, not free from thirst, not free from feverish longing, not free from craving, their mind does not incline towards ardent effort, persistent application, continuous practice, and exertion. For one whose mind does not incline towards ardent effort, persistent application, continuous practice, and exertion, this is the first mental fetter that remains uneradicated for them.\n\nFurthermore, monks, a monk is not free from lust for the body... not free from lust for forms... and having eaten his fill, stuffing his belly, he dwells devoted to the pleasure of lying down, the pleasure of sleep, the pleasure of slumber... or he observes the holy life with the aspiration to be reborn in some divine realm, thinking: 'By this virtue or vow or ascetic practice or holy life, I shall become a deity or a divine being.' For that monk who observes the holy life with the aspiration to be reborn in some divine realm, thinking: 'By this virtue or vow or ascetic practice or holy life, I shall become a deity or a divine being,' their mind does not incline towards ardent effort, persistent application, continuous practice, and exertion. For one whose mind does not incline towards ardent effort, persistent application, continuous practice, and exertion, this is the fifth mental fetter that remains uneradicated for them. These are the five mental fetters that remain uneradicated for them.\n\nMonks, for whosoever, whether a monk or a nun, these five mental wildernesses remain unabandoned and these five mental fetters remain uneradicated, for them, whatever night or day comes, only decline is to be expected in wholesome states, not growth.\n\nJust as, monks, during the dark fortnight of the moon, whatever night or day comes, it declines in color, it declines in its orb, it declines in its radiance, it declines in its ascending and descending diameter; in the same way, monks, for whosoever, whether a monk or a nun, these five mental wildernesses remain unabandoned and these five mental fetters remain uneradicated, for them, whatever night or day comes, only decline is to be expected in wholesome states, not growth.\n\nMonks, for whosoever, whether a monk or a nun, the five mental wildernesses are abandoned and the five mental fetters are well-eradicated, for them, whatever night or day comes, only growth is to be expected in wholesome states, not decline.\n\nWhat are the five mental wildernesses that are abandoned? Here, monks, a monk is not doubtful or indecisive about the Teacher, but resolves with conviction and is confident. For that monk who is not doubtful or indecisive about the Teacher, but resolves with conviction and is confident, their mind inclines towards ardent effort, persistent application, continuous practice, and exertion. For one whose mind inclines towards ardent effort, persistent application, continuous practice, and exertion, this is the first mental wilderness that is abandoned for them.\n\nFurthermore, monks, a monk is not doubtful about the Dhamma... not doubtful about the Sangha... not doubtful about the training... and is not angry, is pleased, with a mind not struck and not hostile towards his fellow practitioners. For that monk who is not angry, is pleased, with a mind not struck and not hostile towards his fellow practitioners, their mind inclines towards ardent effort, persistent application, continuous practice, and exertion. For one whose mind inclines towards ardent effort, persistent application, continuous practice, and exertion, this is the fifth mental wilderness that is abandoned for them. These are the five mental wildernesses that are abandoned for them.\n\nWhat are the five mental fetters that are well-eradicated?\n\nHere, monks, a monk is dispassionate towards sensual pleasures, free from desire, free from fondness, free from thirst, free from feverish longing, free from craving. That monk, monks, who is dispassionate towards sensual pleasures, free from desire, free from fondness, free from thirst, free from feverish longing, free from craving, his mind inclines towards ardent exertion, diligent application, persistence, and striving. For whom the mind inclines towards ardent exertion, diligent application, persistence, and striving, thus his first mental fetter is utterly eradicated.\n\nFurthermore, monks, a monk is dispassionate towards the body, dispassionate towards material forms; he does not dwell devoted to the pleasure of lying down, the pleasure of sleep, the pleasure of slumber after having eaten to excess, stuffing his stomach; and he does not practice the holy life with the aspiration for any particular divine realm, thinking: 'By this virtue or by this practice, or by this austerity, or by this holy life, I shall become a deva or a certain kind of deva.' That monk, monks, who does not practice the holy life with the aspiration for any particular divine realm, thinking, 'I shall become a deva or a certain kind of deva,' his mind inclines towards ardent exertion, diligent application, persistence, and striving. For whom the mind inclines towards ardent exertion, diligent application, persistence, and striving, thus his fifth mental fetter is utterly eradicated.\n\nFor him, these five mental fetters are utterly eradicated.\n\nFor any monk or nun, monks, for whom these five mental barrennesses are abandoned and these five mental fetters are utterly eradicated, whatever night or day comes, growth alone is to be expected in wholesome states, not decline. Just as, monks, for the moon in the waxing half, whatever night or day comes, it grows in beauty, it grows in orb, it grows in radiance, it grows in magnitude; even so, monks, for any monk or nun for whom these five mental barrennesses are abandoned and these five mental fetters are utterly eradicated, whatever night or day comes, growth alone is to be expected in wholesome states, not decline.",
      "sinhala": "මහණෙනි, යම්කිසි මහණෙකුට හෝ මෙහෙණියකට සිතේ කිළුටු වූ පස් වැදෑරුම් කෙළෙස් ඉතිරි වී ඇත්නම්, සිත බැඳ තබන පස් වැදෑරුම් බැඳීම් මුලින් උදුරා නැත්නම්, ඔහුට යම් රාත්‍රියක් හෝ දවසක් එළඹේද, කුසල් දහම්හි හානියම අපේක්ෂා කළ යුත්තක් මිස දියුණුවක් නොවේ.\n\nකවරෙකුටද මේ පස් වැදෑරුම් සිතේ කිළුටු ඉතිරි වී ඇත්තේ? මහණෙනි, මෙහිලා භික්ෂුව ශාස්තෘන් වහන්සේ කෙරෙහි සැක කරයි, විමතියට පත්වේ, අධිමුක්තියක් නොලබයි, පැහැදීමක් නොමැත. මහණෙනි, යම් භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි සැක කරයි, විමතියට පත්වේ, අධිමුක්තියක් නොලබයි, පැහැදීමක් නොමැතිද, ඔහුගේ සිත වීර්යය පිණිසද, නිරන්තර යෙදීම පිණිසද, නොකඩවා පවත්වාගෙන යාම පිණිසද, වීර්යය කිරීම පිණිසද නැමෙන්නේ නැත. යම් කෙනෙකුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නොනැමෙයිද, මෙසේ ඔහුට මේ පළමු වන සිතේ කිළුටු ඉතිරි වී ඇත්තේ වේ.\n\nතවද, මහණෙනි, භික්ෂුව ධර්මය කෙරෙහි සැක කරයි, විමතියට පත්වේ, අධිමුක්තියක් නොලබයි, පැහැදීමක් නොමැත. සංඝයා කෙරෙහි සැක කරයි, විමතියට පත්වේ, අධිමුක්තියක් නොලබයි, පැහැදීමක් නොමැත. ශික්ෂාව කෙරෙහි සැක කරයි, විමතියට පත්වේ, අධිමුක්තියක් නොලබයි, පැහැදීමක් නොමැත. සබ්‍රහ්මචාරීන් කෙරෙහි කෝප වූයේ, නොසතුටු වූයේ, සිත ආඝාතයෙන් යුක්ත වූයේ, සිතේ කිළිටි උපදවාගත්තේ වේ. මහණෙනි, යම් භික්ෂුවක් සබ්‍රහ්මචාරීන් කෙරෙහි කෝප වූයේ, නොසතුටු වූයේ, සිත ආඝාතයෙන් යුක්ත වූයේ, සිතේ කිළිටි උපදවාගත්තේ වේද, ඔහුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නැමෙන්නේ නැත. යම් කෙනෙකුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නොනැමෙයිද, මෙසේ ඔහුට මේ පස්වන සිතේ කිළුටු ඉතිරි වී ඇත්තේ වේ. ඔහුට මේ පස් වැදෑරුම් සිතේ කිළුටු ඉතිරි වී ඇත්තේ වේ.\n\nකවරෙකුටද මේ සිත බැඳ තබන පස් වැදෑරුම් බැඳීම් මුලින් උදුරා නැත්තේ? මහණෙනි, මෙහිලා භික්ෂුව කාමයන් කෙරෙහි නොවරදවා ඇල්මක් ඇති, නොසිඳුණු කැමැත්තක් ඇති, නොසිඳුණු ප්‍රේමයක් ඇති, නොසිඳුණු පිපාසයක් ඇති, නොසිඳුණු දැවිල්ලක් ඇති, නොසිඳුණු තෘෂ්ණාවක් ඇති තැනැත්තෙක් වේ. මහණෙනි, යම් භික්ෂුවක් කාමයන් කෙරෙහි නොවරදවා ඇල්මක් ඇති, නොසිඳුණු කැමැත්තක් ඇති, නොසිඳුණු ප්‍රේමයක් ඇති, නොසිඳුණු පිපාසයක් ඇති, නොසිඳුණු දැවිල්ලක් ඇති, නොසිඳුණු තෘෂ්ණාවක් ඇති තැනැත්තෙක් වේද, ඔහුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නැමෙන්නේ නැත. යම් කෙනෙකුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නොනැමෙයිද, මෙසේ ඔහුට මේ පළමු වන සිත බැඳ තබන බැඳීම මුලින් උදුරා නැත්තේ වේ.\n\nතවද, මහණෙනි, භික්ෂුව කය කෙරෙහි නොවරදවා ඇල්මක් ඇති, නොසිඳුණු කැමැත්තක් ඇති, නොසිඳුණු ප්‍රේමයක් ඇති, නොසිඳුණු පිපාසයක් ඇති, නොසිඳුණු දැවිල්ලක් ඇති, නොසිඳුණු තෘෂ්ණාවක් ඇති තැනැත්තෙක් වේ. රූප කෙරෙහි නොවරදවා ඇල්මක් ඇති, නොසිඳුණු කැමැත්තක් ඇති, නොසිඳුණු ප්‍රේමයක් ඇති, නොසිඳුණු පිපාසයක් ඇති, නොසිඳුණු දැවිල්ලක් ඇති, නොසිඳුණු තෘෂ්ණාවක් ඇති තැනැත්තෙක් වේ. කැමති පරිදි, බඩ පැලෙන තරමට අනුභව කොට, සයන සැපයට, ඇලෙන සුළු සැපයට, නිද්‍රා සැපයට ඇලී වාසය කරයි. යම්කිසි දෙව් ලොවක් ප්‍රාර්ථනා කරමින් බ්‍රහ්මචර්යාවෙන් හැසිරෙයි – ‘මේ මාගේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ දෙවියෙක් වන්නෙමි, නැතහොත් දෙව් ලොවට අයිති වූවෙක් වන්නෙමි’යි. මහණෙනි, යම් භික්ෂුවක් යම්කිසි දෙව් ලොවක් ප්‍රාර්ථනා කරමින් බ්‍රහ්මචර්යාවෙන් හැසිරෙයි – ‘මේ මාගේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ දෙවියෙක් වන්නෙමි, නැතහොත් දෙව් ලොවට අයිති වූවෙක් වන්නෙමි’යි කියා, ඔහුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නැමෙන්නේ නැත. යම් කෙනෙකුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නොනැමෙයිද, මෙසේ ඔහුට මේ පස්වන සිත බැඳ තබන බැඳීම මුලින් උදුරා නැත්තේ වේ. ඔහුට මේ පස් වැදෑරුම් සිත බැඳ තබන බැඳීම් මුලින් උදුරා නැත්තේ වේ.\n\nමහණෙනි, යම්කිසි මහණෙකුට හෝ මෙහෙණියකට මේ පස් වැදෑරුම් සිතේ කිළුටු ඉතිරි වී ඇත්නම්, මේ පස් වැදෑරුම් සිත බැඳ තබන බැඳීම් මුලින් උදුරා නැත්නම්, ඔහුට යම් රාත්‍රියක් හෝ දවසක් එළඹේද, කුසල් දහම්හි හානියම අපේක්ෂා කළ යුත්තක් මිස දියුණුවක් නොවේ.\n\nමහණෙනි, යම්සේ අමාවක පක්ෂයේ චන්ද්‍රයාට යම් රාත්‍රියක් හෝ දවසක් එළඹේද, (එසේ වූ විට) වර්ණයෙන් ක්ෂය වේ, මණ්ඩලයෙන් ක්ෂය වේ, ආලෝකයෙන් ක්ෂය වේ, උස් මහත් බවෙන් ක්ෂය වේද; එලෙසින්ම, මහණෙනි, යම්කිසි මහණෙකුට හෝ මෙහෙණියකට මේ පස් වැදෑරුම් සිතේ කිළුටු ඉතිරි වී ඇත්නම්, මේ පස් වැදෑරුම් සිත බැඳ තබන බැඳීම් මුලින් උදුරා නැත්නම්, ඔහුට යම් රාත්‍රියක් හෝ දවසක් එළඹේද, කුසල් දහම්හි හානියම අපේක්ෂා කළ යුත්තක් මිස දියුණුවක් නොවේ.\n\nමහණෙනි, යම්කිසි මහණෙකුට හෝ මෙහෙණියකට පස් වැදෑරුම් සිතේ කිළුටු ප්‍රහීණ වී ඇත්නම්, පස් වැදෑරුම් සිත බැඳ තබන බැඳීම් මනාව මුලින් උදුරා දමා ඇත්නම්, ඔහුට යම් රාත්‍රියක් හෝ දවසක් එළඹේද, කුසල් දහම්හි දියුණුවම අපේක්ෂා කළ යුත්තක් මිස පිරිහීමක් නොවේ.\n\nකවරෙකුටද මේ පස් වැදෑරුම් සිතේ කිළුටු ප්‍රහීණ වී ඇත්තේ? මහණෙනි, මෙහිලා භික්ෂුව ශාස්තෘන් වහන්සේ කෙරෙහි සැක නොකරයි, විමතියට පත් නොවේ, අධිමුක්තිය ලබයි, පැහැදීමක් ඇත. මහණෙනි, යම් භික්ෂුවක් ශාස්තෘන් වහන්සේ කෙරෙහි සැක නොකරයි, විමතියට පත් නොවේ, අධිමුක්තිය ලබයි, පැහැදීමක් ඇත්ද, ඔහුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නැමෙයි. යම් කෙනෙකුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නැමෙයිද, මෙසේ ඔහුට මේ පළමු වන සිතේ කිළුටු ප්‍රහීණ වී ඇත්තේ වේ.\n\nතවද, මහණෙනි, භික්ෂුව ධර්මය කෙරෙහි සැක නොකරයි, විමතියට පත් නොවේ, අධිමුක්තිය ලබයි, පැහැදීමක් ඇත. සංඝයා කෙරෙහි සැක නොකරයි, විමතියට පත් නොවේ, අධිමුක්තිය ලබයි, පැහැදීමක් ඇත. ශික්ෂාව කෙරෙහි සැක නොකරයි, විමතියට පත් නොවේ, අධිමුක්තිය ලබයි, පැහැදීමක් ඇත. සබ්‍රහ්මචාරීන් කෙරෙහි කෝප වූයේ නොවේ, සතුටු වූයේ වේ, සිත ආඝාතයෙන් තොර වූයේ, සිතේ කිළිටි උපදවා නොගත්තේ වේ. මහණෙනි, යම් භික්ෂුවක් සබ්‍රහ්මචාරීන් කෙරෙහි කෝප වූයේ නොවේ, සතුටු වූයේ වේ, සිත ආඝාතයෙන් තොර වූයේ, සිතේ කිළිටි උපදවා නොගත්තේ වේද, ඔහුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නැමෙයි. යම් කෙනෙකුගේ සිත වීර්යය පිණිස, නිරන්තර යෙදීම පිණිස, නොකඩවා පවත්වාගෙන යාම පිණිස, වීර්යය කිරීම පිණිස නැමෙයිද, මෙසේ ඔහුට මේ පස්වන සිතේ කිළුටු ප්‍රහීණ වී ඇත්තේ වේ. ඔහුට මේ පස් වැදෑරුම් සිතේ කිළුටු ප්‍රහීණ වී ඇත්තේ වේ.\n\nකවරෙකුටද මේ සිත බැඳ තබන පස් වැදෑරුම් බැඳීම් මනාව මුලින් උදුරා දමා ඇත්තේ?\n\nමහණෙනි, මෙහි භික්ෂුවක් කාමයන් කෙරෙහි වීතරාගී වෙයි, ආශාව දුරු කළ තැනැත්තෙක් වෙයි, ප්‍රේමය දුරු කළ තැනැත්තෙක් වෙයි, පිපාසාව දුරු කළ තැනැත්තෙක් වෙයි, කාමයෙන් ඇතිවන තැවීම දුරු කළ තැනැත්තෙක් වෙයි, තෘෂ්ණාව දුරු කළ තැනැත්තෙක් වෙයි. මහණෙනි, යම් ඒ භික්ෂුවක් කාමයන් කෙරෙහි වීතරාගීව, ආශාව දුරු කර, ප්‍රේමය දුරු කර, පිපාසාව දුරු කර, තැවීම දුරු කර, තෘෂ්ණාව දුරු කර සිටීද, ඔහුගේ සිත වීර්යයට, නිරන්තර යෙදීමට, නොකඩවා පිළිපැදීමට හා ප්‍රධානයට නැඹුරු වෙයි. යම් කෙනෙකුගේ සිත වීර්යයට, නිරන්තර යෙදීමට, නොකඩවා පිළිපැදීමට හා ප්‍රධානයට නැඹුරු වෙයිද, මෙසේ ඔහුගේ පළමුවන චේතෝවිතිබන්ධය මැනවින් සිඳ බිඳ දමනු ලැබේ.\n\nමහණෙනි, තවද භික්ෂුව කය කෙරෙහි වීතරාගී වෙයි, රූපය කෙරෙහි ද වීතරාගී වෙයි. ඔහු බඩ පුරා අධිකව අනුභව කොට සයන සැපයට, ඇලවී සිටීමේ සැපයට, නිද්‍රා සැපයට ඇලුම් කරමින් නොවසයි. කිසියම් එක් දෙවි නිකායක් ප්‍රාර්ථනා කොට – ‘මේ සිලෙන් හෝ, ව්‍රතයෙන් හෝ, තපසින් හෝ, බ්‍රහ්මචර්යාවෙන් හෝ මම දෙවියෙක් හෝ, දෙවි කෙනෙකුට සමාන කෙනෙක් හෝ වන්නෙමි’යි – බ්‍රහ්මචර්යාව නොපුරයි. මහණෙනි, යම් ඒ භික්ෂුවක් කිසියම් දෙවි නිකායක් ප්‍රාර්ථනා කොට – ‘මේ සිලෙන් හෝ, ව්‍රතයෙන් හෝ, තපසින් හෝ, බ්‍රහ්මචර්යාවෙන් හෝ මම දෙවියෙක් හෝ, දෙවි කෙනෙකුට සමාන කෙනෙක් හෝ වන්නෙමි’යි – බ්‍රහ්මචර්යාව නොපුරයිද, ඔහුගේ සිත වීර්යයට, නිරන්තර යෙදීමට, නොකඩවා පිළිපැදීමට හා ප්‍රධානයට නැඹුරු වෙයි. යම් කෙනෙකුගේ සිත වීර්යයට, නිරන්තර යෙදීමට, නොකඩවා පිළිපැදීමට හා ප්‍රධානයට නැඹුරු වෙයිද, මෙසේ ඔහුගේ පස්වන චේතෝවිතිබන්ධය මැනවින් සිඳ බිඳ දමනු ලැබේ. ඔහුගේ මේ පස්වූ චේතෝවිතිබන්ධයෝ මැනවින් සිඳ බිඳ දමනු ලැබෙත්.\n\nමහණෙනි, යම්කිසි භික්ෂුවකට හෝ භික්ෂුණියකට හෝ මේ පස්වූ චේතෝඛිල ප්‍රහීණ වීද, මේ පස්වූ චේතෝවිතිබන්ධ මැනවින් සිඳ බිඳ දමනු ලැබීද, ඔහුට හෝ ඇයට යම් රාත්‍රියක් හෝ දිවා කාලයක් හෝ පැමිණෙන්නේද, කුසල ධර්මයන්හි වර්ධනයම මිස පිරිහීමක් අපේක්ෂා නොකළ යුතුය.\n\nමහණෙනි, යම් සේ ශුක්ල පක්ෂයේ චන්ද්‍රයාට යම් රාත්‍රියක් හෝ දිවා කාලයක් හෝ පැමිණෙන්නේද, වර්ණයෙන් වර්ධනය වෙයි, මණ්ඩලයෙන් වර්ධනය වෙයි, ආලෝකයෙන් වර්ධනය වෙයි, උස මහතින් වර්ධනය වෙයි; එසේම මහණෙනි, යම්කිසි භික්ෂුවකට හෝ භික්ෂුණියකට හෝ මේ පස්වූ චේතෝඛිල ප්‍රහීණ වීද, මේ පස්වූ චේතෝවිතිබන්ධ මැනවින් සිඳ බිඳ දමනු ලැබීද, ඔහුට හෝ ඇයට යම් රාත්‍රියක් හෝ දිවා කාලයක් හෝ පැමිණෙන්නේද, කුසල ධර්මයන්හි වර්ධනයම මිස පිරිහීමක් අපේක්ෂා නොකළ යුතුය.",
      "paliTitle": "Cetokhilasuttaṃ",
      "englishTitle": "Discourse on Mental Barrenness",
      "sinhalaTitle": "චේතෝඛිල සූත්‍රය"
    },
    {
      "number": 15,
      "pali": "‘‘Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññināsaññino vā, tathāgato tesaṃ aggamakkhāyati arahaṃ sammāsambuddho; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ [tesaṃ dhammānaṃ (sī. ka.) saṃ. ni. 5.139] aggamakkhāyati. ‘‘Seyyathāpi, bhikkhave, yāni kānici jaṅgalānaṃ [jaṅgamānaṃ (sī. pī.) saṃ. ni. 5.139] pāṇānaṃ padajātāni, sabbāni tāni hatthipade samodhānaṃ gacchanti, hatthipadaṃ tesaṃ aggamakkhāyati, yadidaṃ mahantattena; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyati. ‘‘Seyyathāpi, bhikkhave, kūṭāgārassa yā kāci gopānasiyo sabbā tā kūṭaṅgamā kūṭaninnā kūṭasamosaraṇā, kūṭo tāsaṃ aggamakkhāyati; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyati. ‘‘Seyyathāpi, bhikkhave, ye keci mūlagandhā, kāḷānusāriyaṃ tesaṃ aggamakkhāyati; evamevaṃ kho bhikkhave…pe…. ‘‘Seyyathāpi, bhikkhave, ye keci sāragandhā, lohitacandanaṃ tesaṃ aggamakkhāyati; evamevaṃ kho bhikkhave…pe…. ‘‘Seyyathāpi, bhikkhave, ye keci pupphagandhā, vassikaṃ tesaṃ aggamakkhāyati; evamevaṃ kho bhikkhave…pe…. ‘‘Seyyathāpi, bhikkhave, ye keci khuddarājāno [kuḍḍarājāno (sī. syā. pī.), kuṭṭarājāno, kūṭarājāno (ka.) a. ni. 6.53], sabbe te rañño cakkavattissa anuyantā bhavanti, rājā tesaṃ cakkavattī aggamakkhāyati; evamevaṃ kho, bhikkhave…pe…. ‘‘Seyyathāpi, bhikkhave, yā kāci tārakarūpānaṃ pabhā, sabbā tā candappabhāya kalaṃ nāgghanti soḷasiṃ, candappabhā tāsaṃ aggamakkhāyati; evamevaṃ kho, bhikkhave…pe…. ‘‘Seyyathāpi, bhikkhave, saradasamaye viddhe vigatavalāhake deve ādicco nabhaṃ abbhussakkamāno [abbhussukkamāno (sī.) saṃ. ni. 5.146-148] sabbaṃ ākāsagataṃ tamagataṃ abhivihacca bhāsate ca tapate ca virocati ca; evamevaṃ kho, bhikkhave…pe…. ‘‘Seyyathāpi, bhikkhave, yā kāci mahānadiyo, seyyathidaṃ – gaṅgā, yamunā, aciravatī, sarabhū, mahī, sabbā tā samuddaṅgamā samuddaninnā samuddapoṇā samuddapabbhārā, mahāsamuddo tāsaṃ aggamakkhāyati; evamevaṃ kho, bhikkhave, ye keci kusalā dhammā, sabbe te appamādamūlakā appamādasamosaraṇā. Appamādo tesaṃ aggamakkhāyatī’’ti. Pañcamaṃ.",
      "english": "Monks, whatever beings there are — those without feet, or with two feet, or with four feet, or with many feet; those with form, or those without form; those with perception, or those without perception, or those with neither perception nor non-perception — among them, the Tathāgata, the Arahant, the Perfectly Self-Awakened One, is declared to be the foremost. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, whatever footprints there are of living beings that roam, all of them fit within an elephant's footprint; the elephant's footprint is declared to be the foremost among them in terms of its great size. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, in a peaked house, whatever rafters there are, all of them incline towards the peak, converge on the peak, and meet at the peak; the peak is declared to be the foremost among them. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, among all root fragrances, black usīra is declared to be the foremost. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, among all heartwood fragrances, red sandalwood is declared to be the foremost. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, among all flower fragrances, jasmine is declared to be the foremost. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, whatever minor kings there are, all of them are subordinate to a universal monarch; the universal monarch is declared to be the foremost among them. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, whatever light there is from the star-forms, all of it is not worth a sixteenth part of the moon's radiance; the moon's radiance is declared to be the foremost among them. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, in the autumn season, when the sky is clear and free of clouds, the sun, rising in the firmament, dispels all darkness in the sky and shines, radiates warmth, and blazes forth. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.\n\nJust as, monks, whatever great rivers there are – namely, the Ganges, Yamuna, Aciravati, Sarabhu, and Mahi – all of them flow towards the ocean, incline towards the ocean, tend towards the ocean, and converge upon the ocean; the great ocean is declared to be the foremost among them. Even so, monks, whatever wholesome states there are, all of them have heedfulness as their root and converge upon heedfulness. Heedfulness is declared to be the foremost among them.",
      "sinhala": "භික්ෂූණි, යම්තාක් සත්ත්වයෝ පාද නැත්තාහු හෝ, දෙපා ඇත්තාහු හෝ, සිවුපා ඇත්තාහු හෝ, බොහෝ පා ඇත්තාහු හෝ, රූප ඇත්තාහු හෝ, රූප නැත්තාහු හෝ, සංඥා ඇත්තාහු හෝ, සංඥා නැත්තාහු හෝ, නේවසංඥානාසංඥා ඇත්තාහු හෝ වෙත්ද, ඒ සියල්ලන් අතුරින් අරහත් වූ සම්මාසම්බුදු වූ තථාගතයන් වහන්සේ අග්‍ර යැයි කියනු ලැබේ. භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, ඇවිදින සතුන්ගේ යම් පා සටහන් කෙනෙක් වෙත්ද, ඒ සියල්ලෝ හස්ති පදයට ඇතුළත් වෙත්ද, හස්ති පදය විශාලත්වය නිසා ඒ සියල්ලන් අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, කූටාගාරයක යම් වහලෙ පොළු කෙනෙක් වෙත්ද, ඒ සියල්ලෝ මුදුනට ගියාවූ, මුදුනට නැමුණාවූ, මුදුනෙහි අවසන් වන්නාවූ වෙත්ද, මුදුන ඒ වහලෙ පොළු අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, යම්කිසි මුල් සුවඳ වර්ග කෙනෙක් වෙත්ද, කළු අනුසාරිය ඒ මුල් සුවඳ අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, යම්කිසි සාර සුවඳ වර්ග කෙනෙක් වෙත්ද, රත් සඳුන් ඒ සාර සුවඳ අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, යම්කිසි පුෂ්ප සුවඳ වර්ග කෙනෙක් වෙත්ද, සේපාලිකා ඒ පුෂ්ප සුවඳ අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, යම්කිසි කුඩා රජවරු කෙනෙක් වෙත්ද, ඒ සියල්ලෝ සක්විති රජුට යටත් වෙත්ද, සක්විති රජ ඒ රජවරුන් අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, යම්කිසි තාරකා රූපයන්ගේ ආලෝකයක් වෙත්ද, ඒ සියල්ලෝ චන්ද්‍රයාගේ ආලෝකයේ සොළොස් කලාවෙන් එක කලාවක් වටින්නේ නැත්ද, චන්ද්‍ර ප්‍රභාව ඒ ආලෝකයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, සරත් සමයෙහි වැහි වලාකුළු පහව ගිය, අහස නිදොස් වූ විට හිරු නැගී එන්නේ, අහසේ ඇති සියලු අඳුර දුරු කොට බබළයි ද, තපනය කරයි ද, ප්‍රභාවත් වෙයි ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.\n\nභික්ෂූණි, යම්සේ, යම්කිසි මහ ගංගා කෙනෙක් වෙත්ද, එනම් – ගංගා, යමුනා, අචිරවතී, සරභූ, මහී යන මේ සියල්ලෝ සාගරයට යන්නාහු වෙත්ද, සාගරය වෙත නැමුණාහු වෙත්ද, සාගරය වෙත බර වූවාහු වෙත්ද, සාගරය වෙත බෑවුම් වූවාහු වෙත්ද, මහා සාගරය ඒ ගංගා අතුරින් අග්‍ර යැයි කියනු ලැබේ ද; භික්ෂූණි, එසේම, යම් කිසි කුසල ධර්ම කෙනෙක් වෙත්ද, ඒ සියල්ලෝ අප්‍රමාදය මුල් කොට ඇත්තෝ වෙති, අප්‍රමාදයෙහිම අවසන් වන්නෝ වෙති. අප්‍රමාදය ඒ ධර්මයන් අතුරින් අග්‍ර යැයි කියනු ලැබේ.",
      "paliTitle": "Appamādasuttaṃ",
      "englishTitle": "Discourse on Heedfulness",
      "sinhalaTitle": "අප්‍රමාද සූත්‍රය"
    },
    {
      "number": 16,
      "pali": "‘‘Dasayime, bhikkhave, puggalā āhuneyyā pāhuneyyā dakkhiṇeyyā añjalikaraṇīyā anuttaraṃ puññakkhettaṃ lokassa. Katame dasa? Tathāgato arahaṃ sammāsambuddho, paccekabuddho, ubhatobhāgavimutto, paññāvimutto, kāyasakkhī, diṭṭhippatto, saddhāvimutto, saddhānusārī, dhammānusārī, gotrabhū – ime kho, bhikkhave, dasa puggalā āhuneyyā…pe… anuttaraṃ puññakkhettaṃ lokassā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these ten individuals are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence with clasped hands, and are the unsurpassed field of merit for the world. Which ten? The Realized One, the Worthy One, the Perfectly Self-Awakened One; a Solitary Buddha; one liberated in both ways; one liberated by wisdom; a body-witness; one attained to view; one liberated by faith; a faith-follower; a Dhamma-follower; and one who has transcended lineage. Monks, these ten individuals are worthy of offerings, worthy of hospitality, worthy of gifts, worthy of reverence with clasped hands, and are the unsurpassed field of merit for the world.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ දස දෙනා ආහුණෙය්‍ය වෙත්, පාහුණෙය්‍ය වෙත්, දක්ඛිණෙය්‍ය වෙත්, ඇඳිලි පූජා ලැබීමට සුදුසු වෙත්, ලෝකයාට අනුත්තර වූ පුණ\\u200d්‍යක්ෂේත\\u200d්‍රයක් වෙත්. කවරහුද ඒ දස දෙනා?\n\nතථාගත අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ, පසේබුදුරජාණන් වහන්සේ, උභතෝභාගවිමුක්ත පුද්ගලයා, ප\\u200d්‍රඥාවිමුක්ත පුද්ගලයා, කායසාක්ෂී පුද්ගලයා, දෘෂ්ටිප\\u200d්‍රාප්ත පුද්ගලයා, ශ\\u200d්‍රද්ධාවිමුක්ත පුද්ගලයා, ශ\\u200d්‍රද්ධානුසාරී පුද්ගලයා, ධම්මානුසාරී පුද්ගලයා, ගෝත\\u200d්‍රභූ පුද්ගලයා යන මොහුයි.\n\nමහණෙනි, මේ දස පුද්ගලයෝ ආහුණෙය්‍ය වෙත්, පාහුණෙය්‍ය වෙත්, දක්ඛිණෙය්‍ය වෙත්, ඇඳිලි පූජා ලැබීමට සුදුසු වෙත්, ලෝකයාට අනුත්තර වූ පුණ\\u200d්‍යක්ෂේත\\u200d්‍රයක් වෙත්.",
      "paliTitle": "Āhuneyyasuttaṃ",
      "englishTitle": "The Worthy of Offerings Discourse",
      "sinhalaTitle": "ආහුණෙය්‍ය සූත්‍රය"
    },
    {
      "number": 17,
      "pali": "[dī. ni. 3.345, 360] ‘‘Sanāthā, bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Dasayime, bhikkhave, nāthakaraṇā dhammā. Katame dasa? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Yampi, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ [sātthā sabyañjanā (sī.)] kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā [bahū sutā (?)] honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā. Yampi, bhikkhave, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. Yampi, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato, khamo padakkhiṇaggāhī anusāsaniṃ. Yampi, bhikkhave, bhikkhu suvaco hoti…pe… anusāsaniṃ, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni, tattha dakkho hoti analaso tatrūpāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātuṃ. Yampi, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ…pe… alaṃ kātuṃ alaṃ saṃvidhātuṃ, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo. Yampi, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu. Yampi, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. Yampi, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā. Yampi, bhikkhave, bhikkhu satimā hoti paramena satinepakkena samannāgato cirakatampi cirabhāsitampi saritā anussaritā, ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. Yampi, bhikkhave, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā, ayampi dhammo nāthakaraṇo. ‘‘Sanāthā, bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Ime kho, bhikkhave, dasa nāthakaraṇā dhammā’’ti. Sattamaṃ.",
      "english": "Monks, dwell with a protector, not without one. Monks, one who dwells without a protector lives miserably. Monks, these ten qualities are protective. Which ten? Here, monks, a monk is virtuous; he dwells restrained by the restraint of the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, and undertaking the training rules. Monks, that a monk is virtuous, dwells restrained by the restraint of the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, and undertaking the training rules, this quality too is protective.\n\nFurthermore, monks, a monk is learned, one who remembers what he has heard, one who has accumulated what he has heard; those teachings that are good in the beginning, good in the middle, and good in the end, with meaning and with letter, proclaiming the utterly complete and purified holy life—such teachings are much heard by him, held in mind, familiarized by speech, contemplated by mind, and thoroughly penetrated by view. Monks, that a monk is learned, one who remembers what he has heard, one who has accumulated what he has heard; those teachings that are good in the beginning, good in the middle, and good in the end, with meaning and with letter, proclaiming the utterly complete and purified holy life—such teachings are much heard by him, held in mind, familiarized by speech, contemplated by mind, and thoroughly penetrated by view, this quality too is protective.\n\nFurthermore, monks, a monk has noble friends, noble companions, noble associates. Monks, that a monk has noble friends, noble companions, noble associates, this quality too is protective.\n\nFurthermore, monks, a monk is amenable, endowed with qualities that make him easy to admonish, patient, and readily accepts instruction. Monks, that a monk is amenable, endowed with qualities that make him easy to admonish, patient, and readily accepts instruction, this quality too is protective.\n\nFurthermore, monks, a monk is skillful and diligent in various duties of his fellow practitioners; he is endowed with an investigative approach suitable for those duties, able to do them and able to arrange them. Monks, that a monk is skillful and diligent in various duties of his fellow practitioners, endowed with an investigative approach suitable for those duties, able to do them and able to arrange them, this quality too is protective.\n\nFurthermore, monks, a monk is one who loves the Dhamma, delights in discussing it, and feels immense joy in the Abhidhamma and Abhivinaya. Monks, that a monk is one who loves the Dhamma, delights in discussing it, and feels immense joy in the Abhidhamma and Abhivinaya, this quality too is protective.\n\nFurthermore, monks, a monk dwells with aroused energy for the abandoning of unwholesome qualities and for the acquiring of wholesome qualities; he is strong, firm in effort, and does not cast off the burden in wholesome qualities. Monks, that a monk dwells with aroused energy for the abandoning of unwholesome qualities and for the acquiring of wholesome qualities; he is strong, firm in effort, and does not cast off the burden in wholesome qualities, this quality too is protective.\n\nFurthermore, monks, a monk is content with any robes, almsfood, lodging, and medicinal requisites for the sick. Monks, that a monk is content with any robes, almsfood, lodging, and medicinal requisites for the sick, this quality too is protective.\n\nFurthermore, monks, a monk is mindful, endowed with supreme mindfulness and clear comprehension, remembering and recalling what was done and said long ago. Monks, that a monk is mindful, endowed with supreme mindfulness and clear comprehension, remembering and recalling what was done and said long ago, this quality too is protective.\n\nFurthermore, monks, a monk is wise, endowed with the wisdom that discerns rise and fall, noble and penetrating, leading to the complete destruction of suffering. Monks, that a monk is wise, endowed with the wisdom that discerns rise and fall, noble and penetrating, leading to the complete destruction of suffering, this quality too is protective.\n\nMonks, dwell with a protector, not without one. Monks, one who dwells without a protector lives miserably. Monks, these are the ten protective qualities.",
      "sinhala": "මහණෙනි, පිහිට සහිතව වාසය කරව, පිහිට රහිතව නොවසව. මහණෙනි, පිහිටක් නැති පුද්ගලයා දුකින් වාසය කරයි. මහණෙනි, මේ දස ධර්‍මයෝ පිහිට කරවන සුළු වෙති. කවර දසයක්ද යත්:\n\nමහණෙනි, මෙහිලා මහණෙක් සිල්වත් වෙයි. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, ආචාර සම්පන්න වූයේ, ගෝචර සම්පන්න වූයේ, අණු මාත්‍ර වූ වරදෙහිද භය දක්නේ, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් සිල්වත් වෙයි... ශික්ෂා පදයන් සමාදන්ව හික්මෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් බහුශ්‍රැත වෙයි. ඇසූ දේ ධාරණය කරන්නේ, ඇසූ දේ එක්රැස් කරගන්නේ වෙයි. යම් ඒ ධර්‍මයෝ ආදිකල්‍යාණ, මධ්‍යකල්‍යාණ, පරියෝසානකල්‍යාණ (මුල, මැද, අග යන තැන්හි යහපත් වූ), අර්ථ සහිත වූ, ව්‍යංජන (වචන) සහිත වූ, මුළුමනින්ම සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්‍යාව (උතුම් පැවතුම) ප්‍රකාශ කරත්ද, එබඳු ධර්‍මයෝ ඔහු විසින් බොහෝ සෙයින් අසන ලද්දාහු වෙති. ධාරණය කරන ලද්දාහු වෙති, වචනයෙන් හඳුන්වන ලද්දාහු වෙති, මනසින් විමසන ලද්දාහු වෙති, දෘෂ්ඨියෙන් (ප්‍රඥාවෙන්) මනාව අවබෝධ කරන ලද්දාහු වෙති. මහණෙනි, යම් හෙයකින් මහණෙක් බහුශ්‍රැත වෙයි... දෘෂ්ඨියෙන් මනාව අවබෝධ කරන ලද්දාහු වෙති, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් කල්‍යාණ මිත්‍රයෙක් වෙයි, කල්‍යාණ සහායෙක් වෙයි, කල්‍යාණ සම්පවංක (කල්‍යාණ වූ අය ඇසුරු කරන්නේ) වෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් කල්‍යාණ මිත්‍රයෙක් වෙයි... කල්‍යාණ සම්පවංක වෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් සුඛවච (කීකරු) වෙයි. සුඛවචභාවය ඇති කරවන ධර්‍මයන්ගෙන් යුක්ත වෙයි. ඉවසීමෙන් යුක්ත වූයේ, අනුශාසනාව දක්ෂිණාග්‍රාහීව (ගෞරවයෙන්) පිළිගන්නා සුළු වෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් සුඛවච වෙයි... අනුශාසනාව පිළිගන්නා සුළු වෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් තමන්ගේ සබ්‍රහ්මචාරීන්ට අදාළ වන යම් ඒ උස් පහත් (විවිධ) කටයුතු ඇත්ද, එහිලා දක්ෂ වෙයි. අලස නොවන්නේ, ඒ කටයුතුවලට අදාළ ප්‍රඥාවන්ත විමර්ශනයෙන් යුක්ත වෙයි. (ඒ කටයුතු) කිරීමට සමත් වෙයි, සංවිධානය කිරීමට ද සමත් වෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් තමන්ගේ සබ්‍රහ්මචාරීන්ට අදාළ වන... සංවිධානය කිරීමට ද සමත් වෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් ධර්‍මයට කැමති වෙයි. ප්‍රිය වචන ඇති වෙයි (ධර්‍ම කථාවට ප්‍රිය වෙයි). අභිධර්‍මය හා අභිවිනය පිළිබඳව උදාර ප්‍රමෝදයෙන් යුක්ත වෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් ධර්‍මයට කැමති වෙයි... අභිධර්‍මය හා අභිවිනය පිළිබඳව උදාර ප්‍රමෝදයෙන් යුක්ත වෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් අකුසල ධර්‍මයන් ප්‍රහීණ කිරීම පිණිසත්, කුසල ධර්‍මයන් උපදවා ගැනීම පිණිසත්, වීර්යය අරඹා වාසය කරයි. ශක්තිමත් වූයේ, දැඩි පරාක්‍රමයෙන් යුක්ත වූයේ, කුසල ධර්‍මයන්හිදී තම වගකීම අත් නොහරින්නේ වෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් අකුසල ධර්‍මයන් ප්‍රහීණ කිරීම පිණිසත්... කුසල ධර්‍මයන්හිදී තම වගකීම අත් නොහරින්නේ වෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් යම් කිසි චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකරකින් සතුටු වෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් යම් කිසි චීවර, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකරකින් සතුටු වෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් සිහි නුවණින් යුක්ත වෙයි. උතුම් වූ සිහි නුවණින් යුක්ත වූයේ, බොහෝ කලකට පෙර කරන ලද දෙයක් වුවද, බොහෝ කලකට පෙර කියන ලද දෙයක් වුවද සිහි කරන්නේ, නැවත සිහිපත් කරන්නේ වෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් සිහි නුවණින් යුක්ත වෙයි... බොහෝ කලකට පෙර කියන ලද දෙයක් වුවද සිහි කරන්නේ, නැවත සිහිපත් කරන්නේ වෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, නැවත අනෙකක් නම් මහණෙක් ප්‍රඥාවන්ත වෙයි. උදයව්යය (හටගැනීම හා නැතිවීම) දක්නා ප්‍රඥාවෙන් යුක්ත වූයේ, ආර්ය වූ, කෙලෙස් විද බිඳින සුළු වූ, මනා කොට දුක් ක්ෂය කිරීමට පවත්නා ප්‍රඥාවෙන් යුක්ත වෙයි. මහණෙනි, යම් හෙයකින් මහණෙක් ප්‍රඥාවන්ත වෙයි... මනා කොට දුක් ක්ෂය කිරීමට පවත්නා ප්‍රඥාවෙන් යුක්ත වෙයි, මේ ධර්‍මය ද පිහිට කරවන සුළුය.\n\nමහණෙනි, පිහිට සහිතව වාසය කරව, පිහිට රහිතව නොවසව. මහණෙනි, පිහිටක් නැති පුද්ගලයා දුකින් වාසය කරයි. මහණෙනි, මේ දස ධර්‍මයෝ පිහිට කරවන සුළු වෙති.",
      "paliTitle": "Paṭhamanāthasuttaṃ",
      "englishTitle": "The First Discourse on Refuge",
      "sinhalaTitle": "පළමු නාථ සූත‍්‍රය"
    },
    {
      "number": 18,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Sanāthā, bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Dasayime, bhikkhave, nāthakaraṇā dhammā. Katame dasa? Idha, bhikkhave, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. ‘Sīlavā vatāyaṃ bhikkhu pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesū’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā. ‘Bahussuto vatāyaṃ bhikkhu sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu kalyāṇamitto hoti kalyāṇasahāyo kalyāṇasampavaṅko. ‘Kalyāṇamitto vatāyaṃ bhikkhu kalyāṇasahāyo kalyāṇasampavaṅko’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu suvaco hoti sovacassakaraṇehi dhammehi samannāgato, khamo padakkhiṇaggāhī anusāsaniṃ. ‘Suvaco vatāyaṃ bhikkhu sovacassakaraṇehi dhammehi samannāgato, khamo padakkhiṇaggāhī anusāsani’nti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni, tattha dakkho hoti analaso, tatrūpāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātuṃ. ‘Yāni tāni sabrahmacārīnaṃ uccāvacāni kiṃkaraṇīyāni, tattha dakkho vatāyaṃ bhikkhu analaso, tatrūpāyāya vīmaṃsāya samannāgato, alaṃ kātuṃ alaṃ saṃvidhātu’nti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dhammakāmo hoti piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo. ‘Dhammakāmo vatāyaṃ bhikkhu piyasamudāhāro, abhidhamme abhivinaye uḷārapāmojjo’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu āraddhavīriyo viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesu ‘āraddhavīriyo vatāyaṃ bhikkhu viharati akusalānaṃ dhammānaṃ pahānāya, kusalānaṃ dhammānaṃ upasampadāya, thāmavā daḷhaparakkamo anikkhittadhuro kusalesu dhammesū’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu santuṭṭho hoti itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. ‘Santuṭṭho vatāyaṃ bhikkhu itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārenā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu satimā hoti paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā. ‘Satimā vatāyaṃ bhikkhu paramena satinepakkena samannāgato, cirakatampi cirabhāsitampi saritā anussaritā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa majjhimānukampitassa navānukampitassa vuddhiyeva pāṭikaṅkhā kusalesu dhammesu, no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Puna caparaṃ, bhikkhave, bhikkhu paññavā hoti udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā. ‘Paññavā vatāyaṃ bhikkhu udayatthagāminiyā paññāya samannāgato ariyāya nibbedhikāya sammā dukkhakkhayagāminiyā’ti therāpi naṃ bhikkhū vattabbaṃ anusāsitabbaṃ maññanti, majjhimāpi bhikkhū… navāpi bhikkhū vattabbaṃ anusāsitabbaṃ maññanti. Tassa therānukampitassa…pe… no parihāni. Ayampi dhammo nāthakaraṇo. ‘‘Sanāthā, bhikkhave, viharatha, mā anāthā. Dukkhaṃ, bhikkhave, anātho viharati. Ime kho, bhikkhave, dasa nāthakaraṇā dhammā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Aṭṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s monastery. There the Blessed One addressed the monks, saying, “Monks!”\n“Venerable Sir,” they replied to the Blessed One. The Blessed One said this: “Live with a protector, monks, not without one. It is suffering, monks, to live without a protector. There are these ten qualities, monks, that serve as a protector. Which ten?\n\nHere, monks, a monk is virtuous. Elder monks, middle monks, and newly ordained monks consider him worthy of being spoken to and advised, thinking: ‘This monk truly dwells restrained by the Pātimokkha restraint, endowed with good conduct and resort, seeing danger in the slightest faults, and undertakes and trains in the training rules.’ For one who receives such regard from elder monks, middle monks, and newly ordained monks, growth is to be expected in wholesome qualities, not decline. This quality, too, serves as a protector.\n\nAgain, monks, a monk is learned. Elder monks, middle monks, and newly ordained monks consider him worthy of being spoken to and advised, thinking: ‘This monk truly is learned, a preserver of what he has heard, an accumulator of what he has heard. Those teachings that are good in the beginning, good in the middle, and good in the end, with meaning and with letter, declaring the perfectly complete and pure holy life—such teachings are extensively learned by him, retained, recited verbally, mentally investigated, and thoroughly comprehended by wisdom.’ For one who receives such regard from elder monks, middle monks, and newly ordained monks, growth is to be expected in wholesome qualities, not decline. This quality, too, serves as a protector.\n\nAgain, monks, a monk has noble friends, noble companions, and noble associates. Elder monks, middle monks, and newly ordained monks consider him worthy of being spoken to and advised, thinking: ‘This monk truly has noble friends, noble companions, and noble associates.’ For one who receives such regard from elder monks, middle monks, and newly ordained monks, growth is to be expected in wholesome qualities, not decline. This quality, too, serves as a protector.\n\nAgain, monks, a monk is amenable to correction, endowed with qualities that make one easy to admonish, patient, and accepts instruction with deference. Elder monks, middle monks, and newly ordained monks consider him worthy of being spoken to and advised, thinking: ‘This monk truly is amenable to correction, endowed with qualities that make one easy to admonish, patient, and accepts instruction with deference.’ For one who receives such regard from elder monks, middle monks, and newly ordained monks, growth is to be expected in wholesome qualities, not decline. This quality, too, serves as a protector.\n\nAgain, monks, concerning the various duties of his fellow practitioners, a monk is skillful and not lazy, endowed with an astute analytical approach to the task at hand, capable of doing and capable of organizing. Elder monks, middle monks, and newly ordained monks consider him worthy of being spoken to and advised, thinking: ‘This monk truly is skillful and not lazy concerning the various duties of his fellow practitioners, endowed with an astute analytical approach to the task at hand, capable of doing and capable of organizing.’ For one who receives such regard from elder monks, middle monks, and newly ordained monks, growth is to be expected in wholesome qualities, not decline. This quality, too, serves as a protector.\n\nAgain, monks, a monk is one who loves the Dhamma, takes pleasure in discussing it, and finds great joy in the Abhidhamma and Abhivinaya. Elder monks, middle monks, and newly ordained monks consider him worthy of being spoken to and advised, thinking: ‘This monk truly is one who loves the Dhamma, takes pleasure in discussing it, and finds great joy in the Abhidhamma and Abhivinaya.’ For one who receives such regard from elder monks, middle monks, and newly ordained monks, growth is to be expected in wholesome qualities, not decline. This quality, too, serves as a protector.\n\nAgain, monks, a monk lives with aroused energy for the abandoning of unwholesome qualities and for the acquisition of wholesome qualities; he possesses strength, is firm in endeavor, and does not cast off the burden of practice regarding wholesome qualities. Elder monks, middle monks, and newly ordained monks consider him worthy of being spoken to and advised, thinking: ‘This monk truly lives with aroused energy for the abandoning of unwholesome qualities and for the acquisition of wholesome qualities; he possesses strength, is firm in endeavor, and does not cast off the burden of practice regarding wholesome qualities.’\n\nFor one who is regarded with compassion by the senior monks, by the middle monks, and by the junior monks, only growth in wholesome qualities is to be expected, not decline. This quality, too, provides a refuge.\n\nFurthermore, monks, a monk is content with any robes, almsfood, lodgings, and medicinal requisites for the sick. 'This monk is indeed content with any robes, almsfood, lodgings, and medicinal requisites for the sick,' think the senior monks, deeming him worthy of being spoken to and instructed; the middle monks also think he should be spoken to and instructed; and the junior monks also think he should be spoken to and instructed. For one who is regarded with compassion by the senior monks, by the middle monks, and by the junior monks, only growth in wholesome qualities is to be expected, not decline. This quality, too, provides a refuge.\n\nFurthermore, monks, a monk is mindful, endowed with supreme mindfulness and discretion, remembering and recollecting what was done and said long ago. 'This monk is indeed mindful, endowed with supreme mindfulness and discretion, remembering and recollecting what was done and said long ago,' think the senior monks, deeming him worthy of being spoken to and instructed; the middle monks also think he should be spoken to and instructed; and the junior monks also think he should be spoken to and instructed. For one who is regarded with compassion by the senior monks, by the middle monks, and by the junior monks, only growth in wholesome qualities is to be expected, not decline. This quality, too, provides a refuge.\n\nFurthermore, monks, a monk is wise, endowed with wisdom that discerns rise and fall, noble and penetrating, leading to the complete destruction of suffering. 'This monk is indeed wise, endowed with wisdom that discerns rise and fall, noble and penetrating, leading to the complete destruction of suffering,' think the senior monks, deeming him worthy of being spoken to and instructed; the middle monks also think he should be spoken to and instructed; and the junior monks also think he should be spoken to and instructed. For one who is regarded with compassion by the senior monks, by the middle monks, and by the junior monks, only growth in wholesome qualities is to be expected, not decline. This quality, too, provides a refuge.\n\nDwell, monks, with a refuge, not without a refuge. It is in suffering, monks, that one dwells without a refuge. These, monks, are the ten qualities that provide a refuge. The Blessed One said this. Those monks were delighted and rejoiced in the Blessed One’s words.",
      "sinhala": "මා හට මෙසේ අසන ලදී.\n\nඑක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් වූ අනාථපිණ්ඩික සිටුහුගේ ආරාමයෙහි වැඩසිටියහ. එසමයෙහි භාග්‍යවතුන් වහන්සේ භික්ෂූන්ට ආමන්ත්‍රණය කළ සේක: “මහණෙනි” කියා. “වහන්සැ”යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n“මහණෙනි, පිහිට සහිතව වාසය කරව්, පිහිට නැතිව වාසය නොකරව්. මහණෙනි, පිහිටක් නොමැතිව වාසය කරන්නා දුක් විඳී. මහණෙනි, මේ දස ධර්මයන් පිහිට ඇති කරන්නාහ. කවරේද ඒ දසය?\n\nමහණෙනි, මෙහිලා භික්ෂුව සීලවන්තයෙක් වෙයි, පාරිමෝක්ෂ සංවරයෙන් (ආත්මාරක්ෂාව පිණිස ඇති සිල්වෙන්) සංවර වූවෙක්ව, ආචාර ගෝචර සම්පන්නව, අල්ප මාත්‍ර වූ වරදෙහි ද භය දක්නෙක්ව, ශික්ෂා පදයන් සමාදන්ව හික්මෙමින් වාසය කරයි. ‘මෙම භික්ෂුව පාරිමෝක්ෂ සංවරයෙන් සංවර වූවෙක්ව, ආචාර ගෝචර සම්පන්නව, අල්ප මාත්‍ර වූ වරදෙහි ද භය දක්නෙක්ව, ශික්ෂා පදයන් සමාදන්ව හික්මෙමින් වාසය කරන්නේය’යි ථෙර භික්ෂූහු ද ඔහුට (තවදුරටත්) අවවාද කළ යුතු බවත්, අනුශාසනා කළ යුතු බවත් සලකති, මධ්‍යම භික්ෂූහු ද සලකති, නවක භික්ෂූහු ද සලකති. ථෙර භික්ෂූන්ගේ අනුකම්පාවට, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට, නවක භික්ෂූන්ගේ අනුකම්පාවට පාත්‍ර වූ, (එබඳු) ඔහු තුළ කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත. මේ ධර්මය ද පිහිට ඇති කරන්නකි.\n\nතවද මහණෙනි, මෙහිලා භික්ෂුව බහුශ්‍රැත (බොහෝ ඇසූ පිරූ තැන් ඇති) අයෙක් වෙයි, සූත්‍ර ධර්මයන් දරන්නෙකි, සූත්‍ර ධර්මයන් රැස්කරන්නෙකි. යම් ධර්ම දේශනා ආදියෙන්, ‘ආදිකල්‍යාණ, මධ්‍යකල්‍යාණ, පරියෝසානකල්‍යාණ’ (ආදියෙන් උතුම් වූ), අර්ථ සහිත වූ, ව්‍යංජන (වචන) සහිත වූ, මුළුමනින්ම සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව (ශ්‍රේෂ්ඨ ජීවිතය) ප්‍රකාශ කරන්නේ ද, එබඳු ධර්මයන් ඔහුට බොහෝ සෙයින් අසා පුරුදු ය (බහුශ්‍රැතය); ඒවා (ඔහු විසින්) ධාරණය කරනු ලැබී ය, වචනයෙන් මැනවින් හුරු කරනු ලැබී ය, මනසින් මෙනෙහි කරනු ලැබී ය, දෘෂ්ටියෙන් (නුවණින්) මැනවින් විනිවිද දකිනු ලැබී ය. ‘මෙම භික්ෂුව බොහෝ ඇසූ පිරූ තැන් ඇති අයෙකි, සූත්‍ර ධර්මයන් දරන්නෙකි, සූත්‍ර ධර්මයන් රැස්කරන්නෙකි, යම් ධර්ම දේශනා ආදියෙන්, ‘ආදිකල්‍යාණ, මධ්‍යකල්‍යාණ, පරියෝසානකල්‍යාණ’ (ආදියෙන් උතුම් වූ), අර්ථ සහිත වූ, ව්‍යංජන (වචන) සහිත වූ, මුළුමනින්ම සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේ ද, එබඳු ධර්මයන් ඔහුට බොහෝ සෙයින් අසා පුරුදු ය, ඒවා ධාරණය කරනු ලැබී ය, වචනයෙන් මැනවින් හුරු කරනු ලැබී ය, මනසින් මෙනෙහි කරනු ලැබී ය, දෘෂ්ටියෙන් මැනවින් විනිවිද දකිනු ලැබී ය’යි ථෙර භික්ෂූහු ද ඔහුට අවවාද කළ යුතු බවත්, අනුශාසනා කළ යුතු බවත් සලකති, මධ්‍යම භික්ෂූහු ද සලකති, නවක භික්ෂූහු ද සලකති. ථෙර භික්ෂූන්ගේ අනුකම්පාවට, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට, නවක භික්ෂූන්ගේ අනුකම්පාවට පාත්‍ර වූ, (එබඳු) ඔහු තුළ කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත. මේ ධර්මය ද පිහිට ඇති කරන්නකි.\n\nතවද මහණෙනි, මෙහිලා භික්ෂුව කල්‍යාණ මිත්‍රයෙක් වෙයි, කල්‍යාණ සහායයෙක් වෙයි, කල්‍යාණ සම්පවංක (කල්‍යාණ මිත්‍රයන් සමඟ සමීප සබඳතා ඇති) අයෙක් වෙයි. ‘මෙම භික්ෂුව කල්‍යාණ මිත්‍රයෙකි, කල්‍යාණ සහායයෙකි, කල්‍යාණ සම්පවංකයෙකි’යි ථෙර භික්ෂූහු ද ඔහුට අවවාද කළ යුතු බවත්, අනුශාසනා කළ යුතු බවත් සලකති, මධ්‍යම භික්ෂූහු ද සලකති, නවක භික්ෂූහු ද සලකති. ථෙර භික්ෂූන්ගේ අනුකම්පාවට, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට, නවක භික්ෂූන්ගේ අනුකම්පාවට පාත්‍ර වූ, (එබඳු) ඔහු තුළ කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත. මේ ධර්මය ද පිහිට ඇති කරන්නකි.\n\nතවද මහණෙනි, මෙහිලා භික්ෂුව සුපේශල (මැනවින් අවවාද පිළිගන්නා) අයෙක් වෙයි, පහසුවෙන් අවවාද පිළිගත හැකි ගුණධර්මයන්ගෙන් යුක්ත වෙයි, ඉවසීමෙන් යුක්ත වෙයි, අනුශාසනා මැනවින් පිළිගන්නෙක් වෙයි. ‘මෙම භික්ෂුව සුපේශල අයෙකි, පහසුවෙන් අවවාද පිළිගත හැකි ගුණධර්මයන්ගෙන් යුක්තය, ඉවසීමෙන් යුක්තය, අනුශාසනා මැනවින් පිළිගන්නෙක්ය’යි ථෙර භික්ෂූහු ද ඔහුට අවවාද කළ යුතු බවත්, අනුශාසනා කළ යුතු බවත් සලකති, මධ්‍යම භික්ෂූහු ද සලකති, නවක භික්ෂූහු ද සලකති. ථෙර භික්ෂූන්ගේ අනුකම්පාවට, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට, නවක භික්ෂූන්ගේ අනුකම්පාවට පාත්‍ර වූ, (එබඳු) ඔහු තුළ කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත. මේ ධර්මය ද පිහිට ඇති කරන්නකි.\n\nතවද මහණෙනි, මෙහිලා භික්ෂුව සබ්‍රහ්මචාරීන්ගේ යම් උස් පහත් කටයුතු (බහුවිධ කටයුතු) ඇත්තේ ද, ඒ කටයුතු සම්බන්ධයෙන් දක්ෂ වෙයි, කම්මැලි නොවේ, ඒ කටයුතු සඳහා යෝග්‍ය වූ විමර්ශනයකින් යුක්ත වෙයි, ඒවා කිරීමට ද, ඒවා සංවිධානය කිරීමට ද සමත් වෙයි. ‘මෙම භික්ෂුව සබ්‍රහ්මචාරීන්ගේ යම් උස් පහත් කටයුතු ඇත්තේ ද, ඒ කටයුතු සම්බන්ධයෙන් දක්ෂය, කම්මැලි නොවේ, ඒ කටයුතු සඳහා යෝග්‍ය වූ විමර්ශනයකින් යුක්තය, ඒවා කිරීමට ද, ඒවා සංවිධානය කිරීමට ද සමත්ය’යි ථෙර භික්ෂූහු ද ඔහුට අවවාද කළ යුතු බවත්, අනුශාසනා කළ යුතු බවත් සලකති, මධ්‍යම භික්ෂූහු ද සලකති, නවක භික්ෂූහු ද සලකති. ථෙර භික්ෂූන්ගේ අනුකම්පාවට, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට, නවක භික්ෂූන්ගේ අනුකම්පාවට පාත්‍ර වූ, (එබඳු) ඔහු තුළ කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත. මේ ධර්මය ද පිහිට ඇති කරන්නකි.\n\nතවද මහණෙනි, මෙහිලා භික්ෂුව ධර්මයට කැමති අයෙක් වෙයි, (ධර්මය) ප්‍රියවශයෙන් කතා කරන්නෙක් වෙයි, අභිධර්මයෙහි ද අභිවිනයෙහි ද මහත් ප්‍රමෝදයෙන් යුක්ත වෙයි. ‘මෙම භික්ෂුව ධර්මයට කැමති අයෙකි, ප්‍රියවශයෙන් කතා කරන්නෙකි, අභිධර්මයෙහි ද අභිවිනයෙහි ද මහත් ප්‍රමෝදයෙන් යුක්තය’යි ථෙර භික්ෂූහු ද ඔහුට අවවාද කළ යුතු බවත්, අනුශාසනා කළ යුතු බවත් සලකති, මධ්‍යම භික්ෂූහු ද සලකති, නවක භික්ෂූහු ද සලකති. ථෙර භික්ෂූන්ගේ අනුකම්පාවට, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට, නවක භික්ෂූන්ගේ අනුකම්පාවට පාත්‍ර වූ, (එබඳු) ඔහු තුළ කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත. මේ ධර්මය ද පිහිට ඇති කරන්නකි.\n\nතවද මහණෙනි, මෙහිලා භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම සඳහා ද, කුසල ධර්මයන් සම්පූර්ණ කිරීම සඳහා ද පටන්ගත් වීර්යයෙන් යුක්තව වාසය කරයි, ශක්ති සම්පන්නය, ස්ථිර වීර්යය ඇත්තේය, කුසල ධර්මයන්හි දී බර අත් නොහරින්නේය. ‘මෙම භික්ෂුව අකුසල ධර්මයන් ප්‍රහීණ කිරීම සඳහා ද, කුසල ධර්මයන් සම්පූර්ණ කිරීම සඳහා ද පටන්ගත් වීර්යයෙන් යුක්තව වාසය කරයි, ශක්ති සම්පන්නය, ස්ථිර වීර්යය ඇත්තේය, කුසල ධර්මයන්හි දී බර අත් නොහරින්නේය’යි ථෙර භික්ෂූහු ද ඔහුට අවවාද කළ යුතු බවත්, අනුශාසනා කළ යුතු බවත් සලකති, මධ්‍යම භික්ෂූහු ද සලකති, නවක භික්ෂූහු ද සලකති. ථෙර භික්ෂූන්ගේ අනුකම්පාවට, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට, නවක භික්ෂූන්ගේ අනුකම්පාවට පාත්‍ර වූ, (එබඳු) ඔහු තුළ කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකිය, පිරිහීමක් නැත. මේ ධර්මය ද පිහිට ඇති කරන්නකි.\n\nඑම භික්ෂුව, තෙරණුවන්ගේ අනුකම්පාවට ලක් වූ, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට ලක් වූ, නවක භික්ෂූන්ගේ අනුකම්පාවට ලක් වූ කල්හි, කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකි ය, පිරිහීමක් නැත. මේ ධර්මයත් පිහිටක් වෙයි.\n\nනැවතත්, මහණෙනි, භික්ෂුව ලැබෙන යම්කිසි සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකරවලින් සන්තුෂ්ට වෙයි. ‘මේ භික්ෂුව ලැබෙන යම්කිසි සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස බෙහෙත් පිරිකරවලින් සැබවින්ම සන්තුෂ්ට කෙනෙකි’ යි තෙර භික්ෂූහු ද ඔහුට කතා කළ යුතු යැයි, අනුශාසනා කළ යුතු යැයි සලකති. මධ්‍යම භික්ෂූහු ද, නවක භික්ෂූහු ද ඔහුට කතා කළ යුතු යැයි, අනුශාසනා කළ යුතු යැයි සලකති. එම භික්ෂුව, තෙරණුවන්ගේ අනුකම්පාවට ලක් වූ, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට ලක් වූ, නවක භික්ෂූන්ගේ අනුකම්පාවට ලක් වූ කල්හි, කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකි ය, පිරිහීමක් නැත. මේ ධර්මයත් පිහිටක් වෙයි.\n\nනැවතත්, මහණෙනි, භික්ෂුව සිහි ඇත්තෙක් වෙයි. ඉතා උසස් සිහි නුවණින් යුක්ත ව, බොහෝ කලකට පෙර කරන ලද දේ ද, බොහෝ කලකට පෙර කියන ලද දේ ද සිහිපත් කරයි, නැවත නැවත සිහිපත් කරයි. ‘මේ භික්ෂුව ඉතා උසස් සිහි නුවණින් යුක්ත ව, බොහෝ කලකට පෙර කරන ලද දේ ද, බොහෝ කලකට පෙර කියන ලද දේ ද සිහිපත් කරන, සැබවින්ම සිහි ඇත්තෙකි’ යි තෙර භික්ෂූහු ද ඔහුට කතා කළ යුතු යැයි, අනුශාසනා කළ යුතු යැයි සලකති. මධ්‍යම භික්ෂූහු ද, නවක භික්ෂූහු ද ඔහුට කතා කළ යුතු යැයි, අනුශාසනා කළ යුතු යැයි සලකති. එම භික්ෂුව, තෙරණුවන්ගේ අනුකම්පාවට ලක් වූ, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට ලක් වූ, නවක භික්ෂූන්ගේ අනුකම්පාවට ලක් වූ කල්හි, කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකි ය, පිරිහීමක් නැත. මේ ධර්මයත් පිහිටක් වෙයි.\n\nනැවතත්, මහණෙනි, භික්ෂුව ප්‍රඥාවන්තයෙක් වෙයි. හටගැනීම හා නැති වී යාම දකින, ආර්ය වූ, (සත්‍යය) විනිවිද දකින, නිවැරදි ව දුක් ක්ෂය කිරීම කරා ගමන් කරන ප්‍රඥාවෙන් යුක්ත වෙයි. ‘මේ භික්ෂුව හටගැනීම හා නැති වී යාම දකින, ආර්ය වූ, (සත්‍යය) විනිවිද දකින, නිවැරදි ව දුක් ක්ෂය කිරීම කරා ගමන් කරන ප්‍රඥාවෙන් යුක්ත වූ, සැබවින්ම ප්‍රඥාවන්තයෙකි’ යි තෙර භික්ෂූහු ද ඔහුට කතා කළ යුතු යැයි, අනුශාසනා කළ යුතු යැයි සලකති. මධ්‍යම භික්ෂූහු ද, නවක භික්ෂූහු ද ඔහුට කතා කළ යුතු යැයි, අනුශාසනා කළ යුතු යැයි සලකති. එම භික්ෂුව, තෙරණුවන්ගේ අනුකම්පාවට ලක් වූ, මධ්‍යම භික්ෂූන්ගේ අනුකම්පාවට ලක් වූ, නවක භික්ෂූන්ගේ අනුකම්පාවට ලක් වූ කල්හි, කුසල ධර්මයන්හි දියුණුවම අපේක්ෂා කළ හැකි ය, පිරිහීමක් නැත. මේ ධර්මයත් පිහිටක් වෙයි.\n\n\"මහණෙනි, පිහිට සහිත ව වාසය කරව්, පිහිටක් නැති ව නො වාසය කරව්. මහණෙනි, පිහිටක් නැත්තා දුකෙන් වාසය කරයි. මහණෙනි, මේ දස ධර්මයෝ පිහිට පිණිස පවතින ධර්මයෝ ය.\" භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. එම භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ දෙසුම සතුටු සිත් ඇති ව අභිනන්දනය කළහ. අටවැනි සූත්‍රයයි.",
      "paliTitle": "Dutiyanāthasuttaṃ",
      "englishTitle": "The Second Sutta on Refuge",
      "sinhalaTitle": "දෙවන නාථ සූත්‍රය"
    },
    {
      "number": 19,
      "pali": "[dī. ni. 3.348, 360] ‘‘Dasayime, bhikkhave, ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā. Katame dasa? Idha, bhikkhave, bhikkhu pañcaṅgavippahīno hoti, chaḷaṅgasamannāgato, ekārakkho, caturāpasseno, paṇunnapaccekasacco [panuṇṇapaccekasacco (ka.)], samavayasaṭṭhesano, anāvilasaṅkappo, passaddhakāyasaṅkhāro, suvimuttacitto, suvimuttapañño. Ime kho, bhikkhave, dasa ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā’’ti. Navamaṃ.",
      "english": "Monks, these are the ten noble dwellings, which the Noble Ones have dwelt in, dwell in, or will dwell in. Which are these ten? Here, monks, a bhikkhu has abandoned the five factors, is endowed with the six factors, has one protection, has four supports, has banished all individual assertions of truth, has eradicated all seeking, has undefiled intentions, has tranquilized bodily fabrications, has a well-liberated mind, and has well-liberated wisdom. These, monks, are the ten noble dwellings, which the Noble Ones have dwelt in, dwell in, or will dwell in.",
      "sinhala": "භික්ෂූණි, ආර්යයන් වහන්සේලා වාසය කළාවූ, වාසය කරනාවූ, වාසය කරන්නාවූ මේ ආර්ය ආවාස දසයකි. කවරේද මේ දසය?\nමෙහිලා භික්ෂූණි, භික්ෂුව පස් අංග ප්‍රහීණ කළ කෙනෙක් වේ, සය අංගයෙන් සමන්විත වූ කෙනෙක් වේ, එක ආරක්‍ෂාවකින් යුක්ත වූ කෙනෙක් වේ, සතර පිළිසරණින් යුක්ත වූ කෙනෙක් වේ, තමාගේම වූ අදහස් බැහැර කළ කෙනෙක් වේ, සියලු ගවේෂණයන් සම්පූර්ණයෙන්ම දුරු කළ කෙනෙක් වේ, නිර්මල සංකල්පනා ඇති කෙනෙක් වේ, සන්හිඳුණු කාය සංස්කාර ඇති කෙනෙක් වේ, සුවිමුක්ත සිත් ඇති කෙනෙක් වේ, සුවිමුක්ත ප්‍රඥා ඇති කෙනෙක් වේ. භික්ෂූණි, ආර්යයන් වහන්සේලා වාසය කළාවූ, වාසය කරනාවූ, වාසය කරන්නාවූ මේ ආර්ය ආවාස දසය නම් වෙති.",
      "paliTitle": "Paṭhamaariyāvāsasuttaṃ",
      "englishTitle": "The First Noble Dwelling Discourse",
      "sinhalaTitle": "පළමු ආර‍්යාවාස සූත්‍රය"
    },
    {
      "number": 20,
      "pali": "Ekaṃ samayaṃ bhagavā kurūsu viharati kammāsadhammaṃ nāma kurūnaṃ nigamo. Tatra kho bhagavā bhikkhū āmantesi…pe…. ‘‘Dasayime, bhikkhave, ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā. Katame dasa? Idha, bhikkhave, bhikkhu pañcaṅgavippahīno hoti, chaḷaṅgasamannāgato, ekārakkho, caturāpasseno, paṇunnapaccekasacco, samavayasaṭṭhesano, anāvilasaṅkappo, passaddhakāyasaṅkhāro, suvimuttacitto, suvimuttapañño. ‘‘Kathañca, bhikkhave, bhikkhu pañcaṅgavippahīno hoti? Idha, bhikkhave, bhikkhuno kāmacchando pahīno hoti, byāpādo pahīno hoti, thinamiddhaṃ pahīnaṃ hoti, uddhaccakukkuccaṃ pahīnaṃ hoti, vicikicchā pahīnā hoti. Evaṃ kho, bhikkhave, bhikkhu pañcaṅgavippahīno hoti. ‘‘Kathañca, bhikkhave, bhikkhu chaḷaṅgasamannāgato hoti? Idha, bhikkhave, bhikkhu cakkhunā rūpaṃ disvā neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Sotena saddaṃ sutvā… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya neva sumano hoti na dummano, upekkhako viharati sato sampajāno. Evaṃ kho, bhikkhave, bhikkhu chaḷaṅgasamannāgato hoti. ‘‘Kathañca, bhikkhave, bhikkhu ekārakkho hoti? Idha, bhikkhave, bhikkhu satārakkhena cetasā samannāgato hoti. Evaṃ kho, bhikkhave, bhikkhu ekārakkho hoti. ‘‘Kathañca, bhikkhave, bhikkhu caturāpasseno hoti? Idha, bhikkhave, bhikkhu saṅkhāyekaṃ paṭisevati, saṅkhāyekaṃ adhivāseti, saṅkhāyekaṃ parivajjeti, saṅkhāyekaṃ vinodeti. Evaṃ kho, bhikkhave, bhikkhu caturāpasseno hoti. ‘‘Kathañca, bhikkhave, bhikkhu paṇunnapaccekasacco hoti? Idha, bhikkhave, bhikkhuno yāni tāni puthusamaṇabrāhmaṇānaṃ puthupaccekasaccāni, seyyathidaṃ – ‘sassato loko’ti vā, ‘asassato loko’ti vā, ‘antavā loko’ti vā, ‘anantavā loko’ti vā, ‘taṃ jīvaṃ taṃ sarīra’nti vā, ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā, ‘hoti tathāgato paraṃ maraṇā’ti vā, ‘na hoti tathāgato paraṃ maraṇā’ti vā, ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’ti vā, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti vā, sabbāni tāni nunnāni honti paṇunnāni [nuṇṇāni honti panuṇṇāni (?)] cattāni vantāni muttāni pahīnāni paṭinissaṭṭhāni. Evaṃ kho, bhikkhave, bhikkhu paṇunnapaccekasacco hoti. ‘‘Kathañca, bhikkhave, bhikkhu samavayasaṭṭhesano hoti? Idha, bhikkhave, bhikkhuno kāmesanā pahīnā hoti, bhavesanā pahīnā hoti, brahmacariyesanā paṭippassaddhā. Evaṃ kho, bhikkhave, bhikkhu samavayasaṭṭhesano hoti. ‘‘Kathañca, bhikkhave, bhikkhu anāvilasaṅkappo hoti? Idha, bhikkhave, bhikkhuno kāmasaṅkappo pahīno hoti, byāpādasaṅkappo pahīno hoti, vihiṃsāsaṅkappo pahīno hoti. Evaṃ kho, bhikkhave, bhikkhu anāvilasaṅkappo hoti. ‘‘Kathañca, bhikkhave, bhikkhu passaddhakāyasaṅkhāro hoti? Idha, bhikkhave, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu passaddhakāyasaṅkhāro hoti. ‘‘Kathañca, bhikkhave, bhikkhu suvimuttacitto hoti? Idha, bhikkhave, bhikkhuno rāgā cittaṃ vimuttaṃ hoti, dosā cittaṃ vimuttaṃ hoti, mohā cittaṃ vimuttaṃ hoti. Evaṃ kho, bhikkhave, bhikkhu suvimuttacitto hoti. ‘‘Kathañca, bhikkhave, bhikkhu suvimuttapañño hoti? Idha, bhikkhave, bhikkhu ‘rāgo me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti, doso me pahīno… pe… ‘moho me pahīno ucchinnamūlo tālāvatthukato anabhāvaṃkato āyatiṃ anuppādadhammo’ti pajānāti. Evaṃ kho, bhikkhave, bhikkhu suvimuttapañño hoti. ‘‘Ye hi keci, bhikkhave, atītamaddhānaṃ ariyā ariyāvāse āvasiṃsu, sabbe te imeva dasa ariyāvāse āvasiṃsu; ye hi keci, bhikkhave, anāgatamaddhānaṃ ariyā ariyāvāse āvasissanti, sabbe te imeva dasa ariyāvāse āvasissanti; ye hi [yepi (?)] keci, bhikkhave, etarahi ariyā ariyāvāse āvasanti, sabbe te imeva dasa ariyāvāse āvasanti. Ime kho, bhikkhave, dasa ariyāvāsā, ye ariyā āvasiṃsu vā āvasanti vā āvasissanti vā’’ti. Dasamaṃ. ",
      "english": "At one time the Blessed One was dwelling among the Kurus at a town of the Kurus named Kammāsadhamma. There, indeed, the Blessed One addressed the monks: \"Monks, these ten are the abodes of the Noble Ones, in which the Noble Ones have dwelt, or dwell, or will dwell. Which ten? Here, monks, a monk is one who has abandoned five factors, is endowed with six factors, has one protection, has four supports, has discarded individual truths, has entirely abandoned searching, has undefiled intentions, has tranquilized bodily formations, has a well-liberated mind, and has well-liberated wisdom.\"\n\n\"And how, monks, is a monk one who has abandoned five factors? Here, monks, a monk has abandoned sensual desire, has abandoned ill-will, has abandoned sloth and torpor, has abandoned restlessness and remorse, and has abandoned doubt. It is in this way, monks, that a monk is one who has abandoned five factors.\"\n\n\"And how, monks, is a monk endowed with six factors? Here, monks, having seen a form with the eye, a monk is neither joyful nor dejected, but dwells equanimously, mindful and clearly comprehending. Having heard a sound with the ear... having smelled an odor with the nose... having tasted a flavor with the tongue... having felt a tactile sensation with the body... having cognized a mental phenomenon with the mind, he is neither joyful nor dejected, but dwells equanimously, mindful and clearly comprehending. It is in this way, monks, that a monk is endowed with six factors.\"\n\n\"And how, monks, is a monk one who has one protection? Here, monks, a monk is endowed with a mind protected by mindfulness. It is in this way, monks, that a monk is one who has one protection.\"\n\n\"And how, monks, is a monk one who has four supports? Here, monks, a monk makes use of one thing after careful consideration; he endures one thing after careful consideration; he avoids one thing after careful consideration; he dispels one thing after careful consideration. It is in this way, monks, that a monk is one who has four supports.\"\n\n\"And how, monks, is a monk one who has discarded individual truths? Here, monks, all those various individual truths of various recluses and brahmins—such as 'the world is eternal,' or 'the world is not eternal,' or 'the world is finite,' or 'the world is infinite,' or 'the soul is the same as the body,' or 'the soul is one thing and the body is another,' or 'the Tathāgata exists after death,' or 'the Tathāgata does not exist after death,' or 'the Tathāgata both exists and does not exist after death,' or 'the Tathāgata neither exists nor does not exist after death'—all of these are expelled, discarded, rejected, vomited forth, released, abandoned, and relinquished. It is in this way, monks, that a monk is one who has discarded individual truths.\"\n\n\"And how, monks, is a monk one whose searching has entirely subsided? Here, monks, the monk's quest for sensual pleasures is abandoned, his quest for existence is abandoned, and his quest for the holy life has subsided. It is in this way, monks, that a monk is one whose searching has entirely subsided.\"\n\n\"And how, monks, is a monk one who has undefiled intentions? Here, monks, a monk's intention of sensual desire is abandoned, his intention of ill-will is abandoned, and his intention of harm is abandoned. It is in this way, monks, that a monk is one who has undefiled intentions.\"\n\n\"And how, monks, is a monk one who has tranquilized bodily formations? Here, monks, by the abandoning of pleasure and by the abandoning of pain, and by the prior passing away of joy and sorrow, a monk enters upon and abides in the fourth jhana, which is beyond pleasure and pain, and purified by equanimity and mindfulness. It is in this way, monks, that a monk is one who has tranquilized bodily formations.\"\n\n\"And how, monks, is a monk one who has a well-liberated mind? Here, monks, a monk's mind is liberated from lust, his mind is liberated from hatred, and his mind is liberated from delusion. It is in this way, monks, that a monk is one who has a well-liberated mind.\"\n\n\"And how, monks, is a monk one who has well-liberated wisdom? Here, monks, a monk understands: 'My lust is abandoned, uprooted, made like a palm-stump, annihilated, and no longer subject to future arising.' He understands: 'My hatred is abandoned, uprooted, made like a palm-stump, annihilated, and no longer subject to future arising.' He understands: 'My delusion is abandoned, uprooted, made like a palm-stump, annihilated, and no longer subject to future arising.' It is in this way, monks, that a monk is one who has well-liberated wisdom.\"\n\n\"Whatever Noble Ones, monks, have dwelt in the abodes of the Noble Ones in the past, all of them have dwelt in these same ten abodes of the Noble Ones. Whatever Noble Ones, monks, will dwell in the abodes of the Noble Ones in the future, all of them will dwell in these same ten abodes of the Noble Ones. Whatever Noble Ones, monks, now dwell in the abodes of the Noble Ones in the present, all of them dwell in these same ten abodes of the Noble Ones. These, monks, are the ten abodes of the Noble Ones, in which the Noble Ones have dwelt, or dwell, or will dwell.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ කුරු දනව්වෙහි කම්මාසදම්ම නම් වූ කුරුවන්ගේ නියම්ගමෙහි වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා වදාළ සේක: “මහණෙනි, මේ ආර්ය වාස දසයකි, යම් ආර්යයෝ පෙර විසූහ, වර්තමානයේ වසති, හෝ අනාගතයේ වසන්නාහ. ඒ දසය කවරේද?\n\nමහණෙනි, මෙහිලා භික්ෂුව පස් අඟුල් ප්‍රහීණ කළ කෙනෙක් වෙයි, සය අඟින් යුක්ත වෙයි, එකාරක්ෂා ඇත්තේ වෙයි, සිවු ආශ්‍රය ඇත්තේ වෙයි, තමාගේම විශේෂ සත්‍යයන් දුරු කළ කෙනෙක් වෙයි, සියලු ගවේෂණයන් සමනය කළ කෙනෙක් වෙයි, නොකැළඹුණු සංකල්පනා ඇත්තේ වෙයි, සන්සිඳුණු කය සංස්කාර ඇත්තේ වෙයි, මැනවින් විමුක්ති ලැබූ සිත් ඇත්තේ වෙයි, මැනවින් විමුක්ති ලැබූ ප්‍රඥාව ඇත්තේ වෙයි.”\n\n“මහණෙනි, භික්ෂුව පස් අඟුල් ප්‍රහීණ කළ කෙනෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවගේ කාමච්ඡන්දය ප්‍රහීණ වී ඇත, ව්‍යාපාදය ප්‍රහීණ වී ඇත, ථීනමිද්ධය ප්‍රහීණ වී ඇත, උද්ධච්චකුක්කුච්චය ප්‍රහීණ වී ඇත, විචිකිච්ඡාව ප්‍රහීණ වී ඇත. මහණෙනි, මෙසේ භික්ෂුව පස් අඟුල් ප්‍රහීණ කළ කෙනෙක් වෙයි.”\n\n“මහණෙනි, භික්ෂුව සය අඟින් යුක්ත වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව ඇසින් රූපයක් දැක සතුටු නොවෙයි, නොසතුටු නොවෙයි. සිහි ඇතිව, මනා නුවණින් යුක්තව, උපේක්ෂාවෙන් වාසය කරයි. කනින් ශබ්දයක් අසා සතුටු නොවෙයි, නොසතුටු නොවෙයි. සිහි ඇතිව, මනා නුවණින් යුක්තව, උපේක්ෂාවෙන් වාසය කරයි. නාසයෙන් ගඳක් ආඝ්‍රාණය කොට සතුටු නොවෙයි, නොසතුටු නොවෙයි. සිහි ඇතිව, මනා නුවණින් යුක්තව, උපේක්ෂාවෙන් වාසය කරයි. දිවෙන් රසයක් විඳ සතුටු නොවෙයි, නොසතුටු නොවෙයි. සිහි ඇතිව, මනා නුවණින් යුක්තව, උපේක්ෂාවෙන් වාසය කරයි. කයින් ස්පර්ශයක් දැන සතුටු නොවෙයි, නොසතුටු නොවෙයි. සිහි ඇතිව, මනා නුවණින් යුක්තව, උපේක්ෂාවෙන් වාසය කරයි. මනසින් ධර්මයක් (අරමුණක්) දැන සතුටු නොවෙයි, නොසතුටු නොවෙයි. සිහි ඇතිව, මනා නුවණින් යුක්තව, උපේක්ෂාවෙන් වාසය කරයි. මහණෙනි, මෙසේ භික්ෂුව සය අඟින් යුක්ත වෙයි.”\n\n“මහණෙනි, භික්ෂුව එකාරක්ෂා ඇත්තේ වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව සිහි නමැති ආරක්ෂාවෙන් යුක්ත සිතින් සමන්විත වෙයි. මහණෙනි, මෙසේ භික්ෂුව එකාරක්ෂා ඇත්තේ වෙයි.”\n\n“මහණෙනි, භික්ෂුව සිවු ආශ්‍රය ඇත්තේ වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව යමක් විචාර බුද්ධියෙන් සේවනය කරයි, යමක් විචාර බුද්ධියෙන් ඉවසයි, යමක් විචාර බුද්ධියෙන් දුරු කරයි, යමක් විචාර බුද්ධියෙන් පහ කරයි. මහණෙනි, මෙසේ භික්ෂුව සිවු ආශ්‍රය ඇත්තේ වෙයි.”\n\n“මහණෙනි, භික්ෂුව තමාගේම විශේෂ සත්‍යයන් දුරු කළ කෙනෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවට යම් ඒ නොයෙක් ශ්‍රමණ බ්‍රාහ්මණවරුන්ගේ නොයෙක් තමාගේම විශේෂ සත්‍යයන් ඇත්ද – එනම්: ‘ලෝකය සදාකාලිකය’ කියා හෝ, ‘ලෝකය අසදාකාලිකය’ කියා හෝ, ‘ලෝකයට කෙළවරක් ඇත’ කියා හෝ, ‘ලෝකයට කෙළවරක් නැත’ කියා හෝ, ‘ඒ ජීවයමයි, ඒ ශරීරයමයි’ කියා හෝ, ‘ජීවය එකකි, ශරීරය අනෙකකි’ කියා හෝ, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටී’ කියා හෝ, ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටී’ කියා හෝ, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටීද නොසිටීද’ කියා හෝ, ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටීද නොනොසිටීද’ කියා හෝ – ඒ සියල්ල පහ කරනු ලැබූවක්, දුරු කරනු ලැබූවක්, අත්හරිනු ලැබූවක්, වමාරා දැමූවක්, මුදනු ලැබූවක්, ප්‍රහීණ කරනු ලැබූවක්, ප්‍රතික්ෂේප කරනු ලැබූවක් වෙයි. මහණෙනි, මෙසේ භික්ෂුව තමාගේම විශේෂ සත්‍යයන් දුරු කළ කෙනෙක් වෙයි.”\n\n“මහණෙනි, භික්ෂුව සියලු ගවේෂණයන් සමනය කළ කෙනෙක් වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවගේ කාමේෂණාව ප්‍රහීණ වී ඇත, භවේෂණාව ප්‍රහීණ වී ඇත, බ්‍රහ්මචර්යේෂණාව සන්සිඳී ඇත. මහණෙනි, මෙසේ භික්ෂුව සියලු ගවේෂණයන් සමනය කළ කෙනෙක් වෙයි.”\n\n“මහණෙනි, භික්ෂුව නොකැළඹුණු සංකල්පනා ඇත්තේ වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවගේ කාම සංකල්පය ප්‍රහීණ වී ඇත, ව්‍යාපාද සංකල්පය ප්‍රහීණ වී ඇත, විහිංසා සංකල්පය ප්‍රහීණ වී ඇත. මහණෙනි, මෙසේ භික්ෂුව නොකැළඹුණු සංකල්පනා ඇත්තේ වෙයි.”\n\n“මහණෙනි, භික්ෂුව සන්සිඳුණු කය සංස්කාර ඇත්තේ වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව සැපයද දුකයද ප්‍රහීණ කිරීමෙන්ද, පෙර සිටි සෝමනස්ස දෝමනස්සයන්ගේ අස්තංගමනයෙන්ද, දුක්‌ද නොවූ, සැපද නොවූ, උපේක්ෂා සිහි පාරිශුද්ධිය ඇති සිව්වන ධ්‍යානයට එළඹ වාසය කරයි. මහණෙනි, මෙසේ භික්ෂුව සන්සිඳුණු කය සංස්කාර ඇත්තේ වෙයි.”\n\n“මහණෙනි, භික්ෂුව මැනවින් විමුක්ති ලැබූ සිත් ඇත්තේ වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුවගේ සිත රාගයෙන් මිදී ඇත, ද්වේෂයෙන් මිදී ඇත, මෝහයෙන් මිදී ඇත. මහණෙනි, මෙසේ භික්ෂුව මැනවින් විමුක්ති ලැබූ සිත් ඇත්තේ වෙයි.”\n\n“මහණෙනි, භික්ෂුව මැනවින් විමුක්ති ලැබූ ප්‍රඥාව ඇත්තේ වන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්ෂුව ‘මාගේ රාගය මුලින් උදුරා දමා ඇත, තල්ගසක් කපා මුලටම නැති කළාක් මෙන්, නැති කර දමා ඇත, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයෙන් යුක්තය’ යනුවෙන් දනියි. ‘මාගේ ද්වේෂය මුලින් උදුරා දමා ඇත, තල්ගසක් කපා මුලටම නැති කළාක් මෙන්, නැති කර දමා ඇත, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයෙන් යුක්තය’ යනුවෙන් දනියි. ‘මාගේ මෝහය මුලින් උදුරා දමා ඇත, තල්ගසක් කපා මුලටම නැති කළාක් මෙන්, නැති කර දමා ඇත, අනාගතයේදී නැවත ඇති නොවන ස්වභාවයෙන් යුක්තය’ යනුවෙන් දනියි. මහණෙනි, මෙසේ භික්ෂුව මැනවින් විමුක්ති ලැබූ ප්‍රඥාව ඇත්තේ වෙයි.”\n\n“මහණෙනි, යම් කවර හෝ ආර්යයෝ අතීත කාලයෙහි ආර්ය වාසයෙහි විසූහ, ඒ සියලු දෙනා මේ දස ආර්ය වාසයෙහිම විසූහ. මහණෙනි, යම් කවර හෝ ආර්යයෝ අනාගත කාලයෙහි ආර්ය වාසයෙහි වසන්නාහ, ඒ සියලු දෙනා මේ දස ආර්ය වාසයෙහිම වසන්නාහ. මහණෙනි, යම් කවර හෝ ආර්යයෝ වර්තමාන කාලයෙහි ආර්ය වාසයෙහි වසති, ඒ සියලු දෙනා මේ දස ආර්ය වාසයෙහිම වසති. මහණෙනි, යම් ආර්යයෝ පෙර විසූහ, වර්තමානයේ වසති, හෝ අනාගතයේ වසන්නාහ, ඒ මේ දස ආර්ය වාසයන්ය.”",
      "paliTitle": "Dutiyaariyāvāsasuttaṃ",
      "englishTitle": "Second Noble Abode Discourse",
      "sinhalaTitle": "දෙවන ආර්යාවාස සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Nāthavaggo dutiyo. Tassuddānaṃ – Senāsanañca pañcaṅgaṃ, saṃyojanākhilena ca; Appamādo āhuneyyo, dve nāthā dve ariyāvāsāti.",
    "english": "Second Chapter on Protectors",
    "sinhala": "දෙවන නාථ වග්ගය"
  }
}