{
  "id": "an10.14",
  "title": {
    "pali": "Sādhuvaggo",
    "english": "The Chapter on the Virtuous",
    "sinhala": "සාධු වර්ගය"
  },
  "sections": [
    {
      "number": 134,
      "pali": "[a. ni. 10.178] ‘‘Sādhuñca vo, bhikkhave, desessāmi asādhuñca. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamañca, bhikkhave, asādhu? Micchādiṭṭhi, micchāsaṅkappo, micchāvācā, micchākammanto, micchāājīvo, micchāvāyāmo, micchāsati, micchāsamādhi, micchāñāṇaṃ, micchāvimutti – idaṃ vuccati, bhikkhave, asādhu. Katamañca, bhikkhave, sādhu? Sammādiṭṭhi, sammāsaṅkappo, sammāvācā sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi, sammāñāṇaṃ, sammāvimutti – idaṃ vuccati, bhikkhave, sādhū’’ti. Paṭhamaṃ.",
      "english": "“Monks, I will teach you both the wholesome and the unwholesome. Listen to that, pay careful attention; I will speak.”\n\n“Yes, venerable sir,” those monks replied to the Blessed One.\n\nThe Blessed One then said this: “And what, monks, is the unwholesome? Wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, wrong liberation – this, monks, is called the unwholesome. And what, monks, is the wholesome? Right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, right liberation – this, monks, is called the wholesome.”",
      "sinhala": "භික්ෂූණි, මම ඔබට කුසලයත් අකුසලයත් දේශනා කරන්නෙමි. ඒ දේශනාව අසන්න, මනාව සිතට ගන්න. මම එය දේශනා කරන්නෙමි.\n\n\"එසේය, භාග්‍යවතුන් වහන්ස\" යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n\"භික්ෂූණි, අකුසලය යනු කවරේද? මිත්‍යාදෘෂ්ටිය, මිත්‍යාසංකප්පය, මිත්‍යාවාචාව, මිත්‍යාකම්මන්තය, මිත්‍යාආජීවය, මිත්‍යාවායාමය, මිත්‍යාසතිය, මිත්‍යාසමාධිය, මිත්‍යාඥාණය, මිත්‍යාවිමුක්තිය – භික්ෂූණි, මේ දසය අකුසලය යැයි කියනු ලැබේ.\n\nභික්ෂූණි, කුසලය යනු කවරේද? සම්මාදෘෂ්ටිය, සම්මාසංකප්පය, සම්මාවාචාව, සම්මාකම්මන්තය, සම්මාආජීවය, සම්මාවායාමය, සම්මාසතිය, සම්මාසමාධිය, සම්මාඥාණය, සම්මාවිමුක්තිය – භික්ෂූණි, මේ දසය කුසලය යැයි කියනු ලැබේ.\"",
      "paliTitle": "Sādhusuttaṃ"
    },
    {
      "number": 135,
      "pali": "‘‘Ariyadhammañca vo, bhikkhave, desessāmi anariyadhammañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, anariyo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, anariyo dhammo. Katamo ca, bhikkhave, ariyo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, ariyo dhammo’’ti. Dutiyaṃ.",
      "english": "Monks, I will teach you both the noble teaching and the ignoble teaching. Listen to it. And what, monks, is the ignoble teaching? It is wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, wrong liberation. This, monks, is called the ignoble teaching. And what, monks, is the noble teaching? It is right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, right liberation. This, monks, is called the noble teaching.",
      "sinhala": "මහණෙනි, මම ඔබට ආර්ය ධර්මයත්, අනාර්ය ධර්මයත් දේශනා කරන්නෙමි. එය හොඳින් අසව්. මහණෙනි, අනාර්ය ධර්මය කුමක්ද? වැරදි දැකීමෙන් පටන්ගෙන වැරදි විමුක්තිය දක්වා ඇති සියලු දෑ, මහණෙනි, අනාර්ය ධර්මය යැයි කියනු ලැබේ. මහණෙනි, ආර්ය ධර්මය කුමක්ද? නිවැරදි දැකීමෙන් පටන්ගෙන නිවැරදි විමුක්තිය දක්වා ඇති සියලු දෑ, මහණෙනි, ආර්ය ධර්මය යැයි කියනු ලැබේ. දෙවැනි සූත‍්‍රයයි.",
      "paliTitle": "Ariyadhammasuttaṃ"
    },
    {
      "number": 136,
      "pali": "‘‘Akusalañca vo, bhikkhave, desessāmi kusalañca. Taṃ suṇātha …pe… katamañca, bhikkhave, akusalaṃ? Micchādiṭṭhi…pe… micchāvimutti – idaṃ vuccati, bhikkhave, akusalaṃ. Katamañca, bhikkhave, kusalaṃ? Sammādiṭṭhi…pe… sammāvimutti – idaṃ vuccati, bhikkhave, kusala’’nti. Tatiyaṃ.",
      "english": "Monks, I will teach you the unwholesome and the wholesome. Listen to that. And what, monks, is the unwholesome? It is wrong view, and so on, up to wrong liberation. This, monks, is called the unwholesome. And what, monks, is the wholesome? It is right view, and so on, up to right liberation. This, monks, is called the wholesome.",
      "sinhala": "භික්‍ෂූනි, මම ඔබට අකුසලය සහ කුසලය දේශනා කරන්නෙමි. එයට සවන් දෙන්න. භික්‍ෂූනි, අකුසලය කවරේද? මිථ්‍යාදෘෂ්ටිය... (යන ආදී වශයෙන්) මිථ්‍යාවිමුක්තිය දක්වා ඇති සියල්ල. භික්‍ෂූනි, මෙය අකුසලයයි කියනු ලැබේ. භික්‍ෂූනි, කුසලය කවරේද? සම්මාදෘෂ්ටිය... (යන ආදී වශයෙන්) සම්මාවිමුක්තිය දක්වා ඇති සියල්ල. භික්‍ෂූනි, මෙය කුසලයයි කියනු ලැබේ.",
      "paliTitle": "Akusalasuttaṃ"
    },
    {
      "number": 137,
      "pali": "‘‘Atthañca vo, bhikkhave, desessāmi anatthañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, anattho? Micchādiṭṭhi …pe… micchāvimutti – ayaṃ vuccati, bhikkhave, anattho. Katamo ca, bhikkhave, attho? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, attho’’ti. Catutthaṃ.",
      "english": "Monks, I will teach you what is truly beneficial and what is truly unbeneficial; listen carefully and attend. And what, monks, is truly unbeneficial? It is wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation; this, monks, is called what is truly unbeneficial. And what, monks, is truly beneficial? It is right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation; this, monks, is called what is truly beneficial.",
      "sinhala": "මහණෙනි, මම ඔබට අර්ථයද, අනර්ථයද දේශනා කරන්නෙමි. එය ශ්‍රවණය කරන්න.\n\nමහණෙනි, අනර්ථය නම් කුමක්ද? මිථ්‍යාදෘෂ්ටියෙහි පටන්... මිථ්‍යාවිමුක්තිය දක්වා ඇති ධර්මතාවන් – මහණෙනි, මෙය අනර්ථය යැයි කියනු ලැබේ.\n\nමහණෙනි, අර්ථය නම් කුමක්ද? සම්මාදෘෂ්ටියෙහි පටන්... සම්මාවිමුක්තිය දක්වා ඇති ධර්මතාවන් – මහණෙනි, මෙය අර්ථය යැයි කියනු ලැබේ.",
      "paliTitle": "Atthasuttaṃ"
    },
    {
      "number": 138,
      "pali": "‘‘Dhammañca vo, bhikkhave, desessāmi adhammañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, adhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, adhammo. Katamo ca, bhikkhave, dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, dhammo’’ti. Pañcamaṃ.",
      "english": "Monks, I will teach you the Dhamma and the Adhamma. Listen to it.\nAnd what, monks, is the Adhamma? Wrong view, and so on, up to wrong liberation—this, monks, is called the Adhamma.\nAnd what, monks, is the Dhamma? Right view, and so on, up to right liberation—this, monks, is called the Dhamma.",
      "sinhala": "භික්‍ෂූණි, මම ඔබට ධර්මයත් අධර්මයත් දේශනා කරන්නෙමි. එය ශ්‍රවණය කරව්.\n\nභික්‍ෂූණි, අධර්මය කවරේද? මිථ්‍යාදෘෂ්ටියේ සිට මිථ්‍යාවිමුක්තිය දක්වා වූ සියල්ල අධර්මයයි. භික්‍ෂූණි, මෙය අධර්මය යැයි කියනු ලැබේ.\n\nභික්‍ෂූණි, ධර්මය කවරේද? සම්මාදෘෂ්ටියේ සිට සම්මාවිමුක්තිය දක්වා වූ සියල්ල ධර්මයයි. භික්‍ෂූණි, මෙය ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Dhammasuttaṃ"
    },
    {
      "number": 139,
      "pali": "‘‘Sāsavañca vo, bhikkhave, dhammaṃ desessāmi anāsavañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, sāsavo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, sāsavo dhammo. Katamo ca, bhikkhave, anāsavo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, anāsavo dhammo’’ti. Chaṭṭhaṃ.",
      "english": "Monks, I shall teach you the teaching with influxes and the teaching without influxes. Listen to that. And what, monks, is the teaching with influxes? Wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, up to wrong liberation – this, monks, is called the teaching with influxes. And what, monks, is the teaching without influxes? Right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, up to right liberation – this, monks, is called the teaching without influxes.",
      "sinhala": "මහණෙනි, ආශ්‍රව සහිත ධර්මයද, ආශ්‍රව රහිත ධර්මයද මම ඔබට දේශනා කරන්නෙමි. ඒ ධර්මය අසන්න.\n\nමහණෙනි, ආශ්‍රව සහිත ධර්මය කවරේද? මිථ්‍යාදෘෂ්ටිය, මිථ්‍යාසංකල්පය, මිථ්‍යාවාචාව, මිථ්‍යාකර්මාන්තය, මිථ්‍යාආජීවය, මිථ්‍යාව්‍යායාමය, මිථ්‍යාසතිය, මිථ්‍යාසමාධිය, මිථ්‍යාඥානය, මිථ්‍යාවිමුක්තිය – මහණෙනි, මෙය ආශ්‍රව සහිත ධර්මයයි කියනු ලැබේ. මහණෙනි, ආශ්‍රව රහිත ධර්මය කවරේද? සම්මාදිට්ඨිය, සම්මාසංකල්පය, සම්මාවාචාව, සම්මාකර්මාන්තය, සම්මාආජීවය, සම්මාව්‍යායාමය, සම්මාසතිය, සම්මාසමාධිය, සම්මාඥානය, සම්මාවිමුක්තිය – මහණෙනි, මෙය ආශ්‍රව රහිත ධර්මයයි කියනු ලැබේ.",
      "paliTitle": "Sāsavasuttaṃ"
    },
    {
      "number": 140,
      "pali": "‘‘Sāvajjañca vo, bhikkhave, dhammaṃ desessāmi anavajjañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, sāvajjo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, sāvajjo dhammo. Katamo ca, bhikkhave, anavajjo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, anavajjo dhammo’’ti. Sattamaṃ.",
      "english": "Monks, I will teach you the blameworthy teaching and the blameless teaching. Listen to it carefully. And what, monks, is the blameworthy teaching? Wrong view, and all that follows, up to wrong liberation – this, monks, is called the blameworthy teaching. And what, monks, is the blameless teaching? Right view, and all that follows, up to right liberation – this, monks, is called the blameless teaching.",
      "sinhala": "භික්ෂූනි, මම ඔබට සාවද්‍ය වූද, අනවද්‍ය වූද ධර්මය දෙසා වදාරමි. එය අසව්. භික්ෂූනි, සාවද්‍ය ධර්මය කවරේද? මිථ්‍යාදෘෂ්ටිය පටන් ගෙන මිථ්‍යාවිමුක්තිය දක්වා වූ ධර්මය – භික්ෂූනි, මෙය සාවද්‍ය ධර්මය යැයි කියනු ලැබේ. භික්ෂූනි, අනවද්‍ය ධර්මය කවරේද? සම්මාදිට්ඨිය පටන් ගෙන සම්මාවිමුක්තිය දක්වා වූ ධර්මය – භික්ෂූනි, මෙය අනවද්‍ය ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Sāvajjasuttaṃ"
    },
    {
      "number": 141,
      "pali": "‘‘Tapanīyañca vo, bhikkhave, dhammaṃ desessāmi atapanīyañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, tapanīyo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, tapanīyo dhammo. Katamo ca, bhikkhave, atapanīyo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, atapanīyo dhammo’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I will teach you the tormenting Dhamma and the non-tormenting Dhamma. Listen to that. And what, monks, is the tormenting Dhamma? It is wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation. This, monks, is called the tormenting Dhamma. And what, monks, is the non-tormenting Dhamma? It is right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation. This, monks, is called the non-tormenting Dhamma.",
      "sinhala": "මහණෙනි, මම ඔබට තවන ධ​ර්ම​යද නොතවන ධ​ර්ම​යද දේශනා කරන්නෙමි. එය අසන්න.\n\nමහණෙනි, තවන ධ​ර්ම​ය කවරේද? මි​ත්‍යා දෘෂ්ටියෙන් පටන් ගෙන, මි​ත්‍යා විමුක්තියෙන් කෙළවර වන මේ සියල්ල, මහණෙනි, තවන ධ​ර්ම​ය යැයි කියනු ලැබේ.\n\nමහණෙනි, නොතවන ධ​ර්ම​ය කවරේද? සම්මා දෘෂ්ටියෙන් පටන් ගෙන, සම්මා විමුක්තියෙන් කෙළවර වන මේ සියල්ල, මහණෙනි, නොතවන ධ​ර්ම​ය යැයි කියනු ලැබේ.",
      "paliTitle": "Tapanīyasuttaṃ"
    },
    {
      "number": 142,
      "pali": "‘‘Ācayagāmiñca vo, bhikkhave, dhammaṃ desessāmi apacayagāmiñca. Taṃ suṇātha…pe… katamo ca, bhikkhave, ācayagāmī dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, ācayagāmī dhammo. Katamo ca, bhikkhave, apacayagāmī dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, apacayagāmī dhammo’’ti. Navamaṃ.",
      "english": "Monks, I shall teach you the Dhamma that leads to accumulation and the Dhamma that leads to diminution. Listen to that, and pay careful attention, I shall speak. And what, monks, is the Dhamma that leads to accumulation? Wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, and wrong liberation – this, monks, is called the Dhamma that leads to accumulation. And what, monks, is the Dhamma that leads to diminution? Right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, and right liberation – this, monks, is called the Dhamma that leads to diminution.",
      "sinhala": "මහණෙනි, මම ඔබට සසර වර්ධනයට හේතුවන ධර‍්මයද, සසර ක්ෂයවීමට හේතුවන ධර‍්මයද දේශනා කරන්නෙමි. එය හොඳින් අසන්න.\n\nමහණෙනි, සසර වර්ධනයට හේතුවන ධර‍්මය කවරේද? මිථ්‍යාදෘෂ්ටිය පටන් මිථ්‍යාවිමුක්තිය දක්වා වූ මේ ධර‍්මය, මහණෙනි, සසර වර්ධනයට හේතුවන ධර‍්මය යයි කියනු ලැබේ.\n\nමහණෙනි, සසර ක්ෂයවීමට හේතුවන ධර‍්මය කවරේද? සම්මාදිට්ඨිය පටන් සම්මාවිමුක්තිය දක්වා වූ මේ ධර‍්මය, මහණෙනි, සසර ක්ෂයවීමට හේතුවන ධර‍්මය යයි කියනු ලැබේ.",
      "paliTitle": "Ācayagāmisuttaṃ"
    },
    {
      "number": 143,
      "pali": "‘‘Dukkhudrayañca vo, bhikkhave, dhammaṃ desessāmi sukhudrayañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, dukkhudrayo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, dukkhudrayo dhammo. Katamo ca, bhikkhave, sukhudrayo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, sukhudrayo dhammo’’ti. Dasamaṃ.",
      "english": "Monks, I shall teach you principles that lead to suffering and principles that lead to happiness. Listen to it carefully. And what, monks, is the principle that leads to suffering? Wrong view, and so forth, up to wrong liberation – this, monks, is called the principle that leads to suffering. And what, monks, is the principle that leads to happiness? Right view, and so forth, up to right liberation – this, monks, is called the principle that leads to happiness.",
      "sinhala": "මහණෙනි, දුකට හේතු වන ධර්මයත්, සැපයට හේතු වන ධර්මයත් මම ඔබට දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, දුකට හේතු වන ධර්මය කවරේද? මිථ්‍යාදෘෂ්ටිය... මිථ්‍යාවිමුක්තිය. මහණෙනි, මෙය දුකට හේතු වන ධර්මය යැයි කියනු ලැබේ. මහණෙනි, සැපයට හේතු වන ධර්මය කවරේද? සම්මාදිට්ඨිය... සම්මාවිමුක්තිය. මහණෙනි, මෙය සැපයට හේතු වන ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Dukkhudrayasuttaṃ"
    },
    {
      "number": 144,
      "pali": "‘‘Dukkhavipākañca vo, bhikkhave, dhammaṃ desessāmi sukhavipākañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, dukkhavipāko dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, dukkhavipāko dhammo. Katamo ca, bhikkhave, sukhavipāko dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, sukhavipāko dhammo’’ti. Ekādasamaṃ. ",
      "english": "Monastics, I shall teach you the teaching that leads to painful results and the teaching that leads to pleasant results. Listen to that. And what, Monastics, is the teaching that leads to painful results? Wrong view, and so forth, up to wrong deliverance — this, Monastics, is called the teaching that leads to painful results. And what, Monastics, is the teaching that leads to pleasant results? Right view, and so forth, up to right deliverance — this, Monastics, is called the teaching that leads to pleasant results.",
      "sinhala": "භික්ෂූණි, දුක්ඛවිපාක ඇති ධර‍්මයත්, සුඛවිපාක ඇති ධර‍්මයත් මම ඔබට දේශනා කරන්නෙමි. එය අසන්න. භික්ෂූණි, දුක්ඛවිපාක ඇති ධර‍්මය කවරේද? මිත්‍යාදෘෂ්ටියේ සිට මිත්‍යාවිමුක්තිය දක්වා වූ ධර‍්මයයි. භික්ෂූණි, මේ ධර‍්මය දුක්ඛවිපාක ඇති ධර‍්මය ලෙස කියනු ලැබේ.\n\nභික්ෂූණි, සුඛවිපාක ඇති ධර‍්මය කවරේද? සම්මාදිට්ඨියේ සිට සම්මාවිමුක්තිය දක්වා වූ ධර‍්මයයි. භික්ෂූණි, මේ ධර‍්මය සුඛවිපාක ඇති ධර‍්මය ලෙස කියනු ලැබේ.",
      "paliTitle": "Dukkhavipākasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Sādhuvaggo catuttho.",
    "english": "",
    "sinhala": ""
  }
}