{
  "id": "an10.23",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The Repetitive Exposition on Passion",
    "sinhala": "රාගය පිළිබඳ පෙය්‍යාලය."
  },
  "sections": [
    {
      "number": 237,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya dasa dhammā bhāvetabbā. Katame dasa? Asubhasaññā, maraṇasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā, aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā, nirodhasaññā – rāgassa, bhikkhave, abhiññāya ime dasa dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct knowledge of passion, ten qualities should be developed. Which ten? The perception of foulness, the perception of death, the perception of repulsion in food, the perception of disenchantment with the entire world, the perception of impermanence, the perception of suffering in the impermanent, the perception of non-self in suffering, the perception of abandoning, the perception of dispassion, the perception of cessation – these ten qualities, monks, should be developed for the direct knowledge of passion.",
      "sinhala": "මහණෙනි, රාගය අවබෝධය පිණිස දහම් දහයක් වැඩිය යුතු ය. ඒ දහය කවරේ ද යත්: අසුභ සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සියලු ලෝකයෙහි අනාස්වාද සංඥාව, අනිත්‍ය සංඥාව, අනිත්‍යයෙහි දුක්ඛ සංඥාව, දුක්ඛයෙහි අනාත්ම සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව, නිරෝධ සංඥාව යි. මහණෙනි, රාගය අවබෝධය පිණිස මේ දහම් දහය වැඩිය යුතු ය.",
      "paliTitle": ""
    },
    {
      "number": 238,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya dasa dhammā bhāvetabbā. Katame dasa? Aniccasaññā, anattasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā, aṭṭhikasaññā, puḷavakasaññā [pulavakasaññā (sī.) puḷuvakasaññā (ka.)], vinīlakasaññā, vipubbakasaññā, vicchiddakasaññā, uddhumātakasaññā – rāgassa, bhikkhave, abhiññāya ime dasa dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct comprehension of lust, ten perceptions should be cultivated. Which are these ten? The perception of impermanence, the perception of non-self, the perception of the repulsiveness of food, the perception of disenchantment with the entire world, the perception of a skeletal frame, the perception of a corpse infested by worms, the perception of a livid corpse, the perception of a festering corpse, the perception of a dismembered corpse, and the perception of a bloated corpse. Monks, for the direct comprehension of lust, these ten perceptions should be cultivated.",
      "sinhala": "රාගය සම්පූර්ණයෙන් අවබෝධ කර ගැනීම සඳහා, භික්ෂූන් වහන්ස, ධර්ම දහයක් වැඩිය යුතු ය.\n\nඒ දහය කවරහු ද?\n\nඅනිත්‍ය බව පිළිබඳ සංඥාව, අනාත්ම බව පිළිබඳ සංඥාව, ආහාරයෙහි පිළිකුල් බව පිළිබඳ සංඥාව, සකල ලෝකයෙහිම නොඇල්ම පිළිබඳ සංඥාව, අස්ථි සංඥාව, පණුවන්ගෙන් පිරුණු බව පිළිබඳ සංඥාව, නිල්වූ බව පිළිබඳ සංඥාව, සැරව ගැලීම පිළිබඳ සංඥාව, සිඳී බිඳී වෙන්වූ බව පිළිබඳ සංඥාව, පිම්බී ගිය බව පිළිබඳ සංඥාව – භික්ෂූන් වහන්ස, රාගය සම්පූර්ණයෙන් අවබෝධ කර ගැනීම සඳහා මේ ධර්ම දහය වැඩිය යුතු ය.",
      "paliTitle": ""
    },
    {
      "number": 239,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya dasa dhammā bhāvetabbā. Katame dasa? Sammādiṭṭhi, sammāsaṅkappo, sammāvācā, sammākammanto, sammāājīvo, sammāvāyāmo, sammāsati, sammāsamādhi, sammāñāṇaṃ, sammāvimutti – rāgassa, bhikkhave, abhiññāya ime dasa dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct knowledge and full comprehension of attachment, these ten qualities are to be developed. Which ten? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, Right Release – Monks, for the direct knowledge and full comprehension of attachment, these ten qualities are to be developed.",
      "sinhala": "මහණෙනි, රාගය ප්‍රඥාවෙන් අවබෝධ කරගැනීම පිණිස ධර්ම දහයක් වඩනු ලැබිය යුතුය. ඒ දහය කවරේද? සම්මා දිට්ඨිය, සම්මා සංකප්පය, සම්මා වාචාව, සම්මා කම්මන්තය, සම්මා ආජීවය, සම්මා වායාමය, සම්මා සතිය, සම්මා සමාධිය, සම්මා ඤාණය, සම්මා විමුක්තිය – මහණෙනි, රාගය ප්‍රඥාවෙන් අවබෝධ කරගැනීම පිණිස මේ ධර්ම දහය වඩනු ලැබිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 240,
      "numberRange": "240-266",
      "pali": "‘‘Rāgassa, bhikkhave, pariññāya…pe… parikkhayāya… pahānāya… khayāya… vayāya… virāgāya… nirodhāya… ( ) [(upasamāya) (sī. syā. pī.) aññesaṃ pana nipātānaṃ pariyosāne idaṃ padaṃ na dissati] cāgāya… paṭinissaggāya…pe… ime dasa dhammā bhāvetabbā.",
      "english": "Monks, for the complete understanding of greed, for its utter exhaustion, for its abandonment, for its destruction, for its fading away, for dispassion towards it, for its cessation, for its relinquishment, and for its renunciation – these ten qualities are to be cultivated.",
      "sinhala": "භික්ෂූණි, රාගයෙහි සම්පූර්ණ අවබෝධය පිණිස, මුළුමනින්ම ක්ෂය කිරීම පිණිස, ප්‍රහාණය කිරීම පිණිස, ක්ෂය වීම පිණිස, වැනසීම පිණිස, විරාගය පිණිස, නිරෝධය පිණිස, උපශාන්තිය පිණිස, මුදාහැරීම පිණිස සහ ප්‍රතිනිස්සර්ගය පිණිස, මේ ධ‍්‍ර‍්ම දහය වැඩිය යුතු ය.",
      "paliTitle": ""
    },
    {
      "number": 267,
      "numberRange": "267-746",
      "pali": "‘‘Dosassa …pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa pariññāya…pe… parikkhayāya… pahānāya … khayāya… vayāya… virāgāya… nirodhāya… ( ) [(upasamāya) (sī. syā. pī.) aññesaṃ pana nipātānaṃ pariyosāne idaṃ padaṃ na dissati] cāgāya… paṭinissaggāya…pe… ime dasa dhammā bhāvetabbā’’ti.",
      "english": "For the complete comprehension, utter destruction, abandonment, destruction, disappearance, dispassion, cessation, relinquishment, and renunciation of hatred, delusion, anger, resentment, disparaging, rivalry, envy, avarice, deceit, craftiness, obstinacy, presumption, conceit, excessive pride, intoxication, and heedlessness—these ten qualities are to be developed.",
      "sinhala": "දෝසය, මෝහය, ක්‍රෝධය, උපනාහය, මක්ඛය, පළාසය, ඊර්ෂ්‍යාව, මච්ඡරිය, මායාව, සාඨෙය්‍යය, ථම්භය, සාරම්භය, මානය, අතිමානය, මදය, ප්‍රමාදය යන මේ ධර්මයන්ගේ පරිඥාව පිණිසද, පරික්ඛය පිණිසද, ප්‍රහාණය පිණිසද, ක්ෂය පිණිසද, ව්‍යය පිණිසද, විරාගය පිණිසද, නිරෝධය පිණිසද, ත්‍යාගය පිණිසද, ප්‍රතිනිස්සර්ගය පිණිසද, මෙම දස ධර්මයන් වඩනු ලැබිය යුතුය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ.",
    "english": "",
    "sinhala": ""
  }
}