{
  "id": "an10.15",
  "title": {
    "pali": "Ariyavaggo",
    "english": "The Noble Chapter",
    "sinhala": "අරිය වර්ගය"
  },
  "sections": [
    {
      "number": 145,
      "pali": "‘‘Ariyamaggañca vo, bhikkhave, dhammaṃ desessāmi anariyamaggañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, anariyo maggo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, anariyo maggo. Katamo ca, bhikkhave, ariyo maggo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, ariyo maggo’’ti. Paṭhamaṃ.",
      "english": "“Monks, I will teach you the Dhamma: the Noble Path and the ignoble path. Listen to that.\n\nAnd what, monks, is the ignoble path? Wrong View, Wrong Intention, Wrong Speech, Wrong Action, Wrong Livelihood, Wrong Effort, Wrong Mindfulness, Wrong Concentration, Wrong Knowledge, Wrong Liberation – this, monks, is called the ignoble path.\n\nAnd what, monks, is the Noble Path? Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration, Right Knowledge, Right Liberation – this, monks, is called the Noble Path.”\n\nFirst.",
      "sinhala": "මහණෙනි, මම ඔබට ආර්ය මාර්ගය ද අනාර්ය මාර්ගය ද ධර්මය දේශනා කරන්නෙමි. එයට හොඳින් සවන් දෙන්න, මැනවින් මෙනෙහි කරන්න. මහණෙනි, අනාර්ය මාර්ගය කවරෙක් ද? මිත්‍යාදෘෂ්ටියේ සිට මිත්‍යාවිමුක්තිය දක්වා වූ මෙය මහණෙනි, අනාර්ය මාර්ගය යැයි කියනු ලැබේ. මහණෙනි, ආර්ය මාර්ගය කවරෙක් ද? සම්මාදිට්ඨියේ සිට සම්මාවිමුක්තිය දක්වා වූ මෙය මහණෙනි, ආර්ය මාර්ගය යැයි කියනු ලැබේ.",
      "paliTitle": "Ariyamaggasuttaṃ"
    },
    {
      "number": 146,
      "pali": "‘‘Kaṇhamaggañca vo, bhikkhave, dhammaṃ desessāmi sukkamaggañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, kaṇhamaggo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, kaṇhamaggo. Katamo ca, bhikkhave, sukkamaggo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, sukkamaggo’’ti. Dutiyaṃ.",
      "english": "Monks, I will teach you the Dhamma of the dark path and the bright path. Listen to that. And what, monks, is the dark path? Wrong view, wrong resolve, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, and wrong liberation – this, monks, is called the dark path. And what, monks, is the bright path? Right view, right resolve, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, and right liberation – this, monks, is called the bright path.",
      "sinhala": "මහණෙනි, මම ඔබට කණ්හ මාර්ගය සහ සුක්ක මාර්ගය නම් වූ ධ‍ර්මය දේශනා කරන්නෙමි. එය අසන්න.\n\nමහණෙනි, කණ්හ මාර්ගය යනු කුමක්ද? මිත්‍යාදෘෂ්ටිය, මිත්‍යාසංකල්පය, මිථ්‍යාවාචාව, මිථ්‍යාකර්මාන්තය, මිථ්‍යාආජීවය, මිථ්‍යාව්‍යායාමය, මිථ්‍යාස්මෘතිය, මිථ්‍යාසමාධිය, සහ මිථ්‍යාවිමුක්තිය – මහණෙනි, මෙය කණ්හ මාර්ගය යැයි කියනු ලැබේ.\n\nමහණෙනි, සුක්ක මාර්ගය යනු කුමක්ද? සම්මාදිට්ඨිය, සම්මාසංකල්පය, සම්මාවාචාව, සම්මාකම්මන්තය, සම්මාආජීවය, සම්මාව්‍යායාමය, සම්මාසතිය, සම්මාසමාධිය, සහ සම්මාවිමුක්තිය – මහණෙනි, මෙය සුක්ක මාර්ගය යැයි කියනු ලැබේ.",
      "paliTitle": "Kaṇhamaggasuttaṃ"
    },
    {
      "number": 147,
      "pali": "‘‘Saddhammañca vo, bhikkhave, dhammaṃ desessāmi asaddhammañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, asaddhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, asaddhammo. Katamo ca, bhikkhave, saddhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, saddhammo’’ti. Tatiyaṃ.",
      "english": "Monks, I will teach you the True Dhamma and the Untrue Dhamma. Listen to that. And what, monks, is the Untrue Dhamma? Wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, wrong liberation – this, monks, is called the Untrue Dhamma. And what, monks, is the True Dhamma? Right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, right liberation – this, monks, is called the True Dhamma.",
      "sinhala": "මහණෙනි, මම ඔබට සද්ධර්මයත්, අසද්ධර්මයත් දේශනා කරන්නෙමි. එය අසන්න.\n\nමහණෙනි, අසද්ධර්මය කවරේද? මිථ්‍යාදෘෂ්ටිය ආදී කොටගෙන, අවසානයේ මිථ්‍යාවිමුක්තිය දක්වා වූ මේ සියල්ල, මහණෙනි, අසද්ධර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, සද්ධර්මය කවරේද? සම්මාදිට්ඨිය ආදී කොටගෙන, අවසානයේ සම්මාවිමුක්තිය දක්වා වූ මේ සියල්ල, මහණෙනි, සද්ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Saddhammasuttaṃ"
    },
    {
      "number": 148,
      "pali": "‘‘Sappurisadhammañca vo, bhikkhave, desessāmi asappurisadhammañca. Taṃ suṇātha … pe… katamo ca, bhikkhave, asappurisadhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, asappurisadhammo. Katamo ca, bhikkhave, sappurisadhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, sappurisadhammo’’ti. Catutthaṃ.",
      "english": "Monks, I shall teach you the qualities of a noble person and the qualities of an ignoble person. Listen carefully to it. And what, monks, are the qualities of an ignoble person? It is wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation. This, monks, is called the qualities of an ignoble person. And what, monks, are the qualities of a noble person? It is right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation. This, monks, is called the qualities of a noble person.",
      "sinhala": "භික්ෂූනි, මම ඔබට සත්පුරුෂ ධර්‍මයද, අසත්පුරුෂ ධර්‍මයද දේශනා කරන්නෙමි. ඊට සවන් දෙන්න. භික්ෂූනි, අසත්පුරුෂ ධර්‍මය කුමක්ද? මිථ්‍යාදෘෂ්ටියෙන් ආරම්භ වී, මිථ්‍යාවිමුක්තිය දක්වා වූ ධර්‍මයන්ය. භික්ෂූනි, මෙය අසත්පුරුෂ ධර්‍මය යැයි කියනු ලැබේ. භික්ෂූනි, සත්පුරුෂ ධර්‍මය කුමක්ද? සම්මාදිට්ඨියෙන් ආරම්භ වී, සම්මාවිමුක්තිය දක්වා වූ ධර්‍මයන්ය. භික්ෂූනි, මෙය සත්පුරුෂ ධර්‍මය යැයි කියනු ලැබේ.",
      "paliTitle": "Sappurisadhammasuttaṃ"
    },
    {
      "number": 149,
      "pali": "‘‘Uppādetabbañca vo, bhikkhave, dhammaṃ desessāmi na uppādetabbañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, na uppādetabbo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, na uppādetabbo dhammo. Katamo ca, bhikkhave, uppādetabbo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, uppādetabbo dhammo’’ti. Pañcamaṃ.",
      "english": "Monks, I will teach you the teachings that should be cultivated and those that should not be cultivated. Listen to them… And what, monks, is the teaching that should not be cultivated? Wrong view… up to… wrong liberation – this, monks, is called the teaching that should not be cultivated. And what, monks, is the teaching that should be cultivated? Right view… up to… right liberation – this, monks, is called the teaching that should be cultivated.",
      "sinhala": "මහණෙනි, ඔබට වැඩිය යුතු ධර්මයද, නොවැඩිය යුතු ධර්මයද දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, නොවැඩිය යුතු ධර්මය කවරේද? මිත්‍යාදෘෂ්ටිය... මිත්‍යාවිමුක්තිය යනු, මහණෙනි, නොවැඩිය යුතු ධර්මයයි. මහණෙනි, වැඩිය යුතු ධර්මය කවරේද? සම්මාදෘෂ්ටිය... සම්මාවිමුක්තිය යනු, මහණෙනි, වැඩිය යුතු ධර්මයයි.",
      "paliTitle": "Uppādetabbasuttaṃ"
    },
    {
      "number": 150,
      "pali": "‘‘Āsevitabbañca vo, bhikkhave, dhammaṃ desessāmi na āsevitabbañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, na āsevitabbo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, na āsevitabbo dhammo. Katamo ca, bhikkhave, āsevitabbo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, āsevitabbo dhammo’’ti. Chaṭṭhaṃ.",
      "english": "Monastics, I shall teach you the teaching that is to be cultivated and that which is not to be cultivated. Listen to it. And what, monastics, is the teaching that is not to be cultivated? From wrong view to wrong liberation – this, monastics, is called the teaching that is not to be cultivated.\n\nAnd what, monastics, is the teaching that is to be cultivated? From right view to right liberation – this, monastics, is called the teaching that is to be cultivated.",
      "sinhala": "භික්‍ෂූණි, සේවනය කළ යුතු වූත්, සේවනය නොකළ යුතු වූත් ධර්‍මයක් මම ඔබට දේශනා කරන්නෙමි. එය අසන්න. භික්‍ෂූණි, සේවනය නොකළ යුතු ධර්මය කවරේ ද? මිථ්‍යාදෘෂ්ටිය… මිථ්‍යාවිමුක්තිය යන මේ ධර්මය භික්‍ෂූණි, සේවනය නොකළ යුතු ධර්මය යැයි කියනු ලැබේ. භික්‍ෂූණි, සේවනය කළ යුතු ධර්මය කවරේ ද? සම්මාදිට්ඨිය… සම්මාවිමුක්තිය යන මේ ධර්මය භික්‍ෂූණි, සේවනය කළ යුතු ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Āsevitabbasuttaṃ"
    },
    {
      "number": 151,
      "pali": "‘‘Bhāvetabbañca vo, bhikkhave, dhammaṃ desessāmi na bhāvetabbañca. Taṃ suṇātha…pe… katamo ca, bhikkhave, na bhāvetabbo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, na bhāvetabbo dhammo. Katamo ca, bhikkhave, bhāvetabbo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, bhāvetabbo dhammo’’ti. Sattamaṃ.",
      "english": "Monks, I will teach you the Dhamma that is to be cultivated and the Dhamma that is not to be cultivated. Listen to it.\n\nAnd what, monks, is the Dhamma not to be cultivated? Wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation. This, monks, is called the Dhamma not to be cultivated.\n\nAnd what, monks, is the Dhamma to be cultivated? Right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation. This, monks, is called the Dhamma to be cultivated.",
      "sinhala": "භික්‍ෂූනි, වැඩිය යුතු ධර්මයත්, නොවැඩිය යුතු ධර්මයත් මම ඔබට දේශනා කරන්නෙමි. එය ශ්‍රවණය කරව. භික්‍ෂූනි, නොවැඩිය යුතු ධර්මය කවරේද? මිත්‍යාදෘෂ්ටියේ සිට මිත්‍යාවිමුක්තිය දක්වා වූ ධර්මය, භික්‍ෂූනි, නොවැඩිය යුතු ධර්මය යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, වැඩිය යුතු ධර්මය කවරේද? සම්මාදෘෂ්ටියේ සිට සම්මාවිමුක්තිය දක්වා වූ ධර්මය, භික්‍ෂූනි, වැඩිය යුතු ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Bhāvetabbasuttaṃ"
    },
    {
      "number": 152,
      "pali": "‘‘Bahulīkātabbañca vo, bhikkhave, dhammaṃ desessāmi na bahulīkātabbañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, na bahulīkātabbo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, na bahulīkātabbo dhammo. Katamo ca, bhikkhave, bahulīkātabbo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, bahulīkātabbo dhammo’’ti. Aṭṭhamaṃ.",
      "english": "Monks, I will teach you the Dhamma that is to be extensively cultivated and that which is not to be extensively cultivated. Listen to it.\n\nAnd what, monks, is the Dhamma that is not to be extensively cultivated? It is wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation. This, monks, is called the Dhamma that is not to be extensively cultivated.\n\nAnd what, monks, is the Dhamma that is to be extensively cultivated? It is right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation. This, monks, is called the Dhamma that is to be extensively cultivated.",
      "sinhala": "භික්ෂූණි, වඩනු ලැබිය යුතු ධර්මයත්, නොවැඩිය යුතු ධර්මයත් මම ඔබට දේශනා කරන්නෙමි. එය අසන්න...\n\nභික්ෂූණි, නොවැඩිය යුතු ධර්මය කවරේද? මිථ්‍යාදෘෂ්ටි​ය... මිථ්‍යාවිමුක්ති​ය – භික්ෂූණි, මෙය නොවැඩිය යුතු ධර්ම​ය යැයි කියනු ලැබේ.\n\nභික්ෂූණි, වැඩිය යුතු ධර්මය කවරේද? සම්මාදිට්ඨි​ය... සම්මාවිමුක්ති​ය – භික්ෂූණි, මෙය වැඩිය යුතු ධර්ම​ය යැයි කියනු ලැබේ.",
      "paliTitle": "Bahulīkātabbasuttaṃ"
    },
    {
      "number": 153,
      "pali": "‘‘Anussaritabbañca vo, bhikkhave, dhammaṃ desessāmi na anussaritabbañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, na anussaritabbo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, na anussaritabbo dhammo. Katamo ca, bhikkhave, anussaritabbo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, anussaritabbo dhammo’’ti. Navamaṃ.",
      "english": "Monks, I shall teach you the teaching that should be remembered and that which should not be remembered. Listen to it. And what, monks, is the teaching that should not be remembered? It is wrong view through to wrong liberation. This, monks, is called the teaching that should not be remembered. And what, monks, is the teaching that should be remembered? It is right view through to right liberation. This, monks, is called the teaching that should be remembered.",
      "sinhala": "මහණෙනි, මම ඔබට මෙනෙහි කළයුතු ධර්මයද, මෙනෙහි නොකළයුතු ධර්මයද දේශනා කරන්නෙමි. එයට සවන් දෙන්න, හොඳින් මෙනෙහි කරන්න, මම දැන් දේශනා කරන්නෙමි.\n\nමහණෙනි, මෙනෙහි නොකළයුතු ධර්මය කවරේද? මිථ්‍යාදෘෂ්ටිය, මිථ්‍යාසංකප්පය, මිථ්‍යාවාචාව, මිථ්‍යාකම්මන්තය, මිථ්‍යාආජීවය, මිථ්‍යාවායාමය, මිථ්‍යාසතිය, මිථ්‍යාසමාධිය, මිථ්‍යාවිමුක්තිය – මහණෙනි, මේ ධර්මය මෙනෙහි නොකළයුතු ධර්මය යැයි කියනු ලැබේ.\n\nමහණෙනි, මෙනෙහි කළයුතු ධර්මය කවරේද? සම්මාදෘෂ්ටිය, සම්මාසංකප්පය, සම්මාවාචාව, සම්මාකම්මන්තය, සම්මාආජීවය, සම්මාවායාමය, සම්මාසතිය, සම්මාසමාධිය, සම්මාවිමුක්තිය – මහණෙනි, මේ ධර්මය මෙනෙහි කළයුතු ධර්මය යැයි කියනු ලැබේ.",
      "paliTitle": "Anussaritabbasuttaṃ"
    },
    {
      "number": 154,
      "pali": "‘‘Sacchikātabbañca vo, bhikkhave, dhammaṃ desessāmi na sacchikātabbañca. Taṃ suṇātha… pe… katamo ca, bhikkhave, na sacchikātabbo dhammo? Micchādiṭṭhi…pe… micchāvimutti – ayaṃ vuccati, bhikkhave, na sacchikātabbo dhammo. Katamo ca, bhikkhave, sacchikātabbo dhammo? Sammādiṭṭhi…pe… sammāvimutti – ayaṃ vuccati, bhikkhave, sacchikātabbo dhammo’’ti. Dasamaṃ. ",
      "english": "Monks, I shall teach you the qualities that are to be realized and the qualities that are not to be realized. Listen to that and pay close attention. And what, monks, are the qualities that are not to be realized? Wrong view, wrong intention, wrong speech, wrong action, wrong livelihood, wrong effort, wrong mindfulness, wrong concentration, wrong knowledge, and wrong liberation – this, monks, is called the qualities that are not to be realized. And what, monks, are the qualities that are to be realized? Right view, right intention, right speech, right action, right livelihood, right effort, right mindfulness, right concentration, right knowledge, and right liberation – this, monks, is called the qualities that are to be realized.",
      "sinhala": "මහණෙනි, මම ඔබට සාක්‍ෂාත් කළ යුතු ධර්මයත්, සාක්‍ෂාත් නොකළ යුතු ධර්මයත් දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, සාක්‍ෂාත් නොකළ යුතු ධර්මය කවරේද? මිත්‍යාදෘෂ්ටි, මිත්‍යාසංකල්ප, මිත්‍යාවාචා, මිත්‍යාකර්මාන්ත, මිත්‍යාආජීව, මිත්‍යාව්‍යායාම, මිත්‍යාස්මෘති, මිත්‍යාසමාධි සහ මිත්‍යාවිමුක්ති — මහණෙනි, මෙය සාක්‍ෂාත් නොකළ යුතු ධර්මයයි කියනු ලැබේ. මහණෙනි, සාක්‍ෂාත් කළ යුතු ධර්මය කවරේද? සම්මාදිට්ඨි, සම්මාසංකල්ප, සම්මාවාචා, සම්මාකර්මාන්ත, සම්මාආජීව, සම්මාව්‍යායාම, සම්මාස්මෘති, සම්මාසමාධි සහ සම්මාවිමුක්ති — මහණෙනි, මෙය සාක්‍ෂාත් කළ යුතු ධර්මයයි කියනු ලැබේ.",
      "paliTitle": "Sacchikātabbasuttaṃ"
    },
    {
      "number": 4,
      "pali": "Catutthapaṇṇāsakaṃ",
      "english": "The Fourth Fifties",
      "sinhala": "චතුත්ථපණ්ණාසකං",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Ariyavaggo pañcamo. Tatiyapaṇṇāsakaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}