{
  "id": "an10.3",
  "title": {
    "pali": "Mahāvaggo",
    "english": "The Great Chapter",
    "sinhala": "මහාවග්ගය"
  },
  "sections": [
    {
      "number": 21,
      "pali": "‘‘Sīho, bhikkhave, migarājā sāyanhasamayaṃ āsayā nikkhamati. Āsayā nikkhamitvā vijambhati. Vijambhitvā samantā catuddisaṃ [catuddisā (syā. ka.) a. ni. 6.64] anuviloketi. Samantā catuddisaṃ [catuddisā (syā. ka.) a. ni. 6.64] anuviloketvā tikkhattuṃ sīhanādaṃ nadati. Tikkhattuṃ sīhanādaṃ naditvā gocarāya pakkamati. Taṃ kissa hetu? ‘Māhaṃ khuddake pāṇe visamagate saṅghātaṃ āpādesi’nti! ‘‘‘Sīho’ti, kho bhikkhave, tathāgatassetaṃ adhivacanaṃ arahato sammāsambuddhassa. Yaṃ kho, bhikkhave, tathāgato parisāya dhammaṃ deseti, idamassa hoti sīhanādasmiṃ. [ma. ni. 1.148; vibha. 760; paṭi. ma. 2.44] ‘‘Dasayimāni, bhikkhave, tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Katamāni dasa? Idha, bhikkhave, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato anekadhātuṃ nānādhātuṃ lokaṃ [anekadhātunānādhātulokaṃ (sī. ka.)] yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato anekadhātuṃ nānādhātuṃ lokaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti…pe… brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato sattānaṃ nānādhimuttikataṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato sattānaṃ nānādhimuttikataṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti…pe… brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ pajānāti. Yampi, bhikkhave, tathāgato parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti… pe… brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ pajānāti. Yampi…pe… pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti…pe… brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampi bhikkhave, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. Yampi, bhikkhave, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, bhikkhave, tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Yampi, bhikkhave, tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, idampi, bhikkhave, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Imāni kho, bhikkhave, dasa tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavattetī’’ti. Paṭhamaṃ.",
      "english": "Monks, a lion, king of beasts, in the evening, emerges from its lair. Having emerged from its lair, it stretches. Having stretched, it surveys all four directions. Having surveyed all four directions, it roars its lion's roar three times. Having roared its lion's roar three times, it sets out for its hunting ground. What is the reason for this? \"May I not harm any small creatures that have strayed into my path!\"\n\nMonks, \"the Lion\" is indeed an epithet for the Tathāgata, the Arahant, the Fully Awakened One. Monks, when the Tathāgata teaches the Dhamma to an assembly, this is his lion's roar.\n\nMonks, these are the ten Tathāgata powers with which the Tathāgata is endowed, enabling him to claim the supreme state, to roar his lion's roar in assemblies, and to set rolling the unsurpassed Wheel of Dhamma. Which are these ten?\n\nHere, monks, the Tathāgata understands as it actually is, the possible as possible and the impossible as impossible. This too, monks, is a Tathāgata power of the Tathāgata, relying on which power the Tathāgata claims the supreme state, roars his lion's roar in assemblies, and sets rolling the unsurpassed Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata understands as it actually is, the results, with their underlying conditions and causes, of past, present, and future volitional actions. This too, monks, is a Tathāgata power of the Tathāgata, relying on which power the Tathāgata claims the supreme state, roars his lion's roar in assemblies, and sets rolling the unsurpassed Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata understands as it actually is, the path leading to all destinations. This too, monks, is a Tathāgata power of the Tathāgata, relying on which power the Tathāgata claims the supreme state, roars his lion's roar in assemblies, and sets rolling the unsurpassed Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata understands as it actually is, the world with its many and varied elements. This too, monks, is a Tathāgata power of the Tathāgata, relying on which power the Tathāgata claims the supreme state, roars his lion's roar in assemblies, and sets rolling the unsurpassed Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata understands as it actually is, the diverse dispositions of beings. This too, monks, is a Tathāgata power of the Tathāgata, relying on which power the Tathāgata claims the supreme state, roars his lion's roar in assemblies, and sets rolling the unsurpassed Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata understands as it actually is, the superior and inferior spiritual faculties of other beings and persons. This too, monks, is a Tathāgata power of the Tathāgata, relying on which power the Tathāgata claims the supreme state, roars his lion's roar in assemblies, and sets rolling the unsurpassed Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata understands as it actually is, the defilement, purification, and emergence from the jhānas, liberations, concentrations, and attainments. This too, monks, is a Tathāgata power of the Tathāgata, relying on which power the Tathāgata claims the supreme state, roars his lion's roar in assemblies, and sets rolling the unsurpassed Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata recollects his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion. He recollects: ‘There I was such a name, of such a clan, of such a complexion, fed on such food, experiencing such pleasure and pain, with such a lifespan. Passing away from there, I was reborn here. And there I was such a name, of such a clan, of such a complexion, fed on such food, experiencing such pleasure and pain, with such a lifespan. Passing away from there, I was reborn here.’ Thus, he recollects his manifold past lives with their distinct modes and details. And when, monks, the Tathāgata recollects his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion. He recollects: ‘There I was such a name, of such a clan, of such a complexion, fed on such food, experiencing such pleasure and pain, with such a lifespan. Passing away from there, I was reborn here. And there I was such a name, of such a clan, of such a complexion, fed on such food, experiencing such pleasure and pain, with such a lifespan. Passing away from there, I was reborn here.’ Thus, he recollects his manifold past lives with their distinct modes and details—this too, monks, is a Tathāgata power of the Tathāgata, relying on which power the Tathāgata claims the supreme state, roars his lion's roar in assemblies, and sets rolling the unsurpassed Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata, with the divine eye, purified and surpassing that of humans, sees beings passing away and reappearing, inferior and noble, beautiful and ugly, fortunate and unfortunate, and understands them according to their deeds: ‘Indeed, these venerable beings, endowed with misconduct of body, misconduct of speech, misconduct of mind, slandering the Noble Ones, holding wrong views, and undertaking actions based on wrong views, upon the dissolution of the body, after death, have reappeared in a state of deprivation, a miserable destination, a lower realm, in hell. Or these venerable beings, endowed with good conduct of body, good conduct of speech, good conduct of mind, not slandering the Noble Ones, holding right views, and undertaking actions based on right views, upon the dissolution of the body, after death, have reappeared in a fortunate destination, in a heavenly world.’ Thus, with the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing, inferior and noble, beautiful and ugly, fortunate and unfortunate, and understands them according to their deeds. And that the Tathāgata, monks, with the divine eye, purified and surpassing that of humans, sees beings passing away and reappearing, inferior and noble, beautiful and ugly, fortunate and unfortunate, and understands them according to their deeds – this too, monks, is a power of the Tathāgata; relying on which power, the Tathāgata claims the foremost state, roars his lion's roar in assemblies, and sets rolling the supreme Wheel of Dhamma.\n\nFurthermore, monks, the Tathāgata, by the destruction of the taints, himself directly knows, realizes, and attains in this very life the taintless liberation of mind and liberation by wisdom, and abides therein. And that the Tathāgata, monks, by the destruction of the taints, himself directly knows, realizes, and attains in this very life the taintless liberation of mind and liberation by wisdom, and abides therein – this too, monks, is a power of the Tathāgata; relying on which power, the Tathāgata claims the foremost state, roars his lion's roar in assemblies, and sets rolling the supreme Wheel of Dhamma.\n\nThese, monks, are the ten powers of the Tathāgata, with which powers endowed, the Tathāgata claims the foremost state, roars his lion's roar in assemblies, and sets rolling the supreme Wheel of Dhamma.",
      "sinhala": "භික්ෂූනි, මෘගරාජ වූ සිංහයා සවස් කාලයේ තමාගේ ගුහාවෙන් පිටතට පැමිණෙයි. ගුහාවෙන් පිටතට පැමිණ, ඇඟ දිගහරියි. ඇඟ දිගහැර, සතර දිශාව පුරා හොඳින් බලයි. සතර දිශාව පුරා හොඳින් බලා, තුන් වරක් සිංහනාද කරයි. තුන් වරක් සිංහනාද කර, ආහාර සොයා යයි. එයට හේතුව කුමක්ද? 'මා කුඩා ප්‍රාණීන් අනපේක්ෂිත ලෙස විනාශයට පත් නොකළ යුතුයි' යන අදහසිනි.\n\nභික්ෂූනි, 'සිංහයා' යනු රහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේට කියන නමකි. භික්ෂූනි, තථාගතයන් වහන්සේ පිරිස් මැද ධර්මය දේශනා කරන්නේ යම් ආකාරයකින්ද, එය උන්වහන්සේගේ සිංහනාදය වන්නේය.\n\nභික්ෂූනි, තථාගතයන් වහන්සේගේ මේ දස තථාගත ඥාන බලයන් ඇත. මේ බලයන්ගෙන් යුක්ත වූ තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති. ඒ දසය කවරේද? භික්ෂූනි, මෙහිලා තථාගතයන් වහන්සේ හේතු යුක්ත දේ හේතු යුක්ත ලෙසත්, හේතු රහිත දේ හේතු රහිත ලෙසත් යථාභූත ලෙස ප්‍රඥාවෙන් දනිති. භික්ෂූනි, තථාගතයන් වහන්සේ යම් හෙයකින් හේතු යුක්ත දේ හේතු යුක්ත ලෙසත්, හේතු රහිත දේ හේතු රහිත ලෙසත් යථාභූත ලෙස ප්‍රඥාවෙන් දනිති, භික්ෂූනි, එයද තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති.\n\nතවද, භික්ෂූනි, තථාගතයන් වහන්සේ අතීත, අනාගත, වර්තමාන කර්මයන්ගේ විපාක හේතු සහිතව, යථාභූත ලෙස ප්‍රඥාවෙන් දනිති. භික්ෂූනි, තථාගතයන් වහන්සේ යම් හෙයකින් අතීත, අනාගත, වර්තමාන කර්මයන්ගේ විපාක හේතු සහිතව, යථාභූත ලෙස ප්‍රඥාවෙන් දනිති, භික්ෂූනි, එයද තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති.\n\nතවද, භික්ෂූනි, තථාගතයන් වහන්සේ සියලු ගතිවලට ගමන් කරන ප්‍රතිපදාව යථාභූත ලෙස ප්‍රඥාවෙන් දනිති. භික්ෂූනි, තථාගතයන් වහන්සේ යම් හෙයකින් සියලු ගතිවලට ගමන් කරන ප්‍රතිපදාව යථාභූත ලෙස ප්‍රඥාවෙන් දනිති, භික්ෂූනි, එයද තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති.\n\nතවද, භික්ෂූනි, තථාගතයන් වහන්සේ අ-නෙක ධාතූන්ගෙන් යුක්ත වූ, නානා ධාතූන්ගෙන් යුක්ත වූ ලෝකය යථාභූත ලෙස ප්‍රඥාවෙන් දනිති. භික්ෂූනි, තථාගතයන් වහන්සේ යම් හෙයකින් අ-නෙක ධාතූන්ගෙන් යුක්ත වූ, නානා ධාතූන්ගෙන් යුක්ත වූ ලෝකය යථාභූත ලෙස ප්‍රඥාවෙන් දනිති, භික්ෂූනි, එයද තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති.\n\nතවද, භික්ෂූනි, තථාගතයන් වහන්සේ සත්වයන්ගේ නානා අධිමුක්තිය යථාභූත ලෙස ප්‍රඥාවෙන් දනිති. භික්ෂූනි, තථාගතයන් වහන්සේ යම් හෙයකින් සත්වයන්ගේ නානා අධිමුක්තිය යථාභූත ලෙස ප්‍රඥාවෙන් දනිති, භික්ෂූනි, එයද තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති.\n\nතවද, භික්ෂූනි, තථාගතයන් වහන්සේ අන් සත්වයන්ගේ, අන් පුද්ගලයන්ගේ ඉන්ද්‍රියයන්ගේ (ශ්‍රද්ධාදී) අඩු වැඩි බව යථාභූත ලෙස ප්‍රඥාවෙන් දනිති. භික්ෂූනි, තථාගතයන් වහන්සේ යම් හෙයකින් අන් සත්වයන්ගේ, අන් පුද්ගලයන්ගේ ඉන්ද්‍රියයන්ගේ අඩු වැඩි බව යථාභූත ලෙස ප්‍රඥාවෙන් දනිති, භික්ෂූනි, එයද තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති.\n\nතවද, භික්ෂූනි, තථාගතයන් වහන්සේ ධ්‍යාන, විමෝක්ෂ, සමාධි, සමාපත්ති වල කෙලෙස් සහිත බවත්, කෙලෙස් රහිත බවත් (පිරිසිදු බවත්), නැගී සිටීමත් (උත්ථානය) යථාභූත ලෙස ප්‍රඥාවෙන් දනිති. භික්ෂූනි, තථාගතයන් වහන්සේ යම් හෙයකින් ධ්‍යාන, විමෝක්ෂ, සමාධි, සමාපත්ති වල කෙලෙස් සහිත බවත්, කෙලෙස් රහිත බවත්, නැගී සිටීමත් යථාභූත ලෙස ප්‍රඥාවෙන් දනිති, භික්ෂූනි, එයද තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති.\n\nතවද, භික්ෂූනි, තථාගතයන් වහන්සේ පෙර විසූ භවයන් නානා ආකාරයෙන් සිහි කරති. එනම්: එක් ජාතියක්, ජාති දෙකක්, ජාති තුනක්, ජාති හතරක්, ජාති පහක්, ජාති දසයක්, ජාති විස්සක්, ජාති තිහක්, ජාති හතළිහක්, ජාති පනහක්, ජාති සියයක්, ජාති දහසක්, ජාති ලක්ෂයක්, බොහෝ සංවට්ට කල්ප, බොහෝ විවට්ට කල්ප, බොහෝ සංවට්ට-විවට්ට කල්ප සිහි කරති. ‘මම අසවල් තැන, මේ නමින්, මේ ගෝත්‍රයෙන්, මේ වර්ණයෙන් යුක්තව, මේ ආහාර අනුභව කරමින්, මේ ආකාරයෙන් සැප දුක් විඳිමින්, මේ ආයුෂ ප්‍රමාණයෙන් ජීවත් වූවෙමි. එතනින් චුත වී අසවල් තැන උපන්නෙමි. එතනද මම මේ නමින්, මේ ගෝත්‍රයෙන්, මේ වර්ණයෙන් යුක්තව, මේ ආහාර අනුභව කරමින්, මේ ආකාරයෙන් සැප දුක් විඳිමින්, මේ ආයුෂ ප්‍රමාණයෙන් ජීවත් වූවෙමි. එතනින් චුත වී මෙහි උපන්නෙමි’ යනාදී වශයෙන් පෙර විසූ භවයන් ආකාර සහිතව, උපදෙස් සහිතව, නානා ආකාරයෙන් සිහි කරති. භික්ෂූනි, තථාගතයන් වහන්සේ යම් හෙයකින් පෙර විසූ භවයන් නානා ආකාරයෙන් සිහි කරති. එනම්: එක් ජාතියක්, ජාති දෙකක්, ජාති තුනක්, ජාති හතරක්, ජාති පහක්, ජාති දසයක්, ජාති විස්සක්, ජාති තිහක්, ජාති හතළිහක්, ජාති පනහක්, ජාති සියයක්, ජාති දහසක්, ජාති ලක්ෂයක්, බොහෝ සංවට්ට කල්ප, බොහෝ විවට්ට කල්ප, බොහෝ සංවට්ට-විවට්ට කල්ප සිහි කරති, ආකාර සහිතව, උපදෙස් සහිතව, නානා ආකාරයෙන් පෙර විසූ භවයන් සිහි කරති, භික්ෂූනි, එයද තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ ස්ථානය ප්‍රතිඥා දෙති, පිරිස් මැද සිංහනාද කරති, බ්‍රහ්ම චක්‍රය පවත්වති.\n\nනැවතද මහණෙනි, තථාගතයන්වහන්සේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් චුත වන, උපදින, හීන වූ, ප්‍ර‍ණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති දුර්ගතිවලට පැමිණි, කර්මයට අනුව පිහිටි සත්වයන් ප්‍ර‍ඥාවෙන් දකිත්. එනම්: ‘මේ භවත් සත්ත්වයෝ කායදුශ්චරිතයෙන් යුක්ත වූවාහුය, වාග්දුශ්චරිතයෙන් යුක්ත වූවාහුය, මනෝදුශ්චරිතයෙන් යුක්ත වූවාහුය, ආර්‍යයන්ට අපහාස කරන්නාහුය, මිථ්‍යාදෘෂ්ටිකයෝය, මිථ්‍යාදෘෂ්ටියට අනුව කර්ම සමාදන් වූවාහුය. ඔවුහු කය බිඳීමෙන්, මරණයෙන් පසුව අපාය නම් දුර්ගති විනිපාත නිරයට පැමිණියාහුය. නැතහොත් මේ භවත් සත්ත්වයෝ කායසුචරිතයෙන් යුක්ත වූවාහුය, වාග්සුචරිතයෙන් යුක්ත වූවාහුය, මනෝසුචරිතයෙන් යුක්ත වූවාහුය, ආර්‍යයන්ට අපහාස නොකරන්නාහුය, සම්මාදෘෂ්ටිකයෝය, සම්මාදෘෂ්ටියට අනුව කර්ම සමාදන් වූවාහුය. ඔවුහු කය බිඳීමෙන්, මරණයෙන් පසුව සුගති ස්වර්ග ලෝකයට පැමිණියාහුය.’ මෙලෙසින් පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් චුත වන, උපදින, හීන වූ, ප්‍ර‍ණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති දුර්ගතිවලට පැමිණි, කර්මයට අනුව පිහිටි සත්වයන් තථාගතයන්වහන්සේ ප්‍ර‍ඥාවෙන් දකිත්. මහණෙනි, යමක් හෙයින් තථාගතයන්වහන්සේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් චුත වන, උපදින, හීන වූ, ප්‍ර‍ණීත වූ, සුවර්ණ වූ, දුර්වර්ණ වූ, සුගති දුර්ගතිවලට පැමිණි, කර්මයට අනුව පිහිටි සත්වයන් ප්‍ර‍ඥාවෙන් දකිත් ද, මහණෙනි, මේද තථාගතයන්වහන්සේගේ තථාගත ඥාන බලයක් වන්නේය. යම් බලයක් අරබයා තථාගතයන්වහන්සේ ආසභස්ථානය ප්‍ර‍කාශ කරත් ද, පිරිස් මැද සිංහනාද පවත්වත් ද, බ්‍රහ්ම චක්‍ර‍ය (ධර්ම චක්‍ර‍ය) පවත්වත් ද.\n\nනැවතද මහණෙනි, තථාගතයන්වහන්සේ ආශ්‍රවයන්ගේ ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍ර‍ඥා විමුක්තිය මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍ර‍ත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරති. මහණෙනි, යමක් හෙයින් තථාගතයන්වහන්සේ ආශ්‍රවයන්ගේ ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍ර‍ඥා විමුක්තිය මේ ආත්මභාවයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට, ප්‍ර‍ත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කරත් ද, මහණෙනි, මේද තථාගතයන්වහන්සේගේ තථාගත ඥාන බලයක් වන්නේය. යම් බලයක් අරබයා තථාගතයන්වහන්සේ ආසභස්ථානය ප්‍ර‍කාශ කරත් ද, පිරිස් මැද සිංහනාද පවත්වත් ද, බ්‍රහ්ම චක්‍ර‍ය (ධර්ම චක්‍ර‍ය) පවත්වත් ද.\n\nමහණෙනි, මේවාය තථාගතයන්වහන්සේගේ දස තථාගත බලයන්. යම් බලයන්ගෙන් යුක්ත වූ තථාගතයන්වහන්සේ ආසභස්ථානය ප්‍ර‍කාශ කරත් ද, පිරිස් මැද සිංහනාද පවත්වත් ද, බ්‍රහ්ම චක්‍ර‍ය (ධර්ම චක්‍ර‍ය) පවත්වත් ද.",
      "paliTitle": "Sīhanādasuttaṃ",
      "englishTitle": "The Lion's Roar Discourse",
      "sinhalaTitle": "සිංහනාද සූත්‍රය"
    },
    {
      "number": 22,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘Ye te, ānanda, dhammā tesaṃ tesaṃ adhivuttipadānaṃ [adhimuttipadānaṃ (ka.)] abhiññā sacchikiriyāya saṃvattanti, visārado ahaṃ, ānanda, tattha paṭijānāmi. ‘Tesaṃ tesaṃ tathā tathā dhammaṃ desetuṃ yathā yathā paṭipanno santaṃ vā atthīti ñassati, asantaṃ vā natthīti ñassati, hīnaṃ vā hīnanti ñassati, paṇītaṃ vā paṇītanti ñassati, sauttaraṃ vā sauttaranti ñassati, anuttaraṃ vā anuttaranti ñassati; yathā yathā vā pana taṃ ñāteyyaṃ vā daṭṭheyyaṃ vā sacchikareyyaṃ vā, tathā tathā ñassati vā dakkhati vā sacchikarissati vā’ti ṭhānametaṃ vijjati. Etadānuttariyaṃ, ānanda, ñāṇānaṃ yadidaṃ tattha tattha yathābhūtañāṇaṃ. Etasmā cāhaṃ, ānanda, ñāṇā aññaṃ ñāṇaṃ uttaritaraṃ vā paṇītataraṃ vā natthīti vadāmi. ‘‘Dasayimāni, ānanda, tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. Katamāni dasa? Idhānanda, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti. Yampānanda, tathāgato ṭhānañca ṭhānato aṭṭhānañca aṭṭhānato yathābhūtaṃ pajānāti, idampānanda, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Puna caparaṃ, ānanda, tathāgato atītānāgatapaccuppannānaṃ kammasamādānānaṃ ṭhānaso hetuso vipākaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…. ‘‘Puna caparaṃ, ānanda, tathāgato sabbatthagāminiṃ paṭipadaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…. ‘‘Puna caparaṃ, ānanda, tathāgato anekadhātuṃ nānādhātuṃ lokaṃ yathābhūtaṃ pajānāti. Yampānanda …pe… idampānanda…pe…. ‘‘Puna caparaṃ, ānanda, tathāgato sattānaṃ nānādhimuttikataṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…. ‘‘Puna caparaṃ, ānanda, tathāgato parasattānaṃ parapuggalānaṃ indriyaparopariyattaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…. ‘‘Puna caparaṃ, ānanda, tathāgato jhānavimokkhasamādhisamāpattīnaṃ saṃkilesaṃ vodānaṃ vuṭṭhānaṃ yathābhūtaṃ pajānāti. Yampānanda…pe… idampānanda…pe…. ‘‘Puna caparaṃ, ānanda, tathāgato anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampānanda… pe… idampānanda…pe…. ‘‘Puna caparaṃ, ānanda, tathāgato dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti. Yampānanda…pe… idampānanda…pe…. ‘‘Puna caparaṃ, ānanda, tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Yampānanda, tathāgato āsavānaṃ khayā anāsavaṃ cetovimuttiṃ…pe… sacchikatvā upasampajja viharati. Idampānanda, tathāgatassa tathāgatabalaṃ hoti, yaṃ balaṃ āgamma tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavatteti. ‘‘Imāni kho, ānanda, dasa tathāgatassa tathāgatabalāni, yehi balehi samannāgato tathāgato āsabhaṃ ṭhānaṃ paṭijānāti, parisāsu sīhanādaṃ nadati, brahmacakkaṃ pavattetī’’ti. Dutiyaṃ.",
      "english": "Then the Venerable Ananda approached the Blessed One; having approached and saluted the Blessed One, he sat down to one side. As the Venerable Ananda sat to one side, the Blessed One said this to him:\n\n\"Ananda, regarding those Dhammas that lead to direct knowledge and realization of various modes of understanding, I declare myself skilled therein. This possibility exists: to teach the Dhamma to each person in such a way that, practicing accordingly, one will understand what truly exists as existing, what does not exist as not existing, what is inferior as inferior, what is superior as superior, what is surpassable as surpassable, what is unsurpassable as unsurpassable; and to whatever extent something is to be known, seen, or realized, they will know it, see it, or realize it accordingly. This, Ananda, is the unsurpassed among knowledges, namely, knowledge of things as they actually are in each particular case. And, Ananda, I say that there is no other knowledge higher or more excellent than this knowledge.\n\n\"These ten, Ananda, are the powers of a Tathāgata, endowed with which a Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion. Which ten?\n\n\"Here, Ananda, a Tathāgata understands as it actually is what is possible as possible, and what is impossible as impossible. And, Ananda, that the Tathāgata understands as it actually is what is possible as possible and what is impossible as impossible, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata understands as it actually is the results of past, future, and present actions, with their reasons and conditions. And, Ananda, that the Tathāgata understands as it actually is the results of past, future, and present actions, with their reasons and conditions, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata understands as it actually is the path leading to all destinations. And, Ananda, that the Tathāgata understands as it actually is the path leading to all destinations, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata understands as it actually is the world with its many and diverse elements. And, Ananda, that the Tathāgata understands as it actually is the world with its many and diverse elements, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata understands as it actually is the diverse inclinations of beings. And, Ananda, that the Tathāgata understands as it actually is the diverse inclinations of beings, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata understands as it actually is the superior and inferior faculties of other beings and persons. And, Ananda, that the Tathāgata understands as it actually is the superior and inferior faculties of other beings and persons, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata understands as it actually is the defilement, purification, and emergence from the jhānas, liberations, concentrations, and attainments. And, Ananda, that the Tathāgata understands as it actually is the defilement, purification, and emergence from the jhānas, liberations, concentrations, and attainments, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata recollects his manifold past abodes, that is, one birth, two births... and so forth, thus recollecting his manifold past abodes with their aspects and details. And, Ananda, that the Tathāgata recollects his manifold past abodes, that is, one birth, two births... and so forth, thus recollecting his manifold past abodes with their aspects and details, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata, with the divine eye, purified and surpassing that of humans, understands beings as they pass away and reappear according to their actions. And, Ananda, that the Tathāgata, with the divine eye, purified and surpassing that of humans, understands beings as they pass away and reappear according to their actions, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"Furthermore, Ananda, a Tathāgata, by the destruction of the influxes, in this very life, directly knows, realizes, and dwells in the Stainless Liberation of Mind and Liberation by Wisdom. And, Ananda, that the Tathāgata, by the destruction of the influxes, in this very life, directly knows, realizes, and dwells in the Stainless Liberation of Mind and Liberation by Wisdom, this, Ananda, is a power of the Tathāgata, by virtue of which power the Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\n\n\"These, Ananda, are the ten powers of a Tathāgata, endowed with which a Tathāgata claims the foremost rank, roars his lion's roar in assemblies, and sets the Brahma-wheel in motion.\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේට වැඳ එකත්පසෙක වැඩසිටියහ. එකත්පසෙක වැඩසිටි ආයුෂ්මත් ආනන්ද තෙරණුවන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\n\"ආනන්දය, යම් ඒ ධර්ම කාරණා ඒ ඒ අධිමුක්ති පදවලට අදාළව විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කිරීමට හේතු වේ ද, ආනන්දය, එහි දී මම නිසැකවම දක්ෂ යැයි (විශාරද යැයි) ප්‍රකාශ කරමි. ඒ ඒ අයට ඒ ඒ ආකාරයෙන් ධර්මය දේශනා කිරීමට, යම් යම් අයුරින් පිළිපදින තැනැත්තා පවතින දේ ‘පවතී’ යැයි ද, නොපවතින දේ ‘නොපවතී’ යැයි ද, හීන වූ දේ ‘හීන ය’ යැයි ද, ප්‍රණීත වූ දේ ‘ප්‍රණීත ය’ යැයි ද, උත්තරීතර වූ දේ ‘උත්තරීතර ය’ යැයි ද, අනුත්තර වූ දේ ‘අනුත්තර ය’ යැයි ද, දනී; නැතහොත්, යම් යම් ආකාරයෙන් එය දැනගත යුතු ද, දැකිය යුතු ද, ප්‍රත්‍යක්ෂ කළ යුතු ද, ඒ ඒ ආකාරයෙන් දනී ද, දකී ද, ප්‍රත්‍යක්ෂ කරන්නේ ද යන්න සිදු විය හැකි කරුණකි. ආනන්දය, මේ ඥානයන් අතුරින් අනුත්තර ඥානය නම් ඒ ඒ තැන්හි ඇති යථාභූත ඥානය යි. ආනන්දය, මේ ඥානයට වඩා වෙනත් උත්තරීතර හෝ ප්‍රණීත ඥානයක් නැතැයි මම පවසමි.\n\n\"ආනන්දය, තථාගතයන් වහන්සේට මේ තථාගත බල දහය ඇත. යම් බලයන්ගෙන් යුක්ත වූ තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද. කවරේ ද ඒ දහය? ආනන්දය, මෙහිලා තථාගතයන් වහන්සේ සිදුවිය හැකි දේ සිදුවිය හැකි ලෙසින් ද, සිදුවිය නොහැකි දේ සිදුවිය නොහැකි ලෙසින් ද, යථාභූත ලෙස (ඇති සැටියෙන්) දනී. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ සිදුවිය හැකි දේ සිදුවිය හැකි ලෙසින් ද, සිදුවිය නොහැකි දේ සිදුවිය නොහැකි ලෙසින් ද, යථාභූත ලෙස දනී ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ අතීත, අනාගත, වර්තමාන කර්ම සමාදානයන්ගේ (කර්ම රැස් කිරීම් වල) හේතුඵල විපාක යථාභූත ලෙස දනී. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ අතීත, අනාගත, වර්තමාන කර්ම සමාදානයන්ගේ හේතුඵල විපාක යථාභූත ලෙස දනී ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ සියලු තැන් කරා යන ප්‍රතිපදාව යථාභූත ලෙස දනී. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ සියලු තැන් කරා යන ප්‍රතිපදාව යථාභූත ලෙස දනී ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ අනේක ධාතුක වූ, නානා ධාතුක වූ ලෝකය යථාභූත ලෙස දනී. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ අනේක ධාතුක වූ, නානා ධාතුක වූ ලෝකය යථාභූත ලෙස දනී ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ සත්වයන්ගේ නානා අධිමුක්තිය (විවිධ අදහස්, විශ්වාස, ප්‍රවණතා) යථාභූත ලෙස දනී. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ සත්වයන්ගේ නානා අධිමුක්තිය යථාභූත ලෙස දනී ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ අන්‍ය සත්වයන්ගේ ද, අන්‍ය පුද්ගලයන්ගේ ද, ඉන්ද්‍රිය පරෝපරියත්තතාවය (ඉන්ද්‍රියන්ගේ පරිණත බව, ග්‍රාහකත්වය, හොඳ නරක, ඉහළ පහළ බව) යථාභූත ලෙස දනී. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ අන්‍ය සත්වයන්ගේ ද, අන්‍ය පුද්ගලයන්ගේ ද, ඉන්ද්‍රිය පරෝපරියත්තතාවය යථාභූත ලෙස දනී ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ ධ්‍යාන, විමෝක්ෂ, සමාධි, සමාපත්තිවල කෙලෙසීම, පිරිසිදු වීම, නැගී සිටීම (අර්පණය) යථාභූත ලෙස දනී. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ ධ්‍යාන, විමෝක්ෂ, සමාධි, සමාපත්තිවල කෙලෙසීම, පිරිසිදු වීම, නැගී සිටීම යථාභූත ලෙස දනී ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරයි. එනම් – එක් ආත්ම භවයක් ද, දෙක් ආත්ම භවයන් ද... ආදී වශයෙන්, ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරයි. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ නොයෙක් ආකාර වූ පෙර විසූ කඳන් පෙළ සිහි කරයි ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින් ... කර්මානුරූපව ගමන් කරන සත්වයන් දනී. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිව්‍ය චක්ෂුසින් කර්මානුරූපව ගමන් කරන සත්වයන් දනී ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"තවද, ආනන්දය, තථාගතයන් වහන්සේ ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය ද, ප්‍රඥා විමුක්තිය ද, මේ ආත්ම භාවයේ දී ම තමන් විසින් විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය කරයි. ආනන්දය, යම් හෙයකින් තථාගතයන් වහන්සේ ආශ්‍රවයන්ගේ ක්ෂය වීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය ද, ප්‍රඥා විමුක්තිය ද, මේ ආත්ම භාවයේ දී ම තමන් විසින් විශිෂ්ට ඥානයෙන් ප්‍රත්‍යක්ෂ කොට, අවබෝධ කොට වාසය කරයි ද, ආනන්දය, මෙය තථාගතයන් වහන්සේගේ තථාගත බලයකි. යම් බලයක් නිසා තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\n\n\"ආනන්දය, මේ තථාගතයන් වහන්සේගේ තථාගත බල දහය යි. යම් බලයන්ගෙන් යුක්ත වූ තථාගතයන් වහන්සේ අසභ නම් වූ තැනට පැමිණි බව ප්‍රකාශ කරන්නේ ද, පිරිස් මැද සිංහනාද කරන්නේ ද, බ්‍රහ්ම චක්‍රය පවත්වන්නේ ද.\"",
      "paliTitle": "Adhivuttipadasuttaṃ",
      "englishTitle": "Discourse on Designation",
      "sinhalaTitle": "අධිවෘත්තිපද සූත්‍රය"
    },
    {
      "number": 23,
      "pali": "‘‘Atthi, bhikkhave, dhammā kāyena pahātabbā, no vācāya. Atthi, bhikkhave, dhammā vācāya pahātabbā, no kāyena. Atthi, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā [disvā disvā (sī. syā.)] pahātabbā. ‘‘Katame ca, bhikkhave, dhammā kāyena pahātabbā, no vācāya? Idha, bhikkhave, bhikkhu akusalaṃ āpanno hoti kiñci desaṃ [kañci deva desaṃ (sī. syā.)] kāyena. Tamenaṃ anuvicca viññū sabrahmacārī evamāhaṃsu – ‘āyasmā kho akusalaṃ āpanno kiñci desaṃ kāyena. Sādhu vatāyasmā kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāvetū’ti. So anuvicca viññūhi sabrahmacārīhi vuccamāno kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti. Ime vuccanti, bhikkhave, dhammā kāyena pahātabbā, no vācāya. ‘‘Katame ca, bhikkhave, dhammā vācāya pahātabbā, no kāyena? Idha, bhikkhave, bhikkhu akusalaṃ āpanno hoti kiñci desaṃ vācāya. Tamenaṃ anuvicca viññū sabrahmacārī evamāhaṃsu – ‘āyasmā kho akusalaṃ āpanno kiñci desaṃ vācāya. Sādhu vatāyasmā vacīduccaritaṃ pahāya vacīsucaritaṃ bhāvetū’ti. So anuvicca viññūhi sabrahmacārīhi vuccamāno vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti. Ime vuccanti, bhikkhave, dhammā vācāya pahātabbā, no kāyena. ‘‘Katame ca, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā? Lobho, bhikkhave, neva kāyena pahātabbo no vācāya, paññāya disvā pahātabbo. Doso, bhikkhave… pe… moho… kodho… upanāho… makkho… paḷāso … macchariyaṃ, bhikkhave, neva kāyena pahātabbaṃ no vācāya, paññāya disvā pahātabbaṃ. ‘‘Pāpikā, bhikkhave, issā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā. Katamā ca, bhikkhave, pāpikā issā? Idha, bhikkhave, ijjhati gahapatissa vā gahapatiputtassa vā dhanena vā dhaññena vā rajatena vā jātarūpena vā. Tatrāññatarassa dāsassa vā upavāsassa vā evaṃ hoti – ‘aho vatimassa gahapatissa vā gahapatiputtassa vā na ijjheyya dhanena vā dhaññena vā rajatena vā jātarūpena vā’ti. Samaṇo vā pana brāhmaṇo vā lābhī hoti cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānaṃ. Tatrāññatarassa samaṇassa vā brāhmaṇassa vā evaṃ hoti – ‘aho vata ayamāyasmā na lābhī assa cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārāna’nti. Ayaṃ vuccati, bhikkhave, pāpikā issā. ‘‘Pāpikā, bhikkhave, icchā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā. Katamā ca, bhikkhave, pāpikā icchā? [vibha. 851] Idha, bhikkhave, ekacco assaddho samāno ‘saddhoti maṃ jāneyyu’nti icchati; dussīlo samāno ‘sīlavāti maṃ jāneyyu’nti icchati; appassuto samāno ‘bahussutoti maṃ jāneyyu’nti icchati; saṅgaṇikārāmo samāno ‘pavivittoti maṃ jāneyyu’nti icchati; kusīto samāno ‘āraddhavīriyoti maṃ jāneyyu’nti icchati; muṭṭhassati samāno ‘upaṭṭhitassatīti maṃ jāneyyu’nti icchati; asamāhito samāno ‘samāhitoti maṃ jāneyyu’nti icchati; duppañño samāno ‘paññavāti maṃ jāneyyu’nti icchati; akhīṇāsavo samāno ‘khīṇāsavoti maṃ jāneyyu’nti icchati. Ayaṃ vuccati, bhikkhave, pāpikā icchā. Ime vuccanti, bhikkhave, dhammā neva kāyena pahātabbā no vācāya, paññāya disvā pahātabbā. ‘‘Tañce, bhikkhave, bhikkhuṃ lobho abhibhuyya iriyati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya iriyati. So evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya iriyati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya iriyatī’ti. ‘‘Tañce, bhikkhave, bhikkhuṃ lobho nābhibhuyya iriyati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya iriyati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya iriyati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho … upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya iriyatī’’’ti. Tatiyaṃ.",
      "english": "There are, monks, qualities that are to be abandoned by bodily action, not by speech. There are, monks, qualities that are to be abandoned by speech, not by bodily action. There are, monks, qualities that are to be abandoned neither by bodily action nor by speech, but by seeing with wisdom.\n\nAnd which, monks, are the qualities to be abandoned by bodily action, not by speech? Here, monks, a monk has fallen into some unwholesome bodily action. His discerning spiritual companions, having investigated him, say to him: ‘Venerable sir, you have indeed fallen into some unwholesome bodily action. It would be good, venerable sir, if you were to abandon bodily misconduct and develop good bodily conduct.’ Being told this by his discerning spiritual companions who have investigated him, he abandons bodily misconduct and develops good bodily conduct. These, monks, are called the qualities to be abandoned by bodily action, not by speech.\n\nAnd which, monks, are the qualities to be abandoned by speech, not by bodily action? Here, monks, a monk has fallen into some unwholesome verbal action. His discerning spiritual companions, having investigated him, say to him: ‘Venerable sir, you have indeed fallen into some unwholesome verbal action. It would be good, venerable sir, if you were to abandon verbal misconduct and develop good verbal conduct.’ Being told this by his discerning spiritual companions who have investigated him, he abandons verbal misconduct and develops good verbal conduct. These, monks, are called the qualities to be abandoned by speech, not by bodily action.\n\nAnd which, monks, are the qualities to be abandoned neither by bodily action nor by speech, but by seeing with wisdom? Greed, monks, is to be abandoned neither by bodily action nor by speech, but by seeing with wisdom. Hatred, monks, is to be abandoned neither by bodily action nor by speech, but by seeing with wisdom. Delusion, monks, is to be abandoned neither by bodily action nor by speech, but by seeing with wisdom. Anger, resentment, denigration, rivalry, and stinginess, monks, are to be abandoned neither by bodily action nor by speech, but by seeing with wisdom.\n\nEvil envy, monks, is to be abandoned neither by bodily action nor by speech, but by seeing with wisdom. And what, monks, is evil envy? Here, monks, a householder or a householder's son prospers with wealth or grain or silver or gold. Then, to some slave or hired worker, it occurs thus: ‘Oh, if only this householder or householder's son would not prosper with wealth or grain or silver or gold!’ Or a recluse or brahmin is one who receives robes, almsfood, lodgings, and requisites for the sick and medicines. Then, to some other recluse or brahmin, it occurs thus: ‘Oh, if only this venerable one would not receive robes, almsfood, lodgings, and requisites for the sick and medicines!’ This, monks, is called evil envy.\n\nEvil ambition, monks, is to be abandoned neither by bodily action nor by speech, but by seeing with wisdom. And what, monks, is evil ambition? Here, monks, some individual, being faithless, wishes: ‘May they know me as faithful!’ Being immoral, he wishes: ‘May they know me as moral!’ Being of little learning, he wishes: ‘May they know me as learned!’ Being fond of company, he wishes: ‘May they know me as secluded!’ Being lazy, he wishes: ‘May they know me as energetic!’ Being unmindful, he wishes: ‘May they know me as mindful!’ Being unconcentrated, he wishes: ‘May they know me as concentrated!’ Being unwise, he wishes: ‘May they know me as wise!’ Being one whose defilements are not yet destroyed, he wishes: ‘May they know me as one whose defilements are destroyed!’ This, monks, is called evil ambition. These, monks, are called the qualities to be abandoned neither by bodily action nor by speech, but by seeing with wisdom.\n\nIf, monks, greed overcomes and pervades a monk, or hatred, or delusion, or anger, or resentment, or denigration, or rivalry, or stinginess, or evil envy, or evil ambition overcomes and pervades him, he should be understood thus: ‘This venerable one does not understand in such a way that, for one who understands, greed does not arise; therefore, greed overcomes and pervades this venerable one. This venerable one does not understand in such a way that, for one who understands, hatred does not arise... delusion... anger... resentment... denigration... rivalry... stinginess... evil envy... evil ambition does not arise; therefore, evil ambition overcomes and pervades this venerable one.’\n\nBut if, monks, greed does not overcome and pervade a monk, or hatred, or delusion, or anger, or resentment, or denigration, or rivalry, or stinginess, or evil envy, or evil ambition does not overcome and pervade him, he should be understood thus: ‘This venerable one understands in such a way that, for one who understands, greed does not arise; therefore, greed does not overcome and pervade this venerable one. This venerable one understands in such a way that, for one who understands, hatred does not arise... delusion... anger... resentment... denigration... rivalry... stinginess... evil envy... evil ambition does not arise; therefore, evil ambition does not overcome and pervade this venerable one.’",
      "sinhala": "මහණෙනි, කයින් ප්‍රහාණය කළ යුතු, වචනයෙන් ප්‍රහාණය කළ යුතු නොවන ධර්ම ඇත. මහණෙනි, වචනයෙන් ප්‍රහාණය කළ යුතු, කයින් ප්‍රහාණය කළ යුතු නොවන ධර්ම ඇත. මහණෙනි, කයින් හෝ වචනයෙන් හෝ ප්‍රහාණය කළ යුතු නොවන, ප්‍රඥාවෙන් දැක ප්‍රහාණය කළ යුතු ධර්ම ඇත.\n\nමහණෙනි, කයින් ප්‍රහාණය කළ යුතු, වචනයෙන් ප්‍රහාණය කළ යුතු නොවන ධර්ම කවරේද? මහණෙනි, මෙහිලා භික්ෂුවක් කිසියම් අකුසලයකට කයින් යුක්ත වේ. එවිට, විචක්‍ෂණ ඥානවන්ත බ්‍රහ්මචාරීන් විසින් විමසා බලා ඔහුට මෙසේ කියති: 'ඇවැත්නි, ඔබ කයින් යම් අකුසලයකට යුක්ත වී ඇත. එබැවින් ඇවැත්නි, කය දුසිරිත් අත්හැර කය සුසිරිත් වඩන්න.' ඔහු, විචක්‍ෂණ ඥානවන්ත බ්‍රහ්මචාරීන් විසින් එසේ කියනු ලබන විට, කය දුසිරිත් අත්හැර කය සුසිරිත් වඩයි. මහණෙනි, මේවා කයින් ප්‍රහාණය කළ යුතු, වචනයෙන් ප්‍රහාණය කළ යුතු නොවන ධර්ම යැයි කියනු ලැබේ.\n\nමහණෙනි, වචනයෙන් ප්‍රහාණය කළ යුතු, කයින් ප්‍රහාණය කළ යුතු නොවන ධර්ම කවරේද? මහණෙනි, මෙහිලා භික්ෂුවක් කිසියම් අකුසලයකට වචනයෙන් යුක්ත වේ. එවිට, විචක්‍ෂණ ඥානවන්ත බ්‍රහ්මචාරීන් විසින් විමසා බලා ඔහුට මෙසේ කියති: 'ඇවැත්නි, ඔබ වචනයෙන් යම් අකුසලයකට යුක්ත වී ඇත. එබැවින් ඇවැත්නි, වචන දුසිරිත් අත්හැර වචන සුසිරිත් වඩන්න.' ඔහු, විචක්‍ෂණ ඥානවන්ත බ්‍රහ්මචාරීන් විසින් එසේ කියනු ලබන විට, වචන දුසිරිත් අත්හැර වචන සුසිරිත් වඩයි. මහණෙනි, මේවා වචනයෙන් ප්‍රහාණය කළ යුතු, කයින් ප්‍රහාණය කළ යුතු නොවන ධර්ම යැයි කියනු ලැබේ.\n\nමහණෙනි, කයින් හෝ වචනයෙන් හෝ ප්‍රහාණය කළ යුතු නොවන, ප්‍රඥාවෙන් දැක ප්‍රහාණය කළ යුතු ධර්ම කවරේද? මහණෙනි, ලෝභය කයින් හෝ වචනයෙන් හෝ ප්‍රහාණය කළ යුතු නොවේ, ප්‍රඥාවෙන් දැක ප්‍රහාණය කළ යුතුය. මහණෙනි, ද්වේෂය... මෝහය... ක්‍රෝධය... උපනාහය (වෛර බැඳීම)... මක්ඛය (ගුණ මකන ස්වභාවය)... පලාසය (ගැරහීම)... මාත්සර්‍යය (මසුරුකම)... මේවා කයින් හෝ වචනයෙන් හෝ ප්‍රහාණය කළ යුතු නොවේ, ප්‍රඥාවෙන් දැක ප්‍රහාණය කළ යුතුය.\n\nමහණෙනි, පාපී ඊර්ෂ්‍යාව කයින් හෝ වචනයෙන් හෝ ප්‍රහාණය කළ යුතු නොවේ, ප්‍රඥාවෙන් දැක ප්‍රහාණය කළ යුතුය. මහණෙනි, පාපී ඊර්ෂ්‍යාව කවරේද? මහණෙනි, මෙහිලා ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ ධනයෙන් හෝ ධාන්‍යයෙන් හෝ රිදීයෙන් හෝ රනින් හෝ දියුණුවක් ඇතිවේ. එවිට, අන්‍ය වූ දාසයෙකුට හෝ කුලියට වැඩ කරන්නෙකුට හෝ මෙසේ සිතේ: 'අහෝ, මේ ගෘහපතියාට හෝ ගෘහපති පුත්‍රයාට හෝ ධනයෙන් හෝ ධාන්‍යයෙන් හෝ රිදීයෙන් හෝ රනින් හෝ දියුණුවක් ඇති නොවේවා!' කියා. නැතහොත්, ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර ලැබෙන්නේය. එවිට, අන්‍ය වූ ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට හෝ මෙසේ සිතේ: 'අහෝ, මේ ආයුෂ්මතාට සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස, බෙහෙත් පිරිකර නොලැබේවා!' කියා. මහණෙනි, මෙය පාපී ඊර්ෂ්‍යාව යැයි කියනු ලැබේ.\n\nමහණෙනි, පාපී අභිලාෂය කයින් හෝ වචනයෙන් හෝ ප්‍රහාණය කළ යුතු නොවේ, ප්‍රඥාවෙන් දැක ප්‍රහාණය කළ යුතුය. මහණෙනි, පාපී අභිලාෂය කවරේද? මහණෙනි, මෙහිලා යම් පුද්ගලයෙක් ශ්‍රද්ධාවක් නැත්තෙක් වෙමින් 'මා ශ්‍රද්ධාවන්තයෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ; දුශ්ශීල වූයේ 'මා ශීලවන්තයෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ; අල්පශ්‍රැත වූයේ 'මා බහුශ්‍රැතයෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ; සමූහයන් හා මිශ්‍ර වීමට කැමති වූයේ 'මා කාමභෝගී නොවන තැනැත්තෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ; කුසීත වූයේ (කම්මැළි වූයේ) 'මා වීර්යවන්තයෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ; සිහි මුළා වූයේ 'මා උපස්ථිත සිහි ඇති තැනැත්තෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ; අසමාහිත වූයේ 'මා සමාධිමත් තැනැත්තෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ; දුෂ්ප්‍රාඥ වූයේ 'මා ප්‍රඥාවන්තයෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ; ආශ්‍රව ක්ෂය නොකළේ 'මා ක්ෂීණාශ්‍රවයෙක් යැයි දන්නවා නම් හොඳයි' යැයි කැමති වේ. මහණෙනි, මෙය පාපී අභිලාෂය යැයි කියනු ලැබේ. මහණෙනි, මේවා කයින් හෝ වචනයෙන් හෝ ප්‍රහාණය කළ යුතු නොවන, ප්‍රඥාවෙන් දැක ප්‍රහාණය කළ යුතු ධර්ම යැයි කියනු ලැබේ.\n\nමහණෙනි, යම් හෙයකින් භික්ෂුවක් ලෝභයෙන් යටපත් වී, ද්වේෂයෙන්... මෝහයෙන්... ක්‍රෝධයෙන්... උපනාහයෙන්... මක්ඛයෙන්... පලාසයෙන්... මාත්සර්‍යයෙන්... පාපී ඊර්ෂ්‍යාවෙන්... පාපී අභිලාෂයෙන් යටපත් වී හැසිරේ නම්, ඔහු මෙසේ තේරුම් ගත යුතුය: 'මේ ආයුෂ්මතා යම් ආකාරයකින් දැන සිටියහොත් ලෝභය ඇති නොවේද, ඒ ආකාරයෙන් නොදැන සිටී, එහෙයින් මේ ආයුෂ්මතා ලෝභයෙන් යටපත් වී හැසිරේ; යම් ආකාරයකින් දැන සිටියහොත් ද්වේෂය ඇති නොවේද... මෝහය... ක්‍රෝධය... උපනාහය... මක්ඛය... පලාසය... මාත්සර්‍යය... පාපී ඊර්ෂ්‍යාව... පාපී අභිලාෂය ඇති නොවේද, ඒ ආකාරයෙන් නොදැන සිටී, එහෙයින් මේ ආයුෂ්මතා පාපී අභිලාෂයෙන් යටපත් වී හැසිරේ' කියා.\n\nමහණෙනි, යම් හෙයකින් භික්ෂුවක් ලෝභයෙන් යටපත් නොවී, ද්වේෂයෙන්... මෝහයෙන්... ක්‍රෝධයෙන්... උපනාහයෙන්... මක්ඛයෙන්... පලාසයෙන්... මාත්සර්‍යයෙන්... පාපී ඊර්ෂ්‍යාවෙන්... පාපී අභිලාෂයෙන් යටපත් නොවී හැසිරේ නම්, ඔහු මෙසේ තේරුම් ගත යුතුය: 'මේ ආයුෂ්මතා යම් ආකාරයකින් දැන සිටියහොත් ලෝභය ඇති නොවේද, ඒ ආකාරයෙන් දැන සිටී, එහෙයින් මේ ආයුෂ්මතා ලෝභයෙන් යටපත් නොවී හැසිරේ; යම් ආකාරයකින් දැන සිටියහොත් ද්වේෂය ඇති නොවේද... මෝහය... ක්‍රෝධය... උපනාහය... මක්ඛය... පලාසය... මාත්සර්‍යය... පාපී ඊර්ෂ්‍යාව... පාපී අභිලාෂය ඇති නොවේද, ඒ ආකාරයෙන් දැන සිටී, එහෙයින් මේ ආයුෂ්මතා පාපී අභිලාෂයෙන් යටපත් නොවී හැසිරේ' කියා.",
      "paliTitle": "Kāyasuttaṃ",
      "englishTitle": "The Body Discourse",
      "sinhalaTitle": "කය සූත්‍රය"
    },
    {
      "number": 24,
      "pali": "Ekaṃ samayaṃ āyasmā mahācundo cetīsu viharati sahajātiyaṃ. Tatra kho āyasmā mahācundo bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato mahācundassa paccassosuṃ. Āyasmā mahācundo etadavoca – ‘‘Ñāṇavādaṃ, āvuso, bhikkhu vadamāno – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhamma’nti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho … kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti. ‘‘Bhāvanāvādaṃ, āvuso, bhikkhu vadamāno – ‘bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso … macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti. ‘‘Ñāṇavādañca, āvuso, bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti. ‘‘Seyyathāpi, āvuso, puriso daliddova samāno aḍḍhavādaṃ vadeyya, adhanova samāno dhanavāvādaṃ vadeyya, abhogova samāno bhogavāvādaṃ vadeyya. So kismiñcideva dhanakaraṇīye samuppanne na sakkuṇeyya upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā. Tamenaṃ evaṃ jāneyyuṃ – ‘daliddova ayamāyasmā samāno aḍḍhavādaṃ vadeti, adhanova ayamāyasmā samāno dhanavāvādaṃ vadeti, abhogavāva ayamāyasmā samāno bhogavāvādaṃ vadeti. Taṃ kissa hetu? Tathā hi ayamāyasmā kismiñcideva dhanakaraṇīye samuppanne na sakkoti upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā’ti. ‘‘Evamevaṃ kho, āvuso, ñāṇavādañca bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Taṃ ce, āvuso, bhikkhuṃ lobho abhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā abhibhuyya tiṭṭhati, so evamassa veditabbo – ‘nāyamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho abhibhuyya tiṭṭhati; nāyamāyasmā tathā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā … pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā abhibhuyya tiṭṭhatī’ti. ‘‘Ñāṇavādaṃ, āvuso, bhikkhu vadamāno – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhamma’nti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘ayamāyasmā tathā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’ti. ‘‘Bhāvanāvādaṃ, āvuso, bhikkhu vadamāno – ‘bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’ti. ‘‘Ñāṇavādañca, āvuso, bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’ti. ‘‘Seyyathāpi, āvuso, puriso aḍḍhova samāno aḍḍhavādaṃ vadeyya, dhanavāva samāno dhanavāvādaṃ vadeyya, bhogavāva samāno bhogavāvādaṃ vadeyya. So kismiñcideva dhanakaraṇīye samuppanne sakkuṇeyya upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā. Tamenaṃ evaṃ jāneyyuṃ – ‘aḍḍhova ayamāyasmā samāno aḍḍhavādaṃ vadeti, dhanavāva ayamāyasmā samāno dhanavāvādaṃ vadeti, bhogavāva ayamāyasmā samāno bhogavāvādaṃ vadeti. Taṃ kissa hetu? Tathā hi ayamāyasmā kismiñcideva dhanakaraṇīye samuppanne sakkoti upanīhātuṃ dhanaṃ vā dhaññaṃ vā rajataṃ vā jātarūpaṃ vā’ti. Evamevaṃ kho, āvuso, ñāṇavādañca bhikkhu vadamāno bhāvanāvādañca – ‘jānāmimaṃ dhammaṃ, passāmimaṃ dhammaṃ, bhāvitakāyomhi bhāvitasīlo bhāvitacitto bhāvitapañño’ti. Tañce, āvuso, bhikkhuṃ lobho nābhibhuyya tiṭṭhati, doso… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā nābhibhuyya tiṭṭhati, so evamassa veditabbo – ‘tathā ayamāyasmā pajānāti yathā pajānato lobho na hoti, tathāhimaṃ āyasmantaṃ lobho nābhibhuyya tiṭṭhati; tathā ayamāyasmā pajānāti yathā pajānato doso na hoti… moho… kodho… upanāho… makkho… paḷāso… macchariyaṃ… pāpikā issā… pāpikā icchā na hoti, tathāhimaṃ āyasmantaṃ pāpikā icchā nābhibhuyya tiṭṭhatī’’’ti. Catutthaṃ.",
      "english": "At one time, the Venerable Mahācunda was dwelling among the Cetī in Sahajāti. There, the Venerable Mahācunda addressed the bhikkhus, saying, “Friends, bhikkhus!” Those bhikkhus replied to the Venerable Mahācunda, “Friend!” The Venerable Mahācunda then spoke thus: “Friends, when a bhikkhu speaks claiming knowledge, saying, ‘I know this Dhamma, I see this Dhamma,’ if, friends, covetousness overcomes and remains in that bhikkhu, or aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires overcome and remain in him, then he should be understood thus: ‘This venerable one does not truly know in the way that one who truly knows does not have covetousness, for covetousness overcomes and remains in this venerable one; this venerable one does not truly know in the way that one who truly knows does not have aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires, for evil desires overcome and remain in this venerable one.’\n\n“Friends, when a bhikkhu speaks claiming development, saying, ‘My body is developed, my virtue is developed, my mind is developed, my wisdom is developed,’ if, friends, covetousness overcomes and remains in that bhikkhu, or aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires overcome and remain in him, then he should be understood thus: ‘This venerable one does not truly know in the way that one who truly knows does not have covetousness, for covetousness overcomes and remains in this venerable one; this venerable one does not truly know in the way that one who truly knows does not have aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires, for evil desires overcome and remain in this venerable one.’\n\n“Friends, when a bhikkhu speaks claiming both knowledge and development, saying, ‘I know this Dhamma, I see this Dhamma, my body is developed, my virtue is developed, my mind is developed, my wisdom is developed,’ if, friends, covetousness overcomes and remains in that bhikkhu, or aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires overcome and remain in him, then he should be understood thus: ‘This venerable one does not truly know in the way that one who truly knows does not have covetousness, for covetousness overcomes and remains in this venerable one; this venerable one does not truly know in the way that one who truly knows does not have aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires, for evil desires overcome and remain in this venerable one.’\n\n“Just as, friends, a person who is poor might speak of being wealthy, or one who has no possessions might speak of being well-endowed, or one who has no enjoyments might speak of having enjoyments. When some need for wealth arises, he would not be able to produce money, or grain, or silver, or gold. People would then know of him thus: ‘This venerable one, being poor, speaks of being wealthy; this venerable one, having no possessions, speaks of being well-endowed; this venerable one, having no enjoyments, speaks of having enjoyments. What is the reason for this? It is because when some need for wealth arises, this venerable one is unable to produce money, or grain, or silver, or gold.’\n\n“Even so, friends, when a bhikkhu speaks claiming both knowledge and development, saying, ‘I know this Dhamma, I see this Dhamma, my body is developed, my virtue is developed, my mind is developed, my wisdom is developed,’ if, friends, covetousness overcomes and remains in that bhikkhu, or aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires overcome and remain in him, then he should be understood thus: ‘This venerable one does not truly know in the way that one who truly knows does not have covetousness, for covetousness overcomes and remains in this venerable one; this venerable one does not truly know in the way that one who truly knows does not have aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires, for evil desires overcome and remain in this venerable one.’\n\n“Friends, when a bhikkhu speaks claiming knowledge, saying, ‘I know this Dhamma, I see this Dhamma,’ if, friends, covetousness does not overcome and remain in that bhikkhu, nor aversion, nor delusion, nor anger, nor resentment, nor denigration, nor domineering, nor jealousy, nor evil envy, nor evil desires overcome and remain in him, then he should be understood thus: ‘This venerable one truly knows in the way that one who truly knows does not have covetousness, for covetousness does not overcome and remain in this venerable one; this venerable one truly knows in the way that one who truly knows does not have aversion, or delusion, or anger, or resentment, or denigration, or domineering, or jealousy, or evil envy, or evil desires, for evil desires do not overcome and remain in this venerable one.’\n\n“Friends, when a bhikkhu speaks claiming development, saying, ‘My body is developed, my virtue is developed, my mind is developed, my wisdom is developed,’\n\nFriends, if greed does not overcome that bhikkhu and remain, nor aversion, nor delusion, nor anger, nor resentment, nor denigration, nor rivalry, nor avarice, nor evil envy, nor evil desire, then he should be understood thus: ‘This venerable one comprehends in such a way that for one who comprehends, greed does not arise, and thus greed does not overcome this venerable one and remain. This venerable one comprehends in such a way that for one who comprehends, aversion does not arise, nor delusion, nor anger, nor resentment, nor denigration, nor rivalry, nor avarice, nor evil envy, nor evil desire, and thus evil desire does not overcome this venerable one and remain.’\n\nWhen a bhikkhu, friends, professes a doctrine of knowledge and a doctrine of development, saying: ‘I know this Dhamma, I see this Dhamma, my body is cultivated, my moral conduct is cultivated, my mind is cultivated, my wisdom is cultivated,’ if greed does not overcome that bhikkhu and remain, nor aversion, nor delusion, nor anger, nor resentment, nor denigration, nor rivalry, nor avarice, nor evil envy, nor evil desire, then he should be understood thus: ‘This venerable one comprehends in such a way that for one who comprehends, greed does not arise, and thus greed does not overcome this venerable one and remain. This venerable one comprehends in such a way that for one who comprehends, aversion does not arise, nor delusion, nor anger, nor resentment, nor denigration, nor rivalry, nor avarice, nor evil envy, nor evil desire, and thus evil desire does not overcome this venerable one and remain.’ Just as, friends, a person who is wealthy would speak of being wealthy, who is rich in possessions would speak of being rich in possessions, who is rich in enjoyments would speak of being rich in enjoyments. Then, if some occasion for wealth arises, he would be able to provide money or grain or silver or gold. People would then know him thus: ‘This venerable one, being wealthy, speaks of being wealthy; this venerable one, being rich in possessions, speaks of being rich in possessions; this venerable one, being rich in enjoyments, speaks of being rich in enjoyments. What is the reason for that? Because, indeed, this venerable one, when some occasion for wealth arises, is able to provide money or grain or silver or gold.’ Just so, friends, when a bhikkhu professes a doctrine of knowledge and a doctrine of development, saying: ‘I know this Dhamma, I see this Dhamma, my body is cultivated, my moral conduct is cultivated, my mind is cultivated, my wisdom is cultivated,’ if greed does not overcome that bhikkhu and remain, nor aversion, nor delusion, nor anger, nor resentment, nor denigration, nor rivalry, nor avarice, nor evil envy, nor evil desire, then he should be understood thus: ‘This venerable one comprehends in such a way that for one who comprehends, greed does not arise, and thus greed does not overcome this venerable one and remain. This venerable one comprehends in such a way that for one who comprehends, aversion does not arise, nor delusion, nor anger, nor resentment, nor denigration, nor rivalry, nor avarice, nor evil envy, nor evil desire, and thus evil desire does not overcome this venerable one and remain.’",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේ චේතී ජනපදයෙහි සහජාතිය නම් ගමෙහි වාසය කළහ. එහිදී ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා, \"ඇවැත්නි භික්ෂූනි,\" යැයි වදාළහ. \"ඇවැත්නි\" යැයි ඒ භික්ෂූහු ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේට පිළිවදන් දුන්හ. ආයුෂ්මත් මහාචුන්ද ස්ථවිරයන් වහන්සේ මෙය වදාළහ:\n\n\"ඇවැත්නි, යම් භික්ෂුවක් ඥාණවාදයෙන් යුතුව, 'මම මේ ධර්මය දනිමි, මම මේ ධර්මය දකිමි' යැයි පවසන්නේ නම්. ඇවැත්නි, ඒ භික්ෂුව ලෝභය විසින් යටපත් කරනු ලැබ සිටී නම්, ද්වේෂය... මෝහය... ක්‍රෝධය... වෛර බැඳීම... ගුණ මැකීම... වරද වසා ගැනීම... මසුරුකම... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව විසින් යටපත් කරනු ලැබ සිටී නම්, ඔහු මෙසේ තේරුම් ගත යුතු යි: 'මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ලෝභය ඇති නොවේද, ඒ ලෙසින් දැන නොගනී. එහෙයින් මේ ආයුෂ්මත්ව ලෝභය විසින් යටපත් කරනු ලැබ සිටී. මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ද්වේෂය, මෝහය, ක්‍රෝධය, වෛර බැඳීම, ගුණ මැකීම, වරද වසා ගැනීම, මසුරුකම, පාපී ඊර්ෂ්‍යාව, පාපී ආශාව ඇති නොවේද, ඒ ලෙසින් දැන නොගනී. එහෙයින් මේ ආයුෂ්මත්ව පාපී ආශාව විසින් යටපත් කරනු ලැබ සිටී.'\n\n\"ඇවැත්නි, යම් භික්ෂුවක් භාවනාවාදයෙන් යුතුව, 'මාගේ කය දියුණු කර ඇත, සීලය දියුණු කර ඇත, සිත දියුණු කර ඇත, ප්‍රඥාව දියුණු කර ඇත' යැයි පවසන්නේ නම්. ඇවැත්නි, ඒ භික්ෂුව ලෝභය විසින් යටපත් කරනු ලැබ සිටී නම්, ද්වේෂය... මෝහය... ක්‍රෝධය... වෛර බැඳීම... ගුණ මැකීම... වරද වසා ගැනීම... මසුරුකම... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව විසින් යටපත් කරනු ලැබ සිටී නම්, ඔහු මෙසේ තේරුම් ගත යුතු යි: 'මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ලෝභය ඇති නොවේද, ඒ ලෙසින් දැන නොගනී. එහෙයින් මේ ආයුෂ්මත්ව ලෝභය විසින් යටපත් කරනු ලැබ සිටී. මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ද්වේෂය, මෝහය, ක්‍රෝධය, වෛර බැඳීම, ගුණ මැකීම, වරද වසා ගැනීම, මසුරුකම, පාපී ඊර්ෂ්‍යාව, පාපී ආශාව ඇති නොවේද, ඒ ලෙසින් දැන නොගනී. එහෙයින් මේ ආයුෂ්මත්ව පාපී ආශාව විසින් යටපත් කරනු ලැබ සිටී.'\n\n\"ඇවැත්නි, යම් භික්ෂුවක් ඥාණවාදයෙන්ද, භාවනාවාදයෙන්ද යුතුව, 'මම මේ ධර්මය දනිමි, මම මේ ධර්මය දකිමි, මාගේ කය දියුණු කර ඇත, සීලය දියුණු කර ඇත, සිත දියුණු කර ඇත, ප්‍රඥාව දියුණු කර ඇත' යැයි පවසන්නේ නම්. ඇවැත්නි, ඒ භික්ෂුව ලෝභය විසින් යටපත් කරනු ලැබ සිටී නම්, ද්වේෂය... මෝහය... ක්‍රෝධය... වෛර බැඳීම... ගුණ මැකීම... වරද වසා ගැනීම... මසුරුකම... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව විසින් යටපත් කරනු ලැබ සිටී නම්, ඔහු මෙසේ තේරුම් ගත යුතු යි: 'මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ලෝභය ඇති නොවේද, ඒ ලෙසින් දැන නොගනී. එහෙයින් මේ ආයුෂ්මත්ව ලෝභය විසින් යටපත් කරනු ලැබ සිටී. මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ද්වේෂය, මෝහය, ක්‍රෝධය, වෛර බැඳීම, ගුණ මැකීම, වරද වසා ගැනීම, මසුරුකම, පාපී ඊර්ෂ්‍යාව, පාපී ආශාව ඇති නොවේද, ඒ ලෙසින් දැන නොගනී. එහෙයින් මේ ආයුෂ්මත්ව පාපී ආශාව විසින් යටපත් කරනු ලැබ සිටී.'\n\n\"ඇවැත්නි, යම්සේ යම් පුරුෂයෙක් දුප්පත් ව සිටියද, 'මම ධනවත්ය'යි පවසන්නේද, ධනයක් නැතිව සිටියද, 'මම ධනවත්ය'යි පවසන්නේද, භෝග සම්පත් නැතිව සිටියද, 'මම භෝග සම්පත්තියෙන් යුක්තය'යි පවසන්නේද, යම්කිසි ධනය අවශ්‍ය වන කටයුත්තක් පැමිණි විට ධනයක් හෝ ධාන්‍යයක් හෝ රිදී හෝ රන් හෝ ලබාදීමට නොහැකි වන්නේය. ඔහුව මෙසේ හඳුනා ගනිති – 'මේ ආයුෂ්මත් දුප්පත් ව සිටියද, ධනවත්යයි පවසන්නේය. ධනයක් නැතිව සිටියද, ධනවත්යයි පවසන්නේය. භෝග සම්පත් නැතිව සිටියද, භෝග සම්පත්තියෙන් යුක්තයයි පවසන්නේය.' එයට හේතුව කුමක්ද? මක්නිසාද යත් මේ ආයුෂ්මත් යම්කිසි ධනය අවශ්‍ය වන කටයුත්තක් පැමිණි විට ධනයක් හෝ ධාන්‍යයක් හෝ රිදී හෝ රන් හෝ ලබාදීමට නොහැකි වන්නේය.'\n\n\"ඇවැත්නි, එලෙසම යම් භික්ෂුවක් ඥාණවාදයෙන්ද, භාවනාවාදයෙන්ද යුතුව, 'මම මේ ධර්මය දනිමි, මම මේ ධර්මය දකිමි, මාගේ කය දියුණු කර ඇත, සීලය දියුණු කර ඇත, සිත දියුණු කර ඇත, ප්‍රඥාව දියුණු කර ඇත' යැයි පවසන්නේ නම්. ඇවැත්නි, ඒ භික්ෂුව ලෝභය විසින් යටපත් කරනු ලැබ සිටී නම්, ද්වේෂය... මෝහය... ක්‍රෝධය... වෛර බැඳීම... ගුණ මැකීම... වරද වසා ගැනීම... මසුරුකම... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව විසින් යටපත් කරනු ලැබ සිටී නම්, ඔහු මෙසේ තේරුම් ගත යුතු යි: 'මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ලෝභය ඇති නොවේද, ඒ ලෙසින් දැන නොගනී. එහෙයින් මේ ආයුෂ්මත්ව ලෝභය විසින් යටපත් කරනු ලැබ සිටී. මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ද්වේෂය, මෝහය, ක්‍රෝධය, වෛර බැඳීම, ගුණ මැකීම, වරද වසා ගැනීම, මසුරුකම, පාපී ඊර්ෂ්‍යාව, පාපී ආශාව ඇති නොවේද, ඒ ලෙසින් දැන නොගනී. එහෙයින් මේ ආයුෂ්මත්ව පාපී ආශාව විසින් යටපත් කරනු ලැබ සිටී.'\n\n\"ඇවැත්නි, යම් භික්ෂුවක් ඥාණවාදයෙන් යුතුව, 'මම මේ ධර්මය දනිමි, මම මේ ධර්මය දකිමි' යැයි පවසන්නේ නම්. ඇවැත්නි, ඒ භික්ෂුව ලෝභය විසින් යටපත් කරනු ලැබ නොසිටී නම්, ද්වේෂය... මෝහය... ක්‍රෝධය... වෛර බැඳීම... ගුණ මැකීම... වරද වසා ගැනීම... මසුරුකම... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව විසින් යටපත් කරනු ලැබ නොසිටී නම්, ඔහු මෙසේ තේරුම් ගත යුතු යි: 'මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ලෝභය ඇති නොවේද, ඒ ලෙසින් දනී. එහෙයින් මේ ආයුෂ්මත්ව ලෝභය විසින් යටපත් කරනු ලැබ නොසිටී. මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ද්වේෂය, මෝහය, ක්‍රෝධය, වෛර බැඳීම, ගුණ මැකීම, වරද වසා ගැනීම, මසුරුකම, පාපී ඊර්ෂ්‍යාව, පාපී ආශාව ඇති නොවේද, ඒ ලෙසින් දනී. එහෙයින් මේ ආයුෂ්මත්ව පාපී ආශාව විසින් යටපත් කරනු ලැබ නොසිටී.'\n\n\"ඇවැත්නි, යම් භික්ෂුවක් භාවනාවාදයෙන් යුතුව, 'මාගේ කය දියුණු කර ඇත, සීලය දියුණු කර ඇත, සිත දියුණු කර ඇත, ප්‍රඥාව දියුණු කර ඇත' යැයි පවසන්නේ නම්, ඇවැත්නි, ඒ භික්ෂුව ලෝභය විසින් යටපත් කරනු ලැබ නොසිටී නම්, ද්වේෂය... මෝහය... ක්‍රෝධය... වෛර බැඳීම... ගුණ මැකීම... වරද වසා ගැනීම... මසුරුකම... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව විසින් යටපත් කරනු ලැබ නොසිටී නම්, ඔහු මෙසේ තේරුම් ගත යුතු යි: 'මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ලෝභය ඇති නොවේද, ඒ ලෙසින් දනී. එහෙයින් මේ ආයුෂ්මත්ව ලෝභය විසින් යටපත් කරනු ලැබ නොසිටී. මේ ආයුෂ්මත් යම් ලෙසකින් දැනගත් කල්හි ද්වේෂය, මෝහය, ක්‍රෝධය, වෛර බැඳීම, ගුණ මැකීම, වරද වසා ගැනීම, මසුරුකම, පාපී ඊර්ෂ්‍යාව, පාපී ආශාව ඇති නොවේද, ඒ ලෙසින් දනී. එහෙයින් මේ ආයුෂ්මත්ව පාපී ආශාව විසින් යටපත් කරනු ලැබ නොසිටී.'\n\nමිත්‍රවරුනි, යම් භික්ෂුවක් ලෝභය යටපත් කර නොපවතින්නේද, ද්වේෂය... මෝහය... ක‍්‍රෝධය... උපනාහය... මක්ඛය... පලාසය... මාත්සර්යය... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව යටපත් කර නොපවතින්නේද, ඔහු මෙසේ දැනගත යුතුයි – ‘මේ ආයුෂ්මත් දන්නා අයුරින් ලෝභය ඇති නොවේ, මේ ආයුෂ්මත්ව ලෝභය යටපත් කර නොපවතී; මේ ආයුෂ්මත් දන්නා අයුරින් ද්වේෂය ඇති නොවේ... මෝහය... ක‍්‍රෝධය... උපනාහය... මක්ඛය... පලාසය... මාත්සර්යය... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව ඇති නොවේ, මේ ආයුෂ්මත්ව පාපී ආශාව යටපත් කර නොපවතී.’\n\nමිත්‍රවරුනි, ඥානවාදයද, භාවනාවාදයද ප්‍රකාශ කරන භික්ෂුවක් – ‘මම මේ ධර්මය දනිමි, මම මේ ධර්මය දකිමි, මම කය වඩන ලද්දෙමි, සීලය වඩන ලද්දෙමි, සිත වඩන ලද්දෙමි, ප‍්‍රඥාව වඩන ලද්දෙමි’යි කියයි. ඒ භික්ෂුව ලෝභය යටපත් කර නොපවතින්නේද, ද්වේෂය... මෝහය... ක‍්‍රෝධය... උපනාහය... මක්ඛය... පලාසය... මාත්සර්යය... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව යටපත් කර නොපවතින්නේද, ඔහු මෙසේ දැනගත යුතුයි – ‘මේ ආයුෂ්මත් දන්නා අයුරින් ලෝභය ඇති නොවේ, මේ ආයුෂ්මත්ව ලෝභය යටපත් කර නොපවතී; මේ ආයුෂ්මත් දන්නා අයුරින් ද්වේෂය ඇති නොවේ... මෝහය... ක‍්‍රෝධය... උපනාහය... මක්ඛය... පලාසය... මාත්සර්යය... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව ඇති නොවේ, මේ ආයුෂ්මත්ව පාපී ආශාව යටපත් කර නොපවතී.’\n\nමිත්‍රවරුනි, යම් සේ ධනවත් පුරුෂයෙක් ධනවත් බව ගැන කියන්නේද, ධනය ඇති අයෙක් ධනය ගැන කියන්නේද, භෝග සම්පත් ඇති අයෙක් භෝග සම්පත් ගැන කියන්නේද, යම්කිසි ධන කටයුත්තක් පැමිණි විට ඔහුට ධනය හෝ ධාන්‍ය හෝ රිදී හෝ රන් සැපයීමට හැකි වන්නේද, ඔහුව මෙසේ දැනගත යුතුයි – ‘මේ ආයුෂ්මත් ධනවත් වන නිසාම ධනවත් බව ගැන කියයි. මේ ආයුෂ්මත් ධනය ඇති අයෙක් වන නිසාම ධනය ගැන කියයි. මේ ආයුෂ්මත් භෝග සම්පත් ඇති අයෙක් වන නිසාම භෝග සම්පත් ගැන කියයි. එයට හේතුව කුමක්ද? මේ ආයුෂ්මතාට යම්කිසි ධන කටයුත්තක් පැමිණි විට, ධනය හෝ ධාන්‍ය හෝ රිදී හෝ රන් සැපයීමට හැකි වන බැවිනි.’ මිත්‍රවරුනි, එපරිද්දෙන්ම ඥානවාදයද, භාවනාවාදයද ප්‍රකාශ කරන භික්ෂුවක් – ‘මම මේ ධර්මය දනිමි, මම මේ ධර්මය දකිමි, මම කය වඩන ලද්දෙමි, සීලය වඩන ලද්දෙමි, සිත වඩන ලද්දෙමි, ප‍්‍රඥාව වඩන ලද්දෙමි’යි කියයි. ඒ භික්ෂුව ලෝභය යටපත් කර නොපවතින්නේද, ද්වේෂය... මෝහය... ක‍්‍රෝධය... උපනාහය... මක්ඛය... පලාසය... මාත්සර්යය... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව යටපත් කර නොපවතින්නේද, ඔහු මෙසේ දැනගත යුතුයි – ‘මේ ආයුෂ්මත් දන්නා අයුරින් ලෝභය ඇති නොවේ, මේ ආයුෂ්මත්ව ලෝභය යටපත් කර නොපවතී; මේ ආයුෂ්මත් දන්නා අයුරින් ද්වේෂය ඇති නොවේ... මෝහය... ක‍්‍රෝධය... උපනාහය... මක්ඛය... පලාසය... මාත්සර්යය... පාපී ඊර්ෂ්‍යාව... පාපී ආශාව ඇති නොවේ, මේ ආයුෂ්මත්ව පාපී ආශාව යටපත් කර නොපවතී.’ සතරවෙනි සූත්‍රයයි.",
      "paliTitle": "Mahācundasuttaṃ",
      "englishTitle": "Mahācunda Sutta",
      "sinhalaTitle": "මහාචුන්ද සූත්‍රය"
    },
    {
      "number": 25,
      "pali": "[dī. ni. 3.346, 360; a. ni. 10.29] ‘‘Dasayimāni, bhikkhave, kasiṇāyatanāni. Katamāni dasa? Pathavīkasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ; āpokasiṇameko sañjānāti… pe… tejokasiṇameko sañjānāti… vāyokasiṇameko sañjānāti… nīlakasiṇameko sañjānāti… pītakasiṇameko sañjānāti… lohitakasiṇameko sañjānāti… odātakasiṇameko sañjānāti… ākāsakasiṇameko sañjānāti… viññāṇakasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Imāni kho, bhikkhave, dasa kasiṇāyatanānī’’ti. Pañcamaṃ.",
      "english": "“Monastics, these are the ten kasiṇa-bases. Which ten? Someone perceives the earth kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the water kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the fire kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the wind kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the blue kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the yellow kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the red kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the white kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the space kasiṇa upwards, downwards, across, as undivided, and as immeasurable; someone perceives the consciousness kasiṇa upwards, downwards, across, as undivided, and as immeasurable. These, monastics, are indeed the ten kasiṇa-bases.”",
      "sinhala": "භික්ෂූන් වහන්සේලා, මේවා දස කසිණායතනයෝ වෙති. කවරක්ද ඒ දසය?\n\nඑක භික්ෂුවක් පඨවි කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් ආපෝ කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් තේජෝ කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් වායෝ කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් නීල කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් පීත කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් ලෝහිත කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් ඕදාත කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් ආකාශ කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී. එක භික්ෂුවක් විඤ්ඤාණ කසිණය උඩට, යටට, හරහට, දෙවැදෑරුම් නොවූ, අප්‍රමාණ වශයෙන් සඤ්ඤා වශයෙන් දැනගනී.\n\nභික්ෂූන් වහන්සේලා, ඇත්තෙන්ම මේවා දස කසිණායතනයෝ වෙති.",
      "paliTitle": "Kasiṇasuttaṃ",
      "englishTitle": "The Kasiṇa Discourse",
      "sinhalaTitle": "කසිණ සූත‍්‍රය"
    },
    {
      "number": 26,
      "pali": "Ekaṃ samayaṃ āyasmā mahākaccāno avantīsu viharati kuraraghare [gulaghare (ka.) kururaghare mahāva. 257] pavatte pabbate. Atha kho kāḷī upāsikā kuraragharikā yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmantaṃ mahākaccānaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnā kho kāḷī upāsikā kuraragharikā āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘vuttamidaṃ, bhante, bhagavatā kumāripañhesu – ‘Atthassa pattiṃ hadayassa santiṃ, Jetvāna senaṃ piyasātarūpaṃ; Ekohaṃ [ekāhaṃ (ka.)] jhāyaṃ sukhamanubodhiṃ, Tasmā janena na karomi sakkhiṃ [sakhiṃ (ka.) saṃ. ni. 1.161 passitabbaṃ]; Sakkhī [sakhī (ka.)] na sampajjati kenaci me’ti. ‘‘Imassa kho, bhante, bhagavatā saṃkhittena bhāsitassa kathaṃ vitthārena attho daṭṭhabbo’’ti? ‘‘Pathavīkasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā ‘attho’ti abhinibbattesuṃ [atthābhinibbattesuṃ (sī. syā.)]. Yāvatā kho, bhagini, pathavīkasiṇasamāpattiparamatā, tadabhiññāsi bhagavā. Tadabhiññāya bhagavā assādamaddasa [ādimaddasa (sī. syā.)] ādīnavamaddasa nissaraṇamaddasa maggāmaggañāṇadassanamaddasa. Tassa assādadassanahetu ādīnavadassanahetu nissaraṇadassanahetu maggāmaggañāṇadassanahetu atthassa patti hadayassa santi viditā hoti. ‘‘Āpokasiṇasamāpattiparamā kho, bhagini…pe… tejokasiṇasamāpattiparamā kho, bhagini… vāyokasiṇasamāpattiparamā kho, bhagini… nīlakasiṇasamāpattiparamā kho, bhagini… pītakasiṇasamāpattiparamā kho, bhagini… lohitakasiṇasamāpattiparamā kho, bhagini… odātakasiṇasamāpattiparamā kho, bhagini… ākāsakasiṇasamāpattiparamā kho, bhagini… viññāṇakasiṇasamāpattiparamā kho, bhagini, eke samaṇabrāhmaṇā ‘attho’ti abhinibbattesuṃ. Yāvatā kho, bhagini, viññāṇakasiṇasamāpattiparamatā, tadabhiññāsi bhagavā. Tadabhiññāya bhagavā assādamaddasa ādīnavamaddasa nissaraṇamaddasa maggāmaggañāṇadassanamaddasa. Tassa assādadassanahetu ādīnavadassanahetu nissaraṇadassanahetu maggāmaggañāṇadassanahetu atthassa patti hadayassa santi viditā hoti. Iti kho, bhagini, yaṃ taṃ vuttaṃ bhagavatā kumāripañhesu – ‘Atthassa pattiṃ hadayassa santiṃ, Jetvāna senaṃ piyasātarūpaṃ; Ekohaṃ jhāyaṃ sukhamanubodhiṃ, Tasmā janena na karomi sakkhiṃ; Sakkhī na sampajjati kenaci me’ti. ‘‘Imassa kho, bhagini, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena attho daṭṭhabbo’’ti. Chaṭṭhaṃ.",
      "english": "One time, the Venerable Mahākaccāna was dwelling in Avanti, at Kuraraghara, on Pavatta mountain. Then the lay follower Kālī from Kuraraghara approached the Venerable Mahākaccāna. Having approached, she paid homage to the Venerable Mahākaccāna and sat down to one side. Seated to one side, the lay follower Kālī from Kuraraghara said to the Venerable Mahākaccāna: \"Venerable sir, this was said by the Blessed One in the 'Questions of a Young Girl': 'Having attained the ultimate goal, having found peace of mind, having conquered the army of what is agreeable and pleasant; I, meditating alone, realized a profound happiness. Therefore, I do not make anyone a witness. No one serves as a companion for me.' Venerable sir, how is the detailed meaning of this statement, spoken concisely by the Blessed One, to be understood?\"\n\n\"Sister, some ascetics and brahmins considered the attainment of absorption based on the earth kasiṇa to be the ultimate goal. Sister, whatever there is regarding the ultimate extent of the attainment of absorption based on the earth kasiṇa, the Blessed One fully knew that. Having fully known that, the Blessed One saw its gratification, its danger, its escape, and the knowledge and vision of the path and the not-path. Due to seeing its gratification, due to seeing its danger, due to seeing its escape, due to seeing the knowledge and vision of the path and the not-path, the attainment of the goal and peace of mind become known.\n\n\"Sister, some ascetics and brahmins considered the attainment of absorption based on the water kasiṇa to be the ultimate goal. Sister, some ascetics and brahmins considered the attainment of absorption based on the fire kasiṇa to be the ultimate goal. Sister, some ascetics and brahmins considered the attainment of absorption based on the wind kasiṇa to be the ultimate goal. Sister, some ascetics and brahmins considered the attainment of absorption based on the blue kasiṇa to be the ultimate goal. Sister, some ascetics and brahmins considered the attainment of absorption based on the yellow kasiṇa to be the ultimate goal. Sister, some ascetics and brahmins considered the attainment of absorption based on the red kasiṇa to be the ultimate goal. Sister, some ascetics and brahmins considered the attainment of absorption based on the white kasiṇa to be the ultimate goal. Sister, some ascetics and brahmins considered the attainment of absorption based on the space kasiṇa to be the ultimate goal. Sister, some ascetics and brahmins considered the attainment of absorption based on the consciousness kasiṇa to be the ultimate goal. Sister, whatever there is regarding the ultimate extent of the attainment of absorption based on the consciousness kasiṇa, the Blessed One fully knew that. Having fully known that, the Blessed One saw its gratification, its danger, its escape, and the knowledge and vision of the path and the not-path. Due to seeing its gratification, due to seeing its danger, due to seeing its escape, due to seeing the knowledge and vision of the path and the not-path, the attainment of the goal and peace of mind become known.\"\n\n\"Thus, sister, concerning that which was said by the Blessed One in the 'Questions of a Young Girl': 'Having attained the ultimate goal, having found peace of mind, having conquered the army of what is agreeable and pleasant; I, meditating alone, realized a profound happiness. Therefore, I do not make anyone a witness. No one serves as a companion for me.' The detailed meaning of this statement, spoken concisely by the Blessed One, is to be understood in this way.\"",
      "sinhala": "එක් සමයෙක්හි ආයුෂ්මත් මහාකච්චාන ස්ථවිරයන් වහන්සේ අවන්තී දේශයේ කුරරඝර නම් ග්‍රාමය අසල පවත්නා පර්වතයක වාසය කළහ. එවිට කුරරඝර ගමෙහි විසූ කාලී උපාසිකාව යම් තැනක ආයුෂ්මත් මහාකච්චාන ස්ථවිරයන් වහන්සේ වැඩසිටියේද එතැනට පැමිණියාය. පැමිණ, ආයුෂ්මත් මහාකච්චාන ස්ථවිරයන් වහන්සේට වන්දනා කොට, එකත්පසෙක වාඩිවූවාය. එකත්පසෙක වාඩිවූ කාලී උපාසිකාව ආයුෂ්මත් මහාකච්චාන ස්ථවිරයන් වහන්සේට මෙසේ පැවසුවාය: \"භන්තේ, භාග්‍යවතුන් වහන්සේ විසින් කුමාරිපඤ්හයන්හිදී මෙසේ වදාරන ලද්දක් ඇත: 'අර්ථයන්ගේ (පරමාර්ථ සත්‍යයේ) පැමිණීමද, හදවතේ ශාන්තියද, ප්‍රිය ස්වභාවය වූ රාග සේනාවද ජයගෙන, මම තනිවම ධ්‍යාන කරමින්, ශ්‍රේෂ්ඨතම සුවය අවබෝධ කළෙමි. එහෙයින් මම අන්‍ය ජනයා සමග කිසිදු මිත්‍රත්වයක් නොකරමි. කිසිවෙකු සමග මට මිත්‍රත්වයක් ඇති නොවන්නේය.' භන්තේ, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් වදාළ මේ දේශනාවේ අර්ථය කෙසේ විස්තර වශයෙන් දත යුතුද?\"\n\n\"නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ පෘථිවී කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය (නිවන) යැයි අභිප්‍රාය කළහ. නැගණියනි, යම්තාක් දුරට පෘථිවී කසිණ සමාපත්තියෙහි පරම භාවය වේද, ඒ සියල්ල භාග්‍යවතුන් වහන්සේ විශිෂ්ට ඥානයෙන් අවබෝධ කළහ. එය විශිෂ්ට ඥානයෙන් අවබෝධ කොට, භාග්‍යවතුන් වහන්සේ එහි ආස්වාදයද, ආදීනවයද, නිස්සරණයද, මාර්ගය සහ අමාර්ගය පිළිබඳ ඥාන දර්ශනයද මනාව දුටු සේක. එහි ආස්වාදය දැකීම හේතුකොටගෙනද, ආදීනවය දැකීම හේතුකොටගෙනද, නිස්සරණය දැකීම හේතුකොටගෙනද, මාර්ගය සහ අමාර්ගය පිළිබඳ ඥාන දර්ශනය දැකීම හේතුකොටගෙනද, (පරම) අර්ථයේ පැමිණීම සහ හදවතේ ශාන්තිය අවබෝධ වන්නේය.\"\n\n\"නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ ආපෝ කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ තේජෝ කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ වායෝ කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ නීල කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ පීත කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ ලෝහිත කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ ඕදාත කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ ආකාශ කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ විඥාණ කසිණ සමාපත්තිය (මට්ටම) පරම අර්ථය යැයි අභිප්‍රාය කළහ. නැගණියනි, යම්තාක් දුරට විඥාණ කසිණ සමාපත්තියෙහි පරම භාවය වේද, ඒ සියල්ල භාග්‍යවතුන් වහන්සේ විශිෂ්ට ඥානයෙන් අවබෝධ කළහ. එය විශිෂ්ට ඥානයෙන් අවබෝධ කොට, භාග්‍යවතුන් වහන්සේ එහි ආස්වාදයද, ආදීනවයද, නිස්සරණයද, මාර්ගය සහ අමාර්ගය පිළිබඳ ඥාන දර්ශනයද මනාව දුටු සේක. එහි ආස්වාදය දැකීම හේතුකොටගෙනද, ආදීනවය දැකීම හේතුකොටගෙනද, නිස්සරණය දැකීම හේතුකොටගෙනද, මාර්ගය සහ අමාර්ගය පිළිබඳ ඥාන දර්ශනය දැකීම හේතුකොටගෙනද, (පරම) අර්ථයේ පැමිණීම සහ හදවතේ ශාන්තිය අවබෝධ වන්නේය.\"\n\n\"නැගණියනි, මෙසේ යම් මේ දෙය භාග්‍යවතුන් වහන්සේ විසින් කුමාරිපඤ්හයන්හිදී වදාරන ලද්දේද, එනම්: 'අර්ථයන්ගේ (පරමාර්ථ සත්‍යයේ) පැමිණීමද, හදවතේ ශාන්තියද, ප්‍රිය ස්වභාවය වූ රාග සේනාවද ජයගෙන, මම තනිවම ධ්‍යාන කරමින්, ශ්‍රේෂ්ඨතම සුවය අවබෝධ කළෙමි. එහෙයින් මම අන්‍ය ජනයා සමග කිසිදු මිත්‍රත්වයක් නොකරමි. කිසිවෙකු සමග මට මිත්‍රත්වයක් ඇති නොවන්නේය,' භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් වදාළ මේ දේශනාවේ අර්ථය මෙලෙස විස්තර වශයෙන් දත යුතුයි.\"",
      "paliTitle": "Kāḷīsuttaṃ",
      "englishTitle": "Kāḷī Sutta",
      "sinhalaTitle": "කාලී සූත්‍රය"
    },
    {
      "number": 27,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho sambahulā bhikkhū pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisiṃsu. Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ; yaṃnūna mayaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyyāmā’’ti. Atha kho te bhikkhū yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkamiṃsu; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinne kho te bhikkhū te aññatitthiyā paribbājakā etadavocuṃ – ‘‘Samaṇo, āvuso, gotamo sāvakānaṃ evaṃ dhammaṃ deseti – ‘etha tumhe, bhikkhave, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathā’ti; mayampi kho, āvuso, sāvakānaṃ evaṃ dhammaṃ desema – ‘etha tumhe, āvuso, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathā’ti. Idha no, āvuso, ko viseso ko adhippayāso kiṃ nānākaraṇaṃ samaṇassa vā gotamassa amhākaṃ vā, yadidaṃ dhammadesanāya vā dhammadesanaṃ anusāsaniyā vā anusāsani’’nti? Atha kho te bhikkhū tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandiṃsu nappaṭikkosiṃsu. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamiṃsu – ‘‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmā’’ti. Atha kho te bhikkhū sāvatthiyaṃ piṇḍāya caritvā pacchābhattaṃ piṇḍapātapaṭikkantā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘Idha mayaṃ, bhante, pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pavisimhā. Tesaṃ no, bhante, amhākaṃ etadahosi – ‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ; yaṃnūna mayaṃ yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkameyyāmā’ti. Atha kho mayaṃ, bhante, yena aññatitthiyānaṃ paribbājakānaṃ ārāmo tenupasaṅkamimhā; upasaṅkamitvā tehi aññatitthiyehi paribbājakehi saddhiṃ sammodimhā. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdimhā. Ekamantaṃ nisinne kho, bhante, aññatitthiyā paribbājakā amhe etadavocuṃ – ‘Samaṇo, āvuso, gotamo sāvakānaṃ evaṃ dhammaṃ deseti – etha tumhe, bhikkhave, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathāti; mayampi kho, āvuso, sāvakānaṃ evaṃ dhammaṃ desema – etha tumhe, āvuso, sabbaṃ dhammaṃ abhijānātha, sabbaṃ dhammaṃ abhiññāya viharathāti. Idha no, āvuso, ko viseso ko adhippayāso kiṃ nānākaraṇaṃ samaṇassa vā gotamassa amhākaṃ vā, yadidaṃ dhammadesanāya vā dhammadesanaṃ anusāsaniyā vā anusāsani’nti? ‘‘Atha kho mayaṃ, bhante, tesaṃ aññatitthiyānaṃ paribbājakānaṃ bhāsitaṃ neva abhinandimhā nappaṭikkosimhā. Anabhinanditvā appaṭikkositvā uṭṭhāyāsanā pakkamimhā – ‘bhagavato santike etassa bhāsitassa atthaṃ ājānissāmā’’’ti. ‘‘Evaṃvādino, bhikkhave, aññatitthiyā paribbājakā evamassu vacanīyā – ‘eko, āvuso, pañho eko uddeso ekaṃ veyyākaraṇaṃ, dve pañhā dve uddesā dve veyyākaraṇāni, tayo pañhā tayo uddesā tīṇi veyyākaraṇāni, cattāro pañhā cattāro uddesā cattāri veyyākaraṇāni, pañca pañhā pañcuddesā pañca veyyākaraṇāni, cha pañhā cha uddesā cha veyyākaraṇāni, satta pañhā sattuddesā satta veyyākaraṇāni, aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇāni, nava pañhā navuddesā nava veyyākaraṇāni, dasa pañhā dasuddesā dasa veyyākaraṇānī’ti. Evaṃ puṭṭhā, bhikkhave, aññatitthiyā paribbājakā na ceva sampāyissanti, uttari ca vighātaṃ āpajjissanti. Taṃ kissa hetu? Yathā taṃ, bhikkhave, avisayasmiṃ. Nāhaṃ taṃ, bhikkhave, passāmi sadevake loke samārake sabrahmake sassamaṇabrāhmaṇiyā pajāya sadevamanussāya yo imesaṃ pañhānaṃ veyyākaraṇena cittaṃ ārādheyya, aññatra tathāgatena vā tathāgatasāvakena vā ito vā pana sutvā. ‘‘‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Ekadhamme, bhikkhave, bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamasmiṃ ekadhamme? ‘Sabbe sattā āhāraṭṭhitikā’ – imasmiṃ kho, bhikkhave, ekadhamme bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Dve pañhā dve uddesā dve veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Dvīsu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dvīsu? Nāme ca rūpe ca – imesu kho, bhikkhave, dvīsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Dve pañhā dve uddesā dve veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tīsu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu tīsu? Tīsu vedanāsu – imesu kho, bhikkhave, tīsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Catūsu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu catūsu? Catūsu āhāresu – imesu kho, bhikkhave, catūsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Pañca pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Pañcasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu pañcasu? Pañcasu upādānakkhandhesu – imesu kho, bhikkhave, pañcasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Pañca pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Cha pañhā cha uddesā cha veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Chasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu chasu? Chasu ajjhattikesu āyatanesu – imesu kho, bhikkhave, chasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Cha pañhā cha uddesā cha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Satta pañhā sattuddesā satta veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Sattasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu sattasu? Sattasu viññāṇaṭṭhitīsu – imesu kho, bhikkhave, sattasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Satta pañhā sattuddesā satta veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Aṭṭhasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu aṭṭhasu? Aṭṭhasu lokadhammesu – imesu kho, bhikkhave, aṭṭhasu dhammesu bhikkhu sammā nibbindamāno…pe… dukkhassantakaro hoti. ‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Navasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu navasu? Navasu sattāvāsesu – imesu kho, bhikkhave, navasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vuttaṃ. ‘‘‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Dasasu, bhikkhave, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dasasu? Dasasu akusalesu kammapathesu – imesu kho, bhikkhave, dasasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ idametaṃ paṭicca vutta’’nti. Sattamaṃ.",
      "english": "At one time the Blessed One was staying at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s Monastery. Then, in the morning, a number of bhikkhus, having dressed and taken their bowls and robes, entered Sāvatthī for alms. Then it occurred to those bhikkhus, “It’s still too early to wander for alms in Sāvatthī. Let us go to the park of the other sect’s wandering ascetics.” Then those bhikkhus went to the park of the other sect’s wandering ascetics; having gone there, they exchanged greetings with those wandering ascetics of other sects. After exchanging polite and noteworthy conversation, they sat down to one side. As those bhikkhus were sitting to one side, the wandering ascetics of other sects said to them, “Friends, the recluse Gotama teaches the Dhamma to his disciples in this way: ‘Come, bhikkhus, thoroughly understand all phenomena; having thoroughly understood all phenomena, dwell accordingly.’ We too, friends, teach the Dhamma to our disciples in this way: ‘Come, friends, thoroughly understand all phenomena; having thoroughly understood all phenomena, dwell accordingly.’ So, friends, what is the difference, what is the distinction, what is the disparity between the recluse Gotama and us, regarding this teaching of the Dhamma or instruction in the Dhamma?” Then those bhikkhus neither approved nor disapproved of the statement of those wandering ascetics of other sects. Without approving or disapproving, they rose from their seats and departed, thinking, “We shall learn the meaning of this statement in the presence of the Blessed One.” Then, having wandered for alms in Sāvatthī and returned from their alms-round after their meal, those bhikkhus went to the Blessed One; having gone there, they saluted the Blessed One and sat down to one side. As they were sitting to one side, those bhikkhus said to the Blessed One, “Here, venerable sir, in the morning, having dressed and taken our bowls and robes, we entered Sāvatthī for alms. Then it occurred to us, venerable sir, ‘It’s still too early to wander for alms in Sāvatthī. Let us go to the park of the other sect’s wandering ascetics.’ Then, venerable sir, we went to the park of the other sect’s wandering ascetics; having gone there, we exchanged greetings with those wandering ascetics of other sects. After exchanging polite and noteworthy conversation, we sat down to one side. As we were sitting to one side, venerable sir, the wandering ascetics of other sects said to us, ‘Friends, the recluse Gotama teaches the Dhamma to his disciples in this way: “Come, bhikkhus, thoroughly understand all phenomena; having thoroughly understood all phenomena, dwell accordingly.” We too, friends, teach the Dhamma to our disciples in this way: “Come, friends, thoroughly understand all phenomena; having thoroughly understood all phenomena, dwell accordingly.” So, friends, what is the difference, what is the distinction, what is the disparity between the recluse Gotama and us, regarding this teaching of the Dhamma or instruction in the Dhamma?’ “Then, venerable sir, we neither approved nor disapproved of the statement of those wandering ascetics of other sects. Without approving or disapproving, we rose from our seats and departed, thinking, ‘We shall learn the meaning of this statement in the presence of the Blessed One.’”\n\n“Bhikkhus, when wandering ascetics of other sects speak in this way, they should be told: ‘Friends, there is one question, one exposition, one explanation; there are two questions, two expositions, two explanations; there are three questions, three expositions, three explanations; there are four questions, four expositions, four explanations; there are five questions, five expositions, five explanations; there are six questions, six expositions, six explanations; there are seven questions, seven expositions, seven explanations; there are eight questions, eight expositions, eight explanations; there are nine questions, nine expositions, nine explanations; there are ten questions, ten expositions, ten explanations.’ When questioned in this way, bhikkhus, the wandering ascetics of other sects will neither succeed in answering nor will they become further agitated. And why is that? Because, bhikkhus, it lies outside their domain. I do not see, bhikkhus, in the world with its devas, Māras, and Brahmās, among the generation with its recluses and brahmins, its devas and humans, anyone who could satisfy the mind with an explanation of these questions, apart from a Tathāgata, or a disciple of a Tathāgata, or one who has heard it from them. “Now, it was said: ‘There is one question, one exposition, one explanation.’ With reference to what was this said? Regarding one phenomenon, bhikkhus, a bhikkhu, correctly disillusioned, correctly dispassionate, correctly liberated, correctly seeing the limit, having correctly comprehended the meaning, becomes one who makes an end of suffering in this very life. In which one phenomenon?\n\n‘All beings are sustained by nutriment’ – concerning this one principle, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. ‘One question, one theme, one exposition’ – what was said thus, was said with reference to this.\n\n‘Two questions, two themes, two expositions’ – this was also said. With reference to what was this said? Concerning two principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. Which two? Name and form. Concerning these two principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. ‘Two questions, two themes, two expositions’ – what was said thus, was said with reference to this.\n\n‘Three questions, three themes, three expositions’ – this was also said. With reference to what was this said? Concerning three principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. Which three? The three feelings. Concerning these three principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. ‘Three questions, three themes, three expositions’ – what was said thus, was said with reference to this.\n\n‘Four questions, four themes, four expositions’ – this was also said. With reference to what was this said? Concerning four principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. Which four? The four nutriments. Concerning these four principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. ‘Four questions, four themes, four expositions’ – what was said thus, was said with reference to this.\n\n‘Five questions, five themes, five expositions’ – this was also said. With reference to what was this said? Concerning five principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. Which five? The five aggregates of clinging. Concerning these five principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. ‘Five questions, five themes, five expositions’ – what was said thus, was said with reference to this.\n\n‘Six questions, six themes, six expositions’ – this was also said. With reference to what was this said? Concerning six principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. Which six? The six internal sense bases. Concerning these six principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. ‘Six questions, six themes, six expositions’ – what was said thus, was said with reference to this.\n\n‘Seven questions, seven themes, seven expositions’ – this was also said. With reference to what was this said? Concerning seven principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. Which seven? The seven stations of consciousness. Concerning these seven principles, bhikkhus, a bhikkhu who rightly experiences disenchantment, rightly develops dispassion, rightly attains liberation, rightly perceives the ultimate end, and rightly comprehends the true goal, becomes one who puts an end to suffering in this very life. ‘Seven questions, seven themes, seven expositions’ – what was said thus, was said with reference to this.\n\n‘Eight questions, eight themes, eight expositions’ – this was also said. With reference to what was this said?\n\nMonks, a monk who, regarding eight things, rightly experiences disenchantment, rightly experiences the fading away of passion, rightly experiences liberation, rightly sees the ultimate end, having fully understood the true aim, becomes an end-maker of suffering in this very life. Which eight? The eight worldly conditions. Monks, a monk who, regarding these eight things, rightly experiences disenchantment, rightly experiences the fading away of passion, rightly experiences liberation, rightly sees the ultimate end, having fully understood the true aim, becomes an end-maker of suffering in this very life. What was said as \"Eight questions, eight categories, eight explanations\" was said in reference to this.\n\nAgain, what was said as \"Nine questions, nine categories, nine explanations\"—in reference to what was this said? Monks, a monk who, regarding nine things, rightly experiences disenchantment, rightly experiences the fading away of passion, rightly experiences liberation, rightly sees the ultimate end, having fully understood the true aim, becomes an end-maker of suffering in this very life. Which nine? The nine abodes of beings. Monks, a monk who, regarding these nine things, rightly experiences disenchantment, rightly experiences the fading away of passion, rightly experiences liberation, rightly sees the ultimate end, having fully understood the true aim, becomes an end-maker of suffering in this very life. What was said as \"Nine questions, nine categories, nine explanations\" was said in reference to this.\n\nAgain, what was said as \"Ten questions, ten categories, ten explanations\"—in reference to what was this said? Monks, a monk who, regarding ten things, rightly experiences disenchantment, rightly experiences the fading away of passion, rightly experiences liberation, rightly sees the ultimate end, having fully understood the true aim, becomes an end-maker of suffering in this very life. Which ten? The ten unwholesome courses of action. Monks, a monk who, regarding these ten things, rightly experiences disenchantment, rightly experiences the fading away of passion, rightly experiences liberation, rightly sees the ultimate end, having fully understood the true aim, becomes an end-maker of suffering in this very life. What was said as \"Ten questions, ten categories, ten explanations\" was said in reference to this.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් අනාථපිණ්ඩික සිටුතුමාගේ ආරාමයේ වැඩසිටින සේක. ඉක්බිති, බොහෝ භික්ෂූන් වහන්සේලා පෙරවරුවෙහි සිවුරු පොරවා, පාත්‍රය හා සිවුරු ගෙන, සැවැත් නුවරට පිඬු සිඟා පිවිසියහ. ඉක්බිති, ඒ භික්ෂූන් වහන්සේලාට මෙසේ සිතිණි: \"සැවැත් නුවර පිඬු සිඟා යාමට බොහෝ වේලාසන වැඩිය. යම් හෙයකින් අපි අන්‍යතිර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත යන්නෙමු නම් මැනව.\" ඉක්බිති, ඒ භික්ෂූන් වහන්සේලා අන්‍යතිර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත එළඹියහ. එළඹ, ඒ අන්‍යතිර්ථක පරිබ්‍රාජකයන් සමග සතුටු වූහ. සතුටු විය යුතු සිහි කටයුතු කතාබහ කොට එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහුන් ඒ භික්ෂූන් වහන්සේලාට අන්‍යතිර්ථක පරිබ්‍රාජකයෝ මෙසේ කීහ: \"ආයුෂ්මතුන් වහන්ස, ශ්‍රමණ ගෞතමයන් වහන්සේ ශ්‍රාවකයන්ට මෙසේ ධර්මය දේශනා කරති: ‘මහණෙනි, එන්න, නුඹලා සියලු ධර්මයන් සැබෑ ස්වභාවයෙන් දැනගන්න, සියලු ධර්මයන් සැබෑ ස්වභාවයෙන් දැනගෙන වාසය කරන්න’ කියා. ආයුෂ්මතුන් වහන්ස, අපිද ශ්‍රාවකයන්ට මෙසේ ධර්මය දේශනා කරමු: ‘ආයුෂ්මතුන් වහන්ස, එන්න, නුඹලා සියලු ධර්මයන් සැබෑ ස්වභාවයෙන් දැනගන්න, සියලු ධර්මයන් සැබෑ ස්වභාවයෙන් දැනගෙන වාසය කරන්න’ කියා. ආයුෂ්මතුන් වහන්ස, ධර්ම දේශනා කිරීම හෝ අනුශාසනා කිරීම සම්බන්ධයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේට හෝ අපට කිමෙක් නම් වෙනසක්, කිමෙක් නම් අදහසක්, කිමෙක් නම් විභේදයක් ඇද්ද?\" ඉක්බිති, ඒ භික්ෂූන් වහන්සේලා ඒ අන්‍යතිර්ථක පරිබ්‍රාජකයන්ගේ කථාව අනුමෝදන් වූයේද නැත, ප්‍රතික්ෂේප කළේද නැත. අනුමෝදන් නොවීද, ප්‍රතික්ෂේප නොකොටද, ආසනවලින් නැගිට පිටත් වූහ: \"භාග්‍යවතුන් වහන්සේ වෙතින් මේ කථාවේ තේරුම දැනගන්නෙමු\" කියා.\n\nඉක්බිති, ඒ භික්ෂූන් වහන්සේලා සැවැත් නුවර පිඬු සිඟා වළඳා, පිණ්ඩපාතය අවසන් කොට, භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පසෙක වැඩහුන්හ. එකත්පසෙක වැඩහුන් ඒ භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: \"වහන්ස, පෙරවරුවෙහි අපි සිවුරු පොරවා, පාත්‍රය හා සිවුරු ගෙන, සැවැත් නුවරට පිඬු සිඟා පිවිසුණෙමු. වහන්ස, අපට මෙසේ සිතිණි: ‘සැවැත් නුවර පිඬු සිඟා යාමට බොහෝ වේලාසන වැඩිය. යම් හෙයකින් අපි අන්‍යතිර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත යන්නෙමු නම් මැනව’ කියා. වහන්ස, ඉක්බිති අපි අන්‍යතිර්ථක පරිබ්‍රාජකයන්ගේ ආරාමය වෙත එළඹියෙමු. එළඹ, ඒ අන්‍යතිර්ථක පරිබ්‍රාජකයන් සමග සතුටු වීමු. සතුටු විය යුතු සිහි කටයුතු කතාබහ කොට එකත්පසෙක වැඩහුන්නෙමු. වහන්ස, එකත්පසෙක වැඩහුන් අපට අන්‍යතිර්ථක පරිබ්‍රාජකයෝ මෙසේ කීහ: ‘ආයුෂ්මතුන් වහන්ස, ශ්‍රමණ ගෞතමයන් වහන්සේ ශ්‍රාවකයන්ට මෙසේ ධර්මය දේශනා කරති: මහණෙනි, එන්න, නුඹලා සියලු ධර්මයන් සැබෑ ස්වභාවයෙන් දැනගන්න, සියලු ධර්මයන් සැබෑ ස්වභාවයෙන් දැනගෙන වාසය කරන්න කියා. ආයුෂ්මතුන් වහන්ස, අපිද ශ්‍රාවකයන්ට මෙසේ ධර්මය දේශනා කරමු: ආයුෂ්මතුන් වහන්ස, එන්න, නුඹලා සියලු ධර්මයන් සැබෑ ස්වභාවයෙන් දැනගන්න, සියලු ධර්මයන් සැබෑ ස්වභාවයෙන් දැනගෙන වාසය කරන්න කියා. ආයුෂ්මතුන් වහන්ස, ධර්ම දේශනා කිරීම හෝ අනුශාසනා කිරීම සම්බන්ධයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේට හෝ අපට කිමෙක් නම් වෙනසක්, කිමෙක් නම් අදහසක්, කිමෙක් නම් විභේදයක් ඇද්ද?’ කියා. වහන්ස, ඉක්බිති අපි ඒ අන්‍යතිර්ථක පරිබ්‍රාජකයන්ගේ කථාව අනුමෝදන් වූයේද නැත, ප්‍රතික්ෂේප කළේද නැත. අනුමෝදන් නොවීද, ප්‍රතික්ෂේප නොකොටද, ආසනවලින් නැගිට පිටත් වීමු: ‘භාග්‍යවතුන් වහන්සේ වෙතින් මේ කථාවේ තේරුම දැනගන්නෙමු’ කියා.\"\n\n\"මහණෙනි, මෙසේ කියන අන්‍යතිර්ථක පරිබ්‍රාජකයින්ට මෙසේ කිව යුතුයි: ‘ආයුෂ්මතුන් වහන්ස, එක ප්‍රශ්නයක්, එක අදහසක්, එක විස්තරයක් ඇත, ප්‍රශ්න දෙකක්, අදහස් දෙකක්, විස්තර දෙකක් ඇත, ප්‍රශ්න තුනක්, අදහස් තුනක්, විස්තර තුනක් ඇත, ප්‍රශ්න සතරක්, අදහස් සතරක්, විස්තර සතරක් ඇත, ප්‍රශ්න පහක්, අදහස් පහක්, විස්තර පහක් ඇත, ප්‍රශ්න හයක්, අදහස් හයක්, විස්තර හයක් ඇත, ප්‍රශ්න හතක්, අදහස් හතක්, විස්තර හතක් ඇත, ප්‍රශ්න අටක්, අදහස් අටක්, විස්තර අටක් ඇත, ප්‍රශ්න නවයක්, අදහස් නවයක්, විස්තර නවයක් ඇත, ප්‍රශ්න දහයක්, අදහස් දහයක්, විස්තර දහයක් ඇත’ කියා.\" මහණෙනි, මෙසේ විමසූ කල්හි අන්‍යතිර්ථක පරිබ්‍රාජකයෝ (පිළිතුරු දීමට) සමත් නොවන්නාහ. තවද ඔවුන්ට මහත් පීඩාවක්ද සිදුවන්නේය. ඊට හේතුව කුමක්ද? මහණෙනි, ඒ ඔවුන්ගේ විෂය නොවන බැවිනි. මහණෙනි, දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත ලෝකයෙහි, ශ්‍රමණයන් හා බ්‍රාහ්මණයන් සහිත, දෙව් මිනිසුන් සහිත මේ ප්‍රජාව තුළ, මේ ප්‍රශ්නවලට විස්තර දීමෙන් සිත පහදවාගත හැකි කෙනෙකු මම නොදකිමි. තථාගතයන් වහන්සේ හැර හෝ තථාගත ශ්‍රාවකයෙකු හැර හෝ (ඔවුන්ගෙන්) අසා දැනගත් කෙනෙකු හැර. “‘එක ප්‍රශ්නයක්, එක අදහසක්, එක විස්තරයක්’ යැයි මෙසේ යමක් කියන ලද්දේය. එය කවරක් අරබයාද කියන ලද්දේ? මහණෙනි, යම් එකම ධර්මයක යෝගී භික්ෂුව මනාකොට කලකිරීමට පත්වන්නේද, මනාකොට ඇලීමෙන් වෙන්වන්නේද, මනාකොට මිදෙන්නේද, මනාකොට අවසානය දකින්නේද, මනාකොට අර්ථය අවබෝධ කොට මේ භවයේදීම දුක කෙළවර කරන්නේය. ඒ කවර එකම ධර්මයෙහිද?\"\n\n“සියලු සත්වයෝ ආහාරයෙන් පිහිටන සුළුය” යන මේ එක් ධර\\u200d්මයෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. “එක් ප්‍රශ\\u200d්නයක්, එක් මාතෘකාවක්, එක් විවරණයක්” යැයි යමක් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දේ ය.\n\n“ප්‍රශ\\u200d්න දෙකක්, මාතෘකා දෙකක්, විවරණ දෙකක්” යැයි යමක් කියන ලද්දේ ද, එය කුමක් අරභයා කියන ලද්දේ ද? භික්ෂූණි, ධර\\u200d්ම දෙකක් අරභයා යි. මේ ධර\\u200d්ම දෙකෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. කිනම් දෙකක ද? නාමයෙහි ද රූපයෙහි ද යි. භික්ෂූණි, මේ ධර\\u200d්ම දෙකෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. “ප්‍රශ\\u200d්න දෙකක්, මාතෘකා දෙකක්, විවරණ දෙකක්” යැයි යමක් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දේ ය.\n\n“ප්‍රශ\\u200d්න තුනක්, මාතෘකා තුනක්, විවරණ තුනක්” යැයි යමක් කියන ලද්දේ ද, එය කුමක් අරභයා කියන ලද්දේ ද? භික්ෂූණි, ධර\\u200d්ම තුනක් අරභයා යි. මේ ධර\\u200d්ම තුනෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. කිනම් තුනක ද? තෙවැදෑරුම් වේදනා තුනෙහි යි. භික්ෂූණි, මේ ධර\\u200d්ම තුනෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. “ප්‍රශ\\u200d්න තුනක්, මාතෘකා තුනක්, විවරණ තුනක්” යැයි යමක් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දේ ය.\n\n“ප්‍රශ\\u200d්න සතරක්, මාතෘකා සතරක්, විවරණ සතරක්” යැයි යමක් කියන ලද්දේ ද, එය කුමක් අරභයා කියන ලද්දේ ද? භික්ෂූණි, ධර\\u200d්ම සතරක් අරභයා යි. මේ ධර\\u200d්ම සතරෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. කිනම් සතරක ද? සිව්වැදෑරුම් ආහාර සතරෙහි යි. භික්ෂූණි, මේ ධර\\u200d්ම සතරෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. “ප්‍රශ\\u200d්න සතරක්, මාතෘකා සතරක්, විවරණ සතරක්” යැයි යමක් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දේ ය.\n\n“ප්‍රශ\\u200d්න පහක්, මාතෘකා පහක්, විවරණ පහක්” යැයි යමක් කියන ලද්දේ ද, එය කුමක් අරභයා කියන ලද්දේ ද? භික්ෂූණි, ධර\\u200d්ම පහක් අරභයා යි. මේ ධර\\u200d්ම පහෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. කිනම් පහක ද? පංච උපාදානස\\u200d්කන්ධයන්හි යි. භික්ෂූණි, මේ ධර\\u200d්ම පහෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. “ප්‍රශ\\u200d්න පහක්, මාතෘකා පහක්, විවරණ පහක්” යැයි යමක් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දේ ය.\n\n“ප්‍රශ\\u200d්න සයක්, මාතෘකා සයක්, විවරණ සයක්” යැයි යමක් කියන ලද්දේ ද, එය කුමක් අරභයා කියන ලද්දේ ද? භික්ෂූණි, ධර\\u200d්ම සයක් අරභයා යි. මේ ධර\\u200d්ම සයෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. කිනම් සයක ද? ඇතුළත ආයතන සයෙහි යි. භික්ෂූණි, මේ ධර\\u200d්ම සයෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. “ප්‍රශ\\u200d්න සයක්, මාතෘකා සයක්, විවරණ සයක්” යැයි යමක් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දේ ය.\n\n“ප්‍රශ\\u200d්න හතක්, මාතෘකා හතක්, විවරණ හතක්” යැයි යමක් කියන ලද්දේ ද, එය කුමක් අරභයා කියන ලද්දේ ද? භික්ෂූණි, ධර\\u200d්ම හතක් අරභයා යි. මේ ධර\\u200d්ම හතෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. කිනම් හතක ද? සප්ත විඤ\\u200d්ඤාණස\\u200d්ථානයන්හි යි. භික්ෂූණි, මේ ධර\\u200d්ම හතෙහි මැනවින් කලකිරෙමින්, මැනවින් නොඇලෙමින්, මැනවින් නිදහස් වෙමින්, මැනවින් කෙළවර දක්නාසුළු වූ, මැනවින් අර\\u200d්ථය අවබෝධ කරගත් භික්ෂුව මේ ආත\\u200d්මභාවය තුළදීම දුකෙහි කෙළවර කරන්නෙක් වේ. “ප්‍රශ\\u200d්න හතක්, මාතෘකා හතක්, විවරණ හතක්” යැයි යමක් කියන ලද්දේ ද, එය මේ කරුණ අරභයා කියන ලද්දේ ය.\n\n“ප්‍රශ\\u200d්න අටක්, මාතෘකා අටක්, විවරණ අටක්” යැයි යමක් කියන ලද්දේ ද, එය කුමක් අරභයා කියන ලද්දේ ද?\n\nභික්‍ෂූණි, අට ධර්මයන්හි භික්‍ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට මිදෙමින්, මනා කොට කෙළවර දකිමින්, මනා කොට අර්ථය අවබෝධ කරගනිමින් මේ ජීවිතයේදීම දුක කෙළවර කරන්නෙක් වෙයි. කවර අටකද? අට ලෝක ධර්මයන්හි. භික්‍ෂූණි, මේ අට ධර්මයන්හි භික්‍ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට මිදෙමින්, මනා කොට කෙළවර දකිමින්, මනා කොට අර්ථය අවබෝධ කරගනිමින් මේ ජීවිතයේදීම දුක කෙළවර කරන්නෙක් වෙයි. 'අට ගැටලු, අට උපදේශ, අට විසඳුම්' යැයි යමක් කියන ලද්දේද, ඒ මෙය මුල්කොටගෙන කියන ලදී.\n\n'නව ගැටලු, නව උපදේශ, නව විසඳුම්' යැයි යමක් කියන ලද්දේද, ඒ කුමක් මුල්කොටගෙන කියන ලද්දේද? භික්‍ෂූණි, නව ධර්මයන්හි භික්‍ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට මිදෙමින්, මනා කොට කෙළවර දකිමින්, මනා කොට අර්ථය අවබෝධ කරගනිමින් මේ ජීවිතයේදීම දුක කෙළවර කරන්නෙක් වෙයි. කවර නවයකද? නව සත්වාවාසයන්හි. භික්‍ෂූණි, මේ නව ධර්මයන්හි භික්‍ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට මිදෙමින්, මනා කොට කෙළවර දකිමින්, මනා කොට අර්ථය අවබෝධ කරගනිමින් මේ ජීවිතයේදීම දුක කෙළවර කරන්නෙක් වෙයි. 'නව ගැටලු, නව උපදේශ, නව විසඳුම්' යැයි යමක් කියන ලද්දේද, ඒ මෙය මුල්කොටගෙන කියන ලදී.\n\n'දස ගැටලු, දස උපදේශ, දස විසඳුම්' යැයි යමක් කියන ලද්දේද, ඒ කුමක් මුල්කොටගෙන කියන ලද්දේද? භික්‍ෂූණි, දස ධර්මයන්හි භික්‍ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට මිදෙමින්, මනා කොට කෙළවර දකිමින්, මනා කොට අර්ථය අවබෝධ කරගනිමින් මේ ජීවිතයේදීම දුක කෙළවර කරන්නෙක් වෙයි. කවර දසයකද? දස අකුසල කර්මපථයන්හි. භික්‍ෂූණි, මේ දස ධර්මයන්හි භික්‍ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට මිදෙමින්, මනා කොට කෙළවර දකිමින්, මනා කොට අර්ථය අවබෝධ කරගනිමින් මේ ජීවිතයේදීම දුක කෙළවර කරන්නෙක් වෙයි. 'දස ගැටලු, දස උපදේශ, දස විසඳුම්' යැයි යමක් කියන ලද්දේද, ඒ මෙය මුල්කොටගෙන කියන ලදී.",
      "paliTitle": "Paṭhamamahāpañhāsuttaṃ",
      "englishTitle": "First Great Questions Sutta",
      "sinhalaTitle": "ප්‍රථම මහා ප්‍රශ්න සූත්‍රය"
    },
    {
      "number": 28,
      "pali": "Ekaṃ samayaṃ bhagavā kajaṅgalāyaṃ viharati veḷuvane. Atha kho sambahulā kajaṅgalakā upāsakā yena kajaṅgalikā bhikkhunī tenupasaṅkamiṃsu; upasaṅkamitvā kajaṅgalikaṃ bhikkhuniṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho kajaṅgalakā upāsakā kajaṅgalikaṃ bhikkhuniṃ etadavocuṃ – ‘‘Vuttamidaṃ, ayye, bhagavatā mahāpañhesu – ‘eko pañho eko uddeso ekaṃ veyyākaraṇaṃ, dve pañhā dve uddesā dve veyyākaraṇāni, tayo pañhā tayo uddesā tīṇi veyyākaraṇāni, cattāro pañhā cattāro uddesā cattāri veyyākaraṇāni, pañca pañhā pañcuddesā pañca veyyākaraṇāni, cha pañhā cha uddesā cha veyyākaraṇāni, satta pañhā sattuddesā satta veyyākaraṇāni, aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇāni, nava pañhā navuddesā nava veyyākaraṇāni, dasa pañhā dasuddesā dasa veyyākaraṇānī’ti. Imassa nu kho, ayye, bhagavatā saṃkhittena bhāsitassa kathaṃ vitthārena attho daṭṭhabbo’’ti? ‘‘Na kho panetaṃ, āvuso, bhagavato sammukhā sutaṃ sammukhā paṭiggahitaṃ, napi manobhāvanīyānaṃ bhikkhūnaṃ sammukhā sutaṃ sammukhā paṭiggahitaṃ; api ca, yathā mettha khāyati taṃ suṇātha, sādhukaṃ manasi karotha, bhāsissāmī’’ti. ‘‘Evaṃ, ayye’’ti, kho kajaṅgalakā upāsakā kajaṅgalikāya bhikkhuniyā paccassosuṃ. Kajaṅgalikā bhikkhunī etadavoca – ‘‘‘Eko pañho eko uddeso ekaṃ veyyākaraṇa’nti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Ekadhamme, āvuso, bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamasmiṃ ekadhamme? Sabbe sattā āhāraṭṭhitikā – imasmiṃ kho, āvuso, ekadhamme bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Eko pañho eko uddeso ekaṃ veyyākaraṇanti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ. ‘‘‘Dve pañhā dve uddesā dve veyyākaraṇānī’ti iti, kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Dvīsu, āvuso, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dvīsu? Nāme ca rūpe ca…pe… katamesu tīsu? Tīsu vedanāsu – imesu kho, āvuso, tīsu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Tayo pañhā tayo uddesā tīṇi veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ. ‘‘‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Catūsu, āvuso, dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu catūsu? Catūsu satipaṭṭhānesu – imesu kho, āvuso, catūsu dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Cattāro pañhā cattāro uddesā cattāri veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ. ‘‘‘Pañca pañhā pañcuddesā pañca veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Pañcasu, āvuso, dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu pañcasu? Pañcasu indriyesu…pe… katamesu chasu? Chasu nissaraṇīyāsu dhātūsu…pe… katamesu sattasu? Sattasu bojjhaṅgesu…pe… katamesu aṭṭhasu? Aṭṭhasu ariyaaṭṭhaṅgikamaggesu – imesu kho, āvuso, aṭṭhasu dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Aṭṭha pañhā aṭṭhuddesā aṭṭha veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ. ‘‘‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Navasu, āvuso, dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu navasu? Navasu sattāvāsesu – imesu kho, āvuso, navasu dhammesu bhikkhu sammā nibbindamāno sammā virajjamāno sammā vimuccamāno sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Nava pañhā navuddesā nava veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ. ‘‘‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti kho panetaṃ vuttaṃ bhagavatā. Kiñcetaṃ paṭicca vuttaṃ? Dasasu, āvuso, dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. Katamesu dasasu? Dasasu kusalesu kammapathesu – imesu kho, āvuso, dasasu dhammesu bhikkhu sammā subhāvitacitto sammā pariyantadassāvī sammadatthaṃ abhisamecca diṭṭheva dhamme dukkhassantakaro hoti. ‘Dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, iti yaṃ taṃ vuttaṃ bhagavatā idametaṃ paṭicca vuttaṃ. ‘‘Iti kho, āvuso, yaṃ taṃ vuttaṃ bhagavatā saṃkhittena bhāsitāsu mahāpañhāsu – ‘eko pañho eko uddeso ekaṃ veyyākaraṇaṃ…pe… dasa pañhā dasuddesā dasa veyyākaraṇānī’ti, imassa kho ahaṃ, āvuso, bhagavatā saṃkhittena bhāsitassa evaṃ vitthārena atthaṃ ājānāmi. Ākaṅkhamānā ca pana tumhe, āvuso, bhagavantaññeva upasaṅkamitvā etamatthaṃ paṭipuccheyyātha. Yathā vo [yathā kho (ka.), yathā no (bahūsu) a. ni. 10.115, 172 pana pāṭhabhedo natthi] bhagavā byākaroti tathā naṃ dhāreyyāthā’’ti. ‘‘Evaṃ, ayye’’ti kho kajaṅgalakā upāsakā kajaṅgalikāya kho bhikkhuniyā bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā kajaṅgalikaṃ bhikkhuniṃ abhivādetvā padakkhiṇaṃ katvā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinnā kho kajaṅgalakā upāsakā yāvatako ahosi kajaṅgalikāya bhikkhuniyā saddhiṃ kathāsallāpo, taṃ sabbaṃ bhagavato ārocesuṃ. ‘‘Sādhu sādhu, gahapatayo! Paṇḍitā, gahapatayo, kajaṅgalikā bhikkhunī. Mahāpaññā, gahapatayo, kajaṅgalikā bhikkhunī. Mañcepi tumhe, gahapatayo, upasaṅkamitvā etamatthaṃ paṭipuccheyyātha, ahampi cetaṃ evamevaṃ [evameva (ka.) ma. ni. 1.205 passitabbaṃ] byākareyyaṃ yathā taṃ kajaṅgalikāya bhikkhuniyā byākataṃ. Eso ceva tassa [eso cevetassa (ma. ni. 1.205)] attho. Evañca naṃ dhāreyyāthā’’ti. Aṭṭhamaṃ.",
      "english": "At one time the Blessed One was dwelling in Kajaṅgalā, in the Bamboo Grove. Then a number of lay followers from Kajaṅgalā approached the bhikkhunī Kajaṅgalikā. Having approached and paid homage to the bhikkhunī Kajaṅgalikā, they sat down to one side. Seated to one side, the lay followers from Kajaṅgalā said to the bhikkhunī Kajaṅgalikā: \"Venerable sister, the Blessed One has spoken in the Great Discourses concerning the nature of questions thus: ‘One question, one theme, one answer; two questions, two themes, two answers; three questions, three themes, three answers; four questions, four themes, four answers; five questions, five themes, five answers; six questions, six themes, six answers; seven questions, seven themes, seven answers; eight questions, eight themes, eight answers; nine questions, nine themes, nine answers; ten questions, ten themes, ten answers.’ How, Venerable sister, should the detailed meaning of this concise statement by the Blessed One be understood?\" \"Friends, I have not heard this directly from the Blessed One, nor have I received it directly from those bhikkhus who are esteemed by the mind. Nevertheless, I will speak as it appears to me; listen and pay close attention.\" \"Yes, Venerable sister,\" replied the lay followers from Kajaṅgalā to the bhikkhunī Kajaṅgalikā. The bhikkhunī Kajaṅgalikā then spoke:\n\n\"‘One question, one theme, one answer’ – this was spoken by the Blessed One. With reference to what was this said? Friends, it is with reference to one phenomenon that a bhikkhu, rightly experiencing disenchantment, rightly becoming dispassionate, rightly liberated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which one phenomenon? All beings subsist by nutriment. It is with reference to this one phenomenon, friends, that a bhikkhu, rightly experiencing disenchantment, rightly becoming dispassionate, rightly liberated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. What was said by the Blessed One as ‘One question, one theme, one answer’ was said with reference to this.\n\n\"‘Two questions, two themes, two answers’ – this was spoken by the Blessed One. With reference to what was this said? Friends, it is with reference to two phenomena that a bhikkhu, rightly experiencing disenchantment, rightly becoming dispassionate, rightly liberated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which two? Name-and-form. It is with reference to these two phenomena, friends, that a bhikkhu, rightly experiencing disenchantment, rightly becoming dispassionate, rightly liberated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which three? The three feelings. It is with reference to these three phenomena, friends, that a bhikkhu, rightly experiencing disenchantment, rightly becoming dispassionate, rightly liberated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. What was said by the Blessed One as ‘Three questions, three themes, three answers’ was said with reference to this.\n\n\"‘Four questions, four themes, four answers’ – this was spoken by the Blessed One. With reference to what was this said? Friends, it is with reference to four phenomena that a bhikkhu, whose mind is rightly cultivated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which four? The four establishments of mindfulness. It is with reference to these four phenomena, friends, that a bhikkhu, whose mind is rightly cultivated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. What was said by the Blessed One as ‘Four questions, four themes, four answers’ was said with reference to this.\n\n\"‘Five questions, five themes, five answers’ – this was spoken by the Blessed One. With reference to what was this said? Friends, it is with reference to five phenomena that a bhikkhu, whose mind is rightly cultivated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which five? The five spiritual faculties. It is with reference to these five phenomena, friends, that a bhikkhu, whose mind is rightly cultivated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which six? The six elements conducive to escape. It is with reference to these six phenomena, friends, that a bhikkhu, whose mind is rightly cultivated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which seven? The seven factors of awakening. It is with reference to these seven phenomena, friends, that a bhikkhu, whose mind is rightly cultivated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which eight? The noble eightfold path. It is with reference to these eight phenomena, friends, that a bhikkhu, whose mind is rightly cultivated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. What was said by the Blessed One as ‘Eight questions, eight themes, eight answers’ was said with reference to this.\n\n\"‘Nine questions, nine themes, nine answers’ – this was spoken by the Blessed One. With reference to what was this said? Friends, it is with reference to nine phenomena that a bhikkhu, rightly experiencing disenchantment, rightly becoming dispassionate, rightly liberated, rightly seeing the end, and having fully comprehended the goal, becomes one who puts an end to suffering in this very life. With reference to which nine?\n\nAmong these nine abodes of sentient beings, friends, a monk, rightly experiencing disenchantment, rightly becoming dispassionate, rightly becoming liberated, rightly seeing the ultimate end, and having rightly comprehended the ultimate goal, becomes one who puts an end to suffering in this very life. That which was stated by the Blessed One, ‘Nine questions, nine propositions, nine explanations,’ was said in reference to this.\n\n‘Ten questions, ten propositions, ten explanations’ – this too, indeed, was said by the Blessed One. In reference to what was this said? Among ten principles, friends, a monk, with a mind rightly cultivated, rightly seeing the ultimate end, and having rightly comprehended the ultimate goal, becomes one who puts an end to suffering in this very life. Among which ten? Among the ten wholesome courses of action, friends, it is among these ten principles that a monk, with a mind rightly cultivated, rightly seeing the ultimate end, and having rightly comprehended the ultimate goal, becomes one who puts an end to suffering in this very life. ‘Ten questions, ten propositions, ten explanations’ – that which was stated by the Blessed One, was said in reference to this.\n\nThus, friends, I understand the meaning of what was stated so briefly by the Blessed One concerning the great questions – ‘One question, one proposition, one explanation… and so on… ten questions, ten propositions, ten explanations’ – I understand this, friends, in this detailed manner. And if you wish, friends, you may approach the Blessed One himself and inquire about this matter. As the Blessed One explains it to you, so should you remember it.\n\n‘So be it, Venerable Lady,’ said the lay followers from Kajangala. Having rejoiced in and approved of what the bhikkhuni Kajangalikā had said, they rose from their seats, paid homage to the bhikkhuni Kajangalikā, and circumambulated her respectfully. Then they approached the Blessed One. Having approached, they paid homage to the Blessed One and sat down to one side. Seated to one side, the lay followers from Kajangala reported everything that had transpired in their conversation with the bhikkhuni Kajangalikā to the Blessed One.\n\n‘Excellent, excellent, householders! The bhikkhuni Kajangalikā, householders, is wise. The bhikkhuni Kajangalikā, householders, possesses great wisdom. Even if you, householders, had approached me to inquire about this matter, I would have explained it to you in exactly the same way as it was explained by the bhikkhuni Kajangalikā. That is indeed its meaning. And so you should remember it.’",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කජංගලා ජනපදයෙහි වේළුවනාරාමයෙහි වැඩවසන සේක. ඉක්බිති බොහෝ කජංගලාවාසී උපාසකයෝ කජංගලිකා භික්ෂුණිය වෙත පැමිණියහ; පැමිණ, කජංගලිකා භික්ෂුණියට වැඳ, එකත්පසෙක හිඳ ගත්හ. එකත්පසෙක හිඳගත් ඒ කජංගලා උපාසකයෝ කජංගලිකා භික්ෂුණියට මෙසේ කීහ: \"ආර්යාවෙනි, භාග්‍යවතුන් වහන්සේ විසින් මහාප්‍රශ්න සූත්‍රයෙහි මෙසේ වදාරන ලද්දකි: 'එක් ප්‍රශ්නයක්, එක් විස්තරයක්, එක් විවරණයක්; ප්‍රශ්න දෙකක්, විස්තර දෙකක්, විවරණ දෙකක්; ප්‍රශ්න තුනක්, විස්තර තුනක්, විවරණ තුනක්; ප්‍රශ්න සතරක්, විස්තර සතරක්, විවරණ සතරක්; ප්‍රශ්න පහක්, විස්තර පහක්, විවරණ පහක්; ප්‍රශ්න හයක්, විස්තර හයක්, විවරණ හයක්; ප්‍රශ්න හතක්, විස්තර හතක්, විවරණ හතක්; ප්‍රශ්න අටක්, විස්තර අටක්, විවරණ අටක්; ප්‍රශ්න නවයක්, විස්තර නවයක්, විවරණ නවයක්; ප්‍රශ්න දහයක්, විස්තර දහයක්, විවරණ දහයක්' යනුවෙනි. ආර්යාවෙනි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් වදාරන ලද මේ ධර්මයේ විස්තරාර්ථය කෙසේ දත යුතු ද?\" \"ඇවැත්නි, මෙය භාග්‍යවතුන් වහන්සේගේ සමීපයෙන් මා විසින් අසන ලද්දක් හෝ පිළිගන්නා ලද්දක් නොවේ. එසේම, භාවනා කරන ලද සිත් ඇති භික්ෂූන් වහන්සේලාගේ සමීපයෙන් මා විසින් අසන ලද්දක් හෝ පිළිගන්නා ලද්දක් ද නොවේ. එහෙත්, මට යම් සේ වැටහෙයි ද එය ඔබලා ශ්‍රවණය කරන්න. මනා කොට මෙනෙහි කරන්න. මම එය කියන්නෙමි\"යි කීවාය. \"එසේය, ආර්යාවෙනි\"යි කජංගලා උපාසකයෝ කජංගලිකා භික්ෂුණියට පිළිතුරු දුන්හ.\n\nකජංගලිකා භික්ෂුණිය මෙසේ කීවාය: \"'එක් ප්‍රශ්නයක්, එක් විස්තරයක්, එක් විවරණයක්' යනු භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දකි. මෙය කුමක් අරභයා වදාළා ද? ඇවැත්නි, එකම ධර්මයක් සම්බන්ධයෙන් භික්ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට නිදහස් වෙමින්, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. ඒ කුමන එකම ධර්මය සම්බන්ධයෙන් ද? ඇවැත්නි, 'සියලු සත්වයෝ ආහාරය මත පිහිටා සිටිති' යන මේ එකම ධර්මය සම්බන්ධයෙන් භික්ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට නිදහස් වෙමින්, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. 'එක් ප්‍රශ්නයක්, එක් විස්තරයක්, එක් විවරණයක්' යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ මේ ධර්මය අරභයාය.\n\n\"'ප්‍රශ්න දෙකක්, විස්තර දෙකක්, විවරණ දෙකක්' යනු භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දකි. මෙය කුමක් අරභයා වදාළා ද? ඇවැත්නි, ධර්ම දෙකක් සම්බන්ධයෙන් භික්ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට නිදහස් වෙමින්, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. ඒ කුමන දෙක සම්බන්ධයෙන් ද? නාමය සහ රූපය සම්බන්ධයෙන්ය... (ආදී වශයෙන්) ඒ කුමන තුන සම්බන්ධයෙන් ද? වේදනා තුන සම්බන්ධයෙන්ය. ඇවැත්නි, මේ ධර්ම තුන සම්බන්ධයෙන් භික්ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට නිදහස් වෙමින්, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. 'ප්‍රශ්න තුනක්, විස්තර තුනක්, විවරණ තුනක්' යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ මේ ධර්මය අරභයාය.\n\n\"'ප්‍රශ්න සතරක්, විස්තර සතරක්, විවරණ සතරක්' යනු භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දකි. මෙය කුමක් අරභයා වදාළා ද? ඇවැත්නි, ධර්ම සතරක් සම්බන්ධයෙන් භික්ෂුව මනා කොට වඩන ලද සිත් ඇත්තෙක් ව, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. ඒ කුමන සතර සම්බන්ධයෙන් ද? සිහිනුවණ පිහිටුවන ස්ථාන සතර සම්බන්ධයෙන්ය. ඇවැත්නි, මේ ධර්ම සතර සම්බන්ධයෙන් භික්ෂුව මනා කොට වඩන ලද සිත් ඇත්තෙක් ව, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. 'ප්‍රශ්න සතරක්, විස්තර සතරක්, විවරණ සතරක්' යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ මේ ධර්මය අරභයාය.\n\n\"'ප්‍රශ්න පහක්, විස්තර පහක්, විවරණ පහක්' යනු භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දකි. මෙය කුමක් අරභයා වදාළා ද? ඇවැත්නි, ධර්ම පහක් සම්බන්ධයෙන් භික්ෂුව මනා කොට වඩන ලද සිත් ඇත්තෙක් ව, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. ඒ කුමන පහ සම්බන්ධයෙන් ද? පඤ්ච ඉන්ද්‍රියන් සම්බන්ධයෙන්ය... (ආදී වශයෙන්) ඒ කුමන හය සම්බන්ධයෙන් ද? නික්මීමට හේතු වන ධාතු හය සම්බන්ධයෙන්ය... (ආදී වශයෙන්) ඒ කුමන හත සම්බන්ධයෙන් ද? සප්ත බෝධ්‍යංගයන් සම්බන්ධයෙන්ය... (ආදී වශයෙන්) ඒ කුමන අට සම්බන්ධයෙන් ද? අෂ්ටාර්ය මාර්ගය සම්බන්ධයෙන්ය. ඇවැත්නි, මේ ධර්ම අට සම්බන්ධයෙන් භික්ෂුව මනා කොට වඩන ලද සිත් ඇත්තෙක් ව, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. 'ප්‍රශ්න අටක්, විස්තර අටක්, විවරණ අටක්' යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේ මේ ධර්මය අරභයාය.\n\n\"'ප්‍රශ්න නවයක්, විස්තර නවයක්, විවරණ නවයක්' යනු භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දකි. මෙය කුමක් අරභයා වදාළා ද? ඇවැත්නි, ධර්ම නවයක් සම්බන්ධයෙන් භික්ෂුව මනා කොට කලකිරෙමින්, මනා කොට නොඇලෙමින්, මනා කොට නිදහස් වෙමින්, මනා කොට කෙළවර දක්නාසුලු ව, මනා වූ අර්ථය අවබෝධ කරගෙන, මේ දැමුණ ධර්මය තුළම දුක කෙළවර කරන්නෙක් වේ. ඒ කුමන නවය සම්බන්ධයෙන් ද?\n\nඇවැත්නි, මේ නව සත්තාවාසයන්හි පිහිටි මේ නව ධර්මයන්හිදී භික්ෂුව මනාකොට කලකිරෙමින්, මනාකොට නොඇලෙමින්, මනාකොට නිදහස් වෙමින්, මනාකොට අවසානය දකින්නේ වෙමින්, මනාකොට අර්ථය අවබෝධ කරගෙන මේ ආත්මභාවයේදීම දුක කෙළවර කරන්නේ වේ. ‘නව ප්‍ර‍ශ්න, නව උද්දේස, නව ව්‍යාකරණ’ යි යමක් භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලද්දේද, ඒ මේ කරුණ නිමිතිකොට වදාරණ ලදී.\n\n‘දස ප්‍ර‍ශ්න, දස උද්දේස, දස ව්‍යාකරණ’ යි මේ ද භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලදී. ඒ කුමක් නිමිතිකොට වදාරණ ලද්දේද? ඇවැත්නි, දස ධර්මයන්හිදී භික්ෂුව මනාකොට භාවනා කරන ලද සිත් ඇත්තෙක් වෙමින්, මනාකොට අවසානය දකින්නේ වෙමින්, මනාකොට අර්ථය අවබෝධ කරගෙන මේ ආත්මභාවයේදීම දුක කෙළවර කරන්නේ වේ. ඒ දසය කුමක්ද? දස කුශල කර්මපථයන්හිදී යි. ඇවැත්නි, මේ දස ධර්මයන්හිදී භික්ෂුව මනාකොට භාවනා කරන ලද සිත් ඇත්තෙක් වෙමින්, මනාකොට අවසානය දකින්නේ වෙමින්, මනාකොට අර්ථය අවබෝධ කරගෙන මේ ආත්මභාවයේදීම දුක කෙළවර කරන්නේ වේ. ‘දස ප්‍ර‍ශ්න, දස උද්දේස, දස ව්‍යාකරණ’ යි යමක් භාග්‍යවතුන් වහන්සේ විසින් වදාරණ ලද්දේද, ඒ මේ කරුණ නිමිතිකොට වදාරණ ලදී.\n\nඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ මහා ප්‍ර‍ශ්න පිළිබඳව – ‘එක් ප්‍ර‍ශ්නයක්, එක් උද්දේසයක්, එක් ව්‍යාකරණයක්... ආදී වශයෙන්... දස ප්‍ර‍ශ්න, දස උද්දේස, දස ව්‍යාකරණ’ යි යනුවෙන්, ඇවැත්නි, භාග්‍යවතුන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ ධර්මයේ අර්ථය මම මෙසේ විස්තර වශයෙන් දනිමි. ඇවැත්නි, ඔබලා කැමැති නම් භාග්‍යවතුන් වහන්සේ වෙතම එළඹ මේ අර්ථය විමසන්න. භාග්‍යවතුන් වහන්සේ ඔබට යම් සේ විස්තර කරන්නේද, එසේ එය සිතෙහි ධාරණය කරගන්නැයි කීවාය.\n\nඇවැත්නි, එසේයැයි කජංගලක උපාසකයෝ කජංගලිකා භික්ෂුණිය විසින් දේශනා කරන ලද ධර්මය අභිනන්දනය කොට අනුමෝදන්ව, ආසනයෙන් නැගිට, කජංගලිකා භික්ෂුණියට වැඳ, ප්‍ර‍දක්ෂිණා කර, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියෝය; එළඹ, භාග්‍යවතුන් වහන්සේට වැඳ, එකත්පසෙක වාඩිවූවෝය. එකත්පසෙක වාඩිවූ කජංගලක උපාසකයෝ කජංගලිකා භික්ෂුණිය සමග යම්තාක් කථාවක් වීද, ඒ සියල්ල භාග්‍යවතුන් වහන්සේට දැන්වූවෝය.\n\n‘සාධු! සාධු! ගෘහපතියෙනි! ගෘහපතියෙනි, කජංගලිකා භික්ෂුණිය පණ්ඩිතය. ගෘහපතියෙනි, කජංගලිකා භික්ෂුණිය මහා ප්‍ර‍ඥාවන්තය. ගෘහපතියෙනි, ඔබලා මා වෙත එළඹ මේ අර්ථය විමසන්නට වුවද, කජංගලිකා භික්ෂුණිය විසින් යම් සේ විස්තර කරන ලද්දේද, මා ද ඒ ධර්මය එලෙසින්ම විස්තර කරන්නේය. ඒකාන්තයෙන්ම ඒ අර්ථය මෙයයි. තවද, ඔබලා එය මෙසේ ධාරණය කරගන්නැයි වදාළ සේක.\n\nඅටවෙනි සූත්‍රයයි.",
      "paliTitle": "Dutiyamahāpañhāsuttaṃ",
      "englishTitle": "The Second Great Question Discourse",
      "sinhalaTitle": "දෙවන මහා ප‍්‍රශ‍්න සූත‍්‍රය"
    },
    {
      "number": 29,
      "pali": "‘‘Yāvatā, bhikkhave, kāsikosalā, yāvatā rañño pasenadissa kosalassa vijitaṃ [vijite (sī. ka.)], rājā tattha pasenadi kosalo aggamakkhāyati. Raññopi kho, bhikkhave, pasenadissa kosalassa attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. ‘‘Yāvatā, bhikkhave, candimasūriyā pariharanti disā bhanti virocamānā, tāva sahassadhā loko. Tasmiṃ sahassadhā loke sahassaṃ candānaṃ sahassaṃ sūriyānaṃ [suriyānaṃ (sī. syā. kaṃ. pī.)] sahassaṃ sinerupabbatarājānaṃ sahassaṃ jambudīpānaṃ sahassaṃ aparagoyānānaṃ sahassaṃ uttarakurūnaṃ sahassaṃ pubbavidehānaṃ cattāri mahāsamuddasahassāni cattāri mahārājasahassāni sahassaṃ cātumahārājikānaṃ sahassaṃ tāvatiṃsānaṃ sahassaṃ yāmānaṃ sahassaṃ tusitānaṃ sahassaṃ nimmānaratīnaṃ sahassaṃ paranimmitavasavattīnaṃ sahassaṃ brahmalokānaṃ. Yāvatā, bhikkhave, sahassī lokadhātu, mahābrahmā tattha aggamakkhāyati. Mahābrahmunopi kho, bhikkhave, attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. ‘‘Hoti so, bhikkhave, samayo yaṃ ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne, bhikkhave, loke yebhuyyena sattā ābhassarasaṃvattanikā [ābhassaravattanikā (sī. syā.)] bhavanti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhecarā subhaṭṭhāyino ciraṃ dīghamaddhānaṃ tiṭṭhanti. Saṃvaṭṭamāne, bhikkhave, loke ābhassarā devā aggamakkhāyanti. Ābhassarānampi kho, bhikkhave, devānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. [a. ni. 10.25] ‘‘Dasayimāni, bhikkhave, kasiṇāyatanāni. Katamāni dasa? Pathavīkasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ; āpokasiṇameko sañjānāti…pe… tejokasiṇameko sañjānāti… vāyokasiṇameko sañjānāti… nīlakasiṇameko sañjānāti… pītakasiṇameko sañjānāti… lohitakasiṇameko sañjānāti… odātakasiṇameko sañjānāti… ākāsakasiṇameko sañjānāti… viññāṇakasiṇameko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Imāni kho, bhikkhave, dasa kasiṇāyatanāni. ‘‘Etadaggaṃ, bhikkhave, imesaṃ dasannaṃ kasiṇāyatanānaṃ yadidaṃ viññāṇakasiṇaṃ eko sañjānāti uddhaṃ adho tiriyaṃ advayaṃ appamāṇaṃ. Evaṃsaññinopi kho, bhikkhave, santi sattā. Evaṃsaññīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. [dī. ni. 3.338, 358; a. ni. 8.64] ‘‘Aṭṭhimāni, bhikkhave, abhibhāyatanāni. Katamāni aṭṭha? Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ paṭhamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ rūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ dutiyaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati parittāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ tatiyaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati appamāṇāni suvaṇṇadubbaṇṇāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ catutthaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni. Seyyathāpi nāma umāpupphaṃ nīlaṃ nīlavaṇṇaṃ nīlanidassanaṃ nīlanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ nīlaṃ nīlavaṇṇaṃ nīlanidassanaṃ nīlanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati nīlāni nīlavaṇṇāni nīlanidassanāni nīlanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ pañcamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni. Seyyathāpi nāma kaṇikārapupphaṃ pītaṃ pītavaṇṇaṃ pītanidassanaṃ pītanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ pītaṃ pītavaṇṇaṃ pītanidassanaṃ pītanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati pītāni pītavaṇṇāni pītanidassanāni pītanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ chaṭṭhaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni. Seyyathāpi nāma bandhujīvakapupphaṃ lohitakaṃ lohitakavaṇṇaṃ lohitakanidassanaṃ lohitakanibhāsaṃ, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ lohitakaṃ lohitakavaṇṇaṃ lohitakanidassanaṃ lohitakanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati lohitakāni lohitakavaṇṇāni lohitakanidassanāni lohitakanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ sattamaṃ abhibhāyatanaṃ. ‘‘Ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni. Seyyathāpi nāma osadhitārakā odātā odātavaṇṇā odātanidassanā odātanibhāsā, seyyathā vā pana taṃ vatthaṃ bārāṇaseyyakaṃ ubhatobhāgavimaṭṭhaṃ odātaṃ odātavaṇṇaṃ odātanidassanaṃ odātanibhāsaṃ; evamevaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Idaṃ aṭṭhamaṃ abhibhāyatanaṃ. Imāni kho, bhikkhave, aṭṭha abhibhāyatanāni. ‘‘Etadaggaṃ, bhikkhave, imesaṃ aṭṭhannaṃ abhibhāyatanānaṃ yadidaṃ ajjhattaṃ arūpasaññī eko bahiddhā rūpāni passati odātāni odātavaṇṇāni odātanidassanāni odātanibhāsāni; ‘tāni abhibhuyya jānāmi passāmī’ti, evaṃsaññī hoti. Evaṃsaññinopi kho, bhikkhave, santi sattā. Evaṃsaññīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. ‘‘Catasso imā, bhikkhave, paṭipadā. Katamā catasso? Dukkhā paṭipadā dandhābhiññā, dukkhā paṭipadā khippābhiññā, sukhā paṭipadā dandhābhiññā, sukhā paṭipadā khippābhiññā – imā kho, bhikkhave, catasso paṭipadā. ‘‘Etadaggaṃ, bhikkhave, imāsaṃ catunnaṃ paṭipadānaṃ yadidaṃ sukhā paṭipadā khippābhiññā. Evaṃpaṭipannāpi kho, bhikkhave, santi sattā. Evaṃpaṭipannānampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. ‘‘Catasso imā, bhikkhave, saññā. Katamā catasso? Parittameko sañjānāti, mahaggatameko sañjānāti, appamāṇameko sañjānāti, ‘natthi kiñcī’ti ākiñcaññāyatanameko sañjānāti – imā kho, bhikkhave, catasso saññā. ‘‘Etadaggaṃ, bhikkhave, imāsaṃ catunnaṃ saññānaṃ yadidaṃ ‘natthi kiñcī’ti ākiñcaññāyatanameko sañjānāti. Evaṃsaññinopi kho, bhikkhave, santi sattā. Evaṃsaññīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. ‘‘Etadaggaṃ, bhikkhave, bāhirakānaṃ diṭṭhigatānaṃ yadidaṃ ‘no cassaṃ, no ca me siyā, na bhavissāmi, na me bhavissatī’ti. Evaṃdiṭṭhino, bhikkhave, etaṃ pāṭikaṅkhaṃ – ‘yā cāyaṃ bhave appaṭikulyatā, sā cassa na bhavissati; yā cāyaṃ bhavanirodhe pāṭikulyatā, sā cassa na bhavissatī’ti. Evaṃdiṭṭhinopi kho, bhikkhave, santi sattā. Evaṃdiṭṭhīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā paramatthavisuddhiṃ paññāpenti. Etadaggaṃ, bhikkhave, paramatthavisuddhiṃ paññāpentānaṃ yadidaṃ sabbaso ākiñcaññāyatanaṃ samatikkamma nevasaññānāsaññāyatanaṃ upasampajja viharati. Te tadabhiññāya tassa sacchikiriyāya dhammaṃ desenti. Evaṃvādinopi kho, bhikkhave, santi sattā. Evaṃvādīnampi kho, bhikkhave, sattānaṃ attheva aññathattaṃ atthi vipariṇāmo. Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako tasmimpi nibbindati. Tasmiṃ nibbindanto agge virajjati, pageva hīnasmiṃ. ‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā paramadiṭṭhadhammanibbānaṃ paññāpenti. Etadaggaṃ, bhikkhave, paramadiṭṭhadhammanibbānaṃ paññāpentānaṃ yadidaṃ channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādā vimokkho. Evaṃvādiṃ kho maṃ, bhikkhave, evamakkhāyiṃ eke samaṇabrāhmaṇā asatā tucchā musā abhūtena abbhācikkhanti – ‘samaṇo gotamo na kāmānaṃ pariññaṃ paññāpeti, na rūpānaṃ pariññaṃ paññāpeti, na vedanānaṃ pariññaṃ paññāpetī’ti. Kāmānañcāhaṃ, bhikkhave, pariññaṃ paññāpemi, rūpānañca pariññaṃ paññāpemi, vedanānañca pariññaṃ paññāpemi, diṭṭheva dhamme nicchāto nibbuto sītibhūto anupādā parinibbānaṃ paññāpemī’’ti. Navamaṃ.",
      "english": "Monks, as far as Kasi and Kosala extend, as far as the domain of King Pasenadi of Kosala reaches, King Pasenadi of Kosala is proclaimed as the foremost ruler there. Yet, Monks, even for King Pasenadi of Kosala, there is alteration, there is transformation. Seeing this thus, Monks, the well-instructed noble disciple becomes disenchanted even with that. Being disenchanted with that, he becomes dispassionate towards what is foremost, how much more so towards what is inferior.\n\nMonks, as far as the moon and sun revolve and the directions shine forth, gleaming, so far extends the thousandfold world-system. Within that thousandfold world-system, there are a thousand moons, a thousand suns, a thousand supreme mountains, a thousand Jambudīpa continents, a thousand Aparagoyāna continents, a thousand Uttarakuru continents, a thousand Pubbavideha continents, four thousand great oceans, four thousand Great Kings, a thousand worlds of the Four Great Kings, a thousand Tāvatiṃsa worlds, a thousand Yāma worlds, a thousand Tusita worlds, a thousand Nimmanarati worlds, a thousand Paranimmitavasavatti worlds, and a thousand Brahma worlds. Monks, as far as the thousandfold world-system extends, the Great Brahmā is proclaimed as the foremost there. Yet, Monks, even for the Great Brahmā, there is alteration, there is transformation. Seeing this thus, Monks, the well-instructed noble disciple becomes disenchanted even with that. Being disenchanted with that, he becomes dispassionate towards what is foremost, how much more so towards what is inferior.\n\nMonks, there comes a time when this world contracts and dissolves. When the world is contracting, Monks, for the most part, beings become reborn into the Abhassara realm. There they are: mind-made, feeding on rapture, self-radiant, moving through space, abiding in beauty, and they remain for a long, long time. When the world is contracting, Monks, the Abhassara devas are proclaimed as the foremost. Yet, Monks, even for the Abhassara devas, there is alteration, there is transformation. Seeing this thus, Monks, the well-instructed noble disciple becomes disenchanted even with that. Being disenchanted with that, he becomes dispassionate towards what is foremost, how much more so towards what is inferior.\n\nMonks, there are these ten kasiṇa bases. Which ten? One perceives the earth kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the water kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the fire kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the wind kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the blue kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the yellow kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the red kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the white kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the space kasiṇa as upwards, downwards, across, non-dual, immeasurable; one perceives the consciousness kasiṇa as upwards, downwards, across, non-dual, immeasurable. These, Monks, are the ten kasiṇa bases.\n\nAmong these ten kasiṇa bases, Monks, this is considered the foremost: that one perceives the consciousness kasiṇa as upwards, downwards, across, non-dual, immeasurable. Yet, Monks, there are beings who perceive in this way. Yet, Monks, even for beings who perceive in this way, there is alteration, there is transformation. Seeing this thus, Monks, the well-instructed noble disciple becomes disenchanted even with that. Being disenchanted with that, he becomes dispassionate towards what is foremost, how much more so towards what is inferior.\n\nMonks, there are these eight mastery bases. Which eight? One, having the perception of form internally, sees external forms, limited, either beautiful or ugly. His perception is: 'Having overcome these, I know and see them.' This is the first mastery base.\n\nOne, having the perception of form internally, sees external forms, immeasurable, either beautiful or ugly. His perception is: 'Having overcome these, I know and see them.' This is the second mastery base.\n\nOne, having the perception of formlessness internally, sees external forms, limited, either beautiful or ugly. His perception is: 'Having overcome these, I know and see them.' This is the third mastery base.\n\nOne, having the perception of formlessness internally, sees external forms, immeasurable, either beautiful or ugly. His perception is: 'Having overcome these, I know and see them.' This is the fourth mastery base.\n\nOne, having the perception of formlessness internally, sees external forms that are blue, blue in color, blue in appearance, blue in luster. Just as a flax flower is blue, blue in color, blue in appearance, blue in luster; or just as a Benares cloth, polished on both sides, is blue, blue in color, blue in appearance, blue in luster; even so, one, having the perception of formlessness internally, sees external forms that are blue, blue in color, blue in appearance, blue in luster. His perception is: 'Having overcome these, I know and see them.' This is the fifth mastery base.\n\nOne, having the perception of formlessness internally, sees external forms that are yellow, yellow in color, yellow in appearance, yellow in luster. Just as a kaṇikāra flower is yellow, yellow in color, yellow in appearance, yellow in luster; or just as a Benares cloth, polished on both sides, is yellow, yellow in color, yellow in appearance, yellow in luster; even so, one, having the perception of formlessness internally, sees external forms that are yellow, yellow in color, yellow in appearance, yellow in luster. His perception is: 'Having overcome these, I know and see them.' This is the sixth mastery base.\n\nJust as a kanikara flower is yellow, with a yellow hue, with a yellow appearance, with a yellow radiance; or just as a Benares cloth, thoroughly cleansed on both sides, is yellow, with a yellow hue, with a yellow appearance, with a yellow radiance; even so, one who is inwardly without perception of form sees external forms that are yellow, with a yellow hue, with a yellow appearance, with a yellow radiance. And he perceives, \"Having overcome them, I know and I see.\" This is the sixth realm of mastery.\n\nInwardly without perception of form, one sees external forms that are red, with a red hue, with a red appearance, with a red radiance. Just as a bandhujivaka flower is red, with a red hue, with a red appearance, with a red radiance; or just as a Benares cloth, thoroughly cleansed on both sides, is red, with a red hue, with a red appearance, with a red radiance; even so, one who is inwardly without perception of form sees external forms that are red, with a red hue, with a red appearance, with a red radiance. And he perceives, \"Having overcome them, I know and I see.\" This is the seventh realm of mastery.\n\nInwardly without perception of form, one sees external forms that are white, with a white hue, with a white appearance, with a white radiance. Just as a star is white, with a white hue, with a white appearance, with a white radiance; or just as a Benares cloth, thoroughly cleansed on both sides, is white, with a white hue, with a white appearance, with a white radiance; even so, one who is inwardly without perception of form sees external forms that are white, with a white hue, with a white appearance, with a white radiance. And he perceives, \"Having overcome them, I know and I see.\" This is the eighth realm of mastery. These, monks, are the eight realms of mastery.\n\nAmong these eight realms of mastery, monks, this is supreme: one who is inwardly without perception of form sees external forms that are white, with a white hue, with a white appearance, with a white radiance, and he perceives, \"Having overcome them, I know and I see.\" There are beings, monks, who have such a perception. Even for those beings who have such a perception, monks, there is alteration, there is change. Seeing thus, monks, a well-taught noble disciple becomes dispassionate even towards that. Being dispassionate towards that highest state, he is much more so towards the inferior.\n\nThese, monks, are the four paths of practice. Which four? A painful path of practice with slow insight; a painful path of practice with quick insight; a pleasant path of practice with slow insight; a pleasant path of practice with quick insight. These, monks, are the four paths of practice.\n\nAmong these four paths of practice, monks, this is supreme: a pleasant path of practice with quick insight. There are beings, monks, who practice in this way. Even for those beings who practice in this way, monks, there is alteration, there is change. Seeing thus, monks, a well-taught noble disciple becomes dispassionate even towards that. Being dispassionate towards that highest state, he is much more so towards the inferior.\n\nThese, monks, are the four perceptions. Which four? One perceives limited scope; one perceives vast scope; one perceives immeasurable scope; one perceives the base of nothingness, thinking, \"There is nothing.\" These, monks, are the four perceptions.\n\nAmong these four perceptions, monks, this is supreme: one perceives the base of nothingness, thinking, \"There is nothing.\" There are beings, monks, who have such a perception. Even for those beings who have such a perception, monks, there is alteration, there is change. Seeing thus, monks, a well-taught noble disciple becomes dispassionate even towards that. Being dispassionate towards that highest state, he is much more so towards the inferior.\n\nAmong external views, monks, this is supreme: \"May I not be, may it not be mine, may I not come to be, may it not be mine in the future.\" For one holding such a view, monks, this is to be expected: that the non-repulsion to becoming will not exist for him; and the repulsion to the cessation of becoming will not exist for him. There are beings, monks, who hold such a view. Even for those beings who hold such a view, monks, there is alteration, there is change. Seeing thus, monks, a well-taught noble disciple becomes dispassionate even towards that. Being dispassionate towards that highest state, he is much more so towards the inferior.\n\nThere are, monks, some recluses and brahmins who declare ultimate purification. Among those who declare ultimate purification, monks, this is supreme: namely, having completely transcended the base of nothingness, one abides having entered the base of neither perception nor non-perception. They teach the Dhamma for the direct knowledge and realization of that. There are beings, monks, who speak in this way. Even for those beings who speak in this way, monks, there is alteration, there is change. Seeing thus, monks, a well-taught noble disciple becomes dispassionate even towards that.\n\nBecoming disenchanted with that, one becomes dispassionate even towards the highest, how much more so towards the inferior.\n\n“Monks, there are some recluses and brahmins who proclaim supreme Nibbāna as attainable in this very life. Among those who proclaim supreme Nibbāna attainable in this very life, this is the highest: having known as it actually is the origin, passing away, gratification, danger, and escape from the six sense bases, there is liberation through non-clinging.” “Monks, some recluses and brahmins falsely, vainly, untruthfully, and unrealistically misrepresent me, the speaker and proclaimer of such things, saying: ‘The recluse Gotama does not proclaim the full comprehension of sensual pleasures; he does not proclaim the full comprehension of forms; he does not proclaim the full comprehension of feelings.’ But I do, monks, proclaim the full comprehension of sensual pleasures; I do proclaim the full comprehension of forms; I do proclaim the full comprehension of feelings. I proclaim complete extinguishment in this very life, unattached, cooled, tranquil, through non-clinging.”",
      "sinhala": "භික්‍ෂූණි, කාසි කෝසල රාජ්‍යයෙහි, යම්තාක් කෝසල මහරජ වූ පසේනදීගේ රාජ්‍යය පවතීද, එහිදී පසේනදී කෝසල මහරජ උතුම් යැයි කියනු ලැබේ. එහෙත් භික්‍ෂූණි, කෝසල පසේනදී මහරජුට ද වෙනස්වීමක්, විපරීතවීමක් ඇත්තේය. භික්‍ෂූණි, මෙසේ දකින ලද ශ්‍රැතවත් ආර්යශ්‍රාවකයා ඒ (පසේනදී රජු) කෙරෙහි ද කලකිරෙයි. එහි කලකිරෙන ඔහු උසස් දේ කෙරෙහි ද නොඇලෙයි, පහත් දේ කෙරෙහි නම් කියනුම කවරේද?\n\nභික්‍ෂූණි, යම්තාක් හිරු සඳු ගමන් කරන්නේද, දිශා බබළමින් බබළන්නේද, ඒ තරම් දහසක් ලෝක ඇත. ඒ දහසක් ලෝකධාතුවෙහි, දහසක් සඳු ද, දහසක් හිරු ද, දහසක් සිනේරු පර්වත රාජයෝ ද, දහසක් ජම්බුද්වීපයෝ ද, දහසක් අපරගෝයානයෝ ද, දහසක් උත්තරකුරුවෝ ද, දහසක් පූර්වවිදේහයෝ ද, සිව්දහසක් මහා සමුද්‍රයෝ ද, සිව්දහසක් මහා රාජයෝ ද, දහසක් චාතුම්මහාරාජික දෙව්ලෝ ද, දහසක් තව්තිසා දෙව්ලෝ ද, දහසක් යාම දෙව්ලෝ ද, දහසක් තුසිත දෙව්ලෝ ද, දහසක් නිම්මානරතී දෙව්ලෝ ද, දහසක් පරනිම්මිතවසවත්ති දෙව්ලෝ ද, දහසක් බ්‍රහ්මලෝක ද වෙති. භික්‍ෂූණි, යම්තාක් මේ දහසක් වූ ලෝකධාතුව පවතීද, එහිදී මහාබ්‍රහ්මයා උතුම් යැයි කියනු ලැබේ. එහෙත් භික්‍ෂූණි, මහාබ්‍රහ්මයාට ද වෙනස්වීමක්, විපරීතවීමක් ඇත්තේය. භික්‍ෂූණි, මෙසේ දකින ලද ශ්‍රැතවත් ආර්යශ්‍රාවකයා ඒ (මහාබ්‍රහ්මයා) කෙරෙහි ද කලකිරෙයි. එහි කලකිරෙන ඔහු උසස් දේ කෙරෙහි ද නොඇලෙයි, පහත් දේ කෙරෙහි නම් කියනුම කවරේද?\n\nභික්‍ෂූණි, මේ ලෝකය සංවර්තනය (විනාශය) වන කාලයක් ඇත්තේය. භික්‍ෂූණි, ලෝකය සංවර්තනය වන කල්හි, බොහෝ සත්ත්වයෝ ආභස්සර බ්‍රහ්ම ලෝකයට පැමිණෙති. ඔවුහු එහි මනෝමය වෙති, ප්‍රීති භක්‍ෂණය කරන්නෝ වෙති, ස්වයංප්‍රභා ඇත්තෝ වෙති, අහසෙහි හැසිරෙන්නෝ වෙති, සුන්දර ආයුෂ ඇත්තෝ වෙති, දීර්ඝ කාලයක් පවතින්නෝ වෙති. භික්‍ෂූණි, ලෝකය සංවර්තනය වන කල්හි, ආභස්සර දෙවියෝ උතුම් යැයි කියනු ලබති. එහෙත් භික්‍ෂූණි, ආභස්සර දෙවියන්ට ද වෙනස්වීමක්, විපරීතවීමක් ඇත්තේය. භික්‍ෂූණි, මෙසේ දකින ලද ශ්‍රැතවත් ආර්යශ්‍රාවකයා ඒ (ආභස්සර දෙවිවරුන්) කෙරෙහි ද කලකිරෙයි. එහි කලකිරෙන ඔහු උසස් දේ කෙරෙහි ද නොඇලෙයි, පහත් දේ කෙරෙහි නම් කියනුම කවරේද?\n\nභික්‍ෂූණි, මේ දස කසිණායතනයෝ වෙති. කවර දසයක්ද? එක් අයෙක් පඨවි කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් ආපෝ කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් තේජෝ කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් වායෝ කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් නීල කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් පීත කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් ලෝහිත කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් ඕදාත කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් ආකාශ කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. එක් අයෙක් විඥාණ කසිණය උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් හඳුනා ගනී. භික්‍ෂූණි, මේ දස කසිණායතනයෝ වෙති. භික්‍ෂූණි, මේ දස කසිණායතනයන් අතුරින්, එක් අයෙක් උඩින්, යටින්, හරහට, දෙකක් නොවී, අප්‍රමාණ වශයෙන් විඥාණ කසිණය හඳුනා ගනී යනු යම්සේද, මෙය අග්‍ර යැයි කියනු ලැබේ. භික්‍ෂූණි, මෙබඳු සංඥාවන් ඇති සත්ත්වයෝ ද වෙති. එහෙත් භික්‍ෂූණි, මෙබඳු සංඥාවන් ඇති සත්ත්වයන්ට ද වෙනස්වීමක්, විපරීතවීමක් ඇත්තේය. භික්‍ෂූණි, මෙසේ දකින ලද ශ්‍රැතවත් ආර්යශ්‍රාවකයා ඒ (විඥාණ කසිණය වඩන සත්ත්වයින්) කෙරෙහි ද කලකිරෙයි. එහි කලකිරෙන ඔහු උසස් දේ කෙරෙහි ද නොඇලෙයි, පහත් දේ කෙරෙහි නම් කියනුම කවරේද?\n\nභික්‍ෂූණි, මේ අභිභායතන අටක් වෙති. කවර අටක්ද? එක් අයෙක් තමා තුළ රූප සංඥා ඇත්තෙක්ව, පිටත රූපයන්, කුඩා වූ, හොඳ වර්ණවත් හා අයහපත් වර්ණවත් රූපයන් දකී. 'ඒවා මම පරදවා (බලවත් කොට) දැනගනිමි, දකිමි' යන සංඥාව ඇත්තෙක් වෙයි. මෙය පළමු අභිභායතනයයි. එක් අයෙක් තමා තුළ රූප සංඥා ඇත්තෙක්ව, පිටත රූපයන්, අප්‍රමාණ වූ, හොඳ වර්ණවත් හා අයහපත් වර්ණවත් රූපයන් දකී. 'ඒවා මම පරදවා දැනගනිමි, දකිමි' යන සංඥාව ඇත්තෙක් වෙයි. මෙය දෙවැනි අභිභායතනයයි. එක් අයෙක් තමා තුළ අරූප සංඥා (රූප සංඥා නැත්තෙක්ව) ඇත්තෙක්ව, පිටත රූපයන්, කුඩා වූ, හොඳ වර්ණවත් හා අයහපත් වර්ණවත් රූපයන් දකී. 'ඒවා මම පරදවා දැනගනිමි, දකිමි' යන සංඥාව ඇත්තෙක් වෙයි. මෙය තුන්වැනි අභිභායතනයයි. එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන්, අප්‍රමාණ වූ, හොඳ වර්ණවත් හා අයහපත් වර්ණවත් රූපයන් දකී. 'ඒවා මම පරදවා දැනගනිමි, දකිමි' යන සංඥාව ඇත්තෙක් වෙයි. මෙය සිව්වැනි අභිභායතනයයි. එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන් නිල් පැහැති, නිල් වර්ණ ඇති, නිල් පැහැයෙන් දිස්වන, නිල් පැහැයෙන් බැබළෙන රූපයන් දකී. යම්සේ නම් උමා මලක් නිල් පැහැතිද, නිල් වර්ණ ඇත්තේද, නිල් පැහැයෙන් දිස්වන්නේද, නිල් පැහැයෙන් බැබළෙන්නේද, එසේම, යම්සේ නම් දෙපසම ඔපවත් කළ බරණැස් වස්ත්‍රයක් නිල් පැහැතිද, නිල් වර්ණ ඇත්තේද, නිල් පැහැයෙන් දිස්වන්නේද, නිල් පැහැයෙන් බැබළෙන්නේද; එලෙසම, එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන් නිල් පැහැති, නිල් වර්ණ ඇති, නිල් පැහැයෙන් දිස්වන, නිල් පැහැයෙන් බැබළෙන රූපයන් දකී. 'ඒවා මම පරදවා දැනගනිමි, දකිමි' යන සංඥාව ඇත්තෙක් වෙයි. මෙය පස්වැනි අභිභායතනයයි. එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන් කහ පැහැති, කහ වර්ණ ඇති, කහ පැහැයෙන් දිස්වන, කහ පැහැයෙන් බැබළෙන රූපයන් දකී. යම්සේ නම් කණි කාර පුෂ්පයක් කහ පැහැතිද, කහ වර්ණ ඇත්තේද, කහ පැහැයෙන් දිස්වන්නේද, කහ පැහැයෙන් බැබළෙන්නේද, එසේම, යම්සේ නම් දෙපසම ඔපවත් කළ බරණැස් වස්ත්‍රයක් කහ පැහැතිද, කහ වර්ණ ඇත්තේද, කහ පැහැයෙන් දිස්වන්නේද, කහ පැහැයෙන් බැබළෙන්නේද; එලෙසම, එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන් කහ පැහැති, කහ වර්ණ ඇති, කහ පැහැයෙන් දිස්වන, කහ පැහැයෙන් බැබළෙන රූපයන් දකී. 'ඒවා මම පරදවා දැනගනිමි, දකිමි' යන සංඥාව ඇත්තෙක් වෙයි. මෙය සවැනි අභිභායතනයයි. එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන් රතු පැහැති, රතු වර්ණ ඇති, රතු පැහැයෙන් දිස්වන, රතු පැහැයෙන් බැබළෙන රූපයන් දකී. යම්සේ නම් බන්දුජීවක පුෂ්පයක් රතු පැහැතිද, රතු වර්ණ ඇත්තේද, රතු පැහැයෙන් දිස්වන්නේද, රතු පැහැයෙන් බැබළෙන්නේද, එසේම, යම්සේ නම් දෙපසම ඔපවත් කළ බරණැස් වස්ත්‍රයක් රතු පැහැතිද, රතු වර්ණ ඇත්තේද, රතු පැහැයෙන් දිස්වන්නේද, රතු පැහැයෙන් බැබළෙන්නේද; එලෙසම, එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන් රතු පැහැති, රතු වර්ණ ඇති, රතු පැහැයෙන් දිස්වන, රතු පැහැයෙන් බැබළෙන රූපයන් දකී. 'ඒවා මම පරදවා දැනගනිමි, දකිමි' යන සංඥාව ඇත්තෙක් වෙයි. මෙය සත්වැනි අභිභායතනයයි. එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන් සුදු පැහැති, සුදු වර්ණ ඇති, සුදු පැහැයෙන් දිස්වන, සුදු පැහැයෙන් බැබළෙන රූපයන් දකී. යම්සේ නම් තරු (ඖෂධී තාරකා) සුදු පැහැතිද, සුදු වර්ණ ඇත්තේද, සුදු පැහැයෙන් දිස්වන්නේද, සුදු පැහැයෙන් බැබළෙන්නේද, එසේම, යම්සේ නම් දෙපසම ඔපවත් කළ බරණැස් වස්ත්‍රයක් සුදු පැහැතිද, සුදු වර්ණ ඇත්තේද, සුදු පැහැයෙන් දිස්වන්නේද, සුදු පැහැයෙන් බැබළෙන්නේද; එලෙසම, එක් අයෙක් තමා තුළ අරූප සංඥා ඇත්තෙක්ව, පිටත රූපයන් සුදු පැහැති, සුදු වර්ණ ඇති, සුදු පැහැයෙන් දිස්වන, සුදු පැහැයෙන් බැබළෙන රූපයන් දකී. 'ඒවා මම පරදවා දැනගනිමි, දකිමි' යන සංඥාව ඇත්තෙක් වෙයි. මෙය අටවැනි අභිභායතනයයි.\n\nයම්සේ කණිකාර පුෂ්පයක් කහ පැහැති, කහ වර්ණැති, කහ දර්ශනයක් ඇති, කහ ආලෝකයෙන් යුක්ත වේද, නැතහොත් දෙපසම මනාකොට මදින ලද බරණැස් වස්ත්‍රයක් කහ පැහැති, කහ වර්ණැති, කහ දර්ශනයක් ඇති, කහ ආලෝකයෙන් යුක්ත වේද; එපරිද්දෙන්ම, එක්තරා යෝගියෙක් තමන් තුළ අරූප සංඥාවෙන් යුක්තව, පිටත කහ පැහැති, කහ වර්ණැති, කහ දර්ශනයක් ඇති, කහ ආලෝකයෙන් යුක්ත වූ රූප දකී. ‘මම ඒ රූප යටපත් කොට දනිමි, දකිමි’ යනුවෙන් ඔහුට සංඥාවක් ඇතිවේ. මෙය සයවන අධිභූ ආයතනයයි.\n\nඑක්තරා යෝගියෙක් තමන් තුළ අරූප සංඥාවෙන් යුක්තව, පිටත රතු පැහැති, රතු වර්ණැති, රතු දර්ශනයක් ඇති, රතු ආලෝකයෙන් යුක්ත වූ රූප දකී. යම්සේ බන්ධුජීවක පුෂ්පයක් රතු පැහැති, රතු වර්ණැති, රතු දර්ශනයක් ඇති, රතු ආලෝකයෙන් යුක්ත වේද, නැතහොත් දෙපසම මනාකොට මදින ලද බරණැස් වස්ත්‍රයක් රතු පැහැති, රතු වර්ණැති, රතු දර්ශනයක් ඇති, රතු ආලෝකයෙන් යුක්ත වේද; එපරිද්දෙන්ම, එක්තරා යෝගියෙක් තමන් තුළ අරූප සංඥාවෙන් යුක්තව, පිටත රතු පැහැති, රතු වර්ණැති, රතු දර්ශනයක් ඇති, රතු ආලෝකයෙන් යුක්ත වූ රූප දකී. ‘මම ඒ රූප යටපත් කොට දනිමි, දකිමි’ යනුවෙන් ඔහුට සංඥාවක් ඇතිවේ. මෙය සත්වන අධිභූ ආයතනයයි.\n\nඑක්තරා යෝගියෙක් තමන් තුළ අරූප සංඥාවෙන් යුක්තව, පිටත සුදු පැහැති, සුදු වර්ණැති, සුදු දර්ශනයක් ඇති, සුදු ආලෝකයෙන් යුක්ත වූ රූප දකී. යම්සේ ඔසු තාරකාව සුදු පැහැති, සුදු වර්ණැති, සුදු දර්ශනයක් ඇති, සුදු ආලෝකයෙන් යුක්ත වේද, නැතහොත් දෙපසම මනාකොට මදින ලද බරණැස් වස්ත්‍රයක් සුදු පැහැති, සුදු වර්ණැති, සුදු දර්ශනයක් ඇති, සුදු ආලෝකයෙන් යුක්ත වේද; එපරිද්දෙන්ම, එක්තරා යෝගියෙක් තමන් තුළ අරූප සංඥාවෙන් යුක්තව, පිටත සුදු පැහැති, සුදු වර්ණැති, සුදු දර්ශනයක් ඇති, සුදු ආලෝකයෙන් යුක්ත වූ රූප දකී. ‘මම ඒ රූප යටපත් කොට දනිමි, දකිමි’ යනුවෙන් ඔහුට සංඥාවක් ඇතිවේ. මෙය අටවන අධිභූ ආයතනයයි.\n\nමහණෙනි, මේ අට අධිභූ ආයතනයෝ වෙති.\n\nමහණෙනි, මේ අට අධිභූ ආයතන අතුරින් මේ අභිභූ ආයතනය අග්‍ර වේ. එනම්, තමන් තුළ අරූප සංඥාවෙන් යුක්තව පිටත සුදු පැහැති, සුදු වර්ණැති, සුදු දර්ශනයක් ඇති, සුදු ආලෝකයෙන් යුක්ත වූ රූප දකින, ‘මම ඒ රූප යටපත් කොට දනිමි, දකිමි’ යනුවෙන් සංඥා ඇතිකරගන්නා යෝගීභාවයයි. මහණෙනි, මෙබඳු සංඥාවන් ඇති සත්ත්වයෝ ද වෙති. මහණෙනි, මෙබඳු සංඥාවන් ඇති සත්ත්වයන්ට ද වෙනස්වීමක්, විපරිනාමයක් පවතී. මහණෙනි, අසා ඇති ආර්ය ශ්‍රාවක තෙමේ මෙසේ දකිමින් එයින්ද කලකිරෙයි. එයින් කලකිරෙන්නේ අග්‍ර වූ දෙයින්ද නොඇලෙයි, පහත් දෙයින් කුමන කථාද.\n\nමහණෙනි, මේ ප්‍රතිපත්ති සතරකි. කවර සතරක්ද? දුක් සහිත ප්‍රතිපදාවකි, ප්‍රඥාව ලැබීම මන්දගාමී වේ. දුක් සහිත ප්‍රතිපදාවකි, ප්‍රඥාව ලැබීම ක්ෂිප්‍ර වේ. සැප සහිත ප්‍රතිපදාවකි, ප්‍රඥාව ලැබීම මන්දගාමී වේ. සැප සහිත ප්‍රතිපදාවකි, ප්‍රඥාව ලැබීම ක්ෂිප්‍ර වේ – මහණෙනි, මේ ප්‍රතිපත්ති සතරයි.\n\nමහණෙනි, මේ සතර ප්‍රතිපත්ති අතුරින් ‘සැප සහිත ප්‍රතිපදාවකි, ප්‍රඥාව ලැබීම ක්ෂිප්‍ර වේ’ යන මෙය අග්‍ර වේ. මහණෙනි, මෙබඳු ප්‍රතිපදාවක පිහිටි සත්ත්වයෝ ද වෙති. මහණෙනි, මෙබඳු ප්‍රතිපදාවක පිහිටි සත්ත්වයන්ට ද වෙනස්වීමක්, විපරිනාමයක් පවතී. මහණෙනි, අසා ඇති ආර්ය ශ්‍රාවක තෙමේ මෙසේ දකිමින් එයින්ද කලකිරෙයි. එයින් කලකිරෙන්නේ අග්‍ර වූ දෙයින්ද නොඇලෙයි, පහත් දෙයින් කුමන කථාද.\n\nමහණෙනි, මේ සංඥාවන් සතරකි. කවර සතරක්ද? එක්තරා යෝගියෙක් පරීත්ත සංඥාව හඳුනාගනී. එක්තරා යෝගියෙක් මහග්ගත සංඥාව හඳුනාගනී. එක්තරා යෝගියෙක් අප්‍රමාණ සංඥාව හඳුනාගනී. එක්තරා යෝගියෙක් ‘කිසිවක් නැතැ’යි යන ආකිංචඤ්ඤායතන සංඥාව හඳුනාගනී – මහණෙනි, මේ සංඥාවන් සතරයි.\n\nමහණෙනි, මේ සතර සංඥාවන් අතුරින් ‘කිසිවක් නැතැ’යි යන ආකිංචඤ්ඤායතන සංඥාව හඳුනාගන්නා මෙය අග්‍ර වේ. මහණෙනි, මෙබඳු සංඥාවන් ඇති සත්ත්වයෝ ද වෙති. මහණෙනි, මෙබඳු සංඥාවන් ඇති සත්ත්වයන්ට ද වෙනස්වීමක්, විපරිනාමයක් පවතී. මහණෙනි, අසා ඇති ආර්ය ශ්‍රාවක තෙමේ මෙසේ දකිමින් එයින්ද කලකිරෙයි. එයින් කලකිරෙන්නේ අග්‍ර වූ දෙයින්ද නොඇලෙයි, පහත් දෙයින් කුමන කථාද.\n\nමහණෙනි, බාහිර දෘෂ්ටිගතයන් අතුරින් ‘මම නොවෙම්වා, මාගේ නොවෙම්වා, මම නොපවතින්නෙම්වා, මාගේ නොපවතින්නෙම්වා’ යන මෙය අග්‍ර වේ. මහණෙනි, මෙබඳු දෘෂ්ටියක් ඇති පුද්ගලයාගෙන් මේ අදහස බලාපොරොත්තු විය හැක: ‘යම් මේ භවයෙහි නොකලකිරීමක් ඇත්ද, එය ඔහුට නැතිව යනු ඇත; යම් මේ භව නිරෝධයෙහි කලකිරීමක් ඇත්ද, එය ඔහුට නැතිව යනු ඇත.’ මහණෙනි, මෙබඳු දෘෂ්ටියක් ඇති සත්ත්වයෝ ද වෙති. මහණෙනි, මෙබඳු දෘෂ්ටියක් ඇති සත්ත්වයන්ට ද වෙනස්වීමක්, විපරිනාමයක් පවතී. මහණෙනි, අසා ඇති ආර්ය ශ්‍රාවක තෙමේ මෙසේ දකිමින් එයින්ද කලකිරෙයි. එයින් කලකිරෙන්නේ අග්‍ර වූ දෙයින්ද නොඇලෙයි, පහත් දෙයින් කුමන කථාද.\n\nමහණෙනි, සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ පරම අර්ථයෙන් විශුද්ධිය පනවති. මහණෙනි, පරමාර්ථ විශුද්ධිය පනවන්නන් අතුරින් මේ අදහස අග්‍ර වේ. එනම්, සියලු ආකිංචඤ්ඤායතනය ඉක්මවා නේවසංඥානාසංඥායතනයට පැමිණ වාසය කරයි යන මෙයයි. ඔවුහු එය අවබෝධ කරගෙන, එය ප්‍රත්‍යක්ෂ කිරීම සඳහා ධර්මය දේශනා කරති. මහණෙනි, මෙබඳු වාද ඇති සත්ත්වයෝ ද වෙති. මහණෙනි, මෙබඳු වාද ඇති සත්ත්වයන්ට ද වෙනස්වීමක්, විපරිනාමයක් පවතී. මහණෙනි, අසා ඇති ආර්ය ශ්‍රාවක තෙමේ මෙසේ දකිමින් එයින්ද කලකිරෙයි.\n\nඑහි කලකිරෙන්නා වූ තැනැත්තා උසස් දේ කෙරෙහි විරාගයට පත් වේ, පහත් දේ කෙරෙහි ඊටත් වඩා විරාගයට පත් වේ.\n\n“මහණෙනි, සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ මේ ජීවිතයේ දීම දැකිය හැකි පරම නිවන ප්‍රකාශ කරති. මහණෙනි, යමක් මේ ජීවිතයේ දීම දැකිය හැකි පරම නිවන ලෙස ප්‍රකාශ කරන්නන් අතර අග්‍ර වන්නේ නම්, ඒ නම්, සය වැදෑරුම් ස්පර්ශායතනවල හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, යථාභූත ලෙස දැනගෙන, උපාදානයකින් තොරව නිදහස් වීමයි. මහණෙනි, මෙසේ කියන්නා වූ, මෙසේ දේශනා කරන්නා වූ මා, සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ සත්‍යයෙන් තොර වූ, හිස් වූ, අසත්‍ය වූ, නැති දෙයකින් චෝදනා කරති – ‘ශ්‍රමණ ගෞතමයන් වහන්සේ කාමයන් පිළිබඳව පිරිසිඳ දැකීමක් (පරිඤ්ඤාවක්) ප්‍රකාශ නොකරති, රූපයන් පිළිබඳව පිරිසිඳ දැකීමක් ප්‍රකාශ නොකරති, වේදනාවන් පිළිබඳව පිරිසිඳ දැකීමක් ප්‍රකාශ නොකරති’ කියා. මහණෙනි, මම කාමයන් පිළිබඳව ද පිරිසිඳ දැකීමක් ප්‍රකාශ කරමි, රූපයන් පිළිබඳව ද පිරිසිඳ දැකීමක් ප්‍රකාශ කරමි, වේදනාවන් පිළිබඳව ද පිරිසිඳ දැකීමක් ප්‍රකාශ කරමි. මේ දැකිය හැකි ධර්මයෙහිම තණ්හාවෙන් තොරව, නිවුණු සිත් ඇතිව, සිසිල් වූ ස්වභාවයෙන්, උපාදානයකින් තොරව පිරිනිවීම ප්‍රකාශ කරමි.”",
      "paliTitle": "Paṭhamakosalasuttaṃ",
      "englishTitle": "First Kosala Sutta",
      "sinhalaTitle": "පළමු කෝසල සූත්‍රය"
    },
    {
      "number": 30,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena rājā pasenadi kosalo uyyodhikā nivatto hoti vijitasaṅgāmo laddhādhippāyo. Atha kho rājā pasenadi kosalo yena ārāmo tena pāyāsi. Yāvatikā yānassa bhūmi, yānena gantvā yānā paccorohitvā pattikova ārāmaṃ pāvisi. Tena kho pana samayena sambahulā bhikkhū abbhokāse caṅkamanti. Atha kho rājā pasenadi kosalo yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘kahaṃ nu kho, bhante, bhagavā etarahi viharati arahaṃ sammāsambuddho. Dassanakāmā hi mayaṃ, bhante, taṃ bhagavantaṃ arahantaṃ sammāsambuddha’’nti. ‘‘Eso, mahārāja, vihāro saṃvutadvāro. Tena appasaddo upasaṅkamitvā ataramāno ālindaṃ pavisitvā ukkāsitvā aggaḷaṃ ākoṭehi; vivarissati te bhagavā dvāra’’nti. Atha kho rājā pasenadi kosalo yena so vihāro saṃvutadvāro, tena appasaddo upasaṅkamitvā ataramāno ālindaṃ pavisitvā ukkāsitvā aggaḷaṃ ākoṭesi. Vivari bhagavā dvāraṃ. Atha kho rājā pasenadi kosalo vihāraṃ pavisitvā bhagavato pādesu sirasā nipatitvā bhagavato pādāni mukhena ca paricumbati pāṇīhi ca parisambāhati nāmañca sāveti – ‘‘rājāhaṃ, bhante, pasenadi kosalo; rājāhaṃ, bhante, pasenadi kosalo’’ti. ‘‘Kaṃ pana tvaṃ, mahārāja, atthavasaṃ sampassamāno imasmiṃ sarīre evarūpaṃ paramanipaccakāraṃ karosi, mettūpahāraṃ upadaṃsesī’’ti? ‘‘Kataññutaṃ kho ahaṃ, bhante, kataveditaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Bhagavā hi, bhante, bahujanahitāya paṭipanno bahujanasukhāya bahuno janassa ariye ñāye patiṭṭhāpitā yadidaṃ kalyāṇadhammatāya kusaladhammatāya. Yampi, bhante, bhagavā bahujanahitāya paṭipanno bahujanasukhāya bahuno janassa ariye ñāye patiṭṭhāpitā yadidaṃ kalyāṇadhammatāya kusaladhammatāya, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā sīlavā vuddhasīlo ariyasīlo kusalasīlo kusalasīlena samannāgato. Yampi, bhante, bhagavā sīlavā vuddhasīlo ariyasīlo kusalasīlo kusalasīlena samannāgato, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā dīgharattaṃ āraññiko, araññavanapatthāni pantāni senāsanāni paṭisevati. Yampi, bhante, bhagavā dīgharattaṃ āraññiko, araññavanapatthāni pantāni senāsanāni paṭisevati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā santuṭṭho itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena. Yampi, bhante, bhagavā santuṭṭho itarītaracīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārena, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Yampi, bhante, bhagavā āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā santuṭṭhikathā pavivekakathā asaṃsaggakathā vīriyārambhakathā sīlakathā samādhikathā paññākathā vimuttikathā vimuttiñāṇadassanakathā, evarūpāya kathāya nikāmalābhī akicchalābhī akasiralābhī. Yampi, bhante, bhagavā yāyaṃ kathā abhisallekhikā cetovivaraṇasappāyā, seyyathidaṃ – appicchakathā…pe… vimuttiñāṇadassanakathā, evarūpāya kathāya nikāmalābhī akicchalābhī akasiralābhī, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī. Yampi, bhante, bhagavā catunnaṃ jhānānaṃ ābhicetasikānaṃ diṭṭhadhammasukhavihārānaṃ nikāmalābhī akicchalābhī akasiralābhī, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Yampi, bhante, bhagavā anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā; ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti, iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati…pe… yathākammūpage satte pajānāti. Yampi, bhante, bhagavā dibbena cakkhunā visuddhena atikkantamānusakena…pe… yathākammūpage satte pajānāti, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Puna caparaṃ, bhante, bhagavā āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Yampi, bhante, bhagavā āsavānaṃ khayā anāsavaṃ cetovimuttiṃ…pe… sacchikatvā upasampajja viharati, idampi kho ahaṃ, bhante, atthavasaṃ sampassamāno bhagavati evarūpaṃ paramanipaccakāraṃ karomi, mettūpahāraṃ upadaṃsemi. ‘‘Handa ca dāni mayaṃ, bhante, gacchāma. Bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassa dāni tvaṃ, mahārāja, kālaṃ maññasī’’ti. Atha kho rājā pasenadi kosalo uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmīti. Dasamaṃ. ",
      "english": "On one occasion, the Blessed One was staying in Sāvatthī, at Jeta's Grove, in Anāthapiṇḍika's monastery. Now, at that time, King Pasenadi of Kosala had returned from battle, having won the fight and achieved his objective. Then, King Pasenadi of Kosala set out for the monastery. He went as far as his vehicle could go, then dismounted from his vehicle and, on foot, entered the monastery. At that time, a number of monks were walking back and forth in the open air. Then, King Pasenadi of Kosala approached those monks. Having approached them, he said to them: \"Venerable sirs, where is the Blessed One, the Arahant, the Perfectly Self-Awakened One, staying right now? We wish to see that Blessed One, the Arahant, the Perfectly Self-Awakened One.\" \"That monastery, great king, has its door closed. Go to it quietly, without rushing, enter the portico, clear your throat, and then knock on the bolt; the Blessed One will open the door for you.\" Then, King Pasenadi of Kosala quietly approached that monastery with the closed door, without rushing, entered the portico, cleared his throat, and knocked on the bolt. The Blessed One opened the door. Then, King Pasenadi of Kosala entered the monastery, prostrated his head at the Blessed One’s feet, kissed the Blessed One’s feet with his mouth, massaged them with his hands, and announced his name, saying: \"Venerable sir, I am King Pasenadi of Kosala! Venerable sir, I am King Pasenadi of Kosala!\" \"Great king, seeing what purpose or benefit do you show such extraordinary reverence and offer this tribute of affection towards this body?\" \"Venerable sir, it is out of gratitude and a sense of obligation that I show such extraordinary reverence and offer this tribute of affection towards the Blessed One.\n\n\"Indeed, Venerable sir, the Blessed One is one who practices for the welfare of many people, for the happiness of many people, establishing many people in the Noble Method, that is, in good conduct and skillful states. Because the Blessed One, Venerable sir, practices for the welfare of many people, for the happiness of many people, establishing many people in the Noble Method, that is, in good conduct and skillful states—this too, Venerable sir, is a purpose I see, and for this reason, I show such extraordinary reverence and offer this tribute of affection towards the Blessed One.\"\n\n\"Furthermore, Venerable sir, the Blessed One is virtuous, of mature virtue, of noble virtue, of skillful virtue, endowed with skillful virtue. Because the Blessed One, Venerable sir, is virtuous, of mature virtue, of noble virtue, of skillful virtue, endowed with skillful virtue—this too, Venerable sir, is a purpose I see, and for this reason, I show such extraordinary reverence and offer this tribute of affection towards the Blessed One.\"\n\n\"Furthermore, Venerable sir, the Blessed One has long been a forest dweller, frequenting remote forest and wilderness abodes. Because the Blessed One, Venerable sir, has long been a forest dweller, frequenting remote forest and wilderness abodes—this too, Venerable sir, is a purpose I see, and for this reason, I show such extraordinary reverence and offer this tribute of affection towards the Blessed One.\"\n\n\"Furthermore, Venerable sir, the Blessed One is content with any sort of robes, almsfood, lodging, and medicinal requisites for the sick. Because the Blessed One, Venerable sir, is content with any sort of robes, almsfood, lodging, and medicinal requisites for the sick—this too, Venerable sir, is a purpose I see, and for this reason, I show such extraordinary reverence and offer this tribute of affection towards the Blessed One.\"\n\n\"Furthermore, Venerable sir, the Blessed One is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world. Because the Blessed One, Venerable sir, is worthy of offerings, worthy of hospitality, worthy of donations, worthy of reverential salutation, an unsurpassed field of merit for the world—this too, Venerable sir, is a purpose I see, and for this reason, I show such extraordinary reverence and offer this tribute of affection towards the Blessed One.\"\n\n\"Furthermore, Venerable sir, the Blessed One obtains at will, without difficulty or trouble, whatever discourse is conducive to cutting away defilements and opening the mind, namely: discourse on fewness of desires, discourse on contentment, discourse on seclusion, discourse on non-entanglement, discourse on energetic effort, discourse on virtue, discourse on concentration, discourse on discernment, discourse on liberation, discourse on the knowledge and vision of liberation. Because the Blessed One, Venerable sir, obtains at will, without difficulty or trouble, whatever discourse is conducive to cutting away defilements and opening the mind, namely: discourse on fewness of desires, discourse on contentment, discourse on seclusion, discourse on non-entanglement, discourse on energetic effort, discourse on virtue, discourse on concentration, discourse on discernment, discourse on liberation, discourse on the knowledge and vision of liberation—this too, Venerable sir, is a purpose I see, and for this reason, I show such extraordinary reverence and offer this tribute of affection towards the Blessed One.\"\n\n\"Furthermore, Venerable sir, the Blessed One obtains at will, without difficulty or trouble, the four jhānas — the mind's higher states, which are a pleasant abiding in this very life.\n\nAnd furthermore, Venerable Sir, because the Blessed One is an obtainer at will, without difficulty, without trouble, of the four jhānas, which are higher mental states and provide a blissful dwelling in this very life, this too, Venerable Sir, seeing this advantage, I pay such supreme homage to the Blessed One, and I present this gift of loving-kindness.\n\nFurthermore, Venerable Sir, the Blessed One recollects his manifold past existences, that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion. He recollects: ‘There I was such a name, such a clan, such an appearance, such food, experienced such pleasant and painful feelings, and lived for such a lifespan. Having passed away from there, I arose elsewhere. There I was such a name, such a clan, such an appearance, such food, experienced such pleasant and painful feelings, and lived for such a lifespan. Having passed away from there, I arose here.’ Thus, he recollects his manifold past existences with their distinct characteristics and details. And furthermore, Venerable Sir, because the Blessed One recollects his manifold past existences – that is to say, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births, many eons of cosmic contraction, many eons of cosmic expansion, many eons of cosmic contraction and expansion. He recollects: ‘There I was such a name, such a clan, such an appearance, such food, experienced such pleasant and painful feelings, and lived for such a lifespan. Having passed away from there, I arose elsewhere. There I was such a name, such a clan, such an appearance, such food, experienced such pleasant and painful feelings, and lived for such a lifespan. Having passed away from there, I arose here.’ Thus, he recollects his manifold past existences with their distinct characteristics and details – this too, Venerable Sir, seeing this advantage, I pay such supreme homage to the Blessed One, and I present this gift of loving-kindness.\n\nFurthermore, Venerable Sir, the Blessed One, with the divine eye, purified and surpassing that of humans, sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their actions: ‘Indeed, these beings, who were endowed with misconduct of body, speech, and mind, who reviled the Noble Ones, held wrong views, and undertook actions based on wrong views, with the breakdown of the body, after death, have reappeared in a state of deprivation, a bad destination, a downfall, in hell. But these other beings, who were endowed with good conduct of body, speech, and mind, who did not revile the Noble Ones, held right views, and undertook actions based on right views, with the breakdown of the body, after death, have reappeared in a good destination, in the heavenly world.’ Thus, with the divine eye, purified and surpassing that of humans, he sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how they fare according to their actions. And furthermore, Venerable Sir, because the Blessed One, with the divine eye, purified and surpassing that of humans, sees beings passing away and reappearing, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands how beings fare according to their actions, this too, Venerable Sir, seeing this advantage, I pay such supreme homage to the Blessed One, and I present this gift of loving-kindness.\n\nFurthermore, Venerable Sir, the Blessed One, by the destruction of the taints, himself here and now realizes, enters, and abides in the taintless liberation of mind and liberation by wisdom, having directly known it. And furthermore, Venerable Sir, because the Blessed One, by the destruction of the taints, himself here and now realizes, enters, and abides in the taintless liberation of mind and liberation by wisdom, having directly known it – this too, Venerable Sir, seeing this advantage, I pay such supreme homage to the Blessed One, and I present this gift of loving-kindness.\n\n‘Now then, Venerable Sir, we must go. We have many duties, many tasks to attend to.’ ‘Now, great king, you may do as you see fit.’ Then King Pasenadi of Kosala rose from his seat, saluted the Blessed One, circumambulated him clockwise, and departed.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුතුමා විසින් කරවන ලද ජේතවනාරාමයෙහි වැඩසිටින සේක. එකල්හි කොසොල් මහ රජු වූ පසේනදී සටන ජයගෙන, තම අභිප්‍රාය සිද්ධ කරගෙන, යුද්ධයෙන් ආපසු පැමිණියේය. ඉක්බිති කොසොල් මහ රජු වූ පසේනදී ආරාමය දෙසට ගමන් කළේය. යානයට යා හැකි පමණ තැන් දක්වා යානයෙන් ගොස්, යානයෙන් බැස, පා ගමනින්ම ආරාමයට පිවිසියේය. එකල බොහෝ භික්ෂූන් වහන්සේලා එළිමහනෙහි සක්මන් කරමින් සිටියහ. ඉක්බිති කොසොල් මහ රජු වූ පසේනදී ඒ භික්ෂූන් වහන්සේලා වැඩසිටි තැනට එළඹියේය; එළඹ ඒ භික්ෂූන් වහන්සේලාට මෙසේ කීවේය: \"වහන්ස, මේ දිනවල අරහත් සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේ කොහි වැඩසිටින සේක්ද? වහන්ස, අපි ඒ අරහත් සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේව දැකීමට කැමැත්තෙමු.\" \"මහ රජතුමනි, අර විහාරය වසා ඇති දොරටු ඇත. එබැවින් නිශ්ශබ්දව එළඹ, නොඉවසිල්ලෙන් තොරව, පෙරමළුවට පිවිස, කැස්සකින් හෝ කෑමොරකින් ඇණයක් තට්ටු කරන්න; භාග්‍යවතුන් වහන්සේ ඔබට දොර විවෘත කරනු ඇත.\" ඉක්බිති කොසොල් මහ රජු වූ පසේනදී වසා ඇති දොරටු සහිත ඒ විහාරය දෙසට නිශ්ශබ්දව එළඹ, නොඉවසිල්ලෙන් තොරව, පෙරමළුවට පිවිස, කැස්සකින් හෝ කෑමොරකින් ඇණයක් තට්ටු කළේය. භාග්‍යවතුන් වහන්සේ දොර විවෘත කළ සේක. ඉක්බිති කොසොල් මහ රජු වූ පසේනදී විහාරයට පිවිස, භාග්‍යවතුන් වහන්සේගේ දෙපා මුල හිස තබා වැඳ, භාග්‍යවතුන් වහන්සේගේ දෙපා මුවින් සිඹ, දෑතින් පිරිමැද, \"වහන්ස, මම පසේනදී කොසොල් රජයි; වහන්ස, මම පසේනදී කොසොල් රජයි\" යනුවෙන් තම නම කියා සිටියේය. \"මහ රජතුමනි, කුමන කරුණක් අරමුණු කරගෙනද මේ ශරීරයෙහි මෙවන් අතිශය ගෞරවයක් දක්වන්නේ, මෙවන් මෛත්‍රී සහගත උපහාරයක් පුදන්නේ?\" \"වහන්ස, මම කෘතඥතාව සහ කෘතවේදීත්වය යන කාරණා අරමුණු කරගෙන භාග්‍යවතුන් වහන්සේට මෙවන් අතිශය ගෞරවයක් දක්වමි, මෙවන් මෛත්‍රී සහගත උපහාරයක් පුදමි. වහන්ස, භාග්‍යවතුන් වහන්සේ බොහෝ ජනයාගේ යහපත පිණිසත්, බොහෝ ජනයාගේ සුවය පිණිසත් පිළිපදින සේක; බොහෝ දෙනා ආර්ය ඥානයෙහි පිහිටුවන සේක, එනම් කල්‍යාණ ධර්මයෙන් සහ කුශල ධර්මයෙන්. වහන්ස, යම් හෙයකින් භාග්‍යවතුන් වහන්සේ බොහෝ ජනයාගේ යහපත පිණිසත්, බොහෝ ජනයාගේ සුවය පිණිසත් පිළිපදින සේක්ද, බොහෝ දෙනා ආර්ය ඥානයෙහි පිහිටුවන සේක්ද, එනම් කල්‍යාණ ධර්මයෙන් සහ කුශල ධර්මයෙන්, මේ කරුණත් අරමුණු කරගෙන, වහන්ස, මම භාග්‍යවතුන් වහන්සේට මෙවන් අතිශය ගෞරවයක් දක්වමි, මෙවන් මෛත්‍රී සහගත උපහාරයක් පුදමි.\"\n\n\"තවද, වහන්ස, භාග්‍යවතුන් වහන්සේ සීල සම්පන්නය; වැඩුණු සීල ඇති සේක; ආර්ය සීල ඇති සේක; කුසල සීල ඇති සේක; කුසල සීලයෙන් යුක්ත වන සේක. වහන්ස, යම් හෙයකින් භාග්‍යවතුන් වහන්සේ සීල සම්පන්නය, වැඩුණු සීල ඇති සේක, ආර්ය සීල ඇති සේක, කුසල සීල ඇති සේක, කුසල සීලයෙන් යුක්ත වන සේක්ද, මේ කරුණත් අරමුණු කරගෙන, වහන්ස, මම භාග්‍යවතුන් වහන්සේට මෙවන් අතිශය ගෞරවයක් දක්වමි, මෙවන් මෛත්‍රී සහගත උපහාරයක් පුදමි.\"\n\n\"තවද, වහන්ස, භාග්‍යවතුන් වහන්සේ බොහෝ කලක් තිස්සේ ආරණ්‍යවාසී වූ සේක; හුදෙකලා වූ අරණ්‍ය, වනප්‍රස්ථ, නිසංසල සේනාසන පරිභෝග කරන සේක. වහන්ස, යම් හෙයකින් භාග්‍යවතුන් වහන්සේ බොහෝ කලක් තිස්සේ ආරණ්‍යවාසී වූ සේක්ද, හුදෙකලා වූ අරණ්‍ය, වනප්‍රස්ථ, නිසංසල සේනාසන පරිභෝග කරන සේක්ද, මේ කරුණත් අරමුණු කරගෙන, වහන්ස, මම භාග්‍යවතුන් වහන්සේට මෙවන් අතිශය ගෞරවයක් දක්වමි, මෙවන් මෛත්‍රී සහගත උපහාරයක් පුදමි.\"\n\n\"තවද, වහන්ස, භාග්‍යවතුන් වහන්සේ ලැබෙන ලැබෙන සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පරිෂ්කාරයන්ගෙන් සතුටු වන සේක. වහන්ස, යම් හෙයකින් භාග්‍යවතුන් වහන්සේ ලැබෙන ලැබෙන සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පරිෂ්කාරයන්ගෙන් සතුටු වන සේක්ද, මේ කරුණත් අරමුණු කරගෙන, වහන්ස, මම භාග්‍යවතුන් වහන්සේට මෙවන් අතිශය ගෞරවයක් දක්වමි, මෙවන් මෛත්‍රී සහගත උපහාරයක් පුදමි.\"\n\n\"තවද, වහන්ස, භාග්‍යවතුන් වහන්සේ ආහුණෙය්‍ය වන සේක, පාහුණෙය්‍ය වන සේක, දක්ඛිණෙය්‍ය වන සේක, ඇඳිලි බැඳ වැඳීමට සුදුසු වන සේක, ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රය වන සේක. වහන්ස, යම් හෙයකින් භාග්‍යවතුන් වහන්සේ ආහුණෙය්‍ය වන සේක්ද, පාහුණෙය්‍ය වන සේක්ද, දක්ඛිණෙය්‍ය වන සේක්ද, ඇඳිලි බැඳ වැඳීමට සුදුසු වන සේක්ද, ලෝකයාට අනුත්තර පුණ්‍යක්ෂේත්‍රය වන සේක්ද, මේ කරුණත් අරමුණු කරගෙන, වහන්ස, මම භාග්‍යවතුන් වහන්සේට මෙවන් අතිශය ගෞරවයක් දක්වමි, මෙවන් මෛත්‍රී සහගත උපහාරයක් පුදමි.\"\n\n\"තවද, වහන්ස, භාග්‍යවතුන් වහන්සේ කෙලෙස් දුරු කිරීමටත්, සිත විවරණය කිරීමටත් (ප්‍රඥාවටත්) සුදුසු යම් කතාවක් වේද, එනම්: අල්පේච්ඡ කතාව, සන්තුෂ්ටි කතාව, ප්‍රවිවේක කතාව, අසංසර්ග කතාව, වීර්යාරම්භ කතාව, සීල කතාව, සමාධි කතාව, ප්‍රඥා කතාව, විමුක්ති කතාව, විමුක්ති ඥාන දර්ශන කතාව, මෙවැනි කථාවන්ට කැමැත්තෙන් ලාභී වන සේක, අපහසුවකින් තොරව ලාභී වන සේක, කිසිදු වෙහෙසකින් තොරව ලාභී වන සේක. වහන්ස, යම් හෙයකින් භාග්‍යවතුන් වහන්සේ කෙලෙස් දුරු කිරීමටත්, සිත විවරණය කිරීමටත් (ප්‍රඥාවටත්) සුදුසු යම් කතාවක් වේද, එනම්: අල්පේච්ඡ කතාව... ආදී වශයෙන් විමුක්ති ඥාන දර්ශන කතාව දක්වා, මෙවැනි කථාවන්ට කැමැත්තෙන් ලාභී වන සේක්ද, අපහසුවකින් තොරව ලාභී වන සේක්ද, කිසිදු වෙහෙසකින් තොරව ලාභී වන සේක්ද, මේ කරුණත් අරමුණු කරගෙන, වහන්ස, මම භාග්‍යවතුන් වහන්සේට මෙවන් අතිශය ගෞරවයක් දක්වමි, මෙවන් මෛත්‍රී සහගත උපහාරයක් පුදමි.\"\n\n\"තවද, වහන්ස, භාග්‍යවතුන් වහන්සේ චිත්තාභිසමාචාරික වූ, මේ ආත්මයෙහිම සැප විහරණයන් පිණිස වූ සතර ධ්‍යානයන්ට කැමැත්තෙන්ම ලාභී වන සේක, අපහසුවකින් තොරව ලාභී වන සේක, කිසිදු වෙහෙසකින් තොරව ලාභී වන සේක.\"\n\nභාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ සිව් ධ්‍යානයන්, එනම් චිත්ත විමුක්ති ස්වභාවය ඇති, මේ දිට්ඨධම්මයේදීම සුවසේ වාසය පිණිස වූ ධ්‍යානයන් කැමති පරිදි පහසුවෙන්, කිසිදු වෙහෙසකින් තොරව ලබන්නා වෙයිද, භාග්‍යවතුන් වහන්ස, මේද කාරණය මම සිහිපත් කරමින් භාග්‍යවතුන් වහන්සේට මෙබඳු උසස් ගෞරවයක් දක්වමි, මෛත්‍රී සම්ප්‍රදානය පුද කරමි.\n\nතවද, භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහිපත් කරයි. එනම්, එක් ජාතියක්ද, දෙජාතියක්ද, තුන් ජාතියක්ද, සතර ජාතියක්ද, පස් ජාතියක්ද, දස ජාතියක්ද, විසි ජාතියක්ද, තිස් ජාතියක්ද, සතළිස් ජාතියක්ද, පනස් ජාතියක්ද, ජාති සියයක්ද, ජාති දහසක්ද, ජාති ලක්ෂයක්ද, නොයෙක් සංවට්ට කල්පයන්ද, නොයෙක් විවට්ට කල්පයන්ද, නොයෙක් සංවට්ට-විවට්ට කල්පයන්ද සිහිපත් කරයි. ‘මම අසවල් තැනදී, මෙබඳු නමක් ඇතිව, මෙබඳු ගෝත්‍රයක් ඇතිව, මෙබඳු වර්ණයක් ඇතිව, මෙබඳු ආහාරයක් ගනිමින්, මෙබඳු සුව දුක් විඳිමින්, මෙබඳු ආයුෂ කෙළවර කොට ජීවත් වීමි. මම එතනින් චුතව අසවල් තැන උපන්නෙමි. එහිදීද මම මෙබඳු නමක් ඇතිව, මෙබඳු ගෝත්‍රයක් ඇතිව, මෙබඳු වර්ණයක් ඇතිව, මෙබඳු ආහාරයක් ගනිමින්, මෙබඳු සුව දුක් විඳිමින්, මෙබඳු ආයුෂ කෙළවර කොට ජීවත් වීමි. මම එතනින් චුතව මෙහි උපන්නෙමි’ යි. මෙසේ විස්තර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහිපත් කරයි.\n\nභාග්‍යවතුන් වහන්ස, යමක්ද භාග්‍යවතුන් වහන්සේ නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහිපත් කරයිද, එනම් එක් ජාතියක්ද, දෙජාතියක්ද, තුන් ජාතියක්ද, සතර ජාතියක්ද, පස් ජාතියක්ද, දස ජාතියක්ද, විසි ජාතියක්ද, තිස් ජාතියක්ද, සතළිස් ජාතියක්ද, පනස් ජාතියක්ද, ජාති සියයක්ද, ජාති දහසක්ද, ජාති ලක්ෂයක්ද, නොයෙක් සංවට්ට කල්පයන්ද, නොයෙක් විවට්ට කල්පයන්ද, නොයෙක් සංවට්ට-විවට්ට කල්පයන්ද සිහිපත් කරයිද, ‘මම අසවල් තැනදී, මෙබඳු නමක් ඇතිව, මෙබඳු ගෝත්‍රයක් ඇතිව, මෙබඳු වර්ණයක් ඇතිව, මෙබඳු ආහාරයක් ගනිමින්, මෙබඳු සුව දුක් විඳිමින්, මෙබඳු ආයුෂ කෙළවර කොට ජීවත් වීමි. මම එතනින් චුතව අසවල් තැන උපන්නෙමි. එහිදීද මම මෙබඳු නමක් ඇතිව, මෙබඳු ගෝත්‍රයක් ඇතිව, මෙබඳු වර්ණයක් ඇතිව, මෙබඳු ආහාරයක් ගනිමින්, මෙබඳු සුව දුක් විඳිමින්, මෙබඳු ආයුෂ කෙළවර කොට ජීවත් වීමි. මම එතනින් චුතව මෙහි උපන්නෙමි’ යි මෙසේ විස්තර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහිපත් කරයිද, භාග්‍යවතුන් වහන්ස, මේද කාරණය මම සිහිපත් කරමින් භාග්‍යවතුන් වහන්සේට මෙබඳු උසස් ගෞරවයක් දක්වමි, මෛත්‍රී සම්ප්‍රදානය පුද කරමි.\n\nතවද, භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය, දිවැසින් සත්වයන් චුත වන ආකාරයද, උපදින ආකාරයද, හීන වූද, ප්‍රණීත වූද, යහපත් වර්ණ ඇතිද, දුර්වර්ණ ඇතිද, සුගතිගාමී වූද, දුර්ගතිගාමී වූද සත්වයන් දකී. කර්මානුරූපව ගමන් කරන සත්වයන් (විශේෂයෙන්) දනියි. ‘මේ භවත් සත්වයෝ කායදුශ්චරිතයෙන් යුක්තව, වචීදුශ්චරිතයෙන් යුක්තව, මනෝදුශ්චරිතයෙන් යුක්තව, ආර්යයන්ට අපහාස කරනසුළු ව, මිථ්‍යාදෘෂ්ටිකව, මිථ්‍යාදෘෂ්ටියෙන් යුත් කර්ම සමාදන් වූවාහුය. ඔවුහු කයින් භේදවීමෙන්, මරණින් මතු අපාය නම් වූ දුගතියට, විනිපාත නම් වූ නිරයට උපන්නාහුය. නැතහොත් මේ භවත් සත්වයෝ කායසුචරිතයෙන් යුක්තව, වචීසුචරිතයෙන් යුක්තව, මනෝසුචරිතයෙන් යුක්තව, ආර්යයන්ට අපහාස නොකරනසුළු ව, සම්මාදිට්ඨිකව, සම්මාදිට්ඨියෙන් යුත් කර්ම සමාදන් වූවාහුය. ඔවුහු කයින් භේදවීමෙන්, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපන්නාහුය’ යි. මෙසේ පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය, දිවැසින් සත්වයන් චුත වන ආකාරයද, උපදින ආකාරයද, හීන වූද, ප්‍රණීත වූද, යහපත් වර්ණ ඇතිද, දුර්වර්ණ ඇතිද, සුගතිගාමී වූද, දුර්ගතිගාමී වූද සත්වයන් දකී. කර්මානුරූපව ගමන් කරන සත්වයන් (විශේෂයෙන්) දනියි.\n\nභාග්‍යවතුන් වහන්ස, යමක්ද භාග්‍යවතුන් වහන්සේ පිරිසිදු වූ, මිනිසුන්ගේ ඇස ඉක්මවා ගිය, දිවැසින් සත්වයන් චුත වන ආකාරයද, උපදින ආකාරයද, හීන වූද, ප්‍රණීත වූද, යහපත් වර්ණ ඇතිද, දුර්වර්ණ ඇතිද, සුගතිගාමී වූද, දුර්ගතිගාමී වූද සත්වයන් දකිමින්, ‘මේ භවත් සත්වයෝ කායදුශ්චරිතයෙන් යුක්තව, වචීදුශ්චරිතයෙන් යුක්තව, මනෝදුශ්චරිතයෙන් යුක්තව, ආර්යයන්ට අපහාස කරනසුළු ව, මිථ්‍යාදෘෂ්ටිකව, මිථ්‍යාදෘෂ්ටියෙන් යුත් කර්ම සමාදන් වූවාහුය. ඔවුහු කයින් භේදවීමෙන්, මරණින් මතු අපාය නම් වූ දුගතියට, විනිපාත නම් වූ නිරයට උපන්නාහුය. නැතහොත් මේ භවත් සත්වයෝ කායසුචරිතයෙන් යුක්තව, වචීසුචරිතයෙන් යුක්තව, මනෝසුචරිතයෙන් යුක්තව, ආර්යයන්ට අපහාස නොකරනසුළු ව, සම්මාදිට්ඨිකව, සම්මාදිට්ඨියෙන් යුත් කර්ම සමාදන් වූවාහුය. ඔවුහු කයින් භේදවීමෙන්, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපන්නාහුය’ යි මෙසේ කර්මානුරූපව ගමන් කරන සත්වයන් (විශේෂයෙන්) දනියිද, භාග්‍යවතුන් වහන්ස, මේද කාරණය මම සිහිපත් කරමින් භාග්‍යවතුන් වහන්සේට මෙබඳු උසස් ගෞරවයක් දක්වමි, මෛත්‍රී සම්ප්‍රදානය පුද කරමි.\n\nතවද, භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දිට්ඨධම්මයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරයි.\n\nභාග්‍යවතුන් වහන්ස, යමක්ද භාග්‍යවතුන් වහන්සේ ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දිට්ඨධම්මයේදීම තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන වාසය කරයිද, භාග්‍යවතුන් වහන්ස, මේද කාරණය මම සිහිපත් කරමින් භාග්‍යවතුන් වහන්සේට මෙබඳු උසස් ගෞරවයක් දක්වමි, මෛත්‍රී සම්ප්‍රදානය පුද කරමි.\n\n“භාග්‍යවතුන් වහන්ස, එසේනම් දැන් අපි යමු. අපට බොහෝ කටයුතු ඇත, බොහෝ කළ යුතු දේ ඇතැ”යි. “මහ රජ, දැන් ඔබ සුදුසු යැයි සිතන වේලාව වෙයි”යි. එකල්හි කොසොල් රජු වූ පසේනදී ආසනයෙන් නැගිට භාග්‍යවතුන් වහන්සේට වැඳ, ප්‍රදක්ෂිණා කර පිටත්ව ගියේය.",
      "paliTitle": "Dutiyakosalasuttaṃ",
      "englishTitle": "The Second Kosala Sutta",
      "sinhalaTitle": "දෙවන කෝසල සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Mahāvaggo tatiyo. Tassuddānaṃ – Sīhādhivutti kāyena, cundena kasiṇena ca; Kāḷī ca dve mahāpañhā, kosalehi pare duveti.",
    "english": "The Third Great Chapter",
    "sinhala": "තෙවන මහා වර්ගය"
  }
}