{
  "id": "an10.4",
  "title": {
    "pali": "Upālivaggo",
    "english": "The Chapter on Upāli",
    "sinhala": "උපාළිවග්ගෝ"
  },
  "sections": [
    {
      "number": 31,
      "pali": "Atha kho āyasmā upāli yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā upāli bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññattaṃ, pātimokkhaṃ uddiṭṭha’’nti? ‘‘Dasa kho, upāli, atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññattaṃ, pātimokkhaṃ uddiṭṭhaṃ. Katame dasa? Saṅghasuṭṭhutāya, saṅghaphāsutāya, dummaṅkūnaṃ puggalānaṃ niggahāya, pesalānaṃ bhikkhūnaṃ phāsuvihārāya, diṭṭhadhammikānaṃ āsavānaṃ saṃvarāya, samparāyikānaṃ āsavānaṃ paṭighātāya, appasannānaṃ pasādāya, pasannānaṃ bhiyyobhāvāya, saddhammaṭṭhitiyā, vinayānuggahāya – ime kho, upāli, dasa atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññattaṃ, pātimokkhaṃ uddiṭṭha’’nti. Paṭhamaṃ.",
      "english": "Then Venerable Upāli approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side.\n\nHaving sat down to one side, Venerable Upāli said to the Blessed One, \"Venerable sir, for how many purposes were training rules established by the Tathāgata for the disciples, and for how many purposes was the Pātimokkha recited?\"\n\n\"Indeed, Upāli, for ten purposes were training rules established by the Tathāgata for the disciples, and for ten purposes was the Pātimokkha recited. Which ten? For the excellence of the Saṅgha, for the harmony of the Saṅgha, for the restraint of unruly individuals, for the peaceful living of virtuous monks, for the prevention of defilements arising in this present life, for the elimination of defilements leading to future existences, for inspiring confidence in those who lack it, for increasing the confidence of those who already have it, for the stability of the True Dhamma, and for the furtherance of the Discipline – these indeed, Upāli, are the ten purposes for which training rules were established by the Tathāgata for the disciples, and for which the Pātimokkha was recited.\"",
      "sinhala": "එවිට ආයුෂ්මත් උපාලි භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පස්ව වාඩි විය. එකත්පස්ව වැඩහුන් ආයුෂ්මත් උපාලි භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘ස්වාමීනි, කවර නම් අර්ථයන් (ප්‍රයෝජන) අරමුණු කරගෙනද තථාගතයන් වහන්සේ විසින් ශ්‍රාවකයන්ට ශික්ෂාපද පනවා ඇත්තේ, ප්‍රාතිමෝක්ෂය උදෙසා ඇත්තේ?’’\n\n‘‘උපාලි, දස අර්ථයන් (ප්‍රයෝජන) අරමුණු කරගෙනයි තථාගතයන් වහන්සේ විසින් ශ්‍රාවකයන්ට ශික්ෂාපද පනවා ඇත්තේ, ප්‍රාතිමෝක්ෂය උදෙසා ඇත්තේ. ඒ දසය නම් කවරේද? සංඝයාගේ යහපැවැත්ම පිණිස, සංඝයාගේ පහසුව පිණිස, නීච ස්වභාව ඇති පුද්ගලයන් නීග්‍රහ කිරීම පිණිස, ගුණවත් භික්ෂූන්ගේ පහසුවෙන් වාසය කිරීම පිණිස, මේ ආත්මයේදී ඇතිවන ආශ්‍රවයන් සංවර කිරීම පිණිස, පරලොවදී ඇතිවන ආශ්‍රවයන් දුරු කිරීම පිණිස, අප්‍රසන්න වූවන්ගේ ප්‍රසාදය ඇති කිරීම පිණිස, ප්‍රසන්න වූවන්ගේ ප්‍රසාදය තවදුරටත් වර්ධනය කිරීම පිණිස, සද්ධර්මය ස්ථිතිය පිණිස, විනයට අනුග්‍රහය පිණිසයි. උපාලි, මේ දස අර්ථයන් අරමුණු කරගෙනයි තථාගතයන් වහන්සේ විසින් ශ්‍රාවකයන්ට ශික්ෂාපද පනවා ඇත්තේ, ප්‍රාතිමෝක්ෂය උදෙසා ඇත්තේ’’ යැයි වදාළේය. මෙය පළමුවැන්නයි.",
      "paliTitle": "Upālisuttaṃ"
    },
    {
      "number": 32,
      "pali": "‘‘Kati nu kho, bhante, pātimokkhaṭṭhapanā’’ti? ‘‘Dasa kho, upāli, pātimokkhaṭṭhapanā. Katame dasa? Pārājiko tassaṃ parisāyaṃ nisinno hoti, pārājikakathā vippakatā hoti, anupasampanno tassaṃ parisāyaṃ nisinno hoti, anupasampannakathā vippakatā hoti, sikkhaṃ paccakkhātako tassaṃ parisāyaṃ nisinno hoti, sikkhaṃ paccakkhātakakathā vippakatā hoti, paṇḍako tassaṃ parisāyaṃ nisinno hoti, paṇḍakakathā vippakatā hoti, bhikkhunidūsako tassaṃ parisāyaṃ nisinno hoti, bhikkhunidūsakakathā vippakatā hoti – ime kho, upāli, dasa pātimokkhaṭṭhapanā’’ti. Dutiyaṃ.",
      "english": "\"Venerable Sir, how many suspensions of the Pātimokkha recitation are there?\"\n\n\"Upāli, there are indeed ten suspensions of the Pātimokkha recitation. Which are the ten? When one who has committed a pārājika offense is seated in that assembly, and a discussion concerning a pārājika offense is pending; when one who is not fully ordained is seated in that assembly, and a discussion concerning an unordained person is pending; when one who has renounced the training is seated in that assembly, and a discussion concerning one who has renounced the training is pending; when a person with a sexually disqualifying condition is seated in that assembly, and a discussion concerning such a person is pending; when one who has defiled a bhikkhunī is seated in that assembly, and a discussion concerning one who has defiled a bhikkhunī is pending – these, Upāli, are the ten suspensions of the Pātimokkha recitation.\"",
      "sinhala": "‘‘ස්වාමීනි, පාතිමොක්ඛ ප්‍රකාශනය අත්හිටුවීම් කීයක් තිබේදැයි?’’ ‘‘උපාලි, පාතිමොක්ඛ ප්‍රකාශනය අත්හිටුවීම් දසයක් ඇත. ඒ දසය කවරේද? පාරාජිකා වූ පුද්ගලයෙක් එම සභාවෙහි වාඩි වී සිටී නම්, හෝ පාරාජිකාවක් පිළිබඳ කථාවක් විසඳා නොමැතිව පවතී නම්, උපසම්පදාව නොලැබූ පුද්ගලයෙක් එම සභාවෙහි වාඩි වී සිටී නම්, හෝ උපසම්පදාව නොලැබූ පුද්ගලයෙක් පිළිබඳ කථාවක් විසඳා නොමැතිව පවතී නම්, ශික්ෂාව අත්හළ පුද්ගලයෙක් එම සභාවෙහි වාඩි වී සිටී නම්, හෝ ශික්ෂාව අත්හළ පුද්ගලයෙක් පිළිබඳ කථාවක් විසඳා නොමැතිව පවතී නම්, පණ්ඩක පුද්ගලයෙක් එම සභාවෙහි වාඩි වී සිටී නම්, හෝ පණ්ඩක පුද්ගලයෙක් පිළිබඳ කථාවක් විසඳා නොමැතිව පවතී නම්, භික්ෂුණියක් දූෂණය කළ පුද්ගලයෙක් එම සභාවෙහි වාඩි වී සිටී නම්, හෝ භික්ෂුණියක් දූෂණය කළ පුද්ගලයෙක් පිළිබඳ කථාවක් විසඳා නොමැතිව පවතී නම් – උපාලි, මේවා පාතිමොක්ඛ ප්‍රකාශනය අත්හිටුවීම් දසයයි. ’’",
      "paliTitle": "Pātimokkhaṭṭhapanāsuttaṃ"
    },
    {
      "number": 33,
      "pali": "[cūḷava. 231] ‘‘Katihi nu kho, bhante, dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti; pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ [satthā sabyañjanā (sī.) evamuparipi] kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; ubhayāni kho panassa pātimokkhāni vitthārena svāgatāni honti suvibhattāni suppavattīni suvinicchitāni suttaso anubyañjanaso; vinaye kho pana ṭhito hoti asaṃhīro; paṭibalo hoti ubho atthapaccatthike saññāpetuṃ paññāpetuṃ nijjhāpetuṃ pekkhetuṃ pasādetuṃ; adhikaraṇasamuppādavūpasamakusalo hoti – adhikaraṇaṃ jānāti; adhikaraṇasamudayaṃ jānāti; adhikaraṇanirodhaṃ jānāti; adhikaraṇanirodhagāminiṃ paṭipadaṃ jānāti. Imehi kho, upāli, dasahi dhammehi samannāgato bhikkhu ubbāhikāya sammannitabbo’’ti. Tatiyaṃ.",
      "english": "“Venerable Sir, with how many qualities should a monk be endowed to be appointed to the committee for investigation and resolution?”\n\n“Upāli, a monk endowed with ten qualities should be appointed to the committee for investigation and resolution. Which ten? Here, Upāli, a monk is virtuous; he dwells restrained by the Pātimokkha code, complete in his conduct and resort, seeing danger even in the slightest faults, and he trains by undertaking the training rules. He is learned, a preserver of what he has heard, and an accumulator of what he has heard; those teachings that proclaim a holy life beautiful in the beginning, beautiful in the middle, beautiful in the end, with meaning and with phrasing, utterly complete and pure — such teachings are extensively heard by him, held in mind, familiarized through recitation, contemplated mentally, and thoroughly penetrated by understanding. Furthermore, both Pātimokkhas are well-learned by him in detail, well-analyzed, well-applied, and well-discerned, both in terms of their main rules and their detailed explanations. Moreover, he is established in the Vinaya, unwavering. He is capable of making both parties in a dispute understand, instruct them, scrutinize their claims, observe their conduct, and bring them to agreement. He is skilled in the arising and the subsiding of disputes – he understands the dispute, he understands the origin of the dispute, he understands the cessation of the dispute, and he understands the path leading to the cessation of the dispute. Upāli, a monk endowed with these ten qualities should be appointed to the committee for investigation and resolution.”",
      "sinhala": "වහන්ස, කවර ධර්‍මයන් කීයකින් සමන්වාගත වූ භික්ෂුවක් උබ්බාහිකා කර්මයෙන් (සංඝයා විසින්) පිළිගත යුතුද?\n\nඋපාලි, ධර්‍ම දහයකින් සමන්වාගත වූ භික්ෂුවක් උබ්බාහිකා කර්මයෙන් (සංඝයා විසින්) පිළිගත යුතුය. කවර දහයකින්ද? උපාලි, මෙහිලා භික්ෂුව සිල්වත් වේ; ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ වාසය කරයි; ආචාර-ගෝචර සම්පන්න වේ; අල්ප මාත්‍ර වූ වැරදි වලදී පවා භය දක්නා සුළු වූයේ, ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. බහුශ්‍රැත වේ; ඇසූ දේ දරන්නෙක්, ඇසූ දේ රැස්කරන්නෙක් වේ; යම් ඒ ධර්‍මයන් මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, මුළුමනින්ම සම්පූර්ණ වූ, පිරිසිදු බ්‍රහ්මචර්යාව ප්‍රකාශ කරන්නේද, එබඳු ධර්‍මයන් ඔහුට බහුශ්‍රැත වේ, දරාගන්නා ලද වේ, වචනයෙන් හුරු පුරුදු කරන ලද වේ, මනසින් විමසන ලද වේ, දෘෂ්ටියෙන් (නුවණින්) මැනවින් අවබෝධ කරන ලද වේ. තවද, දෙයාකාර වූ ප්‍රාතිමෝක්ෂයෝ ඔහුට විස්තර වශයෙන් මැනවින් හුරුපුරුදු කරන ලද වේ, මැනවින් විභාග කරන ලද වේ, මැනවින් ප්‍රකාශ කරන ලද වේ, මැනවින් විනිශ්චය කරන ලද වේ, සූත්‍ර වශයෙන්ද, අනු-ව්‍යංජන වශයෙන්ද (ඒවා සම්පූර්ණයෙන් අවබෝධ කර ඇත). තවද, විනයෙහි පිහිටියේ වේ, නොසැලෙන සුලු වේ. අර්ථ පාක්ෂිකයන් සහ ප්‍රති පාක්ෂිකයන් යන දෙපිරිසම අවබෝධ කරවීමට, ප්‍රඥාවෙන් පහදවා දීමට, නිවැරදි ලෙස මෙනෙහි කරවීමට, ගැඹුරින් විමසීමට සලස්වා ගැනීමට, පැහැදවීමට සමර්ථ වේ. අධිකරණ (සංඝයා අතර ඇතිවන නඩු කටයුතු/තර්ක විතර්ක) ඇතිවීම් සහ ඒවා සමනය කිරීම් පිළිබඳ දක්ෂ වේ – අධිකරණය දනී; අධිකරණයේ හටගැනීම දනී; අධිකරණයේ නැතිවීම දනී; අධිකරණය නැතිවීමට පමුණුවන ප්‍රතිපදාව දනී. උපාලි, මේ ධර්‍ම දහයෙන් සමන්වාගත වූ භික්ෂුවක් උබ්බාහිකා කර්මයෙන් (සංඝයා විසින්) පිළිගත යුතුය.",
      "paliTitle": "Ubbāhikāsuttaṃ"
    },
    {
      "number": 34,
      "pali": "‘‘Katihi nu kho, bhante, dhammehi samannāgatena bhikkhunā upasampādetabba’’nti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā upasampādetabbaṃ. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu; bahussuto hoti sutadharo sutasannicayo, ye te dhammā ādikalyāṇā majjhekalyāṇā pariyosānakalyāṇā sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ abhivadanti, tathārūpāssa dhammā bahussutā honti dhātā vacasā paricitā manasānupekkhitā diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle samādapetuṃ; paṭibalo hoti adhicitte samādapetuṃ; paṭibalo hoti adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā upasampādetabba’’nti. Catutthaṃ.",
      "english": "“Venerable Sir, by how many qualities should a bhikkhu be endowed to confer higher ordination?”\n\n“Upāli, a bhikkhu should be endowed with ten qualities to confer higher ordination. Which ten? Here, Upāli, a bhikkhu is virtuous, he dwells restrained by the Pātimokkha monastic code, accomplished in conduct and appropriate sphere of activity, seeing danger even in the slightest faults, and undertakes and trains in the training rules. He is learned, one who retains what he has heard and has accumulated what he has heard; those teachings which are beautiful in the beginning, beautiful in the middle, and beautiful in the end, which proclaim the utterly complete and perfectly pure holy life with both meaning and expression—such teachings are extensively heard by him, held in mind, familiar through verbal repetition, mentally examined, and thoroughly penetrated by insight. His knowledge of the Pātimokkha is thoroughly mastered in detail, well-analyzed, well-rehearsed, and well-investigated, both in terms of the rules and their accompanying explanations. He is capable of attending to the sick or of having them attended to. He is capable of dispelling discontent (with the holy life) or of having it dispelled. He is capable of dispelling arisen remorse in accordance with the Dhamma. He is capable of resolving arisen wrong views in accordance with the Dhamma. He is capable of encouraging others in higher virtue. He is capable of encouraging others in higher consciousness. He is capable of encouraging others in higher wisdom. Upāli, it is with these ten qualities that a bhikkhu should be endowed to confer higher ordination.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, භික්ෂුවක් විසින් කෙතෙක් ධර්මයන්ගෙන් සමන්වාගතව උපසම්පදා කළ යුතුද? උපාලි, භික්ෂුවක් විසින් දස ධර්මයන්ගෙන් සමන්වාගතව උපසම්පදා කළ යුතුය. ඒ දස ධර්ම කවරේද? උපාලි, මේ ශාසනයේ භික්ෂුව සීලවන්ත වේ. ඔහු ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාර සම්පන්න ගෝචර සම්පන්න වේ. අල්ප මාත්‍ර වූ වරදකදී පවා භය දකින සුළු වේ. ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. ඔහු බහුශ්‍රැත වේ. ඇසූ දේ දරාගත්තේය. ඇසූ දේ රැස්කරගත්තේය. යම් ඒ ධර්මයන් මුල යහපත් වූ, මැද යහපත් වූ, කෙළවර යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කෙරෙත්ද, එවැනි ධර්මයෝ ඔහුට බහුශ්‍රැත වෙති. ඒවා (ඔහු විසින්) ධාරණය කරනු ලැබ, වචනයෙන් පුරුදු කරනු ලැබ, මනසින් නිරතුරුව මෙනෙහි කරනු ලැබ, දෘෂ්ටියෙන් මැනවින් විනිවිද දකිනු ලැබූ ඒවා වෙති. තවද, ප්‍රාතිමෝක්ෂය ඔහුට විස්තර වශයෙන් මනාව පිළිගන්නා ලද්දේ (දන්නා ලද්දේ) වේ. මැනවින් බෙදා වෙන් කරනු ලැබ, මැනවින් ප්‍රගුණ කරනු ලැබ, සූත්‍ර ක්‍රමයෙන් ද අනුපද ක්‍රමයෙන් ද මැනවින් විනිශ්චය කරනු ලැබූවක් වේ. ඔහු ලෙඩුන්ට උපස්ථාන කිරීමට හෝ උපස්ථාන කරවීමට හෝ සමර්ථ වේ. අනභිරතිය (අසතුට, නොඇලීම) දුරු කිරීමට හෝ දුරු කරවීමට හෝ සමර්ථ වේ. උපන් කුක්කුච්චය (පසුතැවීම) ධර්මානුකූලව දුරු කිරීමට සමර්ථ වේ. උපන් දෘෂ්ටිගතය (මිත්‍යා දෘෂ්ටිය) ධර්මානුකූලව නිරාකරණය කිරීමට සමර්ථ වේ. අධිශීලයට (උසස් සීලයට) සමාදන් කරවීමට සමර්ථ වේ. අධිචිත්තයට (උසස් සමාධියට) සමාදන් කරවීමට සමර්ථ වේ. අධිප්‍රඥාවට (උසස් ප්‍රඥාවට) සමාදන් කරවීමට සමර්ථ වේ. උපාලි, මෙවැනි දස ධර්මයන්ගෙන් සමන්වාගත භික්ෂුවක් විසින් උපසම්පදා කළ යුතුය.",
      "paliTitle": "Upasampadāsuttaṃ"
    },
    {
      "number": 35,
      "pali": "‘‘Katihi nu kho, bhante, dhammehi samannāgatena bhikkhunā nissayo dātabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā nissayo dātabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle…pe… adhicitte… adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā nissayo dātabbo’’ti. Pañcamaṃ.",
      "english": "“Venerable Sir, by how many qualities should a bhikkhu be endowed to act as a preceptor?”\n\n“Upāli, a bhikkhu endowed with ten qualities should act as a preceptor. Which ten?\n\nHere, Upāli, a bhikkhu is virtuous, living restrained by the Pātimokkha rules, perfect in conduct and resort, seeing danger in the slightest fault, he trains himself by undertaking the training rules. He is learned, remembering what he has heard, accumulating what he has heard. Those teachings that are good in the beginning, good in the middle, good in the end, with the right meaning and phrasing, proclaiming a perfectly complete and purified holy life – such teachings he has learned much of, remembered, recited, pondered, and thoroughly penetrated with wisdom. His Pātimokkha is well-mastered in detail, well-analyzed, well-practiced, well-understood, both according to the discourses and their implications. He is capable of attending to the sick or of having them attended to. He is capable of quelling discontent or of having it quelled (in others). He is capable of dispelling any arisen remorse according to the Dhamma. He is capable of refuting any arisen wrong view according to the Dhamma. He is capable of encouraging others to undertake higher virtue, higher mind, and higher wisdom.\n\nUpāli, a bhikkhu endowed with these ten qualities should act as a preceptor.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, කවර ධර්‍ම කීයකින් සමන්විත භික්ෂුවක් විසින් නම් නිස්සය දිය යුතුද?\n\nඋපාළි, දස ධර්‍මයකින් සමන්විත භික්ෂුවක් විසින් නිස්සය දිය යුතුය. කවර දසයකින්ද?\n\nඋපාළි, මේ ශාසනයෙහි භික්ෂුවක් ශීලවන්ත වෙයි. ...පෙ... ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. බහුශ්‍රැත වෙයි. ...පෙ... දෘෂ්ටියෙන් මනාකොට විනිවිද දකියි. පාතිමොක්ඛය ද ඔහුට සවිස්තරව මනාකොට ප්‍රගුණ කරන ලද්දක් ද, මනාකොට විභාග කරන ලද්දක් ද, මනාකොට ප්‍රවෘත්ත කරන ලද්දක් ද, සූත්‍ර වශයෙන් ද අනුපද වශයෙන් ද මනාකොට විනිශ්චය කරන ලද්දක් ද වෙයි. රෝගී වූවන්ට උපස්ථාන කිරීමට හෝ උපස්ථාන කරවීමට හෝ සමර්ථ වෙයි. අනභිරතිය (සසුනෙහි නොසතුටු බව) තමාගෙන් දුරු කර ගැනීමට හෝ අනුන් ලවා දුරු කරවීමට හෝ සමර්ථ වෙයි. ඇතිවූ කුක්කුච්චය (පසුතැවීම) ධර්‍මානුකූලව දුරු කිරීමට සමර්ථ වෙයි. ඇතිවූ දෘෂ්ටිගතය (මිථ්‍යා දෘෂ්ටිය) ධර්‍මානුකූලව වෙන් කර දැක්වීමට සමර්ථ වෙයි. අධිශීලයෙහි ...පෙ... අධිචිත්තයෙහි ද, අධිප්‍රඥාවෙහි ද අනුන් සමාදන් කරවීමට සමර්ථ වෙයි.\n\nඋපාළි, මේ දස ධර්‍මයෙන් සමන්විත භික්ෂුවක් විසින් නිස්සය දිය යුතුය.",
      "paliTitle": "Nissayasuttaṃ"
    },
    {
      "number": 36,
      "pali": "‘‘Katihi nu kho, bhante, dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo’’ti? ‘‘Dasahi kho, upāli, dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo. Katamehi dasahi? Idhupāli, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu; bahussuto hoti…pe… diṭṭhiyā suppaṭividdhā; pātimokkhaṃ kho panassa vitthārena svāgataṃ hoti suvibhattaṃ suppavattaṃ suvinicchitaṃ suttaso anubyañjanaso; paṭibalo hoti gilānaṃ upaṭṭhātuṃ vā upaṭṭhāpetuṃ vā; paṭibalo hoti anabhiratiṃ vūpakāsetuṃ vā vūpakāsāpetuṃ vā; paṭibalo hoti uppannaṃ kukkuccaṃ dhammato vinodetuṃ; paṭibalo hoti uppannaṃ diṭṭhigataṃ dhammato vivecetuṃ; paṭibalo hoti adhisīle samādapetuṃ; paṭibalo hoti adhicitte samādapetuṃ; paṭibalo hoti adhipaññāya samādapetuṃ. Imehi kho, upāli, dasahi dhammehi samannāgatena bhikkhunā sāmaṇero upaṭṭhāpetabbo’’ti. Chaṭṭhaṃ.",
      "english": "“Venerable Sir, by how many qualities should a monk be endowed to take a novice under his charge?”\n\n“Upāli, a monk should be endowed with ten qualities to take a novice under his charge. Which ten? Here, Upāli, a monk is virtuous, living restrained by the rules of the monastic code, perfect in conduct and resort, seeing danger in the slightest faults, and undertaking and training in the training rules; he is learned, retaining what he has heard and accumulating what he has heard; those teachings which are good in the beginning, good in the middle, and good in the end, with their meaning and phrasing, proclaiming a perfectly complete and purified holy life—such teachings are much heard by him, retained, recited, pondered in mind, and well-penetrated by insight; and moreover, the Pātimokkha is well-understood by him in detail, well-analyzed, well-established, and well-discerned both according to its main principles and its detailed implications; he is capable of attending to the sick or of having others attend to them; he is capable of dispelling discontent or of having it dispelled; he is capable of dispelling any arisen remorse in accordance with the Dhamma; he is capable of clarifying any arisen wrong view in accordance with the Dhamma; he is capable of encouraging (others) in higher virtue; he is capable of encouraging (others) in higher concentration; he is capable of encouraging (others) in higher wisdom. By these ten qualities, Upāli, a monk should be endowed to take a novice under his charge.”",
      "sinhala": "‘‘භාග\\u200D්‍යවතුන් වහන්ස, කවර ධර්ම කීයකින් සමන්වාගත භික්ෂූන් වහන්සේ විසින් සාමණේර නමක් භාර ගත යුතුද?’’\n\n‘‘උපාලි, ධර්ම දහයකින් සමන්වාගත භික්ෂූන් වහන්සේ විසින් සාමණේර නමක් භාර ගත යුතුය. ඒ කවර දහයකින්ද? උපාලි, මෙහිලා භික්ෂූන් වහන්සේ සීලවන්ත වෙති. එනම්, ප\\u200D්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව, ආචාර ගෝචර සම්පන්නව, ස්වල්ප වූ හෝ වරදක භය දකිමින්, ශික්ෂා පද සමාදන්ව හික්මෙති; බහුශ\\u200D්‍රැත වෙති. එනම්, බොහෝ දේ අසා, ඒවා දරා, වචනයෙන් රැස් කොට, සිතින් විමසා, දෘෂ්ටියෙන් මනාව විනිවිද දකිති; තවද, උන්වහන්සේ විසින් ප\\u200D්‍රාතිමෝක්ෂය විස්තර වශයෙන් මනාව උගෙන, මනාව විභාග කොට, මනාව ප\\u200D්‍රගුණ කොට, සූත්‍ර වශයෙන් ද, අනුපද වශයෙන් ද මනාව තීරණය කොට ඇත; රෝගී වූවන්ට උපස්ථාන කිරීමට හෝ උපස්ථාන කරවීමට සමර්ථ වෙති; අරතිය (අසතුට) දුරු කිරීමට හෝ දුරු කරවීමට සමර්ථ වෙති; හටගත් කුක්කුච්චය (කලකිරීම/පසුතැවීම) ධර්මානුකූලව දුරු කිරීමට සමර්ථ වෙති; හටගත් දෘෂ්ටිගතය (වැරදි දැක්ම) ධර්මානුකූලව විසඳා ගැනීමට සමර්ථ වෙති; අධිසීලයෙහි සමාදන් කරවීමට සමර්ථ වෙති; අධිචිත්තයෙහි සමාදන් කරවීමට සමර්ථ වෙති; අධිප\\u200D්‍රඥාවෙහි සමාදන් කරවීමට සමර්ථ වෙති. උපාලි, මේ ධර්ම දහයකින් සමන්වාගත භික්ෂූන් වහන්සේ විසින් සාමණේර නමක් භාර ගත යුතුය.’’",
      "paliTitle": "Sāmaṇerasuttaṃ"
    },
    {
      "number": 37,
      "pali": "‘‘‘Saṅghabhedo saṅghabhedo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho bhinno hotī’’ti? ‘‘Idhupāli, bhikkhū adhammaṃ dhammoti dīpenti, dhammaṃ adhammoti dīpenti, avinayaṃ vinayoti dīpenti, vinayaṃ avinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi avakassanti apakassanti āveni [āveniṃ (cūḷava. 352) āveṇi, āveṇikaṃ (tattheva adholipi)] kammāni karonti āveni pātimokkhaṃ uddisanti. Ettāvatā kho, upāli, saṅgho bhinno hotī’’ti. Sattamaṃ.",
      "english": "“Lord, it is said, ‘A schism in the Saṅgha, a schism in the Saṅgha.’ To what extent, Lord, is the Saṅgha considered to be split?”\n\n“Here, Upāli, monks declare non-Dhamma as Dhamma, and Dhamma as non-Dhamma; they declare non-Vinaya as Vinaya, and Vinaya as non-Vinaya; they declare what was not spoken or uttered by the Tathāgata as spoken and uttered by the Tathāgata, and what was spoken and uttered by the Tathāgata as not spoken or uttered by the Tathāgata; they declare what was not practiced by the Tathāgata as practiced by the Tathāgata, and what was practiced by the Tathāgata as not practiced by the Tathāgata; they declare what was not laid down by the Tathāgata as laid down by the Tathāgata, and what was laid down by the Tathāgata as not laid down by the Tathāgata. By these ten matters, they draw themselves apart and pull themselves away, performing separate acts and reciting a separate Pātimokkha. To this extent, Upāli, is the Saṅgha considered to be split.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, 'සංඝභේදය, සංඝභේදය' යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර කරුණකින්ද සංඝයා වහන්සේලා භේදයට පත්වන්නේ?\n\nඋපාලි, මෙහිදී භික්ෂූන් වහන්සේලා අධර්මය ධර්මය ලෙස ප්‍රකාශ කරති; ධර්මය අධර්මය ලෙස ප්‍රකාශ කරති; අවිනය විනය ලෙස ප්‍රකාශ කරති; විනය අවිනය ලෙස ප්‍රකාශ කරති; තථාගතයන් වහන්සේ විසින් නොකියන ලද, නොවදාරණ ලද දේ තථාගතයන් වහන්සේ විසින් කියන ලද, වදාරණ ලද දේ ලෙස ප්‍රකාශ කරති; තථාගතයන් වහන්සේ විසින් කියන ලද, වදාරණ ලද දේ තථාගතයන් වහන්සේ විසින් නොකියන ලද, නොවදාරණ ලද දේ ලෙස ප්‍රකාශ කරති; තථාගතයන් වහන්සේ විසින් නොපැවති දේ තථාගතයන් වහන්සේ විසින් පැවති දේ ලෙස ප්‍රකාශ කරති; තථාගතයන් වහන්සේ විසින් පැවති දේ තථාගතයන් වහන්සේ විසින් නොපැවති දේ ලෙස ප්‍රකාශ කරති; තථාගතයන් වහන්සේ විසින් නොපනවන ලද දේ තථාගතයන් වහන්සේ විසින් පනවන ලද දේ ලෙස ප්‍රකාශ කරති; තථාගතයන් වහන්සේ විසින් පනවන ලද දේ තථාගතයන් වහන්සේ විසින් නොපනවන ලද දේ ලෙස ප්‍රකාශ කරති. ඔවුහු මේ දස කරුණු මගින් වෙන් කරති, වෙනම කර්ම සිදු කරති, වෙනම ප්‍රාතිමෝක්ෂය පාඨනය කරති. උපාලි, මේ කරුණු සමූහය හේතුවෙන් සංඝයා වහන්සේලා භේදයට පත්වන්නේය.",
      "paliTitle": "Saṅghabhedasuttaṃ"
    },
    {
      "number": 38,
      "pali": "[cūḷava. 353] ‘‘‘Saṅghasāmaggī saṅghasāmaggī’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho samaggo hotī’’ti? ‘‘Idhupāli, bhikkhū adhammaṃ adhammoti dīpenti, dhammaṃ dhammoti dīpenti, avinayaṃ avinayoti dīpenti, vinayaṃ vinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi na avakassanti na apakassanti na āveni kammāni karonti na āveni pātimokkhaṃ uddisanti. Ettāvatā kho, upāli, saṅgho samaggo hotī’’ti. Aṭṭhamaṃ.",
      "english": "\"Venerable Sir, 'unity of the Sangha, unity of the Sangha' is spoken of. To what extent, Venerable Sir, is the Sangha unified?\"\n\n\"Here, Upāli, monks declare what is not Dharma as not Dharma, and what is Dharma as Dharma. They declare what is not Vinaya as not Vinaya, and what is Vinaya as Vinaya. They declare what was not spoken or uttered by the Tathāgata as not spoken or uttered by the Tathāgata. They declare what was spoken and uttered by the Tathāgata as spoken and uttered by the Tathāgata. They declare what was not practiced by the Tathāgata as not practiced by the Tathāgata. They declare what was practiced by the Tathāgata as practiced by the Tathāgata. They declare what was not laid down by the Tathāgata as not laid down by the Tathāgata. They declare what was laid down by the Tathāgata as laid down by the Tathāgata. Regarding these ten points, they do not retract or diverge from them; they do not perform isolated monastic acts, nor do they recite the Pātimokkha separately. To this extent, Upāli, the Sangha is unified.\"",
      "sinhala": "‘‘ස්වාමීනි, ‘සංඝසාමග්‍රිය, සංඝසාමග්‍රිය’ යි කියනු ලැබේ. ස්වාමීනි, කෙතෙක් අයුරින් සංඝයා සමගියට පත් වෙත්ද?’’\n\n‘‘උපාලි, මෙහි භික්ෂූන් වහන්සේලා අධර්මය අධර්මය යයි ප්‍u200Dරකාශ කරති, ධර්මය ධර්මය යයි ප්‍u200Dරකාශ කරති, අවිනය අවිනය යයි ප්‍u200Dරකාශ කරති, විනය විනය යයි ප්‍u200Dරකාශ කරති, තථාගතයන් වහන්සේ විසින් නොභාෂිත, නොදේශිත දේ තථාගතයන් වහන්සේ විසින් නොභාෂිත, නොදේශිත දේ යයි ප්‍u200Dරකාශ කරති, තථාගතයන් වහන්සේ විසින් භාෂිත, දේශිත දේ තථාගතයන් වහන්සේ විසින් භාෂිත, දේශිත දේ යයි ප්‍u200Dරකාශ කරති, තථාගතයන් වහන්සේ විසින් අනාචීර්ණ දේ අනාචීර්ණ දේ යයි ප්‍u200Dරකාශ කරති, තථාගතයන් වහන්සේ විසින් ආචීර්ණ දේ ආචීර්ණ දේ යයි ප්‍u200Dරකාශ කරති, තථාගතයන් වහන්සේ විසින් අප්‍u200Dරඥප්ත දේ අප්‍u200Dරඥප්ත දේ යයි ප්‍u200Dරකාශ කරති, තථාගතයන් වහන්සේ විසින් ප්‍u200Dරඥප්ත දේ ප්‍u200Dරඥප්ත දේ යයි ප්‍u200Dරකාශ කරති.\n\nඔවුහු මේ දස වස්තූන්ගෙන් නොඅපසරණය වෙත්, නොපසුබසිත්, තනි කම් නොකරත්, තනි වූ පාතිමොක්ඛයක් උදෙසා නොපවසත්. උපාලි, මෙපමණකින් සංඝයා සමගියට පත් වෙති.’’ අටවැනියි.",
      "paliTitle": "Saṅghasāmaggīsuttaṃ"
    },
    {
      "number": 39,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘‘saṅghabhedo saṅghabhedo’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho bhinno hotī’’ti? ‘‘Idhānanda, bhikkhū adhammaṃ dhammoti dīpenti, dhammaṃ adhammoti dīpenti, avinayaṃ vinayoti dīpenti…pe… paññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi avakassanti apakassanti āveni kammāni karonti āveni pātimokkhaṃ uddisanti. Ettāvatā kho, ānanda, saṅgho bhinno hotī’’ti. ‘‘Samaggaṃ pana, bhante, saṅghaṃ bhinditvā kiṃ so pasavatī’’ti? ‘‘Kappaṭṭhikaṃ, ānanda, kibbisaṃ pasavatī’’ti. ‘‘Kiṃ pana, bhante, kappaṭṭhikaṃ kibbisa’’nti? ‘‘Kappaṃ, ānanda, nirayamhi paccatīti – ‘‘Āpāyiko nerayiko, kappaṭṭho saṅghabhedako; Vaggarato adhammaṭṭho, yogakkhemā padhaṃsati; Saṅghaṃ samaggaṃ bhinditvā [bhetvāna (sī. syā.), bhitvāna (ka.) cūḷava. 354; itivu. 18; kathāva. 657] kappaṃ nirayamhi paccatī’’ti. navamaṃ;",
      "english": "Then Venerable Ānanda approached the Blessed One, and having approached and paid homage to the Blessed One, he sat down to one side. While seated to one side, Venerable Ānanda said this to the Blessed One: \"Venerable sir, 'a schism in the Saṅgha, a schism in the Saṅgha' is spoken of. To what extent, venerable sir, does the Saṅgha become split?\"\n\n\"Here, Ānanda, monastics declare what is not Dhamma to be Dhamma; they declare what is Dhamma to be not Dhamma; they declare what is not Vinaya to be Vinaya; they declare what is Vinaya to be not Vinaya; they declare what is unsuitable to be suitable; they declare what is suitable to be unsuitable; they declare what is no offense to be an offense; they declare what is an offense to be no offense; they declare what is minor to be major; they declare what is major to be minor; and they declare what was laid down by the Tathāgata to be not laid down by the Tathāgata, and what was not laid down by the Tathāgata to be laid down by the Tathāgata. They, by means of these ten grounds, draw away and separate, perform separate formal acts of the Saṅgha, and recite a separate Pātimokkha. To this extent, Ānanda, the Saṅgha becomes split.\"\n\n\"But venerable sir, having split a united Saṅgha, what does one generate?\"\n\n\"Ānanda, one generates an offense that endures for an eon.\"\n\n\"But what, venerable sir, is an offense that endures for an eon?\"\n\n\"Ānanda, for an eon one is tormented in hell.\n\nHaving a woeful destination, reborn in hell,\nThe schismatic endures for an eon.\nDelighting in factions, established in what is not Dhamma,\nHe obstructs the security from bondage.\nHaving split a united Saṅgha,\nFor an eon he is tormented in hell.\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹී, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පසෙකින් වාඩි වූ සේක. එකත්පසෙකින් වැඩහුන් ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසු සේක: \"වහන්ස, 'සංඝභේදය, සංඝභේදය' යැයි කියනු ලැබේ. වහන්ස, කෙතරම් පමණකින් නම් සංඝයා වහන්සේලා බිඳී යත්ද?\" \"ආනන්දය, මෙහිලා භික්ෂූන් අධර්මය ධර්මය යැයි දෙසත්, ධර්මය අධර්මය යැයි දෙසත්, අවිනය විනය යැයි දෙසත්, තථාගතයන් වහන්සේ විසින් පනවන ලද දේ නොපනවන ලද යැයි දෙසත්. ඔවුහු මේ දස වස්තූන් හේතු කොටගෙන (සංඝයාගෙන්) ඈත් වෙත්, වෙන් වෙත්, වෙනම සංඝ කර්ම කරත්, වෙනම පාතිමොක්ඛය උදෙසත්. ආනන්දය, මෙපමණකින් සංඝයා වහන්සේ බිඳී යයි.\"\n\n\"එසේ නමුත්, වහන්ස, සමගි වූ සංඝයා වහන්සේ බිඳහෙලා ඔහු කුමක් උපදවයිද?\" \"ආනන්දය, ඔහු කල්පයක් පවතින මහත් පාප කර්මයක් උපදවයි.\"\n\n\"වහන්ස, කල්පයක් පවතින මහත් පාප කර්මය යනු කුමක්ද?\" \"ආනන්දය, ඔහු කල්පයක් නිරයේ පැසේ.\"\n\nඅපායගාමී වේ, නිරයට යන්නේය, කල්පයක් (නිරයේ) පවතියි, සංඝභේදය කරන්නා; පිරිසකට ඇලී අධර්මයෙහි පිහිටා සිටින්නා, යෝගක්ෂේමයෙන් (නිවනින්) පහව යයි. සමගි වූ සංඝයා බිඳහෙලා කල්පයක් නිරයේ පැසේ.",
      "paliTitle": "Paṭhamaānandasuttaṃ"
    },
    {
      "number": 40,
      "pali": "‘‘‘Saṅghasāmaggī saṅghasāmaggī’ti, bhante, vuccati. Kittāvatā nu kho, bhante, saṅgho samaggo hotī’’ti? ‘‘Idhānanda, bhikkhū adhammaṃ adhammoti dīpenti, dhammaṃ dhammoti dīpenti, avinayaṃ avinayoti dīpenti, vinayaṃ vinayoti dīpenti, abhāsitaṃ alapitaṃ tathāgatena abhāsitaṃ alapitaṃ tathāgatenāti dīpenti, bhāsitaṃ lapitaṃ tathāgatena bhāsitaṃ lapitaṃ tathāgatenāti dīpenti, anāciṇṇaṃ tathāgatena anāciṇṇaṃ tathāgatenāti dīpenti, āciṇṇaṃ tathāgatena āciṇṇaṃ tathāgatenāti dīpenti, apaññattaṃ tathāgatena apaññattaṃ tathāgatenāti dīpenti, paññattaṃ tathāgatena paññattaṃ tathāgatenāti dīpenti. Te imehi dasahi vatthūhi na avakassanti na apakassanti na āveni kammāni karonti na āveni pātimokkhaṃ uddisanti. Ettāvatā kho, ānanda, saṅgho samaggo hotī’’ti. ‘‘Bhinnaṃ pana, bhante, saṅghaṃ samaggaṃ katvā kiṃ so pasavatī’’ti? ‘‘Brahmaṃ, ānanda, puññaṃ pasavatī’’ti. ‘‘Kiṃ pana, bhante, brahmaṃ puñña’’nti? ‘‘Kappaṃ, ānanda, saggamhi modatīti – ‘‘Sukhā saṅghassa sāmaggī, samaggānañca anuggaho; Samaggarato dhammaṭṭho, yogakkhemā na dhaṃsati; Saṅghaṃ samaggaṃ katvāna, kappaṃ saggamhi modatī’’ti. dasamaṃ; ",
      "english": "\"Unity of the Sangha, unity of the Sangha,\" venerable sir, is what is said. How then, venerable sir, is the Sangha unified?\" \"Here, Ānanda, bhikkhus declare what is not Dhamma as 'not Dhamma,' what is Dhamma as 'Dhamma,' what is not Vinaya as 'not Vinaya,' what is Vinaya as 'Vinaya,' what was not spoken or uttered by the Tathāgata as 'not spoken or uttered by the Tathāgata,' what was spoken or uttered by the Tathāgata as 'spoken or uttered by the Tathāgata,' what was not practiced by the Tathāgata as 'not practiced by the Tathāgata,' what was practiced by the Tathāgata as 'practiced by the Tathāgata,' what was not laid down by the Tathāgata as 'not laid down by the Tathāgata,' and what was laid down by the Tathāgata as 'laid down by the Tathāgata.' They, by means of these ten matters, neither draw back nor pull away; they neither perform separate formal acts nor recite the Pātimokkha separately. To this extent, Ānanda, is the Sangha unified.\"\n\n\"And what does one generate, venerable sir, by unifying a Sangha that has been divided?\" \"One generates sublime merit, Ānanda.\" \"And what, venerable sir, is this sublime merit?\" \"For an eon, Ānanda, one rejoices in a heavenly realm:\n\nThe unity of the Sangha is happiness, and support for the unified is happiness.\nOne who delights in unity, established in the Dhamma, does not decline from security from bondage.\nHaving made the Sangha unified, one rejoices in a heavenly realm for an eon.\"",
      "sinhala": "භාග්‍යවතුන් වහන්ස, 'සංඝ සාමග්‍රිය, සංඝ සාමග්‍රිය' කියා කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කවර ප‍්‍රමාණයකින්ද සංඝයා වහන්සේ සමගි වන්නේ?\n\nආනන්දය, මෙහිලා භික්ෂූන් වහන්සේලා අධර්මය අධර්මය යැයි විග‍්‍රහ කරති. ධර්මය ධර්මය යැයි විග‍්‍රහ කරති. අවිනය අවිනය යැයි විග‍්‍රහ කරති. විනය විනය යැයි විග‍්‍රහ කරති. තථාගතයන් වහන්සේ විසින් නොකියන ලද, නොදෙසන ලද දේ තථාගතයන් වහන්සේ විසින් නොකියන ලද, නොදෙසන ලද යැයි විග‍්‍රහ කරති. තථාගතයන් වහන්සේ විසින් කියන ලද, දෙසන ලද දේ තථාගතයන් වහන්සේ විසින් කියන ලද, දෙසන ලද යැයි විග‍්‍රහ කරති. තථාගතයන් වහන්සේ විසින් පුරුදු නොකරන ලද දේ තථාගතයන් වහන්සේ විසින් පුරුදු නොකරන ලද යැයි විග‍්‍රහ කරති. තථාගතයන් වහන්සේ විසින් පුරුදු කරන ලද දේ තථාගතයන් වහන්සේ විසින් පුරුදු කරන ලද යැයි විග‍්‍රහ කරති. තථාගතයන් වහන්සේ විසින් නොපණවන ලද දේ තථාගතයන් වහන්සේ විසින් නොපණවන ලද යැයි විග‍්‍රහ කරති. තථාගතයන් වහන්සේ විසින් පණවන ලද දේ තථාගතයන් වහන්සේ විසින් පණවන ලද යැයි විග‍්‍රහ කරති. ඔවුන් මේ දස වස්තූන් සම්බන්ධයෙන් පසුබසින්නේ නැත, පසකට කරන්නේ නැත, වෙනම සංඝ කර්ම නොකරති, වෙනම ප‍්‍රාතිමෝක්ෂය උදෙසා නොපවත්වති. ආනන්දය, මේ ප‍්‍රමාණයෙන් සංඝයා වහන්සේ සමගි වන්නේය.\n\nභාග්‍යවතුන් වහන්ස, භින්න වූ සංඝයා වහන්සේ සමගි කරවීමෙන් කුමන ප‍්‍රතිඵලයක් ගෙන දෙන්නේද?\nආනන්දය, එය මහත් පිනක් ඇතිකරයි.\n\nභාග්‍යවතුන් වහන්ස, මහත් පින යනු කුමක්ද?\nආනන්දය, එය කල්පයක් මුළුල්ලේ දෙව්ලොවදී සතුටු වීමකි.\n\nසංඝයා වහන්සේගේ සමගිය සුවය ගෙන දෙයි.\nසමගි වූවන්ට අනුග‍්‍රහ කිරීමද සුවය ගෙන දෙයි.\nසමගියෙහි ඇලුණු, ධර්මයෙහි පිහිටි තැනැත්තා, යෝගක්ෂේමයෙන් නොපිරිහෙයි.\nසංඝයා වහන්සේ සමගි කරවා, කල්පයක් මුළුල්ලේ දෙව්ලොවදී සතුටු වෙයි.",
      "paliTitle": "Dutiyaānandasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Upālivaggo catuttho. Tassuddānaṃ – Upāli ṭhapanā ubbāho, upasampadanissayā; Sāmaṇero ca dve bhedā, ānandehi pare duveti.",
    "english": "",
    "sinhala": ""
  }
}