{
  "id": "an10.6",
  "title": {
    "pali": "Sacittavaggo",
    "english": "The Chapter on One's Own Mind",
    "sinhala": "තමාගේ සිත පිළිබඳ වර්ගය"
  },
  "sections": [
    {
      "number": 51,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘No ce, bhikkhave, bhikkhu paracittapariyāyakusalo hoti, atha ‘sacittapariyāyakusalo bhavissāmī’ti [bhavissāmāti (syā.)] – evañhi vo, bhikkhave, sikkhitabbaṃ. ‘‘Kathañca, bhikkhave, bhikkhu sacittapariyāyakusalo hoti? Seyyathāpi, bhikkhave, itthī vā puriso vā daharo yuvā maṇḍanakajātiko ādāse vā parisuddhe pariyodāte acche vā udakapatte sakaṃ mukhanimittaṃ paccavekkhamāno sace tattha passati rajaṃ vā aṅgaṇaṃ vā, tasseva rajassa vā aṅgaṇassa vā pahānāya vāyamati. No ce tattha passati rajaṃ vā aṅgaṇaṃ vā, tenevattamano hoti paripuṇṇasaṅkappo – ‘lābhā vata me, parisuddhaṃ vata me’ti. Evamevaṃ kho, bhikkhave, bhikkhuno paccavekkhaṇā bahukārā [bhikkhu paccavekkhamāno bahukāro (ka.)] hoti kusalesu dhammesu – ‘abhijjhālu nu kho bahulaṃ viharāmi, anabhijjhālu nu kho bahulaṃ viharāmi, byāpannacitto nu kho bahulaṃ viharāmi, abyāpannacitto nu kho bahulaṃ viharāmi, thinamiddhapariyuṭṭhito nu kho bahulaṃ viharāmi, vigatathinamiddho nu kho bahulaṃ viharāmi, uddhato nu kho bahulaṃ viharāmi, anuddhato nu kho bahulaṃ viharāmi, vicikiccho nu kho bahulaṃ viharāmi, tiṇṇavicikiccho nu kho bahulaṃ viharāmi, kodhano nu kho bahulaṃ viharāmi, akkodhano nu kho bahulaṃ viharāmi, saṃkiliṭṭhacitto nu kho bahulaṃ viharāmi, asaṃkiliṭṭhacitto nu kho bahulaṃ viharāmi, sāraddhakāyo nu kho bahulaṃ viharāmi, asāraddhakāyo nu kho bahulaṃ viharāmi, kusīto nu kho bahulaṃ viharāmi, āraddhavīriyo nu kho bahulaṃ viharāmi, asamāhito nu kho bahulaṃ viharāmi, samāhito nu kho bahulaṃ viharāmī’ti. ‘‘Sace, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhijjhālu bahulaṃ viharāmi, byāpannacitto bahulaṃ viharāmi, thinamiddhapariyuṭṭhito bahulaṃ viharāmi, uddhato bahulaṃ viharāmi, vicikiccho bahulaṃ viharāmi, kodhano bahulaṃ viharāmi, saṃkiliṭṭhacitto bahulaṃ viharāmi, sāraddhakāyo bahulaṃ viharāmi, kusīto bahulaṃ viharāmi, asamāhito bahulaṃ viharāmī’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā. Tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya. Evamevaṃ kho tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘anabhijjhālu bahulaṃ viharāmi, abyāpannacitto bahulaṃ viharāmi, vigatathinamiddho bahulaṃ viharāmi, anuddhato bahulaṃ viharāmi, tiṇṇavicikiccho bahulaṃ viharāmi, akkodhano bahulaṃ viharāmi, asaṃkiliṭṭhacitto bahulaṃ viharāmi, asāraddhakāyo bahulaṃ viharāmi, āraddhavīriyo bahulaṃ viharāmi, samāhito bahulaṃ viharāmī’ti, tena, bhikkhave, bhikkhunā tesuyeva kusalesu dhammesu patiṭṭhāya uttari āsavānaṃ khayāya yogo karaṇīyo’’ti. Paṭhamaṃ.",
      "english": "At one time, the Blessed One was dwelling at Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One addressed the monks, saying, “Monks!” Those monks replied to the Blessed One, “Venerable Sir.” The Blessed One then said: “If, monks, a monk is not skilled in discerning the minds of others, then he should resolve, ‘I will be skilled in discerning my own mind.’ This is how you should train, monks. And how, monks, is a monk skilled in discerning his own mind? Just as, monks, a woman or a man, young, youthful, and fond of adornment, would examine their own reflection in a clean, brightly polished mirror or in a clear bowl of water. If they see any dust or blemish there, they exert themselves to remove that very dust or blemish. If they do not see any dust or blemish there, they are pleased by that, their aspiration fulfilled, thinking, ‘How fortunate I am! How pure I am!’ In the same way, monks, a monk’s self-examination is very helpful concerning wholesome states: ‘Do I frequently dwell with covetousness, or without covetousness? Do I frequently dwell with ill will, or without ill will? Do I frequently dwell overwhelmed by sloth and torpor, or with sloth and torpor banished? Do I frequently dwell restless, or not restless? Do I frequently dwell with doubt, or with doubt overcome? Do I frequently dwell with anger, or without anger? Do I frequently dwell with a defiled mind, or with an undefiled mind? Do I frequently dwell with an agitated body, or with a tranquil body? Do I frequently dwell lazy, or with aroused energy? Do I frequently dwell unconcentrated, or concentrated?’\n\n“If, monks, a monk, while examining himself, knows: ‘I frequently dwell with covetousness, I frequently dwell with ill will, I frequently dwell overwhelmed by sloth and torpor, I frequently dwell restless, I frequently dwell with doubt, I frequently dwell with anger, I frequently dwell with a defiled mind, I frequently dwell with an agitated body, I frequently dwell lazy, I frequently dwell unconcentrated,’ then, monks, that monk should apply extreme desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome states. Just as, monks, if one’s clothes were on fire or one’s head were on fire, one would apply extreme desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension to extinguish that very fire on the clothes or head. In the same way, monks, that monk should apply extreme desire, effort, zeal, enthusiasm, indefatigability, mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome states.\n\n“But if, monks, a monk, while examining himself, knows: ‘I frequently dwell without covetousness, I frequently dwell without ill will, I frequently dwell with sloth and torpor banished, I frequently dwell not restless, I frequently dwell with doubt overcome, I frequently dwell without anger, I frequently dwell with an undefiled mind, I frequently dwell with a tranquil body, I frequently dwell with aroused energy, I frequently dwell concentrated,’ then, monks, that monk should, having established himself in those very wholesome states, make further effort for the destruction of the taints.”",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයේ වැඩවසන සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් අමතා “මහණෙනි” යි වදාළ සේක. “වහන්සැ” යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහණෙනි, යම් හෙයකින් භික්ෂුවක් අනුන්ගේ සිත් පිළිබඳ දක්ෂයෙක් නොවන්නේ නම්, 'මම තමාගේ සිත පිළිබඳ දක්ෂ වන්නෙමි' – මහණෙනි, මෙලෙසින්ම ඔබ විසින් හික්මිය යුතු ය.\n\n“මහණෙනි, භික්ෂුවක් තමාගේ සිත පිළිබඳ දක්ෂයෙක් වන්නේ කෙසේ ද? මහණෙනි, යම් සේ තරුණ, ලස්සන වීමට කැමති ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ පිරිසිදු වූ, මනා කොට ඔප දමන ලද කැඩපතක හෝ පැහැදිලි දිය බඳුනක හෝ තම මුහුණේ ස්වරූපය විමසා බලන විට එහි දූවිල්ලක් හෝ අපිරිසිදු දෙයක් දුටුවහොත්, ඒ දූවිල්ල හෝ අපිරිසිදුකම ඉවත් කිරීමට වෑයම් කරන්නේ ද; එහි දූවිල්ලක් හෝ අපිරිසිදු දෙයක් නොදකී නම්, 'මට ලාභයකි, මම පිරිසිදු ය' යි එහෙයින්ම සතුටු වී, පූර්ණ චේතනාවෙන් යුක්තව සිටින්නේ ද; මහණෙනි, එපරිද්දෙන්ම භික්ෂුවගේ විමසීම කුසල ධර්මයන්හි බොහෝ උපකාරී වේ: 'මම බොහෝ විට අධිමාත්‍ර ලෝභයෙන් යුතුව වාසය කරම් ද, නැතහොත් අධිමාත්‍ර ලෝභයෙන් තොරව වාසය කරම් ද? ක්‍රෝධ සිතිවිලිවලින් යුතුව වාසය කරම් ද, නැතහොත් ක්‍රෝධ සිතිවිලිවලින් තොරව වාසය කරම් ද? ථීනමිද්ධයෙන් යට වී වාසය කරම් ද, නැතහොත් ථීනමිද්ධය දුරු කර වාසය කරම් ද? උද්ධච්චයෙන් යුතුව වාසය කරම් ද, නැතහොත් උද්ධච්චයෙන් තොරව වාසය කරම් ද? විචිකිච්ඡාවෙන් යුතුව වාසය කරම් ද, නැතහොත් සැකය තරණය කර වාසය කරම් ද? ක්‍රෝධයෙන් යුතුව වාසය කරම් ද, නැතහොත් ක්‍රෝධයෙන් තොරව වාසය කරම් ද? කිලිටි වූ සිතකින් යුතුව වාසය කරම් ද, නැතහොත් කිලිටි නො වූ සිතකින් යුතුව වාසය කරම් ද? සාරද්ධකාවෙන් යුතුව වාසය කරම් ද, නැතහොත් සාරද්ධකාවෙන් තොරව වාසය කරම් ද? කුසීතව වාසය කරම් ද, නැතහොත් ආර්බ්ධවීර්යයෙන් යුතුව වාසය කරම් ද? අසමාහිතව වාසය කරම් ද, නැතහොත් සමාහිතව වාසය කරම් ද?'\n\n“මහණෙනි, යම් හෙයකින් භික්ෂුවක් විමසා බලන විට මෙසේ දන්නේ නම්: 'මම බොහෝ විට අධිමාත්‍ර ලෝභයෙන් යුතුව වාසය කරමි, ක්‍රෝධ සිතිවිලිවලින් යුතුව වාසය කරමි, ථීනමිද්ධයෙන් යට වී වාසය කරමි, උද්ධච්චයෙන් යුතුව වාසය කරමි, විචිකිච්ඡාවෙන් යුතුව වාසය කරමි, ක්‍රෝධයෙන් යුතුව වාසය කරමි, කිලිටි වූ සිතකින් යුතුව වාසය කරමි, සාරද්ධකාවෙන් යුතුව වාසය කරමි, කුසීතව වාසය කරමි, අසමාහිතව වාසය කරමි' යි; මහණෙනි, ඒ භික්ෂුව විසින් ඒ පව්කාර, අකුසල ධර්මයන් ප්‍රහාණය කිරීම සඳහා අතිශයින් වැඩි වූ ඡන්දය ද (කැමැත්ත ද), වෑයම ද, උත්සාහය ද, උසුලෑම ද (ඉවසීම ද), නොපසුබට බව ද, සිහිය ද, සම්පජඤ්ඤය ද කළ යුතු ය. මහණෙනි, යම් සේ ගිනිගත් වස්ත්‍ර ඇත්තෙක් හෝ ගිනිගත් හිස ඇත්තෙක් හෝ ඒ වස්ත්‍රයේ හෝ හිසේ ගින්න නිවීමට අතිශයින් වැඩි වූ ඡන්දය ද, වෑයම ද, උත්සාහය ද, උසුලෑම ද, නොපසුබට බව ද, සිහිය ද, සම්පජඤ්ඤය ද කරන්නේ ද; මහණෙනි, එපරිද්දෙන්ම ඒ භික්ෂුව විසින් ඒ පව්කාර, අකුසල ධර්මයන් ප්‍රහාණය කිරීම සඳහා අතිශයින් වැඩි වූ ඡන්දය ද, වෑයම ද, උත්සාහය ද, උසුලෑම ද, නොපසුබට බව ද, සිහිය ද, සම්පජඤ්ඤය ද කළ යුතු ය.\n\n“එහෙත්, මහණෙනි, යම් හෙයකින් භික්ෂුවක් විමසා බලන විට මෙසේ දන්නේ නම්: 'මම බොහෝ විට අධිමාත්‍ර ලෝභයෙන් තොරව වාසය කරමි, ක්‍රෝධ සිතිවිලිවලින් තොරව වාසය කරමි, ථීනමිද්ධය දුරු කර වාසය කරමි, උද්ධච්චයෙන් තොරව වාසය කරමි, සැකය තරණය කර වාසය කරමි, ක්‍රෝධයෙන් තොරව වාසය කරමි, කිලිටි නො වූ සිතකින් යුතුව වාසය කරමි, සාරද්ධකාවෙන් තොරව වාසය කරමි, ආර්බ්ධවීර්යයෙන් යුතුව වාසය කරමි, සමාහිතව වාසය කරමි' යි; මහණෙනි, ඒ භික්ෂුව විසින් ඒ කුසල ධර්මයන්හිම පිහිටා, ඉන් ඔබ්බට ආශ්‍රවයන් ක්ෂය කිරීම සඳහා යෝගය (ප්‍රයත්නය) කළ යුතු ය.",
      "paliTitle": "Sacittasuttaṃ"
    },
    {
      "number": 52,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘No ce, āvuso, bhikkhu paracittapariyāyakusalo hoti, atha ‘sacittapariyāyakusalo bhavissāmī’ti – evañhi vo, āvuso, sikkhitabbaṃ. ‘‘Kathañcāvuso, bhikkhu sacittapariyāyakusalo hoti? Seyyathāpi, āvuso, itthī vā puriso vā daharo yuvā maṇḍanakajātiko ādāse vā parisuddhe pariyodāte acche vā udapatte sakaṃ mukhanimittaṃ paccavekkhamāno sace tattha passati rajaṃ vā aṅgaṇaṃ vā, tasseva rajassa vā aṅgaṇassa vā pahānāya vāyamati. No ce tattha passati rajaṃ vā aṅgaṇaṃ vā, tenevattamano hoti paripuṇṇasaṅkappo – ‘lābhā vata me, parisuddhaṃ vata me’ti. Evamevaṃ kho, āvuso, bhikkhuno paccavekkhaṇā bahukārā hoti kusalesu dhammesu – ‘abhijjhālu nu kho bahulaṃ viharāmi, anabhijjhālu nu kho bahulaṃ viharāmi, byāpannacitto nu kho bahulaṃ viharāmi, abyāpannacitto nu kho bahulaṃ viharāmi, thinamiddhapariyuṭṭhito nu kho bahulaṃ viharāmi, vigatathinamiddho nu kho bahulaṃ viharāmi, uddhato nu kho bahulaṃ viharāmi, anuddhato nu kho bahulaṃ viharāmi, vicikiccho nu kho bahulaṃ viharāmi, tiṇṇavicikiccho nu kho bahulaṃ viharāmi, kodhano nu kho bahulaṃ viharāmi, akkodhano nu kho bahulaṃ viharāmi, saṃkiliṭṭhacitto nu kho bahulaṃ viharāmi, asaṃkiliṭṭhacitto nu kho bahulaṃ viharāmi, sāraddhakāyo nu kho bahulaṃ viharāmi, asāraddhakāyo nu kho bahulaṃ viharāmi, kusīto nu kho bahulaṃ viharāmi, āraddhavīriyo nu kho bahulaṃ viharāmi, samāhito nu kho bahulaṃ viharāmi, asamāhito nu kho bahulaṃ viharāmī’ti. ‘‘Sace, āvuso, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhijjhālu bahulaṃ viharāmi…pe… asamāhito bahulaṃ viharāmī’ti, tenāvuso, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, āvuso, ādittacelo vā ādittasīso vā. Tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya. Evamevaṃ kho, āvuso, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace panāvuso, bhikkhu paccavekkhamāno evaṃ jānāti – ‘anabhijjhālu bahulaṃ viharāmi…pe… samāhito bahulaṃ viharāmī’ti, tenāvuso, bhikkhunā tesuyeva kusalesu dhammesu patiṭṭhāya uttari āsavānaṃ khayāya yogo karaṇīyo’’ti. Dutiyaṃ.",
      "english": "Then, the venerable Sāriputta addressed the monks, saying, \"Friends, monks!\" Those monks responded to the venerable Sāriputta, \"Friend!\" The venerable Sāriputta said this: \"If, friends, a monk is not skilled in discerning the minds of others, then he should train himself thus: 'I will become skilled in discerning my own mind.' That is how you, friends, should train yourselves. And how, friends, does a monk become skilled in discerning his own mind? Just as, friends, a woman or a man, young, youthful, and fond of adornment, scrutinizing their own face in a clean, clear mirror or a bowl of clear water, if they see any dust or blemish there, they strive to remove that very dust or blemish. If they see no dust or blemish there, they are pleased with that, their intention fulfilled, thinking, 'How fortunate I am! How pure I am!' In the same way, friends, a monk's self-reflection is of great help with regard to wholesome states: 'Do I dwell frequently with covetousness, or do I dwell frequently without covetousness? Do I dwell frequently with a mind of ill-will, or do I dwell frequently with a mind free from ill-will? Do I dwell frequently overcome by sloth and torpor, or do I dwell frequently free from sloth and torpor? Do I dwell frequently agitated, or do I dwell frequently unagitated? Do I dwell frequently in doubt, or do I dwell frequently having overcome doubt? Do I dwell frequently angry, or do I dwell frequently not angry? Do I dwell frequently with a defiled mind, or do I dwell frequently with an undefiled mind? Do I dwell frequently with a turbulent body, or do I dwell frequently with a tranquil body? Do I dwell frequently lazy, or do I dwell frequently with aroused energy? Do I dwell frequently concentrated, or do I dwell frequently unconcentrated?'\"\n\n\"If, friends, while reflecting, a monk knows thus: 'I dwell frequently with covetousness, I dwell frequently with a mind of ill-will, I dwell frequently overcome by sloth and torpor, I dwell frequently agitated, I dwell frequently in doubt, I dwell frequently angry, I dwell frequently with a defiled mind, I dwell frequently with a turbulent body, I dwell frequently lazy, I dwell frequently unconcentrated,' then that monk, friends, should apply extraordinary desire, effort, exertion, endeavor, unwavering mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome states. Just as, friends, if one's garment were ablaze or one's head were ablaze. For the extinguishing of that very garment or head, one would apply extraordinary desire, effort, exertion, endeavor, unwavering mindfulness, and clear comprehension. In the same way, friends, that monk should apply extraordinary desire, effort, exertion, endeavor, unwavering mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome states.\"\n\n\"But if, friends, while reflecting, a monk knows thus: 'I dwell frequently without covetousness, I dwell frequently with a mind free from ill-will, I dwell frequently free from sloth and torpor, I dwell frequently unagitated, I dwell frequently having overcome doubt, I dwell frequently not angry, I dwell frequently with an undefiled mind, I dwell frequently with a tranquil body, I dwell frequently with aroused energy, I dwell frequently concentrated,' then that monk, friends, having established himself in those very wholesome states, should apply himself further to the destruction of the taints (āsavas).\"",
      "sinhala": "එහිදී පින්වත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ භික්ෂූන් ඇමතූ සේක: \"ඇවැත්නි භික්ෂූනි\" කියායි. \"ඇවැත්නි\" යි කියා ඒ භික්ෂූහු පින්වත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේට පිළිතුරු දුන්නාහුය. පින්වත් ශාරිපුත්‍ර ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: \"ඇවැත්නි, යම් හෙයකින් භික්ෂුවක් අනුන්ගේ සිත් දැනීමේ හැකියාව ඇති කෙනෙක් නොවන්නේ නම්, 'මම මාගේ සිත දැනීමේ හැකියාව ඇති කෙනෙක් වන්නෙමි' යි මෙසේ ඔබට පුහුණු විය යුතුයි.\n\n\"ඇවැත්නි, කෙසේ නම් භික්ෂුවක් මාගේ සිත දැනීමේ හැකියාව ඇති කෙනෙක් වන්නේද? ඇවැත්නි, යම් සේ තරුණ, යුවල, විසිතුරු ස්වභාව ඇති ස්ත්‍රියක් හෝ පුරුෂයෙක් පිරිසිදු වූ, පැහැදිලි වූ කණ්ණාඩියක හෝ පැහැදිලි ජල භාජනයක තම මුහුණ බලා වුවහොත්, එහි කිලිටක් හෝ අපිරිසිදු බවක් දුටුවහොත්, ඒ කිලිට හෝ අපිරිසිදු බව නැති කිරීමට උත්සාහ කරන්නේය. එහි කිලිටක් හෝ අපිරිසිදු බවක් නොදකින්නේ නම්, ඔහු \"මාගේ වාසනාවකි, මාගේ මුහුණ පිරිසිදුය\" යි කියා සතුටු සිතින්, පිරුණු අදහස් ඇතිව සිටින්නේය. ඇවැත්නි, එලෙසම භික්ෂුවගේ මේ ප්‍රත්‍යවේක්ෂාව කුසල ධර්මයන්හිදී මහත් උපකාරයක් වන්නේය: 'මම බොහෝවිට අධික ලෝභයෙන් (අභිජ්ඣාවෙන්) යුතුව වාසය කරමිද, නැතිනම් අධික ලෝභයෙන් තොරව වාසය කරමිද? බොහෝවිට ව්‍යාපාදයෙන් (අප්‍රසාදයෙන්) යුතුව වාසය කරමිද, නැතිනම් ව්‍යාපාදයෙන් තොරව වාසය කරමිද? බොහෝවිට ථීනමිද්ධයෙන් (සිතේ බර ගතියෙන් සහ නිදිමතෙන්) යටපත් වී වාසය කරමිද, නැතිනම් ථීනමිද්ධය පහව ගොස් වාසය කරමිද? බොහෝවිට උද්ධච්චයෙන් (සිත විසිරවීමෙන්) යුතුව වාසය කරමිද, නැතිනම් උද්ධච්චයෙන් තොරව වාසය කරමිද? බොහෝවිට විචිකිච්ඡාවෙන් (සැකයෙන්) යුතුව වාසය කරමිද, නැතිනම් විචිකිච්ඡාව ඉක්මවා වාසය කරමිද? බොහෝවිට ක්‍රෝධයෙන් යුතුව වාසය කරමිද, නැතිනම් ක්‍රෝධයෙන් තොරව වාසය කරමිද? බොහෝවිට කෙලෙසන ලද සිතකින් යුතුව වාසය කරමිද, නැතිනම් නොකෙලෙසන ලද සිතකින් යුතුව වාසය කරමිද? බොහෝවිට ශාරීරික කැළඹීමෙන් යුතුව වාසය කරමිද, නැතිනම් ශාරීරික කැළඹීමෙන් තොරව වාසය කරමිද? බොහෝවිට අලසව (කුසීතව) වාසය කරමිද, නැතිනම් වීර්යය අරඹා වාසය කරමිද? බොහෝවිට සමාධියට පත් සිතකින් යුතුව වාසය කරමිද, නැතිනම් සමාධියට පත් නොවූ සිතකින් යුතුව වාසය කරමිද?'\n\n\"ඇවැත්නි, යම් හෙයකින් භික්ෂුව ප්‍රත්‍යවේක්ෂා කරමින් මෙසේ දන්නේ නම්: 'මම බොහෝවිට අධික ලෝභයෙන් යුතුව වාසය කරමි... (යනාදී වශයෙන්) ...සමාධියට පත් නොවූ සිතකින් යුතුව වාසය කරමි' කියායි. ඇවැත්නි, ඒ භික්ෂුව විසින් ඒ පාපී අකුසල ධර්මයන් පහකිරීම පිණිස අධික කැමැත්තද, වෑයමද, උත්සාහයද, වීර්යයද, නොපසුබට බවද, සිහියද, නුවණද (සම්පජඤ්ඤයද) කළ යුත්තේය. ඇවැත්නි, යම් සේ ගිනිගත් වස්ත්‍ර ඇත්තෙක් හෝ ගිනිගත් හිස ඇත්තෙක් වේද, ඒ වස්ත්‍රයේ හෝ හිසේ ගින්න නිවීමට අධික කැමැත්තද, වෑයමද, උත්සාහයද, වීර්යයද, නොපසුබට බවද, සිහියද, නුවණද (සම්පජඤ්ඤයද) කරන්නේය. ඇවැත්නි, එලෙසම ඒ භික්ෂුව විසින් ඒ පාපී අකුසල ධර්මයන් පහකිරීම පිණිස අධික කැමැත්තද, වෑයමද, උත්සාහයද, වීර්යයද, නොපසුබට බවද, සිහියද, නුවණද (සම්පජඤ්ඤයද) කළ යුත්තේය.\n\n\"ඇවැත්නි, යම් හෙයකින් භික්ෂුව ප්‍රත්‍යවේක්ෂා කරමින් මෙසේ දන්නේ නම්: 'මම බොහෝවිට අධික ලෝභයෙන් තොරව වාසය කරමි... (යනාදී වශයෙන්) ...සමාධියට පත් සිතකින් යුතුව වාසය කරමි' කියායි. ඇවැත්නි, ඒ භික්ෂුව විසින් ඒ කුසල ධර්මයන්හි පිහිටා, තවදුරටත් ආශ්‍රවයන් ක්ෂය කිරීම පිණිස උත්සාහය (යෝගය) කළ යුත්තේය.\"",
      "paliTitle": "Sāriputtasuttaṃ"
    },
    {
      "number": 53,
      "pali": "‘‘Ṭhitimpāhaṃ, bhikkhave, na vaṇṇayāmi kusalesu dhammesu, pageva parihāniṃ. Vuḍḍhiñca kho ahaṃ, bhikkhave, vaṇṇayāmi kusalesu dhammesu, no ṭhitiṃ no hāniṃ. ‘‘Kathañca, bhikkhave, hāni hoti kusalesu dhammesu, no ṭhiti no vuḍḍhi? Idha, bhikkhave, bhikkhu yattako hoti saddhāya sīlena sutena cāgena paññāya paṭibhānena, tassa te dhammā neva tiṭṭhanti no vaḍḍhanti. Hānimetaṃ, bhikkhave, vadāmi kusalesu dhammesu, no ṭhitiṃ no vuḍḍhiṃ. Evaṃ kho, bhikkhave, hāni hoti kusalesu dhammesu, no ṭhiti no vuḍḍhi. ‘‘Kathañca, bhikkhave ṭhiti hoti kusalesu dhammesu, no hāni no vuḍḍhi? Idha, bhikkhave, bhikkhu yattako hoti saddhāya sīlena sutena cāgena paññāya paṭibhānena, tassa te dhammā neva hāyanti no vaḍḍhanti. Ṭhitimetaṃ, bhikkhave, vadāmi kusalesu dhammesu, no hāniṃ no vuḍḍhiṃ. Evaṃ kho, bhikkhave, ṭhiti hoti kusalesu dhammesu, no vuḍḍhi no hāni. ‘‘Kathañca, bhikkhave, vuḍḍhi hoti kusalesu dhammesu, no ṭhiti no hāni? Idha, bhikkhave, bhikkhu yattako hoti saddhāya sīlena sutena cāgena paññāya paṭibhānena, tassa te dhammā neva tiṭṭhanti no hāyanti. Vuḍḍhimetaṃ, bhikkhave, vadāmi kusalesu dhammesu, no ṭhitiṃ no hāniṃ. Evaṃ kho, bhikkhave, vuḍḍhi hoti kusalesu dhammesu, no ṭhiti no hāni. ‘‘No ce, bhikkhave, bhikkhu paracittapariyāyakusalo hoti, atha ‘sacittapariyāyakusalo bhavissāmī’ti – evañhi vo, bhikkhave, sikkhitabbaṃ. ‘‘Kathañca, bhikkhave, bhikkhu sacittapariyāyakusalo hoti? Seyyathāpi, bhikkhave, itthī vā puriso vā daharo yuvā maṇḍanakajātiko ādāse vā parisuddhe pariyodāte acche vā udapatte sakaṃ mukhanimittaṃ paccavekkhamāno sace tattha passati rajaṃ vā aṅgaṇaṃ vā, tasseva rajassa vā aṅgaṇassa vā pahānāya vāyamati. No ce tattha passati rajaṃ vā aṅgaṇaṃ vā, tenevattamano hoti paripuṇṇasaṅkappo – ‘lābhā vata me, parisuddhaṃ vata me’ti. Evamevaṃ kho, bhikkhave, bhikkhuno paccavekkhaṇā bahukārā hoti kusalesu dhammesu – ‘abhijjhālu nu kho bahulaṃ viharāmi, anabhijjhālu nu kho bahulaṃ viharāmi, byāpannacitto nu kho bahulaṃ viharāmi, abyāpannacitto nu kho bahulaṃ viharāmi, thinamiddhapariyuṭṭhito nu kho bahulaṃ viharāmi, vigatathinamiddho nu kho bahulaṃ viharāmi, uddhato nu kho bahulaṃ viharāmi, anuddhato nu kho bahulaṃ viharāmi, vicikiccho nu kho bahulaṃ viharāmi, tiṇṇavicikiccho nu kho bahulaṃ viharāmi, kodhano nu kho bahulaṃ viharāmi, akkodhano nu kho bahulaṃ viharāmi, saṃkiliṭṭhacitto nu kho bahulaṃ viharāmi, asaṃkiliṭṭhacitto nu kho bahulaṃ viharāmi, sāraddhakāyo nu kho bahulaṃ viharāmi, asāraddhakāyo nu kho bahulaṃ viharāmi, kusīto nu kho bahulaṃ viharāmi, āraddhavīriyo nu kho bahulaṃ viharāmi, samāhito nu kho bahulaṃ viharāmi, asamāhito nu kho bahulaṃ viharāmī’ti. ‘‘Sace, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘abhijjhālu bahulaṃ viharāmi, byāpannacitto bahulaṃ viharāmi, thinamiddhapariyuṭṭhito bahulaṃ viharāmi, uddhato bahulaṃ viharāmi, vicikiccho bahulaṃ viharāmi, kodhano bahulaṃ viharāmi, saṃkiliṭṭhacitto bahulaṃ viharāmi, sāraddhakāyo bahulaṃ viharāmi, kusīto bahulaṃ viharāmi, asamāhito bahulaṃ viharāmī’ti, tena, bhikkhave, bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā. Tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya; evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva pāpakānaṃ akusalānaṃ dhammānaṃ pahānāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘anabhijjhālu bahulaṃ viharāmi, abyāpannacitto bahulaṃ viharāmi, vigatathinamiddho bahulaṃ viharāmi, anuddhato bahulaṃ viharāmi, tiṇṇavicikiccho bahulaṃ viharāmi, akkodhano bahulaṃ viharāmi, asaṃkiliṭṭhacitto bahulaṃ viharāmi, asāraddhakāyo bahulaṃ viharāmi, āraddhavīriyo bahulaṃ viharāmi, samāhito bahulaṃ viharāmī’ti, tena, bhikkhave, bhikkhunā tesuyeva kusalesu dhammesu patiṭṭhāya uttari āsavānaṃ khayāya yogo karaṇīyo’’ti. Tatiyaṃ.",
      "english": "Monks, I do not commend stagnation in wholesome states, much less decline. But, monks, I commend growth in wholesome states, not stagnation, not decline.\n\nAnd how, monks, is there decline in wholesome states, and not stagnation, and not growth? Here, monks, a monk, whatever measure of faith, moral virtue, learning, generosity, wisdom, and ready wit he possesses, those states neither stand firm nor grow. This, monks, I call decline in wholesome states, not stagnation, not growth. Thus, monks, there is decline in wholesome states, not stagnation, not growth.\n\nAnd how, monks, is there stagnation in wholesome states, and not decline, and not growth? Here, monks, a monk, whatever measure of faith, moral virtue, learning, generosity, wisdom, and ready wit he possesses, those states neither decline nor grow. This, monks, I call stagnation in wholesome states, not decline, not growth. Thus, monks, there is stagnation in wholesome states, not growth, not decline.\n\nAnd how, monks, is there growth in wholesome states, and not stagnation, and not decline? Here, monks, a monk, whatever measure of faith, moral virtue, learning, generosity, wisdom, and ready wit he possesses, those states neither stand firm nor decline. This, monks, I call growth in wholesome states, not stagnation, not decline. Thus, monks, there is growth in wholesome states, not stagnation, not decline.\n\nIf, monks, a monk is not skilled in discerning the minds of others, then 'I will be skilled in discerning my own mind' – this, monks, is how you should train yourselves.\n\nAnd how, monks, is a monk skilled in discerning his own mind? Just as, monks, a woman or a man, young, youthful, and fond of adornment, scrutinizing their own face in a clean, brightly polished mirror or a clear bowl of water, if they see any dust or blemish there, they make an effort to remove that very dust or blemish. If they see no dust or blemish there, they are pleased with that, with a wish fulfilled, thinking: 'Indeed, it is a gain for me, indeed, I am pure!' Even so, monks, a monk's self-reflection is of great benefit in wholesome states, considering: 'Do I dwell predominantly with covetousness, or without covetousness? Do I dwell predominantly with ill-will, or without ill-will? Am I predominantly beset by sloth and torpor, or free from sloth and torpor? Am I predominantly restless, or not restless? Am I predominantly wavering in doubt, or have I overcome doubt? Am I predominantly prone to anger, or not prone to anger? Am I predominantly with defiled thoughts, or with undefiled thoughts? Am I predominantly with an agitated body, or with a tranquil body? Am I predominantly lazy, or persistent in effort? Am I predominantly concentrated, or not concentrated?'\n\nIf, monks, a monk, while reflecting, knows thus: 'I dwell predominantly with covetousness, I dwell predominantly with ill-will, I am predominantly beset by sloth and torpor, I am predominantly restless, I am predominantly wavering in doubt, I am predominantly prone to anger, I am predominantly with defiled thoughts, I am predominantly with an agitated body, I am predominantly lazy, I am predominantly not concentrated,' then that monk, monks, should apply immense desire, effort, exertion, endeavor, unwavering mindfulness, and clear comprehension for the abandoning of these very evil, unwholesome states. Just as, monks, if one's clothing were on fire or one's head were on fire, one would apply immense desire, effort, exertion, endeavor, unwavering mindfulness, and clear comprehension to extinguish that very clothing or head. Even so, monks, that monk should apply immense desire, effort, exertion, endeavor, unwavering mindfulness, and clear comprehension for the abandoning of those very evil, unwholesome states.\n\nBut if, monks, a monk, reflecting, knows thus: ‘I mostly live free from covetousness; I mostly live with a mind free from ill-will; I mostly live free from sloth and torpor; I mostly live without restlessness; I mostly live having overcome doubt; I mostly live free from anger; I mostly live with an undefiled mind; I mostly live with a composed body; I mostly live with aroused energy; I mostly live with collectedness,’ then, monks, that monk, having established himself firmly in just those wholesome qualities, should apply himself further to the destruction of the taints.",
      "sinhala": "මහණෙනි, මම කුසල ධර්මයන්හි නැවතී සිටීම වර්ණනා නොකරමි, පිරිහීම ගැන කියනුම කවරේද? මහණෙනි, මම කුසල ධර්මයන්හි වර්ධනයම වර්ණනා කරමි, නැවතී සිටීම හෝ පිරිහීම නොවේ.\n\nමහණෙනි, කුසල ධර්මයන්හි පිරිහීම සිදු වන්නේ කෙසේද? නැවතී සිටීම හෝ වර්ධනය නොවන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව යම් පමණකින් ශ්‍රද්ධාවෙන්, සීලයෙන්, ශ්‍රැතයෙන්, ත්‍යාගයෙන්, ප්‍රඥාවෙන්, ප්‍රතිභානයෙන් යුක්තවේද, ඔහුගේ ඒ ධර්මයන් නැවතී නොසිටී, වර්ධනයද නොවේ. මහණෙනි, කුසල ධර්මයන්හි නැවතී සිටීමක් හෝ වර්ධනයක් නොවී, පිරිහීමක් බව මම මෙය කියමි. මහණෙනි, කුසල ධර්මයන්හි පිරිහීම සිදුවන්නේ මෙසේය, නැවතී සිටීමක් හෝ වර්ධනයක් නොවේ.\n\nමහණෙනි, කුසල ධර්මයන්හි නැවතී සිටීම සිදු වන්නේ කෙසේද? පිරිහීමක් හෝ වර්ධනයක් නොවන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව යම් පමණකින් ශ්‍රද්ධාවෙන්, සීලයෙන්, ශ්‍රැතයෙන්, ත්‍යාගයෙන්, ප්‍රඥාවෙන්, ප්‍රතිභානයෙන් යුක්තවේද, ඔහුගේ ඒ ධර්මයන් පිරිහෙන්නෙත් නැත, වර්ධනය වෙන්නෙත් නැත. මහණෙනි, කුසල ධර්මයන්හි පිරිහීමක් හෝ වර්ධනයක් නොවී, නැවතී සිටීමක් බව මම මෙය කියමි. මහණෙනි, කුසල ධර්මයන්හි නැවතී සිටීම සිදුවන්නේ මෙසේය, වර්ධනයක් හෝ පිරිහීමක් නොවේ.\n\nමහණෙනි, කුසල ධර්මයන්හි වර්ධනය සිදු වන්නේ කෙසේද? නැවතී සිටීමක් හෝ පිරිහීමක් නොවන්නේ කෙසේද? මහණෙනි, මෙහිලා භික්‍ෂුව යම් පමණකින් ශ්‍රද්ධාවෙන්, සීලයෙන්, ශ්‍රැතයෙන්, ත්‍යාගයෙන්, ප්‍රඥාවෙන්, ප්‍රතිභානයෙන් යුක්තවේද, ඔහුගේ ඒ ධර්මයන් නැවතී නොසිටී, පිරිහෙන්නෙත් නැත. මහණෙනි, කුසල ධර්මයන්හි නැවතී සිටීමක් හෝ පිරිහීමක් නොවී, වර්ධනයක් බව මම මෙය කියමි. මහණෙනි, කුසල ධර්මයන්හි වර්ධනය සිදුවන්නේ මෙසේය, නැවතී සිටීමක් හෝ පිරිහීමක් නොවේ.\n\nමහණෙනි, යම් හෙයකින් භික්‍ෂුව අනුන්ගේ සිත් දැනීමේ හැකියාවෙහි දක්‍ෂ නොවන්නේ නම්, ‘මම තමාගේ සිත දැනීමේ හැකියාවෙහි දක්‍ෂ වන්නෙමි’යි – මහණෙනි, ඔබ විසින් මෙසේ හික්මිය යුත්තේය.\n\nමහණෙනි, භික්‍ෂුව තමාගේ සිත දැනීමේ හැකියාවෙහි දක්‍ෂ වන්නේ කෙසේද? මහණෙනි, යම් සේ තරුණ, යෞවන, අලංකාරයට කැමති ස්ත්‍රියක් හෝ පුරුෂයෙක්, පිරිසිදු වූ, මනා කොට පැහැදිලි වූ කණ්ණාඩියක හෝ පැහැදිලි වූ දිය බඳුනක තමාගේ මුහුණේ රුව බලයි. එහිදී යම් හෙයකින් දූවිල්ලක් හෝ කිලිටි තලයක් දකියි නම්, ඔහු ඒ දූවිල්ල හෝ කිලිටි තලය ඉවත් කිරීමට වෑයම් කරයි. යම් හෙයකින් එහි දූවිල්ලක් හෝ කිලිටි තලයක් නොදකියි නම්, ඔහු එයින්ම සතුටු වෙයි, සිත සම්පූර්ණ වූයේ යැයි ‘මා හට ලාභයකි, මා පිරිසිදුය’යි සිතයි. එපරිද්දෙන්ම, මහණෙනි, භික්‍ෂුවගේ සිත පරීක්‍ෂා කර බැලීම කුසල ධර්මයන්හිදී මහත් උපකාරී වේ. ‘මම බොහෝ විට අධික ලෝභයෙන් යුතුව වාසය කරමිද? නැතහොත් අධික ලෝභයෙන් තොරව වාසය කරමිද? මම බොහෝ විට ද්වේෂ සහගත සිතින් යුතුව වාසය කරමිද? නැතහොත් ද්වේෂ රහිත සිතින් යුතුව වාසය කරමිද? මම බොහෝ විට ථීනමිද්ධයෙන් (සිතේ අලස බව) පිරී සිටිමින් වාසය කරමිද? නැතහොත් ථීනමිද්ධයෙන් තොරව වාසය කරමිද? මම බොහෝ විට උද්ධච්චයෙන් (සිතේ විසිරී යාම) යුතුව වාසය කරමිද? නැතහොත් උද්ධච්චයෙන් තොරව වාසය කරමිද? මම බොහෝ විට විචිකිච්ඡාවෙන් (සැකයෙන්) යුතුව වාසය කරමිද? නැතහොත් විචිකිච්ඡාව දුරුකරගෙන වාසය කරමිද? මම බොහෝ විට ක්‍රෝධයෙන් යුතුව වාසය කරමිද? නැතහොත් ක්‍රෝධයෙන් තොරව වාසය කරමිද? මම බොහෝ විට කිලිටි වූ සිතින් යුතුව වාසය කරමිද? නැතහොත් කිලිටි රහිත සිතින් යුතුව වාසය කරමිද? මම බොහෝ විට සිත දඟලමින් යුතුව වාසය කරමිද? නැතහොත් සිතේ දඟලන බවක් නැතිව වාසය කරමිද? මම බොහෝ විට කම්මැලිව වාසය කරමිද? නැතහොත් වීර්යයෙන් යුතුව වාසය කරමිද? මම බොහෝ විට සමාධිගතව වාසය කරමිද? නැතහොත් සමාධියෙන් තොරව වාසය කරමිද?’\n\nමහණෙනි, යම් හෙයකින් භික්‍ෂුව එසේ සිත පරීක්‍ෂා කර බලන කල මෙසේ දැනගන්නේ නම් – ‘මම බොහෝ විට අධික ලෝභයෙන් යුතුව වාසය කරමි, බොහෝ විට ද්වේෂ සහගත සිතින් යුතුව වාසය කරමි, බොහෝ විට ථීනමිද්ධයෙන් පිරී සිටිමින් වාසය කරමි, බොහෝ විට උද්ධච්චයෙන් යුතුව වාසය කරමි, බොහෝ විට විචිකිච්ඡාවෙන් යුතුව වාසය කරමි, බොහෝ විට ක්‍රෝධයෙන් යුතුව වාසය කරමි, බොහෝ විට කිලිටි වූ සිතින් යුතුව වාසය කරමි, බොහෝ විට සිත දඟලමින් යුතුව වාසය කරමි, බොහෝ විට කම්මැලිව වාසය කරමි, බොහෝ විට සමාධියෙන් තොරව වාසය කරමි’යි – මහණෙනි, ඒ භික්‍ෂුව විසින් ඒ පාපී අකුසල ධර්මයන් ප්‍රහාණය කිරීම සඳහා අධික වූ ඡන්දයද, වෑයමද, උත්සාහයද, නොපසුබට වීර්යයද, නොපසුබට සිහියද, මනා සිහි නුවණද කළ යුත්තේය. මහණෙනි, යම් සේ දැවෙන සිවුරක් හෝ දැවෙන හිසක් ඇත්තෙක් වේද, ඔහු විසින් ඒ සිවුර හෝ හිස නිවා දැමීම සඳහා අධික වූ ඡන්දයද, වෑයමද, උත්සාහයද, නොපසුබට වීර්යයද, නොපසුබට සිහියද, මනා සිහි නුවණද කරන්නේය. එපරිද්දෙන්ම, මහණෙනි, ඒ භික්‍ෂුව විසින් ඒ පාපී අකුසල ධර්මයන් ප්‍රහාණය කිරීම සඳහා අධික වූ ඡන්දයද, වෑයමද, උත්සාහයද, නොපසුබට වීර්යයද, නොපසුබට සිහියද, මනා සිහි නුවණද කළ යුත්තේය.\n\nඑහෙත් මහණෙනි, යම් භික්‍ෂුවක් තමා මෙනෙහි කරමින් මෙසේ දන්නේ නම් – ‘මම දැඩි ලෝභයෙන් තොරව බහුල වශයෙන් වාසය කරමි, ව්‍යාපාද රහිත සිතින් බහුල වශයෙන් වාසය කරමි, ථීනමිද්ධයෙන් මිදී බහුල වශයෙන් වාසය කරමි, උද්ධච්චයෙන් තොරව බහුල වශයෙන් වාසය කරමි, සැකයෙන් එතෙර වී බහුල වශයෙන් වාසය කරමි, ක්‍රෝධයෙන් තොරව බහුල වශයෙන් වාසය කරමි, කෙලෙස්වලින් අපවිත්‍ර නොවූ සිතින් බහුල වශයෙන් වාසය කරමි, කලබල නොවූ කයින් බහුල වශයෙන් වාසය කරමි, වීර්යය වඩා බහුල වශයෙන් වාසය කරමි, මනා සේ සමාධිගත වූ සිතින් බහුල වශයෙන් වාසය කරමි’යි; මහණෙනි, ඒ භික්‍ෂුව විසින් ඒ කුසල ධර්මයන්හිම තහවුරු වී, තවදුරටත් ආශ්‍රවයන් ක්ෂය කිරීම පිණිස ප්‍රයත්නය කළ යුත්තේය.",
      "paliTitle": "Ṭhitisuttaṃ"
    },
    {
      "number": 54,
      "pali": "‘‘No ce, bhikkhave, bhikkhu paracittapariyāyakusalo hoti, atha ‘sacittapariyāyakusalo bhavissāmī’ti – evañhi vo, bhikkhave, sikkhitabbaṃ. ‘‘Kathañca, bhikkhave, bhikkhu sacittapariyāyakusalo hoti? Seyyathāpi, bhikkhave, itthī vā puriso vā daharo yuvā maṇḍanakajātiko ādāse vā parisuddhe pariyodāte acche vā udapatte sakaṃ mukhanimittaṃ paccavekkhamāno sace tattha passati rajaṃ vā aṅgaṇaṃ vā, tasseva rajassa vā aṅgaṇassa vā pahānāya vāyamati. No ce tattha passati rajaṃ vā aṅgaṇaṃ vā, tenevattamano hoti paripuṇṇasaṅkappo – ‘lābhā vata me, parisuddhaṃ vata me’ti. Evamevaṃ kho, bhikkhave, bhikkhuno paccavekkhaṇā bahukārā hoti kusalesu dhammesu – ‘lābhī nu khomhi ajjhattaṃ cetosamathassa, na nu khomhi lābhī ajjhattaṃ cetosamathassa, lābhī nu khomhi adhipaññādhammavipassanāya, na nu khomhi lābhī adhipaññādhammavipassanāyā’ti. ‘‘Sace, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘lābhīmhi ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāyā’ti, tena, bhikkhave, bhikkhunā ajjhattaṃ cetosamathe patiṭṭhāya adhipaññādhammavipassanāya yogo karaṇīyo. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. ‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘lābhīmhi adhipaññādhammavipassanāya, na lābhī ajjhattaṃ cetosamathassā’ti, tena, bhikkhave, bhikkhunā adhipaññādhammavipassanāya patiṭṭhāya ajjhattaṃ cetosamathe yogo karaṇīyo. So aparena samayena lābhī ceva hoti adhipaññādhammavipassanāya lābhī ca ajjhattaṃ cetosamathassa. ‘‘Sace, pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘na lābhī ajjhattaṃ cetosamathassa, na lābhī adhipaññādhammavipassanāyā’ti, tena, bhikkhave, bhikkhunā tesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, bhikkhave, ādittacelo vā ādittasīso vā. Tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya. Evamevaṃ kho, bhikkhave, tena bhikkhunā tesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. So aparena samayena lābhī ceva hoti ajjhattaṃ cetosamathassa lābhī ca adhipaññādhammavipassanāya. ‘‘Sace pana, bhikkhave, bhikkhu paccavekkhamāno evaṃ jānāti – ‘lābhīmhi ajjhattaṃ cetosamathassa, lābhī adhipaññādhammavipassanāyā’ti, tena, bhikkhave, bhikkhunā tesuyeva kusalesu dhammesu patiṭṭhāya uttari āsavānaṃ khayāya yogo karaṇīyo. ‘‘Cīvarampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Piṇḍapātampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Senāsanampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Gāmanigamampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Janapadapadesampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. Puggalampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampi. ‘‘‘Cīvarampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā cīvaraṃ – ‘idaṃ kho me cīvaraṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpaṃ cīvaraṃ na sevitabbaṃ. Tattha yaṃ jaññā cīvaraṃ – ‘idaṃ kho me cīvaraṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpaṃ cīvaraṃ sevitabbaṃ. ‘Cīvarampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Piṇḍapātampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā piṇḍapātaṃ – ‘imaṃ kho me piṇḍapātaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo piṇḍapāto na sevitabbo. Tattha yaṃ jaññā piṇḍapātaṃ – ‘imaṃ kho me piṇḍapātaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo piṇḍapāto sevitabbo. ‘Piṇḍapātampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Senāsanampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā senāsanaṃ – ‘idaṃ kho me senāsanaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpaṃ senāsanaṃ na sevitabbaṃ. Tattha yaṃ jaññā senāsanaṃ – ‘idaṃ kho me senāsanaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpaṃ senāsanaṃ sevitabbaṃ. ‘Senāsanampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Gāmanigamampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā gāmanigamaṃ – ‘imaṃ kho me gāmanigamaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo gāmanigamo na sevitabbo. Tattha yaṃ jaññā gāmanigamaṃ – ‘imaṃ kho me gāmanigamaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo gāmanigamo sevitabbo. ‘Gāmanigamampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Janapadapadesampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā janapadapadesaṃ – ‘imaṃ kho me janapadapadesaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo janapadapadeso na sevitabbo. Tattha yaṃ jaññā janapadapadesaṃ – ‘imaṃ kho me janapadapadesaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo janapadapadeso sevitabbo. ‘Janapadapadesampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vuttaṃ. ‘‘‘Puggalampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti kho panetaṃ vuttaṃ. Kiñcetaṃ paṭicca vuttaṃ? Tattha yaṃ jaññā puggalaṃ – ‘imaṃ kho me puggalaṃ sevato akusalā dhammā abhivaḍḍhanti, kusalā dhammā parihāyantī’ti, evarūpo puggalo na sevitabbo. Tattha yaṃ jaññā puggalaṃ – ‘imaṃ kho me puggalaṃ sevato akusalā dhammā parihāyanti, kusalā dhammā abhivaḍḍhantī’ti, evarūpo puggalo sevitabbo. ‘Puggalampāhaṃ, bhikkhave, duvidhena vadāmi – sevitabbampi asevitabbampī’ti, iti yaṃ taṃ vuttaṃ, idametaṃ paṭicca vutta’’nti. Catutthaṃ.",
      "english": "If a monk, mendicants, is not skilled in understanding the mental states of others, then he should train himself thus: 'I will be skilled in understanding my own mental state.' And how, mendicants, is a monk skilled in understanding his own mental state? Just as, mendicants, a young man or woman, fond of adornment, would examine their own facial reflection in a clean, brightly polished mirror or in a clear bowl of water. If they see any dust or blemish there, they make an effort to remove that very dust or blemish. If they do not see any dust or blemish there, they are pleased and content with that, thinking, 'How fortunate for me! How pure I am!' In the same way, mendicants, a monk's self-reflection is very beneficial concerning wholesome states: 'Am I a gainer of inner tranquility or not? Am I a gainer of higher wisdom through insight or not?'\n\nIf, mendicants, a monk, while reflecting, knows thus: 'I am a gainer of inner tranquility, but not a gainer of higher wisdom through insight,' then, mendicants, that monk should establish himself in inner tranquility and strive for higher wisdom through insight. In due course, he will become a gainer of both inner tranquility and higher wisdom through insight.\n\nBut if, mendicants, a monk, while reflecting, knows thus: 'I am a gainer of higher wisdom through insight, but not a gainer of inner tranquility,' then, mendicants, that monk should establish himself in higher wisdom through insight and strive for inner tranquility. In due course, he will become a gainer of both higher wisdom through insight and inner tranquility.\n\nBut if, mendicants, a monk, while reflecting, knows thus: 'I am not a gainer of inner tranquility, nor a gainer of higher wisdom through insight,' then, mendicants, that monk should put forth extraordinary zeal, effort, exertion, unflagging persistence, unremitting mindfulness, and clear comprehension for the attainment of those very wholesome states. Just as, mendicants, if one's robe were on fire or one's head were ablaze, one would put forth extraordinary zeal, effort, exertion, unflagging persistence, unremitting mindfulness, and clear comprehension to extinguish that very fire on the robe or on the head. In the same way, mendicants, that monk should put forth extraordinary zeal, effort, exertion, unflagging persistence, unremitting mindfulness, and clear comprehension for the attainment of those very wholesome states. In due course, he will become a gainer of both inner tranquility and higher wisdom through insight.\n\nBut if, mendicants, a monk, while reflecting, knows thus: 'I am a gainer of inner tranquility, and I am a gainer of higher wisdom through insight,' then, mendicants, that monk, having established himself in those very wholesome states, should strive further for the destruction of the taints.\n\nMendicants, I declare robes to be of two kinds: those to be used and those not to be used. Mendicants, I declare almsfood to be of two kinds: that to be used and that not to be used. Mendicants, I declare dwellings to be of two kinds: those to be used and those not to be used. Mendicants, I declare villages and towns to be of two kinds: those to be frequented and those not to be frequented. Mendicants, I declare districts and regions to be of two kinds: those to be frequented and those not to be frequented. Mendicants, I declare persons to be of two kinds: those to be associated with and those not to be associated with.\n\nIt was said by me, mendicants: 'I declare robes to be of two kinds: those to be used and those not to be used.' With reference to what was this said? Regarding robes, if one knows: 'By using this robe, unwholesome states increase in me, and wholesome states decline,' then such a robe should not be used. But if one knows: 'By using this robe, unwholesome states decline in me, and wholesome states increase,' then such a robe should be used. This is with reference to which it was said: 'I declare robes to be of two kinds: those to be used and those not to be used.'\n\nIt was said by me, mendicants: 'I declare almsfood to be of two kinds: that to be used and that not to be used.' With reference to what was this said? Regarding almsfood, if one knows: 'By using this almsfood, unwholesome states increase in me, and wholesome states decline,' then such almsfood should not be used. But if one knows: 'By using this almsfood, unwholesome states decline in me, and wholesome states increase,' then such almsfood should be used.\n\n\"Monks, I declare alms-food in two ways: that which is to be associated with, and that which is not to be associated with.\" That which was spoken, was spoken with reference to this.\n\n\"Monks, I declare lodgings in two ways: that which is to be associated with, and that which is not to be associated with.\" Indeed, this was said. With reference to what was this said? Therein, if one knows of a lodging: \"For me, when associating with this lodging, unwholesome qualities increase, and wholesome qualities decline,\" such a lodging should not be associated with. Therein, if one knows of a lodging: \"For me, when associating with this lodging, unwholesome qualities decline, and wholesome qualities increase,\" such a lodging should be associated with. \"Monks, I declare lodgings in two ways: that which is to be associated with, and that which is not to be associated with.\" That which was spoken, was spoken with reference to this.\n\n\"Monks, I declare a village or town in two ways: that which is to be associated with, and that which is not to be associated with.\" Indeed, this was said. With reference to what was this said? Therein, if one knows of a village or town: \"For me, when associating with this village or town, unwholesome qualities increase, and wholesome qualities decline,\" such a village or town should not be associated with. Therein, if one knows of a village or town: \"For me, when associating with this village or town, unwholesome qualities decline, and wholesome qualities increase,\" such a village or town should be associated with. \"Monks, I declare a village or town in two ways: that which is to be associated with, and that which is not to be associated with.\" That which was spoken, was spoken with reference to this.\n\n\"Monks, I declare a district or region in two ways: that which is to be associated with, and that which is not to be associated with.\" Indeed, this was said. With reference to what was this said? Therein, if one knows of a district or region: \"For me, when associating with this district or region, unwholesome qualities increase, and wholesome qualities decline,\" such a district or region should not be associated with. Therein, if one knows of a district or region: \"For me, when associating with this district or region, unwholesome qualities decline, and wholesome qualities increase,\" such a district or region should be associated with. \"Monks, I declare a district or region in two ways: that which is to be associated with, and that which is not to be associated with.\" That which was spoken, was spoken with reference to this.\n\n\"Monks, I declare a person in two ways: that which is to be associated with, and that which is not to be associated with.\" Indeed, this was said. With reference to what was this said? Therein, if one knows of a person: \"For me, when associating with this person, unwholesome qualities increase, and wholesome qualities decline,\" such a person should not be associated with. Therein, if one knows of a person: \"For me, when associating with this person, unwholesome qualities decline, and wholesome qualities increase,\" such a person should be associated with. \"Monks, I declare a person in two ways: that which is to be associated with, and that which is not to be associated with.\" That which was spoken, was spoken with reference to this.",
      "sinhala": "භික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් අන්‍යයන්ගේ සිත් දත් දක්ෂයෙක් නොවන්නේ නම්, ‘මා තමාගේ සිත දත් දක්ෂයෙක් වන්නෙමි’ යි – මෙසේ ම ය, භික්ෂූන් වහන්ස, ඔබ විසින් හික්මිය යුතු ය. භික්ෂූන් වහන්ස, භික්ෂුවක් තමාගේ සිත දත් දක්ෂයෙක් වන්නේ කෙසේද? භික්ෂූන් වහන්ස, යම් සේ තරුණ, ලස්සනට සැරසීමට කැමති ස්ත්‍රියක් හෝ පුරුෂයෙක් පිරිසිදු වූ, පැහැදිලි වූ කණ්ණාඩියක හෝ පැහැදිලි දිය පිරුණු භාජනයක තම මුහුණේ ස්වරූපය බලමින්, එහි කිසියම් දූවිල්ලක් හෝ අපිරිසිදු බවක් දුටුවහොත්, ඒ දූවිල්ල හෝ අපිරිසිදු බව ඉවත් කිරීමට උත්සාහ කරන්නේ ද, එහි දූවිල්ලක් හෝ අපිරිසිදු බවක් නොදකින්නේ නම්, ‘මා හට ලාභයකි, මා පිරිසිදු ය’ යි යන සම්පූර්ණ අදහසින් යුක්ත ව සතුටට පත්වන්නේ ද, භික්ෂූන් වහන්ස, එපරිද්දෙන් ම, භික්ෂුවකට කුසල ධර්මයන් සම්බන්ධයෙන් කරන පරීක්ෂාව මහත් උපකාරී වන්නේ ය – ‘මා අභ්‍යන්තර චිත්ත සමථයට හිමිකරුවෙක් ද, මා අභ්‍යන්තර චිත්ත සමථයට හිමිකරුවෙක් නොවේ ද, මා අධිප්‍රඥා ධර්ම විපස්සනාවට හිමිකරුවෙක් ද, මා අධිප්‍රඥා ධර්ම විපස්සනාවට හිමිකරුවෙක් නොවේ ද’ යනුවෙන්.\n\nභික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් පරීක්ෂා කරමින් මෙසේ දන්නේ නම් – ‘මා අභ්‍යන්තර චිත්ත සමථයට හිමිකරුවෙක්මි, අධිප්‍රඥා ධර්ම විපස්සනාවට හිමිකරුවෙක් නොවේමි’ යි, භික්ෂූන් වහන්ස, එවිට ඒ භික්ෂුව විසින් අභ්‍යන්තර චිත්ත සමථයෙහි පිහිටා, අධිප්‍රඥා ධර්ම විපස්සනාව පිණිස වීර්යය කළ යුතු ය. ඔහු පසුව අභ්‍යන්තර චිත්ත සමථයට ද හිමිකරුවෙක් වන්නේ ය, අධිප්‍රඥා ධර්ම විපස්සනාවට ද හිමිකරුවෙක් වන්නේ ය.\n\nභික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් පරීක්ෂා කරමින් මෙසේ දන්නේ නම් – ‘මා අධිප්‍රඥා ධර්ම විපස්සනාවට හිමිකරුවෙක්මි, අභ්‍යන්තර චිත්ත සමථයට හිමිකරුවෙක් නොවේමි’ යි, භික්ෂූන් වහන්ස, එවිට ඒ භික්ෂුව විසින් අධිප්‍රඥා ධර්ම විපස්සනාවෙහි පිහිටා, අභ්‍යන්තර චිත්ත සමථය පිණිස වීර්යය කළ යුතු ය. ඔහු පසුව අධිප්‍රඥා ධර්ම විපස්සනාවට ද හිමිකරුවෙක් වන්නේ ය, අභ්‍යන්තර චිත්ත සමථයට ද හිමිකරුවෙක් වන්නේ ය.\n\nභික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් පරීක්ෂා කරමින් මෙසේ දන්නේ නම් – ‘මා අභ්‍යන්තර චිත්ත සමථයට ද හිමිකරුවෙක් නොවෙමි, අධිප්‍රඥා ධර්ම විපස්සනාවට ද හිමිකරුවෙක් නොවෙමි’ යි, භික්ෂූන් වහන්ස, එවිට ඒ භික්ෂුව විසින් ඒ කුසල ධර්මයන් ලබා ගැනීම පිණිස අධික ඡන්දය ද, වීර්යය ද, උත්සාහය ද, නොපසුබට බව ද, නොවැටෙන සුළු බව ද, සතිය ද, සම්පජඤ්ඤය ද ඇති කරගත යුතු ය. භික්ෂූන් වහන්ස, යම් සේ දැවෙන සිවුරක් ඇත්තෙක් හෝ දැවෙන හිසක් ඇත්තෙක් වේ ද, ඒ සිවුර හෝ හිස නිවා ගැනීම පිණිස අධික ඡන්දය ද, වීර්යය ද, උත්සාහය ද, නොපසුබට බව ද, නොවැටෙන සුළු බව ද, සතිය ද, සම්පජඤ්ඤය ද කරන්නේ ද, භික්ෂූන් වහන්ස, එපරිද්දෙන් ම, ඒ භික්ෂුව විසින් ඒ කුසල ධර්මයන් ලබා ගැනීම පිණිස අධික ඡන්දය ද, වීර්යය ද, උත්සාහය ද, නොපසුබට බව ද, නොවැටෙන සුළු බව ද, සතිය ද, සම්පජඤ්ඤය ද ඇති කරගත යුතු ය. ඔහු පසුව අභ්‍යන්තර චිත්ත සමථයට ද හිමිකරුවෙක් වන්නේ ය, අධිප්‍රඥා ධර්ම විපස්සනාවට ද හිමිකරුවෙක් වන්නේ ය.\n\nභික්ෂූන් වහන්ස, යම් හෙයකින් භික්ෂුවක් පරීක්ෂා කරමින් මෙසේ දන්නේ නම් – ‘මා අභ්‍යන්තර චිත්ත සමථයට ද හිමිකරුවෙක්මි, අධිප්‍රඥා ධර්ම විපස්සනාවට ද හිමිකරුවෙක්මි’ යි, භික්ෂූන් වහන්ස, එවිට ඒ භික්ෂුව විසින් ඒ කුසල ධර්මයන්හි පිහිටා, තවදුරටත් ආශ්‍රවයන් ක්ෂය කිරීම පිණිස වීර්යය කළ යුතු ය.\n\nභික්ෂූන් වහන්ස, මම සිවුර ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි. භික්ෂූන් වහන්ස, මම පිණ්ඩපාතය ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි. භික්ෂූන් වහන්ස, මම සේනාසනය ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි. භික්ෂූන් වහන්ස, මම ගම් සහ නියම්ගම් ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි. භික්ෂූන් වහන්ස, මම ජනපද සහ ප්‍රදේශ ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි. භික්ෂූන් වහන්ස, මම පුද්ගලයන් ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි.\n\n‘භික්ෂූන් වහන්ස, මම සිවුර ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි’ යි යමක් කීවේ ද, එය කුමක් අරභයා කීවේ ද? එහි යම් සිවුරක් ‘මේ සිවුර සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් වර්ධනය වේ, කුසල ධර්මයන් පිරිහේ’ යි දන්නේ ද, එවැනි සිවුරක් සේවනය නොකළ යුතු ය. එහි යම් සිවුරක් ‘මේ සිවුර සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් පිරිහේ, කුසල ධර්මයන් වර්ධනය වේ’ යි දන්නේ ද, එවැනි සිවුරක් සේවනය කළ යුතු ය. ‘භික්ෂූන් වහන්ස, මම සිවුර ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි’ යි යමක් කීවේ ද, එය මේ අරභයා කීවේ ය.\n\n‘භික්ෂූන් වහන්ස, මම පිණ්ඩපාතය ද දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයක් වශයෙනි, සේවනය නොකළ යුතු දෙයක් වශයෙනි’ යි යමක් කීවේ ද, එය කුමක් අරභයා කීවේ ද? එහි යම් පිණ්ඩපාතයක් ‘මේ පිණ්ඩපාතය සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් වර්ධනය වේ, කුසල ධර්මයන් පිරිහේ’ යි දන්නේ ද, එවැනි පිණ්ඩපාතයක් සේවනය නොකළ යුතු ය. එහි යම් පිණ්ඩපාතයක් ‘මේ පිණ්ඩපාතය සේවනය කිරීමෙන් මාගේ අකුසල ධර්මයන් පිරිහේ, කුසල ධර්මයන් වර්ධනය වේ’ යි දන්නේ ද, එවැනි පිණ්ඩපාතයක් සේවනය කළ යුතු ය.\n\nභික්ෂූණි, පිණ්ඩපාතයද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි.\n\nභික්ෂූණි, සේනාසනයද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි. කුමක් අරභයාද මෙය වදාළේ? ඒ පිළිබඳව යම් සේනාසනයක් ගැන දත යුත්තක් වේද – ‘මෙම සේනාසනය සේවනය කරන මා හට අකුසල ධර්මයන් වැඩෙන්නේය, කුසල ධර්මයන් පිරිහෙන්නේය’ යැයි (යමෙක් දන්නේ නම්), එබඳු සේනාසනයක් සේවනය නොකළ යුත්තේය. ඒ පිළිබඳව යම් සේනාසනයක් ගැන දත යුත්තක් වේද – ‘මෙම සේනාසනය සේවනය කරන මා හට අකුසල ධර්මයන් පිරිහෙන්නේය, කුසල ධර්මයන් වැඩෙන්නේය’ යැයි (යමෙක් දන්නේ නම්), එබඳු සේනාසනයක් සේවනය කළ යුත්තේය. භික්ෂූණි, සේනාසනයද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි.\n\nභික්ෂූණි, ගම්-නියම්ගම්ද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි. කුමක් අරභයාද මෙය වදාළේ? ඒ පිළිබඳව යම් ගම්-නියම්ගමක් ගැන දත යුත්තක් වේද – ‘මෙම ගම්-නියම්ගම් සේවනය කරන මා හට අකුසල ධර්මයන් වැඩෙන්නේය, කුසල ධර්මයන් පිරිහෙන්නේය’ යැයි (යමෙක් දන්නේ නම්), එබඳු ගම්-නියම්ගමක් සේවනය නොකළ යුත්තේය. ඒ පිළිබඳව යම් ගම්-නියම්ගමක් ගැන දත යුත්තක් වේද – ‘මෙම ගම්-නියම්ගම් සේවනය කරන මා හට අකුසල ධර්මයන් පිරිහෙන්නේය, කුසල ධර්මයන් වැඩෙන්නේය’ යැයි (යමෙක් දන්නේ නම්), එබඳු ගම්-නියම්ගමක් සේවනය කළ යුත්තේය. භික්ෂූණි, ගම්-නියම්ගම්ද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි.\n\nභික්ෂූණි, ජනපද ප්\\u200dරදේශද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි. කුමක් අරභයාද මෙය වදාළේ? ඒ පිළිබඳව යම් ජනපද ප්\\u200dරදේශයක් ගැන දත යුත්තක් වේද – ‘මෙම ජනපද ප්\\u200dරදේශය සේවනය කරන මා හට අකුසල ධර්මයන් වැඩෙන්නේය, කුසල ධර්මයන් පිරිහෙන්නේය’ යැයි (යමෙක් දන්නේ නම්), එබඳු ජනපද ප්\\u200dරදේශයක් සේවනය නොකළ යුත්තේය. ඒ පිළිබඳව යම් ජනපද ප්\\u200dරදේශයක් ගැන දත යුත්තක් වේද – ‘මෙම ජනපද ප්\\u200dරදේශය සේවනය කරන මා හට අකුසල ධර්මයන් පිරිහෙන්නේය, කුසල ධර්මයන් වැඩෙන්නේය’ යැයි (යමෙක් දන්නේ නම්), එබඳු ජනපද ප්\\u200dරදේශයක් සේවනය කළ යුත්තේය. භික්ෂූණි, ජනපද ප්\\u200dරදේශද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි.\n\nභික්ෂූණි, පුද්ගලයද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි. කුමක් අරභයාද මෙය වදාළේ? ඒ පිළිබඳව යම් පුද්ගලයෙක් ගැන දත යුත්තක් වේද – ‘මෙම පුද්ගලයා සේවනය කරන මා හට අකුසල ධර්මයන් වැඩෙන්නේය, කුසල ධර්මයන් පිරිහෙන්නේය’ යැයි (යමෙක් දන්නේ නම්), එබඳු පුද්ගලයෙක් සේවනය නොකළ යුත්තේය. ඒ පිළිබඳව යම් පුද්ගලයෙක් ගැන දත යුත්තක් වේද – ‘මෙම පුද්ගලයා සේවනය කරන මා හට අකුසල ධර්මයන් පිරිහෙන්නේය, කුසල ධර්මයන් වැඩෙන්නේය’ යැයි (යමෙක් දන්නේ නම්), එබඳු පුද්ගලයෙක් සේවනය කළ යුත්තේය. භික්ෂූණි, පුද්ගලයද මම දෙයාකාරයකින් කියමි – සේවනය කළ යුතු දෙයකි, සේවනය නොකළ යුතු දෙයකි. යමක් එසේ වදාළේ නම්, එය මේ කරුණ අරභයා වදාළ දෙයකි.",
      "paliTitle": "Samathasuttaṃ"
    },
    {
      "number": 55,
      "pali": "Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti [bhikkhavoti (sī. syā.)]. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘‘Parihānadhammo puggalo, parihānadhammo puggalo’ti, āvuso, vuccati. ‘Aparihānadhammo puggalo, aparihānadhammo puggalo’ti, āvuso, vuccati. Kittāvatā nu kho, āvuso, parihānadhammo puggalo vutto bhagavatā, kittāvatā ca pana aparihānadhammo puggalo vutto bhagavatā’’ti? ‘‘Dūratopi kho mayaṃ, āvuso, āgacchāma āyasmato sāriputtassa santike etassa bhāsitassa atthamaññātuṃ. Sādhu vatāyasmantaṃyeva sāriputtaṃ paṭibhātu etassa bhāsitassa attho. Āyasmato sāriputtassa sutvā bhikkhū dhāressantī’’ti. ‘‘Tenahāvuso, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Kittāvatā nu kho, āvuso, parihānadhammo puggalo vutto bhagavatā? Idhāvuso, bhikkhu assutañceva dhammaṃ na suṇāti, sutā cassa dhammā sammosaṃ gacchanti, ye cassa dhammā pubbe cetaso asamphuṭṭhapubbā te cassa na samudācaranti, aviññātañceva na vijānāti. Ettāvatā kho, āvuso, parihānadhammo puggalo vutto bhagavatā. ‘‘Kittāvatā ca panāvuso, aparihānadhammo puggalo vutto bhagavatā? Idhāvuso, bhikkhu assutañceva dhammaṃ suṇāti, sutā cassa dhammā na sammosaṃ gacchanti, ye cassa dhammā pubbe cetaso asamphuṭṭhapubbā te cassa samudācaranti, aviññātañceva vijānāti. Ettāvatā kho, āvuso, aparihānadhammo puggalo vutto bhagavatā. ‘‘No ce, āvuso, bhikkhu paracittapariyāyakusalo hoti, atha ‘sacittapariyāyakusalo bhavissāmī’ti – evañhi vo, āvuso, sikkhitabbaṃ. ‘‘Kathañcāvuso, bhikkhu sacittapariyāyakusalo hoti? Seyyathāpi, āvuso, itthī vā puriso vā daharo yuvā maṇḍanakajātiko ādāse vā parisuddhe pariyodāte acche vā udapatte sakaṃ mukhanimittaṃ paccavekkhamāno sace tattha passati rajaṃ vā aṅgaṇaṃ vā, tasseva rajassa vā aṅgaṇassa vā pahānāya vāyamati. No ce tattha passati rajaṃ vā aṅgaṇaṃ vā, tenevattamano hoti paripuṇṇasaṅkappo – ‘lābhā vata me, parisuddhaṃ vata me’ti. Evameva kho, āvuso, bhikkhuno paccavekkhaṇā bahukārā hoti kusalesu dhammesu – ‘anabhijjhālu nu kho bahulaṃ viharāmi, saṃvijjati nu kho me eso dhammo udāhu no, abyāpannacitto nu kho bahulaṃ viharāmi, saṃvijjati nu kho me eso dhammo udāhu no, vigatathinamiddho nu kho bahulaṃ viharāmi, saṃvijjati nu kho me eso dhammo udāhu no, anuddhato nu kho bahulaṃ viharāmi, saṃvijjati nu kho me eso dhammo udāhu no, tiṇṇavicikiccho nu kho bahulaṃ viharāmi, saṃvijjati nu kho me eso dhammo udāhu no, akkodhano nu kho bahulaṃ viharāmi, saṃvijjati nu kho me eso dhammo udāhu no, asaṃkiliṭṭhacitto nu kho bahulaṃ viharāmi, saṃvijjati nu kho me eso dhammo udāhu no, lābhī nu khomhi ajjhattaṃ dhammapāmojjassa, saṃvijjati nu kho me eso dhammo udāhu no, lābhī nu khomhi ajjhattaṃ cetosamathassa, saṃvijjati nu kho me eso dhammo udāhu no, lābhī nu khomhi adhipaññādhammavipassanāya, saṃvijjati nu kho me eso dhammo udāhu no’ti. ‘‘Sace pana, āvuso, bhikkhu paccavekkhamāno sabbepime kusale dhamme attani na samanupassati, tenāvuso, bhikkhunā sabbesaṃyeva imesaṃ kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, āvuso, ādittacelo vā ādittasīso vā. Tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya. Evamevaṃ kho, āvuso, tena bhikkhunā sabbesaṃyeva kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace panāvuso, bhikkhu paccavekkhamāno ekacce kusale dhamme attani samanupassati, ekacce kusale dhamme attani na samanupassati, tenāvuso, bhikkhunā ye kusale dhamme attani samanupassati tesu kusalesu dhammesu patiṭṭhāya, ye kusale dhamme attani na samanupassati tesaṃ kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. Seyyathāpi, āvuso, ādittacelo vā ādittasīso vā. Tasseva celassa vā sīsassa vā nibbāpanāya adhimattaṃ chandañca vāyāmañca ussāhañca ussoḷhiñca appaṭivāniñca satiñca sampajaññañca kareyya. Evamevaṃ kho, āvuso, tena bhikkhunā ye kusale dhamme attani samanupassati tesu kusalesu dhammesu patiṭṭhāya, ye kusale dhamme attani na samanupassati tesaṃ kusalānaṃ dhammānaṃ paṭilābhāya adhimatto chando ca vāyāmo ca ussāho ca ussoḷhī ca appaṭivānī ca sati ca sampajaññañca karaṇīyaṃ. ‘‘Sace panāvuso, bhikkhu paccavekkhamāno sabbepime kusale dhamme attani samanupassati, tenāvuso, bhikkhunā sabbesveva imesu kusalesu dhammesu patiṭṭhāya uttari āsavānaṃ khayāya yogo karaṇīyo’’ti. Pañcamaṃ.",
      "english": "Then, the Venerable Sāriputta addressed the bhikkhus, saying, \"Friends, bhikkhus!\" Those bhikkhus replied to the Venerable Sāriputta, \"Friend!\" The Venerable Sāriputta then said: \"Friends, it is said, 'A person prone to decline, a person prone to decline.' And it is also said, 'A person not prone to decline, a person not prone to decline.' Now, to what extent, friends, has a person prone to decline been declared by the Blessed One, and to what extent has a person not prone to decline been declared by the Blessed One?\" \"Friends, we have come from afar to the Venerable Sāriputta's presence to understand the meaning of this statement. It would be good if the Venerable Sāriputta himself would clarify the meaning of this statement. Having heard it from the Venerable Sāriputta, the bhikkhus will remember it.\" \"Therefore, friends, listen, and pay careful attention; I will speak.\" \"Yes, friend,\" those bhikkhus replied to the Venerable Sāriputta.\n\nThe Venerable Sāriputta then said: \"Now, to what extent, friends, has a person prone to decline been declared by the Blessed One? Here, friends, a bhikkhu does not listen to Dhamma that has not been heard before; the Dhamma he has heard falls into confusion; the Dhamma that had not previously touched his mind does not come to mind; and he does not fully understand what has not been fully understood. To this extent, friends, a person prone to decline has been declared by the Blessed One. And to what extent, friends, has a person not prone to decline been declared by the Blessed One? Here, friends, a bhikkhu listens to Dhamma that has not been heard before; the Dhamma he has heard does not fall into confusion; the Dhamma that had not previously touched his mind comes to mind; and he fully understands what has not been fully understood. To this extent, friends, a person not prone to decline has been declared by the Blessed One. If, friends, a bhikkhu is not skilled in discerning the minds of others, then you should train yourselves thus: 'I will be skilled in discerning my own mind.' And how, friends, is a bhikkhu skilled in discerning his own mind? Just as, friends, a woman or a man, young, youthful, and fond of adornment, on looking at their own facial reflection in a clean, brightly polished mirror or in a clear bowl of water, if they see any dust or blemish there, they strive to remove that dust or blemish. If they do not see any dust or blemish there, they are pleased with that, their aspiration is fulfilled, thinking: 'Indeed, it is my gain, indeed, I am pure.' In the same way, friends, a bhikkhu's self-reflection is of great benefit concerning wholesome qualities: 'Do I frequently dwell free from covetousness? Is this quality found in me or not? Do I frequently dwell with a mind free from ill-will? Is this quality found in me or not? Do I frequently dwell with sloth and torpor dispelled? Is this quality found in me or not? Do I frequently dwell without restlessness? Is this quality found in me or not? Do I frequently dwell with doubt overcome? Is this quality found in me or not? Do I frequently dwell free from anger? Is this quality found in me or not? Do I frequently dwell with an uncorrupted mind? Is this quality found in me or not? Am I a recipient of inner joy in the Dhamma? Is this quality found in me or not? Am I a recipient of inner mental tranquility? Is this quality found in me or not? Am I a recipient of higher wisdom and insight into the Dhamma? Is this quality found in me or not?' If, friends, a bhikkhu, on reflecting, does not find all these wholesome qualities within himself, then that bhikkhu should undertake extraordinary desire, effort, exertion, endeavor, unremittingness, mindfulness, and clear comprehension for the acquisition of all these wholesome qualities. Just as, friends, if one's clothes or head were aflame, one would undertake extraordinary desire, effort, exertion, endeavor, unremittingness, mindfulness, and clear comprehension to extinguish that fire on one's clothes or head. In the same way, friends, that bhikkhu should undertake extraordinary desire, effort, exertion, endeavor, unremittingness, mindfulness, and clear comprehension for the acquisition of all these wholesome qualities. But if, friends, a bhikkhu, on reflecting, finds some wholesome qualities within himself but not others, then that bhikkhu, having established himself in those wholesome qualities he finds within himself, should undertake extraordinary desire, effort, exertion, endeavor, unremittingness, mindfulness, and clear comprehension for the acquisition of those wholesome qualities he does not find within himself. Just as, friends, if one's clothes or head were aflame, one would undertake extraordinary desire, effort, exertion, endeavor, unremittingness, mindfulness, and clear comprehension to extinguish that fire on one's clothes or head.\n\nJust as for the extinguishing of that burning cloth or burning head, one would generate supreme zeal, sustained effort, determined energy, indefatigability, unwavering mindfulness, and clear comprehension.\n\nEven so, indeed, friends, that monk, having established himself in the wholesome qualities he discerns within himself, should generate supreme zeal, sustained effort, determined energy, indefatigability, unwavering mindfulness, and clear comprehension for the acquisition of those wholesome qualities he does not discern within himself.\n\n“But if, friends, a monk, reviewing, discerns all these wholesome qualities within himself, then, friends, having established himself in all these wholesome qualities, further practice for the destruction of the taints should be undertaken.”",
      "sinhala": "එහිලා ආයුෂ්මත් ශ්‍රාරීපුත්‍රයන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළහ: \"ඇවැත්නි භික්ෂූනි!\" \"ඇවැත්නි\"යි ඒ භික්ෂූහු ආයුෂ්මත් ශ්‍රාරීපුත්‍රයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශ්‍රාරීපුත්‍රයන් වහන්සේ මේ කාරණය වදාළහ: \"‘පිරිහීමට සුදුසු පුද්ගලයා, පිරිහීමට සුදුසු පුද්ගලයා’ යැයි, ඇවැත්නි, කියනු ලැබේ. ‘නොපිරිහීමට සුදුසු පුද්ගලයා, නොපිරිහීමට සුදුසු පුද්ගලයා’ යැයි, ඇවැත්නි, කියනු ලැබේ. ඇවැත්නි, කොපමණකින් නම් පිරිහීමට සුදුසු පුද්ගලයා යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේද? කොපමණකින් නම් නොපිරිහීමට සුදුසු පුද්ගලයා යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේද?\" \"ඇවැත්නි, මේ බසෙහි අර්ථය දැනගනු පිණිස අපි දුර සිට ආයුෂ්මත් ශ්‍රාරීපුත්‍රයන් වහන්සේගේ සමීපයට පැමිණියෙමු. මේ බසෙහි අර්ථය ආයුෂ්මත් ශ්‍රාරීපුත්‍රයන් වහන්සේටම වැටහේ නම් ඉතා මැනවි. ආයුෂ්මත් ශ්‍රාරීපුත්‍රයන් වහන්සේගෙන් අසා භික්ෂූහු (එය) දරාගන්නාහුය.\" \"එසේ නම් ඇවැත්නි, අසන්න, මැනවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.\" \"එසේය ඇවැත්නි\"යි ඒ භික්ෂූහු ආයුෂ්මත් ශ්‍රාරීපුත්‍රයන් වහන්සේට පිළිතුරු දුන්හ. ආයුෂ්මත් ශ්‍රාරීපුත්‍රයන් වහන්සේ මේ කාරණය වදාළහ:\n\n\"ඇවැත්නි, කොපමණකින් නම් පිරිහීමට සුදුසු පුද්ගලයා යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේද? ඇවැත්නි, මෙහිලා යම් භික්ෂුවක් නුඇසූ ධර්මයක් නොඅසන්නේද, ඔහුට අසන ලද ධර්මයන්ද ව්‍යාකූලභාවයට පත්වන්නේද, යම් ධර්මයන් ඔහුගේ සිතට පෙර කිසිදා ස්පර්ශ නොවූයේද, ඒ ධර්මයන් ඔහුට සිහියට නොනැඟෙන්නේද, අවිඥාත වූ ධර්මය නොදන්නේද, ඇවැත්නි, මෙපමණකින් පිරිහීමට සුදුසු පුද්ගලයා යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේය.\n\nඇවැත්නි, කොපමණකින් නම් නොපිරිහීමට සුදුසු පුද්ගලයා යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේද? ඇවැත්නි, මෙහිලා යම් භික්ෂුවක් නුඇසූ ධර්මයක් අසන්නේද, ඔහුට අසන ලද ධර්මයන්ද ව්‍යාකූලභාවයට පත් නො වන්නේද, යම් ධර්මයන් ඔහුගේ සිතට පෙර කිසිදා ස්පර්ශ නොවූයේද, ඒ ධර්මයන් ඔහුට සිහියට නැඟෙන්නේද, අවිඥාත වූ ධර්මය දන්නේද, ඇවැත්නි, මෙපමණකින් නොපිරිහීමට සුදුසු පුද්ගලයා යැයි භාග්‍යවතුන් වහන්සේ විසින් වදාරන ලද්දේය.\n\nඇවැත්නි, යම් හෙයකින් භික්ෂුවක් අනුන්ගේ සිත් දැනගැනීමේ ප්‍රඥාවෙන් යුක්ත නොවන්නේ නම්, ‘තමාගේ සිත් දැනගැනීමේ ප්‍රඥාවෙන් යුක්ත වන්නෙමි’ යැයි – ඇවැත්නි, මෙසේ නුඹලා විසින් හික්මිය යුතුය.\n\nඇවැත්නි, භික්ෂුවක් තමාගේ සිත් දැනගැනීමේ ප්‍රඥාවෙන් යුක්ත වන්නේ කෙසේද? ඇවැත්නි, යම්සේ, අලංකාරයට කැමති තරුණ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ පිරිසිදු වූ, මනාව ඔපදැමූ කැඩපතක හෝ පැහැදිලි දිය පිරුණු භාජනයක හෝ තමාගේ මුහුණේ ස්වභාවය පිරික්සා බලන්නේ, එහි කිලිටි තලයක් හෝ කැළලක් හෝ දකින්නේ නම්, ඒ කිලිටි තලය හෝ කැළල පහකිරීමට උත්සාහ කරන්නේද, යම් හෙයකින් එහි කිලිටි තලයක් හෝ කැළලක් හෝ නොදකින්නේ නම්, ඔහු ඒ පිළිබඳවම සතුටු සිතින් යුක්තව, ‘මාගේ ලාභයකි, මා පිරිසිදුය’යි සිතා පූර්ණ වූ සිතුවිලි ඇතිව සිටින්නේද, ඇවැත්නි, එපරිද්දෙන්ම භික්ෂුවකගේ පිරික්සීම කුසල ධර්මයන් පිළිබඳව මහත් උපකාරී වේ: ‘මම නිතර අභිධ්‍යා රහිතව වාසය කරම්ද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම නිතර ව්‍යාපාද රහිත සිතින් වාසය කරම්ද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම නිතර තීනමිද්ධයෙන් පහවී වාසය කරම්ද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම නිතර උද්දච්චකමින් තොරව වාසය කරම්ද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම නිතර විචිකිච්ඡාවෙන් එතෙරව වාසය කරම්ද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම නිතර ක්‍රෝධ රහිතව වාසය කරම්ද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම නිතර කෙලෙස්වලින් අපිරිසිදු නොවු සිතින් වාසය කරම්ද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම අභ්‍යන්තර ධර්ම ප්‍රමෝදය ලබන්නේද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම අභ්‍යන්තර චිත්ත සමාධිය ලබන්නේද? මේ ධර්මය මා තුළ තිබේද නැද්ද? මම උසස් ප්‍රඥාව වූ ධර්ම විපස්සනාව ලබන්නේද? මේ ධර්මය මා තුළ තිබේද නැද්ද?’\n\nඇවැත්නි, යම් හෙයකින් භික්ෂුවක් පිරික්සා බලන විට මේ සියලු කුසල ධර්මයන් තමා තුළ නොදකින්නේ නම්, ඇවැත්නි, ඒ භික්ෂුව විසින් මේ සියලු කුසල ධර්මයන් ලැබීම පිණිස අතිශයින් වැඩි කැමැත්තක්ද, වීර්යයක්ද, උත්සාහයක්ද, දැඩි අධිෂ්ඨානයක්ද, නොපසුබට බවක්ද, සිහියක්ද, මනා දැනීමක්ද කළ යුතුය. ඇවැත්නි, යම්සේ ගිනිගත් වස්ත්‍ර ඇත්තෙක් හෝ ගිනිගත් හිස ඇත්තෙක් හෝ වෙයිද, ඒ වස්ත්‍රයේ හෝ හිසේ ගින්න නිවීමට අතිශයින් වැඩි කැමැත්තක්ද, වීර්යයක්ද, උත්සාහයක්ද, දැඩි අධිෂ්ඨානයක්ද, නොපසුබට බවක්ද, සිහියක්ද, මනා දැනීමක්ද කරන්නේද, ඇවැත්නි, එපරිද්දෙන්ම ඒ භික්ෂුව විසින් මේ සියලු කුසල ධර්මයන් ලැබීම පිණිස අතිශයින් වැඩි කැමැත්තක්ද, වීර්යයක්ද, උත්සාහයක්ද, දැඩි අධිෂ්ඨානයක්ද, නොපසුබට බවක්ද, සිහියක්ද, මනා දැනීමක්ද කළ යුතුය.\n\nඇවැත්නි, යම් හෙයකින් භික්ෂුවක් පිරික්සා බලන විට ඇතැම් කුසල ධර්මයන් තමා තුළ දකින්නේ නම්, ඇතැම් කුසල ධර්මයන් තමා තුළ නොදකින්නේ නම්, ඇවැත්නි, ඒ භික්ෂුව විසින් තමා තුළ දකින ලද ඒ කුසල ධර්මයන්හි පිහිටා, තමා තුළ නොදකින ලද ඒ කුසල ධර්මයන් ලැබීම පිණිස අතිශයින් වැඩි කැමැත්තක්ද, වීර්යයක්ද, උත්සාහයක්ද, දැඩි අධිෂ්ඨානයක්ද, නොපසුබට බවක්ද, සිහියක්ද, මනා දැනීමක්ද කළ යුතුය. ඇවැත්නි, යම්සේ ගිනිගත් වස්ත්‍ර ඇත්තෙක් හෝ ගිනිගත් හිස ඇත්තෙක් හෝ වෙයිද.\n\nඑම වස්ත්‍රයේ හෝ හිසේ ගිනි නිවා දැමීම පිණිස අතිශයින් ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, වීර්යයද, නොපසුබට බවද, සිහියද, සම්පජඤ්ඤයද ඇතිකරගත යුතු ය.\n\nඇවැත්නි, එසෙව්ම ඒ භික්ෂුව විසින් තමා තුළ යම් කුසල ධර්‍මයන් දක්නේ නම්, ඒ කුසල ධර්‍මයන්හි පිහිටා, තමා තුළ යම් කුසල ධර්‍මයන් නොදක්නේ නම්, ඒ කුසල ධර්‍මයන් ලබා ගැනීම පිණිස අතිශයින් ඡන්දයද, ව්‍යායාමයද, උත්සාහයද, වීර්යයද, නොපසුබට බවද, සිහියද, සම්පජඤ්ඤයද කළ යුතු ය.\n\n‘‘එහෙත් ඇවැත්නි, යම් හෙයකින් භික්ෂුව තමා ප්‍රතිවේක්ෂා කරමින් මේ සියලු කුසල ධර්‍මයන් තමා තුළ දක්නේ නම්, ඇවැත්නි, ඒ භික්ෂුව විසින් මේ සියලු කුසල ධර්‍මයන්හිම පිහිටා ආශ්‍රවයන්ගේ ක්ෂය කිරීම පිණිස තවදුරටත් යෝගය (උත්සාහය) කළ යුතු ය’’ යි.\n\nපස්වැනි කොටසයි.",
      "paliTitle": "Parihānasuttaṃ"
    },
    {
      "number": 56,
      "pali": "‘‘Dasayimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. Katamā dasa? Asubhasaññā, maraṇasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā, aniccasaññā, anicce dukkhasaññā, dukkhe anattasaññā, pahānasaññā, virāgasaññā, nirodhasaññā – imā kho, bhikkhave, dasa saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, these ten perceptions, when cultivated and frequently practiced, are of great fruit, of great benefit, steeped in the Deathless, culminating in the Deathless. What are these ten? The perception of unattractiveness, the perception of death, the perception of repulsiveness in food, the perception of non-delight in the entire world, the perception of impermanence, the perception of suffering in the impermanent, the perception of non-self in suffering, the perception of abandoning, the perception of dispassion, the perception of cessation – these ten perceptions, monks, when cultivated and frequently practiced, are of great fruit, of great benefit, steeped in the Deathless, culminating in the Deathless.",
      "sinhala": "භික්ෂූනි, වඩන ලදුව බහුල වශයෙන් පුරුදු කරන ලද්දාහු වූ මේ දස සංඥාවෝ මහාඵල ඇත්තාහු වෙති, මහානිසංස ඇත්තාහු වෙති, අමෘතය අවගාහනය කරන්නාහු වෙති, අමෘතයෙන් කෙළවර වන්නාහු වෙති. කවර දසයක් ද?\n\nඅසුභ සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, සියලු ලෝකයෙහි නොඇලෙන සංඥාව, අනිත්‍ය සංඥාව, අනිත්‍ය වූ දෙයෙහි දුක්ඛ සංඥාව, දුක්ඛ වූ දෙයෙහි අනාත්ම සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව, නිරෝධ සංඥාවයි. භික්ෂූනි, වඩන ලදුව බහුල වශයෙන් පුරුදු කරන ලද්දාහු වූ මේ දස සංඥාවෝ මහාඵල ඇත්තාහු වෙති, මහානිසංස ඇත්තාහු වෙති, අමෘතය අවගාහනය කරන්නාහු වෙති, අමෘතයෙන් කෙළවර වන්නාහු වෙති.",
      "paliTitle": "Paṭhamasaññāsuttaṃ"
    },
    {
      "number": 57,
      "pali": "‘‘Dasayimā, bhikkhave, saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā. Katamā dasa? Aniccasaññā, anattasaññā, maraṇasaññā, āhāre paṭikūlasaññā, sabbaloke anabhiratasaññā, aṭṭhikasaññā, puḷavakasaññā [pulavakasaññā (sī. pī.), puḷuvakasaññā (ka.), a. ni. 1.463- 472], vinīlakasaññā, vicchiddakasaññā, uddhumātakasaññā – imā kho, bhikkhave, dasa saññā bhāvitā bahulīkatā mahapphalā honti mahānisaṃsā amatogadhā amatapariyosānā’’ti. Sattamaṃ.",
      "english": "Monks, these ten perceptions, when developed and frequently practiced, are of great fruit, of great benefit, penetrate to the Deathless, and culminate in the Deathless. Which ten? The perception of impermanence, the perception of non-self, the perception of death, the perception of the loathsomeness of food, the perception of disenchantment with the entire world, the perception of a skeleton, the perception of a corpse infested with worms, the perception of a bluish-discolored corpse, the perception of a fissured corpse, and the perception of a bloated corpse. Indeed, monks, these ten perceptions, when developed and frequently practiced, are of great fruit, of great benefit, penetrate to the Deathless, and culminate in the Deathless.",
      "sinhala": "මහණෙනි, මේ සංඥා දසය වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහාඵල ඇත්තේ වෙයි, මහත් ආනිශංස ඇත්තේ වෙයි, අමා මහ නිවනට පිවිසියේ වෙයි, අමා මහ නිවන අවසන් කොට ඇත්තේ වෙයි.\n\nකවර දසයක් ද?\n\nඅනිත්‍ය සංඥාව, අනාත්ම සංඥාව, මරණ සංඥාව, ආහාරයෙහි පිළිකුල් සංඥාව, මුළු ලෝකය කෙරෙහිම නොඇලීමේ සංඥාව, අස්ථි සංඥාව, පණු සංඥාව, නීලවර්ණ වූ මළ සිරුර පිළිබඳ සංඥාව, ඡේදනය වූ මළ සිරුර පිළිබඳ සංඥාව, ඉදිමුණු මළ සිරුර පිළිබඳ සංඥාව – මහණෙනි, මේ සංඥා දසය වඩන ලදුව, බහුල වශයෙන් පුරුදු කරන ලදුව මහාඵල ඇත්තේ වෙයි, මහත් ආනිශංස ඇත්තේ වෙයි, අමා මහ නිවනට පිවිසියේ වෙයි, අමා මහ නිවන අවසන් කොට ඇත්තේ වෙයි.",
      "paliTitle": "Dutiyasaññāsuttaṃ"
    },
    {
      "number": 58,
      "pali": "[a. ni. 8.83] ‘‘Sace, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘kiṃmūlakā, āvuso, sabbe dhammā, kiṃsambhavā sabbe dhammā, kiṃsamudayā sabbe dhammā, kiṃsamosaraṇā sabbe dhammā, kiṃpamukhā sabbe dhammā, kiṃadhipateyyā sabbe dhammā, kiṃuttarā sabbe dhammā, kiṃsārā sabbe dhammā, kiṃogadhā sabbe dhammā, kiṃpariyosānā sabbe dhammā’ti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ kinti byākareyyāthā’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaṃyeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Sace, bhikkhave, aññatitthiyā paribbājakā evaṃ puccheyyuṃ – ‘kiṃmūlakā, āvuso, sabbe dhammā, kiṃsambhavā sabbe dhammā, kiṃsamudayā sabbe dhammā, kiṃsamosaraṇā sabbe dhammā kiṃpamukhā sabbe dhammā, kiṃ adhipateyyā sabbe dhammā, kiṃuttarā sabbe dhammā, kiṃsārā sabbe dhammā, kiṃogadhā sabbe dhammā, kiṃpariyosānā sabbe dhammā’ti, evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyātha – ‘chandamūlakā, āvuso, sabbe dhammā, manasikārasambhavā sabbe dhammā, phassasamudayā sabbe dhammā, vedanāsamosaraṇā sabbe dhammā, samādhippamukhā sabbe dhammā, satādhipateyyā sabbe dhammā, paññuttarā sabbe dhammā, vimuttisārā sabbe dhammā, amatogadhā sabbe dhammā, nibbānapariyosānā sabbe dhammā’ti. Evaṃ puṭṭhā tumhe, bhikkhave, tesaṃ aññatitthiyānaṃ paribbājakānaṃ evaṃ byākareyyāthā’’ti. Aṭṭhamaṃ.",
      "english": "\"Monks, if other wanderers, ascetics of other sects, were to ask you thus: ‘Friends, what is the root of all phenomena? What is the origin of all phenomena? What is the source of all phenomena? What is the convergence of all phenomena? What is the leader of all phenomena? What is the governing principle of all phenomena? What is the supreme quality of all phenomena? What is the essence of all phenomena? What is the immersion of all phenomena? What is the culmination of all phenomena?’ When thus questioned, monks, how would you answer those other wanderers, ascetics of other sects?\"\n\n\"For us, venerable sir, the Dhamma has the Blessed One as its root, the Blessed One as its guide, the Blessed One as its refuge. It would be excellent, venerable sir, if the meaning of this statement would occur to the Blessed One himself. Having heard from the Blessed One, the monks will remember it.\"\n\n\"In that case, monks, listen, attend carefully; I shall speak.\"\n\n\"Yes, venerable sir,\" those monks replied to the Blessed One. The Blessed One spoke this:\n\n\"Monks, if other wanderers, ascetics of other sects, were to ask you thus: ‘Friends, what is the root of all phenomena? What is the origin of all phenomena? What is the source of all phenomena? What is the convergence of all phenomena? What is the leader of all phenomena? What is the governing principle of all phenomena? What is the supreme quality of all phenomena? What is the essence of all phenomena? What is the immersion of all phenomena? What is the culmination of all phenomena?’ When thus questioned, monks, you should answer those other wanderers, ascetics of other sects, in this way:\n\n‘Friends, all phenomena are rooted in volitional impulse; all phenomena arise from careful attention; all phenomena originate from contact; all phenomena converge upon feeling; all phenomena are led by concentration; all phenomena are governed by mindfulness; all phenomena are supreme in wisdom; all phenomena have liberation as their essence; all phenomena are immersed in the Deathless; all phenomena culminate in Nibbāna.’ When thus questioned, monks, you should answer those other wanderers, ascetics of other sects, in this way.\"",
      "sinhala": "මහණෙනි, යම් හෙයකින් අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ අසත්නම් – ‘ඇවැත්නි, සියලු ධර්මයන්ගේ මුල කුමක්ද? සියලු ධර්මයෝ කුමකින් හටගනිත්ද? සියලු ධර්මයන්ගේ සමුදය කුමක්ද? සියලු ධර්මයෝ කුමක් කරා එක්රැස් වෙත්ද? සියලු ධර්මයන්ට ප්‍රමුඛ වන්නේ කුමක්ද? සියලු ධර්මයන්ට අධිපති වන්නේ කුමක්ද? සියලු ධර්මයන්ට උත්තරීතර වන්නේ කුමක්ද? සියලු ධර්මයන්ගේ සාරය කුමක්ද? සියලු ධර්මයෝ කුමක් තුළ ගිලී ඇත්තාහුද? සියලු ධර්මයන්ගේ අවසානය කුමක්ද?’ කියා, මහණෙනි, මෙසේ අසන ලද ඔබ, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට කෙසේ පිළිතුරු දෙන්නෙහිද?\n\nවහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහුය. භාග්‍යවතුන් වහන්සේ විසින් මෙහෙයවනු ලබන්නාහුය. භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහුය. වහන්ස, මේ දේශනාවේ අර්ථය භාග්‍යවතුන් වහන්සේටම වැටහේවා! භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණය කොට භික්ෂූහු එය සිත්හි රඳවා ගනිති.\n\nමහණෙනි, එසේනම් අසන්න. මනාකොට මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි. ‘එසේය, වහන්ස’ යැයි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිවදන් දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.\n\nමහණෙනි, යම් හෙයකින් අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ මෙසේ අසත්නම් – ‘ඇවැත්නි, සියලු ධර්මයන්ගේ මුල කුමක්ද? සියලු ධර්මයෝ කුමකින් හටගනිත්ද? සියලු ධර්මයන්ගේ සමුදය කුමක්ද? සියලු ධර්මයෝ කුමක් කරා එක්රැස් වෙත්ද? සියලු ධර්මයන්ට ප්‍රමුඛ වන්නේ කුමක්ද? සියලු ධර්මයන්ට අධිපති වන්නේ කුමක්ද? සියලු ධර්මයන්ට උත්තරීතර වන්නේ කුමක්ද? සියලු ධර්මයන්ගේ සාරය කුමක්ද? සියලු ධර්මයෝ කුමක් තුළ ගිලී ඇත්තාහුද? සියලු ධර්මයන්ගේ අවසානය කුමක්ද?’ කියා, මහණෙනි, මෙසේ අසන ලද ඔබ, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පිළිතුරු දිය යුතුය – ‘ඇවැත්නි, සියලු ධර්මයෝ ඡන්දය (කිරීමට ඇති කැමැත්ත) මුල් කොට ඇත්තාහුය. සියලු ධර්මයෝ මනසිකාරයෙන් හටගන්නාහ. සියලු ධර්මයන්ගේ සමුදය ස්පර්ශයයි. සියලු ධර්මයෝ වේදනාව කරා එක්රැස් වෙති. සියලු ධර්මයන්ට සමාධිය ප්‍රමුඛ වේ. සියලු ධර්මයන්ට සතිය අධිපති වේ. සියලු ධර්මයන්ට ප්‍රඥාව උත්තරීතර වේ. සියලු ධර්මයන්ගේ සාරය විමුක්තියයි. සියලු ධර්මයෝ අමෘතය (නිවන) තුළ ගිලී ඇත්තාහුය. සියලු ධර්මයන්ගේ අවසානය නිවනයි’ කියාය. මහණෙනි, මෙසේ අසන ලද ඔබ, ඒ අන්‍ය තීර්ථක පරිබ්‍රාජකයන්ට මෙසේ පිළිතුරු දිය යුතුය.",
      "paliTitle": "Mūlakasuttaṃ"
    },
    {
      "number": 59,
      "pali": "‘‘Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘yathāpabbajjāparicitañca no cittaṃ bhavissati, na cuppannā pāpakā akusalā dhammā cittaṃ pariyādāya ṭhassanti; aniccasaññāparicitañca no cittaṃ bhavissati, anattasaññāparicitañca no cittaṃ bhavissati, asubhasaññāparicitañca no cittaṃ bhavissati, ādīnavasaññāparicitañca no cittaṃ bhavissati, lokassa samañca visamañca ñatvā taṃsaññāparicitañca no cittaṃ bhavissati, lokassa bhavañca [sambhavañca (sī. syā.)] vibhavañca ñatvā taṃsaññāparicitañca no cittaṃ bhavissati, lokassa samudayañca atthaṅgamañca ñatvā taṃsaññāparicitañca no cittaṃ bhavissati, pahānasaññāparicitañca no cittaṃ bhavissati, virāgasaññāparicitañca no cittaṃ bhavissati, nirodhasaññāparicitañca no cittaṃ bhavissatī’ti – evañhi vo, bhikkhave, sikkhitabbaṃ. ‘‘Yato kho, bhikkhave, bhikkhuno yathāpabbajjāparicitañca cittaṃ hoti na cuppannā pāpakā akusalā dhammā cittaṃ pariyādāya tiṭṭhanti, aniccasaññāparicitañca cittaṃ hoti, anattasaññāparicitañca cittaṃ hoti, asubhasaññāparicitañca cittaṃ hoti, ādīnavasaññāparicitañca cittaṃ hoti, lokassa samañca visamañca ñatvā taṃsaññāparicitañca cittaṃ hoti, lokassa bhavañca vibhavañca ñatvā taṃsaññāparicitañca cittaṃ hoti, lokassa samudayañca atthaṅgamañca ñatvā taṃsaññāparicitañca cittaṃ hoti, pahānasaññāparicitañca cittaṃ hoti, virāgasaññāparicitañca cittaṃ hoti, nirodhasaññāparicitañca cittaṃ hoti, tassa dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Navamaṃ.",
      "english": "Therefore, monks, you should train yourselves thus: ‘Our minds will be practiced in accordance with the renunciate life, and no arisen evil, unwholesome states will overwhelm the mind. Our minds will be familiarized with the perception of impermanence, our minds will be familiarized with the perception of non-self, our minds will be familiarized with the perception of unattractiveness, our minds will be familiarized with the perception of danger. Our minds will be familiarized with the perception of having known the world's true nature and its distortions; our minds will be familiarized with the perception of having known the world's becoming and its cessation; our minds will be familiarized with the perception of having known the world's arising and passing away. Our minds will be familiarized with the perception of abandoning, our minds will be familiarized with the perception of dispassion, our minds will be familiarized with the perception of cessation.’ Thus, monks, you should train yourselves.\n\nWhen, monks, a monk's mind is practiced in accordance with the renunciate life, and no arisen evil, unwholesome states overwhelm his mind; when his mind is familiarized with the perception of impermanence, his mind is familiarized with the perception of non-self, his mind is familiarized with the perception of unattractiveness, his mind is familiarized with the perception of danger; when his mind is familiarized with the perception of having known the world's true nature and its distortions; when his mind is familiarized with the perception of having known the world's becoming and its cessation; when his mind is familiarized with the perception of having known the world's arising and passing away; when his mind is familiarized with the perception of abandoning, his mind is familiarized with the perception of dispassion, his mind is familiarized with the perception of cessation – then for him, one of two fruits can be expected: ultimate knowledge in this very life, or, if there is a remaining basis for existence, non-returning.",
      "sinhala": "එහෙයින්, මහණෙනි, මෙසේ හික්මිය යුතු යි: ‘අපගේ සිත පැවිදි බවට සුදුසු ලෙස හොඳින් පුරුදු පුහුණු වන්නේ ය; හටගත් පාපී අකුසල ධර්මයන් සිත සම්පූර්ණයෙන් යටපත් කර නොගන්නේ ය; අපගේ සිත අනිත්‍ය සංඥාවට හොඳින් පුරුදු පුහුණු වන්නේ ය; අනාත්ම සංඥාවට හොඳින් පුරුදු පුහුණු වන්නේ ය; අශුභ සංඥාවට හොඳින් පුරුදු පුහුණු වන්නේ ය; ආදීනව සංඥාවට හොඳින් පුරුදු පුහුණු වන්නේ ය; ලෝකයේ සම බව හා විසම බව දැන, එම සංඥාවට අපගේ සිත හොඳින් පුරුදු පුහුණු වන්නේ ය; ලෝකයේ භවය හා විභවය දැන, එම සංඥාවට අපගේ සිත හොඳින් පුරුදු පුහුණු වන්නේ ය; ලෝකයේ සමුදය හා අත්ථංගමය දැන, එම සංඥාවට අපගේ සිත හොඳින් පුරුදු පුහුණු වන්නේ ය; ප්‍රහාණ සංඥාවට හොඳින් පුරුදු පුහුණු වන්නේ ය; විරාග සංඥාවට හොඳින් පුරුදු පුහුණු වන්නේ ය; නිරෝධ සංඥාවට හොඳින් පුරුදු පුහුණු වන්නේ ය’ කියා ය. එහෙයින්, මහණෙනි, මෙසේ ඔබ හික්මිය යුතු යි.\n\nයම් කලක, මහණෙනි, භික්ෂුවකගේ සිත පැවිදි බවට සුදුසු ලෙස හොඳින් පුරුදු පුහුණු වී ද, හටගත් පාපී අකුසල ධර්මයන් සිත සම්පූර්ණයෙන් යටපත් කර නොගනියි ද, සිත අනිත්‍ය සංඥාවට හොඳින් පුරුදු පුහුණු වී ද, අනාත්ම සංඥාවට හොඳින් පුරුදු පුහුණු වී ද, අශුභ සංඥාවට හොඳින් පුරුදු පුහුණු වී ද, ආදීනව සංඥාවට හොඳින් පුරුදු පුහුණු වී ද, ලෝකයේ සම බව හා විසම බව දැන, එම සංඥාවට සිත හොඳින් පුරුදු පුහුණු වී ද, ලෝකයේ භවය හා විභවය දැන, එම සංඥාවට සිත හොඳින් පුරුදු පුහුණු වී ද, ලෝකයේ සමුදය හා අත්ථංගමය දැන, එම සංඥාවට සිත හොඳින් පුරුදු පුහුණු වී ද, ප්‍රහාණ සංඥාවට හොඳින් පුරුදු පුහුණු වී ද, විරාග සංඥාවට හොඳින් පුරුදු පුහුණු වී ද, නිරෝධ සංඥාවට හොඳින් පුරුදු පුහුණු වී ද, එබඳු ඔහුට ඵල දෙකකින් එක ඵලයක් අපේක්ෂා කළ හැකි යි. එනම්, මේ ආත්මභාවයෙහි දී ම අර්හත්වය අවබෝධ කර ගැනීම යි. නැතහොත්, (සකල ක්ලේශයන් පහ නොවී) උපධි ඉතිරිව ඇත්නම්, අනාගාමි බව යි.",
      "paliTitle": "Pabbajjāsuttaṃ"
    },
    {
      "number": 60,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā girimānando ābādhiko hoti dukkhito bāḷhagilāno. Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā ānando bhagavantaṃ etadavoca – ‘‘Āyasmā, bhante, girimānando ābādhiko hoti dukkhito bāḷhagilāno. Sādhu, bhante, bhagavā yenāyasmā girimānando tenupasaṅkamatu anukampaṃ upādāyā’’ti. ‘‘Sace kho tvaṃ, ānanda, girimānandassa bhikkhuno dasa saññā bhāseyyāsi, ṭhānaṃ kho panetaṃ vijjati yaṃ girimānandassa bhikkhuno dasa saññā sutvā so ābādho ṭhānaso paṭippassambheyya. ‘‘Katamā dasa? Aniccasaññā, anattasaññā, asubhasaññā, ādīnavasaññā, pahānasaññā, virāgasaññā, nirodhasaññā, sabbaloke anabhiratasaññā [anabhiratisaññā (ka.)], sabbasaṅkhāresu anicchāsaññā, ānāpānassati. ‘‘Katamā cānanda, aniccasaññā? Idhānanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘rūpaṃ aniccaṃ, vedanā aniccā, saññā aniccā, saṅkhārā aniccā, viññāṇaṃ anicca’nti. Iti imesu pañcasu upādānakkhandhesu aniccānupassī viharati. Ayaṃ vuccatānanda, aniccasaññā. ‘‘Katamā cānanda, anattasaññā? Idhānanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘cakkhu anattā, rūpā anattā, sotaṃ anattā, saddā anattā, ghānaṃ anattā, gandhā anattā, jivhā anattā, rasā anattā, kāyā anattā, phoṭṭhabbā anattā, mano anattā, dhammā anattā’ti. Iti imesu chasu ajjhattikabāhiresu āyatanesu anattānupassī viharati. Ayaṃ vuccatānanda, anattasaññā. ‘‘Katamā cānanda, asubhasaññā? Idhānanda, bhikkhu imameva kāyaṃ uddhaṃ pādatalā adho kesamatthakā tacapariyantaṃ pūraṃ nānāppakārassa asucino paccavekkhati – ‘atthi imasmiṃ kāye kesā lomā nakhā dantā taco maṃsaṃ nhāru aṭṭhi aṭṭhimiñjaṃ vakkaṃ hadayaṃ yakanaṃ kilomakaṃ pihakaṃ papphāsaṃ antaṃ antaguṇaṃ udariyaṃ karīsaṃ pittaṃ semhaṃ pubbo lohitaṃ sedo medo assu vasā kheḷo siṅghāṇikā lasikā mutta’nti. Iti imasmiṃ kāye asubhānupassī viharati. Ayaṃ vuccatānanda, asubhasaññā. ‘‘Katamā cānanda, ādīnavasaññā? Idhānanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘bahudukkho kho ayaṃ kāyo bahuādīnavo? Iti imasmiṃ kāye vividhā ābādhā uppajjanti, seyyathidaṃ – cakkhurogo sotarogo ghānarogo jivhārogo kāyarogo sīsarogo kaṇṇarogo mukharogo dantarogo oṭṭharogo kāso sāso pināso ḍāho [ḍaho (sī. syā.)] jaro kucchirogo mucchā pakkhandikā sūlā visūcikā kuṭṭhaṃ gaṇḍo kilāso soso apamāro daddu kaṇḍu kacchu nakhasā vitacchikā lohitaṃ pittaṃ [lohitapittaṃ (sī.)] madhumeho aṃsā piḷakā bhagandalā pittasamuṭṭhānā ābādhā semhasamuṭṭhānā ābādhā vātasamuṭṭhānā ābādhā sannipātikā ābādhā utupariṇāmajā ābādhā visamaparihārajā ābādhā opakkamikā ābādhā kammavipākajā ābādhā sītaṃ uṇhaṃ jighacchā pipāsā uccāro passāvo’ti. Iti imasmiṃ kāye ādīnavānupassī viharati. Ayaṃ vuccatānanda, ādīnavasaññā. ‘‘Katamā cānanda, pahānasaññā? Idhānanda, bhikkhu uppannaṃ kāmavitakkaṃ nādhivāseti, pajahati, vinodeti, byantīkaroti, anabhāvaṃ gameti. Uppannaṃ byāpādavitakkaṃ nādhivāseti, pajahati, vinodeti, byantīkaroti, anabhāvaṃ gameti. Uppannaṃ vihiṃsāvitakkaṃ nādhivāseti, pajahati, vinodeti, byantīkaroti, anabhāvaṃ gameti. Uppannuppanne pāpake akusale dhamme nādhivāseti, pajahati, vinodeti, byantīkaroti, anabhāvaṃ gameti. Ayaṃ vuccatānanda, pahānasaññā. ‘‘Katamā cānanda, virāgasaññā? Idhānanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhippaṭinissaggo taṇhākkhayo virāgo nibbāna’nti. Ayaṃ vuccatānanda, virāgasaññā. ‘‘Katamā cānanda, nirodhasaññā? Idhānanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā iti paṭisañcikkhati – ‘etaṃ santaṃ etaṃ paṇītaṃ yadidaṃ sabbasaṅkhārasamatho sabbūpadhippaṭinissaggo taṇhākkhayo nirodho nibbāna’nti. Ayaṃ vuccatānanda, nirodhasaññā. ‘‘Katamā cānanda, sabbaloke anabhiratasaññā? Idhānanda, bhikkhu ye loke upādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahanto viharati anupādiyanto. Ayaṃ vuccatānanda, sabbaloke anabhiratasaññā. ‘‘Katamā cānanda, sabbasaṅkhāresu anicchāsaññā? Idhānanda, bhikkhu sabbasaṅkhāresu aṭṭīyati harāyati jigucchati. Ayaṃ vuccatānanda, sabbasaṅkhāresu anicchāsaññā. ‘‘Katamā cānanda, ānāpānassati? Idhānanda, bhikkhu araññagato vā rukkhamūlagato vā suññāgāragato vā nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā. So satova assasati satova passasati. Dīghaṃ vā assasanto ‘dīghaṃ assasāmī’ti pajānāti. Dīghaṃ vā passasanto ‘dīghaṃ passasāmī’ti pajānāti. Rassaṃ vā assasanto ‘rassaṃ assasāmī’ti pajānāti. Rassaṃ vā passasanto ‘rassaṃ passasāmī’ti pajānāti. ‘Sabbakāyapaṭisaṃvedī assasissāmī’ti sikkhati. ‘Sabbakāyapaṭisaṃvedī passasissāmī’ti sikkhati. ‘Passambhayaṃ kāyasaṅkhāraṃ assasissāmī’ti sikkhati. ‘Passambhayaṃ kāyasaṅkhāraṃ passasissāmī’ti sikkhati. ‘Pītipaṭisaṃvedī assasissāmī’ti sikkhati. ‘Pītipaṭisaṃvedī passasissāmī’ti sikkhati. ‘Sukhapaṭisaṃvedī assasissāmī’ti sikkhati. ‘Sukhapaṭisaṃvedī passasissāmī’ti sikkhati. ‘Cittasaṅkhārapaṭisaṃvedī assasissāmī’ti sikkhati. ‘Cittasaṅkhārapaṭisaṃvedī passasissāmī’ti sikkhati. ‘Passambhayaṃ cittasaṅkhāraṃ assasissāmī’ti sikkhati. ‘Passambhayaṃ cittasaṅkhāraṃ passasissāmī’ti sikkhati. ‘Cittapaṭisaṃvedī assasissāmī’ti sikkhati. ‘Cittapaṭisaṃvedī passasissāmī’ti sikkhati. Abhippamodayaṃ cittaṃ…pe… samādahaṃ cittaṃ…pe… vimocayaṃ cittaṃ…pe… aniccānupassī…pe… virāgānupassī…pe… nirodhānupassī… pe… ‘paṭinissaggānupassī assasissāmī’ti sikkhati. ‘Paṭinissaggānupassī passasissāmī’ti sikkhati. Ayaṃ vuccatānanda, ānāpānassati. ‘‘Sace kho tvaṃ, ānanda, girimānandassa bhikkhuno imā dasa saññā bhāseyyāsi, ṭhānaṃ kho panetaṃ vijjati yaṃ girimānandassa bhikkhuno imā dasa saññā sutvā so ābādho ṭhānaso paṭippassambheyyā’’ti. Atha kho āyasmā ānando bhagavato santike imā dasa saññā uggahetvā yenāyasmā girimānando tenupasaṅkami; upasaṅkamitvā āyasmato girimānandassa imā dasa saññā abhāsi. Atha kho āyasmato girimānandassa dasa saññā sutvā so ābādho ṭhānaso paṭippassambhi. Vuṭṭhahi cāyasmā girimānando tamhā ābādhā. Tathā pahīno ca panāyasmato girimānandassa so ābādho ahosī’’ti. Dasamaṃ. ",
      "english": "At one time the Blessed One was dwelling in Sāvatthī, at Jetavana, in Anāthapiṇḍika’s park. Now at that time, Venerable Girimānanda was afflicted, suffering, gravely ill. Then Venerable Ānanda approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, Venerable Ānanda said to the Blessed One: \"Venerable Sir, Venerable Girimānanda is afflicted, suffering, gravely ill. It would be good, Venerable Sir, if the Blessed One would approach Venerable Girimānanda out of compassion.\"\n\n\"Ānanda, if you were to recite these ten perceptions to the monk Girimānanda, it is possible that, upon hearing these ten perceptions, his ailment might completely subside. What are these ten? The perception of impermanence, the perception of non-self, the perception of impurity, the perception of danger, the perception of abandonment, the perception of dispassion, the perception of cessation, the perception of non-delight in the entire world, the perception of disenchantment with all formations, and mindfulness of breathing.\"\n\n\"And what, Ānanda, is the perception of impermanence? Here, Ānanda, a monk, having gone to the wilderness, or to the root of a tree, or to an empty hut, thus reflects: 'Form is impermanent; feeling is impermanent; perception is impermanent; mental formations are impermanent; consciousness is impermanent.' Thus he dwells contemplating impermanence in these five aggregates of clinging. This, Ānanda, is called the perception of impermanence.\"\n\n\"And what, Ānanda, is the perception of non-self? Here, Ānanda, a monk, having gone to the wilderness, or to the root of a tree, or to an empty hut, thus reflects: 'The eye is non-self; forms are non-self; the ear is non-self; sounds are non-self; the nose is non-self; odors are non-self; the tongue is non-self; flavors are non-self; the body is non-self; tactile objects are non-self; the mind is non-self; mental phenomena are non-self.' Thus he dwells contemplating non-self in these six internal and external sense bases. This, Ānanda, is called the perception of non-self.\"\n\n\"And what, Ānanda, is the perception of impurity? Here, Ānanda, a monk reflects on this very body, from the soles of the feet upwards, from the tips of the hair downwards, enclosed by skin, full of various kinds of impurity: 'In this body there are hair, body-hair, nails, teeth, skin, flesh, sinews, bones, bone-marrow, kidneys, heart, liver, diaphragm, spleen, lungs, intestines, intestinal mesentery, stomach, feces, bile, phlegm, pus, blood, sweat, fat, tears, grease, saliva, mucus, joint-fluid, urine.' Thus he dwells contemplating impurity in this body. This, Ānanda, is called the perception of impurity.\"\n\n\"And what, Ānanda, is the perception of danger? Here, Ānanda, a monk, having gone to the wilderness, or to the root of a tree, or to an empty hut, thus reflects: 'This body is truly full of suffering and fraught with danger!' In this body, various diseases arise, such as: eye-disease, ear-disease, nose-disease, tongue-disease, body-disease, head-disease, ear-ache, mouth-disease, tooth-ache, lip-disease, cough, asthma, catarrh, burning, fever, stomach-ache, fainting, dysentery, gripes, cholera, leprosy, boils, eczema, consumption, epilepsy, ringworm, scabies, itch, impetigo, whitlows, blood-bile (hemorrhoids), diabetes, piles, carbuncles, fistulas; diseases arising from bile, diseases arising from phlegm, diseases arising from wind, diseases arising from a combination of humors, diseases arising from changes in weather, diseases arising from irregular self-care, diseases arising from external assault, diseases arising from kamma-result; cold, heat, hunger, thirst, defecation, urination. Thus he dwells contemplating danger in this body. This, Ānanda, is called the perception of danger.\"\n\n\"And what, Ānanda, is the perception of abandonment? Here, Ānanda, a monk does not tolerate an arisen thought of sensuality; he abandons it, dispels it, puts an end to it, makes it cease to exist. He does not tolerate an arisen thought of ill-will; he abandons it, dispels it, puts an end to it, makes it cease to exist. He does not tolerate an arisen thought of harm; he abandons it, dispels it, puts an end to it, makes it cease to exist. He does not tolerate any unwholesome states that have arisen; he abandons them, dispels them, puts an end to them, makes them cease to exist. This, Ānanda, is called the perception of abandonment.\"\n\n\"And what, Ānanda, is the perception of dispassion? Here, Ānanda, a monk, having gone to the wilderness, or to the root of a tree, or to an empty hut, thus reflects: 'This is peaceful, this is sublime, namely the calming of all formations, the relinquishment of all attachments, the destruction of craving, dispassion, Nibbāna.' This, Ānanda, is called the perception of dispassion.\"\n\n\"And what, Ānanda, is the perception of cessation? Here, Ānanda, a monk, having gone to the wilderness, or to the root of a tree, or to an empty hut, thus reflects: 'This is peaceful, this is sublime, namely the calming of all formations, the relinquishment of all attachments, the destruction of craving, cessation, Nibbāna.' This, Ānanda, is called the perception of cessation.\"\n\n\"And what, Ānanda, is the perception of non-delight in the entire world? Here, Ānanda, a monk dwells abandoning and not clinging to the clingings, mental determinations, adherence, and latent tendencies that are found in the world.\"\n\nThis, Ananda, is called the perception of non-delight in the entire world. And what, Ananda, is the perception of dispassion towards all fabrications? Here, Ananda, a monk becomes weary of, ashamed of, and disgusted with all fabrications. This, Ananda, is called the perception of dispassion towards all fabrications. And what, Ananda, is mindfulness of breathing? Here, Ananda, a monk, having gone to a forest, or to the root of a tree, or to an empty dwelling, sits down, having folded his legs crosswise, set his body erect, and established mindfulness at the forefront of his perception. Mindful, he breathes in; mindful, he breathes out. Breathing in long, he discerns, 'I am breathing in long.' Breathing out long, he discerns, 'I am breathing out long.' Breathing in short, he discerns, 'I am breathing in short.' Breathing out short, he discerns, 'I am breathing out short.' He trains himself, 'I will breathe in experiencing the whole body.' He trains himself, 'I will breathe out experiencing the whole body.' He trains himself, 'I will breathe in tranquilizing the bodily formation.' He trains himself, 'I will breathe out tranquilizing the bodily formation.' He trains himself, 'I will breathe in experiencing rapture.' He trains himself, 'I will breathe out experiencing rapture.' He trains himself, 'I will breathe in experiencing pleasure.' He trains himself, 'I will breathe out experiencing pleasure.' He trains himself, 'I will breathe in experiencing the mental formation.' He trains himself, 'I will breathe out experiencing the mental formation.' He trains himself, 'I will breathe in tranquilizing the mental formation.' He trains himself, 'I will breathe out tranquilizing the mental formation.' He trains himself, 'I will breathe in experiencing the mind.' He trains himself, 'I will breathe out experiencing the mind.' He trains himself, 'I will breathe in gladdening the mind.' He trains himself, 'I will breathe out gladdening the mind.' He trains himself, 'I will breathe in concentrating the mind.' He trains himself, 'I will breathe out concentrating the mind.' He trains himself, 'I will breathe in liberating the mind.' He trains himself, 'I will breathe out liberating the mind.' He trains himself, 'I will breathe in contemplating impermanence.' He trains himself, 'I will breathe out contemplating impermanence.' He trains himself, 'I will breathe in contemplating dispassion.' He trains himself, 'I will breathe out contemplating dispassion.' He trains himself, 'I will breathe in contemplating cessation.' He trains himself, 'I will breathe out contemplating cessation.' He trains himself, 'I will breathe in contemplating relinquishment.' He trains himself, 'I will breathe out contemplating relinquishment.' This, Ananda, is called mindfulness of breathing.\n\n“If, Ananda, you were to recite these ten perceptions to the monk Girimananda, it is possible that, upon hearing these ten perceptions, his illness would immediately subside.” Then, Venerable Ananda, having learned these ten perceptions from the Blessed One, went to where Venerable Girimananda was; having approached, he recited these ten perceptions to Venerable Girimananda. Then, upon Venerable Girimananda hearing these ten perceptions, his illness immediately subsided. And Venerable Girimananda arose from that illness. And thus, that illness of Venerable Girimananda was abandoned.",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනාථපිණ්ඩික සිටුහු විසින් කරවන ලද ජේතවනාරාමයෙහි වැඩවසන සේක. එසමයෙහි ආයුෂ්මත් ගිරිමානන්ද ස්ථවිරයන් වහන්සේ රෝගාබාධිතව, දුක් විඳිමින්, දැඩි ලෙස ගිලන්ව සිටියහ. ඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනට එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව වාඩිවූහ. එකත්පස්ව වාඩිවූ ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ සැලකළහ: ‘‘ස්වාමීනි, ආයුෂ්මත් ගිරිමානන්ද ස්ථවිරයන් වහන්සේ රෝගාබාධිතව, දුක් විඳිමින්, දැඩි ලෙස ගිලන්ව සිටිති. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ කරුණාවෙන් ආයුෂ්මත් ගිරිමානන්ද ස්ථවිරයන් වහන්සේ වෙත වැඩම කළා නම් ඉතා හොඳය.’’\n\n‘‘ආනන්දය, යම් හෙයකින් නුඹ ගිරිමානන්ද භික්ෂුවට මේ දස සංඥාවන් විස්තර කරන්නේ නම්, ගිරිමානන්ද භික්ෂුව එම දස සංඥාවන් අසා, ඒ ආබාධය එසැණින්ම සංසිඳීමට ඉඩ ඇත.\n\n‘‘ඒ දසය කවරේද? අනිච්ච සංඥාව, අනත්ත සංඥාව, අසුභ සංඥාව, ආදීනව සංඥාව, ප්‍රහාණ සංඥාව, විරාග සංඥාව, නිරෝධ සංඥාව, සකල ලෝකයෙහි නොඇලීමේ සංඥාව, සියලු සංස්කාරයන්හි අනිච්ඡා සංඥාව, ආනාපානසති භාවනාව යන මේවාය.\n\n‘‘ආනන්දය, අනිච්ච සංඥාව කවරේද? ආනන්දය, මෙහිලා භික්ෂුවක් අරණ්‍යයකට හෝ වෘක්ෂ මූලයකට හෝ ශූන්‍යාගාරයකට හෝ ගොස් මෙසේ මෙනෙහි කරයි: ‘රූපය අනිත්‍යය, වේදනාව අනිත්‍යය, සංඥාව අනිත්‍යය, සංස්කාර අනිත්‍යය, විඤ්ඤාණය අනිත්‍යය.’ මෙසේ මේ පංච උපාදානස්කන්ධයන්හි අනිත්‍ය වශයෙන් අනුපස්සනා කරමින් වාසය කරයි. ආනන්දය, මෙය අනිච්ච සංඥාව යයි කියනු ලැබේ.\n\n‘‘ආනන්දය, අනත්ත සංඥාව කවරේද? ආනන්දය, මෙහිලා භික්ෂුවක් අරණ්‍යයකට හෝ වෘක්ෂ මූලයකට හෝ ශූන්‍යාගාරයකට හෝ ගොස් මෙසේ මෙනෙහි කරයි: ‘ඇස අනාත්මය, රූප අනාත්මය, කන අනාත්මය, ශබ්ද අනාත්මය, නාසය අනාත්මය, ගන්ධය අනාත්මය, දිව අනාත්මය, රස අනාත්මය, කය අනාත්මය, ස්පර්ශ අනාත්මය, මනස අනාත්මය, ධර්ම අනාත්මය.’ මෙසේ මේ ෂඩ් ආධ්‍යාත්මික බාහිර ආයතනයන්හි අනාත්ම වශයෙන් අනුපස්සනා කරමින් වාසය කරයි. ආනන්දය, මෙය අනත්ත සංඥාව යයි කියනු ලැබේ.\n\n‘‘ආනන්දය, අසුභ සංඥාව කවරේද? ආනන්දය, මෙහිලා භික්ෂුවක් මේ ශරීරය පාද සඟලින් උඩටත්, කෙස් අගින් පහළටත්, සම්පටින් අවසන්වූ, නොයෙක් ආකාර අපිරිසිදු දේවලින් පිරුණක් වශයෙන් මෙනෙහි කරයි: ‘මේ කයෙහි කෙස් ඇත, ලොම් ඇත, නිය ඇත, දත් ඇත, සම ඇත, මස් ඇත, නහර ඇත, ඇට ඇත, ඇට මිදුළු ඇත, වකුගඩු ඇත, හෘදය ඇත, අක්මාව ඇත, දළදා ඇත, පෙනහළු ඇත, බඩවැල් ඇත, බඩවැල් අතරෙහි ඇති දෙය ඇත, කුස ඇත, මළමුත්‍ර ඇත, පිත ඇත, සෙම ඇත, සැරව ඇත, ලේ ඇත, දහඩිය ඇත, මේදය ඇත, කඳුළු ඇත, තෙල් ඇත, කෙළ ඇත, සොටු ඇත, ශ්ලේශ්ම ඇත, මුත්‍රා ඇත’ යි. මෙසේ මේ කයෙහි අසුභ වශයෙන් අනුපස්සනා කරමින් වාසය කරයි. ආනන්දය, මෙය අසුභ සංඥාව යයි කියනු ලැබේ.\n\n‘‘ආනන්දය, ආදීනව සංඥාව කවරේද? ආනන්දය, මෙහිලා භික්ෂුවක් අරණ්‍යයකට හෝ වෘක්ෂ මූලයකට හෝ ශූන්‍යාගාරයකට හෝ ගොස් මෙසේ මෙනෙහි කරයි: ‘මේ කය මහත් දුක් ඇති, මහත් ආදීනව ඇති දෙයකි. මේ කයෙහි නොයෙක් ආබාධ හටගනී. එනම්: ඇස් රෝග, කන් රෝග, නාසා රෝග, දිව රෝග, කය රෝග, හිස රෝග, කන් රෝග, මුඛ රෝග, දත් රෝග, තොල් රෝග, කැස්ස, ස්වාස රෝගය, පීනස, දැවිල්ල, ජරාව, කුසෙහි රෝග, මූර්ඡාව, ප්‍රකන්‍දිකාව, ශූලය, විෂූචිකාව, කුෂ්ඨ, ගණ්ඩය, කිලාසය, ක්ෂය රෝගය, අපස්මාරය, දද, කැසීම, කබර, නියපොතු රෝග, විතච්චිකාව, ලේ අගුණ වීම, මධුමේහය, අර්ශස්, කුරුලෑ, භගන්දරය, පිත් රෝග, සෙම් රෝග, වාත රෝග, සන්නිපාත රෝග, ඍතු පෙරළීමෙන් හටගන්නා රෝග, වැරදි පිළිවෙත් වලින් හටගන්නා රෝග, පිටතින් පැමිණෙන රෝග, කර්ම විපාකයෙන් හටගන්නා රෝග, සීතල, උෂ්ණය, බඩගින්න, පිපාසය, මළමුත්‍ර පහකිරීම’ යන මේවාය. මෙසේ මේ කයෙහි ආදීනව වශයෙන් අනුපස්සනා කරමින් වාසය කරයි. ආනන්දය, මෙය ආදීනව සංඥාව යයි කියනු ලැබේ.\n\n‘‘ආනන්දය, ප්‍රහාණ සංඥාව කවරේද? ආනන්දය, මෙහිලා භික්ෂුවක් උපන් කාම විතර්කයක් අත් නොහරියි, එය ප්‍රහණය කරයි, දුරලයි, නැති කරයි, අභාවයට පත්කරයි. උපන් ව්‍යාපාද විතර්කයක් අත් නොහරියි, එය ප්‍රහණය කරයි, දුරලයි, නැති කරයි, අභාවයට පත්කරයි. උපන් විහිංසා විතර්කයක් අත් නොහරියි, එය ප්‍රහණය කරයි, දුරලයි, නැති කරයි, අභාවයට පත්කරයි. උපනූපන් පව්කම් සහිත අකුසල ධර්මයන් අත් නොහරියි, ඒවා ප්‍රහණය කරයි, දුරලයි, නැති කරයි, අභාවයට පත්කරයි. ආනන්දය, මෙය ප්‍රහාණ සංඥාව යයි කියනු ලැබේ.\n\n‘‘ආනන්දය, විරාග සංඥාව කවරේද? ආනන්දය, මෙහිලා භික්ෂුවක් අරණ්‍යයකට හෝ වෘක්ෂ මූලයකට හෝ ශූන්‍යාගාරයකට හෝ ගොස් මෙසේ මෙනෙහි කරයි: ‘සියලු සංස්කාරයන් සංසිඳවීම, සියලු උපාධීන් අත්හැරීම, තණ්හා ක්ෂය කිරීම, විරාගය, නිර්වාණය යනු ශාන්ත වූත්, ප්‍රණීත වූත් දෙයකි.’ ආනන්දය, මෙය විරාග සංඥාව යයි කියනු ලැබේ.\n\n‘‘ආනන්දය, නිරෝධ සංඥාව කවරේද? ආනන්දය, මෙහිලා භික්ෂුවක් අරණ්‍යයකට හෝ වෘක්ෂ මූලයකට හෝ ශූන්‍යාගාරයකට හෝ ගොස් මෙසේ මෙනෙහි කරයි: ‘සියලු සංස්කාරයන් සංසිඳවීම, සියලු උපාධීන් අත්හැරීම, තණ්හා ක්ෂය කිරීම, නිරෝධය, නිර්වාණය යනු ශාන්ත වූත්, ප්‍රණීත වූත් දෙයකි.’ ආනන්දය, මෙය නිරෝධ සංඥාව යයි කියනු ලැබේ.\n\n‘‘ආනන්දය, සකල ලෝකයෙහි නොඇලීමේ සංඥාව කවරේද? ආනන්දය, මෙහිලා භික්ෂුවක් ලෝකයෙහි යම් ඇලීම්, සිතේ අධිෂ්ඨාන, අභිනිවේශයන් හා අනුසයයන් වේද, ඒවා ප්‍රහණය කරමින්, නොඇලෙමින් වාසය කරයි.\n\nආනන්දයෙනි, මෙය සියලු ලෝකයෙහි ඇල්මක් නැති බවට වූ සංඥාව යැයි කියනු ලැබේ. ආනන්දයෙනි, සියලු සංස්කාරයන්හි නොඇලීමේ සංඥාව කවරක් ද? ආනන්දයෙනි, මෙහිලා භික්ෂුව සියලු සංස්කාරයන් කෙරෙහි වෙහෙසට පත්වෙයි, පිළිකුල් කරයි, අපුලට පත්වෙයි. ආනන්දයෙනි, මෙය සියලු සංස්කාරයන්හි නොඇලීමේ සංඥාව යැයි කියනු ලැබේ. ආනන්දයෙනි, ආනාපානසතිය කවරක් ද? ආනන්දයෙනි, මෙහිලා භික්ෂුව අරණ්‍යයකට ගොස් හෝ, රුක් මුලකට ගොස් හෝ, ශූන්‍යාගාරයකට ගොස් හෝ, පලක් බැඳගෙන, සෘජු ව කය පිහිටුවාගෙන, ඉදිරියට සිහිය පිහිටුවාගෙන හිඳගනී. ඔහු සිහියෙන් ම ආශ්වාස කරයි; සිහියෙන් ම ප්‍රශ්වාස කරයි. දීර්ඝ ව ආශ්වාස කරන විට ‘දීර්ඝ ව ආශ්වාස කරමි’ යි දනී. දීර්ඝ ව ප්‍රශ්වාස කරන විට ‘දීර්ඝ ව ප්‍රශ්වාස කරමි’ යි දනී. කෙටි ව ආශ්වාස කරන විට ‘කෙටි ව ආශ්වාස කරමි’ යි දනී. කෙටි ව ප්‍රශ්වාස කරන විට ‘කෙටි ව ප්‍රශ්වාස කරමි’ යි දනී. ‘සියලු කයම (ආශ්වාස ප්‍රශ්වාස ක්‍රියාවලියම) හොඳින් දැනගනිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සියලු කයම (ආශ්වාස ප්‍රශ්වාස ක්‍රියාවලියම) හොඳින් දැනගනිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘කාය සංස්කාරය (ආශ්වාස ප්‍රශ්වාසය) සන්සිඳුවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘කාය සංස්කාරය (ආශ්වාස ප්‍රශ්වාසය) සන්සිඳුවමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘ප්‍රීතිය අත්විඳිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘ප්‍රීතිය අත්විඳිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සැපය අත්විඳිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සැපය අත්විඳිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘චිත්ත සංස්කාරය (සංඥා හා වේදනා) හොඳින් දැනගනිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘චිත්ත සංස්කාරය (සංඥා හා වේදනා) හොඳින් දැනගනිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘චිත්ත සංස්කාරය සන්සිඳුවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘චිත්ත සංස්කාරය සන්සිඳුවමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත හොඳින් දැනගනිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත හොඳින් දැනගනිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත ප්‍රීතියෙන් පුරවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත ප්‍රීතියෙන් පුරවමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත සමාධිමත් කරමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත සමාධිමත් කරමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත (අකුසලයෙන්) මුදවමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘සිත (අකුසලයෙන්) මුදවමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘අනිත්‍ය දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘අනිත්‍ය දකිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘විරාගය දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘විරාගය දකිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘නිරෝධය දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘නිරෝධය දකිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘ප්‍රතිනිස්සර්ගය දකිමින් ආශ්වාස කරන්නෙමි’ යි හික්මෙයි. ‘ප්‍රතිනිස්සර්ගය දකිමින් ප්‍රශ්වාස කරන්නෙමි’ යි හික්මෙයි. ආනන්දයෙනි, මෙය ආනාපානසතිය යැයි කියනු ලැබේ.\n\n“ආනන්දය, යම් හෙයකින් නුඹ ගිරිමානන්ද ස්ථවිරයන් වහන්සේට මේ දස සංඥාවන් දේශනා කරන්නෙහි නම්, ඒකාන්තයෙන් මෙය සිදුවිය හැකි කරුණකි, ගිරිමානන්ද ස්ථවිරයන් වහන්සේට මේ දස සංඥාවන් අසා ඒ ආබාධය එතැනින්ම සන්සිඳී යන්නේ ය.” ඉක්බිති ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙතින් මේ දස සංඥාවන් ඉගෙනගෙන, යම් තැනක ආයුෂ්මත් ගිරිමානන්ද ස්ථවිරයන් වහන්සේ වැඩ සිටියා ද, ඒ තැනට වැඩම කළ සේක; වැඩම කොට ආයුෂ්මත් ගිරිමානන්ද ස්ථවිරයන් වහන්සේට මේ දස සංඥාවන් දේශනා කළ සේක. ඉක්බිති ආයුෂ්මත් ගිරිමානන්ද ස්ථවිරයන් වහන්සේගේ දස සංඥාවන් අසා, ඒ ආබාධය එතැනින්ම සන්සිඳී ගියේ ය. ආයුෂ්මත් ගිරිමානන්ද ස්ථවිරයන් වහන්සේ ඒ ආබාධයෙන් සුවපත් වූ සේක. එසේම ආයුෂ්මත් ගිරිමානන්ද ස්ථවිරයන් වහන්සේගේ ඒ ආබාධය එතැනින්ම පහව ගියේ ය.",
      "paliTitle": "Girimānandasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Sacittavaggo paṭhamo. Tassuddānaṃ – Sacittañca sāriputta, ṭhiti ca samathena ca; Parihāno ca dve saññā, mūlā pabbajitaṃ girīti.",
    "english": "",
    "sinhala": ""
  }
}