{
  "id": "sn.3.12",
  "title": {
    "pali": "Vacchagottasaṃyuttaṃ",
    "english": "The Connected Discourses with Vacchagotta",
    "sinhala": "වච්ඡගොත්තසංයුත්තය"
  },
  "sections": [
    {
      "number": 607,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho vacchagotto paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yānimāni [yenimāni (?)] anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā, antavā lokoti vā, anantavā lokoti vā, taṃ jīvaṃ taṃ sarīranti vā, aññaṃ jīvaṃ aññaṃ sarīranti vā, hoti tathāgato paraṃ maraṇāti vā, na hoti tathāgato paraṃ maraṇāti vā, hoti ca na ca hoti tathāgato paraṃ maraṇāti vā, neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti? ‘‘Rūpe kho, vaccha, aññāṇā, rūpasamudaye aññāṇā, rūpanirodhe aññāṇā, rūpanirodhagāminiyā paṭipadāya aññāṇā; evamimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vāti. Ayaṃ kho, vaccha, hetu, ayaṃ paccayo, yānimāni [yena (sī.), yenimāni (?)] anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti. Paṭhamaṃ.",
      "english": "At one time, the Blessed One was dwelling in Savatthi, in Jeta's Grove, Anathapindika's monastery.\n\nThen the wanderer Vacchagotta approached the Blessed One, and having approached, exchanged greetings with the Blessed One. Having concluded a courteous and memorable conversation, he sat down to one side.\n\nAs he sat to one side, the wanderer Vacchagotta said this to the Blessed One: \"What now, Venerable Gotama, is the cause, what is the condition for these various speculative views to arise in the world? Such as: 'The world is eternal,' or 'The world is not eternal,' or 'The world is finite,' or 'The world is infinite,' or 'The soul is the same as the body,' or 'The soul is one thing, the body another,' or 'The Tathagata exists after death,' or 'The Tathagata does not exist after death,' or 'The Tathagata both exists and does not exist after death,' or 'The Tathagata neither exists nor does not exist after death?'\"\n\n\"It is, Vacchagotta, through ignorance regarding form, through ignorance regarding the origin of form, through ignorance regarding the cessation of form, through ignorance regarding the path leading to the cessation of form. In this way, these various speculative views arise in the world: 'The world is eternal,' or 'The world is not eternal,' or 'The world is finite,' or 'The world is infinite,' or 'The soul is the same as the body,' or 'The soul is one thing, the body another,' or 'The Tathagata exists after death,' or 'The Tathagata does not exist after death,' or 'The Tathagata both exists and does not exist after death,' or 'The Tathagata neither exists nor does not exist after death.' This, Vacchagotta, is the cause, this is the condition for these various speculative views to arise in the world: 'The world is eternal,' or 'The world is not eternal,' or 'The world is finite,' or 'The world is infinite,' or 'The soul is the same as the body,' or 'The soul is one thing, the body another,' or 'The Tathagata exists after death,' or 'The Tathagata does not exist after death,' or 'The Tathagata both exists and does not exist after death,' or 'The Tathagata neither exists nor does not exist after death.'\"",
      "sinhala": "එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනේපිඬු සිටුහුගේ ජේතවනාරාමයෙහි වැඩවසන සේක. ඉක්බිති වච්ඡගොත්ත පිරිවැජියා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ හා සමඟ සතුටු විය. හිතකර වූ, සිහිකරවිය යුතු කතා බහ නිමවා එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි වච්ඡගොත්ත පිරිවැජියා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය – “ගෞතමයන් වහන්ස, මේ ලෝකයෙහි යම් මේ නානාවිධ දෘෂ්ටි උපදින්නේද – ලෝකය සදාකාලිකය යි, නැතහොත් ලෝකය සදාකාලික නොවේ යි, නැතහොත් ලෝකයට සීමාවක් ඇත යි, නැතහොත් ලෝකයට සීමාවක් නැත යි, නැතහොත් ජීවයත් ශරීරයත් එක යි, නැතහොත් ජීවය වෙන ය, ශරීරය වෙන ය යි, නැතහොත් මරණින් පසු තථාගතයන් වහන්සේ සිටින සේක යි, නැතහොත් මරණින් පසු තථාගතයන් වහන්සේ නොසිටින සේක යි, නැතහොත් මරණින් පසු තථාගතයන් වහන්සේ සිටින සේක ද නැති සේක ද යි, නැතහොත් මරණින් පසු තථාගතයන් වහන්සේ සිටින සේකැයි කිව නොහැකි ය, නොසිටින සේකැයි කිව නොහැකි ය යි – මේවාට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?”\n\n“වච්ඡය, රූපයෙහි අවිද්‍යාව නිසා ය, රූපයේ හටගැනීමෙහි අවිද්‍යාව නිසා ය, රූපයේ නිරෝධයෙහි අවිද්‍යාව නිසා ය, රූප නිරෝධයට පමුණුවන ප්‍රතිපදාවෙහි අවිද්‍යාව නිසා ය. මෙසේ මේ නානාවිධ දෘෂ්ටි ලෝකයෙහි උපදින්නේ – ලෝකය සදාකාලිකය යි... (යනාදී වශයෙන්) ...මරණින් පසු තථාගතයන් වහන්සේ සිටින සේකැයි කිව නොහැකි ය, නොසිටින සේකැයි කිව නොහැකි ය යි යන දෘෂ්ටි වේ.”\n\n“වච්ඡය, මේ ලෝකයෙහි යම් මේ නානාවිධ දෘෂ්ටි උපදින්නේද, එයට හේතුව මෙය යි, ප්‍රත්‍යය මෙය යි – ලෝකය සදාකාලිකය යි, ලෝකය සදාකාලික නොවේ යි... (යනාදී වශයෙන්) ...මරණින් පසු තථාගතයන් වහන්සේ සිටින සේකැයි කිව නොහැකි ය, නොසිටින සේකැයි කිව නොහැකි ය යි යන දෘෂ්ටි වේ.”",
      "paliTitle": "Rūpaaññāṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Ignorance of Form",
      "sinhalaTitle": "රූප අඤ්ඤාණ සූත්‍රය"
    },
    {
      "number": 608,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti? ‘‘Vedanāya kho, vaccha, aññāṇā, vedanāsamudaye aññāṇā, vedanānirodhe aññāṇā, vedanānirodhagāminiyā paṭipadāya aññāṇā; evamimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vāti. Ayaṃ kho, vaccha, hetu, ayaṃ paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā… pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti. Dutiyaṃ.",
      "english": "In Sāvatthi, the wanderer Vaccha, sitting to one side, said to the Blessed One: \"What, venerable Gotama, is the cause, what is the condition, for the arising in the world of these various speculative views—such as 'the world is eternal,' or 'the world is not eternal,' ...or 'the Tathāgata neither exists nor does not exist after death'?\" \"It is, Vaccha, from not knowing feeling, from not knowing the origin of feeling, from not knowing the cessation of feeling, and from not knowing the path leading to the cessation of feeling; that these various speculative views arise in the world—such as 'the world is eternal,' or 'the world is not eternal,' ...or 'the Tathāgata neither exists nor does not exist after death'. This, Vaccha, is the cause, this is the condition, for the arising in the world of these various speculative views—such as 'the world is eternal,' or 'the world is not eternal,' ...or 'the Tathāgata neither exists nor does not exist after death'.\"",
      "sinhala": "සැවැත්නුවරදී.\n\nවච්ඡගොත්ත පිරිවැජියා එක් පසෙක වාඩි වී භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘භවත් ගෞතමයින් වහන්සේ, ලෝකයෙහි පැනනගින මේ නොයෙක් ආකාර වූ දෘෂ්ටිගතයන්ට, එනම් ලෝකය ශාශ්වතය යනුවෙන් ද, ලෝකය අශාශ්වතය යනුවෙන් ද... (යනාදී වශයෙන්) මරණින් පසු තථාගතයන් වහන්සේ පවතින්නේ ද නැත, නොපවතින්නේ ද නැත යනුවෙන් ද ඇතිවන දෘෂ්ටීන්ට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’’ ‘‘වච්ඡය, වේදනාව පිළිබඳව ඇති අඥානකම, වේදනාවේ හටගැනීම පිළිබඳව ඇති අඥානකම, වේදනාවේ නිරෝධය පිළිබඳව ඇති අඥානකම, වේදනාවේ නිරෝධය පිණිස පමුණුවන ප්‍රතිපදාව පිළිබඳව ඇති අඥානකම (නිසා) වේ. මේ නොයෙක් ආකාර වූ දෘෂ්ටිගතයන් ලෝකයෙහි පැනනගින්නේ ලෝකය ශාශ්වතය යනුවෙන් ද, ලෝකය අශාශ්වතය යනුවෙන් ද... (යනාදී වශයෙන්) මරණින් පසු තථාගතයන් වහන්සේ පවතින්නේ ද නැත, නොපවතින්නේ ද නැත යනුවෙන් ද යි. වච්ඡය, ලෝකයෙහි පැනනගින මේ නොයෙක් ආකාර වූ දෘෂ්ටිගතයන්ට, එනම් ලෝකය ශාශ්වතය යනුවෙන් ද, ලෝකය අශාශ්වතය යනුවෙන් ද... (යනාදී වශයෙන්) මරණින් පසු තථාගතයන් වහන්සේ පවතින්නේ ද නැත, නොපවතින්නේ ද නැත යනුවෙන් ද (ඇතිවන දෘෂ්ටීන්ට) මෙයම හේතුව වේ, මෙයම ප්‍රත්‍යය වේ.’’\n\nදෙවැනි.",
      "paliTitle": "Vedanāaññāṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Ignorance of Feeling",
      "sinhalaTitle": "වේදනා අඥාන සූත්‍රය"
    },
    {
      "number": 609,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti? ‘‘Saññāya kho, vaccha, aññāṇā, saññāsamudaye aññāṇā, saññānirodhe aññāṇā, saññānirodhagāminiyā paṭipadāya aññāṇā; evamimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā… pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vāti. Ayaṃ kho, vaccha, hetu, ayaṃ paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti. Tatiyaṃ.",
      "english": "At Sāvatthī. Then, Vacchagotta the wanderer, sitting to one side, said to the Blessed One: \"What, good Gotama, is the reason, what is the condition, for these various speculative views that arise in the world—such as 'the world is eternal,' or 'the world is not eternal,'... or 'the Tathāgata neither exists nor does not exist after death'?\"\n\n\"It is, Vaccha, from not truly knowing perception, from not truly knowing the origin of perception, from not truly knowing the cessation of perception, and from not truly knowing the path leading to the cessation of perception, that these various speculative views arise in the world—such as 'the world is eternal,' or 'the world is not eternal,'... or 'the Tathāgata neither exists nor does not exist after death.' This, Vaccha, is the reason, this is the condition, for these various speculative views that arise in the world—such as 'the world is eternal,' or 'the world is not eternal,'... or 'the Tathāgata neither exists nor does not exist after death.'\"",
      "sinhala": "සැවැත් නුවරදීය. එක් පසෙක වාඩි වී සිටි වච්ඡගොත්ත පිරිවැජියා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"භවත් ගෞතමයන් වහන්ස, 'ලෝකය ශාශ්වතය'යි, 'ලෝකය අශාශ්වතය'යි ... 'මරණින් මතු තථාගතයන් වහන්සේ නොවෙත් ද, නොවෙත් නොවේ ද' යනාදී වශයෙන් මෙලොව ඇතිවන නොයෙක් ආකාර දෘෂ්ටිගතයන්ට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?\" \"වච්ඡය, සංඥාව පිළිබඳ අඥානය, සංඥාවේ හටගැනීම පිළිබඳ අඥානය, සංඥාවේ නැතිවීම පිළිබඳ අඥානය, සහ සංඥාව නැතිවීම කරා යන ප්‍රතිපදාව පිළිබඳ අඥානය හේතුවෙනි. මේ අයුරින් 'ලෝකය ශාශ්වතය'යි, 'ලෝකය අශාශ්වතය'යි ... 'මරණින් මතු තථාගතයන් වහන්සේ නොවෙත් ද, නොවෙත් නොවේ ද' යනාදී වශයෙන් මෙලොව නොයෙක් ආකාර දෘෂ්ටිගතයන් හටගනී. වච්ඡය, 'ලෝකය ශාශ්වතය'යි, 'ලෝකය අශාශ්වතය'යි ... 'මරණින් මතු තථාගතයන් වහන්සේ නොවෙත් ද, නොවෙත් නොවේ ද' යනාදී වශයෙන් මෙලොව ඇතිවන නොයෙක් ආකාර දෘෂ්ටිගතයන්ට හේතුව මෙයයි, ප්‍රත්‍යය මෙයයි.\"\n\nතෙවැනි සූත්‍රයයි.",
      "paliTitle": "Saññāaññāṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Perception and Ignorance",
      "sinhalaTitle": "සඤ්ඤා අඤ්ඤාණ සූත්‍රය"
    },
    {
      "number": 610,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti? ‘‘Saṅkhāresu kho, vaccha, aññāṇā, saṅkhārasamudaye aññāṇā, saṅkhāranirodhe aññāṇā, saṅkhāranirodhagāminiyā paṭipadāya aññāṇā; evamimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vāti. Ayaṃ kho, vaccha, hetu, ayaṃ paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā… pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti. Catutthaṃ.",
      "english": "Vacchagotta the wanderer, seated to one side, said to the Blessed One: \"What, Venerable Gotama, is the reason, what is the cause, for the arising in the world of these various speculative views—such as 'The world is eternal,' or 'The world is not eternal,'... and so on... 'The Tathāgata neither exists nor does not exist after death'?\"\n\n\"It is, Vaccha, from ignorance regarding conditioned phenomena, from ignorance regarding the origination of conditioned phenomena, from ignorance regarding the cessation of conditioned phenomena, and from ignorance regarding the path leading to the cessation of conditioned phenomena. It is because of this that these various speculative views arise in the world—'The world is eternal,' or 'The world is not eternal,'... and so on... 'The Tathāgata neither exists nor does not exist after death.' This, Vaccha, is the reason, this is the cause, for the arising in the world of these various speculative views—'The world is eternal,' or 'The world is not eternal,'... and so on... 'The Tathāgata neither exists nor does not exist after death'.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඑකත්පසෙක වැඩහුන් වච්ඡගොත්ත පිරිවැජියා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය – ‘‘භවත් ගෞතමයින් වහන්ස, 'ලෝකය ශාශ්වත ය' හෝ 'ලෝකය අශාශ්වත ය' යනාදී වශයෙන් ද, 'තථාගතයන් වහන්සේ මරණින් පසු පවතී' හෝ 'නොපවතී' හෝ 'පවතී ද නොපවතී ද' හෝ 'පවතී ද නොපවතී ද නොවේ ද' යනාදී වශයෙන් ද මේ නොයෙක් ආකාර දෘෂ්ටිගතයන් ලෝකයෙහි උපදින්නේ කුමක් හේතු කොටගෙන ද, කුමක් ප්‍රත්‍යය කොටගෙන ද?’’\n\n‘‘වච්ඡය, සංස්කාරයන් පිළිබඳව ඇති අවිද්‍යාව නිසා ය, සංස්කාරයන්ගේ හටගැනීම පිළිබඳව ඇති අවිද්‍යාව නිසා ය, සංස්කාරයන්ගේ නිරෝධය පිළිබඳව ඇති අවිද්‍යාව නිසා ය, සංස්කාරයන්ගේ නිරෝධයට පමුණුවන ප්‍රතිපදාව පිළිබඳව ඇති අවිද්‍යාව නිසා ය. මේ නොයෙක් ආකාර දෘෂ්ටිගතයන් ලෝකයෙහි උපදින්නේ – 'ලෝකය ශාශ්වත ය' හෝ 'ලෝකය අශාශ්වත ය' යනාදී වශයෙන් ද, 'තථාගතයන් වහන්සේ මරණින් පසු පවතී' හෝ 'නොපවතී' හෝ 'පවතී ද නොපවතී ද' හෝ 'පවතී ද නොපවතී ද නොවේ ද' යනාදී වශයෙන් ද ය. වච්ඡය, 'ලෝකය ශාශ්වත ය' හෝ 'ලෝකය අශාශ්වත ය' යනාදී වශයෙන් ද, 'තථාගතයන් වහන්සේ මරණින් පසු පවතී' හෝ 'නොපවතී' හෝ 'පවතී ද නොපවතී ද' හෝ 'පවතී ද නොපවතී ද නොවේ ද' යනාදී වශයෙන් ද මේ නොයෙක් ආකාර දෘෂ්ටිගතයන් ලෝකයෙහි උපදින්නේ මෙය හේතු කොටගෙන ය, මෙය ප්‍රත්‍යය කොටගෙන ය’’යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
      "paliTitle": "Saṅkhāraaññāṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Ignorance of Formations",
      "sinhalaTitle": "සංඛාර අවිද්‍යා සූත්‍Z‌WJරය"
    },
    {
      "number": 611,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā …pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti? ‘‘Viññāṇe kho, vaccha, aññāṇā, viññāṇasamudaye aññāṇā, viññāṇanirodhe aññāṇā, viññāṇanirodhagāminiyā paṭipadāya aññāṇā; evamimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā… pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vāti. Ayaṃ kho, vaccha, hetu, ayaṃ paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti. Pañcamaṃ.",
      "english": "At Sāvatthī. The wanderer Vacchagotta, seated to one side, said this to the Blessed One: ‘What, Venerable Gotama, is the cause, what is the reason, why these various speculative views arise in the world: “The world is eternal,” or “The world is not eternal,” or “The world is finite,” or “The world is infinite,” or “The soul and the body are the same,” or “The soul and the body are different,” or “The Tathāgata exists after death,” or “The Tathāgata does not exist after death,” or “The Tathāgata both exists and does not exist after death,” or “The Tathāgata neither exists nor does not exist after death”?’\n\n‘It is, Vacchagotta, due to ignorance concerning consciousness, due to ignorance concerning the origin of consciousness, due to ignorance concerning the cessation of consciousness, and due to ignorance concerning the path leading to the cessation of consciousness, that these various speculative views arise in the world: “The world is eternal,” or “The world is not eternal,” or “The world is finite,” or “The world is infinite,” or “The soul and the body are the same,” or “The soul and the body are different,” or “The Tathāgata exists after death,” or “The Tathāgata does not exist after death,” or “The Tathāgata both exists and does not exist after death,” or “The Tathāgata neither exists nor does not exist after death.” This, Vacchagotta, is the cause, this is the reason, why these various speculative views arise in the world: “The world is eternal,” or “The world is not eternal,” or “The world is finite,” or “The world is infinite,” or “The soul and the body are the same,” or “The soul and the body are different,” or “The Tathāgata exists after death,” or “The Tathāgata does not exist after death,” or “The Tathāgata both exists and does not exist after death,” or “The Tathāgata neither exists nor does not exist after death.”’",
      "sinhala": "සැවැත්නුවරදී සිදුවූවකි.\n\nඑකත්පසෙක වාඩි වී සිටි වැච්ඡගොත්ත පරිබ්‍රාජකයා වනාහි භාග්‍යවතුන් වහන්සේට මෙය කීවේය: ‘‘භවත් ගෞතමයෙනි, ‘ලෝකය සදාකාලිකය’ යි හෝ, ‘ලෝකය සදාකාලික නොවේ’ යි හෝ, ආදී වශයෙන්, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටින්නේද නැත, නොසිටින්නේද නැත’ යි හෝ යනාදී වශයෙන්, ලෝකයෙහි මේ නොයෙක් ආකාර දෘෂ්ටිගතයන් හටගන්නේ කුමක් හේතුකොටගෙනද? කුමන ප්‍රත්‍යය නිසාද?’’\n\n‘‘වැච්ඡය, විඤ්ඤාණය පිළිබඳව ඇති අවිද්‍යාව නිසාය. විඤ්ඤාණයේ හටගැනීම පිළිබඳව ඇති අවිද්‍යාව නිසාය. විඤ්ඤාණයේ නිරෝධය පිළිබඳව ඇති අවිද්‍යාව නිසාය. විඤ්ඤාණ නිරෝධය පිණිස පවතින ප්‍රතිපදාව පිළිබඳව ඇති අවිද්‍යාව නිසාය. මෙසේ ‘ලෝකය සදාකාලිකය’ යි හෝ, ‘ලෝකය සදාකාලික නොවේ’ යි හෝ, ආදී වශයෙන්, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටින්නේද නැත, නොසිටින්නේද නැත’ යි හෝ යන මේ නොයෙක් ආකාර දෘෂ්ටිගතයන් ලෝකයෙහි හටගන්නේය. වැච්ඡය, ‘ලෝකය සදාකාලිකය’ යි හෝ, ‘ලෝකය සදාකාලික නොවේ’ යි හෝ, ආදී වශයෙන්, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටින්නේද නැත, නොසිටින්නේද නැත’ යි හෝ යන මේ නොයෙක් ආකාර දෘෂ්ටිගතයන් ලෝකයෙහි හටගන්නේ මේ හේතුව නිසාය, මේ ප්‍රත්‍යය නිසාය.’’\n\nපස්වැනි සූත්‍රයයි.",
      "paliTitle": "Viññāṇaaññāṇasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Consciousness and Ignorance",
      "sinhalaTitle": "විඤ්ඤාණාඤ්ඤාණ සූත්‍රය"
    },
    {
      "number": 612,
      "numberRange": "612-616",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti? Rūpe kho, vaccha, adassanā…pe… rūpanirodhagāminiyā paṭipadāya adassanā…pe… vedanāya … saññāya … saṅkhāresu kho, vaccha, adassanā…pe… viññāṇe kho, vaccha, adassanā…pe… viññāṇanirodhagāminiyā paṭipadāya adassanā…pe…. Dasamaṃ.",
      "english": "At Sāvatthī. Sitting to one side, the wanderer Vacchagotta said to the Blessed One, “What, good Gotama, is the cause, what is the reason, for the arising in the world of these various kinds of speculative views—whether ‘the world is eternal’ or ‘the world is not eternal’; whether ‘the world is finite’ or ‘the world is infinite’; whether ‘the soul and the body are the same’ or ‘the soul and the body are different’; whether ‘the Tathāgata exists after death’ or ‘the Tathāgata does not exist after death’ or ‘the Tathāgata both exists and does not exist after death’ or ‘the Tathāgata neither exists nor does not exist after death’?” “It is, Vacchagotta, from not seeing form, from not seeing the origin of form, from not seeing the cessation of form, from not seeing the path leading to the cessation of form; from not seeing feeling, from not seeing the origin of feeling, from not seeing the cessation of feeling, from not seeing the path leading to the cessation of feeling; from not seeing perception, from not seeing the origin of perception, from not seeing the cessation of perception, from not seeing the path leading to the cessation of perception; from not seeing volitional formations, from not seeing the origin of volitional formations, from not seeing the cessation of volitional formations, from not seeing the path leading to the cessation of volitional formations; from not seeing consciousness, from not seeing the origin of consciousness, from not seeing the cessation of consciousness, and from not seeing the path leading to the cessation of consciousness.”",
      "sinhala": "සැවැත්නුවරදී සිදුවූවකි. එකත්පස්ව වාඩි වී සිටි වච්ඡගොත්ත පරිබ්‍රාජක තෙමේ භාග්‍ය​වතුන් වහන්සේට මෙය පැවසීය – ‘‘භවත් ගෞතමයෙනි, ලෝකයෙහි යම් මේ නානාප්‍ර​කාර දෘෂ්ටිගතයන් හටගන්නේද – ලෝකය ශාශ්වතය යනුවෙන් හෝ, ලෝකය අශාශ්වතය යනුවෙන් හෝ, යනාදී වූ බොහෝ දෘෂ්ටි, මරණින් පසු තථාගතයන් වහන්සේ නොවන්නේද නොවන්නෙක් නොවේ යනුවෙන් හෝ – ඊට හේතුව කුමක්ද, ප්‍ර​ත්‍යය කුමක්ද?’’\n\nවච්ඡය, රූපය නොදැකීමෙන්, රූපයෙහි හටගැනීම නොදැකීමෙන්, රූපයෙහි නැතිවීම නොදැකීමෙන්, රූපය නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදැකීමෙන්. වේදනාව නොදැකීමෙන්, වේදනාවෙහි හටගැනීම නොදැකීමෙන්, වේදනාවෙහි නැතිවීම නොදැකීමෙන්, වේදනාව නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදැකීමෙන්. සංඥාව නොදැකීමෙන්, සංඥාවෙහි හටගැනීම නොදැකීමෙන්, සංඥාවෙහි නැතිවීම නොදැකීමෙන්, සංඥාව නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදැකීමෙන්. සංස්කාරයන් නොදැකීමෙන්, සංස්කාරයන්හි හටගැනීම නොදැකීමෙන්, සංස්කාරයන්හි නැතිවීම නොදැකීමෙන්, සංස්කාරයන් නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදැකීමෙන්. වච්ඡය, විඤ්ඤාණය නොදැකීමෙන්, විඤ්ඤාණයෙහි හටගැනීම නොදැකීමෙන්, විඤ්ඤාණයෙහි නැතිවීම නොදැකීමෙන්, විඤ්ඤාණය නැතිවීමට පමුණුවන ප්‍රතිපදාව නොදැකීමෙන් – යන මේ හේතුකොටගෙනයි ලෝකයෙහි මේ නානාප්‍ර​කාර දෘෂ්ටිගතයන් හටගන්නේ.",
      "paliTitle": "Rūpaadassanādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "The Pentad Beginning with Non-Perception of Forms",
      "sinhalaTitle": "රූපඅදස්සනාදි සූත්‍ර පංචකය"
    },
    {
      "number": 617,
      "numberRange": "617-621",
      "pali": "Sāvatthinidānaṃ. Rūpe kho, vaccha, anabhisamayā…pe… rūpanirodhagāminiyā paṭipadāya anabhisamayā…pe…. Sāvatthinidānaṃ. Vedanāya kho, vaccha, anabhisamayā…pe…. Sāvatthinidānaṃ. Saññāya kho, vaccha, anabhisamayā…pe…. Sāvatthinidānaṃ. Saṅkhāresu kho, vaccha, anabhisamayā…pe…. Sāvatthinidānaṃ. Viññāṇe kho, vaccha, anabhisamayā…pe…. Pannarasamaṃ.",
      "english": "At Sāvatthī. Vaccha, through non-comprehension of form, through non-comprehension of the origin of form, through non-comprehension of the cessation of form, and through non-comprehension of the path leading to the cessation of form.\n\nAt Sāvatthī. Vaccha, through non-comprehension of feeling, through non-comprehension of the origin of feeling, through non-comprehension of the cessation of feeling, and through non-comprehension of the path leading to the cessation of feeling.\n\nAt Sāvatthī. Vaccha, through non-comprehension of perception, through non-comprehension of the origin of perception, through non-comprehension of the cessation of perception, and through non-comprehension of the path leading to the cessation of perception.\n\nAt Sāvatthī. Vaccha, through non-comprehension of mental formations, through non-comprehension of the origin of mental formations, through non-comprehension of the cessation of mental formations, and through non-comprehension of the path leading to the cessation of mental formations.\n\nAt Sāvatthī. Vaccha, through non-comprehension of consciousness, through non-comprehension of the origin of consciousness, through non-comprehension of the cessation of consciousness, and through non-comprehension of the path leading to the cessation of consciousness.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලදී.\nවච්ඡයෙනි, රූපය පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, රූපයේ හටගැනීම පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, රූපයේ නිරෝධය පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, රූප නිරෝධයට ගාමී වූ ප‍්‍ර‍තිපදාව පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද.\n\nසැවැත් නුවරදී දේශනා කරන ලදී.\nවච්ඡයෙනි, වේදනාව පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, වේදනාවේ හටගැනීම පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, වේදනාවේ නිරෝධය පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, වේදනා නිරෝධයට ගාමී වූ ප‍්‍ර‍තිපදාව පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද.\n\nසැවැත් නුවරදී දේශනා කරන ලදී.\nවච්ඡයෙනි, සංඥාව පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, සංඥාවේ හටගැනීම පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, සංඥාවේ නිරෝධය පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, සංඥා නිරෝධයට ගාමී වූ ප‍්‍ර‍තිපදාව පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද.\n\nසැවැත් නුවරදී දේශනා කරන ලදී.\nවච්ඡයෙනි, සංස්කාර පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, සංස්කාරයන්ගේ හටගැනීම පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, සංස්කාරයන්ගේ නිරෝධය පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, සංස්කාර නිරෝධයට ගාමී වූ ප‍්‍ර‍තිපදාව පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද.\n\nසැවැත් නුවරදී දේශනා කරන ලදී.\nවච්ඡයෙනි, විඤ්ඤාණය පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, විඤ්ඤාණයේ හටගැනීම පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, විඤ්ඤාණයේ නිරෝධය පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද, විඤ්ඤාණ නිරෝධයට ගාමී වූ ප‍්‍ර‍තිපදාව පිළිබඳව යථාභූත ඤාණයෙන් අවබෝධයක් නොමැති වීමෙන්ද.\n\nපහළොස්වැනි සූත්‍රයයි.",
      "paliTitle": "Rūpaanabhisamayādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "Five Discourses Beginning with Non-Realization of Form",
      "sinhalaTitle": "රූප අනභිසමය ආදි සූත්‍ර පඤ්චකය"
    },
    {
      "number": 622,
      "numberRange": "622-626",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ko nu kho, bho gotama, hetu, ko paccayo…pe… rūpe kho, vaccha, ananubodhā…pe… rūpanirodhagāminiyā paṭipadāya ananubodhā…pe…. Sāvatthinidānaṃ. Vedanāya kho, vaccha…pe…. Sāvatthinidānaṃ. Saññāya kho, vaccha…pe…. Sāvatthinidānaṃ. Saṅkhāresu kho, vaccha…pe…. Sāvatthinidānaṃ. Viññāṇe kho, vaccha ananubodhā…pe… viññāṇanirodhagāminiyā paṭipadāya ananubodhā. Vīsatimaṃ.",
      "english": "At Sāvatthī. Then the wanderer Vacchagotta, sitting to one side, said this to the Blessed One: \"What, good Gotama, is the cause, what is the condition for there being perplexity regarding form, regarding the origin of form, regarding the cessation of form, and regarding the path leading to the cessation of form?\"\n\"It is, Vacchagotta, because of not understanding form, because of not understanding the origin of form, because of not understanding the cessation of form, and because of not understanding the path leading to the cessation of form.\"\n\nAt Sāvatthī. \"It is, Vacchagotta, because of not understanding feeling, because of not understanding the origin of feeling, because of not understanding the cessation of feeling, and because of not understanding the path leading to the cessation of feeling.\"\n\nAt Sāvatthī. \"It is, Vacchagotta, because of not understanding perception, because of not understanding the origin of perception, because of not understanding the cessation of perception, and because of not understanding the path leading to the cessation of perception.\"\n\nAt Sāvatthī. \"It is, Vacchagotta, because of not understanding volitional formations, because of not understanding the origin of volitional formations, because of not understanding the cessation of volitional formations, and because of not understanding the path leading to the cessation of volitional formations.\"\n\nAt Sāvatthī. \"It is, Vacchagotta, because of not understanding consciousness, because of not understanding the origin of consciousness, because of not understanding the cessation of consciousness, and because of not understanding the path leading to the cessation of consciousness.\"",
      "sinhala": "සැවැත් නුවරදී මෙම සූත්‍රය දේශනා කරන ලදී.\n\nඑක් පසෙක අසුන් ගත් වච්ඡගොත්ත පිරිවැජියා භාග්‍ය​වතුන් වහන්සේට මෙසේ පැවසුවේය: \"භවත් ගෞතමයන් වහන්ස, [නිවැරදි අවබෝධයක් නොලැබීමට හෝ සසර දුකින් නොමිදීමට] හේතුව කවරේද, ප්‍රත්‍ය​ය කවරේද?\"\n\n(භාග්‍ය​වතුන් වහන්සේ පැවසූ සේක:) \"වච්ඡය, [ඒ සඳහා] හේතුව සහ ප්‍රත්‍ය​ය නම්, රූපය පිළිබඳ අවබෝධයක් නොමැතිවීමය. රූපයේ හටගැනීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. රූපයේ නැතිවීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. රූපයේ ආස්වාදය පිළිබඳ අවබෝධයක් නොමැතිවීමය. රූපයේ ආදීනවය පිළිබඳ අවබෝධයක් නොමැතිවීමය. රූපයෙන් මිදීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. රූප නිරෝධය පිළිබඳ අවබෝධයක් නොමැතිවීමය. රූපයේ නිරෝධයට පමුණුවන මාර්ගය (රූප නිරෝධගාමිනී ප්‍රතිපදාව) පිළිබඳ අවබෝධයක් නොමැතිවීමය.\"\n\n\"එලෙසම වච්ඡය, වේදනාව පිළිබඳ අවබෝධයක් නොමැතිවීමය. වේදනාවේ හටගැනීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. වේදනාවේ නැතිවීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. වේදනාවේ ආස්වාදය පිළිබඳ අවබෝධයක් නොමැතිවීමය. වේදනාවේ ආදීනවය පිළිබඳ අවබෝධයක් නොමැතිවීමය. වේදනාවෙන් මිදීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. වේදනා නිරෝධය පිළිබඳ අවබෝධයක් නොමැතිවීමය. වේදනාවේ නිරෝධයට පමුණුවන මාර්ගය (වේදනා නිරෝධගාමිනී ප්‍රතිපදාව) පිළිබඳ අවබෝධයක් නොමැතිවීමය.\"\n\n\"එලෙසම වච්ඡය, සංඥාව පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංඥාවේ හටගැනීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංඥාවේ නැතිවීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංඥාවේ ආස්වාදය පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංඥාවේ ආදීනවය පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංඥාවෙන් මිදීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංඥා නිරෝධය පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංඥාවේ නිරෝධයට පමුණුවන මාර්ගය (සංඥා නිරෝධගාමිනී ප්‍රතිපදාව) පිළිබඳ අවබෝධයක් නොමැතිවීමය.\"\n\n\"එලෙසම වච්ඡය, සංස්කාර පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංස්කාරයන්ගේ හටගැනීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංස්කාරයන්ගේ නැතිවීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංස්කාරයන්ගේ ආස්වාදය පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංස්කාරයන්ගේ ආදීනවය පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංස්කාරයන්ගෙන් මිදීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංස්කාර නිරෝධය පිළිබඳ අවබෝධයක් නොමැතිවීමය. සංස්කාරයන්ගේ නිරෝධයට පමුණුවන මාර්ගය (සංස්කාර නිරෝධගාමිනී ප්‍රතිපදාව) පිළිබඳ අවබෝධයක් නොමැතිවීමය.\"\n\n\"එලෙසම වච්ඡය, විඤ්ඤාණය පිළිබඳ අවබෝධයක් නොමැතිවීමය. විඤ්ඤාණයේ හටගැනීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. විඤ්ඤාණයේ නැතිවීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. විඤ්ඤාණයේ ආස්වාදය පිළිබඳ අවබෝධයක් නොමැතිවීමය. විඤ්ඤාණයේ ආදීනවය පිළිබඳ අවබෝධයක් නොමැතිවීමය. විඤ්ඤාණයෙන් මිදීම පිළිබඳ අවබෝධයක් නොමැතිවීමය. විඤ්ඤාණ නිරෝධය පිළිබඳ අවබෝධයක් නොමැතිවීමය. විඤ්ඤාණයේ නිරෝධයට පමුණුවන මාර්ගය (විඤ්ඤාණ නිරෝධගාමිනී ප්‍රතිපදාව) පිළිබඳ අවබෝධයක් නොමැතිවීමය.\"",
      "paliTitle": "Rūpaananubodhādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "The Pentad of Discourses beginning with Non-Comprehension of Form",
      "sinhalaTitle": "රූපානනුබෝධාදි සූත‍්‍ර පංචකය"
    },
    {
      "number": 627,
      "numberRange": "627-631",
      "pali": "Sāvatthinidānaṃ. Ko nu kho, bho gotama, hetu, ko paccayo…pe…. Rūpe kho, vaccha, appaṭivedhā…pe… viññāṇe kho, vaccha, appaṭivedhā…pe…. Pañcavīsatimaṃ.",
      "english": "At Sāvatthī. “What, Venerable Gotama, is the cause, what is the condition for the continuation of suffering for beings?”\n\n“Vaccha, it is due to the lack of full comprehension regarding materiality; it is due to the lack of full comprehension regarding feeling; it is due to the lack of full comprehension regarding perception; it is due to the lack of full comprehension regarding mental formations; and it is due to the lack of full comprehension regarding consciousness.”",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nභාග්‍යවතුන් වහන්ස, රූපය අවබෝධ නොකිරීමටත්, වේදනාව අවබෝධ නොකිරීමටත්, සංඥාව අවබෝධ නොකිරීමටත්, සංස්කාර අවබෝධ නොකිරීමටත්, විඤ්ඤාණය අවබෝධ නොකිරීමටත් හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?\n\nවච්ඡයෙනි, රූපය අවබෝධ නොකිරීම, වේදනාව අවබෝධ නොකිරීම, සංඥාව අවබෝධ නොකිරීම, සංස්කාර අවබෝධ නොකිරීම සහ විඤ්ඤාණය අවබෝධ නොකිරීමම (සත්‍යය) අවබෝධ නොකිරීමට හේතුව සහ ප්‍රත්‍යය වේ.",
      "paliTitle": "Rūpaappaṭivedhādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "Five Discourses beginning with Non-Penetration of Form",
      "sinhalaTitle": "රූපඅප්පටිවේධාදි සූත්‍ර පඤ්චකය"
    },
    {
      "number": 632,
      "numberRange": "632-636",
      "pali": "Sāvatthinidānaṃ. Rūpe kho, vaccha, asallakkhaṇā…pe… viññāṇe kho, vaccha, asallakkhaṇā…pe…. Tiṃsatimaṃ.",
      "english": "At Sāvatthī.\nRegarding form, Vaccha, not discerning; regarding feeling, not discerning; regarding perception, not discerning; regarding fabrications, not discerning; regarding consciousness, Vaccha, not discerning.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\nවච්ඡයෙනි, රූපයෙහි සත්‍ය​ වශයෙන් නොදැක්ම හේතු කොට ගෙන... විඤ්ඤාණයෙහි සත්‍ය​ වශයෙන් නොදැක්ම හේතු කොට ගෙන...\nතිස්වැනි සූත්‍රයයි.",
      "paliTitle": "Rūpaasallakkhaṇādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "The Pentad of Suttas beginning with Undiscerned Form",
      "sinhalaTitle": "රූපඅසල්ලක්ඛණාදි සූත්‍ර පංචකය"
    },
    {
      "number": 637,
      "numberRange": "637-641",
      "pali": "Sāvatthinidānaṃ. Rūpe kho, vaccha, anupalakkhaṇā…pe… viññāṇe kho, vaccha, anupalakkhaṇā…pe…. Pañcatiṃsatimaṃ.",
      "english": "Connected with Savatthi.\n\nIndeed, Vaccha, in form there is no discerning; in feeling there is no discerning; in perception there is no discerning; in mental formations there is no discerning; in consciousness there is no discerning.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n\nවච්ඡයෙනි, රූපයෙහිලා නොපිරිසිඳ දකින බවක් ඇත්තේය. වේදනාවෙහිලාද, සංඥාවෙහිලාද, සංස්කාරයන්හිලාද, විඤ්ඤාණයෙහිලාද නොපිරිසිඳ දකින බවක් ඇත්තේය.\n\nතිස්පස්වන සූත‍්‍රයයි.",
      "paliTitle": "Rūpaanupalakkhaṇādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "The Pentad of Discourses beginning with Non-Perception of Form",
      "sinhalaTitle": "රූප‍ානුපලක‍්ඛණාදි සූත‍්‍ර පඤ‍්චකය"
    },
    {
      "number": 642,
      "numberRange": "642-646",
      "pali": "Sāvatthinidānaṃ. Rūpe kho, vaccha, appaccupalakkhaṇā…pe… viññāṇe kho, vaccha, appaccupalakkhaṇā…pe…. Cattālīsamaṃ.",
      "english": "This discourse was given at Sāvatthī.\nIn form, Vaccha, without direct apprehension, there is no dispassion for form, and without dispassion, there is no liberation. In feeling, Vaccha, without direct apprehension, there is no dispassion for feeling, and without dispassion, there is no liberation. In perception, Vaccha, without direct apprehension, there is no dispassion for perception, and without dispassion, there is no liberation. In mental formations, Vaccha, without direct apprehension, there is no dispassion for mental formations, and without dispassion, there is no liberation. In consciousness, Vaccha, without direct apprehension, there is no dispassion for consciousness, and without dispassion, there is no liberation.\nThis is the fortieth discourse.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n\nවච්ඡයෙනි, රූපයෙහි යථා ස්වභාවය නිසි ලෙස අවබෝධ කර නොගැනීම මෙන්ම, වේදනාවෙහිද, සංඥාවෙහිද, සංස්කාරයන්හිද, විඤ්ඤාණයෙහිද යථා ස්වභාවය නිසි ලෙස අවබෝධ කර නොගැනීම මෙහි විස්තර කෙරේ.\n\nසතළිස් වන සූත‍්‍රයයි.",
      "paliTitle": "Rūpaappaccupalakkhaṇādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "The Pentad of Discourses beginning with Non-Immediate Discernment of Form",
      "sinhalaTitle": "රූපඅප‍්පච‍්චුපලක‍්ඛණාදි සූත‍්‍ර පඤ‍්චකය"
    },
    {
      "number": 647,
      "numberRange": "647-651",
      "pali": "Sāvatthinidānaṃ. Rūpe kho, vaccha, asamapekkhaṇā…pe… viññāṇe kho, vaccha, asamapekkhaṇā…pe…. Pañcacattālīsamaṃ.",
      "english": "At Sāvatthī.\nIndeed, Vaccha, there is a failure to properly examine form, a failure to properly examine feeling, a failure to properly examine perception, a failure to properly examine mental formations, and a failure to properly examine consciousness.\nThe forty-fifth.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඕ වච්ඡය, රූපයෙහි නිසි පරිදි නොසලකා හැරීම, වේදනාවෙහි නිසි පරිදි නොසලකා හැරීම, සංඥාවෙහි නිසි පරිදි නොසලකා හැරීම, සංස්කාරයන්හි නිසි පරිදි නොසලකා හැරීම, සහ විඤ්ඤාණයෙහි නිසි පරිදි නොසලකා හැරීම යනුයි.\n\nමෙය හතළිස්පස්වන සූත‍්‍රයයි.",
      "paliTitle": "Rūpaasamapekkhaṇādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "The Pentad of Discourses beginning with Rūpaasamapekkhaṇā",
      "sinhalaTitle": "රූප අසමපේක්ෂණාදී සූත්‍ර පංචකය"
    },
    {
      "number": 652,
      "numberRange": "652-656",
      "pali": "Sāvatthinidānaṃ. Rūpe kho, vaccha, appaccupekkhaṇā…pe… viññāṇe kho, vaccha, appaccupekkhaṇā…pe…. Paññāsamaṃ.",
      "english": "An account set in Savatthi.\n\nIndeed, O Vaccha, there is a lack of discerning reflection upon form, and similarly upon feeling, upon perception, upon volitional formations, and upon consciousness, thereby preventing liberation.\n\nThis is the fiftieth.",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදී.\n\nවච්ඡයෙනි, රූපය පිළිබඳව නුවණින් මෙනෙහි නොකිරීම, වේදනාව පිළිබඳව නුවණින් මෙනෙහි නොකිරීම, සංඥාව පිළිබඳව නුවණින් මෙනෙහි නොකිරීම, සංඛාර පිළිබඳව නුවණින් මෙනෙහි නොකිරීම, විඤ්ඤාණය පිළිබඳව නුවණින් මෙනෙහි නොකිරීම හේතුවෙන් දුකින් මිදීමක් සිදු නොවේ.",
      "paliTitle": "Rūpaappaccupekkhaṇādisuttapañcakaṃ",
      "vagga": "",
      "englishTitle": "The Pentad of Suttas Beginning with Non-reflection on Form",
      "sinhalaTitle": "රූපඅප්පච්චුපෙක්ඛණාදි සූත්‍ර පඤ්චකය"
    },
    {
      "number": 657,
      "numberRange": "657-660",
      "pali": "Sāvatthinidānaṃ. Atha kho vacchagotto paribbājako yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho vacchagotto paribbājako bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu, ko paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti? Rūpe kho, vaccha, appaccakkhakammā, rūpasamudaye appaccakkhakammā, rūpanirodhe appaccakkhakammā, rūpanirodhagāminiyā paṭipadāya appaccakkhakammā…pe…. Sāvatthinidānaṃ. Vedanāya kho, vaccha, appaccakkhakammā…pe… vedanānirodhagāminiyā paṭipadāya appaccakkhakammā…pe…. Sāvatthinidānaṃ. Saññāya kho, vaccha, appaccakkhakammā…pe… saññānirodhagāminiyā paṭipadāya appaccakkhakammā…pe…. Sāvatthinidānaṃ. Saṅkhāresu kho, vaccha, appaccakkhakammā…pe… saṅkhāranirodhagāminiyā paṭipadāya appaccakkhakammā…pe…. Catupaññāsamaṃ.",
      "english": "At Sāvatthī. Then the wanderer Vacchagotta approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded a courteous and memorable talk, he sat down to one side.\nSitting to one side, the wanderer Vacchagotta said this to the Blessed One: \"What, Venerable Gotama, is the cause, what is the condition, for the arising in the world of these various speculative views—such as 'the world is eternal'... and so on... 'the Tathāgata neither exists nor does not exist after death'?\"\n\n\"Vacchagotta, it is because of not having directly realized and seen form; not having directly realized and seen the origin of form; not having directly realized and seen the cessation of form; not having directly realized and seen the path leading to the cessation of form.\"\n\nAt Sāvatthī. \"Vacchagotta, it is because of not having directly realized and seen feeling; not having directly realized and seen the origin of feeling; not having directly realized and seen the cessation of feeling; not having directly realized and seen the path leading to the cessation of feeling.\"\n\nAt Sāvatthī. \"Vacchagotta, it is because of not having directly realized and seen perception; not having directly realized and seen the origin of perception; not having directly realized and seen the cessation of perception; not having directly realized and seen the path leading to the cessation of perception.\"\n\nAt Sāvatthī. \"Vacchagotta, it is because of not having directly realized and seen formations; not having directly realized and seen the origin of formations; not having directly realized and seen the cessation of formations; not having directly realized and seen the path leading to the cessation of formations.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඉක්බිති වච්ඡගොත්ත නම් පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සමීප සතුටු සාමිචියෙහි යෙදුණේය. එසේ සතුටු වීමට සුදුසු සිහිකර ගතයුතු කථාබහ නිමවා එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි වච්ඡගොත්ත පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භවත් ගෞතමයන් වහන්ස, ලෝකයෙහි මේ බොහෝ ආකාර වූ දෘෂ්ටිගත ඇතිවීමට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද? එනම් 'ලෝකය සදාකාලිකය' යනාදී වශයෙන්... 'තථාගතයන් වහන්සේ මරණින් පසු නොපවතී, එසේම නොපවතිනවා නොවේ' යනාදී වශයෙනි?\"\n\n\"වච්ඡය, රූපය පිළිබඳව අත්දැකීමෙන් නොදැකීම, රූපයේ හටගැනීම පිළිබඳව අත්දැකීමෙන් නොදැකීම, රූපයේ නැතිවීම පිළිබඳව අත්දැකීමෙන් නොදැකීම, රූපයේ නැතිවීම පිණිස පවතින ප්‍රතිපදාව පිළිබඳව අත්දැකීමෙන් නොදැකීමයි.\" සැවැත්නුවරදී දේශනා කරන ලදී.\n\n\"වච්ඡය, වේදනාව පිළිබඳව අත්දැකීමෙන් නොදැකීම, වේදනාවේ හටගැනීම පිළිබඳව අත්දැකීමෙන් නොදැකීම, වේදනාවේ නැතිවීම පිළිබඳව අත්දැකීමෙන් නොදැකීම, වේදනාවේ නැතිවීම පිණිස පවතින ප්‍රතිපදාව පිළිබඳව අත්දැකීමෙන් නොදැකීමයි.\" සැවැත්නුවරදී දේශනා කරන ලදී.\n\n\"වච්ඡය, සංඥාව පිළිබඳව අත්දැකීමෙන් නොදැකීම, සංඥාවේ හටගැනීම පිළිබඳව අත්දැකීමෙන් නොදැකීම, සංඥාවේ නැතිවීම පිළිබඳව අත්දැකීමෙන් නොදැකීම, සංඥාවේ නැතිවීම පිණිස පවතින ප්‍රතිපදාව පිළිබඳව අත්දැකීමෙන් නොදැකීමයි.\" සැවැත්නුවරදී දේශනා කරන ලදී.\n\n\"වච්ඡය, සංස්කාර පිළිබඳව අත්දැකීමෙන් නොදැකීම, සංස්කාරයන්ගේ හටගැනීම පිළිබඳව අත්දැකීමෙන් නොදැකීම, සංස්කාරයන්ගේ නැතිවීම පිළිබඳව අත්දැකීමෙන් නොදැකීම, සංස්කාරයන්ගේ නැතිවීම පිණිස පවතින ප්‍රතිපදාව පිළිබඳව අත්දැකීමෙන් නොදැකීමයි.\"\n\nපනස් හතරවන සූත්‍රයයි.",
      "paliTitle": "Rūpaappaccakkhakammādisuttacatukkaṃ",
      "vagga": "",
      "englishTitle": "The Tetrad of Discourses on Not Renouncing Form-Actions",
      "sinhalaTitle": "රූපඅප්‍රත්‍යාඛ්‍යානකර්ම ආදි සූත්‍ර චතුෂ්කය"
    },
    {
      "number": 661,
      "pali": "Sāvatthinidānaṃ. ‘‘Viññāṇe kho, vaccha, appaccakkhakammā, viññāṇasamudaye appaccakkhakammā, viññāṇanirodhe appaccakkhakammā, viññāṇanirodhagāminiyā paṭipadāya appaccakkhakammā; evamimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti vāti. Ayaṃ kho, vaccha, hetu, ayaṃ paccayo, yānimāni anekavihitāni diṭṭhigatāni loke uppajjanti – sassato lokoti vā, asassato lokoti vā, antavā lokoti vā, anantavā lokoti vā, taṃ jīvaṃ taṃ sarīranti vā, aññaṃ jīvaṃ aññaṃ sarīranti vā, hoti tathāgato paraṃ maraṇāti vā, na hoti tathāgato paraṃ maraṇāti vā, hoti ca na ca hoti tathāgato paraṃ maraṇāti vā, neva hoti na na hoti tathāgato paraṃ maraṇāti vā’’ti. Pañcapaññāsamaṃ. ",
      "english": "Vaccha, when there is not a direct understanding and realization of consciousness, not a direct understanding and realization of the origin of consciousness, not a direct understanding and realization of the cessation of consciousness, and not a direct understanding and realization of the path leading to the cessation of consciousness, then these various speculative views arise in the world: 'The world is eternal,' or 'The world is not eternal,' or 'The world is finite,' or 'The world is infinite,' or 'The life-principle is the same as the body,' or 'The life-principle is one thing and the body another,' or 'A Tathāgata exists after death,' or 'A Tathāgata does not exist after death,' or 'A Tathāgata both exists and does not exist after death,' or 'A Tathāgata neither exists nor does not exist after death.'\n\nThis, Vaccha, is the reason, this is the cause, why these various speculative views arise in the world: 'The world is eternal,' or 'The world is not eternal,' or 'The world is finite,' or 'The world is infinite,' or 'The life-principle is the same as the body,' or 'The life-principle is one thing and the body another,' or 'A Tathāgata exists after death,' or 'A Tathāgata does not exist after death,' or 'A Tathāgata both exists and does not exist after death,' or 'A Tathāgata neither exists nor does not exist after death.'",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදී. වච්ඡයෙනි, විඤ්ඤාණය සෘජුව අවබෝධ නොකළ නිසාත්, විඤ්ඤාණයේ හටගැනීම සෘජුව අවබෝධ නොකළ නිසාත්, විඤ්ඤාණයේ නිරෝධය සෘජුව අවබෝධ නොකළ නිසාත්, විඤ්ඤාණ නිරෝධයට ගමන් කරන ප්‍රතිපදාව සෘජුව අවබෝධ නොකළ නිසාත්, මෙලොවෙහි ලෝකය සදාකාලික යැයි ද, නැතිනම් ලෝකය අසදාකාලික යැයි ද... මරණින් පසු තථාගතයන් වහන්සේ නොපවතී ද නොපවතින්නේ නොවේ ද යැයි ද යනාදී වශයෙන් නොයෙක් ආකාරයේ දෘෂ්ටි හටගනී.\n\nවච්ඡයෙනි, ලෝකයෙහි මේ නොයෙක් ආකාරයේ දෘෂ්ටි හටගැනීමට මෙයම හේතුවයි, මෙයම ප්‍රත්‍යයයි. එනම්, ලෝකය සදාකාලික යැයි ද, ලෝකය අසදාකාලික යැයි ද, ලෝකය සීමා සහිත යැයි ද, ලෝකය අසීමා සහිත යැයි ද, ජීවයත් ශරීරයත් එකක්ම යැයි ද, ජීවයත් ශරීරයත් දෙකක්ම යැයි ද, මරණින් පසු තථාගතයන් වහන්සේ පවතී යැයි ද, මරණින් පසු තථාගතයන් වහන්සේ නොපවතී යැයි ද, මරණින් පසු තථාගතයන් වහන්සේ පවතී ද නොපවතී ද යැයි ද, මරණින් පසු තථාගතයන් වහන්සේ නොපවතී ද නොපවතින්නේ නොවේ ද යැයි ද යන දෘෂ්ටි යි.",
      "paliTitle": "Viññāṇaappaccakkhakammasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Consciousness and Unperceived Action",
      "sinhalaTitle": "විඤ්ඤාණ අ‌ප්‍රත්‍ය‌ාක්ෂ ක‌ර්ම සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Vacchagottasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Aññāṇā adassanā ceva, anabhisamayā ananubodhā; Appaṭivedhā asallakkhaṇā, anupalakkhaṇena appaccupalakkhaṇā; Asamapekkhaṇā appaccupekkhaṇā, appaccakkhakammanti.",
    "english": "The Vacchagotta Collection Concluded",
    "sinhala": "වච්ඡගොත්‌ත සංයුත්‌තය නිමි."
  }
}