{
  "id": "sn.3.8",
  "title": {
    "pali": "Nāgasaṃyuttaṃ",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 342,
      "pali": "Sāvatthinidānaṃ. ‘‘Catasso imā, bhikkhave, nāgayoniyo. Katamā catasso? Aṇḍajā nāgā, jalābujā nāgā, saṃsedajā nāgā, opapātikā nāgā – imā kho, bhikkhave, catasso nāgayoniyo’’ti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": ""
    },
    {
      "number": 343,
      "pali": "Sāvatthinidānaṃ. ‘‘Catasso imā, bhikkhave, nāgayoniyo. Katamā catasso? Aṇḍajā nāgā, jalābujā nāgā, saṃsedajā nāgā, opapātikā nāgā. Tatra, bhikkhave, aṇḍajehi nāgehi jalābujā ca saṃsedajā ca opapātikā ca nāgā paṇītatarā. Tatra, bhikkhave, aṇḍajehi ca jalābujehi ca nāgehi saṃsedajā ca opapātikā ca nāgā paṇītatarā. Tatra, bhikkhave, aṇḍajehi ca jalābujehi ca saṃsedajehi ca nāgehi opapātikā nāgā paṇītatarā. Imā kho, bhikkhave, catasso nāgayoniyo’’ti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṇītatarasuttaṃ",
      "vagga": ""
    },
    {
      "number": 344,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacce aṇḍajā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti? ‘‘Idha, bhikkhu, ekaccānaṃ aṇḍajānaṃ nāgānaṃ evaṃ hoti – ‘mayaṃ kho pubbe kāyena dvayakārino ahumha, vācāya dvayakārino, manasā dvayakārino. Te mayaṃ kāyena dvayakārino, vācāya dvayakārino, manasā dvayakārino, kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapannā. Sacajja mayaṃ kāyena sucaritaṃ careyyāma, vācāya sucaritaṃ careyyāma, manasā sucaritaṃ careyyāma, evaṃ mayaṃ kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyāma. Handa, mayaṃ etarahi kāyena sucaritaṃ carāma, vācāya sucaritaṃ carāma, manasā sucaritaṃ carāmā’ti. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacce aṇḍajā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Uposathasuttaṃ",
      "vagga": ""
    },
    {
      "number": 345,
      "pali": "Sāvatthinidānaṃ. Atha kho aññataro bhikkhu yena bhagavā…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacce jalābujā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti? ‘‘Idha, bhikkhu…pe… ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacce jalābujā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyauposathasuttaṃ",
      "vagga": ""
    },
    {
      "number": 346,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacce saṃsedajā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti? ‘‘Idha, bhikkhu…pe… ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacce saṃsedajā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Tatiyauposathasuttaṃ",
      "vagga": ""
    },
    {
      "number": 347,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacce opapātikā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti? ‘‘Idha, bhikkhu, ekaccānaṃ opapātikānaṃ nāgānaṃ evaṃ hoti – ‘mayaṃ kho pubbe kāyena dvayakārino ahumha, vācāya dvayakārino, manasā dvayakārino. Te mayaṃ kāyena dvayakārino, vācāya dvayakārino, manasā dvayakārino, kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapannā. Sacajja mayaṃ kāyena sucaritaṃ careyyāma, vācāya… manasā sucaritaṃ careyyāma, evaṃ mayaṃ kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyāma. Handa, mayaṃ etarahi kāyena sucaritaṃ carāma, vācāya… manasā sucaritaṃ carāmā’ti. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacce opapātikā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Catutthauposathasuttaṃ",
      "vagga": ""
    },
    {
      "number": 348,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī hoti, manasā dvayakārī hoti. Tassa sutaṃ hoti – ‘aṇḍajā nāgā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sutasuttaṃ",
      "vagga": ""
    },
    {
      "number": 349,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti?…Pe… ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ nāgānaṃ sahabyataṃ upapajjatīti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyasutasuttaṃ",
      "vagga": ""
    },
    {
      "number": 350,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā saṃsedajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti?…Pe… ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā saṃsedajānaṃ nāgānaṃ sahabyataṃ upapajjatīti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Tatiyasutasuttaṃ",
      "vagga": ""
    },
    {
      "number": 351,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘opapātikā nāgā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti. Dasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Catutthasutasuttaṃ",
      "vagga": ""
    },
    {
      "number": 352,
      "numberRange": "352-361",
      "pali": "Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘aṇḍajā nāgā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu…pe… upapajjatīti…pe… so pānaṃ deti…pe… vatthaṃ deti…pe… yānaṃ deti…pe… mālaṃ deti…pe… gandhaṃ deti…pe… vilepanaṃ deti…pe… seyyaṃ deti…pe… āvasathaṃ deti…pe… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti. Vīsatimaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Aṇḍajadānūpakārasuttadasakaṃ",
      "vagga": ""
    },
    {
      "number": 362,
      "numberRange": "362-391",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ nāgānaṃ… pe… saṃsedajānaṃ nāgānaṃ…pe… opapātikānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘opapātikā nāgā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti…pe… pānaṃ deti…pe… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti. (Iminā peyyālena dasa dasa suttantā kātabbā. Evaṃ catūsu yonīsu cattālīsaṃ veyyākaraṇā honti. Purimehi pana dasahi suttantehi saha honti paṇṇāsasuttantāti.)",
      "english": "",
      "sinhala": "",
      "paliTitle": "Jalābujādidānūpakārasuttattiṃsakaṃ",
      "vagga": ""
    }
  ],
  "footer": {
    "pali": " Nāgasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Suddhikaṃ paṇītataraṃ, caturo ca uposathā; Tassa sutaṃ caturo ca, dānūpakārā ca tālīsaṃ; Paṇṇāsa piṇḍato suttā, nāgamhi suppakāsitāti.",
    "english": "",
    "sinhala": ""
  }
}