{
  "id": "sn.3.4",
  "title": {
    "pali": "Okkantasaṃyuttaṃ",
    "english": "The Connected Discourses on Entry",
    "sinhala": "විනිවිදීම පිළිබඳ සංයුත්තය"
  },
  "sections": [
    {
      "number": 302,
      "pali": "Sāvatthinidānaṃ. ‘‘Cakkhuṃ, bhikkhave, aniccaṃ vipariṇāmi aññathābhāvi; sotaṃ aniccaṃ vipariṇāmi aññathābhāvi; ghānaṃ aniccaṃ vipariṇāmi aññathābhāvi; jivhā aniccā vipariṇāmī aññathābhāvī [vipariṇāminī aññathābhāvinī (?)]; kāyo anicco vipariṇāmī aññathābhāvī; mano anicco vipariṇāmī aññathābhāvī. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati – ayaṃ vuccati saddhānusārī, okkanto sammattaniyāmaṃ, sappurisabhūmiṃ okkanto, vītivatto puthujjanabhūmiṃ; abhabbo taṃ kammaṃ kātuṃ, yaṃ kammaṃ katvā nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjeyya; abhabbo ca [abhabbova (sī. syā. kaṃ.)] tāva kālaṃ kātuṃ yāva na sotāpattiphalaṃ sacchikaroti’’. ‘‘Yassa kho, bhikkhave, ime dhammā evaṃ paññāya mattaso nijjhānaṃ khamanti, ayaṃ vuccati – ‘dhammānusārī, okkanto sammattaniyāmaṃ, sappurisabhūmiṃ okkanto, vītivatto puthujjanabhūmiṃ; abhabbo taṃ kammaṃ kātuṃ, yaṃ kammaṃ katvā nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjeyya; abhabbo ca tāva kālaṃ kātuṃ yāva na sotāpattiphalaṃ sacchikaroti’. Yo, bhikkhave, ime dhamme evaṃ pajānāti evaṃ passati, ayaṃ vuccati – ‘sotāpanno avinipātadhammo niyato sambodhiparāyano’’’ti. Paṭhamaṃ.",
      "english": "Monks, the eye is impermanent, subject to change, and of a nature to become otherwise; the ear is impermanent, subject to change, and of a nature to become otherwise; the nose is impermanent, subject to change, and of a nature to become otherwise; the tongue is impermanent, subject to change, and of a nature to become otherwise; the body is impermanent, subject to change, and of a nature to become otherwise; the mind is impermanent, subject to change, and of a nature to become otherwise.\n\nMonks, whoever thus believes and resolutely trusts in these phenomena – such a one is called a faith-follower, one who has entered the fixed course of rightness, entered the stage of noble ones, transcended the stage of ordinary people; such a one is incapable of performing any action by which they might be reborn in hell, the animal realm, or the realm of hungry ghosts; and such a one is incapable of dying before realizing the fruit of stream-entry.\n\nMonks, for whom these phenomena are thus seen with a degree of wisdom and insight – such a one is called a Dhamma-follower, one who has entered the fixed course of rightness, entered the stage of noble ones, transcended the stage of ordinary people; such a one is incapable of performing any action by which they might be reborn in hell, the animal realm, or the realm of hungry ghosts; and such a one is incapable of dying before realizing the fruit of stream-entry.\n\nMonks, whoever thus knows and thus sees these phenomena – such a one is called a stream-enterer, one not subject to falling into lower states, fixed in destiny, bound for full enlightenment.",
      "sinhala": "මහණෙනි, ඇස අනිත්‍යයි, වෙනස්වන සුළුයි, අන්‍යාකාර බවට පත්වන සුළුයි. කන අනිත්‍යයි, වෙනස්වන සුළුයි, අන්‍යාකාර බවට පත්වන සුළුයි. නාසය අනිත්‍යයි, වෙනස්වන සුළුයි, අන්‍යාකාර බවට පත්වන සුළුයි. දිව අනිත්‍යයි, වෙනස්වන සුළුයි, අන්‍යාකාර බවට පත්වන සුළුයි. කය අනිත්‍යයි, වෙනස්වන සුළුයි, අන්‍යාකාර බවට පත්වන සුළුයි. මනස අනිත්‍යයි, වෙනස්වන සුළුයි, අන්‍යාකාර බවට පත්වන සුළුයි.\n\nමහණෙනි, යම්කිසිවෙක් මේ ධර්මයන් මෙසේ ශ්‍රද්ධාවෙන් යුතුව විශ්වාස කරයි නම්, අධිමුක්තියෙන් යුතුව අදිටන් කරයි නම්, මොහු ‘ශ්‍රද්ධා​නුසාරී’ යැයි කියනු ලැබේ. ඔහු සම්මත්ත්ව​ නියාමයට පත්වූවෙකි, සත්පුරුෂ​ භූමියට පත්වූවෙකි, පෘථග්ජන​ භූමිය ඉක්මවා සිටියෙකි. යම් කර්මයක් කොට නිරයෙහි හෝ තිරිසන් යෝනියෙහි හෝ ප්‍රේත​ විෂයෙහි උපදින කර්මයක් කිරීමට ඔහුට නොහැක. සෝවාන් ඵලය සාක්ෂාත්​ නොකර මරණයට පත්වීමට ඔහු අසමත් වේ.\n\nමහණෙනි, යමෙකුට මේ ධර්මයන් මෙසේ ප්‍රඥාවෙන් යුතුව යම් ප්‍රමාණයකට නිරීක්ෂණයට සුදුසු වේ නම්, මොහු ‘ධර්‍මානුසාරී’ යැයි කියනු ලැබේ. ඔහු සම්මත්ත්ව​ නියාමයට පත්වූවෙකි, සත්පුරුෂ​ භූමියට පත්වූවෙකි, පෘථග්ජන​ භූමිය ඉක්මවා සිටියෙකි. යම් කර්මයක් කොට නිරයෙහි හෝ තිරිසන් යෝනියෙහි හෝ ප්‍රේත​ විෂයෙහි උපදින කර්මයක් කිරීමට ඔහුට නොහැක. සෝවාන් ඵලය සාක්ෂාත්​ නොකර මරණයට පත්වීමට ඔහු අසමත් වේ. මහණෙනි, යමෙක් මේ ධර්මයන් මෙසේ ප්‍රඥාවෙන් දනියි නම්, මෙසේ දකියි නම්, මොහු ‘සෝවාන් වූවෙක්, පහළට නොවැටෙන ස්වභාවය ඇති, නියත වූ, සම්බෝධිය පරම කොට ඇති’ යැයි කියනු ලැබේ.",
      "paliTitle": "Cakkhusuttaṃ",
      "vagga": "",
      "englishTitle": "The Eye Sutta",
      "sinhalaTitle": "චක්ඛු සූත්‍රය"
    },
    {
      "number": 303,
      "pali": "Sāvatthinidānaṃ. ‘‘Rūpā, bhikkhave, aniccā vipariṇāmino aññathābhāvino; saddā aniccā vipariṇāmino aññathābhāvino; gandhā aniccā vipariṇāmino aññathābhāvino; rasā aniccā vipariṇāmino aññathābhāvino; phoṭṭhabbā aniccā vipariṇāmino aññathābhāvino; dhammā aniccā vipariṇāmino aññathābhāvino. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati, ayaṃ vuccati saddhānusārī, okkanto sammattaniyāmaṃ, sappurisabhūmiṃ okkanto, vītivatto puthujjanabhūmiṃ; abhabbo taṃ kammaṃ kātuṃ, yaṃ kammaṃ katvā nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjeyya; abhabbo ca tāva kālaṃ kātuṃ yāva na sotāpattiphalaṃ sacchikaroti’’. ‘‘Yassa kho, bhikkhave, ime dhammā evaṃ paññāya mattaso nijjhānaṃ khamanti, ayaṃ vuccati – ‘dhammānusārī, okkanto sammattaniyāmaṃ, sappurisabhūmiṃ okkanto, vītivatto puthujjanabhūmiṃ; abhabbo taṃ kammaṃ kātuṃ, yaṃ kammaṃ katvā nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjeyya; abhabbo ca tāva kālaṃ kātuṃ yāva na sotāpattiphalaṃ sacchikaroti’. Yo, bhikkhave, ime dhamme evaṃ pajānāti evaṃ passati, ayaṃ vuccati – ‘sotāpanno avinipātadhammo niyato sambodhiparāyano’’’ti. Dutiyaṃ.",
      "english": "Forms, bhikkhus, are impermanent, undergoing transformation, and of a nature to become otherwise; sounds are impermanent, undergoing transformation, and of a nature to become otherwise; odors are impermanent, undergoing transformation, and of a nature to become otherwise; flavors are impermanent, undergoing transformation, and of a nature to become otherwise; tangibles are impermanent, undergoing transformation, and of a nature to become otherwise; mental phenomena are impermanent, undergoing transformation, and of a nature to become otherwise. Bhikkhus, whoever thus believes in and resolves upon these phenomena is called a faith-follower, one who has entered the fixed course of rightness, entered the stage of the noble ones, and gone beyond the stage of ordinary people. Such a one is incapable of performing any deed that would lead to rebirth in hell, the animal realm, or the realm of hungry ghosts; and is incapable of passing away before realizing the fruit of stream-entry.\n\nBhikkhus, for whom these phenomena are thus sufficiently contemplated and accepted by wisdom, this one is called a Dhamma-follower, one who has entered the fixed course of rightness, entered the stage of the noble ones, and gone beyond the stage of ordinary people. Such a one is incapable of performing any deed that would lead to rebirth in hell, the animal realm, or the realm of hungry ghosts; and is incapable of passing away before realizing the fruit of stream-entry. Bhikkhus, whoever thus profoundly knows and clearly sees these phenomena is called a stream-enterer, one whose nature it is not to fall into lower realms, certain of liberation, with full enlightenment as their destination.",
      "sinhala": "මහණෙනි, රූපයෝ අනිත්‍යයහ, විපරිණාම වන සුළුයහ, අන්‍ය ස්වභාවයට පත්වන්නාහ. ශබ්දයෝ අනිත්‍යයහ, විපරිණාම වන සුළුයහ, අන්‍ය ස්වභාවයට පත්වන්නාහ. ගන්ධයෝ අනිත්‍යයහ, විපරිණාම වන සුළුයහ, අන්‍ය ස්වභාවයට පත්වන්නාහ. රසයෝ අනිත්‍යයහ, විපරිණාම වන සුළුයහ, අන්‍ය ස්වභාවයට පත්වන්නාහ. ස්පර්ශයෝ අනිත්‍යයහ, විපරිණාම වන සුළුයහ, අන්‍ය ස්වභාවයට පත්වන්නාහ. ධර්මයෝ අනිත්‍යයහ, විපරිණාම වන සුළුයහ, අන්‍ය ස්වභාවයට පත්වන්නාහ.\n\nමහණෙනි, යම් පුද්ගලයෙක් මේ ධර්මයන් (රූප, ශබ්ද, ගන්ධ, රස, ස්පර්ශ, ධර්ම යන) මෙසේ ශ්‍රද්ධාවෙන් අදහයිද, අධිමුක්තියෙන් යුතුව විශ්වාස කරයිද, මේ පුද්ගලයා ශ්‍රද්ධානුසාරී (ශ්‍රද්ධාවෙන් මාර්ගයට පිවිසෙන) යනුවෙන් කියනු ලැබේ. ඔහු සම්මත නියාමයට (නිවනට නියත වූ මාර්ගයට) පිවිසියේය. සත්පුරුෂ භූමියට පිවිසියේය. පෘථග්ජන භූමිය ඉක්මවා ගියේය. යම් කර්මයක් කොට නිරයට හෝ තිරශ්චීන යෝනියට හෝ ප්‍රේත විෂයයට හෝ උපදින්නේ නම්, ඒ කර්මය කිරීමට ඔහු අභව්‍යය (නොහැකිය). තවද, සෝවාන් ඵලය සාක්ෂාත් කරන තුරු ඔහු මරණයට පත්වීමට (කාලක්‍රියා කිරීමට) ද අභව්‍යය (නොහැකිය).\n\nමහණෙනි, යම් පුද්ගලයෙකුට මේ ධර්මයෝ මෙසේ ප්‍රඥාවෙන් යම් පමණකට විමසා බැලීමට (නිජ්ඣානයට) ඉවසුම් දෙද්ද (එනම් ප්‍රඥාවෙන් විමසා පිළිගත හැකි නම්), මේ පුද්ගලයා ධර්මානුසාරී (ධර්මය අනුව මාර්ගයට පිවිසෙන) යනුවෙන් කියනු ලැබේ. ඔහු සම්මත නියාමයට පිවිසියේය. සත්පුරුෂ භූමියට පිවිසියේය. පෘථග්ජන භූමිය ඉක්මවා ගියේය. යම් කර්මයක් කොට නිරයට හෝ තිරශ්චීන යෝනියට හෝ ප්‍රේත විෂයයට හෝ උපදින්නේ නම්, ඒ කර්මය කිරීමට ඔහු අභව්‍යය. තවද, සෝවාන් ඵලය සාක්ෂාත් කරන තුරු ඔහු මරණයට පත්වීමට ද අභව්‍යය. මහණෙනි, යම් පුද්ගලයෙක් මේ ධර්මයන් මෙසේ ප්‍රඥාවෙන් අවබෝධ කරයිද, මෙසේ දකීද, මේ පුද්ගලයා සෝවාන් වූවෙක්, (සතර අපායට) නොවැටෙන ස්වභාවය ඇත්තෙක්, (නිවනට) නියත වූවෙක්, සම්බෝධිය පරම කොට ඇත්තෙක් යනුවෙන් කියනු ලැබේ.",
      "paliTitle": "Rūpasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Form",
      "sinhalaTitle": "රූප සූත්‍රය"
    },
    {
      "number": 304,
      "pali": "Sāvatthinidānaṃ. ‘‘Cakkhuviññāṇaṃ, bhikkhave, aniccaṃ vipariṇāmi aññathābhāvi; sotaviññāṇaṃ… ghānaviññāṇaṃ… jivhāviññāṇaṃ… kāyaviññāṇaṃ… manoviññāṇaṃ aniccaṃ vipariṇāmi aññathābhāvi. Yo bhikkhave…pe… sambodhiparāyano’’ti. Tatiyaṃ.",
      "english": "At Sāvatthī. “Eye-consciousness, monks, is impermanent, subject to change, and of a nature to become otherwise; ear-consciousness is impermanent, subject to change, and of a nature to become otherwise; nose-consciousness is impermanent, subject to change, and of a nature to become otherwise; tongue-consciousness is impermanent, subject to change, and of a nature to become otherwise; body-consciousness is impermanent, subject to change, and of a nature to become otherwise; mind-consciousness is impermanent, subject to change, and of a nature to become otherwise. Whoever, monks, truly understands this, is ultimately bound for full awakening.”",
      "sinhala": "සැවැත් නුවරදී වදාළ සූත්‍රයකි.\n\nමහණෙනි, චක්ඛුවිඤ්ඤාණය (ඇසට අරමුණු වන රූප දැකීම) අනිත්‍ය ය, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය, වෙනත් බවට පත් වන්නකි. සෝත​වි​ඤ්​ඤා​ණ​ය (කණට අරමුණු වන ශබ්ද ඇසීම) අනිත්‍ය ය, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය, වෙනත් බවට පත් වන්නකි. ඝාණ​වි​ඤ්​ඤා​ණ​ය (නැහැයට අරමුණු වන ගඳ දැනීම) අනිත්‍ය ය, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය, වෙනත් බවට පත් වන්නකි. ජිව්හා​වි​ඤ්​ඤා​ණ​ය (දිවට අරමුණු වන රස දැනීම) අනිත්‍ය ය, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය, වෙනත් බවට පත් වන්නකි. කාය​වි​ඤ්​ඤා​ණ​ය (කයට අරමුණු වන පහස දැනීම) අනිත්‍ය ය, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය, වෙනත් බවට පත් වන්නකි. මනෝ​වි​ඤ්​ඤා​ණ​ය (මනසට අරමුණු වන අදහස් දැනීම) අනිත්‍ය ය, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය, වෙනත් බවට පත් වන්නකි. මහණෙනි, යමෙක් මේ අනිත්‍ය වූ ධර්ම​යන් අනිත්‍ය වශයෙනුත්, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ධර්ම​යන් වෙනස් වීමේ ස්වභාවයෙන් යුක්ත වශයෙනුත්, වෙනත් බවට පත් වන ධර්ම​යන් වෙනත් බවට පත් වන වශයෙනුත් දක්නේ ද, හෙතෙම මැනවින් දක්නේ ය. මැනවින් දක්නා හේ නිර්වේදයට (කෙලෙස්වලින් කලකිරීමට) පැමිණෙයි. නිර්වේදයට පැමිණි හේ නොඇලෙයි. නොඇලෙන හේ (සසර දුකින්) මිදෙයි. මිදුණු කල්හි ‘මිදුණෙමි’ යන ඥානය පහළ වෙයි. ‘ජාතිය ක්ෂ​ය විය, බ්‍ර​හ්ම​චා​රී ජීවිතය සම්පූ​ර්ණ කරන ලදී, කළ යුත්ත කරන ලදී, නැවත මේ භවයට නොපැමිණෙමි’ යි ඔහු ප්‍ර​ත්‍ය​වේ​ක්ෂා කරයි. මහණෙනි, මෙසේ අනිත්‍යතාව පිළිබඳ යථාභූත ඥාන​යෙන් යුක්ත වූ භි​ක්ෂු​ව සම්බෝධිය (පරම අවබෝධය) පිණිස පවතී. මෙය තෙවැනි සූත්‍ර​යයි.",
      "paliTitle": "Viññāṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Consciousness",
      "sinhalaTitle": "විඤ්ඤාණ සූත්‍රය"
    },
    {
      "number": 305,
      "pali": "Sāvatthinidānaṃ. ‘‘Cakkhusamphasso, bhikkhave, anicco vipariṇāmī aññathābhāvī; sotasamphasso… ghānasamphasso… jivhāsamphasso… kāyasamphasso… manosamphasso anicco vipariṇāmī aññathābhāvī. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati, ayaṃ vuccati ‘saddhānusārī…pe… sambodhiparāyano’’’ti. Catutthaṃ.",
      "english": "Monks, eye-contact, ear-contact, nose-contact, tongue-contact, body-contact, and mind-contact are impermanent, transformational, and alterable. Whoever, monks, thus believes in and resolves upon these phenomena, he is called a faith-follower... bound for full enlightenment.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\n“මහණෙනි, චක්ඛුස්පර්ශය අනිත්‍යයි, විපරිනාමීයි, අන්‍යථාභාවීයි. සෝතස්පර්ශය, ඝානස්පර්ශය, ජිව්හාස්පර්ශය, කායස්පර්ශය, මනෝස්පර්ශය ද අනිත්‍යයි, විපරිනාමීයි, අන්‍යථාභාවීයි. මහණෙනි, යමෙක් මේ ධර්මයන් මෙසේ ශ්‍රද්ධා කරන්නේද, අධිමුක්ත වෙයිද, ඔහු ‘ශ්‍රද්ධානුසාරී’ යැයිද, ‘සම්බෝධිපරායන’ යැයිද කියනු ලැබේ.”\n\nසිවුවන සූත්‍රයයි.",
      "paliTitle": "Samphassasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Contact",
      "sinhalaTitle": "සම්ඵස්ස සූත්‍රය"
    },
    {
      "number": 306,
      "pali": "Sāvatthinidānaṃ. ‘‘Cakkhusamphassajā, bhikkhave, vedanā aniccā vipariṇāmī aññathābhāvī; sotasamphassajā vedanā…pe… ghānasamphassajā vedanā…pe… jivhāsamphassajā vedanā…pe… kāyasamphassajā vedanā…pe… manosamphassajā vedanā aniccā vipariṇāmī aññathābhāvī. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati, ayaṃ vuccati ‘saddhānusārī…pe… sambodhiparāyano’’’ti. Pañcamaṃ.",
      "english": "At Sāvatthī.\n\nMonks, feelings arisen from eye-contact are impermanent, subject to change, and liable to alter; feelings arisen from ear-contact are impermanent, subject to change, and liable to alter; feelings arisen from nose-contact are impermanent, subject to change, and liable to alter; feelings arisen from tongue-contact are impermanent, subject to change, and liable to alter; feelings arisen from body-contact are impermanent, subject to change, and liable to alter; and feelings arisen from mind-contact are impermanent, subject to change, and liable to alter.\n\nWhoever, monks, thus believes and is firmly resolved upon these phenomena, that one is called a 'faith-follower' and is destined for complete enlightenment.",
      "sinhala": "සැවැත් නුවරදී වදාළ සූත්‍රයකි.\n\nමහණෙනි, චක්ඛුසම්ඵස්සයෙන් හටගන්නා වේදනාව අනිත්‍යය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය, අන් අයුරකින් සිදුවන සුළුය. සෝතසම්ඵස්සයෙන් හටගන්නා වේදනාව අනිත්‍යය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය, අන් අයුරකින් සිදුවන සුළුය. ඝානසම්ඵස්සයෙන් හටගන්නා වේදනාව අනිත්‍යය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය, අන් අයුරකින් සිදුවන සුළුය. ජිව්හාසම්ඵස්සයෙන් හටගන්නා වේදනාව අනිත්‍යය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය, අන් අයුරකින් සිදුවන සුළුය. ක_ායසම්ඵස්සයෙන් හටගන්නා වේදනාව අනිත්‍යය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය, අන් අයුරකින් සිදුවන සුළුය. මනෝසම්ඵස්සයෙන් හටගන්නා වේදනාව අනිත්‍යය, වෙනස්වන සුළු ස්වභාවයෙන් යුක්තය, අන් අයුරකින් සිදුවන සුළුය. මහණෙනි, යමෙක් මේ ධර්මයන් මෙසේ අදහයිද, අධිමුක්ත වෙයිද, හෙතෙම සද්ධානුසාරී යැයිද, ධම්මානුසාරී යැයිද, සද්ධාවිමුත්ත යැයිද, පඤ්ඤාවිමුත්ත යැයිද, සම්බෝධිපරායන යැයිද කියනු ලැබේ.",
      "paliTitle": "Samphassajāsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse Arising from Contact",
      "sinhalaTitle": "ස්පර්ශජ සූත්‍රය"
    },
    {
      "number": 307,
      "pali": "Sāvatthinidānaṃ. ‘‘Rūpasaññā, bhikkhave, aniccā vipariṇāmī aññathābhāvī; saddasaññā… gandhasaññā… rasasaññā… phoṭṭhabbasaññā… dhammasaññā aniccā vipariṇāmī aññathābhāvī. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati, ayaṃ vuccati ‘saddhānusārī…pe… sambodhiparāyano’’’ti. Chaṭṭhaṃ.",
      "english": "At Sāvatthī. Perception of forms, O monastics, is impermanent, subject to transformation, and of a nature to become otherwise; perception of sounds, perception of odors, perception of flavors, perception of tangibles, and perception of mental phenomena are likewise impermanent, subject to transformation, and of a nature to become otherwise. Whoever, O monastics, believes in these phenomena thus and resolves upon them with firm conviction, such a one is called a faith-follower, and is one whose ultimate destination is full awakening.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nමහණෙනි, රූප සංඥාව අනිත්‍ය‌යි, විපරිණාමීයි, අඤ්ඤථාභාවීයි. ශබ්ද සංඥාව... ගන්ධ සංඥාව... රස සංඥාව... ස්පර්ශ සංඥාව... ධම්ම සංඥාව අනිත්‍ය‌යි, විපරිණාමීයි, අඤ්ඤථාභාවීයි. මහණෙනි, යම් කෙනෙක් මේ ධර්මයන් මෙසේ ශ්‍ර‌ද්ධාවෙන් පිළිගනියිද, අධිමුක්ත වෙයිද, ඔහු 'ශ්‍ර‌ද්ධානුසාරී' යැයි කියනු ලැබේ... සම්බෝධිය පිණිස පරායන වූවෙක් යැයි කියනු ලැබේ.",
      "paliTitle": "Rūpasaññāsuttaṃ",
      "vagga": "",
      "englishTitle": "Perception of Form Sutta",
      "sinhalaTitle": "රූප සං‍ජ‍්ඤා සූ‍ත‍්‍රය"
    },
    {
      "number": 308,
      "pali": "Sāvatthinidānaṃ. ‘‘Rūpasañcetanā, bhikkhave, aniccā vipariṇāmī aññathābhāvī; saddasañcetanā… gandhasañcetanā… rasasañcetanā… phoṭṭhabbasañcetanā… dhammasañcetanā aniccā vipariṇāmī aññathābhāvī. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati, ayaṃ vuccati ‘saddhānusārī…pe… sambodhiparāyano’’’ti. Sattamaṃ.",
      "english": "At Sāvatthī. Monks, volitional thought regarding form is impermanent, subject to alteration, and liable to become otherwise; volitional thought regarding sound, volitional thought regarding smell, volitional thought regarding taste, volitional thought regarding touch, and volitional thought regarding mental phenomena are impermanent, subject to alteration, and liable to become otherwise. Monks, whoever thus believes and is deeply convinced about these phenomena, this one is called a 'faith-follower,' destined for full awakening.",
      "sinhala": "මේ සූත්‍රය සැවැත් නුවරදී දේශනා කරන ලද්දකි. මහණෙනි, රූපය පිළිබඳ චේතනාව අනිත්‍යයි, වෙනස් වීමේ ස්වභාවයෙන් යුක්තයි, වෙනත් ආකාරයකට පත් වන්නකි. ශබ්දය පිළිබඳ චේතනාව, ගන්ධය පිළිබඳ චේතනාව, රසය පිළිබඳ චේතනාව, ස්පර්ශය පිළිබඳ චේතනාව, ධර්මය (මනෝමය අරමුණු) පිළිබඳ චේතනාව ද අනිත්‍යයි, වෙනස් වීමේ ස්වභාවයෙන් යුක්තයි, වෙනත් ආකාරයකට පත් වන්නකි.\n\nමහණෙනි, යම්කිසි පුද්ගලයෙක් මේ ධර්මයන් මෙලෙස විශ්වාස කරන්නේ ද, තදින් අදහන්නේ ද, ඔහු ශ්‍රද්ධානුසාරී (ශ්‍රද්ධාව අනුව ගමන් කරන්නා) යැයි කියනු ලැබේ. ඔහු අවසානයේ සම්බෝධිය (පරම අවබෝධය) පිණිස පවතින්නෙකි.",
      "paliTitle": "Rūpasañcetanāsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Intention Concerning Form",
      "sinhalaTitle": "රූප සංචේතනා සූත්‍රය"
    },
    {
      "number": 309,
      "pali": "Sāvatthinidānaṃ. ‘‘Rūpataṇhā, bhikkhave, aniccā vipariṇāmī aññathābhāvī; saddataṇhā… gandhataṇhā… rasataṇhā… phoṭṭhabbataṇhā… dhammataṇhā aniccā vipariṇāmī aññathābhāvī. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati, ayaṃ vuccati ‘saddhānusārī…pe… sambodhiparāyano’’’ti. Aṭṭhamaṃ.",
      "english": "At Sāvatthī, craving for forms, monks, is impermanent, transforming, and liable to become otherwise; craving for sounds, craving for smells, craving for tastes, craving for tangible objects, and craving for mental phenomena are impermanent, transforming, and liable to become otherwise. Monks, whoever thus trusts in and is resolute about these phenomena is called a faith-follower, one destined for full awakening.",
      "sinhala": "සැවැත් නුවරදී.\n\nමහණෙනි, රූප තණ්හාව අනිත්‍යයි, වෙනස්වන සුළුයි, වෙනස් ස්වභාවයෙන් යුක්තයි. ශබ්ද තණ්හාව… ගන්ධ තණ්හාව… රස තණ්හාව… ඵොට්ඨබ්බ තණ්හාව… ධර්ම තණ්හාව අනිත්‍යයි, වෙනස්වන සුළුයි, වෙනස් ස්වභාවයෙන් යුක්තයි. මහණෙනි, යමෙක් මේ ධර්මයන් මෙලෙස ශ්‍රද්ධාවෙන් යුතුව අදිටන් කර ගනියිද, ඔහු සද්ධාවෙන් අනුගමනය කරන්නා වූ, සම්බෝධිය පරමායනය කොට ඇත්තෙක් යැයි කියනු ලැබේ.",
      "paliTitle": "Rūpataṇhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Craving for Form",
      "sinhalaTitle": "රූපතණ‍්හා සූත්‍රය"
    },
    {
      "number": 310,
      "pali": "Sāvatthinidānaṃ. ‘‘Pathavīdhātu, bhikkhave, aniccā vipariṇāmī aññathābhāvī; āpodhātu… tejodhātu… vāyodhātu… ākāsadhātu… viññāṇadhātu aniccā vipariṇāmī aññathābhāvī. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati, ayaṃ vuccati ‘saddhānusārī…pe… sambodhiparāyano’’’ti. Navamaṃ.",
      "english": "At Sāvatthī. The earth element, monks, is impermanent, subject to transformation, and of a nature to become otherwise. The water element, the fire element, the wind element, the space element, and the consciousness element are all impermanent, subject to transformation, and of a nature to become otherwise. Whoever, monks, thus believes and is firmly convinced of these phenomena, is called 'a faith-follower leading to complete enlightenment'.",
      "sinhala": "සැවැත්නුවරදීය. ‘‘මහණෙනි, පඨවි ධාතුව අනිත්‍ය යි, වෙනස්වීමේ ස්වභාවයෙන් යුක්ත යි, වෙනත් බවට පත්වීමේ ස්වභාවයෙන් යුක්ත යි; ආපෝ ධාතුව ද, තේජෝ ධාතුව ද, වායෝ ධාතුව ද, ආකාශ ධාතුව ද, විඤ්ඤාණ ධාතුව ද අනිත්‍ය යි, වෙනස්වීමේ ස්වභාවයෙන් යුක්ත යි, වෙනත් බවට පත්වීමේ ස්වභාවයෙන් යුක්ත යි. යම් මහණෙක් මේ ධර්මයන් මෙලෙස ශ්‍ර‌ද්ධාවෙන් පිළිගන්නේ ද, අධිමුක්තියෙන් යුතුව නිශ්චය කරන්නේ ද, මෙහු ශ්‍ර‌ද්ධානුසාරී ... සම්බෝධිය පරමාන්තය කොට ඇත්තා යැයි කියනු ලැබේ.’’",
      "paliTitle": "Pathavīdhātusuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on the Earth Element",
      "sinhalaTitle": "පඨවී ධාතු සූත‍්‍රය"
    },
    {
      "number": 311,
      "pali": "Sāvatthinidānaṃ. ‘‘Rūpaṃ, bhikkhave, aniccaṃ vipariṇāmi aññathābhāvi; vedanā aniccā vipariṇāmī aññathābhāvī; saññā… saṅkhārā aniccā vipariṇāmino aññathābhāvino; viññāṇaṃ aniccaṃ vipariṇāmi aññathābhāvi. Yo, bhikkhave, ime dhamme evaṃ saddahati adhimuccati, ayaṃ vuccati saddhānusārī, okkanto sammattaniyāmaṃ, sappurisabhūmiṃ okkanto, vītivatto puthujjanabhūmiṃ; abhabbo taṃ kammaṃ kātuṃ, yaṃ kammaṃ katvā nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjeyya; abhabbo ca tāva kālaṃ kātuṃ yāva na sotāpattiphalaṃ sacchikaroti’’. ‘‘Yassa kho, bhikkhave, ime dhammā evaṃ paññāya mattaso nijjhānaṃ khamanti, ayaṃ vuccati – ‘dhammānusārī, okkanto sammattaniyāmaṃ, sappurisabhūmiṃ okkanto, vītivatto puthujjanabhūmiṃ; abhabbo taṃ kammaṃ kātuṃ, yaṃ kammaṃ katvā nirayaṃ vā tiracchānayoniṃ vā pettivisayaṃ vā upapajjeyya; abhabbo ca tāva kālaṃ kātuṃ yāva na sotāpattiphalaṃ sacchikaroti’. Yo, bhikkhave, ime dhamme evaṃ pajānāti evaṃ passati, ayaṃ vuccati – ‘sotāpanno avinipātadhammo niyato sambodhiparāyano’’’ti. Dasamaṃ. ",
      "english": "Monks, form is impermanent, subject to change, and liable to alteration; feeling is impermanent, subject to change, and liable to alteration; perception is impermanent, subject to change, and liable to alteration; volitional formations are impermanent, subject to change, and liable to alteration; consciousness is impermanent, subject to change, and liable to alteration.\n\nMonks, whoever thus places faith in and is committed to these phenomena is called a faith-follower. He has entered the fixed course of rightness, has entered the plane of the noble ones, and has transcended the plane of the ordinary person. He is incapable of performing any action by which he would be reborn in hell, the animal realm, or the realm of hungry ghosts. He is also incapable of passing away until he has realized the fruit of stream-entry.\n\nMonks, for whomever these phenomena are thus sufficiently discerned by wisdom through contemplation, he is called a Dhamma-follower. He has entered the fixed course of rightness, has entered the plane of the noble ones, and has transcended the plane of the ordinary person. He is incapable of performing any action by which he would be reborn in hell, the animal realm, or the realm of hungry ghosts. He is also incapable of passing away until he has realized the fruit of stream-entry.\n\nMonks, whoever thus understands and thus sees these phenomena is called a stream-enterer, no longer subject to falling into lower realms, fixed on the path, and destined for full enlightenment.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\n\"භික්ෂූන් වහන්ස, රූපය අනිත්‍ය ය, වෙනස් වන ස්වභාවය ඇත්තකි, වෙනත් ආකාරයකට පත්වන්නකි. වේදනාව අනිත්‍ය ය, වෙනස් වන ස්වභාවය ඇත්තකි, වෙනත් ආකාරයකට පත්වන්නකි. සංඥාව (අනිත්‍ය ය, වෙනස් වන ස්වභාවය ඇත්තකි, වෙනත් ආකාරයකට පත්වන්නකි); සංස්කාරයෝ අනිත්‍ය ය, වෙනස් වන ස්වභාවය ඇත්තෝ ය, වෙනත් ආකාරයකට පත්වන්නෝ ය. විඤ්ඤාණය අනිත්‍ය ය, වෙනස් වන ස්වභාවය ඇත්තකි, වෙනත් ආකාරයකට පත්වන්නකි. භික්ෂූන් වහන්ස, යමෙක් මේ ධර‍්මයන් මෙසේම ශ්‍රද්ධාවෙන් අදහයි ද, අධිමුක්ත කරයි ද (දෘෂ්ටියෙන් යුතුව අල්ලා ගනී ද), මේ තැනැත්තා ශ්‍රද්ධානුසාරී යැයි කියනු ලැබේ. ඔහු සම්මත්තනියාමයට (නිවැරදි දහම් මඟට) එළඹියේ වෙයි. සත්පුරුෂ භූමියට එළඹියේ වෙයි. පෘථග්ජන භූමිය ඉක්මවා ගියේ වෙයි. ඔහු යම් කර්‍මයක් කොට නිරයෙහි හෝ තිරිසන් යෝනියෙහි හෝ ප්‍රේත විෂයෙහි උපදින්නට හේතු වේ නම්, ඒ කර්‍මය කිරීමට අපොහොසත් වෙයි. සෝවාන් ඵලය සාක්ෂාත් නොකරන තුරු මරණයට පත්වීමට ද ඔහු අපොහොසත් වෙයි.\"\n\n\"භික්ෂූන් වහන්ස, යමෙකුට නම් මේ ධර‍්මයන් ප්‍රඥාවෙන් යම් පමණකට මනාව විමර්ශනය කිරීමට (පිරිසිඳ දකින්නට) ඔරොත්තු දෙයි ද, මේ තැනැත්තා ධර‍්මානුසාරී යැයි කියනු ලැබේ. ඔහු සම්මත්තනියාමයට (නිවැරදි දහම් මඟට) එළඹියේ වෙයි. සත්පුරුෂ භූමියට එළඹියේ වෙයි. පෘථග්ජන භූමිය ඉක්මවා ගියේ වෙයි. ඔහු යම් කර්‍මයක් කොට නිරයෙහි හෝ තිරිසන් යෝනියෙහි හෝ ප්‍රේත විෂයෙහි උපදින්නට හේතු වේ නම්, ඒ කර්‍මය කිරීමට අපොහොසත් වෙයි. සෝවාන් ඵලය සාක්ෂාත් නොකරන තුරු මරණයට පත්වීමට ද ඔහු අපොහොසත් වෙයි.\"\n\nභික්ෂූන් වහන්ස, යමෙක් මේ ධර‍්මයන් මෙසේම ප්‍රඥාවෙන් අවබෝධ කරයි ද, මෙසේම දකී ද, මේ තැනැත්තා සෝවාන් වූවෙකි, විනිපාතයට (දුර්ගති වලට) නොවැටෙන සුළු ධර‍්ම ස්වභාවය ඇත්තෙකි, නිත්‍ය වූ, සම්බෝධිය (පූර්‍ණ අවබෝධය) කරා යන මාර්ගයට එළඹියේ වෙයි යැයි කියනු ලැබේ.",
      "paliTitle": "Khandhasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on the Aggregates",
      "sinhalaTitle": "ස්කන්ධ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Okkantasaṃyuttaṃ [okkantikasaṃyuttaṃ (pī. ka.)] samattaṃ. Tassuddānaṃ – Cakkhu rūpañca viññāṇaṃ, phasso ca vedanāya ca; Saññā ca cetanā taṇhā, dhātu khandhena te dasāti.",
    "english": "Connected Discourses on Entry",
    "sinhala": "ඔක්කන්ති සංයුත්තය"
  }
}