{
  "id": "sn.3.13",
  "title": {
    "pali": "Jhānasaṃyuttaṃ",
    "english": "The Connected Discourses on Meditative Absorptions",
    "sinhala": "ධ්‍යානසංයුත්‍තය"
  },
  "sections": [
    {
      "number": 662,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ samāpattikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ samāpattikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho [pāmokkho (syā. kaṃ.) evamuparipi] ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ samāpattikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Paṭhamaṃ.",
      "english": "Monks, there are these four types of meditators. Which four? Here, monks, a certain meditator is skilled in understanding concentration but not skilled in attaining concentration. Here again, monks, a certain meditator is skilled in attaining concentration but not skilled in understanding concentration. Here again, monks, a certain meditator is neither skilled in understanding concentration nor skilled in attaining concentration. Here again, monks, a certain meditator is both skilled in understanding concentration and skilled in attaining concentration. Among these, monks, the meditator who is both skilled in understanding concentration and skilled in attaining concentration is considered the foremost, best, chief, supreme, and most excellent of these four types of meditators. Just as, monks, from a cow comes milk; from milk, curds; from curds, fresh butter; from fresh butter, ghee; and from ghee, the cream of ghee, which is declared to be the best of all there; even so, monks, the meditator who is both skilled in understanding concentration and skilled in attaining concentration is the foremost, best, chief, supreme, and most excellent of these four types of meditators.",
      "sinhala": "සැවැත් නුවරදී.\n\n“මහණෙනි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙක් වෙති. කවර සතර දෙනෙක්ද? මහණෙනි, මෙහිලා ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශල වෙයි, එනම් සමාධිය මැනවින් පිහිටුවාගෙන සිටීමට දක්ෂයෙකි. එහෙත්, සමාධියට සමවැදීමට දක්ෂයෙක් නො වෙයි. මහණෙනි, මෙහිලා ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාපත්ති කුශල වෙයි, එනම් සමාධියට සමවැදීමට දක්ෂයෙකි. එහෙත්, සමාධිය මැනවින් පිහිටුවාගෙන සිටීමට දක්ෂයෙක් නො වෙයි. මහණෙනි, මෙහිලා ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශල ද නො වෙයි, සමාධියෙහි සමාපත්ති කුශල ද නො වෙයි. එනම්, සමාධිය මැනවින් පිහිටුවාගෙන සිටීමට දක්ෂයෙක් ද නො වෙයි, සමාධියට සමවැදීමට දක්ෂයෙක් ද නො වෙයි. මහණෙනි, මෙහිලා ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශල ද වෙයි, සමාධියෙහි සමාපත්ති කුශල ද වෙයි. එනම්, සමාධිය මැනවින් පිහිටුවාගෙන සිටීමට ද දක්ෂයෙකි, සමාධියට සමවැදීමට ද දක්ෂයෙකි. මහණෙනි, මේ සතර දෙනා අතුරින් යම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශල ද වෙයි, සමාධියෙහි සමාපත්ති කුශල ද වෙයි ද, මේ ධ්‍යාන කරන්නා මේ සතර දෙනා අතුරින් අග්‍ර ද වෙයි, ශ්‍රේෂ්ඨ ද වෙයි, ප්‍රධාන ද වෙයි, උත්තම ද වෙයි, ප්‍රවර ද වෙයි. මහණෙනි, යම් සේ ගවයාගෙන් කිරි ද, කිරෙන් දෙන ද, දෙනෙන් වෙඬරු ද, වෙඬරුවෙන් ගිතෙල් ද, ගිතෙලෙන් ගිතෙල් සාරය ද වේද, එහි ගිතෙල් සාරය අග්‍ර යැයි කියනු ලැබේ. එලෙසින්ම, මහණෙනි, යම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශල ද වෙයි, සමාධියෙහි සමාපත්ති කුශල ද වෙයි ද, මේ ධ්‍යාන කරන්නා මේ සතර දෙනා අතුරින් අග්‍ර ද වෙයි, ශ්‍රේෂ්ඨ ද වෙයි, ප්‍රධාන ද වෙයි, උත්තම ද වෙයි, ප්‍රවර ද වෙයි.”\n\nපළමුවැන්නයි.",
      "paliTitle": "Samādhimūlakasamāpattisuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Attainments Rooted in Samādhi",
      "sinhalaTitle": "සමාධිමූලකසමාපත්තිසූත‍්‍රය"
    },
    {
      "number": 663,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ ṭhitikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Dutiyaṃ.",
      "english": "Monks, these are four types of meditators. Which four? Here, monks, a certain meditator is skilled in attaining concentration, but not skilled in sustaining concentration. Here again, monks, a certain meditator is skilled in sustaining concentration, but not skilled in attaining concentration. Here again, monks, a certain meditator is neither skilled in attaining concentration nor skilled in sustaining concentration. Here again, monks, a certain meditator is both skilled in attaining concentration and skilled in sustaining concentration. Among these, monks, that meditator who is both skilled in attaining concentration and skilled in sustaining concentration is the foremost, the best, the chief, the supreme, and the most excellent of these four meditators. Just as, monks, from a cow comes milk; from milk, curds; from curds, fresh butter; from fresh butter, ghee; and from ghee, the cream of ghee, which is declared to be the best; even so, monks, that meditator who is both skilled in attaining concentration and skilled in sustaining concentration is the foremost, the best, the chief, the supreme, and the most excellent of these four meditators.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n\n‘‘මහණෙනි, මේ භාවනා කරන්නෝ සතර දෙනෙක් වෙති. කවර සතර දෙනෙක්ද? මහණෙනි, මෙහි ඇතැම් භාවනා කරන්නෙක් සමාධියට පැමිණීමට දක්ෂ​යෙකි. එහෙත්, සමාධියේ පිහිටුවීමට දක්ෂ​යෙක් නොවේ. මහණෙනි, තවද මෙහි ඇතැම් භාවනා කරන්නෙක් සමාධියේ පිහිටුවීමට දක්ෂ​යෙකි. එහෙත්, සමාධියට පැමිණීමට දක්ෂ​යෙක් නොවේ. මහණෙනි, තවද මෙහි ඇතැම් භාවනා කරන්නෙක් සමාධියට පැමිණීමටද දක්ෂ​යෙක් නොවේ, සමාධියේ පිහිටුවීමටද දක්ෂ​යෙක් නොවේ. මහණෙනි, තවද මෙහි ඇතැම් භාවනා කරන්නෙක් සමාධියට පැමිණීමටද දක්ෂ​යෙකි, සමාධියේ පිහිටුවීමටද දක්ෂ​යෙකි. මහණෙනි, ඒ භාවනා කරන්නා අතුරින් යම් භාවනා කරන්නෙක් සමාධියට පැමිණීමටද දක්ෂ​යෙක්ද, සමාධියේ පිහිටුවීමටද දක්ෂ​යෙක්ද, මේ සතර භාවනා කරන්නන් අතුරින් හේ අග්‍ර​ය, ශ්‍රේෂ්ඨ​ය, ප්‍ර​ධාන ය, උත්තම ය, ප්‍ර​වර ය. මහණෙනි, යම්සේ ගවයාගෙන් කිරිද, කිරෙන් දීකිරිද, දීකිරෙන් වෙඬරුද, වෙඬරුවෙන් ගිතෙල්ද, ගිතෙලෙන් ගිතෙල් මණ්ඩිද, ඒ අතරින් අග්‍ර​ය යැයි කියනු ලැබේ ද; එසෙවම මහණෙනි, යම් භාවනා කරන්නෙක් සමාධියට පැමිණීමටද දක්ෂ​යෙක්ද, සමාධියේ පිහිටුවීමටද දක්ෂ​යෙක්ද, මේ සතර භාවනා කරන්නන් අතුරින් හේ අග්‍ර​ය, ශ්‍රේෂ්ඨ​ය, ප්‍ර​ධාන ය, උත්තම ය, ප්‍ර​වර ය යනුයි.’’",
      "paliTitle": "Samādhimūlakaṭhitisuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Stability Rooted in Concentration",
      "sinhalaTitle": "සමාධිමූලකඨිති සූත‍්‍රය"
    },
    {
      "number": 664,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ vuṭṭhānakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Tatiyaṃ.",
      "english": "Monks, these four are meditators. Which four?\n\nHere, monks, a certain meditator is skilled in entering concentration, but not skilled in emerging from concentration. Here again, monks, a certain meditator is skilled in emerging from concentration, but not skilled in entering concentration. Here again, monks, a certain meditator is neither skilled in entering concentration nor skilled in emerging from concentration. Here again, monks, a certain meditator is both skilled in entering concentration and skilled in emerging from concentration.\n\nAmong these, monks, the meditator who is both skilled in entering concentration and skilled in emerging from concentration, this one among these four meditators is the foremost, the best, the leader, the supreme, and the most excellent. Just as, monks, from a cow comes milk; from milk, curds; from curds, butter; from butter, ghee; and from ghee, the cream of ghee. Of these, the cream of ghee is declared the foremost, the best, the leader, the supreme, and the most excellent.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nමහණෙනි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද?\n\nමහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමේ දක්ෂයෙක් වෙයි, එහෙත් සමාධියෙන් නැගී සිටීමේ දක්ෂයෙක් නොවෙයි.\n\nමහණෙනි, මෙහි තවත් ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙන් නැගී සිටීමේ දක්ෂයෙක් වෙයි, එහෙත් සමාධියට සමවැදීමේ දක්ෂයෙක් නොවෙයි.\n\nමහණෙනි, මෙහි තවත් ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමේ දක්ෂයෙක්ද නොවෙයි, සමාධියෙන් නැගී සිටීමේ දක්ෂයෙක්ද නොවෙයි.\n\nමහණෙනි, මෙහි තවත් ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමේ දක්ෂයෙක්ද වෙයි, සමාධියෙන් නැගී සිටීමේ දක්ෂයෙක්ද වෙයි.\n\nමහණෙනි, ඒ අතුරින් යම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමේ දක්ෂයෙක්ද වෙයි, සමාධියෙන් නැගී සිටීමේ දක්ෂයෙක්ද වෙයිද, මේ සිව්වැදෑරුම් ධ්‍යාන කරන්නන් අතුරින් හේ අග්‍ර වෙයි, ශ්‍රේෂ්ඨ වෙයි, මූලික වෙයි, උත්තම වෙයි, ප්‍රවර වෙයි.\n\nමහණෙනි, යම්සේ ගවයාගෙන් කිරිද, කිරෙන් දීකිරිද, දීකිරෙන් මස්කඩද, මස්කඩයෙන් ගිතෙල්ද, ගිතෙලෙන් ගිතෙල් මණ්ඩයද වේද, ඒ සියල්ලන් අතුරින් ගිතෙල් මණ්ඩය අග්‍ර, ශ්‍රේෂ්ඨ, මූලික, උත්තම, ප්‍රවර වන්නේද, එපරිද්දෙන්ම මහණෙනි, යම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමේ දක්ෂයෙක්ද වෙයි, සමාධියෙන් නැගී සිටීමේ දක්ෂයෙක්ද වෙයිද, මේ සිව්වැදෑරුම් ධ්‍යාන කරන්නන් අතුරින් හේ අග්‍ර වෙයි, ශ්‍රේෂ්ඨ වෙයි, මූලික වෙයි, උත්තම වෙයි, ප්‍රවර වෙයි.",
      "paliTitle": "Samādhimūlakavuṭṭhānasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Arising Rooted in Concentration",
      "sinhalaTitle": "සමාධි මූලික වුට්ඨාන සූත්‍රය"
    },
    {
      "number": 665,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ kallitakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ kallitakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ kallitakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Catutthaṃ.",
      "english": "Mendicants, there are these four meditators. Which four?\n\nHere, mendicants, a certain meditator is skilled in attaining concentration, but not skilled in developing concentration.\n\nBut here, mendicants, a certain meditator is skilled in developing concentration, but not skilled in attaining concentration.\n\nBut here, mendicants, a certain meditator is neither skilled in attaining concentration nor skilled in developing concentration.\n\nBut here, mendicants, a certain meditator is both skilled in attaining concentration and skilled in developing concentration.\n\nAmong these, mendicants, the meditator who is both skilled in attaining concentration and skilled in developing concentration is the foremost, the best, the supreme, the highest, and the most excellent among these four meditators. Just as, mendicants, from a cow comes milk; from milk, curds; from curds, butter; from butter, ghee; and from ghee, the cream of ghee. Among these, the cream of ghee is declared to be the foremost, the best, the supreme, the highest, and the most excellent.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nමහණෙනි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙකි. කවරහුද ඒ සතර දෙනා? මහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශල වෙයි, එහෙත් සමාධිය වශීභාවයට පත් කිරීමෙහි දක්ෂ නොවෙයි. නමුත් මහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධිය වශීභාවයට පත් කිරීමෙහි දක්ෂ වෙයි, එහෙත් සමාධියෙහි සමාධි කුශල නොවෙයි. නමුත් මහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශලත් නොවෙයි, සමාධිය වශීභාවයට පත් කිරීමෙහි දක්ෂත් නොවෙයි. නමුත් මහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශලත් වෙයි, සමාධිය වශීභාවයට පත් කිරීමෙහි දක්ෂත් වෙයි. මහණෙනි, මේ සතර දෙනා අතුරින් යම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුශලත් වෙයි, සමාධිය වශීභාවයට පත් කිරීමෙහි දක්ෂත් වෙයි ද, මේ ධ්‍යාන කරන්නා මේ සතර ධ්‍යාන කරන්නන් අතුරින් අග්‍ර වෙයි, ශ්‍රේෂ්ඨ වෙයි, ප්‍රමුඛ වෙයි, උත්තම වෙයි, ප්‍රවර වෙයි. මහණෙනි, යම්සේ ගවයාගෙන් කිරිද, කිරෙන් මුදවපු කිරිද, මුදවපු කිරෙන් වෙඬරුද, වෙඬරුවලින් ගිතෙල්ද, ගිතෙලින් ගිතෙල් මඬද පහළ වේද, ඒ ගිතෙල් මඬ මේවා අතුරින් ප්‍රවර වන්නේය. ඒ ආකාරයෙන්ම මේ ධ්‍යාන කරන්නාද ප්‍රවර වෙයි.",
      "paliTitle": "Samādhimūlakakallitasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Perfection Rooted in Concentration",
      "sinhalaTitle": "සමාධිමූලික කල්ලිත සූත‍්‍රය"
    },
    {
      "number": 666,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ ārammaṇakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Pañcamaṃ.",
      "english": "“Monks, there are these four meditators. Which four? Here, monks, a certain meditator is skilled in the attainment of concentration, but not skilled in the objects of concentration. Again, monks, a certain meditator is skilled in the objects of concentration, but not skilled in the attainment of concentration. Again, monks, a certain meditator is neither skilled in the attainment of concentration nor skilled in the objects of concentration. Again, monks, a certain meditator is skilled both in the attainment of concentration and in the objects of concentration. Among these, monks, this meditator who is skilled both in the attainment of concentration and in the objects of concentration, is the foremost, the best, the chief, the supreme, and the most pre-eminent of these four meditators. Just as, monks, from a cow comes milk, from milk comes curds, from curds comes fresh butter, from fresh butter comes ghee, and from ghee comes the scum of ghee; among these, the scum of ghee is declared to be the foremost, the best, and the most pre-eminent. In the same way, monks, this meditator who is skilled both in the attainment of concentration and in the objects of concentration, is the foremost, the best, the chief, the supreme, and the most pre-eminent of these four meditators.”",
      "sinhala": "සැවැත් නුවරදීය.\n\nමහණෙනි, මේ ධ්‍යායීහු සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද? මහණෙනි, මෙහි ඇතැම් ධ්‍යායියෙක් සමාධිය දියුණු කිරීමට දක්ෂ වෙයි, එහෙත් සමාධියට ගන්නා ආරම්මණය පිළිබඳව දක්ෂ නොවේ. මහණෙනි, තවද මෙහි ඇතැම් ධ්‍යායියෙක් සමාධියට ගන්නා ආරම්මණය පිළිබඳව දක්ෂ වෙයි, එහෙත් සමාධිය දියුණු කිරීමට දක්ෂ නොවේ. මහණෙනි, තවද මෙහි ඇතැම් ධ්‍යායියෙක් සමාධිය දියුණු කිරීමටද දක්ෂ නොවෙයි, සමාධියට ගන්නා ආරම්මණය පිළිබඳවද දක්ෂ නොවෙයි. මහණෙනි, තවද මෙහි ඇතැම් ධ්‍යායියෙක් සමාධිය දියුණු කිරීමටද දක්ෂ වෙයි, සමාධියට ගන්නා ආරම්මණය පිළිබඳවද දක්ෂ වෙයි. මහණෙනි, ඒ සතර දෙනා අතුරින් යම් ධ්‍යායියෙක් සමාධිය දියුණු කිරීමටද දක්ෂ වෙයි, සමාධියට ගන්නා ආරම්මණය පිළිබඳවද දක්ෂ වෙයි නම්, මෙතෙම මේ සතර ධ්‍යායීන් අතුරෙන් අග්‍රය, ශ්‍රේෂ්ඨය, මුඛ්‍යය, උත්තමය, ප්‍රවරය වේ.\n\nමහණෙනි, යම්සේ ගවයාගෙන් කිරිද, කිරෙන් දීකිරද, දීකිරෙන් ගිතෙල් සාරයද, ගිතෙල් සාරයෙන් ගිතෙල්ද, ගිතෙලින් ගිතෙල් මෙලෙයද වේද, එය එහි අග්‍රය, ශ්‍රේෂ්ඨය, මුඛ්‍යය, උත්තමය, ප්‍රවරය වේද, එපරිද්දෙන්ම මහණෙනි, මේ ධ්‍යායියා මේ සතර ධ්‍යායීන් අතුරෙන් අග්‍රය, ශ්‍රේෂ්ඨය, මුඛ්‍යය, උත්තමය, ප්‍රවරය වේ.",
      "paliTitle": "Samādhimūlakaārammaṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Concentration-Based Objects",
      "sinhalaTitle": "සමාධි මූලික ආරම්මණ සූත්‍රය"
    },
    {
      "number": 667,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ gocarakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ gocarakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ gocarakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Chaṭṭhaṃ.",
      "english": "“Bhikkhus, there are these four types of meditators. Which four?\n\nHere, bhikkhus, one meditator is skilled in concentration itself, but not skilled in the domain of concentration. Here again, bhikkhus, one meditator is skilled in the domain of concentration, but not skilled in concentration itself. Here again, bhikkhus, one meditator is neither skilled in concentration itself nor skilled in the domain of concentration. Here again, bhikkhus, one meditator is skilled in concentration itself and also skilled in the domain of concentration.\n\nAmong these, bhikkhus, that meditator who is skilled in concentration itself and also skilled in the domain of concentration is the foremost, best, chief, supreme, and most excellent of these four meditators. Just as, bhikkhus, from a cow comes milk; from milk, curds; from curds, fresh butter; from fresh butter, ghee; and from ghee, the scum of ghee. Among these, the scum of ghee is declared to be the most excellent. In the same way, bhikkhus, that meditator who is skilled in concentration itself and also skilled in the domain of concentration is the foremost, best, chief, supreme, and most excellent of these four meditators.",
      "sinhala": "සැවැත්නුවරදීය.\n\nමහණෙනි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද?\n\nමහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුසල වෙයි. එහෙත් ඔහු සමාධියෙහි ගෝචර කුසල නොවේ.\n\nමහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි ගෝචර කුසල වෙයි. එහෙත් ඔහු සමාධියෙහි සමාධි කුසල නොවේ.\n\nමහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුසලද නොවේ, සමාධියෙහි ගෝචර කුසලද නොවේ.\n\nමහණෙනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුසලද වෙයි, සමාධියෙහි ගෝචර කුසලද වෙයි.\n\nමහණෙනි, යම් ධ්‍යාන කරන්නෙක් සමාධියෙහි සමාධි කුසලද වෙයි, සමාධියෙහි ගෝචර කුසලද වෙයිද, මේ සතර ධ්‍යාන කරන්නන් අතුරින් ඔහු අග්‍ර වෙයි, ශ්‍රේෂ්ඨ වෙයි, ප්‍රධාන වෙයි, උත්තම වෙයි, ප්‍රවර වෙයි.\n\nමහණෙනි, යම් සේ ගවයාගෙන් කිරි... (එයින් ලබාගන්නා සියලු දේටම වඩා කිරි තෙල් මඬ අග්‍ර වන්නා සේම) ඔහුද අග්‍ර වෙයි, ශ්‍රේෂ්ඨ වෙයි, ප්‍රධාන වෙයි, උත්තම වෙයි, ප්‍රවර වෙයි.",
      "paliTitle": "Samādhimūlakagocarasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on the Range Rooted in Concentration",
      "sinhalaTitle": "සමාධි මූලික ගෝචර සූත‍්‍රය"
    },
    {
      "number": 668,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ abhinīhārakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ abhinīhārakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Sattamaṃ.",
      "english": "At Sāvatthī.\nMonks, there are these four meditators. Which four?\nHere, monks, a certain meditator is skilled in entering and maintaining concentration, but not skilled in directing and emerging from concentration.\nBut here, monks, a certain meditator is skilled in directing and emerging from concentration, but not skilled in entering and maintaining concentration.\nBut here, monks, a certain meditator is neither skilled in entering and maintaining concentration, nor skilled in directing and emerging from concentration.\nBut here, monks, a certain meditator is both skilled in entering and maintaining concentration, and skilled in directing and emerging from concentration.\nAmong these, monks, that meditator who is both skilled in entering and maintaining concentration, and skilled in directing and emerging from concentration, is considered the foremost, the best, the chief, the supreme, and the most excellent of these four meditators. Just as, monks, from a cow, milk is produced, leading through a progression to that which is most excellent.",
      "sinhala": "සැවැත්නුවර දී දේශනා කරන ලදී. භික්ෂූනි, මේ ධ්‍යානලාභීහු සිව් දෙනෙකි. කවරහු ද ඒ සිව් දෙනා? භික්ෂූනි, මෙහිලා ඇතැම් ධ්‍යානලාභියෙක් සමාධියෙහි සමාධි කුශල වේ, එහෙත් සමාධියෙහි අභිනිහාර කුශල නොවේ. තවද භික්ෂූනි, ඇතැම් ධ්‍යානලාභියෙක් සමාධියෙහි අභිනිහාර කුශල වේ, එහෙත් සමාධියෙහි සමාධි කුශල නොවේ. තවද භික්ෂූනි, ඇතැම් ධ්‍යානලාභියෙක් සමාධියෙහි සමාධි කුශල ද නොවේ, සමාධියෙහි අභිනිහාර කුශල ද නොවේ. තවද භික්ෂූනි, ඇතැම් ධ්‍යානලාභියෙක් සමාධියෙහි සමාධි කුශල ද වේ, සමාධියෙහි අභිනිහාර කුශල ද වේ.\n\nභික්ෂූනි, ඒ සිව්දෙනා අතුරින් යම් ධ්‍යානලාභියෙක් සමාධියෙහි සමාධි කුශල ද වේ ද, සමාධියෙහි අභිනිහාර කුශල ද වේ ද, මේ සිව්වැදෑරුම් ධ්‍යානලාභීන් අතුරින් ඔහු අග්‍ර ද, ශ්‍රේෂ්ඨ ද, මෝක්ෂ ද, උත්තම ද, ප්‍රවර ද වේ. භික්ෂූනි, ගවයාගෙන් කිරි ලබාගන්නා කල්හි, ඉන් දී කිරි ද, ඉන් වෙඬරු ද, ඉන් ගිතෙල් ද, ඉන් ගිතෙල් මණ්ඩය ද ලැබේ. ඒ සියල්ලන් අතුරින් ගිතෙල් ප්‍රවර වන්නේ ය.",
      "paliTitle": "Samādhimūlakaabhinīhārasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Aspiration Rooted in Concentration",
      "sinhalaTitle": "සමාධි මූලික අභිනීහාර සූත්‍\\u200Dරය"
    },
    {
      "number": 669,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sakkaccakārī hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ sakkaccakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these four types of meditators. Which four?\n\nHere, monks, one meditator is skilled in concentration, but is not diligent in applying concentration. Here again, monks, one meditator is diligent in applying concentration, but is not skilled in concentration. Here again, monks, one meditator is neither skilled in concentration nor diligent in applying concentration. Here again, monks, one meditator is both skilled in concentration and diligent in applying concentration. Among these, monks, that meditator who is both skilled in concentration and diligent in applying concentration is, among these four meditators, the foremost, the best, the pre-eminent, the supreme, and the most excellent. Just as, monks, from a cow, there is milk; from milk, curd; from curd, butter; from butter, ghee; and from ghee, the scum of ghee — that is considered the most excellent.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\n\"මහණෙනි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙක් වෙති. කවර සතර දෙනෙක්ද?\n\nමහණෙනි, මෙහිලා ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි දක්ෂ වෙයි. එහෙත් ඔහු සමාධියෙහි ඕනෑකමින් ක්‍රියා කරන්නෙක් නොවේ. මහණෙනි, මෙහිලා ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි ඕනෑකමින් ක්‍රියා කරන්නෙක් වෙයි. එහෙත් ඔහු සමාධියෙහි දක්ෂ නොවේ. මහණෙනි, මෙහිලා ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි දක්ෂයෙක්ද නොවේ. සමාධියෙහි ඕනෑකමින් ක්‍රියා කරන්නෙක්ද නොවේ. මහණෙනි, මෙහිලා ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියෙහි දක්ෂයෙක්ද වෙයි, සමාධියෙහි ඕනෑකමින් ක්‍රියා කරන්නෙක්ද වෙයි.\n\nමහණෙනි, ඒ ධ්‍යාන කරන්නා යම් කෙනෙක් සමාධියෙහි දක්ෂයෙක්ද වෙයි, සමාධියෙහි ඕනෑකමින් ක්‍රියා කරන්නෙක්ද වෙයි, මේ සතර දෙනාගෙන් ඔහු අග්‍රය, ශ්‍රේෂ්ඨය, ප්‍රධාන වේ, උත්තමය, ප්‍රවරය. මහණෙනි, යම්සේ ගවයාගෙන් කිරිද, (එයින්) ...පෙ... ප්‍රවර වෙයි.\"\n\nඅටවැනි සූත්‍රයයි.",
      "paliTitle": "Samādhimūlakasakkaccakārīsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Diligent Practice Rooted in Concentration",
      "sinhalaTitle": "සමාධි මුල්කොටගත් සකච්ච කාරී සූත‍්‍රය"
    },
    {
      "number": 670,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sātaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sātaccakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Navamaṃ.",
      "english": "At Sāvatthī. \"Monks, there are these four meditators. Which four?\"\n\n\"Here, monks, a certain meditator is skilled in concentration, but is not one who practices it consistently.\"\n\n\"Here again, monks, a certain meditator is one who practices concentration consistently, but is not skilled in concentration.\"\n\n\"Here again, monks, a certain meditator is neither skilled in concentration nor one who practices it consistently.\"\n\n\"Here again, monks, a certain meditator is both skilled in concentration and one who practices it consistently.\"\n\n\"Among these, monks, the meditator who is both skilled in concentration and one who practices it consistently is the foremost, the best, the chief, the supreme, and the most excellent of these four meditators.\"\n\n\"Just as, monks, from a cow, milk, and so forth, is the most excellent.\"",
      "sinhala": "ශ්‍රා<U+200D>වස්තියේදී දේශනා කරන ලදී. මහණෙනි, මේ ධ්‍යානලාභීහු සතර දෙනෙක් වෙති. කවර සතර දෙනෙක්ද? මහණෙනි, මෙහි ඇතැම් ධ්‍යානලාභී කෙනෙක් සමාධියෙහි දක්‍ෂ වෙයි, එහෙත් සමාධියෙහි නිරතුරුව වඩන්නෙක් නොවේ. මහණෙනි, මෙහි ඇතැම් ධ්‍යානලාභී කෙනෙක් සමාධියෙහි නිරතුරුව වඩන්නෙක් වෙයි, එහෙත් සමාධියෙහි දක්‍ෂ නොවේ. මහණෙනි, මෙහි ඇතැම් ධ්‍යානලාභී කෙනෙක් සමාධියෙහි දක්‍ෂ ද නොවේ, සමාධියෙහි නිරතුරුව වඩන්නෙක් ද නොවේ. මහණෙනි, මෙහි ඇතැම් ධ්‍යානලාභී කෙනෙක් සමාධියෙහි දක්‍ෂ ද වෙයි, සමාධියෙහි නිරතුරුව වඩන්නෙක් ද වෙයි. මහණෙනි, මේ ධ්‍යානලාභීන් සතර දෙනා අතුරින් යම් මේ ධ්‍යානලාභී කෙනෙක් සමාධියෙහි දක්‍ෂ ද වෙයි, සමාධියෙහි නිරතුරුව වඩන්නෙක් ද වෙයි, ඔහු අග්‍ර වූ ද, ශ්‍රේෂ්ඨ වූ ද, මු<U+200D>ඛ්‍ය වූ ද, උත්තරීතර වූ ද, ප්‍ර<U+200D>වර වූ ද පුද්ගලයා වේ. මහණෙනි, යම් සේ ගවයාගෙන් කිරි... යනාදී වශයෙන්... ප්‍ර<U+200D>වර වේ ද, එසේම මේ ධ්‍යානලාභී පුද්ගලයා ද ප්‍ර<U+200D>වර වේ.",
      "paliTitle": "Samādhimūlakasātaccakārīsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Continuous Practice Based on Concentration",
      "sinhalaTitle": "සමාධි මූලික සාතත්‍ය කාරී සූත්‍රය"
    },
    {
      "number": 671,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ samādhikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samādhikusalo hoti, na ca samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samādhikusalo ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samādhikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Dasamaṃ. (Samādhimūlakaṃ.)",
      "english": "At Sāvatthī.\n\nBhikkhus, there are these four types of meditators. Which four? Here, bhikkhus, a certain meditator is skilled in concentration, but not one who practices what is conducive to concentration. Here again, bhikkhus, a certain meditator is one who practices what is conducive to concentration, but not skilled in concentration. Here again, bhikkhus, a certain meditator is neither skilled in concentration nor one who practices what is conducive to concentration. Here again, bhikkhus, a certain meditator is both skilled in concentration and one who practices what is conducive to concentration. Among these, bhikkhus, this meditator who is both skilled in concentration and one who practices what is conducive to concentration is the foremost, the best, the excellent, the supreme, and the most eminent among these four meditators. Just as, bhikkhus, from a cow comes milk, from milk comes curd, from curd comes butter, from butter comes ghee, and from ghee comes the finest essence of ghee, which is the foremost, the best, the excellent, the supreme, and the most eminent.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ සැවැත්නුවරදී මේ ධර්ම දේශනාව වදාළ සේක. \"මහණෙනි, මේ ධ්‍යානලාභීහු සතර දෙනෙක් වෙති. ඒ කවර සතර දෙනෙක්ද? මහණෙනි, මෙහි එක්තරා ධ්‍යානලාභියෙක් සමාධියෙහි සමථ භාවනාවෙහි දක්‍ෂයෙක් වෙයි. එහෙත් ඔහු සමාධියට අනුකූලව නොසිටියි. මහණෙනි, මෙහි තවත් එක්තරා ධ්‍යානලාභියෙක් සමාධියට අනුකූලව සිටියි. එහෙත් ඔහු සමාධියෙහි සමථ භාවනාවෙහි දක්‍ෂයෙක් නොවෙයි. මහණෙනි, මෙහි තවත් එක්තරා ධ්‍යානලාභියෙක් සමාධියෙහි සමථ භාවනාවෙහි දක්‍ෂයෙක්ද නොවෙයි, සමාධියට අනුකූලවද නොසිටියි. මහණෙනි, මෙහි තවත් එක්තරා ධ්‍යානලාභියෙක් සමාධියෙහි සමථ භාවනාවෙහි දක්‍ෂයෙක්ද වෙයි, සමාධියට අනුකූලවද සිටියි. මහණෙනි, මේ සතර දෙනා අතුරින් යම් මේ ධ්‍යානලාභියෙක් සමාධියෙහි සමථ භාවනාවෙහි දක්‍ෂයෙක්ද වෙයි, සමාධියට අනුකූලවද සිටියිද, ඒ ධ්‍යානලාභියා මේ සතර ධ්‍යානලාභීන් අතුරින් අග්‍රවූද, ශ්‍රේෂ්ඨවූද, ප්‍රධාන වූද, උත්තමවූද, ප්‍රවරවූද කෙනෙක් වන්නේය. මහණෙනි, යම්සේ ගවයාගෙන් කිරිද, කිරෙන් දීකිරද, දීකිරෙන් වෙඬරුද, වෙඬරුවෙන් ගිතෙල්ද, ගිතෙලෙන් ගිතෙල් සාරයද ඇතිවේද, මේවා අතරින් ගිතෙල් සාරය අග්‍රවූද, ශ්‍රේෂ්ඨවූද, ප්‍රධාන වූද, උත්තමවූද, ප්‍රවරවූද වන්නේය. එපරිද්දෙන්ම මේ ධ්‍යානලාභියාද අග්‍රවූද, ශ්‍රේෂ්ඨවූද, ප්‍රධාන වූද, උත්තමවූද, ප්‍රවරවූද කෙනෙක් වන්නේය.\"",
      "paliTitle": "Samādhimūlakasappāyakārīsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Conducive Practice Rooted in Concentration",
      "sinhalaTitle": "සමාධි මූලක සප්‍පාය කාරී සූත්‍රය"
    },
    {
      "number": 672,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ṭhitikusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ṭhitikusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ…pe… pavaro cā’’ti. Ekādasamaṃ.",
      "english": "Monks, there are these four meditators. Which four?\n\nHere, monks, one meditator is skilled in entering concentration, but not skilled in sustaining concentration. Here again, monks, one meditator is skilled in sustaining concentration, but not skilled in entering concentration. Here again, monks, one meditator is neither skilled in entering concentration nor skilled in sustaining concentration. Here again, monks, one meditator is skilled in entering concentration and also skilled in sustaining concentration.\n\nAmong these, monks, the meditator who is skilled in entering concentration and also skilled in sustaining concentration is, among these four meditators, the foremost, the best, the chief, the highest, and the most excellent. Just as, monks, from a cow, there is milk... and so on... the most excellent.",
      "sinhala": "‘‘මහණෙනි, මේ ධ්‍යාන වඩන යෝගීහු සිව් දෙනෙකි. ඒ සිව් දෙනා කවරහුද? මහණෙනි, මෙහිලා සමහර ධ්‍යාන වඩන යෝගියෙක් සමාධියට සමවැදීමේ දක්ෂයෙක් වේ, එහෙත් සමාධියෙහි පිහිටුවා තබා ගැනීමේ දක්ෂයෙක් නොවේ. මහණෙනි, තවද මෙහිලා සමහර ධ්‍යාන වඩන යෝගියෙක් සමාධියෙහි පිහිටුවා තබා ගැනීමේ දක්ෂයෙක් වේ, එහෙත් සමාධියට සමවැදීමේ දක්ෂයෙක් නොවේ. මහණෙනි, තවද මෙහිලා සමහර ධ්‍යාන වඩන යෝගියෙක් සමාධියට සමවැදීමේ දක්ෂයෙක්ද නොවේ, සමාධියෙහි පිහිටුවා තබා ගැනීමේ දක්ෂයෙක්ද නොවේ. මහණෙනි, තවද මෙහිලා සමහර ධ්‍යාන වඩන යෝගියෙක් සමාධියට සමවැදීමේද දක්ෂයෙක් වේ, සමාධියෙහි පිහිටුවා තබා ගැනීමේද දක්ෂයෙක් වේ. මහණෙනි, ඒ අතුරින් යම් ධ්‍යාන වඩන යෝගියෙක් සමාධියට සමවැදීමේද දක්ෂයෙක් වේද, සමාධියෙහි පිහිටුවා තබා ගැනීමේද දක්ෂයෙක් වේද, මේ ධ්‍යාන වඩන යෝගීහු සිව් දෙනා අතුරින් ඔහු අග්‍ර වූයේද වේ, ශ්‍රේෂ්ඨ වූයේද වේ, ප්‍රධාන වූයේද වේ, උත්තම වූයේද වේ, ප්‍රවර වූයේද වේ.\n\nමහණෙනි, යම්සේ ගවයාගෙන් කිරි ද, කිරෙන් දීකිරි ද, දීකිරෙන් වෙඬරු ද, වෙඬරුවෙන් ගිතෙල් ද, ගිතෙලින් ගිතෙල් සාරය ද වේද, ඒ ගිතෙල් සාරය ඒ සියල්ල අතර අග්‍ර වූයේ ද වේ, ශ්‍රේෂ්ඨ වූයේ ද වේ, ප්‍රධාන වූයේ ද වේ, උත්තම වූයේ ද වේ, ප්‍රවර වූයේ ද වේ.",
      "paliTitle": "Samāpattimūlakaṭhitisuttaṃ",
      "vagga": "",
      "englishTitle": "The Sutta on Abiding Rooted in Attainments",
      "sinhalaTitle": "සමාපත්ති මූලික ස්ථිති සූත්‍රය"
    },
    {
      "number": 673,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī …pe… pavaro cā’’ti. Dvādasamaṃ.",
      "english": "At Sāvatthī. Monks, these four are meditators. Which four? Here, monks, a certain meditator is skilled in entering concentration, but not skilled in emerging from concentration. Here, however, monks, a certain meditator is skilled in emerging from concentration, but not skilled in entering concentration. Here, however, monks, a certain meditator is neither skilled in entering concentration nor skilled in emerging from concentration. Here, however, monks, a certain meditator is skilled in both entering concentration and emerging from concentration. Among these, monks, this meditator who is skilled in both entering concentration and emerging from concentration is, among these four meditators, the chief, the best, the foremost, the highest, and the most excellent.",
      "sinhala": "ශ්‍රාවස්තියෙහිදී දේශනා කරන ලදී.\n\n“මහණෙනි, මේ භාවනා කරන්නෝ සතර දෙනෙක් වෙති. කවරහුද ඒ සතර දෙනා? මහණෙනි, මෙහිලා එක්තරා භාවනා කරන්නෙක් සමාධියට සමවැදීමට දක්ෂ වෙයි, නමුත් සමාධියෙන් නැගිටීමට දක්ෂ නොවෙයි. මහණෙනි, මෙහිලා එක්තරා භාවනා කරන්නෙක් සමාධියෙන් නැගිටීමට දක්ෂ වෙයි, නමුත් සමාධියට සමවැදීමට දක්ෂ නොවෙයි. මහණෙනි, මෙහිලා එක්තරා භාවනා කරන්නෙක් සමාධියට සමවැදීමටද දක්ෂ නොවෙයි, සමාධියෙන් නැගිටීමටද දක්ෂ නොවෙයි. මහණෙනි, මෙහිලා එක්තරා භාවනා කරන්නෙක් සමාධියට සමවැදීමටද දක්ෂ වෙයි, සමාධියෙන් නැගිටීමටද දක්ෂ වෙයි. මහණෙනි, මේ භාවනා කරන්නන් අතුරින් යම් භාවනා කරන්නෙක් සමාධියට සමවැදීමටද දක්ෂ වෙයිද, සමාධියෙන් නැගිටීමටද දක්ෂ වෙයිද, ඔහු මේ සතර දෙනා වූ භාවනා කරන්නන් අතුරින් අග්‍ර වූද, ශ්‍රේෂ්ඨ වූද, ප්‍රධාන වූද, උත්තම වූද, ප්‍රවර වූද තැනැත්තා වේ.”",
      "paliTitle": "Samāpattimūlakavuṭṭhānasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Emergence from Attainments",
      "sinhalaTitle": "සමාපත්ති මූලික වුට්ඨාන සූත්‍රය"
    },
    {
      "number": 674,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ kallitakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ kallitakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ kallitakusalo ca. Tatra…pe… pavaro cā’’ti. Terasamaṃ.",
      "english": "There are these four types of meditators, bhikkhus. Which four?\n\nHere, bhikkhus, one meditator is skillful in entering states of concentration, but not skillful in mastering states of concentration. Here, bhikkhus, another meditator is skillful in mastering states of concentration, but not skillful in entering states of concentration. Here, bhikkhus, another meditator is neither skillful in entering states of concentration nor skillful in mastering states of concentration. Here, bhikkhus, another meditator is both skillful in entering states of concentration and skillful in mastering states of concentration. Among these, the one who is both skillful in entering states of concentration and skillful in mastering states of concentration is the best, the foremost, the highest, the supreme, the most excellent.",
      "sinhala": "සැවැත්නුවරදීය. මහණෙනි, මේ ධ්‍යානලාභී පුද්ගලයෝ සතර දෙනෙක් වෙති. කවරහුද ඒ සතර දෙනා?\n\nමහණෙනි, මෙහි ඇතැම් ධ්‍යානලාභී භික්ෂුවක් සමාධියට සමවැදීමට දක්ෂය, එහෙත් සමාධිය මනා ලෙස පිහිටුවා ගැනීමට දක්ෂ නැත.\n\nමහණෙනි, මෙහි තවත් ඇතැම් ධ්‍යානලාභී භික්ෂුවක් සමාධිය මනා ලෙස පිහිටුවා ගැනීමට දක්ෂය, එහෙත් සමාධියට සමවැදීමට දක්ෂ නැත.\n\nමහණෙනි, මෙහි තවත් ඇතැම් ධ්‍යානලාභී භික්ෂුවක් සමාධියට සමවැදීමට ද දක්ෂ නැත, සමාධිය මනා ලෙස පිහිටුවා ගැනීමට ද දක්ෂ නැත.\n\nමහණෙනි, මෙහි තවත් ඇතැම් ධ්‍යානලාභී භික්ෂුවක් සමාධියට සමවැදීමට ද දක්ෂය, සමාධිය මනා ලෙස පිහිටුවා ගැනීමට ද දක්ෂය. මේ සතර දෙනා අතුරින්, යම් ධ්‍යානලාභී භික්ෂුවක් සමාධියට සමවැදීමට ද දක්ෂ වේ ද, සමාධිය මනා ලෙස පිහිටුවා ගැනීමට ද දක්ෂ වේ ද, හෙතෙම මේ ධ්‍යානලාභී පුද්ගලයන් අතරින් උසස්ම ද, ශ්‍රේෂ්ඨතම ද, ප්‍රධානතම ද, උත්තමතම ද, විශිෂ්ඨතම ද වන්නේ ය.",
      "paliTitle": "Samāpattimūlakakallitasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Attainment-Rooted Arrangement",
      "sinhalaTitle": "සමාපත්ති මුල් කොට සකස් කළ සූත්‍රය"
    },
    {
      "number": 675,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ ārammaṇakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra…pe… pavaro cā’’ti. Cuddasamaṃ.",
      "english": "Monks, there are these four meditators. Which four?\n\nHere, monks, a certain meditator is skilled in the attainment of concentration but not skilled in the object of concentration.\n\nBut here, monks, a certain meditator is skilled in the object of concentration but not skilled in the attainment of concentration.\n\nBut here, monks, a certain meditator is neither skilled in the attainment of concentration nor skilled in the object of concentration.\n\nBut here, monks, a certain meditator is skilled both in the attainment of concentration and in the object of concentration.\n\nAmong these, the meditator who is skilled both in the attainment of concentration and in the object of concentration is indeed the foremost.",
      "sinhala": "සැවැත්නුවරදීය.\n\nමහණෙනි, භාවනා කරන්නෝ මේ සිව් දෙනෙකි. ඒ සිව් දෙනා කවරහුද යත්:\n\nමහණෙනි, මේ ශාසනයෙහි එක්තරා භාවනා කරන්නෙක් සමාධියට සමවදීමෙහි දක්ෂ වෙයි, නමුත් සමාධියෙහි ආරම්මණය කෙරෙහි දක්ෂ නොවෙයි.\n\nනැවතද මහණෙනි, මේ ශාසනයෙහි එක්තරා භාවනා කරන්නෙක් සමාධියෙහි ආරම්මණය කෙරෙහි දක්ෂ වෙයි, නමුත් සමාධියට සමවදීමෙහි දක්ෂ නොවෙයි.\n\nනැවතද මහණෙනි, මේ ශාසනයෙහි එක්තරා භාවනා කරන්නෙක් සමාධියට සමවදීමෙහිද දක්ෂ නොවෙයි, සමාධියෙහි ආරම්මණය කෙරෙහිද දක්ෂ නොවෙයි.\n\nනැවතද මහණෙනි, මේ ශාසනයෙහි එක්තරා භාවනා කරන්නෙක් සමාධියට සමවදීමෙහිද දක්ෂ වෙයි, සමාධියෙහි ආරම්මණය කෙරෙහිද දක්ෂ වෙයි.\n\nමේ භාවනා කරන්නන් අතුරින්... ඔහු අතිශයින්ම උතුම් වෙයි.",
      "paliTitle": "Samāpattimūlakaārammaṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Objects Based on Attainment",
      "sinhalaTitle": "සමාපත‍්ති මූලක ආරම‍්මණ සූත‍්‍රය"
    },
    {
      "number": 676,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ gocarakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ gocarakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ gocarakusalo ca. Tatra…pe… pavaro cā’’ti. Pannarasamaṃ.",
      "english": "Monks, there are these four types of meditators. Which four?\n\nHere, monks, a certain meditator is skilled in entering concentration but not skilled in its range.\n\nHere again, monks, a certain meditator is skilled in the range of concentration but not skilled in entering concentration.\n\nHere again, monks, a certain meditator is neither skilled in entering concentration nor skilled in its range.\n\nHere again, monks, a certain meditator is skilled both in entering concentration and in its range.\n\nAmong these, monks, the meditator who is skilled both in entering concentration and in its range is declared to be the foremost, the best, the chief, the excellent, and the supreme among these four meditators.",
      "sinhala": "සැවැත් නුවරදීය.\n\nමහණෙනි, මේ ධ්‍යාන වඩන භික්ෂූහු සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද? මහණෙනි, මෙහිලා යම් භික්ෂුවක් සමාධියට සමවැදීමේ දක්ෂයෙක් වෙයි. එහෙත් සමාධියෙහි ගෝචර බවෙහි දක්ෂයෙක් නොවේ. මහණෙනි, තවද යම් භික්ෂුවක් සමාධියෙහි ගෝචර බවෙහි දක්ෂයෙක් වෙයි. එහෙත් සමාධියට සමවැදීමේ දක්ෂයෙක් නොවේ. මහණෙනි, තවද යම් භික්ෂුවක් සමාධියට සමවැදීමේ දක්ෂයෙක් ද නොවේ, සමාධියෙහි ගෝචර බවෙහි දක්ෂයෙක් ද නොවේ. මහණෙනි, තවද යම් භික්ෂුවක් සමාධියට සමවැදීමේ දක්ෂයෙක් ද වෙයි, සමාධියෙහි ගෝචර බවෙහි දක්ෂයෙක් ද වෙයි.\n\nමහණෙනි, ඒ භික්ෂූන් අතරින් යම් භික්ෂුවක් සමාධියට සමවැදීමේ දක්ෂයෙක් ද වෙයි, සමාධියෙහි ගෝචර බවෙහි දක්ෂයෙක් ද වෙයි ද, මේ සතර දෙනා වූ ධ්‍යාන වඩන භික්ෂූන් අතුරෙන් ඔහු අග්‍රය, ශ්‍රේෂ්ඨය, ප්‍රධාන ය, උත්තමය, ප්‍රවරය වේ.",
      "paliTitle": "Samāpattimūlakagocarasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on the Attainment-Based Domain",
      "sinhalaTitle": "සමාපත්ති මූලක ගෝචර සූත‍්‍රය"
    },
    {
      "number": 677,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ abhinīhārakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ abhinīhārakusalo ca. Tatra…pe… pavaro cā’’ti. Soḷasamaṃ.",
      "english": "At Sāvatthī.\n\nMonks, there are these four meditators. Which four? Here, monks, a certain meditator is skilled in entering concentration, but not skilled in sustaining and directing concentration. But here, monks, a certain meditator is skilled in sustaining and directing concentration, but not skilled in entering concentration. But here, monks, a certain meditator is neither skilled in entering concentration nor skilled in sustaining and directing concentration. But here, monks, a certain meditator is both skilled in entering concentration and skilled in sustaining and directing concentration. Among these, this one is pre-eminent, foremost, chief, highest, and best.",
      "sinhala": "සැවැත්නුවරදීය.\n\n“මහණෙනි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙක් වෙති. කවරහු ද ඒ සතර දෙනා?\n\nමහණෙනි, මෙලොව එක්තැන් වූ ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමට දක්ෂයෙකි, නමුත් සමාධිය අවශ්‍ය පරිදි උපදවා ගැනීමට හා පවත්වා ගැනීමට දක්ෂයෙක් නොවේ.\n\nමහණෙනි, තවද මෙලොව එක්තැන් වූ ධ්‍යාන කරන්නෙක් සමාධිය අවශ්‍ය පරිදි උපදවා ගැනීමට හා පවත්වා ගැනීමට දක්ෂයෙකි, නමුත් සමාධියට සමවැදීමට දක්ෂයෙක් නොවේ.\n\nමහණෙනි, තවද මෙලොව එක්තැන් වූ ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමට ද දක්ෂයෙක් නොවේ, සමාධිය අවශ්‍ය පරිදි උපදවා ගැනීමට හා පවත්වා ගැනීමට ද දක්ෂයෙක් නොවේ.\n\nමහණෙනි, තවද මෙලොව එක්තැන් වූ ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමට ද දක්ෂයෙකි, සමාධිය අවශ්‍ය පරිදි උපදවා ගැනීමට හා පවත්වා ගැනීමට ද දක්ෂයෙකි.\n\nමහණෙනි, මේ ධ්‍යාන කරන්නන් සතර දෙනා අතුරින්, මේ ධ්‍යාන කරන්නා අග්‍ර වූවෙක් ද, ශ්‍රේෂ්ඨ වූවෙක් ද, ප්‍රධාන වූවෙක් ද, උතුම් වූවෙක් ද, ප්‍රවර වූවෙක් ද වේ.”",
      "paliTitle": "Samāpattimūlakaabhinīhārasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Aspiration Based on Attainments",
      "sinhalaTitle": "සමාපත‍්ති මූලික අභිනීහාර සූත‍්‍රය"
    },
    {
      "number": 678,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sakkaccakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sakkaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra…pe… pavaro cā’’ti. Sattarasamaṃ.",
      "english": "Monks, there are these four types of meditators. Which four?\n\nHere, monks, one meditator is skilled in attaining absorption but is not diligent in practicing absorption. Here, monks, one meditator is diligent in practicing absorption but is not skilled in attaining absorption. Here, monks, one meditator is neither skilled in attaining absorption nor diligent in practicing absorption. Here, monks, one meditator is both skilled in attaining absorption and diligent in practicing absorption.\n\nAmong these, the meditator who is both skilled in attaining absorption and diligent in practicing absorption is considered the foremost and supreme.",
      "sinhala": "භික්‍ෂූනි, මේ ධ්‍යාන වඩන්නෝ සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද?\n\nභික්‍ෂූනි, මෙහිලා එක්තරා ධ්‍යාන වඩන්නෙක් සමාධියට සමවැදීමෙහි දක්‍ෂ වෙයි, එහෙත් සමාධියෙහි නොපසුබටව උත්සාහයෙන් කටයුතු කරන්නෙක් නොවේ.\n\nභික්‍ෂූනි, මෙහිලා තවත් එක්තරා ධ්‍යාන වඩන්නෙක් සමාධියෙහි නොපසුබටව උත්සාහයෙන් කටයුතු කරන්නෙක් වෙයි, එහෙත් සමාධියට සමවැදීමෙහි දක්‍ෂ නොවේ.\n\nභික්‍ෂූනි, මෙහිලා තවත් එක්තරා ධ්‍යාන වඩන්නෙක් සමාධියට සමවැදීමෙහි ද දක්‍ෂ නොවේ, සමාධියෙහි නොපසුබටව උත්සාහයෙන් කටයුතු කරන්නෙක් ද නොවේ.\n\nභික්‍ෂූනි, මෙහිලා තවත් එක්තරා ධ්‍යාන වඩන්නෙක් සමාධියට සමවැදීමෙහි ද දක්‍ෂ වෙයි, සමාධියෙහි නොපසුබටව උත්සාහයෙන් කටයුතු කරන්නෙක් ද වෙයි.\n\nභික්‍ෂූනි, මේ ධ්‍යාන වඩන්නන් අතුරින් යම් කෙනෙක් සමාධියට සමවැදීමෙහි ද දක්‍ෂ වන අතර, සමාධියෙහි නොපසුබටව උත්සාහයෙන් කටයුතු කරන්නෙක් ද වන්නේද, මේ සිව්දෙනා අතරින් ඔහුම අග්‍රය, ශ්‍රේෂ්ඨය, ප්‍රධානිය, උත්තමය, ප්‍රවරය වන්නේය.",
      "paliTitle": "Samāpattimūlakasakkaccasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Attainment-Based Earnest Inquiry",
      "sinhalaTitle": "සමාපත්ති ආශ්‍රිත සකච්‍ඡා සූත්‍රය"
    },
    {
      "number": 679,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ sātaccakārī ca. Tatra…pe… pavaro cā’’ti. Aṭṭhārasamaṃ.",
      "english": "At Sāvatthī.\n\nBhikkhus, there are these four meditators. Which four? Here, bhikkhus, a certain meditator is skilled in entering into meditative absorption, but is not consistent in practice in meditative concentration. Here, bhikkhus, a certain meditator is consistent in practice in meditative concentration, but is not skilled in entering into meditative absorption. Here, bhikkhus, a certain meditator is neither skilled in entering into meditative absorption nor consistent in practice in meditative concentration. Here, bhikkhus, a certain meditator is both skilled in entering into meditative absorption and consistent in practice in meditative concentration. Among these meditators, bhikkhus, the meditator who is both skilled in entering into meditative absorption and consistent in practice in meditative concentration is the foremost, the best, the chief, the highest, and the most excellent.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nභික්ෂූනි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙක් වෙති. කවරහුද ඒ සතර දෙනා? භික්ෂූනි, මේ ශාසනයෙහි සමහර ධ්‍යාන කරන්නෙකු සමාධියට පිවිසීමේ දක්ෂයෙක් වෙයි, එහෙත් සමාධියෙහි නොකඩවා නිරතවන්නෙක් නොවේ. භික්ෂූනි, මේ ශාසනයෙහි තවත් සමහර ධ්‍යාන කරන්නෙකු සමාධියෙහි නොකඩවා නිරතවන්නෙක් වෙයි, එහෙත් සමාධියට පිවිසීමේ දක්ෂයෙක් නොවේ. භික්ෂූනි, මේ ශාසනයෙහි තවත් සමහර ධ්‍යාන කරන්නෙකු සමාධියට පිවිසීමේ දක්ෂයෙක්ද නොවේ, සමාධියෙහි නොකඩවා නිරතවන්නෙක්ද නොවේ. භික්ෂූනි, මේ ශාසනයෙහි තවත් සමහර ධ්‍යාන කරන්නෙකු සමාධියට පිවිසීමේ දක්ෂයෙක්ද වෙයි, සමාධියෙහි නොකඩවා නිරතවන්නෙක්ද වෙයි. එහි, භික්ෂූනි, යම් ධ්‍යාන කරන්නෙකු සමාධියට පිවිසීමේ දක්ෂයෙක්ද වෙයි, සමාධියෙහි නොකඩවා නිරතවන්නෙක්ද වෙයිද, මේ සතර දෙනා අතුරින් ඔහු අග‍්‍රය, ශ්‍රේෂ්ඨය, ප්‍රධානිය, උත්තමය, ප්‍රවරය.",
      "paliTitle": "Samāpattimūlakasātaccasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Persistence Based on Attainment",
      "sinhalaTitle": "සමාපත්ති මූලික සාතත්‍ය සූත්‍රය"
    },
    {
      "number": 680,
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ samāpattikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ samāpattikusalo hoti, na ca samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ samāpattikusalo ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ samāpattikusalo ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Ekūnavīsatimaṃ. (Samāpattimūlakaṃ.)",
      "english": "Monks, these are four types of meditators. Which four? Here, monks, one meditator is skilled in entering and abiding in absorption, but is not one who acts appropriately in relation to absorption. Here, monks, another meditator is one who acts appropriately in relation to absorption, but is not skilled in entering and abiding in absorption. Here, monks, another meditator is neither skilled in entering and abiding in absorption nor one who acts appropriately in relation to absorption. Here, monks, another meditator is both skilled in entering and abiding in absorption and is one who acts appropriately in relation to absorption. Among these, monks, that meditator who is both skilled in entering and abiding in absorption and is one who acts appropriately in relation to absorption is, among these four meditators, the foremost, the best, the supreme, the highest, and the most excellent. Just as, monks, from a cow comes milk; from milk, curds; from curds, fresh butter; from fresh butter, ghee; and from ghee, the cream of ghee, which is declared to be the best of all; even so, monks, that meditator who is both skilled in entering and abiding in absorption and is one who acts appropriately in relation to absorption is, among these four meditators, the foremost, the best, the supreme, the highest, and the most excellent.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nභික්ෂූනි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙක් වෙති. කවරහුද ඒ සතර දෙනා? භික්ෂූනි, මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමට දක්ෂයෙක් වෙයි, එහෙත් සමාධියට සුදුසු දේ නොකරයි. භික්ෂූනි, එහෙත් මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියට සුදුසු දේ කරන්නෙක් වෙයි, එහෙත් සමාධියට සමවැදීමට දක්ෂයෙක් නොවෙයි. භික්ෂූනි, එහෙත් මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමට දක්ෂයෙක්ද නොවෙයි, සමාධියට සුදුසු දේ කරන්නෙක්ද නොවෙයි. භික්ෂූනි, එහෙත් මෙහි ඇතැම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමට ද දක්ෂයෙක් වෙයි, සමාධියට සුදුසු දේ කරන්නෙක් ද වෙයි. භික්ෂූනි, ඔවුන් අතුරින් යම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමට ද දක්ෂයෙක් වෙයි, සමාධියට සුදුසු දේ කරන්නෙක් ද වෙයි ද, මේ සතර ධ්‍යාන කරන්නන් අතුරින් ඔහු අග්‍ර ද, ශ්‍රේෂ්ඨ ද, ප්‍රධාන ද, උත්තම ද, ප්‍රවර ද වෙයි. භික්ෂූනි, යම් සේ ගවයාගෙන් කිරි ද, කිරෙන් මුදවපු කිරි ද, මුදවපු කිරෙන් වෙඬරු ද, වෙඬරුවෙන් ගිතෙල් ද, ගිතෙලින් ගිතෙල් සාරය ද වෙයි ද, එහි ගිතෙල් සාරය අග්‍ර යැයි කියනු ලැබේ. භික්ෂූනි, එපරිද්දෙන්ම යම් ධ්‍යාන කරන්නෙක් සමාධියට සමවැදීමට ද දක්ෂයෙක් වෙයි, සමාධියට සුදුසු දේ කරන්නෙක් ද වෙයි ද, මේ සතර ධ්‍යාන කරන්නන් අතුරින් ඔහු අග්‍ර ද, ශ්‍රේෂ්ඨ ද, ප්‍රධාන ද, උත්තම ද, ප්‍රවර ද වෙයි.",
      "paliTitle": "Samāpattimūlakasappāyakārīsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Attainment-Based Proper Conduct",
      "sinhalaTitle": "සමාපත්ති මූලික සප්පායකාරී සූත්‍රය"
    },
    {
      "number": 681,
      "numberRange": "681-688",
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ ṭhitikusalo hoti, na samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ ṭhitikusalo. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ ṭhitikusalo hoti, na ca samādhismiṃ vuṭṭhānakusalo. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ ṭhitikusalo ca hoti, samādhismiṃ vuṭṭhānakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Vīsatimaṃ. (Purimamūlakāni viya yāva sattavīsatimā ṭhitimūlakasappāyakārīsuttā aṭṭha suttāni pūretabbāni. Ṭhitimūlakaṃ.)",
      "english": "At Sāvatthī.\n\n\"Monks, there are these four meditators. Which four?\n\nHere, monks, a certain meditator is skilled in stabilizing concentration, but not skilled in emerging from concentration.\n\nHere again, monks, a certain meditator is skilled in emerging from concentration, but not skilled in stabilizing concentration.\n\nHere again, monks, a certain meditator is neither skilled in stabilizing concentration nor skilled in emerging from concentration.\n\nHere again, monks, a certain meditator is skilled in both stabilizing concentration and emerging from concentration.\n\nAmong these, monks, that meditator who is skilled in both stabilizing concentration and emerging from concentration is the supreme and excellent.\"",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n\nමහණෙනි, මේ ධ්‍යාන වඩන්නෝ සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද? මහණෙනි, මෙහිලා එක්තරා ධ්‍යාන වඩන්නෙක් සමාධියෙහි පිහිටීමට දක්ෂ වෙයි, එහෙත් සමාධියෙන් නැගී සිටීමට දක්ෂ නොවෙයි. මහණෙනි, මෙහිලා එක්තරා ධ්‍යාන වඩන්නෙක් සමාධියෙන් නැගී සිටීමට දක්ෂ වෙයි, එහෙත් සමාධියෙහි පිහිටීමට දක්ෂ නොවෙයි. මහණෙනි, මෙහිලා එක්තරා ධ්‍යාන වඩන්නෙක් සමාධියෙහි පිහිටීමටද දක්ෂ නොවෙයි, සමාධියෙන් නැගී සිටීමටද දක්ෂ නොවෙයි. මහණෙනි, මෙහිලා එක්තරා ධ්‍යාන වඩන්නෙක් සමාධියෙහි පිහිටීමටද දක්ෂ වෙයි, සමාධියෙන් නැගී සිටීමටද දක්ෂ වෙයි. මහණෙනි, මේ ධ්‍යාන වඩන්නන් අතුරින් යම් ධ්‍යාන වඩන්නෙක් සමාධියෙහි පිහිටීමටද දක්ෂ වෙයි, සමාධියෙන් නැගී සිටීමටද දක්ෂ වෙයිද, ඔහු මේ සිව් ධ්‍යාන වඩන්නන් අතුරින් උත්තම වේ, ප්‍රවර වේ.",
      "paliTitle": "Ṭhitimūlakavuṭṭhānasuttādiaṭṭhakaṃ",
      "vagga": "",
      "englishTitle": "The Octad beginning with the Discourse on Stable Emergence",
      "sinhalaTitle": "ඨිතිමූලකවුට්ඨාන සූත්‍රය ආදී අෂ්ටකය"
    },
    {
      "number": 689,
      "numberRange": "689-695",
      "pali": "Sāvatthinidānaṃ. ‘‘Cattārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ vuṭṭhānakusalo hoti, na samādhismiṃ kallitakusalo… samādhismiṃ kallitakusalo hoti, na samādhismiṃ vuṭṭhānakusalo… neva samādhismiṃ vuṭṭhānakusalo hoti, na ca samādhismiṃ kallitakusalo… samādhismiṃ vuṭṭhānakusalo ca hoti samādhismiṃ kallitakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Aṭṭhavīsatimaṃ. (Purimamūlakāni viya yāva catuttiṃsatimā vuṭṭhānamūlakasappāyakārīsuttā satta suttāni pūretabbāni. Vuṭṭhānamūlakaṃ.)",
      "english": "Monks, there are these four types of meditators. Which four?\n\nHere, monks, a certain meditator is skilled in emerging from concentration, but not skilled in the establishment of concentration. Here, monks, a certain meditator is skilled in the establishment of concentration, but not skilled in emerging from concentration. Here, monks, a certain meditator is neither skilled in emerging from concentration nor skilled in the establishment of concentration. Here, monks, a certain meditator is both skilled in emerging from concentration and skilled in the establishment of concentration. Among these, monks, that meditator who is both skilled in emerging from concentration and skilled in the establishment of concentration is supreme and excellent.",
      "sinhala": "සැවැත් නුවරදීයි.\n\n“මහණෙනි, මේ ධ්‍යානලාභීහු සතර දෙනෙක් වෙති. කවරහුද ඒ සතර දෙනා?”\n\n“මහණෙනි, මෙහි ඇතැම් ධ්‍යානලාභී පුග්ගලයෙක් සමාධියෙන් නිවැරදිව නැඟී සිටීමට දක්‍ෂයෙකි, එහෙත් සමාධියට සමවීමට දක්‍ෂ නොවේ. ඇතැම් ධ්‍යානලාභී පුග්ගලයෙක් සමාධියට සමවීමට දක්‍ෂයෙකි, එහෙත් සමාධියෙන් නිවැරදිව නැඟී සිටීමට දක්‍ෂ නොවේ. ඇතැම් ධ්‍යානලාභී පුග්ගලයෙක් සමාධියෙන් නිවැරදිව නැඟී සිටීමටද දක්‍ෂ නොවේ, සමාධියට සමවීමටද දක්‍ෂ නොවේ. ඇතැම් ධ්‍යානලාභී පුග්ගලයෙක් සමාධියෙන් නිවැරදිව නැඟී සිටීමටද දක්‍ෂයෙකි, සමාධියට සමවීමටද දක්‍ෂයෙකි.”\n\n“මහණෙනි, මේ අතුරින් යම් ධ්‍යානලාභී පුග්ගලයෙක් සමාධියෙන් නිවැරදිව නැඟී සිටීමටද දක්‍ෂයෙක් වෙයිද, සමාධියට සමවීමටද දක්‍ෂයෙක් වෙයිද, හෙතෙම උත්තම වූද, ප්‍රවර වූද ධ්‍යානලාභියා වෙයි.”",
      "paliTitle": "Vuṭṭhānamūlakakallitasuttādisattakaṃ",
      "vagga": "",
      "englishTitle": "The Heptad beginning with the Vuṭṭhānamūlakakallita Sutta",
      "sinhalaTitle": "වුට්ඨානමූලකකල්ලිත සූත්‍රාදි සප්තකය"
    },
    {
      "number": 696,
      "numberRange": "696-701",
      "pali": "Sāvatthinidānaṃ … ‘‘samādhismiṃ kallitakusalo hoti, na samādhismiṃ ārammaṇakusalo… samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ kallitakusalo… neva samādhismiṃ kallitakusalo hoti, na ca samādhismiṃ ārammaṇakusalo… samādhismiṃ kallitakusalo ca hoti, samādhismiṃ ārammaṇakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Pañcatiṃsatimaṃ. (Purimamūlakāni viya yāva cattālīsamā kallitamūlakasappāyakārīsuttā cha suttāni pūretabbāni. Kallitamūlakaṃ.)",
      "english": "One is skilled in the development of concentration but not skilled in its object. One is skilled in the object of concentration but not skilled in its development. One is neither skilled in the development of concentration nor skilled in its object. One is skilled in both the development of concentration and its object. Among these, monks, this meditator is the best, the foremost, the chief, the highest, and the most excellent; this one is supreme and distinguished.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n\nමහණෙනි, මෙහි යම් ධ්‍යාන කරන්නෙක් සමාධිය ප්‍රගුණ කිරීමෙහි දක්ෂයෙක් වේ, එහෙත් සමාධි අරමුණ මැනවින් අවබෝධ කරගැනීමෙහි දක්ෂයෙක් නොවේ.\nමහණෙනි, මෙහි යම් ධ්‍යාන කරන්නෙක් සමාධි අරමුණ මැනවින් අවබෝධ කරගැනීමෙහි දක්ෂයෙක් වේ, එහෙත් සමාධිය ප්‍රගුණ කිරීමෙහි දක්ෂයෙක් නොවේ.\nමහණෙනි, මෙහි යම් ධ්‍යාන කරන්නෙක් සමාධිය ප්‍රගුණ කිරීමෙහිද දක්ෂයෙක් නොවේ, සමාධි අරමුණ මැනවින් අවබෝධ කරගැනීමෙහිද දක්ෂයෙක් නොවේ.\nමහණෙනි, මෙහි යම් ධ්‍යාන කරන්නෙක් සමාධිය ප්‍රගුණ කිරීමෙහිද දක්ෂයෙක් වේ, සමාධි අරමුණ මැනවින් අවබෝධ කරගැනීමෙහිද දක්ෂයෙක් වේ.\n\nමහණෙනි, මෙහි යම් ධ්‍යාන කරන්නෙක් සමාධිය ප්‍රගුණ කිරීමෙහිද දක්ෂයෙක් වේද, සමාධි අරමුණ මැනවින් අවබෝධ කරගැනීමෙහිද දක්ෂයෙක් වේද, මේ සතර ආකාර ධ්‍යාන කරන්නන් අතුරින් මේ ධ්‍යාන කරන්නා අග්‍ර වෙයි, ශ්‍රේෂ්ඨ වෙයි, ප්‍රධාන වෙයි, උත්තම වෙයි, ප්‍රවර වෙයි.",
      "paliTitle": "Kallitamūlakaārammaṇasuttādichakkaṃ",
      "vagga": "",
      "englishTitle": "The Hexad of Discourses on Objects with a Prepared Basis",
      "sinhalaTitle": "සැකමුල් ආරම්මණ සූත්‍‌රාදි ඡක්කය"
    },
    {
      "number": 702,
      "numberRange": "702-706",
      "pali": "Sāvatthinidānaṃ … ‘‘samādhismiṃ ārammaṇakusalo hoti, na samādhismiṃ gocarakusalo… samādhismiṃ gocarakusalo hoti, na samādhismiṃ ārammaṇakusalo… neva samādhismiṃ ārammaṇakusalo hoti, na ca samādhismiṃ gocarakusalo… samādhismiṃ ārammaṇakusalo ca hoti, samādhismiṃ gocarakusalo ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Ekacattālīsamaṃ. (Purimamūlakāni viya yāva pañcacattālīsamā ārammaṇamūlakasappāyakārīsuttā pañca suttāni pūretabbāni. Ārammaṇamūlakaṃ.)",
      "english": "One is skilled in the object of concentration, but not skilled in the domain of concentration. One is skilled in the domain of concentration, but not skilled in the object of concentration. One is neither skilled in the object of concentration nor skilled in the domain of concentration. One is skilled in both the object of concentration and the domain of concentration.\n\nAmong these, monks, the meditator who is skilled in both the object of concentration and the domain of concentration is the best and most excellent.",
      "sinhala": "මහණෙනි, යමෙක් සමාධියෙහි අරමුණ පිළිබඳ දක්ෂ වේ ද, එහෙත් සමාධියෙහි ගෝචරය පිළිබඳ දක්ෂ නොවේ ද; යමෙක් සමාධියෙහි ගෝචරය පිළිබඳ දක්ෂ වේ ද, එහෙත් සමාධියෙහි අරමුණ පිළිබඳ දක්ෂ නොවේ ද; යමෙක් සමාධියෙහි අරමුණ පිළිබඳ ද දක්ෂ නොවේ ද, සමාධියෙහි ගෝචරය පිළිබඳ ද දක්ෂ නොවේ ද; යමෙක් සමාධියෙහි අරමුණ පිළිබඳ ද දක්ෂ වේ ද, සමාධියෙහි ගෝචරය පිළිබඳ ද දක්ෂ වේ ද යනුවෙන් භික්ෂූන් සිටිති. මහණෙනි, මේ භික්ෂූන් අතරින් සමාධියෙහි අරමුණ පිළිබඳ ද දක්ෂ වූ, සමාධියෙහි ගෝචරය පිළිබඳ ද දක්ෂ වූ යම් භික්ෂූන් වහන්සේ කෙනෙක් වේ ද, ඒ භික්ෂූන් වහන්සේ උතුම් ම වූ ද, ප්‍රණීත ම වූ ද කෙනෙක් වෙති.",
      "paliTitle": "Ārammaṇamūlakagocarasuttādipañcakaṃ",
      "vagga": "",
      "englishTitle": "The Pentad Beginning with the Discourse on Object-Based Domain",
      "sinhalaTitle": "ආරම්මණමූලක ගෝචර සූත‍්‍රාදි පඤ‍්චකය"
    },
    {
      "number": 707,
      "pali": "Sāvatthinidānaṃ… ‘‘samādhismiṃ gocarakusalo hoti, na samādhismiṃ abhinīhārakusalo… samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ gocarakusalo… neva samādhismiṃ gocarakusalo hoti, na ca samādhismiṃ abhinīhārakusalo… samādhismiṃ gocarakusalo ca hoti, samādhismiṃ abhinīhārakusalo ca… seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ gocarakusalo ca hoti samādhismiṃ abhinīhārakusalo ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ…pe… uttamo ca pavaro cā’’ti. Chacattālīsamaṃ.",
      "english": "One is skilled regarding the meditative object of concentration, but not skilled regarding its application. One is skilled regarding the application of concentration, but not skilled regarding its meditative object. One is neither skilled regarding the meditative object of concentration nor skilled regarding its application. One is both skilled regarding the meditative object of concentration and skilled regarding its application.\n\nJust as, monastics, from a cow, milk is obtained; from milk, curds; from curds, fresh butter; from fresh butter, ghee; and from ghee, the cream of ghee is declared to be the foremost among them.\n\nIn the same way, monastics, that meditator who is both skilled regarding the meditative object of concentration and skilled regarding its application — among these four types of meditators, he is indeed the supreme and most excellent.",
      "sinhala": "යම් පුද්ගලයෙක් සමාධියෙහි ගෝචර කුසල වේ ද, එහෙත් සමාධියෙහි අභිනීහාර කුසල නොවේ ද; යම් පුද්ගලයෙක් සමාධියෙහි අභිනීහාර කුසල වේ ද, එහෙත් සමාධියෙහි ගෝචර කුසල නොවේ ද; යම් පුද්ගලයෙක් සමාධියෙහි ගෝචර කුසලත් නො වේ ද, සමාධියෙහි අභිනීහාර කුසලත් නො වේ ද; යම් පුද්ගලයෙක් සමාධියෙහි ගෝචර කුසලත් වේ ද, සමාධියෙහි අභිනීහාර කුසලත් වේ ද;\n\nමහණෙනි, යම් සේ ගවයාගෙන් ක්‍ෂීරය (කිරි) ලැබේ ද, ක්‍ෂීරයෙන් දධි (දෙහිකිරි) ලැබේ ද, දධියෙන් නවනීතය (නැවුම් බටර්) ලැබේ ද, නව නීතයෙන් සර්පි (ගිතෙල්) ලැබේ ද, සර්පියෙන් සර්පිමණ්ඩය (ගිතෙල්වල සාරය/කටු) ලැබේ ද, එහි අග්‍ර යැයි කියනු ලැබේ ද; එසෙව ම මහණෙනි, යම් මේ ධ්‍යාන කරන්නා සමාධියෙහි ගෝචර කුසලත් වේ ද, සමාධියෙහි අභිනීහාර කුසලත් වේ ද, මේ සතර ආකාර ධ්‍යාන කරන්නන් අතුරින්, මේ තැනැත්තා උතුම් ද ප්‍රවර ද වෙයි.",
      "paliTitle": "Gocaramūlakaabhinīhārasuttādicatukkaṃ",
      "vagga": "",
      "englishTitle": "The Tetrad of Discourses on Range-Based Aspiration",
      "sinhalaTitle": "ගෝචරමූලක අභිනීහාර සූත්‍ර‍ාදි චතුෂ්‌කය"
    },
    {
      "number": 708,
      "pali": "Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sakkaccakārī…pe…. Vitthāretabbaṃ. Sattacattālīsamaṃ.",
      "english": "He is adept concerning the domain of concentration, but he is not diligent in concentration, and so forth. This is to be elaborated.",
      "sinhala": "ඔහු සමාධියේ ගෝචරයෙහි දක්ෂ වෙයි, එහෙත් සමාධියෙහි නොපසුබට උත්සාහයෙන් හා සැලකිල්ලෙන් කටයුතු නොකරයි. ... එය විස්තාරණය කළ යුතුය.",
      "paliTitle": "",
      "vagga": ""
    },
    {
      "number": 709,
      "pali": "Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sātaccakārī…pe…. Aṭṭhacattālīsamaṃ.",
      "english": "One is skilled in the sphere of concentration, yet one is not a continuous practitioner of concentration.",
      "sinhala": "සමාධියෙහි ගෝචරකුශල වුවද, ඔහු සමාධියෙහි සතත ක‍්‍රියාවෙහි යෙදෙන්නෙක් නොවේ. හතළිස් අටවැනිය.",
      "paliTitle": "",
      "vagga": ""
    },
    {
      "number": 710,
      "pali": "Samādhismiṃ gocarakusalo hoti, na samādhismiṃ sappāyakārī…pe…. Ekūnapaññāsamaṃ. (Gocaramūlakaṃ.)",
      "english": "He is skilled in discerning the proper domain of practice for concentration, but he does not act in a way that truly conduces to concentration.",
      "sinhala": "සමාධියෙහි ගෝචරයෙහි දක්ෂයෙකු වේ; එහෙත්, සමාධියට හිතකර ක‍්‍රියා කරන්නෙකු නොවේ.",
      "paliTitle": "",
      "vagga": ""
    },
    {
      "number": 711,
      "pali": "Sāvatthinidānaṃ … ‘‘samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ sakkaccakārī… samādhismiṃ sakkaccakārī hoti, na samādhismiṃ abhinīhārakusalo… neva samādhismiṃ abhinīhārakusalo hoti, na ca samādhismiṃ sakkaccakārī… samādhismiṃ abhinīhārakusalo ca hoti, samādhismiṃ sakkaccakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī…pe… uttamo ca pavaro cā’’ti. Paññāsamaṃ.",
      "english": "There are those who are skilled in applying themselves to concentration but not diligent in concentration. There are those who are diligent in concentration but not skilled in applying themselves to concentration. There are those who are neither skilled in applying themselves to concentration nor diligent in concentration. And there are those who are both skilled in applying themselves to concentration and diligent in concentration. Among these, monastics, that meditator who is both skilled in applying themselves to concentration and diligent in concentration is the highest and most excellent.",
      "sinhala": "මහණෙනි, මේ ලෝකයේ සමහරු සමාධිය ඇති කර ගැනීමට දක්ෂ වෙති, එහෙත් සමාධිය නොපසුබටව පුහුණු කරන්නේ නැත. සමහරු සමාධිය නොපසුබටව පුහුණු කරති, එහෙත් එය ඇති කර ගැනීමට දක්ෂ නැත. සමහරු සමාධිය ඇති කර ගැනීමට දක්ෂ වන්නේද නැත, නොපසුබටව පුහුණු කරන්නේද නැත. තවත් සමහරු සමාධිය ඇති කර ගැනීමටද දක්ෂ වෙති, නොපසුබටව පුහුණු කරන්නේද වෙති. මහණෙනි, මේ ධ්‍යාන කරන්නන් අතුරෙන්, යම් කෙනෙක් සමාධිය ඇති කර ගැනීමට දක්ෂද, සමාධිය නොපසුබටව පුහුණු කරන්නේද වේද, ඒ ධ්‍යාන කරන්නා අග්‍රද, ප්‍රධානද වෙයි.",
      "paliTitle": "Abhinīhāramūlakasakkaccasuttāditikaṃ",
      "vagga": "",
      "englishTitle": "The Triad beginning with the Aspiration-rooted Sakkacca Sutta",
      "sinhalaTitle": "අභිනීහාර මූලක සක්කච්ච සූත්‍‌රාදි ත්‍රිකය"
    },
    {
      "number": 712,
      "pali": "Samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ sātaccakārī…pe…. Ekapaññāsamaṃ.",
      "english": "He is skilled in the initial application of meditative absorption, but not in its sustained practice, and so forth. The fifty-first.",
      "sinhala": "සමාධියෙහි අභිනීහාරයට දක්‍ෂ වේ, එහෙත් සමාධියෙහි නොකඩවා ක්‍රියා කරන්නෙක් නොවේ…පෙ…. මෙය පනස් එක් වැන්න යි.",
      "paliTitle": "",
      "vagga": ""
    },
    {
      "number": 713,
      "pali": "Samādhismiṃ abhinīhārakusalo hoti, na samādhismiṃ sappāyakārī…pe…. Dvepaññāsamaṃ. (Abhinīhāramūlakaṃ.)",
      "english": "He is skillful in applying his mind to concentration, but not in practicing what is conducive to concentration.",
      "sinhala": "සමාධිය උපදවා ගැනීමෙහි දක්ෂයෙකි, එහෙත් සමාධියට හිතකර අයුරින් ක‍්‍රියා කරන්නෙක් නොවේ.\n\nපනස් දෙවැන්නයි.\n(අභිනීහාර මූලකයි.)",
      "paliTitle": "",
      "vagga": ""
    },
    {
      "number": 714,
      "pali": "Sāvatthinidānaṃ … ‘‘samādhismiṃ sakkaccakārī hoti, na samādhismiṃ sātaccakārī… samādhismiṃ sātaccakārī hoti, na samādhismiṃ sakkaccakārī … neva samādhismiṃ sakkaccakārī hoti, na ca samādhismiṃ sātaccakārī… samādhismiṃ sakkaccakārī ca hoti, samādhismiṃ sātaccakārī ca. Tatra, bhikkhave, yvāyaṃ…pe… uttamo ca pavaro cā’’ti. Tepaññāsamaṃ.",
      "english": "At Sāvatthī… One is one who practices concentration earnestly, but not steadfastly. One is one who practices concentration steadfastly, but not earnestly. One is neither one who practices concentration earnestly nor steadfastly. One is one who practices concentration both earnestly and steadfastly. Among these, bhikkhus, this one is supreme and excellent.",
      "sinhala": "සැවැත් නුවරදී: යමෙක් සමාධියෙහි ගෞරවයෙන් හා උත්සාහයෙන් යුතුව ක‍්‍රියා කරයි, එහෙත් නොකඩවා ක‍්‍රියා නොකරයි; යමෙක් සමාධියෙහි නොකඩවා ක‍්‍රියා කරයි, එහෙත් ගෞරවයෙන් හා උත්සාහයෙන් යුතුව ක‍්‍රියා නොකරයි; යමෙක් සමාධියෙහි ගෞරවයෙන් හා උත්සාහයෙන් යුතුව ද ක‍්‍රියා නොකරයි, නොකඩවා ද ක‍්‍රියා නොකරයි; යමෙක් සමාධියෙහි ගෞරවයෙන් හා උත්සාහයෙන් යුතුව ද ක‍්‍රියා කරයි, නොකඩවා ද ක‍්‍රියා කරයි. මහණෙනි, ඒ අතුරින් යම් පුද්ගලයෙක් සමාධියෙහි ගෞරවයෙන් හා උත්සාහයෙන් යුතුව ද ක‍්‍රියා කරයි ද, නොකඩවා ද ක‍්‍රියා කරයි ද, ඒ පුද්ගලයාම උතුම් ද, ප‍්‍රණීත ද වන්නේය.",
      "paliTitle": "Sakkaccamūlakasātaccakārīsuttādidukaṃ",
      "vagga": "",
      "englishTitle": "The Pair beginning with Diligent Persistence",
      "sinhalaTitle": "සැකැසිල්ල මුල්කරගත් නොකඩවා කරන සූත්‍රය ආදි ද්විකය"
    },
    {
      "number": 715,
      "pali": "Samādhismiṃ sakkaccakārī hoti, na samādhismiṃ sappāyakārī…pe…. Catupaññāsamaṃ.",
      "english": "He is one who applies himself with diligence and thoroughness in meditative absorption, not one who applies himself merely according to what is convenient or agreeable.",
      "sinhala": "තෙම සමාධියෙහි නොපසුබටව, අවංකව හා ගෞරවාන්විතව කටයුතු කරන්නෙක් වේ. එහෙත් ඔහු සමාධියෙහි හිතකර හෝ සුදුසු ආකාරයෙන් කටයුතු කරන්නෙක් නොවේ...",
      "paliTitle": "",
      "vagga": ""
    },
    {
      "number": 716,
      "pali": "Sāvatthinidānaṃ. ‘‘Catārome, bhikkhave, jhāyī. Katame cattāro? Idha, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī hoti, na samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sappāyakārī hoti, na samādhismiṃ sātaccakārī. Idha pana, bhikkhave, ekacco jhāyī neva samādhismiṃ sātaccakārī hoti, na ca samādhismiṃ sappāyakārī. Idha pana, bhikkhave, ekacco jhāyī samādhismiṃ sātaccakārī ca hoti, samādhismiṃ sappāyakārī ca. Tatra, bhikkhave, yvāyaṃ jhāyī samādhismiṃ sātaccakārī ca hoti samādhismiṃ sappāyakārī ca ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro ca. Seyyathāpi, bhikkhave, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo tatra aggamakkhāyati; evameva kho, bhikkhave, yvāyaṃ jhāyī samādhismiṃ sātaccakārī ca hoti, samādhismiṃ sappāyakārī ayaṃ imesaṃ catunnaṃ jhāyīnaṃ aggo ca seṭṭho ca mokkho ca uttamo ca pavaro cā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Pañcapaññāsamaṃ. (Yathā pañcapaññāsaṃ veyyākaraṇāni honti tathā vitthāretabbāni.) ",
      "english": "\"Monks, there are these four types of meditators. Which four?\n\nHere, monks, one meditator is a continuous practitioner of concentration, but not an appropriate practitioner of concentration. Here again, monks, one meditator is an appropriate practitioner of concentration, but not a continuous practitioner of concentration. Here again, monks, one meditator is neither a continuous practitioner of concentration nor an appropriate practitioner of concentration. Here again, monks, one meditator is both a continuous practitioner of concentration and an appropriate practitioner of concentration. Among these, monks, the meditator who is both a continuous practitioner of concentration and an appropriate practitioner of concentration is the foremost, the best, the supreme, the highest, and the most excellent among these four meditators. Just as, monks, from a cow comes milk, from milk comes curds, from curds comes fresh butter, from fresh butter comes ghee, and from ghee comes the very essence of ghee, which is declared to be the best; just so, monks, the meditator who is both a continuous practitioner of concentration and an appropriate practitioner of concentration is the foremost, the best, the supreme, the highest, and the most excellent among these four meditators.\n\nThe Blessed One spoke this. Delighted, those monks rejoiced in the Blessed One's words.",
      "sinhala": "සැවැත් නුවරදී. භික්ෂූණි, මේ ධ්‍යාන කරන්නෝ සතර දෙනෙක් වෙති. ඒ සතර දෙනා කවරහුද?\n\nභික්ෂූණි, මෙහිලා එක්තරා ධ්‍යාන කරන්නෙක් සමාධිය නිරන්තරයෙන් පුරුදු කරනසුලු වේ, එහෙත් සමාධියට අනුකූලව නොහැසිරේ.\n\nභික්ෂූණි, මෙහිලා තවත් එක් ධ්‍යාන කරන්නෙක් සමාධියට අනුකූලව හැසිරෙනසුලු වේ, එහෙත් සමාධිය නිරන්තරයෙන් පුරුදු නොකරයි.\n\nභික්ෂූණි, මෙහිලා තවත් එක් ධ්‍යාන කරන්නෙක් සමාධිය නිරන්තරයෙන් පුරුදු නොකරනසුලු වේ, සමාධියට අනුකූලවද නොහැසිරෙනසුලු වේ.\n\nභික්ෂූණි, මෙහිලා තවත් එක් ධ්‍යාන කරන්නෙක් සමාධිය නිරන්තරයෙන් පුරුදු කරනසුලු වේද, සමාධියට අනුකූලවද හැසිරෙනසුලු වේ.\n\nභික්ෂූණි, මෙකී ධ්‍යාන කරන්නන් අතුරින්, යම් ධ්‍යාන කරන්නෙක් සමාධිය නිරන්තරයෙන් පුරුදු කරනසුලු වේද, සමාධියට අනුකූලවද හැසිරෙනසුලු වේ නම්, ඔහු මේ සතර දෙනාගෙන් අග්‍ර වූද, ශ්‍රේෂ්ඨ වූද, ප්‍රධාන වූද, උත්තම වූද, ප්‍රවර වූද ධ්‍යාන කරන්නා වන්නේය.\n\nභික්ෂූණි, යම් සේ ගව දෙනකගෙන් කිරිද, කිරිවලින් දීකිරිද, දීකිරිවලින් වෙඬරුද, වෙඬරුයෙන් ගිතෙල්ද, ගිතෙලින් ගිතෙල් සාරයද, එහිදී අග්‍ර යැයි කියනු ලැබේ; භික්ෂූණි, එපරිද්දෙන්ම, යම් ධ්‍යාන කරන්නෙක් සමාධිය නිරන්තරයෙන් පුරුදු කරනසුලු වේද, සමාධියට අනුකූලවද හැසිරෙනසුලු වේ නම්, ඔහු මේ සතර දෙනාගෙන් අග්‍ර වූද, ශ්‍රේෂ්ඨ වූද, ප්‍රධාන වූද, උත්තම වූද, ප්‍රවර වූද ධ්‍යාන කරන්නා වන්නේය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ දෙසුම සතුටින් පිළිගත්හ.",
      "paliTitle": "Sātaccamūlakasappāyakārīsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Persevering Beneficial Practice",
      "sinhalaTitle": "නිරතුරු සුදුසු දේ කිරීමේ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Jhānasaṃyuttaṃ [samādhisaṃyuttaṃ (syā. kaṃ.)] samattaṃ. Tassuddānaṃ – Samādhi samāpatti ṭhiti ca, vuṭṭhānaṃ kallitārammaṇena ca; Gocarā abhinīhāro sakkacca, sātacca athopi sappāyanti.",
    "english": "Jhāna Collection Concluded",
    "sinhala": "ධ්‍යාන සංයුත්තය"
  }
}