{
  "id": "sn.3.9",
  "title": {
    "pali": "Supaṇṇasaṃyuttaṃ",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 392,
      "pali": "Sāvatthinidānaṃ. ‘‘Catasso imā, bhikkhave, supaṇṇayoniyo. Katamā catasso? Aṇḍajā supaṇṇā, jalābujā supaṇṇā, saṃsedajā supaṇṇā, opapātikā supaṇṇā – imā kho, bhikkhave, catasso supaṇṇayoniyo’’ti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": ""
    },
    {
      "number": 393,
      "pali": "Sāvatthinidānaṃ. ‘‘Catasso imā, bhikkhave, supaṇṇayoniyo. Katamā catasso? Aṇḍajā…pe… imā kho, bhikkhave, catasso supaṇṇayoniyo. Tatra, bhikkhave, aṇḍajā supaṇṇā aṇḍajeva nāge haranti, na jalābuje, na saṃsedaje, na opapātike. Tatra, bhikkhave, jalābujā supaṇṇā aṇḍaje ca jalābuje ca nāge haranti, na saṃsedaje, na opapātike. Tatra, bhikkhave, saṃsedajā supaṇṇā aṇḍaje ca jalābuje ca saṃsedaje ca nāge haranti, na opapātike. Tatra, bhikkhave, opapātikā supaṇṇā aṇḍaje ca jalābuje ca saṃsedaje ca opapātike ca nāge haranti. Imā kho, bhikkhave, catasso supaṇṇayoniyo’’ti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Harantisuttaṃ",
      "vagga": ""
    },
    {
      "number": 394,
      "pali": "Sāvatthinidānaṃ. Aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘aṇḍajā supaṇṇā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dvayakārīsuttaṃ",
      "vagga": ""
    },
    {
      "number": 395,
      "numberRange": "395-397",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ supaṇṇānaṃ…pe… saṃsedajānaṃ supaṇṇānaṃ…pe… opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘opapātikā supaṇṇā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyādidvayakārīsuttattikaṃ",
      "vagga": ""
    },
    {
      "number": 398,
      "numberRange": "398-407",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘aṇḍajā supaṇṇā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti…pe… pānaṃ deti… vatthaṃ deti… yānaṃ deti… mālaṃ deti… gandhaṃ deti… vilepanaṃ deti… seyyaṃ deti… āvasathaṃ deti… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti. Soḷasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Aṇḍajadānūpakārasuttadasakaṃ",
      "vagga": ""
    },
    {
      "number": 408,
      "numberRange": "408-437",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ supaṇṇānaṃ…pe… saṃsedajānaṃ supaṇṇānaṃ…pe… opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘opapātikā supaṇṇā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti…pe… pānaṃ deti…pe… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti. Chacattālīsamaṃ. (Evaṃ piṇḍakena chacattālīsaṃ suttantā honti.) ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Jalābujādidānūpakārasuttatiṃsakaṃ",
      "vagga": ""
    }
  ],
  "footer": {
    "pali": "Supaṇṇasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Suddhikaṃ haranti ceva, dvayakārī ca caturo; Dānūpakārā tālīsaṃ, supaṇṇe suppakāsitāti.",
    "english": "",
    "sinhala": ""
  }
}