{
  "id": "sn.3.9",
  "title": {
    "pali": "Supaṇṇasaṃyuttaṃ",
    "english": "The Connected Discourses on Supaṇṇa",
    "sinhala": "සුපණ්ණ සංයුත්තය"
  },
  "sections": [
    {
      "number": 392,
      "pali": "Sāvatthinidānaṃ. ‘‘Catasso imā, bhikkhave, supaṇṇayoniyo. Katamā catasso? Aṇḍajā supaṇṇā, jalābujā supaṇṇā, saṃsedajā supaṇṇā, opapātikā supaṇṇā – imā kho, bhikkhave, catasso supaṇṇayoniyo’’ti. Paṭhamaṃ.",
      "english": "At Sāvatthī.\n\n“Monks, these are the four modes of generation for Garudas. Which four? Garudas born from eggs, Garudas born from the womb, Garudas born from moisture, and Garudas born spontaneously. These, monks, are indeed the four modes of generation for Garudas.”\n\nThe First Discourse.",
      "sinhala": "මහණෙනි, මේ සුපර්ණ උත්පත්ති ස්ථාන සතරක් වෙති. කවර සතරක් ද? එනම්, අණ්ඩජ සුපර්ණයෝ ද, ජලාබුජ සුපර්ණයෝ ද, සංසේදජ සුපර්ණයෝ ද, ඕපපාතික සුපර්ණයෝ ද වෙති. මහණෙනි, මේ සුපර්ණ උත්පත්ති ස්ථාන සතර මේවා ම ය.",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": "",
      "englishTitle": "The Simple Discourse",
      "sinhalaTitle": "සුද්ධික සූත‍්‍රය"
    },
    {
      "number": 393,
      "pali": "Sāvatthinidānaṃ. ‘‘Catasso imā, bhikkhave, supaṇṇayoniyo. Katamā catasso? Aṇḍajā…pe… imā kho, bhikkhave, catasso supaṇṇayoniyo. Tatra, bhikkhave, aṇḍajā supaṇṇā aṇḍajeva nāge haranti, na jalābuje, na saṃsedaje, na opapātike. Tatra, bhikkhave, jalābujā supaṇṇā aṇḍaje ca jalābuje ca nāge haranti, na saṃsedaje, na opapātike. Tatra, bhikkhave, saṃsedajā supaṇṇā aṇḍaje ca jalābuje ca saṃsedaje ca nāge haranti, na opapātike. Tatra, bhikkhave, opapātikā supaṇṇā aṇḍaje ca jalābuje ca saṃsedaje ca opapātike ca nāge haranti. Imā kho, bhikkhave, catasso supaṇṇayoniyo’’ti. Dutiyaṃ.",
      "english": "Monks, there are these four kinds of supaṇṇa-birth. Which four? Birth from eggs, birth from a womb, birth from moisture, and spontaneous birth. These, monks, are the four kinds of supaṇṇa-birth.\n\nAmong these, monks, egg-born supaṇṇas prey only on egg-born nāgas, and not on womb-born, moisture-born, or spontaneously-arisen nāgas.\n\nAmong these, monks, womb-born supaṇṇas prey on egg-born nāgas and womb-born nāgas, and not on moisture-born or spontaneously-arisen nāgas.\n\nAmong these, monks, moisture-born supaṇṇas prey on egg-born nāgas, womb-born nāgas, and moisture-born nāgas, and not on spontaneously-arisen nāgas.\n\nAmong these, monks, spontaneously-arisen supaṇṇas prey on egg-born nāgas, womb-born nāgas, moisture-born nāgas, and spontaneously-arisen nāgas.\n\nThese, monks, are the four kinds of supaṇṇa-birth.",
      "sinhala": "සැවැත් නුවරදීය.\n\n“මහණෙනි, මේ සුපණ්ණයන්ගේ යෝනි සතරක් වෙති. ඒ කවර සතරක්ද? අණ්ඩජ, ජලාබුජ, සංසේදජ, ඕපපාතික යන මේ සතරයි. මහණෙනි, ඒකාන්තයෙන් මේ සුපණ්ණයන්ගේ යෝනි සතරක් වෙති.”\n\n“මහණෙනි, මෙහි අණ්ඩජ සුපණ්ණයෝ, අණ්ඩජ නාගයන්ම අල්ලා ගනිති. ජලාබුජ නාගයන් හෝ සංසේදජ නාගයන් හෝ ඕපපාතික නාගයන් හෝ අල්ලා නොගනිති.”\n\n“මහණෙනි, මෙහි ජලාබුජ සුපණ්ණයෝ, අණ්ඩජ නාගයන්ද, ජලාබුජ නාගයන්ද අල්ලා ගනිති. සංසේදජ නාගයන් හෝ ඕපපාතික නාගයන් හෝ අල්ලා නොගනිති.”\n\n“මහණෙනි, මෙහි සංසේදජ සුපණ්ණයෝ, අණ්ඩජ නාගයන්ද, ජලාබුජ නාගයන්ද, සංසේදජ නාගයන්ද අල්ලා ගනිති. ඕපපාතික නාගයන් නම් අල්ලා නොගනිති.”\n\n“මහණෙනි, මෙහි ඕපපාතික සුපණ්ණයෝ, අණ්ඩජ නාගයන්ද, ජලාබුජ නාගයන්ද, සංසේදජ නාගයන්ද, ඕපපාතික නාගයන්ද අල්ලා ගනිති.”\n\n“මහණෙනි, ඒකාන්තයෙන් මේ සුපණ්ණයන්ගේ යෝනි සතරක් වෙති.”",
      "paliTitle": "Harantisuttaṃ",
      "vagga": "",
      "englishTitle": "The Robbers' Sutta",
      "sinhalaTitle": "හරන්ති සූත්‍රය"
    },
    {
      "number": 394,
      "pali": "Sāvatthinidānaṃ. Aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘aṇḍajā supaṇṇā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti. Tatiyaṃ.",
      "english": "A certain monk approached the Blessed One; having approached, he paid homage to the Blessed One and sat down to one side. Seated to one side, that monk said to the Blessed One: \"What, venerable sir, is the reason, what is the cause, by which some individual here, with the breakup of the body, after death, is reborn into the companionship of the egg-born Garuḍas?\" \"Here, monk, some individual performs twofold actions by body, performs twofold actions by speech, performs twofold actions by mind. He has heard: 'The egg-born Garuḍas are long-lived, beautiful, and abound in happiness.' Then it occurs to him: 'Oh, if only, with the breakup of the body, after death, I might be reborn into the companionship of the egg-born Garuḍas!' With the breakup of the body, after death, he is reborn into the companionship of the egg-born Garuḍas. This, monk, is the reason, this is the cause, by which some individual here, with the breakup of the body, after death, is reborn into the companionship of the egg-born Garuḍas.\"",
      "sinhala": "සැවැත් නුවරදී මෙම දේශනාව සිදු විය. එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනී, කවර නම් හේතුවකින්ද, කවර නම් ප්‍රත්‍යයකින්ද, යම් කෙනෙක් මෙලොවදී කය බිඳී මරණින් පසු අණ්ඩජ සුපණ්ණ සත්වයන්ගේ සහවාසයට උපදීද?\" \"මහණ, මෙහිලා යම් කෙනෙක් කයෙන් ද්වයකාරී වෙයි, වචනයෙන් ද්වයකාරී වෙයි, සිතින් ද්වයකාරී වෙයි. ඔහුට මෙය අසන්නට ලැබේ: 'අණ්ඩජ සුපණ්ණ සත්වයෝ දීර්ඝායුෂ්ක වෙති, වර්ණවන්ත වෙති, බොහෝ සැප ඇති අය වෙති.' ඔහුට මෙසේ සිතේ: 'අහෝ, මා ද කය බිඳී මරණින් පසු අණ්ඩජ සුපණ්ණ සත්වයන්ගේ සහවාසයට පැමිණිය හොත්!' ඔහු කය බිඳී මරණින් පසු අණ්ඩජ සුපණ්ණ සත්වයන්ගේ සහවාසයට උපදී. මහණ, මේයයි ඒ හේතුව, මේයයි ඒ ප්‍රත්‍යය, යම් කෙනෙක් මෙලොවදී කය බිඳී මරණින් පසු අණ්ඩජ සුපණ්ණ සත්වයන්ගේ සහවාසයට උපදීද.\"",
      "paliTitle": "Dvayakārīsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Two Actions",
      "sinhalaTitle": "ද්වයකාරී සූත්‍රය"
    },
    {
      "number": 395,
      "numberRange": "395-397",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ supaṇṇānaṃ…pe… saṃsedajānaṃ supaṇṇānaṃ…pe… opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘opapātikā supaṇṇā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti. Chaṭṭhaṃ.",
      "english": "At Sāvatthī. Sitting to one side, that bhikkhu said this to the Blessed One: \"What, venerable sir, is the reason, what is the cause, by which a certain individual, after the breakdown of the body, after death, is reborn into the companionship of womb-born garudas, egg-born garudas, moisture-born garudas, or spontaneously-arisen garudas?\"\n\n\"Here, bhikkhu, a certain individual engages in twofold conduct with the body, engages in twofold conduct with speech, and engages in twofold conduct with the mind. He has heard: 'Spontaneously-arisen garudas are long-lived, beautiful, and abundant in happiness.' Then he thinks thus: 'Oh, if only, after the breakdown of the body, after death, I might be reborn into the companionship of spontaneously-arisen garudas!' He, after the breakdown of the body, after death, is reborn into the companionship of spontaneously-arisen garudas. This, bhikkhu, is the reason, this is the cause, by which a certain individual, after the breakdown of the body, after death, is reborn into the companionship of spontaneously-arisen garudas.\"",
      "sinhala": "මේ සූත්‍රය සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑකත්පස්ව හුන් ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘වහන්ස, මෙලොව ඇතැම් කෙනෙක් කය බිඳී මරණින් මතු ජලාබුජ සුපර්ණයන්ගේ...සම්සේදජ සුපර්ණයන්ගේ...ඕපපාතික සුපර්ණයන්ගේ සහභාවයට පත්වීමට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?’’\n\n‘‘මහණ, මෙහි ඇතැම් කෙනෙක් කයින් දෙයාකාර ක්‍රියා සිදු කරයි, වචනයෙන් දෙයාකාර ක්‍රියා සිදු කරයි, සිතින් දෙයාකාර ක්‍රියා සිදු කරයි. ඔහුට අසන්නට ලැබේ: ‘ඕපපාතික සුපර්ණයෝ දීර්ඝායුෂ්ක වෙති, වර්ණවත් වෙති, සැප බහුල වෙති’යි. ඔහුට මෙසේ සිතේ: ‘අහෝ! මම කය බිඳී මරණින් මතු ඕපපාතික සුපර්ණයන්ගේ සහභාවයට පත්වන්නට නම් කෙතරම් හොඳදැයි.’ හෙතෙම කය බිඳී මරණින් මතු ඕපපාතික සුපර්ණයන්ගේ සහභාවයට පත්වේ. මහණ, මෙලොව ඇතැම් කෙනෙක් කය බිඳී මරණින් මතු ඕපපාතික සුපර්ණයන්ගේ සහභාවයට පත්වීමට හේතුව මෙයයි, ප්‍රත්‍යය මෙයයි’’යි.",
      "paliTitle": "Dutiyādidvayakārīsuttattikaṃ",
      "vagga": "",
      "englishTitle": "Triad of Second and Subsequent Dual Discourses",
      "sinhalaTitle": "දෙවන ආදි ද්වය කාරී සූත්‍ර ත්‍රිකය"
    },
    {
      "number": 398,
      "numberRange": "398-407",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘aṇḍajā supaṇṇā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti…pe… pānaṃ deti… vatthaṃ deti… yānaṃ deti… mālaṃ deti… gandhaṃ deti… vilepanaṃ deti… seyyaṃ deti… āvasathaṃ deti… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti. Soḷasamaṃ.",
      "english": "At Savatthi, that bhikkhu, seated to one side, said this to the Blessed One: \"Venerable sir, what, pray, is the cause, what is the reason, by which some individual here, with the breakup of the body, after death, reappears in companionship with the egg-born fair-winged ones?\"\n\n\"Here, bhikkhu, some individual performs actions of a dual nature with the body, performs actions of a dual nature with speech, and performs actions of a dual nature with the mind. It is heard by him: 'The egg-born fair-winged ones are long-lived, beautiful, and abundant in happiness.' He thinks: 'Oh, if only I, with the breakup of the body, after death, might reappear in companionship with the egg-born fair-winged ones!' He gives food; he gives drink; he gives clothing; he gives vehicles; he gives garlands; he gives perfumes; he gives unguents; he gives bedding; he gives dwellings; he gives lamps. He, with the breakup of the body, after death, reappears in companionship with the egg-born fair-winged ones.\n\nThis, bhikkhu, is the cause, this is the reason, by which some individual here, with the breakup of the body, after death, reappears in companionship with the egg-born fair-winged ones.\"",
      "sinhala": "සැවැත් නුවරදී මෙම දේශනාව සිදු විය.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: “භාග්‍යවතුන් වහන්ස, මෙලොව යම් කිසිවෙක් කය බිඳී යාමෙන් පසු, මරණයෙන් ඉක්බිතිව, අණ්ඩජ සුපර්ණයන්ගේ සහවාසයට උපත ලැබීමට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?”\n\n“මහණෙනි, මෙලොව යම් කිසිවෙක් කයින් දෙආකාරයෙන් ක්‍රියා කරයි, වචනයෙන් දෙආකාරයෙන් ක්‍රියා කරයි, සිතින් දෙආකාරයෙන් ක්‍රියා කරයි. ඔහුට මෙසේ අසන්නට ලැබේ: ‘අණ්ඩජ සුපර්ණයෝ දීර්ඝායුෂ ඇත්තෝය, වර්ණවත්ය, බොහෝ සැප ඇත්තෝය’ කියා. ඔහුට මෙසේ සිතක් ඇති වේ: ‘අහෝ, මාත් කය බිඳී යාමෙන් පසු, මරණයෙන් ඉක්බිතිව, අණ්ඩජ සුපර්ණයන්ගේ සහවාසයට උපදිමි නම් ඉතා හොඳය’ කියා. ඔහු ආහාර දෙයි, පාන වර්ග දෙයි, වස්ත්‍ර දෙයි, යාන වාහන දෙයි, මල් දෙයි, සුවඳ වර්ග දෙයි, ආලේපන දෙයි, සයනයන් දෙයි, ආවාස දෙයි, පහන් ආලෝක දෙයි. ඔහු කය බිඳී යාමෙන් පසු, මරණයෙන් ඉක්බිතිව, අණ්ඩජ සුපර්ණයන්ගේ සහවාසයට උපදී. මහණෙනි, මෙලොව යම් කිසිවෙක් කය බිඳී යාමෙන් පසු, මරණයෙන් ඉක්බිතිව, අණ්ඩජ සුපර්ණයන්ගේ සහවාසයට උපදින්නේ මෙවැනි හේතුවක් නිසාය, මෙවැනි ප්‍රත්‍යයක් නිසාය.”\n\nදහසයවැනි සූත්‍රයයි.",
      "paliTitle": "Aṇḍajadānūpakārasuttadasakaṃ",
      "vagga": "",
      "englishTitle": "Ten Discourses on Beneficial Giving to the Egg-born",
      "sinhalaTitle": "අණ්ඩජ දාන උපකාර සූත්‍ර දසකය"
    },
    {
      "number": 408,
      "numberRange": "408-437",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ supaṇṇānaṃ…pe… saṃsedajānaṃ supaṇṇānaṃ…pe… opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘opapātikā supaṇṇā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti…pe… pānaṃ deti…pe… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ supaṇṇānaṃ sahabyataṃ upapajjatī’’ti. Chacattālīsamaṃ. (Evaṃ piṇḍakena chacattālīsaṃ suttantā honti.) ",
      "english": "A certain bhikkhu, seated to one side, asked the Blessed One, “Venerable sir, what is the reason, what is the condition, whereby some individual, with the breakdown of the body, after death, is reborn into companionship with egg-born Garuḍas, or with moisture-born Garuḍas, or with spontaneously arisen Garuḍas?”\n\n“Here, bhikkhu, some individual performs mixed actions with the body, mixed actions with speech, and mixed actions with the mind. They hear that spontaneously arisen Garuḍas are long-lived, beautiful, and abound in happiness. Then they think, ‘Oh, may I, with the breakdown of the body, after death, be reborn into companionship with the spontaneously arisen Garuḍas.’ They give food, they give drink, and they give illumination. They, with the breakdown of the body, after death, are reborn into companionship with the spontaneously arisen Garuḍas. This, bhikkhu, is the reason, this is the condition, whereby some individual, with the breakdown of the body, after death, is reborn into companionship with the spontaneously arisen Garuḍas.”",
      "sinhala": "එකත්පස්ව වැඩ සිටි එක් භික්‍ෂුවක් භාග්‍යවතුන් වහන්සේට මෙය පැවසීය – ‘‘ස්වාමීනි, මෙලොව ඇතැම් පුද්ගලයෙක් කය බිඳී මරණින් මතු ජලාබුජ සුපර්ණයන්ගේ… (පෙ)… සංසේදජ සුපර්ණයන්ගේ… (පෙ)… ඕපපාතික සුපර්ණයන්ගේ සහභාවයට පත්වීමට හේතුව කුමක්ද? ප්‍[ZWJ]රත්‍[ZWJ]යය කුමක්ද?”\n\n‘‘මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් කයින් ද්විත්ව ක්‍[ZWJ]රියා ඇත්තේ වෙයි, වචනයෙන් ද්විත්ව ක්‍[ZWJ]රියා ඇත්තේ වෙයි, මනසින් ද්විත්ව ක්‍[ZWJ]රියා ඇත්තේ වෙයි. ඔහුට මෙසේ අසන්නට ලැබේ – ‘ඕපපාතික සුපර්ණයෝ දීර්ඝායුෂ්ක වෙති, වර්ණවත් වෙති, සැප බහුල වෙති’යි. ඔහුට මෙසේ සිතේ – ‘අහෝ, මම කය බිඳී මරණින් මතු ඕපපාතික සුපර්ණයන්ගේ සහභාවයට පත්වන්නෙම් නම්!’ ඔහු ආහාර දෙයි… (පෙ)… පාන වර්ග දෙයි… (පෙ)… පහන් ආලෝකය දෙයි. ඔහු කය බිඳී මරණින් මතු ඕපපාතික සුපර්ණයන්ගේ සහභාවයට පැමිණෙයි. ‘‘මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් කය බිඳී මරණින් මතු ඕපපාතික සුපර්ණයන්ගේ සහභාවයට පත්වීමට හේතුව මෙයයි, ප්‍[ZWJ]රත්‍[ZWJ]යය මෙයයි’’යි.",
      "paliTitle": "Jalābujādidānūpakārasuttatiṃsakaṃ",
      "vagga": "",
      "englishTitle": "The Thirtiad of Discourses on the Benefit of Giving to Beings",
      "sinhalaTitle": "ජලාබුජාදි දානෝපකාර සූත‍්‍ර තිංසකය"
    }
  ],
  "footer": {
    "pali": "Supaṇṇasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Suddhikaṃ haranti ceva, dvayakārī ca caturo; Dānūpakārā tālīsaṃ, supaṇṇe suppakāsitāti.",
    "english": "Supaṇṇa Connected Discourses Concluded",
    "sinhala": "සුපණ්ණ සංයුත්තය නිමයි. එහි උද්දානය."
  }
}