{
  "id": "sn.3.5",
  "title": {
    "pali": "Uppādasaṃyuttaṃ",
    "english": "The Connected Discourses on Arising",
    "sinhala": "උප්පාද සංයුත්තය"
  },
  "sections": [
    {
      "number": 312,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, cakkhussa uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo sotassa uppādo ṭhiti…pe… yo ghānassa uppādo ṭhiti… yo jivhāya uppādo ṭhiti… yo kāyassa uppādo ṭhiti… yo manassa uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo ca, bhikkhave, cakkhussa nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo. Yo sotassa nirodho…pe… yo ghānassa nirodho… yo jivhāya nirodho… yo kāyassa nirodho… yo manassa nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo’’ti. Paṭhamaṃ.",
      "english": "Bhikkhus, whatever is the arising, persistence, manifestation, and appearance of the eye—this is the arising of suffering, the persistence of diseases, the appearance of old age and death. Whatever is the arising and persistence of the ear, whatever is the arising and persistence of the nose, whatever is the arising and persistence of the tongue, whatever is the arising and persistence of the body; and whatever is the arising, persistence, manifestation, and appearance of the mind—this is the arising of suffering, the persistence of diseases, the appearance of old age and death.\n\nAnd whatever, bhikkhus, is the cessation, subsiding, and disappearance of the eye—this is the cessation of suffering, the subsiding of diseases, the disappearance of old age and death. Whatever is the cessation of the ear, whatever is the cessation of the nose, whatever is the cessation of the tongue, whatever is the cessation of the body; and whatever is the cessation, subsiding, and disappearance of the mind—this is the cessation of suffering, the subsiding of diseases, the disappearance of old age and death.",
      "sinhala": "මහණෙනි, ඇසෙහි යම් උපතක්, පැවැත්මක්, ප්‍රකටවීමක් සහ පහළවීමක් වේද, එය දුක්ඛයෙහි උපතයි; රෝගයන්ගේ පැවැත්මයි; ජරාවෙහි හා මරණයෙහි ප්‍රකටවීමයි. කනෙහි යම් උපතක්, පැවැත්මක්, ප්‍රකටවීමක් සහ පහළවීමක් වේද, එය දුක්ඛයෙහි උපතයි; රෝගයන්ගේ පැවැත්මයි; ජරාවෙහි හා මරණයෙහි ප්‍රකටවීමයි. නාසයෙහි යම් උපතක්, පැවැත්මක්, ප්‍රකටවීමක් සහ පහළවීමක් වේද, එය දුක්ඛයෙහි උපතයි; රෝගයන්ගේ පැවැත්මයි; ජරාවෙහි හා මරණයෙහි ප්‍රකටවීමයි. දිවෙහි යම් උපතක්, පැවැත්මක්, ප්‍රකටවීමක් සහ පහළවීමක් වේද, එය දුක්ඛයෙහි උපතයි; රෝගයන්ගේ පැවැත්මයි; ජරාවෙහි හා මරණයෙහි ප්‍රකටවීමයි. කයෙහි යම් උපතක්, පැවැත්මක්, ප්‍රකටවීමක් සහ පහළවීමක් වේද, එය දුක්ඛයෙහි උපතයි; රෝගයන්ගේ පැවැත්මයි; ජරාවෙහි හා මරණයෙහි ප්‍රකටවීමයි. මනසෙහි යම් උපතක්, පැවැත්මක්, ප්‍රකටවීමක් සහ පහළවීමක් වේද, එය දුක්ඛයෙහි උපතයි; රෝගයන්ගේ පැවැත්මයි; ජරාවෙහි හා මරණයෙහි ප්‍රකටවීමයි.\n\nමහණෙනි, ඇසෙහි යම් නිරෝධයක්, සංසිඳීමක් සහ අභාවයට යෑමක් වේද, එය දුක්ඛයෙහි නිරෝධයයි; රෝගයන්ගේ සංසිඳීමයි; ජරාවෙහි හා මරණයෙහි අභාවයට යෑමයි. කනෙහි යම් නිරෝධයක්, සංසිඳීමක් සහ අභාවයට යෑමක් වේද, එය දුක්ඛයෙහි නිරෝධයයි; රෝගයන්ගේ සංසිඳීමයි; ජරාවෙහි හා මරණයෙහි අභාවයට යෑමයි. නාසයෙහි යම් නිරෝධයක්, සංසිඳීමක් සහ අභාවයට යෑමක් වේද, එය දුක්ඛයෙහි නිරෝධයයි; රෝගයන්ගේ සංසිඳීමයි; ජරාවෙහි හා මරණයෙහි අභාවයට යෑමයි. දිවෙහි යම් නිරෝධයක්, සංසිඳීමක් සහ අභාවයට යෑමක් වේද, එය දුක්ඛයෙහි නිරෝධයයි; රෝගයන්ගේ සංසිඳීමයි; ජරාවෙහි හා මරණයෙහි අභාවයට යෑමයි. කයෙහි යම් නිරෝධයක්, සංසිඳීමක් සහ අභාවයට යෑමක් වේද, එය දුක්ඛයෙහි නිරෝධයයි; රෝගයන්ගේ සංසිඳීමයි; ජරාවෙහි හා මරණයෙහි අභාවයට යෑමයි. මනසෙහි යම් නිරෝධයක්, සංසිඳීමක් සහ අභාවයට යෑමක් වේද, එය දුක්ඛයෙහි නිරෝධයයි; රෝගයන්ගේ සංසිඳීමයි; ජරාවෙහි හා මරණයෙහි අභාවයට යෑමයි.",
      "paliTitle": "Cakkhusuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on the Eye",
      "sinhalaTitle": "චක්ඛු සූත්‍රය"
    },
    {
      "number": 313,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, rūpānaṃ uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo saddānaṃ… yo gandhānaṃ… yo rasānaṃ… yo phoṭṭhabbānaṃ… yo dhammānaṃ uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, rūpānaṃ nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo. Yo saddānaṃ… yo gandhānaṃ… yo rasānaṃ… yo phoṭṭhabbānaṃ… yo dhammānaṃ nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo’’ti. Dutiyaṃ.",
      "english": "Indeed, monks, that which is the arising, persistence, complete manifestation, and appearance of forms — that is the arising of suffering, the persistence of diseases, and the appearance of aging and death. That which is the arising, persistence, complete manifestation, and appearance of sounds, of odors, of tastes, of tactile sensations, and of mental phenomena — that is the arising of suffering, the persistence of diseases, and the appearance of aging and death.\n\nBut that which, monks, is the cessation, calming, and disappearance of forms — that is the cessation of suffering, the calming of diseases, and the disappearance of aging and death. That which is the cessation, calming, and disappearance of sounds, of odors, of tastes, of tactile sensations, and of mental phenomena — that is the cessation of suffering, the calming of diseases, and the disappearance of aging and death.",
      "sinhala": "මහණෙනි, යම්කිසි රූපයන්ගේ උප්පාදය, ඨිතිය, අභිනිර්වෘත්තිය, ප්‍රාදුර්භාවය ඇත්ද, එය දුකෙහි උප්පාදයයි; රෝගයන්ගේ ඨිතියයි; ජරා-මරණයේ ප්‍රාදුර්භාවයයි. යම්කිසි ශබ්දයන්ගේ, යම්කිසි ගන්ධයන්ගේ, යම්කිසි රසයන්ගේ, යම්කිසි ස්පර්ශයන්ගේ, යම්කිසි ධර්මයන්ගේ උප්පාදය, ඨිතිය, අභිනිර්වෘත්තිය, ප්‍රාදුර්භාවය ඇත්ද, මහණෙනි, එය දුකෙහි උප්පාදයයි; රෝගයන්ගේ ඨිතියයි; ජරා-මරණයේ ප්‍රාදුර්භාවයයි. තවද මහණෙනි, යම්කිසි රූපයන්ගේ නිරෝධය, වූපශමය, අස්තංගමය ඇත්ද, එය දුකෙහි නිරෝධයයි; රෝගයන්ගේ වූපශමයයි; ජරා-මරණයේ අස්තංගමයයි. යම්කිසි ශබ්දයන්ගේ, යම්කිසි ගන්ධයන්ගේ, යම්කිසි රසයන්ගේ, යම්කිසි ස්පර්ශයන්ගේ, යම්කිසි ධර්මයන්ගේ නිරෝධය, වූපශමය, අස්තංගමය ඇත්ද, මහණෙනි, එය දුකෙහි නිරෝධයයි; රෝගයන්ගේ වූපශමයයි; ජරා-මරණයේ අස්තංගමයයි. දෙවැනි වරටයි.",
      "paliTitle": "Rūpasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Form",
      "sinhalaTitle": "රූප සූත්‍රය"
    },
    {
      "number": 314,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, cakkhuviññāṇassa uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo…pe… yo manoviññāṇassa uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, cakkhuviññāṇassa nirodho…pe… jarāmaraṇassa atthaṅgamo…pe… yo manoviññāṇassa nirodho…pe… jarāmaraṇassa atthaṅgamo’’ti. Tatiyaṃ.",
      "english": "At Sāvatthī.\nMonks, whatever is the arising and persistence of eye-consciousness, and its subsequent stages that lead to the manifestation of aging-and-death; and likewise for ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, and mind-consciousness—their arising and persistence, and their subsequent stages that lead to the manifestation of aging-and-death. And whatever, monks, is the cessation of eye-consciousness, and its subsequent stages that lead to the disappearance of aging-and-death; and likewise for ear-consciousness, nose-consciousness, tongue-consciousness, body-consciousness, and mind-consciousness—their cessation, and their subsequent stages that lead to the disappearance of aging-and-death. This is the third discourse.",
      "sinhala": "සැවැත් නුවරදීය. මහණෙනි, යම් චක්ඛු විඤ්ඤාණයක හටගැනීමක්, පැවැත්මක් වේද, (එලෙසම) මනෝ විඤ්ඤාණය දක්වා ඇති විඤ්ඤාණ සමූහයේ හටගැනීමක්, පැවැත්මක් වේද, එය ජරා-මරණයෙහි ප්‍රාදුර්භාවයයි.\n\nමහණෙනි, යම් චක්ඛු විඤ්ඤාණයක නිරෝධය වේද, (එලෙසම) මනෝ විඤ්ඤාණය දක්වා ඇති විඤ්ඤාණ සමූහයේ නිරෝධය වේද, එය ජරා-මරණයෙහි අත්ථංගමයයි. තෙවැන්නයි.",
      "paliTitle": "Viññāṇasuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Consciousness",
      "sinhalaTitle": "විඤ්ඤාණ සූත්‍රය"
    },
    {
      "number": 315,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, cakkhusamphassassa uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo…pe… yo manosamphassassa uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, cakkhusamphassassa nirodho…pe… jarāmaraṇassa atthaṅgamo…pe… yo manosamphassassa nirodho…pe… jarāmaraṇassa atthaṅgamo’’ti. Catutthaṃ.",
      "english": "Monks, the arising and persistence of eye-contact leads to the manifestation of old age and death. The arising and persistence of mind-contact also leads to the manifestation of old age and death.\n\nAnd monks, the cessation of eye-contact leads to the disappearance of old age and death. The cessation of mind-contact also leads to the disappearance of old age and death.",
      "sinhala": "මහණෙනි, යමක් නම් ඇස හා පහස ඇතිවීමත්, පැවතීමත්, (එය හේතුවෙන් පටිච්චසමුප්පන්නව හටගන්නා දුක්ඛ සමුදය හේතුකොටගෙන) ජරාව හා මරණය පහළවීමත් වේද; එසේම (කණ, නාසය, දිව, ශරීරය හා පහස ආදී වූ) මනස හා පහස ඇතිවීමත්, පැවතීමත්, (ඒ හේතුවෙන් පටිච්චසමුප්පන්නව හටගන්නා දුක්ඛ සමුදය හේතුකොටගෙන) ජරාව හා මරණය පහළවීමත් වේ. මහණෙනි, යමක් නම් ඇස හා පහස නිරුද්ධවීමත්, (ඒ හේතුවෙන් පටිච්චසමුප්පන්නව නිරුද්ධවන දුක්ඛ නිරෝධය හේතුකොටගෙන) ජරාව හා මරණය අතුරුදහන්වීමත් වේද; එසේම (කණ, නාසය, දිව, ශරීරය හා පහස ආදී වූ) මනස හා පහස නිරුද්ධවීමත්, (ඒ හේතුවෙන් පටිච්චසමුප්පන්නව නිරුද්ධවන දුක්ඛ නිරෝධය හේතුකොටගෙන) ජරාව හා මරණය අතුරුදහන්වීමත් වේ යන්නයි.",
      "paliTitle": "Samphassasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Contact",
      "sinhalaTitle": "සම්ඵස්ස සූත්‍රය"
    },
    {
      "number": 316,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, cakkhusamphassajāya vedanāya uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo…pe…. Yo manosamphassajāya vedanāya uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, cakkhusamphassajāya vedanāya nirodho vūpasamo…pe… jarāmaraṇassa atthaṅgamo… pe… yo manosamphassajāya vedanāya nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo’’ti. Pañcamaṃ.",
      "english": "At Sāvatthī.\nMonks, that which is the arising and persistence of feeling born of eye-contact, and so forth, until the manifestation of aging and death; and that which is the arising and persistence of feeling born of mind-contact, and so forth, until the manifestation of aging and death.\n\nAnd, monks, that which is the cessation, calming, and disappearance of feeling born of eye-contact, and so forth, until the disappearance of aging and death; and that which is the cessation, calming, and disappearance of feeling born of mind-contact — that is the cessation of suffering, the calming of diseases, and the disappearance of aging and death.",
      "sinhala": "ශ්‍රාවස්ති නුවරදී දේශනා කරන ලදී. මහණෙනි, ඇසෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ ඇතිවීමත්, පැවැත්මත් යමක් වේද, කනෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ ඇතිවීමත්, පැවැත්මත් යමක් වේද, නාසයෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ ඇතිවීමත්, පැවැත්මත් යමක් වේද, දිවෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ ඇතිවීමත්, පැවැත්මත් යමක් වේද, ශරීරයෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ ඇතිවීමත්, පැවැත්මත් යමක් වේද, මනසෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ ඇතිවීමත්, පැවැත්මත් යමක් වේද, එය ජරා මරණයන්ගේ පහළවීම වේ.\n\nමහණෙනි, ඇසෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ නිරෝධයත්, සංසිඳීමත් යමක් වේද, කනෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ නිරෝධයත්, සංසිඳීමත් යමක් වේද, නාසයෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ නිරෝධයත්, සංසිඳීමත් යමක් වේද, දිවෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ නිරෝධයත්, සංසිඳීමත් යමක් වේද, ශරීරයෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ නිරෝධයත්, සංසිඳීමත් යමක් වේද, මනසෙහි ස්පර්ශයෙන් හටගන්නා වේදනාවේ නිරෝධයත්, සංසිඳීමත් යමක් වේද, එය දුකෙහි නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරා මරණයන්ගේ අතුරුදහන් වීමයි.",
      "paliTitle": "Samphassajasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Contact",
      "sinhalaTitle": "සම්‍පස්සජ සූත්‍‍රය"
    },
    {
      "number": 317,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, rūpasaññāya uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo…pe… yo dhammasaññāya uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, rūpasaññāya nirodho…pe… jarāmaraṇassa atthaṅgamo…pe… yo dhammasaññāya nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo’’ti. Chaṭṭhaṃ.",
      "english": "At Sāvatthī. Whatever, bhikkhus, is the arising, persistence, manifestation, and appearance of the perception of form, leading to the manifestation of aging and death; and similarly, for the perception of feeling, the perception of perception, the perception of mental formations, and the perception of consciousness, all leading to the manifestation of aging and death; and whatever is the arising, persistence, manifestation, and appearance of the perception of phenomena—this is the arising of suffering, the persistence of diseases, and the manifestation of aging and death. And whatever, bhikkhus, is the cessation, calming, and disappearance of the perception of form, leading to the disappearance of aging and death; and similarly, for the perception of feeling, the perception of perception, the perception of mental formations, and the perception of consciousness, all leading to the disappearance of aging and death; and whatever is the cessation, calming, and disappearance of the perception of phenomena—this is the cessation of suffering, the calming of diseases, and the disappearance of aging and death.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලදී.\n\nමහණෙනි, යම් හෙයකින් රූප සංඥාවෙහි උපතක්, පැවැත්මක්, පහළ වීමක්, මතු වීමක් වේද; (ඒ හේතුවෙන්) ජරාව හා මරණය පහළ වීමක් වේද; මහණෙනි, යම් හෙයකින් ධර්ම සංඥාවෙහි උපතක්, පැවැත්මක්, පහළ වීමක්, මතු වීමක් වේද; මේ (සියල්ල) දුකෙහි උපතයි, රෝගයන්ගේ පැවැත්මයි, ජරාව හා මරණය පහළ වීමයි.\n\nමහණෙනි, යම් හෙයකින් රූප සංඥාවෙහි නිරෝධයක්, සංසිඳීමක්, අතුරුදන් වීමක් වේද; (ඒ හේතුවෙන්) ජරාව හා මරණය අතුරුදන් වීමක් වේද; මහණෙනි, යම් හෙයකින් ධර්ම සංඥාවෙහි නිරෝධයක්, සංසිඳීමක්, අතුරුදන් වීමක් වේද; මේ (සියල්ල) දුකෙහි නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරාව හා මරණය අතුරුදන් වීමයි.\n\nසයවෙනි සූත්‍රයයි.",
      "paliTitle": "Saññāsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Perception",
      "sinhalaTitle": "සංඥා සූත්‍රය"
    },
    {
      "number": 318,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, rūpasañcetanāya uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo…pe… yo dhammasañcetanāya uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, rūpasañcetanāya nirodho…pe… jarāmaraṇassa atthaṅgamo…pe… yo dhammasañcetanāya nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo’’ti. Sattamaṃ.",
      "english": "At Sāvatthī.\n\nMonks, whatever is the arising, persistence, manifestation, and appearance of conscious intention concerning form — and similarly for conscious intention concerning feeling, perception, volitional formations, and consciousness — that is the manifestation of aging and death. And whatever is the arising, persistence, manifestation, and appearance of conscious intention concerning phenomena, this is the arising of suffering, the persistence of diseases, and the manifestation of aging and death. And, monks, whatever is the cessation, subsidence, and disappearance of conscious intention concerning form — and similarly for conscious intention concerning feeling, perception, volitional formations, and consciousness — that is the disappearance of aging and death. And whatever is the cessation, subsidence, and disappearance of conscious intention concerning phenomena, this is the cessation of suffering, the subsidence of diseases, and the disappearance of aging and death.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nමහණෙනි, යම් රූප සංචේතනාවක හටගැනීමක්, පැවැත්මක් වේ ද, යම් වේදනා සංචේතනාවක හටගැනීමක්, පැවැත්මක් වේ ද, යම් සඤ්ඤා සංචේතනාවක හටගැනීමක්, පැවැත්මක් වේ ද, යම් සංඛාර සංචේතනාවක හටගැනීමක්, පැවැත්මක් වේ ද, යම් විඤ්ඤාණ සංචේතනාවක හටගැනීමක්, පැවැත්මක් වේ ද, එයින් ජරාව හා මරණය ප්‍රකට වීමක් ද වේ ද; යම් ධර්ම සංචේතනාවක හටගැනීමක්, පැවැත්මක්, පූර්ණ වශයෙන් ඉපදීමක්, ප්‍රකට වීමක් ද වේ ද; මේ සියල්ල දුකෙහි හටගැනීමයි, රෝගයන්හි පැවැත්මයි, ජරාව හා මරණය ප්‍රකට වීමයි.\n\nමහණෙනි, යම් රූප සංචේතනාවක නිරෝධයක් වේ ද, යම් වේදනා සංචේතනාවක නිරෝධයක් වේ ද, යම් සඤ්ඤා සංචේතනාවක නිරෝධයක් වේ ද, යම් සංඛාර සංචේතනාවක නිරෝධයක් වේ ද, යම් විඤ්ඤාණ සංචේතනාවක නිරෝධයක් වේ ද, එයින් ජරාව හා මරණය අතුරුදහන් වීමක් ද වේ ද; යම් ධර්ම සංචේතනාවක නිරෝධයක්, සංසිඳීමක්, අතුරුදහන් වීමක් ද වේ ද; මේ සියල්ල දුකෙහි නිරෝධයයි, රෝගයන්හි සංසිඳීමයි, ජරාව හා මරණය අතුරුදහන් වීමයි.\n\nසත්වන සූත්‍රයයි.",
      "paliTitle": "Sañcetanāsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Intention",
      "sinhalaTitle": "සඤ්‍චේතනා සූත‍්‍රය"
    },
    {
      "number": 319,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, rūpataṇhāya uppādo ṭhiti…pe… jarāmaraṇassa pātubhāvo…pe… yo dhammataṇhāya uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, rūpataṇhāya nirodho…pe… jarāmaraṇassa atthaṅgamo…pe… yo dhammataṇhāya nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo’’ti. Aṭṭhamaṃ.",
      "english": "Monks, that which is the arising and persistence of craving for form—and similarly, the arising and persistence of craving for feeling, perception, volitional formations, and consciousness, culminating in the manifestation of aging and death; and that which is the arising, persistence, emergence, and manifestation of craving for mental phenomena: this entire process is the arising of suffering, the persistence of diseases, and the manifestation of aging and death.\n\nAnd, monks, that which is the cessation of craving for form—and similarly, the cessation of craving for feeling, perception, volitional formations, and consciousness, culminating in the disappearance of aging and death; and that which is the cessation, appeasement, and disappearance of craving for mental phenomena: this entire process is the cessation of suffering, the appeasement of diseases, and the disappearance of aging and death.",
      "sinhala": "සැවැත්නුවරදීය.\n\nමහණෙනි, යම් රූප තණ්හාවක හටගැනීමක්, පැව​ත්මක්, සම්පූ​ර්ණ පහළවීමක් හා ප්‍ර​කටවීමක් වේද; යම් වේදනා තණ්හාවක හටගැනීමක්, පැව​ත්මක්, සම්පූ​ර්ණ පහළවීමක් හා ප්‍ර​කටවීමක් වේද; යම් සංඥා තණ්හාවක හටගැනීමක්, පැව​ත්මක්, සම්පූ​ර්ණ පහළවීමක් හා ප්‍ර​කටවීමක් වේද; යම් සංස්කාර තණ්හාවක හටගැනීමක්, පැව​ත්මක්, සම්පූ​ර්ණ පහළවීමක් හා ප්‍ර​කටවීමක් වේද; යම් විඤ්ඤා​ණ තණ්හාවක හටගැනීමක්, පැව​ත්මක්, සම්පූ​ර්ණ පහළවීමක් හා ප්‍ර​කටවීමක් වේද; යම් ධම්ම තණ්හාවක (අරමුණු කෙරෙහි තණ්හාවේ) හටගැනීමක්, පැව​ත්මක්, සම්පූ​ර්ණ පහළවීමක් හා ප්‍ර​කටවීමක් වේද; මේ සියල්ල දුකේ හටගැනීමයි, රෝගයන්ගේ පැව​ත්මයි, ජරාවෙහි හා මරණයෙහි ප්‍ර​කටවීමයි.\n\nමහණෙනි, යම් රූප තණ්හාවක නිරෝධය, සංසිඳීම හා අතුරුදහන් වීමක් වේද; යම් වේදනා තණ්හාවක නිරෝධය, සංසිඳීම හා අතුරුදහන් වීමක් වේද; යම් සංඥා තණ්හාවක නිරෝධය, සංසිඳීම හා අතුරුදහන් වීමක් වේද; යම් සංස්කාර තණ්හාවක නිරෝධය, සංසිඳීම හා අතුරුදහන් වීමක් වේද; යම් විඤ්ඤා​ණ තණ්හාවක නිරෝධය, සංසිඳීම හා අතුරුදහන් වීමක් වේද; යම් ධම්ම තණ්හාවක (අරමුණු කෙරෙහි තණ්හාවේ) නිරෝධය, සංසිඳීම හා අතුරුදහන් වීමක් වේද; මේ සියල්ල දුකේ නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරාවෙහි හා මරණයෙහි අතුරුදහන් වීමයි.",
      "paliTitle": "Taṇhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Craving",
      "sinhalaTitle": "තණ්හා සූත්‍රය"
    },
    {
      "number": 320,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, pathavīdhātuyā uppādo ṭhiti abhinibbatti pātubhāvo… pe… jarāmaraṇassa pātubhāvo; yo āpodhātuyā… yo tejodhātuyā… yo vāyodhātuyā… yo ākāsadhātuyā… yo viññāṇadhātuyā uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, pathavīdhātuyā nirodho…pe… jarāmaraṇassa atthaṅgamo; yo āpodhātuyā nirodho… yo tejodhātuyā nirodho… yo vāyodhātuyā nirodho… yo ākāsadhātuyā nirodho… yo viññāṇadhātuyā nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo’’ti. Navamaṃ.",
      "english": "Monks, whatever origination, establishment, full manifestation, and appearance there is of the earth element, of the water element, of the fire element, of the wind element, of the space element, and of the consciousness element – this is the origination of suffering, the establishment of diseases, and the manifestation of aging and death.\n\nMonks, whatever cessation, calming, and disappearance there is of the earth element, of the water element, of the fire element, of the wind element, of the space element, and of the consciousness element – this is the cessation of suffering, the calming of diseases, and the disappearance of aging and death.",
      "sinhala": "සැවැත්නුවරදීය.\n\nමහණෙනි, යම්කිසි පඨවි ධාතුවේ උත්පාදය, පැවැත්ම, සම්පූර්ණ වශයෙන් ප්‍ර‌කටවීම සහ පහළ වීම වේද; යම්කිසි ආපෝ ධාතුවේ උත්පාදය, පැවැත්ම, සම්පූර්ණ වශයෙන් ප්‍ර‌කටවීම සහ පහළ වීම වේද; යම්කිසි තේජෝ ධාතුවේ උත්පාදය, පැවැත්ම, සම්පූර්ණ වශයෙන් ප්‍ර‌කටවීම සහ පහළ වීම වේද; යම්කිසි වායෝ ධාතුවේ උත්පාදය, පැවැත්ම, සම්පූර්ණ වශයෙන් ප්‍ර‌කටවීම සහ පහළ වීම වේද; යම්කිසි ආකාශ ධාතුවේ උත්පාදය, පැවැත්ම, සම්පූර්ණ වශයෙන් ප්‍ර‌කටවීම සහ පහළ වීම වේද; යම්කිසි විඤ්ඤාණ ධාතුවේ උත්පාදය, පැවැත්ම, සම්පූර්ණ වශයෙන් ප්‍ර‌කටවීම සහ පහළ වීම වේද – මෙය දුකෙහි උත්පාදයයි, රෝගයන්ගේ පැවැත්මයි, ජරාවෙහි හා මරණයෙහි පහළවීමයි.\n\nතවද, මහණෙනි, යම්කිසි පඨවි ධාතුවේ නිරෝධය, සංසිඳීම සහ අතුරුදන් වීම වේද; යම්කිසි ආපෝ ධාතුවේ නිරෝධය, සංසිඳීම සහ අතුරුදන් වීම වේද; යම්කිසි තේජෝ ධාතුවේ නිරෝධය, සංසිඳීම සහ අතුරුදන් වීම වේද; යම්කිසි වායෝ ධාතුවේ නිරෝධය, සංසිඳීම සහ අතුරුදන් වීම වේද; යම්කිසි ආකාශ ධාතුවේ නිරෝධය, සංසිඳීම සහ අතුරුදන් වීම වේද; යම්කිසි විඤ්ඤාණ ධාතුවේ නිරෝධය, සංසිඳීම සහ අතුරුදන් වීම වේද – මෙය දුකෙහි නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරාවෙහි හා මරණයෙහි අතුරුදන් වීමයි.",
      "paliTitle": "Dhātusuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Elements",
      "sinhalaTitle": "ධාතු සූත‍්‍රය"
    },
    {
      "number": 321,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo kho, bhikkhave, rūpassa uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo vedanāya… yo saññāya… yo saṅkhārānaṃ… yo viññāṇassa uppādo ṭhiti abhinibbatti pātubhāvo, dukkhasseso uppādo, rogānaṃ ṭhiti, jarāmaraṇassa pātubhāvo. Yo ca kho, bhikkhave, rūpassa nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo. Yo vedanāya… yo saññāya… yo saṅkhārānaṃ… yo viññāṇassa nirodho vūpasamo atthaṅgamo, dukkhasseso nirodho, rogānaṃ vūpasamo, jarāmaraṇassa atthaṅgamo’’ti. Dasamaṃ. ",
      "english": "Monks, that which is the arising, persistence, manifestation, and appearance of form, is the arising of suffering, the persistence of diseases, and the appearance of old age and death. That which is the arising, persistence, manifestation, and appearance of feeling, is the arising of suffering, the persistence of diseases, and the appearance of old age and death. That which is the arising, persistence, manifestation, and appearance of perception, is the arising of suffering, the persistence of diseases, and the appearance of old age and death. That which is the arising, persistence, manifestation, and appearance of mental formations, is the arising of suffering, the persistence of diseases, and the appearance of old age and death. That which is the arising, persistence, manifestation, and appearance of consciousness, is the arising of suffering, the persistence of diseases, and the appearance of old age and death. And that which is the cessation, pacification, and disappearance of form, is the cessation of suffering, the pacification of diseases, and the disappearance of old age and death. That which is the cessation, pacification, and disappearance of feeling, is the cessation of suffering, the pacification of diseases, and the disappearance of old age and death. That which is the cessation, pacification, and disappearance of perception, is the cessation of suffering, the pacification of diseases, and the disappearance of old age and death. That which is the cessation, pacification, and disappearance of mental formations, is the cessation of suffering, the pacification of diseases, and the disappearance of old age and death. That which is the cessation, pacification, and disappearance of consciousness, is the cessation of suffering, the pacification of diseases, and the disappearance of old age and death.",
      "sinhala": "සැවැත් නුවරදීයි.\n\n“භික්ෂූණි, යම් හෙයකින් රූපයේ උපතක්, පැවැත්මක්, පහළවීමක්, ප්‍රාදුර්භූතවීමක් සිදු වේද, එය දුකෙහි උප්පාදයයි, රෝගයන්ගේ ස්ථිතියයි, ජරාවෙහි හා මරණයෙහි ප්‍රාදුර්භූත වීමයි.\n\nභික්ෂූණි, යම් හෙයකින් වේදනාවේ උපතක්, පැවැත්මක්, පහළවීමක්, ප්‍රාදුර්භූතවීමක් සිදු වේද, එය දුකෙහි උප්පාදයයි, රෝගයන්ගේ ස්ථිතියයි, ජරාවෙහි හා මරණයෙහි ප්‍රාදුර්භූත වීමයි. භික්ෂූණි, යම් හෙයකින් සංඥාවේ උපතක්, පැවැත්මක්, පහළවීමක්, ප්‍රාදුර්භූතවීමක් සිදු වේද, එය දුකෙහි උප්පාදයයි, රෝගයන්ගේ ස්ථිතියයි, ජරාවෙහි හා මරණයෙහි ප්‍රාදුර්භූත වීමයි. භික්ෂූණි, යම් හෙයකින් සංස්කාරයන්ගේ උපතක්, පැවැත්මක්, පහළවීමක්, ප්‍රාදුර්භූතවීමක් සිදු වේද, එය දුකෙහි උප්පාදයයි, රෝගයන්ගේ ස්ථිතියයි, ජරාවෙහි හා මරණයෙහි ප්‍රාදුර්භූත වීමයි. භික්ෂූණි, යම් හෙයකින් විඤ්ඤාණයේ උපතක්, පැවැත්මක්, පහළවීමක්, ප්‍රාදුර්භූතවීමක් සිදු වේද, එය දුකෙහි උප්පාදයයි, රෝගයන්ගේ ස්ථිතියයි, ජරාවෙහි හා මරණයෙහි ප්‍රාදුර්භූත වීමයි.\n\nභික්ෂූණි, යම් හෙයකින් රූපයේ නිරෝධයක්, සංසිඳීමක්, අස්තංගත වීමක් සිදු වේද, එය දුකෙහි නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරාවෙහි හා මරණයෙහි අස්තංගත වීමයි.\n\nභික්ෂූණි, යම් හෙයකින් වේදනාවේ නිරෝධයක්, සංසිඳීමක්, අස්තංගත වීමක් සිදු වේද, එය දුකෙහි නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරාවෙහි හා මරණයෙහි අස්තංගත වීමයි. භික්ෂූණි, යම් හෙයකින් සංඥාවේ නිරෝධයක්, සංසිඳීමක්, අස්තංගත වීමක් සිදු වේද, එය දුකෙහි නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරාවෙහි හා මරණයෙහි අස්තංගත වීමයි. භික්ෂූණි, යම් හෙයකින් සංස්කාරයන්ගේ නිරෝධයක්, සංසිඳීමක්, අස්තංගත වීමක් සිදු වේද, එය දුකෙහි නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරාවෙහි හා මරණයෙහි අස්තංගත වීමයි. භික්ෂූණි, යම් හෙයකින් විඤ්ඤාණයේ නිරෝධයක්, සංසිඳීමක්, අස්තංගත වීමක් සිදු වේද, එය දුකෙහි නිරෝධයයි, රෝගයන්ගේ සංසිඳීමයි, ජරාවෙහි හා මරණයෙහි අස්තංගත වීමයි.”",
      "paliTitle": "Khandhasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on the Aggregates",
      "sinhalaTitle": "ස්කන්‍ධ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Uppādasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Cakkhu rūpañca viññāṇaṃ, phasso ca vedanāya ca; Saññā ca cetanā taṇhā, dhātu khandhena te dasāti.",
    "english": "Connected Discourses on Arising Completed",
    "sinhala": "උප‍්පාද සංයුත‍්තය නිමයි. එහි උද‍්දානය."
  }
}