{
  "id": "sn.3.10",
  "title": {
    "pali": "Gandhabbakāyasaṃyuttaṃ",
    "english": "The Connected Discourses on the Gandhabba Deities",
    "sinhala": "ගන්ධබ්බකාය සංයුත්තය"
  },
  "sections": [
    {
      "number": 438,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme …pe… bhagavā etadavoca – ‘‘gandhabbakāyike vo, bhikkhave, deve desessāmi. Taṃ suṇātha. Katamā ca, bhikkhave, gandhabbakāyikā devā? Santi, bhikkhave, mūlagandhe adhivatthā devā. Santi, bhikkhave, sāragandhe adhivatthā devā. Santi, bhikkhave, pheggugandhe adhivatthā devā. Santi, bhikkhave, tacagandhe adhivatthā devā. Santi, bhikkhave, papaṭikagandhe adhivatthā devā. Santi, bhikkhave, pattagandhe adhivatthā devā. Santi, bhikkhave, pupphagandhe adhivatthā devā. Santi, bhikkhave, phalagandhe adhivatthā devā. Santi, bhikkhave, rasagandhe adhivatthā devā. Santi, bhikkhave, gandhagandhe adhivatthā devā. Ime vuccanti, bhikkhave, gandhabbakāyikā devā’’ti. Paṭhamaṃ.",
      "english": "At one time, the Blessed One was dwelling near Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's Park. There the Blessed One said this:\n\n\"Monks, I will teach you about the devas of the Gandhabba host. Listen to that. And what, monks, are the devas of the Gandhabba host? Monks, there are devas who dwell in root-scents. Monks, there are devas who dwell in heartwood-scents. Monks, there are devas who dwell in sapwood-scents. Monks, there are devas who dwell in bark-scents. Monks, there are devas who dwell in cuticle-scents. Monks, there are devas who dwell in leaf-scents. Monks, there are devas who dwell in flower-scents. Monks, there are devas who dwell in fruit-scents. Monks, there are devas who dwell in sap-scents. Monks, there are devas who dwell in pure scents. These, monks, are called the devas of the Gandhabba host.\"",
      "sinhala": "එක් කලෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවන නම් ආරාමයෙහි, අනේපිඬු සිටුහුගේ අරමෙහි වැඩසිටින සේක. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක –\n\n“මහණෙනි, ගන්ධබ්බකායික දෙවියන් ගැන මම ඔබට දේශනා කරන්නෙමි. එය අසන්න. මහණෙනි, ගන්ධබ්බකායික දෙවිවරු කවරහුද? මහණෙනි, මුල්වල ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, සාරයෙහි ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, අසාර දැව කොටස්වල ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, පොතුවල ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, පොතු ලෙලිවල ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, පත්‍රවල ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, පුෂ්පවල ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, ඵලවල ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, රසයන්හි ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, (ඕනෑම) ගන්ධයෙහි ඇලී වාසය කරන දෙවිවරු සිටිත්. මහණෙනි, මොවුන් ගන්ධබ්බකායික දෙවිවරු යැයි කියනු ලැබේ.”",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": ""
    },
    {
      "number": 439,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā gandhabbakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. Tassa sutaṃ hoti – ‘gandhabbakāyikā devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā gandhabbakāyikānaṃ devānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā gandhabbakāyikānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā gandhabbakāyikānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. Dutiyaṃ.",
      "english": "The occasion was at Sāvatthī.\nIndeed, that monk, sitting to one side, said this to the Blessed One: ‘What, venerable sir, is the reason, what is the condition, by which a certain individual here, with the breaking up of the body, after death, is reborn in the company of the Devas of the Gandhabba class?’\n\n‘Here, monk, a certain individual practices good conduct with the body, practices good conduct with speech, and practices good conduct with the mind. It is heard by him: “The Devas of the Gandhabba class are long-lived, beautiful, and abundant in happiness.” Then he thinks thus: “Oh, may I, with the breaking up of the body, after death, be reborn in the company of the Devas of the Gandhabba class!” He, with the breaking up of the body, after death, is reborn in the company of the Devas of the Gandhabba class. This, monk, is the reason, this is the condition, by which a certain individual here, with the breaking up of the body, after death, is reborn in the company of the Devas of the Gandhabba class.’",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඑම භික්ෂුව එක් පසෙක වාඩි වී භාග්‍යවතුන් වහන්සේට මෙය පැවසුවා: ‘‘ස්වාමීනි, යමෙක් කය බිඳී, මරණින් මතු ගන්ධබ්බකායික දෙවියන්ගේ ඇසුරට පැමිණෙන්නේ කුමන හේතුවක් නිසාද, කුමන ප්‍රත්‍යයක් නිසාද?’’\n\n‘‘මහණ, මෙහිලා ඇතැම් කෙනෙක් කයින් සුචරිතයෙහි හැසිරෙයි, වචනයෙන් සුචරිතයෙහි හැසිරෙයි, මනසින් සුචරිතයෙහි හැසිරෙයි. ඔහුට ‘ගන්ධබ්බකායික දෙවියෝ දීර්ඝායුෂ්ක වෙති, වර්ණවන්ත වෙති, බොහෝ සුවයෙන් යුක්ත වෙති’ යැයි අසා තිබේ. ඔහුට ‘අහෝ! මම කය බිඳී, මරණින් මතු ගන්ධබ්බකායික දෙවියන්ගේ ඇසුරට පැමිණෙම්වා!’ යැයි සිත පහළ වෙයි. ඔහු කය බිඳී, මරණින් මතු ගන්ධබ්බකායික දෙවියන්ගේ ඇසුරට පැමිණෙයි. මහණ, යමෙක් කය බිඳී, මරණින් මතු ගන්ධබ්බකායික දෙවියන්ගේ ඇසුරට පැමිණෙන්නේ, මෙයයි හේතුව, මෙයයි ප්‍රත්‍යය.’’ දෙවැන්නයි.",
      "paliTitle": "Sucaritasuttaṃ",
      "vagga": ""
    },
    {
      "number": 440,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā mūlagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. Tassa sutaṃ hoti – ‘mūlagandhe adhivatthā devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā mūlagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjeyya’nti. So dātā hoti mūlagandhānaṃ. So kāyassa bhedā paraṃ maraṇā mūlagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu… pe… yena midhekacco kāyassa bhedā paraṃ maraṇā mūlagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. Tatiyaṃ.",
      "english": "Sitting to one side, that monk said to the Blessed One, \"Venerable sir, what is the reason, what is the cause, by which a certain person here, with the breakup of the body, after death, reappears in companionship with the deities who dwell among the root-fragrances?\"\n\n\"Here, monk, a certain person engages in good conduct by body, good conduct by speech, and good conduct by mind. He has heard: 'The deities who dwell among the root-fragrances are long-lived, beautiful, and abound in happiness.' He thinks: 'Oh, may I, with the breakup of the body, after death, reappear in companionship with the deities who dwell among the root-fragrances!' He is a giver of root-fragrances. He, with the breakup of the body, after death, reappears in companionship with the deities who dwell among the root-fragrances. This, monk, is the reason, this is the cause, by which a certain person here, with the breakup of the body, after death, reappears in companionship with the deities who dwell among the root-fragrances.\"",
      "sinhala": "සැවැත්නුවරදීය.\n\nඑක් පසෙක වාඩි වී සිටි ඒ භික්‍ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “ස්වාමීනි, යම් පුද්ගලයෙක් කය බිඳී මරණයෙන් පසු මුල්සුවඳෙහි වසන දෙවියන්ගේ ඇසුරට පත්වන්නේද, ඒ සඳහා කුමන හේතුවක්ද, කුමන ප්‍රත්‍යයක්ද?” “මහණ, මෙහිලා සමහර පුද්ගලයෙක් කයින් සුචරිතයෙහි හැසිරෙයි, වචනයෙන් සුචරිතයෙහි හැසිරෙයි, මනසින් සුචරිතයෙහි හැසිරෙයි. ඔහුට මෙසේ අසන්නට ලැබේ: ‘මුල්සුවඳෙහි වසන දෙවියෝ දීර්ඝායුෂ්ක වෙති, වර්ණවත්ව වෙති, සැප බහුලව ඇත්තෝ වෙති’ කියා. ඔහුට මෙසේ සිතෙයි: ‘අහෝ, මම කය බිඳී මරණයෙන් පසු මුල්සුවඳෙහි වසන දෙවියන්ගේ ඇසුරට පත් වෙම්වා!’ කියා. ඔහු මුල්සුවඳ දන් දෙන්නෙක් වේ. ඔහු කය බිඳී මරණයෙන් පසු මුල්සුවඳෙහි වසන දෙවියන්ගේ ඇසුරට පත් වෙයි. මහණ, යම් පුද්ගලයෙක් කය බිඳී මරණයෙන් පසු මුල්සුවඳෙහි වසන දෙවියන්ගේ ඇසුරට පත්වන්නේද, ඒ සඳහා හේතුව මෙයයි, ප්‍රත්‍යය මෙයයි.”",
      "paliTitle": "Mūlagandhadātāsuttaṃ",
      "vagga": ""
    },
    {
      "number": 441,
      "numberRange": "441-449",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā sāragandhe adhivatthānaṃ devānaṃ…pe… pheggugandhe adhivatthānaṃ devānaṃ… tacagandhe adhivatthānaṃ devānaṃ… papaṭikagandhe adhivatthānaṃ devānaṃ… pattagandhe adhivatthānaṃ devānaṃ… pupphagandhe adhivatthānaṃ devānaṃ… phalagandhe adhivatthānaṃ devānaṃ… rasagandhe adhivatthānaṃ devānaṃ… gandhagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. Tassa sutaṃ hoti – ‘sāragandhe adhivatthā devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā sāragandhe adhivatthānaṃ devānaṃ…pe… pheggugandhe adhivatthānaṃ devānaṃ… tacagandhe adhivatthānaṃ devānaṃ… papaṭikagandhe adhivatthānaṃ devānaṃ… pattagandhe adhivatthānaṃ devānaṃ… pupphagandhe adhivatthānaṃ devānaṃ… phalagandhe adhivatthānaṃ devānaṃ… rasagandhe adhivatthānaṃ devānaṃ… gandhagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjeyya’nti. So dātā hoti sāragandhānaṃ…pe… so dātā hoti pheggugandhānaṃ… so dātā hoti tacagandhānaṃ… so dātā hoti papaṭikagandhānaṃ… so dātā hoti pattagandhānaṃ… so dātā hoti pupphagandhānaṃ… so dātā hoti phalagandhānaṃ… so dātā hoti rasagandhānaṃ… so dātā hoti gandhagandhānaṃ. So kāyassa bhedā paraṃ maraṇā gandhagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā gandhagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. Dvādasamaṃ.",
      "english": "At Sāvatthī. Sitting to one side, that bhikkhu said this to the Blessed One: “What, indeed, Venerable Sir, is the reason, what is the condition, by which a certain person here, upon the dissolution of the body, after death, is reborn into the company of devas whose fragrance is of the essence, or of the sapwood, or of the bark, or of the rind, or of the leaves, or of the flowers, or of the fruits, or of the flavors, or of scent itself?”\n\n“Here, bhikkhu, a certain person practices good conduct in body, good conduct in speech, and good conduct in mind. He hears: ‘The devas whose fragrance is of the essence are long-lived, beautiful, and abundant in happiness.’ Then he thinks: ‘Oh, may I, upon the dissolution of the body, after death, be reborn into the company of the devas whose fragrance is of the essence, or of the sapwood, or of the bark, or of the rind, or of the leaves, or of the flowers, or of the fruits, or of the flavors, or of scent itself.’ He is a giver of essence-fragrances, he is a giver of sapwood-fragrances, he is a giver of bark-fragrances, he is a giver of rind-fragrances, he is a giver of leaf-fragrances, he is a giver of flower-fragrances, he is a giver of fruit-fragrances, he is a giver of flavor-fragrances, he is a giver of scent-fragrances. Upon the dissolution of the body, after death, he is reborn into the company of the devas whose fragrance is of scent itself. This, bhikkhu, is the reason, this is the condition, by which a certain person here, upon the dissolution of the body, after death, is reborn into the company of the devas whose fragrance is of scent itself.”",
      "sinhala": "සැවැත් නුවරදී වදාළ සූත්‍රයකි.\n\nඑක් භික්ෂුවක් එකත්පසෙක වාඩි වී භාග්‍යවතුන් වහන්සේට මෙය පැවසුවා: “ස්වාමීනි, මේ ලෝකයේ සමහර පුද්ගලයෙක් කය බිඳී මරණයෙන් පසු සාරගන්ධයන්හි වාසය කරන දෙවියන් සමග, ඵෙග්ගුගන්ධයන්හි වාසය කරන දෙවියන් සමග, ත්වක්ගන්ධයන්හි වාසය කරන දෙවියන් සමග, පටිකගන්ධයන්හි වාසය කරන දෙවියන් සමග, පත්ගන්ධයන්හි වාසය කරන දෙවියන් සමග, පුෂ්පගන්ධයන්හි වාසය කරන දෙවියන් සමග, ඵලගන්ධයන්හි වාසය කරන දෙවියන් සමග, රසගන්ධයන්හි වාසය කරන දෙවියන් සමග, ගන්ධගන්ධයන්හි වාසය කරන දෙවියන් සමග සහබ්‍යතාවයට පත් වීමට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?”\n\n“මහණෙනි, මේ ලෝකයේ සමහර පුද්ගලයෙක් කයෙන් සුචරිතයෙහි හැසිරෙයි. වචනයෙන් සුචරිතයෙහි හැසිරෙයි. සිතින් සුචරිතයෙහි හැසිරෙයි. ඔහුට අසන්නට ලැබී ඇත: ‘සාරගන්ධයන්හි වාසය කරන දෙවියෝ දීර්ඝායුෂ්ක වෙති, වර්ණවත් වෙති, සැප බහුල වෙති.’ ඔහුට මෙසේ සිතේ: ‘අහෝ! මම කය බිඳී මරණයෙන් පසු සාරගන්ධයන්හි වාසය කරන දෙවියන් සමග, ඵෙග්ගුගන්ධයන්හි වාසය කරන දෙවියන් සමග, ත්වක්ගන්ධයන්හි වාසය කරන දෙවියන් සමග, පටිකගන්ධයන්හි වාසය කරන දෙවියන් සමග, පත්ගන්ධයන්හි වාසය කරන දෙවියන් සමග, පුෂ්පගන්ධයන්හි වාසය කරන දෙවියන් සමග, ඵලගන්ධයන්හි වාසය කරන දෙවියන් සමග, රසගන්ධයන්හි වාසය කරන දෙවියන් සමග, ගන්ධගන්ධයන්හි වාසය කරන දෙවියන් සමග සහබ්‍යතාවයට පත් වුවහොත් හොඳය!’ ඔහු සාරගන්ධයන් දන් දෙන්නෙක් වෙයි. ඵෙග්ගුගන්ධයන් දන් දෙන්නෙක් වෙයි. ත්වක්ගන්ධයන් දන් දෙන්නෙක් වෙයි. පටිකගන්ධයන් දන් දෙන්නෙක් වෙයි. පත්ගන්ධයන් දන් දෙන්නෙක් වෙයි. පුෂ්පගන්ධයන් දන් දෙන්නෙක් වෙයි. ඵලගන්ධයන් දන් දෙන්නෙක් වෙයි. රසගන්ධයන් දන් දෙන්නෙක් වෙයි. ගන්ධගන්ධයන් දන් දෙන්නෙක් වෙයි. ඔහු කය බිඳී මරණයෙන් පසු ගන්ධගන්ධයන්හි වාසය කරන දෙවියන් සමග සහබ්‍යතාවයට පත් වෙයි. මහණෙනි, මේ පුද්ගලයා කය බිඳී මරණයෙන් පසු ගන්ධගන්ධයන්හි වාසය කරන දෙවියන් සමග සහබ්‍යතාවයට පත් වීමට හේතුව මෙයයි, ප්‍රත්‍යය මෙයයි.”",
      "paliTitle": "Sāragandhādidātāsuttanavakaṃ",
      "vagga": ""
    },
    {
      "number": 450,
      "numberRange": "450-459",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā mūlagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. Tassa sutaṃ hoti – ‘mūlagandhe adhivatthā devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā mūlagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti…pe… pānaṃ deti… vatthaṃ deti… yānaṃ deti… mālaṃ deti… gandhaṃ deti… vilepanaṃ deti… seyyaṃ deti… āvasathaṃ deti… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā mūlagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā mūlagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. Bāvīsatimaṃ.",
      "english": "Seated to one side, that bhikkhu said to the Blessed One: \"What, venerable sir, is the reason, what is the cause, by which a certain individual here, with the breakup of the body, after death, is reborn into the companionship of the deities dwelling in root fragrances?\"\n\n\"Here, bhikkhu, a certain individual practices good conduct with the body, practices good conduct with speech, and practices good conduct with the mind. It is heard by him: 'The deities dwelling in root fragrances are long-lived, beautiful, and abound in happiness.' He thinks: 'Oh, if only I, with the breakup of the body, after death, could be reborn into the companionship of the deities dwelling in root fragrances!' He gives food, he gives drink, he gives clothing, he gives vehicles, he gives garlands, he gives perfumes, he gives unguents, he gives beds and lodgings, he gives residences, he gives lights. He, with the breakup of the body, after death, is reborn into the companionship of the deities dwelling in root fragrances. This, bhikkhu, is the reason, this is the cause, by which a certain individual here, with the breakup of the body, after death, is reborn into the companionship of the deities dwelling in root fragrances.\"",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලදී.\n\nඑකත්පස්ව හුන් ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘ස්වාමීනී, කවර හෙතුවක් නිසාද, කවර ප්‍රත්‍යයක් නිසාද, යම් පුද්ගලයෙක් මෙලොව ශරීරය බිඳී මරණින් මතු මූලගන්ධයන්හි අධිවාසී දෙවියන්ගේ සහාය ලබා උපදින්නේ?’’\n\n‘‘මෙහිලා මහණ, යම් පුද්ගලයෙක් කයින් සුචරිතයෙහි හැසිරෙයි, වචනයෙන් සුචරිතයෙහි හැසිරෙයි, සිතින් සුචරිතයෙහි හැසිරෙයි. ඔහුට මෙසේ අසන්නට ලැබේ: ‘මූලගන්ධයන්හි අධිවාසී දෙවියෝ දීර්ඝායුෂ්ක වෙති, වර්ණවත් වෙති, සැප බහුල වෙති.’ ඔහුට මෙසේ සිතේ: ‘අහෝ! මමද ශරීරය බිඳී මරණින් මතු මූලගන්ධයන්හි අධිවාසී දෙවියන්ගේ සහාය ලබා උපදින්නෙම් නම්!’ ඔහු ආහාර දෙයි, පාන වර්ග දෙයි, වස්ත්‍ර දෙයි, යාන වාහන දෙයි, මල්මාලා දෙයි, සුවඳ වර්ග දෙයි, විලවුන් දෙයි, සයනාසන දෙයි, ආවාස දෙයි, පහන් ආලෝකය දෙයි. ඔහු ශරීරය බිඳී මරණින් මතු මූලගන්ධයන්හි අධිවාසී දෙවියන්ගේ සහාය ලබා උපදී. මහණ, යම් පුද්ගලයෙක් මෙලොව ශරීරය බිඳී මරණින් මතු මූලගන්ධයන්හි අධිවාසී දෙවියන්ගේ සහාය ලබා උපදින්නේ මේ හෙතුව නිසාය, මේ ප්‍රත්‍යය නිසාය.’’",
      "paliTitle": "Mūlagandhadānūpakārasuttadasakaṃ",
      "vagga": ""
    },
    {
      "number": 460,
      "numberRange": "460-549",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā sāragandhe adhivatthānaṃ devānaṃ…pe… pheggugandhe adhivatthānaṃ devānaṃ… tacagandhe adhivatthānaṃ devānaṃ … papaṭikagandhe adhivatthānaṃ devānaṃ… pattagandhe adhivatthānaṃ devānaṃ… pupphagandhe adhivatthānaṃ devānaṃ… phalagandhe adhivatthānaṃ devānaṃ… rasagandhe adhivatthānaṃ devānaṃ… gandhagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena sucaritaṃ carati, vācāya sucaritaṃ carati, manasā sucaritaṃ carati. Tassa sutaṃ hoti – ‘gandhagandhe adhivatthā devā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā gandhagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti…pe… pānaṃ deti… vatthaṃ deti… yānaṃ deti… mālaṃ deti… gandhaṃ deti… vilepanaṃ deti… seyyaṃ deti… āvasathaṃ deti… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā gandhagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā gandhagandhe adhivatthānaṃ devānaṃ sahabyataṃ upapajjatī’’ti. Dvādasasatimaṃ. (Evaṃ piṇḍakena ekasatañca dvādasa ca suttantā honti.) ",
      "english": "That bhikkhu, seated to one side, said this to the Blessed One: “What, venerable sir, is the cause, what is the reason, by which some individual here, with the breakup of the body, after death, reappears in companionship with the gods who dwell among the heartwood-fragrances, the gods who dwell among the sapwood-fragrances, the gods who dwell among the bark-fragrances, the gods who dwell among the flake-fragrances, the gods who dwell among the leaf-fragrances, the gods who dwell among the flower-fragrances, the gods who dwell among the fruit-fragrances, the gods who dwell among the sap-fragrances, or the gods who dwell among the pure fragrances?”\n\n“Here, bhikkhu, some individual performs good conduct with body, good conduct with speech, and good conduct with mind. He hears: ‘The gods who dwell among the pure fragrances are long-lived, beautiful, and abound in happiness.’ He thinks: ‘Oh, may I, with the breakup of the body, after death, reappear in companionship with the gods who dwell among the pure fragrances!’ He gives food, gives drink, gives clothing, gives vehicles, gives garlands, gives fragrances, gives ointments, gives beds, gives dwellings, and gives lamps. He, with the breakup of the body, after death, reappears in companionship with the gods who dwell among the pure fragrances. This, bhikkhu, is the cause, this is the reason, by which some individual here, with the breakup of the body, after death, reappears in companionship with the gods who dwell among the pure fragrances.”",
      "sinhala": "සැවැත්නුවරදීය. එක් පසෙක වැඩ සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: “භාග්‍යවතුන් වහන්ස, යමෙක් කය බිඳී මරණින් මතු, සාරගන්ධයන්හි අධිවූ දෙවියන්ගේද, පෙග්ගුගන්ධයන්හි අධිවූ දෙවියන්ගේද, ත්වචාගන්ධයන්හි අධිවූ දෙවියන්ගේද, පපටිකාගන්ධයන්හි අධිවූ දෙවියන්ගේද, පත්‍රගන්ධයන්හි අධිවූ දෙවියන්ගේද, පුෂ්පගන්ධයන්හි අධිවූ දෙවියන්ගේද, ඵලගන්ධයන්හි අධිවූ දෙවියන්ගේද, රසගන්ධයන්හි අධිවූ දෙවියන්ගේද, ගන්ධගන්ධයන්හි අධිවූ දෙවියන්ගේද සහභාවයට උපදින්නේ යම් හෙයකින්ද, යම් ප්‍රත්‍යයකින්ද, ඒ හේතුව කුමක්ද, ඒ ප්‍රත්‍යය කුමක්ද?”\n\n“මහණ, මෙහිලා යමෙක් කයින් සුචරිතයෙහි හැසිරෙයි, වචනයෙන් සුචරිතයෙහි හැසිරෙයි, සිතින් සුචරිතයෙහි හැසිරෙයි. ඔහුට අසන්නට ලැබේ: ‘ගන්ධගන්ධයන්හි අධිවූ දෙවියෝ දීර්ඝායුෂ්ක වෙති, වර්ණවත් වෙති, සැප බහුල වෙති’යි. ඔහුට මෙසේ සිතක් ඇතිවේ: ‘අහෝ! මම කය බිඳී මරණින් මතු ගන්ධගන්ධයන්හි අධිවූ දෙවියන්ගේ සහභාවයට පැමිණිය හොත් හොඳයි’යි. ඔහු ආහාර දේ, පාන දේ, වස්ත්‍ර දේ, යාන දේ, මල් දේ, ගන්ධ දේ, විලේවන දේ, සයන දේ, ආවාස දේ, ප්‍රදීප දේ. ඔහු කය බිඳී මරණින් මතු ගන්ධගන්ධයන්හි අධිවූ දෙවියන්ගේ සහභාවයට උපදී. මහණ, කය බිඳී මරණින් මතු යමෙක් ගන්ධගන්ධයන්හි අධිවූ දෙවියන්ගේ සහභාවයට උපදින්නේ යම් හෙයකින්ද, යම් ප්‍රත්‍යයකින්ද, ඒ හේතුවද, ඒ ප්‍රත්‍යයද මෙයයි.”",
      "paliTitle": "Sāragandhādidānūpakārasuttanavutikaṃ",
      "vagga": ""
    }
  ],
  "footer": {
    "pali": "Gandhabbakāyasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Suddhikañca sucaritaṃ, dātā hi apare dasa; Dānūpakārā satadhā, gandhabbe suppakāsitāti.",
    "english": "",
    "sinhala": ""
  }
}