{
  "id": "sn.3.6",
  "title": {
    "pali": "Kilesasaṃyuttaṃ",
    "english": "Connected Discourses on Defilements",
    "sinhala": "ක්ලේශ සංයුක්තය"
  },
  "sections": [
    {
      "number": 322,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, cakkhusmiṃ chandarāgo, cittasseso upakkileso. Yo sotasmiṃ chandarāgo, cittasseso upakkileso. Yo ghānasmiṃ chandarāgo, cittasseso upakkileso. Yo jivhāya chandarāgo, cittasseso upakkileso. Yo kāyasmiṃ chandarāgo, cittasseso upakkileso. Yo manasmiṃ chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno imesu chasu ṭhānesu cetaso upakkileso pahīno hoti, nekkhammaninnañcassa cittaṃ hoti. Nekkhammaparibhāvitaṃ cittaṃ kammaniyaṃ khāyati, abhiññā sacchikaraṇīyesu dhammesū’’ti. Paṭhamaṃ.",
      "english": "At Sāvatthī. \"Monks, whatever lustful desire there is for the eye, that is a defilement of the mind. Whatever lustful desire there is for the ear, that is a defilement of the mind. Whatever lustful desire there is for the nose, that is a defilement of the mind. Whatever lustful desire there is for the tongue, that is a defilement of the mind. Whatever lustful desire there is for the body, that is a defilement of the mind. Whatever lustful desire there is for the mind, that is a defilement of the mind.\n\nBut when, monks, a monk's defilement of the mind concerning these six bases has been abandoned, then his mind becomes inclined towards renunciation. A mind developed by renunciation is seen as workable for the direct realization of those states that are to be directly realized.\"",
      "sinhala": "සැවැත්නුවරදී. මහණෙනි, ඇසෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. කනෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. නාසයෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. දිවෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. කයෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. මනසෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. මහණෙනි, යම් කලක භික්ෂුවකට මේ ස්ථාන හයෙහි ඇති සිතේ උපක්ලේශය ප්‍ර‌හීණ වේද, ඔහුගේ සිත නෙක්ඛම්මයට නැඹුරු වේ. නෙක්ඛම්මයෙන් වැඩූ සිත, අභිඥාවෙන් සාක්ෂාත් කළ යුතු ධ‌ර්මයන්හිදී ක්‍ර‌ියාශීලී බව පෙනේ. පළමුවනයි.",
      "paliTitle": "Cakkhusuttaṃ",
      "vagga": "",
      "englishTitle": "The Eye Discourse",
      "sinhalaTitle": "ඇස සූත‍්‍රය"
    },
    {
      "number": 323,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, rūpesu chandarāgo, cittasseso upakkileso. Yo saddesu… yo gandhesu… yo rasesu… yo phoṭṭhabbesu… yo dhammesu chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno imesu chasu ṭhānesu cetaso upakkileso pahīno hoti, nekkhammaninnañcassa cittaṃ hoti. Nekkhammaparibhāvitaṃ cittaṃ kammaniyaṃ khāyati, abhiññā sacchikaraṇīyesu dhammesū’’ti. Dutiyaṃ.",
      "english": "Monks, whatever passionate desire there is for forms, this is a defilement of the mind. Whatever passionate desire there is for sounds, whatever for smells, whatever for tastes, whatever for tactile objects, whatever for mental phenomena, this is a defilement of the mind.\n\nWhen, monks, a monk's mental defilement concerning these six bases has been abandoned, his mind inclines to renunciation. A mind thoroughly cultivated with renunciation appears pliable and fit for the direct realization of those states that are to be understood through higher knowledge.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nමහණෙනි, රූපයන් කෙරෙහි යම් ඡන්දරාගයක් ඇත්ද, එය සිතෙහි උපක්ලේශයකි. ශබ්දයන් කෙරෙහි යම් ඡන්දරාගයක් ඇත්ද, එය සිතෙහි උපක්ලේශයකි. ගන්ධයන් කෙරෙහි යම් ඡන්දරාගයක් ඇත්ද, එය සිතෙහි උපක්ලේශයකි. රසයන් කෙරෙහි යම් ඡන්දරාගයක් ඇත්ද, එය සිතෙහි උපක්ලේශයකි. ස්පර්ශයන් කෙරෙහි යම් ඡන්දරාගයක් ඇත්ද, එය සිතෙහි උපක්ලේශයකි. මනෝභාවයන් කෙරෙහි යම් ඡන්දරාගයක් ඇත්ද, එය සිතෙහි උපක්ලේශයකි. මහණෙනි, යම් කලෙක භික්ෂුවකගේ මේ ස්ථාන සයෙහි සිතෙහි උපක්ලේශය ප‍්‍රහීණ වෙයිද, ඔහුගේ සිත නෛෂ්ක‍්‍රම‍්‍යයට නැඹුරු වෙයි. නෛෂ්ක‍්‍රම‍්‍යයෙන් පුරුදු කරන ලද සිත, අභිඥාවෙන් සාක්ෂාත් කළ යුතු ධර්මයන් පිණිස ක‍්‍රියා කිරීමට සුදුසු වෙයි.\n\nදෙවෙනිය.",
      "paliTitle": "Rūpasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Form",
      "sinhalaTitle": "රූප සූත‍්‍රය"
    },
    {
      "number": 324,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, cakkhuviññāṇasmiṃ chandarāgo, cittasseso upakkileso. Yo sotaviññāṇasmiṃ… yo ghānaviññāṇasmiṃ… yo jivhāviññāṇasmiṃ… yo kāyaviññāṇasmiṃ… yo manoviññāṇasmiṃ chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno imesu chasu ṭhānesu cetaso upakkileso pahīno hoti, nekkhammaninnañcassa cittaṃ hoti. Nekkhammaparibhāvitaṃ cittaṃ kammaniyaṃ khāyati, abhiññā sacchikaraṇīyesu dhammesū’’ti. Tatiyaṃ.",
      "english": "At Sāvatthī.\n\nMonks, whatever desire and lust there is in eye-consciousness, that is a defilement of the mind. Whatever desire and lust there is in ear-consciousness, whatever desire and lust there is in nose-consciousness, whatever desire and lust there is in tongue-consciousness, whatever desire and lust there is in body-consciousness, whatever desire and lust there is in mind-consciousness—that is a defilement of the mind.\n\nMonks, when a monk has abandoned the defilement of the mind in these six instances, his mind inclines towards renunciation. A mind imbued with renunciation becomes pliable for direct knowledge of those qualities that are to be realized.",
      "sinhala": "සැවැත්නුවර අරභයායි. මහණෙනි, චක්ඛු විඤ්ඤාණයෙහි යම් ඡන්දරාගයක් වේද, එය සිතේ උපක්ලේශයකි. යම් ශ්‍රවණවිඤ්ඤාණයෙහි ඡන්දරාගයක් වේද, යම් ඝාණවිඤ්ඤාණයෙහි ඡන්දරාගයක් වේද, යම් ජිව්හාවිඤ්ඤාණයෙහි ඡන්දරාගයක් වේද, යම් කායවිඤ්ඤාණයෙහි ඡන්දරාගයක් වේද, යම් මනෝවිඤ්ඤාණයෙහි ඡන්දරාගයක් වේද, එය සිතේ උපක්ලේශයකි.\n\nමහණෙනි, යම් කලක භික්ෂුවකට මේ ස්ථාන හයෙහි ඇති සිතේ උපක්ලේශය ප්‍රහීණ වේද, එවිට ඔහුගේ සිත නෙක්ඛම්මයට නැඹුරු වේ. නෙක්ඛම්මයෙන් පිරිපුන් වූ සිත, අභිඥාවෙන් අවබෝධ කළ යුතු ධර්මයන් සාක්ෂාත් කිරීම සඳහා කර්මණ්‍ය වේ.",
      "paliTitle": "Viññāṇasuttaṃ",
      "vagga": "",
      "englishTitle": "Consciousness Sutta",
      "sinhalaTitle": "විඤ්ඤාණ සූත්‍රය"
    },
    {
      "number": 325,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, cakkhusamphassasmiṃ chandarāgo, cittasseso upakkileso. Yo sotasamphassasmiṃ… yo ghānasamphassasmiṃ… yo jivhāsamphassasmiṃ… yo kāyasamphassasmiṃ… yo manosamphassasmiṃ chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno…pe… abhiññā sacchikaraṇīyesu dhammesū’’ti. Catutthaṃ.",
      "english": "At Sāvatthī. O monks, whatever desire-passion concerning eye-contact is a defilement of the mind. Whatever desire-passion concerning ear-contact is a defilement of the mind. Whatever desire-passion concerning nose-contact is a defilement of the mind. Whatever desire-passion concerning tongue-contact is a defilement of the mind. Whatever desire-passion concerning body-contact is a defilement of the mind. Whatever desire-passion concerning mind-contact is a defilement of the mind.\n\nWhen, O monks, for a monk, whatever desire-passion concerning eye-contact has been abandoned, uprooted, made like a palm-stump, brought to non-existence, not liable to arise again in the future; whatever desire-passion concerning ear-contact has been abandoned, uprooted, made like a palm-stump, brought to non-existence, not liable to arise again in the future; whatever desire-passion concerning nose-contact has been abandoned, uprooted, made like a palm-stump, brought to non-existence, not liable to arise again in the future; whatever desire-passion concerning tongue-contact has been abandoned, uprooted, made like a palm-stump, brought to non-existence, not liable to arise again in the future; whatever desire-passion concerning body-contact has been abandoned, uprooted, made like a palm-stump, brought to non-existence, not liable to arise again in the future; and whatever desire-passion concerning mind-contact has been abandoned, uprooted, made like a palm-stump, brought to non-existence, not liable to arise again in the future—then, such a monk is said to have attained direct knowledge concerning those phenomena that are to be realized.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n“මහණෙනි, යම්කිසි ඇසෙහි ස්පර්ශයෙහි ඇලීමක්, ආශාවක් (ඡන්දරාගයක්) ඇත්ද, එය සිතෙහි උපක්ලේශයකි. එසේම කනෙහි ස්පර්ශයෙහි… නාසයෙහි ස්පර්ශයෙහි… දිවෙහි ස්පර්ශයෙහි… කයෙහි ස්පර්ශයෙහි… මනසෙහි ස්පර්ශයෙහි යම් ඇලීමක්, ආශාවක් (ඡන්දරාගයක්) ඇත්ද, එයද සිතෙහි උපක්ලේශයකි.\n\nමහණෙනි, යම් කලෙක භික්‍ෂුවකගේ ඇසෙහි ස්පර්ශයෙහි උපදින ඡන්දරාගය ප්‍රහීණ කරනු ලැබ, මුලින් උදුරා දමා, තල් කඳක් මෙන් නෂ්ට කර, නැවත ඇති නොවීමට සලස්වා ගනීද; එසේම කන, නාසය, දිව, කය සහ මනස යන ඉන්ද්‍රියන්ගේ ස්පර්ශයෙහි උපදින ඡන්දරාගයද මෙලෙසින්ම ප්‍රහීණ කර ගනීද, (එසේ වූ විට) ඔහු ප්‍රත්‍යක්‍ෂ වශයෙන් අවබෝධ කළ යුතු ධර්මයන් අභිඥාවෙන් අවබෝධ කරයි යැයි මම කියමි.”\nසතරවෙනි සූත්‍රයයි.",
      "paliTitle": "Samphassasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Contact",
      "sinhalaTitle": "සම්පර්ශ සූත්‍රය"
    },
    {
      "number": 326,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, cakkhusamphassajāya vedanāya chandarāgo, cittasseso upakkileso. Yo sotasamphassajāya vedanāya… yo ghānasamphassajāya vedanāya… yo jivhāsamphassajāya vedanāya… yo kāyasamphassajāya vedanāya… yo manosamphassajāya vedanāya chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno…pe… abhiññā sacchikaraṇīyesu dhammesū’’ti. Pañcamaṃ.",
      "english": "At Sāvatthī. Monks, whatever sensual desire and passion there is for the feeling arisen from eye-contact, that is a mental defilement. Whatever sensual desire and passion there is for the feeling arisen from ear-contact, for the feeling arisen from nose-contact, for the feeling arisen from tongue-contact, for the feeling arisen from body-contact, or for the feeling arisen from mind-contact — that is a mental defilement.\n\nWhen, Monks, a monk has abandoned sensual desire and passion for the feeling arisen from eye-contact, for the feeling arisen from ear-contact, for the feeling arisen from nose-contact, for the feeling arisen from tongue-contact, for the feeling arisen from body-contact, and for the feeling arisen from mind-contact, and thus his mind is rightly liberated; then such a monk, with a rightly liberated mind, attains direct knowledge regarding those states that are to be realized.",
      "sinhala": "සැවැත් නුවරදී වදාළ සූත්‍රයයි.\n\nභික්ෂූන් වහන්ස, චක්ෂුඃසම්ඵස්සයෙන් (ඇස හා රූප ගැටීමෙන්) හටගන්නා වේදනාව කෙරෙහි යම් ඡන්දරාගයක් (කැමැත්තක් හා දැඩි ඇල්මක්) වේද, එය සිතේ උපක්ලේශයකි (කෙලෙස් උපදවන්නකි). ශ්‍ර‍ෝතසම්ඵස්සයෙන් (කණ හා ශබ්ද ගැටීමෙන්) හටගන්නා වේදනාව කෙරෙහි යම් ඡන්දරාගයක් වේද, ඝ්‍ර‍ාණසම්ඵස්සයෙන් (නාසය හා ගඳ ගැටීමෙන්) හටගන්නා වේදනාව කෙරෙහි යම් ඡන්දරාගයක් වේද, ජිව්හාසම්ඵස්සයෙන් (දිව හා රස ගැටීමෙන්) හටගන්නා වේදනාව කෙරෙහි යම් ඡන්දරාගයක් වේද, කායසම්ඵස්සයෙන් (කය හා ස්පර්ශය ගැටීමෙන්) හටගන්නා වේදනාව කෙරෙහි යම් ඡන්දරාගයක් වේද, මනෝසම්ඵස්සයෙන් (මනස හා ධ‍ර‍්මාරම්මණය ගැටීමෙන්) හටගන්නා වේදනාව කෙරෙහි යම් ඡන්දරාගයක් වේද, ඒ සියල්ල සිතේ උපක්ලේශයකි.\n\nභික්ෂූන් වහන්ස, යම් කලෙක භික්ෂුවක් විසින් මේ චක්ෂුඃසම්ඵස්සයෙන් හටගන්නා වේදනාව ආදී වූ වේදනා කෙරෙහි වූ ඡන්දරාගය ප්‍ර‍හීණ කරනු ලැබේ ද, සිඳලනු ලැබේ ද, නිරුද්ධ කරනු ලැබේ ද, එවිට ඔහුට විශේෂ ඥානයෙන් (අභිඤ්ඤාවෙන්) සාක්ෂාත් කළ යුතු ධ‍ර‍්මයන් ප්‍ර‍ත‍්යක්ෂ වේ.",
      "paliTitle": "Samphassajasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Contact-Arising",
      "sinhalaTitle": "සම්ඵස්සජ සූත‍්‍රය"
    },
    {
      "number": 327,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, rūpasaññāya chandarāgo, cittasseso upakkileso. Yo saddasaññāya… yo gandhasaññāya… yo rasasaññāya… yo phoṭṭhabbasaññāya… yo dhammasaññāya chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno…pe… abhiññā sacchikaraṇīyesu dhammesū’’ti. Chaṭṭhaṃ.",
      "english": "At Sāvatthī.\n\n“Monks, whatever desirous passion there is with regard to the perception of forms, that is a defilement of the mind. Whatever desirous passion there is with regard to the perception of sounds, that is a defilement of the mind. Whatever desirous passion there is with regard to the perception of smells, that is a defilement of the mind. Whatever desirous passion there is with regard to the perception of tastes, that is a defilement of the mind. Whatever desirous passion there is with regard to the perception of tactile sensations, that is a defilement of the mind. Whatever desirous passion there is with regard to the perception of mental phenomena, that is a defilement of the mind.\n\nWhen, monks, a bhikkhu has abandoned these defilements of the mind, then his mind becomes ready for the direct knowledge of those states that are to be directly realized.”",
      "sinhala": "නිදානය සැවැත්නුවරදීය. මහණෙනි, රූප සංඥාවෙහි යම් ඇල්ම මුසු ආශාවක් (ඡන්දරාගයක්) ඇද්ද, එය සිතෙහි උපක‍්ලේශයකි. ශබ්‍#zwj;ද සංඥාවෙහි යම් ඇල්ම මුසු ආශාවක් ඇද්ද, ගන්ධ සංඥාවෙහි යම් ඇල්ම මුසු ආශාවක් ඇද්ද, රස සංඥාවෙහි යම් ඇල්ම මුසු ආශාවක් ඇද්ද, ඵොට්ඨබ්බ සංඥාවෙහි යම් ඇල්ම මුසු ආශාවක් ඇද්ද, ධර‍්ම සංඥාවෙහි යම් ඇල්ම මුසු ආශාවක් ඇද්ද, එය සිතෙහි උපක‍්ලේශයකි. මහණෙනි, යම් කලෙක භික්‍#zwj;ෂුවකට රූප සංඥාවෙහි ඇල්ම මුසු ආශාව (ඡන්දරාගය) ප‍්‍රහීණ වේද, ශබ්‍#zwj;ද සංඥාවෙහි ඇල්ම මුසු ආශාව ප‍්‍රහීණ වේද, ගන්ධ සංඥාවෙහි ඇල්ම මුසු ආශාව ප‍්‍රහීණ වේද, රස සංඥාවෙහි ඇල්ම මුසු ආශාව ප‍්‍රහීණ වේද, ඵොට්ඨබ්බ සංඥාවෙහි ඇල්ම මුසු ආශාව ප‍්‍රහීණ වේද, ධර‍්ම සංඥාවෙහි ඇල්ම මුසු ආශාව ප‍්‍රහීණ වේද, හේ උපශාන්ත වූ උපක‍්ලේශයන් සහිතව අභිඥාවෙන් සාක්‍#zwj;ෂාත් කළ යුතු ධර‍්මයන් අවබෝධ කරයි.",
      "paliTitle": "Saññāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Perception",
      "sinhalaTitle": "සඤ්ඤා සූත්‍රය"
    },
    {
      "number": 328,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, rūpasañcetanāya chandarāgo, cittasseso upakkileso. Yo saddasañcetanāya… yo gandhasañcetanāya… yo rasasañcetanāya… yo phoṭṭhabbasañcetanāya… yo dhammasañcetanāya chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno…pe… abhiññā sacchikaraṇīyesu dhammesū’’ti. Sattamaṃ.",
      "english": "Monks, whatever sensual desire and passion there is concerning the mental intention towards forms, that is a defilement of the mind. Whatever sensual desire and passion there is concerning the mental intention towards sounds, that is a defilement of the mind. Whatever sensual desire and passion there is concerning the mental intention towards smells, that is a defilement of the mind. Whatever sensual desire and passion there is concerning the mental intention towards tastes, that is a defilement of the mind. Whatever sensual desire and passion there is concerning the mental intention towards tactile objects, that is a defilement of the mind. Whatever sensual desire and passion there is concerning the mental intention towards mental phenomena, that is a defilement of the mind.\n\nIndeed, Monks, when for a monk, whatever sensual desire and passion there is concerning the mental intention towards forms has been abandoned, whatever sensual desire and passion there is concerning the mental intention towards sounds has been abandoned, whatever sensual desire and passion there is concerning the mental intention towards smells has been abandoned, whatever sensual desire and passion there is concerning the mental intention towards tastes has been abandoned, whatever sensual desire and passion there is concerning the mental intention towards tactile objects has been abandoned, and whatever sensual desire and passion there is concerning the mental intention towards mental phenomena has been abandoned, then he comes to direct knowledge of those states that are to be realized.",
      "sinhala": "සැවැත් නුවරදී යි.\n\nමහණෙනි, රූප පිළිබඳ චේතනාව ඇසුරු කොට ඇති යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. ශබ්ද පිළිබඳ චේතනාව ඇසුරු කොට ඇති යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. ගන්ධ පිළිබඳ චේතනාව ඇසුරු කොට ඇති යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. රස පිළිබඳ චේතනාව ඇසුරු කොට ඇති යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. ස්පර්ශ පිළිබඳ චේතනාව ඇසුරු කොට ඇති යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. ධර්ම (මනෝමය) පිළිබඳ චේතනාව ඇසුරු කොට ඇති යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. යම් කලක, මහණෙනි, භික්ෂුවකට මේ උපක්ලේශ ධර්මයන් ප්‍ර​හීණ වීමෙන් සිත විමුක්ත වේද, එතකොට ඔහුට අභිඥාවෙන් සාක්ෂාත් කළ යුතු ධර්මයන් සාක්ෂාත් කිරීමට හැකියාව ලැබේ.",
      "paliTitle": "Sañcetanāsuttaṃ",
      "vagga": "",
      "englishTitle": "The Discourse on Intention",
      "sinhalaTitle": "සංචේතනා සූත්‍රය"
    },
    {
      "number": 329,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, rūpataṇhāya chandarāgo, cittasseso upakkileso. Yo saddataṇhāya… yo gandhataṇhāya… yo rasataṇhāya… yo phoṭṭhabbataṇhāya… yo dhammataṇhāya chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno…pe… abhiññā sacchikaraṇīyesu dhammesū’’ti. Aṭṭhamaṃ.",
      "english": "At Sāvatthī.\n\nMonks, whatever desire and passion there is for craving for forms, that is a defilement of the mind. Whatever desire and passion there is for craving for sounds, whatever desire and passion there is for craving for smells, whatever desire and passion there is for craving for tastes, whatever desire and passion there is for craving for tactile objects, whatever desire and passion there is for craving for mental phenomena – that is a defilement of the mind. But when, monks, a monk has fully abandoned such desire and passion for craving for forms, for craving for sounds, for craving for smells, for craving for tastes, for craving for tactile objects, and for craving for mental phenomena, then he attains direct knowledge of the truths that are to be realized.",
      "sinhala": "මහණෙනි, යම් රූපතණ්හාවක් කෙරෙහි ඡන්දරාගයක් ඇත්ද, එය සිතෙහි උපක්ලේශයකි. යම් ශබ්දතණ්හාවක් කෙරෙහිද, යම් ගන්ධතණ්හාවක් කෙරෙහිද, යම් රසතණ්හාවක් කෙරෙහිද, යම් ස්පර්ශතණ්හාවක් කෙරෙහිද, යම් ධර්‌මතණ්හාවක් කෙරෙහිද ඡන්දරාගයක් ඇත්ද, එය සිතෙහි උපක්ලේශයකි. මහණෙනි, යම් භික්ෂුවකට මේ සිත්හි උපක්ලේශයන් ප්‌රහීණ වේද, හේ එවිට සාක්ෂාත් කළ යුතු ධර්‌මයන්හි අභිඤ්‌ඤා ඥානයෙන් යුක්ත වේ.",
      "paliTitle": "Taṇhāsuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Craving",
      "sinhalaTitle": "තණ‍්හා සූත්‍‍රය"
    },
    {
      "number": 330,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, pathavīdhātuyā chandarāgo, cittasseso upakkileso. Yo āpodhātuyā… yo tejodhātuyā… yo vāyodhātuyā… yo ākāsadhātuyā… yo viññāṇadhātuyā chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno imesu chasu ṭhānesu cetaso upakkileso pahīno hoti, nekkhammaninnañcassa cittaṃ hoti. Nekkhammaparibhāvitaṃ cittaṃ kammaniyaṃ khāyati, abhiññā sacchikaraṇīyesu dhammesū’’ti. Navamaṃ.",
      "english": "At Sāvatthī. Monks, whatever passionate desire there is for the earth element, this is a defilement of the mind. Whatever passionate desire there is for the water element… for the fire element… for the wind element… for the space element… whatever passionate desire there is for the consciousness element, this is a defilement of the mind. Monks, when a monk has abandoned the mind's defilement in these six bases, his mind inclines towards renunciation. A mind imbued with renunciation becomes workable, fit for the direct realization of those states that are to be directly known.",
      "sinhala": "සැවැත් නුවරදී වදාළා වූ සූත්‍රයකි.\n\nමහණෙනි, පඨවි ධාතුව කෙරෙහි යම් ඡන්‍දරාගයක් ඇද්ද, එය සිතේ උපක්‍ලේශයකි. ආපෝ ධාතුව කෙරෙහි යම් ඡන්‍දරාගයක් ඇද්ද, එය සිතේ උපක්‍ලේශයකි. තේජෝ ධාතුව කෙරෙහි යම් ඡන්‍දරාගයක් ඇද්ද, එය සිතේ උපක්‍ලේශයකි. වායෝ ධාතුව කෙරෙහි යම් ඡන්‍දරාගයක් ඇද්ද, එය සිතේ උපක්‍ලේශයකි. ආකාශ ධාතුව කෙරෙහි යම් ඡන්‍දරාගයක් ඇද්ද, එය සිතේ උපක්‍ලේශයකි. විඤ්ඤාණ ධාතුව කෙරෙහි යම් ඡන්‍දරාගයක් ඇද්ද, එය සිතේ උපක්‍ලේශයකි.\n\nමහණෙනි, යම් කලෙක භික්ෂුවකගේ මේ ධාතු හය කෙරෙහි පවතින සිතේ උපක්‍ලේශය ප්‍ර‍හීණ වීද, ඔහුගේ සිත නෙක්ඛම්මය කෙරෙහි නැඹුරු වෙයි.\n\nනෙක්ඛම්මයෙන් පිරිසුදු වූ සිත අභිඥාවෙන් සාක්‍ෂාත් කළ යුතු ධර්‍මයන් සාක්‍ෂාත් කිරීම සඳහා කර්‍මණීය බවට පත්වෙයි.",
      "paliTitle": "Dhātusuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on Elements",
      "sinhalaTitle": "ධාතු සූත්‍රය"
    },
    {
      "number": 331,
      "pali": "Sāvatthinidānaṃ. ‘‘Yo, bhikkhave, rūpasmiṃ chandarāgo, cittasseso upakkileso…pe… yo viññāṇasmiṃ chandarāgo, cittasseso upakkileso. Yato kho, bhikkhave, bhikkhuno imesu pañcasu ṭhānesu cetaso upakkileso pahīno hoti, nekkhammaninnañcassa cittaṃ hoti. Nekkhammaparibhāvitaṃ cittaṃ kammaniyaṃ khāyati, abhiññā sacchikaraṇīyesu dhammesū’’ti. Dasamaṃ. ",
      "english": "Monks, whatever desire and lust there is for form, that is a defilement of the mind. Whatever desire and lust there is for feeling, that is a defilement of the mind. Whatever desire and lust there is for perception, that is a defilement of the mind. Whatever desire and lust there is for mental formations, that is a defilement of the mind. Whatever desire and lust there is for consciousness, that is a defilement of the mind.\n\nWhen, monks, for a monk, the mind's defilement in these five instances has been abandoned, his mind inclines towards renunciation. A mind thoroughly imbued with renunciation is considered workable for the direct realization of those states that are to be directly realized.",
      "sinhala": "මහණෙනි, රූපයෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. මහණෙනි, වේදනාවෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. මහණෙනි, සංඥාවෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. මහණෙනි, සංස්කාරයන්හි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි. මහණෙනි, විඤ්ඤාණයෙහි යම් ඡන්දරාගයක් ඇද්ද, එය සිතේ උපක්ලේශයකි.\n\nමහණෙනි, යම් කලක භික්‍ෂු​වකට මේ පස් තැනෙහි සිතේ උපක්ලේශයන් පහව යයිද, එවිට ඔහුගේ සිත නෛෂ්ක්‍ර​ම්‍ය​යට නැඹුරු වෙයි. නෛෂ්ක්‍ර​ම්‍ය​යෙන් පරි​භා​විත වූ සිත, අභි​ඥා​වෙන් ප්‍ර​ත්‍යක්‍ෂ​ කළ යුතු ධර්ම​ය​න්හි කර්‍ම​ණ්‍ය​ වේ යැයි පෙනී යයි.",
      "paliTitle": "Khandhasuttaṃ",
      "vagga": "",
      "englishTitle": "Discourse on the Aggregates",
      "sinhalaTitle": "ස්‍කන්ධ සූත්‍රය"
    }
  ],
  "footer": {
    "pali": "Kilesasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Cakkhu rūpañca viññāṇaṃ, phasso ca vedanāya ca; Saññā ca cetanā taṇhā, dhātu khandhena te dasāti.",
    "english": "Kilesa Saṃyutta: Conclusion and Summary",
    "sinhala": "ක‍්ලේශ සංය‍ුත‍්තය සම‍්ප‍ූර්‍ණයි."
  }
}