{
  "id": "sn.3.2",
  "title": {
    "pali": "Rādhasaṃyuttaṃ",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 160,
      "pali": "Sāvatthinidānaṃ. Atha kho āyasmā rādho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘Māro, māro’ti, bhante, vuccati. Kittāvatā nu kho, bhante, māro’’ti? ‘‘Rūpe kho, rādha, sati māro vā assa māretā vā yo vā pana mīyati. Tasmātiha tvaṃ, rādha, rūpaṃ māroti passa, māretāti passa, mīyatīti passa, rogoti passa, gaṇḍoti passa, sallanti passa, aghanti passa, aghabhūtanti passa. Ye naṃ evaṃ passanti te sammā passanti. Vedanāya sati… saññāya sati… saṅkhāresu sati… viññāṇe sati māro vā assa māretā vā yo vā pana mīyati. Tasmātiha tvaṃ, rādha, viññāṇaṃ māroti passa, māretāti passa, mīyatīti passa, rogoti passa, gaṇḍoti passa, sallanti passa, aghanti passa, aghabhūtanti passa. Ye naṃ evaṃ passanti, te sammā passantī’’ti. ‘‘Sammādassanaṃ pana, bhante, kimatthiya’’nti? ‘‘Sammādassanaṃ kho, rādha, nibbidatthaṃ’’. ‘‘Nibbidā pana, bhante, kimatthiyā’’ti? ‘‘Nibbidā kho, rādha, virāgatthā’’. ‘‘Virāgo pana, bhante, kimatthiyo’’ti? ‘‘Virāgo kho, rādha, vimuttattho’’. ‘‘Vimutti pana, bhante, kimatthiyā’’ti? ‘‘Vimutti kho, rādha, nibbānatthā’’. ‘‘Nibbānaṃ pana, bhante, kimatthiya’’nti? ‘‘Accayāsi [accasarā (sī. syā. kaṃ.), assa (pī.), accayā (ka.)], rādha, pañhaṃ, nāsakkhi pañhassa pariyantaṃ gahetuṃ. Nibbānogadhañhi, rādha, brahmacariyaṃ vussati, nibbānaparāyanaṃ nibbānapariyosāna’’nti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mārasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 161,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘satto, satto’ti, bhante, vuccati. Kittāvatā nu kho, bhante, sattoti vuccatī’’ti? ‘‘Rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā, tatra satto, tatra visatto, tasmā sattoti vuccati. Vedanāya… saññāya… saṅkhāresu… viññāṇe yo chando yo rāgo yā nandī yā taṇhā, tatra satto, tatra visatto, tasmā sattoti vuccati’’. ‘‘Seyyathāpi, rādha, kumārakā vā kumārikāyo vā paṃsvāgārakehi kīḷanti. Yāvakīvañca tesu paṃsvāgārakesu avigatarāgā honti avigatacchandā avigatapemā avigatapipāsā avigatapariḷāhā avigatataṇhā, tāva tāni paṃsvāgārakāni allīyanti keḷāyanti dhanāyanti [manāyanti (sī. pī. ka.)] mamāyanti. Yato ca kho, rādha, kumārakā vā kumārikāyo vā tesu paṃsvāgārakesu vigatarāgā honti vigatacchandā vigatapemā vigatapipāsā vigatapariḷāhā vigatataṇhā, atha kho tāni paṃsvāgārakāni hatthehi ca pādehi ca vikiranti vidhamanti viddhaṃsenti vikīḷaniyaṃ [vikīḷanikaṃ (sī. syā. kaṃ. pī.)] karonti. Evameva kho, rādha, tumhepi rūpaṃ vikiratha vidhamatha viddhaṃsetha vikīḷaniyaṃ karotha taṇhākkhayāya paṭipajjatha. Vedanaṃ vikiratha vidhamatha viddhaṃsetha vikīḷaniyaṃ karotha taṇhākkhayāya paṭipajjatha. Saññaṃ… saṅkhāre vikiratha vidhamatha viddhaṃsetha vikīḷaniyaṃ karotha taṇhākkhayāya paṭipajjatha. Viññāṇaṃ vikiratha vidhamatha viddhaṃsetha vikīḷaniyaṃ karotha taṇhākkhayāya paṭipajjatha. Taṇhākkhayo hi, rādha, nibbāna’’nti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sattasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 162,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘bhavanettinirodho [bhavanetti (sī. syā. kaṃ. pī.)], bhavanettinirodho’ti [bhavanettīti (sī. syā. kaṃ.)], bhante, vuccati. Katamā nu kho, bhante, bhavanetti, katamo bhavanettinirodho’’ti? ‘‘Rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā – ayaṃ vuccati bhavanetti. Tesaṃ nirodho [nirodhā (sī. syā. kaṃ. pī.)] bhavanettinirodho. Vedanāya… saññāya… saṅkhāresu … viññāṇe yo chando…pe… adhiṭṭhānābhinivesānusayā – ayaṃ vuccati bhavanetti. Tesaṃ nirodho bhavanettinirodho’’ti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Bhavanettisuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 163,
      "pali": "Sāvatthinidānaṃ. Āyasmā rādho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘Pariññeyye ca, rādha, dhamme desessāmi pariññañca pariññātāviṃ puggalañca. Taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā rādho bhagavato paccassosi. Bhagavā etadavoca – ‘‘katame ca, rādha, pariññeyyā dhammā? Rūpaṃ kho, rādha, pariññeyyo dhammo, vedanā pariññeyyo dhammo, saññā pariññeyyo dhammo, saṅkhārā pariññeyyo dhammo, viññāṇaṃ pariññeyyo dhammo. Ime vuccanti, rādha, pariññeyyā dhammā. Katamā ca, rādha, pariññā? Yo kho, rādha, rāgakkhayo dosakkhayo mohakkhayo – ayaṃ vuccati, rādha, pariññā. Katamo ca, rādha, pariññātāvī puggalo? ‘Arahā’tissa vacanīyaṃ. Yvāyaṃ āyasmā evaṃnāmo evaṃgotto – ayaṃ vuccati, rādha, pariññātāvī puggalo’’ti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pariññeyyasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 164,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘pañcime, rādha, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ye hi keci, rādha, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ upādānakkhandhānaṃ assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti; na me te, rādha, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca pana te āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. Ye ca kho keci, rādha, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ upādānakkhandhānaṃ assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānanti; te kho me, rādha, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Samaṇasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 165,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘pañcime, rādha, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho…pe… viññāṇupādānakkhandho. Ye hi keci, rādha, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ upādānakkhandhānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti…pe… sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyasamaṇasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 166,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘pañcime, rādha, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho…pe… viññāṇupādānakkhandho. Yato kho, rādha, ariyasāvako imesaṃ pañcannaṃ upādānakkhandhānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti – ayaṃ vuccati, rādha, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sotāpannasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 167,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘pañcime, rādha, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho…pe… viññāṇupādānakkhandho. Yato kho, rādha, bhikkhu imesaṃ pañcannaṃ upādānakkhandhānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto hoti – ayaṃ vuccati, rādha, arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto’’ti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Arahantasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 168,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā, taṃ pajahatha. Evaṃ taṃ rūpaṃ pahīnaṃ bhavissati ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ. Vedanāya yo chando yo rāgo yā nandī yā taṇhā, taṃ pajahatha. Evaṃ sā vedanā pahīnā bhavissati ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Saññāya… saṅkhāresu yo chando yo rāgo yā nandī yā taṇhā, taṃ pajahatha. Evaṃ te saṅkhārā pahīnā bhavissanti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Viññāṇe yo chando yo rāgo yā nandī yā taṇhā, taṃ pajahatha. Evaṃ taṃ viññāṇaṃ pahīnaṃ bhavissati…pe… anuppādadhamma’’nti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Chandarāgasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 169,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahatha. Evaṃ taṃ rūpaṃ pahīnaṃ bhavissati ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ. Vedanāya yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahatha. Evaṃ sā vedanā pahīnā bhavissati ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Saññāya… saṅkhāresu yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahatha. Evaṃ te saṅkhārā pahīnā bhavissanti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Viññāṇe yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahatha. Evaṃ taṃ viññāṇaṃ pahīnaṃ bhavissati ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhamma’’nti. Dasamaṃ. Rādhasaṃyuttassa paṭhamo vaggo. Tassuddānaṃ – Māro satto bhavanetti, pariññeyyā samaṇā duve; Sotāpanno arahā ca, chandarāgāpare duveti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyachandarāgasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 170,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘māro, māro’ti, bhante, vuccati. Katamo nu kho, bhante, māro’’ti? ‘‘Rūpaṃ kho, rādha, māro, vedanā māro, saññā māro, saṅkhārā māro, viññāṇaṃ māro. Evaṃ passaṃ, rādha, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi nibbindati, saññāyapi nibbindati, saṅkhāresupi nibbindati, viññāṇasmimpi nibbindati. Nibbindaṃ virajjati; virāgā vimuccati. Vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mārasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 171,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘māradhammo, māradhammo’ti, bhante, vuccati. Katamo nu kho, bhante, māradhammo’’ti? ‘‘Rūpaṃ kho, rādha, māradhammo, vedanā māradhammo, saññā māradhammo, saṅkhārā māradhammo, viññāṇaṃ māradhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Māradhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 172,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘aniccaṃ, anicca’nti, bhante, vuccati. Katamaṃ nu kho, bhante, anicca’’nti? ‘‘Rūpaṃ kho, rādha, aniccaṃ, vedanā aniccā, saññā aniccā, saṅkhārā aniccā, viññāṇaṃ aniccaṃ. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Aniccasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 173,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘aniccadhammo, aniccadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, aniccadhammo’’ti? ‘‘Rūpaṃ kho, rādha, aniccadhammo, vedanā aniccadhammo, saññā aniccadhammo, saṅkhārā aniccadhammo, viññāṇaṃ aniccadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Aniccadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 174,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘dukkhaṃ, dukkha’nti, bhante, vuccati. Katamaṃ nu kho, bhante, dukkha’’nti? ‘‘Rūpaṃ kho, rādha, dukkhaṃ, vedanā dukkhā, saññā dukkhā, saṅkhārā dukkhā, viññāṇaṃ dukkhaṃ. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dukkhasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 175,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘dukkhadhammo, dukkhadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, dukkhadhammo’’ti? ‘‘Rūpaṃ kho, rādha, dukkhadhammo, vedanā dukkhadhammo, saññā dukkhadhammo, saṅkhārā dukkhadhammo, viññāṇaṃ dukkhadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dukkhadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 176,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘anattā, anattā’ti, bhante, vuccati. Katamo nu kho, bhante, anattā’’ti? ‘‘Rūpaṃ kho, rādha, anattā, vedanā anattā, saññā anattā, saṅkhārā anattā, viññāṇaṃ anattā. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Anattasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 177,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘anattadhammo, anattadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, anattadhammo’’ti? ‘‘Rūpaṃ kho, rādha, anattadhammo, vedanā anattadhammo, saññā anattadhammo, saṅkhārā anattadhammo, viññāṇaṃ anattadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Aṭṭhamaṃ. 9.Khayadhammasuttaṃ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Anattadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 178,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘khayadhammo, khayadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, khayadhammo’’ti? ‘‘Rūpaṃ kho, rādha, khayadhammo, vedanā khayadhammo, saññā khayadhammo, saṅkhārā khayadhammo, viññāṇaṃ khayadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 179,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘vayadhammo, vayadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, vayadhammo’’ti? ‘‘Rūpaṃ kho, rādha, vayadhammo, vedanā vayadhammo, saññā vayadhammo, saṅkhārā vayadhammo, viññāṇaṃ vayadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Dasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Vayadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 180,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘samudayadhammo, samudayadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, samudayadhammo’’ti? ‘‘Rūpaṃ kho, rādha, samudayadhammo, vedanā samudayadhammo, saññā samudayadhammo, saṅkhārā samudayadhammo, viññāṇaṃ samudayadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Ekādasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Samudayadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 181,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘nirodhadhammo, nirodhadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, nirodhadhammo’’ti? ‘‘Rūpaṃ kho, rādha, nirodhadhammo, vedanā nirodhadhammo, saññā nirodhadhammo, saṅkhārā nirodhadhammo, viññāṇaṃ nirodhadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Dvādasamaṃ. Rādhasaṃyuttassa dutiyo vaggo. Tassuddānaṃ – Māro ca māradhammo ca, aniccena apare duve; Dukkhena ca duve vuttā, anattena [anattehi (sī. syā. kaṃ.)] tatheva ca; Khayavayasamudayaṃ, nirodhadhammena dvādasāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nirodhadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 182,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Yo kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo [sīhaḷapotthake pana ‘‘tatra te chando pahātabboti ekaṃ suttaṃ, tatra te rāgo pahātabboti ekaṃ suttaṃ, tatra te chandarāgo pahātabboti ekaṃ sutta’’nti evaṃ visuṃ visuṃ tīṇi suttāni vibhajitvā dassitāni. evamuparisuttesupi]. Ko ca, rādha, māro? Rūpaṃ kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo [sīhaḷapotthake pana ‘‘tatra te chando pahātabboti ekaṃ suttaṃ, tatra te rāgo pahātabboti ekaṃ suttaṃ, tatra te chandarāgo pahātabboti ekaṃ sutta’’nti evaṃ visuṃ visuṃ tīṇi suttāni vibhajitvā dassitāni. evamuparisuttesupi]. Vedanā māro; tatra te chando pahātabbo…pe… saññā māro; tatra te chando pahātabbo…pe… saṅkhārā māro; tatra te chando pahātabbo…pe… viññāṇaṃ māro; tatra te chando pahātabbo…pe… yo kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mārādisuttaekādasakaṃ",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 183,
      "pali": "Yo kho, rādha, māradhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 184,
      "pali": "Yaṃ kho, rādha, aniccaṃ…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 185,
      "pali": "Yo kho, rādha, aniccadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 186,
      "pali": "Yaṃ kho, rādha, dukkhaṃ…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 187,
      "pali": "Yo kho, rādha, dukkhadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 188,
      "pali": "Yo kho, rādha, anattā…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 189,
      "pali": "Yo kho, rādha, anattadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 190,
      "pali": "Yo kho, rādha, khayadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 191,
      "pali": "Yo kho, rādha, vayadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 192,
      "pali": "Yo kho, rādha, samudayadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 193,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Yo kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Ko ca, rādha, nirodhadhammo? Rūpaṃ kho, rādha, nirodhadhammo; tatra te chando pahātabbo…pe… vedanā nirodhadhammo; tatra te chando pahātabbo…pe… saññā nirodhadhammo; tatra te chando pahātabbo…pe… saṅkhārā nirodhadhammo; tatra te chando pahātabbo…pe… viññāṇaṃ nirodhadhammo; tatra te chando pahātabbo…pe… yo kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo’’ti [sīhaḷapotthake pana imasmiṃ vagge chattiṃsa suttāni vibhattāni ekekaṃ suttaṃ tīṇi tīṇi katvā, evaṃ catutthavaggepi]. Āyācanavaggo tatiyo. Tassuddānaṃ – Māro ca māradhammo ca, aniccena apare duve; Dukkhena ca duve vuttā, anattena tatheva ca; Khayavayasamudayaṃ, nirodhadhammena dvādasāti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nirodhadhammasuttaṃ",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 194,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘yo kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Ko ca, rādha, māro? Rūpaṃ kho, rādha, māro; tatra te chando pahātabbo…pe… viññāṇaṃ māro; tatra te chando pahātabbo…pe… yo kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mārādisuttaekādasakaṃ",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 195,
      "pali": "Yo kho, rādha, māradhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 196,
      "pali": "Yaṃ kho, rādha, aniccaṃ…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 197,
      "pali": "Yo kho, rādha, aniccadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 198,
      "pali": "Yaṃ kho, rādha, dukkhaṃ…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 199,
      "pali": "Yo kho, rādha, dukkhadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 200,
      "pali": "Yo kho, rādha, anattā…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 201,
      "pali": "Yo kho, rādha, anattadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 202,
      "pali": "Yo kho, rādha, khayadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 203,
      "pali": "Yo kho, rādha, vayadhammo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 204,
      "pali": "Yo kho, rādha, samudayadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo…pe….",
      "english": "",
      "sinhala": "",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 205,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘yo kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Ko ca, rādha, nirodhadhammo? Rūpaṃ kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Vedanā…pe… saññā…pe… saṅkhārā…pe… viññāṇaṃ nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Yo kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo’’ti. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nirodhadhammasuttaṃ",
      "vagga": "Upanisinnavaggo"
    }
  ],
  "footer": {
    "pali": "Upanisinnavaggo catuttho. Tassuddānaṃ – Māro ca māradhammo ca, aniccena apare duve; Dukkhena ca duve vuttā, anattena tatheva ca; Khayavayasamudayaṃ, nirodhadhammena dvādasāti. Rādhasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}