{
  "id": "sn.3.8",
  "title": {
    "pali": "Nāgasaṃyuttaṃ",
    "english": "The Connected Discourses on Nāgas",
    "sinhala": "නාග සංයුත්තය"
  },
  "sections": [
    {
      "number": 342,
      "pali": "Sāvatthinidānaṃ. ‘‘Catasso imā, bhikkhave, nāgayoniyo. Katamā catasso? Aṇḍajā nāgā, jalābujā nāgā, saṃsedajā nāgā, opapātikā nāgā – imā kho, bhikkhave, catasso nāgayoniyo’’ti. Paṭhamaṃ.",
      "english": "Monks, these are four origins of Nāgas. What are these four? Nāgas born from eggs, Nāgas born from a womb, Nāgas born from moisture, and Nāgas born spontaneously. These, monks, are the four origins of Nāgas.",
      "sinhala": "සැවැත් නුවරදී වදාළ සූත්‍රයයි.\nමහණෙනි, මේ නාග යෝනි සතරකි. ඒ සතර කවරේද? අණ්ඩජ නාගයෝ, ජලාබුජ නාගයෝ, සංසේදජ නාගයෝ, ඕපපාතික නාගයෝ යන මේවායි. මහණෙනි, මේ නාග යෝනි සතර මෙයයි.\nපළමු සූත්‍රයයි.",
      "paliTitle": "Suddhikasuttaṃ",
      "vagga": ""
    },
    {
      "number": 343,
      "pali": "Sāvatthinidānaṃ. ‘‘Catasso imā, bhikkhave, nāgayoniyo. Katamā catasso? Aṇḍajā nāgā, jalābujā nāgā, saṃsedajā nāgā, opapātikā nāgā. Tatra, bhikkhave, aṇḍajehi nāgehi jalābujā ca saṃsedajā ca opapātikā ca nāgā paṇītatarā. Tatra, bhikkhave, aṇḍajehi ca jalābujehi ca nāgehi saṃsedajā ca opapātikā ca nāgā paṇītatarā. Tatra, bhikkhave, aṇḍajehi ca jalābujehi ca saṃsedajehi ca nāgehi opapātikā nāgā paṇītatarā. Imā kho, bhikkhave, catasso nāgayoniyo’’ti. Dutiyaṃ.",
      "english": "Bhikkhus, there are these four births of Nāgas. Which four? Nāgas born from eggs, Nāgas born from a womb, Nāgas born from moisture, and Nāgas born spontaneously. Among these, bhikkhus, compared to the egg-born Nāgas, the womb-born, moisture-born, and spontaneously arisen Nāgas are superior. Among these, bhikkhus, compared to the egg-born and womb-born Nāgas, the moisture-born and spontaneously arisen Nāgas are superior. Among these, bhikkhus, compared to the egg-born, womb-born, and moisture-born Nāgas, the spontaneously arisen Nāgas are superior. These, bhikkhus, are the four births of Nāgas.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\n“මහණෙනි, මේ නාග උපත් සතරකි. ඒ සතර කවරේද? අණ්ඩජ නාගයෝ, ජලාබුජ නාගයෝ, සංසේදජ නාගයෝ, ඕපපාතික නාගයෝ වශයෙනි.\n\nමහණෙනි, එහිලා අණ්ඩජ නාගයන්ට වඩා ජලාබුජ, සංසේදජ සහ ඕපපාතික නාගයෝ ප්‍U+0DCAU+200Dරණීත වෙති.\n\nමහණෙනි, එහිලා අණ්ඩජ නාගයන්ටත්, ජලාබුජ නාගයන්ටත් වඩා සංසේදජ සහ ඕපපාතික නාගයෝ ප්‍U+0DCAU+200Dරණීත වෙති.\n\nමහණෙනි, එහිලා අණ්ඩජ, ජලාබුජ සහ සංසේදජ නාගයන්ට වඩා ඕපපාතික නාගයෝ ප්‍U+0DCAU+200Dරණීත වෙති.\n\nමහණෙනි, මේ නාග උපත් සතර නම් මේවාය.”",
      "paliTitle": "Paṇītatarasuttaṃ",
      "vagga": ""
    },
    {
      "number": 344,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Atha kho aññataro bhikkhu yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacce aṇḍajā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti? ‘‘Idha, bhikkhu, ekaccānaṃ aṇḍajānaṃ nāgānaṃ evaṃ hoti – ‘mayaṃ kho pubbe kāyena dvayakārino ahumha, vācāya dvayakārino, manasā dvayakārino. Te mayaṃ kāyena dvayakārino, vācāya dvayakārino, manasā dvayakārino, kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapannā. Sacajja mayaṃ kāyena sucaritaṃ careyyāma, vācāya sucaritaṃ careyyāma, manasā sucaritaṃ careyyāma, evaṃ mayaṃ kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyāma. Handa, mayaṃ etarahi kāyena sucaritaṃ carāma, vācāya sucaritaṃ carāma, manasā sucaritaṃ carāmā’ti. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacce aṇḍajā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti. Tatiyaṃ.",
      "english": "On one occasion, the Blessed One was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's monastery.\n\nThen a certain monk approached the Blessed One, and having approached, paid homage to the Blessed One and sat down to one side. As he sat to one side, that monk said to the Blessed One: \"What, venerable sir, is the reason, what is the cause, by which some egg-born nāgas here observe the Uposatha and relinquish their bodies?\"\n\n\"Here, monk, it occurs to some egg-born nāgas thus: 'Indeed, in the past, we acted wrongly by body, acted wrongly by speech, and acted wrongly by mind. We, having been wrongdoers by body, wrongdoers by speech, and wrongdoers by mind, at the breaking up of the body, after death, were reborn into the company of egg-born nāgas. If today we were to lead a good conduct by body, a good conduct by speech, and a good conduct by mind, then at the breaking up of the body, after death, we would be reborn into a good destination, a heavenly world. Come now, let us today lead a good conduct by body, a good conduct by speech, and a good conduct by mind.' This, monk, is the reason, this is the cause, by which some egg-born nāgas here observe the Uposatha and relinquish their bodies.\"",
      "sinhala": "එක් සමයක භාග්‍යවතුන්‍ වහන්සේ සැවැත් නුවර, අනාථපිණ්ඩික සිටුතුමාගේ ජේතවනාරාමයේ වැඩසිටින සේක. එකල්හි එක්තරා භික්ෂුවක් භාග්‍යවතුන්‍ වහන්සේ වෙත පැමිණ, භාග්‍යවතුන්‍ වහන්සේට වන්දනා කොට, එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන්‍ වහන්සේට මෙසේ පැවසීය – “වහන්ස, මෙහි ඇතැම් අණ්ඩජ නාගයන් උපෝසථය සමාදන් වී, නිරාමිසව (කාය දුශ්චරිතයෙන් වැලකී) වාසය කිරීමට හේතුව හා ප‍්‍රත්‍යය කුමක්ද?”\n\n“මෙහි, මහණෙනි, ඇතැම් අණ්ඩජ නාගයන්ට මෙසේ සිතක් ඇති වේ – ‘අපි පෙර කයින්, වචනයෙන් සහ සිතින් අකුසල් ක‍්‍රියා කළෙමු. කයින්, වචනයෙන් හා සිතින් අකුසල් ක‍්‍රියා කළ හෙයින්, ශරීරය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහවාසයට පැමිණියෙමු. අපි දැන් කයින් සුචරිතයෙහි ද, වචනයෙන් සුචරිතයෙහි ද, සිතින් සුචරිතයෙහි ද හැසිරෙමු නම්, මෙසේ අපි ශරීරය බිඳී මරණින් මතු සුගතියක් වූ ස්වර්ග ලෝකයට උපත ලබන්නෙමු. එබැවින්, අපි දැන් කයින් සුචරිතයෙහි ද, වචනයෙන් සුචරිතයෙහි ද, සිතින් සුචරිතයෙහි ද හැසිරෙමු’යි. මහණෙනි, මෙහි ඇතැම් අණ්ඩජ නාගයන් උපෝසථය සමාදන් වී, නිරාමිසව වාසය කිරීමට හේතුව හා ප‍්‍රත්‍යය මේ වේ.”",
      "paliTitle": "Uposathasuttaṃ",
      "vagga": ""
    },
    {
      "number": 345,
      "pali": "Sāvatthinidānaṃ. Atha kho aññataro bhikkhu yena bhagavā…pe… ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacce jalābujā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti? ‘‘Idha, bhikkhu…pe… ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacce jalābujā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti. Catutthaṃ.",
      "english": "The occasion at Sāvatthī. Then a certain monk approached the Blessed One. Having approached and sat down to one side, that monk said to the Blessed One: \"What, venerable sir, is the reason, what is the cause, by which some womb-born nāgas here observe the Uposatha and release their bodies?\" \"Here, monk, this, monk, is the reason, this is the cause by which some womb-born nāgas here observe the Uposatha and release their bodies.\" The Fourth.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී. එකල්හි එක්තරා භික්ෂුවක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, එක්පසෙක වාඩි වී භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"වහන්ස, මෙහි සමහර ජලාබුජ නාගයන් උපෝසථය සමාදන් වී, තමන්ගේ ශරීරය අත්හැර පවතින්නේ කුමක් හේතු කොටගෙනද, කුමක් ප්‍රත්‍යය කොටගෙනද?\" \"මහණ, මෙහි, මේ හේතුවෙන්, මේ ප්‍රත්‍යය හේතුවෙන්, සමහර ජලාබුජ නාගයන් උපෝසථය සමාදන් වී, තමන්ගේ ශරීරය අත්හැර පවතින්නෝය.\" සිව්වැනි සූත්‍රයයි.",
      "paliTitle": "Dutiyauposathasuttaṃ",
      "vagga": ""
    },
    {
      "number": 346,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacce saṃsedajā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti? ‘‘Idha, bhikkhu…pe… ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacce saṃsedajā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti. Pañcamaṃ.",
      "english": "At Sāvatthī.\n\nSeated to one side, that bhikkhu said to the Blessed One: “Venerable sir, what is the reason, what is the cause, why some moisture-born nāgas here observe the Uposatha and have their bodies released?”\n\n“Here, bhikkhu, ... this, bhikkhu, is the reason, this is the cause, why some moisture-born nāgas here observe the Uposatha and have their bodies released.”",
      "sinhala": "සැවැත් නුවරදීය.\n\nඑක් පසෙක අසුන්ගෙන සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය:\n‘වහන්ස, හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද? යම් හෙයකින් මෙහි ඇතැම් සම්සේදජ නාගයෝ උපෝසථය සමාදන් වෙත්ද, කායික බැඳීම් මුදාහරිමින් උපෝසථය රකිත්ද?’\n\n‘මෙහිදී, භික්ෂුව, යම් හේතු ප්‍රත්‍යයන් නිසා මෙහි ඇතැම් සම්සේදජ නාගයෝ උපෝසථය සමාදන් වෙත්ද, කායික බැඳීම් මුදාහරිමින් උපෝසථය රකිත්ද, ඒ සඳහා හේතුව මෙයයි, ප්‍රත්‍යය මෙයයි.’\n\nපස්වැන්නයි.",
      "paliTitle": "Tatiyauposathasuttaṃ",
      "vagga": ""
    },
    {
      "number": 347,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacce opapātikā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti? ‘‘Idha, bhikkhu, ekaccānaṃ opapātikānaṃ nāgānaṃ evaṃ hoti – ‘mayaṃ kho pubbe kāyena dvayakārino ahumha, vācāya dvayakārino, manasā dvayakārino. Te mayaṃ kāyena dvayakārino, vācāya dvayakārino, manasā dvayakārino, kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapannā. Sacajja mayaṃ kāyena sucaritaṃ careyyāma, vācāya… manasā sucaritaṃ careyyāma, evaṃ mayaṃ kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjeyyāma. Handa, mayaṃ etarahi kāyena sucaritaṃ carāma, vācāya… manasā sucaritaṃ carāmā’ti. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacce opapātikā nāgā uposathaṃ upavasanti vossaṭṭhakāyā ca bhavantī’’ti. Chaṭṭhaṃ.",
      "english": "A certain bhikkhu, seated to one side, said this to the Blessed One: \"What, venerable sir, is the reason, what is the cause, why certain spontaneously-born nāgas observe the Uposatha and also have their bodies relinquished?\"\n\n\"Here, bhikkhu, for certain spontaneously-born nāgas, it occurs to them thus: ‘Indeed, in the past, we performed actions of a dual nature with body, performed actions of a dual nature with speech, and performed actions of a dual nature with mind. Because we performed actions of a dual nature with body, actions of a dual nature with speech, and actions of a dual nature with mind, upon the breakup of the body, after death, we reappeared in the company of spontaneously-born nāgas. If today we were to perform good conduct with body, perform good conduct with speech, and perform good conduct with mind, then upon the breakup of the body, after death, we would reappear in a good destination, in the heavenly world. Therefore, let us now perform good conduct with body, perform good conduct with speech, and perform good conduct with mind!'\"\n\n\"This, bhikkhu, is the reason, this is the cause, why certain spontaneously-born nāgas observe the Uposatha and also have their bodies relinquished.\"",
      "sinhala": "සැවැත් නුවරදීය. එක් පසෙක වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “පින්වහන්ස, හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද, යම් කරුණක් නිසා මෙලොව ඇතැම් උප්පාදික නාගයෝ උපෝසථ සිල් සමාදන් වෙතිද, කායික අශුභ ක්‍රියාවන්ගෙන් වැළකී සිටින්නාහු ද වෙතිද?”\n\n“[භික්ෂුව,] මෙහි ඇතැම් උප්පාදික නාගයන්ට මෙසේ සිතක් ඇතිවේ: ‘අපි පෙර කයින් යහපත් හා අයහපත් යන දෙවර්ගයේම ක්‍රියා කරන්නාහු වීමු. වචනයෙන් යහපත් හා අයහපත් යන දෙවර්ගයේම ක්‍රියා කරන්නාහු වීමු. මනසින් යහපත් හා අයහපත් යන දෙවර්ගයේම ක්‍රියා කරන්නාහු වීමු. ඒ අපි කයින් යහපත් හා අයහපත් යන දෙවර්ගයේම ක්‍රියා කරන්නාහු වී, වචනයෙන් යහපත් හා අයහපත් යන දෙවර්ගයේම ක්‍රියා කරන්නාහු වී, මනසින් යහපත් හා අයහපත් යන දෙවර්ගයේම ක්‍රියා කරන්නාහු වී, කය බිඳී මරණින් මතු උප්පාදික නාගයන්ගේ සහවාසයට පැමිණියෙමු. අපි අද කයින් සුචරිතයෙහි හැසිරෙමු නම්, වචනයෙන් සුචරිතයෙහි හැසිරෙමු නම්, මනසින් සුචරිතයෙහි හැසිරෙමු නම්, එසේ වූ කල කය බිඳී මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිමු. එසේ නම් අපි දැන් කයින් සුචරිතයෙහි හැසිරෙමු. වචනයෙන් සුචරිතයෙහි හැසිරෙමු. මනසින් සුචරිතයෙහි හැසිරෙමු’ යනුවෙනි. [භික්ෂුව,] මෙලොව ඇතැම් උප්පාදික නාගයෝ උපෝසථ සිල් සමාදන් වෙතිද, කායික අශුභ ක්‍රියාවන්ගෙන් වැළකී සිටින්නාහු ද වෙතිද, මේ ඒ සඳහා වූ හේතුවය, මේ ඒ සඳහා වූ ප්‍රත්‍යයය”යි.",
      "paliTitle": "Catutthauposathasuttaṃ",
      "vagga": ""
    },
    {
      "number": 348,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī hoti, manasā dvayakārī hoti. Tassa sutaṃ hoti – ‘aṇḍajā nāgā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti. Sattamaṃ.",
      "english": "At Sāvatthī. Then that bhikkhu, seated to one side, said to the Blessed One, \"Venerable Sir, what is the cause, what is the reason, by which some individual here, with the breaking up of the body, after death, is reborn in companionship with the egg-born nāgas?\"\n\n\"Here, bhikkhu, some individual acts in a dual way with the body, acts in a dual way with speech, and acts in a dual way with the mind. He hears that 'egg-born nāgas are long-lived, resplendent, and possess much happiness.' And he thinks, 'Oh, if only, with the breaking up of the body, after death, I might be reborn in companionship with the egg-born nāgas!' He, with the breaking up of the body, after death, is reborn in companionship with the egg-born nāgas. This, bhikkhu, is the cause, this is the reason, by which some individual here, with the breaking up of the body, after death, is reborn in companionship with the egg-born nāgas.\"",
      "sinhala": "සාවත්ථියෙහිදී මේ සිදුවීම සිදුවිය. එක් පසෙක හුන් ඒ භික්ෂුව භාග්‍ය‍‍වතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, කුමක් හෙයින්ද, කුමන ප්‍ර‍‍ත්‍යයක් නිසාද, යම් කෙනෙක් මෙලොව කාය භේදයෙන් මරණින් මතු අඬුජ නාගයන්ගේ සහායයට උපදින්නේද?\" \"මහණ, මෙලොව යම් කෙනෙක් කයින් ද්විධා ක්‍රි‍‍යා කරයි, වචනයෙන් ද්විධා ක්‍රි‍‍යා කරයි, මනසින් ද්විධා ක්‍රි‍‍යා කරයි. ඔහුට මෙසේ අසා තිබේ: 'අඬුජ නාගයෝ දීර්ඝායුෂ ඇත්තෝය, වර්ණවත්ය, බොහෝ සැප ඇත්තෝය.' ඔහුට මෙසේ සිතේ: 'අහෝ, කාය භේදයෙන් මරණින් මතු මම අඬුජ නාගයන්ගේ සහායයට උපදින්නට ලැබුණොත් ඉතා යහපති!' ඔහු කාය භේදයෙන් මරණින් මතු අඬුජ නාගයන්ගේ සහායයට උපදී. මහණ, මේ හේතුවය, මේ ප්‍ර‍‍ත්‍යයයය, යම් කෙනෙක් මෙලොව කාය භේදයෙන් මරණින් මතු අඬුජ නාගයන්ගේ සහායයට උපදින්නේද.\"",
      "paliTitle": "Sutasuttaṃ",
      "vagga": ""
    },
    {
      "number": 349,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti?…Pe… ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ nāgānaṃ sahabyataṃ upapajjatīti. Aṭṭhamaṃ.",
      "english": "At Sāvatthī. That bhikkhu, seated to one side, said to the Blessed One: \"What, Venerable Sir, is the cause, what is the condition, by which some individual here, with the breakup of the body, after death, reappears in the companionship of womb-born nāgas?\"... This, bhikkhu, is the cause, this is the condition, by which some individual here, with the breakup of the body, after death, reappears in the companionship of womb-born nāgas.",
      "sinhala": "සැවැත්නුවරදී සිදුවිය.\nඑක් පසෙක වාඩි වී සිටි ඒ භික්‍ෂුව භාග්‍යවතුන් වහන්සේට මෙය කීවේය: ‘‘භාග්‍යවතුන් වහන්ස, මේ ලෝකයේ සමහරෙක් කය බිඳී මරණයෙන් පසු ජලාබුජ නාගයන්ගේ සහවාසයට පැමිණීමට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?’’ භික්‍ෂුව, යම් පුද්ගලයෙක් කය බිඳී මරණයෙන් පසු ජලාබුජ නාගයන්ගේ සහවාසයට පැමිණෙන්නේ නම්, මෙයමයි ඊට හේතුව, මෙයමයි ඊට ප්‍රත්‍යය.",
      "paliTitle": "Dutiyasutasuttaṃ",
      "vagga": ""
    },
    {
      "number": 350,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā saṃsedajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti?…Pe… ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā saṃsedajānaṃ nāgānaṃ sahabyataṃ upapajjatīti. Navamaṃ.",
      "english": "At Sāvatthī.\n\nIndeed, that monk, sitting to one side, said this to the Blessed One: \"What, indeed, Venerable Sir, is the cause, what is the condition, by which a certain person here, upon the breaking up of the body, after death, is reborn into the companionship of the moisture-born nāgas?\"\n\n\"This, indeed, monk, is the cause, this is the condition, by which a certain person here, upon the breaking up of the body, after death, is reborn into the companionship of the moisture-born nāgas.\"\n\nThe Ninth.",
      "sinhala": "සැවැත්නුවරදීය.\n\nඑක් භික්‍ෂුවක් එක් පසෙක වැඩසිට භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “පින්වහන්ස, මෙලොව ඇතැම් පුද්ගලයෙක් කය බිඳී මරණයෙන් පසු සංසේදජ නාගයන් අතර උපත ලැබීමට හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද?”\n\n“භික්‍ෂුව, මෙලොව ඇතැම් පුද්ගලයෙක් කය බිඳී මරණයෙන් පසු සංසේදජ නාගයන් අතර උපත ලැබීමට හේතුවත්, ප්‍රත්‍යයත් මෙයයි.”\n\nනවවැනි සූත්‍රයයි.",
      "paliTitle": "Tatiyasutasuttaṃ",
      "vagga": ""
    },
    {
      "number": 351,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘opapātikā nāgā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjeyya’nti. So kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti. Dasamaṃ.",
      "english": "At Sāvatthī. A certain monk, sitting to one side, said to the Blessed One, \"Venerable Sir, what is the cause, what is the reason, by which some individual here, with the breakup of the body, after death, reappears in companionship with the Nāgas of spontaneous birth?\"\n\n\"Here, monk, some individual acts in two ways with the body, acts in two ways with speech, and acts in two ways with the mind. He has heard, 'The Nāgas of spontaneous birth are long-lived, beautiful, and abound in happiness.' Then it occurs to him, 'Oh, if only I, with the breakup of the body, after death, would reappear in companionship with the Nāgas of spontaneous birth!' He, with the breakup of the body, after death, reappears in companionship with the Nāgas of spontaneous birth. This, monk, is the cause, this is the reason, by which some individual here, with the breakup of the body, after death, reappears in companionship with the Nāgas of spontaneous birth.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඒ භික්ෂුව එකත්පස්ව වාඩි වී භාග්‍යවතුන් වහන්සේට මෙය පැවසුවා: \"භාග්‍යවතුන් වහන්ස, මෙලොව යම් කෙනෙක් කය බිඳී මරණින් පසු, ඕපපාතික නාගයන්ගේ ඇසුරට පත්වන්නේද, ඊට හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?\"\n\n\"මහණ, මෙලොව ඇතැම් කෙනෙක් කයින් ද්විත්ව ක්‍රියා කරන්නෙක් වේ. වචනයෙන් ද්විත්ව ක්‍රියා කරන්නෙක් වේ. සිතින් ද්විත්ව ක්‍රියා කරන්නෙක් වේ. ඔහුට අසන්නට ලැබී තිබේ, 'ඕපපාතික නාගයෝ දීර්ඝායුෂ්ක වෙති, වර්ණවත් වෙති, සැප බහුල වෙති' කියා. ඔහුට මෙසේ සිතේ: 'අහෝ! මම කය බිඳී මරණින් පසු, ඕපපාතික නාගයන්ගේ ඇසුරට පත්වන්නට ලැබුණොත් ඉතා යහපති!' කියා. ඔහු කය බිඳී මරණින් පසු, ඕපපාතික නාගයන්ගේ ඇසුරට පත්වේ. මහණ, මෙලොව ඇතැම් කෙනෙක් කය බිඳී මරණින් පසු, ඕපපාතික නාගයන්ගේ ඇසුරට පත්වන්නේද, ඊට හේතුවත්, ප්‍රත්‍යයත් මේවාමයි.\"\n\nදසවැනි සූත්‍රයයි.",
      "paliTitle": "Catutthasutasuttaṃ",
      "vagga": ""
    },
    {
      "number": 352,
      "numberRange": "352-361",
      "pali": "Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘aṇḍajā nāgā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu…pe… upapajjatīti…pe… so pānaṃ deti…pe… vatthaṃ deti…pe… yānaṃ deti…pe… mālaṃ deti…pe… gandhaṃ deti…pe… vilepanaṃ deti…pe… seyyaṃ deti…pe… āvasathaṃ deti…pe… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā aṇḍajānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti. Vīsatimaṃ.",
      "english": "That monk, seated to one side, said this to the Blessed One: \"Venerable Sir, what indeed is the cause, what is the condition, by which some individual here, upon the breaking up of the body, after death, is reborn into the companionship of egg-born nāgas?\"\n\n\"Here, monk, some individual acts in two ways with the body, acts in two ways with speech, acts in two ways with the mind. He has heard: ‘Egg-born nāgas are long-lived, beautiful, and abundant in happiness.’ It occurs to him: ‘Oh, if only I, upon the breaking up of the body, after death, could be reborn into the companionship of egg-born nāgas!’\n\n\"He gives food. He gives drink. He gives clothing. He gives conveyances. He gives garlands. He gives perfumes. He gives unguents. He gives bedding. He gives dwellings. He gives lamps. He, upon the breaking up of the body, after death, is reborn into the companionship of egg-born nāgas.\n\n\"This, monk, is the cause, this is the condition, by which some individual here, upon the breaking up of the body, after death, is reborn into the companionship of egg-born nāgas.\"",
      "sinhala": "එක්පසෙක වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ස්වාමීනි, කුමක්ද හේතුව, කුමක්ද ප්‍රත්‍යය, යම් පුද්ගලයෙක් මෙලොව ශරීරය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණේද?\" \"මෙහිලා, මහණ, යම්කිසිවෙක් කයින් දෙයාකාරයෙන් ක්‍රියා කරයි, වචනයෙන් දෙයාකාරයෙන් ක්‍රියා කරයි, මනසින් දෙයාකාරයෙන් ක්‍රියා කරයි. ඔහුට මෙසේ අසා තිබේ: ‘අණ්ඩජ නාගයෝ දීර්ඝායුෂ්ක වෙති, වර්ණවත් වෙති, සැප බහුල වෙති’ කියා. ඔහුට මෙසේ සිතක් පහළ වේ: ‘අහෝ, මම කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙම්වා!’ කියා. ඔහු ආහාර දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. මහණ, මෙය හේතුවයි, මෙය ප්‍රත්‍යයයි, යම් පුද්ගලයෙක් මෙලොව ශරීරය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. එසේම ඔහු පාන දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. ඔහු වස්ත්‍ර දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. ඔහු යාන දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. ඔහු මාල දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. ඔහු ගන්ධ දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. ඔහු විලෙපන දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. ඔහු සයන දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. ඔහු ආවාස දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. ඔහු ප්‍රදීප (ආලෝක) දෙයි. ඔහු කය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණෙයි. මහණ, යම් පුද්ගලයෙක් මෙලොව ශරීරය බිඳී මරණින් මතු අණ්ඩජ නාගයන්ගේ සහාය භාවයට පැමිණේද, මේ හේතුවයි, මේ ප්‍රත්‍යයයි.\"",
      "paliTitle": "Aṇḍajadānūpakārasuttadasakaṃ",
      "vagga": ""
    },
    {
      "number": 362,
      "numberRange": "362-391",
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho so bhikkhu bhagavantaṃ etadavoca – ‘‘ko nu kho, bhante, hetu, ko paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā jalābujānaṃ nāgānaṃ… pe… saṃsedajānaṃ nāgānaṃ…pe… opapātikānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti? ‘‘Idha, bhikkhu, ekacco kāyena dvayakārī hoti, vācāya dvayakārī, manasā dvayakārī. Tassa sutaṃ hoti – ‘opapātikā nāgā dīghāyukā vaṇṇavanto sukhabahulā’ti. Tassa evaṃ hoti – ‘aho vatāhaṃ kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjeyya’nti. So annaṃ deti…pe… pānaṃ deti…pe… padīpeyyaṃ deti. So kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjati. Ayaṃ kho, bhikkhu, hetu, ayaṃ paccayo, yena midhekacco kāyassa bhedā paraṃ maraṇā opapātikānaṃ nāgānaṃ sahabyataṃ upapajjatī’’ti. (Iminā peyyālena dasa dasa suttantā kātabbā. Evaṃ catūsu yonīsu cattālīsaṃ veyyākaraṇā honti. Purimehi pana dasahi suttantehi saha honti paṇṇāsasuttantāti.)",
      "english": "At Sāvatthī. That bhikkhu, having sat down to one side, said this to the Blessed One: \"Venerable Sir, what is the reason, what is the condition, whereby someone here, after the breaking up of the body, after death, attains fellowship with the womb-born nāgas, the egg-born nāgas, the moisture-born nāgas, or the spontaneous-born nāgas?\"\n\n\"Here, bhikkhu, some individual acts in a dual manner with the body, acts in a dual manner with speech, acts in a dual manner with the mind. They have heard: 'The spontaneous-born nāgas are long-lived, beautiful, and abound in happiness.' They think thus: 'Oh, may I, after the breaking up of the body, after death, attain fellowship with the spontaneous-born nāgas!' They give food; they give drink; they give illumination. They, after the breaking up of the body, after death, attain fellowship with the spontaneous-born nāgas. This, bhikkhu, is the reason, this is the condition, whereby someone here, after the breaking up of the body, after death, attains fellowship with the spontaneous-born nāgas.\"",
      "sinhala": "එක් පසෙක වාඩි වී සිටි ඒ භික්ෂුව භාග්‍යවතුන් වහන්සේට මෙය පැවසීය:\n‘‘ස්වාමීනී, කවර නම් හේතුවකින්ද, කවර නම් ප්‍රත්‍යයකින්ද, මෙහි ඇතැම් පුද්ගලයෙක් කය බිඳී, මරණින් මතු ජලාබුජ (ගර්භාශයෙන් උපදින) නාගයන්ගේ ද, සංසේදජ (දහදියෙන් උපදින) නාගයන්ගේ ද, ඕපපාතික (උත්පත්තියෙන් පහළ වන) නාගයන්ගේ ද සහවාසයට පැමිණේද?’’\n\n‘‘මහණ, මෙහි ඇතැම් පුද්ගලයෙක් කයෙන් දෙයාකාරයෙන් ක්‍රියා කරයි. වචනයෙන් දෙයාකාරයෙන් ක්‍රියා කරයි. මනසින් දෙයාකාරයෙන් ක්‍රියා කරයි. ඔහුට මෙය අසා ඇත: ‘ඕපපාතික නාගයෝ දීර්ඝායුෂ්ක වෙති. වර්ණවන්ත වෙති. බොහෝ සැප ඇති වෙති’ යැයි. ඔහුට මෙසේ සිතේ: ‘අහෝ! මම ද කය බිඳී, මරණින් මතු ඕපපාතික නාගයන්ගේ සහවාසයට පැමිණියහොත් කොතරම් අගනේද!’ ඔහු ආහාර දෙයි… (පෙ)… පාන වර්ග දෙයි… (පෙ)… ආලෝක පූජා පවත්වයි. ඔහු කය බිඳී, මරණින් මතු ඕපපාතික නාගයන්ගේ සහවාසයට පැමිණේ. මහණ, මේයයි හේතුව, මේයයි ප්‍රත්‍යය, යම් පුද්ගලයෙක් මෙහිදී කය බිඳී, මරණින් මතු ඕපපාතික නාගයන්ගේ සහවාසයට පැමිණේද යනු.’’",
      "paliTitle": "Jalābujādidānūpakārasuttattiṃsakaṃ",
      "vagga": ""
    }
  ],
  "footer": {
    "pali": " Nāgasaṃyuttaṃ samattaṃ. Tassuddānaṃ – Suddhikaṃ paṇītataraṃ, caturo ca uposathā; Tassa sutaṃ caturo ca, dānūpakārā ca tālīsaṃ; Paṇṇāsa piṇḍato suttā, nāgamhi suppakāsitāti.",
    "english": "",
    "sinhala": ""
  }
}