{
  "id": "sn.3.2",
  "title": {
    "pali": "Rādhasaṃyuttaṃ",
    "english": "The Connected Discourses with Rādha",
    "sinhala": "රාධ සංයුත්තය"
  },
  "sections": [
    {
      "number": 160,
      "pali": "Sāvatthinidānaṃ. Atha kho āyasmā rādho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘Māro, māro’ti, bhante, vuccati. Kittāvatā nu kho, bhante, māro’’ti? ‘‘Rūpe kho, rādha, sati māro vā assa māretā vā yo vā pana mīyati. Tasmātiha tvaṃ, rādha, rūpaṃ māroti passa, māretāti passa, mīyatīti passa, rogoti passa, gaṇḍoti passa, sallanti passa, aghanti passa, aghabhūtanti passa. Ye naṃ evaṃ passanti te sammā passanti. Vedanāya sati… saññāya sati… saṅkhāresu sati… viññāṇe sati māro vā assa māretā vā yo vā pana mīyati. Tasmātiha tvaṃ, rādha, viññāṇaṃ māroti passa, māretāti passa, mīyatīti passa, rogoti passa, gaṇḍoti passa, sallanti passa, aghanti passa, aghabhūtanti passa. Ye naṃ evaṃ passanti, te sammā passantī’’ti. ‘‘Sammādassanaṃ pana, bhante, kimatthiya’’nti? ‘‘Sammādassanaṃ kho, rādha, nibbidatthaṃ’’. ‘‘Nibbidā pana, bhante, kimatthiyā’’ti? ‘‘Nibbidā kho, rādha, virāgatthā’’. ‘‘Virāgo pana, bhante, kimatthiyo’’ti? ‘‘Virāgo kho, rādha, vimuttattho’’. ‘‘Vimutti pana, bhante, kimatthiyā’’ti? ‘‘Vimutti kho, rādha, nibbānatthā’’. ‘‘Nibbānaṃ pana, bhante, kimatthiya’’nti? ‘‘Accayāsi [accasarā (sī. syā. kaṃ.), assa (pī.), accayā (ka.)], rādha, pañhaṃ, nāsakkhi pañhassa pariyantaṃ gahetuṃ. Nibbānogadhañhi, rādha, brahmacariyaṃ vussati, nibbānaparāyanaṃ nibbānapariyosāna’’nti. Paṭhamaṃ.",
      "english": "This discourse was delivered at Sāvatthī. Then, the venerable Rādhā approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, the venerable Rādhā said to the Blessed One: “‘Māra, Māra’ it is said, venerable sir. To what extent, venerable sir, is there Māra?”\n\n“When there is form, Rādhā, there is Māra, or the killer, or that which is killed. Therefore, Rādhā, you should see form as Māra, see it as the killer, see it as that which is killed, see it as a sickness, see it as a boil, see it as a dart, see it as misery, see it as that which has become misery. Those who see it thus, see rightly. When there is feeling, Rādhā, when there is perception, when there are mental formations, when there is consciousness, there is Māra, or the killer, or that which is killed. Therefore, Rādhā, you should see consciousness as Māra, see it as the killer, see it as that which is killed, see it as a sickness, see it as a boil, see it as a dart, see it as misery, see it as that which has become misery. Those who see it thus, see rightly.”\n\n“Right seeing, venerable sir, what is its purpose?”\n\n“Right seeing, Rādhā, is for the purpose of disenchantment.”\n\n“Disenchantment, venerable sir, what is its purpose?”\n\n“Disenchantment, Rādhā, is for the purpose of dispassion.”\n\n“Dispassion, venerable sir, what is its purpose?”\n\n“Dispassion, Rādhā, is for the purpose of liberation.”\n\n“Liberation, venerable sir, what is its purpose?”\n\n“Liberation, Rādhā, is for the purpose of Nibbāna.”\n\n“Nibbāna, venerable sir, what is its purpose?”\n\n“You have gone too far in questioning, Rādhā; you could not grasp the limit of the question. Indeed, Rādhā, the holy life is lived immersed in Nibbāna, having Nibbāna as its destination, Nibbāna as its culmination.”",
      "sinhala": "සැවැත්නුවරදී වදාළ සූත්‍රයකි.\n\nඉන්පසු ආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වැඳ නමස්කාර කොට, එක්පසෙක වාඩි විය. එක්පසෙක වාඩි වී සිටි ආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: ‘‘වහන්ස, ‘මාරයා, මාරයා’ යැයි කියනු ලැබේ. වහන්ස, කොපමණකින්ද මාරයා යනු කුමක්දැයි දත හැකිය?’’ ‘‘රාධ, රූපය ඇති විට මාරයා හෝ, මරා දමන්නා හෝ, මරණයට පත්වන්නා හෝ සිටිය හැකිය. එහෙයින් රාධ, ඔබ රූපය මාරයා යැයි දකින්න, මරා දමන්නා යැයි දකින්න, මරණයට පත්වන ස්වභාවය යැයි දකින්න, රෝගයක් යැයි දකින්න, ගෙඩියක් යැයි දකින්න, හුලක් යැයි දකින්න, දුකක් යැයි දකින්න, දුක ඇති කරන්නක් යැයි දකින්න. යමෙක් මෙසේ දකීද, ඔහු නිවැරදිව දකී. වේදනාව ඇති විට මාරයා හෝ, මරා දමන්නා හෝ, මරණයට පත්වන්නා හෝ සිටිය හැකිය. සංඥාව ඇති විට මාරයා හෝ, මරා දමන්නා හෝ, මරණයට පත්වන්නා හෝ සිටිය හැකිය. සංස්කාර ඇති විට මාරයා හෝ, මරා දමන්නා හෝ, මරණයට පත්වන්නා හෝ සිටිය හැකිය. විඤ්ඤාණය ඇති විට මාරයා හෝ, මරා දමන්නා හෝ, මරණයට පත්වන්නා හෝ සිටිය හැකිය. එහෙයින් රාධ, ඔබ විඤ්ඤාණය මාරයා යැයි දකින්න, මරා දමන්නා යැයි දකින්න, මරණයට පත්වන ස්වභාවය යැයි දකින්න, රෝගයක් යැයි දකින්න, ගෙඩියක් යැයි දකින්න, හුලක් යැයි දකින්න, දුකක් යැයි දකින්න, දුක ඇති කරන්නක් යැයි දකින්න. යමෙක් මෙසේ දකීද, ඔහු නිවැරදිව දකී.’’ ‘‘වහන්ස, නිවැරදි දැකීම කුමක් පිණිසද?’’ ‘‘රාධ, නිවැරදි දැකීම නිබ්බිදාව පිණිසයි.’’ ‘‘වහන්ස, නිබ්බිදාව කුමක් පිණිසද?’’ ‘‘රාධ, නිබ්බිදාව විරාගය පිණිසයි.’’ ‘‘වහන්ස, විරාගය කුමක් පිණිසද?’’ ‘‘රාධ, විරාගය විමුක්තිය පිණිසයි.’’ ‘‘වහන්ස, විමුක්තිය කුමක් පිණිසද?’’ ‘‘රාධ, විමුක්තිය නිර්වාණය පිණිසයි.’’ ‘‘වහන්ස, නිර්වාණය කුමක් පිණිසද?’’ ‘‘රාධ, ඔබ ප්‍රශ්නය ඉක්මවා ගියා; ඔබට ප්‍රශ්නයේ සීමාව අවබෝධ කරගැනීමට නොහැකි විය. රාධ, නිර්වාණයෙහිම ගැඹුරු වූ, නිර්වාණයම පිහිට කොටගත්, නිර්වාණයම අවසානය කොටගත් බ්‍රහ්මචර්යාව වසනු ලැබේ.’’\n\nපළමුවැන්නයි.",
      "paliTitle": "Mārasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 161,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘satto, satto’ti, bhante, vuccati. Kittāvatā nu kho, bhante, sattoti vuccatī’’ti? ‘‘Rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā, tatra satto, tatra visatto, tasmā sattoti vuccati. Vedanāya… saññāya… saṅkhāresu… viññāṇe yo chando yo rāgo yā nandī yā taṇhā, tatra satto, tatra visatto, tasmā sattoti vuccati’’. ‘‘Seyyathāpi, rādha, kumārakā vā kumārikāyo vā paṃsvāgārakehi kīḷanti. Yāvakīvañca tesu paṃsvāgārakesu avigatarāgā honti avigatacchandā avigatapemā avigatapipāsā avigatapariḷāhā avigatataṇhā, tāva tāni paṃsvāgārakāni allīyanti keḷāyanti dhanāyanti [manāyanti (sī. pī. ka.)] mamāyanti. Yato ca kho, rādha, kumārakā vā kumārikāyo vā tesu paṃsvāgārakesu vigatarāgā honti vigatacchandā vigatapemā vigatapipāsā vigatapariḷāhā vigatataṇhā, atha kho tāni paṃsvāgārakāni hatthehi ca pādehi ca vikiranti vidhamanti viddhaṃsenti vikīḷaniyaṃ [vikīḷanikaṃ (sī. syā. kaṃ. pī.)] karonti. Evameva kho, rādha, tumhepi rūpaṃ vikiratha vidhamatha viddhaṃsetha vikīḷaniyaṃ karotha taṇhākkhayāya paṭipajjatha. Vedanaṃ vikiratha vidhamatha viddhaṃsetha vikīḷaniyaṃ karotha taṇhākkhayāya paṭipajjatha. Saññaṃ… saṅkhāre vikiratha vidhamatha viddhaṃsetha vikīḷaniyaṃ karotha taṇhākkhayāya paṭipajjatha. Viññāṇaṃ vikiratha vidhamatha viddhaṃsetha vikīḷaniyaṃ karotha taṇhākkhayāya paṭipajjatha. Taṇhākkhayo hi, rādha, nibbāna’’nti. Dutiyaṃ.",
      "english": "The Venerable Rādha, seated to one side, said to the Blessed One, \"Venerable sir, it is said, 'a being, a being.' To what extent, Venerable sir, is one called 'a being'?\"\n\n\"In form, Rādha, whatever is desire, whatever is passion, whatever is delight, whatever is craving—there one is attached, there one is entangled. That is why one is called 'a being.' In feeling... in perception... in volitional formations... in consciousness, whatever is desire, whatever is passion, whatever is delight, whatever is craving—there one is attached, there one is entangled. That is why one is called 'a being.'\"\n\n\"Just as, Rādha, boys or girls play with sand-houses. As long as they are not rid of lust for those sand-houses, not rid of desire, not rid of affection, not rid of thirst, not rid of feverishness, not rid of craving, for so long they cherish those sand-houses, play with them, value them, and treat them as their own. But when, Rādha, boys or girls are rid of lust for those sand-houses, rid of desire, rid of affection, rid of thirst, rid of feverishness, rid of craving, then they scatter those sand-houses with their hands and feet, demolish them, destroy them, and make them unplayable. In the same way, Rādha, you too should scatter form, demolish it, destroy it, make it unplayable, and practice for the destruction of craving. Scatter feeling, demolish it, destroy it, make it unplayable, and practice for the destruction of craving. Scatter perception... scatter volitional formations... scatter consciousness, demolish it, destroy it, make it unplayable, and practice for the destruction of craving. For the destruction of craving, Rādha, is Nibbāna.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\nඑකත්පසෙක වැඩහුන් ආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවා: \"භාග්‍යවතුන් වහන්ස, 'සත්වයා, සත්වයා' යැයි කියනු ලැබේ. භාග්‍යවතුන් වහන්ස, කෙතරම් ප්‍රමාණයකින් නම් සත්වයා යැයි කියනු ලැබේ ද?\"\n\n\"රාධ, රූපය කෙරෙහි යම් ඡන්දයක් (කැමැත්තක්) වේ ද, යම් රාගයක් (ඇලීමක්) වේ ද, යම් නන්දියක් (බැඳීමක්) වේ ද, යම් තණ්හාවක් (දැඩි ආශාවක්) වේ ද, එහි බැඳී සිටියි, එහි දැඩි ලෙස ඇලී සිටියි. එහෙයින් සත්වයා යැයි කියනු ලැබේ. වේදනාව කෙරෙහි යම් ඡන්දයක් වේ ද, යම් රාගයක් වේ ද, යම් නන්දියක් වේ ද, යම් තණ්හාවක් වේ ද, එහි බැඳී සිටියි, එහි දැඩි ලෙස ඇලී සිටියි. එහෙයින් සත්වයා යැයි කියනු ලැබේ. සඤ්ඤාව කෙරෙහි යම් ඡන්දයක් වේ ද, යම් රාගයක් වේ ද, යම් නන්දියක් වේ ද, යම් තණ්හාවක් වේ ද, එහි බැඳී සිටියි, එහි දැඩි ලෙස ඇලී සිටියි. එහෙයින් සත්වයා යැයි කියනු ලැබේ. සංඛාර කෙරෙහි යම් ඡන්දයක් වේ ද, යම් රාගයක් වේ ද, යම් නන්දියක් වේ ද, යම් තණ්හාවක් වේ ද, එහි බැඳී සිටියි, එහි දැඩි ලෙස ඇලී සිටියි. එහෙයින් සත්වයා යැයි කියනු ලැබේ. විඤ්ඤාණය කෙරෙහි යම් ඡන්දයක් වේ ද, යම් රාගයක් වේ ද, යම් නන්දියක් වේ ද, යම් තණ්හාවක් වේ ද, එහි බැඳී සිටියි, එහි දැඩි ලෙස ඇලී සිටියි. එහෙයින් සත්වයා යැයි කියනු ලැබේ.\"\n\n\"රාධ, යම් සේ ද පිරිමි ළමයි හෝ ගැහැනු ළමයි වැලිගෙවල් වලින් සෙල්ලම් කරති. යම්තාක් කල් ඒ වැලිගෙවල් කෙරෙහි ඔවුන්ගේ රාගය දුරු වී නොසිටිත් ද, ඡන්දය දුරු වී නොසිටිත් ද, ප්‍රේමය දුරු වී නොසිටිත් ද, පිපාසය දුරු වී නොසිටිත් ද, දැවිල්ල දුරු වී නොසිටිත් ද, තණ්හාව දුරු වී නොසිටිත් ද, එතෙක් කල් ඒ වැලිගෙවල් වලට ඔවුහු ඇලී සිටිති, සතුටු වෙති, වස්තුවක් ලෙස සලකති, මාගේ යැයි සලකති. නමුත් රාධ, යම් කලක නම් පිරිමි ළමයි හෝ ගැහැනු ළමයි ඒ වැලිගෙවල් කෙරෙහි රාගය දුරු වී සිටිත් ද, ඡන්දය දුරු වී සිටිත් ද, ප්‍රේමය දුරු වී සිටිත් ද, පිපාසය දුරු වී සිටිත් ද, දැවිල්ල දුරු වී සිටිත් ද, තණ්හාව දුරු වී සිටිත් ද, එවිට ඔවුහු අත්වලින් හා පාදවලින් ඒ වැලිගෙවල් විසුරුවති, විනාශ කරති, සම්පූර්ණයෙන්ම කඩා බිඳ දමති, සෙල්ලම් කිරීමට නුසුදුසු තත්ත්වයට පත් කරති.\n\nඑසෙව ම ය, රාධ, ඔබ ද රූපය විසුරුවන්න, විනාශ කරන්න, සම්පූර්ණයෙන්ම කඩා බිඳ දමන්න, (ඇලීමට) නුසුදුසු තත්ත්වයට පත් කරන්න. තණ්හාව ක්ෂය කිරීම පිණිස පිළිපදින්න. වේදනාව විසුරුවන්න, විනාශ කරන්න, සම්පූර්ණයෙන්ම කඩා බිඳ දමන්න, (ඇලීමට) නුසුදුසු තත්ත්වයට පත් කරන්න. තණ්හාව ක්ෂය කිරීම පිණිස පිළිපදින්න. සඤ්ඤාව විසුරුවන්න, විනාශ කරන්න, සම්පූර්ණයෙන්ම කඩා බිඳ දමන්න, (ඇලීමට) නුසුදුසු තත්ත්වයට පත් කරන්න. තණ්හාව ක්ෂය කිරීම පිණිස පිළිපදින්න. සංඛාර විසුරුවන්න, විනාශ කරන්න, සම්පූර්ණයෙන්ම කඩා බිඳ දමන්න, (ඇලීමට) නුසුදුසු තත්ත්වයට පත් කරන්න. තණ්හාව ක්ෂය කිරීම පිණිස පිළිපදින්න. විඤ්ඤාණය විසුරුවන්න, විනාශ කරන්න, සම්පූර්ණයෙන්ම කඩා බිඳ දමන්න, (ඇලීමට) නුසුදුසු තත්ත්වයට පත් කරන්න. තණ්හාව ක්ෂය කිරීම පිණිස පිළිපදින්න. රාධ, තණ්හාව ක්ෂය වීම ම නිවන ය.\"",
      "paliTitle": "Sattasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 162,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘bhavanettinirodho [bhavanetti (sī. syā. kaṃ. pī.)], bhavanettinirodho’ti [bhavanettīti (sī. syā. kaṃ.)], bhante, vuccati. Katamā nu kho, bhante, bhavanetti, katamo bhavanettinirodho’’ti? ‘‘Rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā – ayaṃ vuccati bhavanetti. Tesaṃ nirodho [nirodhā (sī. syā. kaṃ. pī.)] bhavanettinirodho. Vedanāya… saññāya… saṅkhāresu … viññāṇe yo chando…pe… adhiṭṭhānābhinivesānusayā – ayaṃ vuccati bhavanetti. Tesaṃ nirodho bhavanettinirodho’’ti. Tatiyaṃ.",
      "english": "At Sāvatthī.\nThen, Venerable Rādha, seated to one side, addressed the Blessed One thus: \"'The cessation of the conduit to renewed existence, the cessation of the conduit to renewed existence' is spoken of, venerable sir. But what, venerable sir, is the conduit to renewed existence, and what is the cessation of the conduit to renewed existence?\"\n\n\"Rādha, that desire, that passion, that delight, that craving, those inclinations and clingings, the mind's fixed applications, strong adherences, and underlying tendencies concerning form — this is called the conduit to renewed existence. The cessation of these is the cessation of the conduit to renewed existence. In feeling, that desire, that passion, that delight, that craving, those inclinations and clingings, the mind's fixed applications, strong adherences, and underlying tendencies — this is called the conduit to renewed existence. The cessation of these is the cessation of the conduit to renewed existence. In perception, that desire, that passion, that delight, that craving, those inclinations and clingings, the mind's fixed applications, strong adherences, and underlying tendencies — this is called the conduit to renewed existence. The cessation of these is the cessation of the conduit to renewed existence. In mental formations, that desire, that passion, that delight, that craving, those inclinations and clingings, the mind's fixed applications, strong adherences, and underlying tendencies — this is called the conduit to renewed existence. The cessation of these is the cessation of the conduit to renewed existence. In consciousness, that desire, that passion, that delight, that craving, those inclinations and clingings, the mind's fixed applications, strong adherences, and underlying tendencies — this is called the conduit to renewed existence. The cessation of these is the cessation of the conduit to renewed existence.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑක් පසෙක අසුන්ගෙන සිටි ආයුෂ්මත් රාධ තෙරුන් භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘‘භවය ඇති කරන මාර්ගයාගේ නිරෝධය, භවය ඇති කරන මාර්ගයාගේ නිරෝධය’ යනුවෙන්, ස්වාමීනි, කියනු ලැබේ. ස්වාමීනි, භවය ඇති කරන මාර්ගය යනු කවරේද? භවය ඇති කරන මාර්ගයාගේ නිරෝධය යනු කවරේද?’’\n\n‘‘රාධය, රූපයෙහි යම් ඡන්දයක් (කැමැත්තක්) ඇත්ද, යම් රාගයක් (ඇලීමක්) ඇත්ද, යම් නන්දියක් (ඇසිරීමක්) ඇත්ද, යම් තෘෂ්ණාවක් (තණ්හාවක්) ඇත්ද, යම් උපය උපාදානයන් (තදින් අල්වාගැනීම්) ඇත්ද, චෛතසික අධිෂ්ඨානයන් (තදින් පිහිටුවාගැනීම්), අභිනිවේශයන් (දෘෂ්ටි වශයෙන් තදින් අල්වාගැනීම්), අනුසය ධර‍්මයන් (යටිබදනානුසය) ඇත්ද – මෙය භවය ඇති කරන මාර්ගය යැයි කියනු ලැබේ. ඒවායේ නිරෝධය භවය ඇති කරන මාර්ගයාගේ නිරෝධය වේ.\n\nවේදනාවෙහිද, සංඥාවෙහිද, සංස්කාරයන්හිද, විඤ්ඤාණයෙහිද යම් ඡන්දයක් ඇත්ද, යම් රාගයක් ඇත්ද, යම් නන්දියක් ඇත්ද, යම් තෘෂ්ණාවක් ඇත්ද, යම් උපය උපාදානයන් ඇත්ද, චෛතසික අධිෂ්ඨානයන්, අභිනිවේශයන්, අනුසය ධර‍්මයන් ඇත්ද – මෙය භවය ඇති කරන මාර්ගය යැයි කියනු ලැබේ. ඒවායේ නිරෝධය භවය ඇති කරන මාර්ගයාගේ නිරෝධය වේ.’’",
      "paliTitle": "Bhavanettisuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 163,
      "pali": "Sāvatthinidānaṃ. Āyasmā rādho yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘Pariññeyye ca, rādha, dhamme desessāmi pariññañca pariññātāviṃ puggalañca. Taṃ suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho āyasmā rādho bhagavato paccassosi. Bhagavā etadavoca – ‘‘katame ca, rādha, pariññeyyā dhammā? Rūpaṃ kho, rādha, pariññeyyo dhammo, vedanā pariññeyyo dhammo, saññā pariññeyyo dhammo, saṅkhārā pariññeyyo dhammo, viññāṇaṃ pariññeyyo dhammo. Ime vuccanti, rādha, pariññeyyā dhammā. Katamā ca, rādha, pariññā? Yo kho, rādha, rāgakkhayo dosakkhayo mohakkhayo – ayaṃ vuccati, rādha, pariññā. Katamo ca, rādha, pariññātāvī puggalo? ‘Arahā’tissa vacanīyaṃ. Yvāyaṃ āyasmā evaṃnāmo evaṃgotto – ayaṃ vuccati, rādha, pariññātāvī puggalo’’ti. Catutthaṃ.",
      "english": "At Savatthi. The Venerable Radha approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. To the Venerable Radha, as he was sitting to one side, the Blessed One spoke thus:\n\n\"Radha, I shall teach the things to be fully understood, the full understanding, and the person who has fully understood. Listen to that, attend carefully; I shall speak.\"\n\n\"Yes, Venerable Sir,\" the Venerable Radha replied to the Blessed One.\n\nThe Blessed One spoke thus: \"And what, Radha, are the things to be fully understood? Form, Radha, is a thing to be fully understood; feeling is a thing to be fully understood; perception is a thing to be fully understood; mental formations are a thing to be fully understood; consciousness is a thing to be fully understood. These, Radha, are called the things to be fully understood.\n\n\"And what, Radha, is the full understanding? Radha, the destruction of lust, the destruction of hatred, the destruction of delusion—this is called the full understanding.\n\n\"And what, Radha, is the person who has fully understood? 'He is an Arahant' is what should be said of him. This Venerable one, of such a name and such a clan, is called the person who has fully understood.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වාඩි වූ සේක. එකත්පස්ව වැඩසිටි ආයුෂ්මත් රාධ තෙරුන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: ‘‘රාධය, පිරිසිඳ දත යුතු ධර්මයන්ද, පිරිසිඳ දැනීමද, පිරිසිඳ දත් පුද්ගලයාද මම දේශනා කරන්නෙමි. එය අසන්න. මැනවින් මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි’’යි. ‘‘එසේය, භාග්‍යවතුන් වහන්සැ’’යි ආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන් සේක. භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: ‘‘රාධය, පිරිසිඳ දත යුතු ධර්මයන් කවරේද? රාධය, රූපය පිරිසිඳ දත යුතු ධර්මයකි. වේදනාව පිරිසිඳ දත යුතු ධර්මයකි. සංඥාව පිරිසිඳ දත යුතු ධර්මයකි. සංස්කාර පිරිසිඳ දත යුතු ධර්මයකි. විඤ්ඤාණය පිරිසිඳ දත යුතු ධර්මයකි. රාධය, මේවා පිරිසිඳ දත යුතු ධර්මයන් යැයි කියනු ලැබේ. රාධය, පිරිසිඳ දැනීම කවරේද? රාධය, යම් රාගක්ෂයයක් වේද, ද්වේෂක්ෂයයක් වේද, මෝහක්ෂයයක් වේද – රාධය, මේක පිරිසිඳ දැනීම යැයි කියනු ලැබේ. රාධය, පිරිසිඳ දත් පුද්ගලයා කවරේද? ‘අරහත්’ යැයි ඔහුට කිය යුතුයි. යම් ආයුෂ්මත් කෙනෙක් මෙබඳු නම් ඇත්තෙක් වේද, මෙබඳු ගෝත්‍ර ඇත්තෙක් වේද – රාධය, මේ පුද්ගලයා පිරිසිඳ දත් පුද්ගලයා යැයි කියනු ලැබේ.’’",
      "paliTitle": "Pariññeyyasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 164,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘pañcime, rādha, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho, vedanupādānakkhandho, saññupādānakkhandho, saṅkhārupādānakkhandho, viññāṇupādānakkhandho. Ye hi keci, rādha, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ upādānakkhandhānaṃ assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti; na me te, rādha, samaṇā vā brāhmaṇā vā samaṇesu vā samaṇasammatā brāhmaṇesu vā brāhmaṇasammatā, na ca pana te āyasmanto sāmaññatthaṃ vā brahmaññatthaṃ vā diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharanti. Ye ca kho keci, rādha, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ upādānakkhandhānaṃ assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānanti; te kho me, rādha, samaṇā vā brāhmaṇā vā samaṇesu ceva samaṇasammatā brāhmaṇesu ca brāhmaṇasammatā, te ca panāyasmanto sāmaññatthañca brahmaññatthañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Pañcamaṃ.",
      "english": "The Blessed One said this to Venerable Radha, who was seated to one side: “These five, Radha, are the aggregates subject to clinging. Which five? The aggregate of form subject to clinging, the aggregate of feeling subject to clinging, the aggregate of perception subject to clinging, the aggregate of mental formations subject to clinging, and the aggregate of consciousness subject to clinging. Any recluses or brahmins, Radha, who do not understand, as they really are, the gratification, the danger, and the escape regarding these five aggregates subject to clinging; I do not consider those recluses or brahmins, Radha, to be recluses among recluses, or brahmins among brahmins. Nor do those venerable ones, having realized for themselves through direct knowledge and attained in this very life the goal of recluseship or brahminhood, dwell therein. But any recluses or brahmins, Radha, who do understand, as they really are, the gratification, the danger, and the escape regarding these five aggregates subject to clinging; those recluses or brahmins, Radha, I consider to be recluses among recluses and brahmins among brahmins. And those venerable ones, having realized for themselves through direct knowledge and attained in this very life the goal of recluseship and brahminhood, dwell therein.”",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි. එකත්පස්ව වැඩහුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n‘‘රාධය, මේ උපාදානස්කන්ධයෝ පස්දෙනෙක් වෙති. කවරහුද ඒ පස්දෙනා? රූපූපාදානස්කන්ධය, වේදනාඋපාදානස්කන්ධය, සංඥාඋපාදානස්කන්ධය, සංඛාරඋපාදානස්කන්ධය, විඤ්ඤාණඋපාදානස්කන්ධය යන මේවායි.\n\nරාධය, යම් කිසි ශ්‍රමණ‍් හෝ බ්‍රාහ්මණ‍් හෝ මේ පස් උපාදානස්කන්ධයන්ගේ ආස්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් නොදනිත්ද; රාධය, මා විසින් ඔවුහු ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙසද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙසද, පිළිගනු නොලැබෙත්. එම ආයුෂ්මත්වරු මේ ආත්මභාවයේදීම ශ්‍රමණභාවය හෝ බ්‍රාහ්මණභාවය තම නැණින් අවබෝධයෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය නොකරති.\n\nරාධය, යම් කිසි ශ්‍රමණ‍් හෝ බ්‍රාහ්මණ‍් හෝ මේ පස් උපාදානස්කන්ධයන්ගේ ආස්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් දනිත්ද; රාධය, මා විසින් ඔවුහු ශ්‍රමණයන් අතර ශ්‍රමණයන් ලෙසද, බ්‍රාහ්මණයන් අතර බ්‍රාහ්මණයන් ලෙසද, සැබැවින්ම පිළිගනු ලැබෙත්. එම ආයුෂ්මත්වරු මේ ආත්මභාවයේදීම ශ්‍රමණභාවය හා බ්‍රාහ්මණභාවය තම නැණින් අවබෝධයෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරති.’’\n\nපස්වැනි සූත්‍රයයි.",
      "paliTitle": "Samaṇasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 165,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘pañcime, rādha, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho…pe… viññāṇupādānakkhandho. Ye hi keci, rādha, samaṇā vā brāhmaṇā vā imesaṃ pañcannaṃ upādānakkhandhānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ nappajānanti…pe… sayaṃ abhiññā sacchikatvā upasampajja viharantī’’ti. Chaṭṭhaṃ.",
      "english": "The Blessed One addressed Venerable Rādha, who was seated to one side, saying: \"Rādha, there are these five aggregates of clinging. Which five? The aggregate of clinging to form, the aggregate of clinging to feeling, the aggregate of clinging to perception, the aggregate of clinging to mental formations, and the aggregate of clinging to consciousness. Indeed, Rādha, whatever ascetics or brahmins do not truly understand, as they really are, the origin, the passing away, the gratification, the danger, and the escape concerning these five aggregates of clinging, they are not considered by me as true ascetics or true brahmins, nor do those venerable ones, having directly known and realized for themselves, abide in the purpose of asceticism or the purpose of the holy life in this very life. But, Rādha, whatever ascetics or brahmins truly understand, as they really are, the origin, the passing away, the gratification, the danger, and the escape concerning these five aggregates of clinging, they are considered by me as true ascetics or true brahmins, and those venerable ones, having directly known and realized for themselves, abide in the purpose of asceticism or the purpose of the holy life in this very life.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑක්පසෙක වැඩහුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: \"රාධය, මේවා පස් උපාදානස්කන්ධයෝ ය. කවරහු ද ඒ පස් දෙන? රූප උපාදානස්කන්ධය, වේදනා උපාදානස්කන්ධය, සංඥා උපාදානස්කන්ධය, සංස්කාර උපාදානස්කන්ධය, විඤ්ඤාණ උපාදානස්කන්ධය යි. රාධය, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ මේ පස් උපාදානස්කන්ධයන්ගේ සමුදය ද, අත්ථංගමය ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, යථාභූත වශයෙන් නොදනිත් ද, ඔවුහු මා විසින් ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ යැයි ගණන් ගනු නොලබත්. තවද ඔවුහු මේ දැක දැක ම තමන් විසින් ම අභිඥාවෙන් (විශේෂ ඥානයෙන්) අවබෝධ කොට ප්‍රත්‍යක්ෂ කරගෙන, ශ්‍රමණ ඵලය හෝ බ්‍රාහ්මණ ඵලය උපසම්පදා කොට වාසය නොකරති. එහෙත් රාධය, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ මේ පස් උපාදානස්කන්ධයන්ගේ සමුදය ද, අත්ථංගමය ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද, යථාභූත වශයෙන් දනිත් ද, ඔවුහු මා විසින් ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ යැයි ගණන් ගනු ලබත්. තවද ඔවුහු මේ දැක දැක ම තමන් විසින් ම අභිඥාවෙන් (විශේෂ ඥානයෙන්) අවබෝධ කොට ප්‍රත්‍යක්ෂ කරගෙන, ශ්‍රමණ ඵලය හෝ බ්‍රාහ්මණ ඵලය උපසම්පදා කොට වාසය කෙරෙත් ය.\"",
      "paliTitle": "Dutiyasamaṇasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 166,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘pañcime, rādha, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho…pe… viññāṇupādānakkhandho. Yato kho, rādha, ariyasāvako imesaṃ pañcannaṃ upādānakkhandhānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti – ayaṃ vuccati, rādha, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Sattamaṃ.",
      "english": "At Sāvatthī. The Blessed One addressed the Venerable Rādha, who was seated to one side, saying: \"There are, Rādha, these five clinging-aggregates. Which five? The clinging-aggregate of form, the clinging-aggregate of feeling, the clinging-aggregate of perception, the clinging-aggregate of mental formations, and the clinging-aggregate of consciousness. When, Rādha, a noble disciple truly understands, as it actually is, the origin, the cessation, the gratification, the drawback, and the escape from these five clinging-aggregates – this noble disciple, Rādha, is called a stream-entrant, one no longer subject to falling into lower states, assured, bound for full awakening.\"",
      "sinhala": "සැවැත්නුවර දී දේශනා කරන ලද්දකි. එක්පසෙක වැඩසිටි ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"රාධය, මේ පඤ්ච උපාදානස්කන්ධයෝ යි. ඒ පස්දෙනා කවරහුද? රූප උපාදානස්කන්ධය, වේදනා උපාදානස්කන්ධය, සංඥා උපාදානස්කන්ධය, සංඛාර උපාදානස්කන්ධය, විඤ්ඤාණ උපාදානස්කන්ධය යන මේවා යි. රාධය, යම් හෙයකින් ආර්ය ශ්‍රාවක තෙම මේ පඤ්ච උපාදානස්කන්ධයන්ගේ හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, ඇති සැටියෙන් ප්‍රඥාවෙන් දනී ද – රාධය, මේ ආර්ය ශ්‍රාවක තෙම සෝවාන් වූයේ යැයි ද, අපායට නොවැටෙන සුලු ස්වභාව ඇත්තේ යැයි ද, නියත වූයේ යැයි ද, සම්බෝධිය පිණිස ම ගාමී වූයේ යැයි ද කියනු ලැබේ.\"",
      "paliTitle": "Sotāpannasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 167,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘pañcime, rādha, upādānakkhandhā. Katame pañca? Rūpupādānakkhandho…pe… viññāṇupādānakkhandho. Yato kho, rādha, bhikkhu imesaṃ pañcannaṃ upādānakkhandhānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto hoti – ayaṃ vuccati, rādha, arahaṃ khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññāvimutto’’ti. Aṭṭhamaṃ.",
      "english": "At Sāvatthī. The Blessed One said this to the venerable Rādha, who was seated to one side: \"Rādha, there are these five aggregates of clinging. Which five? The aggregate of clinging to form, the aggregate of clinging to feeling, the aggregate of clinging to perception, the aggregate of clinging to mental formations, and the aggregate of clinging to consciousness. Indeed, Rādha, when a monastic, having truly understood the origin, the passing away, the gratification, the danger, and the escape from these five aggregates of clinging, becomes liberated through non-clinging – that person, Rādha, is called an Arahant, one whose taints are destroyed, who has lived the holy life, who has completed what had to be done, who has laid down the burden, who has attained their true aim, whose fetters of existence are fully destroyed, and who is rightly liberated through perfect knowledge.\"",
      "sinhala": "සා​වැත් නුවරදී වදාළ සූත්‍රයකි.\n\nඑක් පසෙක අසුන්ගෙන සිටි ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"රාධය, මේ උපාදානස්කන්ධ පසක් ඇත. කවරේද ඒ පස? රූප​උපාදානස්කන්ධය... (පෙ)... විඤ්ඤාණ​උපාදානස්කන්ධයයි. රාධය, යම් හෙයකින් භික්ෂුවක් මේ පංච උපාදානස්කන්ධයන්ගේ හටගැනීමත්, නැතිවීමත්, ආශ්වාදයත්, ආදීනවයත්, ඒවායින් මිදීමත් ඇති සැටියෙන් දැනගෙන, නොඇලීමෙන් විමුක්ත වෙයි නම්, රාධය, මේ භික්ෂුව 'ආශ්‍රවයන් ක්ෂය කළ, බඹසර​වාසය සම්පූර්ණ කළ, කළයුතු සියල්ල කළ, බර බහා තැබූ, තමාගේ නියම අරමුණට පැමිණි, භවබන්ධන මුළුමනින්ම ක්ෂය කළ, නියම ප්‍රඥාවෙන් විමුක්ත වූ රහතන් වහන්සේ' යැයි කියනු ලැබේ.\" අටවැනි සූත්‍රයයි.",
      "paliTitle": "Arahantasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 168,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā, taṃ pajahatha. Evaṃ taṃ rūpaṃ pahīnaṃ bhavissati ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ. Vedanāya yo chando yo rāgo yā nandī yā taṇhā, taṃ pajahatha. Evaṃ sā vedanā pahīnā bhavissati ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Saññāya… saṅkhāresu yo chando yo rāgo yā nandī yā taṇhā, taṃ pajahatha. Evaṃ te saṅkhārā pahīnā bhavissanti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Viññāṇe yo chando yo rāgo yā nandī yā taṇhā, taṃ pajahatha. Evaṃ taṃ viññāṇaṃ pahīnaṃ bhavissati…pe… anuppādadhamma’’nti. Navamaṃ.",
      "english": "At Sāvatthī. The Blessed One said this to the Venerable Rādha, who was sitting to one side:\n\n“Rādha, abandon whatever desire, passion, delight, or craving there is for form. Thus, that form will be abandoned, uprooted, made like a palm-stump, rendered utterly non-existent, and no longer subject to future arising.\n\nAbandon whatever desire, passion, delight, or craving there is for feeling. Thus, that feeling will be abandoned, uprooted, made like a palm-stump, rendered utterly non-existent, and no longer subject to future arising.\n\nAbandon whatever desire, passion, delight, or craving there is for perception. Thus, that perception will be abandoned, uprooted, made like a palm-stump, rendered utterly non-existent, and no longer subject to future arising.\n\nAbandon whatever desire, passion, delight, or craving there is for volitional formations. Thus, those volitional formations will be abandoned, uprooted, made like a palm-stump, rendered utterly non-existent, and no longer subject to future arising.\n\nAbandon whatever desire, passion, delight, or craving there is for consciousness. Thus, that consciousness will be abandoned, uprooted, made like a palm-stump, rendered utterly non-existent, and no longer subject to future arising.”",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදී.\n\nඑක් පසෙක අසුන්ගෙන සිටි ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍ය​වතුන් වහන්සේ මෙසේ වදාළ සේක: “රාධයෙනි, රූපයෙහි යම් ඡන්දයක්, යම් රාගයක්, යම් නන්දියක්, යම් තණ්හාවක් ඇද්ද, එය අත්​හරින්න. එසේ එය අත්හැරීමෙන් ඒ රූපය ප්‍රහීණ වන්නේය; මුල සිඳ දැමූ, තල්​ගසක මුලක් මෙන් යළි හට නොගන්නා සේ අවශේෂ වූ, අභාවයට පත් කරන ලද, අනාගතයෙහි යළි නූපදින ස්ව​භාවයෙන් යුක්ත වූවක් බවට පත්​වන්නේය.\n\nවේදනාවෙහි යම් ඡන්දයක්, යම් රාගයක්, යම් නන්දියක්, යම් තණ්හාවක් ඇද්ද, එය අත්​හරින්න. එසේ එය අත්හැරීමෙන් ඒ වේදනාව ප්‍රහීණ වන්නේය; මුල සිඳ දැමූ, තල්​ගසක මුලක් මෙන් යළි හට නොගන්නා සේ අවශේෂ වූ, අභාවයට පත් කරන ලද, අනාගතයෙහි යළි නූපදින ස්ව​භාවයෙන් යුක්ත වූවක් බවට පත්​වන්නේය.\n\nසං​ඥාවෙහි යම් ඡන්දයක්, යම් රාගයක්, යම් නන්දියක්, යම් තණ්හාවක් ඇද්ද, එය අත්​හරින්න. එසේ එය අත්හැරීමෙන් ඒ සං​ඥාව ප්‍රහීණ වන්නේය; මුල සිඳ දැමූ, තල්​ගසක මුලක් මෙන් යළි හට නොගන්නා සේ අවශේෂ වූ, අභාවයට පත් කරන ලද, අනාගතයෙහි යළි නූපදින ස්ව​භාවයෙන් යුක්ත වූවක් බවට පත්​වන්නේය.\n\nසං​ස්කාරයන්හි යම් ඡන්දයක්, යම් රාගයක්, යම් නන්දියක්, යම් තණ්හාවක් ඇද්ද, එය අත්​හරින්න. එසේ එය අත්හැරීමෙන් ඒ සං​ස්කාර ප්‍රහීණ වන්නේය; මුල සිඳ දැමූ, තල්​ගසක මුලක් මෙන් යළි හට නොගන්නා සේ අවශේෂ වූ, අභාවයට පත් කරන ලද, අනාගතයෙහි යළි නූපදින ස්ව​භාවයෙන් යුක්ත වූවක් බවට පත්​වන්නේය.\n\nවිඤ්ඤාණයෙහි යම් ඡන්දයක්, යම් රාගයක්, යම් නන්දියක්, යම් තණ්හාවක් ඇද්ද, එය අත්​හරින්න. එසේ එය අත්හැරීමෙන් ඒ විඤ්ඤාණය ප්‍රහීණ වන්නේය; මුල සිඳ දැමූ, තල්​ගසක මුලක් මෙන් යළි හට නොගන්නා සේ අවශේෂ වූ, අභාවයට පත් කරන ලද, අනාගතයෙහි යළි නූපදින ස්ව​භාවයෙන් යුක්ත වූවක් බවට පත්​වන්නේය.”",
      "paliTitle": "Chandarāgasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 169,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘rūpe kho, rādha, yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahatha. Evaṃ taṃ rūpaṃ pahīnaṃ bhavissati ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhammaṃ. Vedanāya yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahatha. Evaṃ sā vedanā pahīnā bhavissati ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Saññāya… saṅkhāresu yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahatha. Evaṃ te saṅkhārā pahīnā bhavissanti ucchinnamūlā tālāvatthukatā anabhāvaṃkatā āyatiṃ anuppādadhammā. Viññāṇe yo chando yo rāgo yā nandī yā taṇhā ye upayupādānā cetaso adhiṭṭhānābhinivesānusayā, te pajahatha. Evaṃ taṃ viññāṇaṃ pahīnaṃ bhavissati ucchinnamūlaṃ tālāvatthukataṃ anabhāvaṃkataṃ āyatiṃ anuppādadhamma’’nti. Dasamaṃ. Rādhasaṃyuttassa paṭhamo vaggo. Tassuddānaṃ – Māro satto bhavanetti, pariññeyyā samaṇā duve; Sotāpanno arahā ca, chandarāgāpare duveti.",
      "english": "At Sāvatthī.\n\nThen, the Blessed One addressed Venerable Rādha, who was seated to one side, saying: \"Rādha, whatever desire, whatever passion, whatever delight, whatever craving, whatever grasping, clinging, mental resolve, adherence, and underlying tendencies of the mind there are in form — abandon them. Thus, that form will be abandoned, cut off at the root, made like a palm stump, brought to non-existence, and unable to arise again in the future. Whatever desire, whatever passion, whatever delight, whatever craving, whatever grasping, clinging, mental resolve, adherence, and underlying tendencies of the mind there are in feeling — abandon them. Thus, that feeling will be abandoned, cut off at the root, made like a palm stump, brought to non-existence, and unable to arise again in the future. Whatever desire, whatever passion, whatever delight, whatever craving, whatever grasping, clinging, mental resolve, adherence, and underlying tendencies of the mind there are in perception — abandon them. Thus, that perception will be abandoned, cut off at the root, made like a palm stump, brought to non-existence, and unable to arise again in the future. Whatever desire, whatever passion, whatever delight, whatever craving, whatever grasping, clinging, mental resolve, adherence, and underlying tendencies of the mind there are in volitional formations — abandon them. Thus, those volitional formations will be abandoned, cut off at the root, made like a palm stump, brought to non-existence, and unable to arise again in the future. Whatever desire, whatever passion, whatever delight, whatever craving, whatever grasping, clinging, mental resolve, adherence, and underlying tendencies of the mind there are in consciousness — abandon them. Thus, that consciousness will be abandoned, cut off at the root, made like a palm stump, brought to non-existence, and unable to arise again in the future.\"\n\nThe summary for this chapter: Mara, Being, Leader to Existence, two Recluses to be fully understood; Stream-Enterer, and Arahant, and two others on Desire and Passion.",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදි.\n\nඑක් පසෙක අසුන්ගෙන සිටි ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: \"රාධය, රූපය පිළිබඳව යම් කැමැත්තක් (ඡන්දයක්), යම් ඇලීමක් (රාගයක්), යම් සතුටක් (නන්දියක්), යම් ආශාවක් (තණ්හාවක්), යම් ඇලීම් හා අල්වාගැනීම් (උපායඋපාදාන), චෛතසික අධිෂ්ඨාන, අභිනිවේශ, අනුසය ධර්මයන් ඇත්නම්, ඒවා පහ කරන්න. එවිට ඒ රූපය මුල සිඳ දැමූ, තල් ගසක කඳක් මෙන් නෂ්ටාවශේෂ කොට, නැවත නොපවතින බවට පත් කොට, අනාගතයේදී හටගැනීමේ ස්වභාවයෙන් තොර වූ, ප්‍රහීණ වූවක් වන්නේය. වේදනාව පිළිබඳව යම් කැමැත්තක්, යම් ඇලීමක්, යම් සතුටක්, යම් ආශාවක්, යම් ඇලීම් හා අල්වාගැනීම්, චෛතසික අධිෂ්ඨාන, අභිනිවේශ, අනුසය ධර්මයන් ඇත්නම්, ඒවා පහ කරන්න. එවිට ඒ වේදනාව මුල සිඳ දැමූ, තල් ගසක කඳක් මෙන් නෂ්ටාවශේෂ කොට, නැවත නොපවතින බවට පත් කොට, අනාගතයේදී හටගැනීමේ ස්වභාවයෙන් තොර වූ, ප්‍රහීණ වූවක් වන්නේය. සංඥාව පිළිබඳව යම් කැමැත්තක්, යම් ඇලීමක්, යම් සතුටක්, යම් ආශාවක්, යම් ඇලීම් හා අල්වාගැනීම්, චෛතසික අධිෂ්ඨාන, අභිනිවේශ, අනුසය ධර්මයන් ඇත්නම්, ඒවා පහ කරන්න. එවිට ඒ සංඥාව මුල සිඳ දැමූ, තල් ගසක කඳක් මෙන් නෂ්ටාවශේෂ කොට, නැවත නොපවතින බවට පත් කොට, අනාගතයේදී හටගැනීමේ ස්වභාවයෙන් තොර වූ, ප්‍රහීණ වූවක් වන්නේය. සංස්කාර පිළිබඳව යම් කැමැත්තක්, යම් ඇලීමක්, යම් සතුටක්, යම් ආශාවක්, යම් ඇලීම් හා අල්වාගැනීම්, චෛතසික අධිෂ්ඨාන, අභිනිවේශ, අනුසය ධර්මයන් ඇත්නම්, ඒවා පහ කරන්න. එවිට ඒ සංස්කාර මුල සිඳ දැමූ, තල් ගසක කඳක් මෙන් නෂ්ටාවශේෂ කොට, නැවත නොපවතින බවට පත් කොට, අනාගතයේදී හටගැනීමේ ස්වභාවයෙන් තොර වූ, ප්‍රහීණ වූවක් වන්නේය. විඤ්ඤාණය පිළිබඳව යම් කැමැත්තක්, යම් ඇලීමක්, යම් සතුටක්, යම් ආශාවක්, යම් ඇලීම් හා අල්වාගැනීම්, චෛතසික අධිෂ්ඨාන, අභිනිවේශ, අනුසය ධර්මයන් ඇත්නම්, ඒවා පහ කරන්න. එවිට ඒ විඤ්ඤාණය මුල සිඳ දැමූ, තල් ගසක කඳක් මෙන් නෂ්ටාවශේෂ කොට, නැවත නොපවතින බවට පත් කොට, අනාගතයේදී හටගැනීමේ ස්වභාවයෙන් තොර වූ, ප්‍රහීණ වූවක් වන්නේය.\"\n\nදසවැනි සූත්‍රයයි. රාධ සංයුත්තයේ පළමුවැනි වර්ගයයි. එහි උද්දානය නම්: මාරෝ, සත්ථෝ, භවනෙත්ති, පරිඤ්ඤෙය්‍යා, සමණා යන සූත්‍ර දෙක, සෝතාපන්නෝ, අරහං සහ ඡන්දරාග යන සූත්‍ර දෙක වශයෙනි.",
      "paliTitle": "Dutiyachandarāgasuttaṃ",
      "vagga": "Paṭhamavaggo"
    },
    {
      "number": 170,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘māro, māro’ti, bhante, vuccati. Katamo nu kho, bhante, māro’’ti? ‘‘Rūpaṃ kho, rādha, māro, vedanā māro, saññā māro, saṅkhārā māro, viññāṇaṃ māro. Evaṃ passaṃ, rādha, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi nibbindati, saññāyapi nibbindati, saṅkhāresupi nibbindati, viññāṇasmimpi nibbindati. Nibbindaṃ virajjati; virāgā vimuccati. Vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti. Paṭhamaṃ.",
      "english": "In Sāvatthī, the Venerable Rādha, seated to one side, said to the Blessed One, \"'Māra, Māra' it is said, venerable sir. What exactly, venerable sir, is Māra?\"\n\n\"Form, Rādha, is Māra. Feeling is Māra. Perception is Māra. Mental formations are Māra. Consciousness is Māra. Seeing thus, Rādha, a well-instructed noble disciple becomes disenchanted with form, becomes disenchanted with feeling, becomes disenchanted with perception, becomes disenchanted with mental formations, and becomes disenchanted with consciousness. Being disenchanted, he becomes dispassionate; through dispassion, he is liberated. With liberation, the knowledge 'It is liberated' arises. 'Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being in this world' — he understands.\"",
      "sinhala": "මෙම සූත්‍රය සැවැත් නුවරදී දේශනා කරන ලදී.\n\nඑක් පසෙක වාඩි වී සිටි ආයුෂ්මත් රාධ තෙරුන් භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය – ‘‘වහන්ස, ‘මාරයා, මාරයා’ යැයි කියනු ලැබේ. වහන්ස, මේ මාරයා යනු කවරෙක්ද?’’\n\n‘‘රාධය, රූපය මාරයාය, වේදනාව මාරයාය, සංඥාව මාරයාය, සංස්කාරයන් මාරයාය, විඥානය මාරයාය. රාධය, මෙසේ දකින, ඇසූ පිරූ තැන් ඇති ආර්ය ශ්‍රාවකයා රූපය කෙරෙහිද කලකිරෙයි, වේදනාව කෙරෙහිද කලකිරෙයි, සංඥාව කෙරෙහිද කලකිරෙයි, සංස්කාරයන් කෙරෙහිද කලකිරෙයි, විඥානය කෙරෙහිද කලකිරෙයි. කලකිරෙන විට, ඔහු නොඇලෙයි; නොඇලීමෙන් විමුක්ත වෙයි. විමුක්ත වූ කල්හි, ‘මම විමුක්ත වූයෙමි’ යන ඥානය පහළ වෙයි. ‘ඉපදීම ක්ෂය විය, බඹසර වාසය සම්පූර්ණ විය, කළ යුතු දේ කෙරිණි, මේ තත්ත්වයට පසුව වෙනත් කිසිවක් නැත’ යැයි ඔහු පසක් කරයි.’’\n\nපළමුවැන්නයි.",
      "paliTitle": "Mārasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 171,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘māradhammo, māradhammo’ti, bhante, vuccati. Katamo nu kho, bhante, māradhammo’’ti? ‘‘Rūpaṃ kho, rādha, māradhammo, vedanā māradhammo, saññā māradhammo, saṅkhārā māradhammo, viññāṇaṃ māradhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Dutiyaṃ.",
      "english": "At Sāvatthī. Seated to one side, the venerable Rādha said to the Blessed One: \"‘Māra's domain, Māra's domain’ it is said, venerable sir. What then, venerable sir, is Māra's domain?\" The Blessed One replied: \"Form, Rādha, is Māra's domain; feeling is Māra's domain; perception is Māra's domain; volitional formations are Māra's domain; consciousness is Māra's domain. Seeing thus, Rādha, the instructed noble disciple becomes disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with volitional formations, disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. With liberation, there arises the knowledge: ‘Liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is nothing further for this state of being.’\"",
      "sinhala": "එකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් රාධ තෙරුන් භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය – ‘‘‘මාර ස්වභාවය, මාර ස්වභාවය’ යැයි, ස්වාමීනි, කියනු ලැබේ. ස්වාමීනි, කවරක්ද මේ මාර ස්වභාවය?’’\n\n‘‘රාධය, රූපය මාර ස්වභාවයකි. වේදනාව මාර ස්වභාවයකි. සංඥාව මාර ස්වභාවයකි. සංස්කාර මාර ස්වභාවයකි. විඤ්ඤාණය මාර ස්වභාවයකි. රාධය, මෙලෙස දකිමින් ආර්ය ශ්‍රාවකයා රූපය කෙරෙහිත් කලකිරෙයි, වේදනාව කෙරෙහිත් කලකිරෙයි, සංඥාව කෙරෙහිත් කලකිරෙයි, සංස්කාර කෙරෙහිත් කලකිරෙයි, විඤ්ඤාණය කෙරෙහිත් කලකිරෙයි. කලකිරෙන ඔහු නොඇලෙයි. නොඇලීමෙන් මිදෙයි. මිදුණ කල්හි, ‘මම මිදුණෙමි’ යන ඤාණය පහළ වෙයි. නැවත මෙබඳු භවයක් නොමැති බව දන්නේය.’’",
      "paliTitle": "Māradhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 172,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘aniccaṃ, anicca’nti, bhante, vuccati. Katamaṃ nu kho, bhante, anicca’’nti? ‘‘Rūpaṃ kho, rādha, aniccaṃ, vedanā aniccā, saññā aniccā, saṅkhārā aniccā, viññāṇaṃ aniccaṃ. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Tatiyaṃ.",
      "english": "At Sāvatthī.\nSeated to one side, the Venerable Rādha said to the Blessed One: “‘Impermanent, impermanent,’ Venerable Sir, it is said. But what, Venerable Sir, is impermanent?”\n\n“Form, Rādha, is impermanent; feeling is impermanent; perception is impermanent; fabrications are impermanent; consciousness is impermanent. Seeing thus, a well-taught noble disciple becomes dispassionate towards form, dispassionate towards feeling, dispassionate towards perception, dispassionate towards fabrications, dispassionate towards consciousness. Being dispassionate, he becomes unattached. Through unattachment, he is liberated. With liberation, the knowledge ‘Liberated’ arises. He understands: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being.’”",
      "sinhala": "සැවැත් නුවරදී, එකත්පස්ව වැඩ සිටි ආයුෂ්මත් රාධ තෙරුන් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"වහන්ස, 'අනිත්‍යයි, අනිත්‍යයි' යැයි කියනු ලැබේ. වහන්ස, අනිත්‍ය යනු කවරක්ද?\"\n\n\"රාධය, රූපය අනිත්‍යයි. වේදනාව අනිත්‍යයි. සංඥාව අනිත්‍යයි. සංස්කාර අනිත්‍යයි. විඤ්ඤාණය අනිත්‍යයි. මෙසේ දකින ආර්ය ශ්‍රාවක තෙම රූපය කෙරෙහි ද කලකිරෙයි, වේදනාව කෙරෙහි ද කලකිරෙයි, සංඥාව කෙරෙහි ද කලකිරෙයි, සංස්කාර කෙරෙහි ද කලකිරෙයි, විඤ්ඤාණය කෙරෙහි ද කලකිරෙයි. කලකිරීමෙන් නොඇලෙයි. නොඇලීමෙන් මිදෙයි. මිදුණ කල්හි 'මිදුණෙමි' යන ඥානය පහළ වෙයි. 'ජාතිය ක්ෂය විය, බඹසර වැස නිම කරන ලදී, කළ යුත්තක් ඇත්නම් එය කරන ලදී, මෙයින් පසු තවත් මේ අත්බවක් නැතැයි' යනුවෙන් ඔහු අවබෝධ කරගනියි.\"",
      "paliTitle": "Aniccasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 173,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘aniccadhammo, aniccadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, aniccadhammo’’ti? ‘‘Rūpaṃ kho, rādha, aniccadhammo, vedanā aniccadhammo, saññā aniccadhammo, saṅkhārā aniccadhammo, viññāṇaṃ aniccadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Catutthaṃ.",
      "english": "At Sāvatthī. The Venerable Rādhā, seated to one side, said this to the Blessed One: “‘Impermanent phenomena, impermanent phenomena’—it is said, venerable sir. But what, venerable sir, is this impermanent phenomenon?”\n\n“Form, Rādhā, is an impermanent phenomenon; feeling is an impermanent phenomenon; perception is an impermanent phenomenon; mental formations are an impermanent phenomenon; consciousness is an impermanent phenomenon. Seeing thus, the instructed noble disciple becomes disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with mental formations, disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. When liberated, there is the knowledge: ‘Liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’”",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\nඑකත්පසෙක වැඩහුන් ආයුෂ්මත් රාධ තෙරුන් භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: ‘‘අනිත්‍ය ස්වභාවය, අනිත්‍ය ස්වභාවය යැයි වහන්ස, කියනු ලැබේ. වහන්ස, මේ අනිත්‍ය ස්වභාවය යනු කුමක්දැයි?’’\n\n‘‘රාධය, රූපය අනිත්‍ය ස්වභාවයකි. වේදනාව අනිත්‍ය ස්වභාවයකි. සංඥාව අනිත්‍ය ස්වභාවයකි. සංස්කාර අනිත්‍ය ස්වභාවයකි. විඤ්ඤාණය අනිත්‍ය ස්වභාවයකි. මෙලෙස දකින ශ්‍රාවකයා රූපය, වේදනාව, සංඥාව, සංස්කාර සහ විඤ්ඤාණය කෙරෙහි කලකිරී, විරාගයෙන් (නොඇලීමෙන්) මිදී, ‘උපත ක්ෂය විය, බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ නිම කරන ලදී, නැවත මේ තත්ත්වයට (භවයට) පැමිණීමක් නැත’ යනුවෙන් අවබෝධ කර ගනියි.’’\n\nසතරවෙනි සූත්‍රයයි.",
      "paliTitle": "Aniccadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 174,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘dukkhaṃ, dukkha’nti, bhante, vuccati. Katamaṃ nu kho, bhante, dukkha’’nti? ‘‘Rūpaṃ kho, rādha, dukkhaṃ, vedanā dukkhā, saññā dukkhā, saṅkhārā dukkhā, viññāṇaṃ dukkhaṃ. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Pañcamaṃ.",
      "english": "At Sāvatthī. Venerable Rādha, seated to one side, spoke thus to the Blessed One: \"‘Suffering, suffering’ it is said, venerable sir. But what, venerable sir, is suffering?\"\n\n\"Form, Rādha, is suffering; feeling is suffering; perception is suffering; mental fabrications are suffering; consciousness is suffering. Seeing thus, Rādha, the well-instructed noble disciple becomes disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with mental fabrications, disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. With liberation, the knowledge ‘it is liberated’ arises. He understands: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being for this.’\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\nඑකත්පසෙක වැඩ සිටි ආයුෂ්මත් රාධ ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූ සේක: ‘‘ස්වාමීනී, 'දුක, දුක' යැයි කියනු ලැබේ. ස්වාමීනී, දුක කවරේද?’’ ‘‘රාධය, රූපය දුකකි; වේදනාව දුකකි; සංඥාව දුකකි; සංස්කාරයෝ දුකකි; විඤ්ඤාණය දුකකි. මෙසේ දකින ආර්ය ශ්‍රාවක තෙම රූපය කෙරෙහි කලකිරෙයි. වේදනාව කෙරෙහි කලකිරෙයි. සංඥාව කෙරෙහි කලකිරෙයි. සංස්කාරයන් කෙරෙහි කලකිරෙයි. විඤ්ඤාණය කෙරෙහි කලකිරෙයි. කලකිරෙන ඔහු නොඇලෙයි. නොඇලෙන කල්හි නිදහස් වෙයි. නිදහස් වූ කල්හි 'නිදහස් වුණා' යැයි ඥානය පහළ වෙයි. 'ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව විසූ සේක, කළ යුතු දේ කෙළේය, මේ සඳහා (නැවත කිසිවක්) නැතැයි' දැනගනී.’’\nපස්වැනි සූත්‍රයයි.",
      "paliTitle": "Dukkhasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 175,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘dukkhadhammo, dukkhadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, dukkhadhammo’’ti? ‘‘Rūpaṃ kho, rādha, dukkhadhammo, vedanā dukkhadhammo, saññā dukkhadhammo, saṅkhārā dukkhadhammo, viññāṇaṃ dukkhadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Chaṭṭhaṃ.",
      "english": "At Sāvatthī. Then, the venerable Rādha, seated to one side, said to the Blessed One: “‘Of the nature of suffering, of the nature of suffering’ it is said, venerable sir. Which, then, venerable sir, is that which is of the nature of suffering?”\n\n“Form, Rādha, is of the nature of suffering; feeling is of the nature of suffering; perception is of the nature of suffering; mental formations are of the nature of suffering; consciousness is of the nature of suffering. Seeing thus, the instructed noble disciple becomes disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with mental formations, and disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. When liberated, there is the knowledge: ‘I am liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more coming to any state of being.’ He understands: ‘There is nothing further for this state of being.’”",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලද්දකි.\n\nඑක් පසෙක වාඩි වී සිටි ආයුෂ්මත් රාධ තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “‘දුක්ඛ ධර්මය, දුක්ඛ ධර්මය’ යැයි වහන්ස, කියනු ලැබේ. වහන්ස, මේ දුක්ඛ ධර්මය යනු කවරක්ද?”\n\n“රාධය, රූපය දුක්ඛ ධර්මයකි. වේදනාව දුක්ඛ ධර්මයකි. සංඥාව දුක්ඛ ධර්මයකි. සංස්කාරයන් දුක්ඛ ධර්මයකි. විඤ්ඤාණය දුක්ඛ ධර්මයකි. මේ අයුරින් දකිමින්, විරාගී වී, විමුක්තිය ලබා, නැවත මෙබඳු බවකට පැමිණීමක් නැතැයි ප්‍රඥාවෙන් අවබෝධ කරයි.”",
      "paliTitle": "Dukkhadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 176,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘anattā, anattā’ti, bhante, vuccati. Katamo nu kho, bhante, anattā’’ti? ‘‘Rūpaṃ kho, rādha, anattā, vedanā anattā, saññā anattā, saṅkhārā anattā, viññāṇaṃ anattā. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Sattamaṃ.",
      "english": "At Sāvatthī. Seated to one side, Venerable Rādha addressed the Blessed One, saying: “‘Non-self, non-self’ it is said, venerable sir. But what, venerable sir, is non-self?”\n\n“Form, Rādha, is non-self; feeling is non-self; perception is non-self; mental formations are non-self; consciousness is non-self. Seeing thus, Rādha, the instructed noble disciple becomes disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with mental formations, disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. When liberated, the knowledge arises that he is liberated. He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being.’”",
      "sinhala": "සැවැත්නුවර නිදානය.\n\nඑකත්පසෙක වැඩහුන් ආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: ‘‘වහන්ස, ‘අනත්තා, අනත්තා’ යැයි කියනු ලැබේ. වහන්ස, අනත්තා යනු කුමක්ද?’’\n\n‘‘රාධය, රූපය අනත්තා ය. වේදනාව අනත්තා ය. සංඥාව අනත්තා ය. සංස්කාර අනත්තා ය. විඤ්ඤාණය අනත්තා ය. මෙසේ දකිනා ශ්‍රැතවත් ආර්ය ශ්‍රාවක තෙම රූපයෙහිද කලකිරෙයි, වේදනාවෙහිද කලකිරෙයි, සංඥාවෙහිද කලකිරෙයි, සංස්කාරයන්හිද කලකිරෙයි, විඤ්ඤාණයෙහිද කලකිරෙයි. කලකිරීමෙන් නොඇලෙයි. නොඇලීමෙන් මිදෙයි. මිදුණා වූ තැනැත්තාට තමා මිදුණේ ය යන ඥානය පහළ වෙයි. ‘ජාතිය ක්ෂය විය, බඹසර වැස නිමවන ලදී, කළ යුත්ත කරන ලදී, මින් මතු මෙබඳු තත්ත්වයකට පැමිණීමක් නැත’ යැයි ප්‍රඥාවෙන් දනියි.’’ සත්වන සූත්‍රයයි.",
      "paliTitle": "Anattasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 177,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘anattadhammo, anattadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, anattadhammo’’ti? ‘‘Rūpaṃ kho, rādha, anattadhammo, vedanā anattadhammo, saññā anattadhammo, saṅkhārā anattadhammo, viññāṇaṃ anattadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Aṭṭhamaṃ. 9.Khayadhammasuttaṃ",
      "english": "At Sāvatthī. Seated to one side, the Venerable Rādha said to the Blessed One, “‘The characteristic of non-self, the characteristic of non-self,’ it is said, venerable sir. What then, venerable sir, is the characteristic of non-self?” “Form, Rādha, is the characteristic of non-self; feeling is the characteristic of non-self; perception is the characteristic of non-self; mental formations are the characteristic of non-self; consciousness is the characteristic of non-self. Seeing thus, the noble disciple becomes disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with mental formations, and disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. With liberation, the knowledge arises: ‘Liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being.’”",
      "sinhala": "සැවැත් නුවරදී.\n\nඑක් අවස්ථාවක ආයුෂ්මත් රාධ තෙරුන් භාග්‍ය​වතුන් වහන්සේට මෙසේ පැවසීය: ‘‘‘අනාත්ම ධර්ම, අනාත්ම ධර්ම’ යැයි වහන්ස, කියනු ලැබේ. වහන්ස, අනාත්ම ධර්මය කවරේදැයි?”\n\n‘‘රාධය, රූපය අනාත්ම ධර්මයකි, වේදනාව අනාත්ම ධර්මයකි, සංඥාව අනාත්ම ධර්මයකි, සංස්කාර අනාත්ම ධර්මයකි, විඥානය අනාත්ම ධර්මයකි. මෙසේ දකිමින් ආර්ය ශ්‍රාවකයා රූපය අනාත්ම යැයි දකියි, වේදනාව අනාත්ම යැයි දකියි, සංඥාව අනාත්ම යැයි දකියි, සංස්කාර අනාත්ම යැයි දකියි, විඥානය අනාත්ම යැයි දකියි. රූපය අනාත්ම යැයි දැක, වේදනාව අනාත්ම යැයි දැක, සංඥාව අනාත්ම යැයි දැක, සංස්කාර අනාත්ම යැයි දැක, විඥානය අනාත්ම යැයි දැක, රූපය පිළිබඳවද කලකිරෙයි, වේදනාව පිළිබඳවද කලකිරෙයි, සංඥාව පිළිබඳවද කලකිරෙයි, සංස්කාර පිළිබඳවද කලකිරෙයි, විඥානය පිළිබඳවද කලකිරෙයි. කලකිරෙන්නේ ඇලීම් රහිත වෙයි, ඇලීම් රහිත වූයෙන් මිදෙයි. මිදුණු විට තමන් මිදුණා යන ඥානය පහළ වෙයි. ‘ජාතිය ක්ෂය විය, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුත්ත කරන ලදී, මේ භවය සඳහා වෙනත් කිරීමක් නැතැයි’ දනියි.’’\n\nඅටවන සූත්‍රයයි.\n\nනවවන ක්ෂය ධර්ම සූත්‍රයයි.",
      "paliTitle": "Anattadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 178,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘khayadhammo, khayadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, khayadhammo’’ti? ‘‘Rūpaṃ kho, rādha, khayadhammo, vedanā khayadhammo, saññā khayadhammo, saṅkhārā khayadhammo, viññāṇaṃ khayadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Navamaṃ.",
      "english": "At Sāvatthī. Seated to one side, the Venerable Rādhā said to the Blessed One: “It is said, Venerable Sir, ‘that which is subject to destruction, that which is subject to destruction.’ What then, Venerable Sir, is that which is subject to destruction?”\n\n“Form, Rādhā, is that which is subject to destruction; feeling is that which is subject to destruction; perception is that which is subject to destruction; fabrications are that which is subject to destruction; consciousness is that which is subject to destruction. Seeing thus, a noble disciple becomes disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with fabrications, and disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. With liberation, the knowledge arises: ‘Liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’”",
      "sinhala": "සා​වැත්නුවරදී සිදුවූ දෙයකි. එක් පසෙක වාඩි වී සිටි ආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: ‘‘‘ක්​ෂය වන ස්වභාවයෙන් යුක්තය, ක්​ෂය වන ස්වභාවයෙන් යුක්තය’ යැයි, වහන්ස, කියනු ලැබේ. වහන්ස, ක්​ෂය වන ස්වභාවයෙන් යුක්තය යනු කුමක්ද?’’ ‘‘රාධ, රූපය ක්​ෂය වන ස්වභාවයෙන් යුක්තය, වේදනාව ක්​ෂය වන ස්වභාවයෙන් යුක්තය, සංඥාව ක්​ෂය වන ස්වභාවයෙන් යුක්තය, සංස්කාර ක්​ෂය වන ස්වභාවයෙන් යුක්තය, විඤ්ඤාණය ක්​ෂය වන ස්වභාවයෙන් යුක්තය. මෙසේ දකිනා තැනැත්තා ...පෙ... මේ භවයෙන් පසුව තවත් භවයක් නැතැයි අවබෝධ කරගනියි.’’ නවවැනියි.",
      "paliTitle": "",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 179,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘vayadhammo, vayadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, vayadhammo’’ti? ‘‘Rūpaṃ kho, rādha, vayadhammo, vedanā vayadhammo, saññā vayadhammo, saṅkhārā vayadhammo, viññāṇaṃ vayadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Dasamaṃ.",
      "english": "At Sāvatthī, the Venerable Rādha sat down to one side and said to the Blessed One: \"“Subject to passing away, subject to passing away”—it is said, Venerable Sir. What, then, Venerable Sir, is meant by “subject to passing away”?\" \"Form, Rādha, is subject to passing away; feeling is subject to passing away; perception is subject to passing away; mental formations are subject to passing away; consciousness is subject to passing away. Seeing thus, the instructed noble disciple grows disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with mental formations, disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. When liberated, there arises the knowledge: 'I am liberated.' He understands: 'Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further state of being for this world.'\"",
      "sinhala": "මෙය සැවැත්නුවරදී සිදු වූවකි.\n\nඑකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් රාධ තෙරුන් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ස්වාමීනි, ‘ක්ෂය වන්නා වූ ස්වභාවය’, ‘ක්ෂය වන්නා වූ ස්වභාවය’ යි කියනු ලැබේ. ස්වාමීනි, ක්ෂය වන්නා වූ ස්වභාවය කුමක්ද?”\n\n“රාධය, රූපය ක්ෂය වන්නා වූ ස්වභාවයකි. වේදනාව ක්ෂය වන්නා වූ ස්වභාවයකි. සංඥාව ක්ෂය වන්නා වූ ස්වභාවයකි. සංස්කාරයන් ක්ෂය වන්නා වූ ස්වභාවයකි. විඥානය ක්ෂය වන්නා වූ ස්වභාවයකි.”\n\n“මෙසේ දකිමින් ශ්‍රැතවත් ආර්ය ශ්‍රාවක තෙම රූපය කෙරෙහි කලකිරෙයි. වේදනාව කෙරෙහි කලකිරෙයි. සංඥාව කෙරෙහි කලකිරෙයි. සංස්කාරයන් කෙරෙහි කලකිරෙයි. විඥානය කෙරෙහි කලකිරෙයි. කලකිරෙනුයේ නොඇලෙයි. නොඇලීමෙන් මිදෙයි. මිදුණු කල්හි, ‘මිදුණෙමි’ යි යන ඥානය පහළ වෙයි. ‘උපත ක්ෂය විය, බඹසර වැස නිමවන ලදී, කළ යුත්ත කරන ලදී, මින් මතු වෙනත් භවයක් නැතැ’යි ද ප්‍රකටව දනියි.”",
      "paliTitle": "Vayadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 180,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘samudayadhammo, samudayadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, samudayadhammo’’ti? ‘‘Rūpaṃ kho, rādha, samudayadhammo, vedanā samudayadhammo, saññā samudayadhammo, saṅkhārā samudayadhammo, viññāṇaṃ samudayadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Ekādasamaṃ.",
      "english": "Venerable Rādha, seated to one side, said this to the Blessed One: “‘That which is subject to arising, that which is subject to arising,’ it is said, venerable sir. What, then, venerable sir, is that which is subject to arising?”\n\n“Form, Rādha, is that which is subject to arising; feeling is that which is subject to arising; perception is that which is subject to arising; mental formations are that which are subject to arising; consciousness is that which is subject to arising. Seeing thus, Rādha, a noble disciple becomes liberated through non-clinging. Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being — one understands.”",
      "sinhala": "සැවැත්නුවරදීය. එක්පසෙක වැඩහුන් ආයුෂ්මත් රාධ තෙරුන් භාග්‍ය​වතුන් වහන්සේට මෙසේ පැවසුවා. \"භාග්‍ය​වතුන් වහන්ස, 'හේතු ප්‍ර​ත්‍යයන්ගෙන් හටගන්නා ස්වභාවය', 'හේතු ප්‍ර​ත්‍යයන්ගෙන් හටගන්නා ස්වභාවය' යනුවෙන් කියනු ලැබේ. භාග්‍ය​වතුන් වහන්ස, හේතු ප්‍ර​ත්‍යයන්ගෙන් හටගන්නා ස්වභාවය නම් කවරේද?\"\n\n\"රාධය, රූපය නම් හේතු ප්‍ර​ත්‍යයන්ගෙන් හටගන්නා ස්වභාවයකි. වේදනාව නම් හේතු ප්‍ර​ත්‍යයන්ගෙන් හටගන්නා ස්වභාවයකි. සංඥාව නම් හේතු ප්‍ර​ත්‍යයන්ගෙන් හටගන්නා ස්වභාවයකි. සංස්කාරයන් නම් හේතු ප්‍ර​ත්‍යයන්ගෙන් හටගන්නා ස්වභාවයකි. විඤ්ඤාණය නම් හේතු ප්‍ර​ත්‍යයන්ගෙන් හටගන්නා ස්වභාවයකි. මෙසේ දකින තැනැත්තා මේ ආත්මභාවය පිණිස අන් කිසිවක් නොමැති බව අවබෝධ කරයි.\"",
      "paliTitle": "Samudayadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 181,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘‘nirodhadhammo, nirodhadhammo’ti, bhante, vuccati. Katamo nu kho, bhante, nirodhadhammo’’ti? ‘‘Rūpaṃ kho, rādha, nirodhadhammo, vedanā nirodhadhammo, saññā nirodhadhammo, saṅkhārā nirodhadhammo, viññāṇaṃ nirodhadhammo. Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Dvādasamaṃ. Rādhasaṃyuttassa dutiyo vaggo. Tassuddānaṃ – Māro ca māradhammo ca, aniccena apare duve; Dukkhena ca duve vuttā, anattena [anattehi (sī. syā. kaṃ.)] tatheva ca; Khayavayasamudayaṃ, nirodhadhammena dvādasāti.",
      "english": "The Venerable Rādha, seated to one side, said this to the Blessed One: “‘Subject to cessation, subject to cessation,’ it is said, Venerable Sir. What indeed, Venerable Sir, is that which is subject to cessation?”\n\n“Form, Rādha, is subject to cessation; feeling is subject to cessation; perception is subject to cessation; formations are subject to cessation; consciousness is subject to cessation. Seeing thus, a well-instructed noble disciple becomes disenchanted with form, with feeling, with perception, with formations, and with consciousness. Being disenchanted, one becomes dispassionate. Through dispassion, one is liberated. With liberation, there is the knowledge: ‘Liberated.’ One understands: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done; there is no more for this state of being.’”",
      "sinhala": "සැවැත්නුවරදී සිදුවිය.\n\nඑකත්පස්ව හුන් ආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍ය​වතුන් වහන්සේට මෙසේ පැවසුවා – ‘‘වහන්ස, ‘නිරෝධ ධ​ර්ම​ය, නිරෝධ ධ​ර්ම​ය’ යැයි කියනු ලැබේ. වහන්ස, මේ නිරෝධ ධ​ර්ම​ය කවරෙක්ද?’’ ‘‘රාධය, රූපය නිරෝධ ධ​ර්ම​යකි. වේදනාව නිරෝධ ධ​ර්ම​යකි. සංඥාව නිරෝධ ධ​ර්ම​යකි. සංස්කාර නිරෝධ ධ​ර්ම​යකි. විඤ්ඤාණය නිරෝධ ධ​ර්ම​යකි. මෙසේ දකිමින්, ශ්‍රැතවත් ආ​ර්ය ශ්‍රා​වකයා රූපය, වේදනාව, සංඥාව, සංස්කාර, විඤ්ඤාණය නිරෝධ ධ​ර්ම බව දැක ඒවා කෙරෙහි කලකිරෙයි. කලකිරී නොඇලෙයි. නොඇලීමෙන් (රාගය පහව යෑමෙන්) මිදෙයි. මිදුණ විට තමා මිදුණ බවට ඥානය පහළ වෙයි. ‘ජාතිය ක්ෂය විය, බඹසර වැස නිම කරන ලදි, කළ යුතු දේ කරන ලදි, නැවත මෙබඳු භවයකට පැමිණීමක් නැතැයි’ යැයි (යථාභූත ඥානයෙන්) අවබෝධ කරයි.’’ දොළොස්වන සූත්‍රයයි. රාධ සංයුත්තයේ දෙවන වග්ගයයි. එහි උද්දාන ගාථාව මෙසේය – මාර සූත්‍රයත්, මාර ධ​ර්ම සූත්‍රයත්, අනිච්ච සූත්‍රයෙන් තවත් සූත්‍ර දෙකක්ද ඇතුළත් ය; දුක්ඛ සූත්‍රයෙන් සූත්‍ර දෙකක්ද, ඒ ආකාරයෙන්ම අනත්ත සූත්‍රයෙන්ද සූත්‍ර දෙකක්ද සඳහන් වී ඇත; ක්ෂය, වය, සමුදය සහ නිරෝධ ධ​ර්ම යන සූත්‍ර සමඟ සූත්‍ර දොළොසක් වෙති.",
      "paliTitle": "Nirodhadhammasuttaṃ",
      "vagga": "Dutiyavaggo"
    },
    {
      "number": 182,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Yo kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo [sīhaḷapotthake pana ‘‘tatra te chando pahātabboti ekaṃ suttaṃ, tatra te rāgo pahātabboti ekaṃ suttaṃ, tatra te chandarāgo pahātabboti ekaṃ sutta’’nti evaṃ visuṃ visuṃ tīṇi suttāni vibhajitvā dassitāni. evamuparisuttesupi]. Ko ca, rādha, māro? Rūpaṃ kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo [sīhaḷapotthake pana ‘‘tatra te chando pahātabboti ekaṃ suttaṃ, tatra te rāgo pahātabboti ekaṃ suttaṃ, tatra te chandarāgo pahātabboti ekaṃ sutta’’nti evaṃ visuṃ visuṃ tīṇi suttāni vibhajitvā dassitāni. evamuparisuttesupi]. Vedanā māro; tatra te chando pahātabbo…pe… saññā māro; tatra te chando pahātabbo…pe… saṅkhārā māro; tatra te chando pahātabbo…pe… viññāṇaṃ māro; tatra te chando pahātabbo…pe… yo kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo’’ti.",
      "english": "The setting was Sāvatthī. The Venerable Rādhā, sitting to one side, said to the Blessed One: “It would be good, Venerable Sir, if the Blessed One would teach me the Dhamma in brief, so that having heard the Dhamma from the Blessed One, I might dwell solitary, secluded, diligent, ardent, and resolute.”\n\n“Whatever, Rādhā, is Māra; there your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned.” “And what, Rādhā, is Māra? Form, Rādhā, is Māra; there your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Feeling is Māra; there your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Perception is Māra; there your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Volitional formations are Māra; there your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Consciousness is Māra; there your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Whatever, Rādhā, is Māra; there your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned.”",
      "sinhala": "මෙය සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\nඑකත්පස්ව වාඩි වී සිටි ආයුෂ්මත් රාධ තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවා: ‘‘වහන්ස, භාග්‍යවතුන් වහන්සේ කරුණාකර මට කෙටියෙන් ධර්මය දේශනා කළ මැනව. භාග්‍යවතුන් වහන්සේගේ ඒ ධර්මය අසා මම තනිව, ඈත් වී, අප්‍රමාදීව, දැඩි උත්සාහයෙන්, වීර්යය යොදවා වාසය කරන්නෙමි.’’\n\n‘‘රාධය, යමක් මාරයාද; එහිලා ඔබට ඡන්දය (කැමැත්ත) ප්‍රහාණය කළ යුතුයි, රාගය ප්‍රහාණය කළ යුතුයි, ඡන්දරාගය (තෘෂ්ණා සහිත කැමැත්ත) ප්‍රහාණය කළ යුතුයි. රාධය, මාරයා යනු කුමක්ද? රාධය, රූපය මාරයාය. එහිලා ඔබට ඡන්දය ප්‍රහාණය කළ යුතුයි, රාගය ප්‍රහාණය කළ යුතුයි, ඡන්දරාගය ප්‍රහාණය කළ යුතුයි. වේදනාව මාරයාය. එහිලා ඔබට ඡන්දය ප්‍රහාණය කළ යුතුයි, රාගය ප්‍රහාණය කළ යුතුයි, ඡන්දරාගය ප්‍රහාණය කළ යුතුයි. සංඥාව මාරයාය. එහිලා ඔබට ඡන්දය ප්‍රහාණය කළ යුතුයි, රාගය ප්‍රහාණය කළ යුතුයි, ඡන්දරාගය ප්‍රහාණය කළ යුතුයි. සංස්කාර මාරයාය. එහිලා ඔබට ඡන්දය ප්‍රහාණය කළ යුතුයි, රාගය ප්‍රහාණය කළ යුතුයි, ඡන්දරාගය ප්‍රහාණය කළ යුතුයි. විඤ්ඤාණය මාරයාය. එහිලා ඔබට ඡන්දය ප්‍රහාණය කළ යුතුයි, රාගය ප්‍රහාණය කළ යුතුයි, ඡන්දරාගය ප්‍රහාණය කළ යුතුයි. රාධය, යමක් මාරයාද; එහිලා ඔබට ඡන්දය ප්‍රහාණය කළ යුතුයි, රාගය ප්‍රහාණය කළ යුතුයි, ඡන්දරාගය ප්‍රහාණය කළ යුතුයි.’’",
      "paliTitle": "Mārādisuttaekādasakaṃ",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 183,
      "pali": "Yo kho, rādha, māradhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo…pe….",
      "english": "Whatever, Rādha, is subject to Māra, concerning that, your interest should be abandoned, your passion should be abandoned, your passionate interest should be abandoned.",
      "sinhala": "රාධයෙනි, යමක් මාරයාගේ ස්වභාවයට අයත් ධර්මයක් වේද, එහිලා ඔබ විසින් ඡන්දය අත්හළ යුත්තේය, රාගය අත්හළ යුත්තේය, ඡන්දරාගය අත්හළ යුත්තේය.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 184,
      "pali": "Yaṃ kho, rādha, aniccaṃ…pe….",
      "english": "Whatever is impermanent, Rādhā, that is suffering. Whatever is suffering, that is non-self. Whatever is non-self, that is not mine, I am not that, nor is that my self. This should be seen as it actually is, with right wisdom.",
      "sinhala": "රාධය, යම්කිසි යමක් අනිත්‍යද, එය දුක් සහගතය. යම්කිසි යමක් දුක් සහගතද, එය අනාත්මය. යම්කිසි යමක් අනාත්මද, එය මාගේ නොවේ, මම එය නොවෙමි, මෙය මාගේ ආත්මය නොවේ යැයි, මෙසේ මෙය යථාභූතවූයේ නියම ප‍්‍රඥාවෙන් දැක්ක යුත්තේය.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 185,
      "pali": "Yo kho, rādha, aniccadhammo…pe….",
      "english": "Whatever, Rādha, is impermanent in nature, that is suffering. Whatever is suffering, that is not self. Whatever is not self, that is not mine, I am not that, this is not my self. Thus it should be seen as it truly is with right wisdom.",
      "sinhala": "රාධ, යම්කිසි යමක් අනිත්‍ය ස්වභාවය ඇති ධර්මයක් වේද, ඔහු එය කෙරෙහි ඡන්දය දුරු කරයි. ඒ ප්‍රතිපදාවෙන් ඡන්දය දුරු කිරීමෙන් ඔහු විමුක්තිය ලබයි. රාධ, යම්කිසි යමක් දුක් ස්වභාවය ඇති ධර්මයක් වේද, ඔහු එය කෙරෙහි ඡන්දය දුරු කරයි. ඒ ප්‍රතිපදාවෙන් ඡන්දය දුරු කිරීමෙන් ඔහු විමුක්තිය ලබයි. රාධ, යම්කිසි යමක් අනාත්ම ස්වභාවය ඇති ධර්මයක් වේද, ඔහු එය කෙරෙහි ඡන්දය දුරු කරයි. ඒ ප්‍රතිපදාවෙන් ඡන්දය දුරු කිරීමෙන් ඔහු විමුක්තිය ලබයි.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 186,
      "pali": "Yaṃ kho, rādha, dukkhaṃ…pe….",
      "english": "Whatever, Radha, is suffering—that is impermanent; what is impermanent, that is non-self. What is non-self, that is not mine, I am not that, that is not my self. This should be seen as it actually is with right wisdom.",
      "sinhala": "රාධය, යමක් දුක්ඛ වේ නම්, එය අනිත්‍ය වේ. යමක් අනිත්‍ය ද එය දුක්ඛ වේ. යමක් දුක්ඛ ද එය අනාත්ම වේ. යමක් අනාත්ම ද එය 'මෙය මාගේ නොවේ, මම නොවේ, මාගේ ආත්‍මය නොවේ' යැයි මෙසේ දැක්ක යුතු ය. රාධය, මෙසේ දකින ආර්ය ශ්‍රාවකයා දුකෙහි කලකිරෙයි, නොඇලෙයි, විමුක්ත වෙයි. විමුක්ත වූ විට 'මම විමුක්ත වීමි' යන ඥාණය පහළ වෙයි. 'ජාතිය ක්‍ෂය විය, බඹසර වැස නිම කරන ලදි, කළ යුතු දේ කරන ලදි, මේ තත්ත්වයෙන් තවත් කළ යුතු දෙයක් නැතැ'යි ඔහු (නුවණින්) දැන ගනී.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 187,
      "pali": "Yo kho, rādha, dukkhadhammo…pe….",
      "english": "Whatever, Rādha, is of the nature of suffering, that is suffering. Whatever is suffering, that is not self. Whatever is not self, that is not mine, I am not that, nor is it my self. This should be seen as it actually is with right wisdom.",
      "sinhala": "රාධය, යමක් දුක්ඛ ධර්මයක් වේද, එහි ඡන්දරාගය අත්හැරිය යුත්තේය.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 188,
      "pali": "Yo kho, rādha, anattā…pe….",
      "english": "Whatever is not-self, Rādha, that is not mine, that I am not, that is not my self. Thus it should be seen with right wisdom as it actually is.",
      "sinhala": "යමක්, රාධ, අනාත්ම වේද, එය මාගේ නොවේ, මම එය නොවෙමි, එය මාගේ ආත්මයද නොවේ.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 189,
      "pali": "Yo kho, rādha, anattadhammo…pe….",
      "english": "Whatever, Rādha, is a phenomenon that is not self, you should abandon desire for it.",
      "sinhala": "රාධය, යම් ධර්ම​යක් අනාත්ම නම්, එය ප්‍ර​හීණ කළ යුතු ය. රාධය, කුමක් නම් අනාත්ම ධර්ම​ය වේද? රාධය, රූපය අනාත්ම ධර්ම​යකි. එය ප්‍ර​හීණ කළ යුතු ය. රාධය, වේදනාව අනාත්ම ධර්ම​යකි. එය ප්‍ර​හීණ කළ යුතු ය. රාධය, සංඥාව අනාත්ම ධර්ම​යකි. එය ප්‍ර​හීණ කළ යුතු ය. රාධය, සංස්කාරයෝ අනාත්ම ධර්ම​යෝ ය. ඒවා ප්‍ර​හීණ කළ යුතු ය. රාධය, විඤ්ඤාණය අනාත්ම ධර්ම​යකි. එය ප්‍ර​හීණ කළ යුතු ය. රාධය, යම් ධර්ම​යක් අනාත්ම නම්, එය ප්‍ර​හීණ කළ යුතු යැයි මෙය කියනු ලැබේ.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 190,
      "pali": "Yo kho, rādha, khayadhammo…pe….",
      "english": "Indeed, Radha, that which is subject to destruction, subject to vanishing, subject to dispassion, subject to cessation – if you abide clinging to that, thinking, 'This is mine, this I am, this is my self,' then I declare that by abiding with such clinging, you are abiding clinging to suffering.",
      "sinhala": "රාධය, යම් රූපයක් නැසෙන සුලු ස්වභාවයෙන් යුක්ත ද, එහි ඇල්ම ප්‍රහාණය කළ යුතුය. රාධය, යම් වේදනාවක් නැසෙන සුලු ස්වභාවයෙන් යුක්ත ද, එහි ඇල්ම ප්‍රහාණය කළ යුතුය. රාධය, යම් සංඥාවක් නැසෙන සුලු ස්වභාවයෙන් යුක්ත ද, එහි ඇල්ම ප්‍රහාණය කළ යුතුය. රාධය, යම් සංස්කාරයක් නැසෙන සුලු ස්වභාවයෙන් යුක්ත ද, එහි ඇල්ම ප්‍රහාණය කළ යුතුය. රාධය, යම් විඤ්ඤාණයක් නැසෙන සුලු ස්වභාවයෙන් යුක්ත ද, එහි ඇල්ම ප්‍රහාණය කළ යුතුය.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 191,
      "pali": "Yo kho, rādha, vayadhammo…pe….",
      "english": "Whatever, Radha, is of a nature to decay, it has a duty or task that must be observed in this very moment of its dissolution, it is of a nature to vanish, it is of a nature to fade away, and it is of a nature to cease. One should see this as impermanent, as suffering, as non-self, as the calming of all conditioned phenomena, as the relinquishment of all attachments, as the destruction of craving, as dispassion, as cessation, as Nibbana.",
      "sinhala": "රාධයෙනි, යමක් ක්ෂය වීමේ ස්වභාවයෙන් යුක්ත වේද, එය අනිත්‍ය යි. යමක් අනිත්‍ය වේද, එය දුක යි. යමක් දුක වේද, එය අනාත්ම යි. යමක් අනාත්ම වේද, එය මාගේ නොවේ, මම එය නොවෙමි, එය මාගේ ආත්මය නොවේ. මේ ආකාරයට එය ඇති සැටියෙන් ම, සම්‍යක් ප්‍රඥාවෙන් දැක්ක යුතු ය.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 192,
      "pali": "Yo kho, rādha, samudayadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo…pe….",
      "english": "Indeed, Rādha, concerning whatever is of the nature to arise: therein, your desire must be abandoned, your passion must be abandoned, your passionate desire must be abandoned.",
      "sinhala": "රාධය, යම් කිසිවක් හටගැනීමේ ස්වභාවයෙන් යුක්ත වේද, ඒ කෙරෙහි නුඹ විසින් ඡන්දය ප්‍රහීණ කළ යුතු යි. රාගය ප්‍රහීණ කළ යුතු යි. ඡන්දරාගය ප්‍රහීණ කළ යුතු යි.",
      "paliTitle": "",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 193,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinno kho āyasmā rādho bhagavantaṃ etadavoca – ‘‘sādhu me, bhante, bhagavā saṃkhittena dhammaṃ desetu, yamahaṃ bhagavato dhammaṃ sutvā eko vūpakaṭṭho appamatto ātāpī pahitatto vihareyya’’nti. ‘‘Yo kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Ko ca, rādha, nirodhadhammo? Rūpaṃ kho, rādha, nirodhadhammo; tatra te chando pahātabbo…pe… vedanā nirodhadhammo; tatra te chando pahātabbo…pe… saññā nirodhadhammo; tatra te chando pahātabbo…pe… saṅkhārā nirodhadhammo; tatra te chando pahātabbo…pe… viññāṇaṃ nirodhadhammo; tatra te chando pahātabbo…pe… yo kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo’’ti [sīhaḷapotthake pana imasmiṃ vagge chattiṃsa suttāni vibhattāni ekekaṃ suttaṃ tīṇi tīṇi katvā, evaṃ catutthavaggepi]. Āyācanavaggo tatiyo. Tassuddānaṃ – Māro ca māradhammo ca, aniccena apare duve; Dukkhena ca duve vuttā, anattena tatheva ca; Khayavayasamudayaṃ, nirodhadhammena dvādasāti.",
      "english": "Introduction at Savatthi.\nThe Venerable Radha, seated to one side, said this to the Blessed One: \"It would be good for me, venerable sir, if the Blessed One would teach me the Dhamma in brief, so that having heard the Dhamma from the Blessed One, I might dwell alone, secluded, diligent, ardent, and resolute.\"\n\n\"Radha, whatever is of the nature to cease; in that your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. And what, Radha, is of the nature to cease? Form, Radha, is of the nature to cease; in that your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Feeling is of the nature to cease; in that your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Perception is of the nature to cease; in that your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Mental formations are of the nature to cease; in that your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Consciousness is of the nature to cease; in that your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned. Whatever, Radha, is of the nature to cease; in that your desire should be abandoned, your passion should be abandoned, your desire and passion should be abandoned.\"\n\nThe Third Chapter, Request.\nSummary:\nMara and Mara-phenomena;\nThe other two with impermanence;\nAnd two are declared with suffering;\nAnd similarly with non-self;\nWaning, passing away, arising;\nTwelve with the nature of cessation.",
      "sinhala": "සැවැත්නුවර අරභයා මෙම සූත්‍රය දේශනා කරන ලදී.\n\nඑකත්පස්ව හුන් ආයුෂ්මත් රාධ තෙරුන් භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවා: \"භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේගෙන් ධර්‍මය ශ්‍රවණය කොට, මම තනිව, හුදෙකලාව, අප්‍රමාදීව, වීර්යයෙන් යුතුව, අධිෂ්ඨානශීලීව වාසය කළ හැකි වන පරිදි, මට සංක්ෂිප්තයෙන් ධර්‍මය දේශනා කළ මැනව.\"\n\n\"රාධය, යමක් නිරෝධ ස්වභාවයට පැමිණෙන ධර්‍මයක්ද, එහිලා නුඹගේ ඡන්දය අත්හැරිය යුතුය. රාගය අත්හැරිය යුතුය. ඡන්දරාගය අත්හැරිය යුතුය.\"\n\n\"රාධය, නිරෝධ ස්වභාවයට පැමිණෙන ධර්‍මය කුමක්ද?\"\n\n\"රාධය, රූපය නිරෝධ ස්වභාවයට පැමිණෙන ධර්‍මයකි. එහිලා නුඹගේ ඡන්දය අත්හැරිය යුතුය. රාගය අත්හැරිය යුතුය. ඡන්දරාගය අත්හැරිය යුතුය. වේදනාව නිරෝධ ස්වභාවයට පැමිණෙන ධර්‍මයකි. එහිලා නුඹගේ ඡන්දය අත්හැරිය යුතුය. රාගය අත්හැරිය යුතුය. ඡන්දරාගය අත්හැරිය යුතුය. සංඥාව නිරෝධ ස්වභාවයට පැමිණෙන ධර්‍මයකි. එහිලා නුඹගේ ඡන්දය අත්හැරිය යුතුය. රාගය අත්හැරිය යුතුය. ඡන්දරාගය අත්හැරිය යුතුය. සංඛාර නිරෝධ ස්වභාවයට පැමිණෙන ධර්‍මයකි. එහිලා නුඹගේ ඡන්දය අත්හැරිය යුතුය. රාගය අත්හැරිය යුතුය. ඡන්දරාගය අත්හැරිය යුතුය. විඤ්ඤාණය නිරෝධ ස්වභාවයට පැමිණෙන ධර්‍මයකි. එහිලා නුඹගේ ඡන්දය අත්හැරිය යුතුය. රාගය අත්හැරිය යුතුය. ඡන්දරාගය අත්හැරිය යුතුය. රාධය, යමක් නිරෝධ ස්වභාවයට පැමිණෙන ධර්‍මයක්ද, එහිලා නුඹගේ ඡන්දය අත්හැරිය යුතුය. රාගය අත්හැරිය යුතුය. ඡන්දරාගය අත්හැරිය යුතුය.\"\n\nආයාචන වර්ගය තෙවෙනිය.\n\nඑහි සූත්‍ර සාරාංශය මෙසේය: මාර සූත්‍රය සහ මාරධම්ම සූත්‍රයද, අනිච්ච සූත්‍ර දෙකක්ද; දුක්ඛ සූත්‍ර දෙකක්ද, එසේම අනත්ථ සූත්‍ර දෙකක්ද; ඛය සූත්‍රය, වය සූත්‍රය, සමුදය සූත්‍රය, සහ නිරෝධධම්ම සූත්‍රයද වශයෙන් සූත්‍ර දොළසක් ඇතුළත් වේ.",
      "paliTitle": "Nirodhadhammasuttaṃ",
      "vagga": "Āyācanavaggo"
    },
    {
      "number": 194,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘yo kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Ko ca, rādha, māro? Rūpaṃ kho, rādha, māro; tatra te chando pahātabbo…pe… viññāṇaṃ māro; tatra te chando pahātabbo…pe… yo kho, rādha, māro; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo’’ti.",
      "english": "In Sāvatthī, the Blessed One said this to the venerable Radha, who was sitting to one side:\n\n“Whatever, Radha, is Māra; there your desire should be abandoned, your passion should be abandoned, your desirous passion should be abandoned. And what, Radha, is Māra? Form, Radha, is Māra; there your desire should be abandoned, your passion should be abandoned, your desirous passion should be abandoned. Feeling is Māra; there your desire should be abandoned, your passion should be abandoned, your desirous passion should be abandoned. Perception is Māra; there your desire should be abandoned, your passion should be abandoned, your desirous passion should be abandoned. Formations are Māra; there your desire should be abandoned, your passion should be abandoned, your desirous passion should be abandoned. Consciousness is Māra; there your desire should be abandoned, your passion should be abandoned, your desirous passion should be abandoned. Whatever, Radha, is Māra; there your desire should be abandoned, your passion should be abandoned, your desirous passion should be abandoned.”",
      "sinhala": "මෙය සැවැත් නුවරදී දේශනා කරන ලදී. එක් පසෙක වැඩ සිටි ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “රාධය, යමක් මාරයා වේද; එහි නුඹ විසින් ඡන්දය ප්‍රහීණ කළ යුතුයි, රාගය ප්‍රහීණ කළ යුතුයි, ඡන්දරාගය ප්‍රහීණ කළ යුතුයි. රාධය, මාරයා යනු කුමක්ද? රාධය, රූපය මාරයාය. එහි නුඹ විසින් ඡන්දය ප්‍රහීණ කළ යුතුයි, රාගය ප්‍රහීණ කළ යුතුයි, ඡන්දරාගය ප්‍රහීණ කළ යුතුයි. රාධය, වේදනාව මාරයාය. එහි නුඹ විසින් ඡන්දය ප්‍රහීණ කළ යුතුයි, රාගය ප්‍රහීණ කළ යුතුයි, ඡන්දරාගය ප්‍රහීණ කළ යුතුයි. රාධය, සංඥාව මාරයාය. එහි නුඹ විසින් ඡන්දය ප්‍රහීණ කළ යුතුයි, රාගය ප්‍රහීණ කළ යුතුයි, ඡන්දරාගය ප්‍රහීණ කළ යුතුයි. රාධය, සංස්කාර මාරයාය. එහි නුඹ විසින් ඡන්දය ප්‍රහීණ කළ යුතුයි, රාගය ප්‍රහීණ කළ යුතුයි, ඡන්දරාගය ප්‍රහීණ කළ යුතුයි. රාධය, විඤ්ඤාණය මාරයාය. එහි නුඹ විසින් ඡන්දය ප්‍රහීණ කළ යුතුයි, රාගය ප්‍රහීණ කළ යුතුයි, ඡන්දරාගය ප්‍රහීණ කළ යුතුයි. රාධය, යමක් මාරයා වේද; එහි නුඹ විසින් ඡන්දය ප්‍රහීණ කළ යුතුයි, රාගය ප්‍රහීණ කළ යුතුයි, ඡන්දරාගය ප්‍රහීණ කළ යුතුයි” යනුවෙනි.",
      "paliTitle": "Mārādisuttaekādasakaṃ",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 195,
      "pali": "Yo kho, rādha, māradhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo…pe….",
      "english": "Whatever, Radha, is of the nature of Māra – concerning that, your desire should be abandoned, your passion should be abandoned, your passionate desire should be abandoned.",
      "sinhala": "රාධය, යමක් මාර ධර්‍ම ස්වභාවයෙන් යුක්ත වේද, ඒ සියල්ලෙහි ඔබ විසින් ඡන්දය අත්හැරිය යුතුය, රාගය අත්හැරිය යුතුය, ඡන්දරාගය අත්හැරිය යුතුය.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 196,
      "pali": "Yaṃ kho, rādha, aniccaṃ…pe….",
      "english": "Whatever, Rādha, is impermanent is suffering. Whatever is suffering is not-self. Whatever is not-self should be seen as it actually is with right wisdom: 'This is not mine, this I am not, this is not my self.'",
      "sinhala": "යම්කිසි දෙයක් අනිත්‍ය ද, රාධය, එය දුක් සහගත ය. යම්කිසි දෙයක් දුක් සහගත ද, එය අනාත්ම යි. යම්කිසි දෙයක් අනාත්ම ද, 'මෙය මාගේ නොවේ, මේ මම නොවේ, මෙය මාගේ ආත්මය නොවේ' යැයි මෙලෙස මෙය යථාභූතව නිවැරදි ප්‍ර‍ඥාවෙන් දැක්ක යුතු ය.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 197,
      "pali": "Yo kho, rādha, aniccadhammo…pe….",
      "english": "Whatever, Radha, is of the nature to be impermanent, that is suffering; whatever is suffering, that is non-self; and whatever is non-self, that is not mine, I am not that, this is not my self. Thus, this should be seen as it actually is, with right wisdom.",
      "sinhala": "යම්කිසි යමක්, රාධය, අනිත්‍ය ස්වභාවයෙන් යුක්ත වේ ද, එය දුකකි. යම්කිසි යමක් දුක වේ ද, එය අනාත්ම ය. යම්කිසි යමක් අනාත්ම වේ ද, එය මාගේ නොවේ, එය මම නොවෙමි, එය මාගේ ආත්මය නොවේ යැයි (දැකිය යුතුයි). මෙලෙස මෙය යථාභූතව මනා ප්‍රඥාවෙන් දකින තැනැත්තා එහි විරාගී වෙයි. විරාගය තුළින් ඔහු විමුක්ත වෙයි. විමුක්ත වූ කල්හි, 'මම විමුක්ත වූයෙමි' යන ඤාණය ඔහුට ඇති වෙයි. 'ජාතිය ක්ෂය වී ඇත, බ්‍රහ්මචර්යාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ අවසන් ය, නැවත මේ තත්ත්වයට පැමිණීමක් නැත' යනුවෙන් ඔහු දැන ගනියි.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 198,
      "pali": "Yaṃ kho, rādha, dukkhaṃ…pe….",
      "english": "Whatever, Radha, is suffering, that is impermanent. Whatever is impermanent, that is suffering. Whatever is suffering, that is not-self. Whatever is not-self, that should be seen thus: 'This is not mine, this I am not, this is not my self.'",
      "sinhala": "රාධයෙනි, යම් රූපයක් ඇත්ද, එය දුකකි. යම් වේදනාවක් ඇත්ද, එය දුකකි. යම් සංඥාවක් ඇත්ද, එය දුකකි. යම් සංස්කාර සමූහයක් ඇත්ද, ඒවා දුකකි. යම් විඤ්ඤාණයක් ඇත්ද, එය දුකකි. රාධයෙනි, යමක් දුකක් වේ නම්, එය අනිත්‍‍යයි. යමක් අනිත්‍‍ය නම්, එය අනාත්මයි. යමක් අනාත්ම නම්, 'මෙය මගේ නොවේ, මම මෙය නොවෙමි, මෙය මාගේ ආත්මය නොවේ' යැයි මෙසේ මෙය ඇති සැටියෙන් මනා ප්‍‍ර‍‌ඥාවෙන් දැක්ක යුතුයි.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 199,
      "pali": "Yo kho, rādha, dukkhadhammo…pe….",
      "english": "That which, Rādha, is inherently characterized by suffering—in that, your desire should be abandoned.",
      "sinhala": "රාධය, යම් කිසිවක් දුක්‌ඛ ස්‌වභාවයෙන් යුක්‌ත වේ ද, එනම් රූපය, වේදනාව, සංඥාව, සංස්‌කාර, විඤ්ඤාණය යන මේ පංචස්‌කන්ධයෝ ය.\nයම් කිසිවක් දුක්‌ඛ ස්‌වභාවයෙන් යුක්‌ත වේ ද, එය අනිත්‍ය ස්‌වභාවයෙන් යුක්‌ත ය. යම් කිසිවක් අනිත්‍ය ස්‌වභාවයෙන් යුක්‌ත වේ ද, එය අනාත්ම ස්‌වභාවයෙන් යුක්‌ත ය.\nරාධය, අනාත්ම ස්‌වභාවයෙන් යුක්‌ත වූ රූපය, වේදනාව, සංඥාව, සංස්‌කාර, විඤ්ඤාණය 'මම මාගේ ය, මමය, මාගේ ආත්මය යැ'යි නො දැක්‌ක යුතු ය.\nමේ අයුරින් දකින ලද ශ්‍රැතවත් ආර්\\u200dය ශ්‍රාවක තෙම රූපය කෙරෙහි කලකිරේ. වේදනාව කෙරෙහි කලකිරේ. සංඥාව කෙරෙහි කලකිරේ. සංස්‌කාර කෙරෙහි කලකිරේ. විඤ්ඤාණය කෙරෙහි කලකිරේ.\nකලකිරීමෙන් නො ඇලීම (විරාගය) ඇති වේ. නො ඇලීමෙන් නැති කිරීම (නිරෝධය) සිදු වේ. නැති කිරීමෙන් විමුක්‌තිය (නිදහස) ලැබේ. විමුක්‌තිය ලබන විට 'මම නිදහස් වී යැ'යි යන ඥානය පහළ වේ. උපත ක්ෂය වී ය. බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදී. කළ යුතු දේ සිදු කරන ලදී. මේ සඳහා වෙනත් කිසිවක් කිරීමට නැතැයි ඔහු අවබෝධ කරයි.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 200,
      "pali": "Yo kho, rādha, anattā…pe….",
      "english": "Indeed, Radha, form is non-self; feeling is non-self; perception is non-self; fabrications are non-self; consciousness is non-self. Whatever is non-self is not mine; I am not that; that is not my self. This should be seen as it actually is with right wisdom.",
      "sinhala": "රාධයෙනි, යම් දෙයක් අනාත්ම වේ ද, එය මාගේ නොවේ, මම එය නොවෙමි, එය මාගේ ආත්මය ද නොවේ.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 201,
      "pali": "Yo kho, rādha, anattadhammo…pe….",
      "english": "Whatever, Raadha, is a phenomenon characterized by non-self, that is subject to affliction and not amenable to control; therefore, one cannot command it: ‘Let this be thus, let this not be thus.’ Thus, it is to be seen as: ‘This is not mine, this I am not, this is not my self.’ Seeing thus, one becomes disenchanted with it. With disenchantment, one becomes unattached. Through unattachment, one is liberated.",
      "sinhala": "යම්කිසි අනාත්ම ස්වභාවයක් ඇත්ද, රාධය, එය 'මෙය මගේ නොවේ, මෙය මම නොවෙමි, මෙය මගේ ආත්මය නොවේ' යැයි මෙලෙස යථාභූතව සම්‍යක් ප්‍රඥාවෙන් දැකිය යුත්තේය.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 202,
      "pali": "Yo kho, rādha, khayadhammo…pe….",
      "english": "Indeed, Rādha, that which is subject to destruction, subject to vanishing, subject to dispassion, and subject to cessation—when one sees that as ‘suffering’, one sees it rightly with perfect wisdom.",
      "sinhala": "යම්කිසි යමක්, රාධයෙනි, ක්‍ෂයවීමේ ස්වභාවයෙන් යුක්ත ද, වයවීමේ ස්වභාවයෙන් යුක්ත ද, විරාගීවීමේ ස්වභාවයෙන් යුක්ත ද, නිරුද්ධවීමේ ස්වභාවයෙන් යුක්ත ද, එය අනිත්‍ය යි. යම් දේ අනිත්‍ය ද, එය දුක් ය. යම් දේ දුක් ද, එය අනාත්‍ම ය. යම් දේ අනාත්‍ම ද, එය මාගේ නොවේ, මම එය නොවෙමි, එය මාගේ ආත්‍මය නොවේ යැයි මෙය මෙසේ ඇති සැටියෙන් මනා ප්‍රඥාවෙන් දැක්ක යුතු ය.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 203,
      "pali": "Yo kho, rādha, vayadhammo…pe….",
      "english": "Whatever, Rādha, is subject to decay, that is suffering. Whatever is suffering, that is not self. Whatever is not self, that should be seen as it actually is with right wisdom: ‘This is not mine, this I am not, this is not my self.’",
      "sinhala": "රාධයෙනි, යමක් විනාශයට පත්වන ස්වභාවයෙන් යුක්ත ද, එය 'දුකක්' යැයි යමෙක් දකී නම්, ඔහුට මනාකොට කලකිරීම ඇතිවේ. කලකිරීම නිසා ඔහු නොඇලෙයි. නොඇලීම නිසා නිදහස් වෙයි. නිදහස් වීමෙන් 'මම නිදහස් වී සිටිමි' යන ඥානය ඇතිවේ.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 204,
      "pali": "Yo kho, rādha, samudayadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo…pe….",
      "english": "Whatever, Rādha, is of the nature to arise: therein, your desire must be abandoned, your lust must be abandoned, your desirous passion must be abandoned, and so forth.",
      "sinhala": "රාධය, යම් කිසිවක් හටගැනීමේ ස්වභාවයෙන් යුක්ත වේද, ඒ කෙරෙහි නුඹ විසින් ඡන්දය පහකළ යුතු ය, රාගය පහකළ යුතු ය, ඡන්දරාගය පහකළ යුතු ය.",
      "paliTitle": "",
      "vagga": "Upanisinnavaggo"
    },
    {
      "number": 205,
      "pali": "Sāvatthinidānaṃ. Ekamantaṃ nisinnaṃ kho āyasmantaṃ rādhaṃ bhagavā etadavoca – ‘‘yo kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Ko ca, rādha, nirodhadhammo? Rūpaṃ kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Vedanā…pe… saññā…pe… saṅkhārā…pe… viññāṇaṃ nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo. Yo kho, rādha, nirodhadhammo; tatra te chando pahātabbo, rāgo pahātabbo, chandarāgo pahātabbo’’ti. ",
      "english": "While at Sāvatthī, the Blessed One addressed the Venerable Rādha, who was seated to one side: \"Whatever, Rādha, is subject to cessation—therein your desire is to be abandoned, your lust is to be abandoned, your lustful desire is to be abandoned. And what, Rādha, is that which is subject to cessation? Form, Rādha, is that which is subject to cessation; therein your desire is to be abandoned, your lust is to be abandoned, your lustful desire is to be abandoned. Feeling is that which is subject to cessation; therein your desire is to be abandoned, your lust is to be abandoned, your lustful desire is to be abandoned. Perception is that which is subject to cessation; therein your desire is to be abandoned, your lust is to be abandoned, your lustful desire is to be abandoned. Mental formations are that which is subject to cessation; therein your desire is to be abandoned, your lust is to be abandoned, your lustful desire is to be abandoned. Consciousness is that which is subject to cessation; therein your desire is to be abandoned, your lust is to be abandoned, your lustful desire is to be abandoned. Whatever, Rādha, is subject to cessation—therein your desire is to be abandoned, your lust is to be abandoned, your lustful desire is to be abandoned.\"",
      "sinhala": "සැවැත් නුවරදී. එක්පසෙක වැඩහුන් ආයුෂ්මත් රාධ තෙරුන්ට භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: ‘‘රාධයෙනි, යම් දෙයක් නිරෝධ ස්වභාවයෙන් යුක්ත ද, ඒ කෙරෙහි තොපගේ ඡන්දය අත්හළ යුතු ය, රාගය අත්හළ යුතු ය, ඡන්දරාගය අත්හළ යුතු ය. රාධයෙනි, නිරෝධ ස්වභාවයෙන් යුක්ත වූ ඒ කුමක් ද? රාධයෙනි, රූපය නිරෝධ ස්වභාවයෙන් යුක්ත ය. ඒ කෙරෙහි තොපගේ ඡන්දය අත්හළ යුතු ය, රාගය අත්හළ යුතු ය, ඡන්දරාගය අත්හළ යුතු ය. වේදනාව නිරෝධ ස්වභාවයෙන් යුක්ත ය. ඒ කෙරෙහි තොපගේ ඡන්දය අත්හළ යුතු ය, රාගය අත්හළ යුතු ය, ඡන්දරාගය අත්හළ යුතු ය. සංඥාව නිරෝධ ස්වභාවයෙන් යුක්ත ය. ඒ කෙරෙහි තොපගේ ඡන්දය අත්හළ යුතු ය, රාගය අත්හළ යුතු ය, ඡන්දරාගය අත්හළ යුතු ය. සංඛාර නිරෝධ ස්වභාවයෙන් යුක්ත ය. ඒ කෙරෙහි තොපගේ ඡන්දය අත්හළ යුතු ය, රාගය අත්හළ යුතු ය, ඡන්දරාගය අත්හළ යුතු ය. විඤ්ඤාණය නිරෝධ ස්වභාවයෙන් යුක්ත ය. ඒ කෙරෙහි තොපගේ ඡන්දය අත්හළ යුතු ය, රාගය අත්හළ යුතු ය, ඡන්දරාගය අත්හළ යුතු ය. රාධයෙනි, යම් දෙයක් නිරෝධ ස්වභාවයෙන් යුක්ත ද, ඒ කෙරෙහි තොපගේ ඡන්දය අත්හළ යුතු ය, රාගය අත්හළ යුතු ය, ඡන්දරාගය අත්හළ යුතු ය’’ යි.",
      "paliTitle": "Nirodhadhammasuttaṃ",
      "vagga": "Upanisinnavaggo"
    }
  ],
  "footer": {
    "pali": "Upanisinnavaggo catuttho. Tassuddānaṃ – Māro ca māradhammo ca, aniccena apare duve; Dukkhena ca duve vuttā, anattena tatheva ca; Khayavayasamudayaṃ, nirodhadhammena dvādasāti. Rādhasaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}