{
  "id": "sn.3.3",
  "title": {
    "pali": "Diṭṭhisaṃyuttaṃ",
    "english": "The Connected Discourses on Views",
    "sinhala": "දිට්ඨි සංයුත්තය"
  },
  "sections": [
    {
      "number": 206,
      "pali": "Ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane. Bhagavā etadavoca – ‘‘kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’’’ti? ‘‘Bhagavaṃmūlakā no, bhante, dhammā bhagavaṃnettikā bhagavaṃpaṭisaraṇā. Sādhu vata, bhante, bhagavantaññeva paṭibhātu etassa bhāsitassa attho. Bhagavato sutvā bhikkhū dhāressantī’’ti. ‘‘Tena hi, bhikkhave, suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’ti. Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā niccā vā aniccā vā’’ti… ‘‘saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ [yamidaṃ (aññattha)] diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca [imesu chasu (sī. syā. kaṃ. pī.) evamuparipi] ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti, dukkhasamudayepissa kaṅkhā pahīnā hoti, dukkhanirodhepissa kaṅkhā pahīnā hoti, dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Paṭhamaṃ.",
      "english": "At one time the Blessed One was dwelling in Sāvatthī, in Jeta’s Grove. The Blessed One said this: \"Monks, when what is present, what is clung to, what is fixated upon, does such a view arise: 'The winds do not blow, the rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is like a motionless pillar'?\"\n\n\"Venerable sir, our teachings are rooted in the Blessed One, guided by the Blessed One, and have the Blessed One as our refuge. It would be good, Venerable sir, if the Blessed One himself would illuminate the meaning of this statement. Having heard from the Blessed One, the monks will remember it.\"\n\n\"In that case, monks, listen and pay close attention; I will speak.\"\n\n\"Yes, Venerable sir,\" those monks replied to the Blessed One.\n\nThe Blessed One said this: \"Monks, when form is present, by clinging to form, by fixating on form, such a view arises: 'The winds do not blow, the rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is like a motionless pillar.' When feeling is present, by clinging to feeling, by fixating on feeling, such a view arises. When perception is present, by clinging to perception, by fixating on perception, such a view arises. When fabrications are present, by clinging to fabrications, by fixating on fabrications, such a view arises. And when consciousness is present, by clinging to consciousness, by fixating on consciousness, such a view arises: 'The winds do not blow, the rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is like a motionless pillar'.\"\n\n\"What do you think, monks, is form permanent or impermanent?\"\n\n\"Impermanent, Venerable sir.\"\n\n\"And that which is impermanent, is it suffering or happiness?\"\n\n\"Suffering, Venerable sir.\"\n\n\"And that which is impermanent, suffering, and subject to change, would such a view arise without clinging to it: 'The winds do not blow, the rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is like a motionless pillar'?\"\n\n\"No, Venerable sir.\"\n\n\"Is feeling permanent or impermanent? Is perception permanent or impermanent? Are fabrications permanent or impermanent? Is consciousness permanent or impermanent?\"\n\n\"Impermanent, Venerable sir.\"\n\n\"And that which is impermanent, is it suffering or happiness?\"\n\n\"Suffering, Venerable sir.\"\n\n\"And that which is impermanent, suffering, and subject to change, would such a view arise without clinging to it: 'The winds do not blow, the rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is like a motionless pillar'?\"\n\n\"No, Venerable sir.\"\n\n\"And this which is seen, heard, sensed, cognized; that which is attained, sought, and investigated by the mind—is that too permanent or impermanent?\"\n\n\"Impermanent, Venerable sir.\"\n\n\"And that which is impermanent, is it suffering or happiness?\"\n\n\"Suffering, Venerable sir.\"\n\n\"And that which is impermanent, suffering, and subject to change, would such a view arise without clinging to it: 'The winds do not blow, the rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is like a motionless pillar'?\"\n\n\"No, Venerable sir.\"\n\n\"When, monks, a noble disciple’s doubt is abandoned in these matters, and their doubt about suffering is abandoned, and their doubt about the origin of suffering is abandoned, and their doubt about the cessation of suffering is abandoned, and their doubt about the path leading to the cessation of suffering is abandoned—this, monks, is called a noble disciple who is a stream-enterer, no longer subject to falling into lower realms, firmly destined for full enlightenment.\"",
      "sinhala": "එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවනයෙහි වාසය කරති.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ‘‘මහණෙනි, කුමක් ඇති කල්හි, කුමක් ග්‍රහණය කරගෙන, කුමක් දැඩි කොට අල්ලාගෙන මෙබඳු දෘෂ්ටියක් උපදීද? එනම්: ‘සුළං නොහමයි, ගංගා නොගලයි, ගැබිණියන් නොවැදූවේය, හිරු සඳු නොනැඟේ නොබසී, ස්ථිර වූ ස්ථම්භයක් මෙන් පවතී’ යනුයි?’’ ‘‘ස්වාමීනි, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කරගත්තෝය, භාග්‍යවතුන් වහන්සේ විසින් මෙහෙයවනු ලද්දෝය, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තෝය. වහන්ස, මේ ප්‍රකාශිත කරුණෙහි අර්ථය භාග්‍යවතුන් වහන්සේටම පහළ වේවා. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරාගන්නාහුය.’’ ‘‘එසේ නම්, මහණෙනි, අසව්, හොඳින් මෙනෙහි කරව්, මම දේශනා කරන්නෙමි.’’ ‘‘එසේය, ස්වාමීනි’’ යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ‘‘මහණෙනි, රූපය ඇති කල්හි, රූපය ග්‍රහණය කරගෙන, රූපය දැඩි කොට අල්ලාගෙන මෙබඳු දෘෂ්ටියක් උපදී: ‘සුළං නොහමයි, ගංගා නොගලයි, ගැබිණියන් නොවැදූවේය, හිරු සඳු නොනැඟේ නොබසී, ස්ථිර වූ ස්ථම්භයක් මෙන් පවතී’ යනුයි. වේදනාව ඇති කල්හි... සංඥාව ඇති කල්හි... සංස්කාරයන් ඇති කල්හි... විඥානය ඇති කල්හි, විඥානය ග්‍රහණය කරගෙන, විඥානය දැඩි කොට අල්ලාගෙන මෙබඳු දෘෂ්ටියක් උපදී: ‘සුළං නොහමයි, ගංගා නොගලයි, ගැබිණියන් නොවැදූවේය, හිරු සඳු නොනැඟේ නොබසී, ස්ථිර වූ ස්ථම්භයක් මෙන් පවතී’ යනුයි.\n\n‘‘මහණෙනි, ඔබලා මේ කුමක් සිතන්නාහුද, රූපය නිත්‍යද අනිත්‍යද?’’ ‘‘අනිත්‍යය, ස්වාමීනි.’’ ‘‘යම් දෙයක් අනිත්‍යද, එය දුක්ද සැපද?’’ ‘‘දුක්ය, ස්වාමීනි.’’ ‘‘යම් දෙයක් අනිත්‍යද, දුක්ද, වෙනස්වීමේ ස්වභාවයෙන් යුක්තද, එය ග්‍රහණය නොකර මෙබඳු දෘෂ්ටියක් උපදියිද: ‘සුළං නොහමයි, ගංගා නොගලයි, ගැබිණියන් නොවැදූවේය, හිරු සඳු නොනැඟේ නොබසී, ස්ථිර වූ ස්ථම්භයක් මෙන් පවතී’ යනු?’’ ‘‘එසේ නොවේ, ස්වාමීනි.’’\n\n‘‘වේදනාව නිත්‍යද අනිත්‍යද?’’... ‘‘සංඥාව... සංස්කාරයන්... විඥානය නිත්‍යද අනිත්‍යද?’’ ‘‘අනිත්‍යය, ස්වාමීනි.’’ ‘‘යම් දෙයක් අනිත්‍යද, එය දුක්ද සැපද?’’ ‘‘දුක්ය, ස්වාමීනි.’’ ‘‘යම් දෙයක් අනිත්‍යද, දුක්ද, වෙනස්වීමේ ස්වභාවයෙන් යුක්තද, එය ග්‍රහණය නොකර මෙබඳු දෘෂ්ටියක් උපදියිද: ‘සුළං නොහමයි, ගංගා නොගලයි, ගැබිණියන් නොවැදූවේය, හිරු සඳු නොනැඟේ නොබසී, ස්ථිර වූ ස්ථම්භයක් මෙන් පවතී’ යනු?’’ ‘‘එසේ නොවේ, ස්වාමීනි.’’\n\n‘‘යම් මේ දෙයක් දක්නට ලැබුණේද, අසන ලද්දේද, අරමුණු කරන ලද්දේද, දැනගන්නා ලද්දේද, ලබන ලද්දේද, සොයන ලද්දේද, සිතින් විමසන ලද්දේද, ඒ සියල්ලද නිත්‍යද අනිත්‍යද?’’ ‘‘අනිත්‍යය, ස්වාමීනි.’’ ‘‘යම් දෙයක් අනිත්‍යද, එය දුක්ද සැපද?’’ ‘‘දුක්ය, ස්වාමීනි.’’ ‘‘යම් දෙයක් අනිත්‍යද, දුක්ද, වෙනස්වීමේ ස්වභාවයෙන් යුක්තද, එය ග්‍රහණය නොකර මෙබඳු දෘෂ්ටියක් උපදියිද: ‘සුළං නොහමයි, ගංගා නොගලයි, ගැබිණියන් නොවැදූවේය, හිරු සඳු නොනැඟේ නොබසී, ස්ථිර වූ ස්ථම්භයක් මෙන් පවතී’ යනු?’’ ‘‘එසේ නොවේ, ස්වාමීනි.’’\n\n‘‘මහණෙනි, යම් හෙයකින් ආර්ය ශ්‍රාවකයාට මේ ස්ථාන පිළිබඳවද (රූප, වේදනා, සංඥා, සංස්කාර, විඥාණ සහ දක්නට ලැබුණ ආදිය), දුක් පිළිබඳවද, දුක් හටගැනීම පිළිබඳවද, දුක් නිරෝධය පිළිබඳවද, දුක් නිරෝධයට පමුණුවන ප්‍රතිපදාව පිළිබඳවද සැක පහවී යන්නේද, මහණෙනි, මේ ආර්ය ශ්‍රාවකයා සෝවාන් වූයේය, විනාශයට නොපත්වන ස්වභාව ඇත්තේය, නියත වශයෙන්ම සම්බෝධියට පත් වන සුළුයැයි කියනු ලැබේ.’’\n\nපළමුවැන්නයි.",
      "paliTitle": "Vātasuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 207,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘etaṃ mama, esohamasmi, eso me attā’ti. Vedanāya sati…pe… saññāya sati … saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘etaṃ mama, esohamasmi, eso me attā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… ‘‘vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti…pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Dutiyaṃ.",
      "english": "At Savatthi.\n\n“Monks, when what is present, clinging to what, insisting on what, does such a view arise: ‘This is mine, I am this, this is my self’?”\n\n“Our teachings, Venerable Sir, have the Blessed One as their root, their guide, and their refuge. It would be excellent if the Blessed One himself would clarify the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.”\n\n“When, monks, there is form, clinging to form, insisting on form, such a view arises: ‘This is mine, I am this, this is my self.’ When there is feeling, clinging to feeling, insisting on feeling, such a view arises: ‘This is mine, I am this, this is my self.’ When there is perception, clinging to perception, insisting on perception, such a view arises: ‘This is mine, I am this, this is my self.’ When there are mental formations, clinging to mental formations, insisting on mental formations, such a view arises: ‘This is mine, I am this, this is my self.’ When there is consciousness, clinging to consciousness, insisting on consciousness, such a view arises: ‘This is mine, I am this, this is my self.’”\n\n“What do you think, monks, is form permanent or impermanent?”\n“Impermanent, Venerable Sir.”\n“Is feeling permanent or impermanent? Is perception permanent or impermanent? Are mental formations permanent or impermanent? Is consciousness permanent or impermanent?”\n“Impermanent, Venerable Sir.”\n\n“Could such a view arise—‘This is mine, I am this, this is my self’—without clinging to that which is impermanent?”\n“No, Venerable Sir.”\n\n“All that is seen, heard, sensed, cognized, attained, sought, and pondered by the mind—is that permanent or impermanent?”\n“Impermanent, Venerable Sir.”\n“But that which is impermanent, is it suffering or pleasure?”\n“Suffering, Venerable Sir.”\n“But that which is impermanent, suffering, and subject to change—could such a view arise: ‘This is mine, I am this, this is my self’—without clinging to that?”\n“No, Venerable Sir.”\n\n“When, monks, a noble disciple’s doubt is abandoned regarding these points, and their doubt regarding suffering is abandoned, their doubt regarding the origin of suffering is abandoned, their doubt regarding the cessation of suffering is abandoned, and their doubt regarding the path leading to the cessation of suffering is abandoned—such a noble disciple is called a stream-enterer, one no longer subject to falling into lower states, certain of liberation, and destined for full awakening.”",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි. \"භික්ෂූනි, කුමක් තිබියදීද, කුමක් උපාදානය කරගෙනද, කුමක් දැඩිව අල්ලාගෙනද, 'මෙය මගේය, මම මේ වෙමි, මෙය මගේ ආත්මයයි' යන මෙබඳු දෘෂ්ටියක් හටගන්නේ?\"\n\n\"ස්වාමීනි, ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ ප්‍රත්‍යය කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. ස්වාමීනි, භාග්‍යවතුන් වහන්සේටම මේ දේශනාවේ අර්ථය පැනනැගීම යහපත්ය. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරන්නාහ.\"\n\n\"භික්ෂූනි, රූපය තිබියදී, රූපය උපාදානය කරගෙන, රූපය දැඩිව අල්ලාගෙන, 'මෙය මගේය, මම මේ වෙමි, මෙය මගේ ආත්මයයි' යන මෙබඳු දෘෂ්ටියක් හටගනී. වේදනාව තිබියදී, වේදනාව උපාදානය කරගෙන, වේදනාව දැඩිව අල්ලාගෙන, 'මෙය මගේය, මම මේ වෙමි, මෙය මගේ ආත්මයයි' යන මෙබඳු දෘෂ්ටියක් හටගනී. සංඥාව තිබියදී, සංඥාව උපාදානය කරගෙන, සංඥාව දැඩිව අල්ලාගෙන, 'මෙය මගේය, මම මේ වෙමි, මෙය මගේ ආත්මයයි' යන මෙබඳු දෘෂ්ටියක් හටගනී. සංස්කාරයන් තිබියදී, සංස්කාරයන් උපාදානය කරගෙන, සංස්කාරයන් දැඩිව අල්ලාගෙන, 'මෙය මගේය, මම මේ වෙමි, මෙය මගේ ආත්මයයි' යන මෙබඳු දෘෂ්ටියක් හටගනී. විඤ්ඤාණය තිබියදී, විඤ්ඤාණය උපාදානය කරගෙන, විඤ්ඤාණය දැඩිව අල්ලාගෙන, 'මෙය මගේය, මම මේ වෙමි, මෙය මගේ ආත්මයයි' යන මෙබඳු දෘෂ්ටියක් හටගනී.\"\n\n\"භික්ෂූනි, ඔබලා මේ කුමක් සිතන්නහුද? රූපය නිත්‍යද, අනිත්‍යද?\"\n\n\"අනිත්‍යයි, ස්වාමීනි.\"\n\n\"වේදනාව, සංඥාව, සංස්කාර, විඤ්ඤාණය නිත්‍යද, අනිත්‍යද?\"\n\n\"අනිත්‍යයි, ස්වාමීනි.\"\n\n\"එසේ නම්, එය උපාදානය නොකරගෙන, 'මෙය මගේය, මම මේ වෙමි, මෙය මගේ ආත්මයයි' යන මෙබඳු දෘෂ්ටියක් හටගනීද?\"\n\n\"එසේ නොවේ, ස්වාමීනි.\"\n\n\"යම් මේ දැක ඇත්තාවූ, අසා ඇත්තාවූ, ආඝ්‍රාණය, රසවින්දනය, ස්පර්ශය මගින් දැන ඇත්තාවූ, විශේෂයෙන් දැන ඇත්තාවූ, ලබා ඇත්තාවූ, සොයා ඇත්තාවූ, සිතින් මනාව විමසා ඇත්තාවූ දේ ද, ඒද නිත්‍යද, අනිත්‍යද?\"\n\n\"අනිත්‍යයි, ස්වාමීනි.\"\n\n\"යම් නම් අනිත්‍යද, ඒ දුක් සහිතද, සැප සහිතද?\"\n\n\"දුක් සහිතයි, ස්වාමීනි.\"\n\n\"යම් නම් අනිත්‍යද, දුක් සහිතද, විපරිණාම වීමේ ස්වභාවයෙන් යුක්තද, එය උපාදානය නොකරගෙන, 'මෙය මගේය, මම මේ වෙමි, මෙය මගේ ආත්මයයි' යන මෙබඳු දෘෂ්ටියක් හටගනීද?\"\n\n\"එසේ නොවේ, ස්වාමීනි.\"\n\n\"භික්ෂූනි, යම් හෙයකින් ආර්ය ශ්‍රාවකයාට මේ කරුණු වල ඇති සැකය පහවී ඇත්තේද, දුකෙහිද සැකය පහවී ඇත්තේද, දුක හටගැනීමෙහිද සැකය පහවී ඇත්තේද, දුක නැති කිරීමෙහිද සැකය පහවී ඇත්තේද, දුක නැති කිරීමට පමුණුවන ප්‍රතිපදාවෙහිද සැකය පහවී ඇත්තේද, භික්ෂූනි, මේ ආර්ය ශ්‍රාවකයා සෝවාන් වූයේ යැයි කියනු ලැබේ. හෙතෙම දුගතියට නොවැටීමේ ස්වභාවයෙන් යුක්තය, නියතය, සම්බෝධිය පරම කොට ඇත්තේය.\"\n\nදෙවෙනි සූත්‍රයයි.",
      "paliTitle": "Etaṃmamasuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 208,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘so attā, so loko, so pecca bhavissāmi nicco dhuvo sassato avipariṇāmadhammo’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe…. ‘‘Rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘so attā, so loko, so pecca bhavissāmi nicco dhuvo sassato avipariṇāmadhammo’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘so attā, so loko, so pecca bhavissāmi nicco dhuvo sassato avipariṇāmadhammo’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ bhante’’…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘so attā…pe… avipariṇāmadhammo’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘so attā…pe… avipariṇāmadhammo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘so attā, so loko, so pecca bhavissāmi nicco dhuvo sassato avipariṇāmadhammo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti…pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Tatiyaṃ.",
      "english": "At Sāvatthī.\n\n“Monks, with what existing, grasping what, clinging to what, does such a view arise: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change’?”\n\n“Bhante, our teachings are rooted in the Blessed One, guided by the Blessed One, and have the Blessed One as their refuge. It would be good if the Blessed One were to explain the meaning of these statements. Having heard it from the Blessed One, the monks will remember it.”\n\n“Monks, with form existing, grasping form, clinging to form, such a view arises: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change.’ With feeling existing, grasping feeling, clinging to feeling, such a view arises: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change.’ With perception existing, grasping perception, clinging to perception, such a view arises: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change.’ With volitional formations existing, grasping volitional formations, clinging to volitional formations, such a view arises: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change.’ With consciousness existing, grasping consciousness, clinging to consciousness, such a view arises: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change’.”\n\n“What do you think, monks, is form permanent or impermanent?” “Impermanent, Bhante.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Bhante.” “Is that which is impermanent, unsatisfactory, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Bhante.” “And without grasping that, would such a view arise: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change’?” “No, Bhante.”\n\n“Is feeling permanent or impermanent?” “Impermanent, Bhante.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Bhante.” “Is that which is impermanent, unsatisfactory, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Bhante.” “And without grasping that, would such a view arise: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change’?” “No, Bhante.” “Is perception permanent or impermanent?” “Impermanent, Bhante.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Bhante.” “Is that which is impermanent, unsatisfactory, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Bhante.” “And without grasping that, would such a view arise: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change’?” “No, Bhante.” “Are volitional formations permanent or impermanent?” “Impermanent, Bhante.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Bhante.” “Is that which is impermanent, unsatisfactory, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Bhante.” “And without grasping that, would such a view arise: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change’?” “No, Bhante.” “Is consciousness permanent or impermanent?” “Impermanent, Bhante.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Bhante.” “Is that which is impermanent, unsatisfactory, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Bhante.” “And without grasping that, would such a view arise: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change’?” “No, Bhante.”\n\n“Whatever is seen, heard, sensed, cognized, attained, sought, or pondered by the mind—is that too permanent or impermanent?” “Impermanent, Bhante.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Bhante.” “Is that which is impermanent, unsatisfactory, and subject to change fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Bhante.” “And without grasping that, would such a view arise: ‘That is my self, that is the world; after death, I shall be permanent, stable, eternal, not subject to change’?” “No, Bhante.”\n\n“Monks, when doubt in these matters is abandoned by a noble disciple, and doubt in suffering is abandoned by them, doubt in the origin of suffering is abandoned by them, doubt in the cessation of suffering is abandoned by them, and doubt in the path leading to the cessation of suffering is abandoned by them—then, monks, such a noble disciple is called a stream-enterer, one not subject to falling into lower realms, assured, and bound for full enlightenment.”",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\n\n“මහණෙනි, කුමක් තිබියදීද, කුමක් උපාදාන කරගෙනද, කුමක් දැඩිව අල්ලාගෙනද, මෙබඳු දෘෂ්ටියක් හටගන්නේ – ‘ඒ ආත්මයත් ලෝකයත් එකයි, මම පරලොවදී නිත්‍ය වූ, ස්ථිර වූ, සදාකාලික වූ, වෙනස් නොවන ස්වභාවයක් ඇති කෙනෙක් වන්නෙමි’ කියාය?”\n\n“වහන්ස, අපගේ ධර්මයන් භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත…”\n\n“මහණෙනි, රූපය තිබියදී, රූපය උපාදාන කරගෙන, රූපය දැඩිව අල්ලාගෙන, මෙබඳු දෘෂ්ටියක් හටගන්නේ – ‘ඒ ආත්මයත් ලෝකයත් එකයි, මම පරලොවදී නිත්‍ය වූ, ස්ථිර වූ, සදාකාලික වූ, වෙනස් නොවන ස්වභාවයක් ඇති කෙනෙක් වන්නෙමි’ කියාය. වේදනාව තිබියදී… සංඥාව තිබියදී… සංස්කාරයන් තිබියදී… විඤ්ඤාණය තිබියදී, විඤ්ඤාණය උපාදාන කරගෙන, විඤ්ඤාණය දැඩිව අල්ලාගෙන, මෙබඳු දෘෂ්ටියක් හටගන්නේ – ‘ඒ ආත්මයත් ලෝකයත් එකයි, මම පරලොවදී නිත්‍ය වූ, ස්ථිර වූ, සදාකාලික වූ, වෙනස් නොවන ස්වභාවයක් ඇති කෙනෙක් වන්නෙමි’ කියාය.”\n\n“මහණෙනි, ඔබලා මේ කුමක් සිතන්නහුද? රූපය නිත්‍යද අනිත්‍යද?”\n“අනිත්‍යය, වහන්ස…”\n“එසේ නම්, එය උපාදාන නොකර, මෙබඳු දෘෂ්ටියක් හටගනීද – ‘ඒ ආත්මයත් ලෝකයත් එකයි… වෙනස් නොවන ස්වභාවයක් ඇති කෙනෙක් වන්නෙමි’ කියා?”\n“නැත, වහන්ස.”\n“වේදනාව… සංඥාව… සංස්කාරයෝ… විඤ්ඤාණය නිත්‍යද අනිත්‍යද?”\n“අනිත්‍යය, වහන්ස…”\n“එසේ නම්, එය උපාදාන නොකර, මෙබඳු දෘෂ්ටියක් හටගනීද – ‘ඒ ආත්මයත් ලෝකයත් එකයි… වෙනස් නොවන ස්වභාවයක් ඇති කෙනෙක් වන්නෙමි’ කියා?”\n“නැත, වහන්ස.”\n“යමක් දුටු දෙයක්ද, ඇසූ දෙයක්ද, දැනගත් දෙයක්ද (ගන්ධ, රස, ස්පර්ශ), විඤ්ඤාණයෙන් අවබෝධ කළ දෙයක්ද, ලැබූ දෙයක්ද, සොයා බැලූ දෙයක්ද, සිතින් විමසා බැලූ දෙයක්ද, එයත් නිත්‍යද අනිත්‍යද?”\n“අනිත්‍යය, වහන්ස…”\n“එසේ නම්, එය උපාදාන නොකර, මෙබඳු දෘෂ්ටියක් හටගනීද – ‘ඒ ආත්මයත් ලෝකයත් එකයි, මම පරලොවදී නිත්‍ය වූ, ස්ථිර වූ, සදාකාලික වූ, වෙනස් නොවන ස්වභාවයක් ඇති කෙනෙක් වන්නෙමි’ කියා?”\n“නැත, වහන්ස.”\n\n“මහණෙනි, යම් හෙයකින් ආර්ය ශ්‍රාවකයාට මේ කාරණා පිළිබඳ සැකය ප්‍රහීණ වීද, දුක පිළිබඳවද ඔහුගේ සැකය ප්‍රහීණ වීද… දුක්ඛ නිරෝධ ගාමිනී ප්‍රතිපදාව පිළිබඳවද ඔහුගේ සැකය ප්‍රහීණ වීද, මහණෙනි, මේ ආර්ය ශ්‍රාවකයා සොතාපන්නයෙක්, නැවත නොවැටෙන ස්වභාවයක් ඇත්තෙක්, නියත වශයෙන්ම සම්බෝධිය පරමායන කොට ඇත්තෙක් යැයි කියනු ලැබේ.”\n\nතෙවැනි සූත්‍රයයි.",
      "paliTitle": "Soattāsuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 209,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘no cassaṃ, no ca me siyā, nābhavissa, na me bhavissatī’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe…. ‘‘Rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘no cassaṃ, no ca me siyā, nābhavissa, na me bhavissatī’ti. Vedanāya sati… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘no cassaṃ, no ca me siyā, nābhavissa, na me bhavissatī’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘no cassaṃ, no ca me siyā, nābhavissa, na me bhavissatī’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘no cassaṃ, no ca me siyā, nābhavissa, na me bhavissatī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘no cassaṃ, no ca me siyā, nābhavissa, na me bhavissatī’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti…pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Catutthaṃ.",
      "english": "\"Monks, when what exists, with what as a basis, and clinging to what, does such a view arise: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’?\"\n\n\"Our teachings, Venerable Sir, are rooted in the Blessed One, guided by the Blessed One, and have the Blessed One as their refuge. It would be excellent, Venerable Sir, if the Blessed One himself would elucidate the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.\"\n\n\"Monks, when form exists, with form as a basis, and clinging to form, such a view arises: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’. When feeling exists, with feeling as a basis, and clinging to feeling, such a view arises: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’. When perception exists, with perception as a basis, and clinging to perception, such a view arises: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’. When mental formations exist, with mental formations as a basis, and clinging to mental formations, such a view arises: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’. When consciousness exists, with consciousness as a basis, and clinging to consciousness, such a view arises: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’.\"\n\n\"What do you think, monks, is form permanent or impermanent?\" \"Impermanent, Venerable Sir.\" \"And is what is impermanent satisfactory or unsatisfactory?\" \"Unsatisfactory, Venerable Sir.\" \"And is it appropriate to regard what is impermanent, unsatisfactory, and subject to change as: ‘This is mine, this I am, this is my self’?\" \"No, Venerable Sir.\" \"Furthermore, without clinging to that, would such a view arise: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’?\" \"No, Venerable Sir.\"\n\n\"Is feeling permanent or impermanent?\" \"Impermanent, Venerable Sir.\" \"And is what is impermanent satisfactory or unsatisfactory?\" \"Unsatisfactory, Venerable Sir.\" \"And is it appropriate to regard what is impermanent, unsatisfactory, and subject to change as: ‘This is mine, this I am, this is my self’?\" \"No, Venerable Sir.\" \"Furthermore, without clinging to that, would such a view arise: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’?\" \"No, Venerable Sir.\"\n\n\"Is perception permanent or impermanent?\" \"Impermanent, Venerable Sir.\" \"And is what is impermanent satisfactory or unsatisfactory?\" \"Unsatisfactory, Venerable Sir.\" \"And is it appropriate to regard what is impermanent, unsatisfactory, and subject to change as: ‘This is mine, this I am, this is my self’?\" \"No, Venerable Sir.\" \"Furthermore, without clinging to that, would such a view arise: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’?\" \"No, Venerable Sir.\"\n\n\"Are mental formations permanent or impermanent?\" \"Impermanent, Venerable Sir.\" \"And is what is impermanent satisfactory or unsatisfactory?\" \"Unsatisfactory, Venerable Sir.\" \"And is it appropriate to regard what is impermanent, unsatisfactory, and subject to change as: ‘This is mine, this I am, this is my self’?\" \"No, Venerable Sir.\" \"Furthermore, without clinging to that, would such a view arise: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’?\" \"No, Venerable Sir.\"\n\n\"Is consciousness permanent or impermanent?\" \"Impermanent, Venerable Sir.\" \"And is what is impermanent satisfactory or unsatisfactory?\" \"Unsatisfactory, Venerable Sir.\" \"And is it appropriate to regard what is impermanent, unsatisfactory, and subject to change as: ‘This is mine, this I am, this is my self’?\" \"No, Venerable Sir.\" \"Furthermore, without clinging to that, would such a view arise: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’?\" \"No, Venerable Sir.\"\n\n\"And what is seen, heard, sensed, cognized, attained, sought, and pondered by the mind—is that permanent or impermanent?\" \"Impermanent, Venerable Sir.\" \"And is what is impermanent satisfactory or unsatisfactory?\" \"Unsatisfactory, Venerable Sir.\" \"And is it appropriate to regard what is impermanent, unsatisfactory, and subject to change as: ‘This is mine, this I am, this is my self’?\" \"No, Venerable Sir.\" \"Furthermore, without clinging to that, would such a view arise: ‘I might not be, I might not have; I might not be in the future, I might not have in the future’?\" \"No, Venerable Sir.\"\n\n\"Monks, when an noble disciple has abandoned doubt regarding these things, and his doubt regarding suffering is abandoned, his doubt regarding the origin of suffering is abandoned, his doubt regarding the cessation of suffering is abandoned, and his doubt regarding the path leading to the cessation of suffering is abandoned – such a noble disciple, monks, is called a stream-enterer, not subject to falling into lower realms, assured, and headed for full awakening.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\n“මහණෙනි, යමක් තිබෙන කල්හි, යමක් උපාදාන කරගෙන, යමක් දැඩිව අල්ලාගෙන ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදීද?” “ස්වාමීනි, ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේම ධර්මයෙහි මුලද, ධර්මයෙහි නායකයාද, ධර්මයෙහි පිහිටද සේක. භාග්‍යවතුන් වහන්සේම මෙය පැහැදිලි කර දෙන සේක්වා! භාග්‍යවතුන් වහන්සේ වදාරණ දේ අසා අපි එය පිළිගනිමු.”\n\n“මහණෙනි, රූපය තිබෙන කල්හි, රූපය උපාදාන කරගෙන, රූපය දැඩිව අල්ලාගෙන ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදී. වේදනාව තිබෙන කල්හි, වේදනාව උපාදාන කරගෙන, වේදනාව දැඩිව අල්ලාගෙන ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදී. සංඥාව තිබෙන කල්හි, සංඥාව උපාදාන කරගෙන, සංඥාව දැඩිව අල්ලාගෙන ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදී. සංස්කාර තිබෙන කල්හි, සංස්කාර උපාදාන කරගෙන, සංස්කාර දැඩිව අල්ලාගෙන ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදී. විඤ්ඤාණය තිබෙන කල්හි, විඤ්ඤාණය උපාදාන කරගෙන, විඤ්ඤාණය දැඩිව අල්ලාගෙන ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදී.”\n\n“මහණෙනි, ඒ කුමක්ද සිතන්නේ? රූපය නිත්‍යද, අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “ඒ රූපය උපාදාන නොකර, ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදිය හැකිද?” “නොවේ ස්වාමීනි.”\n\n“වේදනාව නිත්‍යද, අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “ඒ වේදනාව උපාදාන නොකර, ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදිය හැකිද?” “නොවේ ස්වාමීනි.” “සංඥාව නිත්‍යද, අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “ඒ සංඥාව උපාදාන නොකර, ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදිය හැකිද?” “නොවේ ස්වාමීනි.” “සංස්කාර නිත්‍යද, අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “ඒ සංස්කාර උපාදාන නොකර, ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදිය හැකිද?” “නොවේ ස්වාමීනි.” “විඤ්ඤාණය නිත්‍යද, අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “ඒ විඤ්ඤාණය උපාදාන නොකර, ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදිය හැකිද?” “නොවේ ස්වාමීනි.”\n\n“දැක ඇති, අසා ඇති, ස්පර්ශයෙන් දැන ඇති, විඤ්ඤාණයෙන් දත්, ලබා ඇති, සොයා ඇති, මනසින් විමසා බලා ඇති යමක් ඇත්නම්, ඒ දේ ද නිත්‍යද, අනිත්‍යද?” “අනිත්‍යයි, ස්වාමීනි.” “ඒ දේ උපාදාන නොකර, ‘මම නොසිටින්නෙම්වා, මට අයිති යමක් නොවේවා, මම නොසිටියෙම්වා, මට අයිති යමක් නොවන්නේය’ යන මෙබඳු දිට්ඨියක් උපදිය හැකිද?” “නොවේ ස්වාමීනි.”\n\n“මහණෙනි, යම් කලක ආර්ය ශ්‍රාවකයාට මේ කරුණු පිළිබඳව ඇති සැකය ප්‍රහීණ වේද, දුක පිළිබඳව ඇති සැකයද ප්‍රහීණ වේද, දුක ඇතිවීමට හේතුව පිළිබඳව ඇති සැකයද ප්‍රහීණ වේද, දුක නැති කිරීම පිළිබඳව ඇති සැකයද ප්‍රහීණ වේද, දුක නැති කිරීමේ මාර්ගය පිළිබඳව ඇති සැකයද ප්‍රහීණ වේද, – මහණෙනි, මේ ආර්ය ශ්‍රාවකයා සෝවාන් වූවෙක්, අපායට නොවැටෙන ස්වභාවය ඇත්තෙක්, නියත වූ, සම්බෝධිය පිණිස පවතින තැනැත්තෙක් යැයි කියනු ලැබේ.”",
      "paliTitle": "Nocamesiyāsuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 210,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘natthi dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ [sukkaṭadukkaṭānaṃ (sī. pī.)] kammānaṃ phalaṃ vipāko; natthi ayaṃ loko, natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā; natthi loke samaṇabrāhmaṇā sammaggatā [samaggatā (ka.)] sammāpaṭipannā ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedenti. Cātumahābhūtiko [cātummahābhūtiko (sī. syā. kaṃ. pī.)] ayaṃ puriso yadā kālaṅkaroti pathavī pathavīkāyaṃ anupeti anupagacchati, āpo āpokāyaṃ anupeti anupagacchati, tejo tejokāyaṃ anupeti anupagacchati, vāyo vāyokāyaṃ anupeti anupagacchati. Ākāsaṃ indriyāni saṅkamanti. Āsandipañcamā purisā mataṃ ādāya gacchanti. Yāva āḷāhanā padāni paññāyanti. Kāpotakāni aṭṭhīni bhavanti. Bhassantā āhutiyo. Dattupaññattaṃ yadidaṃ dānaṃ [dattupaññattamidaṃ dānaṃ nāma (sabbattha)]. Tesaṃ tucchaṃ musā vilāpo ye keci atthikavādaṃ vadanti. Bāle ca paṇḍite ca kāyassa bhedā ucchijjanti vinassanti na honti paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… kāyassa bhedā ucchijjanti vinassanti na honti paraṃ maraṇā’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… kāyassa bhedā ucchijjanti vinassanti na honti paraṃ maraṇā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… kāyassa bhedā ucchijjanti vinassanti na honti paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… kāyassa bhedā ucchijjanti vinassanti na honti paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘natthi dinnaṃ, natthi yiṭṭhaṃ…pe… ye keci atthikavādaṃ vadanti; bāle ca paṇḍite ca kāyassa bhedā ucchijjanti vinassanti na honti paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti…pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Pañcamaṃ.",
      "english": "At Sāvatthī.\n\n“Monks, when what exists, with what as a basis, clinging to what, does such a view arise: ‘There is no giving, no offering, no sacrifice; there is no fruit or result of good and bad actions; there is no this world, no other world; there is no mother, no father, no spontaneously arisen beings; there are no ascetics or brahmins in the world who are rightly gone, rightly practicing, who have realized this world and the other world by their own direct knowledge and declare it. This person, composed of the four great elements, when he dies, the earth element returns to the mass of earth, coalesces with it; the water element returns to the mass of water, coalesces with it; the fire element returns to the mass of fire, coalesces with it; the wind element returns to the mass of wind, coalesces with it. The sense faculties pass into space. With the bier as the fifth, men carry the corpse away. Their footprints are seen only as far as the charnel ground. Their bones become dove-colored. Offerings end in ashes. This talk of giving is a mere conventional designation. Their talk is empty, false prattle, whoever speaks of existence. Both fools and wise, with the breaking up of the body, are annihilated, perish, and do not exist after death’?”\n\n“Venerable sir, our teachings have the Blessed One as their root…”\n\n“Monks, when there is form, with form as a basis, clinging to form, such a view arises: ‘There is no giving, no offering… both fools and wise, with the breaking up of the body, are annihilated, perish, and do not exist after death.’ When there is feeling, with feeling as a basis, clinging to feeling, such a view arises… When there is perception, with perception as a basis, clinging to perception, such a view arises… When there are mental formations, with mental formations as a basis, clinging to mental formations, such a view arises… When there is consciousness, with consciousness as a basis, clinging to consciousness, such a view arises: ‘There is no giving, no offering… both fools and wise, with the breaking up of the body, are annihilated, perish, and do not exist after death.’”\n\n“What do you think, monks, is form permanent or impermanent?” “Impermanent, venerable sir.” “But without clinging to it, would such a view arise: ‘There is no giving, no offering… both fools and wise, with the breaking up of the body, are annihilated, perish, and do not exist after death’?” “No, venerable sir.” “Is feeling… perception… mental formations… consciousness permanent or impermanent?” “Impermanent, venerable sir.” “But without clinging to it, would such a view arise: ‘There is no giving, no offering… both fools and wise, with the breaking up of the body, are annihilated, perish, and do not exist after death’?” “No, venerable sir.” “And that which is seen, heard, sensed, cognized, attained, sought, pondered by the mind—is that permanent or impermanent?” “Impermanent, venerable sir.” “But without clinging to it, would such a view arise: ‘There is no giving, no offering… their talk is empty, false prattle, whoever speaks of existence; both fools and wise, with the breaking up of the body, are annihilated, perish, and do not exist after death’?” “No, venerable sir.”\n\n“When, monks, a noble disciple’s doubt is abandoned regarding these matters, and his doubt about suffering is abandoned, and his doubt about the origin of suffering is abandoned, and his doubt about the cessation of suffering is abandoned, and his doubt about the path leading to the cessation of suffering is abandoned—this, monks, is called a noble disciple who is a stream-enterer, no longer subject to falling into lower realms, assured of enlightenment.”",
      "sinhala": "භික්ෂූනි, කුමක් පවතින කල්හි, කුමක් අරමුණු කොටගෙන, කුමක් දැඩිව අල්වාගෙන මෙබඳු දෘෂ්ටියක් හටගන්නේද – ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත, බිලි පූජා කළ දෙයක් නැත, හොඳ නරක කර්මයන්ගේ ඵලවිපාකයක් නැත; මෙලොවක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත; ලෝකයෙහි තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කර ප්‍රත්‍යක්ෂ කොට මෙලොවද පරලොවද ප්‍රකාශ කරන සම්‍යක් මාර්ගයට පැමිණි, සම්‍යක් ප්‍රතිපදාවේ පිහිටි ශ්‍රමණ-බ්‍රාහ්මණයෝ නැත. මේ පුරුෂ තෙමේ සතර මහා භූතයන්ගෙන් සැදුණෙකි. යම් කලක මිය යන්නේද, පඨවි ධාතුව පඨවි ධාතු කායයටම යයි, එයටම එකතු වේ. ආපෝ ධාතුව ආපෝ ධාතු කායයටම යයි, එයටම එකතු වේ. තේජෝ ධාතුව තේජෝ ධාතු කායයටම යයි, එයටම එකතු වේ. වායෝ ධාතුව වායෝ ධාතු කායයටම යයි, එයටම එකතු වේ. ඉන්ද්‍රියයෝ (මරණයෙන් පසු) ආකාශයට මිශ්‍ර වෙති. පස්වැනියා ආසන්දී (මළසිරුර රැගෙන යන රථය) කොට ඇති පුරුෂයෝ මළ සිරුර රැගෙන යති. දාහනය කරන තැන දක්වා ඔවුන්ගේ පා සටහන් පෙනේ. (මළ සිරුර) අළු පැහැති අස්ථි බවට පත් වේ. (දෙවියන්ට පූජා කරන) ආහුති දැවීම් දිය වී යන දෙයකි. දානය යනු නුවණැත්තන් විසින් පනවන ලද ප්‍රඥප්තියක් පමණකි. යම් කෙනෙක් (පරලොවක්, කර්ම ඵලයක්) ඇතැයි පවසනවා නම්, ඔවුන්ගේ ඒ වචන හිස්ය, බොරුය, විලාපයකි. අනුවණයාද, පණ්ඩිතයාද, කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේද?\n\nපින්වත් වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහුය, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහුය, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහුය. පින්වත් වහන්ස, භාග්‍යවතුන් වහන්සේටම මේ ප්‍රකාශයේ අර්ථය පැහැදිලි කිරීමට ලැබේවා. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය ධාරණය කර ගනිති.\nභික්ෂූනි, රූපය පවතින කල්හි, රූපය අරමුණු කොටගෙන, රූපය දැඩිව අල්වාගෙන, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත, බිලි පූජා කළ දෙයක් නැත, හොඳ නරක කර්මයන්ගේ ඵලවිපාකයක් නැත; මෙලොවක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත; ලෝකයෙහි තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කර ප්‍රත්‍යක්ෂ කොට මෙලොවද පරලොවද ප්‍රකාශ කරන සම්‍යක් මාර්ගයට පැමිණි, සම්‍යක් ප්‍රතිපදාවේ පිහිටි ශ්‍රමණ-බ්‍රාහ්මණයෝ නැත. මේ පුරුෂ තෙමේ සතර මහා භූතයන්ගෙන් සැදුණෙකි. යම් කලක මිය යන්නේද, පඨවි ධාතුව පඨවි ධාතු කායයටම යයි, එයටම එකතු වේ. ආපෝ ධාතුව ආපෝ ධාතු කායයටම යයි, එයටම එකතු වේ. තේජෝ ධාතුව තේජෝ ධාතු කායයටම යයි, එයටම එකතු වේ. වායෝ ධාතුව වායෝ ධාතු කායයටම යයි, එයටම එකතු වේ. ඉන්ද්‍රියයෝ (මරණයෙන් පසු) ආකාශයට මිශ්‍ර වෙති. පස්වැනියා ආසන්දී (මළසිරුර රැගෙන යන රථය) කොට ඇති පුරුෂයෝ මළ සිරුර රැගෙන යති. දාහනය කරන තැන දක්වා ඔවුන්ගේ පා සටහන් පෙනේ. (මළ සිරුර) අළු පැහැති අස්ථි බවට පත් වේ. (දෙවියන්ට පූජා කරන) ආහුති දැවීම් දිය වී යන දෙයකි. දානය යනු නුවණැත්තන් විසින් පනවන ලද ප්‍රඥප්තියක් පමණකි. යම් කෙනෙක් (පරලොවක්, කර්ම ඵලයක්) ඇතැයි පවසනවා නම්, ඔවුන්ගේ ඒ වචන හිස්ය, බොරුය, විලාපයකි. අනුවණයාද, පණ්ඩිතයාද, කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේය.\nවේදනාව පවතින කල්හි, වේදනාව අරමුණු කොටගෙන, වේදනාව දැඩිව අල්වාගෙන, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේය. සංඥාව පවතින කල්හි, සංඥාව අරමුණු කොටගෙන, සංඥාව දැඩිව අල්වාගෙන, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේය. සංස්කාරයන් පවතින කල්හි, සංස්කාරයන් අරමුණු කොටගෙන, සංස්කාරයන් දැඩිව අල්වාගෙන, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේය. විඤ්ඤාණය පවතින කල්හි, විඤ්ඤාණය අරමුණු කොටගෙන, විඤ්ඤාණය දැඩිව අල්වාගෙන, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේය.\n\nභික්ෂූනි, මේ පිළිබඳව නුඹලාට කුමක් සිතෙන්නේද? රූපය නිත්‍යද, අනිත්‍යද?\nපින්වත් වහන්ස, අනිත්‍යය.\nයම් දෙයක් අනිත්‍ය නම් එය දුකක්ද, සැපක්ද?\nපින්වත් වහන්ස, දුකකි.\nයම් දෙයක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත නම්, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\nඑසේ නම්, එය (රූපය) දැඩිව අල්ලා නොගැනීමෙන්, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත, බිලි පූජා කළ දෙයක් නැත, හොඳ නරක කර්මයන්ගේ ඵලවිපාකයක් නැත; මෙලොවක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත; ලෝකයෙහි තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කර ප්‍රත්‍යක්ෂ කොට මෙලොවද පරලොවද ප්‍රකාශ කරන සම්‍යක් මාර්ගයට පැමිණි, සම්‍යක් ප්‍රතිපදාවේ පිහිටි ශ්‍රමණ-බ්‍රාහ්මණයෝ නැත. මේ පුරුෂ තෙමේ සතර මහා භූතයන්ගෙන් සැදුණෙකි. යම් කලක මිය යන්නේද, පඨවි ධාතුව පඨවි ධාතු කායයටම යයි, එයටම එකතු වේ. ආපෝ ධාතුව ආපෝ ධාතු කායයටම යයි, එයටම එකතු වේ. තේජෝ ධාතුව තේජෝ ධාතු කායයටම යයි, එයටම එකතු වේ. වායෝ ධාතුව වායෝ ධාතු කායයටම යයි, එයටම එකතු වේ. ඉන්ද්‍රියයෝ (මරණයෙන් පසු) ආකාශයට මිශ්‍ර වෙති. පස්වැනියා ආසන්දී (මළසිරුර රැගෙන යන රථය) කොට ඇති පුරුෂයෝ මළ සිරුර රැගෙන යති. දාහනය කරන තැන දක්වා ඔවුන්ගේ පා සටහන් පෙනේ. (මළ සිරුර) අළු පැහැති අස්ථි බවට පත් වේ. (දෙවියන්ට පූජා කරන) ආහුති දැවීම් දිය වී යන දෙයකි. දානය යනු නුවණැත්තන් විසින් පනවන ලද ප්‍රඥප්තියක් පමණකි. යම් කෙනෙක් (පරලොවක්, කර්ම ඵලයක්) ඇතැයි පවසනවා නම්, ඔවුන්ගේ ඒ වචන හිස්ය, බොරුය, විලාපයකි. අනුවණයාද, පණ්ඩිතයාද, කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\n\nවේදනාව නිත්‍යද, අනිත්‍යද?\nපින්වත් වහන්ස, අනිත්‍යය.\nයම් දෙයක් අනිත්‍ය නම් එය දුකක්ද, සැපක්ද?\nපින්වත් වහන්ස, දුකකි.\nයම් දෙයක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත නම්, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\nඑසේ නම්, එය දැඩිව අල්ලා නොගැනීමෙන්, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\n\nසංඥාව නිත්‍යද, අනිත්‍යද?\nපින්වත් වහන්ස, අනිත්‍යය.\nයම් දෙයක් අනිත්‍ය නම් එය දුකක්ද, සැපක්ද?\nපින්වත් වහන්ස, දුකකි.\nයම් දෙයක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත නම්, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\nඑසේ නම්, එය දැඩිව අල්ලා නොගැනීමෙන්, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\n\nසංස්කාරයන් නිත්‍යද, අනිත්‍යද?\nපින්වත් වහන්ස, අනිත්‍යය.\nයම් දෙයක් අනිත්‍ය නම් එය දුකක්ද, සැපක්ද?\nපින්වත් වහන්ස, දුකකි.\nයම් දෙයක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත නම්, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\nඑසේ නම්, එය දැඩිව අල්ලා නොගැනීමෙන්, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\n\nවිඤ්ඤාණය නිත්‍යද, අනිත්‍යද?\nපින්වත් වහන්ස, අනිත්‍යය.\nයම් දෙයක් අනිත්‍ය නම් එය දුකක්ද, සැපක්ද?\nපින්වත් වහන්ස, දුකකි.\nයම් දෙයක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත නම්, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\nඑසේ නම්, එය දැඩිව අල්ලා නොගැනීමෙන්, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\n\nයම් මේ දැක ඇති, අසා ඇති, අත්දැක ඇති, දැනගෙන ඇති, ලබාගෙන ඇති, සොයාගෙන ඇති, මනසින් විමසා ඇති දෙයක් වේද, එයද නිත්‍යද, අනිත්‍යද?\nපින්වත් වහන්ස, අනිත්‍යය.\nයම් දෙයක් අනිත්‍ය නම් එය දුකක්ද, සැපක්ද?\nපින්වත් වහන්ස, දුකකි.\nයම් දෙයක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වීමේ ස්වභාවයෙන් යුක්ත නම්, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\nඑසේ නම්, එය දැඩිව අල්ලා නොගැනීමෙන්, ‘දුන් දෙයක් නැත, පිදූ දෙයක් නැත... යම් කෙනෙක් (පරලොවක්, කර්ම ඵලයක්) ඇතැයි පවසනවා නම්, ඔවුන්ගේ ඒ වචන හිස්ය, බොරුය, විලාපයකි. අනුවණයාද, පණ්ඩිතයාද, කය බිඳී යාමෙන් මුලිනුපුටා දමනු ලැබේ, විනාශයට පත් වේ, මරණින් පසු නොපවතියි’ යනුවෙන් මෙබඳු දෘෂ්ටියක් හටගන්නේද?\nපින්වත් වහන්ස, එය එසේ නොවේ.\n\nභික්ෂූනි, යම් හෙයකින් ආර්ය ශ්‍රාවකයාට මේ කාරණා සම්බන්ධයෙන් සැකය ප්‍රහීණ වීද, දුක පිළිබඳවද සැකය ප්‍රහීණ වීද, දුක ඇතිවීම පිළිබඳවද සැකය ප්‍රහීණ වීද, දුක නැතිවීම පිළිබඳවද සැකය ප්‍රහීණ වීද, දුක නැති කරන මාර්ගය පිළිබඳවද සැකය ප්‍රහීණ වීද – භික්ෂූනි, මේ ආර්ය ශ්‍රාවකයා සෝවාන් වූවෙක් ලෙස, අපායට නොවැටෙන සුළු වූවෙක් ලෙස, නියත වශයෙන්ම සම්බෝධියට පත් වීමට නියමිත වූවෙක් ලෙස කියනු ලැබේ.",
      "paliTitle": "Natthidinnasuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 211,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘karoto kārayato chindato chedāpayato pacato pācāpayato socato socāpayato kilamato kilamāpayato phandato phandāpayato pāṇamatipātayato adinnaṃ ādiyato sandhiṃ chindato nillopaṃ harato ekāgārikaṃ karoto paripanthe tiṭṭhato paradāraṃ gacchato musā bhaṇato karoto na karīyati pāpaṃ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekamaṃsakhalaṃ ekamaṃsapuñjaṃ kareyya, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Dakkhiṇaṃ cepi gaṅgāya tīraṃ gaccheyya; hananto ghātento chindanto chedāpento pacanto pācento, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Uttaraṃ cepi gaṅgāya tīraṃ gaccheyya; dadanto dāpento yajanto yajāpento, natthi tatonidānaṃ puññaṃ, natthi puññassa āgamo. Dānena damena saṃyamena saccavajjena natthi puññaṃ natthi puññassa āgamo’’’ti. Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘karoto kārayato…pe… natthi puññaṃ natthi puññassa āgamo’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘karoto kārayato…pe… natthi puññaṃ natthi puññassa āgamo’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘karoto…pe… natthi puññaṃ natthi puññassa āgamo’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘karoto kārayato …pe… natthi puññaṃ natthi puññassa āgamo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘karoto kārayato…pe… natthi puññaṃ natthi puññassa āgamo’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti…pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Chaṭṭhaṃ.",
      "english": "“Monks, when what exists, with what as a basis, clinging to what, does such a view arise: ‘When one acts, causes others to act; cuts, causes others to cut; cooks, causes others to cook; grieves, causes others to grieve; wearies, causes others to weary; trembles, causes others to tremble; takes life, takes what is not given, breaks into houses, plunders wealth, commits highway robbery, goes to another’s wife, speaks falsehood – for one acting thus, no evil is committed. Even if, with a razor-sharp discus, one were to make all beings on this earth into a single mass of flesh, a single pile of flesh, there would be no evil from that cause, no increase of evil. Even if one were to go to the southern bank of the Ganges, killing, causing to kill; cutting, causing to cut; cooking, causing to cook; there would be no evil from that cause, no increase of evil. Even if one were to go to the northern bank of the Ganges, giving, causing to give; sacrificing, causing to sacrifice; there would be no merit from that cause, no increase of merit. Through giving, through self-control, through restraint, through truthful speech, there is no merit, no increase of merit’?”\n\n“Revered One, for us, the teachings have the Blessed One as their root, their guide, their refuge. It would be good if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the bhikkhus will remember it.”\n\n“Monks, when form exists, with form as a basis, clinging to form, such a view arises: ‘When one acts, causes others to act; cuts, causes others to cut; cooks, causes others to cook; grieves, causes others to grieve; wearies, causes others to weary; trembles, causes others to tremble; takes life, takes what is not given, breaks into houses, plunders wealth, commits highway robbery, goes to another’s wife, speaks falsehood – for one acting thus, no evil is committed. Even if, with a razor-sharp discus, one were to make all beings on this earth into a single mass of flesh, a single pile of flesh, there would be no evil from that cause, no increase of evil. Even if one were to go to the southern bank of the Ganges, killing, causing to kill; cutting, causing to cut; cooking, causing to cook; there would be no evil from that cause, no increase of evil. Even if one were to go to the northern bank of the Ganges, giving, causing to give; sacrificing, causing to sacrifice; there would be no merit from that cause, no increase of merit. Through giving, through self-control, through restraint, through truthful speech, there is no merit, no increase of merit.’\nWhen feeling exists, with feeling as a basis, clinging to feeling, such a view arises: ‘When one acts, causes others to act... there is no merit, no increase of merit.’\nWhen perception exists, with perception as a basis, clinging to perception, such a view arises: ‘When one acts, causes others to act... there is no merit, no increase of merit.’\nWhen mental formations exist, with mental formations as a basis, clinging to mental formations, such a view arises: ‘When one acts, causes others to act... there is no merit, no increase of merit.’\nWhen consciousness exists, with consciousness as a basis, clinging to consciousness, such a view arises: ‘When one acts, causes others to act; cuts, causes others to cut; cooks, causes others to cook; grieves, causes others to grieve; wearies, causes others to weary; trembles, causes others to tremble; takes life, takes what is not given, breaks into houses, plunders wealth, commits highway robbery, goes to another’s wife, speaks falsehood – for one acting thus, no evil is committed. Even if, with a razor-sharp discus, one were to make all beings on this earth into a single mass of flesh, a single pile of flesh, there would be no evil from that cause, no increase of evil. Even if one were to go to the southern bank of the Ganges, killing, causing to kill; cutting, causing to cut; cooking, causing to cook; there would be no evil from that cause, no increase of evil. Even if one were to go to the northern bank of the Ganges, giving, causing to give; sacrificing, causing to sacrifice; there would be no merit from that cause, no increase of merit. Through giving, through self-control, through restraint, through truthful speech, there is no merit, no increase of merit.’”\n\n“What do you think, monks, is form permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is that which is impermanent satisfactory or unsatisfactory?”\n“Unsatisfactory, venerable sir.”\n“Is it proper to regard that which is impermanent, unsatisfactory, and subject to change as ‘This is mine, this I am, this is my self’?”\n“No, venerable sir.”\n“Would such a view arise, clinging to that which is not form: ‘When one acts, causes others to act; cuts, causes others to cut; cooks, causes others to cook; grieves, causes others to grieve; wearies, causes others to weary; trembles, causes others to tremble; takes life, takes what is not given, breaks into houses, plunders wealth, commits highway robbery, goes to another’s wife, speaks falsehood – for one acting thus, no evil is committed. Even if, with a razor-sharp discus, one were to make all beings on this earth into a single mass of flesh, a single pile of flesh, there would be no evil from that cause, no increase of evil. Even if one were to go to the southern bank of the Ganges, killing, causing to kill; cutting, causing to cut; cooking, causing to cook; there would be no evil from that cause, no increase of evil. Even if one were to go to the northern bank of the Ganges, giving, causing to give; sacrificing, causing to sacrifice; there would be no merit from that cause, no increase of merit. Through giving, through self-control, through restraint, through truthful speech, there is no merit, no increase of merit’?”\n“No, venerable sir.”\n\n“Is feeling permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is that which is impermanent satisfactory or unsatisfactory?”\n“Unsatisfactory, venerable sir.”\n“Is it proper to regard that which is impermanent, unsatisfactory, and subject to change as ‘This is mine, this I am, this is my self’?”\n“No, venerable sir.”\n“Would such a view arise, clinging to that which is not feeling: ‘When one acts, causes others to act... there is no merit, no increase of merit’?”\n“No, venerable sir.”\n\n“Is perception permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is that which is impermanent satisfactory or unsatisfactory?”\n“Unsatisfactory, venerable sir.”\n“Is it proper to regard that which is impermanent, unsatisfactory, and subject to change as ‘This is mine, this I am, this is my self’?”\n“No, venerable sir.”\n“Would such a view arise, clinging to that which is not perception: ‘When one acts, causes others to act... there is no merit, no increase of merit’?”\n“No, venerable sir.”\n\n“Are mental formations permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is that which is impermanent satisfactory or unsatisfactory?”\n“Unsatisfactory, venerable sir.”\n“Is it proper to regard that which is impermanent, unsatisfactory, and subject to change as ‘This is mine, this I am, this is my self’?”\n“No, venerable sir.”\n“Would such a view arise, clinging to that which is not mental formations: ‘When one acts, causes others to act... there is no merit, no increase of merit’?”\n“No, venerable sir.”\n\n“Is consciousness permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is that which is impermanent satisfactory or unsatisfactory?”\n“Unsatisfactory, venerable sir.”\n“Is it proper to regard that which is impermanent, unsatisfactory, and subject to change as ‘This is mine, this I am, this is my self’?”\n“No, venerable sir.”\n“Would such a view arise, clinging to that which is not consciousness: ‘When one acts, causes others to act; cuts, causes others to cut; cooks, causes others to cook; grieves, causes others to grieve; wearies, causes others to weary; trembles, causes others to tremble; takes life, takes what is not given, breaks into houses, plunders wealth, commits highway robbery, goes to another’s wife, speaks falsehood – for one acting thus, no evil is committed. Even if, with a razor-sharp discus, one were to make all beings on this earth into a single mass of flesh, a single pile of flesh, there would be no evil from that cause, no increase of evil. Even if one were to go to the southern bank of the Ganges, killing, causing to kill; cutting, causing to cut; cooking, causing to cook; there would be no evil from that cause, no increase of evil. Even if one were to go to the northern bank of the Ganges, giving, causing to give; sacrificing, causing to sacrifice; there would be no merit from that cause, no increase of merit. Through giving, through self-control, through restraint, through truthful speech, there is no merit, no increase of merit’?”\n“No, venerable sir.”\n\n“And what is seen, heard, sensed, cognized, attained, sought, and pondered by the mind – is that permanent or impermanent?”\n“Impermanent, venerable sir.”\n“Is that which is impermanent satisfactory or unsatisfactory?”\n“Unsatisfactory, venerable sir.”\n“Is it proper to regard that which is impermanent, unsatisfactory, and subject to change as ‘This is mine, this I am, this is my self’?”\n“No, venerable sir.”\n“Would such a view arise, clinging to that which is not what is seen, heard, sensed, cognized, attained, sought, and pondered by the mind: ‘When one acts, causes others to act; cuts, causes others to cut; cooks, causes others to cook; grieves, causes others to grieve; wearies, causes others to weary; trembles, causes others to tremble; takes life, takes what is not given, breaks into houses, plunders wealth, commits highway robbery, goes to another’s wife, speaks falsehood – for one acting thus, no evil is committed. Even if, with a razor-sharp discus, one were to make all beings on this earth into a single mass of flesh, a single pile of flesh, there would be no evil from that cause, no increase of evil. Even if one were to go to the southern bank of the Ganges, killing, causing to kill; cutting, causing to cut; cooking, causing to cook; there would be no evil from that cause, no increase of evil. Even if one were to go to the northern bank of the Ganges, giving, causing to give; sacrificing, causing to sacrifice; there would be no merit from that cause, no increase of merit. Through giving, through self-control, through restraint, through truthful speech, there is no merit, no increase of merit’?”\n“No, venerable sir.”\n\n“Monks, when an noble disciple’s doubt is abandoned regarding these points, when his doubt is abandoned regarding suffering, when his doubt is abandoned regarding the origin of suffering, when his doubt is abandoned regarding the cessation of suffering, and when his doubt is abandoned regarding the path leading to the cessation of suffering – such a noble disciple, monks, is called a stream-entrant, one who is no longer subject to falling into lower states of existence, one who is fixed in destiny, bound for full enlightenment.”",
      "sinhala": "සැවැත් නුවරදී ය.\n\n“මහණෙනි, කුමක් තිබියදී ද, කුමක් උපාදානය කරගෙන ද, කුමක් දැඩිව අල්ලාගෙන ද මෙබඳු දිට්ඨියක් උපදී ද: ‘යමෙක් කරන්නේ නම්, කරවන්නේ නම්, සිඳින්නේ නම්, සිඳුවන්නේ නම්, පසොස්නේ නම්, පසොස්වන්නේ නම්, වෙහෙසන්නේ නම්, වෙහෙසවන්නේ නම්, කම්පා කරන්නේ නම්, කම්පා කරවන්නේ නම්, ප්‍රාණීන් මැරීම, නොදැක්කා දේ ගැනීම, සොරකම් කිරීම, මංකොල්ලකෑම, නිවෙස්වලට පැනීම, මාවත්වල රැක සිටීම, අනුන්ගේ භාර්යාවන් හා සම්බන්ධ වීම, බොරු කීම – මේවා කිරීමෙන් පවක් සිදු නොවේ. රේසර් තලයක් වන් රෝදයකින් මේ පොළොවේ සිටින ප්‍රාණීන් මස් ගොඩක්, රුධිර ගොඩක් කළත් එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ දකුණු ඉවුරට යන්නේ නම්; මරමින්, මරවමින්, සිඳිමින්, සිඳවමින්, පසොසිමින්, පසොස්වමින් සිටින්නේ නම්, එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ උතුරු ඉවුරට යන්නේ නම්; දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටින්නේ නම්, එයින් කිසිදු පිනක් නැත, පිනක පැමිණීමක් නැත. දීමෙන්, හික්මීමෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් නැත, පිනක පැමිණීමක් නැත’ යනුවෙනි.”\n\n“ස්වාමීනි, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කරගත් ඒවාය; භාග්‍යවතුන් වහන්සේ ම ප්‍රධාන කොට ඇත්තාහ; භාග්‍යවතුන් වහන්සේ ම සරණ කොට ඇත්තාහ. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ ම මේ ධර්ම දේශනාව පැහැදිලි කරන්නේ නම් මැනවි. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරාගන්නාහ.”\n\n“මහණෙනි, රූපය තිබියදී, රූපය උපාදානය කරගෙන, රූපය දැඩිව අල්ලාගෙන, මෙබඳු දිට්ඨියක් උපදී: ‘යමෙක් කරන්නේ නම්, කරවන්නේ නම්, සිඳින්නේ නම්, සිඳුවන්නේ නම්, පසොස්නේ නම්, පසොස්වන්නේ නම්, වෙහෙසන්නේ නම්, වෙහෙසවන්නේ නම්, කම්පා කරන්නේ නම්, කම්පා කරවන්නේ නම්, ප්‍රාණීන් මැරීම, නොදැක්කා දේ ගැනීම, සොරකම් කිරීම, මංකොල්ලකෑම, නිවෙස්වලට පැනීම, මාවත්වල රැක සිටීම, අනුන්ගේ භාර්යාවන් හා සම්බන්ධ වීම, බොරු කීම – මේවා කිරීමෙන් පවක් සිදු නොවේ. රේසර් තලයක් වන් රෝදයකින් මේ පොළොවේ සිටින ප්‍රාණීන් මස් ගොඩක්, රුධිර ගොඩක් කළත් එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ දකුණු ඉවුරට යන්නේ නම්; මරමින්, මරවමින්, සිඳිමින්, සිඳවමින්, පසොසිමින්, පසොස්වමින් සිටින්නේ නම්, එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ උතුරු ඉවුරට යන්නේ නම්; දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටින්නේ නම්, එයින් කිසිදු පිනක් නැත, පිනක පැමිණීමක් නැත. දීමෙන්, හික්මීමෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් නැත, පිනක පැමිණීමක් නැත’ යනුවෙනි.”\n\n“වේදනාව තිබියදී, වේදනාව උපාදානය කරගෙන, වේදනාව දැඩිව අල්ලාගෙන ද; සංඥාව තිබියදී, සංඥාව උපාදානය කරගෙන, සංඥාව දැඩිව අල්ලාගෙන ද; සංස්කාර තිබියදී, සංස්කාර උපාදානය කරගෙන, සංස්කාර දැඩිව අල්ලාගෙන ද; විඥානය තිබියදී, විඥානය උපාදානය කරගෙන, විඥානය දැඩිව අල්ලාගෙන ද මෙබඳු දිට්ඨියක් උපදී: ‘යමෙක් කරන්නේ නම්, කරවන්නේ නම්, සිඳින්නේ නම්, සිඳුවන්නේ නම්, පසොස්නේ නම්, පසොස්වන්නේ නම්, වෙහෙසන්නේ නම්, වෙහෙසවන්නේ නම්, කම්පා කරන්නේ නම්, කම්පා කරවන්නේ නම්, ප්‍රාණීන් මැරීම, නොදැක්කා දේ ගැනීම, සොරකම් කිරීම, මංකොල්ලකෑම, නිවෙස්වලට පැනීම, මාවත්වල රැක සිටීම, අනුන්ගේ භාර්යාවන් හා සම්බන්ධ වීම, බොරු කීම – මේවා කිරීමෙන් පවක් සිදු නොවේ. රේසර් තලයක් වන් රෝදයකින් මේ පොළොවේ සිටින ප්‍රාණීන් මස් ගොඩක්, රුධිර ගොඩක් කළත් එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ දකුණු ඉවුරට යන්නේ නම්; මරමින්, මරවමින්, සිඳිමින්, සිඳවමින්, පසොසිමින්, පසොස්වමින් සිටින්නේ නම්, එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ උතුරු ඉවුරට යන්නේ නම්; දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටින්නේ නම්, එයින් කිසිදු පිනක් නැත, පිනක පැමිණීමක් නැත. දීමෙන්, හික්මීමෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් නැත, පිනක පැමිණීමක් නැත’ යනුවෙනි.”\n\n“මහණෙනි, කුමක් සිතන්නාහු ද, රූපය නිත්‍ය ද අනිත්‍ය ද?”\n“අනිත්‍යය, ස්වාමීනි.”\n“එසේ නම්, එය දුක් ද, සැප ද?”\n“දුක් ය, ස්වාමීනි.”\n“එසේ නම්, අනිත්‍ය වූ, දුක් වූ, විපරිනාම වන ස්වභාවය ඇති දෙය ‘මෙය මාගේ ය, මෙය මම ය, මෙය මාගේ ආත්මය ය’ කියා දැකීම සුදුසු ද?”\n“නැත, ස්වාමීනි.”\n“එසේ නම්, එය උපාදානය නොකර සිටින කල්හි, ‘යමෙක් කරන්නේ නම්, කරවන්නේ නම්, සිඳින්නේ නම්, සිඳුවන්නේ නම්, පසොස්නේ නම්, පසොස්වන්නේ නම්, වෙහෙසන්නේ නම්, වෙහෙසවන්නේ නම්, කම්පා කරන්නේ නම්, කම්පා කරවන්නේ නම්, ප්‍රාණීන් මැරීම, නොදැක්කා දේ ගැනීම, සොරකම් කිරීම, මංකොල්ලකෑම, නිවෙස්වලට පැනීම, මාවත්වල රැක සිටීම, අනුන්ගේ භාර්යාවන් හා සම්බන්ධ වීම, බොරු කීම – මේවා කිරීමෙන් පවක් සිදු නොවේ. රේසර් තලයක් වන් රෝදයකින් මේ පොළොවේ සිටින ප්‍රාණීන් මස් ගොඩක්, රුධිර ගොඩක් කළත් එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ දකුණු ඉවුරට යන්නේ නම්; මරමින්, මරවමින්, සිඳිමින්, සිඳවමින්, පසොසිමින්, පසොස්වමින් සිටින්නේ නම්, එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ උතුරු ඉවුරට යන්නේ නම්; දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටින්නේ නම්, එයින් කිසිදු පිනක් නැත, පිනක පැමිණීමක් නැත. දීමෙන්, හික්මීමෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් නැත, පිනක පැමිණීමක් නැත’ යනුවෙන් මෙබඳු දිට්ඨියක් උපදී ද?”\n“නැත, ස්වාමීනි.”\n\n“වේදනාව නිත්‍ය ද අනිත්‍ය ද? සංඥාව නිත්‍ය ද අනිත්‍ය ද? සංස්කාර නිත්‍ය ද අනිත්‍ය ද? විඥානය නිත්‍ය ද අනිත්‍ය ද?”\n“අනිත්‍යය, ස්වාමීනි.”\n“එසේ නම්, එය දුක් ද, සැප ද?”\n“දුක් ය, ස්වාමීනි.”\n“එසේ නම්, අනිත්‍ය වූ, දුක් වූ, විපරිනාම වන ස්වභාවය ඇති දෙය ‘මෙය මාගේ ය, මෙය මම ය, මෙය මාගේ ආත්මය ය’ කියා දැකීම සුදුසු ද?”\n“නැත, ස්වාමීනි.”\n“එසේ නම්, වේදනාව, සංඥාව, සංස්කාර, විඥානය උපාදානය නොකර සිටින කල්හි, ‘යමෙක් කරන්නේ නම්, කරවන්නේ නම්, සිඳින්නේ නම්, සිඳුවන්නේ නම්, පසොස්නේ නම්, පසොස්වන්නේ නම්, වෙහෙසන්නේ නම්, වෙහෙසවන්නේ නම්, කම්පා කරන්නේ නම්, කම්පා කරවන්නේ නම්, ප්‍රාණීන් මැරීම, නොදැක්කා දේ ගැනීම, සොරකම් කිරීම, මංකොල්ලකෑම, නිවෙස්වලට පැනීම, මාවත්වල රැක සිටීම, අනුන්ගේ භාර්යාවන් හා සම්බන්ධ වීම, බොරු කීම – මේවා කිරීමෙන් පවක් සිදු නොවේ. රේසර් තලයක් වන් රෝදයකින් මේ පොළොවේ සිටින ප්‍රාණීන් මස් ගොඩක්, රුධිර ගොඩක් කළත් එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ දකුණු ඉවුරට යන්නේ නම්; මරමින්, මරවමින්, සිඳිමින්, සිඳවමින්, පසොසිමින්, පසොස්වමින් සිටින්නේ නම්, එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ උතුරු ඉවුරට යන්නේ නම්; දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටින්නේ නම්, එයින් කිසිදු පිනක් නැත, පිනක පැමිණීමක් නැත. දීමෙන්, හික්මීමෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් නැත, පිනක පැමිණීමක් නැත’ යනුවෙන් මෙබඳු දිට්ඨියක් උපදී ද?”\n“නැත, ස්වාමීනි.”\n\n“යම්කිසි දැකීමක්, ඇසීමක්, දැනීමක්, දැනගැනීමක්, ලැබීමක්, සොයාගැනීමක්, සිතින් විමර්ශනය කිරීමක් ඇද්ද, ඒවා ද නිත්‍ය ද අනිත්‍ය ද?”\n“අනිත්‍යය, ස්වාමීනි.”\n“එසේ නම්, එය දුක් ද, සැප ද?”\n“දුක් ය, ස්වාමීනි.”\n“එසේ නම්, අනිත්‍ය වූ, දුක් වූ, විපරිනාම වන ස්වභාවය ඇති දෙය ‘මෙය මාගේ ය, මෙය මම ය, මෙය මාගේ ආත්මය ය’ කියා දැකීම සුදුසු ද?”\n“නැත, ස්වාමීනි.”\n“එසේ නම්, ඒවා උපාදානය නොකර සිටින කල්හි, ‘යමෙක් කරන්නේ නම්, කරවන්නේ නම්, සිඳින්නේ නම්, සිඳුවන්නේ නම්, පසොස්නේ නම්, පසොස්වන්නේ නම්, වෙහෙසන්නේ නම්, වෙහෙසවන්නේ නම්, කම්පා කරන්නේ නම්, කම්පා කරවන්නේ නම්, ප්‍රාණීන් මැරීම, නොදැක්කා දේ ගැනීම, සොරකම් කිරීම, මංකොල්ලකෑම, නිවෙස්වලට පැනීම, මාවත්වල රැක සිටීම, අනුන්ගේ භාර්යාවන් හා සම්බන්ධ වීම, බොරු කීම – මේවා කිරීමෙන් පවක් සිදු නොවේ. රේසර් තලයක් වන් රෝදයකින් මේ පොළොවේ සිටින ප්‍රාණීන් මස් ගොඩක්, රුධිර ගොඩක් කළත් එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ දකුණු ඉවුරට යන්නේ නම්; මරමින්, මරවමින්, සිඳිමින්, සිඳවමින්, පසොසිමින්, පසොස්වමින් සිටින්නේ නම්, එයින් කිසිදු පවක් නැත, පවක පැමිණීමක් නැත. යමෙක් ගංගා නදියේ උතුරු ඉවුරට යන්නේ නම්; දෙමින්, දෙවමින්, යැදුම් කරමින්, යැදුම් කරවමින් සිටින්නේ නම්, එයින් කිසිදු පිනක් නැත, පිනක පැමිණීමක් නැත. දීමෙන්, හික්මීමෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් නැත, පිනක පැමිණීමක් නැත’ යනුවෙන් මෙබඳු දිට්ඨියක් උපදී ද?”\n“නැත, ස්වාමීනි.”\n\n“මහණෙනි, යම් හෙයකින් ආර්ය_ශ්‍රාවකයාට මේ කාරණා පිළිබඳ සැකය දුරු වී ද, දුක පිළිබඳව ද සැකය දුරු වී ද, දුක හටගැනීම පිළිබඳව ද සැකය දුරු වී ද, දුක නැති කිරීම පිළිබඳව ද සැකය දුරු වී ද, දුක නැති කරන ප්‍රතිපදාව පිළිබඳව ද සැකය දුරු වී ද – මහණෙනි, මේ ආර්ය_ශ්‍රාවකයා සෝවාන් වූවෙක් යැයි කියනු ලැබේ. ඔහු අපායට නොවැටෙන ස්වභාවය ඇත්තෙකි, නියත වශයෙන්ම සම්බෝධියට පැමිණෙන්නේය.”",
      "paliTitle": "Karotosuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 212,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘natthi hetu, natthi paccayo sattānaṃ saṃkilesāya. Ahetū appaccayā sattā saṃkilissanti. Natthi hetu, natthi paccayo sattānaṃ visuddhiyā. Ahetū appaccayā sattā visujjhanti. Natthi balaṃ natthi vīriyaṃ natthi purisathāmo natthi purisaparakkamo. Sabbe sattā sabbe pāṇā sabbe bhūtā sabbe jīvā avasā abalā avīriyā niyatisaṅgatibhāvapariṇatā chasvevābhijātīsu sukhadukkhaṃ paṭisaṃvedentī’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘natthi hetu, natthi paccayo…pe… sukhadukkhaṃ paṭisaṃvedentī’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘natthi hetu, natthi paccayo…pe… sukhadukkhaṃ paṭisaṃvedentī’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘natthi hetu, natthi paccayo… pe… sukhadukkhaṃ paṭisaṃvedentī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘natthi hetu, natthi paccayo…pe… sukhadukkhaṃ paṭisaṃvedentī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘natthi hetu natthi paccayo…pe… sukhadukkhaṃ paṭisaṃvedentī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti …pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Sattamaṃ.",
      "english": "At Savatthi.\n\n“Monks, when what exists, with what as a basis, clinging to what, does such a view arise: ‘There is no cause, no condition for the defilement of beings. Beings are defiled without cause or condition. There is no cause, no condition for the purification of beings. Beings are purified without cause or condition. There is no strength, no energy, no human might, no human exertion. All beings, all living creatures, all existing things, all individual souls are powerless, without strength, without energy, predetermined by fate, circumstance, and nature, experiencing pleasure and pain in the six classes of existence’?”\n\n“Venerable Sir, our teachings are rooted in the Blessed One, guided by the Blessed One, and have the Blessed One as their refuge. It would be excellent if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the monastics will remember it.”\n\n“Monks, when form exists, with form as a basis, clinging to form, such a view arises: ‘There is no cause, no condition for the defilement of beings. Beings are defiled without cause or condition. There is no cause, no condition for the purification of beings. Beings are purified without cause or condition. There is no strength, no energy, no human might, no human exertion. All beings, all living creatures, all existing things, all individual souls are powerless, without strength, without energy, predetermined by fate, circumstance, and nature, experiencing pleasure and pain in the six classes of existence.’ When feeling exists, with feeling as a basis, clinging to feeling, such a view arises. When perception exists, with perception as a basis, clinging to perception, such a view arises. When volitional formations exist, with volitional formations as a basis, clinging to volitional formations, such a view arises. When consciousness exists, with consciousness as a basis, clinging to consciousness, such a view arises: ‘There is no cause, no condition for the defilement of beings. Beings are defiled without cause or condition. There is no cause, no condition for the purification of beings. Beings are purified without cause or condition. There is no strength, no energy, no human might, no human exertion. All beings, all living creatures, all existing things, all individual souls are powerless, without strength, without energy, predetermined by fate, circumstance, and nature, experiencing pleasure and pain in the six classes of existence.’”\n\n“What do you think, Monks, is form permanent or impermanent?”\n\n“Impermanent, venerable sir. And what is impermanent is suffering. And what is impermanent, suffering, and subject to change—would such a view arise, ‘There is no cause, no condition for the defilement of beings… experiencing pleasure and pain in the six classes of existence,’ without clinging to that?”\n\n“No, venerable sir.”\n\n“Are feeling… perception… volitional formations… consciousness permanent or impermanent?”\n\n“Impermanent, venerable sir. And what is impermanent is suffering. And what is impermanent, suffering, and subject to change—would such a view arise, ‘There is no cause, no condition for the defilement of beings… experiencing pleasure and pain in the six classes of existence,’ without clinging to that?”\n\n“No, venerable sir.”\n\n“And what is seen, heard, sensed, cognized, attained, sought after, and pondered by the mind—is that too permanent or impermanent?”\n\n“Impermanent, venerable sir. And what is impermanent is suffering. And what is impermanent, suffering, and subject to change—would such a view arise, ‘There is no cause, no condition for the defilement of beings… experiencing pleasure and pain in the six classes of existence,’ without clinging to that?”\n\n“No, venerable sir.”\n\n“Monks, when an Noble Disciple’s doubt regarding these points is abandoned, and his doubt regarding suffering is abandoned, his doubt regarding the origin of suffering is abandoned, his doubt regarding the cessation of suffering is abandoned, and his doubt regarding the path leading to the cessation of suffering is abandoned, then, Monks, that Noble Disciple is called a stream-enterer, one not subject to falling into lower realms, firmly destined for full enlightenment.”",
      "sinhala": "සැවැත් නුවරදීය.\n‘‘මහණෙනි, කුමක් පවතින කල්හි, කුමක් ගෙන, කුමක් ඇලීගන්නා කල්හි ‘සත්වයන්ගේ කෙලෙසීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව කෙලෙසෙති. සත්වයන්ගේ පිරිසිදු වීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව පිරිසිදු වෙති. බලයක් නැත, වීර්යයක් නැත, පුරුෂ තෙදක් නැත, පුරුෂ පරාක්‍රමයක් නැත. සියලු සත්ත්වයෝ, සියලු ප්‍රාණීහු, සියලු භූතයෝ, සියලු ජීවීහු අසරණයෝය, දුබලයෝය, වීර්ය රහිතයෝය. ඔවුහු නියතිය, සංගතිය, ස්වභාවය අනුව පරිනත වූවෝ, ඡස් අභිජාතීන් තුළ සැප දුක් විඳිති’ යන මෙබඳු දෘෂ්ටියක් හටගනීද?’’\n\n‘‘වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. වහන්ස, ඒ භාග්‍යවතුන් වහන්සේටම මේ ප්‍රකාශයේ අර්ථය ප්‍රකාශ කිරීමට යෝග්‍ය වේවා. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරන්නාහ.’’\n\n‘‘මහණෙනි, රූපය පවතින කල්හි, රූපය ගෙන, රූපය ඇලීගන්නා කල්හි ‘සත්වයන්ගේ කෙලෙසීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව කෙලෙසෙති. සත්වයන්ගේ පිරිසිදු වීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව පිරිසිදු වෙති. බලයක් නැත, වීර්යයක් නැත, පුරුෂ තෙදක් නැත, පුරුෂ පරාක්‍රමයක් නැත. සියලු සත්ත්වයෝ, සියලු ප්‍රාණීහු, සියලු භූතයෝ, සියලු ජීවීහු අසරණයෝය, දුබලයෝය, වීර්ය රහිතයෝය. ඔවුහු නියතිය, සංගතිය, ස්වභාවය අනුව පරිනත වූවෝ, ඡස් අභිජාතීන් තුළ සැප දුක් විඳිති’ යන මෙබඳු දෘෂ්ටියක් හටගනී. වේදනාව පවතින කල්හි, වේදනාව ගෙන, වේදනාව ඇලීගන්නා කල්හි එවැනිම දෘෂ්ටියක් හටගනී. සංඥාව පවතින කල්හි, සංඥාව ගෙන, සංඥාව ඇලීගන්නා කල්හි එවැනිම දෘෂ්ටියක් හටගනී. සංස්කාර පවතින කල්හි, සංස්කාර ගෙන, සංස්කාර ඇලීගන්නා කල්හි එවැනිම දෘෂ්ටියක් හටගනී. විඥානය පවතින කල්හි, විඥානය ගෙන, විඥානය ඇලීගන්නා කල්හි ‘සත්වයන්ගේ කෙලෙසීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව කෙලෙසෙති. සත්වයන්ගේ පිරිසිදු වීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව පිරිසිදු වෙති. බලයක් නැත, වීර්යයක් නැත, පුරුෂ තෙදක් නැත, පුරුෂ පරාක්‍රමයක් නැත. සියලු සත්ත්වයෝ, සියලු ප්‍රාණීහු, සියලු භූතයෝ, සියලු ජීවීහු අසරණයෝය, දුබලයෝය, වීර්ය රහිතයෝය. ඔවුහු නියතිය, සංගතිය, ස්වභාවය අනුව පරිනත වූවෝ, ඡස් අභිජාතීන් තුළ සැප දුක් විඳිති’ යන මෙබඳු දෘෂ්ටියක් හටගනී.’’\n\n‘‘මහණෙනි, එයට කුමක් සිතන්නාහුද? රූපය නිත්‍යද, අනිත්‍යද?’’\n‘‘අනිත්‍යය, වහන්ස. එය විපරිණාම වන ස්වභාවය ඇත්තකි. එසේ නම්, එය නොගෙන (නොඇලීගෙන) ‘සත්වයන්ගේ කෙලෙසීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව කෙලෙසෙති. සත්වයන්ගේ පිරිසිදු වීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව පිරිසිදු වෙති. බලයක් නැත, වීර්යයක් නැත, පුරුෂ තෙදක් නැත, පුරුෂ පරාක්‍රමයක් නැත. සියලු සත්ත්වයෝ, සියලු ප්‍රාණීහු, සියලු භූතයෝ, සියලු ජීවීහු අසරණයෝය, දුබලයෝය, වීර්ය රහිතයෝය. ඔවුහු නියතිය, සංගතිය, ස්වභාවය අනුව පරිනත වූවෝ, ඡස් අභිජාතීන් තුළ සැප දුක් විඳිති’ යන මෙබඳු දෘෂ්ටියක් හටගනීද?’’\n‘‘නැත, වහන්ස.’’\n‘‘වේදනාව නිත්‍යද, අනිත්‍යද? සංඥාව නිත්‍යද, අනිත්‍යද? සංස්කාර නිත්‍යද, අනිත්‍යද? විඥානය නිත්‍යද, අනිත්‍යද?’’\n‘‘අනිත්‍යය, වහන්ස. ඒවා විපරිණාම වන ස්වභාවය ඇත්තකි. එසේ නම්, ඒවා නොගෙන ‘සත්වයන්ගේ කෙලෙසීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව කෙලෙසෙති. සත්වයන්ගේ පිරිසිදු වීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව පිරිසිදු වෙති. බලයක් නැත, වීර්යයක් නැත, පුරුෂ තෙදක් නැත, පුරුෂ පරාක්‍රමයක් නැත. සියලු සත්ත්වයෝ, සියලු ප්‍රාණීහු, සියලු භූතයෝ, සියලු ජීවීහු අසරණයෝය, දුබලයෝය, වීර්ය රහිතයෝය. ඔවුහු නියතිය, සංගතිය, ස්වභාවය අනුව පරිනත වූවෝ, ඡස් අභිජාතීන් තුළ සැප දුක් විඳිති’ යන මෙබඳු දෘෂ්ටියක් හටගනීද?’’\n‘‘නැත, වහන්ස.’’\n‘‘මනසින් දක්නා ලද, අසන ලද, අත්විඳින ලද, විඥානයට හසු වූ, පැමිණි, සොයාගත්, අනුව විමසන ලද යමක් ඇත්ද, එයද නිත්‍යද, අනිත්‍යද?’’\n‘‘අනිත්‍යය, වහන්ස. එය විපරිණාම වන ස්වභාවය ඇත්තකි. එසේ නම්, එය නොගෙන ‘සත්වයන්ගේ කෙලෙසීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව කෙලෙසෙති. සත්වයන්ගේ පිරිසිදු වීමට හේතුවක් නැත, ප්‍රත්‍යයක් නැත. සත්ත්වයෝ හේතු රහිතව, ප්‍රත්‍ය රහිතව පිරිසිදු වෙති. බලයක් නැත, වීර්යයක් නැත, පුරුෂ තෙදක් නැත, පුරුෂ පරාක්‍රමයක් නැත. සියලු සත්ත්වයෝ, සියලු ප්‍රාණීහු, සියලු භූතයෝ, සියලු ජීවීහු අසරණයෝය, දුබලයෝය, වීර්ය රහිතයෝය. ඔවුහු නියතිය, සංගතිය, ස්වභාවය අනුව පරිනත වූවෝ, ඡස් අභිජාතීන් තුළ සැප දුක් විඳිති’ යන මෙබඳු දෘෂ්ටියක් හටගනීද?’’\n‘‘නැත, වහන්ස.’’\n\n‘‘මහණෙනි, යම් හෙයකින් ආර්ය ශ්‍රාවකයා හට මේ කරුණු පිළිබඳ සැකය ප්‍රහීණ වේද, දුක පිළිබඳ ඔහුගේ සැකය ප්‍රහීණ වේද, දුකෙහි හටගැනීම පිළිබඳ ඔහුගේ සැකය ප්‍රහීණ වේද, දුක නැති කිරීම පිළිබඳ ඔහුගේ සැකය ප්‍රහීණ වේද, දුක නැති කිරීමේ මාර්ගය පිළිබඳ ඔහුගේ සැකය ප්‍රහීණ වේද, මහණෙනි, මෙබඳු ආර්ය ශ්‍රාවකයා සෝවාන් වූයේ යැයි, අපායගාමී නොවන්නා වූ ස්වභාවය ඇත්තේ යැයි, නියත වශයෙන්ම සම්බෝධියට පැමිණෙන්නේ යැයි කියනු ලැබේ.’’",
      "paliTitle": "Hetusuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 213,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘sattime kāyā akaṭā, akaṭavidhā, animmitā, animmātā, vañjhā, kūṭaṭṭhā, esikaṭṭhāyiṭṭhitā; te na iñjanti, na vipariṇamanti [na vipariṇāmenti (pī. ka.)], na aññamaññaṃ byābādhenti; nālaṃ aññamaññassa sukhāya vā dukkhāya vā sukhadukkhāya vā. Katame satta? Pathavīkāyo, āpokāyo, tejokāyo, vāyokāyo, sukhe, dukkhe, jīve sattame. Ime satta [jīve. sattime (bahūsu)] kāyā akaṭā, akaṭavidhā, animmitā, animmātā, vañjhā, kūṭaṭṭhā esikaṭṭhāyiṭṭhitā; te na iñjanti, na vipariṇamanti, na aññamaññaṃ byābādhenti; nālaṃ aññamaññassa sukhāya vā dukkhāya vā sukhadukkhāya vā. Yopi tiṇhena satthena sīsaṃ chindati, na sopi kañci [na koci kañci (sī. syā. kaṃ.), na koci taṃ (pī. ka.)] jīvitā voropeti; sattannaṃtveva kāyānamantarena satthaṃ vivaramanupavisati [vivaramanupatati (katthaci) dīghamajjhimesupi]. Cuddasa kho panimāni yonipamukhasatasahassāni saṭṭhi ca satāni cha ca satāni pañca ca kammuno satāni pañca ca kammāni, tīṇi ca kammāni, kamme ca aḍḍhakamme ca dvaṭṭhipaṭipadā, dvaṭṭhantarakappā, chaḷābhijātiyo, aṭṭhapurisabhūmiyo, ekūnapaññāsa ājīvakasate, ekūnapaññāsa paribbājakasate, ekūnapaññāsa nāgavāsasate, vīse indriyasate, tiṃse nirayasate, chattiṃsarajodhātuyo, satta saññīgabbhā, satta asaññīgabbhā, satta nigaṇṭhigabbhā, satta devā, satta mānusā, satta pesācā, satta sarā, satta pavuṭā [sapuṭā (ka.), pavudhā (pī.)], satta papātā, satta ca papātasatāni, satta supinā, satta supinasatāni, cullāsīti mahākappino [mahākappuno (sī. pī.)] satasahassāni, yāni bāle ca paṇḍite ca sandhāvitvā saṃsaritvā dukkhassantaṃ karissanti. Tattha natthi imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā aparipakkaṃ vā kammaṃ paripācessāmi; paripakkaṃ vā kammaṃ phussa phussa byantīkarissāmīti hevaṃ natthi doṇamite sukhadukkhe pariyantakate saṃsāre, natthi hāyanavaḍḍhane, natthi ukkaṃsāvakaṃse. Seyyathāpi nāma suttaguḷe khitte nibbeṭhiyamānameva paleti; evameva bāle ca paṇḍite ca nibbeṭhiyamānā sukhadukkhaṃ palentī’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘sattime kāyā akaṭā, akaṭavidhā…pe… sukhadukkhaṃ palentī’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘sattime kāyā akaṭā, akaṭavidhā…pe… sukhadukkhaṃ palentī’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’… pe… ‘‘yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘sattime kāyā akaṭā akaṭavidhā…pe… sukhadukkhaṃ palentī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘sattime kāyā akaṭā akaṭavidhā…pe… nibbeṭhiyamānā sukhadukkhaṃ palentī’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti…pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Aṭṭhamaṃ.",
      "english": "At Sāvatthī. “Monks, when what exists, what is clung to, what is fixated upon, does such a view arise: ‘These seven bodies are uncreated, not made, not fashioned, not formed, barren, standing firm like a mountain peak, established like a pillar; they do not move, do not change, do not harm each other; they are incapable of causing happiness, suffering, or both happiness and suffering to each other.’ Which seven? The body of earth, the body of water, the body of fire, the body of air, happiness, suffering, and the living principle as the seventh. These seven bodies are uncreated, not made, not fashioned, not formed, barren, standing firm like a mountain peak, established like a pillar; they do not move, do not change, do not harm each other; they are incapable of causing happiness, suffering, or both happiness and suffering to each other. Even if one cuts off a head with a sharp sword, one does not deprive anyone of life; the sword merely passes through the gap between the seven bodies.\n\n“Furthermore, there are these fourteen hundred thousand principal wombs, sixty hundreds, six hundreds, five hundreds of actions, five actions, three actions, action and half-action, sixty-two paths, sixty-two intermediate aeons, six classes of existence, eight stages of human existence, forty-nine hundred Ājīvaka abodes, forty-nine hundred wandering ascetic abodes, forty-nine hundred Nāga abodes, twenty hundred sense faculties, thirty hundred hells, thirty-six dust-elements, seven wombs of conscious beings, seven wombs of unconscious beings, seven wombs of Nigaṇṭha beings, seven gods, seven humans, seven hungry ghosts, seven lakes, seven pavuṭā, seven abysses, seven hundred abysses, seven dreams, seven hundred dreams, eighty-four hundred thousand great aeons, through which both fools and wise will transmigrate and wander, and thereby make an end of suffering. In that [system], there is no thought: ‘Through this virtue, or observance, or austerity, or holy life, I shall bring to maturity karma that is not yet mature, or I shall wear out by repeated contact karma that is already mature.’ There is no such thing. With regard to measured happiness and suffering, and a finite cycle of transmigration, there is no decrease or increase, no uplift or downfall. Just as a ball of string, when thrown, unwinds itself as it goes; just so, both fools and wise, unwinding, move towards the end of suffering.”\n\n“Our teachings, venerable sir, have the Fortunate One as their root, their guide, their refuge. It would be good if the Fortunate One would explain the meaning of this. Having heard it from the Fortunate One, the monks will remember it.”\n\n“Monks, when form exists, clinging to form, fixating upon form, such a view arises: ‘These seven bodies are uncreated, not made, not fashioned, not formed, barren, standing firm like a mountain peak, established like a pillar; they do not move, do not change, do not harm each other; they are incapable of causing happiness, suffering, or both happiness and suffering to each other. Even if one cuts off a head with a sharp sword, one does not deprive anyone of life; the sword merely passes through the gap between the seven bodies. Furthermore, there are these fourteen hundred thousand principal wombs... just so, both fools and wise, unwinding, move towards the end of suffering.’ When feeling exists, clinging to feeling, fixating upon feeling, such a view arises... When perception exists, clinging to perception, fixating upon perception, such a view arises... When volitional formations exist, clinging to volitional formations, fixating upon volitional formations, such a view arises... When consciousness exists, clinging to consciousness, fixating upon consciousness, such a view arises: ‘These seven bodies are uncreated, not made... just so, both fools and wise, unwinding, move towards the end of suffering.’”\n\n“What do you think, monks, is form permanent or impermanent?” “Impermanent, venerable sir.” “And is that which is impermanent suffering or happiness?” “Suffering, venerable sir.” “And is that which is impermanent, suffering, and subject to change, fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, venerable sir.” “But, that which is impermanent, suffering, and subject to change, could such a view arise without clinging to it: ‘These seven bodies are uncreated, not made... just so, both fools and wise, unwinding, move towards the end of suffering’?” “No, venerable sir.”\n\n“And that which is seen, heard, sensed, cognized, attained, sought, and pondered by the mind—is that permanent or impermanent?” “Impermanent, venerable sir.” “And is that which is impermanent suffering or happiness?” “Suffering, venerable sir.” “And is that which is impermanent, suffering, and subject to change, fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, venerable sir.” “Could such a view arise without clinging to it: ‘These seven bodies are uncreated, not made... just so, both fools and wise, unwinding, move towards the end of suffering’?” “No, venerable sir.”\n\n“Monks, when an excellent disciple’s doubt regarding these matters is abandoned, their doubt regarding suffering is abandoned, their doubt regarding the origin of suffering is abandoned, their doubt regarding the cessation of suffering is abandoned, their doubt regarding the path leading to the cessation of suffering is abandoned, their doubt regarding the Buddha is abandoned, their doubt regarding the Dhamma is abandoned, their doubt regarding the Saṅgha is abandoned, their doubt regarding the past is abandoned, their doubt regarding the future is abandoned, their doubt regarding both past and future is abandoned, and their doubt regarding dependent origination is abandoned—such an excellent disciple, monks, is called a stream-enterer, one no longer subject to downfall, assured, with enlightenment as their destination.”",
      "sinhala": "මහණෙනි, කුමක් තිබියදීද, කුමක් උපාදාන කොටගෙනද, කුමක් දැඩිව අල්ලාගෙනද, මෙබඳු දෘෂ්ටියක් හටගන්නේද: 'මේ කයෝ සත්දෙනෙක් සිටිති. ඔවුහු නොකළ ඒවාය, නොකරන ලද ස්වභාව ඇත්තාහ, අනිර්මිතය, නිර්මාණය නොවූ ඒවාය, වඳය, කූටස්ථානගතය, මහපොළොවෙහි ඇණයක් මෙන් ස්ථිරය; ඔවුහු නොසෙල්වෙන්නාහ, වෙනස් නොවන්නාහ, එකිනෙකාට හානි නොකරන්නාහ, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැපදුක් පිණිස හෝ නොවන්නාහ. කවරහුද ඒ සත්දෙනා? පඨවි කය, ආපෝ කය, තේජෝ කය, වායෝ කය, සැප, දුක, හත්වැනිව ජීවය යන මේවායි. මේ කයෝ සත්දෙනා නොකළ ඒවාය, නොකරන ලද ස්වභාව ඇත්තාහ, අනිර්මිතය, නිර්මාණය නොවූ ඒවාය, වඳය, කූටස්ථානගතය, මහපොළොවෙහි ඇණයක් මෙන් ස්ථිරය; ඔවුහු නොසෙල්වෙන්නාහ, වෙනස් නොවන්නාහ, එකිනෙකාට හානි නොකරන්නාහ, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැපදුක් පිණිස හෝ නොවන්නාහ. යමෙක් තියුණු ආයුධයකින් හිස සිඳින්නේද, හෙතෙම කිසිවෙකුගේ ජීවිතය නැති නොකරයි. ආයුධය මේ සත්වර කයවල් අතර විවරයකට ඇතුළු වන්නේය. තවද, යෝනි ප්‍රමුඛ ලක්ෂය සතර දහසක්ද, සැට සියයක්ද, හය සියයක්ද, කර්ම පන්සියයක්ද, කර්ම පහක්ද, කර්ම තුනක්ද, කර්මය හා අර්ධ කර්මය යන දෙකද, හැටදෙකක් වූ ප්‍රතිපදාද, හැටදෙකක් වූ අන්තර කල්පද, සය ආකාර වූ අභිජාතිද, අටක් වූ පුරිසභූමිද, සතළිස් නවයක් වූ ආජීවක ශතකෝටිද, සතළිස් නවයක් වූ පරිබ්‍රාජක ශතකෝටිද, සතළිස් නවයක් වූ නාගවාස ශතකෝටිද, විස්සක් වූ ඉන්ද්‍රිය ශතකෝටිද, තිහක් වූ නිරය ශතකෝටිද, තිස් හයක් වූ රජස් ධාතුද, සතක් වූ සඥ්ඤී ගර්භයෝද, සතක් වූ අසඥ්ඤී ගර්භයෝද, සතක් වූ නියන්ඨී ගර්භයෝද, සත් දෙවියෝද, සත් මනුෂ්‍යයෝද, සත් ප්‍රේතයෝද, සත් සරයෝද, සත් පවුටයෝද, සත් පපාතයෝද, සත් සියයක් වූ පපාතයෝද, සත් සුපිනයෝද, සත් සියයක් වූ සුපිනයෝද, අසූ සතර ලක්ෂයක් වූ මහා කල්පද මේවාය. මේවා තුළින් මෝඩයෝද පණ්ඩිතයෝද, දිව දිව සසර සැරිසරා දුක අවසන් කරති. එහිදී 'මම මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ නොපැසුණු කර්මයක් පසවන්නෙමි; පැසුණු කර්මයක් ස්පර්ශ කොට ස්පර්ශ කොට නැති කරන්නෙමි' යැයි කියන්නට (පැසීමට හෝ විනාශ කිරීමට) දෙයක් නැත. (මන්ද) දෝණ ප්‍රමාණයෙන් මනින ලද සැප දුක් ඇති, අවසන් කරන ලද සංසාරයෙහි, අඩු වීමක් හෝ වැඩි වීමක් නැත, උසස් වීමක් හෝ පහත් වීමක් නැත. හරියට නූල් ගුළියක් විසි කළ විට එය දිගහැරෙමින්ම පෙරළී යන්නාක් මෙන්, එපරිද්දෙන්ම මෝඩයෝද පණ්ඩිතයෝද දිගහැරෙමින් සැපදුක් විඳිති (දුක අවසන් කරති)' යනුවෙන් (මෙබඳු දෘෂ්ටියක් හටගන්නේද?\"\n\n\"පින්වහන්සේ, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ ප්‍රත්‍යය කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ පිහිටකොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ධර්මයේ අර්ථය අපට පහදා දුනහොත් යහපති. එය අසා භික්ෂූහු සිත්හි ධාරණය කරගන්නාහුය.\" \"මහණෙනි, රූපය තිබියදී, රූපය උපාදාන කොටගෙන, රූපය දැඩිව අල්ලාගෙන, මේ දෘෂ්ටිය හටගනී: 'මේ කයෝ සත්දෙනෙක් නොකළ ඒවාය, නොකරන ලද ස්වභාව ඇත්තාහ, අනිර්මිතය, නිර්මාණය නොවූ ඒවාය, වඳය, කූටස්ථානගතය, මහපොළොවෙහි ඇණයක් මෙන් ස්ථිරය; නොසෙල්වෙන්නාහ, වෙනස් නොවන්නාහ, එකිනෙකාට හානි නොකරන්නාහ, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැපදුක් පිණිස හෝ නොවන්නාහ. යමෙක් තියුණු ආයුධයකින් හිස සිඳින්නේද, හෙතෙම කිසිවෙකුගේ ජීවිතය නැති නොකරයි. ආයුධය මේ සත්වර කයවල් අතර විවරයකට ඇතුළු වන්නේය. තවද, යෝනි ප්‍රමුඛ ලක්ෂය සතර දහසක්ද, සැට සියයක්ද, හය සියයක්ද, කර්ම පන්සියයක්ද, කර්ම පහක්ද, කර්ම තුනක්ද, කර්මය හා අර්ධ කර්මය යන දෙකද, හැටදෙකක් වූ ප්‍රතිපදාද, හැටදෙකක් වූ අන්තර කල්පද, සය ආකාර වූ අභිජාතිද, අටක් වූ පුරිසභූමිද, සතළිස් නවයක් වූ ආජීවක ශතකෝටිද, සතළිස් නවයක් වූ පරිබ්‍රාජක ශතකෝටිද, සතළිස් නවයක් වූ නාගවාස ශතකෝටිද, විස්සක් වූ ඉන්ද්‍රිය ශතකෝටිද, තිහක් වූ නිරය ශතකෝටිද, තිස් හයක් වූ රජස් ධාතුද, සතක් වූ සඥ්ඤී ගර්භයෝද, සතක් වූ අසඥ්ඤී ගර්භයෝද, සතක් වූ නියන්ඨී ගර්භයෝද, සත් දෙවියෝද, සත් මනුෂ්‍යයෝද, සත් ප්‍රේතයෝද, සත් සරයෝද, සත් පවුටයෝද, සත් පපාතයෝද, සත් සියයක් වූ පපාතයෝද, සත් සුපිනයෝද, සත් සියයක් වූ සුපිනයෝද, අසූ සතර ලක්ෂයක් වූ මහා කල්පද මේවාය. මේවා තුළින් මෝඩයෝද පණ්ඩිතයෝද, දිව දිව සසර සැරිසරා දුක අවසන් කරති. එහිදී 'මම මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ නොපැසුණු කර්මයක් පසවන්නෙමි; පැසුණු කර්මයක් ස්පර්ශ කොට ස්පර්ශ කොට නැති කරන්නෙමි' යැයි කියන්නට (පැසීමට හෝ විනාශ කිරීමට) දෙයක් නැත. (මන්ද) දෝණ ප්‍රමාණයෙන් මනින ලද සැප දුක් ඇති, අවසන් කරන ලද සංසාරයෙහි, අඩු වීමක් හෝ වැඩි වීමක් නැත, උසස් වීමක් හෝ පහත් වීමක් නැත. හරියට නූල් ගුළියක් විසි කළ විට එය දිගහැරෙමින්ම පෙරළී යන්නාක් මෙන්, එපරිද්දෙන්ම මෝඩයෝද පණ්ඩිතයෝද දිගහැරෙමින් සැපදුක් විඳිති.' වේදනාව තිබියදී, වේදනාව උපාදාන කොටගෙන, වේදනාව දැඩිව අල්ලාගෙන, මෙබඳු දෘෂ්ටියක් හටගනී: 'මේ කයෝ සත්දෙනෙක් නොකළ ඒවාය, නොකරන ලද ස්වභාව ඇත්තාහ, අනිර්මිතය, නිර්මාණය නොවූ ඒවාය, වඳය, කූටස්ථානගතය, මහපොළොවෙහි ඇණයක් මෙන් ස්ථිරය; නොසෙල්වෙන්නාහ, වෙනස් නොවන්නාහ, එකිනෙකාට හානි නොකරන්නාහ, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැපදුක් පිණිස හෝ නොවන්නාහ. යමෙක් තියුණු ආයුධයකින් හිස සිඳින්නේද, හෙතෙම කිසිවෙකුගේ ජීවිතය නැති නොකරයි. ආයුධය මේ සත්වර කයවල් අතර විවරයකට ඇතුළු වන්නේය. තවද, යෝනි ප්‍රමුඛ ලක්ෂය සතර දහසක්ද, සැට සියයක්ද, හය සියයක්ද, කර්ම පන්සියයක්ද, කර්ම පහක්ද, කර්ම තුනක්ද, කර්මය හා අර්ධ කර්මය යන දෙකද, හැටදෙකක් වූ ප්‍රතිපදාද, හැටදෙකක් වූ අන්තර කල්පද, සය ආකාර වූ අභිජාතිද, අටක් වූ පුරිසභූමිද, සතළිස් නවයක් වූ ආජීවක ශතකෝටිද, සතළිස් නවයක් වූ පරිබ්‍රාජක ශතකෝටිද, සතළිස් නවයක් වූ නාගවාස ශතකෝටිද, විස්සක් වූ ඉන්ද්‍රිය ශතකෝටිද, තිහක් වූ නිරය ශතකෝටිද, තිස් හයක් වූ රජස් ධාතුද, සතක් වූ සඥ්ඤී ගර්භයෝද, සතක් වූ අසඥ්ඤී ගර්භයෝද, සතක් වූ නියන්ඨී ගර්භයෝද, සත් දෙවියෝද, සත් මනුෂ්‍යයෝද, සත් ප්‍රේතයෝද, සත් සරයෝද, සත් පවුටයෝද, සත් පපාතයෝද, සත් සියයක් වූ පපාතයෝද, සත් සුපිනයෝද, සත් සියයක් වූ සුපිනයෝද, අසූ සතර ලක්ෂයක් වූ මහා කල්පද මේවාය. මේවා තුළින් මෝඩයෝද පණ්ඩිතයෝද, දිව දිව සසර සැරිසරා දුක අවසන් කරති. එහිදී 'මම මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ නොපැසුණු කර්මයක් පසවන්නෙමි; පැසුණු කර්මයක් ස්පර්ශ කොට ස්පර්ශ කොට නැති කරන්නෙමි' යැයි කියන්නට (පැසීමට හෝ විනාශ කිරීමට) දෙයක් නැත. (මන්ද) දෝණ ප්‍රමාණයෙන් මනින ලද සැප දුක් ඇති, අවසන් කරන ලද සංසාරයෙහි, අඩු වීමක් හෝ වැඩි වීමක් නැත, උසස් වීමක් හෝ පහත් වීමක් නැත. හරියට නූල් ගුළියක් විසි කළ විට එය දිගහැරෙමින්ම පෙරළී යන්නාක් මෙන්, එපරිද්දෙන්ම මෝඩයෝද පණ්ඩිතයෝද දිගහැරෙමින් සැපදුක් විඳිති.' සංඥාව තිබියදී, සංඥාව උපාදාන කොටගෙන, සංඥාව දැඩිව අල්ලාගෙන, මෙබඳු දෘෂ්ටියක් හටගනී: 'මේ කයෝ සත්දෙනෙක් නොකළ ඒවාය... සැපදුක් විඳිති.' සංස්කාරයන් තිබියදී, සංස්කාරයන් උපාදාන කොටගෙන, සංස්කාරයන් දැඩිව අල්ලාගෙන, මෙබඳු දෘෂ්ටියක් හටගනී: 'මේ කයෝ සත්දෙනෙක් නොකළ ඒවාය... සැපදුක් විඳිති.' විඤ්ඤාණය තිබියදී, විඤ්ඤාණය උපාදාන කොටගෙන, විඤ්ඤාණය දැඩිව අල්ලාගෙන, මෙබඳු දෘෂ්ටියක් හටගනී: 'මේ කයෝ සත්දෙනෙක් නොකළ ඒවාය, නොකරන ලද ස්වභාව ඇත්තාහ, අනිර්මිතය, නිර්මාණය නොවූ ඒවාය, වඳය, කූටස්ථානගතය, මහපොළොවෙහි ඇණයක් මෙන් ස්ථිරය; නොසෙල්වෙන්නාහ, වෙනස් නොවන්නාහ, එකිනෙකාට හානි නොකරන්නාහ, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැපදුක් පිණිස හෝ නොවන්නාහ. යමෙක් තියුණු ආයුධයකින් හිස සිඳින්නේද, හෙතෙම කිසිවෙකුගේ ජීවිතය නැති නොකරයි. ආයුධය මේ සත්වර කයවල් අතර විවරයකට ඇතුළු වන්නේය. තවද, යෝනි ප්‍රමුඛ ලක්ෂය සතර දහසක්ද, සැට සියයක්ද, හය සියයක්ද, කර්ම පන්සියයක්ද, කර්ම පහක්ද, කර්ම තුනක්ද, කර්මය හා අර්ධ කර්මය යන දෙකද, හැටදෙකක් වූ ප්‍රතිපදාද, හැටදෙකක් වූ අන්තර කල්පද, සය ආකාර වූ අභිජාතිද, අටක් වූ පුරිසභූමිද, සතළිස් නවයක් වූ ආජීවක ශතකෝටිද, සතළිස් නවයක් වූ පරිබ්‍රාජක ශතකෝටිද, සතළිස් නවයක් වූ නාගවාස ශතකෝටිද, විස්සක් වූ ඉන්ද්‍රිය ශතකෝටිද, තිහක් වූ නිරය ශතකෝටිද, තිස් හයක් වූ රජස් ධාතුද, සතක් වූ සඥ්ඤී ගර්භයෝද, සතක් වූ අසඥ්ඤී ගර්භයෝද, සතක් වූ නියන්ඨී ගර්භයෝද, සත් දෙවියෝද, සත් මනුෂ්‍යයෝද, සත් ප්‍රේතයෝද, සත් සරයෝද, සත් පවුටයෝද, සත් පපාතයෝද, සත් සියයක් වූ පපාතයෝද, සත් සුපිනයෝද, සත් සියයක් වූ සුපිනයෝද, අසූ සතර ලක්ෂයක් වූ මහා කල්පද මේවාය. මේවා තුළින් මෝඩයෝද පණ්ඩිතයෝද, දිව දිව සසර සැරිසරා දුක අවසන් කරති. එහිදී 'මම මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ නොපැසුණු කර්මයක් පසවන්නෙමි; පැසුණු කර්මයක් ස්පර්ශ කොට ස්පර්ශ කොට නැති කරන්නෙමි' යැයි කියන්නට (පැසීමට හෝ විනාශ කිරීමට) දෙයක් නැත. (මන්ද) දෝණ ප්‍රමාණයෙන් මනින ලද සැප දුක් ඇති, අවසන් කරන ලද සංසාරයෙහි, අඩු වීමක් හෝ වැඩි වීමක් නැත, උසස් වීමක් හෝ පහත් වීමක් නැත. හරියට නූල් ගුළියක් විසි කළ විට එය දිගහැරෙමින්ම පෙරළී යන්නාක් මෙන්, එපරිද්දෙන්ම මෝඩයෝද පණ්ඩිතයෝද දිගහැරෙමින් සැපදුක් විඳිති.'\n\n\"මහණෙනි, ඔබලා මේ කුමක් සිතන්නාහුද? රූපය නිත්‍යද, අනිත්‍යද?\" \"අනිත්‍යය, පින්වහන්සේ.\" \"යමක් අනිත්‍යද, දුක් සහිතද, වෙනස් වන සුළුද, එය අල්ලා නොගෙන මෙබඳු දෘෂ්ටියක් හටගනීද? 'මේ කයෝ සත්දෙනෙක් නොකළ ඒවාය, නොකරන ලද ස්වභාව ඇත්තාහ, අනිර්මිතය, නිර්මාණය නොවූ ඒවාය, වඳය, කූටස්ථානගතය, මහපොළොවෙහි ඇණයක් මෙන් ස්ථිරය; නොසෙල්වෙන්නාහ, වෙනස් නොවන්නාහ, එකිනෙකාට හානි නොකරන්නාහ, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැපදුක් පිණිස හෝ නොවන්නාහ. යමෙක් තියුණු ආයුධයකින් හිස සිඳින්නේද, හෙතෙම කිසිවෙකුගේ ජීවිතය නැති නොකරයි. ආයුධය මේ සත්වර කයවල් අතර විවරයකට ඇතුළු වන්නේය. තවද, යෝනි ප්‍රමුඛ ලක්ෂය සතර දහසක්ද, සැට සියයක්ද, හය සියයක්ද, කර්ම පන්සියයක්ද, කර්ම පහක්ද, කර්ම තුනක්ද, කර්මය හා අර්ධ කර්මය යන දෙකද, හැටදෙකක් වූ ප්‍රතිපදාද, හැටදෙකක් වූ අන්තර කල්පද, සය ආකාර වූ අභිජාතිද, අටක් වූ පුරිසභූමිද, සතළිස් නවයක් වූ ආජීවක ශතකෝටිද, සතළිස් නවයක් වූ පරිබ්‍රාජක ශතකෝටිද, සතළිස් නවයක් වූ නාගවාස ශතකෝටිද, විස්සක් වූ ඉන්ද්‍රිය ශතකෝටිද, තිහක් වූ නිරය ශතකෝටිද, තිස් හයක් වූ රජස් ධාතුද, සතක් වූ සඥ්ඤී ගර්භයෝද, සතක් වූ අසඥ්ඤී ගර්භයෝද, සතක් වූ නියන්ඨී ගර්භයෝද, සත් දෙවියෝද, සත් මනුෂ්‍යයෝද, සත් ප්‍රේතයෝද, සත් සරයෝද, සත් පවුටයෝද, සත් පපාතයෝද, සත් සියයක් වූ පපාතයෝද, සත් සුපිනයෝද, සත් සියයක් වූ සුපිනයෝද, අසූ සතර ලක්ෂයක් වූ මහා කල්පද මේවාය. මේවා තුළින් මෝඩයෝද පණ්ඩිතයෝද, දිව දිව සසර සැරිසරා දුක අවසන් කරති. එහිදී 'මම මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ නොපැසුණු කර්මයක් පසවන්නෙමි; පැසුණු කර්මයක් ස්පර්ශ කොට ස්පර්ශ කොට නැති කරන්නෙමි' යැයි කියන්නට (පැසීමට හෝ විනාශ කිරීමට) දෙයක් නැත. (මන්ද) දෝණ ප්‍රමාණයෙන් මනින ලද සැප දුක් ඇති, අවසන් කරන ලද සංසාරයෙහි, අඩු වීමක් හෝ වැඩි වීමක් නැත, උසස් වීමක් හෝ පහත් වීමක් නැත. හරියට නූල් ගුළියක් විසි කළ විට එය දිගහැරෙමින්ම පෙරළී යන්නාක් මෙන්, එපරිද්දෙන්ම මෝඩයෝද පණ්ඩිතයෝද දිගහැරෙමින් සැපදුක් විඳිති.'\" \"නැත, පින්වහන්සේ.\"\n\n\"යමක් මේ ඇසින් දැක්කේද, කනින් ඇසූයේද, නාසයෙන් ආඝ්‍රාණය කළේද, දිවෙන් රස වින්දේද, කයින් ස්පර්ශ කළේද, මනසින් දැනගත්තේද, සෙව්වේද, විචාරා බැලුවේද, එයද නිත්‍යද, අනිත්‍යද?\" \"අනිත්‍යය, පින්වහන්සේ. එසේ නම්, එය අල්ලා නොගෙන මෙබඳු දෘෂ්ටියක් හටගනීද? 'මේ කයෝ සත්දෙනෙක් නොකළ ඒවාය, නොකරන ලද ස්වභාව ඇත්තාහ, අනිර්මිතය, නිර්මාණය නොවූ ඒවාය, වඳය, කූටස්ථානගතය, මහපොළොවෙහි ඇණයක් මෙන් ස්ථිරය; නොසෙල්වෙන්නාහ, වෙනස් නොවන්නාහ, එකිනෙකාට හානි නොකරන්නාහ, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැපදුක් පිණිස හෝ නොවන්නාහ. යමෙක් තියුණු ආයුධයකින් හිස සිඳින්නේද, හෙතෙම කිසිවෙකුගේ ජීවිතය නැති නොකරයි. ආයුධය මේ සත්වර කයවල් අතර විවරයකට ඇතුළු වන්නේය. තවද, යෝනි ප්‍රමුඛ ලක්ෂය සතර දහසක්ද, සැට සියයක්ද, හය සියයක්ද, කර්ම පන්සියයක්ද, කර්ම පහක්ද, කර්ම තුනක්ද, කර්මය හා අර්ධ කර්මය යන දෙකද, හැටදෙකක් වූ ප්‍රතිපදාද, හැටදෙකක් වූ අන්තර කල්පද, සය ආකාර වූ අභිජාතිද, අටක් වූ පුරිසභූමිද, සතළිස් නවයක් වූ ආජීවක ශතකෝටිද, සතළිස් නවයක් වූ පරිබ්‍රාජක ශතකෝටිද, සතළිස් නවයක් වූ නාගවාස ශතකෝටිද, විස්සක් වූ ඉන්ද්‍රිය ශතකෝටිද, තිහක් වූ නිරය ශතකෝටිද, තිස් හයක් වූ රජස් ධාතුද, සතක් වූ සඥ්ඤී ගර්භයෝද, සතක් වූ අසඥ්ඤී ගර්භයෝද, සතක් වූ නියන්ඨී ගර්භයෝද, සත් දෙවියෝද, සත් මනුෂ්‍යයෝද, සත් ප්‍රේතයෝද, සත් සරයෝද, සත් පවුටයෝද, සත් පපාතයෝද, සත් සියයක් වූ පපාතයෝද, සත් සුපිනයෝද, සත් සියයක් වූ සුපිනයෝද, අසූ සතර ලක්ෂයක් වූ මහා කල්පද මේවාය. මේවා තුළින් මෝඩයෝද පණ්ඩිතයෝද, දිව දිව සසර සැරිසරා දුක අවසන් කරති. එහිදී 'මම මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ නොපැසුණු කර්මයක් පසවන්නෙමි; පැසුණු කර්මයක් ස්පර්ශ කොට ස්පර්ශ කොට නැති කරන්නෙමි' යැයි කියන්නට (පැසීමට හෝ විනාශ කිරීමට) දෙයක් නැත. (මන්ද) දෝණ ප්‍රමාණයෙන් මනින ලද සැප දුක් ඇති, අවසන් කරන ලද සංසාරයෙහි, අඩු වීමක් හෝ වැඩි වීමක් නැත, උසස් වීමක් හෝ පහත් වීමක් නැත. හරියට නූල් ගුළියක් විසි කළ විට එය දිගහැරෙමින්ම පෙරළී යන්නාක් මෙන්, එපරිද්දෙන්ම මෝඩයෝද පණ්ඩිතයෝද දිගහැරෙමින් සැපදුක් විඳිති.'\" \"නැත, පින්වහන්සේ.\"\n\n\"මහණෙනි, යම් හෙයකින් ආර්යශ්‍රාවකයාට මේ කාරණා පිළිබඳව සැකය ප්‍රහීණ වේද, දුක පිළිබඳවද ඔහුගේ සැකය ප්‍රහීණ වේද, දුකට හේතුව පිළිබඳවද ඔහුගේ සැකය ප්‍රහීණ වේද, දුක් නිරෝධය පිළිබඳවද ඔහුගේ සැකය ප්‍රහීණ වේද, දුක් නිරෝධ ගාමිනී ප්‍රතිපදාව පිළිබඳවද ඔහුගේ සැකය ප්‍රහීණ වේද, මහණෙනි, මේ ආර්යශ්‍රාවකයා සෝවාන් වූයේ යැයි කියනු ලැබේ. හෙතෙම වැටීම් ස්වභාවයෙන් තොරය, නියතය, සම්බෝධියට නියත ගමන් ඇත්තේය.\"",
      "paliTitle": "Mahādiṭṭhisuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 214,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘sassato loko’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘sassato loko’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘sassato loko’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘sassato loko’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā … saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante… pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘sassato loko’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘sassato loko’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti…pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Navamaṃ.",
      "english": "At Sāvatthī. “Monks, when what exists, with what as a basis, clinging to what, does such a view arise: ‘The world is eternal’?” “Our teachings, venerable sir, are rooted in the Blessed One, guided by the Blessed One, have the Blessed One as their refuge. It would be good if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.” “Monks, when form exists, with form as a basis, clinging to form, such a view arises: ‘The world is eternal’. When feeling exists, with feeling as a basis, clinging to feeling, such a view arises: ‘The world is eternal’. When perception exists, with perception as a basis, clinging to perception, such a view arises: ‘The world is eternal’. When volitional formations exist, with volitional formations as a basis, clinging to volitional formations, such a view arises: ‘The world is eternal’. When consciousness exists, with consciousness as a basis, clinging to consciousness, such a view arises: ‘The world is eternal’.” “What do you think, monks, is form permanent or impermanent?” “Impermanent, venerable sir.” “And that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “And that which is impermanent, suffering, subject to change, would it be possible, not clinging to that, for such a view to arise: ‘The world is eternal’?” “No, venerable sir.” “Is feeling permanent or impermanent?” “Impermanent, venerable sir.” “And that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “And that which is impermanent, suffering, subject to change, would it be possible, not clinging to that, for such a view to arise: ‘The world is eternal’?” “No, venerable sir.” “Is perception permanent or impermanent?” “Impermanent, venerable sir.” “And that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “And that which is impermanent, suffering, subject to change, would it be possible, not clinging to that, for such a view to arise: ‘The world is eternal’?” “No, venerable sir.” “Are volitional formations permanent or impermanent?” “Impermanent, venerable sir.” “And that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “And that which is impermanent, suffering, subject to change, would it be possible, not clinging to that, for such a view to arise: ‘The world is eternal’?” “No, venerable sir.” “Is consciousness permanent or impermanent?” “Impermanent, venerable sir.” “And that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “And that which is impermanent, suffering, subject to change, would it be possible, not clinging to that, for such a view to arise: ‘The world is eternal’?” “No, venerable sir.” “And that which is seen, heard, sensed, cognized, attained, sought, pondered by the mind—is that too permanent or impermanent?” “Impermanent, venerable sir.” “And that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “And that which is impermanent, suffering, subject to change, would it be possible, not clinging to that, for such a view to arise: ‘The world is eternal’?” “No, venerable sir.” “Monks, when a noble disciple’s doubt is abandoned regarding these matters, and their doubt regarding suffering is abandoned, their doubt regarding the origin of suffering is abandoned, their doubt regarding the cessation of suffering is abandoned, and their doubt regarding the path leading to the cessation of suffering is abandoned—then, monks, such a noble disciple is called a stream-enterer, one no longer subject to downfall, certain of liberation, headed for full enlightenment.”",
      "sinhala": "සැවැත් නුවරදී.\n\n“භික්ෂූණි, කුමක් තිබියදී, කුමක් උපාදාන කොටගෙන, කුමක් දැඩිව අල්ලාගෙනද මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදින්නේ?”\n\n“වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ විසින් මෙහෙයවනු ලැබුවාහ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. වහන්ස, යහපති, භාග්‍යවතුන් වහන්සේම මේ වචනයේ අර්ථය පැහැදිලි කර දුන මැනව.”\n\n“භික්ෂූණි, රූපය තිබියදී, රූපය උපාදාන කොටගෙන, රූපය දැඩිව අල්ලාගෙන මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදී. වේදනාව තිබියදී, වේදනාව උපාදාන කොටගෙන, වේදනාව දැඩිව අල්ලාගෙන මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදී. සංඥාව තිබියදී, සංඥාව උපාදාන කොටගෙන, සංඥාව දැඩිව අල්ලාගෙන මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදී. සංස්කාර තිබියදී, සංස්කාර උපාදාන කොටගෙන, සංස්කාර දැඩිව අල්ලාගෙන මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදී. විඤ්ඤාණය තිබියදී, විඤ්ඤාණය උපාදාන කොටගෙන, විඤ්ඤාණය දැඩිව අල්ලාගෙන මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදී.”\n\n“භික්ෂූණි, ඔබ මේ කුමක් සිතන්නෙහිද, රූපය නිත්‍යද අනිත්‍යද?”\n\n“අනිත්‍යය, වහන්ස.”\n\n“යම් දෙයක් අනිත්‍යද, ඒ දුක්ද සැපද?”\n\n“දුක්ය, වහන්ස.”\n\n“යම් දෙයක් අනිත්‍යයද, දුක්ද, විපරිනාම ධර්මයක්ද, එය උපාදාන නොකොට මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදීද?”\n\n“නොවේ, වහන්ස.”\n\n“වේදනාව... සංඥාව... සංස්කාර... විඤ්ඤාණය නිත්‍යද අනිත්‍යද?”\n\n“අනිත්‍යය, වහන්ස. දුක්ය, විපරිනාම ධර්මයකි. එය උපාදාන නොකොට මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදීද?”\n\n“නොවේ, වහන්ස.”\n\n“යම් මේ දෙයක් ඇසූ, දුටු, දැනුණු, අවබෝධ කළ, ලත්, සෙවූ, සිතින් විමසන ලද, ඒද නිත්‍යද අනිත්‍යද?”\n\n“අනිත්‍යය, වහන්ස.”\n\n“යම් දෙයක් අනිත්‍යද, ඒ දුක්ද සැපද?”\n\n“දුක්ය, වහන්ස.”\n\n“යම් දෙයක් අනිත්‍යයද, දුක්ද, විපරිනාම ධර්මයක්ද, එය උපාදාන නොකොට මෙසේ 'ලෝකය ශාශ්වතය' යන දැක්ම උපදීද?”\n\n“නොවේ, වහන්ස.”\n\n“භික්ෂූණි, යම් හෙයකින් ආර්ය ශ්‍රාවකයාට මේ කරුණු කෙරෙහි සැකය පහවන්නේද, දුක කෙරෙහිද සැකය පහවන්නේද, දුක්ඛ සමුදය කෙරෙහිද සැකය පහවන්නේද, දුක්ඛ නිරෝධය කෙරෙහිද සැකය පහවන්නේද, දුක්ඛ නිරෝධ ගාමිනී ප්‍රතිපදාව කෙරෙහිද සැකය පහවන්නේද, භික්ෂූණි, මේ ආර්ය ශ්‍රාවකයා සෝවාන් වූ, අපායට නොවැටෙන ස්වභාවයෙන් යුක්ත වූ, නියත වූ, සම්බෝධියට පරම වශයෙන් ගමන් කරන්නේයැයි කියනු ලැබේ.”",
      "paliTitle": "Sassatadiṭṭhisuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 215,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘asassato loko’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati…pe… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – asassato lokoti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante…pe… api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘asassato loko’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti…pe… dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Dasamaṃ.",
      "english": "At Sāvatthī. “Monks, when what exists, with what as a basis, clinging to what, does such a view arise: ‘The world is impermanent’?” “Our teachings, venerable sir, are rooted in the Blessed One, guided by the Blessed One, have the Blessed One as their refuge. It would be good if the Blessed One would explain the meaning of these words. Having heard it from the Blessed One, the bhikkhus will remember it.” “Monks, when form exists, is form permanent or impermanent? Is feeling permanent or impermanent? Is perception permanent or impermanent? Are fabrications permanent or impermanent? Is consciousness permanent or impermanent?” “Impermanent, venerable sir.” “Furthermore, without clinging to that, would such a view arise: ‘The world is impermanent’?” “No, venerable sir.” “That which is seen, heard, sensed, cognized, attained, sought, pondered by the mind—is that too permanent or impermanent?” “Impermanent, venerable sir.” “Furthermore, without clinging to that, would such a view arise: ‘The world is impermanent’?” “No, venerable sir.” “Monks, when a noble disciple’s doubt about these things is abandoned, when their doubt about suffering is abandoned, when their doubt about the origin of suffering is abandoned, when their doubt about the cessation of suffering is abandoned, when their doubt about the path leading to the cessation of suffering is abandoned – such a noble disciple, monks, is called a stream-enterer, one not subject to downfall, certain of liberation, bound for full enlightenment.”",
      "sinhala": "සැවැත් නුවරදී.\n\n\"මහණෙනි, කුමක් ඇති කල්හි ද, කුමක් උපාදාන කරගෙන ද, කුමක් දැඩි කොට අල්ලාගෙන ද, ‘ලෝකය අනිත්‍ය ය’ යන මෙබඳු දෘෂ්ටියක් උපදී ද?\"\n\"ස්වාමීනි, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ ප්‍රධාන කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇත්තාහ. ස්වාමීනි, යහපති භාග්‍යවතුන් වහන්සේ ම මේ වචනයේ අර්ථය පැහැදිලි කරන සේක්වා. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරන්නාහ.\"\n\n\"මහණෙනි, රූපය ඇති කල්හි ද, වේදනාව ඇති කල්හි ද, සංඥාව ඇති කල්හි ද, සංස්කාර ඇති කල්හි ද, විඤ්ඤාණය ඇති කල්හි ද, මේ රූපය, වේදනාව, සංඥාව, සංස්කාර, විඤ්ඤාණය නිත්‍ය ද, අනිත්‍ය ද?\"\n\"ස්වාමීනි, අනිත්‍ය ය.\"\n\"ඒ ධර්මයන් උපාදාන කර නොගෙන, ‘ලෝකය අනිත්‍ය ය’ යන මෙබඳු දෘෂ්ටියක් හටගනී ද?\"\n\"නැත, ස්වාමීනි.\"\n\n\"මහණෙනි, යමක් දක්නට ලැබුණේ ද, අසන්නට ලැබුණේ ද, (නාසය, දිව, කය යන) ඉන්ද්‍රියයන්ගෙන් දැනගන්නට ලැබුණේ ද, මනසින් දැනගන්නට ලැබුණේ ද, පත්වූයේ ද, සොයා ගනු ලැබුවේ ද, මනසින් විමසනු ලැබුවේ ද, ඒ සියල්ල ද නිත්‍ය ද, අනිත්‍ය ද?\"\n\"ස්වාමීනි, අනිත්‍ය ය.\"\n\"ඒ ධර්මයන් උපාදාන කර නොගෙන, ‘ලෝකය අනිත්‍ය ය’ යන මෙබඳු දෘෂ්ටියක් හටගනී ද?\"\n\"නැත, ස්වාමීනි.\"\n\n\"මහණෙනි, යම් හෙයකින් ආර්ය ශ්‍රාවකයාට මේ කාරණා පිළිබඳ සැක දුරු වී ද, දුක පිළිබඳ ඔහුගේ සැකය දුරු වී ද, දුක හටගැනීම පිළිබඳ ඔහුගේ සැකය දුරු වී ද, දුක නැති කිරීම පිළිබඳ ඔහුගේ සැකය දුරු වී ද, දුක නැති කිරීමේ මාර්ගය පිළිබඳ ඔහුගේ සැකය දුරු වී ද – මහණෙනි, මේ ආර්ය ශ්‍රාවකයා සෝවාන් වූයේ යැයි ද, අපායට නොවැටෙන ස්වභාවය ඇත්තේ යැයි ද, ස්ථිර යැයි ද, සම්බෝධිය පරමායනය කොට ඇත්තේ යැයි ද කියනු ලැබේ.\"",
      "paliTitle": "Asassatadiṭṭhisuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 216,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘antavā loko’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… niyato sambodhiparāyano’’ti. Ekādasamaṃ.",
      "english": "At Sāvatthī. “Monks, when what exists, grasping what, and insisting upon what, does such a view arise: ‘The world is finite’?”\n\n“Venerable sir, our teachings have the Blessed One as their root, their guide, their refuge. It would be good, venerable sir, if the Blessed One himself would elucidate the meaning of this statement. Having heard from the Blessed One, the monks will remember it. For the Blessed One is assured of full enlightenment.”",
      "sinhala": "සැවැත් නුවරදී.\n\n‘‘භික්ෂූනි, කුමක් පවතිද්ද, කුමක් හේතුකොටගෙනද, කුමක් දැඩිව අල්වාගෙනද ‘ලෝකය සීමා සහිතයි’ යන මෙවැනි දෘෂ්ටියක් හටගන්නේ?’’\n\nවහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇත්තාහ. වහන්ස, භාග්‍යවතුන් වහන්සේම මේ ධර්ම කාරණය පහදා දුනහොත් ඉතා මැනවි. භාග්‍යවතුන් වහන්සේ වදාරන ආකාරයට භික්ෂූහු එය සිත්හි දරා ගන්නාහ.",
      "paliTitle": "Antavāsuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 217,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘anantavā loko’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… niyato sambodhiparāyano’’ti. Dvādasamaṃ.",
      "english": "At Sāvatthī.\n\n“Bhikkhus, when what exists, what taking as a basis, what adhering to, does such a view arise: ‘The world is infinite’?”\n\n“Our teachings, venerable sir, have the Blessed One as their root, their guide, and their refuge; it would be good, venerable sir, if the Blessed One himself would illuminate this teaching so that, having heard it, the bhikkhus will remember it and thus become certain of full awakening.”",
      "sinhala": "සැවැත්නුවරදී කරන ලද දේශනාවකි. ‘‘භික්ෂූණි, කුමක් තිබියදී ද, කුමක් ඇසුරු කොට ගෙන ද, කුමක් දැඩිව අල්ලාගෙන ද ‘ලෝකය අනන්තය’ යන මෙබඳු දෘෂ්ටියක් හටගනීද?’’ (එවිට භික්ෂූහු මෙසේ කීහ): ‘‘ස්වාමීනි, අපගේ ධර්මයන්ට භාග්‍යවතුන් වහන්සේම මුල් වන්නේය, භාග්‍යවතුන් වහන්සේම නායක වන්නේය, භාග්‍යවතුන් වහන්සේම පිහිට වන්නේය. (ඒ භාග්‍යවතුන් වහන්සේ) නියත සම්බෝධියට පත් වූ සේක.’’\n\nදොළොස්වැනි සූත්‍රයයි.",
      "paliTitle": "Anantavāsuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 218,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘taṃ jīvaṃ taṃ sarīra’’’nti? Bhagavaṃmūlakā no, bhante, dhammā…pe… niyato sambodhiparāyano’’ti. Terasamaṃ.",
      "english": "At Sāvatthī.\n\n“Monks, when what exists, grasping what, adhering to what, does such a view arise: ‘The life principle is identical with the body’?”\n\n“Our teachings, venerable sir, have the Fortunate One as their root, are dependent on the Fortunate One, have the Fortunate One as their refuge. It would be good, venerable sir, if the Fortunate One himself would explain the meaning of this statement. Having heard from the Fortunate One, the monks will remember it; and these teachings are certain to lead to full awakening as their ultimate destination.”\n\nThirteenth.",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලදී.\nභික්ෂූණි, කුමක් පවතින කල, කුමක් උපාදාන කරගෙන, කුමක් අභිනිවේශ කරගෙන 'මේ ජීවයම ශරීරය වේ' යන මෙබඳු දෘෂ්ටියක් හටගන්නේද?\n\nවහන්ස, අපගේ ධර්මයෝ භාග්‍ය​වතුන් වහන්සේ මුල්කොට ඇත්තාහ. එම ධර්‍මය තුළින් සම්බෝධිය පිණිස නියත වූ පරම ගතියක් ඇත්තෙක් වෙයි.\nදහතුන්වෙනි සූත්‍රයයි.",
      "paliTitle": "Taṃjīvaṃtaṃsarīraṃsuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 219,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘aññaṃ jīvaṃ aññaṃ sarīra’’’nti? Bhagavaṃmūlakā no, bhante, dhammā…pe… niyato sambodhiparāyano’’ti. Cuddasamaṃ.",
      "english": "At Sāvatthī. “Mendicants, when what exists, what is clung to, and what is fixated upon, does such a view arise: ‘The life-principle is one thing, the body another’?”\n\n“Our teachings, venerable sir, are rooted in the Blessed One, guided by the Blessed One, and sheltered by the Blessed One. It would be good if the Blessed One himself would elucidate the meaning of this statement. Having heard it from the Blessed One, the mendicants will bear it in mind. For he is assured of full awakening.”",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදී.\n\n    \"මහණෙනි, කුමක් තිබියදී, කුමක් අල්ලාගෙන, කුමක් දැඩිව අභිනිවේශ කොටගෙන නම් ‘ජීවය අන් දෙයක්ය, ශරීරය අන් දෙයක්ය’ යන මේ දෘෂ්ටිය හටගන්නේද?\"\n\n    \"වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ මඟ පෙන්වන්නාහ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. වහන්ස, භාග්‍යවතුන් වහන්සේම මේ ධර්ම කථාව ප්‍රකාශ කරනු ලබන්නේ නම් ඉතා යහපත්ය. භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණය කොට භික්ෂූහු ඒ ධර්මය ධාරණය කරගන්නාහ. ඔවුහු සම්බෝධිය පිණිස නියත වූ පරායනයක් ඇත්තාහ.\"\n\n    දහහතරවැනි සූත්‍රයයි.",
      "paliTitle": "Aññaṃjīvaṃaññaṃsarīraṃsuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 220,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘hoti tathāgato paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… niyato sambodhiparāyano’’ti. Pannarasamaṃ.",
      "english": "At Sāvatthī.\n\n“Monks, when what exists, grasping what, and fixating on what, does such a view arise: ‘A Tathāgata exists after death’?” “For us, Venerable Sir, the teachings have the Blessed One as their root, their guide, their refuge. It would be good if the Blessed One himself would explain the meaning of these words. Having heard it from the Blessed One, the monks will remember it, for they are certain of ultimate enlightenment.” The fifteenth.",
      "sinhala": "ශ්‍රාවස්තියෙහිදීය.\n\n\"භික්ෂූණි, කුමක් තිබෙන කල්හි, කුමක් උපාදාන කොට ගෙන, කුමක් අභිනිවේශ කොට ගෙන 'තථාගතයන් වහන්සේ මරණින් පසුව ද සිටින සේක' යන මෙබඳු දෘෂ්ටියක් උපදීද?\"\n\n\"වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ එහි නායක සේක. භාග්‍යවතුන් වහන්සේම අපගේ පිහිට සේක. වහන්ස, මේ දේශනාවේ අර්ථය භාග්‍යවතුන් වහන්සේටම පැහැදිලි කිරීමට සුදුසුය. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය සිත්හි දරාගන්නාහුය. 'අපි නිශ්චිත වශයෙන්ම සම්බෝධිය අවසාන ගමනාන්තය කොට ඇත්තෝ වෙමු'.\"\n\nපහළොස්වන සූත්‍රයයි.",
      "paliTitle": "Hotitathāgatosuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 221,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na hoti tathāgato paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… niyato sambodhiparāyano’’ti. Soḷasamaṃ.",
      "english": "At Sāvatthī.\n“Bhikkhus, when what exists, by grasping what, by adhering to what, does such a view arise: ‘The Tathāgata does not exist after death’?”\n“Venerable sir, our teachings are rooted in the Blessed One, and he is destined for perfect enlightenment.”",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\n\"මහණෙනි, කුමක් පවතිද්දී, කුමක් උපාදානය කොටගෙනද, කුමක් තදින් අල්ලාගෙනද, 'තථාගතයන් වහන්සේ මරණින් මතු නැත' යන මෙබඳු දෘෂ්ටියක් ඇතිවන්නේ?\"\n\n\"ස්වාමීනි, අපගේ ධර්මයෝ භාග්‍ය‌වතුන් වහන්සේ මුල්කොට ඇත්තාහ...පෙ... සම්බෝධිය පිණිස නියත වූ, සම්බෝධිය පරම කොට ඇත්තෙක් වෙයි.\"\n\nදහසයවැනි සූත්‍රයයි.",
      "paliTitle": "Nahotitathāgatosuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 222,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā… pe… niyato sambodhiparāyano’’ti. Sattarasamaṃ.",
      "english": "In Sāvatthī.\n\n“Monks, when what exists, grasping what, and persistently clinging to what, does such a view arise: ‘The Tathāgata both exists and does not exist after death’?”\n\n“Venerable sir, our teachings are rooted in the Blessed One, have the Blessed One as their guide, and have the Blessed One as their refuge. It would be good, Venerable sir, if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the monks will remember it. He is resolute, destined for full enlightenment.”",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදී.\n\n“භික්ෂූණි, කුමක් පවතිද්දී, කුමක් උපාදානය කරගනිමින්, කුමක් දැඩිව අල්ලාගනිමින් නම්, ‘මරණින් පසුව තථාගතයන් වහන්සේ සිටින්නේද, නොසිටින්නේද’ යන මේ දෘෂ්ටිය උපදින්නේද?”\n\n“වහන්ස, අපගේ ධර්මයන්ට භාග්‍යවතුන් වහන්සේ මුල් වෙති. භාග්‍යවතුන් වහන්සේම අපගේ මාර්ගෝපදේශකයාය, අපගේ සරණය. වහන්ස, භාග්‍යවතුන් වහන්සේම මේ ධර්ම දේශනාව ප්‍රකාශ කරන්නේ නම් මැනවි. භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය සිත්හි ධාරණය කරගන්නාහුය. අපි නියතයෙන්ම සම්බෝධියට පමුණුවන්නෝ වෙමු.”",
      "paliTitle": "Hoticanacahotitathāgatosuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 223,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā… pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’ti…pe…. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yampidaṃ diṭṭhaṃ sutaṃ mutaṃ viññātaṃ pattaṃ pariyesitaṃ anuvicaritaṃ manasā tampi niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Yato kho, bhikkhave, ariyasāvakassa imesu ca ṭhānesu kaṅkhā pahīnā hoti, dukkhepissa kaṅkhā pahīnā hoti, dukkhasamudayepissa kaṅkhā pahīnā hoti, dukkhanirodhepissa kaṅkhā pahīnā hoti, dukkhanirodhagāminiyā paṭipadāyapissa kaṅkhā pahīnā hoti – ayaṃ vuccati, bhikkhave, ariyasāvako sotāpanno avinipātadhammo niyato sambodhiparāyano’’ti. Aṭṭhārasamaṃ. Sotāpattivaggo. Aṭṭhārasaveyyākaraṇaṃ niṭṭhitaṃ. Tassuddānaṃ – Vātaṃ etaṃ mama, so attā no ca me siyā; Natthi karoto hetu ca, mahādiṭṭhena aṭṭhamaṃ. Sassato loko ca, asassato ca antavā ca; Anantavā ca taṃ jīvaṃ taṃ sarīranti; Aññaṃ jīvaṃ aññaṃ sarīranti ca. Hoti tathāgato paraṃ maraṇāti; Na hoti tathāgato paraṃ maraṇāti; Neva hoti na na hoti tathāgato paraṃ maraṇāti.",
      "english": "At Sāvatthī. \"Bhikkhus, when what exists, with what as a basis, clinging to what, does such a view arise: 'The Tathāgata neither is nor is not after death'?\"\n\n\"Our teachings, venerable sir, have the Blessed One as their root, their guide, their refuge. May the Blessed One himself explain the meaning of these words. Having heard it from the Blessed One, the bhikkhus will remember it.\"\n\"Bhikkhus, when form exists, with form as a basis, clinging to form, such a view arises: 'The Tathāgata neither is nor is not after death.' When feeling exists, with feeling as a basis, clinging to feeling, such a view arises: 'The Tathāgata neither is nor is not after death.' When perception exists, with perception as a basis, clinging to perception, such a view arises: 'The Tathāgata neither is nor is not after death.' When volitional formations exist, with volitional formations as a basis, clinging to volitional formations, such a view arises: 'The Tathāgata neither is nor is not after death.' When consciousness exists, with consciousness as a basis, clinging to consciousness, such a view arises: 'The Tathāgata neither is nor is not after death.'\"\n\n\"What do you think, bhikkhus, is form permanent or impermanent?\"\n\"Impermanent, venerable sir.\"\n\"But that which is impermanent, is it suffering or happiness?\"\n\"Suffering, venerable sir.\"\n\"And that which is impermanent, suffering, and subject to change, would it be possible, without clinging to that, for such a view to arise: 'The Tathāgata neither is nor is not after death'?\"\n\"No, venerable sir.\"\n\n\"That which is seen, heard, sensed, cognized, attained, sought, and pondered by the mind—is that permanent or impermanent?\"\n\"Impermanent, venerable sir.\"\n\"But that which is impermanent, is it suffering or happiness?\"\n\"Suffering, venerable sir.\"\n\"But that which is impermanent, suffering, and subject to change, would it be possible, without clinging to that, for such a view to arise: 'The Tathāgata neither is nor is not after death'?\"\n\"No, venerable sir.\"\n\n\"Bhikkhus, when a noble disciple's doubt is abandoned regarding these matters, and his doubt is abandoned regarding suffering, his doubt is abandoned regarding the origin of suffering, his doubt is abandoned regarding the cessation of suffering, and his doubt is abandoned regarding the path leading to the cessation of suffering—such a noble disciple, bhikkhus, is called a stream-enterer, one not subject to falling into lower states, assured, destined for full awakening.\"\n\nThe eighteenth. The Chapter on Stream-Entry. The eighteenth discourse is finished.\nThe summary of that: This is my wind, that self is not mine; There is no cause for doing, and the eighth with great view. The world is eternal, and not eternal, and finite; And infinite, that which is life is that which is body; And different is the life, different is the body. The Tathāgata exists after death; The Tathāgata does not exist after death; The Tathāgata neither is nor is not after death.",
      "sinhala": "සැවැත්නුවරදී මේ දේශනාව සිදුවිය.\n\n\"මහණෙනි, කුමක් තිබියදීද, කුමක් උපාදානය කරගෙනද, කුමක් දැඩිව අල්ලාගෙනද මෙබඳු දෘෂ්ටියක් හටගන්නේ – ‘මරණින් පසු තථාගතයන් වහන්සේ නොවේද, නොනොවේද’ යනුයි?\"\n\n\"වහන්ස, අපගේ ධර්මයන් භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ; භාග්‍යවතුන් වහන්සේම මෙය විස්තර කරන්නේ නම් මැනවි.\"\n\n\"මහණෙනි, රූපය තිබියදී, රූපය උපාදානය කරගෙන, රූපය දැඩිව අල්ලාගෙන මෙබඳු දෘෂ්ටියක් හටගන්නේ – ‘මරණින් පසු තථාගතයන් වහන්සේ නොවේද, නොනොවේද’ යනුයි.\"\n\n\"මහණෙනි, ඒ කුමක් සිතන්නහුද? රූපය නිත්‍යද අනිත්‍යද?\"\n\"අනිත්‍යයි, වහන්ස. යමක් අනිත්‍යද, එය දුක් ස්වභාවයෙන් යුක්තය. එය වෙනස්වන ස්වභාවය ඇති දෙයකි. එසේ නම්, වෙනස්වන සුළු, දුක් ස්වභාවය ඇති, අනිත්‍ය වූ රූපය උපාදානය කර නොගෙන මෙබඳු දෘෂ්ටියක් හටගන්නේද – ‘මරණින් පසු තථාගතයන් වහන්සේ නොවේද, නොනොවේද’ යනුයි?\"\n\"එසේ නොවෙයි, වහන්ස.\"\n\n\"ඇසූද, දුටුද, දැනුණුද, දැනගත්ද, ලැබූද, සොයාගත්ද, මනසින් විමසූද යමක් වේද, එයද නිත්‍යද අනිත්‍යද?\"\n\"අනිත්‍යයි, වහන්ස.\"\n\"යමක් අනිත්‍යද, එය දුක්ද සුවද?\"\n\"දුකයි, වහන්ස.\"\n\"යමක් අනිත්‍යද, දුක් ස්වභාවයෙන් යුක්තද, වෙනස්වන ස්වභාවය ඇත්තේද, එසේ නම් ඒ උපාදානය කර නොගෙන මෙබඳු දෘෂ්ටියක් හටගන්නේද – ‘මරණින් පසු තථාගතයන් වහන්සේ නොවේද, නොනොවේද’ යනුයි?\"\n\"එසේ නොවෙයි, වහන්ස.\"\n\n\"මහණෙනි, යම් හෙයකින් ආර්‍ය්‍ය ශ්‍රාවකයාට මේ කාරණා සම්බන්ධයෙන් සැකය ප්‍රහීණ වීද, දුක පිළිබඳවද සැකය ප්‍රහීණ වීද, දුක හටගැනීම පිළිබඳවද සැකය ප්‍රහීණ වීද, දුක නැති කිරීම පිළිබඳවද සැකය ප්‍රහීණ වීද, දුක නැති කිරීමට ඇති මාර්ගය පිළිබඳවද සැකය ප්‍රහීණ වීද – මහණෙනි, මේ ආර්‍ය්‍ය ශ්‍රාවකයා සෝවාන් වූ, අපායට නොවැටෙන ස්වභාවය ඇති, නියත වූ, සම්බෝධිය පරම කොට ඇති අයෙකු ලෙස කියනු ලැබේ.\"\n\nදහඅටවෙනි දේශනාවයි. සෝවාන් වග්ගයයි. දහඅටවෙනි විවරණය අවසන් විය. එහි උද්දානය – ‘මෙය මගේ සුළඟය, ඒ ආත්මය මට අයිති නැත’; ‘කරන දෙයකට හේතුවක් නැත’ යනු මහත් දෘෂ්ටියෙන් අටවෙනියයි. ලෝකය ශාශ්වතය, අශාශ්වතය, සීමා සහිතය, සීමා රහිතය, ඒ ජීවය එයම ශරීරයයි, වෙන ජීවය වෙන ශරීරයයි. මරණින් පසු තථාගතයන් වහන්සේ වෙති; මරණින් පසු තථාගතයන් වහන්සේ නොවෙති; මරණින් පසු තථාගතයන් වහන්සේ නොවේද නොනොවේද.",
      "paliTitle": "Nevahotinanahotitathāgatosuttaṃ",
      "vagga": "Sotāpattivaggo"
    },
    {
      "number": 224,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā, esikaṭṭhāyiṭṭhitā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’ti. Vedanāya sati…pe… saññāya sati…pe… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dukkhe sati, dukkhaṃ upādāya, dukkhaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’’ti. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dukkhe sati, dukkhaṃ upādāya, dukkhaṃ abhinivissa evaṃ diṭṭhi uppajjeyya – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā, esikaṭṭhāyiṭṭhitā’’’ti. Paṭhamaṃ.",
      "english": "At Sāvatthī. “Monks, when what is present, having clung to what, having fixated upon what, does such a view arise: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar’?”\n\n“Our teachings, venerable sir, have the Blessed One as their root, their guide, and their refuge. It would be good, venerable sir, if the Blessed One himself would explain this, and the other monastics, having heard it from the Blessed One, will remember it.”\n\n“Monks, when form is present, having clung to form, having fixated upon form, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar.’ When feeling is present, having clung to feeling, having fixated upon feeling, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar.’ When perception is present, having clung to perception, having fixated upon perception, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar.’ When volitional formations are present, having clung to volitional formations, having fixated upon volitional formations, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar.’ When consciousness is present, having clung to consciousness, having fixated upon consciousness, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar’.”\n\n“What do you think, monks, is form permanent or impermanent?” “Impermanent, venerable sir.” “Is what is impermanent suffering or happiness?” “Suffering, venerable sir.” “Is what is impermanent, suffering, and subject to change fit to be regarded as ‘This is mine, this I am, this is my self’?” “No, venerable sir.” “Subject to change. Would such a view—‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar’—arise without clinging to it?” “No, venerable sir.”\n\n“Thus, monks, when suffering is present, having clung to suffering, having fixated upon suffering, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar’.”\n\n“What do you think, monks, is feeling permanent or impermanent? Is perception permanent or impermanent? Are volitional formations permanent or impermanent? Is consciousness permanent or impermanent?” “Impermanent, venerable sir.” “Is what is impermanent suffering or happiness?” “Suffering, venerable sir.” “Is what is impermanent, suffering, and subject to change fit to be regarded as ‘This is mine, this I am, this is my self’?” “No, venerable sir.” “Subject to change. Would such a view—‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar’—arise without clinging to it?” “No, venerable sir.”\n\n“Thus, monks, when suffering is present, having clung to suffering, having fixated upon suffering, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the moon and sun do not rise or set; everything is fixed like a pillar’.”",
      "sinhala": "සැවැත්නුවරදීය.\n\n\"මහණෙනි, කුමක් පවතින කල්හිද, කුමක් උපාදාන කරගෙනද, කුමක් දැඩිව අල්ලාගෙනද, 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදීද?\"\n\n\"ස්වාමීනි, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ නෙත් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. ස්වාමීනි, යමකට භාග්‍යවතුන් වහන්සේ මුල් වන සේක්ද, භාග්‍යවතුන් වහන්සේ නෙත් වන සේක්ද, භාග්‍යවතුන් වහන්සේ සරණ වන සේක්ද, එය ඉතා යහපති. ස්වාමීනි, භාග්‍යවතුන් වහන්සේටම මේ ප්‍රකාශිත කරුණෙහි අර්ථය පහළ වේවා! භාග්‍යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරන්නාහුය.\"\n\n\"මහණෙනි, රූපය පවතින කල්හි, රූපය උපාදාන කරගෙන, රූපය දැඩිව අල්ලාගෙන, 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදී. වේදනාව පවතින කල්හි, වේදනාව උපාදාන කරගෙන, වේදනාව දැඩිව අල්ලාගෙන, 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදී. සංඥාව පවතින කල්හි, සංඥාව උපාදාන කරගෙන, සංඥාව දැඩිව අල්ලාගෙන, 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදී. සංස්කාර පවතින කල්හි, සංස්කාර උපාදාන කරගෙන, සංස්කාර දැඩිව අල්ලාගෙන, 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදී. විඤ්ඤාණය පවතින කල්හි, විඤ්ඤාණය උපාදාන කරගෙන, විඤ්ඤාණය දැඩිව අල්ලාගෙන, 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදී.\"\n\n\"මහණෙනි, ඒ කුමක් සිතන්නාහුද? රූපය නිත්‍යද, අනිත්‍යද?\" \"ස්වාමීනි, අනිත්‍යය.\" \"එය විපරිණාම ධර්මය ඇති දෙයක් නේද? එය උපාදාන කර නොගෙන 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදින්නට හැකිද?\" \"ස්වාමීනි, එසේ විය නොහැක.\" \"මහණෙනි, මෙසේ දුක පවතින කල්හි, දුක උපාදාන කරගෙන, දුක දැඩිව අල්ලාගෙන, 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදී.\"\n\n\"වේදනාව, සංඥාව, සංස්කාර, විඤ්ඤාණය නිත්‍යද, අනිත්‍යද?\" \"ස්වාමීනි, අනිත්‍යය.\" \"එය විපරිණාම ධර්මය ඇති දෙයක් නේද? එය උපාදාන කර නොගෙන 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදින්නට හැකිද?\" \"ස්වාමීනි, එසේ විය නොහැක.\" \"මහණෙනි, මෙසේ දුක පවතින කල්හි, දුක උපාදාන කරගෙන, දුක දැඩිව අල්ලාගෙන, 'සුළං හමන්නේ නැත, ගංගා ගලන්නේ නැත, ගැබිණියන් බිහි කරන්නේ නැත, සඳු-හිරු උදාවන්නේ හෝ බැස යන්නේ නැත, (සියල්ල) කණුවක් මෙන් ස්ථිරව පිහිටා ඇත' යන මෙවැනි දෘෂ්ටියක් උපදී.\"",
      "paliTitle": "Vātasuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 225,
      "numberRange": "225-240",
      "pali": "(Purimavagge viya aṭṭhārasa veyyākaraṇāni vitthāretabbānīti.) Sattarasamaṃ.",
      "english": "The eighteen analytical expositions are to be elaborated upon in the same manner as in the preceding division. This concludes the seventeenth section.",
      "sinhala": "පෙර පරිච්ඡේදයේ මෙන් අටළොස් වෛය්‍යාකරණ විස්තර කළ යුතු ය. මෙය සත්ළොස්වැනි කොටසයි.",
      "paliTitle": "",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 241,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘neva hoti na na hoti tathāgato paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā… pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’ti. Vedanāya sati… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dukkhe sati, dukkhaṃ upādāya, dukkhaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’’’ti. ‘‘Vedanā… saññā … saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dukkhe sati, dukkhaṃ upādāya dukkhaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘neva hoti, na na hoti tathāgato paraṃ maraṇā’’’ti. Aṭṭhārasamaṃ.",
      "english": "“Monks, when what exists, having clung to what, having become thoroughly engrossed in what, does such a view arise: ‘The Tathāgata neither exists nor non-exists after death’?”\n“Our teachings, Venerable Sir, are rooted in the Blessed One, guided by the Blessed One, have the Blessed One as their refuge. It would be good if the Blessed One himself would explain the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.”\n\n“Monks, when form exists, having clung to form, having become thoroughly engrossed in form, such a view arises: ‘The Tathāgata neither exists nor non-exists after death’. When feeling exists, having clung to feeling, having become thoroughly engrossed in feeling, such a view arises: ‘The Tathāgata neither exists nor non-exists after death’. When perception exists, having clung to perception, having become thoroughly engrossed in perception, such a view arises: ‘The Tathāgata neither exists nor non-exists after death’. When formations exist, having clung to formations, having become thoroughly engrossed in formations, such a view arises: ‘The Tathāgata neither exists nor non-exists after death’. When consciousness exists, having clung to consciousness, having become thoroughly engrossed in consciousness, such a view arises: ‘The Tathāgata neither exists nor non-exists after death’.”\n\n“What do you think, monks, is form permanent or impermanent?” “Impermanent, Venerable Sir.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Venerable Sir.” “Is that which is impermanent and unsatisfactory, by nature subject to change and alteration, fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Venerable Sir.” “Therefore, monks, regarding that which is subject to change and alteration, would such a view arise, ‘The Tathāgata neither exists nor non-exists after death’, without clinging to it?” “No, Venerable Sir.”\n\n“Thus, monks, when suffering exists, having clung to suffering, having become thoroughly engrossed in suffering, such a view arises: ‘The Tathāgata neither exists nor non-exists after death’.”\n\n“What do you think, monks, is feeling permanent or impermanent?” “Impermanent, Venerable Sir.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Venerable Sir.” “Is that which is impermanent and unsatisfactory, by nature subject to change and alteration, fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Venerable Sir.”\n“What do you think, monks, is perception permanent or impermanent?” “Impermanent, Venerable Sir.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Venerable Sir.” “Is that which is impermanent and unsatisfactory, by nature subject to change and alteration, fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Venerable Sir.”\n“What do you think, monks, are formations permanent or impermanent?” “Impermanent, Venerable Sir.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Venerable Sir.” “Is that which is impermanent and unsatisfactory, by nature subject to change and alteration, fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Venerable Sir.”\n“What do you think, monks, is consciousness permanent or impermanent?” “Impermanent, Venerable Sir.” “Is that which is impermanent satisfactory or unsatisfactory?” “Unsatisfactory, Venerable Sir.” “Is that which is impermanent and unsatisfactory, by nature subject to change and alteration, fit to be regarded thus: ‘This is mine, this I am, this is my self’?” “No, Venerable Sir.” “Therefore, monks, regarding that which is subject to change and alteration, would such a view arise, ‘The Tathāgata neither exists nor non-exists after death’, without clinging to it?” “No, Venerable Sir.”\n\n“Thus, monks, when suffering exists, having clung to suffering, having become thoroughly engrossed in suffering, such a view arises: ‘The Tathāgata neither exists nor non-exists after death’.”",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\n“මහණෙනි, කුමක් පවතින කල්හි, කුමක් දැඩිව අල්ලාගෙන, කුමක් දැඩිව පිහිටාගෙන, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී දැ?”යි භාග්‍ය‍වතුන් වහන්සේ විමසූ සේක.\n\n“ස්වාමීනී, අපගේ ධර්ම‍යෝ භාග්‍ය‍වතුන් වහන්සේ මුල් කොට ඇත්තෝය. භාග්‍ය‍වතුන් වහන්සේ නායක කොට ඇත්තෝය. භාග්‍ය‍වතුන් වහන්සේ පිහිට කොට ඇත්තෝය. ස්වාමීනී, භාග්‍ය‍වතුන් වහන්සේම මෙය විස්තර කරන්නේ නම් යහපති. භාග්‍ය‍වතුන් වහන්සේගෙන් අසා භික්ෂූහු එය සිත්හි දරා ගනිත්වා!”යි භික්ෂූහු පිළිතුරු දුන්හ.\n\n“මහණෙනි, රූපය පවතින කල්හි, රූපය දැඩිව අල්ලාගෙන, රූපය දැඩිව පිහිටාගෙන, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී. වේදනාව පවතින කල්හි, වේදනාව දැඩිව අල්ලාගෙන, වේදනාව දැඩිව පිහිටාගෙන, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී. සංඥාව පවතින කල්හි, සංඥාව දැඩිව අල්ලාගෙන, සංඥාව දැඩිව පිහිටාගෙන, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී. සංස්කාර පවතින කල්හි, සංස්කාර දැඩිව අල්ලාගෙන, සංස්කාර දැඩිව පිහිටාගෙන, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී. විඥාණය පවතින කල්හි, විඥාණය දැඩිව අල්ලාගෙන, විඥාණය දැඩිව පිහිටාගෙන, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී.”\n\n“මහණෙනි, මේ කුමක් සිතන්නෙහි ද? රූපය නිත්‍ය‍ දැ, අනිත්‍ය‍ දැ?” “අනිත්‍ය‍ය, ස්වාමීනී.” “යම් දෙයක් අනිත්‍ය‍ නම්, එය දුක් දැ, සුව දැ?” “දුක්ය, ස්වාමීනී.” “යම් දෙයක් අනිත්‍ය‍, දුක් වූ, වෙනස්වීමේ ස්වභාවයෙන් යුක්ත නම්, එය නොඇලී සිටිය හොත්, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී දැ?” “එසේ නොවේ, ස්වාමීනී.” “එබැවින් මහණෙනි, දුක පවතින කල්හි, දුක දැඩිව අල්ලාගෙන, දුක දැඩිව පිහිටාගෙන, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී.”\n\n“වේදනාව… සංඥාව… සංස්කාර… විඥාණය නිත්‍ය‍ දැ, අනිත්‍ය‍ දැ?” “අනිත්‍ය‍ය, ස්වාමීනී.” “යම් දෙයක් අනිත්‍ය‍ නම්, එය දුක් දැ, සුව දැ?” “දුක්ය, ස්වාමීනී.” “යම් දෙයක් අනිත්‍ය‍, දුක් වූ, වෙනස්වීමේ ස්වභාවයෙන් යුක්ත නම්, එය නොඇලී සිටිය හොත්, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී දැ?” “එසේ නොවේ, ස්වාමීනී.” “එබැවින් මහණෙනි, දුක පවතින කල්හි, දුක දැඩිව අල්ලාගෙන, දුක දැඩිව පිහිටාගෙන, ‘තථාගතයන් වහන්සේ මරණින් පසු පවතී යැයි ද කිව නොහැකි, නොපවතී යැයි ද කිව නොහැකි’ යන මේ දෘෂ්ටිය උපදී.”\n\nඅටළොස්වැනි සූත්‍රයයි.",
      "paliTitle": "Nevahotinanahotisuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 242,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘rūpī attā hoti, arogo paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘rūpī attā hoti, arogo paraṃ maraṇā’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘rūpī attā hoti, arogo paraṃ maraṇā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘rūpī attā hoti, arogo paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dukkhe sati, dukkhaṃ upādāya, dukkhaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘rūpī attā hoti, arogo paraṃ maraṇā’’’ti? ‘‘Vedanā…pe… ‘‘no hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dukkhe sati, dukkhaṃ upādāya, dukkhaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘rūpī attā hoti, arogo paraṃ maraṇā’’’ti. Ekūnavīsatimaṃ.",
      "english": "\"Monks, when what is present, clinging to what, and stubbornly adhering to what, does such a view arise: 'The self is material, free from affliction after death'?\"\n\n\"Our teachings, Venerable Sir, have the Blessed One as their root, their guide, their refuge. May the Blessed One explain the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.\"\n\n\"Monks, when form is present, clinging to form, and stubbornly adhering to form, such a view arises: 'The self is material, free from affliction after death.' When feeling is present, clinging to feeling, and stubbornly adhering to feeling, such a view arises: 'The self is material, free from affliction after death.' When perception is present, clinging to perception, and stubbornly adhering to perception, such a view arises: 'The self is material, free from affliction after death.' When volitional formations are present, clinging to volitional formations, and stubbornly adhering to volitional formations, such a view arises: 'The self is material, free from affliction after death.' And when consciousness is present, clinging to consciousness, and stubbornly adhering to consciousness, such a view arises: 'The self is material, free from affliction after death'.\"\n\n\"What do you think, monks, is form permanent or impermanent?\"\n\"Impermanent, Venerable Sir.\"\n\"Is what is impermanent satisfactory or unsatisfactory?\"\n\"Unsatisfactory, Venerable Sir.\"\n\"Is what is impermanent, unsatisfactory, and subject to change fit to be regarded thus: 'This is mine, this I am, this is my self'?\"\n\"No, Venerable Sir.\"\n\"Therefore, if one were not to cling to that which is impermanent, unsatisfactory, and subject to change, would such a view arise: 'The self is material, free from affliction after death'?\"\n\"No, Venerable Sir.\"\n\n\"Thus, monks, when suffering is present, clinging to suffering, and stubbornly adhering to suffering, does such a view—'The self is material, free from affliction after death'—therefore become a valid understanding?\"\n\"No, Venerable Sir.\"\n\"When feeling is present, clinging to feeling, and stubbornly adhering to feeling, does such a view—'The self is material, free from affliction after death'—therefore become a valid understanding?\"\n\"No, Venerable Sir.\"\n\"When perception is present, clinging to perception, and stubbornly adhering to perception, does such a view—'The self is material, free from affliction after death'—therefore become a valid understanding?\"\n\"No, Venerable Sir.\"\n\"When volitional formations are present, clinging to volitional formations, and stubbornly adhering to volitional formations, does such a view—'The self is material, free from affliction after death'—therefore become a valid understanding?\"\n\"No, Venerable Sir.\"\n\"When consciousness is present, clinging to consciousness, and stubbornly adhering to consciousness, does such a view—'The self is material, free from affliction after death'—therefore become a valid understanding?\"\n\"No, Venerable Sir.\"\n\n\"Thus, monks, when suffering is present, clinging to suffering, and stubbornly adhering to suffering, such a view arises: 'The self is material, free from affliction after death'.\"",
      "sinhala": "සැවැත්නුවරදී දේශනා කරන ලද්දකි.\n\n“මහණෙනි, කුමක් පවතින කල්හිද, කුමක් උපාදාන කරගෙනද, කුමක් දැඩිව අල්ලාගෙනද, ‘රූපවත් ආත්මයක් ඇත, මරණින් පසු නිරෝගී වේ’ යන මේ දෘෂ්ටිය හටගන්නේ?” “පින්වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කරගෙන ඇත්තාහ. භාග්‍යවතුන් වහන්සේම මෙය පැහැදිලි කරනු මැනව.” “මහණෙනි, රූපය පවතින කල්හි, රූපය උපාදාන කරගෙන, රූපය දැඩිව අල්ලාගෙන, ‘රූපවත් ආත්මයක් ඇත, මරණින් පසු නිරෝගී වේ’ යන මේ දෘෂ්ටිය හටගන්නේය. වේදනාව පවතින කල්හිද... සංඥාව පවතින කල්හිද... සංස්කාර පවතින කල්හිද... විඤ්ඤාණය පවතින කල්හි, විඤ්ඤාණය උපාදාන කරගෙන, විඤ්ඤාණය දැඩිව අල්ලාගෙන, ‘රූපවත් ආත්මයක් ඇත, මරණින් පසු නිරෝගී වේ’ යන මේ දෘෂ්ටිය හටගන්නේය.”\n\n“මහණෙනි, මේ ගැන කුමක් සිතන්නෙහිද? රූපය නිත්‍යද, අනිත්‍යද?” “අනිත්‍යය, පින්වහන්ස.” “(අනිත්‍ය වූ යමක් වේද, එය දුක් ද? දුක්ය, පින්වහන්ස. අනිත්‍ය වූ දුක් වූ යමක් වේද, එය වෙනස්වන සුළු ධර්මයක් ද? වෙනස්වන සුළු ධර්මයකි, පින්වහන්ස.) එසේ වෙනස්වන සුළු ධර්මයක් වන (රූපය) උපාදාන නොකර, ‘රූපවත් ආත්මයක් ඇත, මරණින් පසු නිරෝගී වේ’ යන මේ දෘෂ්ටිය හටගන්නේද?” “නොවේ, පින්වහන්ස.” “මහණෙනි, එසේ හෙයින්, දුක පවතින කල්හි, දුක උපාදාන කරගෙන, දුක දැඩිව අල්ලාගෙන, ‘රූපවත් ආත්මයක් ඇත, මරණින් පසු නිරෝගී වේ’ යන මේ දෘෂ්ටිය හටගන්නේද?” “වේදනාව... (සංඥාව, සංස්කාර, විඤ්ඤාණය සම්බන්ධයෙන් ද එසේමය.) නොවේ, පින්වහන්ස.” “මහණෙනි, එසේ හෙයින්, දුක පවතින කල්හි, දුක උපාදාන කරගෙන, දුක දැඩිව අල්ලාගෙන, ‘රූපවත් ආත්මයක් ඇත, මරණින් පසු නිරෝගී වේ’ යන මේ දෘෂ්ටිය හටගන්නේය.”",
      "paliTitle": "Rūpīattāsuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 243,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘arūpī attā hoti arogo paraṃ maraṇā’’’ti? (Peyyālo) vīsatimaṃ.",
      "english": "At Sāvatthī. “Monks, when what is present, grasping what, and firmly adhering to what, does such a view arise: ‘The self is without form and free from ailment after death’?”",
      "sinhala": "සා­වැ­ත්­ථි­යෙහි වැඩ සිටිමින් භාග්‍ය​වතුන් වහන්සේ භික්ෂූන් අමතා මෙසේ වදාළ සේක:\n“භික්ෂූනි, කවරක් පවත්නා කල්හිද, කවරක් උපාදාන කොටගෙනද, කවරක් දැඩිව අල්ලාගෙනද, ‘මරණින් පසු ආත්මය අරූපීව, නිරෝගීව පවතී’ යන මෙබඳු දෘෂ්ටියක් හටගන්නේද?”",
      "paliTitle": "Arūpīattāsuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 244,
      "pali": "Sāvatthinidānaṃ. ‘‘Rūpī ca arūpī ca attā hoti arogo paraṃ maraṇā’’ti…pe…. Ekavīsatimaṃ.",
      "english": "The self, having form and being formless, is free from affliction after death.",
      "sinhala": "සැවැත් නුවරදී වදාළ, “මරණින් මතු ආත්මය රූපී වූ ද, අරූපී වූ ද වේ, නිරෝගී ද වේ” ආදී වශයෙන් වූ විසි එක්වැනි සූත්‍රයයි.",
      "paliTitle": "Rūpīcaarūpīcaattāsuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 245,
      "pali": "‘‘Neva rūpī nārūpī attā hoti arogo paraṃ maraṇā’’ti…pe…. Bāvīsatimaṃ.",
      "english": "The self is neither material nor immaterial, and it is free from affliction after death.",
      "sinhala": "‘‘මරණින් පසු ආත්මය රූපී නොවී, අරූපීද නොවී, නිරෝගීව පවතී’’ යැයි... විසිදෙවැන්න.",
      "paliTitle": "Nevarūpīnārūpīattāsuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 246,
      "pali": "‘‘Ekantasukhī attā hoti arogo paraṃ maraṇā’’ti…pe…. Tevīsatimaṃ.",
      "english": "The self is absolutely blissful and free from affliction after death.",
      "sinhala": "මරණයෙන් පසුව ආත්මය ඒකාන්තයෙන්ම සුවපත් වන අතර නිරෝගී වේ. විසිතුන්වැන්න.",
      "paliTitle": "Ekantasukhīsuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 247,
      "pali": "‘‘Ekantadukkhī attā hoti arogo paraṃ maraṇā’’ti…pe…. Catuvīsatimaṃ.",
      "english": "The self is utterly steeped in suffering, yet healthy after death…",
      "sinhala": "ආත්මය ඒකාන්තයෙන්ම දුක් විඳින්නකි; මරණින් මතු නිරෝගී වේ.",
      "paliTitle": "Ekantadukkhīsuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 248,
      "pali": "‘‘Sukhadukkhī attā hoti arogo paraṃ maraṇā’’ti…pe…. Pañcavīsatimaṃ.",
      "english": "The self is subject to both pleasure and pain and is free from illness after death.",
      "sinhala": "මරණින් මතු ආත්මය සැප දුක් විඳින්නක් වන්නේය, නිරෝගී වන්නේය. විසිපස්වැන්නයි.",
      "paliTitle": "Sukhadukkhīsuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 249,
      "pali": "‘‘Adukkhamasukhī attā hoti arogo paraṃ maraṇā’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe… ‘‘rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’ti. Vedanāya sati… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dukkhe sati, dukkhaṃ upādāya, dukkhaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, dukkhe sati, dukkhaṃ upādāya, dukkhaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti. Chabbīsatimaṃ. Dutiyapeyyālo. Tassuddānaṃ – Vātaṃ etaṃ mama so, attā no ca me siyā; Natthi karoto hetu ca, mahādiṭṭhena aṭṭhamaṃ. Sassato asassato ceva, antānantavā ca vuccati; Taṃ jīvaṃ aññaṃ jīvañca, tathāgatena cattāro. Rūpī attā hoti, arūpī ca attā hoti; Rūpī ca arūpī ca attā hoti; Neva rūpī nārūpī attā hoti, ekantasukhī attā hoti. Ekantadukkhī attā hoti, sukhadukkhī attā hoti; Adukkhamasukhī attā hoti, arogo paraṃ maraṇāti; Ime chabbīsati suttā, dutiyavārena desitā.",
      "english": "“Is it that the self is neither suffering nor happy, and healthy after death?”\n\n“Venerable Sir, our teachings have the Blessed One as their root, their guide, their refuge. It would be good if the Blessed One himself would clarify the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.”\n\n“Indeed, monks, when form exists, taking form as a basis, firmly adhering to form, such a view arises: ‘The self is neither suffering nor happy, and healthy after death.’ When feeling exists, taking feeling as a basis, firmly adhering to feeling, such a view arises: ‘The self is neither suffering nor happy, and healthy after death.’ When perception exists, taking perception as a basis, firmly adhering to perception, such a view arises: ‘The self is neither suffering nor happy, and healthy after death.’ When mental formations exist, taking mental formations as a basis, firmly adhering to mental formations, such a view arises: ‘The self is neither suffering nor happy, and healthy after death.’ When consciousness exists, taking consciousness as a basis, firmly adhering to consciousness, such a view arises: ‘The self is neither suffering nor happy, and healthy after death.’\n\n“What do you think, monks, is form permanent or impermanent?”\n“Impermanent, Venerable Sir.”\n“If impermanent, is it suffering or happiness?”\n“Suffering, Venerable Sir.”\n“If it is impermanent, suffering, and subject to change, would such a view arise without taking it as a basis: ‘The self is neither suffering nor happy, and healthy after death’?”\n“No, Venerable Sir.”\n“Therefore, monks, when suffering exists, taking suffering as a basis, firmly adhering to suffering, such a view arises: ‘The self is neither suffering nor happy, and healthy after death.’\n\n“Is feeling permanent or impermanent?”\n“Impermanent, Venerable Sir.”\n“If impermanent, is it suffering or happiness?”\n“Suffering, Venerable Sir.”\n“If it is impermanent, suffering, and subject to change, would such a view arise without taking it as a basis: ‘The self is neither suffering nor happy, and healthy after death’?”\n“No, Venerable Sir.”\n\n“Is perception permanent or impermanent?”\n“Impermanent, Venerable Sir.”\n“If impermanent, is it suffering or happiness?”\n“Suffering, Venerable Sir.”\n“If it is impermanent, suffering, and subject to change, would such a view arise without taking it as a basis: ‘The self is neither suffering nor happy, and healthy after death’?”\n“No, Venerable Sir.”\n\n“Are mental formations permanent or impermanent?”\n“Impermanent, Venerable Sir.”\n“If impermanent, is it suffering or happiness?”\n“Suffering, Venerable Sir.”\n“If it is impermanent, suffering, and subject to change, would such a view arise without taking it as a basis: ‘The self is neither suffering nor happy, and healthy after death’?”\n“No, Venerable Sir.”\n\n“Is consciousness permanent or impermanent?”\n“Impermanent, Venerable Sir.”\n“If impermanent, is it suffering or happiness?”\n“Suffering, Venerable Sir.”\n“If it is impermanent, suffering, and subject to change, would such a view arise without taking it as a basis: ‘The self is neither suffering nor happy, and healthy after death’?”\n“No, Venerable Sir.”\n“Therefore, monks, when suffering exists, taking suffering as a basis, firmly adhering to suffering, such a view arises: ‘The self is neither suffering nor happy, and healthy after death.’\n\nThis concludes the twenty-sixth discourse. This is the Second Repetition Section. Its summary is as follows: ‘This wind is mine’; ‘The self should not be mine’; ‘There is no cause for action’; ‘The eighth by way of great view’. ‘Eternal, and not eternal’; ‘Finite and infinite’; ‘That is the soul, and another is the body’; ‘The four by the Tathāgata’. ‘The self is material’; ‘And the self is immaterial’; ‘The self is material and immaterial’; ‘The self is neither material nor immaterial’; ‘The self is exclusively happy’. ‘The self is exclusively suffering’; ‘The self is happy and suffering’; ‘The self is neither suffering nor happy, and healthy after death’. These twenty-six discourses were presented in the second series of repetitions.",
      "sinhala": "\"මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේද?\"\n\nස්වාමීනි, ධර්මයන් භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තේය, භාග්‍යවතුන් වහන්සේ නායක කොට ඇත්තේය, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තේය. ස්වාමීනි, භාග්‍යවතුන් වහන්සේම මේ ප්‍රකාශිත කරුණෙහි අර්ථය විභාග කරනු මැනව. භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණය කොට භික්ෂූහු එය සිත්හි රඳවා ගන්නේය.\n\nමහණෙනි, රූපය ඇති කල්හි, රූපය උපදවාගෙන, රූපය තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී. වේදනාව ඇති කල්හි, වේදනාව උපදවාගෙන, වේදනාව තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී. සංඥාව ඇති කල්හි, සංඥාව උපදවාගෙන, සංඥාව තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී. සංස්කාර ඇති කල්හි, සංස්කාර උපදවාගෙන, සංස්කාර තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී. විඤ්ඤාණය ඇති කල්හි, විඤ්ඤාණය උපදවාගෙන, විඤ්ඤාණය තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී.\n\nමහණෙනි, මේ ගැන කුමක් සිතන්නෙහිද, රූපය නිත්‍යද අනිත්‍යද?\n\nඅනිත්‍යය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, එය දුක් ද සැප ද?\n\nදුක්ය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වන ස්වභාව ඇති නම්, එය නොඇලී සිටියදීත්, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගන්නේද?\n\nඑසේ නොවේ, භන්තේ.\n\nමහණෙනි, මෙසේ දුක ඇති කල්හි, දුක උපදවාගෙන, දුක තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී.\n\nවේදනාව නිත්‍යද අනිත්‍යද?\n\nඅනිත්‍යය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, එය දුක් ද සැප ද?\n\nදුක්ය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වන ස්වභාව ඇති නම්, එය නොඇලී සිටියදීත්, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගන්නේද?\n\nඑසේ නොවේ, භන්තේ.\n\nමහණෙනි, මෙසේ දුක ඇති කල්හි, දුක උපදවාගෙන, දුක තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී.\n\nසංඥාව නිත්‍යද අනිත්‍යද?\n\nඅනිත්‍යය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, එය දුක් ද සැප ද?\n\nදුක්ය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වන ස්වභාව ඇති නම්, එය නොඇලී සිටියදීත්, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගන්නේද?\n\nඑසේ නොවේ, භන්තේ.\n\nමහණෙනි, මෙසේ දුක ඇති කල්හි, දුක උපදවාගෙන, දුක තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී.\n\nසංස්කාර නිත්‍යද අනිත්‍යද?\n\nඅනිත්‍යය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, එය දුක් ද සැප ද?\n\nදුක්ය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වන ස්වභාව ඇති නම්, එය නොඇලී සිටියදීත්, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගන්නේද?\n\nඑසේ නොවේ, භන්තේ.\n\nමහණෙනි, මෙසේ දුක ඇති කල්හි, දුක උපදවාගෙන, දුක තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී.\n\nවිඤ්ඤාණය නිත්‍යද අනිත්‍යද?\n\nඅනිත්‍යය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, එය දුක් ද සැප ද?\n\nදුක්ය, භන්තේ.\n\nයමක් අනිත්‍ය නම්, දුක් නම්, වෙනස් වන ස්වභාව ඇති නම්, එය නොඇලී සිටියදීත්, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගන්නේද?\n\nඑසේ නොවේ, භන්තේ.\n\nමහණෙනි, මෙසේ දුක ඇති කල්හි, දුක උපදවාගෙන, දුක තදින් අල්වාගෙන, 'මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන මෙවන් දෘෂ්ටියක් හටගනී.\n\nවිසි හයවන සූත්‍රයයි. දෙවෙනි පෙය්යාලයයි. එහි උද්දානය මෙසේය:\n\n'වාතය, මේ මගේ ආත්මය' යන දෘෂ්ටියත්, 'ආත්මයක් මට නොතිබිය යුතුයි' යන දෘෂ්ටියත්, 'ක්‍රියා කිරීමට හේතුවක් නැතැයි' යන දෘෂ්ටියත්, මහත් වූ දෘෂ්ටීන් අතර අටවැන්නත්; 'ශාශ්වත දෘෂ්ටියත්, උච්ඡේද දෘෂ්ටියත්, ලෝකයේ සීමා සහිත බව හෝ අසීමිත බව පිළිබඳ දෘෂ්ටියත්; 'ජීවය එයමය, නැතහොත් වෙනස්ය' යන දෘෂ්ටියත්, තථාගතයන් වහන්සේ පිළිබඳ සතරක් වූ දෘෂ්ටිත් (මෙහි අඩංගුය).\n\n'ආත්මය රූපී වන්නේය, ආත්මය අරූපී වන්නේය, ආත්මය රූපීද අරූපීද වන්නේය, ආත්මය රූපීද නොවේ අරූපීද නොවේ, ආත්මය එකාන්තයෙන් සුඛී වන්නේය' යන දෘෂ්ටියත්; 'ආත්මය එකාන්තයෙන් දුක්ඛී වන්නේය, ආත්මය සුඛීද දුක්ඛීද වන්නේය; මරණින් මත්තෙහි ආත්මය දුක්ද නොවූ, සැපද නොවූ, කිසිදු ආබාධයකින් තොර වූවක් වන්නේය' යන දෘෂ්ටියත් (මෙහි අඩංගුය).\n\nමේ විසි හය සූත්‍ර දෙවෙනි වාරයෙන් දේශනා කරන ලදී.",
      "paliTitle": "Adukkhamasukhīsuttaṃ",
      "vagga": "Dutiyagamanavaggo"
    },
    {
      "number": 250,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe…. ‘‘Rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – na vātā vāyanti…pe… vedanāya sati… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, yadaniccaṃ taṃ dukkhaṃ. Tasmiṃ sati, tadupādāya, evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’’’ti. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, yadaniccaṃ taṃ dukkhaṃ. Tasmiṃ sati, tadupādāya evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’’ti. Paṭhamaṃ.",
      "english": "In Sāvatthī.\n\n“Monks, when what exists, by clinging to what, and by adhering to what, does such a view arise: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar’?”\n\n“Venerable Sir, our teachings are rooted in the Blessed One, guided by the Blessed One, and have the Blessed One as their refuge. It would be good if the Blessed One himself would clarify the meaning of these statements. Having heard it from the Blessed One, the monks will remember it.”\n\n“Monks, when form exists, by clinging to form, by adhering to form, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar.’ When feeling exists, by clinging to feeling, by adhering to feeling, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar.’ When perception exists, by clinging to perception, by adhering to perception, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar.’ When mental formations exist, by clinging to mental formations, by adhering to mental formations, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar.’ When consciousness exists, by clinging to consciousness, by adhering to consciousness, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar’.”\n\n“What do you think, monks, is form permanent or impermanent?” “Impermanent, Venerable Sir.” “And what is impermanent, is it suffering or happiness?” “Suffering, Venerable Sir.” “And what is impermanent, suffering, and subject to change, would such a view arise without clinging to it: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar’?” “No, Venerable Sir.” “Therefore, monks, what is impermanent is suffering. When that exists, by clinging to that, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar’.”\n\n“Is feeling permanent or impermanent? Is perception permanent or impermanent? Are mental formations permanent or impermanent? Is consciousness permanent or impermanent?” “Impermanent, Venerable Sir.” “And what is impermanent, is it suffering or happiness?” “Suffering, Venerable Sir.” “And what is impermanent, suffering, and subject to change, would such a view arise without clinging to it: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar’?” “No, Venerable Sir.” “Therefore, monks, what is impermanent is suffering. When that exists, by clinging to that, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set, but all is fixed like a pillar’.”",
      "sinhala": "සැවැත්නුවරදී.\n\n\"මහණෙනි, කුමක් කල්හි පවතීද, කුමක් උපදවාගෙනද, කුමක් දැඩි කොටගෙනද, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගන්නේද?\"\n\nස්වාමීනි, අපගේ ධර්මයෝ භාග්‍​යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍​යවතුන් වහන්සේ නායක කොට ඇත්තාහ, භාග්‍​යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. ස්වාමීනි, භාග්‍​යවතුන් වහන්සේටම මේ ප්‍ර​කාශයේ අර්ථය පැහැදිලි කිරීමට සුදුසුය. භාග්‍​යවතුන් වහන්සේගෙන් අසා භික්ෂූහු එය දරාගන්නාහුය.\n\n\"මහණෙනි, රූපය පවතින කල්හි, රූපය උපදවාගෙන, රූපය දැඩි කොටගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගනී. වේදනාව පවතින කල්හි, වේදනාව උපදවාගෙන, වේදනාව දැඩි කොටගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගනී. සංඥාව පවතින කල්හි, සංඥාව උපදවාගෙන, සංඥාව දැඩි කොටගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගනී. සංස්කාර පවතින කල්හි, සංස්කාර උපදවාගෙන, සංස්කාර දැඩි කොටගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගනී. විඤ්ඤාණය පවතින කල්හි, විඤ්ඤාණය උපදවාගෙන, විඤ්ඤාණය දැඩි කොටගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගනී.\"\n\n\"මහණෙනි, ඔබලා මේ කුමක් සිතන්නාහුද, රූපය නිත්‍යද අනිත්‍යද?\"\n\n\"අනිත්‍යය, ස්වාමීනි. (එය) දුක් සහිතය. (එය) අනාත්මය. (එය) වෙනස්වන ස්වභාවයෙන් යුක්තය. එය උපදවා නොගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගන්නේද?\"\n\n\"නැත, ස්වාමීනි.\"\n\n\"මහණෙනි, යමක් අනිත්‍යද, එය දුක්ඛය. එය පවතින කල්හි, එය උපදවාගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගනී.\"\n\n\"වේදනාව... සංඥාව... සංස්කාර... විඤ්ඤාණය නිත්‍යද අනිත්‍යද?\"\n\n\"අනිත්‍යය, ස්වාමීනි. (එය) දුක් සහිතය. (එය) අනාත්මය. (එය) වෙනස්වන ස්වභාවයෙන් යුක්තය. එය උපදවා නොගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගන්නේද?\"\n\n\"නැත, ස්වාමීනි.\"\n\n\"මහණෙනි, යමක් අනිත්‍යද, එය දුක්ඛය. එය පවතින කල්හි, එය උපදවාගෙන, 'සුළං හමා නොයයි, ගංගා නොගලයි, ගැබිණියෝ නොවැදූයෝය, සඳු හිරු උදා නොවේ, බැස නොයයි, (සියල්ල) ඇණයක් මෙන් ස්ථාවරව පවතී' යන මෙබඳු දෘෂ්ටියක් හටගනී.\"\n\nපළමුවැන්නයි.",
      "paliTitle": "Navātasuttaṃ",
      "vagga": "Tatiyagamanavaggo"
    },
    {
      "number": 251,
      "numberRange": "251-274",
      "pali": "(Dutiyavagge viya catuvīsati suttāni pūretabbāni.) Pañcavīsatimaṃ.",
      "english": "Twenty-four discourses are to be completed in the manner of the second chapter. The Twenty-fifth.",
      "sinhala": "දෙවන වර්ගයෙහි මෙන් සූවිසි සූත්‍ර සම්පූර්ණ කළ යුත්තේය. විසිපස්වැන්න.",
      "paliTitle": "",
      "vagga": "Tatiyagamanavaggo"
    },
    {
      "number": 275,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe…. ‘‘Rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’ti. Vedanāya sati …pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti, arogo paraṃ maraṇā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, yadaniccaṃ taṃ dukkhaṃ. Tasmiṃ sati, tadupādāya evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti. ‘‘Vedanā…pe… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’…pe… vipariṇāmadhammaṃ, api nu taṃ anupādāya evaṃ diṭṭhi uppajjeyya – ‘adukkhamasukhī attā hoti, arogo paraṃ maraṇā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Iti kho, bhikkhave, yadaniccaṃ taṃ dukkhaṃ. Tasmiṃ sati, tadupādāya evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti arogo paraṃ maraṇā’’’ti. Chabbīsatimaṃ. Tatiyapeyyālo.",
      "english": "Monks, when what is present, what is clung to, and what is thoroughly apprehended, does such a view arise: 'The self is neither painful nor pleasant, healthy after death'?\n\nVenerable sir, the teachings for us have the Blessed One as their root, their guide, their refuge. It would be excellent if the Blessed One himself would explain the meaning of these words. Having heard it from the Blessed One, the monks will remember it.\n\nMonks, when form is present, clinging to form, and thoroughly apprehending form, such a view arises: 'The self is neither painful nor pleasant, healthy after death'. When feeling is present, clinging to feeling, and thoroughly apprehending feeling, such a view arises: 'The self is neither painful nor pleasant, healthy after death'. When perception is present, clinging to perception, and thoroughly apprehending perception, such a view arises: 'The self is neither painful nor pleasant, healthy after death'. When mental formations are present, clinging to mental formations, and thoroughly apprehending mental formations, such a view arises: 'The self is neither painful nor pleasant, healthy after death'. When consciousness is present, clinging to consciousness, and thoroughly apprehending consciousness, such a view arises: 'The self is neither painful nor pleasant, healthy after death'.\n\nWhat do you think, monks, is form permanent or impermanent?\nImpermanent, venerable sir.\nAnd is that which is impermanent, suffering or happiness?\nSuffering, venerable sir.\nAnd is that which is impermanent, suffering, and subject to change, something without clinging to which such a view would arise: 'The self is neither painful nor pleasant, healthy after death'?\nNo, venerable sir.\nTherefore, monks, what is impermanent, that is suffering. When that is present, by clinging to that, such a view arises: 'The self is neither painful nor pleasant, healthy after death'.\n\nWhat do you think, monks, is feeling permanent or impermanent?\nImpermanent, venerable sir.\nAnd is that which is impermanent, suffering or happiness?\nSuffering, venerable sir.\nAnd is that which is impermanent, suffering, and subject to change, something without clinging to which such a view would arise: 'The self is neither painful nor pleasant, healthy after death'?\nNo, venerable sir.\nTherefore, monks, what is impermanent, that is suffering. When that is present, by clinging to that, such a view arises: 'The self is neither painful nor pleasant, healthy after death'.\n\nWhat do you think, monks, is perception permanent or impermanent?\nImpermanent, venerable sir.\nAnd is that which is impermanent, suffering or happiness?\nSuffering, venerable sir.\nAnd is that which is impermanent, suffering, and subject to change, something without clinging to which such a view would arise: 'The self is neither painful nor pleasant, healthy after death'?\nNo, venerable sir.\nTherefore, monks, what is impermanent, that is suffering. When that is present, by clinging to that, such a view arises: 'The self is neither painful nor pleasant, healthy after death'.\n\nWhat do you think, monks, are mental formations permanent or impermanent?\nImpermanent, venerable sir.\nAnd are those which are impermanent, suffering or happiness?\nSuffering, venerable sir.\nAnd are those which are impermanent, suffering, and subject to change, something without clinging to which such a view would arise: 'The self is neither painful nor pleasant, healthy after death'?\nNo, venerable sir.\nTherefore, monks, what is impermanent, that is suffering. When that is present, by clinging to that, such a view arises: 'The self is neither painful nor pleasant, healthy after death'.\n\nWhat do you think, monks, is consciousness permanent or impermanent?\nImpermanent, venerable sir.\nAnd is that which is impermanent, suffering or happiness?\nSuffering, venerable sir.\nAnd is that which is impermanent, suffering, and subject to change, something without clinging to which such a view would arise: 'The self is neither painful nor pleasant, healthy after death'?\nNo, venerable sir.\nTherefore, monks, what is impermanent, that is suffering. When that is present, by clinging to that, such a view arises: 'The self is neither painful nor pleasant, healthy after death'.",
      "sinhala": "සැවැත් නුවරදී දේශනා කරන ලදී.\n\nභික්ෂූනි, කුමක් පවත්නා කල්හි නම්, කුමක් ඇසුරු කොටගෙන නම්, කුමක් දැඩිව අල්ලාගෙන නම් ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගන්නේ ද? ස්වාමීනි, භාග්‍යවතුන් වහන්සේ මූලික කොට ඇති ධර්මයෝ අපට වෙති. භාග්‍යවතුන් වහන්සේ විසින් නායකත්වය දෙන ලද ධර්මයෝ අපට වෙති. භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇති ධර්මයෝ අපට වෙති. භාග්‍යවතුන් වහන්සේ යම් ධර්මයක් දේශනා කරන සේක් නම් එය දැනගන්නට කැමැත්තෝ වෙමු. භාග්‍යවතුන් වහන්සේ වදාරණ සේක්වා! භික්ෂූනි, රූපය පවත්නා කල්හි, රූපය ඇසුරු කොටගෙන, රූපය දැඩිව අල්ලාගෙන ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගනී. වේදනාව පවත්නා කල්හි, වේදනාව ඇසුරු කොටගෙන, වේදනාව දැඩිව අල්ලාගෙන ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගනී. සංඥාව පවත්නා කල්හි, සංඥාව ඇසුරු කොටගෙන, සංඥාව දැඩිව අල්ලාගෙන ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගනී. සංස්කාරයන් පවත්නා කල්හි, සංස්කාරයන් ඇසුරු කොටගෙන, සංස්කාරයන් දැඩිව අල්ලාගෙන ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගනී. විඤ්ඤාණය පවත්නා කල්හි, විඤ්ඤාණය ඇසුරු කොටගෙන, විඤ්ඤාණය දැඩිව අල්ලාගෙන ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගනී.\n\nභික්ෂූනි, ඒ කුමක් සිතන්නෙහි ද, රූපය නිත්‍ය ද, අනිත්‍ය ද? අනිත්‍ය ය, ස්වාමීනි. දුක ය, ස්වාමීනි. වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය. එසේ නම්, එය ඇසුරු නොකොට, ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගන්නේ ද? එසේ නොවේ, ස්වාමීනි. භික්ෂූනි, එහෙයින්, යමක් අනිත්‍ය ද, එය දුකකි. එය පවත්නා කල්හි, එය ඇසුරු කොටගෙන ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගනී.\n\nවේදනාව නිත්‍ය ද, අනිත්‍ය ද? අනිත්‍ය ය, ස්වාමීනි. දුක ය, ස්වාමීනි. වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය. එසේ නම්, එය ඇසුරු නොකොට, ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගන්නේ ද? එසේ නොවේ, ස්වාමීනි.\nසංඥාව නිත්‍ය ද, අනිත්‍ය ද? අනිත්‍ය ය, ස්වාමීනි. දුක ය, ස්වාමීනි. වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය. එසේ නම්, එය ඇසුරු නොකොට, ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගන්නේ ද? එසේ නොවේ, ස්වාමීනි.\nසංස්කාරයෝ නිත්‍ය ද, අනිත්‍ය ද? අනිත්‍ය ය, ස්වාමීනි. දුක ය, ස්වාමීනි. වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය. එසේ නම්, එය ඇසුරු නොකොට, ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගන්නේ ද? එසේ නොවේ, ස්වාමීනි.\nවිඤ්ඤාණය නිත්‍ය ද, අනිත්‍ය ද? අනිත්‍ය ය, ස්වාමීනි. දුක ය, ස්වාමීනි. වෙනස් වීමේ ස්වභාවයෙන් යුක්ත ය. එසේ නම්, එය ඇසුරු නොකොට, ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගන්නේ ද? එසේ නොවේ, ස්වාමීනි.\nභික්ෂූනි, එහෙයින්, යමක් අනිත්‍ය ද, එය දුකකි. එය පවත්නා කල්හි, එය ඇසුරු කොටගෙන ‘මරණින් මතු ආත්මය දුක් රහිත, සැප රහිත, රෝග රහිත වන්නේය’ යන මෙවැනි දෘෂ්ටියක් හටගනී.",
      "paliTitle": "Adukkhamasukhīsuttaṃ",
      "vagga": "Tatiyagamanavaggo"
    },
    {
      "number": 276,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti, na najjo sandanti, na gabbhiniyo vijāyanti, na candimasūriyā udenti vā apenti vā esikaṭṭhāyiṭṭhitā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe…. ‘‘Rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’ti. Vedanāya sati…pe… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘na vātā vāyanti…pe… esikaṭṭhāyiṭṭhitā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā … saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātiha, bhikkhave, yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā, oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ rūpaṃ – ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya daṭṭhabbaṃ. Yā kāci vedanā… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ – ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya daṭṭhabbaṃ. ‘‘Evaṃ passaṃ…pe… nāparaṃ itthattāyāti pajānātī’’ti. Paṭhamaṃ.",
      "english": "At Sāvatthī.\n“Monks, when what is present, clinging to what, and adhering to what, does such a view arise: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set; everything is fixed like a pillar’?”\n\n“Our teachings, venerable sir, are rooted in the Blessed One, guided by the Blessed One, and have the Blessed One as their refuge. It would be good if the Blessed One himself would explain the meaning of these words. Having heard it from the Blessed One, the monks will remember it.”\n\n“Monks, when form is present, clinging to form, and adhering to form, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set; everything is fixed like a pillar’. When feeling is present, clinging to feeling, and adhering to feeling, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set; everything is fixed like a pillar’. When perception is present, clinging to perception, and adhering to perception, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set; everything is fixed like a pillar’. When mental formations are present, clinging to mental formations, and adhering to mental formations, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set; everything is fixed like a pillar’. When consciousness is present, clinging to consciousness, and adhering to consciousness, such a view arises: ‘Winds do not blow, rivers do not flow, pregnant women do not give birth, the sun and moon do not rise or set; everything is fixed like a pillar’.”\n\n“What do you think, monks, is form permanent or impermanent?” “Impermanent, venerable sir.” “But that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “But that which is impermanent, suffering, and subject to change, is it proper to regard it as ‘This is mine, this I am, this is my self’?” “No, venerable sir.”\n\n“Is feeling permanent or impermanent?” “Impermanent, venerable sir.” “But that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “But that which is impermanent, suffering, and subject to change, is it proper to regard it as ‘This is mine, this I am, this is my self’?” “No, venerable sir.”\n\n“Is perception permanent or impermanent?” “Impermanent, venerable sir.” “But that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “But that which is impermanent, suffering, and subject to change, is it proper to regard it as ‘This is mine, this I am, this is my self’?” “No, venerable sir.”\n\n“Are mental formations permanent or impermanent?” “Impermanent, venerable sir.” “But that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “But that which is impermanent, suffering, and subject to change, is it proper to regard it as ‘This is mine, this I am, this is my self’?” “No, venerable sir.”\n\n“Is consciousness permanent or impermanent?” “Impermanent, venerable sir.” “But that which is impermanent, is it suffering or happiness?” “Suffering, venerable sir.” “But that which is impermanent, suffering, and subject to change, is it proper to regard it as ‘This is mine, this I am, this is my self’?” “No, venerable sir.”\n\n“Therefore, monks, whatever form there is—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all form should be seen as it actually is with right wisdom: ‘This is not mine, this I am not, this is not my self’.”\n\n“Whatever feeling there is—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all feeling should be seen as it actually is with right wisdom: ‘This is not mine, this I am not, this is not my self’.”\n\n“Whatever perception there is—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all perception should be seen as it actually is with right wisdom: ‘This is not mine, this I am not, this is not my self’.”\n\n“Whatever mental formations there are—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all mental formations should be seen as it actually is with right wisdom: ‘This is not mine, this I am not, this is not my self’.”\n\n“Whatever consciousness there is—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all consciousness should be seen as it actually is with right wisdom: ‘This is not mine, this I am not, this is not my self’.”\n\n“Seeing thus, a noble disciple becomes disenchanted with form, disenchanted with feeling, disenchanted with perception, disenchanted with mental formations, disenchanted with consciousness. Being disenchanted, he becomes dispassionate. Through dispassion, he is liberated. When liberated, there is the knowledge: ‘Liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being’.”",
      "sinhala": "සැවැත්නුවරදී මේ සූත්‍රය දේශනා කරන ලදී.\n\n“මහණෙනි, කුමක් පවතින කල්හි, කුමක් උපාදානය කරගෙන, කුමක් අභිනිවේශ වී මෙබඳු දෘෂ්ටියක් හටගනීද? – ‘සුළං නොහමයි, ගංගා ගලා නොබසී, ගැබිනි මව්වරු දරුවන් නොවසවති, හිරු සඳු උදාවන්නේ හෝ බැස යන්නේ හෝ නැත, සියල්ල කණු මෙන් ස්ථාවරව පවතියි’යි.”\n\n“වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල් කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ ප්‍රධාන කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේ සරණ කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ මෙය පැහැදිලි කරන්නේ නම් මැනවි. භාග්‍යවතුන් වහන්සේගෙන් ශ්‍රවණ කොට භික්ෂූහු එය සිත්හි දරාගන්නාහ.”\n\n“මහණෙනි, රූපය පවතින කල්හි, රූපය උපාදානය කරගෙන, රූපය අභිනිවේශ වී මෙබඳු දෘෂ්ටියක් හටගනී – ‘සුළං නොහමයි, ගංගා ගලා නොබසී, ගැබිනි මව්වරු දරුවන් නොවසවති, හිරු සඳු උදාවන්නේ හෝ බැස යන්නේ හෝ නැත, සියල්ල කණු මෙන් ස්ථාවරව පවතියි’යි. වේදනාව පවතින කල්හි, වේදනාව උපාදානය කරගෙන, වේදනාව අභිනිවේශ වී මෙබඳු දෘෂ්ටියක් හටගනී – ‘සුළං නොහමයි, ගංගා ගලා නොබසී, ගැබිනි මව්වරු දරුවන් නොවසවති, හිරු සඳු උදාවන්නේ හෝ බැස යන්නේ හෝ නැත, සියල්ල කණු මෙන් ස්ථාවරව පවතියි’යි. සංඥාව පවතින කල්හි, සංඥාව උපාදානය කරගෙන, සංඥාව අභිනිවේශ වී මෙබඳු දෘෂ්ටියක් හටගනී – ‘සුළං නොහමයි, ගංගා ගලා නොබසී, ගැබිනි මව්වරු දරුවන් නොවසවති, හිරු සඳු උදාවන්නේ හෝ බැස යන්නේ හෝ නැත, සියල්ල කණු මෙන් ස්ථාවරව පවතියි’යි. සංස්කාර පවතින කල්හි, සංස්කාර උපාදානය කරගෙන, සංස්කාර අභිනිවේශ වී මෙබඳු දෘෂ්ටියක් හටගනී – ‘සුළං නොහමයි, ගංගා ගලා නොබසී, ගැබිනි මව්වරු දරුවන් නොවසවති, හිරු සඳු උදාවන්නේ හෝ බැස යන්නේ හෝ නැත, සියල්ල කණු මෙන් ස්ථාවරව පවතියි’යි. විඤ්ඤාණය පවතින කල්හි, විඤ්ඤාණය උපාදානය කරගෙන, විඤ්ඤාණය අභිනිවේශ වී මෙබඳු දෘෂ්ටියක් හටගනී – ‘සුළං නොහමයි, ගංගා ගලා නොබසී, ගැබිනි මව්වරු දරුවන් නොවසවති, හිරු සඳු උදාවන්නේ හෝ බැස යන්නේ හෝ නැත, සියල්ල කණු මෙන් ස්ථාවරව පවතියි’යි.”\n\n“මහණෙනි, ඒ කුමක් සිතන්නෙහිද, රූපය නිත්‍යද, අනිත්‍යද?”\n“අනිත්‍යයි, වහන්ස.”\n“යමක් අනිත්‍යද, එය දුක්ද සැපද?”\n“දුකකි, වහන්ස.”\n“යමක් අනිත්‍යද, දුක්ද, වෙනස්වන ස්වභාවයෙන් යුක්තද, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?”\n“නොවේ, වහන්ස.”\n\n“වේදනාව නිත්‍යද, අනිත්‍යද, මහණෙනි?”\n“අනිත්‍යයි, වහන්ස.”\n“යමක් අනිත්‍යද, එය දුක්ද සැපද?”\n“දුකකි, වහන්ස.”\n“යමක් අනිත්‍යද, දුක්ද, වෙනස්වන ස්වභාවයෙන් යුක්තද, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?”\n“නොවේ, වහන්ස.”\n\n“සංඥාව නිත්‍යද, අනිත්‍යද, මහණෙනි?”\n“අනිත්‍යයි, වහන්ස.”\n“යමක් අනිත්‍යද, එය දුක්ද සැපද?”\n“දුකකි, වහන්ස.”\n“යමක් අනිත්‍යද, දුක්ද, වෙනස්වන ස්වභාවයෙන් යුක්තද, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?”\n“නොවේ, වහන්ස.”\n\n“සංස්කාර නිත්‍යද, අනිත්‍යද, මහණෙනි?”\n“අනිත්‍යයි, වහන්ස.”\n“යමක් අනිත්‍යද, එය දුක්ද සැපද?”\n“දුකකි, වහන්ස.”\n“යමක් අනිත්‍යද, දුක්ද, වෙනස්වන ස්වභාවයෙන් යුක්තද, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?”\n“නොවේ, වහන්ස.”\n\n“විඤ්ඤාණය නිත්‍යද, අනිත්‍යද, මහණෙනි?”\n“අනිත්‍යයි, වහන්ස.”\n“යමක් අනිත්‍යද, එය දුක්ද සැපද?”\n“දුකකි, වහන්ස.”\n“යමක් අනිත්‍යද, දුක්ද, වෙනස්වන ස්වභාවයෙන් යුක්තද, ‘මෙය මාගේය, මේ මම වෙමි, මේ මාගේ ආත්මයයි’ කියා එය දැකීම සුදුසුද?”\n“නොවේ, වහන්ස.”\n\n“එබැවින් මහණෙනි, යම්කිසි රූපයක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික හෝ බාහිර වේවා, ස්ථූල හෝ සියුම් වේවා, පහත් හෝ උසස් වේවා, දුර හෝ ළඟ වේවා, ඒ සියලු රූප: ‘මේ මාගේ නොවේ, මේ මම නොවේ, මේ මාගේ ආත්මය නොවේ’ යැයි මෙසේ මෙය යථාර්ථය පරිදි නුවණින් දැක්ක යුතුයි.\n\nයම්කිසි වේදනාවක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික හෝ බාහිර වේවා, ස්ථූල හෝ සියුම් වේවා, පහත් හෝ උසස් වේවා, දුර හෝ ළඟ වේවා, ඒ සියලු වේදනා: ‘මේ මාගේ නොවේ, මේ මම නොවේ, මේ මාගේ ආත්මය නොවේ’ යැයි මෙසේ මෙය යථාර්ථය පරිදි නුවණින් දැක්ක යුතුයි.\n\nයම්කිසි සංඥාවක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික හෝ බාහිර වේවා, ස්ථූල හෝ සියුම් වේවා, පහත් හෝ උසස් වේවා, දුර හෝ ළඟ වේවා, ඒ සියලු සංඥා: ‘මේ මාගේ නොවේ, මේ මම නොවේ, මේ මාගේ ආත්මය නොවේ’ යැයි මෙසේ මෙය යථාර්ථය පරිදි නුවණින් දැක්ක යුතුයි.\n\nයම්කිසි සංස්කාර සමූහයක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික හෝ බාහිර වේවා, ස්ථූල හෝ සියුම් වේවා, පහත් හෝ උසස් වේවා, දුර හෝ ළඟ වේවා, ඒ සියලු සංස්කාර: ‘මේ මාගේ නොවේ, මේ මම නොවේ, මේ මාගේ ආත්මය නොවේ’ යැයි මෙසේ මෙය යථාර්ථය පරිදි නුවණින් දැක්ක යුතුයි.\n\nයම්කිසි විඤ්ඤාණයක් අතීත, අනාගත, වර්තමාන වේවා, අධ්‍යාත්මික හෝ බාහිර වේවා, ස්ථූල හෝ සියුම් වේවා, පහත් හෝ උසස් වේවා, දුර හෝ ළඟ වේවා, ඒ සියලු විඤ්ඤාණ: ‘මේ මාගේ නොවේ, මේ මම නොවේ, මේ මාගේ ආත්මය නොවේ’ යැයි මෙසේ මෙය යථාර්ථය පරිදි නුවණින් දැක්ක යුතුයි.\n\nමහණෙනි, මෙසේ දකින ශ්‍රාවක ආර්යයා රූපය කෙරෙහි කලකිරෙයි. වේදනාව කෙරෙහි කලකිරෙයි. සංඥාව කෙරෙහි කලකිරෙයි. සංස්කාර කෙරෙහි කලකිරෙයි. විඤ්ඤාණය කෙරෙහි කලකිරෙයි. කලකිරෙන විට නොඇලෙයි. නොඇලෙන විට (සිත) මිදෙයි. මිදුණු කල්හි මිදුණේ යැයි ඥානයක් ඇති වෙයි. ‘උපත ක්‍ෂය විය, බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මේ සඳහා අන් කිසිවක් නැතැයි’ ප්‍රත්‍යක්ෂයෙන්ම අවබෝධ කර ගනී.”\n\nපළමුවන සූත්‍රයයි.",
      "paliTitle": "Navātasuttaṃ",
      "vagga": "Catutthagamanavaggo"
    },
    {
      "number": 277,
      "numberRange": "277-300",
      "pali": "(Dutiyavagge viya catuvīsati suttāni pūretabbāni.) Pañcavīsatimaṃ.",
      "english": "Twenty-four discourses are to be completed, just as in the second chapter. The twenty-fifth.",
      "sinhala": "දෙවන වර්ගයේ මෙන් සූත්‍ර විසිහතරක් සම්පූර්ණ කළ යුතුය. විසිපස්වැන්නයි.",
      "paliTitle": "",
      "vagga": "Catutthagamanavaggo"
    },
    {
      "number": 301,
      "pali": "Sāvatthinidānaṃ. ‘‘Kismiṃ nu kho, bhikkhave, sati, kiṃ upādāya, kiṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti, arogo paraṃ maraṇā’’’ti? Bhagavaṃmūlakā no, bhante, dhammā…pe…. ‘‘Rūpe kho, bhikkhave, sati, rūpaṃ upādāya, rūpaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti, arogo paraṃ maraṇā’ti. Vedanāya sati… saññāya sati… saṅkhāresu sati… viññāṇe sati, viññāṇaṃ upādāya, viññāṇaṃ abhinivissa evaṃ diṭṭhi uppajjati – ‘adukkhamasukhī attā hoti, arogo paraṃ maraṇā’’’ti. ‘‘Taṃ kiṃ maññatha, bhikkhave, rūpaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ, dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante ’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Vedanā… saññā… saṅkhārā… viññāṇaṃ niccaṃ vā aniccaṃ vā’’ti? ‘‘Aniccaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vā taṃ sukhaṃ vā’’ti? ‘‘Dukkhaṃ, bhante’’. ‘‘Yaṃ panāniccaṃ dukkhaṃ vipariṇāmadhammaṃ, kallaṃ nu taṃ samanupassituṃ – ‘etaṃ mama, esohamasmi, eso me attā’’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Tasmātiha, bhikkhave, yaṃ kiñci rūpaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ rūpaṃ – ‘netaṃ mama, nesohamasmi, na meso attā’ti evametaṃ yathābhūtaṃ sammappaññāya daṭṭhabbaṃ. Yā kāci vedanā… yā kāci saññā… ye keci saṅkhārā… yaṃ kiñci viññāṇaṃ atītānāgatapaccuppannaṃ ajjhattaṃ vā bahiddhā vā, oḷārikaṃ vā sukhumaṃ vā hīnaṃ vā paṇītaṃ vā yaṃ dūre santike vā, sabbaṃ viññāṇaṃ – ‘netaṃ mama, nesohamasmi, na meso attā’’’ti evametaṃ yathābhūtaṃ sammappaññāya daṭṭhabbaṃ. ‘‘Evaṃ passaṃ, bhikkhave, sutavā ariyasāvako rūpasmimpi nibbindati, vedanāyapi nibbindati, saññāyapi nibbindati, saṅkhāresupi nibbindati, viññāṇasmimpi nibbindati. Nibbindaṃ virajjati; virāgā vimuccati. Vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānātī’’ti. Chabbīsatimaṃ. Tassuddānaṃ – Purimagamane aṭṭhārasa veyyākaraṇā; Dutiyagamane chabbīsaṃ vitthāretabbāni. Tatiyagamane chabbīsaṃ vitthāretabbāni; Catutthagamane chabbīsaṃ vitthāretabbāni. ",
      "english": "Monks, when what is present, clinging to what, and adhering to what, does such a view arise: ‘The self is neither painful nor pleasant, it is healthy after death’? The monks responded, \"Venerable Sir, our teachings are rooted in the Blessed One, guided by the Blessed One, and have the Blessed One as their refuge. It would be good if the Blessed One himself would clarify the meaning of this statement. Having heard it from the Blessed One, the monks will remember it.\"\n\n\"Monks, when form is present, clinging to form, and adhering to form, such a view arises: ‘The self is neither painful nor pleasant, it is healthy after death.’ When feeling is present, clinging to feeling, and adhering to feeling, such a view arises: ‘The self is neither painful nor pleasant, it is healthy after death.’ When perception is present, clinging to perception, and adhering to perception, such a view arises: ‘The self is neither painful nor pleasant, it is healthy after death.’ When volitional formations are present, clinging to volitional formations, and adhering to volitional formations, such a view arises: ‘The self is neither painful nor pleasant, it is healthy after death.’ When consciousness is present, clinging to consciousness, and adhering to consciousness, such a view arises: ‘The self is neither painful nor pleasant, it is healthy after death.’\"\n\n\"What do you think, monks, is form permanent or impermanent?\" \"Impermanent, venerable sir.\" \"And that which is impermanent, is it suffering or happiness?\" \"Suffering, venerable sir.\" \"And that which is impermanent, suffering, and subject to change, is it fit to regard it as: ‘This is mine, this I am, this is my self’?\" \"No, venerable sir.\" \"What do you think, monks, is feeling permanent or impermanent?\" \"Impermanent, venerable sir.\" \"And that which is impermanent, is it suffering or happiness?\" \"Suffering, venerable sir.\" \"And that which is impermanent, suffering, and subject to change, is it fit to regard it as: ‘This is mine, this I am, this is my self’?\" \"No, venerable sir.\" \"What do you think, monks, is perception permanent or impermanent?\" \"Impermanent, venerable sir.\" \"And that which is impermanent, is it suffering or happiness?\" \"Suffering, venerable sir.\" \"And that which is impermanent, suffering, and subject to change, is it fit to regard it as: ‘This is mine, this I am, this is my self’?\" \"No, venerable sir.\" \"What do you think, monks, are volitional formations permanent or impermanent?\" \"Impermanent, venerable sir.\" \"And that which is impermanent, are they suffering or happiness?\" \"Suffering, venerable sir.\" \"And that which is impermanent, suffering, and subject to change, are they fit to regard as: ‘These are mine, these I am, these are my self’?\" \"No, venerable sir.\" \"What do you think, monks, is consciousness permanent or impermanent?\" \"Impermanent, venerable sir.\" \"And that which is impermanent, is it suffering or happiness?\" \"Suffering, venerable sir.\" \"And that which is impermanent, suffering, and subject to change, is it fit to regard it as: ‘This is mine, this I am, this is my self’?\" \"No, venerable sir.\"\n\n\"Therefore, monks, whatever form there is—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all form should be seen as it actually is, with right wisdom: ‘This is not mine, this I am not, this is not my self.’ Whatever feeling there is—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all feeling should be seen as it actually is, with right wisdom: ‘This is not mine, this I am not, this is not my self.’ Whatever perception there is—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all perception should be seen as it actually is, with right wisdom: ‘This is not mine, this I am not, this is not my self.’ Whatever volitional formations there are—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all volitional formations should be seen as they actually are, with right wisdom: ‘These are not mine, these I am not, these are not my self.’ Whatever consciousness there is—past, future, or present; internal or external; gross or subtle; inferior or superior; far or near—all consciousness should be seen as it actually is, with right wisdom: ‘This is not mine, this I am not, this is not my self.’\"\n\n\"Seeing thus, monks, the instructed noble disciple becomes disenchanted with form, becomes disenchanted with feeling, becomes disenchanted with perception, becomes disenchanted with volitional formations, and becomes disenchanted with consciousness. Being disenchanted, he becomes dispassionate; through dispassion, he is liberated. When liberated, there is the knowledge: ‘I am liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\"",
      "sinhala": "සැවැත් නුවරදීය.\n\nමහණෙනි, කුමක් පවතිද්දී, කුමක් දැඩිව අල්වාගෙන, කුමකට දැඩිව ඇලී සිටීමෙන් 'මරණින් මතු ආත්මය දුක්-සැප නැත්තෙක්, නිරෝගී කෙනෙක් වේ' යන මෙබඳු දෘෂ්ටියක් උපදීද? පින්වතුන් වහන්ස, අපගේ ධර්මයෝ භාග්‍යවතුන් වහන්සේ මුල්කොට ඇත්තාහ, භාග්‍යවතුන් වහන්සේගෙන් හටගත්තාහ, භාග්‍යවතුන් වහන්සේ පිහිට කොට ඇත්තාහ. භාග්‍යවතුන් වහන්සේ විසින් දේශනා කරන ලද ඒ අර්ථය අප ශ්‍රවණය කිරීමට කැමැත්තෙමු.\n\nමහණෙනි, රූපය පවතිද්දී, රූපය දැඩිව අල්වාගෙන, රූපයට දැඩිව ඇලී සිටීමෙන් 'මරණින් මතු ආත්මය දුක්-සැප නැත්තෙක්, නිරෝගී කෙනෙක් වේ' යන මෙබඳු දෘෂ්ටියක් උපදී. වේදනාව පවතිද්දී, වේදනාව දැඩිව අල්වාගෙන, වේදනාවට දැඩිව ඇලී සිටීමෙන්ද; සංඥාව පවතිද්දී, සංඥාව දැඩිව අල්වාගෙන, සංඥාවට දැඩිව ඇලී සිටීමෙන්ද; සංස්කාරයන් පවතිද්දී, සංස්කාරයන් දැඩිව අල්වාගෙන, සංස්කාරයන්ට දැඩිව ඇලී සිටීමෙන්ද; විඥානය පවතිද්දී, විඥානය දැඩිව අල්වාගෙන, විඥානයට දැඩිව ඇලී සිටීමෙන්ද 'මරණින් මතු ආත්මය දුක්-සැප නැත්තෙක්, නිරෝගී කෙනෙක් වේ' යන මෙබඳු දෘෂ්ටියක් උපදී.\n\n\"මහණෙනි, ඔබලා මේ කුමක් සිතන්නාහුද, රූපය නිත්‍යද අනිත්‍යද?\" \"පින්වතුන් වහන්ස, අනිත්‍යය.\" \"යමක් අනිත්‍යද, එය දුකක්ද සැපක්ද?\" \"පින්වතුන් වහන්ස, දුකකි.\" \"යමක් අනිත්‍යද, දුක් සහිතද, වෙනස්වීමේ ස්වභාවය ඇත්තේද, 'මෙය මගේය, මෙය මමය, මෙය මගේ ආත්මයයි' කියා එය දැකීම සුදුසුද?\" \"පින්වතුන් වහන්ස, එසේ නොවේ.\"\n\n\"වේදනාව, සංඥාව, සංස්කාරයෝ, විඥානය නිත්‍යද අනිත්‍යද?\" \"පින්වතුන් වහන්ස, අනිත්‍යය.\" \"යමක් අනිත්‍යද, එය දුකක්ද සැපක්ද?\" \"පින්වතුන් වහන්ස, දුකකි.\" \"යමක් අනිත්‍යද, දුක් සහිතද, වෙනස්වීමේ ස්වභාවය ඇත්තේද, 'මෙය මගේය, මෙය මමය, මෙය මගේ ආත්මයයි' කියා එය දැකීම සුදුසුද?\" \"පින්වතුන් වහන්ස, එසේ නොවේ.\"\n\nඑහෙයින් මහණෙනි, යම් කිසි රූපයක් අතීත, අනාගත, වර්තමාන වේවා, ඇතුළත වේවා පිටත වේවා, රළු වේවා සියුම් වේවා, හීන වේවා ප්‍රණීත වේවා, දුර වේවා ළඟ වේවා - ඒ සියලු රූපය 'මෙය මගේ නොවේ, මම නොවේ, මෙය මගේ ආත්මය නොවේ' කියා මේ අයුරින් යථාභූතව සම්‍යක් ප්‍රඥාවෙන් දැක්ක යුතුය. යම් කිසි වේදනාවක්, යම් කිසි සංඥාවක්, යම් කිසි සංස්කාරයක්, යම් කිසි විඥානයක් - අතීත, අනාගත, වර්තමාන වේවා, ඇතුළත වේවා පිටත වේවා, රළු වේවා සියුම් වේවා, හීන වේවා ප්‍රණීත වේවා, දුර වේවා ළඟ වේවා - ඒ සියල්ල 'මෙය මගේ නොවේ, මම නොවේ, මෙය මගේ ආත්මය නොවේ' කියා මේ අයුරින් යථාභූතව සම්‍යක් ප්‍රඥාවෙන් දැක්ක යුතුය.\n\n\"මහණෙනි, මෙසේ දකින ලද, අසා දැනගත් ආර්ය ශ්‍රාවක තෙම රූපය කෙරෙහිද කළකිරෙයි, වේදනාව කෙරෙහිද කළකිරෙයි, සංඥාව කෙරෙහිද කළකිරෙයි, සංස්කාරයන් කෙරෙහිද කළකිරෙයි, විඥානය කෙරෙහිද කළකිරෙයි. කළකිරෙන විට නොඇලෙයි; නොඇලීමෙන් මිදෙයි. මිදුණු කල්හි 'මම මිදුණෙමි' යන ඥානය පහළ වෙයි. 'උපත ක්ෂය විය, බ්‍රහ්මචර්යාව පූරණය කරන ලදී, කළයුතු දේ කරන ලදී, නැවත මේ භවයට පැමිණීමක් නැතැ'යි දනියි.\"\n\nවිසිහය වන සූත්‍රයයි.\nඑහි උද්දානය මෙසේය: පළමු ගමනෙහි ව්‍යාකරණ අටළොසකි; දෙවන ගමනෙහි විසිහයක් විස්තර කළ යුත්තාහ; තෙවන ගමනෙහි විසිහයක් විස්තර කළ යුත්තාහ; සිව්වන ගමනෙහි විසිහයක් විස්තර කළ යුත්තාහ.",
      "paliTitle": "Adukkhamasukhīsuttaṃ",
      "vagga": "Catutthagamanavaggo"
    }
  ],
  "footer": {
    "pali": "Diṭṭhisaṃyuttaṃ samattaṃ.",
    "english": "",
    "sinhala": ""
  }
}