{
  "id": "dn.1.13",
  "title": {
    "pali": "Tevijjasuttaṃ",
    "english": "The Discourse on the Threefold Knowledge",
    "sinhala": "ත‍්‍රිවිද්‍යා සූත‍්‍රය"
  },
  "sections": [
    {
      "number": 518,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena manasākaṭaṃ nāma kosalānaṃ brāhmaṇagāmo tadavasari. Tatra sudaṃ bhagavā manasākaṭe viharati uttarena manasākaṭassa aciravatiyā nadiyā tīre ambavane.",
      "english": "Thus have I heard. On one occasion, the Blessed One, while wandering through the Kōsala country with a large community of monks, about five hundred monks, arrived at Manasākaṭa, a brahman village belonging to the Kōsalas. There, the Blessed One dwelled at Manasākaṭa, to the north of Manasākaṭa, on the bank of the Aciravatī River, in a mango grove.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ පන්සියයක් පමණ වූ මහත් භික්‍ෂු සංඝයකු සමඟ කෝසල ජනපදයෙහි චාරිකාවේ වඩින සේක්, කෝසලවරුන්ගේ මනසාකට නම් බමුණු ගම වෙත වැඩම කළ සේක. එහි භාග්‍යවතුන් වහන්සේ මනසාකට ගමෙන් උතුරෙහි අචිරවතී නදිය අසල අඹ වනයක වැඩසිටි සේක.",
      "paliTitle": ""
    },
    {
      "number": 519,
      "pali": "Tena kho pana samayena sambahulā abhiññātā abhiññātā brāhmaṇamahāsālā manasākaṭe paṭivasanti, seyyathidaṃ – caṅkī brāhmaṇo tārukkho brāhmaṇo pokkharasāti brāhmaṇo jāṇusoṇi brāhmaṇo todeyyo brāhmaṇo aññe ca abhiññātā abhiññātā brāhmaṇamahāsālā.",
      "english": "At that time, many well-known and eminent great Brahmins were dwelling in Manasākaṭa, namely: Cankī the Brahmin, Tārukkha the Brahmin, Pokkharasāti the Brahmin, Jāṇussoṇi the Brahmin, Todeyya the Brahmin, and other well-known and eminent great Brahmins.",
      "sinhala": "එකල බොහෝ ප්‍රසිද්ධ ප්‍රකට බ්‍රාහ්මණ මහසැල්වරු මනසාකට නුවර වාසය කරමින් සිටියහ. එනම්: චංකී බ්‍රාහ්මණයා, තාරුක්ඛ බ්‍රාහ්මණයා, පොක්ඛරසාති බ්‍රාහ්මණයා, ජාණුස්සෝණි බ්‍රාහ්මණයා, තොදෙය්‍ය බ්‍රාහ්මණයා යන මොවුහු ද, තවත් බොහෝ ප්‍රසිද්ධ ප්‍රකට බ්‍රාහ්මණ මහසැල්වරු ද වෙති.",
      "paliTitle": ""
    },
    {
      "number": 520,
      "pali": "Atha kho vāseṭṭhabhāradvājānaṃ māṇavānaṃ jaṅghavihāraṃ anucaṅkamantānaṃ anuvicarantānaṃ maggāmagge kathā udapādi. Atha kho vāseṭṭho māṇavo evamāha – ‘‘ayameva ujumaggo, ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṃ akkhāto brāhmaṇena pokkharasātinā’’ti. Bhāradvājopi māṇavo evamāha – ‘‘ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāya, yvāyaṃ akkhāto brāhmaṇena tārukkhenā’’ti. Neva kho asakkhi vāseṭṭho māṇavo bhāradvājaṃ māṇavaṃ saññāpetuṃ, na pana asakkhi bhāradvājo māṇavopi vāseṭṭhaṃ māṇavaṃ saññāpetuṃ.",
      "english": "Then, as the young brahmins Vāseṭṭha and Bhāradvāja were walking up and down, strolling about, a discussion arose concerning the path and the non-path. Then the young brahmin Vāseṭṭha said this: \"This indeed is the straight path; this is the direct and emancipating way that leads to companionship with Brahmā for one who practices it, as declared by the brahmin Pokkharasāti.\" And the young brahmin Bhāradvāja also said this: \"This indeed is the straight path; this is the direct and emancipating way that leads to companionship with Brahmā for one who practices it, as declared by the brahmin Tārukkha.\" Indeed, the young brahmin Vāseṭṭha was unable to convince the young brahmin Bhāradvāja, nor was the young brahmin Bhāradvāja able to convince the young brahmin Vāseṭṭha.",
      "sinhala": "එවිට වාසෙට‍්ඨ සහ භාරද‍්වාජ යන මානවකයෝ ඇවිදිමින් යන අතරතුර, මාර්ගය සහ අමාර්ගය පිළිබඳ කථාවක් ඇති විය. එවිට වාසෙට‍්ඨ මානවකයා මෙසේ කීවේය: “බ‍්‍රාහ්මණ පොක‍්ඛරසාති විසින් දේශනා කරන ලද මේමයි සෘජු මාර්ගය. මේමයි ආරක්ෂිත මඟ. මෙය නිවන් පිණිස පවතින්නකි. එය කටයුතු කරන්නාට බ‍්‍රහ්ම සහයෝගය සඳහා මඟ පාදයි.” භාරද‍්වාජ මානවකයාද මෙසේ කීවේය: “බ‍්‍රාහ්මණ තාරුක‍්ඛ විසින් දේශනා කරන ලද මේමයි සෘජු මාර්ගය. මේමයි ආරක්ෂිත මඟ. මෙය නිවන් පිණිස පවතින්නකි. එය කටයුතු කරන්නාට බ‍්‍රහ්ම සහයෝගය සඳහා මඟ පාදයි.” වාසෙට‍්ඨ මානවකයාට භාරද‍්වාජ මානවකයාට ඒත්තු ගැන්වීමට නොහැකි විය. භාරද‍්වාජ මානවකයාටද වාසෙට‍්ඨ මානවකයාට ඒත්තු ගැන්වීමට නොහැකි විය.",
      "paliTitle": ""
    },
    {
      "number": 521,
      "pali": "Atha kho vāseṭṭho māṇavo bhāradvājaṃ māṇavaṃ āmantesi – ‘‘ayaṃ kho, bhāradvāja, samaṇo gotamo sakyaputto sakyakulā pabbajito manasākaṭe viharati uttarena manasākaṭassa aciravatiyā nadiyā tīre ambavane. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’’ti. Āyāma, bho bhāradvāja, yena samaṇo gotamo tenupasaṅkamissāma; upasaṅkamitvā etamatthaṃ samaṇaṃ gotamaṃ pucchissāma. Yathā no samaṇo gotamo byākarissati, tathā naṃ dhāressāmā’’ti. ‘‘Evaṃ, bho’’ti kho bhāradvājo māṇavo vāseṭṭhassa māṇavassa paccassosi.",
      "english": "Then young brahmin Vāseṭṭha addressed young brahmin Bhāradvāja: “Indeed, Bhāradvāja, this Ascetic Gotama, the Sakyan son gone forth from the Sakya clan, is dwelling at Manaṣākaṭa, to the north of Manaṣākaṭa, on the bank of the Aciravatī River, in the mango grove. And concerning that venerable Gotama, such an excellent reputation has spread: ‘He is indeed the Blessed One, Arahant, Perfectly Self-Awakened, perfect in knowledge and conduct, fortunate, knower of the world, unexcelled trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.’ Come, my friend Bhāradvāja, let us go and approach Ascetic Gotama. Having approached him, we shall ask Ascetic Gotama about this matter. Whatever Ascetic Gotama explains to us, that is how we shall adopt it.” “Yes, my friend,” replied young brahmin Bhāradvāja to young brahmin Vāseṭṭha.",
      "sinhala": "එවිට වාසෙට්ඨ මානවකයා භාරද්වාජ මානවකයා ඇමතී ය: \"භාරද්වාජය, ශාක්‍ය පුත්‍ර වූ, ශාක්‍ය කුලයෙන් පැවිදි වූ, මේ ගෝතම ශ්‍රමණයන් වහන්සේ මනසාකඨ නුවරට උතුරු දිගින් අචිරවතී නදිය අසල අඹ වනයේ වැඩ සිටින සේක. ඒ භවත් ගෝතමයන් වහන්සේ පිළිබඳව, 'ඒ භාග්‍යවතුන් වහන්සේ අරහං ය, සම්මාසම්බුද්ධ ය, විජ්ජාචරණසම්පන්න ය, සුගත ය, ලෝකවිදූ ය, අනුත්තරෝ පුරිසදම්මසාරථී ය, සත්ථා දේවමනුස්සානං ය, බුද්ධ ය, භගවා ය' යන මෙබඳු කල්‍යාණ කීර්ති ශබ්දයක් පැතිර පවතී. භාරද්වාජය, එනු මැනව, අපි ගෝතම ශ්‍රමණයන් වහන්සේ වෙත යමු; එළඹ, මේ කරුණ ගෝතම ශ්‍රමණයන් වහන්සේගෙන් විමසමු. ගෝතම ශ්‍රමණයන් වහන්සේ අපට කෙසේ විස්තර කරන්නේ ද, අපි එය එලෙසින්ම ධාරණය කර ගන්නෙමු.\" එවිට භාරද්වාජ මානවකයා වාසෙට්ඨ මානවකයාට \"එසේය, භවත්නි\" යි පිළිතුරු දුන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 522,
      "pali": "Atha kho vāseṭṭhabhāradvājā māṇavā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavatā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ekamantaṃ nisinno kho vāseṭṭho māṇavo bhagavantaṃ etadavoca – ‘‘idha, bho gotama, amhākaṃ jaṅghavihāraṃ anucaṅkamantānaṃ anuvicarantānaṃ maggāmagge kathā udapādi. Ahaṃ evaṃ vadāmi – ‘ayameva ujumaggo, ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṃ akkhāto brāhmaṇena pokkharasātinā’ti. Bhāradvājo māṇavo evamāha – ‘ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṃ akkhāto brāhmaṇena tārukkhenā’ti. Ettha, bho gotama, attheva viggaho, atthi vivādo, atthi nānāvādo’’ti.",
      "english": "Then the young brahmins Vāseṭṭha and Bhāradvāja approached the Blessed One. Having approached, they exchanged greetings with the Blessed One. After exchanging polite and memorable greetings, they sat down to one side. As Vāseṭṭha, the young brahmin, sat to one side, he said this to the Blessed One: “Here, Venerable Gotama, as we were walking about and wandering, a discussion arose among us concerning the right path and the wrong path. I say: ‘This is indeed the straight path, this is the direct way, it leads out, bringing one who practices it to companionship with Brahma, as declared by the brahmin Pokkharasāti.’ But the young brahmin Bhāradvāja says: ‘This is indeed the straight path, this is the direct way, it leads out, bringing one who practices it to companionship with Brahma, as declared by the brahmin Tārukkhā.’ So in this matter, Venerable Gotama, there is indeed disagreement, there is dispute, there is differing opinion.”",
      "sinhala": "එවිට වාසෙට්ඨ සහ භාරද්වාජ තරුණයෝ භාග්‍ය​වතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ. පැමිණ, භාග්‍ය​වතුන් වහන්සේ සමඟ සතුටු සාමිචි කතා කළහ. සුහදශීලී, සිහි කටයුතු කතා බහ නිමවා, ඔවුහු එක් පසෙකින් වාඩි වූහ.\n\nඑක් පසෙකින් වාඩි වී සිටි වාසෙට්ඨ තරුණයා භාග්‍ය​වතුන් වහන්සේට මෙසේ පැවසුවේය: ‘භවත් ගෞතමයෙනි, මෙහිදී, අපි ඇවිදිමින් සක්මන් කරමින් විමසා බලද්දී මාර්ගය හා අමාර්ගය පිළිබඳ කතාවක් ඇති විය. මම මෙසේ කියමි: ‘මෙයමයි සෘජු මාර්ගය, මෙයමයි නිවැරදි ගමන් මාර්ගය, මෙයමයි නිවනට පමුණුවන මාර්ගය, එය ඒ අනුව ක්‍රි​යා කරන්නාට බ්‍ර​හ්ම සහායෝගී​ත්වයට පමුණුවයි, එනම් පොක්ඛරසාති නම් බ්‍රා​හ්ම​ණයා විසින් දේශනා කරන ලද්දකි.’ භාරද්වාජ තරුණයා මෙසේ කියයි: ‘මෙයමයි සෘජු මාර්ගය, මෙයමයි නිවැරදි ගමන් මාර්ගය, මෙයමයි නිවනට පමුණුවන මාර්ගය, එය ඒ අනුව ක්‍රි​යා කරන්නාට බ්‍ර​හ්ම සහායෝගී​ත්වයට පමුණුවයි, එනම් තාරුක්ඛ නම් බ්‍රා​හ්ම​ණයා විසින් දේශනා කරන ලද්දකි.’ භවත් ගෞතමයෙනි, මෙහිදී ඇත්තේම ගැටුමකි, ඇත්තේම වාද විවාදයකි, ඇත්තේම මතභේදයකි.’",
      "paliTitle": "Maggāmaggakathā",
      "englishTitle": "Discourse on Right and Wrong Paths",
      "sinhalaTitle": "මාර්‍ගාමාර්‍ග කථාව"
    },
    {
      "number": 523,
      "pali": "‘‘Iti kira, vāseṭṭha, tvaṃ evaṃ vadesi – ‘‘ayameva ujumaggo, ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṃ akkhāto brāhmaṇena pokkharasātinā’’ti. Bhāradvājo māṇavo evamāha – ‘‘ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāya, yvāyaṃ akkhāto brāhmaṇena tārukkhenā’’ti. Atha kismiṃ pana vo, vāseṭṭha, viggaho, kismiṃ vivādo, kismiṃ nānāvādo’’ti?",
      "english": "So, Vāseṭṭha, you say this: 'This indeed is the straight path, this is the direct way leading out, it leads to companionship with Brahmā for one who practices it, as declared by the brahmin Pokkharasāti.' The young brahmin Bhāradvāja says this: 'This indeed is the straight path, this is the direct way leading out, it leads to companionship with Brahmā for one who practices it, as declared by the brahmin Tārukkha.' Then, Vāseṭṭha, in what is your dispute, in what is your quarrel, in what are your differing assertions?",
      "sinhala": "එසේ නම්, වාසෙට්ඨය, ඔබ මෙසේ පවසයි: ‘පොක්ඛරසාති බ්‍රාහ්මණයා විසින් දේශනා කරන ලද මේ මාර්ගයම ඍජු මාර්ගයයි, මෙයම සුමට මාර්ගයයි, මෙයම නික්මීමට පමුණුවන මාර්ගයයි, මෙය එසේ කරන්නාට බ්‍රහ්ම සහවාසය පිණිස පමුණුවයි.’ භාරද්වාජ මාණවකයා මෙසේ පවසයි: ‘තාරුක්ඛ බ්‍රාහ්මණයා විසින් දේශනා කරන ලද මේ මාර්ගයම ඍජු මාර්ගයයි, මෙයම සුමට මාර්ගයයි, මෙයම නික්මීමට පමුණුවන මාර්ගයයි, මෙය එසේ කරන්නාට බ්‍රහ්ම සහවාසය පිණිස පමුණුවයි.’ එසේ නම්, වාසෙට්ඨය, ඔබගේ ගැටුම කුමක්ද? ඔබගේ වාදය කුමක්ද? ඔබගේ මතභේදය කුමක්ද?",
      "paliTitle": ""
    },
    {
      "number": 524,
      "pali": "‘‘Maggāmagge, bho gotama. Kiñcāpi, bho gotama, brāhmaṇā nānāmagge paññapenti, addhariyā brāhmaṇā tittiriyā brāhmaṇā chandokā brāhmaṇā bavhārijjhā brāhmaṇā, atha kho sabbāni tāni niyyānikā niyyanti takkarassa brahmasahabyatāya. ‘‘Seyyathāpi, bho gotama, gāmassa vā nigamassa vā avidūre bahūni cepi nānāmaggāni bhavanti, atha kho sabbāni tāni gāmasamosaraṇāni bhavanti; evameva kho, bho gotama, kiñcāpi brāhmaṇā nānāmagge paññapenti, addhariyā brāhmaṇā tittiriyā brāhmaṇā chandokā brāhmaṇā bavhārijjhā brāhmaṇā, atha kho sabbāni tāni niyyānikā niyyanti takkarassa brahmasahabyatāyā’’ti. ",
      "english": "Concerning paths, good Gotama. Even though, good Gotama, brahmins declare various paths – the Adhariyā brahmins, the Tittiriyā brahmins, the Chandokā brahmins, and the Bavhārijjhā brahmins – yet all of them are conducive to and lead to companionship with Brahmā for one who practices them.\n\nJust as, good Gotama, not far from a village or a town, even if there are many different paths, yet all of them converge on that village; in the same way, good Gotama, even though brahmins declare various paths – the Adhariyā brahmins, the Tittiriyā brahmins, the Chandokā brahmins, and the Bavhārijjhā brahmins – yet all of them are conducive to and lead to companionship with Brahmā for one who practices them.",
      "sinhala": "මාර්ගය සහ අමාර්ගය පිළිබඳවයි, භවත් ගෞතමය. භවත් ගෞතමය, අද්ධරිය බ්‍රාහ්මණයෝ, තිත්තිරිය බ්‍රාහ්මණයෝ, ඡන්දොක බ්‍රාහ්මණයෝ, බහ්වෘජ්ඣ බ්‍රාහ්මණයෝ යන බ්‍රාහ්මණයෝ විවිධ මාර්ග පනවති. එහෙත් ඒ සියල්ල, ඒ අනුව ක්‍රියා කරන්නාට බ්‍රහ්ම සහායත්වය පිණිස නික්මීම පිණිසම පමුණුවති.\n\nභවත් ගෞතමය, යම්සේ ගමක් හෝ නගරයක් අසල විවිධ මාර්ග බොහෝ තිබුණද, එහෙත් ඒ සියල්ල එම ගම වෙතටම පිවිසෙන්නේය. භවත් ගෞතමය, එලෙසම, අද්ධරිය බ්‍රාහ්මණයෝ, තිත්තිරිය බ්‍රාහ්මණයෝ, ඡන්දොක බ්‍රාහ්මණයෝ, බහ්වෘජ්ඣ බ්‍රාහ්මණයෝ යන බ්‍රාහ්මණයෝ විවිධ මාර්ග පනවති. එහෙත් ඒ සියල්ල, ඒ අනුව ක්‍රියා කරන්නාට බ්‍රහ්ම සහායත්වය පිණිස නික්මීම පිණිසම පමුණුවති.",
      "paliTitle": ""
    },
    {
      "number": 525,
      "pali": "‘‘Niyyantīti vāseṭṭha vadesi’’? ‘‘Niyyantīti, bho gotama, vadāmi’’. ‘‘Niyyantīti, vāseṭṭha, vadesi’’? ‘‘Niyyantīti, bho gotama, vadāmi’’. ‘‘Niyyantīti, vāseṭṭha, vadesi’’? ‘‘Niyyantī’’ti, bho gotama, vadāmi’’. ‘‘Kiṃ pana, vāseṭṭha, atthi koci tevijjānaṃ brāhmaṇānaṃ ekabrāhmaṇopi, yena brahmā sakkhidiṭṭho’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Kiṃ pana, vāseṭṭha, atthi koci tevijjānaṃ brāhmaṇānaṃ ekācariyopi, yena brahmā sakkhidiṭṭho’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Kiṃ pana, vāseṭṭha, atthi koci tevijjānaṃ brāhmaṇānaṃ ekācariyapācariyopi, yena brahmā sakkhidiṭṭho’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Kiṃ pana, vāseṭṭha, atthi koci tevijjānaṃ brāhmaṇānaṃ yāva sattamā ācariyāmahayugā [sattamācariyamahayugā (syā.)] yena brahmā sakkhidiṭṭho’’ti? ‘‘No hidaṃ, bho gotama’’.",
      "english": "“Do you say, Vāseṭṭha, that they lead forth?” “Yes, Venerable Gotama, I say that they lead forth.” “Do you say, Vāseṭṭha, that they lead forth?” “Yes, Venerable Gotama, I say that they lead forth.” “Do you say, Vāseṭṭha, that they lead forth?” “Yes, Venerable Gotama, I say that they lead forth.” “But Vāseṭṭha, is there even a single brahmin among those learned in the three Vedas who has directly seen Brahmā?” “No, Venerable Gotama.” “But Vāseṭṭha, is there even a single teacher among those learned in the three Vedas who has directly seen Brahmā?” “No, Venerable Gotama.” “But Vāseṭṭha, is there even a single teacher’s teacher among those learned in the three Vedas who has directly seen Brahmā?” “No, Venerable Gotama.” “But Vāseṭṭha, is there even a single one among those learned in the three Vedas, up to the seventh generation of teachers, who has directly seen Brahmā?” “No, Venerable Gotama.”",
      "sinhala": "\"වා‍සේට්ඨ, නිවන් මඟක් යැයි ඔබ කියන්නෙහිද?\"\n\"භවත් ගෞතමයන් වහන්ස, නිවන් මඟක් යැයි මම කියමි.\"\n\"වා‍සේට්ඨ, නිවන් මඟක් යැයි ඔබ කියන්නෙහිද?\"\n\"භවත් ගෞතමයන් වහන්ස, නිවන් මඟක් යැයි මම කියමි.\"\n\"වා‍සේට්ඨ, නිවන් මඟක් යැයි ඔබ කියන්නෙහිද?\"\n\"භවත් ගෞතමයන් වහන්ස, නිවන් මඟක් යැයි මම කියමි.\"\n\"එසේනම් වා‍සේට්ඨ, තේවිජ්ජ බමුණන්ගෙන් බ්‍රහ්මයා දැක ඇති එක බමුණකුවත් සිටින්නේද?\"\n\"භවත් ගෞතමයන් වහන්ස, එසේ නැත.\"\n\"එසේනම් වා‍සේට්ඨ, තේවිජ්ජ බමුණන්ගෙන් බ්‍රහ්මයා දැක ඇති එක ආචාර්යවරයෙක්වත් සිටින්නේද?\"\n\"භවත් ගෞතමයන් වහන්ස, එසේ නැත.\"\n\"එසේනම් වා‍සේට්ඨ, තේවිජ්ජ බමුණන්ගෙන් බ්‍රහ්මයා දැක ඇති එක ආචාර්ය-ප්‍රාචාර්යවරයෙක්වත් සිටින්නේද?\"\n\"භවත් ගෞතමයන් වහන්ස, එසේ නැත.\"\n\"එසේනම් වා‍සේට්ඨ, තේවිජ්ජ බමුණන්ගේ සත්වන ගුරු පරම්පරාව දක්වා හෝ බ්‍රහ්මයා දැක ඇති කිසිවෙක් සිටින්නේද?\"\n\"භවත් ගෞතමයන් වහන්ස, එසේ නැත.\"",
      "paliTitle": "Vāseṭṭhamāṇavānuyogo",
      "englishTitle": "Vāseṭṭha's Inquiry",
      "sinhalaTitle": "වා‍සෙට්ඨ මානව අනුයෝගය"
    },
    {
      "number": 526,
      "pali": "‘‘Kiṃ pana, vāseṭṭha, yepi tevijjānaṃ brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro, yesamidaṃ etarahi tevijjā brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samihitaṃ [samīhitaṃ (syā.)], tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṃ – aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu. Tepi evamāhaṃsu – ‘mayametaṃ jānāma, mayametaṃ passāma, yattha vā brahmā, yena vā brahmā, yahiṃ vā brahmā’’’ti? ‘‘No hidaṃ, bho gotama’’.",
      "english": "But, Vāseṭṭha, did even those ancient seers of the three-Veda brahmins — the composers and propagators of the hymns, whose ancient verses are now chanted, spoken, and compiled by these three-Veda brahmins, who follow in chanting, follow in speaking, speak what has been spoken, and recite what has been recited — namely, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu, did even they declare, 'We know this, we see this, where Brahma is, by what path Brahma is, and to what place Brahma is'?\n\"No, good Gotama.\"",
      "sinhala": "වාසේට්ඨයෙනි, එසේනම්, ත්‍රිවේදපාරග වූ බ්‍රාහ්මණයන්ගේ පෙර විසූ ඍෂිවරුන් වූ, මන්ත්‍රයන් ගොඩනැඟූ, මන්ත්‍රයන් ප්‍රචාරය කළ, එනම් අට්ඨක, වාමක, වාමදේව, වෛශ්වාමිත්‍ර, යමදග්නි, අංගීරස, භාරද්වාජ, වාසේට්ඨ, කස්සප, භගු යන මේ ඍෂිවරුන්ගේ, යම් පෞරාණික මන්ත්‍ර පද ගායනා කරන ලද, දේශනා කරන ලද, සංග්‍රහ කරන ලද අයුරින් මේ වන විට ත්‍රිවේදපාරග බ්‍රාහ්මණවරු ඒවා අනුව ගායනා කරත් ද, ඒවා අනුව කථා කරත් ද, කියන ලද දේ නැවත කියත් ද, වදාළ දේ නැවත වදාරත් ද? ඔවුහු ද මෙසේ කීවාහු ද: ‘බ්‍රහ්මයා කොතැනක හෝ වේවා, කුමන මගකින් හෝ වේවා, කුමන දිශාවකින් හෝ වේවා යන්න අපි දනිමු, අපි දකිමු’ කියා?\n\nභවත් ගෞතමයන් වහන්ස, එසේ නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 527,
      "pali": "‘‘Iti kira, vāseṭṭha, natthi koci tevijjānaṃ brāhmaṇānaṃ ekabrāhmaṇopi, yena brahmā sakkhidiṭṭho. Natthi koci tevijjānaṃ brāhmaṇānaṃ ekācariyopi, yena brahmā sakkhidiṭṭho. Natthi koci tevijjānaṃ brāhmaṇānaṃ ekācariyapācariyopi, yena brahmā sakkhidiṭṭho. Natthi koci tevijjānaṃ brāhmaṇānaṃ yāva sattamā ācariyāmahayugā yena brahmā sakkhidiṭṭho. Yepi kira tevijjānaṃ brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro, yesamidaṃ etarahi tevijjā brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samihitaṃ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṃ – aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṃsu – ‘mayametaṃ jānāma, mayametaṃ passāma, yattha vā brahmā, yena vā brahmā, yahiṃ vā brahmā’ti. Teva tevijjā brāhmaṇā evamāhaṃsu – ‘yaṃ na jānāma, yaṃ na passāma, tassa sahabyatāya maggaṃ desema. Ayameva ujumaggo ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā’’’ti.",
      "english": "Thus it is said, Vāseṭṭha, there is not even one brahmin among the triple-Veda brahmins by whom Brahmā has been personally seen. There is not even one teacher among the triple-Veda brahmins by whom Brahmā has been personally seen. There is not even one teacher's teacher among the triple-Veda brahmins by whom Brahmā has been personally seen. There is not even one among the triple-Veda brahmins, up to the seventh generation of teachers, by whom Brahmā has been personally seen. And even those ancient sages of the triple-Veda brahmins, who were the creators of the mantras and the propagators of the mantras – whose ancient mantra-recitations, chanted, declared, and compiled, these triple-Veda brahmins now sing after them, declare after them, declare what has been declared, and recite what has been recited – namely, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, Bhagu, even they did not say thus: 'We know this, we see this, where Brahmā is, from where Brahmā is, to where Brahmā is.' Yet these very triple-Veda brahmins say thus: 'That which we do not know, that which we do not see, for companionship with that, we declare a path. This indeed is the straight path, this is the direct path, leading to liberation, it leads one who practices it to companionship with Brahmā.'",
      "sinhala": "වෙසෙසින්ම, වාසෙට්ඨයෙනි, ත්‍‌රිවේදයෙන් යුක්ත බ්‍රාහ්මණයන් අතරින් බ්‍රහ්මයා දැක ඇති එකම බ්‍රාහ්මණයකු හෝ නැත. ත්‍‌රිවේදයෙන් යුක්ත බ්‍රාහ්මණයන් අතරින් බ්‍රහ්මයා දැක ඇති එකම ආචාර්යවරයෙක් හෝ නැත. ත්‍‌රිවේදයෙන් යුක්ත බ්‍රාහ්මණයන් අතරින් බ්‍රහ්මයා දැක ඇති එකම ආචාර්ය-ප්‍රාචාර්යවරයෙක් හෝ නැත. ත්‍‌රිවේදයෙන් යුක්ත බ්‍රාහ්මණයන් අතරින් සත් පරම්පරාවක් දක්වා වූ ආචාර්යවරුන්ගෙන් බ්‍රහ්මයා දැක ඇති කිසිවකු හෝ නැත. තවද, ත්‍‌රිවේදයෙන් යුක්ත බ්‍රාහ්මණයන්ගේ, මන්ත්‍රයන් ඇති කළ, මන්ත්‍රයන් ප්‍රචලිත කළ පූර්ව ඍෂිවරුන් වූ, දැනට සිටින ත්‍‌රිවේද බ්‍රාහ්මණයන් විසින් ගායනා කරන ලද, ප්‍රකාශ කරන ලද, සංග්‍රහ කරන ලද යම් පැරණි මන්ත්‍ර පද ඇද්ද, ඔවුන් එයට අනුව ගායනා කරති, එයට අනුව කියති, ඔවුන් විසින් කියන ලද්ද නැවත කියති, ඔවුන් විසින් වචනයෙන් ප්‍රකාශ කරන ලද්ද නැවත ප්‍රකාශ කරති, එනම්: අට්ඨක, වාමක, වාමදේව, වෛශ්‍රාමිත්‍ර, යමදග්ගි, අංගීරස, භාරද්වාජ, වාසෙට්ඨ, කස්සප, භගු යන ඍෂිවරුන් පවා මෙසේ නොකීහ – ‘බ්‍රහ්මයා කොහි සිටිනවාද, කවරකු විසින් (දක්නා ලබන්නේද), කුමන ආකාරයකින් (දක්නා ලබන්නේද) යන්න අපි දනිමු, අපි එය දකිමු’ කියා. එසේ නම් ඒ ත්‍‌රිවේදයෙන් යුක්ත බ්‍රාහ්මණයෝ මෙසේ කියති: ‘අප යමක් නොදනිමුද, අප යමක් නොදකිමුද, එහි සහවාසය පිණිස අපි මාර්ගය දේශනා කරමු. මේ මාර්ගයම සෘජු මාර්ගයයි, මේ මාර්ගයම අවහිර නැති මාර්ගයයි, (සසරින්) නික්ම යන්නා වූ මාර්ගයයි, එය කරන්නාට බ්‍රහ්ම සහවාසය පිණිස නික්ම යයි’ කියා.",
      "paliTitle": ""
    },
    {
      "number": 528,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, nanu evaṃ sante tevijjānaṃ brāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bho gotama, evaṃ sante tevijjānaṃ brāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti. ‘‘Sādhu, vāseṭṭha, te vata [teva (ka.)], vāseṭṭha, tevijjā brāhmaṇā yaṃ na jānanti, yaṃ na passanti, tassa sahabyatāya maggaṃ desessanti. ‘Ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā’ti, netaṃ ṭhānaṃ vijjati.",
      "english": "\"What do you think, Vasettha, doesn't it follow that if this is so, the talk of the Brahmins skilled in the Three Vedas is rendered futile?\"\n\n\"Certainly, good Gotama, if this is so, the talk of the Brahmins skilled in the Three Vedas is rendered futile.\"\n\n\"Well said, Vasettha. Those very Brahmins skilled in the Three Vedas, Vasettha, will teach a path to companionship with what they do not know and do not see.\n\n‘This is the straight path, this is the direct way, leading to deliverance; it leads one who acts accordingly to companionship with Brahma’ — that is not possible.\"",
      "sinhala": "වශෙට්ඨය, ඔබ මේ ගැන කුමක් සිතනවාද? එසේ වූ කල, ත්‍රිවේදයෙහි කෙළ පැමිණි බ්‍රාහ්මණයන්ගේ කියමන් අර්ථශූන්‍ය වන්නේ නැද්ද?\n\nභෝ ගෞතමය, සැබැවින්ම, එසේ වූ කල ත්‍රිවේදයෙහි කෙළ පැමිණි බ්‍රාහ්මණයන්ගේ කියමන් අර්ථශූන්‍ය වන්නේය.\n\nවශෙට්ඨය, මැනවි. ඔවුහුම, වශෙට්ඨය, ත්‍රිවේදයෙහි කෙළ පැමිණි බ්‍රාහ්මණයෝ යමක් නොදන්නාද, යමක් නොදක්නාද, එහි සහවාසය පිණිස මාර්ගය දේශනා කරනු ඇත. ‘මෙයමයි ඍජු මාර්ගය, මෙයමයි කෙළින් යන, නිර්‍යාණික මාර්ගය, එය පිළිපදින්නහුට බ්‍රහ්ම සහවාසය පිණිස පමුණුවයි’ යැයි කියනු ලැබේ නම්, එවැනි දෙයක් සිදුවිය නොහැක්කකි.",
      "paliTitle": ""
    },
    {
      "number": 529,
      "pali": "‘‘Seyyathāpi, vāseṭṭha, andhaveṇi paramparasaṃsattā purimopi na passati, majjhimopi na passati, pacchimopi na passati. Evameva kho, vāseṭṭha, andhaveṇūpamaṃ maññe tevijjānaṃ brāhmaṇānaṃ bhāsitaṃ, purimopi na passati, majjhimopi na passati, pacchimopi na passati. Tesamidaṃ tevijjānaṃ brāhmaṇānaṃ bhāsitaṃ hassakaññeva sampajjati, nāmakaññeva sampajjati, rittakaññeva sampajjati, tucchakaññeva sampajjati.",
      "english": "Just as, Vāseṭṭha, a chain of blind men, linked one to another, where the first does not see, the middle does not see, and the last does not see. In the same way, Vāseṭṭha, I consider the discourse of the Brahmins who claim the threefold knowledge to be like that chain of blind men, where the first does not see, the middle does not see, and the last does not see. This discourse of those Brahmins who claim the threefold knowledge turns out to be merely laughable, merely verbal, merely empty, and merely hollow.",
      "sinhala": "වසෙට්ඨය, යම්සේ අන්ධයන්ගේ පෙළක් එකිනෙකාට සම්බන්ධ වී සිටින විට පෙර සිටින්නා ද දකින්නේ නැත, මැද සිටින්නා ද දකින්නේ නැත, පසු සිටින්නා ද දකින්නේ නැත. එසෙයින්ම, වසෙට්ඨය, ත්‍\\u200dරිවේදී බ්‍ර\\u200dාහ්මණයන්ගේ වචන ද අන්ධ පෙළක් බඳු යැයි මම සිතමි. පෙර සිටින්නා ද දකින්නේ නැත, මැද සිටින්නා ද දකින්නේ නැත, පසු සිටින්නා ද දකින්නේ නැත. ඒ ත්‍\\u200dරිවේදී බ්‍ර\\u200dාහ්මණයන්ගේ මේ වචන හාස්‍\\u200dයයට කරුණක්ම වේ, නමට පමණක් වේ, හිස් දෙයක්ම වේ, නිස්සාර දෙයක්ම වේ.",
      "paliTitle": ""
    },
    {
      "number": 530,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattantī’’ti? ‘‘Evaṃ, bho gotama, passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattantī’’ti.",
      "english": "“What do you think, Vāseṭṭha, do the brahmins skilled in the three Vedas, and also many other people, see the moon and the sun? And from where the moon and sun rise, and where they set, do they invoke them, praise them, venerate them with joined hands, bowing down, and follow them around?”\n\n“Yes, Reverend Gotama, the brahmins skilled in the three Vedas, and also many other people, see the moon and the sun. And from where the moon and sun rise, and where they set, they invoke them, praise them, venerate them with joined hands, bowing down, and follow them around.”",
      "sinhala": "‘‘වසෙට්ඨය, ඔබ මේ ගැන කුමක් සිතනවාද? ත්‍රිවේදී බ්‍රාහ්මණයෝ සඳුන් සහ හිරුන් දකිනවාද, සහ වෙනත් බොහෝ ජනයාත්, සඳුන් සහ හිරුන් උදාවන තැනින්ද, සහ බැස යන තැනින්ද, දෑත් එක්කර වන්දනා කරමින්, ප්‍රශංසා කරමින්, අයැදීම් කරමින්, ඔවුන් පසුපස යන්නේද?’’ ‘‘එසේය, භවත් ගෞතමය, ත්‍රිවේදී බ්‍රාහ්මණයෝ සඳුන් සහ හිරුන් දකිති, සහ වෙනත් බොහෝ ජනයාත්, සඳුන් සහ හිරුන් උදාවන තැනින්ද, සහ බැස යන තැනින්ද, දෑත් එක්කර වන්දනා කරමින්, ප්‍රශංසා කරමින්, අයැදීම් කරමින්, ඔවුන් පසුපස යති.’’",
      "paliTitle": ""
    },
    {
      "number": 531,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, yaṃ passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattanti, pahonti tevijjā brāhmaṇā candimasūriyānaṃ sahabyatāya maggaṃ desetuṃ – ‘‘ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa candimasūriyānaṃ sahabyatāyā’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Iti kira, vāseṭṭha, yaṃ passanti tevijjā brāhmaṇā candimasūriye, aññe cāpi bahujanā, yato ca candimasūriyā uggacchanti, yattha ca ogacchanti, āyācanti thomayanti pañjalikā namassamānā anuparivattanti, tesampi nappahonti candimasūriyānaṃ sahabyatāya maggaṃ desetuṃ – ‘‘ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa candimasūriyānaṃ sahabyatāyā’’ti.",
      "english": "What do you think, Vāseṭṭha? The three-Veda Brahmins, and indeed many other people, see the moon and sun. They know from where the moon and sun rise, and where they set. They supplicate, praise, pay homage with folded hands, and follow after them. Are these three-Veda Brahmins capable of pointing out the path to fellowship with the moon and sun, saying: \"This is the straight path, this is the direct route, leading to liberation; it leads one who practices it to fellowship with the moon and sun\"?\n\nNo, indeed, Venerable Gotama.\n\nTherefore, Vāseṭṭha, the three-Veda Brahmins, and indeed many other people, see the moon and sun. They know from where the moon and sun rise, and where they set. They supplicate, praise, pay homage with folded hands, and follow after them. Yet, even they are not capable of pointing out the path to fellowship with the moon and sun, saying: \"This is the straight path, this is the direct route, leading to liberation; it leads one who practices it to fellowship with the moon and sun.\"",
      "sinhala": "වසෙට්ඨය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? ත්‍රිවේදී බ්‍රාහ්මණයෝත්, තවත් බොහෝ ජනයාත් සඳහිරු දකිත් ද, සඳහිරු උදාවන තැනත්, බැස යන තැනත් දකිත් ද, ආයාචනා කරමින්, තුති පසසමින්, ඇඳිලි බැඳ නමස්කාර කරමින්, ඔවුන් වටා ගමන් කරත් ද, ඒ ත්‍රිවේදී බ්‍රාහ්මණයන්ට සඳහිරුගේ සහවාසය පිණිස මාර්ගය දේශනා කිරීමට හැකි ද – 'මෙයම ඍජු මාර්ගයයි, මෙය පහසු ගමන් මාර්ගයයි, මෙය නික්මීමට උපකාරී වේ, මෙය අනුගමනය කරන්නාට සඳහිරුගේ සහවාසය ලැබේ' කියා? 'එසේ නොවේ, භවත් ගෞතමයින් වහන්ස.' වසෙට්ඨය, එසේ නම්, ත්‍රිවේදී බ්‍රාහ්මණයෝත්, තවත් බොහෝ ජනයාත් සඳහිරු දකිත් ද, සඳහිරු උදාවන තැනත්, බැස යන තැනත් දකිත් ද, ආයාචනා කරමින්, තුති පසසමින්, ඇඳිලි බැඳ නමස්කාර කරමින්, ඔවුන් වටා ගමන් කරත් ද, ඔවුන්ට පවා සඳහිරුගේ සහවාසය පිණිස මාර්ගය දේශනා කිරීමට නොහැකි ය – 'මෙයම ඍජු මාර්ගයයි, මෙය පහසු ගමන් මාර්ගයයි, මෙය නික්මීමට උපකාරී වේ, මෙය අනුගමනය කරන්නාට සඳහිරුගේ සහවාසය ලැබේ' කියා.",
      "paliTitle": ""
    },
    {
      "number": 532,
      "pali": "‘‘Iti pana [kiṃ pana (sī. syā. pī.)] na kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho. Napi kira tevijjānaṃ brāhmaṇānaṃ ācariyehi brahmā sakkhidiṭṭho. Napi kira tevijjānaṃ brāhmaṇānaṃ ācariyapācariyehi brahmā sakkhidiṭṭho. Napi kira tevijjānaṃ brāhmaṇānaṃ yāva sattamā [sattamehi (?)] ācariyāmahayugehi brahmā sakkhidiṭṭho. Yepi kira tevijjānaṃ brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro, yesamidaṃ etarahi tevijjā brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samihitaṃ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṃ – aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṃsu – ‘‘mayametaṃ jānāma, mayametaṃ passāma, yattha vā brahmā, yena vā brahmā, yahiṃ vā brahmā’’ti. Teva tevijjā brāhmaṇā evamāhaṃsu – ‘‘yaṃ na jānāma, yaṃ na passāma, tassa sahabyatāya maggaṃ desema – ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā’’ti.",
      "english": "And so, indeed, Brahma has not been directly seen by the Brahmins who are masters of the three Vedas. Nor indeed has Brahma been directly seen by the teachers of these Brahmins. Nor indeed has Brahma been directly seen by the teachers of their teachers. Nor indeed has Brahma been directly seen by these Brahmins, up to the seventh generation of their teachers. And even those ancient sages of the Brahmins who are masters of the three Vedas—the creators of the hymns and the propounders of the hymns—whose ancient hymn-phrases, sung, proclaimed, and compiled, are now followed in recitation, followed in speaking, spoken after their speaking, and recited after their recitation by these very Brahmins—namely, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, Bhagu—even they did not say: ‘We know this, we see this: where Brahma is, by what path Brahma is reached, or in what location Brahma resides.’ Yet these very Brahmins who are masters of the three Vedas say: ‘That which we do not know, that which we do not see, for companionship with that, we teach a path—“This indeed is the straight path, this is the direct path, leading onwards, leading out for one who practices it, to companionship with Brahma.”’",
      "sinhala": "‘‘මෙසේ නම් ත්‍රිවේදී බ්‍රාහ්මණයන් විසින් බ්‍රහ්මයා ප්‍රත්‍යක්‍ෂයෙන් දැක නැත. ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ ආචාර්යවරුන් විසින්ද බ්‍රහ්මයා ප්‍රත්‍යක්‍ෂයෙන් දැක නැත. ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ ආචාර්යවරුන්ගේ ආචාර්යවරුන් විසින්ද බ්‍රහ්මයා ප්‍රත්‍යක්‍ෂයෙන් දැක නැත. ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ සත්වන මහා ආචාර්ය පරම්පරාව දක්වාද බ්‍රහ්මයා ප්‍රත්‍යක්‍ෂයෙන් දැක නැත. ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ පෙර විසූ, මන්‍ත්‍රයන්හි කර්‍තෘවරුන් වූ, මන්‍ත්‍රයන් පැතිරවූ, යම් පැරණි මන්‍ත්‍ර පදයක් මේ වන විට ත්‍රිවේදී බ්‍රාහ්මණයන් විසින් ගායනා කරනු ලබන්නේද, ප්‍රකාශ කරනු ලබන්නේද, සම්පාදනය කරනු ලබන්නේද, එය අනුගායනා කරන, අනුප්‍රකාශ කරන, භාෂණය කළ දේ අනුභාෂණය කරන, වචනය කළ දේ අනුපවචනය කරන – අට්ඨක, වාමක, වාමදේව, වෙස්සාමිත්ත, යමදග්ගි, අංගීරස, භාරද්වාජ, වාසෙට්ඨ, කස්සප, භගු යන මේ ඍෂිවරුන් පවා මෙසේ නොකීහ: “බ්‍රහ්මයා කොතැනද, කවර තැනැත්තකු විසින්ද, කිනම් තැනකද සිටින්නේ යැයි අපි මෙය දනිමු, අපි මෙය දකිමු” කියා. නමුත් ඒ ත්‍රිවේදී බ්‍රාහ්මණයෝ මෙසේ කීහ: “අපි යමක් නොදනිමුද, යමක් නොදකිමුද, ඔහුගේ (බ්‍රහ්මයාගේ) සහවාසය සඳහා මාර්‍ගය දේශනා කරන්නෙමු. මේමයි ඍජු මාර්‍ගය, මේමයි සෘජු ගමන, නිර්‍යාණය පිණිස පවතින, එය කරන්නාට බ්‍රහ්ම සහවාසය පිණිසම යොමු කරන්නාවූ (මාර්‍ගය).”",
      "paliTitle": ""
    },
    {
      "number": 533,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, nanu evaṃ sante tevijjānaṃ brāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bho gotama, evaṃ sante tevijjānaṃ brāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti. ‘‘Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṃ na jānanti, yaṃ na passanti, tassa sahabyatāya maggaṃ desessanti – ‘‘ayameva ujumaggo, ayamañjasāyano niyyāniko, niyyāti takkarassa brahmasahabyatāyā’’ti, netaṃ ṭhānaṃ vijjati. ",
      "english": "“What do you think, Vāseṭṭha, does it not follow that, this being the case, the assertion of the brahmins versed in the three Vedas proves to be without substance?” “Certainly, Venerable Gotama, this being the case, the assertion of the brahmins versed in the three Vedas proves to be without substance.” “Good, Vāseṭṭha. Surely, Vāseṭṭha, it is not possible that those brahmins versed in the three Vedas will teach a path to companionship with that which they do not know and do not see, saying: ‘This is indeed the straight path, this is the direct way, leading to liberation, leading its practitioner to companionship with Brahmā’.”",
      "sinhala": "\"වාසෙට්ඨය, ඔබ කුමක් සිතන්නෙහි ද, මෙසේ ඇති කල්හි ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ ප්‍රකාශය අඵල වන්නේ නොවේ ද?\"\n\"ඇත්තෙන්ම, භවත් ගෝතමයනි, මෙසේ ඇති කල්හි ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ ප්‍රකාශය අඵල වන්නේ ය.\"\n\"සාධු යි, වාසෙට්ඨය. වාසෙට්ඨය, යමක් නොදන්නා, යමක් නොදකින ඒ ත්‍රිවේදී බ්‍රාහ්මණයෝ, 'මෙයම සෘජු මාර්ගයයි, මෙය සෘජු ගමන් මාර්ගයයි, මෙය නිස්සරණයට පමුණුවන්නකි, මෙය කරන්නා බ්‍රහ්ම සහාය බවට පත් කරයි' යි කියමින් එහි සහාය බවට පත්වීම පිණිස මාර්ගය දේශනා කරත් නම්, එවැනි දෙයක් විය නොහැක.\"",
      "paliTitle": ""
    },
    {
      "number": 534,
      "pali": "‘‘Seyyathāpi, vāseṭṭha, puriso evaṃ vadeyya – ‘‘ahaṃ yā imasmiṃ janapade janapadakalyāṇī, taṃ icchāmi, taṃ kāmemī’’ti. Tamenaṃ evaṃ vadeyyuṃ – ‘‘ambho purisa, yaṃ tvaṃ janapadakalyāṇiṃ icchasi kāmesi, jānāsi taṃ janapadakalyāṇiṃ – khattiyī vā brāhmaṇī vā vessī vā suddī vā’’ti? Iti puṭṭho ‘‘no’’ti vadeyya. ‘‘Tamenaṃ evaṃ vadeyyuṃ – ‘‘ambho purisa, yaṃ tvaṃ janapadakalyāṇiṃ icchasi kāmesi, jānāsi taṃ janapadakalyāṇiṃ – evaṃnāmā evaṃgottāti vā, dīghā vā rassā vā majjhimā vā kāḷī vā sāmā vā maṅguracchavī vāti, amukasmiṃ gāme vā nigame vā nagare vā’’ti? Iti puṭṭho ‘no’ti vadeyya. Tamenaṃ evaṃ vadeyyuṃ – ‘‘ambho purisa, yaṃ tvaṃ na jānāsi na passasi, taṃ tvaṃ icchasi kāmesī’’ti? Iti puṭṭho ‘‘āmā’’ti vadeyya.",
      "english": "Just as, Vāseṭṭha, a man might say, \"I desire, I long for the most beautiful woman in this country.\" They might then say to him, \"Hey, man, this most beautiful woman whom you desire and long for, do you know that most beautiful woman – whether she is a noblewoman, a brahmin woman, a merchant woman, or a worker woman?\" When asked thus, he would say, \"No.\" Then they might say to him, \"Hey, man, this most beautiful woman whom you desire and long for, do you know that most beautiful woman – whether she has such-and-such a name or such-and-such a clan; whether she is tall, short, or of medium height; whether she is dark-skinned, dusky, or golden-skinned; or whether she lives in such-and-such a village, town, or city?\" When asked thus, he would say, \"No.\" They might then say to him, \"Hey, man, do you desire and long for that which you do not know and do not see?\" When asked thus, he would say, \"Yes.\"",
      "sinhala": "වාසෙට්ඨය, යම්සේ පුරුෂයෙක් මෙසේ කියන්නේය: “මේ ජනපදයේ සිටින ජනපදකල්‍යාණියට මම කැමති වෙමි, ඇයව ප්‍රි‍ය​ කරමි” යි. ඔහුව අමතා මෙසේ කියන්නාහ: “අහෝ පුරුෂය, ඔබ යම් ජනපදකල්‍යාණියකට කැමතිව ආශා කරන්නේද, ඒ ජනපදකල්‍යාණිය ක්ෂත්‍රිය​ කුලයේ කෙනෙක්ද, බ්‍රාහ්මණ කුලයේ කෙනෙක්ද, වෛශ්‍ය කුලයේ කෙනෙක්ද, ශුද්‍ර කුලයේ කෙනෙක්දැයි ඔබ දන්නෙහිද?” මෙසේ අසන ලද ඔහු “නැත” යි කියන්නේය. ඔහුව අමතා මෙසේ කියන්නාහ: “අහෝ පුරුෂය, ඔබ යම් ජනපදකල්‍යාණියකට කැමතිව ආශා කරන්නේද, ඒ ජනපදකල්‍යාණිය මෙවන් නමකින්, මෙවන් ගෝත්‍ර​යකින් යුක්තද, උසද, මිටිද, මධ්‍යම ප්‍ර​මාණයේද, කළු පැහැතිද, සාම පැහැතිද, රන්වන් පැහැතිද, අසවල් ගමෙහි, අසවල් නියම්ගමෙහි හෝ අසවල් නගරයෙහි සිටින්නේදැයි ඔබ දන්නෙහිද?” මෙසේ අසන ලද ඔහු “නැත” යි කියන්නේය. ඔහුව අමතා මෙසේ කියන්නාහ: “අහෝ පුරුෂය, ඔබ යමක් නොදන්නෙහිද, නොදකින්නෙහිද, ඒ දෙයට ඔබ කැමතිව ආශා කරන්නේද?” මෙසේ අසන ලද ඔහු “එසේය” යි කියන්නේය.",
      "paliTitle": "Janapadakalyāṇīupamā",
      "englishTitle": "Simile of the Country Belle",
      "sinhalaTitle": "ජනපද කල්‍‌යාණි උපමාව"
    },
    {
      "number": 535,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, nanu evaṃ sante tassa purisassa appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bho gotama, evaṃ sante tassa purisassa appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti.",
      "english": "“What do you think, Vāseṭṭha, if that is the case, wouldn't that person’s statement turn out to be unfulfilled?”\n\n“Indeed, Reverend Gotama, if that is the case, that person’s statement would turn out to be unfulfilled.”",
      "sinhala": "වාසෙට්ඨය, ඔබ මේ ගැන කුමක් සිතන්‍නෙහිද? මේ අයුරින් වූ කල්හි ඒ පුරුෂයාගේ වචනය බල රහිත වූවක් වන්නේ නොවේද?\n\nඇත්‍තෙන්ම, භවත් ගෞතමයෙනි, මේ අයුරින් වූ කල්හි ඒ පුරුෂයාගේ වචනය බල රහිත වූවක් වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 536,
      "pali": "‘‘Evameva kho, vāseṭṭha, na kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho, napi kira tevijjānaṃ brāhmaṇānaṃ ācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṃ brāhmaṇānaṃ ācariyapācariyehi brahmā sakkhidiṭṭho. Napi kira tevijjānaṃ brāhmaṇānaṃ yāva sattamā ācariyāmahayugehi brahmā sakkhidiṭṭho. Yepi kira tevijjānaṃ brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro, yesamidaṃ etarahi tevijjā brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samihitaṃ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṃ – aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṃsu – ‘‘mayametaṃ jānāma, mayametaṃ passāma, yattha vā brahmā, yena vā brahmā, yahiṃ vā brahmā’’ti. Teva tevijjā brāhmaṇā evamāhaṃsu – ‘‘yaṃ na jānāma, yaṃ na passāma, tassa sahabyatāya maggaṃ desema – ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā’’ti.",
      "english": "Just so, Vāseṭṭha, it is indeed not the case that Brahmā has been seen face-to-face by the Brahmins proficient in the three Vedas. Nor indeed has Brahmā been seen face-to-face by the teachers of these Brahmins proficient in the three Vedas. Nor indeed has Brahmā been seen face-to-face by the teachers of their teachers. Nor indeed has Brahmā been seen face-to-face by the Brahmins proficient in the three Vedas even up to the seventh generation of teachers. And those ancient sages of the Brahmins proficient in the three Vedas, who were the composers and reciters of the hymns—whose ancient hymn-words are now sung, proclaimed, and compiled by these Brahmins proficient in the three Vedas, who sing them in imitation, recite them in imitation, repeat what was spoken, and reiterate what was recited—namely Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu—even they did not say: \"We know this, we see this, where Brahmā is, from where Brahmā is, to where Brahmā is.\" Yet these Brahmins proficient in the three Vedas say: \"We teach a path to companionship with that which we do not know, which we do not see—this is the direct path, this is the straight path, leading to liberation, leading to companionship with Brahmā for one who acts accordingly.\"",
      "sinhala": "වසෙට්ඨය, එපරිද්දෙන්ම ත්‍රිවේදී බ්‍රාහ්මණයන් විසින් බ්‍රහ්මයා සාක්‍ෂාත් වශයෙන් දැක නැත. ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ ආචාර්යවරුන් විසින්ද බ්‍රහ්මයා සාක්‍ෂාත් වශයෙන් දැක නැත. ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ ආචාර්ය ප්‍රාචාර්යවරුන් විසින්ද බ්‍රහ්මයා සාක්‍ෂාත් වශයෙන් දැක නැත. ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ සත්වන පරම්පරාව දක්වා වූ ආචාර්ය මහායුගයන් විසින්ද බ්‍රහ්මයා සාක්‍ෂාත් වශයෙන් දැක නැත. ත්‍රිවේදී බ්‍රාහ්මණයන්ගේ පූර්වක ඉසිවරුන් වූ, මන්ත්‍රයන්ගේ කර්තෘවරුන් සහ මන්ත්‍රයන් ප්‍රවර්තනය කරන්නන්ද වූ යම් අය වෙත්ද; යම් අයගේ මේ පැරණි මන්ත්‍රපද ගීත, ප්‍රවෘත්ති, සම්මිහිත කරුණු වර්තමානයේ ත්‍රිවේදී බ්‍රාහ්මණයෝ අනුගායනා කරන්නාහුද, අනුභාෂණය කරන්නාහුද, භාෂිතය අනුභාෂණය කරන්නාහුද, වාචනය කළ දේ අනුවාචනය කරන්නාහුද – එනම් අෂ්ටක, වාමක, වාමදේව, විශ්වාමිත්‍ර, යමදග්ගි, අංගීරස, භාරද්වාජ, වසෙට්ඨ, කස්සප, භගු යන අය – ඔවුහුද මෙසේ නොකීවාහුය: ‘‘අපි මේ දනිමු, අපි මේ දකිමු, බ්‍රහ්මයා කොතැනක සිටින්නේද, කිනම් දිශාවකින් සිටින්නේද, කොතැනකට යන්නේද’’ කියා. එසේ නම්, ඒ ත්‍රිවේදී බ්‍රාහ්මණයෝ මෙසේ කියති: ‘‘අප යමක් නොදනිමුද, අප යමක් නොදකිමුද, එහි සහයෝගය සඳහා මාර්ගයක් අපි දේශනා කරමු – මෙයම ඍජු මාර්ගයයි, මෙයම සෘජු ගමනයි, මෙය නික්මෙන සුළුය, මෙය ඒ අයුරින් කටයුතු කරන්නාට බ්‍රහ්ම සහයෝගය කරා නික්ම යයි.’’",
      "paliTitle": ""
    },
    {
      "number": 537,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, nanu evaṃ sante tevijjānaṃ brāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bho gotama, evaṃ sante tevijjānaṃ brāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti. ‘‘Sādhu, vāseṭṭha, te vata, vāseṭṭha, tevijjā brāhmaṇā yaṃ na jānanti, yaṃ na passanti, tassa sahabyatāya maggaṃ desessanti – ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyāti netaṃ ṭhānaṃ vijjati. ",
      "english": "\"What do you think, Vāseṭṭha, in such a case, doesn't the assertion of these Brahmins who know the three Vedas prove to be unsubstantiated?\" \"Certainly, Venerable Gotama, in such a case, the assertion of these Brahmins who know the three Vedas proves to be unsubstantiated.\" \"Good, Vāseṭṭha. It is indeed not possible, Vāseṭṭha, that those Brahmins who know the three Vedas, who neither know nor see [Brahma], would teach the path to companionship with him, proclaiming: 'This is the direct path, this is the straight path, this is the way out, it leads to companionship with Brahma for one who practices it.'\"",
      "sinhala": "වසෙට්ඨය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මේ ආකාරයට පවතින විට, තෙවිද්‍ය බ්‍රාහ්මණයන්ගේ ප්‍රකාශය නිරර්ථක වන්නේ නොවේද?\n\nභවත් ගෞතමය, සැබවින්ම මේ ආකාරයට පවතින විට, තෙවිද්‍ය බ්‍රාහ්මණයන්ගේ ප්‍රකාශය නිරර්ථක වේ.\n\nයහපති, වසෙට්ඨය. වසෙට්ඨය, ඒ තෙවිද්‍ය බ්‍රාහ්මණයන්, ඔවුහු යමක් නොදනිත්ද, යමක් නොදකිත්ද, ඒ බ්‍රහ්මයා සමඟ සහභාගිත්වය සඳහා, 'මෙයමයි සෘජු මාර්ගය, මෙයමයි නිවැරදි ගමන් මාර්ගය, නිවැරදිව පිළිපදින්නාට බ්‍රහ්ම සහභාගිත්වය පිණිස නික්මෙන්නේය' යැයි මාර්ගය දේශනා කිරීම සිදුවිය නොහැක්කකි.",
      "paliTitle": ""
    },
    {
      "number": 538,
      "pali": "‘‘Seyyathāpi, vāseṭṭha, puriso cātumahāpathe nisseṇiṃ kareyya – pāsādassa ārohaṇāya. Tamenaṃ evaṃ vadeyyuṃ – ‘‘ambho purisa, yassa tvaṃ [yaṃ tvaṃ (syā.)] pāsādassa ārohaṇāya nisseṇiṃ karosi, jānāsi taṃ pāsādaṃ – puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya ucco vā nīco vā majjhimo vā’’ti? Iti puṭṭho ‘‘no’’ti vadeyya. ‘‘Tamenaṃ evaṃ vadeyyuṃ – ‘‘ambho purisa, yaṃ tvaṃ na jānāsi, na passasi, tassa tvaṃ pāsādassa ārohaṇāya nisseṇiṃ karosī’’ti? Iti puṭṭho ‘‘āmā’’ti vadeyya.",
      "english": "Just as, Vāseṭṭha, a man might build a staircase at a crossroads for ascending to a palace. They might say to him, ‘Sir, this palace you are building a staircase for, do you know it – whether it is to the east, south, west, or north; whether it is high, low, or medium-sized?’ Being asked this, he would say, ‘No.’ Then they might say to him, ‘Sir, you are building a staircase for a palace that you do not know, do not see?’ Being asked this, he would say, ‘Yes.’",
      "sinhala": "වසිෂ්ඨය, යම් සේ පුරුෂයෙක් සිව් මං සන්ධියකදී ප්‍රාසාදයකට නැගීම පිණිස ඉනිමඟක් සාදන්නේ ය. ඔවුහු ඔහුට මෙසේ කියන්නාහ: \"අම්මෝ පුරුෂය, ඔබ යම් ප්‍රාසාදයකට නැගීම පිණිස ඉනිමඟක් සාදන්නේ ද, ඔබ ඒ ප්‍රාසාදය දන්නේ ද – නැගෙනහිර දිශාවේ ද, දකුණු දිශාවේ ද, බටහිර දිශාවේ ද, උතුරු දිශාවේ ද, උස ද, මිටි ද, මැද ප්‍රමාණයේ ද යන්න?\" මෙසේ විමසූ කල්හි ඔහු \"නැත\" යි කියන්නේ ය. ඔවුහු ඔහුට මෙසේ කියන්නාහ: \"අම්මෝ පුරුෂය, ඔබ යමක් නොදන්නේ ද, නොදකින්නේ ද, ඔබ ඒ ප්‍රාසාදයට නැගීම පිණිස ඉනිමඟක් සාදන්නේ ද?\" මෙසේ විමසූ කල්හි ඔහු \"එසේය\" යි කියන්නේ ය.",
      "paliTitle": "Nisseṇīupamā",
      "englishTitle": "The Ladder Simile",
      "sinhalaTitle": "නිසේණි උපමාව"
    },
    {
      "number": 539,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, nanu evaṃ sante tassa purisassa appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bho gotama, evaṃ sante tassa purisassa appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti.",
      "english": "“Vāseṭṭha, do you not think that, this being the case, that person’s utterance would turn out to be futile?” “Indeed, Reverend Gotama, this being the case, that person’s utterance would turn out to be futile.”",
      "sinhala": "වාසේට්ඨය, ඔබ කුමක් සිතන්නෙහිද? එසේ තිබියදී, ඒ පුරුෂයාගේ කියමන අප්‍රතිහත වූවක් නොවේද?\nඇත්තෙන්ම, භවත් ගෝතමයනි, එසේ තිබියදී ඒ පුරුෂයාගේ කියමන අප්‍රතිහත වූවක්ම වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 540,
      "pali": "‘‘Evameva kho, vāseṭṭha, na kira tevijjehi brāhmaṇehi brahmā sakkhidiṭṭho, napi kira tevijjānaṃ brāhmaṇānaṃ ācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṃ brāhmaṇānaṃ ācariyapācariyehi brahmā sakkhidiṭṭho, napi kira tevijjānaṃ brāhmaṇānaṃ yāva sattamā ācariyāmahayugehi brahmā sakkhidiṭṭho. Yepi kira tevijjānaṃ brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro, yesamidaṃ etarahi tevijjā brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samihitaṃ, tadanugāyanti, tadanubhāsanti, bhāsitamanubhāsanti, vācitamanuvācenti, seyyathidaṃ – aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, tepi na evamāhaṃsu – mayametaṃ jānāma, mayametaṃ passāma, yattha vā brahmā, yena vā brahmā, yahiṃ vā brahmāti. Teva tevijjā brāhmaṇā evamāhaṃsu – ‘‘yaṃ na jānāma, yaṃ na passāma, tassa sahabyatāya maggaṃ desema, ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasahabyatāyā’’ti.",
      "english": "Just so, Vāseṭṭha, it seems that the triple-Veda Brahmins have not seen Brahmā directly. Nor have the teachers of the triple-Veda Brahmins seen Brahmā directly. Nor have the teachers of the teachers of the triple-Veda Brahmins seen Brahmā directly. Nor have the teachers up to the seventh generation of the triple-Veda Brahmins seen Brahmā directly. And it seems that those ancient sages of the triple-Veda Brahmins who were the makers of the mantras and the proclaimers of the mantras – whose ancient mantra-statements are now chanted, spoken, and arranged by these triple-Veda Brahmins, who follow in chanting them, who follow in speaking them, who repeat what was spoken, who recite what was recited – namely, Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu, even they did not say this: ‘We know this, we see this: where Brahmā is, whence Brahmā comes, or whither Brahmā goes.’ Yet, these same triple-Veda Brahmins say this: ‘We teach the path to companionship with that which we do not know and do not see. This is indeed the straight path, this is the direct path, leading to liberation; it leads the practitioner to companionship with Brahmā.’",
      "sinhala": "වාසේට්ඨය, එපරිද්දෙන්ම, ත්‍රිවේදික බ්‍රාහ්මණයන් විසින් බ්‍රහ්මයා දැක නැත. එම ත්‍රිවේදික බ්‍රාහ්මණයන්ගේ ආචාර්යවරුන් විසින්ද බ්‍රහ්මයා දැක නැත. එම ත්‍රිවේදික බ්‍රාහ්මණයන්ගේ ආචාර්ය-ප්‍රාචාර්යවරුන් විසින්ද බ්‍රහ්මයා දැක නැත. එම ත්‍රිවේදික බ්‍රාහ්මණයන්ගේ සත්වන පරම්පරාව දක්වා වූ ආචාර්යවරුන් විසින්ද බ්‍රහ්මයා දැක නැත. යම් හෙයින් ත්‍රිවේදික බ්‍රාහ්මණයන්ගේ පෙර විසූ ඍෂිවරු, මන්ත්‍රයන්ගේ කතුවරු, මන්ත්‍රයන්ගේ ප්‍රචාරකවරු වූවාහුද, යම් අයට අයත් වූ මේ දැන් ත්‍රිවේදික බ්‍රාහ්මණයෝ පෙර පැවති මන්ත්‍ර පද ගායනා කරති, ප්‍රකාශ කරති, සංග්‍රහ කරති, ඒවා අනුගායනා කරති, ඒවා අනුභාෂා කරති, ප්‍රකාශ කළ දේ අනුප්‍රකාශ කරති, උච්චාරණය කළ දේ අනුඋච්චාරණය කරති. එනම්: අට්ඨක, වාමක, වාමදේව, වෛශ්‍යාමිත්‍ර, යමදග්නි, අංගීරස, භාරද්වාජ, වාසේට්ඨ, කාශ්‍යප, භාර්ගව යන ඍෂිවරුන්ය. ඔවුහුද මෙසේ නොකීහ – \"අපි මේ දනිමු, අපි මේ දකිමු, බ්‍රහ්මයා කොතැනක හෝ, කවර දිශාවක හෝ, කවර තත්ත්වයකින් හෝ සිටින බව.\" එසේ වුවත් ඒ ත්‍රිවේදික බ්‍රාහ්මණයෝ මෙසේ කීහ – \"අපි යමක් නොදනිමුද, යමක් නොදකිමුද, එහි සහවාසය පිණිස මාර්ගය දේශනා කරමු. මෙයම සෘජු මාර්ගයයි, මෙයම යහපත් ගමන් මාර්ගයයි, මෙය නිවනට පමුණුවන්නේය, එය කරන්නා බ්‍රහ්ම සහවාසයට පමුණුවයි.\"",
      "paliTitle": ""
    },
    {
      "number": 541,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, nanu evaṃ sante tevijjānaṃ brāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bho gotama, evaṃ sante tevijjānaṃ brāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti. ‘‘Sādhu, vāseṭṭha. Te vata, vāseṭṭha, tevijjā brāhmaṇā yaṃ na jānanti, yaṃ na passanti, tassa sahabyatāya maggaṃ desessanti. Ayameva ujumaggo ayamañjasāyano niyyāniko niyyāti takkarassa brahmasabyatāyāti, netaṃ ṭhānaṃ vijjati. ",
      "english": "What do you think, Vāseṭṭha, given this, doesn't the teaching of the three-Veda Brahmins turn out to be unfounded?\n\nIndeed, Master Gotama, given this, the teaching of the three-Veda Brahmins certainly turns out to be unfounded.\n\nExcellent, Vāseṭṭha. Indeed, Vāseṭṭha, those three-Veda Brahmins teach a path to union with that which they do not know and do not see. They claim, 'This is the direct path, this is the straight way, leading to deliverance, leading the practitioner to union with Brahmā.' Yet, such a thing is impossible.",
      "sinhala": "‘‘වාසේට්ඨය, ඔබ ඒ ගැන කුමක් සිතන්නෙහිද? මෙසේ වූ කල්හි තේවෙද බ්‍රාහ්මණයන්ගේ කියමන පදනම් විරහිත වූවක් නොවේද?’’ ‘‘භවත් ගෞතමයන් වහන්ස, ඇත්තෙන්ම මෙසේ වූ කල්හි තේවෙද බ්‍රාහ්මණයන්ගේ කියමන පදනම් විරහිත වූවක්ම වෙයි.’’ ‘‘සාදු වාසේට්ඨය. වාසේට්ඨය, ඇත්තෙන්ම ඒ තේවෙද බ්‍රාහ්මණයෝ තමන් නොදන්නා, තමන් නොදකින දෙයක සහවාසය පිණිස මාර්ගය දේශනා කරන්නාහ. ‘මෙයම ඍජු මාර්ගයයි, මෙයම පහසු මාර්ගයයි, මෙය නිවනට පමුණුවන්නේය, මෙය ඒ අයුරින් පිළිපදින්නාට බ්‍රහ්ම සහවාසය පිණිස පමුණුවන්නේය’ යැයි කීම, එබඳු තැනක් නොපවතී.’’",
      "paliTitle": ""
    },
    {
      "number": 542,
      "pali": "‘‘Seyyathāpi, vāseṭṭha, ayaṃ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṃ taritukāmo. So orime tīre ṭhito pārimaṃ tīraṃ avheyya – ‘‘ehi pārāpāraṃ, ehi pārāpāra’’nti.",
      "english": "Just as, Vāseṭṭha, this Aciravatī River is full of water, brimful, so a crow could drink from it. Then a man might come, whose purpose is the other shore, seeking the other shore, intending to go to the other shore, desiring to cross to the other shore. He, standing on this near bank, would call out to the far bank: ‘Come, O far bank! Come, O far bank!’",
      "sinhala": "වාසෙට්ඨයෙනි, යම් සේ මේ අචිරවතී නදිය ජලයෙන් පිරී, සමතෙරට පත්ව, කපුටන් හට වුවද පානය කළ හැකි ලෙස පවතී ද, එවිට එතෙර වීමේ අරමුණින්, එතෙර සොයමින්, එතෙරට යන්නට අදහස් කරමින්, එතෙරට පීනා යෑමට කැමැති පුරුෂයෙක් පැමිණෙන්නේය. හෙතෙම මෙතෙර සිටියේ, එතෙරට අඬගසන්නේය: ‘‘එන්න, එතෙරට! එන්න, එතෙරට!’’ කියා.",
      "paliTitle": "Aciravatīnadīupamā",
      "englishTitle": "Simile of the Aciravati River",
      "sinhalaTitle": "අචිරවතී නදී උපමාව"
    },
    {
      "number": 543,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, api nu tassa purisassa avhāyanahetu vā āyācanahetu vā patthanahetu vā abhinandanahetu vā aciravatiyā nadiyā pārimaṃ tīraṃ orimaṃ tīraṃ āgaccheyyā’’ti? ‘‘No hidaṃ, bho gotama’’.",
      "english": "What do you think, Vāseṭṭha, would the far bank of the Aciravatī River come to the near bank simply by that person's calling, or imploring, or wishing, or delighting in it?\nNo, indeed, Venerable Gotama.",
      "sinhala": "වාසෙට්ඨය, ඔබ මේ කුමක් සිතන්නෙහිද? එම පුද්ගලයාට කැඳවීමෙන් හෝ, අයැදීමෙන් හෝ, ප්‍රාර්ථනා කිරීමෙන් හෝ, ප්‍රශංසා කිරීමෙන් හෝ අචිරවතී නදියෙහි එතෙරින් මෙතෙරට පැමිණිය හැකි වේද?\n\nඑසේ නොවේ, ගෞතමයෙනි.",
      "paliTitle": ""
    },
    {
      "number": 544,
      "pali": "‘‘Evameva kho, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā evamāhaṃsu – ‘‘indamavhayāma, somamavhayāma, varuṇamavhayāma, īsānamavhayāma, pajāpatimavhayāma, brahmamavhayāma, mahiddhimavhayāma, yamamavhayāmā’’ti. ‘‘Te vata, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā avhāyanahetu vā āyācanahetu vā patthanahetu vā abhinandanahetu vā kāyassa bhedā paraṃ maraṇā brahmānaṃ sahabyūpagā bhavissantī’’ti, netaṃ ṭhānaṃ vijjati.",
      "english": "Just in the same way, Vasettha, those three-knowledge Brahmins, abandoning the qualities that make one a true Brahmin and living by adopting the qualities that do not make one a Brahmin, spoke thus: ‘We invoke Indra, we invoke Soma, we invoke Varuna, we invoke Isana, we invoke Prajapati, we invoke Brahma, we invoke Mahiddhi, we invoke Yama!’ Surely, Vasettha, it is not possible that those three-knowledge Brahmins, abandoning the qualities that make one a true Brahmin and living by adopting the qualities that do not make one a Brahmin, will attain companionship with Brahma after the dissolution of the body and after death, merely on account of invoking, or on account of imploring, or on account of wishing, or on account of delighting.",
      "sinhala": "එපරිද්දෙන්ම, වාසෙට්ඨය, යම් ධර්ම කෙනෙක් බ්‍රාහ්මණ භාවය ඇතිකරවද්ද, ඒ ධර්මයන් අත්හැර දමා, යම් ධර්ම කෙනෙක් බ්‍රාහ්මණ භාවය ඇති නොකරවද්ද, ඒ ධර්මයන් සමාදන්ව වෙසෙන්නා වූ ත්‍රිවිද්‍යා බ්‍රාහ්මණයෝ මෙසේ කීහ: \"අපි ඉන්ද්‍රයාට ආරාධනා කරමු, සෝමයාට ආරාධනා කරමු, වරුණයාට ආරාධනා කරමු, ඊසානට ආරාධනා කරමු, ප්‍රජාපතීට ආරාධනා කරමු, බ්‍රහ්මයාට ආරාධනා කරමු, මහඍද්ධිමත් දෙවියන්ට ආරාධනා කරමු, යමයාට ආරාධනා කරමු.\"\n\nවාසෙට්ඨය, යම් ධර්ම කෙනෙක් බ්‍රාහ්මණ භාවය ඇතිකරවද්ද, ඒ ධර්මයන් අත්හැර දමා, යම් ධර්ම කෙනෙක් බ්‍රාහ්මණ භාවය ඇති නොකරවද්ද, ඒ ධර්මයන් සමාදන්ව වෙසෙන්නා වූ ඒ ත්‍රිවිද්‍යා බ්‍රාහ්මණයෝ ආරාධනා කිරීමේ හේතුවෙන් හෝ, යාච්ඤා කිරීමේ හේතුවෙන් හෝ, ප්‍රාර්ථනා කිරීමේ හේතුවෙන් හෝ, අභිනන්දනය කිරීමේ හේතුවෙන් හෝ ශරීරය බිඳී මරණින් මතු බ්‍රහ්මයාගේ සහවාසයට පැමිණෙත්වා යනු ඒ තැනක් නොපවතී.",
      "paliTitle": ""
    },
    {
      "number": 545,
      "pali": "‘‘Seyyathāpi, vāseṭṭha, ayaṃ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṃ taritukāmo. So orime tīre daḷhāya anduyā pacchābāhaṃ gāḷhabandhanaṃ baddho. ‘‘Taṃ kiṃ maññasi, vāseṭṭha, api nu so puriso aciravatiyā nadiyā orimā tīrā pārimaṃ tīraṃ gaccheyyā’’ti? ‘‘No hidaṃ, bho gotama’’.",
      "english": "Just as, Vāseṭṭha, this Aciravatī River might be full of water, brimful, where a crow could drink. Then a man might come, intent on the other shore, seeking the other shore, going to the other shore, desiring to cross to the other shore. That person is bound on this shore with a strong rope, his arms tightly bound behind his back. What do you think, Vāseṭṭha, could that person cross from this shore of the Aciravatī River to the other shore?\n\nCertainly not, Venerable Gotama.",
      "sinhala": "වාසෙට්ඨය, යම්සේ මේ අචිරවතී නදිය ජලයෙන් පිරී, ඉවුරු සමඟ සම තැනට පත් වූ, කපුටෙකුට පවා පානය කළ හැකි තරම් තිබුණාය. එවිට එතෙර අරමුණු කරගත්, එතෙර සොයන, එතෙරට යන, එතෙර වීමට කැමති පුරුෂයෙක් පැමිණෙන්නේය. හෙතෙම මෙගොඩ ඉවුරේ, දැඩි ලණුවකින්, පිටුපසට අත් බැඳ, තදින් බැඳී සිටින්නේය. \"වාසෙට්ඨය, ඔබ කුමක් සිතන්නෙහිද, ඒ පුරුෂයා අචිරවතී නදියේ මෙගොඩ ඉවුරෙන් එගොඩ ඉවුරට යන්නේද?\"\n\n\"භවත් ගෞතමය, එසේ නොවේ.\"",
      "paliTitle": ""
    },
    {
      "number": 546,
      "pali": "‘‘Evameva kho, vāseṭṭha, pañcime kāmaguṇā ariyassa vinaye andūtipi vuccanti, bandhanantipi vuccanti. Katame pañca? Cakkhuviññeyyā rūpā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. Sotaviññeyyā saddā…pe… ghānaviññeyyā gandhā… jivhāviññeyyā rasā… kāyaviññeyyā phoṭṭhabbā iṭṭhā kantā manāpā piyarūpā kāmūpasaṃhitā rajanīyā. ‘‘Ime kho, vāseṭṭha, pañca kāmaguṇā ariyassa vinaye andūtipi vuccanti, bandhanantipi vuccanti. Ime kho vāseṭṭha pañca kāmaguṇe tevijjā brāhmaṇā gadhitā mucchitā ajjhopannā anādīnavadassāvino anissaraṇapaññā paribhuñjanti. Te vata, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā, te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā, te dhamme samādāya vattamānā pañca kāmaguṇe gadhitā mucchitā ajjhopannā anādīnavadassāvino anissaraṇapaññā paribhuñjantā kāmandubandhanabaddhā kāyassa bhedā paraṃ maraṇā brahmānaṃ sahabyūpagā bhavissantī’’ti, netaṃ ṭhānaṃ vijjati.",
      "english": "Indeed, Vāseṭṭha, these five cords of sensual pleasure are called fetters and bonds in the Noble Discipline. Which five? Forms cognizable by the eye that are desirable, agreeable, charming, pleasing, connected with sensuality, and enticing; sounds cognizable by the ear that are desirable, agreeable, charming, pleasing, connected with sensuality, and enticing; smells cognizable by the nose that are desirable, agreeable, charming, pleasing, connected with sensuality, and enticing; tastes cognizable by the tongue that are desirable, agreeable, charming, pleasing, connected with sensuality, and enticing; and tactile objects cognizable by the body that are desirable, agreeable, charming, pleasing, connected with sensuality, and enticing.\n\nIndeed, Vāseṭṭha, these five cords of sensual pleasure are called fetters and bonds in the Noble Discipline. These five cords of sensual pleasure, Vāseṭṭha, are enjoyed by the 'three-knowledge' brahmins who are infatuated, deluded, and engrossed, not seeing the danger, and lacking the wisdom to escape. It is impossible, Vāseṭṭha, that those 'three-knowledge' brahmins—who, abandoning the practices that make one a brahmin and adopting the practices that do not make one a brahmin, partake of these five cords of sensual pleasure, infatuated, deluded, and engrossed, not seeing the danger and lacking the wisdom to escape, bound by the fetter of sensuality—will, after the body's dissolution, after death, attain companionship with Brahmā.",
      "sinhala": "‘‘වාසෙට්ඨය, මේ අයුරින්ම මේ පස්කම් ගුණ ආර්ය විනයෙහි හිරගෙයක් ලෙසද, බැම්මක් ලෙසද කියනු ලැබේ.\n\nඒ පස්කම් ගුණ කවරේද? ඇසෙන් දැනගත හැකි, කැමති, ප්‍රිය, සිත්කලු, මනාප, කාමයට සම්බන්ධ වූ, ඇලීමට හේතුවන රූප; කනෙන් දැනගත හැකි, කැමති, ප්‍රිය, සිත්කලු, මනාප, කාමයට සම්බන්ධ වූ, ඇලීමට හේතුවන ශබ්ද; නාසයෙන් දැනගත හැකි, කැමති, ප්‍රිය, සිත්කලු, මනාප, කාමයට සම්බන්ධ වූ, ඇලීමට හේතුවන ගන්ධ; දිවෙන් දැනගත හැකි, කැමති, ප්‍රිය, සිත්කලු, මනාප, කාමයට සම්බන්ධ වූ, ඇලීමට හේතුවන රස; කයින් දැනගත හැකි, කැමති, ප්‍රිය, සිත්කලු, මනාප, කාමයට සම්බන්ධ වූ, ඇලීමට හේතුවන ස්පර්ශ යනුයි.\n\n‘‘වාසෙට්ඨය, මේ පස්කම් ගුණ ආර්ය විනයෙහි හිරගෙයක් ලෙසද, බැම්මක් ලෙසද කියනු ලැබේ.\n\nවාසෙට්ඨය, මේ පස්කම් ගුණ ත්‍රි​වේද​ඥ බ්‍රා​හ්මණයෝ දැඩි ලෙස ඇලී, මුසපත් වී, ගිලී සිටිමින්, ආදීනව නොදක්නාසුලු ස්වභාවයෙන්ද, නික්මීමේ ප්‍ර​ඥාවකින් තොරවද පරිභෝග කරති.\n\nවාසෙට්ඨය, ඒ ත්‍රි​වේද​ඥ බ්‍රා​හ්මණයෝ, බ්‍රා​හ්මණත්වය ඇති කරවන යම් ධ​ර්ම කාරණා ඇත්නම්, ඒ ධ​ර්ම කාරණා අත්හැර හැසිරෙමින්, බ්‍රා​හ්මණත්වය නැති කරවන යම් ධ​ර්ම කාරණා ඇත්නම්, ඒ ධ​ර්ම කාරණා සමාදන්ව හැසිරෙමින්, පස්කම් ගුණෙහි දැඩි ලෙස ඇලී, මුසපත් වී, ගිලී සිටිමින්, ආදීනව නොදක්නාසුලු ස්වභාවයෙන්ද, නික්මීමේ ප්‍ර​ඥාවකින් තොරවද ඒවා පරිභෝග කරමින්, කාම නම් වූ හිරගෙදර බැම්මෙන් බැඳී, කය බිඳීමෙන් මරණින් පසුව බ්‍රහ්මයන් සමඟ සහවාසයට පත් වනු ඇතැයි කීම සිදු විය නොහැක.",
      "paliTitle": ""
    },
    {
      "number": 547,
      "pali": "‘‘Seyyathāpi, vāseṭṭha, ayaṃ aciravatī nadī pūrā udakassa samatittikā kākapeyyā. Atha puriso āgaccheyya pāratthiko pāragavesī pāragāmī pāraṃ taritukāmo. So orime tīre sasīsaṃ pārupitvā nipajjeyya. ‘‘Taṃ kiṃ maññasi, vāseṭṭha, api nu so puriso aciravatiyā nadiyā orimā tīrā pārimaṃ tīraṃ gaccheyyā’’ti? ‘‘No hidaṃ, bho gotama’’.",
      "english": "Just as, Vasettha, this Aciravati River is full of water, brimming to the banks, where a crow could drink. Then a man might come, intent on the other shore, seeking the other shore, going towards the other shore, desiring to cross to the other shore. He, on this bank, would lie down, covering his head. What do you think, Vasettha, would that man go from this bank of the Aciravati River to the other bank?\nCertainly not, Reverend Gotama.",
      "sinhala": "වසෙට්ඨයෙනි, යම් සේ ද, මේ අචිරවතී නදිය ජලයෙන් පිරී සමතෙක් මට්ටමට, කපුටන්ට බීමට හැකි තරම් වේ ද. එතෙර වීමට අදහස් කරන්නෙක්, එතෙර සොයන්නෙක්, එතෙරට යන්නෙක්, එතෙර වීමට කැමති වූ එක් පුරුෂයෙක් පැමිණෙන්නේය. හෙතෙම මේ අත දාහේ හිස ද වසාගෙන නිදාගන්නේය. වසෙට්ඨයෙනි, මේ කුමක් සිතන්නෙහි ද? ඒ පුරුෂයා අචිරවතී නදියෙන් මේ අත දාහේ සිට එතෙර දාහේට යන්නේ ද? \"නැත, භවත් ගෞතමයන් වහන්ස.\"",
      "paliTitle": ""
    },
    {
      "number": 548,
      "pali": "‘‘Evameva kho, vāseṭṭha, pañcime nīvaraṇā ariyassa vinaye āvaraṇātipi vuccanti, nīvaraṇātipi vuccanti, onāhanātipi vuccanti, pariyonāhanātipi vuccanti. Katame pañca? Kāmacchandanīvaraṇaṃ, byāpādanīvaraṇaṃ, thinamiddhanīvaraṇaṃ, uddhaccakukkuccanīvaraṇaṃ, vicikicchānīvaraṇaṃ. Ime kho, vāseṭṭha, pañca nīvaraṇā ariyassa vinaye āvaraṇātipi vuccanti, nīvaraṇātipi vuccanti, onāhanātipi vuccanti, pariyonāhanātipi vuccanti.",
      "english": "Just so, Vasettha, these five hindrances in the Noble Discipline are called 'coverings,' are called 'hindrances,' are called 'binders,' and are called 'envelopers.' Which five? The hindrance of sensual desire, the hindrance of ill-will, the hindrance of sloth and torpor, the hindrance of restlessness and remorse, and the hindrance of doubt. These five hindrances, Vasettha, in the Noble Discipline are called 'coverings,' are called 'hindrances,' are called 'binders,' and are called 'envelopers.'",
      "sinhala": "එලෙසින්ම, වාසෙට්ඨය, මේ පංච නීවරණ ආර්ය​ විනයෙහි ආවරණ යැයිද කියනු ලැබේ, නීවරණ යැයිද කියනු ලැබේ, ඔනාහන යැයිද කියනු ලැබේ, පරියෝනාහන යැයිද කියනු ලැබේ. ඒ කවර පසක්ද? කාමච්ඡන්ද නීවරණය, ව්‍යාපාද නීවරණය, ථීනමිද්ධ නීවරණය, උද්ධච්චකුක්කුච්ච නීවරණය, විචිකිච්ඡා නීවරණයයි. වාසෙට්ඨය, මේ පංච නීවරණ ආර්ය​ විනයෙහි ආවරණ යැයිද කියනු ලැබේ, නීවරණ යැයිද කියනු ලැබේ, ඔනාහන යැයිද කියනු ලැබේ, පරියෝනාහන යැයිද කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 549,
      "pali": "‘‘Imehi kho, vāseṭṭha, pañcahi nīvaraṇehi tevijjā brāhmaṇā āvuṭā nivuṭā onaddhā [ophuṭā (sī. ka.), ophutā (syā.)] pariyonaddhā. Te vata, vāseṭṭha, tevijjā brāhmaṇā ye dhammā brāhmaṇakārakā te dhamme pahāya vattamānā, ye dhammā abrāhmaṇakārakā te dhamme samādāya vattamānā pañcahi nīvaraṇehi āvuṭā nivuṭā onaddhā pariyonaddhā [pariyonaddhā, te (syā. ka.)] kāyassa bhedā paraṃ maraṇā brahmānaṃ sahabyūpagā bhavissantī’’ti, netaṃ ṭhānaṃ vijjati.",
      "english": "Indeed, Vāseṭṭha, the triple-knowledge Brahmins are enveloped, covered, bound, and fettered by these five hindrances. It is not possible, Vāseṭṭha, that these triple-knowledge Brahmins – who abandon the qualities that make one a true Brahmin and embrace the qualities that do not make one a Brahmin, being enveloped, covered, bound, and fettered by the five hindrances – will, with the breaking up of the body, after death, attain companionship with Brahmā.",
      "sinhala": "වෙසෙසින්ම, වාසෙට්ඨය, ත්‍රිවේද බ්‍රාහ්මණයෝ මේ පංච නීවරණයන්ගෙන් වැසී, ආවරණය වී, බැඳී, මුළුමනින්ම වෙලී සිටිති. එසේනම්, වාසෙට්ඨය, යම් ධර්මයන් බ්‍රාහ්මණයෙකු බවට පත් කරන්නේද, ඒ ධර්මයන් අත්හැර වෙසෙමින්, යම් ධර්මයන් බ්‍රාහ්මණයෙකු නොකරන්නේද, ඒ ධර්මයන් පිළිගෙන වෙසෙමින්, මේ පංච නීවරණයන්ගෙන් වැසී, ආවරණය වී, බැඳී, මුළුමනින්ම වෙලී සිටින ත්‍රිවේද බ්‍රාහ්මණයන් කය බිඳී මරණින් පසු බ්‍රහ්මයන් සමඟ සහවාසයට පත්වනු ඇතැයි කීම, එබඳු තැනක් නොපවතී.",
      "paliTitle": ""
    },
    {
      "number": 550,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, kinti te sutaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ, sapariggaho vā brahmā apariggaho vā’’ti? ‘‘Apariggaho, bho gotama’’. ‘‘Saveracitto vā averacitto vā’’ti? ‘‘Averacitto, bho gotama’’. ‘‘Sabyāpajjacitto vā abyāpajjacitto vā’’ti? ‘‘Abyāpajjacitto, bho gotama’’. ‘‘Saṃkiliṭṭhacitto vā asaṃkiliṭṭhacitto vā’’ti? ‘‘Asaṃkiliṭṭhacitto, bho gotama’’. ‘‘Vasavattī vā avasavattī vā’’ti? ‘‘Vasavattī, bho gotama’’. ‘‘Taṃ kiṃ maññasi, vāseṭṭha, sapariggahā vā tevijjā brāhmaṇā apariggahā vā’’ti? ‘‘Sapariggahā, bho gotama’’. ‘‘Saveracittā vā averacittā vā’’ti? ‘‘Saveracittā, bho gotama’’. ‘‘Sabyāpajjacittā vā abyāpajjacittā vā’’ti? ‘‘Sabyāpajjacittā, bho gotama’’. ‘‘Saṃkiliṭṭhacittā vā asaṃkiliṭṭhacittā vā’’ti? ‘‘Saṃkiliṭṭhacittā, bho gotama’’. ‘‘Vasavattī vā avasavattī vā’’ti? ‘‘Avasavattī, bho gotama’’.",
      "english": "\"What do you think, Vasettha, what have you heard the elder, aged Brahmins, your teachers and ancestral teachers, say: Is Brahmā with possessions or without possessions?\" \"Without possessions, Reverend Gotama.\" \"Is his mind with ill-will or without ill-will?\" \"Without ill-will, Reverend Gotama.\" \"Is his mind with harmful intent or without harmful intent?\" \"Without harmful intent, Reverend Gotama.\" \"Is his mind defiled or undefiled?\" \"Undefiled, Reverend Gotama.\" \"Does he have power, or does he not have power?\" \"He has power, Reverend Gotama.\" \"What do you think, Vasettha, are the Brahmins skilled in the Three Vedas with possessions or without possessions?\" \"With possessions, Reverend Gotama.\" \"Are their minds with ill-will or without ill-will?\" \"With ill-will, Reverend Gotama.\" \"Are their minds with harmful intent or without harmful intent?\" \"With harmful intent, Reverend Gotama.\" \"Are their minds defiled or undefiled?\" \"Defiled, Reverend Gotama.\" \"Do they have power, or do they not have power?\" \"They do not have power, Reverend Gotama.\"",
      "sinhala": "වසෙට්ඨය, ඔබ මේ ගැන කුමක් සිතනවාද? බමුණන්, වැඩිහිටියන්, මහල්ලන්, ආචාර්යවරුන් සහ ප්‍රාචාර්යවරුන් පවසන දේ අනුව, බ්‍රහ්මා ඇල්ම සහිත ද, නැතහොත් ඇල්ම රහිත ද? ගෞතමයන් වහන්ස, ඇල්ම රහිත ය. වෛර සිත් ඇති ද, නැතහොත් වෛර සිත් නැති ද? ගෞතමයන් වහන්ස, වෛර සිත් නැති ය. ද්වේෂ සහිත සිත් ඇති ද, නැතහොත් ද්වේෂ රහිත සිත් ඇති ද? ගෞතමයන් වහන්ස, ද්වේෂ රහිත සිත් ඇති ය. කිලිටි වූ සිතක් ඇති ද, නැතහොත් කිලිටි නොවූ සිතක් ඇති ද? ගෞතමයන් වහන්ස, කිලිටි නොවූ සිතක් ඇති ය. තමාට වසඟ වූ ද, නැතහොත් තමාට වසඟ නොවූ ද? ගෞතමයන් වහන්ස, තමාට වසඟ වූ ය. වසෙට්ඨය, ඔබ මේ ගැන කුමක් සිතනවාද? තෙවිජ්ජ බමුණෝ ඇල්ම සහිත ද, නැතහොත් ඇල්ම රහිත ද? ගෞතමයන් වහන්ස, ඇල්ම සහිත ය. වෛර සිත් ඇති ද, නැතහොත් වෛර සිත් නැති ද? ගෞතමයන් වහන්ස, වෛර සිත් ඇති ය. ද්වේෂ සහිත සිත් ඇති ද, නැතහොත් ද්වේෂ රහිත සිත් ඇති ද? ගෞතමයන් වහන්ස, ද්වේෂ සහිත සිත් ඇති ය. කිලිටි වූ සිතක් ඇති ද, නැතහොත් කිලිටි නොවූ සිතක් ඇති ද? ගෞතමයන් වහන්ස, කිලිටි වූ සිතක් ඇති ය. තමාට වසඟ වූ ද, නැතහොත් තමාට වසඟ නොවූ ද? ගෞතමයන් වහන්ස, තමාට වසඟ නොවූ ය.",
      "paliTitle": "Saṃsandanakathā",
      "englishTitle": "Discourse on Comparison",
      "sinhalaTitle": "සංසන්‍දන කථාව"
    },
    {
      "number": 551,
      "pali": "‘‘Iti kira, vāseṭṭha, sapariggahā tevijjā brāhmaṇā apariggaho brahmā. Api nu kho sapariggahānaṃ tevijjānaṃ brāhmaṇānaṃ apariggahena brahmunā saddhiṃ saṃsandati sametī’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Sādhu, vāseṭṭha, te vata, vāseṭṭha, sapariggahā tevijjā brāhmaṇā kāyassa bhedā paraṃ maraṇā apariggahassa brahmuno sahabyūpagā bhavissantī’’ti, netaṃ ṭhānaṃ vijjati. ‘‘Iti kira, vāseṭṭha, saveracittā tevijjā brāhmaṇā, averacitto brahmā…pe… sabyāpajjacittā tevijjā brāhmaṇā abyāpajjacitto brahmā… saṃkiliṭṭhacittā tevijjā brāhmaṇā asaṃkiliṭṭhacitto brahmā… avasavattī tevijjā brāhmaṇā vasavattī brahmā, api nu kho avasavattīnaṃ tevijjānaṃ brāhmaṇānaṃ vasavattinā brahmunā saddhiṃ saṃsandati sametī’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Sādhu, vāseṭṭha, te vata, vāseṭṭha, avasavattī tevijjā brāhmaṇā kāyassa bhedā paraṃ maraṇā vasavattissa brahmuno sahabyūpagā bhavissantī’’ti, netaṃ ṭhānaṃ vijjati.",
      "english": "“So then, Vāseṭṭha, the Brahmins learned in the three Vedas possess possessions, while Brahmā is unencumbered. Does it then accord or tally, for Brahmins learned in the three Vedas who possess possessions, with Brahmā who is unencumbered?”\n“No indeed, Venerable Gotama.”\n“Well then, Vāseṭṭha, it is indeed the case that those Brahmins learned in the three Vedas who possess possessions, after the breaking up of the body, after death, will become companions of Brahmā who is unencumbered – such a state of affairs is impossible.”\n\n“So then, Vāseṭṭha, the Brahmins learned in the three Vedas have minds full of enmity, while Brahmā has a mind free from enmity. The Brahmins learned in the three Vedas have minds full of ill-will, while Brahmā has a mind free from ill-will. The Brahmins learned in the three Vedas have defiled minds, while Brahmā has an undefiled mind. The Brahmins learned in the three Vedas are not in control, while Brahmā is in control. Does it then accord or tally, for Brahmins learned in the three Vedas who are not in control, with Brahmā who is in control?”\n“No indeed, Venerable Gotama.”\n“Well then, Vāseṭṭha, it is indeed the case that those Brahmins learned in the three Vedas who are not in control, after the breaking up of the body, after death, will become companions of Brahmā who is in control – such a state of affairs is impossible.”",
      "sinhala": "වාසෙට්ඨය, ත්‍රිවේදී බ්‍රාහ්මණයෝ සපරිග්‍රහ වන බවත්, බ්‍රහ්මයා අපරිග්‍රහ වන බවත් එසේ කියනු ලැබේ. එසේ කල්හි, සපරිග්‍රහ වූ ත්‍රිවේදී බ්‍රාහ්මණයෝ අපරිග්‍රහ වූ බ්‍රහ්මයා සමඟ ගැලපෙත්ද, සමපාත වෙත්ද?\n\nනැත, භාග්‍යවතුන් වහන්ස. සාධු, වාසෙට්ඨය. වාසෙට්ඨය, සපරිග්‍රහ වූ ඒ ත්‍රිවේදී බ්‍රාහ්මණයෝ, කය බිඳී මරණයෙන් පසු, අපරිග්‍රහ වූ බ්‍රහ්මයාගේ සහචර භාවයට පත්වීමක් නම් විය නොහැකි කරුණකි.\n\nවාසෙට්ඨය, ත්‍රිවේදී බ්‍රාහ්මණයෝ වෛර සහිත සිත් ඇත්තෝ වන බවත්, බ්‍රහ්මයා වෛර රහිත සිත් ඇත්තෙක් වන බවත් එසේ කියනු ලැබේ. ත්‍රිවේදී බ්‍රාහ්මණයෝ ව්‍යාපාද සහිත සිත් ඇත්තෝ වන අතර බ්‍රහ්මයා ව්‍යාපාද රහිත සිත් ඇත්තෙකි. ත්‍රිවේදී බ්‍රාහ්මණයෝ කිලිටි වූ සිත් ඇත්තෝ වන අතර බ්‍රහ්මයා නොකිලිටි සිත් ඇත්තෙකි. ත්‍රිවේදී බ්‍රාහ්මණයෝ අස්වාධීන අය වන අතර බ්‍රහ්මයා ස්වාධීන අයෙකි. එසේ කල්හි, අස්වාධීන වූ ත්‍රිවේදී බ්‍රාහ්මණයෝ ස්වාධීන වූ බ්‍රහ්මයා සමඟ ගැලපෙත්ද, සමපාත වෙත්ද?\n\nනැත, භාග්‍යවතුන් වහන්ස. සාධු, වාසෙට්ඨය. වාසෙට්ඨය, අස්වාධීන වූ ඒ ත්‍රිවේදී බ්‍රාහ්මණයෝ, කය බිඳී මරණයෙන් පසු, ස්වාධීන වූ බ්‍රහ්මයාගේ සහචර භාවයට පත්වීමක් නම් විය නොහැකි කරුණකි.",
      "paliTitle": ""
    },
    {
      "number": 552,
      "pali": "‘‘Idha kho pana te, vāseṭṭha, tevijjā brāhmaṇā āsīditvā [ādisitvā (ka.)] saṃsīdanti, saṃsīditvā visāraṃ [visādaṃ (sī. pī.), visattaṃ (syā.)] pāpuṇanti, sukkhataraṃ [sukkhataraṇaṃ (ka.)] maññe taranti. Tasmā idaṃ tevijjānaṃ brāhmaṇānaṃ tevijjāiriṇantipi vuccati, tevijjāvivanantipi vuccati, tevijjābyasanantipi vuccatī’’ti.",
      "english": "Here, Vāseṭṭha, these three-Veda brahmins, having committed themselves, collapse; having collapsed, they fall into despondency. I believe they are crossing a barren riverbed. Therefore, for these three-Veda brahmins, this is called the three-Veda wasteland, it is called the three-Veda wilderness, and it is called the three-Veda calamity.",
      "sinhala": "වාසේට්ඨය, මෙහිදී මේ තෙවිජ්ජ බ්‍රාහ්මණයෝ පිහිටා සිටියදීම ගිලී යති. එසේ ගිලී ගොස් විසාදයට පත් වෙති. මට සිතෙන්නේ ඔවුන් වියළි තොටක් තරණය කරන බවයි. එබැවින් මෙය තෙවිජ්ජ බ්‍රාහ්මණයන්ගේ තෙවිජ්ජා ඉරිණයක් යැයිද, තෙවිජ්ජා විවනයක් යැයිද, තෙවිජ්ජා ව්‍යසනයක් යැයිද කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 553,
      "pali": "Evaṃ vutte, vāseṭṭho māṇavo bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama, samaṇo gotamo brahmānaṃ sahabyatāya maggaṃ jānātī’’ti. ‘‘Taṃ kiṃ maññasi, vāseṭṭha. Āsanne ito manasākaṭaṃ, na ito dūre manasākaṭa’’nti? ‘‘Evaṃ, bho gotama, āsanne ito manasākaṭaṃ, na ito dūre manasākaṭa’’nti.",
      "english": "When this was said, the young Brahmin Vāseṭṭha said this to the Blessed One: \"I have heard this, Master Gotama, that Ascetic Gotama knows the path to companionship with Brahmā.\"\n\n\"What do you think about this, Vāseṭṭha? Is Manasākaṭa near from here, or is it not far from here?\"\n\n\"Yes, Master Gotama, Manasākaṭa is near from here; it is not far from here.\"",
      "sinhala": "මෙසේ පැවසූ කල්හි වාසෙට්ඨ මානවකයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"භවත් ගෞතමයන් වහන්ස, ශ්‍රමණ ගෞතමයන් වහන්සේ බ්‍රහ්මයන්ගේ සහවාසයට මාර්ගය දන්නා බව මට අසන්නට ලැබුණි.\" \"වාසෙට්ඨය, ඔබ කුමක් සිතන්නෙහිද? මනසාකටය මෙතැනට සමීපද, මෙතැනින් දුරින් නොවේද?\" \"එසේය, භවත් ගෞතමයන් වහන්ස, මනසාකටය මෙතැනට සමීපය, මෙතැනින් දුරින් නොවේ.\"",
      "paliTitle": ""
    },
    {
      "number": 554,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, idhassa puriso manasākaṭe jātasaṃvaddho. Tamenaṃ manasākaṭato tāvadeva avasaṭaṃ manasākaṭassa maggaṃ puccheyyuṃ. Siyā nu kho, vāseṭṭha, tassa purisassa manasākaṭe jātasaṃvaddhassa manasākaṭassa maggaṃ puṭṭhassa dandhāyitattaṃ vā vitthāyitattaṃ vā’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Taṃ kissa hetu’’? ‘‘Amu hi, bho gotama, puriso manasākaṭe jātasaṃvaddho, tassa sabbāneva manasākaṭassa maggāni suviditānī’’ti. ‘‘Siyā kho, vāseṭṭha, tassa purisassa manasākaṭe jātasaṃvaddhassa manasākaṭassa maggaṃ puṭṭhassa dandhāyitattaṃ vā vitthāyitattaṃ vā, na tveva tathāgatassa brahmaloke vā brahmalokagāminiyā vā paṭipadāya puṭṭhassa dandhāyitattaṃ vā vitthāyitattaṃ vā. Brahmānaṃ cāhaṃ, vāseṭṭha, pajānāmi brahmalokañca brahmalokagāminiñca paṭipadaṃ, yathā paṭipanno ca brahmalokaṃ upapanno, tañca pajānāmī’’ti.",
      "english": "“What do you think, Vāseṭṭha, suppose there was a person here who was born and raised in Manasākaṭa. Then, if someone were to ask him, immediately after he had come away from Manasākaṭa, about the path to Manasākaṭa, would that person, Vāseṭṭha, who was born and raised in Manasākaṭa, when asked about the path to Manasākaṭa, hesitate or be perplexed?” “Certainly not, Venerable Gotama.” “For what reason?” “Indeed, Venerable Gotama, that person was born and raised in Manasākaṭa; all the paths to Manasākaṭa are well known to him.” “It is possible, Vāseṭṭha, that even that person, born and raised in Manasākaṭa, when asked about the path to Manasākaṭa, might hesitate or be perplexed; but the Tathāgata, when asked about the Brahma-world or the path leading to the Brahma-world, would never hesitate or be perplexed. For I, Vāseṭṭha, know Brahmā, and the Brahma-world, and the path leading to the Brahma-world, and how one, by following that path, is reborn in the Brahma-world – that too I know.”",
      "sinhala": "වසෙට්ඨය, ඔබ කුමක් සිතන්නෙහිද? යම් පුරුෂයෙක් මනසාකට නුවර ඉපිද හැදී වැඩුණේ යැයි සිතමු. ඔහුව මනසාකට නුවරින් බැහැර කොට, මනසාකට නුවරට යන මාර්ගය විමසන්නේ නම්, වසෙට්ඨය, මනසාකට නුවර ඉපිද හැදී වැඩුණු ඒ පුරුෂයාට, මනසාකට නුවරට යන මග විමසූ විට, මන්දගාමී බවක් හෝ ව්‍යාකූල බවක් ඇති වේද?\n\nනොවන්නේය, භවත් ගෞතමය.\n\nඑයට හේතුව කුමක්ද?\n\nභවත් ගෞතමය, ඒ පුරුෂයා මනසාකට නුවර ඉපිද හැදී වැඩුණු අයෙකි. ඔහුට මනසාකට නුවරට යන සියලු මාර්ග හොඳින් ප්‍රකටය.\n\nවසෙට්ඨය, මනසාකට නුවර ඉපිද හැදී වැඩුණු ඒ පුරුෂයාට, මනසාකට නුවරට යන මග විමසූ විට, මන්දගාමී බවක් හෝ ව්‍යාකූල බවක් ඇති විය හැකි නමුත්, තථාගතයන් වහන්සේට බ්‍රහ්ම ලෝකය හෝ බ්‍රහ්ම ලෝකයට යන ප්‍රතිපදාව ගැන විමසූ විට මන්දගාමී බවක් හෝ ව්‍යාකූල බවක් ඇති නොවන්නේය. වසෙට්ඨය, මම බ්‍රහ්මයාද, බ්‍රහ්ම ලෝකයද, බ්‍රහ්ම ලෝකයට යන ප්‍රතිපදාවද, කෙසේ පිළිපැදීමෙන් බ්‍රහ්ම ලෝකයට උපත ලබන්නේද යන්නද දනිමි.",
      "paliTitle": ""
    },
    {
      "number": 555,
      "pali": "Evaṃ vutte, vāseṭṭho māṇavo bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama, samaṇo gotamo brahmānaṃ sahabyatāya maggaṃ desetī’’ti. ‘‘Sādhu no bhavaṃ gotamo brahmānaṃ sahabyatāya maggaṃ desetu ullumpatu bhavaṃ gotamo brāhmaṇiṃ paja’’nti. ‘‘Tena hi, vāseṭṭha, suṇāhi; sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ bho’’ti kho vāseṭṭho māṇavo bhagavato paccassosi. ",
      "english": "When this was said, the brahmin student Vāseṭṭha said to the Blessed One, “I have heard this, good Gotama: the ascetic Gotama teaches the path to companionship with Brahmā. It would be good if good Gotama would teach us the path to companionship with Brahmā. May good Gotama uplift the brahmin people.” “In that case, Vāseṭṭha, listen; pay careful attention; I will speak,” said the Blessed One. “Yes, sir,” Vāseṭṭha, the brahmin student, replied to the Blessed One.",
      "sinhala": "මෙසේ පැවසූ කල්හි, වාසෙට්ඨ මානවකයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"භවත් ගෞතමයන් වහන්ස, ගෞතම ශ්‍රමණයන් වහන්සේ බ්‍රහ්මයන් සමඟ සහවාසයට මාර්ගය දේශනා කරන බව මා අසා ඇත. භවත් ගෞතමයන් වහන්සේ අපට බ්‍රහ්මයන් සමඟ සහවාසයට මාර්ගය දේශනා කරත්වා! භවත් ගෞතමයන් වහන්සේ බ්‍රාහ්මණ ප්‍රජාව උසස් කරත්වා!\" \"එසේ නම්, වාසෙට්ඨ, අසන්න. මැනවින් මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි\" යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක. \"එසේය, භවත්\" යැයි වාසෙට්ඨ මානවකයා භාග්‍යවතුන් වහන්සේට ප්‍රතිචාර දැක්වීය.",
      "paliTitle": ""
    },
    {
      "number": 556,
      "pali": "Bhagavā etadavoca – ‘‘idha, vāseṭṭha, tathāgato loke uppajjati arahaṃ, sammāsambuddho… pe… (yathā 190-212 anucchedesu evaṃ vitthāretabbaṃ). Evaṃ kho, vāseṭṭha, bhikkhu sīlasampanno hoti…pe… tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṃ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyati. ‘‘So mettāsahagatena cetasā ekaṃ disaṃ pharitvā viharati. Tathā dutiyaṃ. Tathā tatiyaṃ. Tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ mettāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. ‘‘Seyyathāpi, vāseṭṭha, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya; evameva kho, vāseṭṭha, evaṃ bhāvitāya mettāya cetovimuttiyā yaṃ pamāṇakataṃ kammaṃ na taṃ tatrāvasissati, na taṃ tatrāvatiṭṭhati. Ayampi kho, vāseṭṭha, brahmānaṃ sahabyatāya maggo. ‘‘Puna caparaṃ, vāseṭṭha, bhikkhu karuṇāsahagatena cetasā…pe… muditāsahagatena cetasā…pe… upekkhāsahagatena cetasā ekaṃ disaṃ pharitvā viharati. Tathā dutiyaṃ. Tathā tatiyaṃ. Tathā catutthaṃ. Iti uddhamadho tiriyaṃ sabbadhi sabbattatāya sabbāvantaṃ lokaṃ upekkhāsahagatena cetasā vipulena mahaggatena appamāṇena averena abyāpajjena pharitvā viharati. ‘‘Seyyathāpi, vāseṭṭha, balavā saṅkhadhamo appakasireneva catuddisā viññāpeyya. Evameva kho, vāseṭṭha, evaṃ bhāvitāya upekkhāya cetovimuttiyā yaṃ pamāṇakataṃ kammaṃ na taṃ tatrāvasissati, na taṃ tatrāvatiṭṭhati. Ayaṃ kho, vāseṭṭha, brahmānaṃ sahabyatāya maggo.",
      "english": "The Blessed One said this: \"Here, Vāseṭṭha, a Tathāgata arises in the world, an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, sublime, knower of worlds, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One. He makes known this world with its gods, Māras, and Brahmas, this generation with its recluses and brahmins, its gods and humans, having realized it for himself. He teaches the Dhamma good in the beginning, good in the middle, good in the end, with the right meaning and phrasing, and he proclaims the holy life in its entirety and purity. Having heard this Dhamma, a householder or his son, or one reborn in some other family, gains faith in the Tathāgata. Possessed of that faith, he reflects: 'Household life is confining, a path of dust; the life gone forth is wide open.' And so he goes forth from home to homelessness. Having thus gone forth, he lives endowed with moral virtue, guarding the doors of his senses, endowed with mindfulness and clear comprehension, content, and abandoning the five hindrances. When he sees these five hindrances abandoned within himself, gladness arises. To one who is gladdened, rapture arises. To one with a mind rapturous, the body becomes tranquil. One whose body is tranquil experiences happiness. To one who is happy, the mind becomes concentrated.\n\nHe dwells pervading one direction with a mind imbued with loving-kindness. So too the second, so too the third, so too the fourth. Thus, above, below, around, everywhere, universally, he dwells pervading the entire world with a mind imbued with loving-kindness, abundant, exalted, immeasurable, free from enmity, free from ill-will.\n\nJust as, Vāseṭṭha, a strong conch-blower might easily make himself heard in the four directions; even so, Vāseṭṭha, with a mind-release of loving-kindness thus developed, any limited action does not remain there, does not stand there. This too, Vāseṭṭha, is a path to companionship with Brahmā.\n\nAgain, further, Vāseṭṭha, a bhikkhu dwells pervading one direction with a mind imbued with compassion. So too the second, so too the third, so too the fourth. Thus, above, below, around, everywhere, universally, he dwells pervading the entire world with a mind imbued with compassion, abundant, exalted, immeasurable, free from enmity, free from ill-will. Again, further, he dwells pervading one direction with a mind imbued with appreciative joy. So too the second, so too the third, so too the fourth. Thus, above, below, around, everywhere, universally, he dwells pervading the entire world with a mind imbued with appreciative joy, abundant, exalted, immeasurable, free from enmity, free from ill-will. Again, further, he dwells pervading one direction with a mind imbued with equanimity. So too the second, so too the third, so too the fourth. Thus, above, below, around, everywhere, universally, he dwells pervading the entire world with a mind imbued with equanimity, abundant, exalted, immeasurable, free from enmity, free from ill-will.\n\nJust as, Vāseṭṭha, a strong conch-blower might easily make himself heard in the four directions; even so, Vāseṭṭha, with a mind-release of equanimity thus developed, any limited action does not remain there, does not stand there. This, Vāseṭṭha, is a path to companionship with Brahmā.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: ''වාසේට්ඨයෙනි, මෙහි තථාගතයන් වහන්සේ ලෝකයෙහි අරහත්, සම්මාසම්බුද්ධ වශයෙන් පහළ වෙති. (උන්වහන්සේ දේශනා කරන ධර්මය අනුව) වාසේට්ඨයෙනි, මෙසේ භික්ෂුව සීල සම්පන්න වේ. (ඉන්ද්‍රිය සංවරය, සති සම්පජඤ්ඤය ආදිය පුහුණු කරමින්) ඔහු තමා තුළ පහ වූ පංච නීවරණ ඇති බව දකින විට ප්‍රමෝදය ඇති වේ. ප්‍රමුදිත වූ ඔහුට ප්‍රීතිය ඇති වේ. ප්‍රීතිමත් සිත් ඇත්තාගේ කය සංහිඳේ. සංහිඳුණු කය ඇත්තා සැප විඳියි. සැප ඇත්තාගේ සිත සමාධිමත් වේ.\n\nඔහු මෛත්‍රී සහගත සිතින් එක් දිශාවක් පතුරුවා වාසය කරයි. එලෙසම දෙවන, තෙවන, සිව්වන දිශාවද පතුරුවයි. මෙසේ ඉහළ, පහළ, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ මෛත්‍රී සහගත සිතින් මුළු ලෝකයම පතුරුවා වාසය කරයි.\n\n''වාසේට්ඨයෙනි, යම් සේ බලවත් සක් පිඹින්නෙක් කිසිදු අපහසුවකින් තොරව සිව් දිසාවට හඬ පතුරුවයිද; එලෙසම වාසේට්ඨයෙනි, මෙසේ වඩන ලද මෛත්‍රී චේතෝවිමුක්තියෙන් යම් පමණ කළ කර්මයක් වේද, එය එහි ඉතිරි නොවේ, එහි නොපවතී. වාසේට්ඨයෙනි, මෙයද බ්‍රහ්මයන් හා එක්වීමට මාර්ගයකි.\n\nනැවතත් වාසේට්ඨයෙනි, භික්ෂුව කරුණා සහගත සිතින් (මෛත්‍රිය පරිද්දෙන්ම මුළු ලොවටම පතුරුවා) වාසය කරයි. (එලෙසම) මුදිතා සහගත සිතින්ද (මෛත්‍රිය පරිද්දෙන්ම මුළු ලොවටම පතුරුවා) වාසය කරයි. එලෙසම උපේක්ඛා සහගත සිතින්ද එක් දිශාවක් පතුරුවා වාසය කරයි. එලෙසම දෙවන, තෙවන, සිව්වන දිශාවද පතුරුවයි. මෙසේ ඉහළ, පහළ, හරහට, සියලු තැන්හි, සියලු ආකාරයෙන්, වෛර රහිත වූ, ව්‍යාපාද රහිත වූ, මහත් වූ, උදාර වූ, අප්‍රමාණ වූ උපේක්ඛා සහගත සිතින් මුළු ලෝකයම පතුරුවා වාසය කරයි.\n\n''වාසේට්ඨයෙනි, යම් සේ බලවත් සක් පිඹින්නෙක් කිසිදු අපහසුවකින් තොරව සිව් දිසාවට හඬ පතුරුවයිද; එලෙසම වාසේට්ඨයෙනි, මෙසේ වඩන ලද උපේක්ඛා චේතෝවිමුක්තියෙන් යම් පමණ කළ කර්මයක් වේද, එය එහි ඉතිරි නොවේ, එහි නොපවතී. වාසේට්ඨයෙනි, මෙයද බ්‍රහ්මයන් හා එක්වීමට මාර්ගයකි.",
      "paliTitle": "Brahmalokamaggadesanā",
      "englishTitle": "Teaching the Path to Brahmaloka",
      "sinhalaTitle": "බ්‍රහ්ම ලෝක මාර්‍ග දේශනා"
    },
    {
      "number": 557,
      "pali": "‘‘Taṃ kiṃ maññasi, vāseṭṭha, evaṃvihārī bhikkhu sapariggaho vā apariggaho vā’’ti? ‘‘Apariggaho, bho gotama’’. ‘‘Saveracitto vā averacitto vā’’ti? ‘‘Averacitto, bho gotama’’. ‘‘Sabyāpajjacitto vā abyāpajjacitto vā’’ti? ‘‘Abyāpajjacitto, bho gotama’’. ‘‘Saṃkiliṭṭhacitto vā asaṃkiliṭṭhacitto vā’’ti? ‘‘Asaṃkiliṭṭhacitto, bho gotama’’. ‘‘Vasavattī vā avasavattī vā’’ti? ‘‘Vasavattī, bho gotama’’. ‘‘Iti kira, vāseṭṭha, apariggaho bhikkhu, apariggaho brahmā. Api nu kho apariggahassa bhikkhuno apariggahena brahmunā saddhiṃ saṃsandati sametī’’ti? ‘‘Evaṃ, bho gotama’’. ‘‘Sādhu, vāseṭṭha, so vata vāseṭṭha apariggaho bhikkhu kāyassa bhedā paraṃ maraṇā apariggahassa brahmuno sahabyūpago bhavissatī’’ti, ṭhānametaṃ vijjati.",
      "english": "\"What do you think, Vāseṭṭha, is a monk living in this way attached or unattached?\"\n\"Unattached, Venerable Gotama.\"\n\"Does he have an inimical mind or a non-inimical mind?\"\n\"A non-inimical mind, Venerable Gotama.\"\n\"Does he have an afflicted mind or an unafflicted mind?\"\n\"An unafflicted mind, Venerable Gotama.\"\n\"Does he have a defiled mind or an undefiled mind?\"\n\"An undefiled mind, Venerable Gotama.\"\n\"Is he in control or not in control?\"\n\"In control, Venerable Gotama.\"\n\"So then, Vāseṭṭha, a monk is unattached, and Brahmā is unattached. Does not the unattached monk correspond and meet with the unattached Brahmā?\"\n\"Indeed, Venerable Gotama.\"\n\"Good, Vāseṭṭha. This unattached monk, Vāseṭṭha, upon the breaking up of the body, after death, will indeed become a companion of the unattached Brahmā. This is a possibility.\"",
      "sinhala": "වාසේට්ඨයෙනි, ඔබ මේ ගැන කුමක් සිතන්නෙහිද, මෙසේ වාසය කරන භික්ෂුව සපරිග්‍රහ (පිරිවර සහිත) කෙනෙක්ද, අපරිග්‍රහ (පිරිවර රහිත) කෙනෙක්ද? භවත් ගෞතමයෙනි, අපරිග්‍රහ කෙනෙකි. වෛර සහිත සිතක් ඇත්තේද, වෛර රහිත සිතක් ඇත්තේද? භවත් ගෞතමයෙනි, වෛර රහිත සිතක් ඇත්තෙකි. ව්‍යාපාද සහිත සිතක් ඇත්තේද, ව්‍යාපාද රහිත සිතක් ඇත්තේද? භවත් ගෞතමයෙනි, ව්‍යාපාද රහිත සිතක් ඇත්තෙකි. කිලිටි වූ සිතක් ඇත්තේද, කිලිටි නොවූ සිතක් ඇත්තේද? භවත් ගෞතමයෙනි, කිලිටි නොවූ සිතක් ඇත්තෙකි. වශයට පැමිණියාද, වශයට නොපැමිණියාද? භවත් ගෞතමයෙනි, වශයට පැමිණියෙකි. එසේ නම්, වාසේට්ඨයෙනි, පිරිවර රහිත භික්ෂුවද පිරිවර රහිත බ්‍රහ්මයාද වෙයි. පිරිවර රහිත භික්ෂුව, පිරිවර රහිත බ්‍රහ්මයා සමඟ ගැලපේද, එක්වන්නේද? එසේය, භවත් ගෞතමයෙනි. යහපති, වාසේට්ඨයෙනි. වාසේට්ඨයෙනි, පිරිවර රහිත ඒ භික්ෂුව කය බිඳී මරණින් මතු පිරිවර රහිත බ්‍රහ්මයාගේ සහභාගීත්වයට පැමිණෙන්නේයැයි, මේ ස්ථානය යුක්ති සහගත වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 558,
      "pali": "‘‘Iti kira, vāseṭṭha, averacitto bhikkhu, averacitto brahmā…pe… abyāpajjacitto bhikkhu, abyāpajjacitto brahmā… asaṃkiliṭṭhacitto bhikkhu, asaṃkiliṭṭhacitto brahmā… vasavattī bhikkhu, vasavattī brahmā, api nu kho vasavattissa bhikkhuno vasavattinā brahmunā saddhiṃ saṃsandati sametī’’ti? ‘‘Evaṃ, bho gotama’’. ‘‘Sādhu, vāseṭṭha, so vata, vāseṭṭha, vasavattī bhikkhu kāyassa bhedā paraṃ maraṇā vasavattissa brahmuno sahabyūpago bhavissatīti, ṭhānametaṃ vijjatī’’ti.",
      "english": "Thus, Vāseṭṭha, it is said: A bhikkhu whose mind is free from ill-will is a Brahmā whose mind is free from ill-will; a bhikkhu whose mind is free from malevolence is a Brahmā whose mind is free from malevolence; a bhikkhu whose mind is undefiled is a Brahmā whose mind is undefiled; a bhikkhu who is in control is a Brahmā who is in control. Now then, does a bhikkhu who is in control conform and unite with a Brahmā who is in control?\n\nYes, Venerable Gotama.\n\nGood, Vāseṭṭha. That a bhikkhu who is in control, Vāseṭṭha, after the breaking up of the body, after death, will become a companion of a Brahmā who is in control – this is indeed possible.",
      "sinhala": "එසේනම්, වාසෙට්ඨය, වෛර රහිත සිත් ඇති භික්ෂුව, වෛර රහිත සිත් ඇති බ්‍රහ්මයා...ව්‍යාපාද රහිත සිත් ඇති භික්ෂුව, ව්‍යාපාද රහිත සිත් ඇති බ්‍රහ්මයා… කෙලෙස්වලින් කිලිටි නොවුණු සිත් ඇති භික්ෂුව, කෙලෙස්වලින් කිලිටි නොවුණු සිත් ඇති බ්‍රහ්මයා… තමාට වසඟ වූ භික්ෂුව, තමාට වසඟ වූ බ්‍රහ්මයා. එසේ නම්, තමාට වසඟ වූ භික්ෂුව, තමාට වසඟ වූ බ්‍රහ්මයා සමඟ එකට ගැළපේද, එකට එක්වන්නේද?\n\nඑසේය, භෝ ගෞතමය.\n\nසාධු, වාසෙට්ඨය. ඉදින්, වාසෙට්ඨය, තමාට වසඟ වූ භික්ෂුව, කය බිඳී මරණින් පසු, තමාට වසඟ වූ බ්‍රහ්මයාගේ සහවාසයට පත්වනු ඇත, මෙය සිදු විය හැකි කරුණකි.",
      "paliTitle": ""
    },
    {
      "number": 559,
      "pali": "Evaṃ vutte, vāseṭṭhabhāradvājā māṇavā bhagavantaṃ etadavocuṃ – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti. Evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Ete mayaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāma, dhammañca bhikkhusaṅghañca. Upāsake no bhavaṃ gotamo dhāretu ajjatagge pāṇupete saraṇaṃ gate’’ti.",
      "english": "When this was said, the young men Vāseṭṭha and Bhāradvāja said to the Blessed One: “Magnificent, Venerable Gotama! Magnificent, Venerable Gotama! Just as, Venerable Gotama, one might set upright what was overturned, or reveal what was hidden, or show the way to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms—even so has the Dhamma been made clear by the Venerable Gotama in many ways. We now go for refuge to the Venerable Gotama, and to the Dhamma, and to the Saṅgha of bhikkhus. May the Venerable Gotama accept us as lay followers, who from this day forward, for as long as life lasts, have gone for refuge.”",
      "sinhala": "එසේ පැවසූ කල්හි, වාසෙට්ඨ සහ භාරද්වාජ යන මානවකයෝ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ – \"භවත් ගෞතමයෙනි, අතිශයින් ශ්‍රේෂ්ඨයි; භවත් ගෞතමයෙනි, අතිශයින් ශ්‍රේෂ්ඨයි! භවත් ගෞතමයෙනි, යම් සේ යමෙක් යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මඟ මුළා වූවකුට මඟ පෙන්වන්නේද, නැතහොත් ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යි අන්ධකාරයේ තෙල් පහනක් දරන්නේද; එලෙසින්ම භවත් ගෞතමයන් විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරනු ලැබ ඇත. අපි ඒ භවත් ගෞතමයන්ද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමු. භවත් ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය අප උපාසකයන් වශයෙන් දරණ සේක්වා!\"",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Tevijjasuttaṃ niṭṭhitaṃ terasamaṃ.",
    "english": "The Thirteenth Tevijja Sutta",
    "sinhala": "දහතුන්වැනි තේවිජ්ජ සූත්‍රය නිමයි."
  }
}