{
  "id": "dn.1.5",
  "title": {
    "pali": "Kūṭadantasuttaṃ",
    "english": "The Kūṭadanta Sutta",
    "sinhala": "කූටදන්ත සූත්‍රය"
  },
  "sections": [
    {
      "number": 323,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā magadhesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena khāṇumataṃ nāma magadhānaṃ brāhmaṇagāmo tadavasari. Tatra sudaṃ bhagavā khāṇumate viharati ambalaṭṭhikāyaṃ. Tena kho pana samayena kūṭadanto brāhmaṇo khāṇumataṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ raññā māgadhena seniyena bimbisārena dinnaṃ rājadāyaṃ brahmadeyyaṃ. Tena kho pana samayena kūṭadantassa brāhmaṇassa mahāyañño upakkhaṭo hoti. Satta ca usabhasatāni satta ca vacchatarasatāni satta ca vacchatarīsatāni satta ca ajasatāni satta ca urabbhasatāni thūṇūpanītāni honti yaññatthāya.",
      "english": "Thus have I heard: At one time, the Blessed One, while traveling through Magadha with a large community of about five hundred monks, arrived at a brahmin village of the Magadhas named Khāṇumata. There, the Blessed One was dwelling in Khāṇumata at the Ambalaṭṭhikā. Now at that time, the brahmin Kūṭadanta was residing in Khāṇumata, which was prosperous, abounding in grass, wood, and water, and rich in grain; a royal domain, a royal gift, and a brahmin grant, bestowed by King Seniya Bimbisāra of Magadha. Now at that time, a great sacrifice had been prepared for the brahmin Kūṭadanta. Seven hundred bulls, seven hundred steers, seven hundred heifers, seven hundred goats, and seven hundred rams were led to the posts for the sacrifice.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ මගධ දේශයේ චාරිකාවේ හැසිරෙමින්, පන්සියයක් පමණ භික්ෂූන් වහන්සේලාගෙන් යුත් මහත් භික්ෂු සංඝයා සමඟ, මගධ දේශයට අයත් ඛාණුමත නම් බ්‍රාහ්මණ ගම තිබූ තැනට වැඩම කළ සේක. භාග්‍යවතුන් වහන්සේ එහි ඛාණුමත ගමෙහි අඹලට්ඨිකාවේ වාසය කළ සේක.\n\nඒ සමයෙහි කූටදන්ත නම් බ්‍රාහ්මණයා ඛාණුමත ගමෙහි වාසය කළේය. එම ගම සත් උස් බිම්වලින් යුක්ත වූ, තණ, දර, දිය සම්පත් බහුල වූ, ධාන්‍යයෙන් සශ්‍රීක වූ, මගධ අධිපති සේනිය බිම්බිසාර රජු විසින් භුක්ති විඳීමට දෙන ලද රජ දායාදයක් වූ, බ්‍රහ්මදෙය්‍ය නම් ගමකි.\n\nඒ සමයෙහි කූටදන්ත බ්‍රාහ්මණයාට මහත් යාගයක් සූදානම් කර තිබුණි. යාගය සඳහා ගවයන් සත් සියයක් ද, වසු පැටවුන් සත් සියයක් ද, වසු දෙනුන් සත් සියයක් ද, එළුවන් සත් සියයක් ද, බැටළුවන් සත් සියයක් ද කණුවලට ගැටගසා තිබුණි.",
      "paliTitle": "Khāṇumatakabrāhmaṇagahapatikā",
      "englishTitle": "The Khāṇumataka Brahmin and Householders",
      "sinhalaTitle": "ඛාණුමතක බ්‍රාහ්මණ ගෘහපතිවරු"
    },
    {
      "number": 324,
      "pali": "Assosuṃ kho khāṇumatakā brāhmaṇagahapatikā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito magadhesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi khāṇumataṃ anuppatto khāṇumate viharati ambalaṭṭhikāyaṃ. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti.",
      "english": "The brahman householders of Khāṇumata heard this: “The ascetic Gotama, good sirs, a Sakyan son who went forth from the Sakyan clan, is wandering through the Magadhan country. He has arrived at Khāṇumata with a large community of monks, about five hundred in number, and is dwelling there at Ambalaṭṭhikā. And such an excellent reputation has arisen regarding that revered Gotama: ‘Indeed, the Blessed One is an Arahant, a Perfectly Self-Awakened One, endowed with wisdom and conduct, a Fortunate One, a Knower of worlds, an unsurpassed leader of persons to be tamed, a teacher of devas and humans, the Awakened One, the Blessed One.’ He proclaims this world — with its devas, Māras, and Brahmās; with its ascetics and brahmans, its devas and humans — having directly known and realized it himself. He teaches the Dhamma that is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with its meaning and its letter, and he proclaims the entirely complete and perfectly pure holy life. It is indeed good to see such Arahants.”",
      "sinhala": "කාණූමතේ සිටි බ්‍රාහ්මණ ගෘහපතිවරු මෙසේ ඇසූහ – 'භවත් ගෞතම ශ්‍රමණයෝ, ශාක්‍ය කුලයෙන් පැවිදිවූ ශාක්‍ය පුත්‍රයෝ, මගධයෙහි චාරිකාවේ වඩමින්, පන්සියයක් පමණ භික්ෂූන් වහන්සේලාගෙන් යුත් මහත් භික්ෂු සංඝයා සමඟ කාණූමතට පැමිණ, කාණූමතෙහි අම්බලට්ඨිකාවේ වාසය කරති. ඒ භවත් ගෞතමයන් වහන්සේ පිළිබඳව මෙබඳු කල්‍යාණ කීර්ති ඝෝෂාවක් පැතිරී ඇත – 'ඒ භාග්‍යවතුන් වහන්සේ අරහත්, සම්මා සම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තර පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භාග්‍යවත් වන සේක' යනුවෙනි. උන්වහන්සේ දෙව්, මරුන්, බඹුන් සහිත වූද, ශ්‍රමණ, බ්‍රාහ්මණ, දෙව්, මිනිස් ප්‍රජාව සහිත වූද මේ ලෝකය, තමන් විසින්ම අභිඥාවෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරති. උන්වහන්සේ මුල යහපත් වූ, මැද යහපත් වූ, අග යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව හෙවත් ධර්මය දේශනා කරති. 'එබඳු අරහතුන් වහන්සේලා දැකීම ඉතා යහපත්ය' යනුයි.",
      "paliTitle": ""
    },
    {
      "number": 325,
      "pali": "Atha kho khāṇumatakā brāhmaṇagahapatikā khāṇumatā nikkhamitvā saṅghasaṅghī gaṇībhūtā yena ambalaṭṭhikā tenupasaṅkamanti.",
      "english": "Then, the brahmin householders of Khāṇumata, having departed from Khāṇumata, gathered into groups and throngs, and approached Ambalaṭṭhikā.",
      "sinhala": "ඉක්බිති ඛාණුමතක බමුණු ගෘහපතිවරු ඛාණුමතයෙන් නික්ම ගොස්, කණ්ඩායම් වශයෙන් එක්ව, අම්බලට්ඨිකාව වෙත පැමිණියෝය.",
      "paliTitle": ""
    },
    {
      "number": 326,
      "pali": "Tena kho pana samayena kūṭadanto brāhmaṇo uparipāsāde divāseyyaṃ upagato hoti. Addasā kho kūṭadanto brāhmaṇo khāṇumatake brāhmaṇagahapatike khāṇumatā nikkhamitvā saṅghasaṅghī gaṇībhūte yena ambalaṭṭhikā tenupasaṅkamante. Disvā khattaṃ āmantesi – ‘‘kiṃ nu kho, bho khatte, khāṇumatakā brāhmaṇagahapatikā khāṇumatā nikkhamitvā saṅghasaṅghī gaṇībhūtā yena ambalaṭṭhikā tenupasaṅkamantī’’ti?",
      "english": "At that time, the brahman Kuṭadanta was taking a midday rest on the upper floor of his palace. The brahman Kuṭadanta saw the brahmin householders of Khāṇumata coming out of Khāṇumata, assembled in groups, going towards Ambalaṭṭhikā. Having seen them, he addressed his steward: “What is it, good steward, that the brahmin householders of Khāṇumata are coming out of Khāṇumata, assembled in groups, and going towards Ambalaṭṭhikā?”",
      "sinhala": "ඒ අවස්ථාවේදී කූටදන්ත බ්‍රාහ්මණයා ප්‍රාසාදය මුදුනේ දවල් සැතපීමෙහි යෙදී සිටියේය. කූටදන්ත බ්‍රාහ්මණයා දුටුවේය: ඛාණුමත ගමෙන් නික්ම ගොස් සමූහ වශයෙන්, එක්ව අම්බලට්ඨිකාව වෙත යන ඛාණුමතක බ්‍රාහ්මණ ගෘහපතිවරුන්ය. දැක, දොරටුපාලයාට ආමන්ත්‍රණය කළේය: \"අහෝ දොරටුපාලය, ඛාණුමතක බ්‍රාහ්මණ ගෘහපතිවරුන් ඛාණුමත ගමෙන් නික්ම ගොස් සමූහ වශයෙන්, එක්ව අම්බලට්ඨිකාව වෙත යන්නේ කුමක්ද?\"",
      "paliTitle": ""
    },
    {
      "number": 327,
      "pali": "‘‘Atthi kho, bho, samaṇo gotamo sakyaputto sakyakulā pabbajito magadhesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi khāṇumataṃ anuppatto, khāṇumate viharati ambalaṭṭhikāyaṃ. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Tamete bhavantaṃ gotamaṃ dassanāya upasaṅkamantī’’ti.",
      "english": "Indeed, sirs, the ascetic Gotama, a Sakyan son who renounced his Sakyan clan, is now wandering through Magadha. He has arrived at Khāṇumata with a great community of approximately five hundred bhikkhus and is dwelling there in the Mango Grove. A beautiful report has spread concerning this Venerable Gotama: 'Indeed, that Blessed One is an Arahant, a Perfectly Self-Awakened One, accomplished in knowledge and conduct, a Fortunate One, a Knower of the worlds, an unsurpassed trainer of those who can be tamed, a teacher of devas and humans, the Awakened One, the Blessed One.' They are approaching that Venerable Gotama to see him.",
      "sinhala": "භවත්නි, ශාක‍්‍ය පුත‍්‍ර වූ, ශාක‍්‍ය කුලයෙන් පැවිදි වූ, ශ‍්‍රමණ ගෞතමයන් වහන්සේ, මගධයෙහි චාරිකාවේ වඩමින්, පන්සියයක් පමණ භික්ෂූන් වහන්සේලා සහිත මහත් භික්ෂු සංඝයා පිරිවරාගෙන, ඛාණුමත නම් ස්ථානයට වැඩම කොට, එහි අම්බලට්ඨිකාවේ වැඩවසන සේක.\n\nඒ භාග‍්‍යවතුන් වහන්සේ ගෞතමයන් වහන්සේ පිළිබඳව, ‘ඒ භාග‍්‍යවතුන් වහන්සේ අරහත් ය, සම්මා සම්බුද්ධ ය, විද්‍යාචරණ සම්පන්න ය, සුගත ය, ලෝකවිදූ ය, අනුත්තරෝ පුරිසදම්මසාරථී ය, සත්ථා දේවමනුස්සානං ය, බුද්ධ ය, භාග‍්‍යවතුන් වහන්සේ ය’ යි මෙබඳු කල්‍යාණ කීර්ති ඝෝෂාවක් පැතිරී ඇත.\n\nඒ භාග‍්‍යවතුන් ගෞතමයන් වහන්සේ බැහැදැකීම සඳහා ඔවුහු එළඹෙති.",
      "paliTitle": ""
    },
    {
      "number": 328,
      "pali": "Atha kho kūṭadantassa brāhmaṇassa etadahosi – ‘‘sutaṃ kho pana metaṃ – ‘samaṇo gotamo tividhaṃ yaññasampadaṃ soḷasaparikkhāraṃ jānātī’ti. Na kho panāhaṃ jānāmi tividhaṃ yaññasampadaṃ soḷasaparikkhāraṃ. Icchāmi cāhaṃ mahāyaññaṃ yajituṃ. Yaṃnūnāhaṃ samaṇaṃ gotamaṃ upasaṅkamitvā tividhaṃ yaññasampadaṃ soḷasaparikkhāraṃ puccheyya’’nti.",
      "english": "Then indeed, this thought occurred to the brahmin Kūṭadanta: “I have heard this: ‘The Ascetic Gotama knows the threefold perfection of sacrifice with its sixteen requisites.’ But I do not know the threefold perfection of sacrifice with its sixteen requisites. And I wish to offer a great sacrifice. What if I were to approach the Ascetic Gotama and ask him about the threefold perfection of sacrifice with its sixteen requisites?”",
      "sinhala": "එවිට කුටදන්ත බ‍්‍රාහ්මණයාට මෙසේ සිතිණි: ‘ශ‍්‍රමණ ගෞතමයන් වහන්සේ ත්‍රිවිධ යාග සම්පත්තිය සහ ෂෝඩශ පූජා ද‍්‍රව්‍යය දන්නා සේක’ කියා මට අසන්නට ලැබී තිබේ. නමුත් මම නම් ඒ ත්‍රිවිධ යාග සම්පත්තිය හා ෂෝඩශ පූජා ද‍්‍රව්‍යය නොදනිමි. මා මහත් යාගයක් පැවැත්වීමට කැමැත්තෙමි. යහපතකි, මම ශ‍්‍රමණ ගෞතමයන් වහන්සේ වෙත එළඹ ත්‍රිවිධ යාග සම්පත්තිය සහ ෂෝඩශ පූජා ද‍්‍රව්‍යය පිළිබඳව විමසන්නෙම් නම්.",
      "paliTitle": ""
    },
    {
      "number": 329,
      "pali": "Atha kho kūṭadanto brāhmaṇo khattaṃ āmantesi – ‘‘tena hi, bho khatte, yena khāṇumatakā brāhmaṇagahapatikā tenupasaṅkama. Upasaṅkamitvā khāṇumatake brāhmaṇagahapatike evaṃ vadehi – ‘kūṭadanto, bho, brāhmaṇo evamāha – ‘‘āgamentu kira bhavanto, kūṭadantopi brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’’ti. ‘‘Evaṃ, bho’’ti kho so khattā kūṭadantassa brāhmaṇassa paṭissutvā yena khāṇumatakā brāhmaṇagahapatikā tenupasaṅkami. Upasaṅkamitvā khāṇumatake brāhmaṇagahapatike etadavoca – ‘‘kūṭadanto, bho, brāhmaṇo evamāha – ‘āgamentu kira bhonto, kūṭadantopi brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’’ti.",
      "english": "Then Kūṭadanta the brahmin addressed the steward, saying, \"Well then, good steward, go to where the brahmin householders of Khāṇumata are. Having approached the brahmin householders of Khāṇumata, tell them this: 'Kūṭadanta the brahmin, good sirs, says this: \"Please come, sirs, Kūṭadanta the brahmin will also go to see the ascetic Gotama.\"' \"Yes, good sir,\" that steward replied to Kūṭadanta the brahmin, and he went to where the brahmin householders of Khāṇumata were. Having approached the brahmin householders of Khāṇumata, he told them this: \"Kūṭadanta the brahmin, good sirs, says this: 'Please come, sirs, Kūṭadanta the brahmin will also go to see the ascetic Gotama.'\"",
      "sinhala": "ඉන්පසු කූටදන්ත බමුණා සේවකයා ඇමතී ය: \"එසේ නම්, භවත් සේවකය, ඛාණමතක බමුණු ගෘහපතියන් සිටින තැනට යන්න. ගොස් ඛාණමතක බමුණු ගෘහපතියන්ට මෙසේ කියන්න: 'භවත්නි, කූටදන්ත බමුණා මෙසේ කියයි: \"භවත්නි, ඔබලා එනු මැනවි, කූටදන්ත බමුණා ද ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට එන්නේ ය.\"' \" \"එසේ ය, භවතැ\"යි කියා ඒ සේවකයා කූටදන්ත බමුණාට පිළිගෙන ඛාණමතක බමුණු ගෘහපතියන් සිටින තැනට ගියේ ය. ගොස් ඛාණමතක බමුණු ගෘහපතියන්ට මෙසේ කීවේ ය: \"භවත්නි, කූටදන්ත බමුණා මෙසේ කියයි: 'භවත්නි, ඔබලා එනු මැනවි, කූටදන්ත බමුණා ද ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට එන්නේ ය.'\"",
      "paliTitle": ""
    },
    {
      "number": 330,
      "pali": "Tena kho pana samayena anekāni brāhmaṇasatāni khāṇumate paṭivasanti – ‘‘kūṭadantassa brāhmaṇassa mahāyaññaṃ anubhavissāmā’’ti. Assosuṃ kho te brāhmaṇā – ‘‘kūṭadanto kira brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti. Atha kho te brāhmaṇā yena kūṭadanto brāhmaṇo tenupasaṅkamiṃsu.",
      "english": "At that time, indeed, many hundreds of brahmins were dwelling in Khāṇumata, intending to partake in the great sacrifice of the brahmin Kūṭadanta.\n\nThose brahmins heard that the brahmin Kūṭadanta, it was reported, was going to visit the ascetic Gotama.\n\nThen those brahmins approached the brahmin Kūṭadanta.",
      "sinhala": "ඒ අවස්ථාවේදී, බොහෝ බ්‍රාහ්මණවරුන් සිය ගණනක් ඛාණුමතයෙහි වාසය කරති, \"කූටදන්ත බ්‍රාහ්මණයාගේ මහා යඥය අත්විඳිමු\" යි.\n\nඒ බ්‍රාහ්මණවරුන්ට ආරංචි විය, \"කූටදන්ත නම් බ්‍රාහ්මණයා ශ්‍රමණ ගෞතමයන් වහන්සේව දැකීම පිණිස උපසංක්‍රමණය කරනු ඇතැයි.\"\n\nඑවිට ඒ බ්‍රාහ්මණවරු කූටදන්ත බ්‍රාහ්මණයා වෙතට පැමිණියහ.",
      "paliTitle": "Kūṭadantaguṇakathā",
      "englishTitle": "Account of Kūṭadanta's Virtues",
      "sinhalaTitle": "කූටදන්ත ගුණ කථාව"
    },
    {
      "number": 331,
      "pali": "Upasaṅkamitvā kūṭadantaṃ brāhmaṇaṃ etadavocuṃ – ‘‘saccaṃ kira bhavaṃ kūṭadanto samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti? ‘‘Evaṃ kho me, bho, hoti – ‘ahampi samaṇaṃ gotamaṃ dassanāya upasaṅkamissāmī’’’ti. ‘‘Mā bhavaṃ kūṭadanto samaṇaṃ gotamaṃ dassanāya upasaṅkami. Na arahati bhavaṃ kūṭadanto samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ. Sace bhavaṃ kūṭadanto samaṇaṃ gotamaṃ dassanāya upasaṅkamissati, bhoto kūṭadantassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati. Yampi bhoto kūṭadantassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati, imināpaṅgena na arahati bhavaṃ kūṭadanto samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ. Samaṇo tveva gotamo arahati bhavantaṃ kūṭadantaṃ dassanāya upasaṅkamituṃ. ‘‘Bhavañhi kūṭadanto ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Yampi bhavaṃ kūṭadanto ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati bhavaṃ kūṭadanto samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ. Samaṇo tveva gotamo arahati bhavantaṃ kūṭadantaṃ dassanāya upasaṅkamituṃ. ‘‘Bhavañhi kūṭadanto aḍḍho mahaddhano mahābhogo pahūtavittūpakaraṇo pahūtajātarūparajato… pe… ‘‘Bhavañhi kūṭadanto ajjhāyako mantadharo tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo…pe… ‘‘Bhavañhi kūṭadanto abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya…pe… ‘‘Bhavañhi kūṭadanto sīlavā vuddhasīlī vuddhasīlena samannāgato…pe… ‘‘Bhavañhi kūṭadanto kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā…pe… ‘‘Bhavañhi kūṭadanto bahūnaṃ ācariyapācariyo tīṇi māṇavakasatāni mante vāceti, bahū kho pana nānādisā nānājanapadā māṇavakā āgacchanti bhoto kūṭadantassa santike mantatthikā mante adhiyitukāmā…pe… ‘‘Bhavañhi kūṭadanto jiṇṇo vuddho mahallako addhagato vayoanuppatto. Samaṇo gotamo taruṇo ceva taruṇapabbajito ca…pe… ‘‘Bhavañhi kūṭadanto rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito…pe… ‘‘Bhavañhi kūṭadanto brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito…pe… ‘‘Bhavañhi kūṭadanto khāṇumataṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ raññā māgadhena seniyena bimbisārena dinnaṃ rājadāyaṃ brahmadeyyaṃ. Yampi bhavaṃ kūṭadanto khāṇumataṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ, raññā māgadhena seniyena bimbisārena dinnaṃ rājadāyaṃ brahmadeyyaṃ, imināpaṅgena na arahati bhavaṃ kūṭadanto samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ. Samaṇotveva gotamo arahati bhavantaṃ kūṭadantaṃ dassanāya upasaṅkamitu’’nti.",
      "english": "Approaching the brahmin Kūṭadanta, they said this: “Is it true, sir, that you, Kūṭadanta, intend to go to see the ascetic Gotama?” “Indeed, sirs, it is so for me,” he replied, “I too intend to go to see the ascetic Gotama.”\n\n“Sir Kūṭadanta, do not go to see the ascetic Gotama. It is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. If you, Sir Kūṭadanta, go to see the ascetic Gotama, your fame will diminish, and the ascetic Gotama’s fame will increase. Because your fame would diminish and the ascetic Gotama’s fame would increase, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are well-born on both sides, from mother and father, with pure lineage back through seven generations of ancestors, without reproach and irreproachable in respect of birth. Because you, Sir Kūṭadanta, are well-born on both sides, from mother and father, with pure lineage back through seven generations of ancestors, without reproach and irreproachable in respect of birth, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are rich, very wealthy, with great possessions, with abundant resources and much gold and silver. Because you, Sir Kūṭadanta, are rich, very wealthy, with great possessions, with abundant resources and much gold and silver, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are a reciter, a master of the sacred texts, one who has thoroughly mastered the three Vedas with their vocabularies, ritual instructions, phonology, etymology, and as the fifth, the historical narratives; you are skilled in lexicography and grammar, and flawless in the science of prognostication and the marks of a great man. Because you, Sir Kūṭadanta, are a reciter, a master of the sacred texts, one who has thoroughly mastered the three Vedas with their vocabularies, ritual instructions, phonology, etymology, and as the fifth, the historical narratives; skilled in lexicography and grammar, and flawless in the science of prognostication and the marks of a great man, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are handsome, good-looking, delightful, endowed with supreme beauty of complexion, with a divine complexion and presence, and not insignificant in appearance. Because you, Sir Kūṭadanta, are handsome, good-looking, delightful, endowed with supreme beauty of complexion, with a divine complexion and presence, and not insignificant in appearance, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are virtuous, with mature virtue, endowed with mature virtue. Because you, Sir Kūṭadanta, are virtuous, with mature virtue, endowed with mature virtue, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are of good speech, with good elocution, endowed with a refined voice that is clear, distinct, and intelligible. Because you, Sir Kūṭadanta, are of good speech, with good elocution, endowed with a refined voice that is clear, distinct, and intelligible, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are a teacher and instructor of many; you teach the sacred texts to three hundred young brahmins, and many young brahmins come from various directions and countries to you, Sir Kūṭadanta, desirous of the sacred texts and wishing to study them. Because you, Sir Kūṭadanta, are a teacher and instructor of many; you teach the sacred texts to three hundred young brahmins, and many young brahmins come from various directions and countries to you, Sir Kūṭadanta, desirous of the sacred texts and wishing to study them, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are old, aged, elderly, having passed through life, and come to the end of your years. The ascetic Gotama, however, is young and recently renounced. Because you, Sir Kūṭadanta, are old, aged, elderly, having passed through life, and come to the end of your years, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are respected, revered, honored, esteemed, and deferred to by King Seniya Bimbisāra of Magadha. Because you, Sir Kūṭadanta, are respected, revered, honored, esteemed, and deferred to by King Seniya Bimbisāra of Magadha, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, are respected, revered, honored, esteemed, and deferred to by the brahmin Pokkharasāti. Because you, Sir Kūṭadanta, are respected, revered, honored, esteemed, and deferred to by the brahmin Pokkharasāti, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.\n\n“For you, Sir Kūṭadanta, reside in Khāṇumata, which is populous, with abundant grass, wood, water, and grain, a royal possession bestowed by King Seniya Bimbisāra of Magadha as a royal gift and a brahmin endowment. Because you, Sir Kūṭadanta, reside in Khāṇumata, which is populous, with abundant grass, wood, water, and grain, a royal possession bestowed by King Seniya Bimbisāra of Magadha as a royal gift and a brahmin endowment, for this reason it is not proper for you, Sir Kūṭadanta, to go to see the ascetic Gotama. Rather, it is proper for the ascetic Gotama to come to see you, Sir Kūṭadanta.”",
      "sinhala": "කූටදන්ත බ්‍රාහ්මණයා වෙත එළඹ මෙසේ පැවසුවා: ‘‘ඇත්තද, පින්වත් කූටදන්ත, ඔබ ශ්‍රමණ ගෝතමයන් වහන්සේව දැකීමට යන්නේ යැයි?’’\n\n‘‘ඇත්තෙන්ම, පින්වතුනි, මගේ අදහස වන්නේ, ‘මමත් ශ්‍රමණ ගෝතමයන් වහන්සේව දැකීමට යන්නෙමි’ යන්නයි.’’\n\n‘‘පින්වත් කූටදන්ත, ඔබ ශ්‍රමණ ගෝතමයන් වහන්සේව දැකීමට නොයන්න. පින්වත් කූටදන්තට ශ්‍රමණ ගෝතමයන් වහන්සේව දැකීමට යාම සුදුසු නොවේ. යම් හෙයකින් පින්වත් කූටදන්ත ශ්‍රමණ ගෝතමයන් වහන්සේව දැකීමට යන්නේ නම්, පින්වත් කූටදන්තගේ යසස පිරිහෙනු ඇත, ශ්‍රමණ ගෝතමයන් වහන්සේගේ යසස දියුණු වනු ඇත. පින්වත් කූටදන්තගේ යසස පිරිහී, ශ්‍රමණ ගෝතමයන් වහන්සේගේ යසස දියුණු වන හෙයින්, මේ හේතුව නිසා පින්වත් කූටදන්තට ශ්‍රමණ ගෝතමයන් වහන්සේව දැකීමට යාම සුදුසු නොවේ. ශ්‍රමණ ගෝතමයන් වහන්සේමයි පින්වත් කූටදන්තව දැකීමට පැමිණීම සුදුසු වන්නේ.\n\n‘‘පින්වත් කූටදන්ත ඔබ මව්පිය දෙපසින්ම මනා කොට උපන්නෙක්ය, සත්වන මුතුන්මිත්තන්ගේ පරම්පරාව දක්වාම පිරිසිදු වූ ගැබක් ඇත්තෙක්ය, ජාතිවාදයෙන් නින්දාවට හෝ චෝදනාවට ලක් නොවූවෙක්ය. පින්වත් කූටදන්ත ඔබ මව්පිය දෙපසින්ම මනා කොට උපන්නෙක්ය, සත්වන මුතුන්මිත්තන්ගේ පරම්පරාව දක්වාම පිරිසිදු වූ ගැබක් ඇත්තෙක්ය, ජාතිවාදයෙන් නින්දාවට හෝ චෝදනාවට ලක් නොවූවෙක් වන හෙයින්, මේ හේතුව නිසා පින්වත් කූටදන්තට ශ්‍රමණ ගෝතමයන් වහන්සේව දැකීමට යාම සුදුසු නොවේ. ශ්‍රමණ ගෝතමයන් වහන්සේමයි පින්වත් කූටදන්තව දැකීමට පැමිණීම සුදුසු වන්නේ.\n\n‘‘පින්වත් කූටදන්ත ඔබ ධනවත්ය, මහා ධනය ඇත්තෙක්ය, මහත් භෝග ඇත්තෙක්ය, බොහෝ වස්තු උපකරණ ඇත්තෙක්ය, බොහෝ රන් රිදී ඇත්තෙක්ය… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ අධ්‍යාපක වූ, මන්ත්‍රධර වූ, නිඝණ්ඩු සහ කේටුභ සහිත, අක්ෂර ප්‍රභේද සහිත, ඉතිහාසය පස්වැනියට ඇති තුන් වේදයෙහි දක්ෂ වූ, පදක නම් වූ ව්‍යාකරණ ශාස්ත්‍රයෙහි දක්ෂ වූ, ලෝකායත හා මහා පුරුෂ ලක්ෂණ විද්‍යාවෙහි කිසිදු අඩුපාඩුවක් නැත්තෙක්ය… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ රූපවත්ය, දැකීමට ප්‍රියමනාපය, පහදවන්නේය, උසස්ම වර්ණ සම්පත්තියෙන් යුක්තය, බ්‍රහ්ම වර්ණයෙන් යුක්තය, බ්‍රහ්ම තේජසින් යුක්තය, දැකීමට සුළු අවකාශයක් නැත්තෙක්ය… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ සිල්වත්ය, වර්ධනය වූ සිල් ඇත්තෙක්ය, වර්ධනය වූ සීලයෙන් යුක්තය… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ කයින් යහපත් වූ, වාග් කථනයෙන් යහපත් වූ, විවෘත, නොගොතන, අර්ථය දැනවිය හැකි වූ පොදු ව්‍යවහාර භාෂාවෙන් යුක්තය… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ බොහෝ දෙනෙකුගේ ආචාර්ය-උපාධ්‍යායවරයෙකි, තුන්සියයක් පමණ මානවකයන්ට මන්ත්‍ර උගන්වයි, බොහෝ මානවකයෝ නොයෙකුත් දිසාවන්ගෙන් හා නොයෙකුත් ජනපදවලින් මන්ත්‍ර ඉගෙන ගැනීමට කැමතිව, මන්ත්‍ර අපේක්ෂාවෙන් පින්වත් කූටදන්ත ඔබ වෙත පැමිණෙති… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ වයස්ගත වූ, මහලු වූ, මහල්ලෙක් වූ, ආයුෂ ගත කළ, වයසට පැමිණියෙක්ය. ශ්‍රමණ ගෝතමයන් වහන්සේ තරුණය, තරුණ වියේ පැවිදි වූවෙක්ය… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ මාගධ රටේ සේනිය බිම්බිසාර රජු විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, වැඳපුදා ගන්නා ලද කෙනෙක්ය… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ පොක්ඛරසාති නම් බ්‍රාහ්මණයා විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, වැඳපුදා ගන්නා ලද කෙනෙක්ය… යනාදිය.\n\n‘‘පින්වත් කූටදන්ත ඔබ ඛාණුමත නම්, සමෘද්ධිමත් වූ, තණකොළ, දර, ජලය බහුල වූ, ධාන්‍ය සම්පත් ඇති, රජු විසින් භුක්ති විඳින ලද, මාගධ රජ සේනිය බිම්බිසාර විසින් දෙන ලද, රජුගේ දායාදයක් වූ, බ්‍රහ්ම දායාදයක් වූ බිම්වල වාසය කරයි. පින්වත් කූටදන්ත ඔබ ඛාණුමත නම්, සමෘද්ධිමත් වූ, තණකොළ, දර, ජලය බහුල වූ, ධාන්‍ය සම්පත් ඇති, රජු විසින් භුක්ති විඳින ලද, මාගධ රජ සේනිය බිම්බිසාර විසින් දෙන ලද, රජුගේ දායාදයක් වූ, බ්‍රහ්ම දායාදයක් වූ බිම්වල වාසය කරන හෙයින්, මේ හේතුව නිසා පින්වත් කූටදන්තට ශ්‍රමණ ගෝතමයන් වහන්සේව දැකීමට යාම සුදුසු නොවේ. ශ්‍රමණ ගෝතමයන් වහන්සේමයි පින්වත් කූටදන්තව දැකීමට පැමිණීම සුදුසු වන්නේ.’’",
      "paliTitle": ""
    },
    {
      "number": 332,
      "pali": "Evaṃ vutte kūṭadanto brāhmaṇo te brāhmaṇe etadavoca – ‘‘Tena hi, bho, mamapi suṇātha, yathā mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ, na tveva arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Samaṇo khalu, bho, gotamo ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Yampi, bho, samaṇo gotamo ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Atha kho mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ. ‘‘Samaṇo khalu, bho, gotamo mahantaṃ ñātisaṅghaṃ ohāya pabbajito…pe… ‘‘Samaṇo khalu, bho, gotamo pahūtaṃ hiraññasuvaṇṇaṃ ohāya pabbajito bhūmigatañca vehāsaṭṭhaṃ ca…pe… ‘‘Samaṇo khalu, bho, gotamo daharova samāno yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā agārasmā anagāriyaṃ pabbajito…pe… ‘‘Samaṇo khalu, bho, gotamo akāmakānaṃ mātāpitūnaṃ assumukhānaṃ rudantānaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito…pe… ‘‘Samaṇo khalu, bho, gotamo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya …pe… ‘‘Samaṇo khalu, bho, gotamo sīlavā ariyasīlī kusalasīlī kusalasīlena samannāgato…pe… ‘‘Samaṇo khalu, bho, gotamo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā…pe… ‘‘Samaṇo khalu, bho, gotamo bahūnaṃ ācariyapācariyo…pe… ‘‘Samaṇo khalu, bho, gotamo khīṇakāmarāgo vigatacāpallo…pe… ‘‘Samaṇo khalu, bho, gotamo kammavādī kiriyavādī apāpapurekkhāro brahmaññāya pajāya…pe… ‘‘Samaṇo khalu, bho, gotamo uccā kulā pabbajito asambhinnakhattiyakulā…pe… ‘‘Samaṇo khalu, bho, gotamo aḍḍhā kulā pabbajito mahaddhanā mahābhogā…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ tiroraṭṭhā tirojanapadā pañhaṃ pucchituṃ āgacchanti…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ anekāni devatāsahassāni pāṇehi saraṇaṃ gatāni…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ ti…pe… ‘‘Samaṇo khalu, bho, gotamo dvattiṃsamahāpurisalakkhaṇehi samannāgato…pe… ‘‘Samaṇo khalu, bho, gotamo ehisvāgatavādī sakhilo sammodako abbhākuṭiko uttānamukho pubbabhāsī…pe… ‘‘Samaṇo khalu, bho, gotamo catunnaṃ parisānaṃ sakkato garukato mānito pūjito apacito…pe… ‘‘Samaṇe khalu, bho, gotame bahū devā ca manussā ca abhippasannā…pe… ‘‘Samaṇo khalu, bho, gotamo yasmiṃ gāme vā nigame vā paṭivasati na tasmiṃ gāme vā nigame vā amanussā manusse viheṭhenti…pe… ‘‘Samaṇo khalu, bho, gotamo saṅghī gaṇī gaṇācariyo puthutitthakarānaṃ aggamakkhāyati, yathā kho pana, bho, etesaṃ samaṇabrāhmaṇānaṃ yathā vā tathā vā yaso samudāgacchati, na hevaṃ samaṇassa gotamassa yaso samudāgato. Atha kho anuttarāya vijjācaraṇasampadāya samaṇassa gotamassa yaso samudāgato…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ rājā māgadho seniyo bimbisāro saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ rājā pasenadi kosalo saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ brāhmaṇo pokkharasāti saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe… ‘‘Samaṇo khalu, bho, gotamo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito…pe… ‘‘Samaṇo khalu, bho, gotamo rañño pasenadissa kosalassa sakkato garukato mānito pūjito apacito…pe… ‘‘Samaṇo khalu, bho, gotamo brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito…pe… ‘‘Samaṇo khalu, bho, gotamo khāṇumataṃ anuppatto khāṇumate viharati ambalaṭṭhikāyaṃ. Ye kho pana, bho, keci samaṇā vā brāhmaṇā vā amhākaṃ gāmakhettaṃ āgacchanti, atithī no te honti. Atithī kho panamhehi sakkātabbā garukātabbā mānetabbā pūjetabbā apacetabbā. Yampi, bho, samaṇo gotamo khāṇumataṃ anuppatto khāṇumate viharati ambalaṭṭhikāyaṃ, atithimhākaṃ samaṇo gotamo. Atithi kho panamhehi sakkātabbo garukātabbo mānetabbo pūjetabbo apacetabbo. Imināpaṅgena nārahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Atha kho mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ. Ettake kho ahaṃ, bho, tassa bhoto gotamassa vaṇṇe pariyāpuṇāmi, no ca kho so bhavaṃ gotamo ettakavaṇṇo. Aparimāṇavaṇṇo hi so bhavaṃ gotamo’’ti.",
      "english": "Thus spoke Kūṭadanta the brahmin to those brahmins: “Listen, sirs, to why we ourselves are worthy of going to see that Master Gotama, and why that Master Gotama is not worthy of coming to see us.\n\nIndeed, sirs, the ascetic Gotama is well-born on both sides, from mother and father, of pure descent back through seven generations of ancestors, without blemish or reproach concerning birth. Because, sirs, the ascetic Gotama is well-born on both sides, from mother and father, of pure descent back through seven generations of ancestors, without blemish or reproach concerning birth, for this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama left a large family circle and went forth from the home to the homeless life. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama left abundant gold and silver, both stored on the ground and held in the air, and went forth from the home to the homeless life. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama, while still young, a youth with fine black hair, endowed with the blessing of youth, in the prime of his life, went forth from the home to the homeless life. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama, with his parents unwilling, with tearful faces, weeping, shaved off his hair and beard, put on saffron robes, and went forth from the home to the homeless life. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is handsome, good-looking, delightful, endowed with supreme beauty of complexion, with a divine complexion and presence, not unapproachable to behold. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is virtuous, possessing noble virtue, wholesome virtue, endowed with wholesome virtue. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama has beautiful speech, beautiful utterance, endowed with an articulate, clear, and meaningful voice that conveys the meaning. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is the teacher and preceptor of many. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama has destroyed sensual desire, become free from agitation. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is a speaker of action, a speaker of effort, one who condemns evil for the brahmin community. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama went forth from a high family, an unbroken warrior family. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama went forth from a wealthy family, one with great riches and great possessions. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, people come to the ascetic Gotama from beyond the kingdom, from beyond the country, to ask questions. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, many thousands of deities have gone for refuge to the ascetic Gotama with their lives. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, such a good report has arisen about the ascetic Gotama: ‘The Blessed One is indeed Arahant, Perfectly Self-Awakened, accomplished in knowledge and conduct, fortunate, knower of the world, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.’ For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is endowed with the thirty-two marks of a Great Man. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is one who bids welcome, is amiable, courteous, without a frown, with an open countenance, and is a ready speaker. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is honored, revered, respected, venerated, and esteemed by the four assemblies. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, many gods and humans have great faith in the ascetic Gotama. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, in whatever village or town the ascetic Gotama dwells, in that village or town, non-humans do not harm humans. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is a leader of a community, a leader of a group, a teacher of a group, and is proclaimed as chief among those who hold different views. Indeed, sirs, the fame of these other ascetics and brahmins arises in this way or that way, but not so has the fame of the ascetic Gotama arisen. Rather, the fame of the ascetic Gotama has arisen through unsurpassed accomplishment in knowledge and conduct. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, King Seniya Bimbisāra of Magadha, with his children, wives, retinue, and ministers, has gone for refuge to the ascetic Gotama with his life. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, King Pasenadi of Kosala, with his children, wives, retinue, and ministers, has gone for refuge to the ascetic Gotama with his life. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the brahmin Pokkharasāti, with his children, wives, retinue, and ministers, has gone for refuge to the ascetic Gotama with his life. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is honored, revered, respected, venerated, and esteemed by King Seniya Bimbisāra of Magadha. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is honored, revered, respected, venerated, and esteemed by King Pasenadi of Kosala. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama is honored, revered, respected, venerated, and esteemed by the brahmin Pokkharasāti. For this reason that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\nIndeed, sirs, the ascetic Gotama has arrived at Khāṇumata and is dwelling there at the Ambalaṭṭhikā. Indeed, sirs, any ascetics or brahmins who come to our village territory are our guests. Guests, for our part, should be honored, revered, respected, venerated, and esteemed. Because, sirs, the ascetic Gotama has arrived at Khāṇumata and is dwelling there at the Ambalaṭṭhikā, the ascetic Gotama is our guest. Guests, for our part, should be honored, revered, respected, venerated, and esteemed. For this reason, that Master Gotama is not worthy of coming to see us. Rather, we ourselves are worthy of going to see that Master Gotama.\n\n“Indeed, sirs, these are the praises of Master Gotama that I have learned, but Master Gotama is not limited to just these praises. Indeed, that Master Gotama has immeasurable praises.”",
      "sinhala": "මෙසේ පැවසූ විට, කූටදන්ත බ්‍රාහ්මණයා ඒ බ්‍රාහ්මණවරුන්ට මෙසේ කීවේය – “එසේනම්, පින්වතුනි, මගේද අසන්න. ඒ භාග්‍යවත් ගෞතමයන් වහන්සේව දැකීමට යාමට සුදුසු වන්නේ අපමයි. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අපව දැකීමට ඒමට සුදුසු නොවේ.\n\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ මව්පසින්ද පියපසින්ද සත්වන පීතෘ පරම්පරාව දක්වාම පිරිසිදු උපතක් ඇති, ජාතිවාදයෙන් කිසිදු දෝෂයකට ලක් නොවූ, අභියෝගයට ලක් නොවූ උතුමෙකි. පින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ මව්පසින්ද පියපසින්ද සත්වන පීතෘ පරම්පරාව දක්වාම පිරිසිදු උපතක් ඇති, ජාතිවාදයෙන් කිසිදු දෝෂයකට ලක් නොවූ, අභියෝගයට ලක් නොවූ උතුමෙකි යනු යම් කරුණක් වේද, මේ කරුණ නිසා ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අපව දැකීමට ඒමට සුදුසු නොවේ. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේව දැකීමට යාමට සුදුසු වන්නේ අපමයි.\n\n“පින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ මහත් ඥාති සමූහයක් අත්හැර පැවිදි වූ සේක.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ පොළොවේ ඇතිද, අහසේ ඇතිද බොහෝ රන් රිදී සම්පත් අත්හැර පැවිදි වූ සේක.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ තරුණ වියේදීම, යෞවනයෙකුව, කළු කෙස් ඇති, උතුම් යොවුන් වියෙන් යුක්තව, ප්‍රථම වයසේදී ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වූ සේක.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ අකමැතිව, කඳුළු සලමින් හඬා වැලපෙමින් සිටි මව්පියන් අත්හැර, හිසකේ රැවුල කපා, කසාවත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වූ සේක.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ ඉතා රූමත්, දැකුම්කළු, ප්‍රියමනාප, උත්තරීතර වූ කාය ශෝභාවෙන් යුක්ත වූ, බ්‍රහ්ම වර්ණයෙන් හා බ්‍රහ්ම තේජසින් බබළන, දැකීමට සුළු අවකාශයක් නැති (සැමවිටම දැකීමට සිත් උපදින) උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ ශීල සම්පන්නයෙක්, ආර්ය ශීලයෙන් යුක්ත වූ, කුසල ශීලයෙන් යුක්ත වූ, කුසල ශීලයෙන් සමන්විත වූ උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ කල්යාණ වචන ඇත්තෙක්, කල්යාණ කථන ඇත්තෙක්, නිදහස් වූ, නොගැටුණු, අර්ථය දැනවිය හැකි පුරුෂ වචනයෙන් යුක්ත වූ උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ බොහෝ දෙනෙකුගේ ආචාර්ය-ප්‍රාචාර්යවරයා (ගුරුන්ගේත් ගුරුවරයා) වූ සේක.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ කාම රාගය ක්ෂය කළ, චංචල බව දුරු කළ උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ කර්මවාදී වූ, ක්‍රියාවාදී වූ, බ්‍රාහ්මණ ප්‍රජාවට පවා අකුසලයෙන් වැළකී සිටීමට අනුග්‍රහ කරන උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ උසස් කුලයකින්, නොබිඳුණු ක්ෂත්‍රිය කුලයකින් පැවිදි වූ සේක.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ ධනවත් කුලයකින්, මහත් ධන සම්පත් හා භෝග ඇති කුලයකින් පැවිදි වූ සේක.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේගෙන් ප්‍රශ්න විචාරීමට වෙනත් රටවල්වලින්, වෙනත් ජනපදවලින් ජනයා පැමිණෙති.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේව දහස් ගණන් දෙවිවරු ජීවිතයෙන් සරණ ගොස් සිටිති.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ පිළිබඳව ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධෝ, භගවා’ යන මෙබඳු උතුම් කීර්ති රාවයක් පැතිරී ඇත.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ දෙතිස් මහා පුරුෂ ලක්ෂණයන්ගෙන් යුක්ත වූ සේක.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ ‘එන්න, සාදරයෙන් පිළිගනිමු’ යනුවෙන් කතා කරන, සුහද, සතුටු කරන, මුහුණේ කිසිදු කිළිටක් නැති, ප්‍රසන්න මුහුණකින් යුක්ත, පළමුව කතා කරන උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ සිව්වනක් පිරිස විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, පිදිය යුතු උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ කෙරෙහි බොහෝ දෙවි දේවතාවෝද, මනුෂ්‍යයෝද අධිකව ප්‍රසන්න වී සිටිති.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ යම් ගමක හෝ නියම්ගමක වැඩසිටින සේක්ද, ඒ ගමේ හෝ නියම්ගමේ අමනුෂ්‍යයෝ මිනිසුන්ට හිංසා නොකරති.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ සංඝයා සහිත, ගණයන් සහිත, ගණාචාර්යයෙකු ලෙස බොහෝ තීර්ථකයන් අතුරින් අග්‍රතමයා ලෙස ප්‍රකාශ කරනු ලැබේ. පින්වතුනි, ඒ ශ්‍රමණ බ්‍රාහ්මණයන්ගේ කීර්තිය යම්කිසි අයුරකින් හෝ හටගත්තා වුවද, ශ්‍රමණ ගෞතමයන් වහන්සේගේ කීර්තිය එසේ හටගත්තේ නැත. අනුත්තර වූ විද්‍යාචරණ සම්පත්තියෙන් ශ්‍රමණ ගෞතමයන් වහන්සේගේ කීර්තිය හටගත්තේය.\nපින්වතුනි, මගධ දේශයේ සේනිය බිම්බිසාර රජු පුතුන්, භාර්යාවන්, පිරිවර සහ ඇමතිවරුන් සමඟ ජීවිතයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේව සරණ ගියේය.\nපින්වතුනි, කොසොල් දේශයේ පසේනදී රජු පුතුන්, භාර්යාවන්, පිරිවර සහ ඇමතිවරුන් සමඟ ජීවිතයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේව සරණ ගියේය.\nපින්වතුනි, පොක්ඛරසාති බ්‍රාහ්මණයා පුතුන්, භාර්යාවන්, පිරිවර සහ ඇමතිවරුන් සමඟ ජීවිතයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේව සරණ ගියේය.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ මගධ දේශයේ සේනිය බිම්බිසාර රජු විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, පිදිය යුතු උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ කොසොල් දේශයේ පසේනදී රජු විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, පිදිය යුතු උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ පොක්ඛරසාති බ්‍රාහ්මණයා විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, පිදිය යුතු උතුමෙකි.\nපින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ ඛාණූමත ගමට පැමිණ, ඛාණූමත නියම්ගමේ අම්බලට්ඨිකාවේ වැඩසිටින සේක. පින්වතුනි, යම් ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ අපගේ ගම් ප්‍රදේශයට පැමිණෙත්ද, ඔවුහු අපගේ අමුත්තෝ වෙති. අමුත්තන්ට අප විසින් සත්කාර කළ යුතුයි, ගරු කළ යුතුයි, මැනිය යුතුයි, පුද දිය යුතුයි, පිදිය යුතුයි. පින්වතුනි, ශ්‍රමණ ගෞතමයන් වහන්සේ ඛාණූමත ගමට පැමිණ, ඛාණූමත නියම්ගමේ අම්බලට්ඨිකාවේ වැඩසිටින සේක යනු යම් කරුණක් වේද, ශ්‍රමණ ගෞතමයන් වහන්සේ අපගේ අමුත්තා වෙයි. අමුත්තන්ට අප විසින් සත්කාර කළ යුතුයි, ගරු කළ යුතුයි, මැනිය යුතුයි, පුද දිය යුතුයි, පිදිය යුතුයි. මේ කරුණ නිසා ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අපව දැකීමට ඒමට සුදුසු නොවේ. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේව දැකීමට යාමට සුදුසු වන්නේ අපමයි. පින්වතුනි, ඒ භාග්‍යවත් ගෞතමයන් වහන්සේගේ ගුණ මම මෙපමණක් දැන සිටියත්, ඒ භාග්‍යවතුන් වහන්සේ මෙපමණ ගුණ ඇති කෙනෙක් නොවේ. ඒ භාග්‍යවතුන් වහන්සේ අපරිමිත ගුණ ඇති උතුමෙකි.”",
      "paliTitle": "Buddhaguṇakathā",
      "englishTitle": "Discourse on Buddha's Qualities",
      "sinhalaTitle": "බුද්‍ධගුණ කථා"
    },
    {
      "number": 333,
      "pali": "Evaṃ vutte, te brāhmaṇā kūṭadantaṃ brāhmaṇaṃ etadavocuṃ – ‘‘yathā kho bhavaṃ kūṭadanto samaṇassa gotamassa vaṇṇe bhāsati, ito cepi so bhavaṃ gotamo yojanasate viharati, alameva saddhena kulaputtena dassanāya upasaṅkamituṃ api puṭosenā’’ti. ‘‘Tena hi, bho, sabbeva mayaṃ samaṇaṃ gotamaṃ dassanāya upasaṅkamissāmā’’ti.",
      "english": "When this was said, those brahmins said to the brahmin Kūṭadanta: \"Just as venerable Kūṭadanta speaks in praise of the recluse Gotama, even if that venerable Gotama lives a hundred leagues away from here, it would be enough for a faithful gentleman to approach him for an audience, even carrying a bundle of provisions.\" \"In that case, sirs, we shall all go to see the recluse Gotama.\"",
      "sinhala": "මෙසේ කී කල්හි ඒ බ්‍රාහ්මණවරු කූටදන්ත බ්‍රාහ්මණයාට මෙය කීහ: “කූටදන්ත පින්වතුන් යම් සේ ශ\\u200d්‍රමණ ගෞතමයන් වහන්සේගේ ගුණ වර්ණනා කරනවා නම්, ඒ ගෞතම පින්වතුන් මෙතැන් සිට යොදුන් සියයක් ඈතින් වැඩ සිටියත්, ශ\\u200d්‍රද්ධාවෙන් යුතු කුලපුත\\u200d්‍රයෙකුට (එතුමන්) දැකීම පිණිස දුර ගමනක් ගොස් හෝ උන්වහන්සේ වෙතට යෑම ප\\u200d්‍රමාණවත් වේ.” “එසේ නම්, පින්වතුනි, අපි සියල්ලෝම ශ\\u200d්‍රමණ ගෞතමයන් වහන්සේ දැකීම පිණිස (උන්වහන්සේ වෙතට) යමු.”",
      "paliTitle": ""
    },
    {
      "number": 334,
      "pali": "Atha kho kūṭadanto brāhmaṇo mahatā brāhmaṇagaṇena saddhiṃ yena ambalaṭṭhikā yena bhagavā tenupasaṅkami, upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Khāṇumatakāpi kho brāhmaṇagahapatikā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu; appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu; appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu; appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu.",
      "english": "Then, the brahmin Kūṭadanta, together with a large retinue of brahmins, approached the Exalted One at Ambalaṭṭhikā. Having approached, he exchanged greetings with the Exalted One. Having concluded their polite and cordial conversation, he sat down to one side. And also the brahmins and householders from Khāṇumata: some, having paid homage to the Exalted One, sat down to one side; some exchanged greetings with the Exalted One, and having concluded their polite and cordial conversation, sat down to one side; some, having raised their joined hands in salutation towards the Exalted One, sat down to one side; some, having announced their name and clan, sat down to one side; and some, remaining silent, sat down to one side.",
      "sinhala": "ඉන්පසු කූටදන්ත බ්‍රාහ්මණයා විශාල බ්‍රාහ්මණ පිරිසක් සමඟ අම්බලට්ඨිකාව වෙත, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියේය. එළඹ, භාග්‍යවතුන් වහන්සේ සමඟ සමගි වචන කථා කෙළේය. ප්‍රිය සාකච්ඡා හා සිහිපත් කළ යුතු කථා බස් හුවමාරු කරගෙන ඔහු එකත්පසෙකින් වාඩි විය.\n\nඛාණුමතක නම් ස්ථානයෙන් පැමිණි සමහර බ්‍රාහ්මණ ගෘහපතියෝ ද භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පසෙකින් වාඩි වූහ; සමහරෙක් භාග්‍යවතුන් වහන්සේ සමඟ සමගි වචන කථා කොට, ප්‍රිය සාකච්ඡා හා සිහිපත් කළ යුතු කථා බස් හුවමාරු කරගෙන එකත්පසෙකින් වාඩි වූහ; සමහරෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි දෙසට දොහොත් මුදුන් තබා එකත්පසෙකින් වාඩි වූහ; සමහරෙක් තමන්ගේ නම ගොත්‍රය දැන්වීමෙන් පසු එකත්පසෙකින් වාඩි වූහ; සමහරෙක් නිශ්ශබ්දව එකත්පසෙකින් වාඩි වූහ.",
      "paliTitle": "Mahāvijitarājayaññakathā",
      "englishTitle": "Story of the Great Victorious Royal Sacrifice",
      "sinhalaTitle": "මහා විජිත රාජයාගේ යඥ්‍ඤ කථාව"
    },
    {
      "number": 335,
      "pali": "Ekamantaṃ nisinno kho kūṭadanto brāhmaṇo bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama – ‘samaṇo gotamo tividhaṃ yaññasampadaṃ soḷasaparikkhāraṃ jānātī’ti. Na kho panāhaṃ jānāmi tividhaṃ yaññasampadaṃ soḷasaparikkhāraṃ. Icchāmi cāhaṃ mahāyaññaṃ yajituṃ. Sādhu me bhavaṃ gotamo tividhaṃ yaññasampadaṃ soḷasaparikkhāraṃ desetū’’ti.",
      "english": "Then Kūṭadanta the Brahmin, seated to one side, said this to the Blessed One: \"I have heard this, Master Gotama: 'The recluse Gotama knows the three-fold perfection of sacrifice and its sixteen requisites.' But I do not know the three-fold perfection of sacrifice and its sixteen requisites. And I wish to perform a great sacrifice. May Master Gotama please teach me the three-fold perfection of sacrifice and its sixteen requisites.\"",
      "sinhala": "එක් පැත්තක වාඩි වී සිටි කූටදන්ත බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භවත් ගෞතමයන් වහන්ස, 'ශ්‍රමණ ගෞතමයන් වහන්සේ ත්‍රිවිධ යඥ්ඥ සම්පත්තිය සහ ෂෝඩශ පරිෂ්කාරයන් දන්නා සේක' යනුවෙන් මා අසා ඇත. එහෙත් මම නම් ත්‍රිවිධ යඥ්ඥ සම්පත්තිය හෝ ෂෝඩශ පරිෂ්කාරයන් නොදනිමි. මම මහා යඥ්ඥයක් පැවැත්වීමට කැමැත්තෙමි. භවත් ගෞතමයන් වහන්සේ මට ත්‍රිවිධ යඥ්ඥ සම්පත්තිය සහ ෂෝඩශ පරිෂ්කාරයන් දේශනා කළ මැනව.\"",
      "paliTitle": ""
    },
    {
      "number": 336,
      "pali": "‘‘Tena hi, brāhmaṇa, suṇāhi sādhukaṃ manasikarohi, bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho kūṭadanto brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘bhūtapubbaṃ, brāhmaṇa, rājā mahāvijito nāma ahosi aḍḍho mahaddhano mahābhogo pahūtajātarūparajato pahūtavittūpakaraṇo pahūtadhanadhañño paripuṇṇakosakoṭṭhāgāro. Atha kho, brāhmaṇa, rañño mahāvijitassa rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – ‘adhigatā kho me vipulā mānusakā bhogā, mahantaṃ pathavimaṇḍalaṃ abhivijiya ajjhāvasāmi, yaṃnūnāhaṃ mahāyaññaṃ yajeyyaṃ, yaṃ mama assa dīgharattaṃ hitāya sukhāyā’ti.",
      "english": "\"Then, brahmin, listen carefully and pay close attention; I shall speak.\" \"Yes, sir,\" replied the brahmin Kūṭadanta to the Blessed One. The Blessed One spoke thus: \"Once upon a time, brahmin, there was a king named Mahāvijita. He was wealthy, had great riches and vast possessions, abundant gold and silver, ample financial resources, much grain and treasure, and his storehouses and granaries were full.\n\nThen, brahmin, as King Mahāvijita was alone and secluded, a thought arose in his mind thus: 'Indeed, I have acquired vast human enjoyments; I have conquered and settled a great expanse of land. What if I were to perform a great sacrifice, which would be for my long-term welfare and happiness?'\"",
      "sinhala": "\"එහෙයින් බ්‍රාහ්මණය, මැනවින් අසන්න, සිතට ගන්න. මම දේශනා කරන්නෙමි.\"\n\"එසේය, ස්වාමීනි\" යනුවෙන් කූටදන්ත බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක – \"බ්‍රාහ්මණය, පෙර කලෙක මහාවිජිත නම් රජෙක් විය. ඔහු ධනවත්ය, මහත් ධනයක් ඇති, මහත් භෝග සම්පත් ඇති, බහුල රන් රිදී ඇති, බහුල වස්තු උපකරණ ඇති, බහුල ධන ධාන්‍ය ඇති, පිරුණු කෝෂාගාර හා ධාන්‍යාගාර ඇති අයෙක් විය. ඉන්පසු බ්‍රාහ්මණය, මහාවිජිත රජුට තනිව, නිස්කලංකව සිටියදී මෙබඳු සිතුවිල්ලක් පහළ විය – ‘මම විශාල මනුෂ්‍ය භෝග සම්පත් ලබාගෙන සිටිමි. මහත් පෘථිවි මණ්ඩලය ජයගෙන වාසය කරමි. යම් හෙයකින් මම මහා යාගයක් පවත්වන්නෙම් නම්, එය මට දීර්ඝ කාලයක් හිත සුව පිණිස වන්නේය’ යනුවෙනි.",
      "paliTitle": ""
    },
    {
      "number": 337,
      "pali": "‘‘Atha kho, brāhmaṇa, rājā mahāvijito purohitaṃ brāhmaṇaṃ āmantetvā etadavoca – ‘idha mayhaṃ, brāhmaṇa, rahogatassa paṭisallīnassa evaṃ cetaso parivitakko udapādi – adhigatā kho me vipulā mānusakā bhogā, mahantaṃ pathavimaṇḍalaṃ abhivijiya ajjhāvasāmi. Yaṃnūnāhaṃ mahāyaññaṃ yajeyyaṃ yaṃ mama assa dīgharattaṃ hitāya sukhāyā’ti. Icchāmahaṃ, brāhmaṇa, mahāyaññaṃ yajituṃ. Anusāsatu maṃ bhavaṃ yaṃ mama assa dīgharattaṃ hitāya sukhāyā’’’ti.",
      "english": "Then, brahmin, King Mahāvijita, having summoned his brahmin chaplain, said this: ‘Here, brahmin, while I was secluded and withdrawn, such a thought arose in my mind: Indeed, vast human enjoyments have been attained by me, and having conquered a great expanse of land, I dwell upon it. What if I were to offer a great sacrifice, which would be for my long-term welfare and happiness? I wish, brahmin, to offer a great sacrifice. May your reverence instruct me on what would be for my long-term welfare and happiness.’",
      "sinhala": "එවිට, බ්‍රාහ්මණ, මහා විජිත රජු පුරෝහිත බ්‍රාහ්මණයා අමතා මෙසේ පැවසුවේය – ‘බ්‍රාහ්මණ, මෙහි මා හුදකලා වූ විට, භාවනාවෙහි යෙදී සිටියදී, මගේ සිතෙහි මෙවන් කල්පනාවක් පහළ විය – මට බොහෝ මනුෂ්‍ය භෝග සම්පත් ලැබී ඇත. විශාල පෘථිවි මණ්ඩලයක් ජයගෙන මා එහි වාසය කරමි. කෙසේනම් මම මහා යාගයක් සිදුකරන්නෙම්ද, එය මට බොහෝ කලක් හිතසුව පිණිස වන්නේය. බ්‍රාහ්මණ, මම මහා යාගයක් කිරීමට කැමැත්තෙමි. ගරු ස්වාමීනි, මට අනුශාසනා කරන්න, එය මට බොහෝ කලක් හිතසුව පිණිස වන්නේය.’",
      "paliTitle": ""
    },
    {
      "number": 338,
      "pali": "‘‘Evaṃ vutte, brāhmaṇa, purohito brāhmaṇo rājānaṃ mahāvijitaṃ etadavoca – ‘bhoto kho rañño janapado sakaṇṭako sauppīḷo, gāmaghātāpi dissanti, nigamaghātāpi dissanti, nagaraghātāpi dissanti, panthaduhanāpi dissanti. Bhavaṃ kho pana rājā evaṃ sakaṇṭake janapade sauppīḷe balimuddhareyya, akiccakārī assa tena bhavaṃ rājā. Siyā kho pana bhoto rañño evamassa – ‘‘ahametaṃ dassukhīlaṃ vadhena vā bandhena vā jāniyā vā garahāya vā pabbājanāya vā samūhanissāmī’’ti, na kho panetassa dassukhīlassa evaṃ sammā samugghāto hoti. Ye te hatāvasesakā bhavissanti, te pacchā rañño janapadaṃ viheṭhessanti. Api ca kho idaṃ saṃvidhānaṃ āgamma evametassa dassukhīlassa sammā samugghāto hoti. Tena hi bhavaṃ rājā ye bhoto rañño janapade ussahanti kasigorakkhe, tesaṃ bhavaṃ rājā bījabhattaṃ anuppadetu. Ye bhoto rañño janapade ussahanti vāṇijjāya, tesaṃ bhavaṃ rājā pābhataṃ anuppadetu. Ye bhoto rañño janapade ussahanti rājaporise, tesaṃ bhavaṃ rājā bhattavetanaṃ pakappetu. Te ca manussā sakammapasutā rañño janapadaṃ na viheṭhessanti; mahā ca rañño rāsiko bhavissati. Khemaṭṭhitā janapadā akaṇṭakā anuppīḷā. Manussā mudā modamānā ure putte naccentā apārutagharā maññe viharissantī’ti. ‘Evaṃ, bho’ti kho, brāhmaṇa, rājā mahāvijito purohitassa brāhmaṇassa paṭissutvā ye rañño janapade ussahiṃsu kasigorakkhe, tesaṃ rājā mahāvijito bījabhattaṃ anuppadāsi. Ye ca rañño janapade ussahiṃsu vāṇijjāya, tesaṃ rājā mahāvijito pābhataṃ anuppadāsi. Ye ca rañño janapade ussahiṃsu rājaporise, tesaṃ rājā mahāvijito bhattavetanaṃ pakappesi. Te ca manussā sakammapasutā rañño janapadaṃ na viheṭhiṃsu, mahā ca rañño rāsiko ahosi. Khemaṭṭhitā janapadā akaṇṭakā anuppīḷā manussā mudā modamānā ure putte naccentā apārutagharā maññe vihariṃsu. Atha kho, brāhmaṇa, rājā mahāvijito purohitaṃ brāhmaṇaṃ āmantetvā etadavoca – ‘samūhato kho me bhoto dassukhīlo, bhoto saṃvidhānaṃ āgamma mahā ca me rāsiko. Khemaṭṭhitā janapadā akaṇṭakā anuppīḷā manussā mudā modamānā ure putte naccentā apārutagharā maññe viharanti. Icchāmahaṃ brāhmaṇa mahāyaññaṃ yajituṃ. Anusāsatu maṃ bhavaṃ yaṃ mama assa dīgharattaṃ hitāya sukhāyā’ti. ",
      "english": "When this was said, brahmin, the brahmin royal chaplain spoke to King Mahāvijita thus: 'Indeed, King, your realm is beset by thorns and afflicted with troubles; villages are seen being plundered, towns are seen being plundered, cities are seen being plundered, and highway robberies are also seen. If the King were to levy taxes in such a thorny and afflicted realm, the King would not be acting appropriately thereby. It might be that the King would think, \"I will uproot this thorn of brigandage by execution, imprisonment, confiscation, censure, or banishment.\" However, this thorn of brigandage is not properly uprooted in such a way. Those who remain after being struck down will later trouble the King's realm. But indeed, by adopting this arrangement, this thorn of brigandage is properly uprooted. Therefore, King, to those in your realm who are engaged in farming and cattle-rearing, may you provide seeds and provisions. To those in your realm who are engaged in trade, may you provide capital. To those in your realm who are engaged in royal service, may you arrange for their food and wages. And those people, intent on their own work, will not trouble the King's realm; and the King's revenue will be great. The realms will be secure, free from thorns, and untroubled. People will live, I believe, happily and joyfully, dancing their children on their hips, with open doors.' 'So be it, good sir,' brahmin, King Mahāvijita, having assented to the brahmin royal chaplain, provided seeds and provisions to those in his realm who were engaged in farming and cattle-rearing. And to those in his realm who were engaged in trade, King Mahāvijita provided capital. And to those in his realm who were engaged in royal service, King Mahāvijita arranged for their food and wages. And those people, intent on their own work, did not trouble the King's realm, and the King's revenue became great. The realms became secure, free from thorns, and untroubled. People lived happily and joyfully, dancing their children on their hips, with open doors, I believe. Then, brahmin, King Mahāvijita called the brahmin royal chaplain and said to him: 'Indeed, my thorn of brigandage has been uprooted by your arrangement, and my revenue is great. The realms are secure, free from thorns, and untroubled. People live happily and joyfully, dancing their children on their hips, with open doors, I believe. Brahmin, I wish to offer a great sacrifice. May you instruct me on what would be for my long-term welfare and happiness.'",
      "sinhala": "‘එසේ පැවසූ කල්හි, බ්‍රාහ්මණයාණෙනි, පුරෝහිත බ්‍රාහ්මණයා මහා විජිත රජුට මෙසේ කීවේය: ‘පින්වත් රජතුමනි, ඔබගේ ජනපදය කටු සහිතය, පීඩා සහිතය. ගම් විනාශ කිරීම්ද පෙනේ, නියම්ගම් විනාශ කිරීම්ද පෙනේ, නගර විනාශ කිරීම්ද පෙනේ, මාර්ගවලදී මිනිසුන්ට හිරිහැර කිරීම්ද පෙනේ. පින්වත් රජතුමා එවන් කටු සහිත, පීඩා සහිත ජනපදයක බදු එකතු කරන්නේ නම්, රජතුමා එයින් නිවැරදි කටයුතු කරන්නෙකු නොවනු ඇත. සමහරවිට පින්වත් රජතුමාට මෙසේ සිතෙන්නට පුළුවන: “මම මේ දුෂ්ටකම් වධයෙන් හෝ බන්ධනයෙන් හෝ දඩුවම් කිරීමෙන් හෝ නින්දා කිරීමෙන් හෝ පිටුවහල් කිරීමෙන් හෝ සම්පූර්ණයෙන්ම මුලිනුපුටා දමන්නෙමි” කියා, නමුත් එවැනි දුෂ්ටකම් එසේ නිවැරදිව මුලිනුපුටා දැමීමක් සිදු නොවේ. මරා දැමීමෙන් ඉතිරි වූවෝ පසුව රජුගේ ජනපදයට හිරිහැර කරති. එහෙත් මේ සංවිධානය (උපක්‍රමය) මගින් එවැනි දුෂ්ටකම් නිවැරදිව මුලිනුපුටා දැමීම සිදු වේ. එසේ නම්, පින්වත් රජතුමනි, ඔබගේ ජනපදයේ කෘෂිකාර්මික හා ගව පාලන කටයුතුවල නිරත වන අයට බීජ හා ආහාර ලබා දෙන්න. ඔබගේ ජනපදයේ වෙළෙඳාමේ නිරත වන අයට ප්‍රාග්ධනය ලබා දෙන්න. ඔබගේ ජනපදයේ රාජ්‍ය සේවයේ නිරත වන අයට වැටුප් හා දීමනා සලස්වන්න. එවිට එම මිනිසුන් තම තමන්ගේ කටයුතුවල නිරත වෙමින් රජුගේ ජනපදයට හිරිහැර නොකරනු ඇත; රජුට විශාල ධනයක්ද ලැබෙනු ඇත. ජනපද ක්ෂේම භූමි වී, කටු රහිත වී, පීඩා රහිත වනු ඇත. මිනිසුන් ප්‍රීතියෙන් හා සතුටින් තම දරුවන් තම උකුලේ තබාගෙන නටවමින්, විවෘත දොරටු ඇති නිවෙස්වල වසනු ඇතැයි මම සිතමි’ කියා.\"\n\n‘එසේය, පින්වත’ යි කී කල්හි, බ්‍රාහ්මණයාණෙනි, මහා විජිත රජු පුරෝහිත බ්‍රාහ්මණයාගේ කීම පිළිගෙන, යම් කිසිවෙක් රජුගේ ජනපදයේ කෘෂිකර්මාන්තයේ හා ගව පාලනයේ යෙදුණාහුද, ඔවුනට මහා විජිත රජු බීජ හා ආහාර ලබා දුන්නේය. යම් කිසිවෙක් රජුගේ ජනපදයේ වෙළෙඳාමේ යෙදුණාහුද, ඔවුනට මහා විජිත රජු ප්‍රාග්ධනය ලබා දුන්නේය. යම් කිසිවෙක් රජුගේ ජනපදයේ රාජ්‍ය සේවයේ යෙදුණාහුද, ඔවුනට මහා විජිත රජු වැටුප් හා දීමනා සලස්වන ලදී. එම මිනිසුන් තම තමන්ගේ කටයුතුවල නිරත වෙමින් රජුගේ ජනපදයට හිරිහැර නොකළහ; රජුට විශාල ධනයක්ද ලැබිණි. ජනපද ක්ෂේම භූමි වී, කටු රහිත වී, පීඩා රහිත විය. මිනිසුන් ප්‍රීතියෙන් හා සතුටින් තම දරුවන් තම උකුලේ තබාගෙන නටවමින්, විවෘත දොරටු ඇති නිවෙස්වල වසන ලදී. ඉක්බිති, බ්‍රාහ්මණයාණෙනි, මහා විජිත රජු පුරෝහිත බ්‍රාහ්මණයා අමතා මෙසේ කීවේය: ‘පින්වත් ඔබගේ සංවිධානය (උපක්‍රමය) නිසා මගේ දුෂ්ටකම් මුලිනුපුටා දමන ලදී, මට විශාල ධනයක්ද ලැබුණි. ජනපද ක්ෂේම භූමි වී, කටු රහිත වී, පීඩා රහිත වී ඇත. මිනිසුන් ප්‍රීතියෙන් හා සතුටින් තම දරුවන් තම උකුලේ තබාගෙන නටවමින්, විවෘත දොරටු ඇති නිවෙස්වල වසති. බ්‍රාහ්මණයාණෙනි, මම මහා යාගයක් පැවැත්වීමට කැමැත්තෙමි. එය මට දීර්ඝ කාලයක් හිතසුව පිණිස වන පරිදි මට උපදෙස් දෙන්නැයි’ කියා.\"",
      "paliTitle": ""
    },
    {
      "number": 339,
      "pali": "‘‘Tena hi bhavaṃ rājā ye bhoto rañño janapade khattiyā ānuyantā negamā ceva jānapadā ca te bhavaṃ rājā āmantayataṃ – ‘icchāmahaṃ, bho, mahāyaññaṃ yajituṃ, anujānantu me bhavanto yaṃ mama assa dīgharattaṃ hitāya sukhāyā’ti. Ye bhoto rañño janapade amaccā pārisajjā negamā ceva jānapadā ca…pe… brāhmaṇamahāsālā negamā ceva jānapadā ca…pe… gahapatinecayikā negamā ceva jānapadā ca, te bhavaṃ rājā āmantayataṃ – ‘icchāmahaṃ, bho, mahāyaññaṃ yajituṃ, anujānantu me bhavanto yaṃ mama assa dīgharattaṃ hitāya sukhāyā’ti. ‘Evaṃ, bho’ti kho, brāhmaṇa, rājā mahāvijito purohitassa brāhmaṇassa paṭissutvā ye rañño janapade khattiyā ānuyantā negamā ceva jānapadā ca, te rājā mahāvijito āmantesi – ‘icchāmahaṃ, bho, mahāyaññaṃ yajituṃ, anujānantu me bhavanto yaṃ mama assa dīgharattaṃ hitāya sukhāyā’’ti. ‘Yajataṃ bhavaṃ rājā yaññaṃ, yaññakālo mahārājā’ti. Ye rañño janapade amaccā pārisajjā negamā ceva jānapadā ca…pe… brāhmaṇamahāsālā negamā ceva jānapadā ca…pe… gahapatinecayikā negamā ceva jānapadā ca, te rājā mahāvijito āmantesi – ‘icchāmahaṃ, bho, mahāyaññaṃ yajituṃ. Anujānantu me bhavanto yaṃ mama assa dīgharattaṃ hitāya sukhāyā’ti. ‘Yajataṃ bhavaṃ rājā yaññaṃ, yaññakālo mahārājā’ti. Itime cattāro anumatipakkhā tasseva yaññassa parikkhārā bhavanti. ",
      "english": "Then, O King, as for those khattiyas, attendants in your majesty's realm, both townsfolk and country folk, your majesty should summon them and say: 'Sirs, I wish to offer a great sacrifice. May you sirs grant me permission, which will be for my long-term welfare and happiness.' As for those ministers and courtiers in your majesty's realm, both townsfolk and country folk; those great brahmin householders, both townsfolk and country folk; and those wealthy householders, both townsfolk and country folk, your majesty should summon them and say: 'Sirs, I wish to offer a great sacrifice. May you sirs grant me permission, which will be for my long-term welfare and happiness.'\n\n'So be it, sir,' O brahmin, King Mahāvijita, having agreed to the brahmin chaplain, then summoned those khattiyas who were attendants in the king's realm, both townsfolk and country folk, and said: 'Sirs, I wish to offer a great sacrifice. May you sirs grant me permission, which will be for my long-term welfare and happiness.' (They replied:) 'Let your majesty offer the sacrifice, O Great King, it is time for the sacrifice.'\n\nKing Mahāvijita also summoned those ministers and courtiers in the king's realm, both townsfolk and country folk; those great brahmin householders, both townsfolk and country folk; and those wealthy householders, both townsfolk and country folk, and said: 'Sirs, I wish to offer a great sacrifice. May you sirs grant me permission, which will be for my long-term welfare and happiness.' (They replied:) 'Let your majesty offer the sacrifice, O Great King, it is time for the sacrifice.'\n\nThus, these four classes of consent become requisites for that very sacrifice.",
      "sinhala": "එසේ නම්, ගරු රජතුමනි, ඔබ රජුගේ ජනපදයේ යම් ක්ෂත්‍රිය අනුගාමිකයෝ නගර වැසියෝද ජනපද වැසියෝද වෙත්ද, ඒ අයව ගරු රජතුමා අමතන්න – ‘මිත්‍රවරුනි, මට මහත් යාගයක් පැවැත්වීමට අවශ්‍යයි, මට බොහෝ කලක් හිතසුව පිණිස වන දේට ඔබතුමන්ලා අවසර දෙත්වා’ කියා. එසේම, ඔබ රජුගේ ජනපදයේ යම් ඇමතිවරු, පිරිස් සමාජිකයෝ නගර වැසියෝද ජනපද වැසියෝද වෙත්ද, යම් මහා බ්‍රාහ්මණවරු නගර වැසියෝද ජනපද වැසියෝද වෙත්ද, යම් ගහපති නැදෑයෝ නගර වැසියෝද ජනපද වැසියෝද වෙත්ද, ඒ අයව ගරු රජතුමා අමතන්න – ‘මිත්‍රවරුනි, මට මහත් යාගයක් පැවැත්වීමට අවශ්‍යයි, මට බොහෝ කලක් හිතසුව පිණිස වන දේට ඔබතුමන්ලා අවසර දෙත්වා’ කියා.\n\nබ්‍රාහ්මණය, 'එසේය, මිත්‍රය'යි මහා විජිත රජතුමා පුරෝහිත බ්‍රාහ්මණයාට පිළිතුරු දී, රජුගේ ජනපදයේ යම් ක්ෂත්‍රිය අනුගාමිකයෝ නගර වැසියෝද ජනපද වැසියෝද වෙත්ද, ඒ අයව මහා විජිත රජතුමා ඇමතුවේය – ‘මිත්‍රවරුනි, මට මහත් යාගයක් පැවැත්වීමට අවශ්‍යයි, මට බොහෝ කලක් හිතසුව පිණිස වන දේට ඔබතුමන්ලා අවසර දෙත්වා’ කියා. ඔවුහු, 'ගරු රජතුමනි, යාගය පවත්වන්න, මහ රජතුමනි, මෙය යාගයට සුදුසු කාලයයි' කියා පිළිතුරු දුන්හ. රජුගේ ජනපදයේ යම් ඇමතිවරු, පිරිස් සමාජිකයෝ නගර වැසියෝද ජනපද වැසියෝද වෙත්ද, යම් මහා බ්‍රාහ්මණවරු නගර වැසියෝද ජනපද වැසියෝද වෙත්ද, යම් ගහපති නැදෑයෝ නගර වැසියෝද ජනපද වැසියෝද වෙත්ද, ඒ අයව මහා විජිත රජතුමා ඇමතුවේය – ‘මිත්‍රවරුනි, මට මහත් යාගයක් පැවැත්වීමට අවශ්‍යයි, මට බොහෝ කලක් හිතසුව පිණිස වන දේට ඔබතුමන්ලා අවසර දෙත්වා’ කියා. ඔවුහු, 'ගරු රජතුමනි, යාගය පවත්වන්න, මහ රජතුමනි, මෙය යාගයට සුදුසු කාලයයි' කියා පිළිතුරු දුන්හ. මෙසේ මේ සතර අනුමැති පක්ෂයෝ ඒ යාගයේම උපකරණ වෙති.",
      "paliTitle": "Catuparikkhāraṃ",
      "englishTitle": "The Four Requisites",
      "sinhalaTitle": "සතර පරික්ඛාර"
    },
    {
      "number": 340,
      "pali": "‘‘Rājā mahāvijito aṭṭhahaṅgehi samannāgato, ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya; aḍḍho mahaddhano mahābhogo pahūtajātarūparajato pahūtavittūpakaraṇo pahūtadhanadhañño paripuṇṇakosakoṭṭhāgāro; balavā caturaṅginiyā senāya samannāgato assavāya ovādapaṭikarāya sahati [patapati (sī. pī.), tapati (syā.)] maññe paccatthike yasasā; saddho dāyako dānapati anāvaṭadvāro samaṇabrāhmaṇakapaṇaddhikavaṇibbakayācakānaṃ opānabhūto puññāni karoti; bahussuto tassa tassa sutajātassa, tassa tasseva kho pana bhāsitassa atthaṃ jānāti ‘ayaṃ imassa bhāsitassa attho ayaṃ imassa bhāsitassa attho’ti; paṇḍito, viyatto, medhāvī, paṭibalo, atītānāgatapaccuppanne atthe cintetuṃ. Rājā mahāvijito imehi aṭṭhahaṅgehi samannāgato. Iti imānipi aṭṭhaṅgāni tasseva yaññassa parikkhārā bhavanti. ",
      "english": "King Mahāvijita was endowed with eight qualities: well-born on both sides, from mother and father, with pure lineage up to seven generations of ancestors, without blemish or reproach regarding birth; handsome, good-looking, pleasing, endowed with supreme beauty of complexion, having the complexion of Brahma, the radiance of Brahma, not of humble appearance; rich, greatly wealthy, with vast possessions, abounding in gold and silver, abounding in various means of support, abounding in wealth and grain, with a full treasury and storehouses; powerful, endowed with a fourfold army, obedient and responsive to advice, and I think he overwhelms his enemies with his glory; faithful, a giver, a master of generosity, with an open door for ascetics, brahmins, the poor, the destitute, traders, and beggars, a wellspring of good deeds; learned, he understands the meaning of whatever is heard and whatever is spoken, thinking, ‘This is the meaning of this utterance, this is the meaning of that utterance’; wise, articulate, intelligent, capable of considering matters of the past, future, and present. King Mahāvijita was endowed with these eight qualities. Thus, these eight qualities also become the requisites of that very sacrifice.",
      "sinhala": "මහාවිජිත රජතුමා අංග අටකින් යුක්ත විය: මවුපිය දෙපක්ෂයෙන්ම මනා කොට උපන්නෙක් වූ, සත් පරම්පරාවක් යනතුරු පරපුර පිරිසිදු වූ, කුලවාදයෙන් කිසිවෙක් විසින් දොස් නොලද්දෙක්, නින්දා නොලද්දෙක් වූ; මනරම් රූපසෝභාවෙන් යුක්ත වූ, දැකීමට ප‍්‍රිය උපදවන, ඉතාම උසස් ව‍ර්ණ සම්පත්තියෙන් යුක්ත වූ, බ‍්‍රහ්ම ව‍ර්ණයෙන් හා බ‍්‍රහ්ම තේජසින් බබළන්නා වූ, දැකීමට බාධාවක් නැත්තා වූ; ධනවත් වූ, මහා ධනයෙන් යුක්ත වූ, මහා භෝග සම්පත්තියෙන් යුක්ත වූ, බොහෝ රන් රිදී ඇති, බොහෝ වස්තු උපකරණ ඇති, බොහෝ ධන ධාන‍්‍ය ඇති, පිරුණු කෝෂ හා ගබඩා ඇති; බලවත් වූ, අංග සතරකින් යුත් සේනාවෙන් යුක්ත වූ, කීකරුකමින් හා අවවාද පිළිගැනීමෙන් යුක්ත වූ, යසසින් සතුරන් දවන සුළු වූ; ශ‍්‍රද්ධාවන්ත වූ, දායක වූ, දානපති වූ, සමාගාරය විවෘත කොට තබා ඇති, ශ‍්‍රමණයින්ට, බ‍්‍රාහ්මණයින්ට, දුගී දනන්ට, දුක්විඳින්නන්ට, වෙළෙන්දන්ට, යාචකයන්ට පින් කළා වූ, පොදු ප‍ර්යන්ත ජල තටාකයක් බඳු වූ; බහුශ‍්‍රැත වූ, අසන ලද යම් යම් දේවල අ‍ර්ථය, යම් යම් කියමනක අ‍ර්ථය ‘මෙය මේ කියමනේ අ‍ර්ථයයි, මෙය මේ කියමනේ අ‍ර්ථයයි’ යනුවෙන් දන්නා වූ; පණ්ඩිත වූ, ප‍්‍රඥාවන්ත වූ, නුවණැති වූ, අතීත, අනාගත, ව‍ර්තමාන යන අ‍ර්ථයන් මෙනෙහි කිරීමට සමර්ථ වූ කෙනෙක් විය. මහාවිජිත රජතුමා මෙබඳු අංග අටකින් යුක්ත විය. මෙසේ මේ අංග අටද එම යඥයට අනුග‍්‍රහයක් විය.",
      "paliTitle": "Aṭṭha parikkhārā",
      "englishTitle": "The Eight Requisites",
      "sinhalaTitle": "අෂ්ට පිරිකර"
    },
    {
      "number": 341,
      "pali": "‘‘Purohito [purohitopi (ka. sī. ka.)] brāhmaṇo catuhaṅgehi samannāgato. Ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ajjhāyako mantadharo tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; sīlavā vuddhasīlī vuddhasīlena samannāgato; paṇḍito viyatto medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Purohito brāhmaṇo imehi catūhaṅgehi samannāgato. Iti imāni cattāri aṅgāni tasseva yaññassa parikkhārā bhavanti. ",
      "english": "A royal chaplain priest is endowed with four qualities. He is well-born on both sides, from his mother’s and father’s lineages, of pure descent back through seven generations of ancestors, without blemish or reproach concerning his birth; he is a reciter and upholder of sacred texts, master of the three Vedas—together with their Nighaṇḍus and Keṭubhas, with their etymologies and distinctions in letters, and the Itihāsas as the fifth; skilled in parsing and grammar; and faultless in Lokāyata and the marks of a Great Man; he is virtuous, possessing and endowed with highly developed virtue; he is wise, skillful, and intelligent, foremost or second among those who grasp what is well-spoken. The royal chaplain priest is endowed with these four qualities. Thus, these four qualities are indeed the requisites for that sacrifice.",
      "sinhala": "පුරෝහිත බ්‍ර‍ාහ්මණයා අංග හතරකින් සමන්විත වන්නේය. මවගෙන් සහ පියාගෙන් දෙපසින්ම මනාකොට උපන්නා වූ, හත්වන පීතෘ පරම්පරාව දක්වා සංශුද්ධ උපතක් ඇති, ජාතිවාදයෙන් නින්දා නොලත්, දෝෂාරෝපණය නොලත්; අධ්‍යයනය කළ, මන්ත්‍ර ධාරණය කළ, නිඝණ්ඩු සහ කේටුභ සහිත, අක්ෂර ප්‍ර‍භේද සහිත, ඉතිහාසය පස්වැනි කොට ඇති ත්‍‍රිවේදයට පාරගිය, පද කීමෙහි, ව්‍යාකරණෙහි, ලෝකායතයෙහි සහ මහා පුරුෂ ලක්ෂණ විද්‍යාවෙහි නිපුණ වූ; සිල්වත් වූ, වැඩුණු සිල් ඇති, වැඩුණු සීලයෙන් යුක්ත වූ; පණ්ඩිත වූ, ප්‍ර‍ඥාවන්ත වූ, ඥානවන්ත වූ, ශ්‍රද්ධා ඇති පුද්ගලයන් අතර පළමු හෝ දෙවැනි ස්ථානයේ සිටින්නෙක් වන්නේය. පුරෝහිත බ්‍ර‍ාහ්මණයා මේ අංග හතරකින් සමන්විත වන්නේය. මෙසේ මේ අංග හතර ඒ යඥයේම පරිවාර වෙති.",
      "paliTitle": "Catuparikkhāraṃ",
      "englishTitle": "The Four Requisites",
      "sinhalaTitle": "සතර පිරිකර"
    },
    {
      "number": 342,
      "pali": "‘‘Atha kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa pubbeva yaññā tisso vidhā desesi. Siyā kho pana bhoto rañño mahāyaññaṃ yiṭṭhukāmassa [yiṭṭhakāmassa (ka.)] kocideva vippaṭisāro – ‘mahā vata me bhogakkhandho vigacchissatī’ti, so bhotā raññā vippaṭisāro na karaṇīyo. Siyā kho pana bhoto rañño mahāyaññaṃ yajamānassa kocideva vippaṭisāro – ‘mahā vata me bhogakkhandho vigacchatī’ti, so bhotā raññā vippaṭisāro na karaṇīyo. Siyā kho pana bhoto rañño mahāyaññaṃ yiṭṭhassa kocideva vippaṭisāro – ‘mahā vata me bhogakkhandho vigato’ti, so bhotā raññā vippaṭisāro na karaṇīyo’’ti. Imā kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa pubbeva yaññā tisso vidhā desesi. ",
      "english": "Now, O brahmin, the brahmin chaplain taught King Mahāvijita three considerations even before the sacrifice. It might be, O King, that while you are desiring to offer a great sacrifice, some remorse arises, thinking, ‘Alas, a great mass of my wealth will be expended!’ Such remorse should not be entertained by your majesty. It might be, O King, that while you are offering a great sacrifice, some remorse arises, thinking, ‘Alas, a great mass of my wealth is being expended!’ Such remorse should not be entertained by your majesty. It might be, O King, that after you have offered a great sacrifice, some remorse arises, thinking, ‘Alas, a great mass of my wealth has been expended!’ Such remorse should not be entertained by your majesty. These, O brahmin, were the three considerations that the brahmin chaplain taught King Mahāvijita even before the sacrifice.",
      "sinhala": "‘‘එතකොට, බ්‍රාහ්මණය, මහා විජිත රජුගේ පුරෝහිත බ්‍රාහ්මණයා යඥයට පෙරම කරුණු තුනක් පහදා දුන්නේය. ‘‘යම් විටක මහත් යඥයක් කිරීමට කැමති වන ඔබ රජුට ‘අහෝ! මාගේ මහත් ධනස්කන්ධය වැය වේ යැ’යි යම් පසුතැවීමක් ඇතිවිය හැකිය. ඔබ රජු විසින් ඒ පසුතැවීම නොකළ යුතුය. යම් විටක මහත් යඥය කරමින් සිටින ඔබ රජුට ‘අහෝ! මාගේ මහත් ධනස්කන්ධය වැය වෙමින් පවතී යැ’යි යම් පසුතැවීමක් ඇතිවිය හැකිය. ඔබ රජු විසින් ඒ පසුතැවීම නොකළ යුතුය. යම් විටක මහත් යඥය අවසන් කළ ඔබ රජුට ‘අහෝ! මාගේ මහත් ධනස්කන්ධය වැය විය යැ’යි යම් පසුතැවීමක් ඇතිවිය හැකිය. ඔබ රජු විසින් ඒ පසුතැවීම නොකළ යුතුය.’’ බ්‍රාහ්මණය, පුරෝහිත බ්‍රාහ්මණයා මහා විජිත රජුට යඥයට පෙරම මේ කරුණු තුන පහදා දුන්නේය.",
      "paliTitle": "Tisso vidhā",
      "englishTitle": "The Three Kinds",
      "sinhalaTitle": "ත්‍රිවිධ"
    },
    {
      "number": 343,
      "pali": "‘‘Atha kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa pubbeva yaññā dasahākārehi paṭiggāhakesu vippaṭisāraṃ paṭivinesi. ‘Āgamissanti kho bhoto yaññaṃ pāṇātipātinopi pāṇātipātā paṭiviratāpi. Ye tattha pāṇātipātino, tesaññeva tena. Ye tattha pāṇātipātā paṭiviratā, te ārabbha yajataṃ bhavaṃ, sajjataṃ bhavaṃ, modataṃ bhavaṃ, cittameva bhavaṃ antaraṃ pasādetu. Āgamissanti kho bhoto yaññaṃ adinnādāyinopi adinnādānā paṭiviratāpi…pe… kāmesu micchācārinopi kāmesumicchācārā paṭiviratāpi… musāvādinopi musāvādā paṭiviratāpi… pisuṇavācinopi pisuṇāya vācāya paṭiviratāpi… pharusavācinopi pharusāya vācāya paṭiviratāpi… samphappalāpinopi samphappalāpā paṭiviratāpi … abhijjhālunopi anabhijjhālunopi… byāpannacittāpi abyāpannacittāpi… micchādiṭṭhikāpi sammādiṭṭhikāpi…. Ye tattha micchādiṭṭhikā, tesaññeva tena. Ye tattha sammādiṭṭhikā, te ārabbha yajataṃ bhavaṃ, sajjataṃ bhavaṃ, modataṃ bhavaṃ, cittameva bhavaṃ antaraṃ pasādetū’ti. Imehi kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa pubbeva yaññā dasahākārehi paṭiggāhakesu vippaṭisāraṃ paṭivinesi. ",
      "english": "Then, O brahmin, before the sacrifice, the Brahmin royal chaplain of King Mahāvijita removed remorse concerning the recipients in ten ways. ‘Indeed, to your sacrifice will come those who kill living beings and those who abstain from killing living beings. Those among them who kill living beings, for them, that is their own concern. Concerning those among them who abstain from killing living beings, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those who take what is not given and those who abstain from taking what is not given. Those among them who take what is not given, for them, that is their own concern. Concerning those among them who abstain from taking what is not given, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those who commit sexual misconduct and those who abstain from sexual misconduct. Those among them who commit sexual misconduct, for them, that is their own concern. Concerning those among them who abstain from sexual misconduct, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those who speak falsely and those who abstain from false speech. Those among them who speak falsely, for them, that is their own concern. Concerning those among them who abstain from false speech, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those who speak divisively and those who abstain from divisive speech. Those among them who speak divisively, for them, that is their own concern. Concerning those among them who abstain from divisive speech, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those who speak harshly and those who abstain from harsh speech. Those among them who speak harshly, for them, that is their own concern. Concerning those among them who abstain from harsh speech, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those who engage in idle chatter and those who abstain from idle chatter. Those among them who engage in idle chatter, for them, that is their own concern. Concerning those among them who abstain from idle chatter, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those who are covetous and those who are not covetous. Those among them who are covetous, for them, that is their own concern. Concerning those among them who are not covetous, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those with ill-will and those without ill-will. Those among them with ill-will, for them, that is their own concern. Concerning those among them without ill-will, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart. Indeed, to your sacrifice will come those with wrong view and those with right view. Those among them with wrong view, for them, that is their own concern. Concerning those among them with right view, let your honour make the sacrifice, let your honour prepare, let your honour rejoice, let your honour gladden your own heart.’ By these ten ways, O brahmin, before the sacrifice, the Brahmin royal chaplain of King Mahāvijita removed remorse concerning the recipients.",
      "sinhala": "එතකොට බ්‍රාහ්මණ, මහා විජිත රජුගේ පුරෝහිත බ්‍රාහ්මණයා යඥයට පෙරම දස ආකාරයකින් දායකයන් කෙරෙහි තිබූ කනස්සල්ල දුරු කළේය. “තොපගේ යඥයට ප්‍රාණඝාත කරන්නෝද, ප්‍රාණඝාතයෙන් වැළකුණෝද පැමිණෙනු ඇත. එහි සිටින ප්‍රාණඝාත කරන්නන්ගෙන්, එහි වරද ඔවුන්ටම අයිතියි. එහි සිටින ප්‍රාණඝාතයෙන් වැළකුණ අය අරඹයා, තොප යඥ කරන්න, තොප සූදානම් වන්න, තොප සතුටු වන්න, තොපගේ සිත තුළම ප්‍රසාදයක් ඇති කරගන්න. තොපගේ යඥයට අදින්නාදානය කරන අයද, අදින්නාදානයෙන් වැළකුණ අයද; කාමයන්හි වරදවා හැසිරෙන අයද, කාමයන්හි වරදවා හැසිරීමෙන් වැළකුණ අයද; බොරු කියන අයද, බොරුවෙන් වැළකුණ අයද; කේළාම් කියන අයද, කේළාම් කීමෙන් වැළකුණ අයද; ගොරෝසු වචන කියන අයද, ගොරෝසු වචන කීමෙන් වැළකුණ අයද; සම්ප්‍රප්පලාප කියන අයද, සම්ප්‍රප්පලාපයෙන් වැළකුණ අයද; අභිධ්‍යාව ඇති අයද, අභිධ්‍යාව නැති අයද; ව්‍යාපාද සිත් ඇති අයද, ව්‍යාපාද සිත් නැති අයද; මිත්‍යාදෘෂ්ඨික අයද, සම්‍යක්දෘෂ්ඨික අයද පැමිණෙනු ඇත. එහි සිටින මිත්‍යාදෘෂ්ඨික අයගෙන්, එහි වරද ඔවුන්ටම අයිතියි. එහි සිටින සම්‍යක්දෘෂ්ඨික අය අරඹයා, තොප යඥ කරන්න, තොප සූදානම් වන්න, තොප සතුටු වන්න, තොපගේ සිත තුළම ප්‍රසාදයක් ඇති කරගන්න.” බ්‍රාහ්මණ, මහා විජිත රජුගේ පුරෝහිත බ්‍රාහ්මණයා යඥයට පෙරම මේ ආකාරයෙන්ම දස ආකාරයකින් දායකයන් කෙරෙහි තිබූ කනස්සල්ල දුරු කළේය.",
      "paliTitle": "Dasa ākārā",
      "englishTitle": "Ten Modes",
      "sinhalaTitle": "දස ආකාර"
    },
    {
      "number": 344,
      "pali": "‘‘Atha kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa mahāyaññaṃ yajamānassa soḷasahākārehi cittaṃ sandassesi samādapesi samuttejesi sampahaṃsesi siyā kho pana bhoto rañño mahāyaññaṃ yajamānassa kocideva vattā – ‘rājā kho mahāvijito mahāyaññaṃ yajati, no ca kho tassa āmantitā khattiyā ānuyantā negamā ceva jānapadā ca; atha ca pana bhavaṃ rājā evarūpaṃ mahāyaññaṃ yajatī’ti. Evampi bhoto rañño vattā dhammato natthi. Bhotā kho pana raññā āmantitā khattiyā ānuyantā negamā ceva jānapadā ca. Imināpetaṃ bhavaṃ rājā jānātu, yajataṃ bhavaṃ, sajjataṃ bhavaṃ, modataṃ bhavaṃ, cittameva bhavaṃ antaraṃ pasādetu. ‘‘Siyā kho pana bhoto rañño mahāyaññaṃ yajamānassa kocideva vattā – ‘rājā kho mahāvijito mahāyaññaṃ yajati, no ca kho tassa āmantitā amaccā pārisajjā negamā ceva jānapadā ca…pe… brāhmaṇamahāsālā negamā ceva jānapadā ca…pe… gahapatinecayikā negamā ceva jānapadā ca, atha ca pana bhavaṃ rājā evarūpaṃ mahāyaññaṃ yajatī’ti. Evampi bhoto rañño vattā dhammato natthi. Bhotā kho pana raññā āmantitā gahapatinecayikā negamā ceva jānapadā ca. Imināpetaṃ bhavaṃ rājā jānātu, yajataṃ bhavaṃ, sajjataṃ bhavaṃ, modataṃ bhavaṃ, cittameva bhavaṃ antaraṃ pasādetu. ‘‘Siyā kho pana bhoto rañño mahāyaññaṃ yajamānassa kocideva vattā – ‘rājā kho mahāvijito mahāyaññaṃ yajati, no ca kho ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, atha ca pana bhavaṃ rājā evarūpaṃ mahāyaññaṃ yajatī’ti. Evampi bhoto rañño vattā dhammato natthi. Bhavaṃ kho pana rājā ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Imināpetaṃ bhavaṃ rājā jānātu, yajataṃ bhavaṃ, sajjataṃ bhavaṃ, modataṃ bhavaṃ, cittameva bhavaṃ antaraṃ pasādetu. ‘‘Siyā kho pana bhoto rañño mahāyaññaṃ yajamānassa kocideva vattā – ‘rājā kho mahāvijito mahāyaññaṃ yajati no ca kho abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya…pe… no ca kho aḍḍho mahaddhano mahābhogo pahūtajātarūparajato pahūtavittūpakaraṇo pahūtadhanadhañño paripuṇṇakosakoṭṭhāgāro… pe… no ca kho balavā caturaṅginiyā senāya samannāgato assavāya ovādapaṭikarāya sahati maññe paccatthike yasasā…pe… no ca kho saddho dāyako dānapati anāvaṭadvāro samaṇabrāhmaṇakapaṇaddhikavaṇibbakayācakānaṃ opānabhūto puññāni karoti…pe… no ca kho bahussuto tassa tassa sutajātassa…pe… no ca kho tassa tasseva kho pana bhāsitassa atthaṃ jānāti ‘‘ayaṃ imassa bhāsitassa attho, ayaṃ imassa bhāsitassa attho’’ti…pe… no ca kho paṇḍito viyatto medhāvī paṭibalo atītānāgatapaccuppanne atthe cintetuṃ, atha ca pana bhavaṃ rājā evarūpaṃ mahāyaññaṃ yajatī’ti. Evampi bhoto rañño vattā dhammato natthi. Bhavaṃ kho pana rājā paṇḍito viyatto medhāvī paṭibalo atītānāgatapaccuppanne atthe cintetuṃ. Imināpetaṃ bhavaṃ rājā jānātu, yajataṃ bhavaṃ, sajjataṃ bhavaṃ, modataṃ bhavaṃ, cittameva bhavaṃ antaraṃ pasādetu. ‘‘Siyā kho pana bhoto rañño mahāyaññaṃ yajamānassa kocideva vattā – ‘rājā kho mahāvijito mahāyaññaṃ yajati. No ca khvassa purohito brāhmaṇo ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; atha ca pana bhavaṃ rājā evarūpaṃ mahāyaññaṃ yajatī’ti. Evampi bhoto rañño vattā dhammato natthi. Bhoto kho pana rañño purohito brāhmaṇo ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Imināpetaṃ bhavaṃ rājā jānātu, yajataṃ bhavaṃ, sajjataṃ bhavaṃ, modataṃ bhavaṃ, cittameva bhavaṃ antaraṃ pasādetu. ‘‘Siyā kho pana bhoto rañño mahāyaññaṃ yajamānassa kocideva vattā – ‘rājā kho mahāvijito mahāyaññaṃ yajati. No ca khvassa purohito brāhmaṇo ajjhāyako mantadharo tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo…pe… no ca khvassa purohito brāhmaṇo sīlavā vuddhasīlī vuddhasīlena samannāgato…pe… no ca khvassa purohito brāhmaṇo paṇḍito viyatto medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ, atha ca pana bhavaṃ rājā evarūpaṃ mahāyaññaṃ yajatī’ti. Evampi bhoto rañño vattā dhammato natthi. Bhoto kho pana rañño purohito brāhmaṇo paṇḍito viyatto medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imināpetaṃ bhavaṃ rājā jānātu, yajataṃ bhavaṃ, sajjataṃ bhavaṃ, modataṃ bhavaṃ, cittameva bhavaṃ antaraṃ pasādetūti. Imehi kho, brāhmaṇa, purohito brāhmaṇo rañño mahāvijitassa mahāyaññaṃ yajamānassa soḷasahi ākārehi cittaṃ sandassesi samādapesi samuttejesi sampahaṃsesi.",
      "english": "Then, O brahmin, the purohita brahmin encouraged, exhorted, inspired, and gladdened the mind of King Mahāvijita, who was performing the great sacrifice, with sixteen aspects.\n\nPerhaps someone might say to your majesty, King Mahāvijita, who is performing the great sacrifice: ‘King Mahāvijita is performing a great sacrifice, but his invited Kshatriyas, those who followed him from the towns and the countryside, are not present. Yet, your majesty is performing such a great sacrifice.’ Such a criticism against your majesty is not in accordance with the Dhamma. For your majesty has indeed invited the Kshatriyas, those who followed you from the towns and the countryside. By this, your majesty should know, let your majesty sacrifice, let your majesty be prepared, let your majesty rejoice, and let your majesty gladden your own inner mind.\n\nPerhaps someone might say to your majesty, King Mahāvijita, who is performing the great sacrifice: ‘King Mahāvijita is performing a great sacrifice, but his invited ministers and assembly members from the towns and the countryside are not present; nor are his invited great and wealthy brahmins from the towns and the countryside present; nor are his invited householders and substantial families from the towns and the countryside present. Yet, your majesty is performing such a great sacrifice.’ Such a criticism against your majesty is not in accordance with the Dhamma. For your majesty has indeed invited the householders and substantial families from the towns and the countryside. By this, your majesty should know, let your majesty sacrifice, let your majesty be prepared, let your majesty rejoice, and let your majesty gladden your own inner mind.\n\nPerhaps someone might say to your majesty, King Mahāvijita, who is performing the great sacrifice: ‘King Mahāvijita is performing a great sacrifice, but he is not well-born on both sides, from mother and father, of pure lineage back through seven generations of ancestors, not reproached or blameworthy concerning birth. Yet, your majesty is performing such a great sacrifice.’ Such a criticism against your majesty is not in accordance with the Dhamma. For your majesty is indeed well-born on both sides, from mother and father, of pure lineage back through seven generations of ancestors, not reproached or blameworthy concerning birth. By this, your majesty should know, let your majesty sacrifice, let your majesty be prepared, let your majesty rejoice, and let your majesty gladden your own inner mind.\n\nPerhaps someone might say to your majesty, King Mahāvijita, who is performing the great sacrifice: ‘King Mahāvijita is performing a great sacrifice, but he is not handsome, pleasing to the eye, delightful, endowed with supreme beauty of complexion, of divine color and divine radiance, with no mean appearance for viewing; nor is he rich, of great wealth and great possessions, with abundant gold and silver, abundant assets and effects, abundant grain and provisions, with full treasuries and granaries; nor is he mighty, endowed with a fourfold army, obedient and compliant, who, it is thought, repels his enemies with his glory; nor is he faithful, generous, a lord of giving, with an open door, a fount of water for ascetics, brahmins, the poor, the needy, beggars, who performs meritorious deeds; nor is he learned in various kinds of teachings; nor does he understand the meaning of what has been spoken in each case, thinking, “This is the meaning of this statement, this is the meaning of that statement”; nor is he wise, skilled, sagacious, capable of comprehending meanings regarding the past, future, and present. Yet, your majesty is performing such a great sacrifice.’ Such a criticism against your majesty is not in accordance with the Dhamma. For your majesty is indeed wise, skilled, sagacious, and capable of comprehending meanings regarding the past, future, and present. By this, your majesty should know, let your majesty sacrifice, let your majesty be prepared, let your majesty rejoice, and let your majesty gladden your own inner mind.\n\nPerhaps someone might say to your majesty, King Mahāvijita, who is performing the great sacrifice: ‘King Mahāvijita is performing a great sacrifice, but his purohita brahmin is not well-born on both sides, from mother and father, of pure lineage back through seven generations of ancestors, not reproached or blameworthy concerning birth. Yet, your majesty is performing such a great sacrifice.’ Such a criticism against your majesty is not in accordance with the Dhamma. For your majesty’s purohita brahmin is indeed well-born on both sides, from mother and father, of pure lineage back through seven generations of ancestors, not reproached or blameworthy concerning birth. By this, your majesty should know, let your majesty sacrifice, let your majesty be prepared, let your majesty rejoice, and let your majesty gladden your own inner mind.\n\nPerhaps someone might say to your majesty, King Mahāvijita, who is performing the great sacrifice: ‘King Mahāvijita is performing a great sacrifice, but his purohita brahmin is not a reciter, a master of the mantras, one who has gone to the further shore of the three Vedas, with their vocabularies and rituals, phonology and etymology, and as fifth the Itihāsas, skilled in prosody and grammar, proficient in Lokāyata (philosophy) and the marks of a great man; nor is his purohita brahmin virtuous, one of established virtue, endowed with established virtue; nor is his purohita brahmin wise, skilled, sagacious, either the first or the second among those who hold the ladle. Yet, your majesty is performing such a great sacrifice.’ Such a criticism against your majesty is not in accordance with the Dhamma. For your majesty’s purohita brahmin is indeed wise, skilled, sagacious, either the first or the second among those who hold the ladle. By this, your majesty should know, let your majesty sacrifice, let your majesty be prepared, let your majesty rejoice, and let your majesty gladden your own inner mind.\n\nIt was with these sixteen aspects, O brahmin, that the purohita brahmin encouraged, exhorted, inspired, and gladdened the mind of King Mahāvijita, who was performing the great sacrifice.",
      "sinhala": "එවිට, බ්‍රාහ්මණ, මහා විජිත රජු මහා යාගයක් පවත්වන කල්හි, පුරෝහිත බ්‍රාහ්මණයා කාරණා දහසයකින් රජුගේ සිත උනන්දු කරවීය, සමාදන් කරවීය, ප්‍රබෝධවත් කරවීය, ප්‍රීතිමත් කරවීය. කෙසේ වෙතත්, ඔබ වහන්සේ මහා යාගයක් පවත්වන කල්හි, යමෙක් මෙසේ කියන්නට පුළුවන: ‘මහා විජිත රජු මහා යාගයක් පවත්වයි, එහෙත් ඔහු විසින් ආරාධනා කරන ලද ක්ෂත්‍රියෝද, නගර වැසියෝද, ජනපද වැසියෝද ඔහු සමඟ එක්ව නැත; එසේ තිබියදීත් ඔබ වහන්සේ මෙබඳු මහා යාගයක් පවත්වයි’ කියා. එසේ වුවද, ඔබ වහන්සේට එසේ කියන්නට ධර්මානුකූලව හේතුවක් නැත. ඔබ වහන්සේ විසින් ක්ෂත්‍රියෝද, නගර වැසියෝද, ජනපද වැසියෝද ආරාධනා කරනු ලැබ ඔබ වහන්සේ සමඟ එක්ව සිටිති. ඔබ වහන්සේ මේ කාරණයෙන්ද එය දැනගන්න. ඔබ වහන්සේ යාගය පවත්වන්න, සූදානම් වන්න, ප්‍රීති වන්න, ඔබ වහන්සේගේ සිත අභ්‍යන්තරයෙන්ම ප්‍රසන්න කරගන්න.\n\nකෙසේ වෙතත්, ඔබ වහන්සේ මහා යාගයක් පවත්වන කල්හි, යමෙක් මෙසේ කියන්නට පුළුවන: ‘මහා විජිත රජු මහා යාගයක් පවත්වයි, එහෙත් ඔහු විසින් අමාත්‍යයෝද, පිරිසට අයත් ජනතාවද, නගර වැසියෝද, ජනපද වැසියෝද ආරාධනා කරනු ලැබ නැත; මහසල් බ්‍රාහ්මණයෝද, නගර වැසියෝද, ජනපද වැසියෝද ආරාධනා කරනු ලැබ නැත; ගෘහපති සිටුවරුද, නගර වැසියෝද, ජනපද වැසියෝද ආරාධනා කරනු ලැබ නැත; එසේ තිබියදීත් ඔබ වහන්සේ මෙබඳු මහා යාගයක් පවත්වයි’ කියා. එසේ වුවද, ඔබ වහන්සේට එසේ කියන්නට ධර්මානුකූලව හේතුවක් නැත. ඔබ වහන්සේ විසින් ගෘහපති සිටුවරුද, නගර වැසියෝද, ජනපද වැසියෝද ආරාධනා කරනු ලැබ ඔබ වහන්සේ සමඟ එක්ව සිටිති. ඔබ වහන්සේ මේ කාරණයෙන්ද එය දැනගන්න. ඔබ වහන්සේ යාගය පවත්වන්න, සූදානම් වන්න, ප්‍රීති වන්න, ඔබ වහන්සේගේ සිත අභ්‍යන්තරයෙන්ම ප්‍රසන්න කරගන්න.\n\nකෙසේ වෙතත්, ඔබ වහන්සේ මහා යාගයක් පවත්වන කල්හි, යමෙක් මෙසේ කියන්නට පුළුවන: ‘මහා විජිත රජු මහා යාගයක් පවත්වයි, එහෙත් ඔහු මවගෙන් සහ පියාගෙන් යන දෙපසින්ම මනා කොට උපන්, සත් පරම්පරාවක් දක්වා පවිත්‍ර වූ සම්භවයක් ඇති, ජාතිවාදයෙන් නින්දාවට හෝ ගැරහීමට ලක් නොවූ අයෙක් නොවේ; එසේ තිබියදීත් ඔබ වහන්සේ මෙබඳු මහා යාගයක් පවත්වයි’ කියා. එසේ වුවද, ඔබ වහන්සේට එසේ කියන්නට ධර්මානුකූලව හේතුවක් නැත. ඔබ වහන්සේ මවගෙන් සහ පියාගෙන් යන දෙපසින්ම මනා කොට උපන්, සත් පරම්පරාවක් දක්වා පවිත්‍ර වූ සම්භවයක් ඇති, ජාතිවාදයෙන් නින්දාවට හෝ ගැරහීමට ලක් නොවූ අයෙකි. ඔබ වහන්සේ මේ කාරණයෙන්ද එය දැනගන්න. ඔබ වහන්සේ යාගය පවත්වන්න, සූදානම් වන්න, ප්‍රීති වන්න, ඔබ වහන්සේගේ සිත අභ්‍යන්තරයෙන්ම ප්‍රසන්න කරගන්න.\n\nකෙසේ වෙතත්, ඔබ වහන්සේ මහා යාගයක් පවත්වන කල්හි, යමෙක් මෙසේ කියන්නට පුළුවන: ‘මහා විජිත රජු මහා යාගයක් පවත්වයි, එහෙත් ඔහු අභිරූපී, දැකුම්කළු, ප්‍රසන්න, අතිශයින්ම උසස් ශරීර වර්ණයකින් යුත්, බ්‍රහ්ම වර්ණයක් ඇති, බ්‍රහ්ම තේජසින් බබළන, දැකීමට අපහසු නොවන අයෙක් නොවේ; ඔහු පොහොසත්, මහත් ධන සම්පත් ඇති, මහත් භෝග සම්පත් ඇති, බොහෝ රන් රිදී ඇති, බොහෝ වස්තු උපකරණ ඇති, බොහෝ ධන ධාන්‍ය ඇති, සම්පූර්ණ වූ කෝෂාගාර සහ ගබඩා ඇති අයෙක් නොවේ; ඔහු බලවත්, සතරංගනී සේනාවෙන් යුත්, අණට කීකරු, අනුශාසනා පිළිගන්නා, යසසින් සතුරන් පරාජය කළ හැකි අයෙක් නොවේ; ඔහු ශ්‍රද්ධාවන්ත, දායක, දානපති, දොරටු විවෘත කොට තැබූ, ශ්‍රමණයන්ට, බ්‍රාහ්මණයන්ට, දුගීන්ට, දිළින්දන්ට, වෙළෙන්දන්ට, යාචකයන්ට ජල පොකුණක් බඳු වූ, පින්කම් කරන අයෙක් නොවේ; ඔහු බොහෝ ඇසූ පිරූ තැන් ඇති, ඒ ඒ ඇසූ දේ පිළිබඳ දැනුමැත්තෙක් නොවේ; ඔහු ඒ ඒ කතා කරන ලද දෙයෙහි අර්ථය ‘මෙය මේ කතා කරන ලද දෙයෙහි අර්ථයයි, මෙය මේ කතා කරන ලද දෙයෙහි අර්ථයයි’ කියා දන්නා අයෙක් නොවේ; ඔහු පණ්ඩිත, විශාරද, ප්‍රඥාවන්ත, අතීත, අනාගත, වර්තමාන අර්ථයන් සිතීමට සමත් අයෙක් නොවේ; එසේ තිබියදීත් ඔබ වහන්සේ මෙබඳු මහා යාගයක් පවත්වයි’ කියා. එසේ වුවද, ඔබ වහන්සේට එසේ කියන්නට ධර්මානුකූලව හේතුවක් නැත. ඔබ වහන්සේ පණ්ඩිත, විශාරද, ප්‍රඥාවන්ත, අතීත, අනාගත, වර්තමාන අර්ථයන් සිතීමට සමත් අයෙකි. ඔබ වහන්සේ මේ කාරණයෙන්ද එය දැනගන්න. ඔබ වහන්සේ යාගය පවත්වන්න, සූදානම් වන්න, ප්‍රීති වන්න, ඔබ වහන්සේගේ සිත අභ්‍යන්තරයෙන්ම ප්‍රසන්න කරගන්න.\n\nකෙසේ වෙතත්, ඔබ වහන්සේ මහා යාගයක් පවත්වන කල්හි, යමෙක් මෙසේ කියන්නට පුළුවන: ‘මහා විජිත රජු මහා යාගයක් පවත්වයි, එහෙත් ඔහුගේ පුරෝහිත බ්‍රාහ්මණයා මවගෙන් සහ පියාගෙන් යන දෙපසින්ම මනා කොට උපන්, සත් පරම්පරාවක් දක්වා පවිත්‍ර වූ සම්භවයක් ඇති, ජාතිවාදයෙන් නින්දාවට හෝ ගැරහීමට ලක් නොවූ අයෙක් නොවේ; එසේ තිබියදීත් ඔබ වහන්සේ මෙබඳු මහා යාගයක් පවත්වයි’ කියා. එසේ වුවද, ඔබ වහන්සේට එසේ කියන්නට ධර්මානුකූලව හේතුවක් නැත. ඔබ වහන්සේගේ පුරෝහිත බ්‍රාහ්මණයා මවගෙන් සහ පියාගෙන් යන දෙපසින්ම මනා කොට උපන්, සත් පරම්පරාවක් දක්වා පවිත්‍ර වූ සම්භවයක් ඇති, ජාතිවාදයෙන් නින්දාවට හෝ ගැරහීමට ලක් නොවූ අයෙකි. ඔබ වහන්සේ මේ කාරණයෙන්ද එය දැනගන්න. ඔබ වහන්සේ යාගය පවත්වන්න, සූදානම් වන්න, ප්‍රීති වන්න, ඔබ වහන්සේගේ සිත අභ්‍යන්තරයෙන්ම ප්‍රසන්න කරගන්න.\n\nකෙසේ වෙතත්, ඔබ වහන්සේ මහා යාගයක් පවත්වන කල්හි, යමෙක් මෙසේ කියන්නට පුළුවන: ‘මහා විජිත රජු මහා යාගයක් පවත්වයි, එහෙත් ඔහුගේ පුරෝහිත බ්‍රාහ්මණයා අධ්‍යාපනය ලැබූ, මන්ත්‍රධාරී, නිඝණ්ඩු, කේටුභාදී වූ අංගයන් සහිත වූද, අක්ෂර ප්‍රභේදයන් සහිත වූද, ඉතිහාසය පස්වැනියට ඇති වූද, තෙවදෑරුම් වේදයන්හි පාරගත වූ, පදරුත් විවරණය කරන, ව්‍යාකරණ දන්නා, ලෝකායත දර්ශනයෙහි හා මහා පුරුෂ ලක්ෂණයන්හි දොස් නැති අයෙක් නොවේ; ඔහු සිල්වත්, වැඩි දියුණු කළ සීලයෙන් යුත්, වැඩි දියුණු කළ සීලයෙන් සමන්විත අයෙක් නොවේ; ඔහු පණ්ඩිත, විශාරද, ප්‍රඥාවන්ත, දක්ෂයන් අතර පළමු හෝ දෙවැනි තැනට පත් වූ අයෙක් නොවේ; එසේ තිබියදීත් ඔබ වහන්සේ මෙබඳු මහා යාගයක් පවත්වයි’ කියා. එසේ වුවද, ඔබ වහන්සේට එසේ කියන්නට ධර්මානුකූලව හේතුවක් නැත. ඔබ වහන්සේගේ පුරෝහිත බ්‍රාහ්මණයා පණ්ඩිත, විශාරද, ප්‍රඥාවන්ත, දක්ෂයන් අතර පළමු හෝ දෙවැනි තැනට පත් වූ අයෙකි. ඔබ වහන්සේ මේ කාරණයෙන්ද එය දැනගන්න. ඔබ වහන්සේ යාගය පවත්වන්න, සූදානම් වන්න, ප්‍රීති වන්න, ඔබ වහන්සේගේ සිත අභ්‍යන්තරයෙන්ම ප්‍රසන්න කරගන්න.\n\nබ්‍රාහ්මණ, මෙසේ පුරෝහිත බ්‍රාහ්මණයා මහා විජිත රජු මහා යාගයක් පවත්වන කල්හි, මේ කාරණා දහසයකින් රජුගේ සිත උනන්දු කරවීය, සමාදන් කරවීය, ප්‍රබෝධවත් කරවීය, ප්‍රීතිමත් කරවීය.",
      "paliTitle": "Soḷasa ākārā",
      "englishTitle": "The Sixteen Aspects",
      "sinhalaTitle": "සොළොස් ආකාර"
    },
    {
      "number": 345,
      "pali": "‘‘Tasmiṃ kho, brāhmaṇa, yaññe neva gāvo haññiṃsu, na ajeḷakā haññiṃsu, na kukkuṭasūkarā haññiṃsu, na vividhā pāṇā saṃghātaṃ āpajjiṃsu, na rukkhā chijjiṃsu yūpatthāya, na dabbhā lūyiṃsu barihisatthāya [parihiṃsatthāya (syā. ka. sī. ka.), parahiṃsatthāya (ka.)]. Yepissa ahesuṃ dāsāti vā pessāti vā kammakarāti vā, tepi na daṇḍatajjitā na bhayatajjitā na assumukhā rudamānā parikammāni akaṃsu. Atha kho ye icchiṃsu, te akaṃsu, ye na icchiṃsu, na te akaṃsu; yaṃ icchiṃsu, taṃ akaṃsu, yaṃ na icchiṃsu, na taṃ akaṃsu. Sappitelanavanītadadhimadhuphāṇitena ceva so yañño niṭṭhānamagamāsi.",
      "english": "Indeed, O brahmin, in that sacrifice, neither were cows slain, nor goats and sheep, nor chickens and pigs. No diverse living beings suffered slaughter, nor were trees cut down for sacrificial posts, nor were Kusa grasses plucked for strewing. And whoever were there, whether as slaves, servants, or workers, they did not perform their tasks, compelled by clubs, or by fear, or with tearful, weeping faces. Rather, those who wished, they performed them; those who did not wish, they did not perform them. What they wished, that they performed; what they did not wish, that they did not perform. And that sacrifice was concluded with ghee, oil, fresh butter, curds, honey, and jaggery.",
      "sinhala": "බමුණ, ඒ යාගයේදී ගවයෝ ද නොමරනු ලැබූහ, එළුවෝ හා බැටළුවෝ ද නොමරනු ලැබූහ, කුකුළෝ හා ඌරෝ ද නොමරනු ලැබූහ, නොයෙක් ප‍්‍රාණීහු ඝාතනයට පත් නොවූහ, යූප කණු පිණිස ගස් ද නොකපන ලදී, බරිහිස් පිණිස දබ්බ තණ ද නොලුහුණි. ඔහුගේ යම් දාසයෝ ද, සේවකයෝ ද, කම්කරුවෝ ද සිටියෝ නම්, ඔවුහු ද දඬු මුගුරුවලින් තර්ජනයට පත් නොවී, බියෙන් තර්ජනයට පත් නොවී, කඳුළු සලමින් හඬමින් යාග කටයුතු නොකළහ. එහෙත් යම් කෙනෙක් කැමති වූවෝ ද, ඔවුහු කළහ; යම් කෙනෙක් අකමැති වූවෝ ද, ඔවුහු නොකළහ; යමක් කැමති වූවෝ ද, එය කළහ; යමක් අකමැති වූවෝ ද, එය නොකළහ. ඒ යාගය ගිතෙල්, තෙල්, අලුත් බටර්, දීකිරි, මී පැණි සහ උක් පැණි යන දේවලින් ම නිමාවට පත් විය.",
      "paliTitle": ""
    },
    {
      "number": 346,
      "pali": "‘‘Atha kho, brāhmaṇa, khattiyā ānuyantā negamā ceva jānapadā ca, amaccā pārisajjā negamā ceva jānapadā ca, brāhmaṇamahāsālā negamā ceva jānapadā ca, gahapatinecayikā negamā ceva jānapadā ca pahūtaṃ sāpateyyaṃ ādāya rājānaṃ mahāvijitaṃ upasaṅkamitvā evamāhaṃsu – ‘idaṃ, deva, pahūtaṃ sāpateyyaṃ devaññeva uddissābhataṃ, taṃ devo paṭiggaṇhātū’ti. ‘Alaṃ, bho, mamāpidaṃ pahūtaṃ sāpateyyaṃ dhammikena balinā abhisaṅkhataṃ; tañca vo hotu, ito ca bhiyyo harathā’ti. Te raññā paṭikkhittā ekamantaṃ apakkamma evaṃ samacintesuṃ – ‘na kho etaṃ amhākaṃ patirūpaṃ, yaṃ mayaṃ imāni sāpateyyāni punadeva sakāni gharāni paṭihareyyāma. Rājā kho mahāvijito mahāyaññaṃ yajati, handassa mayaṃ anuyāgino homā’ti.",
      "english": "Then, O brahmin, nobles and their attendants from both town and country, ministers and councillors from both town and country, great wealthy brahmins from both town and country, and wealthy householders from both town and country, taking abundant wealth, approached King Mahāvijita and said this: ‘This, Your Majesty, is abundant wealth brought specifically for Your Majesty; may Your Majesty accept it.’\n\n‘Enough, good sirs,’ replied the king, ‘I too have abundant wealth amassed through righteous power. Let that (which you brought) be yours, and take even more for yourselves.’\n\nRejected by the king, they withdrew to one side and reflected thus: ‘Indeed, it is not fitting for us to take these riches back to our own homes. King Mahāvijita is performing a great sacrifice; come now, let us become participants in his sacrifice.’",
      "sinhala": "එසමයෙහි, බ්‍රාහ්මණ, නගරවාසී වූ ද ජනපදවාසී වූ ද ක්ෂත‍්‍රීය අනුයුක්තයෝ ද, නගරවාසී වූ ද ජනපදවාසී වූ ද ඇමති පිරිස් ද, නගරවාසී වූ ද ජනපදවාසී වූ ද මහාසල් බ‍්‍රාහ්මණයෝ ද, නගරවාසී වූ ද ජනපදවාසී වූ ද මහා ධනවත් ගෘහපතියෝ ද බොහෝ සම්පත් රැගෙන මහා විජිත නම් රජු වෙත එළඹ මෙසේ කීහ: 'දේවයන් වහන්ස, මේ බොහෝ සම්පත් ඔබ දේවයන් වහන්සේ උදෙසාම ගෙන එන ලද්දකි. එය දේවයන් වහන්සේ පිළිගන්නා සේක්වා!'\n\n'ඇවැත්නි, ඇති. මට ද මේ බොහෝ සම්පත් ධර‍්මානුකූල බලයෙන් රැස්කරන ලද්දකි. ඒ සම්පත් ඔබටම වේවා, තව ද මෙයට වඩා රැගෙන යවූ!'\n\nඔවුහු රජු විසින් ප‍්‍රතික්ෂේප කරනු ලැබ, එක් පසෙකට වී මෙසේ කල්පනා කළහ: 'මේ සම්පත් නැවතත් අපගේ නිවෙස්වලටම ගෙන යාම අපට නොගැළපෙයි. මහා විජිත රජු මහා යඥයක් පවත්වයි. එසේ නම්, අපි ඔහුට අනුයාගිකයෝ වෙමු!'",
      "paliTitle": ""
    },
    {
      "number": 347,
      "pali": "‘‘Atha kho, brāhmaṇa, puratthimena yaññavāṭassa [yaññāvāṭassa (sī. pī. ka.)] khattiyā ānuyantā negamā ceva jānapadā ca dānāni paṭṭhapesuṃ. Dakkhiṇena yaññavāṭassa amaccā pārisajjā negamā ceva jānapadā ca dānāni paṭṭhapesuṃ. Pacchimena yaññavāṭassa brāhmaṇamahāsālā negamā ceva jānapadā ca dānāni paṭṭhapesuṃ. Uttarena yaññavāṭassa gahapatinecayikā negamā ceva jānapadā ca dānāni paṭṭhapesuṃ. ‘‘Tesupi kho, brāhmaṇa, yaññesu neva gāvo haññiṃsu, na ajeḷakā haññiṃsu, na kukkuṭasūkarā haññiṃsu, na vividhā pāṇā saṃghātaṃ āpajjiṃsu, na rukkhā chijjiṃsu yūpatthāya, na dabbhā lūyiṃsu barihisatthāya. Yepi nesaṃ ahesuṃ dāsāti vā pessāti vā kammakarāti vā, tepi na daṇḍatajjitā na bhayatajjitā na assumukhā rudamānā parikammāni akaṃsu. Atha kho ye icchiṃsu, te akaṃsu, ye na icchiṃsu, na te akaṃsu; yaṃ icchiṃsu, taṃ akaṃsu, yaṃ na icchiṃsu na taṃ akaṃsu. Sappitelanavanītadadhimadhuphāṇitena ceva te yaññā niṭṭhānamagamaṃsu. ‘‘Iti cattāro ca anumatipakkhā, rājā mahāvijito aṭṭhahaṅgehi samannāgato, purohito brāhmaṇo catūhaṅgehi samannāgato; tisso ca vidhā ayaṃ vuccati brāhmaṇa tividhā yaññasampadā soḷasaparikkhārā’’ti.",
      "english": "Then, brahmin, to the east of the sacrificial ground, nobles along with their followers, citizens, and countryfolk presented gifts. To the south of the sacrificial ground, ministers and councillors, along with citizens and countryfolk, presented gifts. To the west of the sacrificial ground, great wealthy brahmins, along with citizens and countryfolk, presented gifts. To the north of the sacrificial ground, wealthy householders, along with citizens and countryfolk, presented gifts.\n\nIndeed, brahmin, in those sacrifices, neither were cattle slain, nor goats and sheep slain, nor chickens and pigs slain, nor were various living beings brought to destruction. Nor were trees cut down for sacrificial posts, nor were grasses mown for sacred grass. And whoever among them were slaves, or servants, or laborers, they did not perform tasks under threat of punishment, nor under threat of fear, nor with tear-stained faces, weeping. Instead, those who wished, performed; those who did not wish, did not perform. What they wished, they performed; what they did not wish, they did not perform. Those sacrifices were concluded with ghee, oil, fresh butter, curds, honey, and jaggery.\n\nThus, brahmin, with these four groups of approvers, King Mahāvijita endowed with eight qualities, and the brahmin chaplain endowed with four qualities, these three kinds constitute what is called the threefold successful sacrifice with sixteen requisites.",
      "sinhala": "එහෙයින් බ්‍රාහ්මණය, යාග භූමියේ නැගෙනහිර දිශාවෙන් ක්ෂත්‍රිය අනුප්‍රාප්තිකයෝ ද, නගර වැසියෝ ද, ජනපද වැසියෝ ද දන් පිරිනැමූහ. යාග භූමියේ දකුණු දිශාවෙන් ඇමැතිවරු, පිරිස් නායකයෝ, නගර වැසියෝ සහ ජනපද වැසියෝ ද දන් පිරිනැමූහ. යාග භූමියේ බටහිර දිශාවෙන් මහසල් බ්‍රාහ්මණයෝ ද, නගර වැසියෝ ද, ජනපද වැසියෝ ද දන් පිරිනැමූහ. යාග භූමියේ උතුරු දිශාවෙන් ධනවත් ගෘහපතියෝ ද, නගර වැසියෝ ද, ජනපද වැසියෝ ද දන් පිරිනැමූහ.\n\nබ්‍රාහ්මණය, ඒ යාගයන්හි ගවයෝ නොමැරූහ, එළු-බැටළුවෝ නොමැරූහ, කුකුළෝ-ඌරෝ නොමැරූහ, නොයෙක් ප‍්‍රාණීහු විනාශයට පත් නොවූහ, යූපයන් (පූජා කණු) සඳහා ගස් නොකැපූහ, ආසන සඳහා දබ්බ තණ නොකැපූහ. ඔවුන්ට යම් දාසයෝ ද, පේවකයෝ ද, කම්කරුවෝ ද සිටියෝ ද, ඔවුහු ද දඬුවමෙන් තර්ජනය කරනු ලැබූවෝ නොවූහ, බියෙන් තර්ජනය කරනු ලැබූවෝ නොවූහ, කඳුළු පිරුණු මුහුණින් හඬමින් පිරිසිදු කිරීම් නොකළහ. යම් කෙනෙක් කැමැති වූවාහු ද, ඔවුහු කළහ; යම් කෙනෙක් කැමැති නොවූවාහු ද, ඔවුහු නොකළහ; යමක් කැමැති වූවාහු ද, එය කළහ; යමක් කැමැති නොවූවාහු ද, එය නොකළහ. ගිතෙල්, තෙල්, අලුත් බටර්, දීකිරි, මීපැණි සහ උක්කුරු යන මේවායින් ම ඒ යාග නිමාවට පත් වූහ.\n\n\"මෙසේ අනුමත පක්ෂ සතරක් ද, අංග අටකින් සමන්විත මහාවිජිත රජු ද, අංග සතරකින් සමන්විත පුරෝහිත බ්‍රාහ්මණයා ද, විධි තුනක් ද - බ්‍රාහ්මණය, මෙය ත‍්‍රිවිධ යාග සම්පත්තිය ලෙස දහසය පරිස්කාර (අංග) සහිත යැයි කියනු ලැබේ.\"",
      "paliTitle": ""
    },
    {
      "number": 348,
      "pali": "Evaṃ vutte, te brāhmaṇā unnādino uccāsaddamahāsaddā ahesuṃ – ‘‘aho yañño, aho yaññasampadā’’ti! Kūṭadanto pana brāhmaṇo tūṇhībhūtova nisinno hoti. Atha kho te brāhmaṇā kūṭadantaṃ brāhmaṇaṃ etadavocuṃ – ‘‘kasmā pana bhavaṃ kūṭadanto samaṇassa gotamassa subhāsitaṃ subhāsitato nābbhanumodatī’’ti? ‘‘Nāhaṃ, bho, samaṇassa gotamassa subhāsitaṃ subhāsitato nābbhanumodāmi. Muddhāpi tassa vipateyya, yo samaṇassa gotamassa subhāsitaṃ subhāsitato nābbhanumodeyya. Api ca me, bho, evaṃ hoti – samaṇo gotamo na evamāha – ‘evaṃ me suta’nti vā ‘evaṃ arahati bhavitu’nti vā; api ca samaṇo gotamo – ‘evaṃ tadā āsi, itthaṃ tadā āsi’ tveva bhāsati. Tassa mayhaṃ bho evaṃ hoti – ‘addhā samaṇo gotamo tena samayena rājā vā ahosi mahāvijito yaññassāmi purohito vā brāhmaṇo tassa yaññassa yājetā’ti. Abhijānāti pana bhavaṃ gotamo evarūpaṃ yaññaṃ yajitvā vā yājetvā vā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjitāti’’? ‘‘Abhijānāmahaṃ, brāhmaṇa, evarūpaṃ yaññaṃ yajitvā vā yājetvā vā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjitā, ahaṃ tena samayena purohito brāhmaṇo ahosiṃ tassa yaññassa yājetā’’ti. ",
      "english": "When this was said, those brahmins became boisterous, making a loud, great noise, exclaiming, \"Oh, the sacrifice! Oh, the perfection of the sacrifice!\" But the brahmin Kūṭadanta remained seated in silence. Then those brahmins said to the brahmin Kūṭadanta, \"Why, revered Kūṭadanta, do you not approve of the good speech of the recluse Gotama as good speech?\" \"Sirs, I do not disapprove of the good speech of the recluse Gotama as good speech. His head would split open who would disapprove of the good speech of the recluse Gotama as good speech. But it occurs to me, sirs, that the recluse Gotama does not say, 'Thus I have heard,' or 'Thus it ought to be.' Instead, the recluse Gotama speaks only of 'Thus it was then, it was like this then.' Therefore, it occurs to me, sirs, that surely the recluse Gotama was at that time either a great conquering king, the lord of the sacrifice, or a brahmin purohita, the offerer of that sacrifice. Does the revered Gotama truly know that, having performed such a sacrifice or having caused it to be performed, one is reborn, upon the breaking up of the body, after death, into a good destination, a heavenly world?\"\n\n\"I do know, brahmin, that having performed such a sacrifice or having caused it to be performed, one is reborn, upon the breaking up of the body, after death, into a good destination, a heavenly world. I myself was at that time the brahmin purohita, the offerer of that sacrifice.\"",
      "sinhala": "මෙසේ පැවසූ කල්හි ඒ බ්‍රාහ්මණයෝ \"අහෝ, යාගය, අහෝ, යාගයේ උතුම් බව!\" යැයි මහත් හඬින් ඝෝෂා කළහ. එහෙත් කූටදන්ත බ්‍රාහ්මණයා නිහඬවම වාඩි වී සිටියේය. එවිට ඒ බ්‍රාහ්මණයෝ කූටදන්ත බ්‍රාහ්මණයා අමතා, \"ඇයි භවත් කූටදන්ත, ඔබ ශ්‍රමණ ගෞතමයන්ගේ සුභාෂිතය, සුභාෂිතයක් ලෙස අනුමත නොකරන්නේ?\" යැයි කීහ.\n\n\"භවත්නි, මම ශ්‍රමණ ගෞතමයන්ගේ සුභාෂිතය සුභාෂිතයක් ලෙස අනුමත නොකරන්නේ නොවේ. ශ්‍රමණ ගෞතමයන්ගේ සුභාෂිතය සුභාෂිතයක් ලෙස අනුමත නොකරන යමෙකුගේ හිස පවා පැළී යන්නේය. එහෙත් භවත්නි, මට මෙසේ සිතේ: ශ්‍රමණ ගෞතමයන් 'මට මෙසේ අසන්නට ලැබුණි' යැයි හෝ 'මෙය මෙසේ විය යුතුයි' යැයි හෝ නොකියති; එහෙත් ශ්‍රමණ ගෞතමයන් 'එවිට මෙසේ විය, එසේ විය' යැයිම පවසති. එබැවින් භවත්නි, මට මෙසේ සිතේ: 'සැබවින්ම ශ්‍රමණ ගෞතමයන් ඒ සමයෙහි මහා විජිත නම් රජු හෝ, යාගයට අධිපති වූ පුරෝහිත බ්‍රාහ්මණයා හෝ, ඒ යාගය කරවූ තැනැත්තා හෝ විය.' භවත් ගෞතමයන් මෙවැනි යාගයක් තමා විසින් කරවා හෝ අනුන් ලවා කරවා හෝ, ශරීරය බිඳී මරණයෙන් පසු සුගතිය වූ ස්වර්ග ලෝකයේ උපන් බව දන්නවාද?\"\n\n\"බ්‍රාහ්මණය, මෙවැනි යාගයක් තමා විසින් කරවා හෝ අනුන් ලවා කරවා හෝ, ශරීරය බිඳී මරණයෙන් පසු සුගතිය වූ ස්වර්ග ලෝකයේ උපන් බව මම දනිමි. මම ඒ සමයෙහි පුරෝහිත බ්‍රාහ්මණයා වීමි; ඒ යාගය කරවූ තැනැත්තා වීමි.\"",
      "paliTitle": ""
    },
    {
      "number": 349,
      "pali": "‘‘Atthi pana, bho gotama, añño yañño imāya tividhāya yaññasampadāya [tividhayaññasampadāya (ka.)] soḷasaparikkhārāya appaṭṭhataro [appatthataro (syā. kaṃ.)] ca appasamārambhataro [appasamārabbhataro (sī. pī. ka.)] ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Atthi kho, brāhmaṇa, añño yañño imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti. ‘‘Katamo pana so, bho gotama, yañño imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Yāni kho pana tāni, brāhmaṇa, niccadānāni anukulayaññāni sīlavante pabbajite uddissa diyyanti; ayaṃ kho, brāhmaṇa, yañño imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti. ‘‘Ko nu kho, bho gotama, hetu ko paccayo, yena taṃ niccadānaṃ anukulayaññaṃ imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhatarañca appasamārambhatarañca mahapphalatarañca mahānisaṃsatarañcā’’ti? ‘‘Na kho, brāhmaṇa, evarūpaṃ yaññaṃ upasaṅkamanti arahanto vā arahattamaggaṃ vā samāpannā. Taṃ kissa hetu? Dissanti hettha, brāhmaṇa, daṇḍappahārāpi galaggahāpi, tasmā evarūpaṃ yaññaṃ na upasaṅkamanti arahanto vā arahattamaggaṃ vā samāpannā. Yāni kho pana tāni, brāhmaṇa, niccadānāni anukulayaññāni sīlavante pabbajite uddissa diyyanti; evarūpaṃ kho, brāhmaṇa, yaññaṃ upasaṅkamanti arahanto vā arahattamaggaṃ vā samāpannā. Taṃ kissa hetu? Na hettha, brāhmaṇa, dissanti daṇḍappahārāpi galaggahāpi, tasmā evarūpaṃ yaññaṃ upasaṅkamanti arahanto vā arahattamaggaṃ vā samāpannā. Ayaṃ kho, brāhmaṇa, hetu ayaṃ paccayo, yena taṃ niccadānaṃ anukulayaññaṃ imāya tividhāya yaññasampadāya soḷasaparikkhārāya appaṭṭhatarañca appasamārambhatarañca mahapphalatarañca mahānisaṃsatarañcā’’ti.",
      "english": "“Is there, Venerable Gotama, another sacrifice which, compared to this sacrifice complete in three ways and with sixteen requisites, is less troublesome, involves less effort, and is of greater fruit and greater benefit?” “Indeed, brahmin, there is another sacrifice which, compared to this sacrifice complete in three ways and with sixteen requisites, is less troublesome, involves less effort, and is of greater fruit and greater benefit.” “But what, Venerable Gotama, is that sacrifice which, compared to this sacrifice complete in three ways and with sixteen requisites, is less troublesome, involves less effort, and is of greater fruit and greater benefit?” “Those regular gifts and favorable offerings, brahmin, that are given specifically to virtuous renunciants; this, brahmin, is a sacrifice which, compared to this sacrifice complete in three ways and with sixteen requisites, is less troublesome, involves less effort, and is of greater fruit and greater benefit.” “What, Venerable Gotama, is the reason, what is the cause, by which those regular gifts and favorable offerings are, compared to this sacrifice complete in three ways and with sixteen requisites, less troublesome, involve less effort, and are of greater fruit and greater benefit?” “Indeed, brahmin, Arahants or those who have entered the path to Arahantship do not approach such a sacrifice. For what reason? Herein, brahmin, blows with sticks and seizing by the throat are seen. Therefore, Arahants or those who have entered the path to Arahantship do not approach such a sacrifice. But those regular gifts and favorable offerings, brahmin, that are given specifically to virtuous renunciants; such a sacrifice, brahmin, Arahants or those who have entered the path to Arahantship do approach. For what reason? Herein, brahmin, blows with sticks and seizing by the throat are not seen. Therefore, Arahants or those who have entered the path to Arahantship do approach such a sacrifice. This, brahmin, is the reason, this is the cause, by which those regular gifts and favorable offerings are, compared to this sacrifice complete in three ways and with sixteen requisites, less troublesome, involve less effort, and are of greater fruit and greater benefit.”",
      "sinhala": "භවත් ගෞතමය, මේ ත්‍රිවිධ යාග සම්පත්තියෙන් හා සොළොස් පිරිකරින් යුත් යාගයට වඩා අඩු වෙහෙසක් ඇති, අඩු අරඹුමක් ඇති, මහත් ඵල ඇති, මහත් ආනිසංස ඇති වෙනත් යාගයක් ඇත්ද? බ්‍රාහ්මණය, මේ ත්‍රිවිධ යාග සම්පත්තියෙන් හා සොළොස් පිරිකරින් යුත් යාගයට වඩා අඩු වෙහෙසක් ඇති, අඩු අරඹුමක් ඇති, මහත් ඵල ඇති, මහත් ආනිසංස ඇති වෙනත් යාගයක් ඇත. භවත් ගෞතමය, මේ ත්‍රිවිධ යාග සම්පත්තියෙන් හා සොළොස් පිරිකරින් යුත් යාගයට වඩා අඩු වෙහෙසක් ඇති, අඩු අරඹුමක් ඇති, මහත් ඵල ඇති, මහත් ආනිසංස ඇති ඒ යාගය කවරේද? බ්‍රාහ්මණය, ශ්‍රීලවන්තවූ ප්‍ර​ව්‍රජිතයන් උදෙසා දෙනු ලබන යම් නිරතුරු දාන හා අනුකූල යාග ඇත්ද, බ්‍රාහ්මණය, මේ ත්‍රිවිධ යාග සම්පත්තියෙන් හා සොළොස් පිරිකරින් යුත් යාගයට වඩා අඩු වෙහෙසක් ඇති, අඩු අරඹුමක් ඇති, මහත් ඵල ඇති, මහත් ආනිසංස ඇති යාගය එයයි. භවත් ගෞතමය, ඒ නිරතුරු දානය, අනුකූල යාගය, මේ ත්‍රිවිධ යාග සම්පත්තියෙන් හා සොළොස් පිරිකරින් යුත් යාගයට වඩා අඩු වෙහෙසක් ඇති, අඩු අරඹුමක් ඇති, මහත් ඵල ඇති, මහත් ආනිසංස ඇති වන්නේ කවර හේතුවකින්ද, කවර ප්‍රත්‍යයකින්ද? බ්‍රාහ්මණය, රහතුන් වහන්සේලා හෝ රහත් මාර්ගයට පැමිණි අය හෝ එබඳු යාගයන්ට ළං නොවෙති. එයට හේතුව කුමක්ද? බ්‍රාහ්මණය, එහි දඬු පහරවල් ද, ගෙල අල්ලා ගැනීම් ද දක්නට ලැබේ. එබැවින් රහතුන් වහන්සේලා හෝ රහත් මාර්ගයට පැමිණි අය හෝ එබඳු යාගයන්ට ළං නොවෙති. බ්‍රාහ්මණය, ශ්‍රීලවන්තවූ ප්‍ර​ව්‍රජිතයන් උදෙසා දෙනු ලබන යම් නිරතුරු දාන හා අනුකූල යාග ඇත්ද, බ්‍රාහ්මණය, රහතුන් වහන්සේලා හෝ රහත් මාර්ගයට පැමිණි අය හෝ එබඳු යාගයන්ට ළං වෙති. එයට හේතුව කුමක්ද? බ්‍රාහ්මණය, එහි දඬු පහරවල් ද, ගෙල අල්ලා ගැනීම් ද දක්නට නොලැබේ. එබැවින් රහතුන් වහන්සේලා හෝ රහත් මාර්ගයට පැමිණි අය හෝ එබඳු යාගයන්ට ළං වෙති. බ්‍රාහ්මණය, ඒ නිරතුරු දානය, අනුකූල යාගය, මේ ත්‍රිවිධ යාග සම්පත්තියෙන් හා සොළොස් පිරිකරින් යුත් යාගයට වඩා අඩු වෙහෙසක් ඇති, අඩු අරඹුමක් ඇති, මහත් ඵල ඇති, මහත් ආනිසංස ඇති වන්නේ මේ හේතුවෙන්, මේ ප්‍රත්‍යයෙන්ය.",
      "paliTitle": "Niccadānaanukulayaññaṃ",
      "englishTitle": "Constant Giving and Favorable Sacrifice",
      "sinhalaTitle": "නිත්‍‌ය දානයට අනුකූල යාගය"
    },
    {
      "number": 350,
      "pali": "‘‘Atthi pana, bho gotama, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Atthi kho, brāhmaṇa, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti. ‘‘Katamo pana so, bho gotama, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Yo kho, brāhmaṇa, cātuddisaṃ saṅghaṃ uddissa vihāraṃ karoti, ayaṃ kho, brāhmaṇa, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti.",
      "english": "“Is there, Master Gotama, another offering that, compared to this offering with its threefold accomplishment, its sixteen requisites, its constant giving, and its auspicious nature, is less troublesome, involves less effort, and is of greater fruit and greater benefit?”\n\n“Indeed there is, brahmin, another offering that, compared to this offering with its threefold accomplishment, its sixteen requisites, its constant giving, and its auspicious nature, is less troublesome, involves less effort, and is of greater fruit and greater benefit.”\n\n“But what, Master Gotama, is that offering that, compared to this offering with its threefold accomplishment, its sixteen requisites, its constant giving, and its auspicious nature, is less troublesome, involves less effort, and is of greater fruit and greater benefit?”\n\n“Indeed, brahmin, whoever constructs a dwelling for the Sangha from the four directions, this offering, brahmin, compared to this offering with its threefold accomplishment, its sixteen requisites, its constant giving, and its auspicious nature, is less troublesome, involves less effort, and is of greater fruit and greater benefit.”",
      "sinhala": "\"භවත් ගෞතමයෙනි, මේ ත්‍රිවිධ යාග සම්පත්තියටත්, ෂෝඩශ පූජෝපකරණ සහිත වූ මේ නිරන්තර සුදුසු දානයටත් වඩා, අඩු පීඩා සහිත වූ ද, අඩු ආරම්භක ක්‍රියා සහිත වූ ද, මහාඵල සහිත වූ ද, මහානිසංස සහිත වූ ද වෙනත් යාගයක් ඇත්තේද?\"\n\n\"බ්‍රාහ්මණය, මේ ත්‍රිවිධ යාග සම්පත්තියටත්, ෂෝඩශ පූජෝපකරණ සහිත වූ මේ නිරන්තර සුදුසු දානයටත් වඩා, අඩු පීඩා සහිත වූ ද, අඩු ආරම්භක ක්‍රියා සහිත වූ ද, මහාඵල සහිත වූ ද, මහානිසංස සහිත වූ ද වෙනත් යාගයක් ඇත්තේමය.\"\n\n\"භවත් ගෞතමයෙනි, එසේනම් මේ ත්‍රිවිධ යාග සම්පත්තියටත්, ෂෝඩශ පූජෝපකරණ සහිත වූ මේ නිරන්තර සුදුසු දානයටත් වඩා, අඩු පීඩා සහිත වූ ද, අඩු ආරම්භක ක්‍රියා සහිත වූ ද, මහාඵල සහිත වූ ද, මහානිසංස සහිත වූ ද ඒ යාගය කුමක්ද?\"\n\n\"බ්‍රාහ්මණය, යම් කෙනෙක් සිව්දිශාවේ සංඝයා උදෙසා විහාරයක් කරන්නේද, බ්‍රාහ්මණය, මේ ත්‍රිවිධ යාග සම්පත්තියටත්, ෂෝඩශ පූජෝපකරණ සහිත වූ මේ නිරන්තර සුදුසු දානයටත් වඩා, අඩු පීඩා සහිත වූ ද, අඩු ආරම්භක ක්‍රියා සහිත වූ ද, මහාඵල සහිත වූ ද, මහානිසංස සහිත වූ ද ඒ යාගය මෙයයි.\"",
      "paliTitle": ""
    },
    {
      "number": 351,
      "pali": "‘‘Atthi pana, bho gotama, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Atthi kho, brāhmaṇa, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti. ‘‘Katamo pana so, bho gotama, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Yo kho, brāhmaṇa, pasannacitto buddhaṃ saraṇaṃ gacchati, dhammaṃ saraṇaṃ gacchati, saṅghaṃ saraṇaṃ gacchati; ayaṃ kho, brāhmaṇa, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti.",
      "english": "“Is there then, Master Gotama, another offering that is less troublesome, less laborious, greatly fruitful, and greatly beneficial than this threefold perfection of offerings with sixteen requisites, this constant almsgiving, the favorable offering, and this donation of a dwelling place?” “Indeed, brahmin, there is another offering that is less troublesome, less laborious, greatly fruitful, and greatly beneficial than this threefold perfection of offerings with sixteen requisites, this constant almsgiving, the favorable offering, and this donation of a dwelling place.” “And what is that offering, Master Gotama, that is less troublesome, less laborious, greatly fruitful, and greatly beneficial than this threefold perfection of offerings with sixteen requisites, this constant almsgiving, the favorable offering, and this donation of a dwelling place?” “Indeed, brahmin, whoever with a confident mind goes for refuge to the Buddha, goes for refuge to the Dhamma, and goes for refuge to the Sangha; this, brahmin, is the offering that is less troublesome, less laborious, greatly fruitful, and greatly beneficial than this threefold perfection of offerings with sixteen requisites, this constant almsgiving, the favorable offering, and this donation of a dwelling place.”",
      "sinhala": "භවත් ගෞතමයන් වහන්ස, ත්‍රිවිධ යාග සම්පත්තියෙන්ද, සොළොස් පරිස්කාරයෙන්ද, නිතර දෙන දානයෙන්ද, අනුකූල යාගයෙන්ද, විහාර දානයෙන්ද යුතු මේ යාගයට වඩා අඩු ආයාසදායක වූද, අඩු උත්සාහයකින් යුතු වූද, මහාඵල ඇති වූද, මහානිසංස ඇති වූද වෙනත් යාගයක් ඇත්තේද?\n\nබ්‍රාහ්මණය, ත්‍රිවිධ යාග සම්පත්තියෙන්ද, සොළොස් පරිස්කාරයෙන්ද, නිතර දෙන දානයෙන්ද, අනුකූල යාගයෙන්ද, විහාර දානයෙන්ද යුතු මේ යාගයට වඩා අඩු ආයාසදායක වූද, අඩු උත්සාහයකින් යුතු වූද, මහාඵල ඇති වූද, මහානිසංස ඇති වූද වෙනත් යාගයක් ඇත්තේමය.\n\nභවත් ගෞතමයන් වහන්ස, ත්‍රිවිධ යාග සම්පත්තියෙන්ද, සොළොස් පරිස්කාරයෙන්ද, නිතර දෙන දානයෙන්ද, අනුකූල යාගයෙන්ද, විහාර දානයෙන්ද යුතු මේ යාගයට වඩා අඩු ආයාසදායක වූද, අඩු උත්සාහයකින් යුතු වූද, මහාඵල ඇති වූද, මහානිසංස ඇති වූද ඒ යාගය කුමක්ද?\n\nබ්‍රාහ්මණය, යම් පුද්ගලයෙක් පැහැදුණු සිත් ඇතිව බුදුන් සරණ යන්නේද, දහම් සරණ යන්නේද, සංඝයා සරණ යන්නේද; බ්‍රාහ්මණය, ත්‍රිවිධ යාග සම්පත්තියෙන්ද, සොළොස් පරිස්කාරයෙන්ද, නිතර දෙන දානයෙන්ද, අනුකූල යාගයෙන්ද, විහාර දානයෙන්ද යුතු මේ යාගයට වඩා අඩු ආයාසදායක වූද, අඩු උත්සාහයකින් යුතු වූද, මහාඵල ඇති වූද, මහානිසංස ඇති වූද ඒ යාගය මෙයයි.",
      "paliTitle": ""
    },
    {
      "number": 352,
      "pali": "‘‘Atthi pana, bho gotama, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Atthi kho, brāhmaṇa, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti. ‘‘Katamo pana so, bho gotama, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Yo kho, brāhmaṇa, pasannacitto sikkhāpadāni samādiyati – pāṇātipātā veramaṇiṃ, adinnādānā veramaṇiṃ, kāmesumicchācārā veramaṇiṃ, musāvādā veramaṇiṃ, surāmerayamajjapamādaṭṭhānā veramaṇiṃ. Ayaṃ kho, brāhmaṇa, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti.",
      "english": "“Is there, Venerable Gotama, any other offering that is less troublesome, less laborious, of greater fruit, and of greater benefit than this threefold offering with its sixteen requisites, this continuous offering, this supportive offering, this donation of a monastery, and these goings for refuge?” “There is, brahmin, another offering that is less troublesome, less laborious, of greater fruit, and of greater benefit than this threefold offering with its sixteen requisites, this continuous offering, this supportive offering, this donation of a monastery, and these goings for refuge.” “But what, Venerable Gotama, is that offering that is less troublesome, less laborious, of greater fruit, and of greater benefit than this threefold offering with its sixteen requisites, this continuous offering, this supportive offering, this donation of a monastery, and these goings for refuge?”\n\n“That, brahmin, which one of clear faith undertakes as training rules—abstention from taking life, abstention from taking what is not given, abstention from sexual misconduct, abstention from false speech, abstention from distilled and fermented intoxicants that are the basis of heedlessness. This, brahmin, is the offering that is less troublesome, less laborious, of greater fruit, and of greater benefit than this threefold offering with its sixteen requisites, this continuous offering, this supportive offering, this donation of a monastery, and these goings for refuge.”",
      "sinhala": "භවත් ගෞතමයෙනි, මේ ත්‍රිවිධ යාග සම්පත්තියටත්, ෂෝඩශ පූජා උපකරණවලටත්, මේ නිරන්තර දානයටත්, සුදුසු යාගයටත්, මේ විහාර දානයටත්, මේ සරණ යාම්වලටත් වඩා අඩු වියදම් සහිත වූත්, අඩු වෙහෙසක් සහිත වූත්, මහත් ඵල සහිත වූත්, මහත් ආනිශංස සහිත වූත් වෙනත් යාගයක් ඇත්තේද?\n\nබ්‍රාහ්මණය, මේ ත්‍රිවිධ යාග සම්පත්තියටත්, ෂෝඩශ පූජා උපකරණවලටත්, මේ නිරන්තර දානයටත්, සුදුසු යාගයටත්, මේ විහාර දානයටත්, මේ සරණ යාම්වලටත් වඩා අඩු වියදම් සහිත වූත්, අඩු වෙහෙසක් සහිත වූත්, මහත් ඵල සහිත වූත්, මහත් ආනිශංස සහිත වූත් වෙනත් යාගයක් ඇත්තේමය.\n\nඑසේනම්, භවත් ගෞතමයෙනි, මේ ත්‍රිවිධ යාග සම්පත්තියටත්, ෂෝඩශ පූජා උපකරණවලටත්, මේ නිරන්තර දානයටත්, සුදුසු යාගයටත්, මේ විහාර දානයටත්, මේ සරණ යාම්වලටත් වඩා අඩු වියදම් සහිත වූත්, අඩු වෙහෙසක් සහිත වූත්, මහත් ඵල සහිත වූත්, මහත් ආනිශංස සහිත වූත් ඒ යාගය කුමක්ද?\n\nබ්‍රාහ්මණය, යම් කිසිවෙක් පැහැදුණු සිත් ඇතිව සිල් පද සමාදන් වෙයි – ප්‍රාණඝාතයෙන් වැළකීම, සොරකමින් වැළකීම, කාමයෙහි වරදවා හැසිරීමෙන් වැළකීම, මුසාවාදයෙන් වැළකීම, මත්පැන්, මත්ද්‍රව්‍ය හා ප්‍රමාදයට හේතුවන දේවලින් වැළකීම යන මේ සිල් පද සමාදන් වෙයි. බ්‍රාහ්මණය, මේ යාගය නම්, එම ත්‍රිවිධ යාග සම්පත්තියටත්, ෂෝඩශ පූජා උපකරණවලටත්, මේ නිරන්තර දානයටත්, සුදුසු යාගයටත්, මේ විහාර දානයටත්, මේ සරණ යාම්වලටත් වඩා අඩු වියදම් සහිත වූත්, අඩු වෙහෙසක් සහිත වූත්, මහත් ඵල සහිත වූත්, මහත් ආනිශංස සහිත වූත් යාගයයි.",
      "paliTitle": ""
    },
    {
      "number": 353,
      "pali": "‘‘Atthi pana, bho gotama, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi imehi ca sikkhāpadehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Atthi kho, brāhmaṇa, añño yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi imehi ca sikkhāpadehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti. ‘‘Katamo pana so, bho gotama, yañño imāya ca tividhāya yaññasampadāya soḷasaparikkhārāya iminā ca niccadānena anukulayaññena iminā ca vihāradānena imehi ca saraṇagamanehi imehi ca sikkhāpadehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cā’’ti? ‘‘Idha, brāhmaṇa, tathāgato loke uppajjati arahaṃ sammāsambuddho…pe… (yathā 190-212 anucchedesu, evaṃ vitthāretabbaṃ). Evaṃ kho, brāhmaṇa, bhikkhu sīlasampanno hoti…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Ayaṃ kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro ca…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro cāti. Ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti…pe… ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro ca…pe… nāparaṃ itthattāyāti pajānāti. Ayampi kho, brāhmaṇa, yañño purimehi yaññehi appaṭṭhataro ca appasamārambhataro ca mahapphalataro ca mahānisaṃsataro ca. Imāya ca, brāhmaṇa, yaññasampadāya aññā yaññasampadā uttaritarā vā paṇītatarā vā natthī’’ti. ",
      "english": "“Is there, Venerable Gotama, another sacrifice that is less troublesome, less laborious, of greater fruit, and of greater benefit than this three-fold sacrificial accomplishment with sixteen accessories, this constant giving, this favorable offering, this offering of a monastery, these refuges, and these precepts?”\n\n“Indeed, brahmin, there is another sacrifice that is less troublesome, less laborious, of greater fruit, and of greater benefit than this three-fold sacrificial accomplishment with sixteen accessories, this constant giving, this favorable offering, this offering of a monastery, these refuges, and these precepts.”\n\n“But what, Venerable Gotama, is that sacrifice that is less troublesome, less laborious, of greater fruit, and of greater benefit than this three-fold sacrificial accomplishment with sixteen accessories, this constant giving, this favorable offering, this offering of a monastery, these refuges, and these precepts?”\n\n“Here, brahmin, a Tathāgata arises in the world, an Arahant, a Fully Self-Awakened One, accomplished in knowledge and conduct, sublime, knower of the world, unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One. He proclaims the Dhamma excellent in the beginning, excellent in the middle, excellent in the end, with meaning and with letter, and reveals the holy life in its entirety and purity. A householder or a householder’s son, or one born in some other family, hears that Dhamma. Having heard it, he gains faith in the Tathāgata. Possessed of that faith, he reflects: ‘A constricted thing is household life, a path of dust; going forth is open air. It is not easy for one who lives in a house to practice the holy life in its complete perfection, in its utterly pure purity.’ He shaves off his hair and beard, puts on the saffron robes, and goes forth from the home life into homelessness. Having thus gone forth, he lives restrained by the rules of the monastic code, endowed with good conduct, seeing danger in the slightest faults, undertaking and training in the precepts. He guards the doors of his sense faculties, is endowed with mindfulness and clear comprehension, and is content. Thus, brahmin, a monk is endowed with moral conduct, and having abandoned the five hindrances—sensual desire, ill will, sloth and torpor, restlessness and remorse, and doubt—he enters upon and abides in the first jhana, which is accompanied by applied thought and sustained thought, with rapture and pleasure born of seclusion. This, brahmin, is a sacrifice less troublesome and less laborious, of greater fruit and greater benefit than the former sacrifices.\n\nWith the stilling of applied thought and sustained thought, he enters upon and abides in the second jhana, which has internal confidence and unification of mind, is without applied thought and sustained thought, and is filled with rapture and pleasure born of concentration. With the fading away of rapture, he dwells equanimous, mindful and clearly comprehending, and experiences pleasure with the body; he enters upon and abides in the third jhana, of which the noble ones declare: ‘He dwells equanimous and mindful, one who has a pleasant abiding.’ With the abandonment of pleasure and pain, and with the previous disappearance of joy and grief, he enters upon and abides in the fourth jhana, which is neither painful nor pleasurable and is purified by equanimity and mindfulness. This too, brahmin, is a sacrifice less troublesome and less laborious, of greater fruit and greater benefit than the former sacrifices.\n\nHe directs and inclines his mind to the knowledge of the destruction of mental fermentations. He understands as it actually is: ‘This is suffering’; ‘This is the origin of suffering’; ‘This is the cessation of suffering’; ‘This is the path leading to the cessation of suffering.’ He understands as it actually is: ‘These are mental fermentations’; ‘This is the origin of mental fermentations’; ‘This is the cessation of mental fermentations’; ‘This is the path leading to the cessation of mental fermentations.’ Knowing and seeing thus, his mind is liberated from the fermentation of sensual desire, from the fermentation of becoming, and from the fermentation of ignorance. With liberation, there comes the knowledge: ‘Liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’ This too, brahmin, is a sacrifice less troublesome and less laborious, of greater fruit and greater benefit than the former sacrifices. And, brahmin, there is no other sacrificial accomplishment higher or more excellent than this sacrificial accomplishment.”",
      "sinhala": "‘‘භවත් ගෞතමයෙනි, මේ ත‍්‍රිවිධ යඥ සම්පදාවට, සොළොස් පිරිකර සහිත මේ නිරන්තර දානයට, අනුකූල යඥයට, විහාර දානයට, මේ ත‍්‍රිශරණයට සහ මේ ශික්ෂා පදයන්ට වඩා, අඩු ආරම්භක ක‍්‍රියා ඇති, අඩු වෙහෙසක් ඇති, මහා ඵල ඇති, මහා ආනිසංස ඇති වෙනත් යඥයක් ඇත්තේද?’’\n\n‘‘බ්‍රාහ්මණය, මේ ත‍්‍රිවිධ යඥ සම්පදාවට, සොළොස් පිරිකර සහිත මේ නිරන්තර දානයට, අනුකූල යඥයට, විහාර දානයට, මේ ත‍්‍රිශරණයට සහ මේ ශික්ෂා පදයන්ට වඩා, අඩු ආරම්භක ක‍්‍රියා ඇති, අඩු වෙහෙසක් ඇති, මහා ඵල ඇති, මහා ආනිසංස ඇති වෙනත් යඥයක් ඇත්තෙන්ම ඇත.’’\n\n‘‘භවත් ගෞතමයෙනි, මේ ත‍්‍රිවිධ යඥ සම්පදාවට, සොළොස් පිරිකර සහිත මේ නිරන්තර දානයට, අනුකූල යඥයට, විහාර දානයට, මේ ත‍්‍රිශරණයට සහ මේ ශික්ෂා පදයන්ට වඩා, අඩු ආරම්භක ක‍්‍රියා ඇති, අඩු වෙහෙසක් ඇති, මහා ඵල ඇති, මහා ආනිසංස ඇති ඒ යඥය කවරේද?’’\n\nබ්‍රාහ්මණය, මෙහි තථාගතයන් වහන්සේ ලෝකයේ පහළ වෙති, අරහත් වූ, සම්මා සම්බුද්ධ වූ සේක. උන්වහන්සේ ධර්මය දේශනා කරති, යහපත් දිවි පැවැත්මක් සහිත වූ ශ‍්‍රාවකයෙක් පහළ වෙයි. එසේ බ්‍රාහ්මණය, භික්ෂුව සීල සම්පන්න වී, ඉන්ද්‍රිය සංවරය, සති සම්පජඤ්ඤය, සතුටින් සිත පහ කිරීමට හේතු වන දැහැන් වැයීම ආදිය පුරා, කාමයන්ගෙන් වෙන්ව, අකුසල් දහම් වලින් වෙන්ව විතර්ක විචාර සහිත වූ, විවේකයෙන් හටගත් ප‍්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. බ්‍රාහ්මණය, මේ යඥය පෙර පැවති යඥයන්ට වඩා අඩු ආරම්භක ක‍්‍රියා ඇති, අඩු වෙහෙසක් ඇති, මහා ඵල ඇති, මහා ආනිසංස ඇති යඥයකි. නැවතත්, බ්‍රාහ්මණය, භික්ෂුව විතර්ක විචාර සංසිඳුවා, තම සිත එකඟ කරගෙන, සමාධියෙන් හටගත් ප‍්‍රීතිය හා සැපය ඇති දෙවෙනි ධ්‍යානයටද, ප‍්‍රීතිය ක්ෂය කොට උපේක්ෂාවෙන් යුක්තව, සිහි නුවණින් යුක්තව, කයින් සැප විඳින තුන්වෙනි ධ්‍යානයටද, සැපයද දුරු කොට, දුකද දුරු කොට, පෙර සිටි සෝමනස්ස දෝමනස්සයන් අතුරුදහන් කර, දුක් නොවූ සැප නොවූ උපේක්ෂා සිහි සම්පජඤ්ඤයෙන් යුක්තව සතරවෙනි ධ්‍යානයටද පැමිණ වාසය කරයි. බ්‍රාහ්මණය, මේ යඥයද පෙර පැවති යඥයන්ට වඩා අඩු ආරම්භක ක‍්‍රියා ඇති, අඩු වෙහෙසක් ඇති, මහා ඵල ඇති, මහා ආනිසංස ඇති යඥයකි. ඔහු ඥාන දර්ශනය පිණිස සිත යොමු කරයි, නමාලයි. මෙසේ ඔහු අරහත්වයට පත්ව, නැවත මෙබඳු බවකට (භවයකට) නොඑන බව අවබෝධ කරයි. බ්‍රාහ්මණය, මේ යඥයද පෙර පැවති යඥයන්ට වඩා අඩු ආරම්භක ක‍්‍රියා ඇති, අඩු වෙහෙසක් ඇති, මහා ඵල ඇති, මහා ආනිසංස ඇති යඥයකි. බ්‍රාහ්මණය, මේ යඥ සම්පදාවට වඩා උසස් වූ හෝ ප‍්‍රණීත වූ හෝ වෙනත් යඥ සම්පදාවක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 354,
      "pali": "Evaṃ vutte, kūṭadanto brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama! Seyyathāpi bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gataṃ. Esāhaṃ bho gotama satta ca usabhasatāni satta ca vacchatarasatāni satta ca vacchatarīsatāni satta ca ajasatāni satta ca urabbhasatāni muñcāmi, jīvitaṃ demi, haritāni ceva tiṇāni khādantu, sītāni ca pānīyāni pivantu, sīto ca nesaṃ vāto upavāyatū’’ti. ",
      "english": "When this was said, the brahman Kūṭadanta said to the Blessed One: \"Excellent, good Gotama, excellent, good Gotama! Just as, good Gotama, one might set upright what was overturned, or reveal what was hidden, or show the way to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms; even so, has the Dhamma been made clear in many ways by the good Gotama. I go for refuge to the good Gotama, and to the Dhamma, and to the Saṅgha of bhikkhus. Let the good Gotama acknowledge me as a lay follower who has gone for refuge for life, from this day forward. I, good Gotama, release seven hundred bulls, seven hundred young male calves, seven hundred young female calves, seven hundred goats, and seven hundred rams; I grant them life. Let them eat green grass, let them drink cool water, and let cool breezes blow upon them.\"",
      "sinhala": "මෙසේ පැවසූ කල්හි කූටදන්ත බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: “අතිශයින් ශ්‍රේෂ්ඨ ය, භවත් ගෞතමයන් වහන්ස, අතිශයින් ශ්‍රේෂ්ඨ ය, භවත් ගෞතමයන් වහන්ස! භවත් ගෞතමයන් වහන්ස, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වසා තිබූ දෙයක් විවෘත කරන්නේ ද, මංමුළා වූවෙකුට මාර්ගය පෙන්වන්නේ ද, අන්ධකාරයේ ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යැයි තෙල් පහනක් දල්වන්නේ ද; එලෙසින්ම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරනු ලැබීය. මම දැන් භවත් ගෞතමයන් වහන්සේ ද, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය මා උපාසකයෙකු ලෙස භවත් ගෞතමයන් වහන්සේ පිළිගන්නා සේක්වා. භවත් ගෞතමයන් වහන්ස, මම දැන් ගොනුන් සත් සියයක් ද, වසු පැටවුන් සත් සියයක් ද, වස්සියන් සත් සියයක් ද, එළුවන් සත් සියයක් ද, බැටළුවන් සත් සියයක් ද නිදහස් කරමි, ඔවුන්ට ජීවිතය දෙමි. ඔවුහු කොළ පැහැති තණකොළ අනුභව කරත්වා, සිසිල් ජලය පානය කරත්වා, සිසිල් සුළං ඔවුන්ට වදිත්වා.”",
      "paliTitle": "Kūṭadantaupāsakattapaṭivedanā",
      "englishTitle": "Kūṭadanta's Declaration as a Lay Follower",
      "sinhalaTitle": "කූටදන්ත උපාසක ප්‍රතිවේදනා"
    },
    {
      "number": 355,
      "pali": "Atha kho bhagavā kūṭadantassa brāhmaṇassa anupubbiṃ kathaṃ kathesi, seyyathidaṃ, dānakathaṃ sīlakathaṃ saggakathaṃ; kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ nekkhamme ānisaṃsaṃ pakāsesi. Yadā bhagavā aññāsi kūṭadantaṃ brāhmaṇaṃ kallacittaṃ muducittaṃ vinīvaraṇacittaṃ udaggacittaṃ pasannacittaṃ, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā, taṃ pakāsesi – dukkhaṃ samudayaṃ nirodhaṃ maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya, evameva kūṭadantassa brāhmaṇassa tasmiññeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘‘yaṃ kiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’’nti.",
      "english": "Then the Blessed One delivered a gradual discourse to Kūṭadanta the brahmin, that is, a discourse on generosity, a discourse on morality, a discourse on heaven; he expounded the danger, degradation, and defilement of sensual pleasures and the advantage of renunciation. When the Blessed One knew Kūṭadanta the brahmin to have a prepared mind, a pliant mind, a mind free from hindrances, an uplifted mind, a confident mind, then he expounded the teaching characteristic of the Buddhas, that is – suffering, its origin, its cessation, and the path. Just as a clean cloth, free from stains, perfectly absorbs dye, even so, for Kūṭadanta the brahmin, right on that very seat, the dust-free, stainless Vision of the Dhamma arose – “Whatever is of the nature to arise, all that is of the nature to cease.”",
      "sinhala": "එවිට භාග්‍ය‍වතුන් වහන්සේ කූටදන්ත බ්‍රාහ්මණයාට අනුපුබ්බිකතාවක් දේශනා කළ සේක. එනම්, දාන කතාව, සීල කතාව, සග්ග කතාව; කාමයන්ගේ ආදීනවය, අවකීර්තිමත් බව, කෙලෙසීම් සහ නෛෂ්ක්‍රම්‍යයේ ආනිසංස උන්වහන්සේ ප්‍රකාශ කළ සේක. භාග්‍ය‍වතුන් වහන්සේ යම් කලක කූටදන්ත බ්‍රාහ්මණයාගේ සිත සුදානයට සුදුසු, මෘදු, නීවරණ රහිත, උද්ගත වූ, ප්‍රසන්න වූ සිතක් බව දැනගත් සේක්ද, එවිට බුදුරජාණන් වහන්සේලාගේ උතුම් වූ ධර්ම දේශනාව, එනම් දුක, දුක ඇතිවීම, දුක නැතිකිරීම සහ දුක නැතිකිරීමේ මාර්ගය උන්වහන්සේ දේශනා කළ සේක. යම්සේ කිලිටි නැති පිරිසිදු වස්ත්‍රයක් මනාකොට සායම් පිළිගන්නේද, එසේම කූටදන්ත බ්‍රාහ්මණයාටද එම ආසනයේම කෙලෙස් රහිත, පහව ගිය කෙලෙස් ඇති ධම්මචක්ඛුව පහළ විය. එනම්, \"යම් කිසිවක් හටගැනීමේ ස්වභාවයෙන් යුක්තද, ඒ සියල්ල නැතිවීමේ ස්වභාවයෙන් යුක්තය\" යනුවෙනි.",
      "paliTitle": "Sotāpattiphalasacchikiriyā",
      "englishTitle": "Realization of Stream-Entry",
      "sinhalaTitle": "සෝවාන් ඵල ලැබීම"
    },
    {
      "number": 356,
      "pali": "Atha kho kūṭadanto brāhmaṇo diṭṭhadhammo pattadhammo viditadhammo pariyogāḷhadhammo tiṇṇavicikiccho vigatakathaṃkatho vesārajjappatto aparappaccayo satthusāsane bhagavantaṃ etadavoca – ‘‘adhivāsetu me bhavaṃ gotamo svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena.",
      "english": "Then Kūṭadanta the Brahmin, having realized the Dhamma, attained the Dhamma, understood the Dhamma, and fully penetrated the Dhamma; having crossed over doubt, having rid himself of perplexity, having achieved perfect confidence, and being independent of others in the Teacher’s Dispensation, addressed the Blessed One, saying: “May Master Gotama accept from me a meal for tomorrow, together with the community of bhikkhus.” The Blessed One accepted by remaining silent.",
      "sinhala": "එවිට කූටදන්ත බ්‍රාහ්මණයා ධර්මය දැක, ධර්මය අත්පත් කරගෙන, ධර්මය අවබෝධ කරගෙන, ධර්මයට මනාසේ පිවිස, සැකයෙන් එතෙර වී, සැක සංකා දුරු කර, නිර්භීතභාවයට පත්ව, ශාස්තෘන් වහන්සේගේ ශාසනයෙහි අන්‍යයන් කෙරෙහි පරායත්ත බව නැති අයෙකු වී, භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය – “ගෞතම භවත් උත්තමයාණන් වහන්ස, හෙට දවසට භික්ෂු සංඝයා සමඟ මාගේ දානය පිළිගන්නා සේක්වා!” භාග්‍යවතුන් වහන්සේ නිහඬව සිටීමෙන් එය පිළිගත් සේක.",
      "paliTitle": ""
    },
    {
      "number": 357,
      "pali": "Atha kho kūṭadanto brāhmaṇo bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho kūṭadanto brāhmaṇo tassā rattiyā accayena sake yaññavāṭe paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā bhagavato kālaṃ ārocāpesi – ‘‘kālo, bho gotama; niṭṭhitaṃ bhatta’’nti.",
      "english": "Then Kūṭadanta the Brahmin, having understood the Blessed One’s acceptance, rose from his seat, saluted the Blessed One, circumambulated him clockwise, and departed.\n\nThen, after that night had passed, Kūṭadanta the Brahmin had excellent hard and soft food prepared in his own sacrificial enclosure. He then sent word to the Blessed One to announce the time, saying, \"It is time, Venerable Gotama; the meal is ready.\"",
      "sinhala": "එවිට කූටදන්ත බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේගේ පිළිගැනීම දැනගෙන, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට ආචාර කර, පැදකුණු කොට පිටත්ව ගියේය.\n\nඑවිට කූටදන්ත බ්‍රාහ්මණයා ඒ රාත්‍රිය ඉක්ම ගිය පසු, තමාගේ යඥ භූමියේ ප්‍රණීත කෑම බීම පිළියෙළ කරවා, භාග්‍යවතුන් වහන්සේට වේලාව දැන්වීය – “භවත් ගෞතමය, වේලාවයි; දානය නිමවී ඇත”යි.",
      "paliTitle": ""
    },
    {
      "number": 358,
      "pali": "Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena kūṭadantassa brāhmaṇassa yaññavāṭo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho kūṭadanto brāhmaṇo buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. Atha kho kūṭadanto brāhmaṇo bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho kūṭadantaṃ brāhmaṇaṃ bhagavā dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmīti.",
      "english": "Then, in the forenoon, the Blessed One, having dressed and taken his bowl and robes, approached, together with the community of monks, the sacrificial enclosure of the brahmin Kuṭadanta. Having arrived, he sat down on the seat prepared for him. Then the brahmin Kuṭadanta, with his own hands, satisfied and nourished the community of monks, with the Buddha as their chief, with choice hard and soft food. Then, when the Blessed One had finished eating and had removed his hand from the bowl, the brahmin Kuṭadanta took some lower seat and sat down to one side. To the brahmin Kuṭadanta, thus seated to one side, the Blessed One instructed, inspired, encouraged, and gladdened him with a talk on the Dhamma. Then, rising from his seat, he departed.",
      "sinhala": "එවිට භාග්‍ය​වතුන් වහන්සේ පෙරවරුවේ සිවුරු පොරවාගෙන පාත්‍රය හා සිවුර ගෙන භික්ෂුසංඝයා සමඟ කූටදන්ත බමුණාගේ යඥ භූමිය වෙත වැඩමකර, පනවන ලද ආසනයක වැඩහුන්සේක. එවිට කූටදන්ත බමුණා බුදුරදුන් ප්‍ර​මුඛ භික්ෂුසංඝයාට ප්‍ර​ණීත වූ කැවිලි හා කෑමෙන් සියතින්ම සංග්‍රහ කොට තෘප්තිමත් කළේය. එවිට කූටදන්ත බමුණා භාග්‍ය​වතුන් වහන්සේ දන් වළඳා නිමකොට පාත්‍රය හා අත් සෝදා නිම කළ පසු, වෙනත් පහත් ආසනයක් ගෙන එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි කූටදන්ත බමුණාට භාග්‍ය​වතුන් වහන්සේ ධර්ම​ කථාවකින් කරුණු දක්වා, සමාදන් කරවා, උනන්දු කරවා, සතුටු කරවා ආසනයෙන් නැගිට වැඩම කළසේක.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Kūṭadantasuttaṃ niṭṭhitaṃ pañcamaṃ.",
    "english": "Kūṭadanta Sutta Concluded, Fifth",
    "sinhala": "පස්වන කූටදන්ත සූත්‍රය නිමයි"
  }
}