{
  "id": "dn.1.12",
  "title": {
    "pali": "Lohiccasuttaṃ",
    "english": "The Lohicca Sutta",
    "sinhala": "ලෝහිච්ච සූත්‍රය"
  },
  "sections": [
    {
      "number": 501,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena sālavatikā tadavasari. Tena kho pana samayena lohicco brāhmaṇo sālavatikaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ raññā pasenadinā kosalena dinnaṃ rājadāyaṃ, brahmadeyyaṃ.",
      "english": "Thus have I heard: At one time, the Blessed One, while on a tour among the Kosalans, arrived at Sālavatikā together with a large community of monks, approximately five hundred monks. Now at that time, the brahman Lohicca was residing in Sālavatikā. It was a populous settlement, abundant in grass, timber, and water, and prosperous with grain. It was a royal demesne, a royal gift bestowed by King Pasenadi of Kosala, a grant to a brahmin.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ පන්සියයක් පමණ භික්ෂූන් වහන්සේලා සහිත මහත් භික්ෂුසංඝයා සමඟ කෝසල ජනපදයෙහි චාරිකාවේ වඩමින් සාලවතී නම් ගම දෙසට වැඩම කළ සේක. එකල්හි ලෝහිච්ච නම් බ්‍රාහ්මණයා, මිනිසුන්ගෙන් පිරුණු, තණකොළ, දර, ජලය හා ධාන්‍ය සම්පතින් යුක්ත වූ, කෝසල රටෙහි රජු වූ පසේනදී විසින් දෙන ලද, රජුට අයත් වූ දායාදයක් වූ, බ්‍රාහ්මණයන්ට දෙන ලද දානයක් වූ සාලවතී ගමෙහි වාසය කළේය.",
      "paliTitle": "Lohiccabrāhmaṇavatthu",
      "englishTitle": "Story of the brahmin Lohicca",
      "sinhalaTitle": "ලෝහිච්ච බ‍්‍රාහ්මණ වස්තුව"
    },
    {
      "number": 502,
      "pali": "Tena kho pana samayena lohiccassa brāhmaṇassa evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ hoti – ‘‘idha samaṇo vā brāhmaṇo vā kusalaṃ dhammaṃ adhigaccheyya, kusalaṃ dhammaṃ adhigantvā na parassa āroceyya, kiñhi paro parassa karissati. Seyyathāpi nāma purāṇaṃ bandhanaṃ chinditvā aññaṃ navaṃ bandhanaṃ kareyya, evaṃsampadamidaṃ pāpakaṃ lobhadhammaṃ vadāmi, kiñhi paro parassa karissatī’’ti.",
      "english": "Now at that time, such a wicked wrong view had arisen in the brahmin Lohicca: \"Here, a recluse or a brahmin, having attained a wholesome state, should not proclaim it to another, for what can another do for another? Just as if one, having cut off an old bond, were to create another new bond, I declare this wicked principle of greed to be exactly like that, for what can another do for another?\"",
      "sinhala": "ඒ අවස්ථාවේදී ලෝහිච්ච බ්‍රාහ්මණයාට මෙබඳු පාපී දෘෂ්ටියක් ඇති වී තිබුණි: \"මෙහි යම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් කුසල ධර්මයක් අවබෝධ කරගන්නේ නම්, කුසල ධර්මය අවබෝධ කරගෙන එය අන්‍යයෙකුට නොපැවසිය යුතුය. අන්‍යයෙක් අන්‍යයෙකුට කුමක් කරන්නේද? යම්සේ පැරණි බැම්මක් සිඳ දමා වෙනත් අලුත් බැම්මක් හදනවා නම්, එලෙසින්ම මෙය පාපී ලෝභ ධර්මයක් යැයි මම පවසමි. අන්‍යයෙක් අන්‍යයෙකුට කුමක් කරන්නේද?\"",
      "paliTitle": ""
    },
    {
      "number": 503,
      "pali": "Assosi kho lohicco brāhmaṇo – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi sālavatikaṃ anuppatto. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti.",
      "english": "The brahman Lohicca heard: \"Indeed, Sir, the recluse Gotama, a Sakyan son gone forth from the Sakyan clan, is wandering in the Kosala country and has arrived at Sālavatikā with a great community of bhikkhus, about five hundred in number. Concerning that Venerable Gotama, such a good report has spread: 'The Blessed One is a Worthy One, a Perfectly Self-Enlightened One, endowed with knowledge and conduct, a Well-farer, a Knower of the Worlds, an Unexcelled Trainer of persons to be tamed, a Teacher of gods and humans, the Awakened One, the Blessed One.' He, having realized this world—with its devas, Māra, and Brahmā; with its recluses and brahmans, its devas and humans—directly for himself, proclaims it. He teaches the Dhamma that is beautiful in the beginning, beautiful in the middle, beautiful in the end, with its meaning and its phrasing. He proclaims the perfectly complete and purified holy life. Indeed, it is good to see such Worthy Ones.\"",
      "sinhala": "ලෝහිච්ච බ්‍රාහ්මණයා ඇසුවේය – “භවත්නි, ශාක්‍ය පුත්‍ර වූ, ශාක්‍ය කුලයෙන් පැවිදි වූ ගෞතම ශ්‍රමණයන් වහන්සේ කෝසල ජනපදයේ චාරිකාවේ වඩිමින්, භික්ෂූන් වහන්සේලා පන්සියයක පමණ මහත් භික්ෂු සංඝයා සමඟ සාලවතියට වැඩ සිටී. ඒ භවත් ගෞතමයන් වහන්සේ පිළිබඳව මෙබඳු කීර්ති ඝෝෂාවක් පැතිර ගොස් ඇත – ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධයි, විජ්ජාචරණසම්පන්නයි, සුගතයි, ලෝකවිදූයි, අනුත්තරෝ පුරිසදම්මසාරථියි, සත්ථා දේවමනුස්සානං, බුද්ධයි, භගවායි’ කියා. උන්වහන්සේ දෙවියන් සහිත, මරුන් සහිත, බඹුන් සහිත, ශ්‍රමණ-බ්‍රාහ්මණයන් සහිත වූ, දෙවි මිනිසුන් සහිත වූ මේ ලෝකය තමන් විසින්ම අභිඥා ඥානයෙන් අවබෝධ කොට ප්‍රකාශ කරයි. උන්වහන්සේ මුල කල්‍යාණ වූ, මැද කල්‍යාණ වූ, අග කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකන්තයෙන්ම පිරිපුන් වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව දේශනා කරයි. එබඳු රහතුන් වහන්සේලා දැකීම යහපති නොවැ.”",
      "paliTitle": ""
    },
    {
      "number": 504,
      "pali": "Atha kho lohicco brāhmaṇo rosikaṃ [bhesikaṃ (sī. pī.)] nhāpitaṃ āmantesi – ‘‘ehi tvaṃ, samma rosike, yena samaṇo gotamo tenupasaṅkama; upasaṅkamitvā mama vacanena samaṇaṃ gotamaṃ appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ puccha – lohicco, bho gotama, brāhmaṇo bhavantaṃ gotamaṃ appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ pucchatī’’ti. Evañca vadehi – ‘‘adhivāsetu kira bhavaṃ gotamo lohiccassa brāhmaṇassa svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti.",
      "english": "Then indeed, the brahmin Lohicca addressed Rosika the barber: \"Come, friend Rosika, approach the ascetic Gotama. Having approached him, in my name, ask the ascetic Gotama if he is free from illness, free from affliction, light in body, strong, and living at ease, saying: 'The brahmin Lohicca, good Gotama, asks if Master Gotama is free from illness, free from affliction, light in body, strong, and living at ease.' And also say this: 'May Master Gotama please consent to accept a meal for tomorrow from the brahmin Lohicca, together with the community of bhikkhus.'\"",
      "sinhala": "ඉන්පසු ලෝහිච්ච බ්‍රාහ්මණයා රෝසික නම් බාහිරයා ඇමතුවේය – ‘‘මිත්‍ර රෝසිකය, නුඹ එනු. ශ්‍රමණ ගෞතමයන් වහන්සේ වැඩසිටින තැනට යව. උන්වහන්සේ වෙත එළඹ, මාගේ වචනයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේගෙන් රෝගී නැති බව, අපහසුතා නැති බව, ශරීරයේ සැහැල්ලුව, ශක්තිය සහ සුවසේ වාසය ගැන විචාරන්න – ‘භවත් ගෞතමය, ලෝහිච්ච බ්‍රාහ්මණයා භවත් ගෞතමයන් වහන්සේගෙන් රෝගී නැති බව, අපහසුතා නැති බව, ශරීරයේ සැහැල්ලුව, ශක්තිය සහ සුවසේ වාසය ගැන විචාරන සේකැයි.’ තවද මෙසේ කියන්න – ‘භවත් ගෞතමයන් වහන්සේ භික්ෂුසංඝයා සමඟ ලෝහිච්ච බ්‍රාහ්මණයාගේ හෙට දවසට දානය කරුණාකර පිළිගන්නා සේක්වායි’’.",
      "paliTitle": ""
    },
    {
      "number": 505,
      "pali": "‘‘Evaṃ, bho’’ti [evaṃ bhanteti (sī. pī.)] kho rosikā nhāpito lohiccassa brāhmaṇassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rosikā nhāpito bhagavantaṃ etadavoca – ‘‘lohicco, bhante, brāhmaṇo bhagavantaṃ appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ pucchati; evañca vadeti – adhivāsetu kira, bhante, bhagavā lohiccassa brāhmaṇassa svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena.",
      "english": "\"Yes, sir,\" Rosikā the barber, having assented to the brahmin Lohicca, approached the Blessed One. Having approached, he paid homage to the Blessed One and sat down to one side. Sitting to one side, Rosikā the barber said this to the Blessed One: \"Venerable sir, the brahmin Lohicca inquires about the Blessed One's freedom from illness, freedom from affliction, lightness of body, strength, and well-being. And he says this: 'Venerable sir, may the Blessed One please assent to tomorrow's meal at the brahmin Lohicca's, together with the community of bhikkhus.'\" The Blessed One assented by remaining silent.",
      "sinhala": "\"එසේය, ස්වාමීනි\" යැයි රෝසික නාපිත තෙමේ ලෝහිච්ච බ්‍රාහ්මණයාට පිළිගෙන, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට, එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වූ රෝසික නාපිත තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, ලෝහිච්ච බ්‍රාහ්මණයාණෝ භාග්‍යවතුන් වහන්සේට රෝග අඩුද, ආතංක අඩුද, පහසුවෙන් නැගිටින්නට හැකිද, ශක්තිය තිබේද, සැප විහරණයක් වේදැයි අසයි; තවද, මෙසේ කියයි – ස්වාමීනි, භාග්‍යවතුන් වහන්සේ හෙට දවසට ලෝහිච්ච බ්‍රාහ්මණයාගේ දානය භික්ෂු සංඝයා සමඟ පිළිගන්නා සේක්වා යනුයි.\" භාග්‍යවතුන් වහන්සේ නිහඬ භාවයෙන් එය පිළිගත් සේක.",
      "paliTitle": ""
    },
    {
      "number": 506,
      "pali": "Atha kho rosikā nhāpito bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā yena lohicco brāhmaṇo tenupasaṅkami; upasaṅkamitvā lohiccaṃ brāhmaṇaṃ etadavoca – ‘‘avocumhā kho mayaṃ bhoto [mayaṃ bhante tava (sī. pī.)] vacanena taṃ bhagavantaṃ – ‘lohicco, bhante, brāhmaṇo bhagavantaṃ appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ pucchati; evañca vadeti – adhivāsetu kira, bhante, bhagavā lohiccassa brāhmaṇassa svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’ti. Adhivutthañca pana tena bhagavatā’’ti.",
      "english": "Then Rosika the barber, having understood the Blessed One's consent, rose from his seat, saluted the Blessed One, and circumambulated him clockwise. He then approached the brahman Lohicca and, having approached him, said this: \"Indeed, we spoke to the Blessed One at your request, saying, 'Venerable sir, the brahman Lohicca asks after the Blessed One's freedom from illness, freedom from affliction, lightness of body, strength, and comfortable living; and he says this: 'May the Blessed One, venerable sir, please consent to tomorrow's meal for the brahman Lohicca, together with the community of monks.'' And indeed, the Blessed One has consented to it.\"",
      "sinhala": "ඉන්පසු රෝසිකා නම් කරණවෑමියා භාග්‍යවතුන් වහන්සේගේ පිළිගැනීම දැනගෙන, අසුනෙන් නැගිට, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, පැදකුණු කොට, ලෝහිච්ච බමුණා සිටි තැනට පැමිණියේය. පැමිණ ලෝහිච්ච බමුණාට මෙය කීවේය:\n\n“අපි ඔබගේ වචනයෙන් ඒ භාග්‍යවතුන් වහන්සේට කීවෙමු – ‘ස්වාමීනි, ලෝහිච්ච බමුණා භාග්‍යවතුන් වහන්සේගේ නිරෝගී බව, කායික පීඩා රහිත බව, පහසු ඉරියව් පැවැත්වීම, ශක්තිය සහ සුවසේ වැඩ සිටීම විමසයි; මෙසේද කියයි – ‘ස්වාමීනි, භාග්‍යවතුන් වහන්සේ භික්ෂු සංඝයා සමඟ ලෝහිච්ච බමුණාගේ හෙට දවසේ දානය පිළිගනිත්වා’ කියා.’ භාග්‍යවතුන් වහන්සේ විසින් එය පිළිගන්නා ලදී.”",
      "paliTitle": ""
    },
    {
      "number": 507,
      "pali": "Atha kho lohicco brāhmaṇo tassā rattiyā accayena sake nivesane paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā rosikaṃ nhāpitaṃ āmantesi – ‘‘ehi tvaṃ, samma rosike, yena samaṇo gotamo tenupasaṅkama; upasaṅkamitvā samaṇassa gotamassa kālaṃ ārocehi – kālo bho, gotama, niṭṭhitaṃ bhatta’’nti. ‘‘Evaṃ, bho’’ti kho rosikā nhāpito lohiccassa brāhmaṇassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho rosikā nhāpito bhagavato kālaṃ ārocesi – ‘‘kālo, bhante, niṭṭhitaṃ bhatta’’nti.",
      "english": "Then, after the passing of that night, the brahmin Lohicca had excellent hard and soft food prepared in his own dwelling, and he called the barber Rosika, saying, \"Come, friend Rosika, approach the recluse Gotama; having approached him, inform the recluse Gotama of the time, saying, 'It is time, good Gotama, the meal is ready.'\"\n\n\"Yes, sir,\" replied the barber Rosika to the brahmin Lohicca, and he then approached the Blessed One. Having approached, he paid respects to the Blessed One and stood to one side. Standing to one side, the barber Rosika informed the Blessed One of the time, saying, \"It is time, Venerable Sir, the meal is ready.\"",
      "sinhala": "එවිට ලෝහිච්ච බ්‍රාහ්මණයා ඒ රාත්‍රිය ගෙවී ගිය පසු, තමාගේ නිවසේ ප්‍රණීත කෑම බීම පිළියෙළ කරවා රෝසික නම් නාපිතයාට කතා කළේය – ‘‘එම්බා රෝසික, එන්න. ශ්‍රමණ ගෞතමයන් වහන්සේ වැඩසිටින තැනට යන්න. උන්වහන්සේ වෙත ගොස් ශ්‍රමණ ගෞතමයන් වහන්සේට කාලය දන්වන්න – ‘භවත් ගෞතමයනි, දැන් වේලාවයි, දානය සූදානම්ය’ කියා.’’ ‘‘එසේය, භවත්නි,’’ යැයි රෝසික නාපිතයා ලෝහිච්ච බ්‍රාහ්මණයාට පිළිතුරු දී, භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. උන්වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට ආචාර කොට එකත්පස්ව සිටියේය. එකත්පස්ව සිටි රෝසික නාපිතයා භාග්‍යවතුන් වහන්සේට කාලය දන්වා, ‘‘ස්වාමීනි, වේලාවයි, දානය සූදානම්ය’’ යැයි කීවේය.",
      "paliTitle": ""
    },
    {
      "number": 508,
      "pali": "Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena sālavatikā tenupasaṅkami. Tena kho pana samayena rosikā nhāpito bhagavantaṃ piṭṭhito piṭṭhito anubandho hoti. Atha kho rosikā nhāpito bhagavantaṃ etadavoca – ‘‘lohiccassa, bhante, brāhmaṇassa evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ – ‘idha samaṇo vā brāhmaṇo vā kusalaṃ dhammaṃ adhigaccheyya, kusalaṃ dhammaṃ adhigantvā na parassa āroceyya – kiñhi paro parassa karissati. Seyyathāpi nāma purāṇaṃ bandhanaṃ chinditvā aññaṃ navaṃ bandhanaṃ kareyya, evaṃ sampadamidaṃ pāpakaṃ lobhadhammaṃ vadāmi – kiñhi paro parassa karissatī’ti. Sādhu, bhante, bhagavā lohiccaṃ brāhmaṇaṃ etasmā pāpakā diṭṭhigatā vivecetū’’ti. ‘‘Appeva nāma siyā rosike, appeva nāma siyā rosike’’ti. Atha kho bhagavā yena lohiccassa brāhmaṇassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho lohicco brāhmaṇo buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi. ",
      "english": "Then, in the forenoon, the Fortunate One, having dressed, taking his bowl and robe, together with the community of bhikkhus, approached Sālavatikā. At that time, moreover, Rosikā the barber was following close behind the Fortunate One. Then Rosikā the barber said to the Fortunate One: \"Venerable Sir, such a wicked view has arisen in the brahmin Lohicca: 'Here, if a recluse or a brahmin realizes a wholesome Dhamma, having realized a wholesome Dhamma, he should not teach it to another. For what indeed can another do for another?' Just as if one were to cut an old bond and make another new bond, in the same way, I declare this wicked, greedy principle: 'What indeed can another do for another?' It would be good, Venerable Sir, if the Fortunate One were to remove the brahmin Lohicca from this wicked view.\" \"Perhaps it may be so, Rosikā, perhaps it may be so,\" (said the Fortunate One).\n\nThen the Fortunate One approached the dwelling of the brahmin Lohicca; having approached, he sat down on the seat prepared. Then the brahmin Lohicca, with his own hands, satisfied and served the community of bhikkhus headed by the Buddha with choice hard and soft foods.",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍රය හා සිවුර රැගෙන, භික්ෂු සංඝයා සමඟ සාලවතීකා නම් ගමට වැඩම කළ සේක. එකල රෝසිකා නම් ක්ෂෞරකාරයා භාග්‍යවතුන් වහන්සේ පසුපසම ගමන් කරමින් සිටියේය. එවිට රෝසිකා නම් ක්ෂෞරකාරයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ස්වාමීනි, ලෝහිච්ච නම් බ්‍රාහ්මණයාට මේ ආකාරයේ නපුරු මිථ්‍යා දෘෂ්ටියක් හටගෙන ඇත – ‘මෙහිදී යම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් කුසල ධර්මයක් අවබෝධ කරගන්නේ නම්, ඒ කුසල ධර්මය අවබෝධ කරගෙන අන් අයට එය නොකිය යුතුයි – අන්‍යයෙක් අන්‍යයෙකුට කුමක් කරන්නේද? යම්සේ පැරණි බැම්මක් සිඳ දමා අලුත් බැම්මක් කරනවාක් මෙන්, මෙය මා කියන්නේ නපුරු, ලෝභ ධර්මයකි – අන්‍යයෙක් අන්‍යයෙකුට කුමක් කරන්නේදැයි’ කියාය. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ ලෝහිච්ච බ්‍රාහ්මණයාට මේ නපුරු මිථ්‍යා දෘෂ්ටියෙන් මුදා හරිනවා නම් යහපති.\" \"රෝසිකාවෙනි, එසේ වීමට පුළුවන, රෝසිකාවෙනි, එසේ වීමට පුළුවන\"යි වදාළ සේක.\n\nඑවිට භාග්‍යවතුන් වහන්සේ ලෝහිච්ච බ්‍රාහ්මණයාගේ නිවස වෙත වැඩම කළ සේක; වැඩම කොට පිළියෙළ කර තිබූ අසුනෙහි වැඩ සිටි සේක. එවිට ලෝහිච්ච බ්‍රාහ්මණයා බුදුරදුන් ප්‍රමුඛ භික්ෂු සංඝයාට ප්‍රණීත වූ කැවිලි පෙවිලි හා ආහාරපාන සිය දෑතින්ම පිළිගන්වා සංග්‍රහ කළේය.",
      "paliTitle": ""
    },
    {
      "number": 509,
      "pali": "Atha kho lohicco brāhmaṇo bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho lohiccaṃ brāhmaṇaṃ bhagavā etadavoca – ‘‘saccaṃ kira te, lohicca, evarūpaṃ pāpakaṃ diṭṭhigataṃ uppannaṃ – ‘idha samaṇo vā brāhmaṇo vā kusalaṃ dhammaṃ adhigaccheyya, kusalaṃ dhammaṃ adhigantvā na parassa āroceyya – kiñhi paro parassa karissati. Seyyathāpi nāma purāṇaṃ bandhanaṃ chinditvā aññaṃ navaṃ bandhanaṃ kareyya, evaṃ sampadamidaṃ pāpakaṃ lobhadhammaṃ vadāmi, kiñhi paro parassa karissatī’’’ ti? ‘‘Evaṃ, bho gotama’’. ‘‘Taṃ kiṃ maññasi lohicca nanu tvaṃ sālavatikaṃ ajjhāvasasī’’ti? ‘‘Evaṃ, bho gotama’’. ‘‘Yo nu kho, lohicca, evaṃ vadeyya – ‘lohicco brāhmaṇo sālavatikaṃ ajjhāvasati. Yā sālavatikāya samudayasañjāti lohiccova taṃ brāhmaṇo ekako paribhuñjeyya, na aññesaṃ dadeyyā’ti. Evaṃ vādī so ye taṃ upajīvanti, tesaṃ antarāyakaro vā hoti, no vā’’ti? ‘‘Antarāyakaro, bho gotama’’. ‘‘Antarāyakaro samāno hitānukampī vā tesaṃ hoti ahitānukampī vā’’ti? ‘‘Ahitānukampī, bho gotama’’. ‘‘Ahitānukampissa mettaṃ vā tesu cittaṃ paccupaṭṭhitaṃ hoti sapattakaṃ vā’’ti? ‘‘Sapattakaṃ, bho gotama’’. ‘‘Sapattake citte paccupaṭṭhite micchādiṭṭhi vā hoti sammādiṭṭhi vā’’ti? ‘‘Micchādiṭṭhi, bho gotama’’. ‘‘Micchādiṭṭhissa kho ahaṃ, lohicca, dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – nirayaṃ vā tiracchānayoniṃ vā’’.",
      "english": "Then the brahmin Lohicca, after the Fortunate One had eaten and put away his bowl and washed his hands, took a low seat and sat down to one side. To Lohicca the brahmin, thus seated to one side, the Fortunate One said: \"Is it true, Lohicca, that such a wicked wrong view has arisen in you: 'Here, if a recluse or a brahmin were to realize a wholesome teaching, having realized that wholesome teaching, they should not declare it to another. What indeed will one do for another?' Just as one might cut an old bond and make another new bond, I say that this is similar to a wicked, greedy doctrine: 'What indeed will one do for another?'\" \"Yes, Venerable Gotama.\" \"What do you think, Lohicca? Do you not reside in Salavatika?\" \"Yes, Venerable Gotama.\" \"Now, Lohicca, if someone were to say this: 'The brahmin Lohicca resides in Salavatika. Whatever arises and is produced in Salavatika, the brahmin Lohicca alone should consume it and not give it to others.' Would such a speaker be an obstructer to those who depend on him, or not?\" \"An obstructer, Venerable Gotama.\" \"Being an obstructer, would he be sympathetic to their welfare or unsympathetic to their welfare?\" \"Unsympathetic to their welfare, Venerable Gotama.\" \"For one unsympathetic to welfare, would a mind of loving-kindness be present towards them, or a mind of hostility?\" \"A mind of hostility, Venerable Gotama.\" \"When a mind of hostility is present, is it wrong view or right view?\" \"Wrong view, Venerable Gotama.\" \"Indeed, Lohicca, for one with wrong view, I declare one of two destinations: hell or the animal realm.\"",
      "sinhala": "එවිට ලෝහිච්ච බ්‍රාහ්මණ තෙමේ භාග්‍යවතුන් වහන්සේ දන් වළඳා, පාත්‍රයෙන් අත ඉවත් කොට තිබෙන කල්හි, යම්කිසි පහත් අසුනක් ගෙන එක් පසෙක වාඩි විය. එක් පසෙක වාඩි වී සිටි ලෝහිච්ච බ්‍රාහ්මණයාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ලෝහිච්චය, ‘යම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ මේ ලෝකයෙහි කුශල ධර්මයක් අවබෝධ කරගන්නේ නම්, ඒ කුශල ධර්මය අවබෝධ කරගෙන අනුන්ට නොපෙන්විය යුතුය. අනුන් අනුන්ට කුමක් කරන්නේද? යම්සේ පැරණි බන්ධනයක් කපා දමා වෙනත් අලුත් බන්ධනයක් කරන්නේද, මේද එබඳු නපුරු ලෝභ ධර්මයකි. අනුන් අනුන්ට කුමක් කරන්නේදැයි’ මෙබඳු පාපී දෘෂ්ටියක් නුඹට ඇති වී තිබෙන්නේ ඇත්තද?” “එසේය, භවත් ගෞතමය.” “ලෝහිච්චය, නුඹ මේ ගැන කුමක් සිතන්නෙහිද? නුඹ සාලවතිකාවෙහි නොවසන්නෙහිද?” “එසේය, භවත් ගෞතමය.” “එසේනම් ලෝහිච්චය, යමෙක් මෙසේ කියන්නේ නම්: ‘ලෝහිච්ච බ්‍රාහ්මණ තෙමේ සාලවතිකාවෙහි වසයි. සාලවතිකාවෙහි යම් උපදවිකාවක් හටගනීද, ඒ සියල්ල ලෝහිච්ච බ්‍රාහ්මණයා පමණක් තනිව පරිභෝග කළ යුතුය. අනුන්ට නොදිය යුතුය’ කියා. මෙසේ කියන්නා ඔහු අනුව යැපෙන්නන්ට අන්තරාය කරන්නෙක් වේද, නොවේද?” “අන්තරාය කරන්නෙක් වේ, භවත් ගෞතමය.” “අන්තරාය කරන්නෙක් වූ විට ඔහු ඔවුන් කෙරෙහි හිතානුකම්පී වේද, අහිතානුකම්පී වේද?” “අහිතානුකම්පී වේ, භවත් ගෞතමය.” “අහිතානුකම්පී වූ විට ඔවුන් කෙරෙහි ඔහුගේ සිත මෛත්‍රී සහගත වේද, වෛර සහගත වේද?” “වෛර සහගත වේ, භවත් ගෞතමය.” “වෛර සහගත සිතක් ඇති වූ විට එය මිත්‍යාදෘෂ්ටියක් වේද, සම්මාදෘෂ්ටියක් වේද?” “මිත්‍යාදෘෂ්ටියක් වේ, භවත් ගෞතමය.” “ලෝහිච්චය, මිත්‍යාදෘෂ්ටියක් ඇති අයට මම ගති දෙකෙන් එකක් කියමි – නිරය හෝ තිරිසන් යෝනිය හෝ.”",
      "paliTitle": "Lohiccabrāhmaṇānuyogo",
      "englishTitle": "Lohicca the Brahmin's Questioning",
      "sinhalaTitle": "ලෝහිච්ච බ්‍රාහ්මණ විචාරය"
    },
    {
      "number": 510,
      "pali": "‘‘Taṃ kiṃ maññasi, lohicca, nanu rājā pasenadi kosalo kāsikosalaṃ ajjhāvasatī’’ti? ‘‘Evaṃ, bho gotama’’. ‘‘Yo nu kho, lohicca, evaṃ vadeyya – ‘rājā pasenadi kosalo kāsikosalaṃ ajjhāvasati; yā kāsikosale samudayasañjāti, rājāva taṃ pasenadi kosalo ekako paribhuñjeyya, na aññesaṃ dadeyyā’ti. Evaṃ vādī so ye rājānaṃ pasenadiṃ kosalaṃ upajīvanti tumhe ceva aññe ca, tesaṃ antarāyakaro vā hoti, no vā’’ti? ‘‘Antarāyakaro, bho gotama’’. ‘‘Antarāyakaro samāno hitānukampī vā tesaṃ hoti ahitānukampī vā’’ti? ‘‘Ahitānukampī, bho gotama’’. ‘‘Ahitānukampissa mettaṃ vā tesu cittaṃ paccupaṭṭhitaṃ hoti sapattakaṃ vā’’ti? ‘‘Sapattakaṃ, bho gotama’’. ‘‘Sapattake citte paccupaṭṭhite micchādiṭṭhi vā hoti sammādiṭṭhi vā’’ti? ‘‘Micchādiṭṭhi, bho gotama’’. ‘‘Micchādiṭṭhissa kho ahaṃ, lohicca, dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – nirayaṃ vā tiracchānayoniṃ vā’’.",
      "english": "“What do you think, Lohicca, doesn’t King Pasenadi of Kosala reside in Kasi-Kosala?” “Yes, Venerable Gotama.” “Now, Lohicca, if someone were to say: ‘King Pasenadi of Kosala resides in Kasi-Kosala; whatever wealth is generated in Kasi-Kosala, King Pasenadi of Kosala alone should enjoy it and not give it to anyone else’ – would such a speaker be an obstruction to those who depend on King Pasenadi of Kosala, including yourself and others, or not?” “An obstruction, Venerable Gotama.” “Being an obstruction, would he be sympathetic to their welfare or to their harm?” “Sympathetic to their harm, Venerable Gotama.” “If one is sympathetic to their harm, would their mind towards them be established in loving-kindness or in animosity?” “In animosity, Venerable Gotama.” “When the mind is established in animosity, is that wrong view or right view?” “Wrong view, Venerable Gotama.” “Indeed, Lohicca, for one holding wrong view, I declare one of two destinations: either hell or the animal realm.”",
      "sinhala": "\"ලෝහිච්චයෙනි, ඔබ මේ ගැන කුමක් සිතන්නේද? කොසොල් රජු වන පසේනදි රජතුමා කාසිකොසොල් දනව්ව පාලනය කරන්නේ නොවේද?\"\n\"භවත් ගෞතමයන් වහන්ස, එසේය.\"\n\"ලෝහිච්චයෙනි, යමෙක් මෙසේ කියන්නේ නම් - ‘කාසිකොසොල් දනව්ව පාලනය කරන කොසොල් රජු වන පසේනදි රජතුමා, කාසිකොසොල් දනව්වේ ඇතිවන සියලු ඵලදායි දේ තමන් තනිවම පරිභෝජනය කළ යුතුයි, අන් අයට නොදිය යුතුයි’ කියා. මෙසේ කියන ඔහු, කොසොල් රජු වන පසේනදි රජතුමා මත යැපෙන ඔබටත්, අන් අයටත් බාධා කරන්නෙක් වන්නේද, නොවේද?\"\n\"භවත් ගෞතමයන් වහන්ස, බාධා කරන්නෙකි.\"\n\"බාධා කරන්නෙක් වන ඔහු, ඔවුන්ට හිතානුකම්පී වන්නේද, අහිතානුකම්පී වන්නේද?\"\n\"භවත් ගෞතමයන් වහන්ස, අහිතානුකම්පී වන්නේය.\"\n\"අහිතානුකම්පී කෙනෙකුට ඔවුන් කෙරෙහි මෛත්‍රී සහගත සිතක් ඇතිවන්නේද, සතුරු සිතක් ඇතිවන්නේද?\"\n\"භවත් ගෞතමයන් වහන්ස, සතුරු සිතකි.\"\n\"සතුරු සිතක් ඇතිව සිටින විට එය මිත්‍යාදෘෂ්ටියක් වන්නේද, සම්මාදෘෂ්ටියක් වන්නේද?\"\n\"භවත් ගෞතමයන් වහන්ස, මිත්‍යාදෘෂ්ටියකි.\"\n\"ලෝහිච්චයෙනි, මිත්‍යාදෘෂ්ටිකයාට නම් මම ගති දෙකෙන් එකක් පවසමි – එනම් නිරය හෝ තිරිසන් යෝනිය යි.\"",
      "paliTitle": ""
    },
    {
      "number": 511,
      "pali": "‘‘Iti kira, lohicca, yo evaṃ vadeyya – ‘‘lohicco brāhmaṇo sālavatikaṃ ajjhāvasati; yā sālavatikāya samudayasañjāti, lohiccova taṃ brāhmaṇo ekako paribhuñjeyya, na aññesaṃ dadeyyā’’ti. Evaṃvādī so ye taṃ upajīvanti, tesaṃ antarāyakaro hoti. Antarāyakaro samāno ahitānukampī hoti, ahitānukampissa sapattakaṃ cittaṃ paccupaṭṭhitaṃ hoti, sapattake citte paccupaṭṭhite micchādiṭṭhi hoti. Evameva kho, lohicca, yo evaṃ vadeyya – ‘‘idha samaṇo vā brāhmaṇo vā kusalaṃ dhammaṃ adhigaccheyya, kusalaṃ dhammaṃ adhigantvā na parassa āroceyya, kiñhi paro parassa karissati. Seyyathāpi nāma purāṇaṃ bandhanaṃ chinditvā aññaṃ navaṃ bandhanaṃ kareyya…pe… karissatī’’ti. Evaṃvādī so ye te kulaputtā tathāgatappaveditaṃ dhammavinayaṃ āgamma evarūpaṃ uḷāraṃ visesaṃ adhigacchanti, sotāpattiphalampi sacchikaronti, sakadāgāmiphalampi sacchikaronti, anāgāmiphalampi sacchikaronti, arahattampi sacchikaronti, ye cime dibbā gabbhā paripācenti dibbānaṃ bhavānaṃ abhinibbattiyā, tesaṃ antarāyakaro hoti, antarāyakaro samāno ahitānukampī hoti, ahitānukampissa sapattakaṃ cittaṃ paccupaṭṭhitaṃ hoti, sapattake citte paccupaṭṭhite micchādiṭṭhi hoti. Micchādiṭṭhissa kho ahaṃ, lohicca, dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – nirayaṃ vā tiracchānayoniṃ vā.",
      "english": "Indeed, Lohicca, if someone were to say this: \"The brahmin Lohicca dwells in Sālavatikā; whatever produce arises from Sālavatikā, the brahmin Lohicca alone should consume it and not give it to others.\" Such a speaker is an obstructer to those who depend on him. Being an obstructer, he is unsympathetic to their welfare. For one unsympathetic to their welfare, a hostile mind is present. When a hostile mind is present, there is wrong view.\n\nIn the same way, Lohicca, if someone were to say this: \"Here, if a recluse or brahmin should attain a wholesome teaching, having attained a wholesome teaching, he should not declare it to others, for what indeed can another do for another? Just as if, having cut off an old bond, one were to make another new bond, so will one accomplish it.\" Such a speaker is an obstructer to those young men of good family who, relying on the Dhamma-Vinaya declared by the Tathāgata, attain such an excellent distinction – who realize the fruit of stream-entry, who realize the fruit of once-returning, who realize the fruit of non-returning, who realize Arahatship, and who develop the divine potential for rebirth in divine realms. Being an obstructer, he is unsympathetic to their welfare. For one unsympathetic to their welfare, a hostile mind is present. When a hostile mind is present, there is wrong view. Indeed, Lohicca, for one with wrong view, I declare one of two destinations: either hell or the animal realm.",
      "sinhala": "“ලෝහිච්ච, යම් කෙනෙක් මෙසේ කියන්නේ නම් - ‘ලෝහිච්ච බ්‍රාහ්මණයා සාලවතිකා නම් ගමේ වාසය කරයි; සාලවතිකාවෙන් සම්භවය වන දෙය ඒ ලෝහිච්ච බ්‍රාහ්මණයාම තනිව පරිභෝජනය කළ යුතුයි, අන් අයට නොදිය යුතුයි’ කියාය. මෙසේ කියන්නා වූ ඔහු තමාගෙන් යැපෙන්නා වූ අයට බාධා කරන්නෙක් වේ. බාධා කරන්නෙක් වූ කල්හි, ඔවුන්ගේ යහපත නොපතන කෙනෙක් වේ. ඔවුන්ගේ යහපත නොපතන කෙනාට සතුරු සිතක් පහළ වී ඇත. සතුරු සිතක් පහළ වූ කල්හි මිත්‍යා දෘෂ්ටියක් ඇති වේ.\n\nඑලෙසින්ම ලෝහිච්ච, යම් කෙනෙක් මෙසේ කියන්නේ නම් - ‘මෙලොව ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ කුසල ධර්මයක් අවබෝධ කරගත්තත්, ඒ කුසල ධර්මය අවබෝධ කරගෙන අන් අයට ප්‍රකාශ නොකළ යුතුයි. පරණ බැමි සිඳ අලුත් බැමි කරන්නේ යම්සේද, එසේම ක්‍රියා කළ යුතුයි කියාය.’ මෙසේ කියන්නා වූ ඔහු, තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ධර්ම විනය අරභයා මෙබඳු උසස් විශේෂයක් අවබෝධ කරගන්නා වූ, සෝතාපත්ති ඵලයත් සාක්ෂාත් කරගන්නා වූ, සකදාගාමී ඵලයත් සාක්ෂාත් කරගන්නා වූ, අනාගාමී ඵලයත් සාක්ෂාත් කරගන්නා වූ, අරහත්වයත් සාක්ෂාත් කරගන්නා වූ, තවද යම් මේ දිව්‍යමය භාවයන් දිව්‍ය භවයන්හි උපත සඳහා පරිපූර්ණ කරගන්නා වූ, ඒ කුල පුත්‍රයන්ට බාධා කරන්නෙක් වේ. බාධා කරන්නෙක් වූ කල්හි, ඔවුන්ගේ යහපත නොපතන කෙනෙක් වේ. ඔවුන්ගේ යහපත නොපතන කෙනාට සතුරු සිතක් පහළ වී ඇත. සතුරු සිතක් පහළ වූ කල්හි මිත්‍යා දෘෂ්ටියක් ඇති වේ. ලෝහිච්ච, මිත්‍යා දෘෂ්ටියක් ඇති කෙනාට නම් මම ගති දෙකෙන් එක ගතියක් කියමි - නිරය හෝ තිරිසන් යෝනිය හෝ.",
      "paliTitle": ""
    },
    {
      "number": 512,
      "pali": "‘‘Iti kira, lohicca, yo evaṃ vadeyya – ‘‘rājā pasenadi kosalo kāsikosalaṃ ajjhāvasati; yā kāsikosale samudayasañjāti, rājāva taṃ pasenadi kosalo ekako paribhuñjeyya, na aññesaṃ dadeyyā’’ti. Evaṃvādī so ye rājānaṃ pasenadiṃ kosalaṃ upajīvanti tumhe ceva aññe ca, tesaṃ antarāyakaro hoti. Antarāyakaro samāno ahitānukampī hoti, ahitānukampissa sapattakaṃ cittaṃ paccupaṭṭhitaṃ hoti, sapattake citte paccupaṭṭhite micchādiṭṭhi hoti. Evameva kho, lohicca, yo evaṃ vadeyya – ‘‘idha samaṇo vā brāhmaṇo vā kusalaṃ dhammaṃ adhigaccheyya, kusalaṃ dhammaṃ adhigantvā na parassa āroceyya, kiñhi paro parassa karissati. Seyyathāpi nāma…pe… kiñhi paro parassa karissatī’’ti, evaṃ vādī so ye te kulaputtā tathāgatappaveditaṃ dhammavinayaṃ āgamma evarūpaṃ uḷāraṃ visesaṃ adhigacchanti, sotāpattiphalampi sacchikaronti, sakadāgāmiphalampi sacchikaronti, anāgāmiphalampi sacchikaronti, arahattampi sacchikaronti. Ye cime dibbā gabbhā paripācenti dibbānaṃ bhavānaṃ abhinibbattiyā, tesaṃ antarāyakaro hoti, antarāyakaro samāno ahitānukampī hoti, ahitānukampissa sapattakaṃ cittaṃ paccupaṭṭhitaṃ hoti, sapattake citte paccupaṭṭhite micchādiṭṭhi hoti. Micchādiṭṭhissa kho ahaṃ, lohicca, dvinnaṃ gatīnaṃ aññataraṃ gatiṃ vadāmi – nirayaṃ vā tiracchānayoniṃ vā. ",
      "english": "It is as if, Lohicca, someone were to say: ‘King Pasenadi of Kosala dwells in Kasi-Kosala; whatever produce arises in Kasi-Kosala, King Pasenadi of Kosala alone should consume it, and not give it to others.’ One who speaks thus becomes an obstructer to those who depend on King Pasenadi of Kosala, both you and others. Being an obstructer, he is one who has no compassion for others' welfare. One who has no compassion for others' welfare has a hostile mind arisen. When a hostile mind has arisen, there is wrong view. Even so, Lohicca, if someone were to say: ‘Here, a recluse or a brahmin might attain a wholesome teaching; having attained a wholesome teaching, they should not declare it to others, for what can one person do for another? Just as... what can one person do for another?’ One who speaks thus becomes an obstructer to those noble sons who, having relied on the Dhamma and Discipline proclaimed by the Tathāgata, attain such a supreme distinction: they realize the fruit of stream-entry, they realize the fruit of once-returning, they realize the fruit of non-returning, and they realize arahantship. And also to those beings ripening for birth in divine realms, he becomes an obstructer. Being an obstructer, he is one who has no compassion for others' welfare. One who has no compassion for others' welfare has a hostile mind arisen. When a hostile mind has arisen, there is wrong view. For one with wrong view, Lohicca, I declare one of two destinations: hell or the animal realm.",
      "sinhala": "ලෝහිච්චය, යමෙක් මෙසේ කියන්නේ නම්: ‘‘කෝසල රජු වූ පසේනදී කාසිකෝසලයෙහි වසයි; කාසිකෝසලයෙහි ඇතිවන සියලු ධනය කෝසල රජු වූ පසේනදී තනිවම පරිභෝග කළ යුතුයි, අන්‍යයන්ට නොදිය යුතුයි’’ කියාය. මෙසේ කියන්නා වූ ඔහු, කෝසල රජු වූ පසේනදී රජු යැපෙන්නා වූ ඔබටත් අන්‍යයන්ටත් බාධා කරන්නෙක් වේ. බාධා කරන්නෙක් වන ඔහු අහිතානුකම්පී වේ. අහිතානුකම්පී වූ තැනැත්තාට සතුරු සිතක් ඇතිවේ. සතුරු සිතක් ඇති වූ කල්හි මිත්‍යාදෘෂ්ටිය ඇතිවේ.\n\nලෝහිච්චය, එසේම යමෙක් මෙසේ කියන්නේ නම්: ‘‘මෙලොව යම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් කුසල ධර්මයක් අවබෝධ කරගන්නේ නම්, ඒ කුසල ධර්මය අවබෝධ කරගෙන එය අන්‍යයෙකුට නොකිය යුතුයි, මන්ද අන්‍යයෙක් තවත් අන්‍යයෙකුට කුමක් කරන්නේදැ’’යි කියාය. මෙසේ කියන්නා වූ ඔහු, තථාගතයන් වහන්සේ විසින් ප්‍රවේදිත කරන ලද ධර්මවිනය අරමුණු කරගෙන මෙබඳු ශ්‍රේෂ්ඨ විශේෂත්වයක් ලබන, සෝතාපත්තිඵලයද, සකදාගාමිඵලයද, අනාගාමිඵලයද, අරහත්තයද සාක්ෂාත් කරගන්නා ඒ කුලපුත්‍රයන්ටද, දිව්‍ය භවයන්හි උපත සඳහා දිව්‍යමය ගර්භයන් පරිපාචනය කරන්නා වූ අයටද බාධා කරන්නෙක් වේ. බාධා කරන්නෙක් වන ඔහු අහිතානුකම්පී වේ. අහිතානුකම්පී වූ තැනැත්තාට සතුරු සිතක් ඇතිවේ. සතුරු සිතක් ඇති වූ කල්හි මිත්‍යාදෘෂ්ටිය ඇතිවේ. ලෝහිච්චය, මිත්‍යාදෘෂ්ටිය ඇත්තාට මම ගති දෙකෙන් එකක් කියමි – නිරය හෝ තිරිසන් යෝනිය වේ.",
      "paliTitle": ""
    },
    {
      "number": 513,
      "pali": "‘‘Tayo khome, lohicca, satthāro, ye loke codanārahā; yo ca panevarūpe satthāro codeti, sā codanā bhūtā tacchā dhammikā anavajjā. Katame tayo? Idha, lohicca, ekacco satthā yassatthāya agārasmā anagāriyaṃ pabbajito hoti, svāssa sāmaññattho ananuppatto hoti. So taṃ sāmaññatthaṃ ananupāpuṇitvā sāvakānaṃ dhammaṃ deseti – ‘‘idaṃ vo hitāya idaṃ vo sukhāyā’’ti. Tassa sāvakā na sussūsanti, na sotaṃ odahanti, na aññā cittaṃ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. So evamassa codetabbo – ‘‘āyasmā kho yassatthāya agārasmā anagāriyaṃ pabbajito, so te sāmaññattho ananuppatto, taṃ tvaṃ sāmaññatthaṃ ananupāpuṇitvā sāvakānaṃ dhammaṃ desesi – ‘idaṃ vo hitāya idaṃ vo sukhāyā’ti. Tassa te sāvakā na sussūsanti, na sotaṃ odahanti, na aññā cittaṃ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. Seyyathāpi nāma osakkantiyā vā ussakkeyya, parammukhiṃ vā āliṅgeyya, evaṃ sampadamidaṃ pāpakaṃ lobhadhammaṃ vadāmi – kiñhi paro parassa karissatī’’ti. Ayaṃ kho, lohicca, paṭhamo satthā, yo loke codanāraho; yo ca panevarūpaṃ satthāraṃ codeti, sā codanā bhūtā tacchā dhammikā anavajjā.",
      "english": "There are these three teachers, Lohicca, who are deserving of reproach in the world. And whoever reproaches such teachers, that reproach is factual, true, righteous, and blameless. Which three?\n\nHere, Lohicca, some teacher, for the sake of which he has gone forth from home into homelessness, that goal of recluseship is not attained by him. Having not attained that goal of recluseship, he teaches the Dhamma to his disciples, saying: ‘This is for your welfare, this is for your happiness.’ His disciples do not listen intently, they do not lend an ear, they do not apply their minds to understanding, and they conduct themselves contrary to the teacher’s instruction. Such a one should be reproached thus: ‘Venerable sir, for the sake of which you went forth from home into homelessness, that goal of recluseship is not attained by you. Having not attained that goal of recluseship, you teach the Dhamma to your disciples, saying: ‘This is for your welfare, this is for your happiness.’ Yet, those disciples of yours do not listen intently, they do not lend an ear, they do not apply their minds to understanding, and they conduct themselves contrary to the teacher’s instruction. Just as one might try to pull back someone who is pulling away, or embrace someone who is turning their back, so do I declare this to be an evil quality of greed. For what, indeed, will one person do for another?’ This, Lohicca, is the first teacher who is deserving of reproach in the world. And whoever reproaches such a teacher, that reproach is factual, true, righteous, and blameless.",
      "sinhala": "ලෝහිච්චයෙනි, ලොවෙහි නින්දාවට සුදුසු ශාස්තෘවරු තිදෙනෙක් වෙති. යමෙක් එවැනි ශාස්තෘවරුන්ට නින්දා කරන්නේද, ඒ නින්දාව සත්‍යය, යථාර්ථය, ධර්මානුකූලය, නිවැරදිය. ඒ තිදෙනා කවරහුද? ලෝහිච්චයෙනි, මේ ලෝකයේ සමහර ශාස්තෘවරයෙක් යම් අර්ථයක් සඳහා ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වී සිටීද, ඔහුට ඒ ශ්‍රමණ අර්ථය නොලැබී තිබේ. ඔහු ඒ ශ්‍රමණ අර්ථය නොලබාම ශ්‍රාවකයන්ට ධර්මය දේශනා කරයි – ‘මෙය ඔබට හිත පිණිසයි, මෙය ඔබට සුව පිණිසයි’ කියා. ඔහුගේ ශ්‍රාවකයෝ සවන් නොදෙති, කන් යොමු නොකරති, අවබෝධය පිණිස සිත නොපවත්වා සිටිති, ශාස්තෘවරයාගේ ශාසනයෙන් ඉවතට ගොස් කටයුතු කරති. ඔහු මෙසේ නින්දා කළ යුත්තෙකි: ‘ආයුෂ්මත් වහන්සේ යම් අර්ථයක් සඳහා ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වූ සේක්ද, ඒ ශ්‍රමණ අර්ථය ඔබට නොලැබී තිබේ. ඔබ ඒ ශ්‍රමණ අර්ථය නොලබාම ශ්‍රාවකයන්ට ‘මෙය ඔබට හිත පිණිසයි, මෙය ඔබට සුව පිණිසයි’ කියා ධර්මය දේශනා කරන්නෙහි. ඔබේ ඒ ශ්‍රාවකයෝ සවන් නොදෙති, කන් යොමු නොකරති, අවබෝධය පිණිස සිත නොපවත්වා සිටිති, ශාස්තෘවරයාගේ ශාසනයෙන් ඉවතට ගොස් කටයුතු කරති. යම්සේ පලා යන ස්ත්‍රියක් හෝ පසුපසින් ගොස් ළං වීමට උත්සාහ කරන්නාක් මෙන්, පිටුපා සිටින ස්ත්‍රියක් හෝ වැළඳ ගන්නාක් මෙන්, මේ පාපකාරී ලෝභ ධර්මයත් එබඳුම යැයි මම කියමි – අන්‍යයෙක් අන්‍යයෙකුට කුමක් කරන්නේද?’ ලෝහිච්චයෙනි, ලොවෙහි නින්දාවට සුදුසු පළමු ශාස්තෘවරයා මොහුය. යමෙක් එවැනි ශාස්තෘවරයෙකුට නින්දා කරන්නේද, ඒ නින්දාව සත්‍යය, යථාර්ථය, ධර්මානුකූලය, නිවැරදිය.",
      "paliTitle": "Tayo codanārahā",
      "englishTitle": "Three deserving accusation",
      "sinhalaTitle": "දොස් පැවරිය යුතු තිදෙනා"
    },
    {
      "number": 514,
      "pali": "‘‘Puna caparaṃ, lohicca, idhekacco satthā yassatthāya agārasmā anagāriyaṃ pabbajito hoti, svāssa sāmaññattho ananuppatto hoti. So taṃ sāmaññatthaṃ ananupāpuṇitvā sāvakānaṃ dhammaṃ deseti – ‘‘idaṃ vo hitāya, idaṃ vo sukhāyā’’ti. Tassa sāvakā sussūsanti, sotaṃ odahanti, aññā cittaṃ upaṭṭhapenti, na ca vokkamma satthusāsanā vattanti. So evamassa codetabbo – ‘‘āyasmā kho yassatthāya agārasmā anagāriyaṃ pabbajito, so te sāmaññattho ananuppatto. Taṃ tvaṃ sāmaññatthaṃ ananupāpuṇitvā sāvakānaṃ dhammaṃ desesi – ‘idaṃ vo hitāya idaṃ vo sukhāyā’ti. Tassa te sāvakā sussūsanti, sotaṃ odahanti, aññā cittaṃ upaṭṭhapenti, na ca vokkamma satthusāsanā vattanti. Seyyathāpi nāma sakaṃ khettaṃ ohāya paraṃ khettaṃ niddāyitabbaṃ maññeyya, evaṃ sampadamidaṃ pāpakaṃ lobhadhammaṃ vadāmi – kiñhi paro parassa karissatī’’ti. Ayaṃ kho, lohicca, dutiyo satthā, yo, loke codanāraho; yo ca panevarūpaṃ satthāraṃ codeti, sā codanā bhūtā tacchā dhammikā anavajjā.",
      "english": "Furthermore, Lohicca, here some teacher, for whatever purpose he has gone forth from home to homelessness, has not attained that goal of recluseship. Not having attained that goal of recluseship, he teaches the Dhamma to his disciples, saying, “This is for your welfare, this is for your happiness.” His disciples listen eagerly, lend ear, apply their minds to understanding, and do not act contrary to the teacher’s instruction.\n\nHe should be reproached thus: “Venerable sir, for whatever purpose you went forth from home to homelessness, that goal of recluseship has not been attained by you. Not having attained that goal of recluseship, you teach the Dhamma to your disciples, saying, ‘This is for your welfare, this is for your happiness.’ Yet, your disciples listen eagerly, lend ear, apply their minds to understanding, and do not act contrary to the teacher’s instruction. Just as if someone, abandoning their own field, were to think they should harvest another’s field, in this same way I say this is a wicked, greedy practice. For what indeed can one do for another?” This, Lohicca, is the second kind of teacher who is worthy of reproach in the world. And whoever reproaches such a teacher, that reproach is factual, true, righteous, and blameless.",
      "sinhala": "නැවතද, ලෝහිච්චයෙනි, මෙහි ඇතැම් ශාස්තෘවරයෙක් යම් අර්ථයක් පිණිස ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූයේ ද, ඔහුට ඒ ශ්‍ර‍මණ අර්ථය නොලැබී පවතී. ඔහු ඒ ශ්‍ර‍මණ අර්ථය නොලබාම ශ්‍රා‍වකයන්ට ‘මේ ඔබට හිත පිණිස ය, මේ ඔබට සැප පිණිස ය’ යනුවෙන් ධර්‍මය දේශනා කරයි. ඔහුගේ ශ්‍රා‍වකයෝ හොඳින් අසති, සවන් යොමු කරති, අවබෝධය පිණිස සිත පිහිටුවා ගනිති, ශාස්තෘවරයාගේ අනුශාසනාව ඉක්මවා නොහැසිරෙති. ඔහු මෙසේ චෝදනා කළ යුත්තේ ය – ‘ආයුෂ්මත් වහන්සේ යම් අර්ථයක් පිණිස ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වූ සේක් ද, ඒ ශ්‍ර‍මණ අර්ථය ඔබට නොලැබී පවතී. ඔබ ඒ ශ්‍ර‍මණ අර්ථය නොලබාම ශ්‍රා‍වකයන්ට ‘මේ ඔබට හිත පිණිස ය, මේ ඔබට සැප පිණිස ය’ යනුවෙන් ධර්‍මය දේශනා කරන්නෙහි ය. ඔබේ ඒ ශ්‍රා‍වකයෝ හොඳින් අසති, සවන් යොමු කරති, අවබෝධය පිණිස සිත පිහිටුවා ගනිති, ශාස්තෘවරයාගේ අනුශාසනාව ඉක්මවා නොහැසිරෙති. යම්සේ යමෙක් තමාගේ කුඹුර අත්හැර දමා අනුන්ගේ කුඹුර නෙලිය යුතු යැයි සිතන්නේ ද, මේ උපමාව එම පාපී ලෝභ ධර්‍මය හා සමාන යැයි මම කියමි – ‘අනුන් අනුන් හට කුමක් කරන්නේ ද?’ යනුවෙන්.’ ලෝහිච්චයෙනි, ලොව චෝදනාවට සුදුසු වූ දෙවන ශාස්තෘවරයා මොහු ය. යමෙක් මෙබඳු ශාස්තෘවරයෙකුට චෝදනා කරන්නේ ද, ඒ චෝදනාව සත්‍ය වූ, යථාභූත වූ, ධර්‍මානුකූල වූ, නිර්දෝෂී එකක් වන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 515,
      "pali": "‘‘Puna caparaṃ, lohicca, idhekacco satthā yassatthāya agārasmā anagāriyaṃ pabbajito hoti, svāssa sāmaññattho anuppatto hoti. So taṃ sāmaññatthaṃ anupāpuṇitvā sāvakānaṃ dhammaṃ deseti – ‘‘idaṃ vo hitāya idaṃ vo sukhāyā’’ti. Tassa sāvakā na sussūsanti, na sotaṃ odahanti, na aññā cittaṃ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. So evamassa codetabbo – ‘‘āyasmā kho yassatthāya agārasmā anagāriyaṃ pabbajito, so te sāmaññattho anuppatto. Taṃ tvaṃ sāmaññatthaṃ anupāpuṇitvā sāvakānaṃ dhammaṃ desesi – ‘idaṃ vo hitāya idaṃ vo sukhāyā’ti. Tassa te sāvakā na sussūsanti, na sotaṃ odahanti, na aññā cittaṃ upaṭṭhapenti, vokkamma ca satthusāsanā vattanti. Seyyathāpi nāma purāṇaṃ bandhanaṃ chinditvā aññaṃ navaṃ bandhanaṃ kareyya, evaṃ sampadamidaṃ pāpakaṃ lobhadhammaṃ vadāmi, kiñhi paro parassa karissatī’’ti. Ayaṃ kho, lohicca, tatiyo satthā, yo loke codanāraho; yo ca panevarūpaṃ satthāraṃ codeti, sā codanā bhūtā tacchā dhammikā anavajjā. Ime kho, lohicca, tayo satthāro, ye loke codanārahā, yo ca panevarūpe satthāro codeti, sā codanā bhūtā tacchā dhammikā anavajjāti. ",
      "english": "Furthermore, Lohicca, here some teacher, for the sake of which he went forth from home into homelessness, has attained that very goal of recluseship. Having attained that goal of recluseship, he teaches the Dhamma to his disciples – \"This is for your welfare, this is for your happiness.\" His disciples do not listen attentively, do not lend an ear, do not set their minds on knowledge, but act contrary to the teacher's instruction. He should be rebuked thus – \"Venerable sir, for the sake of which you went forth from home into homelessness, that goal of recluseship has been attained by you. Having attained that goal of recluseship, you teach the Dhamma to your disciples – 'This is for your welfare, this is for your happiness.' Yet your disciples do not listen attentively, do not lend an ear, do not set their minds on knowledge, but act contrary to the teacher's instruction. Just as if one were to cut an old bond and make another new bond, even so I declare this to be an evil quality of greed, for what indeed can one person do for another?\" This, Lohicca, is the third type of teacher in the world worthy of rebuke; and whoever rebukes such a teacher, that rebuke is factual, true, righteous, and blameless.\n\nThese, Lohicca, are the three types of teachers in the world who are worthy of rebuke, and whoever rebukes such teachers, that rebuke is factual, true, righteous, and blameless.",
      "sinhala": "තවද, ලෝහිච්චයෙනි, මෙහි ඇතැම් ශාස්තෘවරයෙක් යම් අර්ථයක් පිණිස ගිහිගෙන් නික්ම මහණ වී ඇද්ද, ඒ ශ්‍රමණාර්ථය ඔහුට ලැබී තිබේ. ඔහු ඒ ශ්‍රමණාර්ථය ලබාගෙන ශ්‍රාවකයන්ට \"මේ ඔබට හිත පිණිසය, මේ ඔබට සුව පිණිසය\" යනුවෙන් ධ‍ර්මය දේශනා කරයි. ඔහුගේ ශ්‍රාවකයෝ සවන් නොදෙති, කන් නොයොදති, දැනීම පිණිස සිත පිහිටුවා නොගනිති, ශාස්තෘවරයාගේ ශාසනයෙන් බැහැරව හැසිරෙති. ඔහුට මෙසේ චෝදනා කළ යුතුය: \"ආයුෂ්මත් වහන්ස, යම් අර්ථයක් පිණිස ගිහිගෙන් නික්ම මහණ වූවෙහිද, ඒ ශ්‍රමණාර්ථය ඔබට ලැබී තිබේ. ඔබ ඒ ශ්‍රමණාර්ථය ලබාගෙන ශ්‍රාවකයන්ට ‘මේ ඔබට හිත පිණිසය, මේ ඔබට සුව පිණිසය’ යනුවෙන් ධ‍ර්මය දේශනා කරන්නෙහි. ඔබේ ඒ ශ්‍රාවකයෝ සවන් නොදෙති, කන් නොයොදති, දැනීම පිණිස සිත පිහිටුවා නොගනිති, ශාස්තෘවරයාගේ ශාසනයෙන් බැහැරව හැසිරෙති. යම් සේ පැරණි බැම්මක් සිඳ දමා අලුත් බැම්මක් කෙරේද, මේ සපිරුණු පාපී ලෝභ ධ‍ර්මය මෙබඳු යැයි මම කියමි, අන් අය අන් අයට කුමක් කරත්දැයි.\" ලෝහිච්චයෙනි, මේ ලෝකයෙහි චෝදනාවට සුදුසු තෙවැනි ශාස්තෘවරයා යි. යමෙක් මෙබඳු ශාස්තෘවරයෙකුට චෝදනා කෙරේද, ඒ චෝදනාව භූතය, සත්‍යය, ධා‍ර්මිකය, නිවැරදිය. ලෝහිච්චයෙනි, මේ ලෝකයෙහි චෝදනාවට සුදුසු ශාස්තෘවරු තිදෙනා යි. යමෙක් මෙබඳු ශාස්තෘවරුන්ට චෝදනා කෙරේද, ඒ චෝදනාව භූතය, සත්‍යය, ධා‍ර්මිකය, නිවැරදිය.",
      "paliTitle": ""
    },
    {
      "number": 516,
      "pali": "Evaṃ vutte, lohicco brāhmaṇo bhagavantaṃ etadavoca – ‘‘atthi pana, bho gotama, koci satthā, yo loke nacodanāraho’’ti? ‘‘Atthi kho, lohicca, satthā, yo loke nacodanāraho’’ti. ‘‘Katamo pana so, bho gotama, satthā, yo loke nacodanāraho’’ti? ‘‘Idha, lohicca, tathāgato loke uppajjati arahaṃ, sammāsambuddho…pe… (yathā 190-212 anucchedesu evaṃ vitthāretabbaṃ). Evaṃ kho, lohicca, bhikkhu sīlasampanno hoti…pe… paṭhamaṃ jhānaṃ upasampajja viharati… yasmiṃ kho, lohicca, satthari sāvako evarūpaṃ uḷāraṃ visesaṃ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho. Yo ca panevarūpaṃ satthāraṃ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Yasmiṃ kho, lohicca, satthari sāvako evarūpaṃ uḷāraṃ visesaṃ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho, yo ca panevarūpaṃ satthāraṃ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā… ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti…pe… yasmiṃ kho, lohicca, satthari sāvako evarūpaṃ uḷāraṃ visesaṃ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho, yo ca panevarūpaṃ satthāraṃ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā… nāparaṃ itthattāyāti pajānāti. Yasmiṃ kho, lohicca, satthari sāvako evarūpaṃ uḷāraṃ visesaṃ adhigacchati, ayampi kho, lohicca, satthā, yo loke nacodanāraho, yo ca panevarūpaṃ satthāraṃ codeti, sā codanā abhūtā atacchā adhammikā sāvajjā’’ti.",
      "english": "When this was said, the brahmin Lohicca said to the Blessed One: \"But is there, good Gotama, any teacher in the world who is not to be reproached?\"\n\"Indeed, Lohicca, there is a teacher in the world who is not to be reproached.\"\n\"But who is that teacher, good Gotama, who is not to be reproached?\"\n\n\"Here, Lohicca, a Tathāgata arises in the world, an Arahant, a Fully Self-Enlightened One, perfect in true knowledge and conduct, sublime, knower of worlds, unsurpassed leader of persons to be tamed, teacher of devas and humans, the Buddha, the Blessed One. He makes known this world with its devas, Māras, and Brahmās, this generation with its ascetics and brahmins, its devas and humans, having directly realized it for himself. He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing, and he proclaims the perfectly complete and purified holy life. A householder or a householder’s son, or someone born in another family, hears that Dhamma. Having heard it, he acquires faith in the Tathāgata. Possessed of that faith, he reflects: ‘A constricted thing is household life, a path of dust; the going forth is open air. It is not easy for one living at home to practice the holy life utterly perfect, utterly pure, like a polished conch shell. What if I were to shave off my hair and beard, put on saffron robes, and go forth from home into homelessness?’ After some time, abandoning a small or large fortune, abandoning a small or large circle of relatives, he shaves off his hair and beard, puts on saffron robes, and goes forth from home into homelessness. Having gone forth, he lives practicing the code of conduct for monks, subsisting on alms food, observing the rules of conduct, seeing danger in the slightest faults. He undertakes and trains himself in the precepts. Thus, Lohicca, a monk is endowed with virtue. He guards the doors of his sense faculties. He is endowed with mindfulness and clear comprehension. He is contented with whatever requisites he receives. Having abandoned these five hindrances—sensual desire, ill will, sloth and torpor, restlessness and remorse, and doubt—corruptions of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and dwells in the first jhāna, which is accompanied by applied and sustained thought, born of seclusion, and filled with rapture and pleasure. In a teacher such as this, Lohicca, a disciple attains such an excellent distinction. This too, Lohicca, is a teacher in the world who is not to be reproached. And whoever reproaches such a teacher, that reproach is false, untrue, unrighteous, and blameworthy. With the subsiding of applied and sustained thought, through the gaining of inner tranquillity and oneness of mind, he enters upon and dwells in the second jhāna, which is without applied and sustained thought, born of concentration, and filled with rapture and pleasure. In a teacher such as this, Lohicca, a disciple attains such an excellent distinction. This too, Lohicca, is a teacher in the world who is not to be reproached. And whoever reproaches such a teacher, that reproach is false, untrue, unrighteous, and blameworthy. With the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences pleasure with the body; he enters upon and dwells in the third jhāna, of which the Noble Ones declare: ‘He is equanimous and mindful, he dwells in pleasure.’ In a teacher such as this, Lohicca, a disciple attains such an excellent distinction. This too, Lohicca, is a teacher in the world who is not to be reproached. And whoever reproaches such a teacher, that reproach is false, untrue, unrighteous, and blameworthy. With the abandonment of pleasure and pain, and with the prior disappearance of joy and grief, he enters upon and dwells in the fourth jhāna, which is neither painful nor pleasant, and purified by equanimity and mindfulness. In a teacher such as this, Lohicca, a disciple attains such an excellent distinction. This too, Lohicca, is a teacher in the world who is not to be reproached. And whoever reproaches such a teacher, that reproach is false, untrue, unrighteous, and blameworthy. He directs and inclines his mind to the knowledge of the destruction of the taints. He directly knows: ‘These are the taints,’ ‘This is the origin of the taints,’ ‘This is the cessation of the taints,’ and ‘This is the path to the cessation of the taints.’ He directly knows: ‘My mind is liberated from the taint of sensual desire, from the taint of becoming, and from the taint of ignorance.’ When liberated, there arises the knowledge: ‘Liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no further state of being for me.’ In a teacher such as this, Lohicca, a disciple attains such an excellent distinction. This too, Lohicca, is a teacher in the world who is not to be reproached. And whoever reproaches such a teacher, that reproach is false, untrue, unrighteous, and blameworthy.\"",
      "sinhala": "මෙසේ කී කල්හි, ලෝහිච්ච බමුණා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භවත් ගෞතමයෙනි, ලොව දොස් පැවරීමට නුසුදුසු වූ කිසියම් ශාස්තෘවරයෙක් ඇත්තේද?” “ලෝහිච්චය, දොස් පැවරීමට නුසුදුසු වූ ශාස්තෘවරයෙක් ඇත්තේමය.” “එසේ නම් භවත් ගෞතමයෙනි, ලොව දොස් පැවරීමට නුසුදුසු වූ ඒ ශාස්තෘවරයා කවරෙක්ද?” “ලෝහිච්චය, මෙහිලා තථාගතයන් වහන්සේ ලොව පහළවෙති. රහත් වූ, සම්මා සම්බුද්ධ වූ, විද්‍යාචරණ සම්පන්න වූ, සුගත වූ, ලෝක විදූ වූ, අනුත්තර පුරිසදම්ම සාරථී වූ, දෙවිමිනිසුන්ගේ ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවතුන් වහන්සේ කෙනෙක්. මෙසේ ලෝහිච්චය, භික්ෂුව සීලයෙන් යුක්ත වෙයි, ඔහු පළමු ධ්‍යානය උපදවාගෙන වාසය කරයි. ලෝහිච්චය, යම් ශාස්තෘවරයෙකු තුළ ශ්‍රාවකයෙක් මෙබඳු උතුම් විශේෂයක් ලබයි ද, ලෝහිච්චය, මේද ලොව දොස් පැවරීමට නුසුදුසු වූ ශාස්තෘවරයාය. යමෙක් මෙබඳු ශාස්තෘවරයෙකුට දොස් පවරන්නේද, ඒ දෝෂාරෝපණය අභූතය, අසත්‍යය, අධාර්මිකය, වරද සහිතය. ඔහු දෙවෙනි ධ්‍යානය උපදවාගෙන වාසය කරයි. ලෝහිච්චය, යම් ශාස්තෘවරයෙකු තුළ ශ්‍රාවකයෙක් මෙබඳු උතුම් විශේෂයක් ලබයි ද, ලෝහිච්චය, මේද ලොව දොස් පැවරීමට නුසුදුසු වූ ශාස්තෘවරයාය. යමෙක් මෙබඳු ශාස්තෘවරයෙකුට දොස් පවරන්නේද, ඒ දෝෂාරෝපණය අභූතය, අසත්‍යය, අධාර්මිකය, වරද සහිතය. ඔහු තෙවෙනි ධ්‍යානය උපදවාගෙන වාසය කරයි. ලෝහිච්චය, යම් ශාස්තෘවරයෙකු තුළ ශ්‍රාවකයෙක් මෙබඳු උතුම් විශේෂයක් ලබයි ද, ලෝහිච්චය, මේද ලොව දොස් පැවරීමට නුසුදුසු වූ ශාස්තෘවරයාය. යමෙක් මෙබඳු ශාස්තෘවරයෙකුට දොස් පවරන්නේද, ඒ දෝෂාරෝපණය අභූතය, අසත්‍යය, අධාර්මිකය, වරද සහිතය. ඔහු සතරවෙනි ධ්‍යානය උපදවාගෙන වාසය කරයි. ලෝහිච්චය, යම් ශාස්තෘවරයෙකු තුළ ශ්‍රාවකයෙක් මෙබඳු උතුම් විශේෂයක් ලබයි ද, ලෝහිච්චය, මේද ලොව දොස් පැවරීමට නුසුදුසු වූ ශාස්තෘවරයාය. යමෙක් මෙබඳු ශාස්තෘවරයෙකුට දොස් පවරන්නේද, ඒ දෝෂාරෝපණය අභූතය, අසත්‍යය, අධාර්මිකය, වරද සහිතය. ඔහු ඥාණදර්ශනය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. නැවත මේ භවයට නොපැමිණෙන බව දනී. ලෝහිච්චය, යම් ශාස්තෘවරයෙකු තුළ ශ්‍රාවකයෙක් මෙබඳු උතුම් විශේෂයක් ලබයි ද, ලෝහිච්චය, මේද ලොව දොස් පැවරීමට නුසුදුසු වූ ශාස්තෘවරයාය. යමෙක් මෙබඳු ශාස්තෘවරයෙකුට දොස් පවරන්නේද, ඒ දෝෂාරෝපණය අභූතය, අසත්‍යය, අධාර්මිකය, වරද සහිතය.”",
      "paliTitle": "Nacodanārahasatthu",
      "englishTitle": "The Teacher Beyond Reproach",
      "sinhalaTitle": "අචෝදනීය ශාස්‍තෘ"
    },
    {
      "number": 517,
      "pali": "Evaṃ vutte, lohicco brāhmaṇo bhagavantaṃ etadavoca – ‘‘seyyathāpi, bho gotama, puriso purisaṃ narakapapātaṃ patantaṃ kesesu gahetvā uddharitvā thale patiṭṭhapeyya, evamevāhaṃ bhotā gotamena narakapapātaṃ papatanto uddharitvā thale patiṭṭhāpito. Abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama, seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, ‘cakkhumanto rūpāni dakkhantī’ti. Evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "When this was said, the brahmin Lohicca said to the Blessed One: “Just as, venerable Gotama, a person might seize another person by the hair as he was falling into a hellish pit, pull him up, and set him on firm ground, in the same way I, too, who was falling into a hellish pit, have been pulled up and set on firm ground by Master Gotama. Excellent, venerable Gotama! Excellent, venerable Gotama! Just as, venerable Gotama, one might set upright what was overturned, reveal what was hidden, show the way to one who was lost, or hold up an oil lamp in the darkness so that those with eyes might see forms, in the same way the Dhamma has been made clear in many ways by Master Gotama. I go for refuge to Master Gotama, and to the Dhamma, and to the Saṅgha of bhikkhus. May Master Gotama remember me as a lay follower who has gone for refuge from this day forward, as long as life lasts.”",
      "sinhala": "මෙසේ පැවසූ විට, ලෝහිච්ච බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය – “පින්වත් ගෞතමයන් වහන්ස, යම්සේ පුරුෂයෙක් නිරයගාමී පතනයකට වැටෙමින් සිටින පුරුෂයකු කෙස්වලින් අල්ලා ගොඩට ගෙන, ස්ථිර භූමියක පිහිටුවාද, එපරිද්දෙන්ම, නිරයගාමී පතනයකට වැටෙමින් සිටි මා, පින්වත් ගෞතමයන් වහන්සේ විසින් ගොඩට ගෙන, ස්ථිර භූමියක පිහිටුවන ලදී. අතිශයින් ශ්‍රේෂ්ඨයි, පින්වත් ගෞතමයන් වහන්ස, අතිශයින් ශ්‍රේෂ්ඨයි, පින්වත් ගෞතමයන් වහන්ස, පින්වත් ගෞතමයන් වහන්ස, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මග වරදවා ගත්තෙකුට මාර්ගය පෙන්වන්නේද, අන්ධකාරයෙහි තෙල් පහනක් දල්වන්නේද, ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යනුවෙන්, එපරිද්දෙන්ම, පින්වත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්‍මය ප්‍රකාශ කරන ලදී. මා භාග්‍යවත් ගෞතමයන් වහන්සේද, ධර්‍මයද, භික්ෂුසංඝයාද සරණ යමි. භාග්‍යවත් ගෞතමයන් වහන්ස, අද පටන් දිවි තිබෙන තුරා සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා.”",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Lohiccasuttaṃ niṭṭhitaṃ dvādasamaṃ.",
    "english": "The Twelfth Lohicca Sutta Concluded.",
    "sinhala": "දොළොස්වන ලෝහිච්ච සූත්‍‌රය නිමයි"
  }
}