{
  "id": "dn.1.1",
  "title": {
    "pali": "Brahmajālasuttaṃ",
    "english": "The Net of Brahma Discourse",
    "sinhala": "බ්‍රහ්මජාල සූත්‍රය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā antarā ca rājagahaṃ antarā ca nāḷandaṃ addhānamaggappaṭipanno hoti mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi. Suppiyopi kho paribbājako antarā ca rājagahaṃ antarā ca nāḷandaṃ addhānamaggappaṭipanno hoti saddhiṃ antevāsinā brahmadattena māṇavena. Tatra sudaṃ suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itiha te ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito anubandhā [anubaddhā (ka. sī. pī.)] honti bhikkhusaṅghañca.",
      "english": "Thus have I heard. At one time, the Blessed One was journeying along the high road between Rājagaha and Nāḷandā, together with a large assembly of monks, amounting to five hundred monks. Suppiya the wanderer was also journeying along the high road between Rājagaha and Nāḷandā, together with his pupil, the young man Brahmadatta. At that time, Suppiya the wanderer was, in various ways, speaking disparagingly of the Buddha, the Dhamma, and the Saṅgha. However, his pupil, the young man Brahmadatta, was, in various ways, speaking in praise of the Buddha, the Dhamma, and the Saṅgha. Thus, those two, teacher and pupil, speaking in direct contradiction to each other, were following close behind the Blessed One and the assembly of monks.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ පන්සියයක් පමණ වූ මහත් භික්ෂු සංඝයා සමඟ රජගහ නුවරත් නාලන්දා නුවරත් අතර මහා මාර්ගයෙහි ගමන් කරමින් සිටියාහුය. සුප්පිය නම් පරිබ්‍රාජකයාද තම අතවැසි බ්‍රහ්මදත්ත මාණවකයා සමඟ රජගහ නුවරත් නාලන්දා නුවරත් අතර මහා මාර්ගයෙහි ගමන් කරමින් සිටියේය. එහිදී සුප්පිය පරිබ්‍රාජකයා නොයෙක් අයුරින් බුදුරජාණන් වහන්සේගේද, ධර්මයේද, සංඝයාගේද අවර්ණ කියමින් සිටියේය. එහෙත් සුප්පිය පරිබ්‍රාජකයාගේ අතවැසි බ්‍රහ්මදත්ත මාණවකයා නොයෙක් අයුරින් බුදුරජාණන් වහන්සේගේද, ධර්මයේද, සංඝයාගේද වර්ණ කියමින් සිටියේය. මෙසේ ඒ ආචාර්ය හා අතවැසි දෙදෙනා එකිනෙකාට සම්පූර්ණයෙන් විරුද්ධ මත දරමින් භාග්‍යවතුන් වහන්සේගේ සහ භික්ෂු සංඝයාගේ පිටුපසින්ම ගමන් කළාහුය.",
      "paliTitle": "Paribbājakakathā",
      "englishTitle": "Talk on Wanderers",
      "sinhalaTitle": "පරිබ්‍රාජක කථා"
    },
    {
      "number": 2,
      "pali": "Atha kho bhagavā ambalaṭṭhikāyaṃ rājāgārake ekarattivāsaṃ upagacchi [upagañchi (sī. syā. kaṃ. pī.)] saddhiṃ bhikkhusaṅghena. Suppiyopi kho paribbājako ambalaṭṭhikāyaṃ rājāgārake ekarattivāsaṃ upagacchi [upagañchi (sī. syā. kaṃ. pī.)] antevāsinā brahmadattena māṇavena. Tatrapi sudaṃ suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itiha te ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā viharanti.",
      "english": "Then the Blessed One, together with the community of bhikkhus, undertook a one-night stay at the King's Rest House in Ambalaṭṭhikā.\n\nAnd Suppiya the wanderer too, along with his disciple, the young man Brahmadatta, undertook a one-night stay at the King's Rest House in Ambalaṭṭhikā.\n\nThere indeed, Suppiya the wanderer, in various ways, spoke dispraise of the Buddha, spoke dispraise of the Dhamma, and spoke dispraise of the Sangha. But Suppiya the wanderer's disciple, the young man Brahmadatta, in various ways, spoke praise of the Buddha, spoke praise of the Dhamma, and spoke praise of the Sangha.\n\nThus, those two—the teacher and the disciple—remained speaking in direct opposition to each other.",
      "sinhala": "ඉන්පසු භාග්‍යවතුන් වහන්සේ භික්ෂු සංඝයා සමඟ අම්බලට්ඨිකාවේ රජ ගෙයි එක රැයක් වාසය කළ සේක.\n\nසුප්පිය නම් පරිබ්‍රාජකයාද තම අන්තේවාසික බ්‍රහ්මදත්ත නම් මාණවකයා සමඟ අම්බලට්ඨිකාවේ රජ ගෙයි එක රැයක් වාසය කළේය.\n\nඑහිදී සුප්පිය පරිබ්‍රාජකයා නොයෙක් අයුරින් බුදුරදුන්ගේ අවගුණ දෙසයි, ධර්මයේ අවගුණ දෙසයි, සංඝයාගේ අවගුණ දෙසයි. එහෙත් සුප්පිය පරිබ්‍රාජකයාගේ අන්තේවාසික බ්‍රහ්මදත්ත නම් මාණවකයා නොයෙක් අයුරින් බුදුරදුන්ගේ ගුණ දෙසයි, ධර්මයේ ගුණ දෙසයි, සංඝයාගේ ගුණ දෙසයි.\n\nමෙසේ ඒ ගුරුවරයා සහ අන්තේවාසිකයා දෙදෙනා එකිනෙකාට සෘජුවම විරුද්ධවාදීව වාසය කළහ.",
      "paliTitle": ""
    },
    {
      "number": 3,
      "pali": "Atha kho sambahulānaṃ bhikkhūnaṃ rattiyā paccūsasamayaṃ paccuṭṭhitānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayaṃ saṅkhiyadhammo udapādi – ‘‘acchariyaṃ, āvuso, abbhutaṃ, āvuso, yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sattānaṃ nānādhimuttikatā suppaṭividitā. Ayañhi suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itihame ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito anubandhā honti bhikkhusaṅghañcā’’ti.",
      "english": "Then, at dawn, many bhikkhus, having risen and gathered, were sitting together in the pavilion, and this discussion arose among them: 'It is wonderful, friends, it is amazing, friends, how thoroughly understood is this diversity of dispositions among beings by the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Enlightened One. For this wanderer Suppiya, in various ways, speaks dispraise of the Buddha, speaks dispraise of the Dhamma, speaks dispraise of the Sangha; but Suppiya the wanderer's student, the young man Brahmadatta, in various ways, speaks praise of the Buddha, speaks praise of the Dhamma, speaks praise of the Sangha. Thus, these two, teacher and student, holding directly opposing views to each other, follow behind the Blessed One and the community of bhikkhus.'",
      "sinhala": "ඉතින්, බොහෝ භික්ෂූන් වහන්සේලා රාත්‍රියෙහි අලුයම පිබිදී මණ්ඩලමාලයේ රැස්ව වාඩි වී සිටියදී මේ කතාව ඇති විය: \"ආශ්චර්ය​යකි, ආයුෂ්මතුනි, පුදුම සහගතය, ආයුෂ්මතුනි! ඒ භාග්‍ය​වතුන් වහන්සේ විසින්, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මා සම්බුද්ධ වූ උන්වහන්සේ විසින් සත්ව​යන්ගේ නානාවිධ අධිමුක්තීන් මනා කොට අවබෝධ කර ඇත. මේ සුප්පිය පිරිවැජියා නොයෙක් අයුරින් බුදුරදුන්ගේ අවර්ණ කියයි, දහම්හි අවර්ණ කියයි, සඟුන්ගේ අවර්ණ කියයි; එහෙත් සුප්පිය පිරිවැජියාගේ ශිෂ්‍ය​යා වූ බ්‍රහ්ම​දත්ත මානවකයා නොයෙක් අයුරින් බුදුරදුන්ගේ වර්ණ කියයි, දහම්හි වර්ණ කියයි, සඟුන්ගේ වර්ණ කියයි. මෙසේ මේ ගුරු ශිෂ්‍ය​යන් දෙදෙනාම එකිනෙකාට මුළුමනින්ම විරුද්ධ මත දරනසුලු වූවාහු භාග්‍ය​වතුන් වහන්සේටත් භික්ෂු සංඝයාටත් පිටුපසින් පිටුපසින් අනුගමනය කරති.\"",
      "paliTitle": ""
    },
    {
      "number": 4,
      "pali": "Atha kho bhagavā tesaṃ bhikkhūnaṃ imaṃ saṅkhiyadhammaṃ viditvā yena maṇḍalamāḷo tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Nisajja kho bhagavā bhikkhū āmantesi – ‘‘kāyanuttha, bhikkhave, etarahi kathāya sannisinnā sannipatitā, kā ca pana vo antarākathā vippakatā’’ti? Evaṃ vutte te bhikkhū bhagavantaṃ etadavocuṃ – ‘‘idha, bhante, amhākaṃ rattiyā paccūsasamayaṃ paccuṭṭhitānaṃ maṇḍalamāḷe sannisinnānaṃ sannipatitānaṃ ayaṃ saṅkhiyadhammo udapādi – ‘acchariyaṃ, āvuso, abbhutaṃ, āvuso, yāvañcidaṃ tena bhagavatā jānatā passatā arahatā sammāsambuddhena sattānaṃ nānādhimuttikatā suppaṭividitā. Ayañhi suppiyo paribbājako anekapariyāyena buddhassa avaṇṇaṃ bhāsati, dhammassa avaṇṇaṃ bhāsati, saṅghassa avaṇṇaṃ bhāsati; suppiyassa pana paribbājakassa antevāsī brahmadatto māṇavo anekapariyāyena buddhassa vaṇṇaṃ bhāsati, dhammassa vaṇṇaṃ bhāsati, saṅghassa vaṇṇaṃ bhāsati. Itihame ubho ācariyantevāsī aññamaññassa ujuvipaccanīkavādā bhagavantaṃ piṭṭhito piṭṭhito anubandhā honti bhikkhusaṅghañcā’ti. Ayaṃ kho no, bhante, antarākathā vippakatā, atha bhagavā anuppatto’’ti.",
      "english": "Then, having understood this discussion among those monks, the Blessed One went to where the circular hall was; having approached, he sat down on the prepared seat. Having sat down, the Blessed One addressed the monks: \"Monks, what was the topic of conversation you were assembled and seated for just now? And what was the unfinished discussion among you?\" When this was said, those monks replied to the Blessed One: \"Here, Venerable Sir, as we rose in the last watch of the night, assembled and seated in the circular hall, this discussion arose for us: 'It is wonderful, friends, it is amazing, friends! How thoroughly understood by the Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, is the diversity of dispositions among beings! For this wanderer Suppiya, in various ways speaks dispraise of the Buddha, speaks dispraise of the Dhamma, speaks dispraise of the Saṅgha; but the pupil of the wanderer Suppiya, the young man Brahmadatta, in various ways speaks praise of the Buddha, speaks praise of the Dhamma, speaks praise of the Saṅgha. Thus these two, teacher and pupil, speaking directly contrary to each other, follow right behind the Blessed One and the assembly of monks.' This, Venerable Sir, was our unfinished discussion, when the Blessed One arrived.\"",
      "sinhala": "එවිට භාග්‍ය‌වතුන් වහන්සේ ඒ භික්ෂූන්ගේ මේ සාකච්ඡාව දැනගෙන මණ්ඩලමාලකය වෙත වැඩම කළ සේක; වැඩම කොට පනවන ලද අසුනක වැඩ හිඳ ගත් සේක. වැඩ සිටි භාග්‍ය‌වතුන් වහන්සේ භික්ෂූන් ඇමතූ සේක: \"මහණෙනි, දැන් ඔබ කුමන කථාවකින් එක්ව වාඩි වී සිටින්නහුද, රැස්ව සිටින්නහුද? ඔබගේ අතරමග නතර වූ කතාව කුමක්ද?\" මෙසේ කී කල්හි ඒ භික්ෂූහු භාග්‍ය‌වතුන් වහන්සේට මෙසේ කීහ: \"ස්වාමීනි, මෙහි අපට රාත්‍රියේ පහන් වූ පසු පිබිදී, මණ්ඩලමාලකයේ එක්ව වාඩි වී, රැස්ව සිටි අපට මේ සාකච්ඡාව ඇති විය: 'ඇවැත්නි, ආශ්චර්යයකි! ඇවැත්නි, අද්භූතයකි! ඒ භාග්‍ය‌වතුන් වහන්සේ, සියල්ල දන්නා, සියල්ල දකින, රහතන් වහන්සේ, සම්මා සම්බුදුරජාණන් වහන්සේ විසින් සත්වයන්ගේ නානා අධිමුක්ති ස්වභාවය මැනවින් අවබෝධ කරගෙන තිබේ. මේ සුප්පිය පිරිවැජියා නොයෙක් අයුරින් බුදුරජාණන් වහන්සේට අවැඩ කියයි, ධර්මයට අවැඩ කියයි, සංඝයාට අවැඩ කියයි. එහෙත් සුප්පිය පිරිවැජියාගේ අතවැසි බ්‍රහ්මදත්ත මාණවකයා නොයෙක් අයුරින් බුදුරජාණන් වහන්සේට වැඩ කියයි, ධර්මයට වැඩ කියයි, සංඝයාට වැඩ කියයි. මෙසේ මේ ගුරුවරයා සහ ගෝලයා දෙදෙනාම එකිනෙකාට මුළුමනින්ම විරුද්ධ මත දරමින් භාග්‍ය‌වතුන් වහන්සේ සහ භික්ෂු සංඝයා පසුපසින්ම පැමිණෙති.' ස්වාමීනි, අපගේ මේ අතරමග නතර වූ කතාව මෙයයි, එවිට භාග්‍ය‌වතුන් වහන්සේ වැඩම කළ සේක.\"",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "‘‘Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra tumhehi na āghāto na appaccayo na cetaso anabhiraddhi karaṇīyā. Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha kupitā vā anattamanā vā, tumhaṃ yevassa tena antarāyo. Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha kupitā vā anattamanā vā, api nu tumhe paresaṃ subhāsitaṃ dubbhāsitaṃ ājāneyyāthā’’ti? ‘‘No hetaṃ, bhante’’. ‘‘Mamaṃ vā, bhikkhave, pare avaṇṇaṃ bhāseyyuṃ, dhammassa vā avaṇṇaṃ bhāseyyuṃ, saṅghassa vā avaṇṇaṃ bhāseyyuṃ, tatra tumhehi abhūtaṃ abhūtato nibbeṭhetabbaṃ – ‘itipetaṃ abhūtaṃ, itipetaṃ atacchaṃ, natthi cetaṃ amhesu, na ca panetaṃ amhesu saṃvijjatī’ti.",
      "english": "Monks, if others speak disparagingly of me, or speak disparagingly of the Dhamma, or speak disparagingly of the Sangha, you should not harbor resentment, displeasure, or mental dissatisfaction. Monks, if others speak disparagingly of me, or speak disparagingly of the Dhamma, or speak disparagingly of the Sangha, and if you were to become angry or displeased because of it, that would be a danger to yourselves. Monks, if others speak disparagingly of me, or speak disparagingly of the Dhamma, or speak disparagingly of the Sangha, and if you were to become angry or displeased because of it, would you then be able to discern what is well-spoken and what is ill-spoken of others? \"No, Venerable Sir.\" Monks, if others speak disparagingly of me, or speak disparagingly of the Dhamma, or speak disparagingly of the Sangha, you should explain what is false as false, saying: 'This is indeed false, this is incorrect, this is not found among us, and this does not exist among us.'",
      "sinhala": "මහණෙනි, අනුන් මාගේ අවනම්බුවක් කීවොත් හෝ ධර්මයෙහි අවනම්බුවක් කීවොත් හෝ සංඝයාගේ අවනම්බුවක් කීවොත් හෝ එහිදී ඔබලා කිසිදු කිපීමක් හෝ අසතුටක් හෝ සිතේ අසන්තෝෂයක් හෝ නොකළ යුතුය.\n\nමහණෙනි, අනුන් මාගේ අවනම්බුවක් කීවොත් හෝ ධර්මයෙහි අවනම්බුවක් කීවොත් හෝ සංඝයාගේ අවනම්බුවක් කීවොත් හෝ එහිදී ඔබලා කිපුණොත් හෝ අසතුටු වුණොත් එය ඔබටම බාධාවක් වන්නේය.\n\nමහණෙනි, අනුන් මාගේ අවනම්බුවක් කීවොත් හෝ ධර්මයෙහි අවනම්බුවක් කීවොත් හෝ සංඝයාගේ අවනම්බුවක් කීවොත් හෝ එහිදී ඔබලා කිපුණොත් හෝ අසතුටු වුණොත් එවිට අනුන්ගේ සුභාෂිතය හෝ දුර්භාෂිතය ඔබලාට දැනගත හැකිවේද? “එසේ නොවේ, වහන්ස.”\n\nමහණෙනි, අනුන් මාගේ අවනම්බුවක් කීවොත් හෝ ධර්මයෙහි අවනම්බුවක් කීවොත් හෝ සංඝයාගේ අවනම්බුවක් කීවොත් හෝ එහිදී ඔබලා විසින් අසත්‍ය වූ දේ 'මෙය අසත්‍යයි, මෙය සත්‍ය නොවේ, මෙය අප තුළ නැත, මෙය අප තුළ නොපවතී' කියා අසත්‍ය බවට පැහැදිලි කළ යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 6,
      "pali": "‘‘Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra tumhehi na ānando na somanassaṃ na cetaso uppilāvitattaṃ karaṇīyaṃ. Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra ce tumhe assatha ānandino sumanā uppilāvitā tumhaṃ yevassa tena antarāyo. Mamaṃ vā, bhikkhave, pare vaṇṇaṃ bhāseyyuṃ, dhammassa vā vaṇṇaṃ bhāseyyuṃ, saṅghassa vā vaṇṇaṃ bhāseyyuṃ, tatra tumhehi bhūtaṃ bhūtato paṭijānitabbaṃ – ‘itipetaṃ bhūtaṃ, itipetaṃ tacchaṃ, atthi cetaṃ amhesu, saṃvijjati ca panetaṃ amhesū’ti.",
      "english": "Monks, if others should speak in praise of me, or speak in praise of the Dhamma, or speak in praise of the Sangha, you should not, in that instance, give rise to delight, joy, or elation of mind. Monks, if others should speak in praise of me, or speak in praise of the Dhamma, or speak in praise of the Sangha, and you were, in that instance, to be delighted, joyful, and elated, that would truly be an obstacle for you. Monks, if others should speak in praise of me, or speak in praise of the Dhamma, or speak in praise of the Sangha, you should, in that instance, acknowledge what is true as true, stating: ‘Indeed, this is true; indeed, this is factual; and this exists within us; and moreover, this is found within us.’",
      "sinhala": "මහණෙනි, අන්‍යයෝ මාගේ හෝ, ධර්‍මයාගේ හෝ, සංඝයාගේ හෝ ගුණ වර්ණනා කරත්වා. එවිට ඔබලා විසින් සතුටක් හෝ සොම්නසක් හෝ සිත උද්දාමයට පත්වීමක් ඇති කර නොගත යුතු යි.\n\nමහණෙනි, අන්‍යයෝ මාගේ හෝ, ධර්‍මයාගේ හෝ, සංඝයාගේ හෝ ගුණ වර්ණනා කරත්වා. එහිදී ඔබලා සතුටු වූවෝ, සොම්නස් වූවෝ, සිතින් උද්දාමයට පත් වූවෝ නම්, එය ඔබලාටම අන්තරායක් වන්නේය.\n\nමහණෙනි, අන්‍යයෝ මාගේ හෝ, ධර්‍මයාගේ හෝ, සංඝයාගේ හෝ ගුණ වර්ණනා කරත්වා. එවිට ඔබලා විසින් ඇත්ත ඇති සැටියෙන් පිළිගත යුතු යි – ‘මෙය සත්‍යයකි, මෙය තථ්‍යයකි, මෙය අප තුළ ඇත, මෙය අප තුළ පවතින්නකි’ යනුවෙනි.",
      "paliTitle": ""
    },
    {
      "number": 7,
      "pali": "‘‘Appamattakaṃ kho panetaṃ, bhikkhave, oramattakaṃ sīlamattakaṃ, yena puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. Katamañca taṃ, bhikkhave, appamattakaṃ oramattakaṃ sīlamattakaṃ, yena puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya?",
      "english": "Monks, this is indeed something meager, something minor, something limited to mere morality, by which an ordinary person might speak in praise of the Tathāgata. And what is that, Monks, which is meager, minor, and limited to mere morality, by which an ordinary person might speak in praise of the Tathāgata?",
      "sinhala": "මහණෙනි, පෘථග්ජනයෙක් තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන කල්හි යම් වර්ණනාවකින් වර්ණනා කරන්නේද, ඒ වර්ණනාව සුළු, පහත්, සිල්මාත්‍‌ර වූවක්මය. මහණෙනි, පෘථග්ජනයෙක් තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන කල්හි යම් වර්ණනාවකින් වර්ණනා කරන්නේද, ඒ සුළු, පහත්, සිල්මාත්‍‌ර වූ වර්ණනාව කුමක්ද?",
      "paliTitle": "Cūḷasīlaṃ",
      "englishTitle": "Lesser Morality",
      "sinhalaTitle": "චූල සීලය"
    },
    {
      "number": 8,
      "pali": "‘‘‘Pāṇātipātaṃ pahāya pāṇātipātā paṭivirato samaṇo gotamo nihitadaṇḍo, nihitasattho, lajjī, dayāpanno, sabbapāṇabhūtahitānukampī viharatī’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. ‘‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato samaṇo gotamo dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharatī’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. ‘‘‘Abrahmacariyaṃ pahāya brahmacārī samaṇo gotamo ārācārī [anācārī (ka.)] virato [paṭivirato (katthaci)] methunā gāmadhammā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Having abandoned the taking of life, the recluse Gotama abstains from the taking of life; he has laid aside cudgel and weapon, is conscientious, compassionate, and dwells with sympathetic concern for the welfare of all living beings. Thus, monks, an ordinary person, speaking in praise of the Tathāgata, might speak. Having abandoned the taking of what is not given, the recluse Gotama abstains from the taking of what is not given; he takes what is given, expects what is given, and dwells with a self purified by not stealing. Thus, monks, an ordinary person, speaking in praise of the Tathāgata, might speak. Having abandoned unchastity, the recluse Gotama is celibate, living purely, abstaining from sexual intercourse, the village practice. Thus, monks, an ordinary person, speaking in praise of the Tathāgata, might speak.",
      "sinhala": "මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේ නම්, ‘ශ්‍රමණ භාග්‍යවතුන් වහන්සේ ගෝතමයන් වහන්සේ ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වෙන්වූයේය. දඬු මුගුරු හා ආයුධ බැහැර කළේය. ලජ්ජාවන්තය, දයාවෙන් යුක්තය, සියලු සත්වයන්ගේ හිතසුව කැමතිව වාසය කරයි’ යැයි මෙසේ වර්ණනා කරනු ඇත.\n\nමහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේ නම්, ‘ශ්‍රමණ භාග්‍යවතුන් වහන්සේ ගෝතමයන් වහන්සේ අදත්තාදානය අත්හැර, අදත්තාදානයෙන් වෙන්වූයේය. දෙනු ලබන දේ පමණක් ගන්නේය, දෙනු ලබන දේ බලාපොරොත්තුවෙන් සිටින්නේය. සොරකම් නොකරන ලද පිරිසිදු ස්වභාවයකින් යුතුව වාසය කරයි’ යැයි මෙසේ වර්ණනා කරනු ඇත.\n\nමහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේ නම්, ‘ශ්‍රමණ භාග්‍යවතුන් වහන්සේ ගෝතමයන් වහන්සේ අබ්‍රහ්මචරියාව අත්හැර, බ්‍රහ්මචාරීවූයේය. ග්‍රාම්‍ය වූ මෛථුන ධර්මයෙන් ඈත්ව, එයින් වැළකී වාසය කරයි’ යැයි මෙසේ වර්ණනා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 9,
      "pali": "‘‘‘Musāvādaṃ pahāya musāvādā paṭivirato samaṇo gotamo saccavādī saccasandho theto [ṭheto (syā. kaṃ.)] paccayiko avisaṃvādako lokassā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. ‘‘‘Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato samaṇo gotamo, ito sutvā na amutra akkhātā imesaṃ bhedāya, amutra vā sutvā na imesaṃ akkhātā amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. ‘‘‘Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato samaṇo gotamo, yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. ‘‘‘Samphappalāpaṃ pahāya samphappalāpā paṭivirato samaṇo gotamo kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā kālena sāpadesaṃ pariyantavatiṃ atthasaṃhita’nti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Or, monks, a common person, speaking in praise of the Tathāgata, would say: 'The recluse Gotama, having abandoned false speech, abstains from false speech. He is a speaker of truth, veracious, reliable, trustworthy, and does not deceive the world.'\n\nOr, monks, a common person, speaking in praise of the Tathāgata, would say: 'The recluse Gotama, having abandoned slanderous speech, abstains from slanderous speech. Having heard here, he does not repeat it there for the purpose of causing division among these people; having heard there, he does not repeat it here for the purpose of causing division among those people. Thus, he is a reconciler of those who are divided, and an encourager of those who are united. He delights in concord, rejoices in concord, finds joy in concord, and speaks words that promote unity.'\n\nOr, monks, a common person, speaking in praise of the Tathāgata, would say: 'The recluse Gotama, having abandoned harsh speech, abstains from harsh speech. The speech he speaks is gentle, pleasing to the ear, affectionate, heart-touching, courteous, dear to many, and agreeable to many. He speaks such words.'\n\nOr, monks, a common person, speaking in praise of the Tathāgata, would say: 'The recluse Gotama, having abandoned frivolous talk, abstains from frivolous talk. He speaks at the right time, speaks what is factual, speaks what is beneficial, speaks about the Dhamma, speaks about the Vinaya. He speaks words that are foundational, timely, reasoned, well-defined, and connected to the goal.'",
      "sinhala": "'ශ්‍රමණ ගෞතමයන් වහන්සේ බොරු කීම අත්හැර, බොරු කීමෙන් වැළකුණේය. උන්වහන්සේ සත්‍යවාදීය, සත්‍යයම පවසන්නේය, විශ්වාසවන්තය, විශ්වාස කළ හැක්කේය, ලෝකයාට වංචා නොකරන්නේය' යනුවෙන් ද මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ නම් කියන්නේය.\n\n'ශ්‍රමණ ගෞතමයන් වහන්සේ කේළාම් කීම අත්හැර, කේළාම් කීමෙන් වැළකුණේය. උන්වහන්සේ මෙතැනදී අසා ඔවුන් බිඳවීම පිණිස අන් අය වෙත නොපවසයි. අන් තැනදී අසා මොවුන් බිඳවීම පිණිස මෙතැනට නොපවසයි. මෙසේ භේද වූවන් එක් කරන්නෙකි. එක්ව සිටින්නන්ට අනුබල දෙන්නෙකි. සමගිය ප්‍රිය කරන්නෙකි. සමගියෙහි ඇලුණෙකි. සමගියෙන් සතුටු වන්නෙකි. සමගි කරවන වචන කියන්නෙකි' යනුවෙන් ද මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ නම් කියන්නේය.\n\n'ශ්‍රමණ ගෞතමයන් වහන්සේ රළු වචන අත්හැර, රළු වචන කීමෙන් වැළකුණේය. උන්වහන්සේ යම් කතාවක් මිහිරි ද, කනට සුව දෙනසුලු ද, ප්‍රිය මනාප ද, හදවතට කාවදිනසුලු ද, ශිෂ්ට වූ ද, බොහෝ දෙනාට කැමැති ද, බොහෝ දෙනාට ප්‍රිය ද, එබඳු වචන කියන්නෙකි' යනුවෙන් ද මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ නම් කියන්නේය.\n\n'ශ්‍රමණ ගෞතමයන් වහන්සේ හිස් වචන කීම අත්හැර, හිස් වචන කීමෙන් වැළකුණේය. උන්වහන්සේ කාලෝචිත ලෙස කතා කරන්නෙකි, ඇත්ත කියන්නෙකි, අර්ථයෙන් යුක්ත වචන කියන්නෙකි, ධර්මයට අනුව කියන්නෙකි, විනයට අනුව කියන්නෙකි. උන්වහන්සේ කාලෝචිතව, හේතු සහිතව, සීමා සහිතව, අර්ථයෙන් යුක්ත වූ, නිධානගත වටිනා වචන කියන්නේය' යනුවෙන් ද මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ නම් කියන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 10,
      "pali": "‘Bījagāmabhūtagāmasamārambhā [samārabbhā (sī. ka.)] paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave…pe…. ‘‘‘Ekabhattiko samaṇo gotamo rattūparato virato [paṭivirato (katthaci)] vikālabhojanā…. Naccagītavāditavisūkadassanā [naccagītavāditavisukadassanā (ka.)] paṭivirato samaṇo gotamo…. Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato samaṇo gotamo…. Uccāsayanamahāsayanā paṭivirato samaṇo gotamo…. Jātarūparajatapaṭiggahaṇā paṭivirato samaṇo gotamo…. Āmakadhaññapaṭiggahaṇā paṭivirato samaṇo gotamo…. Āmakamaṃsapaṭiggahaṇā paṭivirato samaṇo gotamo…. Itthikumārikapaṭiggahaṇā paṭivirato samaṇo gotamo…. Dāsidāsapaṭiggahaṇā paṭivirato samaṇo gotamo…. Ajeḷakapaṭiggahaṇā paṭivirato samaṇo gotamo…. Kukkuṭasūkarapaṭiggahaṇā paṭivirato samaṇo gotamo…. Hatthigavassavaḷavapaṭiggahaṇā paṭivirato samaṇo gotamo…. Khettavatthupaṭiggahaṇā paṭivirato samaṇo gotamo…. Dūteyyapahiṇagamanānuyogā paṭivirato samaṇo gotamo…. Kayavikkayā paṭivirato samaṇo gotamo…. Tulākūṭakaṃsakūṭamānakūṭā paṭivirato samaṇo gotamo…. Ukkoṭanavañcananikatisāciyogā [sāviyogā (syā. kaṃ. ka.)] paṭivirato samaṇo gotamo…. Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Thus, monks, a common person, speaking in praise of the Tathagata, might say: ‘The recluse Gotama abstains from the destruction of seed-produce and plant-produce. The recluse Gotama is one who eats only once a day, abstaining from food at night and from food at improper times. The recluse Gotama abstains from watching dancing, singing, music, and unseemly shows. The recluse Gotama abstains from wearing garlands, using perfumes, and beautifying the body with cosmetics and adornments. The recluse Gotama abstains from high and luxurious sleeping places. The recluse Gotama abstains from accepting gold and silver. The recluse Gotama abstains from accepting raw grain. The recluse Gotama abstains from accepting raw meat. The recluse Gotama abstains from accepting women and girls. The recluse Gotama abstains from accepting male and female slaves. The recluse Gotama abstains from accepting goats and sheep. The recluse Gotama abstains from accepting chickens and pigs. The recluse Gotama abstains from accepting elephants, cattle, horses, and mares. The recluse Gotama abstains from accepting fields and land. The recluse Gotama abstains from engaging in messages and errands. The recluse Gotama abstains from buying and selling. The recluse Gotama abstains from falsifying weights, metals, and measures. The recluse Gotama abstains from bribery, deception, fraud, and crookedness. The recluse Gotama abstains from cutting, torturing, binding, robbery, plunder, and violence.’",
      "sinhala": "'ශ්‍රමණ ගෞතමයන් වහන්සේ බීජ සමූහය හා භූත සමූහය (පොළොවේ හටගන්නා දෑ) විනාශ කිරීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ දිනකට එක් වේලක් පමණක් වළඳන්නේය, රාත්‍රී භෝජනයෙන් වැළකී සිටින්නේය, විකාල භෝජනයෙන් (අකල්හි ආහාර ගැනීමෙන්) වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ නැටුම්, ගීත, වාදන සහ අශෝභන ප්‍රදර්ශන නැරඹීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ මල්මාලා, සුවඳ විලවුන්, ආලේපන දැරීමෙන් සහ ආභරණ පැළඳීමෙන්, විභූෂණයන්ගෙන් (අලංකාර වීමෙන්) වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ උස් අසුන්, මහා අසුන් (විශාල සයනයන්) පරිහරණයෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ රන් රිදී භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ අමු ධාන්‍ය භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ අමු මස් භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ ස්ත්‍රීන් හා කුමරියන් භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ දාසයන් හා දාසියන් භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ එළු බැටළුවන් භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ කුකුළන් හා ඌරන් භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ ඇතින්නන්, ගවයන්, අශ්වයන් හා අශ්වින්නන් භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ කෙත් වතු (කුඹුරු සහ ගොඩබිම්) භාර ගැනීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ දූත මෙහෙවරෙහි යෙදීමෙන් (පණිවිඩකරුවන් ලෙස යාමෙන්) වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ මිල දී ගැනීමෙන් හා විකිණීමෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ තරාදි වංචාවෙන්, කාසි වංචාවෙන් සහ මිනුම් වංචාවෙන් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ අල්ලස් ගැනීමෙන්, වංචා කිරීමෙන්, කපටිකම් කිරීමෙන් සහ වංක කටයුතුවලින් වැළකී සිටින්නේය'යැයි; 'ශ්‍රමණ ගෞතමයන් වහන්සේ කපා දැමීමෙන් (අංග ඡේදනයෙන්), මැරීමෙන් (ඝාතනයෙන්), බැඳ තැබීමෙන් (බන්ධනයෙන්), මංකොල්ලකෑමෙන්, කොල්ලකෑමෙන් සහ බලහත්කාරයෙන් අයිති කරගැනීම්වලින් (ආක්‍රමණයෙන්) වැළකී සිටින්නේය'යැයි – මෙසේද මහණෙනි, පුහුදුන් පුද්ගලයා තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේ කථා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 11,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ bījagāmabhūtagāmasamārambhaṃ anuyuttā viharanti, seyyathidaṃ [seyyathīdaṃ (sī. syā.)] – mūlabījaṃ khandhabījaṃ phaḷubījaṃ aggabījaṃ bījabījameva pañcamaṃ [pañcamaṃ iti vā (sī. syā. ka.)]; iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Just as some venerable ascetics and brahmins, having partaken of food offered out of faith, dwell given to the destruction of seeds and plant-life – that is, root seeds, stem cuttings, joint segments, tip cuttings, and fifthly, seeds from seeds themselves – ‘The ascetic Gotama abstains from such destruction of seeds and plant-life.’ Monks, this is how an ordinary person, when speaking in praise of the Tathagata, would speak.",
      "sinhala": "‘යම්සේ සමහර පින්වත් ශ්‍රමණබ්‍රාහ්මණවරුන් ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු බීජග්‍රාම භූතග්‍රාම විනාශ කිරීමෙහි යෙදී වාසය කරති. එනම්, මුල් බීජ, කඳ බීජ, ගැට බීජ, අග්‍ර බීජ, සහ බීජයන් ම පස්වැන්නයි. ශ්‍රමණ ගෞතමයන් වහන්සේ මෙබඳු බීජග්‍රාම භූතග්‍රාම විනාශ කිරීමෙන් වැළකී සිටින්නේය’ යැයි මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේද, එලෙස කියනු ඇත.",
      "paliTitle": "Majjhimasīlaṃ",
      "englishTitle": "Middle Morality",
      "sinhalaTitle": "මධ්‍යම ශීලය"
    },
    {
      "number": 12,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ sannidhikāraparibhogaṃ anuyuttā viharanti, seyyathidaṃ – annasannidhiṃ pānasannidhiṃ vatthasannidhiṃ yānasannidhiṃ sayanasannidhiṃ gandhasannidhiṃ āmisasannidhiṃ iti vā iti evarūpā sannidhikāraparibhogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Or again, some venerable ascetics and brahmins, having consumed food given out of faith, dwell engaged in such practices of storing up and consuming; namely, storing up food, storing up drinks, storing up clothes, storing up vehicles, storing up beds, storing up perfumes, and storing up material possessions. The ascetic Gotama abstains from such practices of storing up and consuming. Thus indeed, monks, an ordinary person, when speaking in praise of the Tathāgata, might speak.",
      "sinhala": "යම්සේ ඇතැම් පින්වත් ශ‍්‍රමණබ‍්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, ඔවුහු මෙබඳු සන්නිධිකාර පරිභෝගයකට ඇලී වාසය කරති. එනම්: අහර ගබඩා කර තබා ගැනීම, පාන වර්ග ගබඩා කර තබා ගැනීම, වස්ත‍්‍ර ගබඩා කර තබා ගැනීම, යාන වාහන ගබඩා කර තබා ගැනීම, සයන ගබඩා කර තබා ගැනීම, සුවඳ වර්ග ගබඩා කර තබා ගැනීම, ආමිස ද්‍රව්‍ය ගබඩා කර තබා ගැනීම යනුයි. මෙබඳු සන්නිධිකාර පරිභෝගයන්ගෙන් ශ‍්‍රමණ ගෞතමයන් වහන්සේ වැළකී සිටිති යනුයි. මහණෙනි, මේ අයුරින් ද පෘථග්ජන පුද්ගලයෙක් තථාගතයන් වහන්සේගේ ගුණය ප‍්‍රකාශ කරන්නේ නම්, ප‍්‍රකාශ කරන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanaṃ anuyuttā viharanti, seyyathidaṃ – naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ pāṇissaraṃ vetāḷaṃ kumbhathūṇaṃ [kumbhathūnaṃ (syā. ka.), kumbhathūṇaṃ (sī.)] sobhanakaṃ [sobhanagharakaṃ (sī.), sobhanagarakaṃ (syā. kaṃ. pī.)] caṇḍālaṃ vaṃsaṃ dhovanaṃ hatthiyuddhaṃ assayuddhaṃ mahiṃsayuddhaṃ [mahisayuddhaṃ (sī. syā. kaṃ. pī.)] usabhayuddhaṃ ajayuddhaṃ meṇḍayuddhaṃ kukkuṭayuddhaṃ vaṭṭakayuddhaṃ daṇḍayuddhaṃ muṭṭhiyuddhaṃ nibbuddhaṃ uyyodhikaṃ balaggaṃ senābyūhaṃ anīkadassanaṃ iti vā iti evarūpā visūkadassanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Or again, some venerable ascetics and brahmins, having eaten food given out of faith, dwell addicted to such vulgar shows, namely: dancing, singing, instrumental music, theatrical performances, recitations, hand-clapping music, gong shows, pot-drumming, puppet shows, acrobatic displays, bamboo pole acts, washermen's shows, elephant fights, horse fights, buffalo fights, bull fights, goat fights, ram fights, cock fights, quail fights, stick fights, fisticuffs, wrestling, war games, army parades, military reviews, and army displays. The ascetic Gotama abstains from such vulgar shows. Thus, monks, a common person, speaking in praise of the Tathāgata, might speak.",
      "sinhala": "‘යම්සේ සමහර ගෞරවනීය ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු විවිධ ප්‍රදර්ශනවලට ඇලුම් කරමින් වාසය කරති. එනම්: නැටුම්, ගීත ගායනා, සංගීත භාණ්ඩ වාදනය, නාට්‍ය ප්‍රදර්ශන, කථා කීම්, අත් පොරොන්දම්, තාල වාදන, කලගෙඩි වාදන, විචිත්‍ර රංග, චණ්ඩාල ක්‍රීඩා, උණ ලී නැටුම්, භාණ්ඩ පෙරලීම්, ඇත් පොර, අශ්ව පොර, මී පොර, ගව පොර, එළු පොර, බැටළු පොර, කුකුළු පොර, වටු පොර, දඬු පොර, මුෂ්ටි පොර, මල්ලව පොර, සටන් අභ්‍යාස, සේනා සංදර්ශන, යුධ සැකසුම්, සේනා පෙළපාලි යනාදිය යි. මෙවැනි විවිධ ප්‍රදර්ශනවලින් ශ්‍රමණ ගෞතමයන් වහන්සේ වැළකී සිටිති’ යි; භික්ෂූනි, පෘථග්ජනයෙක් තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේ නම්, එසේ වර්ණනා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ jūtappamādaṭṭhānānuyogaṃ anuyuttā viharanti, seyyathidaṃ – aṭṭhapadaṃ dasapadaṃ ākāsaṃ parihārapathaṃ santikaṃ khalikaṃ ghaṭikaṃ salākahatthaṃ akkhaṃ paṅgacīraṃ vaṅkakaṃ mokkhacikaṃ ciṅgulikaṃ [ciṅgulakaṃ (ka. sī.)] pattāḷhakaṃ rathakaṃ dhanukaṃ akkharikaṃ manesikaṃ yathāvajjaṃ iti vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Just as some revered recluses and brahmins, having partaken of food offered out of faith, remain addicted to such games and pastimes that cause heedlessness – that is to say: games on eight-row boards, games on ten-row boards, games on imaginary boards, games of dodging, games of dice, games with a special die, games of throwing sticks, games of guessing with hand-sticks, general dice games, games of drawing figures, games of contortion, games of releasing objects, games of somersaulting, games of flicking objects, games with toy carts, games with toy bows, games of guessing letters, games of guessing thoughts, games of mimicry – from such games and pastimes that cause heedlessness, the recluse Gotama abstains. In this way, monks, a common person, speaking in praise of the Tathāgata, might speak.",
      "sinhala": "ඇතැම් ගෞරවනීය ශ්‍රමණ-බ්‍රාහ්මණවරු ශ්‍රද්ධාවෙන් දුන් දන් වළඳා, ඔවුන් මෙවැනි සූදු කෙළීම ආදී ප්‍රමාදයට කරුණු වන ස්ථානවල යෙදී වාසය කරති. එනම්: අටපද, දසපද, ආකාශ, පරිහාරපථ, සන්තිකා, ඛලිකා, ඝටිකා, සලාකාහත්ථ, අක්ෂ, පංගචීර, වංකක, මොක්ඛචික, චිංගුලික, පත්තාළ්හක, රථක, ධනුක, අක්ඛරික, මනේසික, යථා-අවජ්ජ යනාදී වශයෙනි. මෙබඳු සූදුවෙන් හා ප්‍රමාදයට කරුණු වන ස්ථානවල යෙදීමෙන් ශ්‍රමණ ගෞතමයන් වෙන්ව සිටින සේක. භික්ෂූනි, මේ ආකාරයෙන් ද පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ uccāsayanamahāsayanaṃ anuyuttā viharanti, seyyathidaṃ – āsandiṃ pallaṅkaṃ gonakaṃ cittakaṃ paṭikaṃ paṭalikaṃ tūlikaṃ vikatikaṃ uddalomiṃ ekantalomiṃ kaṭṭissaṃ koseyyaṃ kuttakaṃ hatthattharaṃ assattharaṃ rathattharaṃ [hatthattharaṇaṃ assattharaṇaṃ rathattharaṇaṃ (sī. ka. pī.)] ajinappaveṇiṃ kadalimigapavarapaccattharaṇaṃ sauttaracchadaṃ ubhatolohitakūpadhānaṃ iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Just as some reverend ascetics and brahmins, having consumed food offered in faith, abide devoted to such high and luxurious beds and seats—namely, long couches, divans, woolly rugs with long fleece, patterned rugs, white woollen coverlets, rugs with flower designs, mattresses stuffed with cotton, rugs with animal figures, woollen rugs with hair standing upright on both sides, woollen rugs with hair standing upright on one side, rugs embroidered with silk, silk rugs, large woollen carpets, elephant blankets, horse blankets, chariot blankets, antelope-hide rugs, excellent deer-hide rugs, couches with canopies, and couches with red cushions at both ends—even so, Recluse Gotama abstains from such high and luxurious beds and seats. Thus indeed, monks, an ordinary uninstructed person, speaking in praise of the Tathagata, would speak.",
      "sinhala": "මහණෙනි, තවත් සමහර පූජ්‍ය ශ්‍රමණ-බ්‍රාහ්මණවරු ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු උස් අසුන් සහ මහා අසුන් භාවිතා කරමින් වාසය කරති. එනම්: අස්න, පලංකය, දිගු ලොම් ඇති ගෝණක ඇතිරිල්ල, විසිතුරු සිතුවම් ඇති චිත්‍රක ඇතිරිල්ල, නව ලොම් ඇතිරිල්ල, එළු ලොම් ඇතිරිල්ල, කපු පුළුන් පුරවා සෑදූ මෙට්ටය, සිංහ ව්‍යාඝ්‍ර ආදී රූප ගෙත්තම් කළ ඇතිරිල්ල, දෙපසින් දිගු ලොම් ඇතිරිල්ල, එක් පසකින් දිගු ලොම් ඇතිරිල්ල, සේද රෙදි ඇතිරිල්ල, කොසෙය්‍ය ඇතිරිල්ල, සිවුරට වඩා විශාල කම්බිලි ඇතිරිල්ල, හස්ති ඇතුරුම්, අශ්ව ඇතුරුම්, රථ ඇතුරුම්, මුව සමින් කළ ඇතිරිල්ල, කදලි මෘගයාගේ උසස් සමින් කළ ඇතිරිල්ල, වියනක් සහිත වූ, දෙපස රතු කොට්ට සහිත වූ යහන් යනාදියයි. මෙබඳු උස් අසුන් හා මහා අසුන් භාවිතයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේ වැළකී සිටින්නේය යනුවෙන් පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේ නම්, එසේ වර්ණනා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ maṇḍanavibhūsanaṭṭhānānuyogaṃ anuyuttā viharanti, seyyathidaṃ – ucchādanaṃ parimaddanaṃ nhāpanaṃ sambāhanaṃ ādāsaṃ añjanaṃ mālāgandhavilepanaṃ [mālāvilepanaṃ (sī. syā. kaṃ. pī.)] mukhacuṇṇaṃ mukhalepanaṃ hatthabandhaṃ sikhābandhaṃ daṇḍaṃ nāḷikaṃ asiṃ [khaggaṃ (sī. pī.), asiṃ khaggaṃ (syā. kaṃ.)] chattaṃ citrupāhanaṃ uṇhīsaṃ maṇiṃ vālabījaniṃ odātāni vatthāni dīghadasāni iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Just as some venerable ascetics and brahmins, having partaken of food offered out of faith, dwell addicted to such practices of adornment and beautification—namely, rubbing, massaging, bathing, anointing, using mirrors, eye-salve, garlands, perfumes, cosmetics, face-powder, face-paint, arm-bands, head-bands, staves, tubes, swords, umbrellas, ornamented sandals, turbans, jewels, yak-tail whisks, and white clothes with long fringes—so too the recluse Gotama abstains from such practices of adornment and beautification. Thus, monks, might an ordinary person, speaking in praise of the Tathāgata, speak.",
      "sinhala": "ඇතැම් පූජ්‍ය ශ්‍රමණ-බ්‍රාහ්මණයන් යම්සේ ශ්‍රද්ධාවෙන් දුන් ආහාර වළඳා මෙබඳු මණ්ඩන විභූෂණ ස්ථානවල යෙදී වාසය කරත් ද, එනම්: ඇඟ පිරිමැදීම, සම්බාහනය, ස්නානය, අභ්‍යංගය (තෙල් ගැල්වීම), කැඩපත් බැලීම, අංජන ගැල්වීම, මල්, සුවඳ විලවුන් ආලේප කිරීම, මුහුණට කුඩු ගැල්වීම, මුහුණට ලේප ගැල්වීම, අත් බැඳීම්, සිකා බැඳීම්, දඬු, නාළිකා, අසි (කඩු), කුඩ, සිත්ගන්නා පාවහන්, උෂ්ණීෂ (හිස් පළඳනා), මැණික්, වල්විදුනා (චාමර), සුදු වස්ත්‍ර, දික් දසුන් සහිත වස්ත්‍ර යන මේ ආදී වූ මෙබඳු මණ්ඩන විභූෂණ ස්ථානවලින් ශ්‍රමණ ගෞතමයන් වහන්සේ වෙන්වූ සේක’යි, මහණෙනි, මෙසේ හෝ පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 17,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ tiracchānakathaṃ anuyuttā viharanti, seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ yānakathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ [itthikathaṃ purisakathaṃ (syā. kaṃ. ka.)] sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ itibhavābhavakathaṃ iti vā iti evarūpāya tiracchānakathāya paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Just as some venerable ascetics and brahmins, having consumed food offered out of faith, engage in such low talk as this—namely, talk of kings, talk of bandits, talk of ministers, talk of armies, talk of fear, talk of war, talk of food, talk of drink, talk of clothes, talk of lodgings, talk of garlands, talk of perfumes, talk of relatives, talk of vehicles, talk of villages, talk of market towns, talk of cities, talk of countries, talk of women, talk of men, talk of heroes, talk of streets, talk of watering places, talk of departed ancestors, talk of various topics, talk of the world, talk of the sea, and talk of existence and non-existence—it might be said, \"The ascetic Gotama refrains from such low talk.\" Indeed, monks, it is in this way that an ordinary person, when speaking in praise of the Tathāgata, might speak.",
      "sinhala": "‘තවද, ඇතැම් පින්වත් ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, රජුන් පිළිබඳ කථා, සොරුන් පිළිබඳ කථා, ඇමැතිවරුන් පිළිබඳ කථා, සේනා පිළිබඳ කථා, බිය පිළිබඳ කථා, යුද්ධ පිළිබඳ කථා, භෝජන පිළිබඳ කථා, පාන වර්ග පිළිබඳ කථා, වස්ත්‍ර පිළිබඳ කථා, සයන පිළිබඳ කථා, මල් පිළිබඳ කථා, සුවඳ විලවුන් පිළිබඳ කථා, ඥාතීන් පිළිබඳ කථා, යාන වාහන පිළිබඳ කථා, ගම් පිළිබඳ කථා, නියම්ගම් පිළිබඳ කථා, නගර පිළිබඳ කථා, ජනපද පිළිබඳ කථා, ස්ත්‍රීන් පිළිබඳ කථා, පුරුෂයන් පිළිබඳ කථා, වීරයන් පිළිබඳ කථා, වීදි පිළිබඳ කථා, ජල ස්ථාන පිළිබඳ කථා, මියගිය ඥාතීන් පිළිබඳ කථා, නොයෙක් දේ පිළිබඳ කථා, ලෝක ස්වභාවය පිළිබඳ කථා, සාගරය පිළිබඳ කථා, භවය හා අභවය පිළිබඳ කථා ආදී වශයෙන් වූ මේ ආකාරයේ තිරශ්චීන කථාවල යෙදී වාසය කරති. ශ්‍රමණ ගෞතමයන් වහන්සේ මේ ආකාරයේ තිරශ්චීන කථාවලින් වැළකී සිටින සේකැයි – මහණෙනි, පෘථග්ජන තෙමේ තථාගතයන් වහන්සේගේ ගුණය ප්‍රකාශ කරන්නේ එසේ ද ප්‍රකාශ කරන්නේය.’",
      "paliTitle": ""
    },
    {
      "number": 18,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ viggāhikakathaṃ anuyuttā viharanti, seyyathidaṃ – na tvaṃ imaṃ dhammavinayaṃ ājānāsi, ahaṃ imaṃ dhammavinayaṃ ājānāmi, kiṃ tvaṃ imaṃ dhammavinayaṃ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṃ me, asahitaṃ te, purevacanīyaṃ pacchā avaca, pacchāvacanīyaṃ pure avaca, adhiciṇṇaṃ te viparāvattaṃ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti iti vā iti evarūpāya viggāhikakathāya paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "And just as some venerable ascetics and brahmins, having consumed food given out of faith, dwell engaged in such combative speech as: \"You do not understand this Dhamma and Discipline; I understand this Dhamma and Discipline. How could you understand this Dhamma and Discipline? You are practicing wrongly; I am practicing rightly. What is consistent is mine; what is inconsistent is yours. You said first what should have been said last; you said last what should have been first. Your argument has been inverted. Your statement is refuted. You are defeated. Go and try to free yourself from the argument, or disentangle it if you can!\"—The recluse Gotama abstains from such combative speech. Thus, indeed, monks, an ordinary person speaking in praise of the Tathāgata might speak.",
      "sinhala": "තවද යම් ආකාරයකින් හෝ ඇතැම් පින්වත් ශ්‍ර​මණබ්‍රාහ්මණයෝ ශ්‍ර​ද්ධාවෙන් දෙන ලද භෝජන වළඳා, ඔවුහු මෙබඳු වාද කථාවල යෙදී වාසය කරති. එනම්: \"නුඹ මේ ධර්​ම විනය නොදන්නෙහි ය. මම මේ ධර්​ම විනය දනිමි. නුඹ මේ ධර්​ම විනය කෙසේ නම් දන්නෙහිද? නුඹ වැරදි මඟෙහි යන්නෙක් වෙහි. මම යහපත් මඟෙහි යන්නෙක් වෙමි. මා කියන දේ අර්ථවත් ය. නුඹ කියන දේ අර්ථ රහිත ය. මුලින් කිව යුතු දේ පසුව කීවෙහි. පසුව කිව යුතු දේ මුලින් කීවෙහි. නුඹගේ තර්කය පෙරළී ගියේය. නුඹගේ වාදය චෝදනාවට ලක්විය. නුඹ පරදවන ලදි. නුඹේ වාදයෙන් නිදහස් වීමට (මාර්ගයක්) සොයා ගනු. හැකි නම් විසඳා ගනු.\" යනාදී වශයෙන් මෙබඳු වාද කථාවලින් ශ්‍ර​මණ ගෞතමයන් වහන්සේ වැළකී සිටින සේක\" යනුවෙන් හෝ, මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේ වර්ණනා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 19,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ dūteyyapahiṇagamanānuyogaṃ anuyuttā viharanti, seyyathidaṃ – raññaṃ, rājamahāmattānaṃ, khattiyānaṃ, brāhmaṇānaṃ, gahapatikānaṃ, kumārānaṃ ‘‘idha gaccha, amutrāgaccha, idaṃ hara, amutra idaṃ āharā’’ti iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Just as some venerable monastics and brahmins, having eaten food given out of faith, live engaged in such duties as conveying messages and going on errands – namely, for kings, royal ministers, nobles, brahmins, householders, or princes, being told: \"Go here, come there, take this, bring that there\" – from such duties of conveying messages and going on errands, the ascetic Gotama refrains. Thus, monks, a common person praising the Tathāgata might speak.",
      "sinhala": "යම්සේ සමහර ගෞරවනීය ශ්‍ර‌මණයෝ සහ බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දුන් ආහාර වළඳා, එබඳු දූත කර්මාන්තයෙහි යෙදෙමින් වාසය කරත්ද, එනම් – රජවරුන්ට, රාජ මහාමාත්‍යවරුන්ට, ක්ෂත්‍ර‌ියයන්ට, බ්‍රාහ්මණයන්ට, ගෘහපතියන්ට, කුමාරවරුන්ට, ‘‘මෙතැනට යන්න, එතැනින් එන්න, මෙය ගෙන යන්න, එතැනින් මෙය ගෙන එන්න’’ යනාදී ලෙස මෙවැනි දූත කර්මාන්තයන්ගෙන් ශ්‍ර‌මණ ගෞතමයන් වහන්සේ වැළකී සිටින සේකැයි යනාදී වශයෙන් ද මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ කියනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 20,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti, lapakā ca nemittikā ca nippesikā ca, lābhena lābhaṃ nijigīṃsitāro ca [lābhena lābhaṃ nijigiṃ bhitāro (sī. syā.), lābhena ca lābhaṃ nijigīsitāro (pī.)] iti [iti vā, iti (syā. kaṃ. ka.)] evarūpā kuhanalapanā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Just as some venerable ascetics and brahmins, having consumed food offered out of faith, are deceitful, flatterers, interpreters of omens, fawners, and those who seek gain through gain—from such practices of deceit and flattery the recluse Gotama refrains. It is thus, bhikkhus, that an ordinary person, speaking in praise of the Tathāgata, might speak.",
      "sinhala": "යම්සේ ඇතැම් ගෞරවනීය ශ්‍රමණ-බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා ඔවුහු කුහක වෙති, කතා කියන සුළු වෙති, නිමිති කියන සුළු වෙති, ලාභය පිණිස යදින සුළු වෙති, ලාභයෙන් ලාභය බලාපොරොත්තු වෙති. මෙවැනි කුහක කතා කිරීම් වලින් ශ්‍රමණ ගෞතමයන් වහන්සේ වැළකුණු සේකැයි – මෙසේ ද මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන කල්හි කියන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 21,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – aṅgaṃ nimittaṃ uppātaṃ supinaṃ lakkhaṇaṃ mūsikacchinnaṃ aggihomaṃ dabbihomaṃ thusahomaṃ kaṇahomaṃ taṇḍulahomaṃ sappihomaṃ telahomaṃ mukhahomaṃ lohitahomaṃ aṅgavijjā vatthuvijjā khattavijjā [khettavijjā (bahūsu)] sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṃ saraparittāṇaṃ migacakkaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Or again, venerable sirs, some ascetics and brahmins, having consumed food given in faith, maintain a livelihood by such low arts as these, by wrong livelihood. These are: palmistry, prognostication by signs, interpreting portents, interpreting dreams, physiognomy, omens from cloth gnawed by rats, fire oblations, spoon oblations, husk oblations, rice-bran oblations, rice-grain oblations, ghee oblations, oil oblations, mouth oblations, blood oblations, knowledge of limbs, knowledge of house sites, knowledge of royal sites, snake-lore, ghost-lore, god-lore, serpent-lore, poison-lore, scorpion-lore, rat-lore, bird-lore, crow-lore, prognostication by sounds, protective charms against arrows, and interpretation of animal tracks. From such low arts and wrong livelihood, the recluse Gotama abstains. Thus, bhikkhus, an ordinary person, speaking in praise of the Tathāgata, might speak.",
      "sinhala": "‘ ඇතැම් පූජ්‍ය ශ්‍රමණ-බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, ඔවුහු මෙබඳු තිරශ්චීන විද්‍යාවන් මගින් මිත්‍යා ආජීවයෙන් ජීවත් වෙති. එනම්: අංග ලක්ෂණ බැලීම, නිමිති බැලීම, උප්පාත විද්‍යා, සිහින පලාපල කීම, ලක්ෂණ කීම, මීයන් කැපූ දේ අනුව පලාපල කීම, අග්ගි හෝම, දබ්බි හෝම, තුස හෝම, කණ හෝම, තණ්ඩූල හෝම, ඝෘත හෝම, තෙල් හෝම, මුඛ හෝම, ලේ හෝම, අංග විද්‍යා, වත්ථු විද්‍යා, ඛෙත්ත විද්‍යා, සිව විද්‍යා, භූත විද්‍යා, භූරි විද්‍යා, අහි විද්‍යා, විස විද්‍යා, විච්ඡික විද්‍යා, මූසික විද්‍යා, සකුණ විද්‍යා, වායස විද්‍යා, පක්කජ්ඣාන, සරපරත්‍රාණ, මිගචක්ක යන මෙවැනි තිරශ්චීන විද්‍යාවන්ගෙන් යුත් මිත්‍යා ආජීවයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේ වළකා සිටින සේක’යි – මෙසේ ද, මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ කියන්නේ ය.",
      "paliTitle": "Mahāsīlaṃ",
      "englishTitle": "Great Virtue",
      "sinhalaTitle": "මහාසීලය"
    },
    {
      "number": 22,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – maṇilakkhaṇaṃ vatthalakkhaṇaṃ daṇḍalakkhaṇaṃ satthalakkhaṇaṃ asilakkhaṇaṃ usulakkhaṇaṃ dhanulakkhaṇaṃ āvudhalakkhaṇaṃ itthilakkhaṇaṃ purisalakkhaṇaṃ kumāralakkhaṇaṃ kumārilakkhaṇaṃ dāsalakkhaṇaṃ dāsilakkhaṇaṃ hatthilakkhaṇaṃ assalakkhaṇaṃ mahiṃsalakkhaṇaṃ [mahisalakkhaṇaṃ (sī. syā. kaṃ. pī.)] usabhalakkhaṇaṃ golakkhaṇaṃ ajalakkhaṇaṃ meṇḍalakkhaṇaṃ kukkuṭalakkhaṇaṃ vaṭṭakalakkhaṇaṃ godhālakkhaṇaṃ kaṇṇikālakkhaṇaṃ kacchapalakkhaṇaṃ migalakkhaṇaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Or again, some worthy ascetics and brahmins, having consumed the food offerings given out of faith, maintain their livelihood by such base arts, by wrong livelihood. This includes interpreting signs of gems, clothes, staffs, knives, swords, arrows, bows, weapons; interpreting signs of women, men, boys, girls, male slaves, female slaves; interpreting signs of elephants, horses, buffaloes, bulls, cattle, goats, sheep, chickens, quails, iguanas, earrings, tortoises, and deer. From such base arts and wrong livelihood, the ascetic Gotama abstains. It is in this way too, bhikkhus, that an ordinary person, speaking in praise of the Tathāgata, might speak.",
      "sinhala": "ඇතැම් පූජ්‍ය ශ‍්‍රමණයෝ සහ බ්‍රාහ්මණයෝ ශ‍්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන් (ශාස්ත‍්‍රයන්ගෙන්) මිසදිටු ආජීවයෙන් ජීවිකාව ගෙන යති. එනම්: මැණික් ලක්ෂණ, වස්ත‍්‍ර ලක්ෂණ, දඬු ලක්ෂණ, ශස්ත‍්‍ර ලක්ෂණ, කඩු ලක්ෂණ, ඊතල ලක්ෂණ, දුනු ලක්ෂණ, ආයුධ ලක්ෂණ, ස්ත‍්‍රී ලක්ෂණ, පුරුෂ ලක්ෂණ, කුමාර ලක්ෂණ, කුමාරි ලක්ෂණ, දාස ලක්ෂණ, දාසී ලක්ෂණ, හස්ති ලක්ෂණ, අශ්ව ලක්ෂණ, මහීංස ලක්ෂණ, වෘෂභ ලක්ෂණ, ගව ලක්ෂණ, එළු ලක්ෂණ, මේඬක ලක්ෂණ, කුකුළු ලක්ෂණ, වටු ලක්ෂණ, ගෝධාලක්ෂණ, කණිකා ලක්ෂණ, කැස්බෑ ලක්ෂණ, මෘග ලක්ෂණ යනාදියයි. හෝ මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන්, මිසදිටු ආජීවයෙන් ශ‍්‍රමණ ගෞතමයන් වහන්සේ වෙන් වී සිටින සේකැයි, මහණෙනි, මෙසේද පෘථග්ජන තෙම තථාගතයන් වහන්සේගේ ගුණය කියන්නේ කියයි.",
      "paliTitle": ""
    },
    {
      "number": 23,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – raññaṃ niyyānaṃ bhavissati, raññaṃ aniyyānaṃ bhavissati, abbhantarānaṃ raññaṃ upayānaṃ bhavissati, bāhirānaṃ raññaṃ apayānaṃ bhavissati, bāhirānaṃ raññaṃ upayānaṃ bhavissati, abbhantarānaṃ raññaṃ apayānaṃ bhavissati, abbhantarānaṃ raññaṃ jayo bhavissati, bāhirānaṃ raññaṃ parājayo bhavissati, bāhirānaṃ raññaṃ jayo bhavissati, abbhantarānaṃ raññaṃ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Thus, mendicants, an ordinary person, when speaking in praise of the Realized One, would speak: \"Just as some venerable monastics and brahmins, having consumed food given out of faith, maintain their livelihood by such low arts and wrong livelihood, namely, by predicting: 'There will be a king's march; there will not be a king's march; the internal kings will advance; the external kings will retreat; the external kings will advance; the internal kings will retreat; the internal kings will conquer; the external kings will be defeated; the external kings will conquer; the internal kings will be defeated; this one will conquer; that one will be defeated,' or by similar means. The recluse Gotama abstains from such low arts and wrong livelihood.\"",
      "sinhala": "‘යම්සේ සමහර ගෞරවනීය ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, රජුන්ට පිටත්වීමක් සිදුවෙයි, රජුන්ට පිටත්වීමක් සිදුනොවෙයි, ඇතුළු රජුන්ට දියුණුවක් සිදුවෙයි, පිටත රජුන්ට පිරිහීමක් සිදුවෙයි, පිටත රජුන්ට දියුණුවක් සිදුවෙයි, ඇතුළු රජුන්ට පිරිහීමක් සිදුවෙයි, ඇතුළු රජුන්ට ජය සිදුවෙයි, පිටත රජුන්ට පරාජය සිදුවෙයි, පිටත රජුන්ට ජය සිදුවෙයි, ඇතුළු රජුන්ට පරාජය සිදුවෙයි, මේ අයට ජය සිදුවෙයි, මේ අයට පරාජය සිදුවෙයි යන ආදී වශයෙන් මෙබඳු තිරශ්චීන විද්‍යාවකින්, මිත්‍යා ආජීවයෙන් ජීවත් වෙත්ද, ගෞතම ශ්‍රමණයෝ මෙබඳු තිරශ්චීන විද්‍යාවකින්, මිත්‍යා ආජීවයෙන් වැළකී සිටිති.’ මහණෙනි, මෙසේ හෝ පෘථග්ජන තෙමේ තථාගතයන් වහන්සේගේ ගුණය කියන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 24,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – candaggāho bhavissati, sūriyaggāho [suriyaggāho (sī. syā. kaṃ. pī.)] bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṃ pathagamanaṃ bhavissati, candimasūriyānaṃ uppathagamanaṃ bhavissati, nakkhattānaṃ pathagamanaṃ bhavissati, nakkhattānaṃ uppathagamanaṃ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi [devadundubhi (syā. kaṃ. pī.)] bhavissati, candimasūriyanakkhattānaṃ uggamanaṃ ogamanaṃ saṃkilesaṃ vodānaṃ bhavissati, evaṃvipāko candaggāho bhavissati, evaṃvipāko sūriyaggāho bhavissati, evaṃvipāko nakkhattaggāho bhavissati, evaṃvipākaṃ candimasūriyānaṃ pathagamanaṃ bhavissati, evaṃvipākaṃ candimasūriyānaṃ uppathagamanaṃ bhavissati, evaṃvipākaṃ nakkhattānaṃ pathagamanaṃ bhavissati, evaṃvipākaṃ nakkhattānaṃ uppathagamanaṃ bhavissati, evaṃvipāko ukkāpāto bhavissati, evaṃvipāko disāḍāho bhavissati, evaṃvipāko bhūmicālo bhavissati, evaṃvipāko devadudrabhi bhavissati, evaṃvipākaṃ candimasūriyanakkhattānaṃ uggamanaṃ ogamanaṃ saṃkilesaṃ vodānaṃ bhavissati iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Or again, just as some respected ascetics and brahmins, having consumed food offered in faith, sustain their lives by such low arts and wrong livelihood, namely: they predict there will be a lunar eclipse, there will be a solar eclipse, there will be an eclipse of a star; the moon and sun will follow their proper course, the moon and sun will deviate from their proper course; the stars will follow their proper course, the stars will deviate from their proper course; there will be a meteor shower, there will be a conflagration in the sky, there will be an earthquake, there will be a thunderclap; the rising, setting, darkening, or brightening of the moon, sun, and stars will occur; a lunar eclipse will have such and such a result, a solar eclipse will have such and such a result, an eclipse of a star will have such and such a result; the moon and sun following their proper course will have such and such a result, the moon and sun deviating from their proper course will have such and such a result; the stars following their proper course will have such and such a result, the stars deviating from their proper course will have such and such a result; a meteor shower will have such and such a result, a conflagration in the sky will have such and such a result, an earthquake will have such and such a result, a thunderclap will have such and such a result; the rising, setting, darkening, or brightening of the moon, sun, and stars will have such and such a result – from such low arts and wrong livelihood, the ascetic Gotama abstains, they say. In this way, monks, an ordinary person, when speaking in praise of the Tathāgata, might speak.",
      "sinhala": "තවද, සමහර ගෞරවනීය ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා මෙවැනි තිරශ්චීන විද්‍යාවන් මගින් වැරදි ජීවනෝපායෙන් දිවි ගෙවති. එනම්: චන්ද්‍රග්‍රහණයක් සිදුවනු ඇත, සූර්යග්‍රහණයක් සිදුවනු ඇත, නක්‍ෂත්‍රග්‍රහණයක් සිදුවනු ඇත, හඳහිරුන්ගේ යහපත් ගමනක් සිදුවනු ඇත, හඳහිරුන්ගේ අයහපත් ගමනක් සිදුවනු ඇත, තාරකාවන්ගේ යහපත් ගමනක් සිදුවනු ඇත, තාරකාවන්ගේ අයහපත් ගමනක් සිදුවනු ඇත, උල්කාපාත වැටීමක් සිදුවනු ඇත, දිශා දැවිල්ලක් සිදුවනු ඇත, භූමිකම්පාවක් සිදුවනු ඇත, දෙව් බෙර හඬක් සිදුවනු ඇත, හඳහිරුන්ගේ හා තාරකාවන්ගේ නැගීමක්, බැසීමක්, කිලිටු වීමක්, පිරිසිදු වීමක් සිදුවනු ඇත, මෙබඳු විපාක ඇති චන්ද්‍රග්‍රහණයක් සිදුවනු ඇත, මෙබඳු විපාක ඇති සූර්යග්‍රහණයක් සිදුවනු ඇත, මෙබඳු විපාක ඇති නක්‍ෂත්‍රග්‍රහණයක් සිදුවනු ඇත, මෙබඳු විපාක ඇති හඳහිරුන්ගේ යහපත් ගමනක් සිදුවනු ඇත, මෙබඳු විපාක ඇති හඳහිරුන්ගේ අයහපත් ගමනක් සිදුවනු ඇත, මෙබඳු විපාක ඇති තාරකාවන්ගේ යහපත් ගමනක් සිදුවනු ඇත, මෙබඳු විපාක ඇති තාරකාවන්ගේ අයහපත් ගමනක් සිදුවනු ඇත, මෙබඳු විපාක ඇති උල්කාපාත වැටීමක් සිදුවනු ඇත, මෙබඳු විපාක ඇති දිශා දැවිල්ලක් සිදුවනු ඇත, මෙබඳු විපාක ඇති භූමිකම්පාවක් සිදුවනු ඇත, මෙබඳු විපාක ඇති දෙව් බෙර හඬක් සිදුවනු ඇත, මෙබඳු විපාක ඇති හඳහිරුන්ගේ හා තාරකාවන්ගේ නැගීමක්, බැසීමක්, කිලිටු වීමක් හෝ පිරිසිදු වීමක් සිදුවනු ඇතැයි කියා, මෙවැනි තිරශ්චීන විද්‍යාවන්ගෙන් යුත් වැරදි ජීවනෝපායවලින් ශ්‍රමණ ගෞතමයන් වහන්සේ වෙන්ව සිටින සේකැයි, භික්‍ෂූනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 25,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṃ bhavissati, dubbhikkhaṃ bhavissati, khemaṃ bhavissati, bhayaṃ bhavissati, rogo bhavissati, ārogyaṃ bhavissati, muddā, gaṇanā, saṅkhānaṃ, kāveyyaṃ, lokāyataṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Monks, an ordinary person, speaking in praise of the Tathāgata, would speak thus: ‘Just as some respected ascetics and brahmins, having consumed food given out of faith, maintain their livelihood by such base arts, by wrong livelihood—namely, by predicting: “There will be good rain, there will be bad rain; there will be abundance, there will be famine; there will be security, there will be danger; there will be sickness, there will be health”; or by engaging in palmistry, calculation, numerology, composing verses, or worldly sophistry—the recluse Gotama abstains from such base arts, from such wrong livelihood.’",
      "sinhala": "සමහර පූජ්‍ය ශ්‍රමණ-බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරිසන් විද්‍යාවන් වන මිථ්‍යා ආජීවයෙන් ජීවිකාව ගෙන යති. එනම්: වැසි හොඳින් ලැබෙනු ඇත, වැසි නොලැබෙනු ඇත, සශ්‍රීකත්වයක් ඇතිවනු ඇත, දුර්භික්ෂයක් ඇතිවනු ඇත, භය නැතිවනු ඇත, භයක් ඇතිවනු ඇත, රෝගයක් ඇතිවනු ඇත, නිරෝගීබවක් ඇතිවනු ඇත, මුද්‍රා විද්‍යාව, ගණන් බැලීම්, සංඛ්‍යා විද්‍යාව, කාව්‍ය රචනා, ලෝකායත දර්ශන විමසීම් ආදී මෙබඳු තිරිසන් විද්‍යාවන් වන මිථ්‍යා ආජීවයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේ වෙන් වී සිටින සේකැයි මහණෙනි, මෙසේද පෘථග්ජනයෙක් තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 26,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – āvāhanaṃ vivāhanaṃ saṃvaraṇaṃ vivaraṇaṃ saṃkiraṇaṃ vikiraṇaṃ subhagakaraṇaṃ dubbhagakaraṇaṃ viruddhagabbhakaraṇaṃ jivhānibandhanaṃ hanusaṃhananaṃ hatthābhijappanaṃ hanujappanaṃ kaṇṇajappanaṃ ādāsapañhaṃ kumārikapañhaṃ devapañhaṃ ādiccupaṭṭhānaṃ mahatupaṭṭhānaṃ abbhujjalanaṃ sirivhāyanaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya.",
      "english": "Monks, an ordinary person, speaking in praise of the Tathāgata, might thus speak: ‘Just as some respected recluses and brahmins, after partaking of food given out of faith, maintain their livelihood by such base arts, by wrong livelihood – namely: arranging marriages, dissolving marriages, ensuring good fortune, ensuring bad fortune, causing harm, causing benefit, making someone lucky, making someone unlucky, causing abortion, charming the tongue, charming the jaws, charming the hands, charming the jaw, charming the ear, mirror divination, maiden divination, god divination, sun worship, great offerings, making a fire blaze up, and invoking prosperity – and so forth, from such base arts, from such wrong livelihood, the recluse Gotama abstains.’",
      "sinhala": "මහණෙනි, පුහුදුන් පුද්ගලයා තථාගතයන් වහන්සේගේ ගුණ වර්ණනා කරන්නේ මෙසේය:\n‘සමහර ගෞරවනීය ශ්‍රමණ බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරිසන් විද්‍යාවන් වන මිථ්‍යා ආජීවයෙන් ජීවිකාව ගෙන යත්. එනම්: ආවාහ - විවාහ කටයුතු සිදුකිරීම, වෙන්කිරීම; යමක් වසාලීම, යමක් විවෘත කිරීම; යමක් එකතුකිරීම, යමක් විසුරුවා හැරීම; වාසනාවන්ත කිරීම, අවාසනාවන්ත කිරීම; ගබ්සා කිරීම; දිව බැඳීම; හනුපත් බැඳීම; අත්බැලීම; හනුපත් බලා ශාස්ත්‍ර කීම; කන්වලින් ශබ්ද අසා ශාස්ත්‍ර කීම; කණ්ණාඩි පේන බැලීම; කන්‍යා පේන බැලීම; දේව පේන බැලීම; සූර්‍ය පූජා පැවැත්වීම; මහා පුරුෂයන්ට පූජා පැවැත්වීම; ගිනි අවුලුවා පේන බැලීම; වාසනාව කැඳවීම යනාදී වශයෙනි. මේ ආකාරයේ හෝ වෙනත් මෙබඳු තිරිසන් විද්‍යාවන් වන මිථ්‍යා ආජීවයෙන් ශ්‍රමණ භාග්‍යවතුන් වහන්සේ වැළකී සිටින සේකැ’යි.",
      "paliTitle": ""
    },
    {
      "number": 27,
      "pali": "‘‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – santikammaṃ paṇidhikammaṃ bhūtakammaṃ bhūrikammaṃ vassakammaṃ vossakammaṃ vatthukammaṃ vatthuparikammaṃ ācamanaṃ nhāpanaṃ juhanaṃ vamanaṃ virecanaṃ uddhaṃvirecanaṃ adhovirecanaṃ sīsavirecanaṃ kaṇṇatelaṃ nettatappanaṃ natthukammaṃ añjanaṃ paccañjanaṃ sālākiyaṃ sallakattiyaṃ dārakatikicchā mūlabhesajjānaṃ anuppadānaṃ osadhīnaṃ paṭimokkho iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato samaṇo gotamo’ti – iti vā hi, bhikkhave, puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. ‘‘Idaṃ kho, bhikkhave, appamattakaṃ oramattakaṃ sīlamattakaṃ, yena puthujjano tathāgatassa vaṇṇaṃ vadamāno vadeyya. ",
      "english": "Just as some respected recluses and brahmins, having consumed food given out of faith, make their living by such base arts and wrong livelihood as: performing propitiatory rites, performing votive rituals, ghost charming, invoking earth deities, rain-making, rain-stopping, consecrating building sites, preparing building sites, rinsing the mouth, bathing, fire sacrifices, administering emetics, purgatives, upward purgatives, downward purgatives, head purgatives, ear oil treatments, eye treatments, nasal medications, anointing with collyrium, counter-collyrium, eye surgery, general surgery, child medicine, administering root medicines, and administering other medicines. ‘The recluse Gotama abstains from such base arts and wrong livelihood.’ Thus, O monks, an ordinary person, speaking in praise of the Tathagata, might speak. This, O monks, is but a trifling, inferior matter of morality, by which an ordinary person, speaking in praise of the Tathagata, might speak.",
      "sinhala": "මහණෙනි, යම් සේ ද ඇතැම් පූජ්‍ය ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරිසන් විද්‍යාවන් වන මිථ්‍යා ආජීවයෙන් ජීවිකාව ගෙන යත් ද, එනම්: ශාන්ති කර්ම, ප්‍රාර්ථනා කර්ම, භූත කර්ම, භූමි කර්ම, වර්ෂා කර්ම, වර්ෂා වැළැක්වීමේ කර්ම, වාස්තු කර්ම, වාස්තු පරිෂ්කරණ කර්ම, ආචමන (කට සේදීම්), ස්නාපන (නැහැවීම්), හෝම කිරීම්, වමන කර්ම, විරේක කර්ම, උඩු විරේක කර්ම, යටි විරේක කර්ම, ශීර්ෂ විරේක කර්ම, කන් තෙල්, නෙත් තර්පණ (ඇස් වලට බෙහෙත් දැමීම්), නාසික කර්ම, අංජන (ඇස් කඩ කළුරිය දැමීම්), ප්‍රත්‍යංජන (ප්‍රති අංජන), ශලාක්‍ය කර්ම, ශල්‍ය කර්ම, දාරක චිකිත්සා (ළමා රෝග ප්‍රතිකාර), මූල භේෂජ (මුල් බෙහෙත්) දීම්, ඖෂධ බැඳීම් යනාදියෙන්, මෙවැනි තිරිසන් විද්‍යාවන්ගෙන් යුත් මිථ්‍යා ආජීවයෙන් ශ්‍රමණ ගෞතමයන් වහන්සේ වැළකී සිටින සේකැයි, මහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියන්නේ එසේ කියනු ඇත.\n\nමහණෙනි, පෘථග්ජනයා තථාගතයන් වහන්සේගේ ගුණය කියමින් යමක් කියනු ඇත්ද, එය ඉතා සුළු, මඳ වූ, සිල් පමණ වූ දෙයකි.",
      "paliTitle": ""
    },
    {
      "number": 28,
      "pali": "‘‘Atthi, bhikkhave, aññeva dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. Katame ca te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ?",
      "english": "Monks, there are other truths that are profound, difficult to perceive, difficult to comprehend, peaceful, sublime, beyond logical reasoning, subtle, and to be experienced by the wise. These are what the Tathāgata himself, having realized them by direct knowledge, proclaims, and by which one, speaking rightly, would accurately describe the Tathāgata's true nature.\n\nAnd what are these truths, monks, that are profound, difficult to perceive, difficult to comprehend, peaceful, sublime, beyond logical reasoning, subtle, and to be experienced by the wise? These are what the Tathāgata himself, having realized them by direct knowledge, proclaims, and by which one, speaking rightly, would accurately describe the Tathāgata's true nature.",
      "sinhala": "භික්ෂූණි, ගැඹුරු වූ, දැකීමට අපහසු වූ, අවබෝධ කර ගැනීමට අපහසු වූ, ශාන්ත වූ, ප්‍ර‌ණීත වූ, තර්කයෙන් ළඟා විය නොහැකි වූ, සියුම් වූ, පණ්ඩිතයන් විසින් පමණක් අවබෝධ කළ හැකි වූ වෙනත් ධර්‌මයන් ඇත. තථාගතයන් වහන්සේ විසින් ස්වයං අධිඥාවෙන් සාක්ෂාත් කර ප්‍ර‌කාශ කරනු ලබන ඒ ධර්‌මයන් මගින් තථාගතයන් වහන්සේගේ සැබෑ ගුණ වර්ණනාවක් නිවැරදිව ප්‍ර‌කාශ කළ හැක.\n\nභික්ෂූණි, තථාගතයන් වහන්සේ ස්වයං අධිඥාවෙන් සාක්ෂාත් කර ප්‍ර‌කාශ කරන, ගැඹුරු වූ, දැකීමට අපහසු වූ, අවබෝධ කර ගැනීමට අපහසු වූ, ශාන්ත වූ, ප්‍ර‌ණීත වූ, තර්කයෙන් ළඟා විය නොහැකි වූ, සියුම් වූ, පණ්ඩිතයන් විසින් පමණක් අවබෝධ කළ හැකි වූ, තථාගතයන් වහන්සේගේ සැබෑ ගුණ වර්ණනාවක් නිවැරදිව ප්‍ර‌කාශ කළ හැකි වන ඒ ධර්‌මයන් කවරහු ද?",
      "paliTitle": "Pubbantakappikā",
      "englishTitle": "Speculators about the past",
      "sinhalaTitle": "පූර‍්ව‍ාන්ත කල්පිකයෝ"
    },
    {
      "number": 29,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino, pubbantaṃ ārabbha anekavihitāni adhimuttipadāni [adhivuttipadāni (sī. pī.)] abhivadanti aṭṭhārasahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi? ",
      "english": "Monks, there are some recluses and brahmins who speculate about the past and hold views concerning the past, and who declare various kinds of doctrinal assertions regarding the past, in eighteen ways. On what basis, and concerning what, do these venerable recluses and brahmins, who speculate about the past and hold views concerning the past, declare various kinds of doctrinal assertions regarding the past, in eighteen ways?",
      "sinhala": "මහණෙනි, අතීතය පිළිබඳව කල්පනා කරන්නා වූ ද, අතීතය පිළිබඳව දෘෂ්ටි දරන්නා වූ ද ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ අතීතය අරබයා කරුණු අටළොසකින් නොයෙක් අයුරින් මතවාද ප්‍රකාශ කරති. ඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් අරබයා ද, කුමක් පදනම් කරගෙන ද අතීතය පිළිබඳව කල්පනා කරන්නාහු ද, අතීතය පිළිබඳව දෘෂ්ටි දරන්නාහු ද, අතීතය අරබයා කරුණු අටළොසකින් නොයෙක් අයුරින් මතවාද ප්‍රකාශ කරති?",
      "paliTitle": ""
    },
    {
      "number": 30,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā sassatavādā, sassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi?",
      "english": "Bhikkhus, there are some ascetics and brahmins who are eternalists, declaring the self and the world to be eternal on four grounds. And relying on what, starting from what, do these venerable ascetics and brahmins, being eternalists, declare the self and the world to be eternal on four grounds?",
      "sinhala": "මහණෙනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ සදාකාලිකවාදීහු වෙති. ඔවුහු කරුණු සතරකින් ආත්මයත් ලෝකයත් සදාකාලික යැයි ප්‍රකාශ කරති.\n\nඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් පදනම් කරගෙනද, කුමක් අරමුණු කොටගෙනද, සතර කරුණකින් ආත්මයත් ලෝකයත් සදාකාලික යැයි ප්‍රකාශ කරත්ද?",
      "paliTitle": "Sassatavādo",
      "englishTitle": "Eternalism",
      "sinhalaTitle": "ශාශ්‍වතවාදය"
    },
    {
      "number": 31,
      "pali": "‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte ( ) [(parisuddhe pariyodāte anaṅgaṇe vigatūpattilese) (syā. ka.)] anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘So evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekānipi jātisatāni anekānipi jātisahassāni anekānipi jātisatasahassāni – amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti.",
      "english": "Here, monks, some recluse or brahmin, by applying ardour, exertion, perseverance, heedfulness, and right attention, attains such a mental concentration that, with the mind thus concentrated, he recollects various past lives. That is to say: one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many hundreds of births, many thousands of births, many hundreds of thousands of births. ‘There I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such pleasure and pain, having such a lifespan. Passing away from there, I arose there. There too I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such pleasure and pain, having such a lifespan. Passing away from there, I arose here.’ Thus he recollects various past lives with all their modes and details.\n\nHe then says: ‘The self and the world are eternal, barren, unmoving like a mountain peak, and firmly established like a pillar; yet these beings transmigrate, wander on, pass away, and reappear, existing continuously as eternal.’ For what reason? ‘Because I, by applying ardour, exertion, perseverance, heedfulness, and right attention, attain such a mental concentration that, with the mind thus concentrated, I recollect various past lives: one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births, many hundreds of births, many thousands of births, many hundreds of thousands of births. There I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such pleasure and pain, having such a lifespan. Passing away from there, I arose there. There too I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such pleasure and pain, having such a lifespan. Passing away from there, I arose here. Thus I recollect various past lives with all their modes and details. By this, I know that the self and the world are eternal, barren, unmoving like a mountain peak, and firmly established like a pillar; and these beings transmigrate, wander on, pass away, and reappear, existing continuously as eternal.’ This, monks, is the first ground, relying on which and referring to which, some recluses and brahmins, who are eternalists, proclaim the self and the world to be eternal.",
      "sinhala": "මහණෙනි, මෙලොව යම්කිසි ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් තැවීම, වීර්යය, උත්සාහය, අප්‍රමාදය, මනා සිහිය අනුගමනය කරමින් යම් ආකාරයක චිත්ත සමාධියක් ස්පර්ශ කරයි. එලෙස සමාධිගත වූ සිතින් නොයෙක් ආකාරයේ පෙර විසූ කඳන් සිහි කරයි. එනම්, එක ජාතියක්, දෙජාතියක්, තෙජාතියක්, සිව්ජාතියක්, පස්ජාතියක්, දසජාතියක්, විසිජාතියක්, තිස්ජාතියක්, සතළිස්ජාතියක්, පනස්ජාතියක්, සියජාතියක්, දහස්ජාතියක්, සිය දහස්ජාතියක්, බොහෝ සිය ගණන් ජාති, බොහෝ දහස් ගණන් ජාති, බොහෝ සිය දහස් ගණන් ජාති සිහි කරයි. ‘මම අසවල් තැන අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍රයෙහි වීමි, අසවල් වර්ණයෙන් යුක්ත වීමි, අසවල් ආහාර භුක්ති වින්දෙමි, අසවල් සැප දුක් විඳීමි, අසවල් ආයුෂ ප්‍රමාණය ඇත්තෙක් වීමි. එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එහිද මම අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍රයෙහි වීමි, අසවල් වර්ණයෙන් යුක්ත වීමි, අසවල් ආහාර භුක්ති වින්දෙමි, අසවල් සැප දුක් විඳීමි, අසවල් ආයුෂ ප්‍රමාණය ඇත්තෙක් වීමි. එතැනින් චුත වී මෙහි උපන්නෙමි’ යනුයි. මෙලෙස ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාරයේ පෙර විසූ කඳන් සිහි කරයි.\n\nඔහු මෙසේ කියයි: ‘ආත්මයත් ලෝකයත් ශාශ්වතය, වන්ධ්‍යය, කූටස්ථය, කණුවක් මෙන් ස්ථිරය. ඒ සත්වයෝ සසර සැරිසරති, චුත වෙති, නැවත උපදිති, නිරතුරුවම ශාශ්වත ලෙස පවතී.’ ‘එය කුමන හේතුවක් නිසාද? මක්නිසාද යත්, මම තැවීම, වීර්යය, උත්සාහය, අප්‍රමාදය, මනා සිහිය අනුගමනය කරමින් යම් ආකාරයක චිත්ත සමාධියක් ස්පර්ශ කරමි. එලෙස සමාධිගත වූ සිතින් නොයෙක් ආකාරයේ පෙර විසූ කඳන් සිහි කරමි. එනම්, එක ජාතියක්, දෙජාතියක්, තෙජාතියක්, සිව්ජාතියක්, පස්ජාතියක්, දසජාතියක්, විසිජාතියක්, තිස්ජාතියක්, සතළිස්ජාතියක්, පනස්ජාතියක්, සියජාතියක්, දහස්ජාතියක්, සිය දහස්ජාතියක්, බොහෝ සිය ගණන් ජාති, බොහෝ දහස් ගණන් ජාති, බොහෝ සිය දහස් ගණන් ජාති සිහි කරමි. ‘මම අසවල් තැන අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍රයෙහි වීමි, අසවල් වර්ණයෙන් යුක්ත වීමි, අසවල් ආහාර භුක්ති වින්දෙමි, අසවල් සැප දුක් විඳීමි, අසවල් ආයුෂ ප්‍රමාණය ඇත්තෙක් වීමි. එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එහිද මම අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍රයෙහි වීමි, අසවල් වර්ණයෙන් යුක්ත වීමි, අසවල් ආහාර භුක්ති වින්දෙමි, අසවල් සැප දුක් විඳීමි, අසවල් ආයුෂ ප්‍රමාණය ඇත්තෙක් වීමි. එතැනින් චුත වී මෙහි උපන්නෙමි’ යනුයි. මෙලෙස ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාරයේ පෙර විසූ කඳන් සිහි කරමි. මේ හේතුවෙන් මම දනිමි, ආත්මයත් ලෝකයත් ශාශ්වතය, වන්ධ්‍යය, කූටස්ථය, කණුවක් මෙන් ස්ථිරය. ඒ සත්වයෝ සසර සැරිසරති, චුත වෙති, නැවත උපදිති, නිරතුරුවම ශාශ්වත ලෙස පවතී’ යැයි. මහණෙනි, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ ආත්මයත් ලෝකයත් ශාශ්වතයයි ප්‍රකාශ කරන ශාශ්වතවාදීන් බවට පත්වන්නේ, යම් කරුණක් පදනම් කරගෙනද, යම් කරුණක් අරභයාද, එය මෙයයි.",
      "paliTitle": ""
    },
    {
      "number": 32,
      "pali": "‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘So evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi. Seyyathidaṃ – ekampi saṃvaṭṭavivaṭṭaṃ dvepi saṃvaṭṭavivaṭṭāni tīṇipi saṃvaṭṭavivaṭṭāni cattāripi saṃvaṭṭavivaṭṭāni pañcapi saṃvaṭṭavivaṭṭāni dasapi saṃvaṭṭavivaṭṭāni. Amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito, te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti.",
      "english": "And secondly, venerable recluses and brahmins, relying on what, referring to what, do these eternalists proclaim the self and the world to be eternal?\n\nHere, monks, a certain recluse or brahmin, through ardent effort, through striving, through application, through diligence, and through right attention, attains such a mental concentration that, with his mind thus concentrated, he recollects his manifold past existences. That is to say, one aeon of contraction and expansion, two aeons of contraction and expansion, three aeons of contraction and expansion, four aeons of contraction and expansion, five aeons of contraction and expansion, ten aeons of contraction and expansion. He recollects: ‘I was there with such a name, of such a clan, of such a complexion, such was my food, such was my experience of pleasure and pain, such was the limit of my life. Having passed away from there, I arose yonder. There too I was with such a name, of such a clan, of such a complexion, such was my food, such was my experience of pleasure and pain, such was the limit of my life. Having passed away from there, I reappeared here.’ Thus, with its aspects and details, he recollects his manifold past existences.\n\nHe then says: ‘The self and the world are eternal, barren, standing firm like a mountain peak, established like a pillar. But those beings wander and transmigrate, pass away and reappear, yet they exist always the same forever.’ Why is that? ‘For I myself, through ardent effort, through striving, through application, through diligence, and through right attention, attain such a mental concentration that, with my mind thus concentrated, I recollect my manifold past existences. That is to say, one aeon of contraction and expansion, two aeons of contraction and expansion, three aeons of contraction and expansion, four aeons of contraction and expansion, five aeons of contraction and expansion, ten aeons of contraction and expansion. I was there with such a name, of such a clan, of such a complexion, such was my food, such was my experience of pleasure and pain, such was the limit of my life. Having passed away from there, I arose yonder. There too I was with such a name, of such a clan, of such a complexion, such was my food, such was my experience of pleasure and pain, such was the limit of my life. Having passed away from there, I reappeared here. Thus, with its aspects and details, I recollect my manifold past existences. By this I know that the self and the world are eternal, barren, standing firm like a mountain peak, established like a pillar; and that those beings wander and transmigrate, pass away and reappear, yet they exist always the same forever.’ This, monks, is the second basis, relying on which, referring to which, some recluses and brahmins, eternalists, proclaim the self and the world to be eternal.",
      "sinhala": "පින්වතුනි, දෙවනු ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණවරු කුමක් අරමුණු කොටගෙන, කුමක් හේතු කොටගෙන ශාශ්වතවාදීන් වී ආත්මයත් ලෝකයත් සදාකාලික යැයි ප්‍ර‌කාශ කරත්ද? මහණෙනි, මෙහිලා ඇතැම් ශ්‍ර‌මණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ තපසෙහි නිරතව, උත්සාහයෙන්, පුරුද්දෙහි යෙදී, අප්‍රමාදීව, මනාව මෙනෙහි කිරීමෙහි යෙදී, යම් ආකාරයක චිත්ත සමාධියක් ලබා ගනියි. එසේ සමාධිගත වූ සිතකින් නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි. එනම්, එක සංවට්ට-විවට්ට කල්පයක් ද, සංවට්ට-විවට්ට කල්ප දෙකක් ද, සංවට්ට-විවට්ට කල්ප තුනක් ද, සංවට්ට-විවට්ට කල්ප හතරක් ද, සංවට්ට-විවට්ට කල්ප පහක් ද, සංවට්ට-විවට්ට කල්ප දහයක් ද යන මේවා සිහි කරයි. 'මම අසවල් තැන අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍රය ඇත්තෙක් වීමි, අසවල් වර්ණය ඇත්තෙක් වීමි, අසවල් ආහාර ඇත්තෙක් වීමි, අසවල් ආකාරයේ සැප දුක් විඳීමි, අසවල් ආයුෂ ප්‍ර‌මාණය ඇත්තෙක් වීමි. මම ඒ තැනින් චුත වී අසවල් තැන උපන්නෙමි. එහිදී ද අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍රය ඇත්තෙක් වීමි, අසවල් වර්ණය ඇත්තෙක් වීමි, අසවල් ආහාර ඇත්තෙක් වීමි, අසවල් ආකාරයේ සැප දුක් විඳීමි, අසවල් ආයුෂ ප්‍ර‌මාණය ඇත්තෙක් වීමි. මම ඒ තැනින් චුත වී මෙහි උපන්නෙමි' යි. මෙසේ ආකාර සහිතව, විස්තර සහිතව නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි.\n\nහෙතෙම මෙසේ කියයි: 'ආත්මයත් ලෝකයත් සදාකාලිකය, නිශ්චලය, කූටස්ථය, එළිපහන් කණුවක් මෙන් ස්ථිරව පිහිටා ඇත. එම සත්වයෝ සැරිසරති, ඉපදෙති, මැරෙති, යළි උපදිති. එහෙත් සදාකාලිකවම පවතින්නේය.' 'ඒ කිමෙක් නිසාද? මම නම් තපසෙහි නිරතව, උත්සාහයෙන්, පුරුද්දෙහි යෙදී, අප්‍රමාදීව, මනාව මෙනෙහි කිරීමෙහි යෙදී, යම් ආකාරයක චිත්ත සමාධියක් ලබා ගනිමි. එසේ සමාධිගත වූ සිතකින් නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරමි. එනම්, එක සංවට්ට-විවට්ට කල්පයක් ද, සංවට්ට-විවට්ට කල්ප දෙකක් ද, සංවට්ට-විවට්ට කල්ප තුනක් ද, සංවට්ට-විවට්ට කල්ප හතරක් ද, සංවට්ට-විවට්ට කල්ප පහක් ද, සංවට්ට-විවට්ට කල්ප දහයක් ද යන මේවා සිහි කරමි. අසවල් තැන අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍රය ඇත්තෙක් වීමි, අසවල් වර්ණය ඇත්තෙක් වීමි, අසවල් ආහාර ඇත්තෙක් වීමි, අසවල් ආකාරයේ සැප දුක් විඳීමි, අසවල් ආයුෂ ප්‍ර‌මාණය ඇත්තෙක් වීමි. මම ඒ තැනින් චුත වී අසවල් තැන උපන්නෙමි. එහිදී ද අසවල් නම් ඇත්තෙක් වීමි, අසවල් ගෝත්‍රය ඇත්තෙක් වීමි, අසවල් වර්ණය ඇත්තෙක් වීමි, අසවල් ආහාර ඇත්තෙක් වීමි, අසවල් ආකාරයේ සැප දුක් විඳීමි, අසවල් ආයුෂ ප්‍ර‌මාණය ඇත්තෙක් වීමි. මම ඒ තැනින් චුත වී මෙහි උපන්නෙමි' යි. මෙසේ ආකාර සහිතව, විස්තර සහිතව නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරමි. මම මෙයින් මේ බව දනිමි: 'කෙසේද යත්, ආත්මයත් ලෝකයත් සදාකාලිකය, නිශ්චලය, කූටස්ථය, එළිපහන් කණුවක් මෙන් ස්ථිරව පිහිටා ඇත. එම සත්වයෝ සැරිසරති, ඉපදෙති, මැරෙති, යළි උපදිති. එහෙත් සදාකාලිකවම පවතින්නේය' යි. මහණෙනි, ඇතැම් ශ්‍ර‌මණ-බ්‍රාහ්මණවරු යමක් අරමුණු කොටගෙන, යමක් හේතු කොටගෙන ශාශ්වතවාදීන් වී ආත්මයත් ලෝකයත් සදාකාලික යැයි ප්‍ර‌කාශ කරන්නේ, මේ දෙවැනි කරුණයි.",
      "paliTitle": ""
    },
    {
      "number": 33,
      "pali": "‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘So evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisamaṃ. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte anekavihitaṃ pubbenivāsaṃ anussarāmi. Seyyathidaṃ – dasapi saṃvaṭṭavivaṭṭāni vīsampi saṃvaṭṭavivaṭṭāni tiṃsampi saṃvaṭṭavivaṭṭāni cattālīsampi saṃvaṭṭavivaṭṭāni – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapannoti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarāmi. Imināmahaṃ etaṃ jānāmi ‘‘yathā sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito, te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’’nti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti.",
      "english": "And Bhikkhus, based on what, concerning what, do some recluses and brahmins, proclaiming eternalism, declare the self and the world to be eternal? Here, Bhikkhus, a certain recluse or brahmin, through strenuous exertion, persistent effort, diligent application, heedfulness, and right attention, attains such a concentration of mind that, with his mind thus concentrated, he recollects his manifold past lives. That is to say – ten eons of world-contraction and expansion, twenty eons of world-contraction and expansion, thirty eons of world-contraction and expansion, forty eons of world-contraction and expansion – ‘There I was of such a name, such a clan, such a complexion, subsisting on such a food, experiencing such pleasure and pain, with such a lifespan; passing away from there, I arose yonder; there too I was of such a name, such a clan, such a complexion, subsisting on such a food, experiencing such pleasure and pain, with such a lifespan; passing away from there, I have arisen here.’ Thus he recollects his manifold past lives in their mode and detail.\n\nHe then says: ‘The self and the world are eternal, barren, unmoving, and standing firm like a pillar; and these beings wander, transmigrate, pass away, and reappear, but existence endures for all eternity. What is the reason for that? Because I, through strenuous exertion, persistent effort, diligent application, heedfulness, and right attention, attain such a concentration of mind that, with my mind thus concentrated, I recollect my manifold past lives. That is to say – ten eons of world-contraction and expansion, twenty eons of world-contraction and expansion, thirty eons of world-contraction and expansion, forty eons of world-contraction and expansion – ‘There I was of such a name, such a clan, such a complexion, subsisting on such a food, experiencing such pleasure and pain, with such a lifespan; passing away from there, I arose yonder; there too I was of such a name, such a clan, such a complexion, subsisting on such a food, experiencing such pleasure and pain, with such a lifespan; passing away from there, I have arisen here.’ Thus I recollect my manifold past lives in their mode and detail. It is by this that I know that the self and the world are eternal, barren, unmoving, and standing firm like a pillar; and these beings wander, transmigrate, pass away, and reappear, but existence endures for all eternity.’ This, Bhikkhus, is the third basis, by reason of which, concerning which, some recluses and brahmins, proclaiming eternalism, declare the self and the world to be eternal.",
      "sinhala": "තෙවැනිව ද පින්වත් ශ්‍ර‍මණබ්‍රාහ්මණයෝ කුමක් මුල්කරගෙන, කුමක් අරභයා ආත්මයත් ලෝකයත් ශාශ්වතයයි ප්‍ර‍කාශ කරත් ද? මහණෙනි, මෙහිලා සමහර ශ්‍ර‍මණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ වීර්යයෙහි යෙදීමෙන්, ප්‍ර‍ධාන වීර්යයෙන්, අනුයුක්තව සිටීමෙන්, අප්‍ර‍මාදීව සිටීමෙන්, මනාකොට මෙනෙහි කිරීමෙන් යම් ආකාරයක චිත්ත සමාධියක් ස්පර්ශ කරයි ද, එසේ සමාධිගත වූ සිතින් නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි. එනම්, දස කප් (සංවට්ට-විවට්ට) ද, විසි කප් ද, තිස් කප් ද, හතළිස් කප් ද – 'මම අසවල් තැන අසවල් නමින්, අසවල් ගෝත්‍රයෙන්, අසවල් වර්ණයෙන් යුක්තව, අසවල් ආහාරයෙන් යැපෙමින්, මෙබඳු සැපදුක් විඳිමින්, මෙපමණ ආයුෂක් ඇතිව සිටියෙමි. මම එතැනින් චුතව අසවල් තැන උපන්නෙමි. එතැනදී ද මම අසවල් නමින්, අසවල් ගෝත්‍රයෙන්, අසවල් වර්ණයෙන් යුක්තව, අසවල් ආහාරයෙන් යැපෙමින්, මෙබඳු සැපදුක් විඳිමින්, මෙපමණ ආයුෂක් ඇතිව සිටියෙමි. මම එතැනින් චුතව මෙහි උපන්නෙමි' යි. මෙසේ ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි.\n\nඔහු මෙසේ කියයි – 'ආත්මයත් ලෝකයත් ශාශ්වත ය, වඳ ය, කූටස්ථ ය, කණුවක් මෙන් ස්ථාවර ය; ඒ සත්වයෝ ද සංසාරයේ සැරිසරති, සංසරණය වෙති, චුත වෙති, නැවත උපදිති, සදාකාලිකව ම පවතී.' එයට හේතුව කුමක් ද? මම වීර්යයෙහි යෙදීමෙන්, ප්‍ර‍ධාන වීර්යයෙන්, අනුයුක්තව සිටීමෙන්, අප්‍ර‍මාදීව සිටීමෙන්, මනාකොට මෙනෙහි කිරීමෙන් යම් ආකාරයක චිත්ත සමාධියක් ස්පර්ශ කරමි. එසේ සමාධිගත වූ සිතින් නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරමි. එනම්, දස කප් (සංවට්ට-විවට්ට) ද, විසි කප් ද, තිස් කප් ද, හතළිස් කප් ද – 'මම අසවල් තැන අසවල් නමින්, අසවල් ගෝත්‍රයෙන්, අසවල් වර්ණයෙන් යුක්තව, අසවල් ආහාරයෙන් යැපෙමින්, මෙබඳු සැපදුක් විඳිමින්, මෙපමණ ආයුෂක් ඇතිව සිටියෙමි. මම එතැනින් චුතව අසවල් තැන උපන්නෙමි. එතැනදී ද මම අසවල් නමින්, අසවල් ගෝත්‍රයෙන්, අසවල් වර්ණයෙන් යුක්තව, අසවල් ආහාරයෙන් යැපෙමින්, මෙබඳු සැපදුක් විඳිමින්, මෙපමණ ආයුෂක් ඇතිව සිටියෙමි. මම එතැනින් චුතව මෙහි උපන්නෙමි' යි. මෙසේ ආකාර සහිතව, අරමුණු සහිතව, නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරමි. මේ හේතුවෙන් මම මෙය දනිමි 'ආත්මයත් ලෝකයත් ශාශ්වත ය, වඳ ය, කූටස්ථ ය, කණුවක් මෙන් ස්ථාවර ය, ඒ සත්වයෝ ද සංසාරයේ සැරිසරති, සංසරණය වෙති, චුත වෙති, නැවත උපදිති, සදාකාලිකව ම පවතී' කියා යි. මහණෙනි, මෙය තෙවැනි කරුණ යි, යමක් මුල්කරගෙන, යමක් අරභයා සමහර ශ්‍ර‍මණබ්‍රාහ්මණයෝ ශාශ්වතවාදීව ආත්මයත් ලෝකයත් ශාශ්වතයයි ප්‍ර‍කාශ කරත්.",
      "paliTitle": ""
    },
    {
      "number": 34,
      "pali": "‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha sassatavādā sassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī, so takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃ paṭibhānaṃ evamāha – ‘sassato attā ca loko ca vañjho kūṭaṭṭho esikaṭṭhāyiṭṭhito; te ca sattā sandhāvanti saṃsaranti cavanti upapajjanti, atthitveva sassatisama’nti. Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti.",
      "english": "And for the fourth point: based on what, originating from what, do those reverend ascetics and brahmins, who are eternalists, declare the self and the world to be eternal?\n\nHere, monks, a certain ascetic or brahmin is a reasoner and an investigator. He, led by reasoning and followed by investigation, speaks thus based on his own spontaneous insight:\n\n‘The self and the world are eternal, unmoving, fixed like a mountain peak, and standing firm like a pillar. And though beings run on, wander on, pass away, and reappear, there remains that very same eternity.’\n\nThis, monks, is the fourth ground, based on which and starting from which certain ascetics and brahmins, who are eternalists, declare the self and the world to be eternal.",
      "sinhala": "මහණෙනි, හතරවෙනුවට, ඒ භවත් මහණ බමුණෝ කුමක් ආශ්‍රය කරගෙනද, කුමක් අරමුණු කරගෙනද, ආත්මය ද ලෝකය ද සස්සතයයි ප්‍රකාශ කරත් ද?\n\nමහණෙනි, මෙහි යම් කිසි මහණෙක් හෝ බමුණෙක් හෝ තර්ක කරන, විමසන සුලු අයෙක් වෙයි. හේ තර්කයෙන් පෙලඹී, විමසීමෙන් අනුගමනය කර, තමාගේම ප්‍රතිභානය මෙසේ ප්‍රකාශ කරයි: ‘ආත්මය ද ලෝකය ද සස්සතය (නිත්‍යය), වඳය, කූටස්ථය, කණුවක් මෙන් ස්ථිරව පිහිටා ඇත. ඒ සත්ත්වයෝ නම් සැරිසරත්, සංසාරයේ ගමන් කරත්, චුත වෙත්, උපදිත්. එහෙත් සස්සත ස්වභාවය සැමදා එසේම පවතී.’\n\nමහණෙනි, මෙය සතරවෙනි කරුණයි, යමක් ආශ්‍රය කරගෙන, යමක් අරමුණු කරගෙන සමහර මහණ බමුණෝ සස්සතවාදීහු ආත්මය ද ලෝකය ද සස්සතයයි ප්‍රකාශ කරත්.",
      "paliTitle": ""
    },
    {
      "number": 35,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā sassatavādā sassataṃ attānañca lokañca paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā.",
      "english": "Monks, it is by these four grounds that those ascetics and brahmins, the eternalists, proclaim the self and the world to be eternal. Whatever ascetics or brahmins, monks, being eternalists, proclaim the self and the world to be eternal, all of them do so by these same four grounds, or by one of them; there is nothing beyond this.",
      "sinhala": "මහණෙනි, ශාශ්වතවාදී වන ඒ ශ්‍රමණබ්‍රාහ්මණයෝ මේ සතර වස්තුවෙන් ආත්මය ද ලෝකය ද ශාශ්වත යැයි ප්‍රකාශ කරති. මහණෙනි, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ශාශ්වතවාදීව ආත්මය ද ලෝකය ද ශාශ්වත යැයි ප්‍රකාශ කරත් ද, ඒ සියල්ලෝ ම මේ සතර වස්තුවෙන් හෝ මේවායින් එක් වස්තුවකින් හෝ (එසේ ප්‍රකාශ කරති); මෙයින් පිටත වෙනත් ක්‍රමයක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 36,
      "pali": "‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti, tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti; tañca pajānanaṃ [pajānaṃ (?) dī. ni. 3.36 pāḷiaṭṭhakathā passitabbaṃ] na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato.",
      "english": "Monks, the Tathāgata fully comprehends this: 'These views, thus embraced and thus clung to, lead to such a destination and such a future existence.' That the Tathāgata fully comprehends, and he comprehends what is even superior to that. That comprehension he does not cling to. For him, not clinging, Nibbāna is personally realized. Having truly understood the origin, the cessation, the gratification, the danger, and the escape from feelings, the Tathāgata, monks, is liberated without clinging.",
      "sinhala": "භික්‍ෂූනි, තථාගතයන් වහන්සේ මේ කාරණය දන්නා සේක: ‘මේ දෘෂ්ටිස්ථාන මෙලෙසින් ගත්තා වූ, මෙලෙසින් පරාමර්ශනය කරන ලද්දා වූ, මෙවැනි ගතියක් ඇත්තා වූ, මෙවැනි පරලොවක් ඇත්තා වූ දේවල් වෙති.’ තථාගතයන් වහන්සේ එයද දන්නා සේක, ඊටත් වඩා උසස් දේ දන්නා සේක. ඒ දැනගැනීම උන්වහන්සේ පරාමර්ශනය නොකරන සේක. පරාමර්ශනය නොකරන උන්වහන්සේට පුද්ගලිකවම නිවන ප්‍රකට වේ. භික්‍ෂූනි, වේදනාවන්ගේ හටගැනීමද, නැතිවීමද, ආශ්වාදයද, ආදීනවයද, නිස්සරණයද ඇති සැටියෙන් දැන, තථාගතයන් වහන්සේ උපාදාන රහිතව විමුක්ත වූ සේක.",
      "paliTitle": ""
    },
    {
      "number": 37,
      "pali": "‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. Paṭhamabhāṇavāro. ",
      "english": "Indeed, monastics, these are the teachings — profound, difficult to perceive, difficult to comprehend, peaceful, sublime, beyond the sphere of logic, subtle, and to be realized by the wise — which the Tathāgata, having directly known and personally realized, proclaims, and by which one speaking rightly would speak the true praise of the Tathāgata.",
      "sinhala": "මහණෙනි, මේ ධර්‍ම‍යෝ ගැඹුරුය, දැකීමට දුෂ්කරය, අවබෝධ කිරීමට දුෂ්කරය, ශාන්තය, ප්‍ර‍ණීතය, තර්කයට හසු නොවන, සියුම්ය, පණ්ඩිතයන් විසින්ම අවබෝධ කළ යුත්තාහ. යම් ධර්‍මයන් තථාගතයන් වහන්සේ විසින්ම අභිඥාඥානයෙන් ප්‍ර‍ත්‍යක්‍ෂ කොට දේශනා කරනු ලබත්ද, යම් ධර්‍මයන් නිසා තථාගතයන් වහන්සේගේ යථාභූත ගුණය මැනවින් කියන්නෙක් මැනවින් කියන්නේද, මේ ධර්‍මයෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 38,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi?",
      "english": "Monks, there are some recluses and brahmins who are partly eternalists and partly non-eternalists, and who declare the self and the world to be partly eternal and partly non-eternal, on four grounds. And upon what do those venerable recluses and brahmins base their views, upon what do they premise their assertions, in being partly eternalists and partly non-eternalists, and in declaring the self and the world to be partly eternal and partly non-eternal, on four grounds?",
      "sinhala": "මහණෙනි, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ කොටසක් ශාශ්වත යැයි ද, කොටසක් අශාශ්වත යැයි ද ආත්මය ද, ලෝකය ද සතර කරුණකින් පනවති. ඒ භවත් ශ්‍රමණ බ්‍රාහ්මණයෝ කුමක් මුල් කරගෙන, කුමක් අරඹයා ද කොටසක් ශාශ්වත යැයි ද, කොටසක් අශාශ්වත යැයි ද ආත්මය ද, ලෝකය ද සතර කරුණකින් පනවති ද?",
      "paliTitle": "Ekaccasassatavādo",
      "englishTitle": "Partial Eternalism",
      "sinhalaTitle": "අර්ධ සදාකාලික වාදය"
    },
    {
      "number": 39,
      "pali": "‘‘Hoti kho so, bhikkhave, samayo, yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko saṃvaṭṭati. Saṃvaṭṭamāne loke yebhuyyena sattā ābhassarasaṃvattanikā honti. Te tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti.",
      "english": "Indeed, O bhikkhus, there comes a time, sometimes or other, after the lapse of a long, long period, when this world undergoes dissolution. When the world is undergoing dissolution, beings for the most part are reborn in the Ābhassara Brahma world. There they are mind-made, feeding on joy, self-luminous, moving through space, and abiding in a beautiful state; they remain for a very long period, for an extensive time.",
      "sinhala": "භික්‍ෂූනි, යම් කලෙක, කවදා හෝ දීර්ඝ කාලයක් ගෙවී යෑමෙන් පසු මේ ලෝකය සංවර්තනය වන සමයක් පැමිණේ. ලෝකය සංවර්තනය වෙද්දී බොහෝ සත්වයෝ ආභස්සර බ්‍රහ්ම ලෝකයට උපත ලබති. ඔවුහු එහි මනෝමය වෙති, ප්‍රීතිය ආහාර කොට ඇත්තෝ වෙති, ස්වයංප්‍රභා ඇත්තෝ වෙති, අහසේ හැසිරෙන්නෝ වෙති, ශුභ විහරණ ඇත්තෝ වෙති; ඔවුහු දීර්ඝ කාලයක් එහි වෙසෙති.",
      "paliTitle": ""
    },
    {
      "number": 40,
      "pali": "‘‘Hoti kho so, bhikkhave, samayo, yaṃ kadāci karahaci dīghassa addhuno accayena ayaṃ loko vivaṭṭati. Vivaṭṭamāne loke suññaṃ brahmavimānaṃ pātubhavati. Atha kho aññataro satto āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā suññaṃ brahmavimānaṃ upapajjati. So tattha hoti manomayo pītibhakkho sayaṃpabho antalikkhacaro subhaṭṭhāyī, ciraṃ dīghamaddhānaṃ tiṭṭhati.",
      "english": "There comes a time, monks, when, at some time or other, after a very long period, this world contracts. As the world contracts, an empty Brahma-abode comes into being. Then indeed, some being, either due to the exhaustion of his life span or the exhaustion of his merit, having fallen from the World of Streaming Radiance, is reborn into that empty Brahma-abode. He there is mind-made, feeding on joy, self-luminous, moving through space, and glorious, and he remains there for a very long time.",
      "sinhala": "භික්ෂූනි, ඇතැම් විට දීර්ඝ කාලයකට පසු මේ ලෝකය සංවර්තනය වන කාලයක් එළඹේ. ලෝකය සංවර්තනය වෙද්දී, ශූන්‍ය වූ බ්‍රහ්ම විමානයක් පහළ වේ. ඉන්පසු යම් කිසි සත්වයෙක් ආයුෂ ක්ෂය වීමෙන් හෝ පින් ක්ෂය වීමෙන් හෝ ආභස්සර බ්‍රහ්ම ලෝකයෙන් චුත වී, ශූන්‍ය වූ බ්‍රහ්ම විමානයට පහළ වේ. හෙතෙම එහි මනෝමය, ප්‍රීතිය අහර කොට ඇති, ස්වයංප්‍රභා ඇති, අහසේ ගමන් කරන, සුභ ස්ථායී වූවෙක්ව දීර්ඝ කාලයක් වාසය කරයි.",
      "paliTitle": ""
    },
    {
      "number": 41,
      "pali": "‘‘Tassa tattha ekakassa dīgharattaṃ nivusitattā anabhirati paritassanā upapajjati – ‘aho vata aññepi sattā itthattaṃ āgaccheyyu’nti. Atha aññepi sattā āyukkhayā vā puññakkhayā vā ābhassarakāyā cavitvā brahmavimānaṃ upapajjanti tassa sattassa sahabyataṃ. Tepi tattha honti manomayā pītibhakkhā sayaṃpabhā antalikkhacarā subhaṭṭhāyino, ciraṃ dīghamaddhānaṃ tiṭṭhanti.",
      "english": "To him, dwelling there alone for a long time, discontent and agitation arose, thinking: ‘Oh, if only other beings would come to this state!’ Then, other beings, due to the exhaustion of their life-span or the exhaustion of their merit, fall from the Ābhassara realm and are reborn in that Brahma-realm, into companionship with that being. They too are there, mind-made, feeding on joy, self-luminous, moving through space, and abiding in a beautiful state. They remain there for a long, long time.",
      "sinhala": "එහි තනිව දීර්ඝ කාලයක් වාසය කළ නිසා, ඔහුට අසතුටක් හා පරිතැවීමක් ඇතිවේ: ‘අනේ, වෙනත් සත්ත්වයෝද මෙතැනට පැමිණිය යුතු නම්!’ එවිට, වෙනත් සත්ත්වයෝද ආයුෂ ක්ෂය වීමෙන් හෝ පින් ක්ෂය වීමෙන් හෝ ආභස්සර කායෙන් චුත වී, එම සත්ත්වයාගේ සහයෝගය සඳහා බ්‍රහ්ම විමානයට උපදිත්. ඔවුහුද එහි මනෝමය වූ, ප්‍රීතිය භෝජනය කොට ඇති, ස්වයංප්‍රභා වූ, අහසේ සැරිසරන, සුභ ස්ථිතියක පිහිටියා වූ වෙති; ඔවුහු බොහෝ කලක්, දීර්ඝ කාලයක් වාසය කරත්.",
      "paliTitle": ""
    },
    {
      "number": 42,
      "pali": "‘‘Tatra, bhikkhave, yo so satto paṭhamaṃ upapanno tassa evaṃ hoti – ‘ahamasmi brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā [sajjitā (syā. kaṃ.)] vasī pitā bhūtabhabyānaṃ. Mayā ime sattā nimmitā. Taṃ kissa hetu? Mamañhi pubbe etadahosi – ‘‘aho vata aññepi sattā itthattaṃ āgaccheyyu’’nti. Iti mama ca manopaṇidhi, ime ca sattā itthattaṃ āgatā’ti. ‘‘Yepi te sattā pacchā upapannā, tesampi evaṃ hoti – ‘ayaṃ kho bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ. Iminā mayaṃ bhotā brahmunā nimmitā. Taṃ kissa hetu? Imañhi mayaṃ addasāma idha paṭhamaṃ upapannaṃ, mayaṃ panamha pacchā upapannā’ti.",
      "english": "\"There, monks, that being who was reborn there first, to him it occurs thus: 'I am Brahmā, the Great Brahmā, the conqueror, the unconquered, the all-seeing, the wielder of power, the lord, the maker, the creator, the best, the dispenser, the master, the father of all that has been and will be. By me these beings were created. Why is that? Because earlier it occurred to me: \"Oh, if only other beings would come to this state!\" Thus, this was my mental aspiration, and these beings have come to this state.'\n\nAnd those beings who were reborn later, to them it also occurs thus: 'Indeed, this venerable Brahmā, the Great Brahmā, is the conqueror, the unconquered, the all-seeing, the wielder of power, the lord, the maker, the creator, the best, the dispenser, the master, the father of all that has been and will be. By this venerable Brahmā, we were created. Why is that? Because we saw him here reborn first, while we were reborn later.'\"",
      "sinhala": "එතකොට, මහණෙනි, යම් සත්වයෙක් මුලින්ම එහි උපන්නේද, ඔහුට මෙසේ සිතක් ඇතිවේ: ‘මමයි බ්‍රහ්මා, මහාබ්‍රහ්මා, අන් සියල්ලන් මැඩගත්, කිසිවෙකුට මැඩලිය නොහැකි, අන්‍ය දේ දකින්නා වූ, වසඟ කරන්නා වූ, ඊශ්වර වූ, කරන්නා වූ, නිර්මාතෘ වූ, ශ්‍රේෂ්ඨ වූ, නිර්මාණය කරන්නා වූ, වසඟයෙහි පවතින, උපන් හා උපදින සත්වයන්ගේ පියා. මා විසින් මේ සත්වයෝ නිර්මාණය කරන ලදහ. ඒ කුමක් හෙයින්ද? මා හට පෙර මෙබඳු සිතක් පහළ විය – ‘‘අහෝ වත අන්‍ය සත්වයෝද මේ තත්වයට පැමිණෙත්වා’’ යනුවෙන්. මෙසේ මාගේ මනෝ ප්‍රණිධානයෙන් මේ සත්වයෝ මේ තත්වයට පැමිණියාහ’යි.\n\nයම් සත්වයෝ පසු කාලයකදී එහි උපන්නාහුද, ඔවුන්ටද මෙසේ සිතක් ඇතිවේ: ‘මේ පින්වත් බ්‍රහ්මා, මහාබ්‍රහ්මා, අන් සියල්ලන් මැඩගත්, කිසිවෙකුට මැඩලිය නොහැකි, අන්‍ය දේ දකින්නා වූ, වසඟ කරන්නා වූ, ඊශ්වර වූ, කරන්නා වූ, නිර්මාතෘ වූ, ශ්‍රේෂ්ඨ වූ, නිර්මාණය කරන්නා වූ, වසඟයෙහි පවතින, උපන් හා උපදින සත්වයන්ගේ පියාණන් ය. මේ පින්වත් බ්‍රහ්මා විසින් අපි නිර්මාණය කරන ලද්දෝ වෙමු. ඒ කුමක් හෙයින්ද? මේ බ්‍රහ්මයා මෙහි මුලින්ම උපන් බව අපි දැක්කෙමු, අපි නම් පසුව උපන්නෝ වෙමු’යි.",
      "paliTitle": ""
    },
    {
      "number": 43,
      "pali": "‘‘Tatra, bhikkhave, yo so satto paṭhamaṃ upapanno, so dīghāyukataro ca hoti vaṇṇavantataro ca mahesakkhataro ca. Ye pana te sattā pacchā upapannā, te appāyukatarā ca honti dubbaṇṇatarā ca appesakkhatarā ca.",
      "english": "There, monks, that being who was reborn first is longer-lived, more glorious, and more powerful. But those beings who were reborn later are shorter-lived, less glorious, and less powerful.",
      "sinhala": "එහිදී, මහණෙනි, යම් සත්වයෙක් මුලින්ම උපන්නේද, ඔහු දීර්ඝායුෂ්ක වේ, වර්ණවත් වේ, මහානුභාව සම්පන්න වේ. නමුත් යම් සත්වයෝ පසුව උපදින්නෝද, ඔවුන් අල්පායුෂ්ක වේ, දුර්වර්ණ වේ, අල්පානුභාව සම්පන්න වේ.",
      "paliTitle": ""
    },
    {
      "number": 44,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati. ‘‘So evamāha – ‘yo kho so bhavaṃ brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ, yena mayaṃ bhotā brahmunā nimmitā, so nicco dhuvo sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassati. Ye pana mayaṃ ahumhā tena bhotā brahmunā nimmitā, te mayaṃ aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti. Idaṃ kho, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti.",
      "english": "Indeed, bhikkhus, it is possible that a certain being, having fallen from that realm, comes to this state of being. Having come to this state of being, he goes forth from the home life into homelessness. Having gone forth from the home life into homelessness, by following ardour, exertion, application, heedfulness, and right attention, he attains such a state of mental concentration that with his mind thus concentrated, he recollects that previous existence, but does not recollect beyond that.\n\nHe then says this: ‘That venerable Great Brahmā, the conqueror, the unconquered, the all-seeing, the wielder of power, the lord, the creator, the maker, the best, the appointer, the master, the father of all that is and is to be, by whom we were created, he is permanent, stable, eternal, not subject to change, and will remain so for all eternity. But as for us who were created by that venerable Brahmā, we are impermanent, unstable, short-lived, subject to falling away, and have come to this state of being.’ This, bhikkhus, is the first instance relying on which, focusing on which, some ascetics and brahmins proclaim partial eternalism and partial annihilationism, teaching that the self and the world are partly eternal and partly not eternal.",
      "sinhala": "මහණෙනි, යම් සත්වයෙක් ඒ කයෙන් චුතව මෙලොවට පැමිණෙන තැනක් නම් තිබේ. මෙලොවට පැමිණි කල්හි ගිහිගෙයින් නික්ම අනගාරිකත්වයට පැවිදි වේ. ගිහිගෙයින් නික්ම අනගාරිකත්වයට පැවිදි වූ කල්හි උත්සාහයෙන් යුතුව, වීර්යයෙන් යුතුව, නිරන්තර පුහුණුවෙන් යුතුව, අප්‍රමාදයෙන් යුතුව, මනා සිහියෙන් යුතුව එවැනි චේතෝසමාධියක් ස්පර්ශ කරයි. එසේ සමාධිගත වූ සිතින් ඔහු ඒ පෙර විසූ කඳ සිහි කරයි, එහෙත් ඊට ඔබ්බට සිහි නොකරයි.\n\nඔහු මෙසේ කියයි: ‘යම් ඒ භවත් මහා බ්‍රහ්මයා අභිභවනය කරන්නෙකි, අන්‍යන් විසින් අභිභවනය නොකරනු ලබන්නෙකි, අන්‍ය දේ දකින්නෙකි, වසඟයෙහි පවත්වන්නෙකි, ඊශ්වරයෙකි, කර්තෘය, නිර්මාතෘය, ශ්‍රේෂ්ඨය, සියල්ල මවන සුලුය, වසඟයෙහි පාලනය කරන්නෙකි, උපන් හා උපදින සුලු සියල්ලන්ගේ පියාණන්ය, යම් ඒ බ්‍රහ්මයා විසින් අපි නිර්මිත වුමුද, ඒ බ්‍රහ්මයා නිත්‍යය, ධ්‍රැවය, ශාශ්වතය, වෙනස් නොවන ස්වභාව ඇත්තේය, සදාකාලිකවම එලෙසම පවතිනු ඇත. ඒ භවත් බ්‍රහ්මයා විසින් නිර්මිත වූ යම් අපි වූම්ද, ඒ අපි අනිත්‍යය, අධ්‍රැවය, ස්වල්ප ආයුෂ ඇත්තෝය, චුතවන ස්වභාව ඇත්තෝය, මෙලොවට පැමිණියෝය’යි.\n\nමහණෙනි, යම් කරුණක් පදනම් කරගෙන, යම් කරුණක් නිමිති කරගෙන ඇතැම් ශ්‍රමණබ්‍රාහ්මණයෝ කොටසක් ශාශ්වතවාදීවද, කොටසක් අශාශ්වතවාදීවද, ආත්මයත් ලෝකයත් කොටසක් ශාශ්වතයයිද, කොටසක් අශාශ්වතයයිද ප්‍රකාශ කරත්ද, මේ පළමුවන අවස්ථාව එයයි.",
      "paliTitle": ""
    },
    {
      "number": 45,
      "pali": "‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Santi, bhikkhave, khiḍḍāpadosikā nāma devā, te ativelaṃ hassakhiḍḍāratidhammasamāpannā [hasakhiḍḍāratidhammasamāpannā (ka.)] viharanti. Tesaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati [pamussati (sī. syā.)]. Satiyā sammosā te devā tamhā kāyā cavanti.",
      "english": "And second, venerable ascetics and brahmins, based on what, and starting from what, do they declare the self and the world to be partly eternal and partly non-eternal — asserting some things are eternal and some are not?\n\nMonks, there are gods named 'Corrupted by Play.' They dwell excessively indulging in habits of laughter, play, and amusement. As they dwell excessively indulging in habits of laughter, play, and amusement, their mindfulness becomes muddled. From the loss of mindfulness, those gods depart from that existence.",
      "sinhala": "දෙවනුව, මහණෙනි, කුමක් මුල්කොටගෙන, කුමක් අරභයා, සමහර මහණබමුණෝ ආත්මයත් ලෝකයත් කොටසක් සදාකාලිකය, කොටසක් අසදාකාලිකයැයි ප්‍ර‍කාශ කරත් ද?\n\nමහණෙනි, ඛිඩ්ඩාපදෝසික නම් දෙවිවරු ඇත්තාහ. ඔවුහු අධික ලෙස සිනාසෙමින්, කෙළිදෙළෙන් සහ ක්‍ර‍ීඩාවෙන් (කාලය) ගත කරන ස්වභාවයෙන් යුක්තව වාසය කරති.\n\nඑසේ අධික ලෙස සිනාසෙමින්, කෙළිදෙළෙන් සහ ක්‍ර‍ීඩාවෙන් වාසය කරන ඔවුනට සතිය මුළා වෙයි.\n\nසතිය මුළා වීම නිසා එම දෙවිවරු ඒ ලෝකයෙන් චුත වෙති.",
      "paliTitle": ""
    },
    {
      "number": 46,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati. ‘‘So evamāha – ‘ye kho te bhonto devā na khiḍḍāpadosikā, te na ativelaṃ hassakhiḍḍāratidhammasamāpannā viharanti. Tesaṃ na ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati na sammussati. Satiyā asammosā te devā tamhā kāyā na cavanti; niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā khiḍḍāpadosikā, te mayaṃ ativelaṃ hassakhiḍḍāratidhammasamāpannā viharimhā. Tesaṃ no ativelaṃ hassakhiḍḍāratidhammasamāpannānaṃ viharataṃ sati sammussati. Satiyā sammosā evaṃ mayaṃ tamhā kāyā cutā aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti.",
      "english": "It is indeed possible, monks, that a certain being, having departed from that realm, comes to this state of existence. Having come to this state of existence, he goes forth from the home life into homelessness. Having gone forth from the home life into homelessness, he strives earnestly, makes effort, applies himself, lives diligently, and attends properly, thereby attaining such a mental concentration that, with his mind thus concentrated, he recollects that past dwelling place, but he does not recollect beyond that.\n\nHe then says this: ‘Indeed, those venerable deities who are not addicted to sport do not live excessively indulging in amusement, play, and delight. While they do not live excessively indulging in amusement, play, and delight, their mindfulness is not lost. Because their mindfulness is not lost, those deities do not depart from that realm; they are permanent, steadfast, eternal, not subject to change, and they will remain just so for all eternity. But we, who were addicted to sport, lived excessively indulging in amusement, play, and delight. While we lived excessively indulging in amusement, play, and delight, our mindfulness was lost. Because our mindfulness was lost, we thus departed from that realm, impermanent, unstable, short-lived, subject to falling away, and have come to this state of existence.’\n\nThis, monks, is the second ground, based on which and concerning which some ascetics and brahmins, who are partly eternalists and partly non-eternalists, declare the self and the world to be partly eternal and partly non-eternal.",
      "sinhala": "‘‘භික්ෂූනි, මෙය සිදුවිය හැකි කරුණකි, යම් සත්වයෙක් එම කයින් චුතව මේ මිනිස් බවට පැමිණෙයි. මේ මිනිස් බවට පැමිණි ඔහු ගිහිගෙයින් නික්ම අනගාරික බවට පත් වෙයි. ගිහිගෙයින් නික්ම අනගාරික බවට පත් වූ ඔහු, වීර්යය, උත්සාහය, නොපසුබට භාවය, අප්‍රමාදය සහ මනා මනසිකාරය අනුගමනය කරමින්, එවැනි චිත්ත සමාධියකට පැමිණෙයි, එසේ සමාධිගත වූ සිතින් එම පූර්ව නිවාසය සිහි කරයි, එහෙත් ඉන් ඔබ්බට සිහි නොකරයි.\n\nඔහු මෙසේ කියයි – ‘යම් ඒ ගෞරවනීය දෙවිවරු ක්‍රීඩාප්‍රදෝෂ නොවූවාහුද, ඔවුහු අධික ලෙස සිනාසීමෙන්, ක්‍රීඩාවෙන් සහ ආශාවෙන් යුක්තව නොවසති. අධික ලෙස සිනාසීමෙන්, ක්‍රීඩාවෙන් සහ ආශාවෙන් යුක්තව නොවසන ඔවුන්ගේ සිහිය මුළා නොවේ. සිහිය මුළා නොවන බැවින් ඒ දෙවිවරු එම කයින් චුත නොවෙති; ඔවුහු නිත්‍යවූ, ධ්‍රැවවූ, ශාශ්වතවූ, නොපෙරළෙන ස්වභාවයෙන් යුතුව සදහටම එලෙසම පවතිනු ඇත. යම් අපි නම් ක්‍රීඩාප්‍රදෝෂ වූවාහුද, ඒ අපි අධික ලෙස සිනාසීමෙන්, ක්‍රීඩාවෙන් සහ ආශාවෙන් යුක්තව විසීමු. අධික ලෙස සිනාසීමෙන්, ක්‍රීඩාවෙන් සහ ආශාවෙන් යුක්තව විසූ අපගේ සිහිය මුළා විය. සිහිය මුළා වූ බැවින් මෙසේ අපි එම කයින් චුතව අනිත්‍යවූ, අස්ථිරවූ, අල්පායුෂ ඇති, චලනය වන ස්වභාවයෙන් යුතුව මේ මිනිස් බවට පැමිණියෙමු’යි. භික්ෂූනි, මෙය දෙවැනි කරුණයි, යමක් ඇසුරු කොට, යමක් නිමිති කොට ගෙන ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ, (තමන්ගේ මතය) කොටසක් ශාශ්වතයයිද, කොටසක් අශාශ්වතයයිද, ආත්මයද ලෝකයද පනවති.",
      "paliTitle": ""
    },
    {
      "number": 47,
      "pali": "‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Santi, bhikkhave, manopadosikā nāma devā, te ativelaṃ aññamaññaṃ upanijjhāyanti. Te ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsenti. Te aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Te devā tamhā kāyā cavanti.",
      "english": "And thirdly, good sirs, on what grounds and with what premise do some recluses and brahmins declare the self and the world to be partly eternal and partly non-eternal?\n\nMonks, there are devas named Mind-Polluted. They gaze excessively upon each other. As they excessively gaze upon each other, they corrupt their minds towards each other. With their minds thus corrupted towards each other, they become weary in body and weary in mind. Those devas then pass away from that realm.",
      "sinhala": "තුන්වැනිවද, භවත් ශ්‍රමණබ්‍රාහ්මණයෝ කුමක් පදනම් කරගෙන, කුමක් මුල් කරගෙන, කොටසක් සදාකාලික වූද, කොටසක් අසදාකාලික වූද ආත්මයක් සහ ලෝකයක් පනවන්නේද?\n\nමහණෙනි, මනෝපදෝසික නම් වූ දෙවිවරු ඇත්තාහ. ඔවුහු බොහෝ වේලාවක් එකිනෙකා දෙස බලා සිටිති. එසේ බොහෝ වේලාවක් එකිනෙකා දෙස බලා සිටින ඔවුහු එකිනෙකාගේ සිත් දූෂණය කරගනිති. එලෙස එකිනෙකා කෙරෙහි දූෂිත සිත් ඇති ඔවුහු වෙහෙසට පත් වූ කයින්ද, වෙහෙසට පත් වූ සිතින්ද යුක්ත වෙති. ඒ දෙවිවරු ඒ ආත්මභාවයෙන් චුත වෙති.",
      "paliTitle": ""
    },
    {
      "number": 48,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte taṃ pubbenivāsaṃ anussarati, tato paraṃ nānussarati. ‘‘So evamāha – ‘ye kho te bhonto devā na manopadosikā, te nātivelaṃ aññamaññaṃ upanijjhāyanti. Te nātivelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni nappadūsenti. Te aññamaññaṃ appaduṭṭhacittā akilantakāyā akilantacittā. Te devā tamhā kāyā na cavanti, niccā dhuvā sassatā avipariṇāmadhammā sassatisamaṃ tatheva ṭhassanti. Ye pana mayaṃ ahumhā manopadosikā, te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyimhā. Te mayaṃ ativelaṃ aññamaññaṃ upanijjhāyantā aññamaññamhi cittāni padūsimhā, te mayaṃ aññamaññaṃ paduṭṭhacittā kilantakāyā kilantacittā. Evaṃ mayaṃ tamhā kāyā cutā aniccā addhuvā appāyukā cavanadhammā itthattaṃ āgatā’ti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti.",
      "english": "Monks, there is indeed such a case where a certain being, having passed away from that state of existence, comes to this human state. Having come to this state, he goes forth from the home life into homelessness. Having gone forth from the home life into homelessness, devoting himself to ardour, to effort, to application, to diligence, and to right attention, he attains such a concentration of mind that, with his mind thus concentrated, he recollects that previous existence, but does not recollect beyond that. He then says this: ‘Those venerable devas who were not malevolent in mind did not overly scrutinize one another. Not overly scrutinizing one another, they did not pollute their minds towards one another. Having unpolluted minds towards one another, with unwearied bodies and unwearied minds, those devas do not pass away from that state; they are permanent, steadfast, eternal, not subject to change, and they will remain just so for eternity. But we who were malevolent in mind overly scrutinized one another. Overly scrutinizing one another, we polluted our minds towards one another; having polluted minds towards one another, with wearied bodies and wearied minds, thus, having passed away from that state, impermanent, not steadfast, short-lived, subject to passing away, we have come to this state.’ Monks, this is the third basis, taking which as their ground, relying on which, some ascetics and brahmins become partial eternalists and partial non-eternalists, declaring the self and the world to be partly eternal and partly non-eternal.",
      "sinhala": "භික්ෂූණි, මේ කාරණය පවතී. යම් සත්වයෙක් ඒ ශරීරයෙන් චුතව මේ මිනිස් ලොවට පැමිණෙයි. මිනිස් ලොවට පැමිණි පසු ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වෙයි. ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වූ පසු තපස්වීව, වීර්යය සහිතව, උත්සාහයෙන්, අප්‍රමාදව, මනාකොට මෙනෙහි කරමින් එබඳු චිත්ත සමාධියක් ස්පර්ශ කරයි. එසේ සමාධිගත වූ සිතින් ඒ පූර්ව නිවාසය සිහි කරයි. ඉන් ඔබ්බට සිහි නොකරයි.\n\nඔහු මෙසේ කියයි – ‘යම් ඒ භවත් දෙවියෝ මනසින් දූෂ්‍ය නොවූවාහුද, ඔවුහු වැඩිවේලාවක් එකිනෙකා දෙස බලා නොසිටිති. ඔවුහු වැඩිවේලාවක් එකිනෙකා දෙස බලා නොසිටින හෙයින් එකිනෙකා කෙරෙහි සිත් දූෂ්‍ය කර නොගනිති. ඔවුහු එකිනෙකා කෙරෙහි නොදූෂ්‍ය වූ සිත් ඇත්තෝය, වෙහෙසට පත් නොවූ කය ඇත්තෝය, වෙහෙසට පත් නොවූ සිත් ඇත්තෝය. ඒ දෙවියෝ ඒ ශරීරයෙන් චුත නොවෙති, ඔවුහු නිත්‍යයෝය, ධ්‍රැවයෝය, ශාශ්වතයෝය, විපරිණාම ධර්මයෙන් තොරය, සදාකාලිකවම එලෙසම පවතිනු ඇත. නමුත් අපි යම් කෙනෙක් මනසින් දූෂ්‍ය වූවාහුද, අපි වැඩිවේලාවක් එකිනෙකා දෙස බලා සිටියෙමු. එසේ වැඩිවේලාවක් එකිනෙකා දෙස බලා සිටි අපි එකිනෙකා කෙරෙහි සිත් දූෂ්‍ය කරගත්තෙමු, අපි එකිනෙකා කෙරෙහි දූෂ්‍ය වූ සිත් ඇත්තෝ වීමු, වෙහෙසට පත් වූ කය ඇත්තෝ වීමු, වෙහෙසට පත් වූ සිත් ඇත්තෝ වීමු. මේ අයුරින් අපි ඒ ශරීරයෙන් චුතව, අනිත්‍යව, අස්ථිරව, අල්පායුෂව, ච්‍යවන ස්වභාවයෙන් යුක්තව මේ මිනිස් ලොවට පැමිණියෙමු’යි. භික්ෂූණි, මේ තෙවැනි කාරණයයි, යමක් මුල් කරගෙන, යමක් අරමුණු කරගෙන ඇතැම් ශ්‍ර​මණ-බ්‍රාහ්මණයෝ එක් කොටසක් ශාශ්වතවාදී, එක් කොටසක් අශාශ්වතවාදී ලෙස, තමන් සහ ලෝකය සම්බන්ධයෙන් එක් කොටසක් ශාශ්වතයැයි ද, එක් කොටසක් අශාශ්වතයැයි ද ප්‍ර​කාශ කරති.",
      "paliTitle": ""
    },
    {
      "number": 49,
      "pali": "‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘yaṃ kho idaṃ vuccati cakkhuṃ itipi sotaṃ itipi ghānaṃ itipi jivhā itipi kāyo itipi, ayaṃ attā anicco addhuvo asassato vipariṇāmadhammo. Yañca kho idaṃ vuccati cittanti vā manoti vā viññāṇanti vā ayaṃ attā nicco dhuvo sassato avipariṇāmadhammo sassatisamaṃ tatheva ṭhassatī’ti. Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti.",
      "english": "And for what reason, based on what, worthy ascetics and brahmins declare the self and the world to be partially eternal and partially non-eternal—some aspects eternal, some non-eternal? Here, bhikkhus, a certain ascetic or brahmin is a reasoner, an investigator. He declares, based on his own reasoning, his own investigation, his own inspired thought, as follows: ‘That which is called the eye, the ear, the nose, the tongue, and the body—this self is impermanent, unstable, non-eternal, subject to change. But that which is called mind, or intellect, or consciousness—this self is permanent, stable, eternal, not subject to change; it will remain just as it is, eternally.’ This, bhikkhus, is the fourth basis, based on which and due to which some ascetics and brahmins declare the self and the world to be partially eternal and partially non-eternal—some aspects eternal, some non-eternal.",
      "sinhala": "පින්වත් මහණ බමුණෙනි, හතරවෙනි ලෙසද, කුමක්‌ පදනම් කරගෙන, කුමක්‌ අරමුණු කරගෙන, කොටසක්‌ සදාකාලිකයයිද, කොටසක්‌ අසදාකාලිකයයිද; කොටසක්‌ සදාකාලිකයයිද, කොටසක්‌ අසදාකාලිකයයිද වශයෙන් ආත්මයද ලෝකයද ප්‍රකාශ කරත්ද? මහණෙනි, මෙහි ඇතැම් මහණෙක්‌ හෝ බමුණෙක්‌ හෝ තර්ක කරන්නෙක්‌ වෙයි, විමර්ශනය කරන්නෙක්‌ වෙයි. ඔහු තර්කයෙන් පෙළඹී, විමර්ශනයට අනුව ගොස්‌, තමාටම නැඟුණු ප්‍රත්‍යභානයෙන් මෙසේ කියයි: ‘යම් මේ ඇස යයිද, කන යයිද, නාසය යයිද, දිව යයිද, කය යයිද වශයෙන් කියනු ලැබේ නම්, මේ ආත්මය අනිත්‍යය, අස්ථිරය, අසදාකාලිකය, වෙනස්‌ වීමේ ස්වභාවය ඇත්තකි. යම් මේ සිත යයිද, මනස යයිද, විඤ්ඤාණය යයිද වශයෙන් කියනු ලැබේ නම්, මේ ආත්මය නිත්‍යය, ස්‌ථිරය, සදාකාලිකය, වෙනස්‌ නොවන ස්වභාවය ඇත්තකි. සදාකාලිකවම එලෙසින්ම පවතිනු ඇතැයි.’ මහණෙනි, ඇතැම් මහණ බමුණෝ යමක්‌ පදනම් කරගෙන, යමක්‌ අරමුණු කරගෙන, කොටසක්‌ සදාකාලිකයයිද, කොටසක්‌ අසදාකාලිකයයිද; කොටසක්‌ සදාකාලිකයයිද, කොටසක්‌ අසදාකාලිකයයිද වශයෙන් ආත්මයද ලෝකයද ප්‍රකාශ කරත්ද, මේ හතරවෙනි කරුණයි.",
      "paliTitle": ""
    },
    {
      "number": 50,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā.",
      "english": "Indeed, O monks, these recluses and brahmins, who are partial eternalists and partial non-eternalists, declare the self and the world to be partially eternal and partially non-eternal, based on these four grounds. Whatever recluses or brahmins, O monks, declare the self and the world to be partially eternal and partially non-eternal, all of them do so by means of these very four grounds, or by one of them; there is nothing outside of these.",
      "sinhala": "භික්ෂූණි, ඒ ශ්‍ර‌මණ-බ්‍ර‌ාහ්මණයෝ ආත්මයද ලෝකයද ඇතැම් තැනෙක ශාශ්වත ලෙසත් ඇතැම් තැනෙක අශාශ්වත ලෙසත් මේ කරුණු සතරෙන් ප්‍ර‌කාශ කරති.\n\nභික්ෂූණි, යම්කිසි ශ්‍ර‌මණයෝ හෝ බ්‍ර‌ාහ්මණයෝ හෝ ආත්මයද ලෝකයද ඇතැම් තැනෙක ශාශ්වත ලෙසත් ඇතැම් තැනෙක අශාශ්වත ලෙසත් ප්‍ර‌කාශ කරත්ද, ඒ සියල්ලෝම මේ කරුණු සතරෙන්ම හෝ ඒවායින් එකකින් හෝ එසේ කරති; මීට බාහිරව වෙනත් යමක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 51,
      "pali": "‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato.",
      "english": "And this, monks, the Tathāgata comprehends: ‘These viewpoints, thus grasped, thus clung to, lead to such a destination, such a future state.’ The Tathāgata comprehends that, and He comprehends what is even beyond that. And He does not cling to that comprehension; for Him, being unattached, liberation is known within himself. Having fully understood, as they truly are, the origin and disappearance of feelings, their gratification, their danger, and the escape from them, the Tathāgata, monks, is liberated through non-clinging.",
      "sinhala": "භික්ෂූනි, තථාගතයන් වහන්සේ මෙය ප්‍රජානනා කරයි: ‘මෙම දෘෂ්ටිස්ථාන මෙසේ අල්වාගැනීමෙන්, මෙසේ තදින් ග්‍රහණය කරගැනීමෙන්, මෙබඳු ගතියකට පැමිණේ, මෙබඳු පරලොවකට හේතු වේ’ යනුවෙනි. තථාගතයන් වහන්සේ එය ද ප්‍රජානනා කරයි, ඊටත් වඩා උසස් දේ ද ප්‍රජානනා කරයි. එම ප්‍රජානනය උන්වහන්සේ තදින් අල්ලා නොගනිති. එසේ අල්ලා නොගන්නා උන්වහන්සේට තම තමන් විසින්ම නිවන අවබෝධ වේ. භික්ෂූනි, වේදනාවන්ගේ හටගැනීම ද, නැතිවීම ද, ආස්වාදය ද, ආදීනවය ද, නිස්සරණය ද යථාභූතව දැන, තථාගතයන් වහන්සේ උපාදානයකින් තොරව විමුක්ත වූ සේක.",
      "paliTitle": ""
    },
    {
      "number": 52,
      "pali": "‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. ",
      "english": "These, bhikkhus, are indeed the teachings: profound, difficult to see, difficult to comprehend, peaceful, sublime, beyond the scope of mere reasoning, subtle, and to be experienced by the wise. These are the teachings that the Tathāgata, having directly known and realized for himself, declares. It is by these teachings that one, speaking rightly, would truly praise the Tathāgata.",
      "sinhala": "භික්ෂූන් වහන්ස, තථාගතයන් වහන්සේ තමන් විසින්ම අභිඥාවෙන් අවබෝධ කොට සාක්ෂාත් කරගෙන දේශනා කරන ලද, තථාගතයන් වහන්සේගේ යථාභූත ගුණය නිවැරදිව වර්ණනා කරන්නාට වර්ණනා කළ හැකි, ගැඹුරු වූ, දැකීමට දුෂ්කර වූ, අවබෝධ කරගැනීමට දුෂ්කර වූ, ශාන්ත වූ, ප‍්‍රණීත වූ, තර්කයට හසු නොවන සුළු වූ, සියුම් වූ, පණ්ඩිතයන්ට පමණක් අවබෝධ වන මේ ධර්මයන් ය.",
      "paliTitle": ""
    },
    {
      "number": 53,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi?",
      "english": "Monks, there are some ascetics and brahmins who are finite-infinite theorists, declaring the world to be finite and infinite on four grounds. And on what basis, for what reason, do those venerable ascetics and brahmins, as finite-infinite theorists, declare the world to be finite and infinite on four grounds?",
      "sinhala": "මහණෙනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ අන්ත-අනන්තවාදීහු වෙති. ඔවුහු කරුණු සතරකින් ලෝකය අන්ත යැයිද, අනන්ත යැයිද ප්‍රඥප්ත කරති. ඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් අරභයාද, කුමක් මුල් කරගෙනද කරුණු සතරකින් ලෝකය අන්තය ද, අනන්තය ද කියා ප්‍රඥප්ත කරති?",
      "paliTitle": "Antānantavādo",
      "englishTitle": "Doctrine of Finite and Infinite",
      "sinhalaTitle": "අන්‍ත අනන්‍ත වාදය"
    },
    {
      "number": 54,
      "pali": "‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte antasaññī lokasmiṃ viharati. ‘‘So evamāha – ‘antavā ayaṃ loko parivaṭumo. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte antasaññī lokasmiṃ viharāmi. Imināmahaṃ etaṃ jānāmi – yathā antavā ayaṃ loko parivaṭumo’ti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti.",
      "english": "Here, monks, a certain ascetic or brahmin, through ardency, striving, dedication, diligence, and right attention, attains such a state of mental concentration that, with his mind thus concentrated, he abides perceiving the world as finite. He says, ‘This world is finite and circumscribed. For what reason? Because I, through ardency, striving, dedication, diligence, and right attention, attain such a state of mental concentration that, with my mind thus concentrated, I abide perceiving the world as finite. By this, I know that this world is finite and circumscribed.’ This, monks, is the first basis, relying on which some ascetics and brahmins, who are ‘Finitists and Infinitists’, make declarations about the world's finitude and infinitude.",
      "sinhala": "මහණෙනි, මෙහිලා ඇතැම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ වීර්යය අනුගමනය කොට, ප්‍රයත්නය අනුගමනය කොට, උත්සාහය අනුගමනය කොට, අප්‍රමාදය අනුගමනය කොට, මනාකොට මෙනෙහි කිරීම අනුගමනය කොට, එබඳු චිත්ත සමාධියක් ස්පර්ශ කරයි. ඒ සමාහිත සිතින් ලෝකයේ කෙළවරක් ඇතැයි යන සංඥාවෙන් යුතුව වාසය කරයි. ඔහු මෙසේ කියයි: ‘මේ ලෝකය කෙළවරක් ඇත්තක්, වටවී ඇත්තක්. ඒ කුමන කරුණක් නිසා ද? මම නම් වීර්යය අනුගමනය කොට, ප්‍රයත්නය අනුගමනය කොට, උත්සාහය අනුගමනය කොට, අප්‍රමාදය අනුගමනය කොට, මනාකොට මෙනෙහි කිරීම අනුගමනය කොට, එබඳු චිත්ත සමාධියක් ස්පර්ශ කරමි. ඒ සමාහිත සිතින් ලෝකයේ කෙළවරක් ඇතැයි යන සංඥාවෙන් යුතුව වාසය කරමි. මේ හේතුවෙන් මම ‘මේ ලෝකය කෙළවරක් ඇත්තක්, වටවී ඇත්තක්’ යනුවෙන් මෙය දනිමි’යි. මහණෙනි, යමක් අරමුණු කොට ගෙන, යමක් ඇසුරු කොට ගෙන, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ අන්තානන්තිකවරුන් බවට පත්ව, ලෝකයට කෙළවරක් ඇත ද නැත ද යන දෘෂ්ටිය පනවති ද, මෙය පළමුවන කරුණයි.",
      "paliTitle": ""
    },
    {
      "number": 55,
      "pali": "‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte anantasaññī lokasmiṃ viharati. ‘‘So evamāha – ‘ananto ayaṃ loko apariyanto. Ye te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ayaṃ loko parivaṭumo’’ti, tesaṃ musā. Ananto ayaṃ loko apariyanto. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte anantasaññī lokasmiṃ viharāmi. Imināmahaṃ etaṃ jānāmi – yathā ananto ayaṃ loko apariyanto’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti.",
      "english": "And, bhikkhus, what do some ascetics and brahmins, Proclaimers of the World as Infinite, rely on, what do they take as their starting point, when they proclaim the world to be infinite?\n\nHere, bhikkhus, some ascetic or brahmin, by means of ardency, by means of exertion, by means of application, by means of heedfulness, by means of right attention, attains such a mental concentration that, with the mind thus concentrated, he dwells perceiving the world as infinite.\n\nHe then says: ‘This world is infinite, unbounded. Those ascetics and brahmins who said: “This world is finite, encompassed,” their statement is false. This world is infinite, unbounded.’ What is the reason for this? For I, by means of ardency, by means of exertion, by means of application, by means of heedfulness, by means of right attention, attain such a mental concentration that, with the mind thus concentrated, I dwell perceiving the world as infinite. By this I know that this world is infinite, unbounded.\n\nThis, bhikkhus, is the second instance, based on which and starting from which, some ascetics and brahmins, Proclaimers of the World as Infinite, declare the world to be infinite.",
      "sinhala": "භවත්නි, දෙවනුව, සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් ඇසුරු කොටද, කුමක් මුල්කරගෙනද, ලෝකය අනන්තය යන දෘෂ්ටිය ප්‍රකාශ කරත්ද?\n\nමහණෙනි, මෙහි ඇතැම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ දැඩි වෑයමෙහි යෙදී, වීර්යයෙහි යෙදී, නොනවත්වා පුහුණු වෙමින්, අප්‍රමාදව, මනාව මෙනෙහි කරමින්, යම්බඳු චිත්ත සමාධියකට පැමිණෙයිද, හෙතෙම එසේ සමාධිගත වූ සිතින් ලෝකය අනන්ත යැයි යන සංඥාවෙන් යුතුව වාසය කරයි.\n\nඔහු මෙසේ කියයි: ‘මේ ලෝකය අනන්තය, කෙළවරක් නැත. යම් ශ්‍රමණ-බ්‍රාහ්මණයෝ ‘මේ ලෝකය අන්ත සහිතයි, වටවී තිබේ’ යැයි කීවාහුද, ඔවුන්ගේ ඒ වචනය මුසාවකි. මේ ලෝකය අනන්තය, කෙළවරක් නැත. ඒ කුමන හේතුවක් නිසාද? මක්නිසාද යත්, මම දැඩි වෑයමෙහි යෙදී, වීර්යයෙහි යෙදී, නොනවත්වා පුහුණු වෙමින්, අප්‍රමාදව, මනාව මෙනෙහි කරමින්, යම්බඳු චිත්ත සමාධියකට පැමිණියෙමි. එසේ සමාධිගත වූ සිතින් ලෝකය අනන්තය යන සංඥාවෙන් යුතුව වාසය කරමි. මේ හේතුවෙන් මම දනිමි – මේ ලෝකය අනන්තය, කෙළවරක් නැත කියා.’\n\nමහණෙනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ ලෝකය අනන්තය යන දෘෂ්ටිය ප්‍රකාශ කරන්නේ, මේ දෙවැනි කරුණ ඇසුරු කොටත්, මුල්කරගෙනත්ය.",
      "paliTitle": ""
    },
    {
      "number": 56,
      "pali": "‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte uddhamadho antasaññī lokasmiṃ viharati, tiriyaṃ anantasaññī. ‘‘So evamāha – ‘antavā ca ayaṃ loko ananto ca. Ye te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ayaṃ loko parivaṭumo’’ti, tesaṃ musā. Yepi te samaṇabrāhmaṇā evamāhaṃsu – ‘‘ananto ayaṃ loko apariyanto’’ti, tesampi musā. Antavā ca ayaṃ loko ananto ca. Taṃ kissa hetu? Ahañhi ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusāmi, yathāsamāhite citte uddhamadho antasaññī lokasmiṃ viharāmi, tiriyaṃ anantasaññī. Imināmahaṃ etaṃ jānāmi – yathā antavā ca ayaṃ loko ananto cā’ti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti.",
      "english": "And on what grounds, good sirs, based on what, do these ascetics and brahmins, proponents of the world being finite and infinite, declare the world to be both finite and infinite? Here, monks, some ascetic or brahmin, through ardent striving, through exertion, through application, through diligence, and through right attention, attains such a mental concentration that, with his mind thus concentrated, he dwells perceiving the world as finite upwards and downwards, and as infinite across. He then says: ‘This world is both finite and infinite. Those ascetics and brahmins who asserted: ‘‘This world is finite and circumscribed,’’ they spoke falsely. And those ascetics and brahmins who asserted: ‘‘This world is infinite and boundless,’’ they also spoke falsely. This world is both finite and infinite.’ ‘What is the reason for that?’ ‘For I, through ardent striving, through exertion, through application, through diligence, and through right attention, attain such a mental concentration that, with my mind thus concentrated, I dwell perceiving the world as finite upwards and downwards, and as infinite across. By this, I know that this world is both finite and infinite.’ This, monks, is the third instance, based on which and concerning which, some ascetics and brahmins, holding the view of the world being both finite and infinite, declare the world to be both finite and infinite.",
      "sinhala": "තුන්වනුව, භවත්නි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් කරුණුකොටගෙන, කුමක් ආරම්භකොටගෙන අන්ත-අනන්තවාදීව ලෝකය අන්ත සහිතද අනන්තදැයි ප්‍රකාශ කරත්ද?\n\nමහණෙනි, මෙහි ඇතැම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ වීර්යයෙන් යුක්තව, වෙහෙසීමෙන් යුක්තව, නිරතවීමෙන් යුක්තව, අප්‍රමාදීව, මනාව මෙනෙහි කිරීමෙන් යුක්තව යම්කිසි එබඳු චිත්තසමාධියක් ලබාගනී. ඔහු ඒ සමාධිගත වූ සිතින් ඉහළටත්, පහළටත් ලෝකය අන්ත සහිත යැයි සංඥා කරමින් වාසය කරයි, තිරශ්චීනව (පැතිවලට) අනන්තයයි සංඥා කරමින් වාසය කරයි.\n\nඔහු මෙසේ කියයි: ‘මේ ලෝකය අන්ත සහිතද වේ, අනන්තද වේ. යම් ශ්‍රමණ-බ්‍රාහ්මණයෝ ‘මේ ලෝකය අන්ත සහිතය, පරිවට්ටය’ යැයි කීවාහුද, ඔවුන්ගේ (කීම) මුසාවකි. යම් ශ්‍රමණ-බ්‍රාහ්මණයෝද ‘මේ ලෝකය අනන්තය, අපරියන්තය’ යැයි කීවාහුද, ඔවුන්ගේද (කීම) මුසාවකි. මේ ලෝකය අන්ත සහිතද වේ, අනන්තද වේ. එයට හේතුව කුමක්ද? මක්නිසාද යත්, මම වීර්යයෙන් යුක්තව, වෙහෙසීමෙන් යුක්තව, නිරතවීමෙන් යුක්තව, අප්‍රමාදීව, මනාව මෙනෙහි කිරීමෙන් යුක්තව එබඳු චිත්තසමාධියක් ලබාගනිමි. මම ඒ සමාධිගත වූ සිතින් ඉහළටත්, පහළටත් ලෝකය අන්ත සහිත යැයි සංඥා කරමින් වාසය කරමි, තිරශ්චීනව (පැතිවලට) අනන්තයයි සංඥා කරමින් වාසය කරමි. ‘මේ ලෝකය අන්ත සහිතද වේ, අනන්තද වේ’ යැයි මම මේ අයුරින් දනිමි.’\n\nමහණෙනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ යම් කරුණක් පාදක කරගෙන, යමක් ආරම්භ කරගෙන අන්ත-අනන්තවාදීව ලෝකය අන්ත සහිතද අනන්තදැයි ප්‍රකාශ කරත්ද, මෙය තුන්වන කරුණයි.",
      "paliTitle": ""
    },
    {
      "number": 57,
      "pali": "‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha antānantikā antānantaṃ lokassa paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘nevāyaṃ loko antavā, na panānanto. Ye te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ayaṃ loko parivaṭumo’’ti, tesaṃ musā. Yepi te samaṇabrāhmaṇā evamāhaṃsu – ‘‘ananto ayaṃ loko apariyanto’’ti, tesampi musā. Yepi te samaṇabrāhmaṇā evamāhaṃsu – ‘‘antavā ca ayaṃ loko ananto cā’’ti, tesampi musā. Nevāyaṃ loko antavā, na panānanto’ti. Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti.",
      "english": "And fourthly, reverend ascetics and brahmins, based on what, starting from what, do they proclaim views regarding the world as finite or infinite? Here, monks, some ascetic or brahmin is a reasoner and an investigator. He, having been thoroughly engaged in reasoning and having pursued his investigation, by his own spontaneous insight, declares thus: ‘This world is neither finite nor infinite. Those ascetics and brahmins who declared: ‘‘This world is finite and bounded,’’ their statement is false. And those ascetics and brahmins who declared: ‘‘This world is infinite and unbounded,’’ their statement is also false. And those ascetics and brahmins who declared: ‘‘This world is both finite and infinite,’’ their statement is also false. This world is neither finite nor infinite.’ This, monks, is the fourth position, based on which, starting from which, some ascetics and brahmins, proclaiming views concerning the world as finite or infinite, declare the world to be neither finite nor infinite.",
      "sinhala": "හතරවෙනුවට, භවත්නි, ඇතැම් ශ්‍රමණබ්‍රාහ්මණයෝ කුමක් අරභයා, කුමක් නිමිති කරගෙන ලෝකය කෙලවර සහිතය, කෙලවර රහිතය යැයි ප්‍රකාශ කරත්ද? මෙහි භික්ෂූනි, ඇතැම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ තර්ක කරන්නෙක්, විමර්ශනය කරන්නෙක් වෙයි. ඔහු තර්කයෙන් වෙළී, විමර්ශනයෙන් අනුගමනය කළ, තමාටම පහළ වූ ප්‍රඥාවෙන් මෙසේ කියයි – ‘මේ ලෝකය කෙලවර සහිතත් නොවේ, කෙලවර රහිතත් නොවේ. යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ ‘මේ ලෝකය කෙලවර සහිතය, වටකුරුය’ යැයි කීවෝ නම්, ඔවුන්ගේ කීම බොරුය. යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ ‘මේ ලෝකය කෙලවර රහිතය, සීමාවක් නැත’ යැයි කීවෝ නම්, ඔවුන්ගේ කීමද බොරුය. යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ ‘මේ ලෝකය කෙලවර සහිතද වෙයි, කෙලවර රහිතද වෙයි’ යැයි කීවෝ නම්, ඔවුන්ගේ කීමද බොරුය. මේ ලෝකය කෙලවර සහිතත් නොවේ, කෙලවර රහිතත් නොවේ’ යනුවෙනි. භික්ෂූනි, මෙය සිවුවන කරුණයි, යමක් අරභයා, යමක් නිමිති කරගෙන ඇතැම් ශ්‍රමණබ්‍රාහ්මණයෝ ලෝකය කෙලවර සහිතත් නොවේ, කෙලවර රහිතත් නොවේ යැයි ප්‍රකාශ කරත්ද.",
      "paliTitle": ""
    },
    {
      "number": 58,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā antānantikā antānantaṃ lokassa paññapenti, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā.",
      "english": "Monks, these ascetics and brahmins who declare the world to be finite and infinite, expound it through these four grounds. Whatever ascetics or brahmins, monks, declare the world to be finite and infinite, all of them do so through these four grounds, or through one of them; there is nothing outside of these.",
      "sinhala": "භික්ෂූණි, අන්තයක් ඇත, අන්තයක් නැත යන දෘෂ්ටිය දරන ශ්‍රමණ-බ්‍රාහ්මණයෝ මේ වස්තූන් සතරින්ම ලෝකය අන්තයක් ඇත, අන්තයක් නැත යනුවෙන් ප්‍රඥප්ත කරති. භික්ෂූණි, යම් කිසි ශ්‍රමණ කෙනෙක් හෝ බ්‍රාහ්මණ කෙනෙක් හෝ අන්තයක් ඇත, අන්තයක් නැත යන දෘෂ්ටිය දරා ලෝකය අන්තයක් ඇත, අන්තයක් නැත යනුවෙන් ප්‍රඥප්ත කරත්ද, ඔවුන් සියල්ලෝම මේ වස්තූන් සතරින්ම හෝ ඔවුන්ගෙන් එකකින් එය ප්‍රඥප්ත කරති; මෙයින් පිටත අන් කිසිවක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 59,
      "pali": "‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato.",
      "english": "Monks, the Tathagata fully understands this: ‘These views, thus grasped, thus clung to, thus lead to a certain destiny, thus lead to a certain future state.’ That too the Tathagata understands, and beyond that he understands still further. And that understanding, he does not cling to. For him, who does not cling, personal liberation is known. Having truly known, monks, the arising and passing away of feelings, their gratification, their danger, and the escape from them, the Tathagata is liberated without clinging.",
      "sinhala": "භික්ෂූණි, තථාගතයන් වහන්සේ මේ දේ දනිති – 'මේ දෘෂ්ටි ස්ථාන මෙසේ ග්‍රහණය කරනු ලැබ, මෙසේ දැඩිව අල්ලාගනු ලැබ, මෙසේ ගතියට පත්වන බවත්, මෙසේ පරලොව ඇතිවන බවත්'. තථාගතයන් වහන්සේ එය ද දනිති, ඊටත් වඩා උසස් දෙයක් ද දනිති, එම දැනගැනීම දැඩිව අල්ලා නොගනිති. එසේ නොඇලෙන උන්වහන්සේට තමන් විසින්ම නිවන ප්‍රත්‍යක්ෂ වේ. භික්ෂූණි, වේදනාවන්ගේ හටගැනීම ද නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද යථාභූතව දැනගෙන, තථාගතයන් වහන්සේ නිරුපාදා විමුක්තයෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 60,
      "pali": "‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. ",
      "english": "Indeed, monks, these are those teachings—profound, difficult to see, difficult to comprehend, peaceful, sublime, beyond the range of logical thought, subtle, to be experienced by the wise—which the Tathāgata, having directly known and realized for himself, proclaims. By these, one would rightly speak the true praise of the Tathāgata.",
      "sinhala": "මහණෙනි, මේ ධර්මයන් නම් ගැඹුරුය, දැකීමට අපහසුය, අවබෝධ කරගැනීමට දුෂ්කරය, ශාන්තය, ප්‍ර‌ණීතය, තර්කයෙන් ළඟා විය නොහැකිය, සියුම්ය, නුවණැත්තන්ට පමණක් අවබෝධ වන සුළුය. යම් ධර්මයන් තථාගතයන් වහන්සේ විසින්ම අභිඥාවෙන් ප්‍ර‌ත්‍යක්ෂ කොට දේශනා කරන ලද්දේද, යම් ධර්මයන් මඟින් තථාගතයන් වහන්සේගේ යථාර්ථවාදී ගුණ වර්ණනාවක් නිවැරදිව කළ හැකිද, මේ ඒ ධර්මයෝ වෙත්.",
      "paliTitle": ""
    },
    {
      "number": 61,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā amarāvikkhepikā, tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi?",
      "english": "Monks, there are some ascetics and brahmins who are eel-wrigglers, and when they are questioned on various matters, they resort to verbal equivocation, to eel-wriggling, on four grounds. And those venerable ascetics and brahmins, being eel-wrigglers, when questioned on various matters, resort to verbal equivocation, to eel-wriggling, on four grounds—relying on what, taking what as their basis, do they do this?",
      "sinhala": "භික්ෂූනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ අමරාවික්ඛේපිකයෝ වෙති. ඔවුහු විවිධ තැන්හි ප්‍රශ්න අසන ලදුව, හේතු සතරකින් වචන වික්ෂේපයට, එනම් අමරාවික්ඛේපයට පත් වෙති.\n\nඑම පින්වත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් අරභයා, කුමක් මුල්කොටගෙන අමරාවික්ඛේපිකයෝ වෙමින්, විවිධ තැන්හි ප්‍රශ්න අසන ලදුව, හේතු සතරකින් වචන වික්ෂේපයට, එනම් අමරාවික්ඛේපයට පත් වෙද්ද?",
      "paliTitle": "Amarāvikkhepavādo",
      "englishTitle": "Eel-wriggling View",
      "sinhalaTitle": "අමරාවික්ඛේපවාදය"
    },
    {
      "number": 62,
      "pali": "‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’’nti yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ kusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto, ‘idaṃ kusala’nti vā byākareyyaṃ, ‘idaṃ akusala’nti vā byākareyyaṃ, taṃ mamassa musā. Yaṃ mamassa musā, so mamassa vighāto. Yo mamassa vighāto so mamassa antarāyo’ti. Iti so musāvādabhayā musāvādaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi me no; notipi me no; no notipi me no’ti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ.",
      "english": "Here, monks, some recluse or brahmin does not know 'this is wholesome' as it actually is, nor does he know 'this is unwholesome' as it actually is. He thinks thus: 'Indeed, I do not know \"this is wholesome\" as it actually is, nor do I know \"this is unwholesome\" as it actually is. If, however, I, not knowing \"this is wholesome\" as it actually is, and not knowing \"this is unwholesome\" as it actually is, were to declare 'this is wholesome' or 'this is unwholesome', that would be false for me. What would be false for me, that would be a vexation for me. What would be a vexation for me, that would be an obstruction for me.'\n\nThus, out of fear of falsehood and abhorrence of falsehood, he neither declares 'this is wholesome' nor 'this is unwholesome', but when questioned on any matter, he resorts to evasive speech, to squirming like an eel: 'It is not thus for me; it is not so for me; it is not otherwise for me; it is not 'not' for me; it is not 'not not' for me.' This, monks, is the first ground, on account of which and by relying on which some recluses and brahmins, who are eel-wrigglers, when questioned on any matter, resort to evasive speech, to squirming like an eel.",
      "sinhala": "මහණෙනි, මෙහි ඇතැම් ශ්‍ර‌මණයෙක් හෝ බ්‍රාහ්මණයෙක් ‘මේ කුසලය’ යැයි යථාභූතව නොදනී. ‘මේ අකුසලය’ යැයි යථාභූතව නොදනී. ඔහුට මෙසේ සිතේ: ‘මම නම් ‘මේ කුසලය’ යැයි යථාභූතව නොදනිමි, ‘මේ අකුසලය’ යැයි යථාභූතව නොදනිමි. එහෙත් මම, ‘මේ කුසලය’ යැයි යථාභූතව නොදැන, ‘මේ අකුසලය’ යැයි යථාභූතව නොදැන, ‘මේ කුසලය’ යැයි ප්‍ර‌කාශ කරන්නේ නම් හෝ ‘මේ අකුසලය’ යැයි ප්‍ර‌කාශ කරන්නේ නම්, එය මට මුසාවක් වනු ඇත. යම් දෙයක් මට මුසාවක් වේද, එය මට විඝාතයක් වේ. යම් දෙයක් මට විඝාතයක් වේද, එය මට අන්තරායක් වේ’යි. මෙසේ ඔහු මුසාවාදයේ බිය නිසා, මුසාවාදය පිළිකුල් කිරීම නිසා, ‘මේ කුසලය’ යැයි ප්‍ර‌කාශ නොකරයි, ‘මේ අකුසලය’ යැයිද ප්‍ර‌කාශ නොකරයි. ඒ ඒ තැන්හි ප්‍ර‌ශ්න අසන ලද කල්හි, වචන වික්ෂේපයකට, අමරාවික්ඛේපයකට පත්වේ – ‘එසේද මට නැත; ඒ අයුරින්ද මට නැත; වෙනත් අයුරකින්ද මට නැත; නොවන බවද මට නැත; නොවන බව නොවන බවද මට නැත’යි. මහණෙනි, යමක් ඇසුරු කොට, යමක් අරමුණු කොට ඇතැම් ශ්‍ර‌මණ බ්‍රාහ්මණයෝ අමරාවික්ඛේපිකයන් (වචන දඟලවන්නන්) බවට පත් වෙත්ද, ඒ ඒ තැන්හි ප්‍ර‌ශ්න අසන ලද කල්හි වචන වික්ෂේපයකට, අමරාවික්ඛේපයකට පත් වෙත්ද, මෙය එවැනි පළමු කාරණයයි.",
      "paliTitle": ""
    },
    {
      "number": 63,
      "pali": "‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’’nti yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ kusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto, ‘‘idaṃ kusala’’nti vā byākareyyaṃ, ‘‘idaṃ akusala’nti vā byākareyyaṃ, tattha me assa chando vā rāgo vā doso vā paṭigho vā. Yattha [yo (?)] me assa chando vā rāgo vā doso vā paṭigho vā, taṃ mamassa upādānaṃ. Yaṃ mamassa upādānaṃ, so mamassa vighāto. Yo mamassa vighāto, so mamassa antarāyo’ti. Iti so upādānabhayā upādānaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi me no; notipi me no; no notipi me no’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ.",
      "english": "And secondly, monks, on what account and on what basis do some monastics and brahmins, being eel-wrigglers, resort to verbal equivocation, to eel-wriggling when questioned on various points? Here, monks, some monastic or brahmin does not know as it actually is, ‘this is wholesome,’ and does not know as it actually is, ‘this is unwholesome.’ He thinks thus: ‘Indeed, I do not know “this is wholesome” as it actually is, nor do I know “this is unwholesome” as it actually is. If I, not knowing “this is wholesome” as it actually is, and not knowing “this is unwholesome” as it actually is, were to declare “this is wholesome” or declare “this is unwholesome,” there would be desire or lust or hatred or aversion for me in that. Where there would be desire or lust or hatred or aversion for me, that would be clinging for me. Whatever would be clinging for me, that would be distress for me. Whatever would be distress for me, that would be an obstruction for me.’ Thus, out of fear of clinging and out of detestation of clinging, he does not declare ‘this is wholesome,’ nor does he declare ‘this is unwholesome.’ When questioned on various points, he resorts to verbal equivocation, to eel-wriggling, saying: ‘It is not thus for me; it is not so for me; it is not otherwise for me; it is not not so for me; it is not not not so for me.’ This, monks, is the second basis, on account of which and on the basis of which some monastics and brahmins, being eel-wrigglers, resort to verbal equivocation, to eel-wriggling when questioned on various points.",
      "sinhala": "මහණෙනි, දෙවනුව, සමහර ශ්‍රමණබ්‍රාහ්මණයෝ කුමක් පදනම් කරගෙන, කුමක් අරභයා, විවිධ තැන්හි ප්‍රශ්න අසනු ලැබූ කල්හි, වචන වික්ෂේපයකට, එනම් අමරාවික්ඛේපයකට පැමිණෙත්ද? මහණෙනි, මෙහි ඇතැම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ ‘මෙය කුසලය’ යැයි යථාභූතව නොදන්නේය. ‘මෙය අකුසලය’ යැයි යථාභූතව නොදන්නේය.\n\nඔහුට මෙසේ සිතේ: ‘මා නම් ‘මෙය කුසලය’ යැයි යථාභූතව නොදනිමි, ‘මෙය අකුසලය’ යැයි යථාභූතව නොදනිමි. මා විසින් ‘මෙය කුසලය’ යැයි යථාභූතව නොදැන, ‘මෙය අකුසලය’ යැයි යථාභූතව නොදැන, ‘මෙය කුසලය’ යැයි හෝ ප්‍රකාශ කරන්නේ නම්, ‘මෙය අකුසලය’ යැයි හෝ ප්‍රකාශ කරන්නේ නම්, එහිදී මට ඡන්දය හෝ රාගය හෝ ද්වේෂය හෝ ප්‍රතිඝය ඇති විය හැකිය. යම් තැනක මට ඡන්දය හෝ රාගය හෝ ද්වේෂය හෝ ප්‍රතිඝය ඇති වේද, එය මට උපාදානයක් වන්නේය. යම් දෙයක් මට උපාදානයක් වේද, එය මට විඝාතයක් වන්නේය. යම් දෙයක් මට විඝාතයක් වේද, එය මට අන්තරායක් වන්නේය’ යනුවෙනි.\n\nමෙසේ ඔහු උපාදානයට ඇති බිය නිසාත්, උපාදානය කෙරෙහි ඇති පිළිකුල නිසාත් ‘මෙය කුසලය’ යැයි ප්‍රකාශ නොකරයි, ‘මෙය අකුසලය’ යැයිද ප්‍රකාශ නොකරයි. විවිධ තැන්හි ප්‍රශ්න අසනු ලැබූ කල්හි, වචන වික්ෂේපයකට, එනම් අමරාවික්ඛේපයකට පැමිණෙයි – ‘එසේ ද මට නොවේ; එලෙස ද මට නොවේ; වෙනත් අයුරකින් ද මට නොවේ; නොවෙතැයි ද මට නොවේ; නොවෙතැයි නොවෙතැයි ද මට නොවේ’ යැයි. මහණෙනි, ඇතැම් ශ්‍රමණබ්‍රාහ්මණයෝ කුමක් පදනම් කරගෙන, කුමක් අරභයා, විවිධ තැන්හි ප්‍රශ්න අසනු ලැබූ කල්හි, වචන වික්ෂේපයකට, එනම් අමරාවික්ඛේපයකට පැමිණෙත්ද, එයට දෙවන හේතුව මෙයයි.",
      "paliTitle": ""
    },
    {
      "number": 64,
      "pali": "‘‘Tatiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā ‘idaṃ kusala’nti yathābhūtaṃ nappajānāti, ‘idaṃ akusala’nti yathābhūtaṃ nappajānāti. Tassa evaṃ hoti – ‘ahaṃ kho ‘‘idaṃ kusala’’nti yathābhūtaṃ nappajānāmi, ‘‘idaṃ akusala’nti yathābhūtaṃ nappajānāmi. Ahañce kho pana ‘‘idaṃ kusala’’nti yathābhūtaṃ appajānanto ‘‘idaṃ akusala’’nti yathābhūtaṃ appajānanto ‘‘idaṃ kusala’’nti vā byākareyyaṃ, ‘‘idaṃ akusala’’nti vā byākareyyaṃ. Santi hi kho samaṇabrāhmaṇā paṇḍitā nipuṇā kataparappavādā vālavedhirūpā, te bhindantā [vobhindantā (sī. pī.)] maññe caranti paññāgatena diṭṭhigatāni, te maṃ tattha samanuyuñjeyyuṃ samanugāheyyuṃ samanubhāseyyuṃ. Ye maṃ tattha samanuyuñjeyyuṃ samanugāheyyuṃ samanubhāseyyuṃ, tesāhaṃ na sampāyeyyaṃ. Yesāhaṃ na sampāyeyyaṃ, so mamassa vighāto. Yo mamassa vighāto, so mamassa antarāyo’ti. Iti so anuyogabhayā anuyogaparijegucchā nevidaṃ kusalanti byākaroti, na panidaṃ akusalanti byākaroti, tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘evantipi me no; tathātipi me no; aññathātipi me no; notipi me no; no notipi me no’ti. Idaṃ, bhikkhave, tatiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ.",
      "english": "And esteemed monastics and brahmins of the third type, based on what, starting from what, do they, when questioned on various matters, resort to verbal equivocation, to eel-wriggling? Here, monks, a certain recluse or brahmin does not know 'this is wholesome' as it truly is, nor does he know 'this is unwholesome' as it truly is. He thinks thus: 'Indeed, I do not truly know \"this is wholesome,\" nor do I truly know \"this is unwholesome.\" If I, not truly knowing \"this is wholesome\" and not truly knowing \"this is unwholesome,\" were to declare \"this is wholesome\" or \"this is unwholesome,\" there are indeed recluses and brahmins who are wise, discerning, practiced in refuting others' assertions, and skilled at subtle distinctions, like hair-splitters. They, I believe, go about dissecting views with their wisdom. They might question me there, press me, dispute with me. I would not be able to hold my own against those who would question me, press me, and dispute with me. If I could not hold my own against them, that would be a cause of distress for me. That distress would be an impediment to me.' So, out of fear of questioning and aversion to questioning, he does not declare, 'this is wholesome,' nor does he declare, 'this is unwholesome.' When questioned on various matters, he resorts to verbal equivocation, to eel-wriggling, saying: 'It is not so for me; it is not thus for me; it is not otherwise for me; it is not not so for me; it is not not not so for me.' This, monks, is the third ground, based on which and starting from which, some recluses and brahmins, when questioned on various matters, become eel-wrigglers, resorting to verbal equivocation.",
      "sinhala": "තුන්වැනිව, භවත් ශ්‍රමණබ්‍රාහ්මණයෝ කුමක් අරභයා, කුමක් හේතු කොටගෙන, අමරාවික්ඛේපික වූවෝ, ඒ ඒ තැන ප්‍රශ්න අසන ලද කල්හි වචන දඟලවමින්, අමරාවික්ඛේපයට පත්වෙත්ද? මහණෙනි, මෙහි ඇතැම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ ‘මෙය කුසලය’ යැයි යථාභූතව නොදනී, ‘මෙය අකුසලය’ යැයි යථාභූතව නොදනී. ඔහුට මෙසේ සිතේ: ‘මම ‘මෙය කුසලය’ යැයි යථාභූතව නොදනිමි, ‘මෙය අකුසලය’ යැයි යථාභූතව නොදනිමි. මම යම් හෙයකින් ‘මෙය කුසලය’ යැයි යථාභූතව නොදන්නා වූ, ‘මෙය අකුසලය’ යැයි යථාභූතව නොදන්නා වූ, ‘මෙය කුසලය’ යැයි හෝ ‘මෙය අකුසලය’ යැයි හෝ ප්‍රකාශ කරමි නම්, නුවණැති, සියුම් නුවණැති, අන්‍යවාදයන් නසාදමා ඇති, කෙස් අග පවා සිදුරු කරන්නට සමත් වූ ශ්‍රමණබ්‍රාහ්මණයෝ වෙති. ඔවුහු ප්‍රඥාවෙන් දෘෂ්ටිගතයන් සිඳ බිඳ දමමින් හැසිරෙති යැයි මට සිතේ. ඔවුහු මා එහිදී ප්‍රශ්න කරනු ඇත, විමසනු ඇත, විවාද කරනු ඇත. යම් කෙනෙක් මා එහිදී ප්‍රශ්න කරත් නම්, විමසත් නම්, විවාද කරත් නම්, මම ඔවුන්ට පිළිතුරු දීමට නොහැකි වන්නෙමි. යම් අයට මට පිළිතුරු දීමට නොහැකි වේද, එය මට පීඩාවක් වනු ඇත. යම් පීඩාවක් මට වේද, එය මට අන්තරායක් වනු ඇතැයි (සිතේ).’ මෙසේ ඔහු ප්‍රශ්න කිරීමේ බියෙන්, ප්‍රශ්න කිරීමට ඇති පිළිකුලෙන්, ‘මෙය කුසලය’ යැයි ද නොකියයි, ‘මෙය අකුසලය’ යැයි ද නොකියයි. ඒ ඒ තැන ප්‍රශ්න අසන ලද කල්හි, වචන දඟලවමින්, අමරාවික්ඛේපයට පත්වෙයි – ‘එසේ යැයි ද මට නැත; අන් අයුරකින් යැයි ද මට නැත; වෙනත් අයුරකින් යැයි ද මට නැත; එසේ නොවේ යැයි ද මට නැත; එසේ නොවේ නොවේ යැයි ද මට නැත’ යැයි. මහණෙනි, මෙය තුන්වැනි කරුණයි, කුමක් අරභයා, කුමක් හේතු කොටගෙන, ඇතැම් ශ්‍රමණබ්‍රාහ්මණයෝ අමරාවික්ඛේපික වූවෝ, ඒ ඒ තැන ප්‍රශ්න අසන ලද කල්හි, වචන දඟලවමින්, අමරාවික්ඛේපයට පත්වෙත්.",
      "paliTitle": ""
    },
    {
      "number": 65,
      "pali": "‘‘Catutthe ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā mando hoti momūho. So mandattā momūhattā tattha tattha pañhaṃ puṭṭho samāno vācāvikkhepaṃ āpajjati amarāvikkhepaṃ – ‘atthi paro loko’ti iti ce maṃ pucchasi, ‘atthi paro loko’ti iti ce me assa, ‘atthi paro loko’ti iti te naṃ byākareyyaṃ, ‘evantipi me no, tathātipi me no, aññathātipi me no, notipi me no, no notipi me no’ti. ‘Natthi paro loko…pe… ‘atthi ca natthi ca paro loko…pe… ‘nevatthi na natthi paro loko…pe… ‘atthi sattā opapātikā …pe… ‘natthi sattā opapātikā…pe… ‘atthi ca natthi ca sattā opapātikā…pe… ‘nevatthi na natthi sattā opapātikā…pe… ‘atthi sukatadukkaṭānaṃ [sukaṭadukkaṭānaṃ (sī. syā. kaṃ.)] kammānaṃ phalaṃ vipāko…pe… ‘natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… ‘atthi ca natthi ca sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko… pe… ‘nevatthi na natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… ‘hoti tathāgato paraṃ maraṇā…pe… ‘na hoti tathāgato paraṃ maraṇā…pe… ‘hoti ca na ca hoti [na hoti ca (sī. ka.)] tathāgato paraṃ maraṇā…pe… ‘neva hoti na na hoti tathāgato paraṃ maraṇāti iti ce maṃ pucchasi, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti iti ce me assa, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti iti te naṃ byākareyyaṃ, ‘evantipi me no, tathātipi me no, aññathātipi me no, notipi me no, no notipi me no’ti. Idaṃ, bhikkhave, catutthaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ.",
      "english": "Furthermore, Venerables, based on what, taking what as a basis, do some recluses and brahmins, when questioned about certain matters, resort to verbal equivocation, to eel-wriggling? Here, monks, a certain recluse or brahmin is dull and foolish. Being dull and foolish, when questioned about certain matters, he resorts to verbal equivocation, to eel-wriggling.\n“If you ask me, ‘Is there another world?’ and if I were to hold the view, ‘There is another world,’ then I would declare to you, ‘There is another world.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Is there no other world?’ and if I were to hold the view, ‘There is no other world,’ then I would declare to you, ‘There is no other world.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Is there and is there not another world?’ and if I were to hold the view, ‘There is and is not another world,’ then I would declare to you, ‘There is and is not another world.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Is there neither nor not another world?’ and if I were to hold the view, ‘There is neither nor not another world,’ then I would declare to you, ‘There is neither nor not another world.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Are there spontaneously arising beings?’ and if I were to hold the view, ‘There are spontaneously arising beings,’ then I would declare to you, ‘There are spontaneously arising beings.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Are there no spontaneously arising beings?’ and if I were to hold the view, ‘There are no spontaneously arising beings,’ then I would declare to you, ‘There are no spontaneously arising beings.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Are there and are there not spontaneously arising beings?’ and if I were to hold the view, ‘There are and are not spontaneously arising beings,’ then I would declare to you, ‘There are and are not spontaneously arising beings.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Are there neither nor not spontaneously arising beings?’ and if I were to hold the view, ‘There are neither nor not spontaneously arising beings,’ then I would declare to you, ‘There are neither nor not spontaneously arising beings.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Is there fruit and result of good and bad deeds?’ and if I were to hold the view, ‘There is fruit and result of good and bad deeds,’ then I would declare to you, ‘There is fruit and result of good and bad deeds.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Is there no fruit and result of good and bad deeds?’ and if I were to hold the view, ‘There is no fruit and result of good and bad deeds,’ then I would declare to you, ‘There is no fruit and result of good and bad deeds.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Is there and is there not fruit and result of good and bad deeds?’ and if I were to hold the view, ‘There is and is not fruit and result of good and bad deeds,’ then I would declare to you, ‘There is and is not fruit and result of good and bad deeds.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Is there neither nor not fruit and result of good and bad deeds?’ and if I were to hold the view, ‘There is neither nor not fruit and result of good and bad deeds,’ then I would declare to you, ‘There is neither nor not fruit and result of good and bad deeds.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Does a Tathagata exist after death?’ and if I were to hold the view, ‘A Tathagata exists after death,’ then I would declare to you, ‘A Tathagata exists after death.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Does a Tathagata not exist after death?’ and if I were to hold the view, ‘A Tathagata does not exist after death,’ then I would declare to you, ‘A Tathagata does not exist after death.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Does a Tathagata both exist and not exist after death?’ and if I were to hold the view, ‘A Tathagata both exists and not exists after death,’ then I would declare to you, ‘A Tathagata both exists and not exists after death.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n“If you ask me, ‘Does a Tathagata neither exist nor not exist after death?’ and if I were to hold the view, ‘A Tathagata neither exists nor not exists after death,’ then I would declare to you, ‘A Tathagata neither exists nor not exists after death.’ But it is not for me ‘thus,’ nor ‘so,’ nor ‘otherwise,’ nor ‘not,’ nor ‘not not.’”\n\nThis, monks, is the fourth case, based on which, taking which as a basis, some recluses and brahmins, being eel-wrigglers, when questioned about certain matters, resort to verbal equivocation, to eel-wriggling.",
      "sinhala": "‘‘මහණෙනි, සතරවැනිව ඇතැම් ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ කුමක් අරභයා, කුමක් හේතු කොටගෙන, අමරාවික්ඛේපිකාවෝ වී, නොයෙක් තැන්හි ප්‍රශ්න අසන කල්හි, වචන ඇද බැඳීමෙහි, අමරාවික්ඛේපයට යෙදෙද්ද? මහණෙනි, මෙහිලා ඇතැම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ මන්දබුද්ධිකයෙක්, මුළාවූවෙක් වෙයි. හෙතෙම මන්දබුද්ධික භාවය නිසාත්, මුළාවූවෙක් වන නිසාත්, නොයෙක් තැන්හි ප්‍රශ්න අසන කල්හි, වචන ඇද බැඳීමෙහි, අමරාවික්ඛේපයට යෙදෙයි –\n‘පරලොවක් තිබේදැ’යි ඔබ මාගෙන් අසයි නම්, ‘පරලොවක් තිබේය’යි මට ඇත්නම්, ‘පරලොවක් තිබේය’යි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘පරලොවක් නැතැ’යි ඔබ මාගෙන් අසයි නම්, ‘පරලොවක් නැතැ’යි මට ඇත්නම්, ‘පරලොවක් නැතැ’යි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘පරලොවක් තිබේද නැත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘පරලොවක් තිබේද නැත්ද’ යයි මට ඇත්නම්, ‘පරලොවක් තිබේද නැත්ද’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘පරලොවක් නොතිබේද නැත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘පරලොවක් නොතිබේද නැත්ද’ යයි මට ඇත්නම්, ‘පරලොවක් නොතිබේද නැත්ද’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘ඕපපාතික සත්වයෝ ඇත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘ඕපපාතික සත්වයෝ ඇත්තාහ’ යයි මට ඇත්නම්, ‘ඕපපාතික සත්වයෝ ඇත්තාහ’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘ඕපපාතික සත්වයෝ නැත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘ඕපපාතික සත්වයෝ නැත්තාහ’ යයි මට ඇත්නම්, ‘ඕපපාතික සත්වයෝ නැත්තාහ’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘ඕපපාතික සත්වයෝ ඇත්ද නැත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘ඕපපාතික සත්වයෝ ඇත්ද නැත්ද’ යයි මට ඇත්නම්, ‘ඕපපාතික සත්වයෝ ඇත්ද නැත්ද’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘ඕපපාතික සත්වයෝ නොඇත්ද නැත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘ඕපපාතික සත්වයෝ නොඇත්ද නැත්ද’ යයි මට ඇත්නම්, ‘ඕපපාතික සත්වයෝ නොඇත්ද නැත්ද’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘හොඳ නරක කර්මයන්ගේ ඵල විපාක ඇත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘හොඳ නරක කර්මයන්ගේ ඵල විපාක ඇත්තාහ’ යයි මට ඇත්නම්, ‘හොඳ නරක කර්මයන්ගේ ඵල විපාක ඇත්තාහ’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘හොඳ නරක කර්මයන්ගේ ඵල විපාක නැත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘හොඳ නරක කර්මයන්ගේ ඵල විපාක නැත්තාහ’ යයි මට ඇත්නම්, ‘හොඳ නරක කර්මයන්ගේ ඵල විපාක නැත්තාහ’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘හොඳ නරක කර්මයන්ගේ ඵල විපාක ඇත්ද නැත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘හොඳ නරක කර්මයන්ගේ ඵල විපාක ඇත්ද නැත්ද’ යයි මට ඇත්නම්, ‘හොඳ නරක කර්මයන්ගේ ඵල විපාක ඇත්ද නැත්ද’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘හොඳ නරක කර්මයන්ගේ ඵල විපාක නොඇත්ද නැත්දැ’යි ඔබ මාගෙන් අසයි නම්, ‘හොඳ නරක කර්මයන්ගේ ඵල විපාක නොඇත්ද නැත්ද’ යයි මට ඇත්නම්, ‘හොඳ නරක කර්මයන්ගේ ඵල විපාක නොඇත්ද නැත්ද’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘තථාගතයන් වහන්සේ මරණින් පසු සිටීදැ’යි ඔබ මාගෙන් අසයි නම්, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටී’ යයි මට ඇත්නම්, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටී’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටීදැ’යි ඔබ මාගෙන් අසයි නම්, ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටී’ යයි මට ඇත්නම්, ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටී’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘තථාගතයන් වහන්සේ මරණින් පසු සිටීද නොසිටීදැ’යි ඔබ මාගෙන් අසයි නම්, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටීද නොසිටීද’ යයි මට ඇත්නම්, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටීද නොසිටීද’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි.\n‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටීද නොනොසිටීදැ’යි ඔබ මාගෙන් අසයි නම්, ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටීද නොනොසිටීද’ යයි මට ඇත්නම්, ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටීද නොනොසිටීද’ යයි මම ඔබට ප්‍රකාශ කරන්නෙමි. ‘මට එසේත් නැත, එබඳුත් නැත, අන් ආකාරයකින්වත් නැත, නැතැයි කියන අයුරිනුත් නැත, නැතැයි නොකියන අයුරිනුත් නැත’ යයි කියයි. මහණෙනි, ඇතැම් ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ කුමක් අරභයා, කුමක් හේතු කොටගෙන, අමරාවික්ඛේපිකාවෝ වී, නොයෙක් තැන්හි ප්‍රශ්න අසන කල්හි, වචන ඇද බැඳීමෙහි, අමරාවික්ඛේපයට යෙදෙද්ද, ඒ සතරවැනි කරුණ මෙයයි.",
      "paliTitle": ""
    },
    {
      "number": 66,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ, sabbe te imeheva catūhi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. ",
      "english": "Indeed, monks, these ascetics and brahmins who are eel-wrigglers, when questioned on various points, resort to verbal prevarication, which is their characteristic eel-wriggling, on four grounds. Whatever ascetics or brahmins, monks, are eel-wrigglers, who, when questioned on various points, resort to verbal prevarication, which is their characteristic eel-wriggling — all of them do so on these four grounds, or on one of these. There is nothing outside of these grounds, nor any means by which they could truly and rightly describe the Tathāgata.",
      "sinhala": "මහණෙනි, ඒ අමරාවික්ඛේපික ශ්‍රමණ-බ්‍රාහ්මණයෝ තැන තැන ප්‍රශ්න විමසූ කල්හි මේ සතර වස්තූන්ගෙන් වාචා වික්ඛේපයටත්, අමරාවික්ඛේපයටත් පැමිණෙත්. මහණෙනි, යම් කිසි අමරාවික්ඛේපික ශ්‍රමණ-බ්‍රාහ්මණයෝ තැන තැන ප්‍රශ්න විමසූ කල්හි වාචා වික්ඛේපයටත්, අමරාවික්ඛේපයටත් පැමිණෙත් ද, ඒ සියල්ලෝම මේ සතර වස්තූන්ගෙන්ම හෝ ඉන් එක් වස්තුවකින් හෝ පැමිණෙත්. මීට පිටතින්, යම් කරුණක් නිසා තථාගතයන් වහන්සේගේ යථාභූත වර්ණය මැනවින් කියන්නට සමත් වෙත් ද, එවැනි කිසිවක් නොමැත.",
      "paliTitle": ""
    },
    {
      "number": 67,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi?",
      "english": "Monks, there are some ascetics and brahmins who are fortuitous-originists, asserting the self and the world to have arisen by chance on account of two grounds. And what do these venerable ascetics and brahmins take as their basis, what do they rely upon, when they assert themselves as fortuitous-originists, proclaiming the self and the world to have arisen by chance on account of two grounds?",
      "sinhala": "මහණෙනි, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ අහේතුක අප්‍රත්‍යවාදීහු වෙති. ඔවුහු තමාද, ලෝකයද අහේතුක අප්‍රත්‍යව හටගත්තක් ලෙස කරුණු දෙකකින් පනවති. ඒ පින්වත් ශ්‍රමණ බ්‍රාහ්මණයෝ, කුමක් අරභයා, කුමක් මුල්කරගෙන, අහේතුක අප්‍රත්‍යවාදීහු වෙමින්, තමාද, ලෝකයද අහේතුක අප්‍රත්‍යව හටගත්තක් ලෙස කරුණු දෙකකින් පනවන්නේද?",
      "paliTitle": "Adhiccasamuppannavādo",
      "englishTitle": "Doctrine of Spontaneous Arising",
      "sinhalaTitle": "අහේතුක උත්පත්ති වාදය"
    },
    {
      "number": 68,
      "pali": "‘‘Santi, bhikkhave, asaññasattā nāma devā. Saññuppādā ca pana te devā tamhā kāyā cavanti. Ṭhānaṃ kho panetaṃ, bhikkhave, vijjati, yaṃ aññataro satto tamhā kāyā cavitvā itthattaṃ āgacchati. Itthattaṃ āgato samāno agārasmā anagāriyaṃ pabbajati. Agārasmā anagāriyaṃ pabbajito samāno ātappamanvāya padhānamanvāya anuyogamanvāya appamādamanvāya sammāmanasikāramanvāya tathārūpaṃ cetosamādhiṃ phusati, yathāsamāhite citte saññuppādaṃ anussarati, tato paraṃ nānussarati. So evamāha – ‘adhiccasamuppanno attā ca loko ca. Taṃ kissa hetu? Ahañhi pubbe nāhosiṃ, somhi etarahi ahutvā santatāya pariṇato’ti. Idaṃ, bhikkhave, paṭhamaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti.",
      "english": "Monks, there are deities called non-percipient beings. Yet, upon the arising of perception, those deities pass away from that realm. Monks, there is indeed the possibility that a certain being, having passed away from that realm, comes to this state of existence. Having come to this state of existence, they go forth from the home life into homelessness. Having gone forth from the home life into homelessness, undertaking ardency, undertaking exertion, undertaking application, undertaking heedfulness, and undertaking right attention, they attain such a concentration of mind that, with the mind thus concentrated, they recollect the arising of perception, but beyond that they recollect nothing. They say thus: ‘Both the self and the world are spontaneously arisen. For what reason? Because I did not exist before, but now I am; having not existed, I have transformed into a continuous being.’ Monks, this is the first instance, relying on which and on account of which some ascetics and brahmins, proponents of spontaneous arising, proclaim both the self and the world as spontaneously arisen.",
      "sinhala": "භික්ෂූනි, අසඤ්ඤසත්ත නම් දෙවිවරු සිටිති. සඤ්ඤාව පහළවීමෙන් ඒ දෙවිවරු ඒ කයින් චුත වෙති. භික්ෂූනි, යම් කිසි සත්වයෙක් ඒ කයින් චුතවී මේ මනුෂ්‍ය භාවයට පැමිණෙන මේ කරුණක් පවතී. මේ මනුෂ්‍ය භාවයට පැමිණ, ගිහිගෙයින් නික්ම අනගාරිකභාවයට පැවිදි වෙයි. ගිහිගෙයින් නික්ම අනගාරිකභාවයට පැවිදි වූයේ, දැඩි වීර්යය අනුගමනය කරමින්, ප්‍ර‌ධාන වීර්යය අනුගමනය කරමින්, නැවත නැවත යෙදීම අනුගමනය කරමින්, අප්‍ර‌මාදය අනුගමනය කරමින්, මනා සිහිය අනුගමනය කරමින්, එබඳු චිත්ත සමාධියක් ස්පර්ශ කරයි. එසේ සමහිත වූ සිතින් සඤ්ඤාව පහළවීම සිහි කරයි. ඊට එහා සිහි නොකරයි. ඔහු මෙසේ කියයි: ‘ආත්මය හා ලෝකය අහේතුකව හටගත්තකි. ඊට හේතුව කුමක්ද? මම පෙර නොසිටියෙමි, දැන් නොසිට පැවැත්මට පත්ව සිටිමි.’ භික්ෂූනි, යමක් මුල්කොටගෙන, යමක් අරමුණු කොටගෙන, සමහර ශ්‍ර‌මණයෝ සහ බ්‍ර‌ාහ්මණයෝ, අහේතුකව හටගැනීම පිළිබඳ දෘෂ්ටිය ඇත්තෝ, අහේතුකව හටගත් ආත්මයක් සහ ලෝකයක් ප්‍ර‌කාශ කරති. මෙය පළමු ස්ථානයයි.",
      "paliTitle": ""
    },
    {
      "number": 69,
      "pali": "‘‘Dutiye ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti? Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā takkī hoti vīmaṃsī. So takkapariyāhataṃ vīmaṃsānucaritaṃ sayaṃpaṭibhānaṃ evamāha – ‘adhiccasamuppanno attā ca loko cā’ti. Idaṃ, bhikkhave, dutiyaṃ ṭhānaṃ, yaṃ āgamma yaṃ ārabbha eke samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti.",
      "english": "And secondly, bhikkhus, on what grounds and based on what do some recluses and brahmins, who are accidentalists, declare the self and the world to be accidentally arisen? Here, bhikkhus, some recluse or brahmin is a reasoner and an inquirer. He, overwhelmed by speculation and followed by investigation, with his own spontaneous insight, speaks thus: ‘The self and the world are accidentally arisen.’ This, bhikkhus, is the second ground, based on which and regarding which, some recluses and brahmins, who are accidentalists, declare the self and the world to be accidentally arisen.",
      "sinhala": "භවත් මහණ බ්‍රාහ්මණයෝ දෙවනුව කුමක් මුල්කොටගෙන, කුමක් ආරම්භකොටගෙන අධිච්චසමුප්පන්නවාදීව ආත්මයත් ලෝකයත් නිරහේතුකව හටගත්තා වූ ඒවා යැයි පනවන්නේද? මහණෙනි, මෙහිලා යම් ශ්‍රමණයෙක් හෝ බ්‍රාහ්මණයෙක් තර්ක කරන්නෙක් හෝ විමර්ශනය කරන්නෙක් වේ. ඔහු තර්කයෙන් පෙළඹී, විමර්ශනයට අනුගතව, ස්වයංව පහළ වූ ඥානයකින් ‘ආත්මයත් ලෝකයත් නිරහේතුකව හටගත්තා වූ ඒවාය’ යැයි මෙසේ කියයි. මහණෙනි, යම් කරුණක් මුල්කොටගෙන, යමක් ආරම්භකොටගෙන සමහර ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ අධිච්චසමුප්පන්නවාදීව නිරහේතුකව හටගත්තා වූ ආත්මයත් ලෝකයත් පනවතිද, මෙය දෙවැනි කරුණයි.",
      "paliTitle": ""
    },
    {
      "number": 70,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti, sabbe te imeheva dvīhi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ.",
      "english": "Monks, it is by these two grounds that those ascetics and brahmins, who are accidentalists, assert an accidentally arisen self and world. Whatever ascetics or brahmins, monks, who are accidentalists, assert an accidentally arisen self and world, all of them do so by these very two grounds, or by one of them. There is nothing outside of these by which they might rightly and truly describe the Tathāgata.",
      "sinhala": "භික්ෂූණි, ඒ අධිච්චසමුප්පන්නවාදී ශ්‍රමණ‍-බ්‍රාහ්මණයෝ මේ ද්විවිධ කරුණු හේතුවෙන්, හේතුවක් නොමැතිව හටගන්නා ආත්මයක් සහ ලෝකයක් පනවති. භික්ෂූණි, යම් කිසි ශ්‍රමණ‍යෝ හෝ බ්‍රාහ්මණයෝ අධිච්චසමුප්පන්නවාදීව හේතුවක් නොමැතිව හටගන්නා ආත්මයක් සහ ලෝකයක් පනවති ද, ඒ සියලු දෙනා මේ ද්විවිධ කරුණු හේතුවෙන්ම හෝ මේවායින් එකක් හේතුවෙන් (එසේ පනවති). මෙයට පිටින් (වෙනත් කිසිවක්) නැත, යමක් හේතුවෙන් තථාගතයන් වහන්සේගේ යථාභූත ස්වභාවය මැනවින් ප්‍රකාශ‍ කරමින් පැවසිය හැකි වේ ද.",
      "paliTitle": ""
    },
    {
      "number": 71,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā pubbantānudiṭṭhino pubbantamārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva aṭṭhārasahi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā.",
      "english": "Monks, it is by means of these eighteen grounds that those ascetics and brahmins who are speculators concerning the past and hold views about the past proclaim various kinds of assertions based on their own inclinations concerning the past. Indeed, monks, whatever ascetics or brahmins, being speculators concerning the past and holding views about the past, concerning the past, proclaim various kinds of assertions based on their own inclinations—all of them do so by these eighteen grounds, or by one of them; there is nothing outside of these.",
      "sinhala": "මහණෙනි, අතීතය කල්පනා කරන්නා වූ ද, අතීතය පිළිබඳ දෘෂ්ටි ඇත්තා වූ ද ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ අතීතය අරභයා නොයෙක් ආකාර වූ අධිමුක්තිපදයන් මෙම දහඅටක් වූ කරුණු මගින් ප්‍රකාශ කරති. මහණෙනි, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ අතීතය කල්පනා කරමින් ද, අතීතය පිළිබඳ දෘෂ්ටි ගනිමින් ද, අතීතය අරභයා නොයෙක් ආකාර වූ අධිමුක්තිපදයන් ප්‍රකාශ කරති ද, ඔවුන් සියල්ලෝම මේ දහඅටක් වූ කරුණු මගින්ම හෝ, මේවායින් එකක් මගින් හෝ ප්‍රකාශ කරති. මෙයින් බැහැරව අන් කිසිවක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 72,
      "pali": "‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato.",
      "english": "Monks, the Tathāgata comprehends this: ‘These standpoints of views, when thus grasped, thus adhered to, lead to such a destination and result in such a future state.’ The Tathāgata comprehends that, and he comprehends what is even superior to that. He does not cling to that comprehension, and for him who does not cling, coolness is realized personally. Monks, having known as it actually is the origin, the disappearance, the gratification, the danger, and the escape from feelings, the Tathāgata is liberated without clinging.",
      "sinhala": "මහණෙනි, මේ දෘෂ්ටි ස්ථාන මෙලෙස ගත් කල්හි, මෙලෙස දැඩිව ග්‍රහණය කරගත් කල්හි, මෙබඳු ගතියක් ඇති වේ, මෙබඳු පරලොවක් ඇති වේ යැයි තථාගතයන් වහන්සේ ප‍්‍රත්‍යක්‍ෂයෙන් දනී.\n\nතථාගතයන් වහන්සේ එයද ප‍්‍රත්‍යක්‍ෂයෙන් දනී. එයටත් වඩා උත්තරීතරව දනී. එම දැනීමද තදින් අල්ලා නොගනී. එසේ තදින් අල්ලා නොගන්නා හෙයින් උන්වහන්සේට තමන් විසින්ම නිවන ප‍්‍රත්‍යක්‍ෂ වේ.\n\nමහණෙනි, තථාගතයන් වහන්සේ වේදනාවන්ගේ හටගැනීමද, නැතිවීමද, ආශ්වාදයද, ආදීනවයද, නිස්සරණයද යථාභූතව දැන, උපාදානයකින් තොරව විමුක්ත වූ සේක.",
      "paliTitle": ""
    },
    {
      "number": 73,
      "pali": "‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. Dutiyabhāṇavāro. ",
      "english": "Monks, these teachings are profound, difficult to see, difficult to comprehend, peaceful, sublime, beyond the scope of reasoning, subtle, and to be experienced by the wise. These are the teachings that the Tathāgata, having directly known and realized them for himself, proclaims, and by means of which, one would rightly speak the true praise of the Tathāgata.",
      "sinhala": "භික්ෂූණි, මේ ධර්‍මයෝ ගැඹුරු වූ, දැකීමට අපහසු වූ, අවබෝධ කර ගැනීමට අපහසු වූ, ශාන්ත වූ, ප්‍රණීත වූ, තර්කයෙන් ළඟා විය නොහැකි වූ, සියුම් වූ, පණ්ඩිතයන්ට පමණක් අවබෝධ කළ හැකි ධර්‍මයෝ වෙති. යම් ධර්‍මයන් තථාගතයන් වහන්සේ විසින් තමන්ම අභිඥාවෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කර, දේශනා කරනු ලබයිද, එම ධර්‍මයන් මගින් තථාගතයන් වහන්සේගේ සැබෑ ගුණය නිවැරදිව පවසන අය පවසනු ඇත. දෙවන භාණවාරයයි.",
      "paliTitle": ""
    },
    {
      "number": 74,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino, aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya [catucattālīsāya (syā. kaṃ.)] vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi? ",
      "english": "Monks, there are some recluses and brahmins who speculate about the future, who adhere to views concerning the future, and who assert various kinds of speculative doctrines regarding the future on forty-four grounds.\n\nWhat do those venerable recluses and brahmins rely on and refer to, when they speculate about the future, adhere to views concerning the future, and assert various kinds of speculative doctrines regarding the future on forty-four grounds?",
      "sinhala": "භික්ෂූණි, සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ අනාගතය පිළිබඳව කල්පනා කරන්නෝ ද, අනාගතය පිළිබඳව දෘෂ්ටි දරන්නෝ ද වෙති. ඔවුහු අනාගතය අරමුණු කරගෙන, සතළිස් හතරක් වූ කරුණු මගින් නොයෙකුත් ආකාරයේ අදහස් ප්‍රකාශ කරති.\n\nඑසේ නම්, ඒ පින්වත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් අරමුණු කරගෙන, කුමක් හේතු කොටගෙන අනාගතය පිළිබඳව කල්පනා කරන්නෝ වෙත්ද? අනාගතය පිළිබඳව දෘෂ්ටි දරන්නෝ වෙත්ද? අනාගතය අරමුණු කරගෙන, සතළිස් හතරක් වූ කරුණු මගින් නොයෙකුත් ආකාරයේ අදහස් ප්‍රකාශ කරත්ද?",
      "paliTitle": "Aparantakappikā",
      "englishTitle": "Speculators about the future",
      "sinhalaTitle": "අපරන්ත කල්පනා"
    },
    {
      "number": 75,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi?",
      "english": "Monks, there are some ascetics and brahmins who are proponents of a conscious self after death, declaring a conscious self after death based on sixteen principles. Upon what do those venerable ascetics and brahmins rely, and with what do they begin, to be proponents of a conscious self after death, declaring a conscious self after death based on sixteen principles?",
      "sinhala": "මහණෙනි, මරණින් මතු සංඥා සහිත ආත්මයක් ඇතැයි වාද කරන, එනම් මරණින් මතු සංඥා සහිත ආත්මයක් සොළොස් ආකාරයකින් ප්‍රකාශ කරන සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ වෙති.\n\nඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් ආශ්‍රය කරගෙනද, කුමක් මුල් කරගෙනද මරණින් මතු සංඥා සහිත ආත්මයක් ඇතැයි වාද කරන, එනම් මරණින් මතු සංඥා සහිත ආත්මයක් සොළොස් ආකාරයකින් ප්‍රකාශ කරන්නේ?",
      "paliTitle": "Saññīvādo",
      "englishTitle": "Perceptual Doctrine",
      "sinhalaTitle": "සංඥා වාදය"
    },
    {
      "number": 76,
      "pali": "‘‘‘Rūpī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti. ‘Arūpī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti. ‘Rūpī ca arūpī ca attā hoti…pe… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti… ekattasaññī attā hoti… nānattasaññī attā hoti… parittasaññī attā hoti… appamāṇasaññī attā hoti… ekantasukhī attā hoti… ekantadukkhī attā hoti. Sukhadukkhī attā hoti. Adukkhamasukhī attā hoti arogo paraṃ maraṇā saññī’ti naṃ paññapenti.",
      "english": "They declare that the self is material, healthy, and percipient after death. They declare that the self is immaterial, healthy, and percipient after death. They declare that the self is both material and immaterial, healthy, and percipient after death. They declare that the self is neither material nor immaterial, healthy, and percipient after death. They declare that the self is finite, healthy, and percipient after death. They declare that the self is infinite, healthy, and percipient after death. They declare that the self is both finite and infinite, healthy, and percipient after death. They declare that the self is neither finite nor infinite, healthy, and percipient after death. They declare that the self is of unitary perception, healthy, and percipient after death. They declare that the self is of diverse perception, healthy, and percipient after death. They declare that the self is of limited perception, healthy, and percipient after death. They declare that the self is of boundless perception, healthy, and percipient after death. They declare that the self is exclusively happy, healthy, and percipient after death. They declare that the self is exclusively suffering, healthy, and percipient after death. They declare that the self is both happy and suffering, healthy, and percipient after death. They declare that the self is neither suffering nor happy, healthy, and percipient after death.",
      "sinhala": "ආත්මය මරණින් පසු රූපීව, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු අරූපීව, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු රූපී ද අරූපී ද වෙමින්, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු රූපී ද නොවේ, අරූපී ද නොවේ වෙමින්, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු සීමා සහිතව, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු අප්‍රමාණව, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු සීමා සහිත ද අප්‍රමාණ ද වෙමින්, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු සීමා සහිත ද නොවේ, අප්‍රමාණ ද නොවේ වෙමින්, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු එක බව පිළිබඳ සංඥා සහිතව, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු වෙනස් බව පිළිබඳ සංඥා සහිතව, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු අල්ප වූ සංඥා සහිතව, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු අප්‍රමාණ වූ සංඥා සහිතව, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු ඒකාන්තයෙන් සැපවත් වෙමින්, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු ඒකාන්තයෙන් දුක් සහිත වෙමින්, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු සැප ද දුක් ද සහිත වෙමින්, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.\nආත්මය මරණින් පසු දුක් ද නොවේ, සැප ද නොවේ වෙමින්, නිරෝගීව, සංඥා සහිතව පවතින්නේ යැයි ඔවුහු පනවති.",
      "paliTitle": ""
    },
    {
      "number": 77,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti, sabbe te imeheva soḷasahi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. ",
      "english": "Indeed, monks, these recluses and brahmins, conceptualists of a post-death perception, declare their self to be perceptive after death by sixteen modes. Whatever recluses or brahmins, monks, who are conceptualists of a post-death perception and declare their self to be perceptive after death, all of them do so by these same sixteen modes, or by one of them. There is nothing outside of these by which anyone speaking rightly would describe the Tathagata in accordance with reality.",
      "sinhala": "මහණෙනි, මරණයෙන් පසු සංඥා සහිත ආත්මයක් ඇතැයි දේශනා කරන්නා වූ, එබඳු සංඥා වාද ඇත්තා වූ ශ්‍රමණ-බ්‍රාහ්මණයෝ මේ දහසය කරුණකින් තමන්ගේ ආත්මය මරණයෙන් පසු සංඥා සහිත යැයි ප්‍රකාශ කරති. මහණෙනි, යම් ශ්‍රමණ-බ්‍රාහ්මණයෙක් මරණයෙන් පසු සංඥා සහිත ආත්මයක් පවතී යැයි දේශනා කරමින්, එබඳු සංඥා වාදයක් ඇත්තෙක් වේද, ඒ සියල්ලෝ මේ දහසය කරුණෙන්ම හෝ එයිනුත් එක කරුණකින් හෝ මරණයෙන් පසු සංඥා සහිත ආත්මයක් පවතින බව ප්‍රකාශ කරති. මෙයින් බැහැරව අන් කිසිවක් නැත. යමකින් තථාගතයන් වහන්සේගේ යථාභූත ගුණ වර්ණාව නිවැරදිව කීමට හැකි වේද, එවැන්නක් මෙයින් බැහැරව කිසිසේත් නැත.",
      "paliTitle": ""
    },
    {
      "number": 78,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi?",
      "english": "Monks, there are some ascetics and brahmins who are proponents of the doctrine of an unconscious self after death, proclaiming an unconscious self after death on eight grounds. And on what grounds, concerning what, do those venerable ascetics and brahmins—proponents of the doctrine of an unconscious self after death—proclaim an unconscious self after death on eight grounds?",
      "sinhala": "මහණෙනි, මරණින් මතු ආත්මය සිඳී බිඳී යන බව පවසන, අසංඥවාදී ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ කරුණු අටකින් මරණින් මතු අසංඥ වූ ආත්මයක් පනවති. ඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් අරමුණු කොටගෙන, කුමක් නිමිති කොටගෙන, මරණින් මතු ආත්මය සිඳී බිඳී යන බව පවසන අසංඥවාදීහු, කරුණු අටකින් මරණින් මතු අසංඥ වූ ආත්මයක් පනවතිද?",
      "paliTitle": "Asaññīvādo",
      "englishTitle": "Doctrine of the Non-Percipient",
      "sinhalaTitle": "අසංඥ වාදය"
    },
    {
      "number": 79,
      "pali": "‘‘‘Rūpī attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti. ‘Arūpī attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti. ‘Rūpī ca arūpī ca attā hoti…pe… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti arogo paraṃ maraṇā asaññī’ti naṃ paññapenti.",
      "english": "They declare that the self is corporeal, healthy after death, and unconscious. They declare that the self is formless, healthy after death, and unconscious. They declare that the self is both corporeal and formless, healthy after death, and unconscious. They declare that the self is neither corporeal nor formless, healthy after death, and unconscious. They declare that the self is finite, healthy after death, and unconscious. They declare that the self is infinite, healthy after death, and unconscious. They declare that the self is both finite and infinite, healthy after death, and unconscious. They declare that the self is neither finite nor infinite, healthy after death, and unconscious.",
      "sinhala": "‘ආත්මය රූපීව, මරණින් මතු නිරෝගීව, අසංඥව පවතී’ යැයි ඔවුහු ප්‍රකාශ කරති. ‘ආත්මය අරූපීව, මරණින් මතු නිරෝගීව, අසංඥව පවතී’ යැයි ඔවුහු ප්‍රකාශ කරති. ‘ආත්මය රූපී හා අරූපීව, මරණින් මතු නිරෝගීව, අසංඥව පවතී’ යැයි ඔවුහු ප්‍රකාශ කරති. ‘ආත්මය රූපී නොවූ, අරූපීද නොවූ ස්වභාවයෙන්, මරණින් මතු නිරෝගීව, අසංඥව පවතී’ යැයි ඔවුහු ප්‍රකාශ කරති. ‘ආත්මය අන්ත සහිතව, මරණින් මතු නිරෝගීව, අසංඥව පවතී’ යැයි ඔවුහු ප්‍රකාශ කරති. ‘ආත්මය අනන්තව, මරණින් මතු නිරෝගීව, අසංඥව පවතී’ යැයි ඔවුහු ප්‍රකාශ කරති. ‘ආත්මය අන්ත සහිත වූ හා අනන්ත වූ ස්වභාවයෙන්, මරණින් මතු නිරෝගීව, අසංඥව පවතී’ යැයි ඔවුහු ප්‍රකාශ කරති. ‘ආත්මය අන්ත සහිත නොවූ, අනන්තද නොවූ ස්වභාවයෙන්, මරණින් මතු නිරෝගීව, අසංඥව පවතී’ යැයි ඔවුහු ප්‍රකාශ කරති.",
      "paliTitle": ""
    },
    {
      "number": 80,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti, sabbe te imeheva aṭṭhahi vatthūhi, etesaṃ vā aññatarena, natthi ito bahiddhā…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. ",
      "english": "Indeed, monks, these ascetics and brahmins who uphold the doctrine of a non-percipient existence beyond death declare a non-percipient self beyond death based on eight grounds. Whatever ascetics or brahmins, monks, declare a non-percipient existence beyond death and proclaim a non-percipient self beyond death, all of them do so based on these eight grounds, or on one of these; there is nothing apart from these, by which one could rightly speak the true praise of the Tathāgata.",
      "sinhala": "මහණෙනි, ඌර්ධ්වමාඝාතනික වූ අසංඥීවාදී ශ්‍ර‌මණ බ්‍රාහ්මණයෝ ඌර්ධ්වමාඝාතනයෙන් පසු අසංඥ වූ ආත්මයක් අට ආකාරයකින් පනවති.\n\nමහණෙනි, යම් කිසි ශ්‍ර‌මණ බ්‍රාහ්මණයෝ ඌර්ධ්වමාඝාතනික අසංඥීවාදීව ඌර්ධ්වමාඝාතනයෙන් පසු අසංඥ ආත්මයක් පනවන්නේ නම්, ඒ සියල්ලෝම මේ අට කරුණුවලින්ම හෝ ඒ අට කරුණුවලින් එකකින් හෝ පනවති. මෙයින් බාහිරව තථාගතයන් වහන්සේගේ යථාභූත වූ ගුණ වැනීමක් මැනවින් ප්‍ර‌කාශ කළ හැකි අන් කිසිවක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 81,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā, uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi?",
      "english": "Monks, there are some ascetics and brahmins who are proponents of the ultimate annihilation of the neither-percipient-nor-non-percipient state, declaring the neither-percipient-nor-non-percipient self to undergo ultimate annihilation by means of eight grounds.\n\nAnd based on what, starting from what, do those venerable ascetics and brahmins, who are proponents of the ultimate annihilation of the neither-percipient-nor-non-percipient state, declare the neither-percipient-nor-non-percipient self to undergo ultimate annihilation by means of eight grounds?",
      "sinhala": "මහණෙනි, සමහර ශ්‍රමණ-බ්‍රාහ්මණයෝ උද්ධමාඝාතනය සහ නේවසඤ්ඤීනාසඤ්ඤීවාදය දරන්නෝ වෙති. ඔවුහු අට කරුණකින් නේවසඤ්ඤීනාසඤ්ඤීව වූ ආත්මය උද්ධමාඝාතනය වන බව ප්‍රකාශ කරති.\n\nඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් ආශ්‍රය කරගෙන, කුමක් අරමුණු කරගෙන උද්ධමාඝාතනය සහ නේවසඤ්ඤීනාසඤ්ඤීවාදය දරන්නෝ වෙමින් නේවසඤ්ඤීනාසඤ්ඤීව වූ ආත්මය උද්ධමාඝාතනය වන බව කරුණු අටකින් ප්‍රකාශ කරන්නේද?",
      "paliTitle": "Nevasaññīnāsaññīvādo",
      "englishTitle": "Discourse on Neither Perception Nor Non-Perception",
      "sinhalaTitle": "නේවසඤ්ඤානාසඤ්ඤා වාදය"
    },
    {
      "number": 82,
      "pali": "‘‘‘Rūpī attā hoti arogo paraṃ maraṇā nevasaññīnāsaññī’ti naṃ paññapenti ‘arūpī attā hoti… pe… rūpī ca arūpī ca attā hoti… nevarūpī nārūpī attā hoti… antavā attā hoti… anantavā attā hoti… antavā ca anantavā ca attā hoti… nevantavā nānantavā attā hoti arogo paraṃ maraṇā nevasaññīnāsaññī’ti naṃ paññapenti.",
      "english": "They describe the self as material; or as immaterial; or as both material and immaterial; or as neither material nor immaterial; or as finite; or as infinite; or as both finite and infinite; or as neither finite nor infinite—all of which they describe as being healthy after death, neither percipient nor non-percipient.",
      "sinhala": "“ආත්මය රූපීව, මරණින් පසු නිරෝගීව, නේවසඤ්ඤී නාසඤ්ඤීව පවතී” යැයි ඔවුහු පනවති. “ආත්මය අරූපීව, මරණින් පසු නිරෝගීව, නේවසඤ්ඤී නාසඤ්ඤීව පවතී” යැයි ඔවුහු පනවති. “ආත්මය රූපී ද අරූපී ද ව, මරණින් පසු නිරෝගීව, නේවසඤ්ඤී නාසඤ්ඤීව පවතී” යැයි ඔවුහු පනවති. “ආත්මය රූපී ද නොවන, අරූපී ද නොවන ව, මරණින් පසු නිරෝගීව, නේවසඤ්ඤී නාසඤ්ඤීව පවතී” යැයි ඔවුහු පනවති. “ආත්මය අන්තය සහිත ව, මරණින් පසු නිරෝගීව, නේවසඤ්ඤී නාසඤ්ඤීව පවතී” යැයි ඔවුහු පනවති. “ආත්මය අනන්තය සහිත ව, මරණින් පසු නිරෝගීව, නේවසඤ්ඤී නාසඤ්ඤීව පවතී” යැයි ඔවුහු පනවති. “ආත්මය අන්තය සහිත ද අනන්තය සහිත ද ව, මරණින් පසු නිරෝගීව, නේවසඤ්ඤී නාසඤ්ඤීව පවතී” යැයි ඔවුහු පනවති. “ආත්මය අන්තය සහිත ද නොවන, අනන්තය සහිත ද නොවන ව, මරණින් පසු නිරෝගීව, නේවසඤ්ඤී නාසඤ්ඤීව පවතී” යැයි ඔවුහු පනවති.",
      "paliTitle": ""
    },
    {
      "number": 83,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti, sabbe te imeheva aṭṭhahi vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. ",
      "english": "Indeed, bhikkhus, it is by these eight grounds that ascetics and brahmins who hold the view of an ultimate attainment of neither-perception-nor-non-perception declare the self to be of ultimate attainment, neither-perceiving-nor-non-perceiving. Whoever, bhikkhus, are ascetics or brahmins who hold the view of an ultimate attainment of neither-perception-nor-non-perception and declare the self to be of ultimate attainment, neither-perceiving-nor-non-perceiving, all of them do so by these same eight grounds, whereby one would rightly speak a true description of the Tathāgata.",
      "sinhala": "භික්ෂූණි, ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ඉහළට කපා දැමීමේ ස්වභාවයෙන් යුක්ත වූ නේවසඤ්ඤානාසඤ්ඤී වාද දරන්නෝ වෙත්. ඔවුහු ඉහළට කපා දැමීමක් වන නේවසඤ්ඤානාසඤ්ඤි ආත්මයක් වස්තු අටකින් පනවති. භික්ෂූණි, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ හෝ ඉහළට කපා දැමීමේ ස්වභාවයෙන් යුක්ත වූ නේවසඤ්ඤානාසඤ්ඤී වාද දරන්නෝ වෙත් ද, ඔවුහු ඉහළට කපා දැමීමක් වන නේවසඤ්ඤානාසඤ්ඤි ආත්මයක් පනවති ද, ඔවුන් සියල්ලෝම මේ වස්තු අටෙන්ම පනවති. යම් දේවලින් තථාගතයන් වහන්සේ සැබෑ ලෙස විස්තර කරන්නේ නම්, නිවැරදි ලෙසම වර්ණනා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 84,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi?",
      "english": "Monks, there are some ascetics and brahmins who are annihilationists, proclaiming the annihilation, destruction, and non-existence of an existent being by means of seven bases. And relying on what, starting from what, do those venerable ascetics and brahmins, as annihilationists, proclaim the annihilation, destruction, and non-existence of an existent being by means of seven bases?",
      "sinhala": "මහණෙනි, ඇතැම් ශ්‍රමණබ්‍රාහ්මණවරු උච්ඡේදවාදීහු වෙති. ඔවුහු පවත්නා සත්ත්වයෙකුගේ උච්ඡේදය, විනාශය, විභවය යන මේවා කරුණු සතකින් පනවති. ඒ භවත් ශ්‍රමණබ්‍රාහ්මණවරු උච්ඡේදවාදීව, කුමක් අරභයා, කුමක් හේතුකොටගෙන, පවත්නා සත්ත්වයෙකුගේ උච්ඡේදය, විනාශය, විභවය යන මේවා කරුණු සතකින් පනවති ද?",
      "paliTitle": "Ucchedavādo",
      "englishTitle": "Annihilationism",
      "sinhalaTitle": "උච්ඡේදවාදය"
    },
    {
      "number": 85,
      "pali": "‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā evaṃvādī hoti evaṃdiṭṭhi [evaṃdiṭṭhī (ka. pī.)] – ‘yato kho, bho, ayaṃ attā rūpī cātumahābhūtiko mātāpettikasambhavo kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti.",
      "english": "Here, monks, some ascetic or brahmin holds such a view, such a doctrine: ‘Because, sirs, this self is material, made of the four great elements, born of mother and father, it is annihilated and perishes upon the breaking up of the body, and does not exist after death. To this extent, sirs, this self is completely annihilated.’ In this way, some proclaim the annihilation, destruction, and non-existence of an existing being.",
      "sinhala": "මහණෙනි, මෙහි සමහර ශ්‍රමණ​යෙක් හෝ බ්‍රාහ්මණ​යෙක් හෝ මෙබඳු මතයක් දරයි, මෙසේ කියයි: \"ඇවැත්නි, මේ ආත්මය රූපී ය, සතර මහා භූතයන්ගෙන් සෑදුණකි, මව්පියන්ගෙන් හටගත්තකි. කය බිඳී යාමෙන් සිඳී යයි, විනාශ වී යයි. මරණින් පසු නොපවතී. ඇවැත්නි, මෙපමණකින්ම මේ ආත්මය මැනවින් උච්ඡේද වූයේ යැයි.\" මෙසේ සමහරු පවතින සත්ත්ව​යෙකුගේ උච්ඡේදය, විනාශය හා නැති වී යාම පනවති.",
      "paliTitle": ""
    },
    {
      "number": 86,
      "pali": "‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā dibbo rūpī kāmāvacaro kabaḷīkārāhārabhakkho. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti.",
      "english": "Then another says this: ‘Indeed, friend, there is this self that you speak of; I do not say it does not exist; but indeed, friend, this self is not utterly annihilated by that alone. Indeed, friend, there is another self, divine, material, of the sense-sphere, sustained by solid food. You do not know or see that. I know and see that. Indeed, friend, when that self is annihilated and destroyed upon the body’s breaking up, and does not exist after death, by that alone, friend, this self is utterly annihilated.’ In this way, some declare the annihilation, destruction, and non-existence of an existing being.",
      "sinhala": "තවත් අයෙක් මෙසේ කියයි – ‘ස්වාමීනි, ඔබ පවසන මේ ආත්මය ඇත්තෙන්ම තිබෙනවා, එය නැතැයි මම නොකියමි; නමුත්, ස්වාමීනි, මේ ආත්මය එපමණකින් සම්පූර්ණයෙන් සිඳී යන්නේ නැත. ස්වාමීනි, තවත් ආත්මයක් තිබෙනවා, එය දිව්‍යමය, රූපී, කාමාවචර, කබලීකාර ආහාර භක්ෂණය කරන්නක්. එය ඔබ නොදනිති, නොදකිති. එය මම දනිමි, දකිමි. ස්වාමීනි, ඒ ආත්මය කය බිඳී විසිරී යන කල්හි සිඳී යයි, විනාශ වේ, මරණින් පසු නොපවතී, එපමණකින් මේ ආත්මය සම්පූර්ණයෙන් සිඳී යයි’යි. මෙලෙස සමහරු පවතින සත්වයකුගේ සිඳී යාම, විනාශ වීම, නැති වී යාම පනවති.",
      "paliTitle": ""
    },
    {
      "number": 87,
      "pali": "‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā dibbo rūpī manomayo sabbaṅgapaccaṅgī ahīnindriyo. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti.",
      "english": "Then another one says this: ‘Friend, the self you speak of certainly exists; I do not say that it does not exist. But friend, this self is not utterly annihilated by that much. Friend, there is another self, divine, with form, mind-made, complete with all its parts and limbs, and with perfect faculties. You do not know or see that, but I know and see it. Friend, when that self is cut off and destroyed at the breaking up of the body, and does not exist after death, it is by this much that this self is truly annihilated.’ In this way, some proclaim the cutting off, destruction, and annihilation of an existing being.",
      "sinhala": "තව අයෙක් මෙසේ කියයි: \"භවත්නි, ඔබ කියන ඒ ආත්මය ඇත්තෙන්ම තිබේ. එය නැතැයි මම නොකියමි. එහෙත් භවත්නි, මේ ආත්මය මෙපමණකින් නිසි ලෙස මුලිනුපුටා දමා නැත. භවත්නි, තව ආත්මයක් තිබේ, එය දිව්‍යමය, රූපී, මනෝමය, සියලු අඟපසඟින් යුක්තය, ඉන්ද්‍රියයන් අඩුවකින් තොරය. එය ඔබ නොදනිති, නොදකිති. එය මම දනිමි, දකිමි. භවත්නි, ඒ ආත්මය කය බිඳී විනාශ වූ කල්හි, මරණින් මතු නොපවතී නම්, එවිට භවත්නි, මේ ආත්මය නිසි ලෙස මුලිනුපුටා දැමූවක් වේ යැයි මම කියමි.\" මෙසේ සමහරෙක් පවත්නා සත්ත්වයාගේ උච්ඡේදය, විනාශය, නැතිවීම පනවති.",
      "paliTitle": ""
    },
    {
      "number": 88,
      "pali": "‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘‘ananto ākāso’’ti ākāsānañcāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti.",
      "english": "Then another said thus: ‘Indeed, friend, this self of which you speak exists; I do not say it does not exist. Yet, friend, this self is not completely annihilated by this much. Indeed, friend, there is another self: one who, by entirely transcending perceptions of form, by the disappearance of perceptions of resistance, and by not attending to perceptions of diversity, thinking “infinite space,” has reached the sphere of infinite space. That you do not know or see. That I know and see. Indeed, friend, when that self is annihilated and destroyed upon the breaking up of the body, and does not exist after death, by this much, friend, this self is completely annihilated.’ Thus, some proclaim the annihilation, destruction, and disappearance of an existing being.",
      "sinhala": "තමාට අන්‍යවූවෙක් මෙසේ කියයි – ‘පින්වත්නි, ඔබ කියන යම් ආත්මයක් වේද, ඒ ආත්මය නැතැයි මම නොකියමි; එහෙත්, පින්වත්නි, මේ ආත්මය මෙපමණකින් නිවැරදිව මුලිනුපුටා දමා නැත. පින්වත්නි, සියලු රූප සංඥාවන් මුළුමනින්ම ඉක්මවීමෙන්ද, ගැටීම් සංඥාවන් නැති කිරීමෙන්ද, නානත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්ද “ආකාශය අනන්තයි” යැයි සිතා ආකාශානන්ත්‍යායතනයට පැමිණෙන වෙනත් ආත්මයක් ඇත. එය ඔබ නොදන්නෙහි, නොදක්නෙහි. එය මම දනිමි, දකිමි. පින්වත්නි, කය බිඳී යාමෙන් යම් ආත්මයක් මුලිනුපුටා විනාශ වී යයිද, මරණින් පසු නොපවතීද, මෙපමණකින්, පින්වත්නි, මේ ආත්මය නිවැරදිව මුලිනුපුටා දමනු ලැබේ’යි. මෙසේ සමහරු පවතින සත්ත්වයාගේ උච්ඡේදය, විනාශය, හා භවයන් නැතිවීම ප්‍රකාශ කරති.",
      "paliTitle": ""
    },
    {
      "number": 89,
      "pali": "‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso ākāsānañcāyatanaṃ samatikkamma ‘‘anantaṃ viññāṇa’’nti viññāṇañcāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti.",
      "english": "Another says this: ‘Indeed, friend, there is this self that you speak of; I do not say that it does not exist. However, friend, this self is not fully annihilated merely by this much. Indeed, friend, there is another self that completely transcends the dimension of infinite space and attains the dimension of infinite consciousness by thinking “infinite consciousness.” That you do not know, you do not see. That I know, I see. Indeed, friend, that self, when, at the breaking up of the body, it is annihilated, ceases to exist, and does not exist after death – it is by this much, friend, that this self is fully annihilated.’ Thus, some declare the annihilation, destruction, and non-existence of an existing being.",
      "sinhala": "තවත් සමහරු මෙසේ කීහ: 'භවත්නි, ඔබ කියන මේ ආත්මය ඇත්තෙන්ම පවතී. එය නොපවතින්නේ යැයි මම නොකියමි. එහෙත් භවත්නි, මේ ආත්මය මෙපමණකින් නිසි ලෙස සම්පූර්ණයෙන් සිඳී යන්නේ නැත. භවත්නි, ආකාසානංචායතනය මුළුමනින්ම ඉක්මවා ‘අනන්ත වූ විඤ්ඤාණය’ යැයි සලකා විඤ්ඤාණංචායතනයට පැමිණෙන වෙනත් ආත්මයක් ඇත්තෙන්ම ඇත. ඔබ එය නොදන්නේය, නොදකින්නේය. මම එය දනිමි, දකිමි. භවත්නි, ඒ ආත්මය කයේ බිඳීමෙන් සිඳී විනාශ වී යන්නේද, මරණින් මතු නොපවතින්නේද, මෙපමණකින් මේ ආත්මය නිසි ලෙස සම්පූර්ණයෙන් සිඳී විනාශ වන්නේ යැයි මම කියමි.’\n\nමේ අයුරින් සමහරු පවතින සත්වයකුගේ සිඳීයාම, විනාශවීම, නැතිවීම ප‍්‍රකාශ කරති.",
      "paliTitle": ""
    },
    {
      "number": 90,
      "pali": "‘‘Tamañño evamāha – ‘atthi kho, bho, so attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso viññāṇañcāyatanaṃ samatikkamma ‘‘natthi kiñcī’’ti ākiñcaññāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti.",
      "english": "Then another says this: ‘Sir, that self which you speak of does exist; I do not say it does not exist. But, sir, this self is not completely annihilated merely by that. Sir, there is another self, which, having entirely transcended the sphere of infinite consciousness, reaches the sphere of nothingness [with the thought] \"there is nothing\". That you neither know nor see. That I know and see. Sir, when that self is annihilated and perishes with the breakup of the body, and does not exist after death, by that much, sir, this self is completely annihilated.’ Thus some proclaim the annihilation, destruction, and disappearance of an existing being.",
      "sinhala": "තවද, තවත් අයෙක් මෙසේ කියයි – ‘ඇත්තෙන්ම, ඇවැත්නි, ඔබ කියන ඒ ආත්මය පවතී, එය නැතැයි මම නොකියමි; එහෙත්, ඇවැත්නි, මේ ආත්මය මෙපමණකින් සම්පූර්ණයෙන් ම උච්ඡේදනය වන්නේ නැත. ඇත්තෙන්ම, ඇවැත්නි, විඤ්ඤාණානංචායතනය සම්පූර්ණයෙන්ම ඉක්මවා, “කිසිවක් නැතැ”යි සිතා ආකිංචඤ්ඤායතනයට පැමිණි වෙනත් ආත්මයක් ඇත. ඔබ එය නොදනිති, නොදකිති. මම එය දනිමි, දකිමි. ඇත්තෙන්ම, ඇවැත්නි, ඒ ආත්මය කාය භේදයෙන් උච්ඡේදනය වී, විනාශ වී, මරණින් පසු නොපවතී නම්, මෙපමණකින්, ඇවැත්නි, මේ ආත්මය සම්පූර්ණයෙන් ම උච්ඡේදනය වන්නේය.’ මේ ආකාරයෙන් සමහරු, පවත්නා සත්ත්වයෙකුගේ උච්ඡේදය, විනාශය සහ නැති වී යාම ප්‍රකාශ කරති.",
      "paliTitle": ""
    },
    {
      "number": 91,
      "pali": "‘Tamañño evamāha – ‘‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā sammā samucchinno hoti. Atthi kho, bho, añño attā sabbaso ākiñcaññāyatanaṃ samatikkamma ‘‘santametaṃ paṇītameta’’nti nevasaññānāsaññāyatanūpago. Taṃ tvaṃ na jānāsi na passasi. Tamahaṃ jānāmi passāmi. So kho, bho, attā yato kāyassa bhedā ucchijjati vinassati, na hoti paraṃ maraṇā, ettāvatā kho, bho, ayaṃ attā sammā samucchinno hotī’ti. Ittheke sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti.",
      "english": "Another person says thus: ‘Indeed, sir, that self which you speak of does exist; I do not say it does not exist. But, sir, this self is not utterly annihilated merely by that much. Indeed, sir, there is another self, completely transcending the dimension of nothingness, reaching the dimension of neither perception nor non-perception, thinking, \"This is peaceful, this is sublime.\" You do not know or see that. I know and see that. Indeed, sir, when that self is cut off and perishes upon the breaking up of the body, and does not exist after death, then, sir, this self is utterly annihilated.’ Thus do some declare the utter annihilation, destruction, and non-existence of an existing being.",
      "sinhala": "තව අයෙක් මෙසේ කියයි: \"භවත්නි, ඔබ යම් ආත්මයක් ගැන කියන්නේද, ඒ ආත්මය ඇත්තෙන්ම ඇත; එය නැතැයි මම නොකියමි. එහෙත්, භවත්නි, මේ ආත්මය මෙපමණකින් නිසි ලෙස මුලිනුපුටා දමනු නොලැබේ. භවත්නි, සියලු ආකිංචඤ්ඤායතනය ඉක්මවා, 'මෙය ශාන්තය, මෙය ප්‍ර‍ණීතය' යනුවෙන් නේවසඤ්ඤානාසඤ්ඤායතනයට පැමිණ සිටින තවත් ආත්මයක් ඇත්තෙන්ම ඇත. එය ඔබ නොදන්නෙහි, නොදක්නෙහි. එය මම දනිමි, දකිමි. භවත්නි, යම් හෙයකින් කය බිඳී ගිය කල ඒ ආත්මය සිඳී බිඳී වැනසී යන්නේද, මරණින් පසු නොවන්නේද, භවත්නි, මෙපමණකින් මේ ආත්මය නිසි ලෙස මුලිනුපුටා දමනු ලැබේ' යැයි. මේ අයුරින් සමහරු පවතින සත්වයාගේ උච්ඡේදය, විනාශය, විභවය පෙන්වා දෙති.",
      "paliTitle": ""
    },
    {
      "number": 92,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti, sabbe te imeheva sattahi vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. ",
      "english": "Monks, by these seven grounds, those ascetics and brahmins who are annihilationists declare the annihilation, destruction, and disappearance of an existing being. Whatever ascetics or brahmins, Monks, who, as annihilationists, declare the annihilation, destruction, and disappearance of an existing being—all of them declare it by these very seven grounds, and by no other means. It is by understanding these matters that one would rightly speak a factual description of the Tathāgata.",
      "sinhala": "භික්ෂූන් වහන්ස, උච්ඡේදවාදී වන ඒ ශ්‍රම​ණ බ්‍රාහ්ම​ණවරු සත්ත්වයාගේ උච්ඡේදය, විනාශය සහ විභවය යන මේ සත් වස්තූන්ගෙන් ප්‍ර​කාශ කරති. භික්ෂූන් වහන්ස, යම් කිසි ශ්‍රම​ණයෝ හෝ බ්‍රාහ්ම​ණයෝ හෝ උච්ඡේදවාදීව සත්ත්වයාගේ උච්ඡේදය, විනාශය සහ විභවය ප්‍ර​කාශ කරත් ද, ඒ සියලු දෙනාම මේ සත් වස්තූන්ගෙන්ම ප්‍ර​කාශ කරති, අන් කිසිවකින් නොවේ. යම් මගකින් තථාගතයන් වහන්සේගේ යථාභූත වර්ණනාව නිවැරැදිව ප්‍ර​කාශ කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 93,
      "pali": "‘‘Santi, bhikkhave, eke samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi. Te ca bhonto samaṇabrāhmaṇā kimāgamma kimārabbha diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi?",
      "english": "Monks, there are some ascetics and brahmins who advocate for Nibbāna in this very life, and they proclaim a supreme Nibbāna in this very life for an existing being by means of five bases. And on what grounds, or with what as their starting point, do these venerable ascetics and brahmins—who advocate for Nibbāna in this very life—proclaim a supreme Nibbāna in this very life for an existing being by means of five bases?",
      "sinhala": "මහණෙනි, ඇතැම් ශ්‍රමණ-බ්‍රාහ්මණයෝ සවිඥාණක සත්වයකුට කරුණු පහකින් පරම වූ දිට්ඨධම්මනිබ්බානය ප්‍රඥප්ත කරති. ඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයෝ කුමක් අරභයා, කුමක් මුල්කොටගෙන, සවිඥාණක සත්වයකුට කරුණු පහකින් පරම වූ දිට්ඨධම්මනිබ්බානය ප්‍රඥප්ත කරත් ද?",
      "paliTitle": "Diṭṭhadhammanibbānavādo",
      "englishTitle": "Doctrine of Nibbana in this life",
      "sinhalaTitle": "මේ ජීවිතයෙහි නිවන වාදය"
    },
    {
      "number": 94,
      "pali": "‘‘Idha, bhikkhave, ekacco samaṇo vā brāhmaṇo vā evaṃvādī hoti evaṃdiṭṭhi – ‘‘yato kho, bho, ayaṃ attā pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti.",
      "english": "Here, monks, some ascetic or brahmin holds such a view and proclaims such a doctrine: ‘Friends, when this self is fully endowed with, completely united with, and enjoying the five strands of sensual pleasure, then to that extent, friends, this self has attained the supreme Nibbana visible in this very life.’ In this way, some declare the supreme Nibbana visible in this very life for an existing being.",
      "sinhala": "මහණෙනි, මෙලොව ඇතැම් ශ්‍ර‍මණයෙක් හෝ බ්‍රාහ්මණයෙක් හෝ මෙබඳු වාද ඇත්තේ, මෙබඳු දෘෂ්ටි ඇත්තේ වෙයි – “යහළුවනි, යම් හෙයකින් මේ ආත්මය පංච කාම ගුණයන්ගෙන් සමන්විත වී, එකඟ වී පරිහරණය කරයි ද, එපමණකින්ම, යහළුවනි, මේ ආත්මය පරම වූ දිට්ඨධම්ම නිර්වාණයට පත්වන්නේය” කියා. සමහරු පවතින සත්වයාට මෙසේ පරම වූ දිට්ඨධම්ම නිර්වාණය පනවති.",
      "paliTitle": ""
    },
    {
      "number": 95,
      "pali": "‘‘Tamañño evamāha –‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Kāmā hi, bho, aniccā dukkhā vipariṇāmadhammā, tesaṃ vipariṇāmaññathābhāvā uppajjanti sokaparidevadukkhadomanassupāyāsā. Yato kho, bho, ayaṃ attā vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti.",
      "english": "Then another says this: 'Indeed, friend, there is that self which you speak of; I do not say that it doesn't exist. But indeed, friend, this self, merely by existing, does not attain the ultimate Nibbāna in this very life. What is the reason for that? For sense pleasures, friend, are impermanent, unsatisfactory, and subject to change; from their change and alteration arise sorrow, lamentation, pain, displeasure, and despair. But when, friend, this self, having quite detached from sense pleasures, having detached from unwholesome states, enters upon and abides in the first jhāna, which is accompanied by applied thought and sustained thought, born of detachment, filled with joy and pleasure—by this much, friend, this self attains the ultimate Nibbāna in this very life.' In this way, some declare the ultimate Nibbāna in this very life for an existing being.",
      "sinhala": "එවිට තවත් අයෙක් මෙසේ පවසයි: ‘භවත්නි, ඔබ කියන මේ ආත්මයක් තිබේ. එය නැතැයි මම නොකියමි; එහෙත්, භවත්නි, මේ ආත්මය මෙපමණකින් පරම දිට්ඨධම්ම නිබ්බාණයට පැමිණෙන්නේ නැත. එයට හේතුව කුමක්ද? භවත්නි, කාමයන් අනිත්‍යය, දුක්ඛය, විපරිණාම ධර්‍මයෝය. ඒවායේ විපරිණාමය හා වෙනස්වීම නිසා ශෝක, පරිදේව, දුක්ඛ, දෝමනස්ස, උපායාස ඇතිවෙති. එහෙත්, භවත්නි, යම් හෙයකින් මේ ආත්මය කාමයන්ගෙන් වෙන්වම, අකුසල ධර්‍මයන්ගෙන් වෙන්ව, විතර්ක සහිත වූද, විචාර සහිත වූද, විවේකයෙන් හටගත් ප්‍රීති-සැප ඇති වූද පළමු ධ්‍යානය උපසම්පදා කොට වාසය කරයිද, එවිට, භවත්නි, මේ ආත්මය පරම දිට්ඨධම්ම නිබ්බාණයට පැමිණෙන්නේය’යි කියා. මෙසේ සමහරෙක් සිටින සත්වයාට පරම දිට්ඨධම්ම නිබ්බාණය පනවති.",
      "paliTitle": ""
    },
    {
      "number": 96,
      "pali": "‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha vitakkitaṃ vicāritaṃ, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti.",
      "english": "Another says this: ‘Friend, that self you speak of truly exists; I do not say it does not exist. But, friend, this self has not attained the supreme Nibbāna here and now merely by this.’\n\n‘What is the reason for this? Whatever initial thought and sustained thought is present there, by this it is considered coarse.’\n\n‘But when, friend, this self, with the complete subsiding of initial thought and sustained thought, with inner tranquility, unification of mind, without initial thought and sustained thought, enters and dwells in the second jhāna, which has rapture and happiness born of concentration—then, friend, this self has attained the supreme Nibbāna here and now.’\n\nThus some declare the supreme Nibbāna here and now for an existing being.",
      "sinhala": "එක්තරා කෙනෙක් මෙසේ පැවසුවේය: ‘මිත්‍රය, ඔබ කතා කරන මේ ආත්මය ඇත්තෙන්ම තිබේ; මම එය නැතැයි නොකියමි. එහෙත්, මිත්‍රය, මේ ආත්මය මෙපමණකින් පරම දිට්ඨධම්ම නිර්වාණයට පත්වී නොමැත. එයට හේතුව කුමක්ද? එහි යම් විතර්කයක් හා විචාරයක් ඇත්ද, මෙයින් එය දළ යැයි කියනු ලැබේ. මිත්‍රය, යම් කලක මේ ආත්මය විතර්ක හා විචාරයන්ගේ සංසිඳීමෙන්, අධ්‍යාත්මික ප‍්‍රසාදයත්, චිත්ත ඒකාග‍්‍රතාවත් ඇති, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් උපන් ප‍්‍රීතිය හා සැපය ඇති දෙවැනි ධ්‍යානයට එළඹ වාසය කරයිද, එවිට, මිත්‍රය, මේ ආත්මය පරම දිට්ඨධම්ම නිර්වාණයට පත්වී ඇතැයි.’ මෙසේ සමහරු පවතින සත්වයකුට පරම දිට්ඨධම්ම නිර්වාණය පනවති.",
      "paliTitle": ""
    },
    {
      "number": 97,
      "pali": "‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha pītigataṃ cetaso uppilāvitattaṃ, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā pītiyā ca virāgā upekkhako ca viharati, sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti ‘‘upekkhako satimā sukhavihārī’’ti, tatiyaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti.",
      "english": "Another says this: ‘Sir, there is indeed that self you speak of; I do not say it does not exist. But sir, this self does not attain the supreme Nibbāna visible here and now merely by this. For what reason? Whatever elation and exaltation of mind is there, by this it is called coarse. But sir, when this self, with the fading of rapture, dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body – which the noble ones declare as ‘equanimous, mindful, dwelling in ease’ – and enters and dwells in the third jhana, it is by this, sir, that this self attains the supreme Nibbāna visible here and now.’ Thus, some declare the supreme Nibbāna visible here and now for an existing being.",
      "sinhala": "තවත් අයෙක් මෙසේ කියයි: ‘භවත්නි, ඔබ කියන ඒ ආත්මය ඇත්තේමය. එය නැතැයි මම නොකියමි. එහෙත්, භවත්නි, මේ ආත්මය මෙපමණකින්ම පරම දිට්ඨධම්ම නිර්වාණයට පත්වන්නේ නැත. එයට හේතුව කුමක්ද? යම් හෙයකින් එහි චිත්තයාගේ ප්‍රීතියෙන් ඉපිලී යෑමක් ඇත්ද, මේ නිසා එය ඔළාරික (ස්ථූල) යැයි කියනු ලැබේ. නමුත්, භවත්නි, යම් කලක මේ ආත්මය ප්‍රීතියෙන් වෙන්ව උපේක්ෂාවෙන් වාසය කරන්නේද, සිහි කල්පනාවෙන් යුක්තව ශරීරයෙන් සැප විඳින්නේ ද, යමක් ‘උපේක්ෂාවෙන් යුක්තව සිහි ඇතිව සැප විහරණය කරන්නා’ යැයි ආර්යයෝ පවසත්ද, ඒ තෙවන ධ්‍යානයට පැමිණ වාසය කරන්නේද, මෙපමණකින්ම, භවත්නි, මේ ආත්මය පරම දිට්ඨධම්ම නිර්වාණයට පත්වන්නේය’යි. සමහරු මේ ආකාරයෙන්, පවතින සත්ත්වයෙකුගේ පරම දිට්ඨධම්ම නිර්වාණය පනවති.",
      "paliTitle": ""
    },
    {
      "number": 98,
      "pali": "‘‘Tamañño evamāha – ‘atthi kho, bho, eso attā, yaṃ tvaṃ vadesi, neso natthīti vadāmi; no ca kho, bho, ayaṃ attā ettāvatā paramadiṭṭhadhammanibbānaṃ patto hoti. Taṃ kissa hetu? Yadeva tattha sukhamiti cetaso ābhogo, etenetaṃ oḷārikaṃ akkhāyati. Yato kho, bho, ayaṃ attā sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati, ettāvatā kho, bho, ayaṃ attā paramadiṭṭhadhammanibbānaṃ patto hotī’ti. Ittheke sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti.",
      "english": "Then another said this: ‘Indeed, friend, there is this self of which you speak; I do not say it does not exist. However, friend, this self does not thereby attain the ultimate Nibbāna experienced in this very life. What is the reason for that? Because whatever focus of mind there is on ‘happiness’ in that state, by that, it is declared coarse. But, friend, when this self, having abandoned pleasure and having abandoned pain, and with the prior disappearance of joy and sorrow, enters and dwells in the fourth jhana, which is beyond pleasure and pain, purified by equanimity and mindfulness, only then does this self attain the ultimate Nibbāna experienced in this very life.’ In this way, some define the ultimate Nibbāna experienced in this very life for an existing being.",
      "sinhala": "ඔහුට අන්‍යයෙක් මෙසේ කීවේය: 'ඇවැත්නි, ඔබ කියන ඒ ආත්මය ඇත, එය නැතැයි මම නොකියමි; එහෙත් ඇවැත්නි, මේ ආත්මය මේ පමණකින් පරම දිට්ඨධම්ම නිර්වාණයට පත්වූවක් නොවේ. ඊට හේතුව කුමක්ද? යම් තාක් කල් එහි 'මෙය සැපයි' යනුවෙන් සිතේ විතර්කයක් වේද, ඒ නිසා එය රළු යැයි කියනු ලැබේ. ඇවැත්නි, යම් හෙයකින් මේ ආත්මය සැපයද දුකයද ප්‍ර​හාණය කිරීමෙන්, පෙර සිටි සෝමනස්ස-දෝමනස්සයන්ගේ අස්තංගමනය නිසා, දුක් රහිත වූද සැප රහිත වූද, උපේක්ෂාවෙන් හා ස්මෘතියෙන් පිරිසිදු වූ සිව්වෙනි ධ්‍යානයට එළඹ වාසය කරන්නේද, ඇවැත්නි, මේ පමණකින් මේ ආත්මය පරම දිට්ඨධම්ම නිර්වාණයට පත්වූවක් වන්නේය.’යි. සමහරෙක් මෙලෙස පවත්නා සත්වයාට පරම දිට්ඨධම්ම නිර්වාණය පනවති.",
      "paliTitle": ""
    },
    {
      "number": 99,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti, sabbe te imeheva pañcahi vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ.",
      "english": "Monks, these ascetics and brahmins who teach Nibbāna in this very life proclaim the supreme Nibbāna in this very life for an existing being by means of these five factors. Whatever ascetics or brahmins, monks, who teach Nibbāna in this very life for an existing being proclaim the supreme Nibbāna in this very life—all of them do so by these same five factors, and by no others. It is by means of such qualities that one, speaking rightly, would truly declare the praise of the Tathāgata.",
      "sinhala": "භික්ෂූණි, දිට්ඨධම්මනිබ්බානවාදී වූ ශ්‍රමණ-බ්‍රාහ්මණවරු සිහි ඇති සත්ත්වයෙකුට පරම දිට්ඨධම්මනිබ්බානය ප්‍රඥප්ත කරන්නේ මේ කරුණු පහෙනි. භික්ෂූණි, යම්කිසි ශ්‍රමණ හෝ බ්‍රාහ්මණ කෙනෙක් දිට්ඨධම්මනිබ්බානවාදීව සිහි ඇති සත්ත්වයෙකුට පරම දිට්ඨධම්මනිබ්බානය ප්‍රඥප්ත කරත්ද, ඒ සියල්ලෝම මේ කරුණු පහෙන්ම එය ප්‍රඥප්ත කරති; මේ කරුණු හැර වෙනත් කිසිවකින් එය ප්‍රඥප්ත නොකරති. එමෙන්ම මේ කරුණු හේතුවෙන්ම තථාගතයන් වහන්සේගේ යථාභූත වර්ණනාව නිවැරදිව ප්‍රකාශ කළ හැකිවේ.",
      "paliTitle": ""
    },
    {
      "number": 100,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi. Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva catucattārīsāya vatthūhi…pe… yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ.",
      "english": "Indeed, O bhikkhus, these ascetics and brahmins who speculate about the future, who hold views dependent on the future, proclaim various kinds of speculative doctrines concerning the future, by means of forty-four standpoints. Whatever ascetics or brahmins, O bhikkhus, who speculate about the future, who hold views dependent on the future, proclaim various kinds of speculative doctrines concerning the future, all of them do so by means of these forty-four standpoints, and there is no other way apart from these forty-four standpoints. The Tathāgata understands these standpoints of views, how they are grasped, how they are expressed, their destination, and their future destiny. He understands this, and its cause, and what is higher and more excellent than this. He truly knows the view, and its cause, and what is higher and more excellent than this, by means of which one would rightly and truly speak the praise of the Tathāgata.",
      "sinhala": "මහණෙනි, අනාගතය පිළිබඳව කල්පනා කරන්නාවූ, අනාගතය අරභයා නොයෙක් දෘෂ්ටි ඇත්තාවූ, මේ ශ්‍රමණ බ්‍රාහ්මණයෝ සතළිස් සතරක් කරුණු වලින් නොයෙක් ආකාර වූ දෘඪ නිගමන ප්‍රකාශ කරති.\n\nමහණෙනි, අනාගතය පිළිබඳව කල්පනා කරන්නාවූ, අනාගතය අරභයා නොයෙක් දෘෂ්ටි ඇත්තාවූ, යම්කිසි ශ්‍රමණ බ්‍රාහ්මණයෝ නොයෙක් ආකාර වූ දෘඪ නිගමන ප්‍රකාශ කරත්ද, ඒ සියලු දෙනාම මේ සතළිස් සතරක් කරුණු වලින්ම එම දෘඪ නිගමන ප්‍රකාශ කරති. මේ සතළිස් සතරට පිටතින් අන් කිසිවකින් නොවෙති. මේ සතළිස් සතර තුළම වෙති. තථාගතයාණන් වහන්සේගේ යථාභූත වූ ගුණ සමූහය නිවැරදිව පවසන්නාහු පවසන්නේ මේ කරුණු සමූහයෙනි.",
      "paliTitle": ""
    },
    {
      "number": 101,
      "pali": "‘‘Imehi kho te, bhikkhave, samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi.",
      "english": "Indeed, bhikkhus, these ascetics and brahmins—who are speculators about the past, and speculators about the future, and speculators about both the past and the future, and who adhere to views concerning the past and the future—proclaim various kinds of dogmatic assertions concerning the past and the future, based on sixty-two grounds.",
      "sinhala": "මහණෙනි, මේ ශ්‍ර‌මණබ්‍රාහ්මණයෝ, පූර්වන්තය කල්පනා කරන්නෝ ද, අපරන්තය කල්පනා කරන්නෝ ද, පූර්වාපරන්තය කල්පනා කරන්නෝ ද, පූර්වාපරන්ත දෘෂ්ටි ඇත්තෝ ද, පූර්වාපරන්තය අරභයා අනේකවිධ වූ අධිමුක්ති පදයන් දෙපණස් වස්තූන් මූලික කරගෙන ප්‍ර‌කාශ කරති.",
      "paliTitle": ""
    },
    {
      "number": 102,
      "pali": "‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi, etesaṃ vā aññatarena; natthi ito bahiddhā.",
      "english": "Whatever recluses or brahmins, bhikkhus, who speculate about the past, or who speculate about the future, or who speculate about both the past and the future, who hold views concerning both the past and the future, and who assert various kinds of speculative doctrines concerning the past and the future—all of them assert these sixty-two bases, or one of these; there is nothing apart from them.",
      "sinhala": "මහණෙනි, යම් කිසි ශ්‍ර‍මණයෝ හෝ බ්‍රාහ්මණයෝ වෙත් ද, ඔවුහු පූර්වන්ත කල්පිකයෝ හෝ අපරන්ත කල්පිකයෝ හෝ පූර්වන්තාපරන්ත කල්පිකයෝ නම් වෙත් ද, පූර්වන්තයත් අපරන්තයත් පිළිබඳව දෘෂ්ටි අනුගමනය කරන්නෝ වෙත් ද, පූර්වන්තයත් අපරන්තයත් අරමුණු කොට නොයෙක් ආකාරයේ අධිමුක්ති පද ප්‍ර‍කාශ කරත් ද, ඒ සියලු දෙනාම මේ දෙපන්සැටක් වූ වස්තූන්ගෙන්ම හෝ ඒ අතුරින් එකකින්ම ප්‍ර‍කාශ කරති. මෙයින් බැහැර කිසිවක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 103,
      "pali": "‘‘Tayidaṃ, bhikkhave, tathāgato pajānāti – ‘ime diṭṭhiṭṭhānā evaṃgahitā evaṃparāmaṭṭhā evaṃgatikā bhavanti evaṃabhisamparāyā’ti. Tañca tathāgato pajānāti, tato ca uttaritaraṃ pajānāti, tañca pajānanaṃ na parāmasati, aparāmasato cassa paccattaññeva nibbuti viditā. Vedanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ viditvā anupādāvimutto, bhikkhave, tathāgato.",
      "english": "And this, monks, the Tathāgata fully comprehends: ‘These viewpoints, thus adopted, thus clung to, thus lead to such a destiny, thus lead to such a future state.’ And that the Tathāgata fully comprehends, and beyond that he fully comprehends even further, yet he does not cling to that very comprehension. For him, unattached, liberation is known personally. Having known as it actually is the origin and the disappearance, the gratification, the danger, and the escape in regard to feelings, the Tathāgata, monks, is liberated without clinging.",
      "sinhala": "එය, මහණෙනි, තථාගතයන් වහන්සේ දනිති – ‘මේ දෘෂ්ටිස්ථාන මෙලෙස ග්‍රහණය කරගත් කල්හි, මෙලෙස දැඩිව අල්ලාගත් කල්හි, මෙවැනි ගතියකට පත්වන බවත්, මෙවැනි පරලෝකයක් ඇතිවන බවත්’ යනුවෙන්. තථාගතයන් වහන්සේ එයද දනිති, ඊට වඩා උසස් දෙයක්ද දනිති, තවද ඒ දැනගැනීම දැඩිව අල්ලා නොගනිති. එලෙස දැඩිව අල්ලා නොගන්නා හෙයින් උන්වහන්සේට පුද්ගලිකවම නිවන අවබෝධ වී ඇත. මහණෙනි, තථාගතයන් වහන්සේ වේදනාවන්ගේ හටගැනීමත්, නැතිවීමත්, ආශ්වාදයත්, ආදීනවයත්, නිස්සරණයත්, ඇති සැටියෙන් අවබෝධ කරගෙන, කිසිවක් දැඩිව අල්ලා නොගැනීමෙන් විමුක්ත වූ සේක.",
      "paliTitle": ""
    },
    {
      "number": 104,
      "pali": "‘‘Ime kho te, bhikkhave, dhammā gambhīrā duddasā duranubodhā santā paṇītā atakkāvacarā nipuṇā paṇḍitavedanīyā, ye tathāgato sayaṃ abhiññā sacchikatvā pavedeti, yehi tathāgatassa yathābhuccaṃ vaṇṇaṃ sammā vadamānā vadeyyuṃ. ",
      "english": "These, monks, are those teachings that are profound, difficult to perceive, difficult to comprehend, peaceful, sublime, beyond the sphere of logic, subtle, and discernible by the wise. These are the teachings that the Tathagata, having directly known and realized for himself, proclaims, and by which those who speak rightly would truly praise the Tathagata.",
      "sinhala": "මහණෙනි, තථාගතයන් වහන්සේ යම් ධර්මයන් තමන් වහන්සේ විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කරගෙන සාක්ෂාත් කොට ප්u200dරකාශ කළ සේක්ද, යම් ධර්මයන් තුළින් තථාගතයන් වහන්සේගේ යථාර්ථ වූ ගුණ ප්u200dරශංසාව නිවැරදිව ප්u200dරකාශ කරන්නේ නම්, ප්u200dරකාශ කළ හැකිවේ, මේ ඒ ගැඹුරු වූ, දැකීමට අපහසු වූ, අවබෝධ කරගැනීමට අපහසු වූ, සන්සුන් වූ, ප්u200dරණීත වූ, තර්ක ගෝචර නොවන, සියුම් වූ, ප්u200dරඥාවන්තයන් විසින්ම අවබෝධ කළ යුතු ධර්මයන් වෙති.",
      "paliTitle": ""
    },
    {
      "number": 105,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "There, monks, concerning those recluses and brahmins who are eternalists, who declare the self and the world to be eternal on four grounds—even that is an experience for those venerable recluses and brahmins who do not know and do not see; it is merely the agitation and vacillation of those caught up in craving.",
      "sinhala": "එහිදී, මහණෙනි, යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ සදාකාලිකවාදීව, සතර කරුණකින් ආත්මය සහ ලෝකය සදාකාලික යැයි ප්‍රකාශ කරත්ද, එයද, නොදන්නා, නොදකින, තණ්හාවට පත් වූ, ඒ භවත් ශ්‍රමණ බ්‍රාහ්මණයන්ගේ තැති ගැනීමක් හා දඟලෑමක්ම වන වේදනාවක්ම වන්නේය.",
      "paliTitle": "Paritassitavipphanditavāro",
      "englishTitle": "Agitation and Struggle Chapter",
      "sinhalaTitle": "තැතිගැනීම හා දඟලන වාරය"
    },
    {
      "number": 106,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "Here, monks, those recluses and brahmins who, based on four grounds, declare the self and the world to be partly eternal and partly non-eternal—even that, for those venerable recluses and brahmins who do not truly know and do not truly see, is merely an experience rooted in craving, nothing but agitation and fluctuation.",
      "sinhala": "මහණෙනි, එහිලා, ආත්මය හා ලෝකය සම්බන්ධයෙන් ඇතැම් දෙයක් ශාශ්වතයයිද, ඇතැම් දෙයක් අශාශ්වතයයිද කියා කරුණු සතරකින් පනවන්නා වූ යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ වෙත්ද, නොදන්නා වූ, නොදක්නා වූ, තණ්හාවට හසු වූ ඒ භවත් ශ්‍රමණබ්‍රාහ්මණයන්ගේ අත්දැකීම එයද දැඟලීමක් හා කැළඹීමක්ම වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 107,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "There, monks, those ascetics and brahmins who are speculators on the world’s finitude and infinitude, declaring the world to be finite or infinite on four grounds—that, too, for those venerable ascetics and brahmins who neither know nor see, is an experience rooted in craving, merely agitation and vacillation.",
      "sinhala": "මහණෙනි, යම් ඒ ශ්‍ර‍මණ බ්‍රාහ්මණයෝ අන්ත-අනන්තිකවාදීව සතර කරුණකින් ලෝකය අන්තය ද අනන්තය ද වශයෙන් ප්‍ර‍ඥප්ත කරත් ද, එය ද ඒ නොදන්නා වූ, නොදක්නා වූ, තෘෂ්ණාවට බැඳී ගිය භවත් ශ්‍ර‍මණ බ්‍රාහ්මණයන්ගේ වේදනාත්මක වූ, කලබල වීමක් සහ දඟලෑමක් පමණි.",
      "paliTitle": ""
    },
    {
      "number": 108,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "Regarding this, monks, those recluses and brahmins who are eel-wrigglers, when asked questions about various points, engage in verbal equivocation, in eel-wriggling, on four grounds. Even that experience of those venerable recluses and brahmins, who do not know and do not see, is nothing but a writhing and squirming agitation rooted in craving.",
      "sinhala": "මහණෙනි, එහිලා යම් ඒ අමරාවික්ඛේපික ශ්‍රමණබ්‍රාහ්මණයෝ ඒ ඒ කරුණු ගැන ප්‍රශ්න අසන ලදුව, කරුණු සතරකින් අමරාවික්ඛේපය නම් වූ වචන පැටලවීම ඇති කරගනිත්ද, නොදන්නා වූ ද, නොදක්නා වූ ද, තෘෂ්ණාවට ගිය වූ ද, ඒ භවත් ශ්‍රමණබ්‍රාහ්මණයන්ගේ ඒ වේදයිතය, වෙව්ලීමක් හා දඟලීමක්ම වේ.",
      "paliTitle": ""
    },
    {
      "number": 109,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "Monks, in this regard, those ascetics and brahmins who are accidentalists, declaring that the self and the world arise by chance on two grounds, even that, for those revered ascetics and brahmins who do not know and do not see, is merely an experience of trembling and agitation, born of craving.",
      "sinhala": "භික්ෂූණි, එහි යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ අධිච්චසමුප්පන්නවාදීහු වෙත්ද, ඔවුහු කරුණු දෙකකින් අධිච්චසමුප්පන්න (හේතු රහිතව අහම්බෙන් හටගත්) ආත්මයද, ලෝකයද ප්‍රකාශ කරත්ද, එයද, ඒ භවත් ශ්‍රමණබ්‍රාහ්මණයන්ගේ නොදන්නා වූද, නොදකිනා වූද (ඔවුන්ගේම) අත්දැකීමක් වන, තණ්හාවට ග්‍රස්ත වූවන්ගේ හුදු දැවිල්ලක් හා විතැවීමක්ම වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 110,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "In this regard, monks, those ascetics and brahmins who, speculating about the past and holding various views concerning the past, proclaim diverse doctrines of their own conviction through eighteen bases—even that, for those venerable ascetics and brahmins, who are gripped by craving, who do not know and do not see, is merely a feeling, a trembling, and a struggling.",
      "sinhala": "එහිදී, මහණෙනි, අතීතය කෙරෙහි කල්පනා කරන්නා වූ ද, අතීතය අනු දැක්මෙන් යුතු වූ ද, අතීතය අරභයා අටළොස් වස්තූන්ගෙන් නොයෙක් අයුරින් අධිමුක්ති පද ප්‍රකාශ කරන්නා වූ යම් ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ වෙත් ද, ඒ සියල්ල ද ඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයන්ගේ නොදන්නා වූ, නොදකිනා වූ, තණ්හාවෙන් යුක්ත වූවන්ගේ තැතිගැනීමක් හා දැගලීමක් ම වූ වේදනා විශේෂයක් ම යි.",
      "paliTitle": ""
    },
    {
      "number": 111,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "Monks, in this regard, those ascetics and brahmins who are proponents of the doctrine of a percipient self existing after death, who describe a percipient self existing after death in sixteen ways—even that understanding of theirs, which belongs to those venerable ascetics and brahmins who neither know nor see and are caught up in craving, is merely agitation and wavering.",
      "sinhala": "එහිදී, මහණෙනි, යම් ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ ඌර්ධ්වආඝාතනික සංඥාවාදයෙන් යුක්තව, මරණින් මතු සංඥා සහිත ආත්මයක් දහසය ආකාරයකින් ප්‍ර‌කාශ කරත්ද, ඒ සියල්ලද, නොදන්නා වූත්, නොදකින වූත්, තෘෂ්ණාවට ගිය ඒ භවත් ශ්‍ර‌මණ-බ්‍රාහ්මණයන්ගේ, දැඩි ලෙස තැවෙනසුලු වූත්, දඟලනසුලු වූත් වේදනාවක්ම වේ.",
      "paliTitle": ""
    },
    {
      "number": 112,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "There, monks, those ascetics and brahmins who are proponents of the annihilation of an unconscious self, and who describe an unconscious self as annihilated in eight ways—even that, for those reverend ascetics and brahmins who do not know and do not see, is merely a feeling, a trembling, and a throbbing born of craving.",
      "sinhala": "භික්ෂූනි, එහි යම් ඒ ශ්‍ර‍මණ-බ්‍රාහ්මණයෝ මරණින් මතු අසංඥී ආත්මයක උච්‍ඡේදය දේශනා කරන, අසංඥීවාදීන් වන අතර, අටක් කරුණු වලින් අසංඥී වූ ආත්මයක් උච්‍ඡේද වන බව පවසත්ද, එයද ඒ භවත් ශ්‍ර‍මණ-බ්‍රාහ්මණයන්ට, නොදන්නා වූ, නොදකිනා වූ, වේදනා කෙරෙහි තණ්හාවෙන් යුක්‍ත වූවන්ට, හුදු කම්පා වීමක් හා කැළඹීමක්ම වේ.",
      "paliTitle": ""
    },
    {
      "number": 113,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "There, monks, those recluses and brahmins who advocate the doctrine of neither-perception-nor-non-perception as a higher state, and who describe a self in that higher state as neither-percipient-nor-non-percipient, based on eight grounds — even that is an experience of those venerable recluses and brahmins who do not know and do not see. It is merely agitation and struggling, born of craving.",
      "sinhala": "භික්ෂූණි, එහිදී යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ උද්ධමාඝාතනික නේවසඤ්ඤානාසඤ්ඤීවාදයට අයත් වූවෝ, ආත්මය කරුණු අටකින් උද්ධමාඝාතනික නේවසඤ්ඤානාසඤ්ඤී තත්ත්වයකට පත්වන බව ප්‍රකාශ කරත්ද, එයද ඒ භවත් ශ්‍රමණ බ්‍රාහ්මණයන්ගේ නොදන්නා, නොදකින, තෘෂ්ණාවට බැඳුණු, වෙහෙසීමෙන් හා දඟලීමෙන් ඇති වූ වේදනාවක්ම වේ.",
      "paliTitle": ""
    },
    {
      "number": 114,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "In this regard, monks, those recluses and brahmins who are annihilationists, proclaiming the cutting off, destruction, and annihilation of an existing being on seven grounds—even that, for those venerable recluses and brahmins who neither know nor see, is merely a feeling arising from being consumed by craving, just a trembling and agitation.",
      "sinhala": "මහණෙනි, එහිදී, යම් ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ උච්ඡේදවාදීහු වෙත්ද, පවතින සත්ත්වයාගේ උච්ඡේදය, විනාශය, විභවය යන මේවා සත් ආකාරයකින් ප්‍රඥප්ත කරත්ද, එයද ඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයන්ගේ, නොදන්නා වූ, නොදකිනා වූ, තණ්හාවට ගිය අයගේ, වේදනාත්මක වූ කලබල වීමක් හා දඟලෑමක්ම වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 115,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "Therein, monks, as to those recluses and brahmins who are proponents of Nibbana in this very life, and who declare ultimate Nibbana in this very life for an existing being based on five grounds: even that, for those venerable recluses and brahmins who do not know, who do not see, and who are caught up in craving, is merely a feeling of struggle and restless agitation.",
      "sinhala": "එහි, මහණෙනි, යම් ඒ ශ්‍ර‍මණ-බ්‍රා‍හ්මණයෝ සත් වූ සත්වයාට පස් වැදෑරුම් වස්තූන්ගෙන් පරම දිට්ඨධම්ම නිබ්බාණය පනවති ද, එය ද නොදන්නා, නොදකින, තණ්හාගත වූ ඒ භවත් ශ්‍ර‍මණ-බ්‍රා‍හ්මණයන්ගේ වේදයිතය පරිත්‍රා‍සය හා විප්‍ර‍ස්පන්දනයම වේ.",
      "paliTitle": ""
    },
    {
      "number": 116,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva.",
      "english": "There, monks, those recluses and brahmins who speculate about the future, who hold views concerning the future, and who declare various kinds of speculative doctrines concerning the future by way of forty-four grounds—even that is merely the feeling, the agitation, and the floundering of those good recluses and brahmins who do not know, who do not see, and who are caught in craving.",
      "sinhala": "එහි මහණෙනි, යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ අනාගතය අරභයා කල්පනා කරන්නෝ ද, අනාගතය පිළිබඳ දෘෂ්ටීන් ඇත්තෝ ද, සූසාලිස් වස්තූන්ගෙන් අනාගතය අරභයා නොයෙක් ආකාර වූ අදහස් ප්‍රකාශ කරත් ද, ඒ ද ඒ භවත් ශ්‍රමණබ්‍රාහ්මණයන්ගේ නොදන්නා වූ, නොදකිනා වූ අත්දැකීම, තණ්හාවට හසු වූවන්ගේ තැවීමක් හා දඟලීමක්ම වේ.",
      "paliTitle": ""
    },
    {
      "number": 117,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, tadapi tesaṃ bhavataṃ samaṇabrāhmaṇānaṃ ajānataṃ apassataṃ vedayitaṃ taṇhāgatānaṃ paritassitavipphanditameva. ",
      "english": "Monks, in this regard, those ascetics and brahmins who speculate about the past, and who speculate about the future, and who speculate about both the past and the future; who hold views rooted in the past and the future; and who declare various dogmatic assertions concerning the past and the future, based on sixty-two points—that, too, for those venerable ascetics and brahmins who do not know and do not see, is merely an experience of agitation, trembling, and struggling, for those gripped by craving.",
      "sinhala": "මහණෙනි, එහිදී යම් ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ පූර්ව අන්තය (අතීතය) ගැන කල්පනා කරන්නෝ ද, අපර අන්තය (අනාගතය) ගැන කල්පනා කරන්නෝ ද, පූර්ව අන්තය හා අපර අන්තය යන දෙක ගැන ම කල්පනා කරන්නෝ ද, පූර්ව අන්තය හා අපර අන්තය පිළිබඳ දෘෂ්ටි ඇත්තෝ ද, පූර්ව අන්තය හා අපර අන්තය මුල් කරගෙන, සැට දෙකක් (62) වූ කරුණු ආශ්‍රයෙන් නොයෙක් ආකාර වූ අනුමති කරන දෘෂ්ටි ප්‍රකාශ කරත් ද; ඒ (ඔවුන් ප්‍රකාශ කරන) කරුණු පවා, නොදන්නා වූ ද, නොදක්නා වූ ද ඒ භවත් ශ්‍රමණ-බ්‍රාහ්මණයන්ගේ අත්දැකීමකි. ඒවා තණ්හාවට හසු වූවන්ගේ තැති ගැනීමක් හා දඟලෑමක් ම ය.",
      "paliTitle": ""
    },
    {
      "number": 118,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi phassapaccayā.",
      "english": "Therein, monks, those ascetics and brahmins who are eternalists, who declare the self and the world to be eternal based on four grounds, that too is conditioned by contact.",
      "sinhala": "භික්ෂූණි, එහි යම් ඒ ශ්‍ර‍මණ-බ්‍රාහ්මණයෝ ශාශ්වතවාදීහු වෙත්ද, ආත්මයද, ලෝකයද ශාශ්වතයැයි සතර ආකාරයකින් ප්‍ර‍කාශ කරත්ද, ඒ සියල්ලද ස්පර්ශය හේතුවෙන් වේ.",
      "paliTitle": "Phassapaccayāvāro",
      "englishTitle": "Section on Contact as Condition",
      "sinhalaTitle": "ඵස්‍ස ප්‍රත්‍ය වාරය"
    },
    {
      "number": 119,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, tadapi phassapaccayā.",
      "english": "Monks, those recluses and brahmins who declare the self and the world to be partly eternal and partly non-eternal on four grounds – that too is conditioned by contact.",
      "sinhala": "එහිදී, මහණෙනි, යම් ඒ ශ්‍රම‍ණ-බ්‍රාහ්මණයෝ, සමහර දෑ ශාශ්වතයයි ද, සමහර දෑ අශාශ්වතයයි ද යන දෘෂ්ටිය දරමින්, ආත්මය ද ලෝකය ද සමහරක් සදාකාලිකය, සමහරක් අසදාකාලිකය යනුවෙන් කරුණු සතරක් මත පදනම්ව ප්‍රකාශ කරත් ද, ඒ ද ස්පර්ශ ප්‍රත්‍යයෙන් ඇතිවන්නකි.",
      "paliTitle": ""
    },
    {
      "number": 120,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, tadapi phassapaccayā.",
      "english": "Monks, in that regard, those ascetics and brahmins who are finitists and infinitists, and declare the world to be finite and infinite on four grounds—that too is conditioned by contact.",
      "sinhala": "භික්ෂූනි, යම් ශ්‍රමණ බ්‍රාහ්මණයෝ අන්ත-අනන්තවාදීහු වෙත් ද, ඔවුහු සතර ආකාරයකින් ලෝකය අන්තයක් සහිතය, අන්තයක් රහිතය යනාදී වශයෙන් ප්‍රකාශ කරත් ද, එය ද ස්පර්ශය හේතුකොටගෙනම පවතින්නකි.",
      "paliTitle": ""
    },
    {
      "number": 121,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, tadapi phassapaccayā.",
      "english": "Monks, in that regard, those ascetics and brahmins who are eel-wrigglers, when asked questions on various points, resort to verbal equivocation, to eel-wriggling, on four grounds. That too is conditioned by contact.",
      "sinhala": "මහණෙනි, එහිදී යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ අමරාවික්ඛේපිකයෝ වෙත්ද, ඔවුහු ඒ ඒ තන්හි ප්‍රශ්නයක් විමසන ලදුව කරුණු සතරකින් වචන වික්‍ෂේපයට, අමරාවික්ඛේපයට පත්වෙති. ඒද ස්පර්ශය හේතුවෙනි.",
      "paliTitle": ""
    },
    {
      "number": 122,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, tadapi phassapaccayā.",
      "english": "Therein, monks, those ascetics and brahmins who are accidentalists, who declare the self and the world to be accidentally arisen on two grounds—that too is conditioned by contact.",
      "sinhala": "එහි, භික්ෂූනි, යම් ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ අහේතුක-අප්‍රත්‍යයවාදීව, කාරණා දෙකකින් තමා ද ලෝකය ද අහේතුක-අප්‍රත්‍යය වශයෙන් පණවති ද, ඒ සියල්ල ද ස්පර්ශය ප්‍රත්‍යය කොට ඇතිවන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 123,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi, tadapi phassapaccayā.",
      "english": "There, monks, those ascetics and brahmins who are speculators about the past, who hold views concerning the past, and who declare various doctrines based on their convictions regarding the past in eighteen ways—that, too, is conditioned by contact.",
      "sinhala": "මහණෙනි, එහිදී යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ අතීතය අරබයා කල්පනා කරන්නෝ ද, අතීතය අරබයා දෘෂ්ටි ඇත්තෝ ද වෙත් ද, ඔවුහු අතීතය මුල් කරගෙන කරුණු අටළොසකින් නොයෙක් ආකාරයේ අභිමුක්ති පද ප්‍රකාශ කරති. එය ද ස්පර්ශය හේතුවෙනි.",
      "paliTitle": ""
    },
    {
      "number": 124,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, tadapi phassapaccayā.",
      "english": "There, monks, those recluses and brahmins who are proponents of a conscious self in the afterlife, and who declare a self that is conscious and persists beyond the body’s dissolution, in sixteen ways — that too is conditioned by contact.",
      "sinhala": "මහණෙනි, මරණින් මතු සඤ්ඤාවක් සහිත ආත්මයක් ඇතැයි වාද කරන ඒ ශ‍්‍රමණ‍බ‍්‍රාහ්මණයෝ, කාරණා දහසයකින් මරණින් මතු සඤ්ඤාවක් සහිත ආත්මයක් පනවති. ඒ සියල්ල ද ස්පර්ශය හේතුවෙනි.",
      "paliTitle": ""
    },
    {
      "number": 125,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi phassapaccayā.",
      "english": "There, monks, those ascetics and brahmins who are annihilationists and non-percipient theorists, who proclaim a non-percipient self that is annihilated after death by eight grounds, that too is conditioned by contact.",
      "sinhala": "මහණෙනි, එහිදී යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ අසංඥ වූ ද, මරණයෙන් පසු උච්ඡේද වන සුළු වූ ද ආත්මයක් කරුණු අටකින් ප්‍රඥප්ත කරත් ද, ඒ සියල්ල ද ස්පර්ශය නිසාය.",
      "paliTitle": ""
    },
    {
      "number": 126,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, tadapi phassapaccayā.",
      "english": "There, monks, those recluses and brahmins who are proponents of the view that neither-perception-nor-non-perception constitutes a higher cessation, and who postulate the self, by means of eight categories, as neither-perception-nor-non-perception and as a higher cessation—that too is conditioned by contact.",
      "sinhala": "භික්ෂූනි, එහිලා, යම් ඒ ශ්‍ර‍‌මණ බ්‍රා‍‌හ්මණයෝ ඉහළම විනාශයක් (අවසන් නිමා වීමක්) ලෙස නේවසඤ්ඤානාසඤ්ඤී වාදය දරන්නාහු ද, ඔවුහු නේවසඤ්ඤානාසඤ්ඤී වන එම ආත්මය ඉහළම විනාශයක් ලෙස ආකාර අටකින් පනවති. එයද ස්පර්ශය හේතුකොටගෙනම පවතී.",
      "paliTitle": ""
    },
    {
      "number": 127,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, tadapi phassapaccayā.",
      "english": "Monks, those recluses and brahmins who are annihilationists and who assert, by means of seven bases, the annihilation, destruction, and dissolution of an existing being—even that is conditioned by contact.",
      "sinhala": "මහණෙනි, එහිදී යම් ඒ උච්ඡේදවාදී ශ්‍රමණබ්‍රාහ්මණයෝ පවතින සත්වයාගේ උච්ඡේදය, විනාශය, නැතිවීම කරුණු සතකින් පනවතිද, ඒ සියල්ලද ස්පර්ශ ප්‍රත්‍යයෙන්ම වේ.",
      "paliTitle": ""
    },
    {
      "number": 128,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, tadapi phassapaccayā.",
      "english": "There, monks, those ascetics and brahmins who advocate Nibbāna as attainable in this very life, declare the highest Nibbāna in this very life for an existing being, doing so on account of five points. Even that is conditioned by contact.",
      "sinhala": "භික්‍ෂූනි, එහිලා යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ දිට්ඨධම්මනිර්වාදවාදීහු වෙත් ද, ඔවුහු සිටින සත්ත්වයාට උතුම් වූ දිට්ඨධම්ම නිර්වාණය පස් වැදෑරුම් වස්තූන්ගෙන් පනවති ද, ඒ සියල්ල ද ස්පර්ශ ප්‍රත්‍යය හේතු කොටගෙන ය.",
      "paliTitle": ""
    },
    {
      "number": 129,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, tadapi phassapaccayā.",
      "english": "There, monks, those ascetics and brahmins who speculate about the future and hold views concerning the future, and who, regarding the future, proclaim various kinds of dogmatic assertions on forty-four bases—all of that is also conditioned by contact.",
      "sinhala": "මහණෙනි, එහිදී, යම් ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ අනාගතය අරභයා කල්පනා කරන්නෝද, අනාගතය අනුව දෘෂ්ටි ඇත්තෝද, අනාගතය අරමුණු කොටගෙන සතළිස් සතරක් වස්තූන්ගෙන් නානාවිධ අධිමුක්ති පද ප්‍රකාශ කරත්ද, ඒ සියල්ලද ස්පර්ශය හේතු කොට ගත්තකි.",
      "paliTitle": ""
    },
    {
      "number": 130,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, tadapi phassapaccayā. ",
      "english": "Monks, regarding this, those ascetics and brahmins who are either theorizers about the past, or theorizers about the future, or theorizers about both the past and the future, and who hold views concerning the past and future, declaring various kinds of speculative doctrines referring to the past and the future, by means of sixty-two standpoints—all that, too, is conditioned by contact.",
      "sinhala": "එහි, මහණෙනි, යම් ඒ ශ්‍ර‍මණ බ්‍රාහ්මණයෝ පූර්වාන්තය කල්පනා කරන්නාහුද, අපරාන්තය කල්පනා කරන්නාහුද, පූර්වාන්තය හා අපරාන්තය යන දෙකම කල්පනා කරන්නාහුද, පූර්වාන්තය හා අපරාන්තය පිළිබඳ දෘෂ්ටි ඇත්තාහුද, පූර්වාන්තය හා අපරාන්තය අරභයා හැටදෙකක් වස්තූන්ගෙන් නොයෙක් ආකාර වූ අභිමුක්ති පද ප්‍ර‍කාශ කරත්ද, ඒ සියල්ලද ඵස්ස ප්‍ර‍ත්‍යය කරණකොටගෙනය.",
      "paliTitle": ""
    },
    {
      "number": 131,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "There, bhikkhus, those ascetics and brahmins who are eternalists, who proclaim the self and the world to be eternal through four modes – that they will experience this apart from contact – this is not possible.",
      "sinhala": "මහණෙනි, එහිලා, යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ සස්සතවාදීහු වෙත් ද, සතර කරුණකින් ආත්මයත් ලෝකයත් සදාකාලික යැයි පනවති ද, ඔවුන් ස්පර්ශයෙන් තොරව අත්විඳින්නේ යැයි යන්න සිදු විය නොහැකි කරුණකි.",
      "paliTitle": "Netaṃ ṭhānaṃ vijjativāro",
      "englishTitle": "This Is Not a Possible Occasion",
      "sinhalaTitle": "මෙය පැවතිය හැකි අවස්‍​ථාවක් නොවේ."
    },
    {
      "number": 132,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ekaccasassatikā ekacca asassatikā ekaccaṃ sassataṃ ekaccaṃ asassataṃ attānañca lokañca paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Monks, concerning those ascetics and brahmins who, on four grounds, declare the self and the world to be partly eternal and partly non-eternal—it is not possible that they would experience this without sensory contact.",
      "sinhala": "මහණෙනි, එහිලා යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ සතර කරුණු හේතුකොටගෙන ආත්මයද ලෝකයද අර්ධ වශයෙන් සදාකාලිකය, අර්ධ වශයෙන් අසදාකාලිකය යැයි ප්‍රකාශ කරත්ද, ඔවුහු ස්පර්ශයෙන් තොරව යමක් ප්‍රතිසංවේදනය කරන්නාහු යනු විය හැක්කක් නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 133,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā antānantikā antānantaṃ lokassa paññapenti catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Monks, it is not possible that those recluses and brahmins who are proponents of the finitude and infinitude of the world, and who declare the world to be finite and infinite based on four standpoints, would experience anything without contact.",
      "sinhala": "මහණෙනි, යම් ශ්‍ර‍ම‍ණබ්‍රාහ්මණයෝ සතර කරුණකින් ලෝකයේ අන්තයක් හෝ අනන්තයක් පනවමින් අන්තානන්තිකවාදීහු වෙත්ද, ඔවුහු ස්පර්ශයෙන් තොරව අත්විඳින්නට හැකියාවක් නැත, එවැන්නක් සිදුවිය නොහැක්කකි.",
      "paliTitle": ""
    },
    {
      "number": 134,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā amarāvikkhepikā tattha tattha pañhaṃ puṭṭhā samānā vācāvikkhepaṃ āpajjanti amarāvikkhepaṃ catūhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Here, monks, those ascetics and brahmins who are eel-wrigglers, when asked questions here and there, resort to verbal equivocation, to eel-wriggling, on four grounds. It is not possible that they would experience anything apart from contact.",
      "sinhala": "මහණෙනි, එහිලා, යම් ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ අමරාවික්ඛේපිකයෝ වෙත්ද, ඔවුහු නොයෙක් තැන්හි ප්‍රශ්න විමසන ලදුව, කරුණු සතරකින් අමරාවික්ඛේප නම් වූ වචන වික්ෂේපයකට පැමිණෙත්. නියත වශයෙන්ම ඔවුනට ස්පර්ශයෙන් තොරව පටිසංවේදනයක් ඇතිවන්නේය යනු සිදු විය නොහැක්කකි.",
      "paliTitle": ""
    },
    {
      "number": 135,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā adhiccasamuppannikā adhiccasamuppannaṃ attānañca lokañca paññapenti dvīhi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Monks, concerning those ascetics and brahmins who are adherents of fortuitous origination, and who declare that the self and the world arose by chance on two grounds — it is impossible that they would experience anything without contact.",
      "sinhala": "මහණෙනි, එහිදී, යම් අධිච්චසමුප්පන්නවාදී ශ්‍රමණ-බ්‍රාහ්මණයෝ කාරණා දෙකක් මුල් කරගෙන ආත්මයද ලෝකයද අහේතුකව හටගත්තේයැයි ප්‍රකාශ කරත් ද, ඔවුහු ස්පර්ශය හැර (වෙනත්) වේදනා විඳිනවා යැයි කීම සිදුවිය නොහැක්කකි.",
      "paliTitle": ""
    },
    {
      "number": 136,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā pubbantānudiṭṭhino pubbantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti aṭṭhārasahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Monks, herein, those recluses and brahmins who are theorizers of the past, who hold views pertaining to the past, and who, on eighteen grounds, proclaim various kinds of dogmatic assertions concerning the past—it is impossible that they will experience anything without contact.",
      "sinhala": "එහිදී, මහණෙනි, යම් ඒ ශ්‍ර‍මණ-බ්‍රාහ්ම‍ණවරු පූර්වාන්තය (අතීතය) අරබයා කල්පනා කරන්නාවූ, පූර්වාන්තය අරබයා දෘෂ්ටි දරන්නාවූ, පූර්වාන්තය අරබයා නොයෙක් ආකාර වූ අභිමුක්ති පද දහඅටක් වස්තූන් මගින් ප්‍ර‍කාශ කරත් ද, ඔවුන් ස්පර්ශය නොමැතිව වේදනා විඳිනු ඇතැයි යන්න කිසිසේත් සිදු විය නොහැක.",
      "paliTitle": ""
    },
    {
      "number": 137,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā uddhamāghātanaṃ saññiṃ attānaṃ paññapenti soḷasahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Monks, concerning this, those recluses and brahmins who are proponents of doctrines of conscious existence after death, and who declare the self to be conscious after death by way of sixteen modes—it is simply not possible for them to experience anything apart from contact. Such a situation does not exist.",
      "sinhala": "එහිදී, මහණෙනි, යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ මරණින් මතු සංඥා සහිත ආත්මයක් දහසය ආකාරයකින් ප්‍රකාශ කරන උද්ධමාඝාතනික සංඥාවාදීහු වෙත් ද, ඔවුන් ස්පර්ශයෙන් තොරව වේදනා විඳින්නේ යැයි කීම සිදු විය හැක්කක් නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 138,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā, uddhamāghātanaṃ asaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "There, monks, regarding those ascetics and brahmins who are proponents of the annihilation of non-perceptive beings, and who declare a non-perceptive self to be annihilated by means of eight propositions, it is certainly not possible for them to experience anything apart from contact. Such a possibility does not exist.",
      "sinhala": "භික්‍ෂූනි, එහි යම් ඒ ශ්‍රමණ-බ්‍රාහ්මණයෝ උද්ධමාඝාතනික වූ අසංඥවාදීහු වෙත් ද, ඔවුහු කරුණු අටකින් උද්ධමාඝාතනික වූ අසංඥ ආත්මයක් ප්‍රඥප්ත කරත් ද, ඔවුහු ස්පර්ශයකින් තොරව වේදනා විඳිත් යැයි යන කරුණක් නොපවතී.",
      "paliTitle": ""
    },
    {
      "number": 139,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā uddhamāghātanaṃ nevasaññīnāsaññiṃ attānaṃ paññapenti aṭṭhahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Monks, it is impossible that those ascetics and brahmins who are proponents of a post-mortem existence, who advocate the doctrine of neither-perception-nor-non-perception, and who declare the self to be in a state of neither-perception-nor-non-perception in a post-mortem existence in eight ways, would experience such a state apart from contact.",
      "sinhala": "මහණෙනි, එහිදී යම් ඒ ශ්‍ර‍මණ-බ්‍රාහ්මණයෝ නේවසඤ්ඤානාසඤ්ඤි තත්ත්වය උසස්ම තත්ත්වය ලෙස ගන්නා, නේවසඤ්ඤානාසඤ්ඤීවාදී වූවාහු, කරුණු අටකින් නේවසඤ්ඤානාසඤ්ඤි තත්ත්වයට පැමිණි ඒ උසස්ම තත්ත්වය තමාගේ ආත්මය ලෙස ප්‍ර‍ඥප්ත කරත්ද, ඔවුන් ස්පර්ශයෙන් තොරව යමක් අත්විඳිනු ඇතැයි යන මෙවැනි තැනක් නැත.",
      "paliTitle": ""
    },
    {
      "number": 140,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā ucchedavādā sato sattassa ucchedaṃ vināsaṃ vibhavaṃ paññapenti sattahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "There, monks, concerning those recluses and brahmins who are annihilationists, who propound the annihilation, destruction, and vanishing of an existent being by means of seven bases, it is not possible that they will experience anything apart from sense-contact.",
      "sinhala": "මහණෙනි, යම් ඒ උච්ඡේදවාදී ශ්‍රමණබ්‍රාහ්මණයෝ සත් වස්තූන්ගෙන් පවත්නා සත්වයාගේ උච්ඡේදය, විනාශය, නැතිවීම පනවතිත්ද, ඔවුහු ඵස්සය නොමැතිව අත්විඳිනු ඇතැයි යන්න සිදු විය හැක්කක් නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 141,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā sato sattassa paramadiṭṭhadhammanibbānaṃ paññapenti pañcahi vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Monks, in this regard, those recluses and brahmins who advocate for Nibbana in this very life, who declare a supreme Nibbana in this very life for an existent being through five things, it is simply not possible for them to experience it apart from contact.",
      "sinhala": "මහණෙනි, එහිදී, යම් ශ්‍රමණ-බ්‍රාහ්මණවරු දිට්ඨධම්මනිබ්බානවාදීහු වෙත් ද, ඔවුහු පවත්නා සත්ත්වයාට පංච වස්තූන්ගෙන් පරම දිට්ඨධම්මනිබ්බානය පඤ්ඤපෙන්ති කරත් ද, ස්පර්ශය හැර ඔවුහු එය පටිසංවේදනය කරත් යයි එබඳු අවස්ථාවක් නොපවතියි.",
      "paliTitle": ""
    },
    {
      "number": 142,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā aparantakappikā aparantānudiṭṭhino aparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti catucattārīsāya vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "Monks, in that regard, for those ascetics and brahmins who theorize about the future, who hold views concerning the future, and who proclaim various speculative doctrines regarding the future based on forty-four grounds—it is certainly not possible for them to experience anything apart from contact.",
      "sinhala": "මහණෙනි, අනාගතය (අපරන්තය) පිළිබඳවම දැඩිව කල්පනා කරන්නාවූද, අනාගතය (අපරන්තය) අනුවම දැඩි දෘෂ්ටි දරන්නාවූද, අනාගතය (අපරන්තය) අරමුණු කොටගෙන සූසාලිස් වස්තූන්ගෙන් නොයෙක් ආකාර වූ අතිමුක්ති ප්‍රකාශයන් ප්‍රකාශ කරන්නාවූ යම් ශ්‍රමණ-බ්‍රාහ්මණයෝ වෙත් ද, ඔවුන් ස්පර්ශය රහිතව වේදනා විඳිනු ඇතැයි යන තැනක් හෝ හේතුවක් නොපවතී.",
      "paliTitle": ""
    },
    {
      "number": 143,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, te vata aññatra phassā paṭisaṃvedissantīti netaṃ ṭhānaṃ vijjati.",
      "english": "There, monks, those recluses and brahmins who theorize about the past, and about the future, and about both the past and the future; who hold views regarding the past and the future, and who proclaim various dogmatic assertions concerning the past and the future through sixty-two bases — it is impossible for them to experience this without contact.",
      "sinhala": "භික්ෂූණි, එහි යම් ශ්‍රමණ-බ්‍රාහ්මණයෝ අතීතය අරභයා කල්පනා කරන්නෝ ද, අනාගතය අරභයා කල්පනා කරන්නෝ ද, අතීතය හා අනාගතය යන දෙකම අරභයා කල්පනා කරන්නෝ ද, අතීතය හා අනාගතය අරභයා දෘෂ්ටීන්හි බැසගත්තෝ ද වෙත් ද, ඔවුහු දැටියා දෙකක් (62) වන වස්තූන්ගෙන් අතීතය හා අනාගතය මුල්කරගෙන නොයෙක් ආකාරයේ අභිමුක්ති පද ප්‍රකාශ කරත් ද, ඔවුනට ඵස්සය (ස්පර්ශය) නොමැතිව වේදනා විඳින්නට සිදුවීමක් විය නොහැක්කකි.",
      "paliTitle": ""
    },
    {
      "number": 144,
      "pali": "‘‘Tatra, bhikkhave, ye te samaṇabrāhmaṇā sassatavādā sassataṃ attānañca lokañca paññapenti catūhi vatthūhi, yepi te samaṇabrāhmaṇā ekaccasassatikā ekaccaasassatikā…pe… yepi te samaṇabrāhmaṇā antānantikā… yepi te samaṇabrāhmaṇā amarāvikkhepikā… yepi te samaṇabrāhmaṇā adhiccasamuppannikā… yepi te samaṇabrāhmaṇā pubbantakappikā… yepi te samaṇabrāhmaṇā uddhamāghātanikā saññīvādā… yepi te samaṇabrāhmaṇā uddhamāghātanikā asaññīvādā… yepi te samaṇabrāhmaṇā uddhamāghātanikā nevasaññīnāsaññīvādā… yepi te samaṇabrāhmaṇā ucchedavādā… yepi te samaṇabrāhmaṇā diṭṭhadhammanibbānavādā… yepi te samaṇabrāhmaṇā aparantakappikā… yepi te samaṇabrāhmaṇā pubbantakappikā ca aparantakappikā ca pubbantāparantakappikā ca pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti dvāsaṭṭhiyā vatthūhi, sabbe te chahi phassāyatanehi phussa phussa paṭisaṃvedenti tesaṃ vedanāpaccayā taṇhā, taṇhāpaccayā upādānaṃ, upādānapaccayā bhavo, bhavapaccayā jāti, jātipaccayā jarāmaraṇaṃ sokaparidevadukkhadomanassupāyāsā sambhavanti. ",
      "english": "There, monks, those ascetics and brahmins who are eternalists, declaring the self and the world to be eternal in four ways; and those ascetics and brahmins who are part-eternalists and part-non-eternalists; and those ascetics and brahmins who assert the world to be finite or infinite; and those ascetics and brahmins who are eel-wrigglers; and those ascetics and brahmins who are fortuitous originists; and those ascetics and brahmins who speculate about the past; and those ascetics and brahmins who assert a conscious existence after death; and those ascetics and brahmins who assert an unconscious existence after death; and those ascetics and brahmins who assert a neither-conscious-nor-unconscious existence after death; and those ascetics and brahmins who are annihilationists; and those ascetics and brahmins who assert Nibbāna in this present life; and those ascetics and brahmins who speculate about the future; and those ascetics and brahmins who speculate about both the past and the future, who adhere to views concerning both the past and the future, and who, with regard to the past and the future, proclaim various doctrines based on their own convictions, across sixty-two grounds—all of them, by repeatedly making contact with the six sense bases, experience feelings. Dependent on feeling is craving; dependent on craving is clinging; dependent on clinging is existence; dependent on existence is birth; and dependent on birth, old age and death, sorrow, lamentation, pain, displeasure, and despair come to be.",
      "sinhala": "භික්ෂූනි, එහිලා, යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ සතර වස්තූන්ගෙන් ආත්මය ද ලෝකය ද සස්සත (ස්ථිර) යැයි ප්‍රකාශ කරන සස්සතවාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ ඒකච්චසස්සතික ඒකච්චඅසස්සතික (සමහර දේ සස්සත යැයි ද සමහර දේ අසස්සත යැයි ද කියන) වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ අන්තානන්තික (ලෝකය සීමා සහිත යැයි ද අසීමා සහිත යැයි ද කියන) වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ අමරාවික්ඛේපික (මග හැර කතා කරන/සැකමුසු) වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ අධිච්චසමුප්පන්නික (හේතුවක් නැතිව අහම්බෙන් ඇති වියැයි කියන) වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ පූර්ව-අන්ත කල්පික (අතීතය පිළිබඳ අදහස් ගොඩනගන) වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ මරණින් මතු සංඥා සහිත යැයි කියන වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ මරණින් මතු අසංඥා සහිත යැයි කියන වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ මරණින් මතු නේවසංඥානාසංඥා (සංඥා ද නැති, අසංඥා ද නැති) සහිත යැයි කියන වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ උච්ඡේදවාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ දිට්ඨධම්මනිබ්බාණවාදීහු (මේ ජීවිතයේදීම නිර්වාණය ලැබිය හැකි යැයි කියන) වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ අපර-අන්ත කල්පික (අනාගතය පිළිබඳ අදහස් ගොඩනගන) වාදීහු වෙත් ද; යම් ඒ ශ්‍රමණ බ්‍රාහ්මණයෝ පූර්ව-අන්තය පිළිබඳ අදහස් ගොඩනගන, අපර-අන්තය පිළිබඳ අදහස් ගොඩනගන, පූර්ව-අන්තය හා අපර-අන්තය දෙක පිළිබඳ අදහස් ගොඩනගන, සහ පූර්ව-අන්තය හා අපර-අන්තය යන දෙකම අරභයා දෘෂ්ටි අනුගමනය කරන ශ්‍රමණ බ්‍රාහ්මණයෝ ද, පූර්ව-අන්තය සහ අපර-අන්තය පිළිබඳව නොයෙක් ආකාර වූ අදහස් පදයන් දෙසැටක් (62) මූලික කොටගෙන ප්‍රකාශ කරත් ද; ඒ සියල්ලෝම සය වැදෑරුම් ස්පර්ශායතන වලින් නැවත නැවතත් ස්පර්ශ කරමින් විඳිත්. ඔවුන්ට වේදනා හේතුවෙන් තණ්හාව ද, තණ්හාව හේතුවෙන් උපාදානය ද, උපාදානය හේතුවෙන් භවය ද, භවය හේතුවෙන් ජාතිය ද, ජාතිය හේතුවෙන් ජරා-මරණය ද, ශෝක, පරිදේව, දුක්, දෝමනස්ස, උපායාස ද ඇති වෙති.",
      "paliTitle": "Diṭṭhigatikādhiṭṭhānavaṭṭakathā",
      "englishTitle": "Discourse on the Cycle of Adhering to Views",
      "sinhalaTitle": "දෘෂ‍්ටිගත අධිට‍්ඨාන වට‍්ට කථාව"
    },
    {
      "number": 145,
      "pali": "‘‘Yato kho, bhikkhave, bhikkhu channaṃ phassāyatanānaṃ samudayañca atthaṅgamañca assādañca ādīnavañca nissaraṇañca yathābhūtaṃ pajānāti, ayaṃ imehi sabbeheva uttaritaraṃ pajānāti.",
      "english": "Indeed, monks, when a monk truly understands the origin, the disappearance, the gratification, the danger, and the escape concerning the six sense bases, he understands what is superior to all of these.",
      "sinhala": "යමෙක් භික්ෂූනි, සය ස්පර්ශායතනවල හටගැනීම ද, නැතිවීම ද, ආශ්වාදය ද, ආදීනවය ද, නිස්සරණය ද, යථාභූතව දනී ද, ඔහු මේ සියල්ලටම වඩා උත්තරීතරව දනී.",
      "paliTitle": "Vivaṭṭakathādi",
      "englishTitle": "Unrolling Discourses and others.",
      "sinhalaTitle": "විවට්ටකථාදිය"
    },
    {
      "number": 146,
      "pali": "‘‘Ye hi keci, bhikkhave, samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi antojālīkatā, ettha sitāva ummujjamānā ummujjanti, ettha pariyāpannā antojālīkatāva ummujjamānā ummujjanti. ‘‘Seyyathāpi, bhikkhave, dakkho kevaṭṭo vā kevaṭṭantevāsī vā sukhumacchikena jālena parittaṃ udakadahaṃ [udakarahadaṃ (sī. syā. pī.)] otthareyya. Tassa evamassa – ‘ye kho keci imasmiṃ udakadahe oḷārikā pāṇā, sabbe te antojālīkatā. Ettha sitāva ummujjamānā ummujjanti; ettha pariyāpannā antojālīkatāva ummujjamānā ummujjantī’ti; evameva kho, bhikkhave, ye hi keci samaṇā vā brāhmaṇā vā pubbantakappikā vā aparantakappikā vā pubbantāparantakappikā vā pubbantāparantānudiṭṭhino pubbantāparantaṃ ārabbha anekavihitāni adhimuttipadāni abhivadanti, sabbe te imeheva dvāsaṭṭhiyā vatthūhi antojālīkatā ettha sitāva ummujjamānā ummujjanti, ettha pariyāpannā antojālīkatāva ummujjamānā ummujjanti.",
      "english": "Bhikkhus, whatever recluses or brahmins who speculate about the past, or about the future, or about both past and future; who hold views concerning the past and future, expressing various speculative theories about the past and the future—all of them are entrapped within these sixty-two views. Bound within them, they surface and re-surface; encompassed by them, caught as if in a net, they surface and re-surface.\n\nJust as, bhikkhus, a skilled fisherman or his apprentice might cast a fine-meshed net over a small pond. He might think: 'Whatever large creatures are in this pond, all of them are entrapped within this net. Bound within it, they surface and re-surface; encompassed by it, caught as if in a net, they surface and re-surface.' In the same way, bhikkhus, whatever recluses or brahmins who speculate about the past, or about the future, or about both past and future; who hold views concerning the past and future, expressing various speculative theories about the past and the future—all of them are entrapped within these sixty-two views. Bound within them, they surface and re-surface; encompassed by them, caught as if in a net, they surface and re-surface.",
      "sinhala": "භික්ෂූණි, යම්කිසි ශ්‍රමණ‍යෝ හෝ බ්‍රාහ්මණ‍යෝ හෝ වෙත් ද, අතීතය පිළිබඳව කල්පනා කරන්නෝ හෝ අනාගතය පිළිබඳව කල්පනා කරන්නෝ හෝ අතීතයත් අනාගතයත් දෙකම පිළිබඳව කල්පනා කරන්නෝ හෝ වෙත් ද, අතීතය හා අනාගතය පිළිබඳව දෘෂ්ටි ඇත්තෝ, අතීතය හා අනාගතය අරභයා නොයෙක් ආකාර වූ නිශ්චය කිරීම් ප්‍රකාශ කරත් ද, ඔවුන් සියල්ලෝම මේ දෙසැටක් වූ දෘෂ්ටි වස්තූන්ගේ දැලට අසුවූවෝ වෙත්. එහිම බැඳී, දෘෂ්ටි දැලෙන් එතෙර වන්නට තැත් කරමින් එතෙර වෙති. එහිම ඇතුළත් වී, දෘෂ්ටි දැලට හසුවූවන් සේ එතෙර වන්නට තැත් කරමින් එතෙර වෙති.\n\nභික්ෂූණි, යම් සේ දක්ෂ ධීවරයෙක් හෝ ඔහුගේ ගෝලයෙක් හෝ සිහින් දැල් ඇති දැලකින් කුඩා ජලාශයක් වසාලන්නේ ද, ඔහුට මෙසේ සිතෙන්නේ ය: ‘මේ ජලාශයේ යම්කිසි මහත් ප්‍රාණීහු වෙත් ද, ඒ සියල්ලෝම මේ දැලට හසුවූවෝ වෙත්. එහිම බැඳී, දැලෙන් එතෙර වන්නට තැත් කරමින් එතෙර වෙති. එහිම ඇතුළත් වී, දැලට හසුවූවන් සේ එතෙර වන්නට තැත් කරමින් එතෙර වෙති.’ භික්ෂූණි, එපරිද්දෙන්ම යම්කිසි ශ්‍රමණ‍යෝ හෝ බ්‍රාහ්මණ‍යෝ හෝ වෙත් ද, අතීතය පිළිබඳව කල්පනා කරන්නෝ හෝ අනාගතය පිළිබඳව කල්පනා කරන්නෝ හෝ අතීතයත් අනාගතයත් දෙකම පිළිබඳව කල්පනා කරන්නෝ හෝ වෙත් ද, අතීතය හා අනාගතය පිළිබඳව දෘෂ්ටි ඇත්තෝ, අතීතය හා අනාගතය අරභයා නොයෙක් ආකාර වූ නිශ්චය කිරීම් ප්‍රකාශ කරත් ද, ඔවුන් සියල්ලෝම මේ දෙසැටක් වූ දෘෂ්ටි වස්තූන්ගේ දැලට අසුවූවෝ වෙත්. එහිම බැඳී, දෘෂ්ටි දැලෙන් එතෙර වන්නට තැත් කරමින් එතෙර වෙති. එහිම ඇතුළත් වී, දෘෂ්ටි දැලට හසුවූවන් සේ එතෙර වන්නට තැත් කරමින් එතෙර වෙති.",
      "paliTitle": ""
    },
    {
      "number": 147,
      "pali": "‘‘Ucchinnabhavanettiko, bhikkhave, tathāgatassa kāyo tiṭṭhati. Yāvassa kāyo ṭhassati, tāva naṃ dakkhanti devamanussā. Kāyassa bhedā uddhaṃ jīvitapariyādānā na naṃ dakkhanti devamanussā. ‘‘Seyyathāpi, bhikkhave, ambapiṇḍiyā vaṇṭacchinnāya yāni kānici ambāni vaṇṭapaṭibandhāni [vaṇṭūpanibandhanāni (sī. pī.), vaṇḍapaṭibaddhāni (ka.)], sabbāni tāni tadanvayāni bhavanti; evameva kho, bhikkhave, ucchinnabhavanettiko tathāgatassa kāyo tiṭṭhati, yāvassa kāyo ṭhassati, tāva naṃ dakkhanti devamanussā, kāyassa bhedā uddhaṃ jīvitapariyādānā na naṃ dakkhanti devamanussā’’ti.",
      "english": "Monks, the Tathāgata’s body remains with the cord of becoming severed. As long as his body remains, gods and humans will see him. After the breaking up of the body, after the exhaustion of life, gods and humans will not see him.\n\nJust as, monks, when the stem of a bunch of mangoes is cut off, all the mangoes that were attached to that stem will consequently fall and perish. Even so, monks, the Tathāgata’s body remains with the cord of becoming severed. As long as his body remains, gods and humans will see him. After the breaking up of the body, after the exhaustion of life, gods and humans will not see him.",
      "sinhala": "මහණෙනි, භව නෙත්තිකය සිඳ දමන ලද තථාගතයන් වහන්සේගේ කය පවතී. යම්තාක් කල් උන්වහන්සේගේ කය පවතින්නේද, ඒතාක් කල් දෙවි මිනිස්සු උන්වහන්සේ දකිති. කය බිඳී යාමෙන්, ජීවිතය අවසන් වීමෙන් පසු දෙවි මිනිස්සු උන්වහන්සේ නොදකිති.\n\nමහණෙනි, යම්සේ දඬු සිඳින ලද අඹ පොකුරක් වේද, යම් අඹ දඬුවට බැඳී තිබේද, ඒ සියල්ලම ඊට අනුගාමී වෙත්ද; එලෙසින්ම මහණෙනි, භව නෙත්තිකය සිඳ දමන ලද තථාගතයන් වහන්සේගේ කය පවතී. යම්තාක් කල් උන්වහන්සේගේ කය පවතින්නේද, ඒතාක් කල් දෙවි මිනිස්සු උන්වහන්සේ දකිති. කය බිඳී යාමෙන්, ජීවිතය අවසන් වීමෙන් පසු දෙවි මිනිස්සු උන්වහන්සේ නොදකිති.",
      "paliTitle": ""
    },
    {
      "number": 148,
      "pali": "Evaṃ vutte āyasmā ānando bhagavantaṃ etadavoca – ‘‘acchariyaṃ, bhante, abbhutaṃ, bhante, ko nāmo ayaṃ, bhante, dhammapariyāyo’’ti? ‘‘Tasmātiha tvaṃ, ānanda, imaṃ dhammapariyāyaṃ atthajālantipi naṃ dhārehi, dhammajālantipi naṃ dhārehi, brahmajālantipi naṃ dhārehi, diṭṭhijālantipi naṃ dhārehi, anuttaro saṅgāmavijayotipi naṃ dhārehī’’ti. Idamavoca bhagavā.",
      "english": "When this was said, Venerable Ānanda said to the Blessed One, \"Wonderful, venerable sir! Marvelous, venerable sir! What is the name of this discourse, venerable sir?\" \"Therefore, Ānanda, remember this discourse as the Net of Meaning, remember it also as the Net of Dhamma, remember it also as the Divine Net, remember it also as the Net of Views, and remember it also as the Supreme Victory in Battle.\" The Blessed One said this.",
      "sinhala": "මෙසේ පැවසූ කල්හි ආයුෂ්මත් ආනන්ද තෙරණුවෝ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: \"ආශ්චර්යයයි භාග්‍යවතුන් වහන්ස, අද්භූතයයි භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්ස, මේ ධර්මපර්යායයේ නම කුමක්ද?\" \"එබැවින්, ආනන්ද, මේ ධර්මපර්යායය අර්ථජාලය ලෙසද, ධර්මජාලය ලෙසද, බ්‍රහ්මජාලය ලෙසද, දිට්ඨිජාලය ලෙසද, අනුත්තර සංග්‍රාමවිජය ලෙසද දරන්නැයි.\" භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 149,
      "pali": "Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. Imasmiñca pana veyyākaraṇasmiṃ bhaññamāne dasasahassī [sahassī (katthaci)] lokadhātu akampitthāti.",
      "english": "Those monks were gladdened and rejoiced in the discourse of the Blessed One. And while this exposition was being uttered, the ten-thousand-world-system trembled.",
      "sinhala": "ඒ භික්ෂූහු සතුටු සිත් ඇතිව, භාග්‍යවතුන් වහන්සේගේ දෙසුම අභිනන්දනය කළහ. තවද, මෙම වෛය්‍යාකරණ ධර්‍ම දේශනාව දේශනා කරනු ලබන කල්හි, දසදහසක් වූ ලෝක ධාතුව කම්පා විය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Brahmajālasuttaṃ niṭṭhitaṃ paṭhamaṃ",
    "english": "First Discourse: Brahmajālasutta Concluded.",
    "sinhala": "පළමු බ්‍රහ්මජාල සූත්‍රය නිමි."
  }
}