{
  "id": "dn.1.8",
  "title": {
    "pali": "Mahāsīhanādasuttaṃ",
    "english": "The Great Discourse on the Lion's Roar",
    "sinhala": "මහාසිංහනාදසූත්‍රය"
  },
  "sections": [
    {
      "number": 381,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā uruññāyaṃ [ujuññāyaṃ (sī. syā. kaṃ. pī.)] viharati kaṇṇakatthale migadāye. Atha kho acelo kassapo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho acelo kassapo bhagavantaṃ etadavoca – ‘‘sutaṃ metaṃ, bho gotama – ‘samaṇo gotamo sabbaṃ tapaṃ garahati, sabbaṃ tapassiṃ lūkhājīviṃ ekaṃsena upakkosati upavadatī’ti. Ye te, bho gotama, evamāhaṃsu – ‘samaṇo gotamo sabbaṃ tapaṃ garahati, sabbaṃ tapassiṃ lūkhājīviṃ ekaṃsena upakkosati upavadatī’ti, kacci te bhoto gotamassa vuttavādino, na ca bhavantaṃ gotamaṃ abhūtena abbhācikkhanti, dhammassa cānudhammaṃ byākaronti, na ca koci sahadhammiko vādānuvādo gārayhaṃ ṭhānaṃ āgacchati? Anabbhakkhātukāmā hi mayaṃ bhavantaṃ gotama’’nti.",
      "english": "Thus have I heard – At one time the Blessed One was dwelling in Uruññā, at Kaṇṇakattha, in the Deer Park. Then the naked ascetic Kassapa approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded their polite and cordial conversation, he stood to one side. Standing to one side, the naked ascetic Kassapa spoke to the Blessed One thus: ‘I have heard this, Venerable Gotama: \"The ascetic Gotama criticizes all austerity; he denounces and disparages every ascetic and one who lives a harsh life without reservation.\" Are those who said this, Venerable Gotama: \"The ascetic Gotama criticizes all austerity; he denounces and disparages every ascetic and one who lives a harsh life without reservation\" – are they speaking in accordance with what the Venerable Gotama has said, not misrepresenting the Venerable Gotama with what is not true, explaining the Dhamma in accordance with the Dhamma, and is there no co-Dharmic point of contention that might lead to censure? For we do not wish to misrepresent the Venerable Gotama.’",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ උරුඤ්ඤා නම් ජනපදයේ කණ්ණකත්‍ථල මුවදෙහි වැඩවසන සේක.\n\nඑකල්හි අචේල කස්‍සප තෙමේ භාග්‍යවතුන් වහන්සේ යම් තැනක වැඩ සිටි සේක්ද, එතැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු විය යුතු සිහිකළ යුතු කථාවක් කථා කොට නිමවා එකත්‍පස්ව සිටගත්තේය.\n\nඑකත්‍පස්ව සිටි අචේල කස්‍සප තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භවත් ගෞතමයන් වහන්ස, 'ශ්‍රමණ ගෞතම තෙමේ සියලු තපස් වාරණය කරයි, සියලු තපස්‍වීන්, රළු දිවි ඇති අයව එකාන්තයෙන් දෝෂාරෝපණය කරයි, නින්දා කරයි' යන මේ කාරණය මා අසා ඇත. භවත් ගෞතමයන් වහන්ස, 'ශ්‍රමණ ගෞතම තෙමේ සියලු තපස් වාරණය කරයි, සියලු තපස්‍වීන්, රළු දිවි ඇති අයව එකාන්තයෙන් දෝෂාරෝපණය කරයි, නින්දා කරයි' යනුවෙන් යම් කෙනෙක් පැවසුවාහුද, ඔවුහු භවත් ගෞතමයන් වහන්සේගේ කියමන්‍ම කියන්නාහුද? භවත් ගෞතමයන් වහන්සේට අසත්‍යයෙන් අභූත චෝදනා නොකරන්නාහුද? ධර්‍මයට අනුකූලව ධර්‍මය ව්‍යාකරණය කරන්නාහුද? ධර්‍මයට අනුව යම් කිසිවාදයක් කිසිවෙකුට දෝෂාරෝපණයට ලක්විය යුතු තැනකට නොපැමිණෙන්නේද? භවත් ගෞතමයන් වහන්සේට අපි අභූත චෝදනා කිරීමට අකමැත්‍තෝ වෙමු.\"",
      "paliTitle": "Acelakassapavatthu",
      "englishTitle": "Story of Acelakassapa",
      "sinhalaTitle": "අචේලකස්‌සප වස්තුව"
    },
    {
      "number": 382,
      "pali": "‘‘Ye te, kassapa, evamāhaṃsu – ‘samaṇo gotamo sabbaṃ tapaṃ garahati, sabbaṃ tapassiṃ lūkhājīviṃ ekaṃsena upakkosati upavadatī’ti, na me te vuttavādino, abbhācikkhanti ca pana maṃ te asatā abhūtena. Idhāhaṃ, kassapa, ekaccaṃ tapassiṃ lūkhājīviṃ passāmi dibbena cakkhunā visuddhena atikkantamānusakena kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannaṃ. Idha panāhaṃ, kassapa, ekaccaṃ tapassiṃ lūkhājīviṃ passāmi dibbena cakkhunā visuddhena atikkantamānusakena kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannaṃ.",
      "english": "Those, Kassapa, who say: ‘The ascetic Gotama disparages all forms of asceticism and completely reviles and condemns all ascetics who practice harsh livelihoods,’ they do not report my words accurately, and they accuse me falsely with what is untrue and unreal. Here, Kassapa, with the purified divine eye, surpassing that of humans, I see certain ascetics with harsh livelihoods who, at the breaking up of the body, after death, are reborn in a state of woe, a bad destination, a downfall, in hell. And here, Kassapa, with the purified divine eye, surpassing that of humans, I see certain ascetics with harsh livelihoods who, at the breaking up of the body, after death, are reborn in a good destination, in a heavenly world.",
      "sinhala": "කාශ්‍යපය, යම් කිසිවෙක් ‘ශ්‍රමණ ගෞතම සියලු තපස් දොස් නගන්නේ ය, සියලුම රළු දිවි ඇති තපස්වීන් එකාන්තයෙන් නින්දා කරයි, අවමන් කරයි’ යැයි මෙසේ කියත්ද, ඔවුන් මා කී දේ කියන්නෝ නොවෙත්. ඔවුන් අසත්‍යයෙන්, අභූතයෙන් මට අපහාස කරති.\n\nකාශ්‍යපය, මෙහිලා මම පිරිසිදු වූ, මිනිස් ඇස ඉක්ම වූ දිවැසින් සමහර රළු දිවි ඇති තපස්වීන් ශරීරය බිඳී මරණයෙන් පසු අපාය නම් වූ දුගතියට, විනිපාතයට, නිරයට පැමිණ සිටිනු දකිමි.\n\nකාශ්‍යපය, එහෙත් මෙහිලා මම පිරිසිදු වූ, මිනිස් ඇස ඉක්ම වූ දිවැසින් සමහර රළු දිවි ඇති තපස්වීන් ශරීරය බිඳී මරණයෙන් පසු සුගතියට, ස්වර්ග ලෝකයට පැමිණ සිටිනු දකිමි.",
      "paliTitle": ""
    },
    {
      "number": 383,
      "pali": "‘‘Idhāhaṃ, kassapa, ekaccaṃ tapassiṃ appadukkhavihāriṃ passāmi dibbena cakkhunā visuddhena atikkantamānusakena kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannaṃ. Idha panāhaṃ, kassapa, ekaccaṃ tapassiṃ appadukkhavihāriṃ passāmi dibbena cakkhunā visuddhena atikkantamānusakena kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannaṃ. Yohaṃ, kassapa, imesaṃ tapassīnaṃ evaṃ āgatiñca gatiñca cutiñca upapattiñca yathābhūtaṃ pajānāmi, sohaṃ kiṃ sabbaṃ tapaṃ garahissāmi, sabbaṃ vā tapassiṃ lūkhājīviṃ ekaṃsena upakkosissāmi upavadissāmi?",
      "english": "Here, Kassapa, with the purified divine eye, surpassing that of humans, I see a certain ascetic, one living with little suffering, who after the breaking up of the body, beyond death, is reborn into the lower realms, a bad destination, a state of woe, even hell. But here, Kassapa, with the purified divine eye, surpassing that of humans, I see a certain ascetic, one living with little suffering, who after the breaking up of the body, beyond death, is reborn into a good destination, a heavenly world. Since I, Kassapa, truly know the coming and going, the passing away and rebirth of these ascetics, should I then blame all asceticism? Or should I, without exception, revile and denounce all ascetics who lead a harsh life?",
      "sinhala": "‘‘මෙහිදී මම, කාශ්U+200Dයපය, යම් තපස් රකින්නෙක් ස්වල්ප දුකෙන් වාසය කරමින් සිටියදී, කය බිඳීමෙන් මරණින් පසු පිරිසිදු වූ මිනිසුන් ඉක්මවූ දිව්‍ය චක්ෂුසින් අපාය, දුර්ගති, විනිපාත, නිරයට පැමිණ සිටිනවා දකිමි. මෙහිදීත් මම, කාශ්U+200Dයපය, යම් තපස් රකින්නෙක් ස්වල්ප දුකෙන් වාසය කරමින් සිටියදී, කය බිඳීමෙන් මරණින් පසු පිරිසිදු වූ මිනිසුන් ඉක්මවූ දිව්‍ය චක්ෂුසින් සුගති ස්වර්ග ලෝකයට පැමිණ සිටිනවා දකිමි. කාශ්U+200Dයපය, යම් මම මේ තපස් රකින්නන්ගේ මෙසේ පැමිණීමද, යාමද, චුති වීමද, උප්පත්තියද ඇති සැටියෙන් දනිමිද, එවැනි මම සියලුම තපස් නින්දා කරන්නෙම්ද? නැතහොත් රළු ජීවිත ඇති සියලුම තපස් රකින්නන් එකෙළෙසම දෝෂාරෝපණය කරන්නෙම්ද, නින්දා කරන්නෙම්ද?",
      "paliTitle": ""
    },
    {
      "number": 384,
      "pali": "‘‘Santi, kassapa, eke samaṇabrāhmaṇā paṇḍitā nipuṇā kataparappavādā vālavedhirūpā. Te bhindantā maññe caranti paññāgatena diṭṭhigatāni. Tehipi me saddhiṃ ekaccesu ṭhānesu sameti, ekaccesu ṭhānesu na sameti. Yaṃ te ekaccaṃ vadanti ‘sādhū’ti, mayampi taṃ ekaccaṃ vadema ‘sādhū’ti. Yaṃ te ekaccaṃ vadanti ‘na sādhū’ti, mayampi taṃ ekaccaṃ vadema ‘na sādhū’ti. Yaṃ te ekaccaṃ vadanti ‘sādhū’ti, mayaṃ taṃ ekaccaṃ vadema ‘na sādhū’ti. Yaṃ te ekaccaṃ vadanti ‘na sādhū’ti, mayaṃ taṃ ekaccaṃ vadema ‘sādhū’ti. ‘‘Yaṃ mayaṃ ekaccaṃ vadema ‘sādhū’ti, parepi taṃ ekaccaṃ vadanti ‘sādhū’ti. Yaṃ mayaṃ ekaccaṃ vadema ‘na sādhū’ti, parepi taṃ ekaccaṃ vadanti ‘na sādhū’ti. Yaṃ mayaṃ ekaccaṃ vadema ‘na sādhū’ti, pare taṃ ekaccaṃ vadanti ‘sādhū’ti. Yaṃ mayaṃ ekaccaṃ vadema ‘sādhū’ti, pare taṃ ekaccaṃ vadanti ‘na sādhū’ti.",
      "english": "There are, Kassapa, some ascetics and brahmins who are wise, skillful, who have refuted the doctrines of others, like expert archers splitting a hair. They, I believe, proceed by demolishing wrong views with their wisdom. With them, I agree on some points, and on some points I do not agree. What they say on some point is 'good', that same point we also say is 'good'. What they say on some point is 'not good', that same point we also say is 'not good'. What they say on some point is 'good', that same point we say is 'not good'. What they say on some point is 'not good', that same point we say is 'good'.\n\nWhat we say on some point is 'good', others also say that same point is 'good'. What we say on some point is 'not good', others also say that same point is 'not good'. What we say on some point is 'not good', others say that same point is 'good'. What we say on some point is 'good', others say that same point is 'not good'.",
      "sinhala": "කස්සප, සමහර ශ්‍රමණබ්‍රාහ්මණයෝ සිටිති; ඔවුහු පණ්ඩිතයෝය, නිපුණයෝය, අනුන්ගේ වාද ප්‍රතික්‍ෂේප කළෝය, හිසකෙස් බිඳින්නන් වැනියහ. ඔවුන් දෘෂ්ටිගතයන් ප්‍රඥාවෙන් බිඳිමින් හැසිරෙති යැයි මම සිතමි. ඒ අය සමඟ මගේ දෘෂ්ටි සමහර තැන්වලදී එකඟ වේ, සමහර තැන්වලදී එකඟ නොවේ.\n\nඔවුහු යමක් 'යහපත්' යැයි කියත්ද, අපිද සමහර තැන්වලදී එය 'යහපත්' යැයි කියමු. ඔවුහු යමක් 'නොයහපත්' යැයි කියත්ද, අපිද සමහර තැන්වලදී එය 'නොයහපත්' යැයි කියමු. ඔවුහු යමක් 'යහපත්' යැයි කියත්ද, අපි සමහර තැන්වලදී එය 'නොයහපත්' යැයි කියමු. ඔවුහු යමක් 'නොයහපත්' යැයි කියත්ද, අපි සමහර තැන්වලදී එය 'යහපත්' යැයි කියමු.\n\nඅපි යමක් 'යහපත්' යැයි කියමුද, අනුන් ද සමහර තැන්වලදී එය 'යහපත්' යැයි කියති. අපි යමක් 'නොයහපත්' යැයි කියමුද, අනුන් ද සමහර තැන්වලදී එය 'නොයහපත්' යැයි කියති. අපි යමක් 'නොයහපත්' යැයි කියමුද, අනුන් සමහර තැන්වලදී එය 'යහපත්' යැයි කියති. අපි යමක් 'යහපත්' යැයි කියමුද, අනුන් සමහර තැන්වලදී එය 'නොයහපත්' යැයි කියති.",
      "paliTitle": ""
    },
    {
      "number": 385,
      "pali": "‘‘Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – yesu no, āvuso, ṭhānesu na sameti, tiṭṭhantu tāni ṭhānāni. Yesu ṭhānesu sameti, tattha viññū samanuyuñjantaṃ samanugāhantaṃ samanubhāsantaṃ satthārā vā satthāraṃ saṅghena vā saṅghaṃ – ‘ye imesaṃ bhavataṃ dhammā akusalā akusalasaṅkhātā, sāvajjā sāvajjasaṅkhātā, asevitabbā asevitabbasaṅkhātā, na alamariyā na alamariyasaṅkhātā, kaṇhā kaṇhasaṅkhātā. Ko ime dhamme anavasesaṃ pahāya vattati, samaṇo vā gotamo, pare vā pana bhonto gaṇācariyā’ti?",
      "english": "I approached them and said this: ‘Friends, those points on which we do not agree, let those points remain. But on those points where we do agree, a discerning person, questioning, examining, discussing, would compare teacher with teacher, or community with community, asking: “Which of these teachings of yours are unwholesome, reckoned as unwholesome; blameworthy, reckoned as blameworthy; to be avoided, reckoned as to be avoided; not noble, reckoned as not noble; dark, reckoned as dark? Who is it that, having entirely abandoned these teachings, practices: Ascetic Gotama, or indeed the other venerable teachers of groups?”’",
      "sinhala": "එවිට මම ඔවුන් වෙත එළඹ මෙසේ කියමි: “ආයුෂ්මතුනි, අප එකඟ නොවන කරුණු එලෙසම පවතින්නට හරින්න. අප එකඟ වන කරුණු සම්බන්ධයෙන්, එහිදී නුවණැති පුද්ගලයෙක් ප්‍රශ්න කරමින්, පරීක්‍ෂා කරමින්, විමසා බලමින්, එක් ශාස්තෘවරයකු තවත් ශාස්තෘවරයකු සමඟද, එක් සංඝයක් තවත් සංඝයක් සමඟද සසඳා බලා මෙසේ අසන්නේය: ‘මේ භවත් ඔබලාගේ යම් ධර්මයන් අකුසල් නම් වූ ද, අකුසල් ලෙස සැලකෙනසුලු වූ ද, සාපරාධී නම් වූ ද, සාපරාධී ලෙස සැලකෙනසුලු වූ ද, සේවනය නොකළ යුතු නම් වූ ද, සේවනය නොකළ යුතු ලෙස සැලකෙනසුලු වූ ද, ආර්යයන්ට නුසුදුසු නම් වූ ද, ආර්යයන්ට නුසුදුසු ලෙස සැලකෙනසුලු වූ ද, කළු පැහැති නම් වූ ද, කළු පැහැති ලෙස සැලකෙනසුලු වූ ද, වේද; මේ ධර්මයන් සර්වප්‍රකාරයෙන්ම අත්හැර හැසිරෙන්නේ කවුරුන්ද? ශ්‍රමණයන් වහන්සේ වන ගෞතමයන් වහන්සේද? නැතිනම් මේ අන්‍ය භවත් ගණාචාර්යවරුන්ද?’”",
      "paliTitle": "Samanuyuñjāpanakathā",
      "englishTitle": "Discourse on Questioning",
      "sinhalaTitle": "ප්‍රශ්න කිරීමේ කථාව"
    },
    {
      "number": 386,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, kassapa, vijjati, yaṃ viññū samanuyuñjantā samanugāhantā samanubhāsantā evaṃ vadeyyuṃ – ‘ye imesaṃ bhavataṃ dhammā akusalā akusalasaṅkhātā, sāvajjā sāvajjasaṅkhātā, asevitabbā asevitabbasaṅkhātā, na alamariyā na alamariyasaṅkhātā, kaṇhā kaṇhasaṅkhātā. Samaṇo gotamo ime dhamme anavasesaṃ pahāya vattati, yaṃ vā pana bhonto pare gaṇācariyā’ti. Itiha, kassapa, viññū samanuyuñjantā samanugāhantā samanubhāsantā amheva tattha yebhuyyena pasaṃseyyuṃ.",
      "english": "It is indeed possible, Kassapa, that discerning ones, when repeatedly questioning, investigating, and discussing, would say thus: ‘Regarding these qualities, sirs, which are unwholesome and designated as unwholesome, blameworthy and designated as blameworthy, not to be cultivated and designated as not to be cultivated, not noble and designated as not noble, dark and designated as dark—the recluse Gotama lives having entirely abandoned these qualities, more so than those other revered teachers of sects.’ Thus, Kassapa, discerning ones, when repeatedly questioning, investigating, and discussing, would for the most part praise us in that regard.",
      "sinhala": "කස්සපය, මෙවන් අවස්ථාවක් ඇත්තේමය. යම් විඤ්ඤු පුද්ගලයන් විමසමින්, පරීක්ෂා කරමින්, සාකච්ඡා කරමින් මෙසේ කියනු ඇත: ‘යම් ධර්මතාවන් අකුසල වශයෙන් ගණන් ගනු ලබන්නේද, සාවද්‍ය වශයෙන් ගණන් ගනු ලබන්නේද, සේවනය නොකළ යුතු යැයි ගණන් ගනු ලබන්නේද, ආර්ය නොවන බවට ගණන් ගනු ලබන්නේද, කළු වශයෙන් ගණන් ගනු ලබන්නේද; භවත් අන්‍ය ගණාචාර්යවරුන් ගැන කුමක් කියන්නද, ශ්‍රමණ ගෞතමයන් වහන්සේ නම් ඒ ධර්මයන් අශේෂයෙන් ප්‍රහාණය කරමින් වසන සේක.‘\n\nමෙසේ කස්සපය, විඤ්ඤු පුද්ගලයන් විමසමින්, පරීක්ෂා කරමින්, සාකච්ඡා කරමින් එහිදී බොහෝ දුරට අපවම ප්‍රශංසා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 387,
      "pali": "‘‘Aparampi no, kassapa, viññū samanuyuñjantaṃ samanugāhantaṃ samanubhāsantaṃ satthārā vā satthāraṃ saṅghena vā saṅghaṃ – ‘ye imesaṃ bhavataṃ dhammā kusalā kusalasaṅkhātā, anavajjā anavajjasaṅkhātā, sevitabbā sevitabbasaṅkhātā, alamariyā alamariyasaṅkhātā, sukkā sukkasaṅkhātā. Ko ime dhamme anavasesaṃ samādāya vattati, samaṇo vā gotamo, pare vā pana bhonto gaṇācariyā’ ti?",
      "english": "And furthermore, Kassapa, for us, if a discerning person were to question, scrutinize, and discuss with the Teacher concerning the Teacher, or with the Saṅgha concerning the Saṅgha, asking: ‘Which of these teachings of yours—that are wholesome, considered wholesome; blameless, considered blameless; to be practiced, considered to be practiced; worthy of the noble ones, considered worthy of the noble ones; and bright, considered bright—who completely undertakes and practices these teachings? Is it the recluse Gotama, or are it those other venerable group leaders?’",
      "sinhala": "තවද, කස්සපය, නුවණැති අයෙක් ශාස්තෘන් වහන්සේ හෝ සංඝයා විමසමින්, පරීක්ෂා කරමින්, සාකච්ඡා කරමින් මෙසේ ප්‍රශ්න කරන විට: ‘යම් මේ ගරු කටයුතු අයගේ ධර්ම කුසල ද, කුසල යැයි සම්මත ද; නිවරද ද, නිවරද යැයි සම්මත ද; සේවනය කළ යුතු ද, සේවනය කළ යුතු යැයි සම්මත ද; ආර්යයන්ට සුදුසු ද, ආර්යයන්ට සුදුසු යැයි සම්මත ද; පිරිසිදු ද, පිරිසිදු යැයි සම්මත ද වෙත් ද, කවරෙක් ද මේ ධර්ම අවශේෂයක් නොමැතිව සමාරම්භ කරමින් වසන්නේ, ශ්‍රමණ ගෞතමයන් වහන්සේ ද, එසේ නැතිනම් අන්‍ය වූ මේ පිරිස් වල නායක ආචාර්යවරු ද’ කියා ය.",
      "paliTitle": ""
    },
    {
      "number": 388,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, kassapa, vijjati, yaṃ viññū samanuyuñjantā samanugāhantā samanubhāsantā evaṃ vadeyyuṃ – ‘ye imesaṃ bhavataṃ dhammā kusalā kusalasaṅkhātā, anavajjā anavajjasaṅkhātā, sevitabbā sevitabbasaṅkhātā, alamariyā alamariyasaṅkhātā, sukkā sukkasaṅkhātā. Samaṇo gotamo ime dhamme anavasesaṃ samādāya vattati, yaṃ vā pana bhonto pare gaṇācariyā’ti. Itiha, kassapa, viññū samanuyuñjantā samanugāhantā samanubhāsantā amheva tattha yebhuyyena pasaṃseyyuṃ.",
      "english": "Indeed, Kassapa, this is a possibility where discerning ones, when questioning, investigating, and analyzing, would say this: ‘These qualities of the Venerable One are wholesome—regarded as wholesome; blameless—regarded as blameless; to be cultivated—regarded as to be cultivated; worthy of the noble ones—regarded as worthy of the noble ones; pure—regarded as pure. The recluse Gotama fully embraces and lives by these qualities, unlike other venerable group-leaders.’ Thus, Kassapa, discerning ones, when questioning, investigating, and analyzing, would for the most part praise us in that regard.",
      "sinhala": "කාශ්‍යපය, සැබවින්ම මේ කාරණය තිබිය හැකියි, යම් හෙයකින් විඤ්ඤූ ජනයා විමසමින්, සූක්ෂමව පිරික්සමින්, සාකච්ඡා කරමින් මෙසේ කියනු ඇත: ‘මේ භාග්‍යවතුන් වහන්සේගේ ධර්මයන් කුසල යැයි සම්මත කුසල ධර්මයන් ය, නිර්වද්‍ය යැයි සම්මත නිර්වද්‍ය ධර්මයන් ය, සේවනය කළ යුතු යැයි සම්මත සේවනය කළ යුතු ධර්මයන් ය, ආර්ය යැයි සම්මත ආර්ය ධර්මයන් ය, ශුක්ල යැයි සම්මත ශුක්ල ධර්මයන් ය. ශ්‍රමණ ගෞතමයන් වහන්සේ මේ ධර්මයන් කිසිවක් ඉතිරි නොකොට සම්පූර්ණයෙන් ම සමාදන්ව වදාළ සේක, එහෙත් අනෙකුත් පූජනීය ගණාචාර්යවරුන් එසේ නොකරති.’ කාශ්‍යපය, එහෙයින්, විඤ්ඤූ ජනයා විමසමින්, සූක්ෂමව පිරික්සමින්, සාකච්ඡා කරමින් එහිදී අප වහන්සේවම බොහෝ දුරට ප්‍රශංසා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 389,
      "pali": "‘‘Aparampi no, kassapa, viññū samanuyuñjantaṃ samanugāhantaṃ samanubhāsantaṃ satthārā vā satthāraṃ saṅghena vā saṅghaṃ – ‘ye imesaṃ bhavataṃ dhammā akusalā akusalasaṅkhātā, sāvajjā sāvajjasaṅkhātā, asevitabbā asevitabbasaṅkhātā, na alamariyā na alamariyasaṅkhātā, kaṇhā kaṇhasaṅkhātā. Ko ime dhamme anavasesaṃ pahāya vattati, gotamasāvakasaṅgho vā, pare vā pana bhonto gaṇācariyasāvakasaṅghā’ti?",
      "english": "Further, Kassapa, if a discerning person were to question, probe, and examine the Teacher, or the Saṅgha: ‘Which of these states are unwholesome, reckoned as unwholesome; blameworthy, reckoned as blameworthy; not to be cultivated, reckoned as not to be cultivated; not noble, reckoned as not noble; dark, reckoned as dark? Who, having completely abandoned these states, lives accordingly—is it the community of Gotama’s disciples, or is it the communities of other teachers’ disciples?’",
      "sinhala": "තවද, කාශ්‍යප, යම් විචක්ෂණ පුද්ගලයෙක් ශාස්තෘවරයකු හෝ සංඝයා වහන්සේව විමසමින්, පරීක්ෂා කරමින්, කරුණු දක්වමින් මෙසේ අසයි නම්: ‘මේ පින්වතුන්ගේ යම් ධර‍්මයන් අකුසල යැයි සම්මත වූ, සාවද්‍ය යැයි සම්මත වූ, සේවනය නොකළ යුතු යැයි සම්මත වූ, ආර්‍ය ධර‍්මයන්ට නුසුදුසු යැයි සම්මත වූ, කළු යැයි සම්මත වූ ධර‍්මයන් වේද, කවුද මේ ධර‍්මයන් අවශේෂ නොවන ලෙස අත්හැර හැසිරෙන්නේ? ගෞතම ශ්‍රාවක සංඝයා වහන්සේද, නැතිනම් වෙනත් ගණාචාර්‍ය ශ්‍රාවක සංඝයෝද?’",
      "paliTitle": ""
    },
    {
      "number": 390,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, kassapa, vijjati, yaṃ viññū samanuyuñjantā samanugāhantā samanubhāsantā evaṃ vadeyyuṃ – ‘ye imesaṃ bhavataṃ dhammā akusalā akusalasaṅkhātā, sāvajjā sāvajjasaṅkhātā, asevitabbā asevitabbasaṅkhātā, na alamariyā na alamariyasaṅkhātā, kaṇhā kaṇhasaṅkhātā. Gotamasāvakasaṅgho ime dhamme anavasesaṃ pahāya vattati, yaṃ vā pana bhonto pare gaṇācariyasāvakasaṅghā’ti. Itiha, kassapa, viññū samanuyuñjantā samanugāhantā samanubhāsantā amheva tattha yebhuyyena pasaṃseyyuṃ.",
      "english": "It is indeed possible, Kassapa, that wise individuals, upon thorough questioning, investigation, and discussion, would declare: ‘Those qualities among you sirs that are unwholesome and considered unwholesome; blameable and considered blameable; not to be cultivated and considered not to be cultivated; ignoble and considered ignoble; dark and considered dark—the assembly of Gotama’s disciples lives having completely abandoned these qualities, unlike other assemblies of teachers' disciples, good sirs.’\n\nThus, Kassapa, wise individuals, upon thorough questioning, investigation, and discussion, would mostly praise us in that regard.",
      "sinhala": "‘‘කස්සපයෙනි, මේ අවස්ථාව පවතින්නේය. විඤ්ඤූ පුද්ගලයන් විමසමින්, පරීක්ෂා කරමින්, සාකච්ඡා කරමින් මෙසේ කියනු ඇත: ‘ඔබවහන්සේලාගේ යම් ධර්මතාවෝ අකුසල, අකුසල් යැයි සැලකෙන, සාවද්‍ය, සාවද්‍ය යැයි සැලකෙන, නොසෙවිය යුතු, නොසෙවිය යුතු යැයි සැලකෙන, ආර්යයන්ට නුසුදුසු, ආර්යයන්ට නුසුදුසු යැයි සැලකෙන, කළු වූ, කළු යැයි සැලකෙන ධර්මතාවෝ වෙත් ද, ගෞතම ශ‍්‍රාවකසංඝයා ඒ ධර්මයන් සම්පූර්ණයෙන් අත්හැර හැසිරෙයි; අන්‍ය ගණාචාර්ය ශ‍්‍රාවක සංඝයන් එසේ නොකරති.’ කස්සපයෙනි, එසේ විඤ්ඤූ පුද්ගලයන් විමසමින්, පරීක්ෂා කරමින්, සාකච්ඡා කරමින් බොහෝ දුරට අපවම එහිදී ප‍්‍රශංසා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 391,
      "pali": "‘‘Aparampi no, kassapa, viññū samanuyuñjantaṃ samanugāhantaṃ samanubhāsantaṃ satthārā vā satthāraṃ saṅghena vā saṅghaṃ. ‘Ye imesaṃ bhavataṃ dhammā kusalā kusalasaṅkhātā, anavajjā anavajjasaṅkhātā, sevitabbā sevitabbasaṅkhātā, alamariyā alamariyasaṅkhātā, sukkā sukkasaṅkhātā. Ko ime dhamme anavasesaṃ samādāya vattati, gotamasāvakasaṅgho vā, pare vā pana bhonto gaṇācariyasāvakasaṅghā’ti?",
      "english": "Furthermore, Kassapa, when a wise person questions, examines, and discusses, comparing one teacher with another teacher, or one community with another community, asking: “Which of these qualities in you, sirs, are wholesome, reckoned as wholesome; blameless, reckoned as blameless; to be cultivated, reckoned as to be cultivated; worthy of the noble ones, reckoned as worthy of the noble ones; pure, reckoned as pure? Who fully practices these qualities without remainder — is it the community of Gotama’s disciples, or, sirs, the communities of other teachers’ disciples?”",
      "sinhala": "තවද, කාශ්‍යප, අපට නුවණැති පුද්ගලයෙක්, ශාස්තෘවරුන් අතර හෝ සංඝයා වහන්සේලා අතර (පිළිවෙත) විමසමින්, පිරික්සමින්, සාකච්ඡා කරමින් මෙසේ අසයි: ‘‘මේ පින්වතුන්ගේ යම් ධර්මයක් කුසල් යැයි සැලකිය හැකි කුසල් ධර්ම වේද, නිවැරදි යැයි සැලකිය හැකි නිවැරදි ධර්ම වේද, සෙවිය යුතු යැයි සැලකිය හැකි සෙවිය යුතු ධර්ම වේද, ආර්ය ගුණවලට සුදුසු යැයි සැලකිය හැකි ආර්ය ගුණවලට සුදුසු ධර්ම වේද, පිරිසිදු යැයි සැලකිය හැකි පිරිසිදු ධර්ම වේද; කවරෙක් නම් මේ ධර්මයන් සර්වප්‍රකාරයෙන්ම මැනවින් සමාදන්ව පිළිපදින්නේද? ගෞතම ශ්‍රාවක සංඝයා වහන්සේලාද, නැතහොත් අනෙකුත් ගණාචාර්ය ශ්‍රාවක සංඝයා වහන්සේලාද යන්නයි?’’",
      "paliTitle": ""
    },
    {
      "number": 392,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, kassapa, vijjati, yaṃ viññū samanuyuñjantā samanugāhantā samanubhāsantā evaṃ vadeyyuṃ – ‘ye imesaṃ bhavataṃ dhammā kusalā kusalasaṅkhātā, anavajjā anavajjasaṅkhātā, sevitabbā sevitabbasaṅkhātā, alamariyā alamariyasaṅkhātā, sukkā sukkasaṅkhātā. Gotamasāvakasaṅgho ime dhamme anavasesaṃ samādāya vattati, yaṃ vā pana bhonto pare gaṇācariyasāvakasaṅghā’ti. Itiha, kassapa, viññū samanuyuñjantā samanugāhantā samanubhāsantā amheva tattha yebhuyyena pasaṃseyyuṃ. ",
      "english": "It is indeed possible, Kassapa, that discerning people, when questioning, scrutinizing, and discussing, would speak thus: ‘These qualities of yours—wholesome, reckoned as wholesome; blameless, reckoned as blameless; to be cultivated, reckoned as to be cultivated; noble, reckoned as noble; pure, reckoned as pure—the community of Gotama’s disciples fully embraces and practices these qualities without remainder, unlike other groups of teachers and their disciples.’ Thus, Kassapa, discerning people, when questioning, scrutinizing, and discussing, would mostly praise us concerning this.",
      "sinhala": "කස්සප, විචක්ෂණ පුද්ගලයන් කාරණා විමසමින්, පිරික්සමින්, සාකච්ඡා කරමින් මෙසේ පවසනු ලැබීමට ඉඩ ඇත: ‘යම් මේ පින්වතුන්ගේ ධර්මතා කුසල යැයි සම්මත, නිර්දෝෂී යැයි සම්මත, සේවනය කළ යුතු යැයි සම්මත, ආර්ය ගුණ යැයි සම්මත, පිරිසුදු යැයි සම්මත ධර්මතා වෙත්ද, ගෝතම ශ්‍ර‌ාවක සංඝයා වහන්සේ එම ධර්මතා අවශේෂයක් නොතබා සම්පූර්ණයෙන් සමාදන්ව පිළිපදින සේක. අන්‍ය පින්වත් ගණාචාර්ය ශ්‍ර‌ාවක සංඝයන් වහන්සේලාට වඩා එය එසේමය.’ එසේ හෙයින්, කස්සප, විචක්ෂණ පුද්ගලයන් (කාරණා) විමසමින්, පිරික්සමින්, සාකච්ඡා කරමින්, ඒ කාරණය සම්බන්ධයෙන් බොහෝ දුරට අපවම ප්‍ර‌ශංසා කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 393,
      "pali": "‘‘Atthi, kassapa, maggo atthi paṭipadā, yathāpaṭipanno sāmaṃyeva ñassati sāmaṃ dakkhati [dakkhiti (sī.)] – ‘samaṇova gotamo kālavādī bhūtavādī atthavādī dhammavādī vinayavādī’ti. Katamo ca, kassapa, maggo, katamā ca paṭipadā, yathāpaṭipanno sāmaṃyeva ñassati sāmaṃ dakkhati – ‘samaṇova gotamo kālavādī bhūtavādī atthavādī dhammavādī vinayavādī’ti? Ayameva ariyo aṭṭhaṅgiko maggo. Seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, kassapa, maggo, ayaṃ paṭipadā, yathāpaṭipanno sāmaṃyeva ñassati sāmaṃ dakkhati ‘samaṇova gotamo kālavādī bhūtavādī atthavādī dhammavādī vinayavādī’’’ti.",
      "english": "There is, Kassapa, a path, there is a practice, by practicing which one will know for oneself, one will see for oneself, that ‘the recluse Gotama speaks at the right time, speaks what is true, speaks what is beneficial, speaks about the Dhamma, and speaks about the Vinaya.’\n\nAnd what, Kassapa, is that path, what is that practice, by practicing which one will know for oneself, one will see for oneself, that ‘the recluse Gotama speaks at the right time, speaks what is true, speaks what is beneficial, speaks about the Dhamma, and speaks about the Vinaya’?\n\nIt is this Noble Eightfold Path: that is, Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration.\n\nThis, Kassapa, is the path, this is the practice, by practicing which one will know for oneself, one will see for oneself that ‘the recluse Gotama speaks at the right time, speaks what is true, speaks what is beneficial, speaks about the Dhamma, and speaks about the Vinaya.’",
      "sinhala": "කස්සප, මාර්ගයක් ඇත, ප්‍රතිපදාවක් ඇත, එය අනුගමනය කරන තැනැත්තා තමා විසින්ම දැන ගන්නේය, තමා විසින්ම දකින්නේය – ‘ගෞතම ශ්‍ර​මණයෝ කාලවාදී ය, භූතවාදී ය, අත්ථවාදී ය, ධම්මවාදී ය, විනයවාදී ය’ කියාය.\n\nකස්සප, කුමක්ද ඒ මාර්ගය, කුමක්ද ඒ ප්‍රතිපදාව, එය අනුගමනය කරන තැනැත්තා තමා විසින්ම දැන ගන්නේය, තමා විසින්ම දකින්නේය – ‘ගෞතම ශ්‍ර​මණයෝ කාලවාදී ය, භූතවාදී ය, අත්ථවාදී ය, ධම්මවාදී ය, විනයවාදී ය’ කියා?\n\nඒ නම් ආර්ය අෂ්ටාංගික මාර්ගයයි.\n\nඒ මෙසේය – සම්‍යග්දෘෂ්ටිය, සම්‍යග්සංකල්පය, සම්‍යග්වාචා, සම්‍යග්කර්මාන්තය, සම්‍යග්ආජීවය, සම්‍යග්ව්‍යායාමය, සම්‍යග්ස්මෘතිය, සම්‍යග්සමාධිය.\n\nකස්සප, මේ මාර්ගයයි, මේ ප්‍රතිපදාවයි, එය අනුගමනය කරන තැනැත්තා තමා විසින්ම දැන ගන්නේය, තමා විසින්ම දකින්නේය – ‘ගෞතම ශ්‍ර​මණයෝ කාලවාදී ය, භූතවාදී ය, අත්ථවාදී ය, ධම්මවාදී ය, විනයවාදී ය’ කියාය.",
      "paliTitle": "Ariyo aṭṭhaṅgiko maggo",
      "englishTitle": "The Noble Eight-Fold Path",
      "sinhalaTitle": "ආර්ය අෂ‍්ටාංගික මාර්ගය"
    },
    {
      "number": 394,
      "pali": "Evaṃ vutte, acelo kassapo bhagavantaṃ etadavoca – ‘‘imepi kho, āvuso gotama, tapopakkamā etesaṃ samaṇabrāhmaṇānaṃ sāmaññasaṅkhātā ca brahmaññasaṅkhātā ca. Acelako hoti, muttācāro, hatthāpalekhano, na ehibhaddantiko, na tiṭṭhabhaddantiko, nābhihaṭaṃ, na uddissakataṃ, na nimantanaṃ sādiyati. So na kumbhimukhā paṭiggaṇhāti, na kaḷopimukhā paṭiggaṇhāti, na eḷakamantaraṃ, na daṇḍamantaraṃ, na musalamantaraṃ, na dvinnaṃ bhuñjamānānaṃ, na gabbhiniyā, na pāyamānāya, na purisantaragatāya, na saṅkittīsu, na yattha sā upaṭṭhito hoti, na yattha makkhikā saṇḍasaṇḍacārinī, na macchaṃ, na maṃsaṃ, na suraṃ, na merayaṃ, na thusodakaṃ pivati. So ekāgāriko vā hoti ekālopiko, dvāgāriko vā hoti dvālopiko…pe… sattāgāriko vā hoti sattālopiko; ekissāpi dattiyā yāpeti, dvīhipi dattīhi yāpeti… sattahipi dattīhi yāpeti; ekāhikampi āhāraṃ āhāreti, dvīhikampi āhāraṃ āhāreti… sattāhikampi āhāraṃ āhāreti. Iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati.",
      "english": "When this was said, Kassapa the naked ascetic said this to the Blessed One: \"Friend Gotama, these ascetic practices are also reckoned as recluseship and brahminhood for these ascetics and brahmins. He is naked, of unrestrained conduct, licking his hands after eating; he does not come when addressed as 'Come, reverend sir,' nor does he stand when addressed as 'Stand, reverend sir.' He does not accept food brought to him, nor food prepared specifically for him, nor does he accept invitations. He does not accept food from a pot's mouth, nor from a bowl's mouth, nor across a threshold, nor across a stick, nor across a pestle. He does not accept from two people who are eating, nor from a pregnant woman, nor from a nursing woman, nor from a woman with a man between them. He does not accept food from a place where dogs are gathered, nor from where offerings are being made to many, nor from where flies are swarming. He does not eat fish, nor meat, nor drink spirits, nor strong drink, nor rice-gruel. He might take food from one house, taking one mouthful; or from two houses, taking two mouthfuls; up to taking food from seven houses, taking seven mouthfuls. He might subsist on one portion of food, or on two portions, up to seven portions of food. He might eat once a day, or once every two days, up to once every seven days. Thus, he dwells devoted to such a practice of eating at regular intervals, even up to half a month.\"",
      "sinhala": "මෙසේ කී කල්හි අචේලකස්සප භාග්‍යවතුන්ට මෙසේ කීවේය: \"ගෞතම ආයුෂ්මතුනි, මේවාද මේ ශ්‍රමණ-බ්‍රාහ්මණවරුන්ගේ ශ්‍රමණත්වය යයිද, බ්‍රාහ්මණත්වය යයිද කියනු ලබන තපස් ක‍්‍රම වෙති.\"\n\n\"ඔහු නිරුවත් වෙයි, නිදැල්ලේ හැසිරෙයි, අතින් කෑම ලෙව කා වළඳයි, 'එන්නැ'යි කී තැනට නොයයි, 'හිටිනු'යි කී තැනට නොසිටියි, තමන් වෙත ගෙනෙන ලද දේ නොපිළිගනියි, තමන් අරමුණු කොට සාදන ලද දේ නොපිළිගනියි, ආරාධනා නොපිළිගනියි.\n\nඔහු මුට්ටියක මුවින් දන් නොපිළිගනියි, වළඳක මුවින් දන් නොපිළිගනියි, එළුවන් අතරින් දන් නොපිළිගනියි, දණ්ඩක් අතරින් දන් නොපිළිගනියි, මෝල්ගසක් අතරින් දන් නොපිළිගනියි, දෙදෙනෙකු කන තැනින් දන් නොපිළිගනියි, ගැබ්ගත් තැනැත්තියකගෙන් දන් නොපිළිගනියි, කිරි බොන දරුවන් සිටින තැනැත්තියකගෙන් දන් නොපිළිගනියි, පුරුෂයෙකු හා සිටින තැනැත්තියකගෙන් දන් නොපිළිගනියි, එකතු වූ පිරිසකගෙන් දන් නොපිළිගනියි, ඔහුට සූදානම් කරන ලද තැනින් දන් නොපිළිගනියි, මැස්සන් රංචු වශයෙන් ගැවසෙන තැනින් දන් නොපිළිගනියි, මාළු අනුභව නොකරයි, මස් අනුභව නොකරයි, සුරා පානය නොකරයි, මේරය පානය නොකරයි, දහයියා මිශ‍්‍ර ජලය පානය නොකරයි. ඔහු එක් ගෙයකින් පිඬු එකක් හෝ වළඳයි, ගෙවල් දෙකකින් පිඬු දෙකක් හෝ... ගෙවල් හතකින් පිඬු හතක් හෝ වළඳයි; එක් දානයකින් හෝ යැපෙයි, දාන දෙකකින් හෝ... දාන හතකින් හෝ යැපෙයි; දිනකට වරක් හෝ ආහාර ගනියි, දින දෙකකට වරක් හෝ... දින හතකට වරක් හෝ ආහාර ගනියි. මෙවැනි අඩ මසකට වරක් පවා වාරානුකූලව ආහාර වළඳන පුරුද්දෙහි යෙදී වාසය කරයි.\"",
      "paliTitle": "Tapopakkamakathā",
      "englishTitle": "Discourse on Ascetic Endeavor",
      "sinhalaTitle": "තපස් අභික්‍රමණ කථාව"
    },
    {
      "number": 395,
      "pali": "‘‘Imepi kho, āvuso gotama, tapopakkamā etesaṃ samaṇabrāhmaṇānaṃ sāmaññasaṅkhātā ca brahmaññasaṅkhātā ca. Sākabhakkho vā hoti, sāmākabhakkho vā hoti, nīvārabhakkho vā hoti, daddulabhakkho vā hoti, haṭabhakkho vā hoti, kaṇabhakkho vā hoti, ācāmabhakkho vā hoti, piññākabhakkho vā hoti, tiṇabhakkho vā hoti, gomayabhakkho vā hoti, vanamūlaphalāhāro yāpeti pavattaphalabhojī.",
      "english": "Indeed, friend Gotama, these are also the ascetic practices of those ascetics and brahmins, which are reckoned as both asceticism and brahmin practice. One might eat vegetables, or wild millet, or wild rice, or chaff, or scummings of rice-boiling, or rice-bran, or rice-gruel scum, or oil-cake dregs, or grass, or cow-dung; or one might sustain life on roots and fruits of the forest, eating only spontaneously fallen fruits.",
      "sinhala": "ආයුෂ්මත් ගෞතමයෙනි, මේවාත් ඒ ශ්‍රමණබ්‍රාහ්මණයන්ගේ ශ්‍රමණ බවත්, බ්‍රාහ්මණ බවත් වශයෙන් සැලකෙන තපෝපක්‍රම වේ. ඔහු එළවළු, හෝ සැම ධාන්‍ය, හෝ නීවාර ධාන්‍ය, හෝ පොතු කබර, හෝ කුඩු, හෝ කහට, හෝ දියර, හෝ තලපිටි, හෝ තණකොළ, හෝ ගොම අනුභව කරයි. වනයේ වැටී ඇති මුල් ඵල අනුභව කරමින් ජීවත් වේ.",
      "paliTitle": ""
    },
    {
      "number": 396,
      "pali": "‘‘Imepi kho, āvuso gotama, tapopakkamā etesaṃ samaṇabrāhmaṇānaṃ sāmaññasaṅkhātā ca brahmaññasaṅkhātā ca. Sāṇānipi dhāreti, masāṇānipi dhāreti, chavadussānipi dhāreti, paṃsukūlānipi dhāreti, tirīṭānipi dhāreti, ajinampi dhāreti, ajinakkhipampi dhāreti, kusacīrampi dhāreti, vākacīrampi dhāreti, phalakacīrampi dhāreti, kesakambalampi dhāreti, vāḷakambalampi dhāreti, ulūkapakkhikampi dhāreti, kesamassulocakopi hoti kesamassulocanānuyogamanuyutto, ubbhaṭṭhakopi [ubbhaṭṭhikopi (ka.)] hoti āsanapaṭikkhitto, ukkuṭikopi hoti ukkuṭikappadhānamanuyutto, kaṇṭakāpassayikopi hoti kaṇṭakāpassaye seyyaṃ kappeti, phalakaseyyampi kappeti, thaṇḍilaseyyampi kappeti, ekapassayikopi hoti rajojalladharo, abbhokāsikopi hoti yathāsanthatiko, vekaṭikopi hoti vikaṭabhojanānuyogamanuyutto, apānakopi hoti apānakattamanuyutto, sāyatatiyakampi udakorohanānuyogamanuyutto viharatī’’ti.",
      "english": "Indeed, friend Gotama, these are the ascetic practices of those ascetics and brahmins, which are considered to be their reclusehood and holy life: He wears garments of coarse hemp, he wears garments of mixed fabrics, he wears charnel-ground rags, he wears rag-robes, he wears garments made from tree bark, he wears an antelope hide, he wears a strip of antelope hide, he wears a garment of kusa grass, he wears a garment of bark strips, he wears a garment of wood-strips, he wears a blanket of human hair, he wears a blanket of animal hair, he wears a blanket of owl feathers. He is one who plucks out his hair and beard, devoted to the practice of plucking out his hair and beard; he is one who stands continuously, rejecting a seat; he is one who squats, devoted to the practice of squatting; he is one who makes a bed on thorns; he makes a bed on a plank; he makes a bed on bare ground; he is one who lies only on one side, covered in dust and dirt; he is one who lives in the open air, enduring the elements wherever he happens to be; he is one who eats irregular food, devoted to the practice of eating irregular food; he is one who refrains from drinking, devoted to the practice of refraining from drinking; he lives devoted to the practice of descending into water even up to the third evening.",
      "sinhala": "ආයුෂ්මත් ගෞතමයෙනි, මේවාද ඒ සමණ බ්‍රාහ්මණයන්ගේ ශ්‍රමණභාවය සහ බ්‍රාහ්මණභාවය ලෙස සැලකෙන තපස් පිළිවෙත්ය.\n\nසණ සළුද දරයි, මිශ්‍ර තන්තු වස්ත්‍රද දරයි, මළ සිරුරුවලින් ගත් වස්ත්‍රද දරයි, පන්සූකුල වස්ත්‍රද දරයි, ගස්වල්කලම් සළුද දරයි, මුව සමද දරයි, මුව සමෙන් ගත් කඩක්ද දරයි, කුස තණකොළ වස්ත්‍රද දරයි, වල්කලම් වස්ත්‍රද දරයි, ලී පතුරු වස්ත්‍රද දරයි, කෙස්වලින් කළ කම්බලද දරයි, ලොම්වලින් කළ කම්බලද දරයි, බකමූණු පිහාටුද දරයි.\n\nතවද, කෙස් සහ රැවුල් උදුරා දමන්නෙක්ද වේ, කෙස් සහ රැවුල් උදුරා දැමීමේ පිළිවෙතෙහි යෙදෙන්නේය. ආසන ප්‍රතික්ෂේප කරමින් සිටගෙනම සිටින්නෙක්ද වේ. උක්කුටිකාසනයෙන් වාඩිවන්නෙක්ද වේ, උක්කුටිකාසනයෙන් වාඩිවීමේ පිළිවෙතෙහි යෙදෙන්නේය. කටු යහනක නිදන්නෙක්ද වේ, කටු යහනක සයනය කරයි. ලී පුවරුවකද සයනය කරයි. හිස් බිමකද සයනය කරයි. දූවිලි හා මඩ තැවරුණෙක් ලෙස එක් ඇලයකින් පමණක් නිදන්නෙක්ද වේ. යම් තැනක සිටීද එතැනම එළිමහනේ වෙසෙන්නෙක්ද වේ. අප්‍රිය ආහාර වළඳන්නෙක්ද වේ, අප්‍රිය ආහාර වළඳන පිළිවෙතෙහි යෙදෙන්නේය. ජලය පානය නොකරන්නෙක්ද වේ, ජලය පානය නොකර සිටීමේ පිළිවෙතෙහි යෙදෙන්නේය. දිනකට තුන් වරක් ජලයට බැසීමේ පිළිවෙතෙහි යෙදෙන්නේද වේ.",
      "paliTitle": ""
    },
    {
      "number": 397,
      "pali": "‘‘Acelako cepi, kassapa, hoti, muttācāro, hatthāpalekhano…pe… iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati. Tassa cāyaṃ sīlasampadā cittasampadā paññāsampadā abhāvitā hoti asacchikatā. Atha kho so ārakāva sāmaññā ārakāva brahmaññā. Yato kho, kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipi. ‘‘Sākabhakkho cepi, kassapa, hoti, sāmākabhakkho…pe… vanamūlaphalāhāro yāpeti pavattaphalabhojī. Tassa cāyaṃ sīlasampadā cittasampadā paññāsampadā abhāvitā hoti asacchikatā. Atha kho so ārakāva sāmaññā ārakāva brahmaññā. Yato kho, kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipi. ‘‘Sāṇāni cepi, kassapa, dhāreti, masāṇānipi dhāreti…pe… sāyatatiyakampi udakorohanānuyogamanuyutto viharati. Tassa cāyaṃ sīlasampadā cittasampadā paññāsampadā abhāvitā hoti asacchikatā. Atha kho so ārakāva sāmaññā ārakāva brahmaññā. Yato kho, kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipī’’ti.",
      "english": "Even if, Kassapa, one is naked, loose in conduct, licking one’s hands clean, and so forth, thus engaged in such a regulated food regimen, even for half a month; yet, for him, this perfection of virtue, perfection of mind, and perfection of wisdom remain undeveloped and unverified. Then, he is far from true renunciatehood and far from the true holy life. But when, Kassapa, a monk develops a mind of loving-kindness, free from animosity and ill-will, and through the destruction of the taints, realizes for himself in this very life, with direct knowledge, the taintless liberation of mind and liberation by wisdom, and abides therein—this monk, Kassapa, is called a true renunciate and a true holy person.\n\nEven if, Kassapa, one subsists on greens, or on millet, and so forth, living on roots and fruits from the forest, eating only fallen fruits; yet, for him, this perfection of virtue, perfection of mind, and perfection of wisdom remain undeveloped and unverified. Then, he is far from true renunciatehood and far from the true holy life. But when, Kassapa, a monk develops a mind of loving-kindness, free from animosity and ill-will, and through the destruction of the taints, realizes for himself in this very life, with direct knowledge, the taintless liberation of mind and liberation by wisdom, and abides therein—this monk, Kassapa, is called a true renunciate and a true holy person.\n\nEven if, Kassapa, one wears hempen cloth, or cloth from a cremation ground, and so forth, living engaged in the practice of bathing in water three times a day—in the evening, morning, and at noon; yet, for him, this perfection of virtue, perfection of mind, and perfection of wisdom remain undeveloped and unverified. Then, he is far from true renunciatehood and far from the true holy life. But when, Kassapa, a monk develops a mind of loving-kindness, free from animosity and ill-will, and through the destruction of the taints, realizes for himself in this very life, with direct knowledge, the taintless liberation of mind and liberation by wisdom, and abides therein—this monk, Kassapa, is called a true renunciate and a true holy person.",
      "sinhala": "කස්සප, යමෙක් නග්නව සිටියත්, ලිහිල් චාරිත්‍ර ඇතිව, අත ලෙවකමින් කමින්, මෙවැනි අර්ධමාසිකව වාරයෙන් වාරයට ආහාර භෝජන ක්‍රමයක් අනුගමනය කරමින් වාසය කළත්, ඔහුගේ මේ සීල සම්පදාව, චිත්ත සම්පදාව, ප්‍රඥා‍ සම්පදාව භාවනා නොකරන ලද්දේ, සාක්ෂාත් නොකරන ලද්දේ නම්, එසේ නම් ඔහු ශ්‍රමණයෙකු වීමෙන් දුරස් ය, බ්‍රාහ්මණයෙකු වීමෙන් දුරස් ය. කස්සප, යම් කලක භික්ෂුවක් වෛරයෙන් තොර, ව්‍යාපාදයෙන් තොර මෛත්‍රී සහගත සිත වඩයි, ආසවයන්ගේ ක්ෂය වීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරයි නම්, කස්සප, මේ භික්ෂුව ශ්‍රමණ යැයිද, බ්‍රාහ්මණ යැයිද කියනු ලැබේ.\n\nකස්සප, යමෙක් පළා භක්ෂණය කරන්නෙක් වුවත්, කුරක්කන් භක්ෂණය කරන්නෙක් වුවත්, වන මූල ඵලාහාරයෙන් යැපෙමින්, ස්වභාවිකව වැටුණු පලතුරු අනුභව කරන්නෙක් වුවත්, ඔහුගේ මේ සීල සම්පදාව, චිත්ත සම්පදාව, ප්‍රඥා‍ සම්පදාව භාවනා නොකරන ලද්දේ, සාක්ෂාත් නොකරන ලද්දේ නම්, එසේ නම් ඔහු ශ්‍රමණයෙකු වීමෙන් දුරස් ය, බ්‍රාහ්මණයෙකු වීමෙන් දුරස් ය. කස්සප, යම් කලක භික්ෂුවක් වෛරයෙන් තොර, ව්‍යාපාදයෙන් තොර මෛත්‍රී සහගත සිත වඩයි, ආසවයන්ගේ ක්ෂය වීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරයි නම්, කස්සප, මේ භික්ෂුව ශ්‍රමණ යැයිද, බ්‍රාහ්මණ යැයිද කියනු ලැබේ.\n\nකස්සප, යමෙක් හණ වස්ත්‍ර හෝ දරණ අතර, මළ සිරුරුවලින් ගලවා ගත් වස්ත්‍ර හෝ දරණ අතර, සවස් වරුවේ තුන්වන වරටත් ජලයේ ගිලී සිටීමේ පිළිවෙතෙහි යෙදී වාසය කළත්, ඔහුගේ මේ සීල සම්පදාව, චිත්ත සම්පදාව, ප්‍රඥා‍ සම්පදාව භාවනා නොකරන ලද්දේ, සාක්ෂාත් නොකරන ලද්දේ නම්, එසේ නම් ඔහු ශ්‍රමණයෙකු වීමෙන් දුරස් ය, බ්‍රාහ්මණයෙකු වීමෙන් දුරස් ය. කස්සප, යම් කලක භික්ෂුවක් වෛරයෙන් තොර, ව්‍යාපාදයෙන් තොර මෛත්‍රී සහගත සිත වඩයි, ආසවයන්ගේ ක්ෂය වීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය සහ ප්‍රඥා‍විමුක්තිය මේ ආත්මභාවයේදීම තමා විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන, එයට පැමිණ වාසය කරයි නම්, කස්සප, මේ භික්ෂුව ශ්‍රමණ යැයිද, බ්‍රාහ්මණ යැයිද කියනු ලැබේ.",
      "paliTitle": "Tapopakkamaniratthakathā",
      "englishTitle": "Useless Talk on Renouncing Asceticism",
      "sinhalaTitle": "තපස්‌ අත්හැරීමේ නිෂ්ඵල කථාව"
    },
    {
      "number": 398,
      "pali": "Evaṃ vutte, acelo kassapo bhagavantaṃ etadavoca – ‘‘dukkaraṃ, bho gotama, sāmaññaṃ dukkaraṃ brahmañña’’nti. ‘‘Pakati kho esā, kassapa, lokasmiṃ ‘dukkaraṃ sāmaññaṃ dukkaraṃ brahmañña’nti. Acelako cepi, kassapa, hoti, muttācāro, hatthāpalekhano…pe… iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati. Imāya ca, kassapa, mattāya iminā tapopakkamena sāmaññaṃ vā abhavissa brahmaññaṃ vā dukkaraṃ sudukkaraṃ, netaṃ abhavissa kallaṃ vacanāya – ‘dukkaraṃ sāmaññaṃ dukkaraṃ brahmañña’nti. ‘‘Sakkā ca panetaṃ abhavissa kātuṃ gahapatinā vā gahapatiputtena vā antamaso kumbhadāsiyāpi – ‘handāhaṃ acelako homi, muttācāro, hatthāpalekhano…pe… iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharāmī’ti. ‘‘Yasmā ca kho, kassapa, aññatreva imāya mattāya aññatra iminā tapopakkamena sāmaññaṃ vā hoti brahmaññaṃ vā dukkaraṃ sudukkaraṃ, tasmā etaṃ kallaṃ vacanāya – ‘dukkaraṃ sāmaññaṃ dukkaraṃ brahmañña’nti. Yato kho, kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipi. ‘‘Sākabhakkho cepi, kassapa, hoti, sāmākabhakkho…pe… vanamūlaphalāhāro yāpeti pavattaphalabhojī. Imāya ca, kassapa, mattāya iminā tapopakkamena sāmaññaṃ vā abhavissa brahmaññaṃ vā dukkaraṃ sudukkaraṃ, netaṃ abhavissa kallaṃ vacanāya – ‘dukkaraṃ sāmaññaṃ dukkaraṃ brahmañña’nti. ‘‘Sakkā ca panetaṃ abhavissa kātuṃ gahapatinā vā gahapatiputtena vā antamaso kumbhadāsiyāpi – ‘handāhaṃ sākabhakkho vā homi, sāmākabhakkho vā…pe… vanamūlaphalāhāro yāpemi pavattaphalabhojī’ti. ‘‘Yasmā ca kho, kassapa, aññatreva imāya mattāya aññatra iminā tapopakkamena sāmaññaṃ vā hoti brahmaññaṃ vā dukkaraṃ sudukkaraṃ, tasmā etaṃ kallaṃ vacanāya – ‘dukkaraṃ sāmaññaṃ dukkaraṃ brahmañña’nti. Yato kho, kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipi. ‘‘Sāṇāni cepi, kassapa, dhāreti, masāṇānipi dhāreti…pe… sāyatatiyakampi udakorohanānuyogamanuyutto viharati. Imāya ca, kassapa, mattāya iminā tapopakkamena sāmaññaṃ vā abhavissa brahmaññaṃ vā dukkaraṃ sudukkaraṃ, netaṃ abhavissa kallaṃ vacanāya – ‘dukkaraṃ sāmaññaṃ dukkaraṃ brahmañña’nti. ‘‘Sakkā ca panetaṃ abhavissa kātuṃ gahapatinā vā gahapatiputtena vā antamaso kumbhadāsiyāpi – ‘handāhaṃ sāṇānipi dhāremi, masāṇānipi dhāremi…pe… sāyatatiyakampi udakorohanānuyogamanuyutto viharāmī’ti. ‘‘Yasmā ca kho, kassapa, aññatreva imāya mattāya aññatra iminā tapopakkamena sāmaññaṃ vā hoti brahmaññaṃ vā dukkaraṃ sudukkaraṃ, tasmā etaṃ kallaṃ vacanāya – ‘dukkaraṃ sāmaññaṃ dukkaraṃ brahmañña’nti. Yato kho, kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipī’’ti.",
      "english": "When this was said, the naked ascetic Kassapa said to the Blessed One: “It is difficult, Venerable Gotama, to be a recluse; it is difficult to be a brahmin.” “Indeed, Kassapa, it is the common notion in the world that ‘it is difficult to be a recluse; it is difficult to be a brahmin.’ Even if, Kassapa, one is a naked ascetic, observing the custom of open defecation, licking food from the hands, and other such practices, and thus devotedly practices a regimen of eating only at half-monthly intervals. If, Kassapa, merely by such a measure and by this ascetic practice, the recluse-life or the brahmin-life were difficult, exceedingly difficult, then it would not be proper to say: ‘It is difficult to be a recluse; it is difficult to be a brahmin.’ For it would be possible for a householder or a householder’s son, or even a female slave, to do this: ‘Come, I will be a naked ascetic, observing the custom of open defecation, licking food from the hands, and other such practices, and devote myself to such a regimen of eating only at half-monthly intervals.’ But since, Kassapa, it is apart from such a measure and apart from this ascetic practice that the recluse-life or the brahmin-life is difficult, exceedingly difficult, therefore it is proper to say: ‘It is difficult to be a recluse; it is difficult to be a brahmin.’ However, Kassapa, when a monastic cultivates a mind of loving-kindness, free from enmity and ill-will, and by the destruction of the taints, directly experiences and realizes for themselves in this very life the taintless liberation of mind and liberation by wisdom, and abides therein. Such a monastic, Kassapa, is called a recluse and is also called a brahmin.”\n\n“Even if, Kassapa, one subsists on vegetables, or on millet, and other such foods, or lives on forest roots and fruits, eating only fallen fruits. If, Kassapa, merely by such a measure and by this ascetic practice, the recluse-life or the brahmin-life were difficult, exceedingly difficult, then it would not be proper to say: ‘It is difficult to be a recluse; it is difficult to be a brahmin.’ For it would be possible for a householder or a householder’s son, or even a female slave, to do this: ‘Come, I will subsist on vegetables, or on millet, and other such foods, or live on forest roots and fruits, eating only fallen fruits.’ But since, Kassapa, it is apart from such a measure and apart from this ascetic practice that the recluse-life or the brahmin-life is difficult, exceedingly difficult, therefore it is proper to say: ‘It is difficult to be a recluse; it is difficult to be a brahmin.’ However, Kassapa, when a monastic cultivates a mind of loving-kindness, free from enmity and ill-will, and by the destruction of the taints, directly experiences and realizes for themselves in this very life the taintless liberation of mind and liberation by wisdom, and abides therein. Such a monastic, Kassapa, is called a recluse and is also called a brahmin.”\n\n“Even if, Kassapa, one wears hempen clothes, or coarse hempen clothes, and other such coarse garments, or devotedly practices a regimen of bathing in water three times a day: in the evening, morning, and at noon. If, Kassapa, merely by such a measure and by this ascetic practice, the recluse-life or the brahmin-life were difficult, exceedingly difficult, then it would not be proper to say: ‘It is difficult to be a recluse; it is difficult to be a brahmin.’ For it would be possible for a householder or a householder’s son, or even a female slave, to do this: ‘Come, I will wear hempen clothes, or coarse hempen clothes, and other such coarse garments, or devote myself to a regimen of bathing in water three times a day: in the evening, morning, and at noon.’ But since, Kassapa, it is apart from such a measure and apart from this ascetic practice that the recluse-life or the brahmin-life is difficult, exceedingly difficult, therefore it is proper to say: ‘It is difficult to be a recluse; it is difficult to be a brahmin.’ However, Kassapa, when a monastic cultivates a mind of loving-kindness, free from enmity and ill-will, and by the destruction of the taints, directly experiences and realizes for themselves in this very life the taintless liberation of mind and liberation by wisdom, and abides therein. Such a monastic, Kassapa, is called a recluse and is also called a brahmin.”",
      "sinhala": "මෙසේ කී කල්හි, අචේලක කාශ්‍යප භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: \"භවත් ගෞතමයනි, ශ්‍රමණභාවය දුෂ්කරය, බ්‍රාහ්මණභාවය දුෂ්කරය.\"\n\n\"කාශ්‍යපය, 'ශ්‍රමණභාවය දුෂ්කරය, බ්‍රාහ්මණභාවය දුෂ්කරය' යනු ලෝකයේ සාමාන්‍ය කතාවකි. කාශ්‍යපය, යමෙක් නග්නව, ලිහිල් හැසිරීමෙන් යුක්තව, අත් ලෙවකමින්... (පෙ) ... මෙවැනි වරින් වර ලැබෙන ආහාර අනුභව කිරීමේ අනුයෝගයක අර්ධ මාසයක් වුවත් යෙදී වාසය කරයි. කාශ්‍යපය, මේ පමණකින් සහ මේ තපස් පිළිවෙතින් ශ්‍රමණභාවය හෝ බ්‍රාහ්මණභාවය දුෂ්කර හෝ ඉතා දුෂ්කර වන්නේ නම්, 'ශ්‍රමණභාවය දුෂ්කරය, බ්‍රාහ්මණභාවය දුෂ්කරය' යැයි පැවසීම සුදුසු නොවන්නේය. ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ දාසියකට වුවත් මෙය කළ හැකි වන්නේය: 'එන්න, මම නග්න වන්නෙමි, ලිහිල් හැසිරීමෙන් යුක්ත වන්නෙමි, අත් ලෙවකමින්... (පෙ) ... මෙවැනි වරින් වර ලැබෙන ආහාර අනුභව කිරීමේ අනුයෝගයක අර්ධ මාසයක් වුවත් යෙදී වාසය කරන්නෙමි' යි. එහෙත් කාශ්‍යපය, මේ පමණකින් සහ මේ තපස් පිළිවෙතින් බැහැරව ශ්‍රමණභාවය හෝ බ්‍රාහ්මණභාවය දුෂ්කර හෝ ඉතා දුෂ්කර වන හෙයින්, 'ශ්‍රමණභාවය දුෂ්කරය, බ්‍රාහ්මණභාවය දුෂ්කරය' යැයි පැවසීම සුදුසු වන්නේය. කාශ්‍යපය, යම් කලෙක භික්ෂුවක් වෛරයෙන් තොර, ව්‍යාපාදයෙන් තොර මෛත්‍රී සහගත සිතක් වඩයිද, ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්මය තුළම තමන් විසින්ම අවබෝධ කර ප්‍රත්‍යක්ෂ කොට එයට පැමිණ වාසය කරයිද, කාශ්‍යපය, මේ භික්ෂුව ශ්‍රමණයෙකු ලෙසද, බ්‍රාහ්මණයෙකු ලෙසද කියනු ලැබේ.\"\n\n\"කාශ්‍යපය, යමෙක් එළවළු අනුභව කරන්නේ නම්, වල් සහල් අනුභව කරන්නේ නම්... (පෙ) ... වන මුල්-පල ආහාරයට ගනිමින්, බිම වැටුණු පලතුරු අනුභව කරමින් යැපෙන්නේ නම්. කාශ්‍යපය, මේ පමණකින් සහ මේ තපස් පිළිවෙතින් ශ්‍රමණභාවය හෝ බ්‍රාහ්මණභාවය දුෂ්කර හෝ ඉතා දුෂ්කර වන්නේ නම්, 'ශ්‍රමණභාවය දුෂ්කරය, බ්‍රාහ්මණභාවය දුෂ්කරය' යැයි පැවසීම සුදුසු නොවන්නේය. ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ දාසියකට වුවත් මෙය කළ හැකි වන්නේය: 'එන්න, මම එළවළු අනුභව කරන්නෙමි, හෝ වල් සහල් අනුභව කරන්නෙමි... (පෙ) ... වන මුල්-පල ආහාරයට ගනිමින්, බිම වැටුණු පලතුරු අනුභව කරමින් යැපෙන්නෙමි' යි. එහෙත් කාශ්‍යපය, මේ පමණකින් සහ මේ තපස් පිළිවෙතින් බැහැරව ශ්‍රමණභාවය හෝ බ්‍රාහ්මණභාවය දුෂ්කර හෝ ඉතා දුෂ්කර වන හෙයින්, 'ශ්‍රමණභාවය දුෂ්කරය, බ්‍රාහ්මණභාවය දුෂ්කරය' යැයි පැවසීම සුදුසු වන්නේය. කාශ්‍යපය, යම් කලෙක භික්ෂුවක් වෛරයෙන් තොර, ව්‍යාපාදයෙන් තොර මෛත්‍රී සහගත සිතක් වඩයිද, ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්මය තුළම තමන් විසින්ම අවබෝධ කර ප්‍රත්‍යක්ෂ කොට එයට පැමිණ වාසය කරයිද, කාශ්‍යපය, මේ භික්ෂුව ශ්‍රමණයෙකු ලෙසද, බ්‍රාහ්මණයෙකු ලෙසද කියනු ලැබේ.\"\n\n\"කාශ්‍යපය, යමෙක් හණ රෙදි අඳින්නේ නම්, සොහොන් රෙදිද අඳින්නේ නම්... (පෙ) ... සවස තුන් වරක් වුවත් ජලයට බැසීමේ අනුයෝගයක යෙදී වාසය කරයි. කාශ්‍යපය, මේ පමණකින් සහ මේ තපස් පිළිවෙතින් ශ්‍රමණභාවය හෝ බ්‍රාහ්මණභාවය දුෂ්කර හෝ ඉතා දුෂ්කර වන්නේ නම්, 'ශ්‍රමණභාවය දුෂ්කරය, බ්‍රාහ්මණභාවය දුෂ්කරය' යැයි පැවසීම සුදුසු නොවන්නේය. ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ දාසියකට වුවත් මෙය කළ හැකි වන්නේය: 'එන්න, මම හණ රෙදිද අඳින්නෙමි, සොහොන් රෙදිද අඳින්නෙමි... (පෙ) ... සවස තුන් වරක් වුවත් ජලයට බැසීමේ අනුයෝගයක යෙදී වාසය කරන්නෙමි' යි. එහෙත් කාශ්‍යපය, මේ පමණකින් සහ මේ තපස් පිළිවෙතින් බැහැරව ශ්‍රමණභාවය හෝ බ්‍රාහ්මණභාවය දුෂ්කර හෝ ඉතා දුෂ්කර වන හෙයින්, 'ශ්‍රමණභාවය දුෂ්කරය, බ්‍රාහ්මණභාවය දුෂ්කරය' යැයි පැවසීම සුදුසු වන්නේය. කාශ්‍යපය, යම් කලෙක භික්ෂුවක් වෛරයෙන් තොර, ව්‍යාපාදයෙන් තොර මෛත්‍රී සහගත සිතක් වඩයිද, ආශ්‍රවයන්ගේ ක්ෂය වීමෙන් ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මේ දැක්වෙන ධර්මය තුළම තමන් විසින්ම අවබෝධ කර ප්‍රත්‍යක්ෂ කොට එයට පැමිණ වාසය කරයිද, කාශ්‍යපය, මේ භික්ෂුව ශ්‍රමණයෙකු ලෙසද, බ්‍රාහ්මණයෙකු ලෙසද කියනු ලැබේ.\"",
      "paliTitle": ""
    },
    {
      "number": 399,
      "pali": "Evaṃ vutte, acelo kassapo bhagavantaṃ etadavoca – ‘‘dujjāno, bho gotama, samaṇo, dujjāno brāhmaṇo’’ti. ‘‘Pakati kho esā, kassapa, lokasmiṃ ‘dujjāno samaṇo dujjāno brāhmaṇo’ti. Acelako cepi, kassapa, hoti, muttācāro, hatthāpalekhano…pe… iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharati. Imāya ca, kassapa, mattāya iminā tapopakkamena samaṇo vā abhavissa brāhmaṇo vā dujjāno sudujjāno, netaṃ abhavissa kallaṃ vacanāya – ‘dujjāno samaṇo dujjāno brāhmaṇo’ti. ‘‘Sakkā ca paneso abhavissa ñātuṃ gahapatinā vā gahapatiputtena vā antamaso kumbhadāsiyāpi – ‘ayaṃ acelako hoti, muttācāro, hatthāpalekhano…pe… iti evarūpaṃ addhamāsikampi pariyāyabhattabhojanānuyogamanuyutto viharatī’ti. ‘‘Yasmā ca kho, kassapa, aññatreva imāya mattāya aññatra iminā tapopakkamena samaṇo vā hoti brāhmaṇo vā dujjāno sudujjāno, tasmā etaṃ kallaṃ vacanāya – ‘dujjāno samaṇo dujjāno brāhmaṇo’ti. Yato kho [yato ca kho (ka.)], kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipi. ‘‘Sākabhakkho cepi, kassapa, hoti sāmākabhakkho…pe… vanamūlaphalāhāro yāpeti pavattaphalabhojī. Imāya ca, kassapa, mattāya iminā tapopakkamena samaṇo vā abhavissa brāhmaṇo vā dujjāno sudujjāno, netaṃ abhavissa kallaṃ vacanāya – ‘dujjāno samaṇo dujjāno brāhmaṇo’ti. ‘‘Sakkā ca paneso abhavissa ñātuṃ gahapatinā vā gahapatiputtena vā antamaso kumbhadāsiyāpi – ‘ayaṃ sākabhakkho vā hoti sāmākabhakkho…pe… vanamūlaphalāhāro yāpeti pavattaphalabhojī’ti. ‘‘Yasmā ca kho, kassapa, aññatreva imāya mattāya aññatra iminā tapopakkamena samaṇo vā hoti brāhmaṇo vā dujjāno sudujjāno, tasmā etaṃ kallaṃ vacanāya – ‘dujjāno samaṇo dujjāno brāhmaṇo’ti. Yato kho, kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipi. ‘‘Sāṇāni cepi, kassapa, dhāreti, masāṇānipi dhāreti…pe… sāyatatiyakampi udakorohanānuyogamanuyutto viharati. Imāya ca, kassapa, mattāya iminā tapopakkamena samaṇo vā abhavissa brāhmaṇo vā dujjāno sudujjāno, netaṃ abhavissa kallaṃ vacanāya – ‘dujjāno samaṇo dujjāno brāhmaṇo’ti. ‘‘Sakkā ca paneso abhavissa ñātuṃ gahapatinā vā gahapatiputtena vā antamaso kumbhadāsiyāpi – ‘ayaṃ sāṇānipi dhāreti, masāṇānipi dhāreti…pe… sāyatatiyakampi udakorohanānuyogamanuyutto viharatī’ti. ‘‘Yasmā ca kho, kassapa, aññatreva imāya mattāya aññatra iminā tapopakkamena samaṇo vā hoti brāhmaṇo vā dujjāno sudujjāno, tasmā etaṃ kallaṃ vacanāya – ‘dujjāno samaṇo dujjāno brāhmaṇo’ti. Yato kho, kassapa, bhikkhu averaṃ abyāpajjaṃ mettacittaṃ bhāveti, āsavānañca khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayaṃ vuccati, kassapa, bhikkhu samaṇo itipi brāhmaṇo itipī’’ti. ",
      "english": "When this was said, the naked ascetic Kassapa said to the Blessed One, “It is difficult to discern a contemplative, friend Gotama, difficult to discern a brahman.”\n\n“That is indeed the way of the world, Kassapa, that ‘a contemplative is difficult to discern, a brahman is difficult to discern.’\n\nIf, Kassapa, someone is a naked ascetic, who is accustomed to licking his hands, and undertakes such a practice of eating food obtained by rotation, even for half a month, and dwells thus,\n\nif a contemplative or a brahman were difficult—or very difficult—to discern merely by such a degree of ascetic practice, it would not be right to say, ‘a contemplative is difficult to discern, a brahman is difficult to discern.’\n\nFor he could be known even by a householder, or a householder's son, or even by a pot-slave woman: ‘This one is a naked ascetic, who is accustomed to licking his hands, and lives undertaking such a practice of eating food obtained by rotation, even for half a month.’\n\nBut since, Kassapa, it is apart from such a degree of ascetic practice that a contemplative or a brahman is difficult—or very difficult—to discern, therefore it is right to say, ‘a contemplative is difficult to discern, a brahman is difficult to discern.’\n\nWhen, Kassapa, a bhikkhu cultivates a mind of loving-kindness, free from enmity and ill-will, and by the destruction of the influxes, having realized for himself through direct knowledge in this very life the Stainless Liberation of Mind and Liberation by Wisdom, free from influxes, he enters and dwells therein,\n\nthis, Kassapa, is called a bhikkhu who is a contemplative and also a brahman.\n\nIf, Kassapa, a person eats only vegetables, or eats only coarse grains, or lives on forest roots and fruits, eating only fallen fruits, and dwells thus,\n\nif a contemplative or a brahman were difficult—or very difficult—to discern merely by such a degree of ascetic practice, it would not be right to say, ‘a contemplative is difficult to discern, a brahman is difficult to discern.’\n\nFor he could be known even by a householder, or a householder's son, or even by a pot-slave woman: ‘This one eats only vegetables, or eats only coarse grains, or lives on forest roots and fruits, eating only fallen fruits.’\n\nBut since, Kassapa, it is apart from such a degree of ascetic practice that a contemplative or a brahman is difficult—or very difficult—to discern, therefore it is right to say, ‘a contemplative is difficult to discern, a brahman is difficult to discern.’\n\nWhen, Kassapa, a bhikkhu cultivates a mind of loving-kindness, free from enmity and ill-will, and by the destruction of the influxes, having realized for himself through direct knowledge in this very life the Stainless Liberation of Mind and Liberation by Wisdom, free from influxes, he enters and dwells therein,\n\nthis, Kassapa, is called a bhikkhu who is a contemplative and also a brahman.\n\nIf, Kassapa, a person wears coarse hempen cloth, or wears grave shrouds, or lives in the practice of descending into water thrice daily—morning, noon, and evening—and dwells thus,\n\nif a contemplative or a brahman were difficult—or very difficult—to discern merely by such a degree of ascetic practice, it would not be right to say, ‘a contemplative is difficult to discern, a brahman is difficult to discern.’\n\nFor he could be known even by a householder, or a householder's son, or even by a pot-slave woman: ‘This one wears coarse hempen cloth, or wears grave shrouds, or lives in the practice of descending into water thrice daily—morning, noon, and evening.’\n\nBut since, Kassapa, it is apart from such a degree of ascetic practice that a contemplative or a brahman is difficult—or very difficult—to discern, therefore it is right to say, ‘a contemplative is difficult to discern, a brahman is difficult to discern.’\n\nWhen, Kassapa, a bhikkhu cultivates a mind of loving-kindness, free from enmity and ill-will, and by the destruction of the influxes, having realized for himself through direct knowledge in this very life the Stainless Liberation of Mind and Liberation by Wisdom, free from influxes, he enters and dwells therein,\n\nthis, Kassapa, is called a bhikkhu who is a contemplative and also a brahman.",
      "sinhala": "මෙසේ පැවසූ කල්හි, අචේලක කාශ්‍යප භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය: \"භවත් ගෞතමයන් වහන්සේ, ශ්‍රමණයෙකු හඳුනා ගැනීම අපහසුය, බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසුය.\" \"කාශ්‍යපයෙනි, 'ශ්‍රමණයෙකු හඳුනා ගැනීම අපහසුය, බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසුය' යන්න ලෝකයේ සාමාන්‍ය ස්වභාවයයි.\" \"කාශ්‍යපයෙනි, යම්කිසි අයෙක් නිරුවත්ව වාසය කරන්නේ නම්, මුත්‍රා ආහාර කොට ගන්නේ නම්, අත පිරිමදිමින් ආහාර ගන්නේ නම්... ආදී වශයෙන් මේ ආකාරයේ අඩමසක් පාසා වරින් වර ලැබෙන ආහාර අනුභව කිරීමේ නිරතව ජීවත් වන්නේ නම්. කාශ්‍යපයෙනි, මේ තරමේ (එනම්, බාහිර) තපස් ක්‍රමයකින් ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසු හෝ ඉතා අපහසු වේ නම්, 'ශ්‍රමණයෙකු හඳුනා ගැනීම අපහසුය, බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසුය' යැයි පැවසීම සුදුසු නොවනු ඇත. මක්නිසාද යත්, එවිට ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ අන්තිම වශයෙන් කුඹුරේ දාසියකට වුවද, 'මොහු නිරුවත්ය, මුත්‍රා ආහාරයෙන් යැපෙයි, අත පිරිමදිමින් ආහාර ගනී... ආදී වශයෙන් අඩමසකට වරක් ලැබෙන ආහාරය අනුභව කිරීමේ යෙදී වාසය කරයි' යැයි දැන ගැනීමට හැකි වනු ඇත. කාශ්‍යපයෙනි, යම් හෙයකින් මේ තරමේ (බාහිර) තපස් ක්‍රමයකින් තොරව ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසු හෝ ඉතා අපහසු වේද, එබැවින් 'ශ්‍රමණයෙකු හඳුනා ගැනීම අපහසුය, බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසුය' යැයි පැවසීම සුදුසුය. කාශ්‍යපයෙනි, යම් කලක භික්ෂුවක් වෛර රහිත, ව්‍යාපාද රහිත මෛත්‍රී චිත්තයක් වර්ධනය කරයිද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දිට්ඨධම්මයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කරගෙන පසක් කරගෙන වාසය කරයිද, කාශ්‍යපයෙනි, මේ භික්ෂුව ශ්‍රමණයා යැයිද, බ්‍රාහ්මණයා යැයිද කියනු ලැබේ.\n\nකාශ්‍යපයෙනි, යම්කිසි අයෙක් ශාක භක්‍ෂයෙක් වේ නම්, සාමාක භක්‍ෂයෙක් වේ නම්... ආදී වශයෙන් වන මූල ඵලාහාරයෙන් යැපෙන්නේ නම්, ස්වයංව හටගත් ඵල ආහාරයට ගන්නේ නම්. කාශ්‍යපයෙනි, මේ තරමේ (එනම්, බාහිර) තපස් ක්‍රමයකින් ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසු හෝ ඉතා අපහසු වේ නම්, 'ශ්‍රමණයෙකු හඳුනා ගැනීම අපහසුය, බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසුය' යැයි පැවසීම සුදුසු නොවනු ඇත. මක්නිසාද යත්, එවිට ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ අන්තිම වශයෙන් කුඹුරේ දාසියකට වුවද, 'මොහු ශාක භක්‍ෂයෙක් හෝ සාමාක භක්‍ෂයෙක් වේ... ආදී වශයෙන් වන මූල ඵලාහාරයෙන් යැපෙයි, ස්වයංව හටගත් ඵල ආහාරයට ගනී' යැයි දැන ගැනීමට හැකි වනු ඇත. කාශ්‍යපයෙනි, යම් හෙයකින් මේ තරමේ (බාහිර) තපස් ක්‍රමයකින් තොරව ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසු හෝ ඉතා අපහසු වේද, එබැවින් 'ශ්‍රමණයෙකු හඳුනා ගැනීම අපහසුය, බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසුය' යැයි පැවසීම සුදුසුය. කාශ්‍යපයෙනි, යම් කලක භික්ෂුවක් වෛර රහිත, ව්‍යාපාද රහිත මෛත්‍රී චිත්තයක් වර්ධනය කරයිද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දිට්ඨධම්මයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කරගෙන පසක් කරගෙන වාසය කරයිද, කාශ්‍යපයෙනි, මේ භික්ෂුව ශ්‍රමණයා යැයිද, බ්‍රාහ්මණයා යැයිද කියනු ලැබේ.\n\nකාශ්‍යපයෙනි, යම්කිසි අයෙක් සණ වස්ත්‍ර දරන්නේ නම්, මසණ වස්ත්‍ර දරන්නේ නම්... ආදී වශයෙන් සවසද ඇතුළුව දිනකට තෙවරක් ජලයේ ගිලී සිටීමේ නිරතව වාසය කරන්නේ නම්. කාශ්‍යපයෙනි, මේ තරමේ (එනම්, බාහිර) තපස් ක්‍රමයකින් ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසු හෝ ඉතා අපහසු වේ නම්, 'ශ්‍රමණයෙකු හඳුනා ගැනීම අපහසුය, බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසුය' යැයි පැවසීම සුදුසු නොවනු ඇත. මක්නිසාද යත්, එවිට ගෘහපතියෙකුට හෝ ගෘහපති පුත්‍රයෙකුට හෝ අන්තිම වශයෙන් කුඹුරේ දාසියකට වුවද, 'මොහු සණ වස්ත්‍රද දරයි, මසණ වස්ත්‍රද දරයි... ආදී වශයෙන් සවසද ඇතුළුව දිනකට තෙවරක් ජලයේ ගිලී සිටීමේ නිරතව වාසය කරයි' යැයි දැන ගැනීමට හැකි වනු ඇත. කාශ්‍යපයෙනි, යම් හෙයකින් මේ තරමේ (බාහිර) තපස් ක්‍රමයකින් තොරව ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසු හෝ ඉතා අපහසු වේද, එබැවින් 'ශ්‍රමණයෙකු හඳුනා ගැනීම අපහසුය, බ්‍රාහ්මණයෙකු හඳුනා ගැනීම අපහසුය' යැයි පැවසීම සුදුසුය. කාශ්‍යපයෙනි, යම් කලක භික්ෂුවක් වෛර රහිත, ව්‍යාපාද රහිත මෛත්‍රී චිත්තයක් වර්ධනය කරයිද, ආශ්‍රවයන් ක්ෂය කිරීමෙන් ආශ්‍රව රහිත වූ චේතෝවිමුක්තිය හා ප්‍රඥාවිමුක්තිය මේ දිට්ඨධම්මයේදීම තමා විසින්ම විශේෂ ඥානයෙන් අවබෝධ කරගෙන පසක් කරගෙන වාසය කරයිද, කාශ්‍යපයෙනි, මේ භික්ෂුව ශ්‍රමණයා යැයිද, බ්‍රාහ්මණයා යැයිද කියනු ලැබේ.",
      "paliTitle": ""
    },
    {
      "number": 400,
      "pali": "Evaṃ vutte, acelo kassapo bhagavantaṃ etadavoca – ‘‘katamā pana sā, bho gotama, sīlasampadā, katamā cittasampadā, katamā paññāsampadā’’ti? ‘‘Idha, kassapa, tathāgato loke uppajjati arahaṃ, sammāsambuddho…pe… (yathā 190-193 anucchedesu, evaṃ vitthāretabbaṃ) bhayadassāvī samādāya sikkhati sikkhāpadesu, kāyakammavacīkammena samannāgato kusalena parisuddhājīvo sīlasampanno indriyesu guttadvāro satisampajaññena samannāgato santuṭṭho.",
      "english": "When this was said, the naked ascetic Kassapa said to the Blessed One, \"But good Gotama, what is this perfection in morality, what is this perfection in concentration, and what is this perfection in wisdom?\" \"Here, Kassapa, a Tathagata arises in the world, an Arahant, a Fully Self-Enlightened One, perfect in true knowledge and conduct, sublime, knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, a Buddha, a Blessed One. He, seeing danger (in unwholesome states), undertakes and trains in the precepts. He is endowed with wholesome bodily and verbal action, has a purified livelihood, is accomplished in virtue, has guarded doors of the senses, is endowed with mindfulness and clear comprehension, and is contented.\"",
      "sinhala": "මෙසේ කී කල්හි, අචේල කස්සප භාග්‍යවතුන් වහන්සේට මෙය කීවේය: 'ගෞතමයන් වහන්ස, ඒ සීල සම්පදාය කුමක්ද? චිත්ත සම්පදාය කුමක්ද? ප්‍රඥා සම්පදාය කුමක්ද?' භාග්‍යවතුන් වහන්සේ වදාළ සේක: 'කස්සප, මේ ලෝකයේ තථාගතයන් වහන්සේ අරහත් වූ, සම්මා සම්බුද්ධ වූ තත්ත්වයෙන් පහළ වී ධර්මය දේශනා කරන සේක. යමෙක් සසර දුකෙහි භය දකිනසුලු වී, හික්මීමේ පදයන් සමාදන්ව හික්මෙන්නේද, යහපත් වූ කය කර්මයෙන් හා වචී කර්මයෙන් යුක්ත වන්නේද, පිරිසුදු ආජීවනයක් ඇත්තෙක් වන්නේද, සීල සම්පන්න වන්නේද, ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර ඇත්තෙක් වන්නේද, සිහියෙන් හා සම්පජඤ්ඤයෙන් යුක්ත වන්නේද, සන්තුෂ්ටියට පත් වන්නේද.'",
      "paliTitle": "Sīlasamādhipaññāsampadā",
      "englishTitle": "Perfection of Morality, Concentration, Wisdom",
      "sinhalaTitle": "ශීල සමාධි ප්‍ර‌ඥා සම්‌පදා"
    },
    {
      "number": 401,
      "pali": "‘‘Kathañca, kassapa, bhikkhu sīlasampanno hoti? Idha, kassapa, bhikkhu pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati. Idampissa hoti sīlasampadāya …pe… (yathā 194 yāva 210 anucchedesu) ‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti. Seyyathidaṃ – santikammaṃ paṇidhikammaṃ…pe… (yathā 211 anucchede) osadhīnaṃ patimokkho iti vā iti, evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasampadāya. ‘‘Sa kho so [ayaṃ kho (ka.)], kassapa, bhikkhu evaṃ sīlasampanno na kutoci bhayaṃ samanupassati, yadidaṃ sīlasaṃvarato. Seyyathāpi, kassapa, rājā khattiyo muddhāvasitto nihatapaccāmitto na kutoci bhayaṃ samanupassati, yadidaṃ paccatthikato. Evameva kho, kassapa, bhikkhu evaṃ sīlasampanno na kutoci bhayaṃ samanupassati, yadidaṃ sīlasaṃvarato. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṃ anavajjasukhaṃ paṭisaṃvedeti. Evaṃ kho, kassapa, bhikkhu sīlasampanno hoti. Ayaṃ kho, kassapa, sīlasampadā…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Idampissa hoti cittasampadāya…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Idampissa hoti cittasampadāya. Ayaṃ kho, kassapa, cittasampadā. ‘‘So evaṃ samāhite citte…pe… ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti…pe… idampissa hoti paññāsampadāya…pe… nāparaṃ itthattāyāti pajānāti…pe… idampissa hoti paññāsampadāya. Ayaṃ kho, kassapa, paññāsampadā. ‘‘Imāya ca, kassapa, sīlasampadāya cittasampadāya paññāsampadāya aññā sīlasampadā cittasampadā paññāsampadā uttaritarā vā paṇītatarā vā natthi.",
      "english": "How, Kassapa, is a bhikkhu accomplished in virtue? Here, Kassapa, a bhikkhu, having abandoned the taking of life, abstains from the taking of life; he has laid aside stick and weapon, is conscientious, full of compassion, and dwells with sympathy for the welfare of all living beings. This is a part of his accomplishment in virtue, as are all the other aspects of wholesome conduct that are taught. Furthermore, there are some recluses and brahmins who, having eaten food offered out of faith, maintain themselves by such debased arts, by wrong livelihood. That is to say: performing appeasements, making vows, and various other practices up to the releasing of medicines. He abstains from such debased arts, from wrong livelihood. This too is a part of his accomplishment in virtue.\n\nIndeed, Kassapa, that bhikkhu, being thus accomplished in virtue, sees no danger from any quarter, as far as the restraint of virtue is concerned. Just as, Kassapa, an anointed warrior king, having subdued his enemies, sees no danger from any quarter, as far as enemies are concerned. In the same way, Kassapa, a bhikkhu thus accomplished in virtue sees no danger from any quarter, as far as the restraint of virtue is concerned. Possessing this noble aggregate of virtue, he experiences an inner blameless happiness. Thus, Kassapa, a bhikkhu is accomplished in virtue. This, Kassapa, is the accomplishment in virtue. Furthermore, he enters and dwells in the first absorption, which is a part of his accomplishment in mind. He also enters and dwells in the second absorption, the third absorption, and the fourth absorption. This too is a part of his accomplishment in mind. This, Kassapa, is the accomplishment in mind.\n\nWith his mind thus concentrated, he directs and inclines his mind to knowledge and vision. This is a part of his accomplishment in wisdom. He then understands: ‘There is no further existence for me in this state of being.’ This too is a part of his accomplishment in wisdom. This, Kassapa, is the accomplishment in wisdom.\n\nAnd Kassapa, there is no other accomplishment in virtue, accomplishment in mind, or accomplishment in wisdom that is superior or more excellent than this accomplishment in virtue, accomplishment in mind, and accomplishment in wisdom.",
      "sinhala": "කස්සපය, භික්ෂුව සීලසම්පන්න වන්නේ කෙසේද? කස්සපය, මෙහිලා භික්ෂුව ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකී, දඬුමුගුරු බහා තබා, අවි ආයුධ බහා තබා, ලජ්ජාශීලීව, දයාවෙන් යුතුව, සියලු සත්වයන් කෙරෙහි හිතානුකම්පාවෙන් යුතුව වාසය කරයි. මෙය ඔහුගේ සීලසම්පදාව වේ. යම්සේ ඇතැම් ගෞරවනීය ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙවැනි තිරිසන් විද්‍යාවන්ගෙන් යුතු මිථ්‍යා ආජීවයෙන් ජීවිකාව ගෙන යත්. එනම් – ශාන්තිකර්ම කිරීම, ප්‍රාර්ථනා ඉටුකරදීම, ඖෂධ මුදාහැරීම යනාදී මෙවැනි තිරිසන් විද්‍යාවන්ගෙන් යුතු මිථ්‍යා ආජීවයෙන් ඔහු වැළකී සිටියි. මෙයද ඔහුගේ සීලසම්පදාව වේ.\n\nකස්සපය, මෙසේ සීලසම්පන්න වූ ඒ භික්ෂුව සීලසංවරය හේතුවෙන් කිසි තැනකින් භයක් නොදකියි. කස්සපය, යම්සේ අභිෂේක ලද, සතුරන් පරදවන ලද ක්ෂත්‍රිය රජෙක් සතුරන්ගෙන් කිසි තැනකින් භයක් නොදකියිද, එපරිද්දෙන්ම කස්සපය, මෙසේ සීලසම්පන්න වූ භික්ෂුව සීලසංවරය හේතුවෙන් කිසි තැනකින් භයක් නොදකියි. හෙතෙම මේ ආර්ය ශීලස්කන්ධයෙන් යුක්තව අභ්‍යන්තරයේ කිලිටි නැති සැපයක් විඳියි. කස්සපය, මෙසේ භික්ෂුව සීලසම්පන්න වේ. කස්සපය, මෙය සීලසම්පදාවයි. ඔහු පළමු ධ්‍යානයට පැමිණ වාසය කරයි. මෙය ඔහුගේ චිත්තසම්පදාව වේ. දෙවන ධ්‍යානයට, තෙවන ධ්‍යානයට, සිව්වන ධ්‍යානයට පැමිණ වාසය කරයි. මෙය ඔහුගේ චිත්තසම්පදාව වේ. කස්සපය, මෙය චිත්තසම්පදාවයි.\n\nහෙතෙම මෙසේ සමාහිත සිතින් යුක්තව, ඥාණදර්ශනය පිණිස සිත යොමු කරයි, නමාලයි. මෙය ඔහුගේ ප්‍රඥාසම්පදාව වේ. නැවත මෙබඳු බවකට පැමිණීමක් නැතැයි ප්‍රඥාවෙන් දනී. මෙය ඔහුගේ ප්‍රඥාසම්පදාව වේ. කස්සපය, මෙය ප්‍රඥාසම්පදාවයි.\n\nකස්සපය, මේ සීලසම්පදාවට, චිත්තසම්පදාවට, ප්‍රඥාසම්පදාවට වඩා උසස් වූ හෝ ප්‍රණීත වූ වෙනත් සීලසම්පදාවක්, චිත්තසම්පදාවක්, ප්‍රඥාසම්පදාවක් නොමැත.",
      "paliTitle": ""
    },
    {
      "number": 402,
      "pali": "‘‘Santi, kassapa, eke samaṇabrāhmaṇā sīlavādā. Te anekapariyāyena sīlassa vaṇṇaṃ bhāsanti. Yāvatā, kassapa, ariyaṃ paramaṃ sīlaṃ, nāhaṃ tattha attano samasamaṃ samanupassāmi, kuto bhiyyo! Atha kho ahameva tattha bhiyyo, yadidaṃ adhisīlaṃ. ‘‘Santi, kassapa, eke samaṇabrāhmaṇā tapojigucchāvādā. Te anekapariyāyena tapojigucchāya vaṇṇaṃ bhāsanti. Yāvatā, kassapa, ariyā paramā tapojigucchā, nāhaṃ tattha attano samasamaṃ samanupassāmi, kuto bhiyyo! Atha kho ahameva tattha bhiyyo, yadidaṃ adhijegucchaṃ. ‘‘Santi, kassapa, eke samaṇabrāhmaṇā paññāvādā. Te anekapariyāyena paññāya vaṇṇaṃ bhāsanti. Yāvatā, kassapa, ariyā paramā paññā, nāhaṃ tattha attano samasamaṃ samanupassāmi, kuto bhiyyo! Atha kho ahameva tattha bhiyyo, yadidaṃ adhipaññaṃ. ‘‘Santi, kassapa, eke samaṇabrāhmaṇā vimuttivādā. Te anekapariyāyena vimuttiyā vaṇṇaṃ bhāsanti. Yāvatā, kassapa, ariyā paramā vimutti, nāhaṃ tattha attano samasamaṃ samanupassāmi, kuto bhiyyo! Atha kho ahameva tattha bhiyyo, yadidaṃ adhivimutti.",
      "english": "Kassapa, there are some ascetics and brahmins who are advocates of virtue. They speak in many ways praising virtue. However far, Kassapa, noble supreme virtue extends, I do not perceive anyone equal to myself in that, let alone superior! Rather, I am superior in that, which is higher virtue.\n\nKassapa, there are some ascetics and brahmins who are advocates of asceticism and purity. They speak in many ways praising asceticism and purity. However far, Kassapa, noble supreme asceticism and purity extends, I do not perceive anyone equal to myself in that, let alone superior! Rather, I am superior in that, which is higher purity.\n\nKassapa, there are some ascetics and brahmins who are advocates of wisdom. They speak in many ways praising wisdom. However far, Kassapa, noble supreme wisdom extends, I do not perceive anyone equal to myself in that, let alone superior! Rather, I am superior in that, which is higher wisdom.\n\nKassapa, there are some ascetics and brahmins who are advocates of liberation. They speak in many ways praising liberation. However far, Kassapa, noble supreme liberation extends, I do not perceive anyone equal to myself in that, let alone superior! Rather, I am superior in that, which is higher liberation.",
      "sinhala": "කාශ්‍යපය, සමහර ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ ශීලවාදීහු වෙති. ඔවුහු නොයෙක් ආකාරයෙන් ශීලයේ ගුණය ප්‍රශංසා කරති. කාශ්‍යපය, යම්තාක් ආර්ය පරම ශීලයක් වේද, එහි මා හා සම කෙනෙකු හෝ මට නොපෙනේ, මා හට වඩා උසස් කෙනෙකු කොයින්ද! නමුත් එහිදී අධිශීලය නම් වූ මාමය උසස් වෙමි.\n\nකාශ්‍යපය, සමහර ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ තපස් හා පිළිකුළු කිරීමෙහි වදන් කියන්නෝ වෙති. ඔවුහු නොයෙක් ආකාරයෙන් තපස් හා පිළිකුළු කිරීමේ ගුණය ප්‍රශංසා කරති. කාශ්‍යපය, යම්තාක් ආර්ය පරම තපස් හා පිළිකුළු කිරීමක් වේද, එහි මා හා සම කෙනෙකු හෝ මට නොපෙනේ, මා හට වඩා උසස් කෙනෙකු කොයින්ද! නමුත් එහිදී අධිජිගුච්ඡාව නම් වූ මාමය උසස් වෙමි.\n\nකාශ්‍යපය, සමහර ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ ප්‍රඥාවාදීහු වෙති. ඔවුහු නොයෙක් ආකාරයෙන් ප්‍රඥාවේ ගුණය ප්‍රශංසා කරති. කාශ්‍යපය, යම්තාක් ආර්ය පරම ප්‍රඥාවක් වේද, එහි මා හා සම කෙනෙකු හෝ මට නොපෙනේ, මා හට වඩා උසස් කෙනෙකු කොයින්ද! නමුත් එහිදී අධිප්‍රඥාව නම් වූ මාමය උසස් වෙමි.\n\nකාශ්‍යපය, සමහර ශ්‍රමණයෝ සහ බ්‍රාහ්මණයෝ විමුක්තිවාදීහු වෙති. ඔවුහු නොයෙක් ආකාරයෙන් විමුක්තියේ ගුණය ප්‍රශංසා කරති. කාශ්‍යපය, යම්තාක් ආර්ය පරම විමුක්තියක් වේද, එහි මා හා සම කෙනෙකු හෝ මට නොපෙනේ, මා හට වඩා උසස් කෙනෙකු කොයින්ද! නමුත් එහිදී අධිවිමුක්තිය නම් වූ මාමය උසස් වෙමි.",
      "paliTitle": "Sīhanādakathā",
      "englishTitle": "Story of the Lion's Roar",
      "sinhalaTitle": "සිංහනාද කථාව"
    },
    {
      "number": 403,
      "pali": "‘‘Ṭhānaṃ kho panetaṃ, kassapa, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘sīhanādaṃ kho samaṇo gotamo nadati, tañca kho suññāgāre nadati, no parisāsū’ti. Te – ‘mā heva’ntissu vacanīyā. ‘Sīhanādañca samaṇo gotamo nadati, parisāsu ca nadatī’ti evamassu, kassapa, vacanīyā. ‘‘Ṭhānaṃ kho panetaṃ, kassapa, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘sīhanādañca samaṇo gotamo nadati, parisāsu ca nadati, no ca kho visārado nadatī’ti. Te – ‘mā heva’ntissu vacanīyā. ‘Sīhanādañca samaṇo gotamo nadati, parisāsu ca nadati, visārado ca nadatī’’ti evamassu, kassapa, vacanīyā. ‘‘Ṭhānaṃ kho panetaṃ, kassapa, vijjati, yaṃ aññatitthiyā paribbājakā evaṃ vadeyyuṃ – ‘sīhanādañca samaṇo gotamo nadati, parisāsu ca nadati, visārado ca nadati, no ca kho naṃ pañhaṃ pucchanti…pe… pañhañca naṃ pucchanti; no ca kho nesaṃ pañhaṃ puṭṭho byākaroti…pe… pañhañca nesaṃ puṭṭho byākaroti; no ca kho pañhassa veyyākaraṇena cittaṃ ārādheti…pe… pañhassa ca veyyākaraṇena cittaṃ ārādheti; no ca kho sotabbaṃ maññanti…pe… sotabbañcassa maññanti; no ca kho sutvā pasīdanti…pe… sutvā cassa pasīdanti; no ca kho pasannākāraṃ karonti…pe… pasannākārañca karonti; no ca kho tathattāya paṭipajjanti…pe… tathattāya ca paṭipajjanti; no ca kho paṭipannā ārādhentī’ti. Te – ‘mā heva’ntissu vacanīyā. ‘Sīhanādañca samaṇo gotamo nadati, parisāsu ca nadati, visārado ca nadati, pañhañca naṃ pucchanti, pañhañca nesaṃ puṭṭho byākaroti, pañhassa ca veyyākaraṇena cittaṃ ārādheti, sotabbañcassa maññanti, sutvā cassa pasīdanti, pasannākārañca karonti, tathattāya ca paṭipajjanti, paṭipannā ca ārādhentī’ti evamassu, kassapa, vacanīyā.",
      "english": "It is possible, Kassapa, that ascetics of other sects might say, ‘The recluse Gotama roars his lion’s roar, but he roars it in an empty house, not in assemblies.’ They should not be spoken to thus. Rather, Kassapa, they should be spoken to thus: ‘The recluse Gotama roars his lion’s roar, and he roars it in assemblies.’\n\nIt is possible, Kassapa, that ascetics of other sects might say, ‘The recluse Gotama roars his lion’s roar, and he roars it in assemblies, but he does not roar it with confidence.’ They should not be spoken to thus. Rather, Kassapa, they should be spoken to thus: ‘The recluse Gotama roars his lion’s roar, and he roars it in assemblies, and he roars it with confidence.’\n\nIt is possible, Kassapa, that ascetics of other sects might say, ‘The recluse Gotama roars his lion’s roar, and he roars it in assemblies, and he roars it with confidence, yet they do not question him on a problem; and even if they do question him on a problem, yet being questioned, he does not answer them; and even if being questioned, he does answer them, yet by his answer to the problem, he does not win over their minds; and even if by his answer to the problem, he does win over their minds, yet they do not consider it worth listening to him; and even if they do consider it worth listening to him, yet having listened, they do not become confident; and even if having listened, they do become confident, yet they do not act in accordance with their confidence; and even if they do act in accordance with their confidence, yet they do not practice for that very state; and even if they do practice for that very state, yet having practiced, they do not realize the goal.’ They should not be spoken to thus. Rather, Kassapa, they should be spoken to thus: ‘The recluse Gotama roars his lion’s roar, and he roars it in assemblies, and he roars it with confidence, and they do question him on a problem, and being questioned, he does answer them, and by his answer to the problem, he does win over their minds, and they do consider it worth listening to him, and having listened, they do become confident, and they do act in accordance with their confidence, and they do practice for that very state, and having practiced, they do realize the goal.’",
      "sinhala": "කාශ්‍යපයෙනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ‘ගෝතම ශ්‍රමණයෝ සිංහනාද කරනවා, එහෙත් ඒ සිංහනාදය කරන්නේ හිස් තැන් වලයි, සභා මැද නොවෙයි’ යැයි මෙසේ කියන අවස්ථාවක් තිබිය හැකිය. ඔවුන්ට ‘එසේ නොවේවා’ යැයි නොකිය යුතුය. ‘ගෝතම ශ්‍රමණයෝ සිංහනාදත් කරනවා, සභා මැදත් කරනවා’ කියා කාශ්‍යපයෙනි, ඔවුනට කිය යුතුයි.\n\nකාශ්‍යපයෙනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ‘ගෝතම ශ්‍රමණයෝ සිංහනාදත් කරනවා, සභා මැදත් කරනවා, එහෙත් නිර්භීතව සිංහනාද කරන්නේ නැහැ’ යැයි මෙසේ කියන අවස්ථාවක් තිබිය හැකිය. ඔවුන්ට ‘එසේ නොවේවා’ යැයි නොකිය යුතුය. ‘ගෝතම ශ්‍රමණයෝ සිංහනාදත් කරනවා, සභා මැදත් කරනවා, නිර්භීතවත් කරනවා’ කියා කාශ්‍යපයෙනි, ඔවුනට කිය යුතුයි.\n\nකාශ්‍යපයෙනි, අන්‍ය තීර්ථක පරිබ්‍රාජකයෝ ‘ගෝතම ශ්‍රමණයෝ සිංහනාදත් කරනවා, සභා මැදත් කරනවා, නිර්භීතවත් කරනවා, එහෙත් ඔහුගෙන් ප්‍රශ්න නො අසති, ප්‍රශ්න ඇසූ විට ඔහු ඒ ප්‍රශ්න විස්තර නො කරයි, ප්‍රශ්නය විසඳීමෙන් සිත් සතුටු නො කරයි, එය ඇසිය යුතු යැයි නො සිතති, අසා ප්‍රසාදයට පත් නො වෙති, පැහැදුණු බව නො පෙන්වති, ඒ තත්ත්වය පිණිස පිළිවෙත් නො පුරති, පිළිවෙත් පිරූ අය ඵලය සාක්ෂාත් නො කරති’ යැයි මෙසේ කියන අවස්ථාවක් තිබිය හැකිය. ඔවුන්ට ‘එසේ නොවේවා’ යැයි නොකිය යුතුය. ‘ගෝතම ශ්‍රමණයෝ සිංහනාදත් කරනවා, සභා මැදත් කරනවා, නිර්භීතවත් කරනවා, ඔහුගෙන් ප්‍රශ්නත් අසති, ප්‍රශ්න ඇසූ විට ඔහු ඒ ප්‍රශ්න විස්තරත් කරයි, ප්‍රශ්නය විසඳීමෙන් සිත් සතුටුත් කරයි, එය ඇසිය යුතු යැයි සිතති, අසා ප්‍රසාදයටත් පත් වෙති, පැහැදුණු බවත් පෙන්වති, ඒ තත්ත්වය පිණිස පිළිවෙතුත් පුරති, පිළිවෙත් පිරූ අය ඵලය සාක්ෂාත් කරති’ කියා කාශ්‍යපයෙනි, ඔවුනට කිය යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 404,
      "pali": "‘‘Ekamidāhaṃ, kassapa, samayaṃ rājagahe viharāmi gijjhakūṭe pabbate. Tatra maṃ aññataro tapabrahmacārī nigrodho nāma adhijegucche pañhaṃ apucchi. Tassāhaṃ adhijegucche pañhaṃ puṭṭho byākāsiṃ. Byākate ca pana me attamano ahosi paraṃ viya mattāyā’’ti. ‘‘Ko hi, bhante, bhagavato dhammaṃ sutvā na attamano assa paraṃ viya mattāya? Ahampi hi, bhante, bhagavato dhammaṃ sutvā attamano paraṃ viya mattāya. Abhikkantaṃ, bhante, abhikkantaṃ, bhante. Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāmi, dhammañca bhikkhusaṅghañca. Labheyyāhaṃ, bhante, bhagavato santike pabbajjaṃ, labheyyaṃ upasampada’’nti.",
      "english": "On one occasion, Kassapa, I was residing in Rājagaha, on Vulture Peak Mountain. There, a certain ascetic named Nigrodha asked me a question concerning extreme ascetic practices. When he questioned me concerning extreme ascetic practices, I answered him. And when I had explained, he was excessively delighted, beyond measure.\n\nIndeed, Venerable Sir, who would not be excessively delighted beyond measure after hearing the Dhamma of the Blessed One? I too, Venerable Sir, am excessively delighted beyond measure after hearing the Dhamma of the Blessed One. Excellent, Venerable Sir! Excellent, Venerable Sir! Just as, Venerable Sir, one might set upright what was overturned, or reveal what was hidden, or show the way to one who is lost, or hold up a lamp in the darkness so that those with sight may see forms; in the same way, the Dhamma has been made clear by the Blessed One in various ways. I here and now, Venerable Sir, go for refuge to the Blessed One, to the Dhamma, and to the Sangha of monks. May I obtain the going forth in the presence of the Blessed One, Venerable Sir; may I obtain the full ordination.",
      "sinhala": "කස්සප, එක් කලෙක මම රජගහ නුවර ගිජ්ඣකූට පර්වතයේ වාසය කළෙමි. එහිදී නිග්‍රෝධ නම් වූ එක් තපස්වී බ්‍රාහ්මණයෙක් අධිජෙගුච්ඡය ගැන ප්‍රශ්නයක් මාගෙන් විමසීය. අධිජෙගුච්ඡය ගැන ප්‍රශ්නය ඇසූ ඔහුට මම එය පැහැදිලි කළෙමි. මා විසින් එය පැහැදිලි කරන ලද කල්හි ඔහු අතිශයින් සතුටු විය.\n\nභන්තේ, භාග්‍යවතුන් වහන්සේගේ ධර්මය ශ්‍රවණය කොට අතිශයින් සතුටු නොවන්නේ කවුරුන් ද? භන්තේ, මා පවා භාග්‍යවතුන් වහන්සේගේ ධර්මය ශ්‍රවණය කොට අතිශයින් සතුටු වූයෙමි. ඉතා යහපත් ය, භන්තේ, ඉතා යහපත් ය, භන්තේ. භන්තේ, යම් සේ යටිකුරු කරන ලද්දක් උඩුකුරු කරන්නේ ද, වසා තබන ලද්දක් විවෘත කරන්නේ ද, මං මුළා වූවෙකුට මග පෙන්වන්නේ ද, ඇස් ඇත්තන්ට රූප දැක්මට හැකි වන සේ අඳුරේ තෙල් පහනක් දල්වන්නේ ද; එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ විසින් නෙක අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. භන්තේ, මම මේ දැන් භාග්‍යවතුන් වහන්සේ සරණ යමි, ධර්මය ද, භික්ෂු සංඝයා ද සරණ යමි. භන්තේ, මට භාග්‍යවතුන් වහන්සේ ළඟ පැවිද්ද ලැබේවා, උපසම්පදාව ද ලැබේවා.",
      "paliTitle": "Titthiyaparivāsakathā",
      "englishTitle": "Story of Heretics' Probation",
      "sinhalaTitle": "තීර්ථක පරිවාස කථාව"
    },
    {
      "number": 405,
      "pali": "‘‘Yo kho, kassapa, aññatitthiyapubbo imasmiṃ dhammavinaye ākaṅkhati pabbajjaṃ, ākaṅkhati upasampadaṃ, so cattāro māse parivasati, catunnaṃ māsānaṃ accayena āraddhacittā bhikkhū pabbājenti, upasampādenti bhikkhubhāvāya. Api ca mettha puggalavemattatā viditā’’ti. ‘‘Sace, bhante, aññatitthiyapubbā imasmiṃ dhammavinaye ākaṅkhanti pabbajjaṃ, ākaṅkhanti upasampadaṃ, cattāro māse parivasanti, catunnaṃ māsānaṃ accayena āraddhacittā bhikkhū pabbājenti, upasampādenti bhikkhubhāvāya. Ahaṃ cattāri vassāni parivasissāmi, catunnaṃ vassānaṃ accayena āraddhacittā bhikkhū pabbājentu, upasampādentu bhikkhubhāvāyā’’ti. Alattha kho acelo kassapo bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno kho panāyasmā kassapo eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto na cirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti – abbhaññāsi. Aññataro kho panāyasmā kassapo arahataṃ ahosīti. ",
      "english": "‘‘Indeed, Kassapa, whoever was formerly of another sect and desires ordination and full admission in this Dhamma and Discipline, he dwells on probation for four months. After the lapse of four months, the bhikkhus whose minds are agreeable ordain him and give him full admission to the state of a bhikkhu. And here, indeed, the difference in individuals is known.’’ ‘‘If, venerable sir, those formerly of another sect who desire ordination and full admission in this Dhamma and Discipline dwell on probation for four months, and after the lapse of four months, the bhikkhus whose minds are agreeable ordain them and give them full admission to the state of a bhikkhu, I will dwell on probation for four years. After the lapse of four years, let the bhikkhus whose minds are agreeable ordain me and give me full admission to the state of a bhikkhu.’’ Indeed, the ascetic Kassapa received the ordination from the Blessed One, and he received full admission. Not long after his full admission, venerable Kassapa, dwelling alone, secluded, diligent, ardent, and resolute, before long realized with direct knowledge in this very life that unsurpassed culmination of the holy life for the sake of which noble sons rightly go forth from home to homelessness, and having realized it, he dwelt. He declared: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.’ Indeed, venerable Kassapa became one of the Arahants.",
      "sinhala": "“කාශ්‍යපය, යමෙක් පෙර වෙනත් තීර්ථකයෙක්ව සිට මේ ධර්ම-විනයෙහි පැවිද්ද ද, උපසම්පදාව ද අපේක්ෂා කරන්නේ නම්, ඔහු සිව් මසක් පරිවාස වරයෙහි සිටිය යුතුයි. සිව් මසක් ඉක්ම වූ පසු, (ඔහු කෙරෙහි) පැහැදුණු සිත් ඇති භික්‍ෂූහු ඔහුව පැවිදි කරති; භික්‍ෂුභාවය පිණිස උපසම්පදා කරති. එසේ වුවත්, මෙහි පුද්ගලයන්ගේ විශේෂත්‍වය ද දන්නා ලද්දකි.”\n\n“ස්වාමීනි, යම් හෙයකින් පෙර වෙනත් තීර්ථකයෝ මේ ධර්ම-විනයෙහි පැවිද්ද ද, උපසම්පදාව ද අපේක්ෂා කරති නම්, සිව් මසක් පරිවාස වරයෙහි සිටිති නම්, සිව් මසක් ඉක්ම වූ පසු පැහැදුණු සිත් ඇති භික්‍ෂූහු පැවිදි කෙරෙත්වා, භික්‍ෂුභාවය පිණිස උපසම්පදා කෙරෙත්වා. මම සිව් වසක් පරිවාස වරයෙහි හිඳින්නෙමි. සිව් වසක් ඉක්ම වූ පසු පැහැදුණු සිත් ඇති භික්‍ෂූහු පැවිදි කෙරෙත්වා, භික්‍ෂුභාවය පිණිස උපසම්පදා කෙරෙත්වා!”\n\nඅචේල කාශ්‍යප තෙමේ භාග්‍යවතුන් වහන්සේ සමීපයෙහි පැවිද්ද ද, උපසම්පදාව ද ලැබුවේය. එසේ උපසම්පදා වී වැඩි කලක් නොගිය ආයුෂ්මත් කාශ්‍යප තෙමේ එකලාව, අප්‍රමාදීව, වීර්යවත්ව, උත්සාහවත්ව වාසය කරමින් වැඩි කලක් නොගොස්ම – යම් අර්ථයක් පිණිස කුල පුත්‍රයෝ මනාකොට ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වෙත් ද, ඒ අනුත්තර වූ බ්‍රහ්මචාරී ජීවිතයේ අවසානය මේ දැහැමෙහිම තමන් විසින්ම අභිඥාවෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට, සම්පූර්ණ කොට වාසය කළේය. ‘ජාතිය ක්‍ෂ‍ය විය, බ්‍රහ්මචාරී ජීවිතය සම්පූර්ණ කරන ලදී, කළ යුතු දේ කරන ලදී, මේ සඳහා අන් කිසිවක් නැත’ යැයි ඔහු අවබෝධ කළේය. එසේම ආයුෂ්මත් කාශ්‍යප තෙමේ අරහතුන් වහන්සේ නමක් බවට පත් විය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Mahāsīhanādasuttaṃ niṭṭhitaṃ aṭṭhamaṃ.",
    "english": "The Eighth Great Discourse on the Lion's Roar",
    "sinhala": "අටවැනි මහාසීහනාද සූත්‍රය නිමි"
  }
}