{
  "id": "dn.1.4",
  "title": {
    "pali": "Soṇadaṇḍasuttaṃ",
    "english": "The Soṇadaṇḍa Sutta",
    "sinhala": "සෝණදණ්ඩසූත්‍\\u200Dරය"
  },
  "sections": [
    {
      "number": 300,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena campā tadavasari. Tatra sudaṃ bhagavā campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Tena kho pana samayena soṇadaṇḍo brāhmaṇo campaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ raññā māgadhena seniyena bimbisārena dinnaṃ rājadāyaṃ brahmadeyyaṃ.",
      "english": "Thus have I heard – At one time the Blessed One, while wandering in Anga together with a large monastic community of some five hundred monastics, arrived at Campa. There, indeed, the Blessed One dwelt in Campa, on the bank of Gaggara’s lotus pond. Now at that time, the brahmin Sonadanda was dwelling in Campa, a populous, prosperous place with grass, wood, and water, rich in grain, a royal endowment, a royal grant, a gift to brahmins, given by King Seniya Bimbisara of Magadha.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍ය‌වතුන් වහන්සේ අංග ජනපදයේ චාරිකාවේ වඩමින්, පන්සියයක් පමණ වූ මහත් භික්ෂු සංඝයා සමඟ චම්පා නගරයට වැඩිය සේක. එකල්හි භාග්‍ය‌වතුන් වහන්සේ චම්පා නගරයෙහි ගග්ගරා පොකුණේ තීරයෙහි වැඩසිටින සේක. එකල්හි සෝණදණ්ඩ බ්‍රා‌හ්මණයා, ජනගහණයෙන් පිරී ඇති, තණකොළ, දර, ජලය බහුල වූ, ධාන්‍ය‌ සම්පතින් යුක්ත වූ, රජුට භුක්ති විඳීමට හිමි වූ, මගධ රට අධිපති සේනිය බිම්බිසාර රජු විසින් දෙන ලද රජ දායාදයක් වූ, බ්‍රහ්ම දානයක් බඳු වූ එම චම්පා නගරයෙහි වාසය කරයි.",
      "paliTitle": "Campeyyakabrāhmaṇagahapatikā",
      "englishTitle": "Campeyya Brahmins and Householders",
      "sinhalaTitle": "චම්පෙය්‍යක බ‍්‍රාහ්මණ ගහපතියෝ"
    },
    {
      "number": 301,
      "pali": "Assosuṃ kho campeyyakā brāhmaṇagahapatikā – ‘‘samaṇo khalu bho gotamo sakyaputto sakyakulā pabbajito aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti. Atha kho campeyyakā brāhmaṇagahapatikā campāya nikkhamitvā saṅghasaṅghī [saṅghā saṅghī (sī. syā. pī.)] gaṇībhūtā yena gaggarā pokkharaṇī tenupasaṅkamanti.",
      "english": "The brahmin householders of Campā heard: “Indeed, revered Śamaṇa Gotama, the son of the Sakyas, gone forth from the Sakya clan, traveling through Anga with a large community of monks, about five hundred monks, has arrived in Campā and is residing there on the bank of the Gaggara Lake. Indeed, concerning that Venerable Gotama, such a noble report has arisen: ‘The Blessed One is an Arahant, a Fully Self-Enlightened One, perfect in knowledge and conduct, a Fortunate One, knower of the worlds, unsurpassable trainer of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.’ He, having himself directly realized by direct knowledge this world with its deities, Māras, and Brahmās, this generation with its śamaṇas and brahmins, its gods and humans, proclaims it. He teaches the Dhamma that is excellent in the beginning, excellent in the middle, and excellent in the end. He proclaims the holy life, complete and pure in its meaning and its letter. Indeed, it is good to see such Arahants.”\n\nThen, the brahmin householders of Campā, having departed from Campā, in groups and throngs, approached the Gaggara Lake.",
      "sinhala": "චම්පෙය්‍යක බ්‍රාහ්මණ ගෘහපතිවරු අසා සිටියහ – ‘‘භවත් ගෞතම ශ්‍රමණයෝ, ශාක්‍ය පුත්‍රයෝ, ශාක්‍ය කුලයෙන් පැවිදිව, අංග දේශයේ චාරිකාවේ යෙදෙමින්, පන්සියයකට අධික මහා භික්‍ෂුසංඝයා සමඟ චම්පා නුවරට පැමිණ, එහි ගග්ගරා පොකුණ අසල වාසය කරති. ඒ භවත් ගෞතමයන් වහන්සේ පිළිබඳව මෙබඳු යහපත් කීර්ති ඝෝෂාවක් පැතිර ඇත – ‘ඒ භාග්‍යවතුන් වහන්සේ අරහත් වන සේක, සම්මා සම්බුද්ධ වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තර පුරිසදම්මසාරථී වන සේක, දෙවිමිනිසුන්ගේ ශාස්තෘ වන සේක, බුද්ධ වන සේක, භාග්‍යවතුන් වහන්සේ වන සේක’ යි. උන්වහන්සේ මේ ලෝකය දෙවියන් සහිතව, මරුන් සහිතව, බ්‍රහ්මයන් සහිතව, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත ප්‍රජාව සහිතව, දෙවිමිනිසුන් සහිතව, තමන් විසින්ම අභිඥාවෙන් අවබෝධ කොට ප්‍රකාශ කරන සේක. උන්වහන්සේ ආදිකල්‍යාණ, මධ්‍යකල්‍යාණ, පරියෝසානකල්‍යාණ, අර්ථ සහිත, ව්‍යංජන සහිත, මුළුමනින්ම පරිපූර්ණ, පිරිසිදු වූ බ්‍රහ්මචාරී ධර්මය දේශනා කොට ප්‍රකාශ කරන සේක. ඒ ආදරණීය රහතන් වහන්සේලා දැකීම සුදුසු දෙයක් වේ යැයි.’’\n\nඑවිට චම්පෙය්‍යක බ්‍රාහ්මණ ගෘහපතිවරු චම්පා නුවරින් නික්ම, සමූහ වශයෙන් එක්ව, ගග්ගරා පොකුණ තිබූ තැනට පැමිණියහ.",
      "paliTitle": ""
    },
    {
      "number": 302,
      "pali": "Tena kho pana samayena soṇadaṇḍo brāhmaṇo uparipāsāde divāseyyaṃ upagato hoti. Addasā kho soṇadaṇḍo brāhmaṇo campeyyake brāhmaṇagahapatike campāya nikkhamitvā saṅghasaṅghī [saṅghe saṅghī (sī. pī.) saṅghā saṅghī (syā.)] gaṇībhūte yena gaggarā pokkharaṇī tenupasaṅkamante. Disvā khattaṃ āmantesi – ‘‘kiṃ nu kho, bho khatte, campeyyakā brāhmaṇagahapatikā campāya nikkhamitvā saṅghasaṅghī gaṇībhūtā yena gaggarā pokkharaṇī tenupasaṅkamantī’’ti? ‘‘Atthi kho, bho, samaṇo gotamo sakyaputto sakyakulā pabbajito aṅgesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Tamete bhavantaṃ gotamaṃ dassanāya upasaṅkamantī’’ti. ‘‘Tena hi, bho khatte, yena campeyyakā brāhmaṇagahapatikā tenupasaṅkama, upasaṅkamitvā campeyyake brāhmaṇagahapatike evaṃ vadehi – ‘soṇadaṇḍo, bho, brāhmaṇo evamāha – āgamentu kira bhavanto, soṇadaṇḍopi brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’’ti. ‘‘Evaṃ, bho’’ti kho so khattā soṇadaṇḍassa brāhmaṇassa paṭissutvā yena campeyyakā brāhmaṇagahapatikā tenupasaṅkami; upasaṅkamitvā campeyyake brāhmaṇagahapatike etadavoca – ‘‘soṇadaṇḍo bho brāhmaṇo evamāha – ‘āgamentu kira bhavanto, soṇadaṇḍopi brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’’ti.",
      "english": "Now at that time, the brahmin Sonadanda was taking his midday rest on the upper story of his palace. The brahmin Sonadanda saw the brahmin householders of Campa, having come out of Campa, gathering in throngs and approaching in the direction of the Gaggara Lake. Having seen them, he addressed his doorkeeper: \"What, my dear doorkeeper, are these brahmin householders of Campa doing, having come out of Campa, gathering in throngs and approaching in the direction of the Gaggara Lake?\"\n\n\"My good sir, there is the ascetic Gotama, a son of the Sakyans, who has gone forth from the Sakya clan. He has been wandering in the Anga country and has now arrived at Campa, where he is staying on the bank of the Gaggara Lake with a great Sangha of bhikkhus, numbering about five hundred. And concerning that good Master Gotama, such an excellent reputation has spread: 'Indeed, that Blessed One is an Arahant, perfectly enlightened, endowed with knowledge and conduct, a well-farer, knower of the world, an unsurpassed trainer of persons to be tamed, teacher of devas and humans, the Buddha, the Blessed One.' These people are approaching that good Master Gotama to see him.\"\n\n\"In that case, my dear doorkeeper, go to where those brahmin householders of Campa are, and having approached them, say this to the brahmin householders of Campa: 'The brahmin Sonadanda says this: \"Please wait, good sirs, the brahmin Sonadanda also intends to go to see the ascetic Gotama.\"'\"\n\n\"Yes, my good sir,\" replied that doorkeeper to the brahmin Sonadanda, and he went to where the brahmin householders of Campa were; and having approached them, he said this to the brahmin householders of Campa: \"The brahmin Sonadanda says this: 'Please wait, good sirs, the brahmin Sonadanda also intends to go to see the ascetic Gotama.'\"",
      "sinhala": "ඒ ද කලින්, එසමයෙහි සෝණදණ්ඩ බ්‍රාහ්මණයා ප්‍රාසාදයේ උඩුමහල් තලයේ දවාලෙහි සැතපීමට ගොස් සිටියේය. සෝණදණ්ඩ බ්‍රාහ්මණයා චම්පා නුවරින් පිටත්ව ගොස් සමූහ වශයෙන් ගග්ගරා පොකුණ වෙතට යන චම්පා වැසි බ්‍රාහ්මණ ගෘහපතීන් දුටුවේය. දැක, ඔහු ක්ෂත්‍රිය අමාත්‍යවරයාට ඇමතීය – \"භවත් ක්ෂත්‍රිය අමාත්‍යයෙනි, මේ චම්පා වැසි බ්‍රාහ්මණ ගෘහපතීන් චම්පා නුවරින් පිටත්ව ගොස් සමූහ වශයෙන් ගග්ගරා පොකුණ වෙතට යන්නේ කුමටද?\"\n\n\"භවත්නි, ශාක්‍ය කුලයෙන් පැවිදි වූ, ශාක්‍ය පුත්‍ර ශ්‍රමණ ගෞතමයන් වහන්සේ, අංග දනව්වෙහි චාරිකාවේ වඩමින් පන්සියයක් පමණ වූ මහත් භික්ෂු සංඝයාවක් සමඟ චම්පා නුවරට පැමිණ, ගග්ගරා පොකුණේ තීරයේ වාසය කරයි. ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ පිළිබඳව මෙවන් කල්‍යාණ කීර්ති ඝෝෂාවක් පැතිරී ඇත – 'ඒ භාග්‍යවතුන් වහන්සේ අරහත් වන සේක, සම්මා සම්බුද්ධ වන සේක, විද්‍යාචරණ සම්පන්න වන සේක, සුගත වන සේක, ලෝකවිදූ වන සේක, අනුත්තර පුරිසදම්ම සාරථී වන සේක, දේවමනුෂ්‍යයන්ට ශාස්තෘ වන සේක, බුද්ධ වන සේක, භාග්‍යවතුන් වහන්සේ වන සේක' යනුවෙනි. මොවුහු ඒ භාග්‍යවත් ගෞතමයන් වහන්සේව දැකීම පිණිස යන්නෝය.\" \"එසේනම්, භවත් ක්ෂත්‍රිය අමාත්‍යයෙනි, චම්පා වැසි බ්‍රාහ්මණ ගෘහපතීන් සිටින තැනට යන්න. ගොස්, චම්පා වැසි බ්‍රාහ්මණ ගෘහපතීන්ට මෙසේ කියන්න – 'භවත්නි, සෝණදණ්ඩ බ්‍රාහ්මණයා මෙසේ කියයි: භවත්නි, මොහොතක් සිටින්න, සෝණදණ්ඩ බ්‍රාහ්මණයා ද ශ්‍රමණ ගෞතමයන් වහන්සේව දැකීම පිණිස එනු ඇත' යනුවෙනි.\" \"එසේය, භවත්නි\" යි කියා, ඒ ක්ෂත්‍රිය අමාත්‍යවරයා සෝණදණ්ඩ බ්‍රාහ්මණයාට පිළිතුරු දී, චම්පා වැසි බ්‍රාහ්මණ ගෘහපතීන් සිටින තැනට ගියේය. ගොස්, චම්පා වැසි බ්‍රාහ්මණ ගෘහපතීන්ට මෙය කීවේය – \"භවත්නි, සෝණදණ්ඩ බ්‍රාහ්මණයා මෙසේ කියයි: 'භවත්නි, මොහොතක් සිටින්න, සෝණදණ්ඩ බ්‍රාහ්මණයා ද ශ්‍රමණ ගෞතමයන් වහන්සේව දැකීම පිණිස එනු ඇත' යනුවෙනි.\"",
      "paliTitle": ""
    },
    {
      "number": 303,
      "pali": "Tena kho pana samayena nānāverajjakānaṃ brāhmaṇānaṃ pañcamattāni brāhmaṇasatāni campāyaṃ paṭivasanti kenacideva karaṇīyena. Assosuṃ kho te brāhmaṇā – ‘‘soṇadaṇḍo kira brāhmaṇo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti. Atha kho te brāhmaṇā yena soṇadaṇḍo brāhmaṇo tenupasaṅkamiṃsu; upasaṅkamitvā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘saccaṃ kira bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti? ‘‘Evaṃ kho me, bho, hoti – ‘ahampi samaṇaṃ gotamaṃ dassanāya upasaṅkamissāmī’’’ti. ‘‘Mā bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkami. Na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ. Sace bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamissati, bhoto soṇadaṇḍassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati. Yampi bhoto soṇadaṇḍassa yaso hāyissati, samaṇassa gotamassa yaso abhivaḍḍhissati, imināpaṅgena na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ; samaṇotveva gotamo arahati bhavantaṃ soṇadaṇḍaṃ dassanāya upasaṅkamituṃ. ‘‘Bhavañhi soṇadaṇḍo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Yampi bhavaṃ soṇadaṇḍo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ; samaṇotveva gotamo arahati bhavantaṃ soṇadaṇḍaṃ dassanāya upasaṅkamituṃ. ‘‘Bhavañhi soṇadaṇḍo aḍḍho mahaddhano mahābhogo…pe… ‘‘Bhavañhi soṇadaṇḍo ajjhāyako, mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo, lokāyatamahāpurisalakkhaṇesu anavayo…pe… ‘‘Bhavañhi soṇadaṇḍo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī [brahmaḍḍhī (sī.), brahmavaccasī (pī.)] akhuddāvakāso dassanāya…pe… ‘‘Bhavañhi soṇadaṇḍo sīlavā vuddhasīlī vuddhasīlena samannāgato…pe… ‘‘Bhavañhi soṇadaṇḍo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya [aneḷagalāya (sī. pī.), anelagaḷāya (ka)] atthassa viññāpaniyā…pe… ‘‘Bhavañhi soṇadaṇḍo bahūnaṃ ācariyapācariyo tīṇi māṇavakasatāni mante vāceti. Bahū kho pana nānādisā nānājanapadā māṇavakā āgacchanti bhoto soṇadaṇḍassa santike mantatthikā mante adhiyitukāmā …pe… ‘‘Bhavañhi soṇadaṇḍo jiṇṇo vuddho mahallako addhagato vayoanuppatto; samaṇo gotamo taruṇo ceva taruṇapabbajito ca…pe… ‘‘Bhavañhi soṇadaṇḍo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito…pe… ‘‘Bhavañhi soṇadaṇḍo brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito…pe… ‘‘Bhavañhi soṇadaṇḍo campaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ, raññā māgadhena seniyena bimbisārena dinnaṃ, rājadāyaṃ brahmadeyyaṃ. Yampi bhavaṃ soṇadaṇḍo campaṃ ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ, raññā māgadhena seniyena bimbisārena dinnaṃ, rājadāyaṃ brahmadeyyaṃ. Imināpaṅgena na arahati bhavaṃ soṇadaṇḍo samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ; samaṇotveva gotamo arahati bhavantaṃ soṇadaṇḍaṃ dassanāya upasaṅkamitu’’nti.",
      "english": "Now at that time, about five hundred Brahmins from various countries were dwelling in Campa for some business or other reason. Indeed, those Brahmins heard, \"It is said that the Brahmin Sonadanda will go to see the ascetic Gotama.\" Then indeed those Brahmins went to where the Brahmin Sonadanda was; having approached, they said to the Brahmin Sonadanda, \"Is it true, venerable Sonadanda, that you will go to see the ascetic Gotama?\" \"Indeed, sirs, it occurred to me, 'I too shall go to see the ascetic Gotama.'\"\n\n\"Venerable Sonadanda should not go to see the ascetic Gotama. It is not fitting for venerable Sonadanda to go to see the ascetic Gotama. If venerable Sonadanda goes to see the ascetic Gotama, venerable Sonadanda’s renown will diminish, and the ascetic Gotama’s renown will increase. Since venerable Sonadanda’s renown will diminish and the ascetic Gotama’s renown will increase, for this reason it is not fitting for venerable Sonadanda to go to see the ascetic Gotama; rather, it is fitting for the ascetic Gotama to go to see venerable Sonadanda.\n\n\"Indeed, venerable Sonadanda is well-born on both sides, from mother and from father, with pure lineage back through seven generations of ancestors, unchallenged and unassailed in respect of birth. Since venerable Sonadanda is well-born on both sides, from mother and from father, with pure lineage back through seven generations of ancestors, unchallenged and unassailed in respect of birth, for this reason it is not fitting for venerable Sonadanda to go to see the ascetic Gotama; rather, it is fitting for the ascetic Gotama to go to see venerable Sonadanda.\n\n\"Indeed, venerable Sonadanda is rich, of great wealth, of great possessions.\n\n\"Indeed, venerable Sonadanda is a reciter, a holder of the mantras, a master of the three Vedas, complete with the lexicons and ritual manuals, with phonology and etymology, with the Itihasas as the fifth branch of knowledge, knowing the words and grammar, perfect in natural philosophy and the marks of a Great Man.\n\n\"Indeed, venerable Sonadanda is handsome, good-looking, delightful, endowed with supreme beauty of complexion, having the complexion of Brahma and the aura of Brahma, not of insignificant appearance, worthy of being seen.\n\n\"Indeed, venerable Sonadanda is virtuous, of mature virtue, endowed with mature virtue.\n\n\"Indeed, venerable Sonadanda is of good speech, of good utterance, endowed with cultured speech that is distinct, unhesitating, and able to make the meaning clear.\n\n\"Indeed, venerable Sonadanda is a teacher of many, a teacher of teachers; he instructs three hundred young Brahmins in the mantras. Many young Brahmins from various directions and various countries come to venerable Sonadanda, desiring mantras, wanting to learn the mantras.\n\n\"Indeed, venerable Sonadanda is old, aged, advanced in years, having reached the end of his life, having attained old age; the ascetic Gotama is young and recently ordained.\n\n\"Indeed, venerable Sonadanda is respected, revered, esteemed, honored, and venerated by King Seniya Bimbisara of Magadha.\n\n\"Indeed, venerable Sonadanda is respected, revered, esteemed, honored, and venerated by the Brahmin Pokkharasati.\n\n\"Indeed, venerable Sonadanda dwells in Campa, which is populous, with abundant grass, firewood, and water, with corn, a royal endowment, given by King Seniya Bimbisara of Magadha, a royal gift, a Brahmin grant. Since venerable Sonadanda dwells in Campa, which is populous, with abundant grass, firewood, and water, with corn, a royal endowment, given by King Seniya Bimbisara of Magadha, a royal gift, a Brahmin grant, for this reason it is not fitting for venerable Sonadanda to go to see the ascetic Gotama; rather, it is fitting for the ascetic Gotama to go to see venerable Sonadanda.\"",
      "sinhala": "එකල්හි, නානාවෙරජ්ජක බමුණන්ගේ පන්සියයක් පමණ බමුණෝ කිසියම් කරුණක් නිසා චම්පාවෙහි විසූහ. ඒ බමුණෝ – “ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට සෝණදණ්ඩ බ්‍රාහ්මණයා යනවාලු”යි ඇසූහ. ඉක්බිති ඒ බමුණෝ සෝණදණ්ඩ බ්‍රාහ්මණයා වෙත එළඹියහ; එළඹ, සෝණදණ්ඩ බ්‍රාහ්මණයාට මෙය කීහ – “සෝණදණ්ඩ මැතිතුමනි, ඔබ ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යනවා යනු සැබෑද?” “ඇත්තෙන්ම මා හට එසේ සිතේ, පින්වත්නි, මමත් ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යන්නෙමි”යි.\n\n“සෝණදණ්ඩ මැතිතුමනි, ඔබ ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට නොයන්න. සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත. යම් හෙයකින් සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට ගියහොත්, සෝණදණ්ඩ මැතිතුමාගේ යසස පිරිහෙන්නේය; ශ්‍රමණ ගෞතමයන් වහන්සේගේ යසස වැඩෙන්නේය. සෝණදණ්ඩ මැතිතුමාගේ යසස පිරිහී, ශ්‍රමණ ගෞතමයන් වහන්සේගේ යසස වඩන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා මවගෙන්ද පියාගෙන්ද දෙපසින්ම මනා කොට උපන්නේය; හත්වන මුතුන්මිත්තන් පරම්පරාව දක්වාම පිරිසිදු ගැබ් ඇති, ජාතිවාදයෙන් දොස් නොලත්, අපවාද නොලත් කෙනෙකි. සෝණදණ්ඩ මැතිතුමා මවගෙන්ද පියාගෙන්ද දෙපසින්ම මනා කොට උපන්නේ, හත්වන මුතුන්මිත්තන් පරම්පරාව දක්වාම පිරිසිදු ගැබ් ඇති, ජාතිවාදයෙන් දොස් නොලත්, අපවාද නොලත් කෙනෙකු වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා ඉතා ධනවත්ය, මහා ධනයෙන් හා මහා භෝග සම්පත්තියෙන් යුක්තය. සෝණදණ්ඩ මැතිතුමා ඉතා ධනවත්, මහා ධනයෙන් හා මහා භෝග සම්පත්තියෙන් යුක්ත වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා අධ්‍යායකයෙකි, මන්ත්‍රධරයෙකි, නිඝණ්ඩු සහ කේටුභ සහිත, අක්ෂර ප්‍රභේද සහිත, ඉතිහාසය පස්වැනියට ඇති ත්‍රිවේදයට දක්ෂයෙකි, පදවිශාරදයෙකි, වෛයාකරණ (ව්‍යාකරණ ශාස්ත්‍රයෙහි දක්ෂ) කෙනෙකි, ලෝකායත හා මහාපුරිස ලක්ෂණ විද්‍යාවන්හි අනාගාමි (නිර්දෝෂ) කෙනෙකි. සෝණදණ්ඩ මැතිතුමා අධ්‍යායකයෙක්, මන්ත්‍රධරයෙක්, නිඝණ්ඩු සහ කේටුභ සහිත, අක්ෂර ප්‍රභේද සහිත, ඉතිහාසය පස්වැනියට ඇති ත්‍රිවේදයට දක්ෂයෙක්, පදවිශාරදයෙක්, වෛයාකරණ කෙනෙක්, ලෝකායත හා මහාපුරිස ලක්ෂණ විද්‍යාවන්හි අනාගාමි කෙනෙක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා රූප සම්පන්නය, දර්ශනීයය, ප්‍රසාද ජනකය, උතුම් වූ ශරීර වර්ණයෙන් හා කාන්තිමත් බවින් යුක්තය, බ්‍රහ්ම වර්ණ ඇත්තෙකි, බ්‍රහ්ම තේජස ඇත්තෙකි, දැකීමට නුදුසුදු තැනක් (හීන බවක්) නැත්තෙකි. සෝණදණ්ඩ මැතිතුමා රූප සම්පන්න, දර්ශනීය, ප්‍රසාද ජනක, උතුම් වූ ශරීර වර්ණයෙන් හා කාන්තිමත් බවින් යුක්ත, බ්‍රහ්ම වර්ණ ඇති, බ්‍රහ්ම තේජස ඇති, දැකීමට නුදුසුදු තැනක් නැති කෙනෙක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා ශීල සම්පන්නය, වැඩුණු ශීලයෙන් යුක්තය. සෝණදණ්ඩ මැතිතුමා ශීල සම්පන්න, වැඩුණු ශීලයෙන් යුක්ත කෙනෙක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා කල්යාණ වචන ඇත්තෙකි, මනා වචන කථා කරන්නෙකි, නගර වැසියන්ට සුදුසු වූද, පැහැදිලි වූද, නොතැවෙනසුලු වූද, අර්ථය දැනවිය හැකි වූද වචනයෙන් යුක්තය. සෝණදණ්ඩ මැතිතුමා කල්යාණ වචන ඇති, මනා වචන කථා කරන, නගර වැසියන්ට සුදුසු වූද, පැහැදිලි වූද, නොතැවෙනසුලු වූද, අර්ථය දැනවිය හැකි වූද වචනයෙන් යුක්ත කෙනෙක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා බොහෝ දෙනෙකුගේ ආචාර්යවරයෙකි, ප්‍රාචාර්යවරයෙකි, ශිෂ්‍ය බ්‍රාහ්මණයන් තුන්සියයකට මන්ත්‍ර උගන්වයි. බොහෝ ශිෂ්‍ය බ්‍රාහ්මණයෝ නන් දෙසින්, නන් ජනපදවලින් මන්ත්‍ර ඉගෙනගැනීමට කැමතිව, මන්ත්‍ර අපේක්ෂාවෙන් සෝණදණ්ඩ මැතිතුමා වෙත පැමිණෙති. සෝණදණ්ඩ මැතිතුමා බොහෝ දෙනෙකුගේ ආචාර්යවරයෙක්, ප්‍රාචාර්යවරයෙක්, ශිෂ්‍ය බ්‍රාහ්මණයන් තුන්සියයකට මන්ත්‍ර උගන්වන, බොහෝ ශිෂ්‍ය බ්‍රාහ්මණයන් නන් දෙසින්, නන් ජනපදවලින් මන්ත්‍ර ඉගෙනගැනීමට කැමතිව, මන්ත්‍ර අපේක්ෂාවෙන් තමන් වෙත පැමිණෙන කෙනෙක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා දිරාපත් වූ, මහලු වූ, වයසට ගිය, කාලය ගෙවූ, මහලු වියට පැමිණි කෙනෙකි; ශ්‍රමණ ගෞතමයන් වහන්සේ තරුණය, තරුණ වියේදීම පැවිදි වූ කෙනෙකි. සෝණදණ්ඩ මැතිතුමා දිරාපත් වූ, මහලු වූ, වයසට ගිය, කාලය ගෙවූ, මහලු වියට පැමිණි කෙනෙක් වන අතර, ශ්‍රමණ ගෞතමයන් වහන්සේ තරුණ, තරුණ වියේදීම පැවිදි වූ කෙනෙක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා මගධ රටේ සේනිය බිම්බිසාර රජතුමා විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, අපචායනය කරන ලද කෙනෙකි. සෝණදණ්ඩ මැතිතුමා මගධ රටේ සේනිය බිම්බිසාර රජතුමා විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, අපචායනය කරන ලද කෙනෙක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා පොක්ඛරසාති බ්‍රාහ්මණයා විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, අපචායනය කරන ලද කෙනෙකි. සෝණදණ්ඩ මැතිතුමා පොක්ඛරසාති බ්‍රාහ්මණයා විසින් සත්කාර කරන ලද, ගරු කරන ලද, මනින ලද, පුදන ලද, අපචායනය කරන ලද කෙනෙක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.\n\n“මක්නිසාද යත්, සෝණදණ්ඩ මැතිතුමා චම්පා නගරයෙහි අධිපති කම් දරයි. ඒ චම්පා නගරය සශ්‍රීකය, තණකොළ කඩ දිය ආදියෙන් යුක්තය, ධාන්‍ය සම්පන්නය, රජුන් විසින් භුක්ති විඳින ලද්දකි, මගධ රටේ සේනිය බිම්බිසාර රජතුමා විසින් දෙන ලද, රජුට අයිති වූ, බ්‍රහ්ම දායාදයකි. සෝණදණ්ඩ මැතිතුමා චම්පා නගරයෙහි අධිපති කම් දරන, ඒ චම්පා නගරය සශ්‍රීක, තණකොළ කඩ දිය ආදියෙන් යුක්ත, ධාන්‍ය සම්පන්න, රජුන් විසින් භුක්ති විඳින ලද, මගධ රටේ සේනිය බිම්බිසාර රජතුමා විසින් දෙන ලද, රජුට අයිති වූ, බ්‍රහ්ම දායාදයක් වන මේ කරුණ නිසා සෝණදණ්ඩ මැතිතුමා ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාම සුදුසු නැත; ශ්‍රමණ ගෞතමයන් වහන්සේම සෝණදණ්ඩ මැතිතුමා බැහැදැකීමට ඒම සුදුසුය.”",
      "paliTitle": "Soṇadaṇḍaguṇakathā",
      "englishTitle": "Discourse on Soṇadaṇḍa's Virtues",
      "sinhalaTitle": "සෝණදණ‍්ඩ ගුණ කථාව"
    },
    {
      "number": 304,
      "pali": "Evaṃ vutte, soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca – ‘‘Tena hi, bho, mamapi suṇātha, yathā mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ; natveva arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Samaṇo khalu, bho, gotamo ubhato sujāto mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena. Yampi bho samaṇo gotamo ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā, akkhitto anupakkuṭṭho jātivādena, imināpaṅgena na arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ; atha kho mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ. ‘‘Samaṇo khalu, bho, gotamo mahantaṃ ñātisaṅghaṃ ohāya pabbajito…pe… ‘‘Samaṇo khalu, bho, gotamo pahūtaṃ hiraññasuvaṇṇaṃ ohāya pabbajito bhūmigatañca vehāsaṭṭhaṃ ca…pe… ‘‘Samaṇo khalu, bho, gotamo daharova samāno yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā agārasmā anagāriyaṃ pabbajito…pe… ‘‘Samaṇo khalu, bho, gotamo akāmakānaṃ mātāpitūnaṃ assumukhānaṃ rudantānaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito…pe… ‘‘Samaṇo khalu, bho, gotamo abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato, brahmavaṇṇī, brahmavacchasī, akhuddāvakāso dassanāya…pe… ‘‘Samaṇo khalu, bho, gotamo sīlavā ariyasīlī kusalasīlī kusalasīlena samannāgato…pe… ‘‘Samaṇo khalu, bho, gotamo kalyāṇavāco kalyāṇavākkaraṇo poriyā vācāya samannāgato vissaṭṭhāya anelagalāya atthassa viññāpaniyā…pe… ‘‘Samaṇo khalu, bho, gotamo bahūnaṃ ācariyapācariyo…pe… ‘‘Samaṇo khalu, bho, gotamo khīṇakāmarāgo vigatacāpallo…pe… ‘‘Samaṇo khalu, bho, gotamo kammavādī kiriyavādī apāpapurekkhāro brahmaññāya pajāya…pe… ‘‘Samaṇo khalu, bho, gotamo uccā kulā pabbajito asambhinnakhattiyakulā…pe… ‘‘Samaṇo khalu, bho, gotamo aḍḍhā kulā pabbajito mahaddhanā mahābhogā…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ tiroraṭṭhā tirojanapadā pañhaṃ pucchituṃ āgacchanti…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ anekāni devatāsahassāni pāṇehi saraṇaṃ gatāni…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ ti…pe… ‘‘Samaṇo khalu, bho, gotamo dvattiṃsamahāpurisalakkhaṇehi samannāgato…pe… ‘‘Samaṇo khalu, bho, gotamo ehisvāgatavādī sakhilo sammodako abbhākuṭiko uttānamukho pubbabhāsī…pe… ‘‘Samaṇo khalu, bho, gotamo catunnaṃ parisānaṃ sakkato garukato mānito pūjito apacito…pe… ‘‘Samaṇe khalu, bho, gotame bahū devā ca manussā ca abhippasannā…pe… ‘‘Samaṇo khalu, bho, gotamo yasmiṃ gāme vā nigame vā paṭivasati, na tasmiṃ gāme vā nigame vā amanussā manusse viheṭhenti…pe… ‘‘Samaṇo khalu, bho, gotamo saṅghī gaṇī gaṇācariyo puthutitthakarānaṃ aggamakkhāyati. Yathā kho pana, bho, etesaṃ samaṇabrāhmaṇānaṃ yathā vā tathā vā yaso samudāgacchati, na hevaṃ samaṇassa gotamassa yaso samudāgato. Atha kho anuttarāya vijjācaraṇasampadāya samaṇassa gotamassa yaso samudāgato…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ rājā māgadho seniyo bimbisāro saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ rājā pasenadi kosalo saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe… ‘‘Samaṇaṃ khalu, bho, gotamaṃ brāhmaṇo pokkharasāti saputto sabhariyo sapariso sāmacco pāṇehi saraṇaṃ gato…pe… ‘‘Samaṇo khalu, bho, gotamo rañño māgadhassa seniyassa bimbisārassa sakkato garukato mānito pūjito apacito…pe… ‘‘Samaṇo khalu, bho, gotamo rañño pasenadissa kosalassa sakkato garukato mānito pūjito apacito…pe… ‘‘Samaṇo khalu, bho, gotamo brāhmaṇassa pokkharasātissa sakkato garukato mānito pūjito apacito…pe… ‘‘Samaṇo khalu, bho, gotamo campaṃ anuppatto, campāyaṃ viharati gaggarāya pokkharaṇiyā tīre. Ye kho pana, bho, keci samaṇā vā brāhmaṇā vā amhākaṃ gāmakhettaṃ āgacchanti atithī no te honti. Atithī kho panamhehi sakkātabbā garukātabbā mānetabbā pūjetabbā apacetabbā. Yampi, bho, samaṇo gotamo campaṃ anuppatto campāyaṃ viharati gaggarāya pokkharaṇiyā tīre, atithimhākaṃ samaṇo gotamo; atithi kho panamhehi sakkātabbo garukātabbo mānetabbo pūjetabbo apacetabbo. Imināpaṅgena na arahati so bhavaṃ gotamo amhākaṃ dassanāya upasaṅkamituṃ. Atha kho mayameva arahāma taṃ bhavantaṃ gotamaṃ dassanāya upasaṅkamituṃ. Ettake kho ahaṃ, bho, tassa bhoto gotamassa vaṇṇe pariyāpuṇāmi, no ca kho so bhavaṃ gotamo ettakavaṇṇo. Aparimāṇavaṇṇo hi so bhavaṃ gotamo’’ti.",
      "english": "When this was said, the brahmin Soṇadaṇḍa said to those brahmins: \"Then, sirs, listen to me too, as to why we ourselves deserve to visit that Venerable Gotama, and that Venerable Gotama does not deserve to visit us.\n\n\"Indeed, sirs, the recluse Gotama is well-born on both sides, from his mother and from his father, with a pure lineage back through seven generations of ancestors, without reproach or blemish in respect of birth. Since, sirs, the recluse Gotama is well-born on both sides, from his mother and from his father, with a pure lineage back through seven generations of ancestors, without reproach or blemish in respect of birth, for this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama has gone forth from home into homelessness, abandoning a great circle of relatives. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama has gone forth from home into homelessness, abandoning much gold and silver, both what was buried in the ground and what was stored above ground. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama went forth from home into homelessness while still young, a youth with fine black hair, endowed with the blessings of youth, in the prime of his life. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama went forth from home into homelessness, having shaved off his hair and beard, and donned saffron robes, despite his unwilling parents, whose faces were wet with tears and who were weeping. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is handsome, good-looking, and inspiring, endowed with supreme beauty of complexion, with a divine complexion and presence, not unsuited for viewing. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is virtuous, possessing noble morality, possessing wholesome morality, endowed with wholesome morality. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama has beautiful speech, beautiful utterance, endowed with an urbane voice, clear, distinct, and capable of conveying meaning. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is a teacher and instructor of many. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama has destroyed sensual lust and is free from agitation. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama teaches kamma, teaches action, and is a proponent of non-evil for the brahmin class. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama went forth from a high family, from an unbroken warrior family. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama went forth from a wealthy family, one with great riches and great possessions. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, people come to the recluse Gotama from various districts and various countries to ask questions. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, many thousands of deities have taken refuge in the recluse Gotama for life. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, such a good reputation has spread concerning the recluse Gotama: ‘Thus is the Blessed One: an Arahant, a Fully Self-Enlightened One, accomplished in knowledge and conduct, a Fortunate One, knower of the world, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One.’ For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is endowed with the thirty-two marks of a great man. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is one who welcomes, who is friendly, cheerful, without a frown, with an open countenance, and one who speaks first. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is honored, respected, esteemed, revered, and venerated by the four assemblies. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, many gods and humans are deeply devoted to the recluse Gotama. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, in whichever village or town the recluse Gotama resides, in that village or town, non-humans do not harm humans. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is the leader of a company, the head of a group, a teacher of a group, and is proclaimed as chief among those who establish various sects. Indeed, sirs, the fame of these recluses and brahmins arises in one way or another, but the fame of the recluse Gotama has not arisen in that way. Instead, the fame of the recluse Gotama has arisen through unsurpassed accomplishment in knowledge and conduct. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, King Seniya Bimbisāra of Magadha, with his sons, wives, retinue, and ministers, has taken refuge in the recluse Gotama for life. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, King Pasenadi of Kosala, with his sons, wives, retinue, and ministers, has taken refuge in the recluse Gotama for life. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the brahmin Pokkharasāti, with his sons, wives, retinue, and ministers, has taken refuge in the recluse Gotama for life. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is honored, respected, esteemed, revered, and venerated by King Seniya Bimbisāra of Magadha. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is honored, respected, esteemed, revered, and venerated by King Pasenadi of Kosala. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama is honored, respected, esteemed, revered, and venerated by the brahmin Pokkharasāti. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Indeed, sirs, the recluse Gotama has arrived at Campā and is staying on the bank of Gaggarā’s Lotus Pond. And indeed, sirs, whatever recluses or brahmins come to our rural area are our guests. Guests, indeed, are to be honored, respected, esteemed, revered, and venerated by us. Since, sirs, the recluse Gotama has arrived at Campā and is staying on the bank of Gaggarā’s Lotus Pond, the recluse Gotama is our guest; a guest, indeed, is to be honored, respected, esteemed, revered, and venerated by us. For this reason, that Venerable Gotama does not deserve to visit us, but rather we ourselves deserve to visit that Venerable Gotama.\n\n\"Sirs, I only know these praises of the Venerable Gotama, but the Venerable Gotama is not praised only by these qualities. Indeed, the Venerable Gotama has immeasurable qualities.\"",
      "sinhala": "එසේ කී කල්හි සෝණදණ්ඩ බ්‍රාහ්මණයා එම බ්‍රාහ්මණවරුන්ට මෙසේ කීවේය: “එසේ නම්, පින්වත්නි, මගේද අසන්න, ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට ළඟා වීම අපටම සුදුසු වන ආකාරය; ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම උසස් ව උපන් සේක, සත් පරම්පරාවක් තෙක් නිර්මල වූ කුලපරම්පරාවක් ඇති සේක, ජාතිවාදයෙන් දොස් නොලත්, නින්දා නොලත් සේක. පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ මවගෙන්ද පියාගෙන්ද යන දෙපසින්ම උසස් ව උපන් සේක, සත් පරම්පරාවක් තෙක් නිර්මල වූ කුලපරම්පරාවක් ඇති සේක, ජාතිවාදයෙන් දොස් නොලත්, නින්දා නොලත් සේක යන මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ මහත් ඥාති සංඝයා හැර දමා පැවිදි වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ භූමියේ ගබඩා කර තිබූද, අහසේ (ආරක්ෂා කර තිබූ)ද බොහෝ රන් රිදී සම්පත් හැර දමා පැවිදි වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ තරුණ වියේ සිටියදීම, යෞවනයෙකුව, ඉතා කළු කෙස් ඇතිව, සුන්දර යෞවනයෙන් යුක්තව, පළමු වයසේ සිටියදී ගිහි ගෙදරින් නික්ම අනගාරික බවට පැවිදි වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ අකමැති වූ, කඳුළු පිරුණු මුහුණින් හඬමින් සිටි මව්පියන් සිටියදීම, හිසකෙස් හා රැවුල් කපා දමා, කසාවත් හැඳ පොරවා, ගිහි ගෙදරින් නික්ම අනගාරික බවට පැවිදි වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ අතිශයින් රූප සම්පන්න, දැකීමට ප්‍රිය උපදවන, පහන් කරවන සුළු, උතුම් වූ ශරීර වර්ණයකින් හා දීප්තියකින් යුක්ත වූ, බ්‍රහ්ම වර්ණයක් ඇති, බ්‍රහ්ම කාන්තියක් ඇති, දර්ශනයට සුළු ඉඩක් නැති කෙනෙක් වන සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ ශීලවන්ත සේක, ආර්ය ශීලයෙන් යුක්ත සේක, කුසල ශීලයෙන් යුක්ත සේක, කුසල ශීලයෙන් සම්පූර්ණ වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ මනා වචන ඇති, මනා ප්‍රකාශයන් ඇති, පැහැදිලි, නොතැටලුණු, අර්ථය දැනවිය හැකි ශ්‍රේෂ්ඨ වූ වචනයෙන් යුක්ත වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ බොහෝ දෙනෙකුගේ ආචාර්ය-ප්‍රාචාර්ය වන සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ කාමරාගය ක්ෂය කළ, චංචලභාවය දුරු කළ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ කර්මවාදී සේක, ක්‍රියාවාදී සේක, බ්‍රාහ්මණ ප්‍රජාවට පව් කිරීමට අනුබල නොදෙන්නා වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ භේද නොබිඳුණු ක්ෂත්‍රිය කුලයකින් (පැවත එන) උසස් කුලයකින් පැවිදි වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ මහත් ධනයක් හා මහත් භෝග සම්පත් ඇති ධනවත් කුලයකින් පැවිදි වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේගෙන් ප්‍රශ්න ඇසීමට රටින් රට, ජනපදයෙන් ජනපදයට මිනිසුන් පැමිණෙති. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේව බොහෝ දහස් ගණන් දෙවිවරු ජීවිතයෙන් සරණ ගියහ. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ පිළිබඳව ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තර පුරිසදම්ම සාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භාග්‍යවත් නම් වන සේක’ යි මෙවන් සුන්දර කීර්ති ඝෝෂාවක් පැතිර ගොස් ඇත. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ තිස්දෙකක් මහා පුරුෂ ලක්ෂණයන්ගෙන් යුක්ත වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ ‘පින්වත්නි, එන්න’ යැයි කථා කරන්නා වූ, මිත්‍රශීලීව සතුටු වන්නා වූ, ප්‍රසන්න මුහුණක් ඇති, විවෘත මුහුණක් ඇති, පළමුව කතා කරන්නා වූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ සිව්වර්ග පිරිස විසින් සත්කාර කරනු ලැබූ, ගරු කරනු ලැබූ, මනිනු ලැබූ, පුදනු ලැබූ, බුහුමන් කරනු ලැබූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ කෙරෙහි බොහෝ දෙවිවරුන් සහ මිනිසුන් අතිශයින් පැහැදී සිටිති. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ යම් ගමක හෝ නියම්ගමක වැඩවසන සේක්ද, එම ගමේ හෝ නියම්ගමේ අමනුෂ්‍යයෝ මිනිසුන්ට හිංසා නොකරති. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ සංඝයක් ඇති, ගණයක් ඇති, ගණාචාර්යවරයෙක් වන සේක, විවිධ තීර්ථකයන් (අන්‍ය ආගමික ගුරුවරුන්) අතර අග්‍ර යැයි කියනු ලැබේ. පින්වත්නි, මේ අනෙකුත් ශ්‍රමණ බ්‍රාහ්මණයන්ට විවිධ ආකාරයෙන් යසස (කීර්තිය) හට ගත්තාක් මෙන්, ශ්‍රමණ ගෞතමයන් වහන්සේගේ යසස හට නොගත්තේය. එහෙත් අනුත්තර වූ විද්‍යාචරණ සම්පත්තිය නිසා ශ්‍රමණ ගෞතමයන් වහන්සේගේ යසස හට ගත්තේය. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේව මගධ රජු වූ සේනිය බිම්බිසාර, පුතුන් සහිතව, භාර්යාවන් සහිතව, පිරිවර සහිතව, අමාත්‍යවරුන් සහිතව ජීවිතයෙන් සරණ ගියේය. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේව කෝසල රජු වූ පසේනදී, පුතුන් සහිතව, භාර්යාවන් සහිතව, පිරිවර සහිතව, අමාත්‍යවරුන් සහිතව ජීවිතයෙන් සරණ ගියේය. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේව පොක්ඛරසාති බ්‍රාහ්මණයා, පුතුන් සහිතව, භාර්යාවන් සහිතව, පිරිවර සහිතව, අමාත්‍යවරුන් සහිතව ජීවිතයෙන් සරණ ගියේය. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ මගධ රජු සේනිය බිම්බිසාර විසින් සත්කාර කරනු ලැබූ, ගරු කරනු ලැබූ, මනිනු ලැබූ, පුදනු ලැබූ, බුහුමන් කරනු ලැබූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ කෝසල රජු පසේනදී විසින් සත්කාර කරනු ලැබූ, ගරු කරනු ලැබූ, මනිනු ලැබූ, පුදනු ලැබූ, බුහුමන් කරනු ලැබූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ පොක්ඛරසාති බ්‍රාහ්මණයා විසින් සත්කාර කරනු ලැබූ, ගරු කරනු ලැබූ, මනිනු ලැබූ, පුදනු ලැබූ, බුහුමන් කරනු ලැබූ සේක. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ චම්පා නුවරට පැමිණි සේක, චම්පා නුවර ගග්ගරා පොකුණ අසල වැඩවසන සේක. පින්වත්නි, යම් කිසි ශ්‍රමණයෝ හෝ බ්‍රාහ්මණයෝ අපගේ ගම් ප්‍රදේශයට පැමිණෙත්ද, ඔවුහු අපගේ අමුත්තෝ වෙති. අමුත්තන්ට අප විසින් සත්කාර කළ යුතුය, ගරු කළ යුතුය, බුහුමන් කළ යුතුය, පූජා කළ යුතුය, වැඳීමෙන් සත්කාර කළ යුතුය. පින්වත්නි, ශ්‍රමණ ගෞතමයන් වහන්සේ චම්පා නුවරට පැමිණ, චම්පා නුවර ගග්ගරා පොකුණ අසල වැඩවසන සේක යන මේ කරුණ නිසා, ශ්‍රමණ ගෞතමයන් වහන්සේ අපගේ අමුත්තෙක් වන සේක. අමුත්තන්ට අප විසින් සත්කාර කළ යුතුය, ගරු කළ යුතුය, බුහුමන් කළ යුතුය, පූජා කළ යුතුය, වැඳීමෙන් සත්කාර කළ යුතුය. මේ කරුණ නිසාද ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අප දැකීමට ළඟා වීම සුදුසු නැත. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ දැකීමට අපම ළඟා වීම සුදුසුය.”\n\n“පින්වත්නි, ඒ භාග්‍යවත් ගෞතමයන් වහන්සේගේ මෙපමණ ගුණ මම දනිමි. එහෙත් ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ මෙපමණ ගුණ ඇති කෙනෙක් නොවන සේක. ඒ භාග්‍යවත් ගෞතමයන් වහන්සේ අපරිමිත ගුණ ඇති සේක.”",
      "paliTitle": "Buddhaguṇakathā",
      "englishTitle": "Discourse on the Buddha's Virtues",
      "sinhalaTitle": "බුද්‍ධගුණ කථාව"
    },
    {
      "number": 305,
      "pali": "Evaṃ vutte, te brāhmaṇā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘yathā kho bhavaṃ soṇadaṇḍo samaṇassa gotamassa vaṇṇe bhāsati ito cepi so bhavaṃ gotamo yojanasate viharati, alameva saddhena kulaputtena dassanāya upasaṅkamituṃ api puṭosenā’’ti. ‘‘Tena hi, bho, sabbeva mayaṃ samaṇaṃ gotamaṃ dassanāya upasaṅkamissāmā’’ti. ",
      "english": "When this was said, those brahmins said this to the brahmin Sonadaṇḍa: “Indeed, as venerable Sonadaṇḍa speaks in praise of the ascetic Gotama, even if that venerable Gotama dwells a hundred leagues from here, it would be proper for a devoted clansman to go and visit him, even carrying provisions for the journey.” “Well then, sirs, all of us will go to visit the ascetic Gotama.”",
      "sinhala": "මෙසේ කී කල්හි ඒ බ්‍රාහ්මණයෝ සෝණදණ්ඩ බ්‍රාහ්මණයාට මෙසේ කීහ. \"භවත් සෝණදණ්ඩ ශ්‍රමණ ගෞතමයන් වහන්සේගේ ගුණ වර්ණනා කරන පරිදි, ඒ භවත් ගෞතමයන් වහන්සේ මෙතැනින් යොදුන් සියයක් දුර වැඩ සිටියත්, ශ්‍රද්ධාවන්ත කුලපුත්‍රයකුට උන්වහන්සේ දැකීමට කූඩයක් කරපින්නාගෙන වුව ද පැමිණීම සුදුසුය.\" \"එසේ නම්, පින්වතුනි, අපි සියලු දෙනාම ශ්‍රමණ ගෞතමයන් වහන්සේ දැකීමට යමු!\"",
      "paliTitle": ""
    },
    {
      "number": 306,
      "pali": "Atha kho soṇadaṇḍo brāhmaṇo mahatā brāhmaṇagaṇena saddhiṃ yena gaggarā pokkharaṇī tenupasaṅkami. Atha kho soṇadaṇḍassa brāhmaṇassa tirovanasaṇḍagatassa evaṃ cetaso parivitakko udapādi – ‘‘ahañceva kho pana samaṇaṃ gotamaṃ pañhaṃ puccheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ pucchitabbo, evaṃ nāmesa, brāhmaṇa, pañho pucchitabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇaṃ gotamaṃ yoniso pañhaṃ pucchitu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Mamañceva kho pana samaṇo gotamo pañhaṃ puccheyya, tassa cāhaṃ pañhassa veyyākaraṇena cittaṃ na ārādheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ byākātabbo, evaṃ nāmesa, brāhmaṇa, pañho byākātabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇassa gotamassa pañhassa veyyākaraṇena cittaṃ ārādhetu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana evaṃ samīpagato samāno adisvāva samaṇaṃ gotamaṃ nivatteyyaṃ, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto mānathaddho bhīto ca, no visahati samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ, kathañhi nāma evaṃ samīpagato samāno adisvā samaṇaṃ gotamaṃ nivattissatī’ti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ, yasoladdhā kho panamhākaṃ bhogā’’ti.",
      "english": "Then the Brahmin Sonadaṇḍa, along with a large assembly of brahmins, approached the Gaggara Lake.\n\nThen, a thought arose in the mind of the Brahmin Sonadaṇḍa, who was standing at the edge of the grove: \"What if I were to ask the ascetic Gotama a question, and then the ascetic Gotama were to say to me, 'This question, brahmin, should not be asked in this way; rather, brahmin, the question should be asked in this other way.' Then this assembly would look down on me, saying, 'The Brahmin Sonadaṇḍa is foolish and unskilled; he could not ask the ascetic Gotama a question properly.' And if this assembly were to look down on me, my reputation would decline. And if my reputation were to decline, my possessions would also decline, for our possessions are obtained through reputation. Or what if the ascetic Gotama were to ask me a question, and I could not satisfy his mind with my explanation of that question, and then the ascetic Gotama were to say to me, 'This question, brahmin, should not be answered in this way; rather, brahmin, the question should be answered in this other way.' Then this assembly would look down on me, saying, 'The Brahmin Sonadaṇḍa is foolish and unskilled; he could not satisfy the mind of the ascetic Gotama with his explanation of the question.' And if this assembly were to look down on me, my reputation would decline. And if my reputation were to decline, my possessions would also decline, for our possessions are obtained through reputation. Or what if I, having come so close, were to turn back without seeing the ascetic Gotama? Then this assembly would look down on me, saying, 'The Brahmin Sonadaṇḍa is foolish, unskilled, arrogant, and afraid; he does not dare to approach the ascetic Gotama for an audience. How can he, having come so close, turn back without seeing the ascetic Gotama?' And if this assembly were to look down on me, my reputation would decline. And if my reputation were to decline, my possessions would also decline, for our possessions are obtained through reputation.\"",
      "sinhala": "එවිට සෝණදණ්ඩ බ්‍රාහ්මණයා මහත් බ්‍රාහ්මණ පිරිසක් සමඟ ගග්ගරා පොකුණ තිබූ තැනට පැමිණියේය. එවිට වනයකට යාබදව සිටි සෝණදණ්ඩ බ්‍රාහ්මණයාට මෙසේ සිතුවිල්ලක් පහළ විය: \"මා විසින් ශ්‍රමණයන් වහන්සේ වන ගෞතමයන්ගෙන් ප්‍රශ්නයක් විමසුවොත්; එහිදී ශ්‍රමණයන් වහන්සේ වන ගෞතමයන් මට මෙසේ කීවොත් – ‘බ්‍රාහ්මණය, මේ ප්‍රශ්නය මෙසේ විමසිය යුත්තක් නොවේ, බ්‍රාහ්මණය, ප්‍රශ්නය මෙසේ විමසිය යුතුය’ කියා, එවිට මේ පිරිස මට අපහාස කරනු ඇත – ‘සෝණදණ්ඩ බ්‍රාහ්මණයා මෝඩයෙකි, අදක්ෂයෙකි, ශ්‍රමණයන් වහන්සේ වන ගෞතමයන්ගෙන් නිසි පරිදි ප්‍රශ්නයක් ඇසීමට නොහැකි විය’ කියා. යම් හෙයකින් මේ පිරිස මට අවමන් කළොත්, මගේ කීර්තියද පිරිහේ. යම් කෙනෙකුගේ කීර්තිය පිරිහේද, ඔහුගේ භෝග සම්පත්ද පිරිහේ. අපගේ භෝග සම්පත් කීර්තියෙන් ලැබුණු ඒවාය. මාගෙන් වනාහි ශ්‍රමණයන් වහන්සේ වන ගෞතමයන් ප්‍රශ්නයක් විමසුවොත්, එම ප්‍රශ්නයට පිළිතුරු දීමෙන් මට උන්වහන්සේගේ සිත සතුටු කිරීමට නොහැකි වුවහොත්; එහිදී ශ්‍රමණයන් වහන්සේ වන ගෞතමයන් මට මෙසේ කීවොත් – ‘බ්‍රාහ්මණය, මේ ප්‍රශ්නයට මෙසේ පිළිතුරු දිය යුත්තක් නොවේ, බ්‍රාහ්මණය, ප්‍රශ්නයට මෙසේ පිළිතුරු දිය යුතුය’ කියා, එවිට මේ පිරිස මට අපහාස කරනු ඇත – ‘සෝණදණ්ඩ බ්‍රාහ්මණයා මෝඩයෙකි, අදක්ෂයෙකි, ශ්‍රමණයන් වහන්සේ වන ගෞතමයන්ගේ ප්‍රශ්නයට පිළිතුරු දීමෙන් උන්වහන්සේගේ සිත සතුටු කිරීමට නොහැකි විය’ කියා. යම් හෙයකින් මේ පිරිස මට අවමන් කළොත්, මගේ කීර්තියද පිරිහේ. යම් කෙනෙකුගේ කීර්තිය පිරිහේද, ඔහුගේ භෝග සම්පත්ද පිරිහේ. අපගේ භෝග සම්පත් කීර්තියෙන් ලැබුණු ඒවාය. මා වනාහි මෙසේ සමීපයට පැමිණ සිටියදී ශ්‍රමණයන් වහන්සේ වන ගෞතමයන් නොදැකම ආපසු හැරී ගියහොත්, එවිට මේ පිරිස මට අපහාස කරනු ඇත – ‘සෝණදණ්ඩ බ්‍රාහ්මණයා මෝඩයෙකි, අදක්ෂයෙකි, මානයෙන් උදම් වූවෙකි, බිය වූවෙකි. ශ්‍රමණයන් වහන්සේ වන ගෞතමයන් දැකීමට ළංවීමට නොහැකි විය, මෙසේ සමීපයට පැමිණ සිටියදී ශ්‍රමණයන් වහන්සේ වන ගෞතමයන් නොදැකම ආපසු හැරී යන්නේ කෙසේද’ කියා. යම් හෙයකින් මේ පිරිස මට අවමන් කළොත්, මගේ කීර්තියද පිරිහේ. යම් කෙනෙකුගේ කීර්තිය පිරිහේද, ඔහුගේ භෝග සම්පත්ද පිරිහේ, අපගේ භෝග සම්පත් කීර්තියෙන් ලැබුණු ඒවාය.\"",
      "paliTitle": "Soṇadaṇḍaparivitakko",
      "englishTitle": "Soṇadaṇḍa's Reflection",
      "sinhalaTitle": "සෝණදණ්‌ඩ පරවිතක්‌කය"
    },
    {
      "number": 307,
      "pali": "Atha kho soṇadaṇḍo brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Campeyyakāpi kho brāhmaṇagahapatikā appekacce bhagavantaṃ abhivādetvā ekamantaṃ nisīdiṃsu; appekacce bhagavatā saddhiṃ sammodiṃsu; sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu; appekacce yena bhagavā tenañjaliṃ paṇāmetvā ekamantaṃ nisīdiṃsu; appekacce nāmagottaṃ sāvetvā ekamantaṃ nisīdiṃsu; appekacce tuṇhībhūtā ekamantaṃ nisīdiṃsu.",
      "english": "Then, the brahmin Sonadanda approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded a courteous and amiable conversation, he sat down to one side.\n\nIndeed, some brahmin householders from Campā also, having saluted the Blessed One, sat down to one side. Some exchanged greetings with the Blessed One; having concluded a courteous and amiable conversation, they sat down to one side. Some, having raised their hands in respectful salutation towards the Blessed One, sat down to one side. Some, having announced their name and clan, sat down to one side. Some, remaining silent, sat down to one side.",
      "sinhala": "එවිට සෝණදණ්ඩ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියේය. එළඹ භාග්‍යවතුන් වහන්සේ සමඟ පිළිසඳර කතා කළේය. සතුටු සාමිචි කථා නිමවා එක් පසෙක හිඳ ගත්තේය. චම්පාවේ බ්‍රාහ්මණ ගෘහපතිවරුන්ගෙන් සමහරු භාග්‍යවතුන් වහන්සේට ආචාර කොට එක් පසෙක හිඳ ගත්හ. සමහරු භාග්‍යවතුන් වහන්සේ සමඟ පිළිසඳර කතා කළහ. සතුටු සාමිචි කථා නිමවා එක් පසෙක හිඳ ගත්හ. සමහරු භාග්‍යවතුන් වහන්සේ වැඩසිටි දෙසට ඇඳිලි බැඳ එක් පසෙක හිඳ ගත්හ. සමහරු තම නාම ගෝත්‍රය පවසා එක් පසෙක හිඳ ගත්හ. සමහරු නිශ්ශබ්දව සිට එක් පසෙක හිඳ ගත්හ.",
      "paliTitle": ""
    },
    {
      "number": 308,
      "pali": "Tatrapi sudaṃ soṇadaṇḍo brāhmaṇo etadeva bahulamanuvitakkento nisinno hoti – ‘‘ahañceva kho pana samaṇaṃ gotamaṃ pañhaṃ puccheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ pucchitabbo, evaṃ nāmesa, brāhmaṇa, pañho pucchitabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇaṃ gotamaṃ yoniso pañhaṃ pucchitu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Mamañceva kho pana samaṇo gotamo pañhaṃ puccheyya, tassa cāhaṃ pañhassa veyyākaraṇena cittaṃ na ārādheyyaṃ; tatra ce maṃ samaṇo gotamo evaṃ vadeyya – ‘na kho esa, brāhmaṇa, pañho evaṃ byākātabbo, evaṃ nāmesa, brāhmaṇa, pañho byākātabbo’ti, tena maṃ ayaṃ parisā paribhaveyya – ‘bālo soṇadaṇḍo brāhmaṇo abyatto, nāsakkhi samaṇassa gotamassa pañhassa veyyākaraṇena cittaṃ ārādhetu’nti. Yaṃ kho panāyaṃ parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Aho vata maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ puccheyya, addhā vatassāhaṃ cittaṃ ārādheyyaṃ pañhassa veyyākaraṇenā’’ti.",
      "english": "At that time, indeed, the Brahmin Sonadaṇḍa was sitting there, repeatedly pondering this very thought: \"Suppose I were to ask a question of the ascetic Gotama; and if the ascetic Gotama were to say to me, 'Indeed, Brahmin, this question should not be asked thus; rather, Brahmin, this question should be asked in such a way,' then this assembly would despise me, saying, 'The Brahmin Sonadaṇḍa is foolish and unskillful; he was unable to ask the ascetic Gotama a proper question.' And if this assembly were to despise me, my reputation would decline. If one's reputation declines, one's wealth would also decline, for our wealth is obtained through reputation. Or if the ascetic Gotama were to ask me a question, and I were unable to satisfy his mind with my answer to that question; and if the ascetic Gotama were to say to me, 'Indeed, Brahmin, this question should not be answered thus; rather, Brahmin, this question should be answered in such a way,' then this assembly would despise me, saying, 'The Brahmin Sonadaṇḍa is foolish and unskillful; he was unable to satisfy the mind of the ascetic Gotama with his answer to the question.' And if this assembly were to despise me, my reputation would decline. If one's reputation declines, one's wealth would also decline, for our wealth is obtained through reputation. Oh, if only the ascetic Gotama would ask me a question concerning my own tradition, the Three Vedas, then I would surely satisfy his mind with my answer to the question.\"",
      "sinhala": "එම අවස්ථාවේදීද සෝණදණ්ඩ බ්‍රාහ්මණයා මේ පිළිබඳවම බොහෝ සෙයින් විමසමින් වාඩි වී සිටියේය. \"මම ශ්‍රමණ ගෞතමයන්ගෙන් ප්‍රශ්නයක් විමසන්නට යෙදේ නම්; එහිදී ශ්‍රමණ ගෞතමයන් මට මෙසේ කියන්නේ නම් - 'බ්‍රාහ්මණය, මේ ප්‍රශ්නය මෙසේ විමසිය යුතු නැත, බ්‍රාහ්මණය, ප්‍රශ්නය මෙසේ විමසිය යුත්තේය' කියා, එවිට මේ පිරිස මා හෙළා දකිනු ඇත - 'සෝණදණ්ඩ බ්‍රාහ්මණයා මෝඩයෙකි, නොදක්ෂයෙකි, ශ්‍රමණ ගෞතමයන්ගෙන් නිසි පරිදි ප්‍රශ්නයක් විමසීමට නොහැකි විය' කියා.\n\nයම් හෙයකින් මේ පිරිස මා හෙළා දකිනු ඇතොත්, ඔහුගේ යසසද පිරිහේ. යම් කෙනෙකුගේ යසස පිරිහේ නම්, ඔහුගේ භෝග සම්පත්ද පිරිහේ. අපගේ භෝග සම්පත් ලබන්නේ යසස නිසාමය.\n\nමටම ශ්‍රමණ ගෞතමයන් ප්‍රශ්නයක් අසන්නේ නම්, එම ප්‍රශ්නයට පිළිතුරු දීමෙන් මට උන්වහන්සේගේ සිත සතුටු කිරීමට නොහැකි වුවහොත්; එහිදී ශ්‍රමණ ගෞතමයන් මට මෙසේ කියන්නේ නම් - 'බ්‍රාහ්මණය, මේ ප්‍රශ්නය මෙසේ විසඳිය යුතු නැත, බ්‍රාහ්මණය, ප්‍රශ්නය මෙසේ විසඳිය යුත්තේය' කියා, එවිට මේ පිරිස මා හෙළා දකිනු ඇත - 'සෝණදණ්ඩ බ්‍රාහ්මණයා මෝඩයෙකි, නොදක්ෂයෙකි, ශ්‍රමණ ගෞතමයන්ගේ ප්‍රශ්නයට පිළිතුරු දීමෙන් උන්වහන්සේගේ සිත සතුටු කිරීමට නොහැකි විය' කියා.\n\nයම් හෙයකින් මේ පිරිස මා හෙළා දකිනු ඇතොත්, ඔහුගේ යසසද පිරිහේ. යම් කෙනෙකුගේ යසස පිරිහේ නම්, ඔහුගේ භෝග සම්පත්ද පිරිහේ. අපගේ භෝග සම්පත් ලබන්නේ යසස නිසාමය.\n\n\"අනේ, ශ්‍රමණ ගෞතමයන් මාගේ ගුරු කුලයට අයත් තෙවිද්‍යා පිළිබඳ ප්‍රශ්නයක් විමසන්නේ නම්, ඒකාන්තයෙන්ම මම ප්‍රශ්නයට පිළිතුරු දීමෙන් උන්වහන්සේගේ සිත සතුටු කරන්නෙමි.\"",
      "paliTitle": ""
    },
    {
      "number": 309,
      "pali": "Atha kho bhagavato soṇadaṇḍassa brāhmaṇassa cetasā cetoparivitakkamaññāya etadahosi – ‘‘vihaññati kho ayaṃ soṇadaṇḍo brāhmaṇo sakena cittena. Yaṃnūnāhaṃ soṇadaṇḍaṃ brāhmaṇaṃ sake ācariyake tevijjake pañhaṃ puccheyya’’nti. Atha kho bhagavā soṇadaṇḍaṃ brāhmaṇaṃ etadavoca – ‘‘katihi pana, brāhmaṇa, aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti?",
      "english": "Then indeed the Blessed One, having understood with his mind the mental reflections of the brahmin Sonadaṇḍa, thought: \"This brahmin Sonadaṇḍa is indeed being troubled by his own mind. What if I were to question the brahmin Sonadaṇḍa about his own traditional Threefold Knowledge?\"\n\nThen indeed the Blessed One said this to the brahmin Sonadaṇḍa: \"Now, brahmin, by how many factors do brahmins declare a brahmin (to be a brahmin), so that by saying 'I am a brahmin,' he would speak rightly and not incur a falsehood?\"",
      "sinhala": "එවිට භාග්‍ය​්​යවතුන් වහන්සේට, සෝණදණ්ඩ බ්‍රාහ්මණයාගේ සිතේ විතර්කයන් සිතින් දැන, මේ අදහස පහළ විය: \"මෙම සෝණදණ්ඩ බ්‍රාහ්මණයා තමාගේම සිතින් පෙළෙයි. මම සෝණදණ්ඩ බ්‍රාහ්මණයාගෙන් ඔහුගේම ආචාර්ය සම්ප්‍රදායේ ත්‍​රිවේදයට අදාළ ප්‍රශ්නයක් විමසන්නෙමි.\"\n\nඑවිට භාග්‍ය​්​යවතුන් වහන්සේ සෝණදණ්ඩ බ්‍රාහ්මණයාට මෙය වදාළ සේක: \"බ්‍රාහ්මණය, කවර නම් අංග කීයකින් යුක්ත වූ විටද බ්‍රාහ්මණයෝ බ්‍රාහ්මණයෙකු 'බ්‍රාහ්මණයෙකි' යැයි හඳුන්වන්නේ? තවද, 'මම බ්‍රාහ්මණයෙක්මි' යැයි පවසන්නා නිවැරදිව පවසන්නේ, බොරුවකට පත් නොවීද?\"",
      "paliTitle": "Brāhmaṇapaññatti",
      "englishTitle": "Designation of the Brahmin",
      "sinhalaTitle": "බ්‍රාහ්මණ ප්‍රඥප්තිය"
    },
    {
      "number": 310,
      "pali": "Atha kho soṇadaṇḍassa brāhmaṇassa etadahosi – ‘‘yaṃ vata no ahosi icchitaṃ, yaṃ ākaṅkhitaṃ, yaṃ adhippetaṃ, yaṃ abhipatthitaṃ – ‘aho vata maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ puccheyya, addhā vatassāhaṃ cittaṃ ārādheyyaṃ pañhassa veyyākaraṇenā’ti, tatra maṃ samaṇo gotamo sake ācariyake tevijjake pañhaṃ pucchati. Addhā vatassāhaṃ cittaṃ ārādhessāmi pañhassa veyyākaraṇenā’’ti.",
      "english": "Then this thought occurred to the brahmin Sonadanda: \"Oh, what was truly our wish, our fervent longing, our intention, our dearest hope—'Oh, if only the recluse Gotama would question me regarding my own ancestral knowledge of the Three Vedas, then surely I would satisfy him by answering the question.' And now, the recluse Gotama is indeed questioning me regarding my own ancestral knowledge of the Three Vedas. Surely I shall satisfy him by answering the question.\"",
      "sinhala": "එවිට සෝණදණ්ඩ බ්‍රාහ්මණයාට මෙසේ සිතුණි: “‘අහෝ! ශ්‍රමණ ගෝතමයන් වහන්සේ මාගේ ආචාර්ය සම්ප්‍රදායට අයත් ත්‍රිවේදය පිළිබඳව ප්‍රශ්නයක් විමසන්නේ නම්, මා ප්‍රශ්නයට පිළිතුරු දීමෙන් වහන්සේගේ සිත සතුටු කරන්නෙමි’ යනුවෙන් අප විසින් යමක් කැමති වූයේ ද, යමක් ප්‍රාර්ථනා කරන ලද්දේ ද, යමක් අදහස් කරන ලද්දේ ද, යමක් පැතූයේ ද, එහිදී ශ්‍රමණ ගෝතමයන් වහන්සේ මාගේ ආචාර්ය සම්ප්‍රදායට අයත් ත්‍රිවේදය පිළිබඳව මාගෙන් ප්‍රශ්නයක් විමසති. නිසැකයෙන්ම මම ප්‍රශ්නයට පිළිතුරු දීමෙන් වහන්සේගේ සිත සතුටු කරන්නෙමි.”",
      "paliTitle": ""
    },
    {
      "number": 311,
      "pali": "Atha kho soṇadaṇḍo brāhmaṇo abbhunnāmetvā kāyaṃ anuviloketvā parisaṃ bhagavantaṃ etadavoca – ‘‘pañcahi, bho gotama, aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyya. Katamehi pañcahi? Idha, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca, saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ajjhāyako hoti mantadharo tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; abhirūpo hoti dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya; sīlavā hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho gotama, pañcahi aṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti. ‘‘Imesaṃ pana, brāhmaṇa, pañcannaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā catūhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā, bho gotama. Imesañhi, bho gotama, pañcannaṃ aṅgānaṃ vaṇṇaṃ ṭhapayāma. Kiñhi vaṇṇo karissati? Yato kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; ajjhāyako ca hoti mantadharo ca tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo; sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho bho gotama catūhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti.",
      "english": "Then the brahmin Sonadaṇḍa, rising up and looking around the assembly, said this to the Blessed One: “Good Gotama, brahmins declare a person to be a brahmin endowed with five factors; and one who says ‘I am a brahmin’ would speak correctly, and would not fall into falsehood. Which five? Here, good Gotama, a brahmin is well-born on both sides, from his mother and his father, with pure lineage up to the seventh generation of ancestors, unchallenged and unblemished in respect of birth; he is a reciter and a mantra-holder, one who has mastered the three Vedas with their lexicons and rituals, their phonology and etymology, and fifthly, their histories; he is skilled in prosody, grammar, the philosophy of nature, and the marks of a great man, unimpaired in these; he is handsome, good-looking, pleasing, endowed with supreme beauty of complexion, with a divine complexion and presence, not one whose appearance is contemptible; he is virtuous, of mature virtue, endowed with mature virtue; and he is wise and intelligent, first or second among those who grasp understanding. Indeed, good Gotama, with these five factors endowed, brahmins declare a person to be a brahmin; and one who says ‘I am a brahmin’ would speak correctly, and would not fall into falsehood.”\n\n“But, brahmin, of these five factors, is it possible, by leaving out one factor, for brahmins to declare a person to be a brahmin endowed with four factors; and for one who says ‘I am a brahmin’ to speak correctly, and not fall into falsehood?” “It is possible, good Gotama. Indeed, good Gotama, of these five factors, we can set aside physical beauty. What, after all, will physical beauty accomplish? For when, good Gotama, a brahmin is well-born on both sides, from his mother and his father, with pure lineage up to the seventh generation of ancestors, unchallenged and unblemished in respect of birth; and he is a reciter and a mantra-holder, one who has mastered the three Vedas with their lexicons and rituals, their phonology and etymology, and fifthly, their histories; he is skilled in prosody, grammar, the philosophy of nature, and the marks of a great man, unimpaired in these; and he is virtuous, of mature virtue, endowed with mature virtue; and he is wise and intelligent, first or second among those who grasp understanding. Indeed, good Gotama, with these four factors endowed, brahmins declare a person to be a brahmin; and one who says ‘I am a brahmin’ would speak correctly, and would not fall into falsehood.”",
      "sinhala": "ඉන්පසු සෝණදණ්ඩ බ්‍රාහ්මණයා ශරීරය උස්සා, පිරිස දෙස විමසා බලා භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය: ‘‘භවත් ගෞතමයන් වහන්ස, කරුණු පහකින් යුක්ත වූ පුද්ගලයෙකු බ්‍රාහ්මණයෝ බ්‍රාහ්මණයා ලෙස පනවති; ‘මම බ්‍රාහ්මණ වෙමි’ යැයි පවසන්නේ නම් නිවැරදිව පවසනු ඇත, බොරු කීමකට වැටෙන්නේ නැත. ඒ කරුණු පහ කවරේද? භවත් ගෞතමයන් වහන්ස, මෙහි බ්‍රාහ්මණයා මව් පසින්ද පිය පසින්ද දෙපසින්ම හොඳින් උපන්නේ වේ. හත්වන මුතුන්මිත්තන්ගේ පරම්පරාව දක්වාම පිරිසිදු උපතක් ඇත්තේ වේ. ජාතිය සම්බන්ධයෙන් කිසිදු දෝෂයකට හෝ නින්දාවකට ලක් නොවූවෙකි; ත්‍රිවේදයට දක්ෂ වූ, නිඝණ්ඩු හා කේටුභ ඇතුළු, අක්ෂර ප්‍රභේද සහිත, ඉතිහාසය පස්වැනි කොටස ලෙස ඇත්තා වූ, මන්ත්‍රධාරී වූ, පද සහ ව්‍යාකරණ දත්, ලෝකායත සහ මහාපුරුෂ ලක්ෂණ පිළිබඳව අඩුවක් නැත්තා වූ වේ; රූපශ්‍රීයෙන් යුක්ත වූ, දැකීමට ප්‍රිය උපදවන, පහසුවෙන් දැක්ක හැකි, අතිශයින්ම පිරිසිදු වර්ණයක් හා පැහැයක් ඇත්තා වූ, බ්‍රහ්ම වර්ණයෙන් හා බ්‍රහ්ම තේජසින් යුක්ත වූ, දැක්මට කිසිදු අඩුපාඩුවක් නැත්තා වූ වේ; සිල්වත් වූ, වෘද්ධ ශීලයෙන් යුක්ත වූ, වෘද්ධ ශීලයෙන් සමන්විත වූ වේ; පණ්ඩිත වූ, නුවණැති වූ, අතට ගත් දෙයක් ඉදිරියට ගෙන යන අය අතරින් පළමුවැන්නා හෝ දෙවැන්නා වූ වේ. භවත් ගෞතමයන් වහන්ස, මේ කරුණු පහකින් යුක්ත වූ පුද්ගලයෙකු බ්‍රාහ්මණයෝ බ්‍රාහ්මණයා ලෙස පනවති; ‘මම බ්‍රාහ්මණ වෙමි’ යැයි පවසන්නේ නම් නිවැරදිව පවසනු ඇත, බොරු කීමකට වැටෙන්නේ නැත.’’\n\n‘‘බ්‍රාහ්මණය, එහෙත් මේ කරුණු පහෙන් එක කරුණක් ඉවත් කොට, සතර කරුණකින් යුක්ත වූ පුද්ගලයෙකු බ්‍රාහ්මණයෝ බ්‍රාහ්මණයා ලෙස පැණවිය හැකිද? ‘මම බ්‍රාහ්මණ වෙමි’ යැයි පවසන්නේ නම් නිවැරදිව පවසනු ඇත, බොරු කීමකට වැටෙන්නේ නැතැයි කිය හැකිද?’’ ‘‘භවත් ගෞතමයන් වහන්ස, හැකි වේ. භවත් ගෞතමයන් වහන්ස, මේ කරුණු පහෙන් වර්ණය ඉවත් කරමු. වර්ණය කුමක් කරන්නේද? යම් හෙයකින් භවත් ගෞතමයන් වහන්ස, බ්‍රාහ්මණයා මව් පසින්ද පිය පසින්ද දෙපසින්ම හොඳින් උපන්නේ වේ නම්, හත්වන මුතුන්මිත්තන්ගේ පරම්පරාව දක්වාම පිරිසිදු උපතක් ඇත්තේ වේ නම්, ජාතිය සම්බන්ධයෙන් කිසිදු දෝෂයකට හෝ නින්දාවකට ලක් නොවූවෙකි නම්; ත්‍රිවේදයට දක්ෂ වූ, නිඝණ්ඩු හා කේටුභ ඇතුළු, අක්ෂර ප්‍රභේද සහිත, ඉතිහාසය පස්වැනි කොටස ලෙස ඇත්තා වූ, මන්ත්‍රධාරී වූ, පද සහ ව්‍යාකරණ දත්, ලෝකායත සහ මහාපුරුෂ ලක්ෂණ පිළිබඳව අඩුවක් නැත්තා වූ වේ නම්; සිල්වත් වූ, වෘද්ධ ශීලයෙන් යුක්ත වූ, වෘද්ධ ශීලයෙන් සමන්විත වූ වේ නම්; පණ්ඩිත වූ, නුවණැති වූ, අතට ගත් දෙයක් ඉදිරියට ගෙන යන අය අතරින් පළමුවැන්නා හෝ දෙවැන්නා වූ වේ නම්, භවත් ගෞතමයන් වහන්ස, මේ කරුණු සතරකින් යුක්ත වූ පුද්ගලයෙකු බ්‍රාහ්මණයෝ බ්‍රාහ්මණයා ලෙස පනවති; ‘මම බ්‍රාහ්මණ වෙමි’ යැයි පවසන්නේ නම් නිවැරදිව පවසනු ඇත, බොරු කීමකට වැටෙන්නේ නැතැයි කියනු ඇත.’’",
      "paliTitle": ""
    },
    {
      "number": 312,
      "pali": "‘‘Imesaṃ pana, brāhmaṇa, catunnaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā tīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā, bho gotama. Imesañhi, bho gotama, catunnaṃ aṅgānaṃ mante ṭhapayāma. Kiñhi mantā karissanti? Yato kho, bho gotama, brāhmaṇo ubhato sujāto hoti mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena; sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho gotama, tīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti. ‘‘Imesaṃ pana, brāhmaṇa, tiṇṇaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘Sakkā, bho gotama. Imesañhi, bho gotama, tiṇṇaṃ aṅgānaṃ jātiṃ ṭhapayāma. Kiñhi jāti karissati? Yato kho, bho gotama, brāhmaṇo sīlavā hoti vuddhasīlī vuddhasīlena samannāgato; paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho gotama, dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti.",
      "english": "“But, brahmin, of these four qualities, is it possible, setting aside one quality, for brahmins to declare a person a brahmin if he is endowed with three qualities, and for him to rightly say ‘I am a brahmin’ without incurring falsehood?”\n\n“It is possible, Master Gotama. Indeed, Master Gotama, of these four qualities, we set aside the chants. For what can chants accomplish? When, Master Gotama, a brahmin is well-born on both sides, from mother and father, pure in his lineage back through seven generations of ancestors, without reproach and unblemished in terms of birth; and is virtuous, endowed with mature virtue; and is wise and intelligent, either the first or second among those who grasp understanding. Master Gotama, brahmins declare a person a brahmin if he is endowed with these three qualities, and he would rightly say ‘I am a brahmin’ without incurring falsehood.”\n\n“But, brahmin, of these three qualities, is it possible, setting aside one quality, for brahmins to declare a person a brahmin if he is endowed with two qualities, and for him to rightly say ‘I am a brahmin’ without incurring falsehood?”\n\n“It is possible, Master Gotama. Indeed, Master Gotama, of these three qualities, we set aside birth. For what can birth accomplish? When, Master Gotama, a brahmin is virtuous, endowed with mature virtue; and is wise and intelligent, either the first or second among those who grasp understanding. Master Gotama, brahmins declare a person a brahmin if he is endowed with these two qualities, and he would rightly say ‘I am a brahmin’ without incurring falsehood.”",
      "sinhala": "''එහෙත් බ්‍රාහ්මණය, මේ කරුණු සතරින් එක් අංගයක් අත්හැර දමා අංග තුනකින් යුක්ත වූ තැනැත්තකු බ්‍රාහ්මණ​වරුන්ට ප්‍ර​කාශ කළ හැකි ද? 'මම බ්‍රාහ්මණ​ කෙනෙක්මි' යි පවසන්නේ නිවැරදිව පවසන්නේ ද, බොරු නොකියන්නේ ද?''\n''පුළුවන, භවත් ගෞතමය. භවත් ගෞතමය, මේ කරුණු සතරින් මන්ත්‍ර​ අත්හරිමු. මන්ත්‍ර​ කුමක් කරන්නේ ද? භවත් ගෞතමය, යම් හෙයකින් බ්‍රාහ්මණ​යා මවගෙන් ද, පියාගෙන් ද, සත්වන මුතුන්මිත්තා දක්වා දෙපාර්ශවයෙන්ම හොඳින් උපන්නේ වේ ද, කුල වශයෙන් නිර්දෝෂ වේ ද, උපත පිළිබඳව දොස් නොලත්, නින්දා නොලත් කෙනෙක් වේ ද; සිල්වත් වේ ද, වැඩිහිටි සීලයෙන් යුක්ත වේ ද; ප්‍ර​ඥාවන්ත, නුවණැති වේ ද, (දැනුම) උකහා ගන්නන් අතර පළමු හෝ දෙවෙනියා වේ ද – භවත් ගෞතමය, මේ අංග තුනෙන් යුක්ත වූ තැනැත්තා බ්‍රාහ්මණ​යෙකු යයි බ්‍රාහ්මණ​වරු ප්‍ර​කාශ කරති; 'මම බ්‍රාහ්මණ​ කෙනෙක්මි' යි පවසන්නේ නිවැරදිව පවසන්නේ ය, බොරු නොකියන්නේ ය.''\n\n''එහෙත් බ්‍රාහ්මණය, මේ අංග තුනෙන් එක් අංගයක් අත්හැර දමා අංග දෙකකින් යුක්ත වූ තැනැත්තකු බ්‍රාහ්මණ​වරුන්ට ප්‍ර​කාශ කළ හැකි ද? 'මම බ්‍රාහ්මණ​ කෙනෙක්මි' යි පවසන්නේ නිවැරදිව පවසන්නේ ද, බොරු නොකියන්නේ ද?''\n''පුළුවන, භවත් ගෞතමය. භවත් ගෞතමය, මේ අංග තුනෙන් උපත අත්හරිමු. උපත කුමක් කරන්නේ ද? භවත් ගෞතමය, යම් හෙයකින් බ්‍රාහ්මණ​යා සිල්වත් වේ ද, වැඩිහිටි සීලයෙන් යුක්ත වේ ද; ප්‍ර​ඥාවන්ත, නුවණැති වේ ද, (දැනුම) උකහා ගන්නන් අතර පළමු හෝ දෙවෙනියා වේ ද – භවත් ගෞතමය, මේ අංග දෙකෙන් යුක්ත වූ තැනැත්තා බ්‍රාහ්මණ​යෙකු යයි බ්‍රාහ්මණ​වරු ප්‍ර​කාශ කරති; 'මම බ්‍රාහ්මණ​ කෙනෙක්මි' යි පවසන්නේ නිවැරදිව පවසන්නේ ය, බොරු නොකියන්නේ ය.''",
      "paliTitle": ""
    },
    {
      "number": 313,
      "pali": "Evaṃ vutte, te brāhmaṇā soṇadaṇḍaṃ brāhmaṇaṃ etadavocuṃ – ‘‘mā bhavaṃ soṇadaṇḍo evaṃ avaca, mā bhavaṃ soṇadaṇḍo evaṃ avaca. Apavadateva bhavaṃ soṇadaṇḍo vaṇṇaṃ, apavadati mante, apavadati jātiṃ ekaṃsena. Bhavaṃ soṇadaṇḍo samaṇasseva gotamassa vādaṃ anupakkhandatī’’ti.",
      "english": "When this was said, those brahmins spoke to the brahmin Sonadanda: “Venerable Sonadanda, do not speak like that! Venerable Sonadanda, do not speak like that! Venerable Sonadanda is indeed disparaging our caste, disparaging our sacred texts, and utterly disparaging our birth. Venerable Sonadanda is siding with the views of the ascetic Gotama!”",
      "sinhala": "මෙලෙස පැවසූ කල්හි, එම බ්‍රාහ්මණවරු සෝණදණ්ඩ බ්‍රාහ්මණයාට මෙසේ පැවසූහ – ‘‘පින්වත් සෝණදණ්ඩ, මෙසේ නොකියනු මැනව, පින්වත් සෝණදණ්ඩ, මෙසේ නොකියනු මැනව. පින්වත් සෝණදණ්ඩ, ඔබ වර්ණයට නිග්‍රහ කරයි, ඔබ මන්ත්‍රවලට නිග්‍රහ කරයි, ඔබ ජාතියටම එකහෙළා නිග්‍රහ කරයි. පින්වත් සෝණදණ්ඩ, ඔබ ශ්‍රමණ ගෞතමයන්ගේම වාදය අනුගමනය කරන්නෙහිය.’’",
      "paliTitle": ""
    },
    {
      "number": 314,
      "pali": "Atha kho bhagavā te brāhmaṇe etadavoca – ‘‘sace kho tumhākaṃ brāhmaṇānaṃ evaṃ hoti – ‘appassuto ca soṇadaṇḍo brāhmaṇo, akalyāṇavākkaraṇo ca soṇadaṇḍo brāhmaṇo, duppañño ca soṇadaṇḍo brāhmaṇo, na ca pahoti soṇadaṇḍo brāhmaṇo samaṇena gotamena saddhiṃ asmiṃ vacane paṭimantetu’nti, tiṭṭhatu soṇadaṇḍo brāhmaṇo, tumhe mayā saddhiṃ mantavho asmiṃ vacane. Sace pana tumhākaṃ brāhmaṇānaṃ evaṃ hoti – ‘bahussuto ca soṇadaṇḍo brāhmaṇo, kalyāṇavākkaraṇo ca soṇadaṇḍo brāhmaṇo, paṇḍito ca soṇadaṇḍo brāhmaṇo, pahoti ca soṇadaṇḍo brāhmaṇo samaṇena gotamena saddhiṃ asmiṃ vacane paṭimantetu’nti, tiṭṭhatha tumhe, soṇadaṇḍo brāhmaṇo mayā saddhiṃ paṭimantetū’’ti.",
      "english": "Then the Blessed One said this to those brahmins: \"If indeed it is thus for you brahmins: 'Soṇadaṇḍa the brahmin is unlearned, Soṇadaṇḍa the brahmin has unskillful speech, Soṇadaṇḍa the brahmin is unwise, and Soṇadaṇḍa the brahmin is unable to engage in discourse with the ascetic Gotama on this matter,' then let Soṇadaṇḍa the brahmin remain, and you yourselves discuss this matter with me. If, however, it is thus for you brahmins: 'Soṇadaṇḍa the brahmin is learned, Soṇadaṇḍa the brahmin has skillful speech, Soṇadaṇḍa the brahmin is wise, and Soṇadaṇḍa the brahmin is able to engage in discourse with the ascetic Gotama on this matter,' then you yourselves remain, and let Soṇadaṇḍa the brahmin engage in discourse with me.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ ඒ බ්‍රාහ්මණයන්ට මෙය වදාළ සේක: \"යම් හෙයකින් ඔබට, බ්‍රාහ්මණයන් හට, මෙසේ සිතේ නම් – 'සෝණදණ්ඩ බ්‍රාහ්මණයා අල්පශ්‍රැතය, සෝණදණ්ඩ බ්‍රාහ්මණයා හොඳින් කතා කිරීමට දක්ෂ නැත, සෝණදණ්ඩ බ්‍රාහ්මණයා දුෂ්ප්‍රාඥය, සෝණදණ්ඩ බ්‍රාහ්මණයාට ශ්‍රමණ ගෞතමයන් වහන්සේ සමඟ මේ වචන පිළිබඳව ප්‍රතිමन्त्रණය කිරීමට නොහැකිය' යි, සෝණදණ්ඩ බ්‍රාහ්මණයා සිටීවා, ඔබලා මා සමඟ මේ වචන පිළිබඳව කතා කරන්න. එහෙත් යම් හෙයකින් ඔබට, බ්‍රාහ්මණයන් හට, මෙසේ සිතේ නම් – 'සෝණදණ්ඩ බ්‍රාහ්මණයා බහුශ්‍රැතය, සෝණදණ්ඩ බ්‍රාහ්මණයා කතා කිරීමෙහි දක්ෂය, සෝණදණ්ඩ බ්‍රාහ්මණයා පණ්ඩිතය, සෝණදණ්ඩ බ්‍රාහ්මණයාට ශ්‍රමණ ගෞතමයන් වහන්සේ සමඟ මේ වචන පිළිබඳව ප්‍රතිමन्त्रණය කිරීමට හැකිය' යි, ඔබලා සිටින්න, සෝණදණ්ඩ බ්‍රාහ්මණයා මා සමඟ ප්‍රතිමन्त्रණය කරත්වා.\"",
      "paliTitle": ""
    },
    {
      "number": 315,
      "pali": "Evaṃ vutte, soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘tiṭṭhatu bhavaṃ gotamo, tuṇhī bhavaṃ gotamo hotu, ahameva tesaṃ sahadhammena paṭivacanaṃ karissāmī’’ti. Atha kho soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca – ‘‘mā bhavanto evaṃ avacuttha, mā bhavanto evaṃ avacuttha – ‘apavadateva bhavaṃ soṇadaṇḍo vaṇṇaṃ, apavadati mante, apavadati jātiṃ ekaṃsena. Bhavaṃ soṇadaṇḍo samaṇasseva gotamassa vādaṃ anupakkhandatī’ti. Nāhaṃ, bho, apavadāmi vaṇṇaṃ vā mante vā jātiṃ vā’’ti.",
      "english": "When this was said, the Brahmin Sonadaṇḍa said to the Blessed One, \"Let Master Gotama please wait, let Master Gotama be silent, I myself will give them a righteous reply.\" Then indeed, the Brahmin Sonadaṇḍa said to those Brahmins, \"Sirs, do not speak thus, sirs, do not speak thus: 'Master Sonadaṇḍa indeed disparages caste, disparages the Vedic hymns, disparages birth entirely. Master Sonadaṇḍa is assenting to the view of the recluse Gotama himself.' Sirs, I do not disparage caste, or the Vedic hymns, or birth.\"",
      "sinhala": "මෙසේ පැවසූ කල්හි, සෝණදණ්ඩ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය – ‘‘ගෞතම භවත්තුමා නවතීවා, ගෞතම භවත්තුමා නිශ්ශබ්ද වේවා, මා විසින්ම ඔවුන්ට ධර්මානුකූලව පිළිතුරු දෙන්නෙමි.’’\n\nඉන්පසු සෝණදණ්ඩ බ්‍රාහ්මණයා එම බ්‍රාහ්මණයන්ට මෙය පැවසීය – ‘‘ඔබලා මෙසේ නොකියත්වා, ඔබලා මෙසේ නොකියත්වා – ‘සෝණදණ්ඩ භවත්තුමා වර්ණයට නින්දා කරයි, මන්ත්‍රයන්ට නින්දා කරයි, ජාතියට තනිකරම නින්දා කරයි. සෝණදණ්ඩ භවත්තුමා ශ්‍රමණ ගෞතමයන්ගේම මතයට අනුග්‍රහය දක්වයි’යි. අනේ භවත්නි, මා විසින් වර්ණයට හෝ මන්ත්‍රයන්ට හෝ ජාතියට හෝ නින්දා කරන්නේ නොවේ.’’",
      "paliTitle": ""
    },
    {
      "number": 316,
      "pali": "Tena kho pana samayena soṇadaṇḍassa brāhmaṇassa bhāgineyyo aṅgako nāma māṇavako tassaṃ parisāyaṃ nisinno hoti. Atha kho soṇadaṇḍo brāhmaṇo te brāhmaṇe etadavoca – ‘‘passanti no bhonto imaṃ aṅgakaṃ māṇavakaṃ amhākaṃ bhāgineyya’’nti? ‘‘Evaṃ, bho’’. ‘‘Aṅgako kho, bho, māṇavako abhirūpo dassanīyo pāsādiko paramāya vaṇṇapokkharatāya samannāgato brahmavaṇṇī brahmavacchasī akhuddāvakāso dassanāya, nāssa imissaṃ parisāyaṃ samasamo atthi vaṇṇena ṭhapetvā samaṇaṃ gotamaṃ. Aṅgako kho māṇavako ajjhāyako mantadharo, tiṇṇaṃ vedānaṃ pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo. Ahamassa mante vācetā. Aṅgako kho māṇavako ubhato sujāto mātito ca pitito ca saṃsuddhagahaṇiko yāva sattamā pitāmahayugā akkhitto anupakkuṭṭho jātivādena. Ahamassa mātāpitaro jānāmi. Aṅgako kho māṇavako pāṇampi haneyya, adinnampi ādiyeyya, paradārampi gaccheyya, musāvādampi bhaṇeyya, majjampi piveyya, ettha dāni, bho, kiṃ vaṇṇo karissati, kiṃ mantā, kiṃ jāti? Yato kho, bho, brāhmaṇo sīlavā ca hoti vuddhasīlī vuddhasīlena samannāgato, paṇḍito ca hoti medhāvī paṭhamo vā dutiyo vā sujaṃ paggaṇhantānaṃ. Imehi kho, bho, dvīhaṅgehi samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapenti; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti.",
      "english": "Now at that time, the young brahmin Angaka, nephew of the brahmin Sonadaṇḍa, was seated in that assembly. Then the brahmin Sonadaṇḍa said to those brahmins, \"Do you gentlemen see this young brahmin Angaka, my nephew?\" \"Yes, sir.\" \"Indeed, gentlemen, the young brahmin Angaka is handsome, good-looking, and pleasant. He possesses the utmost beauty of complexion, having the complexion and radiance of a Brahma, and an expansive aura. There is no one in this assembly his equal in beauty, except for the ascetic Gotama. Indeed, the young brahmin Angaka is a reciter and a master of the Vedic hymns, skilled in the three Vedas—together with their vocabularies, rituals, phonology, etymology, and as the fifth, the Puranas. He is proficient in grammar and analysis, and faultless in the philosophy of nature and the marks of a Great Man. I am the one who taught him the hymns. Indeed, the young brahmin Angaka is well-born on both sides, from his mother and father, with a pure lineage back through seven generations of ancestors, unassailable and irreproachable regarding his birth. I know his parents. Indeed, the young brahmin Angaka might even kill a living being, might even take what is not given, might even go with another's wife, might even speak falsely, might even drink intoxicants. In such a case, gentlemen, what would his appearance accomplish, what his Vedic hymns, what his birth? For, gentlemen, if a brahmin is virtuous, endowed with developed, advanced virtue, and is wise, intelligent, either the first or second among those holding the sacred thread. It is by these two factors, gentlemen, that brahmins define a brahmin; and if such a one declares, 'I am a brahmin,' he would be speaking correctly and would not be falling into falsehood.\"",
      "sinhala": "ඒ අවස්ථාවේදී සෝණදණ්ඩ බ්‍රාහ්මණයාගේ අංගක නම් මානවකයා ඒ පිරිස මැද වාඩි වී සිටියේය. ඉක්බිති සෝණදණ්ඩ බ්‍රාහ්මණයා ඒ බ්‍රාහ්මණයන්ට මෙසේ කීවේය – ‘‘පින්වතුනි, අපගේ බෑණණුවන් වන මේ අංගක මානවකයා ඔබ දකින්නහුද?’’ ‘‘එසේය, පින්වත.’’ ‘‘පින්වතුනි, අංගක මානවකයා නම් අතිශයින් රූප සම්පන්නය, දැකුම්කළුය, ප්‍රසන්නය, උත්තරීතර වූ ශරීර වර්ණයකින් යුක්තය, බ්‍රහ්ම වර්ණ ඇත්තේය, බ්‍රහ්ම ශ්‍රීය ඇත්තේය, දැකීමට සුදුසු අවකාශ ඇත්තේය. ශ්‍රමණ ගෞතමයන් වහන්සේ හැර, මේ පිරිසෙහි වර්ණයෙන් ඔහුට සමකෙනෙක් නැත. අංගක මානවකයා නම් මන්ත්‍ර පාඩම් කරන්නෙකි, මන්ත්‍රධරයෙකි, නිඝණ්ඩු සහ කේටුභ සමගද, අක්ෂර ප්‍රභේද සහිතවද, ඉතිහාසය පස්වැනියා කොටද ඇති තුන් වේදයෙහි පරතෙරට ගියෙකි. පද විග්‍රහ කරන්නෙකි, ව්‍යාකරණ ශාස්ත්‍රයෙහි දක්ෂයෙකි, ලෝකායත හා මහා පුරුෂ ලක්ෂණ ශාස්ත්‍රයෙහි අග්‍රයෙකි. මම ඔහුට මන්ත්‍ර උගන්වන්නා වෙමි. අංගක මානවකයා නම් මවගෙන්ද පියාගෙන්ද දෙපසින්ම මනා කොට උපන්නේය, සත්වන පීතෘ පරම්පරාව දක්වා පිරිසිදු වූ ගර්භයෙන් උපන්නේය, ජාතිවාදයෙන් කිසිදු දෝෂයකට ලක් නොවූ, නින්දාවට පත් නොවූ අයෙකි. මම ඔහුගේ මව්පියන් දනිමි. අංගක මානවකයා නම්, ප්‍රාණඝාතයද කරන්නේ නම්, අදත්තාදානයද කරන්නේ නම්, පරදාර සේවනයද කරන්නේ නම්, මුසාවාදයද කියන්නේ නම්, මත්පැන්ද පානය කරන්නේ නම්, එසේ වූ කල්හි දැන් පින්වතුනි, වර්ණය කුමක් කරන්නේද? මන්ත්‍ර කුමක් කරන්නේද? ජාතිය කුමක් කරන්නේද? යම් හෙයකින් පින්වතුනි, බ්‍රාහ්මණයා සිල්වත්ව සිටී නම්, වැඩිදියුණු වූ සීලයෙන් යුක්තව සිටී නම්, පණ්ඩිතයෙක්ද, නුවණැත්තෙක්ද වෙයි නම්, ශ්‍රේෂ්ඨත්වය අත්කරගන්නවුන් අතුරින් පළමුවැන්නා හෝ දෙවැන්නා වෙයි නම්. පින්වතුනි, මේ අංග දෙකෙන් යුක්ත වූ බ්‍රාහ්මණයා, බ්‍රාහ්මණයන් විසින් බ්‍රාහ්මණයෙක් ලෙස ප්‍රඥප්ත කරනු ලැබේ. ‘මම බ්‍රාහ්මණයෙක්මි’යි කියන්නේද, නිවැරදිව කියන්නේය, මුසාවාදයට පත් නොවන්නේය.’’",
      "paliTitle": ""
    },
    {
      "number": 317,
      "pali": "‘‘Imesaṃ pana, brāhmaṇa, dvinnaṃ aṅgānaṃ sakkā ekaṃ aṅgaṃ ṭhapayitvā ekena aṅgena samannāgataṃ brāhmaṇā brāhmaṇaṃ paññapetuṃ; ‘brāhmaṇosmī’ti ca vadamāno sammā vadeyya, na ca pana musāvādaṃ āpajjeyyā’’ti? ‘‘No hidaṃ, bho gotama. Sīlaparidhotā hi, bho gotama, paññā; paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati. Seyyathāpi, bho gotama, hatthena vā hatthaṃ dhoveyya, pādena vā pādaṃ dhoveyya; evameva kho, bho gotama, sīlaparidhotā paññā, paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyatī’’ti. ‘‘Evametaṃ, brāhmaṇa, evametaṃ, brāhmaṇa, sīlaparidhotā hi, brāhmaṇa, paññā, paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati. Seyyathāpi, brāhmaṇa, hatthena vā hatthaṃ dhoveyya, pādena vā pādaṃ dhoveyya; evameva kho, brāhmaṇa, sīlaparidhotā paññā, paññāparidhotaṃ sīlaṃ. Yattha sīlaṃ tattha paññā, yattha paññā tattha sīlaṃ. Sīlavato paññā, paññavato sīlaṃ. Sīlapaññāṇañca pana lokasmiṃ aggamakkhāyati.",
      "english": "“But, brahmin, of these two factors, is it possible for brahmins to declare someone a brahmin, having set aside one factor, as being endowed with just one factor, and in saying ‘I am a brahmin’, would he speak rightly and not incur a falsehood?”\n\n“No, indeed, Venerable Gotama. For, Venerable Gotama, wisdom is purified by virtue, and virtue is purified by wisdom. Where there is virtue, there is wisdom; where there is wisdom, there is virtue. For the virtuous one, there is wisdom; for the wise one, there is virtue. And indeed, virtue and wisdom are declared foremost in the world. Just as, Venerable Gotama, one might wash hand with hand, or foot with foot; even so, Venerable Gotama, wisdom is purified by virtue, and virtue is purified by wisdom. Where there is virtue, there is wisdom; where there is wisdom, there is virtue. For the virtuous one, there is wisdom; for the wise one, there is virtue. And indeed, virtue and wisdom are declared foremost in the world.”\n\n“So it is, brahmin, so it is, brahmin. For, brahmin, wisdom is purified by virtue, and virtue is purified by wisdom. Where there is virtue, there is wisdom; where there is wisdom, there is virtue. For the virtuous one, there is wisdom; for the wise one, there is virtue. And indeed, virtue and wisdom are declared foremost in the world. Just as, brahmin, one might wash hand with hand, or foot with foot; even so, brahmin, wisdom is purified by virtue, and virtue is purified by wisdom. Where there is virtue, there is wisdom; where there is wisdom, there is virtue. For the virtuous one, there is wisdom; for the wise one, there is virtue. And indeed, virtue and wisdom are declared foremost in the world.”",
      "sinhala": "එසේනම්, බ්‍රාහ්මණය, මේ අංග දෙකෙන් එක අංගයක් අත්හැර, එක් අංගයකින් සමන්විත බ්‍රාහ්මණයකු බ්‍රාහ්මණයා ලෙස ප්‍රකාශ කිරීමට හැකිද? 'මම බ්‍රාහ්මණයෙක්මි' යැයි කියන්නා නිවැරදිව කියයි ද, බොරු කීමකට නොවැටෙයි ද? නැත, භවත් ගෞතමය. භවත් ගෞතමය, සිල් පිරිසිදු කරන ලද්දී ප්‍රඥාවයි; ප්‍රඥාව පිරිසිදු කරන ලද්දේ සිල්ය. සිල් ඇති තැන ප්‍රඥාව ඇත, ප්‍රඥාව ඇති තැන සිල් ඇත. සිල් ඇත්තාට ප්‍රඥාව ඇත, ප්‍රඥාව ඇත්තාට සිල් ඇත. තවද, සිල් හා ප්‍රඥාව මේ ලෝකයෙහි අග්‍ර යැයි කියනු ලැබේ. භවත් ගෞතමයෙනි, යම් සේ අතින් අත සෝදයි ද, පයින් පා සෝදයි ද; භවත් ගෞතමය, එසේම සිල් පිරිසිදු කරන ලද්දී ප්‍රඥාවයි, ප්‍රඥාව පිරිසිදු කරන ලද්දේ සිල්ය. සිල් ඇති තැන ප්‍රඥාව ඇත, ප්‍රඥාව ඇති තැන සිල් ඇත. සිල් ඇත්තාට ප්‍රඥාව ඇත, ප්‍රඥාව ඇත්තාට සිල් ඇත. තවද, සිල් හා ප්‍රඥාව මේ ලෝකයෙහි අග්‍ර යැයි කියනු ලැබේ. බ්‍රාහ්මණය, මෙය එසේමය, බ්‍රාහ්මණය, මෙය එසේමය. බ්‍රාහ්මණය, සිල් පිරිසිදු කරන ලද්දී ප්‍රඥාවයි, ප්‍රඥාව පිරිසිදු කරන ලද්දේ සිල්ය. සිල් ඇති තැන ප්‍රඥාව ඇත, ප්‍රඥාව ඇති තැන සිල් ඇත. සිල් ඇත්තාට ප්‍රඥාව ඇත, ප්‍රඥාව ඇත්තාට සිල් ඇත. තවද, සිල් හා ප්‍රඥාව මේ ලෝකයෙහි අග්‍ර යැයි කියනු ලැබේ. බ්‍රාහ්මණය, යම් සේ අතින් අත සෝදයි ද, පයින් පා සෝදයි ද; බ්‍රාහ්මණය, එසේම සිල් පිරිසිදු කරන ලද්දී ප්‍රඥාවයි, ප්‍රඥාව පිරිසිදු කරන ලද්දේ සිල්ය. සිල් ඇති තැන ප්‍රඥාව ඇත, ප්‍රඥාව ඇති තැන සිල් ඇත. සිල් ඇත්තාට ප්‍රඥාව ඇත, ප්‍රඥාව ඇත්තාට සිල් ඇත. තවද, සිල් හා ප්‍රඥාව මේ ලෝකයෙහි අග්‍ර යැයි කියනු ලැබේ.",
      "paliTitle": "Sīlapaññākathā",
      "englishTitle": "Discourse on Virtue and Wisdom",
      "sinhalaTitle": "ශීල ප්‍රඥා කථාව"
    },
    {
      "number": 318,
      "pali": "‘‘Katamaṃ pana taṃ, brāhmaṇa, sīlaṃ? Katamā sā paññā’’ti? ‘‘Ettakaparamāva mayaṃ, bho gotama, etasmiṃ atthe. Sādhu vata bhavantaṃyeva gotamaṃ paṭibhātu etassa bhāsitassa attho’’ti. ‘‘Tena hi, brāhmaṇa, suṇohi; sādhukaṃ manasikarohi; bhāsissāmī’’ti. ‘‘Evaṃ, bho’’ti kho soṇadaṇḍo brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘idha, brāhmaṇa, tathāgato loke uppajjati arahaṃ sammāsambuddho…pe… (yathā 190-212 anucchedesu tathā vitthāretabbaṃ). Evaṃ kho, brāhmaṇa, bhikkhu sīlasampanno hoti. Idaṃ kho taṃ, brāhmaṇa, sīlaṃ…pe… paṭhamaṃ jhānaṃ upasampajja viharati…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati… pe… ñāṇadassanāya cittaṃ abhinīharati, abhininnāmeti. Idampissa hoti paññāya…pe… nāparaṃ itthattāyāti pajānāti, idampissa hoti paññāya ayaṃ kho sā, brāhmaṇa, paññā’’ti. ",
      "english": "“But what, brahmin, is that virtue? What is that wisdom?” “Regarding this matter, venerable Gotama, our understanding extends only thus far. It would be good indeed if the venerable Gotama himself would clarify the meaning of this statement.” “Then, brahmin, listen; pay careful attention; I will speak.” “Yes, venerable sir,” replied the brahmin Sonadaṇḍa to the Blessed One. The Blessed One spoke this:\n\n“Here, brahmin, a Tathāgata arises in the world, an Arahant, a Perfectly Self-Awakened One. He teaches the Dhamma, and a disciple, having heard the Dhamma, goes forth from home to homelessness and completes the training in virtue. Thus, brahmin, a monk becomes accomplished in virtue. This, brahmin, is that virtue. Having thus fulfilled virtue, he enters and remains in the first jhāna, the second jhāna, the third jhāna, and the fourth jhāna. He directs and inclines his mind to knowledge and vision. This too is of his wisdom. He understands that there is no further state of being, and this too is of his wisdom. This, brahmin, is that wisdom.”",
      "sinhala": "\"බ්‍රාහ්මණය, එම ශීලය කුමක්ද? එම ප්‍රඥාව කුමක්ද?\"\n\"භවත් ගෞතමයන් වහන්ස, මේ අර්ථය ගැන අපට මේ පමණක් මිස තවදුරටත් දැනුමක් නැත. භවත් ගෞතමයන් වහන්සේටම මේ වචනයේ අර්ථය පැහැදිලි වීම මැනවි.\"\n\"එසේ නම්, බ්‍රාහ්මණය, අසන්න; මැනවින් මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි\"යි.\n\"භවත් අසනු මැනැවැ\"යි සොණදණ්ඩ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"බ්‍රාහ්මණය, මෙහිලා තථාගතයන් වහන්සේ ලෝකයේ පහළ වනුයේ අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ නමක ලෙසයි... ආදී වශයෙන්. බ්‍රාහ්මණය, මෙසේ භික්ෂුව ශීල සම්පන්න වේ. බ්‍රාහ්මණය, එම ශීලය මෙයයි... ආදී වශයෙන්... පළමුවන ධ්‍යානයට පැමිණ වාසය කරයි... ආදී වශයෙන්... දෙවන ධ්‍යානයට... ආදී වශයෙන්... තුන්වන ධ්‍යානයට... ආදී වශයෙන්... සතරවන ධ්‍යානයට පැමිණ වාසය කරයි... ආදී වශයෙන්... ඥාණ දර්ශනය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. මෙයද ඔහුගේ ප්‍රඥාව පිණිස වේ... ආදී වශයෙන්... නැවත මෙබඳු භවයක් නැතැයි ප්‍රත්‍යක්ෂයෙන් දනී. මෙයද ඔහුගේ ප්‍රඥාව පිණිස වේ. බ්‍රාහ්මණය, මේ එම ප්‍රඥාවයි.\"",
      "paliTitle": ""
    },
    {
      "number": 319,
      "pali": "Evaṃ vutte, soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi, dhammañca, bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gataṃ. Adhivāsetu ca me bhavaṃ gotamo svātanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena.",
      "english": "When this was said, the brahmin Sonadaṇḍa said to the Blessed One: \"Excellent, Master Gotama, excellent, Master Gotama. Just as, Master Gotama, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms; in the same way has the Dhamma been made clear by Master Gotama in manifold ways. I go for refuge to Master Gotama, and to the Dhamma, and to the Community of Bhikkhus. May Master Gotama remember me as a lay follower who has gone for refuge from this day forth as long as life lasts. And may Master Gotama consent to accept a meal from me tomorrow, together with the community of bhikkhus.\" The Blessed One consented by silence.",
      "sinhala": "මෙසේ කී කල්හි සෝණදණ්ඩ බ්‍රාහ්මණයා භාග්‍ය​වතුන් වහන්සේට මෙය කීවේය: \"භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, ඉතා මැනවි! භවත් ගෞතමයන් වහන්ස, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මග පෙන්වන්නේද, නැතහොත් 'ඇස් ඇත්තෝ රූප දකිත්වා' යනුවෙන් අන්ධකාරයේ තෙල් පහනක් දරන්නේද; එලෙසම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් ක්‍ර​මවලින් ධර්​මය ප්‍ර​කාශ කරන ලදී. ඒ මම භවත් ගෞතමයන් වහන්සේ, ධර්​මය සහ භික්ෂුසංඝයා සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය මා උපාසකයෙකු ලෙස භවත් ගෞතමයන් වහන්සේ පිළිගන්නා සේක්වා. හෙට දිනට භික්ෂුසංඝයා සමඟ මාගේ දානය භවත් ගෞතමයන් වහන්සේ පිළිගන්නා සේක්වා\" භාග්‍ය​වතුන් වහන්සේ නිහඬ භාවයෙන් එය පිළිගත් සේක.",
      "paliTitle": "Soṇadaṇḍaupāsakattapaṭivedanā",
      "englishTitle": "Declaration of Soṇadaṇḍa's Lay Followership",
      "sinhalaTitle": "සෝණදණ්ඩ උපාසකත‍්ව ප‍්‍රකාශය"
    },
    {
      "number": 320,
      "pali": "Atha kho soṇadaṇḍo brāhmaṇo bhagavato adhivāsanaṃ viditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi. Atha kho soṇadaṇḍo brāhmaṇo tassā rattiyā accayena sake nivesane paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā bhagavato kālaṃ ārocāpesi – ‘‘kālo, bho gotama, niṭṭhitaṃ bhatta’’nti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena soṇadaṇḍassa brāhmaṇassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho soṇadaṇḍo brāhmaṇo buddhappamukhaṃ bhikkhusaṅghaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi.",
      "english": "Then, indeed, the brahmin Sonadanda, having understood the Blessed One's acceptance, rose from his seat, saluted the Blessed One, circumambulated him clockwise, and departed.\n\nThen, after the passing of that night, the brahmin Sonadanda had excellent hard and soft foods prepared in his own dwelling, and then had the time announced to the Blessed One, saying, \"It is time, Venerable Gotama, the meal is ready.\"\n\nThen, in the forenoon, the Blessed One dressed, took his bowl and robe, and together with the community of monks, approached the dwelling of the brahmin Sonadanda; having approached, he sat down on the prepared seat.\n\nThen, indeed, the brahmin Sonadanda, with his own hands, satisfied and served the community of monks headed by the Buddha with excellent hard and soft foods.",
      "sinhala": "ඉන්පසු සෝණදණ්ඩ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේගේ පිළිගැනීම දැනගෙන, ආසනයෙන් නැඟිට, භාග්‍යවතුන් වහන්සේට ආචාර කොට, ප්‍රදක්ෂිණා කොට පිටත්ව ගියේය.\n\nඉන්පසු සෝණදණ්ඩ බ්‍රාහ්මණයා එම රාත්‍රිය පහන් වූ පසු තමාගේ නිවසේ ප්‍රණීත වූ කැවිලි හා කෑම පිළියෙල කරවාගෙන, \"භවත් ගෞතමයන් වහන්ස, වේලාවයි, දානය සූදානම්යැ\" යි භාග්‍යවතුන් වහන්සේට වේලාව දැන්වීය.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ පෙරවරු සමයෙහි සිවුරු පොරවා, පාත්‍රය හා සිවුර ගෙන භික්ෂුසංඝයා සමඟ සෝණදණ්ඩ බ්‍රාහ්මණයාගේ නිවස කරා වැඩම කළ සේක; එහි වැඩම කොට පනවන ලද අසුනෙහි වැඩ සිටි සේක.\n\nඉන්පසු සෝණදණ්ඩ බ්‍රාහ්මණයා බුදුන් වහන්සේ ප්‍රධාන කොට ඇති භික්ෂුසංඝයාට ප්‍රණීත වූ කැවිලි හා කෑමෙන් තමාගේ අතින්ම සන්තර්පණය කොට, පිරිවරමින් වළඳවීය.",
      "paliTitle": ""
    },
    {
      "number": 321,
      "pali": "Atha kho soṇadaṇḍo brāhmaṇo bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho soṇadaṇḍo brāhmaṇo bhagavantaṃ etadavoca – ‘‘ahañceva kho pana, bho gotama, parisagato samāno āsanā vuṭṭhahitvā bhavantaṃ gotamaṃ abhivādeyyaṃ, tena maṃ sā parisā paribhaveyya. Yaṃ kho pana sā parisā paribhaveyya, yasopi tassa hāyetha. Yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana, bho gotama, parisagato samāno añjaliṃ paggaṇheyyaṃ, āsanā me taṃ bhavaṃ gotamo paccuṭṭhānaṃ dhāretu. Ahañceva kho pana, bho gotama, parisagato samāno veṭhanaṃ omuñceyyaṃ, sirasā me taṃ bhavaṃ gotamo abhivādanaṃ dhāretu. Ahañceva kho pana, bho gotama, yānagato samāno yānā paccorohitvā bhavantaṃ gotamaṃ abhivādeyyaṃ, tena maṃ sā parisā paribhaveyya. Yaṃ kho pana sā parisā paribhaveyya, yasopi tassa hāyetha, yassa kho pana yaso hāyetha, bhogāpi tassa hāyeyyuṃ. Yasoladdhā kho panamhākaṃ bhogā. Ahañceva kho pana, bho gotama, yānagato samāno patodalaṭṭhiṃ abbhunnāmeyyaṃ, yānā me taṃ bhavaṃ gotamo paccorohanaṃ dhāretu. Ahañceva kho pana, bho gotama, yānagato samāno chattaṃ apanāmeyyaṃ, sirasā me taṃ bhavaṃ gotamo abhivādanaṃ dhāretū’’ti.",
      "english": "Then, indeed, the brahmin Sonadanda, after the Blessed One had finished eating and put away his bowl and hands, took a low seat and sat down to one side. Sitting to one side, the brahmin Sonadanda said this to the Blessed One:\n\n“Venerable Gotama, if I, while in a gathering, were to rise from my seat and pay homage to the venerable Gotama, then that assembly would look down upon me. And if that assembly were to look down upon me, my reputation too would decline. And if one's reputation were to decline, one's wealth too would decline. Indeed, for us, wealth is gained through reputation. Venerable Gotama, if I, while in a gathering, were to raise my joined hands in reverence, may the venerable Gotama take that as my rising from the seat. Venerable Gotama, if I, while in a gathering, were to remove my turban, may the venerable Gotama take that as my paying homage with my head. Venerable Gotama, if I, while in a vehicle, were to dismount from the vehicle and pay homage to the venerable Gotama, then that assembly would look down upon me. And if that assembly were to look down upon me, my reputation too would decline; and if one's reputation were to decline, one's wealth too would decline. Indeed, for us, wealth is gained through reputation. Venerable Gotama, if I, while in a vehicle, were to raise my goad-stick, may the venerable Gotama take that as my dismounting from the vehicle. Venerable Gotama, if I, while in a vehicle, were to lower my parasol, may the venerable Gotama take that as my paying homage with my head.”",
      "sinhala": "ඉන්පසු සෝණදණ්ඩ බ්‍රාහ්මණයා, භාග්‍යවතුන් වහන්සේ ආහාරය වළඳා අවසන් වූ, පාත්‍රය අතින් ඉවත් කළ පසු, එක් පහත් අසුනක් ගෙන එකත්පස්ව වාඩි විය. එකත්පස්ව වාඩි වී සිටි සෝණදණ්ඩ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: “භවත් ගෞතමයන් වහන්ස, මා පිරිසක් මැද සිටින විට අසුනෙන් නැගිට භවත් ගෞතමයන් වහන්සේට ආචාර කළහොත්, ඒ පිරිස මා හෙළා දකිනු ඇත. යම් හෙයකින් ඒ පිරිස මා හෙළා දකීද, එවිට මගේ යසසද පිරිහී යනු ඇත. යමෙකුගේ යසස පිරිහේ නම්, ඔහුගේ භෝගයන්ද පිරිහී යනු ඇත. අපගේ භෝග සම්පත් යසස නිසා ලැබෙන්නකි. භවත් ගෞතමයන් වහන්ස, මා පිරිසක් මැද සිටින විට ඇඳිලි බැඳ වැන්දහොත්, මා අසුනෙන් නැගිට ආචාර කළා සේ භවත් ගෞතමයන් වහන්සේ එය පිළිගන්නා සේක්වා. භවත් ගෞතමයන් වහන්ස, මා පිරිසක් මැද සිටින විට හිස් වැස්ම ගැලවූවහොත්, මා හිස නමා ආචාර කළා සේ භවත් ගෞතමයන් වහන්සේ එය පිළිගන්නා සේක්වා. භවත් ගෞතමයන් වහන්ස, මා වාහනයක ගමන් කරන විට වාහනයෙන් බැස භවත් ගෞතමයන් වහන්සේට ආචාර කළහොත්, ඒ පිරිස මා හෙළා දකිනු ඇත. යම් හෙයකින් ඒ පිරිස මා හෙළා දකීද, එවිට මගේ යසසද පිරිහී යනු ඇත. යමෙකුගේ යසස පිරිහේ නම්, ඔහුගේ භෝගයන්ද පිරිහී යනු ඇත. අපගේ භෝග සම්පත් යසස නිසා ලැබෙන්නකි. භවත් ගෞතමයන් වහන්ස, මා වාහනයක ගමන් කරන විට තියුණු යෂ්ටිය ඉහළට එසවූවහොත්, මා වාහනයෙන් බැස ආචාර කළා සේ භවත් ගෞතමයන් වහන්සේ එය පිළිගන්නා සේක්වා. භවත් ගෞතමයන් වහන්ස, මා වාහනයක ගමන් කරන විට කුඩය පහත් කළහොත්, මා හිස නමා ආචාර කළා සේ භවත් ගෞතමයන් වහන්සේ එය පිළිගන්නා සේක්වා.”",
      "paliTitle": ""
    },
    {
      "number": 322,
      "pali": "Atha kho bhagavā soṇadaṇḍaṃ brāhmaṇaṃ dhammiyā kathāya sandassetvā samādapetvā samuttejetvā sampahaṃsetvā uṭṭhāyāsanā pakkāmīti. ",
      "english": "Then the Blessed One, having exhorted, encouraged, uplifted, and gladdened the brahmin Sonadaṇḍa with a talk on the Dhamma, rose from his seat and departed.",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ සෝණදණ්ඩ බ්‍රාහ්මණයාට ධර්ම කථාවකින් හොඳින් පහදා දී, සමාදන් කරවා, උද්‍යෝගිමත් කරවා, සතුටු කරවා, ආසනයෙන් නැගිට පිටත්ව ගියසේක.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Soṇadaṇḍasuttaṃ niṭṭhitaṃ catutthaṃ.",
    "english": "Fourth Soṇadaṇḍa Sutta Concluded",
    "sinhala": "සිව්වන සෝණදණ්‍U+200Dඩ සූත්‍U+200Dරය නිමයි."
  }
}