{
  "id": "dn.1.3",
  "title": {
    "pali": "Ambaṭṭhasuttaṃ",
    "english": "The Ambaṭṭha Sutta",
    "sinhala": "අම්බට්ඨ සූත්‍රය"
  },
  "sections": [
    {
      "number": 254,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi yena icchānaṅgalaṃ nāma kosalānaṃ brāhmaṇagāmo tadavasari. Tatra sudaṃ bhagavā icchānaṅgale viharati icchānaṅgalavanasaṇḍe.",
      "english": "Thus have I heard. On one occasion, the Blessed One, while wandering in the Kosala country with a great community of about five hundred bhikkhus, arrived at a brahmin village of the Kosalans named Icchānaṅgala. There, the Blessed One resided in the Icchānaṅgala forest grove.",
      "sinhala": "ම විසින් මෙසේ අසන ලදී. එක් කලෙක්හි භාග්‍ය​වතුන් වහන්සේ පන්සියයක් පමණ භික්ෂූන් වහන්සේලාගෙන් යුත් මහත් භික්ෂුසංඝයාවක් සමඟ කෝසල ජනපදයෙහි චාරිකාවේ වඩමින්, කෝසලවරුන්ගේ ඉච්ඡානංගල නම් බ්‍රාහ්මණ ගම කරා වැඩම කළ සේක. එකල්හි භාග්‍ය​වතුන් වහන්සේ ඉච්ඡානංගල නම් ගමෙහි, ඉච්ඡානංගල වනයෙහි වාසය කළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 255,
      "pali": "Tena kho pana samayena brāhmaṇo pokkharasāti ukkaṭṭhaṃ [pokkharasātī (sī.), pokkharasādi (pī.)] ajjhāvasati sattussadaṃ satiṇakaṭṭhodakaṃ sadhaññaṃ rājabhoggaṃ raññā pasenadinā kosalena dinnaṃ rājadāyaṃ brahmadeyyaṃ. Assosi kho brāhmaṇo pokkharasāti – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi icchānaṅgalaṃ anuppatto icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ [bhagavāti (syā. kaṃ.), uparisoṇadaṇḍasuttādīsupi buddhaguṇakathāyaṃ evameva dissati]. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ, sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti. ",
      "english": "At that time, the brahmin Pokkharasāti was dwelling in Ukkaṭṭhā, a place that was populous, abundant with grass, wood, and water, and rich in grain; it was a royal endowment, a royal gift, a brahmin endowment, bestowed by King Pasenadi of Kosala.\n\nThe brahmin Pokkharasāti heard: \"Indeed, good sirs, the ascetic Gotama, a son of the Sakyans, who went forth from the Sakya clan, is wandering on tour through the Kosala country with a great monastic community of about five hundred monks. He has arrived at Icchānaṅgala and is staying there in the Icchānaṅgala forest grove. Regarding that venerable Gotama, this excellent reputation has spread: 'Indeed, that Blessed One is an Arahant, a Fully Self-Enlightened One, perfected in wisdom and conduct, a Fortunate One, knower of the worlds, an unsurpassed trainer of persons to be tamed, teacher of gods and humans, the Awakened One, the Blessed One.' He, having realized this world—with its devas, Māras, Brahmās, its ascetics and brahmins, its population of devas and humans—directly by his own higher knowledge, proclaims it. He teaches the Dhamma that is beautiful in the beginning, beautiful in the middle, beautiful in the end, with its meaning and its phrasing. He proclaims the completely perfect and purified spiritual life. It is good, indeed, to see such Arahants.\"",
      "sinhala": "ඒ කාලයේදී පොක්ඛරසාති නම් බ්‍රාහ්මණයා සශ්‍රීක වූ, තණකොළ, දර, ජලය බහුල වූ, ධාන්‍ය සම්පතින් යුක්ත වූ, රජුට අයත් වූ, කොසොල් රජු වූ පසේනදී විසින් දෙන ලද රාජ දායාදයක් සහ බ්‍රහ්මදෙයියමක් වූ උක්කට්ඨා නම් නගරයේ වාසය කරයි. පොක්ඛරසාති බ්‍රාහ්මණයාට මේ ආරංචිය අසන්නට ලැබුණි – “භවත් ශ්‍රමණ ගෞතමයන් වහන්සේ ශාක්‍ය පුත්‍ර වූ, ශාක්‍ය කුලයෙන් පැවිදි වූ, කෝසල ජනපදයෙහි චාරිකාවේ වඩමින්, මහත් වූ භික්ෂු සංඝයා සමග, පන්සීයක් පමණ භික්ෂූන් වහන්සේලා ද සමග ඉච්ඡානංගලයට පැමිණ, ඉච්ඡානංගල ගමෙහි ඉච්ඡානංගල වනසණ්ඩයෙහි වාසය කරන සේක.” ඒ භවත් ගෞතමයන් වහන්සේ පිළිබඳව මෙබඳු වූ මනහර කීර්ති ඝෝෂාවක් පැතිර ගොස් ඇත – “ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විජ්ජාචරණසම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භගවා යන ගුණාංගයන්ගෙන් යුක්ත සේක.” උන්වහන්සේ දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත වූ මේ ලෝකය ද, ශ්‍රමණයන්, බ්‍රාහ්මණයන් සහිත වූ ප්‍රජාව ද, දෙවි මිනිසුන් සහිත වූ ද මේ සියල්ල තමන් විසින්ම විශේෂ ඥානයෙන් අවබෝධ කොට සාක්ෂාත් කොට ප්‍රකාශ කරන සේක. උන්වහන්සේ මුල යහපත් වූ, මැද යහපත් වූ, අග යහපත් වූ ධර්මය අර්ථ සහිත ව, ව්‍යංජන සහිත ව දේශනා කරන සේක. උන්වහන්සේ කේවල වශයෙන් පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරන සේක. “එබඳු අරහතුන් වහන්සේලා දැකීම භාග්‍යයකි.”",
      "paliTitle": "Pokkharasātivatthu",
      "englishTitle": "Story of Pokkharasāti",
      "sinhalaTitle": "පොක‍්ඛරසාති වස‍්තුව"
    },
    {
      "number": 256,
      "pali": "Tena kho pana samayena brāhmaṇassa pokkharasātissa ambaṭṭho nāma māṇavo antevāsī hoti ajjhāyako mantadharo tiṇṇaṃ vedānaṃ [bedānaṃ (ka.)] pāragū sanighaṇḍukeṭubhānaṃ sākkharappabhedānaṃ itihāsapañcamānaṃ padako veyyākaraṇo lokāyatamahāpurisalakkhaṇesu anavayo anuññātapaṭiññāto sake ācariyake tevijjake pāvacane – ‘‘yamahaṃ jānāmi, taṃ tvaṃ jānāsi; yaṃ tvaṃ jānāsi tamahaṃ jānāmī’’ti.",
      "english": "At that time, the brahmin Pokkharasāti had a pupil named Ambaṭṭha, a young man who was a reciter and master of the sacred texts. He was accomplished in the three Vedas, together with the lexicons and ritual sciences, along with their phonetics and etymology, and the Itihāsas as the fifth. He was skilled in word analysis and grammar, and proficient in Lokāyata and the marks of a Great Man. He was acknowledged and acclaimed within his own teacher's threefold Vedic tradition, with the understanding: 'What I know, you know; what you know, I know.'",
      "sinhala": "එකල්හි පොක්ඛරසාති නම් බමුණාගේ අම්බට්ඨ නම් මානවක තෙමේ අතවැසි වූයේය. හෙතෙම මන්ත්‍රධාරී වූ, ත‍්‍රිවේදයන්හි පරතෙරට පත් වූ, නිඝණ්ඩු, කේටුභ, අක්ඛරප්පභේද හා ඉතිහාසය යන පස්වැනි ශාස‍්ත‍්‍රයද ඇතුළුව, පදවිභාගයෙහි ද ව්‍යාකරණ ශාස‍්ත‍්‍රයෙහි ද දක්ෂ වූ, ලෝකායතයෙහි ද මහාපුරිසලකුණුවල ද කිසිදු අඩුපාඩුවක් නැති වූ, තමාගේ ආචාර්යවරයාගේ ත‍්‍රිවේද ශාස‍්ත‍්‍රය පිළිබඳව \"මා යමක් දනිම් ද, එය ඔබ දන්නෙහි ය; ඔබ යමක් දන්නෙහි ද, එය මම දනිමි\" යනුවෙන් අන්‍යයන් විසින් අනුදන්නා ලද, පිළිගත් අයෙක් විය.",
      "paliTitle": "Ambaṭṭhamāṇavo",
      "englishTitle": "Ambaṭṭha the Youth",
      "sinhalaTitle": "අම්බට්ඨ මානවකයා"
    },
    {
      "number": 257,
      "pali": "Atha kho brāhmaṇo pokkharasāti ambaṭṭhaṃ māṇavaṃ āmantesi – ‘‘ayaṃ, tāta ambaṭṭha, samaṇo gotamo sakyaputto sakyakulā pabbajito kosalesu cārikaṃ caramāno mahatā bhikkhusaṅghena saddhiṃ pañcamattehi bhikkhusatehi icchānaṅgalaṃ anuppatto icchānaṅgale viharati icchānaṅgalavanasaṇḍe. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā, arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ, sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotīti. Ehi tvaṃ tāta ambaṭṭha, yena samaṇo gotamo tenupasaṅkama; upasaṅkamitvā samaṇaṃ gotamaṃ jānāhi, yadi vā taṃ bhavantaṃ gotamaṃ tathāsantaṃyeva saddo abbhuggato, yadi vā no tathā. Yadi vā so bhavaṃ gotamo tādiso, yadi vā na tādiso, tathā mayaṃ taṃ bhavantaṃ gotamaṃ vedissāmā’’ti.",
      "english": "Then the brahmin Pokkharasāti addressed the young man Ambaṭṭha: \"My dear Ambaṭṭha, this recluse Gotama, a son of the Sakyans, gone forth from the Sakya clan, is wandering in the Kosala country and has arrived at Icchānaṅgala with a great Sangha of bhikkhus, about five hundred bhikkhus, and is staying in the Icchānaṅgala forest grove. Concerning that Venerable Gotama, such an excellent reputation has arisen: 'Indeed, that Blessed One is Arahant, Perfectly Self-Enlightened, Accomplished in knowledge and conduct, Fortunate, Knower of the world, Unsurpassed Trainer of persons to be tamed, Teacher of gods and humans, the Buddha, the Blessed One.' He, having personally realised with direct knowledge this world with its gods, Māras, and Brahmās, with its recluses and brahmins, its populace with gods and humans, declares it. He teaches the Dhamma that is beautiful in the beginning, beautiful in the middle, beautiful in the end, with both meaning and phrasing; he proclaims the entirely complete and utterly pure holy life. It is indeed good to see such Arahants.\"\n\n\"Come, my dear Ambaṭṭha, go to where the recluse Gotama is. Having gone there, come to know the recluse Gotama, whether that reputation has truly arisen concerning the Venerable Gotama, or not so; whether that Venerable Gotama is such or not such, then we shall know that Venerable Gotama.\"",
      "sinhala": "ඉන්පසු පොක්ඛරසාති බ්‍රාහ්මණයා අම්බට්ඨ මානවකයාට මෙසේ ඇමතුවේය – \"පුත අම්බට්ඨ, ශාක්‍ය කුලයෙන් පැවිදි වූ, ශාක්‍ය​ පුත්‍රවූ මේ ශ්‍ර​මණ ගෞතමයන් වහන්සේ කෝසල ජනපදයේ චාරිකාවේ හැසිරෙමින්, පන්සියයක් පමණ මහත් භික්ෂු සංඝයා සමඟ ඉච්ඡානංගල නම් ගමට පැමිණ ඉච්ඡානංගල ගම්මානයේ ඉච්ඡානංගල වනාන්තරයෙහි වාසය කරයි. ඒ භාග්‍ය​වතුන් වහන්සේ පිළිබඳව මෙසේ මනරම් කීර්ති ඝෝෂාවක් පැතිරී ඇත – 'ඒ භාග්‍ය​වතුන් වහන්සේ අරහං, සම්මා සම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තර පුරිසදම්මසාරථී, දෙවි මිනිසුන්ට ශාස්තෘ, බුදු, භාග්‍ය​වතුන් වහන්සේ' යනුවෙනි. උන්වහන්සේ දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත, ශ්‍ර​මණ බ්‍රාහ්මණ සහිත වූ ප්‍ර​ජාව ද, දෙවි මිනිසුන් ද සහිත මේ ලෝකය තමන් විසින්ම අභිඥාවෙන් අවබෝධ කරගෙන ප්‍රත්‍යක්ෂ කොට ප්‍ර​කාශ කරති. උන්වහන්සේ මුල යහපත්, මැද යහපත්, කෙළවර යහපත් වූ, අර්ථ සහිත, ව්‍යංජන සහිත, සර්වාකාරයෙන් පරිපූර්ණ, පිරිසිදු බ්‍රහ්මචර්යාවක් ප්‍ර​කාශ කරන ධර්මය දේශනා කරති. ඒකාන්තයෙන්ම එබඳු අරහතුන් වහන්සේලා දැකීම යහපත්ය. පුත අම්බට්ඨ, එනු මැනවි. ශ්‍ර​මණ ගෞතමයන් වහන්සේ වැඩ සිටින තැනට යනු මැනවි; එසේ ගොස් ශ්‍ර​මණ ගෞතමයන් වහන්සේ දැනගන්න. ඒ ගෞතමයන් වහන්සේ පිළිබඳව ඇත්තෙන්ම ඒ කීර්ති ඝෝෂාව පැතිරී ඇත්තේද, නැතහොත් එය එසේ නොවේදැයි දැනගන්න. ඒ ගෞතමයන් වහන්සේ එබඳු කෙනෙක්ද, නැතහොත් එබඳු කෙනෙක් නොවේදැයි, ඒ ආකාරයෙන් අපට ඒ ගෞතමයන් වහන්සේව දැනගන්නට ලැබේවි.\"",
      "paliTitle": ""
    },
    {
      "number": 258,
      "pali": "‘‘Yathā kathaṃ panāhaṃ, bho, taṃ bhavantaṃ gotamaṃ jānissāmi – ‘yadi vā taṃ bhavantaṃ gotamaṃ tathāsantaṃyeva saddo abbhuggato, yadi vā no tathā. Yadi vā so bhavaṃ gotamo tādiso, yadi vā na tādiso’’’ti? ‘‘Āgatāni kho, tāta ambaṭṭha, amhākaṃ mantesu dvattiṃsa mahāpurisalakkhaṇāni, yehi samannāgatassa mahāpurisassa dveyeva gatiyo bhavanti anaññā. Sace agāraṃ ajjhāvasati, rājā hoti cakkavattī dhammiko dhammarājā cāturanto vijitāvī janapadatthāvariyappatto sattaratanasamannāgato. Tassimāni satta ratanāni bhavanti. Seyyathidaṃ – cakkaratanaṃ, hatthiratanaṃ, assaratanaṃ, maṇiratanaṃ, itthiratanaṃ, gahapatiratanaṃ, pariṇāyakaratanameva sattamaṃ. Parosahassaṃ kho panassa puttā bhavanti sūrā vīraṅgarūpā parasenappamaddanā. So imaṃ pathaviṃ sāgarapariyantaṃ adaṇḍena asatthena dhammena abhivijiya ajjhāvasati. Sace kho pana agārasmā anagāriyaṃ pabbajati, arahaṃ hoti sammāsambuddho loke vivaṭṭacchado. Ahaṃ kho pana, tāta ambaṭṭha, mantānaṃ dātā; tvaṃ mantānaṃ paṭiggahetā’’ti.",
      "english": "“How, sir, shall I know that venerable Gotama—whether the report about that venerable Gotama is truly as it is, or not so? Or whether that venerable Gotama is such a one, or not such a one?”\n\n“Indeed, my dear Ambaṭṭha, there have come down in our sacred texts the thirty-two marks of a Great Man. A Great Man endowed with these has only two destinies, no other. If he lives in a house, he becomes a Wheel-turning Monarch, a righteous king of righteousness, conqueror of the four quarters, who has achieved stability in his country, endowed with the seven jewels. These seven jewels are his: namely, the wheel-jewel, the elephant-jewel, the horse-jewel, the gem-jewel, the woman-jewel, the householder-jewel, and the advisor-jewel as the seventh. Moreover, he has more than a thousand sons, who are brave, heroic in form, and subduers of enemy armies. He lives having conquered this earth, bounded by the ocean, without rod or sword, but by righteousness. But if he goes forth from the home life into homelessness, he becomes an Arahant, a Fully Self-Awakened One, a remover of the veil in the world. Indeed, my dear Ambaṭṭha, I am the giver of the sacred texts; you are the receiver of the sacred texts.”",
      "sinhala": "“භවත්නි, ඒ භාග්‍යවත් ගෞතමයන්වහන්සේ පිළිබඳව පැනනැඟී ඇති කීර්තිය සැබෑවක්ද, නැතහොත් එසේ නොවේද? ඒ භාග්‍යවත් ගෞතමයන්වහන්සේ සැබවින්ම එබඳු කෙනෙක්ද, නැතහොත් එබඳු කෙනෙක් නොවේදැයි මා දැනගන්නේ කෙසේද?” “ආදරණීය අම්බට්ඨයෙනි, අපගේ මන්ත්‍රයන්හි තිස්දෙකක් වූ මහා පුරුෂ ලක්ෂණ සඳහන්ව ඇත. ඒ ලක්ෂණයන්ගෙන් යුක්ත වූ මහා පුරුෂයෙකුට ඇත්තේ අන් කිසිවක් නොවන ගති දෙකක් පමණි. යම් හෙයකින් ඔහු ගිහි ගෙයක වාසය කරන්නේ නම්, ඔහු ධාර්මික වූ, ධර්මරාජ වූ, සිව් දෙස ජයගත්, ජනපදයන් ස්ථාවර භාවයට පත්කළ, සත් රුවනින් යුක්ත වූ සක්විති රජෙක් වන්නේය. ඔහුට මේ සත් රුවන ඇත්තේය. එනම්, චක්‍ර රත්නය, හස්ති රත්නය, අශ්ව රත්නය, මාණික්‍ය රත්නය, ස්ත්‍රී රත්නය, ගෘහපති රත්නය සහ සත්වන වූ පරිනායක රත්නයයි. තවද ඔහුට දහසකට අධික පුත්‍රයෝ වෙති. ඔවුහු ශූරයෝ, වීර රූ ඇත්තෝ, සතුරු සේනා මර්දනය කරන්නෝ වෙති. ඔහු මේ සාගරය කෙළවර කොට ඇති පෘථිවිය, දඬු මුගුරු හෝ ආයුධ නොමැතිව, ධර්මයෙන්ම ජයගෙන පාලනය කරමින් වාසය කරයි. එහෙත් යම් හෙයකින් ඔහු ගිහි ගෙයින් නික්ම අනගාරික බවට පැවිදි වන්නේ නම්, ඔහු ලොවෙහි කෙලෙස් වැස්ම දුරු කළ අරහත් සම්මා සම්බුද්ධයෙක් වන්නේය. තවද, ආදරණීය අම්බට්ඨයෙනි, මම මන්ත්‍රයන් දන් දෙන්නා වෙමි; ඔබ මන්ත්‍රයන් පිළිගන්නා වෙහි.”",
      "paliTitle": ""
    },
    {
      "number": 259,
      "pali": "‘‘Evaṃ, bho’’ti kho ambaṭṭho māṇavo brāhmaṇassa pokkharasātissa paṭissutvā uṭṭhāyāsanā brāhmaṇaṃ pokkharasātiṃ abhivādetvā padakkhiṇaṃ katvā vaḷavārathamāruyha sambahulehi māṇavakehi saddhiṃ yena icchānaṅgalavanasaṇḍo tena pāyāsi. Yāvatikā yānassa bhūmi yānena gantvā yānā paccorohitvā pattikova ārāmaṃ pāvisi. Tena kho pana samayena sambahulā bhikkhū abbhokāse caṅkamanti. Atha kho ambaṭṭho māṇavo yena te bhikkhū tenupasaṅkami; upasaṅkamitvā te bhikkhū etadavoca – ‘‘kahaṃ nu kho, bho, etarahi so bhavaṃ gotamo viharati? Tañhi mayaṃ bhavantaṃ gotamaṃ dassanāya idhūpasaṅkantā’’ti.",
      "english": "\"Yes, sir,\" so the young brahman Ambaṭṭha, having assented to the brahman Pokkharasāti, rose from his seat, saluted Pokkharasāti, and circumambulated him clockwise. He then mounted a chariot drawn by mares and, together with many young brahmans, set off towards the Icchānaṅgala forest grove. He travelled by chariot as far as the ground was suitable for a vehicle, then dismounted and entered the park on foot. At that time, many monks were walking back and forth in the open air. The young brahman Ambaṭṭha then approached those monks and asked, \"Where, sirs, is the esteemed Gotama dwelling now? We have come here to see the esteemed Gotama.\"",
      "sinhala": "\"එසේය, ස්වාමීනි\" යැයි අම්බට්ඨ මානවකයා පොක්ඛරසාති බ්‍රාහ්මණයාට පිළිවදන් දී, ආසනයෙන් නැඟිට, පොක්ඛරසාති බ්‍රාහ්මණයාට වැඳ, ප්200Dරදක්ෂිණා කර, අශ්ව රථයට නැඟී, බොහෝ මානවකයන් සමඟ ඉච්ඡානංගල වනසණ්ඩය වෙත පිටත් විය.\n\nරථයෙන් යා හැකි දුරක් රථයෙන් ගොස්, රථයෙන් බැස, පා ගමනින්ම ආරාමයට පිවිසියේය.\n\nඑකල්හි බොහෝ භික්ෂූහු එළිමහනේ සක්මන් කරමින් සිටියහ.\n\nඑවිට අම්බට්ඨ මානවකයා ඒ භික්ෂූන් වහන්සේලා වෙතට ගියේය; එළඹ, ඒ භික්ෂූන් වහන්සේලාට මෙය කීවේය – \"පින්වතුනි, දැන් ඒ භවත් ගෝතමයෝ කොහි වැඩවසත්ද? අපි භවත් ගෝතමයන් වහන්සේ දැකීම පිණිස මෙහි පැමිණියෙමු.\"",
      "paliTitle": ""
    },
    {
      "number": 260,
      "pali": "Atha kho tesaṃ bhikkhūnaṃ etadahosi – ‘‘ayaṃ kho ambaṭṭho māṇavo abhiññātakolañño ceva abhiññātassa ca brāhmaṇassa pokkharasātissa antevāsī. Agaru kho pana bhagavato evarūpehi kulaputtehi saddhiṃ kathāsallāpo hotī’’ti. Te ambaṭṭhaṃ māṇavaṃ etadavocuṃ – ‘‘eso ambaṭṭha vihāro saṃvutadvāro, tena appasaddo upasaṅkamitvā ataramāno āḷindaṃ pavisitvā ukkāsitvā aggaḷaṃ ākoṭehi, vivarissati te bhagavā dvāra’’nti.",
      "english": "Then it occurred to those bhikkhus: \"Indeed, this young brahmin Ambaṭṭha is from a well-known family and is a disciple of the well-known brahmin Pokkharasāti. The Blessed One does not deem it a trifle to converse with such noble youths.\" They said to the young brahmin Ambaṭṭha: \"Ambaṭṭha, this monastery has its door closed. Therefore, approach quietly, without hurrying, enter the porch, cough, and knock on the bolt. The Blessed One will open the door for you.\"",
      "sinhala": "එවිට ඒ භික්ෂූන්ට මෙසේ සිතුණි – 'මෙම අම්බට්ඨ මාණවකයා නම් ප්‍රකට පවුලක කෙනෙකි. ප්‍රකට බ්‍රාහ්මණ පොක්ඛරසාතිගේ ශිෂ්‍යයෙකි. භාග්‍යවතුන් වහන්සේට මෙවැනි කුලපුත්‍රයන් සමඟ කථාබස් කිරීම අපහසු නොවේ.'\n\nඔවුහු අම්බට්ඨ මාණවකයාට මෙසේ කීහ – 'අම්බට්ඨය, මෙම විහාරයෙහි දොර වැසී ඇත. එබැවින් නිහඬව එහි ගොස්, කලබල නොවී ආලින්දයට පිවිස, කැස්සක් අරගෙන අගුලට තට්ටු කරන්න. භාග්‍යවතුන් වහන්සේ ඔබට දොර විවෘත කර දෙනු ඇත.'",
      "paliTitle": ""
    },
    {
      "number": 261,
      "pali": "Atha kho ambaṭṭho māṇavo yena so vihāro saṃvutadvāro, tena appasaddo upasaṅkamitvā ataramāno āḷindaṃ pavisitvā ukkāsitvā aggaḷaṃ ākoṭesi. Vivari bhagavā dvāraṃ. Pāvisi ambaṭṭho māṇavo. Māṇavakāpi pavisitvā bhagavatā saddhiṃ sammodiṃsu, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Ambaṭṭho pana māṇavo caṅkamantopi nisinnena bhagavatā kañci kañci [kiñci kiñci (ka.)] kathaṃ sāraṇīyaṃ vītisāreti, ṭhitopi nisinnena bhagavatā kiñci kiñci kathaṃ sāraṇīyaṃ vītisāreti.",
      "english": "Then Ambaṭṭha the young brahmin, approaching silently and without hurrying to where that dwelling had its door closed, entered the porch, coughed, and knocked on the door. The Blessed One opened the door. Ambaṭṭha the young brahmin entered. And the young brahmins, having entered, exchanged greetings with the Blessed One, and after concluding a polite and cordial conversation, they sat down to one side. But Ambaṭṭha the young brahmin, even while walking, exchanged various polite remarks with the Blessed One, who was seated; and even while standing, he exchanged various polite remarks with the Blessed One, who was seated.",
      "sinhala": "ඉන්පසු අම්බට්ඨ මානවකයා වසා දැමූ දොරටු සහිත විහාරය වෙත නිශ්ශබ්දව එළඹ, නොඉක්මන් කරමින් ආලින්දයට පිවිස, කැස්සක් නගා දොර අගුලට තට්ටු කළේය. භාග්‍ය‌වතුන් වහන්සේ දොරටුව විවෘත කළ සේක. අම්බට්ඨ මානවකයා ඇතුළු විය. අනෙකුත් මානවකයෝ ද ඇතුළු වී, භාග්‍ය‌වතුන් වහන්සේ සමඟ සාමෝද්‍ය වූ, සිහිපත් කළ යුතු වූ කථා බස් පවත්වා, එක් පසෙකින් වාඩි වූහ. එහෙත් අම්බට්ඨ මානවකයා සක්මන් කරමින් සිටියදී ද, සිටගෙන සිටියදී ද, වැඩ සිටින භාග්‍ය‌වතුන් වහන්සේ සමඟ යම් යම් සිහිපත් කළ යුතු කථා බස් පැවැත්වීය.",
      "paliTitle": ""
    },
    {
      "number": 262,
      "pali": "Atha kho bhagavā ambaṭṭhaṃ māṇavaṃ etadavoca – ‘‘evaṃ nu te, ambaṭṭha, brāhmaṇehi vuddhehi mahallakehi ācariyapācariyehi saddhiṃ kathāsallāpo hoti, yathayidaṃ caraṃ tiṭṭhaṃ nisinnena mayā kiñci kiñci kathaṃ sāraṇīyaṃ vītisāretī’’ti? ",
      "english": "Then the Blessed One said this to the young brahmin Ambaṭṭha: \"Ambaṭṭha, is it truly the case that your conversations with venerable and elder brahmins, with your teachers and their teachers, are like this, just as you are now exchanging some familiar talk with me, whether I am walking, standing, or sitting?\"",
      "sinhala": "ඉක්බිති භාග්‍යවතුන් වහන්සේ අම්බට්ඨ මානවකයාට මෙය වදාළ සේක: \"අම්බට්ඨය, යම් සේ මේ ඔබ ගමන් කරමින්, සිටගෙන, හිඳගෙන සිටින මා සමඟ යම් යම් සිහි කළ යුතු කතා හුවමාරු කරන්නෙහි ද, එලෙසම ඔබ වෘද්ධ වූ, මහලු වූ, ආචාර්ය, ප්‍රාචාර්ය බ්‍රාහ්මණයන් සමඟ ද කතා සල්ලාප සිදු කරන්නෙහි ද?\"",
      "paliTitle": ""
    },
    {
      "number": 263,
      "pali": "‘‘No hidaṃ, bho gotama. Gacchanto vā hi, bho gotama, gacchantena brāhmaṇo brāhmaṇena saddhiṃ sallapitumarahati, ṭhito vā hi, bho gotama, ṭhitena brāhmaṇo brāhmaṇena saddhiṃ sallapitumarahati, nisinno vā hi, bho gotama, nisinnena brāhmaṇo brāhmaṇena saddhiṃ sallapitumarahati, sayāno vā hi, bho gotama, sayānena brāhmaṇo brāhmaṇena saddhiṃ sallapitumarahati. Ye ca kho te, bho gotama, muṇḍakā samaṇakā ibbhā kaṇhā [kiṇhā (ka. sī. pī.)] bandhupādāpaccā, tehipi me saddhiṃ evaṃ kathāsallāpo hoti, yathariva bhotā gotamenā’’ti. ‘‘Atthikavato kho pana te, ambaṭṭha, idhāgamanaṃ ahosi, yāyeva kho panatthāya āgaccheyyātha [āgaccheyyātho (sī. pī.)], tameva atthaṃ sādhukaṃ manasi kareyyātha [manasikareyyātho (sī. pī.)]. Avusitavāyeva kho pana bho ayaṃ ambaṭṭho māṇavo vusitamānī kimaññatra avusitattā’’ti.",
      "english": "Not so, indeed, Venerable Gotama. For indeed, Venerable Gotama, a brahmin walking is able to converse with a brahmin walking; or a brahmin standing is able to converse with a brahmin standing; or a brahmin seated is able to converse with a brahmin seated; or a brahmin lying down is able to converse with a brahmin lying down. And as for those shaven-headed ascetics, those common, dark ones, offspring of slave women – even with them I have such conversation, just as with Venerable Gotama.\n\nHowever, Ambaṭṭha, your coming here was for a purpose. Whatever purpose you came for, that very purpose you should properly bear in mind. Indeed, this young brahmin Ambaṭṭha, though not having completed his training, regards himself as having completed it. What else is there but his incompleteness?",
      "sinhala": "නැත, භවත් ගෞතමයෙනි. භවත් ගෞතමයෙනි, ගමන් කරන බ්‍රා​හ්මණයා ගමන් කරන බ්‍රා​හ්මණයා සමඟ කතා බස් කළ යුතු ය. භවත් ගෞතමයෙනි, සිටගෙන සිටින බ්‍රා​හ්මණයා සිටගෙන සිටින බ්‍රා​හ්මණයා සමඟ කතා බස් කළ යුතු ය. භවත් ගෞතමයෙනි, හිඳගෙන සිටින බ්‍රා​හ්මණයා හිඳගෙන සිටින බ්‍රා​හ්මණයා සමඟ කතා බස් කළ යුතු ය. භවත් ගෞතමයෙනි, සයනය කර සිටින බ්‍රා​හ්මණයා සයනය කර සිටින බ්‍රා​හ්මණයා සමඟ කතා බස් කළ යුතු ය. භවත් ගෞතමයෙනි, යම් ඒ මුඩු ශ්‍ර​මණයෝ ද, නීචයෝ ද, කළු පැහැති, බ්‍ර​හ්මයාගේ පතුලෙන් උපන් අය ද වෙත් ද, භවත් ගෞතමයන් සමඟ මෙන් ඔවුන් සමඟ ද මා හට කතා බස් ඇත.\n\nඅම්බට්ඨ, ඔබගේ මෙහි පැමිණීම යම් අවශ්‍යතාවක් නිසා සිදු විය. යම් ප්‍ර​යෝජනයක් සඳහා පැමිණියා නම්, ඒ කාරණය ම මනාව සිහිපත් කර ගනු මැනවි. භවත්නි, මේ අම්බට්ඨ මාණවකයා බ්‍ර​හ්මචරියාව නොවැසූවකු වුවත්, වැසූවකු ලෙස සලකයි. බ්‍ර​හ්මචරියාව නොවැසීම හැර අන් කුමක් ද?",
      "paliTitle": "Paṭhamaibbhavādo",
      "englishTitle": "First Doctrine of Existence",
      "sinhalaTitle": "පළමු ඉබ්භ වාදය"
    },
    {
      "number": 264,
      "pali": "Atha kho ambaṭṭho māṇavo bhagavatā avusitavādena vuccamāno kupito anattamano bhagavantaṃyeva khuṃsento bhagavantaṃyeva vambhento bhagavantaṃyeva upavadamāno – ‘‘samaṇo ca me, bho, gotamo pāpito bhavissatī’’ti bhagavantaṃ etadavoca – ‘‘caṇḍā, bho gotama, sakyajāti; pharusā, bho gotama, sakyajāti; lahusā, bho gotama, sakyajāti; bhassā, bho gotama, sakyajāti; ibbhā santā ibbhā samānā na brāhmaṇe sakkaronti, na brāhmaṇe garuṃ karonti [garukaronti (sī. syā. kaṃ. pī.)], na brāhmaṇe mānenti, na brāhmaṇe pūjenti, na brāhmaṇe apacāyanti. Tayidaṃ, bho gotama, nacchannaṃ, tayidaṃ nappatirūpaṃ, yadime sakyā ibbhā santā ibbhā samānā na brāhmaṇe sakkaronti, na brāhmaṇe garuṃ karonti, na brāhmaṇe mānenti, na brāhmaṇe pūjenti, na brāhmaṇe apacāyantī’’ti. Itiha ambaṭṭho māṇavo idaṃ paṭhamaṃ sakyesu ibbhavādaṃ nipātesi. ",
      "english": "Then the brahmin student Ambaṭṭha, being addressed by the Blessed One with a familiar form of address, became angry and displeased. Reviling, disparaging, and criticizing the Blessed One, he said to the Blessed One: “Indeed, I will bring this ascetic Gotama to disgrace! Venerable Gotama, the Sakya clan is fierce; venerable Gotama, the Sakya clan is harsh; venerable Gotama, the Sakya clan is light-minded; venerable Gotama, the Sakya clan is abusive. Though they are noble, though they are prominent, they do not show respect to brahmins, do not hold brahmins in high esteem, do not honor brahmins, do not revere brahmins, and do not venerate brahmins. This, venerable Gotama, is not seemly; this is not fitting, that these Sakyas, though noble and prominent, do not show respect to brahmins, do not hold brahmins in high esteem, do not honor brahmins, do not revere brahmins, and do not venerate brahmins.”\n\nThus, the brahmin student Ambaṭṭha expressed this first reproach concerning the Sakyas' noble lineage.",
      "sinhala": "එවිට අම්බට්ඨ මානවකයා, තමාගේ (ප්‍රතිපදාව) අසම්පූර්ණ බව භාග්‍යවතුන් වහන්සේ විසින් පෙන්වා දෙනු ලබන කල්හි, කෝපයට පත්ව, නොසතුටින් යුතුව, භාග්‍යවතුන් වහන්සේටම ගැරහීමෙන්, භාග්‍යවතුන් වහන්සේටම නින්දා කරමින්, භාග්‍යවතුන් වහන්සේටම දොස් පවරමින්, “භවත් ගෞතම ශ්‍රමණයන් වහන්සේ මට පහත් ලෙස සලකන්නේය” යනුවෙන් භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “භවත් ගෞතමය, ශාක්‍ය ජාතිය දරුණුය; භවත් ගෞතමය, ශාක්‍ය ජාතිය රළුය; භවත් ගෞතමය, ශාක්‍ය ජාතිය නොසැලකිලිමත්ය; භවත් ගෞතමය, ශාක්‍ය ජාතිය කටකාරය. ඔවුහු ඉතා පොහොසත් ව සිටියදීත්, බ්‍රාහ්මණවරුන්ට සත්කාර නොකරති, බ්‍රාහ්මණවරුන්ට ගරු නොකරති, බ්‍රාහ්මණවරුන්ට මාන නොකරති, බ්‍රාහ්මණවරුන්ට පූජා නොකරති, බ්‍රාහ්මණවරුන්ට ගෞරව නොකරති. භවත් ගෞතමය, මේ ශාක්‍යවරු ඉතා පොහොසත් ව සිටියදීත්, බ්‍රාහ්මණවරුන්ට සත්කාර නොකිරීම, බ්‍රාහ්මණවරුන්ට ගරු නොකිරීම, බ්‍රාහ්මණවරුන්ට මාන නොකිරීම, බ්‍රාහ්මණවරුන්ට පූජා නොකිරීම, බ්‍රාහ්මණවරුන්ට ගෞරව නොකිරීම නොගැලපෙන්නකි, නුසුදුස්සකි.” මෙසේ අම්බට්ඨ මානවකයා ශාක්‍යයන්ට පොහොසත් බව පිළිබඳ නින්දාව පළමු වරට එල්ල කළේය.",
      "paliTitle": ""
    },
    {
      "number": 265,
      "pali": "‘‘Kiṃ pana te, ambaṭṭha, sakyā aparaddhu’’nti? ‘‘Ekamidāhaṃ, bho gotama, samayaṃ ācariyassa brāhmaṇassa pokkharasātissa kenacideva karaṇīyena kapilavatthuṃ agamāsiṃ. Yena sakyānaṃ sandhāgāraṃ tenupasaṅkamiṃ. Tena kho pana samayena sambahulā sakyā ceva sakyakumārā ca sandhāgāre [santhāgāre (sī. pī.)] uccesu āsanesu nisinnā honti aññamaññaṃ aṅgulipatodakehi [aṅgulipatodakena (pī.)] sañjagghantā saṃkīḷantā, aññadatthu mamaññeva maññe anujagghantā, na maṃ koci āsanenapi nimantesi. Tayidaṃ, bho gotama, nacchannaṃ, tayidaṃ nappatirūpaṃ, yadime sakyā ibbhā santā ibbhā samānā na brāhmaṇe sakkaronti, na brāhmaṇe garuṃ karonti, na brāhmaṇe mānenti, na brāhmaṇe pūjenti, na brāhmaṇe apacāyantī’’ti. Itiha ambaṭṭho māṇavo idaṃ dutiyaṃ sakyesu ibbhavādaṃ nipātesi. ",
      "english": "“What, Ambaṭṭha, have the Sakyans offended you about?”\n\n“One time, venerable Gotama, I went to Kapilavatthu for some business of my teacher, the brahmin Pokkharasāti. I approached the Sakyans’ assembly hall. Now, at that time, many Sakyans and Sakyan youths were seated in the assembly hall on high seats, laughing and playing among themselves, and I believe they were specifically mocking me, yet no one even offered me a seat. This, venerable Gotama, is unfitting; this is inappropriate, that these Sakyans, though they are of lowly birth, do not respect brahmins, do not revere brahmins, do not honor brahmins, do not venerate brahmins, do not pay deference to brahmins.”\n\nThus, the young brahmin Ambaṭṭha uttered this second disparagement of the Sakyans as being of low birth.",
      "sinhala": "අම්බට්ඨය, ශාක්‍ය​යෝ ඔබට කුමක් නම් වරදක් කර සිටිත් ද?\n\nභවත් ගෞතමයන් වහන්ස, එක් සමයක මගේ ආචාර්ය පුක්ඛරසාති නම් බ්‍රාහ්මණයාගේ යම් කිසි කටයුත්තක් නිසා මම කපිලවස්තුවට ගියෙමි. ශාක්‍ය​යන්ගේ රැස්වීම් ශාලාව තිබූ තැනට මම පැමිණියෙමි. එකල බොහෝ ශාක්‍ය​වරුන් සහ ශාක්‍ය​ කුමාරවරුන් රැස්වීම් ශාලාවේ උස් අසුන්වල හිඳගෙන සිටියහ. ඔවුහු එකිනෙකාට ඇඟිලි වලින් තට්ටු කරමින්, විහිළු කරමින්, සිනාසෙමින් සිටියහ. මා සිතන අන්දමට ඔවුහු මා දෙස බලාම සිනාසෙන්නට ඇත. මට කිසිවෙක් අසුනකටවත් ආරාධනා නොකළහ. භවත් ගෞතමයන් වහන්ස, මේ දේ නොසුදුසු ය, මේ දේ නුසුදුසු ය. මේ ශාක්‍ය​යෝ උසස් කුලවතුන්ව සිටිමින්, උසස් කුලවතුන් සේ සිටිමින් බ්‍රාහ්මණයන්ට සත්කාර නොකරති, බ්‍රාහ්මණයන්ට ගරු නොකරති, බ්‍රාහ්මණයන්ට මානයක් නොදක්වති, බ්‍රාහ්මණයන්ට පූජා නොකරති, බ්‍රාහ්මණයන්ට සංග්‍ර​හ නොකරති.\n\nමෙලෙස අම්බට්ඨ මානවකයා ශාක්‍ය​යන්ට එරෙහිව උඩඟු බවට චෝදනාවක් මේ දෙවැනි වරටත් කළේ ය.",
      "paliTitle": "Dutiyaibbhavādo",
      "englishTitle": "Second Discourse on the Wealthy",
      "sinhalaTitle": "දෙවන ඉබ්භ වාදය"
    },
    {
      "number": 266,
      "pali": "‘‘Laṭukikāpi kho, ambaṭṭha, sakuṇikā sake kulāvake kāmalāpinī hoti. Sakaṃ kho panetaṃ, ambaṭṭha, sakyānaṃ yadidaṃ kapilavatthuṃ, nārahatāyasmā ambaṭṭho imāya appamattāya abhisajjitu’’nti. ‘‘Cattārome, bho gotama, vaṇṇā – khattiyā brāhmaṇā vessā suddā. Imesañhi, bho gotama, catunnaṃ vaṇṇānaṃ tayo vaṇṇā – khattiyā ca vessā ca suddā ca – aññadatthu brāhmaṇasseva paricārakā sampajjanti. Tayidaṃ, bho gotama, nacchannaṃ, tayidaṃ nappatirūpaṃ, yadime sakyā ibbhā santā ibbhā samānā na brāhmaṇe sakkaronti, na brāhmaṇe garuṃ karonti, na brāhmaṇe mānenti, na brāhmaṇe pūjenti, na brāhmaṇe apacāyantī’’ti. Itiha ambaṭṭho māṇavo idaṃ tatiyaṃ sakyesu ibbhavādaṃ nipātesi. ",
      "english": "Indeed, Ambattha, even a small quail in its own nest chatters as it pleases. But this Kapilavatthu, Ambattha, belongs to the Sakyas. It is not fitting, venerable Ambattha, that you should insult them in this trifling way.\n\n“Here are these four castes, Master Gotama: Khattiyas, Brahmins, Vessas, Suddas. Among these four castes, Master Gotama, three castes – the Khattiyas, Vessas, and Suddas – are simply servants to the Brahmins. Therefore, Master Gotama, it is not proper, it is not fitting, that these Sakyas, being commoners, do not respect Brahmins, do not honor Brahmins, do not esteem Brahmins, do not revere Brahmins, and do not pay deference to Brahmins.”\n\nThus, the young Brahmin Ambattha, for the third time, uttered this accusation of inferiority against the Sakyas.",
      "sinhala": "අම්බට්ඨය, ලටුකිකා පක්ෂිනිය පවා තමාගේ කැදැල්ලෙහි ප්‍රිය වදන් කියමින් සිටියි. අම්බට්ඨය, මේ කපිලවස්තුව ශාක්‍යයන්ගේම ස්වකීය භූමියයි. පින්වත් අම්බට්ඨ තෙමේ මෙවැනි සුළු කාරණාවක් නිසා ශාක්‍යයන්ට දොස් පැවරීම සුදුසු නොවේ.\n\nභවත් ගෞතමය, මේ වර්ණ හතරකි. ඒ නම්, ක්ෂත්‍රිය, බ්‍රාහ්මණ, වෛශ්‍ය, ශූද්‍ර යනුවෙනි. භවත් ගෞතමය, මේ සතර වර්ණයන්ගෙන් ක්ෂත්‍රිය, වෛශ්‍ය, ශූද්‍ර යන වර්ණ තුන බ්‍රාහ්මණයන්ටම උපස්ථායකයෝ වෙති. භවත් ගෞතමය, මේ දෙය සුදුසු නැත, මේ දෙය නොගැලපෙයි. මේ ශාක්‍යයෝ උඩඟු වූවාහු, බ්‍රාහ්මණයන්ට සත්කාර නොකරති, බ්‍රාහ්මණයන්ට ගෞරව නොකරති, බ්‍රාහ්මණයන් අගය නොකරති, බ්‍රාහ්මණයන්ට පූජා නොකරති, බ්‍රාහ්මණයන්ට බුහුමන් නොදක්වති. මෙසේ අම්බට්ඨ මානවක තෙමේ මේ තෙවැනි වරටත් ශාක්‍යයන්ට උඩඟුකම පිළිබඳ චෝදනාව එල්ල කළේය.",
      "paliTitle": "Tatiyaibbhavādo",
      "englishTitle": "Third Discourse on the Eminent",
      "sinhalaTitle": "තෙවැනි ඇත් වාදය"
    },
    {
      "number": 267,
      "pali": "Atha kho bhagavato etadahosi – ‘‘atibāḷhaṃ kho ayaṃ ambaṭṭho māṇavo sakyesu ibbhavādena nimmādeti, yaṃnūnāhaṃ gottaṃ puccheyya’’nti. Atha kho bhagavā ambaṭṭhaṃ māṇavaṃ etadavoca – ‘‘kathaṃ gottosi, ambaṭṭhā’’ti? ‘‘Kaṇhāyanohamasmi, bho gotamā’’ti. Porāṇaṃ kho pana te ambaṭṭha mātāpettikaṃ nāmagottaṃ anussarato ayyaputtā sakyā bhavanti; dāsiputto tvamasi sakyānaṃ. Sakyā kho pana, ambaṭṭha, rājānaṃ okkākaṃ pitāmahaṃ dahanti. ‘‘Bhūtapubbaṃ, ambaṭṭha, rājā okkāko yā sā mahesī piyā manāpā, tassā puttassa rajjaṃ pariṇāmetukāmo jeṭṭhakumāre raṭṭhasmā pabbājesi – okkāmukhaṃ karakaṇḍaṃ [ukkāmukhaṃ karakaṇḍuṃ (sī. syā.)] hatthinikaṃ sinisūraṃ [sinipuraṃ (sī. syā.)]. Te raṭṭhasmā pabbājitā himavantapasse pokkharaṇiyā tīre mahāsākasaṇḍo, tattha vāsaṃ kappesuṃ. Te jātisambhedabhayā sakāhi bhaginīhi saddhiṃ saṃvāsaṃ kappesuṃ. ‘‘Atha kho, ambaṭṭha, rājā okkāko amacce pārisajje āmantesi – ‘kahaṃ nu kho, bho, etarahi kumārā sammantī’ti? ‘Atthi, deva, himavantapasse pokkharaṇiyā tīre mahāsākasaṇḍo, tatthetarahi kumārā sammanti. Te jātisambhedabhayā sakāhi bhaginīhi saddhiṃ saṃvāsaṃ kappentī’ti. Atha kho, ambaṭṭha, rājā okkāko udānaṃ udānesi – ‘sakyā vata, bho, kumārā, paramasakyā vata, bho, kumārā’ti. Tadagge kho pana ambaṭṭha sakyā paññāyanti; so ca nesaṃ pubbapuriso. ‘‘Rañño kho pana, ambaṭṭha, okkākassa disā nāma dāsī ahosi. Sā kaṇhaṃ nāma [sā kaṇhaṃ (pī.)] janesi. Jāto kaṇho pabyāhāsi – ‘dhovatha maṃ, amma, nahāpetha maṃ amma, imasmā maṃ asucismā parimocetha, atthāya vo bhavissāmī’ti. Yathā kho pana ambaṭṭha etarahi manussā pisāce disvā ‘pisācā’ti sañjānanti; evameva kho, ambaṭṭha, tena kho pana samayena manussā pisāce ‘kaṇhā’ti sañjānanti. Te evamāhaṃsu – ‘ayaṃ jāto pabyāhāsi, kaṇho jāto, pisāco jāto’ti. Tadagge kho pana, ambaṭṭha kaṇhāyanā paññāyanti, so ca kaṇhāyanānaṃ pubbapuriso. Iti kho te, ambaṭṭha, porāṇaṃ mātāpettikaṃ nāmagottaṃ anussarato ayyaputtā sakyā bhavanti, dāsiputto tvamasi sakyāna’’nti.",
      "english": "Then it occurred to the Blessed One: \"This student Ambaṭṭha is excessively disparaging the Sakyas with talk of their low birth. What if I were to ask him about his lineage?\" Then the Blessed One said to the student Ambaṭṭha: \"Of what lineage are you, Ambaṭṭha?\" \"I am of the Kaṇhāyana lineage, Reverend Gotama.\" But when your ancient maternal and paternal name and lineage are recalled, Ambaṭṭha, the Sakyas become your ancestors; you are the son of a Sakya slave woman. And the Sakyas, Ambaṭṭha, consider King Okkāka to be their grandfather.\n\n\"Formerly, Ambaṭṭha, King Okkāka, desiring to hand over the kingdom to the son of his beloved and pleasing queen, banished his eldest sons from the realm – Okkāmukha, Karakaṇḍa, Hatthinika, and Sinisūra. Those, having been banished from the realm, near the Himalayas, on the bank of a lotus pond, in a great forest of sāla trees, made their dwelling there. Fearing the mixing of their lineage, they cohabited with their own sisters.\n\n\"Then, Ambaṭṭha, King Okkāka addressed his ministers and courtiers, saying: 'Where, sirs, do the princes now reside?' 'There is, sire, a great forest of sāla trees near the Himalayas, on the bank of a lotus pond. There the princes now reside. Fearing the mixing of their lineage, they are cohabiting with their own sisters.' Then, Ambaṭṭha, King Okkāka uttered this exclamation: 'Truly, sirs, the princes are capable! Truly, sirs, the princes are most capable!' From that time forth, Ambaṭṭha, they became known as Sakyas; and that was their earliest ancestor.\n\n\"And King Okkāka, Ambaṭṭha, had a slave woman named Disā. She gave birth to a son named Kaṇha. When Kaṇha was born, he spoke forth: 'Wash me, mother, bathe me, mother, free me from this impurity, I will be of benefit to you.' Just as, Ambaṭṭha, people nowadays, seeing demons, recognize them as 'demons'; exactly so, Ambaṭṭha, in those days, people recognized demons as 'Kaṇhas'. They said thus: 'This one, born, has spoken forth! A Kaṇha is born! A demon is born!' From that time forth, Ambaṭṭha, they became known as Kaṇhāyanas; and that was their earliest ancestor. So then, Ambaṭṭha, when your ancient maternal and paternal name and lineage are recalled, the Sakyas become your ancestors, and you are the son of a Sakya slave woman.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේට මෙසේ සිතුණි: \"මේ අම්බට්ඨ මානවකයා ශාක්‍යයන්ට ඉතා බලවත් ලෙස නීචවාදයෙන් නිග්‍රහ කරයි. මම මොහුගෙන් ගෝත්‍රය විමසිය යුතු නම් හොඳය.\" එවිට භාග්‍යවතුන් වහන්සේ අම්බට්ඨ මානවකයාට මෙසේ වදාළ සේක: \"අම්බට්ඨය, ඔබ කුමන ගෝත්‍රයකට අයත් කෙනෙක්ද?\" \"භවත් ගෞතමයන් වහන්ස, මම කාණ්‍යායන ගෝත්‍රයට අයත් වෙමි.\" අම්බට්ඨය, ඔබගේ පූර්වජ මව්පියන්ගේ නාම ගෝත්‍රය සිහිපත් කරන විට, ශාක්‍යවරුන් (ඔබගේ) මුතුන් මිත්තන් වන්නේය; ඔබ ශාක්‍යයන්ගේ දාසි පුත්‍රයෙකි. අම්බට්ඨය, ශාක්‍යවරු ඔක්කාක රජු තමන්ගේ මුත්තා ලෙස හඳුන්වති. \"අම්බට්ඨය, පෙර කලෙක, ඔක්කාක රජු තමාට ප්‍රිය වූ මන වඩන මහේශිකාවකට උපන් පුත්‍රයාට රාජ්‍යය පවරා දීමට කැමැතිව, ඔක්කාමුඛ, කරකණ්ඩු, හත්ථිනික, සිනිසූර යන ජ්‍යෙෂ්ඨ කුමාරවරුන්ව රාජ්‍යයෙන් පිටුවහල් කළේය. රාජ්‍යයෙන් පිටුවහල් කරන ලද ඔවුහු හිමාලය පසෙක පොකුණක් අසල වූ මහත් ශාක ගොමුවක වාසය කළහ. ඔවුහු ජාති මිශ්‍ර වීමක භය නිසා තමන්ගේම සහෝදරියන් සමඟ සංවාසය කළහ. \"එවිට අම්බට්ඨය, ඔක්කාක රජු ඇමතිවරුන් සහ පිරිස අමතා මෙසේ පැවසීය: 'භවත්නි, මේ වන විට කුමාරවරු කොහි වාසය කරත්ද?' (ඔවුහු පිළිතුරු දුන්හ): 'දෙවියනි, හිමාලය පසෙක පොකුණක් අසල මහත් ශාක ගොමුවක් ඇත. කුමාරවරු මේ වන විට එහි වාසය කරති. ඔවුහු ජාති මිශ්‍ර වීමක භය නිසා තමන්ගේම සහෝදරියන් සමඟ සංවාසය කරති.' එවිට අම්බට්ඨය, ඔක්කාක රජු උදානයක් පහළ කළේය: 'භවත්නි, කුමාරවරු ශක්‍යයෝමය, භවත්නි, කුමාරවරු පරම ශක්‍යයෝමය!' එතැන් පටන් අම්බට්ඨය, ශාක්‍යයෝ ප්‍රකට වූහ; එම රජු ඔවුන්ගේ මුතුන් මිත්තා විය.\n\n\"අම්බට්ඨය, ඔක්කාක රජුට දිසා නම් දාසියක් සිටියාය. ඇය කාණ නම් පුත්‍රයෙකුව වැදුවාය. උපන් කාණ හඬා වැටුණි: 'අම්මේ, මා සෝදන්න, අම්මේ, මා නහවන්න, මේ අපිරිසිදුකමෙන් මා මුදාගන්න, මම ඔබට ප්‍රයෝජනවත් වන්නෙමි!' අම්බට්ඨය, යම් සේ මේ වන විට මිනිස්සු පිසාචයන් දැක 'පිසාචයෝයැ'යි හඳුනාගනිත්ද; එපරිද්දෙන්ම අම්බට්ඨය, ඒ කාලයේ මිනිස්සු පිසාචයන්ව 'කාණ' ලෙස හඳුනාගත්තෝය. ඔවුහු මෙසේ කීහ: 'මේ උපන් තැනැත්තා හඬා වැටුණි, කාණ උපන්නේය, පිසාචයෙක් උපන්නේය!' එතැන් පටන් අම්බට්ඨය, කාණ්‍යායනයෝ ප්‍රකට වූහ; එම පුත්‍රයා කාණ්‍යායනයන්ගේ මුතුන් මිත්තා විය. මෙසේ අම්බට්ඨය, ඔබගේ පූර්වජ මව්පියන්ගේ නාම ගෝත්‍රය සිහිපත් කරන විට, ශාක්‍යවරු ඔබගේ මුතුන් මිත්තන් වන්නේය; ඔබ ශාක්‍යයන්ගේ දාසි පුත්‍රයෙකි.\"",
      "paliTitle": "Dāsiputtavādo",
      "englishTitle": "Discourse on the Slave Girl's Son",
      "sinhalaTitle": "දාසිපුත්‍ර වාදය"
    },
    {
      "number": 268,
      "pali": "Evaṃ vutte, te māṇavakā bhagavantaṃ etadavocuṃ – ‘‘mā bhavaṃ gotamo ambaṭṭhaṃ atibāḷhaṃ dāsiputtavādena nimmādesi. Sujāto ca, bho gotama ambaṭṭho māṇavo, kulaputto ca ambaṭṭho māṇavo, bahussuto ca ambaṭṭho māṇavo, kalyāṇavākkaraṇo ca ambaṭṭho māṇavo, paṇḍito ca ambaṭṭho māṇavo, pahoti ca ambaṭṭho māṇavo bhotā gotamena saddhiṃ asmiṃ vacane paṭimantetu’’nti.",
      "english": "When this was said, those young brahmins said to the Blessed One: “Venerable Gotama, please do not too harshly reproach Ambaṭṭha by calling him ‘son of a slave woman.’ Ambaṭṭha the young brahmin, good Gotama, is well-born and of good family; he is learned, skilled in speech, and wise. Furthermore, Ambaṭṭha the young brahmin is capable of debating with Venerable Gotama on this very point.”",
      "sinhala": "එසේ කී කල්හි, ඒ මානවකයෝ භාග්‍යවතුන් වහන්සේට මෙසේ කීහ: \"ගෞතම භවත් ඔබ අම්බට්ඨට දාසිපුත්‍රවාදයෙන් ඉතා දැඩි ලෙස නින්දා නොකරනු මැනව. ගෞතම භවත්, අම්බට්ඨ මානවකයා සුජාතයෙකි, කුලපුත්‍රයෙකි, බහුශ්‍රැතයෙකි, මනා වචන ඇති අයෙකි, පණ්ඩිතයෙකි. තවද, අම්බට්ඨ මානවකයාට ගෞතම භවත් ඔබ සමඟ මේ කරුණෙහිදී ප්‍රතිවචන දීමට පුළුවන.\"",
      "paliTitle": ""
    },
    {
      "number": 269,
      "pali": "Atha kho bhagavā te māṇavake etadavoca – ‘‘sace kho tumhākaṃ māṇavakānaṃ evaṃ hoti – ‘dujjāto ca ambaṭṭho māṇavo, akulaputto ca ambaṭṭho māṇavo, appassuto ca ambaṭṭho māṇavo, akalyāṇavākkaraṇo ca ambaṭṭho māṇavo, duppañño ca ambaṭṭho māṇavo, na ca pahoti ambaṭṭho māṇavo samaṇena gotamena saddhiṃ asmiṃ vacane paṭimantetu’nti, tiṭṭhatu ambaṭṭho māṇavo, tumhe mayā saddhiṃ mantavho asmiṃ vacane. Sace pana tumhākaṃ māṇavakānaṃ evaṃ hoti – ‘sujāto ca ambaṭṭho māṇavo, kulaputto ca ambaṭṭho māṇavo, bahussuto ca ambaṭṭho māṇavo, kalyāṇavākkaraṇo ca ambaṭṭho māṇavo, paṇḍito ca ambaṭṭho māṇavo, pahoti ca ambaṭṭho māṇavo samaṇena gotamena saddhiṃ asmiṃ vacane paṭimantetu’nti, tiṭṭhatha tumhe; ambaṭṭho māṇavo mayā saddhiṃ paṭimantetū’’ti. ‘‘Sujāto ca, bho gotama, ambaṭṭho māṇavo, kulaputto ca ambaṭṭho māṇavo, bahussuto ca ambaṭṭho māṇavo, kalyāṇavākkaraṇo ca ambaṭṭho māṇavo, paṇḍito ca ambaṭṭho māṇavo, pahoti ca ambaṭṭho māṇavo bhotā gotamena saddhiṃ asmiṃ vacane paṭimantetuṃ, tuṇhī mayaṃ bhavissāma, ambaṭṭho māṇavo bhotā gotamena saddhiṃ asmiṃ vacane paṭimantetū’’ti.",
      "english": "Then the Blessed One said to those young brahmins, \"If indeed you young brahmins think, 'The young brahmin Ambaṭṭha is ill-born, not of good family, unlearned, of poor speech, unwise, and is unable to debate with the recluse Gotama on this matter,' then let the young brahmin Ambaṭṭha stand aside, and you yourselves debate with me on this matter. But if you young brahmins think, 'The young brahmin Ambaṭṭha is well-born, of good family, highly learned, of excellent speech, wise, and is able to debate with the recluse Gotama on this matter,' then you all stand aside; let the young brahmin Ambaṭṭha debate with me.\" \"Indeed, Master Gotama,\" they replied, \"the young brahmin Ambaṭṭha is well-born, of good family, highly learned, of excellent speech, wise, and is able to debate with Master Gotama on this matter. We shall remain silent; let the young brahmin Ambaṭṭha debate with Master Gotama.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ එම මානවකයන්ට මෙය වදාළ සේක –\n\n\"යම් හෙයකින් ඔබට, මානවකවරුනි, මෙසේ සිතේ නම් – ‘අම්බට්ඨ මානවකයා නුජාත ය, අකුලපුත්‍රයෙකි, අල්පශ්‍රැතයෙකි, අකල්‍යාණව්‍යක්කරණ ඇතියෙකි, දුෂ්ප්‍රාඥයෙකි, ශ්‍රමණ ගෞතමයන් සමඟ මේ වචනයෙහි ප්‍රතිමන්ත්‍රණය කිරීමට අම්බට්ඨ මානවකයාට නොහැකි ය’ කියා, අම්බට්ඨ මානවකයා සිටීවා, මේ වචනයෙහි ඔබලා මා සමඟ සාකච්ඡා කරන්න. යම් හෙයකින් ඔබට, මානවකවරුනි, මෙසේ සිතේ නම් – ‘අම්බට්ඨ මානවකයා සුජාත ය, කුලපුත්‍රයෙකි, බහුශ්‍රැතයෙකි, කල්‍යාණව්‍යක්කරණ ඇතියෙකි, පණ්ඩිතයෙකි, ශ්‍රමණ ගෞතමයන් සමඟ මේ වචනයෙහි ප්‍රතිමන්ත්‍රණය කිරීමට අම්බට්ඨ මානවකයාට හැකි ය’ කියා, ඔබලා සිටින්න; අම්බට්ඨ මානවකයා මා සමඟ ප්‍රතිමන්ත්‍රණය කරත්වා\" යි.\n\n\"භවත් ගෞතමයන් වහන්ස, අම්බට්ඨ මානවකයා සුජාත ය, අම්බට්ඨ මානවකයා කුලපුත්‍රයෙකි, අම්බට්ඨ මානවකයා බහුශ්‍රැතයෙකි, අම්බට්ඨ මානවකයා කල්‍යාණව්‍යක්කරණ ඇතියෙකි, අම්බට්ඨ මානවකයා පණ්ඩිතයෙකි, භවත් ගෞතමයන් වහන්සේ සමඟ මේ වචනයෙහි ප්‍රතිමන්ත්‍රණය කිරීමට අම්බට්ඨ මානවකයාට හැකි ය. අපි නිහඬ වන්නෙමු, භවත් ගෞතමයන් වහන්සේ සමඟ මේ වචනයෙහි අම්බට්ඨ මානවකයා ප්‍රතිමන්ත්‍රණය කරත්වා\" යි.",
      "paliTitle": ""
    },
    {
      "number": 270,
      "pali": "Atha kho bhagavā ambaṭṭhaṃ māṇavaṃ etadavoca – ‘‘ayaṃ kho pana te, ambaṭṭha, sahadhammiko pañho āgacchati, akāmā byākātabbo. Sace tvaṃ na byākarissasi, aññena vā aññaṃ paṭicarissasi, tuṇhī vā bhavissasi, pakkamissasi vā ettheva te sattadhā muddhā phalissati. Taṃ kiṃ maññasi, ambaṭṭha, kinti te sutaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ kutopabhutikā kaṇhāyanā, ko ca kaṇhāyanānaṃ pubbapuriso’’ti? Evaṃ vutte, ambaṭṭho māṇavo tuṇhī ahosi. Dutiyampi kho bhagavā ambaṭṭhaṃ māṇavaṃ etadavoca – ‘‘taṃ kiṃ maññasi, ambaṭṭha, kinti te sutaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ kutopabhutikā kaṇhāyanā, ko ca kaṇhāyanānaṃ pubbapuriso’’ti? Dutiyampi kho ambaṭṭho māṇavo tuṇhī ahosi. Atha kho bhagavā ambaṭṭhaṃ māṇavaṃ etadavoca – ‘‘byākarohi dāni ambaṭṭha, na dāni, te tuṇhībhāvassa kālo. Yo kho, ambaṭṭha, tathāgatena yāvatatiyakaṃ sahadhammikaṃ pañhaṃ puṭṭho na byākaroti, etthevassa sattadhā muddhā phalissatī’’ti.",
      "english": "Then the Blessed One said this to the young Brahmin Ambattha: \"Ambattha, this is a righteous question that has come to you, and it must be answered even against your will. If you do not answer, or you reply with something irrelevant, or you remain silent, or you depart, then right here your head will split into seven pieces. Ambattha, what do you think? How have you heard it from the senior, elder brahmins, your teachers and teachers' teachers, speaking: from what origin comes this disparagement, and who is the ancient progenitor of those who practice this disparagement?\" When this was said, the young Brahmin Ambattha remained silent. A second time the Blessed One said this to the young Brahmin Ambattha: \"Ambattha, what do you think? How have you heard it from the senior, elder brahmins, your teachers and teachers' teachers, speaking: from what origin comes this disparagement, and who is the ancient progenitor of those who practice this disparagement?\" A second time the young Brahmin Ambattha remained silent. Then the Blessed One said this to the young Brahmin Ambattha: \"Answer now, Ambattha; this is not the time for your silence. Indeed, Ambattha, whoever, having been asked a righteous question by a Tathāgata for the third time, does not answer, right here his head will split into seven pieces.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ අම්බට්ඨ මානවකයාට මෙය වදාළ සේක – \"අම්බට්ඨය, මේ නුඹට ධර්මානුකූල ප්‍රශ්නයක් පැමිණ තිබේ. ඊට අකමැත්තෙන් හෝ පිළිතුරු දිය යුතුයි. යම් හෙයකින් නුඹ පිළිතුරු නොදෙන්නේ නම්, නැතහොත් වෙන දෙයක් කියන්නේ නම්, නැතහොත් නිහඬව සිටින්නේ නම්, නැතහොත් පලා යන්නේ නම්, මෙතැනදීම නුඹේ හිස සත් කඩකට පැලී යනු ඇත. අම්බට්ඨය, නුඹ කුමක් සිතන්නෙහිද? වෘද්ධ වූ, මහලු වූ, ආචාර්ය-ප්‍රාචාර්ය බමුණන් කතා කරද්දී කණ්හායනයෝ කවර තැනක සිට පැවත එන්නෝද, කණ්හායනයන්ගේ ප්‍රථම පුරුෂයා කවරෙක්දැයි නුඹට ශ්‍රවණය වී තිබෙන්නේ කෙසේද?\" මෙසේ වදාළ කල්හි අම්බට්ඨ මානවකයා නිහඬව සිටියේය. දෙවෙනි වතාවටත් භාග්‍යවතුන් වහන්සේ අම්බට්ඨ මානවකයාට මෙය වදාළ සේක – \"අම්බට්ඨය, නුඹ කුමක් සිතන්නෙහිද? වෘද්ධ වූ, මහලු වූ, ආචාර්ය-ප්‍රාචාර්ය බමුණන් කතා කරද්දී කණ්හායනයෝ කවර තැනක සිට පැවත එන්නෝද, කණ්හායනයන්ගේ ප්‍රථම පුරුෂයා කවරෙක්දැයි නුඹට ශ්‍රවණය වී තිබෙන්නේ කෙසේද?\" දෙවෙනි වතාවටත් අම්බට්ඨ මානවකයා නිහඬව සිටියේය. එවිට භාග්‍යවතුන් වහන්සේ අම්බට්ඨ මානවකයාට මෙය වදාළ සේක – \"අම්බට්ඨය, දැන් පිළිතුරු දෙන්න. දැන් නුඹට නිහඬව සිටීමට කාලය නොවේ. අම්බට්ඨය, යම් කෙනෙක් තථාගතයන් වහන්සේ විසින් තුන්වැනි වතාවටත් ධර්මානුකූල ප්‍රශ්නයක් විමසනු ලැබ පිළිතුරු නොදෙන්නේ නම්, මෙතැනදීම ඔහුගේ හිස සත් කඩකට පැලී යනු ඇත.\"",
      "paliTitle": ""
    },
    {
      "number": 271,
      "pali": "Tena kho pana samayena vajirapāṇī yakkho mahantaṃ ayokūṭaṃ ādāya ādittaṃ sampajjalitaṃ sajotibhūtaṃ [sañjotibhūtaṃ (syā.)] ambaṭṭhassa māṇavassa upari vehāsaṃ ṭhito hoti – ‘‘sacāyaṃ ambaṭṭho māṇavo bhagavatā yāvatatiyakaṃ sahadhammikaṃ pañhaṃ puṭṭho na byākarissati, etthevassa sattadhā muddhaṃ phālessāmī’’ti. Taṃ kho pana vajirapāṇiṃ yakkhaṃ bhagavā ceva passati ambaṭṭho ca māṇavo.",
      "english": "At that time, the yaksha Vajirapāṇī, holding a mighty iron club that was blazing, thoroughly aflame, and luminous, stood in the sky above the brahmin Ambhaṭṭha. He thought, \"If this brahmin Ambhaṭṭha, when questioned by the Blessed One for a third time on a doctrinal matter, does not answer, then right here I shall split his head into seven pieces.\" And that yaksha Vajirapāṇī was seen by both the Blessed One and the brahmin Ambhaṭṭha.",
      "sinhala": "ඒ අවස්ථාවේදී වජිරපාණී යක්ෂයා ගිනිගෙන, හොඳින් දැල්වී, දීප්තිමත්වූ මහත් වූ යකඩ මුගුරක් ගෙන අම්බට්ඨ මානවකයාට ඉහළින් අහසේ සිටියේය – ‘යම් හෙයකින් මේ අම්බට්ඨ මානවකයා භාග්‍ය​වතුන් වහන්සේ විසින් තුන්වෙනි වර දක්වා ධර්​මයට අනුකූල ප්‍ර​ශ්නයක් විමසනු ලැබූවිට පිළිතුරු නොදෙන්නේ නම්, මෙතනදීම ඔහුගේ හිස සත් කඩකට පළන්නෙමි’යි. ඒ වජිරපාණී යක්ෂයා භාග්‍ය​වතුන් වහන්සේත්, අම්බට්ඨ මානවකයාත් දුටුවෝය.",
      "paliTitle": ""
    },
    {
      "number": 272,
      "pali": "Atha kho ambaṭṭho māṇavo bhīto saṃviggo lomahaṭṭhajāto bhagavantaṃyeva tāṇaṃ gavesī bhagavantaṃyeva leṇaṃ gavesī bhagavantaṃyeva saraṇaṃ gavesī – upanisīditvā bhagavantaṃ etadavoca – ‘‘kimetaṃ [kiṃ me taṃ (ka.)] bhavaṃ gotamo āha? Punabhavaṃ gotamo bravitū’’ti [brūtu (syā.)]. ‘‘Taṃ kiṃ maññasi, ambaṭṭha, kinti te sutaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ kutopabhutikā kaṇhāyanā, ko ca kaṇhāyanānaṃ pubbapuriso’’ti? ‘‘Evameva me, bho gotama, sutaṃ yatheva bhavaṃ gotamo āha. Tatopabhutikā kaṇhāyanā; so ca kaṇhāyanānaṃ pubbapuriso’’ti.",
      "english": "Then the young Brahmin Ambaṭṭha, frightened, agitated, and with his hair standing on end, sought the Blessed One alone as his protection, sought the Blessed One alone as his shelter, sought the Blessed One alone as his ultimate refuge. He approached, sat down near the Blessed One, and said this: \"What is this that Venerable Gotama has said? Please, Venerable Gotama, say it again.\"\n\n\"What do you think, Ambaṭṭha? What have you heard from the Brahmins—the elders, the venerable ones, your teachers, and your teachers' teachers—when they were speaking about from whom the 'dark lineage' originated, and who was the first ancestor of the 'dark lineage'?\"\n\"Just as Venerable Gotama has said, so indeed have I heard, good Gotama. From that one originated the 'dark lineage', and he was the first ancestor of the 'dark lineage'.\"",
      "sinhala": "ඉන්පසු අම්බට්ඨ මානවකයා බියට පත්ව, කම්පාවට පත්ව, ලොමුදැහැගැන්වී භාග්‍යවතුන් වහන්සේම තමන්ට පිහිට කොට සොයමින්, භාග්‍යවතුන් වහන්සේම තමන්ට රැකවරණයක් කොට සොයමින්, භාග්‍යවතුන් වහන්සේම සරණ කොට සොයමින් – භාග්‍යවතුන් වහන්සේ වෙතට ගොස් මෙසේ පැවසුවේය: \"ගෞතම භවත්තුමා මේ කුමක්ද පවසන්නේ? ගෞතම භවත්තුමා නැවත වරක් පවසනු මැනවි!\" එවිට භාග්‍යවතුන් වහන්සේ ඇසූ සේක: \"අම්බට්ඨ, ඔබ කුමක් සිතන්නෙහිද? වයෝවෘද්ධ වූ, මහලු වූ බ්‍රාහ්මණයන්ගේ මෙන්ම ආචාර්යවරුන්ගේ හා ප්‍රාචාර්යවරුන්ගේ කතා කරනු අසා ඔබට කෙසේද අසන්නට ලැබී තිබෙන්නේ, කණ්හායන පරපුර කොතැනින් ආරම්භ වූයේද, කණ්හායනයන්ගේ මුල් පුරුෂයා කවුද කියා?\" \"ගෞතම භවත්නි, භවත් ගෞතමයන් වහන්සේ පැවසූ අයුරින්ම මට එසේම අසන්නට ලැබුණි. එතැනින්මයි කණ්හායන පරපුර ආරම්භ වූයේ. ඔහුමයි කණ්හායනයන්ගේ මුල් පුරුෂයා.\"",
      "paliTitle": ""
    },
    {
      "number": 273,
      "pali": "Evaṃ vutte, te māṇavakā unnādino uccāsaddamahāsaddā ahesuṃ – ‘‘dujjāto kira, bho, ambaṭṭho māṇavo; akulaputto kira, bho, ambaṭṭho māṇavo; dāsiputto kira, bho, ambaṭṭho māṇavo sakyānaṃ. Ayyaputtā kira, bho, ambaṭṭhassa māṇavassa sakyā bhavanti. Dhammavādiṃyeva kira mayaṃ samaṇaṃ gotamaṃ apasādetabbaṃ amaññimhā’’ti.",
      "english": "When this was said, those young men became tumultuous, making a loud and great noise: \"Truly, friends, Ambaṭṭha the brahmin is ill-born! Truly, friends, Ambaṭṭha the brahmin is not of noble lineage! Truly, friends, Ambaṭṭha the brahmin is the son of a female slave of the Sakyans! Truly, friends, the Sakyans are the masters of Ambaṭṭha the brahmin! And we truly thought that we should disparage the ascetic Gotama, the speaker of the Dhamma!\"",
      "sinhala": "මෙසේ කී කල්හි, ඒ මානවකයෝ මහත් ඝෝෂා නඟමින්, මහත් ශබ්දයක් ඇති කළෝය. “අහෝ, අම්බට්ඨ මානවකයා දුර්ජාතයෙක් බව පෙනේ; අකුලපුත්‍රයෙක් බව පෙනේ; ශාක්‍යයන්ගේ දාසි පුත්‍රයෙක් බව පෙනේ. අහෝ, අම්බට්ඨ මානවකයාගේ ස්වාමීහු වන්නේ ශාක්‍යවරුන් බව පෙනේ. අප නම් සිතුවේ ධර්මය දේශනා කරන ශ්‍ර​මණ ගෞතමයන්ට අපහාස කළ යුතු බව යි.”",
      "paliTitle": "Ambaṭṭhavaṃsakathā",
      "englishTitle": "Story of the Ambaṭṭha Lineage",
      "sinhalaTitle": "අම‍්බට‍්ඨ වංශ කතාව"
    },
    {
      "number": 274,
      "pali": "Atha kho bhagavato etadahosi – ‘‘atibāḷhaṃ kho ime māṇavakā ambaṭṭhaṃ māṇavaṃ dāsiputtavādena nimmādenti, yaṃnūnāhaṃ parimoceyya’’nti. Atha kho bhagavā te māṇavake etadavoca – ‘‘mā kho tumhe, māṇavakā, ambaṭṭhaṃ māṇavaṃ atibāḷhaṃ dāsiputtavādena nimmādetha. Uḷāro so kaṇho isi ahosi. So dakkhiṇajanapadaṃ gantvā brahmamante adhīyitvā rājānaṃ okkākaṃ upasaṅkamitvā maddarūpiṃ dhītaraṃ yāci. Tassa rājā okkāko – ‘ko nevaṃ re ayaṃ mayhaṃ dāsiputto samāno maddarūpiṃ dhītaraṃ yācatī’’’ ti, kupito anattamano khurappaṃ sannayhi [sannahi (ka.)]. So taṃ khurappaṃ neva asakkhi muñcituṃ, no paṭisaṃharituṃ. ‘‘Atha kho, māṇavakā, amaccā pārisajjā kaṇhaṃ isiṃ upasaṅkamitvā etadavocuṃ – ‘sotthi, bhaddante [bhadante (sī. syā.)], hotu rañño; sotthi, bhaddante, hotu rañño’ti. ‘Sotthi bhavissati rañño, api ca rājā yadi adho khurappaṃ muñcissati, yāvatā rañño vijitaṃ, ettāvatā pathavī undriyissatī’ti. ‘Sotthi, bhaddante, hotu rañño, sotthi janapadassā’ti. ‘Sotthi bhavissati rañño, sotthi janapadassa, api ca rājā yadi uddhaṃ khurappaṃ muñcissati, yāvatā rañño vijitaṃ, ettāvatā satta vassāni devo na vassissatī’ti. ‘Sotthi, bhaddante, hotu rañño sotthi janapadassa devo ca vassatū’ti. ‘Sotthi bhavissati rañño sotthi janapadassa devo ca vassissati, api ca rājā jeṭṭhakumāre khurappaṃ patiṭṭhāpetu, sotthi kumāro pallomo bhavissatī’ti. Atha kho, māṇavakā, amaccā okkākassa ārocesuṃ – ‘okkāko jeṭṭhakumāre khurappaṃ patiṭṭhāpetu. Sotthi kumāro pallomo bhavissatī’ti. Atha kho rājā okkāko jeṭṭhakumāre khurappaṃ patiṭṭhapesi, sotthi kumāro pallomo samabhavi. Atha kho tassa rājā okkāko bhīto saṃviggo lomahaṭṭhajāto brahmadaṇḍena tajjito maddarūpiṃ dhītaraṃ adāsi. Mā kho tumhe, māṇavakā, ambaṭṭhaṃ māṇavaṃ atibāḷhaṃ dāsiputtavādena nimmādetha, uḷāro so kaṇho isi ahosī’’ti. ",
      "english": "Then it occurred to the Blessed One: \"These young men are greatly humiliating Ambaṭṭha the young man by calling him a slave's son. What if I were to free him?\" Then the Blessed One said to those young men: \"Young men, do not greatly humiliate Ambaṭṭha the young man by calling him a slave's son. That Kaṇha, the sage, was illustrious. He went to the Southern region, studied the Brahma-mantras, approached King Okkāka, and asked for his daughter, Maddarūpī. King Okkāka, upon hearing this, thought, 'Who is this fellow, a slave's son, asking for my daughter Maddarūpī?' Angered and displeased, he grasped a javelin. He was unable to either release or withdraw that javelin.\n\n\"Then, young men, the ministers and courtiers approached Kaṇha the sage and said: 'May there be welfare for the King, venerable sir; may there be welfare for the King.' 'There will be welfare for the King, but if the King releases the javelin downwards, then as far as the King's dominion extends, so far will the earth become flooded.' 'May there be welfare for the King, venerable sir, and welfare for the country!' 'There will be welfare for the King, and welfare for the country, but if the King releases the javelin upwards, then as far as the King's dominion extends, so far will the sky not rain for seven years.' 'May there be welfare for the King, venerable sir, welfare for the country, and may the sky rain!' 'There will be welfare for the King, welfare for the country, and the sky will rain, but let the King place the javelin on his eldest son, and the prince will be freed from the danger.'\n\n\"Then, young men, the ministers informed Okkāka: 'Let Okkāka place the javelin on his eldest son. The prince will be freed from the danger.' Then King Okkāka placed the javelin on his eldest son, and the prince was freed from the danger. Then King Okkāka, frightened, agitated, and with his hair standing on end, threatened by the divine punishment, gave his daughter Maddarūpī to him. Young men, do not greatly humiliate Ambaṭṭha the young man by calling him a slave's son, for that Kaṇha, the sage, was illustrious.\"",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේට මෙසේ සිතුණි – \"මේ මාණවකයෝ අම්බට්ඨ මාණවකයාට 'දාසි පුත්‍රයා' යන වචනයෙන් ඉතා තදින් දොස් පවරති. කුමක් නම් මා මොහුව මුදවා නොගන්නෙම් ද?\" ඉක්බිති භාග්‍යවතුන් වහන්සේ ඒ මාණවකයන්ට මෙය වදාළ සේක – \"මාණවකයෙනි, ඔබලා අම්බට්ඨ මාණවකයාට 'දාසි පුත්‍රයා' යන වචනයෙන් ඉතා තදින් දොස් නොපවරන්න. ඒ කණ්හ ඍෂිවරයා ශ්‍රේෂ්ඨ ඍෂිවරයෙක් විය. ඔහු දකුණු ජනපදයට ගොස් බ්‍රහ්ම මන්ත්‍රයන් ප්‍රගුණ කොට, ඔක්කාක රජු වෙත එළඹ මද්දරූපී නම් දියණිය ඉල්ලුවේය. ඔහුට ඔක්කාක රජු, 'අනේ, මේ කවුද මගේ දාසි පුත්‍රයෙක්ව සිටගෙන මද්දරූපී නම් දියණිය ඉල්ලන්නේ?' යැයි කෝප වී, අප්‍රසන්නව ඊතලයක් අල්ලා ගත්තේය. ඔහුට ඒ ඊතලය මුදවා හැරීමට හෝ ආපසු ගැනීමට හෝ නොහැකි විය.\n\n\"ඉක්බිති මානවකයෙනි, ඇමතිවරු සහ පිරිස් කණ්හ ඍෂිවරයා වෙත එළඹ මෙසේ කීහ – 'භද්‍රයන් වහන්ස, රජුට සෙතක් වේවා! භද්‍රයන් වහන්ස, රජුට සෙතක් වේවා!' යි. 'රජුට සෙතක් වන්නේය. එසේ වුවත්, රජු ඊතලය පහළට මුදා හරින්නේ නම්, රජුගේ විජිතය කොපමණ දුරක් ව්‍යාප්ත වී ඇත්ද, එපමණ දුරක් පොළොව ජලයෙන් යටවනු ඇත' යි. 'භද්‍රයන් වහන්ස, රජුට සෙතක් වේවා! ජනපදයටද සෙතක් වේවා!' යි. 'රජුට සෙතක් වන්නේය, ජනපදයටද සෙතක් වන්නේය. එසේ වුවත්, රජු ඊතලය ඉහළට මුදා හරින්නේ නම්, රජුගේ විජිතය කොපමණ දුරක් ව්‍යාප්ත වී ඇත්ද, එපමණ දුරක් වසර හතක් වැසි නොවැටෙනු ඇත' යි. 'භද්‍රයන් වහන්ස, රජුට සෙතක් වේවා, ජනපදයටද සෙතක් වේවා, වැසිද වසින්නේවා!' යි. 'රජුට සෙතක් වන්නේය, ජනපදයටද සෙතක් වන්නේය, වැසිද වසින්නේය. එසේ වුවත්, රජු ජ්‍යෙෂ්ඨ කුමාරයා මත ඊතලය තබන්නේවා, එවිට කුමාරයා සුරක්ෂිත වනු ඇත' යි. ඉක්බිති මානවකයෙනි, ඇමතිවරු ඔක්කාක රජුට දැන්වූහ – 'ඔක්කාක රජු ජ්‍යෙෂ්ඨ කුමාරයා මත ඊතලය තබන්නේවා. එවිට කුමාරයා සුරක්ෂිත වනු ඇත' යි. ඉක්බිති ඔක්කාක රජු ජ්‍යෙෂ්ඨ කුමාරයා මත ඊතලය තැබුවේය. එවිට කුමාරයා සුරක්ෂිත විය. ඉක්බිති ඔක්කාක රජු බියට පත්ව, තැතිගෙන, ලොමුදැහැගැන්වී, බ්‍රහ්ම දඬුවමෙන් තර්ජනයට ලක්වූයේ, ඔහුට මද්දරූපී නම් දියණිය පාවා දුන්නේය. \"මාණවකයෙනි, ඔබලා අම්බට්ඨ මාණවකයාට 'දාසි පුත්‍රයා' යන වචනයෙන් ඉතා තදින් දොස් නොපවරන්න. ඒ කණ්හ ඍෂිවරයා ශ්‍රේෂ්ඨ ඍෂිවරයෙක් විය\" යි.",
      "paliTitle": ""
    },
    {
      "number": 275,
      "pali": "Atha kho bhagavā ambaṭṭhaṃ māṇavaṃ āmantesi – ‘‘taṃ kiṃ maññasi, ambaṭṭha, idha khattiyakumāro brāhmaṇakaññāya saddhiṃ saṃvāsaṃ kappeyya, tesaṃ saṃvāsamanvāya putto jāyetha. Yo so khattiyakumārena brāhmaṇakaññāya putto uppanno, api nu so labhetha brāhmaṇesu āsanaṃ vā udakaṃ vā’’ti? ‘‘Labhetha, bho gotama’’. ‘‘Apinu naṃ brāhmaṇā bhojeyyuṃ saddhe vā thālipāke vā yaññe vā pāhune vā’’ti? ‘‘Bhojeyyuṃ, bho gotama’’. ‘‘Apinu naṃ brāhmaṇā mante vāceyyuṃ vā no vā’’ti? ‘‘Vāceyyuṃ, bho gotama’’. ‘‘Apinussa itthīsu āvaṭaṃ vā assa anāvaṭaṃ vā’’ti? ‘‘Anāvaṭaṃ hissa, bho gotama’’. ‘‘Apinu naṃ khattiyā khattiyābhisekena abhisiñceyyu’’nti? ‘‘No hidaṃ, bho gotama’’. ‘‘Taṃ kissa hetu’’? ‘‘Mātito hi, bho gotama, anupapanno’’ti. ‘‘Taṃ kiṃ maññasi, ambaṭṭha, idha brāhmaṇakumāro khattiyakaññāya saddhiṃ saṃvāsaṃ kappeyya, tesaṃ saṃvāsamanvāya putto jāyetha. Yo so brāhmaṇakumārena khattiyakaññāya putto uppanno, apinu so labhetha brāhmaṇesu āsanaṃ vā udakaṃ vā’’ti? ‘‘Labhetha, bho gotama’’. ‘‘Apinu naṃ brāhmaṇā bhojeyyuṃ saddhe vā thālipāke vā yaññe vā pāhune vā’’ti? ‘‘Bhojeyyuṃ, bho gotama’’. ‘‘Apinu naṃ brāhmaṇā mante vāceyyuṃ vā no vā’’ti? ‘‘Vāceyyuṃ, bho gotama’’. ‘‘Apinussa itthīsu āvaṭaṃ vā assa anāvaṭaṃ vā’’ti? ‘‘Anāvaṭaṃ hissa, bho gotama’’. ‘‘Apinu naṃ khattiyā khattiyābhisekena abhisiñceyyu’’nti? ‘‘No hidaṃ, bho gotama’’. ‘‘Taṃ kissa hetu’’? ‘‘Pitito hi, bho gotama, anupapanno’’ti.",
      "english": "Then the Blessed One addressed the young brahmin Ambaṭṭha: “What do you think, Ambaṭṭha? Suppose a khattiya prince were to live together with a brahmin maiden, and from their cohabitation a son were born. Would that son, born to a khattiya prince and a brahmin maiden, receive a seat or water among the brahmins?” “He would, good Gotama.” “Would brahmins feed him at a funeral rite, a feast, a sacrifice, or a reception?” “They would, good Gotama.” “Would brahmins teach him the mantras or not?” “They would, good Gotama.” “Would his access to women be restricted or unrestricted?” “It would be unrestricted, good Gotama.” “Would khattiyas anoint him with the anointment of a khattiya?” “No, good Gotama.” “For what reason?” “Because, good Gotama, he is not fully qualified from his mother’s side.” “What do you think, Ambaṭṭha? Suppose a brahmin prince were to live together with a khattiya maiden, and from their cohabitation a son were born. Would that son, born to a brahmin prince and a khattiya maiden, receive a seat or water among the brahmins?” “He would, good Gotama.” “Would brahmins feed him at a funeral rite, a feast, a sacrifice, or a reception?” “They would, good Gotama.” “Would brahmins teach him the mantras or not?” “They would, good Gotama.” “Would his access to women be restricted or unrestricted?” “It would be unrestricted, good Gotama.” “Would khattiyas anoint him with the anointment of a khattiya?” “No, good Gotama.” “For what reason?” “Because, good Gotama, he is not fully qualified from his father’s side.”",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ අම්බට්ඨ මානවකයා ඇමතූ සේක – “අම්බට්ඨය, නුඹ කුමක් සිතන්නෙහිද, මෙහි ක්‍ෂත්‍රිය කුමාරයෙක් බ්‍රාහ්මණ කන්‍යාවක් සමඟ සංවාසයෙහි යෙදේවා, ඔවුන්ගේ සංවාසය නිසා පුතෙක් උපදීවා. ක්‍ෂත්‍රිය කුමාරයාට සහ බ්‍රාහ්මණ කන්‍යාවට උපන් ඒ පුත්‍රයාට බ්‍රාහ්මණයන් අතර ආසනයක් හෝ පැන් හෝ ලැබේද?” “ලැබේවා, භවත් ගෞතමයින් වහන්ස.” “ඔහුට බ්‍රාහ්මණයෝ ශ්‍රාද්ධ භෝජනයකදී හෝ ථාලිපාක භෝජනයකදී හෝ යඥයකදී හෝ ආගන්තුක සත්කාරයකදී හෝ භෝජනය දෙද්ද?” “දෙද්දා, භවත් ගෞතමයින් වහන්ස.” “ඔහුට බ්‍රාහ්මණයෝ මන්ත්‍ර උගන්වද්ද නොහොත් නොඋගන්වද්ද?” “උගන්වද්දා, භවත් ගෞතමයින් වහන්ස.” “ඔහුට ස්ත්‍රීන් සම්බන්ධයෙන් අවහිරයක් වේද නැතහොත් අවහිරයක් නොවේද?” “ඔහුට අවහිරයක් නොවෙයි, භවත් ගෞතමයින් වහන්ස.” “ඔහුට ක්‍ෂත්‍රියයෝ ක්‍ෂත්‍රියාභිෂේකයෙන් අභිෂේක කරත්ද?” “නොකරත්, භවත් ගෞතමයින් වහන්ස.” “එයට හේතුව කුමක්ද?” “මව අතින් අනුපපන්න වේ, භවත් ගෞතමයින් වහන්ස.”\n\n“අම්බට්ඨය, නුඹ කුමක් සිතන්නෙහිද, මෙහි බ්‍රාහ්මණ කුමාරයෙක් ක්‍ෂත්‍රිය කන්‍යාවක් සමඟ සංවාසයෙහි යෙදේවා, ඔවුන්ගේ සංවාසය නිසා පුතෙක් උපදීවා. බ්‍රාහ්මණ කුමාරයාට සහ ක්‍ෂත්‍රිය කන්‍යාවට උපන් ඒ පුත්‍රයාට බ්‍රාහ්මණයන් අතර ආසනයක් හෝ පැන් හෝ ලැබේද?” “ලැබේවා, භවත් ගෞතමයින් වහන්ස.” “ඔහුට බ්‍රාහ්මණයෝ ශ්‍රාද්ධ භෝජනයකදී හෝ ථාලිපාක භෝජනයකදී හෝ යඥයකදී හෝ ආගන්තුක සත්කාරයකදී හෝ භෝජනය දෙද්ද?” “දෙද්දා, භවත් ගෞතමයින් වහන්ස.” “ඔහුට බ්‍රාහ්මණයෝ මන්ත්‍ර උගන්වද්ද නොහොත් නොඋගන්වද්ද?” “උගන්වද්දා, භවත් ගෞතමයින් වහන්ස.” “ඔහුට ස්ත්‍රීන් සම්බන්ධයෙන් අවහිරයක් වේද නැතහොත් අවහිරයක් නොවේද?” “ඔහුට අවහිරයක් නොවෙයි, භවත් ගෞතමයින් වහන්ස.” “ඔහුට ක්‍ෂත්‍රියයෝ ක්‍ෂත්‍රියාභිෂේකයෙන් අභිෂේක කරත්ද?” “නොකරත්, භවත් ගෞතමයින් වහන්ස.” “එයට හේතුව කුමක්ද?” “පියා අතින් අනුපපන්න වේ, භවත් ගෞතමයින් වහන්ස.”",
      "paliTitle": "Khattiyaseṭṭhabhāvo",
      "englishTitle": "Foremost Nobility",
      "sinhalaTitle": "ක්ෂත‍්‍රිය ශ‍්‍රේෂ්ඨ භාවය"
    },
    {
      "number": 276,
      "pali": "‘‘Iti kho, ambaṭṭha, itthiyā vā itthiṃ karitvā purisena vā purisaṃ karitvā khattiyāva seṭṭhā, hīnā brāhmaṇā. Taṃ kiṃ maññasi, ambaṭṭha, idha brāhmaṇā brāhmaṇaṃ kismiñcideva pakaraṇe khuramuṇḍaṃ karitvā bhassapuṭena vadhitvā raṭṭhā vā nagarā vā pabbājeyyuṃ. Apinu so labhetha brāhmaṇesu āsanaṃ vā udakaṃ vā’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Apinu naṃ brāhmaṇā bhojeyyuṃ saddhe vā thālipāke vā yaññe vā pāhune vā’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Apinu naṃ brāhmaṇā mante vāceyyuṃ vā no vā’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Apinussa itthīsu āvaṭaṃ vā assa anāvaṭaṃ vā’’ti? ‘‘Āvaṭaṃ hissa, bho gotama’’. ‘‘Taṃ kiṃ maññasi, ambaṭṭha, idha khattiyā khattiyaṃ kismiñcideva pakaraṇe khuramuṇḍaṃ karitvā bhassapuṭena vadhitvā raṭṭhā vā nagarā vā pabbājeyyuṃ. Apinu so labhetha brāhmaṇesu āsanaṃ vā udakaṃ vā’’ti? ‘‘Labhetha, bho gotama’’. ‘‘Apinu naṃ brāhmaṇā bhojeyyuṃ saddhe vā thālipāke vā yaññe vā pāhune vā’’ti? ‘‘Bhojeyyuṃ, bho gotama’’. ‘‘Apinu naṃ brāhmaṇā mante vāceyyuṃ vā no vā’’ti? ‘‘Vāceyyuṃ, bho gotama’’. ‘‘Apinussa itthīsu āvaṭaṃ vā assa anāvaṭaṃ vā’’ti? ‘‘Anāvaṭaṃ hissa, bho gotama’’.",
      "english": "Thus, Ambaṭṭha, whether one considers women among women or men among men, the Khattiyas are indeed pre-eminent, and the Brahmins are base. What do you think, Ambaṭṭha? Suppose here Brahmins were, for some reason, to shave a Brahmin’s head, beat him with a bag of ashes, and expel him from the country or the town. Would he then obtain a seat or water among Brahmins? Certainly not, Venerable Gotama. Would Brahmins then feed him at a funeral feast, a festive meal, a sacrifice, or a guest offering? Certainly not, Venerable Gotama. Would Brahmins then teach him sacred verses, or not? Certainly not, Venerable Gotama. Would access to women be closed to him, or open? It would certainly be closed to him, Venerable Gotama. What do you think, Ambaṭṭha? Suppose here Khattiyas were, for some reason, to shave a Khattiya’s head, beat him with a bag of ashes, and expel him from the country or the town. Would he then obtain a seat or water among Brahmins? He would obtain it, Venerable Gotama. Would Brahmins then feed him at a funeral feast, a festive meal, a sacrifice, or a guest offering? They would feed him, Venerable Gotama. Would Brahmins then teach him sacred verses, or not? They would teach him, Venerable Gotama. Would access to women be closed to him, or open? It would certainly be open to him, Venerable Gotama.",
      "sinhala": "අම්බට්ඨය, ඉතින් ස්ත්‍රියක ස්ත්‍රියකට සාපේක්ෂව, පුරුෂයෙකු පුරුෂයෙකුට සාපේක්ෂව ගත්තොත්, ක්ෂත්‍රියයෝම ශ්‍රේෂ්ඨයෝය, බ්‍රාහ්මණයෝ පහත්ය. අම්බට්ඨය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මෙලොව බ්‍රාහ්මණයෝ බ්‍රාහ්මණයෙකු කිසියම් කරුණක් සම්බන්ධයෙන් රැවුල් මුඩු කොට, අළු පුරවන ලද මල්ලකින් පහර දී, රටෙන් හෝ නුවරින් නෙරපා හරින්නට පුළුවන. ඔහුට බ්‍රාහ්මණයන් අතර ආසනයක් හෝ පැන් හෝ ලැබේද? නැත, භවත් ගෞතමය. බ්‍රාහ්මණයෝ ඔහුට ශ්‍රද්ධා භෝජනයකදී හෝ, ථාලිපාකයකදී හෝ, යඥයකදී හෝ, ආගන්තුක සත්කාරයකදී හෝ භෝජනය දෙන්නට පුළුවනද? නැත, භවත් ගෞතමය. බ්‍රාහ්මණයෝ ඔහුට මන්ත්‍ර කීමට ඉඩ දෙත්ද නැද්ද? නැත, භවත් ගෞතමය. ඔහුට ස්ත්‍රීන් හා සම්බන්ධ වීම සීමා වන්නේද නැද්ද? ඔහුට සීමා වන්නේමය, භවත් ගෞතමය. අම්බට්ඨය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මෙලොව ක්ෂත්‍රියයෝ ක්ෂත්‍රියයෙකු කිසියම් කරුණක් සම්බන්ධයෙන් රැවුල් මුඩු කොට, අළු පුරවන ලද මල්ලකින් පහර දී, රටෙන් හෝ නුවරින් නෙරපා හරින්නට පුළුවන. ඔහුට බ්‍රාහ්මණයන් අතර ආසනයක් හෝ පැන් හෝ ලැබේද? ලැබේ, භවත් ගෞතමය. බ්‍රාහ්මණයෝ ඔහුට ශ්‍රද්ධා භෝජනයකදී හෝ, ථාලිපාකයකදී හෝ, යඥයකදී හෝ, ආගන්තුක සත්කාරයකදී හෝ භෝජනය දෙන්නට පුළුවනද? දෙන්නට පුළුවන, භවත් ගෞතමය. බ්‍රාහ්මණයෝ ඔහුට මන්ත්‍ර කීමට ඉඩ දෙත්ද නැද්ද? ඉඩ දෙත්, භවත් ගෞතමය. ඔහුට ස්ත්‍රීන් හා සම්බන්ධ වීම සීමා වන්නේද නැද්ද? ඔහුට සීමා නොවන්නේමය, භවත් ගෞතමය.",
      "paliTitle": ""
    },
    {
      "number": 277,
      "pali": "‘‘Ettāvatā kho, ambaṭṭha, khattiyo paramanihīnataṃ patto hoti, yadeva naṃ khattiyā khuramuṇḍaṃ karitvā bhassapuṭena vadhitvā raṭṭhā vā nagarā vā pabbājenti. Iti kho, ambaṭṭha, yadā khattiyo paramanihīnataṃ patto hoti, tadāpi khattiyāva seṭṭhā, hīnā brāhmaṇā. Brahmunā pesā, ambaṭṭha [brahmunāpi ambaṭṭha (ka.), brahmunāpi eso ambaṭṭha (pī.)], sanaṅkumārena gāthā bhāsitā – ‘Khattiyo seṭṭho janetasmiṃ, Ye gottapaṭisārino; Vijjācaraṇasampanno, So seṭṭho devamānuse’ti. ‘‘Sā kho panesā, ambaṭṭha, brahmunā sanaṅkumārena gāthā sugītā no duggītā, subhāsitā no dubbhāsitā, atthasaṃhitā no anatthasaṃhitā, anumatā mayā. Ahampi hi, ambaṭṭha, evaṃ vadāmi – ‘Khattiyo seṭṭho janetasmiṃ, Ye gottapaṭisārino; Vijjācaraṇasampanno, So seṭṭho devamānuse’ti. Bhāṇavāro paṭhamo.",
      "english": "This is how, Ambaṭṭha, a noble reaches the ultimate degradation: when other nobles shave his head, beat him with a dust-basket, and banish him from country or town. So then, Ambaṭṭha, even when a noble reaches the ultimate degradation, nobles are still superior, and brahmins are inferior. This verse, Ambaṭṭha, was spoken by Brahmā Sanaṅkumāra: ‘The noble is the best among folk who value lineage; but one perfect in knowledge and conduct is the best among gods and humans.’\n\nThat verse, Ambaṭṭha, by Brahmā Sanaṅkumāra, is well-sung, not ill-sung; well-spoken, not ill-spoken; connected with benefit, not disconnected from benefit; and it is approved by me. For I too, Ambaṭṭha, say this: ‘The noble is the best among folk who value lineage; but one perfect in knowledge and conduct is the best among gods and humans.’",
      "sinhala": "අම්බට්ඨය, ක්‍ෂත‍්‍රියයෝ යම් විටෙක යම් ක්‍ෂත‍්‍රියයකු රැවුල් බූ ගා, අළු මල්ලකින් පහරදී, රටින් හෝ නගරයෙන් හෝ නෙරපා හරිත්ද, එබඳු අවස්ථාවක ක්‍ෂත‍්‍රියයා පරම පහත්භාවයට පත්වේ. අම්බට්ඨය, මෙසේ යම් කලක ක්‍ෂත‍්‍රියයා පරම පහත්භාවයට පත්ව සිටීද, එදාටත් ක්‍ෂත‍්‍රියයෝම උසස්ය, බ‍්‍රාහ්මණයෝ පහත්ය.\n\nඅම්බට්ඨය, සනංකුමාර බ‍්‍රහ්මයා විසින් මේ ගාථාව දේශනා කරන ලදී:\nගෝත්‍රය අනුව යන මේ ජනයා අතර ක්‍ෂත‍්‍රියයා උසස්ය.\nවිද්‍යාචරණ සම්පන්න වූ තැනැත්තා දෙවි මිනිසුන් අතර උසස්ය.\nඅම්බට්ඨය, සනංකුමාර බ‍්‍රහ්මයා විසින් දේශනා කරන ලද මේ ගාථාව මැනවින් ගයන ලද්දකි, නොමනා ලෙස ගයන ලද්දක් නොවේ; මැනවින් දේශනා කරන ලද්දකි, නොමනා ලෙස දේශනා කරන ලද්දක් නොවේ; අර්ථයෙන් යුක්තය, අනර්ථයෙන් යුක්ත නොවේ. එය මා විසින් අනුමත කරන ලදී. අම්බට්ඨය, මමත් මෙසේ කියමි:\nගෝත්‍රය අනුව යන මේ ජනයා අතර ක්‍ෂත‍්‍රියයා උසස්ය.\nවිද්‍යාචරණ සම්පන්න වූ තැනැත්තා දෙවි මිනිසුන් අතර උසස්ය.\n\nභාණවාරය පළමුවැන්නයි.",
      "paliTitle": ""
    },
    {
      "number": 278,
      "pali": "‘‘Katamaṃ pana taṃ, bho gotama, caraṇaṃ, katamā ca pana sā vijjā’’ti? ‘‘Na kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya jātivādo vā vuccati, gottavādo vā vuccati, mānavādo vā vuccati – ‘arahasi vā maṃ tvaṃ, na vā maṃ tvaṃ arahasī’ti. Yattha kho, ambaṭṭha, āvāho vā hoti, vivāho vā hoti, āvāhavivāho vā hoti, etthetaṃ vuccati jātivādo vā itipi gottavādo vā itipi mānavādo vā itipi – ‘arahasi vā maṃ tvaṃ, na vā maṃ tvaṃ arahasī’ti. Ye hi keci ambaṭṭha jātivādavinibaddhā vā gottavādavinibaddhā vā mānavādavinibaddhā vā āvāhavivāhavinibaddhā vā, ārakā te anuttarāya vijjācaraṇasampadāya. Pahāya kho, ambaṭṭha, jātivādavinibaddhañca gottavādavinibaddhañca mānavādavinibaddhañca āvāhavivāhavinibaddhañca anuttarāya vijjācaraṇasampadāya sacchikiriyā hotī’’ti.",
      "english": "\"But what, good Gotama, is that conduct, and what is that knowledge?\"\n\n\"Indeed, Ambaṭṭha, concerning the unsurpassed perfection of knowledge and conduct, it is not a matter of 'birth-talk,' 'lineage-talk,' or 'pride-talk'—saying 'You are worthy of me,' or 'You are not worthy of me.'\n\nIt is, Ambaṭṭha, where there is a giving of a daughter in marriage, or a taking of a bride, or both giving and taking in marriage, that such 'birth-talk,' 'lineage-talk,' or 'pride-talk' is used, saying 'You are worthy of me,' or 'You are not worthy of me.'\n\nWhoever, Ambaṭṭha, is bound by talk of birth, or bound by talk of lineage, or bound by talk of pride, or bound by marriage arrangements, such people are far from the unsurpassed perfection of knowledge and conduct.\n\nBut having abandoned, Ambaṭṭha, that which binds one to talk of birth, that which binds one to talk of lineage, that which binds one to talk of pride, and that which binds one to marriage arrangements—then the realization of the unsurpassed perfection of knowledge and conduct takes place.\"",
      "sinhala": "\"එම්බා ගෞතමයින් වහන්ස, ඒ චරණය කුමක්ද? ඒ විද්‍යාව කුමක්ද?\"\n\nඅම්බට්ඨය, අනුත්තර විද්‍යාචරණසම්පත්තිය සම්බන්ධයෙන් ජාතිවාදයක් හෝ ගෝත්‍රවාදයක් හෝ මානවාදයක් හෝ – ‘නුඹ මට සුදුසුය, නැතහොත් නුඹ මට සුදුසු නැත’ යනුවෙන් – නොකියවෙයි. අම්බට්ඨය, යම් තැනක මංගල්‍යයක් හෝ විවාහයක් හෝ මංගල්‍යය සහ විවාහය යන දෙකම හෝ වේ ද, එතැනදී ජාතිවාදයක් හෝ ගෝත්‍රවාදයක් හෝ මානවාදයක් හෝ – ‘නුඹ මට සුදුසුය, නැතහොත් නුඹ මට සුදුසු නැත’ යනුවෙන් – කියවෙයි. අම්බට්ඨය, යම් කිසිවෙක් ජාතිවාදයෙන් බැඳී සිටින්නේ ද, ගෝත්‍රවාදයෙන් බැඳී සිටින්නේ ද, මානවාදයෙන් බැඳී සිටින්නේ ද, මංගල්‍යය සහ විවාහ කටයුතුවලින් බැඳී සිටින්නේ ද, ඔවුහු අනුත්තර විද්‍යාචරණසම්පත්තියෙන් බොහෝ ඈත සිටිති. නමුත් අම්බට්ඨය, ජාතිවාදයෙන් බැඳීම ද, ගෝත්‍රවාදයෙන් බැඳීම ද, මානවාදයෙන් බැඳීම ද, මංගල්‍යය සහ විවාහ කටයුතුවලින් බැඳීම ද අත්හැරීමෙන් අනුත්තර විද්‍යාචරණසම්පත්තිය සාක්ෂාත් කිරීම සිදුවෙයි.",
      "paliTitle": "Vijjācaraṇakathā",
      "englishTitle": "Discourse on Knowledge and Conduct",
      "sinhalaTitle": "විද්‍යාචරණ කථාව"
    },
    {
      "number": 279,
      "pali": "‘‘Katamaṃ pana taṃ, bho gotama, caraṇaṃ, katamā ca sā vijjā’’ti? ‘‘Idha, ambaṭṭha, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Taṃ dhammaṃ suṇāti gahapati vā gahapatiputto vā aññatarasmiṃ vā kule paccājāto. So taṃ dhammaṃ sutvā tathāgate saddhaṃ paṭilabhati. So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati…pe… (yathā 191 ādayo anucchedā, evaṃ vitthāretabbaṃ).… ‘‘So vivicceva kāmehi, vivicca akusalehi dhammehi, savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati…pe… idampissa hoti caraṇasmiṃ. ‘‘Puna caparaṃ, ambaṭṭha, bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati…pe… idampissa hoti caraṇasmiṃ. ‘‘Puna caparaṃ, ambaṭṭha, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘‘upekkhako satimā sukhavihārī’ti, tatiyaṃ jhānaṃ upasampajja viharati…pe… idampissa hoti caraṇasmiṃ. ‘‘Puna caparaṃ, ambaṭṭha, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati…pe… idampissa hoti caraṇasmiṃ. Idaṃ kho taṃ, ambaṭṭha, caraṇaṃ. ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti…pe… idampissa hoti vijjāya…pe… nāparaṃ itthattāyāti pajānāti, idampissa hoti vijjāya. Ayaṃ kho sā, ambaṭṭha, vijjā. ‘‘Ayaṃ vuccati, ambaṭṭha, bhikkhu ‘vijjāsampanno’ itipi, ‘caraṇasampanno’ itipi, ‘vijjācaraṇasampanno’ itipi. Imāya ca ambaṭṭha vijjāsampadāya caraṇasampadāya ca aññā vijjāsampadā ca caraṇasampadā ca uttaritarā vā paṇītatarā vā natthi. ",
      "english": "“But what, good Gotama, is that conduct, and what is that knowledge?”\n\n“Here, Ambaṭṭha, a Tathāgata arises in the world, an Arahant, a Fully Self-Enlightened One, endowed with knowledge and conduct, a Fortunate One, knower of the world, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One. He, having directly known and realized this world with its gods, its Māras, its Brahmās, with its population of recluses and brahmins, and of gods and humans, proclaims it. He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end; with both meaning and phrasing, he reveals the entirely complete and utterly pure holy life. A householder hears that Dhamma, or a householder's son, or someone born into another family. Having heard that Dhamma, he gains faith in the Tathāgata. Possessed of that acquired faith, he reflects thus: ...\n\n“Having secluded himself from sensual pleasures and secluded himself from unwholesome states, he enters and remains in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and happiness. ... This is part of his conduct.\n\n“Furthermore, Ambaṭṭha, with the fading away of initial application and sustained application, through the internal tranquility and unification of the mind, he enters and remains in the second jhāna, which is without initial application and sustained application, born of concentration, and filled with rapture and happiness. ... This is part of his conduct.\n\n“Furthermore, Ambaṭṭha, with the fading away of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body, concerning which the noble ones declare: 'He dwells happily with equanimity and mindfulness.' He enters and remains in the third jhāna. ... This is part of his conduct.\n\n“Furthermore, Ambaṭṭha, with the abandoning of pleasure and pain, and with the prior passing away of joy and sorrow, he enters and remains in the fourth jhāna, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. ... This is part of his conduct. This, Ambaṭṭha, is that conduct.\n\n“With his mind thus concentrated, purified, cleansed, unblemished, rid of defilements, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines it to the knowledge and vision. ... This is part of his knowledge. ... He understands: 'There is no further state of being for this world.' This is part of his knowledge. This, Ambaṭṭha, is that knowledge.\n\n“This, Ambaṭṭha, is called a monk 'endowed with knowledge,' and 'endowed with conduct,' and 'endowed with knowledge and conduct.' And, Ambaṭṭha, there is no other endowment of knowledge and conduct, or any other knowledge and conduct, that is superior or more excellent than this endowment of knowledge and conduct.",
      "sinhala": "ගෞතමයින් වහන්ස, ඒ චරණය කවරේද, ඒ විද්‍යාව කවරේද?\n\nඅම්බට්ඨය, මෙහි තථාගතයන් වහන්සේ ලොව පහළ වෙති. අරහත්, සම්මා සම්බුද්ධ, විජ්ජාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තර, පුරිසදම්මසාරථී, සත්ථා දේවමනුස්සානං, බුද්ධ, භාග්‍යවත් යන ගුණාංගයන්ගෙන් යුක්තව. උන්වහන්සේ දෙවියන් සහිත, මරුන් සහිත, බ්‍රහ්මයන් සහිත වූ, ශ්‍රමණයින් හා බ්‍රාහ්මණයින් සහිත වූ, දෙව් මිනිසුන් සහිත වූ මේ ලෝකය තමන් විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන ප්‍ර‌කාශ කරති. උන්වහන්සේ මුල, මැද, අග යන තැන්හි කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, සියල්ලෙන් සම්පූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව එනම් ධර්මය දේශනා කරති, ප්‍ර‌කාශ කරති. ගෘහපතියෙක් හෝ ගෘහපති පුත්‍රයෙක් හෝ වෙනත් කුලයක උපන් අයෙක් හෝ ඒ ධර්මය ශ්‍රවණය කරයි. ඔහු ඒ ධර්මය අසා තථාගතයන් වහන්සේ කෙරෙහි ශ්‍රද්ධාව ලබයි. ඔහු ඒ ශ්‍රද්ධා ලාභයෙන් යුක්තව මෙසේ සිතයි...\n\n...ඔහු කාමයන්ගෙන් වෙන්වම, අකුශල ධර්මයන්ගෙන් වෙන්වම, විතර්ක සහිත වූ, විචාර සහිත වූ, විවේකයෙන් හටගත් ප්‍රීති සුඛය සහිත වූ පළමු ධ්‍යානයට පැමිණ වාසය කරයි... මෙයද ඔහුගේ චරණයට අයත් වේ.\n\nනැවතත් අම්බට්ඨය, භික්ෂුව විතර්ක විචාරයන් සංසිඳවීමෙන්, සිතේ ඇතුළත පැහැදීමෙන්, චිත්ත ඒකාග්‍රතාවයෙන්, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සුඛය සහිත වූ දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි... මෙයද ඔහුගේ චරණයට අයත් වේ.\n\nනැවතත් අම්බට්ඨය, භික්ෂුව ප්‍රීතිය කෙරෙහිද විරාගී වීමෙන්, උපේක්ෂාවෙන් යුතුව වාසය කරයි, සිහි කල්පනාවෙන් යුක්තව සිටියි, ශරීරයෙන්ද සැප විඳියි, යමක් ආර්යයෝ 'උපේක්ෂාවෙන් යුක්ත, සිහි කල්පනාවෙන් යුක්ත, සුවසේ වාසය කරන තැනැත්තා' යැයි හඳුන්වද්ද, ඒ තුන්වෙනි ධ්‍යානයට පැමිණ වාසය කරයි... මෙයද ඔහුගේ චරණයට අයත් වේ.\n\nනැවතත් අම්බට්ඨය, භික්ෂුව සැපයද දුකයද ප්‍ර‌හාණය කිරීමෙන්, පෙර පැවති සෝමනස්ස දෝමනස්සයන්ගේ අස්තංගමණය හේතුවෙන්, දුක් රහිත වූද සැප රහිත වූද උපේක්ෂා සති පාරිශුද්ධියෙන් යුක්ත සිව්වෙනි ධ්‍යානයට පැමිණ වාසය කරයි... මෙයද ඔහුගේ චරණයට අයත් වේ. අම්බට්ඨය, මේ ද චරණයයි.\n\nඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, අවබෝධයෙන් බබළන, කෙලෙස් රහිත වූ, උපක්ලේශයන් දුරු වූ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථාවර වූ, නොසැලෙන සුලු වූ සිත නුවණින් දැකීම පිණිස යොමු කරයි... මෙයද ඔහුගේ විද්‍යාවට අයත් වේ... 'නැවත මේ තත්ත්වයට නොපැමිණේ' යැයි දනී, මෙයද ඔහුගේ විද්‍යාවට අයත් වේ. අම්බට්ඨය, මේ ද විද්‍යාවයි.\n\nඅම්බට්ඨය, මේ භික්ෂුව 'විද්‍යා සම්පන්න' යයිද, 'චරණ සම්පන්න' යයිද, 'විද්‍යාචරණ සම්පන්න' යයිද කියනු ලැබේ. අම්බට්ඨය, මේ විද්‍යා සම්පදාවට හා චරණ සම්පදාවට වඩා උසස් වූ හෝ ප්‍ර‌ණීත වූ හෝ වෙනත් විද්‍යා සම්පදාවක් හෝ චරණ සම්පදාවක් හෝ නැත.",
      "paliTitle": ""
    },
    {
      "number": 280,
      "pali": "‘‘Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya cattāri apāyamukhāni bhavanti. Katamāni cattāri? Idha, ambaṭṭha, ekacco samaṇo vā brāhmaṇo vā imaññeva anuttaraṃ vijjācaraṇasampadaṃ anabhisambhuṇamāno khārividhamādāya [khārivividhamādāya (sī. syā. pī.)] araññāyatanaṃ ajjhogāhati – ‘pavattaphalabhojano bhavissāmī’ti. So aññadatthu vijjācaraṇasampannasseva paricārako sampajjati. Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya idaṃ paṭhamaṃ apāyamukhaṃ bhavati. ‘‘Puna caparaṃ, ambaṭṭha, idhekacco samaṇo vā brāhmaṇo vā imañceva anuttaraṃ vijjācaraṇasampadaṃ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kudālapiṭakaṃ [kuddālapiṭakaṃ (sī. syā. pī.)] ādāya araññavanaṃ ajjhogāhati – ‘kandamūlaphalabhojano bhavissāmī’ti. So aññadatthu vijjācaraṇasampannasseva paricārako sampajjati. Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya idaṃ dutiyaṃ apāyamukhaṃ bhavati. ‘‘Puna caparaṃ, ambaṭṭha, idhekacco samaṇo vā brāhmaṇo vā imañceva anuttaraṃ vijjācaraṇasampadaṃ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kandamūlaphalabhojanatañca anabhisambhuṇamāno gāmasāmantaṃ vā nigamasāmantaṃ vā agyāgāraṃ karitvā aggiṃ paricaranto acchati. So aññadatthu vijjācaraṇasampannasseva paricārako sampajjati. Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya idaṃ tatiyaṃ apāyamukhaṃ bhavati. ‘‘Puna caparaṃ, ambaṭṭha, idhekacco samaṇo vā brāhmaṇo vā imaṃ ceva anuttaraṃ vijjācaraṇasampadaṃ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kandamūlaphalabhojanatañca anabhisambhuṇamāno aggipāricariyañca anabhisambhuṇamāno cātumahāpathe catudvāraṃ agāraṃ karitvā acchati – ‘yo imāhi catūhi disāhi āgamissati samaṇo vā brāhmaṇo vā, tamahaṃ yathāsatti yathābalaṃ paṭipūjessāmī’ti. So aññadatthu vijjācaraṇasampannasseva paricārako sampajjati. Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya idaṃ catutthaṃ apāyamukhaṃ bhavati. Imāya kho, ambaṭṭha, anuttarāya vijjācaraṇasampadāya imāni cattāri apāyamukhāni bhavanti.",
      "english": "Indeed, Ambaṭṭha, there are four paths to ruin in relation to this unsurpassable accomplishment in knowledge and conduct. Which are these four? Here, Ambaṭṭha, some ascetic or brahmin, unable to achieve this very unsurpassable accomplishment in knowledge and conduct, takes up a carrying pole and enters a forest dwelling, thinking: ‘I will live on fallen fruits.’ He becomes nothing but a servant of one who has accomplished knowledge and conduct. Indeed, Ambaṭṭha, this is the first path to ruin in relation to this unsurpassable accomplishment in knowledge and conduct.\n\nFurthermore, Ambaṭṭha, here some ascetic or brahmin, unable to achieve this very unsurpassable accomplishment in knowledge and conduct, and also unable to live on fallen fruits, takes up a spade and a basket and enters a forest grove, thinking: ‘I will live on roots, tubers, and fruits.’ He becomes nothing but a servant of one who has accomplished knowledge and conduct. Indeed, Ambaṭṭha, this is the second path to ruin in relation to this unsurpassable accomplishment in knowledge and conduct.\n\nFurthermore, Ambaṭṭha, here some ascetic or brahmin, unable to achieve this very unsurpassable accomplishment in knowledge and conduct, and also unable to live on fallen fruits, and unable to live on roots, tubers, and fruits, makes a fire-house near a village or market town and attends to the fire. He becomes nothing but a servant of one who has accomplished knowledge and conduct. Indeed, Ambaṭṭha, this is the third path to ruin in relation to this unsurpassable accomplishment in knowledge and conduct.\n\nFurthermore, Ambaṭṭha, here some ascetic or brahmin, unable to achieve this very unsurpassable accomplishment in knowledge and conduct, and also unable to live on fallen fruits, and unable to live on roots, tubers, and fruits, and unable to attend to the fire, makes a four-doored house at a crossroads and lives there, thinking: ‘Whatever ascetic or brahmin comes from these four directions, him I will honor to the best of my ability and strength.’ He becomes nothing but a servant of one who has accomplished knowledge and conduct. Indeed, Ambaṭṭha, this is the fourth path to ruin in relation to this unsurpassable accomplishment in knowledge and conduct. Indeed, Ambaṭṭha, these are the four paths to ruin in relation to this unsurpassable accomplishment in knowledge and conduct.",
      "sinhala": "අම්බට්ඨය, මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට අපාය මුඛ සතරක් වෙති. ඒ සතර කුමනවාද? අම්බට්ඨය, මෙහි ඇතැම් ශ්‍රමණ‍යෙක් හෝ බ්‍රාහ්මණ‍යෙක් මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට පැමිණීමට නොහැකිව, ආහාර පිණිස භාණ්ඩ රැගෙන අරණ්‍යයට පිවිසෙන්නේ ‘මම හැලුණු ඵල ආහාර කොට වෙසෙන්නෙමි’යි සිතාය. හෙතෙම අන් කිසිවක් නොව, විජ්ජාචරණ සම්පත්තියෙන් යුක්ත වූවන්ටම උපස්ථායකයෙක් වන්නේය. අම්බට්ඨය, මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට මෙය පළමු අපාය මුඛය වෙයි.\n\nනැවතත් අම්බට්ඨය, මෙහි ඇතැම් ශ්‍රමණ‍යෙක් හෝ බ්‍රාහ්මණ‍යෙක් මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට පැමිණීමට නොහැකිව, හැලුණු ඵල ආහාර කිරීමෙන්ද සෑහීමකට පත් නොවී, උදැල්ලක් සහ කූඩයක් රැගෙන වන ලැහැබකට පිවිසෙන්නේ ‘මම අල, මුල් සහ ඵල ආහාර කොට වෙසෙන්නෙමි’යි සිතාය. හෙතෙම අන් කිසිවක් නොව, විජ්ජාචරණ සම්පත්තියෙන් යුක්ත වූවන්ටම උපස්ථායකයෙක් වන්නේය. අම්බට්ඨය, මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට මෙය දෙවන අපාය මුඛය වෙයි.\n\nනැවතත් අම්බට්ඨය, මෙහි ඇතැම් ශ්‍රමණ‍යෙක් හෝ බ්‍රාහ්මණ‍යෙක් මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට පැමිණීමට නොහැකිව, හැලුණු ඵල ආහාර කිරීමෙන්ද සෑහීමකට පත් නොවී, අල, මුල් සහ ඵල ආහාර කිරීමෙන්ද සෑහීමකට පත් නොවී, ගමක් අසල හෝ නියම්ගමක් අසල ගිනිහලක් සාදාගෙන ගින්නට උපස්ථාන කරමින් වාසය කරයි. හෙතෙම අන් කිසිවක් නොව, විජ්ජාචරණ සම්පත්තියෙන් යුක්ත වූවන්ටම උපස්ථායකයෙක් වන්නේය. අම්බට්ඨය, මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට මෙය තුන්වන අපාය මුඛය වෙයි.\n\nනැවතත් අම්බට්ඨය, මෙහි ඇතැම් ශ්‍රමණ‍යෙක් හෝ බ්‍රාහ්මණ‍යෙක් මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට පැමිණීමට නොහැකිව, හැලුණු ඵල ආහාර කිරීමෙන්ද සෑහීමකට පත් නොවී, අල, මුල් සහ ඵල ආහාර කිරීමෙන්ද සෑහීමකට පත් නොවී, ගින්නට උපස්ථාන කිරීමෙන්ද සෑහීමකට පත් නොවී, සිව්මංසන්ධියක සිව්දොර ගෙයක් සාදාගෙන වාසය කරන්නේ ‘මේ සිව් දිශාවෙන් යම් ශ්‍රමණ‍යෙක් හෝ බ්‍රාහ්මණ‍යෙක් එන්නේද, මම ඔහුට ශක්ති පමණින්, හැකි පමණින් සත්කාර කරන්නෙමි’යි සිතාය. හෙතෙම අන් කිසිවක් නොව, විජ්ජාචරණ සම්පත්තියෙන් යුක්ත වූවන්ටම උපස්ථායකයෙක් වන්නේය. අම්බට්ඨය, මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට මෙය සතරවන අපාය මුඛය වෙයි. අම්බට්ඨය, මේ අනුත්තර වූ විජ්ජාචරණ සම්පත්තියට මේ අපාය මුඛ සතර වෙති.",
      "paliTitle": "Catuapāyamukhaṃ",
      "englishTitle": "Four Gateways to Downfall",
      "sinhalaTitle": "සතර අපායමුඛ"
    },
    {
      "number": 281,
      "pali": "‘‘Taṃ kiṃ maññasi, ambaṭṭha, apinu tvaṃ imāya anuttarāya vijjācaraṇasampadāya sandissasi sācariyako’’ti? ‘‘No hidaṃ, bho gotama’’. ‘Kocāhaṃ, bho gotama, sācariyako, kā ca anuttarā vijjācaraṇasampadā? Ārakāhaṃ, bho gotama, anuttarāya vijjācaraṇasampadāya sācariyako’’ti. ‘‘Taṃ kiṃ maññasi, ambaṭṭha, apinu tvaṃ imañceva anuttaraṃ vijjācaraṇasampadaṃ anabhisambhuṇamāno khārividhamādāya araññavanamajjhogāhasi sācariyako – ‘pavattaphalabhojano bhavissāmī’’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Taṃ kiṃ maññasi, ambaṭṭha, apinu tvaṃ imañceva anuttaraṃ vijjācaraṇasampadaṃ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kudālapiṭakaṃ ādāya araññavanamajjhogāhasi sācariyako – ‘kandamūlaphalabhojano bhavissāmī’’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Taṃ kiṃ maññasi, ambaṭṭha, apinu tvaṃ imañceva anuttaraṃ vijjācaraṇasampadaṃ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kandamūlaphalabhojanatañca anabhisambhuṇamāno gāmasāmantaṃ vā nigamasāmantaṃ vā agyāgāraṃ karitvā aggiṃ paricaranto acchasi sācariyako’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Taṃ kiṃ maññasi, ambaṭṭha, apinu tvaṃ imañceva anuttaraṃ vijjācaraṇasampadaṃ anabhisambhuṇamāno pavattaphalabhojanatañca anabhisambhuṇamāno kandamūlaphalabhojanatañca anabhisambhuṇamāno aggipāricariyañca anabhisambhuṇamāno cātumahāpathe catudvāraṃ agāraṃ karitvā acchasi sācariyako – ‘yo imāhi catūhi disāhi āgamissati samaṇo vā brāhmaṇo vā, taṃ mayaṃ yathāsatti yathābalaṃ paṭipūjessāmā’’’ti? ‘‘No hidaṃ, bho gotama’’.",
      "english": "“What do you think, Ambaṭṭha, do you and your teacher partake in this unsurpassed perfection of knowledge and conduct?” “Certainly not, Reverend Gotama. Who are my teacher and I, Reverend Gotama, and what is this unsurpassed perfection of knowledge and conduct? My teacher and I, Reverend Gotama, are far from that unsurpassed perfection of knowledge and conduct.” “What do you think, Ambaṭṭha, do you and your teacher, without achieving this unsurpassed perfection of knowledge and conduct, take up the requisites of a wanderer and go into the midst of the forest and woods, thinking, ‘We shall consume fallen fruits’?” “Certainly not, Reverend Gotama.” “What do you think, Ambaṭṭha, do you and your teacher, without achieving this unsurpassed perfection of knowledge and conduct, and without achieving the practice of consuming fallen fruits, take a spade and a basket and go into the midst of the forest and woods, thinking, ‘We shall consume roots, tubers, and fruits’?” “Certainly not, Reverend Gotama.” “What do you think, Ambaṭṭha, do you and your teacher, without achieving this unsurpassed perfection of knowledge and conduct, and without achieving the practice of consuming fallen fruits, and without achieving the practice of consuming roots, tubers, and fruits, make a fire-hut near a village or a market-town, and stay there attending to the fire?” “Certainly not, Reverend Gotama.” “What do you think, Ambaṭṭha, do you and your teacher, without achieving this unsurpassed perfection of knowledge and conduct, and without achieving the practice of consuming fallen fruits, and without achieving the practice of consuming roots, tubers, and fruits, and without achieving fire-worship, make a four-doored guesthouse at a crossroads and stay there, thinking, ‘Whosoever, be they ascetic or brahmin, will come from these four directions, we shall honor them according to our power and ability’?” “Certainly not, Reverend Gotama.”",
      "sinhala": "අම්බට්ඨය, ඔබ කුමක් සිතන්නෙහිද? ඔබ ඔබේ ආචාර්යවරයා සමඟ මේ අනුත්තර විජ්ජාචරණ සම්පත්තියෙන් යුක්ත වන්නේද?\n\nභවත් ගෞතමයින් වහන්ස, එසේ නොවේ.\n\nභවත් ගෞතමයින් වහන්ස, මම කවරෙක්ද, මගේ ආචාර්යවරයා කවරෙක්ද? අනුත්තර විජ්ජාචරණ සම්පත්තිය කවරේද? භවත් ගෞතමයින් වහන්ස, අනුත්තර විජ්ජාචරණ සම්පත්තියෙන් මමත්, මගේ ආචාර්යවරයාත් බොහෝ ඈතින් පිහිටියාහු වෙමු.\n\nඅම්බට්ඨය, ඔබ කුමක් සිතන්නෙහිද? ඔබ මේ අනුත්තර විජ්ජාචරණ සම්පත්තිය අවබෝධ කර නොගෙන, 'ඉබේ වැටුණු පලතුරු අනුභව කරන්නෙමු' යි සිතා, ඔබේ ආචාර්යවරයා සමඟ බැරැක්කයක් රැගෙන වනයට පිවිසෙන්නේද?\n\nභවත් ගෞතමයින් වහන්ස, එසේ නොවේ.\n\nඅම්බට්ඨය, ඔබ කුමක් සිතන්නෙහිද? ඔබ මේ අනුත්තර විජ්ජාචරණ සම්පත්තිය අවබෝධ කර නොගෙන, ඉබේ වැටුණු පලතුරු අනුභව කිරීමටද නොහැකිව, 'අල, මුල්, පලතුරු අනුභව කරන්නෙමු' යි සිතා, ඔබේ ආචාර්යවරයා සමඟ උදැල්ලක් හා කූඩයක් රැගෙන වනයට පිවිසෙන්නේද?\n\nභවත් ගෞතමයින් වහන්ස, එසේ නොවේ.\n\nඅම්බට්ඨය, ඔබ කුමක් සිතන්නෙහිද? ඔබ මේ අනුත්තර විජ්ජාචරණ සම්පත්තිය අවබෝධ කර නොගෙන, ඉබේ වැටුණු පලතුරු අනුභව කිරීමටද නොහැකිව, අල, මුල්, පලතුරු අනුභව කිරීමටද නොහැකිව, ගමකට හෝ නියම්ගමකට ආසන්නයේ ගිනිහලක් සාදාගෙන, ඔබේ ආචාර්යවරයා සමඟ ගින්නට වඳිමින් වාසය කරන්නේද?\n\nභවත් ගෞතමයින් වහන්ස, එසේ නොවේ.\n\nඅම්බට්ඨය, ඔබ කුමක් සිතන්නෙහිද? ඔබ මේ අනුත්තර විජ්ජාචරණ සම්පත්තිය අවබෝධ කර නොගෙන, ඉබේ වැටුණු පලතුරු අනුභව කිරීමටද නොහැකිව, අල, මුල්, පලතුරු අනුභව කිරීමටද නොහැකිව, ගින්නට වන්දනාමාන කිරීමටද නොහැකිව, ‘මේ සතර දිශාවෙන් යම් කිසි ශ්‍රමණ​ කෙනෙක් හෝ බ්‍රාහ්මණ​ කෙනෙක් පැමිණෙන්නේ නම්, ඔවුන්ට අපි හැකි පමණින්, ශක්ති පමණින් පිදුම් කරන්නෙමු’ යි සිතා, සතර මං සන්ධියක සතර දොරටු සහිත ගෙයක් සාදාගෙන, ඔබේ ආචාර්යවරයා සමඟ වාසය කරන්නේද?\n\nභවත් ගෞතමයින් වහන්ස, එසේ නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 282,
      "pali": "‘‘Iti kho, ambaṭṭha, imāya ceva tvaṃ anuttarāya vijjācaraṇasampadāya parihīno sācariyako. Ye cime anuttarāya vijjācaraṇasampadāya cattāri apāyamukhāni bhavanti, tato ca tvaṃ parihīno sācariyako. Bhāsitā kho pana te esā, ambaṭṭha, ācariyena brāhmaṇena pokkharasātinā vācā – ‘ke ca muṇḍakā samaṇakā ibbhā kaṇhā bandhupādāpaccā, kā ca tevijjānaṃ brāhmaṇānaṃ sākacchā’ti attanā āpāyikopi aparipūramāno. Passa, ambaṭṭha, yāva aparaddhañca te idaṃ ācariyassa brāhmaṇassa pokkharasātissa. ",
      "english": "Thus indeed, Ambaṭṭha, you are deficient in this supreme perfection of knowledge and conduct, along with your teacher. And regarding those four doorways to woe, which lead to the loss of this supreme perfection of knowledge and conduct, in those too you and your teacher are deficient.\n\nAnd indeed, Ambaṭṭha, this statement was made by your teacher, the brahmin Pokkharasāti: ‘Who are these bald-headed recluses, wretched, dark, offspring of the Buddha’s foot? And what conversation can there be with brahmins who possess the three Vedas?’ — though he himself is heading for woe and is not fulfilling his own duties.\n\nSee, Ambaṭṭha, to what extent this is a fault of your teacher, the brahmin Pokkharasāti.",
      "sinhala": "ඉතින් අම්බට්ඨයෙනි, ඔබ මේ අනුත්තර විද්‍යාචරණ සම්පදාවෙන් ඔබේ ආචාර්යවරයා ද සමඟ පිරිහී ඇත. අනුත්තර විද්‍යාචරණ සම්පදාවට හානිදායක වන යම් අපායමුඛ සතරක් ඇද්ද, ඔබ ඔබේ ආචාර්යවරයා ද සමඟ එයින් ද පිරිහී ඇත. නමුත් අම්බට්ඨයෙනි, ඔබේ ආචාර්යවරයා වන පොක්ඛරසාති බමුණා විසින්, තමා අපායිකයෙකු ලෙසත්, අසම්පූර්ණ අයෙකු ලෙසත් සිටියදීම, ‘කවරහු ද මේ මුඩු වූ ශ්‍රමණයෝ, පහත් වූ, කළු වූ, බ්‍රහ්මයාගේ පාදයෙන් උපන්නෝ කවරහු ද? ත්‍රිවේදය දත් බ්‍රාහ්මණයන් හා මොවුන් අතර කවර සාකච්ඡාවක් ද?’ යනුවෙන් මේ වචනය කියන ලදී. අම්බට්ඨයෙනි, ඔබේ ආචාර්යවරයා වන පොක්ඛරසාති බමුණා විසින් කෙතරම් වරදක් කර ඇද්දැයි බලන්න.",
      "paliTitle": ""
    },
    {
      "number": 283,
      "pali": "‘‘Brāhmaṇo kho pana, ambaṭṭha, pokkharasāti rañño pasenadissa kosalassa dattikaṃ bhuñjati. Tassa rājā pasenadi kosalo sammukhībhāvampi na dadāti. Yadāpi tena manteti, tirodussantena manteti. Yassa kho pana, ambaṭṭha, dhammikaṃ payātaṃ bhikkhaṃ paṭiggaṇheyya, kathaṃ tassa rājā pasenadi kosalo sammukhībhāvampi na dadeyya. Passa, ambaṭṭha, yāva aparaddhañca te idaṃ ācariyassa brāhmaṇassa pokkharasātissa.",
      "english": "But indeed, Ambaṭṭha, the brahmin Pokkharasāti lives off a grant from King Pasenadi of Kosala. Yet King Pasenadi of Kosala does not grant him even a direct audience. And when he consults with him, he consults from behind a screen. But Ambaṭṭha, how could King Pasenadi of Kosala fail to grant even a direct audience to one who should indeed receive alms righteously offered? See, Ambaṭṭha, how great this offense of yours is towards your teacher, the brahmin Pokkharasāti.",
      "sinhala": "අම්බට්ඨය, පොක්ඛරසාති බමුණා නම් කෝසල රජු පසේනදීගේ දීමනාවෙන් ජීවත් වේ. කෝසල රජු පසේනදී ඔහුට මුණගැසීමටවත් ඉඩ නොදෙයි. යම් කලක ඔහු සමඟ සාකච්ඡා කරන්නේ නම්, තිරයක් පිටුපස සිටගෙන සාකච්ඡා කරයි. අම්බට්ඨය, යමෙක් ධර්මානුකූලව ලද දීමනා භුක්ති විඳින්නේ නම්, කෝසල රජු පසේනදී ඔහුට මුණගැසීමටවත් ඉඩ නොදෙන්නේ කෙසේද? බලන්න, අම්බට්ඨය, ඔබේ ආචාර්යවරයා වූ පොක්ඛරසාති බමුණාට මෙයින් කොපමණ වරදක් වන්නේද කියා.",
      "paliTitle": "Pubbakaisibhāvānuyogo",
      "englishTitle": "Cultivation of Former Sagehood",
      "sinhalaTitle": "පෙර ඍෂි භාවානුයෝගය"
    },
    {
      "number": 284,
      "pali": "‘‘Taṃ kiṃ maññasi, ambaṭṭha, idha rājā pasenadi kosalo hatthigīvāya vā nisinno assapiṭṭhe vā nisinno rathūpatthare vā ṭhito uggehi vā rājaññehi vā kiñcideva mantanaṃ manteyya. So tamhā padesā apakkamma ekamantaṃ tiṭṭheyya. Atha āgaccheyya suddo vā suddadāso vā, tasmiṃ padese ṭhito tadeva mantanaṃ manteyya – ‘evampi rājā pasenadi kosalo āha, evampi rājā pasenadi kosalo āhā’ti. Apinu so rājabhaṇitaṃ vā bhaṇati rājamantanaṃ vā manteti? Ettāvatā so assa rājā vā rājamatto vā’’ti? ‘‘No hidaṃ, bho gotama’’.",
      "english": "What do you think, Ambaṭṭha? Suppose here King Pasenadi of Kosala, whether seated on an elephant's neck, or seated on a horse's back, or standing on the floor of a chariot, were to hold some consultation with powerful or royal personages. He would then leave that place and stand to one side.\n\nThen, suppose a commoner or a commoner's slave were to come and, standing in that very place, conduct that same consultation, saying: 'Thus spoke King Pasenadi of Kosala, thus spoke King Pasenadi of Kosala.' Would he then be speaking the king's words, or engaging in the king's consultation?\n\nWould he thereby be a king or a king's minister?\n\nNo, indeed, Venerable Gotama.",
      "sinhala": "අම්බට්ඨය, ඔබ මේ ගැන කුමක් සිතනවාද? මෙහිදී කෝසල රජු වන පසේනදි, ඇතෙකුගේ ගෙල මත හිඳගෙන හෝ අශ්වයෙකුගේ පිට මත හිඳගෙන හෝ රථ තලය මත සිටගෙන හෝ, බලවත් රජවරුන් හෝ ක්ෂත්‍රියයන් සමඟ යම්කිසි මන‍්ත‍්‍රණයක් පවත්වන්නට පුළුවන. ඔහු ඒ ස්ථානයෙන් ඉවත්ව, එක් පසෙකට වී සිටියි. එවිට ශූද්‍රයෙක් හෝ ශූද්‍ර දාසයෙක් පැමිණ, ඒ ස්ථානයේ සිටගෙන, 'කෝසල රජු වන පසේනදි මෙසේ ද කීවේය, කෝසල රජු වන පසේනදි මෙසේ ද කීවේය' යැයි කියමින්, ඒ මන‍්ත‍්‍රණයම පවත්වයි. ඔහු රජුගේ වචනම කියන්නේද, නැතහොත් රජුගේ මන‍්ත‍්‍රණයම පවත්වන්නේද? එපමණකින් ඔහු රජෙක් වේද, නැතහොත් රජුගේ ඇමතිවරයෙක් වේද?\n\nනැත, භවත් ගෞතමය.",
      "paliTitle": ""
    },
    {
      "number": 285,
      "pali": "‘‘Evameva kho tvaṃ, ambaṭṭha, ye te ahesuṃ brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro, yesamidaṃ etarahi brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samihitaṃ, tadanugāyanti tadanubhāsanti bhāsitamanubhāsanti vācitamanuvācenti, seyyathidaṃ – aṭṭhako vāmako vāmadevo vessāmitto yamataggi [yamadaggi (ka.)] aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu – ‘tyāhaṃ mante adhiyāmi sācariyako’ti, tāvatā tvaṃ bhavissasi isi vā isitthāya vā paṭipannoti netaṃ ṭhānaṃ vijjati.",
      "english": "Just so, Ambaṭṭha, regarding those ancient sages of the brahmins who were the composers and promulgators of the mantras—whose ancient mantra-recitation, sung, proclaimed, and compiled, is now chanted and proclaimed by brahmins, who follow in their chanting and proclaiming, repeating what was uttered and re-reciting what was recited—such as Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, and Bhagu; merely by your saying, ‘I study these mantras with my teacher,’ it is not possible that you will become a sage or one who has entered the path to sagehood.",
      "sinhala": "අම්බට්ඨය, යම් බ්‍රාහ්මණයන්ගේ පුරාණ ඍෂිවරු මන්ත්‍රයන්ගේ කර්තෘවරු ද, මන්ත්‍රයන්ගේ ප්‍රචාරකයෝ ද වූවාහු ද, යම් අයගේ මේ පුරාණ මන්ත්‍ර පද වර්තමාන බ්‍රාහ්මණයන් විසින් ගායනා කරන ලද, ප්‍රකාශ කරන ලද, සම්පාදනය කරන ලද ඒවා ද, ඒ අනුව ගායනා කරන්නාහු ද, ඒ අනුව ප්‍රකාශ කරන්නාහු ද, ප්‍රකාශ කළ දේ අනුව නැවත ප්‍රකාශ කරන්නාහු ද, කියවන ලද දේ අනුව නැවත කියවන්නාහු ද, එනම් අට්ඨක, වාමක, වාමදේව, වෛශ්‍යාමිත්‍ර, යමත්අග්ගි, අංගීරස, භාරද්වාජ, වාසෙට්ඨ, කාශ්‍යප, භගු යන ඍෂිවරුන්ගේ මන්ත්‍රයන් ‘මම ගුරුවරයා සමඟ අධ්‍යයනය කරමි’යි කියා, එපමණකින් ඔබ ඍෂිවරයෙක් වන්නේ යැයි හෝ ඍෂි භාවය සඳහා පිළිපන් අයෙක් වන්නේ යැයි හෝ කියා එය සිදුවිය හැකි කරුණක් නොවේ.",
      "paliTitle": ""
    },
    {
      "number": 286,
      "pali": "‘‘Taṃ kiṃ maññasi, ambaṭṭha, kinti te sutaṃ brāhmaṇānaṃ vuddhānaṃ mahallakānaṃ ācariyapācariyānaṃ bhāsamānānaṃ – ye te ahesuṃ brāhmaṇānaṃ pubbakā isayo mantānaṃ kattāro mantānaṃ pavattāro, yesamidaṃ etarahi brāhmaṇā porāṇaṃ mantapadaṃ gītaṃ pavuttaṃ samihitaṃ, tadanugāyanti tadanubhāsanti bhāsitamanubhāsanti vācitamanuvācenti, seyyathidaṃ – aṭṭhako vāmako vāmadevo vessāmitto yamataggi aṅgīraso bhāradvājo vāseṭṭho kassapo bhagu, evaṃ su te sunhātā suvilittā kappitakesamassū āmukkamaṇikuṇḍalābharaṇā [āmuttamālābharaṇā (sī. syā. pī.)] odātavatthavasanā pañcahi kāmaguṇehi samappitā samaṅgībhūtā paricārenti, seyyathāpi tvaṃ etarahi sācariyako’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘…Pe… evaṃ su te sālīnaṃ odanaṃ sucimaṃsūpasecanaṃ vicitakāḷakaṃ anekasūpaṃ anekabyañjanaṃ paribhuñjanti, seyyathāpi tvaṃ etarahi sācariyako’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘…Pe… evaṃ su te veṭhakanatapassāhi nārīhi paricārenti, seyyathāpi tvaṃ etarahi sācariyako’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘…Pe… evaṃ su te kuttavālehi vaḷavārathehi dīghāhi patodalaṭṭhīhi vāhane vitudentā vipariyāyanti, seyyathāpi tvaṃ etarahi sācariyako’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘…Pe… evaṃ su te ukkiṇṇaparikhāsu okkhittapalighāsu nagarūpakārikāsu dīghāsivudhehi [dīghāsibaddhehi (syā. pī.)] purisehi rakkhāpenti, seyyathāpi tvaṃ etarahi sācariyako’’ti? ‘‘No hidaṃ, bho gotama’’. ‘‘Iti kho, ambaṭṭha, neva tvaṃ isi na isitthāya paṭipanno sācariyako. Yassa kho pana, ambaṭṭha, mayi kaṅkhā vā vimati vā so maṃ pañhena, ahaṃ veyyākaraṇena sodhissāmī’’ti. ",
      "english": "What do you think, Ambaṭṭha, how have you heard it spoken by the Brahmins, the elders, the old ones, the teachers and ancestral teachers – concerning those ancient sages of the Brahmins who were the makers of the mantras, the propagators of the mantras, whose ancient mantra-statements are now sung, proclaimed, and compiled by Brahmins, and which they recite, repeat, imitate in their speech, and reiterate when taught, namely – Aṭṭhaka, Vāmaka, Vāmadeva, Vessāmitta, Yamataggi, Aṅgīrasa, Bhāradvāja, Vāseṭṭha, Kassapa, Bhagu – were they, after bathing well, anointing themselves well, with hair and beard trimmed, adorned with jeweled earrings and ornaments, clad in white garments, fully indulging in and equipped with the five strands of sensual pleasure, serving (others), just as you do now with your teacher?\nNo indeed, Venerable Gotama.\n\nDid they eat rice, with pure meat as seasoning, varied with black grains, with many curries and many sauces, just as you do now with your teacher?\nNo indeed, Venerable Gotama.\n\nDid they attend to women with tied-up topknots, just as you do now with your teacher?\nNo indeed, Venerable Gotama.\n\nDid they travel about, goading their vehicles with long whips and mares with trimmed manes, just as you do now with your teacher?\nNo indeed, Venerable Gotama.\n\nDid they have themselves guarded by men with long swords, in cities whose moats had been dug and whose city-bars had been cast down, just as you do now with your teacher?\nNo indeed, Venerable Gotama.\n\nThus then, Ambaṭṭha, neither are you a sage, nor are you practicing the way of a sage, even with your teacher. However, Ambaṭṭha, if anyone has doubt or uncertainty regarding me, let him question me, and I shall resolve it with an explanation.",
      "sinhala": "අම්බට්ඨය, ඔබ මේ ගැන කුමක් සිතනවාද? බ්‍රාහ්මණයන්ගේ වැඩිහිටි, මහලු, ආචාර්‍ය-ප්‍රාචාර්‍යවරුන් කතා කරනවා ඔබට ඇසී තිබෙනවාද—යම් ඒ බ්‍රාහ්මණයන්ගේ පෙර විසූ ඍෂිවරු මන්ත්‍ර කරුවන්, මන්ත්‍ර පවත්වන්නන් වූවාද, යම් ඔවුන්ගේ මේ පෞරාණික මන්ත්‍ර පද වර්තමානයේ බ්‍රාහ්මණයන් විසින් ගායනා කරනු ලබනවාද, කියනු ලබනවාද, සම්පිණ්ඩනය කරනු ලබනවාද, ඒවාම පසු ගායනා කරනවාද, පසු කියනවාද, කියූ දේම කියනවාද, වචනයෙන් වචනයම කියනවාද, එනම් අට්ඨක, වාමක, වාමදේව, වෛශ්‍යාමිත්‍ර, යමදග්නි, අංගීරස, භාරද්වාජ, වාසෙට්ඨ, කස්සප, භගු යන ඍෂිවරුන්—ඔවුහු මෙලෙස හොඳින් නා, හොඳින් ගැල්වූ, කපන ලද කෙස් රැවුල් ඇතිව, මැණික් කරාබු ආභරණ පැළඳ, සුදු වස්ත්‍ර හැඳ, පංච කාම ගුණයන්ගෙන් සමන්විතව, සම්බන්ධව, ඔබ දැන් ඔබගේ ආචාර්‍යවරයා සමඟ සේවනය කරන්නාක් මෙන් සේවනය කළාද? භවත් ගෞතමයින් වහන්ස, නැත.\n\n...ඔවුහු මෙලෙස සුවඳවත් බත්, පිරිසිදු මස් හොද්දෙන් යුක්තව, විවිධ වූ රසවත් ආහාර සහිතව, බොහෝ සූප වර්ග සහ බොහෝ ව්‍යංජන සහිතව පරිභෝජනය කළාද, ඔබ දැන් ඔබගේ ආචාර්‍යවරයා සමඟ කරන්නාක් මෙන්? භවත් ගෞතමයින් වහන්ස, නැත.\n\n...ඔවුහු මෙලෙස වෙළූ හිසකෙස් ඇති ස්ත්‍‍රීන් විසින් සේවනය කරවූවාද, ඔබ දැන් ඔබගේ ආචාර්‍යවරයා සමඟ කරන්නාක් මෙන්? භවත් ගෞතමයින් වහන්ස, නැත.\n\n...ඔවුහු මෙලෙස කපන ලද වල්ගා ඇති අශ්වයන් බැඳි රථවලින්, දිගු කෝටු පහරවල් මගින් වාහනය තලමින් ගමන් කළාද, ඔබ දැන් ඔබගේ ආචාර්‍යවරයා සමඟ කරන්නාක් මෙන්? භවත් ගෞතමයින් වහන්ස, නැත.\n\n...ඔවුහු මෙලෙස හාරන ලද දිය අගල් සහිත, දොරගුළු දමන ලද, නගරයට සමාන ගොඩනැගිලි සහිත තැන්වල, දිගු කඩු ගත් පුරුෂයන් විසින් ආරක්ෂා කරවූවාද, ඔබ දැන් ඔබගේ ආචාර්‍යවරයා සමඟ කරන්නාක් මෙන්? භවත් ගෞතමයින් වහන්ස, නැත.\n\nඑසේනම්, අම්බට්ඨය, ඔබවත්, ඔබගේ ආචාර්‍යවරයාත් ඍෂිවරයෙක් හෝ ඍෂිවරයෙකුගේ මාර්ගයේ ගමන් කරන්නෙකු නොවේ. අම්බට්ඨය, යමෙකුට මා කෙරෙහි සැකයක් හෝ විමතියක් ඇත්නම්, ඔහු ප්‍රශ්න ඇසීමෙන් මා විමසාවා, මම විස්තර කිරීමෙන් එය පැහැදිලි කරන්නෙමි.",
      "paliTitle": ""
    },
    {
      "number": 287,
      "pali": "Atha kho bhagavā vihārā nikkhamma caṅkamaṃ abbhuṭṭhāsi. Ambaṭṭhopi māṇavo vihārā nikkhamma caṅkamaṃ abbhuṭṭhāsi. Atha kho ambaṭṭho māṇavo bhagavantaṃ caṅkamantaṃ anucaṅkamamāno bhagavato kāye dvattiṃsamahāpurisalakkhaṇāni samannesi. Addasā kho ambaṭṭho māṇavo bhagavato kāye dvattiṃsamahāpurisalakkhaṇāni yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati – kosohite ca vatthaguyhe pahūtajivhatāya ca.",
      "english": "Then the Blessed One, having emerged from the dwelling, went forth to the walking path. Ambaṭṭha the student, too, having emerged from the dwelling, went forth to the walking path. Then Ambaṭṭha the student, walking after the Blessed One as he walked, examined the thirty-two marks of a Great Man on the Blessed One's body. Indeed, Ambaṭṭha the student saw most of the thirty-two marks of a Great Man on the Blessed One's body, with the exception of two. Concerning two of the marks of a Great Man, he doubted, he was perplexed, he was not convinced, and he was not clearly confident: namely, the private parts being ensheathed in a membrane, and the very long tongue.",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ විහාරයෙන් නික්ම සක්මනට වැඩියේය. අම්බට්ඨ මානවකයාද විහාරයෙන් නික්ම සක්මනට නැගී සිටියේය.\n\nඑවිට අම්බට්ඨ මානවකයා භාග්‍යවතුන් වහන්සේ සක්මන් කරන අතර පසුපසින් සක්මන් කරමින් භාග්‍යවතුන් වහන්සේගේ කයෙහි මහා පුරුෂ ලක්ෂණ තිස්දෙක පරීක්ෂා කළේය. අම්බට්ඨ මානවකයා භාග්‍යවතුන් වහන්සේගේ කයෙහි මහා පුරුෂ ලක්ෂණ තිස්දෙකෙන් දෙකක් හැර සෙසු බොහෝ ලක්ෂණ දුටුවේය. මහා පුරුෂ ලක්ෂණ දෙකක් ගැන ඔහු සැක කළේය, විචිකිච්ඡාවෙන් යුක්ත විය, නිශ්චය කළේ නැත, පහදවා ගත්තේ නැත – එනම් කෝෂය තුළ සැඟවුණු ලිඟුව සහ දිගු දිව යන ලක්ෂණ දෙකයි.",
      "paliTitle": "Dvelakkhaṇādassanaṃ",
      "englishTitle": "Not Seeing Two Characteristics",
      "sinhalaTitle": "ද්ZWJවිලක්ZWJෂණ අදර්ZWJශනය"
    },
    {
      "number": 288,
      "pali": "Atha kho bhagavato etadahosi – ‘‘passati kho me ayaṃ ambaṭṭho māṇavo dvattiṃsamahāpurisalakkhaṇāni yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati – kosohite ca vatthaguyhe pahūtajivhatāya cā’’ti. Atha kho bhagavā tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsi yathā addasa ambaṭṭho māṇavo bhagavato kosohitaṃ vatthaguyhaṃ. Atha kho bhagavā jivhaṃ ninnāmetvā ubhopi kaṇṇasotāni anumasi paṭimasi, ubhopi nāsikasotāni anumasi paṭimasi, kevalampi nalāṭamaṇḍalaṃ jivhāya chādesi. Atha kho ambaṭṭhassa māṇavassa etadahosi – ‘‘samannāgato kho samaṇo gotamo dvattiṃsamahāpurisalakkhaṇehi paripuṇṇehi, no aparipuṇṇehī’’ti. Bhagavantaṃ etadavoca – ‘‘handa ca dāni mayaṃ, bho gotama, gacchāma, bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassadāni tvaṃ, ambaṭṭha, kālaṃ maññasī’’ti. Atha kho ambaṭṭho māṇavo vaḷavārathamāruyha pakkāmi.",
      "english": "Then it occurred to the Blessed One: \"This young man Ambaṭṭha sees most of the thirty-two marks of a Great Man, except for two. Concerning these two marks of a Great Man—the male organ being retractible into a sheath, and the tongue being very long—he is doubtful, wavering, unconvinced, and not serene.\"\n\nThen the Blessed One willed such a psychic manifestation that the young man Ambaṭṭha saw the Blessed One’s male organ retracted into a sheath.\n\nThen the Blessed One stretched out his tongue and touched and stroked both ear-holes, touched and stroked both nostril-holes, and completely covered his entire forehead with his tongue.\n\nThen it occurred to the young man Ambaṭṭha: \"Indeed, the recluse Gotama is endowed with all thirty-two marks of a Great Man, complete and not lacking any.\"\n\nHe then said to the Blessed One: \"Well now, venerable Gotama, we should depart. We have many duties and many tasks to attend to.\" \"Do now, Ambaṭṭha, as you deem fit.\"\n\nThen the young man Ambaṭṭha mounted a chariot drawn by mares and departed.",
      "sinhala": "එවිට භාග්‍යවතුන්ට මෙසේ සිතුණි: 'මේ අම්බට්ඨ මානවකයා මහා පුරුෂ ලක්ෂණ තිස්දෙකින් ප්‍රධාන වශයෙන් දෙකක් හැර අන් සියල්ල දකියි. මහා පුරුෂ ලක්ෂණ දෙකක් සම්බන්ධයෙන් ඔහු සැක කරයි, විචිකිච්ඡාවට පත් වේ, නොඅදිටන් කරයි, නොපැහැදේ – එනම්, කෝෂයක් තුළ සැඟවුණු ලිංගය සහ දිගු දිව යන ලක්ෂණ දෙක සම්බන්ධයෙනි.' එවිට භාග්‍යවතුන් වහන්සේ අම්බට්ඨ මානවකයාට භාග්‍යවතුන් වහන්සේගේ කෝෂය තුළ සැඟවුණු ලිංගය දැක්වෙන පරිදි එබඳු ඍද්ධි අභිසංඛාරයක් කළ සේක. එවිට භාග්‍යවතුන් වහන්සේ දිව දිගු කොට කන් දෙකේ කුහර දෙක ද, නාසා කුහර දෙක ද අතගා මිරිකා, මුළු නළල් තලය ද දිවෙන් වැසූ සේක. එවිට අම්බට්ඨ මානවකයාට මෙසේ සිතුණි: 'ශ්‍රමණ ගෞතමයන් වහන්සේ අඩුවක් නැති, සම්පූර්ණ මහා පුරුෂ ලක්ෂණ තිස්දෙකින් යුක්ත වන සේක.' ඔහු භාග්‍යවතුන් වහන්සේට මෙසේ කීවේ ය: 'ගෞතමයන් වහන්ස, එසේ නම් අපි දැන් යමු, අපට බොහෝ කටයුතු ඇත, බොහෝ දේ කිරීමට ඇත.' 'අම්බට්ඨය, දැන් ඔබට සුදුසු යැයි හැඟෙන වෙලාවට ඔබ යන්න.' එවිට අම්බට්ඨ මානවකයා වළවා රථයකට නැඟී පිටත් විය.",
      "paliTitle": ""
    },
    {
      "number": 289,
      "pali": "Tena kho pana samayena brāhmaṇo pokkharasāti ukkaṭṭhāya nikkhamitvā mahatā brāhmaṇagaṇena saddhiṃ sake ārāme nisinno hoti ambaṭṭhaṃyeva māṇavaṃ paṭimānento. Atha kho ambaṭṭho māṇavo yena sako ārāmo tena pāyāsi. Yāvatikā yānassa bhūmi, yānena gantvā yānā paccorohitvā pattikova yena brāhmaṇo pokkharasāti tenupasaṅkami; upasaṅkamitvā brāhmaṇaṃ pokkharasātiṃ abhivādetvā ekamantaṃ nisīdi.",
      "english": "At that time, the brahmin Pokkharasāti, having departed from Ukkaṭṭhā, was seated in his own park with a large company of brahmins, waiting for the young man Ambaṭṭha. Then the young man Ambaṭṭha went towards that park. Having travelled by vehicle as far as the ground permitted, he dismounted from his vehicle and approached the brahmin Pokkharasāti on foot. Having approached and greeted the brahmin Pokkharasāti, he sat down to one side.",
      "sinhala": "ඒ වන විට පොක්ඛරසාති බ්‍රාහ්මණයා උක්කට්ඨාවට පිටත්ව ගොස්, මහත් බ්‍රාහ්මණ පිරිසක් සමඟ තමන්ගේ ආරාමයේ අම්බට්ඨ මානවකයා එනතුරු බලාපොරොත්තුවෙන් වාඩි වී සිටියේය. ඉන්පසු අම්බට්ඨ මානවකයා තමන්ගේ ආරාමය දෙසට ගමන් කළේය. යානයට යා හැකි තාක් දුරක් යානයෙන් ගොස්, යානයෙන් බැස, පයින්ම පොක්ඛරසාති බ්‍රාහ්මණයා සිටි තැනට පැමිණියේය. පැමිණ පොක්ඛරසාති බ්‍රාහ්මණයාට ආචාර කොට එක් පසෙකින් වාඩි විය.",
      "paliTitle": ""
    },
    {
      "number": 290,
      "pali": "Ekamantaṃ nisinnaṃ kho ambaṭṭhaṃ māṇavaṃ brāhmaṇo pokkharasāti etadavoca – ‘‘kacci, tāta ambaṭṭha, addasa taṃ bhavantaṃ gotama’’nti? ‘‘Addasāma kho mayaṃ, bho, taṃ bhavantaṃ gotama’’nti. ‘‘Kacci, tāta ambaṭṭha, taṃ bhavantaṃ gotamaṃ tathā santaṃyeva saddo abbhuggato no aññathā; kacci pana so bhavaṃ gotamo tādiso no aññādiso’’ti? ‘‘Tathā santaṃyeva, bho, taṃ bhavantaṃ gotamaṃ saddo abbhuggato no aññathā, tādisova so bhavaṃ gotamo no aññādiso. Samannāgato ca so bhavaṃ gotamo dvattiṃsamahāpurisalakkhaṇehi paripuṇṇehi no aparipuṇṇehī’’ti. ‘‘Ahu pana te, tāta ambaṭṭha, samaṇena gotamena saddhiṃ kocideva kathāsallāpo’’ti? ‘‘Ahu kho me, bho, samaṇena gotamena saddhiṃ kocideva kathāsallāpo’’ti. ‘‘Yathā kathaṃ pana te, tāta ambaṭṭha, ahu samaṇena gotamena saddhiṃ kocideva kathāsallāpo’’ti? Atha kho ambaṭṭho māṇavo yāvatako [yāvatiko (ka. pī.)] ahosi bhagavatā saddhiṃ kathāsallāpo, taṃ sabbaṃ brāhmaṇassa pokkharasātissa ārocesi.",
      "english": "The brahmin Pokkharasāti then said this to the young brahmin Ambaṭṭha, who was seated to one side: \"My dear Ambaṭṭha, did you see the venerable Gotama?\" \"Indeed, sir, we saw the venerable Gotama.\" \"My dear Ambaṭṭha, is the report concerning that venerable Gotama accurate, and not otherwise? And is that venerable Gotama indeed such a one, and not otherwise?\" \"Sir, the report concerning that venerable Gotama is indeed accurate, and not otherwise. That venerable Gotama is indeed such a one, and not otherwise. And that venerable Gotama is endowed with the thirty-two marks of a Great Man, complete and not incomplete.\" \"My dear Ambaṭṭha, did you have any conversation whatsoever with the ascetic Gotama?\" \"Indeed, sir, I had some conversation with the ascetic Gotama.\" \"My dear Ambaṭṭha, how then did you have any conversation whatsoever with the ascetic Gotama?\" Then the young brahmin Ambaṭṭha recounted all the conversation he had had with the Blessed One to the brahmin Pokkharasāti.",
      "sinhala": "එක් පසෙක වාඩි වී සිටි අම්බට්ඨ මානවකයාට පොක්ඛරසාති බ්‍රාහ්මණයා මෙසේ කීවේය: \"අම්බට්ඨ පුත, ඔබ භාග්‍යවතුන් ගෞතමයන් වහන්සේව දුටුවේද?\"\n\"ස්වාමීනි, අපි භාග්‍යවතුන් ගෞතමයන් වහන්සේව දුටුවෙමු.\"\n\"අම්බට්ඨ පුත, ඒ භාග්‍යවතුන් ගෞතමයන් වහන්සේට එසේම කීර්ති රාවය පැතිරී තිබේද, වෙනත් අයුරකින් නොවේද? එම භාග්‍යවතුන් ගෞතමයන් වහන්සේ එබඳුම කෙනෙක්ද, වෙනත් අයුරකින් නොවේද?\"\n\"ස්වාමීනි, ඒ භාග්‍යවතුන් ගෞතමයන් වහන්සේට එසේම කීර්ති රාවය පැතිරී තිබේ, වෙනත් අයුරකින් නොවේ. එම භාග්‍යවතුන් ගෞතමයන් වහන්සේ එබඳුම කෙනෙකි, වෙනත් අයුරකින් නොවේ. තවද, එම භාග්‍යවතුන් ගෞතමයන් වහන්සේ සම්පූර්ණ වූ, අසම්පූර්ණ නොවන මහා පුරුෂ ලක්ෂණ තිස්දෙකෙන් යුක්තය.\"\n\"අම්බට්ඨ පුත, ශ්‍රමණ ගෞතමයන් වහන්සේ සමඟ ඔබට යම්කිසි කතාබහක් ඇති වූවාද?\"\n\"ස්වාමීනි, ශ්‍රමණ ගෞතමයන් වහන්සේ සමඟ මට යම්කිසි කතාබහක් ඇති විය.\"\n\"අම්බට්ඨ පුත, ශ්‍රමණ ගෞතමයන් වහන්සේ සමඟ ඔබට කෙසේනම් කතාබහක් ඇති වූවාද?\"\nඑවිට අම්බට්ඨ මානවකයා භාග්‍යවතුන් වහන්සේ සමඟ කෙතරම් කතාබහක් ඇති වූයේද, ඒ සියල්ල පොක්ඛරසාති බ්‍රාහ්මණයාට දැනුම් දුන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 291,
      "pali": "Evaṃ vutte, brāhmaṇo pokkharasāti ambaṭṭhaṃ māṇavaṃ etadavoca – ‘‘aho vata re amhākaṃ paṇḍitaka [paṇḍitakā], aho vata re amhākaṃ bahussutaka [bahussutakā], aho vata re amhākaṃ tevijjaka [tevijjakā], evarūpena kira, bho, puriso atthacarakena kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya. Yadeva kho tvaṃ, ambaṭṭha, taṃ bhavantaṃ gotamaṃ evaṃ āsajja āsajja avacāsi, atha kho so bhavaṃ gotamo amhepi evaṃ upaneyya upaneyya avaca. Aho vata re amhākaṃ paṇḍitaka, aho vata re amhākaṃ bahussutaka, aho vata re amhākaṃ tevijjaka, evarūpena kira, bho, puriso atthacarakena kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyyā’’ti, kupito [so kupito (pī.)] anattamano ambaṭṭhaṃ māṇavaṃ padasāyeva pavattesi. Icchati ca tāvadeva bhagavantaṃ dassanāya upasaṅkamituṃ. ",
      "english": "When this was said, the brahmin Pokkharasāti addressed the young brahmin Ambaṭṭha: \"Oh, alas, our little scholar! Oh, alas, our little learned one! Oh, alas, our little knower of the three Vedas! Surely, sir, a person of such a kind, acting for his own ruin, would upon the breaking up of the body, after death, reappear in a state of deprivation, an unhappy destination, a downward course, in hell. Just as you, Ambaṭṭha, repeatedly spoke insultingly to the venerable Gotama, so too would that venerable Gotama repeatedly draw inferences about us and speak of us in that way. Oh, alas, our little scholar! Oh, alas, our little learned one! Oh, alas, our little knower of the three Vedas! Surely, sir, a person of such a kind, acting for his own ruin, would upon the breaking up of the body, after death, reappear in a state of deprivation, an unhappy destination, a downward course, in hell!\"\n\nFurious and displeased, he pushed the young brahmin Ambaṭṭha away with his foot. And he immediately wished to approach the Blessed One for an audience.",
      "sinhala": "මෙසේ කී කල්හි, පොක්ඛරසාති බ්‍රාහ්මණයා අම්බට්ඨ මානවකයාට මෙසේ කීවේය: “අනේ, අපේ පණ්ඩිතයා, අනේ, අපේ බහුශ්‍රැතයා, අනේ, අපේ ත්‍රිවේදියා! අනේ, මෙවන් පුද්ගලයෙක් අහිත පිණිස හැසිරීම නිසා කය බිඳී මරණින් පසුව අපායට, දුගතියට, විනිපාතයට, නිරයට උපදින්නේය. අම්බට්ඨ, නුඹ නම් ඒ භාග්‍යවතුන් ගෞතමයන් වහන්සේට මෙසේ නින්දා කරමින්, නින්දා කරමින් කථා කළා නොවේද? එසේ වුවත් ඒ භාග්‍යවතුන් ගෞතමයන් වහන්සේ අපටද මෙසේ ළං කරමින්, ළං කරමින් කථා කළ සේක. අනේ, අපේ පණ්ඩිතයා, අනේ, අපේ බහුශ්‍රැතයා, අනේ, අපේ ත්‍රිවේදියා! අනේ, මෙවන් පුද්ගලයෙක් අහිත පිණිස හැසිරීම නිසා කය බිඳී මරණින් පසුව අපායට, දුගතියට, විනිපාතයට, නිරයට උපදින්නේය.” කෝපයට පත්ව, නොසතුටු වූ සිත් ඇතිව ඔහු අම්බට්ඨ මානවකයා පයින්ම එළවා දැමුවේය.\n\nඑකෙණෙහිම භාග්‍යවතුන් වහන්සේව දැකීමට පිවිසෙන්නට ඔහු කැමති විය.",
      "paliTitle": ""
    },
    {
      "number": 292,
      "pali": "Atha kho te brāhmaṇā brāhmaṇaṃ pokkharasātiṃ etadavocuṃ – ‘‘ativikālo kho, bho, ajja samaṇaṃ gotamaṃ dassanāya upasaṅkamituṃ. Svedāni [dāni sve (sī. ka.)] bhavaṃ pokkharasāti samaṇaṃ gotamaṃ dassanāya upasaṅkamissatī’’ti. Atha kho brāhmaṇo pokkharasāti sake nivesane paṇītaṃ khādanīyaṃ bhojanīyaṃ paṭiyādāpetvā yāne āropetvā ukkāsu dhāriyamānāsu ukkaṭṭhāya niyyāsi, yena icchānaṅgalavanasaṇḍo tena pāyāsi. Yāvatikā yānassa bhūmi yānena gantvā, yānā paccorohitvā pattikova yena bhagavā tenupasaṅkami. Upasaṅkamitvā bhagavatā saddhiṃ sammodi, sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi.",
      "english": "Then those brahmins said to the brahmin Pokkharasāti, \"It is too late today, sir, to approach the ascetic Gotama for an audience. So tomorrow, Master Pokkharasāti, you will approach the ascetic Gotama for an audience.\"\n\nThen the brahmin Pokkharasāti had excellent hard and soft foods prepared in his own residence. Having loaded them onto a carriage, he set out with torches being carried, in great pomp, and proceeded to the Icchānaṅgala forest grove. He traveled by carriage as far as the carriage could go, then dismounted and approached the Blessed One on foot. Having approached, he exchanged greetings with the Blessed One, and after exchanging cordial and memorable talk, he sat down to one side.",
      "sinhala": "එවිට ඒ බ්‍රාහ්මණයෝ පොක්ඛරසාති බ්‍රාහ්මණයාට මෙසේ කීහ: \"භවත්නි, අද ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට යාමට ඉතා ප්‍රමාද වැඩියි. හෙට භවත් පොක්ඛරසාති ශ්‍රමණ ගෞතමයන් වහන්සේ බැහැදැකීමට වඩිනු ඇත.\"\n\nඑවිට පොක්ඛරසාති බ්‍රාහ්මණයා තම නිවසේදී ප්‍රණීත කෑම බීම පිළියෙල කරවාගෙන, ඒවා යානාවක පටවාගෙන, පන්දම් දල්වාගෙන උසස් පෙරහරකින් පිටත් විය. ඔහු ඉච්ඡානංගල වනාන්තරය දෙසට ගමන් කළේය.\n\nයානයට යා හැකි පමණ තැනක් යානයෙන් ගොස්, යානයෙන් බැස, පයින්ම භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය, සිහි කටයුතු වූ, සතුටු වන කතා පැවැත්වීමෙන් පසු එකත්පසෙකින් වාඩි විය.",
      "paliTitle": "Pokkharasātibuddhupasaṅkamanaṃ",
      "englishTitle": "Pokkharasāti's Visit to the Buddha",
      "sinhalaTitle": "පොක්ඛරසාති බුදුන් උපසංක්‍රමණය"
    },
    {
      "number": 293,
      "pali": "Ekamantaṃ nisinno kho brāhmaṇo pokkharasāti bhagavantaṃ etadavoca – ‘‘āgamā nu kho idha, bho gotama, amhākaṃ antevāsī ambaṭṭho māṇavo’’ti? ‘‘Āgamā kho te [tedha (syā.), te idha (pī.)], brāhmaṇa, antevāsī ambaṭṭho māṇavo’’ti. ‘‘Ahu pana te, bho gotama, ambaṭṭhena māṇavena saddhiṃ kocideva kathāsallāpo’’ti? ‘‘Ahu kho me, brāhmaṇa, ambaṭṭhena māṇavena saddhiṃ kocideva kathāsallāpo’’ti. ‘‘Yathākathaṃ pana te, bho gotama, ahu ambaṭṭhena māṇavena saddhiṃ kocideva kathāsallāpo’’ti? Atha kho bhagavā yāvatako ahosi ambaṭṭhena māṇavena saddhiṃ kathāsallāpo, taṃ sabbaṃ brāhmaṇassa pokkharasātissa ārocesi. Evaṃ vutte, brāhmaṇo pokkharasāti bhagavantaṃ etadavoca – ‘‘bālo, bho gotama, ambaṭṭho māṇavo, khamatu bhavaṃ gotamo ambaṭṭhassa māṇavassā’’ti. ‘‘Sukhī hotu, brāhmaṇa, ambaṭṭho māṇavo’’ti.",
      "english": "Seated to one side, the Brahmin Pokkharasāti then said this to the Blessed One: \"Master Gotama, has our student, young Ambhaṭṭha, come here?\" \"Brahmin, your student, young Ambhaṭṭha, has indeed come.\" \"Master Gotama, did you have any conversation with young Ambhaṭṭha?\" \"Indeed, Brahmin, I had some conversation with young Ambhaṭṭha.\" \"But Master Gotama, what kind of conversation did you have with young Ambhaṭṭha?\" Then the Blessed One recounted to the Brahmin Pokkharasāti all the conversation that had taken place with young Ambhaṭṭha. When this was said, the Brahmin Pokkharasāti said this to the Blessed One: \"Master Gotama, young Ambhaṭṭha is foolish! May Master Gotama forgive young Ambhaṭṭha.\" \"May young Ambhaṭṭha be happy, Brahmin.\"",
      "sinhala": "එක්පසෙක වාඩි වී සිටි පොක්ඛරසාති බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"භවත් ගෞතමයන් වහන්ස, අපගේ අන්තේවාසික අම්බට්ඨ මානවකයා මෙහි ආවාද?\" \"බ්‍රාහ්මණය, ඔබේ අන්තේවාසික අම්බට්ඨ මානවකයා ආවේය\" යි. \"භවත් ගෞතමයන් වහන්ස, අම්බට්ඨ මානවකයා සමඟ යම් කථා සල්ලාපයක් සිදු වී ද?\" යි. \"බ්‍රාහ්මණය, අම්බට්ඨ මානවකයා සමඟ මට යම් කථා සල්ලාපයක් සිදු විය\" යි. \"භවත් ගෞතමයන් වහන්ස, අම්බට්ඨ මානවකයා සමඟ ඔබට කථා සල්ලාපය සිදු වූයේ කෙසේද?\" යි. එවිට භාග්‍යවතුන් වහන්සේ අම්බට්ඨ මානවකයා සමඟ යම් පමණ කථා සල්ලාපයක් සිදු වී ද, ඒ සියල්ල පොක්ඛරසාති බ්‍රාහ්මණයාට දැනුම් දුන් සේක. මෙසේ පැවසූ කල්හි, පොක්ඛරසාති බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: \"භවත් ගෞතමයන් වහන්ස, අම්බට්ඨ මානවකයා බාලයෙකි. භවත් ගෞතමයන් වහන්සේ අම්බට්ඨ මානවකයාට ක්ෂමා කරත්වා!\" \"බ්‍රාහ්මණය, අම්බට්ඨ මානවකයා සුවපත් වේවා!\" යි.",
      "paliTitle": ""
    },
    {
      "number": 294,
      "pali": "Atha kho brāhmaṇo pokkharasāti bhagavato kāye dvattiṃsamahāpurisalakkhaṇāni samannesi. Addasā kho brāhmaṇo pokkharasāti bhagavato kāye dvattiṃsamahāpurisalakkhaṇāni yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati – kosohite ca vatthaguyhe pahūtajivhatāya ca.",
      "english": "Then the brahmin Pokkharasāti examined the thirty-two marks of a Great Man on the Blessed One's body. The brahmin Pokkharasāti indeed observed on the Blessed One's body most of the thirty-two marks of a Great Man, except for two. Regarding these two great marks, he was doubtful, uncertain, unconvinced, and lacked confidence: namely, the private parts being retracted into a sheath and the very long tongue.",
      "sinhala": "එවිට පොක්ඛරසාති බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේගේ ශරීරයෙහි ද්වාත්‍රිංශ මහා පුරිස ලක්ෂණ පරීක්ෂා කළේය. පොක්ඛරසාති බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේගේ ශරීරයෙහි බොහෝ දුරට දෙකක් හැර සෙසු ද්වාත්‍රිංශ මහා පුරිස ලක්ෂණ දුටුවේය. මහා පුරිස ලක්ෂණ දෙකක් සම්බන්ධයෙන් ඔහු සැක කළේය, විමතියට පත් විය, අධිමුක්ත නොවීය, පැහැදුණේ නැත; එනම්, කෝෂයෙන් වැසුණු වස්ති ගුහ්‍යය සහ දිගු දිව යන මේවා සම්බන්ධයෙනි.",
      "paliTitle": ""
    },
    {
      "number": 295,
      "pali": "Atha kho bhagavato etadahosi – ‘‘passati kho me ayaṃ brāhmaṇo pokkharasāti dvattiṃsamahāpurisalakkhaṇāni yebhuyyena ṭhapetvā dve. Dvīsu mahāpurisalakkhaṇesu kaṅkhati vicikicchati nādhimuccati na sampasīdati – kosohite ca vatthaguyhe, pahūtajivhatāya cā’’ti. Atha kho bhagavā tathārūpaṃ iddhābhisaṅkhāraṃ abhisaṅkhāsi yathā addasa brāhmaṇo pokkharasāti bhagavato kosohitaṃ vatthaguyhaṃ. Atha kho bhagavā jivhaṃ ninnāmetvā ubhopi kaṇṇasotāni anumasi paṭimasi, ubhopi nāsikasotāni anumasi paṭimasi, kevalampi nalāṭamaṇḍalaṃ jivhāya chādesi.",
      "english": "Then it occurred to the Blessed One: \"This brahmin Pokkharasāti sees most of the thirty-two marks of a Great Man, with the exception of two. He doubts and is uncertain about two of the marks of a Great Man; he does not assent to them and is not satisfied regarding them – namely, the retractable male organ and the abundant tongue.\" Then the Blessed One performed such a feat of psychic power that the brahmin Pokkharasāti saw the retractable male organ of the Blessed One. Then the Blessed One extended his tongue and touched and massaged both ear-canals, touched and massaged both nostril-canals, and completely covered his forehead with his tongue.",
      "sinhala": "එවිට භාග්‍යවතුන්ට මේ අදහස ඇතිවිය – \"මෙම පොක්ඛරසාති බ්‍රාහ්මණයා, දෙකක් හැර අන් බොහෝ දුරට මගේ මහාපුරිස ලක්ෂණ තිස්දෙක දකියි. මහපුරිස ලක්ෂණ දෙකක් ගැන ඔහු සැක කරයි, විමතියට පත්වේ, අධිෂ්ඨාන නොකරයි, පැහැදීමක් ඇති නොවේ – ඒ කෝෂගත වස්තිගුය්හය සහ ප්‍රභූත දිව යන ලක්ෂණ දෙකයි.\" එවිට භාග්‍යවතුන් වහන්සේ, පොක්ඛරසාති බ්‍රාහ්මණයාට භාග්‍යවතුන් වහන්සේගේ කෝෂගත වස්තිගුය්හය දැක්වෙන පරිදි එබඳු ඍද්ධි අභිසංඛාරයක් සිදුකළ සේක. ඉක්බිති භාග්‍යවතුන් වහන්සේ දිව එළියට දිගුකොට කන්සිදුරු දෙකම ආවර්ජනය කර පිරිමැද්ද සේක, නාසාසිදුරු දෙකම ආවර්ජනය කර පිරිමැද්ද සේක, මුළු නළල්තලයම දිවෙන් වසාගත්තා සේක.",
      "paliTitle": ""
    },
    {
      "number": 296,
      "pali": "Atha kho brāhmaṇassa pokkharasātissa etadahosi – ‘‘samannāgato kho samaṇo gotamo dvattiṃsamahāpurisalakkhaṇehi paripuṇṇehi no aparipuṇṇehī’’ti. Bhagavantaṃ etadavoca – ‘‘adhivāsetu me bhavaṃ gotamo ajjatanāya bhattaṃ saddhiṃ bhikkhusaṅghenā’’ti. Adhivāsesi bhagavā tuṇhībhāvena.",
      "english": "Then the thought occurred to the brahman Pokkharasāti: 'The ascetic Gotama is truly fully endowed with the thirty-two marks of a Great Man, complete in every respect and lacking nothing.' He then said to the Blessed One: 'May the Venerable Gotama consent to accept a meal from me for today, together with the community of monks.' The Blessed One consented by his silence.",
      "sinhala": "එවිට පොක්ඛරසාති බ්‍රාහ්මණයාට මෙසේ සිතුණි: “ශ්‍රමණ ගෞතමයන් වහන්සේ තිස්දෙමහා පුරුෂ ලක්ෂණයන්ගෙන් සම්පූර්ණයෙන්ම යුක්ත වන සේක, අසම්පූර්ණ නොවන සේක.”\n\nභාග්‍යවතුන් වහන්සේට ඔහු මෙසේ කීවේය: “ගෞතම භවත් අරහතුන් වහන්ස, අද දවසේ භික්ෂු සංඝයා සමඟ මාගේ දානය පිළිගන්නා සේක්වා.” භාග්‍යවතුන් වහන්සේ නිහඬවම එය අධිවාසනය කළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 297,
      "pali": "Atha kho brāhmaṇo pokkharasāti bhagavato adhivāsanaṃ viditvā bhagavato kālaṃ ārocesi – ‘‘kālo, bho gotama, niṭṭhitaṃ bhatta’’nti. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya saddhiṃ bhikkhusaṅghena yena brāhmaṇassa pokkharasātissa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho brāhmaṇo pokkharasāti bhagavantaṃ paṇītena khādanīyena bhojanīyena sahatthā santappesi sampavāresi, māṇavakāpi bhikkhusaṅghaṃ. Atha kho brāhmaṇo pokkharasāti bhagavantaṃ bhuttāviṃ onītapattapāṇiṃ aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi.",
      "english": "Then, the brahman Pokkharasāti, having understood the Blessed One’s acceptance, announced the time to the Blessed One, saying, \"It is time, good Gotama, the meal is ready.\"\n\nThen, the Blessed One, having dressed in the morning, taking his bowl and robe, went with the Sangha of bhikkhus to the dwelling of the brahman Pokkharasāti; and having arrived, he sat down on the prepared seat.\n\nThen, the brahman Pokkharasāti personally served and satisfied the Blessed One with delicious hard and soft foods, and the young men served the Sangha of bhikkhus.\n\nThen, the brahman Pokkharasāti, when the Blessed One had eaten and removed his hand from the bowl, took a lower seat and sat down to one side.",
      "sinhala": "ඉන්පසු පොක්ඛරසාති බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේගේ අධිවාසනය දැන, භාග්‍යවතුන් වහන්සේට වේලාව සැළකළේය – \"භවත් ගෞතමයන් වහන්ස, වේලාවයි, දානය සූදානම්ය\" කියා.\n\nඉන්පසු භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු රැගෙන භික්ෂු සංඝයා සමඟ පොක්ඛරසාති බ්‍රාහ්මණයාගේ නිවස වෙත වැඩම කළ සේක; වැඩම කොට පනවන ලද ආසනයක වැඩ සිටි සේක.\n\nඉන්පසු පොක්ඛරසාති බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට ප්‍රණීත වූ කැවිලි කෑමෙන් හා භෝජන කෑමෙන් තම අතින් සතුටු කර පිරිනැමුවේය, මානවකයෝ ද භික්ෂු සංඝයාට එසේ කළහ.\n\nඉන්පසු පොක්ඛරසාති බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ දානය වළඳා, පාත්‍රයෙන් අත් ඉවත් කළ පසු, වෙනත් පහත් ආසනයක් ගෙන එකත්පසෙක වාඩි විය.",
      "paliTitle": ""
    },
    {
      "number": 298,
      "pali": "Ekamantaṃ nisinnassa kho brāhmaṇassa pokkharasātissa bhagavā anupubbiṃ kathaṃ kathesi, seyyathidaṃ – dānakathaṃ sīlakathaṃ saggakathaṃ; kāmānaṃ ādīnavaṃ okāraṃ saṃkilesaṃ, nekkhamme ānisaṃsaṃ pakāsesi. Yadā bhagavā aññāsi brāhmaṇaṃ pokkharasātiṃ kallacittaṃ muducittaṃ vinīvaraṇacittaṃ udaggacittaṃ pasannacittaṃ, atha yā buddhānaṃ sāmukkaṃsikā dhammadesanā, taṃ pakāsesi – dukkhaṃ samudayaṃ nirodhaṃ maggaṃ. Seyyathāpi nāma suddhaṃ vatthaṃ apagatakāḷakaṃ sammadeva rajanaṃ paṭiggaṇheyya; evameva brāhmaṇassa pokkharasātissa tasmiññeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ udapādi – ‘‘yaṃ kiñci samudayadhammaṃ, sabbaṃ taṃ nirodhadhamma’’nti. ",
      "english": "To the brahmin Pokkharasāti, who was sitting to one side, the Fortunate One delivered a gradual discourse, namely: a discourse on generosity, a discourse on morality, a discourse on heaven. He explained the danger, degradation, and defilement of sensual pleasures, and the benefit of renunciation. When the Fortunate One perceived that the brahmin Pokkharasāti's mind was ready, pliant, free from hindrances, uplifted, and confident, then He expounded the special teaching of the Buddhas: suffering, its origin, its cessation, and the path. Just as a clean cloth, free from stains, would perfectly absorb dye, even so, for the brahmin Pokkharasāti, right on that very seat, the dust-free, stain-free Eye of Dhamma arose – whatever is subject to arising is subject to cessation.",
      "sinhala": "එක් පසෙක වාඩි වී සිටි පොක්ඛරසාති බමුණාට, භාග්‍යවතුන් වහන්සේ අනුපිළිවෙළින් කථාවක් දේශනා කළ සේක; එනම් දාන කථාව, සීල කථාව, ස්වර්ග කථාවයි. කාමයන්හි ආදීනවය, පහත් බව, කෙලෙස් සහිත බව මෙන්ම, නෛෂ්ක්‍රම්‍යයෙහි ආනිසංසයද ප්‍රකාශ කළ සේක. භාග්‍යවතුන් වහන්සේ යම් කලක පොක්ඛරසාති බමුණාගේ සිත සකස් වූ බවත්, මෘදු වූ බවත්, නීවරණ රහිත බවත්, උද්ගත වූ බවත්, පැහැදුණු බවත් දැනගත් සේකද, එවිට බුදුවරයන් වහන්සේලාගේ උතුම් වූ ධර්ම දේශනාව, එනම් දුක්ඛය, සමුදය, නිරෝධය, මාර්ගය උන්වහන්සේ දේශනා කළ සේක. යම් සේ කළු පැහැය දුරු වූ පිරිසිදු වස්ත්‍රයක් මනා කොටම සායම් පිළිගනී ද, එලෙසින්ම පොක්ඛරසාති බමුණාට එම ආසනයේම “හේතු ප්‍රත්‍යයෙන් හටගන්නා යම් කිසිවක් වේද, ඒ සියල්ල නිරුද්ධ වන ස්වභාව ඇත්තේය” යනුවෙන් කෙලෙස් රහිත වූ, මල රහිත වූ ධර්ම චක්ෂුව පහළ විය.",
      "paliTitle": ""
    },
    {
      "number": 299,
      "pali": "Atha kho brāhmaṇo pokkharasāti diṭṭhadhammo pattadhammo viditadhammo pariyogāḷhadhammo tiṇṇavicikiccho vigatakathaṃkatho vesārajjappatto aparappaccayo satthusāsane bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bho gotama, abhikkantaṃ, bho gotama. Seyyathāpi, bho gotama, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya, ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ, bho gotama, saputto sabhariyo sapariso sāmacco bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gataṃ. Yathā ca bhavaṃ gotamo ukkaṭṭhāya aññāni upāsakakulāni upasaṅkamati, evameva bhavaṃ gotamo pokkharasātikulaṃ upasaṅkamatu. Tattha ye te māṇavakā vā māṇavikā vā bhavantaṃ gotamaṃ abhivādessanti vā paccuṭṭhissanti [paccuṭṭhassanti (pī.)] vā āsanaṃ vā udakaṃ vā dassanti cittaṃ vā pasādessanti, tesaṃ taṃ bhavissati dīgharattaṃ hitāya sukhāyā’’ti. ‘‘Kalyāṇaṃ vuccati, brāhmaṇā’’ti.",
      "english": "Then the Brahmin Pokkharasāti, who had seen, attained, understood, and deeply penetrated the Dhamma, who had transcended doubt, whose perplexity had vanished, who had attained confidence, and who was independent of others regarding the Teacher’s Dispensation, said this to the Blessed One: \"Excellent, venerable Gotama, excellent, venerable Gotama! Just as, venerable Gotama, one might right what was overturned, or reveal what was concealed, or point out the path to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms — in the very same way, the Dhamma has been made clear by the venerable Gotama in many ways. I, venerable Gotama, along with my son, wife, retinue, and ministers, go for refuge to the venerable Gotama, to the Dhamma, and to the Sangha of monks. May the venerable Gotama remember me as a lay follower who has gone for refuge from this day forward, as long as life lasts. And just as the venerable Gotama visits other families of lay followers in Ukkaṭṭhā, in the very same way, may the venerable Gotama visit Pokkharasāti's family. There, whatever young men or young women pay homage to the venerable Gotama, or rise to greet him, or offer a seat or water, or gladden their minds with faith, for them, that will be for their long-term welfare and happiness.\" \"It is well said, Brahmin.\"",
      "sinhala": "එවිට පොක්ඛරසාති බමුණා ධර්මය දැක, ලබා, දැනගෙන, අවබෝධ කරගෙන, සැකයෙන් එතෙර වී, විචිකිච්ඡාව පහව ගොස්, විශාරද බවට පැමිණ, ශාස්තෘන් වහන්සේගේ ශාසනයෙහි අනුන් කෙරෙහි රඳා නොපවතින අයෙකු බවට පත්වී භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: ‘‘ඉතා යහපති, භවත් ගෞතමයන් වහන්ස, ඉතා යහපති, භවත් ගෞතමයන් වහන්ස. භවත් ගෞතමයන් වහන්ස, යටිකුරු කළ දෙයක් යළි උඩුකුරු කරන්නාක් මෙන්ද, වසා තිබූ දෙයක් විවෘත කරන්නාක් මෙන්ද, මග මුළා වූවෙකුට මග පෙන්වන්නාක් මෙන්ද, ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යි අඳුරෙහි තෙල් පහනක් දල්වන්නාක් මෙන්ද, භවත් ගෞතමයන් වහන්සේ විසින්ද මෙපරිද්දෙන්ම නොයෙක් ආකාරයෙන් ධර්මය ප්‍රකාශ කරන ලදී. භවත් ගෞතමයන් වහන්ස, මම දැන් පුත්‍රයන් සමඟින්, භාර්යාව සමඟින්, පිරිස සමඟින්, අමාත්‍යවරුන් සමඟින් භවත් ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. භවත් ගෞතමයන් වහන්ස, අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා පිළිගන්නා සේක්වා. භවත් ගෞතමයන් වහන්සේ උක්කටා නුවර අනෙකුත් උපාසක කුලවලට වඩිනා සේක්ද, එසේම භවත් ගෞතමයන් වහන්සේ පොක්ඛරසාතිගේ කුලයටද වඩිනා සේක්වා. එහිදී යම් මානවකයෝ හෝ මානවිකාවෝ භවත් ගෞතමයන් වහන්සේට වන්දනා කරත්ද, හෝ නැගිට පිළිගනිත්ද, හෝ ආසනයක් හෝ පැන් හෝ දෙත්ද, හෝ සිත පහදවා ගනිත්ද, ඔවුන්ට එය බොහෝ කලක් හිත පිණිසත්, සැප පිණිසත් වන්නේය.’’ ‘‘යහපත්ය, බමුණ!’’",
      "paliTitle": "Pokkharasātiupāsakattapaṭivedanā",
      "englishTitle": "Pokkharasāti's Lay Followership Report",
      "sinhalaTitle": "පොක‍්ඛරසාති උපාසක ප‍්‍රතිවේදනය"
    }
  ],
  "footer": {
    "pali": "Ambaṭṭhasuttaṃ niṭṭhitaṃ tatiyaṃ.",
    "english": "End of the Third Ambaṭṭha Sutta",
    "sinhala": "තෙවන අම්බට්ඨ සූත්‍රය නිමයි."
  }
}