{
  "id": "dn.1.9",
  "title": {
    "pali": "Poṭṭhapādasuttaṃ",
    "english": "The Poṭṭhapāda Sutta",
    "sinhala": "පොට්ඨපාද සූත‍්‍රය"
  },
  "sections": [
    {
      "number": 406,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena poṭṭhapādo paribbājako samayappavādake tindukācīre ekasālake mallikāya ārāme paṭivasati mahatiyā paribbājakaparisāya saddhiṃ tiṃsamattehi paribbājakasatehi. Atha kho bhagavā pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya sāvatthiṃ piṇḍāya pāvisi.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling at Savatthi, in Jeta's Grove, Anathapindika's monastery. Now at that time, Potthapada the wanderer was staying at Mallika's monastery, in the Tinduka Park, in the single-chambered hall, with proponents of various doctrines, accompanied by a large assembly of wanderers, as many as three hundred wanderers. Then, in the morning, having dressed and taken his bowl and robe, the Blessed One entered Savatthi for alms.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී.\n\nඑක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත් නුවර අනාථපිණ්ඩික සිටුහු විසින් කරවන ලද ජේතවනාරාමයෙහි වාසය කරන සේක.\n\nඒ වන විට පොට්ඨපාද නම් පරිබ්‍රාජක තෙම, තමාගේ දෘෂ්ටිය ප්‍රකාශ කරන (විවාද කරන) ස්ථානයක් වූ, තිඹිරිගස් කැලෑවක් අසල වූ, තනි මැදිරි ගෘහයක් සහිත මල්ලිකා අරමෙහි, තුන්සියයකට අධික වූ පරිබ්‍රාජකයන්ගෙන් සමන්විත මහත් පරිබ්‍රාජක පිරිසක් සමඟ වාසය කරයි.\n\nඑවිට භාග්‍යවතුන් වහන්සේ පෙරවරුවේ සිවුරු හැඳ, පාත්‍ර සිවුරු ද රැගෙන, සැවැත් නුවරට පිඬු සිඟා වදාළ සේක.",
      "paliTitle": "Poṭṭhapādaparibbājakavatthu",
      "englishTitle": "Story of Poṭṭhapāda the Wanderer",
      "sinhalaTitle": "පෝට්ඨපාද පරිබ්‍රාජක වස්තුව"
    },
    {
      "number": 407,
      "pali": "Atha kho bhagavato etadahosi – ‘‘atippago kho tāva sāvatthiyaṃ piṇḍāya carituṃ. Yaṃnūnāhaṃ yena samayappavādako tindukācīro ekasālako mallikāya ārāmo, yena poṭṭhapādo paribbājako tenupasaṅkameyya’’nti. Atha kho bhagavā yena samayappavādako tindukācīro ekasālako mallikāya ārāmo tenupasaṅkami.",
      "english": "Then it occurred to the Blessed One: \"It is still too early to go for alms in Sāvatthī. What if I were to approach the wandering ascetic Poṭṭhapāda, who is at Mallikā's single-hall park called Tindukācīra, the Hall of Discussions?\" Then the Blessed One approached the wandering ascetic Poṭṭhapāda at Mallikā's single-hall park called Tindukācīra, the Hall of Discussions.",
      "sinhala": "එවිට භාග්‍යවතුන්‍ වහන්සේට මෙසේ සිතුණි – ‘‘දැන් ශ්‍රාවස්තියට පිණ්ඩපාතය සඳහා වැඩීමට ඉතා ඉක්මන් වැඩියි. යම් හෙයකින් මම සමයවාදීන් රැස්වන, තින්දූකාචීර නම් වූ, එක් ශාලාවක් ඇති මල්ලිකාගේ ආරාමයට, පොට්ඨපාද පරිබ්‍රාජකයා සිටින තැනට යන්නෙම් නම් කෙසේදැයි’’\n\nඑවිට භාග්‍යවතුන්‍ වහන්සේ සමයවාදීන් රැස්වන, තින්දූකාචීර නම් වූ, එක් ශාලාවක් ඇති මල්ලිකාගේ ආරාමය වෙත වැඩම කළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 408,
      "pali": "Tena kho pana samayena poṭṭhapādo paribbājako mahatiyā paribbājakaparisāya saddhiṃ nisinno hoti unnādiniyā uccāsaddamahāsaddāya anekavihitaṃ tiracchānakathaṃ kathentiyā. Seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ yānakathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ itibhavābhavakathaṃ iti vā.",
      "english": "At that time, Poṭṭhapāda the wanderer was seated with a large assembly of wanderers, making a noisy, loud, great clamor, engaging in various kinds of idle chatter. That is to say: talk of kings, talk of robbers, talk of ministers, talk of armies, talk of dangers, talk of wars, talk of food, talk of drink, talk of clothes, talk of beds, talk of garlands, talk of perfumes, talk of relatives, talk of vehicles, talk of villages, talk of market towns, talk of cities, talk of countries, talk of women, talk of heroes, talk of streets, talk of watering places, talk of the departed, talk of various topics, talk about the world, talk about the sea, and talk about existence and non-existence.",
      "sinhala": "එකල පොට්ඨපාද පරිබ්‍රාජකයා මහත් පරිබ්‍රාජක පිරිසක් සමඟ වාඩි වී සිටියේ ඝෝෂාකාරීව, මහත් ශබ්ද නගමින්, නොයෙකුත් තිරිසන් කථා කරමිනි. ඒවා නම්: රජවරුන් පිළිබඳ කථා, සොරුන් පිළිබඳ කථා, මහමාත්‍යවරුන් පිළිබඳ කථා, සේනා පිළිබඳ කථා, භය පිළිබඳ කථා, යුද්ධ පිළිබඳ කථා, ආහාර පිළිබඳ කථා, පාන වර්ග පිළිබඳ කථා, වස්‍ත්‍ර පිළිබඳ කථා, ශයන පිළිබඳ කථා, මල්මාලා පිළිබඳ කථා, සුවඳ විලවුන් පිළිබඳ කථා, ඥාතීන් පිළිබඳ කථා, යානවාහන පිළිබඳ කථා, ගම් පිළිබඳ කථා, නිගම් පිළිබඳ කථා, නගර පිළිබඳ කථා, ජනපද පිළිබඳ කථා, ස්‍ත්‍රීන් පිළිබඳ කථා, වීරයන් පිළිබඳ කථා, වීථි පිළිබඳ කථා, කඩමණ්ඩි පිළිබඳ කථා, මියගිය ඥාතීන් (ප්‍රේතයන්) පිළිබඳ කථා, නානාවිධ කථා, ලෝකය පිළිබඳ කථා, සාගරය පිළිබඳ කථා, භවය හා අභවය පිළිබඳ කථා යනාදියයි.",
      "paliTitle": ""
    },
    {
      "number": 409,
      "pali": "Addasā kho poṭṭhapādo paribbājako bhagavantaṃ dūratova āgacchantaṃ; disvāna sakaṃ parisaṃ saṇṭhapesi – ‘‘appasaddā bhonto hontu, mā bhonto saddamakattha. Ayaṃ samaṇo gotamo āgacchati. Appasaddakāmo kho so āyasmā appasaddassa vaṇṇavādī. Appeva nāma appasaddaṃ parisaṃ viditvā upasaṅkamitabbaṃ maññeyyā’’ti. Evaṃ vutte te paribbājakā tuṇhī ahesuṃ.",
      "english": "Potthapada the wanderer saw the Blessed One approaching from afar. Upon seeing him, he instructed his own assembly: \"Venerable sirs, be quiet! Gentlemen, do not make any noise. This ascetic Gotama is approaching. Indeed, that venerable one is fond of quietness and praises quietness. Perhaps, seeing a quiet assembly, he might consider it worthwhile to approach.\"\n\nWhen this was said, those wanderers became silent.",
      "sinhala": "එවිට පොට්ඨපාද පරිබ්‍රාජක තෙමේ භාග්‍යවතුන් වහන්සේ දුරින් වඩිනා බව දුටුවේය. එය දැක තම පිරිස සන්සුන් කොට, “ඇවැත්නි, නිශ්ශබ්ද වව්. ඇවැත්නි, ශබ්ද නොකරව්. මේ ශ්‍රමණ ගෞතමයන් වහන්සේ වඩින සේක. ඒ ආයුෂ්මත් තෙමේ නිශ්ශබ්දතාවයට කැමැත්තෙක් වන සේක. නිශ්ශබ්දතාවය වර්ණනා කරන සේක. සමහර විට නිශ්ශබ්ද පිරිසක් බව දැන අප වෙත එළඹෙන්නේ යැයි සිතාවි” යැයි කීවේය. මෙසේ කී කල්හි ඒ පරිබ්‍රාජකයෝ නිශ්ශබ්ද වූහ.",
      "paliTitle": ""
    },
    {
      "number": 410,
      "pali": "Atha kho bhagavā yena poṭṭhapādo paribbājako tenupasaṅkami. Atha kho poṭṭhapādo paribbājako bhagavantaṃ etadavoca – ‘‘etu kho, bhante, bhagavā. Svāgataṃ, bhante, bhagavato. Cirassaṃ kho, bhante, bhagavā imaṃ pariyāyamakāsi, yadidaṃ idhāgamanāya. Nisīdatu, bhante, bhagavā, idaṃ āsanaṃ paññatta’’nti. Nisīdi bhagavā paññatte āsane. Poṭṭhapādopi kho paribbājako aññataraṃ nīcaṃ āsanaṃ gahetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho poṭṭhapādaṃ paribbājakaṃ bhagavā etadavoca – ‘‘kāya nuttha [kāya nottha (syā. ka.)], poṭṭhapāda, etarahi kathāya sannisinnā, kā ca pana vo antarākathā vippakatā’’ti?",
      "english": "Then the Blessed One approached where Poṭṭhapāda the wanderer was. Then Poṭṭhapāda the wanderer said this to the Blessed One: “Please come, Venerable Sir, Blessed One. Welcome, Venerable Sir. It has been a long time, Venerable Sir, since the Blessed One has taken the opportunity to come here. Please sit down, Venerable Sir, Blessed One, this seat is prepared.” The Blessed One sat down on the prepared seat. And Poṭṭhapāda the wanderer, taking a certain low seat, sat down to one side. To Poṭṭhapāda the wanderer, who had sat down to one side, the Blessed One said this: “With what kind of talk, Poṭṭhapāda, are you presently gathered, and what was the conversation among you that was interrupted?”",
      "sinhala": "එවිට භාග්‍යවතුන් වහන්සේ පොට්ඨපාද පරිබ්‍රාජකයා සිටි තැනට එළඹි සේක. එවිට පොට්ඨපාද පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"වහන්ස, භාග්‍යවතුන් වහන්සේ එනු මැනවි. වහන්ස, භාග්‍යවතුන් වහන්සේගේ පැමිණීම සුගමනයකි. වහන්ස, භාග්‍යවතුන් වහන්සේ මෙහි වැඩම කළේ බොහෝ කලකට පසුවය. වහන්ස, භාග්‍යවතුන් වහන්සේ වාඩි වන සේක්වා, මේ ආසනය පනවා ඇත.\"\n\nභාග්‍යවතුන් වහන්සේ පනවන ලද අසුනෙහි වැඩසිටි සේක. පොට්ඨපාද පරිබ්‍රාජකයාද වෙනත් පහත් අසුනක් ගෙන එකත්පස්ව වාඩිවිය. එකත්පස්ව වාඩි වී සිටි පොට්ඨපාද පරිබ්‍රාජකයාට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"පොට්ඨපාදය, මේ වන විට ඔබලා කුමක් පිළිබඳ කථාවකින්ද රැස්ව සිටියේ? ඔබලාගේ අතරමග නතර කළ කථාව කුමක්ද?\"",
      "paliTitle": ""
    },
    {
      "number": 411,
      "pali": "Evaṃ vutte poṭṭhapādo paribbājako bhagavantaṃ etadavoca – ‘‘tiṭṭhatesā, bhante, kathā, yāya mayaṃ etarahi kathāya sannisinnā. Nesā, bhante, kathā bhagavato dullabhā bhavissati pacchāpi savanāya. Purimāni, bhante, divasāni purimatarāni, nānātitthiyānaṃ samaṇabrāhmaṇānaṃ kotūhalasālāya sannisinnānaṃ sannipatitānaṃ abhisaññānirodhe kathā udapādi – ‘kathaṃ nu kho, bho, abhisaññānirodho hotī’ti? Tatrekacce evamāhaṃsu – ‘ahetū appaccayā purisassa saññā uppajjantipi nirujjhantipi. Yasmiṃ samaye uppajjanti, saññī tasmiṃ samaye hoti. Yasmiṃ samaye nirujjhanti, asaññī tasmiṃ samaye hotī’ti. Ittheke abhisaññānirodhaṃ paññapenti. ‘‘Tamañño evamāha – ‘na kho pana metaṃ [na kho nāmetaṃ (sī. pī.)], bho, evaṃ bhavissati. Saññā hi, bho, purisassa attā. Sā ca kho upetipi apetipi. Yasmiṃ samaye upeti, saññī tasmiṃ samaye hoti. Yasmiṃ samaye apeti, asaññī tasmiṃ samaye hotī’ti. Ittheke abhisaññānirodhaṃ paññapenti. ‘‘Tamañño evamāha – ‘na kho pana metaṃ, bho, evaṃ bhavissati. Santi hi, bho, samaṇabrāhmaṇā mahiddhikā mahānubhāvā. Te imassa purisassa saññaṃ upakaḍḍhantipi apakaḍḍhantipi. Yasmiṃ samaye upakaḍḍhanti, saññī tasmiṃ samaye hoti. Yasmiṃ samaye apakaḍḍhanti, asaññī tasmiṃ samaye hotī’ti. Ittheke abhisaññānirodhaṃ paññapenti. ‘‘Tamañño evamāha – ‘na kho pana metaṃ, bho, evaṃ bhavissati. Santi hi, bho, devatā mahiddhikā mahānubhāvā. Tā imassa purisassa saññaṃ upakaḍḍhantipi apakaḍḍhantipi. Yasmiṃ samaye upakaḍḍhanti, saññī tasmiṃ samaye hoti. Yasmiṃ samaye apakaḍḍhanti, asaññī tasmiṃ samaye hotī’ti. Ittheke abhisaññānirodhaṃ paññapenti. ‘‘Tassa mayhaṃ, bhante, bhagavantaṃyeva ārabbha sati udapādi – ‘aho nūna bhagavā, aho nūna sugato, yo imesaṃ dhammānaṃ sukusalo’ti. Bhagavā, bhante, kusalo, bhagavā pakataññū abhisaññānirodhassa. Kathaṃ nu kho, bhante, abhisaññānirodho hotī’’ti?",
      "english": "Thus spoken, Poṭṭhapāda the wanderer said this to the Blessed One: \"Venerable sir, let this discussion we are presently engaged in remain. This discussion will not be difficult for the Blessed One to hear later either. Venerable sir, in earlier days, even earlier than these, while various ascetics and brahmins of other sects were sitting together assembled in the debating hall, a discussion arose concerning the cessation of higher perception: 'How, friends, does the cessation of higher perception occur?' Therein some said: 'A person's perception arises and ceases without cause or condition. When it arises, at that time one is percipient. When it ceases, at that time one is non-percipient.' In this way, some explained the cessation of higher perception.\n\n\"Another said to him: 'No, friends, it cannot be so. For perception, friends, is a person's self. It comes and goes. When it comes, at that time one is percipient. When it goes, at that time one is non-percipient.' In this way, some explained the cessation of higher perception.\n\n\"Another said to him: 'No, friends, it cannot be so. For there are, friends, ascetics and brahmins of great power and great influence. They draw forth or repel this person's perception. When they draw it forth, at that time one is percipient. When they repel it, at that time one is non-percipient.' In this way, some explained the cessation of higher perception.\n\n\"Another said to him: 'No, friends, it cannot be so. For there are, friends, deities of great power and great influence. They draw forth or repel this person's perception. When they draw it forth, at that time one is percipient. When they repel it, at that time one is non-percipient.' In this way, some explained the cessation of higher perception.\n\n\"Venerable sir, it occurred to me then, concerning the Blessed One himself: 'Oh, indeed, the Blessed One! Oh, indeed, the Fortunate One, who is so skilled in these things!' The Blessed One, venerable sir, is skilled, the Blessed One is the knower of the cessation of higher perception. How, then, venerable sir, does the cessation of higher perception occur?\"",
      "sinhala": "මෙසේ පැවසූ කල්හි පොට්ඨපාද පරිබ්‍රාජක තෙමේ භාග්‍යවතුන් වහන්සේට මෙය පැවසුවේය: “ස්වාමීනී, දැන් අපි කතා කරමින් සිටින මේ කතාව පසුවට තබමු. ස්වාමීනී, භාග්‍යවතුන් වහන්සේට මේ කතාව පසුව ශ්‍රවණය කිරීමට අපහසු නොවනු ඇත. ස්වාමීනී, මීට පෙර දිනවලදී, ඊටත් පෙර දිනවලදී, නානාවිධ තීර්ථක ශ්‍රමණ​්‍​යෝ සහ බ්‍රාහ්මණයින් කුතුහල ශාලාවේ වාඩි වී සිටිමින් රැස්ව සිටින විට ‘ඇවැත්නි, අභිසංඥා නිරෝධය (සංඥා නැවැත්වීම) සිදු වන්නේ කෙසේද?’ යනුවෙන් අභිසංඥා නිරෝධය පිළිබඳ කතාවක් ඇති විය.\n\n“එහි ඇතැම් අය මෙසේ කීහ: ‘ඇවැත්නි, හේතු ප්‍රත්‍ය රහිතවම පුද්ගලයාගේ සංඥාව උපදිනවාද නැතිව යනවාද. යම් කලෙක (සංඥා) උපදින්නේද, ඒ කලෙක සංඥා ඇති අයෙක් වේ. යම් කලෙක (සංඥා) නැතිව යන්නේද, ඒ කලෙක සංඥා නැති අයෙක් වේ.’ මෙසේ ඇතැම් අය අභිසංඥා නිරෝධය ප්‍රකාශ කරති.\n\n“තව අයෙක් ඔහුට මෙසේ කීවේය: ‘ඇවැත්නි, මේ එසේ සිදු වන්නේ නැත. සැබවින්ම සංඥාව යනු පුද්ගලයාගේ ආත්මයයි. එය පැමිණෙයිද, ඉවත්ව යයිද. යම් කලෙක (සංඥා) පැමිණෙයිද, ඒ කලෙක සංඥා ඇති අයෙක් වේ. යම් කලෙක (සංඥා) ඉවත්ව යයිද, ඒ කලෙක සංඥා නැති අයෙක් වේ.’ මෙසේ ඇතැම් අය අභිසංඥා නිරෝධය ප්‍රකාශ කරති.\n\n“තව අයෙක් ඔහුට මෙසේ කීවේය: ‘ඇවැත්නි, මේ එසේ සිදු වන්නේ නැත. ඇවැත්නි, මහත් ඍද්ධි ඇති, මහත් ආනුභාව ඇති ශ්‍රමණ​්‍​යෝද බ්‍රාහ්මණයෝද සිටිති. ඔවුහු මේ පුද්ගලයාගේ සංඥාව ළං කරවතිද, ඉවත් කරවතිද. යම් කලෙක (සංඥා) ළං කරවන්නේද, ඒ කලෙක සංඥා ඇති අයෙක් වේ. යම් කලෙක (සංඥා) ඉවත් කරවන්නේද, ඒ කලෙක සංඥා නැති අයෙක් වේ.’ මෙසේ ඇතැම් අය අභිසංඥා නිරෝධය ප්‍රකාශ කරති.\n\n“තව අයෙක් ඔහුට මෙසේ කීවේය: ‘ඇවැත්නි, මේ එසේ සිදු වන්නේ නැත. ඇවැත්නි, මහත් ඍද්ධි ඇති, මහත් ආනුභාව ඇති දෙවිවරුද සිටිති. ඔවුහු මේ පුද්ගලයාගේ සංඥාව ළං කරවතිද, ඉවත් කරවතිද. යම් කලෙක (සංඥා) ළං කරවන්නේද, ඒ කලෙක සංඥා ඇති අයෙක් වේ. යම් කලෙක (සංඥා) ඉවත් කරවන්නේද, ඒ කලෙක සංඥා නැති අයෙක් වේ.’ මෙසේ ඇතැම් අය අභිසංඥා නිරෝධය ප්‍රකාශ කරති.\n\n“ස්වාමීනී, ඒ මට භාග්‍යවතුන් වහන්සේ අරඹයාම සිහිය පහළ විය: ‘අහෝ! භාග්‍යවතුන් වහන්සේ කෙතරම් නම් සුගත කෙනෙක්ද, යම් කෙනෙක් මේ ධර්මයන් පිළිබඳ මනාකොට දක්ෂ නම්.’ ස්වාමීනී, භාග්‍යවතුන් වහන්සේ දක්ෂය. භාග්‍යවතුන් වහන්සේ අභිසංඥා නිරෝධය පිළිබඳ මනාකොට දන්නා සේක. ස්වාමීනී, අභිසංඥා නිරෝධය සිදු වන්නේ කෙසේද?”",
      "paliTitle": "Abhisaññānirodhakathā",
      "englishTitle": "Discourse on the Cessation of Higher Perception",
      "sinhalaTitle": "අභිසඤ්ඤා නිරෝධ කථා"
    },
    {
      "number": 412,
      "pali": "‘‘Tatra, poṭṭhapāda, ye te samaṇabrāhmaṇā evamāhaṃsu – ‘ahetū appaccayā purisassa saññā uppajjantipi nirujjhantipī’ti, āditova tesaṃ aparaddhaṃ. Taṃ kissa hetu? Sahetū hi, poṭṭhapāda, sappaccayā purisassa saññā uppajjantipi nirujjhantipi. Sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati’’.",
      "english": "In that regard, Poṭṭhapāda, those ascetics and brahmins who claimed, ‘Perceptions for a person arise and cease without cause, without condition,’ have been mistaken from the very outset.\n\nWhy is that? Indeed, Poṭṭhapāda, perceptions for a person arise and cease with cause and with condition. Through training, one perception arises, and through training, one perception ceases.",
      "sinhala": "පොට්ඨපාද, එහිදී ‘පුද්ගලයාගේ සඤ්ඤාව අහේතුකව, අප්‍රත්‍යව උපදී ද, නිරුද්ධ වේ ද’ යැයි යම් ඒ ශ්‍රමණබ්‍රාහ්මණයෝ මෙසේ කීවාහු ද, ආරම්භයේදීම ඔවුනට වැරදී ඇත. ඒ කුමක් හෙයින් ද? පොට්ඨපාද, හේතු සහිතව, ප්‍රත්‍ය සහිතව ම පුද්ගලයාගේ සඤ්ඤාව උපදී ද, නිරුද්ධ වේ ද. සික්ඛාවෙන් එක් සඤ්ඤාවක් උපදී, සික්ඛාවෙන් එක් සඤ්ඤාවක් නිරුද්ධ වේ.",
      "paliTitle": "Sahetukasaññuppādanirodhakathā",
      "englishTitle": "Discourse on the Arising and Cessation of Conditioned Perception",
      "sinhalaTitle": "සාහේතුක සංඥා උප‍්පාද නිරෝධ කථා"
    },
    {
      "number": 413,
      "pali": "‘‘Kā ca sikkhā’’ti? Bhagavā avoca – ‘‘idha, poṭṭhapāda, tathāgato loke uppajjati arahaṃ, sammāsambuddho…pe… (yathā 190-212 anucchedesu, evaṃ vitthāretabbaṃ). Evaṃ kho, poṭṭhapāda, bhikkhu sīlasampanno hoti…pe… tassime pañcanīvaraṇe pahīne attani samanupassato pāmojjaṃ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyati. So vivicceva kāmehi, vivicca akusalehi dhammehi, savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Tassa yā purimā kāmasaññā, sā nirujjhati. Vivekajapītisukhasukhumasaccasaññā tasmiṃ samaye hoti, vivekajapītisukhasukhuma-saccasaññīyeva tasmiṃ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayaṃ sikkhā’’ti bhagavā avoca. ‘‘Puna caparaṃ, poṭṭhapāda, bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Tassa yā purimā vivekajapītisukhasukhumasaccasaññā, sā nirujjhati. Samādhijapītisukhasukhumasaccasaññā tasmiṃ samaye hoti, samādhijapītisukhasukhumasaccasaññīyeva tasmiṃ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā’’ti bhagavā avoca. ‘‘Puna caparaṃ, poṭṭhapāda, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘‘upekkhako satimā sukhavihārī’’ti, tatiyaṃ jhānaṃ upasampajja viharati. Tassa yā purimā samādhijapītisukhasukhumasaccasaññā, sā nirujjhati. Upekkhāsukhasukhumasaccasaññā tasmiṃ samaye hoti, upekkhāsukhasukhumasaccasaññīyeva tasmiṃ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā’’ti bhagavā avoca. ‘‘Puna caparaṃ, poṭṭhapāda, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Tassa yā purimā upekkhāsukhasukhumasaccasaññā, sā nirujjhati. Adukkhamasukhasukhumasaccasaññā tasmiṃ samaye hoti, adukkhamasukhasukhumasaccasaññīyeva tasmiṃ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā’’ti bhagavā avoca. ‘‘Puna caparaṃ, poṭṭhapāda, bhikkhu sabbaso rūpasaññānaṃ samatikkamā paṭighasaññānaṃ atthaṅgamā nānattasaññānaṃ amanasikārā ‘ananto ākāso’ti ākāsānañcāyatanaṃ upasampajja viharati. Tassa yā purimā rūpasaññā [purimasaññā (ka.)], sā nirujjhati. Ākāsānañcāyatanasukhumasaccasaññā tasmiṃ samaye hoti, ākāsānañcāyatanasukhumasaccasaññīyeva tasmiṃ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā’’ti bhagavā avoca. ‘‘Puna caparaṃ, poṭṭhapāda, bhikkhu sabbaso ākāsānañcāyatanaṃ samatikkamma ‘anantaṃ viññāṇa’nti viññāṇañcāyatanaṃ upasampajja viharati. Tassa yā purimā ākāsānañcāyatanasukhumasaccasaññā, sā nirujjhati. Viññāṇañcāyatanasukhumasaccasaññā tasmiṃ samaye hoti, viññāṇañcāyatanasukhumasaccasaññīyeva tasmiṃ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā’’ti bhagavā avoca. ‘‘Puna caparaṃ, poṭṭhapāda, bhikkhu sabbaso viññāṇañcāyatanaṃ samatikkamma ‘natthi kiñcī’ti ākiñcaññāyatanaṃ upasampajja viharati. Tassa yā purimā viññāṇañcāyatanasukhumasaccasaññā, sā nirujjhati. Ākiñcaññāyatanasukhumasaccasaññā tasmiṃ samaye hoti, ākiñcaññāyatanasukhumasaccasaññīyeva tasmiṃ samaye hoti. Evampi sikkhā ekā saññā uppajjati, sikkhā ekā saññā nirujjhati. Ayampi sikkhā’’ti bhagavā avoca.",
      "english": "“What is this training?” The Blessed One said, “Here, Poṭṭhapāda, a Tathāgata arises in the world, an Arahant, a Perfectly Self-Awakened One. Thus, Poṭṭhapāda, a monk becomes accomplished in virtue; perceiving in himself that these five hindrances are abandoned, gladness arises in him. Being gladdened, rapture arises in him. With a mind full of rapture, his body becomes tranquil. With a tranquil body, he experiences happiness. With a happy mind, his concentration becomes unified. Secluded from sensual pleasures, secluded from unwholesome states, he enters and abides in the first jhāna, which is accompanied by initial application and sustained application, born of seclusion, and filled with rapture and happiness. His former perception of sensuality ceases. At that time, there is a perception of subtle truth of the rapture and happiness born of seclusion, and he is one who perceives this subtle truth of the rapture and happiness born of seclusion. Thus, through this training, one perception arises and one perception ceases. This is the training,” the Blessed One said.\n\n“Furthermore, Poṭṭhapāda, with the stilling of initial application and sustained application, with internal serene confidence and unification of mind, he enters and abides in the second jhāna, which is without initial application and sustained application, born of concentration, and filled with rapture and happiness. His former perception of subtle truth of the rapture and happiness born of seclusion ceases. At that time, there is a perception of subtle truth of the rapture and happiness born of concentration, and he is one who perceives this subtle truth of the rapture and happiness born of concentration. Thus, through this training, one perception arises and one perception ceases. This too is the training,” the Blessed One said.\n\n“Furthermore, Poṭṭhapāda, with the fading away of rapture, he abides in equanimity, mindful and clearly comprehending, and he experiences happiness with the body, concerning which the noble ones declare: ‘He dwells in equanimity, mindful, and at ease.’ He enters and abides in the third jhāna. His former perception of subtle truth of the rapture and happiness born of concentration ceases. At that time, there is a perception of subtle truth of equanimity and happiness, and he is one who perceives this subtle truth of equanimity and happiness. Thus, through this training, one perception arises and one perception ceases. This too is the training,” the Blessed One said.\n\n“Furthermore, Poṭṭhapāda, with the abandoning of pleasure and pain, and with the prior disappearance of joy and grief, he enters and abides in the fourth jhāna, which is beyond pleasure and pain, and purified by equanimity and mindfulness. His former perception of subtle truth of equanimity and happiness ceases. At that time, there is a perception of subtle truth of neither-pain-nor-pleasure, and he is one who perceives this subtle truth of neither-pain-nor-pleasure. Thus, through this training, one perception arises and one perception ceases. This too is the training,” the Blessed One said.\n\n“Furthermore, Poṭṭhapāda, by completely transcending perceptions of form, by the disappearance of perceptions of sensory impingement, and by not attending to perceptions of multiplicity, he enters and abides in the base of infinite space, perceiving ‘Space is infinite’. His former perception of form ceases. At that time, there is a perception of subtle truth of the base of infinite space, and he is one who perceives this subtle truth of the base of infinite space. Thus, through this training, one perception arises and one perception ceases. This too is the training,” the Blessed One said.\n\n“Furthermore, Poṭṭhapāda, by completely transcending the base of infinite space, he enters and abides in the base of infinite consciousness, perceiving ‘Consciousness is infinite’. His former perception of subtle truth of the base of infinite space ceases. At that time, there is a perception of subtle truth of the base of infinite consciousness, and he is one who perceives this subtle truth of the base of infinite consciousness. Thus, through this training, one perception arises and one perception ceases. This too is the training,” the Blessed One said.\n\n“Furthermore, Poṭṭhapāda, by completely transcending the base of infinite consciousness, he enters and abides in the base of nothingness, perceiving ‘There is nothing’. His former perception of subtle truth of the base of infinite consciousness ceases. At that time, there is a perception of subtle truth of the base of nothingness, and he is one who perceives this subtle truth of the base of nothingness. Thus, through this training, one perception arises and one perception ceases. This too is the training,” the Blessed One said.",
      "sinhala": "‘‘ශික්ෂාව කවරේදැ’’යි? භාග්‍යවතුන් වහන්සේ මෙසේ වදාළ සේක: ‘‘පොට්\\u200Dඨපාද, මේ ශාසනයෙහි අරහත් වූ, සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ ලෝකයෙහි පහළ වෙති. උන්වහන්සේ ධර්මය දේශනා කරති. එම ධර්මය ශ්\\u200Dරවණය කරන යම්කිසි පුද්ගලයෙක් ගිහිගෙයින් නික්ම සසුනෙහි පැවිදි බව ලබයි. පොට්\\u200Dඨපාද, මෙසේ භික්ෂුව සීලයෙන් සම්පූර්ණ වේ. ඔහු පංචනීවරණයන් ප්\\u200Dරහීණ වූ බව තමා තුළින් ම දැක ප්\\u200Dරමෝදයට පත් වේ. ප්\\u200Dරමෝදයට පත්වීමෙන් ප්\\u200Dරීතිය උපදී. ප්\\u200Dරීතිමත් සිතක් ඇති කල්හි ශරීරය සන්සුන් වේ. සන්සුන් වූ කය ඇති ඔහු සුවය විඳියි. සුවපත් සිත සමාධිගත වේ. හෙතෙම කාමයන්ගෙන් ද, අකුසල ධර්මයන්ගෙන් ද සැබවින්ම වෙන් වී, විතර්ක සහිත වූ ද විචාර සහිත වූ ද, විවේකයෙන් හටගත් ප්\\u200Dරීති-සුව සහිත වූ ප්\\u200Dරථම ධ්\\u200Dයානයට පැමිණ වාසය කරයි. ඔහුගේ යම් පෙර කාම සංඥාවක් වී ද, එය නිරුද්ධ වේ. ඒ සමයෙහි විවේකයෙන් හටගත් ප්\\u200Dරීති-සුවයේ සියුම් සත්‍ය සංඥාව පවතී. ඒ සමයෙහි හෙතෙම විවේකයෙන් හටගත් ප්\\u200Dරීති-සුවයේ සියුම් සත්‍ය සංඥා ඇත්තෙක් ම වේ. මෙසේ ද ශික්ෂාවෙන් එක් සංඥාවක් උපදී, ශික්ෂාවෙන් එක් සංඥාවක් නිරුද්ධ වේ. මෙය ශික්ෂාව යි,’’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n‘‘නැවත ද, පොට්\\u200Dඨපාද, භික්ෂුව විතර්ක විචාරයන් සංසිඳවීමෙන් අභ්\\u200Dයන්තර පැහැදීම හා සිතේ එකඟ බව ලබා, විතර්ක රහිත වූ ද විචාර රහිත වූ ද, සමාධියෙන් හටගත් ප්\\u200Dරීති-සුව සහිත වූ දෙවෙනි ධ්\\u200Dයානයට පැමිණ වාසය කරයි. ඔහුගේ යම් පෙර විවේකයෙන් හටගත් ප්\\u200Dරීති-සුවයේ සියුම් සත්‍ය සංඥාවක් වී ද, එය නිරුද්ධ වේ. ඒ සමයෙහි සමාධියෙන් හටගත් ප්\\u200Dරීති-සුවයේ සියුම් සත්‍ය සංඥාව පවතී. ඒ සමයෙහි හෙතෙම සමාධියෙන් හටගත් ප්\\u200Dරීති-සුවයේ සියුම් සත්‍ය සංඥා ඇත්තෙක් ම වේ. මෙසේ ද ශික්ෂාවෙන් එක් සංඥාවක් උපදී, ශික්ෂාවෙන් එක් සංඥාවක් නිරුද්ධ වේ. මෙය ද ශික්ෂාව යි,’’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n‘‘නැවත ද, පොට්\\u200Dඨපාද, භික්ෂුව ප්\\u200Dරීතිය කෙරෙහි ද, නො ඇල්මෙන් උපේක්ෂාවෙන් යුක්තව ද, සිහි නුවණින් යුක්තව ද වාසය කරයි. තව ද, කය කෙරෙහි සුවය විඳියි. යමක් අරියෝ ‘උපේක්ෂාවෙන්, සිහියෙන්, සුවසේ වාසය කරන්නා’ යි පවසත් ද, ඒ තෙවෙනි ධ්\\u200Dයානයට පැමිණ වාසය කරයි. ඔහුගේ යම් පෙර සමාධියෙන් හටගත් ප්\\u200Dරීති-සුවයේ සියුම් සත්‍ය සංඥාවක් වී ද, එය නිරුද්ධ වේ. ඒ සමයෙහි උපේක්ෂා-සුවයේ සියුම් සත්‍ය සංඥාව පවතී. ඒ සමයෙහි හෙතෙම උපේක්ෂා-සුවයේ සියුම් සත්‍ය සංඥා ඇත්තෙක් ම වේ. මෙසේ ද ශික්ෂාවෙන් එක් සංඥාවක් උපදී, ශික්ෂාවෙන් එක් සංඥාවක් නිරුද්ධ වේ. මෙය ද ශික්ෂාව යි,’’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n‘‘නැවත ද, පොට්\\u200Dඨපාද, භික්ෂුව සුවය ද දුක ද ප්\\u200Dරහාණය කිරීමෙන්, කලින් පැවති සෝමනස්ස-දෝමනස්සයන් අභාවයට යාමෙන්, දුක් ද නොවන සුව ද නොවන, උපේක්ෂා-ස්මෘති පාරිශුද්ධියෙන් යුක්ත වූ සිව්වෙනි ධ්\\u200Dයානයට පැමිණ වාසය කරයි. ඔහුගේ යම් පෙර උපේක්ෂා-සුවයේ සියුම් සත්‍ය සංඥාවක් වී ද, එය නිරුද්ධ වේ. ඒ සමයෙහි දුක් ද නොවන සුව ද නොවන සියුම් සත්‍ය සංඥාව පවතී. ඒ සමයෙහි හෙතෙම දුක් ද නොවන සුව ද නොවන සියුම් සත්‍ය සංඥා ඇත්තෙක් ම වේ. මෙසේ ද ශික්ෂාවෙන් එක් සංඥාවක් උපදී, ශික්ෂාවෙන් එක් සංඥාවක් නිරුද්ධ වේ. මෙය ද ශික්ෂාව යි,’’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n‘‘නැවත ද, පොට්\\u200Dඨපාද, භික්ෂුව සියලු රූප සංඥාවන් සම්පූර්ණයෙන් ඉක්මවීමෙන්, ගැටීම් සංඥාවන් නැතිවීමෙන්, නානාත්ව සංඥාවන් මෙනෙහි නොකිරීමෙන්, ‘ආකාශය අනන්තයි’ යි සලකා ආකාසානඤ්\\u200Dචායතනයට පැමිණ වාසය කරයි. ඔහුගේ යම් පෙර රූප සංඥාවක් වී ද, එය නිරුද්ධ වේ. ඒ සමයෙහි ආකාසානඤ්\\u200Dචායතනයේ සියුම් සත්‍ය සංඥාව පවතී. ඒ සමයෙහි හෙතෙම ආකාසානඤ්\\u200Dචායතනයේ සියුම් සත්‍ය සංඥා ඇත්තෙක් ම වේ. මෙසේ ද ශික්ෂාවෙන් එක් සංඥාවක් උපදී, ශික්ෂාවෙන් එක් සංඥාවක් නිරුද්ධ වේ. මෙය ද ශික්ෂාව යි,’’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n‘‘නැවත ද, පොට්\\u200Dඨපාද, භික්ෂුව ආකාසානඤ්\\u200Dචායතනය සම්පූර්ණයෙන් ඉක්මවා, ‘විඤ්\\u200Dඤාණය අනන්තයි’ යි සලකා විඤ්\\u200Dඤාණඤ්\\u200Dචායතනයට පැමිණ වාසය කරයි. ඔහුගේ යම් පෙර ආකාසානඤ්\\u200Dචායතනයේ සියුම් සත්‍ය සංඥාවක් වී ද, එය නිරුද්ධ වේ. ඒ සමයෙහි විඤ්\\u200Dඤාණඤ්\\u200Dචායතනයේ සියුම් සත්‍ය සංඥාව පවතී. ඒ සමයෙහි හෙතෙම විඤ්\\u200Dඤාණඤ්\\u200Dචායතනයේ සියුම් සත්‍ය සංඥා ඇත්තෙක් ම වේ. මෙසේ ද ශික්ෂාවෙන් එක් සංඥාවක් උපදී, ශික්ෂාවෙන් එක් සංඥාවක් නිරුද්ධ වේ. මෙය ද ශික්ෂාව යි,’’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.\n\n‘‘නැවත ද, පොට්\\u200Dඨපාද, භික්ෂුව විඤ්\\u200Dඤාණඤ්\\u200Dචායතනය සම්පූර්ණයෙන් ඉක්මවා, ‘කිසිවක් නැත’ යි සලකා ආකිඤ්\\u200Dචඤ්\\u200Dඤායතනයට පැමිණ වාසය කරයි. ඔහුගේ යම් පෙර විඤ්\\u200Dඤාණඤ්\\u200Dචායතනයේ සියුම් සත්‍ය සංඥාවක් වී ද, එය නිරුද්ධ වේ. ඒ සමයෙහි ආකිඤ්\\u200Dචඤ්\\u200Dඤායතනයේ සියුම් සත්‍ය සංඥාව පවතී. ඒ සමයෙහි හෙතෙම ආකිඤ්\\u200Dචඤ්\\u200Dඤායතනයේ සියුම් සත්‍ය සංඥා ඇත්තෙක් ම වේ. මෙසේ ද ශික්ෂාවෙන් එක් සංඥාවක් උපදී, ශික්ෂාවෙන් එක් සංඥාවක් නිරුද්ධ වේ. මෙය ද ශික්ෂාව යි,’’ යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 414,
      "pali": "‘‘Yato kho, poṭṭhapāda, bhikkhu idha sakasaññī hoti, so tato amutra tato amutra anupubbena saññaggaṃ phusati. Tassa saññagge ṭhitassa evaṃ hoti – ‘cetayamānassa me pāpiyo, acetayamānassa me seyyo. Ahañceva kho pana ceteyyaṃ, abhisaṅkhareyyaṃ, imā ca me saññā nirujjheyyuṃ, aññā ca oḷārikā saññā uppajjeyyuṃ; yaṃnūnāhaṃ na ceva ceteyyaṃ na ca abhisaṅkhareyya’nti. So na ceva ceteti, na ca abhisaṅkharoti. Tassa acetayato anabhisaṅkharoto tā ceva saññā nirujjhanti, aññā ca oḷārikā saññā na uppajjanti. So nirodhaṃ phusati. Evaṃ kho, poṭṭhapāda, anupubbābhisaññānirodha-sampajāna- samāpatti hoti. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, api nu te ito pubbe evarūpā anupubbābhisaññānirodha-sampajāna- samāpatti sutapubbā’’ti? ‘‘No hetaṃ, bhante. Evaṃ kho ahaṃ, bhante, bhagavato bhāsitaṃ ājānāmi – ‘yato kho, poṭṭhapāda, bhikkhu idha sakasaññī hoti, so tato amutra tato amutra anupubbena saññaggaṃ phusati, tassa saññagge ṭhitassa evaṃ hoti – ‘‘cetayamānassa me pāpiyo, acetayamānassa me seyyo. Ahañceva kho pana ceteyyaṃ abhisaṅkhareyyaṃ, imā ca me saññā nirujjheyyuṃ, aññā ca oḷārikā saññā uppajjeyyuṃ; yaṃnūnāhaṃ na ceva ceteyyaṃ, na ca abhisaṅkhareyya’’nti. So na ceva ceteti, na cābhisaṅkharoti, tassa acetayato anabhisaṅkharoto tā ceva saññā nirujjhanti, aññā ca oḷārikā saññā na uppajjanti. So nirodhaṃ phusati. Evaṃ kho, poṭṭhapāda, anupubbābhisaññānirodha-sampajāna-samāpatti hotī’’’ti. ‘‘Evaṃ, poṭṭhapādā’’ti.",
      "english": "Indeed, Poṭṭhapāda, when a bhikkhu here has a specific perception, he progressively, from one to the next, attains the summit of perception. To him, established at the summit of perception, this thought occurs: 'Intending is worse for me; not intending is better. For if I were to intend and generate volitional formations, these perceptions of mine would cease, and other grosser perceptions would arise. What if I were not to intend and not to generate volitional formations?' He neither intends nor generates volitional formations. For him, not intending and not generating volitional formations, those very perceptions cease, and other grosser perceptions do not arise. He realizes cessation. Thus indeed, Poṭṭhapāda, is the progressive attainment of the cessation of perceptions with clear comprehension. What do you think, Poṭṭhapāda, have you ever heard of such a progressive attainment of the cessation of perceptions with clear comprehension before this?\n\nNo, Venerable Sir. Indeed, Venerable Sir, I understand the Blessed One's discourse thus: 'Indeed, Poṭṭhapāda, when a bhikkhu here has a specific perception, he progressively, from one to the next, attains the summit of perception. To him, established at the summit of perception, this thought occurs: ''Intending is worse for me; not intending is better. For if I were to intend and generate volitional formations, these perceptions of mine would cease, and other grosser perceptions would arise. What if I were not to intend and not to generate volitional formations?'' He neither intends nor generates volitional formations. For him, not intending and not generating volitional formations, those very perceptions cease, and other grosser perceptions do not arise. He realizes cessation. Thus indeed, Poṭṭhapāda, is the progressive attainment of the cessation of perceptions with clear comprehension.'\n\nThat is correct, Poṭṭhapāda.",
      "sinhala": "පොට්ඨපාද, යම් හෙයකින් භික්ෂුවක් මෙහි තමන්ට සංඥාවක් ඇතැයි දන්නේද, ඔහු එතැන් සිට අනෙකට, එතැන් සිට අනෙකට ක‍්‍රමානුකූලව සංඥාවේ අග‍්‍රයට පැමිණේ. සංඥාවේ අග‍්‍රයෙහි සිටින ඔහුට මෙසේ සිතේ – ‘සිතන කල්හි මට පාපී ය, නොසිතන කල්හි මට ශ‍්‍රේෂ්ඨ ය. යම් හෙයකින් මම සිතන්නෙම් නම්, අභිසංස්කරණය කරන්නෙම් නම්, මේ සංඥාවෝ නිරුද්ධ වන්නාහ, අන් ඔළාරික සංඥාවෝ උපදින්නාහ; ඒ නිසා මම නොසිතා, අභිසංස්කරණය නොකරන්නෙම් නම් යෙහෙකි.’ ඔහු සිතන්නේද නැත, අභිසංස්කරණය කරන්නේද නැත. ඔහුට නොසිතන කල්හි, අභිසංස්කරණය නොකරන කල්හි, ඒ සංඥාවෝම නිරුද්ධ වෙති, අන් ඔළාරික සංඥාවෝ නොඋපදිති. ඔහු නිරෝධය ස්පර්ශ කරයි. පොට්ඨපාද, මෙසේ ක‍්‍රමානුකූලව සංඥා නිරෝධය පිළිබඳ මනා අවබෝධයෙන් යුත් සමාපත්තිය ඇති වේ.\n\nපොට්ඨපාද, ඔබ මේ කුමක් සිතන්නෙහිද, ඔබට මීට පෙර මෙවැනි ක‍්‍රමානුකූලව සංඥා නිරෝධය පිළිබඳ මනා අවබෝධයෙන් යුත් සමාපත්තියක් අසා තිබුණේද? නැත, භාග්‍යවතුන් වහන්ස. භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ වදාළ මේ දේශනාව මම මෙසේ දනිමි – ‘පොට්ඨපාද, යම් හෙයකින් භික්ෂුවක් මෙහි තමන්ට සංඥාවක් ඇතැයි දන්නේද, ඔහු එතැන් සිට අනෙකට, එතැන් සිට අනෙකට ක‍්‍රමානුකූලව සංඥාවේ අග‍්‍රයට පැමිණේ. සංඥාවේ අග‍්‍රයෙහි සිටින ඔහුට මෙසේ සිතේ – ‘‘සිතන කල්හි මට පාපී ය, නොසිතන කල්හි මට ශ‍්‍රේෂ්ඨ ය. යම් හෙයකින් මම සිතන්නෙම් නම්, අභිසංස්කරණය කරන්නෙම් නම්, මේ සංඥාවෝ නිරුද්ධ වන්නාහ, අන් ඔළාරික සංඥාවෝ උපදින්නාහ; ඒ නිසා මම නොසිතා, අභිසංස්කරණය නොකරන්නෙම් නම් යෙහෙකි.’’ ඔහු සිතන්නේද නැත, අභිසංස්කරණය කරන්නේද නැත. ඔහුට නොසිතන කල්හි, අභිසංස්කරණය නොකරන කල්හි, ඒ සංඥාවෝම නිරුද්ධ වෙති, අන් ඔළාරික සංඥාවෝ නොඋපදිති. ඔහු නිරෝධය ස්පර්ශ කරයි. පොට්ඨපාද, මෙසේ ක‍්‍රමානුකූලව සංඥා නිරෝධය පිළිබඳ මනා අවබෝධයෙන් යුත් සමාපත්තිය ඇති වේ.’ එසේය, පොට්ඨපාද.",
      "paliTitle": ""
    },
    {
      "number": 415,
      "pali": "‘‘Ekaññeva nu kho, bhante, bhagavā saññaggaṃ paññapeti, udāhu puthūpi saññagge paññapetī’’ti? ‘‘Ekampi kho ahaṃ, poṭṭhapāda, saññaggaṃ paññapemi, puthūpi saññagge paññapemī’’ti. ‘‘Yathā kathaṃ pana, bhante, bhagavā ekampi saññaggaṃ paññapeti, puthūpi saññagge paññapetī’’ti? ‘‘Yathā yathā kho, poṭṭhapāda, nirodhaṃ phusati, tathā tathāhaṃ saññaggaṃ paññapemi. Evaṃ kho ahaṃ, poṭṭhapāda, ekampi saññaggaṃ paññapemi, puthūpi saññagge paññapemī’’ti.",
      "english": "“Venerable Sir, does the Blessed One teach only one highest perception, or does he teach many highest perceptions?” “Indeed, Poṭṭhapāda, I teach one highest perception, and I also teach many highest perceptions.” “Venerable Sir, how then does the Blessed One teach one highest perception and also teach many highest perceptions?” “Indeed, Poṭṭhapāda, in whatever way one touches cessation, in that way I teach the highest perception. In this way, Poṭṭhapāda, I teach one highest perception, and I also teach many highest perceptions.”",
      "sinhala": "‘‘වහන්ස, භාග්‍යවතුන් වහන්සේ එක් සංඥාග‍්‍රයක් පමණක් දේශනා කරන සේක්ද, නැතහොත් නොයෙක් සංඥාග‍්‍රයන් ද දේශනා කරන සේක්ද?’’\n‘‘පොට්ඨපාද, මම එක් සංඥාග‍්‍රයක් ද දේශනා කරමි, නොයෙක් සංඥාග‍්‍රයන් ද දේශනා කරමි.’’\n‘‘වහන්ස, භාග්‍යවතුන් වහන්සේ කෙසේ නම් එක් සංඥාග‍්‍රයක් ද දේශනා කරන සේක්ද, නොයෙක් සංඥාග‍්‍රයන් ද දේශනා කරන සේක්ද?’’\n‘‘පොට්ඨපාද, යම් යම් අයුරකින් නිරෝධය ස්පර්ශ කරයිද, ඒ ඒ අයුරින් මම සංඥාග‍්‍රය දේශනා කරමි. පොට්ඨපාද, මෙලෙසින් මම එක් සංඥාග‍්‍රයක් ද දේශනා කරමි, නොයෙක් සංඥාග‍්‍රයන් ද දේශනා කරමි.’’",
      "paliTitle": ""
    },
    {
      "number": 416,
      "pali": "‘‘Saññā nu kho, bhante, paṭhamaṃ uppajjati, pacchā ñāṇaṃ, udāhu ñāṇaṃ paṭhamaṃ uppajjati, pacchā saññā, udāhu saññā ca ñāṇañca apubbaṃ acarimaṃ uppajjantī’’ti? ‘‘Saññā kho, poṭṭhapāda, paṭhamaṃ uppajjati, pacchā ñāṇaṃ, saññuppādā ca pana ñāṇuppādo hoti. So evaṃ pajānāti – ‘idappaccayā kira me ñāṇaṃ udapādī’ti. Iminā kho etaṃ, poṭṭhapāda, pariyāyena veditabbaṃ – yathā saññā paṭhamaṃ uppajjati, pacchā ñāṇaṃ, saññuppādā ca pana ñāṇuppādo hotī’’ti.",
      "english": "“Venerable Sir, does perception arise first, and then knowledge, or does knowledge arise first, and then perception, or do perception and knowledge arise simultaneously?”\n\n“Poṭṭhapāda, perception arises first, and then knowledge. It is with the arising of perception that the arising of knowledge occurs. One thus understands, ‘Indeed, my knowledge has arisen dependent on this.’ Indeed, Poṭṭhapāda, by this approach it should be understood that perception arises first, and then knowledge, and that it is with the arising of perception that the arising of knowledge occurs.”",
      "sinhala": "ස්වාමීනි, මුලින්ම සංඥාව ඇතිවේ ද, පසුව ඥානය ඇතිවේ ද? නැතහොත් ඥානය මුලින්ම ඇතිවේ ද, පසුව සංඥාව ඇතිවේ ද? එසේත් නැතිනම් සංඥාවත් ඥානයත් එකවරම ඇතිවේ ද?\n\nපොට්ඨපාද, මුලින් සංඥාව ඇතිවේ, පසුව ඥානය ඇතිවේ. සංඥාව ඇතිවීමෙන් ඥානය ඇතිවීම සිදුවේ. ඔහු මෙසේ දනියි – ‘මෙය හේතුකොටගෙන සැබැවින්ම මට ඥානය ඇතිවිය’ කියා. පොට්ඨපාද, සංඥාව මුලින්ම ඇතිවී, පසුව ඥානය ඇතිවන බවත්, සංඥාව ඇතිවීමෙන් ඥානය ඇතිවීම සිදුවන බවත් මේ නයයෙන් අවබෝධ කළ යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 417,
      "pali": "‘‘Saññā nu kho, bhante, purisassa attā, udāhu aññā saññā añño attā’’ti? ‘‘Kaṃ pana tvaṃ, poṭṭhapāda, attānaṃ paccesī’’ti? ‘‘Oḷārikaṃ kho ahaṃ, bhante, attānaṃ paccemi rūpiṃ cātumahābhūtikaṃ kabaḷīkārāhārabhakkha’’nti [kabaḷīkārabhakkhanti (syā. ka.)]. ‘‘Oḷāriko ca hi te, poṭṭhapāda, attā abhavissa rūpī cātumahābhūtiko kabaḷīkārāhārabhakkho. Evaṃ santaṃ kho te, poṭṭhapāda, aññāva saññā bhavissati añño attā. Tadamināpetaṃ, poṭṭhapāda, pariyāyena veditabbaṃ yathā aññāva saññā bhavissati añño attā. Tiṭṭhateva sāyaṃ [tiṭṭhatevāyaṃ (sī. pī.)], poṭṭhapāda, oḷāriko attā rūpī cātumahābhūtiko kabaḷīkārāhārabhakkho, atha imassa purisassa aññā ca saññā uppajjanti, aññā ca saññā nirujjhanti. Iminā kho etaṃ, poṭṭhapāda, pariyāyena veditabbaṃ yathā aññāva saññā bhavissati añño attā’’ti.",
      "english": "“Venerable Sir, is perception the self of a person, or is perception one thing and the self another?”\n“Now, Poṭṭhapāda, what kind of self do you assume?”\n“Venerable Sir, I assume a gross self, material, composed of the four great elements, and feeding on physical food.”\n“For if your self, Poṭṭhapāda, were gross, material, composed of the four great elements, and feeding on physical food, then, while that is so, Poṭṭhapāda, perception would indeed be one thing and the self another. Therefore, Poṭṭhapāda, by this method it should be known that perception would indeed be one thing and the self another. Poṭṭhapāda, that same gross self remains—material, composed of the four great elements, and feeding on physical food—yet for this person, different perceptions arise and different perceptions cease. Indeed, Poṭṭhapāda, by this method it should be known that perception would indeed be one thing and the self another.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, පුරුෂයාගේ ආත්මය සංඥාවද, නැතහොත් සංඥාව එකක්ද, ආත්මය අනෙකක්ද? පොට්ඨපාද, ඔබ කුමන ආත්මයක් පිළිගන්නෙහිද? භාග්‍යවතුන් වහන්ස, මම රූපී වූ, සතර මහා භූතයන්ගෙන් යුත්, කබලිංකාර ආහාරයෙන් පෝෂණය වන, ඖදාරික ආත්මයක් පිළිගනිමි.\n\nපොට්ඨපාද, ඔබට රූපී වූ, සතර මහා භූතයන්ගෙන් යුත්, කබලිංකාර ආහාරයෙන් පෝෂණය වන ඖදාරික ආත්මයක් ඇත්තේ නම්, එසේ වූ කල, පොට්ඨපාද, සංඥාව වෙන එකක් වන අතර, ආත්මය තවත් එකක් වනු ඇත. පොට්ඨපාද, සංඥාව වෙන එකක් වන අතර, ආත්මය තවත් එකක් බව මේ ආකාරයෙන්ද තේරුම් ගත යුතුය. පොට්ඨපාද, රූපී වූ, සතර මහා භූතයන්ගෙන් යුත්, කබලිංකාර ආහාරයෙන් පෝෂණය වන ඖදාරික ආත්මය එසේම පවතින්නේ නම්, ඒ අතර මේ පුරුෂයාට වෙනත් සංඥාවන් හටගනී, වෙනත් සංඥාවන් නිරුද්ධ වේ. පොට්ඨපාද, සංඥාව වෙන එකක් වන අතර, ආත්මය තවත් එකක් බව මේ ආකාරයෙන්ද තේරුම් ගත යුතුය.",
      "paliTitle": "Saññāattakathā",
      "englishTitle": "Discourse on Personal Perception",
      "sinhalaTitle": "සංඥා ස්‌වභාව කථාව"
    },
    {
      "number": 418,
      "pali": "‘‘Manomayaṃ kho ahaṃ, bhante, attānaṃ paccemi sabbaṅgapaccaṅgiṃ ahīnindriya’’nti. ‘‘Manomayo ca hi te, poṭṭhapāda, attā abhavissa sabbaṅgapaccaṅgī ahīnindriyo, evaṃ santampi kho te, poṭṭhapāda, aññāva saññā bhavissati añño attā. Tadamināpetaṃ, poṭṭhapāda, pariyāyena veditabbaṃ yathā aññāva saññā bhavissati añño attā. Tiṭṭhateva sāyaṃ, poṭṭhapāda, manomayo attā sabbaṅgapaccaṅgī ahīnindriyo, atha imassa purisassa aññā ca saññā uppajjanti, aññā ca saññā nirujjhanti. Imināpi kho etaṃ, poṭṭhapāda, pariyāyena veditabbaṃ yathā aññāva saññā bhavissati añño attā’’ti.",
      "english": "“Indeed, Venerable Sir, I perceive a self that is mind-made, complete in all its major and minor limbs, and with unblemished faculties.” “Poṭṭhapāda, even if your self were mind-made, complete in all its major and minor limbs, and with unblemished faculties, still, Poṭṭhapāda, perception would be one thing and the self another. And by this reasoning, Poṭṭhapāda, it should be understood how perception would be one thing and the self another. For even if that mind-made self, Poṭṭhapāda, complete in all its major and minor limbs, and with unblemished faculties, were to remain, yet for that person, different perceptions would arise and different perceptions would cease. By this reasoning too, Poṭṭhapāda, it should be understood how perception would be one thing and the self another.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, සියලු අංගප‍්‍රත්‍යංගවලින් යුත්, අකලංක ඉන්ද්‍රියයන්ගෙන් සමන්විත වූ මනෝමය ආත්මයක් ඇතැයි මම සලකමි.\n\nපොට්ඨපාද, ඔබට සියලු අංගප‍්‍රත්‍යංගවලින් යුත්, අකලංක ඉන්ද්‍රියයන්ගෙන් සමන්විත වූ මනෝමය ආත්මයක් පැවතියේ නම්, පොට්ඨපාද, එසේ වුවද ඔබට වෙනස් සංඥාවක් ඇති වනු ඇත, ආත්මයද වෙනස් වනු ඇත. පොට්ඨපාද, සංඥාව වෙනත් දෙයක් වන බවත්, ආත්මය වෙනත් දෙයක් වන බවත්, මෙයද මේ කරුණෙන් දැනගත යුතුය. පොට්ඨපාද, සියලු අංගප‍්‍රත්‍යංගවලින් යුත්, අකලංක ඉන්ද්‍රියයන්ගෙන් සමන්විත වූ ඒ මනෝමය ආත්මය පවතී. එහෙත් මේ පුරුෂයාට වෙනත් සංඥා උපදී, වෙනත් සංඥා නිරුද්ධ වේ. පොට්ඨපාද, සංඥාව වෙනත් දෙයක් වන බවත්, ආත්මය වෙනත් දෙයක් වන බවත්, මෙයද මේ කරුණෙන්ද දැනගත යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 419,
      "pali": "‘‘Arūpiṃ kho ahaṃ, bhante, attānaṃ paccemi saññāmaya’’nti. ‘‘Arūpī ca hi te, poṭṭhapāda, attā abhavissa saññāmayo, evaṃ santampi kho te, poṭṭhapāda, aññāva saññā bhavissati añño attā. Tadamināpetaṃ, poṭṭhapāda, pariyāyena veditabbaṃ yathā aññāva saññā bhavissati añño attā. Tiṭṭhateva sāyaṃ, poṭṭhapāda, arūpī attā saññāmayo, atha imassa purisassa aññā ca saññā uppajjanti, aññā ca saññā nirujjhanti. Imināpi kho etaṃ, poṭṭhapāda, pariyāyena veditabbaṃ yathā aññāva saññā bhavissati añño attā’’ti.",
      "english": "“Venerable Sir, I perceive the self as formless and made of perception.”\n\nPotthapada, even if your self were formless and made of perception, it would still be that your perception would be one thing and the self another. And Potthapada, by this method it should be understood how perception would be one thing and the self another. Potthapada, that formless, perception-made self might remain, yet for this person, some perceptions arise and others cease. Potthapada, by this method too it should be understood how perception would be one thing and the self another.",
      "sinhala": "භාග්‍ය‌වතුන් වහන්ස, මම ආත්මය අරූපී වූ, සංඥාමය ස්වභාවයක් ලෙස සලකමි.\n\nපොට්ඨපාද, ඔබේ ආත්මය අරූපී වූ සංඥාමය ස්වභාවයක් වුවද, එසේ වුවද පොට්ඨපාද, ඔබේ සංඥාව එකක් ද, ආත්මය තව එකක් ද වන්නේය. පොට්ඨපාද, සංඥාව එකක් ද, ආත්මය තව එකක් ද වන බව මේ ක‍්‍ර‌මයෙන් ද දැනගත යුතුයි. පොට්ඨපාද, ඒ අරූපී වූ සංඥාමය ආත්මය එසේම පවතින්නේ වුවද, මේ පුද්ගලයාට වෙනත් සංඥාවන් උපදී, වෙනත් සංඥාවන් නිරුද්ධ වේ. පොට්ඨපාද, සංඥාව එකක් ද, ආත්මය තව එකක් ද වන බව මේ ක‍්‍ර‌මයෙන් ද දැනගත යුතුයි.",
      "paliTitle": ""
    },
    {
      "number": 420,
      "pali": "‘‘Sakkā panetaṃ, bhante, mayā ñātuṃ – ‘saññā purisassa attā’ti vā ‘aññāva saññā añño attāti vā’ti? ‘‘Dujjānaṃ kho etaṃ [evaṃ (ka.)], poṭṭhapāda, tayā aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena – ‘saññā purisassa attā’ti vā, ‘aññāva saññā añño attāti vā’’’ti. ‘‘Sace taṃ, bhante, mayā dujjānaṃ aññadiṭṭhikena aññakhantikena aññarucikena aññatrāyogena aññatrācariyakena – ‘saññā purisassa attā’ti vā, ‘aññāva saññā añño attā’ti vā; ‘kiṃ pana, bhante, sassato loko, idameva saccaṃ moghamañña’nti? Abyākataṃ kho etaṃ, poṭṭhapāda, mayā – ‘sassato loko, idameva saccaṃ moghamañña’nti. ‘‘Kiṃ pana, bhante, ‘asassato loko, idameva saccaṃ moghamañña’’’nti? ‘‘Etampi kho, poṭṭhapāda, mayā abyākataṃ – ‘asassato loko, idameva saccaṃ moghamañña’’’nti. ‘‘Kiṃ pana, bhante, ‘antavā loko…pe… ‘anantavā loko … ‘taṃ jīvaṃ taṃ sarīraṃ… ‘aññaṃ jīvaṃ aññaṃ sarīraṃ… ‘hoti tathāgato paraṃ maraṇā… ‘na hoti tathāgato paraṃ maraṇā… ‘hoti ca na ca hoti tathāgato paraṃ maraṇā… ‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti? ‘‘Etampi kho, poṭṭhapāda, mayā abyākataṃ – ‘neva hoti na na hoti tathāgato paraṃ maraṇā, idameva saccaṃ moghamañña’’’nti. ‘‘Kasmā panetaṃ, bhante, bhagavatā abyākata’’nti? ‘‘Na hetaṃ, poṭṭhapāda, atthasaṃhitaṃ na dhammasaṃhitaṃ nādibrahmacariyakaṃ, na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattati, tasmā etaṃ mayā abyākata’’nti. ‘‘Kiṃ pana, bhante, bhagavatā byākata’’nti? ‘‘Idaṃ dukkhanti kho, poṭṭhapāda, mayā byākataṃ. Ayaṃ dukkhasamudayoti kho, poṭṭhapāda, mayā byākataṃ. Ayaṃ dukkhanirodhoti kho, poṭṭhapāda, mayā byākataṃ. Ayaṃ dukkhanirodhagāminī paṭipadāti kho, poṭṭhapāda, mayā byākata’’nti. ‘‘Kasmā panetaṃ, bhante, bhagavatā byākata’’nti? ‘‘Etañhi, poṭṭhapāda, atthasaṃhitaṃ, etaṃ dhammasaṃhitaṃ, etaṃ ādibrahmacariyakaṃ, etaṃ nibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattati; tasmā etaṃ mayā byākata’’nti. ‘‘Evametaṃ, bhagavā, evametaṃ, sugata. Yassadāni, bhante, bhagavā kālaṃ maññatī’’ti. Atha kho bhagavā uṭṭhāyāsanā pakkāmi.",
      "english": "“Is it possible, Venerable Sir, for me to know this—whether ‘perception is the self of a person’ or ‘perception is one thing and the self is another’?”\n“It is indeed difficult for you, Poṭṭhapāda, who hold a different view, have a different acceptance, a different preference, a different practice, and a different teacher, to know this—whether ‘perception is the self of a person’ or ‘perception is one thing and the self is another’.”\n“If it is difficult for me, Venerable Sir, who hold a different view, have a different acceptance, a different preference, a different practice, and a different teacher, to know this—whether ‘perception is the self of a person’ or ‘perception is one thing and the self is another’; then, Venerable Sir, is the world eternal, this alone being true and all else false?”\n“This, Poṭṭhapāda, has not been declared by me: ‘The world is eternal, this alone being true and all else false’.”\n“Then, Venerable Sir, is the world not eternal, this alone being true and all else false?”\n“That too, Poṭṭhapāda, has not been declared by me: ‘The world is not eternal, this alone being true and all else false’.”\n“Then, Venerable Sir, is the world finite, this alone being true and all else false? Or is the world infinite, this alone being true and all else false? Or is the soul the same as the body, this alone being true and all else false? Or is the soul one thing and the body another, this alone being true and all else false? Or does a Tathāgata exist after death, this alone being true and all else false? Or does a Tathāgata not exist after death, this alone being true and all else false? Or does a Tathāgata both exist and not exist after death, this alone being true and all else false? Or does a Tathāgata neither exist nor not exist after death, this alone being true and all else false?”\n“That too, Poṭṭhapāda, has not been declared by me: ‘A Tathāgata neither exists nor not exists after death, this alone being true and all else false’.”\n“Why then, Venerable Sir, has this not been declared by the Blessed One?”\n“Because, Poṭṭhapāda, this is not connected with the goal, it is not connected with the Dhamma, it is not fundamental to the holy life, it does not lead to disenchantment, to dispassion, to cessation, to tranquility, to direct knowledge, to full enlightenment, to Nibbāna. Therefore, this has not been declared by me.”\n“What then, Venerable Sir, has been declared by the Blessed One?”\n“This is suffering – that, Poṭṭhapāda, has been declared by me. This is the origin of suffering – that, Poṭṭhapāda, has been declared by me. This is the cessation of suffering – that, Poṭṭhapāda, has been declared by me. This is the path leading to the cessation of suffering – that, Poṭṭhapāda, has been declared by me.”\n“Why then, Venerable Sir, has this been declared by the Blessed One?”\n“Because, Poṭṭhapāda, this is connected with the goal, this is connected with the Dhamma, this is fundamental to the holy life, this leads to disenchantment, to dispassion, to cessation, to tranquility, to direct knowledge, to full enlightenment, to Nibbāna. Therefore, this has been declared by me.”\n“So it is, Blessed One! So it is, Fortunate One! Now, Venerable Sir, the Blessed One may do as he deems fit.”\n\nThen the Blessed One rose from his seat and departed.",
      "sinhala": "භාග්‍යවතුන් වහන්ස, ‘සංඥාව පුරුෂයාගේ ආත්මයයි’ කියා හෝ ‘සංඥාව වෙන එකක්, ආත්මය වෙන එකක්’ කියා හෝ මෙය මට දැනගත හැකිද?\n\nපොට්ඨපාද, අන්‍ය දෘෂ්ටියක් ඇති, අන්‍ය ඉවසීමක් ඇති, අන්‍ය රුචියක් ඇති, අන්‍ය මාර්ගයකින් ගමන් කරන, අන්‍ය ආචාර ධර්ම පිළිපදින ඔබට ‘සංඥාව පුරුෂයාගේ ආත්මයයි’ කියා හෝ ‘සංඥාව වෙන එකක්, ආත්මය වෙන එකක්’ කියා හෝ මෙය දැනගැනීම අපහසුයි.\n\nභාග්‍යවතුන් වහන්ස, අන්‍ය දෘෂ්ටියක් ඇති, අන්‍ය ඉවසීමක් ඇති, අන්‍ය රුචියක් ඇති, අන්‍ය මාර්ගයකින් ගමන් කරන, අන්‍ය ආචාර ධර්ම පිළිපදින මට ‘සංඥාව පුරුෂයාගේ ආත්මයයි’ කියා හෝ ‘සංඥාව වෙන එකක්, ආත්මය වෙන එකක්’ කියා හෝ එය දැනගැනීම අපහසු නම්; එසේ නම් භාග්‍යවතුන් වහන්ස, ‘ලෝකය සදාකාලිකය, මෙයම සත්‍යය, අන්‍ය දේ මිථ්‍යාව’ යනු කුමක්ද?\n\nපොට්ඨපාද, ‘ලෝකය සදාකාලිකය, මෙයම සත්‍යය, අන්‍ය දේ මිථ්‍යාව’ යනු මා විසින් අව්‍යාකෘත කරන ලද්දකි.\n\nඑසේ නම් භාග්‍යවතුන් වහන්ස, ‘ලෝකය අසදාකාලිකය, මෙයම සත්‍යය, අන්‍ය දේ මිථ්‍යාව’ යනු කුමක්ද?\n\nපොට්ඨපාද, ‘ලෝකය අසදාකාලිකය, මෙයම සත්‍යය, අන්‍ය දේ මිථ්‍යාව’ යනු මා විසින් එයද අව්‍යාකෘත කරන ලද්දකි.\n\nඑසේ නම් භාග්‍යවතුන් වහන්ස, ‘ලෝකය සීමා සහිතයි, ලෝකය අසීමා සහිතයි, ජීවයත් ශරීරයත් එයමයි, ජීවය වෙන එකක්, ශරීරය වෙන එකක්, තථාගතයන් වහන්සේ මරණින් පසු සිටින සේක, තථාගතයන් වහන්සේ මරණින් පසු නොසිටින සේක, තථාගතයන් වහන්සේ මරණින් පසු සිටින සේක් ද, නොසිටින සේක් ද, තථාගතයන් වහන්සේ මරණින් පසු සිටින සේක් ද නොවේ, නොසිටින සේක් ද නොවේ, මෙයම සත්‍යයයි, අන්‍ය දේ මිථ්‍යාවයි’ යනු කුමක්ද?\n\nපොට්ඨපාද, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටින සේක් ද නොවේ, නොසිටින සේක් ද නොවේ, මෙයම සත්‍යයයි, අන්‍ය දේ මිථ්‍යාවයි’ යනු මා විසින් මෙයද අව්‍යාකෘත කරන ලද්දකි.\n\nභාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් මෙය අව්‍යාකෘත කරන ලද්දේ කුමක් නිසාද?\n\nපොට්ඨපාද, මෙය අර්ථ සහිත නොවේ, ධර්ම සහිත නොවේ, ආදී බ්‍රහ්මචර්යාවට අයත් නොවේ, කෙලෙස් කලකිරීමට, කෙලෙස් නොඇල්ම පිණිස, කෙලෙස් නිරෝධය පිණිස, සන්සිඳීම පිණිස, විශිෂ්ට ඥානය පිණිස, සම්බෝධිය පිණිස, නිවන පිණිස උපකාරී නොවේ. එබැවින් මා විසින් මෙය අව්‍යාකෘත කරන ලද්දකි.\n\nඑසේ නම් භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් වදාළ දේ කුමක්ද?\n\nපොට්ඨපාද, ‘මෙය දුකයි’ කියා මා විසින් වදාළ ලදී. පොට්ඨපාද, ‘මේ දුක ඇතිවීමට හේතුවයි’ කියා මා විසින් වදාළ ලදී. පොට්ඨපාද, ‘මේ දුක නැති කිරීමයි’ කියා මා විසින් වදාළ ලදී. පොට්ඨපාද, ‘මේ දුක නැති කිරීමට ඇති මාර්ගයයි’ කියා මා විසින් වදාළ ලදී.\n\nභාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේ විසින් මෙය වදාළේ කුමක් නිසාද?\n\nපොට්ඨපාද, මෙය අර්ථ සහිතයි, මෙය ධර්ම සහිතයි, මෙය ආදී බ්‍රහ්මචර්යාවට අයත්ය, මෙය කෙලෙස් කලකිරීමට, කෙලෙස් නොඇල්ම පිණිස, කෙලෙස් නිරෝධය පිණිස, සන්සිඳීම පිණිස, විශිෂ්ට ඥානය පිණිස, සම්බෝධිය පිණිස, නිවන පිණිස උපකාරී වේ; එබැවින් මා විසින් මෙය වදාළ ලදී.\n\nභාග්‍යවතුන් වහන්ස, එය එසේමය. සුගතයන් වහන්ස, එය එසේමය. දැන් භාග්‍යවතුන් වහන්ස, භාග්‍යවතුන් වහන්සේට සුදුසු යැයි හැඟෙන දේ කළ හැකිය.\n\nඑවිට භාග්‍යවතුන් වහන්සේ හුනස්නෙන් නැගිට වැඩම කළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 421,
      "pali": "Atha kho te paribbājakā acirapakkantassa bhagavato poṭṭhapādaṃ paribbājakaṃ samantato vācā [vācāya (syā. ka.)] sannitodakena sañjhabbharimakaṃsu – ‘‘evameva panāyaṃ bhavaṃ poṭṭhapādo yaññadeva samaṇo gotamo bhāsati, taṃ tadevassa abbhanumodati – ‘evametaṃ bhagavā evametaṃ, sugatā’ti. Na kho pana mayaṃ kiñci [kañci (pī.)] samaṇassa gotamassa ekaṃsikaṃ dhammaṃ desitaṃ ājānāma – ‘sassato loko’ti vā, ‘asassato loko’ti vā, ‘antavā loko’ti vā, ‘anantavā loko’ti vā, ‘taṃ jīvaṃ taṃ sarīra’nti vā, ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā, ‘hoti tathāgato paraṃ maraṇā’ti vā, ‘na hoti tathāgato paraṃ maraṇā’ti vā, ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’ti vā, ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti vā’’ti. Evaṃ vutte poṭṭhapādo paribbājako te paribbājake etadavoca – ‘‘ahampi kho, bho, na kiñci samaṇassa gotamassa ekaṃsikaṃ dhammaṃ desitaṃ ājānāmi – ‘sassato loko’ti vā, ‘asassato loko’ti vā…pe… ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti vā; api ca samaṇo gotamo bhūtaṃ tacchaṃ tathaṃ paṭipadaṃ paññapeti dhammaṭṭhitataṃ dhammaniyāmataṃ. Bhūtaṃ kho pana tacchaṃ tathaṃ paṭipadaṃ paññapentassa dhammaṭṭhitataṃ dhammaniyāmataṃ, kathañhi nāma mādiso viññū samaṇassa gotamassa subhāsitaṃ subhāsitato nābbhanumodeyyā’’ti?",
      "english": "Then, after the Blessed One had not long departed, those wandering ascetics assailed the wanderer Poṭṭhapāda all around with a shower of stinging words: ‘This Venerable Poṭṭhapāda simply endorses whatever Ascetic Gotama says, affirming, “It is so, Blessed One! It is so, Fortunate One!” But we do not know of any definite teaching declared by Ascetic Gotama — whether ‘the world is eternal’ or ‘the world is not eternal,’ or ‘the world is finite’ or ‘the world is infinite,’ or ‘the soul and the body are the same’ or ‘the soul is one thing and the body another,’ or ‘a Tathāgata exists after death’ or ‘a Tathāgata does not exist after death,’ or ‘a Tathāgata both exists and does not exist after death,’ or ‘a Tathāgata neither exists nor does not exist after death.’\n\nWhen this was said, the wanderer Poṭṭhapāda spoke to those wanderers thus: ‘Indeed, friends, I too do not know of any definite teaching declared by Ascetic Gotama — whether ‘the world is eternal’ or ‘the world is not eternal,’ or ‘the world is finite’ or ‘the world is infinite,’ or ‘the soul and the body are the same’ or ‘the soul is one thing and the body another,’ or ‘a Tathāgata exists after death’ or ‘a Tathāgata does not exist after death,’ or ‘a Tathāgata both exists and does not exist after death,’ or ‘a Tathāgata neither exists nor does not exist after death.’ However, Ascetic Gotama teaches a path that is real, true, and actual; a state of constant reality, an order of the Dhamma. When one teaches a path that is real, true, and actual, a state of constant reality, an order of the Dhamma, how could an intelligent person like me not endorse Ascetic Gotama’s well-spoken words as well-spoken?’",
      "sinhala": "භාග්‍යවතුන් වහන්සේ වැඩමකොට වැඩි කලක් ගතවීමට මත්තෙන්, ඒ පරිබ්‍රාජකයෝ පොට්ඨපාද පරිබ්‍රාජකයාට සමීපව වචන මාලාවකින් දොස් නැගූහ: \"මේ පින්වත් පොට්ඨපාදයන් වහන්සේ ශ්‍රමණ ගෞතමයන් වහන්සේ යමක් දේශනා කරන්නේද, ඒ දේම අනුමෝදන් කරති: 'භාග්‍යවතුන් වහන්ස, එසේය, සුගතයන් වහන්ස, එසේය' කියා. නමුත් ශ්‍රමණ ගෞතමයන් වහන්සේ විසින් 'ලෝකය ශාශ්වතය' යයි හෝ, 'ලෝකය අශාශ්වතය' යයි හෝ, 'ලෝකය අන්තවත්ය' යයි හෝ, 'ලෝකය අනන්තවත්ය' යයි හෝ, 'ජීවයත් ශරීරයත් එකමය' යයි හෝ, 'ජීවයත් ශරීරයත් වෙනස්ය' යයි හෝ, 'මරණින් මතු තථාගතයන් වහන්සේ වෙති' යයි හෝ, 'මරණින් මතු තථාගතයන් වහන්සේ නොවෙති' යයි හෝ, 'මරණින් මතු තථාගතයන් වහන්සේ වෙතිත් නොවෙතිත්' යයි හෝ, 'මරණින් මතු තථාගතයන් වහන්සේ නොවෙතිත් නොනොවෙතිත්' යයි හෝ දේශනා කරන ලද කිසිදු ඒකාංශික ධර්මයක් අප නොදනිමු.\"\n\nමෙලෙස පැවසූ කල්හි, පොට්ඨපාද පරිබ්‍රාජකයා ඒ පරිබ්‍රාජකයන්ට මෙසේ කීවේය: \"ඇත්තෙන්ම ඇවැත්නි, 'ලෝකය ශාශ්වතය' යයි හෝ, 'ලෝකය අශාශ්වතය' යයි හෝ... 'මරණින් මතු තථාගතයන් වහන්සේ නොවෙතිත් නොනොවෙතිත්' යයි හෝ ශ්‍රමණ ගෞතමයන් වහන්සේ විසින් දේශනා කරන ලද කිසිදු ඒකාංශික ධර්මයක් මමද නොදනිමි. එහෙත් ශ්‍රමණ ගෞතමයන් වහන්සේ යථාභූත වූ, සත්‍ය වූ, පවතින ප්‍රතිපදාවක් වන ධර්මස්ථිතියත්, ධර්ම නියාමතාවත් පනවති. යථාභූත වූ, සත්‍ය වූ, පවතින ප්‍රතිපදාවක් වන ධර්මස්ථිතියත්, ධර්ම නියාමතාවත් පනවන්නාගේ ශ්‍රමණ ගෞතමයන් වහන්සේගේ සුභාෂිතය, සුභාෂිතයක් වශයෙන් මා වැනි නුවණැත්තෙකු අනුමෝදන් නොකරන්නේ කෙසේද?\"",
      "paliTitle": ""
    },
    {
      "number": 422,
      "pali": "Atha kho dvīhatīhassa accayena citto ca hatthisāriputto poṭṭhapādo ca paribbājako yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā citto hatthisāriputto bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Poṭṭhapādo pana paribbājako bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho poṭṭhapādo paribbājako bhagavantaṃ etadavoca – ‘‘tadā maṃ, bhante, te paribbājakā acirapakkantassa bhagavato samantato vācāsannitodakena sañjhabbharimakaṃsu – ‘evameva panāyaṃ bhavaṃ poṭṭhapādo yaññadeva samaṇo gotamo bhāsati, taṃ tadevassa abbhanumodati – ‘evametaṃ bhagavā evametaṃ sugatā’’ti. Na kho pana mayaṃ kiñci samaṇassa gotamassa ekaṃsikaṃ dhammaṃ desitaṃ ājānāma – ‘‘sassato loko’’ti vā, ‘‘asassato loko’’ti vā, ‘‘antavā loko’’ti vā, ‘‘anantavā loko’’ti vā, ‘‘taṃ jīvaṃ taṃ sarīra’’nti vā, ‘‘aññaṃ jīvaṃ aññaṃ sarīra’’nti vā, ‘‘hoti tathāgato paraṃ maraṇā’’ti vā, ‘‘na hoti tathāgato paraṃ maraṇā’’ti vā, ‘‘hoti ca na ca hoti tathāgato paraṃ maraṇā’’ti vā, ‘‘neva hoti na na hoti tathāgato paraṃ maraṇā’’ti vā’ti. Evaṃ vuttāhaṃ, bhante, te paribbājake etadavocaṃ – ‘ahampi kho, bho, na kiñci samaṇassa gotamassa ekaṃsikaṃ dhammaṃ desitaṃ ājānāmi – ‘‘sassato loko’’ti vā, ‘‘asassato loko’’ti vā…pe… ‘‘neva hoti na na hoti tathāgato paraṃ maraṇā’’ti vā; api ca samaṇo gotamo bhūtaṃ tacchaṃ tathaṃ paṭipadaṃ paññapeti dhammaṭṭhitataṃ dhammaniyāmataṃ. Bhūtaṃ kho pana tacchaṃ tathaṃ paṭipadaṃ paññapentassa dhammaṭṭhitataṃ dhammaniyāmataṃ, kathañhi nāma mādiso viññū samaṇassa gotamassa subhāsitaṃ subhāsitato nābbhanumodeyyā’’ti?",
      "english": "Then, after two or three days, Citta, the elephant-trainer's son, and Poṭṭhapāda the wanderer approached the Blessed One. Having approached, Citta, the elephant-trainer's son, greeted the Blessed One and sat down to one side. Poṭṭhapāda the wanderer, however, exchanged greetings with the Blessed One. After exchanging courteous and memorable talk, he sat down to one side.\n\nSitting to one side, Poṭṭhapāda the wanderer said to the Blessed One: \"On that occasion, venerable sir, after the Blessed One had recently departed, those wanderers harassed me all around with their verbal jabs, saying: 'Indeed, this venerable Poṭṭhapāda simply approves whatever the ascetic Gotama speaks, saying, \"So it is, Blessed One! So it is, Fortunate One!\" But we do not know of any teaching declared by the ascetic Gotama that is a definite doctrine — whether \"the world is eternal,\" or \"the world is not eternal,\" or \"the world is finite,\" or \"the world is infinite,\" or \"the life-principle is the same as the body,\" or \"the life-principle is one thing and the body another,\" or \"the Tathāgata exists after death,\" or \"the Tathāgata does not exist after death,\" or \"the Tathāgata both exists and does not exist after death,\" or \"the Tathāgata neither exists nor does not exist after death.\"' When I was spoken to in this way, venerable sir, I said to those wanderers: 'Friends, I too do not know of any definite doctrine declared by the ascetic Gotama — whether \"the world is eternal,\" or \"the world is not eternal,\" or \"the world is finite,\" or \"the world is infinite,\" or \"the life-principle is the same as the body,\" or \"the life-principle is one thing and the body another,\" or \"the Tathāgata exists after death,\" or \"the Tathāgata does not exist after death,\" or \"the Tathāgata both exists and does not exist after death,\" or \"the Tathāgata neither exists nor does not exist after death.\" But the ascetic Gotama teaches a path that is real, true, and actual; a teaching that is established in truth and fixed by natural law. And when he teaches a path that is real, true, and actual, a teaching that is established in truth and fixed by natural law, how could a wise person like me not approve of what has been well spoken by the ascetic Gotama as well-spoken?'\"",
      "sinhala": "එවිට දින දෙක තුනකට පසු හත්ථිසාරිපුත්ත චිත්ත සහ පොට්ඨපාද පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ; පැමිණ, හත්ථිසාරිපුත්ත චිත්ත භාග්‍යවතුන් වහන්සේට ආචාර කර එක් පැත්තකින් වාඩි විය. එහෙත් පොට්ඨපාද පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේ සමඟ සුහද කතා බස් කළේය. ප්‍රිය කතා සහ සිහි කටයුතු කතා පැවසීමෙන් පසු ඔහු එක් පැත්තකින් වාඩි විය. එක් පැත්තකින් වාඩි වී සිටි පොට්ඨපාද පරිබ්‍රාජකයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ එතනින් වැඩි කලක් ගතවීමට පෙර, අර පරිබ්‍රාජකයෝ මා වටලා වචනවලින් මා තෙරපූහ, ‘මේ භවත් පොට්ඨපාදයා ශ්‍රමණ ගෞතමයන් වහන්සේ යමක් දේශනා කරන්නේද, එයම අනුමත කරයි – ‘භාග්‍යවතුන් වහන්සේ එසේමය, සුගතයන් වහන්සේ එසේමය’ කියාය. අපි ශ්‍රමණ ගෞතමයන් වහන්සේ විසින් දේශනා කරන ලද කිසිදු එකාන්ත ධර්මයක් නොදනිමු – ‘ලෝකය සදාකාලිකය’ කියා හෝ, ‘ලෝකය අසදාකාලිකය’ කියා හෝ, ‘ලෝකය සීමා සහිතය’ කියා හෝ, ‘ලෝකය අසීමා සහිතය’ කියා හෝ, ‘ජීවය එයමය, ශරීරය එයමය’ කියා හෝ, ‘ජීවය එකකි, ශරීරය තව එකකි’ කියා හෝ, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටී’ කියා හෝ, ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටී’ කියා හෝ, ‘තථාගතයන් වහන්සේ මරණින් පසු සිටීද, නොසිටීද’ කියා හෝ, ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටීද, නොසිටී නොවේද’ කියා හෝ’ කියාය. ස්වාමීනි, මෙසේ කියනු ලැබූ මම, එම පරිබ්‍රාජකයන්ට මෙසේ කීවෙමි: ‘මිත්‍රවරුනි, මා ද ශ්‍රමණ ගෞතමයන් වහන්සේ විසින් දේශනා කරන ලද කිසිදු එකාන්ත ධර්මයක් නොදනිමි – ‘ලෝකය සදාකාලිකය’ කියා හෝ, ‘ලෝකය අසදාකාලිකය’ කියා හෝ… (පෙල). . . ‘තථාගතයන් වහන්සේ මරණින් පසු නොසිටීද, නොසිටී නොවේද’ කියා හෝ; එහෙත් ශ්‍රමණ ගෞතමයන් වහන්සේ සැබෑ වූ, සත්‍ය වූ, නොවෙනස් පිළිවෙතක්, ධර්මයේ ස්ථිරභාවය, ධර්මයේ නියමය පනවයි. සැබෑ වූ, සත්‍ය වූ, නොවෙනස් පිළිවෙතක්, ධර්මයේ ස්ථිරභාවය, ධර්මයේ නියමය පනවන්නා වූ (ශ්‍රමණ ගෞතමයන් වහන්සේගේ) මනා දේශනාව, මා වැනි ඥානවන්තයෙක් කෙසේ නම් මනා දේශනාවක් ලෙස අනුමත නොකරන්නේදැ?”",
      "paliTitle": "Cittahatthisāriputtapoṭṭhapādavatthu",
      "englishTitle": "Story of Cittahatthi, Sāriputta, and Poṭṭhapāda",
      "sinhalaTitle": "චිත‍්තහත‍්ථිසාරිපුත‍්තපොට‍්ඨපාද වස‍්තුව"
    },
    {
      "number": 423,
      "pali": "‘‘Sabbeva kho ete, poṭṭhapāda, paribbājakā andhā acakkhukā; tvaṃyeva nesaṃ eko cakkhumā. Ekaṃsikāpi hi kho, poṭṭhapāda, mayā dhammā desitā paññattā; anekaṃsikāpi hi kho, poṭṭhapāda, mayā dhammā desitā paññattā. ‘‘Katame ca te, poṭṭhapāda, mayā anekaṃsikā dhammā desitā paññattā? ‘Sassato loko’ti [lokoti vā (sī. ka.)] kho, poṭṭhapāda, mayā anekaṃsiko dhammo desito paññatto; ‘asassato loko’ti [lokoti vā (sī. ka.)] kho, poṭṭhapāda, mayā anekaṃsiko dhammo desito paññatto; ‘antavā loko’ti [lokoti vā (sī. ka.)] kho poṭṭhapāda…pe… ‘anantavā loko’ti [lokoti vā (sī. ka.)] kho poṭṭhapāda… ‘taṃ jīvaṃ taṃ sarīra’nti kho poṭṭhapāda… ‘aññaṃ jīvaṃ aññaṃ sarīra’nti kho poṭṭhapāda… ‘hoti tathāgato paraṃ maraṇā’ti kho poṭṭhapāda… na hoti tathāgato paraṃ maraṇā’ti kho poṭṭhapāda… ‘hoti ca na ca hoti tathāgato paraṃ maraṇā’ti kho poṭṭhapāda… ‘neva hoti na na hoti tathāgato paraṃ maraṇā’ti kho, poṭṭhapāda, mayā anekaṃsiko dhammo desito paññatto. ‘‘Kasmā ca te, poṭṭhapāda, mayā anekaṃsikā dhammā desitā paññattā? Na hete, poṭṭhapāda, atthasaṃhitā na dhammasaṃhitā na ādibrahmacariyakā na nibbidāya na virāgāya na nirodhāya na upasamāya na abhiññāya na sambodhāya na nibbānāya saṃvattanti. Tasmā te mayā anekaṃsikā dhammā desitā paññattā’’. ",
      "english": "Indeed, all these ascetics, Poṭṭhapāda, are blind, without sight; you alone among them are one with sight. Indeed, Poṭṭhapāda, I have taught and expounded doctrines that are definite; and indeed, Poṭṭhapāda, I have taught and expounded doctrines that are indefinite. And what are those indefinite doctrines, Poṭṭhapāda, that I have taught and expounded? ‘The world is eternal’ — indeed, Poṭṭhapāda, this is an indefinite doctrine taught and expounded by me; ‘the world is not eternal’ — indeed, Poṭṭhapāda, this is an indefinite doctrine taught and expounded by me; ‘the world is finite’ — indeed, Poṭṭhapāda; ‘the world is infinite’ — indeed, Poṭṭhapāda; ‘the soul is the same as the body’ — indeed, Poṭṭhapāda; ‘the soul is one thing, the body another’ — indeed, Poṭṭhapāda; ‘the Tathāgata exists after death’ — indeed, Poṭṭhapāda; ‘the Tathāgata does not exist after death’ — indeed, Poṭṭhapāda; ‘the Tathāgata both exists and does not exist after death’ — indeed, Poṭṭhapāda; ‘the Tathāgata neither exists nor does not exist after death’ — indeed, Poṭṭhapāda, this is an indefinite doctrine taught and expounded by me. And why, Poṭṭhapāda, have these indefinite doctrines been taught and expounded by me? Indeed, Poṭṭhapāda, these are not connected with the goal, not connected with the Dhamma, not fundamental to the holy life, not conducive to disenchantment, to dispassion, to cessation, to tranquility, to direct knowledge, to full enlightenment, to Nibbāna. That is why these indefinite doctrines have been taught and expounded by me.",
      "sinhala": "පොට්ඨපාද, මේ සියලු පරිබ්‍රාජකයෝ අන්ධයෝ ය, ඇස් නැත්තෝ ය. ඔබ පමණක් ඔවුන්ගෙන් එක් ඇස් ඇත්තෙක් වෙයි. පොට්ඨපාද, මා විසින් ඒකාංශික ධර්ම දේශනා කොට පණවා ඇත. අනේකාංශික ධර්ම ද මා විසින් දේශනා කොට පණවා ඇත.\n\nපොට්ඨපාද, මා විසින් දේශනා කොට පණවා ඇති ඒ අනේකාංශික ධර්ම කවරේද? ‘ලෝකය ශාශ්වතය’ යනු, පොට්ඨපාද, මා විසින් දේශනා කොට පණවා ඇති අනේකාංශික ධර්මයකි. ‘ලෝකය අශාශ්වතය’ යනු, පොට්ඨපාද, මා විසින් දේශනා කොට පණවා ඇති අනේකාංශික ධර්මයකි. ‘ලෝකය අන්ත සහිතය’ යනු, පොට්ඨපාද,... ‘ලෝකය අන්ත රහිතය’ යනු, පොට්ඨපාද,... ‘එයම ජීවය, එයම ශරීරය’ යනු, පොට්ඨපාද,... ‘අන්‍ය වූ ජීවයකි, අන්‍ය වූ ශරීරයකි’ යනු, පොට්ඨපාද,... ‘මරණින් මතු තථාගතයා පවතී’ යනු, පොට්ඨපාද,... ‘මරණින් මතු තථාගතයා නොපවතී’ යනු, පොට්ඨපාද,... ‘මරණින් මතු තථාගතයා පවතී ද, නොපවතී ද’ යනු, පොට්ඨපාද,... ‘මරණින් මතු තථාගතයා පවතී ද නොවේ, නොපවතී ද නොවේ’ යනු, පොට්ඨපාද, මා විසින් දේශනා කොට පණවා ඇති අනේකාංශික ධර්මයකි.\n\nපොට්ඨපාද, මා විසින් ඒ අනේකාංශික ධර්ම දේශනා කොට පණවා ඇත්තේ කුමක් නිසාද? පොට්ඨපාද, මේවා අර්ථ සහිත නොවේ, ධර්ම සහිත නොවේ, ආදී බ්‍රහ්මචර්යාවට අයත් නොවේ, කලකිරීමට හේතු නොවේ, නොඇලීමට හේතු නොවේ, නිරෝධයට හේතු නොවේ, සන්සිඳීමට හේතු නොවේ, අභිඥාවට හේතු නොවේ, සම්බෝධියට හේතු නොවේ, නිවනට හේතු නොවේ. එබැවින් මා විසින් ඒ අනේකාංශික ධර්ම දේශනා කොට පණවා ඇත.",
      "paliTitle": ""
    },
    {
      "number": 424,
      "pali": "‘‘Katame ca te, poṭṭhapāda, mayā ekaṃsikā dhammā desitā paññattā? Idaṃ dukkhanti kho, poṭṭhapāda, mayā ekaṃsiko dhammo desito paññatto. Ayaṃ dukkhasamudayoti kho, poṭṭhapāda, mayā ekaṃsiko dhammo desito paññatto. Ayaṃ dukkhanirodhoti kho, poṭṭhapāda, mayā ekaṃsiko dhammo desito paññatto. Ayaṃ dukkhanirodhagāminī paṭipadāti kho, poṭṭhapāda, mayā ekaṃsiko dhammo desito paññatto. ‘‘Kasmā ca te, poṭṭhapāda, mayā ekaṃsikā dhammā desitā paññattā? Ete, poṭṭhapāda, atthasaṃhitā, ete dhammasaṃhitā, ete ādibrahmacariyakā ete nibbidāya virāgāya nirodhāya upasamāya abhiññāya sambodhāya nibbānāya saṃvattanti. Tasmā te mayā ekaṃsikā dhammā desitā paññattā.",
      "english": "And what, Poṭṭhapāda, are those doctrines taught and declared by me as certain? This is suffering – that, Poṭṭhapāda, is a doctrine taught and declared by me as certain. This is the origin of suffering – that, Poṭṭhapāda, is a doctrine taught and declared by me as certain. This is the cessation of suffering – that, Poṭṭhapāda, is a doctrine taught and declared by me as certain. This is the path leading to the cessation of suffering – that, Poṭṭhapāda, is a doctrine taught and declared by me as certain.\n\nAnd why, Poṭṭhapāda, are these doctrines taught and declared by me as certain? These, Poṭṭhapāda, are connected with the goal, connected with the Dhamma, foundational to the holy life. These lead to disenchantment, dispassion, cessation, peace, direct knowledge, full enlightenment, and Nibbāna. That is why these doctrines are taught and declared by me as certain.",
      "sinhala": "පොට්ඨපාද, මා විසින් ඒකාන්ත වශයෙන් දේශනා කොට පනවන ලද ඒ ධර්‍ම කවරේද? පොට්ඨපාද, මේ දුක යැයි මා විසින් ඒකාන්ත වශයෙන් දේශනා කොට පනවන ලද ධර්‍මයකි. මේ දුක ඇතිවීම යැයි මා විසින් ඒකාන්ත වශයෙන් දේශනා කොට පනවන ලද ධර්‍මයකි. මේ දුක නැතිවීම යැයි මා විසින් ඒකාන්ත වශයෙන් දේශනා කොට පනවන ලද ධර්‍මයකි. මේ දුක නැතිවීම පිණිස පමුණුවන ප්‍රතිපදාව යැයි මා විසින් ඒකාන්ත වශයෙන් දේශනා කොට පනවන ලද ධර්‍මයකි.\n\nපොට්ඨපාද, මා විසින් ඒකාන්ත වශයෙන් ඒ ධර්‍ම දේශනා කොට පනවන ලද්දේ කුමක් නිසාද? පොට්ඨපාද, ඒ ධර්‍ම අර්ථයෙන් යුක්ත වෙයි, ධර්‍මයෙන් යුක්ත වෙයි, ආදි බ්‍රහ්මචරියාවට අයත් වෙයි. ඒ ධර්‍ම කලකිරීමට, නොඇලීමට, නැතිකිරීමට, සංසිඳවීමට, විශිෂ්ට ඥාණයට, අවබෝධයට, නිර්වාණයට පමුණුවයි. එහෙයින් ඒ ධර්‍ම මා විසින් ඒකාන්ත වශයෙන් දේශනා කොට පනවන ලද්දාහුය.",
      "paliTitle": "Ekaṃsikadhammo",
      "englishTitle": "The Certain Teaching",
      "sinhalaTitle": "ඒකාංසික ධර්මය"
    },
    {
      "number": 425,
      "pali": "‘‘Santi, poṭṭhapāda, eke samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘ekantasukhī attā hoti arogo paraṃ maraṇā’ti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto evaṃvādino evaṃdiṭṭhino – ‘‘ekantasukhī attā hoti arogo paraṃ maraṇā’ti? Te ce me evaṃ puṭṭhā ‘āmā’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto ekantasukhaṃ lokaṃ jānaṃ passaṃ viharathā’ti? Iti puṭṭhā ‘no’ti vadanti. ‘‘Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto ekaṃ vā rattiṃ ekaṃ vā divasaṃ upaḍḍhaṃ vā rattiṃ upaḍḍhaṃ vā divasaṃ ekantasukhiṃ attānaṃ sañjānāthā’ti [sampajānāthāti (sī. syā. ka.)]? Iti puṭṭhā ‘no’ti vadanti. Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto jānātha – ‘‘ayaṃ maggo ayaṃ paṭipadā ekantasukhassa lokassa sacchikiriyāyā’’’ti? Iti puṭṭhā ‘no’ti vadanti. ‘‘Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto yā tā devatā ekantasukhaṃ lokaṃ upapannā, tāsaṃ bhāsamānānaṃ saddaṃ suṇātha – ‘‘suppaṭipannāttha, mārisā, ujuppaṭipannāttha, mārisā, ekantasukhassa lokassa sacchikiriyāya; mayampi hi, mārisā, evaṃpaṭipannā ekantasukhaṃ lokaṃ upapannā’ti? Iti puṭṭhā ‘no’ti vadanti. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, nanu evaṃ sante tesaṃ samaṇabrāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bhante, evaṃ sante tesaṃ samaṇabrāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti.",
      "english": "There are, Potthapada, some ascetics and brahmins who hold such a view, who speak thus: 'The self is entirely happy and free from illness after death.' I approach them and say this: 'Is it truly the case, venerable sirs, that you hold such a view, that you speak thus: \"The self is entirely happy and free from illness after death?\"' When thus questioned by me, they affirm, 'Yes.'\n\nI then say this: 'But, venerable sirs, do you live knowing and seeing a world of unalloyed happiness?' When thus questioned, they say, 'No.'\n\nI then say this: 'But, venerable sirs, do you perceive your self as entirely happy for one night, or one day, or half a night, or half a day?' When thus questioned, they say, 'No.'\n\nI then say this: 'But, venerable sirs, do you know: \"This is the path, this is the way to realize a world of unalloyed happiness\"?' When thus questioned, they say, 'No.'\n\nI then say this: 'But, venerable sirs, do you hear the sound of those deities who have been reborn in a world of unalloyed happiness, speaking thus: \"Well practiced have you been, friends; rightly practiced have you been, friends, for the realization of a world of unalloyed happiness; for we too, friends, having practiced thus, have been reborn in a world of unalloyed happiness\"?' When thus questioned, they say, 'No.'\n\n'What do you think, Potthapada? Is it not the case that, this being so, the statement of those ascetics and brahmins turns out to be without foundation?'\n\n'Certainly, venerable sir, this being so, the statement of those ascetics and brahmins turns out to be without foundation.'",
      "sinhala": "පොට්ඨපාද, ඇතැම් ශ්‍රමණ බ්‍රාහ්මණයෝ ‘මරණින් මතු ආත්මය නිරෝගීව, එකාන්තයෙන්ම සැප සහිත වේ’ යන මෙවැනි වාදයක් දරති, මෙවැනි දෘෂ්ටියක් ඇත්තෝ වෙති. මම ඔවුන් වෙත එළඹ මෙසේ කියමි: ‘ආයුෂ්මත්වරුනි, ඔබලා ‘මරණින් මතු ආත්මය නිරෝගීව, එකාන්තයෙන්ම සැප සහිත වේ’ යන මෙවැනි වාදයක් දරන, මෙවැනි දෘෂ්ටියක් ඇති අය බව සැබෑද?’ මවිසින් මෙසේ විමසූ විට ඔවුහු ‘එසේය’ යි පිළිගනිති. මම ඔවුන්ට මෙසේ කියමි: ‘ආයුෂ්මත්වරුනි, ඔබලා එකාන්තයෙන්ම සැප සහිත වූ ලෝකයක් දැනගෙන, දැකගෙන වාසය කරනවාද?’ මෙසේ විමසූ විට ඔවුහු ‘නැත’ යි කියති. මම ඔවුන්ට මෙසේ කියමි: ‘ආයුෂ්මත්වරුනි, ඔබලා එක් රැයක් හෝ එක් දවසක් හෝ, අඩ රැයක් හෝ අඩ දවසක් හෝ එකාන්තයෙන්ම සැප සහිත ආත්මයක් හඳුනාගන්නවාද?’ මෙසේ විමසූ විට ඔවුහු ‘නැත’ යි කියති. මම ඔවුන්ට මෙසේ කියමි: ‘ආයුෂ්මත්වරුනි, ‘මේ මාර්ගය, මේ ප්‍රතිපදාව එකාන්තයෙන්ම සැප සහිත ලෝකය අවබෝධ කරගැනීම සඳහා ය’ යි ඔබලා දන්නවාද?’ මෙසේ විමසූ විට ඔවුහු ‘නැත’ යි කියති. මම ඔවුන්ට මෙසේ කියමි: ‘ආයුෂ්මත්වරුනි, එකාන්තයෙන්ම සැප සහිත ලෝකයකට උපන් දෙවිවරුන් ‘පින්වතුනි, ඔබලා එකාන්තයෙන්ම සැප සහිත ලෝකය අවබෝධ කරගැනීම සඳහා මැනවින් පිළිපන් අය වෙති, ඍජුව පිළිපන් අය වෙති. පින්වතුනි, අපිත් මේ අයුරින්ම පිළිපැද එකාන්තයෙන්ම සැප සහිත ලෝකයකට උපන්නෙමු’ යැයි කතා කරන හඬ ඔබලාට ඇසෙනවාද?’ මෙසේ විමසූ විට ඔවුහු ‘නැත’ යි කියති. පොට්ඨපාද, ඒ ගැන ඔබ කුමක් සිතන්නෙහිද? එසේ හෙයින් ඒ ශ්‍රමණ බ්‍රාහ්මණයන්ගේ ප්‍රකාශය පදනමක් නැති එකක් වන්නේ නොවේද?’” ‘භාග්‍යවතුන් වහන්ස, ඒකාන්තයෙන්ම එසේ හෙයින් ඒ ශ්‍රමණ බ්‍රාහ්මණයන්ගේ ප්‍රකාශය පදනමක් නැති එකක්ම වේ.’",
      "paliTitle": ""
    },
    {
      "number": 426,
      "pali": "‘‘Seyyathāpi, poṭṭhapāda, puriso evaṃ vadeyya – ‘ahaṃ yā imasmiṃ janapade janapadakalyāṇī, taṃ icchāmi taṃ kāmemī’ti. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, yaṃ tvaṃ janapadakalyāṇiṃ icchasi kāmesi, jānāsi taṃ janapadakalyāṇiṃ khattiyī vā brāhmaṇī vā vessī vā suddī vā’ti? Iti puṭṭho ‘no’ti vadeyya. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, yaṃ tvaṃ janapadakalyāṇiṃ icchasi kāmesi, jānāsi taṃ janapadakalyāṇiṃ evaṃnāmā evaṃgottāti vā, dīghā vā rassā vā majjhimā vā kāḷī vā sāmā vā maṅguracchavī vāti, amukasmiṃ gāme vā nigame vā nagare vā’ti? Iti puṭṭho ‘no’ti vadeyya. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, yaṃ tvaṃ na jānāsi na passasi, taṃ tvaṃ icchasi kāmesī’ti? Iti puṭṭho ‘āmā’ti vadeyya. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, nanu evaṃ sante tassa purisassa appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bhante, evaṃ sante tassa purisassa appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti. ‘‘Evameva kho, poṭṭhapāda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘ekantasukhī attā hoti arogo paraṃ maraṇā’ti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto evaṃvādino evaṃdiṭṭhino – ‘‘ekantasukhī attā hoti arogo paraṃ maraṇā’’’ti? Te ce me evaṃ puṭṭhā ‘āmā’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto ekantasukhaṃ lokaṃ jānaṃ passaṃ viharathā’ti? Iti puṭṭhā ‘no’ti vadanti. ‘‘Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto ekaṃ vā rattiṃ ekaṃ vā divasaṃ upaḍḍhaṃ vā rattiṃ upaḍḍhaṃ vā divasaṃ ekantasukhiṃ attānaṃ sañjānāthā’ti? Iti puṭṭhā ‘no’ti vadanti. Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto jānātha – ‘‘ayaṃ maggo ayaṃ paṭipadā ekantasukhassa lokassa sacchikiriyāyā’ti? Iti puṭṭhā ‘no’ti vadanti. ‘‘Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto yā tā devatā ekantasukhaṃ lokaṃ upapannā, tāsaṃ bhāsamānānaṃ saddaṃ suṇātha – ‘‘suppaṭipannāttha, mārisā, ujuppaṭipannāttha, mārisā, ekantasukhassa lokassa sacchikiriyāya; mayampi hi, mārisā, evaṃpaṭipannā ekantasukhaṃ lokaṃ upapannā’’’ti? Iti puṭṭhā ‘no’ti vadanti. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, nanu evaṃ sante tesaṃ samaṇabrāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bhante, evaṃ sante tesaṃ samaṇabrāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti.",
      "english": "Potthapada, suppose a man were to say, ‘I desire and long for the most beautiful woman in this country.’ Then they might say to him, ‘My good man, do you know whether this most beautiful woman whom you desire and long for is a khattiyā, a brahmin, a vessā, or a suddā?’ When asked this, he would say, ‘No.’ Then they might say to him, ‘My good man, do you know whether this most beautiful woman whom you desire and long for has such-and-such a name or such-and-such a clan, whether she is tall or short or of medium height, dark or fair or of golden complexion, or whether she lives in such-and-such a village or town or city?’ When asked this, he would say, ‘No.’ Then they might say to him, ‘My good man, do you desire and long for someone whom you do not know and have not seen?’ When asked this, he would say, ‘Yes.’ ‘What do you think, Potthapada? Isn't it true that in such a case, the man's speech would be unsubstantiated?’ ‘Indeed, Venerable Sir, in such a case, the man's speech would be unsubstantiated.’\n\n‘In the same way, Potthapada, those ascetics and brahmins who hold such views and teach thus: “The self is entirely happy and free from illness after death.” I approach them and say, ‘Is it true, Venerable Sirs, that you hold such views and teach thus: “The self is entirely happy and free from illness after death”?’ If they, when asked this by me, acknowledge it by saying, ‘Yes.’ Then I say to them, ‘But do you, Venerable Sirs, dwell having known and seen a world of unalloyed happiness?’ When asked this, they say, ‘No.’\n\n‘Then I say to them, ‘But do you, Venerable Sirs, perceive your self as entirely happy for one night or one day, or for half a night or half a day?’ When asked this, they say, ‘No.’ Then I say to them, ‘But do you, Venerable Sirs, know: “This is the path, this is the way to realize a world of unalloyed happiness”?’ When asked this, they say, ‘No.’\n\n‘Then I say to them, ‘But do you, Venerable Sirs, hear the sound of those deities who have been reborn in a world of unalloyed happiness, speaking thus: “Well-practiced you are, sirs, rightly practiced you are, sirs, for the realization of a world of unalloyed happiness; for we too, sirs, having practiced in this way, have been reborn in a world of unalloyed happiness”?’ When asked this, they say, ‘No.’\n\n‘What do you think, Potthapada? Isn't it true that in such a case, the speech of those ascetics and brahmins would be unsubstantiated?’ ‘Indeed, Venerable Sir, in such a case, the speech of those ascetics and brahmins would be unsubstantiated.’",
      "sinhala": "පොට්ඨපාද, යම් සේ පුරුෂයෙක් මෙසේ කියන්නේ නම්: ‘මේ ජනපදයේ යම් රූමත් තරුණියක් ඇද්ද, මම ඇය කැමති වෙමි, ඇය ආශා කරමි’ කියා. ඔහුට ඔවුහු මෙසේ කියති: ‘අහෝ පුරුෂය, ඔබ යම් රූමත් තරුණියක් කැමති වී ආශා කරන්නේද, ඒ රූමත් තරුණිය ක්ෂත්‍රිය කාන්තාවක්ද, බ්‍රාහ්මණ කාන්තාවක්ද, වෛශ්‍ය කාන්තාවක්ද, ශුද්‍ර කාන්තාවක්ද කියා ඔබ දන්නවාද?’ මෙසේ අසන ලද ඔහු ‘නැත’ කියා කියන්නේය. ඔහුට ඔවුහු මෙසේ කියති: ‘අහෝ පුරුෂය, ඔබ යම් රූමත් තරුණියක් කැමති වී ආශා කරන්නේද, ඒ රූමත් තරුණිය මෙවැනි නමක් ඇති, මෙවැනි ගෝත්‍රයක් ඇති තැනැත්තියක්ද, උස තැනැත්තියක්ද, මිටි තැනැත්තියක්ද, මධ්‍යම ප්‍රමාණයේ තැනැත්තියක්ද, කළු පැහැති තැනැත්තියක්ද, ස්‍යාම පැහැති තැනැත්තියක්ද, කැකුළු සමක් ඇති තැනැත්තියක්ද, අසුවල් ගමේ, නියම්ගමේ හෝ නගරයේ තැනැත්තියක්ද කියා ඔබ දන්නවාද?’ මෙසේ අසන ලද ඔහු ‘නැත’ කියා කියන්නේය. ඔහුට ඔවුහු මෙසේ කියති: ‘අහෝ පුරුෂය, ඔබ යමක් නොදන්නේද, නොදකින්නේද, ඒ දෙය ඔබ කැමති වී ආශා කරන්නේද?’ මෙසේ අසන ලද ඔහු ‘එසේය’ කියා කියන්නේය. පොට්ඨපාද, ඔබ මේ කුමක් සිතන්නෙහිද? එසේ වූ කල්හි ඒ පුරුෂයාගේ කථාව පදනම් විරහිත කථාවක් නොවේද? ‘ඇත්තෙන්ම භාග්‍යවතුන් වහන්ස, එසේ වූ කල්හි ඒ පුරුෂයාගේ කථාව පදනම් විරහිත කථාවක් වන්නේය’යි පිළිතුරු දුන්නේය.\n\nපොට්ඨපාද, එලෙසම යම් ශ්‍රමණ-බ්‍රාහ්මණයෝ ‘මරණින් මතු ආත්මය නිරෝගීව එකාන්තයෙන්ම සැප සහිත වන්නේය’ යනුවෙන් මෙවැනි වාද ඇත්තෝද, මෙවැනි දෘෂ්ටි ඇත්තෝද, මම ඔවුන් කරා එළඹ මෙසේ කියමි: ‘ආයුෂ්මත්නි, සැබවින්ම ඔබලා ‘මරණින් මතු ආත්මය නිරෝගීව එකාන්තයෙන්ම සැප සහිත වන්නේය’ යනුවෙන් මෙවැනි වාද ඇත්තෝද, මෙවැනි දෘෂ්ටි ඇත්තෝද?’ ඔවුහු මා විසින් මෙසේ අසන ලද්දාහු නම් ‘එසේය’යි පිළිගනිති. මම ඔවුන්ට මෙසේ කියමි: ‘නමුත් ආයුෂ්මත්නි, ඔබලා එකාන්තයෙන්ම සැප ඇති ලෝකයක් දැනගෙන, දැකගෙන වාසය කරන්නහුද?’ මෙසේ අසන ලද්දාහු ‘නැත’ කියා කියති.\n\nමම ඔවුන්ට මෙසේ කියමි: ‘නමුත් ආයුෂ්මත්නි, ඔබලා එක් රාත්‍රියක් හෝ එක් දවාලක් හෝ, අර්ධ රාත්‍රියක් හෝ අර්ධ දවාලක් හෝ, එකාන්තයෙන්ම සැප සහිත වූ ආත්මයක් සලකන්නහුද?’ මෙසේ අසන ලද්දාහු ‘නැත’ කියා කියති. මම ඔවුන්ට මෙසේ කියමි: ‘නමුත් ආයුෂ්මත්නි, ඔබලා ‘මෙයයි ඒ මාර්ගය, මෙයයි ඒ ප්‍රතිපදාව, එකාන්තයෙන්ම සැප ඇති ලෝකය සාක්ෂාත් කරගැනීම පිණිස’ කියා දන්නහුද?’ මෙසේ අසන ලද්දාහු ‘නැත’ කියා කියති.\n\nමම ඔවුන්ට මෙසේ කියමි: ‘නමුත් ආයුෂ්මත්නි, යම් දෙවිවරු එකාන්තයෙන්ම සැප ඇති ලෝකයට උපන්නාහුද, ඒ දෙවිවරුන්ගේ ‘මිත්‍රවරුනි, ඔබලා සුවචව පිළිපදින්නහුය, මිත්‍රවරුනි, ඔබලා ඍජුව පිළිපදින්නහුය, එකාන්තයෙන්ම සැප ඇති ලෝකය සාක්ෂාත් කරගැනීම පිණිස; මිත්‍රවරුනි, අපද මෙසේ පිළිපදිනු ලැබ, එකාන්තයෙන්ම සැප ඇති ලෝකයට උපන්නාහුය’ යනුවෙන් කියන හඬ ඔබලාට ඇසෙන්නහුද?’ මෙසේ අසන ලද්දාහු ‘නැත’ කියා කියති.\n\nපොට්ඨපාද, ඔබ මේ කුමක් සිතන්නෙහිද? එසේ වූ කල්හි ඒ ශ්‍රමණ-බ්‍රාහ්මණයන්ගේ කථාව පදනම් විරහිත කථාවක් නොවේද? ‘ඇත්තෙන්ම භාග්‍යවතුන් වහන්ස, එසේ වූ කල්හි ඒ ශ්‍රමණ-බ්‍රාහ්මණයන්ගේ කථාව පදනම් විරහිත කථාවක් වන්නේය’යි පිළිතුරු දුන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 427,
      "pali": "‘‘Seyyathāpi, poṭṭhapāda, puriso cātumahāpathe nisseṇiṃ kareyya pāsādassa ārohaṇāya. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, yassa tvaṃ [yaṃ tvaṃ (sī. ka.)] pāsādassa ārohaṇāya nisseṇiṃ karosi, jānāsi taṃ pāsādaṃ puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya ucco vā nīco vā majjhimo vā’ti? Iti puṭṭho ‘no’ti vadeyya. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, yaṃ tvaṃ na jānāsi na passasi, tassa tvaṃ pāsādassa ārohaṇāya nisseṇiṃ karosī’ti? Iti puṭṭho ‘āmā’ti vadeyya. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, nanu evaṃ sante tassa purisassa appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bhante, evaṃ sante tassa purisassa appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti. ‘‘Evameva kho, poṭṭhapāda, ye te samaṇabrāhmaṇā evaṃvādino evaṃdiṭṭhino – ‘ekantasukhī attā hoti arogo paraṃ maraṇā’ti. Tyāhaṃ upasaṅkamitvā evaṃ vadāmi – ‘saccaṃ kira tumhe āyasmanto evaṃvādino evaṃdiṭṭhino – ‘‘ekantasukhī attā hoti arogo paraṃ maraṇā’ti? Te ce me evaṃ puṭṭhā ‘āmā’ti paṭijānanti. Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto ekantasukhaṃ lokaṃ jānaṃ passaṃ viharathā’ti? Iti puṭṭhā ‘no’ti vadanti. ‘‘Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto ekaṃ vā rattiṃ ekaṃ vā divasaṃ upaḍḍhaṃ vā rattiṃ upaḍḍhaṃ vā divasaṃ ekantasukhiṃ attānaṃ sañjānāthā’ti? Iti puṭṭhā ‘no’ti vadanti. Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto jānātha ayaṃ maggo ayaṃ paṭipadā ekantasukhassa lokassa sacchikiriyāyā’ti? Iti puṭṭhā ‘no’ti vadanti. ‘‘Tyāhaṃ evaṃ vadāmi – ‘api pana tumhe āyasmanto yā tā devatā ekantasukhaṃ lokaṃ upapannā’ tāsaṃ devatānaṃ bhāsamānānaṃ saddaṃ suṇātha- ‘‘suppaṭipannāttha, mārisā, ujuppaṭipannāttha, mārisā, ekantasukhassa lokassa sacchikiriyāya; mayampi hi, mārisā, evaṃ paṭipannā ekantasukhaṃ lokaṃ upapannā’ti? Iti puṭṭhā ‘‘no’’ti vadanti. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, nanu evaṃ sante tesaṃ samaṇabrāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bhante, evaṃ sante tesaṃ samaṇabrāhmaṇānaṃ appāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti. ",
      "english": "Just as, Poṭṭhapāda, a man might build a ladder at a crossroads to ascend a palace. And they might say to him, 'Hey man, this palace that you are building a ladder to ascend – do you know whether it is to the east, south, west, or north, or whether it is high, low, or medium height?' When asked this, he would say, 'No.' Then they might say to him, 'Hey man, you are building a ladder to ascend a palace that you neither know nor see!' When asked this, he would say, 'Yes.' 'What do you think, Poṭṭhapāda, would not the statement of that man, in such a case, turn out to be unfounded?' 'Certainly, Venerable Sir, in such a case, the statement of that man would turn out to be unfounded.'\n\n'Just in the same way, Poṭṭhapāda, there are some ascetics and brahmins who hold such views and teach such doctrines: \"The self is entirely happy and free from illness after death.\" I approach them and say, \"Is it true, Venerable sirs, that you hold such views and teach such doctrines: 'The self is entirely happy and free from illness after death'?\" If, when asked this, they acknowledge it by saying, \"Yes,\" then I say to them, \"Do you, Venerable sirs, dwell knowing and seeing a world of unalloyed happiness?\" When asked this, they say, \"No.\"'\n\n'Then I say to them, \"Do you, Venerable sirs, perceive yourselves as dwelling in unalloyed happiness for a full night or a full day, or half a night or half a day?\" When asked this, they say, \"No.\" Then I say to them, \"Do you, Venerable sirs, know this path, this practice, for the realization of a world of unalloyed happiness?\" When asked this, they say, \"No.\"'\n\n'Then I say to them, \"Do you, Venerable sirs, hear the sound of those deities who have been reborn into a world of unalloyed happiness, speaking thus: 'You have practiced well, friends; you have practiced rightly, friends, for the realization of a world of unalloyed happiness; for we too, friends, having practiced thus, have been reborn into a world of unalloyed happiness'?\" When asked this, they say, \"No.\"'\n\n'What do you think, Poṭṭhapāda, would not the statement of those ascetics and brahmins, in such a case, turn out to be unfounded?' 'Certainly, Venerable Sir, in such a case, the statement of those ascetics and brahmins would turn out to be unfounded.'",
      "sinhala": "පොට්ඨපාද, යම් සේ පුරුෂයෙක් සතර මං සන්ධියක, ප්‍රාසාදයකට නැගීමට ඉණිමඟක් සාදයි. ඔහුට මෙසේ කියයි – ‘ඇවැත් පුරුෂය, ඔබ යම් ප්‍රාසාදයකට නැගීමට ඉණිමඟක් සාදන්නේද, ඒ ප්‍රාසාදය නැගෙනහිර දිශාවේ හෝ, දකුණු දිශාවේ හෝ, බටහිර දිශාවේ හෝ, උතුරු දිශාවේ හෝ තිබෙන්නේද, උස්ද, මිටිද, මධ්‍යමද යන්න ඔබ දන්නෙහිද?’ මෙසේ අසන ලද ඔහු ‘නැත’ යැයි කියයි. ඔහුට මෙසේ කියයි – ‘ඇවැත් පුරුෂය, ඔබ යමක් නොදන්නාද, නොදක්නෙහිද, ඒ ප්‍රාසාදයට නැගීමට ඔබ ඉණිමඟක් සාදන්නෙහිද?’ මෙසේ අසන ලද ඔහු ‘එසේය’ යැයි කියයි. පොට්ඨපාද, ඔබ මේ කුමක් සිතන්නෙහිද? එසේ වූ කල්හි ඒ පුරුෂයාගේ කතාව නිරර්ථක කතාවක් නොවේද? ‘ඇත්තෙන්ම භාග්‍ය​වතුන් වහන්ස, එසේ වූ කල්හි ඒ පුරුෂයාගේ කතාව නිරර්ථක කතාවක් වේ.’\n\nපොට්ඨපාද, එසේම යම් ශ්‍ර​මණ බ්‍රාහ්මණයෝ ‘මරණින් මතු ආත්මය නිරෝගීව ඒකාන්තයෙන්ම සුඛිත වේ’ යනුවෙන් මෙබඳු වාද ඇත්තෝ, මෙබඳු දෘෂ්ටි ඇත්තෝ වෙත්ද. මම ඔවුන් වෙත ගොස් මෙසේ කියමි – ‘ඇත්තෙන්ම ආයුෂ්මතුනි, ඔබලා ‘මරණින් මතු ආත්මය නිරෝගීව ඒකාන්තයෙන්ම සුඛිත වේ’ යනුවෙන් මෙබඳු වාද ඇත්තෝ, මෙබඳු දෘෂ්ටි ඇත්තෝද?’ ඔවුන් මෙසේ මා විසින් අසන ලද කල්හි ‘එසේය’ යැයි පිළිගනිත්. මම ඔවුන්ට මෙසේ කියමි – ‘එසේනම් ආයුෂ්මතුනි, ඔබලා ඒකාන්ත සුඛිත ලෝකයක් දැනගෙන, දැකගෙන වාසය කරන්නහුද?’ මෙසේ අසන ලද ඔව්හු ‘නැත’ යැයි කියති.\n\nමම ඔවුන්ට මෙසේ කියමි – ‘එසේනම් ආයුෂ්මතුනි, ඔබලා එක් රාත්‍රියක් හෝ එක් දවසක් හෝ, අඩ රාත්‍රියක් හෝ අඩ දවසක් හෝ, ආත්මය ඒකාන්තයෙන් සුඛිත බව අවබෝධ කරන්නහුද?’ මෙසේ අසන ලද ඔව්හු ‘නැත’ යැයි කියති. මම ඔවුන්ට මෙසේ කියමි – ‘එසේනම් ආයුෂ්මතුනි, මේ මාර්ගය, මේ ප්‍ර​තිපදාව ඒකාන්ත සුඛිත ලෝකය සාක්ෂාත් කිරීමට බව ඔබලා දන්නහුද?’ මෙසේ අසන ලද ඔව්හු ‘නැත’ යැයි කියති.\n\nමම ඔවුන්ට මෙසේ කියමි – ‘එසේනම් ආයුෂ්මතුනි, ඒකාන්ත සුඛිත ලෝකයට උපන් යම් දේවතාවෝ වෙත්ද, ඒ දේවතාවන් කතා කරන ශබ්දය ‘ඇවැත්නි, ඔබලා ඒකාන්ත සුඛිත ලෝකය සාක්ෂාත් කර ගැනීම සඳහා මැනවින් පිළිපන්නෝය. සෘජුව පිළිපන්නෝය. ඇවැත්නි, අපිද මෙසේ පිළිපැද ඒකාන්ත සුඛිත ලෝකයට උපන්නෙමු’ යනුවෙන් ඔබලාට ඇසෙන්නේද?’ මෙසේ අසන ලද ඔව්හු ‘නැත’ යැයි කියති.\n\nපොට්ඨපාද, ඔබ මේ කුමක් සිතන්නෙහිද? එසේ වූ කල්හි ඒ ශ්‍ර​මණ බ්‍රාහ්මණයන්ගේ කතාව නිරර්ථක කතාවක් නොවේද? ‘ඇත්තෙන්ම භාග්‍ය​වතුන් වහන්ස, එසේ වූ කල්හි ඒ ශ්‍ර​මණ බ්‍රාහ්මණයන්ගේ කතාව නිරර්ථක කතාවක් වේ.’",
      "paliTitle": ""
    },
    {
      "number": 428,
      "pali": "‘‘Tayo kho me, poṭṭhapāda, attapaṭilābhā – oḷāriko attapaṭilābho, manomayo attapaṭilābho, arūpo attapaṭilābho. Katamo ca, poṭṭhapāda, oḷāriko attapaṭilābho? Rūpī cātumahābhūtiko kabaḷīkārāhārabhakkho [kabaḷīkārabhakkho (syā. ka.)], ayaṃ oḷāriko attapaṭilābho. Katamo manomayo attapaṭilābho? Rūpī manomayo sabbaṅgapaccaṅgī ahīnindriyo, ayaṃ manomayo attapaṭilābho. Katamo arūpo attapaṭilābho? Arūpī saññāmayo, ayaṃ arūpo attapaṭilābho.",
      "english": "Potthapada, there are these three acquisitions of self for me: the gross acquisition of self, the mind-made acquisition of self, and the formless acquisition of self. And what, Potthapada, is the gross acquisition of self? It is that which is material, composed of the four great elements, and sustained by physical food; this is the gross acquisition of self. Which is the mind-made acquisition of self? It is that which is material, mind-made, complete in all its limbs and parts, and with unimpaired faculties; this is the mind-made acquisition of self. Which is the formless acquisition of self? It is that which is formless and composed of perception; this is the formless acquisition of self.",
      "sinhala": "පොට්ඨපාද, මා හට ආත්ම ප්‍රතිලාභ තුනක් ඇත – එනම් ඖදාරික ආත්ම ප්‍රතිලාභය, මනෝමය ආත්ම ප්‍රතිලාභය, සහ අරූප ආත්ම ප්‍රතිලාභයයි. පොට්ඨපාද, ඖදාරික ආත්ම ප්‍රතිලාභය යනු කුමක්ද? රූපී වූ, සතර මහා භූතයන්ගෙන් යුක්ත වූ, කබලිංකාර ආහාර අනුභව කරන්නා වූ ආත්ම ප්‍රතිලාභය ඖදාරික ආත්ම ප්‍රතිලාභයයි. මනෝමය ආත්ම ප්‍රතිලාභය යනු කුමක්ද? රූපී වූ, මනෝමය වූ, සර්වාංග සම්පූර්ණ වූ, අහීන ඉන්ද්‍රියයන්ගෙන් යුක්ත වූ ආත්ම ප්‍රතිලාභය මනෝමය ආත්ම ප්‍රතිලාභයයි. අරූප ආත්ම ප්‍රතිලාභය යනු කුමක්ද? අරූපී වූ, සංඥාමය වූ ආත්ම ප්‍රතිලාභය අරූප ආත්ම ප්‍රතිලාභයයි.",
      "paliTitle": "Tayo attapaṭilābhā",
      "englishTitle": "The Three Self-Attainments",
      "sinhalaTitle": "ආත්ම පටිලාභ තුන"
    },
    {
      "number": 429,
      "pali": "‘‘Oḷārikassapi kho ahaṃ, poṭṭhapāda, attapaṭilābhassa pahānāya dhammaṃ desemi – yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathāti. Siyā kho pana te, poṭṭhapāda, evamassa – saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati, dukkho ca kho vihāroti, na kho panetaṃ, poṭṭhapāda, evaṃ daṭṭhabbaṃ. Saṃkilesikā ceva dhammā pahīyissanti, vodāniyā ca dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati, pāmujjaṃ ceva bhavissati pīti ca passaddhi ca sati ca sampajaññañca sukho ca vihāro.",
      "english": "Potthapada, I teach the Dhamma for the abandonment of even the gross self-identification, so that for those among you who practice thus, defiling qualities will be abandoned, purifying qualities will increase, and having realized the perfection and fullness of wisdom for yourselves through direct knowledge in this very life, you will dwell having attained it. It might occur to you, Potthapada, that: ‘Defiling qualities will be abandoned, purifying qualities will increase, and having realized the perfection and fullness of wisdom for oneself through direct knowledge in this very life, one will dwell having attained it, but that dwelling will be painful.’ But Potthapada, this should not be seen in this way. Indeed, defiling qualities will be abandoned, and purifying qualities will increase, and having realized the perfection and fullness of wisdom for oneself through direct knowledge in this very life, one will dwell having attained it; there will also be joy, rapture, tranquility, mindfulness, clear comprehension, and a pleasant dwelling.",
      "sinhala": "පොට්ඨපාද, මම ඔබට ධර්‍මය දේශනා කරන්නේ ඉතා දළ වූ ආත්ම ලාභය පවා ප්‍රහාණය කිරීම පිණිසයි – එනම්, යම් පරිදි පිළිපදින ඔබට කෙලෙස් සහිත ධර්‍මයන් ප්‍රහීණ වී යන්නේය, සිත පිරිසිදු කරවන ධර්‍මයන් වර්ධනය වන්නේය, නුවණේ පාරිපූර්ණත්වයත් විපුලත්වයත් මේ අත්බැව්හිදීම තමා විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන වාසය කරන්නට හැකි වන පිණිසයි.\n\nපොට්ඨපාද, ඔබට මෙසේ සිතෙන්නට පුළුවන – ‘කෙලෙස් සහිත ධර්‍මයන් ප්‍රහීණ වී යන්නේය, සිත පිරිසිදු කරවන ධර්‍මයන් වර්ධනය වන්නේය, නුවණේ පාරිපූර්ණත්වයත් විපුලත්වයත් මේ අත්බැව්හිදීම තමා විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන වාසය කරන්නේය, නමුත් මේ වාසය දුක් සහිත වාසයකි’ කියා. එහෙත් පොට්ඨපාද, මේ කාරණය මෙසේ නොදැක්ක යුතුයි.\n\nකෙලෙස් සහිත ධර්‍මයන් ප්‍රහීණ වී යන්නේය, සිත පිරිසිදු කරවන ධර්‍මයන් වර්ධනය වන්නේය, නුවණේ පාරිපූර්ණත්වයත් විපුලත්වයත් මේ අත්බැව්හිදීම තමා විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන වාසය කරන්නේය, එමෙන්ම ප්‍රමෝදයද, ප්‍රීතියද, ශ්‍රමථයද, සතියද, සම්පජඤ්ඤයද ඇති වන්නේය, එමෙන්ම මේ වාසය සැප සහිත වාසයකි.",
      "paliTitle": ""
    },
    {
      "number": 430,
      "pali": "‘‘Manomayassapi kho ahaṃ, poṭṭhapāda, attapaṭilābhassa pahānāya dhammaṃ desemi yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathāti. Siyā kho pana te, poṭṭhapāda, evamassa – ‘saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati, dukkho ca kho vihāro’ti, na kho panetaṃ, poṭṭhapāda, evaṃ daṭṭhabbaṃ. Saṃkilesikā ceva dhammā pahīyissanti, vodāniyā ca dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati, pāmujjaṃ ceva bhavissati pīti ca passaddhi ca sati ca sampajaññañca sukho ca vihāro.",
      "english": "Indeed, Potthapada, I teach the Dhamma for the abandoning of even the mind-made self-attainment, so that for those among you who practice thus, defilements will be abandoned, purifying qualities will increase, and you will attain and dwell in the fullness and abundance of wisdom, having directly realized it for yourselves in this very life. Now, Potthapada, it might occur to you thus: ‘Defilements will be abandoned, purifying qualities will increase, and one will attain and dwell in the fullness and abundance of wisdom, having directly realized it for oneself in this very life, but this abiding is suffering.’ But, Potthapada, it should not be seen thus. Defilements will be abandoned, purifying qualities will increase, and one will attain and dwell in the fullness and abundance of wisdom, having directly realized it for oneself in this very life; furthermore, there will be joy, delight, tranquility, mindfulness, clear comprehension, and a pleasant abiding.",
      "sinhala": "පොට්ඨපාද, මනෝමය වූ ආත්ම ප්‍රතිලාභය පවා ප්‍ර‍හාණය කිරීම පිණිස මම ධර්‍මය දේශනා කරමි. එලෙස පිළිපදින ඔබලාගේ කෙලෙස් දහම් ප්‍ර‍හීණ වන්නේය; පිරිසුදු දහම් වැඩෙන්නේය; ප්‍ර‍ඥා පාරිපූර්ණත්වයද, විශාලත්වයද මෙලොවදීම තමන් විසින්ම අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන වාසය කරන්නේය.\n\nපොට්ඨපාද, ඔබට මෙසේ සිතක් ඇතිවිය හැක – ‘කෙලෙස් දහම් ප්‍ර‍හීණ වන්නේය, පිරිසුදු දහම් වැඩෙන්නේය, ප්‍ර‍ඥා පාරිපූර්ණත්වයද, විශාලත්වයද මෙලොවදීම තමන් විසින්ම අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන වාසය කරන්නේය. එහෙත් එය දුක් සහිත වාසයකි’ කියා. එහෙත් පොට්ඨපාද, මෙය එසේ නොදැක්ක යුතුය.\n\nකෙලෙස් දහම්ද ප්‍ර‍හීණ වන්නේය, පිරිසුදු දහම්ද වැඩෙන්නේය, ප්‍ර‍ඥා පාරිපූර්ණත්වයද, විශාලත්වයද මෙලොවදීම තමන් විසින්ම අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන වාසය කරන්නේය. එමෙන්ම ප්‍ර‍මෝදයද, ප්‍ර‍ීතියද, සන්සුන් බවද, සිහියද, සම්‍යක්‌ ඥානයද, සුඛ විහරණයද වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 431,
      "pali": "‘‘Arūpassapi kho ahaṃ, poṭṭhapāda, attapaṭilābhassa pahānāya dhammaṃ desemi yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathāti. Siyā kho pana te, poṭṭhapāda, evamassa – ‘saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati, dukkho ca kho vihāro’ti, na kho panetaṃ, poṭṭhapāda, evaṃ daṭṭhabbaṃ. Saṃkilesikā ceva dhammā pahīyissanti, vodāniyā ca dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissati, pāmujjaṃ ceva bhavissati pīti ca passaddhi ca sati ca sampajaññañca sukho ca vihāro.",
      "english": "Indeed, Poṭṭhapāda, I teach the Dhamma for the abandoning of even the formless acquisition of self, so that for those who practice accordingly, defiling qualities will be abandoned, purifying qualities will grow, and having realized and attained the perfection and full development of wisdom through your own direct knowledge in this very life, you will dwell. It might occur to you, Poṭṭhapāda, thus: ‘Defiling qualities will be abandoned, purifying qualities will grow, and having realized and attained the perfection and full development of wisdom through one’s own direct knowledge in this very life, one will dwell, but indeed, this dwelling is suffering.’ But indeed, Poṭṭhapāda, it should not be seen thus. Instead, defiling qualities will be abandoned, purifying qualities will grow, and having realized and attained the perfection and full development of wisdom through one’s own direct knowledge in this very life, one will dwell, and there will be delight, joy, tranquility, mindfulness, clear comprehension, and a pleasant dwelling.",
      "sinhala": "පොට්ඨපාද, අරූප ආත්මලාභය පවා ප්‍රහාණය කිරීම සඳහා මම ධර්මය දේශනා කරමි. යම් අයුරකින් පිළිපදින ඔබට සංකිලේශික ධර්මයන් ප්‍රහීණ වෙයි ද, වෝදානීය ධර්මයන් වර්ධනය වෙයි ද, නුවණින් පිරිපුන් බවත්, විපුල බවත් මේ ආත්මභාවයේ දී ම තමන් විසින්ම අවබෝධ කරගෙන ප්‍රත්‍යක්ෂ කොට වාසය කරනු ඇත.\n\nඑහෙත් පොට්ඨපාද, ඔබට මෙසේ සිතක් ඇතිවිය හැකිය: 'සංකිලේශික ධර්මයන් ප්‍රහීණ වනු ඇත, වෝදානීය ධර්මයන් වර්ධනය වනු ඇත, නුවණින් පිරිපුන් බවත්, විපුල බවත් මේ ආත්මභාවයේ දී ම තමන් විසින්ම අවබෝධ කරගෙන ප්‍රත්‍යක්ෂ කොට වාසය කරනු ඇත, එහෙත් එම වාසය දුක් සහිත ය' යි. එහෙත් පොට්ඨපාද, මෙය එසේ නොදැක්ක යුතු ය.\n\nසංකිලේශික ධර්මයන් ප්‍රහීණ වෙයි, වෝදානීය ධර්මයන් වර්ධනය වෙයි, නුවණින් පිරිපුන් බවත්, විපුල බවත් මේ ආත්මභාවයේ දී ම තමන් විසින්ම අවබෝධ කරගෙන ප්‍රත්‍යක්ෂ කොට වාසය කරනු ඇත, තවද ප්‍රමෝදය ද, ප්‍රීතිය ද, ප්‍රශාන්තිය ද, සිහිය ද, සම්පජඤ්ඤය ද, සැප විහරණය ද ඇතිවනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 432,
      "pali": "‘‘Pare ce, poṭṭhapāda, amhe evaṃ puccheyyuṃ – ‘katamo pana so, āvuso, oḷāriko attapaṭilābho, yassa tumhe pahānāya dhammaṃ desetha, yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti, tesaṃ mayaṃ evaṃ puṭṭhā evaṃ byākareyyāma – ‘ayaṃ vā so, āvuso, oḷāriko attapaṭilābho, yassa mayaṃ pahānāya dhammaṃ desema, yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti.",
      "english": "\"If, Poṭṭhapāda, others were to ask us thus: 'Friends, what exactly is that gross acquiring of self for the abandoning of which you teach the Dhamma, so that for those who practice accordingly, defiling states will be abandoned, purifying states will grow, and you will, having directly known and realized for yourselves the fullness and extensive development of wisdom in this very life, abide therein?' When thus asked by them, we would answer thus: 'Friends, it is this gross acquiring of self for the abandoning of which we teach the Dhamma, so that for those who practice accordingly, defiling states will be abandoned, purifying states will grow, and you will, having directly known and realized for yourselves the fullness and extensive development of wisdom in this very life, abide therein.'\"",
      "sinhala": "පොට්ඨපාද, අන්‍යයෝ අපගෙන් මෙසේ අසන්නේ නම්: ‘ඇවැත්නි, කුමන ස්ථූල ආත්මලාභයක් ප්‍ර‌හාණය කිරීම සඳහා ඔබලා ධර‍්මය දේශනා කරන්නේද? යම් පිළිවෙතක් අනුගමනය කරන ඔබගේ කෙලෙස් සහිත ධර‍්මයන් ප්‍ර‌හීණ වන්නේද, පිරිසිදු ධර‍්මයන් වැඩෙන්නේද, ප්‍ර‌ඥාවේ පිරිපුන් බව සහ විශාලත්වය මේ ආත්මභාවය තුළම තමන් විසින්ම අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන, උපසම්පදා වී වාසය කරන්නේද?’\n\nඔවුන් විසින් මෙසේ අසන ලද අපි මෙසේ පිළිතුරු දෙන්නෙමු: ‘ඇවැත්නි, මේ ස්ථූල ආත්මලාභයයි. යම් ස්ථූල ආත්මලාභයක් ප්‍ර‌හාණය කිරීම සඳහා අපි ධර‍්මය දේශනා කරමු. යම් පිළිවෙතක් අනුගමනය කරන ඔබගේ කෙලෙස් සහිත ධර‍්මයන් ප්‍ර‌හීණ වන්නේද, පිරිසිදු ධර‍්මයන් වැඩෙන්නේද, ප්‍ර‌ඥාවේ පිරිපුන් බව සහ විශාලත්වය මේ ආත්මභාවය තුළම තමන් විසින්ම අවබෝධ කරගෙන, සාක්ෂාත් කරගෙන, උපසම්පදා වී වාසය කරන්නේද?’",
      "paliTitle": ""
    },
    {
      "number": 433,
      "pali": "‘‘Pare ce, poṭṭhapāda, amhe evaṃ puccheyyuṃ – ‘katamo pana so, āvuso, manomayo attapaṭilābho, yassa tumhe pahānāya dhammaṃ desetha, yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti? Tesaṃ mayaṃ evaṃ puṭṭhā evaṃ byākareyyāma – ‘ayaṃ vā so, āvuso, manomayo attapaṭilābho yassa mayaṃ pahānāya dhammaṃ desema, yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti.",
      "english": "If others, Poṭṭhapāda, were to question us thus: ‘But what, friends, is that mentally-formed self-acquisition for the abandonment of which you teach the Dhamma, so that for those who practice accordingly, defiling qualities will be abandoned, purifying qualities will increase, and you will, having directly known and realized for yourselves the full perfection and extensive development of wisdom in this very life, abide therein?’ When questioned thus, we would answer them thus: ‘Friends, this is that mentally-formed self-acquisition for the abandonment of which we teach the Dhamma, so that for those who practice accordingly, defiling qualities will be abandoned, purifying qualities will increase, and you will, having directly known and realized for yourselves the full perfection and extensive development of wisdom in this very life, abide therein.’",
      "sinhala": "පොට්ඨපාද, අන්‍යයෝ අපෙන් මෙසේ අසන්නට පුළුවන: ‘ඇවැත්නි, යමක් දුරු කිරීම පිණිස ඔබ ධර්මය දේශනා කරන්නේද, යම් පරිදි පිළිපදින්නවුන්ගේ කෙලෙස් සහිත ධර්මයන් දුරු වන්නේද, පිරිසිදු ධර්මයන් වැඩෙන්නේද, මේ ආත්මභාවයේදීම තමන් විසින්ම අභිඥා ඥානයෙන් සාක්ෂාත් කොට, ප්‍රඥාවේ පාරිපූර්ණත්වයත් විපුලත්වයත් ලබා වාසය කරන්නේද, ඒ සිතින් මවන ලද ආත්ම ප්‍රතිලාභය කවරේද?’ ඔවුහු අපෙන් මෙසේ ඇසුවොත්, අපි මෙසේ පිළිතුරු දෙන්නෙමු: ‘ඇවැත්නි, යමක් දුරු කිරීම පිණිස අපි ධර්මය දේශනා කරන්නෙමුද, යම් පරිදි පිළිපදින්නවුන්ගේ කෙලෙස් සහිත ධර්මයන් දුරු වන්නේද, පිරිසිදු ධර්මයන් වැඩෙන්නේද, මේ ආත්මභාවයේදීම තමන් විසින්ම අභිඥා ඥානයෙන් සාක්ෂාත් කොට, ප්‍රඥාවේ පාරිපූර්ණත්වයත් විපුලත්වයත් ලබා වාසය කරන්නේද, ඒ සිතින් මවන ලද ආත්ම ප්‍රතිලාභය මේය.’",
      "paliTitle": ""
    },
    {
      "number": 434,
      "pali": "‘‘Pare ce, poṭṭhapāda, amhe evaṃ puccheyyuṃ – ‘katamo pana so, āvuso, arūpo attapaṭilābho, yassa tumhe pahānāya dhammaṃ desetha, yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti, tesaṃ mayaṃ evaṃ puṭṭhā evaṃ byākareyyāma – ‘ayaṃ vā so, āvuso, arūpo attapaṭilābho yassa mayaṃ pahānāya dhammaṃ desema, yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, nanu evaṃ sante sappāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bhante, evaṃ sante sappāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti.",
      "english": "If others, Potthapada, were to question us thus: 'What then, friends, is that formless acquisition of self, for the abandonment of which you teach the Dhamma, so that for those who practice accordingly, defiling qualities will be abandoned, purifying qualities will increase, and having realized for themselves through direct knowledge and attained the fullness and abundance of wisdom in this very life, they will abide?' When questioned thus, we would answer them thus: 'This, friends, is that formless acquisition of self, for the abandonment of which we teach the Dhamma, so that for those who practice accordingly, defiling qualities will be abandoned, purifying qualities will increase, and having realized for themselves through direct knowledge and attained the fullness and abundance of wisdom in this very life, they will abide.'\n\nWhat do you think, Potthapada, wouldn't such a statement be considered wondrous? Certainly, Venerable Sir, such a statement would indeed be considered wondrous.",
      "sinhala": "‘‘පොට්ඨපාද, අන්‍යයෝ අපගෙන් මෙසේ අසත්නම් – ‘ඇවැත්නි, නුඹලා යම් අරූප ආත්ම ලාභයක් ප්‍රහාණය කිරීම පිණිස ධර්මය දේශනා කරන්නහුද, ඒ අරූප ආත්ම ලාභය කවරේද? යම්සේ පිළිපදින්නා වූ නුඹලාට කෙලෙස් සහිත ධර්මයන් ප්‍රහීණ වන්නේද, පිරිසිදු ධර්මයන් වැඩෙන්නේද, මේ ආත්මභාවයේදීම තමන් විසින්ම අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට පූර්ණ ප්‍රඥාවට පැමිණ වාසය කරන්නහුද?’ මෙසේ අපගෙන් විමසූ කල්හි අපි මෙසේ පිළිතුරු දෙන්නෙමු – ‘ඇවැත්නි, යම් අරූප ආත්ම ලාභයක් ප්‍රහාණය කිරීම පිණිස අපි ධර්මය දේශනා කරන්නෙමුද, ඒ අරූප ආත්ම ලාභය මෙය වේ. යම්සේ පිළිපදින්නා වූ නුඹලාට කෙලෙස් සහිත ධර්මයන් ප්‍රහීණ වන්නේද, පිරිසිදු ධර්මයන් වැඩෙන්නේද, මේ ආත්මභාවයේදීම තමන් විසින්ම අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට පූර්ණ ප්‍රඥාවට පැමිණ වාසය කරන්නහුද?’\n\nපොට්ඨපාද, ඔබ මේ කුමක් සිතන්නෙහිද? මෙසේ වන කල්හි ප්‍රාතිහාර්යයක් සහිත වූ ප්‍රකාශනයක් සිද්ධ වන්නේ නේද?\n\nභාග්‍යවතුන් වහන්ස, සැබවින්ම මෙසේ වන කල්හි ප්‍රාතිහාර්යයක් සහිත වූ ප්‍රකාශනයක් සිද්ධ වේ.",
      "paliTitle": ""
    },
    {
      "number": 435,
      "pali": "‘‘Seyyathāpi, poṭṭhapāda, puriso nisseṇiṃ kareyya pāsādassa ārohaṇāya tasseva pāsādassa heṭṭhā. Tamenaṃ evaṃ vadeyyuṃ – ‘ambho purisa, yassa tvaṃ pāsādassa ārohaṇāya nisseṇiṃ karosi, jānāsi taṃ pāsādaṃ, puratthimāya vā disāya dakkhiṇāya vā disāya pacchimāya vā disāya uttarāya vā disāya ucco vā nīco vā majjhimo vā’ti? So evaṃ vadeyya – ‘ayaṃ vā so, āvuso, pāsādo, yassāhaṃ ārohaṇāya nisseṇiṃ karomi, tasseva pāsādassa heṭṭhā’ti. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, nanu evaṃ sante tassa purisassa sappāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bhante, evaṃ sante tassa purisassa sappāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti.",
      "english": "Just as, Poṭṭhapāda, a man might make a ladder for climbing a palace, at the very foot of that palace. And they would say to him, 'Hey fellow, this palace for which you are making a ladder to climb—do you know that palace, whether it is in the eastern, southern, western, or northern direction, whether it is high, low, or of medium height?' He would say, 'Friends, this is that palace for which I am making a ladder to climb, right here at the foot of that very palace.'\n\nWhat do you think, Poṭṭhapāda, would not the statement of that man be perplexing then?\n\n\"Certainly, Venerable Sir, in that case, the statement of that man would be perplexing.\"",
      "sinhala": "පොට්ඨපාද, යම් සේ පුරුෂයෙක් මාළිගාවට නැගීම සඳහා ඒ මාළිගාවටම යටින් ඉණිමඟක් සාදන්නේ ය. ඔවුන් ඔහුට මෙසේ කියන්නේ ය: ‘ඒයි පුරුෂය, ඔබ යම් මාළිගාවක් නැගීම සඳහා ඉණිමඟක් සාදන්නේ ද, ඔබ ඒ මාළිගාව දන්නවාද? එය නැගෙනහිර දිශාවේ ද, දකුණු දිශාවේ ද, බටහිර දිශාවේ ද, උතුරු දිශාවේ ද? උස ද, මිටි ද, මධ්‍යම ද?’ කියා. ඔහු මෙසේ කියන්නේ ය: ‘මිත්‍රවරුනි, මා යම් මාළිගාවක් නැගීම සඳහා ඉණිමඟක් සාදන්නේ ද, ඒ මාළිගාවටම යටින් පිහිටි මාළිගාව මේය’ කියා. පොට්ඨපාද, ඔබ මේ පිළිබඳව කුමක් සිතන්නෙහි ද? එසේ වූ කල, ඒ පුරුෂයාගේ කථාව අතාර්කික ප්‍රකාශයක් නොවේ ද?\n\nභාග්‍ය​වතුන් වහන්ස, ඒකාන්තයෙන්ම එසේ වූ කල, ඒ පුරුෂයාගේ කථාව අතාර්කික ප්‍රකාශයක් බවට පත්වන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 436,
      "pali": "‘‘Evameva kho, poṭṭhapāda, pare ce amhe evaṃ puccheyyuṃ – ‘katamo pana so, āvuso, oḷāriko attapaṭilābho…pe… katamo pana so, āvuso, manomayo attapaṭilābho…pe… katamo pana so, āvuso, arūpo attapaṭilābho, yassa tumhe pahānāya dhammaṃ desetha, yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti, tesaṃ mayaṃ evaṃ puṭṭhā evaṃ byākareyyāma – ‘ayaṃ vā so, āvuso, arūpo attapaṭilābho, yassa mayaṃ pahānāya dhammaṃ desema, yathāpaṭipannānaṃ vo saṃkilesikā dhammā pahīyissanti, vodāniyā dhammā abhivaḍḍhissanti, paññāpāripūriṃ vepullattañca diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissathā’ti. ‘‘Taṃ kiṃ maññasi, poṭṭhapāda, nanu evaṃ sante sappāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti? ‘‘Addhā kho, bhante, evaṃ sante sappāṭihīrakataṃ bhāsitaṃ sampajjatī’’ti.",
      "english": "\"Just so, Poṭṭhapāda, if others were to ask us this: ‘Friend, what is that gross acquisition of self... what is that mind-made acquisition of self... what is that formless acquisition of self for the abandoning of which you teach the Dhamma, so that for those who practice accordingly, defiling states will be abandoned, purifying states will grow, and they will, having directly known and realized for themselves in this very life the fullness and breadth of wisdom, dwell therein?’ When asked thus, we would answer them thus: ‘Friend, this is that formless acquisition of self for the abandoning of which we teach the Dhamma, so that for those who practice accordingly, defiling states will be abandoned, purifying states will grow, and they will, having directly known and realized for themselves in this very life the fullness and breadth of wisdom, dwell therein.’\"\n\n\"What do you think, Poṭṭhapāda, would not such a statement, in this way, be an amazing discourse?\"\n\n\"Indeed, Venerable Sir, such a statement would, in this way, be an amazing discourse.\"",
      "sinhala": "පොට්ඨපාද, මේ අයුරින්ම, අනුන් අපෙන් මෙසේ විමසන්නේ නම් – ‘ඇවැත්නි, ඔබලා විසින් අත්හැරීම පිණිස ධර්මය දේශනා කරනු ලබන, යම් පිළිවෙතක් පිළිපැදීමෙන් ඔබලාගේ කෙලෙස් දහම් ප්‍රහීණ වී යනවාද, පිරිසිදු දහම් වැඩෙනවාද, තමන් විසින්ම අවබෝධයෙන් ප්‍රත්‍යක්ෂ කොට පූර්ණ ප්‍රඥාවෙන් යුක්තව මේ ආත්මභාවයේදීම වාසය කරනු ලබනවාද, එවැනි ඕලාරික ආත්ම ප්‍රතිලාභය කුමක්ද? ... යම් එවැනි මනෝමය ආත්ම ප්‍රතිලාභයක් වේද, එය කුමක්ද? ... යම් එවැනි අරූප ආත්ම ප්‍රතිලාභයක් වේද, එය කුමක්ද?’ කියා, එවිට අප ඒ අයට මෙසේ විමසූ විට මෙසේ පිළිතුරු දෙන්නෙමු – ‘ඇවැත්නි, අප විසින් අත්හැරීම පිණිස ධර්මය දේශනා කරනු ලබන, යම් පිළිවෙතක් පිළිපැදීමෙන් ඔබලාගේ කෙලෙස් දහම් ප්‍රහීණ වී යනවාද, පිරිසිදු දහම් වැඩෙනවාද, පූර්ණ ප්‍රඥාවෙන් යුක්තව මේ ආත්මභාවයේදීම තමන් විසින්ම අවබෝධයෙන් ප්‍රත්‍යක්ෂ කොට වාසය කරනු ලබනවාද, ඒ අරූප ආත්ම ප්‍රතිලාභය මෙයයි’ කියා.\n\nපොට්ඨපාද, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මෙසේ වූ කල, ප්‍රාතිහාර්යවත් දේශනාවක් සිදු නොවේද? භාග්‍යවතුන් වහන්ස, ඇත්තෙන්ම, මෙසේ වූ කල, ප්‍රාතිහාර්යවත් දේශනාවක් සිදුවේ.",
      "paliTitle": ""
    },
    {
      "number": 437,
      "pali": "Evaṃ vutte citto hatthisāriputto bhagavantaṃ etadavoca – ‘‘yasmiṃ, bhante, samaye oḷāriko attapaṭilābho hoti, moghassa tasmiṃ samaye manomayo attapaṭilābho hoti, mogho arūpo attapaṭilābho hoti; oḷāriko vāssa attapaṭilābho tasmiṃ samaye sacco hoti. Yasmiṃ, bhante, samaye manomayo attapaṭilābho hoti, moghassa tasmiṃ samaye oḷāriko attapaṭilābho hoti, mogho arūpo attapaṭilābho hoti; manomayo vāssa attapaṭilābho tasmiṃ samaye sacco hoti. Yasmiṃ, bhante, samaye arūpo attapaṭilābho hoti, moghassa tasmiṃ samaye oḷāriko attapaṭilābho hoti, mogho manomayo attapaṭilābho hoti; arūpo vāssa attapaṭilābho tasmiṃ samaye sacco hotī’’ti. ‘‘Yasmiṃ, citta, samaye oḷāriko attapaṭilābho hoti, neva tasmiṃ samaye manomayo attapaṭilābhoti saṅkhaṃ gacchati, na arūpo attapaṭilābhoti saṅkhaṃ gacchati; oḷāriko attapaṭilābhotveva tasmiṃ samaye saṅkhaṃ gacchati. Yasmiṃ, citta, samaye manomayo attapaṭilābho hoti, neva tasmiṃ samaye oḷāriko attapaṭilābhoti saṅkhaṃ gacchati, na arūpo attapaṭilābhoti saṅkhaṃ gacchati; manomayo attapaṭilābhotveva tasmiṃ samaye saṅkhaṃ gacchati. Yasmiṃ, citta, samaye arūpo attapaṭilābho hoti, neva tasmiṃ samaye oḷāriko attapaṭilābhoti saṅkhaṃ gacchati, na manomayo attapaṭilābhoti saṅkhaṃ gacchati; arūpo attapaṭilābhotveva tasmiṃ samaye saṅkhaṃ gacchati.",
      "english": "When this was said, Citta Hatthisāriputta addressed the Blessed One: \"Venerable sir, at whatever time there is a gross mode of existence, at that time a mind-made mode of existence is considered unreal, and a formless mode of existence is considered unreal; rather, at that time, only the gross mode of existence is considered real. At whatever time there is a mind-made mode of existence, at that time a gross mode of existence is considered unreal, and a formless mode of existence is considered unreal; rather, at that time, only the mind-made mode of existence is considered real. At whatever time there is a formless mode of existence, at that time a gross mode of existence is considered unreal, and a mind-made mode of existence is considered unreal; rather, at that time, only the formless mode of existence is considered real.\"\n\n\"Citta, at whatever time there is a gross mode of existence, at that time it is neither reckoned as a mind-made mode of existence, nor reckoned as a formless mode of existence; rather, at that time, it is reckoned only as a gross mode of existence. Citta, at whatever time there is a mind-made mode of existence, at that time it is neither reckoned as a gross mode of existence, nor reckoned as a formless mode of existence; rather, at that time, it is reckoned only as a mind-made mode of existence. Citta, at whatever time there is a formless mode of existence, at that time it is neither reckoned as a gross mode of existence, nor reckoned as a mind-made mode of existence; rather, at that time, it is reckoned only as a formless mode of existence.\"",
      "sinhala": "මෙසේ කී කල්හි චිත්ත හත්ථිසාරිපුත්තෝ භාග්‍ය‍වතුන් වහන්සේට මෙය කීවේය: ''වහන්ස, යම් සමයෙක ඕළාරික ආත්ම ප‍්‍රතිලාභයක් වේද, ඒ සමයෙහි මනෝමය ආත්ම ප‍්‍රතිලාභය නිෂ්ඵල වෙයි, අරූප ආත්ම ප‍්‍රතිලාභය නිෂ්ඵල වෙයි. නැතිනම් ඕළාරික ආත්ම ප‍්‍රතිලාභයම ඒ සමයෙහි සත්‍ය‍ වෙයි. වහන්ස, යම් සමයෙක මනෝමය ආත්ම ප‍්‍රතිලාභයක් වේද, ඒ සමයෙහි ඕළාරික ආත්ම ප‍්‍රතිලාභය නිෂ්ඵල වෙයි, අරූප ආත්ම ප‍්‍රතිලාභය නිෂ්ඵල වෙයි. නැතිනම් මනෝමය ආත්ම ප‍්‍රතිලාභයම ඒ සමයෙහි සත්‍ය‍ වෙයි. වහන්ස, යම් සමයෙක අරූප ආත්ම ප‍්‍රතිලාභයක් වේද, ඒ සමයෙහි ඕළාරික ආත්ම ප‍්‍රතිලාභය නිෂ්ඵල වෙයි, මනෝමය ආත්ම ප‍්‍රතිලාභය නිෂ්ඵල වෙයි. නැතිනම් අරූප ආත්ම ප‍්‍රතිලාභයම ඒ සමයෙහි සත්‍ය‍ වෙයි.''\n\n''චිත්තය, යම් සමයෙක ඕළාරික ආත්ම ප‍්‍රතිලාභයක් වේද, ඒ සමයෙහි එය මනෝමය ආත්ම ප‍්‍රතිලාභයක් වශයෙන් ගණන් නොගැනේ, අරූප ආත්ම ප‍්‍රතිලාභයක් වශයෙන්ද ගණන් නොගැනේ. ඒ සමයෙහි ඕළාරික ආත්ම ප‍්‍රතිලාභයක් වශයෙන්ම එය ගණන් ගැනේ. චිත්තය, යම් සමයෙක මනෝමය ආත්ම ප‍්‍රතිලාභයක් වේද, ඒ සමයෙහි එය ඕළාරික ආත්ම ප‍්‍රතිලාභයක් වශයෙන් ගණන් නොගැනේ, අරූප ආත්ම ප‍්‍රතිලාභයක් වශයෙන්ද ගණන් නොගැනේ. ඒ සමයෙහි මනෝමය ආත්ම ප‍්‍රතිලාභයක් වශයෙන්ම එය ගණන් ගැනේ. චිත්තය, යම් සමයෙක අරූප ආත්ම ප‍්‍රතිලාභයක් වේද, ඒ සමයෙහි එය ඕළාරික ආත්ම ප‍්‍රතිලාභයක් වශයෙන් ගණන් නොගැනේ, මනෝමය ආත්ම ප‍්‍රතිලාභයක් වශයෙන්ද ගණන් නොගැනේ. ඒ සමයෙහි අරූප ආත්ම ප‍්‍රතිලාභයක් වශයෙන්ම එය ගණන් ගැනේ.''",
      "paliTitle": ""
    },
    {
      "number": 438,
      "pali": "‘‘Sace taṃ, citta, evaṃ puccheyyuṃ – ‘ahosi tvaṃ atītamaddhānaṃ, na tvaṃ nāhosi; bhavissasi tvaṃ anāgatamaddhānaṃ, na tvaṃ na bhavissasi; atthi tvaṃ etarahi, na tvaṃ natthī’ti, evaṃ puṭṭho tvaṃ, citta, kinti byākareyyāsī’’ti? ‘‘Sace maṃ, bhante, evaṃ puccheyyuṃ – ‘ahosi tvaṃ atītamaddhānaṃ, na tvaṃ na ahosi; bhavissasi tvaṃ anāgatamaddhānaṃ, na tvaṃ na bhavissasi; atthi tvaṃ etarahi, na tvaṃ natthī’ti. Evaṃ puṭṭho ahaṃ, bhante, evaṃ byākareyyaṃ – ‘ahosāhaṃ atītamaddhānaṃ, nāhaṃ na ahosiṃ; bhavissāmahaṃ anāgatamaddhānaṃ, nāhaṃ na bhavissāmi; atthāhaṃ etarahi, nāhaṃ natthī’ti. Evaṃ puṭṭho ahaṃ, bhante, evaṃ byākareyya’’nti. ‘‘Sace pana taṃ, citta, evaṃ puccheyyuṃ – ‘yo te ahosi atīto attapaṭilābho, sova [sveva (sī. pī.), soyeva (syā.)] te attapaṭilābho sacco, mogho anāgato, mogho paccuppanno? Yo [yo vā (pī.)] te bhavissati anāgato attapaṭilābho, sova te attapaṭilābho sacco, mogho atīto, mogho paccuppanno? Yo [yo vā (pī.)] te etarahi paccuppanno attapaṭilābho, sova [so ca (ka.)] te attapaṭilābho sacco, mogho atīto, mogho anāgato’ti. Evaṃ puṭṭho tvaṃ, citta, kinti byākareyyāsī’’ti? ‘‘Sace pana maṃ, bhante, evaṃ puccheyyuṃ – ‘yo te ahosi atīto attapaṭilābho, sova te attapaṭilābho sacco, mogho anāgato, mogho paccuppanno. Yo te bhavissati anāgato attapaṭilābho, sova te attapaṭilābho sacco, mogho atīto, mogho paccuppanno. Yo te etarahi paccuppanno attapaṭilābho, sova te attapaṭilābho sacco, mogho atīto, mogho anāgato’ti. Evaṃ puṭṭho ahaṃ, bhante, evaṃ byākareyyaṃ – ‘yo me ahosi atīto attapaṭilābho, sova me attapaṭilābho tasmiṃ samaye sacco ahosi, mogho anāgato, mogho paccuppanno. Yo me bhavissati anāgato attapaṭilābho, sova me attapaṭilābho tasmiṃ samaye sacco bhavissati, mogho atīto, mogho paccuppanno. Yo me etarahi paccuppanno attapaṭilābho, sova me attapaṭilābho sacco, mogho atīto, mogho anāgato’ti. Evaṃ puṭṭho ahaṃ, bhante, evaṃ byākareyya’’nti.",
      "english": "“If, Citta, they were to ask you thus: ‘Did you exist in the past, were you not non-existent? Will you exist in the future, will you not be non-existent? Do you exist now, are you not non-existent?’ How would you, Citta, being thus asked, explain it?”\n\n“If, venerable sir, they were to ask me thus: ‘Did you exist in the past, were you not non-existent? Will you exist in the future, will you not be non-existent? Do you exist now, are you not non-existent?’ Being thus asked, venerable sir, I would explain thus: ‘I did exist in the past, I was not non-existent; I will exist in the future, I will not be non-existent; I do exist now, I am not non-existent.’ Being thus asked, venerable sir, I would explain thus.”\n\n“But if, Citta, they were to ask you thus: ‘That past individual existence you had, is that individual existence alone true, and the future false, and the present false? Or that future individual existence you will have, is that individual existence alone true, and the past false, and the present false? Or that present individual existence you have now, is that individual existence alone true, and the past false, and the future false?’ How would you, Citta, being thus asked, explain it?”\n\n“But if, venerable sir, they were to ask me thus: ‘That past individual existence I had, is that individual existence alone true, and the future false, and the present false? Or that future individual existence I will have, is that individual existence alone true, and the past false, and the present false? Or that present individual existence I have now, is that individual existence alone true, and the past false, and the future false?’ Being thus asked, venerable sir, I would explain thus: ‘That past individual existence I had, that individual existence was alone true at that time, and the future was false, and the present was false. That future individual existence I will have, that individual existence will be alone true at that time, and the past will be false, and the present will be false. That present individual existence I have now, that individual existence is alone true, and the past is false, and the future is false.’ Being thus asked, venerable sir, I would explain thus.”",
      "sinhala": "“චිත්තයෙනි, යම්කිසිවකු ඔබෙන් මෙසේ අසන්නේ නම් – ‘අතීත කාලයෙහි ඔබ සිටියේය, ඔබ නොසිටියේ නොවේ; අනාගත කාලයෙහි ඔබ වන්නේය, ඔබ නොවනවා නොවේ; වර්තමානයෙහි ඔබ සිටින්නේය, ඔබ නොසිටින්නේ නොවේ’ යැයි, චිත්තයෙනි, මෙසේ අසන ලද්දේ ඔබ කෙසේ නම් පිළිතුරු දෙන්නේද?”\n\n“භන්තේ, යම්කිසිවකු මාගෙන් මෙසේ අසන්නේ නම් – ‘අතීත කාලයෙහි ඔබ සිටියේය, ඔබ නොසිටියේ නොවේ; අනාගත කාලයෙහි ඔබ වන්නේය, ඔබ නොවනවා නොවේ; වර්තමානයෙහි ඔබ සිටින්නේය, ඔබ නොසිටින්නේ නොවේ’ යැයි, භන්තේ, මෙසේ අසන ලද්දේ මම මෙසේ පිළිතුරු දෙන්නෙමි – ‘අතීත කාලයෙහි මම සිටියෙමි, මම නොසිටියේ නොවේ; අනාගත කාලයෙහි මම වන්නෙමි, මම නොවනවා නොවේ; වර්තමානයෙහි මම සිටින්නෙමි, මම නොසිටින්නේ නොවේ’ යැයි. භන්තේ, මෙසේ අසන ලද්දේ මම මෙසේ පිළිතුරු දෙන්නෙමි.”\n\n“නැවතත්, චිත්තයෙනි, යම්කිසිවකු ඔබෙන් මෙසේ අසන්නේ නම් – ‘ඔබට අතීතයෙහි යම් ආත්මභාවයක් තිබුණේද, ඒ ආත්මභාවයම සත්‍යය වේ, අනාගත ආත්මභාවය නිෂ්ඵල වේ, වර්තමාන ආත්මභාවය නිෂ්ඵල වේ? යම් ආත්මභාවයක් ඔබට අනාගතයෙහි ඇතිවන්නේද, ඒ ආත්මභාවයම සත්‍යය වේ, අතීත ආත්මභාවය නිෂ්ඵල වේ, වර්තමාන ආත්මභාවය නිෂ්ඵල වේ? යම් ආත්මභාවයක් ඔබට වර්තමානයෙහි පවතින්නේද, ඒ ආත්මභාවයම සත්‍යය වේ, අතීත ආත්මභාවය නිෂ්ඵල වේ, අනාගත ආත්මභාවය නිෂ්ඵල වේ?’ යැයි, චිත්තයෙනි, මෙසේ අසන ලද්දේ ඔබ කෙසේ නම් පිළිතුරු දෙන්නේද?”\n\n“භන්තේ, යම්කිසිවකු මාගෙන් මෙසේ අසන්නේ නම් – ‘ඔබට අතීතයෙහි යම් ආත්මභාවයක් තිබුණේද, ඒ ආත්මභාවයම සත්‍යය වේ, අනාගත ආත්මභාවය නිෂ්ඵල වේ, වර්තමාන ආත්මභාවය නිෂ්ඵල වේ. යම් ආත්මභාවයක් ඔබට අනාගතයෙහි ඇතිවන්නේද, ඒ ආත්මභාවයම සත්‍යය වේ, අතීත ආත්මභාවය නිෂ්ඵල වේ, වර්තමාන ආත්මභාවය නිෂ්ඵල වේ. යම් ආත්මභාවයක් ඔබට වර්තමානයෙහි පවතින්නේද, ඒ ආත්මභාවයම සත්‍යය වේ, අතීත ආත්මභාවය නිෂ්ඵල වේ, අනාගත ආත්මභාවය නිෂ්ඵල වේ’ යැයි, භන්තේ, මෙසේ අසන ලද්දේ මම මෙසේ පිළිතුරු දෙන්නෙමි – ‘මට අතීතයෙහි යම් ආත්මභාවයක් තිබුණේද, ඒ ආත්මභාවයම ඒ සමයෙහි සත්‍යය විය, අනාගත ආත්මභාවය නිෂ්ඵල විය, වර්තමාන ආත්මභාවය නිෂ්ඵල විය. යම් ආත්මභාවයක් මට අනාගතයෙහි ඇතිවන්නේද, ඒ ආත්මභාවයම ඒ සමයෙහි සත්‍යය වන්නේය, අතීත ආත්මභාවය නිෂ්ඵල වන්නේය, වර්තමාන ආත්මභාවය නිෂ්ඵල වන්නේය. යම් ආත්මභාවයක් මට වර්තමානයෙහි පවතින්නේද, ඒ ආත්මභාවයම සත්‍යය වේ, අතීත ආත්මභාවය නිෂ්ඵල වේ, අනාගත ආත්මභාවය නිෂ්ඵල වේ’ යැයි. භන්තේ, මෙසේ අසන ලද්දේ මම මෙසේ පිළිතුරු දෙන්නෙමි.”",
      "paliTitle": ""
    },
    {
      "number": 439,
      "pali": "‘‘Evameva kho, citta, yasmiṃ samaye oḷāriko attapaṭilābho hoti, neva tasmiṃ samaye manomayo attapaṭilābhoti saṅkhaṃ gacchati, na arūpo attapaṭilābhoti saṅkhaṃ gacchati. Oḷāriko attapaṭilābho tveva tasmiṃ samaye saṅkhaṃ gacchati. Yasmiṃ, citta, samaye manomayo attapaṭilābho hoti…pe… yasmiṃ, citta, samaye arūpo attapaṭilābho hoti, neva tasmiṃ samaye oḷāriko attapaṭilābhoti saṅkhaṃ gacchati, na manomayo attapaṭilābhoti saṅkhaṃ gacchati; arūpo attapaṭilābho tveva tasmiṃ samaye saṅkhaṃ gacchati.",
      "english": "Just so, Citta, when there is a coarse individual existence, at that time it is not reckoned as a mind-made individual existence, nor is it reckoned as a formless individual existence. Only a coarse individual existence is reckoned at that time. When, Citta, there is a mind-made individual existence, at that time it is not reckoned as a coarse individual existence, nor is it reckoned as a formless individual existence. Only a mind-made individual existence is reckoned at that time. When, Citta, there is a formless individual existence, at that time it is not reckoned as a coarse individual existence, nor is it reckoned as a mind-made individual existence; only a formless individual existence is reckoned at that time.",
      "sinhala": "චිත්තය, ඒ ආකාරයෙන්ම, යම් කලක ඖදාරික ආත්ම ප්‍රතිලාභයක් වේද, එකල එය මනෝමය ආත්ම ප්‍රතිලාභයක් යැයි හෝ අරූප ආත්ම ප්‍රතිලාභයක් යැයි සැලකෙන්නේ නැත. එකල ඖදාරික ආත්ම ප්‍රතිලාභයක් යැයිම සැලකේ.\n\nචිත්තය, යම් කලක මනෝමය ආත්ම ප්‍රතිලාභයක් වේද, එකල එය ඖදාරික ආත්ම ප්‍රතිලාභයක් යැයි හෝ අරූප ආත්ම ප්‍රතිලාභයක් යැයි සැලකෙන්නේ නැත. එකල මනෝමය ආත්ම ප්‍රතිලාභයක් යැයිම සැලකේ.\n\nචිත්තය, යම් කලක අරූප ආත්ම ප්‍රතිලාභයක් වේද, එකල එය ඖදාරික ආත්ම ප්‍රතිලාභයක් යැයි හෝ මනෝමය ආත්ම ප්‍රතිලාභයක් යැයි සැලකෙන්නේ නැත. එකල අරූප ආත්ම ප්‍රතිලාභයක් යැයිම සැලකේ.",
      "paliTitle": ""
    },
    {
      "number": 440,
      "pali": "‘‘Seyyathāpi, citta, gavā khīraṃ, khīramhā dadhi, dadhimhā navanītaṃ, navanītamhā sappi, sappimhā sappimaṇḍo. Yasmiṃ samaye khīraṃ hoti, neva tasmiṃ samaye dadhīti saṅkhaṃ gacchati, na navanītanti saṅkhaṃ gacchati, na sappīti saṅkhaṃ gacchati, na sappimaṇḍoti saṅkhaṃ gacchati; khīraṃ tveva tasmiṃ samaye saṅkhaṃ gacchati. Yasmiṃ samaye dadhi hoti…pe… navanītaṃ hoti… sappi hoti… sappimaṇḍo hoti, neva tasmiṃ samaye khīranti saṅkhaṃ gacchati, na dadhīti saṅkhaṃ gacchati, na navanītanti saṅkhaṃ gacchati, na sappīti saṅkhaṃ gacchati; sappimaṇḍo tveva tasmiṃ samaye saṅkhaṃ gacchati. Evameva kho, citta, yasmiṃ samaye oḷāriko attapaṭilābho hoti…pe… yasmiṃ, citta, samaye manomayo attapaṭilābho hoti…pe… yasmiṃ, citta, samaye arūpo attapaṭilābho hoti, neva tasmiṃ samaye oḷāriko attapaṭilābhoti saṅkhaṃ gacchati, na manomayo attapaṭilābhoti saṅkhaṃ gacchati; arūpo attapaṭilābho tveva tasmiṃ samaye saṅkhaṃ gacchati. Imā kho citta, lokasamaññā lokaniruttiyo lokavohārā lokapaññattiyo, yāhi tathāgato voharati aparāmasa’’nti.",
      "english": "Just as, Citta, from a cow comes milk; from milk, curds; from curds, fresh butter; from fresh butter, ghee; from ghee, the cream of ghee. At the time when it is milk, it is not designated as curds, nor as fresh butter, nor as ghee, nor as cream of ghee; it is designated only as milk at that time. At the time when it is curds, it is not designated as milk, nor as fresh butter, nor as ghee, nor as cream of ghee; it is designated only as curds at that time. At the time when it is fresh butter, it is not designated as milk, nor as curds, nor as ghee, nor as cream of ghee; it is designated only as fresh butter at that time. At the time when it is ghee, it is not designated as milk, nor as curds, nor as fresh butter, nor as cream of ghee; it is designated only as ghee at that time. And at the time when it is the cream of ghee, it is not designated as milk, nor as curds, nor as fresh butter, nor as ghee; it is designated only as the cream of ghee at that time. Just so, Citta, at the time when there is a gross self-attainment, it is not designated as a mind-made self-attainment, nor as a formless self-attainment; it is designated only as a gross self-attainment at that time. At the time when there is a mind-made self-attainment, it is not designated as a gross self-attainment, nor as a formless self-attainment; it is designated only as a mind-made self-attainment at that time. At the time when there is a formless self-attainment, it is not designated as a gross self-attainment, nor as a mind-made self-attainment; it is designated only as a formless self-attainment at that time. These, Citta, are worldly designations, worldly expressions, worldly usages, worldly concepts, which the Tathagata uses without grasping.",
      "sinhala": "චිත්තය, යම් සේ ගවයාගෙන් කිරි ද, කිරිවලින් දධි ද, දධිවලින් බටර් ද, බටර්වලින් ගිතෙල් ද, ගිතෙල්වලින් ගිතෙල් සාරය ද (ලැබේ). යම් කලෙක කිරි වේ ද, ඒ කලෙක දධි යයි ගණනට නොයයි, බටර් යයි ගණනට නොයයි, ගිතෙල් යයි ගණනට නොයයි, ගිතෙල් සාරය යයි ගණනට නොයයි; ඒ කලෙක කිරි යයිම ගණනට යයි.\n\nයම් කලෙක දධි වේ ද, ඒ කලෙක කිරි යයි ගණනට නොයයි, බටර් යයි ගණනට නොයයි, ගිතෙල් යයි ගණනට නොයයි, ගිතෙල් සාරය යයි ගණනට නොයයි; ඒ කලෙක දධි යයිම ගණනට යයි. යම් කලෙක බටර් වේ ද, ඒ කලෙක කිරි යයි ගණනට නොයයි, දධි යයි ගණනට නොයයි, ගිතෙල් යයි ගණනට නොයයි, ගිතෙල් සාරය යයි ගණනට නොයයි; ඒ කලෙක බටර් යයිම ගණනට යයි. යම් කලෙක ගිතෙල් වේ ද, ඒ කලෙක කිරි යයි ගණනට නොයයි, දධි යයි ගණනට නොයයි, බටර් යයි ගණනට නොයයි, ගිතෙල් සාරය යයි ගණනට නොයයි; ඒ කලෙක ගිතෙල් යයිම ගණනට යයි. යම් කලෙක ගිතෙල් සාරය වේ ද, ඒ කලෙක කිරි යයි ගණනට නොයයි, දධි යයි ගණනට නොයයි, බටර් යයි ගණනට නොයයි, ගිතෙල් යයි ගණනට නොයයි; ඒ කලෙක ගිතෙල් සාරය යයිම ගණනට යයි.\n\nචිත්තය, එපරිද්දෙන්ම යම් කලෙක ඕලාරික ආත්මභාවය වේ ද, ඒ කලෙක මනෝමය ආත්මභාවය යයි ගණනට නොයයි, අරූප ආත්මභාවය යයි ගණනට නොයයි; ඒ කලෙක ඕලාරික ආත්මභාවය යයිම ගණනට යයි. චිත්තය, යම් කලෙක මනෝමය ආත්මභාවය වේ ද, ඒ කලෙක ඕලාරික ආත්මභාවය යයි ගණනට නොයයි, අරූප ආත්මභාවය යයි ගණනට නොයයි; ඒ කලෙක මනෝමය ආත්මභාවය යයිම ගණනට යයි. චිත්තය, යම් කලෙක අරූප ආත්මභාවය වේ ද, ඒ කලෙක ඕලාරික ආත්මභාවය යයි ගණනට නොයයි, මනෝමය ආත්මභාවය යයි ගණනට නොයයි; ඒ කලෙක අරූප ආත්මභාවය යයිම ගණනට යයි.\n\nචිත්තය, මේවා ලෝක සම්මුති, ලෝක නිරුක්ති, ලෝක ව්‍යවහාර, ලෝක ප්‍රඥප්ති යි. තථාගතයන් වහන්සේ මේවා නොඇලී ව්‍යවහාර කරන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 441,
      "pali": "Evaṃ vutte, poṭṭhapādo paribbājako bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante! Abhikkantaṃ, bhante, seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti. Evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. ",
      "english": "When this was said, the wanderer Poṭṭhapāda said to the Blessed One: “Excellent, venerable sir! Excellent, venerable sir! Just as, venerable sir, one might set upright what was overturned, or reveal what was hidden, or show the way to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms—even so has the Dhamma been made clear in many ways by the Blessed One. I, venerable sir, go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha of monks. May the Blessed One remember me as a lay follower who has gone for refuge from this day forward, for as long as life lasts.”",
      "sinhala": "මෙසේ කී කල්හි, පොට්ඨපාද පරිබ්‍රාජක තෙමේ භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: “ඉතා මනහරයි, ස්වාමීනී! ඉතා මනහරයි, ස්වාමීනී! යම්සේ, ස්වාමීනී, යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ නම් හෝ, වසන ලද දෙයක් විවෘත කරන්නේ නම් හෝ, මංමුළා වූවෙකුට මග පෙන්වන්නේ නම් හෝ, ‘ඇස් ඇත්තෝ රූප දකිත්වා’ යි අඳුරේ තෙල් පහනක් දල්වන්නේ නම්, එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. එහෙයින්, ස්වාමීනී, මම භාග්‍යවතුන් වහන්සේද, ධර්මයද, භික්ෂුසංඝයාද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා!”",
      "paliTitle": ""
    },
    {
      "number": 442,
      "pali": "Citto pana hatthisāriputto bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante; abhikkantaṃ, bhante! Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti. Evamevaṃ bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Labheyyāhaṃ, bhante, bhagavato santike pabbajjaṃ, labheyyaṃ upasampada’’nti.",
      "english": "Then Citto Hatthisāriputta addressed the Blessed One thus: \"Excellent, Venerable Sir! Excellent, Venerable Sir! Just as, Venerable Sir, one might set upright what was overturned, or reveal what was hidden, or show the way to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms. Even so, the Dhamma has been expounded by the Blessed One in manifold ways. Therefore, Venerable Sir, I go for refuge to the Blessed One, to the Dhamma, and to the Sangha of monks. May I receive the going forth in the presence of the Blessed One, and may I receive full ordination.\"",
      "sinhala": "චිත්ත හත්ථිසාරිපුත්ත භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය – \"අතිශය අලංකාරයි, වහන්ස; අතිශය අලංකාරයි, වහන්ස! වහන්ස, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මග පෙන්වන්නේද, අන්ධකාරයේ 'ඇස් ඇත්තෝ රූප දකිත්වා' යනුවෙන් තෙල් පහනක් දල්වන්නේද, එපරිද්දෙන්ම භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් ආකාරයෙන් ධර්‍මය ප්‍රකාශ කරන ලදී. වහන්ස, මම ඒ භාග්‍යවතුන් වහන්සේත්, ධර්‍මයත්, භික්ෂු සංඝයාත් සරණ යමි. වහන්ස, භාග්‍යවතුන් වහන්සේ සමීපයෙහි මට පැවිද්ද ලැබෙන්නේ නම්, උපසම්පදාවද ලැබෙන්නේ නම්.\"",
      "paliTitle": "Cittahatthisāriputtaupasampadā",
      "englishTitle": "The Ordination of Cittahatthisāriputta",
      "sinhalaTitle": "චිත්‍තහත්‍ථිසාරිපුත්‍ත උපසම්‍පදා"
    },
    {
      "number": 443,
      "pali": "Alattha kho citto hatthisāriputto bhagavato santike pabbajjaṃ, alattha upasampadaṃ. Acirūpasampanno kho panāyasmā citto hatthisāriputto eko vūpakaṭṭho appamatto ātāpī pahitatto viharanto na cirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti, tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja vihāsi. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti – abbhaññāsi. Aññataro kho panāyasmā citto hatthisāriputto arahataṃ ahosīti. ",
      "english": "Indeed, the venerable Citta Hatthisāriputta received the going forth in the presence of the Blessed One; he received the full ordination. Not long after his full ordination, the venerable Citta Hatthisāriputta, dwelling alone, secluded, diligent, ardent, and resolute, not long afterwards, in this very life, having realized for himself through direct knowledge that unsurpassed culmination of the holy life – for the sake of which sons of good families rightly go forth from home to homelessness – attained it and dwelled therein. He directly knew: 'Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no further for this state of being.' And indeed, the venerable Citta Hatthisāriputta became one of the Arahants.",
      "sinhala": "චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේ භාග්‍ය​වතුන් වහන්සේගේ සමීපයෙහි පැවිද්ද ලැබූ සේක, උපසම්පදාවද ලැබූ සේක.\n\nඋපසම්පදාව ලැබ වැඩි කලක් නොගිය, ආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේ තනිවම, වෙන්ව වාසය කරමින්, අප්‍ර​මාදීව, වීර්යවත්ව, දෘඪ අධිෂ්ඨානයෙන් යුතුව වැඩසිටිනා අතර, වැඩි කලක් නොගොස්ම – කුලපුත්‍ර​යන් නිවැරදි ලෙස ගිහිගෙයින් නික්ම අනගාරික ජීවිතයට ඇතුළු වන්නේ යම් අර්ථයක් උදෙසාද, ඒ අනුත්තර බ්‍රහ්මචාරී ජීවිතයේ අවසානය වූ අරහත්වය – මේ අත්මභාවයේදීම තමන් විසින්ම අභිඥාවෙන් අවබෝධ කොට, ප්‍ර​ත්‍යක්ෂ කොට, එයට පැමිණ වාසය කළ සේක.\n\n‘ඉපදීම ක්ෂය විය. බ්‍රහ්මචරියාව සම්පූර්ණ කරන ලදී. කළ යුතු දේ කරන ලදී. මේ භවය සඳහා තවත් කිසිවක් නැත’ යනුවෙන් උන්වහන්සේ අවබෝධ කළ සේක.\n\nආයුෂ්මත් චිත්ත හත්ථිසාරිපුත්ත ස්ථවිරයන් වහන්සේ රහතුන් වහන්සේලා අතරින් එක් නමක් වූ සේක.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Poṭṭhapādasuttaṃ niṭṭhitaṃ navamaṃ.",
    "english": "End of the Ninth Poṭṭhapāda Sutta",
    "sinhala": "නවවන පොට්‍ඨපාද සූත‍්‍රය අවසන්."
  }
}