{
  "id": "dn.1.10",
  "title": {
    "pali": "Subhasuttaṃ",
    "english": "The Discourse to Subha",
    "sinhala": "සුභ සූත්‍රය"
  },
  "sections": [
    {
      "number": 444,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā ānando sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme aciraparinibbute bhagavati. Tena kho pana samayena subho māṇavo todeyyaputto sāvatthiyaṃ paṭivasati kenacideva karaṇīyena.",
      "english": "Thus have I heard. At one time, the venerable Ānanda was dwelling in Sāvatthī, in Jeta's Grove, Anāthapiṇḍika's park, soon after the Blessed One had attained final Nibbāna. Now at that time, the young brahmin Subha, son of Todeyya, was residing in Sāvatthī for some reason or other.",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ පිරිනිවන් පෑ වැඩි කලක් ගතවී නොතිබූ සමයක, ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ අනාථපිණ්ඩික සිටුතුමාගේ ජේතවනාරාමයෙහි සැවැත්නුවර වැඩවසන සේක.\n\nඑසමයෙහි ම තොදෙය්‍යපුත්‍ර සුභ නම් මානවකයා යම්කිසි කටයුත්තක් පිණිස සැවැත්නුවර නැවතී සිටියේය.",
      "paliTitle": "Subhamāṇavavatthu",
      "englishTitle": "Story of Subha the Youth",
      "sinhalaTitle": "සුභ මානව වස්තුව"
    },
    {
      "number": 445,
      "pali": "Atha kho subho māṇavo todeyyaputto aññataraṃ māṇavakaṃ āmantesi – ‘‘ehi tvaṃ, māṇavaka, yena samaṇo ānando tenupasaṅkama; upasaṅkamitvā mama vacanena samaṇaṃ ānandaṃ appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ puccha – ‘subho māṇavo todeyyaputto bhavantaṃ ānandaṃ appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ pucchatī’ti. Evañca vadehi – ‘sādhu kira bhavaṃ ānando yena subhassa māṇavassa todeyyaputtassa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā’’’ti.",
      "english": "Then Subha, the young brahmin, son of Todeyya, addressed a certain young man: ‘Come, young man, go to the recluse Ananda. Having approached him, ask the recluse Ananda in my name about his good health, freedom from affliction, nimbleness, strength, and comfortable living, saying: “Subha, the young brahmin, son of Todeyya, asks the Venerable Ananda about his good health, freedom from affliction, nimbleness, strength, and comfortable living.” And also say this: “Venerable Ananda, it would be good if, out of compassion, you would come to the dwelling of Subha, the young brahmin, son of Todeyya.”’",
      "sinhala": "ඉන්පසු තොදෙය්‍යපුත්‍ර සුභ මාණවකයා එක්තරා මාණවකයකුට මෙසේ ආමන්ත්‍රණය කළේය – “මාණවකය, එන්න. ඔබ ශ්‍ර‌මණ ආනන්ද වහන්සේ වැඩසිටින තැනට යන්න; ළඟා වී මාගේ වචනයෙන් ශ්‍ර‌මණ ආනන්ද වහන්සේගෙන් අපාබාධ බව, ආතංක රහිත බව, කයෙහි සැහැල්ලු බව, ශක්තිය සහ සුවසේ වැඩසිටීම ගැන විමසන්න – ‘තොදෙය්‍යපුත්‍ර සුභ මාණවකයා භවත් ආනන්ද වහන්සේගෙන් අපාබාධ බව, ආතංක රහිත බව, කයෙහි සැහැල්ලු බව, ශක්තිය, සුවසේ වැඩසිටීම විමසන්නේය’ කියා. තවද මෙසේ කියන්න – ‘යහපති, භවත් ආනන්ද වහන්සේ අනුකම්පා කොට තොදෙය්‍යපුත්‍ර සුභ මාණවකයාගේ නිවසට වැඩම කළ මැනව’ කියා.”",
      "paliTitle": ""
    },
    {
      "number": 446,
      "pali": "‘‘Evaṃ, bho’’ti kho so māṇavako subhassa māṇavassa todeyyaputtassa paṭissutvā yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so māṇavako āyasmantaṃ ānandaṃ etadavoca – ‘‘subho māṇavo todeyyaputto bhavantaṃ ānandaṃ appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ pucchati; evañca vadeti – ‘sādhu kira bhavaṃ ānando yena subhassa māṇavassa todeyyaputtassa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā’’’ti.",
      "english": "\"Yes, sir,\" that young brahmin assented to Subha, the young brahmin, son of Todeyya, and then approached the venerable Ānanda. Having approached, he exchanged greetings with the venerable Ānanda. After concluding a friendly and courteous talk, he sat down to one side. Having sat down to one side, that young brahmin said this to the venerable Ānanda: \"Subha, the young brahmin, son of Todeyya, inquires about the venerable Ānanda's freedom from illness, freedom from affliction, agility, strength, and comfortable well-being; and he says this: 'It would be good, venerable Ānanda, if you would approach the dwelling of Subha, the young brahmin, son of Todeyya, out of compassion.'\"",
      "sinhala": "‘එසේය, ස්වාමීනි’යි තොදෙය්‍යපුත්‍ර සුභ මානවකයාට පිළිතුරු දුන් ඒ මානවකයා, ආයුෂ්මත් ආනන්ද හිමියන් වැඩසිටි තැනට පැමිණියේය; පැමිණ, ආයුෂ්මත් ආනන්ද හිමියන් සමඟ සතුටු සාමිචියෙහි යෙදිණි. සතුටු සාමිචි කථා පවත්වා, සිහි කටයුතු කථා පවත්වා, එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි ඒ මානවකයා ආයුෂ්මත් ආනන්ද හිමියන්ට මෙය කීවේය: “තොදෙය්‍යපුත්‍ර සුභ මානවකයා භවත් ආනන්ද හිමියන්ගෙන් රෝග අඩුද, ආබාධ අඩුද, සැහැල්ලු සිරුරින් සිටින්නේද, ශක්තිය තිබේද, සැපසේ වාසය කරන්නේද කියා විමසයි; තවද මෙසේද කියයි – ‘යහපත, භවත් ආනන්ද හිමියන් කරුණාවෙන් තොදෙය්‍යපුත්‍ර සුභ මානවකයාගේ නිවසට වැඩම කළ මැනව’” යනුවෙනි.",
      "paliTitle": ""
    },
    {
      "number": 447,
      "pali": "Evaṃ vutte, āyasmā ānando taṃ māṇavakaṃ etadavoca – ‘‘akālo kho, māṇavaka. Atthi me ajja bhesajjamattā pītā. Appevanāma svepi upasaṅkameyyāma kālañca samayañca upādāyā’’ti. ‘‘Evaṃ, bho’’ti kho so māṇavako āyasmato ānandassa paṭissutvā uṭṭhāyāsanā yena subho māṇavo todeyyaputto tenupasaṅkami; upasaṅkamitvā subhaṃ māṇavaṃ todeyyaputtaṃ etadavoca, ‘‘avocumhā kho mayaṃ bhoto vacanena taṃ bhavantaṃ ānandaṃ – ‘subho māṇavo todeyyaputto bhavantaṃ ānandaṃ appābādhaṃ appātaṅkaṃ lahuṭṭhānaṃ balaṃ phāsuvihāraṃ pucchati, evañca vadeti – ‘‘sādhu kira bhavaṃ ānando yena subhassa māṇavassa todeyyaputtassa nivesanaṃ tenupasaṅkamatu anukampaṃ upādāyā’’’ti. Evaṃ vutte, bho, samaṇo ānando maṃ etadavoca – ‘akālo kho, māṇavaka. Atthi me ajja bhesajjamattā pītā. Appevanāma svepi upasaṅkameyyāma kālañca samayañca upādāyā’ti. Ettāvatāpi kho, bho, katameva etaṃ, yato kho so bhavaṃ ānando okāsamakāsi svātanāyapi upasaṅkamanāyā’’ti.",
      "english": "When this was said, the venerable Ānanda said to that young man: “Indeed, young man, it is not the right time. Today I have taken a dose of medicine. Perhaps we might go tomorrow, taking into account the time and occasion.” “Yes, sir,” that young man replied to the venerable Ānanda. Rising from his seat, he went to Subha, the young man, son of Todeyya. Having approached him, he said to Subha, the young man, son of Todeyya: “Indeed, we spoke to the venerable Ānanda on your behalf: ‘Subha, the young man, son of Todeyya, inquires about the venerable Ānanda’s good health, freedom from illness, lightheartedness, strength, and comfortable dwelling. And he says this: “It would be good if the venerable Ānanda would come to the dwelling of Subha, the young man, son of Todeyya, out of compassion.”’ When this was said, sir, the ascetic Ānanda said to me: ‘Indeed, young man, it is not the right time. Today I have taken a dose of medicine. Perhaps we might go tomorrow, taking into account the time and occasion.’ Even by this much, sir, has this been accomplished, since the venerable Ānanda has indeed made an opportunity for coming tomorrow.”",
      "sinhala": "එසේ කී කල්හි, ආයුෂ්මත් ආනන්ද තෙරණුවෝ ඒ මානවකයාට මෙය පැවසූහ: ‘මානවකය, දැන් සුදුසු කාලය නොවේ. අද මා විසින් බෙහෙත් මාත්‍රාව‍ක් පානය කර ඇත. සමහරවිට හෙට පවා කාලය හා වේලාව අනුව අපට (ඔබ වෙත) පැමිණිය හැකි ය.’\n\n‘එසේය, භවත්නි’යි කියා ඒ මානවකයා ආයුෂ්මත් ආනන්ද තෙරණුවන්ගේ වචනය පිළිගෙන, අසුනෙන් නැගිට, සුභ නම් තෝදෙය්‍යපුත්‍ර මානවකයා සිටි තැනට පැමිණියේය; පැමිණ, සුභ නම් තෝදෙය්‍යපුත්‍ර මානවකයාට මෙය පැවසූයේය:\n\n‘අපි භවත් ඔබගේ වචනයෙන් ඒ භවත් ආනන්ද තෙරණුවන්ගෙන් විමසුවෙමු – ‘සුභ නම් තෝදෙය්‍යපුත්‍ර මානවකයා භවත් ආනන්ද තෙරණුවන්ගෙන් රෝග අඩුබව, පීඩා අඩුබව, පහසුවෙන් නැගිටීම, ශක්තිය හා සැපසේ වාසය කිරීම විමසයි, මෙසේද කියයි – ‘භවත් ආනන්ද තෙරණුවෝ අනුකම්පාවෙන් සුභ නම් තෝදෙය්‍යපුත්‍ර මානවකයාගේ නිවසට පැමිණියහොත් එය මැනවි’ කියාය.\n\n‘එසේ කී කල්හි, භවත්නි, ශ්‍රමණ ආනන්ද තෙරණුවෝ මට මෙය පැවසූහ: ‘මානවකය, දැන් සුදුසු කාලය නොවේ. අද මා විසින් බෙහෙත් මාත්‍රාව‍ක් පානය කර ඇත. සමහරවිට හෙට පවා කාලය හා වේලාව අනුව අපට (ඔබ වෙත) පැමිණිය හැකි ය’ කියාය.\n\n‘මේ තරමින් පවා, භවත්නි, ඒ භවත් ආනන්ද තෙරණුවෝ හෙට දින පැමිණීම සඳහා අවස්ථාවක් ලබා දුන් හෙයින් එය කෙතරම් යහපත්ද!’",
      "paliTitle": ""
    },
    {
      "number": 448,
      "pali": "Atha kho āyasmā ānando tassā rattiyā accayena pubbaṇhasamayaṃ nivāsetvā pattacīvaramādāya cetakena bhikkhunā pacchāsamaṇena yena subhassa māṇavassa todeyyaputtassa nivesanaṃ tenupasaṅkami; upasaṅkamitvā paññatte āsane nisīdi. Atha kho subho māṇavo todeyyaputto yenāyasmā ānando tenupasaṅkami; upasaṅkamitvā āyasmatā ānandena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho subho māṇavo todeyyaputto āyasmantaṃ ānandaṃ etadavoca – ‘‘bhavañhi ānando tassa bhoto gotamassa dīgharattaṃ upaṭṭhāko santikāvacaro samīpacārī. Bhavametaṃ ānando jāneyya, yesaṃ so bhavaṃ gotamo dhammānaṃ vaṇṇavādī ahosi, yattha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesi. Katamesānaṃ kho, bho ānanda, dhammānaṃ so bhavaṃ gotamo vaṇṇavādī ahosi; kattha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesī’’ti?",
      "english": "Then, when that night had passed, in the forenoon, the Venerable Ananda dressed, took his bowl and robe, and with the monk Cetaka as his attendant, he approached the dwelling of Subha, the young man, son of Todeyya. Having approached, he sat down on the seat prepared for him. Then Subha, the young man, son of Todeyya, approached the Venerable Ananda. Having approached, he exchanged greetings with the Venerable Ananda. Having exchanged polite and cordial talk, he sat down to one side. Sitting to one side, Subha, the young man, son of Todeyya, said this to the Venerable Ananda: \"Indeed, Venerable Ananda, for a long time you were a close attendant to the Blessed Gotama, one who stayed near him and moved in his vicinity. You, Venerable Ananda, would surely know of which teachings the Blessed Gotama spoke in praise, and in which he encouraged, established, and settled this populace. Indeed, good Ananda, which are those teachings that the Blessed Gotama spoke in praise of? And in which did he encourage, establish, and settle this populace?\"",
      "sinhala": "ඉන්පසු ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ ඒ රාත‍්‍රිය අවසන් වූ පසු පෙරවරුවේ සිවුරු පෙරවාගෙන, පාත‍්‍ර සිවුරු ද රැගෙන, චේතක නම් භික්ෂුව පසුපසින් එන සේ කැටුව, තොදෙය්‍යපුත‍්‍ර සුභ මානවකයාගේ නිවස වෙත වැඩම කළ සේක. එහි වැඩම කොට පනවන ලද අසුනක වැඩහුන් සේක. ඉන්පසු තොදෙය්‍යපුත‍්‍ර සුභ මානවකයා ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේ සමග සතුටු සාමිචියෙහි යෙදුණි. සතුටු සාමිචි කථා පවත්වා, එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි තොදෙය්‍යපුත‍්‍ර සුභ මානවකයා ආයුෂ්මත් ආනන්ද තෙරුන් වහන්සේට මෙසේ කීවේය – “භවත් ආනන්ද තෙරුන් වහන්සේ ඒ ගෞතම භාග්‍යවතුන් වහන්සේට බොහෝ කලක් උපස්ථාන කළ සේක, ළඟින්ම ඇසුරු කළ සේක. භවත් ආනන්ද, ඒ ගෞතම භාග්‍යවතුන් වහන්සේ කුමන ධ‍ර්මයන් ප්‍රශංසා කළ සේක්ද, කොහි නම් මේ ජනතාව පොළඹවා, පිහිටුවා, ස්ථිර කළ සේක්ද යන්න ඔබ දන්නේමය. භවත් ආනන්ද, ඒ ගෞතම භාග්‍යවතුන් වහන්සේ කුමන ධ‍ර්මයන්ගේ ප්‍රශංසා කළ සේක්ද? මේ ජනතාව කොහි නම් පොළඹවා, පිහිටුවා, ස්ථිර කළ සේක්ද?”",
      "paliTitle": ""
    },
    {
      "number": 449,
      "pali": "‘‘Tiṇṇaṃ kho, māṇava, khandhānaṃ so bhagavā vaṇṇavādī ahosi; ettha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesi. Katamesaṃ tiṇṇaṃ? Ariyassa sīlakkhandhassa, ariyassa samādhikkhandhassa, ariyassa paññākkhandhassa. Imesaṃ kho, māṇava, tiṇṇaṃ khandhānaṃ so bhagavā vaṇṇavādī ahosi; ettha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesī’’ti. ",
      "english": "“Indeed, young man, the Blessed One was an advocate of three divisions; and in them, he encouraged, engaged, and firmly established these people. Which three? The noble division of virtue, the noble division of concentration, and the noble division of wisdom. Indeed, young man, the Blessed One was an advocate of these three divisions; and in them, he encouraged, engaged, and firmly established these people.”",
      "sinhala": "මැනවින්, මානවකය, ඒ භාග්‍යවතුන් වහන්සේ ස්කන්ධයන් තුනක් වර්ණනා කළ සේක; තවද, උන්වහන්සේ මේ ජනතාව ඒ (ස්කන්ධයන්) තුළ සමාදන් කරවූ සේක, පිහිටෙවූ සේක, තහවුරු කළ සේක. ඒ තුන කවරේද? ආර්ය ශීලස්කන්ධය, ආර්ය සමාධිස්කන්ධය, ආර්ය ප්‍රඥාස්කන්ධය. මැනවින්, මානවකය, ඒ භාග්‍යවතුන් වහන්සේ මේ ස්කන්ධයන් තුන වර්ණනා කළ සේක; තවද, උන්වහන්සේ මේ ජනතාව ඒ (ස්කන්ධයන්) තුළ සමාදන් කරවූ සේක, පිහිටෙවූ සේක, තහවුරු කළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 450,
      "pali": "‘‘Katamo pana so, bho ānanda, ariyo sīlakkhandho, yassa so bhavaṃ gotamo vaṇṇavādī ahosi, yattha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesī’’ti? ‘‘Idha, māṇava, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Taṃ dhammaṃ suṇāti gahapati vā gahapatiputto vā aññatarasmiṃ vā kule paccājāto. So taṃ dhammaṃ sutvā tathāgate saddhaṃ paṭilabhati. So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati – ‘sambādho gharāvāso rajopatho, abbhokāso pabbajjā, nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. So aparena samayena appaṃ vā bhogakkhandhaṃ pahāya mahantaṃ vā bhogakkhandhaṃ pahāya appaṃ vā ñātiparivaṭṭaṃ pahāya mahantaṃ vā ñātiparivaṭṭaṃ pahāya kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati. So evaṃ pabbajito samāno pātimokkhasaṃvarasaṃvuto viharati, ācāragocarasampanno, anumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, kāyakammavacīkammena samannāgato kusalena, parisuddhājīvo, sīlasampanno, indriyesu guttadvāro, satisampajaññena samannāgato, santuṭṭho.",
      "english": "“What then, venerable Ānanda, is that noble aggregate of virtue of which the venerable Gotama was a eulogizer, and in which he encouraged, established, and settled this populace?”\n\n“Here, young man, a Tathāgata arises in the world, an Arahant, a Fully Self-Enlightened One, perfected in knowledge and conduct, the Fortunate One, Knower of the worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One. He, having directly known and realized this world—with its devas, Māra, and Brahmā; with its ascetics and brahmins, its population of devas and humans—proclaims it. He teaches the Dhamma, lovely in its beginning, lovely in its middle, lovely in its end, with meaning and with letter; he proclaims the completely perfect and utterly pure spiritual life. That Dhamma is heard by a householder or a householder’s son, or one reborn into some other family. Having heard that Dhamma, he acquires faith in the Tathāgata. Endowed with that acquisition of faith, he reflects thus: ‘Confined is household life, a path for dust; open is the going forth. It is not easy for one living at home to lead the spiritual life, utterly perfect, utterly pure, as clean as a conch-shell. Suppose now I were to shave off my hair and beard, put on saffron robes, and go forth from the home life into homelessness.’ At a later time, having given up a small aggregate of wealth or a large aggregate of wealth, having given up a small circle of relatives or a large circle of relatives, having shaved off hair and beard, put on saffron robes, he goes forth from the home life into homelessness. Having thus gone forth, he lives restrained by the restraint of the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, and he undertakes and trains himself in the training rules. He is endowed with wholesome bodily and verbal actions, pure in livelihood, perfected in virtue, with guarded doors of the senses, endowed with mindfulness and clear comprehension, and content.”",
      "sinhala": "‘‘ආනන්දයන් වහන්ස, භාග්‍යවතුන් වහන්සේ යමක් වර්ණනා කරමින් වැඩසිටියේද, යම් තැනක මේ ජනතාව සමාදන් කරවූයේද, පිහිටවූයේද, තහවුරු කළේද, ඒ ආර්ය ශීලස්කන්ධය කවරේද?’’\n\n‘‘මහාණෙනි, මෙහිලා තථාගතයන් වහන්සේ රහත් වූ, සම්මා සම්බුද්ධ වූ, විජ්ජාචරණසම්පන්න වූ, සුගත වූ, ලෝකවිදූ වූ, අනුත්තර වූ, පුරිසදම්මසාරථී වූ, දෙවිමිනිසුන්ට ශාස්තෘ වූ, බුද්ධ වූ, භාග්‍යවත් වූ සේක. උන්වහන්සේ දෙවියන් සහිත වූ, මරුන් සහිත වූ, බඹුන් සහිත වූ, ශ්‍රමණබ්‍රාහ්මණයන් සහිත වූ, දෙවිමිනිසුන් සහිත වූ මේ ලෝකය තමන්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරති. උන්වහන්සේ මුල යහපත් වූ, මැද යහපත් වූ, අග යහපත් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ, ඒකාන්තයෙන් සම්පූර්ණ වූ, ඒකාන්තයෙන් පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරමින් ධර්මය දේශනා කරති. ඒ ධර්මය ගෘහපතියෙක් හෝ ගෘහපති පුත්‍රයෙක් හෝ යම්කිසි කුලයක උපන් කෙනෙක් හෝ අසයි. ඔහු ඒ ධර්මය අසා තථාගතයන් වහන්සේ කෙරෙහි ශ්‍රද්ධාව ලබයි. ඔහු ඒ ලැබූ ශ්‍රද්ධාවෙන් යුක්තව මෙසේ නුවණින් විමසයි – ‘ගිහිගෙය කෙලෙස් බහුල වූ පටු තැනකි. පැවිදිබව විවෘත තැනකි. ගිහිගෙයි වසන කෙනෙකුට ඒකාන්තයෙන්ම සම්පූර්ණ වූ, ඒකාන්තයෙන්ම පිරිසිදු වූ, හක්ගෙඩියක් මෙන් සුදු වූ බ්‍රහ්මචර්යාවෙහි හැසිරීම පහසු නැත. මම නම් කේශ කප්පවා, රැවුල් කප්පවා, කහවත් හැඳපැළඳ, ගිහිගෙයින් නික්ම අනගාරික පැවිදි බවට පැමිණියහොත් ඉතා යහපති’යි. ඔහු පසුව කලෙක ස්වල්ප වූ හෝ බොහෝ වූ භෝග සම්පත් අත්හැර, ස්වල්ප වූ හෝ බොහෝ වූ ඥාති පිරිවර අත්හැර, කේශ කප්පවා, රැවුල් කප්පවා, කහවත් හැඳපැළඳ, ගිහිගෙයින් නික්ම අනගාරික පැවිදි බවට පැමිණෙයි. ඔහු මෙසේ පැවිදි වූ කල්හි ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. ආචාරයෙන් හා ගෝචරයෙන් සම්පූර්ණ වූ, අල්ප මාත්‍ර වරදෙහි පවා භය දක්නා සුළු වූ, ශික්ෂා පදයන් සමාදන්ව හික්මෙන, කයින් හා වචනයෙන් යහපත් කර්මයෙන් යුක්ත වූ, පිරිසිදු ආජීවනයක් ඇත්තෙක් වූ, සීලසම්පන්න වූ, ඉන්ද්‍රියයන්ට රැකවරණ දොරටු ඇත්තෙක් වූ, සිහියෙන් හා සම්‍යක් ඥානයෙන් යුක්ත වූ, සතුටු වූ කෙනෙක් වෙයි.",
      "paliTitle": "Sīlakkhandho",
      "englishTitle": "The Division of Virtue",
      "sinhalaTitle": "ශීලස්කන්ධය"
    },
    {
      "number": 451,
      "pali": "‘‘Kathañca, māṇava, bhikkhu sīlasampanno hoti? Idha, māṇava, bhikkhu pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti, nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati. Yampi, māṇava, bhikkhu pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti, nihitadaṇḍo nihitasattho lajjī dayāpanno, sabbapāṇabhūtahitānukampī viharati; idampissa hoti sīlasmiṃ. (Yathā 194 yāva 210 anucchedesu evaṃ vitthāretabbaṃ). ‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ – santikammaṃ paṇidhikammaṃ bhūtakammaṃ bhūrikammaṃ vassakammaṃ vossakammaṃ vatthukammaṃ vatthuparikammaṃ ācamanaṃ nhāpanaṃ juhanaṃ vamanaṃ virecanaṃ uddhaṃvirecanaṃ adhovirecanaṃ sīsavirecanaṃ kaṇṇatelaṃ nettatappanaṃ natthukammaṃ añjanaṃ paccañjanaṃ sālākiyaṃ sallakattiyaṃ dārakatikicchā mūlabhesajjānaṃ anuppadānaṃ osadhīnaṃ paṭimokkho iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Yampi, māṇava, bhikkhu yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti, seyyathidaṃ, santikammaṃ paṇidhikammaṃ…pe… osadhīnaṃ paṭimokkho iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "And how, young man, is a monk accomplished in virtue? Here, young man, a monk, having abandoned the taking of life, abstains from the taking of life. He lays aside cudgel and weapon, is scrupulous, full of kindness, and dwells compassionate for the welfare of all living beings. That a monk, young man, having abandoned the taking of life, abstains from the taking of life, lays aside cudgel and weapon, is scrupulous, full of kindness, and dwells compassionate for the welfare of all living beings — this is part of his virtue.\n\nJust as some respected recluses and brahmins, having partaken of food offered by faith, sustain themselves by such base arts, by wrong livelihood, namely: charming, fulfilling vows, ghost-charming, invoking earth spirits, rain-making, preventing rain, consecrating sites, preparing building sites, mouth-rinsing, bathing, fire-sacrifices, administering emetics, purgatives, purges from above, purges from below, head purges, ear-oil treatment, eye-salves, nasal treatment, collyrium, counter-collyrium, surgery, general surgery, child medicine, administering root medicines, or binding on medicinal herbs — he abstains from such wrong livelihood by base arts. That a monk, young man, abstains from such wrong livelihood by base arts as some respected recluses and brahmins, having partaken of food offered by faith, sustain themselves, namely: charming, fulfilling vows, ghost-charming, invoking earth spirits, rain-making, preventing rain, consecrating sites, preparing building sites, mouth-rinsing, bathing, fire-sacrifices, administering emetics, purgatives, purges from above, purges from below, head purges, ear-oil treatment, eye-salves, nasal treatment, collyrium, counter-collyrium, surgery, general surgery, child medicine, administering root medicines, or binding on medicinal herbs — this is part of his virtue.",
      "sinhala": "‘‘මානවක, භික්ෂුවක් සිල්වත් වන්නේ කෙසේද? මෙහිලා මානවක, භික්ෂුව ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකුණේ වේ. හෙතෙම දඬුමුගුරු බහා තබා, අවි ආයුධ අතහැර, ලැජ්ජාශීලීව, දයාවෙන් යුතුව, සියලු සත්වයන්ගේ යහපතට අනුකම්පාවෙන් වාසය කරයි. මානවක, යම් භික්ෂුවක් ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වැළකුණේ වේද, හෙතෙම දඬුමුගුරු බහා තබා, අවි ආයුධ අතහැර, ලැජ්ජාශීලීව, දයාවෙන් යුතුව, සියලු සත්වයන්ගේ යහපතට අනුකම්පාවෙන් වාසය කරයිද, මෙයද ඔහුගේ සීලයේ කොටසක් වේ.\n\n‘‘තවද මානවක, සමහර පින්වත් ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන්, මිථ්‍යා ආජීවයෙන් ජීවිකාව ගෙන යති. එනම්: ශාන්ති කර්ම, ප්‍රණිධි කර්ම, භූත කර්ම, භූමි කර්ම, වර්ෂා කර්ම, වර්ෂාව වැළැක්වීමේ කර්ම, ගෘහ කර්ම, ගෘහ පරිකර්ම, මුඛය සේදීම, ස්නානය, හෝම කිරීම, වමනය කිරීම, විරේක කිරීම, උඩුඅතට විරේක කිරීම, යටඅතට විරේක කිරීම, හිස විරේක කිරීම, කන් තෙල් ගැල්වීම, නෙත් තැවීම, නස්‍ය කර්ම, අඳුන් ඇල්ලීම, නැවත අඳුන් ඇල්ලීම, සලාක ශල්‍යකර්ම, සාමාන්‍ය ශල්‍යකර්ම, ළමා රෝග ප්‍රතිකාර, මුල් ඖෂධ දීම, ඖෂධ පැළෑටි යෙදීම යනාදියයි. මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන් යුත් මිථ්‍යා ආජීවයෙන් හෙතෙම වැළකී සිටී. මානවක, යම් භික්ෂුවක්, සමහර පින්වත් ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන්, මිථ්‍යා ආජීවයෙන් ජීවිකාව ගෙන යතිද, එනම්: ශාන්ති කර්ම, ප්‍රණිධි කර්ම, භූත කර්ම, භූමි කර්ම, වර්ෂා කර්ම, වර්ෂාව වැළැක්වීමේ කර්ම, ගෘහ කර්ම, ගෘහ පරිකර්ම, මුඛය සේදීම, ස්නානය, හෝම කිරීම, වමනය කිරීම, විරේක කිරීම, උඩුඅතට විරේක කිරීම, යටඅතට විරේක කිරීම, හිස විරේක කිරීම, කන් තෙල් ගැල්වීම, නෙත් තැවීම, නස්‍ය කර්ම, අඳුන් ඇල්ලීම, නැවත අඳුන් ඇල්ලීම, සලාක ශල්‍යකර්ම, සාමාන්‍ය ශල්‍යකර්ම, ළමා රෝග ප්‍රතිකාර, මුල් ඖෂධ දීම, ඖෂධ පැළෑටි යෙදීම යනාදියයි, මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන් යුත් මිථ්‍යා ආජීවයෙන් හෙතෙම වැළකී සිටීද, මෙයද ඔහුගේ සීලයේ කොටසක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 452,
      "pali": "‘‘Sa kho so [ayaṃ kho so (ka.)], māṇava, bhikkhu evaṃ sīlasampanno na kutoci bhayaṃ samanupassati, yadidaṃ sīlasaṃvarato. Seyyathāpi, māṇava, rājā khattiyo muddhāvasitto nihatapaccāmitto na kutoci bhayaṃ samanupassati, yadidaṃ paccatthikato. Evameva kho, māṇava, bhikkhu evaṃ sīlasampanno na kutoci bhayaṃ samanupassati, yadidaṃ sīlasaṃvarato. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṃ anavajjasukhaṃ paṭisaṃvedeti. Evaṃ kho, māṇava, bhikkhu sīlasampanno hoti.",
      "english": "Such a monk, young man, thus endowed with virtue, perceives no fear from anywhere, namely, due to the restraint of his virtue. Just as, young man, a consecrated khattiya king, with enemies overcome, perceives no fear from anywhere, namely, from adversaries. In the same way, young man, a monk thus endowed with virtue perceives no fear from anywhere, namely, due to the restraint of his virtue. He, being endowed with this noble aggregate of virtue, experiences an inner blameless happiness. Thus, young man, a monk is endowed with virtue.",
      "sinhala": "ඒකාන්තයෙන්ම, තරුණයාණෙනි, මෙලෙස සීලයෙන් යුක්ත වූ භික්ෂුව, සීල සංවරය හේතු කොටගෙන කිසිදු බියක් නොදකියි.\n\nඒ අයුරින්ම, තරුණයාණෙනි, අභිෂේක ලද ක්ෂත‍්‍රිය රජෙක්, තම සතුරන් පරාජය කර ගත් විට, සතුරන් අතින් කිසිදු බියක් නොදකියි. එලෙසින්ම, තරුණයාණෙනි, මේ අයුරින් සීලයෙන් යුක්ත වූ භික්ෂුව, සීල සංවරය හේතු කොටගෙන කිසිදු බියක් නොදකියි.\n\nඒ භික්ෂුව මේ ආර්ය සීලස්කන්ධයෙන් යුක්ත වීමෙන්, තමන් තුළ නිර්දෝෂ වූ සැපයක් අත්විඳියි.\n\nමේ අයුරින්, තරුණයාණෙනි, භික්ෂුව සිල් සම්පූර්ණ වූවෙක් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 453,
      "pali": "‘‘Ayaṃ kho so, māṇava, ariyo sīlakkhandho yassa so bhagavā vaṇṇavādī ahosi, yattha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesi. Atthi cevettha uttarikaraṇīya’’nti. ‘‘Acchariyaṃ, bho ānanda, abbhutaṃ, bho ānanda! So cāyaṃ, bho ānanda, ariyo sīlakkhandho paripuṇṇo, no aparipuṇṇo. Evaṃ paripuṇṇaṃ cāhaṃ, bho, ānanda, ariyaṃ sīlakkhandhaṃ ito bahiddhā aññesu samaṇabrāhmaṇesu na samanupassāmi. Evaṃ paripuṇṇañca, bho ānanda, ariyaṃ sīlakkhandhaṃ ito bahiddhā aññe samaṇabrāhmaṇā attani samanupasseyyuṃ, te tāvatakeneva attamanā assu – ‘alamettāvatā, katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttarikaraṇīya’nti. Atha ca pana bhavaṃ ānando evamāha – ‘atthi cevettha uttarikaraṇīya’’’nti [imassa anantaraṃ sī. pī. potthakesu ‘‘paṭhamabhāṇavāraṃ’’ti pāṭho dissati]. ",
      "english": "“Indeed, young man, this is that noble aggregate of virtue of which the Blessed One was an exalter, and in which he encouraged, established, and firmly settled this populace. And yet, there is still more to be done.” “Wonderful, venerable Ānanda! Marvellous, venerable Ānanda! And this noble aggregate of virtue, venerable Ānanda, is complete, not incomplete. Such a complete noble aggregate of virtue, venerable Ānanda, I do not perceive among other ascetics and brahmins outside of this teaching. If other ascetics and brahmins outside of this teaching were to perceive such a complete noble aggregate of virtue in themselves, they would be contented with that much, saying, ‘Enough with just that much! That much is accomplished! Our purpose as ascetics has been attained! There is nothing further for us to do!’ But venerable Ānanda says this: ‘And yet, there is still more to be done.’”",
      "sinhala": "\"මාණවකය, මේ ඒ ආර්ය ශීලස්කන්ධයයි, යම් ශීලස්කන්ධයක් භාග්‍යවතුන් වහන්සේ වර්ණනා කළ සේක්ද, මේ ජනතාව යම් ශීලස්කන්ධයක් තුළ සමාදන් කරවූ සේක්ද, පිහිටුවා තහවුරු කළ සේක්ද. මෙහි තවත් කළ යුතු දෙයක් තිබේ.\"\n\n\"අහෝ ආනන්දයන් වහන්ස, ආශ්චර්යයකි! අහෝ ආනන්දයන් වහන්ස, අද්භූතයකි! ආනන්දයන් වහන්ස, මේ ආර්ය ශීලස්කන්ධය පරිපූර්ණය, අසම්පූර්ණ නොවේ. ආනන්දයන් වහන්ස, මෙසේ පරිපූර්ණ වූ ආර්ය ශීලස්කන්ධයක් මේ සසුනෙන් බැහැර වූ අන්‍ය ශ්‍රමණ බ්‍රාහ්මණයන් අතර මම නොදකිමි. ආනන්දයන් වහන්ස, මේ සසුනෙන් බැහැර වූ අන්‍ය ශ්‍රමණ බ්‍රාහ්මණයෝ තමන් තුළ මෙසේ පරිපූර්ණ වූ ආර්ය ශීලස්කන්ධයක් දකින්නට ලැබේ නම්, ඔවුහු එපමණකින්ම සතුටු වන්නාහුය. 'මෙපමණක්ම ප්‍රමාණවත්ය, මෙපමණක්ම කර අවසන්ය, අපගේ ශ්‍රමණත්වයෙහි අර්ථය ලබාගෙන ඇත, අපට කළ යුතු තවත් කිසිවක් නැත' කියා සිතන්නාහුය. එහෙත් ආනන්දයන් වහන්සේ මෙසේ කියනු ලැබේ: 'මෙහි තවත් කළ යුතු දෙයක් තිබේ' කියා.\"",
      "paliTitle": ""
    },
    {
      "number": 454,
      "pali": "‘‘Katamo pana so, bho ānanda, ariyo samādhikkhandho, yassa so bhavaṃ gotamo vaṇṇavādī ahosi, yattha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesī’’ti? ‘‘Kathañca, māṇava, bhikkhu indriyesu guttadvāro hoti? Idha, māṇava, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ tassa saṃvarāya paṭipajjati, rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā… jivhāya rasaṃ sāyitvā… kāyena phoṭṭhabbaṃ phusitvā… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī; yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhādomanassā pāpakā akusalā dhammā anvāssaveyyuṃ tassa saṃvarāya paṭipajjati, rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. So iminā ariyena indriyasaṃvarena samannāgato ajjhattaṃ abyāsekasukhaṃ paṭisaṃvedeti. Evaṃ kho, māṇava, bhikkhu indriyesu guttadvāro hoti.",
      "english": "\"What then, Venerable Ānanda, is that noble aggregate of concentration, of which the Lord Gotama spoke highly, and in which he encouraged, established, and settled this populace?\" \"And how, young man, does a monk guard the doors of his senses? Here, young man, a monk, having seen a form with the eye, does not grasp at its general appearance or its detailed features; because if the eye faculty were to remain unrestrained, evil unwholesome states of covetousness and displeasure would flow in, he practices for its restraint, guards the eye faculty, and undertakes the restraint of the eye faculty. Having heard a sound with the ear; having smelled a smell with the nose; having tasted a taste with the tongue; having felt a tactile sensation with the body; having cognized a mental phenomenon with the mind, he does not grasp at its general appearance or its detailed features; because if the mind faculty were to remain unrestrained, evil unwholesome states of covetousness and displeasure would flow in, he practices for its restraint, guards the mind faculty, and undertakes the restraint of the mind faculty. Equipped with this noble restraint of the senses, he experiences an inner, unblemished happiness. It is in this way, young man, that a monk guards the doors of his senses.\"",
      "sinhala": "‘‘අනඳ මහණෙනි, භාග්‍යවතුන් වහන්සේ යම් උතුම් සමාධිස්කන්ධයක් වර්ණනා කළ සේක්ද, යම් සමාධියක මේ ජනතාව සමාදන් කරවා, පිහිටුවා, ග්‍රහණය කරවා වදාළ සේක්ද, ඒ උතුම් සමාධිස්කන්ධය කවරේද?’’\n‘‘බමුණ, මහණෙක් ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර ඇත්තෙක් වන්නේ කෙසේද? බමුණ, මෙහි භික්ෂුවක් ඇසින් රූපයක් දැක, නිමිති නොගනී, අනුබ්‍යංජන නොගනී; යම් හෙයකින් ඇස නම් වූ මේ ඉන්ද්‍රිය සංවර නොවී සිටින කල්හි ලෝභය හා ද්වේෂය සහිත වූ පව් අකුසල ධර්මයන් ඔහුට ආශ්‍රව වනු ඇත, ඒ අකුසල් වළක්වා ගැනීම සඳහා ඔහු පිළිපදී, ඇස නම් වූ ඉන්ද්‍රිය රකී, ඇස නම් වූ ඉන්ද්‍රියෙහි සංවරයට පැමිණේ. කනෙන් ශබ්දයක් අසා, නිමිති නොගනී, අනුබ්‍යංජන නොගනී; යම් හෙයකින් කන නම් වූ මේ ඉන්ද්‍රිය සංවර නොවී සිටින කල්හි ලෝභය හා ද්වේෂය සහිත වූ පව් අකුසල ධර්මයන් ඔහුට ආශ්‍රව වනු ඇත, ඒ අකුසල් වළක්වා ගැනීම සඳහා ඔහු පිළිපදී, කන නම් වූ ඉන්ද්‍රිය රකී, කන නම් වූ ඉන්ද්‍රියෙහි සංවරයට පැමිණේ. නාසයෙන් ගඳක් ආඝ්‍රාණය කර, නිමිති නොගනී, අනුබ්‍යංජන නොගනී; යම් හෙයකින් නාසය නම් වූ මේ ඉන්ද්‍රිය සංවර නොවී සිටින කල්හි ලෝභය හා ද්වේෂය සහිත වූ පව් අකුසල ධර්මයන් ඔහුට ආශ්‍රව වනු ඇත, ඒ අකුසල් වළක්වා ගැනීම සඳහා ඔහු පිළිපදී, නාසය නම් වූ ඉන්ද්‍රිය රකී, නාසය නම් වූ ඉන්ද්‍රියෙහි සංවරයට පැමිණේ. දිවෙන් රසයක් විඳ, නිමිති නොගනී, අනුබ්‍යංජන නොගනී; යම් හෙයකින් දිව නම් වූ මේ ඉන්ද්‍රිය සංවර නොවී සිටින කල්හි ලෝභය හා ද්වේෂය සහිත වූ පව් අකුසල ධර්මයන් ඔහුට ආශ්‍රව වනු ඇත, ඒ අකුසල් වළක්වා ගැනීම සඳහා ඔහු පිළිපදී, දිව නම් වූ ඉන්ද්‍රිය රකී, දිව නම් වූ ඉන්ද්‍රියෙහි සංවරයට පැමිණේ. කයින් ස්පර්ශයක් දැන, නිමිති නොගනී, අනුබ්‍යංජන නොගනී; යම් හෙයකින් කය නම් වූ මේ ඉන්ද්‍රිය සංවර නොවී සිටින කල්හි ලෝභය හා ද්වේෂය සහිත වූ පව් අකුසල ධර්මයන් ඔහුට ආශ්‍රව වනු ඇත, ඒ අකුසල් වළක්වා ගැනීම සඳහා ඔහු පිළිපදී, කය නම් වූ ඉන්ද්‍රිය රකී, කය නම් වූ ඉන්ද්‍රියෙහි සංවරයට පැමිණේ. මනසින් ධර්මයක් දැන, නිමිති නොගනී, අනුබ්‍යංජන නොගනී; යම් හෙයකින් මනස නම් වූ මේ ඉන්ද්‍රිය සංවර නොවී සිටින කල්හි ලෝභය හා ද්වේෂය සහිත වූ පව් අකුසල ධර්මයන් ඔහුට ආශ්‍රව වනු ඇත, ඒ අකුසල් වළක්වා ගැනීම සඳහා ඔහු පිළිපදී, මනස නම් වූ ඉන්ද්‍රිය රකී, මනස නම් වූ ඉන්ද්‍රියෙහි සංවරයට පැමිණේ. ඔහු මේ උතුම් ඉන්ද්‍රිය සංවරයෙන් යුක්තව, අභ්‍යන්තරික පීඩාරහිත සුවයක් අනුභව කරයි. බමුණ, භික්ෂුවක් ඉන්ද්‍රියයන්හි ගුප්ත ද්වාර ඇත්තෙක් වන්නේ මෙසේය.",
      "paliTitle": "Samādhikkhandho",
      "englishTitle": "Section on Concentration",
      "sinhalaTitle": "සමාධි ඛණ්ඩය"
    },
    {
      "number": 455,
      "pali": "‘‘Kathañca, māṇava, bhikkhu satisampajaññena samannāgato hoti? Idha, māṇava, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. Evaṃ kho, māṇava, bhikkhu satisampajaññena samannāgato hoti.",
      "english": "And how, young man, is a monk endowed with mindfulness and clear comprehension? Here, young man, a monk acts with clear comprehension when going forward and returning; when looking ahead and looking around; when bending and stretching his limbs; when wearing his outer robe, bowl, and inner robe; when eating, drinking, chewing, and tasting; when defecating and urinating; when walking, standing, sitting, sleeping, waking, speaking, and remaining silent. It is in this way, young man, that a monk is endowed with mindfulness and clear comprehension.",
      "sinhala": "\"එම්බා මාණවක, භික්ෂුවක් සිහි නුවණින් යුක්ත වන්නේ කෙසේද? එම්බා මාණවක, මෙහිදී භික්ෂුවක් ඉදිරියට යන විටත්, ආපසු එන විටත් සිහි නුවණින් යුක්තව කටයුතු කරයි. ඉදිරිය බලන විටත්, වටපිට බලන විටත් සිහි නුවණින් යුක්තව කටයුතු කරයි. අත් පා හැකිළීමේදීත්, දිගහැරීමේදීත් සිහි නුවණින් යුක්තව කටයුතු කරයි. සඟළ සිවුර, පාත්‍රය හා අඳනය දැරීමේදීත් සිහි නුවණින් යුක්තව කටයුතු කරයි. අනුභව කරන විටත්, පානය කරන විටත්, සපා කන විටත්, රස විඳින විටත් සිහි නුවණින් යුක්තව කටයුතු කරයි. මලමුත්‍ර පහකිරීමේදීත් සිහි නුවණින් යුක්තව කටයුතු කරයි. යන විටත්, සිටින විටත්, හිඳින විටත්, සයනය කරන විටත්, අවදිව සිටින විටත්, කතා කරන විටත්, නිහඬව සිටින විටත් සිහි නුවණින් යුක්තව කටයුතු කරයි. එම්බා මාණවක, මේ අයුරින් භික්ෂුවක් සිහි නුවණින් යුක්ත වන්නේය.\"",
      "paliTitle": ""
    },
    {
      "number": 456,
      "pali": "‘‘Kathañca, māṇava, bhikkhu santuṭṭho hoti? Idha, māṇava, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. Seyyathāpi, māṇava, pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti; evameva kho, māṇava, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. Evaṃ kho, māṇava, bhikkhu santuṭṭho hoti.",
      "english": "And how, young man, is a monk content? Here, young man, a monk is content with robes that suffice to maintain the body and almsfood that suffices to maintain the stomach. Wherever he goes, he goes only taking these with him. Just as, young man, a bird, wherever it flies, flies only with its wings as its burden; even so, young man, a monk is content with robes that suffice to maintain the body and almsfood that suffices to maintain the stomach. Wherever he goes, he goes only taking these with him. Thus, young man, a monk is content.",
      "sinhala": "මානවකය, භික්ෂුවක් සතුටු වන්නේ කෙසේද? මානවකය, මෙහිදී භික්ෂුවක් ශරීරය පවත්වාගෙන යාමට ප්\\u200Dරමාණවත් සිවුරකින් ද, කුස පවත්වාගෙන යාමට ප්\\u200Dරමාණවත් පිණ්ඩපාතයකින් ද සතුටු වෙයි. ඔහු කොහේ කොහේ ගියත්, මේවා පමණක් ගෙනම යයි. මානවකය, යම්සේ පක්ෂියෙක්, කුරුල්ලෙක් කොහේ කොහේ පියාසර කළත්, තමාගේ පියාපත් බර පමණක් ගෙනම පියාසර කරන්නේද; එලෙසින්ම මානවකය, භික්ෂුව ශරීරය පවත්වාගෙන යාමට ප්\\u200Dරමාණවත් සිවුරකින් ද, කුස පවත්වාගෙන යාමට ප්\\u200Dරමාණවත් පිණ්ඩපාතයකින් ද සතුටු වෙයි. ඔහු කොහේ කොහේ ගියත්, මේවා පමණක් ගෙනම යයි. මානවකය, භික්ෂුවක් මෙලෙසින් සතුටු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 457,
      "pali": "‘‘So iminā ca ariyena sīlakkhandhena samannāgato, iminā ca ariyena indriyasaṃvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato, imāya ca ariyāya santuṭṭhiyā samannāgato vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. So pacchābhattaṃ piṇḍapātappaṭikkanto nisīdati pallaṅkaṃ ābhujitvā, ujuṃ kāyaṃ paṇidhāya, parimukhaṃ satiṃ upaṭṭhapetvā.",
      "english": "He, being endowed with this noble aggregate of virtue, and endowed with this noble restraint of the senses, and endowed with this noble mindfulness and clear comprehension, and endowed with this noble contentment, resorts to a secluded dwelling: a forest, the root of a tree, a mountain, a ravine, a mountain cave, a charnel ground, a forest grove, the open air, a heap of straw.\n\nHe, after his meal, having returned from his alms-round, sits down having folded his legs crosswise, having set his body erect, and having established mindfulness to the fore.",
      "sinhala": "ඔහු මේ ආර්ය ශීලස්කන්ධයෙන් යුක්තව, මේ ආර්ය ඉන්ද්‍රිය සංවරයෙන් යුක්තව, මේ ආර්ය සති සම්පජඤ්ඤයෙන් යුක්තව, මේ ආර්ය සන්තුෂ්ටියෙන් යුක්තව හුදෙකලා සේනාසනයක්, එනම්: ආරණ්‍යයක්, රුක්මුලක්, පර්වතයක්, කන්දරාවක්, ගිරිගුහාවක්, සුසානයක්, වනප්200Dරස්ථයක්, එළිමහනක් හෝ පිදුරු ගොඩක් භජනය කරයි.\n\nඔහු භෝජනයෙන් පසුව පිණ්ඩපාතයෙන් ආපසු පැමිණ, පලක් බැඳ, කය ඍජුව තබාගෙන, පෙරමුවෙහි සිහිය පිහිටුවාගෙන හිඳගනී.",
      "paliTitle": ""
    },
    {
      "number": 458,
      "pali": "‘‘So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati abhijjhāya cittaṃ parisodheti. Byāpādapadosaṃ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī byāpādapadosā cittaṃ parisodheti. Thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī sato sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati ajjhattaṃ vūpasantacitto uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti.",
      "english": "Having abandoned covetousness in the world, he dwells with a mind free from covetousness; he purifies his mind from covetousness. Having abandoned ill-will and hatred, he dwells with a mind free from ill-will, sympathetic to the welfare of all living beings; he purifies his mind from ill-will and hatred. Having abandoned sloth and torpor, he dwells free from sloth and torpor, perceiving light, mindful and clearly comprehending; he purifies his mind from sloth and torpor. Having abandoned restlessness and remorse, he dwells unagitated, with a mind inwardly calmed; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having crossed over doubt, without perplexity regarding wholesome qualities; he purifies his mind from doubt.",
      "sinhala": "ඔහු ලෝකයෙහි අභිජ්ඣාව ප්‍ර‌හීණ කොට, අභිජ්ඣා රහිත සිතකින් වාසය කරයි. අභිජ්ඣාවෙන් සිත පිරිසිදු කරයි.\n\nඔහු ව්‍යාපාද පදෝෂය ප්‍ර‌හීණ කොට, ව්‍යාපාද රහිත සිතකින්, සියලු ප්‍ර‌ාණභූතයන්ට හිතානුකම්පීව වාසය කරයි. ව්‍යාපාද පදෝෂයෙන් සිත පිරිසිදු කරයි.\n\nඔහු ථීනමිද්ධය ප්‍ර‌හීණ කොට, ථීනමිද්ධ රහිතව, ආලෝක සංඥා ඇතිව, සිහියෙන් හා සම්පජඤ්ඤයෙන් යුතුව වාසය කරයි. ථීනමිද්ධයෙන් සිත පිරිසිදු කරයි.\n\nඔහු උද්ධච්ච කුක්කුච්චය ප්‍ර‌හීණ කොට, උද්ධත බවින් තොරව, අධ්‍යාත්මිකව සංහිඳුණු සිතකින් යුක්තව වාසය කරයි. උද්ධච්ච කුක්කුච්චයෙන් සිත පිරිසිදු කරයි.\n\nඔහු විචිකිච්ඡාව ප්‍ර‌හීණ කොට, විචිකිච්ඡාව ඉක්මවා, කුසල ධර්‌මයන් සම්බන්ධයෙන් සැකයක් රහිතව වාසය කරයි. විචිකිච්ඡාවෙන් සිත පිරිසිදු කරයි.",
      "paliTitle": ""
    },
    {
      "number": 459,
      "pali": "‘‘Seyyathāpi, māṇava, puriso iṇaṃ ādāya kammante payojeyya. Tassa te kammantā samijjheyyuṃ. So yāni ca porāṇāni iṇamūlāni tāni ca byantiṃ kareyya, siyā cassa uttariṃ avasiṭṭhaṃ dārabharaṇāya. Tassa evamassa – ‘ahaṃ kho pubbe iṇaṃ ādāya kammante payojesiṃ. Tassa me te kammantā samijjhiṃsu. Sohaṃ yāni ca porāṇāni iṇamūlāni tāni ca byantiṃ akāsiṃ, atthi ca me uttariṃ avasiṭṭhaṃ dārabharaṇāyā’ti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, young man, a certain man might take a loan and invest it in businesses. If those businesses of his were to succeed, he would then settle those old principal debts, and there would be a surplus remaining for him to support his family. He would then think, ‘Indeed, I previously took a loan and invested it in businesses. Those businesses of mine succeeded. I have settled those old principal debts, and there is a surplus remaining for me to support my family.’ From that, he would obtain delight and attain happiness.",
      "sinhala": "යම්සේ, මානවක, යම් පුරුෂයෙක් ණයක් ගෙන ව්‍යාපාරයක යෙදේවා. ඔහුගේ ඒ ව්‍යාපාර සාර්ථක වේවා. හෙතෙම යම් පෙර ණය මුදල් ඇත්නම් ඒවා ගෙවා දමයි. තවද ඔහුට දූ දරුවන් පෝෂණය කිරීමට ඉතිරි වේ. ඔහුට මෙසේ සිතේවා: ‘මම පෙර ණයක් ගෙන ව්‍යාපාරයක යෙදුනෙමි. මගේ ඒ ව්‍යාපාර සාර්ථක විය. මම යම් පෙර ණය මුදල් ඇත්නම් ඒවා ගෙවා දැමුවෙමි. තවද මට දූ දරුවන් පෝෂණය කිරීමට ඉතිරි වී ඇත’ කියා. හෙතෙම එයින් ප්‍රමෝදය ලබයි, සෝමනස්සය අත්පත් කර ගනී.",
      "paliTitle": ""
    },
    {
      "number": 460,
      "pali": "‘‘Seyyathāpi, māṇava, puriso ābādhiko assa dukkhito bāḷhagilāno; bhattañcassa nacchādeyya, na cassa kāye balamattā. So aparena samayena tamhā ābādhā mucceyya, bhattañcassa chādeyya, siyā cassa kāye balamattā. Tassa evamassa – ‘ahaṃ kho pubbe ābādhiko ahosiṃ dukkhito bāḷhagilāno, bhattañca me nacchādesi, na ca me āsi kāye balamattā. Somhi etarahi tamhā ābādhā mutto bhattañca me chādeti, atthi ca me kāye balamattā’ti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, young man, a person might be afflicted, suffering, and severely ill; food would not appeal to him, nor would there be any strength in his body. At a later time, he might be freed from that affliction, food would appeal to him, and there would be some strength in his body. Then it would occur to him: ‘Indeed, formerly I was afflicted, suffering, and severely ill; food did not appeal to me, nor was there any strength in my body. But now I am freed from that affliction, food appeals to me, and there is strength in my body.’ Because of that, he would experience joy and attain happiness.",
      "sinhala": "මහාණවක, යම් සේ පුරුෂයෙක් ආබාධිතව, දුකට පත්ව, මහත් සේ රෝගීව සිටින්නේය. ඔහුට ආහාරය රුචි නොවේ, ශරීරයේ ද බලයක් නැත.\n\nඔහු ටික කලකට පසු ඒ ආබාධයෙන් මිදෙන්නේය, ආහාරය ඔහුට රුචි වන්නේය, ඔහුගේ ශරීරයේ ද යම් බලයක් වන්නේය. එවිට ඔහුට මෙසේ සිතෙන්නේය – ‘ඇත්තෙන්ම මම පෙර ආබාධිතව, දුකට පත්ව, මහත් සේ රෝගීව සිටියෙමි, ආහාරය මට රුචි නොවීය, මගේ ශරීරයේ ද බලයක් නොවීය. එහෙත් දැන් මම ඒ ආබාධයෙන් මිදී සිටිමි, ආහාරය මට රුචි වේ, මගේ ශරීරයේ ද යම් බලයක් ඇත.’ ඔහු ඒ හේතුවෙන් ප්‍රමෝදය ලබන්නේය, සෝමනස්සයට පැමිණෙන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 461,
      "pali": "‘‘Seyyathāpi, māṇava, puriso bandhanāgāre baddho assa. So aparena samayena tamhā bandhanāgārā mucceyya sotthinā abbhayena, na cassa kiñci bhogānaṃ vayo. Tassa evamassa – ‘ahaṃ kho pubbe bandhanāgāre baddho ahosiṃ. Somhi etarahi tamhā bandhanāgārā mutto sotthinā abbhayena, natthi ca me kiñci bhogānaṃ vayo’ti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, young man, a person might be imprisoned in a jail. He, after some time, might be released from that prison safely and securely, and there would be no loss of his possessions. He would think thus: ‘Formerly, I was imprisoned in a jail. But now I am released from that prison safely and securely, and there is no loss of my possessions.’ He, because of that, would experience joy, and would attain happiness.",
      "sinhala": "තරුණය, යම්සේ පුරුෂයෙක් බන්ධනාගාරයක සිරවී සිටින්නේද. පසු කලෙක ඔහු ඒ බන්ධනාගාරයෙන් ආරක්ෂිතව, නිර්භයව නිදහස් වන්නේය, ඔහුගේ සම්පත්වලට කිසිදු හානියක්ද නැත්තේය. ඔහුට මෙසේ සිතෙන්නේය – ‘මම පෙර බන්ධනාගාරයක සිරවී සිටියෙමි. එහෙත් මම දැන් ඒ බන්ධනාගාරයෙන් ආරක්ෂිතව, නිර්භයව නිදහස් වී සිටිමි. මගේ සම්පත්වලට කිසිදු හානියක්ද නැත්තේය’යි. ඔහු ඒ හේතුවෙන් ප්‍ර​මෝදය ලබන්නේය, සෝමනස්සයට පැමිණෙන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 462,
      "pali": "‘‘Seyyathāpi, māṇava, puriso dāso assa anattādhīno parādhīno na yenakāmaṃgamo. So aparena samayena tamhā dāsabyā mucceyya, attādhīno aparādhīno bhujisso yenakāmaṃgamo. Tassa evamassa – ‘ahaṃ kho pubbe dāso ahosiṃ anattādhīno parādhīno na yenakāmaṃgamo. Somhi etarahi tamhā dāsabyā mutto attādhīno aparādhīno bhujisso yenakāmaṃgamo’ti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, young man, a man might be a slave, not his own master, dependent on others, not going where he pleases. Then, after some time, he might be freed from that slavery, becoming his own master, not dependent on others, a free man, going where he pleases. He would then think: ‘Indeed, I was previously a slave, not my own master, dependent on others, not going where I pleased. But now I am freed from that slavery, my own master, not dependent on others, a free man, going where I please.’ On that account, he would experience gladness and attain happiness.",
      "sinhala": "මැනව, යම්සේ පුරුෂයෙක් තමාට අධීන නැති, අන් අයට යටත් වූ, තමන් කැමති තැනට යා නොහැකි දාසයෙක් වී සිටින්නේද,\n\nඔහු පසුව යම් කලෙක ඒ දාසභාවයෙන් නිදහස් වී, තමාට අධීන වූ, අන් අයට යටත් නැති, කැමති තැනට යා හැකි නිදහස් පුද්ගලයෙක් වන්නේය.\n\nඔහුට මෙසේ සිතෙන්නේය – ‘මම පෙර තමාට අධීන නැති, අන් අයට යටත් වූ, කැමති තැනට යා නොහැකි දාසයෙක් වීමි. මම දැන් ඒ දාසභාවයෙන් නිදහස් වූ, තමාට අධීන වූ, අන් අයට යටත් නැති, කැමති තැනට යා හැකි නිදහස් පුද්ගලයෙක් වෙමි’යි.\n\nඔහු ඒ හේතුවෙන් ප‍්‍රමෝදයට පත්වේ, සොම්නසට පත්වේ.",
      "paliTitle": ""
    },
    {
      "number": 463,
      "pali": "‘‘Seyyathāpi, māṇava, puriso sadhano sabhogo kantāraddhānamaggaṃ paṭipajjeyya dubbhikkhaṃ sappaṭibhayaṃ. So aparena samayena taṃ kantāraṃ nitthareyya, sotthinā gāmantaṃ anupāpuṇeyya khemaṃ appaṭibhayaṃ. Tassa evamassa – ‘ahaṃ kho pubbe sadhano sabhogo kantāraddhānamaggaṃ paṭipajjiṃ dubbhikkhaṃ sappaṭibhayaṃ. Somhi etarahi kantāraṃ nitthiṇṇo, sotthinā gāmantaṃ anuppatto khemaṃ appaṭibhaya’nti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, young man, a person, wealthy and prosperous, might set out on a wilderness road that is famine-stricken and perilous. After some time, he might cross that wilderness and safely reach a village vicinity that is secure and free from danger. Then he would think thus: ‘Indeed, I formerly, wealthy and prosperous, set out on a wilderness road that was famine-stricken and perilous. But now I have crossed that wilderness and safely reached a village vicinity that is secure and free from danger.’ On that account, he would experience joy and attain gladness.",
      "sinhala": "මානවක, යම් සේ ධනවත් වූ, භෝග සම්පත් ඇති පුරුෂයෙක් දුර්භික්ෂයෙන් පිරුණු, භය සහිත වූ කාන්තාර මාර්ගයක ගමන් කරන්නේද. ඔහු යම් කලෙක ඒ කාන්තාරය තරණය කර, භය රහිත වූ, ක්ෂේම වූ ගම්මානයකට සුවසේ පැමිණෙන්නේද. ඔහුට මෙසේ සිතෙන්නේය: ‘මම පෙර ධනවත් ව, භෝග සම්පත් ඇතුව, දුර්භික්ෂයෙන් පිරුණු, භය සහිත වූ කාන්තාර මාර්ගයක ගමන් කළෙමි. මම දැන් කාන්තාරය තරණය කර, භය රහිත වූ, ක්ෂේම වූ ගම්මානයකට සුවසේ පැමිණ සිටිමි’යි. ඔහු ඒ හේතුවෙන් ප්‍රමෝදය ලබන්නේය, සෝමනස්සය අත්දකින්නේය.",
      "paliTitle": ""
    },
    {
      "number": 464,
      "pali": "‘‘Evameva kho, māṇava, bhikkhu yathā iṇaṃ yathā rogaṃ yathā bandhanāgāraṃ yathā dāsabyaṃ yathā kantāraddhānamaggaṃ, evaṃ ime pañca nīvaraṇe appahīne attani samanupassati.",
      "english": "Just so, young man, a monk perceives these five unabandoned hindrances within himself as a debt, as a sickness, as a prison, as slavery, and as a perilous journey through a wilderness.",
      "sinhala": "එසෙම මානවකය, භික්ෂුව යම්සේ ණය, යම්සේ රෝගය, යම්සේ බන්ධනාගාරය, යම්සේ දාසභාවය, යම්සේ කතර මඟක්ද, එලෙසම පහ නොවූ මේ පංච නීවරණයන් තමා තුළ මැනැවින් දකියි.",
      "paliTitle": ""
    },
    {
      "number": 465,
      "pali": "‘‘Seyyathāpi, māṇava, yathā āṇaṇyaṃ yathā ārogyaṃ yathā bandhanāmokkhaṃ yathā bhujissaṃ yathā khemantabhūmiṃ. Evameva bhikkhu ime pañca nīvaraṇe pahīne attani samanupassati.",
      "english": "Just as, young man, one might experience freedom from debt, good health, release from prison, freedom from slavery, or a place of security; even so, a monk perceives within himself these five hindrances to be abandoned.",
      "sinhala": "මානවක, යම් සේ ණය නැති බවක්ද, නිරෝගී බවක්ද, බන්ධනයෙන් මිදීමක්ද, දාස භාවයෙන් මිදීමක්ද, ක්‍ෂේමභූමියක්ද වේද, එලෙසින්ම භික්ෂුව තමන් තුළ පහවූ මේ පඤ්ච නීවරණ දකියි.",
      "paliTitle": ""
    },
    {
      "number": 466,
      "pali": "‘‘Tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṃ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyati.",
      "english": "For him, as he discerns these five hindrances abandoned within himself, gladness arises. When he is gladdened, rapture arises. When his mind is rapturous, his body becomes tranquil. When his body is tranquil, he experiences pleasure. For one experiencing pleasure, the mind becomes concentrated.",
      "sinhala": "ඔහු තමා තුළ මේ පඤ්ච නීවරණ ප්‍රහීණ වී ඇති බව දකින කල්හි ඔහුට ප්‍රමෝදය උපදී. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය උපදී. ප්‍රීතිමත් වූ තැනැත්තාගේ කය සංහිඳේ. සංහිඳුණු කය ඇති තැනැත්තා සැප විඳියි. සුවපත් වූ තැනැත්තාගේ සිත සමාධිගත වේ.",
      "paliTitle": ""
    },
    {
      "number": 467,
      "pali": "‘‘So vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hoti. ‘‘Seyyathāpi, māṇava, dakkho nhāpako vā nhāpakantevāsī vā kaṃsathāle nhānīyacuṇṇāni ākiritvā udakena paripphosakaṃ paripphosakaṃ sandeyya. Sāyaṃ nhānīyapiṇḍi snehānugatā snehaparetā santarabāhirā phuṭā snehena, na ca paggharaṇī. Evameva kho, māṇava, bhikkhu imameva kāyaṃ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hoti. Yampi, māṇava, bhikkhu vivicceva kāmehi vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hoti. Idampissa hoti samādhismiṃ.",
      "english": "He, quite secluded from sensual pleasures, secluded from unskillful mental qualities, enters and abides in the first jhana, which is accompanied by directed thought and evaluation, and has rapture and happiness born of seclusion. He suffuses, pervades, fills, and permeates this very body with the rapture and happiness born of seclusion, so that there is no part of his entire body that is not pervaded by the rapture and happiness born of seclusion.\n\nJust as, young man, a skillful bath attendant or his apprentice, having scattered bath powder into a brass plate, would moisten it thoroughly with water. That ball of bath powder, thoroughly saturated and imbued with moisture, permeated throughout, internally and externally, with the moisture, does not leak.\n\nIn the same way, young man, a monk suffuses, pervades, fills, and permeates this very body with the rapture and happiness born of seclusion, so that there is no part of his entire body that is not pervaded by the rapture and happiness born of seclusion. Furthermore, young man, when a monk, quite secluded from sensual pleasures, secluded from unskillful mental qualities, enters and abides in the first jhana, which is accompanied by directed thought and evaluation, and has rapture and happiness born of seclusion, he suffuses, pervades, fills, and permeates this very body with the rapture and happiness born of seclusion, so that there is no part of his entire body that is not pervaded by the rapture and happiness born of seclusion. This too is an aspect of his concentration.",
      "sinhala": "ඔහු කාමයන්ගෙන් වෙන්වම, අකුසල ධර්‍මයන්ගෙන් වෙන්ව, විතර්‍ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේම ශරීරය විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් පුරවයි, වසාගනියි, පිරී ඉතිරී යවයි, විහිදුවයි. ඔහුගේ මුළු ශරීරයේම විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් ස්පර්ශ නොවූ කොටසක් නොමැත.\n\nමානවක, යම්සේ දක්ෂ ස්නානය කරන්නෙක් හෝ ඔහුගේ ශිෂ්‍යයෙක් හෝ පිත්තල තලයකට ස්නාන චූර්ණ දමා වතුරෙන් තෙමෙන්නට තෙමෙන්නට දියකරයි. ඒ ස්නාන පිඩය තෙතමනයෙන් යුක්තව, තෙතමනයෙන් වැසීගත්ව, ඇතුළතත් පිටතත් තෙතමනයෙන් පිරී, ගලා නොයන්නේය. එපරිද්දෙන්ම, මානවක, භික්ෂුව මේම ශරීරය විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් පුරවයි, වසාගනියි, පිරී ඉතිරී යවයි, විහිදුවයි. ඔහුගේ මුළු ශරීරයේම විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් ස්පර්ශ නොවූ කොටසක් නොමැත.\n\nතවද, මානවක, භික්ෂුව කාමයන්ගෙන් වෙන්වම, අකුසල ධර්‍මයන්ගෙන් වෙන්ව, විතර්‍ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය හා සැපය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේම ශරීරය විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් පුරවයි, වසාගනියි, පිරී ඉතිරී යවයි, විහිදුවයි. ඔහුගේ මුළු ශරීරයේම විවේකයෙන් හටගත් ප්‍රීතිය හා සැපයෙන් ස්පර්ශ නොවූ කොටසක් නොමැත. මෙයද ඔහුගේ සමාධියෙහි වේ.",
      "paliTitle": ""
    },
    {
      "number": 468,
      "pali": "‘‘Puna caparaṃ, māṇava, bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṃ hoti. ‘‘Seyyathāpi, māṇava, udakarahado gambhīro ubbhidodako. Tassa nevassa puratthimāya disāya udakassa āyamukhaṃ, na dakkhiṇāya disāya udakassa āyamukhaṃ, na pacchimāya disāya udakassa āyamukhaṃ, na uttarāya disāya udakassa āyamukhaṃ, devo ca na kālena kālaṃ sammā dhāraṃ anupaveccheyya. Atha kho tamhāva udakarahadā sītā vāridhārā ubbhijjitvā tameva udakarahadaṃ sītena vārinā abhisandeyya parisandeyya paripūreyya paripphareyya, nāssa kiñci sabbāvato udakarahadassa sītena vārinā apphuṭaṃ assa. Evameva kho, māṇava, bhikkhu…pe… yampi, māṇava, bhikkhu vitakkavicārānaṃ vūpasamā… pe… dutiyaṃ jhānaṃ upasampajja viharati, so imameva kāyaṃ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṃ hoti. Idampissa hoti samādhismiṃ.",
      "english": "Furthermore, young man, a monk, with the fading away of directed thought and sustained thought, with inner tranquilization, the mind's one-pointedness, enters and remains in the second jhana, which is without directed thought, without sustained thought, and born of concentration, rapture, and happiness. He pervades this very body with rapture and happiness born of concentration; he drenches, saturates, fills, and permeates it, so that there is no part of his entire body not pervaded by this rapture and happiness born of concentration.\n\nJust as, young man, a deep lake with water welling up from within, having no inlet for water from the east, no inlet from the south, no inlet from the west, no inlet from the north, and the rain god would not, from time to time, send down proper showers. Yet, cool streams of water would well up from that very lake and drench, saturate, fill, and permeate that very lake with cool water, so that there would be no part of the entire lake not pervaded by that cool water.\n\nIn the same way, young man, a monk, with the fading away of directed thought and sustained thought, with inner tranquilization, the mind's one-pointedness, enters and remains in the second jhana, which is without directed thought, without sustained thought, and born of concentration, rapture, and happiness. He pervades this very body with rapture and happiness born of concentration; he drenches, saturates, fills, and permeates it, so that there is no part of his entire body not pervaded by this rapture and happiness born of concentration. This, too, is his accomplishment in concentration.",
      "sinhala": "තවද, මානවක, භික්‍ෂු‍ව විතර්ක විචාරයන් සංසිඳවීමෙන් අධ්‍යාත්මිකව සිත පහදවාගෙන, සිතේ එකඟතාවය ඇතිකරගෙන, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සැප ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. හෙතෙම මේ ශරීරයම සමාධියෙන් හටගත් ප්‍රීති සැපයෙන් තෙමයි, විහිදුවයි, පුරවයි, පතුරුවයි; ඔහුගේ මුළු ශරීරයේ කිසිදු කොටසක් සමාධියෙන් හටගත් ප්‍රීති සැපයෙන් නොවැසී නොපවතී.\n\nමානවක, යම් සේ ගැඹුරු වූ, උල්පත් ජලයෙන් පෝෂණය වන විලක් වේ ද, එයට නැගෙනහිර දිශාවෙන් ජලය ගලා එන මඟක් නොවේ, දකුණු දිශාවෙන් ජලය ගලා එන මඟක් නොවේ, බටහිර දිශාවෙන් ජලය ගලා එන මඟක් නොවේ, උතුරු දිශාවෙන් ජලය ගලා එන මඟක් නොවේ, වර්ෂාව ද කලින් කලට මනාව ධාරා වැසි නොවැටේ. එහෙත් ඒ විලෙන්ම සිසිල් දිය දහරා මතුවී, ඒ විලම සිසිල් ජලයෙන් තෙමයි, විහිදුවයි, පුරවයි, පතුරුවයි; එහි මුළු විලේ කිසිදු කොටසක් සිසිල් ජලයෙන් නොවැසී නොපවතී.\n\nමානවක, එලෙසින්ම භික්‍ෂු‍ව විතර්ක විචාරයන් සංසිඳවීමෙන් අධ්‍යාත්මිකව සිත පහදවාගෙන, සිතේ එකඟතාවය ඇතිකරගෙන, විතර්ක රහිත වූ, විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීති සැප ඇති දෙවෙනි ධ්‍යානයට පැමිණ වාසය කරයි. හෙතෙම මේ ශරීරයම සමාධියෙන් හටගත් ප්‍රීති සැපයෙන් තෙමයි, විහිදුවයි, පුරවයි, පතුරුවයි; ඔහුගේ මුළු ශරීරයේ කිසිදු කොටසක් සමාධියෙන් හටගත් ප්‍රීති සැපයෙන් නොවැසී නොපවතී. මෙය ද ඔහුගේ සමාධියෙහි අංගයක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 469,
      "pali": "‘‘Puna caparaṃ, māṇava, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘‘upekkhako satimā sukhavihārī’’ti, tatiyaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṃ hoti. ‘‘Seyyathāpi, māṇava, uppaliniyaṃ vā paduminiyaṃ vā puṇḍarīkiniyaṃ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakānuggatāni antonimuggaposīni, tāni yāva caggā yāva ca mūlā sītena vārinā abhisannāni parisannāni paripūrāni paripphuṭāni, nāssa kiñci sabbāvataṃ uppalānaṃ vā padumānaṃ vā puṇḍarīkānaṃ vā sītena vārinā apphuṭaṃ assa. Evameva kho, māṇava, bhikkhu…pe… yampi, māṇava, bhikkhu pītiyā ca virāgā…pe… tatiyaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṃ hoti. Idampissa hoti samādhismiṃ.",
      "english": "Furthermore, young man, a monk, with the fading away of joy, dwells in equanimity, mindful and clearly comprehending. He experiences happiness with the body, which the Noble Ones declare as 'one who dwells in equanimity, mindful, and at ease.' He enters and dwells in the third jhana. He permeates, pervades, fills, and suffuses this very body with happiness free from joy, such that there is no part of his entire body that is not suffused by this happiness free from joy.\n\nJust as, young man, in a pond of blue, red, or white lotuses, some blue, red, or white lotuses, born in the water, grown in the water, remaining submerged in the water, and nourished from within the water, are drenched, permeated, filled, and suffused with cool water from their tips to their roots, such that there is no part of those blue, red, or white lotuses that is not suffused with cool water.\n\nEven so, young man, a monk, with the fading away of joy, dwells in equanimity, mindful and clearly comprehending. He experiences happiness with the body, which the Noble Ones declare as 'one who dwells in equanimity, mindful, and at ease.' He enters and dwells in the third jhana. He permeates, pervades, fills, and suffuses this very body with happiness free from joy, such that there is no part of his entire body that is not suffused by this happiness free from joy. This, too, pertains to his immersion in concentration.",
      "sinhala": "තවද, මාණවක, භික්ෂුව ප්‍ර‌ීතියෙන්ද වෙන්ව, උපේක්ෂාවෙන් යුතුව, සිහි නුවණින් යුතුව වාසය කරයි. ශරීරයෙන්ද සැපය අත්විඳියි. \"උපේක්ෂාවෙන් යුක්ත වූ, සිහි ඇති, සැපසේ වාසය කරන තැනැත්තා\" යැයි ආර්යයෝ යමක් පවසත් ද, ඒ තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේ කයම ප්‍ර‌ීති රහිත වූ සැපයකින් පුරවයි, පතුරුවයි, විහිදුවයි. ඔහුගේ මුළු කයේම කිසිම කොටසක් මේ ප්‍ර‌ීති රහිත සැපයෙන් නොපිරුණු තැනක් නොවේ.\n\nමාණවක, යම් සේ නෙළුම්, ඕලු හෝ පුණ්ඩරීක මල් සහිත පොකුණක, ජලයෙහිම උපන්නා වූ, ජලයෙහිම වැඩුණා වූ, ජලයෙන් මතු නොවූ, ජලයෙන්ම පෝෂණය ලබන්නා වූ සමහර නෙළුම් හෝ ඕලු හෝ පුණ්ඩරීක මල් අග සිට මුල දක්වාම සිසිල් දියෙන් තෙමී, පැතිරී, පිරී, විහිදී පවතී. ඒ නෙළුම්, ඕලු හෝ පුණ්ඩරීක මල්වල කිසිම කොටසක් සිසිල් දියෙන් නොපිරුණු තැනක් නොවේ.\n\nඑලෙසින්ම, මාණවක, භික්ෂුව ප්‍ර‌ීතියෙන්ද වෙන්ව, උපේක්ෂාවෙන් යුතුව, සිහි නුවණින් යුතුව වාසය කරයි. ශරීරයෙන්ද සැපය අත්විඳියි. \"උපේක්ෂාවෙන් යුක්ත වූ, සිහි ඇති, සැපසේ වාසය කරන තැනැත්තා\" යැයි ආර්යයෝ යමක් පවසත් ද, ඒ තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේ කයම ප්‍ර‌ීති රහිත වූ සැපයකින් පුරවයි, පතුරුවයි, විහිදුවයි. ඔහුගේ මුළු කයේම කිසිම කොටසක් මේ ප්‍ර‌ීති රහිත සැපයෙන් නොපිරුණු තැනක් නොවේ. මේද ඔහුගේ සමාධියෙහි කොටසක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 470,
      "pali": "‘‘Puna caparaṃ, māṇava, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ parisuddhena cetasā pariyodātena pharitvā nisinno hoti; nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṃ hoti. ‘‘Seyyathāpi, māṇava, puriso odātena vatthena sasīsaṃ pārupitvā nisinno assa, nāssa kiñci sabbāvato kāyassa odātena vatthena apphuṭaṃ assa. Evameva kho, māṇava, bhikkhu…pe… yampi, māṇava, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ parisuddhena cetasā pariyodātena pharitvā nisinno hoti; nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṃ hoti. Idampissa hoti samādhismiṃ.",
      "english": "Furthermore, young man, a monk, by the abandoning of pleasure and the abandoning of pain, and by the prior passing away of joy and sorrow, enters and remains in the fourth jhana, which is neither painful nor pleasant, with purity of mindfulness due to equanimity. He sits pervading this very body with a pure, clarified mind; there is no part of his entire body that is not pervaded by his pure, clarified mind.\n\nJust as, young man, a man might sit covering himself completely, even his head, with a white cloth, there would be no part of his entire body not pervaded by that white cloth. Even so, young man, a monk, by the abandoning of pleasure and the abandoning of pain, and by the prior passing away of joy and sorrow, enters and remains in the fourth jhana, which is neither painful nor pleasant, with purity of mindfulness due to equanimity. He sits pervading this very body with a pure, clarified mind; there is no part of his entire body that is not pervaded by his pure, clarified mind. This, too, is his accomplishment in concentration.",
      "sinhala": "තවද මාණවක, භික්ෂුව සැපයද දුකයද ප‍්‍රාහාණය කිරීමෙන්, පෙර පැවති සෝමනස්ස-දෝමනස්සයන්ගේ අස්තංගමනයෙන්, දුකක්ද සැපක්ද නැති උපේක්ෂා-ස්මෘති-පාරිශුද්ධියෙන් යුත් සිවුවන ධ්‍යානයට පැමිණ වාසය කරයි. හෙතෙම මේ ශරීරයම පිරිසිදු වූ, පරියෝදාත වූ සිතින් පතුරුවාගෙන වැඩ හිඳියි. ඔහුගේ මුළු ශරීරයෙහිම කිසිවක් ඒ පිරිසිදු වූ, පරියෝදාත වූ සිතින් නොපැතුරුණු නොවේ. මාණවක, යම් සේ නම් යම් පුරුෂයෙක් සුදු වස්ත්‍රයකින් හිස ද සහිතව පොරවාගෙන වාඩි වී සිටින්නේ නම්, ඔහුගේ මුළු ශරීරයෙහිම කිසිවක් ඒ සුදු වස්ත්‍රයෙන් නොපැතුරුණු නොවන්නේය. එලෙසින්ම මාණවක, භික්ෂුව සැපයද දුකයද ප‍්‍රාහාණය කිරීමෙන්, පෙර පැවති සෝමනස්ස-දෝමනස්සයන්ගේ අස්තංගමනයෙන්, දුකක්ද සැපක්ද නැති උපේක්ෂා-ස්මෘති-පාරිශුද්ධියෙන් යුත් සිවුවන ධ්‍යානයට පැමිණ වාසය කරයි. හෙතෙම මේ ශරීරයම පිරිසිදු වූ, පරියෝදාත වූ සිතින් පතුරුවාගෙන වැඩ හිඳියි. ඔහුගේ මුළු ශරීරයෙහිම කිසිවක් ඒ පිරිසිදු වූ, පරියෝදාත වූ සිතින් නොපැතුරුණු නොවේ. මෙයද ඔහුගේ සමාධියට අයත් වේ.",
      "paliTitle": ""
    },
    {
      "number": 471,
      "pali": "‘‘Ayaṃ kho so, māṇava, ariyo samādhikkhandho yassa so bhagavā vaṇṇavādī ahosi, yattha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesi. Atthi cevettha uttarikaraṇīya’’nti. ‘‘Acchariyaṃ, bho ānanda, abbhutaṃ, bho ānanda! So cāyaṃ, bho ānanda, ariyo samādhikkhandho paripuṇṇo, no aparipuṇṇo. Evaṃ paripuṇṇaṃ cāhaṃ, bho ānanda, ariyaṃ samādhikkhandhaṃ ito bahiddhā aññesu samaṇabrāhmaṇesu na samanupassāmi. Evaṃ paripuṇṇañca, bho ānanda, ariyaṃ samādhikkhandhaṃ ito bahiddhā aññe samaṇabrāhmaṇā attani samanupasseyyuṃ, te tāvatakeneva attamanā assu – ‘alamettāvatā, katamettāvatā, anuppatto no sāmaññattho, natthi no kiñci uttarikaraṇīya’nti. Atha ca pana bhavaṃ ānando evamāha – ‘atthi cevettha uttarikaraṇīya’’’nti. ",
      "english": "Indeed, young man, this is that noble body of concentration which the Blessed One extolled, and in which he encouraged, established, and settled this populace. And yet, there is still something further to be done here. It is wonderful, Venerable Ānanda, it is amazing, Venerable Ānanda! And this noble body of concentration, Venerable Ānanda, is complete, not incomplete. Such a complete noble body of concentration, Venerable Ānanda, I do not perceive among other recluses and brahmins outside of this teaching. If other recluses and brahmins outside of this were to perceive such a complete noble body of concentration in themselves, they would be content with just that, saying: 'This is enough! This is done! Our goal of recluseship has been attained! There is nothing further for us to do!' Yet, Venerable Ānanda says this: 'And there is still something further to be done here.'",
      "sinhala": "මාණවක, භාග්‍යවතුන් වහන්සේ යමක් වර්ණනා කළ සේක් ද, යම් දෙයක මේ ජනතාව සමාදන් කරවා, පිහිටුවා, ස්ථාවර කළ සේක් ද, ඒ ආර්ය සමාධි ස්කන්ධය මෙයයි. එහෙත් මෙහි කළ යුතු තවත් දෙයක් තිබේ.\n\nආශ්චර්යයකි, භවත් ආනන්ද, අද්භූතයකි, භවත් ආනන්ද! භවත් ආනන්ද, මේ ආර්ය සමාධි ස්කන්ධය පරිපූර්ණයි, අසම්පූර්ණ නොවේ. භවත් ආනන්ද, මෙබඳු පරිපූර්ණ ආර්ය සමාධි ස්කන්ධයක් මම මෙයින් බැහැර අන්‍ය ශ්‍රමණ බ්‍රාහ්මණයන් අතර නොදකිමි. භවත් ආනන්ද, මෙබඳු පරිපූර්ණ ආර්ය සමාධි ස්කන්ධයක් මෙයින් බැහැර අන්‍ය ශ්‍රමණ බ්‍රාහ්මණයෝ තමන් තුළින් දැක්කේ නම්, ඔවුහු එපමණකින්ම සතුටු වන්නාහුය – ‘මෙපමණ ප්‍රමාණවත්ය, මෙපමණ කර ඇත, අපගේ ශ්‍රමණ ජීවිතයේ අර්ථය ලබා ඇත, අපට කළ යුතු අන් කිසිවක් නැත’ යි. එහෙත් භවත් ආනන්ද තෙමේ මෙසේ කියයි – ‘එහෙත් මෙහි කළ යුතු තවත් දෙයක් තිබේ’ යි.",
      "paliTitle": ""
    },
    {
      "number": 472,
      "pali": "‘‘Katamo pana so, bho ānanda, ariyo paññākkhandho, yassa bho bhavaṃ gotamo vaṇṇavādī ahosi, yattha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesī’’ti? ‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti. So evaṃ pajānāti – ‘ayaṃ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṃsanadhammo; idañca pana me viññāṇaṃ ettha sitaṃ ettha paṭibaddha’nti. ‘‘Seyyathāpi, māṇava, maṇi veḷuriyo subho jātimā aṭṭhaṃso suparikammakato accho vippasanno anāvilo sabbākārasampanno. Tatrāssa suttaṃ āvutaṃ nīlaṃ vā pītaṃ vā lohitaṃ vā odātaṃ vā paṇḍusuttaṃ vā. Tamenaṃ cakkhumā puriso hatthe karitvā paccavekkheyya – ‘ayaṃ kho maṇi veḷuriyo subho jātimā aṭṭhaṃso suparikammakato accho vippasanno anāvilo sabbākārasampanno. Tatridaṃ suttaṃ āvutaṃ nīlaṃ vā pītaṃ vā lohitaṃ vā odātaṃ vā paṇḍusuttaṃ vā’ti. Evameva kho, māṇava, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti. So evaṃ pajānāti – ‘ayaṃ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedana-viddhaṃsanadhammo. Idañca pana me viññāṇaṃ ettha sitaṃ ettha paṭibaddha’nti. Yampi, māṇava, bhikkhu evaṃ samāhite citte…pe… āneñjappatte ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti. So evaṃ pajānāti…pe… ettha paṭibaddhanti. Idampissa hoti paññāya.",
      "english": "“But what, Venerable Ananda, is that noble wisdom-factor of which the Venerable Gotama spoke highly, and in which he encouraged, established, and grounded this populace?”\n\nWhen his mind is thus concentrated, purified, cleansed, without blemish, rid of defilements, supple, workable, steady, and attained to imperturbability, he directs and inclines his mind to knowledge and vision. He thus understands: ‘This body of mine is material, composed of the four great primary elements, born of mother and father, sustained by rice and porridge, subject to impermanence, to rubbing, massaging, breaking up, and disintegration; and this consciousness of mine is bound up with it, dependent on it.’\n\nJust as, young man, a beryl gem, beautiful, of excellent water, eight-faceted, well-cut, clear, pure, untroubled, and endowed with all excellent qualities. Therein a thread might be strung, blue or yellow or red or white or tawny. A keen-sighted man, taking it in his hand, would examine it, saying: ‘Indeed, this is a beryl gem, beautiful, of excellent water, eight-faceted, well-cut, clear, pure, untroubled, and endowed with all excellent qualities. And herein is strung this thread, blue or yellow or red or white or tawny.’\n\nEven so, young man, a bhikkhu, when his mind is thus concentrated, purified, cleansed, without blemish, rid of defilements, supple, workable, steady, and attained to imperturbability, directs and inclines his mind to knowledge and vision. He thus understands: ‘This body of mine is material, composed of the four great primary elements, born of mother and father, sustained by rice and porridge, subject to impermanence, to rubbing, massaging, breaking up, and disintegration. And this consciousness of mine is bound up with it, dependent on it.’ That which, young man, a bhikkhu, when his mind is thus concentrated, purified, cleansed, without blemish, rid of defilements, supple, workable, steady, and attained to imperturbability, directs and inclines his mind to knowledge and vision, and he thus understands: ‘This body of mine is material, composed of the four great primary elements, born of mother and father, sustained by rice and porridge, subject to impermanence, to rubbing, massaging, breaking up, and disintegration. And this consciousness of mine is bound up with it, dependent on it’ – this too is part of his wisdom.",
      "sinhala": "ආනන්දයෙනි, භාග්‍යවතුන් වහන්සේ යම් ආර්ය ප්‍රඥාස්කන්ධයක් වර්ණනා කළ සේක් ද, යම් ප්‍රඥාස්කන්ධයක් තුළ මේ ජනතාව සමාදන් කරවූ සේක් ද, පිහිටවූ සේක් ද, ප්‍රතිෂ්ඨාපනය කළ සේක් ද, ඒ ආර්ය ප්‍රඥාස්කන්ධය කවරේද?\n\nඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, මැනවින් පිරිසිදු වූ, කිලිටි නැති, උපක්ලේශ පහ වූ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, කම්පා නොවන බවට පත් වූ සිතින්, ඥාන දර්ශනය පිණිස සිත යොමු කරයි, නමයි. ඔහු මෙසේ දනී: 'මාගේ මේ කය රූපී ය, සතර මහා භූතයන්ගෙන් යුක්ත ය, මවුපියන්ගෙන් හටගත් එකකි, බත් හා කැඳ ආහාර කොට ඇති එකකි, අනිත්‍ය වූ, අතුගා දැමීමට, පිරිමැදීමට, බිඳී යාමට, විනාශ වීමට ස්වභාව ධර්මයකි; මේ මාගේ විඤ්ඤාණය මේ කයෙහි පිහිටා ඇත, මේ කයෙහි බැඳී ඇත.'\n\nමානවක, යම් සේ විනිවිද පෙනෙන, උසස් ජාති වෛදූර්යය මැණිකක්, අටපට්ටම් වූ, මැනවින් ඔප දමා ඇති, පිරිසිදු වූ, පැහැදිලි වූ, කිසිදු අපවිත්‍රතාවයක් නැති, සියලු ආකාරයෙන් සම්පූර්ණ වේ ද. එහි නිල් හෝ කහ හෝ රතු හෝ සුදු හෝ ළා රතු පැහැති නූලක් අමුණා තිබේ ද. ඒ මැණික ඇස් ඇති පුරුෂයෙක් අතට ගෙන මෙසේ විමසා බලන්නේ ය: 'මේ වෛදූර්යය මැණික විනිවිද පෙනෙන, උසස් ජාති, අටපට්ටම් වූ, මැනවින් ඔප දමා ඇති, පිරිසිදු වූ, පැහැදිලි වූ, කිසිදු අපවිත්‍රතාවයක් නැති, සියලු ආකාරයෙන් සම්පූර්ණ එකකි. එහි මේ නිල් හෝ කහ හෝ රතු හෝ සුදු හෝ ළා රතු පැහැති නූලක් අමුණා තිබේ.'\n\nඑලෙසින් ම, මානවක, භික්ෂුවක් මෙසේ සමාධිගත වූ, පිරිසිදු වූ, මැනවින් පිරිසිදු වූ, කිලිටි නැති, උපක්ලේශ පහ වූ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, කම්පා නොවන බවට පත් වූ සිතින්, ඥාන දර්ශනය පිණිස සිත යොමු කරයි, නමයි. ඔහු මෙසේ දනී: 'මාගේ මේ කය රූපී ය, සතර මහා භූතයන්ගෙන් යුක්ත ය, මවුපියන්ගෙන් හටගත් එකකි, බත් හා කැඳ ආහාර කොට ඇති එකකි, අනිත්‍ය වූ, අතුගා දැමීමට, පිරිමැදීමට, බිඳී යාමට, විනාශ වීමට ස්වභාව ධර්මයකි. මේ මාගේ විඤ්ඤාණය මේ කයෙහි පිහිටා ඇත, මේ කයෙහි බැඳී ඇත.' මානවක, යම් දේශනාවක භික්ෂුව මෙසේ සමාධිගත වූ සිතින්... (ඉතිරි කොටස පෙර පරිදිම)... කම්පා නොවන බවට පත් වූ සිතින්, ඥාන දර්ශනය පිණිස සිත යොමු කරයි, නමයි. ඔහු මෙසේ දනී... (ඉතිරි කොටස පෙර පරිදිම)... මෙහි බැඳී ඇත යනුවෙන්. මෙය ද ඔහුගේ ප්‍රඥාවට අයත් වේ.",
      "paliTitle": "Paññākkhandho",
      "englishTitle": "The Wisdom Aggregate",
      "sinhalaTitle": "ප්‍රඥා කාණ්ඩය"
    },
    {
      "number": 473,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṃ kāyaṃ abhinimmānāya cittaṃ abhinīharati abhininnāmeti. So imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. ‘‘Seyyathāpi, māṇava, puriso muñjamhā īsikaṃ pavāheyya. Tassa evamassa – ‘ayaṃ muñjo ayaṃ īsikā; añño muñjo aññā īsikā; muñjamhā tveva īsikā pavāḷhā’ti. Seyyathā vā pana, māṇava, puriso asiṃ kosiyā pavāheyya. Tassa evamassa – ‘ayaṃ asi, ayaṃ kosi; añño asi, aññā kosi; kosiyā tveva asi pavāḷho’ti. Seyyathā vā pana, māṇava, puriso ahiṃ karaṇḍā uddhareyya. Tassa evamassa – ‘ayaṃ ahi, ayaṃ karaṇḍo; añño ahi, añño karaṇḍo; karaṇḍā tveva ahi ubbhato’ti. Evameva kho, māṇava, bhikkhu… pe… yampi, māṇava, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṃ kāyaṃ abhinimmānāya cittaṃ abhinīharati abhininnāmeti…pe…. Idampissa hoti paññāya.",
      "english": "He, with his mind thus concentrated, purified, bright, unsullied, rid of defilements, pliable, workable, steady, and attained to imperturbability, directs and inclines his mind to create a mind-made body. From this body, he creates another body, material, mind-made, complete with all its limbs and parts, with unimpaired faculties.\n\nJust as, young man, a man might pull a reed from its sheath. He would think thus: ‘This is the sheath, this is the reed. The sheath is one thing, the reed is another. Yet the reed was drawn out from the sheath.’ Or again, young man, a man might draw a sword from its scabbard. He would think thus: ‘This is the sword, this is the scabbard. The sword is one thing, the scabbard is another. Yet the sword was drawn out from the scabbard.’ Or again, young man, a man might pull a snake from its basket. He would think thus: ‘This is the snake, this is the basket. The snake is one thing, the basket is another. Yet the snake was pulled out from the basket.’\n\nIn the same way, young man, a bhikkhu, with his mind thus concentrated, purified, bright, unsullied, rid of defilements, pliable, workable, steady, and attained to imperturbability, directs and inclines his mind to create a mind-made body. He creates from this body another body, material, mind-made, complete with all its limbs and parts, with unimpaired faculties. This too is a manifestation of his wisdom.",
      "sinhala": "ඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, ඉතා පැහැදිලි වූ, කෙලෙස් රහිත වූ, උපක්ලේශ පහ වූ, මෘදු වූ, කර්මණ්‍ය වූ, ස්ථිර වූ, කම්පා නොවන භාවයට පැමිණි සිතින් මනෝමය කයක් මවා ගැනීමට සිත යොමු කරයි, නමයි. ඔහු මේ ශරීරයෙන් රූපවත් වූ, මනෝමය වූ, සියලු අඟපසඟින් යුක්ත වූ, අංගවිකල නොවන ඉන්ද්‍රියයන්ගෙන් යුක්ත වූ වෙනත් කයක් මවයි.\n\n‘‘මානවක, යම් සේ පුරුෂයෙක් මුං තණ ගසකින් ඊසිකාවක් ඇද ගන්නේ ද, ඔහුට මෙසේ සිතේ: ‘මේ මුං තණ ගසයි, මේ ඊසිකාවයි. මුං තණ ගස වෙනත් දෙයකි, ඊසිකාව වෙනත් දෙයකි. එහෙත් මුං තණ ගසින්ම ඊසිකාව ඇද ගන්නා ලද්දේය’ කියා.\n\nමානවක, නැතහොත් යම් සේ පුරුෂයෙක් කොපුවෙන් කඩුවක් ඇද ගන්නේ ද, ඔහුට මෙසේ සිතේ: ‘මේ කඩුවයි, මේ කොපුවයි. කඩුව වෙනත් දෙයකි, කොපුව වෙනත් දෙයකි. එහෙත් කොපුවෙන්ම කඩුව ඇද ගන්නා ලද්දේය’ කියා.\n\nමානවක, නැතහොත් යම් සේ පුරුෂයෙක් කරඬුවකින් සර්පයෙක් පිටතට ගන්නේ ද, ඔහුට මෙසේ සිතේ: ‘මේ සර්පයායි, මේ කරඬුවයි. සර්පයා වෙනත් දෙයකි, කරඬුව වෙනත් දෙයකි. එහෙත් කරඬුවෙන්ම සර්පයා පිටතට ගන්නා ලද්දේය’ කියා.\n\nඑලෙසින්ම මානවක, භික්ෂුව මෙසේ සමාධිගත වූ, පිරිසිදු වූ, ඉතා පැහැදිලි වූ, කෙලෙස් රහිත වූ, උපක්ලේශ පහ වූ, මෘදු වූ, කර්මණ්‍ය වූ, ස්ථිර වූ, කම්පා නොවන භාවයට පැමිණි සිතින් මනෝමය කයක් මවා ගැනීමට සිත යොමු කරයි, නමයි. ඔහු මේ ශරීරයෙන් රූපවත් වූ, මනෝමය වූ, සියලු අඟපසඟින් යුක්ත වූ, අංගවිකල නොවන ඉන්ද්‍රියයන්ගෙන් යුක්ත වූ වෙනත් කයක් මවයි. මේ ද ඔහුගේ ප්‍ර‌ඥාවට අයත් වූවකි.",
      "paliTitle": ""
    },
    {
      "number": 474,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ iddhividhaṃ paccanubhoti. Ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti. Āvibhāvaṃ tirobhāvaṃ tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāse. Pathaviyāpi ummujjanimujjaṃ karoti, seyyathāpi udake. Udakepi abhijjamāne gacchati seyyathāpi pathaviyaṃ. Ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo. Imepi candimasūriye evaṃ mahiddhike evaṃ mahānubhāve pāṇinā parāmasati parimajjati. Yāva brahmalokāpi kāyena vasaṃ vatteti. ‘‘Seyyathāpi, māṇava, dakkho kumbhakāro vā kumbhakārantevāsī vā suparikammakatāya mattikāya yaññadeva bhājanavikatiṃ ākaṅkheyya, taṃ tadeva kareyya abhinipphādeyya. Seyyathā vā pana, māṇava, dakkho dantakāro vā dantakārantevāsī vā suparikammakatasmiṃ dantasmiṃ yaññadeva dantavikatiṃ ākaṅkheyya, taṃ tadeva kareyya abhinipphādeyya. Seyyathā vā pana, māṇava, dakkho suvaṇṇakāro vā suvaṇṇakārantevāsī vā suparikammakatasmiṃ suvaṇṇasmiṃ yaññadeva suvaṇṇavikatiṃ ākaṅkheyya, taṃ tadeva kareyya abhinipphādeyya. Evameva kho, māṇava, bhikkhu …pe… yampi māṇava bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ iddhividhaṃ paccanubhoti. Ekopi hutvā bahudhā hoti …pe… yāva brahmalokāpi kāyena vasaṃ vatteti. Idampissa hoti paññāya.",
      "english": "His mind, thus concentrated, pure, bright, unblemished, rid of defilements, pliable, workable, firm, and imperturbable, he directs and inclines his mind to the development of supernormal powers. He experiences various kinds of supernormal powers: being one, he becomes many; having become many, he becomes one. He appears and vanishes. He goes unhindered through walls, through ramparts, through mountains, as if through space. He dives in and out of the earth as if it were water. He walks on water without sinking as if it were earth. He travels through the air, sitting cross-legged, like a winged bird. Even these moon and sun, so mighty, so powerful, he touches and strokes with his hand. He wields power with his body even as far as the Brahma world.\n\nJust as, young man, a skilled potter or a potter’s apprentice would fashion and produce any type of pottery he wishes from well-prepared clay; or just as, young man, a skilled ivory carver or an ivory carver’s apprentice would fashion and produce any type of ivory object he wishes from well-prepared ivory; or just as, young man, a skilled goldsmith or a goldsmith’s apprentice would fashion and produce any type of gold object he wishes from well-prepared gold—in the same way, young man, a monk, when his mind is thus concentrated, pure, bright, unblemished, rid of defilements, pliable, workable, firm, and imperturbable, he directs and inclines his mind to the development of supernormal powers. He experiences various kinds of supernormal powers: being one, he becomes many; having become many, he becomes one. He appears and vanishes. He goes unhindered through walls, through ramparts, through mountains, as if through space. He dives in and out of the earth as if it were water. He walks on water without sinking as if it were earth. He travels through the air, sitting cross-legged, like a winged bird. Even these moon and sun, so mighty, so powerful, he touches and strokes with his hand. He wields power with his body even as far as the Brahma world. This, too, is part of his wisdom.",
      "sinhala": "ඔහු මෙසේ සමාහිත වූ, පිරිසිදු වූ, පැහැපත් වූ, කෙලෙස් රහිත වූ, උපක්ලේශ පහ වූ, මෘදු වූ, කර්‍මණ්‍ය වූ, ස්ථිර වූ, අකම්ප්‍ය බවට පත් වූ සිත ඍද්ධි විධ පිණිස යොමු කරයි, නැඹුරු කරයි. ඔහු නොයෙක් ප්‍රකාර ඍද්ධි ප්‍රාතිහාර්යයන් අනුභව කරයි. එකෙක්ව සිට බොහෝ වෙයි, බොහෝව සිට එකෙක් වෙයි. ප්‍රකට වීම, නොපෙනී යාම, පවුරු හරහා, ප්‍රාකාර හරහා, පර්වත හරහා කිසිදු බාධාවකින් තොරව අහසේ මෙන් ගමන් කරයි. පොළොවේ ද දියෙහි මෙන් මතු වීම හා කිමිදීම කරයි. දියෙහි ද පොළොවේ මෙන් නොබෙදී ගමන් කරයි. අහසේ ද පක්ෂියෙකු මෙන් පලක් බැඳ පියාසර කරයි. මෙතරම් මහත් ඍද්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති මේ හිරු සඳු පවා අතින් ස්පර්ශ කරයි, පිරිමදියි. බඹලොව දක්වාත් කයින් වසඟයෙහි පවත්වයි.\n\nමානවක, යම් සේ දක්ෂ කුඹල්කරුවෙක් හෝ ඔහුගේ ශිල්පියෙක් හෝ මැනවින් සකස් කරන ලද මැටියෙන් යම් යම් භාජන විශේෂයක් කැමති වේද, එය ම කරන්නේය, නිපදවන්නේය. එසේ ම මානවක, දක්ෂ දන්ත කර්‍මකරුවෙක් හෝ ඔහුගේ ශිල්පියෙක් හෝ මැනවින් සකස් කරන ලද දළයෙහි යම් යම් දළ කර්‍ම විශේෂයක් කැමති වේද, එය ම කරන්නේය, නිපදවන්නේය. එසේ ම මානවක, දක්ෂ රන්කරුවෙක් හෝ ඔහුගේ ශිල්පියෙක් හෝ මැනවින් සකස් කරන ලද රන්වන් වූ යම් යම් රන් කර්‍ම විශේෂයක් කැමති වේද, එය ම කරන්නේය, නිපදවන්නේය. මානවක, එලෙසින්ම මහණ තෙම මෙසේ සමාහිත වූ, පිරිසිදු වූ, පැහැපත් වූ, කෙලෙස් රහිත වූ, උපක්ලේශ පහ වූ, මෘදු වූ, කර්‍මණ්‍ය වූ, ස්ථිර වූ, අකම්ප්‍ය බවට පත් වූ සිත ඍද්ධි විධ පිණිස යොමු කරයි, නැඹුරු කරයි. ඔහු නොයෙක් ප්‍රකාර ඍද්ධි ප්‍රාතිහාර්යයන් අනුභව කරයි. එකෙක්ව සිට බොහෝ වෙයි, බොහෝව සිට එකෙක් වෙයි. ප්‍රකට වීම, නොපෙනී යාම, පවුරු හරහා, ප්‍රාකාර හරහා, පර්වත හරහා කිසිදු බාධාවකින් තොරව අහසේ මෙන් ගමන් කරයි. පොළොවේ ද දියෙහි මෙන් මතු වීම හා කිමිදීම කරයි. දියෙහි ද පොළොවේ මෙන් නොබෙදී ගමන් කරයි. අහසේ ද පක්ෂියෙකු මෙන් පලක් බැඳ පියාසර කරයි. මෙතරම් මහත් ඍද්ධි ඇති, මෙතරම් මහත් ආනුභාව ඇති මේ හිරු සඳු පවා අතින් ස්පර්ශ කරයි, පිරිමදියි. බඹලොව දක්වාත් කයින් වසඟයෙහි පවත්වයි. මේ ද ඔහුගේ ප්‍රඥාවට අයත් වේ.",
      "paliTitle": ""
    },
    {
      "number": 475,
      "pali": "‘‘So evaṃ samāhite citte…pe… āneñjappatte dibbāya sotadhātuyā cittaṃ abhinīharati abhininnāmeti. So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. Seyyathāpi, māṇava, puriso addhānamaggappaṭipanno. So suṇeyya bherisaddampi mudiṅgasaddampi saṅkhapaṇavadindimasaddampi. Tassa evamassa – ‘bherisaddo itipi mudiṅgasaddo itipi saṅkhapaṇavadindimasaddo iti’pi [itipīti (ka.)]. Evameva kho, māṇava, bhikkhu… pe…. Yampi māṇava, bhikkhu evaṃ samāhite citte…pe… āneñjappatte dibbāya sotadhātuyā cittaṃ abhinīharati abhininnāmeti. So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. Idampissa hoti paññāya.",
      "english": "With his mind thus concentrated, having attained imperturbability, he directs and inclines his mind to the divine ear element. With the purified divine ear element, surpassing that of humans, he hears both divine and human sounds, whether far or near.\n\nJust as, young man, a man traveling on a road might hear the sound of a war-drum, the sound of a tabor, and the sound of a conch, drum, and kettle-drum. To him it would occur: 'This is the sound of a war-drum, this is the sound of a tabor, and this is the sound of a conch, drum, and kettle-drum.'\n\nIn the same way, young man, when a monk, with his mind thus concentrated, having attained imperturbability, directs and inclines his mind to the divine ear element, he, with the purified divine ear element, surpassing that of humans, hears both divine and human sounds, whether far or near. This too is a part of his wisdom.",
      "sinhala": "ඔහුගේ සිත මෙසේ සමාධිගත වූ කල්හි, නිශ්චලභාවයට පත් වූ කල්හි, ඔහු දිව්‍ය වූ ශ්‍රෝතෘධාතුවට සිත යොමු කොට නමාලයි. ඔහු ඒ පිරිසිදු වූ, මනුෂ්‍ය ශ්‍රවණය ඉක්මවූ දිව්‍ය වූ ශ්‍රෝතෘධාතුවෙන් ඈත හෝ ළඟ ඇති දිව්‍ය හා මනුෂ්‍ය යන දෙවර්ගයේම ශබ්ද අසයි. මාණවකයාණෙනි, යම් සේ මහා මාර්ගයක ගමන් කරන්නෙකු බෙර ශබ්දයද, මුද්‍රංග ශබ්දයද, සක්, පණව, ඩිණ්ඩම යන ශබ්දද අසන්නේද, ඔහුට මෙසේ සිතේ: ‘මෙය බෙර ශබ්දයක්ය, මෙය මුද්‍රංග ශබ්දයක්ය, මෙය සක්, පණව, ඩිණ්ඩම ශබ්දයක්ය’ යනුවෙන්. එලෙසින්ම, මාණවකයාණෙනි, යම් භික්ෂුවක් ඔහුගේ සිත මෙසේ සමාධිගත වූ කල්හි, නිශ්චලභාවයට පත් වූ කල්හි, දිව්‍ය වූ ශ්‍රෝතෘධාතුවට සිත යොමු කොට නමාලයි. ඔහු ඒ පිරිසිදු වූ, මනුෂ්‍ය ශ්‍රවණය ඉක්මවූ දිව්‍ය වූ ශ්‍රෝතෘධාතුවෙන් ඈත හෝ ළඟ ඇති දිව්‍ය හා මනුෂ්‍ය යන දෙවර්ගයේම ශබ්ද අසයි. මේද ඔහුගේ ප්‍රඥාවට අයත් දෙයක් වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 476,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṃ abhinīharati abhininnāmeti. So parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti, ‘sarāgaṃ vā cittaṃ sarāgaṃ citta’nti pajānāti, ‘vītarāgaṃ vā cittaṃ vītarāgaṃ citta’nti pajānāti, ‘sadosaṃ vā cittaṃ sadosaṃ citta’nti pajānāti, ‘vītadosaṃ vā cittaṃ vītadosaṃ citta’nti pajānāti, ‘samohaṃ vā cittaṃ samohaṃ citta’nti pajānāti, ‘vītamohaṃ vā cittaṃ vītamohaṃ citta’nti pajānāti, ‘saṅkhittaṃ vā cittaṃ saṅkhittaṃ citta’nti pajānāti, ‘vikkhittaṃ vā cittaṃ vikkhittaṃ citta’nti pajānāti, ‘mahaggataṃ vā cittaṃ mahaggataṃ citta’nti pajānāti, ‘amahaggataṃ vā cittaṃ amahaggataṃ citta’nti pajānāti, ‘sauttaraṃ vā cittaṃ sauttaraṃ citta’nti pajānāti, ‘anuttaraṃ vā cittaṃ anuttaraṃ citta’nti pajānāti, ‘samāhitaṃ vā cittaṃ samāhitaṃ citta’nti pajānāti, ‘asamāhitaṃ vā cittaṃ asamāhitaṃ citta’nti pajānāti, ‘vimuttaṃ vā cittaṃ vimuttaṃ citta’nti pajānāti, ‘avimuttaṃ vā cittaṃ avimuttaṃ citta’nti pajānāti. ‘‘Seyyathāpi, māṇava, itthī vā puriso vā daharo yuvā maṇḍanajātiko ādāse vā parisuddhe pariyodāte acche vā udakapatte sakaṃ mukhanimittaṃ paccavekkhamāno sakaṇikaṃ vā sakaṇikanti jāneyya, akaṇikaṃ vā akaṇikanti jāneyya. Evameva kho, māṇava, bhikkhu…pe… yampi, māṇava, bhikkhu evaṃ samāhite…pe… āneñjappatte cetopariyañāṇāya cittaṃ abhinīharati abhininnāmeti. So parasattānaṃ purapuggalānaṃ cetasā ceto paricca pajānāti, sarāgaṃ vā cittaṃ sarāgaṃ cittanti pajānāti…pe… avimuttaṃ vā cittaṃ avimuttaṃ cittanti pajānāti. Idampissa hoti paññāya.",
      "english": "He, with his mind thus concentrated, purified, cleansed, without blemish, free from defilements, pliable, workable, steady, and imperturbable, directs and inclines his mind to the knowledge of penetrating the minds of others. He discerns with his own mind the minds of other beings and persons:\nHe understands a mind with lust as 'a mind with lust'; a mind without lust as 'a mind without lust'.\nHe understands a mind with hate as 'a mind with hate'; a mind without hate as 'a mind without hate'.\nHe understands a mind with delusion as 'a mind with delusion'; a mind without delusion as 'a mind without delusion'.\nHe understands a constricted mind as 'a constricted mind'; a scattered mind as 'a scattered mind'.\nHe understands a developed mind as 'a developed mind'; an undeveloped mind as 'an undeveloped mind'.\nHe understands a surpassable mind as 'a surpassable mind'; an unsurpassed mind as 'an unsurpassed mind'.\nHe understands a concentrated mind as 'a concentrated mind'; an unconcentrated mind as 'an unconcentrated mind'.\nHe understands a liberated mind as 'a liberated mind'; an unliberated mind as 'an unliberated mind'.\n\nJust as, young man, a woman or a man, young, youthful, and fond of adornment, examining their own facial reflection in a clean, pure mirror or in a clear bowl of water, would know if it has a blemish as 'it has a blemish', or if it is without a blemish as 'it is without a blemish'. Even so, young man, a bhikkhu, with his mind thus concentrated, purified, cleansed, without blemish, free from defilements, pliable, workable, steady, and imperturbable, directs and inclines his mind to the knowledge of penetrating the minds of others. He discerns with his own mind the minds of other beings and persons:\nHe understands a mind with lust as 'a mind with lust'; a mind without lust as 'a mind without lust'.\nHe understands a mind with hate as 'a mind with hate'; a mind without hate as 'a mind without hate'.\nHe understands a mind with delusion as 'a mind with delusion'; a mind without delusion as 'a mind without delusion'.\nHe understands a constricted mind as 'a constricted mind'; a scattered mind as 'a scattered mind'.\nHe understands a developed mind as 'a developed mind'; an undeveloped mind as 'an undeveloped mind'.\nHe understands a surpassable mind as 'a surpassable mind'; an unsurpassed mind as 'an unsurpassed mind'.\nHe understands a concentrated mind as 'a concentrated mind'; an unconcentrated mind as 'an unconcentrated mind'.\nHe understands a liberated mind as 'a liberated mind'; an unliberated mind as 'an unliberated mind'.\nThis too is a part of his wisdom.",
      "sinhala": "ඒ භික්ෂුව මෙසේ සමාධිගත වූ, පිරිසුදු වූ, ඉතා දීප්තිමත් වූ, කෙලෙස් රහිත වූ, උපක්ලේශ දුරු වූ, මෘදු වූ, කර්‍මණ්‍ය වූ, ස්ථිර වූ, නොසැලෙන බවට පැමිණි සිතින් අනුන්ගේ සිත් දැනගැනීමේ ඥානය සඳහා සිත යොමු කරයි, නැඹුරු කරයි. ඔහු අනුන්ගේ සත්වයන්ගේ, අනුන්ගේ පුද්ගලයන්ගේ සිත් තම සිතින් පිරිසිඳ (විමසා) දැනගනී. රාග සහිත සිතක් නම්, රාග සහිත සිතක් යැයි දැනගනී. රාග රහිත සිතක් නම්, රාග රහිත සිතක් යැයි දැනගනී. ද්වේෂ සහිත සිතක් නම්, ද්වේෂ සහිත සිතක් යැයි දැනගනී. ද්වේෂ රහිත සිතක් නම්, ද්වේෂ රහිත සිතක් යැයි දැනගනී. මෝහ සහිත සිතක් නම්, මෝහ සහිත සිතක් යැයි දැනගනී. මෝහ රහිත සිතක් නම්, මෝහ රහිත සිතක් යැයි දැනගනී. සංක්ෂිප්ත (කුඩා) සිතක් නම්, සංක්ෂිප්ත සිතක් යැයි දැනගනී. වික්ෂිප්ත (විසිරුණු) සිතක් නම්, වික්ෂිප්ත සිතක් යැයි දැනගනී. මහද්ගත සිතක් නම්, මහද්ගත සිතක් යැයි දැනගනී. මහද්ගත නො වූ සිතක් නම්, මහද්ගත නො වූ සිතක් යැයි දැනගනී. තවදුරටත් දියුණු විය හැකි සිතක් නම්, තවදුරටත් දියුණු විය හැකි සිතක් යැයි දැනගනී. තවදුරටත් දියුණු විය නොහැකි සිතක් නම්, තවදුරටත් දියුණු විය නොහැකි සිතක් යැයි දැනගනී. සමාධිගත සිතක් නම්, සමාධිගත සිතක් යැයි දැනගනී. සමාධිගත නො වූ සිතක් නම්, සමාධිගත නො වූ සිතක් යැයි දැනගනී. විමුක්ත සිතක් නම්, විමුක්ත සිතක් යැයි දැනගනී. අවිමුක්ත සිතක් නම්, අවිමුක්ත සිතක් යැයි දැනගනී.\n\nමහණ, යම් සේ ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ තරුණ වියේ සිටින, සැරසීමට කැමති ස්වභාවයක් ඇති කෙනෙක්, පිරිසිදු වූ, ඉතා දීප්තිමත් වූ කණ්ණාඩියක හෝ පැහැදිලි වූ ජල භාජනයක තමාගේ මුහුණේ ස්වරූපය නිරීක්ෂණය කරමින්, කැලැල් සහිත නම් කැලැල් සහිත යැයි ද, කැලැල් රහිත නම් කැලැල් රහිත යැයි ද දැනගන්නවා සේ, එලෙසින් ම මහණ, භික්ෂුව මෙසේ සමාධිගත වූ, පිරිසුදු වූ, ඉතා දීප්තිමත් වූ, කෙලෙස් රහිත වූ, උපක්ලේශ දුරු වූ, මෘදු වූ, කර්‍මණ්‍ය වූ, ස්ථිර වූ, නොසැලෙන බවට පැමිණි සිතින් අනුන්ගේ සිත් දැනගැනීමේ ඥානය සඳහා සිත යොමු කරයි, නැඹුරු කරයි. ඔහු අනුන්ගේ සත්වයන්ගේ, අනුන්ගේ පුද්ගලයන්ගේ සිත් තම සිතින් පිරිසිඳ දැනගනී. රාග සහිත සිතක් නම්, රාග සහිත සිතක් යැයි දැනගනී. රාග රහිත සිතක් නම්, රාග රහිත සිතක් යැයි දැනගනී. ද්වේෂ සහිත සිතක් නම්, ද්වේෂ සහිත සිතක් යැයි දැනගනී. ද්වේෂ රහිත සිතක් නම්, ද්වේෂ රහිත සිතක් යැයි දැනගනී. මෝහ සහිත සිතක් නම්, මෝහ සහිත සිතක් යැයි දැනගනී. මෝහ රහිත සිතක් නම්, මෝහ රහිත සිතක් යැයි දැනගනී. සංක්ෂිප්ත (කුඩා) සිතක් නම්, සංක්ෂිප්ත සිතක් යැයි දැනගනී. වික්ෂිප්ත (විසිරුණු) සිතක් නම්, වික්ෂිප්ත සිතක් යැයි දැනගනී. මහද්ගත සිතක් නම්, මහද්ගත සිතක් යැයි දැනගනී. මහද්ගත නො වූ සිතක් නම්, මහද්ගත නො වූ සිතක් යැයි දැනගනී. තවදුරටත් දියුණු විය හැකි සිතක් නම්, තවදුරටත් දියුණු විය හැකි සිතක් යැයි දැනගනී. තවදුරටත් දියුණු විය නොහැකි සිතක් නම්, තවදුරටත් දියුණු විය නොහැකි සිතක් යැයි දැනගනී. සමාධිගත සිතක් නම්, සමාධිගත සිතක් යැයි දැනගනී. සමාධිගත නො වූ සිතක් නම්, සමාධිගත නො වූ සිතක් යැයි දැනගනී. විමුක්ත සිතක් නම්, විමුක්ත සිතක් යැයි දැනගනී. අවිමුක්ත සිතක් නම්, අවිමුක්ත සිතක් යැයි දැනගනී. මෙය ඔහුගේ ප්‍රඥාවෙන් සිදු වේ.",
      "paliTitle": ""
    },
    {
      "number": 477,
      "pali": "‘‘So evaṃ samāhite citte…pe… āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ, ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto. So tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto; so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. ‘‘Seyyathāpi, māṇava, puriso sakamhā gāmā aññaṃ gāmaṃ gaccheyya; tamhāpi gāmā aññaṃ gāmaṃ gaccheyya; so tamhā gāmā sakaṃyeva gāmaṃ paccāgaccheyya. Tassa evamassa – ‘ahaṃ kho sakamhā gāmā amuṃ gāmaṃ agacchiṃ, tatra evaṃ aṭṭhāsiṃ evaṃ nisīdiṃ evaṃ abhāsiṃ evaṃ tuṇhī ahosiṃ. So tamhāpi gāmā amuṃ gāmaṃ gacchiṃ, tatrāpi evaṃ aṭṭhāsiṃ evaṃ nisīdiṃ evaṃ abhāsiṃ evaṃ tuṇhī ahosiṃ. Somhi tamhā gāmā sakaṃyeva gāmaṃ paccāgato’ti. Evameva kho, māṇava, bhikkhu…pe… yampi, māṇava, bhikkhu evaṃ samāhite citte…pe… āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ pubbenivāsaṃ anussarati. Seyyathidaṃ – ekampi jātiṃ…pe… iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Idampissa hoti paññāya.",
      "english": "With his mind thus concentrated, purified, brilliant, unblemished, rid of defilement, pliable, workable, steady, and having reached imperturbability, he directs and inclines his mind to the knowledge of recollecting past lives. He recollects his manifold past lives. That is to say: one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births; he recollects many eons of world-contraction, many eons of world-expansion, many eons of world-contraction and expansion. He thinks: ‘There I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such happiness and suffering, with such a lifespan. Having passed away from there, I arose yonder; there I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such happiness and suffering, with such a lifespan. Having passed away from there, I have arisen here.’ Thus he recollects his manifold past lives, with all their characteristics and details.\n\nJust as, young man, a man might go from his own village to another village; and from that village to still another village; and then from that village he might return to his own village. He would think thus: ‘Indeed, I went from my own village to that village, and there I stood thus, sat thus, spoke thus, remained silent thus. And from that village, I went to that other village, and there too I stood thus, sat thus, spoke thus, remained silent thus. Now I have returned from that village to my own village.’ Even so, young man, when a bhikkhu, with his mind thus concentrated, purified, brilliant, unblemished, rid of defilement, pliable, workable, steady, and having reached imperturbability, directs and inclines his mind to the knowledge of recollecting past lives, he recollects his manifold past lives. That is to say: one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, one hundred births, one thousand births, one hundred thousand births; he recollects many eons of world-contraction, many eons of world-expansion, many eons of world-contraction and expansion. He thinks: ‘There I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such happiness and suffering, with such a lifespan. Having passed away from there, I arose yonder; there I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such happiness and suffering, with such a lifespan. Having passed away from there, I have arisen here.’ Thus he recollects his manifold past lives, with all their characteristics and details. This too is his wisdom.",
      "sinhala": "මෙසේ සමාධිගත වූ, පිරිසිදු වූ, පැහැපත් වූ, කිලිටි රහිත වූ, කෙලෙස් පහව ගිය, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ සිතින් ආනෙඤ්ජ්‍යයට (කම්පනයට පත් නොවන තත්ත්වයට) පැමිණි විට, ඔහු පෙර කරන ලද වාසය සිහි කිරීමේ ඥානය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. ඔහු නොයෙක් ආකාර වූ පෙර වාසය සිහි කරයි. එනම්, එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති හතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, නොයෙක් සංවට්ට කල්පයන් ද, නොයෙක් විවට්ට කල්පයන් ද, නොයෙක් සංවට්ට-විවට්ට කල්පයන් ද සිහි කරයි. ‘මම අසුවල් තැන සිටියෙමි, අසුවල් නම් ඇත්තෙක් වීමි, අසුවල් ගෝත්‍රයේ ඇත්තෙක් වීමි, අසුවල් වර්ණයේ ඇත්තෙක් වීමි, අසුවල් ආහාර ඇත්තෙක් වීමි, අසුවල් සැප-දුක් විඳින්නෙක් වීමි, අසුවල් ආයුෂ ප්‍රමාණය ඇත්තෙක් වීමි. මම එතැනින් චුත වී, අසුවල් තැන උපන්නෙමි; එහිදී ද අසුවල් නම් ඇත්තෙක් වීමි, අසුවල් ගෝත්‍රයේ ඇත්තෙක් වීමි, අසුවල් වර්ණයේ ඇත්තෙක් වීමි, අසුවල් ආහාර ඇත්තෙක් වීමි, අසුවල් සැප-දුක් විඳින්නෙක් වීමි, අසුවල් ආයුෂ ප්‍රමාණය ඇත්තෙක් වීමි; මම එතැනින් චුත වී මෙහි උපන්නෙමි’ යි. මෙසේ ආකාර සහිතව ද, උද්දේස සහිතව ද නොයෙක් ආකාර වූ පෙර වාසය සිහි කරයි.\n\nදරුව, යම්සේ පුරුෂයෙක් තමන්ගේ ගමෙන් වෙනත් ගමකට යන්නේ ද; ඒ ගමෙන් ද වෙනත් ගමකට යන්නේ ද; ඒ ගමෙන් තම ගමටම ආපසු එන්නේ ද. ඔහුට මෙසේ සිතුණේය: ‘මම මාගේ ගමෙන් අසුවල් ගමට ගියෙමි, එහිදී මෙසේ සිටියෙමි, මෙසේ හිඳගත්තෙමි, මෙසේ කථා කළෙමි, මෙසේ නිශ්ශබ්දව සිටියෙමි. මම ඒ ගමෙන් ද අසුවල් ගමට ගියෙමි, එහිදී ද මෙසේ සිටියෙමි, මෙසේ හිඳගත්තෙමි, මෙසේ කථා කළෙමි, මෙසේ නිශ්ශබ්දව සිටියෙමි. ඒ ගමෙන් මම තම ගමටම ආපසු පැමිණියෙමි’ යි. එසේම දරුව, මහණ තෙමේ ද, මෙසේ සමාධිගත වූ, පිරිසිදු වූ, පැහැපත් වූ, කිලිටි රහිත වූ, කෙලෙස් පහව ගිය, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ සිතින් ආනෙඤ්ජ්‍යයට (කම්පනයට පත් නොවන තත්ත්වයට) පැමිණ, පෙර කරන ලද වාසය සිහි කිරීමේ ඥානය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. ඔහු නොයෙක් ආකාර වූ පෙර වාසය සිහි කරයි. එනම් – එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති හතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, නොයෙක් සංවට්ට කල්පයන් ද, නොයෙක් විවට්ට කල්පයන් ද, නොයෙක් සංවට්ට-විවට්ට කල්පයන් ද සිහි කරයි. මෙසේ ආකාර සහිතව ද, උද්දේස සහිතව ද නොයෙක් ආකාර වූ පෙර වාසය සිහි කරයි. මෙය ද ඔහුට ප්‍රඥාව වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 478,
      "pali": "‘‘So evaṃ samāhite citte…pe… āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhinīharati abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti. ‘‘Seyyathāpi, māṇava, majjhesiṅghāṭake pāsādo, tattha cakkhumā puriso ṭhito passeyya manusse gehaṃ pavisantepi nikkhamantepi rathikāyapi vīthiṃ sañcarante majjhesiṅghāṭake nisinnepi. Tassa evamassa – ‘ete manussā gehaṃ pavisanti, ete nikkhamanti, ete rathikāya vīthiṃ sañcaranti, ete majjhesiṅghāṭake nisinnā’ti. Evameva kho, māṇava, bhikkhu…pe… yampi, māṇava, bhikkhu evaṃ samāhite citte…pe… āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhinīharati abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti. Idampissa hoti paññāya.",
      "english": "He, with his mind thus concentrated, purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, directs and inclines his mind to the knowledge of the passing away and re-arising of beings. With the divine eye, purified and surpassing that of humans, he sees beings passing away and re-arising, low and exalted, beautiful and ugly, in good destinations and bad destinations; he understands beings according to their karma. 'Indeed, these beings, sirs, are endowed with misconduct in body, misconduct in speech, and misconduct in mind; they are revilers of the noble ones, holding wrong views, and undertaking actions based on wrong views. After the break-up of the body, after death, they are reborn in states of deprivation, bad destinations, the lower realms, hell. Or again, these beings, sirs, are endowed with good conduct in body, good conduct in speech, and good conduct in mind; they are not revilers of the noble ones, holding right views, and undertaking actions based on right views. After the break-up of the body, after death, they are reborn in a good destination, a heavenly world.' Thus, with the divine eye, purified and surpassing that of humans, he sees beings passing away and re-arising, low and exalted, beautiful and ugly, in good destinations and bad destinations; he understands beings according to their karma.\n\n'Just as, young man, at a crossroads there might be a mansion, and a clear-sighted man standing there might see people entering houses and leaving houses, walking along streets and roads, and sitting at the crossroads. And it would occur to him: \"These people are entering houses, these are leaving, these are walking along streets and roads, these are sitting at the crossroads.\" Just so, young man, a monk, with his mind thus concentrated, purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, directs and inclines his mind to the knowledge of the passing away and re-arising of beings. With the divine eye, purified and surpassing that of humans, he sees beings passing away and re-arising, low and exalted, beautiful and ugly, in good destinations and bad destinations; he understands beings according to their karma. This, too, is his wisdom.",
      "sinhala": "ඔහු මෙසේ සමාහිත වූ, නොසැලෙන සිතින් සත්ත්වයන්ගේ චුති-උපපත්ති ඥානය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. ඔහු පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් සත්ත්වයන් චුත වනවාත්, උපදිනවාත්, හීන වූ අය, ප්‍රණීත වූ අය, හොඳ වර්ණ ඇති අය, දුර්වර්ණ ඇති අය, සුගතියට යන අය, දුගතියට යන අය දකියි. කර්මයට අනුව උපදින සත්ත්වයන් ඔහු හඳුනා ගනියි – ‘මෙම භවත් සත්ත්වයෝ කයෙහි දුසිරිතින් යුක්ත වූහ, වචනයෙහි දුසිරිතින් යුක්ත වූහ, මනසෙහි දුසිරිතින් යුක්ත වූහ, ආර්යයන්ට අපහාස කරන්නෝ වූහ, මිත්‍යා දෘෂ්ටිකයෝ වූහ, මිත්‍යා දෘෂ්ටියෙන් කර්මයන් සමාදන් වූහ. ඔවුහු කය බිඳී යාමෙන්, මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරයට පැමිණියාහුය. මෙම හෝ භවත් සත්ත්වයෝ කයෙහි සුසිරිතින් යුක්ත වූහ, වචනයෙහි සුසිරිතින් යුක්ත වූහ, මනසෙහි සුසිරිතින් යුක්ත වූහ, ආර්යයන්ට අපහාස නොකරන්නෝ වූහ, සම්මා දෘෂ්ටිකයෝ වූහ, සම්මා දෘෂ්ටියෙන් කර්මයන් සමාදන් වූහ. ඔවුහු කය බිඳී යාමෙන්, මරණයෙන් පසුව සුගති, ස්වර්ග ලෝකයට පැමිණියාහුය’යි. මෙසේ ඔහු පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් සත්ත්වයන් චුත වනවාත්, උපදිනවාත්, හීන වූ අය, ප්‍රණීත වූ අය, හොඳ වර්ණ ඇති අය, දුර්වර්ණ ඇති අය, සුගතියට යන අය, දුගතියට යන අය දකියි. කර්මයට අනුව උපදින සත්ත්වයන් ඔහු හඳුනා ගනියි.\n\nමානවක, යම් සේ සිව් මංසන්ධියක් මැද වූ ප්‍රාසාදයක් වේද, එහි සිටින ඇස් ඇති පුරුෂයෙක් ගෙට පිවිසෙන, නික්මෙන, පටු මාර්ගවලත්, වීථිවලත් හැසිරෙන, සිව් මංසන්ධිය මැද හිඳින මිනිසුන් දකියි. ඔහුට මෙසේ සිතේ: ‘මේ මිනිසුන් ගෙට පිවිසෙති, මේ මිනිසුන් නික්මෙති, මේ මිනිසුන් පටු මාර්ගවලත්, වීථිවලත් හැසිරෙති, මේ මිනිසුන් සිව් මංසන්ධිය මැද හිඳිති’ කියා. මානවක, එලෙසින්ම භික්ෂුව මෙසේ සමාහිත වූ, නොසැලෙන සිතින් සත්ත්වයන්ගේ චුති-උපපත්ති ඥානය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. ඔහු පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් සත්ත්වයන් චුත වනවාත්, උපදිනවාත්, හීන වූ අය, ප්‍රණීත වූ අය, හොඳ වර්ණ ඇති අය, දුර්වර්ණ ඇති අය, සුගතියට යන අය, දුගතියට යන අය දකියි. කර්මයට අනුව උපදින සත්ත්වයන් ඔහු හඳුනා ගනියි. මෙයද ඔහුගේ ප්‍රඥාවට අයත් දෙයකි.",
      "paliTitle": ""
    },
    {
      "number": 479,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhinīharati abhininnāmeti. So idaṃ dukkhanti yathābhūtaṃ pajānāti, ayaṃ dukkhasamudayoti yathābhūtaṃ pajānāti, ayaṃ dukkhanirodhoti yathābhūtaṃ pajānāti, ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti; ime āsavāti yathābhūtaṃ pajānāti, ayaṃ āsavasamudayoti yathābhūtaṃ pajānāti, ayaṃ āsavanirodhoti yathābhūtaṃ pajānāti, ayaṃ āsavanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati, vimuttasmiṃ vimuttamiti ñāṇaṃ hoti. ‘Khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. ‘‘Seyyathāpi, māṇava, pabbatasaṅkhepe udakarahado accho vippasanno anāvilo. Tattha cakkhumā puriso tīre ṭhito passeyya sippikasambukampi sakkharakathalampi macchagumbampi carantampi tiṭṭhantampi. Tassa evamassa – ‘ayaṃ kho udakarahado accho vippasanno anāvilo. Tatrime sippikasambukāpi sakkharakathalāpi macchagumbāpi carantipi tiṭṭhantipī’ti. Evameva kho, māṇava, bhikkhu…pe… yampi, māṇava, bhikkhu evaṃ samāhite citte…pe… āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhinīharati abhininnāmeti. So idaṃ dukkhanti yathābhūtaṃ pajānāti…pe… āsavanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati, vimuttasmiṃ vimuttamiti ñāṇaṃ hoti, ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Idampissa hoti paññāya.",
      "english": "He, with his mind thus concentrated, purified, cleansed, unblemished, free from defilements, pliable, workable, steady, and attained to imperturbability, directs and inclines his mind to the knowledge of the destruction of the taints. He understands, as it actually is, \"This is suffering.\" He understands, as it actually is, \"This is the origin of suffering.\" He understands, as it actually is, \"This is the cessation of suffering.\" He understands, as it actually is, \"This is the path leading to the cessation of suffering.\" He understands, as it actually is, \"These are the taints.\" He understands, as it actually is, \"This is the origin of the taints.\" He understands, as it actually is, \"This is the cessation of the taints.\" He understands, as it actually is, \"This is the path leading to the cessation of the taints.\" To him, thus knowing, thus seeing, his mind is liberated from the taint of sensual desire, his mind is liberated from the taint of existence, and his mind is liberated from the taint of ignorance. With liberation, there arises the knowledge: \"Liberated, it is liberated.\" He understands: \"Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.\"\n\nJust as, young man, in a mountain cleft there might be a pond of water, clear, limpid, and undisturbed. A man with keen sight standing on the bank might see the oysters and mussels, the gravel and pebbles, and the schools of fish, moving about and remaining still. He would think: \"This pond of water is clear, limpid, and undisturbed. And in it are these oysters and mussels, gravel and pebbles, and schools of fish, moving about and remaining still.\" Even so, young man, a monk, with his mind thus concentrated, purified, cleansed, unblemished, free from defilements, pliable, workable, steady, and attained to imperturbability, directs and inclines his mind to the knowledge of the destruction of the taints. He understands, as it actually is, \"This is suffering.\" He understands, as it actually is, \"This is the origin of suffering.\" He understands, as it actually is, \"This is the cessation of suffering.\" He understands, as it actually is, \"This is the path leading to the cessation of suffering.\" He understands, as it actually is, \"These are the taints.\" He understands, as it actually is, \"This is the origin of the taints.\" He understands, as it actually is, \"This is the cessation of the taints.\" He understands, as it actually is, \"This is the path leading to the cessation of the taints.\" To him, thus knowing, thus seeing, his mind is liberated from the taint of sensual desire, his mind is liberated from the taint of existence, and his mind is liberated from the taint of ignorance. With liberation, there arises the knowledge: \"Liberated, it is liberated.\" He understands: \"Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.\" This too is his wisdom.",
      "sinhala": "ඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, ඉතා පැහැදිලි වූ, කිලුටු නැති වූ, උපක්ලේශ පහවූ, මෘදු වූ, කර්මණ්‍ය වූ, පිහිටි, අකම්ප්‍ය භාවයට පත් වූ සිතින් ආසවයන්ගේ ක්‍ෂය වන ඥානය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. ඔහු ‘මෙය දුක යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය දුකෙහි හටගැනීම යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය දුකෙහි නිරෝධය යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය දුකෙහි නිරෝධයට පැමිණෙන ප්‍රතිපදාව යැ’යි යථාභූත වශයෙන් දනියි. ‘මේවා ආසවයෝ යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය ආසවයන්ගේ හටගැනීම යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය ආසවයන්ගේ නිරෝධය යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය ආසවයන්ගේ නිරෝධයට පැමිණෙන ප්‍රතිපදාව යැ’යි යථාභූත වශයෙන් දනියි. මෙසේ දන්නා, මෙසේ දක්නා ඔහුගේ සිත කාමාසවයෙන් ද මිදෙයි. භවාසවයෙන් ද සිත මිදෙයි. අවිද්‍යාසවයෙන් ද සිත මිදෙයි. මිදුනු කල්හි ‘මිදුනේය’ යන ඥානය පහළ වෙයි. ‘ජාතිය ක්‍ෂය විය. බඹසර වැස නිම කරන ලදී. කළ යුතු දේ කරන ලදී. මේ බව පිණිස අන් කිසිවක් නැතැ’යි දනියි.\n\nමානවක, යම් සේ පර්වත සමූහයක් මැද පිරිසිදු වූ, ඉතා ප්‍රසන්න වූ, කැළඹීමක් නැති ජල පොකුණක් වේ ද, එහි ඇස් ඇත්තෙක් ගොඩැල්ලේ සිට සිප්පි කටු ද, ගල් කැබලි වැලි ද, හැසිරෙන්නා වූ ද, සිටින්නා වූ ද මසුන් රංචු ද දකින්නේය. ඔහුට මෙසේ සිතෙන්නේය: ‘මේ ජල පොකුණ පිරිසිදුය, ඉතා ප්‍රසන්නය, කැළඹීමක් නැත. එහි මේ සිප්පි කටු ද, ගල් කැබලි වැලි ද, මසුන් රංචු ද හැසිරෙති, සිටිති.’ මානවක, එලෙසම භික්ෂුව මෙසේ සමාධිගත වූ, පිරිසිදු වූ, ඉතා පැහැදිලි වූ, කිලුටු නැති වූ, උපක්ලේශ පහවූ, මෘදු වූ, කර්මණ්‍ය වූ, පිහිටි, අකම්ප්‍ය භාවයට පත් වූ සිතින් ආසවයන්ගේ ක්‍ෂය වන ඥානය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. ඔහු ‘මෙය දුක යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය දුකෙහි හටගැනීම යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය දුකෙහි නිරෝධය යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය දුකෙහි නිරෝධයට පැමිණෙන ප්‍රතිපදාව යැ’යි යථාභූත වශයෙන් දනියි. ‘මේවා ආසවයෝ යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය ආසවයන්ගේ හටගැනීම යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය ආසවයන්ගේ නිරෝධය යැ’යි යථාභූත වශයෙන් දනියි. ‘මෙය ආසවයන්ගේ නිරෝධයට පැමිණෙන ප්‍රතිපදාව යැ’යි යථාභූත වශයෙන් දනියි. මෙසේ දන්නා, මෙසේ දක්නා ඔහුගේ සිත කාමාසවයෙන් ද මිදෙයි. භවාසවයෙන් ද සිත මිදෙයි. අවිද්‍යාසවයෙන් ද සිත මිදෙයි. මිදුනු කල්හි ‘මිදුනේය’ යන ඥානය පහළ වෙයි. ‘ජාතිය ක්‍ෂය විය. බඹසර වැස නිම කරන ලදී. කළ යුතු දේ කරන ලදී. මේ බව පිණිස අන් කිසිවක් නැතැ’යි දනියි. මෙය ද ඔහුගේ ප්‍රඥාව වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 480,
      "pali": "‘‘Ayaṃ kho, so māṇava, ariyo paññākkhandho yassa so bhagavā vaṇṇavādī ahosi, yattha ca imaṃ janataṃ samādapesi nivesesi patiṭṭhāpesi. Natthi cevettha uttarikaraṇīya’’nti. ‘‘Acchariyaṃ, bho ānanda, abbhutaṃ, bho ānanda! So cāyaṃ, bho ānanda, ariyo paññākkhandho paripuṇṇo, no aparipuṇṇo. Evaṃ paripuṇṇaṃ cāhaṃ, bho ānanda, ariyaṃ paññākkhandhaṃ ito bahiddhā aññesu samaṇabrāhmaṇesu na samanupassāmi. Natthi cevettha [na samanupassāmi…pe… natthi no kiñci (syā. ka.)] uttarikaraṇīyaṃ [uttariṃ karaṇīyanti (sī. syā. pī.) uttarikaraṇīyanti (ka.)]. Abhikkantaṃ, bho ānanda, abhikkantaṃ, bho ānanda! Seyyathāpi, bho ānanda, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti. Evamevaṃ bhotā ānandena anekapariyāyena dhammo pakāsito. Esāhaṃ, bho ānanda, taṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ ānando dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti. ",
      "english": "Indeed, young man, this is the noble aggregate of wisdom concerning which the Blessed One spoke in praise, and where he inspired, established, and settled this populace. And there is nothing further to be done here.\n\nWonderful, Venerable Ānanda, astounding, Venerable Ānanda! And this noble aggregate of wisdom, Venerable Ānanda, is complete, not incomplete. I do not see such a complete noble aggregate of wisdom anywhere outside this teaching among other ascetics and brahmins, Venerable Ānanda. And there is nothing further to be done here.\n\nExcellent, Venerable Ānanda, excellent, Venerable Ānanda! Just as, Venerable Ānanda, one might set upright what was overturned, reveal what was hidden, point out the way to one who was lost, or carry an oil lamp in the darkness so that those with eyes might see forms. In the very same way, the Dhamma has been made clear by Venerable Ānanda in many ways.\n\nI go for refuge to that Blessed Gotama, to the Dhamma, and to the Sangha of monks, Venerable Ānanda. May Venerable Ānanda remember me as a lay follower who has gone for refuge from this day forth as long as life lasts.",
      "sinhala": "මානවකයාණෙනි, භාග්‍යවතුන් වහන්සේ වර්ණනා කළාවූද, මේ ජනතාව සමාදන් කරවූවාවූද, පිහිටවූවාවූද, ස්ථාපිත කළාවූද මේ ආර්ය ප්‍රඥා ස්කන්ධයයි. මෙහි ඊට වැඩි යමක් කළ යුත්තක් නැත.\n\nආනන්දයෙනි, ආශ්චර්යයකි! ආනන්දයෙනි, අද්භූතයකි! ආනන්දයෙනි, මේ ආර්ය ප්‍රඥා ස්කන්ධය පිරී ඇත, අඩුවක් නැත. ආනන්දයෙනි, මෙසේ පිරුණු ආර්ය ප්‍රඥා ස්කන්ධයක් මීට පිටතින් අන්‍ය වූ ශ්‍රමණ බ්‍රාහ්මණයන් අතර මා නොදකිමි. මෙහි ඊට වැඩි යමක් කළ යුත්තක් නැත.\n\nආනන්දයෙනි, අතිශය උතුම්ය! ආනන්දයෙනි, අතිශය උතුම්ය! ආනන්දයෙනි, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මඟ මුළා වූවෙකුට මඟ පෙන්වන්නේද, ඇස් ඇත්තෝ රූප දකිනු ඇතැයි අඳුරේ තෙල් පහනක් දල්වන්නේද, එසේම ආනන්ද ස්ථවිරයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී.\n\nආනන්දයෙනි, මම භවත් ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා භවත් ආනන්දයෝ දරත්වා.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Subhasuttaṃ niṭṭhitaṃ dasamaṃ.",
    "english": "Tenth Subha Sutta Concluded.",
    "sinhala": "දසවන සුභ සූත්‍රය අවසන්."
  }
}