{
  "id": "dn.1.6",
  "title": {
    "pali": "Mahālisuttaṃ",
    "english": "Mahāli Sutta",
    "sinhala": "මහාලිසූත්‍රය"
  },
  "sections": [
    {
      "number": 359,
      "pali": "Evaṃ me sutaṃ – uekaṃ samayaṃ bhagavā vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Tena kho pana samayena sambahulā kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā vesāliyaṃ paṭivasanti kenacideva karaṇīyena. Assosuṃ kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā – ‘‘samaṇo khalu, bho, gotamo sakyaputto sakyakulā pabbajito vesāliyaṃ viharati mahāvane kūṭāgārasālāyaṃ. Taṃ kho pana bhavantaṃ gotamaṃ evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Sādhu kho pana tathārūpānaṃ arahataṃ dassanaṃ hotī’’ti.",
      "english": "Thus have I heard. On one occasion the Blessed One was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. Now at that time many Koḷas and Magadhan Brahmin envoys were staying in Vesālī for some reason or another. They heard that the recluse Gotama, a son of the Sakyans, who had gone forth from the Sakyan clan, was dwelling in Vesālī, in the Great Wood, at the Gabled Hall. And this excellent reputation had spread concerning the venerable Gotama: ‘Indeed, the Blessed One is an Arahant, a Perfectly Self-Enlightened One, endowed with knowledge and conduct, a Fortunate One, a Knower of the worlds, an unsurpassed leader of persons to be tamed, a Teacher of gods and humans, the Buddha, the Blessed One.’ He declares this world with its devas, Māras, and Brahmās, this generation with its recluses and brahmins, its devas and humans, having realized it for himself with direct knowledge. He teaches the Dhamma that is good in the beginning, good in the middle, and good in the end, with its meaning and its letter, proclaiming the entirely complete and purified holy life. It is good indeed to see such Arahants.",
      "sinhala": "මා හට මෙසේ අසන ලදී: එක් සමයෙක භාග්‍යවතුන් වහන්සේ විශාලා මහනුවර මහාවනයෙහි කූටාගාර ශාලාවෙහි වැඩවසන සේක.\n\nඑකල්හි බොහෝ කොසොල් බමුණු දූතයෝද, මගධ බමුණු දූතයෝද කිසියම් කරුණක් නිසා විශාලා මහනුවර වාසය කරමින් සිටියහ. එකල ඒ කොසොල් බමුණු දූතයෝද, මගධ බමුණු දූතයෝද මෙසේ අසා සිටියහ: “භවත්නි, ශාක්‍ය පුත්‍ර වූ, ශාක්‍ය කුලයෙන් පැවිදි වූ, ශ්‍රමණ ගෞතමයන් වහන්සේ විශාලා මහනුවර මහාවනයෙහි කූටාගාර ශාලාවෙහි වැඩවසන සේක. ඒ භවත් ගෞතමයන් වහන්සේ පිළිබඳ මෙබඳු කල්‍යාණ කීර්ති රාවයක් පැතිර පවතී: ‘ඒ භාග්‍යවතුන් වහන්සේ අරහත්ය, සම්මාසම්බුද්ධය, විජ්ජාචරණ සම්පන්නය, සුගතය, ලෝකවිදූය, අනුත්තර පුරිසදම්මසාරථීය, සත්ථා දේවමනුස්සානංය, බුද්ධය, භාග්‍යවතුන් වහන්සේය’ යනුවෙනි. උන්වහන්සේ දෙවියන් සහිත වූ, මරුන් සහිත වූ, බඹුන් සහිත වූ මේ ලෝකයද, ශ්‍රමණ-බ්‍රාහ්මණයන්, දෙවි-මිනිසුන් සහිත වූ මේ ප්‍රජාවද තමන් විසින්ම විශිෂ්ට ඥානයෙන් අවබෝධ කොට, ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරති. උන්වහන්සේ මුල මනරම් වූ, මැද මනරම් වූ, කෙළවර මනරම් වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ ධර්මය දේශනා කරති; කේවල පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරති. එබඳු අරහතුන් වහන්සේලා දැකීම ඉතා යහපත්ය.”",
      "paliTitle": "Brāhmaṇadūtavatthu",
      "englishTitle": "Story of the Brahmin Messenger",
      "sinhalaTitle": "බ්‍රාහ්මණදූත වස්තුව"
    },
    {
      "number": 360,
      "pali": "Atha kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā yena mahāvanaṃ kūṭāgārasālā tenupasaṅkamiṃsu. Tena kho pana samayena āyasmā nāgito bhagavato upaṭṭhāko hoti. Atha kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā yenāyasmā nāgito tenupasaṅkamiṃsu. Upasaṅkamitvā āyasmantaṃ nāgitaṃ etadavocuṃ – ‘‘kahaṃ nu kho, bho nāgita, etarahi so bhavaṃ gotamo viharati? Dassanakāmā hi mayaṃ taṃ bhavantaṃ gotama’’nti. ‘‘Akālo kho, āvuso, bhagavantaṃ dassanāya, paṭisallīno bhagavā’’ti. Atha kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā tattheva ekamantaṃ nisīdiṃsu – ‘‘disvāva mayaṃ taṃ bhavantaṃ gotamaṃ gamissāmā’’ti.",
      "english": "Then, those Kosalan brahmin envoys and Magadhan brahmin envoys approached the peaked-roof hall in the Great Wood. Now at that time, the Venerable Nagita was the Blessed One's attendant.\n\nThen, those Kosalan brahmin envoys and Magadhan brahmin envoys approached the Venerable Nagita. Having approached him, they said to the Venerable Nagita, \"Where, good Nagita, is Master Gotama currently residing? We wish to see Master Gotama.\" \"Friends, it is not the proper time to see the Blessed One; the Blessed One is in seclusion.\" Then, those Kosalan brahmin envoys and Magadhan brahmin envoys sat down right there to one side, thinking, \"We will depart only after we have seen Master Gotama.\"",
      "sinhala": "එවිට ඒ කෝසල බමුණු දූතයෝද, මාගධ බමුණු දූතයෝද මහා වනයේ කූටාගාර ශාලාව තිබූ තැනට එළඹියෝය. එකල ආයුෂ්මත් නාගිත තෙරුන් වහන්සේ භාග්‍යවතුන් වහන්සේගේ උපස්ථායකව සිටියේය. එවිට ඒ කෝසල බමුණු දූතයෝද, මාගධ බමුණු දූතයෝද ආයුෂ්මත් නාගිත තෙරුන් වහන්සේ සිටි තැනට එළඹියෝය. එළඹ ආයුෂ්මත් නාගිත තෙරුන් වහන්සේට මෙය කීවෝය: “භවත් නාගිත, දැන් භවත් ගෞතමයන් වහන්සේ කොහි වැඩ වාසය කරන සේක්ද? අපි භවත් ගෞතමයන් වහන්සේ දැකීමට කැමැත්තෝ වෙමු.” “ඇවැත්නි, භාග්‍යවතුන් වහන්සේ දැකීමට මෙය අකාලයකි. භාග්‍යවතුන් වහන්සේ පටිසල්ලානයෙහි වැඩ සිටින සේක.” එවිට ඒ කෝසල බමුණු දූතයෝද, මාගධ බමුණු දූතයෝද එහිම එකත්පසෙක වාඩිවූවෝය. “අපි භවත් ගෞතමයන් වහන්සේ දැකම යන්නෙමු.”",
      "paliTitle": ""
    },
    {
      "number": 361,
      "pali": "Oṭṭhaddhopi licchavī mahatiyā licchavīparisāya saddhiṃ yena mahāvanaṃ kūṭāgārasālā yenāyasmā nāgito tenupasaṅkami; upasaṅkamitvā āyasmantaṃ nāgitaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho oṭṭhaddhopi licchavī āyasmantaṃ nāgitaṃ etadavoca – ‘‘kahaṃ nu kho, bhante nāgita, etarahi so bhagavā viharati arahaṃ sammāsambuddho, dassanakāmā hi mayaṃ taṃ bhagavantaṃ arahantaṃ sammāsambuddha’’nti. ‘‘Akālo kho, mahāli, bhagavantaṃ dassanāya, paṭisallīno bhagavā’’ti. Oṭṭhaddhopi licchavī tattheva ekamantaṃ nisīdi – ‘‘disvāva ahaṃ taṃ bhagavantaṃ gamissāmi arahantaṃ sammāsambuddha’’nti.",
      "english": "The Licchavi Oṭṭhaddha, together with a large assembly of Licchavis, approached the Gabled Hall in the Great Wood, to where the Venerable Nāgita was. Having approached and greeted the Venerable Nāgita, he stood to one side.\n\nAs he stood to one side, the Licchavi Oṭṭhaddha said this to the Venerable Nāgita: \"Where, indeed, Venerable Nāgita, does that Blessed One, the Arahant, the Perfectly Self-Awakened One, reside now? For we are desirous of seeing that Blessed One, the Arahant, the Perfectly Self-Awakened One.\" \"Indeed, Mahāli, it is not the time to see the Blessed One. The Blessed One is in seclusion.\" The Licchavi Oṭṭhaddha sat down right there to one side, thinking: \"Only after I have seen that Blessed One, the Arahant, the Perfectly Self-Awakened One, will I go.\"",
      "sinhala": "ඕටඨද්ධ ලිච්ඡවී රජතුමා මහත් වූ ලිච්ඡවී පිරිසක් සමඟ මහාවනයේ කූටාගාර ශාලාව වෙත, ආයුෂ්මත් නාගිත හිමි වැඩසිටින තැනට ගියේය. එළඹ, ආයුෂ්මත් නාගිත හිමියන්ට වැඳ, එකත්පස්ව සිටියේය.\n\nඑකත්පස්ව සිටි ඕටඨද්ධ ලිච්ඡවී රජතුමා ආයුෂ්මත් නාගිත හිමියන්ට මෙය පැවසුවේය: “ස්වාමීනි නාගිතයන් වහන්ස, මේ දිනවල ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ කොහි වැඩසිටින සේක්ද? අපි ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේව දැකීමට කැමැත්තෙන් සිටිමු.” “මහල්ලියෙනි, භාග්‍යවතුන් වහන්සේව දැකීමට දැන් සුදුසු කාලය නොවේ. භාග්‍යවතුන් වහන්සේ භාවනානුයෝගීව වැඩසිටිති.” ඕටඨද්ධ ලිච්ඡවී රජතුමා එහිම එකත්පස්ව හිඳගත්තේය: “මම ඒ භාග්‍යවත් අරහත් සම්මාසම්බුදුරජාණන් වහන්සේව දැකීමෙන් පසුවම යන්නෙමි.”",
      "paliTitle": "Oṭṭhaddhalicchavīvatthu",
      "englishTitle": "Story of Oṭṭhaddha Licchavi",
      "sinhalaTitle": "ඕට්ඨද්ධ ලිච්ඡවී වස්තුව"
    },
    {
      "number": 362,
      "pali": "Atha kho sīho samaṇuddeso yenāyasmā nāgito tenupasaṅkami; upasaṅkamitvā āyasmantaṃ nāgitaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho sīho samaṇuddeso āyasmantaṃ nāgitaṃ etadavoca – ‘‘ete, bhante kassapa, sambahulā kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā idhūpasaṅkantā bhagavantaṃ dassanāya; oṭṭhaddhopi licchavī mahatiyā licchavīparisāya saddhiṃ idhūpasaṅkanto bhagavantaṃ dassanāya, sādhu, bhante kassapa, labhataṃ esā janatā bhagavantaṃ dassanāyā’’ti. ‘‘Tena hi, sīha, tvaññeva bhagavato ārocehī’’ti. ‘‘Evaṃ, bhante’’ti kho sīho samaṇuddeso āyasmato nāgitassa paṭissutvā yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho sīho samaṇuddeso bhagavantaṃ etadavoca – ‘‘ete, bhante, sambahulā kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā idhūpasaṅkantā bhagavantaṃ dassanāya, oṭṭhaddhopi licchavī mahatiyā licchavīparisāya saddhiṃ idhūpasaṅkanto bhagavantaṃ dassanāya. Sādhu, bhante, labhataṃ esā janatā bhagavantaṃ dassanāyā’’ti. ‘‘Tena hi, sīha, vihārapacchāyāyaṃ āsanaṃ paññapehī’’ti. ‘‘Evaṃ, bhante’’ti kho sīho samaṇuddeso bhagavato paṭissutvā vihārapacchāyāyaṃ āsanaṃ paññapesi.",
      "english": "Then the novice Siha approached the venerable Nagita. Having approached, he saluted the venerable Nagita and stood to one side. Standing to one side, the novice Siha said this to the venerable Nagita: \"Venerable Kassapa, here are many Kosalan brahmin messengers and Magadhan brahmin messengers who have arrived to see the Blessed One. Also the Licchavi Oṭṭhaddha, accompanied by a large assembly of Licchavis, has arrived here to see the Blessed One. It would be good, venerable Kassapa, if these people could be granted an audience with the Blessed One.\" \"In that case, Siha,\" replied the venerable Nagita, \"you yourself inform the Blessed One.\" \"Yes, venerable sir,\" the novice Siha replied to the venerable Nagita, and then approached where the Blessed One was. Having approached, he saluted the Blessed One and stood to one side. Standing to one side, the novice Siha said this to the Blessed One: \"Venerable sir, here are many Kosalan brahmin messengers and Magadhan brahmin messengers who have arrived to see the Blessed One. Also the Licchavi Oṭṭhaddha, accompanied by a large assembly of Licchavis, has arrived here to see the Blessed One. It would be good, venerable sir, if these people could be granted an audience with the Blessed One.\" \"In that case, Siha,\" said the Blessed One, \"spread out a seat in the shade behind the monastery.\" \"Yes, venerable sir,\" the novice Siha replied to the Blessed One, and then spread out a seat in the shade behind the monastery.",
      "sinhala": "එවිට සිංහ සාමණේරයා ආයුෂ්මත් නාගිත තෙරුන් වහන්සේ වෙත එළඹියේය; එළඹ, ආයුෂ්මත් නාගිත තෙරුන් වහන්සේට වන්දනා කොට, එකත්පස්ව සිටියේය. එකත්පස්ව සිටි සිංහ සාමණේරයා ආයුෂ්මත් නාගිත තෙරුන් වහන්සේට මෙය කීවේය: “පූජ්‍ය කස්සප ස්වාමීන් වහන්ස, මේ බොහෝ කොසොල් බමුණු දූතයෝද, මාගධ බමුණු දූතයෝද භාග්‍යවතුන් වහන්සේ දකින්නට මෙහි පැමිණ සිටිති; තවද, ඕට්ඨද්ධ නම් ලිච්ඡවී කුමාරයා මහත් ලිච්ඡවී පිරිසක් සමඟ භාග්‍යවතුන් වහන්සේ දකින්නට මෙහි පැමිණ සිටී. පූජ්‍ය කස්සප ස්වාමීන් වහන්ස, මේ ජනයාට භාග්‍යවතුන් වහන්සේ දැකීමට අවස්ථාව ලැබුණේ නම් මැනවි.” “එසේනම්, සිංහ, ඔබම භාග්‍යවතුන් වහන්සේට දැනුම් දෙන්න” යි කීවේය. “එසේය, ස්වාමීන් වහන්ස” යි සිංහ සාමණේරයා ආයුෂ්මත් නාගිත තෙරුන් වහන්සේට පිළිතුරු දී, භාග්‍යවතුන් වහන්සේ වෙත එළඹියේය; එළඹ, භාග්‍යවතුන් වහන්සේට වන්දනා කොට, එකත්පස්ව සිටියේය. එකත්පස්ව සිටි සිංහ සාමණේරයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ස්වාමීන් වහන්ස, මේ බොහෝ කොසොල් බමුණු දූතයෝද, මාගධ බමුණු දූතයෝද භාග්‍යවතුන් වහන්සේ දකින්නට මෙහි පැමිණ සිටිති. තවද, ඕට්ඨද්ධ නම් ලිච්ඡවී කුමාරයා මහත් ලිච්ඡවී පිරිසක් සමඟ භාග්‍යවතුන් වහන්සේ දකින්නට මෙහි පැමිණ සිටී. ස්වාමීන් වහන්ස, මේ ජනයාට භාග්‍යවතුන් වහන්සේ දැකීමට අවස්ථාව ලැබුණේ නම් මැනවි.” “එසේනම්, සිංහ, විහාරයේ පසුපස සෙවණෙහි ආසනයක් පනවන්න” යි වදාළේය. “එසේය, ස්වාමීන් වහන්ස” යි සිංහ සාමණේරයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දී, විහාරයේ පසුපස සෙවණෙහි ආසනයක් පැනවීය.",
      "paliTitle": ""
    },
    {
      "number": 363,
      "pali": "Atha kho bhagavā vihārā nikkhamma vihārapacchāyāyaṃ paññatte āsane nisīdi. Atha kho te kosalakā ca brāhmaṇadūtā māgadhakā ca brāhmaṇadūtā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavatā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃsu. Oṭṭhaddhopi licchavī mahatiyā licchavīparisāya saddhiṃ yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi.",
      "english": "Then the Blessed One emerged from the monastery and sat down on a prepared seat in the shadow behind the monastery. Then those brahmin envoys from Kosala and the brahmin envoys from Magadha approached the Blessed One. Having approached, they exchanged greetings with the Blessed One. Having exchanged courteous and amiable talk, they sat down to one side.\n\nAnd Oṭṭhaddha, the Licchavi, accompanied by a large assembly of Licchavis, also approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side.",
      "sinhala": "ඉන්පසු භාග්‍යවතුන් වහන්සේ විහාරයෙන් නික්ම විහාරයේ පසුපස සෙවණෙහි පනවන ලද ආසනයක වැඩහුන් සේක. ඉන්පසු ඒ කෝසල බ්‍රාහ්මණ දූතවරුන් ද මාගධ බ්‍රාහ්මණ දූතවරුන් ද භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියහ; පැමිණ භාග්‍යවතුන් වහන්සේ සමග සතුටු සාමිචියෙහි යෙදුණහ. සතුටු සාමිචි කථා සහ සිහිකරවිය යුතු කථා පවත්ව අවසන් කර එකත්පස්ව වාඩි වූහ. ඕට්ඨද්ධා නම් ලිච්ඡවී කුමාරයා ද විශාල ලිච්ඡවී පිරිසක් සමග භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කර එකත්පස්ව වාඩි විය.",
      "paliTitle": ""
    },
    {
      "number": 364,
      "pali": "Ekamantaṃ nisinno kho oṭṭhaddho licchavī bhagavantaṃ etadavoca – ‘‘purimāni, bhante, divasāni purimatarāni sunakkhatto licchaviputto yenāhaṃ tenupasaṅkami; upasaṅkamitvā maṃ etadavoca – ‘yadagge ahaṃ, mahāli, bhagavantaṃ upanissāya viharāmi, na ciraṃ tīṇi vassāni, dibbāni hi kho rūpāni passāmi piyarūpāni kāmūpasaṃhitāni rajanīyāni, no ca kho dibbāni saddāni suṇāmi piyarūpāni kāmūpasaṃhitāni rajanīyānī’ti. Santāneva nu kho, bhante, sunakkhatto licchaviputto dibbāni saddāni nāssosi piyarūpāni kāmūpasaṃhitāni rajanīyāni, udāhu asantānī’’ti?",
      "english": "The Licchavi Oṭṭhaddha, seated to one side, said this to the Blessed One: \"Venerable Sir, some days ago, and even earlier than that, Sunakkhatta the Licchavi's son came to me. Having come, he said this to me: 'Mahāli, ever since I have been living dependent on the Blessed One, for not much longer than three years, I indeed see divine forms that are pleasing, associated with sensuality, and inspiring passion, but I do not hear divine sounds that are pleasing, associated with sensuality, and inspiring passion.' Venerable Sir, were divine sounds, which are pleasing, associated with sensuality, and inspiring passion, actually present but unheard by Sunakkhatta the Licchavi's son, or were they simply not present?\"",
      "sinhala": "එක්පසෙක වාඩි වී සිටි ඔට්ඨද්ද ලිච්ඡවී තෙම භාග්‍​යවතුන් වහන්සේට මෙසේ පැවසීය: \"පින්වහන්ස, කලින් දිනවල, ඊටත් කලින්, සුනක්ඛත්ත ලිච්ඡවි පුත්‍ර​යා මා සිටි තැනට පැමිණියේය; පැමිණ මට මෙසේ කීවේය: ‘මහාලී, මම යම් දිනක සිට භාග්‍​යවතුන් වහන්සේ ඇසුරු කරමින් වාසය කරම් ද, වැඩි කලක් නොවේ, අවුරුදු තුනක් පමණි, එවක සිට මම ප්‍රි​ය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නා සුළු දිව්‍​ය රූපයන් දකිමි, එහෙත් ප්‍රි​ය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නා සුළු දිව්‍​ය ශබ්ද නම් නොඅසමි.’ පින්වහන්ස, සුනක්ඛත්ත ලිච්ඡවි පුත්‍ර​යා ප්‍රි​ය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නා සුළු දිව්‍​ය ශබ්ද ඇසුවේ, ඒවා සැබවින්ම පැවතුණ ද? නැතහොත් ඒවා නොපැවතුණ ද?\"",
      "paliTitle": ""
    },
    {
      "number": 365,
      "pali": "‘‘Santāneva kho, mahāli, sunakkhatto licchaviputto dibbāni saddāni nāssosi piyarūpāni kāmūpasaṃhitāni rajanīyāni, no asantānī’’ti. ‘‘Ko nu kho, bhante, hetu, ko paccayo, yena santāneva sunakkhatto licchaviputto dibbāni saddāni nāssosi piyarūpāni kāmūpasaṃhitāni rajanīyāni, no asantānī’’ti?",
      "english": "Indeed, Mahāli, it was when they were present that Sunakkhatta the Licchavi's son did not hear the divine sounds—sounds that are agreeable, associated with sensual pleasures, and exciting passion—not when they were absent.\n\nWhat, Venerable Sir, is the reason, what is the condition, whereby it was when they were present that Sunakkhatta the Licchavi's son did not hear the divine sounds—sounds that are agreeable, associated with sensual pleasures, and exciting passion—not when they were absent?",
      "sinhala": "මහාලිය, සුනක්ඛත්ත ලිච්ඡවි පුත්‍රයාට ප්‍රිය ස්වරූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන සුළු වූ දිව්‍ය ශබ්දයන් තිබියදීම ඇසුණේ නැත; ඒවා නොතිබුණේද නොවේ.\nස්වාමීන් වහන්ස, සුනක්ඛත්ත ලිච්ඡවි පුත්‍රයාට ප්‍රිය ස්වරූප ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන සුළු වූ දිව්‍ය ශබ්දයන් තිබියදීම නොඇසීමටත්, ඒවා නොතිබුණේද නොවන කාරණයටත් හේතුව කුමක්ද, ප්‍රත්‍යය කුමක්ද?",
      "paliTitle": "Ekaṃsabhāvitasamādhi",
      "englishTitle": "Absolutely Developed Concentration",
      "sinhalaTitle": "ඒකාන්තයෙන් වැඩූ සමාධිය"
    },
    {
      "number": 366,
      "pali": "‘‘Idha, mahāli, bhikkhuno puratthimāya disāya ekaṃsabhāvito samādhi hoti dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. So puratthimāya disāya ekaṃsabhāvite samādhimhi dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. Puratthimāya disāya dibbāni rūpāni passati piyarūpāni kāmūpasaṃhitāni rajanīyāni, no ca kho dibbāni saddāni suṇāti piyarūpāni kāmūpasaṃhitāni rajanīyāni. Taṃ kissa hetu? Evañhetaṃ, mahāli, hoti bhikkhuno puratthimāya disāya ekaṃsabhāvite samādhimhi dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ.",
      "english": "Here, Mahāli, for a monk, in the eastern direction, concentration is developed in a single aspect for the seeing of lovely divine forms that are connected with sensuality and inspire lust, but not for the hearing of lovely divine sounds that are connected with sensuality and inspire lust. When his concentration in the eastern direction is thus developed in a single aspect for the seeing of lovely divine forms connected with sensuality and inspiring lust, but not for the hearing of lovely divine sounds connected with sensuality and inspiring lust, then in the eastern direction he sees divine forms that are lovely, connected with sensuality, and inspiring lust, yet he does not hear divine sounds that are lovely, connected with sensuality, and inspiring lust. What is the reason for this? It is, Mahāli, because the monk’s concentration in the eastern direction is developed in a single aspect for the seeing of lovely divine forms connected with sensuality and inspiring lust, but not for the hearing of lovely divine sounds connected with sensuality and inspiring lust, that this occurs.",
      "sinhala": "මහණෙනි, මෙහි භික්ෂුවකට නැගෙනහිර දිශාවෙන්, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, ඇලීමට හේතු වන දිව්‍ය රූප දැකීම සඳහා පමණක්, එහෙත් ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, ඇලීමට හේතු වන දිව්‍ය ශ්‍රවණය සඳහා නොවන ලෙස, එක් අතකට පමණක් වඩන ලද සමාධියක් වේ.\n\nඔහු නැගෙනහිර දිශාවෙන්, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, ඇලීමට හේතු වන දිව්‍ය රූප දැකීම සඳහා පමණක්, එහෙත් ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, ඇලීමට හේතු වන දිව්‍ය ශ්‍රවණය සඳහා නොවන ලෙස, එක් අතකට පමණක් වඩන ලද සමාධියකින් යුක්තව සිටින විට, ඔහු නැගෙනහිර දිශාවෙන් ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, ඇලීමට හේතු වන දිව්‍ය රූප දකියි; එහෙත් ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, ඇලීමට හේතු වන දිව්‍ය ශබ්ද නොඅසයි.\n\nඑයට හේතුව කුමක්ද? මහණෙනි, භික්ෂුවකට නැගෙනහිර දිශාවෙන් ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, ඇලීමට හේතු වන දිව්‍ය රූප දැකීම සඳහා පමණක්, එහෙත් ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, ඇලීමට හේතු වන දිව්‍ය ශ්‍රවණය සඳහා නොවන ලෙස, එක් අතකට පමණක් වඩන ලද සමාධියක් තිබීමයි.",
      "paliTitle": ""
    },
    {
      "number": 367,
      "pali": "‘‘Puna caparaṃ, mahāli, bhikkhuno dakkhiṇāya disāya…pe… pacchimāya disāya … uttarāya disāya… uddhamadho tiriyaṃ ekaṃsabhāvito samādhi hoti dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. So uddhamadho tiriyaṃ ekaṃsabhāvite samādhimhi dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. Uddhamadho tiriyaṃ dibbāni rūpāni passati piyarūpāni kāmūpasaṃhitāni rajanīyāni, no ca kho dibbāni saddāni suṇāti piyarūpāni kāmūpasaṃhitāni rajanīyāni. Taṃ kissa hetu? Evañhetaṃ, mahāli, hoti bhikkhuno uddhamadho tiriyaṃ ekaṃsabhāvite samādhimhi dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ.",
      "english": "Furthermore, Mahāli, a bhikkhu’s concentration is exclusively cultivated—to the east, south, west, north, above, below, and across—for the seeing of divine forms that are pleasing, connected with sensual desire, and captivating, but not for the hearing of divine sounds that are pleasing, connected with sensual desire, and captivating. When his concentration, exclusively cultivated above, below, and across, is for the seeing of divine forms that are pleasing, connected with sensual desire, and captivating, but not for the hearing of divine sounds that are pleasing, connected with sensual desire, and captivating, then he sees divine forms—above, below, and across—that are pleasing, connected with sensual desire, and captivating, but he does not hear divine sounds that are pleasing, connected with sensual desire, and captivating. What is the reason for this? Such is the case, Mahāli, for a bhikkhu when his concentration has been exclusively cultivated above, below, and across, for the seeing of divine forms that are pleasing, connected with sensual desire, and captivating, but not for the hearing of divine sounds that are pleasing, connected with sensual desire, and captivating.",
      "sinhala": "තවද, මහාලි, භික්ෂුවට සෑම දිශාවකටම, ඉහළ, පහළ, හරහටද, ප්‍රියජනක වූ, කාමයෙන් යුක්ත වූ, රාගය උපදවන දිව්‍ය රූප දැකීම සඳහා පමණක් ඒකාංශිකව වඩන ලද සමාධියක් තිබේ. එහෙත් ප්‍රියජනක වූ, කාමයෙන් යුක්ත වූ, රාගය උපදවන දිව්‍ය ශබ්ද ඇසීම සඳහා නොවේ.\n\nඔහු උඩ යට හරහට, ප්‍රියජනක වූ, කාමයෙන් යුක්ත වූ, රාගය උපදවන දිව්‍ය රූප දැකීම සඳහා ඒකාංශිකව වඩන ලද, එහෙත් ප්‍රියජනක වූ, කාමයෙන් යුක්ත වූ, රාගය උපදවන දිව්‍ය ශබ්ද ඇසීම සඳහා නොවන සමාධියක සිටී.\n\nඔහු උඩ යට හරහට, ප්‍රියජනක වූ, කාමයෙන් යුක්ත වූ, රාගය උපදවන දිව්‍ය රූප දකියි. එහෙත් ප්‍රියජනක වූ, කාමයෙන් යුක්ත වූ, රාගය උපදවන දිව්‍ය ශබ්ද අසන්නේ නැත.\n\nඊට හේතුව කුමක්ද? මහාලි, භික්ෂුවට එසේ වන්නේ උඩ යට හරහට ඒකාංශිකව වඩන ලද්දේ ප්‍රියජනක වූ, කාමයෙන් යුක්ත වූ, රාගය උපදවන දිව්‍ය රූප දැකීම පිණිස මිස, ප්‍රියජනක වූ, කාමයෙන් යුක්ත වූ, රාගය උපදවන දිව්‍ය ශබ්ද ඇසීම පිණිස නොවන සමාධියක් වන බැවිනි.",
      "paliTitle": ""
    },
    {
      "number": 368,
      "pali": "‘‘Idha, mahāli, bhikkhuno puratthimāya disāya ekaṃsabhāvito samādhi hoti dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. So puratthimāya disāya ekaṃsabhāvite samādhimhi dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. Puratthimāya disāya dibbāni saddāni suṇāti piyarūpāni kāmūpasaṃhitāni rajanīyāni, no ca kho dibbāni rūpāni passati piyarūpāni kāmūpasaṃhitāni rajanīyāni. Taṃ kissa hetu? Evañhetaṃ, mahāli, hoti bhikkhuno puratthimāya disāya ekaṃsabhāvite samādhimhi dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ.",
      "english": "Here, Mahāli, for a monk in the eastern direction, concentration is exclusively developed for hearing divine sounds that are pleasing, sensually connected, and captivating, but not for seeing divine forms that are pleasing, sensually connected, and captivating. That monk, with concentration exclusively developed in the eastern direction for hearing divine sounds that are pleasing, sensually connected, and captivating—but not for seeing divine forms that are pleasing, sensually connected, and captivating—then hears divine sounds that are pleasing, sensually connected, and captivating in the eastern direction, but he does not see divine forms that are pleasing, sensually connected, and captivating. What is the reason for this? This is why, Mahāli, it happens when a monk's concentration in the eastern direction is exclusively developed for hearing divine sounds that are pleasing, sensually connected, and captivating, but not for seeing divine forms that are pleasing, sensually connected, and captivating.",
      "sinhala": "මෙහිදී, මහාලී, භික්ෂුවකට නැගෙනහිර දිශාවෙන් ප්‍ර‌ිය ස්වභාවයක් ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍යමය ශබ්දයන් ඇසීම පිණිස පමණක් වඩන ලද සමාධියක් ඇත, එහෙත් ප්‍ර‌ිය ස්වභාවයක් ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍යමය රූප දැකීම පිණිස නොවේ. ඔහු නැගෙනහිර දිශාවෙන් ප්‍ර‌ිය ස්වභාවයක් ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍යමය ශබ්දයන් ඇසීම පිණිස පමණක් වඩන ලද, එහෙත් ප්‍ර‌ිය ස්වභාවයක් ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍යමය රූප දැකීම පිණිස නොවන ඒ සමාධියෙහි පිහිටා සිටියි. ඔහු නැගෙනහිර දිශාවෙන් ප්‍ර‌ිය ස්වභාවයක් ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍යමය ශබ්දයන් අසයි, එහෙත් ප්‍ර‌ිය ස්වභාවයක් ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍යමය රූප නොදකියි. ඊට හේතුව කුමක්ද? මහාලී, භික්ෂුවකට නැගෙනහිර දිශාවෙන් ප්‍ර‌ිය ස්වභාවයක් ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍යමය ශබ්දයන් ඇසීම පිණිස පමණක් වඩන ලද සමාධියක් ඇති විට, එහෙත් ප්‍ර‌ිය ස්වභාවයක් ඇති, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍යමය රූප දැකීම පිණිස නොවන විට, එය මෙසේම වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 369,
      "pali": "‘‘Puna caparaṃ, mahāli, bhikkhuno dakkhiṇāya disāya…pe… pacchimāya disāya… uttarāya disāya… uddhamadho tiriyaṃ ekaṃsabhāvito samādhi hoti dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. So uddhamadho tiriyaṃ ekaṃsabhāvite samādhimhi dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. Uddhamadho tiriyaṃ dibbāni saddāni suṇāti piyarūpāni kāmūpasaṃhitāni rajanīyāni, no ca kho dibbāni rūpāni passati piyarūpāni kāmūpasaṃhitāni rajanīyāni. Taṃ kissa hetu? Evañhetaṃ, mahāli, hoti bhikkhuno uddhamadho tiriyaṃ ekaṃsabhāvite samādhimhi dibbānaṃ saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, no ca kho dibbānaṃ rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ.",
      "english": "Furthermore, Mahāli, for a monk, concentration is developed one-sidedly in the southern, western, and northern directions, and up, down, and across, for the hearing of divine sounds that are lovely, sensual, and intoxicating, but not for the seeing of divine forms that are lovely, sensual, and intoxicating.\n\nWhen that concentration is developed one-sidedly in all directions—up, down, and across—for the hearing of divine sounds that are lovely, sensual, and intoxicating, but not for the seeing of divine forms that are lovely, sensual, and intoxicating,\n\nHe hears divine sounds that are lovely, sensual, and intoxicating in all directions—up, down, and across—but he does not see divine forms that are lovely, sensual, and intoxicating in all directions—up, down, and across.\n\nFor what reason? It is so, Mahāli, for a monk in that concentration developed one-sidedly in all directions—up, down, and across—for the hearing of divine sounds that are lovely, sensual, and intoxicating, but not for the seeing of divine forms that are lovely, sensual, and intoxicating.",
      "sinhala": "තවද, මහාලිය, යම් භික්ෂුවකට නැගෙනහිර, දකුණ, බටහිර, උතුර යන දිශාවන්හිත්, ඉහළට, පහළට, හරහටත්, ප්‍රි‍ය උපදවන, කාමයට සම්බන්ධ වූ, ඇලීම් ඇති කරවන දිව්‍ය ශබ්ද ඇසීම සඳහා පමණක් වඩන ලද සමාධියක් වේද, එහෙත් ප්‍රි‍ය උපදවන, කාමයට සම්බන්ධ වූ, ඇලීම් ඇති කරවන දිව්‍ය රූප දැකීම සඳහා නොවේද;\n\nඒ භික්ෂුව නැගෙනහිර, දකුණ, බටහිර, උතුර යන දිශාවන්හිත්, ඉහළට, පහළට, හරහටත්, ප්‍රි‍ය උපදවන, කාමයට සම්බන්ධ වූ, ඇලීම් ඇති කරවන දිව්‍ය ශබ්ද ඇසීම සඳහා පමණක් වඩන ලද ඒ සමාධියෙන් යුක්ත වේ. එහෙත් එය ප්‍රි‍ය උපදවන, කාමයට සම්බන්ධ වූ, ඇලීම් ඇති කරවන දිව්‍ය රූප දැකීම සඳහා නොවේ.\n\nහෙතෙම නැගෙනහිර, දකුණ, බටහිර, උතුර යන දිශාවන්හිත්, ඉහළට, පහළට, හරහටත්, ප්‍රි‍ය උපදවන, කාමයට සම්බන්ධ වූ, ඇලීම් ඇති කරවන දිව්‍ය ශබ්ද අසයි. එහෙත් ප්‍රි‍ය උපදවන, කාමයට සම්බන්ධ වූ, ඇලීම් ඇති කරවන දිව්‍ය රූප නොදකියි.\n\nඑයට හේතුව කුමක්ද? මහාලිය, භික්ෂුවකට නැගෙනහිර, දකුණ, බටහිර, උතුර යන දිශාවන්හිත්, ඉහළට, පහළට, හරහටත්, ප්‍රි‍ය උපදවන, කාමයට සම්බන්ධ වූ, ඇලීම් ඇති කරවන දිව්‍ය ශබ්ද ඇසීම සඳහා පමණක් වඩන ලද සමාධියක් ඇති බැවින්, එහෙත් ප්‍රි‍ය උපදවන, කාමයට සම්බන්ධ වූ, ඇලීම් ඇති කරවන දිව්‍ය රූප දැකීම සඳහා නොවන බැවින්, එය එසේ වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 370,
      "pali": "‘‘Idha, mahāli, bhikkhuno puratthimāya disāya ubhayaṃsabhāvito samādhi hoti dibbānañca rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ dibbānañca saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. So puratthimāya disāya ubhayaṃsabhāvite samādhimhi dibbānañca rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, dibbānañca saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. Puratthimāya disāya dibbāni ca rūpāni passati piyarūpāni kāmūpasaṃhitāni rajanīyāni, dibbāni ca saddāni suṇāti piyarūpāni kāmūpasaṃhitāni rajanīyāni. Taṃ kissa hetu? Evañhetaṃ, mahāli, hoti bhikkhuno puratthimāya disāya ubhayaṃsabhāvite samādhimhi dibbānañca rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ dibbānañca saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ.",
      "english": "Here, Mahāli, for a monk, concentration is developed in the eastern direction, trained in both aspects: for the seeing of divine forms that are pleasing, connected with sensual desires, and inspiring lust, and for the hearing of divine sounds that are pleasing, connected with sensual desires, and inspiring lust. When he has thus developed concentration in the eastern direction, trained in both aspects—for the seeing of divine forms that are pleasing, connected with sensual desires, and inspiring lust, and for the hearing of divine sounds that are pleasing, connected with sensual desires, and inspiring lust—then, in the eastern direction, he sees divine forms that are pleasing, connected with sensual desires, and inspiring lust, and he hears divine sounds that are pleasing, connected with sensual desires, and inspiring lust. What is the reason for that? This is how it is, Mahāli: for a monk, when concentration has been developed in the eastern direction, trained in both aspects for the seeing of divine forms that are pleasing, connected with sensual desires, and inspiring lust, and for the hearing of divine sounds that are pleasing, connected with sensual desires, and inspiring lust.",
      "sinhala": "මෙහි මහාලි, භික්ෂුවකට නැගෙනහිර දිශාවෙහි, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍ය රූප දැකීම පිණිසත්, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍ය ශබ්ද ශ්‍රවණය පිණිසත් දෙයාකාරයකින් වඩන ලද සමාධියක් වේ.\n\nඒ භික්ෂුව නැගෙනහිර දිශාවෙහි, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍ය රූප දැකීම පිණිසත්, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍ය ශබ්ද ශ්‍රවණය පිණිසත් දෙයාකාරයකින් වඩන ලද සමාධියෙහි පිහිටා සිටිය දී, නැගෙනහිර දිශාවෙහි ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍ය රූප ද දකී; ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍ය ශබ්ද ද ශ්‍රවණය කරයි.\n\nඒ කුමන කරුණක් නිසා ද?\n\nමහාලි, මෙය මෙසේ වන්නේ භික්ෂුවකට නැගෙනහිර දිශාවෙහි, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍ය රූප දැකීම පිණිසත්, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, රාගය උපදවන දිව්‍ය ශබ්ද ශ්‍රවණය පිණිසත් දෙයාකාරයකින් වඩන ලද සමාධියක් ඇති හෙයිනි.",
      "paliTitle": ""
    },
    {
      "number": 371,
      "pali": "‘‘Puna caparaṃ, mahāli, bhikkhuno dakkhiṇāya disāya…pe… pacchimāya disāya… uttarāya disāya… uddhamadho tiriyaṃ ubhayaṃsabhāvito samādhi hoti dibbānañca rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, dibbānañca saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. So uddhamadho tiriyaṃ ubhayaṃsabhāvite samādhimhi dibbānañca rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ dibbānañca saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. Uddhamadho tiriyaṃ dibbāni ca rūpāni passati piyarūpāni kāmūpasaṃhitāni rajanīyāni, dibbāni ca saddāni suṇāti piyarūpāni kāmūpasaṃhitāni rajanīyāni. Taṃ kissa hetu? Evañhetaṃ, mahāli, hoti bhikkhuno uddhamadho tiriyaṃ ubhayaṃsabhāvite samādhimhi dibbānañca rūpānaṃ dassanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ, dibbānañca saddānaṃ savanāya piyarūpānaṃ kāmūpasaṃhitānaṃ rajanīyānaṃ. Ayaṃ kho mahāli, hetu, ayaṃ paccayo, yena santāneva sunakkhatto licchaviputto dibbāni saddāni nāssosi piyarūpāni kāmūpasaṃhitāni rajanīyāni, no asantānī’’ti.",
      "english": "Furthermore, Mahāli, a monk cultivates concentration in the southern direction, in the western direction, in the northern direction, and so on, upwards, downwards, and across, fully developed in all respects, for the seeing of divine forms that are lovely, sensually alluring, and captivating, and for the hearing of divine sounds that are lovely, sensually alluring, and captivating.\n\nThrough such concentration, developed fully in all directions—upwards, downwards, and across—for the seeing of divine forms that are lovely, sensually alluring, and captivating, and for the hearing of divine sounds that are lovely, sensually alluring, and captivating, he sees these divine forms and hears these divine sounds in all directions—upwards, downwards, and across—which are lovely, sensually alluring, and captivating.\n\nWhat is the reason for this? It is precisely so, Mahāli, that for a monk whose concentration is thus fully developed in all directions—upwards, downwards, and across—for the seeing of divine forms that are lovely, sensually alluring, and captivating, and for the hearing of divine sounds that are lovely, sensually alluring, and captivating, this comes to be.\n\nThis, Mahāli, is the reason, this is the cause, why Sunakkhatta, the Licchavī’s son, did not hear the divine sounds that are lovely, sensually alluring, and captivating, even when they were present, and not because they were absent.",
      "sinhala": "තවද, මහාලි, භික්ෂුවකට සියලු දිශාවන්ට, ඉහළට, පහළට, හරහට, දෙපසටම වඩන ලද සමාධියක් වේ, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය රූප දැකීම පිණිසත්, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය ශබ්ද ශ්‍රවණය පිණිසත්ය.\n\nඒ භික්ෂුවට ඉහළට, පහළට, හරහට, දෙපසටම වඩන ලද සමාධියක් ඇති කල්හි, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය රූප දැකීම පිණිසත්, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය ශබ්ද ශ්‍රවණය පිණිසත්, ඔහු ඉහළට, පහළට, හරහට, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය රූප දකී, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය ශබ්ද ශ්‍රවණය කරයි.\n\nඑයට හේතුව කුමක්ද? මහාලි, ඒ භික්ෂුවට ඉහළට, පහළට, හරහට, දෙපසටම වඩන ලද සමාධියක් ඇති කල්හි, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය රූප දැකීම පිණිසත්, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය ශබ්ද ශ්‍රවණය පිණිසත් එය එසේ සිදුවේ.\n\nමහාලි, මෙයමයි හේතුව, මෙයමයි ප්‍රත්‍යය. ඒ නිසාමයි, ලිච්ඡවී පුත් සුනක්ඛත්ත, ප්‍රිය ස්වභාවයෙන් යුත්, කාමයට සම්බන්ධ වූ, සිත් ඇදගන්නාසුලු දිව්‍ය ශබ්ද පැවතියද, ඒවා නොඇසුවේ නොතිබුණු නිසා නොවේය.",
      "paliTitle": ""
    },
    {
      "number": 372,
      "pali": "‘‘Etāsaṃ nūna, bhante, samādhibhāvanānaṃ sacchikiriyāhetu bhikkhū bhagavati brahmacariyaṃ carantī’’ti. ‘‘Na kho, mahāli, etāsaṃ samādhibhāvanānaṃ sacchikiriyāhetu bhikkhū mayi brahmacariyaṃ caranti. Atthi kho, mahāli, aññeva dhammā uttaritarā ca paṇītatarā ca, yesaṃ sacchikiriyāhetu bhikkhū mayi brahmacariyaṃ carantī’’ti. ",
      "english": "“Surely, Venerable Sir, is it for the sake of realizing these developments of concentration that monks live the holy life under the Blessed One?”\n\n“No indeed, Mahāli, it is not for the sake of realizing these developments of concentration that monks live the holy life under me. There are indeed, Mahāli, other qualities that are more supreme and more excellent, for the sake of realizing which monks live the holy life under me.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, භික්ෂූන් වහන්සේලා භාග්‍යවතුන් වහන්සේ කෙරෙහි බ්‍රහ්මචරියාව පුරන්නේ මේ සමාධි භාවනාවන් සාක්ෂාත් කිරීම පිණිසමයි නේද? මහාලී, භික්ෂූන් වහන්සේලා මා කෙරෙහි බ්‍රහ්මචරියාව පුරන්නේ මේ සමාධි භාවනාවන් සාක්ෂාත් කිරීම පිණිස නොවේ. මහාලී, මේවාට වඩා උත්තරීතර වූද, ප්‍රණීතතර වූද වෙනත් ධර්ම කාරණා ඇත. භික්ෂූන් වහන්සේලා මා කෙරෙහි බ්‍රහ්මචරියාව පුරන්නේ ඒ ධර්ම කාරණා සාක්ෂාත් කිරීම පිණිසයි.",
      "paliTitle": ""
    },
    {
      "number": 373,
      "pali": "‘‘Katame pana te, bhante, dhammā uttaritarā ca paṇītatarā ca, yesaṃ sacchikiriyāhetu bhikkhū bhagavati brahmacariyaṃ carantī’’ti? ‘‘Idha, mahāli, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā sotāpanno hoti avinipātadhammo niyato sambodhiparāyaṇo. Ayampi kho, mahāli, dhammo uttaritaro ca paṇītataro ca, yassa sacchikiriyāhetu bhikkhū mayi brahmacariyaṃ caranti. ‘‘Puna caparaṃ, mahāli, bhikkhu tiṇṇaṃ saṃyojanānaṃ parikkhayā rāgadosamohānaṃ tanuttā sakadāgāmī hoti, sakideva [sakiṃdeva (ka.)] imaṃ lokaṃ āgantvā dukkhassantaṃ karoti. Ayampi kho, mahāli, dhammo uttaritaro ca paṇītataro ca, yassa sacchikiriyāhetu bhikkhū mayi brahmacariyaṃ caranti. ‘‘Puna caparaṃ, mahāli, bhikkhu pañcannaṃ orambhāgiyānaṃ saṃyojanānaṃ parikkhayā opapātiko hoti, tattha parinibbāyī, anāvattidhammo tasmā lokā. Ayampi kho, mahāli, dhammo uttaritaro ca paṇītataro ca, yassa sacchikiriyāhetu bhikkhū mayi brahmacariyaṃ caranti. ‘‘Puna caparaṃ, mahāli, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayampi kho, mahāli, dhammo uttaritaro ca paṇītataro ca, yassa sacchikiriyāhetu bhikkhū mayi brahmacariyaṃ caranti. Ime kho te, mahāli, dhammā uttaritarā ca paṇītatarā ca, yesaṃ sacchikiriyāhetu bhikkhū mayi brahmacariyaṃ carantī’’ti. ",
      "english": "“What then, venerable sir, are those more excellent and superior states, for the realization of which bhikkhus live the holy life under the Blessed One?”\n\n“Here, Mahāli, a bhikkhu, by the destruction of the three fetters, becomes a stream-enterer, no longer subject to downfall, certain of liberation, with enlightenment as his destination. This, Mahāli, is also a more excellent and superior state, for the realization of which bhikkhus live the holy life under me.\n\n“Furthermore, Mahāli, a bhikkhu, by the destruction of the three fetters and the attenuation of lust, hatred, and delusion, becomes a once-returner, who, having returned to this world just one more time, will make an end of suffering. This, Mahāli, is also a more excellent and superior state, for the realization of which bhikkhus live the holy life under me.\n\n“Furthermore, Mahāli, a bhikkhu, by the destruction of the five lower fetters, becomes one who arises spontaneously, there to attain final Nibbāna, not liable to return from that world. This, Mahāli, is also a more excellent and superior state, for the realization of which bhikkhus live the holy life under me.\n\n“Furthermore, Mahāli, a bhikkhu, by the destruction of the taints, having realized for himself with direct knowledge and entered upon the taintless liberation of mind and liberation through wisdom in this very life, dwells therein. This, Mahāli, is also a more excellent and superior state, for the realization of which bhikkhus live the holy life under me.\n\n“These, Mahāli, are those more excellent and superior states, for the realization of which bhikkhus live the holy life under me.”",
      "sinhala": "ස්වාමීනි, භික්‍ෂූන් භාග්‍යවතුන් වහන්සේ කෙරෙහි බඹසර හැසිරෙන්නේ යම් ධර්මයන් ප්‍රත්‍යක්‍ෂ කිරීම පිණිසද, ඒ උසස් වූද, ප්‍රණීත වූද ධර්ම කවරේද?\n\nමහාලී, මෙහිලා භික්‍ෂුවක් තෙරසාංයෝජන කෙලෙසීමෙන් සොවාන් වේ. ඔහු විනාශයට නොපැමිණෙන ස්වභාවයෙන් යුක්තය, නියතය, සම්බෝධිය පරමායනය කොට ඇත්තෙකි. මහාලී, භික්‍ෂූන් මා කෙරෙහි බඹසර හැසිරෙන්නේ යම් ධර්මයක් ප්‍රත්‍යක්‍ෂ කිරීම පිණිසද, මෙයද ඒ උසස් වූද, ප්‍රණීත වූද ධර්මයකි.\n\nතවද, මහාලී, භික්‍ෂුවක් තෙරසාංයෝජන කෙලෙසීමෙන්ද, රාග, ද්වේෂ, මෝහ යන ධර්මයන්ගේ තුනී වීමෙන්ද සකෘදාගාමී වේ. ඔහු එක් වරක් පමණක් මේ ලෝකයට පැමිණ දුක කෙළවර කරයි. මහාලී, භික්‍ෂූන් මා කෙරෙහි බඹසර හැසිරෙන්නේ යම් ධර්මයක් ප්‍රත්‍යක්‍ෂ කිරීම පිණිසද, මෙයද ඒ උසස් වූද, ප්‍රණීත වූද ධර්මයකි.\n\nතවද, මහාලී, භික්‍ෂුවක් පංච ඕරම්භාගීය සංයෝජන කෙලෙසීමෙන් ඕපපාතිකව උපදී. ඔහු එහිදී පිරිනිවන් පාන්නේය, ඒ ලෝකයෙන් ආපසු නොඑන ස්වභාවයෙන් යුක්තය. මහාලී, භික්‍ෂූන් මා කෙරෙහි බඹසර හැසිරෙන්නේ යම් ධර්මයක් ප්‍රත්‍යක්‍ෂ කිරීම පිණිසද, මෙයද ඒ උසස් වූද, ප්‍රණීත වූද ධර්මයකි.\n\nතවද, මහාලී, භික්‍ෂුවක් ආශ්‍රවයන් ක්ෂය කිරීමෙන්, ආශ්‍රව රහිත චේතෝවිමුක්තිය හා ප්‍රඥා විමුක්තිය මෙලොවදීම තමා විසින්ම අභිඥා ඥානයෙන් ප්‍රත්‍යක්‍ෂ කොට සාක්‍ෂාත් කරගෙන වාසය කරයි. මහාලී, භික්‍ෂූන් මා කෙරෙහි බඹසර හැසිරෙන්නේ යම් ධර්මයක් ප්‍රත්‍යක්‍ෂ කිරීම පිණිසද, මෙයද ඒ උසස් වූද, ප්‍රණීත වූද ධර්මයකි.\n\nමහාලී, භික්‍ෂූන් මා කෙරෙහි බඹසර හැසිරෙන්නේ යම් ධර්මයන් ප්‍රත්‍යක්‍ෂ කිරීම පිණිසද, ඒ උසස් වූද, ප්‍රණීත වූද ධර්ම මේවාය.",
      "paliTitle": "Catuariyaphalaṃ",
      "englishTitle": "The Four Noble Fruits",
      "sinhalaTitle": "සතර ආර්ය ඵල"
    },
    {
      "number": 374,
      "pali": "‘‘Atthi pana, bhante, maggo atthi paṭipadā etesaṃ dhammānaṃ sacchikiriyāyā’’ti? ‘‘Atthi kho, mahāli, maggo atthi paṭipadā etesaṃ dhammānaṃ sacchikiriyāyā’’ti.",
      "english": "“Is there, Venerable Sir, a path, is there a practice for the direct realization of these phenomena?”\n“There is, Mahāli, a path, there is a practice for the direct realization of these phenomena.”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, මේ ධර්මයන් ප්‍රත්‍යක්ෂ කිරීම පිණිස මාර්ගයක් තිබේද, ප්‍රතිපදාවක් තිබේද?\nමහාලී, සැබවින්ම මේ ධර්මයන් ප්‍රත්‍යක්ෂ කිරීම පිණිස මාර්ගයක් තිබේ, ප්‍රතිපදාවක් තිබේ.",
      "paliTitle": "Ariyaaṭṭhaṅgikamaggo",
      "englishTitle": "The Noble Eightfold Path",
      "sinhalaTitle": "ආර්ය අෂ්ටාංගික මාර්ගය"
    },
    {
      "number": 375,
      "pali": "‘‘Katamo pana, bhante, maggo katamā paṭipadā etesaṃ dhammānaṃ sacchikiriyāyā’’ti? ‘‘Ayameva ariyo aṭṭhaṅgiko maggo. Seyyathidaṃ – sammādiṭṭhi sammāsaṅkappo sammāvācā sammākammanto sammāājīvo sammāvāyāmo sammāsati sammāsamādhi. Ayaṃ kho, mahāli, maggo ayaṃ paṭipadā etesaṃ dhammānaṃ sacchikiriyāya.",
      "english": "\"What then, venerable sir, is the path, what is the way for the realization of these phenomena?\"\n\n\"This indeed is the Noble Eightfold Path. That is to say: Right View, Right Intention, Right Speech, Right Action, Right Livelihood, Right Effort, Right Mindfulness, Right Concentration. This, Mahāli, is the path, this is the way for the realization of these phenomena.\"",
      "sinhala": "භාග්‍යවතුන් වහන්ස, එසේනම් මේ ධර්මයන් සාක්ෂාත් කිරීම සඳහා මාර්ගය කුමක්ද, ප්‍රතිපදාව කුමක්ද? මේ ආර්ය අෂ්ටාංගික මාර්ගයයි. එනම්, සම්මා දිට්ඨි, සම්මා සංකප්ප, සම්මා වාචා, සම්මා කම්මන්ත, සම්මා ආජීව, සම්මා වායාම, සම්මා සති, සම්මා සමාධි යනුයි. මහාලි, මේ ධර්මයන් සාක්ෂාත් කර ගැනීම සඳහා මේ මාර්ගයයි, මේ ප්‍රතිපදාවයි.",
      "paliTitle": ""
    },
    {
      "number": 376,
      "pali": "‘‘Ekamidāhaṃ, mahāli, samayaṃ kosambiyaṃ viharāmi ghositārāme. Atha kho dve pabbajitā – muṇḍiyo ca paribbājako jāliyo ca dārupattikantevāsī yenāhaṃ tenupasaṅkamiṃsu. Upasaṅkamitvā mayā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho te dve pabbajitā maṃ etadavocuṃ – ‘kiṃ nu kho, āvuso gotama, taṃ jīvaṃ taṃ sarīraṃ, udāhu aññaṃ jīvaṃ aññaṃ sarīra’nti?",
      "english": "Once, Mahāli, I was dwelling in Kosambī, at Ghosita's Park. Then, two ascetics, Muṇḍiya the wanderer and Jāliya, the disciple of Dārupattika, approached me. Having approached, they exchanged greetings with me. When the courteous and memorable exchange of pleasantries was concluded, they stood to one side. Standing to one side, those two ascetics said this to me: ‘Friend Gotama, is the soul the same as the body, or is the soul one thing and the body another?’",
      "sinhala": "මහාලි, එක සමයෙක්හි මම කොසඹෑ නුවර ඝෝසිතාරාමයේ වැඩසිටියෙමි. එකල්හි මුණ්ඩිය නම් පරිබ‍්‍රාජකයාද, දාරුපත්තිකගේ අතවැසි ජාලියද යන පැවිද්දන් දෙදෙනා මා වෙත පැමිණියාහුය. ඔවුහු මා වෙත පැමිණ මා සමඟ සතුටු සාකච්ඡා හා සිහිපත් කළ යුතු කතා පැවැත්වීමෙන් පසු එක්පසෙක සිටියාහුය. එක්පසෙක සිටි ඒ පැවිද්දන් දෙදෙනා මට මෙසේ කීවාහුය: ‘ආයුෂ්මත් ගෞතමය, ඒ ජීවයම ඒ ශරීරයද, නැතහොත් ජීවය වෙනස්ද ශරීරය වෙනස්ද?’",
      "paliTitle": "Dvepabbajitavatthu",
      "englishTitle": "Story of two monks",
      "sinhalaTitle": "දෙ පැවිද්දන්ගේ වස්තුව"
    },
    {
      "number": 377,
      "pali": "‘‘‘Tena hāvuso, suṇātha sādhukaṃ manasi karotha bhāsissāmī’’ti. ‘Evamāvuso’ti kho te dve pabbajitā mama paccassosuṃ. Ahaṃ etadavocaṃ – idhāvuso tathāgato loke uppajjati arahaṃ sammāsambuddho…pe… (yathā 190-212 anucchedesu evaṃ vitthāretabbaṃ). Evaṃ kho, āvuso, bhikkhu sīlasampanno hoti…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Yo kho, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ nu kho tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti? Yo so, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā, ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi evaṃ passāmi. Atha ca panāhaṃ na vadāmi – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Yo kho, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ nu kho tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti? Yo so, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi evaṃ passāmi. Atha ca panāhaṃ na vadāmi – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā…pe… ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti…pe… yo kho, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ nu kho tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti? Yo so, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ [na kallaṃ (sī. syā. kaṃ. ka.)] tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi evaṃ passāmi. Atha ca panāhaṃ na vadāmi – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā… pe… nāparaṃ itthattāyāti pajānāti. Yo kho, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ nu kho tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti? Yo so, āvuso, bhikkhu evaṃ jānāti evaṃ passati na kallaṃ tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi evaṃ passāmi. Atha ca panāhaṃ na vadāmi – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā’’ti. Idamavoca bhagavā. Attamano oṭṭhaddho licchavī bhagavato bhāsitaṃ abhinandīti. ",
      "english": "“Therefore, friends, listen attentively, pay close attention; I will speak.” “Yes, friend,” those two renunciants replied to me. I then said this: “Here, friends, a Tathāgata arises in the world, an Arahant, a Perfectly Self-Awakened One, accomplished in true knowledge and conduct, sublime, knower of worlds, unsurpassed leader of persons to be tamed, teacher of gods and humans, the Buddha, the Blessed One. He teaches the Dhamma, lovely in its beginning, lovely in its middle, lovely in its end, with the right meaning and the right phrasing. He proclaims a holy life that is entirely complete and perfectly pure.\n\n“Thus, friends, a monk becomes accomplished in virtue; he guards the doors of his senses; he is moderate in eating; he is devoted to wakefulness; he is possessed of mindfulness and clear comprehension; he resorts to a secluded lodging; he abandons the five hindrances and attains the first jhāna, which is accompanied by applied thought and sustained thought, born of seclusion, filled with rapture and happiness. Friends, for a monk who knows and sees in this way, is it appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’?” “Friends, for a monk who knows and sees in this way, it is appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’.” “Indeed, friends, I know and see this in this way. Yet, I do not say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another.’\n\n“Furthermore, with the fading away of applied thought and sustained thought, he attains the second jhāna, which is born of concentration, free from applied thought and sustained thought, and filled with rapture and happiness. Friends, for a monk who knows and sees in this way, is it appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’?” “Friends, for a monk who knows and sees in this way, it is appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’.” “Indeed, friends, I know and see this in this way. Yet, I do not say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another.’\n\n“Furthermore, with the fading of rapture, he dwells in equanimity, mindful and clearly comprehending, and experiences happiness with the body; he attains the third jhāna, of which the noble ones declare: ‘He dwells happily with equanimity and mindfulness.’ Friends, for a monk who knows and sees in this way, is it appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’?” “Friends, for a monk who knows and sees in this way, it is appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’.” “Indeed, friends, I know and see this in this way. Yet, I do not say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another.’\n\n“Furthermore, with the abandonment of pleasure and pain, and with the previous disappearance of joy and grief, he attains the fourth jhāna, which is beyond pleasure and pain, and purified by equanimity and mindfulness. Friends, for a monk who knows and sees in this way, is it appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’?” “Friends, for a monk who knows and sees in this way, it is appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’.” “Indeed, friends, I know and see this in this way. Yet, I do not say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another.’\n\n“He directs and inclines his mind towards knowledge and vision. With the mind thus concentrated, purified, bright, unblemished, rid of imperfection, malleable, wieldy, steady, and attained to imperturbability, he directs it to the knowledge of the destruction of taints. He understands as it actually is: ‘This is suffering,’ he understands as it actually is: ‘This is the origin of suffering,’ he understands as it actually is: ‘This is the cessation of suffering,’ he understands as it actually is: ‘This is the path to the cessation of suffering.’ He understands as it actually is: ‘These are the taints,’ he understands as it actually is: ‘This is the origin of the taints,’ he understands as it actually is: ‘This is the cessation of the taints,’ he understands as it actually is: ‘This is the path to the cessation of the taints.’ Friends, for a monk who knows and sees in this way, is it appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’?” “Friends, for a monk who knows and sees in this way, it is not appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’.” “Indeed, friends, I know and see this in this way. Yet, I do not say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another.’\n\n“He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’ Friends, for a monk who knows and sees in this way, is it appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’?” “Friends, for a monk who knows and sees in this way, it is not appropriate for him to say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’.” “Indeed, friends, I know and see this in this way. Yet, I do not say: ‘The soul is the same as the body’ or ‘The soul is one thing, and the body is another’.”\n\nThe Blessed One said this. The Licchavis, delighted and exultant, rejoiced in the Blessed One’s words.",
      "sinhala": "‘‘එබැවින් ආයුෂ්මතුනි, හොඳින් අසන්න. හොඳින් මනසිකාර කරන්න. මම දේශනා කරන්නෙමි.’’\n“එසේය ආයුෂ්මතුනි” කියා ඒ පැවිද්දන් දෙදෙනා මට පිළිතුරු දුන්නාහුය.\nමම මෙසේ කීවෙමි:\n\n“මෙහිලා ආයුෂ්මතුනි, අරහත් වූ, සම්මාසම්බුද්ධ වූ තථාගතයන් වහන්සේ ලෝකයෙහි පහළ වෙත්. මෙසේ ආයුෂ්මතුනි, භික්ෂුව සීල සම්පන්න වෙයි. ඔහු පළමු ධ්‍යානයට පැමිණ වාසය කරයි.\n\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුද?\nආයුෂ්මතුනි, යම් ඒ භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුය.\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම නම් ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ නොකියමි.\n\nඔහු දෙවන ධ්‍යානයට පැමිණ වාසය කරයි.\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුද?\nආයුෂ්මතුනි, යම් ඒ භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුය.\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම නම් ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ නොකියමි.\n\nඔහු තෙවන ධ්‍යානයට පැමිණ වාසය කරයි.\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුද?\nආයුෂ්මතුනි, යම් ඒ භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුය.\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම නම් ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ නොකියමි.\n\nඔහු සතරවන ධ්‍යානයට පැමිණ වාසය කරයි.\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුද?\nආයුෂ්මතුනි, යම් ඒ භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුය.\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම නම් ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ නොකියමි.\n\nඔහු ඥාණදර්ශනය පිණිස සිත යොමු කරයි, නමාලයි.\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුද?\nආයුෂ්මතුනි, යම් ඒ භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න නොසුදුසුය.\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම නම් ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ නොකියමි.\n\nඔහු නැවත මේ භවයට නොඑන බව දනී.\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න සුදුසුද?\nආයුෂ්මතුනි, යම් ඒ භික්ෂුවක් මෙසේ දනීද, මෙසේ දකීද, ඔහුට ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ කියන්න නොසුදුසුය.\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම නම් ‘ඒකම ජීවය, ඒකම ශරීරය’ යැයි හෝ ‘වෙනත් ජීවය, වෙනත් ශරීරය’ යැයි හෝ නොකියමි.’’\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු වූ, ප්‍රීතිමත් වූ ලිච්ඡවී කුමාරයා භාග්‍යවතුන් වහන්සේගේ වචනය අගය කළේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Mahālisuttaṃ niṭṭhitaṃ chaṭṭhaṃ.",
    "english": "The Sixth Mahāli Sutta Concluded",
    "sinhala": "හයවන මහාලි සූත්‍රය නිමයි."
  }
}