{
  "id": "dn11",
  "title": {
    "pali": "Kevaṭṭasuttaṃ",
    "english": "The Kevaṭṭa Sutta",
    "sinhala": "කේවට්ටසූත්‍රය"
  },
  "sections": [
    {
      "number": 481,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā nāḷandāyaṃ viharati pāvārikambavane. Atha kho kevaṭṭo gahapatiputto yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho kevaṭṭo gahapatiputto bhagavantaṃ etadavoca – ‘‘ayaṃ, bhante, nāḷandā iddhā ceva phītā ca bahujanā ākiṇṇamanussā bhagavati abhippasannā. Sādhu, bhante, bhagavā ekaṃ bhikkhuṃ samādisatu, yo uttarimanussadhammā, iddhipāṭihāriyaṃ karissati; evāyaṃ nāḷandā bhiyyoso mattāya bhagavati abhippasīdissatī’’ti. Evaṃ vutte, bhagavā kevaṭṭaṃ gahapatiputtaṃ etadavoca – ‘‘na kho ahaṃ, kevaṭṭa, bhikkhūnaṃ evaṃ dhammaṃ desemi – etha tumhe, bhikkhave, gihīnaṃ odātavasanānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ karothā’’ti.",
      "english": "Thus have I heard: On one occasion the Blessed One was staying in Nāḷandā, in Pāvārika's Mango Grove. Then Kevaṭṭa the householder's son approached the Blessed One; having approached and paid homage to the Blessed One, he sat down to one side. As he sat to one side, Kevaṭṭa the householder's son said to the Blessed One: \"This Nāḷandā, venerable sir, is prosperous and thriving, populous and crowded with people, and they have profound faith in the Blessed One. It would be good, venerable sir, if the Blessed One would instruct one monk to perform a superhuman feat of psychic power; in this way, Nāḷandā would have even greater faith in the Blessed One.\"\n\nWhen this was said, the Blessed One said to Kevaṭṭa the householder's son: \"Kevaṭṭa, I do not teach the monks the Dhamma in this way: 'Come, monks, perform a superhuman feat of psychic power for householders who wear white clothes.'\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් කලෙක භාග්‍යවතුන් වහන්සේ නාළන්දාවේ පාවාරික අඹ වනයේ වැඩසිටින සේක. ඉක්බිති කේවට්ට ගහපති පුත්‍රයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට ආචාර කොට එක් පසෙක වාඩි විය.\n\nඑක් පසෙක වාඩි වී සිටි කේවට්ට ගහපති පුත්‍රයා භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ස්වාමීනි, මේ නාළන්දාව සමෘද්ධිමත්ය, සශ්‍රීක ය. බොහෝ ජනයාගෙන් පිරී පවතී. භාග්‍යවතුන් වහන්සේ කෙරෙහි බොහෝ සෙයින් පැහැදී සිටිති. එසේය, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ එක් භික්‍ෂූන් වහන්සේ නමකට අණ දෙන සේක්වා, යමෙක් උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඍද්ධි ප්‍රාතිහාර්යයක් කරනු ඇත; එවිට මේ නාළන්දාව වඩාත් අධික ලෙස භාග්‍යවතුන් වහන්සේ කෙරෙහි පැහැදෙනු ඇත.\"\n\nමෙසේ කී කල්හි, භාග්‍යවතුන් වහන්සේ කේවට්ට ගහපති පුත්‍රයාට මෙසේ වදාළ සේක: \"කේවට්ටය, මම භික්‍ෂූන්ට මෙවන් ධර්මයක් දේශනා නොකරමි – 'මහණෙනි, ගිහියන් වන සුදු වස්ත්‍රධාරීන්ට උත්තරීතර මනුෂ්‍ය ධර්මයක් වූ ඍද්ධි ප්‍රාතිහාර්යයක් කරව' කියා.\"",
      "paliTitle": "Kevaṭṭagahapatiputtavatthu",
      "englishTitle": "Story of Kevaṭṭa, the Householder's Son",
      "sinhalaTitle": "කේවට්ට ගහපති පුත‍්‍ර වස්‍තුව"
    },
    {
      "number": 482,
      "pali": "Dutiyampi kho kevaṭṭo gahapatiputto bhagavantaṃ etadavoca – ‘‘nāhaṃ, bhante, bhagavantaṃ dhaṃsemi; api ca, evaṃ vadāmi – ‘ayaṃ, bhante, nāḷandā iddhā ceva phītā ca bahujanā ākiṇṇamanussā bhagavati abhippasannā. Sādhu, bhante, bhagavā ekaṃ bhikkhuṃ samādisatu, yo uttarimanussadhammā iddhipāṭihāriyaṃ karissati; evāyaṃ nāḷandā bhiyyoso mattāya bhagavati abhippasīdissatī’’’ti. Dutiyampi kho bhagavā kevaṭṭaṃ gahapatiputtaṃ etadavoca – ‘‘na kho ahaṃ, kevaṭṭa, bhikkhūnaṃ evaṃ dhammaṃ desemi – etha tumhe, bhikkhave, gihīnaṃ odātavasanānaṃ uttarimanussadhammā iddhipāṭihāriyaṃ karothā’’’ti. Tatiyampi kho kevaṭṭo gahapatiputto bhagavantaṃ etadavoca – ‘‘nāhaṃ, bhante, bhagavantaṃ dhaṃsemi; api ca, evaṃ vadāmi – ‘ayaṃ, bhante, nāḷandā iddhā ceva phītā ca bahujanā ākiṇṇamanussā bhagavati abhippasannā. Sādhu, bhante, bhagavā ekaṃ bhikkhuṃ samādisatu, yo uttarimanussadhammā iddhipāṭihāriyaṃ karissati. Evāyaṃ nāḷandā bhiyyoso mattāya bhagavati abhippasīdissatī’ti. ",
      "english": "For a second time, Kevatta the householder’s son said to the Blessed One: “Venerable sir, I do not slander the Blessed One; but rather, I say this: ‘Venerable sir, this Nāḷandā is prosperous and flourishing, with many people and crowded with humanity, and they are greatly devoted to the Blessed One. It would be good, Venerable sir, if the Blessed One would instruct a monk to perform a miracle of superhuman power; in this way, Nāḷandā would become even more devoted to the Blessed One.’”\n\nFor a second time, the Blessed One said to Kevatta the householder’s son: “Indeed, Kevatta, I do not teach the Dhamma to monks in this way: ‘Come, monks, perform a miracle of superhuman power for householders dressed in white.’”\n\nFor a third time, Kevatta the householder’s son said to the Blessed One: “Venerable sir, I do not slander the Blessed One; but rather, I say this: ‘Venerable sir, this Nāḷandā is prosperous and flourishing, with many people and crowded with humanity, and they are greatly devoted to the Blessed One. It would be good, Venerable sir, if the Blessed One would instruct a monk to perform a miracle of superhuman power; in this way, Nāḷandā would become even more devoted to the Blessed One.’”",
      "sinhala": "දෙවන වරටත් කේවට්ට ගෘහපති පුත්‍රයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය: ‘‘භාග්‍යවතුන් වහන්ස, මම භාග්‍යවතුන් වහන්සේට අවලාද කරන්නේ නැත; එහෙත් මම මෙසේ කියමි – ‘භාග්‍යවතුන් වහන්ස, මේ නාලන්දා නගරය සශ්‍රීක වූද, සම්පත් බහුල වූද, බොහෝ ජනයාගෙන් පිරුණුද, භාග්‍යවතුන් වහන්සේ කෙරෙහි ඉතා ප්‍රසන්න වූද තැනකි. භාග්‍යවතුන් වහන්ස, යහපති, භාග්‍යවතුන් වහන්සේ එක් භික්ෂුවකට නියෝග කරන සේක්වා, යම් කෙනෙක් උත්තරිමනුස්ස ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් කරන්නේ නම්; මෙසේ මේ නාලන්දා නගරය පෙරට වඩා අතිශයින් භාග්‍යවතුන් වහන්සේ කෙරෙහි ඉතා ප්‍රසන්න වනු ඇතැයි’’.\n\nදෙවන වරටත් භාග්‍යවතුන් වහන්සේ කේවට්ට ගෘහපති පුත්‍රයාට මෙසේ පැවසූ සේක – ‘‘කේවට්ටය, මම භික්ෂූන්ට මෙවන් ධර්මයක් දේශනා නොකරමි – ‘එව, මහණෙනි, නුඹලා ගිහියන්ට, සුදු වස්ත්‍ර ඇඳ සිටින්නන්ට උත්තරිමනුස්ස ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් කරව්’’’ කියායි.\n\nතුන්වන වරටත් කේවට්ට ගෘහපති පුත්‍රයා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – ‘‘භාග්‍යවතුන් වහන්ස, මම භාග්‍යවතුන් වහන්සේට අවලාද කරන්නේ නැත; එහෙත් මම මෙසේ කියමි – ‘භාග්‍යවතුන් වහන්ස, මේ නාලන්දා නගරය සශ්‍රීක වූද, සම්පත් බහුල වූද, බොහෝ ජනයාගෙන් පිරුණුද, භාග්‍යවතුන් වහන්සේ කෙරෙහි ඉතා ප්‍රසන්න වූද තැනකි. භාග්‍යවතුන් වහන්ස, යහපති, භාග්‍යවතුන් වහන්සේ එක් භික්ෂුවකට නියෝග කරන සේක්වා, යම් කෙනෙක් උත්තරිමනුස්ස ධර්මයක් වන ඍද්ධි ප්‍රාතිහාර්යයක් කරන්නේ නම්. මෙසේ මේ නාලන්දා නගරය පෙරට වඩා අතිශයින් භාග්‍යවතුන් වහන්සේ කෙරෙහි ඉතා ප්‍රසන්න වනු ඇතැයි’.",
      "paliTitle": ""
    },
    {
      "number": 483,
      "pali": "‘‘Tīṇi kho imāni, kevaṭṭa, pāṭihāriyāni mayā sayaṃ abhiññā sacchikatvā paveditāni. Katamāni tīṇi? Iddhipāṭihāriyaṃ, ādesanāpāṭihāriyaṃ, anusāsanīpāṭihāriyaṃ.",
      "english": "Kevaṭṭa, these three marvels have been declared by me, having myself directly known andized them. Which three? The marvel of psychic power, the marvel of telepathy, and the marvel of instruction.",
      "sinhala": "කේවට්ටය, මා විසින් තමාගේම අභිඥා ඥානයෙන් ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරන ලද මේ ප්‍රාතිහාර්යයන් තුනක් ඇත. ඒ තුන කවරේද? ඍද්ධි ප්‍රාතිහාර්යය, ආදේශනා ප්‍රාතිහාර්යය, අනුශාසනී ප්‍රාතිහාර්යය යන ඒවාය.",
      "paliTitle": "Iddhipāṭihāriyaṃ",
      "englishTitle": "Psychic Power Miracle",
      "sinhalaTitle": "ඉද්ධි ප්‍රාතිහාර්යය"
    },
    {
      "number": 484,
      "pali": "‘‘Katamañca, kevaṭṭa, iddhipāṭihāriyaṃ? Idha, kevaṭṭa, bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti. Ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karoti seyyathāpi udake; udakepi abhijjamāne gacchati seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃ mahiddhike evaṃ mahānubhāve pāṇinā parāmasati parimajjati; yāva brahmalokāpi kāyena vasaṃ vatteti. ‘‘Tamenaṃ aññataro saddho pasanno passati taṃ bhikkhuṃ anekavihitaṃ iddhividhaṃ paccanubhontaṃ – ekopi hutvā bahudhā hontaṃ, bahudhāpi hutvā eko hontaṃ; āvibhāvaṃ tirobhāvaṃ; tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamānaṃ gacchantaṃ seyyathāpi ākāse; pathaviyāpi ummujjanimujjaṃ karontaṃ seyyathāpi udake; udakepi abhijjamāne gacchantaṃ seyyathāpi pathaviyaṃ; ākāsepi pallaṅkena kamantaṃ seyyathāpi pakkhī sakuṇo; imepi candimasūriye evaṃ mahiddhike evaṃ mahānubhāve pāṇinā parāmasantaṃ parimajjantaṃ yāva brahmalokāpi kāyena vasaṃ vattentaṃ. ‘‘Tamenaṃ so saddho pasanno aññatarassa assaddhassa appasannassa āroceti – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho, samaṇassa mahiddhikatā mahānubhāvatā. Amāhaṃ bhikkhuṃ addasaṃ anekavihitaṃ iddhividhaṃ paccanubhontaṃ – ekopi hutvā bahudhā hontaṃ, bahudhāpi hutvā eko hontaṃ…pe… yāva brahmalokāpi kāyena vasaṃ vattenta’nti. ‘‘Tamenaṃ so assaddho appasanno taṃ saddhaṃ pasannaṃ evaṃ vadeyya – ‘atthi kho, bho, gandhārī nāma vijjā. Tāya so bhikkhu anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti…pe… yāva brahmalokāpi kāyena vasaṃ vattetī’ti. ‘‘Taṃ kiṃ maññasi, kevaṭṭa, api nu so assaddho appasanno taṃ saddhaṃ pasannaṃ evaṃ vadeyyā’’ti? ‘‘Vadeyya, bhante’’ti. ‘‘Imaṃ kho ahaṃ, kevaṭṭa, iddhipāṭihāriye ādīnavaṃ sampassamāno iddhipāṭihāriyena aṭṭīyāmi harāyāmi jigucchāmi’’. ",
      "english": "And what, Kevaṭṭa, is the miracle of psychic power? Here, Kevaṭṭa, a monk experiences various kinds of psychic power: being one, he becomes many; being many, he becomes one. He appears and disappears; he goes unimpeded through walls, ramparts, and mountains as if through space. He dives in and out of the earth as if in water. He walks on water without sinking as if on land. He flies through the air cross-legged, like a winged bird. He touches and strokes even the moon and sun, so mighty and powerful, with his hand. He exercises bodily mastery even up to the Brahma world.\n\nThen some faithful and confident person sees that monk experiencing various kinds of psychic power: being one, he becomes many; being many, he becomes one. He appears and disappears. He goes unimpeded through walls, ramparts, and mountains as if through space. He dives in and out of the earth as if in water. He walks on water without sinking as if on land. He flies through the air cross-legged, like a winged bird. He touches and strokes even the moon and sun, so mighty and powerful, with his hand, and he exercises bodily mastery even up to the Brahma world.\n\nThen that faithful and confident person tells another person, who is faithless and unconfident, saying, 'It is truly wonderful, friend! It is truly amazing, friend! The psychic power and great might of that ascetic! I saw that monk experiencing various kinds of psychic power: being one, he became many; being many, he became one; he appeared and disappeared; he went unimpeded through walls, ramparts, and mountains as if through space; he dived in and out of the earth as if in water; he walked on water without sinking as if on land; he flew through the air cross-legged, like a winged bird; he touched and stroked even the moon and sun, so mighty and powerful, with his hand; and he exercised bodily mastery even up to the Brahma world.'\n\nThen that faithless and unconfident person would say to that faithful and confident person, 'Friend, there is a certain magic spell called Gandhārī. By means of that, the monk experiences various kinds of psychic power: being one, he becomes many; being many, he becomes one; he appears and disappears; he goes unimpeded through walls, ramparts, and mountains as if through space; he dives in and out of the earth as if in water; he walks on water without sinking as if on land; he flies through the air cross-legged, like a winged bird; he touches and strokes even the moon and sun, so mighty and powerful, with his hand; and he exercises bodily mastery even up to the Brahma world.'\n\n'What do you think, Kevaṭṭa? Would that faithless and unconfident person say that to that faithful and confident person?' 'Yes, Venerable Sir, he would,' Kevaṭṭa replied. 'Kevaṭṭa, it is seeing this drawback in the miracle of psychic power that I am vexed by it, ashamed of it, and disgusted by it.'",
      "sinhala": "කේවට්ටය, ඍද්ධි ප්‍රාතිහාර්යය යනු කවරේද? කේවට්ටය, මෙහිලා භික්ෂුවක් නොයෙක් ආකාර වූ ඍද්ධි විධයන් අනුභව කරයි. එක් අයෙක්ව සිට බොහෝ අය වේ; බොහෝ අයව සිට එක් අයෙක් වේ; අහසේ මෙන් බිත්ති, පවුරු, කඳු හරහා නොගැටී අතුරුදහන් වී නැවත ප්‍රකට වේ; ජලයෙහි මෙන් පොළොවෙහි කිමිදීම්, මතුවීම් කරයි; පොළොවෙහි මෙන් ජලයෙහි නොගිලී ගමන් කරයි; පක්ෂියෙකු මෙන් අහසෙහි පලක් බැඳ ගමන් කරයි; මෙබඳු මහත් ඍද්ධි ඇති, මහත් අනුභාව ඇති චන්ද්‍රයා සහ සූර්යයා පවා අතින් පිරිමැද, අතගායි; බඹලොව දක්වා පවා ශරීරයෙන් වශය පවත්වයි.\n\nඑකල්හි යම් ශ්‍රද්ධා සම්පන්න, ප්‍රසන්න පුද්ගලයෙක් ඒ භික්ෂුව නොයෙක් ආකාර වූ ඍද්ධි විධයන් අනුභව කරන අයුරු දකී. එනම්: එක් අයෙක්ව සිට බොහෝ අය වන අයුරු, බොහෝ අයව සිට එක් අයෙක් වන අයුරු; අතුරුදහන් වී නැවත ප්‍රකට වන අයුරු; අහසේ මෙන් බිත්ති, පවුරු, කඳු හරහා නොගැටී ගමන් කරන අයුරු; ජලයෙහි මෙන් පොළොවෙහි කිමිදීම්, මතුවීම් කරන අයුරු; පොළොවෙහි මෙන් ජලයෙහි නොගිලී ගමන් කරන අයුරු; පක්ෂියෙකු මෙන් අහසෙහි පලක් බැඳ ගමන් කරන අයුරු; මෙබඳු මහත් ඍද්ධි ඇති, මහත් අනුභාව ඇති චන්ද්‍රයා සහ සූර්යයා පවා අතින් පිරිමැද, අතගාමින් බඹලොව දක්වා පවා ශරීරයෙන් වශය පවත්වන අයුරු දකී.\n\nඑවිට ඒ ශ්‍රද්ධාවන්ත, ප්‍රසන්න පුද්ගලයා යම්කිසි අශ්‍රද්ධාවන්ත, අප්‍රසන්න පුද්ගලයෙකුට මෙසේ කියයි: ‘අහෝ ස්වාමීනි, පුදුම සහගතය! අහෝ ස්වාමීනි, ආශ්චර්යයකි! ශ්‍රමණයන් වහන්සේගේ මහත් ඍද්ධිය සහ මහත් අනුභාවය! මම භික්ෂුවක් දුටුවෙමි, නොයෙක් ආකාර වූ ඍද්ධි විධයන් අනුභව කරන – එක් අයෙක්ව සිට බොහෝ අය වන, බොහෝ අයව සිට එක් අයෙක් වන… ආදී වශයෙන්… බඹලොව දක්වා පවා ශරීරයෙන් වශය පවත්වන.’\n\nඑවිට ඒ අශ්‍රද්ධාවන්ත, අප්‍රසන්න පුද්ගලයා ඒ ශ්‍රද්ධාවන්ත, ප්‍රසන්න පුද්ගලයාට මෙසේ කියයි: ‘ස්වාමීනි, ගාන්ධාරී නම් වූ විද්‍යාවක් ඇත. ඒ විද්‍යාව නිසා ඒ භික්ෂුව නොයෙක් ආකාර වූ ඍද්ධි විධයන් අනුභව කරයි – එක් අයෙක්ව සිට බොහෝ අය වේ, බොහෝ අයව සිට එක් අයෙක් වේ… ආදී වශයෙන්… බඹලොව දක්වා පවා ශරීරයෙන් වශය පවත්වයි.’\n\n‘කේවට්ටය, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? ඒ අශ්‍රද්ධාවන්ත, අප්‍රසන්න පුද්ගලයා ඒ ශ්‍රද්ධාවන්ත, ප්‍රසන්න පුද්ගලයාට මෙසේ කියන්නේද?’ ‘එසේ කියන්නේය, ස්වාමීනි.’ ‘කේවට්ටය, ඍද්ධි ප්‍රාතිහාර්යයෙහි මේ ආදීනවය මනාව දකිමින් මම ඍද්ධි ප්‍රාතිහාර්යය ගැන කලකිරෙමි, ලජ්ජා වෙමි, පිළිකුල් කරමි.’",
      "paliTitle": ""
    },
    {
      "number": 485,
      "pali": "‘‘Katamañca, kevaṭṭa, ādesanāpāṭihāriyaṃ? Idha, kevaṭṭa, bhikkhu parasattānaṃ parapuggalānaṃ cittampi ādisati, cetasikampi ādisati, vitakkitampi ādisati, vicāritampi ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’nti. ‘‘Tamenaṃ aññataro saddho pasanno passati taṃ bhikkhuṃ parasattānaṃ parapuggalānaṃ cittampi ādisantaṃ, cetasikampi ādisantaṃ, vitakkitampi ādisantaṃ, vicāritampi ādisantaṃ – ‘evampi te mano, itthampi te mano, itipi te citta’nti. Tamenaṃ so saddho pasanno aññatarassa assaddhassa appasannassa āroceti – ‘acchariyaṃ vata, bho, abbhutaṃ vata, bho, samaṇassa mahiddhikatā mahānubhāvatā. Amāhaṃ bhikkhuṃ addasaṃ parasattānaṃ parapuggalānaṃ cittampi ādisantaṃ, cetasikampi ādisantaṃ, vitakkitampi ādisantaṃ, vicāritampi ādisantaṃ – ‘‘evampi te mano, itthampi te mano, itipi te citta’’’nti. ‘‘Tamenaṃ so assaddho appasanno taṃ saddhaṃ pasannaṃ evaṃ vadeyya – ‘atthi kho, bho, maṇikā nāma vijjā; tāya so bhikkhu parasattānaṃ parapuggalānaṃ cittampi ādisati, cetasikampi ādisati, vitakkitampi ādisati, vicāritampi ādisati – ‘evampi te mano, itthampi te mano, itipi te citta’’’nti. ‘‘Taṃ kiṃ maññasi, kevaṭṭa, api nu so assaddho appasanno taṃ saddhaṃ pasannaṃ evaṃ vadeyyā’’ti? ‘‘Vadeyya, bhante’’ti. ‘‘Imaṃ kho ahaṃ, kevaṭṭa, ādesanāpāṭihāriye ādīnavaṃ sampassamāno ādesanāpāṭihāriyena aṭṭīyāmi harāyāmi jigucchāmi’’. ",
      "english": "And what, Kevatta, is the miracle of telepathy? Here, Kevatta, a monastic declares the mind of other beings, of other individuals; he declares their mental states; he declares their thoughts; he declares their reflections – 'Such is your mind, such is your frame of mind, such is your consciousness.'\n\nThen a certain faithful and confident person sees that monastic declaring the mind of other beings, of other individuals; declaring their mental states; declaring their thoughts; declaring their reflections – 'Such is your mind, such is your frame of mind, such is your consciousness.' That faithful and confident person then reports it to a certain unfaithful and unconvinced person, saying: 'Indeed, sir, it is wonderful! Indeed, sir, it is amazing! Such is the great power and great might of that ascetic! I saw that monastic declaring the mind of other beings, of other individuals; declaring their mental states; declaring their thoughts; declaring their reflections – \"Such is your mind, such is your frame of mind, such is your consciousness.\"'\n\nThen that unfaithful and unconvinced person might say to that faithful and confident person: 'Indeed, sir, there is a certain charm called Māṇikā; by means of it, that monastic declares the mind of other beings, of other individuals; declares their mental states; declares their thoughts; declares their reflections – \"Such is your mind, such is your frame of mind, such is your consciousness.\"'\n\nWhat do you think, Kevatta? Might that unfaithful and unconvinced person say that to that faithful and confident person?\n\n'He might, venerable sir,' he replies.\n\nSeeing this danger in the miracle of telepathy, Kevatta, I am repulsed by, ashamed of, and disgusted with the miracle of telepathy.",
      "sinhala": "කේවට්ට, ආදේසනා ප්‍රාතිහාර්යය යනු කුමක්ද? කේවට්ට, මෙහි භික්ෂුවක් අන් සතුන්ගේ සහ අන් පුද්ගලයන්ගේ සිත් ද, චෛතසිකයන් ද, විතර්කයන් ද, විචාරයන් ද මෙසේ දේශනා කරයි – ‘ඔබේ සිත මෙසේ ය, මෙසේ ද ඔබ සිතා ඇත, මෙවැනි සිතක් ඔබට ඇත’ කියා. එවිට යම්කිසි ශ්‍රද්ධාවන්ත, පැහැදුණු අයෙක්, අන් සතුන්ගේ සහ අන් පුද්ගලයන්ගේ සිත් ද, චෛතසිකයන් ද, විතර්කයන් ද, විචාරයන් ද ‘ඔබේ සිත මෙසේ ය, මෙසේ ද ඔබ සිතා ඇත, මෙවැනි සිතක් ඔබට ඇත’ යැයි දේශනා කරන ඒ භික්ෂුව දකී. ඒ ශ්‍රද්ධාවන්ත, පැහැදුණු තැනැත්තා අශ්‍රද්ධාවන්ත, නොපැහැදුණු තවත් කෙනෙකුට මෙසේ කියයි – ‘ඇවැත්නි, ආශ්චර්යයකි! ඇවැත්නි, පුදුම සහගතය! මේ ශ්‍රමණයන් වහන්සේගේ මහා ඉර්ධිමත්භාවය, මහා ආනුභාවය. මම අන් සතුන්ගේ සහ අන් පුද්ගලයන්ගේ සිත් ද, චෛතසිකයන් ද, විතර්කයන් ද, විචාරයන් ද ‘ඔබේ සිත මෙසේ ය, මෙසේ ද ඔබ සිතා ඇත, මෙවැනි සිතක් ඔබට ඇත’ යැයි දේශනා කරන භික්ෂුවක් දුටුවෙමි’ කියා. එවිට ඒ අශ්‍රද්ධාවන්ත, නොපැහැදුණු තැනැත්තා ඒ ශ්‍රද්ධාවන්ත, පැහැදුණු තැනැත්තාට මෙසේ කියයි – ‘ඇවැත්නි, මැණිකා නම් වූ විද්‍යාවක් ඇත; ඒ විද්‍යාවෙන් ඒ භික්ෂුව අන් සතුන්ගේ සහ අන් පුද්ගලයන්ගේ සිත් ද, චෛතසිකයන් ද, විතර්කයන් ද, විචාරයන් ද ‘ඔබේ සිත මෙසේ ය, මෙසේ ද ඔබ සිතා ඇත, මෙවැනි සිතක් ඔබට ඇත’ යැයි දේශනා කරයි’ කියා. කේවට්ට, ඔබ මේ කුමක් සිතන්නෙහි ද? ඒ අශ්‍රද්ධාවන්ත, නොපැහැදුණු තැනැත්තා, ඒ ශ්‍රද්ධාවන්ත, පැහැදුණු තැනැත්තාට එසේ කියන්නේ නැද්ද? කියන්නේය, ස්වාමීනි. කේවට්ට, ආදේසනා ප්‍රාතිහාර්යයේ ඇති මේ ආදීනවය මනාව දකිමින් මම ආදේසනා ප්‍රාතිහාර්යයෙන් පිළිකුල් කරමි, ලැජ්ජා වෙමි, ගැරහීමි.",
      "paliTitle": "Ādesanāpāṭihāriyaṃ",
      "englishTitle": "Miracle of Revelation",
      "sinhalaTitle": "ආදේශනා ප‍්‍රාතිහාර්යය"
    },
    {
      "number": 486,
      "pali": "‘‘Katamañca, kevaṭṭa, anusāsanīpāṭihāriyaṃ? Idha, kevaṭṭa, bhikkhu evamanusāsati – ‘evaṃ vitakketha, mā evaṃ vitakkayittha, evaṃ manasikarotha, mā evaṃ manasākattha, idaṃ pajahatha, idaṃ upasampajja viharathā’ti. Idaṃ vuccati, kevaṭṭa, anusāsanīpāṭihāriyaṃ. ‘‘Puna caparaṃ, kevaṭṭa, idha tathāgato loke uppajjati arahaṃ sammāsambuddho …pe… (yathā 190-212 anucchedesu evaṃ vitthāretabbaṃ). Evaṃ kho, kevaṭṭa, bhikkhu sīlasampanno hoti…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Idampi vuccati, kevaṭṭa, anusāsanīpāṭihāriyaṃ…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Idampi vuccati, kevaṭṭa, anusāsanīpāṭihāriyaṃ…pe… ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti…pe… idampi vuccati, kevaṭṭa, anusāsanīpāṭihāriyaṃ…pe… nāparaṃ itthattāyāti pajānāti…pe… idampi vuccati, kevaṭṭa, anusāsanīpāṭihāriyaṃ. ‘‘Imāni kho, kevaṭṭa, tīṇi pāṭihāriyāni mayā sayaṃ abhiññā sacchikatvā paveditāni’’.",
      "english": "“And what, Kevatta, is the miracle of instruction? Here, Kevatta, a monk thus instructs: ‘Think in this way, do not think in that way; pay attention in this way, do not pay attention in that way; abandon this, cultivate and dwell in this.’ This, Kevatta, is called the miracle of instruction.\n\nFurthermore, Kevatta, here a Tathāgata, an Arahant, a Fully Enlightened One, arises in the world. He teaches the Dhamma, and a monk, following his instruction, becomes accomplished in virtue, and by progressively abandoning hindrances and cultivating concentration, enters upon and dwells in the first meditative absorption. This too, Kevatta, is called the miracle of instruction. By progressively developing deeper states of concentration, he enters upon and dwells in the second meditative absorption, then the third meditative absorption, and then the fourth meditative absorption. This too, Kevatta, is called the miracle of instruction. He directs and inclines his mind to knowledge and vision, thereby realizing the ultimate truths. This too, Kevatta, is called the miracle of instruction. He understands: ‘There is no further state of being for me.’ This too, Kevatta, is called the miracle of instruction.\n\nThese three miracles, Kevatta, have been made known by me, having realized them directly through supernormal knowledge.",
      "sinhala": "කේවට්ටයෙනි, අනුශාසනී ප්‍රාතිහාර්යය යනු කුමක්ද? කේවට්ටයෙනි, මෙහි භික්ෂුවක් මෙසේ අනුශාසනා කරයි: ‘මෙසේ සිතන්න, මෙසේ නොසිතන්න; මෙසේ මෙනෙහි කරන්න, මෙසේ මෙනෙහි නොකරන්න; මෙය අත්හරින්න, මෙය උපදවාගෙන වාසය කරන්න’ කියා. කේවට්ටයෙනි, මෙය අනුශාසනී ප්‍රාතිහාර්යය යැයි කියනු ලැබේ. කේවට්ටයෙනි, තවද මෙහි රහත් වූ, සම්මා සම්බුද්ධ වූ තථාගතයන් වහන්සේ ලෝකයේ පහළ වෙති. උන්වහන්සේ ධර්මය දේශනා කරමින්, විනය පනවමින් අනුශාසනා කරන සේක. කේවට්ටයෙනි, එසේ වටහාගෙන, භික්ෂුව සීලයෙන් සම්පූර්ණ වී, ඉන්ද්‍රිය සංවරය, සිහිනුවණ වැනි ගුණධර්ම පුරා, කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව විතර්ක විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීති සුඛයෙන් යුක්ත වූ පළමු ධ්‍යානයට පැමිණ වාසය කරයි. කේවට්ටයෙනි, මෙයද අනුශාසනී ප්‍රාතිහාර්යය යැයි කියනු ලැබේ. තවද භික්ෂුව දෙවන ධ්‍යානයට පැමිණ වාසය කරයි. කේවට්ටයෙනි, මෙයද අනුශාසනී ප්‍රාතිහාර්යය යැයි කියනු ලැබේ. තවද භික්ෂුව තෙවන ධ්‍යානයට පැමිණ වාසය කරයි. කේවට්ටයෙනි, මෙයද අනුශාසනී ප්‍රාතිහාර්යය යැයි කියනු ලැබේ. තවද භික්ෂුව සතරවන ධ්‍යානයට පැමිණ වාසය කරයි. කේවට්ටයෙනි, මෙයද අනුශාසනී ප්‍රාතිහාර්යය යැයි කියනු ලැබේ. භික්ෂුව නුවණ හා දැකීම සඳහා සිත මෙහෙයවා, ඒ දෙසට නැඹුරු කරයි. කේවට්ටයෙනි, මෙයද අනුශාසනී ප්‍රාතිහාර්යය යැයි කියනු ලැබේ. තවද, භික්ෂුව තව දුරටත් මෙලෙස භවයක් නැතැයි ප්‍රඥාවෙන් අවබෝධ කරයි. කේවට්ටයෙනි, මෙයද අනුශාසනී ප්‍රාතිහාර්යය යැයි කියනු ලැබේ. කේවට්ටයෙනි, මේ ප්‍රාතිහාර්ය තුන මා විසින් අභිඥාවෙන් අවබෝධ කරගෙන ප්‍රකාශ කරන ලද්දකි.",
      "paliTitle": "Anusāsanīpāṭihāriyaṃ",
      "englishTitle": "Miracle of Instruction",
      "sinhalaTitle": "අනුශාසනා ප‍්‍රාතිහාර්යය"
    },
    {
      "number": 487,
      "pali": "‘‘Bhūtapubbaṃ, kevaṭṭa, imasmiññeva bhikkhusaṅghe aññatarassa bhikkhuno evaṃ cetaso parivitakko udapādi – ‘kattha nu kho ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti?",
      "english": "Once, Kevaṭṭa, in this very assembly of monks, a certain monk had this thought arise in his mind: ‘Where then do these four great primary elements – namely, the earth element, the water element, the fire element, and the wind element – utterly cease?’",
      "sinhala": "පෙර, කෙවට්ටය, මේ භික්‍ෂුසංඝය තුළම එක්තරා භික්‍ෂුවකට මෙබඳු විතර්කයක් පහළ විය: ‘මේ සතර මහා භූතයන් ඉතිරි නැතිව නිරුද්ධ වන්නේ කොතැනකද? එනම් – පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මේවායැයි?’",
      "paliTitle": "Bhūtanirodhesakabhikkhuvatthu",
      "englishTitle": "Story of the Monk Seeking Cessation of Becoming",
      "sinhalaTitle": "භූත නිරෝධය සොයන භික්ෂු වස්තුව"
    },
    {
      "number": 488,
      "pali": "‘‘Atha kho so, kevaṭṭa, bhikkhu tathārūpaṃ samādhiṃ samāpajji, yathāsamāhite citte devayāniyo maggo pāturahosi. Atha kho so, kevaṭṭa, bhikkhu yena cātumahārājikā devā tenupasaṅkami; upasaṅkamitvā cātumahārājike deve etadavoca – ‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti? ‘‘Evaṃ vutte, kevaṭṭa, cātumahārājikā devā taṃ bhikkhuṃ etadavocuṃ – ‘mayampi kho, bhikkhu, na jānāma, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātūti [vāyodhātu. atthi kho (pī. evamuparipi)]. Atthi kho [vāyodhātu. atthi kho (pī. evamuparipi)], bhikkhu, cattāro mahārājāno amhehi abhikkantatarā ca paṇītatarā ca. Te kho etaṃ jāneyyuṃ, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti.",
      "english": "Then, Kevaṭṭa, that monk entered into such a concentration that, with his mind thus concentrated, the path leading to the devas became manifest. Then, Kevaṭṭa, that monk approached the devas of the Four Great Kings; having approached the devas of the Four Great Kings, he said to them, ‘Where, friends, do these four great elements cease without remainder, namely, the earth element, the water element, the fire element, and the air element?’ When this was said, Kevaṭṭa, the devas of the Four Great Kings said to that monk, ‘We ourselves, monk, do not know where these four great elements cease without remainder, namely, the earth element, the water element, the fire element, and the air element. Indeed, monk, there are the Four Great Kings who are superior and more excellent than us. They would know where these four great elements cease without remainder, namely, the earth element, the water element, the fire element, and the air element.’",
      "sinhala": "එවිට, කේවට්ටයෙනි, ඒ භික්ෂුව එවැනි සමාධියකට සම වැදුණේය. එසේ සමාධිගත වූ සිතින් ඔහුට දෙව්ලොවට යන මාර්ගය පහළ විය. එවිට, කේවට්ටයෙනි, ඒ භික්ෂුව චාතුම්මහාරාජික දෙවියන් සිටින තැනට උපසංක්‍රමණය කළේය; උපසංක්‍රමණය කොට චාතුම්මහාරාජික දෙවියන්ට මෙසේ පැවසුවේය: ‘ඇවැත්නි, පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මේ මහා භූත සතර ඉතිරි නොවන සේ සම්පූර්ණයෙන් නිරුද්ධ වන්නේ කොහිදැයි?’ කේවට්ටයෙනි, මෙසේ පැවසූ කල්හි චාතුම්මහාරාජික දෙවියෝ ඒ භික්ෂුවට මෙසේ පැවසූහ: ‘භික්ෂුව, පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මේ මහා භූත සතර ඉතිරි නොවන සේ සම්පූර්ණයෙන් නිරුද්ධ වන්නේ කොහිදැයි අපිත් නොදනිමු. භික්ෂුව, අපට වඩා උසස් වූද, ප්‍රණීත වූද සතර මහා රාජවරු සිටිති. පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මේ මහා භූත සතර ඉතිරි නොවන සේ සම්පූර්ණයෙන් නිරුද්ධ වන්නේ කොහිදැයි ඔවුහු දන්නවා ඇත.’",
      "paliTitle": ""
    },
    {
      "number": 489,
      "pali": "‘‘Atha kho so, kevaṭṭa, bhikkhu yena cattāro mahārājāno tenupasaṅkami; upasaṅkamitvā cattāro mahārāje etadavoca – ‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti? Evaṃ vutte, kevaṭṭa, cattāro mahārājāno taṃ bhikkhuṃ etadavocuṃ – ‘mayampi kho, bhikkhu, na jānāma, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu, āpodhātu tejodhātu vāyodhātūti. Atthi kho, bhikkhu, tāvatiṃsā nāma devā amhehi abhikkantatarā ca paṇītatarā ca. Te kho etaṃ jāneyyuṃ, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti.",
      "english": "Then, Kevaṭṭa, that monk approached the Four Great Kings. Having approached, he said to the Four Great Kings, ‘Friends, where do these four great elements utterly cease, namely, the earth element, the water element, the fire element, and the wind element?’ When this was said, Kevaṭṭa, the Four Great Kings said to that monk, ‘Monk, we too do not know where these four great elements utterly cease, namely, the earth element, the water element, the fire element, and the wind element. There are, Monk, devas called Tāvatiṃsa, who are superior and more excellent than us. They would know where these four great elements utterly cease, namely, the earth element, the water element, the fire element, and the wind element.’",
      "sinhala": "එවිට කෙවට්ට, ඒ භික්ෂුව සතර මහරජවරුන් සිටින තැනට එළඹුණේය. එළඹ, සතර මහරජවරුන්ට මෙසේ කීවේය: 'ඇවැත්නි, මෙහි පෘථිවිධාතු, ආපෝධාතු, තේජෝධාතු, වායෝධාතු යන මේ සතර මහා භූතයන් ඉතිරි නොවන සේ නිරුද්ධ වන්නේ කොතැනකද?' කෙවට්ට, මෙසේ කී කල්හි, සතර මහරජවරු ඒ භික්ෂුවට මෙසේ කීවෝය: 'භික්ෂුව, පෘථිවිධාතු, ආපෝධාතු, තේජෝධාතු, වායෝධාතු යන මේ සතර මහා භූතයන් ඉතිරි නොවන සේ නිරුද්ධ වන්නේ කොතැනකදැයි අපිත් නොදනිමු. භික්ෂුව, අපට වඩා වැඩි බල ඇති, උසස් වූ තව්තිසා නම් දෙවිවරු සිටිති. පෘථිවිධාතු, ආපෝධාතු, තේජෝධාතු, වායෝධාතු යන මේ සතර මහා භූතයන් ඉතිරි නොවන සේ නිරුද්ධ වන්නේ කොතැනකදැයි ඔවුහු දන්නවා ඇත.'",
      "paliTitle": ""
    },
    {
      "number": 490,
      "pali": "‘‘Atha kho so, kevaṭṭa, bhikkhu yena tāvatiṃsā devā tenupasaṅkami; upasaṅkamitvā tāvatiṃse deve etadavoca – ‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti? Evaṃ vutte, kevaṭṭa, tāvatiṃsā devā taṃ bhikkhuṃ etadavocuṃ – ‘mayampi kho, bhikkhu, na jānāma, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātūti. Atthi kho, bhikkhu, sakko nāma devānamindo amhehi abhikkantataro ca paṇītataro ca. So kho etaṃ jāneyya, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti.",
      "english": "Then, Kevaṭṭa, that bhikkhu went to the Tāvatiṃsā devas. Having approached the Tāvatiṃsā devas, he said this: ‘Friends, where do these four great elements completely cease, without remainder? Namely, the earth element, the water element, the fire element, and the wind element?’ When this was said, Kevaṭṭa, the Tāvatiṃsā devas said to that bhikkhu: ‘Indeed, bhikkhu, we do not know where these four great elements completely cease, without remainder, namely, the earth element, the water element, the fire element, and the wind element. Bhikkhu, there is Sakka, king of the devas, who is more excellent and more distinguished than us. He would know this: where these four great elements completely cease, without remainder, namely, the earth element, the water element, the fire element, and the wind element.’",
      "sinhala": "ඉක්බිති කෙවට්ට, ඒ භික්‍ෂුව තාවතිංසා දෙවියන් වෙත එළඹියේය; එළඹ තාවතිංසා දෙවියන්ට මෙසේ කීවේය – ‘ඇවැත්නි, මේ සතර මහා භූතයෝ – එනම් පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මොවුහු – අශේෂව නිරුද්ධ වන්නේ කොතැනදී ද?’ මෙසේ කී කල්හි, කෙවට්ට, තාවතිංසා දෙවියෝ ඒ භික්‍ෂුවට මෙසේ කීහ – ‘භික්‍ෂුව, මේ සතර මහා භූතයෝ – එනම් පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මොවුහු – අශේෂව නිරුද්ධ වන්නේ කොතැනදී දැයි අපි දන්නේ නැහැ. භික්‍ෂුව, අපට වඩා උතුම් වූ ද, ප්‍රණීත වූ ද, ශක්‍ර නම් දෙවියන්ගේ රජෙක් සිටී. මේ සතර මහා භූතයෝ – එනම් පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මොවුහු – අශේෂව නිරුද්ධ වන්නේ කොතැනදී දැයි ඔහු දන්නේය.’",
      "paliTitle": ""
    },
    {
      "number": 491,
      "pali": "‘‘Atha kho so, kevaṭṭa, bhikkhu yena sakko devānamindo tenupasaṅkami; upasaṅkamitvā sakkaṃ devānamindaṃ etadavoca – ‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti? Evaṃ vutte, kevaṭṭa, sakko devānamindo taṃ bhikkhuṃ etadavoca – ‘ahampi kho, bhikkhu, na jānāmi, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātūti. Atthi kho, bhikkhu, yāmā nāma devā…pe… suyāmo nāma devaputto… tusitā nāma devā… santussito nāma devaputto… nimmānaratī nāma devā … sunimmito nāma devaputto… paranimmitavasavattī nāma devā… vasavattī nāma devaputto amhehi abhikkantataro ca paṇītataro ca. So kho etaṃ jāneyya, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti.",
      "english": "Then, Kevatta, that monk approached Sakka, the king of devas. Having approached Sakka, the king of devas, he said this: ‘Friend, where do these four great elements – the earth element, the water element, the fire element, and the air element – utterly cease without remainder?’ When this was said, Kevatta, Sakka, the king of devas, said to that monk: ‘Monk, even I do not know where these four great elements – the earth element, the water element, the fire element, and the air element – utterly cease without remainder. However, monk, there are devas called Yāmā, and their leader is the devaputta Suyāma; there are devas called Tusitā, and their leader is the devaputta Santussito; there are devas called Nimmānaratī, and their leader is the devaputta Sunimmito; there are devas called Paranimmitavasavattī, and their leader is the devaputta Vasavattī. These are more excellent and distinguished than us. He would know where these four great elements – the earth element, the water element, the fire element, and the air element – utterly cease without remainder.’",
      "sinhala": "එවිට, කේවට්ටය, ඒ භික්‍ෂුව ශක්‍ර දේවේන්ද්‍රයා වෙත එළඹියේය; එළඹ, ශක්‍ර දේවේන්ද්‍රයාට මෙසේ කීවේය – ‘ආයුෂ්මත්, මේ සතර මහා භූතයෝ, එනම් පඨවි ධාතු, ආපෝ ධාතු, තේජෝ ධාතු, වායෝ ධාතූහු කොහි අවශේෂ රහිතව නිරුද්ධ වෙත්ද?’ මෙසේ කී කල්හි, කේවට්ටය, ශක්‍ර දේවේන්ද්‍රයා ඒ භික්‍ෂුවට මෙසේ කීවේය – ‘භික්‍ෂුව, පඨවි ධාතු, ආපෝ ධාතු, තේජෝ ධාතු, වායෝ ධාතු යන මේ සතර මහා භූතයෝ කොහි අවශේෂ රහිතව නිරුද්ධ වෙත්දැයි මමද නොදනිමි. භික්‍ෂුව, අපට වඩා අභික්‍රාන්ත වූද, ප්‍රණීත වූද, යාම නම් දෙවියෝ සිටිත්. සුයාම නම් දෙව්පුත් කෙනෙක් සිටිති. තුසිත නම් දෙවියෝ සිටිත්. සන්තුසිත නම් දෙව්පුත් කෙනෙක් සිටිති. නිම්මානරතී නම් දෙවියෝ සිටිත්. සුනිම්මිත නම් දෙව්පුත් කෙනෙක් සිටිති. පරනිම්මිතවශවර්තී නම් දෙවියෝ සිටිත්. වශවර්තී නම් දෙව්පුත් කෙනෙක් සිටිති. පඨවි ධාතු, ආපෝ ධාතු, තේජෝ ධාතු, වායෝ ධාතු යන මේ සතර මහා භූතයෝ කොහි අවශේෂ රහිතව නිරුද්ධ වෙත්දැයි ඔහු නම් දන්නේය.’",
      "paliTitle": ""
    },
    {
      "number": 492,
      "pali": "‘‘Atha kho so, kevaṭṭa, bhikkhu yena vasavattī devaputto tenupasaṅkami; upasaṅkamitvā vasavattiṃ devaputtaṃ etadavoca – ‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti? Evaṃ vutte, kevaṭṭa, vasavattī devaputto taṃ bhikkhuṃ etadavoca – ‘ahampi kho, bhikkhu, na jānāmi yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātūti. Atthi kho, bhikkhu, brahmakāyikā nāma devā amhehi abhikkantatarā ca paṇītatarā ca. Te kho etaṃ jāneyyuṃ, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti.",
      "english": "Then, Kevaṭṭa, that bhikkhu approached the Vasavattī deva. Having approached, he said to the Vasavattī deva: ‘Where, friend, do these four great elements utterly cease, namely, the earth element, the water element, the fire element, and the air element?’\n\nWhen this was said, Kevaṭṭa, the Vasavattī deva said to that bhikkhu: ‘I, too, bhikkhu, do not know where these four great elements utterly cease, namely, the earth element, the water element, the fire element, and the air element. Bhikkhu, there are devas called Brahmakāyikā, who are superior and more excellent than us. They would know this, where these four great elements utterly cease, namely, the earth element, the water element, the fire element, and the air element.’",
      "sinhala": "එවිට, කේවට්ටය, ඒ භික්ෂූන් වහන්සේ වසවර්තී දෙව්පුත් සිටි තැනට වැඩිසේක. එහි වැඩ, වසවර්තී දෙව්පුත්ට මෙසේ කීවේය: 'ඇවැත්නි, එනම් පඨවි ධාතු, ආපෝ ධාතු, තේජෝ ධාතු, වායෝ ධාතු යන මේ සතර මහා භූතයෝ අශේෂව නිරුද්ධ වන්නේ කොතැනද?' කේවට්ටය, මෙසේ කී කල්හි, වසවර්තී දෙව්පුත් ඒ භික්ෂූන් වහන්සේට මෙසේ කීවේය: 'භික්ෂූන් වහන්ස, එනම් පඨවි ධාතු, ආපෝ ධාතු, තේජෝ ධාතු, වායෝ ධාතු යන මේ සතර මහා භූතයෝ කොහිදී අශේෂව නිරුද්ධ වෙත්දැයි මා පවා නොදනිමි. භික්ෂූන් වහන්ස, අපට වඩා උසස් වූ ද, ප්‍රණීත වූ ද බ්‍රහ්මකායික නම් දෙවියෝ සිටිති. එනම් පඨවි ධාතු, ආපෝ ධාතු, තේජෝ ධාතු, වායෝ ධාතු යන මේ සතර මහා භූතයෝ කොහිදී අශේෂව නිරුද්ධ වෙත්දැයි ඔවුන් නම් දන්නවා ඇත.'",
      "paliTitle": ""
    },
    {
      "number": 493,
      "pali": "‘‘Atha kho so, kevaṭṭa, bhikkhu tathārūpaṃ samādhiṃ samāpajji, yathāsamāhite citte brahmayāniyo maggo pāturahosi. Atha kho so, kevaṭṭa, bhikkhu yena brahmakāyikā devā tenupasaṅkami; upasaṅkamitvā brahmakāyike deve etadavoca – ‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti? Evaṃ vutte, kevaṭṭa, brahmakāyikā devā taṃ bhikkhuṃ etadavocuṃ – ‘mayampi kho, bhikkhu, na jānāma, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātūti. Atthi kho, bhikkhu, brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyānaṃ amhehi abhikkantataro ca paṇītataro ca. So kho etaṃ jāneyya, yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’’ti. ‘‘‘Kahaṃ panāvuso, etarahi so mahābrahmā’ti? ‘Mayampi kho, bhikkhu, na jānāma, yattha vā brahmā yena vā brahmā yahiṃ vā brahmā; api ca, bhikkhu, yathā nimittā dissanti, āloko sañjāyati, obhāso pātubhavati, brahmā pātubhavissati, brahmuno hetaṃ pubbanimittaṃ pātubhāvāya, yadidaṃ āloko sañjāyati, obhāso pātubhavatī’ti. Atha kho so, kevaṭṭa, mahābrahmā nacirasseva pāturahosi.",
      "english": "Then, Kevaṭṭa, that monk attained such a state of concentration, and with his mind thus concentrated, the path leading to the Brahma-world appeared. Then, Kevaṭṭa, that monk approached the Devas of the Brahma-group. Having approached, he said to the Devas of the Brahma-group, “Friends, where do these four great elements cease without remainder, namely, the earth element, the water element, the fire element, and the air element?” When this was said, Kevaṭṭa, the Devas of the Brahma-group said to that monk, “Monk, we too do not know where these four great elements cease without remainder, namely, the earth element, the water element, the fire element, and the air element. There is, Monk, Brahma, the Great Brahma, the Conqueror, the Unconquered, the All-seeing, the Wielder of power, the Lord, the Maker, the Creator, the Best, the Arranger, the Master, the Father of all that have been and will be, who is higher and more excellent than us. He would know this, where these four great elements cease without remainder, namely, the earth element, the water element, the fire element, and the air element.”\n\n“But where, friends, is this Great Brahma now?” “Monk, we too do not know where Brahma is, or by what path Brahma comes, or in what place Brahma is; but, Monk, when signs appear, light arises, splendor manifests, Brahma will appear, for these are the forewarnings of Brahma’s appearance, namely, that light arises and splendor manifests.” Then, Kevaṭṭa, the Great Brahma appeared not long after.",
      "sinhala": "එවිට කෙවට්ටයෙනි, ඒ භික්ෂුව තථාරූප සමාධියකට සමවැදුණේය. එසේ සමවැදුණු සිත ඇති කල්හි බ්‍රහ්මයා වෙත යන මාර්ගය පහළ විය. එවිට කෙවට්ටයෙනි, ඒ භික්ෂුව බ්‍රහ්මකායික දෙවිවරුන් වෙත එළඹියේය. එළඹ, බ්‍රහ්මකායික දෙවිවරුන්ට මෙසේ කීවේය: ‘ඇවැත්නි, මේ පෘථිවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන සතර මහා භූතයෝ අවශේෂ නොමැතිව නිරුද්ධ වන්නේ කොතැනද?’ කෙවට්ටයෙනි, මෙසේ කී කල්හි බ්‍රහ්මකායික දෙවිවරු ඒ භික්ෂුවට මෙසේ කීවෝය: ‘භික්ෂුව, මේ පෘථිවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන සතර මහා භූතයෝ අවශේෂ නොමැතිව නිරුද්ධ වන්නේ කොතැනදැයි අපිත් නොදනිමු. භික්ෂුව, අභිභවනය කරනසුලු වූ, අභිභවනය නොකරන ලද්දා වූ, අන්‍ය දේ දකින්නා වූ, වසඟ කරගෙන සිටින්නා වූ, ඊශ්වර වූ, කරන්නා වූ, නිර්මාණය කරන්නා වූ, ශ්‍රේෂ්ඨ වූ, ස්වයම්භූ වූ, වසඟයෙහි පවත්වන්නා වූ, වූවන්ගේ සහ වන්නවුන්ගේ පියා වූ, අපට වඩා උසස් වූ, ප්‍රණීත වූ මහා බ්‍රහ්මයා නම් බ්‍රහ්මයෙක් සිටී. මේ පෘථිවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන සතර මහා භූතයෝ අවශේෂ නොමැතිව නිරුද්ධ වන්නේ කොතැනදැයි ඔහු දන්නේය.’ ‘ඇවැත්නි, ඒ මහා බ්‍රහ්මයා දැන් කොහේදැයි?’ ‘භික්ෂුව, බ්‍රහ්මයා කොහේදැයි හෝ, බ්‍රහ්මයා කොතැනින් පැමිණේදැයි හෝ, බ්‍රහ්මයා කොතැනට යන්නේදැයි හෝ අපිත් නොදනිමු. එහෙත් භික්ෂුව, යම්සේ පෙර නිමිති දිස්වන්නේද, ආලෝකය හටගන්නේද, ප්‍රභාව පහළ වන්නේද, එසේ බ්‍රහ්මයා පහළ වනු ඇත. ආලෝකය හටගැනීමත්, ප්‍රභාව පහළ වීමත් යනු බ්‍රහ්මයා පහළ වීමට ඇති පෙර නිමිත්තකි.’ එවිට කෙවට්ටයෙනි, ඒ මහා බ්‍රහ්මයා නොබෝ කලකින් පහළ විය.",
      "paliTitle": ""
    },
    {
      "number": 494,
      "pali": "‘‘Atha kho so, kevaṭṭa, bhikkhu yena so mahābrahmā tenupasaṅkami; upasaṅkamitvā taṃ mahābrahmānaṃ etadavoca – ‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’’ti? Evaṃ vutte, kevaṭṭa, so mahābrahmā taṃ bhikkhuṃ etadavoca – ‘ahamasmi, bhikkhu, brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyāna’nti. ‘‘Dutiyampi kho so, kevaṭṭa, bhikkhu taṃ mahābrahmānaṃ etadavoca – ‘na khohaṃ taṃ, āvuso, evaṃ pucchāmi – ‘‘tvamasi brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyāna’’nti. Evañca kho ahaṃ taṃ, āvuso, pucchāmi – ‘‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’’’ti? ‘‘Dutiyampi kho so, kevaṭṭa, mahābrahmā taṃ bhikkhuṃ etadavoca – ‘ahamasmi, bhikkhu, brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyāna’nti. Tatiyampi kho so, kevaṭṭa, bhikkhu taṃ mahābrahmānaṃ etadavoca – ‘na khohaṃ taṃ, āvuso, evaṃ pucchāmi – ‘‘tvamasi brahmā mahābrahmā abhibhū anabhibhūto aññadatthudaso vasavattī issaro kattā nimmātā seṭṭho sajitā vasī pitā bhūtabhabyāna’’nti. Evañca kho ahaṃ taṃ, āvuso, pucchāmi – ‘‘kattha nu kho, āvuso, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’’’ti?",
      "english": "Then, Kevaṭṭa, that bhikkhu approached that Great Brahmā. Having approached, he said to that Great Brahmā: ‘Friend, where do these four great elements completely cease without remainder, namely, the earth element, the water element, the fire element, and the air element?’ When this was said, Kevaṭṭa, that Great Brahmā said to that bhikkhu: ‘I am, bhikkhu, Brahmā, the Great Brahmā, the Conqueror, the Unconquered, the All-Seeing, the Wielder of Power, the Lord, the Maker, the Creator, the Supreme One, the Arranger, the Master, the Father of all that has been and will be.’\n\nA second time, Kevaṭṭa, that bhikkhu said to that Great Brahmā: ‘Friend, I am not asking you this: \"You are Brahmā, the Great Brahmā, the Conqueror, the Unconquered, the All-Seeing, the Wielder of Power, the Lord, the Maker, the Creator, the Supreme One, the Arranger, the Master, the Father of all that has been and will be.\" Rather, friend, I am asking you this: \"Where do these four great elements completely cease without remainder, namely, the earth element, the water element, the fire element, and the air element?\"’ A second time, Kevaṭṭa, that Great Brahmā said to that bhikkhu: ‘I am, bhikkhu, Brahmā, the Great Brahmā, the Conqueror, the Unconquered, the All-Seeing, the Wielder of Power, the Lord, the Maker, the Creator, the Supreme One, the Arranger, the Master, the Father of all that has been and will be.’ A third time, Kevaṭṭa, that bhikkhu said to that Great Brahmā: ‘Friend, I am not asking you this: \"You are Brahmā, the Great Brahmā, the Conqueror, the Unconquered, the All-Seeing, the Wielder of Power, the Lord, the Maker, the Creator, the Supreme One, the Arranger, the Master, the Father of all that has been and will be.\" Rather, friend, I am asking you this: \"Where do these four great elements completely cease without remainder, namely, the earth element, the water element, the fire element, and the air element?\"’",
      "sinhala": "එවිට කෙවට්ට, ඒ භික්ෂුව ඒ මහාබ්‍රහ්මයා වෙතට එළඹියේය; එළඹ, ඒ මහාබ්‍රහ්මයාට මෙසේ කීවේය: ‘ඇවැත්නි, මේ සතර මහා භූතයන් නම් වූ පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මොවුන් අවශේෂ රහිතව නිරුද්ධ වන්නේ කොතැනකද?’ කෙවට්ට, මෙසේ කී කල්හි, ඒ මහාබ්‍රහ්මයා ඒ භික්ෂුවට මෙසේ කීවේය: ‘භික්ෂුව, මම බ්‍රහ්ම වෙමි, මහාබ්‍රහ්ම වෙමි, අභිභවනය කරන, අභිභවනය නොකරන ලද, අන්‍යයන්ට නොපෙනෙන දේ දකින, වසඟයෙහි පවත්වන, ඊශ්වර වූ, කර්තෘ වූ, නිර්මාතෘ වූ, ශ්‍රේෂ්ඨ වූ, ස්වයංව පහළ වූ, වසඟයෙහි පවතින, අතීත වූ ද අනාගත වූ ද සත්ත්වයන්ගේ පියා වෙමි.’\n\nකෙවට්ට, දෙවෙනි වරටත් ඒ භික්ෂුව ඒ මහාබ්‍රහ්මයාට මෙසේ කීවේය: ‘ඇවැත්නි, මම ඔබෙන් මෙසේ අසන්නේ නැත: ‘‘ඔබ බ්‍රහ්ම වෙමි, මහාබ්‍රහ්ම වෙමි, අභිභවනය කරන, අභිභවනය නොකරන ලද, අන්‍යයන්ට නොපෙනෙන දේ දකින, වසඟයෙහි පවත්වන, ඊශ්වර වූ, කර්තෘ වූ, නිර්මාතෘ වූ, ශ්‍රේෂ්ඨ වූ, ස්වයංව පහළ වූ, වසඟයෙහි පවතින, අතීත වූ ද අනාගත වූ ද සත්ත්වයන්ගේ පියා වෙමි’’ කියා.’ ඇවැත්නි, මම ඔබෙන් මෙසේ අසමි: ‘ඇවැත්නි, මේ සතර මහා භූතයන් නම් වූ පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මොවුන් අවශේෂ රහිතව නිරුද්ධ වන්නේ කොතැනකද?’\n\nකෙවට්ට, දෙවෙනි වරටත් ඒ මහාබ්‍රහ්මයා ඒ භික්ෂුවට මෙසේ කීවේය: ‘භික්ෂුව, මම බ්‍රහ්ම වෙමි, මහාබ්‍රහ්ම වෙමි, අභිභවනය කරන, අභිභවනය නොකරන ලද, අන්‍යයන්ට නොපෙනෙන දේ දකින, වසඟයෙහි පවත්වන, ඊශ්වර වූ, කර්තෘ වූ, නිර්මාතෘ වූ, ශ්‍රේෂ්ඨ වූ, ස්වයංව පහළ වූ, වසඟයෙහි පවතින, අතීත වූ ද අනාගත වූ ද සත්ත්වයන්ගේ පියා වෙමි.’ කෙවට්ට, තුන්වෙනි වරටත් ඒ භික්ෂුව ඒ මහාබ්‍රහ්මයාට මෙසේ කීවේය: ‘ඇවැත්නි, මම ඔබෙන් මෙසේ අසන්නේ නැත: ‘‘ඔබ බ්‍රහ්ම වෙමි, මහාබ්‍රහ්ම වෙමි, අභිභවනය කරන, අභිභවනය නොකරන ලද, අන්‍යයන්ට නොපෙනෙන දේ දකින, වසඟයෙහි පවත්වන, ඊශ්වර වූ, කර්තෘ වූ, නිර්මාතෘ වූ, ශ්‍රේෂ්ඨ වූ, ස්වයංව පහළ වූ, වසඟයෙහි පවතින, අතීත වූ ද අනාගත වූ ද සත්ත්වයන්ගේ පියා වෙමි’’ කියා.’ ඇවැත්නි, මම ඔබෙන් මෙසේ අසමි: ‘ඇවැත්නි, මේ සතර මහා භූතයන් නම් වූ පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව යන මොවුන් අවශේෂ රහිතව නිරුද්ධ වන්නේ කොතැනකද?’",
      "paliTitle": ""
    },
    {
      "number": 495,
      "pali": "‘‘Atha kho so, kevaṭṭa, mahābrahmā taṃ bhikkhuṃ bāhāyaṃ gahetvā ekamantaṃ apanetvā taṃ bhikkhuṃ etadavoca – ‘ime kho maṃ, bhikkhu, brahmakāyikā devā evaṃ jānanti, ‘‘natthi kiñci brahmuno aññātaṃ, natthi kiñci brahmuno adiṭṭhaṃ, natthi kiñci brahmuno aviditaṃ, natthi kiñci brahmuno asacchikata’’nti. Tasmāhaṃ tesaṃ sammukhā na byākāsiṃ. Ahampi kho, bhikkhu, na jānāmi yatthime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātūti. Tasmātiha, bhikkhu, tuyhevetaṃ dukkaṭaṃ, tuyhevetaṃ aparaddhaṃ, yaṃ tvaṃ taṃ bhagavantaṃ atidhāvitvā bahiddhā pariyeṭṭhiṃ āpajjasi imassa pañhassa veyyākaraṇāya. Gaccha tvaṃ, bhikkhu, tameva bhagavantaṃ upasaṅkamitvā imaṃ pañhaṃ puccha, yathā ca te bhagavā byākaroti, tathā naṃ dhāreyyāsī’ti.",
      "english": "Then indeed, Kevaṭṭa, that Great Brahmā, having taken that monk by the arm and led him aside, spoke to that monk thus: ‘Indeed, monk, the devas of the Brahmā host know me thus: ‘‘There is nothing unknown to Brahmā, there is nothing unseen by Brahmā, there is nothing uncomprehended by Brahmā, there is nothing unverified by Brahmā.’’ Therefore, I did not explain in their presence. Indeed, monk, even I do not know where these four great elements cease without remainder, namely: the earth element, the water element, the fire element, and the air element. Therefore, monk, it is your error, it is your offense, that having bypassed the Blessed One, you seek outside for the explanation of this question. Go, monk, approach the Blessed One himself and ask him this question. And as the Blessed One explains it to you, so should you remember it.’",
      "sinhala": "එවිට, කේවට්ටය, ඒ මහා බ්‍රහ්මයා එම භික්ෂුව අතින් අල්ලා එක් පසකට ගෙන ගොස් එම භික්ෂුවට මෙසේ කීවේය – 'භික්ෂුව, මේ බ්‍රහ්මකායික දෙවිවරු මා ගැන මෙසේ දනිති: ''බ්‍රහ්මයාට නොදත් දෙයක් නැත, බ්‍රහ්මයාට නොදුටු දෙයක් නැත, බ්‍රහ්මයාට නොදැනගත් දෙයක් නැත, බ්‍රහ්මයාට ප්‍රත්‍යක්ෂ නොකළ දෙයක් නැත'' කියාය. එබැවින් මම ඔවුන් ඉදිරියේ පැහැදිලි නොකෙළෙමි. භික්ෂුව, මමත් නොදනිමි මේ සතර මහා භූතයන් – එනම් පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව – අවශේෂ රහිතව නිරුද්ධ වන්නේ කොතැනද කියා. එබැවින්, භික්ෂුව, මේ ඔබ කළ වරදකි, ඔබ කළ අපරාධයකි. ඔබ භාග්‍යවතුන් වහන්සේ ඉක්මවා ගොස් මේ ප්‍රශ්නයට පිළිතුර සොයනු පිණිස පිටතින් සෙවීමෙහි යෙදුණේය. භික්ෂුව, ඔබ ඒ භාග්‍යවතුන් වහන්සේ වෙතටම ගොස් මේ ප්‍රශ්නය අසන්න. භාග්‍යවතුන් වහන්සේ ඔබට කෙසේ පැහැදිලි කරන්නේද, එසේ එය සිහිතබාගන්න.",
      "paliTitle": ""
    },
    {
      "number": 496,
      "pali": "‘‘Atha kho so, kevaṭṭa, bhikkhu – seyyathāpi nāma balavā puriso samiñjitaṃ vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya evameva brahmaloke antarahito mama purato pāturahosi. Atha kho so, kevaṭṭa, bhikkhu maṃ abhivādetvā ekamantaṃ nisīdi, ekamantaṃ nisinno kho, kevaṭṭa, so bhikkhu maṃ etadavoca – ‘kattha nu kho, bhante, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti? ",
      "english": "Then, Kevaṭṭa, that bhikkhu – just as a strong man might extend his flexed arm or flex his extended arm – even so, having vanished from the Brahma-world, he appeared before me. Then, Kevaṭṭa, that bhikkhu paid homage to me and sat down to one side. As he sat to one side, Kevaṭṭa, that bhikkhu said this to me: ‘Venerable sir, where do these four great elements utterly cease, without remainder, namely, the earth element, the water element, the fire element, and the wind element?’",
      "sinhala": "එවිට, කේවට්ටය, ඒ භික්‍ෂුව, යම්සේ බලවතෙක් හකුළුවා තිබූ අතක් දිග හරින්නේද, දිග හැර තිබූ අතක් හකුළුවන්නේද, එසේම බ්‍රහ්ම​ලෝකයේ අතුරුදහන් වී මා ඉදිරියේ පහළ විය. එවිට, කේවට්ටය, ඒ භික්‍ෂුව මා වැඳ​ලා එක් පසෙක ඉඳ​ගත්තේය. එක් පසෙක ඉඳ​ගත් ඒ භික්‍ෂුව, කේවට්ටය, මට මෙසේ කීවේය – ‘භාග්‍යවතුන් වහන්ස, මේ මහා භූතයන් සතර එනම්, පඨවි ධාතු, ආපෝ ධාතු, තේජෝ ධාතු, වායෝ ධාතු, අශේෂව කොතැනකදී නිරුද්ධ වේද?’",
      "paliTitle": ""
    },
    {
      "number": 497,
      "pali": "‘‘Evaṃ vutte, ahaṃ, kevaṭṭa, taṃ bhikkhuṃ etadavocaṃ – ‘bhūtapubbaṃ, bhikkhu, sāmuddikā vāṇijā tīradassiṃ sakuṇaṃ gahetvā nāvāya samuddaṃ ajjhogāhanti. Te atīradakkhiniyā nāvāya tīradassiṃ sakuṇaṃ muñcanti. So gacchateva puratthimaṃ disaṃ, gacchati dakkhiṇaṃ disaṃ, gacchati pacchimaṃ disaṃ, gacchati uttaraṃ disaṃ, gacchati uddhaṃ disaṃ, gacchati anudisaṃ. Sace so samantā tīraṃ passati, tathāgatakova [tathāpakkantova (syā.)] hoti. Sace pana so samantā tīraṃ na passati, tameva nāvaṃ paccāgacchati. Evameva kho tvaṃ, bhikkhu, yato yāva brahmalokā pariyesamāno imassa pañhassa veyyākaraṇaṃ nājjhagā, atha mamaññeva santike paccāgato. Na kho eso, bhikkhu, pañho evaṃ pucchitabbo – ‘kattha nu kho, bhante, ime cattāro mahābhūtā aparisesā nirujjhanti, seyyathidaṃ – pathavīdhātu āpodhātu tejodhātu vāyodhātū’ti?",
      "english": "“When this was said, Kevaṭṭa, I said to that bhikkhu: ‘Formerly, bhikkhu, seafaring merchants would take a shore-sighting bird and launch their ship into the ocean. On a ship from which the shore was not visible, they would release the shore-sighting bird. It would go to the eastern direction, it would go to the southern direction, it would go to the western direction, it would go to the northern direction, it would go upwards, it would go to the intermediate directions. If it saw shore all around, it would remain there. But if it did not see shore all around, it would return to that very ship. Just so, bhikkhu, after searching from here all the way to the Brahma-world, you did not find an answer to this question, and so you have returned to me. This question should not be asked in this way, bhikkhu: “Venerable sir, where do these four great elements—that is, the earth element, the water element, the fire element, and the air element—cease without remainder?”’",
      "sinhala": "කේවට්ට, මෙසේ කී කල්හි මම ඒ භික්ෂුවට මෙය කීවෙමි – ‘භික්ෂුව, පෙර කලෙහි මුහුදින් යන වෙළෙන්දෝ ගොඩබිම දකින කුරුල්ලකු ගෙන නැවෙන් මුහුදට බසිති. ගොඩබිම නොපෙනෙන නැවකින් ඔවුහු ඒ ගොඩබිම දකින කුරුල්ලාව මුදාහරිති. එය නැගෙනහිර දිශාවටම යයි, දකුණු දිශාවට යයි, බස්නාහිර දිශාවට යයි, උතුරු දිශාවට යයි, ඉහළට යයි, අනුදිශාවන්ට යයි. යම් හෙයකින් එය හැම පැත්තෙන්ම ගොඩබිම දකින්නේ නම්, එලෙසින්ම එය ගොඩබිමට යන්නේ වෙයි. එහෙත් යම් හෙයකින් එය හැම පැත්තෙන්ම ගොඩබිම නොදකින්නේ නම්, ඒ නැවටම ආපසු එයි. භික්ෂුව, එසේම ඔබද බඹලොව දක්වාම සොයමින්, මේ ප්‍රශ්නයට පිළිතුරක් නොලැබූ කල්හි, මා වෙතටම ආපසු පැමිණියෙහි. භික්ෂුව, මේ ප්‍රශ්නය මෙසේ ඇසිය යුතු නොවේ – ‘ස්වාමීනි, මේ මහා භූත සතර, එනම් පඨවි ධාතු, ආපෝ ධාතු, තේජෝ ධාතු, වායෝ ධාතු යන මේවා ඉතිරි නොවන සේ කොහිදී නිරුද්ධ වේද?’ කියාය.",
      "paliTitle": "Tīradassisakuṇupamā",
      "englishTitle": "Shore-Seeing Bird Simile",
      "sinhalaTitle": "තීරය දකින කුරුළු උපමාව"
    },
    {
      "number": 498,
      "pali": "‘‘Evañca kho eso, bhikkhu, pañho pucchitabbo – ‘Kattha āpo ca pathavī, tejo vāyo na gādhati; Kattha dīghañca rassañca, aṇuṃ thūlaṃ subhāsubhaṃ; Kattha nāmañca rūpañca, asesaṃ uparujjhatī’ti.",
      "english": "And indeed, O monk, this question should be asked: ‘Where do water and earth, fire and air not find footing? Where do long and short, fine and coarse, beautiful and ugly cease? Where do name and form utterly cease?’",
      "sinhala": "එසෙයින්ම, භික්ෂුව, මේ ප්‍ර‍ශ්නය ඇසිය යුතුයි – ‘කොතැනකද ආපෝ ද, පඨවි ද, තේජෝ ද, වායෝ ද පිහිටක් නොගන්නේ? කොතැනකද දීර්ඝ ද, හ්‍ර‍ස්ව ද, අණු ද, ස්ථූල ද, ශුභ ද, අශුභ ද පිහිටක් නොගන්නේ? කොතැනකද නාම ද රූප ද, අශේෂව නිරුද්ධ වන්නේ?’",
      "paliTitle": ""
    },
    {
      "number": 499,
      "pali": "‘‘Tatra veyyākaraṇaṃ bhavati – ‘Viññāṇaṃ anidassanaṃ, anantaṃ sabbatopabhaṃ; Ettha āpo ca pathavī, tejo vāyo na gādhati. Ettha dīghañca rassañca, aṇuṃ thūlaṃ subhāsubhaṃ; Ettha nāmañca rūpañca, asesaṃ uparujjhati; Viññāṇassa nirodhena, etthetaṃ uparujjhatī’ti.",
      "english": "Then there is an exposition: ‘Consciousness is non-manifestative, infinite, radiant on all sides. Herein, water and earth, fire and air find no footing. Herein, long and short, subtle and gross, beautiful and ugly; herein, name and form utterly cease. With the cessation of consciousness, all this herein ceases.’",
      "sinhala": "එහි විවරණයක්‌ වේ:\n\n‘විඤ්ඤාණය නොදක්නාසුලු ය, අනන්ත ය, සෑම අතින්ම ප්‍රභාමත් ය. මෙහි ජලය ද පෘථිවිය ද තේජස ද වාතය ද පිහිටන්නේ නැත. මෙහි දිග ද කොට ද, සියුම් ද ස්ථූල ද, සුභ ද අසුභ ද වූ, නාමය ද රූපය ද අශේෂයෙන් නිරුද්ධ වේ. විඤ්ඤාණයේ නිරෝධය නිසා, මේ සියල්ල මෙහි නිරුද්ධ වේ.’",
      "paliTitle": ""
    },
    {
      "number": 500,
      "pali": "Idamavoca bhagavā. Attamano kevaṭṭo gahapatiputto bhagavato bhāsitaṃ abhinandīti. ",
      "english": "The Blessed One said this. The householder's son Kevaṭṭa, delighted in mind, rejoiced in the Blessed One's words.",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. කේවට්ට ගහපති පුත්‍රයා තුටු පහටු වූයේ භාග්‍යවතුන් වහන්සේගේ වචනය අගය කළේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Kevaṭṭasuttaṃ niṭṭhitaṃ ekādasamaṃ.",
    "english": "The Eleventh Kevaṭṭa Sutta Concluded",
    "sinhala": "එකොළොස්වැනි කේවට්ට සූත‍්‍රය නිමයි."
  }
}