{
  "id": "dn2",
  "title": {
    "pali": "Sāmaññaphalasuttaṃ",
    "english": "The Discourse on the Fruits of Asceticism",
    "sinhala": "සාමඤ්ඤඵල සූත්‍රය"
  },
  "sections": [
    {
      "number": 150,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā rājagahe viharati jīvakassa komārabhaccassa ambavane mahatā bhikkhusaṅghena saddhiṃ aḍḍhateḷasehi bhikkhusatehi. Tena kho pana samayena rājā māgadho ajātasattu vedehiputto tadahuposathe pannarase komudiyā cātumāsiniyā puṇṇāya puṇṇamāya rattiyā rājāmaccaparivuto uparipāsādavaragato nisinno hoti. Atha kho rājā māgadho ajātasattu vedehiputto tadahuposathe udānaṃ udānesi – ‘‘ramaṇīyā vata bho dosinā ratti, abhirūpā vata bho dosinā ratti, dassanīyā vata bho dosinā ratti, pāsādikā vata bho dosinā ratti, lakkhaññā vata bho dosinā ratti. Kaṃ nu khvajja samaṇaṃ vā brāhmaṇaṃ vā payirupāseyyāma, yaṃ no payirupāsato cittaṃ pasīdeyyā’’ti?",
      "english": "Thus have I heard. On one occasion, the Blessed One was dwelling in Rājagaha, in Jīvaka Komārabhacca's Mango Grove, together with a great assembly of twelve hundred and fifty bhikkhus.\n\nNow at that time, King Ajātasattu, son of Queen Vedahī, the ruler of Magadha, on that Uposatha day, the fifteenth, on the full moon night of the Kōmudī, the fourth month of the rainy season, surrounded by his ministers, was seated on the upper floor of his excellent palace.\n\nThen King Ajātasattu, son of Queen Vedahī, the ruler of Magadha, on that Uposatha day, uttered this exclamation: \"Indeed, delightful is this moonlit night! Indeed, beautiful is this moonlit night! Indeed, lovely to behold is this moonlit night! Indeed, charming is this moonlit night! Indeed, auspicious is this moonlit night! Whom now, on this day, might we approach, what ascetic or brahmin, by approaching whom our mind might become serene?\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ රජගහ නුවර, ජීවක කුමාරභච්චගේ අඹ වනයේ, දොළොස් සිය පනස් නමක් වූ මහත් භික්ෂු සංඝයා සමඟ වැඩ සිටියහ.\n\nඑකල මාගධ රජු වූ, වේදේහී පුත් අජාතසත්තු රජතුමා, එදින පොහෝ දින, කෝමුදී සතර මාසයෙහි පිරුණු පුර පසළොස්වක රාත්‍රියෙහි, රාජාමාත්‍යයන් පිරිවරාගෙන, මාලිගාවේ උඩම මහලෙහි වාඩි වී සිටියේය. ඉක්බිති මාගධ රජු වූ, වේදේහී පුත් අජාතසත්තු රජතුමා, එදින පොහෝ දින, උදන් ඇනුවේය: ‘‘ආශ්චර්යයකි, භවත්නි, මේ සඳලුතල රැය සිත්කළුය; ආශ්චර්යයකි, භවත්නි, මේ සඳලුතල රැය අලංකාරය; ආශ්චර්යයකි, භවත්නි, මේ සඳලුතල රැය දැකීමට සුදුසුය; ආශ්චර්යයකි, භවත්නි, මේ සඳලුතල රැය ප්‍රියමනාපය; ආශ්චර්යයකි, භවත්නි, මේ සඳලුතල රැය සුබ ලකුණකි. අද අපි කවර ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු ඇසුරු කරමුද, කවරෙකු ඇසුරු කිරීමෙන් අපගේ සිත පැහැදෙන්නේද?’’",
      "paliTitle": "Rājāmaccakathā",
      "englishTitle": "Story of the Royal Minister",
      "sinhalaTitle": "රාජාමාත්‍ය කතාව"
    },
    {
      "number": 151,
      "pali": "Evaṃ vutte, aññataro rājāmacco rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ etadavoca – ‘‘ayaṃ, deva, pūraṇo kassapo saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa rattaññū cirapabbajito addhagato vayoanuppatto. Taṃ devo pūraṇaṃ kassapaṃ payirupāsatu. Appeva nāma devassa pūraṇaṃ kassapaṃ payirupāsato cittaṃ pasīdeyyā’’ti. Evaṃ vutte, rājā māgadho ajātasattu vedehiputto tuṇhī ahosi.",
      "english": "When this was said, a certain royal minister said this to King Ajātasattu of Magadha, son of Videhi: \"This Pūraṇa Kassapa, O king, is a leader of an order, a head of a group, and a teacher of a group, well-known and famous, a founder of a sect, esteemed by many people, experienced for a long time, long ordained, advanced in years, arrived at old age. May your majesty attend upon Pūraṇa Kassapa. Perhaps, as your majesty attends upon Pūraṇa Kassapa, your mind may become serene.\" When this was said, King Ajātasattu of Magadha, son of Videhi, remained silent.",
      "sinhala": "මෙසේ කී කල්හි, එක්තරා රාජාමාත්‍යවරයෙක් මාගධ අජාතසත්තු වෛදේහීපුත්‍ර රජුට මෙසේ කීවේය: ‘‘දේවයන්වහන්ස, මේ පූරණ කස්සප සංඝී ද වේ, ගණී ද වේ, ගණාචාර්යවරයෙක් ද වේ. ප්‍රසිද්ධ වූ, කීර්තිමත්, තීර්ථකරයෙක් වන අතර, බොහෝ ජනයා විසින් යහපත් යැයි සම්මත වූ, දීර්ඝකාලයක් පැවිදිව සිටි, වයසින් මුහුකුරා ගිය, අත්දැකීම් බහුල අයෙකි. දේවයන්වහන්සේ එම පූරණ කස්සප ඇසුරු කරත්වා. සමහරවිට දේවයන්වහන්සේට පූරණ කස්සප ඇසුරු කිරීමෙන් සිත පහදින්නට පුළුවන.’’ මෙසේ කී කල්හි, මාගධ අජාතසත්තු වෛදේහීපුත්‍ර රජ නිහඬව සිටියේය.",
      "paliTitle": ""
    },
    {
      "number": 152,
      "pali": "Aññataropi kho rājāmacco rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ etadavoca – ‘‘ayaṃ, deva, makkhali gosālo saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa rattaññū cirapabbajito addhagato vayoanuppatto. Taṃ devo makkhaliṃ gosālaṃ payirupāsatu. Appeva nāma devassa makkhaliṃ gosālaṃ payirupāsato cittaṃ pasīdeyyā’’ti. Evaṃ vutte, rājā māgadho ajātasattu vedehiputto tuṇhī ahosi.",
      "english": "And another royal minister said this to King Ajātasattu of Magadha, son of Videhī: “Your Majesty, this Makkhali Gosāla is a leader of a group, a head of a sect, and a teacher of a school. He is well-known, famous, a founder of a sect, and esteemed as a good man by many. He is an elder, long gone forth into homelessness, and has reached advanced years. Therefore, Your Majesty should attend upon Makkhali Gosāla. Perhaps by Your Majesty attending upon Makkhali Gosāla, your mind might become serene.” When this was said, King Ajātasattu of Magadha, son of Videhī, remained silent.",
      "sinhala": "තවත් එක් රජුගේ ඇමතියෙක් විදේහීපුත්‍‍ර මගධ රජ අජාතසත්තුට මෙය පැවසීය – \"දේවයන් වහන්ස, මේ මක්ඛලී ගෝසාල සංඝිකයෙකි, ගණිකයෙකි, ගණාචාර්යවරයෙකි, ප්‍රසිද්ධය, යසස් ඇත්තෙකි, තීර්ථකයෙකි, බොහෝ ජනයා විසින් යහපත් යැයි සම්මත කරනු ලැබූවෙකි, පැරණි දනුවෙකි, බොහෝ කලක් පැවිදි වූවෙකි, ජීවිත කාලය ගෙවා මහලු වියට පැමිණ සිටී. දේවයන් වහන්සේ ඒ මක්ඛලී ගෝසාල ඇසුරු කරන්න. එසේනම් දේවයන් වහන්සේ මක්ඛලී ගෝසාල ඇසුරු කිරීමෙන් සිත ප්‍රසන්න වනු ඇතැයි.\"\n\nමෙලෙස පැවසූ කල්හි විදේහීපුත්‍‍ර මගධ රජ අජාතසත්තු නිහඬ විය.",
      "paliTitle": ""
    },
    {
      "number": 153,
      "pali": "Aññataropi kho rājāmacco rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ etadavoca – ‘‘ayaṃ, deva, ajito kesakambalo saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa rattaññū cirapabbajito addhagato vayoanuppatto. Taṃ devo ajitaṃ kesakambalaṃ payirupāsatu. Appeva nāma devassa ajitaṃ kesakambalaṃ payirupāsato cittaṃ pasīdeyyā’’ti. Evaṃ vutte, rājā māgadho ajātasattu vedehiputto tuṇhī ahosi.",
      "english": "And another royal minister indeed spoke thus to King Ajātasattu of Magadha, son of Videhi: \"O king, this Ajita Kesakambala is a leader of an order, a leader of a group, and a teacher of a group. He is well-known, famous, a founder of a school of thought, esteemed as holy by many people, an experienced elder, long a recluse, who has reached old age. May your majesty approach and attend upon Ajita Kesakambala. Perhaps, when your majesty attends upon Ajita Kesakambala, your mind might become clear.\" When this was said, King Ajātasattu of Magadha, son of Videhi, remained silent.",
      "sinhala": "එක්තරා රාජාමාත්‍යයෙක්ද මගධ රජු වූ වේදේහි පුත් අජාතසත්තු රජුට මෙසේ පැවසුවේය – “දේවයන්වහන්ස, මේ අජිත කේසකම්බල නම් තෙමේ සංඝ නායකයෙක්ද, ගණ නායකයෙක්ද, ගණාචාර්‍ය්‍යයෙක්ද, ප්‍රකට වූ, යසස් ඇති, තීර්ථක වූ, බොහෝ දෙනා විසින් යහපත් යැයි සම්මත වූ, අත්දැකීම් බහුල වූ, බොහෝ කලක් පැවිදි වූ, වයෝවෘද්ධ වූ කෙනෙකි. දේවයන්වහන්සේ ඒ අජිත කේසකම්බල උන්වහන්සේ වෙතට වඩත්වා. සමහරවිට දේවයන් වහන්සේට අජිත කේසකම්බල උන්වහන්සේ වෙතට වැඩීමෙන් සිත පහදින්නට ඉඩ ඇතැයි.” මෙසේ පැවසූ කල්හි, මගධ රජ වූ වේදේහි පුත් අජාතසත්තු රජු නිහඬ විය.",
      "paliTitle": ""
    },
    {
      "number": 154,
      "pali": "Aññataropi kho rājāmacco rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ etadavoca – ‘‘ayaṃ, deva, pakudho [pakuddho (sī.)] kaccāyano saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa rattaññū cirapabbajito addhagato vayoanuppatto. Taṃ devo pakudhaṃ kaccāyanaṃ payirupāsatu. Appeva nāma devassa pakudhaṃ kaccāyanaṃ payirupāsato cittaṃ pasīdeyyā’’ti. Evaṃ vutte, rājā māgadho ajātasattu vedehiputto tuṇhī ahosi.",
      "english": "And another royal minister said to King Ajātasattu of Magadha, son of Videhi: “This Pakudha Kaccāyana, Your Majesty, is a leader of a community, a leader of a group, and a teacher of a group; he is known and renowned, a founder of a sect, esteemed by many people, long-practiced, long-ordained, and advanced in years, having reached old age. May Your Majesty attend upon Pakudha Kaccāyana. Perhaps, as Your Majesty attends upon Pakudha Kaccāyana, your mind might become serene.” When this was said, King Ajātasattu of Magadha, son of Videhi, remained silent.",
      "sinhala": "තවද එක්තරා රාජ්ය අමාත්‍යවරයෙක් මාගධ අජාතසත්තු වේදේහීපුත්‍ර රජුට මෙසේ කීවේය: ''දේවයන් වහන්ස, මේ පකුධ කච්චායන තෙමේ සංඝී ද, ගණී ද, ගණාචාර්ය ද, ප්‍රකට වූ, යසස් ඇති, තීර්ථකර වූ, බොහෝ දෙනා විසින් යහපත් යැයි සම්මත වූ, දීර්ඝ කාලයක් ප්‍රව්‍රජිත වූ, වයසින් මුහුකුරා ගිය අයෙකි. දේවයන් වහන්ස, ඔබ එතුමන් ඇසුරු කරන්න. සමහරවිට දේවයන් වහන්සේට පකුධ කච්චායන ඇසුරු කිරීමෙන් සිත ප්‍රසන්න වනු ඇත.''\n\nමෙසේ කී කල්හි, මාගධ අජාතසත්තු වේදේහීපුත්‍ර රජු නිහඬ විය.",
      "paliTitle": ""
    },
    {
      "number": 155,
      "pali": "Aññataropi kho rājāmacco rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ etadavoca – ‘‘ayaṃ, deva, sañcayo [sañjayo (sī. syā.)] belaṭṭhaputto [bellaṭṭhiputto (sī.), velaṭṭhaputto (syā.)] saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa rattaññū cirapabbajito addhagato vayoanuppatto. Taṃ devo sañcayaṃ belaṭṭhaputtaṃ payirupāsatu. Appeva nāma devassa sañcayaṃ belaṭṭhaputtaṃ payirupāsato cittaṃ pasīdeyyā’’ti. Evaṃ vutte, rājā māgadho ajātasattu vedehiputto tuṇhī ahosi.",
      "english": "And another royal minister said this to King Ajātasattu of Magadha, son of Videhī: “This Sañcaya Belaṭṭhaputta, O King, is a leader, a head, a teacher of a community; he is well-known, famous, a sectarian teacher, considered good by many people, of long standing, long-ordained, and advanced in years. May Your Majesty attend upon Sañcaya Belaṭṭhaputta. Perhaps by attending upon Sañcaya Belaṭṭhaputta, Your Majesty’s mind might become clear.” When this was said, King Ajātasattu of Magadha, son of Videhī, remained silent.",
      "sinhala": "අනෙක් එක් රාජ්‍ය අමාත්‍යවරයෙක්ද වේදේහීපුත් මගධ රජු වූ අජාතසත්තුට මෙලෙස පැවසුවේය. ‘‘දේවයන් වහන්ස, මේ සංජය බේලට්ඨපුත්ත ප්‍රජා නායකයෙක් ද, ගණ නායකයෙක් ද, ගණාචාර්යයෙක් ද, ප්‍රකට වූ, යසස් ඇත්තෙක් ද, බහුජනයා විසින් යහපත් යැයි සම්මත කරන ලද තීර්ථකවරයෙක් ද, දීර්ඝ කාලයක් අත්දැකීම් ඇති, කලක් පැවිදි වූ, වයස්ගත වූ, මහලු වියට පැමිණි අයෙකි. එම සංජය බේලට්ඨපුත්ත දේවයන් වහන්සේ සේවනය කළ මැනව. සමහරවිට දේවයන් වහන්සේට එම සංජය බේලට්ඨපුත්ත ඇසුරු කිරීමෙන් සිත පහදිනු ඇත.’’ මෙලෙස පැවසූ විට, වේදේහීපුත් මගධ රජු වූ අජාතසත්තු නිහඬ විය.",
      "paliTitle": ""
    },
    {
      "number": 156,
      "pali": "Aññataropi kho rājāmacco rājānaṃ māgadhaṃ ajātasattuṃ vedehiputtaṃ etadavoca – ‘‘ayaṃ, deva, nigaṇṭho nāṭaputto [nāthaputto (sī.), nātaputto (pī.)] saṅghī ceva gaṇī ca gaṇācariyo ca ñāto yasassī titthakaro sādhusammato bahujanassa rattaññū cirapabbajito addhagato vayoanuppatto. Taṃ devo nigaṇṭhaṃ nāṭaputtaṃ payirupāsatu. Appeva nāma devassa nigaṇṭhaṃ nāṭaputtaṃ payirupāsato cittaṃ pasīdeyyā’’ti. Evaṃ vutte, rājā māgadho ajātasattu vedehiputto tuṇhī ahosi.",
      "english": "And another royal minister said this to King Ajātasattu of Magadha, son of Videhi: \"This, Your Majesty, is the ascetic Nāṭaputta, who is a founder of a monastic order, a leader of a group, and a teacher of a group, well-known, famous, a ford-maker, well-regarded by many people, long-experienced, long gone forth as a renunciant, advanced in years, having reached old age. May Your Majesty attend upon this ascetic Nāṭaputta. Perhaps, as Your Majesty attends upon the ascetic Nāṭaputta, your mind may become serene.\" When this was said, King Ajātasattu of Magadha, son of Videhi, remained silent.",
      "sinhala": "තවද එක්තරා රාජාමාත්‍යයෙක් මගධ රජු වූ වේදේහීපුත්‍ර අජාතසත්තු රජුට මෙසේ කීවේය: “දේවයන් වහන්ස, මේ නිගණ්ඨ නාටපුත්‍ර තෙමේ සංඝියෙක් ද, ගණියෙක් ද, ගණාචාර්යවරයෙක් ද වන, ප්‍ර\\u200dකට වූ, යසස් ඇති, බොහෝ දෙනා විසින් යහපතැයි සම්මත කරන ලද තීර්ථකයෙකි. ඔහු කලක් ධර්මයෙහි දත්, දීර්ඝ කාලයක් පැවිදි වූ, වයසට පැමිණි අයෙකි. දේවයන් වහන්ස, ඒ නිගණ්ඨ නාටපුත්‍ර තෙමේව සේවනය කරන සේක්වා! සමහර විට දේවයන් වහන්සේගේ නිගණ්ඨ නාටපුත්‍ර තෙමේව සේවනය කිරීමෙන් සිත පහදිනවා ඇතැ’යි.” මෙසේ කී කල්හි මගධ රජු වූ වේදේහීපුත්‍ර අජාතසත්තු රජ නිහඬ විය.",
      "paliTitle": ""
    },
    {
      "number": 157,
      "pali": "Tena kho pana samayena jīvako komārabhacco rañño māgadhassa ajātasattussa vedehiputtassa avidūre tuṇhībhūto nisinno hoti. Atha kho rājā māgadho ajātasattu vedehiputto jīvakaṃ komārabhaccaṃ etadavoca – ‘‘tvaṃ pana, samma jīvaka, kiṃ tuṇhī’’ti? ‘‘Ayaṃ, deva, bhagavā arahaṃ sammāsambuddho amhākaṃ ambavane viharati mahatā bhikkhusaṅghena saddhiṃ aḍḍhateḷasehi bhikkhusatehi. Taṃ kho pana bhagavantaṃ [bhagavantaṃ gotamaṃ (sī. ka. pī.)] evaṃ kalyāṇo kittisaddo abbhuggato – ‘itipi so bhagavā arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā’ti. Taṃ devo bhagavantaṃ payirupāsatu. Appeva nāma devassa bhagavantaṃ payirupāsato cittaṃ pasīdeyyā’ti.",
      "english": "At that time, Jīvaka the royal physician was sitting silently not far from King Ajātasattu of Magadha, son of Vaidehī. Then King Ajātasattu of Magadha, son of Vaidehī, said to Jīvaka the royal physician, \"But you, friend Jīvaka, why are you silent?\"\n\n\"Lord, the Blessed One, the Arahant, the Fully Awakened One, is dwelling in our mango grove together with a great community of monks, with twelve hundred and fifty monks. Such a good report has spread about that Blessed One: 'Indeed, that Blessed One is an Arahant, a Fully Awakened One, accomplished in knowledge and conduct, a well-farer, knower of worlds, an unsurpassed leader of persons to be tamed, a teacher of devas and humans, the Buddha, the Blessed One.' Let Your Majesty approach and attend upon the Blessed One. Perhaps, as Your Majesty attends upon the Blessed One, your mind may become serene.\"",
      "sinhala": "ඒ කල්හි ජීවක කොමාරභච්ච තෙමේ වේදේහීපුත්‍ර මගධ අජාතශත්‍රැ රජුට නුදුරුව නිහඬව හිඳගෙන සිටියේය. ඉක්බිති වේදේහීපුත්‍ර මගධ අජාතශත්‍රැ රජ තෙමේ ජීවක කොමාරභච්චයාට \"මිත්‍ර ජීවකය, නුඹ කුමට මෙසේ නිහඬව සිටින්නෙහිද?\" යැයි මෙය කීය. \"දේවයන් වහන්ස, මෙහි මේ අරහත් සම්මාසම්බුදු භාග්‍යවතුන් වහන්සේ දහස් දෙසී පනස් නමක මහත් භික්ෂු සංඝයා සමග අපගේ අඹ වනයෙහි වැඩවසති. ඒ භාග්‍යවතුන් වහන්සේ පිළිබඳව ‘ඒ භාග්‍යවතුන් වහන්සේ අරහං, සම්මාසම්බුද්ධ, විද්‍යාචරණ සම්පන්න, සුගත, ලෝකවිදූ, අනුත්තරෝ පුරිසදම්මසාරථි, සත්ථා දේවමනුස්සානං, බුද්ධ, භාග්‍යවා’ යනුවෙන් මෙසේ මනා කීර්ති ඝෝෂාවක් පැතිරී ඇත. ඒ භාග්‍යවතුන් වහන්සේව දේවයන් වහන්සේ බැහැදැකීමට යෙදෙත්වා. භාග්‍යවතුන් වහන්සේව බැහැදකින කල්හි සමහර විට දේවයන් වහන්සේගේ සිත පහදින්නට පුළුවනැ’යි.\"",
      "paliTitle": "Komārabhaccajīvakakathā",
      "englishTitle": "Story of Jīvaka the Royal Physician",
      "sinhalaTitle": "කොමාරභච්චජීවක වස්තුව"
    },
    {
      "number": 158,
      "pali": "‘‘Tena hi, samma jīvaka, hatthiyānāni kappāpehī’’ti. ‘‘Evaṃ, devā’’ti kho jīvako komārabhacco rañño māgadhassa ajātasattussa vedehiputtassa paṭissuṇitvā pañcamattāni hatthinikāsatāni kappāpetvā rañño ca ārohaṇīyaṃ nāgaṃ, rañño māgadhassa ajātasattussa vedehiputtassa paṭivedesi – ‘‘kappitāni kho te, deva, hatthiyānāni, yassadāni kālaṃ maññasī’’ti.",
      "english": "\"Then, friend Jīvaka, prepare the elephant mounts.\"\n\n\"So be it, lord,\" Jīvaka the royal physician assented to King Ajātasattu of Magadha, son of Videhi. He then prepared around five hundred elephant mounts, along with the king's own mountable elephant, and reported to King Ajātasattu of Magadha, son of Videhi, \"Your elephant mounts are ready, lord. Now is the time for whatever you deem fit.\"",
      "sinhala": "එසේ වී නම්, පින්වත් ජීවක, ඇත්රථ සූදානම් කරන්න. ‘එසේය, දෙවිඳුනි’යි ජීවක කෝමාරභච්ච වේදේහිපුත්‍ර මගධ රජු වූ අජාතසත්තුට පිළිගෙන, පන්සියයක් පමණ ඇත්රථ ද, රජුට නැගීමට සුදුසු ඇතු ද සූදානම් කරවා, වේදේහිපුත්‍ර මගධ රජු වූ අජාතසත්තුට දැන්වීය: ‘දෙවිඳුනි, ඔබේ ඇත්රථ සූදානම් කර ඇත. දැන් ඔබ සුදුසු යැයි සිතන වේලාවයි’.",
      "paliTitle": ""
    },
    {
      "number": 159,
      "pali": "Atha kho rājā māgadho ajātasattu vedehiputto pañcasu hatthinikāsatesu paccekā itthiyo āropetvā ārohaṇīyaṃ nāgaṃ abhiruhitvā ukkāsu dhāriyamānāsu rājagahamhā niyyāsi mahaccarājānubhāvena, yena jīvakassa komārabhaccassa ambavanaṃ tena pāyāsi. Atha kho rañño māgadhassa ajātasattussa vedehiputtassa avidūre ambavanassa ahudeva bhayaṃ, ahu chambhitattaṃ, ahu lomahaṃso. Atha kho rājā māgadho ajātasattu vedehiputto bhīto saṃviggo lomahaṭṭhajāto jīvakaṃ komārabhaccaṃ etadavoca – ‘‘kacci maṃ, samma jīvaka, na vañcesi? Kacci maṃ, samma jīvaka, na palambhesi? Kacci maṃ, samma jīvaka, na paccatthikānaṃ desi? Kathañhi nāma tāva mahato bhikkhusaṅghassa aḍḍhateḷasānaṃ bhikkhusatānaṃ neva khipitasaddo bhavissati, na ukkāsitasaddo na nigghoso’’ti. ‘‘Mā bhāyi, mahārāja, mā bhāyi, mahārāja. Na taṃ deva, vañcemi; na taṃ, deva, palambhāmi; na taṃ, deva, paccatthikānaṃ demi. Abhikkama, mahārāja, abhikkama, mahārāja, ete maṇḍalamāḷe dīpā [padīpā (sī. syā.)] jhāyantī’’ti. ",
      "english": "Then King Ajātasattu, son of Vaidehī, the ruler of Magadha, having seated women on five hundred royal female elephants and himself mounted a royal elephant, while torches were being held aloft, departed from Rājagaha with great royal splendor, and proceeded towards Jīvaka Komārabhacca's mango grove.\n\nThen for King Ajātasattu, son of Vaidehī, the ruler of Magadha, when he was not far from the mango grove, there arose fear, trepidation, and a horripilation.\n\nThen King Ajātasattu, son of Vaidehī, the ruler of Magadha, being frightened, agitated, and with his hair standing on end, said to Jīvaka Komārabhacca: “Surely, friend Jīvaka, you are not deceiving me? Surely, friend Jīvaka, you are not misleading me? Surely, friend Jīvaka, you are not handing me over to my enemies? For how is it that there is no sound of spitting, no sound of coughing, no noise whatsoever, from such a large community of bhikkhus, twelve hundred and fifty bhikkhus?”\n\n“Do not fear, great king, do not fear, great king. I am not deceiving you, sire; I am not misleading you, sire; I am not handing you over to your enemies, sire. Proceed, great king, proceed, great king, these lamps are burning in the circular hall.”",
      "sinhala": "ඉන්පසු මාගධ රජු වූ වේදේහී පුත් අජාතශත්‍රැ, අත්තිකා ශතවල්පන්සියයෙහි සෑම ඇතකු පිටම ස්ත්‍රීන් නංවා, තමාට නැඟීමට සුදුසු ඇතා පිට නැඟී, පන්දම් දැල්වෙද්දී, මහත් රාජානුභාවයෙන් යුක්තව රජගහ නුවරින් පිටත් වී, ජීවක කෝමාරභච්චගේ අඹවනය දෙසට ගමන් කළේය.\n\nඉන්පසු මාගධ රජු වූ වේදේහී පුත් අජාතශත්‍රැහට අඹවනයට නුදුරුවම භයක් ද, තැතිගැනීමක් ද, ලොමුදැහැගැන්මක් ද ඇති විය.\n\nඉන්පසු මාගධ රජු වූ වේදේහී පුත් අජාතශත්‍රැ බියට පත්ව, තැතිගෙන, ලොමුදැහැගෙන, ජීවක කෝමාරභච්චට මෙසේ කීවේය: \"මිත්‍ර ජීවක, ඔබ මාව වංචා කරන්නේ නැහැනේද? මිත්‍ර ජීවක, ඔබ මාව රවටන්නේ නැහැනේද? මිත්‍ර ජීවක, ඔබ මාව සතුරන්ට පාවා දෙන්නේ නැහැනේද? දොළොස්සිය පනහක් වූ මෙතරම් මහත් භික්‍ෂු සංඝයකගේ කිවිසුම් හඬක්වත්, කහින හඬක්වත්, කිසිදු ශබ්දයක්වත් නැත්තේ කෙසේද?\"\n\n\"මහ රජ, බිය නොවන්න, මහ රජ, බිය නොවන්න. දෙවියන් වහන්ස, මම ඔබව වංචා කරන්නේ නැත; දෙවියන් වහන්ස, මම ඔබව රවටන්නේ නැත; දෙවියන් වහන්ස, මම ඔබව සතුරන්ට පාවා දෙන්නේ නැත. මහ රජ, ඉදිරියට වඩින්න, මහ රජ, ඉදිරියට වඩින්න, මේ මණ්ඩල මාළිගාවල පහන් දැල්වෙමින් තිබේ.\"",
      "paliTitle": ""
    },
    {
      "number": 160,
      "pali": "Atha kho rājā māgadho ajātasattu vedehiputto yāvatikā nāgassa bhūmi nāgena gantvā, nāgā paccorohitvā, pattikova [padikova (syā.)] yena maṇḍalamāḷassa dvāraṃ tenupasaṅkami; upasaṅkamitvā jīvakaṃ komārabhaccaṃ etadavoca – ‘‘kahaṃ pana, samma jīvaka, bhagavā’’ti? ‘‘Eso, mahārāja, bhagavā; eso, mahārāja, bhagavā majjhimaṃ thambhaṃ nissāya puratthābhimukho nisinno purakkhato bhikkhusaṅghassā’’ti.",
      "english": "Then indeed King Ajātasattu of Magadha, son of Vedehī, having gone by elephant as far as the elephant could go, dismounted from the elephant, and proceeded on foot to the door of the circular pavilion. Having approached, he said to Jīvaka the royal physician, \"Where now, good Jīvaka, is the Blessed One?\" \"That, great king, is the Blessed One; that, great king, is the Blessed One, seated facing east, leaning against the middle pillar, surrounded by the assembly of monks.\"",
      "sinhala": "එවිට මාගධ රජු වූ, වේදේහී පුත් අජාතසත්තු, ඇත්ගමනින් යා හැකි පමණ දුරක් ඇතු පිටින් ගොස්, ඇතු පිටින් බැස, පා ගමනින් මණ්ඩප මාලිගාවේ දොරකඩ වෙතට එළඹියේය. එළඹ, ජීවක කෝමාරභච්ච අමතා මෙය කීවේය: “මිත්‍ර ජීවක, භාග්‍යවතුන් වහන්සේ කොහිද?” [ජීවක පිළිතුරු දෙයි] “මහරජ, මේ භාග්‍යවතුන් වහන්සේ ය; මහරජ, මේ භාග්‍යවතුන් වහන්සේ මැද කණුවකට හේත්තු වී, භික්‍ෂුසංඝයා පිරිවරාගෙන, නැගෙනහිර දිශාවට මුහුණලා වැඩ සිටින සේක.”",
      "paliTitle": "Sāmaññaphalapucchā",
      "englishTitle": "Question on the Fruit of Recluseship",
      "sinhalaTitle": "සාමණ‍්‍යඵල ප‍්‍රශ‍්නය"
    },
    {
      "number": 161,
      "pali": "Atha kho rājā māgadho ajātasattu vedehiputto yena bhagavā tenupasaṅkami; upasaṅkamitvā ekamantaṃ aṭṭhāsi. Ekamantaṃ ṭhito kho rājā māgadho ajātasattu vedehiputto tuṇhībhūtaṃ tuṇhībhūtaṃ bhikkhusaṅghaṃ anuviloketvā rahadamiva vippasannaṃ udānaṃ udānesi – ‘‘iminā me upasamena udayabhaddo [udāyibhaddo (sī. pī.)] kumāro samannāgato hotu, yenetarahi upasamena bhikkhusaṅgho samannāgato’’ti. ‘‘Agamā kho tvaṃ, mahārāja, yathāpema’’nti. ‘‘Piyo me, bhante, udayabhaddo kumāro. Iminā me, bhante, upasamena udayabhaddo kumāro samannāgato hotu yenetarahi upasamena bhikkhusaṅgho samannāgato’’ti.",
      "english": "Then King Ajātasattu of Magadha, son of Vedehī, approached the Blessed One; having approached, he stood to one side. Standing to one side, King Ajātasattu of Magadha, son of Vedehī, looked over the utterly silent assembly of bhikkhus, clear as a still lake, and uttered this exclamation: \"May Prince Udayabhadda be endowed with this same tranquility with which the assembly of bhikkhus is now endowed!\"\n\n\"Indeed, great king, you speak according to your affection.\"\n\n\"My Lord, Prince Udayabhadda is dear to me. My Lord, may Prince Udayabhadda be endowed with this same tranquility with which the assembly of bhikkhus is now endowed.\"",
      "sinhala": "ඉන්පසු වේදේහිපුත්‍ර මාගධ රජ අජාතශත්‍රැ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ එක් පසෙක සිටගත්තේය.\n\nඑක් පසෙක සිටගෙන සිටි වේදේහිපුත්‍ර මාගධ රජ අජාතශත්‍රැ, නිශ්ශබ්ද වූ භික්‍ෂුසංඝයා මනාව බලා, (ඒ) මනාව ප්‍රසන්න වූ විලක් මෙන් (දැක) උදානයක් පිට කළේය: \"යම් උපශාන්තියකින් මේ භික්‍ෂුසංඝයා යුක්තව සිටින්නේද, මාගේ උදයභද්‍ර කුමාරයාද මේ උපශාන්තියෙන් යුක්ත වේවා!\"\n\n\"මහරජ, ඔබ පෙම් කළ ආකාරයෙන් කතා කළා.\"\n\n\"ස්වාමීනී, උදයභද්‍ර කුමාරයා මට ප්‍රියය. ස්වාමීනී, යම් උපශාන්තියකින් මේ භික්‍ෂුසංඝයා යුක්තව සිටින්නේද, මාගේ උදයභද්‍ර කුමාරයාද මේ උපශාන්තියෙන් යුක්ත වේවා!\"",
      "paliTitle": ""
    },
    {
      "number": 162,
      "pali": "Atha kho rājā māgadho ajātasattu vedehiputto bhagavantaṃ abhivādetvā, bhikkhusaṅghassa añjaliṃ paṇāmetvā, ekamantaṃ nisīdi. Ekamantaṃ nisinno kho rājā māgadho ajātasattu vedehiputto bhagavantaṃ etadavoca – ‘‘puccheyyāmahaṃ, bhante, bhagavantaṃ kiñcideva desaṃ [kiñcideva desaṃ lesamattaṃ (syā. kaṃ. ka.)]; sace me bhagavā okāsaṃ karoti pañhassa veyyākaraṇāyā’’ti. ‘‘Puccha, mahārāja, yadākaṅkhasī’’ti.",
      "english": "Then King Ajātasattu of Magadha, son of Videhi, having saluted the Blessed One and having paid homage with clasped hands to the community of monks, sat down to one side. Seated to one side, King Ajātasattu of Magadha, son of Videhi, said this to the Blessed One: \"Venerable sir, I would like to ask the Blessed One about something, if the Blessed One grants me the opportunity to answer the question.\" \"Ask, great king, whatever you wish.\"",
      "sinhala": "ඉන්පසු මාගධ රජු වූ වේදේහී පුත්‍ර අජාතසත්තු භාග්‍යවතුන් වහන්සේට වැඳ නමස්කාර කොට, භික්ෂු සංඝයාට ඇඳිලි බැඳ, එකත්පසෙක වාඩි විය.\n\nඑකත්පසෙක වාඩි වී සිටි මාගධ රජු වූ වේදේහී පුත්‍ර අජාතසත්තු භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"ස්වාමීනි, යම් කිසි කරුණක් පිළිබඳව භාග්‍යවතුන් වහන්සේගෙන් ප්‍රශ්න කිරීමට මම කැමැත්තෙමි. යම් හෙයකින් භාග්‍යවතුන් වහන්සේ මාගේ ප්‍රශ්නයට පිළිතුරු දීම සඳහා අවකාශ සලසා දෙන සේක් නම්.\"\n\n\"මහරාජ, ඔබ කැමති දෙයක් අසන්නැ\"යි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 163,
      "pali": "‘‘Yathā nu kho imāni, bhante, puthusippāyatanāni, seyyathidaṃ – hatthārohā assārohā rathikā dhanuggahā celakā calakā piṇḍadāyakā uggā rājaputtā pakkhandino mahānāgā sūrā cammayodhino dāsikaputtā āḷārikā kappakā nhāpakā [nahāpikā (sī.), nhāpikā (syā.)] sūdā mālākārā rajakā pesakārā naḷakārā kumbhakārā gaṇakā muddikā, yāni vā panaññānipi evaṃgatāni puthusippāyatanāni, te diṭṭheva dhamme sandiṭṭhikaṃ sippaphalaṃ upajīvanti; te tena attānaṃ sukhenti pīṇenti [pīnenti (katthaci)], mātāpitaro sukhenti pīṇenti, puttadāraṃ sukhenti pīṇenti, mittāmacce sukhenti pīṇenti, samaṇabrāhmaṇesu [samaṇesu brāhmaṇesu (ka.)] uddhaggikaṃ dakkhiṇaṃ patiṭṭhapenti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Sakkā nu kho, bhante, evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’’nti?",
      "english": "Just as, venerable sir, these various crafts — namely, elephant riders, horse riders, charioteers, archers, armorers, acrobats, caterers, nobles, princes, combatants, elephant-warriors, warriors, shield-fighters, royal servants, palace cooks, barbers, bath attendants, cooks, garland makers, dyers, weavers, reed workers, potters, accountants, and seal-makers — or indeed any other such various crafts, they earn their living from the visible fruit of their craftsmanship in this very life; they thereby make themselves happy and content, they make their parents happy and content, they make their wives and children happy and content, they make their friends and associates happy and content, and they establish an elevated offering for recluses and brahmins, one that leads to a happy result, to a good destiny, and to heaven. Is it possible, venerable sir, to declare in this same way a visible fruit of recluseship, apparent in this very life?",
      "sinhala": "භාග්‍ය​වතුන් වහන්ස, යම් සේ මේ විවිධ ශිල්පයන් වන හස්ත්‍යාරෝහකයෝ, අශ්වාරෝහකයෝ, රථකයෝ, ධනු‍්ධරයෝ, චේලකයෝ, චාලකයෝ, පිණ්ඩදායකයෝ, උග්ගයෝ, රාජපුත්‍රයෝ, ප්‍රක්‍ෂන්දියෝ, මහානාගයෝ, ශූරයෝ, චර්මයෝධියෝ, දාසීපුත්‍රයෝ, ආලාරිකයෝ, කප්පකයෝ, නාපකයෝ, සූපකයෝ, මාලාකාරයෝ, රජකයෝ, පේසකාරයෝ, නළකාරයෝ, කුම්භකාරයෝ, ගණකයෝ, මුද්‍රිකයෝ, හෝ මේ වැනි අන්‍ය වූ විවිධ ශිල්ප කර්මාන්ත ඇත්තෝ, මේ දෘශ්‍යමාන ලෝකයේදීම තම ශිල්පයේ ප්‍රත්‍යක්ෂ ඵලයෙන් ජීවත් වෙත් ද; ඔවුහු එයින් තමන්ව සතුටු කරති, පෝෂණය කරති; මව්පියන් සතුටු කරති, පෝෂණය කරති; අඹු දරුවන් සතුටු කරති, පෝෂණය කරති; මිත්‍ර අමාත්‍යවරුන් සතුටු කරති, පෝෂණය කරති; ශ්‍රමණ බ්‍රාහ්මණයන් කෙරෙහි ස්වර්ගයට පමුණුවන, සැප විපාක ඇති, ස්වර්ග සම්පත්තියට හේතු වන උත්කෘෂ්ට දක්ෂිණාවක් පිහිටුවත් ද; භාග්‍ය​වතුන් වහන්ස, එසේම මේ දෘශ්‍යමාන ලෝකයේදීම, ප්‍රත්‍යක්ෂ ශ්‍රමණ ඵලයක් ප්‍රකාශ කිරීමට පුළුවන්ද?",
      "paliTitle": ""
    },
    {
      "number": 164,
      "pali": "‘‘Abhijānāsi no tvaṃ, mahārāja, imaṃ pañhaṃ aññe samaṇabrāhmaṇe pucchitā’’ti? ‘‘Abhijānāmahaṃ, bhante, imaṃ pañhaṃ aññe samaṇabrāhmaṇe pucchitā’’ti. ‘‘Yathā kathaṃ pana te, mahārāja, byākariṃsu, sace te agaru bhāsassū’’ti. ‘‘Na kho me, bhante, garu, yatthassa bhagavā nisinno, bhagavantarūpo vā’’ti [cāti (sī. ka.)]. ‘‘Tena hi, mahārāja, bhāsassū’’ti. ",
      "english": "\"Do you recall, Great King, having asked this question of other ascetics and brahmins?\"\n\"I do recall, Venerable Sir, having asked this question of other ascetics and brahmins.\"\n\n\"But how, Great King, did they answer you? If it is not a burden for you, please speak.\"\n\"Indeed, it is no burden for me, Venerable Sir, when the Blessed One is seated, or in the presence of the Blessed One.\"\n\"Therefore, Great King, please speak.\"",
      "sinhala": "මහරජ, ඔබ මේ ප්‍රශ්නය වෙනත් ශ්‍රමණ-බ්‍රාහ්මණයන්ගෙන් විමසූ බව සිහි කරන්නේද?\nවහන්ස, මා මේ ප්‍රශ්නය වෙනත් ශ්‍රමණ-බ්‍රාහ්මණයන්ගෙන් විමසූ බව සිහි කරමි.\nමහරජ, එසේනම් ඔවුන් ඔබට කෙසේ නම් පිළිතුරු දුන්නේද? ඔබට අපහසුවක් නැත්නම්, එය පවසන්න.\nවහන්ස, භාග්‍යවතුන් වහන්සේ වැඩසිටින තැනදී හෝ භාග්‍යවතුන් වහන්සේගේ ස්වරූපයක් ඇති තැනදී මට අපහසුවක් නැත.\nඑසේනම් මහරජ, එය පවසන්න.",
      "paliTitle": ""
    },
    {
      "number": 165,
      "pali": "‘‘Ekamidāhaṃ, bhante, samayaṃ yena pūraṇo kassapo tenupasaṅkami; upasaṅkamitvā pūraṇena kassapena saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Ekamantaṃ nisinno kho ahaṃ, bhante, pūraṇaṃ kassapaṃ etadavocaṃ – ‘yathā nu kho imāni, bho kassapa, puthusippāyatanāni, seyyathidaṃ – hatthārohā assārohā rathikā dhanuggahā celakā calakā piṇḍadāyakā uggā rājaputtā pakkhandino mahānāgā sūrā cammayodhino dāsikaputtā āḷārikā kappakā nhāpakā sūdā mālākārā rajakā pesakārā naḷakārā kumbhakārā gaṇakā muddikā, yāni vā panaññānipi evaṃgatāni puthusippāyatanāni- te diṭṭheva dhamme sandiṭṭhikaṃ sippaphalaṃ upajīvanti; te tena attānaṃ sukhenti pīṇenti, mātāpitaro sukhenti pīṇenti, puttadāraṃ sukhenti pīṇenti, mittāmacce sukhenti pīṇenti, samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhapenti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Sakkā nu kho, bho kassapa, evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’nti?",
      "english": "Venerable sir, at one time I approached Pūraṇa Kassapa. Having approached him, I exchanged greetings with Pūraṇa Kassapa. After exchanging polite and memorable remarks, I sat down to one side. As I sat to one side, venerable sir, I said to Pūraṇa Kassapa: ‘Good Kassapa, just as these various crafts, such as elephant-riders, horse-riders, charioteers, archers, bodyguards, scouts, royal purveyors, nobles, royal princes, assault troops, handlers of war elephants, warriors, shielded fighters, sons of slave women, palace cooks, barbers, bath attendants, general cooks, garland-makers, dyers, weavers, reed-workers, potters, accountants, and seal-makers, or any other such various crafts—those who pursue them live by the visible fruit of their craft in this very life; with it, they make themselves happy and content, they make their parents happy and content, they make their children and wives happy and content, they make their friends and associates happy and content, and they establish lofty offerings for ascetics and brahmins, leading to happiness, resulting in pleasure, and conducive to heaven. Is it possible, good Kassapa, to declare a visible fruit of recluseship in this very life in the same way?’",
      "sinhala": "පින්වත් ස්වාමීනි, එක් සමයක මම පූරණ කස්සප සිටි තැනට පැමිණියෙමි. එසේ පැමිණ පූරණ කස්සප සමඟ සමඟි සම්මුති කතාවෙහි යෙදුණෙමි. සමඟි සම්මුති කතා ද, සිහි කටයුතු කතා ද නිමවා එක් පසෙකින් වාඩි වීමි. එක් පසෙකින් වාඩි වී සිටි මම, පින්වත් ස්වාමීනි, පූරණ කස්සපට මෙය කීවෙමි –\n\n‘භවත් කස්සපයෙනි, යම් සේ ඇත් ඇදුරන්, අස් ඇදුරන්, රථ ශිල්පීන්, දුනු ශිල්පීන්, රෙදි පිළි කරුවන්, නැටුම් ශිල්පීන්, ආහාර සපයන්නන්, උග්‍ර කුලවතුන්, රාජ කුමාරවරුන්, සටනට පනින්නන්, මහා ඇතුන් මෙහෙයවන්නන්, වීරයන්, සම් ආයුධධාරී යුද්ධ භටයන්, දාස පුත්‍රයන්, ආලාරිකයන්, කෙස් කපන්නන්, නහවන්නන්, සූපවේදීන්, මල්කරුවන්, රෙදි සෝදන්නන්, වියන්නන්, උණ බට ශිල්පීන්, කුඹල්කරුවන්, ගණකාධිකාරීන්, මුදල් මාරු කරන්නන්, හෝ මේ හා සමාන අන්‍ය නොයෙක් ශිල්පීන් වෙත් ද – ඔවුහු මේ ආත්මභාවයේ දී ම ප‍්‍රත්‍යක්ෂ ශිල්ප ඵලයකින් ජීවත් වෙති. ඔවුහු ඒ හේතුවෙන් තමන් ව සුවපත් කර ගනිති, පිනවති; මව්පියන් ව සුවපත් කරති, පිනවති; දූ දරුවන් ව සුවපත් කරති, පිනවති; මිත්‍ර අමාත්‍යයන් ව සුවපත් කරති, පිනවති; ශ‍්‍රමණ බ්‍රාහ්මණයන් කෙරෙහි, පරලොව උසස් තත්ත්වයකට පමුණුවන, සුව විපාක ඇති, ස්වර්ගයට ගෙන යන දක්ෂිණාවක් පිහිටුවති. භවත් කස්සපයෙනි, එසේම මේ ආත්මභාවයේ දී ම ප‍්‍රත්‍යක්ෂ ශ‍්‍රමණ ඵලයක් ප‍්‍රකාශ කළ හැකි ද?’",
      "paliTitle": "Pūraṇakassapavādo",
      "englishTitle": "Pūraṇa Kassapa's Doctrine",
      "sinhalaTitle": "පූරණකස්‍සප වාදය"
    },
    {
      "number": 166,
      "pali": "‘‘Evaṃ vutte, bhante, pūraṇo kassapo maṃ etadavoca – ‘karoto kho, mahārāja, kārayato, chindato chedāpayato, pacato pācāpayato socayato, socāpayato, kilamato kilamāpayato, phandato phandāpayato, pāṇamatipātāpayato, adinnaṃ ādiyato, sandhiṃ chindato, nillopaṃ harato, ekāgārikaṃ karoto, paripanthe tiṭṭhato, paradāraṃ gacchato, musā bhaṇato, karoto na karīyati pāpaṃ. Khurapariyantena cepi cakkena yo imissā pathaviyā pāṇe ekaṃ maṃsakhalaṃ ekaṃ maṃsapuñjaṃ kareyya, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Dakkhiṇaṃ cepi gaṅgāya tīraṃ gaccheyya hananto ghātento chindanto chedāpento pacanto pācāpento, natthi tatonidānaṃ pāpaṃ, natthi pāpassa āgamo. Uttarañcepi gaṅgāya tīraṃ gaccheyya dadanto dāpento yajanto yajāpento, natthi tatonidānaṃ puññaṃ, natthi puññassa āgamo. Dānena damena saṃyamena saccavajjena natthi puññaṃ, natthi puññassa āgamo’ti. Itthaṃ kho me, bhante, pūraṇo kassapo sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno akiriyaṃ byākāsi. ‘‘Seyyathāpi, bhante, ambaṃ vā puṭṭho labujaṃ byākareyya, labujaṃ vā puṭṭho ambaṃ byākareyya; evameva kho me, bhante, pūraṇo kassapo sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno akiriyaṃ byākāsi. Tassa mayhaṃ, bhante, etadahosi – ‘kathañhi nāma mādiso samaṇaṃ vā brāhmaṇaṃ vā vijite vasantaṃ apasādetabbaṃ maññeyyā’ti. So kho ahaṃ, bhante, pūraṇassa kassapassa bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikositvā anattamano, anattamanavācaṃ anicchāretvā, tameva vācaṃ anuggaṇhanto anikkujjanto [anikkujjento (syā. kaṃ. ka.)] uṭṭhāyāsanā pakkamiṃ [pakkāmiṃ (sī. syā. kaṃ. pī.)]. ",
      "english": "When this was said, venerable sir, Pūraṇa Kassapa said this to me: ‘Indeed, great king, for one acting or causing to act, for one cutting or causing to cut, for one burning or causing to burn, for one grieving or causing to grieve, for one wearying or causing to weary, for one trembling or causing to tremble, for one destroying life or causing life to be destroyed, for one taking what is not given, for one breaking into houses, for one plundering, for one committing highway robbery, for one standing in ambush, for one going to another’s wife, for one speaking falsehoods — doing these acts, no evil is done. Even if someone, with a razor-edged disc, were to turn all living beings on this earth into one single heap of flesh, one single pile of meat, there would be no evil from that cause, no coming of evil. Even if one were to go to the south bank of the Ganges, killing and slaughtering, cutting and causing to cut, burning and causing to burn, there would be no evil from that cause, no coming of evil. Even if one were to go to the north bank of the Ganges, giving and causing to give, sacrificing and causing to sacrifice, there would be no merit from that cause, no coming of merit. By giving, by self-control, by restraint, by speaking truth, there is no merit, no coming of merit.’ Thus, venerable sir, when Pūraṇa Kassapa was asked about the immediate fruit of recluseship, he expounded a doctrine of non-action.\n\nJust as, venerable sir, if one were asked about a mango, one would declare a breadfruit, or if asked about a breadfruit, one would declare a mango; even so, venerable sir, Pūraṇa Kassapa, when asked about the immediate fruit of recluseship, expounded a doctrine of non-action. Then, venerable sir, it occurred to me: ‘How indeed could someone like me consider it proper to disparage a recluse or brahmin living in my domain?’ So then, venerable sir, I neither approved nor rejected Pūraṇa Kassapa’s statement. Not approving, not rejecting, displeased, but without uttering a word of displeasure, neither accepting nor refuting that teaching, I rose from my seat and departed.",
      "sinhala": "‘‘ස්වාමීනි, මෙසේ කී කල්හි, පූරණ කස්සප මට මෙසේ කීවේය: –\n\n‘‘මහ රජ, කරන්නේට, කරවන්නේට; සිඳින්නේට, සිඳවන්නේට; උයන්නේට, උයවන්නේට; ශෝක කරන්නේට, ශෝක කරවන්නේට; වෙහෙසෙන්නේට, වෙහෙසවන්නේට; සැලෙන්නේට, සෙලවන්නේට; ප‍්‍රාණඝාත කරන්නේට, ප‍්‍රාණඝාත කරවන්නේට; අදත්තාදානය කරන්නේට; සන්ධි ඡේදනය කරන්නේට; කොල්ලකන්නේට; තනි ගෙවල්වලට කඩා වදින්නේට; මග රැක සිටින්නේට; පරදාර සේවනය කරන්නේට; මුසාවාදා කරන්නේට – (මෙයින්) පාපයක් සිදු නොවේ. රුධිරය තෙක් කැපෙන රිය සකකින් යමෙක් මේ පෘථිවියේ සිටින ප‍්‍රාණීන්ව එක් මස් ගොඩක්, එක් මස් පිඬක් බවට පත් කළත්, එයින් සිදුවන පාපයක් නැත. පාපයක් රැස්වීමක් නැත. ගඟේ දකුණු තීරයට ගොස් මරමින්, මරවමින්; සිඳිමින්, සිඳවමින්; උයමින්, උයවමින් ක‍්‍රියා කළත්, එයින් සිදුවන පාපයක් නැත. පාපයක් රැස්වීමක් නැත. ගඟේ උතුරු තීරයට ගොස් දෙමින්, දෙවමින්; පූජා කරමින්, පූජා කරවමින් ක‍්‍රියා කළත්, එයින් සිදුවන පිනක් නැත. පිනක් රැස්වීමක් නැත. දානයෙන්, දමනයෙන්, සංයමයෙන්, සත්‍ය වචනයෙන් පිනක් නැත. පිනක් රැස්වීමක් නැත.’ යැයි (පූරණ කස්සප මට කීවේය). ස්වාමීනි, මෙලෙස පූරණ කස්සපගෙන් සන්දිට්ඨික ශ‍්‍රමණ ඵලය ගැන විමසූ කල්හි ඔහු අක‍්‍රියවාදය ප‍්‍රකාශ කළේය.\n\n‘‘ස්වාමීනි, යම් සේ අඹ ගැන ඇසූ කල්හි කොසඹ ගැන කියයිද, නැතහොත් කොසඹ ගැන ඇසූ කල්හි අඹ ගැන කියයිද; එපරිද්දෙන්ම, ස්වාමීනි, පූරණ කස්සප සන්දිට්ඨික ශ‍්‍රමණ ඵලය ගැන විමසූ කල්හි අක‍්‍රියවාදය ප‍්‍රකාශ කළේය. ස්වාමීනි, එවිට මට මෙසේ සිතුණි – ‘මා වැනි අයෙක් තමන්ගේ රාජධානියේ වෙසෙන ශ‍්‍රමණයෙකුට හෝ බ‍්‍රාහ්මණයෙකුට කෙසේ නම් අවමන් කරන්නේද?’ කියා. ස්වාමීනි, ඒ මම පූරණ කස්සපගේ වචනය අනුමත කළේද නැත, ප‍්‍රතික්ෂේප කළේද නැත. අනුමත නොකර, ප‍්‍රතික්ෂේප නොකර, අසතුටු සිතින් සිටියද, අසතුටු වචනයක් පිට නොකර, ඔහුගේ එම වචනය (කිසිසේත්ම) අල්ලා නොගෙන හෝ ඉවත නොදමා, අසුනෙන් නැගිට පිටත්ව ගියෙමි.",
      "paliTitle": ""
    },
    {
      "number": 167,
      "pali": "‘‘Ekamidāhaṃ, bhante, samayaṃ yena makkhali gosālo tenupasaṅkamiṃ; upasaṅkamitvā makkhalinā gosālena saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Ekamantaṃ nisinno kho ahaṃ, bhante, makkhaliṃ gosālaṃ etadavocaṃ – ‘yathā nu kho imāni, bho gosāla, puthusippāyatanāni…pe… sakkā nu kho, bho gosāla, evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’nti?",
      "english": "Venerable sir, at one time I approached Makkhali Gosāla; having approached him, I exchanged greetings with Makkhali Gosāla. Having concluded the courteous and memorable talk, I sat down to one side. Venerable sir, as I was sitting respectfully aside, I said this to Makkhali Gosāla: “O Gosāla, just as these various kinds of crafts have their visible results, is it possible, O Gosāla, to declare a visible fruit of recluseship in this very life in the same way?”",
      "sinhala": "භාග්‍යවතුන් වහන්ස, එක් කලෙක මම මක්ඛලී ගෝසාල වෙත පැමිණියෙමි. පැමිණ, මක්ඛලී ගෝසාල සමඟ ප‍්‍රීති සිතින් කතාබස් කළෙමි. ප‍්‍රියශීලී, සිහිකටයුතු කතාබස් නිමා කර, එක් පසෙකින් වාඩි වීමි. භාග්‍යවතුන් වහන්ස, එසේ එක් පසෙක වාඩි වී සිටි මම මක්ඛලී ගෝසාලට මෙසේ කීවෙමි – \"ගෝසාල මහතාණෙනි, යම් සේ මේ නොයෙක් ශිල්පස්ථානවලින් මේ ජීවිතයේම දිට්ඨධම්මික ඵල ලැබිය හැකිද, එසේම මේ දැකිය හැකි ධර්මය තුළද ශ‍්‍රමණභාවයේ දිට්ඨධම්මික ඵලය ප‍්‍රකාශ කළ හැකිදැයි?\"",
      "paliTitle": "Makkhaligosālavādo",
      "englishTitle": "Makkhali Gosala's Doctrine",
      "sinhalaTitle": "මක්‍ඛලි ගෝසාල වාදය"
    },
    {
      "number": 168,
      "pali": "‘‘Evaṃ vutte, bhante, makkhali gosālo maṃ etadavoca – ‘natthi mahārāja hetu natthi paccayo sattānaṃ saṃkilesāya, ahetū [ahetu (katthaci)] apaccayā sattā saṃkilissanti. Natthi hetu, natthi paccayo sattānaṃ visuddhiyā, ahetū apaccayā sattā visujjhanti. Natthi attakāre, natthi parakāre, natthi purisakāre, natthi balaṃ, natthi vīriyaṃ, natthi purisathāmo, natthi purisaparakkamo. Sabbe sattā sabbe pāṇā sabbe bhūtā sabbe jīvā avasā abalā avīriyā niyatisaṅgatibhāvapariṇatā chasvevābhijātīsu sukhadukkhaṃ [sukhañca dukkhañca (syā.)] paṭisaṃvedenti. Cuddasa kho panimāni yonipamukhasatasahassāni saṭṭhi ca satāni cha ca satāni pañca ca kammuno satāni pañca ca kammāni tīṇi ca kammāni kamme ca aḍḍhakamme ca dvaṭṭhipaṭipadā dvaṭṭhantarakappā chaḷābhijātiyo aṭṭha purisabhūmiyo ekūnapaññāsa ājīvakasate ekūnapaññāsa paribbājakasate ekūnapaññāsa nāgāvāsasate vīse indriyasate tiṃse nirayasate chattiṃsa rajodhātuyo satta saññīgabbhā satta asaññīgabbhā satta nigaṇṭhigabbhā satta devā satta mānusā satta pisācā satta sarā satta pavuṭā [sapuṭā (ka.), pabuṭā (sī.)] satta pavuṭasatāni satta papātā satta papātasatāni satta supinā satta supinasatāni cullāsīti mahākappino [mahākappuno (ka. sī. pī.)] satasahassāni, yāni bāle ca paṇḍite ca sandhāvitvā saṃsaritvā dukkhassantaṃ karissanti. Tattha natthi ‘‘imināhaṃ sīlena vā vatena vā tapena vā brahmacariyena vā aparipakkaṃ vā kammaṃ paripācessāmi, paripakkaṃ vā kammaṃ phussa phussa byantiṃ karissāmī’ti hevaṃ natthi. Doṇamite sukhadukkhe pariyantakate saṃsāre, natthi hāyanavaḍḍhane, natthi ukkaṃsāvakaṃse. Seyyathāpi nāma suttaguḷe khitte nibbeṭhiyamānameva paleti, evameva bāle ca paṇḍite ca sandhāvitvā saṃsaritvā dukkhassantaṃ karissantī’ti.",
      "english": "When this was said, Venerable Sir, Makkhali Gosāla said this to me: ‘Great king, there is no cause, no condition for the defilement of beings; beings become defiled without cause or condition. There is no cause, no condition for the purification of beings; beings become purified without cause or condition. There is no self-doer, no other-doer, no human effort, no strength, no energy, no human might, no human striving. All beings, all creatures, all existences, all living things are without power, without strength, without energy, determined by fate, circumstance, and nature, and they experience pleasure and pain in the six kinds of existence. These are fourteen hundred thousand principal birth-bases; six thousand; six hundred; five hundred actions; five actions; three actions; an action and a half-action; sixty-two paths; sixty-two intermediate eons; six kinds of existence; eight stages of human existence; forty-nine hundreds of Ajivika livelihoods; forty-nine hundreds of wanderers; forty-nine hundreds of Nāga abodes; twenty hundreds of faculties; thirty hundreds of hells; thirty-six dust-elements; seven conscious embryos; seven unconscious embryos; seven Nigaṇṭha embryos; seven kinds of gods; seven kinds of humans; seven kinds of demons; seven kinds of lakes; seven kinds of manifested states; seven hundreds of manifested states; seven kinds of precipices; seven hundreds of precipices; seven kinds of dreams; seven hundreds of dreams; and eighty-four hundred thousand great eons—through all of which fools and wise alike will wander and transmigrate until they make an end of suffering. Regarding this, there is no such thing as, ‘By this virtue, or vow, or ascetic practice, or holy life, I shall bring to maturity karma that is not yet mature, or having repeatedly touched mature karma, I shall eliminate it.’ Such a thing does not exist. In this suffering and pleasure, which is measured like a *dona*, and in this cycle of existence which has a fixed limit, there is no diminishing or increasing, no exaltation or debasement. Just as a ball of string, when thrown, unwinds itself completely, so too, fools and wise alike will wander and transmigrate until they make an end of suffering.’",
      "sinhala": "භාග්‍යවතුන් වහන්ස, මෙසේ කී කල්හි, මක්ඛලී ගෝසාල මට මෙසේ පැවසීය – ‘මහරජ, සත්ත්වයන් කෙලෙසීම පිණිස හේතුවක් නැත, ප්‍රත්‍යයක් නැත. හේතු රහිතව, ප්‍රත්‍ය රහිතව සත්ත්වයෝ කෙලෙසෙති. සත්ත්වයන් පිරිසිදු වීම පිණිස හේතුවක් නැත, ප්‍රත්‍යයක් නැත. හේතු රහිතව, ප්‍රත්‍ය රහිතව සත්ත්වයෝ පිරිසිදු වෙති. තමා විසින් කිරීමක් නැත, අනුන් විසින් කිරීමක් නැත, පුරුෂයා විසින් කිරීමක් නැත, බලයක් නැත, වීර්යයක් නැත, පුරුෂ ධෛර්යයක් නැත, පුරුෂ පරාක්‍රමයක් නැත. සියලු සත්ත්වයෝ, සියලු ප්‍රාණීහු, සියලු භූතයෝ, සියලු ජීවීහු අසරණයෝය, දුබලයෝය, වීර්ය රහිතයෝය, නියතියෙන්, සංගතියෙන්, භාවයෙන් පරිණත වූවෝය. ඔවුහු උපත් සයෙහිම සැප දුක් විඳිති. එසේම මේවා යෝනි ප්‍රමුඛ ලක්ෂ දාහතරකි, සියක් කොටස් සැටකි, සියක් කොටස් සයකි, කර්ම කොටස් පන්සියයකි, කර්ම පහකි, කර්ම තුනකි, කර්මයකි, අර්ධ කර්මයකි, ප්‍රතිපදා හැටදෙකකි, අන්තර කල්ප හැටදෙකකි, අභිජාති සයකි, පුරිස භූමි අටකි, ආජීවක සියක් කොටස් හතළිස් නවයකි, පරිබ්‍රාජක සියක් කොටස් හතළිස් නවයකි, නාගාවාස සියක් කොටස් හතළිස් නවයකි, ඉන්ද්‍රිය සියක් කොටස් විස්සකි, නිරය සියක් කොටස් තිහකි, රජෝ ධාතු තිස් හයකි, සඥ්ඤී ගර්භ සතකි, අසඥ්ඤී ගර්භ සතකි, නිගන්ඨ ගර්භ සතකි, දෙවිවරු සතකි, මනුෂ්‍යයෝ සතකි, පිසාචයෝ සතකි, සර සතකි, පවුට සතකි, පවුට සියක් කොටස් සතකි, පපාත සතකි, පපාත සියක් කොටස් සතකි, සුපින සතකි, සුපින සියක් කොටස් සතකි, අසූ හතර ලක්ෂ මහ කල්පයෝය. ඒවා තුළින් ගමන් කොට, මෝඩයෝද, පණ්ඩිතයෝද සසරෙහි සැරිසරා, දුකෙහි කෙළවර කරති. එහි, ‘මේ සීලයෙන් හෝ වතින් හෝ තපසින් හෝ බ්‍රහ්මචර්යාවෙන් හෝ නොපැසුණු කර්මය පසවන්නෙමි, පැසුණු කර්මය වරින් වර අත්දකිමින් අවසන් කරන්නෙමි’ යනුවෙන් එබඳු දෙයක් නැත. දෝණයක් පමණ වූ සැප දුක් ඇති, කෙළවර කරන ලද සංසාරයෙහි අඩු වීමක් හෝ වැඩි වීමක් නැත, උසස් වීමක් හෝ පහත් වීමක් නැත. යම්සේ නූල් බෝලයක් විසිකළ කල්හි දිගහැරෙමින්ම යන්නේද, එසේම මෝඩයෝද, පණ්ඩිතයෝද සසරෙහි දුවමින්, සැරිසරමින් දුකෙහි කෙළවර කරති.’",
      "paliTitle": ""
    },
    {
      "number": 169,
      "pali": "‘‘Itthaṃ kho me, bhante, makkhali gosālo sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno saṃsārasuddhiṃ byākāsi. Seyyathāpi, bhante, ambaṃ vā puṭṭho labujaṃ byākareyya, labujaṃ vā puṭṭho ambaṃ byākareyya; evameva kho me, bhante, makkhali gosālo sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno saṃsārasuddhiṃ byākāsi. Tassa mayhaṃ, bhante, etadahosi – ‘kathañhi nāma mādiso samaṇaṃ vā brāhmaṇaṃ vā vijite vasantaṃ apasādetabbaṃ maññeyyā’ti. So kho ahaṃ, bhante, makkhalissa gosālassa bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikkositvā anattamano, anattamanavācaṃ anicchāretvā, tameva vācaṃ anuggaṇhanto anikkujjanto uṭṭhāyāsanā pakkamiṃ. ",
      "english": "Thus, venerable sir, when I asked Makkhali Gosāla about the immediate fruits of recluseship, he declared the purification of transmigration. Just as, venerable sir, if one were asked about a mango, one would declare a breadfruit, or if asked about a breadfruit, one would declare a mango; even so, venerable sir, when I asked Makkhali Gosāla about the immediate fruits of recluseship, he declared the purification of transmigration. To me, venerable sir, this thought occurred: ‘How could one like me think it proper to disparage a recluse or brahmin dwelling in the land?’ So I, venerable sir, neither approved nor rejected Makkhali Gosāla’s statement. Without approving or rejecting, and displeased, yet without uttering any words of displeasure, and without committing to or refuting that statement, I rose from my seat and departed.",
      "sinhala": "භාග්‍ය​වතුන් වහන්ස, මේ අයුරින් මක්ඛලි ගෝසාල මා විසින් මේ ජීවිතයේ පෙනෙන ශ්‍ර​මණ ඵලය පිළිබඳව විමසන ලදුව, සංසාර ශුද්ධිය ගැන ප්‍ර​කාශ කළේය. භාග්‍ය​වතුන් වහන්ස, යම්සේ අඹ ගැන විමසූ විට වරකා ගැන ප්‍ර​කාශ කරන්නේද, නැතහොත් වරකා ගැන විමසූ විට අඹ ගැන ප්‍ර​කාශ කරන්නේද, එපරිද්දෙන්ම භාග්‍ය​වතුන් වහන්ස, මක්ඛලි ගෝසාල මා විසින් මේ ජීවිතයේ පෙනෙන ශ්‍ර​මණ ඵලය පිළිබඳව විමසන ලදුව, සංසාර ශුද්ධිය ගැන ප්‍ර​කාශ කළේය. භාග්‍ය​වතුන් වහන්ස, එවිට මට මෙසේ සිතුණි – ‘මා වැනි කෙනෙකු විසින් තමන්ගේ රාජ්‍යයේ වෙසෙන ශ්‍ර​මණයෙක් හෝ බ්‍රාහ්මණයෙක් බැහැර කළ යුත්තෙක් යැයි සිතන්නේ කෙසේද?’ එබැවින් භාග්‍ය​වතුන් වහන්ස, මම මක්ඛලි ගෝසාලගේ බස අනුමත කළේද නැත, ප්‍රති​ක්‍ෂේප කළේද නැත. අනුමත නොකොට, ප්‍රති​ක්‍ෂේප නොකොට, අසතුටු සිතින්, අසතුටු වචනයක් පිට නොකොට, එම වචනය පිළිගැනීමක් හෝ ප්‍රති​ක්‍ෂේප කිරීමක් නොකොට, ආසනයෙන් නැගිට පිටත්ව ගියෙමි.",
      "paliTitle": ""
    },
    {
      "number": 170,
      "pali": "‘‘Ekamidāhaṃ, bhante, samayaṃ yena ajito kesakambalo tenupasaṅkamiṃ; upasaṅkamitvā ajitena kesakambalena saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Ekamantaṃ nisinno kho ahaṃ, bhante, ajitaṃ kesakambalaṃ etadavocaṃ – ‘yathā nu kho imāni, bho ajita, puthusippāyatanāni…pe… sakkā nu kho, bho ajita, evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’nti?",
      "english": "Once, venerable sir, I approached Ajita Kesakambala. Having approached, I exchanged greetings with Ajita Kesakambala. After concluding a courteous and memorable conversation, I sat down to one side. Seated to one side, venerable sir, I said to Ajita Kesakambala this: ‘Just as, good Ajita, these various crafts and professions are known to have visible fruits and visible results in this very life, is it possible, good Ajita, to point out a visible fruit of recluseship in the same way, in this very life?’",
      "sinhala": "භන්තෙ, මා විසින් එක් සමයක අජිත කේසකම්බල සිටි තැනට එළඹුණෙමි. එළඹ අජිත කේසකම්බල සමඟ සතුටු සාමිචියෙහි යෙදුණෙමි. සතුටු විය යුතු සිහි කටයුතු කතා බස් අවසන් කොට එකත්පස්ව වාඩි වීමි. භන්තෙ, එකත්පස්ව වාඩි වී සිටි මම අජිත කේසකම්බලට මෙය කීවෙමි: ‘භවත් අජිත, යම් සේ නම් මේ නොයෙක් ශිල්ප‍ ක්‍රමයන්හි (ප්‍රත්‍යක්ෂ ඵල මෙලොවදීම) පවතීද, එලෙසින්ම, භවත් අජිත, මේ දිට්ඨධම්මයේදීම ප්‍රත්‍යක්ෂ ශ්‍රමණ ඵලයක් පෙන්වා දීමට හැකිද?’",
      "paliTitle": "Ajitakesakambalavādo",
      "englishTitle": "Ajita Kesakambala's Doctrine",
      "sinhalaTitle": "අජිත කේසකම්බල වාදය"
    },
    {
      "number": 171,
      "pali": "‘‘Evaṃ vutte, bhante, ajito kesakambalo maṃ etadavoca – ‘natthi, mahārāja, dinnaṃ, natthi yiṭṭhaṃ, natthi hutaṃ, natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko, natthi ayaṃ loko [paraloko (syā.)], natthi paro loko, natthi mātā, natthi pitā, natthi sattā opapātikā, natthi loke samaṇabrāhmaṇā sammaggatā [samaggatā (ka.), samaggatā (syā.)] sammāpaṭipannā, ye imañca lokaṃ parañca lokaṃ sayaṃ abhiññā sacchikatvā pavedenti. Cātumahābhūtiko ayaṃ puriso, yadā kālaṅkaroti, pathavī pathavikāyaṃ anupeti anupagacchati, āpo āpokāyaṃ anupeti anupagacchati, tejo tejokāyaṃ anupeti anupagacchati, vāyo vāyokāyaṃ anupeti anupagacchati, ākāsaṃ indriyāni saṅkamanti. Āsandipañcamā purisā mataṃ ādāya gacchanti. Yāvāḷāhanā padāni paññāyanti. Kāpotakāni aṭṭhīni bhavanti, bhassantā āhutiyo. Dattupaññattaṃ yadidaṃ dānaṃ. Tesaṃ tucchaṃ musā vilāpo ye keci atthikavādaṃ vadanti. Bāle ca paṇḍite ca kāyassa bhedā ucchijjanti vinassanti, na honti paraṃ maraṇā’ti.",
      "english": "When this was said, Venerable Sir, Ajita Kesakambala spoke thus to me: ‘There is no giving, O great king, no offering, no sacrifice, no fruit or result of good and bad actions. There is no present world, no world beyond, no mother, no father, no spontaneously arisen beings. There are no ascetics and brahmins in this world who are rightly gone, rightly practicing, and who, having themselves realized and directly experienced this world and the world beyond, proclaim it. This person is made of the four great elements. When he dies, earth returns to the earth-body and merges with it, water returns to the water-body and merges with it, fire returns to the fire-body and merges with it, wind returns to the wind-body and merges with it, and the senses pass into space. Five men, with the bier as the fifth, carry the corpse away. The footprints are visible only as far as the burning ground. The bones turn pigeon-colored, and the offerings end in ashes. This giving is a doctrine proclaimed by fools. Their talk is empty, false prattle, whoever preach a doctrine of existence. Both fools and the wise, at the dissolution of the body, are utterly destroyed and perish; they do not exist after death.’",
      "sinhala": "භාග්‍ය​වතුන් වහන්ස, මෙසේ පැවසූ විට, අජිත කේසකම්බල මා හට මෙසේ කීවේය: 'මහරජ, දීමක් නැත, යාගයක් නැත, පූජාවක් නැත, හොඳ නරක කර්මයන්ගේ ඵලයක් හෝ විපාකයක් නැත, මේ ලෝකයක් නැත, පරලොවක් නැත, මවක් නැත, පියෙක් නැත, ඕපපාතික සත්වයෝ නැත, මේ ලෝකයේ තමන් විසින්ම මේ ලෝකයද පරලොවද අභිඥාවෙන් අවබෝධ කොට ප්‍ර​කාශ කරන්නාවූ මනා ගමන් ඇති, මනා ප්‍රති​පදාවෙන් යුක්තවූ ශ්‍ර​මණ බ්‍රා​හ්මණයෝ නැත. මෙම පුරුෂයා සතර මහා භූතයන්ගෙන් සැදුම් ලද්දෙකි. යම් විටක ඔහු මිය ගිය කල්හි, පඨවි ධාතුව පඨවි කයටම එකතු වී යයි. ආපෝ ධාතුව ආපෝ කයටම එකතු වී යයි. තේජෝ ධාතුව තේජෝ කයටම එකතු වී යයි. වායෝ ධාතුව වායෝ කයටම එකතු වී යයි. ඉන්ද්‍රියයන් ආකාශයට සංක්‍ර​මණය වෙයි. මළ සිරුර රැගෙන යන්නා වූ පුරුෂයෝ පස්වැන්නා වශයෙන් ආසන්දිය (මිනී ඇඳ) ද රැගෙන යති. සුසාන භූමියට යනතුරු පා සටහන් පෙනේ. අළු පැහැති අස්ථි ඉතිරි වෙයි, ආහුති (පූජා) අළු බවට පත් වේ. මේ දානය යනු හිස් වචනයකින් පණවාගත් දෙයකි. යම්කිසිවෙක් අස්තිවාදයක් (ඇතවාදයක්) කියත් නම්, ඒ ඔවුන්ගේ හිස්, බොරු විලාපයකි. මෝඩයෝද, පණ්ඩිතයෝද කය බිඳී යාමෙන් සම්පූර්ණයෙන්ම නැතිවී යති, විනාශ වෙති, මරණයෙන් පසු නැවත නොපවතිති.'",
      "paliTitle": ""
    },
    {
      "number": 172,
      "pali": "‘‘Itthaṃ kho me, bhante, ajito kesakambalo sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno ucchedaṃ byākāsi. Seyyathāpi, bhante, ambaṃ vā puṭṭho labujaṃ byākareyya, labujaṃ vā puṭṭho ambaṃ byākareyya; evameva kho me, bhante, ajito kesakambalo sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno ucchedaṃ byākāsi. Tassa mayhaṃ, bhante, etadahosi – ‘kathañhi nāma mādiso samaṇaṃ vā brāhmaṇaṃ vā vijite vasantaṃ apasādetabbaṃ maññeyyā’ti. So kho ahaṃ, bhante, ajitassa kesakambalassa bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikkositvā anattamano anattamanavācaṃ anicchāretvā tameva vācaṃ anuggaṇhanto anikkujjanto uṭṭhāyāsanā pakkamiṃ. ",
      "english": "Thus, Venerable Sir, when I asked Ajita Kesakambala about the immediate fruit of recluseship, he declared annihilationism. Just as, Venerable Sir, if one were asked about a mango and declared a breadfruit, or asked about a breadfruit and declared a mango; even so, Venerable Sir, when I asked Ajita Kesakambala about the immediate fruit of recluseship, he declared annihilationism. To me, Venerable Sir, this thought occurred: 'How could someone like me think to disparage a recluse or a Brahmin living in my realm?' So indeed I, Venerable Sir, neither delighted in nor rejected Ajita Kesakambala's teaching. Without delighting or rejecting, displeased in mind, without uttering words of displeasure, neither accepting nor rejecting that very statement, I rose from my seat and departed.",
      "sinhala": "ස්වාමීනි, මෙසේ අජිත කේසකම්බල මම සන්දිට්ඨික සාමඤ්ඤ ඵලය විමසූ කල්හි උච්ඡේදවාදය පැහැදිලි කළේය. ස්වාමීනි, යම් සේ අඹ ගැන ඇසූ විට ලබුජ (කොස්) ගැන ප්‍රකාශ කරන්නේ ද, ලබුජ (කොස්) ගැන ඇසූ විට අඹ ගැන ප්‍රකාශ කරන්නේ ද, එසෙම ස්වාමීනි, අජිත කේසකම්බල මම සන්දිට්ඨික සාමඤ්ඤ ඵලය විමසූ කල්හි උච්ඡේදවාදය පැහැදිලි කළේය. ස්වාමීනි, එවිට මට මෙසේ සිතුණි – ‘මා වැනි කෙනෙකුට තමන්ගේ රාජධානියේ වසන ශ්‍රමණයෙකු හෝ බ්‍රාහ්මණයෙකු පහත් කොට සැලකිය යුතු යැයි කෙසේ නම් සිතිය හැකි ද?’ කියා. ස්වාමීනි, මම අජිත කේසකම්බලගේ වචනය අනුමත කළේ ද නැත, ප්‍රතික්ෂේප කළේ ද නැත. අනුමත නොකොට, ප්‍රතික්ෂේප නොකොට, අසතුටු සිත් ඇතිව, අසතුටු වචනයක් ප්‍රකාශ නොකොට, එම වචනයට නොඇලී, එය ප්‍රතික්ෂේප නොකොට, අසුනෙන් නැගිට පිටත් වීමි.",
      "paliTitle": ""
    },
    {
      "number": 173,
      "pali": "‘‘Ekamidāhaṃ, bhante, samayaṃ yena pakudho kaccāyano tenupasaṅkamiṃ; upasaṅkamitvā pakudhena kaccāyanena saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Ekamantaṃ nisinno kho ahaṃ, bhante, pakudhaṃ kaccāyanaṃ etadavocaṃ – ‘yathā nu kho imāni, bho kaccāyana, puthusippāyatanāni…pe… sakkā nu kho, bho kaccāyana, evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’nti?",
      "english": "On one occasion, venerable sir, I approached Pakudha Kaccāyana. Having approached, I exchanged greetings with Pakudha Kaccāyana. Having concluded the courteous and memorable talk, I sat down to one side. Sitting to one side, venerable sir, I said this to Pakudha Kaccāyana: ‘Just as, good Kaccāyana, these various crafts and so forth, is it possible, good Kaccāyana, in the same way, to declare a visible fruit of recluseship in this very life?’",
      "sinhala": "භාග්‍ය​වතුන් වහන්ස, එක් සමයෙක්හි මම පකුධ කච්චායන සිටි තැනට පැමිණියෙමි. එළඹ පකුධ කච්චායන හා සමඟ සතුටු වීමි. සතුටු විය යුතු හා සිහි කටයුතු කථා පවත්වන ලද්දෙන් එක් පසෙක වාඩි වීමි. භාග්‍ය​වතුන් වහන්ස, එකත්පසෙක වාඩි වී සිටි මම පකුධ කච්චායනට මෙසේ කීවෙමි: ‘භවත් කච්චායන, යම්සේ මේ නොයෙක් ශිල්පයන්ගේ ප්‍රතිඵලය මේ ජීවිතයේදීම ප්‍රත්‍යක්ෂ වේද, භවත් කච්චායන, එසේම මේ ජීවිතයේදීම ප්‍රත්‍යක්ෂ වන ශ්‍රමණ ඵලයක් ප්‍රකාශ කරන්නට හැකිදැයි?’",
      "paliTitle": "Pakudhakaccāyanavādo",
      "englishTitle": "Pakudha Kaccāyana's Doctrine",
      "sinhalaTitle": "පකුධ කච‍්චායන වාදය"
    },
    {
      "number": 174,
      "pali": "‘‘Evaṃ vutte, bhante, pakudho kaccāyano maṃ etadavoca – ‘sattime, mahārāja, kāyā akaṭā akaṭavidhā animmitā animmātā vañjhā kūṭaṭṭhā esikaṭṭhāyiṭṭhitā. Te na iñjanti, na vipariṇamanti, na aññamaññaṃ byābādhenti, nālaṃ aññamaññassa sukhāya vā dukkhāya vā sukhadukkhāya vā. Katame satta? Pathavikāyo, āpokāyo, tejokāyo, vāyokāyo, sukhe, dukkhe, jīve sattame – ime satta kāyā akaṭā akaṭavidhā animmitā animmātā vañjhā kūṭaṭṭhā esikaṭṭhāyiṭṭhitā. Te na iñjanti, na vipariṇamanti, na aññamaññaṃ byābādhenti, nālaṃ aññamaññassa sukhāya vā dukkhāya vā sukhadukkhāya vā. Tattha natthi hantā vā ghātetā vā, sotā vā sāvetā vā, viññātā vā viññāpetā vā. Yopi tiṇhena satthena sīsaṃ chindati, na koci kiñci [kañci (kaṃ.)] jīvitā voropeti; sattannaṃ tveva [sattannaṃ yeva (sī. syā. kaṃ. pī.)] kāyānamantarena satthaṃ vivaramanupatatī’ti.",
      "english": "When this was said, venerable sir, Pakudha Kaccāyana told me this: \"Great king, there are these seven bodies: unmade, uncreated, unproduced, without a creator, barren, steadfast like a peak, standing firm like a pillar. They do not move, they do not change, they do not harm one another, and they are incapable of causing pleasure, pain, or both pleasure and pain to one another. Which seven? The body of earth, the body of water, the body of fire, the body of air, pleasure, pain, and life as the seventh. These seven bodies are unmade, uncreated, unproduced, without a creator, barren, steadfast like a peak, standing firm like a pillar. They do not move, they do not change, they do not harm one another, and they are incapable of causing pleasure, pain, or both pleasure and pain to one another. In this regard, there is no killer or one who causes to kill, no hearer or one who causes to hear, no knower or one who causes to know. Even if one cuts off a head with a sharp sword, no one deprives anyone of life; the sword merely passes through the interval between the seven bodies.\"",
      "sinhala": "මෙසේ පැවසූ කල්හි, භාග්‍යවතුන් වහන්ස, පකුධ කච්චායන මට මෙසේ කීවේය – ‘මහරජ, මේ කයෝ සත්දෙනා නොකළ ඒවාය, නොකරවන ලද ඒවාය, නොමවන ලද ඒවාය, නොමවනසුලු ඒවාය, වඳ ඒවාය, ස්ථිර ඒවාය, කණුවක් මෙන් ස්ථිරව පිහිටා තිබෙන ඒවාය. ඒවා කම්පා නොවෙති, වෙනස් නොවෙති, එකිනෙකාට පීඩා නොකරති, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැප-දුක පිණිස හෝ නොවෙති. කවරහුද ඒ සත්දෙනා? පඨවි ධාතුව, ආපෝ ධාතුව, තේජෝ ධාතුව, වායෝ ධාතුව, සැප, දුක, සහ සත්වනුව ජීවය යනුයි. මේ කයෝ සත්දෙනා නොකළ ඒවාය, නොකරවන ලද ඒවාය, නොමවන ලද ඒවාය, නොමවනසුලු ඒවාය, වඳ ඒවාය, ස්ථිර ඒවාය, කණුවක් මෙන් ස්ථිරව පිහිටා තිබෙන ඒවාය. ඒවා කම්පා නොවෙති, වෙනස් නොවෙති, එකිනෙකාට පීඩා නොකරති, එකිනෙකාට සැප පිණිස හෝ දුක පිණිස හෝ සැප-දුක පිණිස හෝ නොවෙති. එහි මරන්නෙක් හෝ මරවන්නෙක් හෝ නැත; අසන්නෙක් හෝ අසවන්නෙක් හෝ නැත; දන්නෙක් හෝ දන්වන්නෙක් හෝ නැත. තියුණු ආයුධයකින් යමෙක් හිස සිඳින්නේ නම්, කිසිවෙක් කිසිවකු ජීවිතයෙන් වෙන් නොකරයි; සත් කයක් අතරින් ආයුධය විවරයෙහි වැටේවා පමණි.’",
      "paliTitle": ""
    },
    {
      "number": 175,
      "pali": "‘‘Itthaṃ kho me, bhante, pakudho kaccāyano sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno aññena aññaṃ byākāsi. Seyyathāpi, bhante, ambaṃ vā puṭṭho labujaṃ byākareyya, labujaṃ vā puṭṭho ambaṃ byākareyya; evameva kho me, bhante, pakudho kaccāyano sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno aññena aññaṃ byākāsi. Tassa mayhaṃ, bhante, etadahosi – ‘kathañhi nāma mādiso samaṇaṃ vā brāhmaṇaṃ vā vijite vasantaṃ apasādetabbaṃ maññeyyā’ti. So kho ahaṃ, bhante, pakudhassa kaccāyanassa bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ, anabhinanditvā appaṭikkositvā anattamano, anattamanavācaṃ anicchāretvā tameva vācaṃ anuggaṇhanto anikkujjanto uṭṭhāyāsanā pakkamiṃ. ",
      "english": "Venerable sir, when I asked Pakudha Kaccāyana about the immediate fruit of recluseship, he gave an answer different from the question. Venerable sir, it was just as if, when asked about a mango, one were to answer about a breadfruit; or when asked about a breadfruit, one were to answer about a mango. Even so, venerable sir, when I asked Pakudha Kaccāyana about the immediate fruit of recluseship, he gave an answer different from the question. Then, venerable sir, this thought occurred to me: 'How could one like me possibly think it proper to disparage any recluse or brahmin living in my dominion?' Therefore, venerable sir, I neither rejoiced in nor condemned Pakudha Kaccāyana's statement. Neither rejoicing in nor condemning it, though inwardly displeased, and without uttering any word of displeasure, without affirming or denying that very statement, I rose from my seat and departed.",
      "sinhala": "එසේම වහන්ස, පකුධ කච්චායන මගෙන් සන්දිට්ඨික සාමඤ්ඤඵලය ගැන විමසූ කල්හි, වෙනත් දෙයකට වෙනත් දෙයක් පැහැදිලි කළේය. වහන්ස, යම්සේ අඹයක් ගැන විමසූ විට දෙල් ගෙඩියක් පැහැදිලි කරන්නේද, නැතහොත් දෙල් ගෙඩියක් ගැන විමසූ විට අඹයක් පැහැදිලි කරන්නේද, එලෙසින්ම වහන්ස, පකුධ කච්චායන මගෙන් සන්දිට්ඨික සාමඤ්ඤඵලය ගැන විමසූ කල්හි, වෙනත් දෙයකට වෙනත් දෙයක් පැහැදිලි කළේය.\n\nවහන්ස, එවිට මට මෙසේ සිතුණි – ‘මා වැනි කෙනෙකුට, තමන්ගේ රාජ්‍ය​යේ වෙසෙන ශ්‍රමණ​යෙකු හෝ බ්‍රාහ්මණ​යෙකු අවමන් කිරීමට සිතන්නේ කෙසේද?’\n\nඑබැවින් වහන්ස, මම පකුධ කච්චායනගේ කථාව අනුමත නොකළෙමි, ප්‍රතික්ෂේපද නොකළෙමි. අනුමත නොකොටද, ප්‍රතික්ෂේප නොකොටද, අසතුටු සිතින්, අසතුටු සිතින් වචනයක් පිට නොකොට, එම වචනය නොගෙන, නොහෙලා, ආසනයෙන් නැගිට පිටත්ව ගියෙමි.",
      "paliTitle": ""
    },
    {
      "number": 176,
      "pali": "‘‘Ekamidāhaṃ, bhante, samayaṃ yena nigaṇṭho nāṭaputto tenupasaṅkamiṃ; upasaṅkamitvā nigaṇṭhena nāṭaputtena saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Ekamantaṃ nisinno kho ahaṃ, bhante, nigaṇṭhaṃ nāṭaputtaṃ etadavocaṃ – ‘yathā nu kho imāni, bho aggivessana, puthusippāyatanāni…pe… sakkā nu kho, bho aggivessana, evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’nti?",
      "english": "Venerable Sir, on one occasion I approached the Naked Ascetic Nāṭaputta. Having approached, I exchanged greetings with the Naked Ascetic Nāṭaputta. After exchanging courteous and agreeable talk, I sat down to one side. Venerable Sir, as I sat to one side, I said this to the Naked Ascetic Nāṭaputta: ‘Good Aggivessana, just as these many different crafts have their immediate visible results, is it possible, good Aggivessana, in the same way, to declare a visible fruit of recluseship in this very life?’",
      "sinhala": "භාග්‍යවතුන් වහන්ස, එකල මම නිගණ්ඨ නාටපුත්‍රයා වෙත ගියෙමි; එහි ගොස් නිගණ්ඨ නාටපුත්‍රයා සමඟ සතුටු සාමිචියෙහි යෙදුණෙමි. සමගි උපදවන සිහි කටයුතු කතාබහ නිමවා මම එකත්පස්ව හිඳගත්තෙමි. භාග්‍යවතුන් වහන්ස, එකත්පස්ව හිඳගත් මම නිගණ්ඨ නාටපුත්‍රයාට මෙය කීවෙමි – ‘ඇවැත් අග්ගිවෙස්සන, යම්සේ මේ විවිධ ශිල්පස්ථාන වල ඵල මෙලොවදීම දෘශ්‍යමානව පවතීද, ඒ අයුරින්ම, ඇවැත් අග්ගිවෙස්සන, මේ දැකිය හැකි ධර්මය තුළද ශ්‍රමණභාවයේ දෘශ්‍යමාන ඵලයක් ප්‍රකාශ කිරීමට හැකිදැයි කියායි?’",
      "paliTitle": "Nigaṇṭhanāṭaputtavādo",
      "englishTitle": "The Doctrine of Nigaṇṭha Nāṭaputta",
      "sinhalaTitle": "නිගණ‌්ඨ නාටපුත‌්ත වාදය"
    },
    {
      "number": 177,
      "pali": "‘‘Evaṃ vutte, bhante, nigaṇṭho nāṭaputto maṃ etadavoca – ‘idha, mahārāja, nigaṇṭho cātuyāmasaṃvarasaṃvuto hoti. Kathañca, mahārāja, nigaṇṭho cātuyāmasaṃvarasaṃvuto hoti? Idha, mahārāja, nigaṇṭho sabbavārivārito ca hoti, sabbavāriyutto ca, sabbavāridhuto ca, sabbavāriphuṭo ca. Evaṃ kho, mahārāja, nigaṇṭho cātuyāmasaṃvarasaṃvuto hoti. Yato kho, mahārāja, nigaṇṭho evaṃ cātuyāmasaṃvarasaṃvuto hoti; ayaṃ vuccati, mahārāja, nigaṇṭho [nigaṇṭho nāṭaputto (syā. ka.)] gatatto ca yatatto ca ṭhitatto cā’ti.",
      "english": "“When this was said, venerable sir, the Jain ascetic Nāṭaputta said this to me: ‘Here, O great king, a Jain ascetic is restrained by the fourfold restraint. And how, O great king, is a Jain ascetic restrained by the fourfold restraint? Here, O great king, a Jain ascetic is restrained from all misdeeds, is endowed with all forms of restraint, is cleansed of all defilements, and is pervaded by all forms of restraint. Thus indeed, O great king, is a Jain ascetic restrained by the fourfold restraint. Because indeed, O great king, a Jain ascetic is thus restrained by the fourfold restraint, he is called, O great king, one whose self has gone (to its destination), whose self is yoked (to discipline), and whose self stands firm.’\"",
      "sinhala": "ස්වාමීනි, මෙසේ කී කල්හි, නිගණ්ඨ නාටපුත්ත මා හට මෙය පැවසුවේය – ‘මහරජ, මෙහි නිගණ්ඨයා චාතුයාම සංවරයෙන් සංවර වූවෙක් වේ. මහරජ, කෙසේ නම් ද නිගණ්ඨයා චාතුයාම සංවරයෙන් සංවර වූවෙක් වේ ද? මහරජ, මෙහි නිගණ්ඨයා සියලු ජලයෙන් වැළකුණෙක් ද වේ, සියලු ජලයෙන් බැඳුණෙක් ද වේ, සියලු ජලයෙන් සේදුණෙක් ද වේ, සියලු ජලයෙන් ව්‍යාප්ත වූවෙක් ද වේ. මහරජ, මෙසේ ද නිගණ්ඨයා චාතුයාම සංවරයෙන් සංවර වූවෙක් වේ. මහරජ, යම් හෙයකින් නිගණ්ඨයා මෙසේ චාතුයාම සංවරයෙන් සංවර වූවෙක් වේ ද; මහරජ, මොහු නිගණ්ඨයා ගතාත්ම වූවෙක් ද, යතාත්ම වූවෙක් ද, ඨිතාත්ම වූවෙක් ද කියා කියනු ලැබේ.’",
      "paliTitle": ""
    },
    {
      "number": 178,
      "pali": "‘‘Itthaṃ kho me, bhante, nigaṇṭho nāṭaputto sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno cātuyāmasaṃvaraṃ byākāsi. Seyyathāpi, bhante, ambaṃ vā puṭṭho labujaṃ byākareyya, labujaṃ vā puṭṭho ambaṃ byākareyya; evameva kho me, bhante, nigaṇṭho nāṭaputto sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno cātuyāmasaṃvaraṃ byākāsi. Tassa mayhaṃ, bhante, etadahosi – ‘kathañhi nāma mādiso samaṇaṃ vā brāhmaṇaṃ vā vijite vasantaṃ apasādetabbaṃ maññeyyā’ti. So kho ahaṃ, bhante, nigaṇṭhassa nāṭaputtassa bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikkositvā anattamano anattamanavācaṃ anicchāretvā tameva vācaṃ anuggaṇhanto anikkujjanto uṭṭhāyāsanā pakkamiṃ. ",
      "english": "Thus, Venerable Sir, when I asked Nigaṇṭha Nāṭaputta about the immediate fruit of recluseship, he expounded the fourfold restraint. Just as, Venerable Sir, one asked about a mango might expound on a breadfruit, or one asked about a breadfruit might expound on a mango, even so, Venerable Sir, when I asked Nigaṇṭha Nāṭaputta about the immediate fruit of recluseship, he expounded the fourfold restraint. Then, Venerable Sir, this thought occurred to me: ‘How indeed could one like me consider an ascetic or brahmin living in my realm to be disparaged?’ So then, Venerable Sir, I neither approved nor rejected what Nigaṇṭha Nāṭaputta had said. Without approving or rejecting, displeased in mind and without uttering a displeased word, neither grasping onto nor dismissing those words, I rose from my seat and departed.",
      "sinhala": "ස්වාමීනි, මෙසේ නාටපුත්‍ර නිගණ්ඨයාගෙන් මා විසින් මේ ආත්මභාවයේදීම දැකිය හැකි ශ්‍රමණ‌ ඵලය (සැමනුඵල) පිළිබඳව විමසන ලදුව, ඔහු චාතුයාම සංවරය (සිවුපෙර යම සංවරය) විස්තර කළේය. ස්වාමීනි, යම් සේ අඹ ගැන විමසූ විට රඹුටන් ගැනද, රඹුටන් ගැන විමසූ විට අඹ ගැනද කියන්නේද; ස්වාමීනි, එලෙසම මා විසින් මේ ආත්මභාවයේදීම දැකිය හැකි ශ්‍රමණ‌ ඵලය (සැමනුඵල) පිළිබඳව විමසන ලදුව, නාටපුත්‍ර‌ නිගණ්ඨයා චාතුයාම සංවරය (සිවුපෙර යම සංවරය) විස්තර කළේය. ස්වාමීනි, මට මෙසේ සිතුණි – ‘මා වැනි කෙනෙකු තමන්ගේ රටේ වෙසෙන ශ්‍රමණ‌යෙකු හෝ බ්‍රාහ්මණයෙකු කෙසේ නම් පහත් කොට සැලකිය යුතු යැයි සිතන්නේද?’ ස්වාමීනි, ඉතින් මම නාටපුත්‍ර‌ නිගණ්ඨයාගේ බස අනුමෝදන් වූයේද නැත, ප්‍රතික්ෂේප කළේද නැත. අනුමෝදන් නොවී, ප්‍රතික්ෂේප නොකොට, සතුටු නොවී, සතුටු නැති වචනයක් ප්‍රකාශ‌ නොකොට, එම වචනය (ඔහුගේ කියමන) පිළිගැනීමටද නොගෙන, නොහෙළා අසුනෙන් නැගිට පිටත්ව ගියෙමි.",
      "paliTitle": ""
    },
    {
      "number": 179,
      "pali": "‘‘Ekamidāhaṃ, bhante, samayaṃ yena sañcayo belaṭṭhaputto tenupasaṅkamiṃ; upasaṅkamitvā sañcayena belaṭṭhaputtena saddhiṃ sammodiṃ. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdiṃ. Ekamantaṃ nisinno kho ahaṃ bhante, sañcayaṃ belaṭṭhaputtaṃ etadavocaṃ – ‘yathā nu kho imāni, bho sañcaya, puthusippāyatanāni…pe… sakkā nu kho, bho sañcaya, evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’nti?",
      "english": "Once, venerable sir, I approached Sañcaya Belaṭṭhaputta. Having approached him, I exchanged greetings with Sañcaya Belaṭṭhaputta. After exchanging polite and cordial conversation, I sat down to one side. As I sat to one side, venerable sir, I said to Sañcaya Belaṭṭhaputta: “‘Just as, good Sañcaya, these various crafts and skills can be shown to have a visible fruit in this very life, is it possible, good Sañcaya, in the same way, to declare a visible fruit of recluseship in this very life?’”",
      "sinhala": "එක් සමයක, භාග්‍ය‌වතුන් වහන්ස, බෙලට්ඨපුත්‍ර‌ සංජය සිටි තැනට මම පැමිණියෙමි. එසේ පැමිණ, මම බෙලට්ඨපුත්‍ර‌ සංජය සමඟ සමුගෙන කතාබස් කළෙමි. ආදරණීය, සිහිකටයුතු කතාබස් නිමවා මම එකත්පසක වාඩි වූයෙමි. එකත්පසක වාඩි වී සිටි මම, භාග්‍ය‌වතුන් වහන්ස, බෙලට්ඨපුත්‍ර‌ සංජයට මෙය කීවෙමි – ‘භවත් සංජය, යම් සේ මේ නොයෙක් ශිල්පයන්...පෙ... භවත් සංජය, ඒ ආකාරයෙන්ම මේ දැමුණු ධර්ම‌යෙහි සැකෙවින්ම දක්වා ඇති ශ්‍රම‌ණ ඵලයක් ප්‍රකා‌ශ කරන්නට පුළුවන්ද?’",
      "paliTitle": "Sañcayabelaṭṭhaputtavādo",
      "englishTitle": "Doctrine of Sañcaya Belaṭṭhaputta",
      "sinhalaTitle": "සංජය බෙලට\\u200d්ඨපුත්ත වාදය"
    },
    {
      "number": 180,
      "pali": "‘‘Evaṃ vutte, bhante, sañcayo belaṭṭhaputto maṃ etadavoca – ‘atthi paro lokoti iti ce maṃ pucchasi, atthi paro lokoti iti ce me assa, atthi paro lokoti iti te naṃ byākareyyaṃ. Evantipi me no, tathātipi me no, aññathātipi me no, notipi me no, no notipi me no. Natthi paro loko…pe… atthi ca natthi ca paro loko…pe… nevatthi na natthi paro loko…pe… atthi sattā opapātikā…pe… natthi sattā opapātikā…pe… atthi ca natthi ca sattā opapātikā…pe… nevatthi na natthi sattā opapātikā…pe… atthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe…atthi ca natthi ca sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… nevatthi na natthi sukatadukkaṭānaṃ kammānaṃ phalaṃ vipāko…pe… hoti tathāgato paraṃ maraṇā…pe… na hoti tathāgato paraṃ maraṇā…pe… hoti ca na ca hoti tathāgato paraṃ maraṇā…pe… neva hoti na na hoti tathāgato paraṃ maraṇāti iti ce maṃ pucchasi, neva hoti na na hoti tathāgato paraṃ maraṇāti iti ce me assa, neva hoti na na hoti tathāgato paraṃ maraṇāti iti te naṃ byākareyyaṃ. Evantipi me no, tathātipi me no, aññathātipi me no, notipi me no, no notipi me no’ti.",
      "english": "When this was said, Venerable Sir, Sanjaya Belaṭṭhaputta spoke to me thus: ‘If you ask me, \"Is there a next world?\", and if I were to hold the view that \"there is a next world\", then I would declare to you that \"there is a next world.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Is there no next world?\", and if I were to hold the view that \"there is no next world\", then I would declare to you that \"there is no next world.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Is there and is there not a next world?\", and if I were to hold the view that \"there is and there is not a next world\", then I would declare to you that \"there is and there is not a next world.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Neither is nor is not a next world?\", and if I were to hold the view that \"neither is nor is not a next world\", then I would declare to you that \"neither is nor is not a next world.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Are there spontaneously arisen beings?\", and if I were to hold the view that \"there are spontaneously arisen beings\", then I would declare to you that \"there are spontaneously arisen beings.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Are there no spontaneously arisen beings?\", and if I were to hold the view that \"there are no spontaneously arisen beings\", then I would declare to you that \"there are no spontaneously arisen beings.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Are there and are there not spontaneously arisen beings?\", and if I were to hold the view that \"there are and there are not spontaneously arisen beings\", then I would declare to you that \"there are and there are not spontaneously arisen beings.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Neither are nor are not spontaneously arisen beings?\", and if I were to hold the view that \"neither are nor are not spontaneously arisen beings\", then I would declare to you that \"neither are nor are not spontaneously arisen beings.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Is there fruit and result of good and bad deeds?\", and if I were to hold the view that \"there is fruit and result of good and bad deeds\", then I would declare to you that \"there is fruit and result of good and bad deeds.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Is there no fruit and result of good and bad deeds?\", and if I were to hold the view that \"there is no fruit and result of good and bad deeds\", then I would declare to you that \"there is no fruit and result of good and bad deeds.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Is there and is there not fruit and result of good and bad deeds?\", and if I were to hold the view that \"there is and there is not fruit and result of good and bad deeds\", then I would declare to you that \"there is and there is not fruit and result of good and bad deeds.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Neither is nor is not fruit and result of good and bad deeds?\", and if I were to hold the view that \"neither is nor is not fruit and result of good and bad deeds\", then I would declare to you that \"neither is nor is not fruit and result of good and bad deeds.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Does a Tathāgata exist after death?\", and if I were to hold the view that \"a Tathāgata exists after death\", then I would declare to you that \"a Tathāgata exists after death.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Does a Tathāgata not exist after death?\", and if I were to hold the view that \"a Tathāgata does not exist after death\", then I would declare to you that \"a Tathāgata does not exist after death.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Does a Tathāgata both exist and not exist after death?\", and if I were to hold the view that \"a Tathāgata both exists and does not exist after death\", then I would declare to you that \"a Tathāgata both exists and does not exist after death.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not. If you ask me, \"Does a Tathāgata neither exist nor not exist after death?\", and if I were to hold the view that \"a Tathāgata neither exists nor not exists after death\", then I would declare to you that \"a Tathāgata neither exists nor not exists after death.\" But I do not hold it thus, nor otherwise, nor differently, nor not, nor not-not.’",
      "sinhala": "භාග්‍යවතුන් වහන්ස, මෙසේ කී විට, සංජය බෙලට්ඨපුත්ත මා හට මෙසේ පැවසීය: 'පරලොවක් ඇතැයි ඔබ මගෙන් අසන්නේ නම්, පරලොවක් ඇතැයි මට සිතෙන්නේ නම්, පරලොවක් ඇතැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. පරලොවක් නැතැයි ඔබ මගෙන් අසන්නේ නම්, පරලොවක් නැතැයි මට සිතෙන්නේ නම්, පරලොවක් නැතැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. පරලොවක් ඇතැයි ද නැතැයි ද ඔබ මගෙන් අසන්නේ නම්, පරලොවක් ඇතැයි ද නැතැයි ද මට සිතෙන්නේ නම්, පරලොවක් ඇතැයි ද නැතැයි ද මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. පරලොවක් ඇතැයි ද නැතැයි ද නොවේ යැයි ඔබ මගෙන් අසන්නේ නම්, පරලොවක් ඇතැයි ද නැතැයි ද නොවේ යැයි මට සිතෙන්නේ නම්, පරලොවක් ඇතැයි ද නැතැයි ද නොවේ යැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. ඕපපාතික සත්ත්ව‍යෝ ඇතැයි ඔබ මගෙන් අසන්නේ නම්, ඕපපාතික සත්ත්ව‍යෝ ඇතැයි මට සිතෙන්නේ නම්, ඕපපාතික සත්ත්ව‍යෝ ඇතැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. ඕපපාතික සත්ත්ව‍යෝ නැතැයි ඔබ මගෙන් අසන්නේ නම්, ඕපපාතික සත්ත්ව‍යෝ නැතැයි මට සිතෙන්නේ නම්, ඕපපාතික සත්ත්ව‍යෝ නැතැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. ඕපපාතික සත්ත්ව‍යෝ ඇතැයි ද නැතැයි ද ඔබ මගෙන් අසන්නේ නම්, ඕපපාතික සත්ත්ව‍යෝ ඇතැයි ද නැතැයි ද මට සිතෙන්නේ නම්, ඕපපාතික සත්ත්ව‍යෝ ඇතැයි ද නැතැයි ද මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. ඕපපාතික සත්ත්ව‍යෝ ඇතැයි ද නැතැයි ද නොවේ යැයි ඔබ මගෙන් අසන්නේ නම්, ඕපපාතික සත්ත්ව‍යෝ ඇතැයි ද නැතැයි ද නොවේ යැයි මට සිතෙන්නේ නම්, ඕපපාතික සත්ත්ව‍යෝ ඇතැයි ද නැතැයි ද නොවේ යැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි ඔබ මගෙන් අසන්නේ නම්, කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි මට සිතෙන්නේ නම්, කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක නැතැයි ඔබ මගෙන් අසන්නේ නම්, කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක නැතැයි මට සිතෙන්නේ නම්, කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක නැතැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි ද නැතැයි ද ඔබ මගෙන් අසන්නේ නම්, කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි ද නැතැයි ද මට සිතෙන්නේ නම්, කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි ද නැතැයි ද මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි ද නැතැයි ද නොවේ යැයි ඔබ මගෙන් අසන්නේ නම්, කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි ද නැතැයි ද නොවේ යැයි මට සිතෙන්නේ නම්, කුසල් අකුසල් කර්ම‍යන්ගේ ඵල විපාක ඇතැයි ද නැතැයි ද නොවේ යැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. තථාගතයන් වහන්සේ මරණින් පසු සිටී යැයි ඔබ මගෙන් අසන්නේ නම්, තථාගතයන් වහන්සේ මරණින් පසු සිටී යැයි මට සිතෙන්නේ නම්, තථාගතයන් වහන්සේ මරණින් පසු සිටී යැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. තථාගතයන් වහන්සේ මරණින් පසු නොසිටී යැයි ඔබ මගෙන් අසන්නේ නම්, තථාගතයන් වහන්සේ මරණින් පසු නොසිටී යැයි මට සිතෙන්නේ නම්, තථාගතයන් වහන්සේ මරණින් පසු නොසිටී යැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. තථාගතයන් වහන්සේ මරණින් පසු සිටී ද නොසිටී ද යැයි ඔබ මගෙන් අසන්නේ නම්, තථාගතයන් වහන්සේ මරණින් පසු සිටී ද නොසිටී ද යැයි මට සිතෙන්නේ නම්, තථාගතයන් වහන්සේ මරණින් පසු සිටී ද නොසිටී ද යැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ. තථාගතයන් වහන්සේ මරණින් පසු සිටී ද නොසිටී ද නොවේ යැයි ඔබ මගෙන් අසන්නේ නම්, තථාගතයන් වහන්සේ මරණින් පසු සිටී ද නොසිටී ද නොවේ යැයි මට සිතෙන්නේ නම්, තථාගතයන් වහන්සේ මරණින් පසු සිටී ද නොසිටී ද නොවේ යැයි මම ඔබට එය ප්‍ර‍කාශ කරන්නෙමි. එහෙත් මට එය මේ ආකාරයෙන් ද නොවේ, එසේම ද නොවේ, වෙනත් ආකාරයකින් ද නොවේ, නොවන ආකාරයකින් ද නොවේ, නො-නොවන ආකාරයකින් ද නොවේ.'",
      "paliTitle": ""
    },
    {
      "number": 181,
      "pali": "‘‘Itthaṃ kho me, bhante, sañcayo belaṭṭhaputto sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno vikkhepaṃ byākāsi. Seyyathāpi, bhante, ambaṃ vā puṭṭho labujaṃ byākareyya, labujaṃ vā puṭṭho ambaṃ byākareyya; evameva kho me, bhante, sañcayo belaṭṭhaputto sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno vikkhepaṃ byākāsi. Tassa mayhaṃ, bhante, etadahosi – ‘ayañca imesaṃ samaṇabrāhmaṇānaṃ sabbabālo sabbamūḷho. Kathañhi nāma sandiṭṭhikaṃ sāmaññaphalaṃ puṭṭho samāno vikkhepaṃ byākarissatī’ti. Tassa mayhaṃ, bhante, etadahosi – ‘kathañhi nāma mādiso samaṇaṃ vā brāhmaṇaṃ vā vijite vasantaṃ apasādetabbaṃ maññeyyā’ti. So kho ahaṃ, bhante, sañcayassa belaṭṭhaputtassa bhāsitaṃ neva abhinandiṃ nappaṭikkosiṃ. Anabhinanditvā appaṭikkositvā anattamano anattamanavācaṃ anicchāretvā tameva vācaṃ anuggaṇhanto anikkujjanto uṭṭhāyāsanā pakkamiṃ. ",
      "english": "Thus, Venerable Sir, when I asked Sañcaya Belaṭṭhaputta about the immediate fruit of recluseship, he gave an evasive answer. Just as, Venerable Sir, if one were asked about a mango and were to explain a breadfruit, or if one were asked about a breadfruit and were to explain a mango; even so, Venerable Sir, when I asked Sañcaya Belaṭṭhaputta about the immediate fruit of recluseship, he gave an evasive answer.\n\nTo me, Venerable Sir, this thought occurred: ‘This man is the most foolish and utterly deluded among these recluses and brahmins. How indeed could he, when asked about the immediate fruit of recluseship, give an evasive answer?’\n\nThen, Venerable Sir, this thought also occurred to me: ‘How could one such as I consider it proper to disparage a recluse or brahmin dwelling in my kingdom?’\n\nSo I, Venerable Sir, neither approved nor rejected what Sañcaya Belaṭṭhaputta said. Without approving or rejecting it, displeased in mind, but without uttering a displeased word, neither taking up his statement nor casting it aside, I rose from my seat and departed.",
      "sinhala": "භාග්‍යවතුන් වහන්ස, මෙසේ සංජය බේලට්ඨපුත්ත මේ ආත්මභාවයේදී දැකිය හැකි ශ්‍රමණඵලය ගැන විමසූ විට, ඔහු අපැහැදිලි ලෙස පිළිතුරු දුන්නේය. භාග්‍යවතුන් වහන්ස, යම්සේ අඹ ගැන ඇසූ විට දෙල් ගැන පිළිතුරු දෙන්නේද, නැතහොත් දෙල් ගැන ඇසූ විට අඹ ගැන පිළිතුරු දෙන්නේද, එසේම භාග්‍යවතුන් වහන්ස, සංජය බේලට්ඨපුත්ත මේ ආත්මභාවයේදී දැකිය හැකි ශ්‍රමණඵලය ගැන විමසූ විට, ඔහු අපැහැදිලි ලෙස පිළිතුරු දුන්නේය. භාග්‍යවතුන් වහන්ස, එවිට මට මෙසේ සිතුණි: ‘මෙතෙම මේ ශ්‍රමණ බ්‍රාහ්මණයන් අතර සියලුම මෝඩයාය, සියලුම මුළාවූ තැනැත්තාය. කෙසේ නම් මේ ආත්මභාවයේදී දැකිය හැකි ශ්‍රමණඵලය ගැන විමසූ විට අපැහැදිලි ලෙස පිළිතුරු දෙන්නේදැ’යි. භාග්‍යවතුන් වහන්ස, එවිට මට මෙසේ සිතුණි: ‘කෙසේ නම් මා වැනි අයෙක් තමන්ගේ රාජ්‍යයේ වෙසෙන ශ්‍රමණයෙකුට හෝ බ්‍රාහ්මණයෙකුට නිග්‍රහ කළ යුතුයැයි සිතන්නේදැ’යි. එහෙයින් භාග්‍යවතුන් වහන්ස, මම සංජය බේලට්ඨපුත්තගේ කථාව අනුමත නොකළෙමි, ප්‍රතික්ෂේප නොකළෙමි. අනුමත නොකොට, ප්‍රතික්ෂේප නොකොට, සතුටු නොවී, අසතුටු වචන නොපවසා, ඒ කතාව පිළි නොගෙන, බැහැර නොකොට, මම අසුනෙන් නැගිට පිටත්ව ගියෙමි.",
      "paliTitle": ""
    },
    {
      "number": 182,
      "pali": "‘‘Sohaṃ, bhante, bhagavantampi pucchāmi – ‘yathā nu kho imāni, bhante, puthusippāyatanāni seyyathidaṃ – hatthārohā assārohā rathikā dhanuggahā celakā calakā piṇḍadāyakā uggā rājaputtā pakkhandino mahānāgā sūrā cammayodhino dāsikaputtā āḷārikā kappakā nhāpakā sūdā mālākārā rajakā pesakārā naḷakārā kumbhakārā gaṇakā muddikā, yāni vā panaññānipi evaṃgatāni puthusippāyatanāni, te diṭṭheva dhamme sandiṭṭhikaṃ sippaphalaṃ upajīvanti, te tena attānaṃ sukhenti pīṇenti, mātāpitaro sukhenti pīṇenti, puttadāraṃ sukhenti pīṇenti, mittāmacce sukhenti pīṇenti, samaṇabrāhmaṇesu uddhaggikaṃ dakkhiṇaṃ patiṭṭhapenti sovaggikaṃ sukhavipākaṃ saggasaṃvattanikaṃ. Sakkā nu kho me, bhante, evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’nti?",
      "english": "So, venerable sir, I ask the Blessed One this: ‘Just as these various crafts, venerable sir — namely, elephant riders, horse riders, charioteers, archers, royal attendants, acrobats, royal provisioners, nobles, princes, elite guards, champions, heroes, shield-fighters, court servants, royal chefs, barbers, bath attendants, cooks, garland-makers, dyers, weavers, reed-workers, potters, accountants, seal-makers, or indeed any other such various crafts — they, in this very life, live by the visible fruit of their craft. By means of it, they make themselves comfortable and contented; they make their parents comfortable and contented; they make their wives and children comfortable and contented; they make their friends and associates comfortable and contented. For ascetics and brahmins, they establish a sublime offering that is heavenly, ripens in happiness, and leads to heaven. Is it possible for me, venerable sir, to point out, in this very life, a visible fruit of recluseship in the same way?’",
      "sinhala": "ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේගෙන් මෙසේ අසමි: ‘ස්වාමීනි, යම්සේ නම්, මේ ඇතුන් පුහුණු කරන්නෝ, අසුන් පුහුණු කරන්නෝ, රථකරුවෝ, දුනුවායෝ, නළුවෝ, ක්‍රීඩකයෝ, ආහාර සපයන්නෝ, උග්‍ර රජයේ නිලධාරීහු, රාජපුත්‍රයෝ, ප්‍රහාරක සෙබළු, මහා වීරයෝ, වීරයෝ, පලිහ දරා සටන් කරන්නෝ, දාසියන්ගේ පුත්‍රයෝ, රාජකීය ප්‍රධාන සූපවේදීහු, කප්පකයෝ, නාපකයෝ, සූපවේදීහු, මල්කරුවෝ, රෙදි සෝදන්නෝ සහ සායම් කරන්නෝ, විවන්නෝ, නළකරුවෝ, කුඹල්කරුවෝ, ගණකයෝ, මුද්‍රා තබන්නෝ, හෝ යම් අන් මෙවැනි නොයෙක් සිප්කම් ඇත්තෝ ද, ඔවුහු මේ අත්බැව්හිදීම ප්‍රත්‍යක්ෂ වූ සිල්පයේ ඵලයෙන් ජීවත් වෙත් ද, ඔවුහු ඒ හේතුවෙන් තමන් සුවපත් කරති, පෝෂණය කරති; මව්පියන් සුවපත් කරති, පෝෂණය කරති; අඹුදරුවන් සුවපත් කරති, පෝෂණය කරති; මිත්‍රයන් සහ අමාත්‍යයන් සුවපත් කරති, පෝෂණය කරති; ශ්‍රමණ-බ්‍රාහ්මණයන් කෙරෙහි උසස් භාවයකට පමුණුවන, ස්වර්ගයට පමුණුවන, සුවදායක විපාක ඇති, ස්වර්ගයට හේතුවන දක්ෂිණාවක් පිහිටුවත් ද, ස්වාමීනි, මට පුළුවන් ද එලෙසම මේ අත්බැව්හිදීම ප්‍රත්‍යක්ෂ වූ ශ්‍රමණභාවයේ ඵලය පෙන්වා දෙන්නට?’",
      "paliTitle": "Paṭhamasandiṭṭhikasāmaññaphalaṃ",
      "englishTitle": "First Visible Fruits of Recluseship",
      "sinhalaTitle": "පළමු පැහැදිලිව පෙනෙන ශ‍්‍රමණ ඵලය"
    },
    {
      "number": 183,
      "pali": "‘‘Sakkā, mahārāja. Tena hi, mahārāja, taññevettha paṭipucchissāmi. Yathā te khameyya, tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, mahārāja, idha te assa puriso dāso kammakāro [kammakaro (sī. syā. kaṃ. pī.)] pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī mukhullokako [mukhullokiko (syā. kaṃ. ka.)]. Tassa evamassa – ‘acchariyaṃ, vata bho, abbhutaṃ, vata bho, puññānaṃ gati, puññānaṃ vipāko. Ayañhi rājā māgadho ajātasattu vedehiputto manusso; ahampi manusso. Ayañhi rājā māgadho ajātasattu vedehiputto pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti, devo maññe. Ahaṃ panamhissa dāso kammakāro pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī mukhullokako. So vatassāhaṃ puññāni kareyyaṃ. Yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. So aparena samayena kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya. So evaṃ pabbajito samāno kāyena saṃvuto vihareyya, vācāya saṃvuto vihareyya, manasā saṃvuto vihareyya, ghāsacchādanaparamatāya santuṭṭho, abhirato paviveke. Taṃ ce te purisā evamāroceyyuṃ – ‘yagghe deva jāneyyāsi, yo te so puriso [yo te puriso (sī. ka.)] dāso kammakāro pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī mukhullokako; so, deva, kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito. So evaṃ pabbajito samāno kāyena saṃvuto viharati, vācāya saṃvuto viharati, manasā saṃvuto viharati, ghāsacchādanaparamatāya santuṭṭho, abhirato paviveke’ti. Api nu tvaṃ evaṃ vadeyyāsi – ‘etu me, bho, so puriso, punadeva hotu dāso kammakāro pubbuṭṭhāyī pacchānipātī kiṅkārapaṭissāvī manāpacārī piyavādī mukhullokako’ti?",
      "english": "It is possible, great king. Therefore, great king, I will question you in return about this. Please answer as you deem fit. What do you think, great king? Suppose you had a man, a slave, a worker, who rose before you and retired after you, who did whatever he was told, who pleased you in his actions, who spoke courteously, and who always looked to your face for instructions. And that man might think: ‘Oh, how wonderful, how amazing is the consequence of merit, the result of wholesome actions! This King Ajātasattu, son of Queen Videhī, ruler of Magadha, is a human being; I too am a human being. This King Ajātasattu, son of Queen Videhī, ruler of Magadha, lives enjoying and fully endowed with the five strands of sensual pleasure, like a deity, I suppose. But I am his slave and worker, rising before him and retiring after him, doing whatever I am told, pleasing him in my actions, speaking courteously, and always looking to his face for instructions. If only I too could perform such wholesome actions! Why don’t I shave off my hair and beard, put on saffron robes, and go forth from the household life into homelessness?’ Then, after some time, he shaves off his hair and beard, puts on saffron robes, and goes forth from the household life into homelessness. Having thus gone forth, he dwells restrained in body, restrained in speech, restrained in mind, contented with mere food and clothing, delighting in solitude. If your men were to report to you, ‘Please know, Your Majesty, that the man who was your slave and worker, rising before you and retiring after you, doing whatever he was told, pleasing you in his actions, speaking courteously, and always looking to your face for instructions—he, Your Majesty, has shaved off his hair and beard, put on saffron robes, and gone forth from the household life into homelessness. Having thus gone forth, he dwells restrained in body, restrained in speech, restrained in mind, contented with mere food and clothing, delighting in solitude.’ Would you then say, ‘Let that man come back to me, sirs; let him become my slave and worker once more, rising before me and retiring after me, doing whatever he was told, pleasing me in his actions, speaking courteously, and always looking to my face for instructions’?\"",
      "sinhala": "‘‘රජතුමනි, පුළුවන. එසේ නම්, මහරජ, මම ඔබගෙන්ම මේ පිළිබඳව ප්‍රතිප්‍රශ්නයක් අසන්නෙමි. ඔබට කැමති පරිදි එයට පිළිතුරු දෙන්න. මහරජ, ඔබ මේ ගැන කුමක් සිතනවාද? මෙහි ඔබගේ දාසයෙක්, කම්කරුවෙක් ඉන්නවා කියමු. ඔහු උදේ කලින් නැගිටිනවා, රාත්‍රියේ පසුව නින්දට යනවා, ඕනෑම දෙයක් කී සැණින් කීකරු වෙනවා, මනාව හැසිරෙනවා, මිහිරි වචන කතා කරනවා, ඔබගේ මුහුණ දෙස බලමින් සිටිනවා. ඔහුට මෙසේ සිතෙන්න පුළුවන්: ‘අහෝ! පුදුමයි, භාග්‍යයක් ඇති අයට අත් වන සැපය, කුසල්වල විපාකය පුදුමයි! මේ මගධ රජ අජාතසත්තු වේදේහිපුත්‍රයාත් මිනිසෙක්; මමත් මිනිසෙක්. මේ මගධ රජ අජාතසත්තු වේදේහිපුත්‍රයා පංච කාම ගුණයන්ගෙන් සමන්විතව, ඒවා උපරිමයෙන් විඳිමින් ජීවත් වෙනවා. ඔහු දේවයෙක් වගෙයි. නමුත් මම නම් ඔහුගේ දාසයෙක්, කම්කරුවෙක්. උදේ කලින් නැගිටිනවා, රාත්‍රියේ පසුව නින්දට යනවා, ඕනෑම දෙයක් කී සැණින් කීකරු වෙනවා, මනාව හැසිරෙනවා, මිහිරි වචන කතා කරනවා, ඔහුගේ මුහුණ දෙස බලමින් සිටිනවා. එසේ නම්, මමත් කුසල් රැස් කරගත යුතුයි. මම කෙසෙල් රැවුල් කපා, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වුවොත් හොඳයි නේද?’ කියා. යම් කලෙක ඔහු කෙසෙල් රැවුල් කපා, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වෙනවා. ඔහු එසේ පැවිදි වූ කල්හි, කයින් සංවරව, වචනයෙන් සංවරව, මනසින් සංවරව වාසය කරනවා. ආහාරපාන හා වස්ත්‍රාදියෙන් සතුටු වෙමින්, තනිකමෙහි ඇලුම් කරමින් සිටිනවා. ඔබට යම් අයෙක් මෙසේ දන්වයි: ‘දේවයන් වහන්ස, ඔබ දැනගත යුතුයි. ඔබගේ දාසයෙක්, කම්කරුවෙක් වූ, උදේ කලින් නැගිටින, රාත්‍රියේ පසුව නින්දට යන, ඕනෑම දෙයක් කී සැණින් කීකරු වන, මනාව හැසිරෙන, මිහිරි වචන කතා කරන, ඔබගේ මුහුණ දෙස බලමින් සිටි ඒ මිනිසා, දේවයන් වහන්ස, ඔහු කෙසෙල් රැවුල් කපා, කසාවත් හැඳ, ගිහිගෙයින් නික්ම අනගාරිකව පැවිදි වී ඇත. ඔහු එසේ පැවිදි වී කයින් සංවරව, වචනයෙන් සංවරව, මනසින් සංවරව වාසය කරයි. ආහාරපාන හා වස්ත්‍රාදියෙන් සතුටු වෙමින්, තනිකමෙහි ඇලුම් කරමින් සිටියි’ කියා. එවිට ඔබ මෙසේ කියනවාද: ‘ඒ පුද්ගලයා නැවත මා වෙත එනු, භවත්නි. ඔහු නැවතත් මාගේ දාසයෙක්, කම්කරුවෙක් වේවා. උදේ කලින් නැගිටින, රාත්‍රියේ පසුව නින්දට යන, ඕනෑම දෙයක් කී සැණින් කීකරු වන, මනාව හැසිරෙන, මිහිරි වචන කතා කරන, මාගේ මුහුණ දෙස බලමින් සිටින පුද්ගලයෙක් වේවා’ කියා?",
      "paliTitle": ""
    },
    {
      "number": 184,
      "pali": "‘‘No hetaṃ, bhante. Atha kho naṃ mayameva abhivādeyyāmapi, paccuṭṭheyyāmapi, āsanenapi nimanteyyāma, abhinimanteyyāmapi naṃ cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārehi, dhammikampissa rakkhāvaraṇaguttiṃ saṃvidaheyyāmā’’ti.",
      "english": "No, venerable sir. But rather, we ourselves would greet him, rise for him, invite him to a seat, and specifically offer him robes, almsfood, lodgings, requisites for the sick, and medicinal provisions. We would also provide him with rightful protection, shelter, and guard.",
      "sinhala": "නැත, භාග්‍යවතුන් වහන්ස. එහෙත් අපිම උන්වහන්සේට ආචාර කරන්නෙමු, සැදැහැයෙන් නැගිටින්නෙමු, ආසනයකට ආරාධනා කරන්නෙමු, සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් ද්‍රව්‍ය යන පිරිකර වලින් උන්වහන්සේට ආරාධනා කරන්නෙමු, තවද උන්වහන්සේට ධර්මානුකූල ආරක්ෂාව, ආවරණය සහ රැකවරණය සලස්වන්නෙමු.",
      "paliTitle": ""
    },
    {
      "number": 185,
      "pali": "‘‘Taṃ kiṃ maññasi, mahārāja, yadi evaṃ sante hoti vā sandiṭṭhikaṃ sāmaññaphalaṃ no vā’’ti? ‘‘Addhā kho, bhante, evaṃ sante hoti sandiṭṭhikaṃ sāmaññaphala’’nti. ‘‘Idaṃ kho te, mahārāja, mayā paṭhamaṃ diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññatta’’nti. ",
      "english": "“What do you think, great king, if this is the case, is there an immediate fruit of recluseship or not?” “Certainly, Venerable Sir, if this is the case, there is an immediate fruit of recluseship.” “This, great king, is the immediate fruit of recluseship that I have declared concerning this very life.”",
      "sinhala": "\"මහරජ, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? යම් හෙයකින් මෙසේ වූ කල්හි, මේ ජීවිතයේදීම දැකිය හැකි ශ්‍රමණඵලයක් වේද නැද්ද?\"\n\n\"ස්වාමීනි, සැබවින්ම, මෙසේ වූ කල්හි, මේ ජීවිතයේදීම දැකිය හැකි ශ්‍රමණඵලයක් වේ.\"\n\n\"මහරජ, මා විසින් මේ ජීවිතයේදීම දැකිය හැකි ශ්‍රමණඵලය ලෙස පළමුවෙන්ම ඔබට පෙන්වා දෙන ලද්දේ මෙයයි.\"",
      "paliTitle": ""
    },
    {
      "number": 186,
      "pali": "‘‘Sakkā pana, bhante, aññampi evameva diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetu’’nti? ‘‘Sakkā, mahārāja. Tena hi, mahārāja, taññevettha paṭipucchissāmi. Yathā te khameyya, tathā naṃ byākareyyāsi. Taṃ kiṃ maññasi, mahārāja, idha te assa puriso kassako gahapatiko karakārako rāsivaḍḍhako. Tassa evamassa – ‘acchariyaṃ vata bho, abbhutaṃ vata bho, puññānaṃ gati, puññānaṃ vipāko. Ayañhi rājā māgadho ajātasattu vedehiputto manusso, ahampi manusso. Ayañhi rājā māgadho ajātasattu vedehiputto pañcahi kāmaguṇehi samappito samaṅgībhūto paricāreti, devo maññe. Ahaṃ panamhissa kassako gahapatiko karakārako rāsivaḍḍhako. So vatassāhaṃ puññāni kareyyaṃ. Yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti. ‘‘So aparena samayena appaṃ vā bhogakkhandhaṃ pahāya mahantaṃ vā bhogakkhandhaṃ pahāya, appaṃ vā ñātiparivaṭṭaṃ pahāya mahantaṃ vā ñātiparivaṭṭaṃ pahāya kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya. So evaṃ pabbajito samāno kāyena saṃvuto vihareyya, vācāya saṃvuto vihareyya, manasā saṃvuto vihareyya, ghāsacchādanaparamatāya santuṭṭho, abhirato paviveke. Taṃ ce te purisā evamāroceyyuṃ – ‘yagghe, deva jāneyyāsi, yo te so puriso [yo te puriso (sī.)] kassako gahapatiko karakārako rāsivaḍḍhako; so deva kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajito. So evaṃ pabbajito samāno kāyena saṃvuto viharati, vācāya saṃvuto viharati, manasā saṃvuto viharati, ghāsacchādanaparamatāya santuṭṭho, abhirato paviveke’’ti. Api nu tvaṃ evaṃ vadeyyāsi – ‘etu me, bho, so puriso, punadeva hotu kassako gahapatiko karakārako rāsivaḍḍhako’ti?",
      "english": "\"Is it possible, Venerable Sir, to declare still another visible fruit of recluseship, in just this way, in this very life?\"\n\n\"It is possible, great king. Therefore, great king, I will question you on this very matter. You should answer it as it pleases you. What do you think, great king? Suppose there was a man of yours here, a farmer, a householder, one who works hard, increasing the harvest. And he might think thus: 'Indeed, it is wonderful, indeed, it is amazing! The path of merits, the result of merits! For this King Ajātasattu, son of Queen Videhī, a Magadhan, is a human being; I too am a human being. This King Ajātasattu, son of Queen Videhī, a Magadhan, is endowed and furnished with the five strands of sensual pleasure, served by them, like a deity, I suppose. But I am his farmer, householder, one who works hard, increasing the harvest. I should perform merits. What if I were to shave off my hair and beard, put on saffron robes, and go forth from the home life into homelessness?'\"\n\n\"So at a later time, having abandoned a small accumulation of wealth or a large accumulation of wealth, having abandoned a small circle of relatives or a large circle of relatives, he shaves off his hair and beard, puts on saffron robes, and goes forth from the home life into homelessness. Being thus gone forth, he dwells restrained in body, restrained in speech, restrained in mind, content with whatever food and clothing he gets, delighting in solitude. If your men were to report to you thus: 'May it please Your Majesty to know, that man of yours who was a farmer, a householder, one who works hard, increasing the harvest; that man, Your Majesty, has shaved off his hair and beard, put on saffron robes, and gone forth from the home life into homelessness. Being thus gone forth, he dwells restrained in body, restrained in speech, restrained in mind, content with whatever food and clothing he gets, delighting in solitude.' Would you then say this: 'Let that man come to me, sirs; let him be a farmer, a householder, one who works hard, increasing the harvest once again'?\"",
      "sinhala": "‘‘භාග්‍යවතුන් වහන්ස, එසේනම් මෙලොවදීම දත හැකි මෙවැනිම වෙනත් ශ්‍රමණ ඵලයක් පෙන්වා දීමට හැකිද?’’\n‘‘මහ රජ, පුළුවනි. එසේ නම්, මහ රජ, මම මේ සම්බන්ධයෙන් ඔබගෙන්ම ප්‍රශ්න කරන්නෙමි. ඔබට කැමති අයුරින් එයට පිළිතුරු දෙන්න. මහ රජ, ඔබ මේ ගැන කුමක් සිතනවාද? මෙහි ඔබට ගොවිතැන් කරන, ගෘහපති වූ, වැඩ කටයුතු කරන, ධාන්‍ය රැස් කරන පුරුෂයෙක් සිටී යැයි සිතමු. ඔහුට මෙසේ සිතේ: ‘අහෝ, පුදුම සහගතය, අහෝ, ආශ්චර්යයකි, පින්වල ගතිය, පින්වල විපාකය. මේ මගධ රජ අජාසත් වේදේහිපුත්‍රයාත් මනුෂ්‍යයෙකි, මමත් මනුෂ්‍යයෙක්මි. මේ මගධ රජ අජාසත් වේදේහිපුත්‍රයා පස්කම් ගුණයන්ගෙන් පිරිපුන්ව, හොඳින් භුක්ති විඳිමින් වාසය කරයි, මම සිතන්නේ ඔහු දෙවියෙක් මෙනි. මම නම් ඔහුට ගොවියෙක්, ගෘහපතියෙක්, වැඩකරන්නෙක්, ධාන්‍ය රැස් කරන්නෙක්මි. ඒ නිසා මම පින් රැස් කළ යුතුයි. කුමක් හෙයින් මම හිසකේ සහ රැවුල කපා, කසාවත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි නොවන්නේදැයි සිතේ.’\n\nපසුව දිනෙක ඔහු සුළු වූ හෝ මහත් වූ හෝ භෝග සම්පත් අත්හැර, සුළු වූ හෝ මහත් වූ හෝ නෑදෑ පිරිසක් අත්හැර, හිසකේ සහ රැවුල කපා, කසාවත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වෙයි. එසේ පැවිදි වූ ඔහු කයින් සංවරව, වචනයෙන් සංවරව, සිතින් සංවරව වාසය කරයි; දන් ලැබීමෙන් සහ සිවුරු ලැබීමෙන් සතුටු වන, තනිකමෙහි ඇලී සිටින කෙනෙක් වෙයි. ඔබේ මිනිසුන් ඔබට මෙසේ වාර්තා කරයි නම්: ‘දේවයන් වහන්ස, ඔබ දන්නවා ඇත, ඔබේ යම් ඒ පුරුෂයා ගොවියෙක්, ගෘහපතියෙක්, වැඩකරන්නෙක්, ධාන්‍ය රැස් කරන්නෙක් වූයේද; දේවයන් වහන්ස, ඔහු හිසකේ සහ රැවුල කපා, කසාවත් හැඳ, ගිහි ගෙයින් නික්ම අනගාරිකව පැවිදි වී ඇත. එසේ පැවිදි වූ ඔහු කයින් සංවරව, වචනයෙන් සංවරව, සිතින් සංවරව වාසය කරයි; දන් ලැබීමෙන් සහ සිවුරු ලැබීමෙන් සතුටු වන, තනිකමෙහි ඇලී සිටින කෙනෙක් වෙයි’ කියා. එසේ නම් ඔබ මෙසේ කියන්නෙහිද – ‘අනේ ඒ පුරුෂයා මා වෙතට එනු. ඔහු නැවතත් ගොවියෙක්, ගෘහපතියෙක්, වැඩකරන්නෙක්, ධාන්‍ය රැස් කරන්නෙක් වේවා’ කියා?",
      "paliTitle": "Dutiyasandiṭṭhikasāmaññaphalaṃ",
      "englishTitle": "Second Immediate Fruits of Recluseship",
      "sinhalaTitle": "දෙවැනි සන‍්දිට‍්ඨික සාමඤ‍්ඤඵලය"
    },
    {
      "number": 187,
      "pali": "‘‘No hetaṃ, bhante. Atha kho naṃ mayameva abhivādeyyāmapi, paccuṭṭheyyāmapi, āsanenapi nimanteyyāma, abhinimanteyyāmapi naṃ cīvarapiṇḍapātasenāsanagilānappaccayabhesajjaparikkhārehi, dhammikampissa rakkhāvaraṇaguttiṃ saṃvidaheyyāmā’’ti.",
      "english": "No, Bhante, it is not so. Instead, we ourselves would pay homage to him, rise to greet him, invite him to a seat, and would also invite him to accept robes, almsfood, lodgings, requisites for the sick, and medicinal provisions. Furthermore, we would arrange for his protection, safeguarding, and security in accordance with the Dhamma.",
      "sinhala": "එසේ නොවේ භාග්‍ය‌වතුන් වහන්ස. එහෙත් අපිම ඔහුට ආචාර කරන්නෙමු, පිළිවෙතින් නැගී සිටින්නෙමු, ආසනයෙන් ආරාධනා කරන්නෙමු, සිවුරු, පිණ්ඩපාත, සේනාසන, ගිලන්පස හා බෙහෙත් පිරිකර ආදියෙන් ඔහුට ආරාධනා කරන්නෙමු, තවද, ඔහුට ධර්මානුකූලව ආරක්ෂාව, ආවරණය හා රැකවරණය සලස්වන්නෙමු.",
      "paliTitle": ""
    },
    {
      "number": 188,
      "pali": "‘‘Taṃ kiṃ maññasi, mahārāja? Yadi evaṃ sante hoti vā sandiṭṭhikaṃ sāmaññaphalaṃ no vā’’ti? ‘‘Addhā kho, bhante, evaṃ sante hoti sandiṭṭhikaṃ sāmaññaphala’’nti. ‘‘Idaṃ kho te, mahārāja, mayā dutiyaṃ diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññatta’’nti. ",
      "english": "What do you think, great king? If this is the case, is there a visible fruit of recluseship or not?\n\nIndeed, venerable sir, if this is the case, there is a visible fruit of recluseship.\n\nThis, great king, is the second visible fruit of recluseship that I have declared to you, manifest in this very life.",
      "sinhala": "\"මහ රජ, ඔබ මේ ගැන කුමක් සිතන්නෙහිද? මේ ආකාරයට පවතින විට දිට්ඨධම්මික ශ්‍රමණඵලයක් තිබේද නැද්ද?\"\n\"භාග්‍යවතුන් වහන්ස, මේ ආකාරයට පවතින විට සැබවින්ම දිට්ඨධම්මික ශ්‍රමණඵලයක් තිබේ.\"\n\"මහ රජ, මා විසින් ඔබට දිට්ඨධම්මික ශ්‍රමණඵලය දෙවනුව ද මෙලොවදීම දේශනා කරන ලදී.\"",
      "paliTitle": ""
    },
    {
      "number": 189,
      "pali": "‘‘Sakkā pana, bhante, aññampi diṭṭheva dhamme sandiṭṭhikaṃ sāmaññaphalaṃ paññapetuṃ imehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañcā’’ti? ‘‘Sakkā, mahārāja. Tena hi, mahārāja, suṇohi, sādhukaṃ manasi karohi, bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho rājā māgadho ajātasattu vedehiputto bhagavato paccassosi.",
      "english": "“But, venerable sir, is it possible to declare another immediate fruit of recluseship, visible in this very life, which is more excellent and more sublime than these immediate fruits of recluseship?” “It is possible, great king. Therefore, great king, listen and pay close attention, I will speak.” “Yes, venerable sir,” King Ajātasattu of Magadha, son of Videha, replied to the Blessed One.",
      "sinhala": "භාග්‍යවතුන් වහන්ස, මේ දිට්ඨධම්මික ශ්‍රමණ ඵලයන්ට වඩා අභික්කාන්ත වූද, ප්‍රණීත වූද, තවත් දිට්ඨධම්මික ශ්‍රමණ ඵලයක් පෙන්වා දෙන්නට හැකිද?\n\nමහරජ, එය හැකි ය. එසේ නම්, මහරජ, අසන්න. මැනවින් මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි.\n\n‘එසේය, භාග්‍යවතුන් වහන්සැ’යි මගධ රට අධිපති, වේදේහී පුත්‍ර අජාතසත්තු රජතුමා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය.",
      "paliTitle": "Paṇītatarasāmaññaphalaṃ",
      "englishTitle": "The More Excellent Fruit of Renunciation",
      "sinhalaTitle": "ප්‍රණීතතර සාමඤ්ඤඵලය"
    },
    {
      "number": 190,
      "pali": "Bhagavā etadavoca – ‘‘idha, mahārāja, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So imaṃ lokaṃ sadevakaṃ samārakaṃ sabrahmakaṃ sassamaṇabrāhmaṇiṃ pajaṃ sadevamanussaṃ sayaṃ abhiññā sacchikatvā pavedeti. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti.",
      "english": "The Blessed One said this: \"Here, great king, a Tathāgata arises in the world, an Arahant, a Fully Self-Enlightened One, perfected in knowledge and conduct, the Fortunate One, the Knower of Worlds, the unsurpassable trainer of persons to be tamed, teacher of devas and humans, the Buddha, the Blessed One. He, having realized this world—with its devas, Māras, and Brahmās, with its population of ascetics and brahmins, devas and humans—by his own direct knowledge, proclaims it. He teaches the Dhamma that is beautiful in the beginning, beautiful in the middle, and beautiful in the end, with its meaning and its expression. He proclaims the entirely complete and perfectly pure holy life.\"",
      "sinhala": "භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මහරජ, මෙහිලා තථාගතයන් වහන්සේ අරහත් වූ, සම්මා සම්බුද්ධ වූ, විද්‍යාචරණ සම්පන්න වූ, සුගත වූ, ලෝකවිදූ වූ, අනුත්තර වූ, පුරිසදම්මසාරථී වූ, දෙවිමිනිසුනට ශාස්තෘ වූ, බුද්ධ වූ භාග්‍යවතුන් වහන්සේ නමින් ලොව පහළ වෙති. උන්වහන්සේ දෙවියන් සහිත වූ, මරුන් සහිත වූ, බඹුන් සහිත වූ මේ ලෝකය ද, ශ්‍රමණ බ්‍රාහ්මණයන් සහිත වූ, දෙවි මිනිසුන් සහිත වූ ප්‍රජාව ද, තමන් විසින්ම අභිඥාවෙන් ප්‍රත්‍යක්ෂ කොට ප්‍රකාශ කරති. උන්වහන්සේ ආදියේ කල්‍යාණ වූ, මැද කල්‍යාණ වූ, පර්යන්තයේ කල්‍යාණ වූ, අර්ථ සහිත වූ, ව්‍යංජන සහිත වූ ධර්මය දේශනා කරන අතර, මුළුමනින්ම පරිපූර්ණ වූ, පිරිසිදු වූ බ්‍රහ්මචර්යාව ප්‍රකාශ කරති.",
      "paliTitle": ""
    },
    {
      "number": 191,
      "pali": "‘‘Taṃ dhammaṃ suṇāti gahapati vā gahapatiputto vā aññatarasmiṃ vā kule paccājāto. So taṃ dhammaṃ sutvā tathāgate saddhaṃ paṭilabhati. So tena saddhāpaṭilābhena samannāgato iti paṭisañcikkhati – ‘sambādho gharāvāso rajopatho, abbhokāso pabbajjā. Nayidaṃ sukaraṃ agāraṃ ajjhāvasatā ekantaparipuṇṇaṃ ekantaparisuddhaṃ saṅkhalikhitaṃ brahmacariyaṃ carituṃ. Yaṃnūnāhaṃ kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajeyya’nti.",
      "english": "A householder, or a householder's son, or someone reborn into some other family hears that Dhamma. Having heard that Dhamma, he gains faith in the Tathāgata. Possessing that acquired faith, he reflects thus: ‘Household life is confining and a path of dust; going forth is open and unconfined. It is not easy for one living in a home to lead a spiritual life that is utterly perfect, utterly pure, and polished like a conch shell. What if I were to shave off my hair and beard, don saffron robes, and go forth from the home life into homelessness?’",
      "sinhala": "ඒ ධර්මය ගෘහපතියෙක් හෝ ගෘහපති පුත්‍රයෙක් හෝ යම් කිසි වෙනත් කුලයක උපන් කෙනෙක් හෝ අසයි. ඔහු ඒ ධර්මය අසා තථාගතයන් වහන්සේ කෙරෙහි ශ්‍රද්ධාව ලබයි. ඔහු ඒ ශ්‍රද්ධා ලාභයෙන් යුක්තව මෙසේ සිතයි – ‘ගිහිගෙය සම්බාධයකි, රජස් මගකි; පැවිදි බව එළිමහනකි. ගිහි ගෙයි වසන කෙනෙකුට එකාන්තයෙන් සම්පූර්ණ වූ, එකාන්තයෙන් පිරිසිදු වූ, හක්ගෙඩියක් මෙන් මනාව ඔපදැමුණු බ්‍රහ්මචරියාව හැසිරීම පහසු නැත. මම කෙස් රැවුල් කපා කසාවත් හැඳගෙන ගිහිගෙන් නික්ම අනගාරික බවට පැවිදි වුවොත් හොඳ යැයි.",
      "paliTitle": ""
    },
    {
      "number": 192,
      "pali": "‘‘So aparena samayena appaṃ vā bhogakkhandhaṃ pahāya mahantaṃ vā bhogakkhandhaṃ pahāya appaṃ vā ñātiparivaṭṭaṃ pahāya mahantaṃ vā ñātiparivaṭṭaṃ pahāya kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajati.",
      "english": "He, at a later time, having given up a small fortune or a great fortune, having given up a small family circle or a great family circle, shaves off his hair and beard, puts on saffron robes, and goes forth from the home life into the homeless life.",
      "sinhala": "ඉක්බිති ඔහු පසු කලෙක අල්ප හෝ භෝගස්කන්ධයක් අත්හැර, මහත් හෝ භෝගස්කන්ධයක් අත්හැර, අල්ප හෝ ඥාති පිරිසක් අත්හැර, මහත් හෝ ඥාති පිරිසක් අත්හැර, කෙස් රැවුල් කපා දමා, කසාවත් හැඳ පොරවා, ගිහි ගෙන් නික්ම අගාරික තත්ත්වයට පත්ව, පැවිදි වේ.",
      "paliTitle": ""
    },
    {
      "number": 193,
      "pali": "‘‘So evaṃ pabbajito samāno pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu, kāyakammavacīkammena samannāgato kusalena, parisuddhājīvo sīlasampanno, indriyesu guttadvāro [guttadvāro, bhojane mattaññū (ka.)], satisampajaññena samannāgato, santuṭṭho.",
      "english": "Having thus gone forth, he dwells restrained by the restraint of the Patimokkha, endowed with good conduct and suitable resort, seeing danger even in the slightest faults, and undertaking and training in the training rules. He is endowed with wholesome bodily and verbal action, has a purified livelihood, and is endowed with virtue. He guards the doors of his senses, is moderate in eating, is endowed with mindfulness and clear comprehension, and he is contented.",
      "sinhala": "ඔහු මෙසේ පැවිදි වූයේ ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවරව වාසය කරයි. යහපත් ආචාරයෙන් හා ගෝචරයෙන් යුක්ත වෙයි. අණු මාත්‍ර වූ වරද වලදී පවා භය දකින්නෙකි. ශික්ෂාපදයන් සමාදන් වී එහි හික්මෙයි. කුසල වූ කය කර්මයෙන් හා වචී කර්මයෙන් යුක්ත වෙයි. පිරිසිදු ආජීවයෙන් හා ශීලයෙන් සම්පන්න වූ, ඉන්ද්‍රියයන්හි දොරටු ආරක්ෂා කළ, සති සම්පජඤ්ඤයෙන් සමන්විත වූ, සන්තුෂ්ට කෙනෙකි.",
      "paliTitle": ""
    },
    {
      "number": 194,
      "pali": "‘‘Kathañca, mahārāja, bhikkhu sīlasampanno hoti? Idha, mahārāja, bhikkhu pāṇātipātaṃ pahāya pāṇātipātā paṭivirato hoti. Nihitadaṇḍo nihitasattho lajjī dayāpanno sabbapāṇabhūtahitānukampī viharati. Idampissa hoti sīlasmiṃ. ‘‘Adinnādānaṃ pahāya adinnādānā paṭivirato hoti dinnādāyī dinnapāṭikaṅkhī, athenena sucibhūtena attanā viharati. Idampissa hoti sīlasmiṃ. ‘‘Abrahmacariyaṃ pahāya brahmacārī hoti ārācārī virato methunā gāmadhammā. Idampissa hoti sīlasmiṃ. ‘‘Musāvādaṃ pahāya musāvādā paṭivirato hoti saccavādī saccasandho theto paccayiko avisaṃvādako lokassa. Idampissa hoti sīlasmiṃ. ‘‘Pisuṇaṃ vācaṃ pahāya pisuṇāya vācāya paṭivirato hoti; ito sutvā na amutra akkhātā imesaṃ bhedāya; amutra vā sutvā na imesaṃ akkhātā, amūsaṃ bhedāya. Iti bhinnānaṃ vā sandhātā, sahitānaṃ vā anuppadātā, samaggārāmo samaggarato samagganandī samaggakaraṇiṃ vācaṃ bhāsitā hoti. Idampissa hoti sīlasmiṃ. ‘‘Pharusaṃ vācaṃ pahāya pharusāya vācāya paṭivirato hoti; yā sā vācā nelā kaṇṇasukhā pemanīyā hadayaṅgamā porī bahujanakantā bahujanamanāpā tathārūpiṃ vācaṃ bhāsitā hoti. Idampissa hoti sīlasmiṃ. ‘‘Samphappalāpaṃ pahāya samphappalāpā paṭivirato hoti kālavādī bhūtavādī atthavādī dhammavādī vinayavādī, nidhānavatiṃ vācaṃ bhāsitā hoti kālena sāpadesaṃ pariyantavatiṃ atthasaṃhitaṃ. Idampissa hoti sīlasmiṃ. ‘‘Bījagāmabhūtagāmasamārambhā paṭivirato hoti…pe… ekabhattiko hoti rattūparato virato vikālabhojanā. Naccagītavāditavisūkadassanā paṭivirato hoti. Mālāgandhavilepanadhāraṇamaṇḍanavibhūsanaṭṭhānā paṭivirato hoti. Uccāsayanamahāsayanā paṭivirato hoti. Jātarūparajatapaṭiggahaṇā paṭivirato hoti. Āmakadhaññapaṭiggahaṇā paṭivirato hoti. Āmakamaṃsapaṭiggahaṇā paṭivirato hoti. Itthikumārikapaṭiggahaṇā paṭivirato hoti. Dāsidāsapaṭiggahaṇā paṭivirato hoti. Ajeḷakapaṭiggahaṇā paṭivirato hoti. Kukkuṭasūkarapaṭiggahaṇā paṭivirato hoti. Hatthigavassavaḷavapaṭiggahaṇā paṭivirato hoti. Khettavatthupaṭiggahaṇā paṭivirato hoti. Dūteyyapahiṇagamanānuyogā paṭivirato hoti. Kayavikkayā paṭivirato hoti. Tulākūṭakaṃsakūṭamānakūṭā paṭivirato hoti. Ukkoṭanavañcananikatisāciyogā paṭivirato hoti. Chedanavadhabandhanaviparāmosaālopasahasākārā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "“And how, O great king, is a monk endowed with virtue? Here, O great king, a monk, having abandoned the taking of life, abstains from the taking of life. He lays down rod and weapon, is conscientious, full of compassion, and dwells with sympathy for the welfare of all living beings. This is part of his virtue.\n\nHaving abandoned taking what is not given, he abstains from taking what is not given. He takes only what is given, expecting what is given, and dwells with a pure self, having no intention to steal. This is part of his virtue.\n\nHaving abandoned unchaste conduct, he is chaste. He lives aloof, abstaining from sexual intercourse, which is the village custom. This is part of his virtue.\n\nHaving abandoned false speech, he abstains from false speech. He speaks the truth, adheres to truth, is firm, reliable, and not a deceiver of the world. This is part of his virtue.\n\nHaving abandoned divisive speech, he abstains from divisive speech. What he hears here, he does not repeat there to cause division among these; what he hears there, he does not repeat here to cause division among those. Thus he is a uniter of those who are divided, a promoter of those who are united. He rejoices in harmony, delights in harmony, finds joy in harmony, and speaks words that promote harmony. This is part of his virtue.\n\nHaving abandoned harsh speech, he abstains from harsh speech. He speaks words that are gentle, pleasing to the ear, affectionate, reaching the heart, urbane, agreeable to many, and pleasing to many. This is part of his virtue.\n\nHaving abandoned idle chatter, he abstains from idle chatter. He speaks at the right time, speaks what is factual, speaks what is meaningful, speaks about the Dhamma, speaks about the Vinaya. He speaks words that are like a treasure, spoken at the proper time, reasoned, well-defined, and beneficial. This is part of his virtue.\n\nHe abstains from harming plants and seeds. He is a one-mealer, abstaining from food at night and from eating at improper times. He abstains from seeing shows of dancing, singing, and music. He abstains from wearing garlands, using perfumes, and adorning himself with cosmetics and ornaments. He abstains from high and luxurious beds. He abstains from accepting gold and silver. He abstains from accepting raw grain. He abstains from accepting raw meat. He abstains from accepting women and girls. He abstains from accepting male and female slaves. He abstains from accepting goats and sheep. He abstains from accepting chickens and pigs. He abstains from accepting elephants, cattle, horses, and mares. He abstains from accepting fields and lands. He abstains from engaging in messages and errands. He abstains from buying and selling. He abstains from cheating with scales, metals, and measures. He abstains from bribery, deception, fraud, and crookedness. He abstains from cutting, killing, binding, highway robbery, plunder, and violence. This is part of his virtue.",
      "sinhala": "මහරජ, භික්‍ෂුවක් සීලයෙන් යුක්ත වන්නේ කෙසේද? මහරජ, මෙහිලා භික්‍ෂුවක් ප්‍රාණඝාතය අත්හැර, ප්‍රාණඝාතයෙන් වෙන්වූයේ වෙයි. හෙළන ලද දඬු ඇත්තෙක්, හෙළන ලද අවි ඇත්තෙක්, ලජ්ජා ඇත්තෙක්, දයාන්විතවූයේ, සියලු ප්‍රාණීන්ගේ හිත පිණිස අනුකම්පාවෙන් යුක්තව වාසය කරයි. මෙයද ඔහුගේ සීලයෙහි වේ.\n\nඅදත්තාදානය අත්හැර, අදත්තාදානයෙන් වෙන්වූයේ වෙයි. දෙනලද දේම ගන්නේය, දෙනු ලබන දේ බලාපොරොත්තු වන්නේය. සොරකමින් තොරවූ, පිරිසිදු ආත්මභාවයකින් යුක්තව වාසය කරයි. මෙයද ඔහුගේ සීලයෙහි වේ.\n\nඅබ්‍රහ්මචර්යාව අත්හැර, බ්‍රහ්මචාරීවූයේ වෙයි. දුරින් හැසිරෙන්නේය. මෛථුන ධර්මයෙන් (ගැමි දහමෙන්) වෙන්වූයේ වෙයි. මෙයද ඔහුගේ සීලයෙහි වේ.\n\nමුසාවාදය අත්හැර, මුසාවාදයෙන් වෙන්වූයේ වෙයි. සත්‍යය කථා කරන්නේය, සත්‍යයට බැඳී සිටින්නේය, ස්ථිරවූයේය, විශ්වාස කටයුතුය, ලෝකයාට නොරවටන්නෙක් වෙයි. මෙයද ඔහුගේ සීලයෙහි වේ.\n\nපිසුනු වචනය අත්හැර, පිසුනු වචනයෙන් වෙන්වූයේ වෙයි. මෙතැනදී අසා මේ අය භේද කිරීමට එතැන නොකියන්නේය. එතැනදී අසා මේ අය භේද කිරීමට මෙතැන නොකියන්නේය. මෙසේ භේද වූවන් එක් කරන්නේය, සමඟි වූවන් තවදුරටත් සමඟි කරවන්නේය, සමඟියෙහි ඇලුණේය, සමඟියෙහි සතුටු වන්නේය, සමඟි කරවන වචන කථා කරන්නේය. මෙයද ඔහුගේ සීලයෙහි වේ.\n\nඵරුෂ වචනය අත්හැර, ඵරුෂ වචනයෙන් වෙන්වූයේ වෙයි. යම් ඒ වචනයක් නිදොස්ද, කනට ප්‍රියද, පෙම් කටයුතුද, හදවතට පිවිසෙන්නේද, නාගරිකද, බොහෝ දෙනාට ප්‍රියද, බොහෝ දෙනාගේ සිත් සතුටු කරන්නේද, එබඳු වචන කථා කරන්නේය. මෙයද ඔහුගේ සීලයෙහි වේ.\n\nසම්ප්‍රප්පලාපය අත්හැර, සම්ප්‍රප්පලාපයෙන් වෙන්වූයේ වෙයි. කලට සුදුසු වචන කියන්නේය, සත්‍යයට අනුකූල වචන කියන්නේය, ප්‍රයෝජනවත් වචන කියන්නේය, ධර්මයට අනුකූල වචන කියන්නේය, විනයට අනුකූල වචන කියන්නේය. නිධානයක් බඳු, කලට සුදුසු, හේතු සහිතවූ, සීමා සහිතවූ, අර්ථවත් වචන කථා කරන්නේය. මෙයද ඔහුගේ සීලයෙහි වේ.\n\nබීජග්‍රාම භූතග්‍රාම විනාශ කිරීමෙන් වෙන්වූයේ වෙයි. එක වේලක් වළඳන්නේය, රාත්‍රියට වැළකී, විකාල භෝජනයෙන් වෙන්වූයේ වෙයි. නැටුම්, ගීත, වාදන සහ විසුළු දැකීමෙන් වෙන්වූයේ වෙයි. මල්, ගඳ විලවුන්, ආලේපන දැරීමෙන් හා මණ්ඩන විභූෂණ ස්ථානයන්ගෙන් වෙන්වූයේ වෙයි. උස් අසුන් හා මහා අසුන් ගැනීමෙන් වෙන්වූයේ වෙයි. රන් රිදී ගැනීමෙන් වෙන්වූයේ වෙයි. අමු ධාන්‍ය ගැනීමෙන් වෙන්වූයේ වෙයි. අමු මස් ගැනීමෙන් වෙන්වූයේ වෙයි. ස්ත්‍රීන් හා කුමාරිකාවන් (තමා සතු කර ගැනීමෙන්) වෙන්වූයේ වෙයි. දාසයන් හා දාසියන් (තමා සතු කර ගැනීමෙන්) වෙන්වූයේ වෙයි. එළු බැටළුවන් (තමා සතු කර ගැනීමෙන්) වෙන්වූයේ වෙයි. කුකුළන් හා ඌරන් (තමා සතු කර ගැනීමෙන්) වෙන්වූයේ වෙයි. ඇතැන්, ගවයන්, අසුන් හා වෙළඹුන් (තමා සතු කර ගැනීමෙන්) වෙන්වූයේ වෙයි. කෙත්බිම් හා ඉඩකඩම් (තමා සතු කර ගැනීමෙන්) වෙන්වූයේ වෙයි. දූත මෙහෙවර සහ පණිවිඩ ගෙන යැවීම්වල යෙදීමෙන් වෙන්වූයේ වෙයි. ගනුදෙනු කිරීමෙන් වෙන්වූයේ වෙයි. තරාදියේ වංචා කිරීම්, කාසි වංචා කිරීම්, මිනුම් වංචා කිරීම්වලින් වෙන්වූයේ වෙයි. අල්ලස් ගැනීමෙන්, වංචා කිරීමෙන්, කපටිකම් කිරීමෙන් සහ බොරු සාක්ෂි දීමෙන් වෙන්වූයේ වෙයි. කැපීම්, මැරීම්, බැඳීම්, මං පැහැරීම්, කොල්ලකෑම් සහ බලහත්කාරකම් කිරීමෙන් වෙන්වූයේ වෙයි. මෙයද ඔහුගේ සීලයෙහි වේ.",
      "paliTitle": "Cūḷasīlaṃ",
      "englishTitle": "The Lesser Morality",
      "sinhalaTitle": "චූල ශීල"
    },
    {
      "number": 195,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ bījagāmabhūtagāmasamārambhaṃ anuyuttā viharanti. Seyyathidaṃ – mūlabījaṃ khandhabījaṃ phaḷubījaṃ aggabījaṃ bījabījameva pañcamaṃ, iti evarūpā bījagāmabhūtagāmasamārambhā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some worthy recluses and brahmins, having partaken of food given out of faith, dwell addicted to the destruction of seed-plants and plant-growths. That is to say: root seeds, stem cuttings, joint cuttings, shoot cuttings, and seed-seeds as the fifth. From such destruction of seed-plants and plant-growths he refrains. This too is part of his virtue.",
      "sinhala": "යම්සේ ඇතැම් පූජ්‍ය ශ්‍රමණ​-බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දුන් භෝජන වළඳා, ඔවුහු මෙබඳු බීජග්‍රාම හා භූතග්‍රාම විනාශ කිරීමෙහි යෙදී වාසය කරත්ද. එනම්: මුල් බීජ, කඳ බීජ, පුරුක් බීජ, අග්‍රස්ථ බීජ, පස්වැනිව බීජ බීජයම යන මේවාය. මෙසේ, මෙබඳු බීජග්‍රාම භූතග්‍රාම විනාශ කිරීමෙන් ඔහු වැළකී සිටී. මෙයද ඔහුගේ සීලයෙහි අංගයක් වේ.",
      "paliTitle": "Majjhimasīlaṃ",
      "englishTitle": "Middle Morality",
      "sinhalaTitle": "මධ්‍යක්‍ෂම සීලය"
    },
    {
      "number": 196,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ sannidhikāraparibhogaṃ anuyuttā viharanti. Seyyathidaṃ – annasannidhiṃ pānasannidhiṃ vatthasannidhiṃ yānasannidhiṃ sayanasannidhiṃ gandhasannidhiṃ āmisasannidhiṃ, iti vā iti evarūpā sannidhikāraparibhogā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some esteemed ascetics and brahmins, having partaken of food offered by faith, remain addicted to such accumulation and consumption—that is, the accumulation of food, the accumulation of drinks, the accumulation of clothes, the accumulation of vehicles, the accumulation of beds and dwellings, the accumulation of perfumes, and the accumulation of other material provisions—he abstains from such accumulation and consumption. This, too, is part of his moral conduct.",
      "sinhala": "යම්සේ ඇතැම් පින්වත් ශ්‍රමණබ්‍රාහ්මණවරු ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙවැනි රැස්කොට පරිභෝග කිරීමෙහි යෙදී වාසය කරති. එනම්, ආහාර රැස්කිරීම, පාන වර්ග රැස්කිරීම, වස්ත්‍ර රැස්කිරීම, යාන වාහන රැස්කිරීම, සයන (ඇඳ පුටු) රැස්කිරීම, ගන්ධ (සුවඳ විලවුන්) රැස්කිරීම, අනෙකුත් පරිභෝග වස්තු රැස්කිරීම යනාදියයි. මෙවැනි රැස්කොට පරිභෝග කිරීම්වලින් හෙතෙම වෙන්වූයේ වෙයි. මෙය ද ඔහුගේ සීලයෙහි අංගයක් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 197,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ visūkadassanaṃ anuyuttā viharanti. Seyyathidaṃ – naccaṃ gītaṃ vāditaṃ pekkhaṃ akkhānaṃ pāṇissaraṃ vetāḷaṃ kumbhathūṇaṃ sobhanakaṃ caṇḍālaṃ vaṃsaṃ dhovanaṃ hatthiyuddhaṃ assayuddhaṃ mahiṃsayuddhaṃ usabhayuddhaṃ ajayuddhaṃ meṇḍayuddhaṃ kukkuṭayuddhaṃ vaṭṭakayuddhaṃ daṇḍayuddhaṃ muṭṭhiyuddhaṃ nibbuddhaṃ uyyodhikaṃ balaggaṃ senābyūhaṃ anīkadassanaṃ iti vā iti evarūpā visūkadassanā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some venerable ascetics and brahmins, having partaken of food offered out of faith, dwell addicted to such unedifying spectacles—that is to say, dancing, singing, instrumental music, theatrical shows, recitations, hand-clapping music, drum shows, pot-drum shows, acrobatics, Caṇḍāla performances, bamboo pole shows, displays of washing, elephant fights, horse fights, buffalo fights, bull fights, goat fights, ram fights, cock fights, quail fights, stick fights, boxing, wrestling, sham fights, troop reviews, army arrays, and regimental reviews—from such unedifying spectacles he refrains. This, too, is part of his morality.",
      "sinhala": "තවද, යම්සේ ඇතැම් පින්වත් ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙවැනි විසුක දර්ශන වලට ඇලුම් කරමින් වාසය කරත්ද, එනම්: නැටුම්, ගැයුම්, වැයුම්, දැකීම්, ආඛ්‍යාන, අත්පොඩි ගැසීම්, භේරී වාදනය, ඝට වාදනය, ශෝභනික ප්‍රදර්ශන, චණ්ඩාල ක්‍රීඩා, වංස, දෝවන, හස්ති යුද්ධ, අශ්ව යුද්ධ, මීහරක් යුද්ධ, වෘෂභ යුද්ධ, එළු යුද්ධ, බැටළු යුද්ධ, කුකුළු යුද්ධ, වටු යුද්ධ, දඬු යුද්ධ, මුෂ්ටි යුද්ධ, මල්ලව පොර, මවාපෑම් යුද්ධ, යුද්ධ සේනා පෙරහැර, යුද්ධ සේනා විහිදුවීම්, සේනා දර්ශන යනාදී මෙබඳු විසුක දර්ශන වලින් ඔහු වැළකී සිටියි.\n\nමෙයද ඔහුගේ සීලයේ අංගයකි.",
      "paliTitle": ""
    },
    {
      "number": 198,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ jūtappamādaṭṭhānānuyogaṃ anuyuttā viharanti. Seyyathidaṃ – aṭṭhapadaṃ dasapadaṃ ākāsaṃ parihārapathaṃ santikaṃ khalikaṃ ghaṭikaṃ salākahatthaṃ akkhaṃ paṅgacīraṃ vaṅkakaṃ mokkhacikaṃ ciṅgulikaṃ pattāḷhakaṃ rathakaṃ dhanukaṃ akkharikaṃ manesikaṃ yathāvajjaṃ iti vā iti evarūpā jūtappamādaṭṭhānānuyogā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some respected recluses and brahmins, having partaken of food given out of faith, live engaged in such gambling and heedless pursuits—namely, games on boards with eight or ten rows of squares, air-gambling, removing pieces from a board, dice-in-the-air, drawing lines for games, striking-a-stick games, hand-dice games, dice-play, gambling with chips, curved-stick games, guessing with the hand, finger-guessing, leaf-dice games, toy chariot games, toy bow games, letter-guessing, mind-reading, and mimicry—he abstains from such engagements in gambling and heedlessness. This, too, is an aspect of his virtue.",
      "sinhala": "තවද, ඇතැම් පූජ්‍ය ශ්‍රමණ-බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා මෙබඳු සූදු කෙළීමෙහි හා ප්‍රමාදයට හේතු වන ස්ථානවල යෙදී වාසය කරති.\n\nඑනම්: අටපද, දසපද, ආකාශ, පරිහාරපථ, සන්තික, ඛලික, ඝටික, සලාකහත්ථ, අක්ඛ, පංගචීර, වංකක, මොක්ඛචික, චිංගුලික, පත්තාළ්හක, රථක, ධනුක, අක්ඛරික, මනෙසික, යථාවජ්ජ යන මේවාය. මෙබඳු සූදු කෙළීමෙහි හා ප්‍රමාදයට හේතු වන ස්ථානවල යෙදීමෙන් ඔහු වැළකී සිටියි.\n\nමෙය ද ඔහුගේ සීලයෙහි කොටසක් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 199,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ uccāsayanamahāsayanaṃ anuyuttā viharanti. Seyyathidaṃ – āsandiṃ pallaṅkaṃ gonakaṃ cittakaṃ paṭikaṃ paṭalikaṃ tūlikaṃ vikatikaṃ uddalomiṃ ekantalomiṃ kaṭṭissaṃ koseyyaṃ kuttakaṃ hatthattharaṃ assattharaṃ rathattharaṃ ajinappaveṇiṃ kadalimigapavarapaccattharaṇaṃ sauttaracchadaṃ ubhatolohitakūpadhānaṃ iti vā iti evarūpā uccāsayanamahāsayanā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some reverend monastics and brahmins, having consumed food given out of faith, dwell engaged in such high and luxurious beds and seats. He abstains from such high and luxurious beds and seats as these: a high couch, a divan, a long-fleeced rug, an embroidered rug, a silk rug, a rug woven with flowers, a cotton mattress, an ornate coverlet, a fleece with long wool on both sides, a fleece with long wool on one side, a rug embroidered with gems, a silk coverlet, a large woolen rug, an elephant rug, a horse rug, a chariot rug, a deer-hide rug, a fine antelope-skin spread, a couch with a canopy, and a couch with red pillows at both ends. This too is part of his moral conduct.",
      "sinhala": "යම්සේ නම් සමහර ගෞරවනීය ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු උස් ආසන මහා ආසන භාවිත කරමින් වාසය කරති. එනම්, උස් අසුන්, දිග පලක්, දිගු ලොම් සහිත ඇතිරිලි, වර්ණවත් ඇතිරිලි, සුදු ලොම් ඇතිරිලි, මල් කටුකම් සහිත ඇතිරිලි, පුළුන් පුරවා තනන ලද ඇතිරිලි, සිංහ ව්‍යාඝ්‍ර ආදි රූප සහිත ඇතිරිලි, දෙපසම ලොම් සහිත ඇතිරිලි, එක් පසෙකින් ලොම් සහිත ඇතිරිලි, රන් රිදී කටුකම් සහිත ඇතිරිලි, සේද ඇතිරිලි, විවිධ සමින් කළ විශාල ඇතිරිලි, ඇතුන් පිට අතුරන ඇතිරිලි, අශ්වයන් පිට අතුරන ඇතිරිලි, රථයන්හි අතුරන ඇතිරිලි, මුව සමින් කළ ඇතිරිලි, කදලී මුව වර්ගයේ උසස් සමෙන් කළ ඇතිරිලි, විසිතුරු වියන් සහිත ආසන, දෙපසම රතු කොට්ට සහිත ආසන යනාදි මෙබඳු උස් ආසන මහා ආසනවලින් ඔහු වැළකී සිටී. මෙයද ඔහුගේ සිල්පදයක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 200,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ maṇḍanavibhūsanaṭṭhānānuyogaṃ anuyuttā viharanti. Seyyathidaṃ – ucchādanaṃ parimaddanaṃ nhāpanaṃ sambāhanaṃ ādāsaṃ añjanaṃ mālāgandhavilepanaṃ mukhacuṇṇaṃ mukhalepanaṃ hatthabandhaṃ sikhābandhaṃ daṇḍaṃ nāḷikaṃ asiṃ [khaggaṃ (sī. pī.), asiṃ khaggaṃ (syā. kaṃ.), khaggaṃ asiṃ (ka.)] chattaṃ citrupāhanaṃ uṇhīsaṃ maṇiṃ vālabījaniṃ odātāni vatthāni dīghadasāni iti vā iti evarūpā maṇḍanavibhūsanaṭṭhānānuyogā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some esteemed monastics and brahmins, having consumed food given out of faith, remain devoted to such pursuits of adornment and beautification—that is to say: rubbing the body with powders, massaging, bathing, anointing, using mirrors, eye-salve, garlands, perfumes, and unguents, face-powder, face-paint, bracelets, top-knot ornaments, staffs, walking sticks, swords, parasols, embroidered sandals, turbans, jewels, yak-tail whisks, white garments, and long-fringed garments—from such pursuits of adornment and beautification, he abstains. This, too, is part of his ethical conduct.",
      "sinhala": "තවද, ඇතැම් පින්වත් ශ්‍රමණබ්‍රාහ්මණයෝ සද්ධාවෙන් දෙන ලද භෝජන වළඳා මෙබඳු මණ්ඩන විභූෂණ කටයුතුවලට අනුව යමින් වාසය කරති. එනම් – ඇඟ පිරිමැදීම, සම්බාහනය කිරීම, ස්නානය කිරීම, අඟ සම්බාහනය කිරීම, කණ්ණාඩි, අඳුන්, මල්, සුවඳ විලවුන්, මුහුණු කුඩු, මුහුණු ආලේපන, අත් පළඳනා, හිස් පළඳනා, සැරයටි, නාළිකා, අසිපත්, ඡත්‍ර, සිත්කළු පාවහන්, උෂ්ණීෂ, මැණික්, වල් විදුනා, සුදු වස්ත්‍ර, දික් දාර ආදී වූ මෙවැනි මණ්ඩන විභූෂණ කටයුතුවලින් ඔහු වළකී සිටියි. මෙයද ඔහුගේ සීලයෙහි කොටසක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 201,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ tiracchānakathaṃ anuyuttā viharanti. Seyyathidaṃ – rājakathaṃ corakathaṃ mahāmattakathaṃ senākathaṃ bhayakathaṃ yuddhakathaṃ annakathaṃ pānakathaṃ vatthakathaṃ sayanakathaṃ mālākathaṃ gandhakathaṃ ñātikathaṃ yānakathaṃ gāmakathaṃ nigamakathaṃ nagarakathaṃ janapadakathaṃ itthikathaṃ [itthikathaṃ purisakathaṃ kumārakathaṃ kumārikathaṃ (ka.)] sūrakathaṃ visikhākathaṃ kumbhaṭṭhānakathaṃ pubbapetakathaṃ nānattakathaṃ lokakkhāyikaṃ samuddakkhāyikaṃ itibhavābhavakathaṃ iti vā iti evarūpāya tiracchānakathāya paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some venerable ascetics and brahmins, having consumed alms offered in faith, dwell addicted to such frivolous talk as, for example, talk of kings, talk of robbers, talk of ministers, talk of armies, talk of dangers, talk of battles, talk of food, talk of drinks, talk of clothes, talk of beds, talk of garlands, talk of perfumes, talk of relatives, talk of vehicles, talk of villages, talk of market towns, talk of cities, talk of provinces, talk of women, talk of men, talk of boys, talk of girls, talk of heroes, talk of streets, talk of watering-places, talk of the departed, diverse talk, talk about the world's origin, talk about the ocean's origin, and talk of becoming and not becoming—from such frivolous talk he abstains. This also belongs to his moral conduct.",
      "sinhala": "නැතහොත් සමහර පින්වත් ශ‍්‍රමණබ්‍රාහ්මණයෝ ශ‍්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, ඔවුහු මේ අයුරින් තිරිසන් කතාවල නිරත වෙමින් වාසය කරති. එනම් – රජුන් පිළිබඳ කතා, සොරුන් පිළිබඳ කතා, අමාත්‍යවරුන් පිළිබඳ කතා, සේනාවන් පිළිබඳ කතා, බිය පිළිබඳ කතා, යුද්ධ පිළිබඳ කතා, බත් පිළිබඳ කතා, බීම පිළිබඳ කතා, වස්ත්‍ර පිළිබඳ කතා, සයනයන් පිළිබඳ කතා, මල් පිළිබඳ කතා, සුවඳ පිළිබඳ කතා, ඥාතීන් පිළිබඳ කතා, යාන වාහන පිළිබඳ කතා, ගම් පිළිබඳ කතා, නියම්ගම් පිළිබඳ කතා, නගර පිළිබඳ කතා, ජනපද පිළිබඳ කතා, ස්ත්‍රීන් පිළිබඳ කතා, පුරුෂයන් පිළිබඳ කතා, කුමාරවරුන් පිළිබඳ කතා, කුමාරිකාවන් පිළිබඳ කතා, වීරයන් පිළිබඳ කතා, වීදි පිළිබඳ කතා, නාන තොටුපොළවල් පිළිබඳ කතා, පෙර මියගිය ඥාතීන් පිළිබඳ කතා, නානාප‍්‍රකාර කතා, ලෝකය පිළිබඳ කතා, මුහුද පිළිබඳ කතා, මෙලොව හා පරලොව පිළිබඳ කතා යන මේ ආදී වූ තිරිසන් කතාවලින් වැළකී සිටියි. මෙයද ඔහුගේ සීලයෙහි කොටසක් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 202,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ viggāhikakathaṃ anuyuttā viharanti. Seyyathidaṃ – na tvaṃ imaṃ dhammavinayaṃ ājānāsi, ahaṃ imaṃ dhammavinayaṃ ājānāmi, kiṃ tvaṃ imaṃ dhammavinayaṃ ājānissasi, micchā paṭipanno tvamasi, ahamasmi sammā paṭipanno, sahitaṃ me, asahitaṃ te, pure vacanīyaṃ pacchā avaca, pacchā vacanīyaṃ pure avaca, adhiciṇṇaṃ te viparāvattaṃ, āropito te vādo, niggahito tvamasi, cara vādappamokkhāya, nibbeṭhehi vā sace pahosīti iti vā iti evarūpāya viggāhikakathāya paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some worthy monastics and brahmins, having consumed meals given out of faith, dwell engaged in such quarrelsome talk as, \"You do not understand this Dhamma and Discipline; I understand this Dhamma and Discipline. How could you understand this Dhamma and Discipline? You are practicing wrongly, I am practicing correctly. What I say is coherent, what you say is incoherent. You said what should have been said later, earlier; and what should have been said earlier, later. Your argument is turned upside down. Your thesis has been refuted. You are defeated. Go and free yourself from this argument! Or disentangle it if you can!\" From such quarrelsome talk he refrains. This too is part of his moral conduct.",
      "sinhala": "තවද, ඇතැම් පින්වත් ශ්‍රමණ​බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු විවාදාත්මක කතාවල යෙදී වාසය කරති. එනම්: ‘නුඹ මේ ධර්ම​විනය නොදනී, මම මේ ධර්ම​විනය දනිමි. නුඹ මේ ධර්ම​විනය දන්නෙහිද? නුඹ වැරදි මඟෙහි හැසිරෙන්නෙහිය, මම නිවැරදි මඟෙහි හැසිරෙමි. මා කී දේ සාරවත්ය, නුඹ කී දේ සාරවත් නැත. කලින් කිව යුතු දෙය පසුව කීවෙහිය, පසුව කිව යුතු දෙය කලින් කීවෙහිය. නුඹ පුරුදු කළ මතය පෙරළී ගියේය. නුඹට දොස් පවරන ලදී. නුඹ පරාජය කරනු ලැබුවෙහිය. තමන්ගේ වාදයෙන් මිදීමට යනු, හෝ හැකි නම් පැහැදිලි කරනු.’ යනුවෙන් මෙබඳු විවාදාත්මක කතාවලින් වැළකී සිටී.\n\nමෙයද ඔහුගේ සීලයේ කොටසක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 203,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpaṃ dūteyyapahiṇagamanānuyogaṃ anuyuttā viharanti. Seyyathidaṃ – raññaṃ, rājamahāmattānaṃ, khattiyānaṃ, brāhmaṇānaṃ, gahapatikānaṃ, kumārānaṃ – ‘idha gaccha, amutrāgaccha, idaṃ hara, amutra idaṃ āharā’ti iti vā iti evarūpā dūteyyapahiṇagamanānuyogā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some venerable ascetics and brahmins, having eaten food given out of faith, live engaged in such messenger work and going on errands—that is, for kings, royal ministers, nobles, brahmins, householders, or princes—being told, ‘Go here, come there, take this, bring that from there,’ from such messenger work and going on errands he abstains. This too is part of his virtue.",
      "sinhala": "සමහර පූජනීය ශ්‍රමණ-බ්‍රාහ්මණයන් ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු දූත කර්මයන්හි යෙදී වාසය කරති. එනම්: රජවරුන්, රජමහඅමාත්‍යවරුන්, ක්ෂත්‍රියයන්, බ්‍රාහ්මණයන්, ගෘහපතියන්, කුමාරවරුන් වෙනුවෙන් ‘මෙතැනට යන්න, එතැනට එන්න, මෙය ගෙන යන්න, එතැනින් මෙය ගෙන එන්න’ යනුවෙන් ඇති මෙබඳු දූත කර්මයන්ගෙන් ඔහු වැළකී සිටියි. මෙයද ඔහුගේ සීලය වේ.",
      "paliTitle": ""
    },
    {
      "number": 204,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te kuhakā ca honti lapakā ca nemittikā ca nippesikā ca lābhena lābhaṃ nijigīṃsitāro ca. Iti evarūpā kuhanalapanā paṭivirato hoti. Idampissa hoti sīlasmiṃ’’.",
      "english": "Just as some venerable ascetics and brahmins, having consumed food given out of faith, are deceitful, glib, interpreters of omens, fawners, and are ever seeking gain through gain; he abstains from such acts of deception and glibness. This too is part of his virtue.",
      "sinhala": "යම්සේ සමහර පින්වත් ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, ඔවුහු කුහකයෝ ද වෙත් ද, වංචාකාර කතා කියන්නෝ ද වෙත් ද, නිමිති කියන්නෝ ද වෙත් ද, අනුන් පොළඹවන්නෝ ද වෙත් ද, ලාභයෙන් ලාභ සොයන්නෝ ද වෙත් ද; ඔහු මෙවැනි කුහකකම්වලින් හා වංචාකාර කතාබහෙන් වැළකී සිටින්නේ ය. මෙය ද ඔහුගේ සීලයෙහි වේ.",
      "paliTitle": ""
    },
    {
      "number": 205,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti. Seyyathidaṃ – aṅgaṃ nimittaṃ uppātaṃ supinaṃ lakkhaṇaṃ mūsikacchinnaṃ aggihomaṃ dabbihomaṃ thusahomaṃ kaṇahomaṃ taṇḍulahomaṃ sappihomaṃ telahomaṃ mukhahomaṃ lohitahomaṃ aṅgavijjā vatthuvijjā khattavijjā sivavijjā bhūtavijjā bhūrivijjā ahivijjā visavijjā vicchikavijjā mūsikavijjā sakuṇavijjā vāyasavijjā pakkajjhānaṃ saraparittāṇaṃ migacakkaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Or again, some venerable recluses and brahmins, having consumed meals offered out of faith, live by such low arts, by wrong livelihood. These include: divination by bodily marks, by omens, by portents, by dreams, by characteristic marks; divination by mouse-gnawed objects; fire offerings, ladle offerings, husk offerings, bran offerings, rice-grain offerings, ghee offerings, oil offerings, mouth offerings, blood offerings; knowledge of bodily marks, knowledge of sites, knowledge of fields, knowledge of burrows, knowledge of spirits, knowledge of the earth, knowledge of snakes, knowledge of poisons, knowledge of scorpions, knowledge of mice, knowledge of birds, knowledge of crows; fortune-telling by lamp flames, protection by incantations for weapons, and divination by animal behavior. From such low arts, from such wrong livelihood, he abstains. This, too, is part of his virtue.",
      "sinhala": "තවද සමහර පින්වත් ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, ඔවුන් මෙබඳු තිරශ්චීන විද්‍යාවකින්, මිථ්‍යා ආජීවයකින් ජීවිකාව කෙරෙති.\n\nඑනම් අංග ලක්ෂණ බලා පලාපල කීම, නිමිති බලා පලාපල කීම, උප්පාත බලා පලාපල කීම, සිහින බලා පලාපල කීම, ලක්ෂණ බලා පලාපල කීම, මීයන් විසින් කැපූ දැ බලා පලාපල කීම, අග්නි හෝම කිරීම, දඬු හෝම කිරීම, තොහොඹු හෝම කිරීම, කැකුළු හෝම කිරීම, තන්ඩුල හෝම කිරීම, සප්පි හෝම කිරීම, තෙල් හෝම කිරීම, මුඛ හෝම කිරීම, ලෝහිත හෝම කිරීම, අංග විද්‍යාව, වස්තු විද්‍යාව, ක්ෂේත්‍ර විද්‍යාව, සිව විද්‍යාව, භූත විද්‍යාව, භූරි විද්‍යාව, අහි විද්‍යාව, විස විද්‍යාව, විච්ඡිකා විද්‍යාව, මූසික විද්‍යාව, සකුණ විද්‍යාව, වායස විද්‍යාව, තරු බලා පලාපල කීම, ඊතලවලින් ආරක්ෂා කිරීම, මෘග චක්‍ර බැලීම යනාදියයි. මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන් යුත් මිථ්‍යා ආජීවයෙන් හෙතෙම ඈත් වූවෙක් වෙයි. මෙයද ඔහුගේ ශීලය වේ.",
      "paliTitle": "Mahāsīlaṃ",
      "englishTitle": "The Great Virtue",
      "sinhalaTitle": "මහා ශීලය"
    },
    {
      "number": 206,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti. Seyyathidaṃ – maṇilakkhaṇaṃ vatthalakkhaṇaṃ daṇḍalakkhaṇaṃ satthalakkhaṇaṃ asilakkhaṇaṃ usulakkhaṇaṃ dhanulakkhaṇaṃ āvudhalakkhaṇaṃ itthilakkhaṇaṃ purisalakkhaṇaṃ kumāralakkhaṇaṃ kumārilakkhaṇaṃ dāsalakkhaṇaṃ dāsilakkhaṇaṃ hatthilakkhaṇaṃ assalakkhaṇaṃ mahiṃsalakkhaṇaṃ usabhalakkhaṇaṃ golakkhaṇaṃ ajalakkhaṇaṃ meṇḍalakkhaṇaṃ kukkuṭalakkhaṇaṃ vaṭṭakalakkhaṇaṃ godhālakkhaṇaṃ kaṇṇikalakkhaṇaṃ kacchapalakkhaṇaṃ migalakkhaṇaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some venerable recluses and brahmins, having consumed food offered in faith, sustain themselves by a wrong livelihood through such low arts—that is to say, divining by interpreting marks on jewels, on garments, on staffs, on knives, on swords, on arrows, on bows, on other weapons; divining by interpreting marks on women, on men, on boys, on girls, on male slaves, on female slaves; divining by interpreting marks on elephants, on horses, on buffaloes, on bulls, on cows, on goats, on sheep, on chickens, on quails, on iguanas, on lizards, on tortoises, on deer. He, however, refrains from such low arts and wrong livelihood as these. This too is part of his morality.",
      "sinhala": "තවද ඇතැම් ගෞරවාර්හ ශ්‍රමණ බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන්, මිථ්‍යා ආජීවයෙන් ජීවිකාව ගෙන යති. එනම් – මැණික් ලක්ෂණ කීම, වස්ත්‍ර ලක්ෂණ කීම, දඬු ලක්ෂණ කීම, ශස්ත්‍ර ලක්ෂණ කීම, කඩු ලක්ෂණ කීම, ඊතල ලක්ෂණ කීම, දුනු ලක්ෂණ කීම, ආයුධ ලක්ෂණ කීම, ස්ත්‍රී ලක්ෂණ කීම, පුරුෂ ලක්ෂණ කීම, කුමාර ලක්ෂණ කීම, කුමාරිකා ලක්ෂණ කීම, දාස ලක්ෂණ කීම, දාසි ලක්ෂණ කීම, හස්ති ලක්ෂණ කීම, අශ්ව ලක්ෂණ කීම, මීහරක් ලක්ෂණ කීම, වෘෂභ ලක්ෂණ කීම, ගව ලක්ෂණ කීම, එළු ලක්ෂණ කීම, බැටළු ලක්ෂණ කීම, කුකුළු ලක්ෂණ කීම, වටු ලක්ෂණ කීම, ගෝධා ලක්ෂණ කීම, කණිකා ලක්ෂණ කීම, කැස්බෑ ලක්ෂණ කීම, මෘග ලක්ෂණ කීම යනාදී වශයෙනි. මෙසේ මේ යනාදී වශයෙන් මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන්, මිථ්‍යා ආජීවයෙන් වැළකී සිටියි. මෙයද ඔහුගේ සීලයේ කොටසක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 207,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti. Seyyathidaṃ – raññaṃ niyyānaṃ bhavissati, raññaṃ aniyyānaṃ bhavissati, abbhantarānaṃ raññaṃ upayānaṃ bhavissati, bāhirānaṃ raññaṃ apayānaṃ bhavissati, bāhirānaṃ raññaṃ upayānaṃ bhavissati, abbhantarānaṃ raññaṃ apayānaṃ bhavissati, abbhantarānaṃ raññaṃ jayo bhavissati, bāhirānaṃ raññaṃ parājayo bhavissati, bāhirānaṃ raññaṃ jayo bhavissati, abbhantarānaṃ raññaṃ parājayo bhavissati, iti imassa jayo bhavissati, imassa parājayo bhavissati iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Furthermore, just as some honorable recluses and brahmins, having partaken of food offered out of faith, make their living by such common arts and wrong livelihood as these: 'The king will set out,' or 'The king will not set out'; 'The local kings will advance,' or 'The foreign kings will retreat'; 'The foreign kings will advance,' or 'The local kings will retreat'; 'The local kings will conquer,' or 'The foreign kings will be defeated'; 'The foreign kings will conquer,' or 'The local kings will be defeated'; or 'This one will conquer,' or 'That one will be defeated.' From such common arts and wrong livelihood, he abstains. This, too, is part of his morality.",
      "sinhala": "තවද ඇතැම් භවත් ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන්, මිත්‍යා ආජීවයෙන් ජීවිකාව ගෙන යති. ඒ කෙසේද යත්: රජවරුන්ගේ නික්ම යාමක් වන්නේය, රජවරුන්ගේ නික්ම නොයාමක් වන්නේය, ඇතුළු රජවරුන්ගේ ඉදිරියට යාමක් වන්නේය, පිටත රජවරුන්ගේ පසුබැසීමක් වන්නේය, පිටත රජවරුන්ගේ ඉදිරියට යාමක් වන්නේය, ඇතුළු රජවරුන්ගේ පසුබැසීමක් වන්නේය, ඇතුළු රජවරුන්ට ජයග්‍රහණයක් වන්නේය, පිටත රජවරුන්ට පරාජයක් වන්නේය, පිටත රජවරුන්ට ජයග්‍රහණයක් වන්නේය, ඇතුළු රජවරුන්ට පරාජයක් වන්නේය, නැතහොත් මේ රජුට ජයග්‍රහණයක් වන්නේය, මේ රජුට පරාජයක් වන්නේය යනුයි. මෙසේ මෙබඳු තිරශ්චීන විද්‍යාවන්ගෙන්, මිත්‍යා ආජීවයෙන් වැළකුණේ වෙයි. මේ ද ඔහුගේ සීලයෙහි අංගයක් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 208,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti. Seyyathidaṃ – candaggāho bhavissati, sūriyaggāho bhavissati, nakkhattaggāho bhavissati, candimasūriyānaṃ pathagamanaṃ bhavissati, candimasūriyānaṃ uppathagamanaṃ bhavissati, nakkhattānaṃ pathagamanaṃ bhavissati, nakkhattānaṃ uppathagamanaṃ bhavissati, ukkāpāto bhavissati, disāḍāho bhavissati, bhūmicālo bhavissati, devadudrabhi bhavissati, candimasūriyanakkhattānaṃ uggamanaṃ ogamanaṃ saṃkilesaṃ vodānaṃ bhavissati, evaṃvipāko candaggāho bhavissati, evaṃvipāko sūriyaggāho bhavissati, evaṃvipāko nakkhattaggāho bhavissati, evaṃvipākaṃ candimasūriyānaṃ pathagamanaṃ bhavissati, evaṃvipākaṃ candimasūriyānaṃ uppathagamanaṃ bhavissati, evaṃvipākaṃ nakkhattānaṃ pathagamanaṃ bhavissati, evaṃvipākaṃ nakkhattānaṃ uppathagamanaṃ bhavissati, evaṃvipāko ukkāpāto bhavissati, evaṃvipāko disāḍāho bhavissati, evaṃvipāko bhūmicālo bhavissati, evaṃvipāko devadudrabhi bhavissati, evaṃvipākaṃ candimasūriyanakkhattānaṃ uggamanaṃ ogamanaṃ saṃkilesaṃ vodānaṃ bhavissati iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some venerable recluses and brahmins, having consumed food offered out of faith, sustain themselves by such low arts and wrong livelihood—for example, by predicting a lunar eclipse, a solar eclipse, an eclipse of a constellation; the moon and sun traveling on their proper course, the moon and sun traveling off their proper course; constellations traveling on their proper course, constellations traveling off their proper course; a meteor shower, a burning of the quarters, an earthquake, a thunderclap; the rising, setting, defilement, and purification of the moon, sun, and constellations; predicting the outcome of a lunar eclipse, the outcome of a solar eclipse, the outcome of an eclipse of a constellation; the outcome of the moon and sun traveling on their proper course, the outcome of the moon and sun traveling off their proper course; the outcome of constellations traveling on their proper course, the outcome of constellations traveling off their proper course; the outcome of a meteor shower, the outcome of a burning of the quarters, the outcome of an earthquake, the outcome of a thunderclap; the outcome of the rising, setting, defilement, and purification of the moon, sun, and constellations—he abstains from such low arts and wrong livelihood. This, too, is part of his moral conduct.",
      "sinhala": "තවද ඇතැම් භවත් ශ්‍රමණබ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙවැනි තිරශ්චීන විද්‍යාවකින් (මිථ්‍යාජීවයෙන්) ජීවිකාව කෙරෙති. එනම්: හඳග්‍රහණයක් වන්නේය, හිරුග්‍රහණයක් වන්නේය, තාරකාග්‍රහණයක් වන්නේය, හඳහිරුන්ගේ යහමඟ ගමනක් වන්නේය, හඳහිරුන්ගේ අයහමඟ ගමනක් වන්නේය, තාරකාවල යහමඟ ගමනක් වන්නේය, තාරකාවල අයහමඟ ගමනක් වන්නේය, උල්කාපාතයක් වන්නේය, දිශාදාහයක් වන්නේය, භූමිකම්පාවක් වන්නේය, දෙව්ලොව බෙර හඬක් වන්නේය, හඳහිරුන්ගේ සහ තාරකාවල නැගීමක් හෝ බැසීමක්, කිලිටිවීමක් හෝ පිරිසිදු වීමක් වන්නේය යනාදිය කියමින් ජීවත්වන මෙබඳු තිරශ්චීන විද්‍යාව නම් වූ මිථ්‍යා ජීවිකාවෙන් ඔහු වැළකී සිටියි. මෙය ද ඔහුගේ සිල්පදයන්ට අයත් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 209,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti. Seyyathidaṃ – suvuṭṭhikā bhavissati, dubbuṭṭhikā bhavissati, subhikkhaṃ bhavissati, dubbhikkhaṃ bhavissati, khemaṃ bhavissati, bhayaṃ bhavissati, rogo bhavissati, ārogyaṃ bhavissati, muddā, gaṇanā, saṅkhānaṃ, kāveyyaṃ, lokāyataṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some venerable ascetics and brahmins, having partaken of food offered out of faith, sustain their lives by wrong livelihood through ignoble arts such as these: predicting, “There will be good rain,” or “There will be drought”; “There will be plenty,” or “There will be famine”; “There will be security,” or “There will be danger”; “There will be sickness,” or “There will be health”; and also engaging in palmistry, reckoning, computation, versification, and worldly prognostication—from such wrong livelihood, consisting of these ignoble arts, he abstains. This too is part of his morality.",
      "sinhala": "යම්සේ සමහර ගෞරවනීය ශ්‍රමණ-බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු වූ තිරශ්චීන විද්‍යා මගින්, මිථ්‍යා ආජීවයකින් ජීවිකාව කෙරෙති. එනම්: මනා වර්ෂාවක් ඇති වේ යැයිද, නියඟයක් ඇති වේ යැයිද, සශ්‍රීකත්වයක් ඇති වේ යැයිද, දුර්භික්ෂයක් ඇති වේ යැයිද, සුරක්ෂිත බවක් ඇති වේ යැයිද, භයක් ඇති වේ යැයිද, රෝගයක් ඇති වේ යැයිද, නිරෝගී බවක් ඇති වේ යැයිද, මුද්‍රා ශාස්ත්‍රය, ගණන් බැලීම, සංඛ්‍යා ශාස්ත්‍රය, කවි කීම, ලෝකායතය යන මෙබඳු වූ තිරශ්චීන විද්‍යා හා මිථ්‍යා ආජීවයෙන් වැළකී සිටී. මෙයද ඔහුගේ සීලයට අයත් වේ.",
      "paliTitle": ""
    },
    {
      "number": 210,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti. Seyyathidaṃ – āvāhanaṃ vivāhanaṃ saṃvaraṇaṃ vivaraṇaṃ saṅkiraṇaṃ vikiraṇaṃ subhagakaraṇaṃ dubbhagakaraṇaṃ viruddhagabbhakaraṇaṃ jivhānibandhanaṃ hanusaṃhananaṃ hatthābhijappanaṃ hanujappanaṃ kaṇṇajappanaṃ ādāsapañhaṃ kumārikapañhaṃ devapañhaṃ ādiccupaṭṭhānaṃ mahatupaṭṭhānaṃ abbhujjalanaṃ sirivhāyanaṃ iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some esteemed recluses and brahmins, having consumed food given out of faith, maintain their lives by means of such low arts, by wrong livelihood—that is to say: arranging marriages, dissolving marriages; sealing up, unsealing; causing loss, causing gain; making fortunate, making unfortunate; causing abortions; binding the tongue; locking the jaw; charming hands, charming jaws, charming ears; questioning a mirror, questioning a child, questioning a deity; worship of the sun, worship of the great one; invoking fire, invoking the goddess of fortune—from such low arts, from such wrong livelihood, he abstains. This too is part of his morality.",
      "sinhala": "තවද, යම්සේ ඇතැම් පින්වත් ශ්‍රමණ​බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන වළඳා, මෙබඳු තිරිසන් විද්‍යාවන්ගෙන් මිථ්‍යා ආජීවයෙන් ජීවිකාව ගෙන යත් ද; එනම්: ආවාහන (විවාහ කර දීම), විවාහන (විවාහ කර ගැනීම), සංවරණ (ආවරණය කිරීම), විවරණ (විවෘත කිරීම), සංකිරණ (භූත, ප්‍රේත ආදීන් කැඳවීම), විකිරණ (එළවා දැමීම), සුභගකරණ (වාසනාවන්ත බව ඇති කිරීම), දුර්භගකරණ (අවාසනාවන්ත බව ඇති කිරීම), විරුද්ධගබ්භකරණ (ගබ්සා කිරීම), ජිව්හානිබන්ධන (දිව බැඳීම), හනුසංහනන (හකු බැඳීම), හත්ථාභිජප්පන (අත බලා ශාස්ත්‍ර කීම), හනුජප්පන (හකු මතුරමින් ශාස්ත්‍ර කීම), කණ්ණජප්පන (කන් මතුරමින් කේලාම් කීම), ආදාසපඤ්හ (කණ්ණාඩි ප්‍රශ්න), කුමාරිකාපඤ්හ (කුමාරිකා ප්‍රශ්න), දේවපඤ්හ (දේව ප්‍රශ්න), ආදිච්චුපට්ඨාන (සූර්යයාට උපස්ථාන කිරීම), මහතුපට්ඨාන (මහා දෙවියන්ට උපස්ථාන කිරීම), අබ්භුජ්ජලන (ගිනි දැල්වීම), ශ්‍රී කැඳවීම යනාදී වශයෙනි. මෙබඳු තිරිසන් විද්‍යාවන්ගෙන් යුත් මිථ්‍යා ආජීවයෙන් ඔහු වැළකී සිටියි. මෙය ද ඔහුගේ සීලයෙහි අංගයක් වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 211,
      "pali": "‘‘Yathā vā paneke bhonto samaṇabrāhmaṇā saddhādeyyāni bhojanāni bhuñjitvā te evarūpāya tiracchānavijjāya micchājīvena jīvitaṃ kappenti. Seyyathidaṃ – santikammaṃ paṇidhikammaṃ bhūtakammaṃ bhūrikammaṃ vassakammaṃ vossakammaṃ vatthukammaṃ vatthuparikammaṃ ācamanaṃ nhāpanaṃ juhanaṃ vamanaṃ virecanaṃ uddhaṃvirecanaṃ adhovirecanaṃ sīsavirecanaṃ kaṇṇatelaṃ nettatappanaṃ natthukammaṃ añjanaṃ paccañjanaṃ sālākiyaṃ sallakattiyaṃ dārakatikicchā, mūlabhesajjānaṃ anuppadānaṃ, osadhīnaṃ paṭimokkho iti vā iti evarūpāya tiracchānavijjāya micchājīvā paṭivirato hoti. Idampissa hoti sīlasmiṃ.",
      "english": "Just as some venerable ascetics and brahmins, having eaten food given out of faith, sustain their lives by such wrong livelihood through low arts. These include: performing propitiatory rites, performing votive rites, practicing demonology, performing earth-rites, performing rain-making, performing rain-stopping, performing house-rites, performing site consecration, ritual mouth-rinsing, ritual bathing, making fire sacrifices, administering emetics, administering purgatives, administering upper purgatives, administering lower purgatives, administering head purgatives, administering ear-oil, administering eye-salves, administering nasal treatments, applying collyrium, applying counter-collyrium, performing surgery with probes, performing general surgery, treating children’s diseases, administering root medicines, and dispensing various remedies. He refrains from such wrong livelihood involving these low arts. This, too, is part of his moral conduct.",
      "sinhala": "යම්සේ ඇතැම් භවත් ශ්‍ර\\u200dමණ බ්‍රාහ්මණයෝ ශ්‍රද්ධාවෙන් දෙන ලද භෝජන අනුභව කොට, ඔවුහු මෙබඳු තිරශ්චීන විද්‍යාවකින්ද, මිථ්‍යා ආජීවයකින්ද ජීවිකාව පවත්වාගෙන යත් ද. එනම්: සාන්ති කර්ම, ප්‍ර\\u200dණිධි කර්ම, භූත කර්ම, භූරි කර්ම, වස්ස කර්ම, වොස්ස කර්ම, වස්තු කර්ම, වස්තු පරි කර්ම, ආචමන, න්හාපන, ජුහන, වමන, විරේචන, උද්ධං විරේචන, අ‍ධෝ විරේචන, සීස විරේචන, කණ්ණ තේල, නෙත්ත තප්පන, නත්ථු කර්ම, අඤ්ජන, පච්චඤ්ජන, සාලාකිය, සල්ලකත්ති, දාරක තිකිච්ඡා, මූල භේසජ්ජයන් අනුප්‍ර\\u200dදාන කිරීම, ඕසධීන් ප්‍ර\\u200dතිමෝක්ෂ කිරීම ආදී වූ මෙබඳු තිරශ්චීන විද්‍යාවෙන් හා මිථ්‍යා ආජීවයෙන් (නිවැරදි ශ්‍ර\\u200dමණයෙක්) වැළකී සිටී. මෙයද ඔහුගේ සීලයෙහි කොටසක් වේ.",
      "paliTitle": ""
    },
    {
      "number": 212,
      "pali": "‘‘Sa kho so, mahārāja, bhikkhu evaṃ sīlasampanno na kutoci bhayaṃ samanupassati, yadidaṃ sīlasaṃvarato. Seyyathāpi – mahārāja, rājā khattiyo muddhābhisitto nihatapaccāmitto na kutoci bhayaṃ samanupassati, yadidaṃ paccatthikato; evameva kho, mahārāja, bhikkhu evaṃ sīlasampanno na kutoci bhayaṃ samanupassati, yadidaṃ sīlasaṃvarato. So iminā ariyena sīlakkhandhena samannāgato ajjhattaṃ anavajjasukhaṃ paṭisaṃvedeti. Evaṃ kho, mahārāja, bhikkhu sīlasampanno hoti. Mahāsīlaṃ niṭṭhitaṃ.",
      "english": "That monk, O great king, thus endowed with virtue, sees no fear from anywhere, namely, from his moral restraint. Just as, O great king, an anointed Khattiya king, with his enemies vanquished, sees no fear from anywhere, namely, from enemies; even so, O great king, a monk thus endowed with virtue sees no fear from anywhere, namely, from his moral restraint. He, endowed with this noble aggregate of virtue, experiences blameless happiness within himself. Thus indeed, O great king, is a monk endowed with virtue. The Great Virtue is completed.",
      "sinhala": "මහරජ, මෙසේ සිල්වත් වූ ඒ භික්ෂුව සීල සංවරය හේතුවෙන් කිසි තැනකින් බියක් නොදකියි. මහරජ, යම්සේ සතුරු පිරිස පරදවා මුදුනින් අභිෂේක කරන ලද ක්ෂත්‍රීය රජෙක් සතුරන්ගෙන් කිසි තැනකින් බියක් නොදකියිද; එලෙසින්ම මහරජ, මෙසේ සිල්වත් වූ භික්ෂුව සීල සංවරය හේතුවෙන් කිසි තැනකින් බියක් නොදකියි.\n\nඒ භික්ෂුව මේ ආර්ය ශීලස්කන්ධයෙන් සමන්වාගතව අභ්‍යන්තරයෙන් නිවරුදු සැපයක් අනුභව කරයි.\n\nමහරජ, මෙසේ භික්ෂුව සීල සම්පන්න වන්නේය.\n\nමහා සීලය නිමවිය.",
      "paliTitle": ""
    },
    {
      "number": 213,
      "pali": "‘‘Kathañca, mahārāja, bhikkhu indriyesu guttadvāro hoti? Idha, mahārāja, bhikkhu cakkhunā rūpaṃ disvā na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ cakkhundriyaṃ asaṃvutaṃ viharantaṃ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati, rakkhati cakkhundriyaṃ, cakkhundriye saṃvaraṃ āpajjati. Sotena saddaṃ sutvā…pe… ghānena gandhaṃ ghāyitvā…pe… jivhāya rasaṃ sāyitvā…pe… kāyena phoṭṭhabbaṃ phusitvā…pe… manasā dhammaṃ viññāya na nimittaggāhī hoti nānubyañjanaggāhī. Yatvādhikaraṇamenaṃ manindriyaṃ asaṃvutaṃ viharantaṃ abhijjhā domanassā pāpakā akusalā dhammā anvāssaveyyuṃ, tassa saṃvarāya paṭipajjati, rakkhati manindriyaṃ, manindriye saṃvaraṃ āpajjati. So iminā ariyena indriyasaṃvarena samannāgato ajjhattaṃ abyāsekasukhaṃ paṭisaṃvedeti. Evaṃ kho, mahārāja, bhikkhu indriyesu guttadvāro hoti. Satisampajaññaṃ",
      "english": "And how, great king, does a monk become one with guarded sense doors? Here, great king, a monk, having seen a form with the eye, does not grasp at its general appearance or its detailed features. Because of which, if the eye faculty were to remain unguarded, evil unwholesome states like covetousness and distress might overwhelm him; for its restraint he endeavors, he guards the eye faculty, he undertakes the restraint of the eye faculty. Having heard a sound with the ear, he does not grasp at its general appearance or its detailed features. Having smelled an odor with the nose, he does not grasp at its general appearance or its detailed features. Having tasted a flavor with the tongue, he does not grasp at its general appearance or its detailed features. Having felt a tactile sensation with the body, he does not grasp at its general appearance or its detailed features. Having cognized a mental phenomenon with the mind, he does not grasp at its general appearance or its detailed features. Because of which, if the mind faculty were to remain unguarded, evil unwholesome states like covetousness and distress might overwhelm him; for its restraint he endeavors, he guards the mind faculty, he undertakes the restraint of the mind faculty. Endowed with this noble restraint of the sense faculties, he experiences an internal happiness free from blemish. Thus, great king, does a monk become one with guarded sense doors. Mindfulness and clear comprehension.",
      "sinhala": "මහරාජ, භික්ෂුවක් ඉන්ද්‍රියයන්ගේ දොරටු ආරක්‍ෂා කරන්නේ කෙසේද? මහරාජ, මෙහිලා භික්ෂුවක් ඇසින් රූපයක් දැක, එහි පොදු ස්වභාවය හෝ විස්තර අල්ලා ගන්නේ නැත. යම් හෙයකින් ඔහුගේ චක්ෂුරින්‍ද්‍රිය අසංවරව වාසය කරන්නේ නම්, ලෝභය, ද්වේෂය යන පාපී අකුසල ධර්මයන් ඔහු තුළට කා වැදී යනු ඇත. එබැවින් ඔහු එය සංවර කිරීම සඳහා පිළිපදියි, චක්ෂුරින්‍ද්‍රිය ආරක්‍ෂා කරයි, චක්ෂුරින්‍ද්‍රියෙහි සංවරයට පැමිණෙයි. කනින් ශබ්දයක් අසා... නාසයෙන් ගඳක් ආඝ්‍රාණය කොට... දිවෙන් රසයක් විඳ... කයින් ස්පර්ශයක් දැන... මනසින් ධර්මයක් දැනගෙන, එහි පොදු ස්වභාවය හෝ විස්තර අල්ලා ගන්නේ නැත. යම් හෙයකින් ඔහුගේ මනින්‍ද්‍රිය අසංවරව වාසය කරන්නේ නම්, ලෝභය, ද්වේෂය යන පාපී අකුසල ධර්මයන් ඔහු තුළට කා වැදී යනු ඇත. එබැවින් ඔහු එය සංවර කිරීම සඳහා පිළිපදියි, මනින්‍ද්‍රිය ආරක්‍ෂා කරයි, මනින්‍ද්‍රියෙහි සංවරයට පැමිණෙයි. ඔහු මේ ආර්ය ඉන්‍ද්‍රිය සංවරයෙන් යුක්තව, තමා තුළ අභ්‍යන්තරික නොකිලිටි සුවයක් අත්දකියි. මහරාජ, භික්ෂුවක් ඉන්ද්‍රියයන්ගේ දොරටු ආරක්‍ෂා කරන්නේ මෙලෙසය. සති සම්පජඤ්ඤය.",
      "paliTitle": "Indriyasaṃvaro",
      "englishTitle": "Sense Restraint",
      "sinhalaTitle": "ඉන්ද්ZWJරිය සංවරය"
    },
    {
      "number": 214,
      "pali": "‘‘Kathañca, mahārāja, bhikkhu satisampajaññena samannāgato hoti? Idha, mahārāja, bhikkhu abhikkante paṭikkante sampajānakārī hoti, ālokite vilokite sampajānakārī hoti, samiñjite pasārite sampajānakārī hoti, saṅghāṭipattacīvaradhāraṇe sampajānakārī hoti, asite pīte khāyite sāyite sampajānakārī hoti, uccārapassāvakamme sampajānakārī hoti, gate ṭhite nisinne sutte jāgarite bhāsite tuṇhībhāve sampajānakārī hoti. Evaṃ kho, mahārāja, bhikkhu satisampajaññena samannāgato hoti. ",
      "english": "And how, O great king, is a monk endowed with mindfulness and clear comprehension? Here, O great king, a monk acts with clear comprehension when going forward and returning; when looking ahead and looking around, he acts with clear comprehension; when bending and stretching his limbs, he acts with clear comprehension; when wearing his outer robe, inner robe, and alms-bowl, he acts with clear comprehension; when eating, drinking, chewing, and tasting, he acts with clear comprehension; when defecating and urinating, he acts with clear comprehension; when walking, standing, sitting, sleeping, waking, speaking, and remaining silent, he acts with clear comprehension. It is in this way, O great king, that a monk is endowed with mindfulness and clear comprehension.",
      "sinhala": "මහරජ, භික්ෂුව සති සම්පජඤ්ඤයෙන් යුක්ත වන්නේ කෙසේද? මහරජ, මෙහිලා භික්ෂුව, ඉදිරියට යෑමේදී ආපසු පැමිණීමේදී සිහියෙන් යුතුව කටයුතු කරයි; ඉදිරිය බැලීමේදී හැරී බැලීමේදී සිහියෙන් යුතුව කටයුතු කරයි; අත් පා හැකිළීමේදී දිග හැරීමේදී සිහියෙන් යුතුව කටයුතු කරයි; සිවුරු හා පාත‍්‍රය දැරීමේදී සිහියෙන් යුතුව කටයුතු කරයි; අනුභව කිරීමේදී, පානය කිරීමේදී, හැපීමේදී, රස විඳීමේදී සිහියෙන් යුතුව කටයුතු කරයි; මලමුත්‍ර පහකිරීමේදී සිහියෙන් යුතුව කටයුතු කරයි; යන විට, සිටින විට, හිඳින විට, නිදන විට, පිබිද සිටින විට, කතා කරන විට, නිහඬව සිටින විට සිහියෙන් යුතුව කටයුතු කරයි. මහරජ, භික්ෂුව සති සම්පජඤ්ඤයෙන් යුක්ත වන්නේ මෙසේය.",
      "paliTitle": ""
    },
    {
      "number": 215,
      "pali": "‘‘Kathañca, mahārāja, bhikkhu santuṭṭho hoti? Idha, mahārāja, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena, kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. Seyyathāpi, mahārāja, pakkhī sakuṇo yena yeneva ḍeti, sapattabhārova ḍeti. Evameva kho, mahārāja, bhikkhu santuṭṭho hoti kāyaparihārikena cīvarena kucchiparihārikena piṇḍapātena. So yena yeneva pakkamati, samādāyeva pakkamati. Evaṃ kho, mahārāja, bhikkhu santuṭṭho hoti. ",
      "english": "How, great king, is a monk content? Here, great king, a monk is content with robes merely sufficient to protect his body, and alms food merely sufficient to sustain his stomach. Wherever he goes, he goes taking only these with him. Just as, great king, a bird, wherever it flies, flies with only its wings as its burden. In the same way, great king, a monk is content with robes merely sufficient to protect his body, and alms food merely sufficient to sustain his stomach. Wherever he goes, he goes taking only these with him. This is how, great king, a monk is content.",
      "sinhala": "මහා රජතුමනි, භික්ෂුවක් සතුටින් යුක්ත වන්නේ කෙසේද? මහා රජතුමනි, මෙහිලා භික්ෂුවක් ශරීරය පවත්වාගෙන යාමට ප්‍රමාණවත් සිවුරකින් ද, කුස පිරවීමට ප්‍රමාණවත් පිණ්ඩපාතයෙන් ද සතුටින් යුක්ත වෙයි. ඔහු යම් යම් තැනකට යන්නේ ද, (තමන්ගේ පරිභෝග වස්තු) රැගෙනම යන්නේය. මහා රජතුමනි, යම් සේ පක්ෂි සකුණෙක් යම් යම් තැනකට පියාසර කරන්නේ ද, තමන්ගේ පියාපත් බරින්ම පියාසර කරන්නේය. එපරිද්දෙන්ම, මහා රජතුමනි, භික්ෂුවක් ශරීරය පවත්වාගෙන යාමට ප්‍රමාණවත් සිවුරකින් ද, කුස පිරවීමට ප්‍රමාණවත් පිණ්ඩපාතයෙන් ද සතුටින් යුක්ත වෙයි. ඔහු යම් යම් තැනකට යන්නේ ද, (තමන්ගේ පරිභෝග වස්තු) රැගෙනම යන්නේය. මෙසේ මහා රජතුමනි, භික්ෂුවක් සතුටින් යුක්ත වෙයි.",
      "paliTitle": "Santoso",
      "englishTitle": "Contentment",
      "sinhalaTitle": "සන‍්තෝසය"
    },
    {
      "number": 216,
      "pali": "‘‘So iminā ca ariyena sīlakkhandhena samannāgato, iminā ca ariyena indriyasaṃvarena samannāgato, iminā ca ariyena satisampajaññena samannāgato, imāya ca ariyāya santuṭṭhiyā samannāgato, vivittaṃ senāsanaṃ bhajati araññaṃ rukkhamūlaṃ pabbataṃ kandaraṃ giriguhaṃ susānaṃ vanapatthaṃ abbhokāsaṃ palālapuñjaṃ. So pacchābhattaṃ piṇḍapātappaṭikkanto nisīdati pallaṅkaṃ ābhujitvā ujuṃ kāyaṃ paṇidhāya parimukhaṃ satiṃ upaṭṭhapetvā.",
      "english": "Endowed with this noble aggregate of virtue, endowed with this noble restraint of the senses, endowed with this noble mindfulness and clear comprehension, and endowed with this noble contentment, he resorts to a secluded lodging: a forest, the foot of a tree, a mountain, a ravine, a mountain cave, a charnel ground, a jungle thicket, the open air, or a heap of straw.\n\nAfter his meal, having returned from his alms round, he sits down, folding his legs crosswise, straightening his body, and establishing mindfulness in front of him.",
      "sinhala": "ඔහු මේ ආර්‍ය ශීලස්කන්ධයෙන් සමන්විත වී, මේ ආර්‍ය ඉන්ද්‍රිය සංවරයෙන් සමන්විත වී, මේ ආර්‍ය සති සම්පජන්‍යයෙන් සමන්විත වී, මේ ආර්‍ය සන්තුෂ්ටියෙන් සමන්විත වී, විවික්ත සේනාසන වන අරණ්‍ය, රුක්මුල, පර්වත, කන්දර, ගිරිගුහා, සුසාන, වනාන්තර, එළිමහන් තැන්, පිදුරුගොඩ ආදිය සේවනය කරයි.\n\nඔහු දහවල් භෝජනයෙන් පසු පිණ්ඩපාතයෙන් ආපසු පැමිණ, පර්‍යංකයක් බැඳගෙන, කය ඍජු කොට, ඉදිරියෙහි සතිය පිහිටුවා හිඳගනී.",
      "paliTitle": "Nīvaraṇappahānaṃ",
      "englishTitle": "Abandoning the Hindrances",
      "sinhalaTitle": "නීවරණ ප්‍රහාණය"
    },
    {
      "number": 217,
      "pali": "‘‘So abhijjhaṃ loke pahāya vigatābhijjhena cetasā viharati, abhijjhāya cittaṃ parisodheti. Byāpādapadosaṃ pahāya abyāpannacitto viharati sabbapāṇabhūtahitānukampī, byāpādapadosā cittaṃ parisodheti. Thinamiddhaṃ pahāya vigatathinamiddho viharati ālokasaññī, sato sampajāno, thinamiddhā cittaṃ parisodheti. Uddhaccakukkuccaṃ pahāya anuddhato viharati, ajjhattaṃ vūpasantacitto, uddhaccakukkuccā cittaṃ parisodheti. Vicikicchaṃ pahāya tiṇṇavicikiccho viharati, akathaṃkathī kusalesu dhammesu, vicikicchāya cittaṃ parisodheti.",
      "english": "He, having abandoned covetousness in the world, dwells with a mind free from covetousness; he purifies his mind from covetousness. Having abandoned ill-will and hatred, he dwells with a mind free from ill-will, compassionate for the welfare of all living beings; he purifies his mind from ill-will and hatred. Having abandoned sloth and torpor, he dwells free from sloth and torpor, perceiving light, mindful and clearly comprehending; he purifies his mind from sloth and torpor. Having abandoned restlessness and remorse, he dwells unagitated, with his mind internally peaceful; he purifies his mind from restlessness and remorse. Having abandoned doubt, he dwells having overcome doubt, without perplexity regarding wholesome phenomena; he purifies his mind from doubt.",
      "sinhala": "ඔහු ලෝකයෙහි අභිජ්ඣාව අත්හැර, අභිජ්ඣාවෙන් තොර වූ සිතින් වාසය කරයි. අභිජ්ඣාවෙන් සිත පිරිසිදු කරයි. ඔහු ව්‍ය​ාපාද ප්‍ර​දෝෂය අත්හැර, ව්‍ය​ාපාදයෙන් තොර වූ සිතින්, සියලු සත්වයන්ට හිතානුකම්පීව වාසය කරයි. ව්‍ය​ාපාද ප්‍ර​දෝෂයෙන් සිත පිරිසිදු කරයි. ඔහු ථීනමිද්ධය අත්හැර, ථීනමිද්ධයෙන් තොරව, ආලෝක සංඥාව ඇතිව, සිහියෙන් හා මනා නුවණින් යුතුව වාසය කරයි. ථීනමිද්ධයෙන් සිත පිරිසිදු කරයි. ඔහු උද්ධච්ච කුක්කුච්චය අත්හැර, නොසන්සුන් නොවී, අධ්‍යාත්මයෙහි සංසිඳුණු සිතින් වාසය කරයි. උද්ධච්ච කුක්කුච්චයෙන් සිත පිරිසිදු කරයි. ඔහු විචිකිච්ඡාව අත්හැර, විචිකිච්ඡාවෙන් එතෙර වූ අයෙක්ව, කුසල ධර්ම​යන්හි සැක රහිතව වාසය කරයි. විචිකිච්ඡාවෙන් සිත පිරිසිදු කරයි.",
      "paliTitle": ""
    },
    {
      "number": 218,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso iṇaṃ ādāya kammante payojeyya. Tassa te kammantā samijjheyyuṃ. So yāni ca porāṇāni iṇamūlāni, tāni ca byantiṃ kareyya [byantīkareyya (sī. syā. kaṃ.)], siyā cassa uttariṃ avasiṭṭhaṃ dārabharaṇāya. Tassa evamassa – ‘ahaṃ kho pubbe iṇaṃ ādāya kammante payojesiṃ. Tassa me te kammantā samijjhiṃsu. Sohaṃ yāni ca porāṇāni iṇamūlāni, tāni ca byantiṃ akāsiṃ, atthi ca me uttariṃ avasiṭṭhaṃ dārabharaṇāyā’ti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, great king, a person might take a loan and invest it in a business. If those ventures of his succeed, he would pay off all his original debts, and there would be a remainder for him for the support of his family. He would then think to himself, ‘I formerly took a loan and invested it in a business. Those ventures of mine succeeded, and I paid off all my original debts; now there is a remainder for me for the support of my family.’ Because of this, he would experience delight and attain happiness.",
      "sinhala": "මහ රජතුමනි, යම් සේ පුරුෂයෙක් ණයක් ගෙන ව්‍යාපාරයක යෙදෙයි. ඔහුගේ ඒ ව්‍යාපාර දියුණු වන්නේය. ඔහු යම් පැරණි ණය මුල් ඇත්තේ ද, ඒ ණය මුල් නැති කරන්නේ ය. තවද, ඔහුට දූ දරුවන් පෝෂණය කිරීම සඳහා අතිරික්තයක් ඉතිරි වන්නේය. ඔහුට මෙසේ සිතෙන්නේය – ‘මම පෙර ණයක් ගෙන ව්‍යාපාරයක යෙදුනෙමි. මගේ ඒ ව්‍යාපාර දියුණු විය. මම යම් පැරණි ණය මුල් ඇත්තේ ද, ඒ ණය මුල් නැති කළෙමි. තවද, මට දූ දරුවන් පෝෂණය කිරීම සඳහා අතිරික්තයක් ඉතිරි වී ඇත’ යනුයි. ඔහු ඒ නිසා ප‍්‍රමෝදය ලබන්නේය, සෝමනස්සය (සතුට) අත්පත් කරගන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 219,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso ābādhiko assa dukkhito bāḷhagilāno; bhattañcassa nacchādeyya, na cassa kāye balamattā. So aparena samayena tamhā ābādhā mucceyya; bhattaṃ cassa chādeyya, siyā cassa kāye balamattā. Tassa evamassa – ‘ahaṃ kho pubbe ābādhiko ahosiṃ dukkhito bāḷhagilāno; bhattañca me nacchādesi, na ca me āsi [na cassa me (ka.)] kāye balamattā. Somhi etarahi tamhā ābādhā mutto; bhattañca me chādeti, atthi ca me kāye balamattā’ti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, great king, a person might be afflicted, suffering, extremely ill; and food would not appeal to him, nor would there be any strength in his body. Then, after some time, he might be freed from that affliction; and food would appeal to him, and there would be some strength in his body. He would then think, 'Indeed, formerly I was afflicted, suffering, extremely ill; and food did not appeal to me, nor was there any strength in my body. But now I am freed from that affliction; and food appeals to me, and there is strength in my body.' Because of this, he would experience joy and attain gladness.",
      "sinhala": "මහරජතුමනි, යම් සේ පුරුෂයෙක් ආබාධිතව, දුක් විඳිමින්, දැඩි ලෙස ගිලන්ව සිටියේ නම්; ඔහුට භෝජනය අරුචි වේ, ඔහුගේ කයෙහි බලයක්ද නැත. හෙතෙම පසුකලෙක ඒ ආබාධයෙන් මිදෙන්නේ ය; ඔහුට භෝජනය රුචි වේ, ඔහුගේ කයෙහි බලයද ඇති වේ. ඔහුට මෙසේ සිතෙන්නේ ය – ‘මම පෙර ආබාධිතව, දුක් විඳිමින්, දැඩි ලෙස ගිලන්ව සිටියෙමි; මට භෝජනය අරුචි විය, මගේ කයෙහි බලයක්ද නොවීය. එහෙත් දැන් මම ඒ ආබාධයෙන් මිදුනෙමි; මට භෝජනය රුචි වේ, මගේ කයෙහි බලයද ඇත.’ හෙතෙම ඒ හේතුවෙන් ප්‍ර​මෝදය ලබන්නේ ය, සෝමනස්සයට පැමිණෙන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 220,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso bandhanāgāre baddho assa. So aparena samayena tamhā bandhanāgārā mucceyya sotthinā abbhayena [ubbayena (sī. ka.)], na cassa kiñci bhogānaṃ vayo. Tassa evamassa – ‘ahaṃ kho pubbe bandhanāgāre baddho ahosiṃ, somhi etarahi tamhā bandhanāgārā mutto sotthinā abbhayena. Natthi ca me kiñci bhogānaṃ vayo’ti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, great king, a man might be imprisoned in a jail. He, after some time, might be freed from that jail safely and without danger, and without any loss of his possessions. He would think thus: ‘Indeed, I was formerly imprisoned in a jail, but now I am freed from that jail safely and without danger, and there is no loss of any of my possessions.’ On account of that, he would experience joy; he would attain happiness.",
      "sinhala": "මහරජතුමනි, යම් සේ පුරුෂයෙක් බන්ධනාගාරයක (හිරගෙයක) බැඳ තබනු ලැබ සිටින්නේ ද, හෙතෙම පසුව යම් කලෙක ඒ බන්ධනාගාරයෙන් සුරක්ෂිතව, බියක් නැතිව මුදනු ලැබ, ඔහුගේ කිසිදු භෝගයක් (සම්පතක්) හානියට පත් නොවන්නේ ද, ඔහුට මෙසේ සිතෙන්නේ ය: ‘මම පෙර බන්ධනාගාරයක බැඳ තබා තිබුණෙමි. එහෙත් දැන් මම ඒ බන්ධනාගාරයෙන් සුරක්ෂිතව, බියක් නැතිව නිදහස් වී සිටිමි. මාගේ කිසිදු භෝගයක් (සම්පතක්) හානියට පත් වී ද නැත’ කියා. හෙතෙම ඒ හේතුවෙන් ප්‍රමෝදය ලබන්නේ ය, සෝමනස්සයට පැමිණෙන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 221,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso dāso assa anattādhīno parādhīno na yenakāmaṃgamo. So aparena samayena tamhā dāsabyā mucceyya attādhīno aparādhīno bhujisso yenakāmaṃgamo. Tassa evamassa – ‘ahaṃ kho pubbe dāso ahosiṃ anattādhīno parādhīno na yenakāmaṃgamo. Somhi etarahi tamhā dāsabyā mutto attādhīno aparādhīno bhujisso yenakāmaṃgamo’ti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, great king, a man might be a slave, not his own master, dependent on others, not free to go where he pleases. Later, at some other time, he would be freed from that slavery, becoming his own master, not dependent on others, a freeman, free to go where he pleases. He would reflect thus: 'Indeed, I was formerly a slave, not my own master, dependent on others, not free to go where I pleased. But now I am freed from that slavery; I am my own master, not dependent on others, a freeman, free to go where I please.' Because of that, he would experience joy; he would attain happiness.",
      "sinhala": "යම්සේ මහරජ, යම් පුරුෂයෙක් දාසයෙක් වී, ස්වාධීන නො වී, පරාධීන වී, කැමති තැනකට යාමට නොහැකිව සිටී ද, හේ පසුව යම් කලෙක ඒ දාසභාවයෙන් නිදහස් වී, ස්වාධීන වී, අනුන්ට අධීන නො වී, නිදහස් වී, කැමති තැනකට යා හැකි වේ ද, ඔහුට මෙසේ සිතෙන්නේ ය: ‘මම පෙර ස්වාධීන නො වූ, පරාධීන වූ, කැමති තැනකට යාමට නොහැකි වූ දාසයෙක් වීමි. මම දැන් ඒ දාසභාවයෙන් නිදහස් වූ, ස්වාධීන වූ, පරාධීන නො වූ, නිදහස් වූ, කැමති තැනකට යා හැකි කෙනෙක් වෙමි’. හේ එය හේතු කොටගෙන ප්‍ර‌මෝදය ලබන්නේ ය, සෝමනස්සය අධිගමනය කරන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 222,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso sadhano sabhogo kantāraddhānamaggaṃ paṭipajjeyya dubbhikkhaṃ sappaṭibhayaṃ. So aparena samayena taṃ kantāraṃ nitthareyya sotthinā, gāmantaṃ anupāpuṇeyya khemaṃ appaṭibhayaṃ. Tassa evamassa – ‘ahaṃ kho pubbe sadhano sabhogo kantāraddhānamaggaṃ paṭipajjiṃ dubbhikkhaṃ sappaṭibhayaṃ. Somhi etarahi taṃ kantāraṃ nitthiṇṇo sotthinā, gāmantaṃ anuppatto khemaṃ appaṭibhaya’nti. So tatonidānaṃ labhetha pāmojjaṃ, adhigaccheyya somanassaṃ.",
      "english": "Just as, O great king, a wealthy and affluent person might undertake a wilderness road that is famine-stricken and perilous. He, after some time, would cross that wilderness safely and reach a village, safe and free from danger. To him it would occur thus: ‘Indeed, formerly I, being wealthy and affluent, undertook a wilderness road that was famine-stricken and perilous. But now I have crossed that wilderness safely and have reached a village, safe and free from danger.’ He, on account of that, would gain delight and experience happiness.",
      "sinhala": "මහා රජතුමනි, යම් සේ ධන සම්පත් ඇති, භාග්‍යවන්ත පුරුෂයෙක් දුර්භික්‍ෂයෙන් හා භයානකත්වයෙන් යුත් මහා කාන්තාර මාර්ගයකට පිවිසෙන්නේද; ඔහු පසුව ඒ කාන්තාරය නිරුපද්‍රිතව තරණය කොට, භය රහිත වූ, ආරක්‍ෂිත වූ ගම් දනව්වකට පැමිණෙන්නේය. ඔහුට මෙසේ සිතෙන්නේය – ‘මා නම් පෙර ධන සම්පත් ඇතිව, දුර්භික්‍ෂයෙන් හා භයානකත්වයෙන් යුත් මහා කාන්තාර මාර්ගයක ගමන් කළෙමි. මම දැන් ඒ කාන්තාරය සුරක්‍ෂිතව තරණය කොට, භය රහිත වූ, ආරක්‍ෂිත වූ ගම් දනව්වකට පැමිණ ඇත්තෙමි’ කියා. ඔහු එය හේතු කොටගෙන ප්‍රමෝදය ලබන්නේය, සෝමනස්සයට පැමිණෙන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 223,
      "pali": "‘‘Evameva kho, mahārāja, bhikkhu yathā iṇaṃ yathā rogaṃ yathā bandhanāgāraṃ yathā dāsabyaṃ yathā kantāraddhānamaggaṃ, evaṃ ime pañca nīvaraṇe appahīne attani samanupassati.",
      "english": "Just so, great king, a monk discerns within himself these five hindrances, when they are unabandoned, as a debt, as a sickness, as a prison, as slavery, as a journey through a wilderness.",
      "sinhala": "මහරජ, ඒ අයුරින්ම භික්ෂුවක්, ණයක් මෙන්ද, රෝගයක් මෙන්ද, බන්ධනාගාරයක් මෙන්ද, දාස භාවයක් මෙන්ද, කාන්තාර මාර්ගයක් මෙන්ද, මෙලෙස තමා තුළ අත්නොහල පංච නීවරණ ධර්මයන් දකී.",
      "paliTitle": ""
    },
    {
      "number": 224,
      "pali": "‘‘Seyyathāpi, mahārāja, yathā āṇaṇyaṃ yathā ārogyaṃ yathā bandhanāmokkhaṃ yathā bhujissaṃ yathā khemantabhūmiṃ; evameva kho, mahārāja, bhikkhu ime pañca nīvaraṇe pahīne attani samanupassati.",
      "english": "Just as, O great king, one might experience freedom from debt, freedom from illness, freedom from imprisonment, freedom from servitude, and a secure haven; just so, O great king, a monk perceives these five hindrances as abandoned within himself.",
      "sinhala": "යම්සේ මහරජ, ණය නැති බවක්, නිරෝගී බවක්, බන්ධනාගාරයෙන් නිදහස් වීමක්, දාසභාවයෙන් මිදීමක්, ආරක්ෂිත භූමියකට පැමිණීමක් වේද; එලෙසම මහරජ, මහණ තෙමේ මේ පංච නීවරණ ප්‍රහීණ වූ බව තමා තුළ නුවණින් දකියි.",
      "paliTitle": ""
    },
    {
      "number": 225,
      "pali": "‘‘Tassime pañca nīvaraṇe pahīne attani samanupassato pāmojjaṃ jāyati, pamuditassa pīti jāyati, pītimanassa kāyo passambhati, passaddhakāyo sukhaṃ vedeti, sukhino cittaṃ samādhiyati. ",
      "english": "For one who sees these five hindrances abandoned within themselves, gladness arises. For one who is gladdened, rapture arises. For one whose mind is rapturous, the body becomes tranquil. One whose body is tranquil experiences pleasure. For one who is pleased, the mind becomes concentrated.",
      "sinhala": "තමා තුළ මේ පස් නිවරණ පහව ගිය බව දකින කල්හි ප්‍රමෝදය ඇති වේ. ප්‍රමුදිත වූ තැනැත්තාට ප්‍රීතිය ඇති වේ. ප්‍රීතිමත් වූ තැනැත්තාගේ කය සන්හිඳේ. සන්හිඳුනු කය ඇති තැනැත්තා සුවය විඳී. සුවපත් වූ තැනැත්තාගේ සිත සමාධිගත වේ.",
      "paliTitle": ""
    },
    {
      "number": 226,
      "pali": "‘‘So vivicceva kāmehi, vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hoti.",
      "english": "He, quite withdrawn from sensual pleasures, withdrawn from unwholesome states, enters and remains in the first absorption, which is accompanied by directed thought and sustained thought, and is born of seclusion, with rapture and pleasure. He drenches, saturates, permeates, and suffuses this very body with the rapture and pleasure born of seclusion, so that there is no part of his entire body that is not pervaded by the rapture and pleasure born of seclusion.",
      "sinhala": "ඔහු කාමයන්ගෙන් වෙන්වම, අකුසල ධර්‍මයන්ගෙන් වෙන්ව, විතර්ක සහිත වූ ද, විචාර සහිත වූ ද, විවේකයෙන් හටගත් ප්‍රීති-සුඛය ඇති පළමු ධ්‍යානයට පැමිණ වාසය කරයි. ඔහු මේ කයම, විවේකයෙන් හටගත් ඒ ප්‍රීති-සුඛයෙන්, සිසිල් කරයි, වසාගනී, සම්පූර්ණ කරයි, මුළු සිරුරම වෙළා පතුරුවයි. ඔහුගේ මුළු සිරුරේම, විවේකයෙන් හටගත් ඒ ප්‍රීති-සුඛයෙන් ස්පර්ශ නොවූ කිසිදු කොටසක් නොමැත.",
      "paliTitle": "Paṭhamajjhānaṃ",
      "englishTitle": "The First Jhāna",
      "sinhalaTitle": "පළමු ධ්‍යානය"
    },
    {
      "number": 227,
      "pali": "‘‘Seyyathāpi, mahārāja, dakkho nhāpako vā nhāpakantevāsī vā kaṃsathāle nhānīyacuṇṇāni ākiritvā udakena paripphosakaṃ paripphosakaṃ sanneyya, sāyaṃ nhānīyapiṇḍi snehānugatā snehaparetā santarabāhirā phuṭā snehena, na ca paggharaṇī; evameva kho, mahārāja, bhikkhu imameva kāyaṃ vivekajena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa vivekajena pītisukhena apphuṭaṃ hoti. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, great king, a skilled bath attendant or their apprentice, having poured bath powder into a brass plate, would moisten it thoroughly with water, sprinkling it bit by bit, so that the bath ball becomes saturated and permeated with moisture, completely pervaded with moisture inside and out, yet does not ooze; in the same way, great king, a monk pervades this very body with the rapture and happiness born of seclusion. He drenches, suffuses, fills, and permeates it, so that there is no part of his entire body that is not pervaded by this rapture and happiness born of seclusion. And this, great king, is a visible fruit of recluseship that is superior and more sublime than the previous visible fruits of recluseship.",
      "sinhala": "මහ­රාජ, යම් සේ දක්ෂ ස්නාන ශිල්පියෙක් හෝ ස්නාන ශිල්පී ආධුනිකයෙක් හෝ ලෝක­ඩ තැටිය­කට ස්නාන චූර්ණ දමා, ජල­යෙන් ටිකෙන් ටික ඉසි­මින් පදම් කරයි ද, ඒ ස්නාන පිඩ ඇතුළතින් ද පිටතින් ද තෙලින් යුක්තව, තෙලින් වෙලී, තෙලින් පිරි­වී පවතී ද, එහෙත් එයින් තෙල් කාන්දු නොවේ ද; එපරිදි­ම, මහ­රාජ, භික්ෂුව මේ කයම වි­වේ­ක­යෙන් හට­ගත් ප්‍රීති­ය­ෙන් හා සුව­යෙන් තෙමා, පෙරා, පුරා, පතුරුවා හරියි. මේ සමස්ත කයෙහි කිසිවක් වි­වේ­ක­යෙන් හට­ගත් ප්‍රීති­ය­ෙන් හා සුව­යෙන් නොපිරී පවතින්නේ නැත. මහ­රාජ, මේ දෘෂ්ට­ධර්මික සාමණ්‍ය ඵලය­ද, පෙර සඳහන් කළ දෘෂ්ට­ධර්මික සාමණ්‍ය ඵල­ව­ලට වඩා උත්කෘෂ්ට­තරය, ප්‍රණීත­තරය.",
      "paliTitle": ""
    },
    {
      "number": 228,
      "pali": "‘‘Puna caparaṃ, mahārāja, bhikkhu vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṃ hoti.",
      "english": "Furthermore, O great king, a monk, with the calming of initial and sustained application, internal clarity, and the unification of mind, enters and abides in the second meditative absorption, which is without initial application and sustained application, born of concentration, with rapture and happiness. He drenches, saturates, fills, and permeates this very body with the rapture and happiness born of concentration; there is no part of his entire body that is not pervaded by this rapture and happiness born of concentration.",
      "sinhala": "තවද, මහා රජතුමනි, භික්ෂුවක් විතර්ක සහ විචාර සංසිඳවීමෙන්, අභ්‍යන්තර පැහැදීමෙන්ද, සිතේ ඒකාග්‍රතාවයෙන්ද යුක්තව, විතර්ක සහ විචාර රහිත වූ, සමාධියෙන් හටගත් ප්‍රීතිය හා සැපය ඇති, දෙවන ධ්‍යානය උපදවා වාසය කරයි.\n\nඔහු සමාධියෙන් හටගත් ඒ ප්‍රීතියෙන් හා සැපයෙන් මේ කය හොඳින් තෙත් කරයි, පුරවයි, පතුරුවයි. ඔහුගේ මුළු කයෙහිම සමාධියෙන් හටගත් ඒ ප්‍රීතියෙන් හා සැපයෙන් ස්පර්ශ නොවූ කිසිදු කොටසක් නොමැත.",
      "paliTitle": "Dutiyajjhānaṃ",
      "englishTitle": "Second Jhāna",
      "sinhalaTitle": "දෙවන ඣානය"
    },
    {
      "number": 229,
      "pali": "‘‘Seyyathāpi, mahārāja, udakarahado gambhīro ubbhidodako [ubbhitodako (syā. kaṃ. ka.)] tassa nevassa puratthimāya disāya udakassa āyamukhaṃ, na dakkhiṇāya disāya udakassa āyamukhaṃ, na pacchimāya disāya udakassa āyamukhaṃ, na uttarāya disāya udakassa āyamukhaṃ, devo ca na kālenakālaṃ sammādhāraṃ anuppaveccheyya. Atha kho tamhāva udakarahadā sītā vāridhārā ubbhijjitvā tameva udakarahadaṃ sītena vārinā abhisandeyya parisandeyya paripūreyya paripphareyya, nāssa kiñci sabbāvato udakarahadassa sītena vārinā apphuṭaṃ assa. Evameva kho, mahārāja, bhikkhu imameva kāyaṃ samādhijena pītisukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa samādhijena pītisukhena apphuṭaṃ hoti. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, O great king, a deep lake with water springing up from within might have no inlet for water from the eastern direction, nor from the southern, nor from the western, nor from the northern, and the sky might not supply proper rain from time to time. Yet, from that very lake, cold streams of water well up and saturate, suffuse, fill, and pervade that very lake with cold water, so that no part of its entire extent is unpervaded by cold water. In the same way, O great king, a monk saturates, suffuses, fills, and pervades this very body with joy and happiness born of concentration, so that no part of his entire body is unpervaded by joy and happiness born of concentration. This too, O great king, is a visible fruit of recluseship, more excellent and more sublime than the previous visible fruits of recluseship.",
      "sinhala": "මහ රජ, යම් සේ ගැඹුරු, උල්පතකින් ජලය නගින ජලාශයක් වේද, ඊට නැගෙනහිර දිශාවෙන් ජලය පැමිණෙන මාර්ගයක් නැත. දකුණු දිශාවෙන් ජලය පැමිණෙන මාර්ගයක් නැත. බස්නාහිර දිශාවෙන් ජලය පැමිණෙන මාර්ගයක් නැත. උතුරු දිශාවෙන් ජලය පැමිණෙන මාර්ගයක් නැත. වැසි දෙවියන්ද කලින් කලට මනාව ධාරා වර්ෂාව නොපවත්වන්නේය. එහෙත් ඒ ජලාශයෙන්ම සිහිල් දිය දහරාවන් උතුරා නැගී, ඒ ජලාශයම සිහිල් ජලයෙන් තෙමා, පුරවා, පරිපූර්ණ කොට, මුළුමනින්ම විහිදුවන්නේය. ඒ මුළු ජලාශයෙහිම කිසිදු තැනක් සිහිල් ජලයෙන් ස්පර්ශ නොවූවක් නොවේ. එසෙවම, මහ රජ, භික්ෂුව මේ ශරීරයම සමාධියෙන් උපන් ප්‍රීති සුවයෙන් තෙමා, පුරවා, පරිපූර්ණ කොට, මුළුමනින්ම විහිදුවයි. ඒ මුළු ශරීරයෙහිම කිසිදු තැනක් සමාධියෙන් උපන් ප්‍රීති සුවයෙන් ස්පර්ශ නොවූවක් නොවේ. මහ රජ, මෙයද මේ ආත්මයෙහිම පෙනෙන ශ්‍රමණ ඵලයකි. පෙර සඳහන් කළ මේ ආත්මයෙහිම පෙනෙන ශ්‍රමණ ඵලයන්ට වඩා උසස් වූද, ප්‍රණීත වූද ඵලයකි.",
      "paliTitle": ""
    },
    {
      "number": 230,
      "pali": "‘‘Puna caparaṃ, mahārāja, bhikkhu pītiyā ca virāgā upekkhako ca viharati sato sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti, tatiyaṃ jhānaṃ upasampajja viharati. So imameva kāyaṃ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṃ hoti.",
      "english": "Furthermore, great king, a monk, with the fading away of rapture, abides equanimous, mindful, and clearly comprehending, and experiences happiness with the body, that which the noble ones declare as: 'equanimous, mindful, one who dwells happily'; he enters and abides in the third jhana. He drenches, saturates, fills, and pervades this very body with this happiness devoid of rapture. There is no part of his entire body that is not pervaded by this happiness devoid of rapture.",
      "sinhala": "තවද, මහරජ, භික්ෂුව ප්‍රීතිය කෙරෙහි විරාගී වී උපේක්ෂා සහගතව, සිහියෙන් හා මනා දැනුමෙන් යුක්තව වාසය කරයි. ශරීරයෙන් සුවය අත්විඳියි. යමක් ආර්යයෝ ‘උපේක්ෂා සහගත වූයේ, සිහියෙන් යුක්තව සුවයෙන් වාසය කරයි’ යැයි පවසත් ද, ඒ තුන්වන ධ්‍යානයට එළඹ වාසය කරයි. ඔහු මේ කයම ප්‍රීති රහිත සුවයකින් තෙමා, විහිදුවා, පතුරුවා, වෙලා ගනියි. ඔහුගේ මුළු කයෙහි ප්‍රීති රහිත වූ සුවයෙන් නොගැටුණු කිසිදු අංගයක් නොමැත.",
      "paliTitle": "Tatiyajjhānaṃ",
      "englishTitle": "The Third Jhāna",
      "sinhalaTitle": "තෙවන ඣානය"
    },
    {
      "number": 231,
      "pali": "‘‘Seyyathāpi, mahārāja, uppaliniyaṃ vā paduminiyaṃ vā puṇḍarīkiniyaṃ vā appekaccāni uppalāni vā padumāni vā puṇḍarīkāni vā udake jātāni udake saṃvaḍḍhāni udakānuggatāni antonimuggaposīni, tāni yāva caggā yāva ca mūlā sītena vārinā abhisannāni parisannāni [abhisandāni parisandāni (ka.)] paripūrāni paripphuṭāni [paripphuṭṭhāni (pī.)], nāssa kiñci sabbāvataṃ uppalānaṃ vā padumānaṃ vā puṇḍarīkānaṃ vā sītena vārinā apphuṭaṃ assa; evameva kho, mahārāja, bhikkhu imameva kāyaṃ nippītikena sukhena abhisandeti parisandeti paripūreti parippharati, nāssa kiñci sabbāvato kāyassa nippītikena sukhena apphuṭaṃ hoti. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, O great king, in a pond of blue, red, or white lotuses, some blue, red, or white lotuses, born in the water, grown in the water, not risen above the water, nourished submerged in the water, are suffused, saturated, permeated, and pervaded from tip to root with cool water; there is no part of those blue, red, or white lotuses that is not pervaded by cool water;\n\nEven so, O great king, a monk suffuses, saturates, permeates, and pervades this very body with pleasure devoid of rapture; there is no part of his entire body that is not pervaded by pleasure devoid of rapture. This too, O great king, is a visible fruit of recluseship, more excellent and more sublime than the previous visible fruits of recluseship.",
      "sinhala": "මහ රජ, යම් සේ නෙළුම් පොකුණක, ඕලු පොකුණක හෝ පුන්ඩරීක පොකුණක උපන්, දියෙහිම වැඩුණු, දියෙන් උඩට නොනැඟුණු, දියෙහි ගිලී පෝෂණය වන යම් නෙළුම්, ඕලු හෝ පුන්ඩරීක මල් වේද, ඒ මල් අග සිට මුල දක්වා සිසිල් දියෙන් වැසී, තෙමී, පිරී, පැතිරී තිබේ. සිසිල් දියෙන් නොපිරුණු කිසිදු කොටසක් ඒ නෙළුම්, ඕලු හෝ පුන්ඩරීක මල්වල නොමැත. එලෙසින්ම, මහ රජ, භික්ෂුවක් මේ ශරීරය ප්‍රීතියෙන් තොර වූ සුවයකින් වැසී, තෙමා, පුරවා, පතුරුවා හරියි. ඔහුගේ මේ මුළු ශරීරයෙහිම ප්‍රීතියෙන් තොර වූ සුවයකින් නොපිරුණු කිසිදු කොටසක් නොමැත. මහ රජ, මේ දැකිය හැකි ශ්‍රමණඵලය පෙර දැකිය හැකි ශ්‍රමණඵලයන්ට වඩා උසස්ය, ප්‍රණීතය.",
      "paliTitle": ""
    },
    {
      "number": 232,
      "pali": "‘‘Puna caparaṃ, mahārāja, bhikkhu sukhassa ca pahānā dukkhassa ca pahānā, pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati, so imameva kāyaṃ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṃ hoti.",
      "english": "Furthermore, great king, a monk, with the abandonment of pleasure and pain, and with the prior fading away of joy and sorrow, enters and abides in the fourth jhana, which is neither painful nor pleasant, and is purified by equanimity and mindfulness. He sits pervading this very body with a pure, bright mind. There is no part of his entire body that is not pervaded by that pure, bright mind.",
      "sinhala": "නැවතත් මහා රාජයෙනි, භික්ෂුවක් සැපය සහ දුක යන දෙකම ප්‍රහාණය කිරීමෙන් ද, පෙර පැවති සෝමනස්ස (ලෞකික සතුට) හා දෝමනස්ස (දොම්නස) අතුරුදහන් වීමෙන් ද, දුක්-නොවූ සැප-නොවූ, උපේක්ඛා-සති-පාරිශුද්ධියෙන් යුක්ත වූ සිවුවන ධ්‍යානයට එළඹ වාසය කරයි. හෙතෙම මේ කයම පිරිසිදු වූ, පරියෝදාත වූ සිතින් පතුරුවා වැඩ සිටියි. ඔහුගේ මුළු කයේම පිරිසිදු වූ, පරියෝදාත වූ සිතින් නොපැතිරූ කිසිවක් නැත.",
      "paliTitle": "Catutthajjhānaṃ",
      "englishTitle": "The Fourth Jhāna",
      "sinhalaTitle": "සිවුවන ධ්‍යානය"
    },
    {
      "number": 233,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso odātena vatthena sasīsaṃ pārupitvā nisinno assa, nāssa kiñci sabbāvato kāyassa odātena vatthena apphuṭaṃ assa; evameva kho, mahārāja, bhikkhu imameva kāyaṃ parisuddhena cetasā pariyodātena pharitvā nisinno hoti, nāssa kiñci sabbāvato kāyassa parisuddhena cetasā pariyodātena apphuṭaṃ hoti. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, great king, a man might be seated, having covered himself head to foot with a clean cloth, and there would be nothing of his entire body that was uncovered by that clean cloth; even so, great king, a bhikkhu sits pervading this very body with a pure, thoroughly purified mind, and there would be nothing of his entire body that was unpervaded by that pure, thoroughly purified mind. This too, great king, is a visible fruit of recluseship, more excellent and more sublime than the previous visible fruits of recluseship.",
      "sinhala": "මහා රජතුමනි, යම් සේ පුරුෂයෙක් පිරිසිදු වස්ත්‍රයකින් හිස මුදුන ද වසාගෙන හිඳී නම්, ඔහුගේ මුළු කයෙහි පිරිසිදු වස්ත්‍රයෙන් නොවැසුණු කිසිවක් නැත්තේ ද; එසෙයින්ම, මහා රජතුමනි, භික්ෂුව මේ කයම පිරිසිදු වූ, පරියෝදත්ත වූ සිතින් පතුරුවාගෙන හිඳියි. ඔහුගේ මුළු කයෙහි පිරිසිදු වූ, පරියෝදත්ත වූ සිතින් නොවැසුණු කිසිවක් නැත. මහා රජතුමනි, මේ අත්දැකිය හැකි ශ්‍රමණඵලය පෙර වූ අත්දැකිය හැකි ශ්‍රමණඵලයන්ට වඩා උසස් ද ප්‍රණීත ද වේ.",
      "paliTitle": ""
    },
    {
      "number": 234,
      "pali": "‘‘So [puna caparaṃ mahārāja bhikkhu so (ka.)] evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti. So evaṃ pajānāti – ‘ayaṃ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādana-parimaddana-bhedana-viddhaṃsana-dhammo; idañca pana me viññāṇaṃ ettha sitaṃ ettha paṭibaddha’nti.",
      "english": "With his mind thus concentrated, purified, brightly clear, unblemished, rid of defilements, pliant, workable, steady, and attained to imperturbability, he directs and inclines his mind to knowledge and vision. He understands thus: ‘This body of mine is material, composed of the four great elements, born of mother and father, nourished by solid food, and is by nature impermanent, subject to rubbing away, crumbling, breaking up, and disintegration. And this consciousness of mine is dependent on this body, bound up with this body.’",
      "sinhala": "ඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, ප‍්‍රභාමත් වූ, කෙලෙස් කැලැල් රහිත වූ, උපක්ලේශයන් දුරු වූ, මෘදු වූ, කර්‍මණ්‍ය වූ, ස්ථිර වූ, නොසෙල්වෙන ස්වභාවයට පැමිණි සිත ඥාණදර්ශනය සඳහා යොමු කරයි, නැඹුරු කරයි. ඔහු මෙසේ අවබෝධ කරයි – ‘මෙම මගේ ශරීරය රූප ස්වභාවයෙන් යුක්ත යි, සතර මහා භූතයන්ගෙන් හටගත්තකි, මවගෙන් හා පියාගෙන් හටගත්තකි, බත් හා කැඳ වැනි ආහාරයෙන් වැඩුනකි, අනිත්‍ය වූ, නිරතුරුව ම පිරියම් කළ යුතු, අතුල්ලා පිරිමැදිය යුතු, බිඳී යන, විනාශ වන ස්වභාවය ඇත්තකි; මෙම මගේ විඤ්ඤාණය නම් මෙහි ඇලී පවතින අතර මෙහිම බැඳී ඇත.’",
      "paliTitle": "Vipassanāñāṇaṃ",
      "englishTitle": "Insight Knowledge",
      "sinhalaTitle": "විපස්සනා ඥානය"
    },
    {
      "number": 235,
      "pali": "‘‘Seyyathāpi, mahārāja, maṇi veḷuriyo subho jātimā aṭṭhaṃso suparikammakato accho vippasanno anāvilo sabbākārasampanno. Tatrāssa suttaṃ āvutaṃ nīlaṃ vā pītaṃ vā lohitaṃ vā [pītakaṃ vā lohitakaṃ vā (ka.)] odātaṃ vā paṇḍusuttaṃ vā. Tamenaṃ cakkhumā puriso hatthe karitvā paccavekkheyya – ‘ayaṃ kho maṇi veḷuriyo subho jātimā aṭṭhaṃso suparikammakato accho vippasanno anāvilo sabbākārasampanno; tatridaṃ suttaṃ āvutaṃ nīlaṃ vā pītaṃ vā lohitaṃ vā odātaṃ vā paṇḍusuttaṃ vā’ti. Evameva kho, mahārāja, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti. So evaṃ pajānāti – ‘ayaṃ kho me kāyo rūpī cātumahābhūtiko mātāpettikasambhavo odanakummāsūpacayo aniccucchādanaparimaddanabhedanaviddhaṃsanadhammo; idañca pana me viññāṇaṃ ettha sitaṃ ettha paṭibaddha’nti. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, O great king, a beryl gem, beautiful, of fine water, eight-faceted, well-polished, clear, pure, untarnished, and perfect in all its aspects, and through it a thread might be strung, blue, or yellow, or red, or white, or brown. A keen-eyed man, taking it in his hand, would examine it, saying: ‘This beryl gem is indeed beautiful, of fine water, eight-faceted, well-polished, clear, pure, untarnished, and perfect in all its aspects; and this thread strung through it is blue, or yellow, or red, or white, or brown.’\n\nIn the same way, O great king, a bhikkhu, with his mind thus concentrated, purified, cleansed, unblemished, rid of defilements, supple, pliant, steady, and attained to imperturbability, directs and inclines his mind to the knowledge and vision. He understands thus: ‘This body of mine is material, composed of the four great elements, born of mother and father, sustained by rice and gruel, subject to impermanence, to rubbing, massaging, breaking up, and disintegration; and this consciousness of mine is bound up with it, dependent on it.’ This, O great king, is indeed a fruit of recluseship visible in this very life, which is more excellent and more sublime than the previous fruits of recluseship visible in this very life.",
      "sinhala": "මහ රජ, යම් සේ ප්‍රභාමත් වූ, උසස් ගණයේ, අටපට්ටම් කොට මැනවින් ඔප දමා ඇති, පැහැදිලි, ප්‍රසන්න, නිර්මල, සියලු අංගයන්ගෙන් සමන්විත වූ නිල් මැණිකක් (වෛදූර‍්‍යයක්) වේද; එහි නිල් හෝ කහ හෝ රතු හෝ සුදු හෝ ළා කහ පැහැති නූලක් අමුණා ඇත්තේය. ඇස් ඇති පුරුෂයෙක් එය අතට ගෙන මෙසේ විමසන්නේය: ‘මෙය සැබවින්ම ප්‍රභාමත්, උසස් ගණයේ, අටපට්ටම් කොට මැනවින් ඔප දමා ඇති, පැහැදිලි, ප්‍රසන්න, නිර්මල, සියලු අංගයන්ගෙන් සමන්විත වූ නිල් මැණිකකි; එහි නිල් හෝ කහ හෝ රතු හෝ සුදු හෝ ළා කහ පැහැති නූලක් අමුණා ඇත්තේය’ යනුවෙනි.\n\nඑලෙසින්ම, මහ රජ, භික්ෂුවක් මෙසේ සමාධිගත වූ, පිරිසිදු වූ, අවබෝධයට පැහැදිලි වූ, කෙලෙස් රහිත වූ, උපක්ලේශයන් පහ වූ, මුදු වූ, කර්මයට සුදුසු වූ, ස්ථාවර වූ, කම්පනයට පත් නොවන සිතින් ඤාණදර්ශනය පිණිස සිත යොමු කරයි, නැඹුරු කරයි.\n\nහේ මෙසේ අවබෝධ කර ගනියි – ‘මෙම මාගේ කය රූප ස්වභාවයෙන් යුක්තය, සතර මහා භූතයන්ගෙන් හටගත්තකි, මව සහ පියාගෙන් හටගත්තකි, බත් සහ කැඳ වැනි දේවලින් පෝෂණය වෙයි, නිරන්තරයෙන් අලේප කිරීමෙන්, සම්බාහනය කිරීමෙන්, බිඳී යාමෙන් හා විනාශ වීමෙන් විනාශ වන ස්වභාවයෙන් යුක්තය; මෙම මාගේ විඤ්ඤාණය මෙහි ඇලී, මෙහි බැඳී පවතී’ යනුවෙනි.\n\nමහ රජ, මෙයද සන්දිට්ඨික වූ ශ්‍රමණ ඵලයකි, පෙර කී සන්දිට්ඨික ශ්‍රමණ ඵලයන්ට වඩා උසස්ය, ප්‍රණීතය.",
      "paliTitle": ""
    },
    {
      "number": 236,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṃ kāyaṃ abhinimmānāya cittaṃ abhinīharati abhininnāmeti. So imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ahīnindriyaṃ.",
      "english": "Thus, with his mind concentrated, purified, cleansed, without blemish, rid of defilements, pliable, workable, steady, and attained to imperturbability, he directs and inclines his mind to create a mind-made body. From this body, he emanates another body, having form, mind-made, complete with all its limbs and minor parts, and with perfect faculties.",
      "sinhala": "ඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, පැහැපත් වූ, කිලිටි රහිත වූ, උපක්ලේශ පහ වූ, මෘදු වූ, කර්මණ්‍ය වූ, ස්ථිර වූ, අකම්ප්‍ය භාවයට පත් වූ සිතින් මනෝමය කය නිර්මාණය කිරීම සඳහා සිත යොමු කරයි, නැඹුරු කරයි. ඔහු මේ කයින්, රූපවත් වූ, මනෝමය වූ, සියලු අඟපසඟින් යුත්, අඩුපාඩු රහිත ඉන්ද්‍රියයන් සහිත වූ වෙනත් කයක් මවයි.",
      "paliTitle": "Manomayiddhiñāṇaṃ",
      "englishTitle": "Knowledge of Mind-Made Psychic Power",
      "sinhalaTitle": "මනෝමය ඉර්ධි ඥාණය"
    },
    {
      "number": 237,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso muñjamhā īsikaṃ pavāheyya [pabbāheyya (syā. ka.)]. Tassa evamassa – ‘ayaṃ muñjo, ayaṃ īsikā, añño muñjo, aññā īsikā, muñjamhā tveva īsikā pavāḷhā’ti [pabbāḷhāti (syā. ka.)]. Seyyathā vā pana, mahārāja, puriso asiṃ kosiyā pavāheyya. Tassa evamassa – ‘ayaṃ asi, ayaṃ kosi, añño asi, aññā kosi, kosiyā tveva asi pavāḷho’’ti. Seyyathā vā pana, mahārāja, puriso ahiṃ karaṇḍā uddhareyya. Tassa evamassa – ‘ayaṃ ahi, ayaṃ karaṇḍo. Añño ahi, añño karaṇḍo, karaṇḍā tveva ahi ubbhato’ti [uddharito (syā. kaṃ.)]. Evameva kho, mahārāja, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte manomayaṃ kāyaṃ abhinimmānāya cittaṃ abhinīharati abhininnāmeti. So imamhā kāyā aññaṃ kāyaṃ abhinimmināti rūpiṃ manomayaṃ sabbaṅgapaccaṅgiṃ ahīnindriyaṃ. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, O great king, a man might draw a stalk from muñja grass. It would occur to him, ‘This is the muñja, this is the stalk. The muñja is one thing, the stalk is another thing. It is from the muñja itself that the stalk has been drawn out.’ Or again, O great king, just as a man might draw a sword from its scabbard. It would occur to him, ‘This is the sword, this is the scabbard. The sword is one thing, the scabbard is another thing. It is from the scabbard itself that the sword has been drawn out.’ Or again, O great king, just as a man might take a snake out of a basket. It would occur to him, ‘This is the snake, this is the basket. The snake is one thing, the basket is another thing. It is from the basket itself that the snake has been taken out.’ Just in the same way, O great king, with his mind thus concentrated, purified, clear, without blemish, rid of defilements, pliant, workable, steady, and attained to imperturbability, a bhikkhu directs and inclines his mind to create a mind-made body. From this body, he creates another body, having form, mind-made, complete with all its limbs and parts, and with perfect faculties. This too, O great king, is a visible fruit of recluseship, more excellent and more sublime than the previous visible fruits of recluseship.",
      "sinhala": "මහරජ, යම් සේ පුරුෂයෙක් මූඤ්ජ තණ පඳුරකින් ඊසිකා තණ ගසක් ඇදගන්නේ ද, ඔහුට මෙසේ සිතෙන්නේ ය: ‘මේ මූඤ්ජ තණයි, මේ ඊසිකා තණයි. මූඤ්ජ තණ එකකි, ඊසිකා තණ අනෙකකි. එහෙත් ඊසිකා තණ ඇදගත්තේ මූඤ්ජ තණ පඳුරෙන් ම ය’ කියා. නැතහොත් මහරජ, යම් සේ පුරුෂයෙක් කඩුවක් කොපුවෙන් ඇදගන්නේ ද, ඔහුට මෙසේ සිතෙන්නේ ය: ‘මේ කඩුවයි, මේ කොපුවයි. කඩුව එකකි, කොපුව අනෙකකි. එහෙත් කඩුව ඇදගත්තේ කොපුවෙන් ම ය’ කියා. නැතහොත් මහරජ, යම් සේ පුරුෂයෙක් සර්පයෙකු කරඬුවකින් (පෙට්ටියකින්) එළියට ගන්නේ ද, ඔහුට මෙසේ සිතෙන්නේ ය: ‘මේ සර්පයායි, මේ කරඬුවයි. සර්පයා එකකි, කරඬුව අනෙකකි. එහෙත් සර්පයා එළියට ගත්තේ කරඬුවෙන් ම ය’ කියා. එලෙසින් ම මහරජ, භික්ෂුවක් මෙසේ සමාධිගත වූ, පිරිසිදු වූ, පැහැදිලි වූ, කෙලෙස් රහිත වූ, උපක්ලේශයන්ගෙන් මිදුණු, මෘදු වූ, ක්‍රියා කිරීමට සුදුසු වූ, ස්ථිර වූ, චලනය නොවන්නා වූ සිතින් මනෝමය කායයක් මවා ගැනීමට සිත යොමු කරයි, නැඹුරු කරයි. ඔහු මේ ශරීරයෙන් වෙනත් ශරීරයක් මවයි. එය රූපවත් ය, මනෝමය ය, සියලු අංගප්‍රත්‍යංගයන්ගෙන් යුක්ත ය, අංගවිකල නොවූ ඉන්ද්‍රියයන්ගෙන් සමන්විත ය. මහරජ, මෙය ද මේ ජීවිතයෙහි ම දැකිය හැකි ශ්‍රමණඵලයකි. පෙර පැවති මේ ජීවිතයෙහි ම දැකිය හැකි ශ්‍රමණඵලයන්ට වඩා උසස් වූ ද ප්‍රණීත වූ ද ශ්‍රමණඵලයකි.",
      "paliTitle": ""
    },
    {
      "number": 238,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāse. Pathaviyāpi ummujjanimujjaṃ karoti seyyathāpi udake. Udakepi abhijjamāne gacchati [abhijjamāno (sī. ka.)] seyyathāpi pathaviyā. Ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo. Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjati. Yāva brahmalokāpi kāyena vasaṃ vatteti.",
      "english": "With his mind thus concentrated, purified, bright, spotless, rid of corruptions, pliant, wieldy, firm, and attained to imperturbability, he directs and inclines his mind to the manifestation of psychic power. He experiences manifold kinds of psychic power: Being one, he becomes many; being many, he becomes one; he appears and vanishes; he goes unhindered through a wall, through a rampart, and through a mountain, just as if through space. He dives in and emerges from the earth, just as if in water. He walks on water without sinking, just as if on land. He flies through the air cross-legged, just as a winged bird. Even these moon and sun, so mighty in power and splendor, he touches and strokes with his hand. He exercises mastery with his body even as far as the Brahma-world.",
      "sinhala": "මෙසේ සමාහිත වූ, පිරිසිදු වූ, ඉතා දීප්තිමත් වූ, කෙලෙස් රහිත වූ, උපක්ලේශයන් දුරු කළ, මෘදු වූ, ක ර ්‍ ම ණ ්‍ ය වූ, ස්ථිර වූ, කම්පනයට පත් නොවන සිතින් යුක්ත වූ ඔහු, ඍද්ධි ප ්‍ ර ාතිහා ර ්‍ ය ය න් සඳහා සිත නැඹුරු කරයි, යොමු කරයි. ඔහු නොයෙක් ආකාර ඍද්ධි ප ්‍ ර ාතිහා ර ්‍ ය ය න් අනුභව කරයි – එක් අයකු වී ද බොහෝ වේ, බොහෝ වී ද එක් අයකු වේ. ප්‍රකට වීම, අතුරුදහන් වීම, බිත්තියෙන් එහා, පවුරෙන් එහා, පර්වතයෙන් එහා අහසේ මෙන් නොගැටී යයි. පොළොවේ ද ජලයේ මෙන් කිමිදීම හා මතු වීම කරයි. ජලය මත ද පොළොවේ මෙන් නොබිඳී යයි. අහසේ ද පියාසර කරන පක්ෂියකු මෙන් පලක් බැඳ ගමන් කරයි. මෙබඳු මහත් ඍද්ධි ඇති, මෙබඳු මහත් ආනුභාව ඇති මේ සඳු හා හිරු ද අතින් ස්පර්ශ කරයි, අතගායි. බ ්‍ ර හ ්‍ ම ලෝකය දක්වා ද කයෙන් වසඟයට පමුණුවයි.",
      "paliTitle": "Iddhividhañāṇaṃ",
      "englishTitle": "Knowledge of Supernormal Powers",
      "sinhalaTitle": "ඉර්ධිවිධ ඥානය"
    },
    {
      "number": 239,
      "pali": "‘‘Seyyathāpi, mahārāja, dakkho kumbhakāro vā kumbhakārantevāsī vā suparikammakatāya mattikāya yaṃ yadeva bhājanavikatiṃ ākaṅkheyya, taṃ tadeva kareyya abhinipphādeyya. Seyyathā vā pana, mahārāja, dakkho dantakāro vā dantakārantevāsī vā suparikammakatasmiṃ dantasmiṃ yaṃ yadeva dantavikatiṃ ākaṅkheyya, taṃ tadeva kareyya abhinipphādeyya. Seyyathā vā pana, mahārāja, dakkho suvaṇṇakāro vā suvaṇṇakārantevāsī vā suparikammakatasmiṃ suvaṇṇasmiṃ yaṃ yadeva suvaṇṇavikatiṃ ākaṅkheyya, taṃ tadeva kareyya abhinipphādeyya. Evameva kho, mahārāja, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte iddhividhāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ iddhividhaṃ paccanubhoti – ekopi hutvā bahudhā hoti, bahudhāpi hutvā eko hoti; āvibhāvaṃ tirobhāvaṃ tirokuṭṭaṃ tiropākāraṃ tiropabbataṃ asajjamāno gacchati seyyathāpi ākāse. Pathaviyāpi ummujjanimujjaṃ karoti seyyathāpi udake. Udakepi abhijjamāne gacchati seyyathāpi pathaviyā. Ākāsepi pallaṅkena kamati seyyathāpi pakkhī sakuṇo. Imepi candimasūriye evaṃmahiddhike evaṃmahānubhāve pāṇinā parāmasati parimajjati. Yāva brahmalokāpi kāyena vasaṃ vatteti. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, O great king, a skilled potter or a potter’s apprentice, with well-prepared clay, could make and produce whatever kind of vessel he desired. Or just as, O great king, a skilled ivory carver or an ivory carver’s apprentice, with well-prepared ivory, could make and produce whatever kind of ivory work he desired. Or just as, O great king, a skilled goldsmith or a goldsmith’s apprentice, with well-prepared gold, could make and produce whatever kind of gold ornament he desired. Just so, O great king, a bhikkhu, with his mind thus composed, purified, made bright, stainless, rid of defilements, malleable, wieldy, steady, and attained to imperturbability, directs and inclines his mind to the development of various supernormal powers. He experiences various kinds of supernormal powers: being one, he becomes many; having been many, he becomes one. He appears and vanishes; he goes unimpeded through walls, ramparts, and mountains as if through space. He dives in and out of the earth as if it were water. He walks on water without sinking as if it were dry land. He travels through the air, sitting cross-legged, like a winged bird. He touches and strokes even the moon and the sun, which are so mighty and powerful, with his hand. He exercises mastery with his body even as far as the Brahma world. This, O great king, is indeed a fruit of recluseship visible in this very life, and it is more excellent and more sublime than the previous fruits of recluseship visible in this very life.",
      "sinhala": "රජතුමනි, යම්සේ දක්ෂ කුම්භකාරයෙක් හෝ කුම්භකාර ශිෂ්‍යයෙක් හෝ මනාකොට සකස් කරන ලද මැටියෙන් යම් යම් භාජන විකාරයක් කැමති වේ නම්, එය එයම සාදන්නේය, නිපදවන්නේය. යම්සේ හෝ රජතුමනි, දක්ෂ දන්තකාරයෙක් හෝ දන්තකාර ශිෂ්‍යයෙක් හෝ මනාකොට සකස් කරන ලද ඇත් දතෙහි යම් යම් ඇත් දත් විකාරයක් කැමති වේ නම්, එය එයම සාදන්නේය, නිපදවන්නේය. යම්සේ හෝ රජතුමනි, දක්ෂ ස්වර්ණකාරයෙක් හෝ ස්වර්ණකාර ශිෂ්‍යයෙක් හෝ මනාකොට සකස් කරන ලද රත්රන්හි යම් යම් රන් විකාරයක් කැමති වේ නම්, එය එයම සාදන්නේය, නිපදවන්නේය. එපරිද්දෙන්ම රජතුමනි, භික්ෂුවක් මෙසේ සමහිත වූ සිතින්, පිරිසිදු වූ, ප‍්‍රභාස්වර වූ, කෙලෙස් නැති, උපක්ලේශ පහව ගිය, මෘදු වූ, කර්මණයට සුදුසු වූ, ස්ථාවර වූ, කම්පා නොවන භාවයට පැමිණි සිතින් ඉර්ධි විධි ප‍්‍රඥප්තිය සඳහා සිත යොමු කරයි, නමවයි. හෙතෙම බොහෝ ආකාරයේ ඉර්ධි විධි අත්දකී – එකක් වී බොහෝ වේ, බොහෝ වී එකක් වේ; ප‍්‍රකට වීම, අතුරුදහන් වීම; බිත්ති, පවුරු, පර්වත හරහා අහසෙහි මෙන් නොඇලී ගමන් කරයි. පොළොවෙහි ද දියෙහි මෙන් මතු වීම හා කිඳා බැසීම කරයි. දියෙහි ද නොබිඳී ගමන් කරයි, පොළොවෙහි මෙන්. අහසෙහි ද පක්ෂියෙක්, කුරුල්ලෙක් මෙන් පලක් බැඳ ගමන් කරයි. මෙබඳු මහත් ඉර්ධි ඇති, මෙබඳු මහත් ආනුභාව ඇති මේ සඳ හා හිරු අතින් අල්ලා පිරිමදියි. බ‍්‍රහ්මලෝකය දක්වා ද කයින් වසඟය පවත්වයි. රජතුමනි, මේ දිට්ඨධම්ම සාමඤ්ඤඵලය පෙර සඳහන් කළ දිට්ඨධම්ම සාමඤ්ඤඵලයන්ට වඩා උසස් වූත් ප‍්‍රණීත වූත් දෙයකි.",
      "paliTitle": ""
    },
    {
      "number": 240,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṃ abhinīharati abhininnāmeti. So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca.",
      "english": "With his mind thus concentrated, purified, cleansed, spotless, rid of defilements, pliant, workable, steady, and attained to imperturbability, he directs and inclines his mind to the divine ear element. With the divine ear element, which is purified and surpasses that of humans, he hears both kinds of sounds—divine and human, those that are far and those that are near.",
      "sinhala": "ඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, ඉතා පැහැදිලි වූ, කෙලෙස් රහිත වූ, උපක්ලේශයන් පහව ගිය, මෘදු වූ, කටයුත්තට සුදුසු වූ, ස්ථිර වූ, අනිඤ්ජාප්ත බවට පැමිණි සිතින් දිව්‍ය ශ්‍රවණ ධාතුව වෙත සිත නමා යොමු කරයි.\n\nඔහු එම පිරිසිදු වූ, මනුෂ්‍ය ශ්‍රවණය ඉක්මවා ගිය දිව්‍ය ශ්‍රවණ ධාතුවෙන්, දුර හෝ ළඟ හෝ ඇති, දිව්‍ය වූ ද මනුෂ්‍ය වූ ද යන දෙයාකාර ශබ්ද අසයි.",
      "paliTitle": "Dibbasotañāṇaṃ",
      "englishTitle": "Divine Ear Knowledge",
      "sinhalaTitle": "දිව්‍ය ශ්‍රෝත ඥානය"
    },
    {
      "number": 241,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso addhānamaggappaṭipanno. So suṇeyya bherisaddampi mudiṅgasaddampi [mutiṅgasaddampi (sī. pī.)] saṅkhapaṇavadindimasaddampi [saṅkhapaṇavadeṇḍimasaddampi (sī. pī.), saṅkhasaddaṃpi paṇavasaddaṃpi dendimasaddaṃpi (syā. kaṃ.)]. Tassa evamassa – ‘bherisaddo’ itipi, ‘mudiṅgasaddo’ itipi, ‘saṅkhapaṇavadindimasaddo’ itipi [saṅkhasaddo itipi paṇavasaddo itipi dendimasaddo itipi (syā. kaṃ.)]. Evameva kho, mahārāja, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte dibbāya sotadhātuyā cittaṃ abhinīharati abhininnāmeti. So dibbāya sotadhātuyā visuddhāya atikkantamānusikāya ubho sadde suṇāti dibbe ca mānuse ca ye dūre santike ca. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, O great king, a man journeying on a road might hear the sound of a drum, the sound of a tabor, and the sound of a conch, a paṇava-drum, and a dindima-drum. And he would think thus: ‘This is the sound of a drum,’ ‘this is the sound of a tabor,’ ‘this is the sound of a conch, a paṇava-drum, and a dindima-drum.’ Even so, O great king, a bhikkhu, with his mind thus concentrated, purified, cleansed, unblemished, rid of defilements, malleable, wieldy, steady, and attained to imperturbability, applies and inclines his mind to the divine ear element. With the divine ear element, purified and surpassing that of humans, he hears both kinds of sounds, divine and human, those far and those near. This too, O great king, is a visible fruit of recluseship, more excellent and more sublime than the previous visible fruits of recluseship.",
      "sinhala": "මහ රජතුමනි, යම් සේ පුරුෂයෙක් දුර ගමනක යෙදී සිටින්නේ ද, ඔහුට බෙර හඬ ද, මෘදංග හඬ ද, ශංඛ, පණව, ඩිණ්ඩිම ශබ්ද ද ඇසේ ද, ඔහුට මෙසේ සිතේ: ‘මෙය බෙර හඬ යැයි ද, මෙය මෘදංග හඬ යැයි ද, මෙය ශංඛ, පණව, ඩිණ්ඩිම ශබ්ද යැයි ද’ කියා. මහ රජතුමනි, එපරිද්දෙන්ම භික්ෂුවක් මෙසේ සමාධිගත වූ, පිරිසිදු වූ, පහන් වූ, අවසාද රහිත වූ, උපක්ලේශයන් දුරු කළ, මුදු බවට පත් වූ, කර්මණ්‍ය වූ, ස්ථිර වූ, කම්පා නොවන භාවයට පත් වූ සිතකින් දිව්‍ය ශ්‍රවණ ධාතුවට සිත යොමු කරයි, නැඹුරු කරයි. ඔහු පිරිසිදු වූ, මනුෂ්‍ය ශ්‍රවණය ඉක්මවූ දිව්‍ය ශ්‍රවණ ධාතුවෙන් දුර ඇති ද, ළඟ ඇති ද යන දිව්‍ය ශබ්ද ද, මනුෂ්‍ය ශබ්ද ද යන ශබ්ද දෙකම අසයි. මහ රජතුමනි, මෙය ද පෙර පැවති දැකිය හැකි ශ්‍රමණ ඵලයන්ට වඩා ඉතා උසස් වූ ද ඉතා ප්‍රණීත වූ ද දැකිය හැකි ශ්‍රමණ ඵලයකි.",
      "paliTitle": ""
    },
    {
      "number": 242,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṃ abhinīharati abhininnāmeti. So parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti – sarāgaṃ vā cittaṃ ‘sarāgaṃ citta’nti pajānāti, vītarāgaṃ vā cittaṃ ‘vītarāgaṃ citta’nti pajānāti, sadosaṃ vā cittaṃ ‘sadosaṃ citta’nti pajānāti, vītadosaṃ vā cittaṃ ‘vītadosaṃ citta’nti pajānāti, samohaṃ vā cittaṃ ‘samohaṃ citta’nti pajānāti, vītamohaṃ vā cittaṃ ‘vītamohaṃ citta’nti pajānāti, saṅkhittaṃ vā cittaṃ ‘saṅkhittaṃ citta’nti pajānāti, vikkhittaṃ vā cittaṃ ‘vikkhittaṃ citta’nti pajānāti, mahaggataṃ vā cittaṃ ‘mahaggataṃ citta’nti pajānāti, amahaggataṃ vā cittaṃ ‘amahaggataṃ citta’nti pajānāti, sauttaraṃ vā cittaṃ ‘sauttaraṃ citta’nti pajānāti, anuttaraṃ vā cittaṃ ‘anuttaraṃ citta’nti pajānāti, samāhitaṃ vā cittaṃ ‘samāhitaṃ citta’nti pajānāti, asamāhitaṃ vā cittaṃ ‘asamāhitaṃ citta’nti pajānāti, vimuttaṃ vā cittaṃ ‘vimuttaṃ citta’nti pajānāti, avimuttaṃ vā cittaṃ ‘avimuttaṃ citta’nti pajānāti.",
      "english": "When his mind is thus concentrated, purified, clear, spotless, rid of defilements, pliant, workable, steady, and unshakable, he directs and inclines it to the knowledge of the minds of others. He understands the minds of other beings and persons by encompassing them with his own mind: he knows a mind with lust as ‘a mind with lust’ and a mind without lust as ‘a mind without lust’; he knows a mind with aversion as ‘a mind with aversion’ and a mind without aversion as ‘a mind without aversion’; he knows a mind with delusion as ‘a mind with delusion’ and a mind without delusion as ‘a mind without delusion’; he knows a constricted mind as ‘a constricted mind’ and a scattered mind as ‘a scattered mind’; he knows an expansive mind as ‘an expansive mind’ and an unexpansive mind as ‘an unexpansive mind’; he knows a surpassable mind as ‘a surpassable mind’ and an unsurpassed mind as ‘an unsurpassed mind’; he knows a concentrated mind as ‘a concentrated mind’ and an unconcentrated mind as ‘an unconcentrated mind’; he knows a liberated mind as ‘a liberated mind’ and an unliberated mind as ‘an unliberated mind’.",
      "sinhala": "ඔහු මෙසේ සමහිත වූ, පිරිසිදු වූ, පැහැපත් වූ, කෙලෙස් කැලැල් නැති, උපක්ලේශයන් පහ වූ, මෘදු වූ, කර්මණ්‍ය වූ, ස්ථිත වූ, නොසෙල්වෙන ස්වභාවයට පැමිණි සිතින්, චේතෝපරිය ඥාණය සඳහා සිත යොමු කරයි, නැඹුරු කරයි. ඔහු අන් සත්වයන්ගේ, අන් පුද්ගලයන්ගේ සිත් තම සිතින් අවබෝධ කරගෙන දනී – රාග සහිත සිතක් නම් ‘රාග සහිත සිතක්’ යැයි දනී, රාග රහිත සිතක් නම් ‘රාග රහිත සිතක්’ යැයි දනී, ද්වේෂ සහිත සිතක් නම් ‘ද්වේෂ සහිත සිතක්’ යැයි දනී, ද්වේෂ රහිත සිතක් නම් ‘ද්වේෂ රහිත සිතක්’ යැයි දනී, මෝහ සහිත සිතක් නම් ‘මෝහ සහිත සිතක්’ යැයි දනී, මෝහ රහිත සිතක් නම් ‘මෝහ රහිත සිතක්’ යැයි දනී, හැකිළුණු සිතක් නම් ‘හැකිළුණු සිතක්’ යැයි දනී, වික්‍ෂිප්ත වූ සිතක් නම් ‘වික්‍ෂිප්ත වූ සිතක්’ යැයි දනී, මහග්ගත වූ සිතක් නම් ‘මහග්ගත වූ සිතක්’ යැයි දනී, මහග්ගත නොවූ සිතක් නම් ‘මහග්ගත නොවූ සිතක්’ යැයි දනී, උත්තරණ සහිත සිතක් නම් ‘උත්තරණ සහිත සිතක්’ යැයි දනී, අනුත්තර වූ සිතක් නම් ‘අනුත්තර වූ සිතක්’ යැයි දනී, සමහිත වූ සිතක් නම් ‘සමහිත වූ සිතක්’ යැයි දනී, අසමහිත වූ සිතක් නම් ‘අසමහිත වූ සිතක්’ යැයි දනී, විමුක්ත වූ සිතක් නම් ‘විමුක්ත වූ සිතක්’ යැයි දනී, අවිමුක්ත වූ සිතක් නම් ‘අවිමුක්ත වූ සිතක්’ යැයි දනී.",
      "paliTitle": "Cetopariyañāṇaṃ",
      "englishTitle": "Mind-penetrating Knowledge",
      "sinhalaTitle": "චේතෝපරිය ඥානය"
    },
    {
      "number": 243,
      "pali": "‘‘Seyyathāpi, mahārāja, itthī vā puriso vā daharo yuvā maṇḍanajātiko ādāse vā parisuddhe pariyodāte acche vā udakapatte sakaṃ mukhanimittaṃ paccavekkhamāno sakaṇikaṃ vā ‘sakaṇika’nti jāneyya, akaṇikaṃ vā ‘akaṇika’nti jāneyya; evameva kho, mahārāja, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte cetopariyañāṇāya cittaṃ abhinīharati abhininnāmeti. So parasattānaṃ parapuggalānaṃ cetasā ceto paricca pajānāti – sarāgaṃ vā cittaṃ ‘sarāgaṃ citta’nti pajānāti, vītarāgaṃ vā cittaṃ ‘vītarāgaṃ citta’nti pajānāti, sadosaṃ vā cittaṃ ‘sadosaṃ citta’nti pajānāti, vītadosaṃ vā cittaṃ ‘vītadosaṃ citta’nti pajānāti, samohaṃ vā cittaṃ ‘samohaṃ citta’nti pajānāti, vītamohaṃ vā cittaṃ ‘vītamohaṃ citta’nti pajānāti, saṅkhittaṃ vā cittaṃ ‘saṅkhittaṃ citta’nti pajānāti, vikkhittaṃ vā cittaṃ ‘vikkhittaṃ citta’nti pajānāti, mahaggataṃ vā cittaṃ ‘mahaggataṃ citta’nti pajānāti, amahaggataṃ vā cittaṃ ‘amahaggataṃ citta’nti pajānāti, sauttaraṃ vā cittaṃ ‘sauttaraṃ citta’nti pajānāti, anuttaraṃ vā cittaṃ ‘anuttaraṃ citta’nti pajānāti, samāhitaṃ vā cittaṃ ‘samāhitaṃ citta’nti pajānāti, asamāhitaṃ vā cittaṃ ‘asamāhitaṃ citta’nti pajānāti, vimuttaṃ vā cittaṃ ‘vimuttaṃ citta’’nti pajānāti, avimuttaṃ vā cittaṃ ‘avimuttaṃ citta’nti pajānāti. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, O great king, a woman or a man, young, youthful, fond of adornment, looking at their own facial reflection in a clean, pure, clear mirror or a bowl of clear water, would know 'it has a blemish' if it has a blemish, or 'it has no blemish' if it has no blemish; even so, O great king, a monk, with his mind thus concentrated, purified, cleansed, unblemished, rid of defilements, malleable, wieldy, steady, and attained to imperturbability, directs and inclines his mind to the knowledge of penetrating the minds of others. He, encompassing with his own mind the minds of other beings, other persons, understands: a mind with lust as 'a mind with lust'; or a mind without lust as 'a mind without lust'; a mind with aversion as 'a mind with aversion'; or a mind without aversion as 'a mind without aversion'; a mind with delusion as 'a mind with delusion'; or a mind without delusion as 'a mind without delusion'; a contracted mind as 'a contracted mind'; or a scattered mind as 'a scattered mind'; a developed mind as 'a developed mind'; or an undeveloped mind as 'an undeveloped mind'; a surpassable mind as 'a surpassable mind'; or an unsurpassable mind as 'an unsurpassable mind'; a concentrated mind as 'a concentrated mind'; or an unconcentrated mind as 'an unconcentrated mind'; a liberated mind as 'a liberated mind'; or an unliberated mind as 'an unliberated mind'. This too, O great king, is a visible fruit of recluseship, more excellent and more sublime than the previous visible fruits of recluseship.",
      "sinhala": "මහ රජතුමනි, යම් සේ තරුණ, යෞවන, අලංකාරයට කැමති ස්ත්‍රියක් හෝ පුරුෂයෙක් හෝ පිරිසිදු වූ, මැනවින් ප්‍ර​කශිත වූ කැඩපතක හෝ පිරිසිදු ජලය පිරවූ භාජනයක හෝ තම මුහුණේ ස්වභාවය නිරීක්ෂණය කරන විට, (එය) ලප කැළැල් සහිත නම්, ‘ලප කැළැල් සහිතයි’ කියා දැනගනී ද, ලප කැළැල් රහිත නම්, ‘ලප කැළැල් රහිතයි’ කියා දැනගනී ද;\n\nඑපරිද්දෙන්ම, මහ රජතුමනි, භික්ෂුවක් මෙසේ සමාධිගත වූ, පිරිසිදු වූ, මැනවින් ප්‍ර​කශිත වූ, කෙලෙස් කසල නැති, උපක්ලේශයන් පහ වූ, මෘදු බවට පත් වූ, කර්මයට සුදුසු ලෙස පිහිටි, අචල බවට පත් වූ සිතින් අන් සත්වයන්ගේ, අන් පුදගලයන්ගේ සිත් දැනගැනීමේ ඥානය සඳහා සිත යොමු කරයි, නැඹුරු කරයි. ඔහු අන් සත්වයන්ගේ, අන් පුදගලයන්ගේ සිතින් සිත අවබෝධයෙන් දැනගනී – රාග සහිත සිත 'රාග සහිත සිතැයි' දැනගනී, රාග රහිත සිත 'රාග රහිත සිතැයි' දැනගනී, ද්වේෂ සහිත සිත 'ද්වේෂ සහිත සිතැයි' දැනගනී, ද්වේෂ රහිත සිත 'ද්වේෂ රහිත සිතැයි' දැනගනී, මෝහ සහිත සිත 'මෝහ සහිත සිතැයි' දැනගනී, මෝහ රහිත සිත 'මෝහ රහිත සිතැයි' දැනගනී, හැකුළුණ සිත 'හැකුළුණ සිතැයි' දැනගනී, විසිරුණු සිත 'විසිරුණු සිතැයි' දැනගනී, මහත් වූ සිත 'මහත් වූ සිතැයි' දැනගනී, මහත් නො වූ සිත 'මහත් නො වූ සිතැයි' දැනගනී, උසස් තත්ත්වයක් සහිත සිත 'උසස් තත්ත්වයක් සහිත සිතැයි' දැනගනී, අනුත්තර වූ සිත 'අනුත්තර වූ සිතැයි' දැනගනී, සමාධිගත සිත 'සමාධිගත සිතැයි' දැනගනී, අසමාධිගත සිත 'අසමාධිගත සිතැයි' දැනගනී, (කෙලෙසුන්ගෙන්) මිදුණු සිත 'මිදුණු සිතැයි' දැනගනී, නොමිදුණු සිත 'නොමිදුණු සිතැයි' දැනගනී. මහ රජතුමනි, මෙය ද පෙර කියූ අත්දැකිය හැකි ශ්‍ර​මණ ඵලයන්ට වඩා අතිශයින් උසස් වූත්, ප්‍ර​ණීත වූත් අත්දැකිය හැකි ශ්‍ර​මණ ඵලයකි.",
      "paliTitle": ""
    },
    {
      "number": 244,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati.",
      "english": "He, with his mind thus concentrated, purified, cleansed, unblemished, rid of corruptions, pliant, workable, steady, and attained to imperturbability, directs and inclines his mind to the knowledge of recollecting past lives. He recollects his manifold past lives, that is, one birth, two births, three births, four births, five births, ten births, twenty births, thirty births, forty births, fifty births, a hundred births, a thousand births, a hundred thousand births; many aeons of cosmic contraction, many aeons of cosmic expansion, many aeons of cosmic contraction and expansion. 'There I was named thus, of such a clan, of such a complexion, feeding on such food, experiencing such pleasure and pain, with such a lifespan. Having passed away from there, I arose yonder. There I was named thus, of such a clan, of such a complexion, feeding on such food, experiencing such pleasure and pain, with such a lifespan. Having passed away from there, I arose here.' Thus, he recollects his manifold past lives in their various modes and specific details.",
      "sinhala": "ඔහු එසේ සමාධිගත වූ, පිරිසිදු වූ, පැහැදිලි වූ, කෙලෙස් රහිත වූ, උපක්ලේශයන් දුරු වූ, මෘදු වූ, කර්මණ්‍ය වූ, ස්ථිර වූ, අකම්ප්‍ය භාවයට පැමිණි සිතින්, පෙර විසූ කඳ පිළිවෙළ සිහි කිරීමේ ඥාණයට සිත යොමු කරයි, නැඹුරු කරයි.\n\nඔහු නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි. එනම්: එක් ජාතියක්, දෙජාතියක්, තෙජාතියක්, සතර ජාතියක්, පස් ජාතියක්, දස ජාතියක්, විසි ජාතියක්, තිස් ජාතියක්, සතළිස් ජාතියක්, පනස් ජාතියක්, සිය ජාතියක්, දහස් ජාතියක්, ලක්ෂ ජාතියක් සිහි කරයි. නොයෙක් සංවට්ට කල්පයන් ද, නොයෙක් විවට්ට කල්පයන් ද, නොයෙක් සංවට්ට-විවට්ට කල්පයන් ද සිහි කරයි. ‘මම අසවල් තැන සිටියෙමි. අසවල් නම් ඇත්තෙම්, අසවල් ගෝත්‍ර ඇත්තෙම්, අසවල් වර්ණ ඇත්තෙම්, අසවල් ආහාර ඇත්තෙම්, අසවල් සැප දුක් විඳින්නෙම්, අසවල් ආයුෂ ප්‍රමාණය ඇත්තෙම් වීමි. එතැනින් චුත වී අසවල් තැන උපන්නෙමි. එතැන ද අසවල් නම් ඇත්තෙම්, අසවල් ගෝත්‍ර ඇත්තෙම්, අසවල් වර්ණ ඇත්තෙම්, අසවල් ආහාර ඇත්තෙම්, අසවල් සැප දුක් විඳින්නෙම්, අසවල් ආයුෂ ප්‍රමාණය ඇත්තෙම් වීමි. එතැනින් චුත වී මෙහි උපන්නෙමි’යි මෙසේ ආකාර සහිතව ද, අරමුණු සහිතව ද නොයෙක් ආකාර වූ පෙර විසූ කඳ පිළිවෙළ සිහි කරයි.",
      "paliTitle": "Pubbenivāsānussatiñāṇaṃ",
      "englishTitle": "Knowledge of Recollection of Past Lives",
      "sinhalaTitle": "පෙර භව සිහි කිරීමේ ඥානය"
    },
    {
      "number": 245,
      "pali": "‘‘Seyyathāpi, mahārāja, puriso sakamhā gāmā aññaṃ gāmaṃ gaccheyya, tamhāpi gāmā aññaṃ gāmaṃ gaccheyya. So tamhā gāmā sakaṃyeva gāmaṃ paccāgaccheyya. Tassa evamassa – ‘ahaṃ kho sakamhā gāmā amuṃ gāmaṃ agacchiṃ [agañchiṃ (syā. kaṃ.)], tatrāpi evaṃ aṭṭhāsiṃ, evaṃ nisīdiṃ, evaṃ abhāsiṃ, evaṃ tuṇhī ahosiṃ, tamhāpi gāmā amuṃ gāmaṃ agacchiṃ, tatrāpi evaṃ aṭṭhāsiṃ, evaṃ nisīdiṃ, evaṃ abhāsiṃ, evaṃ tuṇhī ahosiṃ, somhi tamhā gāmā sakaṃyeva gāmaṃ paccāgato’ti. Evameva kho, mahārāja, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte pubbenivāsānussatiñāṇāya cittaṃ abhinīharati abhininnāmeti. So anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe, ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto amutra udapādiṃ; tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto, so tato cuto idhūpapanno’ti, iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, O great king, a man might go from his own village to another village, and from that village to yet another village. Then, from that village, he might return to his own village. He would then think, 'Indeed, I went from my own village to that village, and there I stood thus, sat thus, spoke thus, remained silent thus. And from that village, I went to that other village, and there too I stood thus, sat thus, spoke thus, remained silent thus. Now I have returned from that village to my own village.' In the same way, O great king, a bhikkhu, with his mind thus composed, purified, made bright, stainless, rid of defilements, supple, workable, steady, and attained to imperturbability, directs and inclines his mind to the knowledge of recollecting past lives. He recollects his manifold past lives, that is, one birth, two births, three, four, five, ten, twenty, thirty, forty, fifty, one hundred, one thousand, one hundred thousand births; many eons of world-contraction, many eons of world-expansion, many eons of world-contraction and expansion. 'There I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such pleasure and pain, with such a lifespan. Having passed away from there, I arose yonder. There too I was named thus, of such a clan, of such a complexion, nourished by such food, experiencing such pleasure and pain, with such a lifespan. Having passed away from there, I arose here.' Thus, he recollects his manifold past lives in all their modes and details. This, O great king, is indeed a visible fruit of recluseship, more excellent and more sublime than the previous visible fruits of recluseship.",
      "sinhala": "මහ රජ, යම් සේ පුරුෂයෙක් තම ගමෙන් වෙනත් ගමකට යන්නේ ද, ඒ ගමෙන් ද වෙනත් ගමකට යන්නේ ද, ඒ පුරුෂයා ඒ ගමෙන් තම ගමටම ආපසු එන්නේ ද, ඔහුට මෙවන් සිතක් ඇති වන්නේය: ‘මම තම ගමෙන් අසුවල් ගමට ගියෙමි. එහි මෙසේ සිටියෙමි, මෙසේ හිඳගත්තෙමි, මෙසේ කතා කළෙමි, මෙසේ නිශ්ශබ්ද ව සිටියෙමි. ඒ ගමෙන් ද අසුවල් ගමට ගියෙමි. එහි ද මෙසේ සිටියෙමි, මෙසේ හිඳගත්තෙමි, මෙසේ කතා කළෙමි, මෙසේ නිශ්ශබ්ද ව සිටියෙමි. ඒ ගමෙන් මම තම ගමටම ආපසු පැමිණියෙමි.’ මහ රජ, එපරිද්දෙන්ම, භික්ෂුවක් මෙසේ සමාධිගත වූ, පිරිසිදු වූ, ඉතා දීප්තිමත් වූ, කිලිටු රහිත වූ, උපක්ලේශයන්ගෙන් පහ වූ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, අචල වූ සිතින් පෙර විසූ තැන් සිහි කිරීමේ ඥානය පිණිස සිත යොමු කරයි, නැඹුරු කරයි. ඔහු නොයෙක් ආකාර වූ පෙර විසූ තැන් සිහි කරයි. එනම්: එක් ජාතියක් ද, ජාති දෙකක් ද, ජාති තුනක් ද, ජාති හතරක් ද, ජාති පහක් ද, ජාති දහයක් ද, ජාති විස්සක් ද, ජාති තිහක් ද, ජාති හතළිහක් ද, ජාති පනහක් ද, ජාති සියයක් ද, ජාති දහසක් ද, ජාති ලක්ෂයක් ද, නොයෙක් සංවර්ත කල්ප ද, නොයෙක් විවර්ත කල්ප ද, නොයෙක් සංවර්ත-විවර්ත කල්ප ද (සිහි කරයි). ‘අසුවල් තැන දී මම අසුවල් නම් ඇත්තෙක් වීමි, අසුවල් ගෝත්‍රයේ ඇත්තෙක් වීමි, අසුවල් වර්ණ ඇත්තෙක් වීමි, අසුවල් ආහාර ඇත්තෙක් වීමි, මෙබඳු සැපදුක් ප්‍රතිසංවේදී ඇත්තෙක් වීමි, මෙබඳු ආයුෂ කෙළවර කොට ඇත්තෙක් වීමි. මම එතැනින් චුත වී අසුවල් තැන උපන්නෙමි; එහි ද මම අසුවල් නම් ඇත්තෙක් වීමි, අසුවල් ගෝත්‍රයේ ඇත්තෙක් වීමි, අසුවල් වර්ණ ඇත්තෙක් වීමි, අසුවල් ආහාර ඇත්තෙක් වීමි, මෙබඳු සැපදුක් ප්‍රතිසංවේදී ඇත්තෙක් වීමි, මෙබඳු ආයුෂ කෙළවර කොට ඇත්තෙක් වීමි. මම එතැනින් චුත වී දැන් මෙහි උපන්නෙමි.’ මෙසේ ආකාර සහිත ව ද, තොරතුරු සහිත ව ද, නොයෙක් ආකාර වූ පෙර විසූ තැන් සිහි කරයි. මහ රජ, මෙය ද මේ ආත්මභාවයේ දී දැකිය හැකි ශ්‍රමණ ඵලයක් වන අතර, පෙර කී දැන් දැකිය හැකි ශ්‍රමණ ඵලයන්ට වඩා උතුම් ද ප්‍රණීත ද වේ.",
      "paliTitle": ""
    },
    {
      "number": 246,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhinīharati abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti.",
      "english": "With his mind thus concentrated, purified, clear, unblemished, rid of defilements, pliant, workable, steady, and unshakable, he directs and inclines his mind to the knowledge of the passing away and re-arising of beings. With the divine eye, purified and surpassing human vision, he sees beings passing away and re-arising, inferior and superior, beautiful and ugly, well-destined and ill-destined, and he understands beings as they fare according to their actions. He discerns: ‘Indeed, these good sirs, beings endowed with misconduct of body, misconduct of speech, and misconduct of mind, revilers of the noble ones, holding wrong view, and undertaking actions based on wrong view—after the breakup of the body, after death, they reappear in a state of deprivation, a bad destination, a downfall, in hell. But these good sirs, beings endowed with good conduct of body, good conduct of speech, and good conduct of mind, not revilers of the noble ones, holding right view, and undertaking actions based on right view—after the breakup of the body, after death, they reappear in a good destination, in a heavenly world.’ Thus, with the divine eye, purified and surpassing human vision, he sees beings passing away and re-arising, inferior and superior, beautiful and ugly, well-destined and ill-destined, and he understands beings as they fare according to their actions.",
      "sinhala": "ඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, ප්‍රභාස්වර වූ, කෙලෙස් රහිත වූ, උපක්ලේශ පහව ගිය, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථීර වූ, අචලත්වයට පැමිණියා වූ සිතින් සත්වයන්ගේ චුති-උපපත්ති ඥානය පිණිස සිත යොමු කරයි, නමාලයි. ඔහු පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් සත්වයන් චුතවන්නා වූ ද, උපදින්නා වූ ද, හීන වූ ද, ප්‍රණීත වූ ද, ශුභවර්ණ වූ ද, දුර්වර්ණ වූ ද, සුගතිගාමී වූ ද, දුර්ගතිගාමී වූ ද වශයෙන් දකී. කර්මානුරූපව ගමන් කරන සත්වයන් දැනගනී –\n\n‘අහෝ, මේ භවත් සත්ත්වයෝ කාය දුශ්චරිතයෙන් යුක්ත වූවෝ ද, වචී දුශ්චරිතයෙන් යුක්ත වූවෝ ද, මනෝ දුශ්චරිතයෙන් යුක්ත වූවෝ ද, ආර්යයන්ට අපහාස කරන්නෝ ද, මිත්‍යා දෘෂ්ටිකයෝ ද, මිත්‍යා දෘෂ්ටියෙන් යුක්ත කර්මයන් සමාදන් වූවෝ ද වෙත්. ඔවුහු කය බිඳී යාමෙන්, මරණින් මතු අපායට, දුර්ගතියට, විනිපාතයට, නිරයට උපදිත්. නැතහොත්, මේ භවත් සත්ත්වයෝ කාය සුචරිතයෙන් යුක්ත වූවෝ ද, වචී සුචරිතයෙන් යුක්ත වූවෝ ද, මනෝ සුචරිතයෙන් යුක්ත වූවෝ ද, ආර්යයන්ට අපහාස නොකරන්නෝ ද, සම්මා දෘෂ්ටිකයෝ ද, සම්මා දෘෂ්ටියෙන් යුක්ත කර්මයන් සමාදන් වූවෝ ද වෙත්. ඔවුහු කය බිඳී යාමෙන්, මරණින් මතු සුගතියට, ස්වර්ග ලෝකයට උපදිත්’ යි. මෙසේ ඔහු පිරිසිදු වූ, මිනිස් ඇස ඉක්මවා ගිය දිවැසින් සත්වයන් චුතවන්නා වූ ද, උපදින්නා වූ ද, හීන වූ ද, ප්‍රණීත වූ ද, ශුභවර්ණ වූ ද, දුර්වර්ණ වූ ද, සුගතිගාමී වූ ද, දුර්ගතිගාමී වූ ද වශයෙන් දකී. කර්මානුරූපව ගමන් කරන සත්වයන් දැනගනී.",
      "paliTitle": "Dibbacakkhuñāṇaṃ",
      "englishTitle": "Divine Eye Knowledge",
      "sinhalaTitle": "දිව්‍ය චක්ෂුඥානය"
    },
    {
      "number": 247,
      "pali": "‘‘Seyyathāpi, mahārāja, majjhe siṅghāṭake pāsādo. Tattha cakkhumā puriso ṭhito passeyya manusse gehaṃ pavisantepi nikkhamantepi rathikāyapi vīthiṃ sañcarante [rathiyāpī rathiṃ sañcarante (sī.), rathiyāya vithiṃ sañcarantepi (syā.)] majjhe siṅghāṭake nisinnepi. Tassa evamassa – ‘ete manussā gehaṃ pavisanti, ete nikkhamanti, ete rathikāya vīthiṃ sañcaranti, ete majjhe siṅghāṭake nisinnā’ti. Evameva kho, mahārāja, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte sattānaṃ cutūpapātañāṇāya cittaṃ abhinīharati abhininnāmeti. So dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate, yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā, te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe sugate duggate; yathākammūpage satte pajānāti. ‘Idampi kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. ",
      "english": "Just as, great king, there might be a palace at a crossroads. Standing there, a keen-sighted person would see people entering houses, or leaving them, or walking along streets and thoroughfares, or seated at the crossroads itself. He would think: ‘These people are entering houses, these are leaving, these are walking along streets and thoroughfares, and these are seated at the crossroads.’ In the same way, great king, when the monk's mind is thus concentrated, purified, cleansed, unblemished, rid of defilements, malleable, wieldy, steady, and attained to imperturbability, he directs and inclines his mind to the knowledge of the passing away and re-arising of beings. With the divine eye, purified and surpassing that of humans, he sees beings passing away and re-arising, inferior and superior, beautiful and ugly, fortunate and unfortunate, and he understands beings according to their karma: ‘Indeed, these good sirs, endowed with misconduct in body, speech, and mind, revilers of noble ones, holding wrong views, and undertaking actions based on wrong views, upon the dissolution of the body, after death, have reappeared in a state of deprivation, a bad destination, a lower realm, hell. While these other good sirs, endowed with good conduct in body, speech, and mind, not reviling noble ones, holding right views, and undertaking actions based on right views, upon the dissolution of the body, after death, they have reappeared in a good destination, a heavenly world.’ Thus, with the divine eye, purified and surpassing that of humans, he sees beings passing away and re-arising, inferior and superior, beautiful and ugly, fortunate and unfortunate; and he understands beings according to their karma. ‘This, great king, is also a fruit of recluseship visible here and now, which is far more excellent and sublime than the previous fruits of recluseship visible here and now.’",
      "sinhala": "මහරජ, සිවුමංසලක් මැද ඇති ප්‍රාසාදයක් සේ ය. එහි සිටින ඇස් ඇති පුරුෂයෙක් ගෙට ඇතුළු වන්නවුන් ද, පිටවන්නවුන් ද, මාවතේ වීථි සංචාරය කරන්නවුන් ද, සිවුමංසල මැද හිඳින්නවුන් ද දකී. ඔහුට මෙසේ සිතේ: ‘මේ මනුෂ්‍යයෝ ගෙට ඇතුළු වෙති, මේ අය පිටවෙති, මේ අය මාවතේ වීථි සංචාරය කරති, මේ අය සිවුමංසල මැද හිඳිති’ යනුවෙනි.\n\nමහරජ, එලෙසින් ම භික්ෂූන් වහන්සේ ද මෙසේ සමාධිගත වූ, පිරිසිදු වූ, පැහැපත් වූ, කිළිටි රහිත වූ, කෙලෙස් පහ වූ, මෘදු වූ, කර්මණ්‍ය වූ, ස්ථිර වූ, කම්පා නොවන අරමුණට පැමිණි සිතකින් සත්වයන්ගේ චුති-උප්පත්ති ඥානය සඳහා සිත මෙහෙයවති, නැඹුරු කරති. ඒ භික්ෂූන් වහන්සේ පිරිසිදු වූ, මිනිස් ඇස ඉක්ම වූ දිව්‍ය චක්ෂුසින් චුත වන්නා වූ, උපදින්නා වූ, හීන වූ, ප්‍රණීත වූ, සුන්දර වූ, අවලස්සන වූ, සුගතිගාමී වූ, දුගතිගාමී වූ සත්වයන් දකිති; තම කර්මයන්ට අනුව ගිය සත්වයන් හඳුනා ගනිති –\n\n‘අහෝ! මේ පින්වත් සත්වයෝ කායදුශ්චරිතයෙන් යුක්ත වූහ, වචීදුශ්චරිතයෙන් යුක්ත වූහ, මනෝදුශ්චරිතයෙන් යුක්ත වූහ, ආර්යයන්ට අපහාස කළෝය, මිත්‍යාදෘෂ්ටිකයෝය, මිත්‍යාදෘෂ්ටික කර්ම සමාදන් වූවෝය. ඔවුහු කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරයෙහි උපන්නාහ. නැතහොත් මේ පින්වත් සත්වයෝ කායසුචරිතයෙන් යුක්ත වූහ, වචීසුචරිතයෙන් යුක්ත වූහ, මනෝසුචරිතයෙන් යුක්ත වූහ, ආර්යයන්ට අපහාස නොකළෝය, සම්මාදිට්ඨිකයෝය, සම්මාදිට්ඨික කර්ම සමාදන් වූවෝය. ඔවුහු කය බිඳී මරණින් මතු සුගති, ස්වර්ග ලෝකයෙහි උපන්නාහ’යි. මෙසේ පිරිසිදු වූ, මිනිස් ඇස ඉක්ම වූ දිව්‍ය චක්ෂුසින් චුත වන්නා වූ, උපදින්නා වූ, හීන වූ, ප්‍රණීත වූ, සුන්දර වූ, අවලස්සන වූ, සුගතිගාමී වූ, දුගතිගාමී වූ සත්වයන් දකිති; තම කර්මයන්ට අනුව ගිය සත්වයන් හඳුනා ගනිති.\n\n‘මහරජ, මේ සාමණ්‍ය ඵලය ද, පෙර සඳහන් කළ සාමණ්‍ය ඵලවලට වඩා උතුම් ද, ප්‍රණීත ද වේ.’",
      "paliTitle": ""
    },
    {
      "number": 248,
      "pali": "‘‘So evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhinīharati abhininnāmeti. So idaṃ dukkhanti yathābhūtaṃ pajānāti, ayaṃ dukkhasamudayoti yathābhūtaṃ pajānāti, ayaṃ dukkhanirodhoti yathābhūtaṃ pajānāti, ayaṃ dukkhanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti. Ime āsavāti yathābhūtaṃ pajānāti, ayaṃ āsavasamudayoti yathābhūtaṃ pajānāti, ayaṃ āsavanirodhoti yathābhūtaṃ pajānāti, ayaṃ āsavanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati, ‘vimuttasmiṃ vimuttami’ti ñāṇaṃ hoti, ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti.",
      "english": "With his mind thus concentrated, purified, perfectly clear, stainless, rid of imperfections, pliable, workable, steady, and having attained to imperturbability, he directs and inclines his mind to the knowledge of the destruction of the taints. He understands as it actually is: ‘This is suffering’; he understands as it actually is: ‘This is the origin of suffering’; he understands as it actually is: ‘This is the cessation of suffering’; he understands as it actually is: ‘This is the path leading to the cessation of suffering’. He understands as it actually is: ‘These are the taints’; he understands as it actually is: ‘This is the origin of the taints’; he understands as it actually is: ‘This is the cessation of the taints’; he understands as it actually is: ‘This is the path leading to the cessation of the taints’. For him who thus knows and thus sees, his mind is liberated from the taint of sensual desire, his mind is liberated from the taint of existence, and his mind is liberated from the taint of ignorance. With liberation, the knowledge arises: ‘I am liberated’. He understands: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.’",
      "sinhala": "ඔහු මෙසේ සමාධිගත වූ, පිරිසිදු වූ, බබලන ලද, කෙලෙස් රහිත වූ, උපක්ලේශයන් දුරු කළ, මෘදු වූ, කර්මණයට සුදුසු වූ, ස්ථිර වූ, නොසැලෙන සුලු වූ සිත ආශ්‍ර‍වයන් ක්ෂ‍ය කිරීමේ ඤාණය පිණිස යොමු කරයි, නැඹුරු කරයි.\n\nඔහු 'මෙය දුක යි' කියා යථාභූතව දනී. 'මෙය දුක හටගැනීම යි' කියා යථාභූතව දනී. 'මෙය දුක නැති කිරීම යි' කියා යථාභූතව දනී. 'මෙය දුක නැති කිරීමට යන මාර්ගය යි' කියා යථාභූතව දනී.\n\n'මේවා ආශ්‍ර‍වයෝ ය' කියා යථාභූතව දනී. 'මෙය ආශ්‍ර‍වයන් හටගැනීම යි' කියා යථාභූතව දනී. 'මෙය ආශ්‍ර‍වයන් නැති කිරීම යි' කියා යථාභූතව දනී. 'මෙය ආශ්‍ර‍වයන් නැති කිරීමට යන මාර්ගය යි' කියා යථාභූතව දනී.\n\nමෙසේ දන්නා වූ, මෙසේ දක්නා වූ ඔහුට කාමාශ්‍ර‍වයෙන් ද සිත මිදේ, භවාශ්‍ර‍වයෙන් ද සිත මිදේ, අවිද්‍යාශ්‍ර‍වයෙන් ද සිත මිදේ. 'මම විමුක්ත ය' යන ඤාණය ඇති වේ. 'ඉපදීම ක්ෂ‍ය විය, බඹසර වැස නිම කළා, කළ යුතු දේ කළා, මේ තත්වයෙන් එහාට තවත් නැත' යි දනී.",
      "paliTitle": "Āsavakkhayañāṇaṃ",
      "englishTitle": "Knowledge of the Exhaustion of Cankers",
      "sinhalaTitle": "ආසව ක‍්ෂය ජ‍්ඥානය"
    },
    {
      "number": 249,
      "pali": "‘‘Seyyathāpi, mahārāja, pabbatasaṅkhepe udakarahado accho vippasanno anāvilo. Tattha cakkhumā puriso tīre ṭhito passeyya sippisambukampi sakkharakathalampi macchagumbampi carantampi tiṭṭhantampi. Tassa evamassa – ‘ayaṃ kho udakarahado accho vippasanno anāvilo. Tatrime sippisambukāpi sakkharakathalāpi macchagumbāpi carantipi tiṭṭhantipī’ti. Evameva kho, mahārāja, bhikkhu evaṃ samāhite citte parisuddhe pariyodāte anaṅgaṇe vigatūpakkilese mudubhūte kammaniye ṭhite āneñjappatte āsavānaṃ khayañāṇāya cittaṃ abhinīharati abhininnāmeti. ‘So idaṃ dukkha’nti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānāti. ‘Ime āsavāti yathābhūtaṃ pajānāti, ‘ayaṃ āsavasamudayo’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodho’ti yathābhūtaṃ pajānāti, ‘ayaṃ āsavanirodhagāminī paṭipadāti yathābhūtaṃ pajānāti. Tassa evaṃ jānato evaṃ passato kāmāsavāpi cittaṃ vimuccati, bhavāsavāpi cittaṃ vimuccati, avijjāsavāpi cittaṃ vimuccati, ‘vimuttasmiṃ vimuttamiti ñāṇaṃ hoti, ‘khīṇā jāti, vusitaṃ brahmacariyaṃ, kataṃ karaṇīyaṃ, nāparaṃ itthattāyā’ti pajānāti. Idaṃ kho, mahārāja, sandiṭṭhikaṃ sāmaññaphalaṃ purimehi sandiṭṭhikehi sāmaññaphalehi abhikkantatarañca paṇītatarañca. Imasmā ca pana, mahārāja, sandiṭṭhikā sāmaññaphalā aññaṃ sandiṭṭhikaṃ sāmaññaphalaṃ uttaritaraṃ vā paṇītataraṃ vā natthī’’ti. ",
      "english": "Just as, O great king, in a mountain hollow there is a pool of water, clear, limpid, and undisturbed. And there, a keen-sighted person standing on the bank would see oysters and shells, gravel and pebbles, and shoals of fish, both moving about and staying still. He would think: ‘This pool of water is clear, limpid, and undisturbed. And there are these oysters and shells, gravel and pebbles, and shoals of fish, both moving about and staying still.’\n\nIn the same way, O great king, a monastic, with a mind thus concentrated, purified, cleansed, unblemished, free from defilements, pliant, workable, steady, and attained to imperturbability, directs and inclines the mind to the knowledge of the destruction of the taints. He truly understands: ‘This is suffering,’ he truly understands: ‘This is the origin of suffering,’ he truly understands: ‘This is the cessation of suffering,’ he truly understands: ‘This is the path leading to the cessation of suffering.’ He truly understands: ‘These are the taints,’ he truly understands: ‘This is the origin of the taints,’ he truly understands: ‘This is the cessation of the taints,’ he truly understands: ‘This is the path leading to the cessation of the taints.’ For him, thus knowing, thus seeing, his mind is liberated from the taint of sensual desire, his mind is liberated from the taint of existence, and his mind is liberated from the taint of ignorance. When liberated, there arises the knowledge: ‘It is liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what was to be done has been done, there is no more for this state of being.’\n\nThis, O great king, is a visible fruit of recluseship, more excellent and more sublime than those other visible fruits of recluseship. And beyond this visible fruit of recluseship, O great king, there is no other visible fruit of recluseship that is higher or more sublime.",
      "sinhala": "මහ​රාජ, යම් සේ පර්වතයකින් වට වූ තැනක ඇති දිය පහරක් පැහැදිලිව, ප්‍රසන්නව, කලවම් නොවී පවතීද, එහි ඇස් ඇත්තෙක් ගොඩෙහි සිට ගමන් කරන හා සිටගෙන සිටින බෙල්ලන්, ගල් කැට හා මසුන් රංචු දකීද, ඔහුට මෙසේ සිතේ: ‘මේ දිය පහර පැහැදිලිය, ප්‍රසන්නය, කලවම් නො වූවකි. එහි මේ බෙල්ලන් ද, ගල් කැට ද, මසුන් රංචු ද ගමන් කරති, සිටගෙන සිටිති’යි.\n\nඑපරිද්දෙන්ම, මහ​රාජ, භික්ෂුවක් මෙසේ සමාධිගත වූ, පිරිසිදු වූ, පරම පවිත්‍ර වූ, කිලිටි නැති, උපක්ලේශයන් දුරු කළ, මෘදු වූ, කර්මයට සුදුසු වූ, ස්ථිර වූ, චලනයකින් තොර වූ සිත ආසවයන්ගේ ක්ෂය කිරීමේ ඥානය පිණිස යොමු කරයි, නමාලයි. හෙතෙම ‘මෙය දුකයි’ කියා යථාර්ථය ලෙස දනියි; ‘මෙය දුක ඇතිවීමයි’ කියා යථාර්ථය ලෙස දනියි; ‘මෙය දුක නැතිකිරීමයි’ කියා යථාර්ථය ලෙස දනියි; ‘මෙය දුක නැතිකිරීමට යන මාර්ගයයි’ කියා යථාර්ථය ලෙස දනියි. ‘මේවා ආසවයෝය’ කියා යථාර්ථය ලෙස දනියි; ‘මෙය ආසවයන්ගේ ඇතිවීමයි’ කියා යථාර්ථය ලෙස දනියි; ‘මෙය ආසවයන්ගේ නැතිකිරීමයි’ කියා යථාර්ථය ලෙස දනියි; ‘මෙය ආසවයන් නැතිකිරීමට යන මාර්ගයයි’ කියා යථාර්ථය ලෙස දනියි. ඔහුට මෙසේ දන්නා විට, මෙසේ දකින විට කාමාසවයන්ගෙන්ද සිත මිදෙයි, භවාසවයන්ගෙන්ද සිත මිදෙයි, අවිද්‍යාසවයන්ගෙන්ද සිත මිදෙයි. ‘මිදුණෙමි’ යන ඥානය පහළ වෙයි. ‘ජාතිය ක්ෂය විය, බඹසර වැස නිම කළෙමි, කළ යුතු දේ කළෙමි, මෙතෙම තවත් භවයකට නැත’යි දනියි.\n\nමහ​රාජ, මේ භවයේදී දැකිය හැකි ශ්‍රමණඵලය පෙර දැක්වූ මේ භවයේදී දැකිය හැකි ශ්‍රමණඵලයන්ට වඩා අතිශයින් උතුම්ය, ප්‍රණීතය. මහ​රාජ, මේ භවයේදී දැකිය හැකි ශ්‍රමණඵලයට වඩා, වෙනත් මේ භවයේදී දැකිය හැකි ශ්‍රමණඵලයක් වඩා උතුම් වූ හෝ වඩා ප්‍රණීත වූ හෝ නැත.",
      "paliTitle": ""
    },
    {
      "number": 250,
      "pali": "Evaṃ vutte, rājā māgadho ajātasattu vedehiputto bhagavantaṃ etadavoca – ‘‘abhikkantaṃ, bhante, abhikkantaṃ, bhante. Seyyathāpi, bhante, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya ‘cakkhumanto rūpāni dakkhantī’ti; evamevaṃ, bhante, bhagavatā anekapariyāyena dhammo pakāsito. Esāhaṃ, bhante, bhagavantaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhagavā dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gataṃ. Accayo maṃ, bhante, accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yohaṃ pitaraṃ dhammikaṃ dhammarājānaṃ issariyakāraṇā jīvitā voropesiṃ. Tassa me, bhante bhagavā accayaṃ accayato paṭiggaṇhātu āyatiṃ saṃvarāyā’’ti.",
      "english": "When this was said, King Ajātasattu of Magadha, son of Vaidehī, said this to the Blessed One: \"Excellent, Venerable Sir! Excellent, Venerable Sir! Just as, Venerable Sir, one might set upright what was overturned, or reveal what was hidden, or show the way to one who was lost, or hold up a lamp in the darkness so that those with eyes might see forms; even so, Venerable Sir, has the Dhamma been made clear by the Blessed One in many ways. I, Venerable Sir, go for refuge to the Blessed One, to the Dhamma, and to the Saṅgha of bhikkhus. May the Blessed One remember me as a lay follower who has gone for refuge from this day forth for as long as life lasts. A transgression has indeed overcome me, Venerable Sir, acting as a fool, as one deluded, as one unskilled in good, in that I deprived my father, who was righteous and a Dhamma-king, of his life for the sake of sovereignty. May the Blessed One, Venerable Sir, accept this transgression of mine as a transgression, so that I may restrain myself in the future.\"",
      "sinhala": "මෙසේ පැවසූ විට, වේදේහි පුත්‍ර වූ මගධ රජ අජාතසත්තු භාග්‍යවතුන් වහන්සේට මෙසේ පැවසුවේය – ‘‘ස්වාමීනි, ඉතා අලංකාරයි! ස්වාමීනි, ඉතා අලංකාරයි! ස්වාමීනි, යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මඟ මුළා වූවෙකුට මඟ පෙන්වන්නේද, ඇස් ඇති අයට රූප දැකිය හැකි වන පරිදි අන්ධකාරයේ තෙල් පහනක් දල්වන්නේද; එලෙසින්ම, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. ස්වාමීනි, මම භාග්‍යවතුන් වහන්සේද, ධර්මයද, භික්ෂුසංඝයාද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා භාග්‍යවතුන් වහන්සේ පිළිගන්නා සේක්වා.\n\nස්වාමීනි, මා විසින් කරන ලද වරදක් ඇත, මා බාලයෙකු, මුළා වූවෙකු සහ අකුසල කර්ම කරන්නෙකු මෙන් ක්‍රියා කළෙමි. මක්නිසාද යත්, මා ධර්මිෂ්ඨ වූ, ධර්මරාජයෙකු වූ මගේ පියාව රජකම් හේතුවෙන් ජීවිතයෙන් තොර කළෙමි. එබැවින්, ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනාගතයේදී සංවරය පිණිස මාගේ එම වරද වරදක් ලෙස පිළිගන්නා සේක්වා.’’",
      "paliTitle": "Ajātasattuupāsakattapaṭivedanā",
      "englishTitle": "Ajātasattu's Profession of Lay Followership",
      "sinhalaTitle": "අජාතසත්තු උපාසක භාව ප‍්‍ර‍‌කාශය"
    },
    {
      "number": 251,
      "pali": "‘‘Taggha tvaṃ, mahārāja, accayo accagamā yathābālaṃ yathāmūḷhaṃ yathāakusalaṃ, yaṃ tvaṃ pitaraṃ dhammikaṃ dhammarājānaṃ jīvitā voropesi. Yato ca kho tvaṃ, mahārāja, accayaṃ accayato disvā yathādhammaṃ paṭikarosi, taṃ te mayaṃ paṭiggaṇhāma. Vuddhihesā, mahārāja, ariyassa vinaye, yo accayaṃ accayato disvā yathādhammaṃ paṭikaroti, āyatiṃ saṃvaraṃ āpajjatī’’ti.",
      "english": "Indeed, great king, an offense has come upon you, like one foolish, like one deluded, like one unskillful, in that you deprived of life your father, a righteous king, a king of righteousness. But since, great king, you, having seen the offense as an offense, rectify it according to what is right, we accept that from you. This, great king, is growth in the Noble Discipline: that one who, having seen an offense as an offense, rectifies it according to what is right, and practices restraint in the future.",
      "sinhala": "මහරජ, ඔබ බාලයෙකු මෙන්, මුළා වූවෙකු මෙන්, අකුසල ක්‍රියාවක් කරන්නෙකු මෙන් වරදකට පැමිණියා. ඒ ඔබ ධර්මිෂ්ඨ වූ, ධර්මරාජයෙකු වූ පියාණන් ජීවිතයෙන් තොර කළ හෙයිනි. නමුත් මහරජ, ඔබ වරද වරදක් ලෙස දැක, ධර්මයට අනුව එය පිළිසකර කරන හෙයින්, එය අපි ඔබෙන් පිළිගනිමු. මහරජ, යමෙක් වරද වරදක් ලෙස දැක, ධර්මයට අනුව එය පිළිසකර කර, අනාගතයේදී සංවරයට පැමිණීම, ආර්ය විනයෙහි වර්ධනයකි.",
      "paliTitle": ""
    },
    {
      "number": 252,
      "pali": "Evaṃ vutte, rājā māgadho ajātasattu vedehiputto bhagavantaṃ etadavoca – ‘‘handa ca dāni mayaṃ, bhante, gacchāma bahukiccā mayaṃ bahukaraṇīyā’’ti. ‘‘Yassadāni tvaṃ, mahārāja, kālaṃ maññasī’’ti. Atha kho rājā māgadho ajātasattu vedehiputto bhagavato bhāsitaṃ abhinanditvā anumoditvā uṭṭhāyāsanā bhagavantaṃ abhivādetvā padakkhiṇaṃ katvā pakkāmi.",
      "english": "When this was said, King Ajātasattu of Magadha, son of Vaidehi, spoke thus to the Blessed One: \"Well now, venerable sir, let us go. We have much to do, many duties await us.\" \"Now, great king, do as you deem appropriate.\" Then, King Ajātasattu of Magadha, son of Vaidehi, having welcomed and approved the Blessed One's words, rose from his seat, paid homage to the Blessed One, circumambulated him clockwise, and departed.",
      "sinhala": "මෙසේ කී කල්හි, මාගධ රජු වූ වේදේහී පුත් අජාතසත්තු භාග්‍යවතුන්ට මෙය පැවසීය – ‘‘වහන්ස, දැන් අපි යමු. අපට බොහෝ කටයුතු ඇත, බොහෝ දේ කිරීමට ඇතැ’’යි. ‘‘මහ රජ, ඔබ දැන් යම් කාලයක් සුදුසු යැයි සිතන්නේ නම්, ඒ අනුව කටයුතු කරන්නැ’’යි. ඉක්බිති මාගධ රජු වූ වේදේහී පුත් අජාතසත්තු භාග්‍යවතුන් වහන්සේගේ වචනය අභිනන්දනය කොට, අනුමෝදන් කොට, ආසනයෙන් නැගිට, භාග්‍යවතුන් වහන්සේට ආචාර කොට, ප්‍රදක්ෂිණා කොට පිටත්ව ගියේය.",
      "paliTitle": ""
    },
    {
      "number": 253,
      "pali": "Atha kho bhagavā acirapakkantassa rañño māgadhassa ajātasattussa vedehiputtassa bhikkhū āmantesi – ‘‘khatāyaṃ, bhikkhave, rājā. Upahatāyaṃ, bhikkhave, rājā. Sacāyaṃ, bhikkhave, rājā pitaraṃ dhammikaṃ dhammarājānaṃ jīvitā na voropessatha, imasmiññeva āsane virajaṃ vītamalaṃ dhammacakkhuṃ uppajjissathā’’ti. Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti. ",
      "english": "Then the Blessed One, after King Ajātasattu of Magadha, the son of Videhī, had recently departed, addressed the monks: “Monks, this king is ruined. Monks, this king is destroyed. Monks, if this king had not deprived his righteous father, the Dharma-king, of life, then right at this very seat, the pure, stainless Eye of Dhamma would have arisen in him.” So spoke the Blessed One. Delighted, those monks rejoiced in the Blessed One’s statement.",
      "sinhala": "ඉන්පසු භාග්‍යවතුන් වහන්සේ, මගධ රජු වූ වේදේහි පුත්‍ර අජාතසත්තු රජු මඳ වේලාවකට පෙර පිටත්ව ගිය පසු, භික්ෂූන් අමතා වදාළ සේක: \"මහණෙනි, මේ රජුට හානි සිදුවිය. මහණෙනි, මේ රජුට විනාශය පැමිණියේය. මහණෙනි, මේ රජු ධර්මිෂ්ඨ වූ, ධර්මයෙන් යුත් තම පියාගේ දිවි තොර නොකළේ නම්, මේ ආසනයේම කෙලෙස් රහිත වූ, මල පහවූ ධර්ම චක්ෂුව පහළ වන්නට තිබුණි.\"\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇති ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේගේ වචනය සතුටින් පිළිගත්හ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Sāmaññaphalasuttaṃ niṭṭhitaṃ dutiyaṃ.",
    "english": "Second Discourse on the Fruits of Recluseship Concluded",
    "sinhala": "සාමඤ්ඤඵල සූත්‍රය දෙවැන්න නිමි"
  }
}