{
  "id": "dn7",
  "title": {
    "pali": "Jāliyasuttaṃ",
    "english": "The Jāliya Sutta.",
    "sinhala": "ජාලිය සූත්‍රය"
  },
  "sections": [
    {
      "number": 378,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā kosambiyaṃ viharati ghositārāme. Tena kho pana samayena dve pabbajitā – muṇḍiyo ca paribbājako jāliyo ca dārupattikantevāsī yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavatā saddhiṃ sammodiṃsu. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho te dve pabbajitā bhagavantaṃ etadavocuṃ – ‘‘kiṃ nu kho, āvuso gotama, taṃ jīvaṃ taṃ sarīraṃ, udāhu aññaṃ jīvaṃ aññaṃ sarīra’’nti?",
      "english": "Thus have I heard: On one occasion the Blessed One was dwelling in Kosambī, at Ghosita's Park. At that time, two renunciants—Muṇḍiyo the wanderer and Jāliyo, a disciple of the wood-bowl ascetic—approached the Blessed One. Having approached, they exchanged greetings with the Blessed One. Having exchanged courteous and memorable talk, they stood to one side. As they stood to one side, those two renunciants said this to the Blessed One: \"Is it the case, friend Gotama, that the soul is the same as the body, or is the soul one thing and the body another?\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී: එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ කෝසම්බියෙහි ඝෝසිතාරාමයෙහි වැඩවසන සේක. එකල්හි මුණ්ඩිය නම් පරිබ්‍රාජකයාද, දාරුපත්තික නම් අතවැසියා වූ ජාලිය ද යන පැවිද්දන් දෙදෙනෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියහ. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු වූහ. සතුටු විය යුතු, සිහි කටයුතු වූ කථාබස් කතා කොට නිමවා එක් පසෙක සිටියහ. එක් පසෙක සිටි ඒ පැවිද්දන් දෙදෙනා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසූහ: “ආයුෂ්මත් ගෞතමයෙනි, ජීවය එයම ශරීරය එයමද? එසේත් නැත්නම් ජීවය වෙනත් එකකි, ශරීරය වෙනත් එකකි දැයි?”",
      "paliTitle": "Dvepabbajitavatthu",
      "englishTitle": "Story of Two Renunciants",
      "sinhalaTitle": "දෙපැවිදි වස්තුව"
    },
    {
      "number": 379,
      "pali": "‘‘Tena hāvuso, suṇātha sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho te dve pabbajitā bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘idhāvuso, tathāgato loke uppajjati arahaṃ, sammāsambuddho…pe… (yathā 190-212 anucchedesu evaṃ vitthāretabbaṃ). Evaṃ kho, āvuso, bhikkhu sīlasampanno hoti…pe… paṭhamaṃ jhānaṃ upasampajja viharati. Yo kho, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ nu kho tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Yo so, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi evaṃ passāmi. Atha ca panāhaṃ na vadāmi – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā…pe… dutiyaṃ jhānaṃ…pe… tatiyaṃ jhānaṃ…pe… catutthaṃ jhānaṃ upasampajja viharati. Yo kho, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ nu kho tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti? Yo so, āvuso, bhikkhu evaṃ jānāti evaṃ passati kallaṃ, tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi evaṃ passāmi. Atha ca panāhaṃ na vadāmi – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā…pe… ñāṇadassanāya cittaṃ abhinīharati abhininnāmeti…pe… yo kho, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ nu kho tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Yo so, āvuso, bhikkhu evaṃ jānāti evaṃ passati kallaṃ tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi evaṃ passāmi. Atha ca panāhaṃ na vadāmi – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā…pe….",
      "english": "“Therefore, friends, listen carefully and pay close attention; I will speak.” “Yes, friend,” those two ascetics replied to the Blessed One. The Blessed One spoke thus:\n\n“Here, friends, a Tathāgata arises in the world, an Arahant, a Fully Enlightened One, endowed with wisdom and conduct, knower of worlds, unsurpassed guide of tamable people, teacher of gods and humans, the Buddha, the Blessed One. He proclaims this world with its gods, Māras, and Brahmās, this generation with its recluses and brahmins, its kings and people, which he has realized by direct knowledge. He teaches the Dhamma good in the beginning, good in the middle, and good in the end, with the right meaning and phrasing; he proclaims the holy life in its entirety, perfectly pure. A householder or a householder's son or one born into some other family hears that Dhamma. Having heard the Dhamma, he gains faith in the Tathāgata. Possessing that faith, he reflects: ‘Household life is confining, a path for dust; going forth is open air. It is not easy for one living at home to practice the holy life utterly perfect and pure, like a polished conch shell. What if I were to shave off my hair and beard, put on the saffron robes, and go forth from the home life into homelessness?’ And in time, abandoning a small fortune or a large fortune, abandoning a small circle of relatives or a large circle of relatives, he shaves off his hair and beard, puts on the saffron robes, and goes forth from the home life into homelessness.\n\n“Having thus gone forth, friends, a monk lives restrained in the observance of the Pātimokkha, complete in conduct and resort, seeing danger in the slightest faults, he undertakes and trains in the training rules. He lives endowed with noble sense-restraint, experiencing internal blameless happiness. He lives endowed with mindfulness and clear comprehension, cultivating contentment, abandoning the five hindrances: sensual desire, ill-will, sloth and torpor, restlessness and remorse, and doubt. Having abandoned these five hindrances, defilements of the mind that weaken wisdom, quite secluded from sensual pleasures, secluded from unwholesome states, he enters upon and abides in the first jhana, which is accompanied by applied thought and sustained thought, with rapture and pleasure born of seclusion.\n\n“Friends, for a monk who knows and sees in this way, is it fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’?” “Friends, for a monk who knows and sees in this way, it is fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’.” “However, friends, I know and see this in this way. Yet, I do not say, ‘The soul is the same as the body,’ or ‘The soul is different from the body.’\n\n“Again, friends, with the subsiding of applied thought and sustained thought, a monk enters upon and abides in the second jhana, which has internal confidence and unification of mind, is without applied thought and sustained thought, and is filled with rapture and pleasure born of concentration.\n\n“Friends, for a monk who knows and sees in this way, is it fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’?” “Friends, for a monk who knows and sees in this way, it is fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’.” “However, friends, I know and see this in this way. Yet, I do not say, ‘The soul is the same as the body,’ or ‘The soul is different from the body.’\n\n“Again, friends, with the fading away of rapture, a monk dwells equanimous, mindful and clearly comprehending, and experiences pleasure with the body; he enters upon and abides in the third jhana, of which the Noble Ones declare: ‘He dwells equanimous and mindful, one who has a pleasant abiding.’\n\n“Friends, for a monk who knows and sees in this way, is it fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’?” “Friends, for a monk who knows and sees in this way, it is fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’.” “However, friends, I know and see this in this way. Yet, I do not say, ‘The soul is the same as the body,’ or ‘The soul is different from the body.’\n\n“Again, friends, with the abandonment of pleasure and pain, and with the previous disappearance of joy and grief, a monk enters upon and abides in the fourth jhana, which is neither painful nor pleasant and is purified by equanimity and mindfulness.\n\n“Friends, for a monk who knows and sees in this way, is it fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’?” “Friends, for a monk who knows and sees in this way, it is fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’.” “However, friends, I know and see this in this way. Yet, I do not say, ‘The soul is the same as the body,’ or ‘The soul is different from the body.’\n\n“Again, friends, a monk directs and inclines his mind to knowledge and vision. He understands as it actually is: ‘This is suffering,’ ‘This is the origin of suffering,’ ‘This is the cessation of suffering,’ ‘This is the path leading to the cessation of suffering.’ He understands as it actually is: ‘These are defilements,’ ‘This is the origin of defilements,’ ‘This is the cessation of defilements,’ ‘This is the path leading to the cessation of defilements.’ Knowing and seeing thus, his mind is liberated from the defilement of sensual desire, from the defilement of becoming, and from the defilement of ignorance. When liberated, there is the knowledge: ‘Liberated.’ He understands: ‘Birth is destroyed, the holy life has been lived, what had to be done has been done, there is no more for this state of being.’\n\n“Friends, for a monk who knows and sees in this way, is it fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’?” “Friends, for a monk who knows and sees in this way, it is fitting for him to say, ‘The soul is the same as the body,’ or ‘The soul is different from the body’.” “However, friends, I know and see this in this way. Yet, I do not say, ‘The soul is the same as the body,’ or ‘The soul is different from the body.’",
      "sinhala": "‘‘එහෙයින් ආයුෂ්මතුනි, හොඳින් අසන්න, මනසිකාර කරන්න; මම දේශනා කරන්නෙමි’’යි. ‘‘එසේය ආයුෂ්මතුනි’’යි ඒ දෙදෙනා වූ පැවිද්දෝ භාග්‍ය​වතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍ය​වතුන් වහන්සේ මෙය වදාළ සේක: ‘‘ආයුෂ්මතුනි, මෙහි තථාගතයන් වහන්සේ ලෝකයේ පහළ වන සේක. උන්වහන්සේ අරහත් වන සේක, සම්මා සම්බුද්ධ වන සේක...\n\nආයුෂ්මතුනි, මෙලෙසින් භික්ෂුව සීලයෙන් යුක්ත වේ... පළමු ධ්‍යානයට සමවදවා වාසය කරයි.\n\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනියි, මෙසේ දකියි නම්, ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ කීමට ඔහුට සුදුසුද?\n\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනියි, මෙසේ දකියි නම්, ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ කීමට ඔහුට සුදුසුය.\n\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ නොකියමි... දෙවන ධ්‍යානයට... තෙවන ධ්‍යානයට... සිව්වන ධ්‍යානයට සමවදවා වාසය කරයි.\n\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනියි, මෙසේ දකියි නම්, ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ කීමට ඔහුට සුදුසුද?\n\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනියි, මෙසේ දකියි නම්, ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ කීමට ඔහුට සුදුසුය.\n\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ නොකියමි... ඤාණ දර්ශනය පිණිස සිත යොමු කරයි, නැඹුරු කරයි...\n\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනියි, මෙසේ දකියි නම්, ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ කීමට ඔහුට සුදුසුද?\n\nආයුෂ්මතුනි, යම් භික්ෂුවක් මෙසේ දනියි, මෙසේ දකියි නම්, ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ කීමට ඔහුට සුදුසුය.\n\nඑහෙත් ආයුෂ්මතුනි, මම නම් මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම ‘ඒ ජීවය, ඒ ශරීරය’ යැයි හෝ ‘වෙනත් ජීවයක්, වෙනත් ශරීරයක්’ යැයි හෝ නොකියමි...",
      "paliTitle": ""
    },
    {
      "number": 380,
      "pali": "…Pe… nāparaṃ itthattāyāti pajānāti. Yo kho, āvuso, bhikkhu evaṃ jānāti evaṃ passati, kallaṃ nu kho tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti? Yo so, āvuso, bhikkhu evaṃ jānāti evaṃ passati, na kallaṃ tassetaṃ vacanāya – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vāti. Ahaṃ kho panetaṃ, āvuso, evaṃ jānāmi evaṃ passāmi. Atha ca panāhaṃ na vadāmi – ‘taṃ jīvaṃ taṃ sarīra’nti vā ‘aññaṃ jīvaṃ aññaṃ sarīra’nti vā’’ti. Idamavoca bhagavā. Attamanā te dve pabbajitā bhagavato bhāsitaṃ abhinandunti. ",
      "english": "...he discerns no further state of being for him. Friend, for a bhikkhu who thus knows and thus sees, would it be proper for him to say, ‘The life-principle is the same as the body’ or ‘The life-principle is different from the body’? Friend, for such a bhikkhu who thus knows and thus sees, it is not proper for him to say, ‘The life-principle is the same as the body’ or ‘The life-principle is different from the body’. Indeed, friend, I thus know and thus see. And yet, I do not say, ‘The life-principle is the same as the body’ or ‘The life-principle is different from the body’.” The Blessed One said this. Delighted, those two renunciates rejoiced in the words of the Blessed One.",
      "sinhala": "...නැවත මෙබඳු බවකට පැමිණීමක් නැතැයි ප්‍රඥාවෙන් දනී.\n\nආයුෂ්මත්නි, යම් මහණෙක් මෙසේ දනීද, මෙසේ දකීද, ‘ඒ ජීවයම ඒ ශරීරය’ යැයි හෝ ‘වෙන ජීවයක් වෙන ශරීරයක්’ යැයි හෝ ඔහුට මෙය කීම සුදුසුද? ආයුෂ්මත්නි, යම් මහණෙක් මෙසේ දනීද, මෙසේ දකීද, ‘ඒ ජීවයම ඒ ශරීරය’ යැයි හෝ ‘වෙන ජීවයක් වෙන ශරීරයක්’ යැයි හෝ ඔහුට මෙය කීම සුදුසු නොවේ. ආයුෂ්මත්නි, මමද මෙය මෙසේ දනිමි, මෙසේ දකිමි. එහෙත් මම ‘ඒ ජීවයම ඒ ශරීරය’ යැයි හෝ ‘වෙන ජීවයක් වෙන ශරීරයක්’ යැයි හෝ නොකියමි.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සතුටු සිත් ඇතිවූ ඒ පැවිද්දෝ දෙදෙන භාග්‍යවතුන් වහන්සේගේ වචනය සතුටින් පිළිගත්හ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Jāliyasuttaṃ niṭṭhitaṃ sattamaṃ.",
    "english": "The Seventh Jaliya Sutta Concluded",
    "sinhala": "සත්වන ජාලිය සූත‍්‍රය නිමි."
  }
}