{
  "id": "vv.35",
  "title": {
    "pali": "Latāvimānavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 316,
      "pali": "Latā ca sajjā pavarā ca devatā, accimatī [accimukhī (sī.), acchimatī (pī. ka.) acchimutī (syā.)] rājavarassa sirīmato; Sutā ca rañño vessavaṇassa dhītā, rājīmatī dhammaguṇehi sobhatha.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 317,
      "pali": "Pañcettha nāriyo āgamaṃsu nhāyituṃ, sītodakaṃ uppaliniṃ sivaṃ nadiṃ; Tā tattha nhāyitvā rametvā devatā, naccitvā gāyitvā sutā lataṃ bravi [bruvī (sī.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 318,
      "pali": "‘‘Pucchāmi taṃ uppalamāladhārini, āveḷini kañcanasannibhattace; Timiratambakkhi nabheva sobhane, dīghāyukī kena kato yaso tava.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 319,
      "pali": "‘‘Kenāsi bhadde patino piyatarā, visiṭṭhakalyāṇitarassu rūpato; Padakkhiṇā naccagītavādite, ācikkha no tvaṃ naranāripucchitā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 320,
      "pali": "‘‘Ahaṃ manussesu manussabhūtā, uḷārabhoge kule suṇisā ahosiṃ; Akkodhanā bhattuvasānuvattinī, uposathe appamattā ahosiṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 321,
      "pali": "‘‘Manussabhūtā daharā apāpikā [daharāsa’pāpikā (sī.)], pasannacittā patimābhirādhayiṃ; Sadevaraṃ sassasuraṃ sadāsakaṃ, abhirādhayiṃ tamhi kato yaso mama.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 322,
      "pali": "‘‘Sāhaṃ tena kusalena kammunā, catubbhi ṭhānehi visesamajjhagā; Āyuñca vaṇṇañca sukhaṃ balañca, khiḍḍāratiṃ paccanubhomanappakaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 323,
      "pali": "‘‘Sutaṃ nu taṃ bhāsati yaṃ ayaṃ latā, yaṃ no apucchimha akittayī no; Patino kiramhākaṃ visiṭṭha nārīnaṃ, gatī ca tāsaṃ pavarā ca devatā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 324,
      "pali": "‘‘Patīsu dhammaṃ pacarāma sabbā, patibbatā yattha bhavanti itthiyo; Patīsu dhammaṃ pacaritva [pacaritvāna (ka.)] sabbā, lacchāmase bhāsati yaṃ ayaṃ latā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 325,
      "pali": "‘‘Sīho yathā pabbatasānugocaro, mahindharaṃ pabbatamāvasitvā; Pasayha hantvā itare catuppade, khudde mige khādati maṃsabhojano.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 326,
      "pali": "‘‘Tatheva saddhā idha ariyasāvikā, bhattāraṃ nissāya patiṃ anubbatā; Kodhaṃ vadhitvā abhibhuyya maccharaṃ, saggamhi sā modati dhammacārinī’’ti. Latāvimānaṃ catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 5,
      "pali": "Guttilavimānaṃ",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}