{
  "id": "vv.59",
  "title": {
    "pali": "Revatīvimānavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 861,
      "pali": "[dha. pa. 219 dhammapade] ‘‘Cirappavāsiṃ purisaṃ, dūrato sotthimāgataṃ; Ñātimittā suhajjā ca, abhinandanti āgataṃ;",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 862,
      "pali": "[dha. pa. 220 dhammapade] ‘‘Tatheva katapuññampi, asmā lokā paraṃ gataṃ; Puññāni paṭigaṇhanti, piyaṃ ñātīva āgataṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 863,
      "pali": "[pe. va. 714]‘‘Uṭṭhehi revate supāpadhamme, apārutadvāre [apārubhaṃ dvāraṃ (sī. syā.), apārutadvāraṃ (pī. ka.)] adānasīle; Nessāma taṃ yattha thunanti duggatā, samappitā nerayikā dukkhenā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 864,
      "pali": "Icceva [iccevaṃ (syā. ka.)] vatvāna yamassa dūtā, te dve yakkhā lohitakkhā brahantā; Paccekabāhāsu gahetvā revataṃ, pakkāmayuṃ devagaṇassa santike.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 865,
      "pali": "‘‘Ādiccavaṇṇaṃ ruciraṃ pabhassaraṃ, byamhaṃ subhaṃ kañcanajālachannaṃ; Kassetamākiṇṇajanaṃ vimānaṃ, sūriyassa raṃsīriva jotamānaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 866,
      "pali": "‘‘Nārīgaṇā candanasāralittā [candanasārānulittā (syā.)], ubhato vimānaṃ upasobhayanti; Taṃ dissati sūriyasamānavaṇṇaṃ, ko modati saggapatto vimāne’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 867,
      "pali": "‘‘Bārāṇasiyaṃ nandiyo nāmāsi, upāsako amaccharī dānapati vadaññū; Tassetamākiṇṇajanaṃ vimānaṃ, sūriyassa raṃsīriva jotamānaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 868,
      "pali": "‘‘Nārīgaṇā candanasāralittā, ubhato vimānaṃ upasobhayanti; Taṃ dissati sūriyasamānavaṇṇaṃ, so modati saggapatto vimāne’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 869,
      "pali": "‘‘Nandiyassāhaṃ bhariyā, agārinī sabbakulassa issarā; Bhattu vimāne ramissāmi dānahaṃ, na patthaye nirayaṃ dassanāyā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 870,
      "pali": "‘‘Eso te nirayo supāpadhamme, puññaṃ tayā akataṃ jīvaloke; Na hi maccharī rosako pāpadhammo, saggūpagānaṃ labhati sahabyata’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 871,
      "pali": "‘‘Kiṃ nu gūthañca muttañca, asucī paṭidissati; Duggandhaṃ kimidaṃ mīḷhaṃ, kimetaṃ upavāyatī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 872,
      "pali": "‘‘Esa saṃsavako nāma, gambhīro sataporiso; Yattha vassasahassāni, tuvaṃ paccasi revate’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 873,
      "pali": "‘‘Kiṃ nu kāyena vācāya, manasā dukkaṭaṃ kataṃ; Kena saṃsavako laddho, gambhīro sataporiso’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 874,
      "pali": "‘‘Samaṇe brāhmaṇe cāpi, aññe vāpi vanibbake [vaṇibbake (syā. ka.)]; Musāvādena vañcesi, taṃ pāpaṃ pakataṃ tayā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 875,
      "pali": "‘‘Tena saṃsavako laddho, gambhīro sataporiso; Tattha vassasahassāni, tuvaṃ paccasi revate.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 876,
      "pali": "‘‘Hatthepi chindanti athopi pāde, kaṇṇepi chindanti athopi nāsaṃ; Athopi kākoḷagaṇā samecca, saṅgamma khādanti viphandamāna’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 877,
      "pali": "‘‘Sādhu kho maṃ paṭinetha, kāhāmi kusalaṃ bahuṃ; Dānena samacariyāya, saṃyamena damena ca; Yaṃ katvā sukhitā honti, na ca pacchānutappare’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 878,
      "pali": "‘‘Pure tuvaṃ pamajjitvā, idāni paridevasi; Sayaṃ katānaṃ kammānaṃ, vipākaṃ anubhossasī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 879,
      "pali": "‘‘Ko devalokato manussalokaṃ, gantvāna puṭṭho me evaṃ vadeyya; ‘Nikkhittadaṇḍesu dadātha dānaṃ, acchādanaṃ seyya [sayana (sī.)] mathannapānaṃ; Nahi maccharī rosako pāpadhammo, saggūpagānaṃ labhati sahabyataṃ’.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 880,
      "pali": "‘‘Sāhaṃ nūna ito gantvā, yoniṃ laddhāna mānusiṃ; Vadaññū sīlasampannā, kāhāmi kusalaṃ bahuṃ; Dānena samacariyāya, saṃyamena damena ca.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 881,
      "pali": "‘‘Ārāmāni ca ropissaṃ, dugge saṅkamanāni ca; Papañca udapānañca, vippasannena cetasā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 882,
      "pali": "‘‘Cātuddasiṃ pañcadasiṃ, yā ca pakkhassa aṭṭhamī; Pāṭihāriyapakkhañca, aṭṭhaṅgasusamāgataṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 883,
      "pali": "‘‘Uposathaṃ upavasissaṃ, sadā sīlesu saṃvutā; Na ca dāne pamajjissaṃ, sāmaṃ diṭṭhamidaṃ mayā’’ti;",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 884,
      "pali": "Iccevaṃ vippalapantiṃ, phandamānaṃ tato tato; Khipiṃsu niraye ghore, uddhapādaṃ avaṃsiraṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 885,
      "pali": "‘‘Ahaṃ pure maccharinī ahosiṃ, paribhāsikā samaṇabrāhmaṇānaṃ; Vitathena ca sāmikaṃ vañcayitvā, paccāmahaṃ niraye ghorarūpe’’ti. Revatīvimānaṃ dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}