{
  "id": "vv.71",
  "title": {
    "pali": "Mahārathavimānavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1015,
      "pali": "‘‘Sahassayuttaṃ hayavāhanaṃ subhaṃ, āruyhimaṃ sandanaṃ nekacittaṃ; Uyyānabhūmiṃ abhito anukkamaṃ, purindado bhūtapatīva vāsavo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1016,
      "pali": "‘‘Sovaṇṇamayā te rathakubbarā ubho, phalehi [thalehi (sī.)] aṃsehi atīva saṅgatā; Sujātagumbā naravīraniṭṭhitā, virocatī pannaraseva cando.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1017,
      "pali": "‘‘Suvaṇṇajālāvatato ratho ayaṃ, bahūhi nānāratanehi cittito; Sunandighoso ca subhassaro ca, virocatī cāmarahatthabāhubhi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1018,
      "pali": "‘‘Imā ca nābhyo manasābhinimmitā, rathassa pādantaramajjhabhūsitā; Imā ca nābhyo satarājicittitā, sateratā vijjurivappabhāsare.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1019,
      "pali": "‘‘Anekacittāvatato ratho ayaṃ, puthū ca nemī ca sahassaraṃsiko; Tesaṃ saro suyyati [sūyati (sī.)] vaggurūpo, pañcaṅgikaṃ turiyamivappavāditaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1020,
      "pali": "‘‘Sirasmiṃ cittaṃ maṇicandakappitaṃ, sadā visuddhaṃ ruciraṃ pabhassaraṃ; Suvaṇṇarājīhi atīva saṅgataṃ, veḷuriyarājīva atīva sobhati.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1021,
      "pali": "‘‘Ime ca vāḷī maṇicandakappitā, ārohakambū sujavā brahūpamā. Brahā mahantā balino mahājavā, mano tavaññāya tatheva siṃsare [sabbare (ka.), sappare (?)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1022,
      "pali": "‘‘Ime ca sabbe sahitā catukkamā, mano tavaññāya tatheva siṃsare; Samaṃ vahantā mudukā anuddhatā, āmodamānā turagāna [turaṅgāna (ka.)] muttamā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1023,
      "pali": "‘‘Dhunanti vagganti patanti [pavattanti (pī. ka.)] cambare, abbhuddhunantā sukate piḷandhane; Tesaṃ saro suyyati vaggurūpo, pañcaṅgikaṃ turiyamivappavāditaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1024,
      "pali": "‘‘Rathassa ghoso apiḷandhanāna ca, khurassa nādo [nādī (syā.), nādi (pī. ka.)] abhihiṃsanāya ca; Ghoso suvaggū samitassa suyyati, gandhabbatūriyāni vicitrasaṃvane.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1025,
      "pali": "‘‘Rathe ṭhitā tā migamandalocanā, āḷārapamhā hasitā piyaṃvadā; Veḷuriyajālāvatatā tanucchavā, sadeva gandhabbasūraggapūjitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1026,
      "pali": "‘‘Tā rattarattambarapītavāsasā, visālanettā abhirattalocanā; Kule sujātā sutanū sucimhitā, rathe ṭhitā pañjalikā upaṭṭhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1027,
      "pali": "‘‘Tā kambukeyūradharā suvāsasā, sumajjhimā ūruthanūpapannā; Vaṭṭaṅguliyo sumukhā sudassanā, rathe ṭhitā pañjalikā upaṭṭhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1028,
      "pali": "‘‘Aññā suveṇī susu missakesiyo, samaṃ vibhattāhi pabhassarāhi ca; Anubbatā tā tava mānase ratā, rathe ṭhitā pañjalikā upaṭṭhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1029,
      "pali": "‘‘Āveḷiniyo padumuppalacchadā, alaṅkatā candanasāravāsitā [vositā (syā.), bhūsitā (ka.)]; Anubbatā tā tava mānase ratā, rathe ṭhitā pañjalikā upaṭṭhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1030,
      "pali": "‘‘Tā māliniyo padumuppalacchadā, alaṅkatā candanasāravāsitā; Anubbatā tā tava mānase ratā, rathe ṭhitā pañjalikā upaṭṭhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1031,
      "pali": "‘‘Kaṇṭhesu te yāni piḷandhanāni, hatthesu pādesu tatheva sīse; Obhāsayantī dasa sabbaso disā, abbhuddayaṃ sāradikova bhāṇumā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1032,
      "pali": "‘‘Vātassa vegena ca sampakampitā, bhujesu mālā apiḷandhanāni ca; Muñcanti ghosaṃ rūciraṃ suciṃ subhaṃ, sabbehi viññūhi sutabbarūpaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1033,
      "pali": "‘‘Uyyānabhūmyā ca duvaddhato ṭhitā, rathā ca nāgā tūriyāni ca saro; Tameva devinda pamodayanti, vīṇā yathā pokkharapattabāhubhi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1034,
      "pali": "‘‘Imāsu vīṇāsu bahūsu vaggūsu, manuññarūpāsu hadayeritaṃ pītiṃ [hadayeritaṃ pati (sī.), hadayeritampi taṃ (syā.)]; Pavajjamānāsu atīva accharā, bhamanti kaññā padumesu sikkhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1035,
      "pali": "‘‘Yadā ca gītāni ca vāditāni ca, naccāni cimāni [cemāni (sī.)] samenti ekato; Athettha naccanti athettha accharā, obhāsayantī ubhato varitthiyo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1036,
      "pali": "‘‘So modasi turiyagaṇappabodhano, mahīyamāno vajirāvudhoriva; Imāsu vīṇāsu bahūsu vaggūsu, manuññarūpāsu hadayeritaṃ pītiṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1037,
      "pali": "‘‘Kiṃ tvaṃ pure kammamakāsi attanā, manussabhūto purimāya jātiyā; Uposathaṃ kaṃ vā [uposathaṃ kiṃ va (syā.)] tuvaṃ upāvasi, kaṃ [kiṃ (syā.)] dhammacariyaṃ vatamābhirocayi.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1038,
      "pali": "‘‘Nayīdamappassa katassa [nayidaṃ appassa katassa (sī. syā.), sāsedaṃ appakatassa (ka.)] kammuno, pubbe suciṇṇassa uposathassa vā; Iddhānubhāvo vipulo ayaṃ tava, yaṃ devasaṅghaṃ abhirocase bhusaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1039,
      "pali": "‘‘Dānassa te idaṃ phalaṃ, atho sīlassa vā pana; Atho añjalikammassa, taṃ me akkhāhi pucchito’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1040,
      "pali": "So devaputto attamano, moggallānena pucchito; Pañhaṃ puṭṭho viyākāsi, yassa kammassidaṃ phalanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1041,
      "pali": "‘‘Jitindriyaṃ buddhamanomanikkamaṃ, naruttamaṃ kassapamaggapuggalaṃ; Avāpurantaṃ amatassa dvāraṃ, devātidevaṃ satapuññalakkhaṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1042,
      "pali": "‘‘Tamaddasaṃ kuñjaramoghatiṇṇaṃ, suvaṇṇasiṅgīnadabimbasādisaṃ; Disvāna taṃ khippamahuṃ sucīmano, tameva disvāna subhāsitaddhajaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1043,
      "pali": "‘‘Tamannapānaṃ athavāpi cīvaraṃ, suciṃ paṇītaṃ rasasā upetaṃ; Pupphābhikkiṇamhi sake nivesane, patiṭṭhapesiṃ sa asaṅgamānaso.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1044,
      "pali": "‘‘Tamannapānena ca cīvarena ca, khajjena bhojjena ca sāyanena ca; Santappayitvā dvipadānamuttamaṃ, so saggaso devapure ramāmahaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1045,
      "pali": "‘‘Etenupāyena imaṃ niraggaḷaṃ, yaññaṃ yajitvā tividhaṃ visuddhaṃ. Pahāyahaṃ mānusakaṃ samussayaṃ, indūpamo [indassamo (syā. ka.)] devapure ramāmahaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1046,
      "pali": "‘‘Āyuñca vaṇṇañca sukhaṃ balañca, paṇītarūpaṃ abhikaṅkhatā muni; Annañca pānañca bahuṃ susaṅkhataṃ, patiṭṭhapetabbamasaṅgamānase.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1047,
      "pali": "[kathā. 799]‘‘Nayimasmiṃ loke parasmiṃ [nayimasmiṃ vā loke parasmiṃ (kathāvatthu 799), nayimasmi loke va parasmi (?)] vā pana, buddhena seṭṭho va samo va vijjati; Āhuneyyānaṃ [yamāhuneyyānaṃ (ka.)] paramāhutiṃ gato, puññatthikānaṃ vipulapphalesina’’nti. Mahārathavimānaṃ cuddasamaṃ. Mahārathavaggo pañcamo niṭṭhito. Tassuddānaṃ – Maṇḍūko revatī chatto, kakkaṭo dvārapālako; Dve karaṇīyā dve sūci, tayo nāgā ca dve rathā; Purisānaṃ paṭhamo vaggo pavuccatīti. Bhāṇavāraṃ tatiyaṃ niṭṭhitaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}