{
  "id": "vv.8",
  "title": {
    "pali": "Dutiyanāvāvimānavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 53,
      "pali": "‘‘Suvaṇṇacchadanaṃ nāvaṃ, nāri āruyha tiṭṭhasi; Ogāhasi pokkharaṇiṃ, padmaṃ chindasi pāṇinā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 54,
      "pali": "‘‘Kena tetādiso vaṇṇo, kena te idha mijjhati; Uppajjanti ca te bhogā, ye keci manaso piyā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 55,
      "pali": "‘‘Pucchāmi taṃ devi mahānubhāve, manussabhutā kimakāsi puññaṃ; Kenāsi evaṃ jalitānubhāvā, vaṇṇo ca te sabbadisā pabhāsatī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 56,
      "pali": "Sā devatā attamanā, moggallānena pucchitā; Pañhaṃ puṭṭhā viyākāsi, yassa kammassidaṃ phalaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 57,
      "pali": "‘‘Ahaṃ manussesu manussabhūtā, purimāya jātiyā manussaloke; Disvāna bhikkhuṃ tasitaṃ kilantaṃ, uṭṭhāya pātuṃ udakaṃ adāsiṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 58,
      "pali": "‘‘Yo ve kilantassa pipāsitassa, uṭṭhāya pātuṃ udakaṃ dadāti; Sītodakā tassa bhavanti najjo, pahūtamalyā bahupuṇḍarīkā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 59,
      "pali": "‘‘Taṃ āpagā anupariyanti sabbadā, sītodakā vālukasanthatā nadī; Ambā ca sālā tilakā ca jambuyo, uddālakā pāṭaliyo ca phullā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 60,
      "pali": "‘‘Taṃ bhūmibhāgehi upetarūpaṃ, vimānaseṭṭhaṃ bhusasobhamānaṃ; Tassīdha kammassa ayaṃ vipāko, etādisaṃ puññakatā labhanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 61,
      "pali": "‘‘Tena metādiso vaṇṇo, tena me idha mijjhati; Uppajjanti ca me bhogā, ye keci manaso piyā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 62,
      "pali": "‘‘Akkhāmi te bhikkhu mahānubhāva, manussabhūtā yamakāsi puññaṃ; Tenamhi evaṃ jalitānubhāvā, vaṇṇo ca me sabbadisā pabhāsatī’’ti. Dutiyanāvāvimānaṃ sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}