{
  "id": "vv.93",
  "title": {
    "pali": "Serīsakavimānavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1228,
      "pali": "[pe. va. 604] Suṇotha yakkhassa ca vāṇijāna ca, samāgamo yattha tadā ahosi; Yathā kathaṃ itaritarena cāpi, subhāsitaṃ tañca suṇātha sabbe.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1229,
      "pali": "‘‘Yo so ahu rājā pāyāsi nāma [nāmo (sī.)], bhummānaṃ sahabyagato yasassī; So modamānova sake vimāne, amānuso mānuse ajjhabhāsīti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1230,
      "pali": "‘‘Vaṅke araññe amanussaṭṭhāne, kantāre appodake appabhakkhe; Suduggame vaṇṇupathassa majjhe, vaṅkaṃ bhayā [dhaṅkaṃbhayā (ka.)] naṭṭhamanā manussā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1231,
      "pali": "‘‘Nayidha phalā mūlamayā ca santi, upādānaṃ natthi kutodha bhakkho; Aññatra paṃsūhi ca vālukāhi ca, tatāhi uṇhāhi ca dāruṇāhi ca.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1232,
      "pali": "‘‘Ujjaṅgalaṃ tattamivaṃ kapālaṃ, anāyasaṃ paralokena tulyaṃ; Luddānamāvāsamidaṃ purāṇaṃ, bhūmippadeso abhisattarūpo.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1233,
      "pali": "‘‘Atha tumhe kena [kena nu (syā. ka.)] vaṇṇena, kimāsamānā imaṃ padesaṃ hi; Anupaviṭṭhā sahasā samecca, lobhā bhayā atha vā sampamūḷhā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1234,
      "pali": "‘‘Magadhesu aṅgesu ca satthavāhā, āropayitvā paṇiyaṃ puthuttaṃ; Te yāmase sindhusovīrabhūmiṃ, dhanatthikā uddayaṃ patthayānā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1235,
      "pali": "‘‘Divā pipāsaṃ nadhivāsayantā, yoggānukampañca samekkhamānā, Etena vegena āyāma sabbe [sabbe te (ka.)], rattiṃ maggaṃ paṭipannā vikāle.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1236,
      "pali": "‘‘Te duppayātā aparaddhamaggā, andhākulā vippanaṭṭhā araññe; Suduggame vaṇṇupathassa majjhe, disaṃ na jānāma pamūḷhacittā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1237,
      "pali": "‘‘Idañca disvāna adiṭṭhapubbaṃ, vimānaseṭṭhañca tavañca yakkha; Tatuttariṃ jīvitamāsamānā, disvā patītā sumanā udaggā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1238,
      "pali": "‘‘Pāraṃ samuddassa imañca vaṇṇuṃ [vanaṃ (syā.), vaṇṇaṃ (ka.)], vettācaraṃ [vettaṃ paraṃ (syā.), vettācāraṃ (ka.)] saṅkupathañca maggaṃ; Nadiyo pana pabbatānañca duggā, puthuddisā gacchatha bhogahetu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1239,
      "pali": "‘‘Pakkhandiyāna vijitaṃ paresaṃ, verajjake mānuse pekkhamānā; Yaṃ vo sutaṃ vā atha vāpi diṭṭhaṃ, accherakaṃ taṃ vo suṇoma tātā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1240,
      "pali": "‘‘Itopi accherataraṃ kumāra, na to sutaṃ vā atha vāpi diṭṭhaṃ; Atītamānussakameva sabbaṃ, disvāna tappāma anomavaṇṇaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1241,
      "pali": "‘‘Vehāyasaṃ pokkharañño savanti, pahūtamalyā [pahūtamālyā (syā.)] bahupuṇḍarīkā; Dumā cime [dumā ca te (syā. ka.)] niccaphalūpapannā, atīva gandhā surabhiṃ pavāyanti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1242,
      "pali": "‘‘Veḷūriyathambhā satamussitāse, silāpavāḷassa ca āyataṃsā; Masāragallā sahalohitaṅgā, thambhā ime jotirasāmayāse.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1243,
      "pali": "‘‘Sahassathambhaṃ atulānubhāvaṃ, tesūpari sādhumidaṃ vimānaṃ; Ratanantaraṃ kañcanavedimissaṃ, tapanīyapaṭṭehi ca sādhuchannaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1244,
      "pali": "‘‘Jambonaduttattamidaṃ sumaṭṭho, pāsādasopāṇaphalūpapanno; Daḷho ca vaggu ca susaṅgato ca [vaggu sumukho susaṅgato (sī.)], atīva nijjhānakhamo manuñño.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1245,
      "pali": "‘‘Ratanantarasmiṃ bahuannapānaṃ, parivārito accharāsaṅgaṇena; Murajaālambaratūriyaghuṭṭho, abhivanditosi thutivandanāya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1246,
      "pali": "‘‘So modasi nārigaṇappabodhano, vimānapāsādavare manorame; Acintiyo sabbaguṇūpapanno, rājā yathā vessavaṇo naḷinyā [naḷiññaṃ (ka.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1247,
      "pali": "‘‘Devo nu āsi udavāsi yakkho, udāhu devindo manussabhūto; Pucchanti taṃ vāṇijā satthavāhā, ācikkha ko nāma tuvaṃsi yakkho’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1248,
      "pali": "‘‘Serīsako [serissako (sī. syā.)] nāma ahamhi yakkho, kantāriyo vaṇṇupathamhi gutto; Imaṃ padesaṃ abhipālayāmi, vacanakaro vessavaṇassa rañño’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1249,
      "pali": "‘‘Adhiccaladdhaṃ pariṇāmajaṃ te, sayaṃ kataṃ udāhu devehi dinnaṃ; Pucchanti taṃ vāṇijā satthavāhā, kathaṃ tayā laddhamidaṃ manuñña’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1250,
      "pali": "‘‘Nādhiccaladdhaṃ na pariṇāmajaṃ me, na sayaṃ kataṃ na hi devehi dinnaṃ; Sakehi kammehi apāpakehi, puññehi me laddhamidaṃ manuñña’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1251,
      "pali": "‘‘Kiṃ te vataṃ kiṃ pana brahmacariyaṃ, kissa suciṇṇassa ayaṃ vipāko; Pucchanti taṃ vāṇijā satthavāhā, kathaṃ tayā laddhamidaṃ vimāna’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1252,
      "pali": "‘‘Mamaṃ pāyāsīti ahu samaññā, rajjaṃ yadā kārayiṃ kosalānaṃ; Natthikadiṭṭhi kadariyo pāpadhammo, ucchedavādī ca tadā ahosiṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1253,
      "pali": "‘‘Samaṇo ca kho āsi kumārakassapo, bahussuto cittakathī uḷāro; So me tadā dhammakathaṃ abhāsi [akāsi (sī.)], diṭṭhivisūkāni vinodayī me.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1254,
      "pali": "‘‘Tāhaṃ tassa [tāhaṃ (ka.)] dhammakathaṃ suṇitvā, upāsakattaṃ paṭivedayissaṃ; Pāṇātipātā virato ahosiṃ, loke adinnaṃ parivajjayissaṃ; Amajjapo no ca musā abhāṇiṃ, sakena dārena ca ahosi tuṭṭho.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1255,
      "pali": "‘‘Taṃ me vataṃ taṃ pana brahmacariyaṃ, tassa suciṇṇassa ayaṃ vipāko; Teheva kammehi apāpakehi, puññehi me laddhamidaṃ vimāna’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1256,
      "pali": "‘‘Saccaṃ kirāhaṃsu narā sapaññā, anaññathā vacanaṃ paṇḍitānaṃ; Yahiṃ yahiṃ gacchati puññakammo, tahiṃ tahiṃ modati kāmakāmī.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1257,
      "pali": "‘‘Yahiṃ yahiṃ sokapariddavo ca, vadho ca bandho ca parikkileso; Tahiṃ tahiṃ gacchati pāpakammo, na muccati duggatiyā kadācī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1258,
      "pali": "‘‘Sammūḷharūpova jano ahosi, asmiṃ muhutte kalalīkatova; Janassimassa tuyhañca kumāra, appaccayo kena nu kho ahosī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1259,
      "pali": "‘‘Ime ca sirīsavanā [ime sirīsūpavanā ca (sī.), imepi sirīsavanā ca (pī. ka.)] tātā, dibbā [dibbā ca (pī. ka.)] gandhā surabhī [surabhiṃ (sī. ka.)] sampavanti [sampavāyanti (ka.)]; Te sampavāyanti imaṃ vimānaṃ, divā ca ratto ca tamaṃ nihantvā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1260,
      "pali": "‘‘Imesañca kho vassasataccayena, sipāṭikā phalati ekamekā; Mānussakaṃ vassasataṃ atītaṃ, yadagge kāyamhi idhūpapanno.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1261,
      "pali": "‘‘Disvānahaṃ vassasatāni pañca, asmiṃ vimāne ṭhatvāna tātā; Āyukkhayā puññakkhayā cavissaṃ, teneva sokena pamucchitosmī’’ti [samucchitosmīti (pī. ka.)].",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1262,
      "pali": "‘‘Kathaṃ nu soceyya tathāvidho so, laddhā vimānaṃ atulaṃ cirāya; Ye cāpi kho ittaramupapannā, te nūna soceyyuṃ parittapuññā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1263,
      "pali": "‘‘Anucchaviṃ ovadiyañca me taṃ, yaṃ maṃ tumhe peyyavācaṃ vadetha; Tumhe ca kho tātā mayānuguttā, yenicchakaṃ tena paletha sotthi’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1264,
      "pali": "‘‘Gantvā mayaṃ sindhusovīrabhūmiṃ, dhanatthikā uddayaṃ patthayānā; Yathāpayogā paripuṇṇacāgā, kāhāma serīsamahaṃ uḷāra’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1265,
      "pali": "‘‘Mā ceva serīsamahaṃ akattha, sabbañca vo bhavissati yaṃ vadetha; Pāpāni kammāni vivajjayātha, dhammānuyogañca adhiṭṭhahātha.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1266,
      "pali": "‘‘Upāsako atthi imamhi saṅghe, bahussuto sīlavatūpapanno; Saddho ca cāgī ca supesalo ca, vicakkhaṇo santusito mutīmā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1267,
      "pali": "‘‘Sañjānamāno na musā bhaṇeyya, parūpaghātāya na cetayeyya; Vebhūtikaṃ pesuṇaṃ no kareyya, saṇhañca vācaṃ sakhilaṃ bhaṇeyya.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1268,
      "pali": "‘‘Sagāravo sappaṭisso vinīto, apāpako adhisīle visuddho; So mātaraṃ pitarañcāpi jantu, dhammena poseti ariyavutti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1269,
      "pali": "‘‘Maññe so mātāpitūnaṃ kāraṇā, bhogāni pariyesati na attahetu; Mātāpitūnañca yo [so (?)] accayena, nekkhammapoṇo carissati brahmacariyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1270,
      "pali": "‘‘Ujū avaṅko asaṭho amāyo, na lesakappena ca vohareyya; So tādiso sukatakammakārī, dhamme ṭhito kinti labhetha dukkhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1271,
      "pali": "‘‘Taṃ kāraṇā pātukatomhi attanā, tasmā dhammaṃ passatha vāṇijāse; Aññatra teniha bhasmī [bhasmi (syā.), bhasma (ka.)] bhavetha, andhākulā vippanaṭṭhā araññe; Taṃ khippamānena lahuṃ parena, sukho have sappurisena saṅgamo’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1272,
      "pali": "‘‘Kiṃ nāma so kiñca karoti kammaṃ, Kiṃ nāmadheyyaṃ kiṃ pana tassa gottaṃ; Mayampi naṃ daṭṭhukāmamha yakkha, yassānukampāya idhāgatosi; Lābhā hi tassa, yassa tuvaṃ pihesī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1273,
      "pali": "‘‘Yo kappako sambhavanāmadheyyo, Upāsako kocchaphalūpajīvī; Jānātha naṃ tumhākaṃ pesiyo so, Mā kho naṃ hīḷittha supesalo so’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1274,
      "pali": "‘‘Jānāmase yaṃ tvaṃ pavadesi [vadesi (sī.)] yakkha, Na kho naṃ jānāma sa edisoti; Mayampi naṃ pūjayissāma yakkha, Sutvāna tuyhaṃ vacanaṃ uḷāra’’nti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1275,
      "pali": "‘‘Ye keci imasmiṃ satthe manussā, Daharā mahantā athavāpi majjhimā; Sabbeva te ālambantu vimānaṃ, Passantu puññānaṃ phalaṃ kadariyā’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1276,
      "pali": "Te tattha sabbeva ‘ahaṃ pure’ti, Taṃ kappakaṃ tattha purakkhatvā [purakkhipitvā (sī.)]; Sabbeva te ālambiṃsu vimānaṃ, Masakkasāraṃ viya vāsavassa.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1277,
      "pali": "Te tattha sabbeva ‘ahaṃ pure’ti, upāsakattaṃ paṭivedayiṃsu; Pāṇātipātā viratā ahesuṃ, loke adinnaṃ parivajjayiṃsu; Amajjapā no ca musā bhaṇiṃsu, sakena dārena ca ahesuṃ tuṭṭhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1278,
      "pali": "Te tattha sabbeva ‘ahaṃ pure’ti, upāsakattaṃ paṭivedayitvā; Pakkāmi sattho anumodamāno, yakkhiddhiyā anumato punappunaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1279,
      "pali": "‘‘Gantvāna te sindhusovīrabhūmiṃ, dhanatthikā uddayaṃ [udaya (pī. ka.)] patthayānā; Yathāpayogā paripuṇṇalābhā, paccāgamuṃ pāṭaliputtamakkhataṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1280,
      "pali": "‘‘Gantvāna te saṅgharaṃ sotthivanto, Puttehi dārehi samaṅgibhūtā; Ānandī vittā [ānandacittā (syā.), ānandīcittā (ka.)] sumanā patītā, Akaṃsu serīsamahaṃ uḷāraṃ; Serīsakaṃ te pariveṇaṃ māpayiṃsu.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1281,
      "pali": "Etādisā sappurisāna sevanā, Mahatthikā dhammaguṇāna sevanā; Ekassa atthāya upāsakassa, Sabbeva sattā sukhitā [sukhino (pī. ka.)] ahesunti. Serīsakavimānaṃ dasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}