{
  "id": "vv.94",
  "title": {
    "pali": "Sunikkhittavimānavatthu",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1282,
      "pali": "‘‘Uccamidaṃ maṇithūṇaṃ vimānaṃ, samantato dvādasa yojanāni; Kūṭāgārā sattasatā uḷārā, veḷuriyathambhā rucakatthatā subhā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1283,
      "pali": "‘‘Tatthacchasi pivasi khādasi ca, dibbā ca vīṇā pavadanti vagguṃ; Dibbā rasā kāmaguṇettha pañca, nāriyo ca naccanti suvaṇṇachannā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1284,
      "pali": "‘‘Kena tetādiso vaṇṇo, kena te idha mijjhati; Uppajjanti ca te bhogā, ye keci manaso piyā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1285,
      "pali": "‘‘Pucchāmi ‘taṃ deva mahānubhāva, manussabhūto kimakāsi puññaṃ; Kenāsi evaṃ jalitānubhāvo, vaṇṇo ca te sabbadisā pabhāsatī’’ti.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1286,
      "pali": "So devaputto attamano, moggallānena pucchito; Pañhaṃ puṭṭho viyākāsi, yassa kammassidaṃ phalaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1287,
      "pali": "‘‘Dunnikkhittaṃ mālaṃ sunikkhipitvā, patiṭṭhapetvā sugatassa thūpe; Mahiddhiko camhi mahānubhāvo, dibbehi kāmehi samaṅgibhūto.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1288,
      "pali": "‘‘Tena metādiso vaṇṇo, Tena me idha mijjhati; Uppajjanti ca me bhogā, Ye keci manaso piyā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 1289,
      "pali": "‘‘Akkhāmi te bhikkhu mahānubhāva, Manussabhūto yamahaṃ akāsiṃ; Tenamhi evaṃ jalitānubhāvo, Vaṇṇo ca me sabbadisā pabhāsatī’’ti. Sunikkhittavimānaṃ ekādasamaṃ. Sunikkhittavaggo sattamo niṭṭhito. Tassuddānaṃ – Dve daliddā vanavihārā, bhatako gopālakaṇḍakā; Anekavaṇṇamaṭṭhakuṇḍalī, serīsako sunikkhittaṃ; Purisānaṃ tatiyo vaggo pavuccatīti. Bhāṇavāraṃ catutthaṃ niṭṭhitaṃ. Vimānavatthupāḷi niṭṭhitā.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "",
    "english": "",
    "sinhala": ""
  }
}