{
  "id": "iti.5",
  "title": {
    "pali": "Dukanipāto - Dutiyavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 38,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tathāgataṃ, bhikkhave, arahantaṃ sammāsambuddhaṃ dve vitakkā bahulaṃ samudācaranti – khemo ca vitakko, paviveko ca [viveko ca (syā.)]. Abyāpajjhārāmo [abyāpajjārāmo (ka.), abyābajjhārāmo (?)], bhikkhave, tathāgato abyāpajjharato. Tamenaṃ, bhikkhave, tathāgataṃ abyāpajjhārāmaṃ abyāpajjharataṃ eseva vitakko bahulaṃ samudācarati – ‘imāyāhaṃ iriyāya na kiñci byābādhemi tasaṃ vā thāvaraṃ vā’ti. ‘‘Pavivekārāmo, bhikkhave, tathāgato pavivekarato. Tamenaṃ, bhikkhave, tathāgataṃ pavivekārāmaṃ pavivekarataṃ eseva vitakko bahulaṃ samudācarati – ‘yaṃ akusalaṃ taṃ pahīna’nti. ‘‘Tasmātiha, bhikkhave, tumhepi abyāpajjhārāmā viharatha abyāpajjharatā. Tesaṃ vo, bhikkhave, tumhākaṃ abyāpajjhārāmānaṃ viharataṃ abyāpajjharatānaṃ eseva vitakko bahulaṃ samudācarissati – ‘imāya mayaṃ iriyāya na kiñci byābādhema tasaṃ vā thāvaraṃ vā’ti. ‘‘Pavivekārāmā, bhikkhave, viharatha pavivekaratā. Tesaṃ vo, bhikkhave, tumhākaṃ pavivekārāmānaṃ viharataṃ pavivekaratānaṃ eseva vitakko bahulaṃ samudācarissati – ‘kiṃ akusalaṃ, kiṃ appahīnaṃ, kiṃ pajahāmā’’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Tathāgataṃ buddhamasayhasāhinaṃ, duve vitakkā samudācaranti naṃ; Khemo vitakko paṭhamo udīrito, tato viveko dutiyo pakāsito. ‘‘Tamonudaṃ pāragataṃ mahesiṃ, taṃ pattipattaṃ vasimaṃ anāsavaṃ; Visantaraṃ [vesantaraṃ (sī. ka.), vissantaraṃ (pī.)] taṇhakkhaye vimuttaṃ, taṃ ve muniṃ antimadehadhāriṃ; Mārañjahaṃ [mārajahaṃ (syā.), mānajahaṃ (sī. ka.), mānaṃ jahaṃ (pī.)] brūmi jarāya pāraguṃ. ‘‘Sele yathā pabbatamuddhaniṭṭhito, yathāpi passe janataṃ samantato; Tathūpamaṃ dhammamayaṃ sumedho, pāsādamāruyha samantacakkhu; Sokāvatiṇṇaṃ janatamapetasoko, avekkhati jātijarābhibhūta’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Vitakkasuttaṃ"
    },
    {
      "number": 39,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tathāgatassa, bhikkhave, arahato sammāsambuddhassa dve dhammadesanā pariyāyena bhavanti. Katamā dve? ‘Pāpaṃ pāpakato passathā’ti – ayaṃ paṭhamā dhammadesanā; ‘pāpaṃ pāpakato disvā tattha nibbindatha virajjatha vimuccathā’ti – ayaṃ dutiyā dhammadesanā. Tathāgatassa, bhikkhave, arahato sammāsambuddhassa imā dve dhammadesanā pariyāyena bhavantī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Tathāgatassa buddhassa, sabbabhūtānukampino; Pariyāyavacanaṃ passa, dve ca dhammā pakāsitā. ‘‘Pāpakaṃ passatha cetaṃ [cekaṃ (sī. pī.), chekā (syā.)], tattha cāpi virajjatha; Tato virattacittāse, dukkhassantaṃ karissathā’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Desanāsuttaṃ"
    },
    {
      "number": 40,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Avijjā, bhikkhave, pubbaṅgamā akusalānaṃ dhammānaṃ samāpattiyā anvadeva ahirikaṃ anottappaṃ; vijjā ca kho, bhikkhave, pubbaṅgamā kusalānaṃ dhammānaṃ samāpattiyā anvadeva hirottappa’’nti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yā kācimā duggatiyo, asmiṃ loke paramhi ca; Avijjāmūlikā sabbā, icchālobhasamussayā. ‘‘Yato ca hoti pāpiccho, ahirīko anādaro; Tato pāpaṃ pasavati, apāyaṃ tena gacchati. ‘‘Tasmā chandañca lobhañca, avijjañca virājayaṃ; Vijjaṃ uppādayaṃ bhikkhu, sabbā duggatiyo jahe’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Vijjāsuttaṃ"
    },
    {
      "number": 41,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Te, bhikkhave, sattā suparihīnā ye ariyāya paññāya parihīnā. Te diṭṭheva dhamme dukkhaṃ viharanti savighātaṃ saupāyāsaṃ sapariḷāhaṃ; kāyassa bhedā paraṃ maraṇā duggati pāṭikaṅkhā. Te [te ca kho (?)], bhikkhave, sattā aparihīnā ye ariyāya paññāya aparihīnā. Te diṭṭheva dhamme sukhaṃ viharanti avighātaṃ anupāyāsaṃ apariḷāhaṃ; kāyassa bhedā paraṃ maraṇā sugati pāṭikaṅkhā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Paññāya parihānena, passa lokaṃ sadevakaṃ; Niviṭṭhaṃ nāmarūpasmiṃ, idaṃ saccanti maññati. ‘‘Paññā hi seṭṭhā lokasmiṃ, yāyaṃ nibbedhagāminī; Yāya sammā pajānāti, jātibhavaparikkhayaṃ. ‘‘Tesaṃ devā manussā ca, sambuddhānaṃ satīmataṃ; Pihayanti hāsapaññānaṃ [hāsupaññānaṃ (sī. aṭṭha.)], sarīrantimadhārina’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paññāparihīnasuttaṃ"
    },
    {
      "number": 42,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dveme, bhikkhave, sukkā dhammā lokaṃ pālenti. Katame dve? Hirī [hiri (sī. syā. kaṃ. pī.)] ca, ottappañca. Ime ce, bhikkhave, dve sukkā dhammā lokaṃ na pāleyyuṃ, nayidha paññāyetha mātāti vā mātucchāti vā mātulānīti vā ācariyabhariyāti vā garūnaṃ dārāti vā. Sambhedaṃ loko agamissa yathā ajeḷakā kukkuṭasūkarā soṇasiṅgālā [soṇasigālā (sī. syā. kaṃ. pī.)]. Yasmā ca kho, bhikkhave, ime dve sukkā dhammā lokaṃ pālenti tasmā paññāyati mātāti vā mātucchāti vā mātulānīti vā ācariyabhariyāti vā garūnaṃ dārāti vā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yesaṃ ce hiriottappaṃ, sabbadā ca na vijjati; Vokkantā sukkamūlā te, jātimaraṇagāmino. ‘‘Yesañca hiriottappaṃ, sadā sammā upaṭṭhitā; Virūḷhabrahmacariyā te, santo khīṇapunabbhavā’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sukkadhammasuttaṃ"
    },
    {
      "number": 43,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Atthi, bhikkhave, ajātaṃ abhūtaṃ akataṃ asaṅkhataṃ. No cetaṃ, bhikkhave, abhavissa ajātaṃ abhūtaṃ akataṃ asaṅkhataṃ, nayidha jātassa bhūtassa katassa saṅkhatassa nissaraṇaṃ paññāyetha. Yasmā ca kho, bhikkhave, atthi ajātaṃ abhūtaṃ akataṃ asaṅkhataṃ, tasmā jātassa bhūtassa katassa saṅkhatassa nissaraṇaṃ paññāyatī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Jātaṃ bhūtaṃ samuppannaṃ, kataṃ saṅkhatamaddhuvaṃ; Jarāmaraṇasaṅghāṭaṃ, roganīḷaṃ [roganiḍḍhaṃ (sī.)] pabhaṅguraṃ [pabhaṅgunaṃ (ka. sī. ka.), pabhaṅguṇaṃ (syā.)]. ‘‘Āhāranettippabhavaṃ, nālaṃ tadabhinandituṃ; Tassa nissaraṇaṃ santaṃ, atakkāvacaraṃ dhuvaṃ. ‘‘Ajātaṃ asamuppannaṃ, asokaṃ virajaṃ padaṃ; Nirodho dukkhadhammānaṃ, saṅkhārūpasamo sukho’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Ajātasuttaṃ"
    },
    {
      "number": 44,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dvemā, bhikkhave, nibbānadhātuyo. Katame dve? Saupādisesā ca nibbānadhātu, anupādisesā ca nibbānadhātu. ‘‘Katamā ca, bhikkhave, saupādisesā nibbānadhātu? Idha, bhikkhave, bhikkhu arahaṃ hoti khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto. Tassa tiṭṭhanteva pañcindriyāni yesaṃ avighātattā [avigatattā (sī. aṭṭha.)] manāpāmanāpaṃ paccanubhoti, sukhadukkhaṃ paṭisaṃvedeti. Tassa yo rāgakkhayo, dosakkhayo, mohakkhayo – ayaṃ vuccati, bhikkhave, saupādisesā nibbānadhātu. ‘‘Katamā ca, bhikkhave, anupādisesā nibbānadhātu? Idha, bhikkhave, bhikkhu arahaṃ hoti khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto. Tassa idheva, bhikkhave, sabbavedayitāni anabhinanditāni sīti bhavissanti [sītībhavissanti (?)]. Ayaṃ vuccati, bhikkhave, anupādisesā nibbānadhātu. Imā kho, bhikkhave, dve nibbānadhātuyo’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Duve imā cakkhumatā pakāsitā, nibbānadhātū anissitena tādinā; Ekā hi dhātu idha diṭṭhadhammikā, saupādisesā bhavanettisaṅkhayā; Anupādisesā pana samparāyikā, yamhi nirujjhanti bhavāni sabbaso. ‘‘Ye etadaññāya padaṃ asaṅkhataṃ, vimuttacittā bhavanettisaṅkhayā; Te dhammasārādhigamā khaye ratā, pahaṃsu te sabbabhavāni tādino’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nibbānadhātusuttaṃ"
    },
    {
      "number": 45,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Paṭisallānārāmā [paṭisallānārāmā (ka.)], bhikkhave, viharatha paṭisallānaratā, ajjhattaṃ cetosamathamanuyuttā, anirākatajjhānā, vipassanāya samannāgatā, brūhetā suññāgārānaṃ. Paṭisallānārāmānaṃ, bhikkhave, viharataṃ paṭisallānaratānaṃ ajjhattaṃ cetosamathamanuyuttānaṃ anirākatamajjhānānaṃ vipassanāya samannāgatānaṃ brūhetānaṃ suññāgārānaṃ dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Ye santacittā nipakā, satimanto ca [satimantova (sī. ka.)] jhāyino; Sammā dhammaṃ vipassanti, kāmesu anapekkhino. ‘‘Appamādaratā santā, pamāde bhayadassino; Abhabbā parihānāya, nibbānasseva santike’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭisallānasuttaṃ"
    },
    {
      "number": 46,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Sikkhānisaṃsā, bhikkhave, viharatha paññuttarā vimuttisārā satādhipateyyā. Sikkhānisaṃsānaṃ, bhikkhave, viharataṃ paññuttarānaṃ vimuttisārānaṃ satādhipateyyānaṃ dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Paripuṇṇasikkhaṃ [paripuṇṇasekhaṃ (sī.), paripuṇṇasekkhaṃ (syā.)] apahānadhammaṃ, paññuttaraṃ jātikhayantadassiṃ; Taṃ ve muniṃ antimadehadhāriṃ, mārañjahaṃ brūmi jarāya pāraguṃ. ‘‘Tasmā sadā jhānaratā samāhitā, ātāpino jātikhayantadassino; Māraṃ sasenaṃ abhibhuyya bhikkhavo, bhavatha jātimaraṇassa pāragā’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sikkhānisaṃsasuttaṃ"
    },
    {
      "number": 47,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Jāgaro cassa, bhikkhave, bhikkhu vihareyya sato sampajāno samāhito pamudito vippasanno ca tattha kālavipassī ca kusalesu dhammesu. Jāgarassa, bhikkhave, bhikkhuno viharato satassa sampajānassa samāhitassa pamuditassa vippasannassa tattha kālavipassino kusalesu dhammesu dvinnaṃ phalānaṃ aññataraṃ phalaṃ pāṭikaṅkhaṃ – diṭṭheva dhamme aññā, sati vā upādisese anāgāmitā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Jāgarantā suṇāthetaṃ, ye suttā te pabujjhatha; Suttā jāgaritaṃ seyyo, natthi jāgarato bhayaṃ. ‘‘Yo jāgaro ca satimā sampajāno, samāhito mudito vippasanno ca; Kālena so sammā dhammaṃ parivīmaṃsamāno, ekodibhūto vihane tamaṃ so. ‘‘Tasmā have jāgariyaṃ bhajetha, ātāpī bhikkhu nipako jhānalābhī; Saṃyojanaṃ jātijarāya chetvā, idheva sambodhimanuttaraṃ phuse’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Jāgariyasuttaṃ"
    },
    {
      "number": 48,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dveme, bhikkhave, āpāyikā nerayikā idamappahāya. Katame dve? Yo ca abrahmacārī brahmacāripaṭiñño, yo ca paripuṇṇaṃ parisuddhaṃ brahmacariyaṃ carantaṃ amūlakena abrahmacariyena anuddhaṃseti. Ime kho, bhikkhave, dve āpāyikā nerayikā idamappahāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Abhūtavādī nirayaṃ upeti, yo vāpi katvā na karomi cāha; Ubhopi te pecca samā bhavanti, nihīnakammā manujā parattha. ‘‘Kāsāvakaṇṭhā bahavo, pāpadhammā asaññatā; Pāpā pāpehi kammehi, nirayaṃ te upapajjare. ‘‘Seyyo ayoguḷo bhutto, tatto aggisikhūpamo; Yañce bhuñjeyya dussīlo, raṭṭhapiṇḍamasaññato’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Ekādasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Āpāyikasuttaṃ"
    },
    {
      "number": 49,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dvīhi, bhikkhave, diṭṭhigatehi pariyuṭṭhitā devamanussā olīyanti eke, atidhāvanti eke; cakkhumanto ca passanti. ‘‘Kathañca, bhikkhave, olīyanti eke? Bhavārāmā, bhikkhave, devamanussā bhavaratā bhavasammuditā tesaṃ bhavanirodhāya dhamme desiyamāne cittaṃ na pakkhandati na pasīdati na santiṭṭhati nādhimuccati. Evaṃ kho, bhikkhave, olīyanti eke. ‘‘Kathañca, bhikkhave, atidhāvanti eke? Bhaveneva kho paneke aṭṭīyamānā harāyamānā jigucchamānā vibhavaṃ abhinandanti – yato kira, bho, ayaṃ attā [satto (sī. ka.)] kāyassa bhedā paraṃ maraṇā ucchijjati vinassati na hoti paraṃ maraṇā; etaṃ santaṃ etaṃ paṇītaṃ etaṃ yāthāvanti. Evaṃ kho, bhikkhave, atidhāvanti eke. ‘‘Kathañca, bhikkhave, cakkhumanto passanti? Idha bhikkhu bhūtaṃ bhūtato passati; bhūtaṃ bhūtato disvā bhūtassa nibbidāya virāgāya nirodhāya paṭipanno hoti. Evaṃ kho, bhikkhave, cakkhumanto passantī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Ye [yo (syā. ka.)] bhūtaṃ bhūtato disvā, bhūtassa ca atikkamaṃ; Yathābhūte vimuccanti, bhavataṇhā parikkhayā. ‘‘Sa ve [sace (ka. sī. syā. pī.)] bhūtapariñño, so vītataṇho bhavābhave; Bhūtassa vibhavā bhikkhu, nāgacchati punabbhava’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Dvādasamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Diṭṭhigatasuttaṃ"
    }
  ],
  "footer": {
    "pali": " Dutiyo vaggo niṭṭhito. Tassuddānaṃ – Dve indriyā dve tapanīyā, sīlena apare duve; Anottāpī kuhanā dve ca, saṃvejanīyena te dasa. Vitakkā desanā vijjā, paññā dhammena pañcamaṃ; Ajātaṃ dhātusallānaṃ, sikkhā jāgariyena ca; Apāyadiṭṭhiyā ceva [yeva (sī. syā.)], bāvīsati pakāsitāti. Dukanipāto niṭṭhito.",
    "english": "",
    "sinhala": ""
  }
}