{
  "id": "iti.9",
  "title": {
    "pali": "Tikanipāto - Catutthavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 80,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, akusalavitakkā. Katame tayo? Anavaññattipaṭisaṃyutto vitakko, lābhasakkārasilokapaṭisaṃyutto vitakko, parānuddayatāpaṭisaṃyutto vitakko. Ime kho, bhikkhave, tayo akusalavitakkā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Anavaññattisaṃyutto, lābhasakkāragāravo; Sahanandī amaccehi, ārā saṃyojanakkhayā. ‘‘Yo ca puttapasuṃ hitvā, vivāhe saṃharāni [saṅgahāni (ka. sī. syā. pī.)] ca; Bhabbo so tādiso bhikkhu, phuṭṭhuṃ sambodhimuttama’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Vitakkasuttaṃ"
    },
    {
      "number": 81,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Diṭṭhā mayā, bhikkhave, sattā sakkārena abhibhūtā, pariyādinnacittā, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. ‘‘Diṭṭhā mayā, bhikkhave, sattā asakkārena abhibhūtā, pariyādinnacittā, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. ‘‘Diṭṭhā mayā, bhikkhave, sattā sakkārena ca asakkārena ca tadubhayena abhibhūtā, pariyādinnacittā, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. ‘‘Taṃ kho panāhaṃ, bhikkhave, nāññassa samaṇassa vā brāhmaṇassa vā sutvā vadāmi; ( ) [(diṭṭhā mayā bhikkhave sattā sakkārena abhibhūtā. …pe… asakkārena abhibhūtā …pe… sakkārena ca asakkārena ca tadubhayena abhibhūtā pariyādinnacittā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā.) (syā.) purimavagge micchādiṭṭhikasammādiṭṭhikasuttehi pana sameti, anvayabyatirekavākyānaṃ pana anantaritattā pāsaṃsatarā.)] api ca, bhikkhave, yadeva me sāmaṃ ñātaṃ sāmaṃ diṭṭhaṃ sāmaṃ viditaṃ tamevāhaṃ vadāmi. ‘‘Diṭṭhā mayā, bhikkhave, sattā sakkārena abhibhūtā, pariyādinnacittā, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. ‘‘Diṭṭhā mayā, bhikkhave, sattā asakkārena abhibhūtā, pariyādinnacittā, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. ‘‘Diṭṭhā mayā, bhikkhave, sattā sakkārena ca asakkārena ca tadubhayena abhibhūtā, pariyādinnacittā, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yassa sakkariyamānassa, asakkārena cūbhayaṃ; Samādhi na vikampati, appamādavihārino [appamāṇavihārino (sī. aṭṭha.)]. ‘‘Taṃ jhāyinaṃ sātatikaṃ, sukhumaṃ diṭṭhivipassakaṃ; Upādānakkhayārāmaṃ, āhu sappuriso itī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sakkārasuttaṃ"
    },
    {
      "number": 82,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, devesu devasaddā niccharanti samayā samayaṃ upādāya. Katame tayo? Yasmiṃ, bhikkhave, samaye ariyasāvako kesamassuṃ ohāretvā kāsāyāni vatthāni acchādetvā agārasmā anagāriyaṃ pabbajjāya ceteti, tasmiṃ samaye [tasmiṃ bhikkhave samaye (pī. ka.)] devesu devasaddo niccharati – ‘eso ariyasāvako mārena saddhiṃ saṅgāmāya cetetī’ti. Ayaṃ, bhikkhave, paṭhamo devesu devasaddo niccharati samayā samayaṃ upādāya. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ samaye ariyasāvako sattannaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogamanuyutto viharati, tasmiṃ samaye devesu devasaddo niccharati – ‘eso ariyasāvako mārena saddhiṃ saṅgāmetī’ti. Ayaṃ, bhikkhave, dutiyo devesu devasaddo niccharati samayā samayaṃ upādāya. ‘‘Puna caparaṃ, bhikkhave, yasmiṃ samaye ariyasāvako āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati, tasmiṃ samaye devesu devasaddo niccharati – ‘eso ariyasāvako vijitasaṅgāmo tameva saṅgāmasīsaṃ abhivijiya ajjhāvasatī’ti. Ayaṃ, bhikkhave, tatiyo devesu devasaddo niccharati samayā samayaṃ upādāya. Ime kho, bhikkhave, tayo devesu devasaddā niccharanti samayā samayaṃ upādāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Disvā vijitasaṅgāmaṃ, sammāsambuddhasāvakaṃ; Devatāpi namassanti, mahantaṃ vītasāradaṃ. ‘‘Namo te purisājañña, yo tvaṃ dujjayamajjhabhū; Jetvāna maccuno senaṃ, vimokkhena anāvaraṃ. ‘‘Iti hetaṃ namassanti, devatā pattamānasaṃ; Tañhi tassa na passanti, yena maccuvasaṃ vaje’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Devasaddasuttaṃ"
    },
    {
      "number": 83,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Yadā, bhikkhave, devo devakāyā cavanadhammo hoti, pañcassa pubbanimittāni pātubhavanti – mālā milāyanti, vatthāni kilissanti, kacchehi sedā muccanti, kāye dubbaṇṇiyaṃ okkamati, sake devo devāsane nābhiramatīti. Tamenaṃ, bhikkhave, devā ‘cavanadhammo ayaṃ devaputto’ti iti viditvā tīhi vācāhi anumodenti [anumodanti (sī. syā. pī.)] – ‘ito, bho, sugatiṃ gaccha, sugatiṃ gantvā suladdhalābhaṃ labha, suladdhalābhaṃ labhitvā suppatiṭṭhito bhavāhī’’’ti. Evaṃ vutte, aññataro bhikkhu bhagavantaṃ etadavoca – ‘‘kinnu kho, bhante, devānaṃ sugatigamanasaṅkhātaṃ; kiñca, bhante, devānaṃ suladdhalābhasaṅkhātaṃ; kiṃ pana, bhante, devānaṃ suppatiṭṭhitasaṅkhāta’’nti? ‘‘Manussattaṃ kho, bhikkhu [bhikkhave (syā. pī.)], devānaṃ sugatigamanasaṅkhātaṃ; yaṃ manussabhūto samāno tathāgatappavedite dhammavinaye saddhaṃ paṭilabhati. Idaṃ kho, bhikkhu [bhikkhave (syā. pī.)], devānaṃ suladdhalābhasaṅkhātaṃ; sā kho panassa saddhā niviṭṭhā hoti mūlajātā patiṭṭhitā daḷhā asaṃhāriyā samaṇena vā brāhmaṇena vā devena vā mārena vā brahmunā vā kenaci vā lokasmiṃ. Idaṃ kho, bhikkhu [bhikkhave (syā. pī.)], devānaṃ suppatiṭṭhitasaṅkhāta’’nti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yadā devo devakāyā, cavati āyusaṅkhayā; Tayo saddā niccharanti, devānaṃ anumodataṃ. ‘‘‘Ito bho sugatiṃ gaccha, manussānaṃ sahabyataṃ; Manussabhūto saddhamme, labha saddhaṃ anuttaraṃ. ‘‘‘Sā te saddhā niviṭṭhassa, mūlajātā patiṭṭhitā; Yāvajīvaṃ asaṃhīrā, saddhamme suppavedite. ‘‘‘Kāyaduccaritaṃ hitvā, vacīduccaritāni ca; Manoduccaritaṃ hitvā, yañcaññaṃ dosasañhitaṃ. ‘‘‘Kāyena kusalaṃ katvā, vācāya kusalaṃ bahuṃ; Manasā kusalaṃ katvā, appamāṇaṃ nirūpadhiṃ. ‘‘‘Tato opadhikaṃ puññaṃ, katvā dānena taṃ bahuṃ; Aññepi macce saddhamme, brahmacariye nivesaya’ [nivesaye (sī. syā.)]. ‘‘Imāya anukampāya, devā devaṃ yadā vidū; Cavantaṃ anumodenti, ehi deva punappuna’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Pañcapubbanimittasuttaṃ"
    },
    {
      "number": 84,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome puggalā loke uppajjamānā uppajjanti bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Katame tayo? Idha, bhikkhave, tathāgato loke uppajjati arahaṃ sammāsambuddho vijjācaraṇasampanno sugato lokavidū anuttaro purisadammasārathi satthā devamanussānaṃ buddho bhagavā. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Ayaṃ, bhikkhave, paṭhamo puggalo loke uppajjamāno uppajjati bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. ‘‘Puna caparaṃ, bhikkhave, tasseva satthu [satthuno (syā.)] sāvako arahaṃ hoti khīṇāsavo vusitavā katakaraṇīyo ohitabhāro anuppattasadattho parikkhīṇabhavasaṃyojano sammadaññā vimutto. So dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Ayaṃ, bhikkhave, dutiyo puggalo loke uppajjamāno uppajjati bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. ‘‘Puna caparaṃ, bhikkhave, tasseva satthu sāvako sekho hoti pāṭipado bahussuto sīlavatūpapanno. Sopi [so (?)] dhammaṃ deseti ādikalyāṇaṃ majjhekalyāṇaṃ pariyosānakalyāṇaṃ sātthaṃ sabyañjanaṃ, kevalaparipuṇṇaṃ parisuddhaṃ brahmacariyaṃ pakāseti. Ayaṃ, bhikkhave, tatiyo puggalo loke uppajjamāno uppajjati bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussānaṃ. Ime kho, bhikkhave, tayo puggalā loke uppajjamānā uppajjanti bahujanahitāya bahujanasukhāya lokānukampāya atthāya hitāya sukhāya devamanussāna’’nti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Satthā hi loke paṭhamo mahesi, tassanvayo sāvako bhāvitatto; Athāparo pāṭipadopi sekho, bahussuto sīlavatūpapanno. ‘‘Ete tayo devamanussaseṭṭhā, pabhaṅkarā dhammamudīrayantā; Apāpuranti [apāpurenti (ka.)] amatassa dvāraṃ, yogā pamocenti [yāgā pamuccanti (sī.), yogā mocanti (syā.)] hujjanaṃ te. ‘‘Ye satthavāhena anuttarena, sudesitaṃ maggamanukkamanti [maggamanuggamanti (sī. ka.)]; Idheva dukkhassa karonti antaṃ, ye appamattā sugatassa sāsane’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Bahujanahitasuttaṃ"
    },
    {
      "number": 85,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Asubhānupassī, bhikkhave, kāyasmiṃ viharatha; ānāpānassati ca vo ajjhattaṃ parimukhaṃ sūpaṭṭhitā hotu; sabbasaṅkhāresu aniccānupassino viharatha. Asubhānupassīnaṃ, bhikkhave, kāyasmiṃ viharataṃ yo subhāya dhātuyā rāgānusayo so pahīyati [pahiyyati (ka.)]. Ānāpānassatiyā ajjhattaṃ parimukhaṃ sūpaṭṭhititāya ye bāhirā vitakkāsayā vighātapakkhikā, te na honti. Sabbasaṅkhāresu aniccānupassīnaṃ viharataṃ yā avijjā sā pahīyati, yā vijjā sā uppajjatī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Asubhānupassī kāyasmiṃ, ānāpāne paṭissato; Sabbasaṅkhārasamathaṃ, passaṃ ātāpi sabbadā. ‘‘Sa ve sammaddaso bhikkhu, yato tattha vimuccati; Abhiññāvosito santo, sa ve yogātigo munī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Asubhānupassīsuttaṃ"
    },
    {
      "number": 86,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dhammānudhammapaṭipannassa bhikkhuno ayamanudhammo hoti veyyākaraṇāya – dhammānudhammapaṭipannoyanti bhāsamāno dhammaññeva bhāsati no adhammaṃ, vitakkayamāno vā dhammavitakkaññeva vitakketi no adhammavitakkaṃ, tadubhayaṃ vā pana abhinivejjetvā upekkhako viharati sato sampajāno’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Dhammārāmo dhammarato, dhammaṃ anuvicintayaṃ; Dhammaṃ anussaraṃ bhikkhu, saddhammā na parihāyati. ‘‘Caraṃ vā yadi vā tiṭṭhaṃ, nisinno uda vā sayaṃ; Ajjhattaṃ samayaṃ cittaṃ, santimevādhigacchatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dhammānudhammapaṭipannasuttaṃ"
    },
    {
      "number": 87,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, akusalavitakkā andhakaraṇā acakkhukaraṇā aññāṇakaraṇā paññānirodhikā vighātapakkhikā anibbānasaṃvattanikā. Katame tayo? Kāmavitakko, bhikkhave, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko. Byāpādavitakko, bhikkhave, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko. Vihiṃsāvitakko, bhikkhave, andhakaraṇo acakkhukaraṇo aññāṇakaraṇo paññānirodhiko vighātapakkhiko anibbānasaṃvattaniko. Ime kho, bhikkhave, tayo akusalavitakkā andhakaraṇā acakkhukaraṇā aññāṇakaraṇā paññānirodhikā vighātapakkhikā anibbānasaṃvattanikā. ‘‘Tayome, bhikkhave, kusalavitakkā anandhakaraṇā cakkhukaraṇā ñāṇakaraṇā paññāvuddhikā avighātapakkhikā nibbānasaṃvattanikā. Katame tayo? Nekkhammavitakko, bhikkhave, anandhakaraṇo cakkhukaraṇo ñāṇakaraṇo paññāvuddhiko avighātapakkhiko nibbānasaṃvattaniko. Abyāpādavitakko, bhikkhave, anandhakaraṇo cakkhukaraṇo ñāṇakaraṇo paññāvuddhiko avighātapakkhiko nibbānasaṃvattaniko. Avihiṃsāvitakko, bhikkhave, anandhakaraṇo cakkhukaraṇo ñāṇakaraṇo paññāvuddhiko avighātapakkhiko nibbānasaṃvattaniko. Ime kho, bhikkhave, tayo kusalavitakkā anandhakaraṇā cakkhukaraṇā ñāṇakaraṇā paññāvuddhikā avighātapakkhikā nibbānasaṃvattanikā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Tayo vitakke kusale vitakkaye, tayo pana akusale nirākare; Sa ve vitakkāni vicāritāni, sameti vuṭṭhīva rajaṃ samūhataṃ; Sa ve vitakkūpasamena cetasā, idheva so santipadaṃ samajjhagā’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Andhakaraṇasuttaṃ"
    },
    {
      "number": 88,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, antarāmalā antarāamittā antarāsapattā antarāvadhakā antarāpaccatthikā. Katame tayo? Lobho, bhikkhave, antarāmalo antarāamitto antarāsapatto antarāvadhako antarāpaccatthiko. Doso, bhikkhave, antarāmalo antarāamitto antarāsapatto antarāvadhako antarāpaccatthiko. Moho, bhikkhave, antarāmalo antarāamitto antarāsapatto antarāvadhako antarāpaccatthiko. Ime kho, bhikkhave, tayo antarāmalā antarāamittā antarāsapattā antarāvadhakā antarāpaccatthikā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Anatthajanano lobho, lobho cittappakopano; Bhayamantarato jātaṃ, taṃ jano nāvabujjhati. ‘‘Luddho atthaṃ na jānāti, luddho dhammaṃ na passati; Andhatamaṃ [andhaṃ tamaṃ (sī.)] tadā hoti, yaṃ lobho sahate naraṃ. ‘‘Yo ca lobhaṃ pahantvāna, lobhaneyye na lubbhati; Lobho pahīyate tamhā, udabindūva pokkharā. ‘‘Anatthajanano doso, doso cittappakopano; Bhayamantarato jātaṃ, taṃ jano nāvabujjhati. ‘‘Duṭṭho atthaṃ na jānāti, duṭṭho dhammaṃ na passati; Andhatamaṃ tadā hoti, yaṃ doso sahate naraṃ. ‘‘Yo ca dosaṃ pahantvāna, dosaneyye na dussati; Doso pahīyate tamhā, tālapakkaṃva bandhanā. ‘‘Anatthajanano moho, moho cittappakopano; Bhayamantarato jātaṃ, taṃ jano nāvabujjhati. ‘‘Mūḷho atthaṃ na jānāti, mūḷho dhammaṃ na passati; Andhatamaṃ tadā hoti, yaṃ moho sahate naraṃ. ‘‘Yo ca mohaṃ pahantvāna, mohaneyye na muyhati; Mohaṃ vihanti so sabbaṃ, ādiccovudayaṃ tama’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Antarāmalasuttaṃ"
    },
    {
      "number": 89,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tīhi, bhikkhave, asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Katamehi tīhi? Pāpicchatāya, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Pāpamittatāya, bhikkhave, abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho. Sati kho pana uttarikaraṇīye [uttariṃ karaṇīye (syā.)] oramattakena visesādhigamena [visesādhigamena ca (syā. pī.)] antarā vosānaṃ āpādi. Imehi kho, bhikkhave, tīhi asaddhammehi abhibhūto pariyādinnacitto devadatto āpāyiko nerayiko kappaṭṭho atekiccho’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Mā jātu koci lokasmiṃ, pāpiccho udapajjatha; Tadamināpi jānātha, pāpicchānaṃ yathā gati. ‘‘Paṇḍitoti samaññāto, bhāvitattoti sammato; Jalaṃva yasasā aṭṭhā, devadattoti vissuto [me sutaṃ (pāḷiyaṃ)]. ‘‘So pamāṇamanuciṇṇo [pamādamanuciṇṇo (ka. sī. syā. pī.), samānamanuciṇṇo (aṭṭha.)], āsajja naṃ tathāgataṃ; Avīcinirayaṃ patto, catudvāraṃ bhayānakaṃ. ‘‘Aduṭṭhassa hi yo dubbhe, pāpakammaṃ akubbato; Tameva pāpaṃ phusati [phusseti (syā.)], duṭṭhacittaṃ anādaraṃ. ‘‘Samuddaṃ visakumbhena, yo maññeyya padūsituṃ; Na so tena padūseyya, bhesmā hi udadhi mahā. ‘‘Evameva [evametaṃ (syā.)] tathāgataṃ, yo vādena vihiṃsati; Sammaggataṃ [samaggataṃ (sī. ka.)] santacittaṃ, vādo tamhi na rūhati. ‘‘Tādisaṃ mittaṃ kubbetha, tañca seveyya paṇḍito; Yassa maggānugo bhikkhu, khayaṃ dukkhassa pāpuṇe’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dasamaṃ. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Devadattasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Catuttho vaggo niṭṭhito. Tassuddānaṃ – Vitakkāsakkārasadda, cavanaloke asubhaṃ; Dhammaandhakāramalaṃ, devadattena te dasāti.",
    "english": "",
    "sinhala": ""
  }
}