{
  "id": "iti.4",
  "title": {
    "pali": "Dukanipāto - Paṭhamavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 28,
      "pali": "(Dve dhamme anukkaṭi) [( ) syāmapotthake natthi] vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu diṭṭheva dhamme dukkhaṃ viharati savighātaṃ saupāyāsaṃ sapariḷāhaṃ; kāyassa bhedā paraṃ maraṇā duggati pāṭikaṅkhā. Katamehi dvīhi? Indriyesu aguttadvāratāya [aguttadvāro (aṭṭha.)] ca, bhojane amattaññutāya [amattaññū (aṭṭha.)] ca. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bhikkhu diṭṭheva dhamme dukkhaṃ viharati savidhātaṃ saupāyāsaṃ sapariḷāhaṃ; kāyassa bhedā paraṃ maraṇā duggati pāṭikaṅkhā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Cakkhu sotañca ghānañca, jivhā kāyo tathā mano; Etāni yassa dvārāni, aguttānidha [aguttāni ca (syā.)] bhikkhuno. ‘‘Bhojanamhi amattaññū, indriyesu asaṃvuto; Kāyadukkhaṃ cetodukkhaṃ, dukkhaṃ so adhigacchati. ‘‘Ḍayhamānena kāyena, ḍayhamānena cetasā; Divā vā yadi vā rattiṃ, dukkhaṃ viharati tādiso’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dukkhavihārasuttaṃ"
    },
    {
      "number": 29,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ; kāyassa bhedā paraṃ maraṇā sugati pāṭikaṅkhā. Katamehi dvīhi? Indriyesu guttadvāratāya ca, bhojane mattaññutāya ca. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhaṃ viharati avighātaṃ anupāyāsaṃ apariḷāhaṃ; kāyassa bhedā paraṃ maraṇā sugati pāṭikaṅkhā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Cakkhu sotañca ghānañca, jivhā kāyo tathā [atho (sī. syā. ka.)] mano; Etāni yassa dvārāni, suguttānidha bhikkhuno. ‘‘Bhojanamhi ca mattaññū, indriyesu ca saṃvuto; Kāyasukhaṃ cetosukhaṃ, sukhaṃ so adhigacchati. ‘‘Aḍayhamānena kāyena, aḍayhamānena cetasā; Divā vā yadi vā rattiṃ, sukhaṃ viharati tādiso’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sukhavihārasuttaṃ"
    },
    {
      "number": 30,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dveme, bhikkhave, dhammā tapanīyā. Katame dve? Idha, bhikkhave, ekacco akatakalyāṇo hoti, akatakusalo, akatabhīruttāṇo, katapāpo, kataluddo, katakibbiso. So ‘akataṃ me kalyāṇa’ntipi tappati, ‘kataṃ me pāpa’ntipi tappati. Ime kho, bhikkhave, dve dhammā tapanīyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Kāyaduccaritaṃ katvā, vacīduccaritāni ca; Manoduccaritaṃ katvā, yañcaññaṃ dosasañhitaṃ. ‘‘Akatvā kusalaṃ kammaṃ, katvānākusalaṃ bahuṃ; Kāyassa bhedā duppañño, nirayaṃ sopapajjatī’’ti [nirayaṃ so upapajjatīti (sī. syā. kaṃ. pī.)]. Ayampi attho vutto bhagavatā, iti me sutanti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Tapanīyasuttaṃ"
    },
    {
      "number": 31,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dveme, bhikkhave, dhammā atapanīyā. Katame dve? Idha, bhikkhave, ekacco katakalyāṇo hoti, katakusalo, katabhīruttāṇo, akatapāpo, akataluddo, akatakibbiso. So ‘kataṃ me kalyāṇa’ntipi na tappati, ‘akataṃ me pāpa’ntipi na tappati. Ime kho, bhikkhave, dve dhammā atapanīyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Kāyaduccaritaṃ hitvā, vacīduccaritāni ca; Manoduccaritaṃ hitvā, yañcaññaṃ dosasañhitaṃ. ‘‘Akatvākusalaṃ kammaṃ, katvāna kusalaṃ bahuṃ; Kāyassa bhedā sappañño, saggaṃ so upapajjatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Atapanīyasuttaṃ"
    },
    {
      "number": 32,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dvīhi, bhikkhave, dhammehi samannāgato puggalo yathābhataṃ nikkhitto evaṃ niraye. Katamehi dvīhi? Pāpakena ca sīlena, pāpikāya ca diṭṭhiyā. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato puggalo yathābhataṃ nikkhitto evaṃ niraye’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Pāpakena ca sīlena, pāpikāya ca diṭṭhiyā; Etehi dvīhi dhammehi, yo samannāgato naro; Kāyassa bhedā duppañño, nirayaṃ sopapajjatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamasīlasuttaṃ"
    },
    {
      "number": 33,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dvīhi, bhikkhave, dhammehi samannāgato puggalo yathābhataṃ nikkhitto evaṃ sagge. Katamehi dvīhi? Bhaddakena ca sīlena, bhaddikāya ca diṭṭhiyā. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato puggalo yathābhataṃ nikkhitto evaṃ sagge’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Bhaddakena ca sīlena, bhaddikāya ca diṭṭhiyā; Etehi dvīhi dhammehi, yo samannāgato naro; Kāyassa bhedā sappañño, saggaṃ so upapajjatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyasīlasuttaṃ"
    },
    {
      "number": 34,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Anātāpī, bhikkhave, bhikkhu anottāpī [anottappī (bahūsu) aṭṭhakathā passitabbā] abhabbo sambodhāya, abhabbo nibbānāya, abhabbo anuttarassa yogakkhemassa adhigamāya. Ātāpī ca kho, bhikkhave, bhikkhu ottāpī [ottappī (bahūsu)] bhabbo sambodhāya, bhabbo nibbānāya, bhabbo anuttarassa yogakkhemassa adhigamāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Anātāpī anottāpī, kusīto hīnavīriyo; Yo thīnamiddhabahulo, ahirīko anādaro; Abhabbo tādiso bhikkhu, phuṭṭhuṃ sambodhimuttamaṃ. ‘‘Yo ca satimā nipako jhāyī, ātāpī ottāpī ca appamatto; Saṃyojanaṃ jātijarāya chetvā, idheva sambodhimanuttaraṃ phuse’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Ātāpīsuttaṃ"
    },
    {
      "number": 35,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Nayidaṃ, bhikkhave, brahmacariyaṃ vussati janakuhanatthaṃ, na janalapanatthaṃ, na lābhasakkārasilokānisaṃsatthaṃ, na ‘iti maṃ jano jānātū’ti. Atha kho idaṃ, bhikkhave, brahmacariyaṃ vussati saṃvaratthañceva pahānatthañcā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Saṃvaratthaṃ pahānatthaṃ, brahmacariyaṃ anītihaṃ; Adesayi so bhagavā, nibbānogadhagāminaṃ. ‘‘Esa maggo mahattehi [mahantehi (sī. ka.), mahatthehi (syā.)], anuyāto mahesibhi [mahesino (sī. ka.)]; Ye ye taṃ paṭipajjanti, yathā buddhena desitaṃ; Dukkhassantaṃ karissanti, satthusāsanakārino’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Paṭhamanakuhanasuttaṃ"
    },
    {
      "number": 36,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Nayidaṃ, bhikkhave, brahmacariyaṃ vussati janakuhanatthaṃ, na janalapanatthaṃ, na lābhasakkārasilokānisaṃsatthaṃ, na ‘iti maṃ jano jānātū’ti. Atha kho idaṃ, bhikkhave, brahmacariyaṃ vussati abhiññatthañceva pariññatthañcā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Abhiññatthaṃ pariññatthaṃ, brahmacariyaṃ anītihaṃ; Adesayi so bhagavā, nibbānogadhagāminaṃ. ‘‘Esa maggo mahattehi, anuyāto mahesibhi; Ye ye taṃ paṭipajjanti, yathā buddhena desitaṃ; Dukkhassantaṃ karissanti, satthusāsanakārino’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dutiyanakuhanasuttaṃ"
    },
    {
      "number": 37,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dvīhi, bhikkhave, dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhasomanassabahulo viharati, yoni cassa [yoniso (sī. syā. pī.), yonissa (ka.)] āraddhā hoti āsavānaṃ khayāya. Katamehi dvīhi? Saṃvejanīyesu ṭhānesu saṃvejanena, saṃviggassa ca yoniso padhānena. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bhikkhu diṭṭheva dhamme sukhasomanassabahulo viharati, yoni cassa āraddhā hoti āsavānaṃ khayāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Saṃvejanīyaṭṭhānesu [saṃvejanīyesu ṭhānesu (syā. pī.)], saṃvijjetheva paṇḍito; Ātāpī nipako bhikkhu, paññāya samavekkhiya. ‘‘Evaṃ vihārī ātāpī, santavutti anuddhato; Cetosamathamanuyutto, khayaṃ dukkhassa pāpuṇe’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dasamaṃ. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Somanassasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Paṭhamo vaggo niṭṭhito. Tassuddānaṃ – Dve ca bhikkhū tapanīyā, tapanīyā paratthehi; Ātāpī [dve pādā (ka.), dve ātāpī (sī.)] nakuhanā dve [na kuhanā ca (sabbattha)], somanassena te dasāti.",
    "english": "",
    "sinhala": ""
  }
}