{
  "id": "iti.10",
  "title": {
    "pali": "Tikanipāto - Pañcamavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 90,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, aggappasādā. Katame tayo? Yāvatā, bhikkhave, sattā apadā vā dvipadā vā catuppadā vā bahuppadā [bahupadā (ka.)] vā rūpino vā arūpino vā saññino vā asaññino vā nevasaññināsaññino vā, tathāgato tesaṃ aggamakkhāyati arahaṃ sammāsambuddho. Ye, bhikkhave, buddhe pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, bhikkhave, dhammā saṅkhatā vā asaṅkhatā vā, virāgo tesaṃ aggamakkhāyati, yadidaṃ madanimmadano pipāsavinayo ālayasamugghāto vaṭṭupacchedo taṇhakkhayo virāgo nirodho nibbānaṃ. Ye, bhikkhave, virāge dhamme pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. ‘‘Yāvatā, bhikkhave, saṅghā vā gaṇā vā, tathāgatasāvakasaṅgho tesaṃ aggamakkhāyati, yadidaṃ cattāri purisayugāni aṭṭha purisapuggalā esa bhagavato sāvakasaṅgho āhuneyyo pāhuneyyo dakkhiṇeyyo añjalikaraṇīyo anuttaraṃ puññakkhettaṃ lokassa. Ye, bhikkhave, saṅghe pasannā, agge te pasannā. Agge kho pana pasannānaṃ aggo vipāko hoti. Ime kho, bhikkhave, tayo aggappasādā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Aggato ve pasannānaṃ, aggaṃ dhammaṃ vijānataṃ; Agge buddhe pasannānaṃ, dakkhiṇeyye anuttare. ‘‘Agge dhamme pasannānaṃ, virāgūpasame sukhe; Agge saṅghe pasannānaṃ, puññakkhette anuttare. ‘‘Aggasmiṃ dānaṃ dadataṃ, aggaṃ puññaṃ pavaḍḍhati; Aggaṃ āyu ca vaṇṇo ca, yaso kitti sukhaṃ balaṃ. ‘‘Aggassa dātā medhāvī, aggadhammasamāhito; Devabhūto manusso vā, aggappatto pamodatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Aggappasādasuttaṃ"
    },
    {
      "number": 91,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Antamidaṃ, bhikkhave, jīvikānaṃ yadidaṃ piṇḍolyaṃ. Abhisāpoyaṃ [abhisāpāyaṃ (sī.), abhilāpāyaṃ (syā. pī.), abhisapāyaṃ (ka.)], bhikkhave, lokasmiṃ – ‘piṇḍolo vicarasi pattapāṇī’ti. Tañca kho etaṃ, bhikkhave, kulaputtā upenti atthavasikā, atthavasaṃ paṭicca; neva rājābhinītā, na corābhinītā, na iṇaṭṭā, na bhayaṭṭā, na ājīvikāpakatā. Api ca kho ‘otiṇṇamhā jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi dukkhotiṇṇā dukkhaparetā, appeva nāma imassa kevalassa dukkhakkhandhassa antakiriyā paññāyethā’ti. Evaṃ pabbajito cāyaṃ, bhikkhave, kulaputto so ca hoti abhijjhālu kāmesu tibbasārāgo, byāpannacitto paduṭṭhamanasaṅkappo, muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo. Seyyathāpi, bhikkhave, chavālātaṃ ubhatopadittaṃ majjhe gūthagataṃ neva gāme kaṭṭhatthaṃ pharati na araññe◌ः tathūpamāhaṃ, bhikkhave, imaṃ puggalaṃ vadāmi gihibhogā parihīno sāmaññatthañca na paripūretī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Gihibhogā parihīno, sāmaññatthañca dubbhago; Paridhaṃsamāno pakireti, chavālātaṃva nassati. ‘‘Kāsāvakaṇṭhā bahavo, pāpadhammā asaññatā; Pāpā pāpehi kammehi, nirayaṃ te upapajjare. ‘‘Seyyo ayoguḷo bhutto, tatto aggisikhūpamo; Yañce bhuñjeyya dussīlo, raṭṭhapiṇḍamasaññato’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Jīvikasuttaṃ"
    },
    {
      "number": 92,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Saṅghāṭikaṇṇe cepi, bhikkhave, bhikkhu gahetvā piṭṭhito piṭṭhito anubandho assa pāde pādaṃ nikkhipanto, so ca hoti abhijjhālu kāmesu tibbasārāgo byāpannacitto paduṭṭhamanasaṅkappo muṭṭhassati asampajāno asamāhito vibbhantacitto pākatindriyo; atha kho so ārakāva mayhaṃ, ahañca tassa. Taṃ kissa hetu? Dhammañhi so, bhikkhave, bhikkhu na passati. Dhammaṃ apassanto na maṃ passati [maṃ na passati (syā.)]. ‘‘Yojanasate cepi so, bhikkhave, bhikkhu vihareyya. So ca hoti anabhijjhālu kāmesu na tibbasārāgo abyāpannacitto apaduṭṭhamanasaṅkappo upaṭṭhitassati sampajāno samāhito ekaggacitto saṃvutindriyo; atha kho so santikeva mayhaṃ, ahañca tassa. Taṃ kissa hetu? Dhammaṃ hi so, bhikkhave, bhikkhu passati; dhammaṃ passanto maṃ passatī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Anubandhopi ce assa, mahiccho ca vighātavā; Ejānugo anejassa, nibbutassa anibbuto; Giddho so vītagedhassa, passa yāvañca ārakā. ‘‘Yo ca dhammamabhiññāya, dhammamaññāya paṇḍito; Rahadova nivāte ca, anejo vūpasammati. ‘‘Anejo so anejassa, nibbutassa ca nibbuto; Agiddho vītagedhassa, passa yāvañca santike’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Saṅghāṭikaṇṇasuttaṃ"
    },
    {
      "number": 93,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, aggī. Katame tayo? Rāgaggi, dosaggi, mohaggi – ime kho, bhikkhave, tayo aggī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Rāgaggi dahati macce, ratte kāmesu mucchite; Dosaggi pana byāpanne, nare pāṇātipātino. ‘‘Mohaggi pana sammūḷhe, ariyadhamme akovide; Ete aggī ajānantā, sakkāyābhiratā pajā. ‘‘Te vaḍḍhayanti nirayaṃ, tiracchānañca yoniyo; Asuraṃ pettivisayaṃ, amuttā mārabandhanā. ‘‘Ye ca rattindivā yuttā, sammāsambuddhasāsane; Te nibbāpenti rāgaggiṃ, niccaṃ asubhasaññino. ‘‘Dosaggiṃ pana mettāya, nibbāpenti naruttamā; Mohaggiṃ pana paññāya, yāyaṃ nibbedhagāminī. ‘‘Te nibbāpetvā nipakā, rattindivamatanditā; Asesaṃ parinibbanti, asesaṃ dukkhamaccaguṃ. ‘‘Ariyaddasā vedaguno, sammadaññāya paṇḍitā; Jātikkhayamabhiññāya, nāgacchanti punabbhava’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Aggisuttaṃ"
    },
    {
      "number": 94,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tathā tathā, bhikkhave, bhikkhu upaparikkheyya yathā yathāssa [yathā yathā (bahūsu)] upaparikkhato bahiddhā cassa viññāṇaṃ avikkhittaṃ avisaṭaṃ ajjhattaṃ asaṇṭhitaṃ anupādāya na paritasseyya. Bahiddhā, bhikkhave, viññāṇe avikkhitte avisaṭe sati ajjhattaṃ asaṇṭhite anupādāya aparitassato āyatiṃ jātijarāmaraṇadukkhasamudayasambhavo na hotī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Sattasaṅgappahīnassa, netticchinnassa bhikkhuno; Vikkhīṇo jātisaṃsāro, natthi tassa punabbhavo’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Upaparikkhasuttaṃ"
    },
    {
      "number": 95,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tisso imā, bhikkhave, kāmūpapattiyo [kāmuppattiyo (sī.)]. Katamā tisso? Paccupaṭṭhitakāmā, nimmānaratino, paranimmitavasavattino – imā kho, bhikkhave, tisso kāmūpapattiyo’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Paccupaṭṭhitakāmā ca, ye devā vasavattino; Nimmānaratino devā, ye caññe kāmabhogino; Itthabhāvaññathābhāvaṃ, saṃsāraṃ nātivattare. ‘‘Etamādīnavaṃ ñatvā, kāmabhogesu paṇḍito; Sabbe pariccaje kāme, ye dibbā ye ca mānusā. ‘‘Piyarūpasātagadhitaṃ, chetvā sotaṃ duraccayaṃ; Asesaṃ parinibbanti, asesaṃ dukkhamaccaguṃ. ‘‘Ariyaddasā vedaguno, sammadaññāya paṇḍitā; Jātikkhayamabhiññāya, nāgacchanti punabbhava’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Kāmūpapattisuttaṃ"
    },
    {
      "number": 96,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Kāmayogayutto, bhikkhave, bhavayogayutto āgāmī hoti āgantā [āgantvā (syā. ka.)] itthattaṃ. Kāmayogavisaṃyutto, bhikkhave, bhavayogayutto anāgāmī hoti anāgantā itthattaṃ. Kāmayogavisaṃyutto, bhikkhave, bhavayogavisaṃyutto arahā hoti, khīṇāsavo’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Kāmayogena saṃyuttā, bhavayogena cūbhayaṃ; Sattā gacchanti saṃsāraṃ, jātimaraṇagāmino. ‘‘Ye ca kāme pahantvāna, appattā āsavakkhayaṃ; Bhavayogena saṃyuttā, anāgāmīti vuccare. ‘‘Ye ca kho chinnasaṃsayā, khīṇamānapunabbhavā; Te ve pāraṅgatā loke, ye pattā āsavakkhaya’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Sattamaṃ. Kalyāṇasīlasuttaṃ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Kāmayogasuttaṃ"
    },
    {
      "number": 97,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Kalyāṇasīlo, bhikkhave, bhikkhu kalyāṇadhammo kalyāṇapañño imasmiṃ dhammavinaye ‘kevalī vusitavā uttamapuriso’ti vuccati – ‘‘Kathañca, bhikkhave, bhikkhu kalyāṇasīlo hoti? Idha, bhikkhave, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati, ācāragocarasampanno aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. Evaṃ kho, bhikkhave, bhikkhu kalyāṇasīlo hoti. Iti kalyāṇasīlo. ‘‘Kalyāṇadhammo ca kathaṃ hoti? Idha, bhikkhave, bhikkhu sattannaṃ bodhipakkhiyānaṃ dhammānaṃ bhāvanānuyogamanuyutto viharati. Evaṃ kho, bhikkhave, bhikkhu kalyāṇadhammo hoti. Iti kalyāṇasīlo, kalyāṇadhammo. ‘‘Kalyāṇapañño ca kathaṃ hoti? Idha, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Evaṃ kho, bhikkhave, bhikkhu kalyāṇapañño hoti. ‘‘Iti kalyāṇasīlo kalyāṇadhammo kalyāṇapañño imasmiṃ dhammavinaye ‘kevalī vusitavā uttamapuriso’ti vuccatī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yassa kāyena vācāya, manasā natthi dukkaṭaṃ; Taṃ ve kalyāṇasīloti, āhu bhikkhuṃ hirīmanaṃ [hirīmataṃ (syā. ka.)]. ‘‘Yassa dhammā subhāvitā, satta [patta (sabbattha)] sambodhigāmino; Taṃ ve kalyāṇadhammoti, āhu bhikkhuṃ anussadaṃ. ‘‘Yo dukkhassa pajānāti, idheva khayamattano; Taṃ ve kalyāṇapaññoti, āhu bhikkhuṃ anāsavaṃ. ‘‘Tehi dhammehi sampannaṃ, anīghaṃ chinnasaṃsayaṃ; Asitaṃ sabbalokassa, āhu sabbapahāyina’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": ""
    },
    {
      "number": 98,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dvemāni, bhikkhave, dānāni – āmisadānañca dhammadānañca. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ dānānaṃ yadidaṃ – dhammadānaṃ. ‘‘Dveme, bhikkhave, saṃvibhāgā – āmisasaṃvibhāgo ca dhammasaṃvibhāgo ca. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ saṃvibhāgānaṃ yadidaṃ – dhammasaṃvibhāgo. ‘‘Dveme, bhikkhave, anuggahā – āmisānuggaho ca dhammānuggaho ca. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ anuggahānaṃ yadidaṃ – dhammānuggaho’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yamāhu dānaṃ paramaṃ anuttaraṃ, yaṃ saṃvibhāgaṃ bhagavā avaṇṇayi [avaṇṇayī (sī.)]; Aggamhi khettamhi pasannacitto, viññū pajānaṃ ko na yajetha kāle. ‘‘Ye ceva bhāsanti suṇanti cūbhayaṃ, pasannacittā sugatassa sāsane; Tesaṃ so attho paramo visujjhati, ye appamattā sugatassa sāsane’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dānasuttaṃ"
    },
    {
      "number": 99,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dhammenāhaṃ, bhikkhave, tevijjaṃ brāhmaṇaṃ paññāpemi, nāññaṃ lapitalāpanamattena. ‘‘Kathañcāhaṃ, bhikkhave, dhammena tevijjaṃ brāhmaṇaṃ paññāpemi, nāññaṃ lapitalāpanamattena? Idha, bhikkhave, bhikkhu anekavihitaṃ pubbenivāsaṃ anussarati, seyyathidaṃ – ekampi jātiṃ dvepi jātiyo tissopi jātiyo catassopi jātiyo pañcapi jātiyo dasapi jātiyo vīsampi jātiyo tiṃsampi jātiyo cattālīsampi jātiyo paññāsampi jātiyo jātisatampi jātisahassampi jātisatasahassampi anekepi saṃvaṭṭakappe anekepi vivaṭṭakappe anekepi saṃvaṭṭavivaṭṭakappe – ‘amutrāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto. So tato cuto amutra udapādiṃ. Tatrāpāsiṃ evaṃnāmo evaṃgotto evaṃvaṇṇo evamāhāro evaṃsukhadukkhappaṭisaṃvedī evamāyupariyanto. So tato cuto idhūpapanno’ti. Iti sākāraṃ sauddesaṃ anekavihitaṃ pubbenivāsaṃ anussarati. Ayamassa paṭhamā vijjā adhigatā hoti, avijjā vihatā, vijjā uppannā, tamo vihato, āloko uppanno, yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘Puna caparaṃ, bhikkhave, bhikkhu dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti – ‘ime vata bhonto sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Ime vā pana bhonto sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’ti. Iti dibbena cakkhunā visuddhena atikkantamānusakena satte passati cavamāne upapajjamāne hīne paṇīte suvaṇṇe dubbaṇṇe, sugate duggate yathākammūpage satte pajānāti. Ayamassa dutiyā vijjā adhigatā hoti, avijjā vihatā, vijjā uppannā, tamo vihato, āloko uppanno, yathā taṃ appamattassa ātāpino pahitattassa viharato. ‘‘Puna caparaṃ, bhikkhave, bhikkhu āsavānaṃ khayā anāsavaṃ cetovimuttiṃ paññāvimuttiṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharati. Ayamassa tatiyā vijjā adhigatā hoti, avijjā vihatā, vijjā uppannā, tamo vihato, āloko uppanno, yathā taṃ appamattassa ātāpino pahitattassa viharato. Evaṃ kho ahaṃ, bhikkhave, dhammena tevijjaṃ brāhmaṇaṃ paññāpemi, nāññaṃ lapitalāpanamattenā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Pubbenivāsaṃ yovedi [yovedi (sabbattha)], saggāpāyañca passati; Atho [atha (syā. ka.)] jātikkhayaṃ patto, abhiññāvosito muni. ‘‘Etāhi tīhi vijjāhi, tevijjo hoti brāhmaṇo; Tamahaṃ vadāmi tevijjaṃ, nāññaṃ lapitalāpana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Dasamaṃ. Pañcamo vaggo niṭṭhito. Tassuddānaṃ – Pasāda jīvita saṅghāṭi, aggi upaparikkhayā; Upapatti [uppatti (sī.)] kāma kalyāṇaṃ, dānaṃ dhammena te dasāti. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Tevijjasuttaṃ"
    }
  ],
  "footer": {
      "pali": "Tikanipāto niṭṭhito.",
      "english": "",
      "sinhala": ""
  }
}