{
  "id": "iti.8",
  "title": {
    "pali": "Tikanipāto - Tatiyavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 70,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Diṭṭhā mayā, bhikkhave, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. ‘‘Taṃ kho panāhaṃ, bhikkhave, nāññassa samaṇassa vā brāhmaṇassa vā sutvā vadāmi. Diṭṭhā mayā, bhikkhave, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā. Api ca, bhikkhave, yadeva sāmaṃ ñātaṃ sāmaṃ diṭṭhaṃ sāmaṃ viditaṃ tadevāhaṃ vadāmi. ‘‘Diṭṭhā mayā, bhikkhave, sattā kāyaduccaritena samannāgatā vacīduccaritena samannāgatā manoduccaritena samannāgatā ariyānaṃ upavādakā micchādiṭṭhikā micchādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapannā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Micchā manaṃ paṇidhāya, micchā vācañca bhāsiya [micā vācaṃ abhāsiya (sabbattha)]; Micchā kammāni katvāna, kāyena idha puggalo. ‘‘Appassutāpuññakaro [appassutopuññakaro (sī.), appassuto apuññakaro (syā. pī.)], appasmiṃ idha jīvite; Kāyassa bhedā duppañño, nirayaṃ sopapajjatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Micchādiṭṭhikasuttaṃ"
    },
    {
      "number": 71,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Diṭṭhā mayā, bhikkhave, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā. ‘‘Taṃ kho panāhaṃ, bhikkhave, nāññassa samaṇassa vā brāhmaṇassa vā sutvā vadāmi. Diṭṭhā mayā, bhikkhave, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā. Api ca, bhikkhave, yadeva sāmaṃ ñātaṃ sāmaṃ diṭṭhaṃ sāmaṃ viditaṃ tadevāhaṃ vadāmi. ‘‘Diṭṭhā mayā, bhikkhave, sattā kāyasucaritena samannāgatā vacīsucaritena samannāgatā manosucaritena samannāgatā ariyānaṃ anupavādakā sammādiṭṭhikā sammādiṭṭhikammasamādānā. Te kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapannā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Sammā manaṃ paṇidhāya, sammā vācañca bhāsiya [sammā vācaṃ abhāsiya (sabbattha)]; Sammā kammāni katvāna, kāyena idha puggalo. ‘‘Bahussuto puññakaro, appasmiṃ idha jīvite; Kāyassa bhedā sappañño, saggaṃ so upapajjatī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sammādiṭṭhikasuttaṃ"
    },
    {
      "number": 72,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tisso imā, bhikkhave, nissaraṇiyā [nissāraṇīyā (a. ni. 5.200)] dhātuyo. Katamā tisso? Kāmānametaṃ nissaraṇaṃ yadidaṃ nekkhammaṃ, rūpānametaṃ nissaraṇaṃ yadidaṃ āruppaṃ, yaṃ kho pana kiñci bhūtaṃ saṅkhataṃ paṭiccasamuppannaṃ nirodho tassa nissaraṇaṃ – imā kho, bhikkhave, tisso nissaraṇiyā dhātuyo’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Kāmanissaraṇaṃ ñatvā, rūpānañca atikkamaṃ; Sabbasaṅkhārasamathaṃ, phusaṃ ātāpi sabbadā. ‘‘Sa ve sammaddaso bhikkhu, yato tattha vimuccati; Abhiññāvosito santo, sa ve yogātigo munī’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Nissaraṇiyasuttaṃ"
    },
    {
      "number": 73,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Rūpehi, bhikkhave, arūpā [āruppā (sī.)] santatarā, arūpehi nirodho santataro’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Ye ca rūpūpagā sattā, ye ca arūpaṭṭhāyino [āruppaṭṭhāyino (sī.)]; Nirodhaṃ appajānantā, āgantāro punabbhavaṃ. ‘‘Ye ca rūpe pariññāya, arūpesu asaṇṭhitā; Nirodhe ye vimuccanti, te janā maccuhāyino. ‘‘Kāyena amataṃ dhātuṃ, phusayitvā nirūpadhiṃ; Upadhippaṭinissaggaṃ, sacchikatvā anāsavo; Deseti sammāsambuddho, asokaṃ virajaṃ pada’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Santatarasuttaṃ"
    },
    {
      "number": 74,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, puttā santo saṃvijjamānā lokasmiṃ. Katame tayo? Atijāto, anujāto, avajātoti. ‘‘Kathañca, bhikkhave, putto atijāto hoti? Idha, bhikkhave, puttassa mātāpitaro honti na buddhaṃ saraṇaṃ gatā, na dhammaṃ saraṇaṃ gatā, na saṅghaṃ saraṇaṃ gatā; pāṇātipātā appaṭiviratā, adinnādānā appaṭiviratā, kāmesumicchācārā appaṭiviratā, musāvādā appaṭiviratā, surāmerayamajjapamādaṭṭhānā appaṭiviratā, dussīlā pāpadhammā. Putto ca nesaṃ hoti buddhaṃ saraṇaṃ gato, dhammaṃ saraṇaṃ gato, saṅghaṃ saraṇaṃ gato; pāṇātipātā paṭivirato, adinnādānā paṭivirato, kāmesumicchācārā paṭivirato, musāvādā paṭivirato, surāmerayamajjapamādaṭṭhānā paṭivirato, sīlavā kalyāṇadhammo. Evaṃ kho, bhikkhave, putto atijāto hoti. ‘‘Kathañca, bhikkhave, putto anujāto hoti? Idha, bhikkhave, puttassa mātāpitaro honti buddhaṃ saraṇaṃ gatā, dhammaṃ saraṇaṃ gatā, saṅghaṃ saraṇaṃ gatā; pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjapamādaṭṭhānā paṭiviratā, sīlavanto kalyāṇadhammā. Puttopi nesaṃ hoti buddhaṃ saraṇaṃ gato, dhammaṃ saraṇaṃ gato, saṅghaṃ saraṇaṃ gato; pāṇātipātā paṭivirato, adinnādānā paṭivirato, kāmesumicchācārā paṭivirato, musāvādā paṭivirato, surāmerayamajjapamādaṭṭhānā paṭivirato, sīlavā kalyāṇadhammo. Evaṃ kho, bhikkhave, putto anujāto hoti. ‘‘Kathañca, bhikkhave, putto avajāto hoti? Idha, bhikkhave, puttassa mātāpitaro honti buddhaṃ saraṇaṃ gatā, dhammaṃ saraṇaṃ gatā, saṅghaṃ saraṇaṃ gatā; pāṇātipātā paṭiviratā, adinnādānā paṭiviratā, kāmesumicchācārā paṭiviratā, musāvādā paṭiviratā, surāmerayamajjapamādaṭṭhānā paṭiviratā, sīlavanto kalyāṇadhammā. Putto ca nesaṃ hoti na buddhaṃ saraṇaṃ gato, na dhammaṃ saraṇaṃ gato, na saṅghaṃ saraṇaṃ gato; pāṇātipātā appaṭivirato, adinnādānā appaṭivirato, kāmesumicchācārā appaṭivirato, musāvādā appaṭivirato, surāmerayamajjapamādaṭṭhānā appaṭivirato, dussīlo pāpadhammo. Evaṃ kho, bhikkhave, putto avajāto hoti. Ime kho, bhikkhave, tayo puttā santo saṃvijjamānā lokasmi’’nti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Atijātaṃ anujātaṃ, puttamicchanti paṇḍitā; Avajātaṃ na icchanti, yo hoti kulagandhano. ‘‘Ete kho puttā lokasmiṃ, ye bhavanti upāsakā; Saddhā sīlena sampannā, vadaññū vītamaccharā; Cando abbhaghanā mutto, parisāsu virocare’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Puttasuttaṃ"
    },
    {
      "number": 75,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, puggalā santo saṃvijjamānā lokasmiṃ. Katame tayo? Avuṭṭhikasamo, padesavassī, sabbatthābhivassī. ‘‘Kathañca, bhikkhave, puggalo avuṭṭhikasamo hoti? Idha, bhikkhave, ekacco puggalo sabbesaññeva na dātā hoti, samaṇabrāhmaṇakapaṇaddhikavanibbakayācakānaṃ [… vaṇibbakayācakānaṃ (sī.)] annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Evaṃ kho, bhikkhave, puggalo avuṭṭhikasamo hoti. ‘‘Kathañca, bhikkhave, puggalo padesavassī hoti? Idha, bhikkhave, ekacco puggalo ekaccānaṃ dātā (hoti) [( ) natthi syāmapotthake], ekaccānaṃ na dātā hoti samaṇabrāhmaṇakapaṇaddhikavanibbakayācakānaṃ annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Evaṃ kho, bhikkhave, puggalo padesavassī hoti. ‘‘Kathañca, bhikkhave, puggalo sabbatthābhivassī hoti? Idha, bhikkhave, ekacco puggalo sabbesaṃva deti, samaṇabrāhmaṇakapaṇaddhikavanibbakayācakānaṃ annaṃ pānaṃ vatthaṃ yānaṃ mālāgandhavilepanaṃ seyyāvasathapadīpeyyaṃ. Evaṃ kho, bhikkhave, puggalo sabbatthābhivassī hoti. Ime kho, bhikkhave, tayo puggalā santo saṃvijjamānā lokasmi’’nti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Na samaṇe na brāhmaṇe, na kapaṇaddhikavanibbake; Laddhāna saṃvibhājeti, annaṃ pānañca bhojanaṃ; Taṃ ve avuṭṭhikasamoti, āhu naṃ purisādhamaṃ. ‘‘Ekaccānaṃ na dadāti, ekaccānaṃ pavecchati; Taṃ ve padesavassīti, āhu medhāvino janā. ‘‘Subhikkhavāco puriso, sabbabhūtānukampako; Āmodamāno pakireti, detha dethāti bhāsati. ‘‘Yathāpi megho thanayitvā, gajjayitvā pavassati; Thalaṃ ninnañca pūreti, abhisandantova [abhisandentova (?)] vārinā. ‘‘Evameva idhekacco, puggalo hoti tādiso; Dhammena saṃharitvāna, uṭṭhānādhigataṃ dhanaṃ; Tappeti annapānena, sammā patte vanibbake’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Avuṭṭhikasuttaṃ"
    },
    {
      "number": 76,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tīṇimāni, bhikkhave, sukhāni patthayamāno sīlaṃ rakkheyya paṇḍito. Katamāni tīṇi? Pasaṃsā me āgacchatūti [āgacchantūti (syā.)] sīlaṃ rakkheyya paṇḍito, bhogā me uppajjantūti sīlaṃ rakkheyya paṇḍito, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjissāmīti sīlaṃ rakkheyya paṇḍito. Imāni kho, bhikkhave, tīṇi sukhāni patthayamāno sīlaṃ rakkheyya paṇḍito’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Sīlaṃ rakkheyya medhāvī, patthayāno tayo sukhe; Pasaṃsaṃ vittalābhañca, pecca sagge pamodanaṃ. ‘‘Akarontopi ce pāpaṃ, karontamupasevati; Saṅkiyo hoti pāpasmiṃ, avaṇṇo cassa rūhati. ‘‘Yādisaṃ kurute mittaṃ, yādisaṃ cūpasevati; Sa ve tādisako hoti, sahavāso hi [sahavāsopi (sī. ka.)] tādiso. ‘‘Sevamāno sevamānaṃ, samphuṭṭho samphusaṃ paraṃ; Saro diddho kalāpaṃva, alittamupalimpati; Upalepabhayā [upalimpabhayā (ka.)] dhīro, neva pāpasakhā siyā. ‘‘Pūtimacchaṃ kusaggena, yo naro upanayhati; Kusāpi pūti vāyanti, evaṃ bālūpasevanā. ‘‘Tagarañca palāsena, yo naro upanayhati; Pattāpi surabhi vāyanti, evaṃ dhīrūpasevanā. ‘‘Tasmā pattapuṭasseva [palāsapuṭasseva (pī. ka.)], ñatvā sampākamattano; Asante nupaseveyya, sante seveyya paṇḍito; Asanto nirayaṃ nenti, santo pāpenti suggati’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sukhapatthanāsuttaṃ"
    },
    {
      "number": 77,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Bhidurāyaṃ [bhindantāyaṃ (syā. pī. ka.)], bhikkhave, kāyo, viññāṇaṃ virāgadhammaṃ, sabbe upadhī aniccā dukkhā vipariṇāmadhammā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Kāyañca bhiduraṃ [bhindantaṃ (syā. pī. ka.)] ñatvā, viññāṇañca virāgunaṃ [virāgikaṃ (ka. sī.), pabhaṅguṇaṃ (syā.)]; Upadhīsu bhayaṃ disvā, jātimaraṇamaccagā; Sampatvā paramaṃ santiṃ, kālaṃ kaṅkhati bhāvitatto’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Bhidurasuttaṃ"
    },
    {
      "number": 78,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dhātuso, bhikkhave, sattā sattehi saddhiṃ saṃsandanti samenti. Hīnādhimuttikā sattā hīnādhimuttikehi sattehi saddhiṃ saṃsandanti samenti, kalyāṇādhimuttikā sattā kalyāṇādhimuttikehi sattehi saddhiṃ saṃsandanti samenti. ‘‘Atītampi, bhikkhave, addhānaṃ dhātusova sattā sattehi saddhiṃ saṃsandiṃsu samiṃsu. Hīnādhimuttikā sattā hīnādhimuttikehi sattehi saddhiṃ saṃsandiṃsu samiṃsu, kalyāṇādhimuttikā sattā kalyāṇādhimuttikehi sattehi saddhiṃ saṃsandiṃsu samiṃsu. ‘‘Anāgatampi, bhikkhave, addhānaṃ dhātusova sattā sattehi saddhiṃ saṃsandissanti samessanti. Hīnādhimuttikā sattā hīnādhimuttikehi sattehi saddhiṃ saṃsandissanti samessanti, kalyāṇādhimuttikā sattā kalyāṇādhimuttikehi sattehi saddhiṃ saṃsandissanti samessanti. ‘‘Etarahipi, bhikkhave, paccuppanaṃ addhānaṃ dhātusova sattā sattehi saddhiṃ saṃsandanti samenti. Hīnādhimuttikā sattā hīnādhimuttikehi sattehi saddhiṃ saṃsandanti samenti, kalyāṇādhimuttikā sattā kalyāṇādhimuttikehi sattehi saddhiṃ saṃsandanti samentī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Saṃsaggā vanatho jāto, asaṃsaggena chijjati; Parittaṃ dārumāruyha, yathā sīde mahaṇṇave. ‘‘Evaṃ kusītamāgamma, sādhujīvīpi sīdati; Tasmā taṃ parivajjeyya, kusītaṃ hīnavīriyaṃ. ‘‘Pavivittehi ariyehi, pahitattehi jhāyibhi; Niccaṃ āraddhavīriyehi, paṇḍitehi sahāvase’’ti. Ayampi attho vutto bhagavatā, iti me sutanti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dhātusosaṃsandanasuttaṃ"
    },
    {
      "number": 79,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Tayome, bhikkhave, dhammā sekhassa bhikkhuno parihānāya saṃvattanti. Katame tayo? Idha, bhikkhave, sekho bhikkhu kammārāmo hoti, kammarato, kammārāmatamanuyutto; bhassārāmo hoti, bhassarato, bhassārāmatamanuyutto; niddārāmo hoti, niddārato, niddārāmatamanuyutto. Ime kho, bhikkhave, tayo dhammā sekhassa bhikkhuno parihānāya saṃvattanti. ‘‘Tayome, bhikkhave, dhammā sekhassa bhikkhuno aparihānāya saṃvattanti. Katame tayo? Idha, bhikkhave, sekho bhikkhu na kammārāmo hoti, na kammarato, na kammārāmatamanuyutto; na bhassārāmo hoti, na bhassarato, na bhassārāmatamanuyutto; na niddārāmo hoti, na niddārato, na niddārāmatamanuyutto. Ime kho, bhikkhave, tayo dhammā sekhassa bhikkhuno aparihānāya saṃvattantī’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Kammārāmo bhassārāmo [bhassarato (sabbatha)], niddārāmo ca uddhato; Abhabbo tādiso bhikkhu, phuṭṭhuṃ sambodhimuttamaṃ. ‘‘Tasmā hi appakiccassa, appamiddho anuddhato; Bhabbo so tādiso bhikkhu, phuṭṭhuṃ sambodhimuttama’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Dasamaṃ. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Parihānasuttaṃ"
    }
  ],
  "footer": {
    "pali": "Tatiyo vaggo niṭṭhito. Tassuddānaṃ – Dve diṭṭhī nissaraṇaṃ rūpaṃ, putto avuṭṭhikena ca; Sukhā ca bhiduro [bhindanā (sabbattha)] dhātu, parihānena te dasāti.",
    "english": "",
    "sinhala": ""
  }
}