{
  "id": "iti.1",
  "title": {
    "pali": "Ekakanipāto - Paṭhamavaggo",
    "english": "",
    "sinhala": ""
  },
  "sections": [
    {
      "number": 1,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Ekadhammaṃ, bhikkhave, pajahatha; ahaṃ vo pāṭibhogo anāgāmitāya. Katamaṃ ekadhammaṃ? Lobhaṃ, bhikkhave, ekadhammaṃ pajahatha; ahaṃ vo pāṭibhogo anāgāmitāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena lobhena luddhāse, sattā gacchanti duggatiṃ; Taṃ lobhaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Paṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Lobhasuttaṃ"
    },
    {
      "number": 2,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Ekadhammaṃ, bhikkhave, pajahatha; ahaṃ vo pāṭibhogo anāgāmitāya. Katamaṃ ekadhammaṃ? Dosaṃ, bhikkhave, ekadhammaṃ pajahatha; ahaṃ vo pāṭibhogo anāgāmitāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena dosena duṭṭhāse, sattā gacchanti duggatiṃ; Taṃ dosaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Dutiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dosasuttaṃ"
    },
    {
      "number": 3,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Ekadhammaṃ, bhikkhave, pajahatha; ahaṃ vo pāṭibhogo anāgāmitāya. Katamaṃ ekadhammaṃ? Mohaṃ, bhikkhave, ekadhammaṃ pajahatha; ahaṃ vo pāṭibhogo anāgāmitāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena mohena mūḷhāse, sattā gacchanti duggatiṃ; Taṃ mohaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Tatiyaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mohasuttaṃ"
    },
    {
      "number": 4,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Ekadhammaṃ, bhikkhave, pajahatha; ahaṃ vo pāṭibhogo anāgāmitāya. Katamaṃ ekadhammaṃ? Kodhaṃ, bhikkhave, ekadhammaṃ pajahatha; ahaṃ vo pāṭibhogo anāgāmitāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena kodhena kuddhāse, sattā gacchanti duggatiṃ; Taṃ kodhaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Catutthaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Kodhasuttaṃ"
    },
    {
      "number": 5,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Ekadhammaṃ, bhikkhave, pajahatha; ahaṃ vo pāṭibhogo anāgāmitāya. Katamaṃ ekadhammaṃ? Makkhaṃ, bhikkhave, ekadhammaṃ pajahatha; ahaṃ vo pāṭibhogo anāgāmitāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena makkhena makkhāse [makkhitāse (syā.)], sattā gacchanti duggatiṃ; Taṃ makkhaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Pañcamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Makkhasuttaṃ"
    },
    {
      "number": 6,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Ekadhammaṃ, bhikkhave, pajahatha; ahaṃ vo pāṭibhogo anāgāmitāya. Katamaṃ ekadhammaṃ? Mānaṃ, bhikkhave, ekadhammaṃ pajahatha; ahaṃ vo pāṭibhogo anāgāmitāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena mānena mattāse, sattā gacchanti duggatiṃ; Taṃ mānaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Chaṭṭhaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mānasuttaṃ"
    },
    {
      "number": 7,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Sabbaṃ, bhikkhave, anabhijānaṃ aparijānaṃ tattha cittaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāya. Sabbañca kho, bhikkhave, abhijānaṃ parijānaṃ tattha cittaṃ virājayaṃ pajahaṃ bhabbo dukkhakkhayāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yo sabbaṃ sabbato ñatvā, sabbatthesu na rajjati; Sa ve sabbapariññā [sabbaṃ pariññā (syā. pī.)] so, sabbadukkhamupaccagā’’ti [sabbaṃ dukkhaṃ upaccagāti (syā.), sabbadukkhaṃ upaccagāti (pī. aṭṭha.)]. Ayampi attho vutto bhagavatā, iti me sutanti. Sattamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Sabbapariññāsuttaṃ"
    },
    {
      "number": 8,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Mānaṃ, bhikkhave, anabhijānaṃ aparijānaṃ tattha cittaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāya. Mānañca kho, bhikkhave, abhijānaṃ parijānaṃ tattha cittaṃ virājayaṃ pajahaṃ bhabbo dukkhakkhayāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Mānupetā ayaṃ pajā, mānaganthā bhave ratā; Mānaṃ aparijānantā, āgantāro punabbhavaṃ. ‘‘Ye ca mānaṃ pahantvāna, vimuttā mānasaṅkhaye; Te mānaganthābhibhuno, sabbadukkhamupaccagu’’nti [sabbadukkhaṃ upaccagunti (pī.), sabbaṃ dukkhaṃ upaccagunti (aṭṭhakathā)]. Ayampi attho vutto bhagavatā, iti me sutanti. Aṭṭhamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Mānapariññāsuttaṃ"
    },
    {
      "number": 9,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Lobhaṃ, bhikkhave, anabhijānaṃ aparijānaṃ tattha cittaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāya. Lobhañca kho, bhikkhave, abhijānaṃ parijānaṃ tattha cittaṃ virājayaṃ pajahaṃ bhabbo dukkhakkhayāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena lobhena luddhāse, sattā gacchanti duggatiṃ; Taṃ lobhaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Navamaṃ.",
      "english": "",
      "sinhala": "",
      "paliTitle": "Lobhapariññāsuttaṃ"
    },
    {
      "number": 10,
      "pali": "Vuttañhetaṃ bhagavatā, vuttamarahatāti me sutaṃ – ‘‘Dosaṃ, bhikkhave, anabhijānaṃ aparijānaṃ tattha cittaṃ avirājayaṃ appajahaṃ abhabbo dukkhakkhayāya. Dosañca kho, bhikkhave, abhijānaṃ parijānaṃ tattha cittaṃ virājayaṃ pajahaṃ bhabbo dukkhakkhayāyā’’ti. Etamatthaṃ bhagavā avoca. Tatthetaṃ iti vuccati – ‘‘Yena dosena duṭṭhāse, sattā gacchanti duggatiṃ; Taṃ dosaṃ sammadaññāya, pajahanti vipassino; Pahāya na punāyanti, imaṃ lokaṃ kudācana’’nti. Ayampi attho vutto bhagavatā, iti me sutanti. Dasamaṃ. ",
      "english": "",
      "sinhala": "",
      "paliTitle": "Dosapariññāsuttaṃ"
    }
  ],
  "footer": {
    "pali": "Paṭhamo vaggo niṭṭhito. Tassuddānaṃ – Rāgadosā atha moho, kodhamakkhā mānaṃ sabbaṃ; Mānato rāgadosā puna dve, pakāsitā vaggamāhu paṭhamanti.",
    "english": "",
    "sinhala": ""
  }
}