{
  "id": "an2.1",
  "title": {
    "pali": "Kammakaraṇavaggo",
    "english": "The Chapter on Action and Doing",
    "sinhala": "කර්මකරණ වර්ගය"
  },
  "sections": [
    {
      "number": 1,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tatra kho bhagavā bhikkhū āmantesi – ‘‘bhikkhavo’’ti. ‘‘Bhadante’’ti te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Dvemāni, bhikkhave, vajjāni. Katamāni dve? Diṭṭhadhammikañca vajjaṃ samparāyikañca vajjaṃ. Katamañca, bhikkhave, diṭṭhadhammikaṃ vajjaṃ? Idha, bhikkhave, ekacco passati coraṃ āgucāriṃ rājāno gahetvā vividhā kammakāraṇā [vividhāni kammakaraṇāni (ka.)] kārente; kasāhipi tāḷente, vettehipi tāḷente, addhadaṇḍakehipi tāḷente, hatthampi chindante, pādampi chindante, hatthapādampi chindante, kaṇṇampi chindante, nāsampi chindante, kaṇṇanāsampi chindante, bilaṅgathālikampi karonte, saṅkhamuṇḍikampi karonte, rāhumukhampi karonte, jotimālikampi karonte, hatthapajjotikampi karonte, erakavattikampi karonte, cīrakavāsikampi karonte, eṇeyyakampi karonte, baḷisamaṃsikampi karonte, kahāpaṇikampi karonte, khārāpatacchikampi [khārāpaṭicchakampi (syā. kaṃ. ka.)] karonte, palighaparivattikampi karonte, palālapīṭhakampi [palālapiṭṭhikampi (sī.)] karonte, tattenapi telena osiñcante, sunakhehipi khādāpente, jīvantampi sūle uttāsente, asināpi sīsaṃ chindante. ‘‘Tassa evaṃ hoti – ‘yathārūpānaṃ kho pāpakānaṃ kammānaṃ hetu coraṃ āgucāriṃ rājāno gahetvā vividhā kammakāraṇā kārenti; kasāhipi tāḷenti, vettehipi tāḷenti, addhadaṇḍakehipi tāḷenti, hatthampi chindanti, pādampi chindanti, hatthapādampi chindanti, kaṇṇampi chindanti, nāsampi chindanti, kaṇṇanāsampi chindanti, bilaṅgathālikampi karonti, saṅkhamuṇḍikampi karonti, rāhumukhampi karonti, jotimālikampi karonti, hatthapajjotikampi karonti, erakavattikampi karonti, cīrakavāsikampi karonti, eṇeyyakampi karonti, baḷisamaṃsikampi karonti, kahāpaṇikampi karonti, khārāpatacchikampi karonti, palighaparivattikampi karonti, palālapīṭhakampi karonti, tattenapi telena osiñcanti, sunakhehipi khādāpenti, jīvantampi sūle uttāsenti, asināpi sīsaṃ chindanti. Ahañceva [ahañce (?)] kho pana evarūpaṃ pāpakammaṃ kareyyaṃ, mampi rājāno gahetvā evarūpā vividhā kammakāraṇā kāreyyuṃ; kasāhipi tāḷeyyuṃ…pe… asināpi sīsaṃ chindeyyu’nti. So diṭṭhadhammikassa vajjassa bhīto na paresaṃ pābhataṃ vilumpanto carati. Idaṃ vuccati, bhikkhave, diṭṭhadhammikaṃ vajjaṃ. ‘‘Katamañca, bhikkhave, samparāyikaṃ vajjaṃ? Idha, bhikkhave, ekacco iti paṭisañcikkhati – ‘kāyaduccaritassa kho pana pāpako dukkho vipāko abhisamparāyaṃ, vacīduccaritassa pāpako dukkho vipāko abhisamparāyaṃ, manoduccaritassa pāpako dukkho vipāko abhisamparāyaṃ. Ahañceva kho pana kāyena duccaritaṃ careyyaṃ, vācāya duccaritaṃ careyyaṃ, manasā duccaritaṃ careyyaṃ. Kiñca taṃ yāhaṃ na kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjeyya’nti. So samparāyikassa vajjassa bhīto kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti, manoduccaritaṃ pahāya manosucaritaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, samparāyikaṃ vajjaṃ. ‘‘Imāni kho, bhikkhave, dve vajjāni. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘diṭṭhadhammikassa vajjassa bhāyissāma, samparāyikassa vajjassa bhāyissāma, vajjabhīruno bhavissāma vajjabhayadassāvino’ti. Evañhi vo, bhikkhave, sikkhitabbaṃ. Vajjabhīruno, bhikkhave, vajjabhayadassāvino etaṃ pāṭikaṅkhaṃ yaṃ parimuccissati sabbavajjehī’’ti. Paṭhamaṃ.",
      "english": "Thus have I heard. On one occasion the Blessed One was staying at Sāvatthī, in Jeta’s Grove, Anāthapiṇḍika’s Monastery. There the Blessed One addressed the monks, \"Monks!\" \"Venerable sir,\" they replied to the Blessed One. The Blessed One said this: \"There are these two kinds of dangers, monks. Which two? Dangers in this present life and dangers in future lives. And what, monks, is a danger in this present life? Here, monks, someone sees a criminal, an evildoer, whom kings have seized and are inflicting various kinds of punishments upon: beating with whips, beating with canes, beating with cudgels; cutting off hands, cutting off feet, cutting off hands and feet; cutting off ears, cutting off noses, cutting off ears and noses; making him into a rice-gruel pot, making him into a conch-shell shaven head, making him into Rāhu’s mouth, making him into a garland of light, making him into a torch-hand, making him into a rag-strip, making him into a bark-garment wearer, making him into a deer, making him into a flesh-hook, making him into a coin-shave, making him into a salt-alkali slice, making him into a turning-bar, making him into a straw mat; dousing with hot oil, feeding to dogs, impaling alive, or beheading with a sword.\"\n\n\"To him it occurs: ‘On account of such evil deeds, kings seize a criminal, an evildoer, and inflict various kinds of punishments upon him: beating with whips, beating with canes, beating with cudgels; cutting off hands, cutting off feet, cutting off hands and feet, cutting off ears, cutting off noses, cutting off ears and noses; making him into a rice-gruel pot, making him into a conch-shell shaven head, making him into Rāhu’s mouth, making him into a garland of light, making him into a torch-hand, making him into a rag-strip, making him into a bark-garment wearer, making him into a deer, making him into a flesh-hook, making him into a coin-shave, making him into a salt-alkali slice, making him into a turning-bar, making him into a straw mat; dousing him with hot oil, feeding him to dogs, impaling him alive, or beheading him with a sword. If I were to commit such evil deeds, kings would seize me too and inflict such various kinds of punishments upon me: beating me with whips, and so on, up to beheading me with a sword.’ Being thus afraid of danger in this present life, he does not go about plundering others' possessions. This, monks, is called a danger in this present life.\"\n\n\"And what, monks, is a danger in future lives? Here, monks, someone reflects thus: ‘Evil and painful indeed is the result of misconduct in body in future lives; evil and painful is the result of misconduct in speech in future lives; evil and painful is the result of misconduct in mind in future lives. If I were to engage in misconduct by body, misconduct by speech, misconduct by mind, what would prevent me, at the breaking up of the body, after death, from being reborn in a state of deprivation, a bad destination, a lower realm, hell?’ Being thus afraid of danger in future lives, he abandons misconduct in body and develops good conduct in body; he abandons misconduct in speech and develops good conduct in speech; he abandons misconduct in mind and develops good conduct in mind; he maintains himself in purity. This, monks, is called a danger in future lives.\"\n\n\"These, monks, are the two kinds of dangers. Therefore, monks, you should train yourselves thus: ‘We will be afraid of dangers in this present life, we will be afraid of dangers in future lives, we will be fearful of danger, we will see the fear in danger.’ That is how you should train yourselves, monks. For those who are fearful of danger, monks, who see the fear in danger, this is to be expected: that they will be liberated from all dangers.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක භාග්‍යවතුන් වහන්සේ සැවැත් නුවර ජේතවනයේ අනේපිඬු සිටුතුමාගේ ආරාමයෙහි වැඩ වාසය කළ සේක. එහිදී භාග්‍යවතුන් වහන්සේ භික්ෂූන් වහන්සේලා අමතා ‘‘මහණෙනි’’ යි වදාළ සේක. ‘‘වහන්සැ’’ යි කියා ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්හ. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n‘‘මහණෙනි, මේ වරදවල් දෙකකි. කවරේද ඒ දෙක? මේ ආත්මයේදී දැකිය හැකි වරදක් (ලෞකික දඬුවම්) සහ පරලොවදී විපාක දෙන වරදක් (කර්ම විපාක) වශයෙනි. මහණෙනි, මේ ආත්මයේදී දැකිය හැකි වරද යනු කවරේද? මහණෙනි, මෙහි ඇතැමෙක් අපරාධ කළ සොරකු රජවරුන් විසින් අල්ලාගෙන, කසවලින් ද පහර දෙමින්, වේවැල්වලින් ද පහර දෙමින්, අඩ කොටන්වලින් ද පහර දෙමින්, අත් ද කපමින්, පා ද කපමින්, අත්පා ද කපමින්, කන් ද කපමින්, නාස් ද කපමින්, කන් නාස් ද කපමින්, හිස් කබල බඳුනක් ලෙස කපා තෙල් පුරවා පිසින බිලංගථාලිකා දඬුවම ද කරමින්, සක් මුහුණක් මෙන් හිස් කබල කපා දඬුවම් කරන සංඛමුණ්ඩිකා දඬුවම ද කරමින්, රාහුගේ මුඛය මෙන් කට විදින රාහුමුඛ දඬුවම ද කරමින්, පහන් වැටක් මෙන් සිරුර දැල්වීම නම් ජෝතිමාලිකා දඬුවම ද කරමින්, දෑත් පහන් මෙන් දැල්වීම නම් හත්ථපජ්ජෝතිකා දඬුවම ද කරමින්, එළු ලොම් මෙන් මස් ඉරා දැල්වීම නම් ඒරකවත්තිකා දඬුවම ද කරමින්, කඩමාලු මෙන් සම ගලවා අඳින චීරකවාසිකා දඬුවම ද කරමින්, මුවකු මෙන් සිව්පා ගාත්වලින් දුවන්නට සලස්වන ඒණෙය්යකා දඬුවම ද කරමින්, බිලී මස් මෙන් මස් කපා තබන බළිසමංසිකා දඬුවම ද කරමින්, කාසි මෙන් මස් කපා තබන කහාපණිකා දඬුවම ද කරමින්, ක්ෂාර දමා කපා දඬුවම් කරන ඛාරාපටච්ඡිකා දඬුවම ද කරමින්, යකඩ මුගුරකින් පෙරළා තලන පලිඝපරිවත්තිකා දඬුවම ද කරමින්, පිදුරු පිට මත තබා තලන පලාලපීඨිකා දඬුවම ද කරමින්, රත් වූ තෙල්වලින් ද තෙමමින්, බල්ලන් ලවා ද කැවීමෙන්, ජීවත්ව සිටියදීම උල හිඳුවමින්, කඩුවලින් ද හිස සිඳිමින්, විවිධ වූ දඬුවම් ක්‍රියා කරවනු දකී.\n\n‘‘ඔහුට මෙසේ සිතේ: ‘මේ වැනි පාපී කර්ම හේතු කොටගෙන රජවරු අපරාධ කළ සොරකු අල්ලාගෙන විවිධ වූ දඬුවම් කරවති; කසවලින් ද පහර දෙති, වේවැල්වලින් ද පහර දෙති, අඩ කොටන්වලින් ද පහර දෙති, අත් ද කපති, පා ද කපති, අත්පා ද කපති, කන් ද කපති, නාස් ද කපති, කන් නාස් ද කපති, හිස් කබල බඳුනක් ලෙස කපා තෙල් පුරවා පිසින බිලංගථාලිකා දඬුවම ද කරති, සක් මුහුණක් මෙන් හිස් කබල කපා දඬුවම් කරන සංඛමුණ්ඩිකා දඬුවම ද කරති, රාහුගේ මුඛය මෙන් කට විදින රාහුමුඛ දඬුවම ද කරති, පහන් වැටක් මෙන් සිරුර දැල්වීම නම් ජෝතිමාලිකා දඬුවම ද කරති, දෑත් පහන් මෙන් දැල්වීම නම් හත්ථපජ්ජෝතිකා දඬුවම ද කරති, එළු ලොම් මෙන් මස් ඉරා දැල්වීම නම් ඒරකවත්තිකා දඬුවම ද කරති, කඩමාලු මෙන් සම ගලවා අඳින චීරකවාසිකා දඬුවම ද කරති, මුවකු මෙන් සිව්පා ගාත්වලින් දුවන්නට සලස්වන ඒණෙය්යකා දඬුවම ද කරති, බිලී මස් මෙන් මස් කපා තබන බළිසමංසිකා දඬුවම ද කරති, කාසි මෙන් මස් කපා තබන කහාපණිකා දඬුවම ද කරති, ක්ෂාර දමා කපා දඬුවම් කරන ඛාරාපටච්ඡිකා දඬුවම ද කරති, යකඩ මුගුරකින් පෙරළා තලන පලිඝපරිවත්තිකා දඬුවම ද කරති, පිදුරු පිට මත තබා තලන පලාලපීඨිකා දඬුවම ද කරති, රත් වූ තෙල්වලින් ද තෙමති, බල්ලන් ලවා ද කැවීමෙන්, ජීවත්ව සිටියදීම උල හිඳුවති, කඩුවලින් ද හිස සිඳිති. යම් හෙයකින් මා ද මෙවැනි පාපී කර්මයක් කළහොත්, රජවරු මා ද අල්ලාගෙන මෙවැනි විවිධ වූ දඬුවම් ක්‍රියා කරවනු ඇත; කසවලින් ද පහර දෙනු ඇත... කඩුවලින් ද හිස සිඳිනු ඇත.’යි ඔහුට සිතේ. ඔහු මේ ආත්මයේදී දැකිය හැකි වරදට බිය වී අනුන්ගේ දේපළ පැහැර නොගෙන වාසය කරයි. මහණෙනි, මෙය ‘මේ ආත්මයේදී දැකිය හැකි වරද’ යැයි කියනු ලැබේ.\n\n‘‘මහණෙනි, පරලොවදී විපාක දෙන වරද යනු කවරේද? මහණෙනි, මෙහි ඇතැමෙක් මෙසේ නුවණින් විමසයි: ‘කාය දුශ්චරිතයට පරලොවදී නපුරු දුක් විපාක ඇත. වචී දුශ්චරිතයට පරලොවදී නපුරු දුක් විපාක ඇත. මනෝ දුශ්චරිතයට පරලොවදී නපුරු දුක් විපාක ඇත. මා කයින් දුශ්චරිතයෙහි හැසිරුණහොත්, වචනයෙන් දුශ්චරිතයෙහි හැසිරුණහොත්, මනසින් දුශ්චරිතයෙහි හැසිරුණහොත්, කය බිඳී මරණින් මතු අපාය, දුර්ගති, විනිපාත, නිරයෙහි නොවැටී සිටීමට මට කුමක් කළ හැකිද?’යි. ඔහු පරලොවදී විපාක දෙන වරදට බිය වී, කාය දුශ්චරිතය අත්හැර කාය සුචරිතය වඩයි. වචී දුශ්චරිතය අත්හැර වචී සුචරිතය වඩයි. මනෝ දුශ්චරිතය අත්හැර මනෝ සුචරිතය වඩයි. පිරිසිදු ආත්මයක් පවත්වයි. මහණෙනි, මෙය ‘පරලොවදී විපාක දෙන වරද’ යැයි කියනු ලැබේ.\n\n‘‘මහණෙනි, මේ වරදවල් දෙකයි. එබැවින් මහණෙනි, මෙසේ හික්මිය යුතුයි: ‘අපි මේ ආත්මයේදී දැකිය හැකි වරදට බිය වන්නෙමු. පරලොවදී විපාක දෙන වරදට බිය වන්නෙමු. වරදට බිය වන, වරදේ භය දකින අය වන්නෙමු’යි. මහණෙනි, ඔබ විසින් මෙසේම හික්මිය යුතුයි. මහණෙනි, වරදට බිය වන, වරදේ භය දකින අය සියලු වරදවලින් මිදීම අපේක්ෂා කළ හැකිය.’’",
      "paliTitle": "Vajjasuttaṃ",
      "englishTitle": "The Discourse on Faults",
      "sinhalaTitle": "වජ්ජ සූත්‍රය"
    },
    {
      "number": 2,
      "pali": "‘‘Dvemāni, bhikkhave, padhānāni durabhisambhavāni lokasmiṃ. Katamāni dve? Yañca gihīnaṃ agāraṃ ajjhāvasataṃ cīvarapiṇḍapātasenāsanagilānapaccayabhesajjaparikkhārānuppadānatthaṃ padhānaṃ, yañca agārasmā anagāriyaṃ pabbajitānaṃ sabbūpadhipaṭinissaggatthaṃ padhānaṃ. Imāni kho, bhikkhave, dve padhānāni durabhisambhavāni lokasmiṃ. ‘‘Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ padhānānaṃ yadidaṃ sabbūpadhipaṭinissaggatthaṃ padhānaṃ. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘sabbūpadhipaṭinissaggatthaṃ padhānaṃ padahissāmā’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Dutiyaṃ.",
      "english": "Monks, these two endeavors are difficult to achieve in the world. Which two? One is the endeavor of householders dwelling in a home, to provide requisites such as robes, almsfood, lodgings, and medicines for the sick. And the other is the endeavor of those who have gone forth from the home to the homeless life, for the purpose of relinquishing all attachments that lead to renewed existence. Indeed, Monks, these two endeavors are difficult to achieve in the world.\n\nMonks, of these two endeavors, the foremost is the endeavor for the relinquishment of all attachments that lead to renewed existence. Therefore, Monks, you should train yourselves thus: ‘We shall undertake the endeavor for the relinquishment of all attachments that lead to renewed existence.’ Indeed, Monks, this is how you should train yourselves.",
      "sinhala": "භික්ෂූන් වහන්සේලා, ලෝකයෙහි මේ ප්‍රධාන වීර්යයන් දෙකක් සාක්ෂාත් කර ගැනීමට දුෂ්කර ය. කවර දෙකක් ද යත්: ගෘහයෙහි වාසය කරන ගිහියන් විසින් සිවුරු, පිණ්ඩපාතය, සේනාසන, ගිලන්පස සහ බෙහෙත් පිරිකර සැපයීම පිණිස කරන ප්‍රධාන වීර්යය ද, ගෘහයෙන් නික්ම අනාගාරික බවට පැවිදි වූවන් විසින් සියලු උපධීන් සම්පූර්ණයෙන් අත්හැරීම පිණිස කරන ප්‍රධාන වීර්යය ද යන මේ දෙක යි. භික්ෂූන් වහන්සේලා, සැබැවින්ම මේ ප්‍රධාන වීර්යයන් දෙක ලෝකයෙහි සාක්ෂාත් කර ගැනීමට දුෂ්කර ය.\n\nභික්ෂූන් වහන්සේලා, මේ ප්‍රධාන වීර්යයන් දෙක අතුරින්, සියලු උපධීන් සම්පූර්ණයෙන් අත්හැරීම පිණිස කරන ප්‍රධාන වීර්යය ම අග්‍ර වේ. එහෙයින්, භික්ෂූන් වහන්සේලා, ‘අපි සියලු උපධීන් සම්පූර්ණයෙන් අත්හැරීම පිණිස වන ප්‍රධාන වීර්යය කරන්නෙමු’ යි මෙලෙස හික්මිය යුතු ය. භික්ෂූන් වහන්සේලා, සැබැවින්ම නුඹලා විසින් මෙලෙස හික්මිය යුතු ය.",
      "paliTitle": "Padhānasuttaṃ",
      "englishTitle": "The Discourse on Effort",
      "sinhalaTitle": "පධාන සූත්‍රය"
    },
    {
      "number": 3,
      "pali": "‘‘Dveme, bhikkhave, dhammā tapanīyā. Katame dve? Idha, bhikkhave, ekaccassa kāyaduccaritaṃ kataṃ hoti, akataṃ hoti kāyasucaritaṃ; vacīduccaritaṃ kataṃ hoti; akataṃ hoti vacīsucaritaṃ; manoduccaritaṃ kataṃ hoti, akataṃ hoti manosucaritaṃ. So ‘kāyaduccaritaṃ me kata’nti tappati, ‘akataṃ me kāyasucarita’nti tappati; ‘vacīduccaritaṃ me kata’nti tappati, ‘akataṃ me vacīsucarita’nti tappati; ‘manoduccaritaṃ me kata’nti tappati, ‘akataṃ me manosucarita’nti tappati. Ime kho, bhikkhave, dve dhammā tapanīyā’’ti. Tatiyaṃ.",
      "english": "Monks, these two things cause torment. Which two? Here, monks, for some person, evil bodily conduct has been done, and good bodily conduct has not been done; evil verbal conduct has been done, and good verbal conduct has not been done; evil mental conduct has been done, and good mental conduct has not been done. That person burns with remorse, thinking: ‘My evil bodily conduct has been done,’ and he burns with remorse, thinking: ‘My good bodily conduct has not been done.’ He burns with remorse, thinking: ‘My evil verbal conduct has been done,’ and he burns with remorse, thinking: ‘My good verbal conduct has not been done.’ He burns with remorse, thinking: ‘My evil mental conduct has been done,’ and he burns with remorse, thinking: ‘My good mental conduct has not been done.’ These, monks, are the two things that cause torment.",
      "sinhala": "මහණෙනි, මේ කරුණු දෙකක් පසුතැවීමට හේතු වන්නාහ. ඒ දෙක කවරේද?\n\nමහණෙනි, මෙහිලා ඇතැම් පුද්ගලයෙකු විසින් කායදුශ්චරිතය කරනු ලැබ ඇත්තේය, කායසුචරිතය කරනු ලැබ නොමැත්තේය. වචීදුශ්චරිතය කරනු ලැබ ඇත්තේය, වචීසුචරිතය කරනු ලැබ නොමැත්තේය. මනෝදුශ්චරිතය කරනු ලැබ ඇත්තේය, මනෝසුචරිතය කරනු ලැබ නොමැත්තේය.\n\nඔහු 'මම කායදුශ්චරිතය කර ඇත්තෙමි' යැයි පසුතැවේ, 'මම කායසුචරිතය නොකර ඇත්තෙමි' යැයි පසුතැවේ. 'මම වචීදුශ්චරිතය කර ඇත්තෙමි' යැයි පසුතැවේ, 'මම වචීසුචරිතය නොකර ඇත්තෙමි' යැයි පසුතැවේ. 'මම මනෝදුශ්චරිතය කර ඇත්තෙමි' යැයි පසුතැවේ, 'මම මනෝසුචරිතය නොකර ඇත්තෙමි' යැයි පසුතැවේ.\n\nමහණෙනි, මේ ධර්ම කාරණා දෙක පසුතැවීමට හේතු වන්නාහ.",
      "paliTitle": "Tapanīyasuttaṃ",
      "englishTitle": "The Discourse on Torment",
      "sinhalaTitle": "තාපනීය සූත්‍‌රය"
    },
    {
      "number": 4,
      "pali": "‘‘Dveme, bhikkhave, dhammā atapanīyā. Katame dve? Idha, bhikkhave, ekaccassa kāyasucaritaṃ kataṃ hoti, akataṃ hoti kāyaduccaritaṃ; vacīsucaritaṃ kataṃ hoti, akataṃ hoti vacīduccaritaṃ; manosucaritaṃ kataṃ hoti, akataṃ hoti manoduccaritaṃ. So ‘kāyasucaritaṃ me kata’nti na tappati, ‘akataṃ me kāyaduccarita’nti na tappati; ‘vacīsucaritaṃ me kata’nti na tappati, ‘akataṃ me vacīduccarita’nti na tappati; ‘manosucaritaṃ me kata’nti na tappati, ‘akataṃ me manoduccarita’nti na tappati. Ime kho, bhikkhave, dve dhammā atapanīyā’’ti. Catutthaṃ.",
      "english": "Monks, these two states do not cause remorse. Which two? Here, monks, a certain person has performed wholesome bodily conduct and has not performed unwholesome bodily conduct; has performed wholesome verbal conduct and has not performed unwholesome verbal conduct; has performed wholesome mental conduct and has not performed unwholesome mental conduct. He does not feel remorse, thinking, 'Wholesome bodily conduct has been done by me,' nor does he feel remorse, thinking, 'Unwholesome bodily conduct has not been done by me.' He does not feel remorse, thinking, 'Wholesome verbal conduct has been done by me,' nor does he feel remorse, thinking, 'Unwholesome verbal conduct has not been done by me.' He does not feel remorse, thinking, 'Wholesome mental conduct has been done by me,' nor does he feel remorse, thinking, 'Unwholesome mental conduct has not been done by me.' These, monks, are the two states that do not cause remorse.",
      "sinhala": "භික්ෂූනි, මේ ධර්‍ම දෙක ඇතැපනීය වෙති. කවර දෙකක්ද?\n\nභික්ෂූනි, මෙලොවෙහි ඇතැම් පුද්ගලයෙකු විසින් කාය සුචරිතය කරණ ලද්දේ වෙයි, කාය දුශ්චරිතය නොකරණ ලද්දේ වෙයි; වචී සුචරිතය කරණ ලද්දේ වෙයි, වචී දුශ්චරිතය නොකරණ ලද්දේ වෙයි; මනෝ සුචරිතය කරණ ලද්දේ වෙයි, මනෝ දුශ්චරිතය නොකරණ ලද්දේ වෙයි. හෙතෙම ‘මා විසින් කාය සුචරිතය කරණ ලද්දේය’ යනුවෙන් නොතැවෙයි, ‘මා විසින් කාය දුශ්චරිතය නොකරණ ලද්දේය’ යනුවෙන් නොතැවෙයි; ‘මා විසින් වචී සුචරිතය කරණ ලද්දේය’ යනුවෙන් නොතැවෙයි, ‘මා විසින් වචී දුශ්චරිතය නොකරණ ලද්දේය’ යනුවෙන් නොතැවෙයි; ‘මා විසින් මනෝ සුචරිතය කරණ ලද්දේය’ යනුවෙන් නොතැවෙයි, ‘මා විසින් මනෝ දුශ්චරිතය නොකරණ ලද්දේය’ යනුවෙන් නොතැවෙයි. භික්ෂූනි, මේ ධර්‍ම දෙක ඇතැපනීය ධර්‍මයෝය.",
      "paliTitle": "Atapanīyasuttaṃ",
      "englishTitle": "Discourse on Non-Torment",
      "sinhalaTitle": "නොතැවෙන සූත්‍රය"
    },
    {
      "number": 5,
      "pali": "‘‘Dvinnāhaṃ, bhikkhave, dhammānaṃ upaññāsiṃ – yā ca asantuṭṭhitā kusalesu dhammesu, yā ca appaṭivānitā padhānasmiṃ. Appaṭivānī sudāhaṃ, bhikkhave, padahāmi – ‘kāmaṃ taco ca nhāru [nahāru (sī. syā. kaṃ. pī.)] ca aṭṭhi ca avasissatu, sarīre upasussatu maṃsalohitaṃ, yaṃ taṃ purisathāmena purisavīriyena purisaparakkamena pattabbaṃ na taṃ apāpuṇitvā vīriyassa saṇṭhānaṃ bhavissatī’ti. Tassa mayhaṃ, bhikkhave, appamādādhigatā sambodhi, appamādādhigato anuttaro yogakkhemo. Tumhe cepi, bhikkhave, appaṭivānaṃ padaheyyātha – ‘kāmaṃ taco ca nhāru ca aṭṭhi ca avasissatu, sarīre upasussatu maṃsalohitaṃ, yaṃ taṃ purisathāmena purisavīriyena purisaparakkamena pattabbaṃ na taṃ apāpuṇitvā vīriyassa saṇṭhānaṃ bhavissatī’ti, tumhepi, bhikkhave, nacirasseva – yassatthāya kulaputtā sammadeva agārasmā anagāriyaṃ pabbajanti tadanuttaraṃ – brahmacariyapariyosānaṃ diṭṭheva dhamme sayaṃ abhiññā sacchikatvā upasampajja viharissatha. Tasmātiha, bhikkhave, evaṃ sikkhitabbaṃ – ‘appaṭivānaṃ padahissāma. Kāmaṃ taco ca nhāru ca aṭṭhi ca avasissatu, sarīre upasussatu maṃsalohitaṃ, yaṃ taṃ purisathāmena purisavīriyena purisaparakkamena pattabbaṃ na taṃ apāpuṇitvā vīriyassa saṇṭhānaṃ bhavissatī’ti. Evañhi vo, bhikkhave, sikkhitabba’’nti. Pañcamaṃ.",
      "english": "Monks, I have pointed out two qualities: the dissatisfaction with wholesome states, and the unwavering perseverance in exertion. Monks, I strove with unwavering perseverance, thinking: ‘Let my skin, sinews, and bones remain; let the flesh and blood in my body dry up. I will not cease my effort until I have attained that which is to be attained by manly strength, manly energy, and manly endeavor.’ Monks, by diligence I attained perfect awakening; by diligence I attained the unsurpassed security from bondage. And if you too, monks, were to strive with unwavering perseverance, thinking: ‘Let my skin, sinews, and bones remain; let the flesh and blood in my body dry up. I will not cease my effort until I have attained that which is to be attained by manly strength, manly energy, and manly endeavor,’ then you too, monks, not long hence, would realize for yourselves with direct knowledge in this very life and attain the unsurpassed culmination of the holy life, for the sake of which noble sons rightly go forth from home into homelessness, and dwell therein.\n\nTherefore, monks, you should train yourselves thus: ‘We will strive with unwavering perseverance, thinking: \"Let my skin, sinews, and bones remain; let the flesh and blood in my body dry up. I will not cease my effort until I have attained that which is to be attained by manly strength, manly energy, and manly endeavor.\"' This is how you should train yourselves, monks.",
      "sinhala": "මහණෙනි, මම ධර්ම කරුණු දෙකක් ප්‍රකාශ කළෙමි. එනම් කුසල් දහම් පිළිබඳව අසන්තුෂ්ටියත්, වීර්යයෙහි පසුබට නොවීමත් යන දෙකයි. මහණෙනි, මම නම් පසුබට නොවන වීර්යයෙන් යුක්තව මෙසේ වීර්ය කළෙමි: 'සම, නහර, ඇට පමණක් ඉතිරි වේවා. ශරීරයේ මස් ලේ සිඳී වේලී යේවා. මිනිසකුගේ ධෛර්යයෙන්, වීර්යයෙන්, පරාක්‍රමයෙන් ලබාගත යුත්තා වූ යමක් වේද, එය නොලබා මේ වීර්යය නතර නොවන්නේය' යනුවෙනි. මහණෙනි, මා හට අප්‍රමාදයෙන් සම්බෝධිය අවබෝධ විය. අප්‍රමාදයෙන් අනුත්තර වූ යෝගක්ෂේමය අවබෝධ විය.\n\nමහණෙනි, යම් හෙයකින් නුඹලා ද පසුබට නොවන වීර්යයෙන් යුක්තව මෙසේ වීර්ය කරන්නහු නම්: 'සම, නහර, ඇට පමණක් ඉතිරි වේවා. ශරීරයේ මස් ලේ සිඳී වේලී යේවා. මිනිසකුගේ ධෛර්යයෙන්, වීර්යයෙන්, පරාක්‍රමයෙන් ලබාගත යුත්තා වූ යමක් වේද, එය නොලබා මේ වීර්යය නතර නොවන්නේය' යනුවෙනි. මහණෙනි, එසේ වීර්ය කරන්නහු නම්, කුලපුත්‍රයෝ යම් අර්ථයක් පිණිස මැනවින් ගිහිගෙයින් නික්ම අනගාරික බවට පැවිදි වෙත්ද, ඒ අනුත්තර වූ බ්‍රහ්මචාරී ජීවිතයේ අවසානය වූ අරහත් ඵලය, මෙලොවදීම තමන් විසින්ම අවබෝධයෙන් සාක්ෂාත් කරගෙන සම්පූර්ණ කරගෙන වාසය කරන්නහුය. එම නිසා, මහණෙනි, නුඹලා මෙසේ හික්මිය යුතුය: 'අපි පසුබට නොවන වීර්යයෙන් යුක්තව වීර්ය කරන්නෙමු. සම, නහර, ඇට පමණක් ඉතිරි වේවා. ශරීරයේ මස් ලේ සිඳී වේලී යේවා. මිනිසකුගේ ධෛර්යයෙන්, වීර්යයෙන්, පරාක්‍රමයෙන් ලබාගත යුත්තා වූ යමක් වේද, එය නොලබා මේ වීර්යය නතර නොවන්නේය' යනුවෙනි. මහණෙනි, නුඹලා මෙසේම හික්මිය යුතුමය.",
      "paliTitle": "Upaññātasuttaṃ",
      "englishTitle": "The Known Discourse",
      "sinhalaTitle": "උපඤ්ඤාත සූත්‍රය"
    },
    {
      "number": 6,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Yā ca saṃyojaniyesu dhammesu assādānupassitā, yā ca saṃyojaniyesu dhammesu nibbidānupassitā. Saṃyojaniyesu, bhikkhave, dhammesu assādānupassī viharanto rāgaṃ na pajahati, dosaṃ na pajahati, mohaṃ na pajahati. Rāgaṃ appahāya, dosaṃ appahāya, mohaṃ appahāya na parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. Na parimuccati dukkhasmāti vadāmi. ‘‘Saṃyojaniyesu, bhikkhave, dhammesu nibbidānupassī viharanto rāgaṃ pajahati, dosaṃ pajahati, mohaṃ pajahati. Rāgaṃ pahāya, dosaṃ pahāya, mohaṃ pahāya, parimuccati jātiyā jarāya maraṇena sokehi paridevehi dukkhehi domanassehi upāyāsehi. Parimuccati dukkhasmāti vadāmi. Ime kho, bhikkhave, dve dhammā’’ti. Chaṭṭhaṃ.",
      "english": "Monks, there are these two principles. Which two? The contemplation of gratification in regard to phenomena that lead to fetters, and the contemplation of dispassion in regard to phenomena that lead to fetters.\n\nMonks, one who dwells contemplating gratification in regard to phenomena that lead to fetters does not abandon lust, does not abandon hatred, does not abandon delusion. Not having abandoned lust, not having abandoned hatred, not having abandoned delusion, one is not released from birth, aging, death, sorrow, lamentation, pain, distress, and despair. I say that one is not released from suffering.\n\nMonks, one who dwells contemplating dispassion in regard to phenomena that lead to fetters abandons lust, abandons hatred, abandons delusion. Having abandoned lust, having abandoned hatred, having abandoned delusion, one is released from birth, aging, death, sorrow, lamentation, pain, distress, and despair. I say that one is released from suffering. These, monks, are the two principles.",
      "sinhala": "මහණෙනි, මේ ධර්මයන් දෙකකි. ඒ දෙක කවරේද? ඒවා නම් සංයෝජනයට හේතු වන ධර්මයන්හි ආස්වාදය අනුපස්සනා කිරීමත්, සංයෝජනයට හේතු වන ධර්මයන්හි නිර්වේදය අනුපස්සනා කිරීමත් ය. මහණෙනි, සංයෝජනයට හේතු වන ධර්මයන්හි ආස්වාදය අනුපස්සනා කරමින් වෙසෙන තැනැත්තා රාගය පහ නොකරයි, ද්වේෂය පහ නොකරයි, මෝහය පහ නොකරයි. රාගය පහ නොකර, ද්වේෂය පහ නොකර, මෝහය පහ නොකර ඉපදීමෙන්, දිරාපත්වීමෙන්, මරණයෙන්, ශෝකයෙන්, වැළපීමෙන්, දුකෙන්, දොම්නසින්, උපද්‍රවයන්ගෙන් මිදෙන්නේ නැත. ඔහු දුකින් මිදෙන්නේ නැතැයි මම කියමි.\n\nමහණෙනි, සංයෝජනයට හේතු වන ධර්මයන්හි නිර්වේදය අනුපස්සනා කරමින් වෙසෙන තැනැත්තා රාගය පහ කරයි, ද්වේෂය පහ කරයි, මෝහය පහ කරයි. රාගය පහකොට, ද්වේෂය පහකොට, මෝහය පහකොට ඉපදීමෙන්, දිරාපත්වීමෙන්, මරණයෙන්, ශෝකයෙන්, වැළපීමෙන්, දුකෙන්, දොම්නසින්, උපද්‍රවයන්ගෙන් මිදෙයි. ඔහු දුකින් මිදෙයි කියා මම කියමි. මහණෙනි, මේ ධර්මයන් දෙක මෙයයි.",
      "paliTitle": "Saṃyojanasuttaṃ",
      "englishTitle": "Discourse on the Fetters",
      "sinhalaTitle": "සංයෝජන සූත්‍රය"
    },
    {
      "number": 7,
      "pali": "‘‘Dveme, bhikkhave, dhammā kaṇhā. Katame dve? Ahirikañca anottappañca. Ime kho, bhikkhave, dve dhammā kaṇhā’’ti. Sattamaṃ.",
      "english": "Monks, these two qualities are dark. Which two? Shamelessness and fearlessness of wrongdoing. Indeed, monks, these two qualities are dark.",
      "sinhala": "භික්ෂූනි, මේ අකුසල ධර්ම දෙකක් වෙති. ඒ කවර දෙකක්ද යත්? අහිරිකය සහ අනොත්තප්පයයි. භික්ෂූනි, මේ අකුසල ධර්ම දෙකක් වෙති.",
      "paliTitle": "Kaṇhasuttaṃ",
      "englishTitle": "The Discourse on Evil",
      "sinhalaTitle": "කණ්හ සූත්‍රය"
    },
    {
      "number": 8,
      "pali": "‘‘Dveme, bhikkhave, dhammā sukkā. Katame dve? Hirī [hiri (sī. syā. kaṃ. pī.)] ca ottappañca. Ime kho, bhikkhave, dve dhammā sukkā’’ti. Aṭṭhamaṃ.",
      "english": "Monks, there are these two wholesome qualities. Which two? Moral shame and moral dread. Indeed, Monks, these are the two wholesome qualities.",
      "sinhala": "මහණෙනි, මේ ධර්ම දෙකක් ශුක‍්ල ය. ඒ දෙක කවරේද? හිරි සහ ඔතප් ය. මහණෙනි, මේ ධර්ම දෙකම ශුක‍්ල ය.",
      "paliTitle": "Sukkasuttaṃ",
      "englishTitle": "The Wholesome Discourse",
      "sinhalaTitle": "සුක්ක සූත්‍\\u200dරය"
    },
    {
      "number": 9,
      "pali": "‘‘Dveme, bhikkhave, dhammā sukkā lokaṃ pālenti. Katame dve? Hirī ca ottappañca. Ime kho, bhikkhave, dve sukkā dhammā lokaṃ na pāleyyuṃ, nayidha paññāyetha mātāti vā mātucchāti vā mātulānīti vā ācariyabhariyāti vā garūnaṃ dārāti vā. Sambhedaṃ loko agamissa, yathā ajeḷakā kukkuṭasūkarā soṇasiṅgālā [soṇasigālā (sī. syā. kaṃ. pī.)]. Yasmā ca kho, bhikkhave, ime dve sukkā dhammā lokaṃ pālenti tasmā paññāyati [paññāyanti (sī.)] mātāti vā mātucchāti vā mātulānīti vā ācariyabhariyāti vā garūnaṃ dārāti vā’’ti. Navamaṃ.",
      "english": "Monks, these two bright qualities protect the world. Which two? Moral shame and moral dread. Indeed, monks, if these two bright qualities did not protect the world, then here there would not be recognized: 'mother,' or 'mother's sister,' or 'maternal uncle's wife,' or 'teacher's wife,' or 'wives of respected persons.' The world would fall into utter confusion, just like goats and sheep, chickens and pigs, dogs and jackals. But because, monks, these two bright qualities protect the world, therefore there are recognized: 'mother,' or 'mother's sister,' or 'maternal uncle's wife,' or 'teacher's wife,' or 'wives of respected persons.'",
      "sinhala": "මහණෙනි, මේ ශුභ ධර්ම දෙකක් ලෝකය ආරක්ෂා කරයි. ඒ කවර දෙකක්ද? ඒ නම් හිරි සහ ඔතප් යන දෙකය. මහණෙනි, මේ ශුභ ධර්ම දෙක ලෝකය ආරක්ෂා නොකරන්නේ නම්, එවිට මව යැයි හෝ, මවගේ සහෝදරිය යැයි හෝ, මාමාගේ බිරිඳ යැයි හෝ, ආචාර්ය භාර්යාව යැයි හෝ, ගරු කටයුතු පුද්ගලයන්ගේ භාර්යාවන් යැයි හෝ කිසිවක් හඳුනාගැනීමක් මෙහි සිදු නොවනු ඇත. ලෝකය එළුබැටළුවන්, කුකුළන්, ඌරන්, බල්ලන් හා හිවළුන් මෙන් සම්භේදයට පත්වනු ඇත. මහණෙනි, යම් හෙයකින් මේ ශුභ ධර්ම දෙක ලෝකය ආරක්ෂා කරන්නේද, එහෙයින් මව යැයි හෝ, මවගේ සහෝදරිය යැයි හෝ, මාමාගේ බිරිඳ යැයි හෝ, ආචාර්ය භාර්යාව යැයි හෝ, ගරු කටයුතු පුද්ගලයන්ගේ භාර්යාවන් යැයි හෝ හඳුනාගැනීමක් පවතී.",
      "paliTitle": "Cariyasuttaṃ",
      "englishTitle": "The Discourse on Conduct",
      "sinhalaTitle": "චරියා සූත‍්‍රය"
    },
    {
      "number": 10,
      "pali": "‘‘Dvemā, bhikkhave, vassūpanāyikā. Katamā dve? Purimikā ca pacchimikā ca. Imā kho, bhikkhave, dve vassūpanāyikā’’ti. Dasamaṃ. ",
      "english": "Monks, there are these two commencements of the Rains-retreat. Which two? The former and the latter. Monks, these indeed are the two commencements of the Rains-retreat.",
      "sinhala": "මහණෙනි, මේ වස්‌ එළැඹීම් දෙකකි. කවරේද ඒ දෙක? පූර්ව වස්‌ එළැඹීම ද, පසු වස්‌ එළැඹීම ද වේ. මහණෙනි, මේ වස්‌ එළැඹීම් දෙක නම් මේවාය.\n\nදසවැනි සූත්‍රයයි.",
      "paliTitle": "Vassūpanāyikasuttaṃ",
      "englishTitle": "The Discourse on the Rains Retreat",
      "sinhalaTitle": "වස් එළඹීමේ සූත‍්‍රය"
    }
  ],
  "footer": {
    "pali": "Kammakaraṇavaggo paṭhamo. Tassuddānaṃ – Vajjā padhānā dve tapanīyā, upaññātena pañcamaṃ; Saṃyojanañca kaṇhañca, sukkaṃ cariyā vassūpanāyikena vaggo.",
    "english": "First Chapter: Performing Deeds",
    "sinhala": "පළමු කම්මකරණ වග්ගය"
  }
}