{
  "id": "an2.17",
  "title": {
    "pali": "Akusalapeyyālaṃ",
    "english": "The series on unwholesome phenomena.",
    "sinhala": "අකුසල් පෙය්යාලය"
  },
  "sections": [
    {
      "number": 191,
      "numberRange": "191-200",
      "pali": "‘‘Dveme, bhikkhave, dhammā akusalā… dveme, bhikkhave, dhammā kusalā… dveme, bhikkhave, dhammā sāvajjā… dveme, bhikkhave, dhammā anavajjā… dveme, bhikkhave, dhammā dukkhudrayā… dveme, bhikkhave, dhammā sukhudrayā… dveme, bhikkhave, dhammā dukkhavipākā… dveme, bhikkhave, dhammā sukhavipākā… dveme, bhikkhave, dhammā sabyābajjhā… dveme, bhikkhave, dhammā abyābajjhā. Katame dve? Akkodho ca anupanāho ca… amakkho ca apaḷāso ca… anissā ca amacchariyañca… amāyā ca asāṭheyyañca… hirī ca ottappañca. Ime kho, bhikkhave, dve dhammā abyābajjhā’’ti. ",
      "english": "Bhikkhus, there are these two unwholesome states. Bhikkhus, there are these two wholesome states. Bhikkhus, there are these two blameworthy states. Bhikkhus, there are these two blameless states. Bhikkhus, there are these two states productive of suffering. Bhikkhus, there are these two states productive of happiness. Bhikkhus, there are these two states with painful results. Bhikkhus, there are these two states with pleasant results. Bhikkhus, there are these two afflictive states. Bhikkhus, there are these two unafflictive states. Which two? Non-anger and non-rancor; non-disparagement and non-contempt; non-envy and non-selfishness; non-deceit and non-fraudulence; moral shame and moral dread. Bhikkhus, these two states are unafflictive.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ අකුසල ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ කුසල ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ සාවද්‍ය ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ අනවද්‍ය ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ දුක් උද්‍ර ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ සුඛ උද්‍ර ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ දුක් විපාක ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ සුඛ විපාක ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ සව‍්‍යාබාධ ධර්ම දෙකකි. භික්ෂූන් වහන්ස, මේ අව‍්‍යාබාධ ධර්ම දෙකකි.\n\nකවර නම් දෙකක්ද?\n\nඅක‍්‍රෝධය සහ අනුපනාහය; අමඛය සහ අපලාශය; අනිස්සාය සහ අමච්ඡරිය; අමායාය සහ අසාඨෙය්‍යය; හිරිය සහ ඔත්තප්පය.\n\nභික්ෂූන් වහන්ස, ඇත්තෙන්ම මේ ධර්ම දෙක අව‍්‍යාබාධ ධර්මයෝ වෙති.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Akusalapeyyālaṃ niṭṭhitaṃ.",
    "english": "",
    "sinhala": ""
  }
}