{
  "id": "an2.6",
  "title": {
    "pali": "Puggalavaggo",
    "english": "The Chapter on Persons",
    "sinhala": "පුද්ගල වග්ගය"
  },
  "sections": [
    {
      "number": 2,
      "pali": "Dutiyapaṇṇāsakaṃ ",
      "english": "The Second Fifty",
      "sinhala": "දෙවන පණ්ණාසකය",
      "paliTitle": ""
    },
    {
      "number": 53,
      "pali": "‘‘Dveme, bhikkhave, puggalā loke uppajjamānā uppajjanti bahujanahitāya bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Katame dve? Tathāgato ca arahaṃ sammāsambuddho, rājā ca cakkavattī. Ime kho, bhikkhave, dve puggalā loke uppajjamānā uppajjanti bahujanahitāya bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussāna’’nti.",
      "english": "Monks, these two individuals, when they appear in the world, appear for the welfare of many, for the happiness of many, and for the benefit, welfare, and happiness of a multitude of beings, both gods and humans. Which two? The Tathāgata, the Arahant, the Perfectly Self-Enlightened One, and a Universal Monarch. Indeed, monks, these two individuals, when they appear in the world, appear for the welfare of many, for the happiness of many, and for the benefit, welfare, and happiness of a multitude of beings, both gods and humans.",
      "sinhala": "මහණෙනි, මේ පුද්ගලයෝ දෙදෙනෙක් ලෝකයෙහි පහළ වෙති. ඒ දෙදෙනා බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සුව පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සුව පිණිස පහළ වෙති. කවරහුද ඒ දෙදෙනා? තථාගත අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ ද, චක්‍රවර්තී රාජයා ද යන මේ දෙදෙනා යි. මහණෙනි, මේ පුද්ගලයෝ දෙදෙනෙක් ලෝකයෙහි පහළ වෙති. ඒ දෙදෙනා බොහෝ දෙනාගේ හිත පිණිස, බොහෝ දෙනාගේ සුව පිණිස, දෙවි මිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සුව පිණිස පහළ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 54,
      "pali": "‘‘Dveme, bhikkhave, puggalā loke uppajjamānā uppajjanti acchariyamanussā. Katame dve? Tathāgato ca arahaṃ sammāsambuddho, rājā ca cakkavattī. Ime kho, bhikkhave, dve puggalā loke uppajjamānā uppajjanti acchariyamanussā’’ti.",
      "english": "There are these two individuals, monks, who, by their very arising in the world, come into being as extraordinary human beings. Which two? The Tathāgata, the Arahant, the Perfectly Self-Awakened One; and a Wheel-turning Monarch. Indeed, monks, these are the two individuals who, by their very arising in the world, come into being as extraordinary human beings.",
      "sinhala": "මහණෙනි, ලෝකයෙහි පහළ වන මේ පුද්ගලයන් දෙදෙනා ආශ්චර්යවත් මනුෂ්‍යයෝ වෙති. ඒ දෙදෙනා කවරහුද යත්? තථාගත වූ අරහත් සම්මාසම්බුද්ධයන් වහන්සේද, සක්විති රජුද යන මේ දෙදෙනාය. මහණෙනි, මේ පුද්ගලයන් දෙදෙනාම ලෝකයෙහි පහළ වන විට ආශ්චර්යවත් මනුෂ්‍යයෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 55,
      "pali": "‘‘Dvinnaṃ, bhikkhave, puggalānaṃ kālakiriyā bahuno janassa anutappā hoti. Katamesaṃ dvinnaṃ? Tathāgatassa ca arahato sammāsambuddhassa, rañño ca cakkavattissa. Imesaṃ kho, bhikkhave, dvinnaṃ puggalānaṃ kālakiriyā bahuno janassa anutappā hotī’’ti.",
      "english": "Monks, the passing away of two types of individuals brings great sorrow to many people. Which two? The Tathāgata, the Arahant, the Perfectly Self-Awakened One; and a Universal Monarch. Indeed, monks, the passing away of these two types of individuals brings great sorrow to many people.",
      "sinhala": "මහණෙනි, පුද්ගලයන් දෙදෙනෙකුගේ කාලක‍්‍රියාව බොහෝ ජනයාට මහත් වූ ශෝකයක් හා පසුතැවිල්ලක් ඇති කරවයි. ඒ දෙදෙනා කවරහු ද? අරහත් වූ සම්මාසම්බුදු තථාගතයන් වහන්සේගේ ද, සක්විති රජුගේ ද. මහණෙනි, මේ පුද්ගලයන් දෙදෙනාගේ කාලක‍්‍රියාව බොහෝ ජනයාට මහත් වූ ශෝකයක් හා පසුතැවිල්ලක් ඇති කරවයි.",
      "paliTitle": ""
    },
    {
      "number": 56,
      "pali": "‘‘Dveme, bhikkhave, thūpārahā. Katame dve? Tathāgato ca arahaṃ sammāsambuddho, rājā ca cakkavattī. Ime kho, bhikkhave, dve thūpārahā’’ti.",
      "english": "Monks, these two are worthy of a memorial shrine. Which two? The Tathāgata, the Arahant, the Perfectly Self-Awakened One; and a Wheel-Turning Monarch. Indeed, monks, these two are worthy of a memorial shrine.",
      "sinhala": "මහණෙනි, මේ දෙදෙනා ස්තූපයකට පූජනීය වන්නාහ. ඒ කවර දෙදෙනෙක්ද? තථාගත අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ ද, චක්‍රවර්තී රජතුමා ද යන දෙදෙනාය. මහණෙනි, සැබවින්ම මේ දෙදෙනා ස්තූපයකට පූජනීය වන්නාහ.",
      "paliTitle": ""
    },
    {
      "number": 57,
      "pali": "‘‘Dveme, bhikkhave, buddhā. Katame dve? Tathāgato ca arahaṃ sammāsambuddho, paccekabuddho ca. Ime kho, bhikkhave, dve buddhā’’ti.",
      "english": "Monks, these are the two kinds of Buddhas. Which two? A Tathāgata, the Arahant, the Perfectly Self-Awakened One, and a Solitary Buddha. Indeed, monks, these are the two kinds of Buddhas.",
      "sinhala": "මහණෙනි, මේ බුද්ධෝ දෙදෙනෙක් වෙති. කවර දෙදෙනෙක්ද? තථාගත අරහත් සම්මාසම්බුද්ධයාණන් වහන්සේ ද, පසේබුදුවරයාණන් වහන්සේ ද යනුයි. මහණෙනි, මේ බුද්ධෝ දෙදෙන වෙති.",
      "paliTitle": ""
    },
    {
      "number": 58,
      "pali": "‘‘Dveme, bhikkhave, asaniyā phalantiyā na santasanti. Katame dve? Bhikkhu ca khīṇāsavo, hatthājānīyo ca. Ime kho, bhikkhave, dve asaniyā phalantiyā na santasantī’’ti.",
      "english": "Monks, these two do not tremble when a thunderbolt crashes. Which two? A monk whose defilements are destroyed, and a thoroughbred elephant. Indeed, monks, these two do not tremble when a thunderbolt crashes.",
      "sinhala": "මහණෙනි, මේ දෙදෙනා විදුලිය පතිත වුව ද නොසෙල්වෙති. ඒ දෙදෙනා කවරහු ද? ක්ෂීණාශ්‍රව භික්ෂුව ද, ආජානීය හස්තියා ද යන මේ දෙදෙනා ය. මහණෙනි, ඇත්තෙන්ම මේ දෙදෙනා විදුලිය පතිත වුව ද නොසෙල්වෙති.",
      "paliTitle": ""
    },
    {
      "number": 59,
      "pali": "‘‘Dveme, bhikkhave, asaniyā phalantiyā na santasanti. Katame dve? Bhikkhu ca khīṇāsavo, assājānīyo ca. Ime kho, bhikkhave, dve asaniyā phalantiyā na santasantī’’ti.",
      "english": "Monks, there are these two who do not tremble when lightning strikes. Which two? A monk whose taints are destroyed, and a noble steed. Indeed, monks, these two do not tremble when lightning strikes.",
      "sinhala": "මහණෙනි, අකුණක් පහර දුන්නද, භීතියට පත් නොවන මේ දෙදෙනෙක් වෙති. ඒ කවර දෙදෙනෙක්ද? ක්ෂීණාශ්‍රව භික්ෂුවක් සහ අශ්වාජානීය අශ්වයෙක්ද යන මේ දෙදෙනාය. මහණෙනි, අකුණක් පහර දුන්නද, භීතියට පත් නොවන මේ දෙදෙනා වනාහී ඔවුහුය.",
      "paliTitle": ""
    },
    {
      "number": 60,
      "pali": "‘‘Dveme, bhikkhave, asaniyā phalantiyā na santasanti. Katame dve? Bhikkhu ca khīṇāsavo, sīho ca migarājā. Ime kho, bhikkhave, dve asaniyā phalantiyā na santasantī’’ti.",
      "english": "Monks, these two do not become terrified when a thunderbolt strikes. Which two? A monk whose defilements are destroyed, and a lion, the king of beasts. Indeed, monks, these two do not become terrified when a thunderbolt strikes.",
      "sinhala": "මහණෙනි, අකුණක් පතිත වුවද තැති නොගන්නෝ දෙදෙනෙක් වෙති. ඒ කවර දෙදෙනෙක්ද? ක්ෂීණාශ්‍රව භික්ෂුවක්ද, මෘගරාජයා වන සිංහයාද යන දෙදෙනාය. මහණෙනි, අකුණක් පතිත වුවද තැති නොගන්නෝ මෙ කී දෙදෙනාම වෙති.",
      "paliTitle": ""
    },
    {
      "number": 61,
      "pali": "‘‘Dveme, bhikkhave, atthavase sampassamānā kiṃpurisā mānusiṃ vācaṃ na bhāsanti. Katame dve? Mā ca musā bhaṇimhā, mā ca paraṃ abhūtena abbhācikkhimhāti. Ime kho, bhikkhave, dve atthavase sampassamānā kiṃpurisā mānusiṃ vācaṃ na bhāsantī’’ti.",
      "english": "Monks, certain individuals, having these two considerations in view, do not speak.\nWhich two?\nLest we speak falsely, and lest we accuse another falsely.\nMonks, indeed, it is having these two considerations in view that certain individuals do not speak.",
      "sinhala": "මහණෙනි, මේ අර්ථ හේතූන් දෙක මැනවින් සලකමින්, අධම පුරුෂයෝ මිනිස් වචනය නොකියති.\n\nඒ දෙක කවරේද?\n\nඅප බොරු නොකියමු, අනුන්හට අභූතයෙන් දොස් නොනඟමු යන මේ හේතූන්ය.\n\nමහණෙනි, අධම පුරුෂයෝ මේ අර්ථ හේතූන් දෙක මැනවින් සලකමින්, මිනිස් වචනය නොකියති.",
      "paliTitle": ""
    },
    {
      "number": 62,
      "pali": "‘‘Dvinnaṃ dhammānaṃ, bhikkhave, atitto appaṭivāno mātugāmo kālaṃ karoti. Katamesaṃ dvinnaṃ? Methunasamāpattiyā ca vijāyanassa ca. Imesaṃ kho, bhikkhave, dvinnaṃ dhammānaṃ atitto appaṭivāno mātugāmo kālaṃ karotī’’ti.",
      "english": "Monks, a woman passes away unsatisfied and unrepelled by two things. Which two? By sexual union and by childbirth. Indeed, monks, a woman passes away unsatisfied and unrepelled by these two things.",
      "sinhala": "මහණෙනි, ස්ත්‍රියක් ධර්‍මයන් දෙකකින් නොසෑහී, නොපිළිකුල්ව කාලක්‍රියා කරයි. ඒ දෙක කවරේද? මෛථුන සමාපත්තිය සහ දරු ප්‍රසූතිය යනුයි. මහණෙනි, ඇත්තෙන්ම ස්ත්‍රියක් ධර්‍මයන් මේ දෙකින් නොසෑහී, නොපිළිකුල්වම කාලක්‍රියා කරයි.",
      "paliTitle": ""
    },
    {
      "number": 63,
      "pali": "‘‘Asantasannivāsañca vo, bhikkhave, desessāmi santasannivāsañca. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Kathañca, bhikkhave, asantasannivāso hoti, kathañca asanto sannivasanti? Idha, bhikkhave, therassa bhikkhuno evaṃ hoti – ‘theropi maṃ na vadeyya, majjhimopi maṃ na vadeyya, navopi maṃ na vadeyya; therampāhaṃ na vadeyyaṃ, majjhimampāhaṃ na vadeyyaṃ, navampāhaṃ na vadeyyaṃ. Thero cepi maṃ vadeyya ahitānukampī maṃ vadeyya no hitānukampī, noti naṃ vadeyyaṃ viheṭheyyaṃ [viheseyyaṃ (sī. syā. kaṃ. pī.)] passampissa nappaṭikareyyaṃ. Majjhimo cepi maṃ vadeyya…pe… navo cepi maṃ vadeyya ahitānukampī maṃ vadeyya no hitānukampī, noti naṃ vadeyyaṃ viheṭheyyaṃ passampissa nappaṭikareyyaṃ’. Majjhimassapi bhikkhuno evaṃ hoti…pe… navassapi bhikkhuno evaṃ hoti – ‘theropi maṃ na vadeyya, majjhimopi maṃ na vadeyya, navopi maṃ na vadeyya; therampāhaṃ na vadeyyaṃ, majjhimampāhaṃ na vadeyyaṃ, navampāhaṃ na vadeyyaṃ. Thero cepi maṃ vadeyya ahitānukampī maṃ vadeyya no hitānukampī noti naṃ vadeyyaṃ viheṭheyyaṃ passampissa nappaṭikareyyaṃ. Majjhimo cepi maṃ vadeyya…pe… navo cepi maṃ vadeyya ahitānukampī maṃ vadeyya no hitānukampī, noti naṃ vadeyyaṃ viheṭheyyaṃ passampissa nappaṭikareyyaṃ’. Evaṃ kho, bhikkhave, asantasannivāso hoti, evañca asanto sannivasanti. ‘‘Kathañca, bhikkhave, santasannivāso hoti, kathañca santo sannivasanti? Idha, bhikkhave, therassa bhikkhuno evaṃ hoti – ‘theropi maṃ vadeyya, majjhimopi maṃ vadeyya, navopi maṃ vadeyya; therampāhaṃ vadeyyaṃ, majjhimampāhaṃ vadeyyaṃ, navampāhaṃ vadeyyaṃ. Thero cepi maṃ vadeyya hitānukampī maṃ vadeyya no ahitānukampī, sādhūti naṃ vadeyyaṃ na viheṭheyyaṃ passampissa paṭikareyyaṃ. Majjhimo cepi maṃ vadeyya…pe… navo cepi maṃ vadeyya hitānukampī maṃ vadeyya no ahitānukampī, sādhūti naṃ vadeyyaṃ na naṃ viheṭheyyaṃ passampissa paṭikareyyaṃ’. Majjhimassapi bhikkhuno evaṃ hoti…pe… navassapi bhikkhuno evaṃ hoti – ‘theropi maṃ vadeyya, majjhimopi maṃ vadeyya, navopi maṃ vadeyya; therampāhaṃ vadeyyaṃ, majjhimampāhaṃ vadeyyaṃ, navampāhaṃ vadeyyaṃ. Thero cepi maṃ vadeyya hitānukampī maṃ vadeyya no ahitānukampī, sādhūti naṃ vadeyyaṃ na naṃ viheṭheyyaṃ passampissa paṭikareyyaṃ. Majjhimo cepi maṃ vadeyya…pe… navo cepi maṃ vadeyya hitānukampī maṃ vadeyya no ahitānukampī, sādhūti naṃ vadeyyaṃ na naṃ viheṭheyyaṃ passampissa paṭikareyyaṃ’. Evaṃ kho, bhikkhave, santasannivāso hoti, evañca santo sannivasantī’’ti.",
      "english": "“Monks, I will teach you about non-harmonious dwelling and harmonious dwelling. Listen to it, attend carefully, I will speak.” “Yes, venerable sir,” those monks replied to the Blessed One. The Blessed One then said this:\n\n“And how, monks, is there non-harmonious dwelling, and how do those who are not virtuous dwell? Here, monks, a senior monk thinks: ‘May no senior monk admonish me, may no middle monk admonish me, may no junior monk admonish me; and I, too, would not admonish a senior monk, nor a middle monk, nor a junior monk. If a senior monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard. If a middle monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard. If a junior monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard.’ A middle monk also thinks thus: ‘May no senior monk admonish me, may no middle monk admonish me, may no junior monk admonish me; and I, too, would not admonish a senior monk, nor a middle monk, nor a junior monk. If a senior monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard. If a middle monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard. If a junior monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard.’ A junior monk also thinks thus: ‘May no senior monk admonish me, may no middle monk admonish me, may no junior monk admonish me; and I, too, would not admonish a senior monk, nor a middle monk, nor a junior monk. If a senior monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard. If a middle monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard. If a junior monk were to admonish me, he would admonish me out of ill-will, not out of compassion; I would not acknowledge him, I would vex him, I would not pay him any regard.’ It is in this way, monks, that there is non-harmonious dwelling, and it is in this way that those who are not virtuous dwell.\n\n“And how, monks, is there harmonious dwelling, and how do those who are virtuous dwell? Here, monks, a senior monk thinks: ‘May a senior monk admonish me, may a middle monk admonish me, may a junior monk admonish me; and I, too, would admonish a senior monk, a middle monk, and a junior monk. If a senior monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard. If a middle monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard. If a junior monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard.’ A middle monk also thinks thus: ‘May a senior monk admonish me, may a middle monk admonish me, may a junior monk admonish me; and I, too, would admonish a senior monk, a middle monk, and a junior monk. If a senior monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard. If a middle monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard. If a junior monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard.’ A junior monk also thinks thus: ‘May a senior monk admonish me, may a middle monk admonish me, may a junior monk admonish me; and I, too, would admonish a senior monk, a middle monk, and a junior monk. If a senior monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard. If a middle monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard. If a junior monk were to admonish me, he would admonish me out of compassion, not out of ill-will; I would say ‘Good!’ to him, I would not vex him, I would pay him due regard.’ It is in this way, monks, that there is harmonious dwelling, and it is in this way that those who are virtuous dwell.”",
      "sinhala": "මහණෙනි, අසත්පුරුෂ ඇසුරද, සත්පුරුෂ ඇසුරද මම ඔබට දේශනා කරන්නෙමි. එයට සවන් දෙන්න. මැනවින් මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි. ‘‘එසේය, ස්වාමීනී’’යි කියා ඒ භික්#ZWJ#ෂූහු භාග්‍#ZWJ#යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍#ZWJ#යවතුන් වහන්සේ මෙය වදාළ සේක –\n\nමහණෙනි, අසත්පුරුෂ ඇසුර කවර ආකාරයෙන් සිදුවේද? අසත්පුරුෂයෝ කවර ආකාරයෙන් ඇසුරු කරත්ද? මහණෙනි, මෙහිලා ථේර භික්#ZWJ#ෂුවකට මෙසේ සිතක් ඇතිවේ: – ‘ථේර භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. මධ්‍යම භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. නවක භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. මමත් ථේර භික්#ZWJ#ෂුවට කථා නොකරමි. මධ්‍යම භික්#ZWJ#ෂුවට කථා නොකරමි. නවක භික්#ZWJ#ෂුවට කථා නොකරමි. යම් හෙයකින් ථේර භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි. යම් හෙයකින් මධ්‍යම භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි. යම් හෙයකින් නවක භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි.’\nමධ්‍යම භික්#ZWJ#ෂුවකටත් මෙසේ සිතක් ඇතිවේ: – ‘ථේර භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. මධ්‍යම භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. නවක භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. මමත් ථේර භික්#ZWJ#ෂුවට කථා නොකරමි. මධ්‍යම භික්#ZWJ#ෂුවට කථා නොකරමි. නවක භික්#ZWJ#ෂුවට කථා නොකරමි. යම් හෙයකින් ථේර භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි. යම් හෙයකින් මධ්‍යම භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි. යම් හෙයකින් නවක භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි.’\nනවක භික්#ZWJ#ෂුවකටත් මෙසේ සිතක් ඇතිවේ: – ‘ථේර භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. මධ්‍යම භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. නවක භික්#ZWJ#ෂුවත් මට කථා නොකළ යුතුය. මමත් ථේර භික්#ZWJ#ෂුවට කථා නොකරමි. මධ්‍යම භික්#ZWJ#ෂුවට කථා නොකරමි. නවක භික්#ZWJ#ෂුවට කථා නොකරමි. යම් හෙයකින් ථේර භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි. යම් හෙයකින් මධ්‍යම භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි. යම් හෙයකින් නවක භික්#ZWJ#ෂුවක් මට කථා කෙරේද, හිතානුකම්පීව නොව අහිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට එරෙහිව කථා කරමි, ඔහුට හිංසා කරමි, ඔහුව දුටුවත් පිළිසඳරක් නොකරමි.’\nමහණෙනි, මෙසේය අසත්පුරුෂ ඇසුර සිදුවන්නේ. මෙසේය අසත්පුරුෂයෝ ඇසුරු කරන්නේ.\n\nමහණෙනි, සත්පුරුෂ ඇසුර කවර ආකාරයෙන් සිදුවේද? සත්පුරුෂයෝ කවර ආකාරයෙන් ඇසුරු කරත්ද? මහණෙනි, මෙහිලා ථේර භික්#ZWJ#ෂුවකට මෙසේ සිතක් ඇතිවේ: – ‘ථේර භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. මධ්‍යම භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. නවක භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. මමත් ථේර භික්#ZWJ#ෂුවට කථා කරමි. මධ්‍යම භික්#ZWJ#ෂුවට කථා කරමි. නවක භික්#ZWJ#ෂුවට කථා කරමි. යම් හෙයකින් ථේර භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි. යම් හෙයකින් මධ්‍යම භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි. යම් හෙයකින් නවක භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි.’\nමධ්‍යම භික්#ZWJ#ෂුවකටත් මෙසේ සිතක් ඇතිවේ: – ‘ථේර භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. මධ්‍යම භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. නවක භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. මමත් ථේර භික්#ZWJ#ෂුවට කථා කරමි. මධ්‍යම භික්#ZWJ#ෂුවට කථා කරමි. නවක භික්#ZWJ#ෂුවට කථා කරමි. යම් හෙයකින් ථේර භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි. යම් හෙයකින් මධ්‍යම භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි. යම් හෙයකින් නවක භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි.’\nනවක භික්#ZWJ#ෂුවකටත් මෙසේ සිතක් ඇතිවේ: – ‘ථේර භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. මධ්‍යම භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. නවක භික්#ZWJ#ෂුවත් මට කථා කළ යුතුය. මමත් ථේර භික්#ZWJ#ෂුවට කථා කරමි. මධ්‍යම භික්#ZWJ#ෂුවට කථා කරමි. නවක භික්#ZWJ#ෂුවට කථා කරමි. යම් හෙයකින් ථේර භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි. යම් හෙයකින් මධ්‍යම භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි. යම් හෙයකින් නවක භික්#ZWJ#ෂුවක් මට කථා කෙරේද, අහිතානුකම්පීව නොව හිතානුකම්පීවය මට කථා කරන්නේ. එහෙයින් ඔහුට “සාදු” යැයි කියා පිළිතුරු දෙමි, ඔහුට හිංසා නොකරමි, ඔහුව දුටුවත් පිළිසඳරක් කරමි.’\nමහණෙනි, මෙසේය සත්පුරුෂ ඇසුර සිදුවන්නේ. මෙසේය සත්පුරුෂයෝ ඇසුරු කරන්නේ.",
      "paliTitle": ""
    },
    {
      "number": 64,
      "pali": "‘‘Yasmiṃ, bhikkhave, adhikaraṇe ubhato vacīsaṃsāro diṭṭhipaḷāso cetaso āghāto appaccayo anabhiraddhi ajjhattaṃ avūpasantaṃ hoti, tasmetaṃ, bhikkhave, adhikaraṇe pāṭikaṅkhaṃ – ‘dīghattāya kharattāya vāḷattāya saṃvattissati, bhikkhū ca na phāsuṃ [phāsu (ka.)] viharissanti’. Yasmiñca kho, bhikkhave, adhikaraṇe ubhato vacīsaṃsāro diṭṭhipaḷāso cetaso āghāto appaccayo anabhiraddhi ajjhattaṃ suvūpasantaṃ hoti, tasmetaṃ, bhikkhave, adhikaraṇe pāṭikaṅkhaṃ – ‘na dīghattāya kharattāya vāḷattāya saṃvattissati, bhikkhū ca phāsuṃ viharissantī’’’ti. ",
      "english": "Monks, concerning any dispute where verbal contention from both sides, the thicket of views, ill-will in the mind, discontent, and displeasure are inwardly unappeased, in such a dispute, Monks, it can be expected that it will lead to prolonged suffering, to severity, to ferocity, and the bhikkhus will not dwell at ease.\n\nBut, Monks, concerning any dispute where verbal contention from both sides, the thicket of views, ill-will in the mind, discontent, and displeasure are inwardly well-appeased, in such a dispute, Monks, it can be expected that it will not lead to prolonged suffering, to severity, to ferocity, and the bhikkhus will dwell at ease.",
      "sinhala": "භික්ෂූනි, යම් අධිකරණයක දෙපාර්ශවයේම වාග් ගැටුම්, දෘෂ්ටීන්ට තදින් බැඳී සිටීම, සිතේ වෛරය, අප්‍ර#සාදය සහ අසමඟිය යන මේවා අභ්‍ය#න්තරව නොසන්සිඳුණු ස්වභාවයෙන් පවතීද, භික්ෂූනි, එවැනි අධිකරණයක් සම්බන්ධයෙන් මේ දේ අපේක්ෂා කළ යුතුය: ‘එය දීර්ඝ කාලයක් පවතින බවටත්, රළු ස්වභාවයක් ගන්නා බවටත්, දරුණු වන බවටත් හේතු වනු ඇත; භික්ෂූහු ද සුවසේ වාසය නොකරනු ඇත.’\n\nභික්ෂූනි, යම් අධිකරණයක දෙපාර්ශවයේම වාග් ගැටුම්, දෘෂ්ටීන්ට තදින් බැඳී සිටීම, සිතේ වෛරය, අප්‍ර#සාදය සහ අසමඟිය යන මේවා අභ්‍ය#න්තරව මනාව සන්සිඳුණු ස්වභාවයෙන් පවතීද, භික්ෂූනි, එවැනි අධිකරණයක් සම්බන්ධයෙන් මේ දේ අපේක්ෂා කළ යුතුය: ‘එය දීර්ඝ කාලයක් පවතින බවටත්, රළු ස්වභාවයක් ගන්නා බවටත්, දරුණු වන බවටත් හේතු නොවනු ඇත; භික්ෂූහු ද සුවසේ වාසය කරනු ඇත.’",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Puggalavaggo paṭhamo.",
    "english": "First Chapter on Individuals",
    "sinhala": "පළමු පුද්ගල වග්ගය"
  }
}