{
  "id": "an2.13",
  "title": {
    "pali": "Dānavaggo",
    "english": "The Chapter on Generosity",
    "sinhala": "දාන වග්ගය"
  },
  "sections": [
    {
      "number": 142,
      "pali": "‘‘Dvemāni, bhikkhave, dānāni. Katamāni dve? Āmisadānañca dhammadānañca. Imāni kho, bhikkhave, dve dānāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ dānānaṃ yadidaṃ dhammadāna’’nti.",
      "english": "Monks, there are these two kinds of gifts. Which two? The gift of material things and the gift of the Dhamma. Indeed, Monks, these are the two kinds of gifts. Among these two gifts, Monks, the gift of the Dhamma is supreme.",
      "sinhala": "මහණෙනි, මේ දාන දෙකකි. කවර දෙකක්ද? ආමිස දානය සහ ධර‍්ම දානය යි. මහණෙනි, මේ දාන දෙක නම් මේවාමයි. මහණෙනි, මේ දාන දෙකින් ධර‍්ම දානය අග්‍රය.",
      "paliTitle": ""
    },
    {
      "number": 143,
      "pali": "‘‘Dveme, bhikkhave, yāgā. Katame dve? Āmisayāgo ca dhammayāgo ca. Ime kho, bhikkhave, dve yāgā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ yāgānaṃ yadidaṃ dhammayāgo’’ti.",
      "english": "Monks, there are these two kinds of offerings. Which two? Material offerings and Dhamma offerings. Monks, these are these two kinds of offerings. Monks, among these two kinds of offerings, the Dhamma offering is the foremost.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ දාන දෙකකි. කවර දෙකක්ද යත්? ආමිස දානය සහ ධර්ම දානය යනුයි. භික්ෂූන් වහන්ස, මේ දාන දෙකකි. භික්ෂූන් වහන්ස, මේ දාන දෙකින් ධර්ම දානය අග්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 144,
      "pali": "‘‘Dveme, bhikkhave, cāgā. Katame dve? Āmisacāgo ca dhammacāgo ca. Ime kho, bhikkhave, dve cāgā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ cāgānaṃ yadidaṃ dhammacāgo’’ti.",
      "english": "Monks, there are these two kinds of giving. Which two? Material giving and the giving of the Dhamma. These, monks, are the two kinds of giving. Among these two kinds of giving, the giving of the Dhamma is the foremost.",
      "sinhala": "භික්ෂූනි, මේ ත්‍යාග දෙකකි.\nඒවා කවර දෙකක්ද?\nආමිස ත්‍යාගය සහ ධර්‍ම ත්‍යාගය යි.\nභික්ෂූනි, මේ ත්‍යාග දෙක මේවා ය.\nභික්ෂූනි, මේ ත්‍යාග දෙක අතුරින් ධර්‍ම ත්‍යාගය ප්‍රධාන යි.",
      "paliTitle": ""
    },
    {
      "number": 145,
      "pali": "‘‘Dveme, bhikkhave, pariccāgā. Katame dve? Āmisapariccāgo ca dhammapariccāgo ca. Ime kho, bhikkhave, dve pariccāgā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ pariccāgānaṃ yadidaṃ dhammapariccāgo’’ti.",
      "english": "Monks, there are these two kinds of relinquishment. Which two? The relinquishment of material things and the relinquishment of Dhamma. Monks, these are indeed the two relinquishments. Among these two relinquishments, monks, the relinquishment of Dhamma is supreme.",
      "sinhala": "මහණෙනි, මේ පරිත්‍යාග දෙකකි. ඒ කවර දෙකක්ද? ආමිස පරිත්‍යාගය සහ ධර්ම පරිත්‍යාගය යන දෙකයි. මහණෙනි, සැබවින්ම මේ පරිත්‍යාග දෙක වන්නේ මේවාය. මහණෙනි, මේ පරිත්‍යාග දෙකෙන් ධර්ම පරිත්‍යාගය අග්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 146,
      "pali": "‘‘Dveme, bhikkhave, bhogā. Katame dve? Āmisabhogo ca dhammabhogo ca. Ime kho, bhikkhave, dve bhogā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ bhogānaṃ yadidaṃ dhammabhogo’’ti.",
      "english": "Monks, there are these two kinds of possessions. Which two? Material possessions and the possession of the Dhamma. Indeed, monks, these are the two kinds of possessions. Among these two kinds of possessions, monks, the possession of the Dhamma is supreme.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ භෝග දෙකකි.\nඒ දෙක කවරේද?\nආමිස භෝගය සහ ධර්ම භෝගය යනුයි.\nභික්ෂූන් වහන්ස, මේ භෝග දෙක නම් මේවාය.\nභික්ෂූන් වහන්ස, මේ භෝග දෙකින් ධර්ම භෝගය අග්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 147,
      "pali": "‘‘Dveme, bhikkhave, sambhogā. Katame dve? Āmisasambhogo ca dhammasambhogo ca. Ime kho, bhikkhave, dve sambhogā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sambhogānaṃ yadidaṃ dhammasambhogo’’ti.",
      "english": "Monks, these are two kinds of enjoyments. Which two? Material enjoyment and Dhamma enjoyment. Indeed, Monks, these are the two kinds of enjoyments. Among these two kinds of enjoyments, Monks, Dhamma enjoyment is the foremost.",
      "sinhala": "මහණෙනි, මේ සම්භෝගයෝ දෙදෙනෙක් වෙති. කවර දෙදෙනෙක්ද? ආමිස සම්භෝගයද, ධර්ම සම්භෝගයද යන දෙදෙනාය.\n\nමහණෙනි, මේ දෙවැදෑරුම් සම්භෝගයන් අතුරින් ධර්ම සම්භෝගය අග්‍ර යැයි භාග්‍යවතුන් වහන්සේ වදාළ සේක.",
      "paliTitle": ""
    },
    {
      "number": 148,
      "pali": "‘‘Dveme, bhikkhave, saṃvibhāgā. Katame dve? Āmisasaṃvibhāgo ca dhammasaṃvibhāgo ca. Ime kho, bhikkhave, dve saṃvibhāgā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ saṃvibhāgānaṃ yadidaṃ dhammasaṃvibhāgo’’ti.",
      "english": "Monks, there are these two ways of sharing. Which two? The sharing of material things and the sharing of the Dhamma. These, monks, are the two ways of sharing. Among these two ways of sharing, monks, the sharing of the Dhamma is the foremost.",
      "sinhala": "භික්​ෂූන් වහන්සේලා, මේ සංවිභාග දෙකක් තිබේ. ඒ දෙක කුමන ඒවාද? එනම්, ආමිස සංවිභාගය සහ ධර්ම සංවිභාගයයි. භික්​ෂූන් වහන්සේලා, ඇත්තෙන්ම මේවා සංවිභාග දෙකකි. භික්​ෂූන් වහන්සේලා, මේ සංවිභාග දෙකෙන් ධර්ම සංවිභාගයම අග්​ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 149,
      "pali": "‘‘Dveme, bhikkhave, saṅgahā. Katame dve? Āmisasaṅgaho ca dhammasaṅgaho ca. Ime kho, bhikkhave, dve saṅgahā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ saṅgahānaṃ yadidaṃ dhammasaṅgaho’’ti.",
      "english": "Monks, there are these two types of inclusion. Which two? Inclusion through material things and inclusion through the Dhamma. Indeed, monks, these are the two types of inclusion. Among these two types of inclusion, monks, inclusion through the Dhamma is the foremost.",
      "sinhala": "භික්ෂූනි, මේ සංග්‍රහයන් දෙකකි. කවර දෙකක්ද? ආමිස සංග්‍රහය සහ ධර්ම සංග්‍රහය යන දෙකයි. භික්ෂූනි, මේ සංග්‍රහයන් දෙක නම් මේවාය. භික්ෂූනි, මේ සංග්‍රහයන් දෙක අතුරින් ධර්ම සංග්‍රහය අග්‍රම වේ.",
      "paliTitle": ""
    },
    {
      "number": 150,
      "pali": "‘‘Dveme, bhikkhave, anuggahā. Katame dve? Āmisānuggaho ca dhammānuggaho ca. Ime kho, bhikkhave, dve anuggahā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ anuggahānaṃ yadidaṃ dhammānuggaho’’ti.",
      "english": "Monks, these are two forms of support. Which two? Material support and Dhamma support. Indeed, monks, these are the two forms of support. Among these two forms of support, monks, Dhamma support is the foremost.",
      "sinhala": "මහණෙනි, මේ අනුග්‍රහයෝ දෙදෙනෙක් වෙති. ඒ දෙදෙනා කවරහුද? ආමිස අනුග්‍රහය සහ ධර්මානුග්‍රහයයි. මහණෙනි, මේ අනුග්‍රහයෝ දෙදෙනා වනාහි මොවුන්මය. මහණෙනි, මේ අනුග්‍රහයන් දෙදෙනා අතුරින් ධර්මානුග්‍රහයම අග්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 151,
      "pali": "‘‘Dvemā, bhikkhave, anukampā. Katamā dve? Āmisānukampā ca dhammānukampā ca. Imā kho, bhikkhave, dve anukampā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ anukampānaṃ yadidaṃ dhammānukampā’’ti. ",
      "english": "Monks, there are these two kinds of concern. Which two? Concern for material welfare and concern for the Dhamma. Monks, these are the two kinds of concern. Of these two kinds of concern, monks, this concern for the Dhamma is the foremost.",
      "sinhala": "මහණෙනි, මේ අනුකම්පා දෙකක් ඇත. ඒ කවරක්ද දෙක? ආමිස අනුකම්පාව සහ ධර්‍මානුකම්පාවයි. මහණෙනි, මේ අනුකම්පා දෙක නම් මේවායි. මහණෙනි, මේ අනුකම්පා දෙකෙන් ධර්‍මානුකම්පාවම අග්‍ර වන්නේය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Dānavaggo tatiyo.",
    "english": "",
    "sinhala": ""
  }
}