{
  "id": "an2.2",
  "title": {
    "pali": "Adhikaraṇavaggo",
    "english": "The Chapter on Disputes",
    "sinhala": "අධිකරණ වග්ගය"
  },
  "sections": [
    {
      "number": 11,
      "pali": "‘‘Dvemāni, bhikkhave, balāni. Katamāni dve? Paṭisaṅkhānabalañca bhāvanābalañca. Katamañca, bhikkhave, paṭisaṅkhānabalaṃ? Idha, bhikkhave, ekacco iti paṭisañcikkhati – ‘kāyaduccaritassa kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañca, vacīduccaritassa pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañca, manoduccaritassa pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti, manoduccaritaṃ pahāya manosucaritaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, paṭisaṅkhānabalaṃ. ‘‘Katamañca, bhikkhave, bhāvanābalaṃ. Tatra, bhikkhave, yamidaṃ [yadidaṃ (sī.)] bhāvanābalaṃ sekhānametaṃ [sekhametaṃ (sī. syā. kaṃ.)] balaṃ. Sekhañhi so, bhikkhave, balaṃ āgamma rāgaṃ pajahati, dosaṃ pajahati, mohaṃ pajahati. Rāgaṃ pahāya, dosaṃ pahāya, mohaṃ pahāya yaṃ akusalaṃ na taṃ karoti, yaṃ pāpaṃ na taṃ sevati. Idaṃ vuccati, bhikkhave, bhāvanābalaṃ. Imāni kho, bhikkhave, dve balānī’’ti.",
      "english": "Monks, there are these two powers. Which two? The power of wise reflection and the power of development.\n\nAnd what, monks, is the power of wise reflection? Here, monks, a certain person reflects thus: ‘Unwholesome bodily action indeed has a detrimental karmic result in this present life and in the life to come; unwholesome verbal action has a detrimental karmic result in this present life and in the life to come; unwholesome mental action has a detrimental karmic result in this present life and in the life to come.’ Having reflected thus, he abandons unwholesome bodily action and cultivates wholesome bodily action; he abandons unwholesome verbal action and cultivates wholesome verbal action; he abandons unwholesome mental action and cultivates wholesome mental action. He maintains himself in purity. This, monks, is called the power of wise reflection.\n\nAnd what, monks, is the power of development? Regarding this, monks, the power of development is a power belonging to those in training. Indeed, monks, relying on that power, a trainee abandons greed, abandons aversion, abandons ignorance. Having abandoned greed, having abandoned aversion, having abandoned ignorance, he does not perform any unwholesome action, he does not engage in any evil. This, monks, is called the power of development. These, monks, are the two powers.",
      "sinhala": "භික්ෂූනි, මේ බලධර්ම දෙකකි. ඒ දෙක කුමක්ද? ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>තිසංඛ\\u0DCA‍යාන බලය සහ භාවනා බලයයි. භික්ෂූනි, ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>තිසංඛ\\u0DCA‍යාන බලය යනු කුමක්ද? භික්ෂූනි, මෙහිලා ඇතැමෙක් මෙසේ නුවණින් විමසයි – ‘කයට අයත් දුසිරිතට මේ ආත්මයෙහිද, පරලොවෙහිද පාපී විපාක ඇත්තේය. වචනයට අයත් දුසිරිතට මේ ආත්මයෙහිද, පරලොවෙහිද පාපී විපාක ඇත්තේය. මනසට අයත් දුසිරිතට මේ ආත්මයෙහිද, පරලොවෙහිද පාපී විපාක ඇත්තේය’ යනුවෙනි. ඔහු මෙසේ නුවණින් විමසා, කයට අයත් දුසිරිත අත්හැර, කයට අයත් සුසිරිත වඩයි. වචනයට අයත් දුසිරිත අත්හැර, වචනයට අයත් සුසිරිත වඩයි. මනසට අයත් දුසිරිත අත්හැර, මනසට අයත් සුසිරිත වඩයි. තමා පිරිසිදුව පවත්වා ගනියි. භික්ෂූනි, මෙය ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>තිසංඛ\\u0DCA‍යාන බලය යැයි කියනු ලැබේ.\n\nභික්ෂූනි, භාවනා බලය යනු කුමක්ද? භික්ෂූනි, යම් මේ භාවනා බලයක් වේද, මෙය ශෛක\\u0DCA‍ෂ පුද්ගලයන්ගේ බලයකි. භික්ෂූනි, ඒ ශෛක\\u0DCA‍ෂ පුද්ගලයා මේ බලය ඇසුරු කොට රාගය ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>හාණය කරයි, ද්වේෂය ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>හාණය කරයි, මෝහය ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>හාණය කරයි. රාගය ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>හාණය කොට, ද්වේෂය ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>හාණය කොට, මෝහය ප<binary data, 1 bytes><binary data, 1 bytes><binary data, 1 bytes>හාණය කොට, යම් අකුසලයක් වේද එය නොකරයි, යම් පාපයක් වේද එය නොසේවනය කරයි. භික්ෂූනි, මෙය භාවනා බලය යැයි කියනු ලැබේ. භික්ෂූනි, මේ බලධර්ම දෙක මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 12,
      "pali": "‘‘Dvemāni, bhikkhave, balāni. Katamāni dve? Paṭisaṅkhānabalañca bhāvanābalañca. Katamañca, bhikkhave, paṭisaṅkhānabalaṃ? Idha, bhikkhave, ekacco iti paṭisañcikkhati – ‘kāyaduccaritassa kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañca, vacīduccaritassa pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañca, manoduccaritassa pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti, manoduccaritaṃ pahāya manosucaritaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, paṭisaṅkhānabalaṃ. ‘‘Katamañca, bhikkhave, bhāvanābalaṃ? Idha, bhikkhave, bhikkhu satisambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vosaggapariṇāmiṃ, dhammavicayasambojjhaṅgaṃ bhāveti… vīriyasambojjhaṅgaṃ bhāveti… pītisambojjhaṅgaṃ bhāveti… passaddhisambojjhaṅgaṃ bhāveti… samādhisambojjhaṅgaṃ bhāveti… upekkhāsambojjhaṅgaṃ bhāveti vivekanissitaṃ virāganissitaṃ nirodhanissitaṃ vosaggapariṇāmiṃ. Idaṃ vuccati, bhikkhave, bhāvanābalaṃ. Imāni kho, bhikkhave, dve balānī’’ti.",
      "english": "There are two powers, bhikkhus. Which two? The power of careful consideration and the power of development.\n\nAnd what, bhikkhus, is the power of careful consideration? Here, bhikkhus, some individual carefully reflects thus: ‘Indeed, unwholesome bodily action has a detrimental outcome both in this present life and in future lives; unwholesome verbal action has a detrimental outcome both in this present life and in future lives; unwholesome mental action has a detrimental outcome both in this present life and in future lives.’ Having thus carefully considered, they abandon unwholesome bodily action and develop wholesome bodily action; they abandon unwholesome verbal action and develop wholesome verbal action; they abandon unwholesome mental action and develop wholesome mental action; they maintain themselves in purity. This, bhikkhus, is called the power of careful consideration.\n\nAnd what, bhikkhus, is the power of development? Here, bhikkhus, a bhikkhu develops the enlightenment factor of mindfulness, dependent on seclusion, dependent on dispassion, dependent on cessation, culminating in release; they develop the enlightenment factor of investigation of phenomena… they develop the enlightenment factor of energy… they develop the enlightenment factor of rapture… they develop the enlightenment factor of tranquility… they develop the enlightenment factor of concentration… they develop the enlightenment factor of equanimity, dependent on seclusion, dependent on dispassion, dependent on cessation, culminating in release. This, bhikkhus, is called the power of development. These, bhikkhus, are the two powers.",
      "sinhala": "මහණෙනි, මේ බලධර්ම දෙකකි. ඒ දෙක කවරේද? ප්‍රතිසංඛ්‍යාන බලය ද, භාවනා බලය ද යන දෙකයි. මහණෙනි, ප්‍රතිසංඛ්‍යාන බලය යනු කවරේද? මහණෙනි, මෙහි ඇතැම් පුද්ගලයෙක් මෙසේ නුවණින් විමසයි: 'කායික දුසිරිතට මේ ආත්මයෙහි ද, පරලොවෙහි ද පවිටු විපාක ඇත. වාචසික දුසිරිතට මේ ආත්මයෙහි ද, පරලොවෙහි ද පවිටු විපාක ඇත. මානසික දුසිරිතට මේ ආත්මයෙහි ද, පරලොවෙහි ද පවිටු විපාක ඇත'යි. හෙතෙම මෙසේ නුවණින් විමසා, කායික දුසිරිත් හැර, කායික සුසිරිත් වඩයි; වාචසික දුසිරිත් හැර, වාචසික සුසිරිත් වඩයි; මානසික දුසිරිත් හැර, මානසික සුසිරිත් වඩයි; තමා පිරිසිදුව පවත්වා ගනියි. මහණෙනි, මේ ප්‍රතිසංඛ්‍යාන බලය යැයි කියනු ලැබේ.\n\nමහණෙනි, භාවනා බලය යනු කවරේද? මහණෙනි, මෙහි භික්ෂුව විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගයෙහි කෙළවර වූ සති සම්බොජ්ඣංගය වඩයි. ධම්මවිචය සම්බොජ්ඣංගය වඩයි. වීර්ය සම්බොජ්ඣංගය වඩයි. පීති සම්බොජ්ඣංගය වඩයි. පස්සද්ධි සම්බොජ්ඣංගය වඩයි. සමාධි සම්බොජ්ඣංගය වඩයි. උපේක්ඛා සම්බොජ්ඣංගය ද විවේකය ඇසුරු කළ, විරාගය ඇසුරු කළ, නිරෝධය ඇසුරු කළ, වොස්සග්ගයෙහි කෙළවර වූ සේ වඩයි. මහණෙනි, මේ භාවනා බලය යැයි කියනු ලැබේ. මහණෙනි, මේ බලධර්ම දෙකයි.",
      "paliTitle": ""
    },
    {
      "number": 13,
      "pali": "‘‘Dvemāni, bhikkhave, balāni. Katamāni dve? Paṭisaṅkhānabalañca bhāvanābalañca. Katamañca, bhikkhave, paṭisaṅkhānabalaṃ? Idha, bhikkhave, ekacco iti paṭisañcikkhati – ‘kāyaduccaritassa kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañca, vacīduccaritassa kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañca, manoduccaritassa kho pāpako vipāko diṭṭhe ceva dhamme abhisamparāyañcā’ti. So iti paṭisaṅkhāya kāyaduccaritaṃ pahāya kāyasucaritaṃ bhāveti, vacīduccaritaṃ pahāya vacīsucaritaṃ bhāveti, manoduccaritaṃ pahāya manosucaritaṃ bhāveti, suddhaṃ attānaṃ pariharati. Idaṃ vuccati, bhikkhave, paṭisaṅkhānabalaṃ. ‘‘Katamañca, bhikkhave, bhāvanābalaṃ? Idha, bhikkhave, bhikkhu vivicceva kāmehi, vivicca akusalehi dhammehi savitakkaṃ savicāraṃ vivekajaṃ pītisukhaṃ paṭhamaṃ jhānaṃ upasampajja viharati. Vitakkavicārānaṃ vūpasamā ajjhattaṃ sampasādanaṃ cetaso ekodibhāvaṃ avitakkaṃ avicāraṃ samādhijaṃ pītisukhaṃ dutiyaṃ jhānaṃ upasampajja viharati. Pītiyā ca virāgā upekkhako ca viharati sato ca sampajāno, sukhañca kāyena paṭisaṃvedeti, yaṃ taṃ ariyā ācikkhanti – ‘upekkhako satimā sukhavihārī’ti tatiyaṃ jhānaṃ upasampajja viharati. Sukhassa ca pahānā dukkhassa ca pahānā pubbeva somanassadomanassānaṃ atthaṅgamā adukkhamasukhaṃ upekkhāsatipārisuddhiṃ catutthaṃ jhānaṃ upasampajja viharati. Idaṃ vuccati, bhikkhave, bhāvanābalaṃ. Imāni kho, bhikkhave, dve balānī’’ti.",
      "english": "“Monks, there are these two strengths. What are these two? The strength of wise reflection and the strength of mental development.\n\n“And what, monks, is the strength of wise reflection? Here, monks, someone reflects thus: ‘Misconduct by body truly has a wretched result both in this very life and in the life to come; misconduct by speech truly has a wretched result both in this very life and in the life to come; misconduct by mind truly has a wretched result both in this very life and in the life to come.’ Having reflected thus, he abandons misconduct by body and develops good conduct by body; he abandons misconduct by speech and develops good conduct by speech; he abandons misconduct by mind and develops good conduct by mind. He maintains a pure self. This, monks, is called the strength of wise reflection.\n\n“And what, monks, is the strength of mental development? Here, monks, a monk, quite secluded from sensual pleasures, secluded from unwholesome states, enters and dwells in the first jhāna, which is accompanied by initial thought and sustained thought, born of seclusion, with rapture and happiness. With the subsiding of initial thought and sustained thought, with internal assurance and unification of mind, he enters and dwells in the second jhāna, which is without initial thought and sustained thought, born of concentration, with rapture and happiness. With the fading of rapture, he dwells equanimous and mindful and clearly comprehending, and experiences happiness with the body. That is what the noble ones declare: ‘Equanimous, mindful, dwelling in happiness.’ He enters and dwells in the third jhāna. With the abandoning of pleasure and the abandoning of pain—and with the previous disappearance of joy and sorrow—he enters and dwells in the fourth jhāna, which is neither painful nor pleasant, with purity of mindfulness due to equanimity. This, monks, is called the strength of mental development. These, monks, are the two strengths.”",
      "sinhala": "භික්ෂූණි, මේ බලධර්ම දෙකකි. ඒ දෙක කුමක්ද? එනම්, ප්‍රත්‍යවේක්ෂා බලය සහ භාවනා බලයයි. භික්ෂූණි, ප්‍රත්‍යවේක්ෂා බලය යනු කවරේද? භික්ෂූණි, මෙහිලා ඇතැම් අයෙක් මෙසේ මනාකොට විමසා බලයි – ‘කාය දුෂ්චරිතයේ නපුරු විපාකයක්ම මේ ආත්මයේදීත්, මතු පරලොවදීත් පවතී. වාග් දුෂ්චරිතයේ නපුරු විපාකයක්ම මේ ආත්මයේදීත්, මතු පරලොවදීත් පවතී. මනෝ දුෂ්චරිතයේ නපුරු විපාකයක්ම මේ ආත්මයේදීත්, මතු පරලොවදීත් පවතී’යි. ඔහු මෙසේ ප්‍රත්‍යවේක්ෂා කොට, කාය දුෂ්චරිතය අත්හැර, කාය සුචරිතය වඩයි. වාග් දුෂ්චරිතය අත්හැර, වාග් සුචරිතය වඩයි. මනෝ දුෂ්චරිතය අත්හැර, මනෝ සුචරිතය වඩයි. තමා පිරිසිදුව පවත්වා ගනී. භික්ෂූණි, මෙය ප්‍රත්‍යවේක්ෂා බලය යැයි කියනු ලැබේ.\n\nභික්ෂූණි, භාවනා බලය යනු කවරේද? භික්ෂූණි, මෙහිලා භික්ෂුවක් කාමයන්ගෙන් වෙන්ව, අකුසල ධර්මයන්ගෙන් වෙන්ව, විතර්ක සහිතව, විචාර සහිතව, විවේකයෙන් හටගත් ප්‍රීතිය සහ සුවය ඇති පළමු ධ්‍යානයට එළඹ වාසය කරයි. විතර්ක හා විචාරයන්ගේ සංසිඳීමෙන්, ඇතුළත පැහැදීමෙන්, සිතේ එකඟ බවෙන්, විතර්ක රහිතව, විචාර රහිතව, සමාධියෙන් හටගත් ප්‍රීතිය සහ සුවය ඇති දෙවන ධ්‍යානයට එළඹ වාසය කරයි. ප්‍රීතියේ නොඇලීමෙන්, උපේක්ෂාවෙන් යුක්තව, සිහි නුවණින් යුක්තව වාසය කරයි. ශරීරයෙන් සුවය විඳියි. යමක් ආර්යයෝ ‘උපේක්ෂාවෙන් යුක්ත වූ, සිහි නුවණින් යුක්ත වූ, සුවයෙන් වාසය කරන්නා’ යැයි පවසත්ද, එවන් තත්ත්වයට පත්ව, තෙවන ධ්‍යානයට එළඹ වාසය කරයි. සුවය ද අත්හැරීමෙන්, දුක ද අත්හැරීමෙන්, පෙර සිටි සෝමනස්ස-දෝමනස්සයන්ගේ අතුරුදහන් වීමෙන්, දුක් රහිත, සුව රහිත වූ, උපේක්ෂාවෙන් හා සිහියෙන් පිරිසිදු වූ සිව්වන ධ්‍යානයට එළඹ වාසය කරයි. භික්ෂූණි, මෙය භාවනා බලය යැයි කියනු ලැබේ. භික්ෂූණි, මේ බලධර්ම දෙක නම් මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 14,
      "pali": "‘‘Dvemā, bhikkhave, tathāgatassa dhammadesanā. Katamā dve? Saṃkhittena ca vitthārena ca. Imā kho, bhikkhave, dve tathāgatassa dhammadesanā’’ti.",
      "english": "Monks, these are the two forms of Dhamma teaching by the Tathāgata. Which two? Through concise presentation and through elaborate presentation. Indeed, Monks, these are the two forms of Dhamma teaching by the Tathāgata.",
      "sinhala": "මහණෙනි, තථාගතයන් වහන්සේගේ ධර්‍ම දේශනා මේ දෙකකි. කවර දෙකක්ද? සංක්ෂිප්තයෙන්ද, විස්තර වශයෙන්ද. මහණෙනි, තථාගතයන් වහන්සේගේ ධර්‍ම දේශනා මේ දෙකමය.",
      "paliTitle": ""
    },
    {
      "number": 15,
      "pali": "‘‘Yasmiṃ, bhikkhave, adhikaraṇe āpanno [āpattāpanno (ka.)] ca bhikkhu codako ca bhikkhu na sādhukaṃ attanāva attānaṃ paccavekkhati tasmetaṃ, bhikkhave, adhikaraṇe pāṭikaṅkhaṃ dīghattāya kharattāya vāḷattāya saṃvattissati, bhikkhū ca na phāsuṃ [na phāsu (ka.)] viharissantīti [viharissanti (sī. syā. kaṃ. ka.)]. Yasmiñca kho, bhikkhave, adhikaraṇe āpanno ca bhikkhu codako ca bhikkhu sādhukaṃ attanāva attānaṃ paccavekkhati tasmetaṃ, bhikkhave, adhikaraṇe pāṭikaṅkhaṃ na dīghattāya kharattāya vāḷattāya saṃvattissati, bhikkhū ca phāsuṃ viharissantīti. ‘‘Kathañca, bhikkhave, āpanno bhikkhu sādhukaṃ attanāva attānaṃ paccavekkhati? Idha, bhikkhave, āpanno bhikkhu iti paṭisañcikkhati – ‘ahaṃ kho akusalaṃ āpanno kañcideva [kiñcideva (ka.)] desaṃ kāyena. Maṃ so [tasmā maṃ so (sī. syā.)] bhikkhu addasa akusalaṃ āpajjamānaṃ kiñcideva desaṃ kāyena. No ce ahaṃ akusalaṃ āpajjeyyaṃ kiñcideva desaṃ kāyena, na maṃ so bhikkhu passeyya akusalaṃ āpajjamānaṃ kiñcideva desaṃ kāyena. Yasmā ca kho, ahaṃ akusalaṃ āpanno kiñcideva desaṃ kāyena, tasmā maṃ so bhikkhu addasa akusalaṃ āpajjamānaṃ kiñcideva desaṃ kāyena. Disvā ca pana maṃ so bhikkhu akusalaṃ āpajjamānaṃ kiñcideva desaṃ kāyena anattamano ahosi. Anattamano samāno anattamanavacanaṃ [anattamanavācaṃ (ka.)] maṃ so bhikkhu avaca. Anattamanavacanāhaṃ [anattamanavācaṃ nāhaṃ (ka.)] tena bhikkhunā vutto samāno anattamano [attamano (ka.)] ahosiṃ. Anattamano samāno paresaṃ ārocesiṃ. Iti mameva tattha accayo accagamā suṅkadāyakaṃva bhaṇḍasminti. Evaṃ kho, bhikkhave, āpanno bhikkhu sādhukaṃ attanāva attānaṃ paccavekkhati. ‘‘Kathañca, bhikkhave, codako bhikkhu sādhukaṃ attanāva attānaṃ paccavekkhati? Idha, bhikkhave, codako bhikkhu iti paṭisañcikkhati – ‘ayaṃ kho bhikkhu akusalaṃ āpanno kiñcideva desaṃ kāyena. Ahaṃ imaṃ bhikkhuṃ addasaṃ akusalaṃ āpajjamānaṃ kiñcideva desaṃ kāyena. No ce ayaṃ bhikkhu akusalaṃ āpajjeyya kiñcideva desaṃ kāyena, nāhaṃ imaṃ bhikkhuṃ passeyyaṃ akusalaṃ āpajjamānaṃ kiñcideva desaṃ kāyena. Yasmā ca kho, ayaṃ bhikkhu akusalaṃ āpanno kiñcideva desaṃ kāyena, tasmā ahaṃ imaṃ bhikkhuṃ addasaṃ akusalaṃ āpajjamānaṃ kiñcideva desaṃ kāyena. Disvā ca panāhaṃ imaṃ bhikkhuṃ akusalaṃ āpajjamānaṃ kiñcideva desaṃ kāyena anattamano ahosiṃ. Anattamano samāno anattamanavacanāhaṃ imaṃ bhikkhuṃ avacaṃ. Anattamanavacanāyaṃ bhikkhu mayā vutto samāno anattamano ahosi. Anattamano samāno paresaṃ ārocesi. Iti mameva tattha accayo accagamā suṅkadāyakaṃva bhaṇḍasminti. Evaṃ kho, bhikkhave, codako bhikkhu sādhukaṃ attanāva attānaṃ paccavekkhati. ‘‘Yasmiṃ, bhikkhave, adhikaraṇe āpanno ca bhikkhu codako ca bhikkhu na sādhukaṃ attanāva attānaṃ paccavekkhati tasmetaṃ, bhikkhave, adhikaraṇe pāṭikaṅkhaṃ dīghattāya kharattāya vāḷattāya saṃvattissati, bhikkhū ca na phāsuṃ viharissantīti. Yasmiñca kho, bhikkhave, adhikaraṇe āpanno ca bhikkhu codako ca bhikkhu sādhukaṃ attanāva attānaṃ paccavekkhati tasmetaṃ, bhikkhave, adhikaraṇe pāṭikaṅkhaṃ na dīghattāya kharattāya vāḷattāya saṃvattissati, bhikkhū ca phāsu viharissantī’’ti.",
      "english": "Monks, in any dispute where both the bhikkhu who has fallen into an offense and the bhikkhu who is the accuser do not properly reflect upon themselves, it can be expected, monks, that such a dispute will lead to prolonging, harshness, and severity, and the bhikkhus will not dwell in comfort. But monks, in any dispute where both the bhikkhu who has fallen into an offense and the bhikkhu who is the accuser properly reflect upon themselves, it can be expected, monks, that such a dispute will not lead to prolonging, harshness, or severity, and the bhikkhus will dwell in comfort.\n\nAnd how, monks, does a bhikkhu who has fallen into an offense properly reflect upon himself? Here, monks, a bhikkhu who has fallen into an offense reflects thus: ‘I have indeed fallen into some unwholesome bodily action. That bhikkhu saw me committing some unwholesome bodily action. If I had not committed any unwholesome bodily action, that bhikkhu would not have seen me committing any unwholesome bodily action. Because I did indeed commit some unwholesome bodily action, that bhikkhu saw me committing some unwholesome bodily action. And having seen me committing some unwholesome bodily action, that bhikkhu was displeased. Being displeased, that bhikkhu spoke displeasing words to me. Having been spoken to by that bhikkhu with displeasing words, I became displeased. Being displeased, I then told others. Thus, the fault there was indeed mine, just as the customs duty applies to one’s goods.’ This, monks, is how a bhikkhu who has fallen into an offense properly reflects upon himself.\n\nAnd how, monks, does an accuser bhikkhu properly reflect upon himself? Here, monks, an accuser bhikkhu reflects thus: ‘This bhikkhu has indeed fallen into some unwholesome bodily action. I saw this bhikkhu committing some unwholesome bodily action. If this bhikkhu had not committed any unwholesome bodily action, I would not have seen this bhikkhu committing any unwholesome bodily action. Because this bhikkhu did indeed commit some unwholesome bodily action, I saw this bhikkhu committing some unwholesome bodily action. And having seen this bhikkhu committing some unwholesome bodily action, I was displeased. Being displeased, I spoke displeasing words to this bhikkhu. Having been spoken to by me with displeasing words, this bhikkhu became displeased. Being displeased, he then told others. Thus, the fault there was indeed mine, just as the customs duty applies to one’s goods.’ This, monks, is how an accuser bhikkhu properly reflects upon himself.\n\nMonks, in any dispute where both the bhikkhu who has fallen into an offense and the bhikkhu who is the accuser do not properly reflect upon themselves, it can be expected, monks, that such a dispute will lead to prolonging, harshness, and severity, and the bhikkhus will not dwell in comfort. But monks, in any dispute where both the bhikkhu who has fallen into an offense and the bhikkhu who is the accuser properly reflect upon themselves, it can be expected, monks, that such a dispute will not lead to prolonging, harshness, or severity, and the bhikkhus will dwell in comfort.",
      "sinhala": "භික්ෂූණි, යම් අධිකරණයක දී (කලහයක දී, ආරවුලක දී), වරදට පත් වූ භික්ෂුව ද, චෝදනා කරන භික්ෂුව ද, තමන් විසින් ම තමාව මැනවින් පිරික්සා නොබලන්නේ ද, භික්ෂූණි, ඒ අධිකරණය දිගු කාලයක් පවතින්නට, රළු වීමට, භයානක වීමට ඉඩ තිබේ. භික්ෂූන් වහන්සේලා ද සුවසේ වාසය නොකරනු ඇත. භික්ෂූණි, යම් අධිකරණයක දී, වරදට පත් වූ භික්ෂුව ද, චෝදනා කරන භික්ෂුව ද, තමන් විසින් ම තමාව මැනවින් පිරික්සා බලන්නේ ද, භික්ෂූණි, ඒ අධිකරණය දිගු කාලයක් පවතින්නට, රළු වීමට, භයානක වීමට ඉඩ නැත. භික්ෂූන් වහන්සේලා ද සුවසේ වාසය කරනු ඇත.\n\nභික්ෂූණි, වරදට පත් වූ භික්ෂුව කෙසේ නම් තමන් විසින් ම තමාව මැනවින් පිරික්සා බලන්නේ ද? භික්ෂූණි, මෙහි දී වරදට පත් වූ භික්ෂුව මෙසේ සිතයි: ‘මා විසින් යම් කිසි අකුසල ක්‍රියාවක් කයින් කරන ලදී. ඒ භික්ෂුව මා යම් කිසි අකුසල ක්‍රියාවක් කයින් කරනු දැක්කේය. මම යම් කිසි අකුසල ක්‍රියාවක් කයින් නොකළේ නම්, ඒ භික්ෂුව මා යම් කිසි අකුසල ක්‍රියාවක් කයින් කරනු නොදකිනු ඇත. යම් හෙයකින් මා විසින් යම් කිසි අකුසල ක්‍රියාවක් කයින් කරන ලද බැවින්, ඒ භික්ෂුව මා යම් කිසි අකුසල ක්‍රියාවක් කයින් කරනු දැක්කේය. මා යම් කිසි අකුසල ක්‍රියාවක් කයින් කරනු දැක, ඒ භික්ෂුව අසතුටු විය. අසතුටු වී සිටි ඔහු මට අසතුටු කතා පැවසීය. ඒ භික්ෂුව විසින් අසතුටු කතා පැවසීමෙන්, මම ද අසතුටු වීමි. අසතුටු වී සිටි මම අනුන්ට ද දන්වා සිටියෙමි. ඒ කාරණයෙහි දී තීරු බදු ගෙවන්නාට තමාගේ භාණ්ඩය නිසා පාඩුවක් සිදු වූවාක් මෙන්, මා විසින්ම යම් කිසි වරදක් කරගෙන ඇත.’ භික්ෂූණි, වරදට පත් වූ භික්ෂුව තමන් විසින් ම තමාව මැනවින් පිරික්සා බලන්නේ මෙලෙස යි.\n\nභික්ෂූණි, චෝදනා කරන භික්ෂුව කෙසේ නම් තමන් විසින් ම තමාව මැනවින් පිරික්සා බලන්නේ ද? භික්ෂූණි, මෙහි දී චෝදනා කරන භික්ෂුව මෙසේ සිතයි: ‘මේ භික්ෂුව යම් කිසි අකුසල ක්‍රියාවක් කයින් කරන ලදී. මම මේ භික්ෂුව යම් කිසි අකුසල ක්‍රියාවක් කයින් කරනු දැක්කෙමි. මේ භික්ෂුව යම් කිසි අකුසල ක්‍රියාවක් කයින් නොකළේ නම්, මම මේ භික්ෂුව යම් කිසි අකුසල ක්‍රියාවක් කයින් කරනු නොදකිනු ඇත. යම් හෙයකින් මේ භික්ෂුව විසින් යම් කිසි අකුසල ක්‍රියාවක් කයින් කරන ලද බැවින්, මම මේ භික්ෂුව යම් කිසි අකුසල ක්‍රියාවක් කයින් කරනු දැක්කෙමි. මේ භික්ෂුව යම් කිසි අකුසල ක්‍රියාවක් කයින් කරනු දැක, මම අසතුටු වීමි. අසතුටු වී සිටි මම මේ භික්ෂුවට අසතුටු කතා පැවසීමි. මා විසින් අසතුටු කතා පැවසීමෙන්, මේ භික්ෂුව ද අසතුටු විය. අසතුටු වී සිටි ඔහු අනුන්ට ද දන්වා සිටියේ ය. ඒ කාරණයෙහි දී තීරු බදු ගෙවන්නාට තමාගේ භාණ්ඩය නිසා පාඩුවක් සිදු වූවාක් මෙන්, මා විසින්ම යම් කිසි වරදක් කරගෙන ඇත.’ භික්ෂූණි, චෝදනා කරන භික්ෂුව තමන් විසින් ම තමාව මැනවින් පිරික්සා බලන්නේ මෙලෙස යි.\n\nභික්ෂූණි, යම් අධිකරණයක දී, වරදට පත් වූ භික්ෂුව ද, චෝදනා කරන භික්ෂුව ද, තමන් විසින් ම තමාව මැනවින් පිරික්සා නොබලන්නේ ද, භික්ෂූණි, ඒ අධිකරණය දිගු කාලයක් පවතින්නට, රළු වීමට, භයානක වීමට ඉඩ තිබේ. භික්ෂූන් වහන්සේලා ද සුවසේ වාසය නොකරනු ඇත. භික්ෂූණි, යම් අධිකරණයක දී, වරදට පත් වූ භික්ෂුව ද, චෝදනා කරන භික්ෂුව ද, තමන් විසින් ම තමාව මැනවින් පිරික්සා බලන්නේ ද, භික්ෂූණි, ඒ අධිකරණය දිගු කාලයක් පවතින්නට, රළු වීමට, භයානක වීමට ඉඩ නැත. භික්ෂූන් වහන්සේලා ද සුවසේ වාසය කරනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 16,
      "pali": "Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu ko paccayo yena midhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti? ‘‘Adhammacariyāvisamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti. ‘‘Ko nu kho, bho gotama, hetu ko paccayo yena midhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti? ‘‘Dhammacariyāsamacariyāhetu kho, brāhmaṇa, evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti. ‘‘Abhikkantaṃ, bho gotama! Abhikkantaṃ, bho gotama! Seyyathāpi, bho gotama, nikkujjitaṃ [nikujjitaṃ (ka.)] vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti, evamevaṃ bhotā gotamena anekapariyāyena dhammo pakāsito. Esāhaṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Then, a certain brahmin approached the Blessed One. Having approached, he exchanged greetings with the Blessed One. Having concluded the courteous and memorable talk, he sat down to one side.\n\nAs he sat to one side, that brahmin said to the Blessed One: \"What, good Gotama, is the cause, what is the reason, by which some beings, after the dissolution of the body, after death, reappear in a state of deprivation, in an unfortunate destination, in a woeful state, in hell?\"\n\n\"It is due to unrighteous conduct and improper conduct, brahmin, that some beings, after the dissolution of the body, after death, reappear in a state of deprivation, in an unfortunate destination, in a woeful state, in hell.\"\n\n\"What, good Gotama, is the cause, what is the reason, by which some beings, after the dissolution of the body, after death, reappear in a fortunate destination, in a heavenly world?\" \"It is due to righteous conduct and proper conduct, brahmin, that some beings, after the dissolution of the body, after death, reappear in a fortunate destination, in a heavenly world.\"\n\n\"Excellent, good Gotama! Excellent, good Gotama! Just as, good Gotama, one might set upright what was overturned, or reveal what was hidden, or point out the way to one who was lost, or hold up a lamp in the darkness so that those with sight might see forms, even so has the Dhamma been made clear in many ways by the good Gotama. I now go for refuge to the good Gotama, and to the Dhamma, and to the Sangha of bhikkhus. May the good Gotama remember me as a lay follower who has gone for refuge from this day forward for as long as life lasts.\"",
      "sinhala": "එවිට එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු සාමිචි කතා කළේය. හිත පිනවන, සිහියට නැගෙන කතා බහ නිමවා ඔහු එකත්පස්ව වාඩි විය.\n\nඑකත්පස්ව වාඩි වී සිටි ඒ බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය කීවේය: “ගෞතමයන් වහන්ස, හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද? යම් හෙයකින් මෙලොව ඇතැම් සත්ත්වයෝ ශරීරය බිඳී මරණයෙන් පසු අපාය නම් වූ දුර්ගතියට, විනාශයට, නිරයට උපදින්නෝද?”\n\n“බ්‍රාහ්මණය, අධර්මචාරී වීමත්, විෂමචාරී වීමත් හේතු කොටගෙන මෙලොව ඇතැම් සත්ත්වයෝ ශරීරය බිඳී මරණයෙන් පසු අපාය නම් වූ දුර්ගතියට, විනාශයට, නිරයට උපදින්නෝය.”\n\n“ගෞතමයන් වහන්ස, හේතුව කුමක්ද? ප්‍රත්‍යය කුමක්ද? යම් හෙයකින් මෙලොව ඇතැම් සත්ත්වයෝ ශරීරය බිඳී මරණයෙන් පසු සුගතියට, ස්වර්ග ලෝකයට උපදින්නෝද?”\n\n“බ්‍රාහ්මණය, ධර්මචාරී වීමත්, සමචාරී වීමත් හේතු කොටගෙන මෙලොව ඇතැම් සත්ත්වයෝ ශරීරය බිඳී මරණයෙන් පසු සුගතියට, ස්වර්ග ලෝකයට උපදින්නෝය.”\n\n“ගෞතමයන් වහන්ස, ඉතා මනහරයි! ඉතා මනහරයි! ගෞතමයන් වහන්ස, යමෙක් පෙරළා ඇති භාජනයක් යථා තත්ත්වයට හරවන්නා සේ, වසා ඇති දෙයක් විවෘත කරන්නා සේ, මඟ නොදන්නා කෙනෙකුට මඟ පෙන්වන්නා සේ, අන්ධකාරයේ තෙල් පහනක් දල්වා ‘ඇස් ඇත්තෝ රූප දකිත්වා!’ යි තබන්නා සේ, එලෙසම ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී.\n\nමම ඒ ගෞතමයන් වහන්සේද, ධර්මයද, භික්‍ෂුසංඝයාද සරණ යමි. ගෞතමයන් වහන්සේ අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා සලකන සේක්වා!”",
      "paliTitle": ""
    },
    {
      "number": 17,
      "pali": "Atha kho jāṇussoṇi [jāṇusoṇi (ka.)] brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho jāṇussoṇi brāhmaṇo bhagavantaṃ etadavoca – ‘‘ko nu kho, bho gotama, hetu ko paccayo yena midhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti? ‘‘Katattā ca, brāhmaṇa, akatattā ca. Evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjantī’’ti. ‘‘Ko pana, bho gotama, hetu ko paccayo yena midhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti? ‘‘Katattā ca, brāhmaṇa, akatattā ca. Evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti. ‘‘Na kho ahaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ ājānāmi. Sādhu me bhavaṃ gotamo tathā dhammaṃ desetu yathā ahaṃ imassa bhoto gotamassa saṃkhittena bhāsitassa vitthārena atthaṃ avibhattassa vitthārena atthaṃ ājāneyya’’nti. ‘‘Tena hi, brāhmaṇa, suṇāhi, sādhukaṃ manasi karohi; bhāsissāmī’’ti. ‘‘Evaṃ bho’’ti kho jāṇussoṇi brāhmaṇo bhagavato paccassosi. Bhagavā etadavoca – ‘‘Idha, brāhmaṇa, ekaccassa kāyaduccaritaṃ kataṃ hoti, akataṃ hoti kāyasucaritaṃ; vacīduccaritaṃ kataṃ hoti, akataṃ hoti vacīsucaritaṃ; manoduccaritaṃ kataṃ hoti, akataṃ hoti manosucaritaṃ. Evaṃ kho, brāhmaṇa, katattā ca akatattā ca evamidhekacce sattā kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjanti. Idha pana, brāhmaṇa, ekaccassa kāyasucaritaṃ kataṃ hoti, akataṃ hoti kāyaduccaritaṃ; vacīsucaritaṃ kataṃ hoti, akataṃ hoti vacīduccaritaṃ; manosucaritaṃ kataṃ hoti, akataṃ hoti manoduccaritaṃ. Evaṃ kho, brāhmaṇa, katattā ca akatattā ca evamidhekacce sattā kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjantī’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Then the Brahmin Jāṇussoṇi approached the Bhagavā. Having approached, he exchanged courteous greetings with the Bhagavā. After exchanging polite and memorable conversation, he sat down to one side. As he sat to one side, the Brahmin Jāṇussoṇi said to the Bhagavā: \"Indeed, good Gotama, what is the reason, what is the cause, by which some beings, upon the body's dissolution, after death, are reborn into a state of deprivation, a bad destination, ruin, into hell?\"\n\n\"Because of what is done, Brahmin, and what is left undone. In this way, some beings, upon the body's dissolution, after death, are reborn into a state of deprivation, a bad destination, ruin, into hell.\"\n\n\"But good Gotama, what is the reason, what is the cause, by which some beings, upon the body's dissolution, after death, are reborn into a good destination, into the heavenly world?\"\n\n\"Because of what is done, Brahmin, and what is left undone. In this way, some beings, upon the body's dissolution, after death, are reborn into a good destination, into the heavenly world.\"\n\n\"Indeed, I do not understand the detailed meaning of what the good Gotama has spoken in brief, the detailed meaning of what has not been expounded. It would be good if the good Gotama would teach the Dhamma in such a way that I may understand the detailed meaning of what the good Gotama has spoken in brief, the detailed meaning of what has not been expounded.\"\n\n\"In that case, Brahmin, listen attentively and pay close heed; I shall speak.\" \"Yes, good sir,\" replied the Brahmin Jāṇussoṇi to the Bhagavā.\n\nThe Bhagavā said this: \"Here, Brahmin, some person has committed misconduct by body, and has not performed good conduct by body; has committed misconduct by speech, and has not performed good conduct by speech; has committed misconduct by mind, and has not performed good conduct by mind. It is in this way, Brahmin, because of what is done and what is left undone, that some beings, upon the body's dissolution, after death, are reborn into a state of deprivation, a bad destination, ruin, into hell.\"\n\n\"Here again, Brahmin, some person has performed good conduct by body, and has not committed misconduct by body; has performed good conduct by speech, and has not committed misconduct by speech; has performed good conduct by mind, and has not committed misconduct by mind. It is in this way, Brahmin, because of what is done and what is left undone, that some beings, upon the body's dissolution, after death, are reborn into a good destination, into the heavenly world.\"\n\n\"Excellent, good Gotama, excellent! Just as if one were to set upright what had been overthrown, or to reveal what had been hidden, or to point out the way to one who was lost, or to bring a lamp into the darkness so that those with eyes could see forms, even so has the good Gotama illuminated the Dhamma in various ways. I go for refuge to the good Gotama, to the Dhamma, and to the Saṅgha. May the good Gotama remember me as a lay follower who has gone for refuge from this day forth for as long as life lasts.\"",
      "sinhala": "ඉන්පසු ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. විනෝදජනක වූ ද, සිහි කටයුතු වූ ද කතා බස් පවත්වවා එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට මෙය පැවසීය: \"භවත් ගෞතමයන් වහන්ස, කවර කරුණක් නිසා ද, කවර ප්‍රත්‍යයක් නිසා ද සමහර සත්ත්වයෝ කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදිත් ද?\"\n\n\"බ්‍රාහ්මණය, (අකුසල්) කරන ලද හෙයින් ද, (කුසල්) නොකරන ලද හෙයින් ද. මෙසේ සමහර සත්ත්වයෝ කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදිත්.\"\n\n\"එසේ නම්, භවත් ගෞතමයන් වහන්ස, කවර කරුණක් නිසා ද, කවර ප්‍රත්‍යයක් නිසා ද සමහර සත්ත්වයෝ කය බිඳී මරණින් මතු සුගති, සග්ග ලෝකවල උපදිත් ද?\"\n\n\"බ්‍රාහ්මණය, (කුසල්) කරන ලද හෙයින් ද, (අකුසල්) නොකරන ලද හෙයින් ද. මෙසේ සමහර සත්ත්වයෝ කය බිඳී මරණින් මතු සුගති, සග්ග ලෝකවල උපදිත්.\"\n\n\"භවත් ගෞතමයන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද මේ අදහස, විස්තර වශයෙන් බෙදා නොදැක්වූ නිසා මා නම් එහි විස්තරාර්ථය නොදනිමි. යහපති, භවත් ගෞතමයන් වහන්සේ මට ධර්මය ඒ අයුරින් දේශනා කළ මැනව, යම්සේ මා මේ භවත් ගෞතමයන් වහන්සේ විසින් සංක්ෂිප්තයෙන් දේශනා කරන ලද, එහෙත් විස්තර වශයෙන් නොබෙදන ලද මේ අදහසෙහි විස්තරාර්ථය අවබෝධ කරගනිමි ද.\"\n\n\"එසේ නම්, බ්‍රාහ්මණය, අසව, හොඳින් මෙනෙහි කරව; මම දේශනා කරන්නෙමි.\" \"එසේය, ස්වාමීනි\" යැයි ජාණුස්සෝණි බ්‍රාහ්මණයා භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නේය.\n\nභාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: \"බ්‍රාහ්මණය, මෙහිලා සමහරෙකුට කාය දුශ්චරිතය කරනු ලැබේ, කාය සුචරිතය නොකරනු ලැබේ. වචී දුශ්චරිතය කරනු ලැබේ, වචී සුචරිතය නොකරනු ලැබේ. මනෝ දුශ්චරිතය කරනු ලැබේ, මනෝ සුචරිතය නොකරනු ලැබේ. මෙසේ නම්, බ්‍රාහ්මණය, (කාය, වචී, මනෝ) දුශ්චරිත කරන ලද හෙයින් ද, (කාය, වචී, මනෝ) සුචරිත නොකරන ලද හෙයින් ද මෙසේ සමහර සත්ත්වයෝ කය බිඳී මරණින් මතු අපාය, දුගති, විනිපාත, නිරය යන තැන්වල උපදිත්.\"\n\n\"මෙහිලා ද, බ්‍රාහ්මණය, සමහරෙකුට කාය සුචරිතය කරනු ලැබේ, කාය දුශ්චරිතය නොකරනු ලැබේ. වචී සුචරිතය කරනු ලැබේ, වචී දුශ්චරිතය නොකරනු ලැබේ. මනෝ සුචරිතය කරනු ලැබේ, මනෝ දුශ්චරිතය නොකරනු ලැබේ. මෙසේ නම්, බ්‍රාහ්මණය, (කාය, වචී, මනෝ) සුචරිත කරන ලද හෙයින් ද, (කාය, වචී, මනෝ) දුශ්චරිත නොකරන ලද හෙයින් ද මෙසේ සමහර සත්ත්වයෝ කය බිඳී මරණින් මතු සුගති, සග්ග ලෝකවල උපදිත්.\"\n\n\"භවත් ගෞතමයන් වහන්ස, ඉතා මනහර ය, භවත් ගෞතමයන් වහන්ස, ඉතා මනහර ය. යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේ ද, වැසූ දෙයක් හෙළි කරන්නේ ද, මං මුළා වූවෙකුට මග කියන්නේ ද, ඇස් ඇත්තෝ රූප දකිත්වා යි අන්ධකාරයේ තෙල් පහනක් දරන්නේ ද, එසේම භවත් ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරනු ලැබීය. භවත් ගෞතමයන් වහන්ස, මම ඒ භාග්‍යවතුන් වහන්සේ ද, ධර්මය ද, සංඝයා ද සරණ යමි. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා භවත් ගෞතමයන් වහන්සේ පිළිගන්නා සේක්වා.\"",
      "paliTitle": ""
    },
    {
      "number": 18,
      "pali": "Atha kho āyasmā ānando yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ ānandaṃ bhagavā etadavoca – ‘‘ekaṃsenāhaṃ, ānanda, akaraṇīyaṃ vadāmi kāyaduccaritaṃ vacīduccaritaṃ manoduccarita’’nti. ‘‘Yamidaṃ, bhante, bhagavatā ekaṃsena akaraṇīyaṃ akkhātaṃ kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ tasmiṃ akaraṇīye kayiramāne ko ādīnavo pāṭikaṅkho’’ti? ‘‘Yamidaṃ, ānanda, mayā ekaṃsena akaraṇīyaṃ akkhātaṃ kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ tasmiṃ akaraṇīye kayiramāne ayaṃ ādīnavo pāṭikaṅkho – attāpi attānaṃ upavadati, anuvicca viññū garahanti, pāpako kittisaddo abbhuggacchati, sammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Yamidaṃ, ānanda, mayā ekaṃsena akaraṇīyaṃ akkhātaṃ kāyaduccaritaṃ vacīduccaritaṃ manoduccaritaṃ tasmiṃ akaraṇīye kayiramāne ayaṃ ādīnavo pāṭikaṅkho’’ti. ‘‘Ekaṃsenāhaṃ, ānanda, karaṇīyaṃ vadāmi kāyasucaritaṃ vacīsucaritaṃ manosucarita’’nti. ‘‘Yamidaṃ, bhante, bhagavatā ekaṃsena karaṇīyaṃ akkhātaṃ kāyasucaritaṃ vacīsucaritaṃ manosucaritaṃ tasmiṃ karaṇīye kayiramāne ko ānisaṃso pāṭikaṅkho’’ti? ‘‘Yamidaṃ, ānanda, mayā ekaṃsena karaṇīyaṃ akkhātaṃ kāyasucaritaṃ vacīsucaritaṃ manosucaritaṃ tasmiṃ karaṇīye kayiramāne ayaṃ ānisaṃso pāṭikaṅkho – attāpi attānaṃ na upavadati, anuvicca viññū pasaṃsanti, kalyāṇo kittisaddo abbhuggacchati, asammūḷho kālaṃ karoti, kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Yamidaṃ, ānanda, mayā ekaṃsena karaṇīyaṃ akkhātaṃ kāyasucaritaṃ vacīsucaritaṃ manosucaritaṃ tasmiṃ karaṇīye kayiramāne ayaṃ ānisaṃso pāṭikaṅkho’’ti.",
      "english": "Then, the Venerable Ananda approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. As the Venerable Ananda was sitting to one side, the Blessed One said to him: \"Ananda, I declare unskillful conduct of body, unskillful conduct of speech, and unskillful conduct of mind to be absolutely things not to be done.\"\n\n\"Bhante, regarding what the Blessed One has absolutely declared as things not to be done—unskillful conduct of body, unskillful conduct of speech, and unskillful conduct of mind—what disadvantage or peril is to be expected when these things not to be done are engaged in?\" \"Ananda, regarding what I have absolutely declared as things not to be done—unskillful conduct of body, unskillful conduct of speech, and unskillful conduct of mind—when these things not to be done are engaged in, this is the disadvantage or peril to be expected: one blames oneself; discerning wise individuals condemn one; a bad reputation spreads; one dies bewildered; and upon the breakdown of the body, after death, one reappears in a state of deprivation, a miserable destination, a lower realm, or hell. This, Ananda, is the disadvantage or peril to be expected when those things that I have absolutely declared as not to be done—unskillful conduct of body, unskillful conduct of speech, and unskillful conduct of mind—are engaged in.\"\n\n\"Ananda, I declare skillful conduct of body, skillful conduct of speech, and skillful conduct of mind to be absolutely things to be done.\"\n\n\"Bhante, regarding what the Blessed One has absolutely declared as things to be done—skillful conduct of body, skillful conduct of speech, and skillful conduct of mind—what advantage or benefit is to be expected when these things to be done are engaged in?\" \"Ananda, regarding what I have absolutely declared as things to be done—skillful conduct of body, skillful conduct of speech, and skillful conduct of mind—when these things to be done are engaged in, this is the advantage or benefit to be expected: one does not blame oneself; discerning wise individuals praise one; a good reputation spreads; one dies unbewildered; and upon the breakdown of the body, after death, one reappears in a happy destination, a heavenly world. This, Ananda, is the advantage or benefit to be expected when those things that I have absolutely declared as to be done—skillful conduct of body, skillful conduct of speech, and skillful conduct of mind—are engaged in.\"",
      "sinhala": "එවිට ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේ භාග්‍යවතුන් වහන්සේ වෙත පැමිණ, භාග්‍යවතුන් වහන්සේට වන්දනා කර එක් පසෙකින් වාඩි වූහ. එක් පසෙකින් වැඩ සිටි ආයුෂ්මත් ආනන්ද ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “ආනන්දයෙනි, කාය දුශ්චරිතය, වචී දුශ්චරිතය, මනෝ දුශ්චරිතය යන මේවා අනිවාර්යයෙන්ම නොකළ යුතු දේවල් යැයි මම දේශනා කරමි.” “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් අනිවාර්යයෙන්ම නොකළ යුතු යැයි දේශනා කරන ලද මේ කාය දුශ්චරිතය, වචී දුශ්චරිතය, මනෝ දුශ්චරිතය යන දේ කළහොත්, ඉන් බලාපොරොත්තු විය හැකි ආදීනවය කුමක්ද?” “ආනන්දයෙනි, මා විසින් අනිවාර්යයෙන්ම නොකළ යුතු යැයි දේශනා කරන ලද මේ කාය දුශ්චරිතය, වචී දුශ්චරිතය, මනෝ දුශ්චරිතය යන දේ කළහොත්, මේ ආදීනවය බලාපොරොත්තු විය යුතුය: තමා තමාටම දොස් පවරයි, පරීක්ෂා කර බලා නුවණැත්තෝ (ඔහුට) නින්දා කරති, නරක කීර්ති රාවයක් පැතිර යයි, මුළා වූ සිතිවිල්ලෙන් මිය යයි, ශරීරය බිඳී මරණයෙන් පසු අපාය, දුර්ගති, විනිපාත, නිරය යන තැන්වල උපදියි. ආනන්දයෙනි, මා විසින් අනිවාර්යයෙන්ම නොකළ යුතු යැයි දේශනා කරන ලද මේ කාය දුශ්චරිතය, වචී දුශ්චරිතය, මනෝ දුශ්චරිතය යන දේ කළහොත්, මේ ආදීනවය බලාපොරොත්තු විය යුතුය.” “ආනන්දයෙනි, කාය සුචරිතය, වචී සුචරිතය, මනෝ සුචරිතය යන මේවා අනිවාර්යයෙන්ම කළ යුතු දේවල් යැයි මම දේශනා කරමි.” “ස්වාමීනි, භාග්‍යවතුන් වහන්සේ විසින් අනිවාර්යයෙන්ම කළ යුතු යැයි දේශනා කරන ලද මේ කාය සුචරිතය, වචී සුචරිතය, මනෝ සුචරිතය යන දේ කළහොත්, ඉන් බලාපොරොත්තු විය හැකි ආනිසංසය කුමක්ද?” “ආනන්දයෙනි, මා විසින් අනිවාර්යයෙන්ම කළ යුතු යැයි දේශනා කරන ලද මේ කාය සුචරිතය, වචී සුචරිතය, මනෝ සුචරිතය යන දේ කළහොත්, මේ ආනිසංසය බලාපොරොත්තු විය යුතුය: තමා තමාටම දොස් නොපවරයි, පරීක්ෂා කර බලා නුවණැත්තෝ (ඔහුට) ප්‍රශංසා කරති, හොඳ කීර්ති රාවයක් පැතිර යයි, නොමුළා වූ සිතිවිල්ලෙන් මිය යයි, ශරීරය බිඳී මරණයෙන් පසු සුගති, සග්ග යන දෙව්ලොව උපදියි. ආනන්දයෙනි, මා විසින් අනිවාර්යයෙන්ම කළ යුතු යැයි දේශනා කරන ලද මේ කාය සුචරිතය, වචී සුචරිතය, මනෝ සුචරිතය යන දේ කළහොත්, මේ ආනිසංසය බලාපොරොත්තු විය යුතුය.”",
      "paliTitle": ""
    },
    {
      "number": 19,
      "pali": "‘‘Akusalaṃ, bhikkhave, pajahatha. Sakkā, bhikkhave, akusalaṃ pajahituṃ. No cedaṃ [no cetaṃ (syā. kaṃ. pī. ka.) saṃ. ni. 3.28 passitabbaṃ], bhikkhave, sakkā abhavissa akusalaṃ pajahituṃ, nāhaṃ evaṃ vadeyyaṃ – ‘akusalaṃ, bhikkhave, pajahathā’ti. Yasmā ca kho, bhikkhave, sakkā akusalaṃ pajahituṃ tasmāhaṃ evaṃ vadāmi – ‘akusalaṃ, bhikkhave, pajahathā’ti. Akusalañca hidaṃ, bhikkhave [akusalaṃ bhikkhave (ka.)], pahīnaṃ ahitāya dukkhāya saṃvatteyya nāhaṃ evaṃ vadeyyaṃ – ‘akusalaṃ, bhikkhave, pajahathā’ti. Yasmā ca kho, bhikkhave, akusalaṃ pahīnaṃ hitāya sukhāya saṃvattati tasmāhaṃ evaṃ vadāmi – ‘akusalaṃ, bhikkhave, pajahathā’’’ti. ‘‘Kusalaṃ, bhikkhave, bhāvetha. Sakkā, bhikkhave, kusalaṃ bhāvetuṃ. No cedaṃ, bhikkhave, sakkā abhavissa kusalaṃ bhāvetuṃ, nāhaṃ evaṃ vadeyyaṃ – ‘kusalaṃ, bhikkhave, bhāvethā’ti. Yasmā ca kho, bhikkhave, sakkā kusalaṃ bhāvetuṃ tasmāhaṃ evaṃ vadāmi – ‘kusalaṃ, bhikkhave, bhāvethā’ti. Kusalañca hidaṃ, bhikkhave, bhāvitaṃ ahitāya dukkhāya saṃvatteyya, nāhaṃ evaṃ vadeyyaṃ – ‘kusalaṃ, bhikkhave, bhāvethā’ti. Yasmā ca kho, bhikkhave, kusalaṃ bhāvitaṃ hitāya sukhāya saṃvattati tasmāhaṃ evaṃ vadāmi – ‘kusalaṃ, bhikkhave, bhāvethā’’’ti.",
      "english": "Monks, abandon the unwholesome. Monks, it is possible to abandon the unwholesome. And if, monks, it were not possible to abandon the unwholesome, I would not speak thus: ‘Monks, abandon the unwholesome.’ But because, monks, it is possible to abandon the unwholesome, therefore I speak thus: ‘Monks, abandon the unwholesome.’ And if, monks, abandoning the unwholesome were to lead to harm and suffering, I would not speak thus: ‘Monks, abandon the unwholesome.’ But because, monks, abandoning the unwholesome leads to welfare and happiness, therefore I speak thus: ‘Monks, abandon the unwholesome.’\n\nMonks, cultivate the wholesome. Monks, it is possible to cultivate the wholesome. And if, monks, it were not possible to cultivate the wholesome, I would not speak thus: ‘Monks, cultivate the wholesome.’ But because, monks, it is possible to cultivate the wholesome, therefore I speak thus: ‘Monks, cultivate the wholesome.’ And if, monks, cultivating the wholesome were to lead to harm and suffering, I would not speak thus: ‘Monks, cultivate the wholesome.’ But because, monks, cultivating the wholesome leads to welfare and happiness, therefore I speak thus: ‘Monks, cultivate the wholesome.’",
      "sinhala": "මහණෙනි, අකුසල් දුරු කරන්න. මහණෙනි, අකුසල් දුරු කිරීමට හැකිය. මහණෙනි, යම් හෙයකින් අකුසල් දුරු කිරීමට නොහැකි වුණා නම්, ‘මහණෙනි, අකුසල් දුරු කරන්න’ යැයි මම මෙසේ නොකියන්නෙමි. මහණෙනි, අකුසල් දුරු කිරීමට හැකි හෙයින්ම, ‘මහණෙනි, අකුසල් දුරු කරන්න’ යැයි මම මෙසේ කියමි. මහණෙනි, යම් හෙයකින් දුරු කරන ලද අකුසල් අහිත පිණිසත්, දුක පිණිසත් පවතී නම්, ‘මහණෙනි, අකුසල් දුරු කරන්න’ යැයි මම මෙසේ නොකියන්නෙමි. මහණෙනි, යම් හෙයකින් දුරු කරන ලද අකුසල් හිත පිණිසත්, සුවය පිණිසත් පවතින්නේද, එහෙයින්ම මම ‘මහණෙනි, අකුසල් දුරු කරන්න’ යැයි මෙසේ කියමි.\n\nමහණෙනි, කුසල් වඩන්න. මහණෙනි, කුසල් වැඩීමට හැකිය. මහණෙනි, යම් හෙයකින් කුසල් වැඩීමට නොහැකි වුණා නම්, ‘මහණෙනි, කුසල් වඩන්න’ යැයි මම මෙසේ නොකියන්නෙමි. මහණෙනි, කුසල් වැඩීමට හැකි හෙයින්ම, ‘මහණෙනි, කුසල් වඩන්න’ යැයි මම මෙසේ කියමි. මහණෙනි, යම් හෙයකින් වඩන ලද කුසල් අහිත පිණිසත්, දුක පිණිසත් පවතී නම්, ‘මහණෙනි, කුසල් වඩන්න’ යැයි මම මෙසේ නොකියන්නෙමි. මහණෙනි, යම් හෙයකින් වඩන ලද කුසල් හිත පිණිසත්, සුවය පිණිසත් පවතින්නේද, එහෙයින්ම මම ‘මහණෙනි, කුසල් වඩන්න’ යැයි මෙසේ කියමි.",
      "paliTitle": ""
    },
    {
      "number": 20,
      "pali": "‘‘Dveme, bhikkhave, dhammā saddhammassa sammosāya antaradhānāya saṃvattanti. Katame dve? Dunnikkhittañca padabyañjanaṃ attho ca dunnīto. Dunnikkhittassa, bhikkhave, padabyañjanassa atthopi dunnayo hoti. Ime kho, bhikkhave, dve dhammā saddhammassa sammosāya antaradhānāya saṃvattantī’’ti.",
      "english": "Monks, these two things lead to the confusion and disappearance of the True Dhamma. Which two? Improperly arranged words and phrases, and the meaning wrongly interpreted. Monks, when the words and phrases are improperly arranged, the meaning also becomes difficult to comprehend. Indeed, monks, these two things lead to the confusion and disappearance of the True Dhamma.",
      "sinhala": "මහණෙනි, මේ ධර්‍ම දෙකක් සද්ධර්‍ම‍යේ ව්‍යාකූල වීමටත්, අතුරුදන් වීමටත් හේතු වේ. ඒ දෙක කවරේද? වැරදි ලෙස යෙදූ පදව්‍යඤ්ජනත්, අර්ථය වැරදි ලෙස අවබෝධ කර ගැනීමත්ය. මහණෙනි, වැරදි ලෙස යෙදූ පදව්‍යඤ්ජනයන්ගේ අර්ථයත් අවබෝධ කර ගැනීමට අපහසු වේ. මහණෙනි, මේ ධර්‍ම දෙක සද්ධර්‍ම‍යේ ව්‍යාකූල වීමටත්, අතුරුදන් වීමටත් හේතු වේ.",
      "paliTitle": ""
    },
    {
      "number": 21,
      "pali": "‘‘Dveme, bhikkhave, dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattanti. Katame dve? Sunikkhittañca padabyañjanaṃ attho ca sunīto. Sunikkhittassa, bhikkhave, padabyañjanassa atthopi sunayo hoti. Ime kho, bhikkhave, dve dhammā saddhammassa ṭhitiyā asammosāya anantaradhānāya saṃvattantī’’ti. ",
      "english": "Monks, these two factors contribute to the establishment, the non-corruption, and the non-disappearance of the true Dhamma. Which two? The precisely articulated wording and phrasing, and the properly comprehended meaning. Monks, when the wording and phrasing are precisely articulated, the meaning is also properly comprehended. Indeed, these two factors, monks, contribute to the establishment, the non-corruption, and the non-disappearance of the true Dhamma.",
      "sinhala": "භික්ෂූණි, සද්ධර්මයේ ස්ථිතිභාවය, නො-මුළා වීම සහ නො-අතුරුදහන් වීම පිණිස මේ ධර්ම දෙක හේතු වේ. ඒ දෙක කවරේද? මනාව තැන්පත් කරන ලද පදබ්‍යංජනය සහ මනාව අවබෝධ කරන ලද අර්ථය යි. භික්ෂූණි, පදබ්‍යංජනය මනාව තැන්පත් කරන ලද්දක් වන විට අර්ථය ද මනාව අවබෝධ වේ. භික්ෂූණි, මේ ධර්ම දෙක සද්ධර්මයේ ස්ථිතිභාවය, නො-මුළා වීම සහ නො-අතුරුදහන් වීම පිණිස හේතු වේ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Adhikaraṇavaggo dutiyo.",
    "english": "",
    "sinhala": ""
  }
}