{
  "id": "an2.18",
  "title": {
    "pali": "Vinayapeyyālaṃ",
    "english": "The Standard Passage on Monastic Discipline",
    "sinhala": "විනය පිළිබඳ පුනරාවර්තන කොටස"
  },
  "sections": [
    {
      "number": 201,
      "pali": "‘‘Dveme, bhikkhave, atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññattaṃ. Katame dve? Saṅghasuṭṭhutāya saṅghaphāsutāya… dummaṅkūnaṃ puggalānaṃ niggahāya, pesalānaṃ bhikkhūnaṃ phāsuvihārāya… diṭṭhadhammikānaṃ āsavānaṃ saṃvarāya, samparāyikānaṃ āsavānaṃ paṭighātāya… diṭṭhadhammikānaṃ verānaṃ saṃvarāya, samparāyikānaṃ verānaṃ paṭighātāya… diṭṭhadhammikānaṃ vajjānaṃ saṃvarāya, samparāyikānaṃ vajjānaṃ paṭighātāya… diṭṭhadhammikānaṃ bhayānaṃ saṃvarāya, samparāyikānaṃ bhayānaṃ paṭighātāya… diṭṭhadhammikānaṃ akusalānaṃ dhammānaṃ saṃvarāya, samparāyikānaṃ akusalānaṃ dhammānaṃ paṭighātāya… gihīnaṃ anukampāya, pāpicchānaṃ bhikkhūnaṃ pakkhupacchedāya… appasannānaṃ pasādāya, pasannānaṃ bhiyyobhāvāya… saddhammaṭṭhitiyā vinayānuggahāya. Ime kho, bhikkhave, dve atthavase paṭicca tathāgatena sāvakānaṃ sikkhāpadaṃ paññatta’’nti.",
      "english": "Monks, for these two purposes the Tathāgata has laid down training rules for his disciples. Which two? For the integrity of the Saṅgha and for the ease of the Saṅgha; for the restraint of unruly individuals and for the comfortable living of virtuous monks; for the restraint of defilements in this present life and for the elimination of defilements in future lives; for the restraint of hostilities in this present life and for the elimination of hostilities in future lives; for the restraint of blameworthy actions in this present life and for the elimination of blameworthy actions in future lives; for the restraint of fears in this present life and for the elimination of fears in future lives; for the restraint of unwholesome states in this present life and for the elimination of unwholesome states in future lives; out of compassion for householders and for cutting off the support for monks with evil desires; for the awakening of confidence in those who lack it and for the further increase of confidence in those who already possess it; for the establishment of the True Dhamma and for the upholding of the Vinaya. Monks, it is for these two purposes that the Tathāgata has laid down training rules for his disciples.",
      "sinhala": "මහණෙනි, තථාගතයන් වහන්සේ විසින් ශ්‍රාවකයන්ට ශික්‍ෂා පද පනවා වදාළේ මේ කරුණු දෙකක් පදනම් කරගෙන යි. ඒ කවර කරුණු දෙකක්ද?\n\nසංඝයාගේ මනා පැවැත්ම පිණිසත්, සංඝයාට පහසුව පිණිසත්;\nඅශෝභන පුද්ගලයන් මැඩලීම පිණිසත්, ප්‍රියශීලී භික්‍ෂූන්ගේ පහසු විහරණය පිණිසත්;\nදිට්ඨධම්මික (මේ ආත්මයේ) ආශ්‍රවයන් සංවර කර ගැනීම පිණිසත්, සම්පරායික (පරලොවදී ඇතිවන) ආශ්‍රවයන් මුලිනුපුටා දැමීම පිණිසත්;\nදිට්ඨධම්මික වෛරයන් සංවර කර ගැනීම පිණිසත්, සම්පරායික වෛරයන් මුලිනුපුටා දැමීම පිණිසත්;\nදිට්ඨධම්මික වරදවල් සංවර කර ගැනීම පිණිසත්, සම්පරායික වරදවල් මුලිනුපුටා දැමීම පිණිසත්;\nදිට්ඨධම්මික භයයන් සංවර කර ගැනීම පිණිසත්, සම්පරායික භයයන් මුලිනුපුටා දැමීම පිණිසත්;\nදිට්ඨධම්මික අකුසල ධර්මයන් සංවර කර ගැනීම පිණිසත්, සම්පරායික අකුසල ධර්මයන් මුලිනුපුටා දැමීම පිණිසත්;\nගිහියන්ට අනුකම්පා පිණිසත්, පාපී ආශාවන් ඇති භික්‍ෂූන්ගේ පක්ෂය සිඳලීම පිණිසත්;\nඅප්‍රසන්න වූවන්ගේ ප්‍රසාදය ඇති කිරීම පිණිසත්, ප්‍රසන්න වූවන්ගේ ප්‍රසාදය වැඩි කිරීම පිණිසත්;\nසද්ධර්මයේ පැවැත්ම පිණිසත්, විනයට අනුග්‍රහය පිණිසත් (මේ ශික්‍ෂා පද පනවා වදාළ සේක).\n\nමහණෙනි, තථාගතයන් වහන්සේ විසින් ශ්‍රාවකයන්ට ශික්‍ෂා පද පනවා වදාළේ මේ කරුණු දෙක පදනම් කරගෙනමයි.",
      "paliTitle": ""
    },
    {
      "number": 202,
      "numberRange": "202-230",
      "pali": "‘‘Dveme, bhikkhave, atthavase paṭicca tathāgatena sāvakānaṃ pātimokkhaṃ paññattaṃ…pe… pātimokkhuddeso paññatto… pātimokkhaṭṭhapanaṃ paññattaṃ… pavāraṇā paññattā… pavāraṇaṭṭhapanaṃ paññattaṃ… tajjanīyakammaṃ paññattaṃ… niyassakammaṃ paññattaṃ… pabbājanīyakammaṃ paññattaṃ… paṭisāraṇīyakammaṃ paññattaṃ… ukkhepanīyakammaṃ paññattaṃ… parivāsadānaṃ paññattaṃ… mūlāya paṭikassanaṃ paññattaṃ… mānattadānaṃ paññattaṃ… abbhānaṃ paññattaṃ… osāraṇīyaṃ paññattaṃ… nissāraṇīyaṃ paññattaṃ… upasampadā paññattā… ñattikammaṃ paññattaṃ… ñattidutiyakammaṃ paññattaṃ… ñatticatutthakammaṃ paññattaṃ… apaññatte paññattaṃ… paññatte anupaññattaṃ… sammukhāvinayo paññatto… sativinayo paññatto… amūḷhavinayo paññatto… paṭiññātakaraṇaṃ paññattaṃ… yebhuyyasikā paññattā… tassapāpiyasikā paññattā… tiṇavatthārako paññatto. Katame dve? Saṅghasuṭṭhutāya, saṅghaphāsutāya… dummaṅkūnaṃ puggalānaṃ niggahāya, pesalānaṃ bhikkhūnaṃ phāsuvihārāya… diṭṭhadhammikānaṃ āsavānaṃ saṃvarāya, samparāyikānaṃ āsavānaṃ paṭighātāya… diṭṭhadhammikānaṃ verānaṃ saṃvarāya, samparāyikānaṃ verānaṃ paṭighātāya… diṭṭhadhammikānaṃ vajjānaṃ saṃvarāya, samparāyikānaṃ vajjānaṃ paṭighātāya… diṭṭhadhammikānaṃ bhayānaṃ saṃvarāya, samparāyikānaṃ bhayānaṃ paṭighātāya… diṭṭhadhammikānaṃ akusalānaṃ dhammānaṃ saṃvarāya, samparāyikānaṃ akusalānaṃ dhammānaṃ paṭighātāya… gihīnaṃ anukampāya, pāpicchānaṃ bhikkhūnaṃ pakkhupacchedāya… appasannānaṃ pasādāya, pasannānaṃ bhiyyobhāvāya… saddhammaṭṭhitiyā, vinayānuggahāya. Ime kho, bhikkhave, dve atthavase paṭicca tathāgatena sāvakānaṃ tiṇavatthārako paññatto’’ti. ",
      "english": "Monks, it is for these two categories of purposes that the Tathāgata laid down for his disciples the Pātimokkha, the recitation of the Pātimokkha, the suspension of the Pātimokkha recitation, the Pavāraṇā (invitation to be criticized), the suspension of the Pavāraṇā, the act of censure, the act of dependence, the act of banishment, the act of reconciliation, the act of suspension, the grant of probation, the rehabilitation to the beginning, the grant of penance, the rehabilitation, the act of re-admittance, the act of expulsion, the full ordination, the motion-only formal act, the motion-followed-by-one-proclamation formal act, the motion-followed-by-three-proclamations formal act, the establishment of what was not yet established, the supplementary establishment to what was already established, the Rule for Settlement in the Presence, the Rule for Settlement by Mindfulness, the Rule for Settlement for an Undistracted One, the Rule for Settlement by Acknowledgment, the Rule for Settlement by Majority Vote, the Rule for Settlement for Admitting Guilt, and the Rule for Settlement by Covering with Grass.\n\nWhat are these two categories of purposes?\nFor the good order of the Sangha, and for the smooth functioning of the Sangha;\nfor the suppression of unruly individuals, and for the comfortable living of conscientious monastics;\nfor the restraint of defilements in this very life, and for the prevention of defilements in future lives;\nfor the restraint of present enmities, and for the prevention of future enmities;\nfor the restraint of present blameworthy actions, and for the prevention of future blameworthy actions;\nfor the restraint of present fears, and for the prevention of future fears;\nfor the restraint of unwholesome states in this very life, and for the prevention of unwholesome states in future lives;\nout of compassion for laypeople, and for cutting off the support of monastics with evil desires;\nfor the awakening of faith in those who are without it, and for the growth of faith in those who already possess it;\nfor the establishment of the True Dhamma, and for the strengthening of the Vinaya.\n\nMonks, these are the two categories of purposes for which the Tathāgata laid down the Rule for Settlement by Covering with Grass for his disciples.",
      "sinhala": "භික්ෂූනි, මේ කරුණු දෙකක් අරභයා තථාගතයන් වහන්සේ විසින් ශ්‍රාවකයන්ට ප්‍රාතිමෝක්ෂය පනවන ලදී; ප්‍රාතිමෝක්ෂය උදෙසීම පනවන ලදී; ප්‍රාතිමෝක්ෂය තැබීම පනවන ලදී; පවාරණය පනවන ලදී; පවාරණය තැබීම පනවන ලදී; තජ්ජනීය කර්මය පනවන ලදී; නියස්සක කර්මය පනවන ලදී; ප්‍රබ්බාජනීය කර්මය පනවන ලදී; ප්‍රතිසාරණීය කර්මය පනවන ලදී; උක්ඛේපනීය කර්මය පනවන ලදී; පරිවාස දීම පනවන ලදී; මුලට පටිකැස්සීම පනවන ලදී; මානත් දීම පනවන ලදී; අබ්භානය පනවන ලදී; ඕසාරණීය කර්මය පනවන ලදී; නිස්සාරණීය කර්මය පනවන ලදී; උපසම්පදාව පනවන ලදී; ඤත්ති කර්මය පනවන ලදී; ඤත්ති ද්විතීය කර්මය පනවන ලදී; ඤත්ති චතුත්ථ කර්මය පනවන ලදී; නොපනවන ලද්දක් පැනවීම පනවන ලදී; පනවන ලද්දක් අනුපැනවීම පනවන ලදී; සම්මුඛා විනය පනවන ලදී; සති විනය පනවන ලදී; අමූඪ විනය පනවන ලදී; ප්‍රතිඥාතකරණය පනවන ලදී; යෙභුය්‍යසිකාව පනවන ලදී; තස්සපාපියසිකාව පනවන ලදී; තිණවත්ථාරකය පනවන ලදී.\n\nකවරක්ද ඒ කරුණු දෙක?\n\nසංඝයාගේ යහපැවැත්ම පිණිසත්, සංඝයාගේ සුවසේ වාසය පිණිසත්;\nදුර්මංකු පුද්ගලයන් දමනය කිරීම පිණිසත්, ගුණවත් භික්ෂූන් වහන්සේලාගේ සුවසේ වාසය පිණිසත්;\nමේ අත්බැව්හි ඇතිවන ආශ්‍රවයන් සංවරය පිණිසත්, පරලොව ඇතිවන ආශ්‍රවයන් ප්‍රතිඝාතය පිණිසත්;\nමේ අත්බැව්හි ඇතිවන වෛරයන් සංවරය පිණිසත්, පරලොව ඇතිවන වෛරයන් ප්‍රතිඝාතය පිණිසත්;\nමේ අත්බැව්හි ඇතිවන වැරදි සංවරය පිණිසත්, පරලොව ඇතිවන වැරදි ප්‍රතිඝාතය පිණිසත්;\nමේ අත්බැව්හි ඇතිවන භය සංවරය පිණිසත්, පරලොව ඇතිවන භය ප්‍රතිඝාතය පිණිසත්;\nමේ අත්බැව්හි ඇතිවන අකුසල ධර්මයන් සංවරය පිණිසත්, පරලොව ඇතිවන අකුසල ධර්මයන් ප්‍රතිඝාතය පිණිසත්;\nගිහියන්ට අනුකම්පාව පිණිසත්, පාපී ඉච්ඡා ඇති භික්ෂූන්ගේ පක්ෂය උච්ඡේදය පිණිසත්;\nඅප්‍රසන්න වූවන්ගේ ප්‍රසාදය ඇතිවීම පිණිසත්, ප්‍රසන්න වූවන්ගේ ප්‍රසාදය තවදුරටත් වැඩීම පිණිසත්;\nසද්ධර්මය පිහිටීම පිණිසත්, විනයට අනුග්‍රහය පිණිසත් (ඒ කරුණු දෙක පනවන ලදී).\n\nභික්ෂූනි, තථාගතයන් වහන්සේ විසින් ශ්‍රාවකයන්ට තිණවත්ථාරකය පනවන ලද්දේ මේ කරුණු දෙක අරභයාය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Vinayapeyyālaṃ niṭṭhitaṃ.",
    "english": "Vinaya Summary Completed",
    "sinhala": "විනය පෙය්‌යාලය නිමයි."
  }
}