{
  "id": "an2.7",
  "title": {
    "pali": "Sukhavaggo",
    "english": "The Chapter on Happiness",
    "sinhala": "සුඛ වර්‍ගය"
  },
  "sections": [
    {
      "number": 65,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Gihisukhañca pabbajitasukhañca. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ pabbajitasukha’’nti.",
      "english": "Monks, these are two kinds of happiness. Which two? The happiness of a layperson and the happiness of one gone forth. Indeed, monks, these are the two kinds of happiness. Of these two kinds of happiness, monks, the foremost is the happiness of one gone forth.",
      "sinhala": "මහණෙනි, මේ සැප දෙකකි. ඒ කවර දෙකක්ද? ගිහි සැපය සහ පැවිදි සැපය යනුයි. මහණෙනි, මේ සැප දෙක නම් මේවාය. මහණෙනි, මේ සැප දෙක අතුරින් යම් මේ පැවිදි සැපය වේද, එය අග්‍රය.",
      "paliTitle": ""
    },
    {
      "number": 66,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Kāmasukhañca nekkhammasukhañca. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ nekkhammasukha’’nti.",
      "english": "Monks, these are the two kinds of happiness. Which two? Sensual happiness and the happiness of renunciation. Monks, these are indeed the two kinds of happiness. Among these two kinds of happiness, monks, the happiness of renunciation is the foremost.",
      "sinhala": "භික්ෂූණි, මේ සැප දෙකකි. ඒ කවර දෙකක්ද? එනම්, කාමසුඛය සහ නෙක්ඛම්මසුඛයයි. භික්ෂූණි, මේවා සැප දෙකකි. භික්ෂූණි, මේ සැප දෙක අතුරින් නෙක්ඛම්මසුඛය අග්‍රතම වේ.",
      "paliTitle": ""
    },
    {
      "number": 67,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Upadhisukhañca nirupadhisukhañca. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ nirupadhisukha’’nti.",
      "english": "Monks, these are two kinds of happiness. Which two? Happiness with substratum and happiness without substratum. Indeed, monks, these are the two kinds of happiness. Among these two kinds of happiness, monks, the foremost is happiness without substratum.",
      "sinhala": "මහණෙනි, මේ සැප දෙකකි. ඒ දෙක කවරේද? උපාධි සහිත සැපයද, නිරුපාධි සැපයද යනුයි. මහණෙනි, මේවා ඒ සැප දෙවර්ගයයි. මහණෙනි, මේ සැප දෙක අතුරින් නිරුපාධි සැපය අග්‍ර වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 68,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Sāsavasukhañca anāsavasukhañca. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ anāsavasukha’’nti.",
      "english": "Monastics, there are these two kinds of happiness. Which two? Happiness associated with defilements and happiness unassociated with defilements. Monastics, these are indeed the two kinds of happiness. Among these two kinds of happiness, monastics, the foremost is the happiness unassociated with defilements.",
      "sinhala": "මහණෙනි, මේ සුවයන් දෙකකි. කවර දෙකක්ද? ආශ්‍රවයන් සහිත වූ සුවය ද, ආශ්‍රවයන් රහිත වූ සුවය ද යන දෙක යි. මහණෙනි, මේ සුවයන් දෙක නම් මේවා ම යි. මහණෙනි, මේ සුවයන් දෙකින් ආශ්‍රවයන් රහිත වූ සුවය නම් අග්‍ර‌යි.",
      "paliTitle": ""
    },
    {
      "number": 69,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Sāmisañca sukhaṃ nirāmisañca sukhaṃ. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ nirāmisaṃ sukha’’nti.",
      "english": "Monks, there are these two kinds of happiness. Which two? Sensual happiness and non-sensual happiness. Monks, these are indeed the two kinds of happiness. Among these two kinds of happiness, monks, non-sensual happiness is supreme.",
      "sinhala": "භික්ෂූනි, මේ සැප දෙකකි. ඒ කවර දෙකක්ද? ආමිස සැපය හා නිරාමිස සැපය යනුයි. භික්ෂූනි, මේ සැප දෙකකි. භික්ෂූනි, මේ දෙවැදෑරුම් සැප අතුරින් නිරාමිස සැපයම අග්‍රය.",
      "paliTitle": ""
    },
    {
      "number": 70,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Ariyasukhañca anariyasukhañca. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ ariyasukha’’nti.",
      "english": "“Monastics, there are these two kinds of happiness. Which two? Noble happiness and ignoble happiness. Indeed, monastics, these are the two kinds of happiness. Among these two kinds of happiness, monastics, noble happiness is the foremost.”",
      "sinhala": "භික්ෂූණි, මේ සැප දෙකකි.\nඒ දෙක කවරේද?\nආර්ය සැපය සහ අනාර්ය සැපයයි.\nභික්ෂූණි, මේ සැප දෙක නම් මේවාය.\nභික්ෂූණි, මේ සැප දෙක අතුරින් යම් මේ ආර්ය සැපය වේද, එය අග්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 71,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Kāyikañca sukhaṃ cetasikañca sukhaṃ. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ cetasikaṃ sukha’’nti.",
      "english": "Monastics, there are these two kinds of happiness. Which two? Physical happiness and mental happiness. Indeed, monastics, these are the two kinds of happiness. Among these two kinds of happiness, monastics, mental happiness is the foremost.",
      "sinhala": "භික්ෂූන් වහන්ස, සුවයන් දෙකක් ඇත. ඒ දෙක කුමක්ද? කායික සුවය ද, චෛතසික සුවය ද. භික්ෂූන් වහන්ස, මේ සුවයන් දෙක නම් මේවාය. භික්ෂූන් වහන්ස, මේ සුවයන් දෙක අතුරින් චෛතසික සුවය අග‍්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 72,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Sappītikañca sukhaṃ nippītikañca sukhaṃ. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ nippītikaṃ sukha’’nti.",
      "english": "Monks, there are these two kinds of happiness. Which two? Happiness accompanied by rapture, and happiness without rapture. Indeed, Monks, these are the two kinds of happiness. Among these two kinds of happiness, Monks, that which is happiness without rapture is considered the foremost.",
      "sinhala": "මහණෙනි, මේ සැප දෙකකි. ඒ කවර දෙකක්ද? ප්‍රීතිය සහිත සැපයද, ප්‍රීතිය රහිත සැපයද වේ. මහණෙනි, මේවා සැබැවින්ම සැප දෙකයි. මහණෙනි, මේ සැප දෙකින් යමක්ද ප්‍රීතිය රහිත සැපය, එය අග්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 73,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Sātasukhañca upekkhāsukhañca. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ upekkhāsukha’’nti.",
      "english": "Monks, there are these two kinds of happiness. Which two? Happiness associated with gratification and happiness associated with equanimity. These, indeed, monks, are the two kinds of happiness. Among these two kinds of happiness, monks, that which is happiness associated with equanimity is supreme.",
      "sinhala": "මහණෙනි, මේ සැප දෙකකි. කවරක්ද ඒ දෙක? සාත සැපයත්, උපේක්ඛා සැපයත් යනුයි. මහණෙනි, මේ සැප දෙක ඒ යි. මහණෙනි, මේ දෙවැදෑරුම් සැපයන් අතුරින් උපේක්ඛා සැපය අග්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 74,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Samādhisukhañca asamādhisukhañca. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ samādhisukha’’nti.",
      "english": "Monks, there are these two kinds of happiness. Which two? The happiness of concentration and the happiness apart from concentration. Indeed, monks, these are the two kinds of happiness. Among these two kinds of happiness, monks, the happiness of concentration is considered supreme.",
      "sinhala": "මහණෙනි, මේ සැප දෙකකි.\nඒ දෙක කවරේද?\nසමාධි සැපය ද, අසමාධි සැපය ද යන දෙක යි.\nමහණෙනි, මේ සැප දෙක නම් මේවා ම යි.\nමහණෙනි, මේ සැප දෙක අතුරින්, සමාධි සැපය නම් අග‍්‍ර ම යි.",
      "paliTitle": ""
    },
    {
      "number": 75,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Sappītikārammaṇañca sukhaṃ nippītikārammaṇañca sukhaṃ. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ nippītikārammaṇaṃ sukha’’nti.",
      "english": "Monastics, there are these two kinds of happiness. Which two? Happiness with rapture as its foundation, and happiness without rapture as its foundation. These, monastics, are indeed the two kinds of happiness. Among these two kinds of happiness, monastics, the foremost is happiness without rapture as its foundation.",
      "sinhala": "මහණෙනි, මේ සැප දෙකකි.\nකවර දෙකක්ද?\nප්‍රීතිය අරමුණු කොටගත් සැපයද, ප්‍රීතිය අරමුණු නොකළ සැපයද යනුයි.\nමහණෙනි, මේ සැප දෙක නම් මේවාය.\nමහණෙනි, මේ සැප දෙක අතුරින් යම් ප්‍රීතිය අරමුණු නොකළ සැපයක් වේද, එය අග්‍ර වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 76,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Sātārammaṇañca sukhaṃ upekkhārammaṇañca sukhaṃ. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ upekkhārammaṇaṃ sukha’’nti.",
      "english": "Monks, these two are forms of happiness. Which two? Happiness based on pleasant feeling, and happiness based on equanimity. Indeed, monks, these are the two forms of happiness. Of these two forms of happiness, monks, this is the foremost, namely, happiness based on equanimity.",
      "sinhala": "මහණෙනි, මේ සැප දෙකකි. කවර දෙකක්ද? සාතාර්ම්භණ සැපය සහ උපේක්ඛාර්ම්භණ සැපය යනුයි. මහණෙනි, මේ සැප දෙක නම් මේවාය. මහණෙනි, මේ සැප දෙකින් අග්‍ර වූයේ නම්, උපේක්ඛාර්ම්භණ සැපයයි.",
      "paliTitle": ""
    },
    {
      "number": 77,
      "pali": "‘‘Dvemāni, bhikkhave, sukhāni. Katamāni dve? Rūpārammaṇañca sukhaṃ arūpārammaṇañca sukhaṃ. Imāni kho, bhikkhave, dve sukhāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sukhānaṃ yadidaṃ arūpārammaṇaṃ sukha’’nti. ",
      "english": "Monks, there are these two kinds of happiness. Which two? Happiness based on material forms, and happiness based on the immaterial. Indeed, monks, these are the two kinds of happiness. Monks, of these two kinds of happiness, the foremost is happiness based on the immaterial.",
      "sinhala": "මහණෙනි, මේ සැප දෙකක් වෙති. ඒ කවර දෙකක්ද? රූපාරම්මණ සැපයද, අරූපාරම්මණ සැපයද යන දෙකයි. මහණෙනි, සැබැවින්ම මේ සැප දෙක නම් මේවාය. මහණෙනි, මේ සැප දෙකෙන් අරූපාරම්මණ සැපය නම් අග්‍ර වෙයි.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Sukhavaggo dutiyo.",
    "english": "The Second Section on Happiness",
    "sinhala": "දෙවන සුඛ වග්‍ගය"
  }
}