{
  "id": "an2.19",
  "title": {
    "pali": "Rāgapeyyālaṃ",
    "english": "The Section on Lust",
    "sinhala": "රාගය පිළිබඳ කොටස"
  },
  "sections": [
    {
      "number": 231,
      "pali": "‘‘Rāgassa, bhikkhave, abhiññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, abhiññāya ime dve dhammā bhāvetabbā’’ti. ‘‘Rāgassa, bhikkhave, pariññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, pariññā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, parikkhayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, parikkhayā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, pahānāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, pahānā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, khayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, khayā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, vayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, vayā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, virāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, virāgā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, nirodhāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, nirodhā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, cāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, cāgā ime dve dhammā bhāvetabbā. Rāgassa, bhikkhave, paṭinissaggāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Rāgassa, bhikkhave, paṭinissaggāya ime dve dhammā bhāvetabbā’’ti.",
      "english": "Monks, for the direct knowledge of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the direct knowledge of lust, these two qualities are to be developed. Monks, for the complete understanding of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the complete understanding of lust, these two qualities are to be developed. Monks, for the utter destruction of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the utter destruction of lust, these two qualities are to be developed. Monks, for the abandoning of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the abandoning of lust, these two qualities are to be developed. Monks, for the exhaustion of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the exhaustion of lust, these two qualities are to be developed. Monks, for the fading away of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the fading away of lust, these two qualities are to be developed. Monks, for the dispassion towards lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the dispassion towards lust, these two qualities are to be developed. Monks, for the cessation of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the cessation of lust, these two qualities are to be developed. Monks, for the relinquishment of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the relinquishment of lust, these two qualities are to be developed. Monks, for the total letting go of lust, two qualities are to be developed. Which two? Tranquility and insight. Monks, for the total letting go of lust, these two qualities are to be developed.",
      "sinhala": "භික්‍ෂූණි, රාගය සැබෑ ලෙස අවබෝධ කර ගැනීම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය සැබෑ ලෙස අවබෝධ කර ගැනීම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය මැනවින් අවබෝධ කර ගැනීම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය මැනවින් අවබෝධ කර ගැනීම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය සම්පූර්ණයෙන් ක්‍ෂය කිරීම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය සම්පූර්ණයෙන් ක්‍ෂය කිරීම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය ප්‍රහාණය කිරීම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය ප්‍රහාණය කිරීම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය ක්‍ෂය කිරීම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය ක්‍ෂය කිරීම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය නැති වී යාම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය නැති වී යාම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය විරාගී වීම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය විරාගී වීම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය නිරෝධය පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය නිරෝධය පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය අත්හැර දැමීම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය අත්හැර දැමීම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය. භික්‍ෂූණි, රාගය සම්පූර්ණයෙන් අත්හැර දැමීම පිණිස ධර්ම දෙකක් වඩනු ලැබිය යුතුය. ඒ දෙක කවරේද? සමථය හා විපස්සනාවය. භික්‍ෂූණි, රාගය සම්පූර්ණයෙන් අත්හැර දැමීම පිණිස මේ ධර්ම දෙක වඩනු ලැබිය යුතුය.",
      "paliTitle": ""
    },
    {
      "number": 232,
      "numberRange": "232-246",
      "pali": "‘‘Dosassa…pe… mohassa… kodhassa… upanāhassa… makkhassa… paḷāsassa… issāya… macchariyassa… māyāya… sāṭheyyassa… thambhassa… sārambhassa… mānassa… atimānassa… madassa… pamādassa, bhikkhave, abhiññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, abhiññā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, pariññāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, pariññā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, parikkhayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, parikkhayāya ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, pahānāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, pahānā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, khayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, khayā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, vayāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, vayā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, virāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, virāgā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, nirodhāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, nirodhā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, cāgāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, cāgā ime dve dhammā bhāvetabbā. Pamādassa, bhikkhave, paṭinissaggāya dve dhammā bhāvetabbā. Katame dve? Samatho ca vipassanā ca. Pamādassa, bhikkhave, paṭinissaggāya ime dve dhammā bhāvetabbā’’ti. (Idamavoca bhagavā. Attamanā te bhikkhū bhagavato bhāsitaṃ abhinandunti.) [( ) etthantare pāṭho sī. syā. kaṃ. pī. potthakesu natthi].",
      "english": "For the thorough understanding of ill-will, and so forth, of delusion, of anger, of rancour, of disparaging, of domineering rivalry, of envy, of avarice, of deceit, of fraud, of obstinacy, of presumption, of conceit, of excessive pride, of intoxication, and of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the thorough understanding of heedlessness, O monastics, these two qualities are to be cultivated. For the full comprehension of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the full comprehension of heedlessness, O monastics, these two qualities are to be cultivated. For the utter destruction of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the utter destruction of heedlessness, O monastics, these two qualities are to be cultivated. For the abandoning of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the abandoning of heedlessness, O monastics, these two qualities are to be cultivated. For the exhaustion of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the exhaustion of heedlessness, O monastics, these two qualities are to be cultivated. For the fading away of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the fading away of heedlessness, O monastics, these two qualities are to be cultivated. For dispassion towards heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For dispassion towards heedlessness, O monastics, these two qualities are to be cultivated. For the cessation of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the cessation of heedlessness, O monastics, these two qualities are to be cultivated. For the relinquishing of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the relinquishing of heedlessness, O monastics, these two qualities are to be cultivated. For the complete renunciation of heedlessness, O monastics, two qualities are to be cultivated. Which two? Serenity and insight. For the complete renunciation of heedlessness, O monastics, these two qualities are to be cultivated.",
      "sinhala": "මහණෙනි, ද්වේෂය, මෝහය, ක්‍රෝධය, උපානාහය, මක්ඛය, පලාසය, ඊර්ෂ්‍යාව, මසුරුකම, මායාව, සාඨෙය්‍යය, ථම්භය, සාරම්භය, මානය, අතිමානය, මදය, ප්‍රමාදය යන මේ ධර්මයන් ප්‍රත්‍යක්ෂ වශයෙන් අවබෝධ කර ගැනීම පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය ප්‍රත්‍යක්ෂ වශයෙන් අවබෝධ කර ගැනීම පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය පිරිසිඳ දැන ගැනීම පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය පිරිසිඳ දැන ගැනීම පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය මුළුමණින්ම ක්ෂය කිරීම පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය මුළුමණින්ම ක්ෂය කිරීම පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය ප්‍රහාණය කිරීම පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය ප්‍රහාණය කිරීම පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය ක්ෂය කිරීම පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය ක්ෂය කිරීම පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය විය වීම පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය විය වීම පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය විරාගය පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය විරාගය පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය නිරෝධය පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය නිරෝධය පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය චාගය පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය චාගය පිණිස මේ ධර්ම දෙක වැඩිය යුතුය. මහණෙනි, ප්‍රමාදය ප්‍රතිනිස්සර්ගය පිණිස ධර්ම දෙකක් වැඩිය යුතුය. කවර දෙකක්ද? සමථය හා විපස්සනාවය. මහණෙනි, ප්‍රමාදය ප්‍රතිනිස්සර්ගය පිණිස මේ ධර්ම දෙක වැඩිය යුතුය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Rāgapeyyālaṃ niṭṭhitaṃ.",
    "english": "Lust Section Concluded",
    "sinhala": "රාග පෙය්‍යාලය නිමයි."
  }
}