{
  "id": "an2.15",
  "title": {
    "pali": "Samāpattivaggo",
    "english": "The Chapter on Attainments",
    "sinhala": "සමාපත්ති වර්ගය"
  },
  "sections": [
    {
      "number": 164,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Samāpattikusalatā ca samāpattivuṭṭhānakusalatā ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Bhikkhus, there are these two qualities. Which two? Skillfulness in attaining meditative absorptions, and skillfulness in emerging from meditative absorptions. These, Bhikkhus, are indeed the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්ම දෙකකි. කවර දෙකක්ද? සමාපත්තිවලට සමවදීමේ කුසලතාවයද, සමාපත්තිවලින් නැගී සිටීමේ කුසලතාවයද යන මේ දෙකයි. මහණෙනි, මේ ධර්ම දෙක නම් මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 165,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Ajjavañca maddavañca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monastics, there are these two qualities. Which two? Uprightness and gentleness. Indeed, monastics, these are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධ​ර්ම දෙකක් වෙත්.\nඒ කවර දෙකක්ද?\nඅජ්ජවයද, මද්දවයද යන මේ දෙකය.\nමහණෙනි, ඇත්තෙන්ම මේ ධ​ර්ම දෙක මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 166,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Khanti ca soraccañca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monastics, there are these two qualities. Which two? Forbearance and gentleness. These, monastics, are indeed the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්ම කරුණු දෙකක් ඇත. ඒවා කවර දෙකක්ද? ක්ෂාන්තිය සහ සොරාච්‍යයයි. මහණෙනි, ඇත්තෙන්ම මේ ධර්ම කරුණු දෙක මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 167,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Sākhalyañca paṭisanthāro ca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two? Congenial friendliness and welcoming hospitality. These indeed, monks, are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්මයෝ දෙකකි. ඒ කවර දෙකක්ද? සාඛල්‍යයද, ප්‍රතිසන්ථාරයද යනුයි. මහණෙනි, මේ ධර්මයෝ දෙක මේවාමය.",
      "paliTitle": ""
    },
    {
      "number": 168,
      "pali": "‘Dveme, bhikkhave, dhammā. Katame dve? Avihiṃsā ca soceyyañca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, these are two qualities. What are these two? Non-harming and purity. These, Monks, are indeed the two qualities.",
      "sinhala": "මහණෙනි, මේ දහම් දෙකකි. ඒ කවර දෙකක්ද? අවිහිංසාවත්, සෝචෙය්‍ය​යත් යනු ඒ දෙකයි. මහණෙනි, මේ දහම් කාරණා දෙක මේවායි.",
      "paliTitle": ""
    },
    {
      "number": 169,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Indriyesu aguttadvāratā ca bhojane amattaññutā ca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two? Not guarding the doors of the sense faculties, and immoderation in food. These, monks, are indeed the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර‍්ම කරුණු දෙකක් වෙති. කවරක්ද ඒ දෙක? ඉන්ද්‍රියයන්හි දොරටු නොරැකීම ද, අහරෙහි පමණ නොදැනීම ද යන මේවා යි. මහණෙනි, මේවාම යි ඒ ධර‍්ම කරුණු දෙක.",
      "paliTitle": ""
    },
    {
      "number": 170,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Indriyesu guttadvāratā ca bhojane mattaññutā ca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two? Guarding the sense doors and moderation in food. Indeed, monks, these are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්‍ම දෙකකි. කවර දෙකක්ද? ඉන්ද්‍රියයන්හි දොරටු ආරක්‍ෂා කිරීම ද, ආහාරයෙහි පමණ දැනීම ද වේ. මහණෙනි, සැබවින්ම මේ ධර්‍ම දෙක නම් මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 171,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Paṭisaṅkhānabalañca bhāvanābalañca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two? The power of wise consideration and the power of mental development. These, monks, are the two qualities.",
      "sinhala": "භික්ෂූණි, මේ ධර්ම කරුණු දෙකකි. ඒ කවර දෙකක්ද යත්? ප්‍රඥාවෙන් මනාකොට විමර්ශනය කිරීමේ බලය ද, භාවනාවෙන් දියුණු කිරීමේ බලය ද යනුයි. භික්ෂූණි, මේ ධර්ම කරුණු දෙක නම් මේවාම වේ.",
      "paliTitle": ""
    },
    {
      "number": 172,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Satibalañca samādhibalañca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two are they? The power of mindfulness and the power of concentration. These, monks, are indeed those two qualities.",
      "sinhala": "මහණෙනි, මේ ධ\\u200dර්ම දෙකකි. කවර දෙකක්ද? සති බලයද, සමාධි බලයද. මහණෙනි, මේ ධ\\u200dර්ම දෙක මේවාම ය.",
      "paliTitle": ""
    },
    {
      "number": 173,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Samatho ca vipassanā ca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monastics, there are these two qualities. Which two? Tranquility and insight. These, monastics, are indeed the two qualities.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ධර‍්ම දෙකකි. ඒ දෙක කවරේද? සමථය සහ විපස්සනාවය. භික්ෂූන් වහන්ස, මේවාමයි ඒ ධර‍්ම දෙක.",
      "paliTitle": ""
    },
    {
      "number": 174,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Sīlavipatti ca diṭṭhivipatti ca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "“Monks, there are these two phenomena. Which two? Failure in moral conduct and failure in right view. These, monks, are the two phenomena.”",
      "sinhala": "භික්ෂූණි, මේ ධර්‍ම කාරණා දෙකකි. ඒ දෙක කුමක්ද? සීල විපත්තිය සහ දිට්ඨි විපත්තිය යි. භික්ෂූණි, මේ ධර්‍ම කාරණා දෙක නම් මේවාමයි.",
      "paliTitle": ""
    },
    {
      "number": 175,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Sīlasampadā ca diṭṭhisampadā ca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, these are two qualities. Which two? The accomplishment of moral virtue and the accomplishment of right view. Indeed, monks, these are the two qualities.",
      "sinhala": "භික්ෂූනි, මේ ධර්‍ම කාරණා දෙකක් ඇත. කවර දෙකක්ද යත්? ශීල සම්පදාව සහ දිට්ඨි සම්පදාවයි. භික්ෂූනි, මේ ධර්‍ම කාරණා දෙක නම් මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 176,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Sīlavisuddhi ca diṭṭhivisuddhi ca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two? Purity of moral conduct and purity of view. These, monks, are the two qualities.",
      "sinhala": "භික්ෂූනි, මේ ධර්ම කරුණු දෙකකි. ඒ දෙක නම් කවරේද? ශීල විශුද්ධිය සහ දෘෂ්ටි විශුද්ධියයි. භික්ෂූනි, මේ ධර්ම කරුණු දෙක නම් මේවාමයි.",
      "paliTitle": ""
    },
    {
      "number": 177,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Diṭṭhivisuddhi ca yathādiṭṭhissa ca padhānaṃ. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two principles. Which two? Purification of view, and the striving of one who possesses such a view. These, monks, are the two principles.",
      "sinhala": "භික්ෂූනි, මේ ධර්ම කාරණා දෙකකි. ඒ දෙක කුමක්ද? දෘෂ්ටිවිශුද්ධිය සහ යථාදෘෂ්ටිකයාගේ ප්‍රධානය යි. භික්ෂූනි, මේ ධර්ම කාරණා දෙක නම් මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 178,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Asantuṭṭhitā ca kusalesu dhammesu, appaṭivānitā ca padhānasmiṃ. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two? Not being content with wholesome states, and unflagging persistence in exertion. Monks, these indeed are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්ම කාරණා දෙකක් වෙති. ඒ කවර දෙකක්ද යත්: කුසල් දහම්හි නොසතුටු බවද, වීර්යයෙහි අත් නොහැරීමද යන මේවාය. මහණෙනි, මේ ධර්ම කාරණා දෙක නම් මේවාමයි.",
      "paliTitle": ""
    },
    {
      "number": 179,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Muṭṭhassaccañca asampajaññañca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two? Unmindfulness and lack of clear comprehension. These, monks, are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්‍ම දෙකකි. කවරේද ඒ දෙක? සිහිමුළා බවත්, අසම්පජඤ්ඤයත් ය. මහණෙනි, මේවා ඒ ධර්‍ම දෙක යි.",
      "paliTitle": ""
    },
    {
      "number": 180,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Sati ca sampajaññañca. Ime kho, bhikkhave, dve dhammā’’ti. ",
      "english": "Monks, there are these two qualities. Which two? Mindfulness and clear comprehension. Indeed, Monks, these are the two qualities.",
      "sinhala": "භික්ෂූනි, මේ ධර්‍ම කරුණු දෙකකි. ඒ දෙක කවරේද? සතිය සහ සම්පජඤ්ඤයයි. භික්ෂූනි, මේ ධර්‍ම කරුණු දෙක එයයි.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Samāpattivaggo pañcamo.",
    "english": "",
    "sinhala": ""
  }
}