{
  "id": "an2.8",
  "title": {
    "pali": "Sanimittavaggo",
    "english": "The Chapter on Signs",
    "sinhala": "සනිමිත්ත වර්ගය"
  },
  "sections": [
    {
      "number": 78,
      "pali": "‘‘Sanimittā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no animittā. Tasseva nimittassa pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, unwholesome and evil states arise accompanied by a mental sign, not without a mental sign. By the abandoning of that very mental sign, those unwholesome and evil states thus do not come to be.",
      "sinhala": "මහණෙනි, පව්කාර අකුසල ධර්ම හටගන්නේ නිමිත්තක් අරමුණු කොටගෙන මිස, නිමිත්තක් නොමැතිව නොවේ. ඒ නිමිත්තම ප්‍රහීණ කිරීමෙන් මෙසේ ඒ පව්කාර අකුසල ධර්ම නැතිවෙයි.",
      "paliTitle": ""
    },
    {
      "number": 79,
      "pali": "‘‘Sanidānā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no anidānā. Tasseva nidānassa pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, evil, unwholesome states arise with a cause, not without a cause. Through the abandonment of that very cause, those evil, unwholesome states do not come to be.",
      "sinhala": "මහණෙනි, පාපී අකුසල ධර්‍ම නිදාන සහිතව හටගනී, නිදාන රහිතව හටගන්නේ නැත. එම නිදානයම පහකිරීමෙන් ඒ පාපී අකුසල ධර්‍ම නොපවතිත්.",
      "paliTitle": ""
    },
    {
      "number": 80,
      "pali": "‘‘Sahetukā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no ahetukā. Tasseva hetussa pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, unwholesome evil states arise with a cause, not without a cause. Through the abandoning of that very cause, those unwholesome evil states do not come into being.",
      "sinhala": "භික්ෂූණි, පවිටු අකුසල ධර්ම හටගන්නේ හේතු සහිතවයි, හේතු රහිතව නොවේ. ඒ හේතුවම ප්‍රහාණය කිරීමෙන් ඒ පවිටු අකුසල ධර්ම මෙලෙස නැතිවී යයි.",
      "paliTitle": ""
    },
    {
      "number": 81,
      "pali": "‘‘Sasaṅkhārā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no asaṅkhārā. Tesaṃyeva saṅkhārānaṃ pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, unwholesome, detrimental states arise with volitional fabrication; they do not arise spontaneously without such fabrication. Through the abandonment of those very volitional fabrications, those unwholesome, detrimental states thus cease to be.",
      "sinhala": "මහණෙනි, අකුසල පාපී ධර්මයෝ ඇතිවන්නේ පෙළඹවීම් සහිතවය, පෙළඹවීම් රහිතව නොවේ. ඒ පෙළඹවීම්ම ප්‍ර​හාණය කිරීමෙන් එලෙසින් ඒ අකුසල පාපී ධර්මයෝ නොපවතී.",
      "paliTitle": ""
    },
    {
      "number": 82,
      "pali": "‘‘Sappaccayā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no appaccayā. Tasseva paccayassa pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, unwholesome states arise dependent on conditions, not without conditions. With the abandoning of that very condition, those unwholesome states thus do not come to be.",
      "sinhala": "මහණෙනි, පව්කාර අකුසල ධර්මයන් ප්‍රත්‍යයන් සහිතව උපදිති; ප්‍රත්‍යයන් රහිතව නොවේ. ඒ ප්‍රත්‍යයම ප්‍රහාණය කිරීමෙන්, මෙසේ ඒ පව්කාර අකුසල ධර්මයන් නැතිවී යති.",
      "paliTitle": ""
    },
    {
      "number": 83,
      "pali": "‘‘Sarūpā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no arūpā. Tasseva rūpassa pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, unwholesome, evil states arise with a basis, not without a basis. Through the abandonment of that very basis, those unwholesome, evil states do not come into being.",
      "sinhala": "මහණෙනි, පාපී අකුසල ධර්ම උපදින්නේ යම්කිසි ස්වරූපයක් (හේතුවක් හෝ පදනමක්) සහිතවය; අරූපව (හේතුවක් හෝ පදනමක් රහිතව) නොවේ. ඒ ස්වරූපයම (හේතුව හෝ පදනම) ප්‍රහාණය කිරීමෙන්, මෙසේ ඒ පාපී අකුසල ධර්ම ඇති නොවන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 84,
      "pali": "‘‘Savedanā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no avedanā. Tassāyeva vedanāya pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, it is with feeling that evil, unwholesome states arise, not without feeling. With the abandoning of that very feeling, those evil, unwholesome states thus do not come to be.",
      "sinhala": "භික්ෂූන් වහන්ස, පාපී අකුසල ධර්මයන් හටගන්නේ වේදනාව සහිතව මිස වේදනාව රහිතව නොවේ. ඒ වේදනාව ප්‍රහාණය කිරීමෙන් ඒ පාපී අකුසල ධර්මයන් මෙසේ නැතිවී යයි.",
      "paliTitle": ""
    },
    {
      "number": 85,
      "pali": "‘‘Sasaññā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no asaññā. Tassāyeva saññāya pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, unwholesome, detrimental states arise with perception, not without perception. By the abandoning of that very perception, those unwholesome, detrimental states thus do not come to be.",
      "sinhala": "භික්ෂූනි, සසඤ්ඤා සහිතවම පව්කාර අකුසල ධර්ම උපදිති, සඤ්ඤා රහිතව නොවේ. ඒ සඤ්ඤාවම ප්‍ර‌හාණය කිරීමෙන් මෙසේ ඒ පව්කාර අකුසල ධර්ම නැති වේ.",
      "paliTitle": ""
    },
    {
      "number": 86,
      "pali": "‘‘Saviññāṇā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no aviññāṇā. Tasseva viññāṇassa pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti.",
      "english": "Monks, evil, unwholesome states arise accompanied by consciousness, not without consciousness. By the abandoning of that very consciousness, those evil, unwholesome states do not come into being.",
      "sinhala": "මහණෙනි, පාපී අකුසල ධර්මයෝ විඤ්ඤාණය සහිතවම හටගනිති, විඤ්ඤාණය රහිතව නොවේ. ඒ විඤ්ඤාණයේම ප්‍ර‍හාණයෙන් මෙසේ ඒ පාපී අකුසල ධර්මයෝ ඇති නොවෙත්.",
      "paliTitle": ""
    },
    {
      "number": 87,
      "pali": "‘‘Saṅkhatārammaṇā, bhikkhave, uppajjanti pāpakā akusalā dhammā, no asaṅkhatārammaṇā. Tasseva saṅkhatassa pahānā evaṃ te pāpakā akusalā dhammā na hontī’’ti. ",
      "english": "Monks, unwholesome states arise with conditioned phenomena as their object, not with unconditioned phenomena as their object. Through the abandoning of that very conditioned, those unwholesome states thus cease to be.",
      "sinhala": "මහණෙනි, පව් වූ අකුසල ධර්ම‍යෝ සංඛත අරමුණු ඇසුරු කරගෙන හටගනිති; අසංඛත අරමුණු ඇසුරු කරගෙන නම් නොවේ. ඒ සංඛත ධර්මය පහකිරීමෙන් මෙසේ ඒ පව් වූ අකුසල ධර්ම‍යෝ නැතිවෙති.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Sanimittavaggo tatiyo.",
    "english": "The Third Chapter on Signs",
    "sinhala": "තෙවැනි සනිමිත්ත වර්ගය"
  }
}