{
  "id": "an2.14",
  "title": {
    "pali": "Santhāravaggo",
    "english": "The Chapter on Familiarity",
    "sinhala": "සන්ථාර වග්ගය"
  },
  "sections": [
    {
      "number": 152,
      "pali": "‘‘Dveme, bhikkhave, santhārā [sandhārā (ka.)]. Katame dve? Āmisasanthāro ca dhammasanthāro ca. Ime kho, bhikkhave, dve santhārā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ santhārānaṃ yadidaṃ dhammasanthāro’’ti.",
      "english": "These two, monks, are kinds of dealings. Which two? Dealings with material things and dealings with the Dhamma. These, monks, are the two kinds of dealings. Of these two kinds of dealings, monks, dealings with the Dhamma is the foremost.",
      "sinhala": "මහණෙනි, මේ ඇසුරුකිරීම් දෙකක් වෙති. ඒ දෙක කවරේද? ආමිස ඇසුරුකිරීම ද ධර්ම ඇසුරුකිරීම ද යන මේ දෙකයි. මහණෙනි, මේ ඇසුරුකිරීම් දෙකක් වෙති. මහණෙනි, මේ ඇසුරුකිරීම් දෙකින්, යම් මේ ධර්ම ඇසුරුකිරීමක් වේද, එය අග්‍ර වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 153,
      "pali": "‘‘Dveme, bhikkhave, paṭisanthārā [paṭisandhārā (ka.)]. Katame dve? Āmisapaṭisanthāro ca dhammapaṭisanthāro ca. Ime kho, bhikkhave, dve paṭisanthārā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ paṭisanthārānaṃ yadidaṃ dhammapaṭisanthāro’’ti.",
      "english": "Monks, there are these two kinds of welcome. Which two? Welcome with material things and welcome with the Dhamma. These, monks, are the two kinds of welcome. Of these two kinds of welcome, monks, welcome with the Dhamma is the foremost.",
      "sinhala": "මහණෙනි, මේ ප​්‍රතිසන්ථාර දෙකකි.\nඒ කවර දෙකක්ද?\nආමිස ප​්‍රතිසන්ථාරය සහ ධර‍්ම ප​්‍රතිසන්ථාරය යි.\nමහණෙනි, මේ ප​්‍රතිසන්ථාර දෙක මේවා යි.\nමහණෙනි, මේ ප​්‍රතිසන්ථාර දෙකින් ධර‍්ම ප​්‍රතිසන්ථාරය අග‍්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 154,
      "pali": "‘‘Dvemā, bhikkhave, esanā. Katamā dve? Āmisesanā ca dhammesanā ca. Imā kho, bhikkhave, dve esanā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ esanānaṃ yadidaṃ dhammesanā’’ti.",
      "english": "Monks, there are these two quests. Which two? The quest for worldly gain and the quest for Dhamma. Indeed, monks, these are the two quests. Among these two quests, monks, the quest for Dhamma is the foremost.",
      "sinhala": "මහණෙනි, මේ ඇසීම් දෙකකි. ඒ දෙක කවරේද? ආමිස ඇසීමත්, ධර‍්ම ඇසීමත් ය. මහණෙනි, මේ ඇසීම් දෙක නම් මේවාම වෙති. මහණෙනි, මේ ඇසීම් දෙකෙන් ධර‍්ම ඇසීම අග්‍රම වේ.",
      "paliTitle": ""
    },
    {
      "number": 155,
      "pali": "‘‘Dvemā, bhikkhave, pariyesanā. Katamā dve? Āmisapariyesanā ca dhammapariyesanā ca. Imā kho, bhikkhave, dve pariyesanā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ pariyesanānaṃ yadidaṃ dhammapariyesanā’’ti.",
      "english": "Monks, there are these two kinds of quests. Which two? The quest for worldly gain and the quest for the Dhamma. Indeed, monks, these are the two quests. Among these two quests, monks, the quest for the Dhamma is supreme.",
      "sinhala": "භික්ෂූණි, මේ පරියේසනා දෙකකි. ඒ දෙක කවරේද යත්? ආමිස පරියේසනාව සහ ධම්ම පරියේසනාවයි. භික්ෂූණි, සැබැවින්ම මේ පරියේසනා දෙක වෙති. භික්ෂූණි, මේ පරියේසනා දෙක අතුරින් ධම්ම පරියේසනාව අග්‍ර වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 156,
      "pali": "‘‘Dvemā, bhikkhave, pariyeṭṭhiyo. Katamā dve? Āmisapariyeṭṭhi ca dhammapariyeṭṭhi ca. Imā kho, bhikkhave, dve pariyeṭṭhiyo. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ pariyeṭṭhīnaṃ yadidaṃ dhammapariyeṭṭhī’’ti.",
      "english": "Monks, there are these two kinds of quests. Which two? The quest for worldly things and the quest for the Dhamma. Indeed, monks, these are the two kinds of quests. Among these two kinds of quests, monks, the quest for the Dhamma is considered the foremost.",
      "sinhala": "මහණෙනි, මේ පර්යේෂණ දෙවර්ගයකි. ඒ දෙක කවරේද? ආමිස පර්යේෂණය සහ ධර්ම පර්යේෂණයයි. මහණෙනි, මේ පර්යේෂණ දෙක නම් මේවාය. මහණෙනි, මේ පර්යේෂණ දෙක අතුරින් ධර්ම පර්යේෂණය අග්‍ර වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 157,
      "pali": "‘‘Dvemā, bhikkhave, pūjā. Katamā dve? Āmisapūjā ca dhammapūjā ca. Imā kho bhikkhave, dve pūjā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ pūjānaṃ yadidaṃ dhammapūjā’’ti.",
      "english": "Monks, these are two kinds of homage. Which two? Material homage and Dhamma homage. Indeed, monks, these are the two kinds of homage. Of these two kinds of homage, monks, Dhamma homage is the foremost.",
      "sinhala": "භික්ෂූනි, මේ පූජාවන් දෙකකි. ඒ කවර දෙකක්ද? ආමිස පූජාව සහ ධර්ම පූජාව යනු යි. භික්ෂූනි, මේවා පූජා දෙකක්ම වන්නේ ය. භික්ෂූනි, මේ පූජාවන් දෙක අතුරින් ධර්ම පූජාව අග්‍ර​වන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 158,
      "pali": "‘‘Dvemāni, bhikkhave, ātitheyyāni. Katamāni dve? Āmisātitheyyañca dhammātitheyyañca. Imāni kho, bhikkhave, dve ātitheyyāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ ātitheyyānaṃ yadidaṃ dhammātitheyya’’nti.",
      "english": "Monks, there are these two kinds of hospitality. Which two? Material hospitality and Dhamma hospitality. These, monks, are the two kinds of hospitality. Among these two kinds of hospitality, monks, Dhamma hospitality is the foremost.",
      "sinhala": "මහණෙනි, මේ සත්කාර දෙකකි. ඒ දෙක කවරේද යත්? ආමිස සත්කාරය සහ ධර්‍ම සත්කාරය යනුයි. මහණෙනි, මේ සත්කාර දෙක නම් මේවාය. මහණෙනි, මේ සත්කාර දෙකින් ධර්‍ම සත්කාරයම අග්‍ර වේ.",
      "paliTitle": ""
    },
    {
      "number": 159,
      "pali": "‘‘Dvemā, bhikkhave, iddhiyo. Katamā dve? Āmisiddhi ca dhammiddhi ca. Imā kho, bhikkhave, dve iddhiyo. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ iddhīnaṃ yadidaṃ dhammiddhī’’ti.",
      "english": "Monks, there are these two spiritual powers. Which two? The power of material gain and the power of the Dhamma. Indeed, monks, these are the two spiritual powers. Among these two spiritual powers, monks, the power of the Dhamma is the foremost.",
      "sinhala": "මහණෙනි, මේ ඍද්ධි දෙකකි. කවර දෙකක්ද? ආමිස ඍද්ධිය සහ ධම්ම ඍද්ධිය යන දෙකයි. මහණෙනි, ඇත්තෙන්ම මේ ඍද්ධි දෙක මේවාය. මහණෙනි, මේ ඍද්ධි දෙකින් ධම්ම ඍද්ධිය අග්‍ර‍‌ වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 160,
      "pali": "‘‘Dvemā, bhikkhave, vuddhiyo. Katamā dve? Āmisavuddhi ca dhammavuddhi ca. Imā kho, bhikkhave, dve vuddhiyo. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ vuddhīnaṃ yadidaṃ dhammavuddhī’’ti.",
      "english": "Monks, there are these two kinds of growth. Which two? Growth in material things and growth in Dhamma. Indeed, monks, these are the two kinds of growth. Among these two kinds of growth, monks, the growth in Dhamma is the foremost.",
      "sinhala": "මහණෙනි, මේ දියුණුවෝ දෙදෙනෙක් වෙති. ඒ කවර දෙදෙනෙක් ද? ආමිස දියුණුව හා ධර්‍ම දියුණුව යි. මහණෙනි, මේ දියුණුවෝ දෙදෙනා වනාහි මෙයෝ ය. මහණෙනි, මේ දියුණුවෝ දෙදෙනා අතුරින් ධර්‍ම දියුණුව අග්‍ර වන්නේ ය.",
      "paliTitle": ""
    },
    {
      "number": 161,
      "pali": "‘‘Dvemāni, bhikkhave, ratanāni. Katamāni dve? Āmisaratanañca dhammaratanañca. Imāni kho, bhikkhave, dve ratanāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ ratanānaṃ yadidaṃ dhammaratana’’nti.",
      "english": "Monks, there are these two kinds of treasures. Which two? The treasure of worldly things and the treasure of the Dhamma. Indeed, Monks, these are the two treasures. Among these two treasures, Monks, the treasure of the Dhamma is supreme.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ රත්න දෙකක් ඇත. ඒ දෙක කවරේද? ආමිස රත්නය සහ ධර‍්ම රත්නය යනුයි. භික්ෂූන් වහන්ස, මේවා මේ රත්න දෙකම වේ. භික්ෂූන් වහන්ස, මේ රත්න දෙක අතුරින් ධර‍්ම රත්නය යනු අග්‍රතම දෙයයි.",
      "paliTitle": ""
    },
    {
      "number": 162,
      "pali": "‘‘Dveme, bhikkhave, sannicayā. Katame dve? Āmisasannicayo ca dhammasannicayo ca. Ime kho, bhikkhave, dve sannicayā. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ sannicayānaṃ yadidaṃ dhammasannicayo’’ti.",
      "english": "Monastics, there are these two kinds of accumulation. Which two? The accumulation of material things and the accumulation of Dhamma. Indeed, monastics, these are the two kinds of accumulation. Among these two accumulations, monastics, the accumulation of Dhamma is the foremost.",
      "sinhala": "මහණෙනි, මේ සංචයෝ දෙකකි. ඒ දෙක කවරේද? ආමිස සංචයෝ ද, ධ‌ර්ම සංචයෝ ද යන දෙකයි. මහණෙනි, මේ සංචයෝ දෙක නම් මේවාමයි. මහණෙනි, මේ සංචයෝ දෙකෙන් ධ‌ර්ම සංචයෝ ම අ‌ග්‍ර ය.",
      "paliTitle": ""
    },
    {
      "number": 163,
      "pali": "‘‘Dvemāni, bhikkhave, vepullāni. Katamāni dve? Āmisavepullañca dhammavepullañca. Imāni kho, bhikkhave, dve vepullāni. Etadaggaṃ, bhikkhave, imesaṃ dvinnaṃ vepullānaṃ yadidaṃ dhammavepulla’’nti. ",
      "english": "Monks, there are these two kinds of abundance. Which two? The abundance of material things and the abundance of Dhamma. Indeed, Monks, these are the two kinds of abundance. Among these two kinds of abundance, Monks, the foremost is the abundance of Dhamma.",
      "sinhala": "මහණෙනි, විපුලත්වයන් දෙකක් ඇත. කවර දෙකක්ද යත්: ආමිස විපුලත්වය සහ ධ​ර්‍ම විපුලත්වයයි. මහණෙනි, සැබැවින්ම මේ විපුලත්වයන් දෙක නම් මේවායි. මහණෙනි, මේ විපුලත්වයන් දෙක අතුරින් ධ​ර්‍ම විපුලත්වයම අග්‍ර වේ.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Santhāravaggo catuttho.",
    "english": "",
    "sinhala": ""
  }
}