{
  "id": "an2.11",
  "title": {
    "pali": "Āsāduppajahavaggo",
    "english": "The Chapter on Desires Difficult to Abandon",
    "sinhala": "අත්හැරීමට අපහසු ආශා වග්ගය"
  },
  "sections": [
    {
      "number": 3,
      "pali": "Tatiyapaṇṇāsakaṃ",
      "english": "The Third Fifty Discourses",
      "sinhala": "තෙවැනි පණස්වර්ගය.",
      "paliTitle": ""
    },
    {
      "number": 119,
      "pali": "‘‘Dvemā, bhikkhave, āsā duppajahā. Katamā dve? Lābhāsā ca jīvitāsā ca. Imā kho, bhikkhave, dve āsā duppajahā’’ti.",
      "english": "Monks, these two desires are difficult to relinquish. Which two? The desire for gain and the desire for continued existence. Indeed, monks, these two desires are difficult to relinquish.",
      "sinhala": "මහණෙනි, මෙම අාශාවන් දෙක අත්හැරීමට දුෂ්කර ය. ඒ කවර දෙකක් ද? ලාභය පිළිබඳ අාශාව සහ ජීවිතය පිළිබඳ අාශාව යි. මහණෙනි, ඇත්තෙන් ම, මේ අාශාවන් දෙක අත්හැරීමට දුෂ්කර ය.",
      "paliTitle": ""
    },
    {
      "number": 120,
      "pali": "‘‘Dveme, bhikkhave, puggalā dullabhā lokasmiṃ. Katame dve? Yo ca pubbakārī, yo ca kataññū katavedī. Ime kho, bhikkhave, dve puggalā dullabhā lokasmi’’nti.",
      "english": "Monks, these two kinds of individuals are rare in the world. Which two? He who performs a kindness first, and he who is grateful and repays that kindness. Indeed, monks, these two kinds of individuals are rare in the world.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ පුද්ගලයන් දෙදෙනෙකු ලෝකයෙහි දුර්ලභයහ. කවර දෙදෙනෙක්ද? යම් කෙනෙක් පෙර උපකාර කළේ වේද, යම් කෙනෙක් කළගුණ දන්නේද, කළගුණ සලකන්නේද යන ඒ දෙදෙනාය. ඉදින්, භික්ෂූන් වහන්ස, මේ පුද්ගලයන් දෙදෙනා ලෝකයෙහි දුර්ලභයහ.",
      "paliTitle": ""
    },
    {
      "number": 121,
      "pali": "‘‘Dveme, bhikkhave, puggalā dullabhā lokasmiṃ. Katame dve? Titto ca tappetā ca. Ime kho, bhikkhave, dve puggalā dullabhā lokasmi’’nti.",
      "english": "Monks, these two kinds of individuals are difficult to find in the world. Which two? The one who is content and fulfilled, and the one who brings contentment and fulfillment to others. Indeed, monks, these two kinds of individuals are difficult to find in the world.",
      "sinhala": "භික්ෂූණි, මේ පුද්ගලයන් දෙදෙනා ලෝකයෙහි දුර්ලභය. කවර දෙදෙනෙක්ද? තමා තෘප්ත කරගත් තැනැත්තාද, අනුන් තෘප්තිමත් කරන්නාද. භික්ෂූණි, සැබවින්ම මේ පුද්ගලයන් දෙදෙනා ලෝකයෙහි දුර්ලභය.",
      "paliTitle": ""
    },
    {
      "number": 122,
      "pali": "‘‘Dveme, bhikkhave, puggalā duttappayā. Katame dve? Yo ca laddhaṃ laddhaṃ nikkhipati, yo ca laddhaṃ laddhaṃ vissajjeti. Ime kho, bhikkhave, dve puggalā duttappayā’’ti.",
      "english": "These two individuals, monks, are difficult to satisfy. Which two? He who accumulates whatever he has gained, and he who squanders whatever he has gained. These two individuals, monks, are difficult to satisfy.",
      "sinhala": "භික්ෂූණි, මේ පුද්ගලයෝ දෙදෙනෙක් සතුටු කරවීම අපහසු වෙති. ඒ දෙදෙනා කවරහුද? ලද ලද දේ තැන්පත් කරන්නා ද, ලද ලද දේ විසුරුවා හරින්නා ද යන දෙදෙනාය. භික්ෂූණි, මෙසේ මේ පුද්ගලයෝ දෙදෙනෙක් සතුටු කරවීම අපහසු වෙති.",
      "paliTitle": ""
    },
    {
      "number": 123,
      "pali": "‘‘Dveme, bhikkhave, puggalā sutappayā. Katame dve? Yo ca laddhaṃ laddhaṃ na nikkhipati, yo ca laddhaṃ laddhaṃ na vissajjeti. Ime kho, bhikkhave, dve puggalā sutappayā’’ti.",
      "english": "Monks, these two persons are easily satisfied. Which two? One who does not store up whatever they receive, and one who does not give away whatever they receive. Monks, these two persons are indeed easily satisfied.",
      "sinhala": "භික්ෂූණි, මේ පුද්ගලයෝ දෙදෙනෙක් පහසුවෙන් සතුටු විය හැක්කෝ වෙති. ඒ කවර දෙදෙනෙක් ද? යම් කෙනෙක් ලැබූ ලැබූ දෙය ගබඩා කර නොතබන්නේ ද, යම් කෙනෙක් ලැබූ ලැබූ දෙය ඉවත නොලන්නේ ද. භික්ෂූණි, සැබවින් ම මේ පුද්ගලයෝ දෙදෙනෙක් පහසුවෙන් සතුටු විය හැක්කෝ වෙති.",
      "paliTitle": ""
    },
    {
      "number": 124,
      "pali": "‘‘Dveme, bhikkhave, paccayā rāgassa uppādāya. Katame dve? Subhanimittañca ayoniso ca manasikāro. Ime kho, bhikkhave, dve paccayā rāgassa uppādāyā’’ti.",
      "english": "Monastics, there are these two conditions for the arising of passion. Which two? The perception of the beautiful and unwise attention. Indeed, monastics, these are the two conditions for the arising of passion.",
      "sinhala": "මහණෙනි, රාගය ඇතිවීම පිණිස ප්‍රත්‍යයන් දෙකක් වෙත්. ඒ දෙක කවරේද? සුභ නිමිත්ත සහ අයෝනිසෝ මනසිකාරයයි. මහණෙනි, රාගය ඇතිවීම පිණිස මේ ප්‍රත්‍යයන් දෙකම වේ.",
      "paliTitle": ""
    },
    {
      "number": 125,
      "pali": "‘‘Dveme, bhikkhave, paccayā dosassa uppādāya. Katame dve? Paṭighanimittañca ayoniso ca manasikāro. Ime kho, bhikkhave, dve paccayā dosassa uppādāyā’’ti.",
      "english": "Monks, there are these two conditions for the arising of aversion. Which two? The object of repulsion and unwise attention. Monks, these are indeed the two conditions for the arising of aversion.",
      "sinhala": "මහණෙනි, ද්වේෂය ඇතිවීමට මේ ප්‍රත්‍යයන් දෙකක් වෙති. ඒ දෙක කවරේද? පටිඝ නිමිත්තත්, අයෝනිසෝ මනසිකාරයත් ය. මහණෙනි, ද්වේෂය ඇතිවීමට මේ ප්‍රත්‍යයන් දෙකම වෙති.",
      "paliTitle": ""
    },
    {
      "number": 126,
      "pali": "‘‘Dveme, bhikkhave, paccayā micchādiṭṭhiyā uppādāya. Katame dve? Parato ca ghoso ayoniso ca manasikāro. Ime kho, bhikkhave, dve paccayā micchādiṭṭhiyā uppādāyā’’ti.",
      "english": "Monks, these two are the conditions for the arising of wrong view. Which two? External influence and unwise attention. Indeed, Monks, these two are the conditions for the arising of wrong view.",
      "sinhala": "භික්‍ෂූනි, මිථ්‍ය‍ාදෘෂ්ටිය ඇතිවීමට හේතු දෙකක් වෙයි. කවර දෙකක්ද?\n\nඅනුන්ගෙන් ලබන ආභාසය ද, අයෝනිසෝ මනසිකාරය ද.\n\nභික්‍ෂූනි, මිථ්‍ය‍ාදෘෂ්ටිය ඇතිවීමට මේ හේතු දෙක ම වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 127,
      "pali": "‘‘Dveme, bhikkhave, paccayā sammādiṭṭhiyā uppādāya. Katame dve? Parato ca ghoso, yoniso ca manasikāro. Ime kho, bhikkhave, dve paccayā sammādiṭṭhiyā uppādāyā’’ti.",
      "english": "Monks, there are these two conditions for the arising of right view. Which two? Communication from another, and wise attention. Indeed, monks, these two are conditions for the arising of right view.",
      "sinhala": "භික්ෂූණි, සම්මාදිට්ඨිය හටගැනීම සඳහා මේ ප්‍රත්‍යයන් දෙකක් ඇත. ඒ දෙක කවරේද? පරතෝ ඝෝසය සහ යෝනිසෝ මනසිකාරය යි. භික්ෂූණි, සම්මාදිට්ඨිය හටගැනීම සඳහා මේ ප්‍රත්‍යයන් දෙකම හේතු වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 128,
      "pali": "‘‘Dvemā, bhikkhave, āpattiyo. Katamā dve? Lahukā ca āpatti, garukā ca āpatti. Imā kho, bhikkhave, dve āpattiyo’’ti.",
      "english": "Monks, there are these two types of offences. Which two? Light offences and heavy offences. These, monks, are the two types of offences.",
      "sinhala": "මහණෙනි, මේ ඇවැත් දෙකකි. කවරේද ඒ දෙක? ලාහුක ඇවැතක් ද, ගුරුක ඇවැතක් ද යන මේ දෙක යි. මහණෙනි, මේ ඇවැත් දෙක වේ.",
      "paliTitle": ""
    },
    {
      "number": 129,
      "pali": "‘‘Dvemā, bhikkhave, āpattiyo. Katamā dve? Duṭṭhullā ca āpatti, aduṭṭhullā ca āpatti. Imā kho, bhikkhave, dve āpattiyo’’ti.",
      "english": "Monks, there are these two kinds of offenses. Which two? A grave offense and a non-grave offense. Indeed, monks, these are the two offenses.",
      "sinhala": "මහණෙනි, මේ ආපත්ති දෙකකි. කවරේද ඒ දෙක? දුටුලු ආපත්තිය සහ අදුටුලු ආපත්තියයි. මහණෙනි, මේ ආපත්ති දෙක නම් මේවාය.",
      "paliTitle": ""
    },
    {
      "number": 130,
      "pali": "‘‘Dvemā, bhikkhave, āpattiyo. Katamā dve? Sāvasesā ca āpatti, anavasesā ca āpatti. Imā kho, bhikkhave, dve āpattiyo’’ti. ",
      "english": "There are two kinds of offenses, monastics. Which two? Offenses that allow for restoration, and offenses that are definitive, leaving no possibility of restoration. These, monastics, are the two kinds of offenses.",
      "sinhala": "භික්ෂූණි, මේ ආපත්ති දෙකක් තිබේ. ඒ කවර දෙකක්ද? සාවශේෂ ආපත්තියද, අනවශේෂ ආපත්තියද යන දෙකයි. භික්ෂූණි, මේ ආපත්ති දෙකක් වන්නේ ය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Āsāduppajahavaggo paṭhamo.",
    "english": "First Chapter on Hopes Difficult to Abandon",
    "sinhala": "පළමුවන ආශා දුෂ්ප්‍රහා වග්ගය"
  }
}