{
  "id": "an2.12",
  "title": {
    "pali": "Āyācanavaggo",
    "english": "The Chapter on Requests",
    "sinhala": "ආයාචනා වග්ගය"
  },
  "sections": [
    {
      "number": 131,
      "pali": "‘‘Saddho, bhikkhave, bhikkhu evaṃ sammā āyācamāno āyāceyya – ‘tādiso homi yādisā sāriputtamoggallānā’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvakānaṃ bhikkhūnaṃ yadidaṃ sāriputtamoggallānā’’ti.",
      "english": "Monks, a faithful monk, when aspiring rightly in this way, should make this aspiration: ‘May I become like Sāriputta and Moggallāna.’ This, monks, is the scale, this is the standard for my monk-disciples—namely, Sāriputta and Moggallāna.",
      "sinhala": "මහණෙනි, ශ්‍රද්ධාවෙන් යුක්ත වූ භික්ෂුවක් මෙසේ මනාකොට ප්‍රාර්ථනා කරන්නේ නම්, ‘සැරියුත් මහා මොග්ගල්ලාන දෙනම යම්බඳු ගුණාංගවලින් යුක්ත නම්, මම ද එබඳු කෙනෙක් වෙම්වා!’ යි ප්‍රාර්ථනා කළ යුතුය. මහණෙනි, මාගේ ශ්‍රාවක භික්ෂූන් සඳහා වූ ඒ කිරුම, ඒ ප්‍රමාණය නම් සැරියුත් මහා මොග්ගල්ලාන දෙනමයි.",
      "paliTitle": ""
    },
    {
      "number": 132,
      "pali": "‘‘Saddhā, bhikkhave, bhikkhunī evaṃ sammā āyācamānā āyāceyya – ‘tādisī homi yādisī khemā ca bhikkhunī uppalavaṇṇā cā’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvikānaṃ bhikkhunīnaṃ yadidaṃ khemā ca bhikkhunī uppalavaṇṇā cā’’ti.",
      "english": "“Monks, a faithful nun, thus rightly aspiring, should aspire: ‘May I be like the nun Khemā and the nun Uppalavaṇṇā.’ This, monks, is the standard, this is the measure for my female disciples, the nuns, namely, the nun Khemā and the nun Uppalavaṇṇā.”",
      "sinhala": "භික්ෂූනි, ශ්‍රද්ධාවන්ත භික්ෂුණියක් මෙසේ නිවැරදිව ප්‍රාර්ථනා කරන්නේ නම්, ‘ඛේමා භික්ෂුණිය සහ උපලවණ්ණා භික්ෂුණිය වැනිම කෙනෙක් මම වෙම්වා’ යනුවෙන් ප්‍රාර්ථනා කළ යුතුයි. භික්ෂූනි, මාගේ ශ්‍රාවිකා භික්ෂුණීන් වහන්සේලා සඳහා මේයයි තුලාව. මේයයි ප්‍රමාණය. එනම් ඛේමා භික්ෂුණිය සහ උපලවණ්ණා භික්ෂුණියයි.",
      "paliTitle": ""
    },
    {
      "number": 133,
      "pali": "‘‘Saddho, bhikkhave, upāsako evaṃ sammā āyācamāno āyāceyya – ‘tādiso homi yādiso citto ca gahapati hatthako ca āḷavako’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvakānaṃ upāsakānaṃ yadidaṃ citto ca gahapati hatthako ca āḷavako’’ti.",
      "english": "Monks, a faithful lay follower, when making a proper aspiration, should aspire thus: ‘May I be like Citta the householder and Hatthaka of Alavi.’ Monks, this is the standard, this is the measure, for my lay disciples, namely Citta the householder and Hatthaka of Alavi.",
      "sinhala": "මහණෙනි, ශ්‍රද්ධාවන්ත උපාසකයා මෙසේ නිවැරදිව ප්‍රාර්ථනා කරමින්, ‘චිත්ත ගෘහපති සහ ආළවක හත්ථක වැනි කෙනෙක් මම වෙම්වා’යි ප්‍රාර්ථනා කළ යුතුය. මහණෙනි, මාගේ ශ්‍රාවක උපාසකවරුන් අතර, එනම් චිත්ත ගෘහපති සහ ආළවක හත්ථක යනු මේ තුලාවයි, මේ මිනුමයි.",
      "paliTitle": ""
    },
    {
      "number": 134,
      "pali": "‘‘Saddhā, bhikkhave, upāsikā evaṃ sammā āyācamānā āyāceyya – ‘tādisī homi yādisī khujjuttarā ca upāsikā veḷukaṇḍakiyā [veḷukaṇḍakī (a. ni. 6.37; a. ni. 4.176 āgataṃ] ca nandamātā’ti. Esā, bhikkhave, tulā etaṃ pamāṇaṃ mama sāvikānaṃ upāsikānaṃ yadidaṃ khujjuttarā ca upāsikā veḷukaṇḍakiyā ca nandamātā’’ti.",
      "english": "Monks, a faithful lay follower, when making a proper aspiration, should aspire thus: ‘May I become like the lay follower Khujjuttarā, and like Nandamātā of Veḷukaṇḍakī.’\n\nThis, monks, is the standard, this is the measure for my female lay disciples, namely, the lay follower Khujjuttarā and Nandamātā of Veḷukaṇḍakī.",
      "sinhala": "භික්ෂූනි, ශ්‍රද්ධාවන්ත උපාසිකාවක් මෙසේ නිවැරදිව ප්‍රාර්ථනා කරන්නේ නම්, ‘ඛුජ්ජුත්තරා උපාසිකාව හා වේළුකණ්ඨකී නන්දමාතා උපාසිකාව වැනි වෙම්වා!’ යි ප්‍රාර්ථනා කළ යුතුය. භික්ෂූනි, ඛුජ්ජුත්තරා උපාසිකාව ද, වේළුකණ්ඨකී නන්දමාතා උපාසිකාව ද යන මේ දෙදෙනා මාගේ ශ්‍රාවිකා උපාසිකාවන් අතර වූ තරාදියයි, මේ ප්‍රමාණයයි.",
      "paliTitle": ""
    },
    {
      "number": 135,
      "pali": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi dvīhi? Ananuvicca apariyogāhetvā avaṇṇārahassa vaṇṇaṃ bhāsati, ananuvicca apariyogāhetvā vaṇṇārahassa avaṇṇaṃ bhāsati. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavatīti. ‘‘Dvīhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi dvīhi? Anuvicca pariyogāhetvā avaṇṇārahassa avaṇṇaṃ bhāsati, anuvicca pariyogāhetvā vaṇṇārahassa vaṇṇaṃ bhāsati. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavatī’’ti.",
      "english": "Monks, a foolish, unskilled, ignoble person, endowed with two qualities, lives harming and destroying himself, is censurable and blameworthy by the discerning, and generates much demerit. Which two? Without having investigated or thoroughly examined, he speaks praise of one who deserves dispraise; and without having investigated or thoroughly examined, he speaks dispraise of one who deserves praise. Monks, it is by these two qualities that a foolish, unskilled, ignoble person lives harming and destroying himself, is censurable and blameworthy by the discerning, and generates much demerit.\n\nMonks, a wise, skilled, noble person, endowed with two qualities, lives without harming or destroying himself, is uncensurable and blameless by the discerning, and generates much merit. Which two? Having investigated and thoroughly examined, he speaks dispraise of one who deserves dispraise; and having investigated and thoroughly examined, he speaks praise of one who deserves praise. Monks, it is by these two qualities that a wise, skilled, noble person lives without harming or destroying himself, is uncensurable and blameless by the discerning, and generates much merit.",
      "sinhala": "භික්ෂූණි, ධර්ම දෙකකින් යුක්ත වූ බාල වූ, අව්‍යක්ත වූ, අසත්පුරුෂ පුද්ගලයා තමාට හානි සිදුකරගනී, විඤ්ඤූන්ගේ (ප්‍රඥාවන්තයන්ගේ) නින්දාවට හා දෝෂාරෝපණයට ලක්වූවෙක් ද වේ, බොහෝ අකුසල් ද රැස්කරගනී. ඒ ධර්ම දෙක කවරේද? විමසා නොබලා, හොඳින් පරීක්ෂා නොකොට, අවනම්බුවට සුදුසු අයෙකුට ප්‍රශංසා කිරීමත්, විමසා නොබලා, හොඳින් පරීක්ෂා නොකොට, ප්‍රශංසාවට සුදුසු අයෙකුට අවනම්බු කිරීමත් ය. භික්ෂූණි, මේ ධර්ම දෙකින් යුක්ත වූ බාල වූ, අව්‍යක්ත වූ, අසත්පුරුෂ පුද්ගලයා තමාට හානි සිදුකරගනී, විඤ්ඤූන්ගේ (ප්‍රඥාවන්තයන්ගේ) නින්දාවට හා දෝෂාරෝපණයට ලක්වූවෙක් ද වේ, බොහෝ අකුසල් ද රැස්කරගනී.\n\nභික්ෂූණි, ධර්ම දෙකකින් යුක්ත වූ පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ පුද්ගලයා තමාට හානියක් හෝ අලාභයක් නොකරගනී, විඤ්ඤූන්ගේ (ප්‍රඥාවන්තයන්ගේ) නින්දාවට හා දෝෂාරෝපණයට ලක් නො වූවෙක් ද වේ, බොහෝ කුසල් ද රැස්කරගනී. ඒ ධර්ම දෙක කවරේද? විමසා බලා, හොඳින් පරීක්ෂා කොට, අවනම්බුවට සුදුසු අයෙකුට අවනම්බු කිරීමත්, විමසා බලා, හොඳින් පරීක්ෂා කොට, ප්‍රශංසාවට සුදුසු අයෙකුට ප්‍රශංසා කිරීමත් ය. භික්ෂූණි, මේ ධර්ම දෙකින් යුක්ත වූ පණ්ඩිත වූ, ව්‍යක්ත වූ, සත්පුරුෂ පුද්ගලයා තමාට හානියක් හෝ අලාභයක් නොකරගනී, විඤ්ඤූන්ගේ (ප්‍රඥාවන්තයන්ගේ) නින්දාවට හා දෝෂාරෝපණයට ලක් නො වූවෙක් ද වේ, බොහෝ කුසල් ද රැස්කරගනී.",
      "paliTitle": ""
    },
    {
      "number": 136,
      "pali": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamehi dvīhi? Ananuvicca apariyogāhetvā appasādanīye ṭhāne pasādaṃ upadaṃseti, ananuvicca apariyogāhetvā pasādanīye ṭhāne appasādaṃ upadaṃseti. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavatīti. ‘‘Dvīhi, bhikkhave, dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Katamehi dvīhi? Anuvicca pariyogāhetvā appasādanīye ṭhāne appasādaṃ upadaṃseti, anuvicca pariyogāhetvā pasādanīye ṭhāne pasādaṃ upadaṃseti. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavatī’’ti.",
      "english": "Monks, endowed with two qualities, the foolish, undeveloped, ignoble person conducts himself in a way that harms and damages himself. He is blameworthy and reproachable by the discerning, and generates much demerit. Which two qualities? Without having investigated and examined thoroughly, he displays confidence in what is not worthy of confidence; and without having investigated and examined thoroughly, he displays lack of confidence in what is worthy of confidence. Indeed, monks, endowed with these two qualities, the foolish, undeveloped, ignoble person conducts himself in a way that harms and damages himself. He is blameworthy and reproachable by the discerning, and generates much demerit.\n\nMonks, endowed with two qualities, the wise, developed, noble person conducts himself in a way that is unharmed and undamaged. He is blameless and irreproachable by the discerning, and generates much merit. Which two qualities? Having investigated and examined thoroughly, he displays lack of confidence in what is not worthy of confidence; and having investigated and examined thoroughly, he displays confidence in what is worthy of confidence. Indeed, monks, endowed with these two qualities, the wise, developed, noble person conducts himself in a way that is unharmed and undamaged. He is blameless and irreproachable by the discerning, and generates much merit.",
      "sinhala": "භික්‍ෂූණි, දෙකක් වූ ධර්‍මයන්ගෙන් සමන්වාගත වූ බාල වූ, අඥාන වූ, අසත්පුරුෂ පුද්ගලයා තමාට හානියක්, විනාශයක් වන ආකාරයෙන් කටයුතු කරයි. ඔහු විඥයන්ට දොස් සහිත ද, නින්දා සහිත ද වේ. තවද, බොහෝ අකුසල් උපදවයි.\n\nකුමන දෙකකින් ද?\nනොවිමසා, නොපිරික්සා ප්‍රසාදය උපදවා නොගත යුතු තැන ප්‍රසාදය උපදවයි. නොවිමසා, නොපිරික්සා ප්‍රසාදය උපදවා ගත යුතු තැන අප්‍රසාදය උපදවයි.\n\nභික්‍ෂූණි, මේ දෙකක් වූ ධර්‍මයන්ගෙන් යුක්ත වූ බාල වූ, අඥාන වූ, අසත්පුරුෂ පුද්ගලයා තමාට හානියක්, විනාශයක් වන ආකාරයෙන් කටයුතු කරයි. ඔහු විඥයන්ට දොස් සහිත ද, නින්දා සහිත ද වේ. තවද, බොහෝ අකුසල් උපදවයි.\n\nභික්‍ෂූණි, දෙකක් වූ ධර්‍මයන්ගෙන් සමන්වාගත වූ පණ්ඩිත වූ, ප්‍රඥාවන්ත වූ, සත්පුරුෂ පුද්ගලයා තමාට හානියක්, විනාශයක් නොවන ආකාරයෙන් කටයුතු කරයි. ඔහු විඥයන්ට නිර්දෝෂී ද, නින්දා රහිත ද වේ. තවද, බොහෝ කුසල් උපදවයි.\n\nකුමන දෙකකින් ද?\nවිමසා, පිරික්සා ප්‍රසාදය උපදවා නොගත යුතු තැන අප්‍රසාදය උපදවයි. විමසා, පිරික්සා ප්‍රසාදය උපදවා ගත යුතු තැන ප්‍රසාදය උපදවයි.\n\nභික්‍ෂූණි, මේ දෙකක් වූ ධර්‍මයන්ගෙන් යුක්ත වූ පණ්ඩිත වූ, ප්‍රඥාවන්ත වූ, සත්පුරුෂ පුද්ගලයා තමාට හානියක්, විනාශයක් නොවන ආකාරයෙන් කටයුතු කරයි. ඔහු විඥයන්ට නිර්දෝෂී ද, නින්දා රහිත ද වේ. තවද, බොහෝ කුසල් උපදවයි.",
      "paliTitle": ""
    },
    {
      "number": 137,
      "pali": "‘‘Dvīsu, bhikkhave, micchāpaṭipajjamāno bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamesu dvīsu? Mātari ca pitari ca. Imesu kho, bhikkhave, dvīsu micchāpaṭipajjamāno bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavatīti. ‘‘Dvīsu, bhikkhave, sammāpaṭipajjamāno paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Katamesu dvīsu? Mātari ca pitari ca. Imesu kho, bhikkhave, dvīsu sammāpaṭipajjamāno paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavatī’’ti.",
      "english": "Monks, an undeveloped, ignoble fool who acts wrongly in two respects brings himself to ruin and injury; he is blameworthy and censurable by the wise, and generates much demerit. Which two? Regarding mother and father. Indeed, monks, an undeveloped, ignoble fool who acts wrongly in these two respects brings himself to ruin and injury; he is blameworthy and censurable by the wise, and generates much demerit.\n\nMonks, a developed, noble wise person who acts rightly in two respects keeps himself unruined and uninjured; he is blameless and uncensurable by the wise, and generates much merit. Which two? Regarding mother and father. Indeed, monks, a developed, noble wise person who acts rightly in these two respects keeps himself unruined and uninjured; he is blameless and uncensurable by the wise, and generates much merit.",
      "sinhala": "මහණෙනි, කරුණු දෙකක වැරැදි ලෙස හැසිරෙන්නා වූ, අවිචාරවත්, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමාටම විනාශය හා හානිය ඇති කර ගනී; විඥානවන්තයන්ට දොස් පැවරිය යුතු, නින්දාවට ලක්විය යුතු පුද්ගලයෙක් වෙයි; බොහෝ අකුසල් රැස් කර ගනී. ඒ කරුණු දෙක කුමක්ද? මවට සහ පියාට (වැරැදි ලෙස හැසිරීම). මහණෙනි, මේ කරුණු දෙකෙහි වැරැදි ලෙස හැසිරෙන්නා වූ, අවිචාරවත්, නුපුහුණු, අසත්පුරුෂ පුද්ගලයා තමාටම විනාශය හා හානිය ඇති කර ගනී; විඥානවන්තයන්ට දොස් පැවරිය යුතු, නින්දාවට ලක්විය යුතු පුද්ගලයෙක් වෙයි; බොහෝ අකුසල් රැස් කර ගනී.\n\nමහණෙනි, කරුණු දෙකක නිවැරැදි ලෙස හැසිරෙන්නා වූ, ප්‍රඥාවන්ත, පුහුණු, සත්පුරුෂ පුද්ගලයා තමාටම හානියක් හෝ විනාශයක් ඇති කර නොගනී; විඥානවන්තයන්ට දොස් පැවරිය නොහැකි, නින්දාවට ලක් නොකළ යුතු පුද්ගලයෙක් වෙයි; බොහෝ කුසල් රැස් කර ගනී. ඒ කරුණු දෙක කුමක්ද? මවට සහ පියාට (නිවැරැදි ලෙස හැසිරීම). මහණෙනි, මේ කරුණු දෙකෙහි නිවැරැදි ලෙස හැසිරෙන්නා වූ, ප්‍රඥාවන්ත, පුහුණු, සත්පුරුෂ පුද්ගලයා තමාටම හානියක් හෝ විනාශයක් ඇති කර නොගනී; විඥානවන්තයන්ට දොස් පැවරිය නොහැකි, නින්දාවට ලක් නොකළ යුතු පුද්ගලයෙක් වෙයි; බොහෝ කුසල් රැස් කර ගනී.",
      "paliTitle": ""
    },
    {
      "number": 138,
      "pali": "‘‘Dvīsu, bhikkhave, micchāpaṭipajjamāno bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavati. Katamesu dvīsu? Tathāgate ca tathāgatasāvake ca. Imesu kho, bhikkhave, micchāpaṭipajjamāno bālo abyatto asappuriso khataṃ upahataṃ attānaṃ pariharati, sāvajjo ca hoti sānuvajjo ca viññūnaṃ, bahuñca apuññaṃ pasavatīti. ‘‘Dvīsu, bhikkhave, sammāpaṭipajjamāno paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavati. Katamesu dvīsu? Tathāgate ca tathāgatasāvake ca. Imesu kho, bhikkhave, dvīsu sammāpaṭipajjamāno paṇḍito viyatto sappuriso akkhataṃ anupahataṃ attānaṃ pariharati, anavajjo ca hoti ananuvajjo ca viññūnaṃ, bahuñca puññaṃ pasavatī’’ti.",
      "english": "Monks, an ignorant, unskilled, ignoble person, by acting wrongly in two respects, brings harm and injury upon themselves, is blameworthy and reproachable by the wise, and generates much demerit. In which two respects? Concerning the Tathāgata and concerning the disciples of the Tathāgata. Monks, by acting wrongly in these two respects, an ignorant, unskilled, ignoble person brings harm and injury upon themselves, is blameworthy and reproachable by the wise, and generates much demerit.\n\nMonks, a wise, skilled, noble person, by acting rightly in two respects, preserves themselves uninjured and unharmed, is blameless and irreproachable by the wise, and generates much merit. In which two respects? Concerning the Tathāgata and concerning the disciples of the Tathāgata. Monks, by acting rightly in these two respects, a wise, skilled, noble person preserves themselves uninjured and unharmed, is blameless and irreproachable by the wise, and generates much merit.",
      "sinhala": "මහණෙනි, බාල වූ, අව්‍යක්ත වූ, අසත්පුරුෂ වූ යම් පුද්ගලයෙක් දෙකක වැරදි ලෙස ප්‍රතිපදාවෙහි යෙදෙන්නේද, ඔහු තමාටම හානි වූ, පළුදු වූ බව ඇති කර ගනී. ඔහු වරද සහිත වෙයි, ප්‍ර‌ඥාවන්තයන් විසින් චෝදනා ලැබීමට සුදුසු වෙයි, බොහෝ අකුසල්ද උපදවයි. ඒ කවර දෙකෙහිද? තථාගතයන් වහන්සේ කෙරෙහිද, තථාගත ශ්‍රා‌වකයන් කෙරෙහිද. මහණෙනි, මෙන්න මේ දෙකෙහි වැරදි ලෙස ප්‍රතිපදාවෙහි යෙදෙන්නා වූ බාල වූ, අව්‍යක්ත වූ, අසත්පුරුෂ පුද්ගලයා තමාටම හානි වූ, පළුදු වූ බව ඇති කර ගනී. ඔහු වරද සහිත වෙයි, ප්‍ර‌ඥාවන්තයන් විසින් චෝදනා ලැබීමට සුදුසු වෙයි, බොහෝ අකුසල්ද උපදවයි.\n\nමහණෙනි, යම් පණ්ඩිත වූ, වි්‍යක්ත වූ, සත්පුරුෂ වූ පුද්ගලයෙක් දෙකක නිවැරදි ලෙස ප්‍රතිපදාවෙහි යෙදෙන්නේද, ඔහු තමාටම කිසිදු හානියක්, පළුදු වීමක් නැති බවට පත්කර ගනී. ඔහු නිර්වද්‍ය වෙයි, ප්‍ර‌ඥාවන්තයන් විසින් චෝදනා නොලබන සුළු වෙයි, බොහෝ කුසල්ද උපදවයි. ඒ කවර දෙකෙහිද? තථාගතයන් වහන්සේ කෙරෙහිද, තථාගත ශ්‍රා‌වකයන් කෙරෙහිද. මහණෙනි, මෙන්න මේ දෙකෙහි නිවැරදි ලෙස ප්‍රතිපදාවෙහි යෙදෙන්නා වූ පණ්ඩිත වූ, වි්‍යක්ත වූ, සත්පුරුෂ පුද්ගලයා තමාටම කිසිදු හානියක්, පළුදු වීමක් නැති බවට පත්කර ගනී. ඔහු නිර්වද්‍ය වෙයි, ප්‍ර‌ඥාවන්තයන් විසින් චෝදනා නොලබන සුළු වෙයි, බොහෝ කුසල්ද උපදවයි.",
      "paliTitle": ""
    },
    {
      "number": 139,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Sacittavodānañca na ca kiñci loke upādiyati. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Bhikkhus, there are these two qualities. Which two? The purification of one’s own mind, and not clinging to anything in the world. Indeed, bhikkhus, these are these two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්‍ම‍ කරුණු දෙකකි. කවරේද ඒ දෙක? තමන්ගේ සිත් පිරිසිදු කර ගැනීම සහ ලෝකයෙහි කිසිවකට නොඇලීම යි. මහණෙනි, මේවා ධර්‍ම‍ කරුණු දෙක යි.",
      "paliTitle": ""
    },
    {
      "number": 140,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Kodho ca upanāho ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, there are these two qualities. Which two? Anger and resentment. These, monks, are the two qualities.",
      "sinhala": "භික්ෂූනි, මේ ධර්ම දෙකකි. ඒ කවර දෙකක්ද? කෝධය ද උපානාහය ද වේ. භික්ෂූනි, මේවාමයි ඒ ධර්ම දෙක.",
      "paliTitle": ""
    },
    {
      "number": 141,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Kodhavinayo ca upanāhavinayo ca. Ime kho, bhikkhave, dve dhammā’’ti. ",
      "english": "Bhikkhus, there are these two qualities. Which two? The subduing of anger and the subduing of resentment. Indeed, Bhikkhus, these are those two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්ම කාරණා දෙකකි. කවර දෙකක් ද? ක්‍රෝධය දුරුකිරීම හා උපනාහය දුරුකිරීම යන දෙකයි. මහණෙනි, මේ ධර්ම කාරණා දෙක නම් මේවාය.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Āyācanavaggo dutiyo.",
    "english": "The Second Chapter on Requests",
    "sinhala": "දෙවන ආයාචන වග්‍ගය"
  }
}