{
  "id": "an2.5",
  "title": {
    "pali": "Parisavaggo",
    "english": "The Chapter on Assemblies",
    "sinhala": "පිරිස වර්ගය"
  },
  "sections": [
    {
      "number": 43,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Uttānā ca parisā gambhīrā ca parisā. Katamā ca, bhikkhave, uttānā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū uddhatā honti unnaḷā capalā mukharā vikiṇṇavācā muṭṭhassatī asampajānā asamāhitā vibbhantacittā pākatindriyā. Ayaṃ vuccati, bhikkhave, uttānā parisā. ‘‘Katamā ca, bhikkhave, gambhīrā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū anuddhatā honti anunnaḷā acapalā amukharā avikiṇṇavācā upaṭṭhitassatī sampajānā samāhitā ekaggacittā saṃvutindriyā. Ayaṃ vuccati, bhikkhave, gambhīrā parisā. Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ gambhīrā parisā’’ti.",
      "english": "Monks, these are two assemblies. Which two? The shallow assembly and the profound assembly. And what, monks, is the shallow assembly? Here, monks, in an assembly where the monastics are agitated, conceited, restless, garrulous, scattered in their speech, forgetful of mindfulness, lacking clear comprehension, unfocused, with wandering minds, and with uncontrolled faculties. This, monks, is called the shallow assembly.\n\nAnd what, monks, is the profound assembly? Here, monks, in an assembly where the monastics are not agitated, not conceited, not restless, not garrulous, not scattered in their speech, established in mindfulness, with clear comprehension, focused, with one-pointed minds, and with restrained faculties. This, monks, is called the profound assembly. These, monks, are the two assemblies. Among these two assemblies, monks, the profound assembly is foremost.",
      "sinhala": "භික්ෂූනි, මේවා සංඝ සභා දෙකකි. ඒ දෙක කවරේද? මතුපිටින් පිහිටි සංඝ සභාවක්ද, ගැඹුරු සංඝ සභාවක්ද. භික්ෂූනි, මතුපිටින් පිහිටි සංඝ සභාව කවරේද? භික්ෂූනි, යම් සංඝ සභාවක් තුළ භික්ෂූන් වහන්සේලා උද්ධච්ච වූවෝ වෙති, උඩඟු වූවෝ වෙති, චංචල වූවෝ වෙති, කටකාර වූවෝ වෙති, විසිරුණු වචන ඇති වූවෝ වෙති, අමතක සිහි ඇති වූවෝ වෙති, නුවණින් නොවිමසන සුලු වූවෝ වෙති, සමාධියෙන් තොර වූවෝ වෙති, වික්ෂිප්ත සිත් ඇති වූවෝ වෙති, විවෘත ඉන්ද්‍රියයන් ඇති වූවෝ වෙති. භික්ෂූනි, මෙය මතුපිටින් පිහිටි සංඝ සභාවක් යැයි කියනු ලැබේ.\n\nභික්ෂූනි, ගැඹුරු සංඝ සභාව කවරේද? භික්ෂූනි, යම් සංඝ සභාවක් තුළ භික්ෂූන් වහන්සේලා උද්ධච්ච නොවූවෝ වෙති, උඩඟු නොවූවෝ වෙති, චංචල නොවූවෝ වෙති, කටකාර නොවූවෝ වෙති, විසිරුණු වචන නැති වූවෝ වෙති, පිහිටි සිහි ඇති වූවෝ වෙති, නුවණින් විමසන සුලු වූවෝ වෙති, සමාධිගත වූවෝ වෙති, එකඟ සිත් ඇති වූවෝ වෙති, සංවර වූ ඉන්ද්‍රියයන් ඇති වූවෝ වෙති. භික්ෂූනි, මෙය ගැඹුරු සංඝ සභාවක් යැයි කියනු ලැබේ. භික්ෂූනි, මේවා එම සංඝ සභා දෙකයි. භික්ෂූනි, මේ සංඝ සභා දෙකෙන් ගැඹුරු වූ සංඝ සභාව අග්‍ර වූවකි.",
      "paliTitle": ""
    },
    {
      "number": 44,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Vaggā ca parisā samaggā ca parisā. Katamā ca, bhikkhave, vaggā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū bhaṇḍanajātā kalahajātā vivādāpannā aññamaññaṃ mukhasattīhi vitudantā viharanti. Ayaṃ vuccati, bhikkhave, vaggā parisā. ‘‘Katamā ca, bhikkhave, samaggā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū samaggā sammodamānā avivadamānā khīrodakībhūtā aññamaññaṃ piyacakkhūhi sampassantā viharanti. Ayaṃ vuccati, bhikkhave, samaggā parisā. Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ samaggā parisā’’ti.",
      "english": "Monks, there are these two assemblies. Which two? A divided assembly and a harmonious assembly.\n\nAnd what, monks, is a divided assembly? Here, monks, in whichever assembly the bhikkhus dwell engaged in quarrels, strife, and disputes, piercing each other with the darts of their mouths. This, monks, is called a divided assembly. And what, monks, is a harmonious assembly? Here, monks, in whichever assembly the bhikkhus dwell united, delighting in each other, not disputing, mingled like milk and water, regarding each other with affectionate eyes. This, monks, is called a harmonious assembly. Indeed, monks, these are the two assemblies. Among these two assemblies, monks, this is the foremost, namely, the harmonious assembly.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ පිරිස් දෙකකි. ඒ දෙක කවරේද? භේදකාරී පිරිසක් සහ සමගි පිරිසක් යනු යි. භික්ෂූන් වහන්ස, භේදකාරී පිරිස කවරේද? භික්ෂූන් වහන්ස, මේ ශාසනයෙහි යම් පිරිසක භික්ෂූන් වහන්සේලා කලහ ඇති කරගෙන, ආරවුල් ඇති කරගෙන, වාද විවාද ඇති කරගෙන, වචන නමැති තියුණු ඊතලවලින් එකිනෙකාට විදිනවාද, භික්ෂූන් වහන්ස, මේ පිරිස භේදකාරී පිරිසක් යැයි කියනු ලැබේ.\n\nභික්ෂූන් වහන්ස, සමගි පිරිස කවරේද? භික්ෂූන් වහන්ස, මේ ශාසනයෙහි යම් පිරිසක භික්ෂූන් වහන්සේලා සමගිව, සතුටින් වාසය කරමින්, වාද විවාද නොකරමින්, කිරි සහ දිය මෙන් එකමුතුව, එකිනෙකාට ප්‍රිය දෑසින් බලමින් වාසය කරත්ද, භික්ෂූන් වහන්ස, මේ පිරිස සමගි පිරිසක් යැයි කියනු ලැබේ. භික්ෂූන් වහන්ස, මේ පිරිස් දෙකකි. භික්ෂූන් වහන්ස, මේ පිරිස් දෙකින් අග්‍ර වන්නේ සමගි පිරිස යි.",
      "paliTitle": ""
    },
    {
      "number": 45,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Anaggavatī ca parisā aggavatī ca parisā. Katamā ca, bhikkhave, anaggavatī parisā? Idha, bhikkhave, yassaṃ parisāyaṃ therā bhikkhū bāhulikā [bāhullikā (syā. kaṃ. ka.) ṭīkā oloketabbā] honti sāthalikā, okkamane pubbaṅgamā, paviveke nikkhittadhurā, na vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti bāhulikā sāthalikā, okkamane pubbaṅgamā, paviveke nikkhittadhurā, na vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ vuccati, bhikkhave, anaggavatī parisā. ‘‘Katamā ca, bhikkhave, aggavatī parisā? Idha, bhikkhave, yassaṃ parisāyaṃ therā bhikkhū na bāhulikā honti na sāthalikā, okkamane nikkhittadhurā, paviveke pubbaṅgamā, vīriyaṃ ārabhanti appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Tesaṃ pacchimā janatā diṭṭhānugatiṃ āpajjati. Sāpi hoti na bāhulikā na sāthalikā, okkamane nikkhittadhurā, paviveke pubbaṅgamā, vīriyaṃ ārabhati appattassa pattiyā anadhigatassa adhigamāya asacchikatassa sacchikiriyāya. Ayaṃ vuccati, bhikkhave, aggavatī parisā. Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ aggavatī parisā’’ti.",
      "english": "Monks, there are these two kinds of assemblies. Which two? The assembly lacking the supreme quality, and the assembly possessing the supreme quality. And what, monks, is the assembly lacking the supreme quality? Here, monks, in whichever assembly the elder monks are prone to distraction and worldly engagement, negligent in practice, foremost in descending into worldly concerns, those who relinquish the duty of seclusion, and who do not exert themselves for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, or for the realization of the as-yet-unrealized. The later generation follows their example. They too are prone to distraction and worldly engagement, negligent in practice, foremost in descending into worldly concerns, those who relinquish the duty of seclusion, and who do not exert themselves for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, or for the realization of the as-yet-unrealized. This, monks, is called the assembly lacking the supreme quality.\n\nAnd what, monks, is the assembly possessing the supreme quality? Here, monks, in whichever assembly the elder monks are not prone to distraction and worldly engagement, not negligent in practice, those who relinquish worldly engagement, foremost in seclusion, and who exert themselves for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, or for the realization of the as-yet-unrealized. The later generation follows their example. They too are not prone to distraction and worldly engagement, not negligent in practice, those who relinquish worldly engagement, foremost in seclusion, and who exert themselves for the attainment of the as-yet-unattained, for the comprehension of the as-yet-uncomprehended, or for the realization of the as-yet-unrealized. This, monks, is called the assembly possessing the supreme quality. These, monks, are the two kinds of assemblies. Of these two assemblies, monks, the assembly possessing the supreme quality is considered the foremost.",
      "sinhala": "මහණෙනි, මේ පිරිස් දෙකකි. කවරේද ඒ දෙක? අග්‍ර බවක් නැති පිරිස හා අග්‍ර වූ පිරිස යි.\n\nමහණෙනි, අග්‍ර බවක් නැති පිරිස කවරේද? මහණෙනි, යම් පිරිසක තෙර භික්ෂූන් වහන්සේලා බහුල ක්‍රියාවලට ලැදි වෙත්ද, අලස වෙත්ද, පිරිහීමට ප්‍රමුඛ වෙත්ද, විවේකය අත්හළ වෙත්ද, නොලැබූ දේ ලැබීම සඳහා ද, අවබෝධ නොකළ දේ අවබෝධ කර ගැනීම සඳහා ද, සාක්ෂාත් නොකළ දේ සාක්ෂාත් කිරීම සඳහා ද වීර්ය නොආරම්භ කෙරෙත්ද, ඒ අයට පසු පරම්පරාව දැක්ම අනුව යෙදෙත්. ඔවුහු ද බහුල ක්‍රියාවලට ලැදි වෙත්, අලස වෙත්, පිරිහීමට ප්‍රමුඛ වෙත්, විවේකය අත්හළ වෙත්, නොලැබූ දේ ලැබීම සඳහා ද, අවබෝධ නොකළ දේ අවබෝධ කර ගැනීම සඳහා ද, සාක්ෂාත් නොකළ දේ සාක්ෂාත් කිරීම සඳහා ද වීර්ය නොආරම්භ කෙරෙත්. මහණෙනි, මෙය අග්‍ර බවක් නැති පිරිස යැයි කියනු ලැබේ.\n\nමහණෙනි, අග්‍ර වූ පිරිස කවරේද? මහණෙනි, යම් පිරිසක තෙර භික්ෂූන් වහන්සේලා බහුල ක්‍රියාවලට ලැදි නොවෙත්ද, අලස නොවෙත්ද, පිරිහීම අත්හළ වෙත්ද, විවේකයට ප්‍රමුඛ වෙත්ද, නොලැබූ දේ ලැබීම සඳහා ද, අවබෝධ නොකළ දේ අවබෝධ කර ගැනීම සඳහා ද, සාක්ෂාත් නොකළ දේ සාක්ෂාත් කිරීම සඳහා ද වීර්ය ආරම්භ කෙරෙත්ද, ඒ අයට පසු පරම්පරාව දැක්ම අනුව යෙදෙත්. ඔවුහු ද බහුල ක්‍රියාවලට ලැදි නොවෙත්, අලස නොවෙත්, පිරිහීම අත්හළ වෙත්, විවේකයට ප්‍රමුඛ වෙත්, නොලැබූ දේ ලැබීම සඳහා ද, අවබෝධ නොකළ දේ අවබෝධ කර ගැනීම සඳහා ද, සාක්ෂාත් නොකළ දේ සාක්ෂාත් කිරීම සඳහා ද වීර්ය ආරම්භ කෙරෙත්. මහණෙනි, මෙය අග්‍ර වූ පිරිස යැයි කියනු ලැබේ.\n\nමහණෙනි, මේ පිරිස් දෙක යි. මහණෙනි, මේ පිරිස් දෙක අතරින් අග්‍ර වූ පිරිස යනු මෙයයි.",
      "paliTitle": ""
    },
    {
      "number": 46,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Anariyā ca parisā ariyā ca parisā. Katamā ca, bhikkhave, anariyā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū ‘idaṃ dukkha’nti yathābhūtaṃ nappajānanti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ nappajānanti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ nappajānanti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ nappajānanti. Ayaṃ vuccati, bhikkhave, anariyā parisā. ‘‘Katamā ca, bhikkhave, ariyā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū ‘idaṃ dukkha’nti yathābhūtaṃ pajānanti, ‘ayaṃ dukkhasamudayo’ti yathābhūtaṃ pajānanti, ‘ayaṃ dukkhanirodho’ti yathābhūtaṃ pajānantntti, ‘ayaṃ dukkhanirodhagāminī paṭipadā’ti yathābhūtaṃ pajānanti. Ayaṃ vuccati, bhikkhave, ariyā parisā. Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ ariyā parisā’’ti.",
      "english": "Monastics, these are the two assemblies. Which two? The ignoble assembly and the noble assembly. And what, monastics, is the ignoble assembly? Here, monastics, in whichever assembly the monastics do not understand as it truly is: 'This is suffering,' 'This is the origin of suffering,' 'This is the cessation of suffering,' 'This is the path leading to the cessation of suffering.' This, monastics, is called the ignoble assembly.\n\nAnd what, monastics, is the noble assembly? Here, monastics, in whichever assembly the monastics understand as it truly is: 'This is suffering,' 'This is the origin of suffering,' 'This is the cessation of suffering,' 'This is the path leading to the cessation of suffering.' This, monastics, is called the noble assembly. These, monastics, are the two assemblies. Of these two assemblies, monastics, the noble assembly is considered the foremost.",
      "sinhala": "භික්‍ෂූනි, මේ පරිසා දෙකකි. කවරක්ද ඒ දෙක? අනාරිය පරිසාව සහ ආර්ය පරිසාවයි.\n\nභික්‍ෂූනි, අනාරිය පරිසාව කවරක්ද? භික්‍ෂූනි, මෙහිලා යම් පරිසාවක භික්‍ෂූහු ‘මෙය දුක යි’ කියා ඇත්ත ඇති සැටියෙන් නොදනිත් ද, ‘මෙය දුක හටගැනීම යි’ කියා ඇත්ත ඇති සැටියෙන් නොදනිත් ද, ‘මෙය දුක නැතිවීම යි’ කියා ඇත්ත ඇති සැටියෙන් නොදනිත් ද, ‘මෙය දුක නැතිකරන ප්‍රතිපදාව යි’ කියා ඇත්ත ඇති සැටියෙන් නොදනිත් ද, භික්‍ෂූනි, මෙය අනාරිය පරිසාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, ආර්ය පරිසාව කවරක්ද? භික්‍ෂූනි, මෙහිලා යම් පරිසාවක භික්‍ෂූහු ‘මෙය දුක යි’ කියා ඇත්ත ඇති සැටියෙන් දනිත් ද, ‘මෙය දුක හටගැනීම යි’ කියා ඇත්ත ඇති සැටියෙන් දනිත් ද, ‘මෙය දුක නැතිවීම යි’ කියා ඇත්ත ඇති සැටියෙන් දනිත් ද, ‘මෙය දුක නැතිකරන ප්‍රතිපදාව යි’ කියා ඇත්ත ඇති සැටියෙන් දනිත් ද, භික්‍ෂූනි, මෙය ආර්ය පරිසාව යැයි කියනු ලැබේ.\n\nභික්‍ෂූනි, මේ පරිසා දෙක නම් මේවා ය. භික්‍ෂූනි, මේ පරිසා දෙක අතුරින්, ආර්ය පරිසාව යනු අග්‍ර වූවකි.",
      "paliTitle": ""
    },
    {
      "number": 47,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Parisākasaṭo ca parisāmaṇḍo ca. Katamo ca, bhikkhave, parisākasaṭo? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū chandāgatiṃ gacchanti, dosāgatiṃ gacchanti, mohāgatiṃ gacchanti, bhayāgatiṃ gacchanti. Ayaṃ vuccati, bhikkhave, parisākasaṭo. ‘‘Katamo ca, bhikkhave, parisāmaṇḍo? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū na chandāgatiṃ gacchanti, na dosāgatiṃ gacchanti, na mohāgatiṃ gacchanti, na bhayāgatiṃ gacchanti. Ayaṃ vuccati, bhikkhave, parisāmaṇḍo. Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ parisāmaṇḍo’’ti.",
      "english": "Monks, there are these two assemblies. Which two? The corrupt assembly and the excellent assembly.\n\nAnd what, monks, is the corrupt assembly? Here, monks, in which assembly monks follow a wrong course due to desire, follow a wrong course due to aversion, follow a wrong course due to delusion, or follow a wrong course due to fear. This, monks, is called the corrupt assembly.\n\nAnd what, monks, is the excellent assembly? Here, monks, in which assembly monks do not follow a wrong course due to desire, do not follow a wrong course due to aversion, do not follow a wrong course due to delusion, and do not follow a wrong course due to fear. This, monks, is called the excellent assembly.\n\nThese, monks, are the two assemblies. Of these two assemblies, monks, the excellent assembly is supreme.",
      "sinhala": "භික්ෂූනි, මේ සභා දෙකකි. ඒ කවර දෙකක්ද? කසට වූ සභාවද, ප්‍රශස්ත වූ සභාවද යන දෙකයි.\n\nභික්ෂූනි, කසට වූ සභාව කවරේද? භික්ෂූනි, මෙහිලා යම් සභාවක් තුළ භික්ෂූහු ඡන්දයෙන් අගතිගාමී වෙත්ද, ද්වේෂයෙන් අගතිගාමී වෙත්ද, මෝහයෙන් අගතිගාමී වෙත්ද, භයවශයෙන් අගතිගාමී වෙත්ද; භික්ෂූනි, මෙය කසට වූ සභාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, ප්‍රශස්ත වූ සභාව කවරේද? භික්ෂූනි, මෙහිලා යම් සභාවක් තුළ භික්ෂූහු ඡන්දයෙන් අගතිගාමී නොවෙත්ද, ද්වේෂයෙන් අගතිගාමී නොවෙත්ද, මෝහයෙන් අගතිගාමී නොවෙත්ද, භයවශයෙන් අගතිගාමී නොවෙත්ද; භික්ෂූනි, මෙය ප්‍රශස්ත වූ සභාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, මේ සභා දෙක වෙති. භික්ෂූනි, මේ සභා දෙකෙන් අග්‍ර වන්නේ යම් මේ ප්‍රශස්ත සභාවද එයයි.",
      "paliTitle": ""
    },
    {
      "number": 48,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Okkācitavinītā parisā nopaṭipucchāvinītā, paṭipucchāvinītā parisā nookkācitavinītā. Katamā ca, bhikkhave, okkācitavinītā parisā nopaṭipucchāvinītā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū ye te suttantā tathāgatabhāsitā gambhīrā gambhīratthā lokuttarā suññatāpaṭisaṃyuttā tesu bhaññamānesu na sussūsanti na sotaṃ odahanti na aññā cittaṃ upaṭṭhapenti na ca te dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññanti. Ye pana te suttantā kavitā [kavikatā (sabbattha) ṭīkā oloketabbā] kāveyyā cittakkharā cittabyañjanā bāhirakā sāvakabhāsitā tesu bhaññamānesu sussūsanti sotaṃ odahanti aññā cittaṃ upaṭṭhapenti, te dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññanti, te ca taṃ dhammaṃ pariyāpuṇitvā na ceva aññamaññaṃ paṭipucchanti na ca paṭivicaranti – ‘idaṃ kathaṃ, imassa ko attho’ti? Te avivaṭañceva na vivaranti, anuttānīkatañca na uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ na paṭivinodenti. Ayaṃ vuccati, bhikkhave, okkācitavinītā parisā no paṭipucchāvinītā. ‘‘Katamā ca, bhikkhave, paṭipucchāvinītā parisā nookkācitavinītā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū ye te suttantā kavitā kāveyyā cittakkharā cittabyañjanā bāhirakā sāvakabhāsitā tesu bhaññamānesu na sussūsanti na sotaṃ odahanti na aññā cittaṃ upaṭṭhapenti, na ca te dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññanti. Ye pana te suttantā tathāgatabhāsitā gambhīrā gambhīratthā lokuttarā suññatāpaṭisaṃyuttā tesu bhaññamānesu sussūsanti sotaṃ odahanti aññā cittaṃ upaṭṭhapenti, te ca dhamme uggahetabbaṃ pariyāpuṇitabbaṃ maññanti. Te taṃ dhammaṃ pariyāpuṇitvā aññamaññaṃ paṭipucchanti paṭivicaranti – ‘idaṃ kathaṃ, imassa ko attho’ti? Te avivaṭañceva vivaranti, anuttānīkatañca uttānīkaronti, anekavihitesu ca kaṅkhāṭhāniyesu dhammesu kaṅkhaṃ paṭivinodenti. Ayaṃ vuccati, bhikkhave, paṭipucchāvinītā parisā nookkācitavinītā. Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ paṭipucchāvinītā parisā nookkācitavinītā’’ti.",
      "english": "Monks, there are these two assemblies. Which two? An assembly disciplined by outward show, not by questioning; and an assembly disciplined by questioning, not by outward show.\n\nAnd which, monks, is the assembly disciplined by outward show, not by questioning? Here, monks, in an assembly where monks, when those discourses spoken by the Tathāgata—profound, profound in meaning, supra-mundane, connected with emptiness—are being recited, do not listen attentively, do not lend an ear, do not establish their minds for understanding, and do not consider these teachings to be worth learning or mastering. But when those discourses that are composed, poetic, with beautiful words and beautiful phrases, external, and spoken by disciples, are being recited, they listen attentively, lend an ear, establish their minds for understanding, and they consider these teachings to be worth learning and mastering. And having mastered that teaching, they do not question one another, nor do they reflect upon it, saying, ‘How is this? What is the meaning of this?’ They do not disclose what is undisclosed, nor do they make plain what is not plain, and in the various teachings that give rise to doubt, they do not dispel their doubts. This, monks, is called the assembly disciplined by outward show, not by questioning.\n\nAnd which, monks, is the assembly disciplined by questioning, not by outward show? Here, monks, in an assembly where monks, when those discourses that are composed, poetic, with beautiful words and beautiful phrases, external, and spoken by disciples, are being recited, do not listen attentively, do not lend an ear, do not establish their minds for understanding, and do not consider these teachings to be worth learning or mastering. But when those discourses spoken by the Tathāgata—profound, profound in meaning, supra-mundane, connected with emptiness—are being recited, they listen attentively, lend an ear, establish their minds for understanding, and they consider these teachings to be worth learning and mastering. Having mastered that teaching, they question one another and reflect upon it, saying, ‘How is this? What is the meaning of this?’ They disclose what is undisclosed, and make plain what is not plain, and in the various teachings that give rise to doubt, they dispel their doubts. This, monks, is called the assembly disciplined by questioning, not by outward show.\n\nThese, monks, are the two assemblies. Among these two assemblies, monks, this is considered the foremost: the assembly disciplined by questioning, not by outward show.",
      "sinhala": "මහණෙනි, මේ පිරිස් දෙකකි. කවරේද ඒ දෙක? වචන වල ආටෝපයට මුළා වී හික්මුණු පිරිසක් මිස ප්‍රශ්න කිරීමෙන් හික්මුණු පිරිසක් නොවේ; ප්‍රශ්න කිරීමෙන් හික්මුණු පිරිසක් මිස වචන වල ආටෝපයට මුළා වී හික්මුණු පිරිසක් නොවේ. මහණෙනි, වචන වල ආටෝපයට මුළා වී හික්මුණු පිරිසක් මිස ප්‍රශ්න කිරීමෙන් හික්මුණු පිරිසක් නොවේ යැයි කියනු ලබන්නේ කවරේද? මහණෙනි, යම් පිරිසක භික්ෂූන් වහන්සේලා තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ගැඹුරු වූ, ගැඹුරු අරුත් ඇති, ලෝකෝත්තර වූ, ශුන්‍යතාවයට සම්බන්ධ වූ යම් සූත්‍ර තිබේ ද, ඒවා දේශනා කරනු ලබන විට හොඳින් අසන්නේ නැත, කන් නොදෙති, ඥානය පිණිස සිත යොදවන්නේ නැත, එම ධර‍්මයන් උගත යුතු ය, ප්‍රගුණ කළ යුතු යැයි ද නොසිතති. කාව්‍යමය වූ, ගීතමය වූ, සිත් ගන්නා අකුරු හා වචන වලින් යුක්ත වූ, බාහිර වූ, ශ්‍රාවකයන් විසින් දේශනා කරන ලද යම් සූත්‍ර තිබේ ද, ඒවා දේශනා කරනු ලබන විට හොඳින් අසති, කන් දෙති, ඥානය පිණිස සිත යොදවති, එම ධර‍්මයන් උගත යුතු ය, ප්‍රගුණ කළ යුතු යැයි ද සිතති. එම ධර‍්මය ප්‍රගුණ කර ද “මෙය කෙසේ ද, මෙහි අර්ථය කුමක් ද” යි එකිනෙකා ප්‍රශ්න නොකරති, විමසන්නේ ද නැත. ඔවුන් නොවිවෘත වූ දේ විවෘත නොකරති, නොපැහැදිලි දේ පැහැදිලි නොකරති, නොයෙක් ආකාර වූ සැක සහිත ධර‍්මයන්හි සැකය ද දුරු නොකරති. මහණෙනි, වචන වල ආටෝපයට මුළා වී හික්මුණු පිරිසක් මිස ප්‍රශ්න කිරීමෙන් හික්මුණු පිරිසක් නොවේ යැයි කියනු ලබන්නේ මෙයයි.\n\nමහණෙනි, ප්‍රශ්න කිරීමෙන් හික්මුණු පිරිසක් මිස වචන වල ආටෝපයට මුළා වී හික්මුණු පිරිසක් නොවේ යැයි කියනු ලබන්නේ කවරේද? මහණෙනි, යම් පිරිසක භික්ෂූන් වහන්සේලා කාව්‍යමය වූ, ගීතමය වූ, සිත් ගන්නා අකුරු හා වචන වලින් යුක්ත වූ, බාහිර වූ, ශ්‍රාවකයන් විසින් දේශනා කරන ලද යම් සූත්‍ර තිබේ ද, ඒවා දේශනා කරනු ලබන විට හොඳින් අසන්නේ නැත, කන් නොදෙති, ඥානය පිණිස සිත යොදවන්නේ නැත, එම ධර‍්මයන් උගත යුතු ය, ප්‍රගුණ කළ යුතු යැයි ද නොසිතති. තථාගතයන් වහන්සේ විසින් දේශනා කරන ලද ගැඹුරු වූ, ගැඹුරු අරුත් ඇති, ලෝකෝත්තර වූ, ශුන්‍යතාවයට සම්බන්ධ වූ යම් සූත්‍ර තිබේ ද, ඒවා දේශනා කරනු ලබන විට හොඳින් අසති, කන් දෙති, ඥානය පිණිස සිත යොදවති, එම ධර‍්මයන් උගත යුතු ය, ප්‍රගුණ කළ යුතු යැයි ද සිතති. එම ධර‍්මය ප්‍රගුණ කර ද “මෙය කෙසේ ද, මෙහි අර්ථය කුමක් ද” යි එකිනෙකා ප්‍රශ්න කරති, විමසති. ඔවුන් නොවිවෘත වූ දේ විවෘත කරති, නොපැහැදිලි දේ පැහැදිලි කරති, නොයෙක් ආකාර වූ සැක සහිත ධර‍්මයන්හි සැකය ද දුරු කරති. මහණෙනි, ප්‍රශ්න කිරීමෙන් හික්මුණු පිරිසක් මිස වචන වල ආටෝපයට මුළා වී හික්මුණු පිරිසක් නොවේ යැයි කියනු ලබන්නේ මෙයයි.\n\nමහණෙනි, මේ පිරිස් දෙකකි. මහණෙනි, මේ පිරිස් දෙකෙන් ප්‍රශ්න කිරීමෙන් හික්මුණු පිරිසක් මිස වචන වල ආටෝපයට මුළා වී හික්මුණු පිරිසක් නොවන මේ පිරිස අග්‍ර වන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 49,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Āmisagaru parisā no saddhammagaru, saddhammagaru parisā no āmisagaru. Katamā ca, bhikkhave, āmisagaru parisā no saddhammagaru? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū gihīnaṃ odātavasanānaṃ sammukhā aññamaññassa vaṇṇaṃ bhāsanti – ‘asuko bhikkhu ubhatobhāgavimutto, asuko paññāvimutto, asuko kāyasakkhī, asuko diṭṭhippatto, asuko saddhāvimutto, asuko dhammānusārī, asuko saddhānusārī, asuko sīlavā kalyāṇadhammo, asuko dussīlo pāpadhammo’ti. Te tena lābhaṃ labhanti. Te taṃ lābhaṃ labhitvā gathitā [gadhitā (ka.)] mucchitā ajjhopannā [ajjhosānā (ka.), anajjhopannā (sī. syā. ka.) tikanipāte kusināravagge paṭhamasuttaṭīkā oloketabbā] anādīnavadassāvino anissaraṇapaññā paribhuñjanti. Ayaṃ vuccati, bhikkhave, āmisagaru parisā no saddhammagaru. ‘‘Katamā ca, bhikkhave, saddhammagaru parisā noāmisagaru? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū gihīnaṃ odātavasanānaṃ sammukhā aññamaññassa vaṇṇaṃ na bhāsanti – ‘asuko bhikkhu ubhatobhāgavimutto, asuko paññāvimutto, asuko kāyasakkhī, asuko diṭṭhippatto, asuko saddhāvimutto, asuko dhammānussārī, asuko saddhānusārī, asuko sīlavā kalyāṇadhammo, asuko dussīlo pāpadhammo’ti. Te tena lābhaṃ labhanti. Te taṃ lābhaṃ labhitvā agathitā amucchitā anajjhosannā ādīnavadassāvino nissaraṇapaññā paribhuñjanti. Ayaṃ vuccati, bhikkhave, saddhammagaru parisā noāmisagaru. Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ saddhammagaru parisā noāmisagarū’’ti.",
      "english": "Monks, there are these two types of assemblies. Which two? An assembly that holds material gain as paramount and does not value the Dhamma; and an assembly that holds the Dhamma as paramount and does not value material gain.\n\nMonks, which is the assembly that holds material gain as paramount and does not value the Dhamma? Here, monks, in this assembly, monks, in the presence of white-clad lay people, speak of the qualities of one another, saying: ‘This monk is liberated in both ways; this one is liberated by wisdom; this one is a body-witness; this one has attained to right view; this one is liberated by faith; this one is a Dhamma-follower; this one is a faith-follower; this one is virtuous and of good conduct; this one is unvirtuous and of bad conduct.’ They thereby obtain gain. Having obtained that gain, they consume it entangled, infatuated, and obsessed, not seeing its danger and lacking the wisdom for escape. This, monks, is called an assembly that holds material gain as paramount and does not value the Dhamma.\n\nMonks, which is the assembly that holds the Dhamma as paramount and does not value material gain? Here, monks, in this assembly, monks, in the presence of white-clad lay people, do not speak of the qualities of one another, saying: ‘This monk is liberated in both ways; this one is liberated by wisdom; this one is a body-witness; this one has attained to right view; this one is liberated by faith; this one is a Dhamma-follower; this one is a faith-follower; this one is virtuous and of good conduct; this one is unvirtuous and of bad conduct.’ They thereby obtain gain. Having obtained that gain, they consume it unentangled, uninfatuated, and unobsessed, seeing its danger and possessing the wisdom for escape. This, monks, is called an assembly that holds the Dhamma as paramount and does not value material gain.\n\nMonks, these are the two types of assemblies. Among these two assemblies, monks, the assembly that holds the Dhamma as paramount and does not value material gain is declared to be the foremost.",
      "sinhala": "භික්ෂූනි, මේ සභා දෙකකි. කවර දෙකක්ද? ආමිසයට ගරු කරන සභාවක් මිස සද්ධර්මයට ගරු නොකරන සභාවක්ද, සද්ධර්මයට ගරු කරන සභාවක් මිස ආමිසයට ගරු නොකරන සභාවක්ද යන මේ දෙකයි.\n\nභික්ෂූනි, ආමිසයට ගරු කරන, එහෙත් සද්ධර්මයට ගරු නොකරන සභාව කවරීද? භික්ෂූනි, මේ ලෝකයෙහි යම් සභාවක් ඇද්ද, එහි භික්ෂූන් සුදු වස්ත්‍ර හැඳ සිටින ගිහියන් ඉදිරියේ එකිනෙකාගේ ගුණ වර්ණනා කරති. ‘මේ භික්ෂුව උභතෝභාගවිමුක්තය, මේ භික්ෂුව ප්‍ර‍‌ඥාවිමුක්තය, මේ භික්ෂුව කායසාක්ෂිය, මේ භික්ෂුව දෘෂ්ටිප්‍ර‍‌ාප්තය, මේ භික්ෂුව ශ්‍ර‍‌ද්ධාවිමුක්තය, මේ භික්ෂුව ධර්මානුසාරිය, මේ භික්ෂුව ශ්‍ර‍‌ද්ධානුසාරිය, මේ භික්ෂුව ශීලවන්තයෙකි, කල්‍යාණ ධර්ම ඇත්තෙකි, මේ භික්ෂුව දුශ්ශීලයෙකි, පාපධර්ම ඇත්තෙකි’යි (එකිනෙකාගේ ගුණ හෝ අගුණ කියති). ඔවුහු ඒ හේතුවෙන් ලාභ ලබති. ඔවුහු ඒ ලාභ ලබාගෙන, බැඳුණු සිත් ඇතිව, මුසපත් වී, එයට ඇලී, එහි ආදීනව නොදක්නාසුලුව, නිස්සරණය පිළිබඳ ප්‍ර‍‌ඥාවක් රහිතව ඒවා පරිභෝග කරති. භික්ෂූනි, මෙය ආමිසයට ගරු කරන, එහෙත් සද්ධර්මයට ගරු නොකරන සභාව ලෙස කියනු ලැබේ.\n\nභික්ෂූනි, සද්ධර්මයට ගරු කරන, එහෙත් ආමිසයට ගරු නොකරන සභාව කවරීද? භික්ෂූනි, මේ ලෝකයෙහි යම් සභාවක් ඇද්ද, එහි භික්ෂූන් සුදු වස්ත්‍ර හැඳ සිටින ගිහියන් ඉදිරියේ එකිනෙකාගේ ගුණ වර්ණනා නොකරති. ‘මේ භික්ෂුව උභතෝභාගවිමුක්තය, මේ භික්ෂුව ප්‍ර‍‌ඥාවිමුක්තය, මේ භික්ෂුව කායසාක්ෂිය, මේ භික්ෂුව දෘෂ්ටිප්‍ර‍‌ාප්තය, මේ භික්ෂුව ශ්‍ර‍‌ද්ධාවිමුක්තය, මේ භික්ෂුව ධර්මානුසාරිය, මේ භික්ෂුව ශ්‍ර‍‌ද්ධානුසාරිය, මේ භික්ෂුව ශීලවන්තයෙකි, කල්‍යාණ ධර්ම ඇත්තෙකි, මේ භික්ෂුව දුශ්ශීලයෙකි, පාපධර්ම ඇත්තෙකි’යි (එකිනෙකාගේ ගුණ හෝ අගුණ නොකියති). ඔවුහු ඒ හේතුවෙන් ලාභ ලබති. ඔවුහු ඒ ලාභ ලබාගෙන, නොබැඳුණු සිත් ඇතිව, මුසපත් නොවී, එයට ඇලී නොසිට, එහි ආදීනව දක්නාසුලුව, නිස්සරණය පිළිබඳ ප්‍ර‍‌ඥා ඇත්තෝ ඒවා පරිභෝග කරති. භික්ෂූනි, මෙය සද්ධර්මයට ගරු කරන, එහෙත් ආමිසයට ගරු නොකරන සභාව ලෙස කියනු ලැබේ. භික්ෂූනි, මේ සභා දෙකයි. භික්ෂූනි, මේ සභා දෙක අතුරින්, සද්ධර්මයට ගරු කරන, එහෙත් ආමිසයට ගරු නොකරන සභාව අග්‍ර‍‌යයි.",
      "paliTitle": ""
    },
    {
      "number": 50,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Visamā ca parisā samā ca parisā. Katamā ca, bhikkhave, visamā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ adhammakammāni pavattanti dhammakammāni nappavattanti, avinayakammāni pavattanti vinayakammāni nappavattanti, adhammakammāni dippanti dhammakammāni na dippanti, avinayakammāni dippanti vinayakammāni na dippanti. Ayaṃ vuccati, bhikkhave, visamā parisā. ( ) [(visamattā bhikkhave parisāya adhammakammāni pavattanti… vinayakammāni na dippanti.) (sī. pī.)] ‘‘Katamā ca, bhikkhave, samā parisā? Idha, bhikkhave, yassaṃ parisāyaṃ dhammakammāni pavattanti adhammakammāni nappavattanti, vinayakammāni pavattanti avinayakammāni nappavattanti, dhammakammāni dippanti adhammakammāni na dippanti, vinayakammāni dippanti avinayakammāni na dippanti. Ayaṃ vuccati, bhikkhave, samā parisā. ( ) [(samattā bhikkhave parisāya dhammakammāni pavattanti… avinayakammāni na dippanti.) (sī. pī.)] Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ samā parisā’’ti.",
      "english": "“Monks, there are these two assemblies. Which two? The unequal assembly and the equal assembly.\n\n“And what, monks, is the unequal assembly? Here, monks, in whichever assembly unrighteous actions prevail and righteous actions do not prevail; actions contrary to the discipline prevail and actions in accordance with the discipline do not prevail; unrighteous actions shine forth and righteous actions do not shine forth; actions contrary to the discipline shine forth and actions in accordance with the discipline do not shine forth. This, monks, is called the unequal assembly.\n\n“And what, monks, is the equal assembly? Here, monks, in whichever assembly righteous actions prevail and unrighteous actions do not prevail; actions in accordance with the discipline prevail and actions contrary to the discipline do not prevail; righteous actions shine forth and unrighteous actions do not shine forth; actions in accordance with the discipline shine forth and actions contrary to the discipline do not shine forth. This, monks, is called the equal assembly.\n\n“These, monks, are the two assemblies. Among these two assemblies, monks, the equal assembly is declared to be the foremost.”",
      "sinhala": "භික්ෂූනි, මේ සභා දෙකකි. ඒ දෙක කුමක්ද? විෂම සභාවක් සහ සම සභාවක්. භික්ෂූනි, විෂම සභාව යනු කවරේද? භික්ෂූනි, යම් සභාවක් තුළ අධර්ම කර්මයන් ප්u200dරවෘත්ත වෙයිද, ධර්ම කර්මයන් ප්u200dරවෘත්ත නොවෙයිද, අවිනය කර්මයන් ප්u200dරවෘත්ත වෙයිද, විනය කර්මයන් ප්u200dරවෘත්ත නොවෙයිද, අධර්ම කර්මයන් බබළයිද, ධර්ම කර්මයන් නොබබළයිද, අවිනය කර්මයන් බබළයිද, විනය කර්මයන් නොබබළයිද, භික්ෂූනි, මෙය විෂම සභාව යැයි කියනු ලැබේ.\n\nභික්ෂූනි, සම සභාව යනු කවරේද? භික්ෂූනි, යම් සභාවක් තුළ ධර්ම කර්මයන් ප්u200dරවෘත්ත වෙයිද, අධර්ම කර්මයන් ප්u200dරවෘත්ත නොවෙයිද, විනය කර්මයන් ප්u200dරවෘත්ත වෙයිද, අවිනය කර්මයන් ප්u200dරවෘත්ත නොවෙයිද, ධර්ම කර්මයන් බබළයිද, අධර්ම කර්මයන් නොබබළයිද, විනය කර්මයන් බබළයිද, අවිනය කර්මයන් නොබබළයිද, භික්ෂූනි, මෙය සම සභාව යැයි කියනු ලැබේ. භික්ෂූනි, මේ සභා දෙක මෙයයි. භික්ෂූනි, මේ සභා දෙක අතුරින්, යම් මේ සම සභාව වේද, එය අග්u200dර වෙයි.",
      "paliTitle": ""
    },
    {
      "number": 51,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Adhammikā ca parisā dhammikā ca parisā…pe… imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ dhammikā parisā’’ti.",
      "english": "Monks, there are these two kinds of assemblies. Which two? An unrighteous assembly and a righteous assembly... Monks, these are the two assemblies. Among these two assemblies, Monks, the righteous assembly is the foremost.",
      "sinhala": "මහණෙනි, මේ පිරිස් දෙකකි. ඒ කවර දෙකක්ද? අධම්මික පිරිසක් ද, ධම්මික පිරිසක් ද යන මේවාය. මහණෙනි, මේ පිරිස් දෙකයි. මහණෙනි, මේ පිරිස් දෙකෙන් ධම්මික පිරිස අග්‍රතම වේ.",
      "paliTitle": ""
    },
    {
      "number": 52,
      "pali": "‘‘Dvemā, bhikkhave, parisā. Katamā dve? Adhammavādinī ca parisā dhammavādinī ca parisā. Katamā ca, bhikkhave, adhammavādinī parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū adhikaraṇaṃ ādiyanti dhammikaṃ vā adhammikaṃ vā. Te taṃ adhikaraṇaṃ ādiyitvā na ceva aññamaññaṃ saññāpenti na ca saññattiṃ upagacchanti, na ca nijjhāpenti na ca nijjhattiṃ upagacchanti. Te asaññattibalā anijjhattibalā appaṭinissaggamantino tameva adhikaraṇaṃ thāmasā parāmāsā [parāmassa (sī. pī.)] abhinivissa voharanti – ‘idameva saccaṃ moghamañña’nti. Ayaṃ vuccati, bhikkhave, adhammavādinī parisā. ‘‘Katamā ca, bhikkhave, dhammavādinī parisā? Idha, bhikkhave, yassaṃ parisāyaṃ bhikkhū adhikaraṇaṃ ādiyanti dhammikaṃ vā adhammikaṃ vā. Te taṃ adhikaraṇaṃ ādiyitvā aññamaññaṃ saññāpenti ceva saññattiñca upagacchanti, nijjhāpenti ceva nijjhattiñca upagacchanti. Te saññattibalā nijjhattibalā paṭinissaggamantino, na tameva adhikaraṇaṃ thāmasā parāmāsā abhinivissa voharanti – ‘idameva saccaṃ moghamañña’nti. Ayaṃ vuccati, bhikkhave, dhammavādinī parisā. Imā kho, bhikkhave, dve parisā. Etadaggaṃ, bhikkhave, imāsaṃ dvinnaṃ parisānaṃ yadidaṃ dhammavādinī parisā’’ti. ",
      "english": "Monks, there are these two assemblies. Which two? The assembly that speaks against the Dhamma, and the assembly that speaks in accordance with the Dhamma.\n\nAnd what, monks, is the assembly that speaks against the Dhamma? Here, monks, in this assembly, monks take up an issue, whether it is lawful or unlawful. Having taken up that issue, they neither make each other understand nor come to an agreement; they neither persuade nor come to a resolution. Being without the strength of understanding, without the strength of resolution, and with no intention of relinquishing the dispute, they strongly and tenaciously cling to that very issue and assert: 'Only this is true, anything else is false.' This, monks, is called the assembly that speaks against the Dhamma.\n\nAnd what, monks, is the assembly that speaks in accordance with the Dhamma? Here, monks, in this assembly, monks take up an issue, whether it is lawful or unlawful. Having taken up that issue, they make each other understand and come to an agreement; they persuade and come to a resolution. Being endowed with the strength of understanding, with the strength of resolution, and with the intention of relinquishing the dispute, they do not strongly and tenaciously cling to that very issue and assert: 'Only this is true, anything else is false.' This, monks, is called the assembly that speaks in accordance with the Dhamma.\n\nThese, monks, are the two assemblies. Among these two assemblies, monks, the assembly that speaks in accordance with the Dhamma is considered the foremost.",
      "sinhala": "භික්ෂූනි, මේ සභා දෙකකි. ඒ දෙක කවරේද? අධම්මවාදී සභාවක් සහ ධම්මවාදී සභාවක් යනුයි.\n\nභික්ෂූනි, අධම්මවාදී සභාවක් නම් කවරේද? භික්ෂූනි, මෙහිලා යම් සභාවක් තුළ භික්ෂූන් ධර්මයට අනුකූල හෝ ධර්මයට අනුකූල නොවන අධිකරණයක් (භික්ෂූන් අතර ඇතිවන ආරවුලක්) පටන් ගනීද, ඔවුහු ඒ අධිකරණය පටන්ගෙන එකිනෙකාට අවබෝධ නොකරවති, අවබෝධයට නොපැමිණෙති, එකිනෙකාට වටහා නොදෙති, වටහාගැනීමට නොපැමිණෙති. ඔවුහු අවබෝධයෙහි බලය නැත්තාහු, නිශ්චිත විසඳුමෙහි බලය නැත්තාහු, (තම අදහස) අත්හැරීමට නොසිතන්නාහු වෙති. ඔවුහු ඒ අධිකරණය බලයෙන් හා මුරණ්ඩුකමෙන් තදින් අල්වාගෙන, 'මෙයම සත්‍යයයි, අන් සියල්ල බොරුයැ'යි කියා වදාරති. භික්ෂූනි, මෙය අධම්මවාදී සභාවක් යැයි කියනු ලැබේ.\n\nභික්ෂූනි, ධම්මවාදී සභාවක් නම් කවරේද? භික්ෂූනි, මෙහිලා යම් සභාවක් තුළ භික්ෂූන් ධර්මයට අනුකූල හෝ ධර්මයට අනුකූල නොවන අධිකරණයක් පටන් ගනීද, ඔවුහු ඒ අධිකරණය පටන්ගෙන එකිනෙකාට අවබෝධ කරවති, අවබෝධයටද පැමිණෙති, එකිනෙකාට වටහා දෙති, වටහාගැනීමටද පැමිණෙති. ඔවුහු අවබෝධයෙහි බලය ඇත්තාහු, නිශ්චිත විසඳුමෙහි බලය ඇත්තාහු, (තම අදහස) අත්හැරීමට සිතන්නාහු වෙති. ඔවුහු ඒ අධිකරණය බලයෙන් හා මුරණ්ඩුකමෙන් තදින් අල්වාගෙන, 'මෙයම සත්‍යයයි, අන් සියල්ල බොරුයැ'යි කියා වදාරන්නේ නැත. භික්ෂූනි, මෙය ධම්මවාදී සභාවක් යැයි කියනු ලැබේ. භික්ෂූනි, මේ සභා දෙකයි. භික්ෂූනි, මේ සභා දෙක අතුරින් ධම්මවාදී සභාව අග්‍ර වෙයි.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Parisavaggo pañcamo.Tassuddānaṃ – Uttānā vaggā aggavatī, ariyā kasaṭo ca pañcamo; Okkācitaāmisañceva, visamā adhammādhammiyena cāti.",
    "english": "The Fifth Chapter on Assemblies",
    "sinhala": "පස්වන පරිස වග්‍ගය"
  }
}