{
  "id": "an2.16",
  "title": {
    "pali": "Kodhapeyyālaṃ",
    "english": "The Full Section on Anger",
    "sinhala": "කෝධය පිළිබඳ පෙය්‍යාළය"
  },
  "sections": [
    {
      "number": 181,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Kodho ca upanāho ca…pe… makkho ca paḷāso [palāso (ka.)] ca… issā ca macchariyañca… māyā ca sāṭheyyañca… ahirikañca anottappañca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, these are two qualities. Which two? Anger and resentment; denigration and spite; envy and avarice; deceit and craftiness; shamelessness and lack of moral dread. These, monks, are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර‍්ම දෙකකි. කවරේද ඒ දෙක? ක‍්‍රෝධය ද උපනාහය ද, මක්ඛය ද පළාසය ද, ඊර්ෂ්‍යාව ද මසුරුකම ද, මායාව ද සාඨෙය්‍යය ද, අහිරිකය ද අනොත‍්තප්පය ද යන ධර‍්ම දෙකයි. මහණෙනි, මේ ධර‍්ම දෙකකි.",
      "paliTitle": ""
    },
    {
      "number": 182,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Akkodho ca anupanāho ca… amakkho ca apaḷāso ca… anissā ca amacchariyañca… amāyā ca asāṭheyyañca… hirī ca ottappañca. Ime kho, bhikkhave, dve dhammā’’.",
      "english": "Monks, there are these two qualities. Which two? Non-anger and non-resentment; non-disparagement and non-contempt; non-envy and non-stinginess; non-deceit and non-fraudulence; moral shame and moral dread. These, monks, are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්ම කරුණු දෙකකි. කවරේද ඒ දෙක? අක‍්‍රෝධය සහ අනුපනාහය, අමක්ඛය සහ අපළාසය, අනිස්සාය සහ අමච්ඡරියය, අමායාව සහ අසාඨෙය්‍යය, හිරිය සහ ඔත්තප්පය යන මේ ධර්ම කරුණු දෙකයි.",
      "paliTitle": ""
    },
    {
      "number": 183,
      "pali": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato dukkhaṃ viharati. Katamehi dvīhi? Kodhena ca upanāhena ca… makkhena ca paḷāsena ca… issāya ca macchariyena ca… māyāya ca sāṭheyyena ca… ahirikena ca anottappena ca. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato dukkhaṃ viharati’’.",
      "english": "Monks, one who is endowed with two qualities dwells in suffering. Which two? With anger and resentment; with disparagement and malignity; with envy and stinginess; with deceit and craftiness; with shamelessness and moral dreadlessness. Indeed, monks, one who is endowed with these two qualities dwells in suffering.",
      "sinhala": "මහණෙනි, කරුණු දෙකකින් යුක්ත වූ පුද්ගලයා දුකින් වාසය කරයි. කවර කරුණු දෙකකින් ද? ක්‍රෝධයෙන් ද, උපනාහයෙන් ද; මක්ඛයෙන් ද, පලාසයෙන් ද; ඊර්ෂ්‍යාවෙන් ද, මසුරුකමෙන් ද; මායාවෙන් ද, සාඨ්‍යයෙන් ද; අහිරිකයෙන් ද, අනෝතතප්පයෙන් ද. මහණෙනි, මෙවැනි කරුණු දෙකකින් යුක්ත වූ පුද්ගලයා දුකින් වාසය කරයි.",
      "paliTitle": ""
    },
    {
      "number": 184,
      "pali": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato sukhaṃ viharati. Katamehi dvīhi? Akkodhena ca anupanāhena ca… amakkhena ca apaḷāsena ca… anissāya ca amacchariyena ca… amāyāya ca asāṭheyyena ca … hiriyā ca ottappena ca. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato sukhaṃ viharati’’.",
      "english": "Bhikkhus, one who is endowed with two qualities lives happily. What are these two? They are: not being angry and not bearing resentment; not denigrating others and not being rivalrous; not being attached and not being selfish; not being deceitful and not being cunning; having moral shame and having moral dread. Indeed, Bhikkhus, one endowed with these two qualities lives happily.",
      "sinhala": "මහණෙනි, ධර්ම දෙකකින් සමන්විත වූයේ සැපසේ වාසය කරයි. කවර දෙකකින්ද? ක‍්‍රෝධ නොකිරීමෙන්ද, වෛර නොබැඳීමෙන්ද... අනුන්ගේ ගුණ නොමසුරුව දැකීමෙන්ද, ඊර්ෂ්‍යාවෙන් පෙළීමෙන් මිදීමෙන්ද... ඊර්ෂ්‍යා නොකිරීමෙන්ද, මසුරුකම නොකිරීමෙන්ද... වංචා නොකිරීමෙන්ද, කපටිකම් නොකිරීමෙන්ද... පව් කිරීමට ලැජ්ජාවෙන්ද, පව් කිරීමට බියෙන්ද යන ධර්ම දෙකිනි. මහණෙනි, මේ ධර්ම දෙකකින් සමන්විත වූයේ සැපසේ වාසය කරයි.",
      "paliTitle": ""
    },
    {
      "number": 185,
      "pali": "‘‘Dveme, bhikkhave, dhammā sekhassa bhikkhuno parihānāya saṃvattanti. Katame dve? Kodho ca upanāho ca… makkho ca paḷāso ca… issā ca macchariyañca… māyā ca sāṭheyyañca… ahirikañca anottappañca. Ime kho, bhikkhave, dve dhammā sekhassa bhikkhuno parihānāya saṃvattanti’’.",
      "english": "Monks, these two qualities lead to the decline of a trainee monk. Which two? Anger and resentment; denigration and rivalry; envy and stinginess; deceit and craftiness; shamelessness and unconscientiousness. Monks, these two qualities indeed lead to the decline of a trainee monk.",
      "sinhala": "මහණෙනි, සේඛ භික්ෂුවකගේ පිරිහීම පිණිස මේ ධර‍්ම දෙකක් පවතී.\nඒ දෙක කවරේද?\nකෝධයද, උපනාහයද… මක්ඛයද, පලාසයද… ඊර‍්ෂ්‍යාවද, මච්ඡරියයද… මායාවද, සාඨෙය්‍යයද… අහිරිකයද, අනොත්තප්පයද.\nමහණෙනි, සේඛ භික්ෂුවකගේ පිරිහීම පිණිස මේ ධර‍්ම දෙක පවතී.",
      "paliTitle": ""
    },
    {
      "number": 186,
      "pali": "‘‘Dveme, bhikkhave, dhammā sekhassa bhikkhuno aparihānāya saṃvattanti. Katame dve? Akkodho ca anupanāho ca… amakkho ca apaḷāso ca… anissā ca amacchariyañca… amāyā ca asāṭheyyañca… hirī ca ottappañca. Ime kho, bhikkhave, dve dhammā sekhassa bhikkhuno aparihānāya saṃvattanti’’.",
      "english": "Monks, these two qualities conduce to the non-decline of a trainee monk. Which two? Non-anger and the absence of resentment; the absence of denigration and the absence of rivalry; non-envy and the absence of stinginess; the absence of deceit and the absence of craftiness; moral shame and moral dread. Indeed, Monks, these two qualities conduce to the non-decline of a trainee monk.",
      "sinhala": "මහණෙනි, සේඛ භික්ෂුවකට පිරිහීමක් සිදු නොවීම පිණිස ධර්ම දෙකක් පවතී. ඒ මොන දෙකක්ද? අක්‍රෝධය සහ අනුපනාහය… අමක්ඛය සහ අපළාසය… අනිරිසියාව සහ අමච්ඡරියය… අමායාව සහ අසාඨෙය්‍යය… හිරිය සහ ඔත්තප්පය යන මේවායි. මහණෙනි, මේ ධර්ම දෙක සේඛ භික්ෂුවකට පිරිහීමක් සිදු නොවීම පිණිස පවතී.",
      "paliTitle": ""
    },
    {
      "number": 187,
      "pali": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye. Katamehi dvīhi? Kodhena ca upanāhena ca… makkhena ca paḷāsena ca… issāya ca macchariyena ca… māyāya ca sāṭheyyena ca… ahirikena ca anottappena ca. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ niraye’’.",
      "english": "Monks, one who is endowed with two qualities is consigned to hell as if directly brought there. Which two? With anger and resentment; with denigration and rivalry; with envy and stinginess; with deceit and fraud; with shamelessness and fearlessness of wrongdoing. Indeed, monks, one who is endowed with these two qualities is consigned to hell as if directly brought there.",
      "sinhala": "භික්ෂූනි, ධර්ම දෙකකින් සමන්වාගත වූ තැනැත්තා යම් සේ ගෙනැවිත් තැබුවාක් මෙන් නිරයේ වැටෙන්නේය. කවර ධර්ම දෙකකින්ද? ක්‍රෝධයෙන්ද, උපනාහයෙන්ද... මක්ඛයෙන්ද, පලාසයෙන්ද... ඉස්සාවෙන්ද, මච්ඡරියෙන්ද... මායාවෙන්ද, සාඨෙය්‍යයෙන්ද... අහිරිකයෙන්ද, අනොත්තප්පයෙන්ද යන ධර්ම දෙකිනි. භික්ෂූනි, මේ ධර්ම දෙකකින් සමන්වාගත වූ තැනැත්තා යම් සේ ගෙනැවිත් තැබුවාක් මෙන් නිරයේ වැටෙන්නේය.",
      "paliTitle": ""
    },
    {
      "number": 188,
      "pali": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge. Katamehi dvīhi? Akkodhena ca anupanāhena ca… amakkhena ca apaḷāsena ca… anissāya ca amacchariyena ca… amāyāya ca asāṭheyyena ca… hiriyā ca ottappena ca. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato yathābhataṃ nikkhitto evaṃ sagge’’.",
      "english": "Monks, one endowed with two qualities is placed in heaven just as if conveyed there. Which two? By absence of anger and absence of ill-will; by absence of denigration and absence of spite; by absence of envy and absence of stinginess; by absence of deceit and absence of craftiness; and by moral shame and moral dread. Indeed, monks, one endowed with these two qualities is placed in heaven just as if conveyed there.",
      "sinhala": "මහණෙනි, ධර්මයන් දෙකකින් යුක්ත වූ තැනැත්තා, හරියට ගෙනැවිත් තැබුවාක් මෙන් සුගතියෙහි උපදී. ඒ ධර්මයන් දෙක කවරේද යත්: අක්‍රෝධයෙන් සහ අනුපනාහයෙන්ද, අමක්ඛයෙන් (අනුන්ගේ ගුණ මකු නොකිරීමෙන්) සහ අපලාසයෙන්ද (ඊර්ෂ්‍යාවෙන් තොර බවින්), අනිස්සාවෙන් (ඊර්ෂ්‍යාවෙන් තොර බවින්) සහ අමච්ඡරියෙන්ද (මසුරුකමින් තොර බවින්), අමායාවෙන් (වංචාවෙන් තොර බවින්) සහ අසාඨේය්‍යයෙන්ද (කපටිකමින් තොර බවින්), හිරියෙන් (පව්කිරීමට ලජ්ජාවෙන්) සහ ඔතප්පයෙන්ද (පව්කිරීමට ඇති බියෙන්) යුක්ත වීමයි. මහණෙනි, නියත වශයෙන්ම, මේ ධර්මයන් දෙකකින් යුක්ත වූ තැනැත්තා හරියට ගෙනැවිත් තැබුවාක් මෙන් සුගතියෙහි උපදී.",
      "paliTitle": ""
    },
    {
      "number": 189,
      "pali": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato idhekacco kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati. Katamehi dvīhi? Kodhena ca upanāhena ca… makkhena ca paḷāsena ca… issāya ca macchariyena ca… māyāya ca sāṭheyyena ca… ahirikena ca anottappena ca. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato idhekacco kāyassa bhedā paraṃ maraṇā apāyaṃ duggatiṃ vinipātaṃ nirayaṃ upapajjati’’.",
      "english": "Endowed with two qualities, bhikkhus, a certain individual here, upon the breakup of the body, after death, is reborn into a state of woe, an unhappy destination, the lower realms, hell. With which two? With anger and resentment, a certain individual here, upon the breakup of the body, after death, is reborn into a state of woe, an unhappy destination, the lower realms, hell; with denigration and spite, a certain individual here, upon the breakup of the body, after death, is reborn into a state of woe, an unhappy destination, the lower realms, hell; with envy and stinginess, a certain individual here, upon the breakup of the body, after death, is reborn into a state of woe, an unhappy destination, the lower realms, hell; with deceit and fraud, a certain individual here, upon the breakup of the body, after death, is reborn into a state of woe, an unhappy destination, the lower realms, hell; with shamelessness and lack of moral dread, a certain individual here, upon the breakup of the body, after death, is reborn into a state of woe, an unhappy destination, the lower realms, hell. Indeed, bhikkhus, endowed with these two qualities, a certain individual here, upon the breakup of the body, after death, is reborn into a state of woe, an unhappy destination, the lower realms, hell.",
      "sinhala": "භික්ෂූනි, මේ ලෝකයේ සමහර පුද්ගලයෙක් ධර්ම දෙකකින් යුක්ත වූයේ, කය බිඳී යාමෙන්, මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරය යන අකුසලගාමී තත්ත්වයන්ට උපදී.\n\nකවර ධර්ම දෙකකින්ද?\n\nක්‍රෝධයෙන් ද උපනාහයෙන් ද... මක්ඛයෙන් ද පලාසයෙන් ද... ඊර්ෂ්‍යාවෙන් ද මසුරුකමෙන් ද... මායාවෙන් ද සාඨේය්‍යයෙන් ද... අහිරිකයෙන් ද අනෝතප්පයෙන් ද.\n\nභික්ෂූනි, මේ ධර්ම දෙකෙන් ම යුක්ත වූ ඇතැම් පුද්ගලයෙක් කය බිඳී යාමෙන්, මරණයෙන් පසුව අපාය, දුගති, විනිපාත, නිරය යන අකුසලගාමී තත්ත්වයන්ට උපදී.",
      "paliTitle": ""
    },
    {
      "number": 190,
      "pali": "‘‘Dvīhi, bhikkhave, dhammehi samannāgato idhekacco kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati. Katamehi dvīhi? Akkodhena ca anupanāhena ca… amakkhena ca apaḷāsena ca… anissāya ca amacchariyena ca… amāyāya ca asāṭheyyena ca… hiriyā ca ottappena ca. Imehi kho, bhikkhave, dvīhi dhammehi samannāgato idhekacco kāyassa bhedā paraṃ maraṇā sugatiṃ saggaṃ lokaṃ upapajjati’’. ",
      "english": "Monks, some individual here, endowed with two qualities, at the dissolution of the body, after death, reappears in a good destination, a heavenly world. Which two? With non-anger and non-resentment; with non-denigration and non-envy; with non-possessiveness and non-miserliness; with non-deceit and non-fraudulence; with moral shame and moral dread. Monks, some individual here, endowed with these two qualities, at the dissolution of the body, after death, reappears in a good destination, a heavenly world.",
      "sinhala": "මහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් ධර්ම දෙකකින් සමන්විත වූයේ, ශරීරය බිඳී යාමෙන්, මරණයෙන් පසුව සුගතියට, ස්වර්ග ලෝකයට උපදී.\n\nඒ දෙක කවරේද?\n\nක‍්‍රෝධයෙන් තොරවීමෙන් සහ උපානාහයෙන් තොරවීමෙන් ද; මාක්ඛයෙන් තොරවීමෙන් සහ පළාසයෙන් තොරවීමෙන් ද; ඊර්ෂ‍්‍යාවෙන් තොරවීමෙන් සහ මසුරුකමෙන් තොරවීමෙන් ද; මායාවෙන් තොරවීමෙන් සහ සාඨ‍්‍යයෙන් තොරවීමෙන් ද; හිරියෙන් සහ ඔතප්පයෙන් යුක්ත වීමෙන් ද යන මේ ධර්ම දෙකෙනි.\n\nමහණෙනි, මෙලොව ඇතැම් පුද්ගලයෙක් මේ ධර්ම දෙකකින් සමන්විත වූයේ, ශරීරය බිඳී යාමෙන්, මරණයෙන් පසුව සුගතියට, ස්වර්ග ලෝකයට උපදී.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Kodhapeyyālaṃ niṭṭhitaṃ.",
    "english": "Anger Formulae Concluded",
    "sinhala": "ක්‍රෝධ වග්ගය අවසන්."
  }
}