{
  "id": "an2.9",
  "title": {
    "pali": "Dhammavaggo",
    "english": "The Chapter on Dhamma",
    "sinhala": "ධර්‍ම වග්ගය"
  },
  "sections": [
    {
      "number": 88,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Cetovimutti ca paññāvimutti ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monastics, there are these two modes. Which two? Mind-liberation and wisdom-liberation. These, monastics, are indeed the two modes.",
      "sinhala": "මහණෙනි, මේ ධර්ම දෙකකි. ඒ දෙක කවරේද? චේතෝවිමුක්තිය සහ ප්‍රඥාවිමුක්තියයි. මහණෙනි, මේ ධර්ම දෙක නම් මේවාමය.",
      "paliTitle": ""
    },
    {
      "number": 89,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Paggāho ca avikkhepo ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, there are these two qualities. Which two? Exertion and non-distraction. These, indeed, monks, are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්මයන් දෙකකි. කවර දෙකක්ද? ප්‍රග්‍රහය ද, අවික්ඛේපය ද (යන මේ දෙකයි). මහණෙනි, සැබවින්ම මේ ධර්මයන් දෙකයි.",
      "paliTitle": ""
    },
    {
      "number": 90,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Nāmañca rūpañca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, these are two phenomena. Which two? Mentality and materiality. Indeed, monks, these are the two phenomena.",
      "sinhala": "භික්ෂූනි, ධර්ම දෙකක් ඇත. කවර දෙකක්ද? නාමයත්, රූපයත් ය. භික්ෂූනි, මේවාමයි ඒ ධර්ම දෙක.",
      "paliTitle": ""
    },
    {
      "number": 91,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Vijjā ca vimutti ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, there are these two qualities. Which two? True knowledge and liberation. These, monks, are indeed the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්ම දෙකකි. ඒ කවර දෙකක්ද යත්? විද්‍යාව සහ විමුක්තියයි. මහණෙනි, මේ ධර්ම දෙකයි.",
      "paliTitle": ""
    },
    {
      "number": 92,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Bhavadiṭṭhi ca vibhavadiṭṭhi ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, there are these two principles. Which two? The view of eternal existence and the view of annihilation. Indeed, monks, these are the two principles.",
      "sinhala": "මහණෙනි, මේ ධර්ම කාරණා දෙකකි. කවර දෙකක්ද යත්: භව දෘෂ්ටිය සහ විභව දෘෂ්ටිය යි. මහණෙනි, මේ ධර්ම කාරණා දෙක මේවා යි.",
      "paliTitle": ""
    },
    {
      "number": 93,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Ahirikañca anottappañca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, there are these two qualities. Which two? Shamelessness and lack of moral dread. Indeed, monks, these are the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්‍මතා දෙකකි. ඒ කවර දෙකක්ද? අහිරිකය සහ අනොත්තප්පය යන දෙකයි. මහණෙනි, මේ ධර්‍මතා දෙක නම් මේවායයි.",
      "paliTitle": ""
    },
    {
      "number": 94,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Hirī ca ottappañca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, there are these two qualities. Which two? Moral shame and moral dread. Indeed, monks, these are the two qualities.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ධර්ම දෙකකි. ඒ දෙක කවරේද? පව්කිරීමට ඇති ලැජ්ජාව සහ පව්කිරීමේ විපාකවලට ඇති බිය යනුයි. භික්ෂූන් වහන්ස, මේ ධර්ම දෙක මේවාමයි.",
      "paliTitle": ""
    },
    {
      "number": 95,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Dovacassatā ca pāpamittatā ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, these are two qualities. Which two? Intractability and bad companionship. Monks, these are indeed these two qualities.",
      "sinhala": "භික්ෂූන් වහන්ස, මේ ධර්ම කාරණා දෙකකි.\nඒ දෙක කුමක්ද?\nඅනුශාසනා නොපිළිගැනීම හෙවත් අවවාදයට අකීකරු භාවය සහ පවිටු මිත්‍රයන් ඇසුරු කිරීමයි.\nභික්ෂූන් වහන්ස, මේ ධර්ම කාරණා දෙක නම් මේවාමයි.",
      "paliTitle": ""
    },
    {
      "number": 96,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Sovacassatā ca kalyāṇamittatā ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, these are the two qualities. Which two? Amenability to correction and good friendship. These, monks, are the two qualities.",
      "sinhala": "භික්ෂූණි, මේ ධර්ම දෙකකි. ඒ දෙක කුමක්ද? අනුශාසනා පිළිගැනීමට පහසු බව (සෝවචස්සතා) සහ යහපත් මිත්‍ර‌ත්වය (කල්‍යාණමිත්‍රතා) යි. භික්ෂූණි, මේ ධර්ම දෙක මෙයයි.",
      "paliTitle": ""
    },
    {
      "number": 97,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Dhātukusalatā ca manasikārakusalatā ca. Ime kho, bhikkhave, dve dhammā’’ti.",
      "english": "Monks, there are these two qualities. Which two? Skillfulness regarding elements, and skillfulness regarding the application of mind. These, monks, are indeed the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්‍ම කාරණා දෙකකි. කවර දෙකක්ද? ධාතුකුසලතාවයත්, මනසිකාරකුසලතාවයත් යනුයි. මහණෙනි, මේ ධර්‍ම කාරණා දෙක නම් මේවාමය.",
      "paliTitle": ""
    },
    {
      "number": 98,
      "pali": "‘‘Dveme, bhikkhave, dhammā. Katame dve? Āpattikusalatā ca āpattivuṭṭhānakusalatā ca. Ime kho, bhikkhave, dve dhammā’’ti. ",
      "english": "Monastics, there are these two qualities. Which two? Skill in discerning offenses and skill in rectifying offenses. Monastics, these are indeed the two qualities.",
      "sinhala": "මහණෙනි, මේ ධර්ම කරුණු දෙකකි. ඒ දෙක කවරේද? ආපත්ති පිළිබඳ කුසලතාවය ද, ආපත්ති වලින් නැඟී සිටීම පිළිබඳ කුසලතාවය ද වේ. මහණෙනි, මේ ධර්ම කරුණු දෙක නම් මේවායි.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Dhammavaggo catuttho.",
    "english": "",
    "sinhala": ""
  }
}