{
  "id": "an2.4",
  "title": {
    "pali": "Samacittavaggo",
    "english": "The Chapter on Mental Equanimity",
    "sinhala": "සමභාවී සිත වග්ගය"
  },
  "sections": [
    {
      "number": 33,
      "pali": "‘‘Asappurisabhūmiñca vo, bhikkhave, desessāmi sappurisabhūmiñca. Taṃ suṇātha, sādhukaṃ manasi karotha. Bhāsissāmī’’ti. ‘‘Evaṃ, bhante’’ti kho te bhikkhū bhagavato paccassosuṃ. Bhagavā etadavoca – ‘‘Katamā ca, bhikkhave, asappurisabhūmi? Asappuriso, bhikkhave, akataññū hoti akatavedī. Asabbhi hetaṃ, bhikkhave, upaññātaṃ yadidaṃ akataññutā akataveditā. Kevalā esā, bhikkhave, asappurisabhūmi yadidaṃ akataññutā akataveditā. Sappuriso ca kho, bhikkhave, kataññū hoti katavedī. Sabbhi hetaṃ, bhikkhave, upaññātaṃ yadidaṃ kataññutā kataveditā. Kevalā esā, bhikkhave, sappurisabhūmi yadidaṃ kataññutā kataveditā’’ti.",
      "english": "“Monks, I will teach you the realm of the ignoble and the realm of the noble. Listen to that, pay close attention. I will speak.” “Yes, Venerable Sir,” those monks replied to the Blessed One. The Blessed One spoke thus: “And what, monks, is the realm of the ignoble? Monks, an ignoble person is ungrateful and unappreciative of kindness shown. Monks, this — ingratitude and unappreciation of kindness — is recognized by the ignoble. Monks, this — ingratitude and unappreciation of kindness — is the entire realm of the ignoble. But monks, a noble person is grateful and appreciative of kindness shown. Monks, this — gratitude and appreciation of kindness — is recognized by the noble. Monks, this — gratitude and appreciation of kindness — is the entire realm of the noble.”",
      "sinhala": "‘‘මහණෙනි, මම ඔබට අසත්පුරුෂ භූමියද, සත්පුරුෂ භූමියද දේශනා කරන්නෙමි. එය අසන්න. හොඳින් මෙනෙහි කරන්න. මම දේශනා කරන්නෙමි.’’\n‘‘එසේය, භාග්‍යවතුන් වහන්සැ’’යි ඒ භික්ෂූහු භාග්‍යවතුන් වහන්සේට පිළිතුරු දුන්නාහුය. භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක:\n\n‘‘මහණෙනි, අසත්පුරුෂ භූමිය නම් කවරේද? මහණෙනි, අසත්පුරුෂයා අකෘතඥයෙක් වෙයි, අකෘතවේදියෙක් වෙයි. මහණෙනි, මේ අකෘතඥතාවයත්, අකෘතවේදීභාවයත් අසත්පුරුෂයන් විසින් පිළිගත් ධර්මයකි. මහණෙනි, මේ අකෘතඥතාවයත්, අකෘතවේදීභාවයත් අසත්පුරුෂ භූමියම වෙයි.\n\nමහණෙනි, සත්පුරුෂයා නම් කෘතඥයෙක් වෙයි, කෘතවේදියෙක් වෙයි. මහණෙනි, මේ කෘතඥතාවයත්, කෘතවේදීභාවයත් සත්පුරුෂයන් විසින් පිළිගත් ධර්මයකි. මහණෙනි, මේ කෘතඥතාවයත්, කෘතවේදීභාවයත් සත්පුරුෂ භූමියම වෙයි.’’",
      "paliTitle": ""
    },
    {
      "number": 34,
      "pali": "‘‘Dvinnāhaṃ, bhikkhave, na suppatikāraṃ vadāmi. Katamesaṃ dvinnaṃ? Mātu ca pitu ca. Ekena, bhikkhave, aṃsena mātaraṃ parihareyya, ekena aṃsena pitaraṃ parihareyya vassasatāyuko vassasatajīvī so ca nesaṃ ucchādanaparimaddananhāpanasambāhanena. Te ca tattheva muttakarīsaṃ cajeyyuṃ. Na tveva, bhikkhave, mātāpitūnaṃ kataṃ vā hoti paṭikataṃ vā. Imissā ca, bhikkhave, mahāpathaviyā pahūtarattaratanāya [pahūtasattaratanāya (sī. syā. kaṃ. pī.) tikanipāte mahāvagge dasamasuttaṭīkāyaṃ dassitapāḷiyā sameti] mātāpitaro issarādhipacce rajje patiṭṭhāpeyya, na tveva, bhikkhave, mātāpitūnaṃ kataṃ vā hoti paṭikataṃ vā. Taṃ kissa hetu? Bahukārā [bahūpakārā (ka.)], bhikkhave, mātāpitaro puttānaṃ āpādakā posakā imassa lokassa dassetāro. Yo ca kho, bhikkhave, mātāpitaro assaddhe saddhāsampadāya samādapeti niveseti patiṭṭhāpeti, dussīle sīlasampadāya samādapeti niveseti patiṭṭhāpeti, maccharī cāgasampadāya samādapeti niveseti patiṭṭhāpeti, duppaññe paññāsampadāya samādapeti niveseti patiṭṭhāpeti, ettāvatā kho, bhikkhave, mātāpitūnaṃ katañca hoti paṭikatañcā’’ti [paṭikatañca atikatañcāti (sī. pī.)].",
      "english": "Monks, I declare that for two, no adequate requital can be made. Which two? Mother and father. Monks, if one were to carry one's mother on one shoulder and one's father on the other shoulder, living for a hundred years, surviving for a hundred years, and even if one were to attend to them by anointing, massaging, bathing, and rubbing them, and even if they were to void urine and feces upon him there, even so, Monks, that would not have done enough for mothers and fathers, nor would it be a sufficient requital. Furthermore, Monks, even if one were to establish one's mother and father in sovereign rule and dominion over this great earth, rich with abundant treasures and precious jewels, even so, Monks, that would not have done enough for mothers and fathers, nor would it be a sufficient requital. Why is that? Because, Monks, mothers and fathers are of great help to their children; they are nurturers, sustainers, and introducers to this world. However, Monks, if someone encourages, establishes, and grounds their faithless mother and father in the accomplishment of faith; if they encourage, establish, and grounds their immoral mother and father in the accomplishment of virtue; if they encourage, establish, and grounds their stingy mother and father in the accomplishment of generosity; if they encourage, establish, and grounds their unwise mother and father in the accomplishment of wisdom – by this much, Monks, is a mother and father truly helped and fully requited.",
      "sinhala": "මහණෙනි, දෙදෙනෙකුට ප්‍රමාණවත් ප්‍රතිඋපකාරයක් කළ නොහැකි බව මම පවසමි. ඒ දෙදෙනා කවරහුද? මව සහ පියා ය.\n\nමහණෙනි, යම් පුද්ගලයෙක් අවුරුදු සියයක් ජීවත් වී, අවුරුදු සියයක්ම එක උරහිසකින් මව ද, අනෙක් උරහිසින් පියා ද, රැගෙන ඇඟපත පිරිමැදීමෙන් ද, සම්බාහනය කිරීමෙන් ද, ස්නානය කරවීමෙන් ද උපස්ථාන කරයි නම්. ඔවුහු එහිදී ම මුත්‍ර සහ මළපහ කළාහු ද විය හැකිය. එහෙත් මහණෙනි, මවට සහ පියාට කළ උපකාරය ප්‍රමාණවත් ප්‍රතිඋපකාරයක් හෝ සම්පූර්ණ උපකාරයක් හෝ වන්නේ නැත. මහණෙනි, යමෙක් මේ මහපොළොවේ ඇති අනර්ඝ රත්නයන්ගෙන් සපිරි මහා රාජ්‍යයකට මව සහ පියා අධිපතිත්වයේ තබා, රජුන් බවට පත් කළ ද, එහෙත් මහණෙනි, මවට සහ පියාට කළ උපකාරය ප්‍රමාණවත් ප්‍රතිඋපකාරයක් හෝ සම්පූර්ණ උපකාරයක් හෝ වන්නේ නැත.\n\nඑයට හේතුව කුමක්ද? මහණෙනි, මව සහ පියා දරුවන්ට මහත් උපකාර කළෝ වෙති. ඔවුහු දරුවන් මෙලොවට බිහි කළෝ ද, පෝෂණය කළෝ ද, මේ ලෝකය හඳුන්වා දුන්නෝ ද වෙති.\n\nමහණෙනි, යමෙක් අවිශ්වාසවන්ත වූ තම මව සහ පියා ශ්‍රද්ධාසම්පදාවෙන් යුක්තවීමට සලස්වා, එහි පිහිටුවා, මුල් බැස ගන්වයි ද; දුස්සීල වූ තම මව සහ පියා සීලසම්පදාවෙන් යුක්තවීමට සලස්වා, එහි පිහිටුවා, මුල් බැස ගන්වයි ද; මසුරු වූ තම මව සහ පියා ත්‍යාගසම්පදාවෙන් යුක්තවීමට සලස්වා, එහි පිහිටුවා, මුල් බැස ගන්වයි ද; ප්‍රඥාවෙන් අඩු වූ තම මව සහ පියා ප්‍රඥාසම්පදාවෙන් යුක්තවීමට සලස්වා, එහි පිහිටුවා, මුල් බැස ගන්වයි ද; මහණෙනි, මෙපමණකින් තම මවට සහ පියාට උපකාර කරනු ලැබූවක් ද වේ, ප්‍රතිඋපකාර කරනු ලැබූවක් ද වේ.",
      "paliTitle": ""
    },
    {
      "number": 35,
      "pali": "Atha kho aññataro brāhmaṇo yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavatā saddhiṃ sammodi. Sammodanīyaṃ kathaṃ…pe… ekamantaṃ nisinno kho so brāhmaṇo bhagavantaṃ etadavoca – ‘‘kiṃvādī bhavaṃ gotamo kimakkhāyī’’ti? ‘‘Kiriyavādī cāhaṃ, brāhmaṇa, akiriyavādī cā’’ti. ‘‘Yathākathaṃ pana bhavaṃ gotamo kiriyavādī ca akiriyavādī cā’’ti? ‘‘Akiriyaṃ kho ahaṃ, brāhmaṇa, vadāmi kāyaduccaritassa vacīduccaritassa manoduccaritassa, anekavihitānaṃ pāpakānaṃ akusalānaṃ dhammānaṃ akiriyaṃ vadāmi. Kiriyañca kho ahaṃ, brāhmaṇa, vadāmi kāyasucaritassa vacīsucaritassa manosucaritassa, anekavihitānaṃ kusalānaṃ dhammānaṃ kiriyaṃ vadāmi. Evaṃ kho ahaṃ, brāhmaṇa, kiriyavādī ca akiriyavādī cā’’ti. ‘‘Abhikkantaṃ, bho gotama…pe… upāsakaṃ maṃ bhavaṃ gotamo dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Then a certain brahmin approached the Blessed One. Having approached, he exchanged courteous greetings with the Blessed One. After an exchange of polite and cordial talk, he sat down to one side. Sitting to one side, that brahmin said to the Blessed One, \"What does Master Gotama proclaim? What does he teach?\"\n\n\"I am a proponent of action, brahmin, and a proponent of non-action.\"\n\n\"How, then, is Master Gotama a proponent of action and a proponent of non-action?\"\n\n\"I, brahmin, proclaim the non-performance of misconduct by body, misconduct by speech, and misconduct by mind. I proclaim the non-performance of various evil and unwholesome states. And I, brahmin, proclaim the performance of good conduct by body, good conduct by speech, and good conduct by mind. I proclaim the performance of various wholesome states. It is in this way, brahmin, that I am a proponent of action and a proponent of non-action.\"\n\n\"Excellent, Master Gotama! Excellent! Just as one might set upright what had been overturned, reveal what was hidden, show the way to one who was lost, or hold up a lamp in the dark so that those with eyes could see forms; in the same way, Master Gotama has made the Dhamma clear in many ways. I go for refuge to Master Gotama, to the Dhamma, and to the Saṅgha of bhikkhus. May Master Gotama accept me as a lay follower who has taken refuge from this day forth for as long as life lasts.\"",
      "sinhala": "ඉන්පසු එක්තරා බ්‍රාහ්මණයෙක් භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය; පැමිණ භාග්‍යවතුන් වහන්සේ සමඟ සතුටු විය. සතුටු සාකච්ඡා පවත්වා අවසන, ඒ බ්‍රාහ්මණයා එක් පසෙක වාඩි වී භාග්‍යවතුන් වහන්සේට මෙසේ කීවේය: \"ගෞතමයන් වහන්සේ කුමන වාදයක් දරන සේක්ද? කුමක් දේශනා කරන සේක්ද?\" \"බ්‍රාහ්මණය, මම ක්‍රියාවාදියෙක්ද වෙමි, අක්‍රියාවාදියෙක්ද වෙමි.\" \"එසේනම් ගෞතමයන් වහන්සේ කෙසේ නම් ක්‍රියාවාදියෙක්ද, අක්‍රියාවාදියෙක්ද වන්නේ?\" \"බ්‍රාහ්මණය, මම කාය දුශ්චරිතයේ, වචී දුශ්චරිතයේ, මනෝ දුශ්චරිතයේ, තවද බොහෝ ආකාරයේ පාපී අකුසල ධර්මයන්ගේ නොකිරීම (අක්‍රියාව) දේශනා කරමි. බ්‍රාහ්මණය, කාය සුචරිතයේ, වචී සුචරිතයේ, මනෝ සුචරිතයේ, තවද බොහෝ ආකාරයේ කුසල ධර්මයන්ගේ කිරීම (ක්‍රියාව) මම දේශනා කරමි. බ්‍රාහ්මණය, මම මෙසේ ක්‍රියාවාදියෙක්ද, අක්‍රියාවාදියෙක්ද වෙමි.\" \"අතිශය යහපත්ය, ගෞතමයන් වහන්ස! අතිශය යහපත්ය, ගෞතමයන් වහන්ස! යම්සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසන ලද දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මග පෙන්වන්නේද, අඳුරෙහි තෙල් පහනක් දරන්නේද, එසේම ගෞතමයන් වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය දේශනා කරන ලද්දේය. අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස මා භාග්‍යවතුන් වහන්සේ සලකන සේක්වා!\"",
      "paliTitle": ""
    },
    {
      "number": 36,
      "pali": "Atha kho anāthapiṇḍiko gahapati yena bhagavā tenupasaṅkami; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho anāthapiṇḍiko gahapati bhagavantaṃ etadavoca – ‘‘kati nu kho, bhante, loke dakkhiṇeyyā, kattha ca dānaṃ dātabba’’nti? ‘‘Dve kho, gahapati, loke dakkhiṇeyyā – sekho ca asekho ca. Ime kho, gahapati, dve loke dakkhiṇeyyā, ettha ca dānaṃ dātabba’’nti. Idamavoca bhagavā. Idaṃ vatvāna [vatvā (sī. pī.) evamīdisesu ṭhānesu] sugato athāparaṃ etadavoca satthā – ‘‘Sekho asekho ca imasmiṃ loke, Āhuneyyā yajamānānaṃ honti; Te ujjubhūtā [ujubhūtā (syā. kaṃ. ka.)] kāyena, vācāya uda cetasā; Khettaṃ taṃ yajamānānaṃ, ettha dinnaṃ mahapphala’’nti.",
      "english": "Then the householder Anathapindika approached the Blessed One. Having approached and paid homage to the Blessed One, he sat down to one side. Seated to one side, the householder Anathapindika said to the Blessed One: \"Venerable Sir, how many types of individuals in the world are truly worthy of offerings, and to whom should gifts be given?\" \"Householder, there are indeed two types of individuals in the world worthy of offerings: the trainee and one beyond training. These, householder, are the two types of individuals in the world worthy of offerings, and to them should gifts be given.\" The Blessed One said this. Having said this, the Fortunate One, the Teacher, then spoke further:\n\n\"The trainee and one beyond training in this world\nTruly become worthy of sacrificial offerings for those who give.\nThey, having become utterly upright in body, speech, and mind,\nAre indeed a field for those who give, and what is given there yields great fruit.\"",
      "sinhala": "ඉන්පසු අනාථපිණ්ඩික ගෘහපතිතුමා භාග්‍යවතුන් වහන්සේ වෙත පැමිණියේය. පැමිණ භාග්‍යවතුන් වහන්සේට වන්දනා කර එකත්පසෙකින් වාඩි විය. එකත්පසෙකින් වාඩි වී සිටි අනාථපිණ්ඩික ගෘහපතිතුමා භාග්‍යවතුන් වහන්සේට මෙසේ පැවසීය: \"භාග්‍යවතුන් වහන්ස, ලෝකයෙහි දක්ෂිණාර්හ පුද්ගලයෝ කී දෙනෙක්ද? දානය දිය යුත්තේ කොතැනකද?\" \"ගෘහපති, ලෝකයෙහි දක්ෂිණාර්හ පුද්ගලයෝ දෙදෙනෙක් වෙති. එනම් ශෛක්ෂ පුද්ගලයා සහ අශෛක්ෂ පුද්ගලයා යන දෙදෙනාය. ගෘහපති, ලෝකයෙහි මේ දෙදෙනාම දක්ෂිණාර්හ පුද්ගලයෝ වෙති. දානය දිය යුත්තේ මොවුන්ටය.\" භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක. සුගත වූ ඒ ශාස්තෘන් වහන්සේ මෙය වදාරා තවදුරටත් මෙසේ වදාළ සේක:\n\n\"මේ ලෝකයෙහි ශෛක්ෂ පුද්ගලයා ද, අශෛක්ෂ පුද්ගලයා ද,\nපූජා කරන්නන්ට ආහුණෙය්‍ය (පිළිගැන්වීම්වලට සුදුසු) වෙති;\nඔවුහු කයින් ද, වචනයෙන් ද, සිතින් ද සෘජු බවට පත්වූවෝ වෙති;\nඔවුහු පූජා කරන්නන්ට (මහත්ඵල දෙන) ක්ෂේත්‍රයක් වෙති.\nමොවුන් වෙත දෙන ලද දානය මහාඵල ඇත්තේය.\"",
      "paliTitle": ""
    },
    {
      "number": 37,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ bhagavā sāvatthiyaṃ viharati jetavane anāthapiṇḍikassa ārāme. Tena kho pana samayena āyasmā sāriputto sāvatthiyaṃ viharati pubbārāme migāramātupāsāde. Tatra kho āyasmā sāriputto bhikkhū āmantesi – ‘‘āvuso bhikkhave’’ti. ‘‘Āvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘ajjhattasaṃyojanañca, āvuso, puggalaṃ desessāmi bahiddhāsaṃyojanañca. Taṃ suṇātha, sādhukaṃ manasi karotha; bhāsissāmī’’ti. ‘‘Evamāvuso’’ti kho te bhikkhū āyasmato sāriputtassa paccassosuṃ. Āyasmā sāriputto etadavoca – ‘‘Katamo cāvuso, ajjhattasaṃyojano puggalo? Idhāvuso, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. So kāyassa bhedā paraṃ maraṇā aññataraṃ devanikāyaṃ upapajjati. So tato cuto āgāmī hoti, āgantā itthattaṃ. Ayaṃ vuccati, āvuso, ajjhattasaṃyojano puggalo āgāmī hoti, āgantā itthattaṃ. ‘‘Katamo cāvuso, bahiddhāsaṃyojano puggalo? Idhāvuso, bhikkhu sīlavā hoti, pātimokkhasaṃvarasaṃvuto viharati ācāragocarasampanno, aṇumattesu vajjesu bhayadassāvī, samādāya sikkhati sikkhāpadesu. So aññataraṃ santaṃ cetovimuttiṃ upasampajja viharati. So kāyassa bhedā paraṃ maraṇā aññataraṃ devanikāyaṃ upapajjati. So tato cuto anāgāmī hoti, anāgantā itthattaṃ. Ayaṃ vuccatāvuso, bahiddhāsaṃyojano puggalo anāgāmī hoti, anāgantā itthattaṃ. ‘‘Puna caparaṃ, āvuso, bhikkhu sīlavā hoti…pe… samādāya sikkhati sikkhāpadesu. So kāmānaṃyeva nibbidāya virāgāya nirodhāya paṭipanno hoti. So bhavānaṃyeva nibbidāya virāgāya nirodhāya paṭipanno hoti. So taṇhākkhayāya paṭipanno hoti. So lobhakkhayāya paṭipanno hoti. So kāyassa bhedā paraṃ maraṇā aññataraṃ devanikāyaṃ upapajjati. So tato cuto anāgāmī hoti, anāgantā itthattaṃ. Ayaṃ vuccatāvuso, bahiddhāsaṃyojano puggalo anāgāmī hoti, anāgantā itthatta’’nti. Atha kho sambahulā samacittā devatā yena bhagavā tenupasaṅkamiṃsu; upasaṅkamitvā bhagavantaṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho tā devatā bhagavantaṃ etadavocuṃ – ‘‘eso, bhante, āyasmā sāriputto pubbārāme migāramātupāsāde bhikkhūnaṃ ajjhattasaṃyojanañca puggalaṃ deseti bahiddhāsaṃyojanañca. Haṭṭhā, bhante, parisā. Sādhu, bhante, bhagavā yenāyasmā sāriputto tenupasaṅkamatu anukampaṃ upādāyā’’ti. Adhivāsesi bhagavā tuṇhībhāvena. Atha kho bhagavā – seyyathāpi nāma balavā puriso samiñjitaṃ [sammiñjitaṃ (sī. syā. kaṃ. pī.)] vā bāhaṃ pasāreyya, pasāritaṃ vā bāhaṃ samiñjeyya, evamevaṃ – jetavane antarahito pubbārāme migāramātupāsāde āyasmato sāriputtassa sammukhe pāturahosi. Nisīdi bhagavā paññatte āsane. Āyasmāpi kho sāriputto bhagavantaṃ abhivādetvā ekamantaṃ nisīdi. Ekamantaṃ nisinnaṃ kho āyasmantaṃ sāriputtaṃ bhagavā etadavoca – ‘‘Idha, sāriputta, sambahulā samacittā devatā yenāhaṃ tenupasaṅkamiṃsu; upasaṅkamitvā maṃ abhivādetvā ekamantaṃ aṭṭhaṃsu. Ekamantaṃ ṭhitā kho, sāriputta, tā devatā maṃ etadavocuṃ – ‘eso, bhante, āyasmā sāriputto pubbārāme migāramātupāsāde bhikkhūnaṃ ajjhattasaṃyojanañca puggalaṃ deseti bahiddhāsaṃyojanañca. Haṭṭhā, bhante, parisā. Sādhu, bhante, bhagavā yena āyasmā sāriputto tenupasaṅkamatu anukampaṃ upādāyā’ti. Tā kho pana, sāriputta, devatā dasapi hutvā vīsampi hutvā tiṃsampi hutvā cattālīsampi hutvā paññāsampi hutvā saṭṭhipi hutvā āraggakoṭinitudanamattepi tiṭṭhanti, na ca aññamaññaṃ byābādhenti [byābādhentīti (sabbattha)]. Siyā kho pana [pana te (sī. syā. kaṃ. pī.)], sāriputta, evamassa – ‘tattha nūna tāsaṃ devatānaṃ tathā cittaṃ bhāvitaṃ yena tā devatā dasapi hutvā vīsampi hutvā tiṃsampi hutvā cattālīsampi hutvā paññāsampi hutvā saṭṭhipi hutvā āraggakoṭinitudanamattepi tiṭṭhanti na ca aññamaññaṃ byābādhentī’ti. Na kho panetaṃ, sāriputta, evaṃ daṭṭhabbaṃ. Idheva kho, sāriputta, tāsaṃ devatānaṃ tathā cittaṃ bhāvitaṃ, yena tā devatā dasapi hutvā…pe… na ca aññamaññaṃ byābādhenti. Tasmātiha, sāriputta, evaṃ sikkhitabbaṃ – ‘santindriyā bhavissāma santamānasā’ti. Evañhi vo, sāriputta, sikkhitabbaṃ. ‘Santindriyānañhi vo, sāriputta, santamānasānaṃ santaṃyeva kāyakammaṃ bhavissati santaṃ vacīkammaṃ santaṃ manokammaṃ. Santaṃyeva upahāraṃ upaharissāma sabrahmacārīsū’ti. ‘Evañhi vo, sāriputta, sikkhitabbaṃ. Anassuṃ kho, sāriputta, aññatitthiyā paribbājakā ye imaṃ dhammapariyāyaṃ nāssosu’’’nti.",
      "english": "Thus have I heard – on one occasion the Blessed One was staying in Sāvatthī, at Jetavana, Anāthapiṇḍika’s monastery. Now on that occasion, the Venerable Sāriputta was staying in Sāvatthī, at the Eastern Park, Migāra’s Mother’s Mansion. There the Venerable Sāriputta addressed the bhikkhus, saying: “Friends, bhikkhus!” Those bhikkhus replied to the Venerable Sāriputta, “Friend!” The Venerable Sāriputta spoke thus: “Friends, I will teach about the person bound by internal fetters and the person bound by external fetters. Listen to that, attend carefully; I shall speak.” “Yes, friend,” those bhikkhus replied to the Venerable Sāriputta. The Venerable Sāriputta spoke thus: “And what kind of person, friends, is bound by internal fetters? Here, friends, a bhikkhu is virtuous, he dwells restrained by the Pāṭimokkha, perfect in conduct and resort, seeing danger in the slightest faults, and undertaking the training in the training rules. Upon the breakup of the body, after death, he reappears in a certain divine company. Having passed away from there, he is a 'comer back', one who will return to this state of being. This, friends, is called the person bound by internal fetters, who is a 'comer back', one who will return to this state of being.”\n\n“And what kind of person, friends, is bound by external fetters? Here, friends, a bhikkhu is virtuous, he dwells restrained by the Pāṭimokkha, perfect in conduct and resort, seeing danger in the slightest faults, and undertaking the training in the training rules. He enters upon and dwells in a certain tranquil liberation of mind. Upon the breakup of the body, after death, he reappears in a certain divine company. Having passed away from there, he is a 'non-comer back', one who will not return to this state of being. This, friends, is called the person bound by external fetters, who is a 'non-comer back', one who will not return to this state of being.”\n\n“Furthermore, friends, a bhikkhu is virtuous, he dwells restrained by the Pāṭimokkha, perfect in conduct and resort, seeing danger in the slightest faults, and undertaking the training in the training rules. He is practicing for the disillusionment, dispassion, and cessation of sensual pleasures. He is practicing for the disillusionment, dispassion, and cessation of becoming. He is practicing for the destruction of craving. He is practicing for the destruction of greed. Upon the breakup of the body, after death, he reappears in a certain divine company. Having passed away from there, he is a 'non-comer back', one who will not return to this state of being. This, friends, is called the person bound by external fetters, who is a 'non-comer back', one who will not return to this state of being.”\n\nThen, numerous deities of uniform mind approached the Blessed One; having approached and paid homage to the Blessed One, they stood to one side. Standing to one side, those deities said to the Blessed One: “Venerable sir, the Venerable Sāriputta in the Eastern Park, Migāra’s Mother’s Mansion, is teaching the bhikkhus about the person bound by internal fetters and the person bound by external fetters. Venerable sir, the assembly is delighted. It would be good, Venerable sir, if the Blessed One would approach the Venerable Sāriputta, out of compassion.” The Blessed One consented by silence.\n\nThen the Blessed One, just as a strong man might extend his flexed arm or flex his extended arm, vanished from Jetavana and reappeared in front of the Venerable Sāriputta at the Eastern Park, Migāra’s Mother’s Mansion. The Blessed One sat down on the prepared seat. The Venerable Sāriputta also paid homage to the Blessed One and sat down to one side. The Blessed One said to the Venerable Sāriputta, who was sitting to one side: “Here, Sāriputta, numerous deities of uniform mind approached me; having approached and paid homage to me, they stood to one side. Standing to one side, Sāriputta, those deities said to me: ‘Venerable sir, the Venerable Sāriputta in the Eastern Park, Migāra’s Mother’s Mansion, is teaching the bhikkhus about the person bound by internal fetters and the person bound by external fetters. Venerable sir, the assembly is delighted. It would be good, Venerable sir, if the Blessed One would approach the Venerable Sāriputta, out of compassion.’ Moreover, Sāriputta, those deities—even being ten, twenty, thirty, forty, fifty, or sixty in number—stood in a space no larger than the tip of an awl, yet they did not interfere with one another. It might occur to you, Sāriputta, that ‘surely those deities must have developed their minds in such a way that, being ten, twenty, thirty, forty, fifty, or sixty in number, they stood in a space no larger than the tip of an awl, and yet did not interfere with one another.’ But, Sāriputta, it should not be seen that way. It is right here, Sāriputta, that those deities have developed their minds in such a way that, being ten, twenty, thirty, forty, fifty, or sixty in number, they stood in a space no larger than the tip of an awl, and yet did not interfere with one another. Therefore, Sāriputta, you should train yourselves thus: ‘We will be serene in our faculties and serene in our minds.’ That is how you should train yourselves, Sāriputta.”\n\nIndeed, Sāriputta, for those of you whose faculties are tranquil and whose minds are tranquil, your bodily action will be tranquil, your verbal action will be tranquil, and your mental action will be tranquil. We shall offer a tranquil offering among our fellow practitioners.\n\nTherefore, Sāriputta, you should train yourselves in this way. Indeed, Sāriputta, those ascetics of other persuasions who have not heard this discourse on the Dhamma would be unfortunate.",
      "sinhala": "මා විසින් මෙසේ අසන ලදි. එක් සමයෙක්හි භාග්‍යවතුන් වහන්සේ සැවැත්නුවර ජේතවන නම් වූ අනේපිඬු සිටුහුගේ ආරාමයෙහි වැඩසිටින සේක.\n\nඑකල්හි ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ සැවැත්නුවර පූර්වාරාම නම් වූ මිගාරමාතු ප්‍රාසාදයෙහි වැඩසිටින සේක. එහි දී ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ භික්ෂූන් අමතා “ඇවැත්නි භික්ෂූනි!” යි වදාළ සේක. “ඇවැත්නි!” යි ඒ භික්ෂූහු ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේට පිළිවදන් දුන්හ. ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: “ඇවැත්නි, මම අජ්ඣත්ත සංයෝජන පුග්ගලයාද, බහිද්ධා සංයෝජන පුග්ගලයාද දේශනා කරමි. එය අසන්න, මනාකොට මෙනෙහි කරන්න; මම දේශනා කරන්නෙමි.” “එසේය, ඇවැත්නි!” යි ඒ භික්ෂූහු ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේට පිළිවදන් දුන්හ.\n\nආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ මෙය වදාළ සේක: “ඇවැත්නි, කවරෙක්ද අජ්ඣත්ත සංයෝජන පුග්ගලයා? ඇවැත්නි, මෙහිලා භික්ෂුව සීලවන්ත වෙයි. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, ආචාර සම්පන්න වූයේ, ගෝචර සම්පන්න වූයේ වාසය කරයි. අණුමාත්‍ර වූ වරදක පවා භය දක්නා සුලු වෙයි. ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. හෙතෙම කය බිඳීමෙන් මරණින් මතු එක්තරා දෙව් නිකායයෙක උපදී. හෙතෙම එතැනින් චුත වූයේ ආගාමී වෙයි, මේ භවයට නැවත පැමිණෙන්නේ වෙයි. ඇවැත්නි, මොහු ‘ආගාමී වූ, මේ භවයට පැමිණෙන්නේ වන අජ්ඣත්ත සංයෝජන පුග්ගලයා’ යැයි කියනු ලැබේ.\n\n“ඇවැත්නි, කවරෙක්ද බහිද්ධා සංයෝජන පුග්ගලයා? ඇවැත්නි, මෙහිලා භික්ෂුව සීලවන්ත වෙයි. ප්‍රාතිමෝක්ෂ සංවරයෙන් සංවර වූයේ, ආචාර සම්පන්න වූයේ, ගෝචර සම්පන්න වූයේ වාසය කරයි. අණුමාත්‍ර වූ වරදක පවා භය දක්නා සුලු වෙයි. ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. හෙතෙම එක්තරා ශාන්ත වූ චේතෝවිමුක්තියක් උපදවාගෙන වාසය කරයි. හෙතෙම කය බිඳීමෙන් මරණින් මතු එක්තරා දෙව් නිකායයෙක උපදී. හෙතෙම එතැනින් චුත වූයේ අනාගාමී වෙයි, මේ භවයට නැවත නොපැමිණෙන්නේ වෙයි. ඇවැත්නි, මොහු ‘අනාගාමී වූ, මේ භවයට නොපැමිණෙන්නේ වන බහිද්ධා සංයෝජන පුග්ගලයා’ යැයි කියනු ලැබේ.\n\n“තවද, ඇවැත්නි, භික්ෂුව සීලවන්ත වෙයි... ශික්ෂා පදයන් සමාදන්ව හික්මෙයි. හෙතෙම කාමයන් කෙරෙහිම කලකිරීම පිණිස, නොඇල්ම පිණිස, නැති කිරීම පිණිස පිළිපන්නේ වෙයි. හෙතෙම භවයන් කෙරෙහිම කලකිරීම පිණිස, නොඇල්ම පිණිස, නැති කිරීම පිණිස පිළිපන්නේ වෙයි. හෙතෙම තණ්හාව ක්ෂය කිරීම පිණිස පිළිපන්නේ වෙයි. හෙතෙම ලෝභය ක්ෂය කිරීම පිණිස පිළිපන්නේ වෙයි. හෙතෙම කය බිඳීමෙන් මරණින් මතු එක්තරා දෙව් නිකායයෙක උපදී. හෙතෙම එතැනින් චුත වූයේ අනාගාමී වෙයි, මේ භවයට නැවත නොපැමිණෙන්නේ වෙයි. ඇවැත්නි, මොහු ‘අනාගාමී වූ, මේ භවයට නොපැමිණෙන්නේ වන බහිද්ධා සංයෝජන පුග්ගලයා’ යැයි කියනු ලැබේ.”\n\nඉක්බිති බොහෝ සමචිත්ත දේවතාවෝ භාග්‍යවතුන් වහන්සේ වැඩසිටි තැනට එළඹියහ; එළඹ භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව සිටියහ. එකත්පස්ව සිටි ඒ දේවතාවෝ භාග්‍යවතුන් වහන්සේට මෙය පැවසූහ: “ස්වාමීනි, ඒ ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ පූර්වාරාමයෙහි මිගාරමාතු ප්‍රාසාදයෙහි භික්ෂූන්ට අජ්ඣත්ත සංයෝජන පුග්ගලයාද, බහිද්ධා සංයෝජන පුග්ගලයාද දේශනා කරන සේක. ස්වාමීනි, සභාව ප්‍රීතියට පත් වී ඇත. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට වැඩම කළ මැනව!” භාග්‍යවතුන් වහන්සේ නිශ්ශබ්ද භාවයෙන් එය පිළිගත් සේක.\n\nඉක්බිති භාග්‍යවතුන් වහන්සේ – යම්සේ බලවතෙක් හැකිලූ බාහුව දිග හරින්නේද, දිග හැරී බාහුව හකුලුවා ගන්නේද, එපරිද්දෙන්ම – ජේතවනාරාමයෙන් අතුරුදහන් වී පූර්වාරාමයෙහි මිගාරමාතු ප්‍රාසාදයෙහි ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ ඉදිරියෙහි පහළ වූ සේක. භාග්‍යවතුන් වහන්සේ පනවන ලද ආසනයෙහි වැඩහුන් සේක. ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේද භාග්‍යවතුන් වහන්සේට වන්දනා කොට එකත්පස්ව වැඩහුන් සේක. එකත්පස්ව වැඩසිටි ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේට භාග්‍යවතුන් වහන්සේ මෙය වදාළ සේක: “මෙහිදී, ශ්‍රී‍රීපුත්තය, බොහෝ සමචිත්ත දේවතාවෝ මා වැඩසිටි තැනට එළඹියහ; එළඹ මට වන්දනා කොට එකත්පස්ව සිටියහ. ශ්‍රී‍රීපුත්තය, එකත්පස්ව සිටි ඒ දේවතාවෝ මට මෙය පැවසූහ: ‘ස්වාමීනි, ඒ ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ පූර්වාරාමයෙහි මිගාරමාතු ප්‍රාසාදයෙහි භික්ෂූන්ට අජ්ඣත්ත සංයෝජන පුග්ගලයාද, බහිද්ධා සංයෝජන පුග්ගලයාද දේශනා කරන සේක. ස්වාමීනි, සභාව ප්‍රීතියට පත් වී ඇත. ස්වාමීනි, භාග්‍යවතුන් වහන්සේ අනුකම්පාවෙන් ආයුෂ්මත් ශ්‍රී‍රීපුත්ත ස්ථවිරයන් වහන්සේ වැඩසිටින තැනට වැඩම කළ මැනව!’ ශ්‍රී‍රීපුත්තය, ඒ දේවතාවෝ දස දෙනෙක් වී හෝ, විසි දෙනෙක් වී හෝ, තිස් දෙනෙක් වී හෝ, සතළිස් දෙනෙක් වී හෝ, පනස් දෙනෙක් වී හෝ, සැට දෙනෙක් වී හෝ ඉඳිකටු තුඩක් තරම් තැනක සිටියත්, ඔවුනොවුන්ට බාධා නොකළහ.\n\n“ශ්‍රී‍රීපුත්තය, සමහර විට ඔබට මෙසේ සිතෙන්නට පුළුවන: ‘ඒ දේවතාවන්ගේ සිත් එතැනදී එසේ භාවනා කර තිබෙන්නට ඇත. ඒ නිසාම දස දෙනෙක් වී හෝ, විසි දෙනෙක් වී හෝ, තිස් දෙනෙක් වී හෝ, සතළිස් දෙනෙක් වී හෝ, පනස් දෙනෙක් වී හෝ, සැට දෙනෙක් වී හෝ ඉඳිකටු තුඩක් තරම් තැනක සිටියත්, ඔවුනොවුන්ට බාධා නොකළා’ යැයි. එහෙත් ශ්‍රී‍රීපුත්තය, මෙය එසේ නොදැක්ක යුතුයි. ශ්‍රී‍රීපුත්තය, මේ ආරාමය තුළම ඒ දේවතාවන්ගේ සිත් එසේ භාවනා කර තිබුණි. ඒ නිසාම දස දෙනෙක් වී හෝ... ඔවුනොවුන්ට බාධා නොකළහ. එබැවින්, ශ්‍රී‍රීපුත්තය, “අපි ශාන්ත ඉන්ද්‍රිය ඇති අය වන්නෙමු, ශාන්ත සිත් ඇති අය වන්නෙමු” යැයි මෙසේ හික්මිය යුතුයි. ශ්‍රී‍රීපුත්තය, නුඹලා මෙසේ හික්මිය යුතු වන්නේය.\n\nසා‍රිපුත්තය, යම් ඔබලාගේ ඉන්ද්‍රියයන් ශාන්ත වී ඇත්ද, සිත් ශාන්ත වී ඇත්ද, (එසේ වූ ඔබලාගේ) කාය කර්මයද ශාන්ත වන්නේමය, වචී කර්මයද ශාන්ත වන්නේමය, මනෝ කර්මයද ශාන්ත වන්නේමය. (එසේ වූ අපි) අපගේ සබ්‍රහ්මචාරීන් වෙත ශාන්ත වූ උපහාරම පවත්වන්නෙමු.\n\nසා‍රිපුත්තය, ඔබලා විසින් මෙසේම පුහුණු විය යුතුයි.\n\nසා‍රිපුත්තය, යම් අන්‍ය තීර්ථක පිරිවැජියෝ මේ ධර්ම පර්යාය අසා නැත්ද, (ඔවුන්ට) මෙවන් තත්ත්වයක් කිසිසේත්ම ඇති නොවනු ඇත.",
      "paliTitle": ""
    },
    {
      "number": 38,
      "pali": "Evaṃ me sutaṃ – ekaṃ samayaṃ āyasmā mahākaccāno varaṇāyaṃ viharati bhaddasāritīre [kaddamadahatīre (sī. syā. kaṃ. pī.)]. Atha kho ārāmadaṇḍo brāhmaṇo yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahākaccānena saddhiṃ sammodi. Sammodanīyaṃ kathaṃ sāraṇīyaṃ vītisāretvā ekamantaṃ nisīdi. Ekamantaṃ nisinno kho ārāmadaṇḍo brāhmaṇo āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘ko nu kho, bho kaccāna, hetu ko paccayo yena khattiyāpi khattiyehi vivadanti, brāhmaṇāpi brāhmaṇehi vivadanti, gahapatikāpi gahapatikehi vivadantī’’ti? ‘‘Kāmarāgābhinivesavinibandha [kāmarāgavinivesavinibaddha (sī. syā. kaṃ. pī.)] paligedhapariyuṭṭhānajjhosānahetu kho, brāhmaṇa, khattiyāpi khattiyehi vivadanti, brāhmaṇāpi brāhmaṇehi vivadanti, gahapatikāpi gahapatikehi vivadantī’’ti. ‘‘Ko pana, bho kaccāna, hetu ko paccayo yena samaṇāpi samaṇehi vivadantī’’ti? ‘‘Diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānahetu kho, brāhmaṇa, samaṇāpi samaṇehi vivadantī’’ti. ‘‘Atthi pana, bho kaccāna, koci lokasmiṃ yo imañceva kāmarāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto, imañca diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto’’ti? ‘‘Atthi, brāhmaṇa, lokasmiṃ yo imañceva kāmarāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto, imañca diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto’’ti. ‘‘Ko pana so, bho kaccāna, lokasmiṃ yo imañceva kāgarāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto, imañca diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto’’ti? ‘‘Atthi, brāhmaṇa, puratthimesu janapadesu sāvatthī nāma nagaraṃ. Tattha so bhagavā etarahi viharati arahaṃ sammāsambuddho. So hi, brāhmaṇa, bhagavā imañceva kāmarāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto, imañca diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto’’ti. Evaṃ vutte ārāmadaṇḍo brāhmaṇo uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā dakkhiṇaṃ jāṇumaṇḍalaṃ pathaviyaṃ nihantvā yena bhagavā tenañjaliṃ paṇāmetvā tikkhattuṃ udānaṃ udānesi – ‘‘Namo tassa bhagavato arahato sammāsambuddhassa, namo tassa bhagavato arahato sammāsambuddhassa, namo tassa bhagavato arahato sammāsambuddhassa. Yo hi so bhagavā imañceva kāmarāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto, imañca diṭṭhirāgābhinivesavinibandhapaligedhapariyuṭṭhānajjhosānaṃ samatikkanto’’ti. ‘‘Abhikkantaṃ, bho kaccāna, abhikkantaṃ, bho kaccāna! Seyyathāpi, bho kaccāna, nikkujjitaṃ vā ukkujjeyya, paṭicchannaṃ vā vivareyya, mūḷhassa vā maggaṃ ācikkheyya, andhakāre vā telapajjotaṃ dhāreyya – ‘cakkhumanto rūpāni dakkhantī’ti, evamevaṃ bhotā kaccānena anekapariyāyena dhammo pakāsito. Esāhaṃ, bho kaccāna, taṃ bhavantaṃ gotamaṃ saraṇaṃ gacchāmi dhammañca bhikkhusaṅghañca. Upāsakaṃ maṃ bhavaṃ kaccāno dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "Thus have I heard: On one occasion, the Venerable Mahākaccāna was dwelling in Varaṇā, on the banks of the Bhaddasārī River.\n\nThen the brahmin Ārāmadaṇḍa approached the Venerable Mahākaccāna. Having approached, he exchanged cordial greetings with the Venerable Mahākaccāna. Having concluded the customary and courteous talk, he sat down to one side. As he sat to one side, the brahmin Ārāmadaṇḍa said to the Venerable Mahākaccāna, \"What, good Kaccāna, is the reason, what is the cause by which warriors dispute with warriors, brahmins dispute with brahmins, and householders dispute with householders?\"\n\n\"It is, brahmin, on account of the obsession with, bondage to, entanglement in, being overcome by, and strong attachment to sensual desire that warriors dispute with warriors, brahmins dispute with brahmins, and householders dispute with householders.\"\n\n\"But what, good Kaccāna, is the reason, what is the cause by which ascetics dispute with ascetics?\"\n\n\"It is, brahmin, on account of the obsession with, bondage to, entanglement in, being overcome by, and strong attachment to views that ascetics dispute with ascetics.\"\n\n\"Is there, good Kaccāna, anyone in the world who has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to sensual desire, and has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to views?\"\n\n\"There is, brahmin, someone in the world who has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to sensual desire, and has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to views.\"\n\n\"But who, good Kaccāna, is that one in the world who has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to sensual desire, and has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to views?\"\n\n\"There is, brahmin, a city named Sāvatthī in the eastern regions. There, at present, dwells the Blessed One, the Arahant, the Perfectly Self-Awakened One. Indeed, brahmin, that Blessed One has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to sensual desire, and has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to views.\"\n\nWhen this was said, the brahmin Ārāmadaṇḍa rose from his seat, arranged his outer robe over one shoulder, knelt down on his right knee, clasped his hands in salutation towards the Blessed One, and three times he uttered this exclamation: \"Homage to that Blessed One, the Arahant, the Perfectly Self-Awakened One! Homage to that Blessed One, the Arahant, the Perfectly Self-Awakened One! Homage to that Blessed One, the Arahant, the Perfectly Self-Awakened One! Indeed, that Blessed One has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to sensual desire, and has transcended this obsession with, bondage to, entanglement in, being overcome by, and strong attachment to views!\"\n\n\"Excellent, good Kaccāna! Excellent, good Kaccāna! Just as, good Kaccāna, one might set upright what was overturned, reveal what was hidden, point out the way to one who was lost, or carry a lamp into the darkness so that those with eyes may see forms—even so has the Dhamma been made clear in many ways by you, good Kaccāna. I go for refuge, good Kaccāna, to that Blessed Gotama, to the Dhamma, and to the community of bhikkhus. May you, good Kaccāna, remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "මා විසින් මෙසේ අසන ලදී. එක් සමයෙක්හි ආයුෂ්මත් මහාකච්චාන තෙරණුවෝ වරණා නුවර, භද්දසාර ගංතෙර වැඩවසති. එවිට ආරාමදණ්ඩ නම් බ්‍රාහ්මණයා ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ වැඩසිටි තැනට පැමිණියේය. පැමිණ, ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේ සමඟ සතුටු වූයේය. සතුටු විය යුතු කථා පැවැත්වීමෙන් පසු එකත්පසෙකින් වාඩි විය.\n\nඑකත්පසෙකින් වාඩි වී සිටි ආරාමදණ්ඩ බ්‍රාහ්මණයා ආයුෂ්මත් මහාකච්චාන තෙරුන් වහන්සේට මෙසේ කීවේය: ‘‘කච්චාන මහත්මය, කුමක්ද මේ හේතුව? කුමක්ද මේ ප්‍රත්‍යය? යමක් නිසා ක්ෂත්‍රියයෝද ක්ෂත්‍රියයන් සමඟ කලහ කරත්ද, බ්‍රාහ්මණයෝද බ්‍රාහ්මණයන් සමඟ කලහ කරත්ද, ගෘහපතියෝද ගෘහපතීන් සමඟ කලහ කරත්ද?” ‘‘බ්‍රාහ්මණය, කාමරාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන මේ හේතු නිසාම ක්ෂත්‍රියයෝද ක්ෂත්‍රියයන් සමඟ කලහ කරත්, බ්‍රාහ්මණයෝද බ්‍රාහ්මණයන් සමඟ කලහ කරත්, ගෘහපතියෝද ගෘහපතීන් සමඟ කලහ කරත්.” ‘‘කච්චාන මහත්මය, කුමක්ද මේ හේතුව? කුමක්ද මේ ප්‍රත්‍යය? යමක් නිසා ශ්‍රමණයෝද ශ්‍රමණයන් සමඟ කලහ කරත්ද?” ‘‘බ්‍රාහ්මණය, දෘෂ්ටි රාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන මේ හේතු නිසාම ශ්‍රමණයෝද ශ්‍රමණයන් සමඟ කලහ කරත්.”\n\n‘‘කච්චාන මහත්මය, මේ ලෝකයෙහි කවරකු හෝ සිටීද, යමෙක් මේ කාමරාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද, මේ දෘෂ්ටි රාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද සම්පූර්ණයෙන් ඉක්මවා ගියේ වේද?” ‘‘බ්‍රාහ්මණය, මේ ලෝකයෙහි කෙනෙක් සිටී, යමෙක් මේ කාමරාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද, මේ දෘෂ්ටි රාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද සම්පූර්ණයෙන් ඉක්මවා ගියේ වේ.”\n\n‘‘කච්චාන මහත්මය, එසේනම් මේ ලෝකයෙහි කවරෙක්ද, යමෙක් මේ කාමරාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද, මේ දෘෂ්ටි රාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද සම්පූර්ණයෙන් ඉක්මවා ගියේ වේ?” ‘‘බ්‍රාහ්මණය, නැගෙනහිර දිසාවෙහි ජනපදයන්හි සැවැත් නුවර නම් නගරයක් ඇත. එහි දැන් භාග්‍යවත් වූ අරහත් සම්මාසම්බුදුරජාණන් වහන්සේ වැඩවසන සේක. බ්‍රාහ්මණය, ඒ භාග්‍යවතුන් වහන්සේම මේ කාමරාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද, මේ දෘෂ්ටි රාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද සම්පූර්ණයෙන් ඉක්මවා ගියේ වේ.”\n\nමෙසේ පැවසූ කල්හි ආරාමදණ්ඩ බ්‍රාහ්මණයා හුනසුනෙන් නැගිට, උතුරුසළුව එක අතකින් කර මත තබාගෙන, දකුණු දණහිස පොළොව මත තබා, භාග්‍යවතුන් වහන්සේ වැඩසිටින දිසාවට ඇඳිලි බැඳ, තුන් වරක් මෙසේ උදන් ඇසුවේය: ‘‘ඒ භාග්‍යවත්, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා! ඒ භාග්‍යවත්, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා! ඒ භාග්‍යවත්, අරහත්, සම්මාසම්බුදුරජාණන් වහන්සේට නමස්කාර වේවා! යම් ඒ භාග්‍යවතුන් වහන්සේ මේ කාමරාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද, මේ දෘෂ්ටි රාගය, එහි ඇලීම, බැඳී සිටීම, හිරවීම, දැඩි ලෙස ග්‍රහණය කරගෙන සිටීම යන සියල්ලද සම්පූර්ණයෙන් ඉක්මවා ගියේ වේද!”\n\n‘‘කච්චාන මහත්මය, අතිශයින් ශ්‍රේෂ්ඨයි, කච්චාන මහත්මය, අතිශයින් ශ්‍රේෂ්ඨයි! කච්චාන මහත්මය, යම් සේ යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තිබූ දෙයක් විවෘත කරන්නේද, මඟ වැරදුන කෙනෙකුට මාර්ගය පෙන්වන්නේද, අන්ධකාරයෙහි ‘ඇස් ඇති අයට රූප පෙනේවා’ යි තෙල් පහනක් දල්වන්නේද, එපරිද්දෙන්ම කච්චාන මහත්මයා විසින් නොයෙක් අයුරින් ධර්මය ප්‍රකාශ කරන ලදී. කච්චාන මහත්මය, මම ඒ භවත් ගෞතමයන් වහන්සේද, ධර්මයද, භික්ෂු සංඝයාද සරණ යමි. කච්චාන මහත්මය, මා අද පටන් දිවි හිමියෙන් සරණ ගිය උපාසකයෙකු ලෙස පිළිගන්නා සේක්වා!”",
      "paliTitle": ""
    },
    {
      "number": 39,
      "pali": "Ekaṃ samayaṃ āyasmā mahākaccāno madhurāyaṃ viharati gundāvane. Atha kho kandarāyano [kaṇḍarāyano (sī. syā. kaṃ. pī.)] brāhmaṇo yenāyasmā mahākaccāno tenupasaṅkami; upasaṅkamitvā āyasmatā mahākaccānena saddhiṃ…pe… ekamantaṃ nisinno kho kandarāyano brāhmaṇo āyasmantaṃ mahākaccānaṃ etadavoca – ‘‘sutaṃ metaṃ, bho kaccāna, ‘na samaṇo kaccāno brāhmaṇe jiṇṇe vuddhe mahallake addhagate vayoanuppatte abhivādeti vā paccuṭṭheti vā āsanena vā nimantetī’ti. Tayidaṃ, bho kaccāna, tatheva? Na hi bhavaṃ kaccāno brāhmaṇe jiṇṇe vuddhe mahallake addhagate vayoanuppatte abhivādeti vā paccuṭṭheti vā āsanena vā nimanteti. Tayidaṃ, bho kaccāna, na sampannamevā’’ti. ‘‘Atthi, brāhmaṇa, tena bhagavatā jānatā passatā arahatā sammāsambuddhena vuddhabhūmi ca akkhātā daharabhūmi ca. Vuddho cepi, brāhmaṇa, hoti āsītiko vā nāvutiko vā vassasatiko vā jātiyā, so ca kāme paribhuñjati kāmamajjhāvasati kāmapariḷāhena pariḍayhati kāmavitakkehi khajjati kāmapariyesanāya ussuko. Atha kho so bālo na therotveva saṅkhyaṃ gacchati. Daharo cepi, brāhmaṇa, hoti yuvā susukāḷakeso bhadrena yobbanena samannāgato paṭhamena vayasā. So ca na kāme paribhuñjati na kāmamajjhāvasati, na kāmapariḷāhena pariḍayhati, na kāmavitakkehi khajjati, na kāmapariyesanāya ussuko. Atha kho so paṇḍito therotveva saṅkhyaṃ gacchatī’’ti. Evaṃ vutte kandarāyano brāhmaṇo uṭṭhāyāsanā ekaṃsaṃ uttarāsaṅgaṃ karitvā daharānaṃ sataṃ [sudaṃ (sī. syā. kaṃ. pī.)] bhikkhūnaṃ pāde sirasā vandati – ‘‘vuddhā bhavanto, vuddhabhūmiyaṃ ṭhitā. Daharā mayaṃ, daharabhūmiyaṃ ṭhitā’’ti. ‘‘Abhikkantaṃ, bho kaccāna…pe… upāsakaṃ maṃ bhavaṃ kaccāno dhāretu ajjatagge pāṇupetaṃ saraṇaṃ gata’’nti.",
      "english": "On one occasion, the venerable Mahākaccāna was dwelling in Madhurā, in the Gundāvana. Then the brahmin Kandarāyano approached the venerable Mahākaccāna; having approached, he exchanged greetings and polite conversation, then sat down to one side. Having sat down, the brahmin Kandarāyano said to the venerable Mahākaccāna: \"I have heard this, good Kaccāna, that 'the ascetic Kaccāna does not greet, nor rise for, nor invite with a seat, brahmins who are old, venerable, greatly aged, advanced in years, or who have reached their full span of life.' Is this true, good Kaccāna? Indeed, Master Kaccāna does not greet, nor rise for, nor invite with a seat, brahmins who are old, venerable, greatly aged, advanced in years, or who have reached their full span of life. This, good Kaccāna, is not proper at all.\"\n\n\"Brahmin, by that Blessed One, the Knower, the Seer, the Arahant, the Perfectly Self-Awakened One, the state of elderliness has been declared, as well as the state of youthfulness. And brahmin, even if someone is old, eighty, ninety, or a hundred years of age by birth, and he indulges in sensual pleasures, dwells amidst sensual pleasures, is consumed by the fever of sensual pleasures, is devoured by thoughts of sensual pleasures, and is eager in the search for sensual pleasures – then that foolish person is not reckoned as 'elderly'. And brahmin, even if someone is young, youthful, with jet-black hair, endowed with auspicious youth, and in the prime of life, and he does not indulge in sensual pleasures, does not dwell amidst sensual pleasures, is not consumed by the fever of sensual pleasures, is not devoured by thoughts of sensual pleasures, and is not eager in the search for sensual pleasures – then that wise person is reckoned as 'elderly'.\"\n\nWhen this was said, the brahmin Kandarāyano rose from his seat, arranged his outer robe over one shoulder, and bowed his head at the feet of a hundred young monks, saying: \"Venerables, you are indeed elderly, standing in the state of elderliness. We are young, standing in the state of youthfulness.\" Then Kandarāyano said to the venerable Mahākaccāna: \"Excellent, good Kaccāna! Just as one might set upright what has been overturned, or reveal what has been hidden, or point out the way to one who is lost, or bring a lamp into the darkness so that those with eyes can see forms, in the same way has the Dhamma been made clear in many ways by Master Kaccāna. I go to Master Kaccāna for refuge, to the Dhamma for refuge, and to the Sangha for refuge. May Master Kaccāna remember me as a lay follower who has gone for refuge from this day forth, for as long as life lasts.\"",
      "sinhala": "එක් සමයෙක ආයුෂ්මත් මහාකච්චාන තෙරණුවෝ මධුරා නුවර ගුණ්ඩාවනාරාමයේ වැඩසිටියාහ. එසමයෙහි කන්දරායන බ්‍රාහ්මණයා ආයුෂ්මත් මහාකච්චාන තෙරණුවන් වැඩසිටි තැනට පැමිණියේය. පැමිණ, ආයුෂ්මත් මහාකච්චාන තෙරණුවන් සමඟ සතුටු සාකච්ඡා කොට, සුහද කථා බස් හුවමාරු කරගෙන, එක් පසෙක වාඩිවී ආයුෂ්මත් මහාකච්චාන තෙරණුවන්ට මෙය පැවසීය: \"භවත් කච්චාන, 'ශ්‍රමණ කච්චාන මහලු, වෘද්ධ, වියපත්, කල්ගතවූ, වයසට පැමිණි බ්‍රාහ්මණයන් වැඳීම හෝ හිටගෙන පිළිගැනීම හෝ ආසනයකින් ආරාධනා කිරීම හෝ නොකරන්නේය' කියා මම අසා ඇත්තෙමි. භවත් කච්චාන, එය එසේමද? භවත් කච්චාන මහලු, වෘද්ධ, වියපත්, කල්ගතවූ, වයසට පැමිණි බ්‍රාහ්මණයන් වැඳීම හෝ හිටගෙන පිළිගැනීම හෝ ආසනයකින් ආරාධනා කිරීම හෝ ඇත්තෙන්ම නොකරයි. භවත් කච්චාන, එය එතරම් සුදුසු දෙයක් නොවේ\" යැයි කීය.\n\n\"බ්‍රාහ්මණ, දන්නා වූ, දක්නා වූ, අරහත් වූ, සම්මාසම්බුද්ධ වූ ඒ භාග්‍යවතුන් වහන්සේ විසින් වෘද්ධ භූමියද (ඥානවෘද්ධ බවේ ස්වභාවයද), දහර භූමියද (ළදරු බවේ ස්වභාවයද) ප්‍රකාශ කරන ලද්දේය. බ්‍රාහ්මණ, යමෙක් උපතින් අසූ හැවිරිදි හෝ අනූ හැවිරිදි හෝ සියක් හැවිරිදි හෝ වූ වෘද්ධයෙක් වුවද, ඔහු කාමයන් පරිභෝග කරන්නේ නම්, කාමයන් මැද වාසය කරන්නේ නම්, කාමයන්ගේ දැවිල්ලෙන් දැවෙන්නේ නම්, කාම විතර්කයන්ගෙන් පීඩා විඳින්නේ නම්, කාමයන් සෙවීමේ උත්සාහයෙන් යුක්ත නම්, එසේනම්, ඔහු බාලයෙකු ලෙස සලකනු ලබයි; ථේරයෙකු (ඥානවෘද්ධයෙකු) ලෙස නොගැනේ. බ්‍රාහ්මණ, යමෙක් දහර (ළාබාල) වුවද, යෞවනයෙකු නම්, අලංකාර කළු කෙස් ඇති නම්, ශෝභන යෞවනයෙන් යුක්ත නම්, ජීවිතයේ පළමු වියෙහි සිටී නම්, ඔහු කාමයන් පරිභෝග නොකරන්නේ නම්, කාමයන් මැද වාසය නොකරන්නේ නම්, කාමයන්ගේ දැවිල්ලෙන් නොදැවෙන්නේ නම්, කාම විතර්කයන්ගෙන් පීඩා නොවිඳින්නේ නම්, කාමයන් සෙවීමේ උත්සාහයෙන් යුක්ත නොවේ නම්, එසේනම්, ඔහු පණ්ඩිතයෙකු ලෙස සලකනු ලබයි; ථේරයෙකු (ඥානවෘද්ධයෙකු) ලෙස ගණන්ගනු ලබයි\" යැයි කීය.\n\nමෙලෙස පැවසූ විට, කන්දරායන බ්‍රාහ්මණයා ආසනයෙන් නැගිට, එක් උරහිසක් වැසෙන සේ උතුරුසළුව පොරවාගෙන, එහි සිටි ළාබාල භික්ෂූන් සිය දෙනෙකුගේ පාද හිසින් වැන්දේය. \"භවත්නි, ඔබ වහන්සේලා වෘද්ධයෝය, වෘද්ධ භූමියේ (ඥානවෘද්ධ බවේ) පිහිටා සිටින්නෝය. අපි ළාබාලයෝය, දහර භූමියේ (අඥාන බවේ) පිහිටා සිටින්නෝය\" යැයි කීය. \"භවත් කච්චාන, ඉතා යහපති! ඉතා ශ්‍රේෂ්ඨයි! යම් සේ යමෙක් යටිකුරු කළ දෙයක් උඩුකුරු කරන්නේද, වසා තැබූ දෙයක් විවෘත කරන්නේද, මංමුළා වූවෙකුට මඟ පෙන්වන්නේද, ඇස් ඇති අයට රූප දැකගැනීම පිණිස අන්ධකාරයේ තෙල් පහනක් දල්වන්නේද, එලෙසම ඔබ වහන්සේ විසින් නොයෙක් අයුරින් ධර්මය පැහැදිලි කරන ලදී. භවත් කච්චාන, අද පටන් දිවි හිමියෙන් තෙරුවන් සරණ ගිය උපාසකයෙකු ලෙස මා සිහි තබාගන්නා සේක්වා!\"",
      "paliTitle": ""
    },
    {
      "number": 40,
      "pali": "‘‘Yasmiṃ, bhikkhave, samaye corā balavanto honti, rājāno tasmiṃ samaye dubbalā honti. Tasmiṃ, bhikkhave, samaye rañño na phāsu hoti atiyātuṃ vā niyyātuṃ vā paccantime vā janapade anusaññātuṃ. Brāhmaṇagahapatikānampi tasmiṃ samaye na phāsu hoti atiyātuṃ vā niyyātuṃ vā bāhirāni vā kammantāni paṭivekkhituṃ. Evamevaṃ kho, bhikkhave, yasmiṃ samaye pāpabhikkhū balavanto honti, pesalā bhikkhū tasmiṃ samaye dubbalā honti. Tasmiṃ, bhikkhave, samaye pesalā bhikkhū tuṇhībhūtā tuṇhībhūtāva saṅghamajjhe saṅkasāyanti [saṅkamma jhāyanti (ka.), sañcāyanti (sī. aṭṭha.)] paccantime vā janapade acchanti [bhajanti (sī. syā. kaṃ. pī.)]. Tayidaṃ, bhikkhave, hoti bahujanāhitāya bahujanāsukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. ‘‘Yasmiṃ, bhikkhave, samaye rājāno balavanto honti, corā tasmiṃ samaye dubbalā honti. Tasmiṃ, bhikkhave, samaye rañño phāsu hoti atiyātuṃ vā niyyātuṃ vā paccantime vā janapade anusaññātuṃ. Brāhmaṇagahapatikānampi tasmiṃ samaye phāsu hoti atiyātuṃ vā niyyātuṃ vā bāhirāni vā kammantāni paṭivekkhituṃ. Evamevaṃ kho, bhikkhave, yasmiṃ samaye pesalā bhikkhū balavanto honti, pāpabhikkhū tasmiṃ samaye dubbalā honti. Tasmiṃ, bhikkhave, samaye pāpabhikkhū tuṇhībhūtā tuṇhībhūtāva saṅghamajjhe saṅkasāyanti, yena vā pana tena pakkamanti [papatanti (sī. syā. kaṃ. pī.)]. Tayidaṃ, bhikkhave, hoti bahujanahitāya bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussāna’’nti.",
      "english": "Monks, in a time when bandits are strong, kings are weak in that time. In that time, monks, it is not safe for kings to go forth or come back, or to inspect the border regions. Even for brahmins and householders, in that time, it is not safe to go forth or come back, or to attend to their external affairs. Just so, monks, in a time when monks of bad conduct are strong, virtuous monks are weak in that time. In that time, monks, virtuous monks, becoming silent, remain silent within the Sangha, and they shrink away or reside in remote regions. This, monks, is for the harm of many people, for the unhappiness of many people; it is for the detriment, disadvantage, and suffering of many people, of gods and humans.\n\nMonks, in a time when kings are strong, bandits are weak in that time. In that time, monks, it is safe for kings to go forth or come back, or to inspect the border regions. Even for brahmins and householders, in that time, it is safe to go forth or come back, or to attend to their external affairs. Just so, monks, in a time when virtuous monks are strong, monks of bad conduct are weak in that time. In that time, monks, monks of bad conduct, becoming silent, remain silent within the Sangha, and they depart wherever they please. This, monks, is for the welfare of many people, for the happiness of many people; it is for the advantage, benefit, and well-being of many people, of gods and humans.",
      "sinhala": "භික්ෂූනි, යම් කලෙක සොරු බලවත් වෙත් ද, ඒ කලෙක රජවරු දුර්වල වෙති. භික්ෂූනි, ඒ කලෙක රජුට (කොහේ හෝ) යාමට හෝ පිටවී යෑමට හෝ දේශසීමා ආසන්න ප්‍රදේශ පිරික්සීමට හෝ පහසු නොවේ. ඒ කලෙක බ්‍රාහ්මණ ගෘහපතියන්ටද යාමට හෝ පිටවී යෑමට හෝ බාහිර කර්මාන්ත (කෘෂිකාර්මික හා වාණිජ කටයුතු) පිරික්සීමට හෝ පහසු නොවේ. භික්ෂූනි, එලෙසින්ම, යම් කලෙක පාපී භික්ෂූහු බලවත් වෙත් ද, ඒ කලෙක පින්වත් භික්ෂූහු දුර්වල වෙති. භික්ෂූනි, ඒ කලෙක පින්වත් භික්ෂූහු සංඝයා මැද නිහඬවම කිසිවක් නොකර සිටිති, නැතහොත් දේශසීමා ආසන්න ප්‍රදේශවල වාසය කරති. භික්ෂූනි, මේ කරුණ බොහෝ දෙනාට අහිත පිණිස, බොහෝ දෙනාට අසතුට පිණිස, දෙවි මිනිසුන්ගේ බොහෝ දෙනාගේ අනර්ථය පිණිස, අහිත පිණිස, දුක පිණිසම වේ.\n\nභික්ෂූනි, යම් කලෙක රජවරු බලවත් වෙත් ද, ඒ කලෙක සොරු දුර්වල වෙති. භික්ෂූනි, ඒ කලෙක රජුට (කොහේ හෝ) යාමට හෝ පිටවී යෑමට හෝ දේශසීමා ආසන්න ප්‍රදේශ පිරික්සීමට හෝ පහසු වේ. ඒ කලෙක බ්‍රාහ්මණ ගෘහපතියන්ටද යාමට හෝ පිටවී යෑමට හෝ බාහිර කර්මාන්ත (කෘෂිකාර්මික හා වාණිජ කටයුතු) පිරික්සීමට හෝ පහසු වේ. භික්ෂූනි, එලෙසින්ම, යම් කලෙක පින්වත් භික්ෂූහු බලවත් වෙත් ද, ඒ කලෙක පාපී භික්ෂූහු දුර්වල වෙති. භික්ෂූනි, ඒ කලෙක පාපී භික්ෂූහු සංඝයා මැද නිහඬවම කිසිවක් නොකර සිටිති, නැතහොත් කොහේ හෝ තැනකට පිටත්ව යති. භික්ෂූනි, මේ කරුණ බොහෝ දෙනාට හිත පිණිස, බොහෝ දෙනාට සතුට පිණිස, දෙවි මිනිසුන්ගේ බොහෝ දෙනාගේ අර්ථය පිණිස, හිත පිණිස, සතුට පිණිසම වේ.",
      "paliTitle": ""
    },
    {
      "number": 41,
      "pali": "‘‘Dvinnāhaṃ, bhikkhave, micchāpaṭipattiṃ na vaṇṇemi, gihissa vā pabbajitassa vā. Gihī vā, bhikkhave, pabbajito vā micchāpaṭipanno micchāpaṭipattādhikaraṇahetu na ārādhako hoti ñāyaṃ dhammaṃ kusalaṃ. ‘‘Dvinnāhaṃ, bhikkhave, sammāpaṭipattiṃ vaṇṇemi, gihissa vā pabbajitassa vā. Gihī vā, bhikkhave, pabbajito vā sammāpaṭipanno sammāpaṭipattādhikaraṇahetu ārādhako hoti ñāyaṃ dhammaṃ kusala’’nti.",
      "english": "Monks, I do not commend wrong practice in either of two types of persons: a layperson or one gone forth. Monks, whether a layperson or one gone forth, if they engage in wrong practice, then due to that engagement in wrong practice, they do not succeed in realizing the true method, the Dhamma, the wholesome.\n\nMonks, I commend right practice in either of two types of persons: a layperson or one gone forth. Monks, whether a layperson or one gone forth, if they engage in right practice, then due to that engagement in right practice, they do succeed in realizing the true method, the Dhamma, the wholesome.",
      "sinhala": "භික්ෂූණි, මම ගිහියාගේ හෝ පැවිද්දාගේ හෝ යන දෙදෙනාගේම මිත්‍යාප්U+200Dරතිපදාව වර්ණනා නොකරමි. භික්ෂූණි, ගිහියෙක් හෝ පැවිද්දෙක් හෝ මිත්‍යාප්U+200Dරතිපදාවේ පිහිටියේ නම්, මිත්‍යාප්U+200Dරතිපදාව හේතුකොටගෙන කුසල ධර්මය වන නිවන් මඟට ළඟා නොවේ.\n\nභික්ෂූණි, මම ගිහියාගේ හෝ පැවිද්දාගේ හෝ යන දෙදෙනාගේම සම්මාප්U+200Dරතිපදාව වර්ණනා කරමි. භික්ෂූණි, ගිහියෙක් හෝ පැවිද්දෙක් හෝ සම්මාප්U+200Dරතිපදාවේ පිහිටියේ නම්, සම්මාප්U+200Dරතිපදාව හේතුකොටගෙන කුසල ධර්මය වන නිවන් මඟට ළඟා වේ.",
      "paliTitle": ""
    },
    {
      "number": 42,
      "pali": "‘‘Ye te, bhikkhave, bhikkhū duggahitehi suttantehi byañjanappatirūpakehi atthañca dhammañca paṭivāhanti te, bhikkhave, bhikkhū bahujanāhitāya paṭipannā bahujanāsukhāya, bahuno janassa anatthāya ahitāya dukkhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū apuññaṃ pasavanti, te cimaṃ saddhammaṃ antaradhāpenti. ‘‘Ye te, bhikkhave, bhikkhū suggahitehi suttantehi byañjanappatirūpakehi atthañca dhammañca anulomenti te, bhikkhave, bhikkhū bahujanahitāya paṭipannā bahujanasukhāya, bahuno janassa atthāya hitāya sukhāya devamanussānaṃ. Bahuñca te, bhikkhave, bhikkhū puññaṃ pasavanti, te cimaṃ saddhammaṃ ṭhapentī’’ti. ",
      "english": "Monks, those bhikkhus who, having wrongly grasped discourses whose expression is a mere resemblance, distort the meaning and the Dhamma—those bhikkhus, monks, are practicing for the harm of many people, for the unhappiness of many people, for the unbenefit, diswelfare, and suffering of many people, of devas and humans. And those bhikkhus, monks, generate much demerit; they cause this True Dhamma to disappear.\n\nMonks, those bhikkhus who, having rightly grasped discourses whose expression is a mere resemblance, make the meaning and the Dhamma conform—those bhikkhus, monks, are practicing for the benefit of many people, for the happiness of many people, for the welfare, advantage, and happiness of many people, of devas and humans. And those bhikkhus, monks, generate much merit; they establish this True Dhamma.",
      "sinhala": "මහණෙනි, යම් ඒ භික්ෂූහු වැරදි ලෙස ග්‍රහණය කරගත්, ව්‍යංජනයෙන් (වචන සැකැස්මෙන්) සද්ධර්ම‍යට ප්‍රතිරූපක වූ සූත්‍ර පාඨ මඟින් අර්ථයද ධර්ම‍යද පටහැනි කරත්ද, මහණෙනි, ඒ භික්ෂූහු බොහෝ ජනයාට අහිත පිණිස, බොහෝ ජනයාට අසුඛ පිණිස, බොහෝ ජනයාට අනර්ථය පිණිස, අහිත පිණිස, දුක් පිණිස, දෙවිමිනිසුන්ගේ අහිත පිණිස, දුක් පිණිස පිළිපදින්නාහ. මහණෙනි, ඒ භික්ෂූහු බොහෝ අකුසල් රැස් කරගනිත්. ඔවුහු මේ සද්ධර්ම‍ය අන්තර්ධාන කරත්.\n\nමහණෙනි, යම් ඒ භික්ෂූහු මනා ලෙස ග්‍රහණය කරගත්, ව්‍යංජනයෙන් (වචන සැකැස්මෙන්) සද්ධර්ම‍යට අනුකූල වූ සූත්‍ර පාඨ මඟින් අර්ථයද ධර්ම‍යද අනුලෝම කරත්ද, මහණෙනි, ඒ භික්ෂූහු බොහෝ ජනයාට හිත පිණිස, බොහෝ ජනයාට සුව පිණිස, බොහෝ ජනයාට අර්ථය පිණිස, හිත පිණිස, සුව පිණිස, දෙවිමිනිසුන්ගේ අර්ථය පිණිස, හිත පිණිස, සුව පිණිස පිළිපදින්නාහ. මහණෙනි, ඒ භික්ෂූහු බොහෝ කුසල් රැස් කරගනිත්. ඔවුහු මේ සද්ධර්ම‍ය පිහිටුවත්.",
      "paliTitle": ""
    }
  ],
  "footer": {
    "pali": "Samacittavaggo catuttho.",
    "english": "",
    "sinhala": ""
  }
}